{
  "source_id": "太上导引三光九变妙经",
  "source_file": "chunked_daozang\\太上导引三光九变妙经.json",
  "total_chunks": 2,
  "total_original_chars": 1757,
  "total_translated_chars": 11507,
  "total_translation_time": 53.26434803009033,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\本文类\\太上导引三光九变妙经.txt",
    "category": "本文类"
  },
  "full_translation": "**The Supreme Daoist Scripture on Guiding and Absorbing the Three Luminaries’ Precious True Wonders**\n\n**Scripture Title:** *The Supreme Cavernous Mystery Numinous Treasure Scripture on Guiding and Absorbing the Three Luminaries’ Wonders*. Author unknown. Likely composed during the Northern and Southern Dynasties. Not recorded in the *Catalogue of Numinous Treasure Scriptures*. Originally one scroll. The *Daoist Canon of the Zhengtong Era* divides it into two texts: *The Supreme Scripture on Guiding and Absorbing the Three Luminaries’ Precious True Wonders* and *The Supreme Scripture on Guiding and Absorbing the Nine Transformations of the Three Luminaries’ Wonders*, both included in the *Dongzhen* section under the category of *Original Texts*. Here, they are combined as one.\n\n---\n\nAt that time, the Celestial Worthy of Primordial Beginning resided in the Vermilion Radiance Realm of the Crimson Clarity World, within the Bright Rosy Cloud Palace of the Vermilion Phoenix City, seated upon the Vermilion Qi Cinnabar Flower Hall. Together with the Great Saints of the Heavens, the Perfected and Venerable Divinities, the Five Elderly Thearchs, the Golden Watchtower’s Posterior Sages, the Three Pristine Origins of the Ultimate, the Lofty and Exalted, the Grand August of Eastern Florescence, the Golden Mother of Western Numinosity, the Thirty-Two Heavenly Thearchs, the Eighty-One Heavenly Lords, the Mystic Harmonious Numinous Consorts, the Radiant Jade Maidens, and an innumerable host, they calibrated the celestial origins, governed the great calamities, assessed the kalpas’ fortunes, and consulted the registers of the Three Origins to deliver all beings.\n\nThe Three Realms and Nine Netherworlds, the sunken and hidden kinds, myriad spirits rejoiced, all beholding the Dharma-gate. Hell was stilled, the Eight Obscurities brightened, chronic ailments dissolved, sinful records expunged. Those who glimpsed the celestial radiance all received great blessings.\n\nIn the boundless worlds of the ten directions, by the majestic power of the Dao, all arrived in an instant. Suddenly, from the farthest reaches of the eastern and western extremes, a wondrous light ascended to illuminate the firmament, entering the Dharma assembly. Its nine hues were resplendent and ethereal, dazzling and fresh, radiant and fragrant—too brilliant to gaze upon directly.\n\nThen came the Heavenly Lords and Thearchs, Perfected and Immortals, Jade Maidens and Jade Lads, and the retinues of heavenly beings. Their necks bore circular halos, their feet trod upon lotus blossoms. They filled the two directions and arrived as one. Having entered the Dharma assembly, they paid homage to the Celestial Worthy, burned incense, scattered flowers, and made offerings in reverence.\n\nWhen the ritual was complete, each returned to their respective places, sitting to the left and right in their proper ranks. Then the Perfected raised the tally, the Divine Kings wielded banners, celestial music and aerial hymns resounded in myriad forms, shaking heaven and earth with indescribable joy.\n\nBefore the assembly had fully settled, the Perfected of Universal Virtue and Wondrous Conduct arose from his seat. With composed and graceful steps, he approached the Dao. Bowing deeply, he addressed the Celestial Worthy: \"In this assembly, there are two hosts from the east and west, their forms and spirits outstanding, their appearances dignified and majestic, their movements refined and poised. Their wondrous light shines brilliantly. By what method do they cultivate? From which master do they receive teachings? By what karmic conditions have they attained this rank? We humbly request your instruction, that we may hear what has not been heard before.\"\n\nThe Celestial Worthy replied: \"Universal Virtue and Wondrous Conduct, you have attained the rank of Upper Perfected, having traversed countless kalpas. The lineages of sacred ranks, the stages of Perfected fruition, the inner and outer, the high and low, the shallow and profound practices—you have thoroughly perceived them all, with nothing left unexamined. You should also be fully aware of the cultivation of these two hosts. Your question arises because within this assembly, there are young Perfected and newly ascended Immortals whose practice is not yet extensive. Seeing these arriving hosts, they harbor silent doubts. You wish to reveal their cultivation, illuminating later learners, and thus you ask, broadly benefiting future generations by expounding this wondrous gate and establishing great Dharma merit. Such a mind of vast universality is inconceivable. Return to your seat and listen carefully; I shall now explain to you.\n\nThe transformation of the Great Dao precedes all precedence. It is neither existent nor non-existent, utterly profound and quiescent, beyond sound and form, neither form nor emptiness. Subtle and wondrous, mysterious and deep, without end or beginning, it gradually manifests its transformative work, unfolding generation and completion.\n\nWithin the primordial void’s profound stillness, the Dao’s qi first divided, faintly revealing signs of form. Clear and turbid diverged: the clear floated to become Heaven, the turbid congealed to become Earth. The two qi separated, yielding one yin and one yang. The utmost essence of yin and yang coalesced into the sun and moon. Yang culminates in nine: the sun contains nine rays. Yin culminates in ten: the moon divides into ten hues. The moon is swift and restless; the sun is leisurely and unhurried. The moon regulates completion; the sun governs generation and transformation. The two images alternate, illuminating the center, while the myriad things respond and transform below.\n\nMoreover, the qi of the two images coalesces, the sun and moon divide their essences, scattering to become the stars, settling to become rivers and mountains. The Five Stars and Five Dipper constellations interlace in the heavens, establishing the fundamental principles and governing the hidden and manifest. No thing, great or small, escapes their influence.\n\nWithin the sun, moon, and stars, each has its palaces and halls, with rulers, ministers, and officials overseeing their duties. The ranks of Immortals and divine officials, the functionaries of sin and fortune—all are arrayed within, with nothing left unassigned. Among these officials, some are born of innate qi, some ascend through accumulated merit, some attain their ranks through cultivation and learning. Collectively, they are called the Three Luminaries, corresponding to the Dao’s transformative workings.\n\nEach possesses natural jade scripts and the writings of the Eight Assemblies, concealed within the Three Palaces, never before transmitted to the world. Now, I shall bestow them upon you to transform and deliver the multitudes.\n\nThis is called *Guiding and Absorbing the Three Luminaries, Serving and Commanding the True Qi*. Follow the precepts, receive it through covenant, and practice according to the method. After eighteen years, your merit will be complete, and you will attain the Dao. Your qi will merge with the Dao, and your lifespan will be boundless.\n\nThe people of these two directions have long cultivated this Dao. Their merit fulfilled and virtue perfected, their forms and spirits ascend together, dwelling in the palaces of the Three Luminaries as their attendants. Their forms and appearances shine brilliantly, their radiance flourishing and abundant, distinct from the host of Immortals and Transcendents. If they accumulate merit without cease and advance through the ranks, from the lower Immortals of the Three Luminaries, they too may ascend to sacred positions, their affairs entirely identical to those who cultivate the Three Caverns.\n\nThis method existed in the boundless kalpas of antiquity, in the vast and distant past, simultaneously transforming the heavens alongside the Sacred Teachings of the Jade Clarity. The Two Observances and Three Vehicles are equal, without distinction. Do not harbor doubts about the Great Dao.\"\n\nThen the command was given to the Minister of Scriptures, the Grand Scribe of Guarded Perfection, the Supervisor of Covenants and Registrar, the officials of the Mystic Upper Offices, the Four Jade Bureaus, and their subordinate officers to open the Morning Radiance Treasure Hall, present the Cinnabar-Light Jade Casket, and reveal the *Upper Chapters of the Three Luminaries*, the *Jade Scripts of the Eight Heavens*, the *Nine Transformations and Eight Assemblies*, and the *Profound and Wondrous Cavern Chapters*. Following the *Bright Statutes of the Four Poles*, these were conferred upon the Wondrous Conduct of Universal Virtue.\n\nAll the heavens in their stations, the ten thousand sages in arrayed ritual, the Four Offices of the Three Realms—all gazed upon the spectacle. Thereupon, Wondrous Conduct of Universal Virtue faced north, knelt in prostration, and received the scriptures with reverence. The myriad spirits of heaven and earth cried out in unison, \"Excellent!\"\n\nThen, with white jade as tablets and yellow gold for engraving, the scriptures were enshrined in the Terrace of Luminous Splendor and the Pavilion of Jeweled Radiance. Within four hundred years, they were to be transmitted to but three persons.\n\nWhen the transmission was complete, the Heavenly Worthy addressed them, saying: \"The multitudes from the Two Directions, the immortals of the sun and moon, those who guide and govern the Three Luminaries—having realized the perfection of their true rank, their spirits and forms shine with clarity, illuminating the assembly. What you have witnessed is most wondrous, yet among the manifestations of all true immortals across the ten directions, their luminous appearances are not uniquely extraordinary. Do not harbor doubt or waver, lest you forfeit your good merit.\"\n\nIn an instant, the Primordial Heavenly Worthy appeared, along with the great assemblies of humans and gods. Each emanated a subtle and wondrous light, illuminating the vast heavens, merging heaven and earth into one. Myriad forms and colors transformed endlessly, like a mountain of seven treasures shining with the brilliance of a hundred thousand suns, indistinguishable from the sun, moon, and stars.\n\nThe Heavenly Worthy then spoke to Wondrous Conduct of Universal Virtue: \"The profound power of the Great Dao gives birth to and transforms the ten thousand things. According to their forms and endowments, each receives it to varying depths. The Dao bestows its teachings in response to karmic conditions, delivering all beings. Yet as beings cultivate in accordance with their capacities, distinctions arise. Though the ten thousand transformations differ, they return to the One Dao. The Dao is fundamentally without duality, returning to the One Origin. When one accords with the Dao, even this 'One' is forgotten. Unbound by self or other, unattached to being or non-being, abiding in stillness and subtlety, beyond words and thoughts—though kalpas may end, this Dao remains eternally. To dwell in the wondrous gate is called 'attaining the Dao.'\"\n\nWith these words spoken, the Heavenly Worthy commanded the celestial chariot and returned to the Great Mystery. The assembled divine immortals, perfected transcendents, and all within and beyond the Three Realms—those who had fathomed the true essence—bowed to the vast emptiness and withdrew in reverence.\n\nThus concludes the *Supreme Scripture of the Three Luminaries, Revealed by the Most High*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上导引三光宝真妙经 经名：太上洞玄灵宝导引三光妙经。 撰人不详。 约出於南北朝。 灵宝经目着录未出。 原本一卷。 《正统道藏》分作二种经书，即《太上导引三光宝真妙经》； 《太上导引三光九变妙经》，收入洞真部本文类。 今合并为一。 太上导引三光宝真妙经 元始天尊时在赤明世界丹灵国土、朱凤城中明霞宫内，御三炁丹华之殿。 与诸天大圣、至真尊神、五老帝君，金阙后圣、三清元极、上圣高尊、东华太皇、西灵金母、三十二天帝、八十一天君、玄和灵妃、太明玉女、无鞅之众，校定天元，制御洪灾，考量劫运，按三元箓籍，度一切人。 三界九幽，沈潜异类，万灵称泰，咸睹法门。 地狱宁闲，八阴开朗，积痾蠲荡，罪录销除，预睹天光，咸蒙大庆。 十方无极世界，承道威神，倏忽之间，佥然俱至。 时东西极远之处，忽有奇光上照太空，来入法会，九色艳逸，灼烁鲜华，炜灿流芳，不可熟视。 即有天君天帝、真人仙人、玉女玉童、天人眷属，皆项生圆象，足步莲花，充塞二方，一时齐至。 既入法会，礼觐天尊，烧香散华，供养朝谒。 法事既毕，各退本方，左右二边，依位而坐。 於是太真举信，神王仗幡，天乐空歌，万种互作，震骇天地，喜乐难言。 法会未悉，普德妙行真人，即从座起，安徐雅步，直诣道前。 稽首作礼，上白天尊：今此会中有东西二众，形神挺特，相好端严，进止雍容，奇光炜烁，宗修何法？ 师禀何人？ 以何因缘，证斯品位，愿赐告动，教所未闻。 天尊告曰：普德妙行，汝证位上真，多历年劫，圣尊品绪，真果阶修，内外高卑，浅深行业，咸所洞见，无不该详。 二众所修，亦当备悉。 汝所发问，当是此会之内，有小圣童真，及初仙之人，所习未广，见彼来众，默有所疑。 汝又欲显彼所修，昭示后学，故此发问，广为来生，开演妙门，作大法利。 此心弘普，不可思议。 复坐谛听，当为汝说。 夫大道之化，先乎无先，非有非无，至幽至寂，难声离见，非色非空，微妙玄深，不终不始，将示开化，渐布生成。 於太虚冥寂之中，先分道炁，稍见形兆，清浊有殊，清浮为天，浊厚为地。 二炁分判，一阴一阳，阴阳至精，结为日月。 阳极於九，日含九芒，阴极於十，月分十彩。 月以躁速，日以舒迟，月以裁成，日以生化。 二象递代，照烛於中，万物感通，生化於下。 又以二象结炁，日月分精，散为星辰，止为川岳，五星五斗，交络於天，以正纪纲，以司幽显。 物无巨细，咸所击焉。 日月星中，各有宫阙，君臣宰执，统领职司。 仙秩神官，罪福僚掾，各於其内，莫不备陈。 其中官僚，或禀炁挺生，或积功迁署，或随其修学，证品所居，总名三光，应道运化。 皆有自然玉字，八会之文，藏秘三宫，未传於世，今将授汝，下化群生。 此名导引三光，服御真炁，依科盟受，按法修行，一十八年，功成得道，炁与道合，寿命无穷。 二方之人，久修此道，功充德备，形神合升，居三光宫中，为三光寮属，形仪炳灼，光耀纷敷，与众神仙，居然有异。 若累功不息，随品转迁，自三光下仙，亦登圣位，与三洞修禀，事事玄同。 此法在亿劫之前，渺漭之际，与玉清圣教，俱化诸天，二观三乘，等无有别，勿於大道，生疑惑心。",
      "translated_text": "**The Supreme Daoist Scripture on Guiding and Absorbing the Three Luminaries’ Precious True Wonders**\n\n**Scripture Title:** *The Supreme Cavernous Mystery Numinous Treasure Scripture on Guiding and Absorbing the Three Luminaries’ Wonders*. Author unknown. Likely composed during the Northern and Southern Dynasties. Not recorded in the *Catalogue of Numinous Treasure Scriptures*. Originally one scroll. The *Daoist Canon of the Zhengtong Era* divides it into two texts: *The Supreme Scripture on Guiding and Absorbing the Three Luminaries’ Precious True Wonders* and *The Supreme Scripture on Guiding and Absorbing the Nine Transformations of the Three Luminaries’ Wonders*, both included in the *Dongzhen* section under the category of *Original Texts*. Here, they are combined as one.\n\n---\n\nAt that time, the Celestial Worthy of Primordial Beginning resided in the Vermilion Radiance Realm of the Crimson Clarity World, within the Bright Rosy Cloud Palace of the Vermilion Phoenix City, seated upon the Vermilion Qi Cinnabar Flower Hall. Together with the Great Saints of the Heavens, the Perfected and Venerable Divinities, the Five Elderly Thearchs, the Golden Watchtower’s Posterior Sages, the Three Pristine Origins of the Ultimate, the Lofty and Exalted, the Grand August of Eastern Florescence, the Golden Mother of Western Numinosity, the Thirty-Two Heavenly Thearchs, the Eighty-One Heavenly Lords, the Mystic Harmonious Numinous Consorts, the Radiant Jade Maidens, and an innumerable host, they calibrated the celestial origins, governed the great calamities, assessed the kalpas’ fortunes, and consulted the registers of the Three Origins to deliver all beings.\n\nThe Three Realms and Nine Netherworlds, the sunken and hidden kinds, myriad spirits rejoiced, all beholding the Dharma-gate. Hell was stilled, the Eight Obscurities brightened, chronic ailments dissolved, sinful records expunged. Those who glimpsed the celestial radiance all received great blessings.\n\nIn the boundless worlds of the ten directions, by the majestic power of the Dao, all arrived in an instant. Suddenly, from the farthest reaches of the eastern and western extremes, a wondrous light ascended to illuminate the firmament, entering the Dharma assembly. Its nine hues were resplendent and ethereal, dazzling and fresh, radiant and fragrant—too brilliant to gaze upon directly.\n\nThen came the Heavenly Lords and Thearchs, Perfected and Immortals, Jade Maidens and Jade Lads, and the retinues of heavenly beings. Their necks bore circular halos, their feet trod upon lotus blossoms. They filled the two directions and arrived as one. Having entered the Dharma assembly, they paid homage to the Celestial Worthy, burned incense, scattered flowers, and made offerings in reverence.\n\nWhen the ritual was complete, each returned to their respective places, sitting to the left and right in their proper ranks. Then the Perfected raised the tally, the Divine Kings wielded banners, celestial music and aerial hymns resounded in myriad forms, shaking heaven and earth with indescribable joy.\n\nBefore the assembly had fully settled, the Perfected of Universal Virtue and Wondrous Conduct arose from his seat. With composed and graceful steps, he approached the Dao. Bowing deeply, he addressed the Celestial Worthy: \"In this assembly, there are two hosts from the east and west, their forms and spirits outstanding, their appearances dignified and majestic, their movements refined and poised. Their wondrous light shines brilliantly. By what method do they cultivate? From which master do they receive teachings? By what karmic conditions have they attained this rank? We humbly request your instruction, that we may hear what has not been heard before.\"\n\nThe Celestial Worthy replied: \"Universal Virtue and Wondrous Conduct, you have attained the rank of Upper Perfected, having traversed countless kalpas. The lineages of sacred ranks, the stages of Perfected fruition, the inner and outer, the high and low, the shallow and profound practices—you have thoroughly perceived them all, with nothing left unexamined. You should also be fully aware of the cultivation of these two hosts. Your question arises because within this assembly, there are young Perfected and newly ascended Immortals whose practice is not yet extensive. Seeing these arriving hosts, they harbor silent doubts. You wish to reveal their cultivation, illuminating later learners, and thus you ask, broadly benefiting future generations by expounding this wondrous gate and establishing great Dharma merit. Such a mind of vast universality is inconceivable. Return to your seat and listen carefully; I shall now explain to you.\n\nThe transformation of the Great Dao precedes all precedence. It is neither existent nor non-existent, utterly profound and quiescent, beyond sound and form, neither form nor emptiness. Subtle and wondrous, mysterious and deep, without end or beginning, it gradually manifests its transformative work, unfolding generation and completion.\n\nWithin the primordial void’s profound stillness, the Dao’s qi first divided, faintly revealing signs of form. Clear and turbid diverged: the clear floated to become Heaven, the turbid congealed to become Earth. The two qi separated, yielding one yin and one yang. The utmost essence of yin and yang coalesced into the sun and moon. Yang culminates in nine: the sun contains nine rays. Yin culminates in ten: the moon divides into ten hues. The moon is swift and restless; the sun is leisurely and unhurried. The moon regulates completion; the sun governs generation and transformation. The two images alternate, illuminating the center, while the myriad things respond and transform below.\n\nMoreover, the qi of the two images coalesces, the sun and moon divide their essences, scattering to become the stars, settling to become rivers and mountains. The Five Stars and Five Dipper constellations interlace in the heavens, establishing the fundamental principles and governing the hidden and manifest. No thing, great or small, escapes their influence.\n\nWithin the sun, moon, and stars, each has its palaces and halls, with rulers, ministers, and officials overseeing their duties. The ranks of Immortals and divine officials, the functionaries of sin and fortune—all are arrayed within, with nothing left unassigned. Among these officials, some are born of innate qi, some ascend through accumulated merit, some attain their ranks through cultivation and learning. Collectively, they are called the Three Luminaries, corresponding to the Dao’s transformative workings.\n\nEach possesses natural jade scripts and the writings of the Eight Assemblies, concealed within the Three Palaces, never before transmitted to the world. Now, I shall bestow them upon you to transform and deliver the multitudes.\n\nThis is called *Guiding and Absorbing the Three Luminaries, Serving and Commanding the True Qi*. Follow the precepts, receive it through covenant, and practice according to the method. After eighteen years, your merit will be complete, and you will attain the Dao. Your qi will merge with the Dao, and your lifespan will be boundless.\n\nThe people of these two directions have long cultivated this Dao. Their merit fulfilled and virtue perfected, their forms and spirits ascend together, dwelling in the palaces of the Three Luminaries as their attendants. Their forms and appearances shine brilliantly, their radiance flourishing and abundant, distinct from the host of Immortals and Transcendents. If they accumulate merit without cease and advance through the ranks, from the lower Immortals of the Three Luminaries, they too may ascend to sacred positions, their affairs entirely identical to those who cultivate the Three Caverns.\n\nThis method existed in the boundless kalpas of antiquity, in the vast and distant past, simultaneously transforming the heavens alongside the Sacred Teachings of the Jade Clarity. The Two Observances and Three Vehicles are equal, without distinction. Do not harbor doubts about the Great Dao.\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1231,
      "start_sentence": 0,
      "end_sentence": 45,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.348286867141724,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\太上导引三光九变妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "即命典经上卿、卫真太史、监盟统录，玄上职僚，玉司四官、典领官属，开晨华宝殿，奉丹景玉函，出三光上篇，八天玉字、九变八会，微妙洞章，依四极明科，授普德妙行。 诸天在位，万圣列仪，三界四司，咸所瞻睹。 於是普德妙行北向长跪，稽首受经，天地万灵，齐声称善。 即以白玉为简，黄金刻书，藏於郁仪之台，结璘之阁。 四百年内，得传三人。 受经既悉，天尊告曰：二方来众，日月诸仙，导御三光，证成真品，神形朗彻，映照会中。 以众所观，甚为奇妙，然於诸方应化，一切真仙光相之中，未为殊特，勿生疑贰，自丧善功。 须臾即见元始天尊，及人天大众，各於身相，生微妙光，洞朗太空，混融天地，种种色相，变化无穷。 如七宝山，照百千日，与日月众，混合无殊。 天尊告言普德妙行曰：大道玄功，生化万物，随形禀受，各有浅深，垂法应机，开度一切，随机修习，亦有等差。 万化不同，归於一道，道本无二，归於一元，契道之时，亦忘此一。 不拘物我，不系有无，湛寂希夷，离言绝想，劫运有尽，此道常存，安处妙门，是名得道。 说是语已，勒命天驾，归还大罗。 会众神仙、天真上圣、三界内外、洞了真诠，稽首太虚，作礼而退。 太上导引三光宝真妙经竟",
      "translated_text": "Then the command was given to the Minister of Scriptures, the Grand Scribe of Guarded Perfection, the Supervisor of Covenants and Registrar, the officials of the Mystic Upper Offices, the Four Jade Bureaus, and their subordinate officers to open the Morning Radiance Treasure Hall, present the Cinnabar-Light Jade Casket, and reveal the *Upper Chapters of the Three Luminaries*, the *Jade Scripts of the Eight Heavens*, the *Nine Transformations and Eight Assemblies*, and the *Profound and Wondrous Cavern Chapters*. Following the *Bright Statutes of the Four Poles*, these were conferred upon the Wondrous Conduct of Universal Virtue.\n\nAll the heavens in their stations, the ten thousand sages in arrayed ritual, the Four Offices of the Three Realms—all gazed upon the spectacle. Thereupon, Wondrous Conduct of Universal Virtue faced north, knelt in prostration, and received the scriptures with reverence. The myriad spirits of heaven and earth cried out in unison, \"Excellent!\"\n\nThen, with white jade as tablets and yellow gold for engraving, the scriptures were enshrined in the Terrace of Luminous Splendor and the Pavilion of Jeweled Radiance. Within four hundred years, they were to be transmitted to but three persons.\n\nWhen the transmission was complete, the Heavenly Worthy addressed them, saying: \"The multitudes from the Two Directions, the immortals of the sun and moon, those who guide and govern the Three Luminaries—having realized the perfection of their true rank, their spirits and forms shine with clarity, illuminating the assembly. What you have witnessed is most wondrous, yet among the manifestations of all true immortals across the ten directions, their luminous appearances are not uniquely extraordinary. Do not harbor doubt or waver, lest you forfeit your good merit.\"\n\nIn an instant, the Primordial Heavenly Worthy appeared, along with the great assemblies of humans and gods. Each emanated a subtle and wondrous light, illuminating the vast heavens, merging heaven and earth into one. Myriad forms and colors transformed endlessly, like a mountain of seven treasures shining with the brilliance of a hundred thousand suns, indistinguishable from the sun, moon, and stars.\n\nThe Heavenly Worthy then spoke to Wondrous Conduct of Universal Virtue: \"The profound power of the Great Dao gives birth to and transforms the ten thousand things. According to their forms and endowments, each receives it to varying depths. The Dao bestows its teachings in response to karmic conditions, delivering all beings. Yet as beings cultivate in accordance with their capacities, distinctions arise. Though the ten thousand transformations differ, they return to the One Dao. The Dao is fundamentally without duality, returning to the One Origin. When one accords with the Dao, even this 'One' is forgotten. Unbound by self or other, unattached to being or non-being, abiding in stillness and subtlety, beyond words and thoughts—though kalpas may end, this Dao remains eternally. To dwell in the wondrous gate is called 'attaining the Dao.'\"\n\nWith these words spoken, the Heavenly Worthy commanded the celestial chariot and returned to the Great Mystery. The assembled divine immortals, perfected transcendents, and all within and beyond the Three Realms—those who had fathomed the true essence—bowed to the vast emptiness and withdrew in reverence.\n\nThus concludes the *Supreme Scripture of the Three Luminaries, Revealed by the Most High*.",
      "overlap_context": "ut cease and advance through the ranks, from the lower Immortals of the Three Luminaries, they too may ascend to sacred positions, their affairs entirely identical to those who cultivate the Three Caverns.\n\nThis method existed in the boundless kalpas of antiquity, in the vast and distant past, simultaneously transforming the heavens alongside the Sacred Teachings of the Jade Clarity. The Two Observances and Three Vehicles are equal, without distinction. Do not harbor doubts about the Great Dao.\"",
      "start_char": 1232,
      "end_char": 1720,
      "start_sentence": 46,
      "end_sentence": 60,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.916061162948608,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\太上导引三光九变妙经.txt",
        "category": "本文类"
      }
    }
  ]
}