{
  "source_id": "太上洞玄灵宝智慧罪根上品大戒经",
  "source_file": "chunked_daozang\\太上洞玄灵宝智慧罪根上品大戒经.json",
  "total_chunks": 10,
  "total_original_chars": 10367,
  "total_translated_chars": 68982,
  "total_translation_time": 302.0238218307495,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\戒律类\\太上洞玄灵宝智慧罪根上品大戒经.txt",
    "category": "戒律类"
  },
  "full_translation": "**The Supreme Cavernous Mystery Numinous Treasure Scripture of the Upper Chapter on the Roots of Transgressions Through Wisdom**\n\n**Scripture Title:** *The Supreme Cavernous Mystery Numinous Treasure Scripture of the Upper Chapter on the Roots of Transgressions Through Wisdom*. Author unknown, approximately composed during the Eastern Jin dynasty. One of the ancient *Numinous Treasure Scriptures*. Originally in one scroll, later divided into two. Source text: *Daoist Canon of the Zhengtong Era*, Cavernous Mystery Section, Precepts and Disciplines Category.\n\n---\n\n**The Supreme Cavernous Mystery Numinous Treasure Scripture of the Upper Chapter on the Roots of Transgressions Through Wisdom, Scroll One**\n\nAt that time, the Supreme Dao Lord was in the Cypress Tumulus Lodge of the Southern Vermilion Cavern’s Yang Upper Palace. Bowing his head in reverence, he inquired of the Primordial Heavenly Worthy: \"By virtue of the karmic blessings of past lives, through countless kalpas of cyclic turning, I have been granted the fortune to encounter this sagely and luminous age. Formerly, I was exalted beyond merit to join the ranks of the Upper Perfected, further receiving instruction in the divine scriptures of the Three Treasures and bestowed with the Great Precepts, wherein the Dharma’s resonance was proclaimed. The joy of such boundless grace is truly immeasurable.\n\nSince receiving these teachings and admonitions, I have maintained perpetual abstinence in the empty mountains, reverently upholding the Dharma precepts without敢怠 or weariness. My Daoist practice has come to fruition, opening the gateway to deliverance for gods and humans alike—all men and women universally behold the Dharma gate, their lifespans prolonged, and their lands secured in peace. My heart delights in this bliss, my resolve unwavering. Yet though I have been awakened, there remains that which I have not yet heard.\n\nI do not know whether the roots of transgressions through wisdom, the numinous resonance of past lives, and the profound secrecy of these teachings may briefly be glimpsed in their entirety. If you would deign to show compassion and once more bestow the words of the precepts, it would be as though the darkest night were illumined by the sun’s radiance, and the suffering souls of endless kalpas, drawn forth from their torments, might be reborn in halls of blessing. The Dao’s salvation would extend without limit, and its grace would universally flourish. Though my petition is trifling and fragmented, I fear it may offend the celestial countenance. My earnest and reverent heart truly hopes for your merciful favor.\"\n\nAt that moment, the Primordial Heavenly Worthy bestowed upon the Supreme Dao Lord *The Scripture of the Upper Chapter on the Precepts of the Roots of Transgressions Through Wisdom*. The Five Elder Thearchs, the Great Sagely Honored Gods, the Perfected of the Ten Directions, the Immortals of the Heavens, the Jade Maidens of Mystery and Harmony, and an assembly of fifty-two thousand five hundred gathered before the seat. Heavenly perfumes and blossoms rained down, while divine dragons and celestial musicians in countless numbers played. Heavenly immortals and jade maidens, bearing the Ten Absolute Numinous Banners, circled the radiance of the sun and moon. Divine winds converged from all directions, wafting incense and scattering dust. Purple clouds emitted their glow, crimson auroras suffused the sky, and the Three Luminaries shone in unison, illuminating all heavens with brilliance. Rivers and seas stilled, mountains and peaks concealed their mists, dragons and pearls leapt in joy, and gods and humans rejoiced together. Birth and death ceased as one, blessings and felicity universally flourished, the Five Sufferings were all dissolved, and the Three Wretched Realms were simultaneously absolved. Those long confined in hells were reborn in celestial palaces, and all sentient beings attained longevity.\n\nThereupon, the Heavenly Worthy commanded the Flying Celestial Beings of the Ten Directions to open the Jade Casket of the Nine Dark Realms, the coffer of eternal night, and bring forth the records of transgressions in life and death, the roots of karmic adversity. The Flying Celestial Beings of the Ten Directions each recounted their causes and conditions, reporting them to the Supreme Great Dao Lord.\n\nThe Heavenly Worthy proclaimed: \"In the era of Dragon Han, I emerged to establish the Dharma and guide humanity. The people of that age were ignorant and deaf to the Dharma’s resonance, living in unadorned simplicity without malice, unaware of propriety or righteousness, without rulers or subjects, ignorant of past lives or karmic causes. Through the Dharma’s instruction, they gradually entered its gate, wholeheartedly believing and turning toward it, free from the roots of transgression. Their lifespans were long, untouched by premature death.\n\nAfter my passing, heaven and earth collapsed, light vanished, and men and women were reduced to ashes, sinking into the era of Yan Kang, plunged into darkness for countless kalpas. When the Crimson Radiance dawned and heaven and earth were restored, I emerged once more, known as the Nameless Lord, to proclaim the Dharma and transform the gods and humans. The people of that age varied in the refinement of their conduct, their hearts not unified. Those who believed and turned toward the Dharma attained long life, while those who harbored jealousy, malice, treachery, and disloyalty met with premature death, thus giving rise to the roots of karmic blessings and transgressions.\n\nAfter my passing, a kalpa turned, and heaven and earth were again destroyed, plunged once more into darkness for five kalpas. In the first year of Kai Huang, the True Writ of the Numinous Treasure opened the Three Symbols, heaven and earth were restored to order, and the Five Scriptures shone forth in brilliance. In the Celestial Realm of Beginning Azure, I was known as the Primordial Heavenly Worthy, unfolding the Dharma’s teachings to transform and deliver the heavens. At the dawn of this era, the people were unadorned, conducting themselves by knotted cords, their minds in primordial chaos, harmonious with the natural. All lived long, their lifespans reaching thirty-six thousand years.\n\nBy the first year of Shang Huang, their hearts gradually decayed, and I feared the Dharma would decline. Thus, I traversed the lands, proclaiming and bestowing the celestial writ, guiding all to enter the Dharma and perfect their hearts. Within half a kalpa, lifespans gradually diminished, reduced to over eighteen thousand years.\n\nAfter my passing, the turning of heaven’s destiny hastened, and the hearts of humanity decayed further, turning to mutual deception and treachery. They envied and harmed those superior to themselves, contended for fame and merit, disbelieved the scriptures and Dharma, and doubted the Perfected of Heaven. Their words and hearts were at odds, each creating their own Dharma, worshipping heterodox spirits with licentious rites, and slaughtering living beings in prayer. Bewildered and uncentered, they mutually harmed one another, bringing upon themselves premature death, their lifespans devoid of principle, their years uncertain. Thus arose the records of transgressions and the seeds of evil, revolving endlessly within the Five Paths and Eight Difficulties, sinking into the Three Wretched Realms, ignorant of the roots of their destinies. Plunged into eternal night for countless kalpas, they drifted through the mire of suffering, a pitiable and grievous fate.\n\nNow I shall proclaim to you the precepts for governing the body, the karmic retributions of merit and transgression, the adversities of evil, and the roots of life and death. Listen carefully, receive them with reverence, and never forget. Widely proclaim and disseminate them to universally instruct gods and humans, guiding all men and women to return their bodies to the Dharma gate, uphold the precepts, practice abstinence, and distance themselves from the sources of evil. Thus may the joys of life and death be secured, and the Dao attained naturally.\"\n\nThe Dao Lord rejoiced and prostrated himself to receive the precepts.\n\nThe Heavenly Worthy said: \"If one desires to pacify the body and govern the state, to render one’s household pure and noble, to receive the protection of celestial gods and the reverence of earthly spirits, one must cultivate meritorious deeds, diligently practice abstinence and precepts, and broadly bestow the Dharma gate.\"\n\n\"First the others, then oneself—bestowing kindness upon the myriad beings, extending merit to all things. When merit fills the three thousand, one ascends to heaven in broad daylight; with virtue cultivated in abundance, clouds and chariots descend from the heavens. To propagate the Dao without cease is to attain immortality of oneself. These are the supreme precepts of fundamental conduct—how could one not reverently uphold them?\n\nFirst: One must succor the dying and protect the living, rescuing those in dire peril, that life may fulfill its destined span without untimely harm.\nSecond: One must heal the sick and treat the afflicted, carrying those in grave distress, that the body may attain safety without enduring agony.\nThird: One must bestow kindness upon the destitute, deliver those in peril, and sacrifice one’s own to aid others, without stinginess or reluctance.\nFourth: One must serve and honor the masters and treasures, establish quiet abodes, and broadly perform meritorious deeds, without weariness or slackening.\nFifth: One must transcribe and collate scriptures, recite and pay homage morning and evening, offer incense and lamps, and maintain a mind free from negligence or arrogance.\nSixth: One must cultivate abstinence and contemplate the Dao, reverently uphold the Dharma, purify both inner and outer, and refrain from generating defilement or evil.\nSeventh: One must withdraw from worldly pursuits to protect righteousness, avoid contention for fame and merit, embrace simplicity and preserve purity, and act in accordance with the natural.\nEighth: One must enlighten the ignorant and vulgar, admonish and dispel evil, guiding all to single-minded devotion in venerating the Great Dharma.\nNinth: One must dig wells along roadsides, plant orchards and groves, instruct the young and unlearned, and exhort others to perform good deeds.\nTenth: One’s conduct must serve as a model, movements and stillness must be worthy of observation, teachings and systems must provide guidance, and actions must always remain thus.\n\nThese ten meritorious causes are the supreme precepts of the precept-code, revered by the Ten Heavenly Kings. Those who practice them attain merit equal to that of the flying immortals.\n\nNext, one must maintain vigilance in conduct and speech: when addressing a ruler, one’s words should benefit the state; when addressing a father, they should foster kindness toward his children; when addressing a teacher, they should inspire love for the multitude; when addressing an elder brother, they should cultivate fraternal respect in action; when addressing a minister, they should uphold loyalty to the sovereign; when addressing a child, they should nurture filial piety toward parents; when addressing a friend, they should foster trust in fellowship; when addressing a wife, they should encourage chastity toward her husband; when addressing a husband, they should promote harmony in the household; when addressing a disciple, they should cultivate reverence for propriety; when addressing a rustic, they should encourage diligence in agriculture; when addressing a Daoist, they should rectify the Dao; when addressing a foreigner, they should ensure each remains within their own domain; when addressing servants and maids, they should exercise caution in their duties.\n\nThese fourteen precepts on maintaining personal conduct are constantly revered by the Four Heavenly Emperor-Kings. They are universally proclaimed to the noble spirits of the four directions, the people of all walks, and men and women alike, that all may practice these supreme precepts and ascend to the natural halls of bliss of the Four Heavens. Those who practice them are esteemed by the Four Heavens, praised by the earthly spirits, and their rank equals that of the Immortal Kings.\n\nNext, there are the one hundred and eighty upper precepts, eighty middle precepts, and forty lower precepts, together with the three grades of the Primordial Beginning’s wisdom precepts, compiled into the *Great Precepts for Observing the Body*, totaling three hundred. Unless one possesses the virtue of a superior immortal, with a body pervading the Three Clarities and a nature merged with the natural, none can uphold them.\n\nIn the degenerate age, the minds of men and women will be corrupted, their conduct gradually lax and indulgent, filled with doubt and division. Pursuits and competitions will be myriad, and those who preserve the truth will be few. They will surely be unable to revere and uphold the *Precepts for Observing the Body*. Having failed to observe them, they will inevitably incur great calamity.\n\nNow, the upper ten precepts are compiled to deliver beings and broadly propagate transformation, guiding them into the Dharma gate. Those who diligently uphold them will attain the blessings of the natural and the Dao of non-action.\n\nThe Ten Precepts are as follows:\nFirst: Do not envy those superior to oneself or suppress the worthy and wise.\nSecond: Do not indulge in wine or licentiousness, defiling the Three Palaces.\nThird: Do not commit adultery with another’s spouse or covet sensual pleasures.\nFourth: Do not abandon or despise the elderly, sick, destitute, or lowly.\nFifth: Do not slander the virtuous or malign fellow practitioners.\nSixth: Do not hoard treasures and refuse to bestow or distribute them.\nSeventh: Do not kill living beings to sacrifice to the Six Heavenly Ghost-Spirits.\nEighth: Do not arbitrarily discuss scriptures, dismissing them as false and absurd.\nNinth: Do not betray the kindness and righteousness of one’s teacher, feigning devotion as a new disciple.\nTenth: Maintain an equanimous mind and practice benevolence and filial piety toward all.\n\nThese Ten Precepts are universally taught throughout the boundless worlds to deliver all beings. Those who uphold them will have their merit recorded in the Ten Heavens, their blessings extending to seven generations of ancestors, lifting them from the long night of the Nine Dark Realms to ascend to the Southern Palace. Their bodies will enter the radiance of light, their karmic connections unbroken, and they will attain the state of divine immortals. With all practices fulfilled, one must avoid the Ten Evils, distance oneself from the blind path, and sever the roots of sin.\n\nThe Ten Evils are as follows:\nFirst: Indulging in wine and lust, with insatiable greed and desire.\nSecond: Secretly harming the world and slandering Daoists.\nThird: Disrespecting teachers and the Dharma, arrogantly neglecting the Three Treasures.\nFourth: Stealing scriptures and recklessly proclaiming the essentials of the Dao.\nFifth: Borrowing and failing to return, deceiving and misleading the people.\nSixth: Killing living beings for taste, with a mouth that praises but a heart that denies.\nSeventh: Being unfilial, betraying kindness, violating righteousness, and transgressing all prohibitions.\nEighth: Reciting scriptures carelessly, being haughty and self-righteous.\nNinth: Demanding compliance with one’s expectations, harboring anger toward the four classes of beings.\nTenth: Distorting the meaning of scriptures, altering or diminishing the sacred texts, disbelieving in past lives, indulging in reckless desires, defiling and disdaining the Four Great Elements, and neglecting the path of life.\n\nThese Ten Evils cannot be separated from the body. Those who violate them will suffer myriad misfortunes, their lives harmed by ghosts and spirits, enduring endless torment without a moment’s peace. Though they tread the path of goodness, they will encounter evil, and all their endeavors will fail. Upon death, they will enter hell, confined in the heavy barriers of the long night, never beholding the Three Lights, drifting day and night. They will embrace the bronze pillars, tread the knife mountains, traverse the sword trees, plunge into cauldrons of boiling water, swallow fire and eat coals, enduring the five sufferings in full. They will be eternally submerged in the Nine Dark Realms, without hope of rebirth. Even if they attain liberation, they will be reborn among the six kinds of animals, never regaining human form. Evil draws evil, just as goodness begets goodness. The retribution of sin and blessing is like the sunlight descending, while the unceasing cycle of life and death follows the shadow accompanying the form. Karmic consequences accumulate like the turning of a wheel.\"\n\nHere now is the precept expounded, to shield and ferry gods and humans, to illuminate and discern, to receive with clarity, and to practice diligently without forgetfulness.\n\nIf faithful men and women can steadfastly uphold the Ten Precepts, their capacity and strength both ample, and aspire to practice with diligence and advance in purity, widely bestowing manifold goodness, they may be conferred the Twelve Permissible Observances, and instructed in the Ten Virtues and the Fourteen Rules for Conduct.\n\nThe Heavenly Worthy declared: Those who study, perform purification rites, and seek the Dao, who deliver gods and humans and perform all meritorious deeds, ought to practice the Twelve Permissible Precepts. Through these, they may attain deliverance from the world. You should follow them, thereby attaining true perfection and ultimately entering the realm of non-action, with all aspirations fulfilled.\n\nThe Twelve Permissible Precepts are as follows:\n\nFirst, upon encountering true scriptures and the orthodox Dharma, delivering all beings, one should awaken the Dao-mind, vowing that in future lives one may ascend to the rank of great sage.\n\nSecond, one should constantly practice a heart of compassion, wishing that all beings may behold the Dharma, be delivered far and wide, without obstruction.\n\nThird, one should delight in the scriptural teachings, deeply and broadly comprehending them, with a will firm and bright, enlightening the ignorant and benighted.\n\nFourth, one should follow the instructions of one’s teacher, widely exhorting and transforming others, guiding them into the enclosure of the Dharma, far from blind paths.\n\nFifth, one should trust in and turn toward the profound and wondrous, reverently upholding the scriptural instructions, reciting and studying them morning and evening without weariness or sloth.\n\nSixth, one should not pursue glory and splendor, severing karmic entanglements, concentrating the mind and fixing the will, with all endeavors directed toward the Dharma.\n\nSeventh, one should diligently recite the great scriptures, wishing for all beings, widely building bridges, and creating good causes for future lives.\n\nEighth, one should constantly generate a heart of goodness, neither deviant nor false, without jealousy or harm, without malice or obstruction.\n\nNinth, wherever one is reborn, one should always encounter a sagely age, with the Lingbao teachings flourishing, never failing to meet them.\n\nTenth, one should purify the body and uphold the precepts, perform purification rites and establish merit, widely rescuing all beings, that all may attain deliverance.\n\nEleventh, one should broadly study and comprehend the teachings, propagating and communicating them to fellow practitioners, thereby including gods and humans, universally delivering all.\n\nTwelfth, one should always encounter enlightened teachers, life after life, receiving instruction and propagating transformation, delivering countless beings. All good intentions shall attain the true Dao.\n\nThe Heavenly Worthy declared: The method for scholars to cultivate conduct lies in practicing the Twelve Permissible Precepts. If one can practice these good intentions with a single mind, life after life one will behold the sagely, form karmic bonds with the Dao, befriend the gods, and walk alone through the Three Realms without hindrance. One will forever depart from the Three Evil Paths, the Five Destinies, and the Eight Difficulties. Divine spirits will respect and protect, earthly deities will surround and guard. One’s household will be pure and solemn, myriad calamities will not encroach. Truly, one may sit upright and attain the Dao.\n\nDiligently study and recite, widely propagate to fellow learners, that all may together enter the Dharma-gate.\n\nAt that time, when the Heavenly Worthy had finished expounding the precepts, the Most High Lord of the Dao, the Perfected of the Ten Directions, the Boundless Great Sages, and the Lofty Transcendent Ones all rejoiced, made obeisance, and simultaneously faced east, prostrating themselves to the ground.\n\nThe Most High Lord of the Dao advanced, knelt, and addressed the Heavenly Worthy, saying: \"All the Perfected in attendance, having heard the Dharma-sound, and the gods of the heavens, leap for joy, their delight beyond measure. As the Great Dharma flourishes, it universally delivers gods and humans. In future lives, men and women shall receive this grace. Yet we see that the world’s foolish and deaf do not perceive the root of destiny, nor know the consequences of sin and blessing, whence they arise. Though exhorted and awakened, many do not believe. Having already bestowed instruction and admonition, we now pray that Your August Grace be universally bestowed, that the men, women, and children of the boundless worlds in the ten directions may simultaneously awaken, perceive the karmic conditions of past lives—good and evil, the retribution of sin and blessing—and know the root of destiny. May all under heaven attain deliverance, and the Dharma-teachings daily flourish.\"\n\nThereupon, the Heavenly Worthy emitted the radiance of his majestic body, illuminating within and without, shining through the ten directions. No darkness remained hidden, no bound was left unpervaded. All was instantly illuminated, as if seen before one’s eyes. All men and women were revealed as blessed beings from the halls of goodness above the heavens, carefree and at ease, their joy natural. Below, they beheld the Nine Dark Realms of the earthly prisons, the long night’s confines, where prisoners toiled, hungry ghosts and beasts, drifting dead souls, their heads and bodies shorn and severed, no longer possessing human form. They were shut in heavy barriers, never beholding the Three Lights. All men and women saw the root of destiny, the karmic conditions of sin and blessing, the retribution of good and evil. None were not struck with awe, all simultaneously turned their hearts, revered and upheld the Great Dharma, practiced manifold goodness, entrusted their lives to the Heavenly Worthy, and submitted to the prohibitions and precepts, never again turning back. Blessings and virtue universally pervaded, their joy indescribable, their delight beyond measure.\n\nThe Great Sages of the heavens all extolled the good, and composed a hymn, saying:\n\nThe Ten Heavens wheel through the empty void,\nLife and death return therein.\nGood and evil each bear their roots,\nKarmic conditions never fail in their response.\nOf old, we saw the faithful,\nThus ascending the Ten Heavens.\nGazing upon the long night of the Nine Dark Realms,\nThe suffering souls climb the sorrowful peaks.\nThe Long River cannot be dammed,\nThe Knife Mountains cannot be turned back.\nRevolving in the Five Paths,\nPity and sorrow fill the heart.\nThe Heavenly Worthy expounds the prohibitions,\nBrightly dispelling the long night.\nThe heavens all rejoice,\nThis joy cannot be matched.\n\nThe Heavenly Worthy declared: Now I shall command the divine messengers and gods of the heavens to proclaim the records of sins, propagate the Dharma-sound, awaken all beings, and enlighten the gods and humans—good men and good women. Let them know the karmic roots of bodily actions, sin, and evil, the unbroken conditions, the calamitous consequences that pursue, drifting in the Three Wretched Paths and the Five Destinies, where souls and forms suffer torment, for kalpas without return. Therefore, these precepts are expounded, to guide them into the Dharma-gate, deliver the Nine Dark Realms, extract the roots of suffering, that the living may behold the Dao and escape the Eight Difficulties, the dead may rejoice and ascend to the heavens, be reborn early among humans, become Wheel-Turning Sage Kings, and in life and death know peace, existing for ages unending. Those who beforehand trust and turn toward the Dharma should all concentrate their minds, uphold the precepts and perform purification rites, thereby attaining the true Dao. Be cautious in practice, diligent in cultivation, receive with clarity and never forget. Those who can align with the Great Dharma should now submit and listen.\n\nThe Upper Scroll of the *Highest Cavern Mystery Numinous Treasure Scripture of the Wisdom Roots of Transgressions, Upper Grade Precepts* concludes.\nThe Lower Scroll of the *Highest Cavern Mystery Numinous Treasure Scripture of the Wisdom Roots of Transgressions, Upper Grade Precepts* begins.\n\nThe Flying Heavenly Deity of the Eastern Ultimate World declares: In the Eastern Boundless World, the multitude of beings as numerous as the sands of the Ganges—those who have already attained the Dao in past lives and those presently virtuous men and women of good fortune who have yet to attain the Dao—who cultivate and uphold the Ten Upper-Grade Precepts of Wisdom, when their merit is complete and their blessings fulfilled, shall ascend through the void, soaring in broad daylight, riding upon the radiance and spurring dragons, ascending to the Jade Purity, and roaming amidst the Nine Qi Heavens of the Eastern Ultimate.\n\nThose who have not yet attained the Dao shall be born into wealth and nobility in the world, occupying honored positions among humans, with long lifespans and no premature death.\n\nThe Azure Emperor of the East shall inscribe their names and memorialize the Nine Qi Heaven, the Nine Qi Heavenly Officials, who shall then decree to the Three Offices and Nine Bureaus of the Eastern Earthly Prisons, erasing their names from the Azure Register of the Nine Dark Realms and the Everlasting Night Scrolls of the Jade Casket, severing the roots of their past-life transgressions.\n\nThe Life-Commanders of the Azure Heaven shall record them in the registers of heavenly immortals, and their seven generations of ancestors shall all ascend to the heavens, clothed and fed by nature, reborn in successive generations into the gates of emperors and kings, rejoicing in life after life, forever dwelling in good fortune, their karmic conditions unbroken, thus attaining the root of faith.\n\nThe Most High Dao Lord turned and asked the Flying Heavenly Deity of the Eastern Ultimate World: \"I have often traversed the heavens and journeyed through the Eastern Gate, where I beheld in the Eastern Boundless World’s hells the common folk—men and women—enduring floggings and torments, their bodies afflicted with every pain, their forms emaciated and withered, their suffering beyond words. Witnessing this, I grieved deeply. How many years must they endure this penal servitude before they may be released, return to the human realm, and escape their evil karmic conditions? What meritorious deeds must such beings perform to extricate themselves from this enmity, attain deliverance, and re-enter the gate of goodness?\"\n\nThe Flying Heavenly Deity of the Eastern Ultimate World replied: \"The transgressions of these beings are recorded in the Everlasting Night Scrolls of the Nine Dark Realms. The Nine Qi Heavenly Lords, the Azure Heavenly Numinous Officials, and the Three Realms’ Registrars have tallied their offenses. According to the statutes of the Left Bureau of the Jade Maiden of the Mysterious Capital’s Upper Palace, they must endure ninety thousand kalpas before they may return, reborn into non-human destinies, and undergo transmigration for ninety million kalpas. Only when the reckoning of heaven and earth is exhausted may they serve as laborers in the Nine Rivers, their hardships beyond description. To attain deliverance and sever their evil karmic conditions, they must follow the regulations of the Luminous Perfected Jade Casket and the Jade Maiden of the Upper Palace’s statutes: present ninety feet of azure-patterned silk (or nine feet), and one golden dragon, to the Nine Qi Heavenly Lord of the East and the Eastern Numinous Officials of the Nine Dark Realms, to redeem and extricate the suffering souls, cutting off the roots of their transgressions. For nine days and nine nights, they must illuminate lamps, burn incense, and prostrate in repentance before the Heavenly Lord. Then, in the depths of the Nine Dark Realms, they shall behold the light and attain liberation, re-entering the conditions of goodness. Within nine years, they shall all be reborn among humans, rejoicing in life after life, their blessings and felicity boundless.\"\n\nThe Flying Heavenly Deity of the Southeastern World declares: In the Southeastern Boundless World, the multitude of beings as numerous as the sands of the Ganges—those who have already attained the Dao in past lives and those presently virtuous men and women of good fortune who have yet to attain the Dao—who cultivate and uphold the Ten Upper-Grade Precepts of Wisdom, when their merit is complete and their virtue perfected, shall receive the blessings of the Cinnabar Heaven. Those who have attained the Dao shall ascend to the rank of Highest Perfected, become immortals or numinous officials, or attain extinction.\n\nTheir names shall be inscribed in the Upper Clarity, and they may ascend to the ranks of highest sages or become immortals, roaming the Five Peaks, riding dragons and traversing the void. In the present world, they shall serve as teachers and exemplars to humanity, revered by the myriad clans, respected by the Three Realms, their households noble and pure, their blessings and felicity boundless.\n\nThe Southeastern Earthly Offices shall inscribe their names and memorialize the Brahma Qi Heaven, the Brahma Qi Heavenly Officials, who shall then decree to the Three Offices, Nine Courts, and One Hundred Twenty Bureaus of the Southeast, erasing their names from the Yellow Register of the Nine Dark Realms and the Everlasting Night Scrolls of the Jade Casket, severing the roots of their past-life transgressions.\n\nThe Life-Commanders of the Brahma Heaven shall record them in the registers of Brahma Heaven’s immortals, and their seven generations of ancestors shall all depart the Three Wretched Realms, ascend to the heavens, and feast upon the celestial kitchens. Within twelve years, they shall all be reborn into the gates of good fortune and virtue, the households of emperors and kings, rejoicing in life after life, their karmic conditions revolving until they attain the flight of immortals.\n\nThe Most High Dao Lord turned and asked the Flying Heavenly Deity of the Southeastern World: \"I have often traversed the heavens and journeyed through the Southeastern Gate, where I beheld in the Southeastern Boundless World’s hells the common folk—men and women—enduring these evil retributions, their suffering beyond words. Witnessing this, I grieved deeply, filled with pity. How many years must they endure punishment before they may be released? When pardoned, they shall be reborn among humans, assuming whatever forms they may. What meritorious deeds must such beings perform to attain deliverance?\"\n\nThe Flying Heavenly Deity of the Southeastern World replied: \"The transgressions of these beings are of the cruelest and most perverse kind, recorded in the Everlasting Night Scrolls of the Nine Dark Realms. The One Qi Heavenly Lord, the Brahma Qi Numinous Officials, and the Three Realms’ Registrars have tallied their offenses. According to the statutes of the Central Bureau of the Jade Maiden of the Mysterious Capital’s Central Palace, they must endure ten thousand kalpas before they may return, reborn among the lowly, their bodies afflicted with the Six Extremities, bearing deformities or chronic illnesses. They shall undergo transmigration for twelve myriad kalpas without number before they may serve as laborers in the Eastern Peak. Their hardships are beyond description. To attain deliverance and return to the conditions of goodness, they must follow the regulations of the Luminous Perfected Jade Casket and the Jade Maiden of the Central Palace’s statutes: present one hundred twenty feet of yellow-patterned silk (or twelve feet), and one golden dragon, to the Brahma Qi Heavenly Lord of the Southeast and the Southeastern Numinous Officials of the Nine Dark Realms, to redeem and extricate the sinful souls. For twelve days and twelve nights, they must illuminate lamps, burn incense, and prostrate in repentance before the Heavenly Lord. Then they shall attain deliverance, behold the light, and within twelve years, all shall be reborn into the gates of good fortune and virtue, rejoicing in life after life, forever enjoying boundless blessings.\"\n\nThe Flying Heavenly Deity of the Southern Boundless World declares: In the Southern Boundless World, the multitude of beings as numerous as the sands of the Ganges—those who have already attained the Dao in past lives and those presently virtuous men and women of good fortune who have yet to attain the Dao—who cultivate and uphold the Ten Upper-Grade Precepts of Wisdom, when their merit is complete and their virtue perfected, shall receive the blessings of the Cinnabar Heaven. Those who have attained the Dao shall ascend to the rank of Highest Perfected, become immortals or numinous officials, or attain extinction.\n\nIn the present world, they possess keen intelligence and wisdom, foreseeing fortune and misfortune, or they attain spiritual clarity and far-seeing vision, commanding ghosts and spirits, or dwell within the gates of wealth, nobility, and imperial power. The Southern Red Emperor and the Southern Pole Earth Controller shall inscribe their names in the registers of the Three Qi Cinnabar Heaven and the Three Qi Heavenly Officials, and proclaim to the Three Officials, Nine Bureaus, and One Hundred Twenty Offices of the Southern Realm to expunge the karmic roots of their past sins from the Crimson Prime Nine Dark Hells and the Jade Casket of Eternal Night. The Cinnabar Heaven Controller of Destiny shall record them in the divine register of Cinnabar Heaven immortals, and their seven generations of ancestors shall universally depart from the Three Wretched Realms, ascend to the Heavenly Palaces, and roam freely in the Southern Palace. Within three years, all shall be reborn into the gates of good fortune and virtue, rejoicing in life after life, their blessings and joys beyond measure, their good affinities unbroken, and they shall attain the rank of divine immortals.\n\nThe Most High Dao Lord turned to the Flying Heavenly Deity of the Southern Boundless World and inquired: \"I have often surveyed the heavens and journeyed through the Southern Gate, where I beheld in the hells of the Southern Boundless World the common folk—men and women—naked and without clothing, swallowing fire and consuming coals, their faces scorched and bodies aflame, their forms no longer human, enduring cruel retributions, their suffering beyond words. Witnessing this, I was moved to tears, my heart grieved with sorrow. How many years must such beings endure their retribution before they may be liberated? When the day of their pardon arrives, in what form shall they be reborn among humans? By what merciful method and what meritorious deeds may they be delivered and restored to good affinities?\"\n\nThe Flying Heavenly Deity of the Southern Boundless World replied: \"These individuals were cruel and perverse in life, devoid of the Dao. Their sins bound them to the Nine Dark Hells of Eternal Night. The Three Qi Heavenly Lords, the Cinnabar Heaven Numinous Officials, and the Three Realms’ Controllers of Destiny have recorded their transgressions. According to the statutes of the Mysterious Capital’s Female Azure Yang Palace and the Greater Yang Officials, their penal servitude spans thirty thousand kalpas, after which they shall be reborn among the six kinds of livestock to repay their karmic debts. After three million kalpas, cycling through the reckonings of Cinnabar Heaven, they may become laborers in the Three Rivers’ offices, their toil and suffering beyond description. If one wishes to deliver them and sever their evil affinities, hastening their return to the human realm, they must follow the statutes of the Luminous Perfected Jade Casket and the Female Azure Lower Palace: with thirty feet of crimson-patterned silk (or three feet), and one golden dragon, they shall journey to the Southern Three Qi Heavenly Lord and the Southern Region’s Numinous Officials within the Nine Dark Hells to redeem the sinful souls. For three days and three nights, they shall light lamps and burn incense, bowing in gratitude to the Heavenly Lords. Thus, they may swiftly emerge from the Eternal Night, behold the radiant lights, and within three years, all shall be reborn among humans, their affinities unbroken, and they shall turn toward the root of faith.\"\n\nThe Flying Heavenly Deity of the Southwestern World declared: \"In the Southwestern Boundless World, the multitude of beings as numerous as the sands of the Ganges—those who have already attained the Dao in past lives and those presently virtuous men and women of good fortune who have yet to attain the Dao—who cultivate and uphold the Ten Upper-Grade Precepts of Wisdom, when their merit is complete and their virtue perfected, shall receive their karmic rewards. Those who have attained the Dao shall ascend to the rank of Highest Perfected. Those who have not yet attained the Dao shall, in their present lives, be praised by earth deities and revered by heavenly spirits. Upon death, they shall ascend to the Southern Palace, receive the title of Heavenly Official of the Upper Supplement, and govern ghosts and spirits. The Southwestern Primal Qi Heavenly Lord shall proclaim to the Earth Deities, Three Officials, Nine Bureaus, and One Hundred Twenty Offices of the Southwestern Realm to expunge the karmic roots of their past sins from the Yellow Prime Nine Dark Hells and the Jade Casket of Eternal Night. The Primal Heaven Controller of Destiny shall inscribe their names in the divine register of Primal Heaven immortals. Their nine generations of ancestors shall universally depart from the Three Wretched Realms and the Five Sufferings, ascend to the Southern Palace, and roam freely in the Hall of Blessings. After twelve years, all shall be reborn into the gates of wealth and nobility, their affinities unbroken, and they shall attain the rank of divine immortals.\"\n\nThe Most High Dao Lord turned to the Flying Heavenly Deity of the Southwestern World and inquired: \"I have often surveyed the heavens and journeyed through the Southwestern Gate, where I beheld in the Eternal Night Hells of the Southwestern Boundless World—within the Three Rivers, Nine Streams, and Five Peaks—the common folk, men and women, enduring cruel retributions, their suffering unbearable. Witnessing this, I was filled with sorrow, my heart grieved. How many years must such beings endure before they may be liberated? When the day of their pardon arrives, in what form shall they be reborn? By what meritorious deeds may they be delivered and restored to good fortune?\"\n\nThe Flying Heavenly Deity of the Southwestern World replied: \"In their past ten human lives, these individuals committed no good deeds, living in constant rebellion. The Primal Qi Heavenly Lord, the Primal Qi Numinous Officials, and the Three Realms’ Controllers of Destiny have recorded their transgressions. According to the statutes of the Mysterious Capital’s Female Azure Lower Palace and the Right Officials, after ten thousand kalpas, they may be reborn as lowly servants. After cycling through one hundred twenty thousand kalpas of countless revolutions, they may become laborers in the Southern River offices, their toil and suffering beyond words. If one wishes to deliver them and restore their good affinities, they must follow the statutes of the Luminous Perfected Jade Casket and the Female Azure Lower Palace: with one hundred twenty feet of yellow-patterned silk (or twelve feet), and one golden dragon, they shall journey to the Southwestern Primal Qi Heavenly Lord and the Southwestern Numinous Officials within the Nine Dark Hells to redeem the sinful souls. For twelve days and twelve nights, they shall light lamps and burn incense, bowing in gratitude to the Heavenly Lords and the Southwestern Numinous Officials. Thus, they may be delivered from the Eternal Night and behold the radiant lights. Within twelve years, all shall be reborn into the gates of good fortune and blessings.\"\n\nThe Flying Heavenly Deity of the Western World declared: \"In the Western Boundless World, the multitude of beings as numerous as the sands of the Ganges—those who have already attained the Dao in past lives and those presently virtuous men and women of good fortune who have yet to attain the Dao—who cultivate and uphold the Ten Upper-Grade Precepts of Wisdom, when their merit is complete and their virtue rewarded, those who have attained the Dao shall ascend to the rank of Highest Perfected. Those who have not yet attained the Dao shall have their names inscribed in the Mysterious Terrace of the Great Simplicity, their lives transcended and their souls ascended to heaven, becoming guests of the Most High. The Western White Emperor shall inscribe their names in the Seven Qi Heaven. The Seven Qi Heavenly Lord shall proclaim to the Three Officials of the Western Realm and the Nine Offices of the Earthly Prisons to expunge the karmic roots of their past sins from the White Prime Nine Dark Hells and the Jade Casket of Eternal Night.\"\n\nThe Director of Destiny in the Plain Heaven shall inscribe their names in the registers of divine immortals among the heavens. Their seven generations of ancestors shall universally depart from the Three Wicked Paths and the Five Sufferings, ascending to the Golden Portals to receive natural blessings, roaming the Hall of Fortune, and enjoying boundless joy. In later rebirths among humankind, they shall be revered as human dignitaries, respected by the Three Realms, and praised by ghosts and spirits. As their wheel of fortune turns, all shall attain the rank of divine immortals.\n\nThe Most High Dao Lord turned to the Flying Celestial Beings of the Western Realm and inquired: \"I have often surveyed the heavens and journeyed through the Western Gate, where I beheld the Nine Dark Hells of Eternal Night in the Western Realm of the Infinite, as well as the Three Rivers and Nine Streams among the mountains, where male and female ghostly souls are punished and toil, drifting through the Three Wicked Paths and enduring the full weight of the Five Sufferings. What past karmic retribution has brought these beings to suffer such punishment? In how many years may they attain liberation, and what meritorious deeds may redeem and deliver them?\"\n\nThe Flying Celestial Beings of the Western Realm replied: \"These beings, in their past lives, acted contrary to the Dao. The Seven Qi Heavenly Lord, the various spirit officials of the Western Realm, and the governing authorities of the Three Realms have recorded their transgressions. According to the statutes of the Dark Bureau of the Right Palace of the Mysterious Capital’s Lady of Qing, after ten thousand kalpas, they may be reborn in the frontier barbarian lands, possessing human form but lacking human sentiment. After seventy thousand kalpas, when the reckoning of the White Emperor has completed its cycles, they may become laborers under the command of the Western Peak. This suffering is endless, their toil beyond words. Should one wish to deliver them and restore them to good karmic conditions, they must follow the regulations of the Jade Casket of Luminous Perfection and the statutes of the Right Palace of the Lady of Qing: present seventy feet of white silk—or seven feet—and one golden dragon to the Seven Qi Heavenly Lord, the various spirit officials of the Western Realm, and the Nine Dark Hells to redeem their karmic roots. For seven days and seven nights, keep bright lamps lit and burn incense, prostrating before the Heavenly Lord to seek deliverance. Thus may they behold the light. After seven years, all shall be reborn into the families of the virtuous.\"\n\nThe Flying Celestial Beings of the Northwestern Realm declared: \"Among the boundless multitudes of the Northwestern Realm of the Infinite, both those who have attained the Dao in past lives and those good men and women of present good fortune who have yet to attain the Dao—who cultivate and uphold the Ten Upper-Grade Precepts of Wisdom—when their merit is complete and their virtue rewarded, those who have attained the Dao shall ascend to the rank of Highest Perfected. Those who have not yet attained the Dao shall have their names inscribed in the Nine Heavens, their lives transcended and their souls ascended to heaven, where they shall consort with the Five Emperors. The Yellow Emperor shall inscribe their names in the Heaven of Brahma Qi. The Heavenly Lord of Brahma Qi shall proclaim to the Three Officials of the Northwestern Realm and the Nine Offices of the Earthly Prisons to expunge the karmic roots of their past sins from the Yellow Prime Nine Dark Hells and the Jade Casket of Eternal Night.\"\n\nThe Director of Destiny in the Brahma Heaven shall inscribe their names in the registers of divine immortals among the heavens. Their seven generations of ancestors shall all depart from the Five Paths, ascending to the Nine Heavens to receive boundless blessings. In later rebirths among humankind, they shall be courageous and diligent, their might prevailing over the Five Directions. With unbroken karmic conditions, they shall be appointed as Perfected Ones of the Five Emperors.\n\nThe Most High Dao Lord turned to the Flying Celestial Beings of the Northwestern Realm and inquired: \"I have often surveyed the heavens and journeyed through the Northwestern Gate, where I beheld the hells of the Northwestern Realm of the Infinite—the Nine Streams of Eternal Night and the Frozen Courts of Darkness—where the common folk, men and women, suffer in filth and drift in torment, their bodies lashed and afflicted with unbearable agony. How many years must such beings endure punishment before they may attain liberation? When pardoned, what form shall they take upon returning to the human realm?\"\n\nIf pardon has not yet been granted, what merits or virtues may be cultivated to deliver them?\n\nThe Flying Celestial Beings of the Northwestern Realm replied: \"Such beings have committed acts of extreme cruelty and transgression. The Qi Sovereign of the Northwest and the various spirit-officials, along with the overseers of the Three Realms, have recorded their sins in the ledgers. According to the statutes of the Mysterious Capital’s Lady of the Dark Yin, the Water Bureau, and the Palace of the Hidden Moon, they are condemned to ten thousand kalpas of rebirth in realms of ignorance and darkness, afflicted with deafness, blindness, and the six maladies, no longer retaining human form. They shall revolve through the Five Paths for one hundred twenty thousand kalpas, countless cycles, before they may be appointed as laborers in the Long River Bureau. This suffering is boundless, their toil beyond description.\n\nShould one wish to deliver them and guide them back into the gate of goodness, they must follow the statutes of the Luminous Perfected Jade Treasury and the Lady of the Dark Yin’s Palace. Offer one hundred twenty feet of yellow-patterned silk—or as little as twelve feet—and a golden dragon, presenting them to the Qi Sovereign of the Northwest, the various spirit-officials of the Northwest, and the Nine Dark Prisons to ransom the sinful souls. For twelve days and twelve nights, light lamps and burn incense, bowing in repentance before the Sovereign. Thus may they attain deliverance and behold the radiant light. After twelve years, they shall gain freedom, be reborn among humans, and re-enter the gate of good karmic conditions, enjoying boundless joy for generations to come.\"\n\nThe Flying Celestial Beings of the Northern Realm said: \"In the Northern Realm of the Infinite, among the countless sentient beings—both those who have already attained the Dao in past lives and those presently abiding in blessed goodness, the virtuous men and women who cultivate and uphold the Ten Precepts of Supreme Wisdom—when their merits and virtues are complete, their celestial rewards shall be inscribed in the Upper Clarity. Some ascend to the rank of highest sages, roaming the Three Clarities; others, upon the end of their lives, become Illustrious Lords of the Four Poles. In their present existence, they dwell in blessed virtue, revered by spirits and protected from the myriad calamities. The earthly bureaus of the North shall report to the Celestial Palace, where the Five Qi Sovereigns instruct the Three Officials, Nine Courts, and One Hundred Twenty Offices of the North to erase from the Jade Treasury of the Nine Dark Prisons and the Eternal Night Archives the roots of their past sins. The Northern Celestial Bureau of Destiny shall inscribe their names in the registers of divine immortals. Their seven generations of ancestors shall universally ascend to the Heavenly Halls, clothed and nourished by nature. Within five years, they shall all be reborn into the gates of emperors and kings, revolving through cycles of blessed virtue, forever abiding in good karmic conditions.\"\n\nThe Most High Dao Lord turned to the Flying Celestial Beings of the Northern Realm and inquired: \"I have often surveyed the heavens and journeyed through the Northern Gate, where I beheld the hells of the Northern Realm of the Infinite—the Three Rivers, Nine Streams, and myriad mountains—where the common folk, men and women, suffer their retributions, dragged through filth and torment, bearing mountains and stones upon their backs, blocking the eternal springs, swallowing fire and gazing upon coals, their bodies no longer retaining human form. How many years must such beings endure punishment before they may attain liberation? When pardoned, what form shall they take upon returning to the human realm? May they be delivered, or not?\"\n\nThe Flying Celestial Beings of the Northern Realm replied: \"Such beings, in their past lives, committed acts of extreme cruelty and lawlessness. The Five Qi Sovereign of the North and the various spirit-officials, along with the overseers of the Three Realms, have recorded their sins. According to the statutes of the Mysterious Capital’s Lady of the Luminous Yang, the Fire Bureau, they are condemned to ten thousand kalpas of rebirth among the six livestock. They shall revolve through the Five Paths for fifty thousand kalpas, countless cycles of the Northern Celestial reckoning, before they may be appointed as laborers in the Northern Marchmount Bureau. Their retribution is vast, their repayment not swiftly fulfilled.\n\nShould one wish to deliver them and swiftly restore their life’s root, they must follow the statutes of the Luminous Perfected Jade Treasury and the Lady of the Luminous Yang’s Palace. Offer fifty feet of dark-patterned silk—or as little as five feet—and a golden dragon, presenting them to the Five Qi Sovereign of the North, the various spirit-officials, and the Nine Dark Prisons to ransom the sinful souls. For five days and five nights, light lamps and burn incense, bowing in repentance before the Sovereign. Thus may they attain deliverance and behold the radiant light. Within five years, their bodies shall be reborn into good karmic conditions.\"\n\nThe Flying Celestial Beings of the Northeastern Realm said: \"In the Northeastern Realm of the Infinite, among the countless sentient beings—both those who have already attained the Dao in past lives and those presently abiding in blessed goodness, the virtuous men and women who cultivate and uphold the Ten Precepts of Supreme Wisdom—when their merits and virtues are complete, those who have attained the Dao ascend to the rank of highest perfected ones, while those who have not yet attained the Dao, in their present existence, are revered by the Three Realms and feared by earthly deities. Upon death, they ascend to the Heavenly Halls, where divine beings welcome them. The earthly bureaus of the Northeast shall report to the Celestial Palace of Brahma Qi, where the Brahma Qi Sovereign instructs the Three Officials, Nine Courts, and One Hundred Twenty Offices of the Northeast to erase from the Yellow Prime Jade Treasury of the Nine Dark Prisons and the Eternal Night Archives the roots of their past sins. The Brahma Celestial Bureau of Destiny shall inscribe their names in the registers of divine immortals. Their nine generations of ancestors shall ascend to the Southern Palace, departing the Five Paths to dwell in the Halls of Blessedness. Within five years, they shall all be reborn into the gates of blessed virtue, their karmic conditions spanning generations, enjoying boundless felicity.\"\n\nThe Most High Dao Lord turned to the Flying Celestial Beings of the Northeastern Realm and inquired: \"I have often surveyed the heavens and journeyed through the Northeastern Gate, where I beheld the hells of the Northeastern Realm of the Infinite, where the common folk, men and women, endure their past retributions, suffering every torment, dragged through filth and mire, their bodies no longer retaining human form. What crimes did they commit in past lives? What offenses did they incur? Whose lives did they take, that they now endure such retribution? What merits must be cultivated to ransom their sinful bodies and guide them back into the path of goodness?\"\n\nThe Flying Celestial Beings of the Northeastern Realm replied: \"In their past lives, these beings lacked compassion. During the three spring months, they roamed hunting, setting nets and snares, burning mountains, and shooting wild beasts, slaughtering countless lives. Their sins are grave, and in death, they suffer the consequences—beaten with clubs, a thousand pains assailing them, driven through the hundred extremes, never resting in eating or sleeping.\n\nTo deliver them from such sins and restore them to blessedness, one must follow the statutes of the Luminous Perfected. Offer one hundred twenty feet of yellow-patterned silk—or as little as twelve feet—and a golden dragon, presenting them to the Brahma Qi Sovereign of the Northeast, the various spirit-officials, and the Nine Dark Prisons. For twelve days and twelve nights, burn incense and light lamps, illuminating the hells of heaven and earth, so that the long-imprisoned souls may behold the radiant light, their sinful roots dispersed. Thus may they return to the gate of blessedness, their souls ascending to the Southern Palace to receive natural rejoicing.\"\n\nThe Flying Celestial Beings of the Lower Realm declare: In the boundless worlds of the Lower Realm, among the countless sentient beings—those who have attained the Dao as Earth Immortals and the Perfected of the Five Peaks, as well as the virtuous men and women still abiding in blessedness who have yet to attain the Dao—those who cultivate and uphold the Ten Precepts of Supreme Wisdom, their merits complete and virtues fulfilled, shall ascend as Highest Perfected if they have already attained the Dao. Those who have not yet attained it shall have their names inscribed in the heavens, and upon the passing of their lives, they shall ascend directly to the Hall of Blessings. The Five Emperors of the Five Peaks in the Eastern Florescence Palace shall proclaim to the Thirty-Two Heavenly Lords of the Heavens, and command the Eight Extremes, the Three Officials, the Nine Bureaus, and the earthly prisons to erase the records of their sins from the Jade Archives of the Nine Dark Prisons, severing the karmic roots of their past lives. The Heavenly Registrars shall inscribe their names in the Golden Register of Divine Immortals. Their seven generations of ancestors shall be freed from earthly toil, ascending to the Southern Palace. In their next lives, they shall be born into gates of wealth and nobility, where they may accumulate merit through diligent cultivation, tirelessly turning the wheel of existence until they attain flight and ascend to the Great Ultimate, achieving the rank of Divine Immortals.\n\nThe Most High Lord of the Dao turned and asked the Flying Celestial Beings of the boundless worlds of the Lower Realm: \"I have often observed the Lower Realm, journeying through the Eight Extremes. I have seen in the hells of the boundless worlds below men and women enduring cruel retributions, bound together in suffering, mired in the filth of the Eight Extremes among the imprisoned multitudes. For what crimes were they born? What transgressions did they commit in life? Which scriptures or laws did they violate to suffer such retribution? What meritorious deeds must be performed to redeem their past offenses, allowing them to be reborn into the human realm?\"\n\nThe Flying Celestial Beings of the Lower Realm replied: \"These beings, in their past lives, disrespected spirits and deities, rejected the teachings of the scriptures, and offended the Earth Spirits, the Five Peaks, and the Four Waterways—sins beyond reckoning. After death, they endure cruel punishments, sinking into the dark hells, and without the statutes of the Luminous Perfected to deliver them, they would remain bound for ten thousand kalpas without release. To liberate them, one must offer thirty-two feet of yellow-patterned silk and a golden dragon, presenting them to the various earthly administrations, the Five Peaks, the famous mountains, the Three Officials of the waters, the Nine Bureaus, the Twelve River Sources, and the Nine Dark Prisons to redeem the sinful souls. For one day and one night, through the twelve hours, burn incense and light lamps, illuminating the depths of the earth and the Nine Dark Prisons, so that the long-imprisoned dead souls may behold the radiant light, receive deliverance, and return to the gate of blessedness.\"\n\nThe Flying Celestial Beings of the Upper Realm declare: In the boundless worlds of the Thirty-Two Heavens of the Upper Realm, among the countless sentient beings—those who have attained the Dao as Highest Sages, Lofty Spirits, and the various Perfected Ones, as well as the men and women still abiding in blessedness who have yet to attain the Dao—those who cultivate and uphold the Ten Precepts of Supreme Wisdom, their merits complete and virtues fulfilled, shall ascend as Highest Perfected if they have already attained the Dao. Those who have not yet attained it shall have their names inscribed in the Thirty-Two Heavens. Upon the passing of their lives, they shall ascend directly to the Hall of Blessings, roaming freely above the Three Realms and the Great Veil, where the heavens make special distinction for them. In the long nights of the Nine Dark Prisons, their records of sin shall be erased, their seven generations of ancestors delivered, ascending to the Southern Palace. Reborn into the human realm, they shall cultivate the good Dao, their karmic affinities spanning lifetimes, their joys unending. They shall attain the rank of Divine Immortals, soaring through the Three Realms and the heavens of the Great Veil.\n\nThe Most High Lord of the Dao turned and asked the Flying Celestial Beings of the Upper Realm: \"I have often observed the Thirty-Two Heavens of the Upper Realm, journeying through the Three Realms. I have seen in the Northern Prison of Heaven, the Azure Luminous Upper Prison, and the Three Rivers’ Repository of Accumulated Darkness men and women naked and bare, deprived of clothing and food, their bodies beaten with iron rods, enduring unbearable suffering. They are dragged through the Three Rivers, drawing and hauling floodwaters to irrigate the Four Waterways, toiling day and night without rest. For what crimes in life did they transgress? Which scriptures or precepts did they violate to suffer such retribution? What meritorious deeds must be performed to redeem them, allowing them to be reborn into the human realm?\"\n\nThe Flying Celestial Beings of the Upper Realm replied: \"In their past lives, these beings did not believe in the Great Dao, doubted and defiled the scriptures, and violated the Ten Precepts, thus receiving their present retribution as forced laborers in Heaven. Without the illumination of the true statutes and deliverance, they shall remain bound for ten thousand kalpas without return. To liberate them, one must offer thirty-two feet of azure-patterned silk and a golden dragon, presenting them at the celestial palaces and bureaus to redeem their past transgressions and deliver the imprisoned dead souls from the Nine Dark Realms. For twelve hours day and night, burn incense and light lamps to illuminate the heavens, the River of Accumulated Darkness, and the Nine Dark Realms, allowing the toiling spirits to behold the light, receive deliverance, and return to the Gate of Blessings.\"\n\nThe Most High Lord Dao turned and bowed, addressing the Heavenly Worthy: \"Today, seated in attendance, I have heard the Flying Celestial Beings of the Ten Directions expound upon the superior methods for uprooting karmic transgressions. The living are delivered, the dead are restored, and within the Nine Dark Realms, all receive illumination. In future lives, men and women who cultivate goodness and faith shall attain this blessing. Through endless kalpas, their affinities shall flourish without cease, their bodies attaining immortality. With incense and lamps offered in devotion, their households shall prosper, guarded by the Three Realms, attended by the myriad spirits. Demons shall be subdued, and a thousand calamities averted. The Great Dao unfolds, its boundless virtue resplendent, towering and unmatched. Rejoicing in the blessings bestowed upon future generations, I cannot contain my joy and have composed this hymn.\"\n\nAt that moment, all the heavens as one voiced their approval.\n\n**Hymn of Everlasting Joy by the Most High Wisdom**\nIn the Dragon Han, the people were pure,\nTheir hearts in harmony with the natural Way.\nThe five emotions knew no strife,\nTheir forms possessed undying spirits.\nThe Dragon Gate severed the long river,\nThe Three Paths no longer enslaved men.\nResting in the Five Dao sanctuaries,\nThe Mountain of Swords and Blades was abolished.\nVast and boundless within the Primordial Han,\nThe Nine Dark Realms held no suffering souls.\nNo wailing of the dead was heard,\nOnly words of everlasting joy.\nNo long-night ghosts were seen,\nOnly soaring celestial immortals.\nWhat joy surpasses this world’s joy?\nThus I chant this hymn of jubilation.\nThe heavens bowed in celebration,\nTogether proclaiming this blessed kalpa.\nIn the Seven Jeweled Grove of the Mysterious Capital,\nThe Ten Heavens enveloped in radiant mist,\nPurple clouds observed the numinous glow,\nCloudscapes adorned the jade peaks.\nAbove stood the Hall of Blessings,\nIts palaces and chambers arrayed in splendor.\nAll were faithful devotees,\nTrue immortals and celestial families.\nThe Three Realms opened the path of mystery,\nThe Five Paths purified, free from deviation.\nGood roots arise from karmic conditions,\nAccumulated merit yields abundant blessings.\nKarmic ties follow in succession,\nThe Great Dao is surely not in vain.\nNo man lives ten thousand years,\nAll share the same origin as the kalpa.\nIn this joyous world of harmony,\nWords become songs of celebration.\nGazing upon this boundless realm,\nWhat shall become of the ages to come?\n\nAt the Cypress Mound Abode within the Grotto of Radiant Yang, the Most High Lord Dao received the precepts and beheld the celestial halls of blessings, where the karmic kin of countless kalpas dwelled in carefree non-action, their clothing and sustenance naturally provided, their bodies radiant with light, accompanied by flying immortals. Free from sorrow and grief, unaware of suffering and hardship, he was moved by both sorrow and joy, and thus composed the *Hymn of Everlasting Joy*.\n\n**Hymn of the Suffering Spirits by the Most High Wisdom**\nBorn into the realm of suffering spirits,\nThey revolve through the courts of the Five Paths.\nThe Nine Dark Realms enclose the eternal night,\nThrough countless kalpas, no light shines.\nBlade mountains and sword trees stand tall,\nTheir poisoned edges gleaming sharp.\nNo flocks of birds gather,\nOnly the cries of suffering souls are heard.\nThe whirling winds sway the long branches,\nMournful echoes drift through the cold courts.\nAbove, the mountain-treading souls,\nToil ceaselessly, without respite.\nHungry, they eat the crooked spring’s charcoal,\nThirsty, they drink the smelting fire’s essence.\nDragged through the Three Paths,\nDo they even know their names?\nPitying their ignorance of fate,\nAlas, how it grieves the heart.\nKarma arises from good and evil,\nVirtue and vice surely stem from the mind.\nThe wheel of rebirth never ceases,\nLike sound that never fades from echo.\nThe Nine Dark Realms hold primordial records,\nThrough ten thousand kalpas, they seek one another.\nThe source of endless icy cold,\nThe long night pierced by layers of darkness.\nNo halls of blessings are seen,\nOnly forests of destitute ghosts.\nThe long river cannot be dammed,\nSuffering souls cling and wail.\nTheir solitary cries reach the edge of the sword,\nTheir lamentations fall upon the blade peaks.\nThese forms are no longer forms,\nAlas, how it wounds the heart.\n\nThe Most High Lord Dao, journeying through the Eight Gates, beheld the prisons of the underworld, their layered barriers, the Three Rivers and Nine Streams, the mountains of blades and forests of swords, the imprisoned hungry ghosts, the toiling dead souls, dragged through the mire and ashes, their forms no longer recognizable. Unable to bear the sight, he was moved to sorrow and thus composed the *Hymn of the Suffering Spirits*.\n\nThe Heavenly Worthy addressed the Most High Lord Dao: \"Today, together with the perfected beings of the Ten Directions and the boundless assembly of great sages, we share the joy of this kalpa, a happiness beyond compare. Our words cannot express it fully, nor can our hearts comprehend it entirely. The teachings of good and evil, the precepts and statutes, have been revealed without concealment. The heavens rejoice as one, proclaiming the Dharma, universally delivering the boundless multitudes. How fortunate are those born in this age, encountering these scriptural teachings! By cultivating goodness, their lives shall be long, free from untimely death. When their final day arrives, they shall ascend directly to the celestial halls, their karmic ties unbroken, all attaining the true Dao.\n\nYet I pity the men and women of future degenerate ages, who shall follow the turning of the kalpa, their hearts constrained by urgency, unknowingly committing sins. Their karmic roots shall sprout, casting them into the Five Paths. Once they stumble from the path of faith, there shall be no return. They shall wander through the Three Paths and the Five Sufferings, amidst blade mountains and sword trees, where blood flies for ten thousand miles, through endless icy cold, where destitute souls fill the night, their wails and lamentations grieving the heart. Alas for their misfortune, once gone, they cannot return.\n\nThus, I expound this scripture for the faithful of future generations, opening the bridge to liberation, enabling all to sever the roots of evil karma, enter the light, and return to goodness. Those who wholeheartedly revere and uphold it shall attain its blessings; those who do not believe shall incur its misfortune.\n\nAfter my departure, this text shall return to the Seven Jeweled Mysterious Terrace within the Purple Tenuity Palace of the Great Luo. In accordance with the statutes of the Illuminated True Mystery, after forty thousand kalpas, it shall descend to the world to teach and deliver the heavens and humanity.\"\n\nNow, I make this known to you, that you may clearly comprehend it.\n\nAt that moment, the assembly of sages and the Most High Dao Lord rejoiced, bowed in reverence, and withdrew.\n\nThe *Upper Scroll on the Roots of Transgression in the Daoist Canon of the Numinous Treasure’s Wisdom* from the *Supreme Cavernous Mystery* thus concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上洞玄灵宝智慧罪根上品大戒经 经名：太上洞玄灵宝智慧罪根上品大戒经。 撰人不详，约出於东晋。 系古《灵宝经》之一。 原本一卷，后分为二卷。 底本出处：《正统道藏》洞玄部戒律类。 太上洞玄灵宝智慧罪根上品大戒经卷上 太上道君时於南丹洞阳上馆柏陵舍，稽首礼问元始天尊：自顾宿世福庆因绿，亿劫运通，得会圣明。 昔蒙显擢，过忝上真，加见训喻三宝神经，赐以大戒，告以法音。 过泰之欢，实为无量。 自受训励，长斋空山，尊承法戒，不敢息倦，道业成就，开度天人，一切男女，普见法门，年命长远，国土安全。 玩乐之心，志在不退，既蒙开悟，愿卒未闻。 不审智慧宿命罪根，灵音秘重，可得暂盼篇目不乎。 如蒙哀怜，重赐戒言，则以幽夜披太阳之光，长劫苦魂，得蒙拔度，更生福堂，道济无外，惠宜普隆，所陈曲碎，惧触天颜，显显之心，实希恩造。 元始天尊，是时当授太上道君《智慧罪根上品戒经》。 五老上帝、大圣尊神、十方至真、诸天上仙、玄和玉女、五万二千五百众诣座。 天洒香华，神龙妓乐无鞅数众，天仙玉女手把十绝灵婶，旋绕日月华精。 神风四会，流香拂尘，紫云吐晖，绛霞敷天，三景齐照，诸天光明。 河海静默，山岳藏烟，龙璃踊跃，人神欢欣。 生死同休，福庆普隆，五苦咸解，三徒并原。 长离地狱，更生天堂，一切众生，并得长年。 於是天尊命召十方飞天神人，开九幽玉匮长夜之函，出生死罪录，恶对种根，十方飞天，各说因绿，以告太上大道君焉。 天尊告日：龙汉之年，我出法度人。 其世愚聋，不知法音，唯用纯朴，无有恶心，不识礼义，无有君臣，不识宿命，不知因绿。 以法训喻，渐入法门，专心信向，无为罪根，命皆长远，不有夭伤。 我过去后，天地破坏，无复光明，男女灰灭，沦於延康，幽幽冥冥亿劫之中。 至赤明开光，天地复位，我又出世，号无名之君，出法教化，度诸天人。 其世男女，行有精粗，不等一心，有信向者，皆得长年，有生嫉害，恶逆不忠，皆夭寿命，便有罪福因绿之根。 我过去后，一劫交周，天地又坏，复无光明，幽幽冥冥，五劫之中。 至开皇元年，灵宝真文开通三象，天地复正，五文焕明，我於始青天中，号元始天尊，流演法教，化度诸天。 始开之际，人民纯朴，结绳而行，混沌用心，合於自然，皆得长寿三万六千年。 至上皇元年，心渐颓坏，恐至凋落，正法不全。 故国国周行，宣授天文，咸令入法，成就诸心。 半劫之中，命渐凋落，寿得一万八千余年。 我过去后，天运转促，人心破坏，更相谋逆。 嫉害胜己，争竞功名，不信经法，疑贰天真。 口是心非，自作一法，淫祀邪神，杀生祈梼。 迷惑不专，更相残害，自取夭伤，命不以理，寿无定年。 致有罪录恶种，展转五道八难之中，沈沦三徒，莫知命根，冥冥长夜，亿劫无还，流曳涂炭，甚可哀伤。 今当相告治身之戒，功德报应，罪恶之对，生死命根。 便可谛受，慎行勿忘，广宣开度，普示天人，咸令男女，归身法门，持戒修斋，远诸恶源，使生死欢泰，得道自然。 道君欢喜，伏听戒言。 天尊言曰：夫欲安身治国，使门户清贵，天神佑护，地祇敬爱，当修善功，勤心斋戒，广施法门。",
      "translated_text": "**The Supreme Cavernous Mystery Numinous Treasure Scripture of the Upper Chapter on the Roots of Transgressions Through Wisdom**\n\n**Scripture Title:** *The Supreme Cavernous Mystery Numinous Treasure Scripture of the Upper Chapter on the Roots of Transgressions Through Wisdom*. Author unknown, approximately composed during the Eastern Jin dynasty. One of the ancient *Numinous Treasure Scriptures*. Originally in one scroll, later divided into two. Source text: *Daoist Canon of the Zhengtong Era*, Cavernous Mystery Section, Precepts and Disciplines Category.\n\n---\n\n**The Supreme Cavernous Mystery Numinous Treasure Scripture of the Upper Chapter on the Roots of Transgressions Through Wisdom, Scroll One**\n\nAt that time, the Supreme Dao Lord was in the Cypress Tumulus Lodge of the Southern Vermilion Cavern’s Yang Upper Palace. Bowing his head in reverence, he inquired of the Primordial Heavenly Worthy: \"By virtue of the karmic blessings of past lives, through countless kalpas of cyclic turning, I have been granted the fortune to encounter this sagely and luminous age. Formerly, I was exalted beyond merit to join the ranks of the Upper Perfected, further receiving instruction in the divine scriptures of the Three Treasures and bestowed with the Great Precepts, wherein the Dharma’s resonance was proclaimed. The joy of such boundless grace is truly immeasurable.\n\nSince receiving these teachings and admonitions, I have maintained perpetual abstinence in the empty mountains, reverently upholding the Dharma precepts without敢怠 or weariness. My Daoist practice has come to fruition, opening the gateway to deliverance for gods and humans alike—all men and women universally behold the Dharma gate, their lifespans prolonged, and their lands secured in peace. My heart delights in this bliss, my resolve unwavering. Yet though I have been awakened, there remains that which I have not yet heard.\n\nI do not know whether the roots of transgressions through wisdom, the numinous resonance of past lives, and the profound secrecy of these teachings may briefly be glimpsed in their entirety. If you would deign to show compassion and once more bestow the words of the precepts, it would be as though the darkest night were illumined by the sun’s radiance, and the suffering souls of endless kalpas, drawn forth from their torments, might be reborn in halls of blessing. The Dao’s salvation would extend without limit, and its grace would universally flourish. Though my petition is trifling and fragmented, I fear it may offend the celestial countenance. My earnest and reverent heart truly hopes for your merciful favor.\"\n\nAt that moment, the Primordial Heavenly Worthy bestowed upon the Supreme Dao Lord *The Scripture of the Upper Chapter on the Precepts of the Roots of Transgressions Through Wisdom*. The Five Elder Thearchs, the Great Sagely Honored Gods, the Perfected of the Ten Directions, the Immortals of the Heavens, the Jade Maidens of Mystery and Harmony, and an assembly of fifty-two thousand five hundred gathered before the seat. Heavenly perfumes and blossoms rained down, while divine dragons and celestial musicians in countless numbers played. Heavenly immortals and jade maidens, bearing the Ten Absolute Numinous Banners, circled the radiance of the sun and moon. Divine winds converged from all directions, wafting incense and scattering dust. Purple clouds emitted their glow, crimson auroras suffused the sky, and the Three Luminaries shone in unison, illuminating all heavens with brilliance. Rivers and seas stilled, mountains and peaks concealed their mists, dragons and pearls leapt in joy, and gods and humans rejoiced together. Birth and death ceased as one, blessings and felicity universally flourished, the Five Sufferings were all dissolved, and the Three Wretched Realms were simultaneously absolved. Those long confined in hells were reborn in celestial palaces, and all sentient beings attained longevity.\n\nThereupon, the Heavenly Worthy commanded the Flying Celestial Beings of the Ten Directions to open the Jade Casket of the Nine Dark Realms, the coffer of eternal night, and bring forth the records of transgressions in life and death, the roots of karmic adversity. The Flying Celestial Beings of the Ten Directions each recounted their causes and conditions, reporting them to the Supreme Great Dao Lord.\n\nThe Heavenly Worthy proclaimed: \"In the era of Dragon Han, I emerged to establish the Dharma and guide humanity. The people of that age were ignorant and deaf to the Dharma’s resonance, living in unadorned simplicity without malice, unaware of propriety or righteousness, without rulers or subjects, ignorant of past lives or karmic causes. Through the Dharma’s instruction, they gradually entered its gate, wholeheartedly believing and turning toward it, free from the roots of transgression. Their lifespans were long, untouched by premature death.\n\nAfter my passing, heaven and earth collapsed, light vanished, and men and women were reduced to ashes, sinking into the era of Yan Kang, plunged into darkness for countless kalpas. When the Crimson Radiance dawned and heaven and earth were restored, I emerged once more, known as the Nameless Lord, to proclaim the Dharma and transform the gods and humans. The people of that age varied in the refinement of their conduct, their hearts not unified. Those who believed and turned toward the Dharma attained long life, while those who harbored jealousy, malice, treachery, and disloyalty met with premature death, thus giving rise to the roots of karmic blessings and transgressions.\n\nAfter my passing, a kalpa turned, and heaven and earth were again destroyed, plunged once more into darkness for five kalpas. In the first year of Kai Huang, the True Writ of the Numinous Treasure opened the Three Symbols, heaven and earth were restored to order, and the Five Scriptures shone forth in brilliance. In the Celestial Realm of Beginning Azure, I was known as the Primordial Heavenly Worthy, unfolding the Dharma’s teachings to transform and deliver the heavens. At the dawn of this era, the people were unadorned, conducting themselves by knotted cords, their minds in primordial chaos, harmonious with the natural. All lived long, their lifespans reaching thirty-six thousand years.\n\nBy the first year of Shang Huang, their hearts gradually decayed, and I feared the Dharma would decline. Thus, I traversed the lands, proclaiming and bestowing the celestial writ, guiding all to enter the Dharma and perfect their hearts. Within half a kalpa, lifespans gradually diminished, reduced to over eighteen thousand years.\n\nAfter my passing, the turning of heaven’s destiny hastened, and the hearts of humanity decayed further, turning to mutual deception and treachery. They envied and harmed those superior to themselves, contended for fame and merit, disbelieved the scriptures and Dharma, and doubted the Perfected of Heaven. Their words and hearts were at odds, each creating their own Dharma, worshipping heterodox spirits with licentious rites, and slaughtering living beings in prayer. Bewildered and uncentered, they mutually harmed one another, bringing upon themselves premature death, their lifespans devoid of principle, their years uncertain. Thus arose the records of transgressions and the seeds of evil, revolving endlessly within the Five Paths and Eight Difficulties, sinking into the Three Wretched Realms, ignorant of the roots of their destinies. Plunged into eternal night for countless kalpas, they drifted through the mire of suffering, a pitiable and grievous fate.\n\nNow I shall proclaim to you the precepts for governing the body, the karmic retributions of merit and transgression, the adversities of evil, and the roots of life and death. Listen carefully, receive them with reverence, and never forget. Widely proclaim and disseminate them to universally instruct gods and humans, guiding all men and women to return their bodies to the Dharma gate, uphold the precepts, practice abstinence, and distance themselves from the sources of evil. Thus may the joys of life and death be secured, and the Dao attained naturally.\"\n\nThe Dao Lord rejoiced and prostrated himself to receive the precepts.\n\nThe Heavenly Worthy said: \"If one desires to pacify the body and govern the state, to render one’s household pure and noble, to receive the protection of celestial gods and the reverence of earthly spirits, one must cultivate meritorious deeds, diligently practice abstinence and precepts, and broadly bestow the Dharma gate.\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1228,
      "start_sentence": 0,
      "end_sentence": 42,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.181907176971436,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\戒律类\\太上洞玄灵宝智慧罪根上品大戒经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "先人后身，有惠於万物，功普於一切，功满三千，白日升天，修善有余，天降云车。 弘道无已，自致不死。 斯本行之上戒，可不遵奉之乎。 一者，当恤死护生，救度厄难，命得其寿，不有夭伤。 二者，救疾治病，载度困笃，身得安全，不有痛剧。 三者，施惠穷困，拯度危厄，割己济物，无有吝惜。 四者，奉侍师宝，营靖建舍，广作功德，无有息倦。 五者，书经校定，晨夕礼诵，供养香灯，心无替慢。 六者，修斋念道，恭心遵法，内外清虚，不生秽恶。 七者，退身护义，不争功名，抱素守朴，行应自然。 八者，宣化愚俗，谏诤解恶，咸令一心，宗奉大法。 九者，边道立井，植种果林，教化童蒙，劝人作善。 十者，施为可法，动静可观，教制可轨，行常使然。 此十善因缘上戒之律，十天神王所奉，能行之者飞天齐功。 次当持身慎行，与人君言则惠於国，与人父言则慈於子，与人师言则爱於众，与人兄言则悌於行，与人臣言则忠於君，与人子言则孝於亲，与人友言则信於交，与人妇言则贞於夫，与人夫言则和於室，与人弟子言则恭於礼，与野人言则劝於农，与道士言则正於道，与异国人言则各守其域，与奴婢言则慎於事。 此一十四戒持身之品，四天帝王常所宗奉，普告四方正士神祇，人民百姓，子男女人，咸使行此上品，参於四天自然福堂。 能行之者，四天所贵，地祇所称，位比仙王。 次有上品百八十戒，中品八十戒，下品四十戒，并元始智慧三品之律，撰为观身大戒，合三百首。 自非上仙之德，身洞三清，体入自然，莫能奉之。 末世男女，心当破坏，行渐怠纵，并怀疑贰，趣竞万端，守真者少，必当不能宗承观身，既不遵奉，必致大殃。 今撰上品十戒之律，可以度人，广加开化，令入法门。 勤奉之者，则获自然之福，无为之道也。 十戒者： 一者，不得嫉妬胜己，抑绝贤明。 二者，不得饮酒放荡，秽乱三宫。 三者，不得淫犯他妻，好贪细滑。 四者，不得弃薄老病，穷贱之人。 五者，不得诽谤善人，毁攻同学。 六者，不得贪积珍宝，弗肯施散。 七者，不得杀生祠祀，六天鬼神。 八者，不得意论经典，以为虚诞。 九者，不得背师恩义，斯诈新学。 十者，平等一心，仁孝一切。 此十戒普教十方无极世界，度一切人。 能奉之者，功书十天，福延七祖，拔出长夜九幽之中，上升南宫。 身入光明，因缘不绝，克得神仙。 诸行并足，当避十恶，远於盲道，断灭罪根。 十恶者： 一者，饮酒淫色，贪欲无已。 二者，阴贼世间，讪谤道士。 三者，轻师慢法，傲忽三宝。 四者，窃取经书，妄宣道要。 五者，借换不还，欺诱万民。 六者，杀生贪味，口是心非。 七者，不孝背恩违义，犯诸禁忌。 八者，诵经忽略，唝嗃自是。 九者，责望人意，瞋恚四辈。 十者，意断经旨，损益圣典，不信宿命，快情恣为，秽慢四大，不念生道。 此十恶之戒，不能离身。 犯之者身遭众横，鬼神害命，考楚万痛，恒无一宁，履善遇恶，万向失利。 死入地狱，幽闭重槛长夜之中，不睹三光，昼夜流曳。 抱铜柱，履刀山，循剑树，入镬汤，吞火食炭，五苦备经，长沦九幽，无有生期，纵得解脱，还生六畜之中，不得人道。 恶恶相牵，善善相因，罪福之对，如日月之垂光，生死之不灭，如影之随形，缘转相加，如车之轮。",
      "translated_text": "\"First the others, then oneself—bestowing kindness upon the myriad beings, extending merit to all things. When merit fills the three thousand, one ascends to heaven in broad daylight; with virtue cultivated in abundance, clouds and chariots descend from the heavens. To propagate the Dao without cease is to attain immortality of oneself. These are the supreme precepts of fundamental conduct—how could one not reverently uphold them?\n\nFirst: One must succor the dying and protect the living, rescuing those in dire peril, that life may fulfill its destined span without untimely harm.\nSecond: One must heal the sick and treat the afflicted, carrying those in grave distress, that the body may attain safety without enduring agony.\nThird: One must bestow kindness upon the destitute, deliver those in peril, and sacrifice one’s own to aid others, without stinginess or reluctance.\nFourth: One must serve and honor the masters and treasures, establish quiet abodes, and broadly perform meritorious deeds, without weariness or slackening.\nFifth: One must transcribe and collate scriptures, recite and pay homage morning and evening, offer incense and lamps, and maintain a mind free from negligence or arrogance.\nSixth: One must cultivate abstinence and contemplate the Dao, reverently uphold the Dharma, purify both inner and outer, and refrain from generating defilement or evil.\nSeventh: One must withdraw from worldly pursuits to protect righteousness, avoid contention for fame and merit, embrace simplicity and preserve purity, and act in accordance with the natural.\nEighth: One must enlighten the ignorant and vulgar, admonish and dispel evil, guiding all to single-minded devotion in venerating the Great Dharma.\nNinth: One must dig wells along roadsides, plant orchards and groves, instruct the young and unlearned, and exhort others to perform good deeds.\nTenth: One’s conduct must serve as a model, movements and stillness must be worthy of observation, teachings and systems must provide guidance, and actions must always remain thus.\n\nThese ten meritorious causes are the supreme precepts of the precept-code, revered by the Ten Heavenly Kings. Those who practice them attain merit equal to that of the flying immortals.\n\nNext, one must maintain vigilance in conduct and speech: when addressing a ruler, one’s words should benefit the state; when addressing a father, they should foster kindness toward his children; when addressing a teacher, they should inspire love for the multitude; when addressing an elder brother, they should cultivate fraternal respect in action; when addressing a minister, they should uphold loyalty to the sovereign; when addressing a child, they should nurture filial piety toward parents; when addressing a friend, they should foster trust in fellowship; when addressing a wife, they should encourage chastity toward her husband; when addressing a husband, they should promote harmony in the household; when addressing a disciple, they should cultivate reverence for propriety; when addressing a rustic, they should encourage diligence in agriculture; when addressing a Daoist, they should rectify the Dao; when addressing a foreigner, they should ensure each remains within their own domain; when addressing servants and maids, they should exercise caution in their duties.\n\nThese fourteen precepts on maintaining personal conduct are constantly revered by the Four Heavenly Emperor-Kings. They are universally proclaimed to the noble spirits of the four directions, the people of all walks, and men and women alike, that all may practice these supreme precepts and ascend to the natural halls of bliss of the Four Heavens. Those who practice them are esteemed by the Four Heavens, praised by the earthly spirits, and their rank equals that of the Immortal Kings.\n\nNext, there are the one hundred and eighty upper precepts, eighty middle precepts, and forty lower precepts, together with the three grades of the Primordial Beginning’s wisdom precepts, compiled into the *Great Precepts for Observing the Body*, totaling three hundred. Unless one possesses the virtue of a superior immortal, with a body pervading the Three Clarities and a nature merged with the natural, none can uphold them.\n\nIn the degenerate age, the minds of men and women will be corrupted, their conduct gradually lax and indulgent, filled with doubt and division. Pursuits and competitions will be myriad, and those who preserve the truth will be few. They will surely be unable to revere and uphold the *Precepts for Observing the Body*. Having failed to observe them, they will inevitably incur great calamity.\n\nNow, the upper ten precepts are compiled to deliver beings and broadly propagate transformation, guiding them into the Dharma gate. Those who diligently uphold them will attain the blessings of the natural and the Dao of non-action.\n\nThe Ten Precepts are as follows:\nFirst: Do not envy those superior to oneself or suppress the worthy and wise.\nSecond: Do not indulge in wine or licentiousness, defiling the Three Palaces.\nThird: Do not commit adultery with another’s spouse or covet sensual pleasures.\nFourth: Do not abandon or despise the elderly, sick, destitute, or lowly.\nFifth: Do not slander the virtuous or malign fellow practitioners.\nSixth: Do not hoard treasures and refuse to bestow or distribute them.\nSeventh: Do not kill living beings to sacrifice to the Six Heavenly Ghost-Spirits.\nEighth: Do not arbitrarily discuss scriptures, dismissing them as false and absurd.\nNinth: Do not betray the kindness and righteousness of one’s teacher, feigning devotion as a new disciple.\nTenth: Maintain an equanimous mind and practice benevolence and filial piety toward all.\n\nThese Ten Precepts are universally taught throughout the boundless worlds to deliver all beings. Those who uphold them will have their merit recorded in the Ten Heavens, their blessings extending to seven generations of ancestors, lifting them from the long night of the Nine Dark Realms to ascend to the Southern Palace. Their bodies will enter the radiance of light, their karmic connections unbroken, and they will attain the state of divine immortals. With all practices fulfilled, one must avoid the Ten Evils, distance oneself from the blind path, and sever the roots of sin.\n\nThe Ten Evils are as follows:\nFirst: Indulging in wine and lust, with insatiable greed and desire.\nSecond: Secretly harming the world and slandering Daoists.\nThird: Disrespecting teachers and the Dharma, arrogantly neglecting the Three Treasures.\nFourth: Stealing scriptures and recklessly proclaiming the essentials of the Dao.\nFifth: Borrowing and failing to return, deceiving and misleading the people.\nSixth: Killing living beings for taste, with a mouth that praises but a heart that denies.\nSeventh: Being unfilial, betraying kindness, violating righteousness, and transgressing all prohibitions.\nEighth: Reciting scriptures carelessly, being haughty and self-righteous.\nNinth: Demanding compliance with one’s expectations, harboring anger toward the four classes of beings.\nTenth: Distorting the meaning of scriptures, altering or diminishing the sacred texts, disbelieving in past lives, indulging in reckless desires, defiling and disdaining the Four Great Elements, and neglecting the path of life.\n\nThese Ten Evils cannot be separated from the body. Those who violate them will suffer myriad misfortunes, their lives harmed by ghosts and spirits, enduring endless torment without a moment’s peace. Though they tread the path of goodness, they will encounter evil, and all their endeavors will fail. Upon death, they will enter hell, confined in the heavy barriers of the long night, never beholding the Three Lights, drifting day and night. They will embrace the bronze pillars, tread the knife mountains, traverse the sword trees, plunge into cauldrons of boiling water, swallow fire and eat coals, enduring the five sufferings in full. They will be eternally submerged in the Nine Dark Realms, without hope of rebirth. Even if they attain liberation, they will be reborn among the six kinds of animals, never regaining human form. Evil draws evil, just as goodness begets goodness. The retribution of sin and blessing is like the sunlight descending, while the unceasing cycle of life and death follows the shadow accompanying the form. Karmic consequences accumulate like the turning of a wheel.\"",
      "overlap_context": "the sources of evil. Thus may the joys of life and death be secured, and the Dao attained naturally.\"\n\nThe Dao Lord rejoiced and prostrated himself to receive the precepts.\n\nThe Heavenly Worthy said: \"If one desires to pacify the body and govern the state, to render one’s household pure and noble, to receive the protection of celestial gods and the reverence of earthly spirits, one must cultivate meritorious deeds, diligently practice abstinence and precepts, and broadly bestow the Dharma gate.\"",
      "start_char": 1228,
      "end_char": 2568,
      "start_sentence": 43,
      "end_sentence": 95,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.78580451011658,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\戒律类\\太上洞玄灵宝智慧罪根上品大戒经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "今说是戒，护度天人，明识谛受，勤行勿忘。 若清信士女，必能保持十戒，才力兼赡，欲勤行精进，广施众善者，可授十二可从，开示十善十四持身之品也。 天尊言：夫为学者修斋求道，开度天人，作诸善功，当行十二可从戒，而得度世者，尔宜从之，自得正真，终入无为，所愿皆成。 十二可从戒者： 一者，见真经正法，开度一切，便发道意，心愿后世得登大圣。 二者，常行慈心，愿念一切，普得见法，开度广远，无有障碍。 三者，好乐经教，深远览达，意志坚明，开化愚暗。 四者，遵受师训，广开劝化，令入法墙，远离盲道。 五者，信向玄妙，尊奉经诀，晨夕诵习，无有怠倦。 六者，不务荣华，断绝因缘，专心定志，所营在法。 七者，勤诵大经，愿念一切，广开桥梁，为来生作善绿。 八者，恒生善心，不邪不伪，无嫉无害，无恶无拓。 九者，在所随生，常值圣世，兴灵宝法教，相值不绝。 十者，洁身持戒，修斋建功，广救群生，咸得度脱。 十一者，学业广览，宣通同法，预以天人，普令开度。 十二者，常与明师，世世相值，受教宣化，度人无量，一切善心，皆得道真 天尊言：夫学士治行之法，当行十二可从之戒。 能以一心行此善念，世世得见圣，与道结缘，诸天友识，独步三界，无所挂碍。 长离三恶五道八难，神明敬护，地祇拥卫，门户清肃，万灾不干，可谓端坐而得道也。 勤为习诵，广宣同学，皆使一切齐入法门。 是时，天尊说戒都毕，太上道君、十方至真、无极大圣、高玄真人，欢喜作礼，一时东向稽首伏地。 太上道君前进长跪，上白天尊言：众真侍坐，得闻法音，诸天踊跃，喜庆难胜。 大法既兴，普度天人，来生男女，当受此恩。 然见世愚聋，未见命根，不知罪福，所从何来，虽加开悟，不信者众。 已垂训喻，愿卒皇恩普赐，十方无极世界百姓子男女人，同时开悟，得见宿命善恶因缘，罪福报应，知有命根，普天获济，法教日隆。 於是天尊放身威光，内外洞彻，照明十方，无幽无隐，无极无穷，一时晓明，如见眼前。 是男是女，悉是诸天之上福堂善人，逍遥无为，欢乐自然。 下见诸地九幽之府，长夜之中，囚徒作役，饿鬼畜生，流曳死魂，首体髡截，无复身形，幽闭重槛，不睹三光。 百姓男女并见命根罪福缘对善恶之报，莫不震惶、一时归心，宗奉大法，修行众善，投命天尊，伏从禁戒，无复退转，福德普匝，欢乐难言，不胜喜庆。 诸天大圣莫不称善，故作颂曰： 十天轮空洞，死生从中归。 善恶各生根，缘对初无亏。 昔见清信士，故得十天飞。 历观九幽夜，苦魂攀岭悲。 长河难闭塞，刀山不可回。 轮转五道中，恻怆伤人怀。 天尊说禁戒，朗朗长夜开。 诸天并欢悦，斯乐难可偕。 天尊言：今当命使诸天神人说诸罪录，宣通法音，开悟群生，觉诸天人，善男子、善女人。 令知身行罪恶命根，因缘不绝，殃对相寻，流曳三涂五道之中，魂形苦恼，亿劫无还。 故说是戒，令入法门，开度九幽，拔出苦根，使生者见道，身脱八难，死者欢乐，上升天堂，早生人中，转轮圣王，生死庆泰，世世长存。 预以信向，皆当精心，奉戒持斋，自得道真，慎行勤修，谛受勿忘，能同大法，便当伏听。",
      "translated_text": "Here now is the precept expounded, to shield and ferry gods and humans, to illuminate and discern, to receive with clarity, and to practice diligently without forgetfulness.\n\nIf faithful men and women can steadfastly uphold the Ten Precepts, their capacity and strength both ample, and aspire to practice with diligence and advance in purity, widely bestowing manifold goodness, they may be conferred the Twelve Permissible Observances, and instructed in the Ten Virtues and the Fourteen Rules for Conduct.\n\nThe Heavenly Worthy declared: Those who study, perform purification rites, and seek the Dao, who deliver gods and humans and perform all meritorious deeds, ought to practice the Twelve Permissible Precepts. Through these, they may attain deliverance from the world. You should follow them, thereby attaining true perfection and ultimately entering the realm of non-action, with all aspirations fulfilled.\n\nThe Twelve Permissible Precepts are as follows:\n\nFirst, upon encountering true scriptures and the orthodox Dharma, delivering all beings, one should awaken the Dao-mind, vowing that in future lives one may ascend to the rank of great sage.\n\nSecond, one should constantly practice a heart of compassion, wishing that all beings may behold the Dharma, be delivered far and wide, without obstruction.\n\nThird, one should delight in the scriptural teachings, deeply and broadly comprehending them, with a will firm and bright, enlightening the ignorant and benighted.\n\nFourth, one should follow the instructions of one’s teacher, widely exhorting and transforming others, guiding them into the enclosure of the Dharma, far from blind paths.\n\nFifth, one should trust in and turn toward the profound and wondrous, reverently upholding the scriptural instructions, reciting and studying them morning and evening without weariness or sloth.\n\nSixth, one should not pursue glory and splendor, severing karmic entanglements, concentrating the mind and fixing the will, with all endeavors directed toward the Dharma.\n\nSeventh, one should diligently recite the great scriptures, wishing for all beings, widely building bridges, and creating good causes for future lives.\n\nEighth, one should constantly generate a heart of goodness, neither deviant nor false, without jealousy or harm, without malice or obstruction.\n\nNinth, wherever one is reborn, one should always encounter a sagely age, with the Lingbao teachings flourishing, never failing to meet them.\n\nTenth, one should purify the body and uphold the precepts, perform purification rites and establish merit, widely rescuing all beings, that all may attain deliverance.\n\nEleventh, one should broadly study and comprehend the teachings, propagating and communicating them to fellow practitioners, thereby including gods and humans, universally delivering all.\n\nTwelfth, one should always encounter enlightened teachers, life after life, receiving instruction and propagating transformation, delivering countless beings. All good intentions shall attain the true Dao.\n\nThe Heavenly Worthy declared: The method for scholars to cultivate conduct lies in practicing the Twelve Permissible Precepts. If one can practice these good intentions with a single mind, life after life one will behold the sagely, form karmic bonds with the Dao, befriend the gods, and walk alone through the Three Realms without hindrance. One will forever depart from the Three Evil Paths, the Five Destinies, and the Eight Difficulties. Divine spirits will respect and protect, earthly deities will surround and guard. One’s household will be pure and solemn, myriad calamities will not encroach. Truly, one may sit upright and attain the Dao.\n\nDiligently study and recite, widely propagate to fellow learners, that all may together enter the Dharma-gate.\n\nAt that time, when the Heavenly Worthy had finished expounding the precepts, the Most High Lord of the Dao, the Perfected of the Ten Directions, the Boundless Great Sages, and the Lofty Transcendent Ones all rejoiced, made obeisance, and simultaneously faced east, prostrating themselves to the ground.\n\nThe Most High Lord of the Dao advanced, knelt, and addressed the Heavenly Worthy, saying: \"All the Perfected in attendance, having heard the Dharma-sound, and the gods of the heavens, leap for joy, their delight beyond measure. As the Great Dharma flourishes, it universally delivers gods and humans. In future lives, men and women shall receive this grace. Yet we see that the world’s foolish and deaf do not perceive the root of destiny, nor know the consequences of sin and blessing, whence they arise. Though exhorted and awakened, many do not believe. Having already bestowed instruction and admonition, we now pray that Your August Grace be universally bestowed, that the men, women, and children of the boundless worlds in the ten directions may simultaneously awaken, perceive the karmic conditions of past lives—good and evil, the retribution of sin and blessing—and know the root of destiny. May all under heaven attain deliverance, and the Dharma-teachings daily flourish.\"\n\nThereupon, the Heavenly Worthy emitted the radiance of his majestic body, illuminating within and without, shining through the ten directions. No darkness remained hidden, no bound was left unpervaded. All was instantly illuminated, as if seen before one’s eyes. All men and women were revealed as blessed beings from the halls of goodness above the heavens, carefree and at ease, their joy natural. Below, they beheld the Nine Dark Realms of the earthly prisons, the long night’s confines, where prisoners toiled, hungry ghosts and beasts, drifting dead souls, their heads and bodies shorn and severed, no longer possessing human form. They were shut in heavy barriers, never beholding the Three Lights. All men and women saw the root of destiny, the karmic conditions of sin and blessing, the retribution of good and evil. None were not struck with awe, all simultaneously turned their hearts, revered and upheld the Great Dharma, practiced manifold goodness, entrusted their lives to the Heavenly Worthy, and submitted to the prohibitions and precepts, never again turning back. Blessings and virtue universally pervaded, their joy indescribable, their delight beyond measure.\n\nThe Great Sages of the heavens all extolled the good, and composed a hymn, saying:\n\nThe Ten Heavens wheel through the empty void,\nLife and death return therein.\nGood and evil each bear their roots,\nKarmic conditions never fail in their response.\nOf old, we saw the faithful,\nThus ascending the Ten Heavens.\nGazing upon the long night of the Nine Dark Realms,\nThe suffering souls climb the sorrowful peaks.\nThe Long River cannot be dammed,\nThe Knife Mountains cannot be turned back.\nRevolving in the Five Paths,\nPity and sorrow fill the heart.\nThe Heavenly Worthy expounds the prohibitions,\nBrightly dispelling the long night.\nThe heavens all rejoice,\nThis joy cannot be matched.\n\nThe Heavenly Worthy declared: Now I shall command the divine messengers and gods of the heavens to proclaim the records of sins, propagate the Dharma-sound, awaken all beings, and enlighten the gods and humans—good men and good women. Let them know the karmic roots of bodily actions, sin, and evil, the unbroken conditions, the calamitous consequences that pursue, drifting in the Three Wretched Paths and the Five Destinies, where souls and forms suffer torment, for kalpas without return. Therefore, these precepts are expounded, to guide them into the Dharma-gate, deliver the Nine Dark Realms, extract the roots of suffering, that the living may behold the Dao and escape the Eight Difficulties, the dead may rejoice and ascend to the heavens, be reborn early among humans, become Wheel-Turning Sage Kings, and in life and death know peace, existing for ages unending. Those who beforehand trust and turn toward the Dharma should all concentrate their minds, uphold the precepts and perform purification rites, thereby attaining the true Dao. Be cautious in practice, diligent in cultivation, receive with clarity and never forget. Those who can align with the Great Dharma should now submit and listen.",
      "overlap_context": " enduring the five sufferings in full. They will be eternally submerged in the Nine Dark Realms, without hope of rebirth. Even if they attain liberation, they will be reborn among the six kinds of animals, never regaining human form. Evil draws evil, just as goodness begets goodness. The retribution of sin and blessing is like the sunlight descending, while the unceasing cycle of life and death follows the shadow accompanying the form. Karmic consequences accumulate like the turning of a wheel.\"",
      "start_char": 2568,
      "end_char": 3827,
      "start_sentence": 96,
      "end_sentence": 137,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.75840926170349,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\戒律类\\太上洞玄灵宝智慧罪根上品大戒经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "太上洞玄灵宝智慧罪根上品大戒经卷上竟 太上洞玄灵宝智慧罪根上品大戒经卷下 东极世界飞天神人曰：东方无极世界恒沙众生，已得道过去及未得道见在福中善男子善女人，修奉智慧上品十戒，功满福报，致得乘空，白日飞行，驾景策龙，上登玉清，游行东极九炁天中。 未得道者，生世富贵，位为人尊，年命长远，并无夭伤。 东方青帝，皆即列名、奏言九炁上天九炁天官，告下东方三官九署地牢之中，削落青元九幽玉匮长夜之函宿世罪根。 青天司命勒录诸天神仙簿中，七祖皆得上升天堂，衣食自然，随年更生帝王之门，世世欢乐，恒居福中，因缘不绝，故得信根。 太上道君顾问东极世界飞天神人曰：我尝历观诸天，出游东门，见东方无极世界地狱之中，有百姓子男女人身受考挞，诸痛备婴，形体毁悴，苦毒难言。 见之悲伤，谪役几年，当得解脱，为还人中，更还恶缘。 如此之辈，当作何功德，以拔此怨，使得开度，还入善门。 东极世界飞天神人曰：其人所犯元恶罪录，结在九幽长夜之函，九炁天君青天灵官三界司算结其目录，依玄都女青上宫左官律，九万劫得还，生非人之道，输转九亿万劫。 天地数极，乃得作九河都役使，此之辛苦，非可能言。 欲得开度，断绝恶缘，当依明真玉匮女青上宫科品，以青纹之缯九十尺，亦可九尺，金龙一枚，诣东方九炁天君东乡诸灵官，九幽之中，拔赎苦魂，绝诸罪根。 九日九夜，明灯烧香，首谢天君，九幽之下，得见光明，可得解脱，还入善缘。 九年皆得还生人中，世世欢乐，福庆无穷。 东南世界飞天神人曰：东南无极世界恒沙众生，已得道过去及未得道见在福中善男子善女人，修奉智慧上品十戒，功满福报，名书上清，或位登上圣，或为神仙，游行五岳，驾龙乘虚，见在世上，为人师宗，万姓所仰，三界所敬，门户清贵，福庆无穷。 东南地司皆列名上言梵炁上天，梵炁天官告下东南三官九府百二十曹，削落黄元九幽玉匮长夜之函宿世罪根。 梵天司命勒录梵天神仙籍中，七祖普得去离三涂，上升天堂，衣饭天厨。 一十二年皆得更生福德之门，帝王之家，世世欢乐，轮转因缘，遂得飞仙。 太上道君顾问东南世界飞天神人曰：我尝历观诸天，出游东南门，见东南无极世界地狱之中，有百姓子男女人，受此恶对，苦毒难言，见之悲伤，甚可哀愍。 被责几年，当得解脱，蒙赦之日，为生人中，为作可形，如此之辈，有何功德，可相解度。 东南世界飞天神人曰：斯人所行，罪在酷逆，结於九幽长夜之函，一炁天君梵炁诸灵官三界司等结其罪录，依玄都女青中宫中官律，万劫得还，生贱人之中，身婴六极，或抱残伤，或生弃疾，轮转十二万劫无数之周，乃得作东岳都役使。 其人艰辛，非可能言。 欲得拔度，还於善缘，当依明真玉匮女青中宫科品，以黄文之缯一百二十尺，亦可一十二尺，金龙一枚，诣东南梵炁天君东南诸灵官九幽之中，拔赎罪魂。 一十二日一十二夜，明灯烧香，首谢天君，可得开度，见诸光明，一十二年皆得还生福德之门，世世欢乐，永享无穷。 南方无极世界飞天神人曰：南方无极世界恒沙众生，已得道过去及未得道见在福中善男子善女人，修奉智慧上品十戒，功满德备，丹天福报，已得道者，位登上真，或为神仙，或为灵官，或得灭度。",
      "translated_text": "The Upper Scroll of the *Highest Cavern Mystery Numinous Treasure Scripture of the Wisdom Roots of Transgressions, Upper Grade Precepts* concludes.\nThe Lower Scroll of the *Highest Cavern Mystery Numinous Treasure Scripture of the Wisdom Roots of Transgressions, Upper Grade Precepts* begins.\n\nThe Flying Heavenly Deity of the Eastern Ultimate World declares: In the Eastern Boundless World, the multitude of beings as numerous as the sands of the Ganges—those who have already attained the Dao in past lives and those presently virtuous men and women of good fortune who have yet to attain the Dao—who cultivate and uphold the Ten Upper-Grade Precepts of Wisdom, when their merit is complete and their blessings fulfilled, shall ascend through the void, soaring in broad daylight, riding upon the radiance and spurring dragons, ascending to the Jade Purity, and roaming amidst the Nine Qi Heavens of the Eastern Ultimate.\n\nThose who have not yet attained the Dao shall be born into wealth and nobility in the world, occupying honored positions among humans, with long lifespans and no premature death.\n\nThe Azure Emperor of the East shall inscribe their names and memorialize the Nine Qi Heaven, the Nine Qi Heavenly Officials, who shall then decree to the Three Offices and Nine Bureaus of the Eastern Earthly Prisons, erasing their names from the Azure Register of the Nine Dark Realms and the Everlasting Night Scrolls of the Jade Casket, severing the roots of their past-life transgressions.\n\nThe Life-Commanders of the Azure Heaven shall record them in the registers of heavenly immortals, and their seven generations of ancestors shall all ascend to the heavens, clothed and fed by nature, reborn in successive generations into the gates of emperors and kings, rejoicing in life after life, forever dwelling in good fortune, their karmic conditions unbroken, thus attaining the root of faith.\n\nThe Most High Dao Lord turned and asked the Flying Heavenly Deity of the Eastern Ultimate World: \"I have often traversed the heavens and journeyed through the Eastern Gate, where I beheld in the Eastern Boundless World’s hells the common folk—men and women—enduring floggings and torments, their bodies afflicted with every pain, their forms emaciated and withered, their suffering beyond words. Witnessing this, I grieved deeply. How many years must they endure this penal servitude before they may be released, return to the human realm, and escape their evil karmic conditions? What meritorious deeds must such beings perform to extricate themselves from this enmity, attain deliverance, and re-enter the gate of goodness?\"\n\nThe Flying Heavenly Deity of the Eastern Ultimate World replied: \"The transgressions of these beings are recorded in the Everlasting Night Scrolls of the Nine Dark Realms. The Nine Qi Heavenly Lords, the Azure Heavenly Numinous Officials, and the Three Realms’ Registrars have tallied their offenses. According to the statutes of the Left Bureau of the Jade Maiden of the Mysterious Capital’s Upper Palace, they must endure ninety thousand kalpas before they may return, reborn into non-human destinies, and undergo transmigration for ninety million kalpas. Only when the reckoning of heaven and earth is exhausted may they serve as laborers in the Nine Rivers, their hardships beyond description. To attain deliverance and sever their evil karmic conditions, they must follow the regulations of the Luminous Perfected Jade Casket and the Jade Maiden of the Upper Palace’s statutes: present ninety feet of azure-patterned silk (or nine feet), and one golden dragon, to the Nine Qi Heavenly Lord of the East and the Eastern Numinous Officials of the Nine Dark Realms, to redeem and extricate the suffering souls, cutting off the roots of their transgressions. For nine days and nine nights, they must illuminate lamps, burn incense, and prostrate in repentance before the Heavenly Lord. Then, in the depths of the Nine Dark Realms, they shall behold the light and attain liberation, re-entering the conditions of goodness. Within nine years, they shall all be reborn among humans, rejoicing in life after life, their blessings and felicity boundless.\"\n\nThe Flying Heavenly Deity of the Southeastern World declares: In the Southeastern Boundless World, the multitude of beings as numerous as the sands of the Ganges—those who have already attained the Dao in past lives and those presently virtuous men and women of good fortune who have yet to attain the Dao—who cultivate and uphold the Ten Upper-Grade Precepts of Wisdom, when their merit is complete and their virtue perfected, shall receive the blessings of the Cinnabar Heaven. Those who have attained the Dao shall ascend to the rank of Highest Perfected, become immortals or numinous officials, or attain extinction.\n\nTheir names shall be inscribed in the Upper Clarity, and they may ascend to the ranks of highest sages or become immortals, roaming the Five Peaks, riding dragons and traversing the void. In the present world, they shall serve as teachers and exemplars to humanity, revered by the myriad clans, respected by the Three Realms, their households noble and pure, their blessings and felicity boundless.\n\nThe Southeastern Earthly Offices shall inscribe their names and memorialize the Brahma Qi Heaven, the Brahma Qi Heavenly Officials, who shall then decree to the Three Offices, Nine Courts, and One Hundred Twenty Bureaus of the Southeast, erasing their names from the Yellow Register of the Nine Dark Realms and the Everlasting Night Scrolls of the Jade Casket, severing the roots of their past-life transgressions.\n\nThe Life-Commanders of the Brahma Heaven shall record them in the registers of Brahma Heaven’s immortals, and their seven generations of ancestors shall all depart the Three Wretched Realms, ascend to the heavens, and feast upon the celestial kitchens. Within twelve years, they shall all be reborn into the gates of good fortune and virtue, the households of emperors and kings, rejoicing in life after life, their karmic conditions revolving until they attain the flight of immortals.\n\nThe Most High Dao Lord turned and asked the Flying Heavenly Deity of the Southeastern World: \"I have often traversed the heavens and journeyed through the Southeastern Gate, where I beheld in the Southeastern Boundless World’s hells the common folk—men and women—enduring these evil retributions, their suffering beyond words. Witnessing this, I grieved deeply, filled with pity. How many years must they endure punishment before they may be released? When pardoned, they shall be reborn among humans, assuming whatever forms they may. What meritorious deeds must such beings perform to attain deliverance?\"\n\nThe Flying Heavenly Deity of the Southeastern World replied: \"The transgressions of these beings are of the cruelest and most perverse kind, recorded in the Everlasting Night Scrolls of the Nine Dark Realms. The One Qi Heavenly Lord, the Brahma Qi Numinous Officials, and the Three Realms’ Registrars have tallied their offenses. According to the statutes of the Central Bureau of the Jade Maiden of the Mysterious Capital’s Central Palace, they must endure ten thousand kalpas before they may return, reborn among the lowly, their bodies afflicted with the Six Extremities, bearing deformities or chronic illnesses. They shall undergo transmigration for twelve myriad kalpas without number before they may serve as laborers in the Eastern Peak. Their hardships are beyond description. To attain deliverance and return to the conditions of goodness, they must follow the regulations of the Luminous Perfected Jade Casket and the Jade Maiden of the Central Palace’s statutes: present one hundred twenty feet of yellow-patterned silk (or twelve feet), and one golden dragon, to the Brahma Qi Heavenly Lord of the Southeast and the Southeastern Numinous Officials of the Nine Dark Realms, to redeem and extricate the sinful souls. For twelve days and twelve nights, they must illuminate lamps, burn incense, and prostrate in repentance before the Heavenly Lord. Then they shall attain deliverance, behold the light, and within twelve years, all shall be reborn into the gates of good fortune and virtue, rejoicing in life after life, forever enjoying boundless blessings.\"\n\nThe Flying Heavenly Deity of the Southern Boundless World declares: In the Southern Boundless World, the multitude of beings as numerous as the sands of the Ganges—those who have already attained the Dao in past lives and those presently virtuous men and women of good fortune who have yet to attain the Dao—who cultivate and uphold the Ten Upper-Grade Precepts of Wisdom, when their merit is complete and their virtue perfected, shall receive the blessings of the Cinnabar Heaven. Those who have attained the Dao shall ascend to the rank of Highest Perfected, become immortals or numinous officials, or attain extinction.",
      "overlap_context": "d may rejoice and ascend to the heavens, be reborn early among humans, become Wheel-Turning Sage Kings, and in life and death know peace, existing for ages unending. Those who beforehand trust and turn toward the Dharma should all concentrate their minds, uphold the precepts and perform purification rites, thereby attaining the true Dao. Be cautious in practice, diligent in cultivation, receive with clarity and never forget. Those who can align with the Great Dharma should now submit and listen.",
      "start_char": 3828,
      "end_char": 5100,
      "start_sentence": 138,
      "end_sentence": 162,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.81257128715515,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\戒律类\\太上洞玄灵宝智慧罪根上品大戒经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "见在世上，聪明智慧，逆知吉凶，或通灵彻视，役使鬼神，或在富贵帝王之门。 南方赤帝南极地司，皆列名上言三炁丹天三炁天官，告下南方三官九府百二十曹，削除赤元九幽玉匮长夜之函宿世罪根。 丹天司命注上丹天神仙籍中，七祖普得去离三涂，上升天堂，逍遥南宫，三年皆得更生福德之门，世世欢乐，福庆难称，善缘不绝，克得神仙。 太上道君顾问南极世界飞天神人曰：我尝历观诸天，出游南门，见南方无极世界地狱之中，有百姓子男女人，裸身无衣，吞火食炭，头面焦燎，举体烂坏，无复人形，身受恶对，苦毒难言。 见之流曳，伤痛人心。 如此之辈，受对几年，当得解脱，被赦之日，为还人中，为作何形，大慈之法，有何功德，可得解度，还於善缘。 南极世界飞天神人曰：其人酷逆，生世不道，罪结九幽长夜之府，三炁天君丹天诸灵官三界司算结其罪录，依玄都女青阳宫太阳官律，罪役皆三万劫，当还生六畜之中，以报宿怨。 三百万劫轮转丹天数周，乃得作三河水曹都役使，其间辛苦，非可得言。 若欲开度，断诸恶缘，使得速还人道之中，当依明真玉匮女青阳宫科品，以绛纹之缯三十尺，亦可三尺，金龙一枚，诣南方三炁天君南乡诸灵官九幽之中，拔赎罪魂。 三日三夜，明灯烧香，首谢天君，可得速出长夜之中，见诸光明，三年皆得更生人中，因缘不绝，转得信根。 西南世界飞天神人曰：西南无极世界恒沙众生，已得道过去及未得道见在福中善男子善女人，修奉智慧上品十戒，功德满足，身受福报，已得道者，位登上真。 未得道者，见在世上，为地祇所称，天神所敬，死升南宫，受号上补天官，总领鬼神。 西南梵炁天君告下西南地祇三官九府百二十曹，削落黄元九幽玉匮长夜之函宿世罪根。 梵天司命勒录梵天神仙簿中。 九祖普得去离三涂五苦之中，升度南宫，逍遥福堂。 后十二年皆得还生富贵之门，因缘不绝，遂得神仙。 太上道君顾问西南世界飞天神人曰：我尝历观诸天，出游西南门，见西南无极世界长夜地狱三河九江五岳之中，有百姓子男女人，身受恶对，苦痛难胜，见之悲恻，伤人肝心。 如此之辈，凡应几年，当得解脱被赦之日，当作何形，有何功德，可得拔度，还入福中。 西南世界飞天神人曰：此人前身十生人道，恒无善行，生辄元逆，一炁天君梵炁诸灵官三界主司结其罪录，依玄都女青下宫右官律，万劫得还，生下人之身作仆使，轮转十二万劫无数之周，乃得作南河都役使。 此之勤苦，非言所尽。 欲使拔度，还於善缘，当依明真玉匮女青下宫科品，以黄纹之缯一百二十尺，亦可一十二尺，金龙一枚，诣西南梵炁天君西南诸灵官九幽之中，拔赎罪魂。 一十二日一十二夜，明灯烧香，首谢天君，西南诸灵官可得开度长夜之中，见诸光明。 一十二年，皆得还生福庆之门。 西方世界飞天神人曰：西方无极世界恒沙众生，已得道过去及未得道见在福中善男子善女人，修奉智慧上品十戒，功满德报，已得道者，位登上真。 未得道者，名书太素玄台，命过升天，为太上之宾，西方白帝皆列名七炁之天。 七炁天君告下西方三官，九署地牢之中，削落白元九幽玉匮长夜之函宿世罪根。",
      "translated_text": "In the present world, they possess keen intelligence and wisdom, foreseeing fortune and misfortune, or they attain spiritual clarity and far-seeing vision, commanding ghosts and spirits, or dwell within the gates of wealth, nobility, and imperial power. The Southern Red Emperor and the Southern Pole Earth Controller shall inscribe their names in the registers of the Three Qi Cinnabar Heaven and the Three Qi Heavenly Officials, and proclaim to the Three Officials, Nine Bureaus, and One Hundred Twenty Offices of the Southern Realm to expunge the karmic roots of their past sins from the Crimson Prime Nine Dark Hells and the Jade Casket of Eternal Night. The Cinnabar Heaven Controller of Destiny shall record them in the divine register of Cinnabar Heaven immortals, and their seven generations of ancestors shall universally depart from the Three Wretched Realms, ascend to the Heavenly Palaces, and roam freely in the Southern Palace. Within three years, all shall be reborn into the gates of good fortune and virtue, rejoicing in life after life, their blessings and joys beyond measure, their good affinities unbroken, and they shall attain the rank of divine immortals.\n\nThe Most High Dao Lord turned to the Flying Heavenly Deity of the Southern Boundless World and inquired: \"I have often surveyed the heavens and journeyed through the Southern Gate, where I beheld in the hells of the Southern Boundless World the common folk—men and women—naked and without clothing, swallowing fire and consuming coals, their faces scorched and bodies aflame, their forms no longer human, enduring cruel retributions, their suffering beyond words. Witnessing this, I was moved to tears, my heart grieved with sorrow. How many years must such beings endure their retribution before they may be liberated? When the day of their pardon arrives, in what form shall they be reborn among humans? By what merciful method and what meritorious deeds may they be delivered and restored to good affinities?\"\n\nThe Flying Heavenly Deity of the Southern Boundless World replied: \"These individuals were cruel and perverse in life, devoid of the Dao. Their sins bound them to the Nine Dark Hells of Eternal Night. The Three Qi Heavenly Lords, the Cinnabar Heaven Numinous Officials, and the Three Realms’ Controllers of Destiny have recorded their transgressions. According to the statutes of the Mysterious Capital’s Female Azure Yang Palace and the Greater Yang Officials, their penal servitude spans thirty thousand kalpas, after which they shall be reborn among the six kinds of livestock to repay their karmic debts. After three million kalpas, cycling through the reckonings of Cinnabar Heaven, they may become laborers in the Three Rivers’ offices, their toil and suffering beyond description. If one wishes to deliver them and sever their evil affinities, hastening their return to the human realm, they must follow the statutes of the Luminous Perfected Jade Casket and the Female Azure Lower Palace: with thirty feet of crimson-patterned silk (or three feet), and one golden dragon, they shall journey to the Southern Three Qi Heavenly Lord and the Southern Region’s Numinous Officials within the Nine Dark Hells to redeem the sinful souls. For three days and three nights, they shall light lamps and burn incense, bowing in gratitude to the Heavenly Lords. Thus, they may swiftly emerge from the Eternal Night, behold the radiant lights, and within three years, all shall be reborn among humans, their affinities unbroken, and they shall turn toward the root of faith.\"\n\nThe Flying Heavenly Deity of the Southwestern World declared: \"In the Southwestern Boundless World, the multitude of beings as numerous as the sands of the Ganges—those who have already attained the Dao in past lives and those presently virtuous men and women of good fortune who have yet to attain the Dao—who cultivate and uphold the Ten Upper-Grade Precepts of Wisdom, when their merit is complete and their virtue perfected, shall receive their karmic rewards. Those who have attained the Dao shall ascend to the rank of Highest Perfected. Those who have not yet attained the Dao shall, in their present lives, be praised by earth deities and revered by heavenly spirits. Upon death, they shall ascend to the Southern Palace, receive the title of Heavenly Official of the Upper Supplement, and govern ghosts and spirits. The Southwestern Primal Qi Heavenly Lord shall proclaim to the Earth Deities, Three Officials, Nine Bureaus, and One Hundred Twenty Offices of the Southwestern Realm to expunge the karmic roots of their past sins from the Yellow Prime Nine Dark Hells and the Jade Casket of Eternal Night. The Primal Heaven Controller of Destiny shall inscribe their names in the divine register of Primal Heaven immortals. Their nine generations of ancestors shall universally depart from the Three Wretched Realms and the Five Sufferings, ascend to the Southern Palace, and roam freely in the Hall of Blessings. After twelve years, all shall be reborn into the gates of wealth and nobility, their affinities unbroken, and they shall attain the rank of divine immortals.\"\n\nThe Most High Dao Lord turned to the Flying Heavenly Deity of the Southwestern World and inquired: \"I have often surveyed the heavens and journeyed through the Southwestern Gate, where I beheld in the Eternal Night Hells of the Southwestern Boundless World—within the Three Rivers, Nine Streams, and Five Peaks—the common folk, men and women, enduring cruel retributions, their suffering unbearable. Witnessing this, I was filled with sorrow, my heart grieved. How many years must such beings endure before they may be liberated? When the day of their pardon arrives, in what form shall they be reborn? By what meritorious deeds may they be delivered and restored to good fortune?\"\n\nThe Flying Heavenly Deity of the Southwestern World replied: \"In their past ten human lives, these individuals committed no good deeds, living in constant rebellion. The Primal Qi Heavenly Lord, the Primal Qi Numinous Officials, and the Three Realms’ Controllers of Destiny have recorded their transgressions. According to the statutes of the Mysterious Capital’s Female Azure Lower Palace and the Right Officials, after ten thousand kalpas, they may be reborn as lowly servants. After cycling through one hundred twenty thousand kalpas of countless revolutions, they may become laborers in the Southern River offices, their toil and suffering beyond words. If one wishes to deliver them and restore their good affinities, they must follow the statutes of the Luminous Perfected Jade Casket and the Female Azure Lower Palace: with one hundred twenty feet of yellow-patterned silk (or twelve feet), and one golden dragon, they shall journey to the Southwestern Primal Qi Heavenly Lord and the Southwestern Numinous Officials within the Nine Dark Hells to redeem the sinful souls. For twelve days and twelve nights, they shall light lamps and burn incense, bowing in gratitude to the Heavenly Lords and the Southwestern Numinous Officials. Thus, they may be delivered from the Eternal Night and behold the radiant lights. Within twelve years, all shall be reborn into the gates of good fortune and blessings.\"\n\nThe Flying Heavenly Deity of the Western World declared: \"In the Western Boundless World, the multitude of beings as numerous as the sands of the Ganges—those who have already attained the Dao in past lives and those presently virtuous men and women of good fortune who have yet to attain the Dao—who cultivate and uphold the Ten Upper-Grade Precepts of Wisdom, when their merit is complete and their virtue rewarded, those who have attained the Dao shall ascend to the rank of Highest Perfected. Those who have not yet attained the Dao shall have their names inscribed in the Mysterious Terrace of the Great Simplicity, their lives transcended and their souls ascended to heaven, becoming guests of the Most High. The Western White Emperor shall inscribe their names in the Seven Qi Heaven. The Seven Qi Heavenly Lord shall proclaim to the Three Officials of the Western Realm and the Nine Offices of the Earthly Prisons to expunge the karmic roots of their past sins from the White Prime Nine Dark Hells and the Jade Casket of Eternal Night.\"",
      "overlap_context": "gs as numerous as the sands of the Ganges—those who have already attained the Dao in past lives and those presently virtuous men and women of good fortune who have yet to attain the Dao—who cultivate and uphold the Ten Upper-Grade Precepts of Wisdom, when their merit is complete and their virtue perfected, shall receive the blessings of the Cinnabar Heaven. Those who have attained the Dao shall ascend to the rank of Highest Perfected, become immortals or numinous officials, or attain extinction.",
      "start_char": 5100,
      "end_char": 6322,
      "start_sentence": 163,
      "end_sentence": 188,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.225422859191895,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\戒律类\\太上洞玄灵宝智慧罪根上品大戒经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "素天司命勒录诸天神仙簿中。 七祖普离三涂五苦，上升金阙，受福自然，逍遥福堂，欢乐无穷。 后生人中，得为人尊，三界所敬，鬼神所称，轮转福缘，皆得神仙。 太上道君顾问西极世界飞天神人曰：我尝历观诸天，出游西门，见西方无极世界长夜之中九幽地狱，及三河九江诸山，责役男女鬼魂，流曳三涂，五苦备婴，斯人宿对，缘何而来，而充此罚。 如此之例，几年之中可得解脱，复有何功，可得拔度。 西极世界飞天神人曰：斯人宿身所行不道，七炁天君西方诸灵官三界主司结其罪录，依玄都女青右宫阴官律，万劫当得还生边夷之国，有人之形，无人之情，转轮七万劫白帝数周，乃得作西岳都役使。 此之悠悠，勤苦难言，欲使开度，还入善缘，当依明真玉匮女青右宫科品，以白纹之缯七十尺，亦可七尺，金龙一枚，诣西方七炁天君西方诸灵官，九幽之中，拔赎罪根。 七日七夜，明灯烧香，首谢天君，可得开度，见诸光明。 七年皆得还生善人之门。 西北世界飞天神人曰：西北无极世界恒沙众生，已得道过去及未得道见在福中善男子善女人，修奉智慧上品十戒，功满德报，已得道者，位登上真，未得道者，名书九天，命过升天，与五帝周旋。 黄帝皆列言梵炁之天梵炁天君，告下西北三官九署地牢之中，削落黄元九幽玉匮长夜之函宿世罪根○ 梵天司命勒录诸天神仙簿中。 七祖皆得去离五道，上升九天，受福无穷，后生人中，勇猛精进，威制五方，因缘不绝，得补五帝真人。 太上道君顾问西北世界飞天神人曰：我尝历观诸天。 出游西北门，见西北无极世界地狱之中九江长夜寒冰夜庭，有百姓子男女人，涂炭流曳，身形楚挞，苦毒难言。 如此比例，被责几年，当得解脱。 蒙赦之日，为还人中，复作何形。",
      "translated_text": "The Director of Destiny in the Plain Heaven shall inscribe their names in the registers of divine immortals among the heavens. Their seven generations of ancestors shall universally depart from the Three Wicked Paths and the Five Sufferings, ascending to the Golden Portals to receive natural blessings, roaming the Hall of Fortune, and enjoying boundless joy. In later rebirths among humankind, they shall be revered as human dignitaries, respected by the Three Realms, and praised by ghosts and spirits. As their wheel of fortune turns, all shall attain the rank of divine immortals.\n\nThe Most High Dao Lord turned to the Flying Celestial Beings of the Western Realm and inquired: \"I have often surveyed the heavens and journeyed through the Western Gate, where I beheld the Nine Dark Hells of Eternal Night in the Western Realm of the Infinite, as well as the Three Rivers and Nine Streams among the mountains, where male and female ghostly souls are punished and toil, drifting through the Three Wicked Paths and enduring the full weight of the Five Sufferings. What past karmic retribution has brought these beings to suffer such punishment? In how many years may they attain liberation, and what meritorious deeds may redeem and deliver them?\"\n\nThe Flying Celestial Beings of the Western Realm replied: \"These beings, in their past lives, acted contrary to the Dao. The Seven Qi Heavenly Lord, the various spirit officials of the Western Realm, and the governing authorities of the Three Realms have recorded their transgressions. According to the statutes of the Dark Bureau of the Right Palace of the Mysterious Capital’s Lady of Qing, after ten thousand kalpas, they may be reborn in the frontier barbarian lands, possessing human form but lacking human sentiment. After seventy thousand kalpas, when the reckoning of the White Emperor has completed its cycles, they may become laborers under the command of the Western Peak. This suffering is endless, their toil beyond words. Should one wish to deliver them and restore them to good karmic conditions, they must follow the regulations of the Jade Casket of Luminous Perfection and the statutes of the Right Palace of the Lady of Qing: present seventy feet of white silk—or seven feet—and one golden dragon to the Seven Qi Heavenly Lord, the various spirit officials of the Western Realm, and the Nine Dark Hells to redeem their karmic roots. For seven days and seven nights, keep bright lamps lit and burn incense, prostrating before the Heavenly Lord to seek deliverance. Thus may they behold the light. After seven years, all shall be reborn into the families of the virtuous.\"\n\nThe Flying Celestial Beings of the Northwestern Realm declared: \"Among the boundless multitudes of the Northwestern Realm of the Infinite, both those who have attained the Dao in past lives and those good men and women of present good fortune who have yet to attain the Dao—who cultivate and uphold the Ten Upper-Grade Precepts of Wisdom—when their merit is complete and their virtue rewarded, those who have attained the Dao shall ascend to the rank of Highest Perfected. Those who have not yet attained the Dao shall have their names inscribed in the Nine Heavens, their lives transcended and their souls ascended to heaven, where they shall consort with the Five Emperors. The Yellow Emperor shall inscribe their names in the Heaven of Brahma Qi. The Heavenly Lord of Brahma Qi shall proclaim to the Three Officials of the Northwestern Realm and the Nine Offices of the Earthly Prisons to expunge the karmic roots of their past sins from the Yellow Prime Nine Dark Hells and the Jade Casket of Eternal Night.\"\n\nThe Director of Destiny in the Brahma Heaven shall inscribe their names in the registers of divine immortals among the heavens. Their seven generations of ancestors shall all depart from the Five Paths, ascending to the Nine Heavens to receive boundless blessings. In later rebirths among humankind, they shall be courageous and diligent, their might prevailing over the Five Directions. With unbroken karmic conditions, they shall be appointed as Perfected Ones of the Five Emperors.\n\nThe Most High Dao Lord turned to the Flying Celestial Beings of the Northwestern Realm and inquired: \"I have often surveyed the heavens and journeyed through the Northwestern Gate, where I beheld the hells of the Northwestern Realm of the Infinite—the Nine Streams of Eternal Night and the Frozen Courts of Darkness—where the common folk, men and women, suffer in filth and drift in torment, their bodies lashed and afflicted with unbearable agony. How many years must such beings endure punishment before they may attain liberation? When pardoned, what form shall they take upon returning to the human realm?\"",
      "overlap_context": "ave their names inscribed in the Mysterious Terrace of the Great Simplicity, their lives transcended and their souls ascended to heaven, becoming guests of the Most High. The Western White Emperor shall inscribe their names in the Seven Qi Heaven. The Seven Qi Heavenly Lord shall proclaim to the Three Officials of the Western Realm and the Nine Offices of the Earthly Prisons to expunge the karmic roots of their past sins from the White Prime Nine Dark Hells and the Jade Casket of Eternal Night.\"",
      "start_char": 6322,
      "end_char": 7005,
      "start_sentence": 189,
      "end_sentence": 204,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.198129892349243,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\戒律类\\太上洞玄灵宝智慧罪根上品大戒经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "如未开恕，有何功德，可相拔度。 西北世界飞天神人曰：斯人所行酷逆无度，一炁天君西北诸灵官三界主司结其罪簿，依玄都女青太阴官水官律，万劫当得生愚暗之中，聋盲六疾，非复人形。 轮转五道，一十二万劫无数之周，乃得补长河都役使。 此之悠悠，勤苦难言。 欲使开度，还入善门，当依明真玉匮女青太阴宫科品，以黄纹之缯百二十尺，亦可一十二尺，金龙一枚，诣西北一炁天君西北诸灵官，九幽之中拔赎罪魂。 一十二日一十二夜，明灯烧香，首谢天君，可得开度，见诸光明。 一十二年，便得自在，更生人中，还入善缘之门，世世欢乐，长享无穷。 北方世界飞天神人曰：北方无极世界恒沙众生，已得道过去及未得道见在福中善男子善女人，修奉智慧上品十戒，功德备足，玄天福报，名书上清。 或位登上圣，游行三清，或命过，即得为四极明公j 见在世上福德之中，神灵敬护，万灾不干。 北方地司，皆列言上宫，五炁天君告下北方三官九府百二十曹，削落玄元九幽玉匮长夜之函宿世罪根。 玄天司命勒录诸天神仙簿中。 七祖普得上升天堂，衣食自然。 五年皆得更生帝王之门，轮转福德，故恒居善缘。 太上道君顾问北方世界飞天神人曰：我尝历观诸天，出游北门，见北方无极世界地狱之中，三河九江诸山，责役百姓子男女人，涂炭流曳，负山担石，闭塞长源，吞火瞰炭，无复身形。 其人受对被责，几年应得解脱，解脱之日，为还人中，复作何身中，复可得拔度与不。 北方世界飞天神人曰：斯人生世酷逆无道，五炁天君北方诸灵官三界主司结其罪录，依玄都女青太阳宫火官律，万劫当生六畜之中，轮转五道五万劫玄天数周，乃得补北岳都役使。 其对悠悠，难可卒还。 欲使开度，速见命根，当依明真玉匮女青太阳宫科品，以玄纹之缯五十尺，亦可五尺，金龙一枚，诣五炁天君北方诸灵官九幽之中，拔赎罪魂。 五日五夜，明灯烧香，首谢天君，可得开度见诸光明。 五年身皆还生善缘之中。 东北世界飞天神人曰：东北无极世界恒沙众生，已得道过去及未得道见在福中善男子善女人，修奉智慧上品十戒，功成德报，已得道者，位登上真，未得道者，见在世上，为三界所敬，地祇所畏，死升天堂，灵人交游。 东北地司皆列言梵炁之天梵炁天君，告下东北三官九府百二十曹，削落黄元九幽玉匮长夜之函宿世罪根，梵天司命勒录诸天神仙簿中。 九祖升度南宫，去离五道，逍遥福堂。 五年皆得还生福德之门，世世因缘，享福无穷。 太上道君顾问东北世界飞天神人曰：我尝历观诸天，出游东北门，见东北无极世界地狱之中，有百姓子男女人，身受宿对，诸苦备经，流曳涂炭，无复人形。 其人何辜，生世何犯，杀害何命，致受今对。 当作何功，拔赎罪身，使得还入善道之中。 东北世界飞天神人曰：斯人前生不念慈心，三春游猎，张罗布网，放火烧山，刺射野兽，杀害众生，其罪深重，死受殃罚，身负槌打，万痛交行，驱驰百极，食息无宁。 欲拔比罪，还於福中，当依明真科品，以黄纹之缯百二十尺，亦可一十二尺，金龙一枚，以诣东北梵炁天君东北诸灵官九幽之府，拔赎罪魂。 一十二日一十二夜，烧香然灯，照耀诸天地狱之中，使长徒幽魂得见光明，罪根披散，还入福门，魂升南宫，受庆自然。",
      "translated_text": "If pardon has not yet been granted, what merits or virtues may be cultivated to deliver them?\n\nThe Flying Celestial Beings of the Northwestern Realm replied: \"Such beings have committed acts of extreme cruelty and transgression. The Qi Sovereign of the Northwest and the various spirit-officials, along with the overseers of the Three Realms, have recorded their sins in the ledgers. According to the statutes of the Mysterious Capital’s Lady of the Dark Yin, the Water Bureau, and the Palace of the Hidden Moon, they are condemned to ten thousand kalpas of rebirth in realms of ignorance and darkness, afflicted with deafness, blindness, and the six maladies, no longer retaining human form. They shall revolve through the Five Paths for one hundred twenty thousand kalpas, countless cycles, before they may be appointed as laborers in the Long River Bureau. This suffering is boundless, their toil beyond description.\n\nShould one wish to deliver them and guide them back into the gate of goodness, they must follow the statutes of the Luminous Perfected Jade Treasury and the Lady of the Dark Yin’s Palace. Offer one hundred twenty feet of yellow-patterned silk—or as little as twelve feet—and a golden dragon, presenting them to the Qi Sovereign of the Northwest, the various spirit-officials of the Northwest, and the Nine Dark Prisons to ransom the sinful souls. For twelve days and twelve nights, light lamps and burn incense, bowing in repentance before the Sovereign. Thus may they attain deliverance and behold the radiant light. After twelve years, they shall gain freedom, be reborn among humans, and re-enter the gate of good karmic conditions, enjoying boundless joy for generations to come.\"\n\nThe Flying Celestial Beings of the Northern Realm said: \"In the Northern Realm of the Infinite, among the countless sentient beings—both those who have already attained the Dao in past lives and those presently abiding in blessed goodness, the virtuous men and women who cultivate and uphold the Ten Precepts of Supreme Wisdom—when their merits and virtues are complete, their celestial rewards shall be inscribed in the Upper Clarity. Some ascend to the rank of highest sages, roaming the Three Clarities; others, upon the end of their lives, become Illustrious Lords of the Four Poles. In their present existence, they dwell in blessed virtue, revered by spirits and protected from the myriad calamities. The earthly bureaus of the North shall report to the Celestial Palace, where the Five Qi Sovereigns instruct the Three Officials, Nine Courts, and One Hundred Twenty Offices of the North to erase from the Jade Treasury of the Nine Dark Prisons and the Eternal Night Archives the roots of their past sins. The Northern Celestial Bureau of Destiny shall inscribe their names in the registers of divine immortals. Their seven generations of ancestors shall universally ascend to the Heavenly Halls, clothed and nourished by nature. Within five years, they shall all be reborn into the gates of emperors and kings, revolving through cycles of blessed virtue, forever abiding in good karmic conditions.\"\n\nThe Most High Dao Lord turned to the Flying Celestial Beings of the Northern Realm and inquired: \"I have often surveyed the heavens and journeyed through the Northern Gate, where I beheld the hells of the Northern Realm of the Infinite—the Three Rivers, Nine Streams, and myriad mountains—where the common folk, men and women, suffer their retributions, dragged through filth and torment, bearing mountains and stones upon their backs, blocking the eternal springs, swallowing fire and gazing upon coals, their bodies no longer retaining human form. How many years must such beings endure punishment before they may attain liberation? When pardoned, what form shall they take upon returning to the human realm? May they be delivered, or not?\"\n\nThe Flying Celestial Beings of the Northern Realm replied: \"Such beings, in their past lives, committed acts of extreme cruelty and lawlessness. The Five Qi Sovereign of the North and the various spirit-officials, along with the overseers of the Three Realms, have recorded their sins. According to the statutes of the Mysterious Capital’s Lady of the Luminous Yang, the Fire Bureau, they are condemned to ten thousand kalpas of rebirth among the six livestock. They shall revolve through the Five Paths for fifty thousand kalpas, countless cycles of the Northern Celestial reckoning, before they may be appointed as laborers in the Northern Marchmount Bureau. Their retribution is vast, their repayment not swiftly fulfilled.\n\nShould one wish to deliver them and swiftly restore their life’s root, they must follow the statutes of the Luminous Perfected Jade Treasury and the Lady of the Luminous Yang’s Palace. Offer fifty feet of dark-patterned silk—or as little as five feet—and a golden dragon, presenting them to the Five Qi Sovereign of the North, the various spirit-officials, and the Nine Dark Prisons to ransom the sinful souls. For five days and five nights, light lamps and burn incense, bowing in repentance before the Sovereign. Thus may they attain deliverance and behold the radiant light. Within five years, their bodies shall be reborn into good karmic conditions.\"\n\nThe Flying Celestial Beings of the Northeastern Realm said: \"In the Northeastern Realm of the Infinite, among the countless sentient beings—both those who have already attained the Dao in past lives and those presently abiding in blessed goodness, the virtuous men and women who cultivate and uphold the Ten Precepts of Supreme Wisdom—when their merits and virtues are complete, those who have attained the Dao ascend to the rank of highest perfected ones, while those who have not yet attained the Dao, in their present existence, are revered by the Three Realms and feared by earthly deities. Upon death, they ascend to the Heavenly Halls, where divine beings welcome them. The earthly bureaus of the Northeast shall report to the Celestial Palace of Brahma Qi, where the Brahma Qi Sovereign instructs the Three Officials, Nine Courts, and One Hundred Twenty Offices of the Northeast to erase from the Yellow Prime Jade Treasury of the Nine Dark Prisons and the Eternal Night Archives the roots of their past sins. The Brahma Celestial Bureau of Destiny shall inscribe their names in the registers of divine immortals. Their nine generations of ancestors shall ascend to the Southern Palace, departing the Five Paths to dwell in the Halls of Blessedness. Within five years, they shall all be reborn into the gates of blessed virtue, their karmic conditions spanning generations, enjoying boundless felicity.\"\n\nThe Most High Dao Lord turned to the Flying Celestial Beings of the Northeastern Realm and inquired: \"I have often surveyed the heavens and journeyed through the Northeastern Gate, where I beheld the hells of the Northeastern Realm of the Infinite, where the common folk, men and women, endure their past retributions, suffering every torment, dragged through filth and mire, their bodies no longer retaining human form. What crimes did they commit in past lives? What offenses did they incur? Whose lives did they take, that they now endure such retribution? What merits must be cultivated to ransom their sinful bodies and guide them back into the path of goodness?\"\n\nThe Flying Celestial Beings of the Northeastern Realm replied: \"In their past lives, these beings lacked compassion. During the three spring months, they roamed hunting, setting nets and snares, burning mountains, and shooting wild beasts, slaughtering countless lives. Their sins are grave, and in death, they suffer the consequences—beaten with clubs, a thousand pains assailing them, driven through the hundred extremes, never resting in eating or sleeping.\n\nTo deliver them from such sins and restore them to blessedness, one must follow the statutes of the Luminous Perfected. Offer one hundred twenty feet of yellow-patterned silk—or as little as twelve feet—and a golden dragon, presenting them to the Brahma Qi Sovereign of the Northeast, the various spirit-officials, and the Nine Dark Prisons. For twelve days and twelve nights, burn incense and light lamps, illuminating the hells of heaven and earth, so that the long-imprisoned souls may behold the radiant light, their sinful roots dispersed. Thus may they return to the gate of blessedness, their souls ascending to the Southern Palace to receive natural rejoicing.\"",
      "overlap_context": "ften surveyed the heavens and journeyed through the Northwestern Gate, where I beheld the hells of the Northwestern Realm of the Infinite—the Nine Streams of Eternal Night and the Frozen Courts of Darkness—where the common folk, men and women, suffer in filth and drift in torment, their bodies lashed and afflicted with unbearable agony. How many years must such beings endure punishment before they may attain liberation? When pardoned, what form shall they take upon returning to the human realm?\"",
      "start_char": 7005,
      "end_char": 8271,
      "start_sentence": 205,
      "end_sentence": 234,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.42775273323059,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\戒律类\\太上洞玄灵宝智慧罪根上品大戒经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "下方世界飞天神人曰：下方无极世界恒沙众生，已得道地仙五岳真人，及未得道见在福中善男子善女人，修奉智慧上品十戒，功成德满，已得道者，位登上真。 未得道者，名书诸天，命过之日，径升福堂。 东华宫中五岳五帝，皆列言诸天三十二天帝君，告下八极三官九署地牢之中，削落九幽玉匮长夜之函宿世罪根，诸天司命勒录金格神仙薄中。 七祖皆得去离地役，升上南宫，后生人中，富贵之门，积功勤修，轮转不倦，克得飞行，上升太极，位得神仙。 太上道君顾问下方无极世界飞天神人曰：我尝历观下方，出游八极。 见下方无极世界地狱之中，有百姓子男女人身受酷对，大小相牵，涂炭八极囚徒之中。 其人何辜，生世何犯，违何经法，受此之对。 当作何功，可得拔赎宿愆，使得更生人道之中。 下方世界飞天神人曰：斯人前世不敬鬼神，不信经教，犯忤地祇、五岳四渎，罪非可纪。 死受酷罚，幽沈地狱，自非明真科法拔度，万劫无原。 夫欲开度，当以黄纹之缯三十二尺，金龙一枚，以诣下方诸土府五岳名山诸水三官九署，十二河源九幽之中，拔赎罪魂。 一日一夜一十二时，烧香然灯，照耀诸地之下，九幽之内，使长徒死魂，得见光明，身受开度，还入福门。 上方世界飞天神人曰：上方三十二天无极世界恒沙众生，己得道上圣高神诸真人，及未得道见在福中有百姓子男女人，修奉智慧上品十戒，功成德满，已得道者，位登上真。 未得道者，名书三十二天。 命过之日，径升福堂，逍遥三界大罗之上，诸天右别。 九幽之府长夜之中，削除罪简，拔出七祖，升上南宫，更生人中，修行善道，世世因缘，玩好不绝。 克得神仙，飞行三界大罗之天。 太上道君顾问上方世界飞天神人曰：我尝历观上方三十二天，游行三界。 见天一北狱青韶上狱及三河积夜之府，有百姓子男女人，裸身赤肉，不得衣食，身被铁杖，痛苦难任，流曳三河，摙汲洪水，以灌四渎，昼夜勤苦，无有休息。 其人生世何所犯违，触何经戒，而受此对。 当作何功德，可以拔赎，使得更生，还在人中。",
      "translated_text": "The Flying Celestial Beings of the Lower Realm declare: In the boundless worlds of the Lower Realm, among the countless sentient beings—those who have attained the Dao as Earth Immortals and the Perfected of the Five Peaks, as well as the virtuous men and women still abiding in blessedness who have yet to attain the Dao—those who cultivate and uphold the Ten Precepts of Supreme Wisdom, their merits complete and virtues fulfilled, shall ascend as Highest Perfected if they have already attained the Dao. Those who have not yet attained it shall have their names inscribed in the heavens, and upon the passing of their lives, they shall ascend directly to the Hall of Blessings. The Five Emperors of the Five Peaks in the Eastern Florescence Palace shall proclaim to the Thirty-Two Heavenly Lords of the Heavens, and command the Eight Extremes, the Three Officials, the Nine Bureaus, and the earthly prisons to erase the records of their sins from the Jade Archives of the Nine Dark Prisons, severing the karmic roots of their past lives. The Heavenly Registrars shall inscribe their names in the Golden Register of Divine Immortals. Their seven generations of ancestors shall be freed from earthly toil, ascending to the Southern Palace. In their next lives, they shall be born into gates of wealth and nobility, where they may accumulate merit through diligent cultivation, tirelessly turning the wheel of existence until they attain flight and ascend to the Great Ultimate, achieving the rank of Divine Immortals.\n\nThe Most High Lord of the Dao turned and asked the Flying Celestial Beings of the boundless worlds of the Lower Realm: \"I have often observed the Lower Realm, journeying through the Eight Extremes. I have seen in the hells of the boundless worlds below men and women enduring cruel retributions, bound together in suffering, mired in the filth of the Eight Extremes among the imprisoned multitudes. For what crimes were they born? What transgressions did they commit in life? Which scriptures or laws did they violate to suffer such retribution? What meritorious deeds must be performed to redeem their past offenses, allowing them to be reborn into the human realm?\"\n\nThe Flying Celestial Beings of the Lower Realm replied: \"These beings, in their past lives, disrespected spirits and deities, rejected the teachings of the scriptures, and offended the Earth Spirits, the Five Peaks, and the Four Waterways—sins beyond reckoning. After death, they endure cruel punishments, sinking into the dark hells, and without the statutes of the Luminous Perfected to deliver them, they would remain bound for ten thousand kalpas without release. To liberate them, one must offer thirty-two feet of yellow-patterned silk and a golden dragon, presenting them to the various earthly administrations, the Five Peaks, the famous mountains, the Three Officials of the waters, the Nine Bureaus, the Twelve River Sources, and the Nine Dark Prisons to redeem the sinful souls. For one day and one night, through the twelve hours, burn incense and light lamps, illuminating the depths of the earth and the Nine Dark Prisons, so that the long-imprisoned dead souls may behold the radiant light, receive deliverance, and return to the gate of blessedness.\"\n\nThe Flying Celestial Beings of the Upper Realm declare: In the boundless worlds of the Thirty-Two Heavens of the Upper Realm, among the countless sentient beings—those who have attained the Dao as Highest Sages, Lofty Spirits, and the various Perfected Ones, as well as the men and women still abiding in blessedness who have yet to attain the Dao—those who cultivate and uphold the Ten Precepts of Supreme Wisdom, their merits complete and virtues fulfilled, shall ascend as Highest Perfected if they have already attained the Dao. Those who have not yet attained it shall have their names inscribed in the Thirty-Two Heavens. Upon the passing of their lives, they shall ascend directly to the Hall of Blessings, roaming freely above the Three Realms and the Great Veil, where the heavens make special distinction for them. In the long nights of the Nine Dark Prisons, their records of sin shall be erased, their seven generations of ancestors delivered, ascending to the Southern Palace. Reborn into the human realm, they shall cultivate the good Dao, their karmic affinities spanning lifetimes, their joys unending. They shall attain the rank of Divine Immortals, soaring through the Three Realms and the heavens of the Great Veil.\n\nThe Most High Lord of the Dao turned and asked the Flying Celestial Beings of the Upper Realm: \"I have often observed the Thirty-Two Heavens of the Upper Realm, journeying through the Three Realms. I have seen in the Northern Prison of Heaven, the Azure Luminous Upper Prison, and the Three Rivers’ Repository of Accumulated Darkness men and women naked and bare, deprived of clothing and food, their bodies beaten with iron rods, enduring unbearable suffering. They are dragged through the Three Rivers, drawing and hauling floodwaters to irrigate the Four Waterways, toiling day and night without rest. For what crimes in life did they transgress? Which scriptures or precepts did they violate to suffer such retribution? What meritorious deeds must be performed to redeem them, allowing them to be reborn into the human realm?\"",
      "overlap_context": " silk—or as little as twelve feet—and a golden dragon, presenting them to the Brahma Qi Sovereign of the Northeast, the various spirit-officials, and the Nine Dark Prisons. For twelve days and twelve nights, burn incense and light lamps, illuminating the hells of heaven and earth, so that the long-imprisoned souls may behold the radiant light, their sinful roots dispersed. Thus may they return to the gate of blessedness, their souls ascending to the Southern Palace to receive natural rejoicing.\"",
      "start_char": 8272,
      "end_char": 9071,
      "start_sentence": 235,
      "end_sentence": 255,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.213764429092407,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\戒律类\\太上洞玄灵宝智慧罪根上品大戒经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "上方世界飞天神人曰：其人前身不信大法，疑毁经文，违犯十戒，致受今对，充天徒责。 自非明真科品拔度，万劫无还。 夫欲开度，常以青纹之缯三十二尺，金龙一枚，以诣诸天宫曹府，拔赎宿对，开度九幽之中囚徒死魂。 一日一夜一十二时，烧香然灯，照耀诸天，积夜之河，九幽之中，使责役之鬼得见光明，身受开度，还入福门。 太上道君欢喜作礼，上白天尊：今日侍坐，得闻十方飞天神人说诸罪根拔度上品，生者得度，死者得还，九幽之内，普受光明。 来生男女，善心信向，当得其福，世世因缘，玩好不绝，身得神仙，香灯供养，门户兴隆，三界侍卫，万灵朝门，鬼试降伏，千灾不干。 大法开化，万劫无穷，福庆堂堂，巍巍难胜。 欣诸来生，得此大恩，不胜喜悦，而作颂日。 是时诸天一时称善。 太上智慧长乐颂 龙汉多纯民，混心皆自然。 五情不争竞，形有不死神。 龙门断长河，三涂不役人。 休息五道场，罢除刀剑山。 荡荡元汉内，九幽无苦魂。 不闻哭尸声，但闻长乐言。 不见长夜鬼，但见飞天仙。 斯世乐何乐，故诵兴乐篇。 诸天稽首庆，同称庆劫年。 玄都七宝林，十天普弥罗。 紫烟观灵晖，云景秀玉阿。 上有福德堂，宫室互参差。 皆是清信士，真仙飞天家。 三界通玄路，五道清不邪。 善根应缘生，累功享福多。 牵对相寻续，大法谅不虚。 无有万年人，皆与劫同祖。 依依欢乐世，发言成庆歌。 此世观无极，当奈来运何。 太上道君於洞阳馆柏陵舍中受戒，见诸天福堂亿劫种亲，并逍遥无为，衣食自然，身有光明，飞仙同侣，无有忧戚，不知苦难，见之悲喜，故作长乐颂篇。 太上智慧苦神颂 生落苦神界，轮转五道庭。 九幽闭长夜，累劫无光明。 刀山多剑树，毒刃互峥嵘。 不见群鸟集，但闻苦魂声。 回风摇长条，哀响流寒庭。 上有履山人，时刻无暂停。 饥食曲泉炭，渴饮冶火精。 流曳三涂中，岂识形与名。 念尔不知命，苦哉伤人情。 罪福各生缘，善恶谅由心。 轮转不终灭，譬声不绝音。 九幽有元录，万劫自相寻。 寒冰无极源，长夜间重阴。 不见福德舍，但见穷鬼林。 长河难闭塞，苦魂攀领吟。 孤声赴绝一剑，哀号落刀岑。 此形非复形，痛哉伤人衿。 太上道君出游八门，见诸地狱幽闭重槛，及三河九江刀山剑树，囚徒饿鬼，责役死魂，流曳涂炭，无复身形，不可忍见。 见之悲伤，故作苦神颂篇。 天尊告一太上道君曰：今日普与十方至真、无极大圣众，同生一劫，欢乐难譬，言不觉尽，心不觉现。 说诸善恶、禁戒科律，无所藏隐，诸天同庆，齐宣法音，普度无量。 今生何幸，遇此经教，自发善心，命得长年，不横夭伤。 终归之日，径上天堂，因缘无绝，皆得道真。 吾念来生末世男女，皆当随运自从，心迫情急，不觉生罪，罪根当生，沦於五道，一跌信路，无复还期，往返三途五苦之中，刀山剑树，飞血万里，无极寒冰，穷魂填夜，号咷长何，悲吟伤人。 哀此不幸，往不能还。 今故说是经，为诸来生信向之人，开通津梁，普令得去恶对之根，身入光明，还於善缘。 至心宗奉，当得其福，不信向者，当获其殃。 吾过去后，其文当还大罗之上七宝玄台紫微宫中。 如明真玄科，四万劫当行下世，教度天人。",
      "translated_text": "The Flying Celestial Beings of the Upper Realm replied: \"In their past lives, these beings did not believe in the Great Dao, doubted and defiled the scriptures, and violated the Ten Precepts, thus receiving their present retribution as forced laborers in Heaven. Without the illumination of the true statutes and deliverance, they shall remain bound for ten thousand kalpas without return. To liberate them, one must offer thirty-two feet of azure-patterned silk and a golden dragon, presenting them at the celestial palaces and bureaus to redeem their past transgressions and deliver the imprisoned dead souls from the Nine Dark Realms. For twelve hours day and night, burn incense and light lamps to illuminate the heavens, the River of Accumulated Darkness, and the Nine Dark Realms, allowing the toiling spirits to behold the light, receive deliverance, and return to the Gate of Blessings.\"\n\nThe Most High Lord Dao turned and bowed, addressing the Heavenly Worthy: \"Today, seated in attendance, I have heard the Flying Celestial Beings of the Ten Directions expound upon the superior methods for uprooting karmic transgressions. The living are delivered, the dead are restored, and within the Nine Dark Realms, all receive illumination. In future lives, men and women who cultivate goodness and faith shall attain this blessing. Through endless kalpas, their affinities shall flourish without cease, their bodies attaining immortality. With incense and lamps offered in devotion, their households shall prosper, guarded by the Three Realms, attended by the myriad spirits. Demons shall be subdued, and a thousand calamities averted. The Great Dao unfolds, its boundless virtue resplendent, towering and unmatched. Rejoicing in the blessings bestowed upon future generations, I cannot contain my joy and have composed this hymn.\"\n\nAt that moment, all the heavens as one voiced their approval.\n\n**Hymn of Everlasting Joy by the Most High Wisdom**\nIn the Dragon Han, the people were pure,\nTheir hearts in harmony with the natural Way.\nThe five emotions knew no strife,\nTheir forms possessed undying spirits.\nThe Dragon Gate severed the long river,\nThe Three Paths no longer enslaved men.\nResting in the Five Dao sanctuaries,\nThe Mountain of Swords and Blades was abolished.\nVast and boundless within the Primordial Han,\nThe Nine Dark Realms held no suffering souls.\nNo wailing of the dead was heard,\nOnly words of everlasting joy.\nNo long-night ghosts were seen,\nOnly soaring celestial immortals.\nWhat joy surpasses this world’s joy?\nThus I chant this hymn of jubilation.\nThe heavens bowed in celebration,\nTogether proclaiming this blessed kalpa.\nIn the Seven Jeweled Grove of the Mysterious Capital,\nThe Ten Heavens enveloped in radiant mist,\nPurple clouds observed the numinous glow,\nCloudscapes adorned the jade peaks.\nAbove stood the Hall of Blessings,\nIts palaces and chambers arrayed in splendor.\nAll were faithful devotees,\nTrue immortals and celestial families.\nThe Three Realms opened the path of mystery,\nThe Five Paths purified, free from deviation.\nGood roots arise from karmic conditions,\nAccumulated merit yields abundant blessings.\nKarmic ties follow in succession,\nThe Great Dao is surely not in vain.\nNo man lives ten thousand years,\nAll share the same origin as the kalpa.\nIn this joyous world of harmony,\nWords become songs of celebration.\nGazing upon this boundless realm,\nWhat shall become of the ages to come?\n\nAt the Cypress Mound Abode within the Grotto of Radiant Yang, the Most High Lord Dao received the precepts and beheld the celestial halls of blessings, where the karmic kin of countless kalpas dwelled in carefree non-action, their clothing and sustenance naturally provided, their bodies radiant with light, accompanied by flying immortals. Free from sorrow and grief, unaware of suffering and hardship, he was moved by both sorrow and joy, and thus composed the *Hymn of Everlasting Joy*.\n\n**Hymn of the Suffering Spirits by the Most High Wisdom**\nBorn into the realm of suffering spirits,\nThey revolve through the courts of the Five Paths.\nThe Nine Dark Realms enclose the eternal night,\nThrough countless kalpas, no light shines.\nBlade mountains and sword trees stand tall,\nTheir poisoned edges gleaming sharp.\nNo flocks of birds gather,\nOnly the cries of suffering souls are heard.\nThe whirling winds sway the long branches,\nMournful echoes drift through the cold courts.\nAbove, the mountain-treading souls,\nToil ceaselessly, without respite.\nHungry, they eat the crooked spring’s charcoal,\nThirsty, they drink the smelting fire’s essence.\nDragged through the Three Paths,\nDo they even know their names?\nPitying their ignorance of fate,\nAlas, how it grieves the heart.\nKarma arises from good and evil,\nVirtue and vice surely stem from the mind.\nThe wheel of rebirth never ceases,\nLike sound that never fades from echo.\nThe Nine Dark Realms hold primordial records,\nThrough ten thousand kalpas, they seek one another.\nThe source of endless icy cold,\nThe long night pierced by layers of darkness.\nNo halls of blessings are seen,\nOnly forests of destitute ghosts.\nThe long river cannot be dammed,\nSuffering souls cling and wail.\nTheir solitary cries reach the edge of the sword,\nTheir lamentations fall upon the blade peaks.\nThese forms are no longer forms,\nAlas, how it wounds the heart.\n\nThe Most High Lord Dao, journeying through the Eight Gates, beheld the prisons of the underworld, their layered barriers, the Three Rivers and Nine Streams, the mountains of blades and forests of swords, the imprisoned hungry ghosts, the toiling dead souls, dragged through the mire and ashes, their forms no longer recognizable. Unable to bear the sight, he was moved to sorrow and thus composed the *Hymn of the Suffering Spirits*.\n\nThe Heavenly Worthy addressed the Most High Lord Dao: \"Today, together with the perfected beings of the Ten Directions and the boundless assembly of great sages, we share the joy of this kalpa, a happiness beyond compare. Our words cannot express it fully, nor can our hearts comprehend it entirely. The teachings of good and evil, the precepts and statutes, have been revealed without concealment. The heavens rejoice as one, proclaiming the Dharma, universally delivering the boundless multitudes. How fortunate are those born in this age, encountering these scriptural teachings! By cultivating goodness, their lives shall be long, free from untimely death. When their final day arrives, they shall ascend directly to the celestial halls, their karmic ties unbroken, all attaining the true Dao.\n\nYet I pity the men and women of future degenerate ages, who shall follow the turning of the kalpa, their hearts constrained by urgency, unknowingly committing sins. Their karmic roots shall sprout, casting them into the Five Paths. Once they stumble from the path of faith, there shall be no return. They shall wander through the Three Paths and the Five Sufferings, amidst blade mountains and sword trees, where blood flies for ten thousand miles, through endless icy cold, where destitute souls fill the night, their wails and lamentations grieving the heart. Alas for their misfortune, once gone, they cannot return.\n\nThus, I expound this scripture for the faithful of future generations, opening the bridge to liberation, enabling all to sever the roots of evil karma, enter the light, and return to goodness. Those who wholeheartedly revere and uphold it shall attain its blessings; those who do not believe shall incur its misfortune.\n\nAfter my departure, this text shall return to the Seven Jeweled Mysterious Terrace within the Purple Tenuity Palace of the Great Luo. In accordance with the statutes of the Illuminated True Mystery, after forty thousand kalpas, it shall descend to the world to teach and deliver the heavens and humanity.\"",
      "overlap_context": "ess men and women naked and bare, deprived of clothing and food, their bodies beaten with iron rods, enduring unbearable suffering. They are dragged through the Three Rivers, drawing and hauling floodwaters to irrigate the Four Waterways, toiling day and night without rest. For what crimes in life did they transgress? Which scriptures or precepts did they violate to suffer such retribution? What meritorious deeds must be performed to redeem them, allowing them to be reborn into the human realm?\"",
      "start_char": 9072,
      "end_char": 10305,
      "start_sentence": 256,
      "end_sentence": 315,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.80110502243042,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\戒律类\\太上洞玄灵宝智慧罪根上品大戒经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "今以相告，明识之焉。 是时众圣、太上道君欢喜，作礼稽首而退。 太上洞玄灵宝智慧罪根上品大戒经卷下竟",
      "translated_text": "Now, I make this known to you, that you may clearly comprehend it.\n\nAt that moment, the assembly of sages and the Most High Dao Lord rejoiced, bowed in reverence, and withdrew.\n\nThe *Upper Scroll on the Roots of Transgression in the Daoist Canon of the Numinous Treasure’s Wisdom* from the *Supreme Cavernous Mystery* thus concludes.",
      "overlap_context": " the roots of evil karma, enter the light, and return to goodness. Those who wholeheartedly revere and uphold it shall attain its blessings; those who do not believe shall incur its misfortune.\n\nAfter my departure, this text shall return to the Seven Jeweled Mysterious Terrace within the Purple Tenuity Palace of the Great Luo. In accordance with the statutes of the Illuminated True Mystery, after forty thousand kalpas, it shall descend to the world to teach and deliver the heavens and humanity.\"",
      "start_char": 10305,
      "end_char": 10356,
      "start_sentence": 316,
      "end_sentence": 318,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 2.618954658508301,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\戒律类\\太上洞玄灵宝智慧罪根上品大戒经.txt",
        "category": "戒律类"
      }
    }
  ]
}