{
  "source_id": "太上灵宝玉匮明真大斋言功仪",
  "source_file": "chunked_daozang\\太上灵宝玉匮明真大斋言功仪.json",
  "total_chunks": 8,
  "total_original_chars": 5699,
  "total_translated_chars": 38775,
  "total_translation_time": 193.6888771057129,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\威仪类\\太上灵宝玉匮明真大斋言功仪.txt",
    "category": "威仪类"
  },
  "full_translation": "*The Supreme Lingbao Jade Casket Ritual of Illuminating Perfection: Rite of Declaring Merits*\n*Text Title:* *The Supreme Lingbao Jade Casket Ritual of Illuminating Perfection: Rite of Declaring Merits*. One scroll. Compiled by Du Guangting of the late Tang and Five Dynasties period.\n*Source:* *Daoist Canon of the Zhengtong Era*, Dongxuan Section, Category of Dignified Observances.\n\n*The Supreme Lingbao Jade Casket Ritual of Illuminating Perfection: Rite of Declaring Merits*\nCompiled by Master Guangcheng, Du Guangting\n\nAll officials, in accordance with their positions, lead the procession and ascend the altar. Reciting the \"Entering the Chamber Spell,\" they offer incense to the Five Directions, beginning with the North.\nNext, they offer incense upon the *Dong’an* altar, reciting the \"Incense-Offering Spell,\" each bowing to the master and visualizing as prescribed.\nProclaiming the \"Guardian Spirit Spell,\" they strike the ritual drum twenty-four times.\n\nThe Most High Three Heavens, the Primordial Three Qi of the Supreme Lord Lao, summon forth from within us the Three and Five Merit Officers, the Left and Right Attendant Envoys, the Left and Right Dragon-Tiger Lords, the Golden Lads of Incense, the Jade Maidens of Transmission, the Direct Attendants of the Five Emperors, the Daily Attending Incense Officials—thirty-six each—to swiftly emerge and report at the first pass. The local Earth Gods and Domain Spirits of [such-and-such] place are urgently summoned to appear.\n\nWe now properly offer this incense, dedicating it to [so-and-so] who has undertaken the *Lingbao Nine Dark Realms Jade Casket Ritual of Illuminating Perfection for the Translocation of Spirits*. With the merit complete and the rites concluded, we ascend the altar to present the memorial, burn the true writ, restore offices to their holders, declare the merits, and hold the jiao offering, thereby reaffirming the power of virtue.\n\nMay the life-*qi* of the Supreme Ten Directions’ True Perfected Ones descend and flow into our bodies, that our petition swiftly reach the presence of the Most High Jade Emperor of the Limitless Dao.\n\nEach performs three bows.\nEach declares their ritual rank:\n\nDisciples of the Three Luminaries of the Great Cavern of the Mysterious Capital of Supreme Purity, Supreme Three Caverns Dharma-Masters, officiating the *Ritual of Illuminating Perfection*.\n\nWe, the Lesser Manifestation of the True Person of [such-and-such] Peak and [such-and-such] Emperor, your humble servants [so-and-so] and others, now offer this incense. By this merit, may it be dedicated above to the Emperor, the Crown Prince, the Empress, and the Imperial Consorts, bringing blessings, prolonging prosperity, and securing the peace of the realm.\n\nMay the august spirit of the Emperor of [such-and-such] Temple ascend to roam the Jade Capital, transcending the celestial pole.\n\nWe now offer this incense, surrendering body, spirit, and life to the Supreme Lingbao, the Natural and Most True, the Unsurpassed Great Dao.\nWe humbly beseech the mysterious workings to bestow boundless grace, widely extending blessings.\nMay the immortals and spirits receive deliverance, attain ranks, and achieve perfection.\nMay the guardian Dao Lords of the carefree and supreme Golden Towers of the Seven Treasures’ Natural Palace forever unite with the Dao, ever responsive to the mysterious stirrings.\nBefore the Most High and Limitless True Dao of the Ten Directions.\n\nBow to the Ten Directions, beginning with the East; each kneels fully and surrenders in repentance.\nNext, repent of the Three Karmas.\nThree invocations.\nThree bows.\n\nNext, the true writ’s inner sound is gathered from the east, south, west, north, and center. The disciple holds the true writ above the incense smoke. The master faces the altar, strikes the teeth twelve times, and recites the incantation:\n\n\"Primordial Beginning Great Emperor, Supreme Jade Sovereign,\nUniversally proclaiming to the Ten Directions,\nUnsurpassed and without superior, boundless divine realm.\nThirty-two Heavens, concealed rhymes of the sacred script.\nFive texts conjoin qi, eight assemblies radiate light.\nToday’s great amnesty spreads myriad virtues.\nNames are fixed in the immortal register, inscribed in the Purple Chamber.\nCultivating the fast and practicing the Dao, blessings flourish and spirits ascend.\nDark passes brighten, the night of obscurity opens to illumination.\nTranscending the Three Realms, resplendently attending the Celestial Emperor.\nThe imperial chart extends eternally, life and fortune without end.\nMyriad perfected ones witness and protect; the Four Seas attain great peace.\nMalevolent stars are swept away; within and without, all is secure and tranquil.\nWe entreat that this proclamation be fulfilled, as swiftly as the golden horse’s courier route.\"\n\nThe true writ is then placed upon the imperial desk, awaiting incineration with the memorial.\n\nReverently declaring the dharma rank:\nDisciple of the Three Luminaries of the Great Cavern of the Mysterious Capital of Supreme Purity, Unsurpassed Master of the Three Caverns, officiating the *Lingbao* Rite of Bright Perfection, [Name] Peak’s [Name] Emperor, Junior Prognostications Perfected Person, your servant [Name] and others, humbly and earnestly re-present this petition to the Supreme and Boundless Great Dao, the Primordial Celestial Worthy; the Supreme Great Dao Lord; the Supreme Lord Lao; the Natural and Most True Numinous Treasure Celestial Worthy; the Greatly Compassionate Celestial Worthy Who Rescues from Suffering at the Sound of Cries; the Five Elder Sovereigns; the thirty-six divisions of revered scriptures; the Great Dharma Master of the Mysterious Center; and all responsive and perceptive numinous worthies within and beyond the Three Realms.\n\nWe, your servants, have presumptuously received the profound commission and fortunately encountered the transformative power of the Dao. The Three Vehicles govern the course, the Five Qi radiate light. The true Dharma flows and spreads, universally delivering the hidden and manifest. Heaven and humanity rely upon it; the living and dead partake in its glory. Yet the great teaching, in its transmission of regulations, takes deliverance as its foundation. Above, it solely supports the state and assists the emperor, enabling the profound virtue to pervade and the divine work to extend throughout heaven and earth. The living and the dead share the same reverence; all sentient beings constantly receive salvation and protection. Moreover, in obedience to the enlightened decree, how dare we not report above?\n\nNext, the memorial is read:\nIn accordance with the memorial’s sincerity, its meaning deeply delivers and uplifts. Reverently following the mystical model, we unfold and present it in the altar precincts. Burning incense and lighting lamps, we recite scriptures and practice the Dao. We humbly offer spiritual recompense, revealing the true writ. With the precious scripture of the Eight Assemblies, we disclose and illuminate the Three Realms. Timely, we visualize and invoke, proclaiming to the revered numina. Our thoughts soar to the Ten Flowers, our minds gallop to the Eight Poles. We hope to receive the mysterious gaze and universally descend vast blessings. As the ritual’s merit reaches completion, may our aspirations extend universally. May the assembled perfected ones return, their feathered retinues to the Great Void; may the myriad sages turn their chariots, scattering auspicious radiance across the Three Realms. Below, may they illuminate the long night, broadly delivering those beyond the Yin Pass. May the great fan of compassionate wind dispel all suffering and affliction.\n\nWe, your servants, in accordance with the ritual codes, prostrate ourselves in earnest supplication. Beginning on the [day] of this month, we have undertaken and revered the fast and offering, practicing the Dao and reciting scriptures, until its completion on the [day]. Now that the fast’s affairs are concluded, we summon and command the celestial immortals, earthly immortals, perfected persons, divine persons, the Five Peaks and Four Waterways, the Nine Palaces and Five Emperors, the Three Rivers and Four Seas, the sun, moon, and stellar lodges, the cavalry and mounted troops, all the celestial attendants overseeing the fast—those who tend the incense, the golden youths, the maidens who scatter flowers, the messengers who transmit and memorialize, the flying dragon couriers—as well as the numinous guests, their officials, the overseers of the fast, the guardians of the perfected, the four-directional inspectors, and the true officials who monitor and protect. Having announced and conveyed the commands, and having overseen the fast’s affairs, those who have labored diligently shall now be separately honored. With yellow silk and vermilion memorials, their merits shall be reported and their ranks promoted.\n\nWe, your servants, fear that our conduct may transgress the codes and obscure the profound mysteries. We beseech your pardon and forgiveness, and humbly bear the profound grace.\n\nAt the commencement of the fast, we invoked the Wisdom Upper-Grade Ten Precepts; now that the fast’s affairs are concluded, they return to their heavenly palaces. Should further Dharma rites be required, they shall be invoked anew. We respectfully submit this memorial and await your proclamation.\n\nThe fast’s affairs now complete, we reaffirm its merits, restore the celestial ranks, and present a memorial of yellow silk and vermilion script upon our altar, requesting its review.\n\nNext, the memorial is read:\n\nRecorded in the registers of office, we perform the rites of the *Lingbao Mingzhen* Great Fast. The humble Perfected of [such-and-such] Peak, [such-and-such] Emperor, and the Lesser Luminaries, your servant [Name], bows twice in reverence.\n\nWe humbly address the Supreme, Boundless Dao, the Perfectly Real and Spontaneous, beneath the Golden Gates of the Celestial Palace: born of base substance in the lower realms, we acknowledge our impurity and lowliness. Yet we have presumptuously received the Great Dharma, proclaiming its teachings to deliver humanity, aiding the living and the state alike. We serve the times with devotion, standing witness before both seen and unseen. Yet we have achieved no merit in the Dharma, and our actions often violate its statutes. Day and night, we tremble in fear, daring not rest.\n\nWe bow our heads again and again.\n\nOn the day we received the Dharma, we pledged before the Three Officials to assist the state and establish merit, to propagate the profound transformation of the Dao. We vowed that within heaven and earth, its teachings would spread, delivering the living and the dead, opening the Way to all. Now, by the sacred decree of the Emperor, we knock upon the gates of the Great Dao, offering prayers for the august spirit of [such-and-such] Temple’s Emperor, that he may attain sagehood, achieve Perfection, and ascend to the Celestial Treasury. Our words are sincere and earnest, laid bare before the sacred and divine. The brightness of our hearts shines forth, moving heaven and earth.\n\nWe, who have presumptuously borne the scriptures and presided over the Mysteries, tremble in awe at the imperial command. With reverence, we lead [number] fellow Daoist priests, presenting the ritual offerings from the inner treasury in accordance with the Mysterious Statutes. At [such-and-such] place, we have established the numinous altar, modeling heaven and earth, its four bounds and eight directions resonating with the Three Clarities. We display the Eight Assemblies’ True Writings and inscribe the precious characters within, serving as tokens for the gods of heaven and earth. We have performed the *Taishang Lingbao Jiuyou Yu Kui Mingzhen* Great Fast for [number] days and nights, prostrating ourselves in submission, baring our hearts in sincerest devotion before the Radiant Sun and beneath the Three Luminaries. We have pledged our fast with utmost sincerity, kindling lamps to continue the light, illuminating the boundless Nine Dark Realms and the profound depths of the Nine Earths, dispelling the darkness of the netherworld with radiance.\n\nWe offer this repentance for [Name], beseeching forgiveness for the nine generations of ancestors and the spirits of the ancestral temple. For all karmic entanglements and accumulated obstructions from past lives, we fear they may yet hinder enlightenment or lead to wandering in darkness. We rely upon the grace of heaven to release and dissolve them, to sever all attachments and awaken to the True and Constant. Thus may the Nine Lands be at peace, the imperial mausoleums secure. May souls be refined, viscera flourish, bathed in the yang essence to purge the dregs of yin. May the Five Spirits guard and escort them, ascending to the celestial halls. May they enjoy blessings in this life and gradually ascend the ranks of the Dao. May auspiciousness descend upon their descendants and extend to the state. May the imperial reign prosper, the royal enterprise endure. May the sagely court receive blessings, its longevity matching Mount Song and Mount Heng. May the Crown Prince and the various princes attain glorious protection. May the empresses, consorts, and princesses forever preserve their felicity. May the inner and outer ministers renew their fortunes. May the Six Directions be pure, the Two Luminaries radiant. May auspicious signs appear daily, and evil omens be eradicated. Should our prayers be answered, we shall forever cherish the grace of the Dao.\n\nWe now reverently burn the True Writings, scatter the ashes, and waft the smoke aloft to the various heavens. The celestial term is fixed, and we dare not delay.\n\nFor this fast, we have invoked the celestial immortals’ troops, the divine immortals’ troops, the flying immortals’ troops, the Perfected Ones’ troops, the divine beings’ troops, the sun, moon, and stellar constellations’ troops, the Nine Palaces and Five Emperors’ troops, the Three Rivers and Four Seas’ troops, each comprising nine hundred million cavalry. We have also summoned the thirty-two heavens’ overseers of the fast, the golden lads who tend the incense, the jade maidens who scatter flowers, the Five Emperors’ direct messengers, the couriers who transmit and memorialize, the flying dragon riders, the officials of the *Lingbao*, the mighty spirits of the Three Treasures, the local earth gods and territorial Perfected, and all those who monitor, protect, announce, and convey commands, who have diligently served the fast. All are arrayed in solemn attire, accompanying this memorial to the Mysterious Capital to receive their due rewards, to be promoted in rank among the Perfected, and to have their titles elevated to imperial ranks. According to their grades, they shall be appointed as Perfected, their ranks and stations made manifest, with no omissions, in accordance with the rites of the Supreme Perfected.\n\nWe prostrate ourselves and present a memorial of yellow silk and vermilion script, submitting it to the Nine Heavens.\n\nWe implore the Supreme, Boundless Dao; the Supreme Lord of the Dao; the Supreme Lord Lao; the Most High Mysterious Elder; the Ten Directions’ Spontaneous *Lingbao* Heavenly Worthies; the perfected and great sagely hosts; and the true lords and venerable masters to deign to review this memorial. May the celestial officials be commanded to examine and distinguish its contents with compassion. May the Most Sagely Ones shine upon our sincerity.\n\nWe, who study the Dharma, have yet to master its forms of reverence.\n\nFearing that our advancement or cessation may transgress the statutes, failing to conform to the proper rites, we dread being obstructed by the Four Controllers, seized by the Five Emperors, and accumulating a thousand faults and ten thousand sins. We humbly beseech pardon and forgiveness, that our former ignorance may be absolved and no punishment meted out. We implore the Supreme Ones to discern and heed our plea.\n\nYour foolish servants, acting through the Direct Envoys of the Perfected Palaces, the Orthodox Unity Merit Registrars, the Left and Right Official Messengers, the Yin-Yang Spirit-Decision Clerks, the Scarlet Talisman Chariot Clerks, the Gale-Wind Post-Rider Memorial-Submitting Clerks, and the Flying Dragon Celestial Immortal Flying Couriers—each twenty-four in number—now take their posts.\n\nYour servants, on behalf of [Name], have completed the grand fast of the *Lingbao* Nine Dark Realms’ Luminous Perfected Spirit-Transference and Salvation. Having raised the altar and transferred the ranks, we restore the celestial positions. To reaffirm the merit and power, we prostrate ourselves and present a memorial of yellow silk and vermilion script, submitting it to the Three Bureaus of the Supreme Ones, awaiting the decree and response.\n\nWe, [Name], with utmost reverence and trepidation, bow our heads and prostrate ourselves twice in submission.\n\nTo be heard:\nYour servants, [Surname and Name], residing at [Temple Name] in [Prefecture and County], address the Formless, Nameless, Void, and Spontaneous Supreme Perfected Great Dao, the Most High Primordial Honored One before the Jeweled Jade Throne of the Golden Towers and Seven Treasures.\n\nIn the year of [Celestial Stem-Branch], on the [Day] of the [Month], we strike our teeth thrice and declare:\nWe reverently address the Supreme, Boundless Dao; the Three Supreme Ones; and the Ten Directions’ Great Sages. We now present this memorial, praying that the Merit Registrars and Attending Clerks be commanded to take charge of its submission, ensuring it ascends to the Celestial Treasury, is acted upon in due time, and, with held breath, is conveyed directly before the Supreme, Boundless Dao.\n\nMay all our requests be granted at once, all our summons answered promptly, all our petitions communicated, and all our transfers effected. Should any subordinate officials obstruct or intercept it, preventing the memorial from reaching the Supreme Ones, we entreat that they be recorded and handed over to the nearest authorities for punishment according to the celestial statutes, thereby upholding the heavenly decrees.\n\nWe prostrate ourselves, awaiting the response.\n\nNext, the memorial is placed upon the altar. With the spirits invoked as usual, we rise, bow twice, and enclose the memorial in its case.\n\nNext, we announce the Golden Register Life-Extending Tablet:\nThe Primordial Mandate of the Origin, the Golden Register White Tablet, and the True Talisman of Salvation from Suffering...\n\nWe now proclaim to the ten directions of the boundless worlds, to the Three Bureaus and Nine Courts, the One Hundred Ten Offices, the Five Thearchs’ Examiners, the Nine Dark Hells, the Mighty Celestial Enforcers, the Punitive Divine Soldiers, the Recorders of Life and Destiny, the Overseers of Merit and Execution, the Ox-Headed Wardens, and the Great Demons of the Three Realms:\n\nFor the salvation rite at this altar, we dedicate and deliver the souls awaiting deliverance, that they may depart the hells, forever leave the endless night, behold the light, have all sins washed away, and all grievances reconciled. By the merit of this Nine Perfected Wondrous Precept, we raise them to the heavens above, all in accordance with this proclamation.\n\nProclaimed in the year of the Great Year [X], month [X], day [X], at [X] altar.\n\nUpon completing the recitation, the Dharma Master strikes his teeth nine times and intones the incantation:\n\nSupreme Sage of the Primordial Origin, Exalted Spirit of the Jade Thearch,\nThe Jade Script proclaims the mandate, delivering the dead and saving the living.\nThe Golden Register’s wondrous precepts shield and succor the dark underworld.\nThe White Tablet’s precious talisman, the Nine Perfected Mystic Scriptures,\nDissolve transgressions, reconcile karmic debts, and bring peace.\nThe Perfected Savior from Suffering erases all punishments.\nThe Life-Recording Youth inscribes their names for ascent.\nThe guardian spirits of the precepts guide them to the courts of fortune.\nTranscending the Five Sufferings, they ride the cloud chariots,\nwheel through the cycles, and ascend to the Supreme Clarity.\n\nAfter the incantation, the tablet is burned along with the true script memorial case. Two cantors raise their voices in praise, bearing the staff and holding the altar tray. They, along with the supervising patron, proceed to the Heavenly Gate to burn the memorial case, true script, and White Tablet. They then return to their original positions.\n\nNext, we proclaim the Mountain Tablet, now reverently following the Emperor’s sacred decree to conduct the *Lingbao Nine Dark Hells Jade Casket Transcendence Spirit Clarity Grand Fast* for [X] days and nights at [X] location. Upon completion of the ritual circumambulations, the tablet is cast into the sacred mountain.\n\nMay the divine and transcendent ones soar to the Supreme Clarity and the Five Marchmount Perfected;\nMay the most divine and numinous ones deign to erase their sin records and inscribe their names in the Nine Heavens.\nWe beseech their presence at the sacred mountain, conveyed by the Golden Dragon Courier.\n\nProclaimed in the year of the Great Year [X], month [X], day [X], by the humble official [X] at [X] location.\n\nUpon completion of the recitation, the document is sealed in blue paper and bound with the dragon talisman.\n\nThen the disciples, holding the incense smoke as their guide, strike their teeth twelve times and recite the incantation:\n\n\"Darkness above opens to clarity, the Primordial Beginning oversees the true.\nThe Five Elders of the Supreme Emperor, the vermilion script of the Crimson Writ.\nHeaven and Earth’s origin, governing the Three Primes.\nGathering qi to summon the assembly, hastening the ascent of immortals.\nThe exalted talisman’s decree, universally proclaimed to the ten directions.\nSun, moon, and stellar lodges; the Five Marchmounts and numinous mountains.\nAbove in the heavens, below on the earth, the great spirits of the hidden and divine.\nOverseeing the registers of life, the Southern Three Gates.\nReceiving the jade tablets, inscribing names in the cinnabar scrolls.\nErasing the records of transgressions, elevating them as imperial retainers.\nConducting the fast and performing the Dao, petitioning the Nine Heavens.\nReviewing the celestial charts, obliterating the roots of sin.\nLiberating souls and spirits, transcending the gates of darkness.\nUpon completion of the ritual circumambulations, the tablet is cast into the sacred mountain.\nThe Three Paths cease their accusations, the eternal night is dispelled.\nGrudges dissolve, the earthly prisons find peace.\nFortune extends to great enterprises, blessings endure through heaven and earth.\nToday’s supplication is heard by the myriad perfected.\nWe beseech the dragon tablet to bind the covenant with the true officials.\nMay our petition be conveyed by the Golden Dragon Courier.\"\n\nUpon completion of the incantation, the assembled officials bow again.\n\nThen the Water Tablet is read:\n\n\"Now, reverently following the Emperor’s sacred decree to conduct the *Lingbao Nine Dark Hells Jade Casket Transcendence Spirit Clarity Grand Fast* for [X] days and nights at [X] location. Upon completion of the ritual circumambulations, the tablet is cast into the watery abyss.\n\nMay the divine and transcendent ones, the Three Primes, endure together.\nThe Nine Water Lords, the Twelve River Sources, the Jiang, He, Huai, and Ji, the great spirits of the vast and frigid depths.\nWe beseech the erasure of their sin records and the inscription of their names in the Nine Heavens.\nWe invite their presence at the watery abyss, conveyed by the Dragon Courier.\n\nProclaimed in the year of the Great Year [X], month [X], day [X], by the humble official [X] at [X] location.\n\nPetition text:\n\nThe Primordial Beginning and the Five Elders, the exalted ones of the Supreme Emperor.\nThe perfected of the ten directions, the numinous immortals of Mount Taihua.\nThe Crimson Writ’s decree reaches even the unseen.\nAscending to the Nine Heavens, we petition for the descent of the jade script.\nSun, moon, and five stars; the Northern Dipper’s Seven Primes.\nWe address the Five Marchmounts, the numinous mountains of the four directions.\nBelow, we address the rivers and seas, the Twelve Springs.\nThe Nine Water Lords, the great spirits of the frigid depths.\nToday’s supplication is laid before all.\nConducting the fast and performing the Dao, petitioning the Nine Heavens.\nReviewing the celestial charts, obliterating the roots of sin.\nThe eternal night brightens, souls and spirits transcend.\nThe Three Paths cease their torments, the eternal night is dispelled.\nGrudges dissolve, ascending to the various heavens.\nUpon completion of the ritual circumambulations, the tablet is cast into the numinous abyss.\nFortune and blessings flourish eternally, the imperial enterprise endures.\nWe beseech the dragon tablet to bind the covenant with the water officials.\nMay our petition be conveyed by the Golden Dragon Courier.\"\n\nUpon completion of the recitation, the assembled officials bow again.\n\nThen the Earth Tablet is read.\n\nBy imperial decree of the Sacred Emperor, a *Lingbao* Nine Dark Realms Jade Coffer Transcendence Ritual of Divine Clarity is solemnly conducted at [location] for [number] days and nights. Upon completion of the Dao-procession, the tablet is cast into the numinous altar. May the divine and immortal attain eternal life and transcend the world, soaring to the Upper Clarity, the Yellow Court of the Nine Lands, the Yellow Spirits of Wu and Ji, and the Five Emperors of the Earthly Bureau. We beseech the erasure of sins and punishments, petitioning entry into the Central Palace. The tablet records the names, and we pray our supplication be conveyed as stated. Transmitted by the Golden Dragon Courier.\n\nIn the year of [Tai Sui], [month], [day], your subject [name], holding office at [location], presents this petition:\n\nHeaven and Earth unfold, the primordial qi divides and bestows its numen. The Three Origins coexist, the ten directions shine in clarity. The Five Elders hear above, governing death and presiding over life. Crimson script on cinnabar, the *Primordial Origin’s Upper Scripture*. Universally proclaimed to the earth below, the august spirits of the Nine Lands. Today’s supplication is laid before all, the myriad immortals secure their lives. Conducting the fast and performing the Dao, petitioning the Nine Heavens. Reviewing the celestial charts, obliterating the roots of sin. The Nine Lands brighten, souls and spirits are transcended. The Great Yin ceases its torments, the Six Paths attain tranquility. Grudges dissolve, ascending to the various heavens. Upon completion of the ritual circumambulations, the tablet is cast into the numinous altar. Fortune flows for a hundred million generations, the imperial enterprise endures. We beseech the dragon tablet to bind the covenant with the earth officials. May our petition be conveyed as stated, by the Golden Dragon Courier.\n\nUpon completion of the incantation, the assembled officials bow again and cast the tablet upon the altar, into the celestial well, or bury it beneath the lunar mansion.\n\nNext, the *Hymn of Casting the Dragon Tablet* is chanted to pray for transcendence to the Purple Palace.\n\nThen the names and titles are recited, the deities are invited, and the libation is set forth.\n\nAssuming the ritual roles, we reverently perform the *Lingbao* Rite of Illuminating Divine Clarity. Your subjects, the Perfected of [specific sacred peak] and [specific deity], along with the lesser transcendents, bow again in reverence.\n\nWe humbly serve the Emperor in conducting the Great Transcendence Ritual. We respectfully invite the descent of the myriad sagely hosts of the Ten Directions, the perfected lords and venerable masters of the Jade Capital, Mystic Metropolis, and Purple Tenuity Upper Palace; the flying transcendents and perfected; the jade lads and jade maidens; those who respond to invocation and divide their radiance, to descend upon the ritual platform.\n\nWe respectfully invite the descent of the numinous immortals of Heaven and Earth, the sagely hosts of the various heavens, the Lords of the Sun and Moon, the Emperors of the Sun and Moon, the perfected and divine transcendents, the jade lads and jade maidens, to descend upon the ritual platform.\n\nWe respectfully invite the descent of the Great Emperor of the Northern Culmen and Purple Tenuity, the Lords of the Seven Stars of the Northern Dipper, the Six Stars of the Southern Dipper, the Six Stars of the Three Terraces, the Lords of the Twenty-Eight Constellations, the great spirits of the 365 degrees of the celestial circuit, the Emperors within the stars, the Perfected within the stars, to descend upon the ritual platform.\n\nWe respectfully invite the descent of the Nine Qi Lords of the Azure Emperor of the East, the Three Qi Lords of the Vermilion Emperor of the South, the Seven Qi Lords of the White Emperor of the West, the Five Qi Lords of the Black Emperor of the North, the One Qi Lord of the Yellow Emperor of the Center, the Perfected of the Five Emperors, the jade lads and jade maidens, to descend upon the ritual platform.\n\nWe respectfully invite the descent of the Lords of the Three Origins—Heavenly Official of the Upper Origin, Earthly Official of the Middle Origin, Water Official of the Lower Origin—the Nine Bureaus of the Three Palaces, the One Hundred Twenty Offices, the great spirits of the Five Peaks, the Ten Great Grotto-Heavens, the Thirty-Six Grotto-Heavens, the Twenty-Four Transformations, the Three Rivers and Four Seas, the Nine River Water Emperors, the Twelve River Sources, the Perfected of the Nine Palaces, the Twelve Immortal Lords, the Directors of Destiny of the Nine Heavens, the Venerable Ones of the Five Peaks, the Envoys of the Nine Heavens, the auxiliary and principal deities who assist the Mandate, the heavenly, earthly, and flying transcendents and divine immortals, the jade lads and jade maidens, the mounted troops and cavalry, to descend upon the ritual platform.\n\nWe respectfully invite the descent of the Perfected Officials who attend the Three Caverns and Four Supplements, the Lords and Earls of the Immortals, the Ministers and Grand Masters of the Immortals, the Censors of the Nine Heavens, the Great Dharma Masters of the Mystic Center, the Celestial Masters, their successors and lineage masters, the Three Ancient Masters, the Scripture Masters, Register Masters, and Ordination Masters, the mighty spirits of the Three Caverns, the officials of the Three Treasures, to descend upon the ritual platform.\n\nWe respectfully invite the descent of the officials of the *Lingbao* tradition who oversee the transcendents and supervise the fast, the Perfected Officials of the Direct Talisman, the attendants and officers of incense, the jade lads and jade maidens, the divine generals of the Six Jia, the jade maidens of the sixty-day cycle, the jade maidens of the Six Ding, the officers of the altars of soil and grain, and all numinous administrators, to descend upon the ritual platform.\n\nWe respectfully invite the descent of the Twenty-Four Commanders of the Regulated Realms who bear the tally and supervise merit within our bodies, the Envoys of the Four Divisions who inspect merit, the Direct Envoys of the Upper Transcendents and Upper Spirits, the Merit Officers of the Orthodox Unity, the Three Divisions, the Urgent Qi, and the Three-Five, to descend upon the ritual platform.\n\nWe respectfully invite the descent of the officers within our bodies who govern the yin and yang talismans, the Scarlet Talisman Officers of the Celestial Chariot, the mounted couriers of the fierce winds, the couriers who present memorials, the flying dragon riders, the flying transcendents and divine riders, the envoys of the upper, middle, and capital divisions, the tiger-soldier inspectors and mounted officers who detect treachery, the Commandant of the Capital Division, the Celestial Ding warriors, the celestial armored soldiers, to descend upon the ritual platform.\n\nWe respectfully invite the descent of the officers who gather and consume qi, who gather and consume spirits, who gather and consume ghosts, who gather and consume evil, who gather and consume essences, who gather and consume poisons, who execute talismans and destroy shrines, to descend upon the ritual platform.\n\nWe respectfully invite the descent of the divine generals of the Emperor’s natal destiny, the divine generals of the original destiny, the stellar officials of the greater and lesser annual destinies, the courier officers of the yearly horse, to descend upon the ritual platform.\n\nWe respectfully invite the descent of the Four Controllers and Five Emperors, the responsive numinous spirits, the officials of the Three Realms who oversee the ritual, the guardian officers of the altar, the inspectors of the empty void, the officers of the direct day and direct talisman, the local administrators, to descend upon the ritual platform.\n\nWe respectfully invite the descent of the local earth gods and the Perfected Officials of the territorial domain, to descend upon the ritual platform.\n\nWe humbly invoke the Three August Ones of the Supreme Heavenly Thearch, the Heavenly Lords and Emperors of the Ten Directions, the Three Lights and Nine Radiances, the sagely hosts of the Three Realms within and without, and all numinous spirits.\n\nMay they universally descend with vast compassion, dividing their radiance to illuminate and witness. We, having inherited residual fortune from former lives, were born in this generation. We have presumptuously borne the sacred scriptures and received the teachings of the Mysteries. Our merits are lighter than dust and dew, our transgressions heavier than mountains and hills. Truly, we should restrain ourselves and cultivate rectitude, yet the Dharma permits us to open the path of transcendence, to assist the state and establish merit, to aid the Emperor and propagate the transformative power of the Dao.\n\nNow, by the sacred decree of the Emperor, we reverently offer prayers for the exalted spirit of [Name], presenting gold-embroidered silks, incense, flowers, and ritual offerings. In strict accordance with the liturgical canons, we devoutly establish the sacred altar. We undertake the *Lingbao Jiuyou Mingzhen Yu Kui Qianshen Badu Grand Retreat*—a rite of ninefold darkness and radiant truth, the Jade Casket’s transference of souls—for [number] days and nights, culminating in perfection at [day] [hour].\n\nWe burn the true writs, dissolve the altar, and restore the spirits to their offices. The merit thus reilluminated, we perform the thanksgiving rite and proclaim the accomplishment. May this serve to repent and expiate [Name]’s transgressions, dissolve karmic entanglements, and release them from the dark nights of the underworld, ascending into the celestial halls. May their essence be refined in the Vermilion Mound, their spirit tempered in the Elixir of Cinnabar. May they ascend to the Great Ultimate, tread the Ninefold Purity, roam freely among the Ten Thousand Emperors, and feast in the company of the host of perfected beings. May they extend the blessings of imperial rule, bestow prosperity upon their descendants, transmit the phoenix lineage without end, and secure the grand design for myriad ages. May script and axle unite, earth endure, and heaven abide.\n\nMay pestilence and poison subside, calamities and misfortunes cease. May weapons fall silent, drought and flood be averted. May all within the four seas—barbarian and Hua alike—enjoy peace, and the dragon deities stand guard. May the imperial mausoleum remain eternally secure, the Central Yellow Upper Palace undisturbed. May timely rains and gentle winds prevail, and all living beings dwell in perpetual tranquility.\n\nWe humbly beseech the Three Officials to brush clean their registers and record the merit of this retreat. May the Five Emperors turn their chariots to witness this supreme blessing. We petition the celestial and terrestrial bureaus, the offices of the seen and unseen, to descend with protection and bestow auspiciousness, universally bestowing grace upon the four seas.\n\nWe, your servants, can scarcely express the depth of our earnest and reverent prayers. We bow twice in profound reverence.\n\nNext, we burn the memorial and present the paper money and horses.\n\nWe again invoke the sacred altar, beseeching the descent of the inner and outer perfected spirits. The merit of the retreat we have performed is now complete, owing truly to the Three Treasures and their divine retinues, the responsive officials of the unseen realms. They have descended with vast blessings, fulfilling our sincere entreaties. We now submit this report for transmission, honoring the labors of the perfected officials.\n\nWe fear that our offerings may have been improper, our conduct violating the liturgical canons, our movements and bearing failing to accord with celestial propriety. We humbly submit this further petition, imploring pardon.\n\nMay the exalted perfected and sagely beings ascend to the Great Void. May the honored spirits of the Three Realms return each to their respective domains. May the attending officers and local deities who have not yet taken their seats accept our sincere offerings.\n\nMay the martial and civil officials of the yin and yang realms, the inner and outer divine hosts, assist the state and deliver the people, establishing merit and benefiting all beings. May they dispel pestilential vapors and sweep away malevolent forces, ensuring the Nine Lands’ great peace and the Emperor’s ten-thousand-year reign. On the days of the Three Assemblies, may they be duly promoted.\n\nMay the underworld courts, the three paths and six destinies, the lingering souls of the Ninefold Darkness, and all categories of orphaned spirits, relying on this rite of transference, attain the realm of carefree wandering.\n\nWe, [Names], bow twice and take our leave.\n\nNext, the hymn of divine departure. The preceptor returns the precepts, and the cantor intones. The officials resume their offices; the high priest and cantor assume their ranks. Each returns to their station, and the Twelve Vows follow. The incense burner is restored.\n\nNext, the disciples are led by their master to ascend the Gate of Heaven and exit the Door of Earth. The altar-dissolution hymn is chanted, and the Earth Door spell is recited. The Three Masters are then respectfully dismissed.\n\nNext, the dedication of merit is completed, and the rites conclude.\n\nThus ends the *Taishang Lingbao Yu Kui Mingzhen Grand Retreat Rite for Proclaiming Merit*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上灵宝玉匮明真大斋言功仪 经名：太上灵宝玉匮明真大斋言功仪。 一卷。 唐末五代杜光庭修。 底本出处：《正统道藏》洞玄部威仪类。 太上灵宝玉匮明真大斋言功仪 广成先生杜光庭修 众官依位导引，升坛，念人户咒上五方香北方为始 次上洞案香，念上香咒各礼师存念如法 宣卫灵咒呜法鼓二十四通 无上三天玄元始三气太上老君，召出臣等身中三五功曹、左右官使者、左右龙虎君、侍香金童、传言玉女、五帝直符直日香官、各三十六人出，当召某处土地里域真官正神，速出一关启。 臣今正尔烧香，奉为某奉修灵宝九幽玉匮明真迁神大斋，功圆事毕，升坛拜表，焚烧真文，复职还官，言功设醮，重明功德。 愿得太上十方正真生炁，降流臣等身中，所启速达上御至真无极玉皇上帝御前。 人各三礼 各称法位 上清玄都大洞三景弟子，无上三洞法师，奉行明真大斋法事。 某岳某帝先生小兆真人臣某等今故烧香，以是功德，上为帝王太子，皇后皇妃，致福延禧，保安国祚。 某庙皇帝尊灵，游宴玉京，超凌宸极。 今故烧香，归身归神归命，太上灵宝自然至真无上大道。 特乞玄造流恩，洪厘广被。 仙灵受度，证品成真。 侍卫道君，消遥无上金阙七宝自然宫。 永与道合，启启玄感。 上御十方无极至真道前。 礼十方从东方起礼足，各长跪归命忏悔 次三业忏 三启 三礼",
      "translated_text": "*The Supreme Lingbao Jade Casket Ritual of Illuminating Perfection: Rite of Declaring Merits*\n*Text Title:* *The Supreme Lingbao Jade Casket Ritual of Illuminating Perfection: Rite of Declaring Merits*. One scroll. Compiled by Du Guangting of the late Tang and Five Dynasties period.\n*Source:* *Daoist Canon of the Zhengtong Era*, Dongxuan Section, Category of Dignified Observances.\n\n*The Supreme Lingbao Jade Casket Ritual of Illuminating Perfection: Rite of Declaring Merits*\nCompiled by Master Guangcheng, Du Guangting\n\nAll officials, in accordance with their positions, lead the procession and ascend the altar. Reciting the \"Entering the Chamber Spell,\" they offer incense to the Five Directions, beginning with the North.\nNext, they offer incense upon the *Dong’an* altar, reciting the \"Incense-Offering Spell,\" each bowing to the master and visualizing as prescribed.\nProclaiming the \"Guardian Spirit Spell,\" they strike the ritual drum twenty-four times.\n\nThe Most High Three Heavens, the Primordial Three Qi of the Supreme Lord Lao, summon forth from within us the Three and Five Merit Officers, the Left and Right Attendant Envoys, the Left and Right Dragon-Tiger Lords, the Golden Lads of Incense, the Jade Maidens of Transmission, the Direct Attendants of the Five Emperors, the Daily Attending Incense Officials—thirty-six each—to swiftly emerge and report at the first pass. The local Earth Gods and Domain Spirits of [such-and-such] place are urgently summoned to appear.\n\nWe now properly offer this incense, dedicating it to [so-and-so] who has undertaken the *Lingbao Nine Dark Realms Jade Casket Ritual of Illuminating Perfection for the Translocation of Spirits*. With the merit complete and the rites concluded, we ascend the altar to present the memorial, burn the true writ, restore offices to their holders, declare the merits, and hold the jiao offering, thereby reaffirming the power of virtue.\n\nMay the life-*qi* of the Supreme Ten Directions’ True Perfected Ones descend and flow into our bodies, that our petition swiftly reach the presence of the Most High Jade Emperor of the Limitless Dao.\n\nEach performs three bows.\nEach declares their ritual rank:\n\nDisciples of the Three Luminaries of the Great Cavern of the Mysterious Capital of Supreme Purity, Supreme Three Caverns Dharma-Masters, officiating the *Ritual of Illuminating Perfection*.\n\nWe, the Lesser Manifestation of the True Person of [such-and-such] Peak and [such-and-such] Emperor, your humble servants [so-and-so] and others, now offer this incense. By this merit, may it be dedicated above to the Emperor, the Crown Prince, the Empress, and the Imperial Consorts, bringing blessings, prolonging prosperity, and securing the peace of the realm.\n\nMay the august spirit of the Emperor of [such-and-such] Temple ascend to roam the Jade Capital, transcending the celestial pole.\n\nWe now offer this incense, surrendering body, spirit, and life to the Supreme Lingbao, the Natural and Most True, the Unsurpassed Great Dao.\nWe humbly beseech the mysterious workings to bestow boundless grace, widely extending blessings.\nMay the immortals and spirits receive deliverance, attain ranks, and achieve perfection.\nMay the guardian Dao Lords of the carefree and supreme Golden Towers of the Seven Treasures’ Natural Palace forever unite with the Dao, ever responsive to the mysterious stirrings.\nBefore the Most High and Limitless True Dao of the Ten Directions.\n\nBow to the Ten Directions, beginning with the East; each kneels fully and surrenders in repentance.\nNext, repent of the Three Karmas.\nThree invocations.\nThree bows.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 553,
      "start_sentence": 0,
      "end_sentence": 27,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.67087483406067,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\太上灵宝玉匮明真大斋言功仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "次收真文内音东南西北中次弟子执真文於香姻上，师面坛中，叩齿十二通，咒曰 元始大帝，高上玉皇，普告十方，无上无下，无极神乡。 三十二天，隐韵灵章。 五文结气，八会流光。 今日大宥，万善敷张。 定名仙图，列籍紫房。 修斋行道，介福迁神。 幽关朗晏，冥夜开光。 超登三界，景侍虚皇。 帝图延永，寿祚无疆。 万真鉴佑，四海太平。 妖星荡涤，中外康宁。 请如所告，金马驿程。 安真文於御案上，待随表焚之 重称法位 上清玄都大洞三景弟子，无上三洞法师，奉行灵宝明真大斋法事，某岳某帝先生少兆真人臣某等，谨重上启太上无极大道元始天尊、太上大道君、太上老君、自然至真灵宝天尊，寻声救苦大慈天尊、五老上帝，三十六部尊经、玄中大法师，三界内外，应感尊灵。 臣等叨荷玄勿，幸逢道化。 三乘御运，五炁开光。 正法流行，普度幽显。 人天荷赖，生死沾荣。 而大教垂科，开度为本。 上唯邦国，资佑帝王。 使玄德遍覃，神功遐布天地之内； 存殁同惧，凡在群生常加济护。 况奉明旨，敢不上闻。 次读词 按如词诚，义深拯拔。 恭依玄式，敷启坛场。 烧香然灯，转经行道。 辄坡灵报，开露真文。 以八会宝书，关明三界。 依时存注，关告尊灵。 翘想十华，驰心八极。 冀蒙玄鉴，普降洪休。 法事功圆，愿念周普。 群真复驾，返羽卫於太空； 万圣回轩，散祥辉於三境。 下照长夜，广度阴关。 大扇慈风，咸除苦恼。 臣等按依科品，沥恳冥心。 以今月某日为始，修崇斋醮，行道转经，至某日圆满。 今修斋事竟，所请天仙地仙、真人神人、五岳四渎、九宫五帝、三河四海、日月星宿、兵马骑乘，诸天监斋直事、侍香－金。 童、散花主女、传言奏事飞龙漪吏等，及灵宾官属、监斋卫真、四方监察、真官监临卫护。 宣通召命，营卫斋事，有功勤者，今当别拜。 黄缯朱表，言功举迁。 臣等恐进止犯科，不明玄奥。 乞垂赦宥，仰戴玄恩。",
      "translated_text": "Next, the true writ’s inner sound is gathered from the east, south, west, north, and center. The disciple holds the true writ above the incense smoke. The master faces the altar, strikes the teeth twelve times, and recites the incantation:\n\n\"Primordial Beginning Great Emperor, Supreme Jade Sovereign,\nUniversally proclaiming to the Ten Directions,\nUnsurpassed and without superior, boundless divine realm.\nThirty-two Heavens, concealed rhymes of the sacred script.\nFive texts conjoin qi, eight assemblies radiate light.\nToday’s great amnesty spreads myriad virtues.\nNames are fixed in the immortal register, inscribed in the Purple Chamber.\nCultivating the fast and practicing the Dao, blessings flourish and spirits ascend.\nDark passes brighten, the night of obscurity opens to illumination.\nTranscending the Three Realms, resplendently attending the Celestial Emperor.\nThe imperial chart extends eternally, life and fortune without end.\nMyriad perfected ones witness and protect; the Four Seas attain great peace.\nMalevolent stars are swept away; within and without, all is secure and tranquil.\nWe entreat that this proclamation be fulfilled, as swiftly as the golden horse’s courier route.\"\n\nThe true writ is then placed upon the imperial desk, awaiting incineration with the memorial.\n\nReverently declaring the dharma rank:\nDisciple of the Three Luminaries of the Great Cavern of the Mysterious Capital of Supreme Purity, Unsurpassed Master of the Three Caverns, officiating the *Lingbao* Rite of Bright Perfection, [Name] Peak’s [Name] Emperor, Junior Prognostications Perfected Person, your servant [Name] and others, humbly and earnestly re-present this petition to the Supreme and Boundless Great Dao, the Primordial Celestial Worthy; the Supreme Great Dao Lord; the Supreme Lord Lao; the Natural and Most True Numinous Treasure Celestial Worthy; the Greatly Compassionate Celestial Worthy Who Rescues from Suffering at the Sound of Cries; the Five Elder Sovereigns; the thirty-six divisions of revered scriptures; the Great Dharma Master of the Mysterious Center; and all responsive and perceptive numinous worthies within and beyond the Three Realms.\n\nWe, your servants, have presumptuously received the profound commission and fortunately encountered the transformative power of the Dao. The Three Vehicles govern the course, the Five Qi radiate light. The true Dharma flows and spreads, universally delivering the hidden and manifest. Heaven and humanity rely upon it; the living and dead partake in its glory. Yet the great teaching, in its transmission of regulations, takes deliverance as its foundation. Above, it solely supports the state and assists the emperor, enabling the profound virtue to pervade and the divine work to extend throughout heaven and earth. The living and the dead share the same reverence; all sentient beings constantly receive salvation and protection. Moreover, in obedience to the enlightened decree, how dare we not report above?\n\nNext, the memorial is read:\nIn accordance with the memorial’s sincerity, its meaning deeply delivers and uplifts. Reverently following the mystical model, we unfold and present it in the altar precincts. Burning incense and lighting lamps, we recite scriptures and practice the Dao. We humbly offer spiritual recompense, revealing the true writ. With the precious scripture of the Eight Assemblies, we disclose and illuminate the Three Realms. Timely, we visualize and invoke, proclaiming to the revered numina. Our thoughts soar to the Ten Flowers, our minds gallop to the Eight Poles. We hope to receive the mysterious gaze and universally descend vast blessings. As the ritual’s merit reaches completion, may our aspirations extend universally. May the assembled perfected ones return, their feathered retinues to the Great Void; may the myriad sages turn their chariots, scattering auspicious radiance across the Three Realms. Below, may they illuminate the long night, broadly delivering those beyond the Yin Pass. May the great fan of compassionate wind dispel all suffering and affliction.\n\nWe, your servants, in accordance with the ritual codes, prostrate ourselves in earnest supplication. Beginning on the [day] of this month, we have undertaken and revered the fast and offering, practicing the Dao and reciting scriptures, until its completion on the [day]. Now that the fast’s affairs are concluded, we summon and command the celestial immortals, earthly immortals, perfected persons, divine persons, the Five Peaks and Four Waterways, the Nine Palaces and Five Emperors, the Three Rivers and Four Seas, the sun, moon, and stellar lodges, the cavalry and mounted troops, all the celestial attendants overseeing the fast—those who tend the incense, the golden youths, the maidens who scatter flowers, the messengers who transmit and memorialize, the flying dragon couriers—as well as the numinous guests, their officials, the overseers of the fast, the guardians of the perfected, the four-directional inspectors, and the true officials who monitor and protect. Having announced and conveyed the commands, and having overseen the fast’s affairs, those who have labored diligently shall now be separately honored. With yellow silk and vermilion memorials, their merits shall be reported and their ranks promoted.\n\nWe, your servants, fear that our conduct may transgress the codes and obscure the profound mysteries. We beseech your pardon and forgiveness, and humbly bear the profound grace.",
      "overlap_context": "y the immortals and spirits receive deliverance, attain ranks, and achieve perfection.\nMay the guardian Dao Lords of the carefree and supreme Golden Towers of the Seven Treasures’ Natural Palace forever unite with the Dao, ever responsive to the mysterious stirrings.\nBefore the Most High and Limitless True Dao of the Ten Directions.\n\nBow to the Ten Directions, beginning with the East; each kneels fully and surrenders in repentance.\nNext, repent of the Three Karmas.\nThree invocations.\nThree bows.",
      "start_char": 553,
      "end_char": 1299,
      "start_sentence": 28,
      "end_sentence": 74,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.358800888061523,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\太上灵宝玉匮明真大斋言功仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "启斋之始，所请智慧上品十戒，斋事既毕，谒还天宫。 后有法事，当复启请。 谨上启闻，伏须告报。 臣修斋事竟，重明功德，复诸天位，拜黄缯朱表一通，在臣前奏案之上，请省表文。 次读表 具箓职，奉行灵宝明真大斋法事，某岳某帝先生小兆真人臣某稽首再礼。 上启太上无极大道，至真自然金阙下，臣等禀质下凡，自惟秽贱。 叨奉大法，宣教度人。 下济生灵，上及邦国。 佐时效节，质对幽明。 而於法无功，动违科典。 夙夜震惧，不敢遑宁。 臣等顿首顿首。 臣等受法之日，盟告三官。 约当佐国立功，奉扬玄化。 使天地之内，道训宣行，济拔存亡，开度一切。 臣今钦奉皇帝圣旨，上叩大道。 奉为某庙皇帝尊灵，证圣成真，升入天府。 词诚丹切，披露圣神。 明明寸心，感贯天地。 臣叨佩经法，职主玄司。 钦奉纶音，不胜震惕。 谨率同法道士若干人，以内藏所出质信之礼，依按玄科，於某处置立灵坛，法天象地。 四界八极，玄应三清。 出八会真文，内书宝字，为天地神明之信。 奉修太上灵宝九幽玉匮明真大斋，若干日夜。 稽颡归命，披心贡诚於太阳之前，三光之下。 盟斋沥恳，然灯续明。 下照九幽无极世界，九地重阴之中，开诸光明，照烛冥夜。 奉为某忏谢九玄忆世、宗庙先灵。 前身所有，滞染尘缘，积诸障累。 恐未能於昭彻，或尚致於冥行。 仰仗天恩，咸希开释。 离诸染着，顿悟真常。 即使九土潜宁，陵庙安稳。 魂神受炼，脏腑生华。 灌沐阳精，消荡阴滓。 五神扶卫，腾景天堂。 世享福缘，渐登道品。 垂祥后嗣，延贶邦家。 帝祚隆昌，皇图克固。 圣朝纳佑，寿等嵩衡。 太子诸王，咸臻景佑。 后妃公主，永保福祥。 内外臣寮，允新禄祚。 六合清静，两耀光华。 吉应日闻，妖恶殄灭。 如蒙所愿，永衔道恩。 谨当焚烧真文，散灰扬烟。 上御诸天，玄期有限，不敢稽滞。 臣所修斋，上请天仙兵马、神仙兵马、飞仙兵马、真人兵马、神人兵马、日月星宿兵马、九宫五帝兵马、三河四海兵马、五岳四渎兵马，各九亿万骑，三十二天监斋直事、侍香金帝、散花玉女、五帝直符、传言奏事、飞龙骑吏等，及灵宝官属，三宝威神，此间土地里域真官，诸是监临卫护，宣通召命，营侍斋事，有功勤者。 一切严装，随臣今表，上诣玄都，列受功赏，进品上真，加爵帝秩。 随品署真，高下等级，皆令显达。 一如太真之仪，无令遗漏。 臣谨伏地，拜黄素朱表一通，上闻九天。 恩惟太上无极大道太上大道君、太上老君、无上玄老十方自然灵宝天尊，已得道大圣众，至真诸君丈人，垂哀省览，敕勒天官，典者曲垂，省理分别。 惟蒙至圣，鉴映丹情。 臣等学法，未备俯仰之格。",
      "translated_text": "At the commencement of the fast, we invoked the Wisdom Upper-Grade Ten Precepts; now that the fast’s affairs are concluded, they return to their heavenly palaces. Should further Dharma rites be required, they shall be invoked anew. We respectfully submit this memorial and await your proclamation.\n\nThe fast’s affairs now complete, we reaffirm its merits, restore the celestial ranks, and present a memorial of yellow silk and vermilion script upon our altar, requesting its review.\n\nNext, the memorial is read:\n\nRecorded in the registers of office, we perform the rites of the *Lingbao Mingzhen* Great Fast. The humble Perfected of [such-and-such] Peak, [such-and-such] Emperor, and the Lesser Luminaries, your servant [Name], bows twice in reverence.\n\nWe humbly address the Supreme, Boundless Dao, the Perfectly Real and Spontaneous, beneath the Golden Gates of the Celestial Palace: born of base substance in the lower realms, we acknowledge our impurity and lowliness. Yet we have presumptuously received the Great Dharma, proclaiming its teachings to deliver humanity, aiding the living and the state alike. We serve the times with devotion, standing witness before both seen and unseen. Yet we have achieved no merit in the Dharma, and our actions often violate its statutes. Day and night, we tremble in fear, daring not rest.\n\nWe bow our heads again and again.\n\nOn the day we received the Dharma, we pledged before the Three Officials to assist the state and establish merit, to propagate the profound transformation of the Dao. We vowed that within heaven and earth, its teachings would spread, delivering the living and the dead, opening the Way to all. Now, by the sacred decree of the Emperor, we knock upon the gates of the Great Dao, offering prayers for the august spirit of [such-and-such] Temple’s Emperor, that he may attain sagehood, achieve Perfection, and ascend to the Celestial Treasury. Our words are sincere and earnest, laid bare before the sacred and divine. The brightness of our hearts shines forth, moving heaven and earth.\n\nWe, who have presumptuously borne the scriptures and presided over the Mysteries, tremble in awe at the imperial command. With reverence, we lead [number] fellow Daoist priests, presenting the ritual offerings from the inner treasury in accordance with the Mysterious Statutes. At [such-and-such] place, we have established the numinous altar, modeling heaven and earth, its four bounds and eight directions resonating with the Three Clarities. We display the Eight Assemblies’ True Writings and inscribe the precious characters within, serving as tokens for the gods of heaven and earth. We have performed the *Taishang Lingbao Jiuyou Yu Kui Mingzhen* Great Fast for [number] days and nights, prostrating ourselves in submission, baring our hearts in sincerest devotion before the Radiant Sun and beneath the Three Luminaries. We have pledged our fast with utmost sincerity, kindling lamps to continue the light, illuminating the boundless Nine Dark Realms and the profound depths of the Nine Earths, dispelling the darkness of the netherworld with radiance.\n\nWe offer this repentance for [Name], beseeching forgiveness for the nine generations of ancestors and the spirits of the ancestral temple. For all karmic entanglements and accumulated obstructions from past lives, we fear they may yet hinder enlightenment or lead to wandering in darkness. We rely upon the grace of heaven to release and dissolve them, to sever all attachments and awaken to the True and Constant. Thus may the Nine Lands be at peace, the imperial mausoleums secure. May souls be refined, viscera flourish, bathed in the yang essence to purge the dregs of yin. May the Five Spirits guard and escort them, ascending to the celestial halls. May they enjoy blessings in this life and gradually ascend the ranks of the Dao. May auspiciousness descend upon their descendants and extend to the state. May the imperial reign prosper, the royal enterprise endure. May the sagely court receive blessings, its longevity matching Mount Song and Mount Heng. May the Crown Prince and the various princes attain glorious protection. May the empresses, consorts, and princesses forever preserve their felicity. May the inner and outer ministers renew their fortunes. May the Six Directions be pure, the Two Luminaries radiant. May auspicious signs appear daily, and evil omens be eradicated. Should our prayers be answered, we shall forever cherish the grace of the Dao.\n\nWe now reverently burn the True Writings, scatter the ashes, and waft the smoke aloft to the various heavens. The celestial term is fixed, and we dare not delay.\n\nFor this fast, we have invoked the celestial immortals’ troops, the divine immortals’ troops, the flying immortals’ troops, the Perfected Ones’ troops, the divine beings’ troops, the sun, moon, and stellar constellations’ troops, the Nine Palaces and Five Emperors’ troops, the Three Rivers and Four Seas’ troops, each comprising nine hundred million cavalry. We have also summoned the thirty-two heavens’ overseers of the fast, the golden lads who tend the incense, the jade maidens who scatter flowers, the Five Emperors’ direct messengers, the couriers who transmit and memorialize, the flying dragon riders, the officials of the *Lingbao*, the mighty spirits of the Three Treasures, the local earth gods and territorial Perfected, and all those who monitor, protect, announce, and convey commands, who have diligently served the fast. All are arrayed in solemn attire, accompanying this memorial to the Mysterious Capital to receive their due rewards, to be promoted in rank among the Perfected, and to have their titles elevated to imperial ranks. According to their grades, they shall be appointed as Perfected, their ranks and stations made manifest, with no omissions, in accordance with the rites of the Supreme Perfected.\n\nWe prostrate ourselves and present a memorial of yellow silk and vermilion script, submitting it to the Nine Heavens.\n\nWe implore the Supreme, Boundless Dao; the Supreme Lord of the Dao; the Supreme Lord Lao; the Most High Mysterious Elder; the Ten Directions’ Spontaneous *Lingbao* Heavenly Worthies; the perfected and great sagely hosts; and the true lords and venerable masters to deign to review this memorial. May the celestial officials be commanded to examine and distinguish its contents with compassion. May the Most Sagely Ones shine upon our sincerity.\n\nWe, who study the Dharma, have yet to master its forms of reverence.",
      "overlap_context": "directional inspectors, and the true officials who monitor and protect. Having announced and conveyed the commands, and having overseen the fast’s affairs, those who have labored diligently shall now be separately honored. With yellow silk and vermilion memorials, their merits shall be reported and their ranks promoted.\n\nWe, your servants, fear that our conduct may transgress the codes and obscure the profound mysteries. We beseech your pardon and forgiveness, and humbly bear the profound grace.",
      "start_char": 1299,
      "end_char": 2310,
      "start_sentence": 75,
      "end_sentence": 132,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.98301124572754,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\太上灵宝玉匮明真大斋言功仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "恐进止犯科，不合仪式。 为四司所斜，五帝所执，千愆万罪，乞蒙赦宥。 一及原未悟，不见罪罚。 恩惟太上，分别求哀。 臣愚谨因真宫直使、正一功曹、左右官使者、阴阳神决吏、科车赤符吏、刚风骑置驿马上章吏、飞龙神龙天仙飞直骑吏，各二十四人出操。 臣谨为某奉修灵宝九幽明真迁神拔度大斋事竟。 起坛迁职，复诸天位。 重明功德，拜奏黄素朱表一通，上诣太上三夫曹，伏须告报。 臣某诚惶诚恐，稽首再拜。 以闻 臣姓某属某州县宫观住持 太上无形无名虚无自然至真大道无上元尊金阙七宝玉陛下 太岁某年某月日 次叩齿三通，启曰 臣谨重启太上无极大道太上三尊十方大圣。 臣今拜奏表文，愿敕功曹典者，主领进御，必使上合天府，应时行下，闭气升章，径御太上无极大道御前。 当令所请时下，所召时到，所申者通，所迁者达。 若有下官，故气邀截，表文不使上御者，录付所在近司，依律理罪，以明天宪。 臣等伏待报应。 次露表案上，存神如常，讫起，再拜，收表，卦函 次告金箓度命简 元始符命、金箓白简、救苦真符，",
      "translated_text": "Fearing that our advancement or cessation may transgress the statutes, failing to conform to the proper rites, we dread being obstructed by the Four Controllers, seized by the Five Emperors, and accumulating a thousand faults and ten thousand sins. We humbly beseech pardon and forgiveness, that our former ignorance may be absolved and no punishment meted out. We implore the Supreme Ones to discern and heed our plea.\n\nYour foolish servants, acting through the Direct Envoys of the Perfected Palaces, the Orthodox Unity Merit Registrars, the Left and Right Official Messengers, the Yin-Yang Spirit-Decision Clerks, the Scarlet Talisman Chariot Clerks, the Gale-Wind Post-Rider Memorial-Submitting Clerks, and the Flying Dragon Celestial Immortal Flying Couriers—each twenty-four in number—now take their posts.\n\nYour servants, on behalf of [Name], have completed the grand fast of the *Lingbao* Nine Dark Realms’ Luminous Perfected Spirit-Transference and Salvation. Having raised the altar and transferred the ranks, we restore the celestial positions. To reaffirm the merit and power, we prostrate ourselves and present a memorial of yellow silk and vermilion script, submitting it to the Three Bureaus of the Supreme Ones, awaiting the decree and response.\n\nWe, [Name], with utmost reverence and trepidation, bow our heads and prostrate ourselves twice in submission.\n\nTo be heard:\nYour servants, [Surname and Name], residing at [Temple Name] in [Prefecture and County], address the Formless, Nameless, Void, and Spontaneous Supreme Perfected Great Dao, the Most High Primordial Honored One before the Jeweled Jade Throne of the Golden Towers and Seven Treasures.\n\nIn the year of [Celestial Stem-Branch], on the [Day] of the [Month], we strike our teeth thrice and declare:\nWe reverently address the Supreme, Boundless Dao; the Three Supreme Ones; and the Ten Directions’ Great Sages. We now present this memorial, praying that the Merit Registrars and Attending Clerks be commanded to take charge of its submission, ensuring it ascends to the Celestial Treasury, is acted upon in due time, and, with held breath, is conveyed directly before the Supreme, Boundless Dao.\n\nMay all our requests be granted at once, all our summons answered promptly, all our petitions communicated, and all our transfers effected. Should any subordinate officials obstruct or intercept it, preventing the memorial from reaching the Supreme Ones, we entreat that they be recorded and handed over to the nearest authorities for punishment according to the celestial statutes, thereby upholding the heavenly decrees.\n\nWe prostrate ourselves, awaiting the response.\n\nNext, the memorial is placed upon the altar. With the spirits invoked as usual, we rise, bow twice, and enclose the memorial in its case.\n\nNext, we announce the Golden Register Life-Extending Tablet:\nThe Primordial Mandate of the Origin, the Golden Register White Tablet, and the True Talisman of Salvation from Suffering...",
      "overlap_context": " Supreme, Boundless Dao; the Supreme Lord of the Dao; the Supreme Lord Lao; the Most High Mysterious Elder; the Ten Directions’ Spontaneous *Lingbao* Heavenly Worthies; the perfected and great sagely hosts; and the true lords and venerable masters to deign to review this memorial. May the celestial officials be commanded to examine and distinguish its contents with compassion. May the Most Sagely Ones shine upon our sincerity.\n\nWe, who study the Dharma, have yet to master its forms of reverence.",
      "start_char": 2310,
      "end_char": 2746,
      "start_sentence": 133,
      "end_sentence": 154,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.995686054229736,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\太上灵宝玉匮明真大斋言功仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "告下十方无极世界、三官九府、百一十曹、五帝考官，九幽地狱、巨天力士、执罚神兵、司录司命、司功司杀，牛头狱卒，三界大魔。 拔度斋坛，系荐应度亡魂，出离地狱，永辞长夜，睹见光明，万罪荡除，冤仇和释。 乘此九真妙戒，拔度功德，上生诸天，一如告命。 太岁某年某月日於某坛中告下 读文讫，法师叩齿九通，咒曰 元始上圣，玉帝高灵。 玉文告命，济死度生。 金箓妙戒，拯护幽冥。 白简宝符，九真玄经。 解销罪咎，冤债和平。 救苦真人，削除罪刑。 察命童子，注上生名。 护戒威神，引诣福庭。 超离五苦，乘驾云饼，轮转得通，飞升上清。 咒毕，以简随真文表函焚之。 声赞二人，持节洞案，捧案，监斋主同诣天门，焚表函真文白简讫。 还复本位，次告山简今钦奉皇帝圣旨，於某处奉修灵宝九幽玉匮迁神明真大斋，若干日夜，行道事讫，投简灵山。 愿神愿仙，飞行上清五岳真人； 至神至灵，乞削罪录上名九天。 请诣灵山，金龙驿传。 太岁某年某月日具位臣，某於某处 告文 读讫，青纸封龙配之",
      "translated_text": "We now proclaim to the ten directions of the boundless worlds, to the Three Bureaus and Nine Courts, the One Hundred Ten Offices, the Five Thearchs’ Examiners, the Nine Dark Hells, the Mighty Celestial Enforcers, the Punitive Divine Soldiers, the Recorders of Life and Destiny, the Overseers of Merit and Execution, the Ox-Headed Wardens, and the Great Demons of the Three Realms:\n\nFor the salvation rite at this altar, we dedicate and deliver the souls awaiting deliverance, that they may depart the hells, forever leave the endless night, behold the light, have all sins washed away, and all grievances reconciled. By the merit of this Nine Perfected Wondrous Precept, we raise them to the heavens above, all in accordance with this proclamation.\n\nProclaimed in the year of the Great Year [X], month [X], day [X], at [X] altar.\n\nUpon completing the recitation, the Dharma Master strikes his teeth nine times and intones the incantation:\n\nSupreme Sage of the Primordial Origin, Exalted Spirit of the Jade Thearch,\nThe Jade Script proclaims the mandate, delivering the dead and saving the living.\nThe Golden Register’s wondrous precepts shield and succor the dark underworld.\nThe White Tablet’s precious talisman, the Nine Perfected Mystic Scriptures,\nDissolve transgressions, reconcile karmic debts, and bring peace.\nThe Perfected Savior from Suffering erases all punishments.\nThe Life-Recording Youth inscribes their names for ascent.\nThe guardian spirits of the precepts guide them to the courts of fortune.\nTranscending the Five Sufferings, they ride the cloud chariots,\nwheel through the cycles, and ascend to the Supreme Clarity.\n\nAfter the incantation, the tablet is burned along with the true script memorial case. Two cantors raise their voices in praise, bearing the staff and holding the altar tray. They, along with the supervising patron, proceed to the Heavenly Gate to burn the memorial case, true script, and White Tablet. They then return to their original positions.\n\nNext, we proclaim the Mountain Tablet, now reverently following the Emperor’s sacred decree to conduct the *Lingbao Nine Dark Hells Jade Casket Transcendence Spirit Clarity Grand Fast* for [X] days and nights at [X] location. Upon completion of the ritual circumambulations, the tablet is cast into the sacred mountain.\n\nMay the divine and transcendent ones soar to the Supreme Clarity and the Five Marchmount Perfected;\nMay the most divine and numinous ones deign to erase their sin records and inscribe their names in the Nine Heavens.\nWe beseech their presence at the sacred mountain, conveyed by the Golden Dragon Courier.\n\nProclaimed in the year of the Great Year [X], month [X], day [X], by the humble official [X] at [X] location.\n\nUpon completion of the recitation, the document is sealed in blue paper and bound with the dragon talisman.",
      "overlap_context": "ed over to the nearest authorities for punishment according to the celestial statutes, thereby upholding the heavenly decrees.\n\nWe prostrate ourselves, awaiting the response.\n\nNext, the memorial is placed upon the altar. With the spirits invoked as usual, we rise, bow twice, and enclose the memorial in its case.\n\nNext, we announce the Golden Register Life-Extending Tablet:\nThe Primordial Mandate of the Origin, the Golden Register White Tablet, and the True Talisman of Salvation from Suffering...",
      "start_char": 2746,
      "end_char": 3172,
      "start_sentence": 155,
      "end_sentence": 177,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.390048027038574,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\太上灵宝玉匮明真大斋言功仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "次第子执於香烟上师，叩齿十二通，咒曰 玄上开明，元始监真。 上帝五老，赤书丹文。 天地本始，总领三元。 摄气召会，催促举仙。 高上符命，普告十方。 日月星宿，五岳灵山。 天上地下，冥灵大神。 监生主录，南上三门。 关领玉简，勒名丹篇。 削落罪目，上补帝臣。 修斋行道，上告九天。 总校图录，削灭罪根。 魂神开度，超出幽关。 行道事竟，投简灵山。 三涂罢对，长夜蒙原。 冤仇释散，地府宁闲。 福延大业，祚永乾坤。 今日上告，万真咸闻。 请以龙简，关盟真官。 乞如所告，金龙驿传。 咒毕，众官再礼 次读水简文 今钦奉皇帝圣旨，於某处奉修灵宝九幽玉匮迁神明真大斋，若干日夜。 行道事讫，投简水府。 愿神愿仙，三元同存。 九府水帝、十二河源、江河淮济，溟泠大神。 乞削罪录，上名九天。 请诣水府，龙驿传。 太岁某年某月日具位臣某於某处 告文 元始五老，上帝高尊。 十方至真，太华灵仙。 赤文告命，无幽不关。 上御九天，请下玉文。 日月五星，北斗七元。 中告五岳，四方灵山。 下告河海，十二泉源。 九府水帝，俱泠大神。 今日上告，万愿开陈。 修斋行道，上告九天。 总校图录，削灭，罪根。 幽夜开朗，超度魂神。 三涂息苦，长夜蒙原。 冤仇解散，上升诸天，行道事讫，投简灵渊。 福祚隆永，帝业长延。 请以龙简，告盟水官。 乞如所陈，金龙驿传。 吮毕，众官再礼 次读土简文",
      "translated_text": "Then the disciples, holding the incense smoke as their guide, strike their teeth twelve times and recite the incantation:\n\n\"Darkness above opens to clarity, the Primordial Beginning oversees the true.\nThe Five Elders of the Supreme Emperor, the vermilion script of the Crimson Writ.\nHeaven and Earth’s origin, governing the Three Primes.\nGathering qi to summon the assembly, hastening the ascent of immortals.\nThe exalted talisman’s decree, universally proclaimed to the ten directions.\nSun, moon, and stellar lodges; the Five Marchmounts and numinous mountains.\nAbove in the heavens, below on the earth, the great spirits of the hidden and divine.\nOverseeing the registers of life, the Southern Three Gates.\nReceiving the jade tablets, inscribing names in the cinnabar scrolls.\nErasing the records of transgressions, elevating them as imperial retainers.\nConducting the fast and performing the Dao, petitioning the Nine Heavens.\nReviewing the celestial charts, obliterating the roots of sin.\nLiberating souls and spirits, transcending the gates of darkness.\nUpon completion of the ritual circumambulations, the tablet is cast into the sacred mountain.\nThe Three Paths cease their accusations, the eternal night is dispelled.\nGrudges dissolve, the earthly prisons find peace.\nFortune extends to great enterprises, blessings endure through heaven and earth.\nToday’s supplication is heard by the myriad perfected.\nWe beseech the dragon tablet to bind the covenant with the true officials.\nMay our petition be conveyed by the Golden Dragon Courier.\"\n\nUpon completion of the incantation, the assembled officials bow again.\n\nThen the Water Tablet is read:\n\n\"Now, reverently following the Emperor’s sacred decree to conduct the *Lingbao Nine Dark Hells Jade Casket Transcendence Spirit Clarity Grand Fast* for [X] days and nights at [X] location. Upon completion of the ritual circumambulations, the tablet is cast into the watery abyss.\n\nMay the divine and transcendent ones, the Three Primes, endure together.\nThe Nine Water Lords, the Twelve River Sources, the Jiang, He, Huai, and Ji, the great spirits of the vast and frigid depths.\nWe beseech the erasure of their sin records and the inscription of their names in the Nine Heavens.\nWe invite their presence at the watery abyss, conveyed by the Dragon Courier.\n\nProclaimed in the year of the Great Year [X], month [X], day [X], by the humble official [X] at [X] location.\n\nPetition text:\n\nThe Primordial Beginning and the Five Elders, the exalted ones of the Supreme Emperor.\nThe perfected of the ten directions, the numinous immortals of Mount Taihua.\nThe Crimson Writ’s decree reaches even the unseen.\nAscending to the Nine Heavens, we petition for the descent of the jade script.\nSun, moon, and five stars; the Northern Dipper’s Seven Primes.\nWe address the Five Marchmounts, the numinous mountains of the four directions.\nBelow, we address the rivers and seas, the Twelve Springs.\nThe Nine Water Lords, the great spirits of the frigid depths.\nToday’s supplication is laid before all.\nConducting the fast and performing the Dao, petitioning the Nine Heavens.\nReviewing the celestial charts, obliterating the roots of sin.\nThe eternal night brightens, souls and spirits transcend.\nThe Three Paths cease their torments, the eternal night is dispelled.\nGrudges dissolve, ascending to the various heavens.\nUpon completion of the ritual circumambulations, the tablet is cast into the numinous abyss.\nFortune and blessings flourish eternally, the imperial enterprise endures.\nWe beseech the dragon tablet to bind the covenant with the water officials.\nMay our petition be conveyed by the Golden Dragon Courier.\"\n\nUpon completion of the recitation, the assembled officials bow again.\n\nThen the Earth Tablet is read.",
      "overlap_context": "endent ones soar to the Supreme Clarity and the Five Marchmount Perfected;\nMay the most divine and numinous ones deign to erase their sin records and inscribe their names in the Nine Heavens.\nWe beseech their presence at the sacred mountain, conveyed by the Golden Dragon Courier.\n\nProclaimed in the year of the Great Year [X], month [X], day [X], by the humble official [X] at [X] location.\n\nUpon completion of the recitation, the document is sealed in blue paper and bound with the dragon talisman.",
      "start_char": 3172,
      "end_char": 3732,
      "start_sentence": 178,
      "end_sentence": 227,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.303720235824585,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\太上灵宝玉匮明真大斋言功仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "今钦奉皇帝圣旨，於某处奉修灵宝九幽玉匮迁神明真大斋，若干日夜。 行道事讫，投简灵坛。 愿神愿仙，长生度世。 飞行上清，中黄九土，戊己黄神，土府五帝。 乞削罪刑，请诣中宫。 投简记名，乞如所告。 金龙驿传。 太岁某年某月日具位臣某於某处 告文 天地开张，元气分灵。 三元同存，十方朗清。 五老上闻，主死领生。 丹书赤文，元始上经。 普告无下，九地皇灵。 今日上告，万仙定生。 修斋行道，上告九天。 总校图录，削灭罪根。 九地开朗，迁度魂神。 太阴息苦，六趣宁闲。 和冤释对，上生诸天。 行道事竟，投简灵坛。 福流亿世，帝祚长延。 请以龙简，告盟地官。 乞如所告，金龙驿传。 咒毕，众官再拜投简於坛上、天井中或埋於月辰之上 次吟投龙赞祈真登紫府全章 次称名位，降神设醮 具法职，奉行灵宝明真大斋法事，某岳某帝先生小兆真人臣某等稽首再礼。 臣谨奉皇帝，修建迁神大斋。 谨奉降玉京玄都紫微上宫十方大圣众，至真诸君丈人，飞仙真人，玉童玉女，应感分辉，降临醮座。 谨奉降天地灵仙，诸天上圣，日君月君，日月帝君，真人神仙，玉童玉女，降临醮座。 谨奉降北极句陈天皇大帝君，北斗七星君，南斗六星君，三台六星君，二十八宿君，周天三百六十五度星中大神，星中帝君，星中真人，降临醮座。 谨上请东方青帝九气君，南方赤帝三气君，西方白帝七气君，北方黑帝五气君，中央黄帝一气君，五帝真人，玉童玉女，降临醮座。 谨上请三元君，上元天官、中元地官、下元水官，三宫九府，百二十曹，五岳大神，十大洞天，三十六洞天，二十四化，三河四海，九江水帝，十二河源，九宫真人，十二仙君，九天司命，五岳丈人，九天使者，储副正职佐命大神，天仙地仙，飞仙神仙，王童玉女，兵马骑乘，降临醮座。 谨上请三洞四辅侍经真官，仙公仙伯，仙卿大夫，九天御史，玄中大法师，天师嗣师系师，上古三师，经师籍师度师，三洞威神，三宝官属，降临醮座。 谨上请灵宝官属领仙监斋，直符真官，侍香将吏，玉童玉女，六甲神将，六旬玉女，六丁玉女，社稷将吏，一切灵司，降临醮座。 谨请身中所佩二十四治执节监功大将军，四部监功谒者，上仙上灵直使，正一功曹、三部功曹、促气功曹、三五功曹等，降临醮座。 谨请身中所佩，阴阳神决吏、科车赤符吏、刚风骑置驿马上章吏、飞龙骑吏、天真飞仙骑吏，上部使者、中部使者、都官使者，郎吏虎贲察奸句骑吏，都官仆射，天丁力士，天驺甲卒等，降临醮座。 谨请收气食气吏、收神食神吏、收鬼食鬼吏、收邪食邪吏、收精食精吏、收毒食毒吏、诛符破庙吏等，降临醮座。 谨奉请某皇帝本命神将、元辰神将、大小行年本命星官，驿马将吏等，降临醮座。 谨奉请四司五帝，应感真灵，三界职司、卫坛将吏，虚空监察，直日直符，当界主司等，降临醮座。 奉请当处土地，里域真官，降临醮座。 臣谨上启太上三尊昊天上帝，十方上圣三光九耀天帝天君，三界内外，一切真灵。 伏愿普降洪慈，分辉照鉴。 臣以夙承余福，得诞今生。 叨佩灵文，禀修玄教。 功轻尘露，过重丘山。 诚宜束身以自修检，而法许开度，佐国立功，辅助帝王，宣弘道化。",
      "translated_text": "By imperial decree of the Sacred Emperor, a *Lingbao* Nine Dark Realms Jade Coffer Transcendence Ritual of Divine Clarity is solemnly conducted at [location] for [number] days and nights. Upon completion of the Dao-procession, the tablet is cast into the numinous altar. May the divine and immortal attain eternal life and transcend the world, soaring to the Upper Clarity, the Yellow Court of the Nine Lands, the Yellow Spirits of Wu and Ji, and the Five Emperors of the Earthly Bureau. We beseech the erasure of sins and punishments, petitioning entry into the Central Palace. The tablet records the names, and we pray our supplication be conveyed as stated. Transmitted by the Golden Dragon Courier.\n\nIn the year of [Tai Sui], [month], [day], your subject [name], holding office at [location], presents this petition:\n\nHeaven and Earth unfold, the primordial qi divides and bestows its numen. The Three Origins coexist, the ten directions shine in clarity. The Five Elders hear above, governing death and presiding over life. Crimson script on cinnabar, the *Primordial Origin’s Upper Scripture*. Universally proclaimed to the earth below, the august spirits of the Nine Lands. Today’s supplication is laid before all, the myriad immortals secure their lives. Conducting the fast and performing the Dao, petitioning the Nine Heavens. Reviewing the celestial charts, obliterating the roots of sin. The Nine Lands brighten, souls and spirits are transcended. The Great Yin ceases its torments, the Six Paths attain tranquility. Grudges dissolve, ascending to the various heavens. Upon completion of the ritual circumambulations, the tablet is cast into the numinous altar. Fortune flows for a hundred million generations, the imperial enterprise endures. We beseech the dragon tablet to bind the covenant with the earth officials. May our petition be conveyed as stated, by the Golden Dragon Courier.\n\nUpon completion of the incantation, the assembled officials bow again and cast the tablet upon the altar, into the celestial well, or bury it beneath the lunar mansion.\n\nNext, the *Hymn of Casting the Dragon Tablet* is chanted to pray for transcendence to the Purple Palace.\n\nThen the names and titles are recited, the deities are invited, and the libation is set forth.\n\nAssuming the ritual roles, we reverently perform the *Lingbao* Rite of Illuminating Divine Clarity. Your subjects, the Perfected of [specific sacred peak] and [specific deity], along with the lesser transcendents, bow again in reverence.\n\nWe humbly serve the Emperor in conducting the Great Transcendence Ritual. We respectfully invite the descent of the myriad sagely hosts of the Ten Directions, the perfected lords and venerable masters of the Jade Capital, Mystic Metropolis, and Purple Tenuity Upper Palace; the flying transcendents and perfected; the jade lads and jade maidens; those who respond to invocation and divide their radiance, to descend upon the ritual platform.\n\nWe respectfully invite the descent of the numinous immortals of Heaven and Earth, the sagely hosts of the various heavens, the Lords of the Sun and Moon, the Emperors of the Sun and Moon, the perfected and divine transcendents, the jade lads and jade maidens, to descend upon the ritual platform.\n\nWe respectfully invite the descent of the Great Emperor of the Northern Culmen and Purple Tenuity, the Lords of the Seven Stars of the Northern Dipper, the Six Stars of the Southern Dipper, the Six Stars of the Three Terraces, the Lords of the Twenty-Eight Constellations, the great spirits of the 365 degrees of the celestial circuit, the Emperors within the stars, the Perfected within the stars, to descend upon the ritual platform.\n\nWe respectfully invite the descent of the Nine Qi Lords of the Azure Emperor of the East, the Three Qi Lords of the Vermilion Emperor of the South, the Seven Qi Lords of the White Emperor of the West, the Five Qi Lords of the Black Emperor of the North, the One Qi Lord of the Yellow Emperor of the Center, the Perfected of the Five Emperors, the jade lads and jade maidens, to descend upon the ritual platform.\n\nWe respectfully invite the descent of the Lords of the Three Origins—Heavenly Official of the Upper Origin, Earthly Official of the Middle Origin, Water Official of the Lower Origin—the Nine Bureaus of the Three Palaces, the One Hundred Twenty Offices, the great spirits of the Five Peaks, the Ten Great Grotto-Heavens, the Thirty-Six Grotto-Heavens, the Twenty-Four Transformations, the Three Rivers and Four Seas, the Nine River Water Emperors, the Twelve River Sources, the Perfected of the Nine Palaces, the Twelve Immortal Lords, the Directors of Destiny of the Nine Heavens, the Venerable Ones of the Five Peaks, the Envoys of the Nine Heavens, the auxiliary and principal deities who assist the Mandate, the heavenly, earthly, and flying transcendents and divine immortals, the jade lads and jade maidens, the mounted troops and cavalry, to descend upon the ritual platform.\n\nWe respectfully invite the descent of the Perfected Officials who attend the Three Caverns and Four Supplements, the Lords and Earls of the Immortals, the Ministers and Grand Masters of the Immortals, the Censors of the Nine Heavens, the Great Dharma Masters of the Mystic Center, the Celestial Masters, their successors and lineage masters, the Three Ancient Masters, the Scripture Masters, Register Masters, and Ordination Masters, the mighty spirits of the Three Caverns, the officials of the Three Treasures, to descend upon the ritual platform.\n\nWe respectfully invite the descent of the officials of the *Lingbao* tradition who oversee the transcendents and supervise the fast, the Perfected Officials of the Direct Talisman, the attendants and officers of incense, the jade lads and jade maidens, the divine generals of the Six Jia, the jade maidens of the sixty-day cycle, the jade maidens of the Six Ding, the officers of the altars of soil and grain, and all numinous administrators, to descend upon the ritual platform.\n\nWe respectfully invite the descent of the Twenty-Four Commanders of the Regulated Realms who bear the tally and supervise merit within our bodies, the Envoys of the Four Divisions who inspect merit, the Direct Envoys of the Upper Transcendents and Upper Spirits, the Merit Officers of the Orthodox Unity, the Three Divisions, the Urgent Qi, and the Three-Five, to descend upon the ritual platform.\n\nWe respectfully invite the descent of the officers within our bodies who govern the yin and yang talismans, the Scarlet Talisman Officers of the Celestial Chariot, the mounted couriers of the fierce winds, the couriers who present memorials, the flying dragon riders, the flying transcendents and divine riders, the envoys of the upper, middle, and capital divisions, the tiger-soldier inspectors and mounted officers who detect treachery, the Commandant of the Capital Division, the Celestial Ding warriors, the celestial armored soldiers, to descend upon the ritual platform.\n\nWe respectfully invite the descent of the officers who gather and consume qi, who gather and consume spirits, who gather and consume ghosts, who gather and consume evil, who gather and consume essences, who gather and consume poisons, who execute talismans and destroy shrines, to descend upon the ritual platform.\n\nWe respectfully invite the descent of the divine generals of the Emperor’s natal destiny, the divine generals of the original destiny, the stellar officials of the greater and lesser annual destinies, the courier officers of the yearly horse, to descend upon the ritual platform.\n\nWe respectfully invite the descent of the Four Controllers and Five Emperors, the responsive numinous spirits, the officials of the Three Realms who oversee the ritual, the guardian officers of the altar, the inspectors of the empty void, the officers of the direct day and direct talisman, the local administrators, to descend upon the ritual platform.\n\nWe respectfully invite the descent of the local earth gods and the Perfected Officials of the territorial domain, to descend upon the ritual platform.\n\nWe humbly invoke the Three August Ones of the Supreme Heavenly Thearch, the Heavenly Lords and Emperors of the Ten Directions, the Three Lights and Nine Radiances, the sagely hosts of the Three Realms within and without, and all numinous spirits.\n\nMay they universally descend with vast compassion, dividing their radiance to illuminate and witness. We, having inherited residual fortune from former lives, were born in this generation. We have presumptuously borne the sacred scriptures and received the teachings of the Mysteries. Our merits are lighter than dust and dew, our transgressions heavier than mountains and hills. Truly, we should restrain ourselves and cultivate rectitude, yet the Dharma permits us to open the path of transcendence, to assist the state and establish merit, to aid the Emperor and propagate the transformative power of the Dao.",
      "overlap_context": "torments, the eternal night is dispelled.\nGrudges dissolve, ascending to the various heavens.\nUpon completion of the ritual circumambulations, the tablet is cast into the numinous abyss.\nFortune and blessings flourish eternally, the imperial enterprise endures.\nWe beseech the dragon tablet to bind the covenant with the water officials.\nMay our petition be conveyed by the Golden Dragon Courier.\"\n\nUpon completion of the recitation, the assembled officials bow again.\n\nThen the Earth Tablet is read.",
      "start_char": 3732,
      "end_char": 5007,
      "start_sentence": 228,
      "end_sentence": 275,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.62711572647095,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\太上灵宝玉匮明真大斋言功仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "今钦奉皇帝圣旨，追荐某尊灵，赍金龙纹缯，香花质信。 恭依科典，虔立灵坛。 奉修灵宝九幽明真玉匮迁神拔度大斋，若干日夜。 以某日某时功圆事毕。 焚烧真文，解坛复职。 重明功德，设醮言功。 愿为某忏谢罪尤，解销冤对。 不经幽夜，升入天堂。 莹质朱陵，炼神丹霍。 上朝太极，飞步九清。 友万帝以优游，接群真而宴处。 延休帝业，贻贶孙谋。 传凤历於无疆，固鸿图於亿载。 同文共轨，地久天长。 疫毒潜宁，灾凶殄息。 兵戈不作，水旱无侵。 夷夏惧康，龙神翊卫。 中黄上府，陵寝常安。 十雨五风，生灵永泰。 伏冀三官拂简，纪录斋功。 五帝回轩，鉴临胜福。 告下天地曹府，幽明职司，降佑垂祥，普均四海。 臣等不任恳愿虔祈之至。 稽首再礼。 次焚状 奏献钱马 臣重启灵坛感降，内外真灵。 臣所修斋，功德成就。 实赖三宝官属，应感职司。 降此洪休，副兹丹恳。 启奏传送，劳历真官。 恐荐献失仪，违犯科典。 动静俯仰，不合天仪。 再具披陈，特乞原赦。 高真上圣，升驾太空。 三界尊灵，各还所部。 侍卫官吏，当境职司，未就座者，歆纳诚礼。 阴阳将吏，内外正神，佐国度人，立功利物。 驱除氛沴，扫荡妖凶。 使九土太平，帝王万寿。 三会之日，别当举迁。 诸狱冥曹，三徒六趣，九幽滞爽，万类孤魂，赖兹迁拔之缘，尽诣逍遥之境。 某等稽首，再礼奉辞。 次送神颂还戒颂都讲云，众官复职高功都讲列职，各纳职次十二愿次复炉 次引弟子，随师，升天门，出地户次解坛颂出户咒次辞三师 次回向礼毕 太上灵宝玉匮明真大斋言功仪竟",
      "translated_text": "Now, by the sacred decree of the Emperor, we reverently offer prayers for the exalted spirit of [Name], presenting gold-embroidered silks, incense, flowers, and ritual offerings. In strict accordance with the liturgical canons, we devoutly establish the sacred altar. We undertake the *Lingbao Jiuyou Mingzhen Yu Kui Qianshen Badu Grand Retreat*—a rite of ninefold darkness and radiant truth, the Jade Casket’s transference of souls—for [number] days and nights, culminating in perfection at [day] [hour].\n\nWe burn the true writs, dissolve the altar, and restore the spirits to their offices. The merit thus reilluminated, we perform the thanksgiving rite and proclaim the accomplishment. May this serve to repent and expiate [Name]’s transgressions, dissolve karmic entanglements, and release them from the dark nights of the underworld, ascending into the celestial halls. May their essence be refined in the Vermilion Mound, their spirit tempered in the Elixir of Cinnabar. May they ascend to the Great Ultimate, tread the Ninefold Purity, roam freely among the Ten Thousand Emperors, and feast in the company of the host of perfected beings. May they extend the blessings of imperial rule, bestow prosperity upon their descendants, transmit the phoenix lineage without end, and secure the grand design for myriad ages. May script and axle unite, earth endure, and heaven abide.\n\nMay pestilence and poison subside, calamities and misfortunes cease. May weapons fall silent, drought and flood be averted. May all within the four seas—barbarian and Hua alike—enjoy peace, and the dragon deities stand guard. May the imperial mausoleum remain eternally secure, the Central Yellow Upper Palace undisturbed. May timely rains and gentle winds prevail, and all living beings dwell in perpetual tranquility.\n\nWe humbly beseech the Three Officials to brush clean their registers and record the merit of this retreat. May the Five Emperors turn their chariots to witness this supreme blessing. We petition the celestial and terrestrial bureaus, the offices of the seen and unseen, to descend with protection and bestow auspiciousness, universally bestowing grace upon the four seas.\n\nWe, your servants, can scarcely express the depth of our earnest and reverent prayers. We bow twice in profound reverence.\n\nNext, we burn the memorial and present the paper money and horses.\n\nWe again invoke the sacred altar, beseeching the descent of the inner and outer perfected spirits. The merit of the retreat we have performed is now complete, owing truly to the Three Treasures and their divine retinues, the responsive officials of the unseen realms. They have descended with vast blessings, fulfilling our sincere entreaties. We now submit this report for transmission, honoring the labors of the perfected officials.\n\nWe fear that our offerings may have been improper, our conduct violating the liturgical canons, our movements and bearing failing to accord with celestial propriety. We humbly submit this further petition, imploring pardon.\n\nMay the exalted perfected and sagely beings ascend to the Great Void. May the honored spirits of the Three Realms return each to their respective domains. May the attending officers and local deities who have not yet taken their seats accept our sincere offerings.\n\nMay the martial and civil officials of the yin and yang realms, the inner and outer divine hosts, assist the state and deliver the people, establishing merit and benefiting all beings. May they dispel pestilential vapors and sweep away malevolent forces, ensuring the Nine Lands’ great peace and the Emperor’s ten-thousand-year reign. On the days of the Three Assemblies, may they be duly promoted.\n\nMay the underworld courts, the three paths and six destinies, the lingering souls of the Ninefold Darkness, and all categories of orphaned spirits, relying on this rite of transference, attain the realm of carefree wandering.\n\nWe, [Names], bow twice and take our leave.\n\nNext, the hymn of divine departure. The preceptor returns the precepts, and the cantor intones. The officials resume their offices; the high priest and cantor assume their ranks. Each returns to their station, and the Twelve Vows follow. The incense burner is restored.\n\nNext, the disciples are led by their master to ascend the Gate of Heaven and exit the Door of Earth. The altar-dissolution hymn is chanted, and the Earth Door spell is recited. The Three Masters are then respectfully dismissed.\n\nNext, the dedication of merit is completed, and the rites conclude.\n\nThus ends the *Taishang Lingbao Yu Kui Mingzhen Grand Retreat Rite for Proclaiming Merit*.",
      "overlap_context": " inherited residual fortune from former lives, were born in this generation. We have presumptuously borne the sacred scriptures and received the teachings of the Mysteries. Our merits are lighter than dust and dew, our transgressions heavier than mountains and hills. Truly, we should restrain ourselves and cultivate rectitude, yet the Dharma permits us to open the path of transcendence, to assist the state and establish merit, to aid the Emperor and propagate the transformative power of the Dao.",
      "start_char": 5007,
      "end_char": 5622,
      "start_sentence": 276,
      "end_sentence": 322,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.359620094299316,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\太上灵宝玉匮明真大斋言功仪.txt",
        "category": "威仪类"
      }
    }
  ]
}