{
  "source_id": "太上洞玄灵宝素灵真符",
  "source_file": "chunked_daozang\\太上洞玄灵宝素灵真符.json",
  "total_chunks": 4,
  "total_original_chars": 4092,
  "total_translated_chars": 22770,
  "total_translation_time": 108.90706729888916,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\神符类\\太上洞玄灵宝素灵真符.txt",
    "category": "神符类"
  },
  "full_translation": "**The Primordial Numinous Treasure of Simplicity and Spirit True Talismans**\n\n**Title:** *The Primordial Numinous Treasure of Simplicity and Spirit True Talismans*\n**Original Author:** Lu Xiujing of the Liu-Song Dynasty\n**Volume:** Three\n**Source Text:** *Daoist Canon of the Orthodox Unity*, Numinous Treasure Section, Divine Talismans Category\n\n---\n\n### **Preface to *The Primordial Numinous Treasure of Simplicity and Spirit True Talismans***\n\nThe *Talismans of Simplicity and Spirit* were transmitted by the Heavenly Master, Master Zhai. During the *Qianyu* and *Qianyuan* reigns, he journeyed from Yellow Crane Mountain, drifting into Shu until he reached the Wu Gorge. There, he lingered among the forests and springs, traversing peaks and valleys for over a year. Southward, he reached Qingjiang; northward, Shangyong—roaming over a thousand *li*, visiting sacred ruins and numinous traces, cliffs, grottoes, and caverns without exception.\n\nOne evening, he dreamed of a perfected one, over a *zhang* in height, clad in plain robes and an ornate cap, standing atop a towering cliff. Gazing down, the figure seemed to issue a command. The next day, the Master ascended the Peak of the Heavenly Worthy, bowing in reverence—and there stood the perfected one. Suddenly, from the Heavenly Worthy’s hand, he received a scroll of cinnabar script. Bowing, he accepted it: the *Talismans of Simplicity and Spirit*.\n\nWhen applied, these talismans healed ailments, subdued demons, commanded spirits, revived the dead, summoned wind and rain, and tamed tigers and wolves. The people of the Three Gorges greatly benefited. During the *Tianbao* era, the Master was summoned to the inner palace, where he discoursed on the Dao with the wind. Later, he returned to the Mountain of the Immortals’ Capital.\n\nThereafter, Duan Chengshi of Pingchang, along with scholars and generals of Jing and Ying, all became his disciples, studying for years before attaining the Dao and departing. Those who receive these talismans must transmit them to save others, for their efficacy is certain.\n\nIn the *Tianfu* *bingyin* year, I requested the scripture from Pingdu Mountain and obtained its original text, compiling it into the *Three Caverns Canon*, hoping that future kindred spirits may share in the aspiration to aid all beings.\n\n**Preface by Du Guangting of Guangcheng**\n\n---\n\n### **The Primordial Numinous Treasure of Simplicity and Spirit True Talismans, Volume One**\n**By Master Lu**\n\n**1. Talisman for All Illnesses**\n**2. Talisman for Epidemic Pestilence**\n**3. Talisman for Cold Damage**\n**4. Talisman for Chills and Fever**\n**5. Talisman for Headaches**\n\nEach day, visualize the Five Numinous Spirits encircling your body and recite this incantation:\n\n*\"On my left, the Azure Dragon Mengzhang of Jia-yin;\nOn my right, the White Tiger Guardian of Jia-shen;\nAbove my head, the Vermilion Bird Lingguang of Jia-wu;\nBeneath my feet, the Dark Warrior Zhiming of Jia-zi;\nThe Noble Child of the Spleen enters the Central Palace of Jia-chen and Jia-xu.\"*\n\nRecite this invocation until memorized, without letting the sound pass your lips or be heard by others.\n\nWhen facing public or private disputes, the *qi* of war arising from the four directions, perilous battlefields, or entering foreign lands with unfamiliar climates and pestilence, recite it frequently at dawn and dusk.\n\nWhen attending wakes, approaching corpses, entering temples, or encountering places of fear, misfortune, or inauspicious homes, step with the *Yu* pace as you enter and recite it. Then the Six Jia spirits and Four Numinous Beasts will guard your body.\n\nThis is called the *Master Artisan Talisman*. First, hold your breath while inscribing it. Upon completion, knock your teeth thrice and recite:\n\n*\"The sun rises, yang and yang;\nI wield the divine talisman, commanding the four directions.\nWearing this talisman, all illnesses vanish, all evils perish.\nSwiftly, swiftly, as decreed by law!\"*\n\nAll talismans bear written characters, though most cannot decipher them. Those who can read talismanic script may summon myriad spirits, command a hundred ghosts, and achieve all things.\n\nHere, I elucidate the *Master Artisan Talisman* and its essentials. When encountering warfare, bandits, tigers, wolves, storms, or hearing wailing spirits, attending wakes, or witnessing defilement, compose your mind and recite the *Heavenly Emperor of Radiant Union* thrice daily—nothing will fail to be averted.\n\nTo interpret this talisman, read its five characters thrice, inscribing the talisman twice.\n\nWhen swallowing the Six Jia Talismans, avoid consuming the creature of the corresponding earthly branch: do not eat ox on *chou*, pig on *hai*, or rabbit on *mao*.\n\nThe Six Jia Reversion Talismans are taken for ten days per cycle, over six cycles—all Six Jia Talismans are consumed together.\n\n---\n\n**1. Talisman for All Illnesses (31 Talismans)**\nThe true talisman governs all ailments. Placed at the head of a bed, it revives those on the verge of death, restoring their *hun* and *po* to grant eternal longevity.\n\nInscribed in cinnabar and swallowed, it repels a hundred evils and a thousand spirits, proving its true efficacy. Take it for thirty-nine days on the left, thirty-two on the right.\n\n**2. Talisman for Epidemic Pestilence (88 Talismans)**\nOn *jia-zi* days, the Celestial Lord and all spirits pay homage to the Primordial Heavenly Worthy. The Heavenly Worthy asked why the people suffered endless deaths from epidemic *qi* and pestilence.\n\nThe Heavenly Worthy instructed the Celestial Lord and spirits: *\"When the *yin* essence reaches its peak, affix the Yellow Emperor’s talisman to the celestial gate, inscribing red characters upon the door. Let the afflicted drink the Six-Character Talisman, and they will sweat and survive.\"*\n\nThus, it was proclaimed for all to practice. At the first sign of pestilence, prepare peach-blossom decoction and consume this talisman to induce sweating. After a while, take one; if no sweat comes, take up to three. If still no sweat, take seven or nine—then sweat will come, and recovery will follow. If not, take the second talisman the next day, continuing in sequence. None will fail.\n\nInscribe it facing the kingly direction on a day of royal vigor. Long ago, Master Xuan obtained twelve divine talismans from a stone chamber. Wearing them, he ascended to the heavens. Those afflicted with pestilence may inscribe them in cinnabar on paper and consume one daily to remain free of illness.\n\nWang Qiao wore them and ascended in broad daylight. Chi Song wore them and transformed into an immortal. Lord Lao practiced them to govern all heavens.\n\nUpon completing the inscription, recite:\n*\"Nurtured by Heaven, formed by Earth;\nReceiving the divine talisman, one may attain longevity.\"*\n\nThe immortal aids the self, the jade maiden assists the form;\nThe twenty-eight constellations ascend to the celestial court.\nFive colors transform—black, white, red, and azure;\nThe Yellow Emperor of the center merges with the self.\nWhere the divine talisman acts, it subdues the myriad spirits;\nAll wickedness, evil, and malevolence vanish without trace.\n\nRecite the incantation for activating the talisman:\n*\"The Great Law declares: Today is jiazi, you serve as my direct envoy.\nI wish to deploy the talisman—you shall be my messenger.\nAdorned in crimson brocade, enter the Gate of Heaven directly.\nSwiftly, swiftly, as the statutes of the Lord Lao command!\"*\n\n**Talisman for Treating Cold Damage (Third)** – Eight talismans\n**Talisman for Treating Cold-Heat (Fourth)** – Thirty-two talismans\n**Talisman for Treating Headache (Fifth)** – Thirteen talismans\n\n*End of the Upper Scroll of the Supreme Cavern Mystery Numinous Treasure Plain Numinous True Talismans*\n*Middle Scroll of the Supreme Cavern Mystery Numinous Treasure Plain Numinous True Talismans*\n*Received by Master Lu*\n\n**For abdominal pain** – **For heart and abdominal pain**\n**For sudden attack by malign forces or corpse-infliction** – **For abdominal distension**\n**For heart and abdominal vexation** – **For lumbar pain** – **For back pain**\n*(All talismans in this scroll for abdominal pain are to be inscribed in cinnabar.)*\n\n**For heart and abdominal pain caused by the Heaven-Averting Ghost and Earth-Mastering Demon:**\nInscribe this talisman three times in ink on paper, burn it in saltwater, and consume the ashes—recovery is immediate.\n\n**For unbearable abdominal pain, intestinal distension, or qi on the verge of collapse (appearing like corpse-back syndrome):**\nInscribe in cinnabar upon the patient’s abdomen, filling it with large talismanic characters—extending the length of the abdomen enhances efficacy. Alternatively, burn and ingest.\n\n**Three talismans—the first of the Eldest Duke’s talismans—for sudden attack by malign forces, corpse-back syndrome, abdominal pain, or acute lockjaw:**\nInscribe in cinnabar on water, or on paper, and swallow three pills. If unresolved, inscribe three talismans below the heart and upon the abdomen in large characters—none fail to heal.\n\n**Two talismans for sudden encounter with malign visitors, ghost-stabbing heart pain, or qi pain:**\nInscribe in cinnabar on white paper. First ingest the upper talisman; if pain persists, then ingest the next. If still unresolved, inscribe again from the top. If the patient appears dead but the area below the heart remains warm and moving, ingestion revives them. For lockjaw, break the teeth to insert the talisman; once in the mouth, ensure it enters the abdomen. Alternatively, take a strong scallion leaf, cut a small opening, insert the talisman, and blow forcefully into the nose to propel it inward. If unsuccessful, use water to blow it in, shaking the head to aid its descent—immediate efficacy.\n\n**Seventeen talismans for heart qi pain:**\nInscribe in cinnabar on yellow silk and ingest—none fail to heal.\n\n**Eleven talismans for heart pain with vexation and disorder:**\nInscribe in cinnabar on yellow silk and ingest—immediate efficacy.\n\n**For sudden attack by malign forces (corpse-back syndrome):**\n**Four talismans for sudden malign attack, ghost-stabbing reversal, acute pain, vexation, and distension near death:**\nFirst ingest the first talisman; if unresolved, then the second, then the third. If the patient appears dead but the area below the heart remains warm, and the talisman does not take effect immediately, inscribe in ink on paper, form into pills, and ingest. For lockjaw, break the teeth to insert the talisman, or use a strong scallion leaf, cut a small opening, and insert through the nose to the throat. Use water to aid its descent, shaking the head to ensure it enters—immediate recovery. If unresolved, return to the first talisman and proceed to the second, continuing until healed.\n\n**Two talismans for sudden corpse-strike causing qi cessation and lockjaw:**\nInscribe the upper talisman in ink on paper and force it into the mouth. If unresponsive, ingest the lower talisman. If still unresponsive, ingest the upper talisman again—immediate recovery. Named the \"Break the Funeral Cart, Revive the Dead Talisman,\" inscribe on plain silk and apply to the afflicted area—greatly auspicious.\n\n**Two talismans for sudden malign stabbing pain with extreme vexation near death:**\nFirst ingest the upper talisman; if unresolved, then the lower. If the patient appears dead but the heart remains warm, ingest the talisman with a shake—immediate recovery. Inscribe in ink on paper and ingest. For lockjaw, break a tooth, insert the talisman into the throat, and use water to aid its descent—immediate efficacy.\n\n**Talisman for sudden malign attack near death:**\nIf already deceased, inscribe in cinnabar below the hairline and on both shoulders. Upon completing the talisman, use a cinnabar brush (unnoticed by others) to trace the talisman. Grasp the brush and rotate it four or five times for robust ghosts, three or four times for wrathful ghosts—none fail to heal. First, place the patient’s hands before the head and tightly bind the thumbs. Then, with the cinnabar brush, inscribe the talisman on the five centers, positioning the left side over the patient’s heart. Direct the brush toward the nose to draft the talisman, then inscribe it into the nose—counterclockwise for men, clockwise for women—completing before midnight or noon. Knock the head and state one’s name, beseeching departure. If unresponsive, compel self-declaration.\n\n**Seventeen talismans for heart qi pain:**\nInscribe in cinnabar on yellow silk and ingest—none fail to heal.\n\n**Eleven talismans for heart pain with vexation and disorder:**\nInscribe in cinnabar on yellow silk and ingest—immediate efficacy.\n\n**For sudden attack by malign forces (corpse-back syndrome):**\n**Four talismans for sudden malign attack, ghost-stabbing reversal, acute pain, vexation, and distension near death:**\nFirst ingest the first talisman; if unresolved, then the second, then the third. If the patient appears dead but the area below the heart remains warm, and the talisman does not take effect immediately, inscribe in ink on paper, form into pills, and ingest. For lockjaw, break the teeth to insert the talisman, or use a strong scallion leaf, cut a small opening, and insert through the nose to the throat. Use water to aid its descent, shaking the head to ensure it enters—immediate recovery. If unresolved, return to the first talisman and proceed to the second, continuing until healed. If still unresolved, proceed to the next.\n\n**Two talismans above, for treating sudden corpse-strike, qi cessation, and lockjaw:**\nInscribe the upper talisman in ink on paper and force it down the patient’s throat. If unresponsive, then ingest the lower talisman. If still unresponsive, ingest the upper talisman again—immediate recovery. Named the *Breaking the Funeral Cart, Reviving the Dead Talisman*; write it plainly and apply to the afflicted area—greatly auspicious.\n\n**Two talismans above, for treating sudden malign stabbing pain and extreme vexation near death:**\nFirst ingest the upper talisman; if unresolved after a moment, then the lower talisman. If the patient appears dead but the heart remains warm, ingest the *Shaking Talisman*—immediate recovery. Inscribe in ink on paper and swallow. If the patient’s mouth does not open, break a tooth to insert the talisman into the throat, then use water to aid its descent by shaking—immediate effect.\n\n**Upper talisman, for treating sudden malign attack near death:**\nIf already dead, write in cinnabar on the hairline and both shoulders, completing the talisman. With a cinnabar brush and water, without the patient’s awareness, grasp the brush. Circle the *robust ghosts* four or five times, the *wrathful ghosts* three or four times—none will remain unresolved. First place the patient’s hands before the head and tightly bind the thumbs with a cord. Then, with a cinnabar brush, inscribe the five centers as the talisman-master writes, placing the left side over the patient’s heart. Next, with the cinnabar brush, trace toward the nose to form the talisman, then insert the brush into the nostrils—turning left for men, right for women—no later than midnight or noon. Knock the head and state one’s name, begging departure. If unresponsive, press urgently and have the patient state their name—then the illness departs.\n\nThe Nine Upper Talismans cure *zhong’e* (sudden possession by malevolent spirits). Ingest them after inscribing, and the effect is immediate.\n\nThe Three Upper Talismans cure *shuanshi zhuwu* (corpse transmission and hostile spirits lodged in the five viscera). Inscribe them in cinnabar on yellow silk and swallow the first talisman. If the condition persists, ingest the subsequent ones—none will remain uncured.\n\nThe Upper Talisman cures sudden attacks by the Five Ghosts carving into the five viscera. Inscribe it in cinnabar and swallow the first talisman. If the condition persists, ingest the subsequent talismans—none will remain uncured.\n\n**Treats:**\nAbdominal distension\nHeart and abdominal vexation and agitation\nLumbar pain\nBack pain\n\n*Here ends the Middle Scroll of the Supreme Cavern Mystery Numinous Treasure’s Plain and Spirit-True Talismans.*\n*Here begins the Lower Scroll of the Supreme Cavern Mystery Numinous Treasure’s Plain and Spirit-True Talismans.*\n*Transmitted by Master Du*\n\n**Treats:**\nChest pain\nDysentery\nCholera\nObstruction of urine and stool\nStrangury\nYin heat and vexing heat\nDispels confusion\nOpens the heart and strengthens memory\nPacifies the hun and po souls\nDispels sorrow and longing\n\n**Treats:**\nMalaria\nProhibitive incantations\nChest pain\nDysentery\nCholera\nObstruction of urine and stool\n\nThe right talisman treats obstruction of urine and stool in children—inscribe it below the navel for immediate efficacy.\n\n**Treats:**\nStrangury\nYin heat and vexing heat\n\nThe right talisman treats heat diseases, nightmares, the hundred ghosts, and encounters with malevolent spirits while traveling at night—wear it for auspiciousness.\n\n**Dispels confusion**\nThe right talisman treats those afflicted by confusion. One should hold this talisman, kneel facing west, and bow in reverence—thus dispelling it. If unresolved, inscribe and wear it for great auspiciousness. If the condition persists, inscribe it in cinnabar on yellow silk and ingest it for immediate healing.\n\n**Opens the heart and strengthens memory**\nThe right talisman enables one to open the heart and attain the method of reverse knowing. On an auspicious day, inscribe fifty talismans and ingest one daily, twice a day, for fifty days. When the talismans are exhausted, begin anew. After one hundred days to a year, the heart opens, and one will not forget what is read, daily retaining three thousand words. Prolonged ingestion leads to ascension to heaven.\n\n**Pacifies the hun and po souls**\nThe right talisman treats the unsettled hun and po souls of the sick. In cases of sudden *zhong’e*, ingest it, and the hun and po souls will immediately return—greatly auspicious.\n\n**Dispels sorrow and longing**\nThe right talisman treats sorrow, longing, melancholy, abdominal discomfort, weeping, and madness. Inscribe it in cinnabar on yellow silk and ingest it. Also inscribe it over the heart twice, and write it on a five-inch piece of crimson silk to bind on the left arm—then lie on one’s side. Follow this method for auspicious healing.\n\n**Treats malaria**\nThe right talisman governs the twelve-hour malaria ghosts—inscribe and wear it for immediate healing. Ascend a high mountain, gaze upon cold waters, and command the tigers and wolves to capture the malaria ghosts: *\"Why do you not swiftly depart? My household has wealth and nobility!\"* **Haste, haste, in accordance with the statutes and ordinances!**\n\nAgain: Ascend a high mountain, gaze upon cold waters, and dispatch tigers and wolves to capture the malaria ghosts: *\"Come at dawn, die by dusk—if captured, you shall not be spared, and the same punishment applies!\"* **Haste, haste, in accordance with the statutes and ordinances!**\n\nAscend a high mountain, gaze upon cold waters, and command the tigers and wolves to capture the malaria ghosts: *\"Drink your blood—why do you not swiftly depart? My household has noble guests!\"* The character is *Poshi* (Breaking Stone), its head like the Western Mountains, its body like the Eastern Marsh. It does not consume the five grains but feeds only on malaria ghosts—three thousand at dawn, eight hundred at dusk. If even one ghost remains, it will demand more. **Haste, haste, in accordance with the statutes and ordinances!**\n\nThe two right talismans should be inscribed and placed before the heart. Ascend a high mountain, gaze upon the sea, and order the tigers and wolves to capture the malaria ghosts: *\"Why do you not swiftly depart? My household has noble guests!\"* The character is named *Poshi* (Breaking Stone), its head like the Western Mountains, its body like the Eastern Marsh. It does not consume the five grains but feeds only on malaria ghosts—three thousand at dawn, eight hundred at dusk. If you are insufficient, come now for more. **Haste, haste, in accordance with the statutes and ordinances!**\n\nThe seven right talismans—those afflicted with malaria should inscribe and ingest them as above for immediate healing. This is a secret of inestimable value, never before transmitted.\n\n**Prohibitive incantations**\nAscend a high mountain, gaze upon cold waters, and dispatch tigers and wolves to capture the malaria ghosts: *\"Three thousand at dawn, eight hundred at dusk. If even one ghost does not depart, its name shall be transferred to the River Earl. If still unsatisfied, hasten to demand more!\"* **Haste, haste, in accordance with the newly issued statutes and ordinances of the Venerable Lord!**\n\nThe right mandate commands the capture of malaria ghosts—wherever the illness is found, the incantation and talisman are applied alike. The Heavenly Emperor’s emissaries capture the malaria ghosts and kill them without inquiry. **Haste, haste, in accordance with the statutes and ordinances!**\n\nThe right mandate for treating malaria with talismanic texts: The officials to the left and right of my body, the emissaries, must not err or interfere—each governs the spirits of their respective directions. Yet the malaria ghosts have violated their mother, and the four sons, without cause, entered the garden where fire burned them to death, transforming them into malaria ghosts. I am the emissary of the Supreme, and I know your names and origins—why do you not swiftly flee? Now I pursue and kill you with water and fire. **Haste, haste, in accordance with the statutes and ordinances!**\n\n**Malaria Petition**\nRespectfully stated: I, so-and-so, a mortal born of flesh, descendant of the hundred officials and children of the Dao, have been fortunate for a thousand generations to serve the pure transformation and be upheld by the Dao’s qi, ever receiving grace and fulfilling my wishes. Yet as a mortal, my conduct has often transgressed, incurring karmic retribution. In such-and-such a year, at such-and-such an age, on such-and-such a month and day, I suddenly contracted malaria, which has recurred daily, causing headaches, brain pain, chills, fever, gasping breaths, and inability to eat or drink. On the day of onset, my breath nearly ceased, and the condition worsened, filling me with great fear and leaving me without recourse. I hasten to you, seeking your salvation. Overwhelmed by this mortal’s affliction with malaria, I can only prostrate myself in pity. Respectfully, I bow to the ground before the Supreme Lords, the Venerable Masters, the Lady, and the officials of the Five Qi Lords...\n\n*Here ends the Lower Scroll of the Supreme Cavern Mystery Numinous Treasure’s Plain and Spirit-True Talismans.*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上洞玄灵宝素灵真符 经名：太上洞玄灵宝素灵真符。 原题刘宋陆修静撰。 三卷。 底本出处：《正统道藏》洞玄部神符类。 太上洞玄灵宝素灵真符序 素灵符者，天师翟君，乾佑乾元中，自黄鹤山诉流入蜀，至巫山峡，耽玩林泉，周历峰岫，踌蹰岁余，南至清江，北及上庸，周旋千余里，神墟灵迹，岩扃洞室，靡不临眺。 一夕，梦真人长丈余，素衣华冠，立於层崖之上，俯而视之，若有所命。 君翌日登天尊峰，瞻仰礼谒，果见真人也。 俄於天尊手中得丹书一轴，拜而受之，即素灵符也。 按而书用，镯愈疗疾，征魔制灵，驱役鬼神，回尸起死，召置风雨，鞭策虎狼，三峡之人，大享其惠。 天宝中，诏入内殿，顺风问道，复还仙都山。 其后，平昌段成式，与当时朝彦荆郢帅臣，咸师奉之，累年乃得道而去。 有得此符者，传以赦人，用之必验。 余天复丙寅岁，请经於平都山，复得其本，编入三洞藏中，冀将来同好，共知济物之志焉。 广成杜光庭序。 太上洞玄灵宝素灵真符卷上 陆先生 百病符第一　殟疫符第二 伤寒符第三　寒热符第四 头痛符第五 凡每日存五灵，周雨己身之上，常念此咒曰：某左青龙孟章甲寅，右白虎监兵甲申，头上朱雀陵光甲午，足下玄武执明甲子，脾为贵子入中宫甲辰甲戌。 此祝常诵，令熟，勿令声出唇，勿令傍人闻。 若公私口舌，四方兴兵之气，军阵险厄之处，及入他邦异国，未习水土，天时疫疠，晨昏，数数存诵之。 若吊丧临尸，入诸祠庙，及恐惧之处，凶祸之家，入其门禹步诵之，则六甲之神、四灵，卫己身也。 此名都匠符，皆先闭气作之，符成，三叩齿，咒曰：日出阳阳，某行神符，威制四方。 某带服神符，百病除愈，万恶消亡。 急急如律令。 凡一切符文，皆有文字，但人不解识之。 若解读符字者，可以录召万灵，役使百鬼，无所不通也。 今且解注都匠符，符之要旨。 若遇灾兵之间，盗贼虎狼风波之内，及惊恐恶梦闻招魂之声，吊丧临尸见诸污秽，皆正心诵合明天帝，日三过，无不禳之也。 右解此符，五字读之三过，唯作符再重而已。 若吞六甲符，勿食所直之辰； 丑不食牛，亥不食猜，卯不食兔是也。 六甲回符，六旬旬十日服，六甲符皆并服之也。 理百病符第一　三十一道 真符，主治百病，着林头，连年欲死者，能度命还魂返魄，永更长生。 朱书，吞之辟百邪千精道有真效验，不虚也。 左日三十九日，右日三十二。 理殟病第二　八十八道 天公常以甲子日，见诸神朝元始天尊，天尊问天下人民，常苦殟病疫毒之气，而致死亡枉横非一。 天尊告天公诸神曰：寅芒至大疫剧合家作黄帝到天门，赤字着门户上，病者饮六字符，立汗出，可得不死耳。 故告之，使世人行之。 初觉似殟病，便作桃汤，服此符，令汗出。 良久，进一枚止於三枚，不汗； 至七枚、九枚，即得汗； 便轻愈，不差者。 第二日，服第二符，相次吞服，无不效者。 书当向王方，王相日书之。 昔玄子得石室中神符十二枚，佩之，与天相极。 世人有疫病者，丹书纸上，日服一道，可以无病。 王乔佩之，白日升天。 赤松佩之，变化神仙。 老君行之，统摄诸天。 书讫祝曰： 天之所育，地之所成； 上受神符，可以长生。",
      "translated_text": "**The Primordial Numinous Treasure of Simplicity and Spirit True Talismans**\n\n**Title:** *The Primordial Numinous Treasure of Simplicity and Spirit True Talismans*\n**Original Author:** Lu Xiujing of the Liu-Song Dynasty\n**Volume:** Three\n**Source Text:** *Daoist Canon of the Orthodox Unity*, Numinous Treasure Section, Divine Talismans Category\n\n---\n\n### **Preface to *The Primordial Numinous Treasure of Simplicity and Spirit True Talismans***\n\nThe *Talismans of Simplicity and Spirit* were transmitted by the Heavenly Master, Master Zhai. During the *Qianyu* and *Qianyuan* reigns, he journeyed from Yellow Crane Mountain, drifting into Shu until he reached the Wu Gorge. There, he lingered among the forests and springs, traversing peaks and valleys for over a year. Southward, he reached Qingjiang; northward, Shangyong—roaming over a thousand *li*, visiting sacred ruins and numinous traces, cliffs, grottoes, and caverns without exception.\n\nOne evening, he dreamed of a perfected one, over a *zhang* in height, clad in plain robes and an ornate cap, standing atop a towering cliff. Gazing down, the figure seemed to issue a command. The next day, the Master ascended the Peak of the Heavenly Worthy, bowing in reverence—and there stood the perfected one. Suddenly, from the Heavenly Worthy’s hand, he received a scroll of cinnabar script. Bowing, he accepted it: the *Talismans of Simplicity and Spirit*.\n\nWhen applied, these talismans healed ailments, subdued demons, commanded spirits, revived the dead, summoned wind and rain, and tamed tigers and wolves. The people of the Three Gorges greatly benefited. During the *Tianbao* era, the Master was summoned to the inner palace, where he discoursed on the Dao with the wind. Later, he returned to the Mountain of the Immortals’ Capital.\n\nThereafter, Duan Chengshi of Pingchang, along with scholars and generals of Jing and Ying, all became his disciples, studying for years before attaining the Dao and departing. Those who receive these talismans must transmit them to save others, for their efficacy is certain.\n\nIn the *Tianfu* *bingyin* year, I requested the scripture from Pingdu Mountain and obtained its original text, compiling it into the *Three Caverns Canon*, hoping that future kindred spirits may share in the aspiration to aid all beings.\n\n**Preface by Du Guangting of Guangcheng**\n\n---\n\n### **The Primordial Numinous Treasure of Simplicity and Spirit True Talismans, Volume One**\n**By Master Lu**\n\n**1. Talisman for All Illnesses**\n**2. Talisman for Epidemic Pestilence**\n**3. Talisman for Cold Damage**\n**4. Talisman for Chills and Fever**\n**5. Talisman for Headaches**\n\nEach day, visualize the Five Numinous Spirits encircling your body and recite this incantation:\n\n*\"On my left, the Azure Dragon Mengzhang of Jia-yin;\nOn my right, the White Tiger Guardian of Jia-shen;\nAbove my head, the Vermilion Bird Lingguang of Jia-wu;\nBeneath my feet, the Dark Warrior Zhiming of Jia-zi;\nThe Noble Child of the Spleen enters the Central Palace of Jia-chen and Jia-xu.\"*\n\nRecite this invocation until memorized, without letting the sound pass your lips or be heard by others.\n\nWhen facing public or private disputes, the *qi* of war arising from the four directions, perilous battlefields, or entering foreign lands with unfamiliar climates and pestilence, recite it frequently at dawn and dusk.\n\nWhen attending wakes, approaching corpses, entering temples, or encountering places of fear, misfortune, or inauspicious homes, step with the *Yu* pace as you enter and recite it. Then the Six Jia spirits and Four Numinous Beasts will guard your body.\n\nThis is called the *Master Artisan Talisman*. First, hold your breath while inscribing it. Upon completion, knock your teeth thrice and recite:\n\n*\"The sun rises, yang and yang;\nI wield the divine talisman, commanding the four directions.\nWearing this talisman, all illnesses vanish, all evils perish.\nSwiftly, swiftly, as decreed by law!\"*\n\nAll talismans bear written characters, though most cannot decipher them. Those who can read talismanic script may summon myriad spirits, command a hundred ghosts, and achieve all things.\n\nHere, I elucidate the *Master Artisan Talisman* and its essentials. When encountering warfare, bandits, tigers, wolves, storms, or hearing wailing spirits, attending wakes, or witnessing defilement, compose your mind and recite the *Heavenly Emperor of Radiant Union* thrice daily—nothing will fail to be averted.\n\nTo interpret this talisman, read its five characters thrice, inscribing the talisman twice.\n\nWhen swallowing the Six Jia Talismans, avoid consuming the creature of the corresponding earthly branch: do not eat ox on *chou*, pig on *hai*, or rabbit on *mao*.\n\nThe Six Jia Reversion Talismans are taken for ten days per cycle, over six cycles—all Six Jia Talismans are consumed together.\n\n---\n\n**1. Talisman for All Illnesses (31 Talismans)**\nThe true talisman governs all ailments. Placed at the head of a bed, it revives those on the verge of death, restoring their *hun* and *po* to grant eternal longevity.\n\nInscribed in cinnabar and swallowed, it repels a hundred evils and a thousand spirits, proving its true efficacy. Take it for thirty-nine days on the left, thirty-two on the right.\n\n**2. Talisman for Epidemic Pestilence (88 Talismans)**\nOn *jia-zi* days, the Celestial Lord and all spirits pay homage to the Primordial Heavenly Worthy. The Heavenly Worthy asked why the people suffered endless deaths from epidemic *qi* and pestilence.\n\nThe Heavenly Worthy instructed the Celestial Lord and spirits: *\"When the *yin* essence reaches its peak, affix the Yellow Emperor’s talisman to the celestial gate, inscribing red characters upon the door. Let the afflicted drink the Six-Character Talisman, and they will sweat and survive.\"*\n\nThus, it was proclaimed for all to practice. At the first sign of pestilence, prepare peach-blossom decoction and consume this talisman to induce sweating. After a while, take one; if no sweat comes, take up to three. If still no sweat, take seven or nine—then sweat will come, and recovery will follow. If not, take the second talisman the next day, continuing in sequence. None will fail.\n\nInscribe it facing the kingly direction on a day of royal vigor. Long ago, Master Xuan obtained twelve divine talismans from a stone chamber. Wearing them, he ascended to the heavens. Those afflicted with pestilence may inscribe them in cinnabar on paper and consume one daily to remain free of illness.\n\nWang Qiao wore them and ascended in broad daylight. Chi Song wore them and transformed into an immortal. Lord Lao practiced them to govern all heavens.\n\nUpon completing the inscription, recite:\n*\"Nurtured by Heaven, formed by Earth;\nReceiving the divine talisman, one may attain longevity.\"*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1260,
      "start_sentence": 0,
      "end_sentence": 57,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.85437345504761,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\神符类\\太上洞玄灵宝素灵真符.txt",
        "category": "神符类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "仙人辅己，玉女佐形； 二十八宿，上升天庭。 五色变化，黑白赤青； 中央黄帝，与己合并。 神符所行，以制万灵； 奸邪凶恶，一切灭形。 行符咒曰： 大法云：今日甲子，君为直使，吾欲行符，君为驱使。 头着绛绣，径入天门。 一急急如老君律令。 理伤寒符第三　八道 理寒热符第四　三十二道 理头痛符第五　十三道 太上洞玄灵宝素灵真符卷上竟 太上洞玄灵宝素灵真符卷中 陆先生受 治腹痛　　治心腹痛 治卒中恶闩尸 治腹胀　　治心腹烦懑 治腰痛　　治背痛 治腹痛卷内符并朱书 治心腹痛天辟鬼地主成 上符治感五鬼伤心不得气息墨纸写此符三道於盐汤中烧灰服之立差。 上符治腹痛、肠胀、气欲绝者。 如背尸状，丹书於病人腹上，大书符满，腹长竟腹，益佳。 或烧吞，亦可。 上符三道，长公子初符也，治卒中恶、背尸、腹痛、急噤，丹书水中，及书纸上，三丸吞之。 不愈，作三道於心下，及腹大书之，无不愈也。 上二符，治卒逢恶客、鬼刺心痛、气疼，以白纸丹书之，先服上符，须臾不止，即服下次者。 如不止，更书从上起。 病人已死，而心下温而动者，服皆活。 噤不开者，当折齿纳符，符入口，而已毕，必入腹。 亦可断葱叶中多涕者，纳符叶中，纳鼻极吹，令探入。 不然，复以水吹送之，摇头复吹之令入，也立验。 上符十七道，治心气疼痛，以黄素丹书，吞之无不愈也。 上符十一道，治心痛烦乱，以黄素朱书，服之立效。 治卒中恶背 上四符，卒中恶杵，遇鬼刺复，急痛烦滞，但胀欲死。 先吞第一符，须臾不差，次吞第二，次吞第三。 如某人已死，心下尚温，符不即治，以墨书纸丸，吞之。 病人口噤者，摧折齿纳符，亦可以葱叶强者截小头，从鼻孔中纳之至咽，以水送，摇头令得下，便愈。 若不愈，从第一符，更以第二符，服之，取愈乃止。 如其不差，更取其次服之。 上符二道，治人卒被尸击，气绝口闭。 以纸墨书上符，拗口吞之下。 不苏者，次吞下符。 如不苏，吞上符即愈。 名之破丧车起死人符，素书致痛处，大吉。 上符二道，治人卒恶刺痛，大烦欲死。 先服上符，须臾不差，次服下符。 若其人已死，心尚温，吞摇符下，即愈。 以墨纸书，吞。 病人不开口，啄一齿折，纳符，着病人喉中，以水次摇送之，即令下，立效。 上符，治卒中恶欲死。 若已死，朱书发下及两肩，作符讫，以水朱笔，勿令人觉，以手捉朱笔。 健鬼四五转，怒鬼三四转，无有不差。 且先以病人两手着头前，以绳急缚大拇指，然后以朱笔题五心作符师书之，以左边居病人心上，又朱笔向鼻拟作符，便朱笔书纳鼻中，男左转女右转，不过子午，便叩头自说姓字乞去。 未复急持，当自说， 上符十七道，治心气疼痛，以黄素丹书，吞之无不愈也。 上符十一道，治心痛烦乱，以黄素朱书，服之立效。 治卒中恶背 上四符，卒中恶杵，遇鬼刺复，急痛烦滞，但胀欲死。 先吞第一符，须臾不差，次吞第二，次吞第三。 如某人已死，心下尚温，符不即治，以墨书纸丸，吞之。 病人口噤者，摧折齿纳符，亦可以葱叶强者截小头，从鼻孔中纳之至咽，以水送，摇头令得下，便愈。 若不愈，从第一符，更以第二符，服之，取愈乃止。 如其不差，更取其次服之。",
      "translated_text": "The immortal aids the self, the jade maiden assists the form;\nThe twenty-eight constellations ascend to the celestial court.\nFive colors transform—black, white, red, and azure;\nThe Yellow Emperor of the center merges with the self.\nWhere the divine talisman acts, it subdues the myriad spirits;\nAll wickedness, evil, and malevolence vanish without trace.\n\nRecite the incantation for activating the talisman:\n*\"The Great Law declares: Today is jiazi, you serve as my direct envoy.\nI wish to deploy the talisman—you shall be my messenger.\nAdorned in crimson brocade, enter the Gate of Heaven directly.\nSwiftly, swiftly, as the statutes of the Lord Lao command!\"*\n\n**Talisman for Treating Cold Damage (Third)** – Eight talismans\n**Talisman for Treating Cold-Heat (Fourth)** – Thirty-two talismans\n**Talisman for Treating Headache (Fifth)** – Thirteen talismans\n\n*End of the Upper Scroll of the Supreme Cavern Mystery Numinous Treasure Plain Numinous True Talismans*\n*Middle Scroll of the Supreme Cavern Mystery Numinous Treasure Plain Numinous True Talismans*\n*Received by Master Lu*\n\n**For abdominal pain** – **For heart and abdominal pain**\n**For sudden attack by malign forces or corpse-infliction** – **For abdominal distension**\n**For heart and abdominal vexation** – **For lumbar pain** – **For back pain**\n*(All talismans in this scroll for abdominal pain are to be inscribed in cinnabar.)*\n\n**For heart and abdominal pain caused by the Heaven-Averting Ghost and Earth-Mastering Demon:**\nInscribe this talisman three times in ink on paper, burn it in saltwater, and consume the ashes—recovery is immediate.\n\n**For unbearable abdominal pain, intestinal distension, or qi on the verge of collapse (appearing like corpse-back syndrome):**\nInscribe in cinnabar upon the patient’s abdomen, filling it with large talismanic characters—extending the length of the abdomen enhances efficacy. Alternatively, burn and ingest.\n\n**Three talismans—the first of the Eldest Duke’s talismans—for sudden attack by malign forces, corpse-back syndrome, abdominal pain, or acute lockjaw:**\nInscribe in cinnabar on water, or on paper, and swallow three pills. If unresolved, inscribe three talismans below the heart and upon the abdomen in large characters—none fail to heal.\n\n**Two talismans for sudden encounter with malign visitors, ghost-stabbing heart pain, or qi pain:**\nInscribe in cinnabar on white paper. First ingest the upper talisman; if pain persists, then ingest the next. If still unresolved, inscribe again from the top. If the patient appears dead but the area below the heart remains warm and moving, ingestion revives them. For lockjaw, break the teeth to insert the talisman; once in the mouth, ensure it enters the abdomen. Alternatively, take a strong scallion leaf, cut a small opening, insert the talisman, and blow forcefully into the nose to propel it inward. If unsuccessful, use water to blow it in, shaking the head to aid its descent—immediate efficacy.\n\n**Seventeen talismans for heart qi pain:**\nInscribe in cinnabar on yellow silk and ingest—none fail to heal.\n\n**Eleven talismans for heart pain with vexation and disorder:**\nInscribe in cinnabar on yellow silk and ingest—immediate efficacy.\n\n**For sudden attack by malign forces (corpse-back syndrome):**\n**Four talismans for sudden malign attack, ghost-stabbing reversal, acute pain, vexation, and distension near death:**\nFirst ingest the first talisman; if unresolved, then the second, then the third. If the patient appears dead but the area below the heart remains warm, and the talisman does not take effect immediately, inscribe in ink on paper, form into pills, and ingest. For lockjaw, break the teeth to insert the talisman, or use a strong scallion leaf, cut a small opening, and insert through the nose to the throat. Use water to aid its descent, shaking the head to ensure it enters—immediate recovery. If unresolved, return to the first talisman and proceed to the second, continuing until healed.\n\n**Two talismans for sudden corpse-strike causing qi cessation and lockjaw:**\nInscribe the upper talisman in ink on paper and force it into the mouth. If unresponsive, ingest the lower talisman. If still unresponsive, ingest the upper talisman again—immediate recovery. Named the \"Break the Funeral Cart, Revive the Dead Talisman,\" inscribe on plain silk and apply to the afflicted area—greatly auspicious.\n\n**Two talismans for sudden malign stabbing pain with extreme vexation near death:**\nFirst ingest the upper talisman; if unresolved, then the lower. If the patient appears dead but the heart remains warm, ingest the talisman with a shake—immediate recovery. Inscribe in ink on paper and ingest. For lockjaw, break a tooth, insert the talisman into the throat, and use water to aid its descent—immediate efficacy.\n\n**Talisman for sudden malign attack near death:**\nIf already deceased, inscribe in cinnabar below the hairline and on both shoulders. Upon completing the talisman, use a cinnabar brush (unnoticed by others) to trace the talisman. Grasp the brush and rotate it four or five times for robust ghosts, three or four times for wrathful ghosts—none fail to heal. First, place the patient’s hands before the head and tightly bind the thumbs. Then, with the cinnabar brush, inscribe the talisman on the five centers, positioning the left side over the patient’s heart. Direct the brush toward the nose to draft the talisman, then inscribe it into the nose—counterclockwise for men, clockwise for women—completing before midnight or noon. Knock the head and state one’s name, beseeching departure. If unresponsive, compel self-declaration.\n\n**Seventeen talismans for heart qi pain:**\nInscribe in cinnabar on yellow silk and ingest—none fail to heal.\n\n**Eleven talismans for heart pain with vexation and disorder:**\nInscribe in cinnabar on yellow silk and ingest—immediate efficacy.\n\n**For sudden attack by malign forces (corpse-back syndrome):**\n**Four talismans for sudden malign attack, ghost-stabbing reversal, acute pain, vexation, and distension near death:**\nFirst ingest the first talisman; if unresolved, then the second, then the third. If the patient appears dead but the area below the heart remains warm, and the talisman does not take effect immediately, inscribe in ink on paper, form into pills, and ingest. For lockjaw, break the teeth to insert the talisman, or use a strong scallion leaf, cut a small opening, and insert through the nose to the throat. Use water to aid its descent, shaking the head to ensure it enters—immediate recovery. If unresolved, return to the first talisman and proceed to the second, continuing until healed. If still unresolved, proceed to the next.",
      "overlap_context": "twelve divine talismans from a stone chamber. Wearing them, he ascended to the heavens. Those afflicted with pestilence may inscribe them in cinnabar on paper and consume one daily to remain free of illness.\n\nWang Qiao wore them and ascended in broad daylight. Chi Song wore them and transformed into an immortal. Lord Lao practiced them to govern all heavens.\n\nUpon completing the inscription, recite:\n*\"Nurtured by Heaven, formed by Earth;\nReceiving the divine talisman, one may attain longevity.\"*",
      "start_char": 1260,
      "end_char": 2556,
      "start_sentence": 58,
      "end_sentence": 124,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.69242835044861,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\神符类\\太上洞玄灵宝素灵真符.txt",
        "category": "神符类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "上符二道，治人卒被尸击，气绝口闭。 以纸墨书上符，拗口吞之下。 不苏者，次吞下符。 如不苏，吞上符即愈。 名之破丧车起死人符，素书致痛处，大吉。 上符二道，治人卒恶刺痛，大烦欲死。 先服上符，须臾不差，次服下符。 若其人已死，心尚温，吞摇符下，即愈。 以墨纸书，吞。 病人不开口，啄一齿折，纳符，着病人喉中，以水次摇送之，即令下，立效。 上符，治卒中恶欲死。 若已死，朱书发下及两肩，作符讫，以水朱笔，勿令人觉，以手捉朱笔。 健鬼四五转，怒鬼三四转，无有不差。 且先以病人两手着头前，以绳急缚大拇指，然后以朱笔题五心作符师书之，以左边居病人心上，又朱笔向鼻拟作符，便朱笔书纳鼻中，男左转女右转，不过子午，便叩头自说姓字乞去。 未复急持，当自说， 便去病矣。",
      "translated_text": "**Two talismans above, for treating sudden corpse-strike, qi cessation, and lockjaw:**\nInscribe the upper talisman in ink on paper and force it down the patient’s throat. If unresponsive, then ingest the lower talisman. If still unresponsive, ingest the upper talisman again—immediate recovery. Named the *Breaking the Funeral Cart, Reviving the Dead Talisman*; write it plainly and apply to the afflicted area—greatly auspicious.\n\n**Two talismans above, for treating sudden malign stabbing pain and extreme vexation near death:**\nFirst ingest the upper talisman; if unresolved after a moment, then the lower talisman. If the patient appears dead but the heart remains warm, ingest the *Shaking Talisman*—immediate recovery. Inscribe in ink on paper and swallow. If the patient’s mouth does not open, break a tooth to insert the talisman into the throat, then use water to aid its descent by shaking—immediate effect.\n\n**Upper talisman, for treating sudden malign attack near death:**\nIf already dead, write in cinnabar on the hairline and both shoulders, completing the talisman. With a cinnabar brush and water, without the patient’s awareness, grasp the brush. Circle the *robust ghosts* four or five times, the *wrathful ghosts* three or four times—none will remain unresolved. First place the patient’s hands before the head and tightly bind the thumbs with a cord. Then, with a cinnabar brush, inscribe the five centers as the talisman-master writes, placing the left side over the patient’s heart. Next, with the cinnabar brush, trace toward the nose to form the talisman, then insert the brush into the nostrils—turning left for men, right for women—no later than midnight or noon. Knock the head and state one’s name, begging departure. If unresponsive, press urgently and have the patient state their name—then the illness departs.",
      "overlap_context": "e heart remains warm, and the talisman does not take effect immediately, inscribe in ink on paper, form into pills, and ingest. For lockjaw, break the teeth to insert the talisman, or use a strong scallion leaf, cut a small opening, and insert through the nose to the throat. Use water to aid its descent, shaking the head to ensure it enters—immediate recovery. If unresolved, return to the first talisman and proceed to the second, continuing until healed. If still unresolved, proceed to the next.",
      "start_char": 2557,
      "end_char": 2881,
      "start_sentence": 125,
      "end_sentence": 140,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.054147005081177,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\神符类\\太上洞玄灵宝素灵真符.txt",
        "category": "神符类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "上符九道，治中恶。 书服之，立效。 上符三道，治闩尸注忤人腹五脏中。 以黄素朱书，吞第一符。 如不止，次吞已下，无有不愈者。 上符，治人卒作五鬼刻人服五脏中。 以朱书吞第一符。 如不止，吞已下符，无不愈。 治腹胀 治心腹烦濍 治腰痛 治背痛 太上洞玄灵宝素灵真符卷中竟 太上洞玄灵宝素灵真符卷下 杜先生受 治胸痛　　治下痢 治霍乱　　治大小便不通 治淋病　　治阴热及烦热 解迷惑　　开心强记 安魂魄　　解悲思 治疟疾　　治禁咒文 治胸痛 治下痢 治霍乱 治大小便不通 右符治小儿大小便不通书脐下立验。 治淋病 治阴热及烦热 右符，治热病，魇百鬼，夜行逢恶魅，佩之吉。 解迷惑 右符，治人患迷惑。 宜持此符，向西面跪拜，即解之。 不愈，书佩大吉。 若不止，用黄素朱书，吞下立差。 开心强记 右符，能令人心开逆知法。 以开日书符五十枚，书日仍服一枚，日二服，服之五十日； 符尽，复从上始； 尽百日至一年，心开，读书不忘，日得三千言。 久服之，升天。 安魂魄 右符，治病人魂魄不安。 若卒中恶，吞之，魂魄即还，大吉。 解悲思 右符，治人忧愁，悲思感慕，腹中不乐、啼哭狂娌。 用黄素朱书，吞之。 亦书於心上二又以绛缯五寸书在左臂上，侧卧。 如法，治之吉。 治疟疾 右符，主治十二时疟鬼，书佩之，立愈。 登高山望寒水，临虎狼捕疟鬼咄恁何不度去，吾家有富贵。 急急如律令。 又 登高山望寒水，使虎狼捕疟鬼。 朝时来暮时死，得之不捕与同罪。 急急如律令。 登高山望寒水，临虎狼捕疟鬼。 咄饮汝血汝何不疾去，吾家有贵客。 字为破石，头如西山，躯如东泽。 不食五谷，只食疟鬼。 朝食三千，暮八百，一鬼不尽守须索。 急急如律令。 右符二道，书之安於心前。 登高山望海水，检虎狼捕疟鬼。 咄如何不疾去，吾家有贵客。 字名破石，头如西山，躯如东泽。 不食五谷，但食 疟鬼。 朝食三千，暮食八百食，汝不足今来更索。 急急如律令。 右符七道，患疟疾者，依上书之，吞服，即差。 此千金之不传也。 禁咒文 登高山望寒水，使虎狼捕疟鬼。 朝食三千，暮食八百。 一鬼不去，移名河伯。 食之未足，催速求索。 急急如新出老君律令。 右勑疟，按病并咒符同。 天帝使者捕疟鬼得便辄杀勿问罪急急如律令。 右勑治疟符文用。 臣身中左右官，使者无令错互，各主方神，而疟鬼奸其母，子四子无故入园中，火自烧死，反为疟鬼。 吾是太上之使，知汝名字源由，何不疾走？ 今行水火追杀汝。 急急如律令。 右勑按疟疾行，火文并咒符。 治疟章 上言谨按：男子某，素以胎生肉人，百官子孙，千载有幸，得奉清化，道气扶持，从来蒙恩如愿。 肉人於行多违，招延罪考。 某年若干岁，以某月日，忽患疟疾，连日发动，头脑疼痛，寒热嘘吸，不下饮食。 发动之日，气息垂尽，转加重剧，大小惶怖，无复情计，驰来诣臣，求乞救治。 不胜肉人，婴此疟疾，在可哀愍。 谨为伏地。 太上诸君，丈人师君，夫人门下，典者五气君等。 缺文 太上洞玄灵宝素灵真符卷下竟",
      "translated_text": "The Nine Upper Talismans cure *zhong’e* (sudden possession by malevolent spirits). Ingest them after inscribing, and the effect is immediate.\n\nThe Three Upper Talismans cure *shuanshi zhuwu* (corpse transmission and hostile spirits lodged in the five viscera). Inscribe them in cinnabar on yellow silk and swallow the first talisman. If the condition persists, ingest the subsequent ones—none will remain uncured.\n\nThe Upper Talisman cures sudden attacks by the Five Ghosts carving into the five viscera. Inscribe it in cinnabar and swallow the first talisman. If the condition persists, ingest the subsequent talismans—none will remain uncured.\n\n**Treats:**\nAbdominal distension\nHeart and abdominal vexation and agitation\nLumbar pain\nBack pain\n\n*Here ends the Middle Scroll of the Supreme Cavern Mystery Numinous Treasure’s Plain and Spirit-True Talismans.*\n*Here begins the Lower Scroll of the Supreme Cavern Mystery Numinous Treasure’s Plain and Spirit-True Talismans.*\n*Transmitted by Master Du*\n\n**Treats:**\nChest pain\nDysentery\nCholera\nObstruction of urine and stool\nStrangury\nYin heat and vexing heat\nDispels confusion\nOpens the heart and strengthens memory\nPacifies the hun and po souls\nDispels sorrow and longing\n\n**Treats:**\nMalaria\nProhibitive incantations\nChest pain\nDysentery\nCholera\nObstruction of urine and stool\n\nThe right talisman treats obstruction of urine and stool in children—inscribe it below the navel for immediate efficacy.\n\n**Treats:**\nStrangury\nYin heat and vexing heat\n\nThe right talisman treats heat diseases, nightmares, the hundred ghosts, and encounters with malevolent spirits while traveling at night—wear it for auspiciousness.\n\n**Dispels confusion**\nThe right talisman treats those afflicted by confusion. One should hold this talisman, kneel facing west, and bow in reverence—thus dispelling it. If unresolved, inscribe and wear it for great auspiciousness. If the condition persists, inscribe it in cinnabar on yellow silk and ingest it for immediate healing.\n\n**Opens the heart and strengthens memory**\nThe right talisman enables one to open the heart and attain the method of reverse knowing. On an auspicious day, inscribe fifty talismans and ingest one daily, twice a day, for fifty days. When the talismans are exhausted, begin anew. After one hundred days to a year, the heart opens, and one will not forget what is read, daily retaining three thousand words. Prolonged ingestion leads to ascension to heaven.\n\n**Pacifies the hun and po souls**\nThe right talisman treats the unsettled hun and po souls of the sick. In cases of sudden *zhong’e*, ingest it, and the hun and po souls will immediately return—greatly auspicious.\n\n**Dispels sorrow and longing**\nThe right talisman treats sorrow, longing, melancholy, abdominal discomfort, weeping, and madness. Inscribe it in cinnabar on yellow silk and ingest it. Also inscribe it over the heart twice, and write it on a five-inch piece of crimson silk to bind on the left arm—then lie on one’s side. Follow this method for auspicious healing.\n\n**Treats malaria**\nThe right talisman governs the twelve-hour malaria ghosts—inscribe and wear it for immediate healing. Ascend a high mountain, gaze upon cold waters, and command the tigers and wolves to capture the malaria ghosts: *\"Why do you not swiftly depart? My household has wealth and nobility!\"* **Haste, haste, in accordance with the statutes and ordinances!**\n\nAgain: Ascend a high mountain, gaze upon cold waters, and dispatch tigers and wolves to capture the malaria ghosts: *\"Come at dawn, die by dusk—if captured, you shall not be spared, and the same punishment applies!\"* **Haste, haste, in accordance with the statutes and ordinances!**\n\nAscend a high mountain, gaze upon cold waters, and command the tigers and wolves to capture the malaria ghosts: *\"Drink your blood—why do you not swiftly depart? My household has noble guests!\"* The character is *Poshi* (Breaking Stone), its head like the Western Mountains, its body like the Eastern Marsh. It does not consume the five grains but feeds only on malaria ghosts—three thousand at dawn, eight hundred at dusk. If even one ghost remains, it will demand more. **Haste, haste, in accordance with the statutes and ordinances!**\n\nThe two right talismans should be inscribed and placed before the heart. Ascend a high mountain, gaze upon the sea, and order the tigers and wolves to capture the malaria ghosts: *\"Why do you not swiftly depart? My household has noble guests!\"* The character is named *Poshi* (Breaking Stone), its head like the Western Mountains, its body like the Eastern Marsh. It does not consume the five grains but feeds only on malaria ghosts—three thousand at dawn, eight hundred at dusk. If you are insufficient, come now for more. **Haste, haste, in accordance with the statutes and ordinances!**\n\nThe seven right talismans—those afflicted with malaria should inscribe and ingest them as above for immediate healing. This is a secret of inestimable value, never before transmitted.\n\n**Prohibitive incantations**\nAscend a high mountain, gaze upon cold waters, and dispatch tigers and wolves to capture the malaria ghosts: *\"Three thousand at dawn, eight hundred at dusk. If even one ghost does not depart, its name shall be transferred to the River Earl. If still unsatisfied, hasten to demand more!\"* **Haste, haste, in accordance with the newly issued statutes and ordinances of the Venerable Lord!**\n\nThe right mandate commands the capture of malaria ghosts—wherever the illness is found, the incantation and talisman are applied alike. The Heavenly Emperor’s emissaries capture the malaria ghosts and kill them without inquiry. **Haste, haste, in accordance with the statutes and ordinances!**\n\nThe right mandate for treating malaria with talismanic texts: The officials to the left and right of my body, the emissaries, must not err or interfere—each governs the spirits of their respective directions. Yet the malaria ghosts have violated their mother, and the four sons, without cause, entered the garden where fire burned them to death, transforming them into malaria ghosts. I am the emissary of the Supreme, and I know your names and origins—why do you not swiftly flee? Now I pursue and kill you with water and fire. **Haste, haste, in accordance with the statutes and ordinances!**\n\n**Malaria Petition**\nRespectfully stated: I, so-and-so, a mortal born of flesh, descendant of the hundred officials and children of the Dao, have been fortunate for a thousand generations to serve the pure transformation and be upheld by the Dao’s qi, ever receiving grace and fulfilling my wishes. Yet as a mortal, my conduct has often transgressed, incurring karmic retribution. In such-and-such a year, at such-and-such an age, on such-and-such a month and day, I suddenly contracted malaria, which has recurred daily, causing headaches, brain pain, chills, fever, gasping breaths, and inability to eat or drink. On the day of onset, my breath nearly ceased, and the condition worsened, filling me with great fear and leaving me without recourse. I hasten to you, seeking your salvation. Overwhelmed by this mortal’s affliction with malaria, I can only prostrate myself in pity. Respectfully, I bow to the ground before the Supreme Lords, the Venerable Masters, the Lady, and the officials of the Five Qi Lords...\n\n*Here ends the Lower Scroll of the Supreme Cavern Mystery Numinous Treasure’s Plain and Spirit-True Talismans.*",
      "overlap_context": " bind the thumbs with a cord. Then, with a cinnabar brush, inscribe the five centers as the talisman-master writes, placing the left side over the patient’s heart. Next, with the cinnabar brush, trace toward the nose to form the talisman, then insert the brush into the nostrils—turning left for men, right for women—no later than midnight or noon. Knock the head and state one’s name, begging departure. If unresponsive, press urgently and have the patient state their name—then the illness departs.",
      "start_char": 2882,
      "end_char": 4178,
      "start_sentence": 141,
      "end_sentence": 236,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.30611848831177,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\神符类\\太上洞玄灵宝素灵真符.txt",
        "category": "神符类"
      }
    }
  ]
}