{
  "source_id": "太上洞玄灵宝宣戒首悔众罪保护经",
  "source_file": "chunked_daozang\\太上洞玄灵宝宣戒首悔众罪保护经.json",
  "total_chunks": 11,
  "total_original_chars": 9684,
  "total_translated_chars": 58157,
  "total_translation_time": 283.50439047813416,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\戒律类\\太上洞玄灵宝宣戒首悔众罪保护经.txt",
    "category": "戒律类"
  },
  "full_translation": "**The Supreme Cavern Mystery Numinous Treasure Sutra of Proclaiming Precepts, Confessing Sins, and Invoking Protection**\n\n**Sutra Title:** *The Supreme Cavern Mystery Numinous Treasure Sutra of Proclaiming Precepts, Confessing Sins, and Invoking Protection*\n*Author unknown; likely composed toward the end of the Northern and Southern Dynasties. Based on its content, it appears to be a missing fascicle of the* **Scripture of Ascending the Mysteries and Inner Teachings***. Originally in three scrolls, the first is lost.*\n\n**Source Text:** *Daoist Canon of the Zhengtong Era, Dongzhen Section, Precepts and Disciplines Category.*\n\n**Middle Scroll of *The Supreme Cavern Mystery Numinous Treasure Sutra of Proclaiming Precepts, Confessing Sins, and Invoking Protection***\n\nThe Supreme Dao Lord spoke:\nFrom past lives to the present, the transgressions and evils committed by worldly people have accumulated upon their own bodies. In youthful ignorance and folly, they fail to comprehend the Dao/Way and its principles, unaware of teachings and disciplines, ignorant of proper conduct, and blind to the distinction between right and wrong. They violate the prohibitions of Heaven and the taboos of Earth, the four seasons and five phases, the interplay of yin and yang, the soft and the firm, the sun, moon, and stars, and the spirits of the Dao/Way and virtue/power. Above, they are unfilial toward Heaven and Earth, the sovereign, parents, elders, and revered superiors; below, they bring harm to subjects, inferiors, servants, and even the crawling and flying creatures. Their sins and transgressions amass, forming countless calamities and retributions that pursue them without end, cutting short their years and seizing their allotted spans, beyond reckoning.\n\nThe transgressions and evils they commit include:\n- Anger, wrath, and vengeful punishment as sins;\n- Cruelty, malice, and brutal oppression as sins;\n- Killing, wounding, destruction, and execution as sins;\n- Deception, exploitation of the weak, and contemptuous disregard as sins;\n- Flattery, partiality, sorcery, and deceit as sins;\n- Secret envy, lust, arrogance, and pride as sins;\n- Gluttony in drink, vomiting, and drowning in excess as sins;\n- Abuse of power, bullying, and intimidation of the noble as sins;\n- Greed, sycophancy, theft, and pilfering as sins;\n- Hoarding, stinginess, and failing to aid the dying as sins;\n- Coercion, scheming, mockery, and harsh criticism as sins;\n- Desecrating graves, exposing corpses, and scattering bones as sins;\n- Deception, slander, and malicious attacks as sins;\n- False accusations, quarrels, and spreading confusion as sins;\n- Slandering sages and worthies, and engaging in defamation as sins;\n- Indulging in excessive desires and lewdness as sins;\n- Self-indulgence in trivial pleasures and gluttony as sins;\n- Careless speech and reckless conduct as sins;\n- Impure thoughts and indiscriminate gazing as sins;\n- Indiscriminate listening and indiscriminate smelling as sins.\n\nThose who commit such evils:\n- As rulers, cannot embody benevolence;\n- As ministers, cannot embody loyalty;\n- As officials, cannot embody impartiality;\n- As fathers, cannot embody kindness;\n- As sons, cannot embody filial piety;\n- As mothers, cannot embody love;\n- As elder brothers, cannot embody fraternity;\n- As younger brothers, cannot embody deference;\n- As friends, cannot embody integrity;\n- As wives, cannot embody reverence;\n- As men, cannot embody goodness;\n- As women, cannot embody chastity;\n- As teachers, cannot embody instruction;\n- As disciples, cannot embody respect;\n- As superiors, cannot embody guidance;\n- As inferiors, cannot embody propriety;\n- As neighbors, cannot embody deference;\n- As companions, cannot embody trustworthiness;\n- As clansmen, cannot embody harmony;\n- As husbands, cannot embody sincerity;\n- As servants, cannot embody diligence;\n- In cultivating the self, cannot bring benefit;\n- In studying the Dao/Way, cannot attain immortality.\n\nThus:\n- Those who govern the state cannot achieve great peace;\n- Those who manage households cannot attain good fortune;\n- Those who cultivate the body cannot extend their lifespan;\n- Those who pursue their work cannot complete their tasks.\n\nTherefore, the Dao/Way encompasses boundless compassion, its virtue/power cherishes all beings, its grace extends without limit, and its blessings penetrate without end. To those on the verge of perishing, it grants rebirth; to those burdened by sin, it permits confession and repentance.\n\nThose who confess and repent must:\n- Sincerely express their remorse;\n- Fully disclose their transgressions;\n- Observe the Six Fasts and Ten Days of Abstinence;\n- Honor the Gengshen and Jiazi days, the eight solar terms, and their own birthdays;\n- Enter the chamber, burn incense, and openly confess their offenses.\n\nThus:\n- No sin will remain unforgiven;\n- No transgression will remain unabsolved;\n- No merit will fail to accumulate;\n- No virtue/power will fail to be established;\n- No resonance with the Dao/Way will fail to manifest;\n- No attainment of immortality will fail to be achieved.\n\nIf one cannot observe the designated days of fasting and abstinence, one should at least request the sutra and make offerings. During the establishment of the fast, on the first and fifteenth days of the lunar month, and on one’s birthday, with utmost sincerity and earnestness, one should confess one’s transgressions. The merit thus accrued will be even greater, and no sin will remain unforgiven.\n\nNow, I teach you this: devote yourself to reverent practice, and the field of blessings will flourish, and your karmic deeds will be established.\n\nThe Heavenly Master bowed deeply and respectfully received the instructions.\n\nThe Supreme Dao Lord spoke:\nAll people—men and women, emperors, kings, and lords—who establish fasts and practice the Dao/Way should have the Dharma Master recite this text of confession and repentance from the high seat. If one cannot recite it clearly, one should follow the ritual of the Numinous Treasure Fast, arranging the altar and oratory as convenient, for one day or up to three days, adjusting the offerings according to one’s means, whether rich or poor. Use golden dragons and colored silks to consecrate the ten directions.\n\nIf employing the ritual protocol:\n- State the name, age, and number of household members of the fast’s sponsor;\n- Have the sponsor bow twice, prostrate fully, and kowtow three times with hands clasped overhead, then strike the ground in full prostration.\n\nThe Dharma Master should then recite the text of confession from the high seat, first enumerating the sins of the sponsor’s living and deceased kin. Thus:\n- The merit will move the heavens;\n- Sins will be eradicated from the nine yin realms;\n- Blessings and virtue/power will flow back;\n- Grace and protection will descend;\n- True qi will descend;\n- Both the living and the dead will be liberated;\n- Humans and spirits alike will be released.\n\nThe merit is immeasurable; the Dao/Way of immortality will be accomplished. Demon kings will pay homage, households will be purified, ghosts and demons will not dare to intrude. No greater merit exists.\n\nNow, I transmit this to you; treasure it well.\n\nThe Heavenly Master bowed his head and respectfully received the teachings and admonitions.\n\nThe Perfected One said: When reciting the initial text of confession, it should be chanted in the tone of scripture.\n\nFirst, the sponsor bows twice, prostrates with head touching the ground, and strikes the earth three times with forehead. The Dharma Master intones:\n\nTo the Most High, Boundless Dao/Way, and the Three Treasures, the revered deities: In such-and-such prefecture, county, village, and hamlet, the man or woman official [Name], aged [X], with [X] household members, now during this retreat, lays bare and resolves the heavy transgressions of past lives. Humbly beseeching the Perfectly True, may they bestow the grace of the Dharma, grant great compassion, and pardon all sentient beings—along with the sponsor’s ancestors through nine generations and seven lineages, extending to the five degrees of mourning and six relations.\n\nWhether as ruler or high official, they may have governed with frequent transgressions, policies unjust and uneven, favoring private over public, greedily coveting wealth and beauty, levying taxes inequitably, inciting slander, fabricating false documents, spying on the innocent, nitpicking faults, engaging in excessive trade and profiteering, blocking the four roads, manipulating prices, disrupting agriculture and sericulture, seizing labor at critical times, imprisoning the virtuous while releasing the wicked, lightly pardoning evil while heavily punishing good, flattering favorites, slaughtering the worthy, exalting the favored while oppressing the weak, unleashing rapacious officials, jackal-like aides, tiger-like generals, and bear-like soldiers—idling by day and feasting by night, causing livestock to die violently, devouring the people, extorting those under their rule, amassing illicit wealth beyond measure, sins and transgressions piled high as mountains.\n\nAs rulers, they were unworthy; as ministers, disloyal; as officials, corrupt; in public office, impure and unchaste; in private, crooked and unprincipled. They defied and disrupted the true Dharma, following their own whims, crafting deceitful documents, misleading the eyes and ears of others. Accepting bribes, they released the guilty and killed the innocent. They extorted goods under false charges, coerced the innocent into surrendering treasures, usurped thrones, murdered rulers, abducted men and women, enslaved maidservants and bondservants, beat and flogged the upright, whipped the blameless, harmed the guiltless, executed the innocent. They plundered and pillaged, seizing people and property—seven treasures, five silks, livestock, and breeding animals. Without cause, they mobilized armies, waging war, driving the people to their deaths, leaving souls stranded in desolate lands, blood and sweat flowing like rivers, corpses and ghosts wailing in the wilderness, starving spirits in the deepest misery, in the nine springs below. The living cried out in suffering, their grievances reaching heaven; the dead held bitter grudges, lodging complaints in the nine yin realms. Vengeance and retribution intertwined, trials and transgressions linked endlessly. They attacked and ravaged nations without reason, hunted and slaughtered living beings, killing those with breath, flying hawks and running hounds devouring their flesh, destroying fetuses and stripping eggs, trapping and netting creatures, shooting and stabbing with cruel intent, hearts filled with malice, devoid of benevolence and righteousness. They brewed poisoned wine, spoiled food, and toxic concoctions, urging others to consume them, rotting their organs and ending lives. Relying on their noble status or wealthy households, they compared themselves to the sun and clouds, belittling their peers, setting their ambitions beyond the heavens, foolishly believing in the permanence of wealth and rank, slandering the Perfected, doubting and mocking Daoist masters, ridiculing the true adepts, severing their own roots. Such capital crimes and countless transgressions cannot be fully enumerated.\n\nAll these and the like bring retribution in death, calamities flowing to later generations, causing the common folk to stagnate in office, dwell in decline and poverty, suffer constant losses, endure lingering illnesses. Their descendants may not survive, sons and daughters dying young, family estates dwindling, disconnected from their ancestors, lacking ancestral blessings, unable to escape hunger and cold. All these countless misfortunes arise from such transgressions.\n\nNow, on behalf of the living and the dead, we repent. Humbly we pray the Heavenly Worthy to grant forgiveness and absolution.\n\nSecond, the sponsor bows twice again, prostrates with head touching the ground, and strikes the earth three times with forehead. The Dharma Master intones:\n\nTo the Most High, Boundless Dao/Way, and the Three Treasures, the revered deities: May they pardon the sponsor’s ancestors from past generations down to the present, and from the time of self-awareness to now—truly, they have committed many evils and few good deeds, been rebellious and seldom compliant, defied heaven and betrayed earth, offended the stars. As ministers, they failed to be loyal to their rulers; as children, unfilial to their parents; as wives, disrespectful to their parents-in-law; as younger siblings, disobedient to their elder brothers and sisters. Though born human, they lacked compassionate hearts and benevolent conduct, were perverse and partisan, their anger and joy inconstant. On the six fast days and auspicious occasions, they violated the decrees of the Mysterious Bureau.\n\nToward those they loved, they wished life; toward those they hated, they wished death.\n\nBeating and bullying without cause, cursing and reviling without restraint, acting solely to please themselves, gluttonous for fine flavors. Errors great and small intertwined, households devoid of rules and order. Turning from virtue toward lust, indulging in frivolity and arrogance. Bullying the orphaned and cheating the widowed, seizing what is not theirs. Hearts given to extravagance and ease, words and deeds marked by arrogance and contempt. In all they undertook, each action bore the weight of transgression. Unafraid of spirits and gods, heedless of precepts and prohibitions, unmindful of calamity and evil, reckless in advance and retreat, disregarding taboos and prohibitions, forsaking benevolence and righteousness, miserly and covetous, never giving alms. Demanding repayment from others, delighting in theft and robbery. Deceiving and extorting among their peers, practicing injustice and perversion in public. Scheming to profit from others, constantly mocking and deriding them. Borrowing money long-term while repaying short, using light scales and small measures, narrow cloth and short rods; forcing heavy scales and large measures upon others, monopolizing their gains. Exploiting power and influence, invoking official authority in their speech; relying on cunning and malice, flattering and deceiving to mislead the foolish; their hearts far from pure, yet invoking gods with false sincerity. Desecrating tombs and plundering graves, assaulting and robbing the dead. Fraudulently borrowing and lending, taking wealth not rightfully theirs, wearing clothes not theirs to wear, eating food not theirs to eat, drinking drink not theirs to drink, stealing others’ livestock, fruits, vegetables, grains, mulberry trees, bamboo, and thriving trees. Their avaricious and base nature, sins manifest before the divine; in all their movements and deeds, violating statutes and transgressing laws. The gravest of sins, recorded by the Right Bureau. Thus causing their households’ livelihoods to falter, frequent strange occurrences, poverty, hardship, destitution, and squalor, repeated losses, discord among family, mutual resentment and anger, few in good health, many afflicted by illness—all stemming from the transgressions and evils committed thus. Now, therefore, they repent for both the living and the dead, humbly beseeching the Heavenly Worthy to grant forgiveness and absolution.\n\nThirdly, bowing again, prostrating and kowtowing, raising their hands thrice to strike their chests.\n\nThe Dharma Master intoned:\nTo the Most High and Boundless Dao, the Three Treasures and Venerable Deities, we humbly pray: may Your great compassion descend, erasing the karmic afflictions of our ancestors and the sins binding us in this present life, from the time of self-awareness to now. Truly, husband and wife failed to uphold good conduct toward one another, instead transforming into wickedness. Lacking pure and upright intentions, their hearts filled with jealousy and envy, harboring hidden grievances and disputes, mutual hatred and resentment. Scolding sons and cursing daughters, beating and abusing servants and maids, berating guests and rebuking visitors, severing ties with neighbors, distrusted by their village and community, discord with kin, estrangement from relatives, disharmony among the six relations, disloyalty among the nine clans, venting anger upon livestock, harboring suspicion toward wives and concubines. Delighting in deceitful friends, reveling in wicked companions, secretly stealing and openly robbing, colluding with villains. Specializing in curses and hexes, covertly inflicting harm; flattering and bewitching, outwardly kind but inwardly evil; envying the worthy and resenting the capable, suppressing talent, slandering the virtuous, humiliating the good, defiling the pure, staining the unsullied. Biting at others’ excellence, resenting others’ wealth. Their hearts like cunning otters, their minds harboring malice, tongues sharp as daggers, mouths filled with venom. Devoid of benevolence and righteousness, lacking propriety and loyalty. Insisting on their own rightness, condemning others as wrong; self-conceited and boastful, self-righteous and arrogant. Year after year, unable to recognize their own faults. Deceitful and insolent, slanderous and contradictory, lacking sincerity and trustworthiness, pointing south while calling it north, twisting east into west, mocking parents, defying teachers and lords, disregarding close and distant relations, showing no reverence for the honored, sowing discord with forked tongues, inciting strife and wickedness, flattering with honeyed words, constantly quarreling and deceiving. In trade and commerce, specializing in fraud and trickery, nitpicking over ounces and grains, turning long into short, exchanging the fine for the coarse, insatiable in their desires. Publicly acting lawlessly, privately encroaching upon the loyal and good, belittling the four great elements, defiling the three luminaries, indulging in folly and baseness, chasing after the powerful. Their hearts anxious, their minds restless. Thousands of transgressions recorded by the Four Bureaus, myriad offenses inscribed by the Five Emperors, accumulating over months and years, beyond count. Thus causing their households to suffer constant misfortune, their endeavors to fail, their studies of the Dao to lack clarity, their pursuit of immortality to bear no fruit, mocked by the common crowd, beset by groundless slander, calamities recurring, despised by the multitude, deceived by officials. All fortune eludes them—all due to the transgressions and evils committed thus. Now, they repent for both the living and the dead, humbly beseeching the Heavenly Worthy to grant forgiveness and absolution.\n\nFourthly, bowing again, prostrating and kowtowing, raising their hands thrice to strike their chests.\n\nThe Dharma Master intoned:\nTo the Most High and Boundless Dao, the Three Treasures and Venerable Deities, we humbly pray: may Your merciful grace descend, may You pardon the sins of the sponsor’s ancestors and this present life, from the time of self-awareness to now. Truly, they received emoluments without merit, rewards without virtue. Unable to perform good deeds, they mocked those who did; unable to accept transformation, they slandered the sacred teachings.\n\nThose who secretly steal scriptures, treat the sacred and the worthy with disdain and defilement, turn their backs in betrayal and rebellion, forsake the Dao to embrace heresy, undermine and destroy achievements, indulge in wrongdoing and chase after transgressions. Seeing others’ faults, they pierce with words and mock with speech. Encountering the virtuous, they harbor resentment; facing the talented, they breed jealousy. They favor the depraved, despise the noble, delight in others’ vices, and shame others’ virtues. They do not believe that evil begets evil, that sin begets retribution; knowing they should reform, they persist unceasingly; knowing they should not transgress, they never cease. Borrowing without thought of repayment, lending without intent to reclaim, they lightly harm the poor and destitute, slandering the foolish and ignorant. They teach others to do evil, urge them toward wrongdoing. Though dwelling in poverty and hardship, they do not blame themselves but instead nurse grievances, coveting what belongs to others. Gaining advantage brings joy; losing it sparks fury. They vent their malice, waiting to ensnare others at the first opportunity. In the unseen realm, their bodies remain unclean, rising naked at night, offending the stars, cursing wind and rain, disrespecting the divine, disrupting yin and yang, and disturbing the five phases. They harm others to benefit themselves, endanger others to secure their own safety; they claim others’ merits as their own, turning others’ achievements into their own fame. Their actions are indefensible, their deeds improper. They belittle the elderly and slight the young, arrogant and reckless in their conduct. Outwardly, they lack propriety; inwardly, they lack kindness and benevolence. They sever others’ nine clans, estrange others’ six relations; they turn a southerner’s father into a stranger, a northerner’s child into an orphan, an easterner’s husband into a widower, a westerner’s wife into a widow; they separate men from their sons, isolate women from their daughters. They teach others to abort, guide others to miscarry, valuing only killing and harm, holding no reverence for life. Harboring resentment, they burn incense and invoke the gods, recklessly praying to a hundred ghosts, calling to heaven and earth. They curse the deities of the Three Luminaries, wishing death upon others, invoking ruin, their hearts unkind, ever nurturing venomous thoughts. They lust after others’ wives, covet others’ essence. Their desires and thoughts dwell on deceit and treachery. They build no merit, harbor no intent to give. Some study without a radiant teacher, practice without proper guidance, their mouths filled with grass and wood, their hearts with sand and stone. Some, relying on their age, refuse the great teachings, their bodies devoid of even one precept, yet falsely claim mastery of the Three Caverns. Some, in women’s attire, remain unclean and defiled, usurping sacred ranks and altars, their minds clinging to sensual realms. Seeing the poor, the wretched, the orphaned, and the weak, they double their arrogance, mockery, deceit, and contempt. Some drink to drunkenness, raving and lost in confusion, speaking lawlessly, defying the rhythms of heaven, deluded without measure. Some enter temples yet refuse to bow to scriptures and images. Some consort with the secular, engaging in illicit unions, secretly indulging in desire, reported by the Four Controllers, devoid of virtuous merit; investigated by the Five Emperors, bearing guilt and offense. Thus, their life’s conditions dwindle, every endeavor falters, they constantly suffer misfortune, repeatedly encounter peril, mired in sorrow and joyless, walking with worry, accumulating years without happiness, passing seasons without peace. Their minds are darkened, their intentions blocked, their wisdom and judgment clouded, their faculties dull and obscured, the six senses unopened, principles of righteousness ungrasped. Their wishes go unfulfilled, their requests unanswered, their endeavors fail, their official careers stall, their livelihoods decline, their homes remain unsettled. Great and small calamities befall them; their studies do not advance, their cultivation does not lead to immortality—all due to the transgressions and evils committed thus. Now, for the sake of the living and the dead, they repent. Humbly beseeching the Heavenly Worthy to grant forgiveness and absolution.\n\nThen, bowing again for the fifth time, he prostrates himself, knocking his head to the ground, raising his hands thrice to strike his own cheeks. The Dharma Master intones:\n\nSupplicating above to the Supreme, Boundless Dao, the Primordial Heavenly Worthy, and the Three Treasures of the Venerable Scriptures, we humbly pray that the Perfected Ones pour forth hidden blessings and grant absolution to the nine generations of ancestors and seven lineages of descendants, the thousandfold forebears and myriad progenitors, the departed and the newly deceased, all spirits from former lives to the present. Each, due to unkind deeds in past lives, met early ends, perishing before their time, their later lives unfulfilled—unable to know the manner of their deaths.\n\nSome died with splitting headaches and burning brows, their five viscera in turmoil, their bodies frozen cold, lying abed. Others suffered chronic illness, emaciated and skeletal, leaning on staffs for years before death. Some succumbed to poisonous treatments, racking coughs, and blood-vomiting, their bellies swollen with lumps, ravaged by toxins and lethal drafts, their insides rotting away. Others perished from limb-swelling, madness, ulcers, and festering sores, their flesh teeming with worms, their bodies wracked by malaria, deformities, and joint dislocations, their sinews withered and severed. Some died deaf, blind, mute, or dumb, their seven orifices blocked, their bowels and bladder obstructed, unable to take in food or water. Others fell to wind-induced epilepsy, head sores, demonic possession, or madness—rolling their eyes, sticking out their tongues, arching their backs in spasms, bellowing like oxen, bleating like sheep, whining like dogs, or crowing like roosters—plunging into ravines or leaping into flames, heedless of water or fire. Some met their end on battlefields, trampled by blades, pierced by spears and halberds, struck by arrows, their heads severed, their bodies hacked apart. Others were stung by snakes, wasps, or scorpions, mauled by eagles, wildcats, jackals, wolves, tigers, or dragons, or trampled and gored by oxen, horses, dogs, or boars. Some plunged from cliffs or trees, drowned in sinking boats, fell from horses or chariots, or tumbled from heights, crushed or drowned. Others were ambushed by thieves or bandits, slain in brawls or skirmishes, left to die by the roadside. Some perished under the weight of official or private tyranny. Others died far from home, their blood soaking the roads, their flesh nourishing the grasses and waters, their remains abandoned in foreign lands. Some starved in famines or wars, perishing from cold or heat, thirst or hunger. Others succumbed to paralysis, leprosy, or loathsome diseases, their faces and bodies disfigured, noses eroded, ears severed, cast aside in remote villages or exiled to distant frontiers. Some were beaten to death by villains or brutish men, their skin flayed, their chests and hearts pierced by blades, their bones shattered, their limbs broken, their eyes gouged, their teeth smashed, their five organs scorched by stagnant heat. Others were seized by malevolent spirits, struck by misfortunes or miasmic vapors, slain by vengeful ghosts, or snatched away in an instant. Some choked on blood or suffocated, succumbing to dysentery or wasting diseases, their insides hardened, their outsides knotted, their bodies withered. Others perished from seminal leakage, obstructed meridians, the five taxations and seven injuries, their complexions sallow, their limbs numb and aching, their bodies parched and withered. Some were imprisoned for crimes, executed in public squares, or died under judicial torture. Others died in childbirth, drenched in blood, or lost their infants—sons who never grew, daughters who never thrived, cut down in blindness or infancy, never beholding the sun or moon. Some were struck by lightning, their backs branded, their spines split. Others drowned in floods, burned in fires, crushed by falling trees or stones, buried under earth, or swept away by mudslides. Some perished on night marches, bearing swords and bows, their strength spent, their qi exhausted, collapsing from toil.\n\nThough all met a single death, their pains were manifold—each fate bound to karmic causes, their ends dictated by destiny. Life wanes swiftly, not by the Dao’s design. Devoid of past-life blessings, their unkindness brought this retribution. Their bodies surrendered to the Three Offices, their souls plunged in an instant, cast into the dark paths where each spirit faces its karmic adversary. Imprisoned in hells, Fengdu, the Three Offices, or the Six Bureaus, they are hung by their heads in shackles, made to stand on triple blades, climb mountains of knives, or walk forests of swords. They are fed fire and forced to eat coals, boiled in cauldrons, burned in flames, made to swallow ice and drink poison, their tongues torn out, their mouths force-fed, flogged by day and tortured by night. Their bodies are mutilated, their forms charred, their souls tormented by searing pain, their suffering unbearable. After three interrogations, escape is impossible. In the endless night, they wander among the wailing hungry ghosts, trapped in the sorrow of the Three Wretched Paths, enduring the agony of the Five Sufferings’ court. Their sins span countless kalpas, their offenses unforgiven.\n\nLonging for life, the paths of rebirth are barred; wishing for rebirth, no karmic ties remain. Death is denied, and they sink forever into the abyss of sin, forever severed from peace. Their lingering misfortunes extend to later lives, evil begetting evil, faults entangling faults. Thus, the foolish and the common suffer unending misfortune; officials cannot secure rank, livelihoods cannot bring warmth or fullness. Men and women, young and old, endure unceasing hardship.\n\nNow, for all beings—those departed in past lives and present, the newly deceased and the long-dead—we repent these sufferings, the sins of unkindness, the transgressions of wickedness, the offenses of rebellion, the violations of harmony, the defiance of heaven and earth, the offenses against spirits, the flouting of laws, and the deviance from the Dao. Their sins tower like mountains, their transgressions deep as the sea, causing the departed and the newly dead to perish without reason, afflicted by a thousand illnesses and ten thousand pains, a hundred torments and myriad ailments, dying from poisonous wounds—all retribution for past-life unkindness.\n\nWe beseech the Great Compassion to grant mercy and absolution. According to the manner of each departed soul’s death, may the trapped spirits be liberated, the suffering souls delivered. May they escape the clutches of Fengdu and the Three Offices, be freed from the Nine Hells, and ascend to the Heavenly Halls. May they dwell in the Forest of Pure Ghosts, the Land of Non-Action, severed from karmic ties, their blessings extended to descendants. May their homes be peaceful and auspicious, their lineages complete. May malevolent spirits and demons be restrained, heaven’s canopy and earth’s support safeguarded by divine protection. May those who study the Dao attain it; those who seek immortality achieve it. May wealth and honor be long preserved, and peace come naturally.\n\nThus the host bows twice and kowtows, declaring gratitude for the grace of the Dao.\n\nHere ends the *Supreme Cavernous Mystery Numinous Treasure Sutra of Proclaiming Precepts, Initiating Repentance, and Safeguarding from All Transgressions, Scroll the Middle*\nHere begins the *Supreme Cavernous Mystery Numinous Treasure Sutra of Proclaiming Precepts, Initiating Repentance, and Safeguarding from All Transgressions, Scroll the Lower*\n\nThe Supreme Dao Lord addressed Celestial Master Dao-ling, saying: This method of initiating repentance and the *Scripture of the Ascending Mystery* serve as the fence of the Dao and virtue, the ramparts of the Most Perfect, the ferry of life and death, the bridge for the multitudes, the field of blessings for establishing oneself, the deep pool of merit and achievement, the living path of nurturing one’s nature, the immortal formula for cultivating the Perfect Truth, the great dharma for dissolving transgressions, the foremost school of practice, the supreme goodness of ultimate life, the first means of delivering the dead, the true discipline for dispelling calamities, the secret art for dispersing misfortune, the grand teaching for pacifying the state, the solemn covenant for tranquilizing the household, the wisdom of learning, the boundless wealth of seeking goodness, the excellent remedy for curing illness, the virtuous medicine for healing disease, the pivot of divine luminosity, and the Bian Que of the ten thousand afflictions.\n\nThis peerless and most perfect great Dao, vast in its model, broadly disseminates the teaching of the world and delivers boundless beings. When its hymns dissolve transgressions, a thousand sins melt like ice, and ten thousand faults scatter like snow.\n\nReciting it saves the dead, and suffering souls and wronged spirits forever depart from the fires of torment. It liberates from the five sufferings, transcends the eight difficulties, and spirits ascend to the pure groves of the Dao’s abode. Above, they wander the precincts of the Mysterious Capital; below, they repose in the courts of Kunlun. Both the living and the dead are delivered, and blessings and benefits flourish day by day.\n\nWhen one recites it seeking even a single blessing, misfortunes cease to pursue, old transgressions vanish, the living gain fortune, and one constantly dwells in peace and felicity. The register of death is erased from the right palace, and the record of life is inscribed upon the left contract. Thus, one cultivates the scripture and practices the Dao, observes long fasts and austere disciplines, calms the spirit and steadies the mind, with single-hearted sincerity contemplates the Dao, and turns one’s heart to the court of the supreme and perfectly true. One venerates the *Sutra of the Ascending Mystery and Inner Teaching of the True Scripture*, the supreme register that fully accords with Heaven. Wearing it as a treasure upon the body, one awaits the cloud-borne chariot, soaring through the great void to ascend and meet the August Sovereign of Emptiness, carefree in the Jade Capital.\n\nYou must treasure and keep it secret, practice it according to the method, establish merit and eradicate transgressions, as echo answers sound. Cultivating goodness, misfortune naturally perishes; establishing merit, fortune naturally arises—like a mirror, the crooked and straight follow the form. In upholding the method, one must give one’s whole heart; in revering the master, one must offer utmost sincerity. When the heart is fully given, the divine and luminous know; when sincerity reaches its essence, the ultimate truth is refined. Thus, without laxity, one ascends as an immortal and attains long life.\n\nWith earnest admonition, I declare this to the myriad beings: you must proclaim this scripture. This scripture is the ancestor of all methods, the supreme and most numinous. Those who make offerings to it will surely attain the Dao, ride the clouds, and ascend to the Jade Purity. Wondrous indeed is this scripture of the perfect and true—those who venerate it, listen with reverence.\n\nThe Most High Lord of the Dao addressed the Heavenly Master, saying: If there are worthy men and good women who wish to cultivate themselves and uphold the method, focus their minds on observing the precepts, seek life and pursue immortality, delight in the Dao and love the scriptures, reform their hearts and change their conduct, repent their transgressions and evils, with single-minded sincerity and unwavering faith, desiring long life and old age, transcendence by immortals, deliverance from disaster and suffering, escape from calamities and hardships, turning the wheel toward the fields of goodness, constantly accompanied by fortune—living in peace and joy, dying in transformation like the cicada’s molt, learning the Dao and attaining the Dao, ascending to heaven in broad daylight, equal in glory to the sun and moon from beginning to end, liberated from sorrow and suffering, ever filled with joy—all past transgressions must be repented. The method of repentance requires utmost sincerity, complete honesty, and no concealment, which would only increase one’s sins.\n\nThe Heavenly Master assented reverently and received the precepts.\n\nThe Most High Lord of the Dao addressed the Heavenly Master, saying: Good men and good women, if you wish to remain forever among the seed-people, preserve life and extend years, after a thousand years transform your bodies, dwell long in the divine lands, not migrating to desolate regions, always abiding in countries of the Dao, ever born into gates of filial piety and kindness, not falling into places devoid of virtue, not born in frontier lands, departing from pain and distress, transmitting fortune and following goodness, not belonging to the same kind as birds and beasts, not serving as slaves to evil spirits, possessing lovely countenance and form, free from foolishness and emaciation, keen and penetrating in wisdom, with insight as the foundation of intelligence—all past transgressions of a thousand sins and ten thousand faults must be repented. All must be honestly confessed, with no concealment, which would only increase one’s sins.\n\nThe Heavenly Master assented reverently and received the precepts.\n\nThe Most High Lord of the Dao addressed the Heavenly Master, saying: Good men and good women, if you wish to cure illness and heal disease, dispel calamities and rescue fate, save the dying and protect the living, live in the world without sorrow, accomplish what you undertake, fulfill your wishes, dwell in pure and secluded abodes, double the harvest of fields and silkworms, prosper in livelihood, be loved by the multitude, respected by high officials, with flourishing descendants, wealth, honor, and glory, attaining all that is auspicious, all that is peaceful, with every wish fulfilled and every thought realized, cultivating the scriptures and seeking the Dao, desiring to behold the True Lord—all past transgressions must be repented. The method of repentance lies solely in sincerity and honesty, sending forth the heart’s emotions, ensuring they ascend to be heard. The Dao-eye of the August Sovereign naturally reflects your heart. Concealment increases sin; the Dao does not speak in vain.\n\nThe Heavenly Master assented reverently and received the precepts.\n\nThe Most High Lord of the Dao addressed the Heavenly Master, saying: Good men and good women, if you wish to know your past lives’ abodes, the suffering and joy of the living and the dead, to understand that doing good brings good, planting fortune brings fortune, establishing kindness and bestowing favors, building merit and amending faults, recalling the deeds of past lives not limited to this body, awakening to the correspondence of sin and fortune, good and evil, knowing that this present body comes from a former body, turning from life to death, from death to life, following the causes that arise, causes unbroken; following the conditions that arise, conditions unsevered, thus attaining the present and establishing this body—once you recall this, think to establish good karma, fearing that this body may receive another body in the future, not attaining what this body now has, and fearing that after this body, the next may not clearly recognize, or lose the human path, not as this present body. Relying solely on this body, broadly cultivate the fields of fortune. Those who can do this will attain their wishes accordingly.\n\nIf you wish never again to be poor or lowly, never again orphaned or feeble, never again cold or hungry, never again begging or selling labor, never again suffering disaster or illness, never again deaf or blind, never again foolish or perverse in views, never again wrongly accused by officials, never again a slave or servant, never again slandered or maligned, always meeting sages and worthies, always connected with enlightened masters and precious scriptures, always encountering perfected immortals and transcendent beings, always meeting good, fortunate, and virtuous people for instruction, desiring the accomplishment of the immortal Dao—all past transgressions must be repented. The method of repentance requires complete sincerity, thorough confession without concealment, not hiding grave faults while admitting minor ones, which would only increase one’s sins. The statutes are stern and severe; the Dao does not speak in vain.\n\nThe Heavenly Master assented reverently and received the precepts.\n\nThe Most High Dao Lord addressed the Heavenly Master, saying: \"Good men and good women, if you wish that the residual debts of past lives—ancient transgressions, former faults, and long-standing sins of your forebears—be no more; if you wish that in this present life there be no mutual burdens, no new offenses, no recent misdeeds, no karmic debts, no immediate grave faults; if you wish that your three generations of ancestors and five lineages, your ninefold kin and sevenfold descendants, all be liberated from the Three Wretched Realms and entirely escape the Five Sufferings; if you wish that your future descendants flourish, both great and small prospering, their bodies whole and complete, their years long and their lives enduring, untouched by cold in water or heat in fire, free from pain and itching, hunger and thirst; if you wish that no monstrosity may terrify you, no calamity harm you, that dragons lie hidden and phoenixes soar, your comings and goings unrestrained—then all past transgressions must be repented. The method of repentance lies solely in utmost sincerity, thorough confession without concealment; thus, no evil shall remain unremoved, no fault unabsolved. Carelessness and irreverence will only increase your sins. The Dao does not speak in vain—take heed!\n\nThe Heavenly Master assented reverently and received the precepts.\n\nThe Most High Dao Lord continued: \"If rulers and ministers, fathers and children, elder and younger brothers, husbands and wives, masters and servants each wish to repent their transgressions, they must prepare offerings for their masters, prostrate themselves in contrition, strike their breasts in remorse, compose their bodies, examine their conduct, and maintain reverence and solemnity with focused, upright minds, obeying the teachings and commands. The Dharma Master shall ascend the high seat to recite the scripture of confession and repentance. If in a quiet chamber or altar hall, one may also circumambulate while reciting scriptures at any time.\n\nThe Dao is non-action, profound and obscure, invisible to the eye, inaudible to the ear. Yet when the human heart is sincere, it perceives and understands human sentiments—seeing without relying on the eyes, hearing without relying on the ears. Thus, the divine and enlightened grasp the supreme Dharma, govern the multitudes, propagate teachings, and bestow precepts to guide the foolish. When the master leads the repentance, sins are absolved at once; but if one returns to wrongdoing after repentance, the sins only deepen.\n\nMan values timely action; the Dao values subtlety. To correct one’s faults from morning to evening is praised by the sages. Thus, those who do good cultivate the earth; those who uphold precepts and prohibitions wield the plow; those who give alms and kindness sow seeds; those who repent their sins wield the hoe; those who cultivate purity nurture flourishing sprouts; those who receive scriptures receive the rain’s blessing; those who establish fasts and vigils are like crops ripening in the field; those who perfect virtue and the Dao are like the harvest gathered.\n\nThose who propagate the Dharma, widely deliver gods and humans, rescue the living and the dead, relieve the destitute and distressed, and heal the sick are like those who open granaries to feed the poor, giving food to the hungry and drink to the thirsty, ensuring all are sated and none lack. So too does one attain blessings after reciting scriptures and repenting. This is called the field of blessings, the work of goodness. Thus, the merit of this scripture and this Dharma is supreme.\n\nWhen a ruler repents, heavenly disasters are dispelled; when a worthy minister repents, earthly harms vanish; when a compassionate father repents, his household knows no omens; when a filial son repents, misfortunes cease; when a benevolent elder brother repents, his family avoids calamity; when an obedient younger brother repents, his door knows no resentment; when an upright man repents, no slander arises; when a chaste woman repents, she safeguards her descendants; when a son repents, his household is harmonious; when a daughter repents, her marriage prospers; when a husband repents, he lacks nothing he needs; when a servant repents, they escape humiliation; when a Daoist repents, the Three Officials do not restrain them; when one cultivating nature repents, they transcend grain and face no peril; when one cultivating immortality repents, they ascend in broad daylight; when a householder repents, blessings cover their family; when a ruler repents, the nine provinces are at peace. The merit of repentance is lofty and weighty. The distinction between sin and blessing is clear—do you not understand?\"\n\nThe Heavenly Master bowed twice and addressed the Heavenly Worthy: \"The teachings and precepts are fully imparted; I now request permission to propagate them. Your servant, Dao Ling, wishes that all under heaven may open their hearts and awaken their minds, knowing to repent and thus escape their sins, bringing peace and joy to their families and nations, and attaining long life and enduring longevity. Your servant prays that the Heavenly Worthy, with the power of the Dao, may extend nourishment to those yet unreached, so they may know that doing good brings goodness, and creating blessings brings blessings—like planting the five grains, reaping a hundred-thousand-fold harvest. May those who have not yet repented be transformed; may those not yet delivered be rescued; may those not yet attaining the Dao ascend as immortals; may those not yet born live long lives.\"\n\nThe Most High Dao Lord replied to the Heavenly Master: \"Your words are excellent and essential! Transgressions and evils are the concerns of the mundane. The people of this world have long been distant from the sages, the great transformation has waned, the turbid *qi* thickens, wisdom is shallow, and they do not recognize fortune and misfortune. Deluded and confused, they do not awaken, blindly violating laws and incurring sins without knowing why. Thus, I expound scriptures and precepts to enlighten the unenlightened, teaching them to repent and remove their faults. The blind shall see clearly; the stubborn shall become gentle; misfortune shall turn to fortune, calamity to blessing. I guide them with the elixir of life, transform them with the true Dao.\n\nYet people know what they should not do and do it anyway, know what they should not pursue and pursue it nonetheless. They repent today and transgress tomorrow, their nature unchanged, their evils unceasing. Only when disaster strikes do they shut their doors; only when guilt is certain do they grow fearful; only when shackled do they seek release; only when bound do they hope for escape; only when gravely ill do they seek treatment; only when facing death do they long for life; only when *qi* is exhausted do they seek to replenish it; only when life is ending do they seek to prolong it. By then, Heaven cannot protect them, spirits cannot revive them, ghosts cannot restore them. Even if they encounter sages and divine beings, disasters will not disperse, illnesses will not be cured. Neither their Heavenly Father nor Heavenly Mother can extend their lives.\"\n\nTo build blessings, one must act before misfortune strikes; to accumulate merit and virtue, one must do so before transgressions sprout. It is like planting in spring to reap in autumn—plowing when hunger comes cannot relieve hunger, nor can digging a well when thirst arrives save one from sudden thirst. To dispel misfortune, nothing surpasses cultivating blessings; to accumulate merit, nothing surpasses cultivating the self. In cultivating blessings and the self, one must be diligent and earnest, for then the gates of the Dao and virtue will open of themselves, while the doors of calamity and evil will seal shut. Blessings will arise from all directions, and disasters will diminish across the nine yin realms.\n\nIf no good deeds are planted before misfortune arrives, then when life nears its end, one may exhaust all wealth and property, bow at the gates of masters, and prostrate before halls of virtue—how can one escape then? Though the August Heaven is high, its hearing is most low. Within every person’s body dwells a spirit that watches for transgressions, ascending and descending at all times to report one’s good and evil.\n\nOne hundred and twenty transgressions make a *ke*, and a *ke* brings frequent decline and little profit. One hundred and eighty transgressions make a *hao*, and a *hao* causes harm to the six livestock. Three hundred and sixty transgressions make a *lou*, and a *lou* brings the onset of illness. Five hundred and forty transgressions make a *xiong*, and a *xiong* causes muteness, paralysis, deafness, and blindness. One thousand and eighty transgressions make a *huo*, and a *huo* brings violent injury and death. One thousand two hundred transgressions make a *can*, and a *can* produces those who commit treason and rebellion. One thousand three hundred transgressions make a *jiu*, and a *jiu* cuts off descendants, leaving one without heirs. One thousand four hundred and forty transgressions make a *gao*, and a *gao* brings calamity flowing through five generations, binding one to great misfortune and chronic illness. One thousand six hundred and twenty transgressions make a *zhe*, and a *zhe* severs one’s lineage, leaving no posterity. One thousand eight hundred transgressions make a *huan*, and a *huan* reduces one to servitude, bringing ruin and chaos to the household. One thousand nine hundred and eighty transgressions make a *heng*, and a *heng* causes the birth of children afflicted with epilepsy, madness, and idiocy. Two thousand one hundred and sixty transgressions make a *bao*, and a *bao* brings rebellion within the family, where fathers and sons, brothers, attack one another; it gives rise to false shamans and demonic teachings, who falsely expound divine doctrines. Two thousand six hundred and ninety transgressions make a *zai*, and a *zai* causes incestuous strife among kin, producing offspring who are not true. Three thousand six hundred transgressions make a *yi*, and a *yi* brings blindness and deformity. Three thousand two hundred and forty transgressions make a *bian*, and a *bian* brings imprisonment, execution, and the extermination of one’s clan. Three thousand four hundred and twenty transgressions make a *guai*, and a *guai* reduces one’s family to beggary, where members are publicly executed, their corpses left unburied, their bones discarded, with none to gather them. Three thousand six hundred transgressions fill a *ke*, and when a *ke* is full, death is certain, and the soul drifts without anchor. Depending on the severity of the transgressions, one is consigned to the Three Paths and Five Sufferings, drowning in hardship, enduring pain and torment beyond endurance, to face judgment before the living.\n\nIf one is twenty or thirty years old and three *ke* are filled, one meets with violent injury; if fifty or sixty and three *ke* are filled, one meets the same fate. Those who die young due to transgressions bear the lingering faults of past lives; those who live out their years without encountering misfortune enjoy the lingering blessings of past lives. Thus, after accumulating virtue, residual blessings remain; after accumulating evil, residual misfortune lingers.\n\nIf one can repent of transgressions, Heaven takes note, reducing one’s *ke*. One act of repentance removes three *ke*; three acts of repentance remove nine *ke*. But if one continues to transgress without cease, the sentence of death is sealed. Therefore, those who wish to dispel disasters, disperse violence, treat illness, and cure disease must gradually, over months and years, reflect on their faults, take responsibility, and repent of their transgressions. If one can practice this with utmost sincerity, moved to fear and trembling, shedding tears and sweating with remorse, Heaven will know one’s sincerity, and the earth spirits will affirm one’s truth. Practicing for one day, the spirit that watches for transgressions removes one *ke*; for one hundred days, two *ke*; for one year, three *ke*; for three years, blessings will naturally follow. Without repentance, transgressions will daily increase, and misfortune will deepen. Minor transgressions harm only oneself; major ones flow to one’s descendants.\n\nGood men and good women who invite scripture masters to their homes, establish fasts and vigils, burn incense and practice the Dao, whether for a day and a night or three days and three nights, with diligent and earnest devotion, reciting this *Shengxuan* repentance text in the six periods of day and night, will move the true spirits of the various heavens to descend to their chambers. The dark offices will remove *ke*, and transgressions will be pardoned. Accumulated goodness is like dust upon a beam; accumulated evil is like smoke within a chimney. How can one not be cautious? How can one not be cautious?\n\nThe Heavenly Master bows his head, prostrates twice, and pledges to follow these teachings.\n\nThe Heavenly Master says: Those who have not received the *Fangsu* contract over the years may not wear this contract. Be cautious.\n\n**Inner Teachings: Rites for the Supreme Ascent to Heaven and Completion of the Contract**\n\nThe *Taishang Lingbao Shengxuan Inner Teachings: Proclamation of Precepts, Repentance of Sins, Protection of Life’s Conditions, and the Supreme Ascent to Heaven Completion Contract* is conferred upon those who have unified with the true. It is the comprehensive contract governing the three caverns and thirty-six thousand six hundred and sixty completion matters. The disciples He Tai, Ju Ningji, and others, in accordance with the regulations, present as offerings nine taels of gold, twelve taels of silver, five bolts of five-colored patterned silk, and twenty-four thousand cash in alms money. They come before the *Shengxuan* Master to receive and wear it, cultivating and practicing for years, experiencing numinous responses. The Three Primes of the true spirits settle and guard the cinnabar field; divine youths and jade maidens attend to the left and right. The transmission of the method qualifies one as an inner immortal of the *Shengxuan*.\n\nThe Daoist of [such-and-such] Prefecture, [such-and-such] County, [so-and-so], in the current year, month, and day of the Great Year, transmits this to the Daoist of [such-and-such] Abbey.\n\nHaving previously received the seventy-two-character covenant of plain silk, years have passed in sincere accumulation of merit and unwavering diligence. The myriad heavens are fully aware; the great sages bear witness. The names recorded in the Three Bureaus of the dead have long since been erased. One is now prepared to ascend among the ranks of the *Shengxuan* immortals. In accordance with the method, receive and treasure this as a personal treasure, a vessel of grace to guide oneself. The Three Heavens serve as witnesses, the Nine Earths as pledges, the Nine Pledges as guarantors, and the divine spirits as sureties. Swear never to violate the regulations or transgress the precepts, nor to defy the law or breach the statutes. Should one commit an offense or lapse even once, the body shall be delivered to the Three Bureaus, death shall consign one to the lower ghosts, the human Dao shall be forever lost, and one shall be eternally bound in servitude. If one remains vigilant and faultless, one shall be destined for the celestial courts of the immortals, attaining the Dao in life and death, and freed from the earthly bureaus.\n\nAll is in accordance with the statutes of the *Lingbao Shengxuan Inner Teachings’ Supreme Covenant for Ascending to Heaven*.\n\nThe Heavenly Master declares: All Daoist scholars who study immortality must first receive the method of initial repentance. If they do not, their sins shall remain unresolved forever. All must repent of their transgressions, burn incense and make offerings to the *Shengxuan Inner Teachings’ Supreme Revered Scripture*, and wear the seventy-two-character plain silk covenant along with the supreme great thread. Only after years of cultivation may one obtain this supreme method of the *Ascension Covenant*. It is not to be transmitted to beginners. Should one violate the regulations or breach the covenant, one shall not be permitted to receive the scripture of initial repentance for *Shengxuan* disciples.\n\nYou who receive this scripture, be cautious, be most cautious.\n\nThe Heavenly Master declares: This *Graduation Covenant* must not be recklessly transmitted, nor should this scripture. Both require earnest practice. Only after refining oneself to completion and attaining a profound understanding of the Dao’s meaning, with unwavering faith and no doubt, may one perfect the Dao and eliminate transgressions. Only then shall this covenant and the scripture be entrusted to the disciple. If one’s heart does not comprehend, if one clings to personal views, harbors doubt in the center, or trusts in superficial appearances while forsaking true reality—such a person shall surely stumble into the hells as a lower ghost. One must not transmit the scriptures of celestial ascension to the vulgar or the walking corpses of the world. Thus, I admonish you. Be cautious, be most cautious.\n\nThe *Lower Scroll of the Most High Cavernous Mystery Numinous Treasure Scripture on Proclaiming Precepts, Confessing Transgressions, and Securing Protection* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上洞玄灵宝宣戒首悔众罪保护经 经名：太上洞玄灵宝宣戒首悔众罪保护经。 撰人不详，约出於南北期末。 从内容看，当系《升玄内教经》之缺卷。 原本三卷，缺上卷。 底本出处：《正统道藏》 洞真部戒律类。 上卷原缺 太上洞玄灵宝宣戒首悔众罪保护经卷中 太上道君曰：世俗之人从宿世以来所犯过恶，逮至己身，童蒙愚痴，不解道义，不知教法，不晓施行，不识逆顺，犯於天禁地忌、四时五行、阴阳柔刚、日月星辰、道德神明，上则不孝於天地、君王、父母、耆老尊长，下则所恶於臣子卑贱、蝖飞蠕动，积罪累过，结成千万殃考对逮，无穷尽时，亡算夺纪，不可胜数。 所犯过恶者，当以瞋恚怒罚、毒想怨恨为过，以反虏残病、阴贼酷暴为过，以伐杀克伤、毁败刑戮为过，以侵诈晻弱、轻侮服易为过，以佞媚憎爱、蛊谄诡人为过，以阴私妬忌、淫泆骄慢为过，以嗜酒酣饮、呕吐沈溺为过，以权势侵凌、唝嗃豪杰为过，以贪利谀谄、盗窃拾遗为过，以嗜得恶施、悭惜无济、劫死脱亡为过，以威胁智策、刺讥击切为过，以掘陵发冢、残尸露骨为过，以诳诈调谴、诬誷攻伐为过，以妄言讼斗、败乱迷误为过，以谤讪圣贤、评论毁誉为过，以纵极情欲、多态淫泆为过，以身纵恣细濡、口贪滋味为过，以言不择语、行不择道为过，以心不善想、目不择视为过，以耳 不择声、鼻不择香为过。 过恶如是者，为君则无以为仁，为臣则无以为忠，为吏则无以为平，为父则无以为慈，为子则无以为孝，为母则无以为爱，为兄则无以为悌，为弟则无以为顺，为友则无以为廉，为妇则无以为恭，为男则无以为良，为女则无以为贞，为师则无以为教，为徒则无以为敬，为上则无以为训，为下则无以为礼，为乡党则无以为让，为朋友则无以为信，为宗族则无以为和，为丈夫则无以为实，为奴婢则无以为勤，为修身则无以为益，为学道则无以为仙。 是故治国者不能致太平，治家者不能致其吉，治身者不能王其寿，治业者不能全其功。 是故道在广念，德爱苍生，恩及无外，润及无内； 应殒之人赐之更生，罪结之人听以首悔。 首悔之者，皆当言议送款，竭情写意，六斋十直，庚申甲子，八节本命，入室烧香，披陈愆犯，则罪无不原，过无不除，功无不积，德无不立，道无不感，仙无不成。 若不能依按斋直之日，但当请经供养。 建斋之时及朔望本命之日，至心丹苦，首悔所犯，则其功弥重，罪无不赦。 今以教子，勤心宗奉，则福田兴矣，业行立矣。 天师唯唯，伏受命旨。 太上道君曰：凡为百姓男子女人，帝王国主建斋行道，法师於高座上为转诵此首悔之文。 若不能谛诵者，当依灵宝斋法，坛内靖中随便安置，一时一日，乃至三日，逐物丰俭，贫富量之，金龙彩色，以镇十方。 若用科仪，当称斋主姓名、年纪、户口多少，令斋主再拜，稽百仰三，自搏伏地叩头。 法师当於高座为其诵悔过之文，首写主人存亡罪失，则功感诸天，罪灭九阴，福德归流，恩佑斯降，真气来下，存亡两散，人鬼俱解。 其功无量，仙道成就，魔王敬礼，门户清肃，鬼妖不忏，功德之大，莫复是胜。 今以授子，善宝之焉。 天师稽首，敬受教诫。",
      "translated_text": "**The Supreme Cavern Mystery Numinous Treasure Sutra of Proclaiming Precepts, Confessing Sins, and Invoking Protection**\n\n**Sutra Title:** *The Supreme Cavern Mystery Numinous Treasure Sutra of Proclaiming Precepts, Confessing Sins, and Invoking Protection*\n*Author unknown; likely composed toward the end of the Northern and Southern Dynasties. Based on its content, it appears to be a missing fascicle of the* **Scripture of Ascending the Mysteries and Inner Teachings***. Originally in three scrolls, the first is lost.*\n\n**Source Text:** *Daoist Canon of the Zhengtong Era, Dongzhen Section, Precepts and Disciplines Category.*\n\n**Middle Scroll of *The Supreme Cavern Mystery Numinous Treasure Sutra of Proclaiming Precepts, Confessing Sins, and Invoking Protection***\n\nThe Supreme Dao Lord spoke:\nFrom past lives to the present, the transgressions and evils committed by worldly people have accumulated upon their own bodies. In youthful ignorance and folly, they fail to comprehend the Dao/Way and its principles, unaware of teachings and disciplines, ignorant of proper conduct, and blind to the distinction between right and wrong. They violate the prohibitions of Heaven and the taboos of Earth, the four seasons and five phases, the interplay of yin and yang, the soft and the firm, the sun, moon, and stars, and the spirits of the Dao/Way and virtue/power. Above, they are unfilial toward Heaven and Earth, the sovereign, parents, elders, and revered superiors; below, they bring harm to subjects, inferiors, servants, and even the crawling and flying creatures. Their sins and transgressions amass, forming countless calamities and retributions that pursue them without end, cutting short their years and seizing their allotted spans, beyond reckoning.\n\nThe transgressions and evils they commit include:\n- Anger, wrath, and vengeful punishment as sins;\n- Cruelty, malice, and brutal oppression as sins;\n- Killing, wounding, destruction, and execution as sins;\n- Deception, exploitation of the weak, and contemptuous disregard as sins;\n- Flattery, partiality, sorcery, and deceit as sins;\n- Secret envy, lust, arrogance, and pride as sins;\n- Gluttony in drink, vomiting, and drowning in excess as sins;\n- Abuse of power, bullying, and intimidation of the noble as sins;\n- Greed, sycophancy, theft, and pilfering as sins;\n- Hoarding, stinginess, and failing to aid the dying as sins;\n- Coercion, scheming, mockery, and harsh criticism as sins;\n- Desecrating graves, exposing corpses, and scattering bones as sins;\n- Deception, slander, and malicious attacks as sins;\n- False accusations, quarrels, and spreading confusion as sins;\n- Slandering sages and worthies, and engaging in defamation as sins;\n- Indulging in excessive desires and lewdness as sins;\n- Self-indulgence in trivial pleasures and gluttony as sins;\n- Careless speech and reckless conduct as sins;\n- Impure thoughts and indiscriminate gazing as sins;\n- Indiscriminate listening and indiscriminate smelling as sins.\n\nThose who commit such evils:\n- As rulers, cannot embody benevolence;\n- As ministers, cannot embody loyalty;\n- As officials, cannot embody impartiality;\n- As fathers, cannot embody kindness;\n- As sons, cannot embody filial piety;\n- As mothers, cannot embody love;\n- As elder brothers, cannot embody fraternity;\n- As younger brothers, cannot embody deference;\n- As friends, cannot embody integrity;\n- As wives, cannot embody reverence;\n- As men, cannot embody goodness;\n- As women, cannot embody chastity;\n- As teachers, cannot embody instruction;\n- As disciples, cannot embody respect;\n- As superiors, cannot embody guidance;\n- As inferiors, cannot embody propriety;\n- As neighbors, cannot embody deference;\n- As companions, cannot embody trustworthiness;\n- As clansmen, cannot embody harmony;\n- As husbands, cannot embody sincerity;\n- As servants, cannot embody diligence;\n- In cultivating the self, cannot bring benefit;\n- In studying the Dao/Way, cannot attain immortality.\n\nThus:\n- Those who govern the state cannot achieve great peace;\n- Those who manage households cannot attain good fortune;\n- Those who cultivate the body cannot extend their lifespan;\n- Those who pursue their work cannot complete their tasks.\n\nTherefore, the Dao/Way encompasses boundless compassion, its virtue/power cherishes all beings, its grace extends without limit, and its blessings penetrate without end. To those on the verge of perishing, it grants rebirth; to those burdened by sin, it permits confession and repentance.\n\nThose who confess and repent must:\n- Sincerely express their remorse;\n- Fully disclose their transgressions;\n- Observe the Six Fasts and Ten Days of Abstinence;\n- Honor the Gengshen and Jiazi days, the eight solar terms, and their own birthdays;\n- Enter the chamber, burn incense, and openly confess their offenses.\n\nThus:\n- No sin will remain unforgiven;\n- No transgression will remain unabsolved;\n- No merit will fail to accumulate;\n- No virtue/power will fail to be established;\n- No resonance with the Dao/Way will fail to manifest;\n- No attainment of immortality will fail to be achieved.\n\nIf one cannot observe the designated days of fasting and abstinence, one should at least request the sutra and make offerings. During the establishment of the fast, on the first and fifteenth days of the lunar month, and on one’s birthday, with utmost sincerity and earnestness, one should confess one’s transgressions. The merit thus accrued will be even greater, and no sin will remain unforgiven.\n\nNow, I teach you this: devote yourself to reverent practice, and the field of blessings will flourish, and your karmic deeds will be established.\n\nThe Heavenly Master bowed deeply and respectfully received the instructions.\n\nThe Supreme Dao Lord spoke:\nAll people—men and women, emperors, kings, and lords—who establish fasts and practice the Dao/Way should have the Dharma Master recite this text of confession and repentance from the high seat. If one cannot recite it clearly, one should follow the ritual of the Numinous Treasure Fast, arranging the altar and oratory as convenient, for one day or up to three days, adjusting the offerings according to one’s means, whether rich or poor. Use golden dragons and colored silks to consecrate the ten directions.\n\nIf employing the ritual protocol:\n- State the name, age, and number of household members of the fast’s sponsor;\n- Have the sponsor bow twice, prostrate fully, and kowtow three times with hands clasped overhead, then strike the ground in full prostration.\n\nThe Dharma Master should then recite the text of confession from the high seat, first enumerating the sins of the sponsor’s living and deceased kin. Thus:\n- The merit will move the heavens;\n- Sins will be eradicated from the nine yin realms;\n- Blessings and virtue/power will flow back;\n- Grace and protection will descend;\n- True qi will descend;\n- Both the living and the dead will be liberated;\n- Humans and spirits alike will be released.\n\nThe merit is immeasurable; the Dao/Way of immortality will be accomplished. Demon kings will pay homage, households will be purified, ghosts and demons will not dare to intrude. No greater merit exists.\n\nNow, I transmit this to you; treasure it well.\n\nThe Heavenly Master bowed his head and respectfully received the teachings and admonitions.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1215,
      "start_sentence": 0,
      "end_sentence": 26,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.94937014579773,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\戒律类\\太上洞玄灵宝宣戒首悔众罪保护经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "真人曰：诵首悔之文，当作经音诵之。 第一再拜，稽首叩头，仰三自搏。 法师颂言： 上启太上无极大道、三宝尊神：州县乡里男女官，某乙行年、户口、若干人，今因斋次，披解上世宿罪重过，乞愿至真，愿降法泽，赐以大慈，原宥众生及今斋主先世九玄七祖，下及五服六亲。 或为人君、长吏，治行多违，政教不平，少公多私，苟贪财色，发赋不均，教人刺讥，访作盲文，伺察非辜，吹毛求瑕，多冒贩踞，店肆卖买，遏遮四路，割贱夺贵，农桑盛要，役夺时务，囚吉放凶，轻原祸恶，重刑福业，阿谀所亲，翦戮良贤，逐宠盛杰，残虐弱贱，放纵狼吏豺佐、虎将熊士，昼息夜饮，六畜暴死，蚕食百姓，侵克所统，赃负积兆，罪过累亿。 为君不贤，为臣不忠，为吏不廉，在公不清贞，在私不直方，忤乱正法，曲从其心，狂笔巧文，迷误视听。 受人贿货，纵死杀生。 或诱罪纳货，正笔不贷； 或恐惧无罪，强取宝物； 或篡弒叛逆，诛男略女，收婢摄奴，挝欧直正，鞭挞无罪，伤害无愆，伏诛无辜； 或劫抄虏掠，凌夺人物，七宝五彩、六畜孳牲； 或无辜动众，兴军战伐，驱令生民，投之死地，孤魂绝域，汗血涌流，尸鬼哀哀，丛林之侧，穷魂最最，九泉之下，生者称苦，怨声闻天，死者抱恨，讼诉九阴，冤对之交，考过相连； 或攻伐国家，残酷无端； 或弋猎众生，殒杀含气，飞鹰走犬，食啖其肉，殒胎剥卵，罗藏网匿，荡射缴刺，恶心凶意，不仁不义； 或酴酒漏腐，毒饵内药，劝人食之，五心内烂，危没人命； 或因恃贵高，自怙富室，自方云日，欺薄伦类，寄意霄外，愚谓贵富，长久历世，毁诟至真，疑笑道士，调弄真人，自伐本根。 京罪兆过，不可复胜。 诸如此等，死受罪对，殃流后世，致使凡夫仕宦不迁，为居衰贫，口数耗臧，疾病流连； 或胤息不保，男女夭年，产业隙微，不系祖先，先缘不丰，不免饥寒。 凡百无可言宣失次，皆由所犯过恶如是。 今为存亡悔之。 伏愿天尊唯垂原除。 第二又再拜，稽首叩头，仰三自搏。 法师颂言： 上启太上无极大道、三宝尊神，原恕施主先世以来，下及见身，自识事以来，实多恶少善，多逆少顺，违天负地，触迕星辰，为臣不能忠於君上，为子不能孝於父母，为妇不能恭於舅姑，为弟妹不能顺於兄姊。 既以为人，不能有慈爱之心、仁笃之行，狼戾偏党，瞋喜无常。 六斋吉日，忤犯玄司。 当其所爱，欲令其生； 值其所憎，故令其死。",
      "translated_text": "The Perfected One said: When reciting the initial text of confession, it should be chanted in the tone of scripture.\n\nFirst, the sponsor bows twice, prostrates with head touching the ground, and strikes the earth three times with forehead. The Dharma Master intones:\n\nTo the Most High, Boundless Dao/Way, and the Three Treasures, the revered deities: In such-and-such prefecture, county, village, and hamlet, the man or woman official [Name], aged [X], with [X] household members, now during this retreat, lays bare and resolves the heavy transgressions of past lives. Humbly beseeching the Perfectly True, may they bestow the grace of the Dharma, grant great compassion, and pardon all sentient beings—along with the sponsor’s ancestors through nine generations and seven lineages, extending to the five degrees of mourning and six relations.\n\nWhether as ruler or high official, they may have governed with frequent transgressions, policies unjust and uneven, favoring private over public, greedily coveting wealth and beauty, levying taxes inequitably, inciting slander, fabricating false documents, spying on the innocent, nitpicking faults, engaging in excessive trade and profiteering, blocking the four roads, manipulating prices, disrupting agriculture and sericulture, seizing labor at critical times, imprisoning the virtuous while releasing the wicked, lightly pardoning evil while heavily punishing good, flattering favorites, slaughtering the worthy, exalting the favored while oppressing the weak, unleashing rapacious officials, jackal-like aides, tiger-like generals, and bear-like soldiers—idling by day and feasting by night, causing livestock to die violently, devouring the people, extorting those under their rule, amassing illicit wealth beyond measure, sins and transgressions piled high as mountains.\n\nAs rulers, they were unworthy; as ministers, disloyal; as officials, corrupt; in public office, impure and unchaste; in private, crooked and unprincipled. They defied and disrupted the true Dharma, following their own whims, crafting deceitful documents, misleading the eyes and ears of others. Accepting bribes, they released the guilty and killed the innocent. They extorted goods under false charges, coerced the innocent into surrendering treasures, usurped thrones, murdered rulers, abducted men and women, enslaved maidservants and bondservants, beat and flogged the upright, whipped the blameless, harmed the guiltless, executed the innocent. They plundered and pillaged, seizing people and property—seven treasures, five silks, livestock, and breeding animals. Without cause, they mobilized armies, waging war, driving the people to their deaths, leaving souls stranded in desolate lands, blood and sweat flowing like rivers, corpses and ghosts wailing in the wilderness, starving spirits in the deepest misery, in the nine springs below. The living cried out in suffering, their grievances reaching heaven; the dead held bitter grudges, lodging complaints in the nine yin realms. Vengeance and retribution intertwined, trials and transgressions linked endlessly. They attacked and ravaged nations without reason, hunted and slaughtered living beings, killing those with breath, flying hawks and running hounds devouring their flesh, destroying fetuses and stripping eggs, trapping and netting creatures, shooting and stabbing with cruel intent, hearts filled with malice, devoid of benevolence and righteousness. They brewed poisoned wine, spoiled food, and toxic concoctions, urging others to consume them, rotting their organs and ending lives. Relying on their noble status or wealthy households, they compared themselves to the sun and clouds, belittling their peers, setting their ambitions beyond the heavens, foolishly believing in the permanence of wealth and rank, slandering the Perfected, doubting and mocking Daoist masters, ridiculing the true adepts, severing their own roots. Such capital crimes and countless transgressions cannot be fully enumerated.\n\nAll these and the like bring retribution in death, calamities flowing to later generations, causing the common folk to stagnate in office, dwell in decline and poverty, suffer constant losses, endure lingering illnesses. Their descendants may not survive, sons and daughters dying young, family estates dwindling, disconnected from their ancestors, lacking ancestral blessings, unable to escape hunger and cold. All these countless misfortunes arise from such transgressions.\n\nNow, on behalf of the living and the dead, we repent. Humbly we pray the Heavenly Worthy to grant forgiveness and absolution.\n\nSecond, the sponsor bows twice again, prostrates with head touching the ground, and strikes the earth three times with forehead. The Dharma Master intones:\n\nTo the Most High, Boundless Dao/Way, and the Three Treasures, the revered deities: May they pardon the sponsor’s ancestors from past generations down to the present, and from the time of self-awareness to now—truly, they have committed many evils and few good deeds, been rebellious and seldom compliant, defied heaven and betrayed earth, offended the stars. As ministers, they failed to be loyal to their rulers; as children, unfilial to their parents; as wives, disrespectful to their parents-in-law; as younger siblings, disobedient to their elder brothers and sisters. Though born human, they lacked compassionate hearts and benevolent conduct, were perverse and partisan, their anger and joy inconstant. On the six fast days and auspicious occasions, they violated the decrees of the Mysterious Bureau.\n\nToward those they loved, they wished life; toward those they hated, they wished death.",
      "overlap_context": "- Grace and protection will descend;\n- True qi will descend;\n- Both the living and the dead will be liberated;\n- Humans and spirits alike will be released.\n\nThe merit is immeasurable; the Dao/Way of immortality will be accomplished. Demon kings will pay homage, households will be purified, ghosts and demons will not dare to intrude. No greater merit exists.\n\nNow, I transmit this to you; treasure it well.\n\nThe Heavenly Master bowed his head and respectfully received the teachings and admonitions.",
      "start_char": 1215,
      "end_char": 2150,
      "start_sentence": 27,
      "end_sentence": 55,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.79843783378601,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\戒律类\\太上洞玄灵宝宣戒首悔众罪保护经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "挝悍无为，骂詈冲口，苟欲自可，贪味饕美。 大小错互，家无法度。 背德向色，游好傲荡。 凌孤欺寡，取非其有。 心意奢逸，言行骄慢。 凡所施为，动有罪俱。 不畏鬼神，不忌科戒，不虑祸恶，不量进退，不避禁忌，不从仁义，悭贪嗜得，无以为施。 责望人报，喜作窃盗。 人中欺劫，公行曲枉。 图人利益，常戏笑人。 取人长钱，与人短数，轻秤小斗，狭幅短度； 强持与人，重秤大斗，专以取人。 假托形势，言则因官； 自恃凶黠，谄诳迷愚； 心实不清，千真唤神。 掘陵发冢，攻劫死魂。 诈绐借贷，取非其财，衣非其衣，食非其食，饮非其饮，盗人六畜，五果杂菜，五谷桑竹，枝茂树木。 贪鄙之性，罪彰神明； 动静所为，违科犯律。 莫大之罪，克书右司。 致令凡家营生不利，屡有变怪，贫贱困苦，孤微冻陋，数有亡遗，大小不和，更相怨恚，强健者少，病苦者多，皆由所犯过恶如是。 今故为存亡悔之，伏愿天尊唯垂原除。 第三又再拜，稽首叩头，仰三自搏。 法师颂言： 上启太上无极大道、三宝尊神，愿降大慈，削除臣等先世殃考，逮及今身罪婴，自有识以来，实夫妻不能相承善事，反变恶态，既无清洁之志，心嫉意妬，隐切争讼，更相憎忌。 呵男骂女，打厉奴婢，咄宾叱客，绝交邻里，乡党不信，骨肉不睦，六亲不和，九族不笃，系怒六畜，瞋疑妻妾。 悦和奸朋，嘻同切友，安偷容劫，知情群凶。 专作咒诅，阴为残害； 容媚蛊祷，外善内恶； 嫉贤妬能，壅塞高才，毁訾英贤，折辱良善，污染清洁，瑕秽端白。 咀人之豪，憎人之富。 心常狙獭，意怀凶恶，舌如锥刀，口含毒螫，不仁不义，无礼无忠。 自以为是，谓他为非，自矜自夸，自是自大。 积年积岁，不能自知。 诈欺慢诞，诬调返说，无诚无信，指南作北，戾东为西，调戏父母，殆折师君，不避亲疏，不忌所尊，岐咽两舌，斗乱奸恶，阿言谀语，常有争欺。 治生贩卖，专为诳巧，校计铢两，持长作短，以丑易好，求欲无厌。 公行不轨，私侵忠良，轻易四大，污秽三光，放痴卑贱，驰逐豪强。 其心戚戚，其意促促。 千愆积於四司，万过书於五帝，积岁累月，不可称数。 致使凡家常致撼轲，所为不谐，学法不聪，仙道不成，流俗所笑，口舌妄生，祸变累仍，众庶所憎，长吏所欺。 凡百无吉，皆由所犯过恶如是。 今为存亡悔之，伏愿天尊唯垂源除。 第四又再拜，稽首叩头，仰三自搏。 法师颂曰： 上启太上无极大道、三宝尊神，愿舍慈恩，愿赦斋主先世，爰及今身，自有知以来，实无功受禄，无德受赏。 不能作善，笑人作善； 不能受化，谤讪圣教。",
      "translated_text": "Beating and bullying without cause, cursing and reviling without restraint, acting solely to please themselves, gluttonous for fine flavors. Errors great and small intertwined, households devoid of rules and order. Turning from virtue toward lust, indulging in frivolity and arrogance. Bullying the orphaned and cheating the widowed, seizing what is not theirs. Hearts given to extravagance and ease, words and deeds marked by arrogance and contempt. In all they undertook, each action bore the weight of transgression. Unafraid of spirits and gods, heedless of precepts and prohibitions, unmindful of calamity and evil, reckless in advance and retreat, disregarding taboos and prohibitions, forsaking benevolence and righteousness, miserly and covetous, never giving alms. Demanding repayment from others, delighting in theft and robbery. Deceiving and extorting among their peers, practicing injustice and perversion in public. Scheming to profit from others, constantly mocking and deriding them. Borrowing money long-term while repaying short, using light scales and small measures, narrow cloth and short rods; forcing heavy scales and large measures upon others, monopolizing their gains. Exploiting power and influence, invoking official authority in their speech; relying on cunning and malice, flattering and deceiving to mislead the foolish; their hearts far from pure, yet invoking gods with false sincerity. Desecrating tombs and plundering graves, assaulting and robbing the dead. Fraudulently borrowing and lending, taking wealth not rightfully theirs, wearing clothes not theirs to wear, eating food not theirs to eat, drinking drink not theirs to drink, stealing others’ livestock, fruits, vegetables, grains, mulberry trees, bamboo, and thriving trees. Their avaricious and base nature, sins manifest before the divine; in all their movements and deeds, violating statutes and transgressing laws. The gravest of sins, recorded by the Right Bureau. Thus causing their households’ livelihoods to falter, frequent strange occurrences, poverty, hardship, destitution, and squalor, repeated losses, discord among family, mutual resentment and anger, few in good health, many afflicted by illness—all stemming from the transgressions and evils committed thus. Now, therefore, they repent for both the living and the dead, humbly beseeching the Heavenly Worthy to grant forgiveness and absolution.\n\nThirdly, bowing again, prostrating and kowtowing, raising their hands thrice to strike their chests.\n\nThe Dharma Master intoned:\nTo the Most High and Boundless Dao, the Three Treasures and Venerable Deities, we humbly pray: may Your great compassion descend, erasing the karmic afflictions of our ancestors and the sins binding us in this present life, from the time of self-awareness to now. Truly, husband and wife failed to uphold good conduct toward one another, instead transforming into wickedness. Lacking pure and upright intentions, their hearts filled with jealousy and envy, harboring hidden grievances and disputes, mutual hatred and resentment. Scolding sons and cursing daughters, beating and abusing servants and maids, berating guests and rebuking visitors, severing ties with neighbors, distrusted by their village and community, discord with kin, estrangement from relatives, disharmony among the six relations, disloyalty among the nine clans, venting anger upon livestock, harboring suspicion toward wives and concubines. Delighting in deceitful friends, reveling in wicked companions, secretly stealing and openly robbing, colluding with villains. Specializing in curses and hexes, covertly inflicting harm; flattering and bewitching, outwardly kind but inwardly evil; envying the worthy and resenting the capable, suppressing talent, slandering the virtuous, humiliating the good, defiling the pure, staining the unsullied. Biting at others’ excellence, resenting others’ wealth. Their hearts like cunning otters, their minds harboring malice, tongues sharp as daggers, mouths filled with venom. Devoid of benevolence and righteousness, lacking propriety and loyalty. Insisting on their own rightness, condemning others as wrong; self-conceited and boastful, self-righteous and arrogant. Year after year, unable to recognize their own faults. Deceitful and insolent, slanderous and contradictory, lacking sincerity and trustworthiness, pointing south while calling it north, twisting east into west, mocking parents, defying teachers and lords, disregarding close and distant relations, showing no reverence for the honored, sowing discord with forked tongues, inciting strife and wickedness, flattering with honeyed words, constantly quarreling and deceiving. In trade and commerce, specializing in fraud and trickery, nitpicking over ounces and grains, turning long into short, exchanging the fine for the coarse, insatiable in their desires. Publicly acting lawlessly, privately encroaching upon the loyal and good, belittling the four great elements, defiling the three luminaries, indulging in folly and baseness, chasing after the powerful. Their hearts anxious, their minds restless. Thousands of transgressions recorded by the Four Bureaus, myriad offenses inscribed by the Five Emperors, accumulating over months and years, beyond count. Thus causing their households to suffer constant misfortune, their endeavors to fail, their studies of the Dao to lack clarity, their pursuit of immortality to bear no fruit, mocked by the common crowd, beset by groundless slander, calamities recurring, despised by the multitude, deceived by officials. All fortune eludes them—all due to the transgressions and evils committed thus. Now, they repent for both the living and the dead, humbly beseeching the Heavenly Worthy to grant forgiveness and absolution.\n\nFourthly, bowing again, prostrating and kowtowing, raising their hands thrice to strike their chests.\n\nThe Dharma Master intoned:\nTo the Most High and Boundless Dao, the Three Treasures and Venerable Deities, we humbly pray: may Your merciful grace descend, may You pardon the sins of the sponsor’s ancestors and this present life, from the time of self-awareness to now. Truly, they received emoluments without merit, rewards without virtue. Unable to perform good deeds, they mocked those who did; unable to accept transformation, they slandered the sacred teachings.",
      "overlap_context": "l to their rulers; as children, unfilial to their parents; as wives, disrespectful to their parents-in-law; as younger siblings, disobedient to their elder brothers and sisters. Though born human, they lacked compassionate hearts and benevolent conduct, were perverse and partisan, their anger and joy inconstant. On the six fast days and auspicious occasions, they violated the decrees of the Mysterious Bureau.\n\nToward those they loved, they wished life; toward those they hated, they wished death.",
      "start_char": 2150,
      "end_char": 3143,
      "start_sentence": 56,
      "end_sentence": 102,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.80962109565735,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\戒律类\\太上洞玄灵宝宣戒首悔众罪保护经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "窃盗经书，轻秽圣贤，背毁反逆，叛道入邪，败坏成功，快纵逐非。 见人谬失，心口刺讥。 见贤人而怀瞋，觌高才而生嫉。 爱滥夫，憎美士，好他之恶，耻彼之善。 不信作恶得恶，作罪得罪，不知可改故作不休，知不可犯故犯不止。 借不念归，贷不念偿，轻亏穷乏，说谴愚痴。 教人作恶，劝人为非。 居贫窭宝，不能自责，但行怨望，强欲他物。 得便欢喜，失便忿怒。 泄其恶心，伺便系人。 阴司污秽，身不清洁，裸形夜起，忤逆星辰，呵风骂雨，不敬神灵，耗乱阴阳，憭悷五行。 灭人自益，危人自安； 说人之功，为己之名。 所为无可，所作不当。 轻老易小，骄慢纵横。 外不良谨，内不慈仁。 别人九族； 离人六亲； 南人之父，北人之子，东人之夫，西人之妇； 乖人之男，隔人之女。 教人堕胎，导人落子，唯存杀害，不重人命。 心有所恨，烧香启神，妄祷百鬼，呼天唤地。 三光神祇，咒令其死，诅令其亡，凶心不善，恒生毒念。 想人妇女，忆人精华。 愿念所存，思合奸猾。 不建於功德，又无施与之心。 或学阙明师，习无正轨，口衔草木，心怀沙石。 或自恃其年高，竟弗就於大训，身无一戒，妄称三洞。 或为女人形服，臭秽不能清洁，滥沾尊位道场，心攀色境。 或见人贫悴孤弱，倍生憍侮欺诞。 或饮酒昏醉，猖狂迷闷，非法妄言，干知天时，幻惑无度。 或入宫观，不拜经像。 或与俗人交涉野合，密行情欲，为四司所奏，无善之功； 五帝所纠，有辜之衅。 致使生缘穷悸，触事不昌，恒婴否顿，数遇危难，多愁不乐，怀忧而行，积年无欢，历岁无泰，心暗意塞，智虑幅蒙，儜积冥昧，六情不启，义理不通，所愿不果，所求不得，营事不成，仕宦不进，生业不登，宅舍不安，大小祸患，学问不达，修道不仙，皆由所犯过恶如是。 今为凡夫存亡悔之。 伏愿天尊唯垂原除。",
      "translated_text": "Those who secretly steal scriptures, treat the sacred and the worthy with disdain and defilement, turn their backs in betrayal and rebellion, forsake the Dao to embrace heresy, undermine and destroy achievements, indulge in wrongdoing and chase after transgressions. Seeing others’ faults, they pierce with words and mock with speech. Encountering the virtuous, they harbor resentment; facing the talented, they breed jealousy. They favor the depraved, despise the noble, delight in others’ vices, and shame others’ virtues. They do not believe that evil begets evil, that sin begets retribution; knowing they should reform, they persist unceasingly; knowing they should not transgress, they never cease. Borrowing without thought of repayment, lending without intent to reclaim, they lightly harm the poor and destitute, slandering the foolish and ignorant. They teach others to do evil, urge them toward wrongdoing. Though dwelling in poverty and hardship, they do not blame themselves but instead nurse grievances, coveting what belongs to others. Gaining advantage brings joy; losing it sparks fury. They vent their malice, waiting to ensnare others at the first opportunity. In the unseen realm, their bodies remain unclean, rising naked at night, offending the stars, cursing wind and rain, disrespecting the divine, disrupting yin and yang, and disturbing the five phases. They harm others to benefit themselves, endanger others to secure their own safety; they claim others’ merits as their own, turning others’ achievements into their own fame. Their actions are indefensible, their deeds improper. They belittle the elderly and slight the young, arrogant and reckless in their conduct. Outwardly, they lack propriety; inwardly, they lack kindness and benevolence. They sever others’ nine clans, estrange others’ six relations; they turn a southerner’s father into a stranger, a northerner’s child into an orphan, an easterner’s husband into a widower, a westerner’s wife into a widow; they separate men from their sons, isolate women from their daughters. They teach others to abort, guide others to miscarry, valuing only killing and harm, holding no reverence for life. Harboring resentment, they burn incense and invoke the gods, recklessly praying to a hundred ghosts, calling to heaven and earth. They curse the deities of the Three Luminaries, wishing death upon others, invoking ruin, their hearts unkind, ever nurturing venomous thoughts. They lust after others’ wives, covet others’ essence. Their desires and thoughts dwell on deceit and treachery. They build no merit, harbor no intent to give. Some study without a radiant teacher, practice without proper guidance, their mouths filled with grass and wood, their hearts with sand and stone. Some, relying on their age, refuse the great teachings, their bodies devoid of even one precept, yet falsely claim mastery of the Three Caverns. Some, in women’s attire, remain unclean and defiled, usurping sacred ranks and altars, their minds clinging to sensual realms. Seeing the poor, the wretched, the orphaned, and the weak, they double their arrogance, mockery, deceit, and contempt. Some drink to drunkenness, raving and lost in confusion, speaking lawlessly, defying the rhythms of heaven, deluded without measure. Some enter temples yet refuse to bow to scriptures and images. Some consort with the secular, engaging in illicit unions, secretly indulging in desire, reported by the Four Controllers, devoid of virtuous merit; investigated by the Five Emperors, bearing guilt and offense. Thus, their life’s conditions dwindle, every endeavor falters, they constantly suffer misfortune, repeatedly encounter peril, mired in sorrow and joyless, walking with worry, accumulating years without happiness, passing seasons without peace. Their minds are darkened, their intentions blocked, their wisdom and judgment clouded, their faculties dull and obscured, the six senses unopened, principles of righteousness ungrasped. Their wishes go unfulfilled, their requests unanswered, their endeavors fail, their official careers stall, their livelihoods decline, their homes remain unsettled. Great and small calamities befall them; their studies do not advance, their cultivation does not lead to immortality—all due to the transgressions and evils committed thus. Now, for the sake of the living and the dead, they repent. Humbly beseeching the Heavenly Worthy to grant forgiveness and absolution.",
      "overlap_context": "s thrice to strike their chests.\n\nThe Dharma Master intoned:\nTo the Most High and Boundless Dao, the Three Treasures and Venerable Deities, we humbly pray: may Your merciful grace descend, may You pardon the sins of the sponsor’s ancestors and this present life, from the time of self-awareness to now. Truly, they received emoluments without merit, rewards without virtue. Unable to perform good deeds, they mocked those who did; unable to accept transformation, they slandered the sacred teachings.",
      "start_char": 3143,
      "end_char": 3839,
      "start_sentence": 103,
      "end_sentence": 139,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.71010422706604,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\戒律类\\太上洞玄灵宝宣戒首悔众罪保护经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "第五又再拜，稽首叩头，仰三自搏，法师颂言： 上启太上无极大道、元始天尊、三宝尊经，伏愿至真泻泽潜洒，原赦凡家九玄七世千曾亿祖、先亡后化、上世以来一切灵神，各由先身立行不仁，寿早永终，后生未长，不能具悉作何死亡。 或头痛额热，五内恍惚，身体冻冷，卧床而死。 或病苦积年，尪赢杖骨，历岁而死。 或毒治警嗽吐血，胀满症结，蛊毒鸩药，内烂而死。 或四肢浮肿，瘨痴瘫疽，流血疮脓，生虫结疮，疟癖变跛，腕节解落，筋脉朽绝而死。 或聋盲喑痖，七窍壅塞，便曲闭胀，谷水不通而死。 或风癫头痫，鬼魅狂荒，反眼吐舌，角弓捆张，牛呼羊昤，犬呻鸡鸣，投坑越谷，不避水火而死。 或临兵蹈刀，刀剑所斫，矛戟所刺，弓弩所射，割尸断头，形骸剥截而死。 或为蛇蝗蜂螫、鹰狸豺狼，龙虎牛马、犬猪啮嚼抵踏而死。 或登峻缘木，寻桥沈舟，乘马驾车，从高堕下，沈溺摧折而死。 或遭偷行偷，遭劫行劫，道路伏贼，斗变打捍，被敌路侧而死。 或被官私威势猛临而死。 或死非其乡，亡非其域，血流途道，膏腴草水，流寄他方，客旅而死。 或遭荒遇乱，绝粮饥饿，逢寒值热，乏渴而死。 或偏枯不仁，癞病恶疾，面目疮痍，鼻崩耳缺，弃逮穷乡，捐放边裔而死。 或为恶人所棒，粗夫所欧，皮肤胸心刀刺、尸伤、破骨肢节碎跌，目瞎齿折，五脏瘀热而死。 或被邪歹羊相逮，先殃、沙气相锺，厌鬼所杀，奄忽而死。 或吐血噎哽，痳痢赤白，内坚外结，尪萎而死。 或精液内漏，经脉不流，五劳七伤，颜黄白黧，手足痿疼，枯焦而死。 或遭罪致狱，临刑都市，伏法囚刑而死。 或伤胎落子，腥血而死。 或生男不育，生女不长，夭折昏盲，不睹日月而死。 或值雷电霹雳，而题脊书背，诛击而亡。 或水没火烧，木打石掷，土压淰漂而死。 或夜军行，提刀负弩，气棘力倦，劳苦而死。 诸如此等，虽为一死，而痛各异，皆由宿命因缘所致，随运而死。 既寿易衰，不以道理。 先身无福，不仁之罪，身谢三官，一旦沈坠，幽途魂魄，各受宿对，囚谪地狱、酆都、三官六府之中，悬头锁械，足立三刀，缘刀山，循剑树，食火啖炭，镬汤所煮，炎火所烧，吞冰饮毒，拔舌灌口，朝笞暮押，身体毁烂，形骸焦燎，魂爽酸楚，痛毒激切，已经三掠，难得解脱，哀哀长夜之中，劳劳饿鬼之群，愁苦三途之中，抱酷五苦之庭。 绵历数劫，罪对不赦。 希活则生途四塞，愿生则无缘可攀。 乞死不得，长沦罪原，永乖同泰，余殃不尽，引逮后生，恶恶相续，咎咎相缠。 致令愚俗述否相仍，仕宦不能致禄，营生不能饱暖，男女大小，忧苦无泰。 今为众生上世今世先亡后死，首悔斯苦，不仁之罪、不善之愆，元逆之过，违和负顺，迕天逆地，触忤灵神，轻犯科法，所行不轨，罪高山岳，过积海渊，致使先亡后死不以道理，千病万痛，十苦百疾，毒伤而亡，皆先身不仁之对。 特乞大慈赐以矜原，随亡者死时所由绝命之所，解脱穷魂，拔度苦魄，得远北酆、三官逮役，去免九幽，升上天堂。 浄鬼之林，无为之乡，断绝复连，利佑子孙，宅舍安吉，胤嗣完全； 凶神恶魔不得妄性，天覆地载，神明护助，学道得道，求仙得仙，富贵长保，安乐自然。",
      "translated_text": "Then, bowing again for the fifth time, he prostrates himself, knocking his head to the ground, raising his hands thrice to strike his own cheeks. The Dharma Master intones:\n\nSupplicating above to the Supreme, Boundless Dao, the Primordial Heavenly Worthy, and the Three Treasures of the Venerable Scriptures, we humbly pray that the Perfected Ones pour forth hidden blessings and grant absolution to the nine generations of ancestors and seven lineages of descendants, the thousandfold forebears and myriad progenitors, the departed and the newly deceased, all spirits from former lives to the present. Each, due to unkind deeds in past lives, met early ends, perishing before their time, their later lives unfulfilled—unable to know the manner of their deaths.\n\nSome died with splitting headaches and burning brows, their five viscera in turmoil, their bodies frozen cold, lying abed. Others suffered chronic illness, emaciated and skeletal, leaning on staffs for years before death. Some succumbed to poisonous treatments, racking coughs, and blood-vomiting, their bellies swollen with lumps, ravaged by toxins and lethal drafts, their insides rotting away. Others perished from limb-swelling, madness, ulcers, and festering sores, their flesh teeming with worms, their bodies wracked by malaria, deformities, and joint dislocations, their sinews withered and severed. Some died deaf, blind, mute, or dumb, their seven orifices blocked, their bowels and bladder obstructed, unable to take in food or water. Others fell to wind-induced epilepsy, head sores, demonic possession, or madness—rolling their eyes, sticking out their tongues, arching their backs in spasms, bellowing like oxen, bleating like sheep, whining like dogs, or crowing like roosters—plunging into ravines or leaping into flames, heedless of water or fire. Some met their end on battlefields, trampled by blades, pierced by spears and halberds, struck by arrows, their heads severed, their bodies hacked apart. Others were stung by snakes, wasps, or scorpions, mauled by eagles, wildcats, jackals, wolves, tigers, or dragons, or trampled and gored by oxen, horses, dogs, or boars. Some plunged from cliffs or trees, drowned in sinking boats, fell from horses or chariots, or tumbled from heights, crushed or drowned. Others were ambushed by thieves or bandits, slain in brawls or skirmishes, left to die by the roadside. Some perished under the weight of official or private tyranny. Others died far from home, their blood soaking the roads, their flesh nourishing the grasses and waters, their remains abandoned in foreign lands. Some starved in famines or wars, perishing from cold or heat, thirst or hunger. Others succumbed to paralysis, leprosy, or loathsome diseases, their faces and bodies disfigured, noses eroded, ears severed, cast aside in remote villages or exiled to distant frontiers. Some were beaten to death by villains or brutish men, their skin flayed, their chests and hearts pierced by blades, their bones shattered, their limbs broken, their eyes gouged, their teeth smashed, their five organs scorched by stagnant heat. Others were seized by malevolent spirits, struck by misfortunes or miasmic vapors, slain by vengeful ghosts, or snatched away in an instant. Some choked on blood or suffocated, succumbing to dysentery or wasting diseases, their insides hardened, their outsides knotted, their bodies withered. Others perished from seminal leakage, obstructed meridians, the five taxations and seven injuries, their complexions sallow, their limbs numb and aching, their bodies parched and withered. Some were imprisoned for crimes, executed in public squares, or died under judicial torture. Others died in childbirth, drenched in blood, or lost their infants—sons who never grew, daughters who never thrived, cut down in blindness or infancy, never beholding the sun or moon. Some were struck by lightning, their backs branded, their spines split. Others drowned in floods, burned in fires, crushed by falling trees or stones, buried under earth, or swept away by mudslides. Some perished on night marches, bearing swords and bows, their strength spent, their qi exhausted, collapsing from toil.\n\nThough all met a single death, their pains were manifold—each fate bound to karmic causes, their ends dictated by destiny. Life wanes swiftly, not by the Dao’s design. Devoid of past-life blessings, their unkindness brought this retribution. Their bodies surrendered to the Three Offices, their souls plunged in an instant, cast into the dark paths where each spirit faces its karmic adversary. Imprisoned in hells, Fengdu, the Three Offices, or the Six Bureaus, they are hung by their heads in shackles, made to stand on triple blades, climb mountains of knives, or walk forests of swords. They are fed fire and forced to eat coals, boiled in cauldrons, burned in flames, made to swallow ice and drink poison, their tongues torn out, their mouths force-fed, flogged by day and tortured by night. Their bodies are mutilated, their forms charred, their souls tormented by searing pain, their suffering unbearable. After three interrogations, escape is impossible. In the endless night, they wander among the wailing hungry ghosts, trapped in the sorrow of the Three Wretched Paths, enduring the agony of the Five Sufferings’ court. Their sins span countless kalpas, their offenses unforgiven.\n\nLonging for life, the paths of rebirth are barred; wishing for rebirth, no karmic ties remain. Death is denied, and they sink forever into the abyss of sin, forever severed from peace. Their lingering misfortunes extend to later lives, evil begetting evil, faults entangling faults. Thus, the foolish and the common suffer unending misfortune; officials cannot secure rank, livelihoods cannot bring warmth or fullness. Men and women, young and old, endure unceasing hardship.\n\nNow, for all beings—those departed in past lives and present, the newly deceased and the long-dead—we repent these sufferings, the sins of unkindness, the transgressions of wickedness, the offenses of rebellion, the violations of harmony, the defiance of heaven and earth, the offenses against spirits, the flouting of laws, and the deviance from the Dao. Their sins tower like mountains, their transgressions deep as the sea, causing the departed and the newly dead to perish without reason, afflicted by a thousand illnesses and ten thousand pains, a hundred torments and myriad ailments, dying from poisonous wounds—all retribution for past-life unkindness.\n\nWe beseech the Great Compassion to grant mercy and absolution. According to the manner of each departed soul’s death, may the trapped spirits be liberated, the suffering souls delivered. May they escape the clutches of Fengdu and the Three Offices, be freed from the Nine Hells, and ascend to the Heavenly Halls. May they dwell in the Forest of Pure Ghosts, the Land of Non-Action, severed from karmic ties, their blessings extended to descendants. May their homes be peaceful and auspicious, their lineages complete. May malevolent spirits and demons be restrained, heaven’s canopy and earth’s support safeguarded by divine protection. May those who study the Dao attain it; those who seek immortality achieve it. May wealth and honor be long preserved, and peace come naturally.",
      "overlap_context": " of righteousness ungrasped. Their wishes go unfulfilled, their requests unanswered, their endeavors fail, their official careers stall, their livelihoods decline, their homes remain unsettled. Great and small calamities befall them; their studies do not advance, their cultivation does not lead to immortality—all due to the transgressions and evils committed thus. Now, for the sake of the living and the dead, they repent. Humbly beseeching the Heavenly Worthy to grant forgiveness and absolution.",
      "start_char": 3840,
      "end_char": 5057,
      "start_sentence": 140,
      "end_sentence": 176,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.089680194854736,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\戒律类\\太上洞玄灵宝宣戒首悔众罪保护经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "於是主人再拜叩头，称受道恩。 太上洞玄灵宝宣戒首悔众罪保护经卷中竟 太上洞玄灵宝宣戒首悔众罪保护经卷下 太上道君告天师道陵曰：此首悔之法、《升玄品经》为道德之篱落，是至真之垣墙，生死之津乘，兆庶之桥梁，立身之福田，功业之渊场，养性之生途，修至真之仙方，解罪犯之大法，修行之首宗，极生之上善，拔死之第一，消灾之真科，散祸之秘术，安国之弘教，宁家之肃约，为学之智慧，希善之富博，治病之良方，救疾之善药，神明之枢机，万病之扁鹊。 无上至真，大道洪范，弘敷世教，济度无涯。 颂之解过，则千罪冰消，万过雪散；",
      "translated_text": "Thus the host bows twice and kowtows, declaring gratitude for the grace of the Dao.\n\nHere ends the *Supreme Cavernous Mystery Numinous Treasure Sutra of Proclaiming Precepts, Initiating Repentance, and Safeguarding from All Transgressions, Scroll the Middle*\nHere begins the *Supreme Cavernous Mystery Numinous Treasure Sutra of Proclaiming Precepts, Initiating Repentance, and Safeguarding from All Transgressions, Scroll the Lower*\n\nThe Supreme Dao Lord addressed Celestial Master Dao-ling, saying: This method of initiating repentance and the *Scripture of the Ascending Mystery* serve as the fence of the Dao and virtue, the ramparts of the Most Perfect, the ferry of life and death, the bridge for the multitudes, the field of blessings for establishing oneself, the deep pool of merit and achievement, the living path of nurturing one’s nature, the immortal formula for cultivating the Perfect Truth, the great dharma for dissolving transgressions, the foremost school of practice, the supreme goodness of ultimate life, the first means of delivering the dead, the true discipline for dispelling calamities, the secret art for dispersing misfortune, the grand teaching for pacifying the state, the solemn covenant for tranquilizing the household, the wisdom of learning, the boundless wealth of seeking goodness, the excellent remedy for curing illness, the virtuous medicine for healing disease, the pivot of divine luminosity, and the Bian Que of the ten thousand afflictions.\n\nThis peerless and most perfect great Dao, vast in its model, broadly disseminates the teaching of the world and delivers boundless beings. When its hymns dissolve transgressions, a thousand sins melt like ice, and ten thousand faults scatter like snow.",
      "overlap_context": "nd ascend to the Heavenly Halls. May they dwell in the Forest of Pure Ghosts, the Land of Non-Action, severed from karmic ties, their blessings extended to descendants. May their homes be peaceful and auspicious, their lineages complete. May malevolent spirits and demons be restrained, heaven’s canopy and earth’s support safeguarded by divine protection. May those who study the Dao attain it; those who seek immortality achieve it. May wealth and honor be long preserved, and peace come naturally.",
      "start_char": 5057,
      "end_char": 5310,
      "start_sentence": 177,
      "end_sentence": 182,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.09281849861145,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\戒律类\\太上洞玄灵宝宣戒首悔众罪保护经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "诵之救死，则苦魂冤魄永去荼炭。 解脱五苦，超拔八难，神登道舍净鬼之林。 上游玄都之墟，下晏昆阙之场。 存亡俱济，福利日昌。 诵之求一及，则殃流绝逮，宿咎消灭，生者获福，常处安吉。 死籍削除於右宫，生录注简於左契。 於是修经行道，长斋苦行，安神定志，丹诚念道，归心无上正真之庭，宗《升玄内教真经》无上统天毕契之录，佩身为宝，则坐待云驾，超腾太空，上谒虚皇，逍遥玉京。 子当宝秘，依法施行，建功灭过，如响应声。 修善祸自殄，建功福自生，譬如鉴镜，曲直随形。 奉法当尽心，敬师当竭诚； 心尽神明知，谒诚至理精。 如此不懈怠，升仙克长生。 叮咛告万兆，汝当宣是经。 是经众法祖，无上之至灵。 供养必得道，控云登玉清。 妙哉至真文，宗者善敬听。 太上道君告天师曰：若有贤男子，及有善妇女，欲修身奉法，专心持戒，营生求仙，好道乐经，改心易行，返悔过恶，丹苦一意，至诚无疑，欲求长生老寿，神仙度世，脱灾免苦，去离患难，轮转善场，常与福俱，生则安乐，死则蝉蜕，学道得道，白日升天，存亡终始，齐光日月，解脱忧苦，常怀欢悦。 所作过恶，皆当悔之。 悔过之法，当尽轮诚，一切归实，不当隐蔽，益子之罪。 天师唯唯，敬受戒言。 太上道君告天师曰：善男子，善女人，若欲长为种民，保寿延年，千载之后，身能变化，长处神州，不迁荒域，常在有道之国，恒生孝慈之门，不堕无德之处，不生边国之乡，去离痛痒，与福相传，与善相随，不与禽兽同类，不与恶鬼为隶，容姿丽好，身无痴瘦，聪明洞彻，慧为智宗者，存亡所犯千罪万过，皆当悔之。 一切归实，不当隐蔽，益子之罪。 天师唯唯，敬受戒言。 太上道君告天师：善男子，善女人，若欲治病疗疾，消灾拔命，救死护生，处世无忧，所为即成，所愿即至，宅舍清隐，田蚕倍收，兴生有利，为众所爱，长吏所敬，子孙昌炽，富贵荣显，无不获吉，无不安宁，所愿从心，所念顺志，修经求道，愿见真君者，所犯过恶，皆当悔之。 悔过之法，唯在款实，遣情送心，必令上闻，虚皇道眼，自鉴尔心。 有隐益罪，道不虚言。 天师唯唯，敬受戒言。 太上道君告天师曰：善男子，善女人，若欲知宿世之所在，存亡之苦乐，欲得知为善得善，种福得福，树恩施惠，立功补过，忆识宿命之所行，非及我身，觉悟罪福善恶之对，知有今身从先身来，转生入死，轮死入生，因其所因，因不绝因； 缘其所缘，缘不绝缘，得有今日立我之身。 忆知此已，思建善业，唯恐我身更受后身，不得如今而我此身，又恐此身后生之所不得明识，或失人道，不如今身。 唯恃今身广作福田。 能如是者，得愿如此。 若欲不复贫穷下贱，欲不复孤寡衰微，欲不复寒冻饥饿，欲不复乞丐卖煦，欲不复灾害病患，欲不复耳聋目暝，欲不复痴愚邪见，欲不复枉遭县官，欲不复为奴婢倅侍，欲不复谗谀所横，欲长与圣贤相遇，欲与明师宝经相连，欲与真人、仙人相逢，欲与善人、福人、德人教训相值，欲令仙道成就者，所犯过恶，皆当悔之。 悔过之法，皆当丹尽，委曲首谢，不得藏重首轻，益子之罪。 科威严峻，道不虚言。 天师唯唯，敬受戒言。",
      "translated_text": "Reciting it saves the dead, and suffering souls and wronged spirits forever depart from the fires of torment. It liberates from the five sufferings, transcends the eight difficulties, and spirits ascend to the pure groves of the Dao’s abode. Above, they wander the precincts of the Mysterious Capital; below, they repose in the courts of Kunlun. Both the living and the dead are delivered, and blessings and benefits flourish day by day.\n\nWhen one recites it seeking even a single blessing, misfortunes cease to pursue, old transgressions vanish, the living gain fortune, and one constantly dwells in peace and felicity. The register of death is erased from the right palace, and the record of life is inscribed upon the left contract. Thus, one cultivates the scripture and practices the Dao, observes long fasts and austere disciplines, calms the spirit and steadies the mind, with single-hearted sincerity contemplates the Dao, and turns one’s heart to the court of the supreme and perfectly true. One venerates the *Sutra of the Ascending Mystery and Inner Teaching of the True Scripture*, the supreme register that fully accords with Heaven. Wearing it as a treasure upon the body, one awaits the cloud-borne chariot, soaring through the great void to ascend and meet the August Sovereign of Emptiness, carefree in the Jade Capital.\n\nYou must treasure and keep it secret, practice it according to the method, establish merit and eradicate transgressions, as echo answers sound. Cultivating goodness, misfortune naturally perishes; establishing merit, fortune naturally arises—like a mirror, the crooked and straight follow the form. In upholding the method, one must give one’s whole heart; in revering the master, one must offer utmost sincerity. When the heart is fully given, the divine and luminous know; when sincerity reaches its essence, the ultimate truth is refined. Thus, without laxity, one ascends as an immortal and attains long life.\n\nWith earnest admonition, I declare this to the myriad beings: you must proclaim this scripture. This scripture is the ancestor of all methods, the supreme and most numinous. Those who make offerings to it will surely attain the Dao, ride the clouds, and ascend to the Jade Purity. Wondrous indeed is this scripture of the perfect and true—those who venerate it, listen with reverence.\n\nThe Most High Lord of the Dao addressed the Heavenly Master, saying: If there are worthy men and good women who wish to cultivate themselves and uphold the method, focus their minds on observing the precepts, seek life and pursue immortality, delight in the Dao and love the scriptures, reform their hearts and change their conduct, repent their transgressions and evils, with single-minded sincerity and unwavering faith, desiring long life and old age, transcendence by immortals, deliverance from disaster and suffering, escape from calamities and hardships, turning the wheel toward the fields of goodness, constantly accompanied by fortune—living in peace and joy, dying in transformation like the cicada’s molt, learning the Dao and attaining the Dao, ascending to heaven in broad daylight, equal in glory to the sun and moon from beginning to end, liberated from sorrow and suffering, ever filled with joy—all past transgressions must be repented. The method of repentance requires utmost sincerity, complete honesty, and no concealment, which would only increase one’s sins.\n\nThe Heavenly Master assented reverently and received the precepts.\n\nThe Most High Lord of the Dao addressed the Heavenly Master, saying: Good men and good women, if you wish to remain forever among the seed-people, preserve life and extend years, after a thousand years transform your bodies, dwell long in the divine lands, not migrating to desolate regions, always abiding in countries of the Dao, ever born into gates of filial piety and kindness, not falling into places devoid of virtue, not born in frontier lands, departing from pain and distress, transmitting fortune and following goodness, not belonging to the same kind as birds and beasts, not serving as slaves to evil spirits, possessing lovely countenance and form, free from foolishness and emaciation, keen and penetrating in wisdom, with insight as the foundation of intelligence—all past transgressions of a thousand sins and ten thousand faults must be repented. All must be honestly confessed, with no concealment, which would only increase one’s sins.\n\nThe Heavenly Master assented reverently and received the precepts.\n\nThe Most High Lord of the Dao addressed the Heavenly Master, saying: Good men and good women, if you wish to cure illness and heal disease, dispel calamities and rescue fate, save the dying and protect the living, live in the world without sorrow, accomplish what you undertake, fulfill your wishes, dwell in pure and secluded abodes, double the harvest of fields and silkworms, prosper in livelihood, be loved by the multitude, respected by high officials, with flourishing descendants, wealth, honor, and glory, attaining all that is auspicious, all that is peaceful, with every wish fulfilled and every thought realized, cultivating the scriptures and seeking the Dao, desiring to behold the True Lord—all past transgressions must be repented. The method of repentance lies solely in sincerity and honesty, sending forth the heart’s emotions, ensuring they ascend to be heard. The Dao-eye of the August Sovereign naturally reflects your heart. Concealment increases sin; the Dao does not speak in vain.\n\nThe Heavenly Master assented reverently and received the precepts.\n\nThe Most High Lord of the Dao addressed the Heavenly Master, saying: Good men and good women, if you wish to know your past lives’ abodes, the suffering and joy of the living and the dead, to understand that doing good brings good, planting fortune brings fortune, establishing kindness and bestowing favors, building merit and amending faults, recalling the deeds of past lives not limited to this body, awakening to the correspondence of sin and fortune, good and evil, knowing that this present body comes from a former body, turning from life to death, from death to life, following the causes that arise, causes unbroken; following the conditions that arise, conditions unsevered, thus attaining the present and establishing this body—once you recall this, think to establish good karma, fearing that this body may receive another body in the future, not attaining what this body now has, and fearing that after this body, the next may not clearly recognize, or lose the human path, not as this present body. Relying solely on this body, broadly cultivate the fields of fortune. Those who can do this will attain their wishes accordingly.\n\nIf you wish never again to be poor or lowly, never again orphaned or feeble, never again cold or hungry, never again begging or selling labor, never again suffering disaster or illness, never again deaf or blind, never again foolish or perverse in views, never again wrongly accused by officials, never again a slave or servant, never again slandered or maligned, always meeting sages and worthies, always connected with enlightened masters and precious scriptures, always encountering perfected immortals and transcendent beings, always meeting good, fortunate, and virtuous people for instruction, desiring the accomplishment of the immortal Dao—all past transgressions must be repented. The method of repentance requires complete sincerity, thorough confession without concealment, not hiding grave faults while admitting minor ones, which would only increase one’s sins. The statutes are stern and severe; the Dao does not speak in vain.\n\nThe Heavenly Master assented reverently and received the precepts.",
      "overlap_context": "the household, the wisdom of learning, the boundless wealth of seeking goodness, the excellent remedy for curing illness, the virtuous medicine for healing disease, the pivot of divine luminosity, and the Bian Que of the ten thousand afflictions.\n\nThis peerless and most perfect great Dao, vast in its model, broadly disseminates the teaching of the world and delivers boundless beings. When its hymns dissolve transgressions, a thousand sins melt like ice, and ten thousand faults scatter like snow.",
      "start_char": 5310,
      "end_char": 6527,
      "start_sentence": 183,
      "end_sentence": 218,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.033353090286255,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\戒律类\\太上洞玄灵宝宣戒首悔众罪保护经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "太上道君告天师曰：善男子、善女人，欲令先世无余基债、曩愆昔考、宿罪久过； 欲令今世无相负累、初罪新婴、考违谪负、目前深咎，欲令三曾五祖、九玄七世皆使解脱三途，悉令远离五苦，欲令后生子孙扬穗，大小昌炽，四体完具，年命寿老，处水不寒，入火不热，不痛不痒，不饥不渴，欲令百怪不能骇，百祸不能害，龙潜凤举，出入不可制者，所犯过恶，皆当悔之。 悔过之法，唯在丹款，首谢曲尽，则恶无不除，过无不原。 疏慢不恭，益子之罪。 道不虚言，子慎之焉！ 天师唯唯，敬受戒言。 太上道君曰：若有君臣、父子、兄弟、夫妇、大家奴婢，各欲悔过者，皆当为师设礼，叩头自搏，整身自检，清肃恭敬，专心正念，奉承教命。 法师当於高座上为讲诵首悔之文。 若於静室坛堂，亦可随时转经行道。 夫道无为，窈窈冥冥，视之不见，听之无声。 凡人心至，感知人情，见不假目，听不假耳。 故谓神明把握至法，制御群情，布教施戒，以遗愚民。 师为首悔，其罪即原； 遂事不改，其罪益深。 人贵能及，道贵能微。 朝过夕改，圣人所称。 故人作善者，为治地也； 守法戒者，为耕犁也； 布施惠者，为植种也； 悔罪过者，为锄鏺也； 修清净者，为生荣苗也； 受经文者，犹得雨泽也； 建斋直者，如稼穑滋秀也； 道德成者，犹如收敛也。 能宣传法教，广度天人，拯拔存亡，救恤穷厄，治护疾病者，犹如开仓施贫，饭饥饮渴，令众得饱而身自足，无乏少也。 转经首悔，然后获福，亦复如是。 所谓福田也，所谓善业也。 是以此经此法，功德无上。 国主悔过，天灾为除； 贤臣悔过，地害为消； 慈父悔过，家无妖怪； 孝子悔过，凶祸为止； 仁兄悔过，家离殃咎； 顺弟悔过，门无怨怒； 廉夫悔过，口舌不起； 贞妇悔过，保宜子孙； 是男悔过，和睦家里； 是女悔过，婚姻通理； 丈夫悔过，不乏所使； 奴婢悔过，得兔驱耻，道士悔过，三官不羁； 养性悔过，绝谷不危； 修仙悔过，白日登霞； 为居悔过，福覆一家； 为国悔过，九州平和。 悔过之功，其道高重。 罪福立彰，子知不乎？ 天师再拜，上白天尊：教戒委备，辄请奉宣。 臣道陵愿令天下之人皆得心开意解，知为悔过，得免其罪，故致家国太平安乐，长生久寿。 臣愿天尊当以道力余哺施与未及者，令知作善得善，作福得福，如种五谷，收获计其利润百千万倍。 诸有未悔者，愿令奉化； 诸未升度者，愿令济拔； 诸未得道者，愿令登仙； 诸未应生者，愿令长延。 臣之微愿，因由天尊，若不垂慈，众生沉坠，为罪造殃，恐更日甚。 今发劣言，愿重开示。 太上道君答天师曰：子之所言，善哉要乎！ 夫过恶者是凡之务，谓世俗之人去圣久远，大化沦薄，浊气浮厚，智慧浅末，不识祸福，谬误迷惑，不自觉知，冒罪触法，不知所由。 故吐经戒，以示不悟，教之反悔，令除过咎也。 盲者朗然开明，刚强者令反柔弱； 反凶为吉，转祸为福； 导之以生津，化之以真道。 而人知不可作故作，知不可为故为，今日悔，明日犯，其性不改，其恶不止，祸至乃闭门，罪定方忧恐，锁讫方求解，缚毕方希脱，病重方自治，临死方望活，炁尽方求益，命绝方求续。 至尔之时，天不及护，神不能生，鬼不能活，虽遇圣贤神德之人，灾不为散，病不为疗，王父不能挺其命，王母不能延其寿。",
      "translated_text": "The Most High Dao Lord addressed the Heavenly Master, saying: \"Good men and good women, if you wish that the residual debts of past lives—ancient transgressions, former faults, and long-standing sins of your forebears—be no more; if you wish that in this present life there be no mutual burdens, no new offenses, no recent misdeeds, no karmic debts, no immediate grave faults; if you wish that your three generations of ancestors and five lineages, your ninefold kin and sevenfold descendants, all be liberated from the Three Wretched Realms and entirely escape the Five Sufferings; if you wish that your future descendants flourish, both great and small prospering, their bodies whole and complete, their years long and their lives enduring, untouched by cold in water or heat in fire, free from pain and itching, hunger and thirst; if you wish that no monstrosity may terrify you, no calamity harm you, that dragons lie hidden and phoenixes soar, your comings and goings unrestrained—then all past transgressions must be repented. The method of repentance lies solely in utmost sincerity, thorough confession without concealment; thus, no evil shall remain unremoved, no fault unabsolved. Carelessness and irreverence will only increase your sins. The Dao does not speak in vain—take heed!\n\nThe Heavenly Master assented reverently and received the precepts.\n\nThe Most High Dao Lord continued: \"If rulers and ministers, fathers and children, elder and younger brothers, husbands and wives, masters and servants each wish to repent their transgressions, they must prepare offerings for their masters, prostrate themselves in contrition, strike their breasts in remorse, compose their bodies, examine their conduct, and maintain reverence and solemnity with focused, upright minds, obeying the teachings and commands. The Dharma Master shall ascend the high seat to recite the scripture of confession and repentance. If in a quiet chamber or altar hall, one may also circumambulate while reciting scriptures at any time.\n\nThe Dao is non-action, profound and obscure, invisible to the eye, inaudible to the ear. Yet when the human heart is sincere, it perceives and understands human sentiments—seeing without relying on the eyes, hearing without relying on the ears. Thus, the divine and enlightened grasp the supreme Dharma, govern the multitudes, propagate teachings, and bestow precepts to guide the foolish. When the master leads the repentance, sins are absolved at once; but if one returns to wrongdoing after repentance, the sins only deepen.\n\nMan values timely action; the Dao values subtlety. To correct one’s faults from morning to evening is praised by the sages. Thus, those who do good cultivate the earth; those who uphold precepts and prohibitions wield the plow; those who give alms and kindness sow seeds; those who repent their sins wield the hoe; those who cultivate purity nurture flourishing sprouts; those who receive scriptures receive the rain’s blessing; those who establish fasts and vigils are like crops ripening in the field; those who perfect virtue and the Dao are like the harvest gathered.\n\nThose who propagate the Dharma, widely deliver gods and humans, rescue the living and the dead, relieve the destitute and distressed, and heal the sick are like those who open granaries to feed the poor, giving food to the hungry and drink to the thirsty, ensuring all are sated and none lack. So too does one attain blessings after reciting scriptures and repenting. This is called the field of blessings, the work of goodness. Thus, the merit of this scripture and this Dharma is supreme.\n\nWhen a ruler repents, heavenly disasters are dispelled; when a worthy minister repents, earthly harms vanish; when a compassionate father repents, his household knows no omens; when a filial son repents, misfortunes cease; when a benevolent elder brother repents, his family avoids calamity; when an obedient younger brother repents, his door knows no resentment; when an upright man repents, no slander arises; when a chaste woman repents, she safeguards her descendants; when a son repents, his household is harmonious; when a daughter repents, her marriage prospers; when a husband repents, he lacks nothing he needs; when a servant repents, they escape humiliation; when a Daoist repents, the Three Officials do not restrain them; when one cultivating nature repents, they transcend grain and face no peril; when one cultivating immortality repents, they ascend in broad daylight; when a householder repents, blessings cover their family; when a ruler repents, the nine provinces are at peace. The merit of repentance is lofty and weighty. The distinction between sin and blessing is clear—do you not understand?\"\n\nThe Heavenly Master bowed twice and addressed the Heavenly Worthy: \"The teachings and precepts are fully imparted; I now request permission to propagate them. Your servant, Dao Ling, wishes that all under heaven may open their hearts and awaken their minds, knowing to repent and thus escape their sins, bringing peace and joy to their families and nations, and attaining long life and enduring longevity. Your servant prays that the Heavenly Worthy, with the power of the Dao, may extend nourishment to those yet unreached, so they may know that doing good brings goodness, and creating blessings brings blessings—like planting the five grains, reaping a hundred-thousand-fold harvest. May those who have not yet repented be transformed; may those not yet delivered be rescued; may those not yet attaining the Dao ascend as immortals; may those not yet born live long lives.\"\n\nThe Most High Dao Lord replied to the Heavenly Master: \"Your words are excellent and essential! Transgressions and evils are the concerns of the mundane. The people of this world have long been distant from the sages, the great transformation has waned, the turbid *qi* thickens, wisdom is shallow, and they do not recognize fortune and misfortune. Deluded and confused, they do not awaken, blindly violating laws and incurring sins without knowing why. Thus, I expound scriptures and precepts to enlighten the unenlightened, teaching them to repent and remove their faults. The blind shall see clearly; the stubborn shall become gentle; misfortune shall turn to fortune, calamity to blessing. I guide them with the elixir of life, transform them with the true Dao.\n\nYet people know what they should not do and do it anyway, know what they should not pursue and pursue it nonetheless. They repent today and transgress tomorrow, their nature unchanged, their evils unceasing. Only when disaster strikes do they shut their doors; only when guilt is certain do they grow fearful; only when shackled do they seek release; only when bound do they hope for escape; only when gravely ill do they seek treatment; only when facing death do they long for life; only when *qi* is exhausted do they seek to replenish it; only when life is ending do they seek to prolong it. By then, Heaven cannot protect them, spirits cannot revive them, ghosts cannot restore them. Even if they encounter sages and divine beings, disasters will not disperse, illnesses will not be cured. Neither their Heavenly Father nor Heavenly Mother can extend their lives.\"",
      "overlap_context": " transcendent beings, always meeting good, fortunate, and virtuous people for instruction, desiring the accomplishment of the immortal Dao—all past transgressions must be repented. The method of repentance requires complete sincerity, thorough confession without concealment, not hiding grave faults while admitting minor ones, which would only increase one’s sins. The statutes are stern and severe; the Dao does not speak in vain.\n\nThe Heavenly Master assented reverently and received the precepts.",
      "start_char": 6528,
      "end_char": 7787,
      "start_sentence": 219,
      "end_sentence": 281,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.535569190979004,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\戒律类\\太上洞玄灵宝宣戒首悔众罪保护经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "凡欲建福，必在祸先，积功累德，必未萌之前。 譬若春种，秋望其实； 临饥耕田，不解於饥； 临渴穿井，不救卒乏。 消祸莫若营福，积功莫若修身。 营福修身，幸宜殷勤，道德之门自开，凶恶之户自塞，福起十方，殃减九阴。 若无善功植在祸先者，则临命将危，倾财竭产，叩头师门，稽首德宇，岂得免乎？ 皇天虽高，其听甚卑。 凡人身中常有伺过之神，随时上下，白人善恶。 过满百二十为一刻，刻者令人多衰少利。 百八十过为一耗，耗者令人六畜伤损。 三百六十过为一漏，漏者令人喜发疾病。 五百四十过为一凶，凶者令人喑痖聋盲。 一千八十过为一祸，祸者令人暴残死亡。 千二百过为一残，残者出凶逆乱之人。 千三百过为一咎，咎者令人绝嗣无子。 千四百四十过为一皋，皋者殃流於五世，瘿痾大祸所缚。 千六百二十过为一谪，谪者令人断胤无嗣。 千八百过为一患，患者主为奴婢，家内耗乱。 千九百八十过为一横，横者家出癫痫狂痴之子。 二千一百六十过为一暴，暴者家出反逆，父子、兄弟、自相攻伐； 出邪巫鬼异，妄说神教。 二千六百九十过为一灾，灾者家出骨肉内淫乱勃，生育非真。 三千六百过为一异，异者家出青盲癃残。 三千二百四十过为一变，变者家出诏狱死族被诛。 三千四百二十过为一怪，怪者家出乞丐，都市刑人，死不以埋，骸骨损弃，无人收拾。 三千六百过为一刻满，刻满则定死，魂神漂浪。 随考轻重，付与三途五苦，沦溺备艰，辛苦痛毒，不可堪忍，讼对生人。 虽言空虚旷荡，斯则法律孱然。 今以告於子，子当宝秘宣传。 太上道君又重言曰：人生或年二十、三十而三刻满，则致凶残； 或五十、六十而三刻满，则致凶残。 年小来有过而残命者，受其先世余过也，或接行恶逆，竟年寿而不遇患者，受其先世余庆也。 故积德之后，有其余福，积恶之后，有其余祸。 故人能悔过者，上天鉴之，为人却刻，一悔过即为却三刻，三悔过即为却九刻。 而复后犯不止，罪应定死。 故人欲消灾散暴，治病疗疾，当渐以岁月，思愆自责，改悔过罪。 诚能行之，出自至心，感激恐怖，堕泣流汗，天知至诚，地神申信。 行之一日，其人身中伺过之神为人上除一刻； 行之百日，上除二刻； 行之一岁，上除三刻； 行之三年，其福自应。 不思返悔，其过日增，其祸益深，小过止其身，大过流子孙。 善男子、善女人，能请经师到宅，建立斋直，烧香行道，或一日一夕，或三日三夕，勤心苦诚，日夕六时，读诵此升玄悔过之文，功感诸天真神降房，玄司除刻，罪过蒙原。 积善如梁上尘，积恶如突中烟。 可不慎哉，可不慎哉！ 天师稽首，再拜奉行。 天师曰：无上登天升玄毕契，未受方素契积年者，不得便佩此契。 慎之。 内教无上登天毕券契仪 太上灵宝升玄内教宣戒首悔众罪保护生缘品、无上登天毕券传合真之人，都统三洞三万六千六百六十毕事契，令弟子何泰句凝寂等，依科赍信，上金九两，白银十二两，五彩纹缯五匹，信钱二万四千，诣升玄法师边奉受身佩，修行积年，并有灵应，真神三元，安镇丹田，神男、玉女侍卫左右，法传应为升玄内仙之人。 某州某县道士某，今太岁某年某月某日，传道士某观。",
      "translated_text": "To build blessings, one must act before misfortune strikes; to accumulate merit and virtue, one must do so before transgressions sprout. It is like planting in spring to reap in autumn—plowing when hunger comes cannot relieve hunger, nor can digging a well when thirst arrives save one from sudden thirst. To dispel misfortune, nothing surpasses cultivating blessings; to accumulate merit, nothing surpasses cultivating the self. In cultivating blessings and the self, one must be diligent and earnest, for then the gates of the Dao and virtue will open of themselves, while the doors of calamity and evil will seal shut. Blessings will arise from all directions, and disasters will diminish across the nine yin realms.\n\nIf no good deeds are planted before misfortune arrives, then when life nears its end, one may exhaust all wealth and property, bow at the gates of masters, and prostrate before halls of virtue—how can one escape then? Though the August Heaven is high, its hearing is most low. Within every person’s body dwells a spirit that watches for transgressions, ascending and descending at all times to report one’s good and evil.\n\nOne hundred and twenty transgressions make a *ke*, and a *ke* brings frequent decline and little profit. One hundred and eighty transgressions make a *hao*, and a *hao* causes harm to the six livestock. Three hundred and sixty transgressions make a *lou*, and a *lou* brings the onset of illness. Five hundred and forty transgressions make a *xiong*, and a *xiong* causes muteness, paralysis, deafness, and blindness. One thousand and eighty transgressions make a *huo*, and a *huo* brings violent injury and death. One thousand two hundred transgressions make a *can*, and a *can* produces those who commit treason and rebellion. One thousand three hundred transgressions make a *jiu*, and a *jiu* cuts off descendants, leaving one without heirs. One thousand four hundred and forty transgressions make a *gao*, and a *gao* brings calamity flowing through five generations, binding one to great misfortune and chronic illness. One thousand six hundred and twenty transgressions make a *zhe*, and a *zhe* severs one’s lineage, leaving no posterity. One thousand eight hundred transgressions make a *huan*, and a *huan* reduces one to servitude, bringing ruin and chaos to the household. One thousand nine hundred and eighty transgressions make a *heng*, and a *heng* causes the birth of children afflicted with epilepsy, madness, and idiocy. Two thousand one hundred and sixty transgressions make a *bao*, and a *bao* brings rebellion within the family, where fathers and sons, brothers, attack one another; it gives rise to false shamans and demonic teachings, who falsely expound divine doctrines. Two thousand six hundred and ninety transgressions make a *zai*, and a *zai* causes incestuous strife among kin, producing offspring who are not true. Three thousand six hundred transgressions make a *yi*, and a *yi* brings blindness and deformity. Three thousand two hundred and forty transgressions make a *bian*, and a *bian* brings imprisonment, execution, and the extermination of one’s clan. Three thousand four hundred and twenty transgressions make a *guai*, and a *guai* reduces one’s family to beggary, where members are publicly executed, their corpses left unburied, their bones discarded, with none to gather them. Three thousand six hundred transgressions fill a *ke*, and when a *ke* is full, death is certain, and the soul drifts without anchor. Depending on the severity of the transgressions, one is consigned to the Three Paths and Five Sufferings, drowning in hardship, enduring pain and torment beyond endurance, to face judgment before the living.\n\nIf one is twenty or thirty years old and three *ke* are filled, one meets with violent injury; if fifty or sixty and three *ke* are filled, one meets the same fate. Those who die young due to transgressions bear the lingering faults of past lives; those who live out their years without encountering misfortune enjoy the lingering blessings of past lives. Thus, after accumulating virtue, residual blessings remain; after accumulating evil, residual misfortune lingers.\n\nIf one can repent of transgressions, Heaven takes note, reducing one’s *ke*. One act of repentance removes three *ke*; three acts of repentance remove nine *ke*. But if one continues to transgress without cease, the sentence of death is sealed. Therefore, those who wish to dispel disasters, disperse violence, treat illness, and cure disease must gradually, over months and years, reflect on their faults, take responsibility, and repent of their transgressions. If one can practice this with utmost sincerity, moved to fear and trembling, shedding tears and sweating with remorse, Heaven will know one’s sincerity, and the earth spirits will affirm one’s truth. Practicing for one day, the spirit that watches for transgressions removes one *ke*; for one hundred days, two *ke*; for one year, three *ke*; for three years, blessings will naturally follow. Without repentance, transgressions will daily increase, and misfortune will deepen. Minor transgressions harm only oneself; major ones flow to one’s descendants.\n\nGood men and good women who invite scripture masters to their homes, establish fasts and vigils, burn incense and practice the Dao, whether for a day and a night or three days and three nights, with diligent and earnest devotion, reciting this *Shengxuan* repentance text in the six periods of day and night, will move the true spirits of the various heavens to descend to their chambers. The dark offices will remove *ke*, and transgressions will be pardoned. Accumulated goodness is like dust upon a beam; accumulated evil is like smoke within a chimney. How can one not be cautious? How can one not be cautious?\n\nThe Heavenly Master bows his head, prostrates twice, and pledges to follow these teachings.\n\nThe Heavenly Master says: Those who have not received the *Fangsu* contract over the years may not wear this contract. Be cautious.\n\n**Inner Teachings: Rites for the Supreme Ascent to Heaven and Completion of the Contract**\n\nThe *Taishang Lingbao Shengxuan Inner Teachings: Proclamation of Precepts, Repentance of Sins, Protection of Life’s Conditions, and the Supreme Ascent to Heaven Completion Contract* is conferred upon those who have unified with the true. It is the comprehensive contract governing the three caverns and thirty-six thousand six hundred and sixty completion matters. The disciples He Tai, Ju Ningji, and others, in accordance with the regulations, present as offerings nine taels of gold, twelve taels of silver, five bolts of five-colored patterned silk, and twenty-four thousand cash in alms money. They come before the *Shengxuan* Master to receive and wear it, cultivating and practicing for years, experiencing numinous responses. The Three Primes of the true spirits settle and guard the cinnabar field; divine youths and jade maidens attend to the left and right. The transmission of the method qualifies one as an inner immortal of the *Shengxuan*.\n\nThe Daoist of [such-and-such] Prefecture, [such-and-such] County, [so-and-so], in the current year, month, and day of the Great Year, transmits this to the Daoist of [such-and-such] Abbey.",
      "overlap_context": "o they hope for escape; only when gravely ill do they seek treatment; only when facing death do they long for life; only when *qi* is exhausted do they seek to replenish it; only when life is ending do they seek to prolong it. By then, Heaven cannot protect them, spirits cannot revive them, ghosts cannot restore them. Even if they encounter sages and divine beings, disasters will not disperse, illnesses will not be cured. Neither their Heavenly Father nor Heavenly Mother can extend their lives.\"",
      "start_char": 7787,
      "end_char": 9003,
      "start_sentence": 282,
      "end_sentence": 333,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.75030469894409,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\戒律类\\太上洞玄灵宝宣戒首悔众罪保护经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "前已受方素七十二字契盟，并已经年，诚积功着，翘勤无懈。 诸天所悉，大圣所鉴。 三官死名，久以削灭，应备上仙升玄品中，依法奉受，以为身宝，惠舟自引。 三天为证，九地为盟，九盟为保，神明为任，誓不违科犯戒，冒法触律。 一旦愆失，身谢三官，死为下鬼，长失人道，永充囚役。 明谨无过，定仙天府，生死得道，不羁地官。 一如《灵宝升玄内教无上登天契》之律令。 天师曰：诸是学仙道士，不受首悔之法，则罪结无复解时，皆当悔过，《升玄内教无上尊经》烧香供养，并佩方素七十二字及无上大线。 修行经年，然后能得此无上登天毕契法，不传始学者也。 若违科犯约，则不得便受升玄弟子首悔之经也。 兆等受经之身，慎之慎之。 天师曰：受此毕券，不得妄传，并此经，要须奉行。 精炼毕讫，闲解道意，信心无疑。 欲成其道，欲除其过，乃以此契及弟子以经付之也。 若心不达，取自我见，中心怀疑，信此浮好，乖彼真实，有如此之人，必踬地狱下鬼，不得便以登天之书，传与流俗行尸之辈。 故以相告。 慎之慎之。",
      "translated_text": "Having previously received the seventy-two-character covenant of plain silk, years have passed in sincere accumulation of merit and unwavering diligence. The myriad heavens are fully aware; the great sages bear witness. The names recorded in the Three Bureaus of the dead have long since been erased. One is now prepared to ascend among the ranks of the *Shengxuan* immortals. In accordance with the method, receive and treasure this as a personal treasure, a vessel of grace to guide oneself. The Three Heavens serve as witnesses, the Nine Earths as pledges, the Nine Pledges as guarantors, and the divine spirits as sureties. Swear never to violate the regulations or transgress the precepts, nor to defy the law or breach the statutes. Should one commit an offense or lapse even once, the body shall be delivered to the Three Bureaus, death shall consign one to the lower ghosts, the human Dao shall be forever lost, and one shall be eternally bound in servitude. If one remains vigilant and faultless, one shall be destined for the celestial courts of the immortals, attaining the Dao in life and death, and freed from the earthly bureaus.\n\nAll is in accordance with the statutes of the *Lingbao Shengxuan Inner Teachings’ Supreme Covenant for Ascending to Heaven*.\n\nThe Heavenly Master declares: All Daoist scholars who study immortality must first receive the method of initial repentance. If they do not, their sins shall remain unresolved forever. All must repent of their transgressions, burn incense and make offerings to the *Shengxuan Inner Teachings’ Supreme Revered Scripture*, and wear the seventy-two-character plain silk covenant along with the supreme great thread. Only after years of cultivation may one obtain this supreme method of the *Ascension Covenant*. It is not to be transmitted to beginners. Should one violate the regulations or breach the covenant, one shall not be permitted to receive the scripture of initial repentance for *Shengxuan* disciples.\n\nYou who receive this scripture, be cautious, be most cautious.\n\nThe Heavenly Master declares: This *Graduation Covenant* must not be recklessly transmitted, nor should this scripture. Both require earnest practice. Only after refining oneself to completion and attaining a profound understanding of the Dao’s meaning, with unwavering faith and no doubt, may one perfect the Dao and eliminate transgressions. Only then shall this covenant and the scripture be entrusted to the disciple. If one’s heart does not comprehend, if one clings to personal views, harbors doubt in the center, or trusts in superficial appearances while forsaking true reality—such a person shall surely stumble into the hells as a lower ghost. One must not transmit the scriptures of celestial ascension to the vulgar or the walking corpses of the world. Thus, I admonish you. Be cautious, be most cautious.",
      "overlap_context": "ceive and wear it, cultivating and practicing for years, experiencing numinous responses. The Three Primes of the true spirits settle and guard the cinnabar field; divine youths and jade maidens attend to the left and right. The transmission of the method qualifies one as an inner immortal of the *Shengxuan*.\n\nThe Daoist of [such-and-such] Prefecture, [such-and-such] County, [so-and-so], in the current year, month, and day of the Great Year, transmits this to the Daoist of [such-and-such] Abbey.",
      "start_char": 9003,
      "end_char": 9421,
      "start_sentence": 334,
      "end_sentence": 350,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.41680908203125,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\戒律类\\太上洞玄灵宝宣戒首悔众罪保护经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "太上洞玄灵宝宣戒首悔众罪保护经卷下竟",
      "translated_text": "The *Lower Scroll of the Most High Cavernous Mystery Numinous Treasure Scripture on Proclaiming Precepts, Confessing Transgressions, and Securing Protection* concludes.",
      "overlap_context": " eliminate transgressions. Only then shall this covenant and the scripture be entrusted to the disciple. If one’s heart does not comprehend, if one clings to personal views, harbors doubt in the center, or trusts in superficial appearances while forsaking true reality—such a person shall surely stumble into the hells as a lower ghost. One must not transmit the scriptures of celestial ascension to the vulgar or the walking corpses of the world. Thus, I admonish you. Be cautious, be most cautious.",
      "start_char": 9422,
      "end_char": 9443,
      "start_sentence": 351,
      "end_sentence": 351,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 1.3183224201202393,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\戒律类\\太上洞玄灵宝宣戒首悔众罪保护经.txt",
        "category": "戒律类"
      }
    }
  ]
}