{
  "source_id": "太上玄都妙本清静身心经",
  "source_file": "chunked_daozang\\太上玄都妙本清静身心经.json",
  "total_chunks": 4,
  "total_original_chars": 2416,
  "total_translated_chars": 14996,
  "total_translation_time": 73.20233702659607,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\本文类\\太上玄都妙本清静身心经.txt",
    "category": "本文类"
  },
  "full_translation": "The *Supreme Mysterious Capital Wondrous Original Scripture on Purifying Body and Mind*\n\n**Scripture Title:** *Supreme Mysterious Capital Wondrous Original Scripture on Purifying Body and Mind*. The compiler is unknown, but it likely emerged between the Sui and Tang dynasties, predating Li Rong’s *Scripture on Bathing and Purifying Body and Mind*. One fascicle. Source text: *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, *Benwen* Category.\n\n---\n\n**The Supreme Mysterious Capital Wondrous Original Scripture on Purifying Body and Mind**\n\nAt that time, the Most High Lord of the Primordial Beginning was in the Great Regulator of the Primordial Yang’s Upper Observatory of the Mysterious Capital, within the Purple Jade Palace of the Seven-Jewel Flowery Grove. The Most High Dao Lord, together with the sacred assemblies of the ten directions, the perfected immortals of all heavens, the sovereigns of the three realms, and all celestial spirits, dragons, ghosts, and beings awaiting deliverance—an innumerable multitude—had ascended to the station of True Unity, attained the mind of non-action, and gathered together in that place.\n\nThe palaces and observatories of the Mysterious Capital were adorned with gold, silver, lapis lazuli, coral, amber, true pearls, jasper, and all manner of treasures, their radiance blazing brilliantly to illuminate both within and without. The assembled perfected ones, seated in ranks, defied enumeration; spontaneous auspicious signs manifested before the Venerable One.\n\nHeaven rained down jeweled blossoms, scattering them across the earth; divine lutes and refined music sounded of themselves without being struck. A hundred harmonies of sacred incense wafted forth in fragrant streams.\n\nAt that moment, the fourfold assembly rose in astonishment and doubt, silently pondering in their minds, none daring to speak first. The Heavenly Worthy stroked the armrest, forestalling their impulse to question, and entered the gate of wisdom-contemplation. Manifesting the Dao of non-action, he reflected upon the primordial moment when the myriad beings first received their endowment, then intoned in a vast voice, addressing the fourfold assembly:\n\n“All you men and women, the original ground of your bodies and minds was utterly pure and still, the true mark unshaken, constant and unchanging from beginning to end, like empty space—coming and going without hindrance, free from defilement, cut off from all craving and conceptualization. Your fundamental nature was serene and luminous, inherently devoid of birth and extinction. Yet through inversion, you followed karma to assume form, like a bright pearl buried forever in dung and filth, hidden for kalpas without beholding its radiance.\n\nYou men and women, and all beings to come, cling to the illusory body and delude yourselves as to the true Dao. You create inverted karma, accumulate false and deceptive dust, bury the pearl of wisdom, and amass the grime of ignorance. You sink into the ocean of birth and death, drown in the currents of craving and attachment, dwell in the realm of the five desires, abide in the domain of the four demons, beset by delusion and affliction, bound in body and mind. Following karma, you revolve through the three evil destinies and five paths, your true nature obscured, the mysterious pearl submerged, your original radiance veiled—thus you cycle through birth and death without hope of liberation.\n\nTherefore, I now open the wondrous gate that you may awaken. All you of the fourfold assembly, by your inherent power, draw forth the water of Dao-nature, gather the incense of non-action, and blend the broth of wisdom. Abiding in the chamber of purity, remove the root and branch impurities of all beings, wash away the dust of false illusion, and lead them into the gate of wisdom to contemplate true suchness. The leaks and burdens of affliction shall be utterly extinguished. Illuminating the One Vehicle, you shall profoundly comprehend the two boundaries. Returning to the source and reverting to the origin, you shall recover your pure emptiness. Attaining the Dao naturally, you shall forever be free from transmigration.”\n\nWhen the great assembly heard this teaching, they reverently reflected upon it, their minds opened and their understanding deepened. Filled with joy, they leapt up, prostrated themselves before the Dao, and knelt to chant:\n\nThe Most High, Peerless, Greatly Compassionate Worthy,\nYou skillfully expound the inverted karma of beings.\nThe wondrous root of all dharmas is ever pure and still;\nWhen stirred, one sinks and drifts for ten thousand kalpas.\nOnce false thoughts are planted, the roots of greed and ignorance grow;\nFollowing those roots, the leaves of affliction arise.\nBlossoms and leaves flourish to fill the world,\nGood and evil revolve in endless layers.\nMadly deluded, they vie for false and deceptive fruit,\nParent and child, fruit upon fruit, unbroken in succession.\nThe grime of affliction, thick and heavy, covers the bright pearl;\nBody and mind, foul and filthy, stray from purity.\nYou show us how to draw forth the water of Dao-nature,\nWashing away a thousand evils to return to the One True.\nThe broth of equanimous purity and wisdom\nScours away the grime of ignorance to reveal true nature.\nSwiftly entering the chamber of right contemplation,\nThe incense and water of non-action settle clear as a mirror.\nThey illumine the inverted karma of past and future,\nWashing away greed, anger, the preceptor’s discipline, and meditative concentration.\nThe ailments of mind-grime and affliction are wholly dispelled;\nEach recovers their true root and returns to the life of wisdom.\nThe teaching of the Compassionate Worthy is beyond conception—\nWe prostrate ourselves in reverence and devotion.”\n\nAt that moment, among the assembly there was a perfected one named Dharma-Comprehension, who rose from his seat, adjusted his robe and headscarf, took up an incense burner, and with measured, refined steps, composed his spirit and calmed his thoughts. Collecting his attention and settling his mind, he knelt before the Dao and addressed the Heavenly Worthy: “We are most fortunate to have been included in this assembly. Since taking our seats, we have never before heard such a teaching. The minds and perceptions of the fourfold assembly remain shrouded in darkness.”\n\n“Pray, Divine Worthy, bestow your sacred instruction. We implore your compassion to pity our inadequacies.”\n\nThereupon, the Heavenly Worthy stroked the table and smiled faintly, replying to Dharma-Comprehension: “Excellent, good man! That you, in this Dharma assembly, seek to resolve doubts and awaken understanding will be a true reliance for sentient beings of the degenerate age. Your merit and virtue shall thereby be further exalted. Whatever you do not comprehend, ask freely; do not harbor doubts or obstinate attachments in your mind.”\n\nDharma-Comprehension, receiving this grace, bowed deeply and inquired: “The multitudes, foolish and deluded, rise and perish according to their karma, their defilements deep and heavy, their confusion binding them. Now, having prepared the Dharma decoction and established the Pure Chamber to wash away the roots of transgression and purge bodily impurities—we beg to know: what are the rites and procedures?”\n\nThe Heavenly Worthy replied: “Good man, on the ten auspicious days of each month, take the finest water and blend it with the Dharma incense decoction. Within the Pure Chamber, sit in right mindfulness and first contemplate body and mind: defilements and delusions, measureless in number, have together formed this body. Externally and internally, greed and ignorance—both coarse and subtle impurities—along with birth, aging, and impermanence, bind one in the knots of suffering. The three karmic actions obstruct the Dao; the six sense-objects veil the mind like clouds obscuring the bright sun. Having thus reflected, use the Dharma incense decoction to bathe, in due order, the skin, the four limbs, the five bodily constituents, the six sense organs, and the nine orifices, purifying them all. Once the outer is cleansed, employ quiet contemplation to refine and transform the delusions of the mind—all afflictions, false thoughts, attachments, greed, anger, and ignorance—rendering them wholly pure. With both inner and outer purified, abide in the Dharma-body and mind, ever dwelling in the Dao-field, cutting off false and defiled states. This is the essential method of the Dharma decoction’s purifying power.”\n\nUpon hearing this, the assembled perfected ones all praised and marveled, snapping their fingers in repentance and chanting in unison, “Excellent!”\n\nAt that moment, the perfected one, by virtue of his knowledge of past lives and insight into the minds of others, perceived that in the latter age there would be beings whose minds were benighted and who remained unenlightened regarding the Dharma. Seizing the opportunity, he bowed and advanced to ask: “We humbly inquire: by what name is this sutra, expounded in this assembly, to be known for its cultivation, offering, and merit? How is it that the conditioned, contingent body, once liberated, may also confer blessings upon the unconditioned, true consciousness? We, though unworthy, occupy the rank of perfected ones, yet remain unversed in this profound meaning. We beseech the Divine Worthy to specially bestow your illumination, to rain the nectar of wisdom upon humans and gods, and to spread the clouds of insight without limit.”\n\nThen the Heavenly Worthy, rejoicing, replied: “Remarkable! Perfected one, you possess knowledge of past lives and insight into the minds of others, awaken to the One Vehicle, and comprehend the mechanisms of the three times. You are able to make this earnest request for the sake of the future. I shall now expound fully; listen carefully.\n\nThe nature and characteristics of all beings are fundamentally empty. Though temporarily lodged in form, they ultimately return to dissolution. Not abiding in the three times, how can they be bound to a single body? Realizing the emptiness of the conditioned, one naturally transcends the false. With emptiness and no-falsehood, what need is there for reliance? Those who truly understand know that the contingent, conditioned body must be cultivated. In life, it is thus; in death, it is the same. When an ordinary person’s life ends, their consciousness dwells in the intermediate state. If aided by wholesome karma, they are certain to attain a higher rebirth. Therefore, their family and fellow practitioners should perform meritorious deeds: adorn the great jeweled altar with various ornaments, hang banners and canopies, observe fasts and make vows, lecture and recite this sutra, burn incense and light lamps to illuminate the dark night, liberate the suffering soul, and enable it to behold the light. With the non-action Dharma decoction, wash away its manifold impurities. Only when the spirit is utterly pure may it ascend to heaven, return to that realm of purity and spontaneity, and rejoin the natural domain.\n\nThe merit of this sutra is immeasurable, like empty space, impossible to quantify. Those who copy, venerate, and uphold it shall attain a wondrously pure original nature, their bodies and minds immaculate, and receive boundless rewards, equal to motes of dust. Therefore, it is named *The Wondrous Original Purity of Body and Mind from the Mystic Capital*.\n\nYou, the four assemblies—good men and women—should know that this sutra is foremost among methods of deliverance, foremost among rites for averting calamity, foremost among practices of cultivation, foremost among non-action teachings, foremost among wisdom teachings, and foremost among methods of contemplation and practice. This sutra is subtle and wondrous, inconceivable; among all other Dharmas, there is none that is not surpassed by it. In the past, I and the Heavenly Worthies practiced it and thereby attained the Dao. You should treasure and guard it; do not transmit it lightly. If you find a worthy recipient, then confer it with burning incense, vows, and reverent devotion. The Heavenly Worthies of the ten directions will surely record your names. The Azure Radiance Youth, the Cinnabar Prime Perfected One, the Plain Light Jade Maiden, the Mystic Palace Messenger, and the Yellow Center Great Spirit, leading their retinues of thirty-six attendants, will safeguard this sacred text and protect you. If you cultivate and recite it with a tranquil mind, contemplating form and spirit day and night with diligent reflection, sparing no effort, you shall attain clarity in the Three Palaces, purity in the six consciousnesses, completion of the ten transformations of karma, the five spirits abiding within, and the great non-action Dao manifesting in body and mind. All demonic forces will naturally subside.”\n\nHaving spoken thus, all the men and women in the assembly rejoiced. Suddenly, the Heavenly Worthy closed his eyes and raised his voice. The four assemblies gazed upward in reverence, none daring to inquire further. Joining their hands before the Dao, they chanted in verse:\n\nThe wondrous original is ever pure,\nBody and mind free of stain and grime.\nYet beings, bound by habitual karma,\nRemain deluded, harboring doubt and division.\nThus the Compassionate Worthy is moved\nTo clarify the provisional and the real.\nThe One Mark delivers all beings—\nTruly the speech of equality.\nOnce defilements are removed,\nAfflictions naturally depart.\nBearing the craftsman’s perfected virtue,\nWe ascend to the Mystic Capital’s governance.\n\nWhen the assembly of sages had recited this verse, the Heavenly Worthy, smiling serenely, emitted a five-colored, subtle, and wondrous divine light that penetrated the heavenly halls of blessings and the nine dark hells of the long night. By this divine light, the four assemblies of men and women beheld the karmic retributions of the heavens and the hells as clearly as if observing their own palms. With one mind, they took refuge and repented their past-life karmic burdens and present-life deep misfortunes, vowing to liberate all beings from suffering and affliction.\n\nThe Heavenly Worthy, moved by compassion for the assembly’s devotion, displayed divine majesty—snapping fingers and clicking teeth—whereupon all hells at once attained tranquility, and the imprisoned hungry ghosts together ascended to the Dao’s realm. The radiant light withdrew its illumination, yet the dharma-realm remained luminous. Forests, trees, mountains, and rivers all appeared in serene equality. Auspicious winds stirred, and the sun of wisdom cast its glow. All present in the dharma assembly were elevated to true rank. The hosts of sages from the ten directions, the beings of the three realms, and the myriad multitudes all received benefit. Bowing in reverence, they paid homage and vowed to follow the teachings. *The Most High Mystic Capital’s Wondrous Original Purity of Body and Mind Sutra* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上玄都妙本清静身心经 经名：太上玄都妙本清静身心经。 撰者不祥，约出於隋唐之际。 早於李荣所造《洗浴身心经》。 一卷。 底本出处：《正统道藏》洞真部本文类。 太上玄都妙本清静身心经 尔时，元始天尊在玄都大治元阳上观七宝华林紫琼宫内，太上道君与十方圣众、诸天真仙、三界帝王、一切天神龙鬼应受度者，无鞅之众，登真一位，得无为心，同会其所。 玄都宫观皆以金银、瑠璃、珊瑚、琥珀、真珠、碧玉种种装饰，光明赫弈，映照内外。 列座众真，不能名目； 自然祥瑞，表见尊前。",
      "translated_text": "The *Supreme Mysterious Capital Wondrous Original Scripture on Purifying Body and Mind*\n\n**Scripture Title:** *Supreme Mysterious Capital Wondrous Original Scripture on Purifying Body and Mind*. The compiler is unknown, but it likely emerged between the Sui and Tang dynasties, predating Li Rong’s *Scripture on Bathing and Purifying Body and Mind*. One fascicle. Source text: *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, *Benwen* Category.\n\n---\n\n**The Supreme Mysterious Capital Wondrous Original Scripture on Purifying Body and Mind**\n\nAt that time, the Most High Lord of the Primordial Beginning was in the Great Regulator of the Primordial Yang’s Upper Observatory of the Mysterious Capital, within the Purple Jade Palace of the Seven-Jewel Flowery Grove. The Most High Dao Lord, together with the sacred assemblies of the ten directions, the perfected immortals of all heavens, the sovereigns of the three realms, and all celestial spirits, dragons, ghosts, and beings awaiting deliverance—an innumerable multitude—had ascended to the station of True Unity, attained the mind of non-action, and gathered together in that place.\n\nThe palaces and observatories of the Mysterious Capital were adorned with gold, silver, lapis lazuli, coral, amber, true pearls, jasper, and all manner of treasures, their radiance blazing brilliantly to illuminate both within and without. The assembled perfected ones, seated in ranks, defied enumeration; spontaneous auspicious signs manifested before the Venerable One.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 228,
      "start_sentence": 0,
      "end_sentence": 10,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.121228456497192,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\太上玄都妙本清静身心经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "天雨宝花，散满於地； 灵钧雅乐，不鼓自鸣。 百和神香，芬馥流缢。 尔时，四座咸起惊疑，默念思惟，莫能先问。 天尊抚几，杜彼机缘，入慧观门，示无为道，思念万兆禀受之初，乃发鸿音，告四众曰：汝等男女，本地身心，悉皆清静，实相不动，始终恒一，犹如虚空，来去无碍，离於受染，绝诸爱想，正性湛然，本无生灭。 但以颠倒，随业受形，譬如明珠，恒埋粪壤，历劫隐蔽，不睹其光。 汝等男女，将来众生，执虚假身，迷真实道，造颠倒业，积邪伪尘，埋智慧珠，聚愚痴垢，堕生死海，溺贪爱流，居五欲场，处四魔境，有惑烦恼，结缚身心，随业转轮，三涂五道，荫盖正性，沉没玄珠，翳本光明，亦复如是，轮回生死，无解脱期。 是故我今开发妙门，令汝得悟。 汝等四众，以本分力，汲道性水，采无为香，调智慧汤，居清净室，为诸众生除根叶秽，洗虚妄尘，令入慧门，观於实相。 烦恼漏累，毕竟消除。 洞照一乘，深明二际。 还源反本，复我清虚。 得道自然，永无流转。 尔时，大众闻是说已，敬奉思惟，心开意解，欢喜踊跃，稽首道前，长跪颂曰： 元始无上大慈尊，善说众生邪倒业。 诸法妙本常清诤，动则沉沦经万劫。 妄想既植贪痴根，随根即生烦恼叶。 花叶繁滋弥世界，善恶输回互重迭。 狂迷竞贪邪伪果，子果不绝但相接。 烦恼垢重覆明珠，身心臭秽乖清净。 示我汲引道性水，洗涤千邪归一正。 平等清净智慧汤，荡除痴垢开真性。 有缘速入正观室，无为香水澄如镜。 能照去来邪倒业，洗涤贪嗔师戒定。 心垢恼病豁已除，各复真根归慧命。 慈尊所说叵思议，我等稽首咸恭敬。 尔时，会中有一真人，名曰法解，即从座起，整顿衣巾，手执香炉，从容雅步，怡神息虑，摄念安心，长跪道前，白天尊曰：臣等有幸，得预斯会。 侍座以来，未闻此说。 四众心识，犹自蒙昧。",
      "translated_text": "Heaven rained down jeweled blossoms, scattering them across the earth; divine lutes and refined music sounded of themselves without being struck. A hundred harmonies of sacred incense wafted forth in fragrant streams.\n\nAt that moment, the fourfold assembly rose in astonishment and doubt, silently pondering in their minds, none daring to speak first. The Heavenly Worthy stroked the armrest, forestalling their impulse to question, and entered the gate of wisdom-contemplation. Manifesting the Dao of non-action, he reflected upon the primordial moment when the myriad beings first received their endowment, then intoned in a vast voice, addressing the fourfold assembly:\n\n“All you men and women, the original ground of your bodies and minds was utterly pure and still, the true mark unshaken, constant and unchanging from beginning to end, like empty space—coming and going without hindrance, free from defilement, cut off from all craving and conceptualization. Your fundamental nature was serene and luminous, inherently devoid of birth and extinction. Yet through inversion, you followed karma to assume form, like a bright pearl buried forever in dung and filth, hidden for kalpas without beholding its radiance.\n\nYou men and women, and all beings to come, cling to the illusory body and delude yourselves as to the true Dao. You create inverted karma, accumulate false and deceptive dust, bury the pearl of wisdom, and amass the grime of ignorance. You sink into the ocean of birth and death, drown in the currents of craving and attachment, dwell in the realm of the five desires, abide in the domain of the four demons, beset by delusion and affliction, bound in body and mind. Following karma, you revolve through the three evil destinies and five paths, your true nature obscured, the mysterious pearl submerged, your original radiance veiled—thus you cycle through birth and death without hope of liberation.\n\nTherefore, I now open the wondrous gate that you may awaken. All you of the fourfold assembly, by your inherent power, draw forth the water of Dao-nature, gather the incense of non-action, and blend the broth of wisdom. Abiding in the chamber of purity, remove the root and branch impurities of all beings, wash away the dust of false illusion, and lead them into the gate of wisdom to contemplate true suchness. The leaks and burdens of affliction shall be utterly extinguished. Illuminating the One Vehicle, you shall profoundly comprehend the two boundaries. Returning to the source and reverting to the origin, you shall recover your pure emptiness. Attaining the Dao naturally, you shall forever be free from transmigration.”\n\nWhen the great assembly heard this teaching, they reverently reflected upon it, their minds opened and their understanding deepened. Filled with joy, they leapt up, prostrated themselves before the Dao, and knelt to chant:\n\nThe Most High, Peerless, Greatly Compassionate Worthy,\nYou skillfully expound the inverted karma of beings.\nThe wondrous root of all dharmas is ever pure and still;\nWhen stirred, one sinks and drifts for ten thousand kalpas.\nOnce false thoughts are planted, the roots of greed and ignorance grow;\nFollowing those roots, the leaves of affliction arise.\nBlossoms and leaves flourish to fill the world,\nGood and evil revolve in endless layers.\nMadly deluded, they vie for false and deceptive fruit,\nParent and child, fruit upon fruit, unbroken in succession.\nThe grime of affliction, thick and heavy, covers the bright pearl;\nBody and mind, foul and filthy, stray from purity.\nYou show us how to draw forth the water of Dao-nature,\nWashing away a thousand evils to return to the One True.\nThe broth of equanimous purity and wisdom\nScours away the grime of ignorance to reveal true nature.\nSwiftly entering the chamber of right contemplation,\nThe incense and water of non-action settle clear as a mirror.\nThey illumine the inverted karma of past and future,\nWashing away greed, anger, the preceptor’s discipline, and meditative concentration.\nThe ailments of mind-grime and affliction are wholly dispelled;\nEach recovers their true root and returns to the life of wisdom.\nThe teaching of the Compassionate Worthy is beyond conception—\nWe prostrate ourselves in reverence and devotion.”\n\nAt that moment, among the assembly there was a perfected one named Dharma-Comprehension, who rose from his seat, adjusted his robe and headscarf, took up an incense burner, and with measured, refined steps, composed his spirit and calmed his thoughts. Collecting his attention and settling his mind, he knelt before the Dao and addressed the Heavenly Worthy: “We are most fortunate to have been included in this assembly. Since taking our seats, we have never before heard such a teaching. The minds and perceptions of the fourfold assembly remain shrouded in darkness.”",
      "overlap_context": "ble multitude—had ascended to the station of True Unity, attained the mind of non-action, and gathered together in that place.\n\nThe palaces and observatories of the Mysterious Capital were adorned with gold, silver, lapis lazuli, coral, amber, true pearls, jasper, and all manner of treasures, their radiance blazing brilliantly to illuminate both within and without. The assembled perfected ones, seated in ranks, defied enumeration; spontaneous auspicious signs manifested before the Venerable One.",
      "start_char": 228,
      "end_char": 956,
      "start_sentence": 11,
      "end_sentence": 39,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.38351535797119,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\太上玄都妙本清静身心经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "特乞神尊，赐垂训谕。 唯愿哀原，愍所不逮。 於是，天尊抚几微笑，答法解曰：善哉男子，汝能於此法会为决疑悟，末世众生，真所荷赖。 於汝功德，更复增高。 有所不了，恣汝等问，勿怀疑惑，封执之心。 法解承恩，稽首问曰：众兆愚痴，随业生灭，垢秽深重，迷惑缠身。 今调法汤，建清净室，洗涤罪根，消除体秽。 未审仪轨，其事云何？ 天尊答曰：善男子，汝等常用月十直日，以上善水，调法香汤，於净室中，正念安坐，先观身心，垢秽聚积，无量迷惑，共成此身。 外内贪痴，粗细不净，生老无常，众苦结缚。 三业障道，六尘覆心，如弥天云，翳明盛日。 作是念已，以法香汤，先从皮肤，四支五体，六根九窍，次第灌洗，悉令清净。 外清净已，复以静观，熏修心惑，一切烦恼，妄想执计，贪嗔痴垢，普令清静。 内外既净，住法身心，常居道场，断邪伪垢，是名法汤涤除之要。 众真闻说，咸皆赞叹，弹指忏悔，同声称善。 尔时，真人以宿命通，得他心智，照知末劫有等众生，心识暗昧，於法未了。 是故乘机稽首进问：不审今会演说是经，以何名曰修持供养功德，云何假有之身既蒙开度，真无之识亦获福乎？ 臣等肤愚，忝居真位，於斯义趣犹自未通。 唯愿神尊特垂开示，降甘露雨，遍洒人天； 垂智慧云，广覆无外。 尔时，天尊欢喜答曰：异哉，真子得宿命通，了他心智，悟一乘道，达三世机，能为将来致殷勤请。 我今具说，汝当谛听。 众生性相，皆悉是空，暂寄有形，终归坏灭。 不住三世，岂系一身？ 能体有空，自当无假。 有空无假，何藉资凭？ 真了当知假有之身，必须修习。 在生如是，处死亦然。 凡人寿终，识居中荫，善业资助，必获上生。 是其家人，及诸同学，当为作福，种种装严，建大宝坛，悬诸幡盖，修斋愿念，讲诵是经，烧香然灯，照烛幽夜，拔其苦爽，令睹光明； 无为法汤，涤除纷秽； 神识绝净，乃得升天，反彼清虚，归自然域。 是经功德，不可格量，犹如虚空，难以量度。 若有抄写，供养受持，此人即得妙本澄清，身心洁白，获报无量，等彼微尘。 故名《玄都妙本清净身心》。 汝辈四众、善男女等，当知此经，济度法中最为第一，禳灾法中最为第一，修习法中最为第一，无为法中最为第一，智慧法中最为第一，观行法中最为第一。 此经微妙，不可思议，於余法中无不第一。 我昔过去，与诸天尊之所奉行，而得成道。 汝宜宝秘，慎勿轻传。 若得其人，当须授受，烧香誓愿，顶戴奉持。 十方天尊，必记汝等。 於是青华童子、丹元真人、素光玉女、玄宫使者、黄中大神，率其官属三十六人，备卫灵文，保护於汝。 汝能於此静心习诵，存念形神，日夜精思，不辞劳倦，即得三宫明净，六识清虚，十转业成，五神依止，无为大道，发尔身心，一切群魔，自然消伏。 作是说已，是诸男女，并皆欢喜。 天尊俄然瞑目高抗，四众瞻仰，无敢谘询，叉手道前，而作颂曰： 妙本常清净，身心无垢腻。 众生习业人，迷惑怀疑贰。 是故感慈尊，为明权实义。 一相度黎元，真为平等语。 垢秽既以除，烦恼自然离。 负荷匠成德，飞步玄都治。 尔时，众圣说此颂已，於是天尊怡然含笑，即吐五色微妙神光，彻照诸天福堂及九幽长夜地狱，四座男女乘此神光，悉睹诸天诸地罪福报对，如观指掌，了了分明，咸皆一心归命，忏谢宿根业累、即世深殃，愿拔众生离诸苦恼。",
      "translated_text": "“Pray, Divine Worthy, bestow your sacred instruction. We implore your compassion to pity our inadequacies.”\n\nThereupon, the Heavenly Worthy stroked the table and smiled faintly, replying to Dharma-Comprehension: “Excellent, good man! That you, in this Dharma assembly, seek to resolve doubts and awaken understanding will be a true reliance for sentient beings of the degenerate age. Your merit and virtue shall thereby be further exalted. Whatever you do not comprehend, ask freely; do not harbor doubts or obstinate attachments in your mind.”\n\nDharma-Comprehension, receiving this grace, bowed deeply and inquired: “The multitudes, foolish and deluded, rise and perish according to their karma, their defilements deep and heavy, their confusion binding them. Now, having prepared the Dharma decoction and established the Pure Chamber to wash away the roots of transgression and purge bodily impurities—we beg to know: what are the rites and procedures?”\n\nThe Heavenly Worthy replied: “Good man, on the ten auspicious days of each month, take the finest water and blend it with the Dharma incense decoction. Within the Pure Chamber, sit in right mindfulness and first contemplate body and mind: defilements and delusions, measureless in number, have together formed this body. Externally and internally, greed and ignorance—both coarse and subtle impurities—along with birth, aging, and impermanence, bind one in the knots of suffering. The three karmic actions obstruct the Dao; the six sense-objects veil the mind like clouds obscuring the bright sun. Having thus reflected, use the Dharma incense decoction to bathe, in due order, the skin, the four limbs, the five bodily constituents, the six sense organs, and the nine orifices, purifying them all. Once the outer is cleansed, employ quiet contemplation to refine and transform the delusions of the mind—all afflictions, false thoughts, attachments, greed, anger, and ignorance—rendering them wholly pure. With both inner and outer purified, abide in the Dharma-body and mind, ever dwelling in the Dao-field, cutting off false and defiled states. This is the essential method of the Dharma decoction’s purifying power.”\n\nUpon hearing this, the assembled perfected ones all praised and marveled, snapping their fingers in repentance and chanting in unison, “Excellent!”\n\nAt that moment, the perfected one, by virtue of his knowledge of past lives and insight into the minds of others, perceived that in the latter age there would be beings whose minds were benighted and who remained unenlightened regarding the Dharma. Seizing the opportunity, he bowed and advanced to ask: “We humbly inquire: by what name is this sutra, expounded in this assembly, to be known for its cultivation, offering, and merit? How is it that the conditioned, contingent body, once liberated, may also confer blessings upon the unconditioned, true consciousness? We, though unworthy, occupy the rank of perfected ones, yet remain unversed in this profound meaning. We beseech the Divine Worthy to specially bestow your illumination, to rain the nectar of wisdom upon humans and gods, and to spread the clouds of insight without limit.”\n\nThen the Heavenly Worthy, rejoicing, replied: “Remarkable! Perfected one, you possess knowledge of past lives and insight into the minds of others, awaken to the One Vehicle, and comprehend the mechanisms of the three times. You are able to make this earnest request for the sake of the future. I shall now expound fully; listen carefully.\n\nThe nature and characteristics of all beings are fundamentally empty. Though temporarily lodged in form, they ultimately return to dissolution. Not abiding in the three times, how can they be bound to a single body? Realizing the emptiness of the conditioned, one naturally transcends the false. With emptiness and no-falsehood, what need is there for reliance? Those who truly understand know that the contingent, conditioned body must be cultivated. In life, it is thus; in death, it is the same. When an ordinary person’s life ends, their consciousness dwells in the intermediate state. If aided by wholesome karma, they are certain to attain a higher rebirth. Therefore, their family and fellow practitioners should perform meritorious deeds: adorn the great jeweled altar with various ornaments, hang banners and canopies, observe fasts and make vows, lecture and recite this sutra, burn incense and light lamps to illuminate the dark night, liberate the suffering soul, and enable it to behold the light. With the non-action Dharma decoction, wash away its manifold impurities. Only when the spirit is utterly pure may it ascend to heaven, return to that realm of purity and spontaneity, and rejoin the natural domain.\n\nThe merit of this sutra is immeasurable, like empty space, impossible to quantify. Those who copy, venerate, and uphold it shall attain a wondrously pure original nature, their bodies and minds immaculate, and receive boundless rewards, equal to motes of dust. Therefore, it is named *The Wondrous Original Purity of Body and Mind from the Mystic Capital*.\n\nYou, the four assemblies—good men and women—should know that this sutra is foremost among methods of deliverance, foremost among rites for averting calamity, foremost among practices of cultivation, foremost among non-action teachings, foremost among wisdom teachings, and foremost among methods of contemplation and practice. This sutra is subtle and wondrous, inconceivable; among all other Dharmas, there is none that is not surpassed by it. In the past, I and the Heavenly Worthies practiced it and thereby attained the Dao. You should treasure and guard it; do not transmit it lightly. If you find a worthy recipient, then confer it with burning incense, vows, and reverent devotion. The Heavenly Worthies of the ten directions will surely record your names. The Azure Radiance Youth, the Cinnabar Prime Perfected One, the Plain Light Jade Maiden, the Mystic Palace Messenger, and the Yellow Center Great Spirit, leading their retinues of thirty-six attendants, will safeguard this sacred text and protect you. If you cultivate and recite it with a tranquil mind, contemplating form and spirit day and night with diligent reflection, sparing no effort, you shall attain clarity in the Three Palaces, purity in the six consciousnesses, completion of the ten transformations of karma, the five spirits abiding within, and the great non-action Dao manifesting in body and mind. All demonic forces will naturally subside.”\n\nHaving spoken thus, all the men and women in the assembly rejoiced. Suddenly, the Heavenly Worthy closed his eyes and raised his voice. The four assemblies gazed upward in reverence, none daring to inquire further. Joining their hands before the Dao, they chanted in verse:\n\nThe wondrous original is ever pure,\nBody and mind free of stain and grime.\nYet beings, bound by habitual karma,\nRemain deluded, harboring doubt and division.\nThus the Compassionate Worthy is moved\nTo clarify the provisional and the real.\nThe One Mark delivers all beings—\nTruly the speech of equality.\nOnce defilements are removed,\nAfflictions naturally depart.\nBearing the craftsman’s perfected virtue,\nWe ascend to the Mystic Capital’s governance.\n\nWhen the assembly of sages had recited this verse, the Heavenly Worthy, smiling serenely, emitted a five-colored, subtle, and wondrous divine light that penetrated the heavenly halls of blessings and the nine dark hells of the long night. By this divine light, the four assemblies of men and women beheld the karmic retributions of the heavens and the hells as clearly as if observing their own palms. With one mind, they took refuge and repented their past-life karmic burdens and present-life deep misfortunes, vowing to liberate all beings from suffering and affliction.",
      "overlap_context": "rma-Comprehension, who rose from his seat, adjusted his robe and headscarf, took up an incense burner, and with measured, refined steps, composed his spirit and calmed his thoughts. Collecting his attention and settling his mind, he knelt before the Dao and addressed the Heavenly Worthy: “We are most fortunate to have been included in this assembly. Since taking our seats, we have never before heard such a teaching. The minds and perceptions of the fourfold assembly remain shrouded in darkness.”",
      "start_char": 956,
      "end_char": 2256,
      "start_sentence": 40,
      "end_sentence": 91,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.7301459312439,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\太上玄都妙本清静身心经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "天尊慈愍，感彼众心，乃振威神，弹指叩齿，应时地狱悉得闲宁，饿鬼囚徒俱升道境。 宝光收照，法界犹明。 林木山川，缅然平等。 祥风鼓吹，慧日流光。 预法会中，并加真位。 十方众圣、三界人天种种群生，皆蒙利益，稽首作礼，依教奉行。 太上玄都妙本清静身心经竟",
      "translated_text": "The Heavenly Worthy, moved by compassion for the assembly’s devotion, displayed divine majesty—snapping fingers and clicking teeth—whereupon all hells at once attained tranquility, and the imprisoned hungry ghosts together ascended to the Dao’s realm. The radiant light withdrew its illumination, yet the dharma-realm remained luminous. Forests, trees, mountains, and rivers all appeared in serene equality. Auspicious winds stirred, and the sun of wisdom cast its glow. All present in the dharma assembly were elevated to true rank. The hosts of sages from the ten directions, the beings of the three realms, and the myriad multitudes all received benefit. Bowing in reverence, they paid homage and vowed to follow the teachings. *The Most High Mystic Capital’s Wondrous Original Purity of Body and Mind Sutra* concludes.",
      "overlap_context": "miling serenely, emitted a five-colored, subtle, and wondrous divine light that penetrated the heavenly halls of blessings and the nine dark hells of the long night. By this divine light, the four assemblies of men and women beheld the karmic retributions of the heavens and the hells as clearly as if observing their own palms. With one mind, they took refuge and repented their past-life karmic burdens and present-life deep misfortunes, vowing to liberate all beings from suffering and affliction.",
      "start_char": 2256,
      "end_char": 2379,
      "start_sentence": 92,
      "end_sentence": 98,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 4.967447280883789,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\太上玄都妙本清静身心经.txt",
        "category": "本文类"
      }
    }
  ]
}