{
  "source_id": "太上洞玄灵宝三涂五苦拔度生死妙经",
  "source_file": "chunked_daozang\\太上洞玄灵宝三涂五苦拔度生死妙经.json",
  "total_chunks": 3,
  "total_original_chars": 2952,
  "total_translated_chars": 15705,
  "total_translation_time": 75.60909581184387,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝三涂五苦拔度生死妙经.txt",
    "category": "本文类"
  },
  "full_translation": "**The Supreme Cavernous Mystery Numinous Treasure Sutra of Deliverance from the Three Paths and Five Sufferings to Transcend Birth and Death**\n\n**Sutra Title:** *The Supreme Cavernous Mystery Numinous Treasure Sutra of Deliverance from the Three Paths and Five Sufferings to Transcend Birth and Death*. The compiler is unknown, likely composed during the Northern and Southern Dynasties or the Sui-Tang period. It expounds upon the karmic retributions of the wheel of rebirth and exhorts the cultivation of meritorious deeds and fields of blessing. One scroll.\n\n**Source of the Base Text:** *Daoist Canon of the Zhengtong Era*, Cavernous Mystery Division, *Benwen* Category.\n\n---\n\n**The Supreme Cavernous Mystery Numinous Treasure Sutra of Deliverance from the Three Paths and Five Sufferings to Transcend Birth and Death**\n\nAt that time, the Numinous Treasure Heavenly Worthy was in the Fragrant Grove Garden of the Ever-Joyful World, expounding the subtle and wondrous true sutra of the Mysterious Unity and the principle of the Non-Dual Wondrous Gate and the Profound Mystery to the Five Venerable Sovereigns, the Ten Ultimate Perfected, the Three Clarities, and the boundless assembly of sagely hosts. All those present heard the Dharma-sound, awakened to the subtle and imperceptible, and attained the realm of true constancy. The joy of humans and gods was beyond description.\n\nThen, the Heavenly Worthy emitted a nine-colored radiance of subtle and wondrous light, universally illuminating the boundless worlds of the ten directions. Heaven above and earth below, within and without, were all pervasively luminous, like lapis lazuli, without obstruction. Thereupon, the immeasurable beings in the hells beneath the Nine Dark Realms were seen enduring manifold torments. In the thirty-six prisons, sinful souls were examined and punished; the enforcing divine soldiers, the mighty heavenly warriors, the Three Officials and Nine Bureaus, the one hundred and twenty offices—all administered tortures without respite. Some embraced bronze pillars, some lay upon iron beds, some ascended knife mountains, some climbed sword trees; their bodies bore iron staves, their heads wore mountains of fire. Some entered cauldrons of boiling liquid, some passed through furnaces of charcoal; they were hung upside down or stood inverted, crushed and ground, parched by drinking fiery essence, starved by eating embers. Molten bronze was poured into their mouths, and fire blazed in every joint. Some were pressed by boulders, their bodies pierced by needle points; some leapt north and south within pits of burning coals. In freezing ice, their flesh and bones split apart; they were sawed asunder, hacked by blades, pecked by birds, swallowed by serpents. Some were nailed with long spikes, some had their tongues plowed by iron plows; some languished in filth and stench, some were submerged in dark and boundless waves. Some bore iron mountains on their backs, filling rivers and flooding seas. Some had their spines broken by ox-head demons, some were gnawed by bronze dogs. In an instant, they died ten thousand deaths, enduring boundless suffering for kalpas without end. When their retributions were exhausted, they were reborn as other kinds: as pigs, geese, chickens, ducks—slaughtered at human whim; as camels, horses, oxen, donkeys—subjected to human control; as deer, wild beasts, flying birds, fish, venomous vipers, evil serpents, jackals, wolves, tigers, leopards—devouring one another in endless succession. If reborn as humans, they were afflicted with the six illnesses: blindness, deafness, muteness, lameness, crippled hands, festering sores covering their bodies, flesh rotting away, noses collapsing, leprosy, madness, and idiocy. Some suffered from chronic illnesses, bedridden in misery; some were hideous in appearance, lacking in wisdom; some endured freezing cold, hunger, and poverty, destitute and alone; some were born as lowly slaves and servants, restrained and oppressed by others, without freedom. Such sins followed them like shadows, and for kalpas they revolved in the wheel of rebirth without respite.\n\nAt that time, the assembly, witnessing these causes and conditions, sighed in sorrow and lamentation, filled with compassion. Then, from among the assembly, a Perfected One named Dharma-Comprehension arose from his seat, composed and dignified, adjusting his robes and cap. He prostrated before the Heavenly Worthy, touching his head to the ground, advanced, and made obeisance, addressing the Heavenly Worthy: \"Since I have attended upon You, through countless kalpas in the realms of the Three Clarities, the golden palaces and jade towers, I have dwelt in tranquility and non-action, roaming freely in bliss. I have wandered the domains of the Perfected, feasting and listening to the Dharma-sound. Such joy has endured for kalpas untold. Yet never before have I witnessed these causes and conditions of birth and death, the endless cycle of the six paths, and the boundless suffering. I do not know what transgressions these sin\n\nThe Five Sufferings are: the mountains of knives and forests of swords, the bronze pillars and boiling cauldrons, the endless waves of the dark sea—these are called the Five Sufferings.\n\nThe Eight Difficulties are:\n1. To be born in the human realm,\n2. To depart from the female form and become male,\n3. To possess a complete and unblemished body,\n4. To be born in the Central Kingdom,\n5. To encounter a sovereign or father of the Dao,\n6. To be endowed with a nature of kindness and benevolence,\n7. To dwell in a land of great peace,\n8. To encounter the Three Treasures.\nWhen all eight are fulfilled, it is the greatest of good causes. If any are lacking, it is called difficulty.\n\nBy these manifold sufferings, one drifts and cannot return, tossed and submerged, forever severed from the Dao. Indulging in the Five Defilements, clinging to the Six Desires, assailed by external temptations and internal afflictions, entangled in calamities and stained by misfortunes—the six senses of eye, ear, nose, tongue, body, and mind, with their objects of beauty and ugliness, right and wrong, thoughts arising in unbroken succession—once the human path is lost, one falls into hell, where the long night is dark and there is no means of deliverance.\n\nThe Dharma-Comprehension further said: \"Sentient beings, deluded by false thoughts, fail to recognize the true and real. They cling to right and wrong, cycling through karmic transgressions, following the dictates of their minds and desires—all these are the causes of sin. How fleeting is human life, arising and perishing in an instant, like a spark from stone, never enduring long, like a floating bubble, utterly without solidity. Birth, aging, sickness, and death assail one day and night. Change and decay are constant; in an instant, all disperses and crumbles. Even if one attains wealth and nobility, it is but a brief moment. How much more for those who suffer hunger and poverty, grief and sorrow, or are afflicted by the six illnesses, their bodies incomplete—when death comes, they return once more to hell. Such suffering is truly pitiable. I only wish that Your Great Compassion may widely open the gates of expedient means, reveal the Great Dao, and establish the path of deliverance, so that these sinful souls and future men and women may all receive the blessings of the Dharma and universally enter the hall of fortune.\"\n\nThe Heavenly Worthy replied: \"If there are sentient beings whose Three Actions are pure, they will not fall into the Three Wretched Paths. The Three Actions are: bodily action, mental action, and verbal action. Bodily action consists of lust, killing, and theft. Mental action consists of anger, greed, ignorance, and delusion. Verbal action consists of frivolous speech, falsehood, divisive words, and abusive language. These Three Actions are the roots of the Ten Actions; they obstruct good causes and breed sin and affliction. If one can purify them, one will forever avoid the Three Wretched Paths. If there are sentient beings whose Five Poisons are purified, they will escape the Five Sufferings. The Five Poisons are: the eyes beholding the five colors, the ears hearing the five sounds, the nose coveting the five fragrances, the tongue tasting the five flavors, and the mind generating the five desires—these are the roots of the Five Poisons. For kalpas unending, one remains entangled, with no liberation. If one can purify them, the Five Sufferings will be forever eradicated. If there are sentient beings who cultivate the Eight Practices, they will transcend the Eight Difficulties and unite with the Dao in truth. The Eight Practices are:\n1. Filial piety,\n2. Benevolence and kindness,\n3. Chastity and integrity,\n4. Loyalty and sincerity,\n5. Forbearance and goodness,\n6. Gentleness and harmony,\n7. Upholding the precepts and fasting, meditating on the Great Dao,\n8. Treating all beings with equality, without enmity or partiality.\nBy cultivating these, merit and virtue become full; the body transcends the Eight Difficulties and forever ascends the ranks of immortality. These are the essential principles of practice in the above Dharma-gates, transforming the coarse into the subtle and attaining the Dao to ascend to perfection. The Heavenly Worthies of the Three Times and the Great Sages of the Ten Directions all cultivated these practices to ascend into the realm of non-action. Out of compassion, you pity the multitudes; you should expound and proclaim what has not yet been heard. In the midst of the sea of suffering and the river of craving, with my Dharma-teachings, you shall rescue and dredge up sentient beings, so that men and women of future generations may all know to cultivate and revere, escape the net of afflictions, sever the roots of doubt, ascend the mountain of liberation, and reach the realm of carefree wandering. With body and mind purified, they shall deeply enter the Dharma-gates.\"\n\nThe Dharma-Comprehension further said: \"The gates of the Three Actions, Five Poisons, and Eight Practices are inconceivable, most true and most wondrous. In future worlds and among the present beings of heaven and earth, those who hear this Dharma-sound should awaken and understand. How much more for those who diligently advance and cultivate in accordance with these teachings—they shall certainly attain the Dao. Yet within the hells, the present imprisoned souls, confined in the cold courts, wander through the long night, their bones cut by the wind and knives, their bodies afflicted by manifold sufferings, their hunger and weariness unceasing, their cycles of rebirth endless. And for all the people of future generations, when death comes, they should be delivered. I pray that You may bestow enlightenment and grant them the decisive words, so that both the living and the dead may receive Your grace and be delivered in life and death.\"\n\nThe Heavenly Worthy replied: \"The standards for deliverance and the texts for salvation are fully contained in the scriptures of the Three Caverns. Now I shall proclaim the essential words for you. Listen carefully, receive, and uphold them, and widely disseminate them. Those who study the Dao should establish virtue and merit, refine their qi and sit in forgetfulness, cultivate the real and ingest the elixirs, proclaim the scriptures and expound the teachings, assist the state and deliver the people. To practice all these is true action. Though merit and practice may be complete and the fruits of karma perfect, one must first deliver the nine generations of ancestors and the seven generations of forebears, the departed spirits of parents, and cause them to ascend to heaven. Only when the ghostly registers are entirely cleared may the body attain the Dao. How much more for the people of the world, bound by worldly customs—if filial sons and daughters, upon the death of their parents and all their kin, fear that those ghostly spirits may fall into the Three Evil Paths, enter hell, or be confined in Fengdu, where the darkness is profound and they endure manifold sufferings—they must rely on merit and virtue, widely cultivate fields of blessings, deliver the destitute souls, and dissolve karmic entanglements. Beyond this realm, in the Eastern Palace of Ultimate Extremity, there is the Heavenly Worthy of Instantaneous Salvation through Sound, the Great Compassionate One. He has made vast vows to universally save sentient beings; for countless kalpas, he has delivered beings without number. If one can dedicate merit, turn the mind in a single thought of refuge, visualize his august countenance, and invoke his name, he will respond to the call, come to the aid, and in all suffering, there is none he will not save and protect. Therefore, he is called the Heavenly Worthy of Salvation through Suffering. Widely exhort all beings to diligently pay homage and invoke him.\"\n\nFurthermore, among the Three Caverns’ scriptures, those that relieve suffering and deliver the departed, the kindling of lamps is supreme. Across the five directions and eight extremities, within the dark prisons of hell—the regions of utmost yin and the realms of eternal night—departed souls are imprisoned, cut off from the Three Luminaries. Amidst the gloom, they endure all manner of torture and torment. One should fashion a lamp-tree and kindle nine cups of lamps, continuing from the moment of death through the seven sevens. As the lamp-light persists, it shines downward into the Nine Netherworlds. Upon beholding this radiance, the souls shall immediately attain liberation.\n\nMoreover, with silken banners, one may craft a *Treasure Mill for Transmigrating Spirits*, forty-nine feet in length, or fashion seven small pennants to hang from a tall pole, allowing them to flutter in the wind, whereby all sins are extinguished. Additionally, one may transcribe this scripture upon paper or fine silk, distribute it to learners, and propagate its recitation. Thereby, the departed shall ascend beyond suffering, the hells shall know tranquility, and the blessings of the virtuous shall extend to future generations.\n\nThose who offer precious adornments, garments, or their lifelong possessions to shelter the destitute and relieve the impoverished shall accrue merit akin to the foregoing. Their names shall be stricken from the Black Registers, their records expunged by the Earthly Offices, and their spirits shall ascend to the divine realms, reborn according to their vows. Their descendants shall be blessed, freed from calamities and afflictions, and their boundless virtue and goodness shall defy all measure.\n\nTherefore, one ought to diligently and sincerely receive these teachings, propagate and entrust them widely, and universally deliver both humans and devas. At that time, the assembly—comprising exalted sages, the Three Realms’ perfected immortals, the guardian spirits, the celestial soldiers and mounted officers, and the innumerable hosts of all offices—all attained effortless enlightenment, ascending together to the Dao-fruit. The Three Terraces of Hell and the countless suffering souls therein all gained merit and were instantly liberated. The ten directions’ prisons, with their cauldrons and boiling vats, transformed into cool purity, free from all sorrow and distress.\n\nThe Heavenly Perfected, the devas, humans, dragons, and ghosts present in the Dharma assembly heard this scripture with joy, faithfully received it, reverently upheld it, made obeisance, and withdrew.\n\nThus concludes *The Wondrous Scripture of the Highest Numinous Treasure on Deliverance from the Three Paths and Five Sufferings, Liberating from Birth and Death*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上洞玄灵宝三途五苦拔度生死妙经 经名：太上洞玄灵宝三途五苦拔度生死妙经。 撰人不详，约出於南北朝或隋唐。 言轮迥果报，劝修功德福田。 一卷。 底本出处：《正统道藏》洞玄部本文类。 太上洞玄灵宝三途五苦拔度生死妙经 灵宝天尊时於长乐世界香林园中，与五老上帝、十极天真、三清诸天无极圣众，演说微妙玄一真经，不二妙门重玄之理。 预是来众，咸闻法音，了达希微，到真常境。 人天欢悦，难可称焉。 尔时天尊即放九色微妙光明，徧照十方无极世界。 天上地下，内外洞明，等若琉璃，无所隔碍。 乃见九幽之下地狱之中，无量众生受诸苦恼。 三十六狱，考治罪魂，执罚神兵，巨天力士，三官九府，百二十曹，考掠纵横，无时暂歇。 或抱铜柱，或卧铁床，或上刀山，或攀剑树，身负铁杖，头戴火山，或入镬汤，或经炉炭，倒悬倒立，确捣硙磨，渴饮火精，饥则食炭，或洋铜灌口，百节火然。 或硖石逼身，针锋贯体。 或煻煨之内，南北跳踉。 或寒冰之中，肌骨分裂，锯解刀斫，鸟啄蛇吞。 或长钉钉身，或铁犁耕舌，或粪秽臭处，或涟汲溟波，或负铁擎山，填河灌海。 或牛头折脊，或铜狗啮身。 倏忽之间，万生万死，受诸苦痛，亿劫无原。 或报讫受生，方为异类。 或为猪鹅鸡鸭，生杀由人。 或为驼马牛驴，受人驾驭。 或为糜鹿野兽，飞鸟禽鱼，毒虺恶蛇，豺狼虎豹，递相啖食，展转无穷。 或得为人，身婴六疾，盲聋暗哑，足跛手挛，徧体脓疮，举身烂坏，鼻梁崩倒，癫病痴狂。 或长病缠绵，困苦床枕。 或形容丑陋，智慧不圆。 或冻饿饥寒，贫穷孤露。 或为下贱奴婢之身，拘抑由人，不得自在。 如是等罪，如影随形，亿劫轮回，未尝休息。 是时众会，见此因缘，悲叹惊嗟，咸怀慈愍。 於是众内，有一真人，名曰法解，即从座起，从容雅步，严整衣冠，稽首天尊，五体投地，前进作礼，上白天尊言：臣奉侍以来，于兹累劫，三清境界，金阙琼宫，恬淡无为，逍遥快乐。 宴游真域，餐听法音。 自此欢娱，动经载劫。 不曾见此生死因缘，六道循环，无穷苦恼。 不审向来光内所见罪魂，众苦备经，受罪无已。 前生何犯，今世何缘，致受此身缠诸痛苦。 恩惟大圣示以未闻，得悟罪根因缘所起。 施大法药，医救沈沦。 震大法音，开悟愚暗。 霪大法雨，灌沐身心。 散大法云，荫覆群品。 秉大法炬，照烛幽昏。 开大法门，汲引群迷。 如蒙慈诲，仰荷玄恩。 尔时，天尊答法解曰：善哉善哉。 汝以慈悯，念此众生，善得机宜，请问妙法，为将来世一切有情，作法舟航，作法灯烛，作法梯凳，作法桥梁。 济度群生，出离罪恼。 破诸地狱，升彼天堂。 弥历劫年，度人无量。 谛听谛听，当为说之。 夫世末时讹，人民浇伪，为善者少，为恶者多，不孝不忠，不仁不义，不慈不信，不让不廉，傲忽正真，轻慢三宝，訾毁经典，诽谤法门，害物伤生，贪残无厌，六情五欲，三业十缠，营造罪根，结诸恶业，自作自受，犹响应声，终劫说之，亦难可尽，略举其要。 罪恶源由，名曰三涂五苦八难。 此等恶趣，出离最难。 非我法门，无由超度。 所言三涂者，一者地狱，考对前非； 二者畜生，偿酬往业； 三者饿鬼，苦对最深，渴饮火精，饥则食炭。",
      "translated_text": "**The Supreme Cavernous Mystery Numinous Treasure Sutra of Deliverance from the Three Paths and Five Sufferings to Transcend Birth and Death**\n\n**Sutra Title:** *The Supreme Cavernous Mystery Numinous Treasure Sutra of Deliverance from the Three Paths and Five Sufferings to Transcend Birth and Death*. The compiler is unknown, likely composed during the Northern and Southern Dynasties or the Sui-Tang period. It expounds upon the karmic retributions of the wheel of rebirth and exhorts the cultivation of meritorious deeds and fields of blessing. One scroll.\n\n**Source of the Base Text:** *Daoist Canon of the Zhengtong Era*, Cavernous Mystery Division, *Benwen* Category.\n\n---\n\n**The Supreme Cavernous Mystery Numinous Treasure Sutra of Deliverance from the Three Paths and Five Sufferings to Transcend Birth and Death**\n\nAt that time, the Numinous Treasure Heavenly Worthy was in the Fragrant Grove Garden of the Ever-Joyful World, expounding the subtle and wondrous true sutra of the Mysterious Unity and the principle of the Non-Dual Wondrous Gate and the Profound Mystery to the Five Venerable Sovereigns, the Ten Ultimate Perfected, the Three Clarities, and the boundless assembly of sagely hosts. All those present heard the Dharma-sound, awakened to the subtle and imperceptible, and attained the realm of true constancy. The joy of humans and gods was beyond description.\n\nThen, the Heavenly Worthy emitted a nine-colored radiance of subtle and wondrous light, universally illuminating the boundless worlds of the ten directions. Heaven above and earth below, within and without, were all pervasively luminous, like lapis lazuli, without obstruction. Thereupon, the immeasurable beings in the hells beneath the Nine Dark Realms were seen enduring manifold torments. In the thirty-six prisons, sinful souls were examined and punished; the enforcing divine soldiers, the mighty heavenly warriors, the Three Officials and Nine Bureaus, the one hundred and twenty offices—all administered tortures without respite. Some embraced bronze pillars, some lay upon iron beds, some ascended knife mountains, some climbed sword trees; their bodies bore iron staves, their heads wore mountains of fire. Some entered cauldrons of boiling liquid, some passed through furnaces of charcoal; they were hung upside down or stood inverted, crushed and ground, parched by drinking fiery essence, starved by eating embers. Molten bronze was poured into their mouths, and fire blazed in every joint. Some were pressed by boulders, their bodies pierced by needle points; some leapt north and south within pits of burning coals. In freezing ice, their flesh and bones split apart; they were sawed asunder, hacked by blades, pecked by birds, swallowed by serpents. Some were nailed with long spikes, some had their tongues plowed by iron plows; some languished in filth and stench, some were submerged in dark and boundless waves. Some bore iron mountains on their backs, filling rivers and flooding seas. Some had their spines broken by ox-head demons, some were gnawed by bronze dogs. In an instant, they died ten thousand deaths, enduring boundless suffering for kalpas without end. When their retributions were exhausted, they were reborn as other kinds: as pigs, geese, chickens, ducks—slaughtered at human whim; as camels, horses, oxen, donkeys—subjected to human control; as deer, wild beasts, flying birds, fish, venomous vipers, evil serpents, jackals, wolves, tigers, leopards—devouring one another in endless succession. If reborn as humans, they were afflicted with the six illnesses: blindness, deafness, muteness, lameness, crippled hands, festering sores covering their bodies, flesh rotting away, noses collapsing, leprosy, madness, and idiocy. Some suffered from chronic illnesses, bedridden in misery; some were hideous in appearance, lacking in wisdom; some endured freezing cold, hunger, and poverty, destitute and alone; some were born as lowly slaves and servants, restrained and oppressed by others, without freedom. Such sins followed them like shadows, and for kalpas they revolved in the wheel of rebirth without respite.\n\nAt that time, the assembly, witnessing these causes and conditions, sighed in sorrow and lamentation, filled with compassion. Then, from among the assembly, a Perfected One named Dharma-Comprehension arose from his seat, composed and dignified, adjusting his robes and cap. He prostrated before the Heavenly Worthy, touching his head to the ground, advanced, and made obeisance, addressing the Heavenly Worthy: \"Since I have attended upon You, through countless kalpas in the realms of the Three Clarities, the golden palaces and jade towers, I have dwelt in tranquility and non-action, roaming freely in bliss. I have wandered the domains of the Perfected, feasting and listening to the Dharma-sound. Such joy has endured for kalpas untold. Yet never before have I witnessed these causes and conditions of birth and death, the endless cycle of the six paths, and the boundless suffering. I do not know what transgressions these sin",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1230,
      "start_sentence": 0,
      "end_sentence": 58,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.400558948516846,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝三涂五苦拔度生死妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "五苦者，刀山剑树，铜柱镬汤，涟汲溟波，是名五苦。 八难者，一者得生人道，二者去女为男，三者形体完全，四者得生中国，五者值有道君父，六者禀性慈仁，七者值国土太平，八者与三宝相遇。 八者备足，是大善因，有不备者，是名为难。 以此诸苦，流浪不还，展转漂沈，与道长隔。 耽淫五浊，执滞六情，外触内侵，殃缠祸染，眼耳鼻舌身意六尘，好丑是非，念念相续，一失人路，堕地狱中，长夜冥冥，无由解脱。 法解又曰：众生妄想，不识正真，执系是非，循环罪业，运心任意，皆是罪缘。 人生几何，即生即灭。 如彼石火，不得久长。 如彼浮泡，曾无坚固。 生老病死，日夜相侵。 变灭不常，须臾散坏，苟得富贵，犹暂片时。 况更饥贫，忧悲苦恼，或婴六疾，不具足身，及至死亡，又还地狱。 如是之苦，甚可哀伤。 惟愿大慈，广开方便，示以大道，拯拔之门，使此辈罪魂，及来生男女，咸得法利，普入福堂。 天尊答曰：若有众生三业净者，不堕三涂。 所言三业者，身业、心业、口业是也。 身业者，淫杀偷盗。 心业者，嗔贪愚痴。 口业者，绮言妄语，两舌恶骂。 此三业者，是十业根，障蔽善缘，滋生罪恼，若能清净，永免三涂。 若有众生，五毒净者，即离五苦。 所言五毒者，眼观五色，耳听五声，鼻贪五香，舌知五味，心生五欲，为五毒根，终劫缠绵，无有解脱。 若能清净，五苦永除。 若有众生，修八行者，超度八难，与道合真。 所言八行者，一者孝行，二者仁慈，三者贞廉，四者忠信，五者善忍，六者柔和，七者奉戒持斋，冥心大道，八者平等接物，无有冤亲。 以此熏修，善功充满，身超八难，永契仙阶。 此上法门，修行要义，转粗入妙，证道登真。 三世天尊，十方大圣，皆修此行，升入无为。 汝以慈悲，愍念群品，应当敷演，宣示未闻，於苦海之中，爱河之内，以吾法教，捞漉众生，使来世男女，咸知修奉，出烦恼网，断疑惑根，登解脱山，到逍遥境。 身心清净，深入法门。 法解又曰：三业五毒、八行等门，不可思议，最真最妙。 将来之世，及见在人天，闻此法音，便应解悟。 况更精进，依按修行，当知是人，决定成道。 然地狱之内，见在幽魂，拘闭寒庭，往来长夜，风刀切骨，众苦婴身，食怠无停，轮回不已。 及诸来世，一切之人，或有死亡，应当迁拔，愿垂开悟，赐以诀言，使人鬼蒙恩，死生开度。 天尊答曰：迁拔之格，救度之文，三洞众经，具有成典。 今当为汝宣说要言，谛听受持，广加流布。 夫学道之士，立德立功，炼气坐忘，修真服御，宣经演教，佐国度人。 种种皆修，是真行业。 功行虽备，果业虽圆。 亦须先度九玄七祖，父母亡灵，迁拔生天，鬼箓尽除，身方得道。 况复世界流俗之人，若孝顺男女，父母亡殁，及诸眷属，应有终亡，恐彼鬼灵，堕三恶道。 或入地狱，或入罗酆，幽间冥冥，备经众苦。 须凭功德，广修福田。 救度穷魂，解消冤结。 过此境界，东极宫中，有寻声救苦天尊，大慈仁者。 发弘誓愿，普救众生，亿亿劫中，度人无量。 但能回向，一念归依，注想尊容，称扬名号，寻声赴感，应念垂慈，一切苦中，无不救护，是故名号救苦天尊。 广劝众生，勤加礼念。",
      "translated_text": "The Five Sufferings are: the mountains of knives and forests of swords, the bronze pillars and boiling cauldrons, the endless waves of the dark sea—these are called the Five Sufferings.\n\nThe Eight Difficulties are:\n1. To be born in the human realm,\n2. To depart from the female form and become male,\n3. To possess a complete and unblemished body,\n4. To be born in the Central Kingdom,\n5. To encounter a sovereign or father of the Dao,\n6. To be endowed with a nature of kindness and benevolence,\n7. To dwell in a land of great peace,\n8. To encounter the Three Treasures.\nWhen all eight are fulfilled, it is the greatest of good causes. If any are lacking, it is called difficulty.\n\nBy these manifold sufferings, one drifts and cannot return, tossed and submerged, forever severed from the Dao. Indulging in the Five Defilements, clinging to the Six Desires, assailed by external temptations and internal afflictions, entangled in calamities and stained by misfortunes—the six senses of eye, ear, nose, tongue, body, and mind, with their objects of beauty and ugliness, right and wrong, thoughts arising in unbroken succession—once the human path is lost, one falls into hell, where the long night is dark and there is no means of deliverance.\n\nThe Dharma-Comprehension further said: \"Sentient beings, deluded by false thoughts, fail to recognize the true and real. They cling to right and wrong, cycling through karmic transgressions, following the dictates of their minds and desires—all these are the causes of sin. How fleeting is human life, arising and perishing in an instant, like a spark from stone, never enduring long, like a floating bubble, utterly without solidity. Birth, aging, sickness, and death assail one day and night. Change and decay are constant; in an instant, all disperses and crumbles. Even if one attains wealth and nobility, it is but a brief moment. How much more for those who suffer hunger and poverty, grief and sorrow, or are afflicted by the six illnesses, their bodies incomplete—when death comes, they return once more to hell. Such suffering is truly pitiable. I only wish that Your Great Compassion may widely open the gates of expedient means, reveal the Great Dao, and establish the path of deliverance, so that these sinful souls and future men and women may all receive the blessings of the Dharma and universally enter the hall of fortune.\"\n\nThe Heavenly Worthy replied: \"If there are sentient beings whose Three Actions are pure, they will not fall into the Three Wretched Paths. The Three Actions are: bodily action, mental action, and verbal action. Bodily action consists of lust, killing, and theft. Mental action consists of anger, greed, ignorance, and delusion. Verbal action consists of frivolous speech, falsehood, divisive words, and abusive language. These Three Actions are the roots of the Ten Actions; they obstruct good causes and breed sin and affliction. If one can purify them, one will forever avoid the Three Wretched Paths. If there are sentient beings whose Five Poisons are purified, they will escape the Five Sufferings. The Five Poisons are: the eyes beholding the five colors, the ears hearing the five sounds, the nose coveting the five fragrances, the tongue tasting the five flavors, and the mind generating the five desires—these are the roots of the Five Poisons. For kalpas unending, one remains entangled, with no liberation. If one can purify them, the Five Sufferings will be forever eradicated. If there are sentient beings who cultivate the Eight Practices, they will transcend the Eight Difficulties and unite with the Dao in truth. The Eight Practices are:\n1. Filial piety,\n2. Benevolence and kindness,\n3. Chastity and integrity,\n4. Loyalty and sincerity,\n5. Forbearance and goodness,\n6. Gentleness and harmony,\n7. Upholding the precepts and fasting, meditating on the Great Dao,\n8. Treating all beings with equality, without enmity or partiality.\nBy cultivating these, merit and virtue become full; the body transcends the Eight Difficulties and forever ascends the ranks of immortality. These are the essential principles of practice in the above Dharma-gates, transforming the coarse into the subtle and attaining the Dao to ascend to perfection. The Heavenly Worthies of the Three Times and the Great Sages of the Ten Directions all cultivated these practices to ascend into the realm of non-action. Out of compassion, you pity the multitudes; you should expound and proclaim what has not yet been heard. In the midst of the sea of suffering and the river of craving, with my Dharma-teachings, you shall rescue and dredge up sentient beings, so that men and women of future generations may all know to cultivate and revere, escape the net of afflictions, sever the roots of doubt, ascend the mountain of liberation, and reach the realm of carefree wandering. With body and mind purified, they shall deeply enter the Dharma-gates.\"\n\nThe Dharma-Comprehension further said: \"The gates of the Three Actions, Five Poisons, and Eight Practices are inconceivable, most true and most wondrous. In future worlds and among the present beings of heaven and earth, those who hear this Dharma-sound should awaken and understand. How much more for those who diligently advance and cultivate in accordance with these teachings—they shall certainly attain the Dao. Yet within the hells, the present imprisoned souls, confined in the cold courts, wander through the long night, their bones cut by the wind and knives, their bodies afflicted by manifold sufferings, their hunger and weariness unceasing, their cycles of rebirth endless. And for all the people of future generations, when death comes, they should be delivered. I pray that You may bestow enlightenment and grant them the decisive words, so that both the living and the dead may receive Your grace and be delivered in life and death.\"\n\nThe Heavenly Worthy replied: \"The standards for deliverance and the texts for salvation are fully contained in the scriptures of the Three Caverns. Now I shall proclaim the essential words for you. Listen carefully, receive, and uphold them, and widely disseminate them. Those who study the Dao should establish virtue and merit, refine their qi and sit in forgetfulness, cultivate the real and ingest the elixirs, proclaim the scriptures and expound the teachings, assist the state and deliver the people. To practice all these is true action. Though merit and practice may be complete and the fruits of karma perfect, one must first deliver the nine generations of ancestors and the seven generations of forebears, the departed spirits of parents, and cause them to ascend to heaven. Only when the ghostly registers are entirely cleared may the body attain the Dao. How much more for the people of the world, bound by worldly customs—if filial sons and daughters, upon the death of their parents and all their kin, fear that those ghostly spirits may fall into the Three Evil Paths, enter hell, or be confined in Fengdu, where the darkness is profound and they endure manifold sufferings—they must rely on merit and virtue, widely cultivate fields of blessings, deliver the destitute souls, and dissolve karmic entanglements. Beyond this realm, in the Eastern Palace of Ultimate Extremity, there is the Heavenly Worthy of Instantaneous Salvation through Sound, the Great Compassionate One. He has made vast vows to universally save sentient beings; for countless kalpas, he has delivered beings without number. If one can dedicate merit, turn the mind in a single thought of refuge, visualize his august countenance, and invoke his name, he will respond to the call, come to the aid, and in all suffering, there is none he will not save and protect. Therefore, he is called the Heavenly Worthy of Salvation through Suffering. Widely exhort all beings to diligently pay homage and invoke him.\"",
      "overlap_context": "d upon You, through countless kalpas in the realms of the Three Clarities, the golden palaces and jade towers, I have dwelt in tranquility and non-action, roaming freely in bliss. I have wandered the domains of the Perfected, feasting and listening to the Dharma-sound. Such joy has endured for kalpas untold. Yet never before have I witnessed these causes and conditions of birth and death, the endless cycle of the six paths, and the boundless suffering. I do not know what transgressions these sin",
      "start_char": 1230,
      "end_char": 2450,
      "start_sentence": 59,
      "end_sentence": 107,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.38037610054016,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝三涂五苦拔度生死妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "复次三洞经典之中，济苦拔亡，然灯为上，五方八极，地狱幽牢，存阴极之乡，长夜之境，死魂囚闭，不见三光。 冥暗之间，经诸拷掠，宜造一灯树，然九卮灯，自初终亡，至於七七，灯光相续，下照九幽，睹此光明，即当解脱。 又以缯彩，造迁神宝磨，长四十九尺，或作小旛七首，悬於长竿，任风飞扬，万罪皆灭。 又纸墨缣素，书写此经，散施学人，流传读诵，亡魂超度，地狱宁闲，福善所资，庆延后世。 其有珍玩服饰，平昔资财，广施寒栖，济恤贫乏，此之功德，亦类於前，黑籍落名，地司除简，神升争土，随愿往生。 利佑子孙，断绝殃疰，巍巍福善，难可称量。 是故应当勤心谛受，宣行付嘱，普度人天。 尔时，会中闻此法缘，高尊上圣、三界真仙、侍卫威灵、天兵骑吏、无鞅数众，一切职司，洞达无为，齐升道果，三台地狱，无量罪魂，俱获善功，应时解脱，十方诸狱，炉炭镬汤，尽变清凉，无复忧苦。 天真太上，天人龙鬼，预在法筵，闻此经典，欢喜信受，泰敬奉行，作礼而退。 太上洞玄灵宝三途五苦拔度生死妙经竟",
      "translated_text": "Furthermore, among the Three Caverns’ scriptures, those that relieve suffering and deliver the departed, the kindling of lamps is supreme. Across the five directions and eight extremities, within the dark prisons of hell—the regions of utmost yin and the realms of eternal night—departed souls are imprisoned, cut off from the Three Luminaries. Amidst the gloom, they endure all manner of torture and torment. One should fashion a lamp-tree and kindle nine cups of lamps, continuing from the moment of death through the seven sevens. As the lamp-light persists, it shines downward into the Nine Netherworlds. Upon beholding this radiance, the souls shall immediately attain liberation.\n\nMoreover, with silken banners, one may craft a *Treasure Mill for Transmigrating Spirits*, forty-nine feet in length, or fashion seven small pennants to hang from a tall pole, allowing them to flutter in the wind, whereby all sins are extinguished. Additionally, one may transcribe this scripture upon paper or fine silk, distribute it to learners, and propagate its recitation. Thereby, the departed shall ascend beyond suffering, the hells shall know tranquility, and the blessings of the virtuous shall extend to future generations.\n\nThose who offer precious adornments, garments, or their lifelong possessions to shelter the destitute and relieve the impoverished shall accrue merit akin to the foregoing. Their names shall be stricken from the Black Registers, their records expunged by the Earthly Offices, and their spirits shall ascend to the divine realms, reborn according to their vows. Their descendants shall be blessed, freed from calamities and afflictions, and their boundless virtue and goodness shall defy all measure.\n\nTherefore, one ought to diligently and sincerely receive these teachings, propagate and entrust them widely, and universally deliver both humans and devas. At that time, the assembly—comprising exalted sages, the Three Realms’ perfected immortals, the guardian spirits, the celestial soldiers and mounted officers, and the innumerable hosts of all offices—all attained effortless enlightenment, ascending together to the Dao-fruit. The Three Terraces of Hell and the countless suffering souls therein all gained merit and were instantly liberated. The ten directions’ prisons, with their cauldrons and boiling vats, transformed into cool purity, free from all sorrow and distress.\n\nThe Heavenly Perfected, the devas, humans, dragons, and ghosts present in the Dharma assembly heard this scripture with joy, faithfully received it, reverently upheld it, made obeisance, and withdrew.\n\nThus concludes *The Wondrous Scripture of the Highest Numinous Treasure on Deliverance from the Three Paths and Five Sufferings, Liberating from Birth and Death*.",
      "overlap_context": " has made vast vows to universally save sentient beings; for countless kalpas, he has delivered beings without number. If one can dedicate merit, turn the mind in a single thought of refuge, visualize his august countenance, and invoke his name, he will respond to the call, come to the aid, and in all suffering, there is none he will not save and protect. Therefore, he is called the Heavenly Worthy of Salvation through Suffering. Widely exhort all beings to diligently pay homage and invoke him.\"",
      "start_char": 2450,
      "end_char": 2871,
      "start_sentence": 108,
      "end_sentence": 117,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.828160762786865,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝三涂五苦拔度生死妙经.txt",
        "category": "本文类"
      }
    }
  ]
}