{
  "source_id": "太上黄庭外景玉经",
  "source_file": "chunked_daozang\\太上黄庭外景玉经.json",
  "total_chunks": 2,
  "total_original_chars": 1823,
  "total_translated_chars": 11934,
  "total_translation_time": 62.129143476486206,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\本文类\\太上黄庭外景玉经.txt",
    "category": "本文类"
  },
  "full_translation": "**The Supreme Yellow Court Outer Radiance Jade Scripture**\n\n**Scripture Title:** *The Supreme Yellow Court Outer Radiance Jade Scripture*. Also known as *The Yellow Court Outer Radiance Scripture*. Author unknown. Composed during the Jin dynasty. One fascicle. Base text from *The Orthodox Daoist Canon*, *Dongxuan* section, *Benwen* category. Collated with: (1) the annotated edition by Wuchengzi in *The Seven Bamboo Tablets of the Cloudy Satchel*; (2) the annotated edition by Jiang Guozuo in *Essentials of the Daoist Canon*, *Weiji* vol. 2 (hereafter \"Jiang's edition\").\n\n---\n\n### **The Supreme Yellow Court Outer Radiance Jade Scripture, Part One**\n\nThe Supreme One, in leisurely retreat, composed these seven-character verses,\nExpounding the body’s form and the various spirits.\nAbove lies the Yellow Court, below the Pass of Origin;\nBehind, the Dark Gate, and before, the Gate of Life.\n\nInhaling and exhaling through the Chamber of Lu, entering the Cinnabar Field,\nThe Jade Pool’s pure water irrigates the numinous root.\nThose who can cultivate this may abide long.\n\nThe person within the Yellow Court wears vermilion robes;\nThe Pass Gate’s sturdy bolts seal its double doors.\nThe Dark Gate flanks it, towering and majestic,\nWhile within the Cinnabar Field, essence is subtle and obscure.\n\nThe Jade Pool’s pure water generates fat above,\nThe numinous root stands firm, never aging nor decaying.\nWithin the Central Pool dwells a person clad in red,\nThree inches below the field, where the spirit resides.\n\nInner and outer are distant, doubly sealed—\nWithin the Spirit Chamber, one must cultivate and order.\nThe Dark Throat’s black conduit receives the essence talisman;\nHasten to secure your essence to sustain yourself.\n\nWithin the dwelling is a person ever clad in crimson.\nIf you can perceive them, you shall know no illness.\nThey stand transversely, a foot in length, binding above—\nIf you can guard this, you shall suffer no harm.\n\nInhaling and exhaling through the Chamber of Lu to repay yourself,\nPreserve and fortify it, and the body shall receive blessings.\nWithin the square inch, guard and conceal with care,\nAnd spirit and essence shall return, old age restored to youth.\n\nFlanking the Dark Gate, the flow descends to its end,\nNurturing the Jade Tree to flourish and grow strong.\n\nThe supreme Dao is not burdensome, without haste;\nThe Numinous Terrace connects to heaven, overlooking the central wilds.\nWithin the square inch, at the Pass below,\nWithin the Jade Chamber, the spirit’s gate and door—\nAll these were taught to me by the Noble Scion.\n\nThe Hall of Light extends in four directions, following the source of the Dharma Sea.\nThe Perfected One, Zidan, stands before me.\nWithin the Three Passes, essence and qi run deep—\nIf you wish not to die, cultivate Kunlun.\n\nThe Crimson Palace’s layered towers rise twelve stories high;\nWithin its chambers, the Five Blacks gather.\nThe Scarlet City’s scion stands in the Central Pool,\nBelow lies the Long Wall, its hue the dark valley’s shade.\n\nThe essential subtleties of long life lie in the chamber’s urgency:\nCast aside lust and desire, focus solely on preserving essence.\nThe inch-field and foot-dwelling can govern life—\nTether your heart, and peace shall long endure.\n\nObserve the will, let the spirit wander among the Three Marvels;\nIn leisure, without affairs, the heart is at great peace.\nConstantly preserve the Jade Chamber, and the spirit shall attain clarity;\nAt times, contemplate the Great Granary, and hunger and thirst shall cease.\nCommand the Six Dings and the divine maidens to attend—\nSeal the path of essence, and you may live long.\n\nWithin the central chamber dwells the spirit;\nWash and order the body, allowing no defilement.\nSurvey the five viscera, inspect their measures;\nThe six bowels, cultivated and cleansed, become pure as silk.\nEmptiness and spontaneity are the Dao’s principle.\n\nThings have their nature, affairs need not be burdensome.\nRecline in effortless non-action, and the body shall be at ease.\nThe dwelling of emptiness lies within the curtains—\nSilent and vast, the mouth utters no word.\nSerene and desireless, wandering the Garden of Virtue,\nPure and fragrant, the Jade Maiden abides.\nCultivate virtue, attain clarity—this is the Dao’s gate.\n\n**End of The Supreme Yellow Court Outer Radiance Jade Scripture, Part One**\n\n---\n\n### **The Supreme Yellow Court Outer Radiance Jade Scripture, Part Two**\n\nCultivating the Dao in carefree seclusion, dwelling in profound solitude,\nNurturing life and destiny, guarding emptiness and non-being.\nSerene and desireless, pondering what concerns,\nOnce the wings are fully grown, they spread in proper order—\nLong life and enduring vision, then one soars away.\n\nThe Five Phases, uneven yet sharing the same root and node,\nThe Three and Five unite in qi, their essence fundamentally one.\nWho shall contend with them, vying with sun and moon?\nEmbrace jade, hold pearls, harmonizing the chamber with the child.\n\nIf you can know this, all affairs are complete;\nHold fast to what you possess, and never lose it—\nThen you shall not die, entering the Golden Chamber.\n\nExiting with the sun, entering with the moon—this is my Dao.\nHeaven’s seven and earth’s three cycle in mutual guardianship.\nAscending and descending, advancing and retreating, only then is union enduring.\nJade and stone, resplendent—these are my treasures.\nYou possess them yourself; why not guard them?\n\nThe heart understands the root and nurtures the flower’s splendor;\nServe heaven, follow earth, and harmonize with stored essence.\nThe Ninefold Mound’s mountain—how lofty it stands!\nWithin dwells the Perfected One, whom you may command.\n\nThe Three Yangs within may grant long life;\nOn the fifth of seven days, they cycle in union.\nThe Kunlun mountain—do not lose your way!\nShielded by the Purple Palace and the Crimson City’s towers,\nFlanked by sun and moon like linked pearls,\nFor ten thousand years, radiant and boundless, without term.\n\nThe Three Yangs of the outer root come of themselves;\nNurturing the Three Yins within may grant long life.\nThe hun longs for heaven, the po enters the spring—\nReturning the hun, restoring the po, is the Dao’s nature.\n\n**End of The Supreme Yellow Court Outer Radiance Jade Scripture, Part Two**\n\n---\n\n### **The Supreme Yellow Court Outer Radiance Jade Scripture, Part Three**\n\nThe turning mechanism suspends pearls in endless rings;\nThe swift mare’s golden key remains ever whole and firm.\nBearing earth, suspending heaven, it encircles Qian and Kun.\nIts form follows the four seasons, red as cinnabar.\nBefore, reverent; behind, humble—each has its distinct gate.\nEscort it with returning cinnabar and dark spring,\nLike the tortoise drawing black to the numinous root.\n\nWithin dwells a Perfected One, head bound in golden cloth,\nArmor-clad, talisman in hand, opening the seven gates.\nThis is no branch or leaf—it is the true root.\nMeditate on it day and night, and you may abide long.\n\nThe weary Daoist is no spirit—\nIt is the accumulation of essence that grants longevity.\nAll people eat grains and the five flavors,\nYet only I consume the Great Harmony of yin and yang qi,\nThus able to avoid death, for heaven’s decree is so.\n\nLet me speak of the five viscera, each with its direction:\nThe heart is the lord of the state, master of the five viscera.\nWithin the mind, movement and stillness—qi flows as it should,\nThe Dao naturally sustains me, the spirit’s radiance shining.\n\nBy day, radiant and bright; by night, self-guarding.\nThirsty, I drink nectar; hungry, I am sated.\nTraversing the six bowels, storing at mao and you,\nTurning yang into yin, concealing within the nine—\nConstantly practicing this, one shall not age.\n\nThe liver’s qi, cultivated and long,\nArranges the five viscera, giving rise to the Three Lights.\nAbove, it harmonizes with the Triple Burner, drinking nectar.\nThe essence awaits heaven and earth—this is the Dao of long life.\nMy spirit, hun, and po reside at the center.\n\nEssence and fluid flow like springs, their fragrance issuing from the nose.\nStanding at the Dark Throat, embracing the Hall of Light,\nThey connect my flowery essence, regulating yin and yang.\n\n**End of The Supreme Yellow Court Outer Radiance Jade Scripture**\n\nBowing at the Mysterious Gate, awaiting the Heavenly Dao,\nIt draws near within my body, yet guards itself.\nPure now and non-acting, spirit lingers and abides,\nEssence and qi ascend and descend, their barriers and patterns distinct.\n\nThe seven apertures now open, and one knows not aging.\nReturning to sit at Heaven’s Gate, awaiting yin and yang,\nDescending through the throat to commune with spirit’s radiance,\nPassing beneath the Floral Canopy, clear and cool.\n\nEntering the Pure Void Abyss, beholding my form,\nWhen the cyclical elixir is complete, long life may be attained.\nReturning past the Floral Pool, stirring kidney essence,\nGazing upon the Hall of Light, nearing the Cinnabar Field,\nIt summons all spirits to open the Gate of Life,\nUnobstructing the Heavenly Dao, concealing the numinous root.\n\nYin and yang arrayed like streaming stars,\nThe liver’s qi like a ring, endless and without end.\nThe lung’s virtue arises with the Triple Burner,\nBowing at Heaven’s Gate, awaiting the ancient Dao.\n\nPure fluid and sweet springs flow through the six bowels,\nFollowing the nose up and down, opening the two ears.\nGazing upon heaven and earth, preserving the youthful lad,\nHarmonizing essence and flower, ordering hair and teeth.\n\nComplexion luminous and lustrous, never whitening with age,\nDescending through the throat, how vast and boundless!\nAll spirits gather, seeking one another,\nEntering the Crimson Palace, its hue like purple blossoms.\n\nConcealed beneath the Floral Canopy, communing with the Spirit Hut,\nDevotedly guarding the heart’s spirit, transmitting mutual calls.\nBeholding my spirits, repelling and dispelling evil,\nThe spleen’s spirit returns to rely on the great house,\nNurturing the numinous root, never to wither again.\nReaching the stomach’s conduit, penetrating the Void,\nSealing the Gate of Life like a jade capital,\nLifespan transmitted for ten thousand years and more.\n\nThe spirit within the spleen roams the Central Palace,\nMorning assembly with the five spirits, harmonizing the Three Lights.\nAbove, it joins the Heavenly Dao and the Hall of Light,\nUnobstructing the six bowels, regulating the five phases.\n\nMetal, wood, water, fire, earth as sovereigns,\nUnobstructing blood and vessels, sweat as nectar.\nThe two spirits unite, descending with Jade Essence,\nAbove, receiving primordial qi, years ever lengthening.\n\nPatrolling and protecting the seven apertures, dispelling misfortune,\nSun and moon arrayed, unfolding yin and yang.\nBowing at Great Yin, completing its form,\nOf the five viscera’s lords, the kidney is essence.\n\nExiting and entering the two qi, entering the Yellow Court,\nBreathing the Void, beholding my form,\nStrengthening my sinews and bones, completing blood and vessels.\n\nIn the indistinct and unseen, passing through pure numinosity,\nSitting beneath the hut, observing the youthful lad,\nDay and night abiding in spirit’s radiant light,\nExiting through no gate, entering through no door.\n\nSerene and desireless, nurturing the flower’s root,\nIngesting the mysterious qi, one may attain immortality.\nReturning through the seven gates, drinking from the Great Abyss,\nPassing through my throat, traversing pure numinosity,\nInquiring of the immortal’s path and wondrous arts,\nIngesting numinous mushrooms and Jade Essence.\n\nHead crowned with white silk, feet at the Cinnabar Field,\nBathing in the Floral Pool, irrigating the numinous root.\nThe three palaces in harmony, opening the Gate of Life,\nThe five flavors all arriving, good virtue returning.\n\nThe great Dao vast and boundless, the heart untroubled,\nWith unbound hair, practicing this, one may long endure.\nMy words are complete—do not recklessly transmit them.\n\n**End of The Supreme Yellow Court Outer Radiance Jade Scripture**",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上黄庭外景玉经 经名：太上黄庭外景玉经。 又名《黄庭外景经》。 不着撰人。 成书朴晋。 一春。 底本出处：《正统道藏》洞玄却本文类，参校版本：一、《云笈七签》所收务成子注本。 二、《道藏辑要》尾集二所收蒋国祚注本（简称将本）。 太上黄庭外景玉经 太上黄庭外景玉经上 太上闲居作七言，解说身形及诸神，上有黄庭下关元，后有幽阙前命门。 呼吸庐间入丹田，玉池清水灌灵根，审能修之可长存。 黄庭中人衣朱衣，关门壮钥合两扉，幽阙侠之高巍巍，丹田之中精黑微。 玉池清水上生肥，灵根坚固老不衰。 中池有士衣赤衣，田下三寸神所居。 中外相距重闭之，神庐之中当修理。 玄膺黑管受精符，急固子精以自持。 宅中有士常衣绛，子能见之可不病，横立长尺约其上，子能守之可无恙。 呼嗡庐问以自偿，保守完坚身受庆。 方寸之中谨盖藏，精神还归老复壮。 侠以幽阙流下竟，养子玉树令可壮。 至道不烦无旁午，灵台通天临中野，方寸之中至关下，玉房之中神门户，皆是公子教我者。 明堂四达法海源，真人子丹当吾前，三关之中精气深，子欲不死修昆仑。 绛官重楼十二级，官室之中五黑集，赤城之子中池立，下有长城玄谷色。 长生要妙房中急，弃捐淫欲专守精，寸田尺宅可理生，系系子长留心安宁。 观志游神三奇灵，闲暇无事心太平。 常存玉房神明达，时念太仓不饥渴，役使六丁神女谒，闭子精路可长活。 正室之中神所居，洗身自理无敢污。 历观五脏视节度，六腑修治洁如素，虚无自然道之故。 物有自然事不烦，垂拱无为身体安，虚无之居在帏问，寂寞旷然口不言，恬淡无欲游德园，清争香洁玉女存，修德明达道之门。 太上黄庭外景玉经上竟 太上黄庭外景玉经中 作道优游深独居，扶养性命守虚无，恬淡无为向#1思虑，羽翼已成正扶疏，长生久视乃飞去。 五行参差同根节，三五合气要本一，谁与共之斗日月，抱玉怀珠和子室。 子能知之万事毕，子自有之持勿失，即得不死入金室。 出日入月是吾道，天七地三#2回相守，升降进退合乃久，玉石珞珞是吾宝，子自有之何不守。 心晓根基养华采，服天顺地合藏精，九原之山何亭亭，中住真人可使令。 内阳三神可长生，七日之五回相合。 昆仑之山不迷误，蔽以紫宫丹城楼，侠以日月如连珠，万岁昭昭非有期。 外本三阳神自来，内养三阴可长生，魂欲上天魄入泉，还魂返魄道自然。 太上黄庭外景玉经中竟 #1向：疑当作『何』。 #2三：原作『二』，据文义改。 太上黄庭外景玉经下 游玑悬珠环无端，迅牝金钥常完坚，载地悬天周乾坤，象以四时赤如丹，前仰后卑各异门，送以还丹与玄泉，象龟引黑至灵根。 中有真人巾金巾，负甲持符开七门，此非枝叶实是根，昼夜思之可长存。 倦人道士非有神，积精所致为专年，人皆食谷与五味，独食太和阴阳黑，故能不死天相既。 试说五脏各有方，心为国主五脏主，意中动静黑得行，道自持我神明光。 昼日昭昭夜自守，渴自饮浆饥得饱，经历六腑藏卯酉，转阳之阴藏於九，常能行之不知老。 肝之为黑修而长，罗列五脏生三光，上合三焦道饮浆，精候天地长生道，我神魂魄在中央。 精液流泉去鼻香，立於玄膺含明堂，通我华精调阴阳。",
      "translated_text": "**The Supreme Yellow Court Outer Radiance Jade Scripture**\n\n**Scripture Title:** *The Supreme Yellow Court Outer Radiance Jade Scripture*. Also known as *The Yellow Court Outer Radiance Scripture*. Author unknown. Composed during the Jin dynasty. One fascicle. Base text from *The Orthodox Daoist Canon*, *Dongxuan* section, *Benwen* category. Collated with: (1) the annotated edition by Wuchengzi in *The Seven Bamboo Tablets of the Cloudy Satchel*; (2) the annotated edition by Jiang Guozuo in *Essentials of the Daoist Canon*, *Weiji* vol. 2 (hereafter \"Jiang's edition\").\n\n---\n\n### **The Supreme Yellow Court Outer Radiance Jade Scripture, Part One**\n\nThe Supreme One, in leisurely retreat, composed these seven-character verses,\nExpounding the body’s form and the various spirits.\nAbove lies the Yellow Court, below the Pass of Origin;\nBehind, the Dark Gate, and before, the Gate of Life.\n\nInhaling and exhaling through the Chamber of Lu, entering the Cinnabar Field,\nThe Jade Pool’s pure water irrigates the numinous root.\nThose who can cultivate this may abide long.\n\nThe person within the Yellow Court wears vermilion robes;\nThe Pass Gate’s sturdy bolts seal its double doors.\nThe Dark Gate flanks it, towering and majestic,\nWhile within the Cinnabar Field, essence is subtle and obscure.\n\nThe Jade Pool’s pure water generates fat above,\nThe numinous root stands firm, never aging nor decaying.\nWithin the Central Pool dwells a person clad in red,\nThree inches below the field, where the spirit resides.\n\nInner and outer are distant, doubly sealed—\nWithin the Spirit Chamber, one must cultivate and order.\nThe Dark Throat’s black conduit receives the essence talisman;\nHasten to secure your essence to sustain yourself.\n\nWithin the dwelling is a person ever clad in crimson.\nIf you can perceive them, you shall know no illness.\nThey stand transversely, a foot in length, binding above—\nIf you can guard this, you shall suffer no harm.\n\nInhaling and exhaling through the Chamber of Lu to repay yourself,\nPreserve and fortify it, and the body shall receive blessings.\nWithin the square inch, guard and conceal with care,\nAnd spirit and essence shall return, old age restored to youth.\n\nFlanking the Dark Gate, the flow descends to its end,\nNurturing the Jade Tree to flourish and grow strong.\n\nThe supreme Dao is not burdensome, without haste;\nThe Numinous Terrace connects to heaven, overlooking the central wilds.\nWithin the square inch, at the Pass below,\nWithin the Jade Chamber, the spirit’s gate and door—\nAll these were taught to me by the Noble Scion.\n\nThe Hall of Light extends in four directions, following the source of the Dharma Sea.\nThe Perfected One, Zidan, stands before me.\nWithin the Three Passes, essence and qi run deep—\nIf you wish not to die, cultivate Kunlun.\n\nThe Crimson Palace’s layered towers rise twelve stories high;\nWithin its chambers, the Five Blacks gather.\nThe Scarlet City’s scion stands in the Central Pool,\nBelow lies the Long Wall, its hue the dark valley’s shade.\n\nThe essential subtleties of long life lie in the chamber’s urgency:\nCast aside lust and desire, focus solely on preserving essence.\nThe inch-field and foot-dwelling can govern life—\nTether your heart, and peace shall long endure.\n\nObserve the will, let the spirit wander among the Three Marvels;\nIn leisure, without affairs, the heart is at great peace.\nConstantly preserve the Jade Chamber, and the spirit shall attain clarity;\nAt times, contemplate the Great Granary, and hunger and thirst shall cease.\nCommand the Six Dings and the divine maidens to attend—\nSeal the path of essence, and you may live long.\n\nWithin the central chamber dwells the spirit;\nWash and order the body, allowing no defilement.\nSurvey the five viscera, inspect their measures;\nThe six bowels, cultivated and cleansed, become pure as silk.\nEmptiness and spontaneity are the Dao’s principle.\n\nThings have their nature, affairs need not be burdensome.\nRecline in effortless non-action, and the body shall be at ease.\nThe dwelling of emptiness lies within the curtains—\nSilent and vast, the mouth utters no word.\nSerene and desireless, wandering the Garden of Virtue,\nPure and fragrant, the Jade Maiden abides.\nCultivate virtue, attain clarity—this is the Dao’s gate.\n\n**End of The Supreme Yellow Court Outer Radiance Jade Scripture, Part One**\n\n---\n\n### **The Supreme Yellow Court Outer Radiance Jade Scripture, Part Two**\n\nCultivating the Dao in carefree seclusion, dwelling in profound solitude,\nNurturing life and destiny, guarding emptiness and non-being.\nSerene and desireless, pondering what concerns,\nOnce the wings are fully grown, they spread in proper order—\nLong life and enduring vision, then one soars away.\n\nThe Five Phases, uneven yet sharing the same root and node,\nThe Three and Five unite in qi, their essence fundamentally one.\nWho shall contend with them, vying with sun and moon?\nEmbrace jade, hold pearls, harmonizing the chamber with the child.\n\nIf you can know this, all affairs are complete;\nHold fast to what you possess, and never lose it—\nThen you shall not die, entering the Golden Chamber.\n\nExiting with the sun, entering with the moon—this is my Dao.\nHeaven’s seven and earth’s three cycle in mutual guardianship.\nAscending and descending, advancing and retreating, only then is union enduring.\nJade and stone, resplendent—these are my treasures.\nYou possess them yourself; why not guard them?\n\nThe heart understands the root and nurtures the flower’s splendor;\nServe heaven, follow earth, and harmonize with stored essence.\nThe Ninefold Mound’s mountain—how lofty it stands!\nWithin dwells the Perfected One, whom you may command.\n\nThe Three Yangs within may grant long life;\nOn the fifth of seven days, they cycle in union.\nThe Kunlun mountain—do not lose your way!\nShielded by the Purple Palace and the Crimson City’s towers,\nFlanked by sun and moon like linked pearls,\nFor ten thousand years, radiant and boundless, without term.\n\nThe Three Yangs of the outer root come of themselves;\nNurturing the Three Yins within may grant long life.\nThe hun longs for heaven, the po enters the spring—\nReturning the hun, restoring the po, is the Dao’s nature.\n\n**End of The Supreme Yellow Court Outer Radiance Jade Scripture, Part Two**\n\n---\n\n### **The Supreme Yellow Court Outer Radiance Jade Scripture, Part Three**\n\nThe turning mechanism suspends pearls in endless rings;\nThe swift mare’s golden key remains ever whole and firm.\nBearing earth, suspending heaven, it encircles Qian and Kun.\nIts form follows the four seasons, red as cinnabar.\nBefore, reverent; behind, humble—each has its distinct gate.\nEscort it with returning cinnabar and dark spring,\nLike the tortoise drawing black to the numinous root.\n\nWithin dwells a Perfected One, head bound in golden cloth,\nArmor-clad, talisman in hand, opening the seven gates.\nThis is no branch or leaf—it is the true root.\nMeditate on it day and night, and you may abide long.\n\nThe weary Daoist is no spirit—\nIt is the accumulation of essence that grants longevity.\nAll people eat grains and the five flavors,\nYet only I consume the Great Harmony of yin and yang qi,\nThus able to avoid death, for heaven’s decree is so.\n\nLet me speak of the five viscera, each with its direction:\nThe heart is the lord of the state, master of the five viscera.\nWithin the mind, movement and stillness—qi flows as it should,\nThe Dao naturally sustains me, the spirit’s radiance shining.\n\nBy day, radiant and bright; by night, self-guarding.\nThirsty, I drink nectar; hungry, I am sated.\nTraversing the six bowels, storing at mao and you,\nTurning yang into yin, concealing within the nine—\nConstantly practicing this, one shall not age.\n\nThe liver’s qi, cultivated and long,\nArranges the five viscera, giving rise to the Three Lights.\nAbove, it harmonizes with the Triple Burner, drinking nectar.\nThe essence awaits heaven and earth—this is the Dao of long life.\nMy spirit, hun, and po reside at the center.\n\nEssence and fluid flow like springs, their fragrance issuing from the nose.\nStanding at the Dark Throat, embracing the Hall of Light,\nThey connect my flowery essence, regulating yin and yang.\n\n**End of The Supreme Yellow Court Outer Radiance Jade Scripture**",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1253,
      "start_sentence": 0,
      "end_sentence": 50,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.96864104270935,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上黄庭外景玉经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "伏於玄门候天道，近在我身还自守，清今无为神留止，精气上下关分理。 七孔已通不知老，还坐天门候阴阳，下於喉咙通神明，过华盖下清且冻。 入清虚渊见吾形，期成还丹可长生，还过华池动肾精，望於明堂临丹田，将使诸神开命门，通利天道藏灵根。 阴阳列布如流星，肝气似环终无端，肺之为黑三焦起，伏於天门候故道。 清液醴泉通六府，随鼻上下开二耳，窥视天地存童子，调和精华理发齿。 颜色光泽老不白，下於喉咙何落落，诸神皆会相求索，下入绛宫紫华色。 隐藏华盖通神庐，专守心神传相呼。 观我诸神辟除邪，脾神还归依大家，藏养灵根不复枯，至於胃管通虚无，闭塞命门似玉都，寿传万岁将有余。 脾中之神游中宫，朝会五神和三光，上合天黑及明堂，通利六府调五行。 金木水火土为王，通利血脉汗为浆，二神相得下玉英，上禀元气年益长。 循护七窍去不祥，日月列布张阴阳，伏於太阴成其形，五脏之主肾为精。 出入二黑入黄庭，呼吸虚无见吾形，强我筋骨血脉成。 恍惚不见过清灵，坐於庐下观小童，日一夕存在神明光，出於无门入无户。 恬淡无欲养华根，服食玄黑可遂生。 还返七门饮太渊，通我喉咙过清灵，问於仙道与奇功，服食灵芝与玉英。 头戴白素足丹田，沐浴华池灌灵根，三府相得开命门，五味皆至善黑还。 大道荡荡心勿烦，被发行之可长存，吾言毕矣勿妄传。 太上黄庭外景玉经下竟",
      "translated_text": "Bowing at the Mysterious Gate, awaiting the Heavenly Dao,\nIt draws near within my body, yet guards itself.\nPure now and non-acting, spirit lingers and abides,\nEssence and qi ascend and descend, their barriers and patterns distinct.\n\nThe seven apertures now open, and one knows not aging.\nReturning to sit at Heaven’s Gate, awaiting yin and yang,\nDescending through the throat to commune with spirit’s radiance,\nPassing beneath the Floral Canopy, clear and cool.\n\nEntering the Pure Void Abyss, beholding my form,\nWhen the cyclical elixir is complete, long life may be attained.\nReturning past the Floral Pool, stirring kidney essence,\nGazing upon the Hall of Light, nearing the Cinnabar Field,\nIt summons all spirits to open the Gate of Life,\nUnobstructing the Heavenly Dao, concealing the numinous root.\n\nYin and yang arrayed like streaming stars,\nThe liver’s qi like a ring, endless and without end.\nThe lung’s virtue arises with the Triple Burner,\nBowing at Heaven’s Gate, awaiting the ancient Dao.\n\nPure fluid and sweet springs flow through the six bowels,\nFollowing the nose up and down, opening the two ears.\nGazing upon heaven and earth, preserving the youthful lad,\nHarmonizing essence and flower, ordering hair and teeth.\n\nComplexion luminous and lustrous, never whitening with age,\nDescending through the throat, how vast and boundless!\nAll spirits gather, seeking one another,\nEntering the Crimson Palace, its hue like purple blossoms.\n\nConcealed beneath the Floral Canopy, communing with the Spirit Hut,\nDevotedly guarding the heart’s spirit, transmitting mutual calls.\nBeholding my spirits, repelling and dispelling evil,\nThe spleen’s spirit returns to rely on the great house,\nNurturing the numinous root, never to wither again.\nReaching the stomach’s conduit, penetrating the Void,\nSealing the Gate of Life like a jade capital,\nLifespan transmitted for ten thousand years and more.\n\nThe spirit within the spleen roams the Central Palace,\nMorning assembly with the five spirits, harmonizing the Three Lights.\nAbove, it joins the Heavenly Dao and the Hall of Light,\nUnobstructing the six bowels, regulating the five phases.\n\nMetal, wood, water, fire, earth as sovereigns,\nUnobstructing blood and vessels, sweat as nectar.\nThe two spirits unite, descending with Jade Essence,\nAbove, receiving primordial qi, years ever lengthening.\n\nPatrolling and protecting the seven apertures, dispelling misfortune,\nSun and moon arrayed, unfolding yin and yang.\nBowing at Great Yin, completing its form,\nOf the five viscera’s lords, the kidney is essence.\n\nExiting and entering the two qi, entering the Yellow Court,\nBreathing the Void, beholding my form,\nStrengthening my sinews and bones, completing blood and vessels.\n\nIn the indistinct and unseen, passing through pure numinosity,\nSitting beneath the hut, observing the youthful lad,\nDay and night abiding in spirit’s radiant light,\nExiting through no gate, entering through no door.\n\nSerene and desireless, nurturing the flower’s root,\nIngesting the mysterious qi, one may attain immortality.\nReturning through the seven gates, drinking from the Great Abyss,\nPassing through my throat, traversing pure numinosity,\nInquiring of the immortal’s path and wondrous arts,\nIngesting numinous mushrooms and Jade Essence.\n\nHead crowned with white silk, feet at the Cinnabar Field,\nBathing in the Floral Pool, irrigating the numinous root.\nThe three palaces in harmony, opening the Gate of Life,\nThe five flavors all arriving, good virtue returning.\n\nThe great Dao vast and boundless, the heart untroubled,\nWith unbound hair, practicing this, one may long endure.\nMy words are complete—do not recklessly transmit them.\n\n**End of The Supreme Yellow Court Outer Radiance Jade Scripture**",
      "overlap_context": "d long,\nArranges the five viscera, giving rise to the Three Lights.\nAbove, it harmonizes with the Triple Burner, drinking nectar.\nThe essence awaits heaven and earth—this is the Dao of long life.\nMy spirit, hun, and po reside at the center.\n\nEssence and fluid flow like springs, their fragrance issuing from the nose.\nStanding at the Dark Throat, embracing the Hall of Light,\nThey connect my flowery essence, regulating yin and yang.\n\n**End of The Supreme Yellow Court Outer Radiance Jade Scripture**",
      "start_char": 1253,
      "end_char": 1796,
      "start_sentence": 51,
      "end_sentence": 68,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.160502433776855,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上黄庭外景玉经.txt",
        "category": "本文类"
      }
    }
  ]
}