{
  "source_id": "太乙火府奏告祈禳仪",
  "source_file": "chunked_daozang\\太乙火府奏告祈禳仪.json",
  "total_chunks": 8,
  "total_original_chars": 5898,
  "total_translated_chars": 40603,
  "total_translation_time": 203.72857880592346,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\威仪类\\太乙火府奏告祈禳仪.txt",
    "category": "威仪类"
  },
  "full_translation": "**Liturgical Petition to the Fire Bureau of the Great One for Prayer and Exorcism**\n\n**Title:** *Liturgical Petition to the Fire Bureau of the Great One for Prayer and Exorcism*\n**Author:** Unknown\n**Volume:** One\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, *Weiyi* Category\n\n---\n\n**Liturgical Petition to the Fire Bureau of the Great One for Prayer and Exorcism**\n\nProceed with ethereal steps,\nBurn the talisman in the water vessel to purge defilement.\n\nThe Great Void has no form,\nPurity and filth alike are empty.\nFalse perceptions arise in an instant,\nWorldly entanglements contend in their wake.\nSince this is no true realm,\nIt is but a demonic palace.\nThus, in practice and discipline,\nOne must first sweep clean.\n\nWith reverence, we present the true talisman and summon:\nThe Nine Phoenixes, Great Generals of Defilement-Breaking;\nThe Mighty Divine Beings of the Eight Directions;\nThe Envoys of the *Qianluo Danna* and the Cavernous *Gang* of the Supreme Mystery;\nThe Divine Lords of the Five Dragons of the Five Directions;\nThe Lady of the Flowery Pond and the Ritual Ablution;\nThe Emissaries of the Azure Waters in Brocade Robes;\nThe Generals Who Devour Demons and Consume Ghosts;\nThe Bronze-Headed, Iron-Faced Mounted Officers;\nThe Immortal Spirits who bear the registers of the Daoist precepts;\nThe Officers Who Resolve Defilement and Harmonize the *Gan*—\nAll are respectfully invited to heed the primordial descent,\nTo assemble at the sacred precinct,\nTo spread *qi* and invoke the spirits,\nTo cast bells and hurl fire,\nTo transform the dharma-water,\nTo purge the foul *qi* from the eight limits,\nTo sever and annihilate demonic essences,\nTo spread the true wind across the ten poles,\nTo make the myriad spirits tremble in submission,\nTo purify the ten directions,\nTo clear the heavens of miasmic defilement,\nTo cleanse the earth of demonic dust,\nTo illumine the darkness with wisdom,\nTo embrace the vastness of the mysterious and profound—\nAll as commanded.\n\n**Next:** Recitation of the *Divine Incantation for the Purity of Heaven and Earth*, followed by the raising of the floral offering.\n\nThe master performs the triple bow and offers incense.\n\nThe Dao is studied in the heart,\nFaith is conveyed through the fragrant smoke.\nHolding the jade censer,\nThe heart abides in the Nine Heavens.\nThe true spirits gaze downward,\nThe immortal sieves descend to the hall.\nAll that your servant now petitions,\nMay it be granted as spoken.\n\nKneeling in silent invocation.\n\nThe humble servant [Name], in reverent offering of true incense, with utmost awe and trepidation, prostrates and bows his head to humbly address and make supplication to the following:\n\nThe Most High Jade Clarity Sacred Realm, the Primordial Heavenly Worthy of Original Beginning;\nThe Highest Clarity True Realm, the Heavenly Worthy of Numinous Treasure;\nThe Grand Clarity Immortal Realm, the Heavenly Worthy of Dao and Virtue;\nThe August Heavenly Supreme Jade Emperor;\nThe Stellar Lord, the Northern Pole Purple Tenuity Great Emperor;\nThe Heavenly Emperor of the Grand Tenuity;\nThe Earth Spirit, the Queen of Earth who Upholds Heaven and Emulates the Dao, the Divine Radiance True King, the Great Emperor of Longevity;\nThe Eastern Pole Azure Radiance Great Emperor;\nThe Heavenly Worthy of Universal Transformation through the Thunderous Voice of the Nine Heavens;\nThe Great Emperor, Ancestor of Thunder in the Nine Heavens;\nThe Great Heavenly Emperor of the Highest Clarity Purple Tenuity Azure Jade Palace;\nThe Great Emperors of the Six Heavens of Profound Abyss;\nThe Lord Emperors of the Six Waves of Heaven;\nThe True Lord, Controller of the Han, the Venerable Master;\nThe True Lord, Envoy of Inspection in the Nine Heavens;\nThe Heavenly Worthies of the Five Directions and Five Elders;\nThe Heavenly Worthies of Numinous Treasure in the Ten Directions;\nThe Lords of the Thirty-Two Heavens;\nThe Highest Perfected of the Various Heavens;\nThe True Sovereigns of the Ten Poles and Ten Radiant Realms;\nThe Divine Immortals of the Jade Chapters and Daoist Canon;\nThe Heavenly Lord of the Northern Dipper, Dragon Han;\nThe Heavenly Empress of the Northern Dipper, the Golden Perfected of Purple Radiance, the Sagely Virtue Queen of Heaven;\nThe Nine August Sovereigns of the Central Heavenly Northern Dipper;\nThe Star Lords of the Imperial Thrones within the Dipper;\nThe Inner Consorts, the Nine August Ladies of the Northern Dipper;\nThe Two Divine Envoys, the Bearers of the Goat and Rāhu;\nThe Divine Immortals, Spirit Officials, and Generals within the Dipper;\nThe Star Lord of the Great Saint of Heavenly Stem, Commander of the Myriad Perfected;\nThe Star Lords of the Sun Palace and Moon Mansion;\nThe Stellar Governors of the Five Directions and Five Virtues;\nThe Four Luminaries of the Mysterious Capital;\nThe Six Controllers of the Southern Dipper;\nThe Three Dippers of the Eastern, Western, and Central Heavens;\nThe Three Terraces and Canopy Star Lords;\nThe Twenty-Eight Constellations;\nThe Twelve Zodiacal Star Lords;\nThe Stellar Sovereigns of the Celestial Phenomena throughout the Heavens;\nThe Great Emperor of Longevity and Life-Registration at the Southern Pole;\nThe Stellar Lords of Fortune, Prosperity, and Longevity at the Southern Pole;\nThe Primordial Lady of the Golden Perfection and Myriad Qi at the Western Terrace;\nThe Stellar Lords of the Original Destiny, Fortune, Prosperity, and Longevity of One’s Natal Year;\nThe Stellar Lords of the Greater and Lesser Cycles, and the Horses of Fortune;\nThe Stellar Sovereigns Governing the Current Year’s Illumination;\nThe Great Emperors of the Three Primes and Three Officials;\nThe Heavenly Emperor of the Northern Pole, Azure Heaven;\nThe Heavenly Emperor of the Northern Pole, Vermilion Heaven;\nThe Heavenly Emperor of the Northern Pole, Radiant Heaven;\nThe Heavenly Emperor of the Northern Pole, Mysterious Heaven;\nThe True Lord of Myriad Blessings, the Grand Heavenly Court;\nThe True Lord of Life-Registration in the Jade Calendar, the Heavenly Court;\nThe True Lord, Minister of Excess, the Heavenly Court;\nThe True Lords of Fortune, Prosperity, and Longevity Registration, the Heavenly Court;\nThe Boundless True Sovereigns of the Heavenly Court Assemblies;\nThe Great Emperor of Life-Generation in the Nine Heavens;\nThe True Lord of Destiny-Determination and Blessing-Storage in the Nine Heavens;\nThe True Lord, Minister of Life-Command in the Nine Heavens;\nThe Great Spirits of Life-Monitoring in the Nine Heavens;\nThe Sagely Mother and Primordial Lady of the Nine Heavens’ Womb Protection;\nThe True Sovereigns of the Nine Heavens’ Audience Assemblies;\nThe Divine Spirits of the Star River Bridge and Pagoda of Life and Transformation;\nThe True Lords of the Five Thunder Courts;\nThe True Lord of the Thunder Bureau, the Primordial Destiny;\nThe True Lords of the Three Ministries of the Northern Pole, the Great Mysterious Capital, and the Expeller of Evil;\nThe True Lords, Scribes of the Three Ministries;\nThe Five Masters of Numinous Treasure;\nThe Purple Court Instructor of the Fire Mansion, Master Feng;\nThe Patriarchal Perfected, the Reclusive Master Chen;\nThe Patriarchal Perfected, the Master of Penetrating Mystery, Liu;\nThe Patriarchal Perfected, the Central Heavenly Pivot, the Demon-Quelling Master Xu;\nThe Patriarchal Perfected, the Cloud-Clad Master Yang of Hidden Clarity;\nThe Patriarchal Perfected, Master Huang of Cloud Manor;\nThe Lineage Master, the Wind and Rain Commander of the Western Terrace, Master Ye of Jade Field;\nThe Illustrious Perfected of the Fire Mansion through the Ages;\nThe Lord of the Fire Mansion, the Thunder Marshal General Li;\nThe Marshal General of Manifest Obedience, Marshal Qiu;\nThe Vice Marshal General of Numinous Transformation, Marshal Wang;\nThe Thunder Pivot Great Spirit, Marshal Chen;\nThe Thunder Mechanism Great Spirit, Marshal Li;\nThe Thunder Guard Great Spirit, Marshal Kong;\nThe Thunder Fierce Great Spirit, Marshal Cui;\nThe Thunder Radiance Great Spirit, Marshal Zhou;\nThe Thunder Command Great Spirit, Marshal Ji;\nThe Thunder Formation Great Spirit, Marshal Liu;\nThe Thunder Might Great Spirit, Marshal Lin;\nThe Dispatcher of Household Documents, Marshal Bai;\nThe Direct Memorialist, Marshal Xie—\nAll are summoned to open the altar and heed the command.\n\nThe Four Great Thunder Spirits, the officials, generals, and soldiers of the various ranks within the Dharma;\nThe Water Mansion and Earth Controllers;\nThe Boundless True Sovereigns;\nThe Divine Spirits of the Sacred Peaks and Waterways in the mortal realm;\nThe Perfected Immortals of the renowned mountains and grotto-heavens;\nThe True Sovereigns of the Thunder Mansion’s Dark Bureau;\nThe Augustly Virtuous Honored Spirit of the Current Year’s Grand Year Star;\nThe Divine Spirits of the Five Sacrifices within the Inner Court;\nThe City Gods of the Capital;\nThe Divine Spirits of the Temples and Shrines within the Capital Region;\nThe Illuminated Spirits of the incense offerings at this altar and sanctuary;\nThe Day-Dividing Merit Recorders and Envoys;\nThe Divine Immortals traversing the Void;\nThe Boundless True Sovereigns to whom this petition is addressed—\nMay they deign to turn their gaze in response to this humble servant’s reverent address.\n\nReflecting upon this unworthy servant’s meager merits, I have presumptuously intruded upon the profound mysteries, yet remain without accomplishment in aiding others, and bear transgressions in my duties. In this humble position, I have only received the submitted petitions—how dare I ever forget to beseech your mandates?\n\nWith this present offering, for so-and-so, who reverently follows the ritual teachings, solemnly establishes the Star Altar, kindles the Dipper’s lamps in likeness, and casts talismans for divination—\n\nMay the loftiness of Heaven and the remoteness of the stars deign to respond to this single devotion as though descending in full assembly;\nMay the vastness of Earth and the depths of rivers and seas not scorn these halting steps, but grant their presence in completion;\nLike pearls suspended or millet grains arrayed, may the ritual unfold as a forest of soaring branches—\nMay the post-horses pause and the chariot teams halt, encircling the altar in the form of coiled dragons, while jade pendants chime and sashes drape in ordered ranks like egrets in flight, to hear the sacred liturgy and together ascend the wondrous Dao.\n\nThis humble servant, presuming upon your majesty, prostrates himself in utmost trepidation and reverence. With bowed head and repeated bows, he respectfully declares:\n\nInvoke the Heavenly Worthies for Disaster-Dispelling and Calamity-Resolving.\nSummon the Generals—ignite and burn the Command Talismans for Descent.\nCall forth the Community Deities and the Six Spirits.\nHeavenly Numinous! Heavenly Numinous! Mighty spirits of the Three Realms!\nWoodland specters and wayward ghosts—be reduced to fine dust by this command!\nWind, Thunder, and Rain Departments, the Divine Kings of the Four Waterways,\nThe True Lords of the Five Peaks—each guard the altar’s bounds.\nDistinguish and transmit these petitions upward to the Jade Clarity.\n\nSwiftly, swiftly, in accordance with the statutes and decrees of the Great Crimson Heavenly Emperor!\n\nSummon the Four Generals.\nBy edict of the Upper Clarity, swiftly call forth the Thunder Gods!\nThe Four Generals of the Altar’s Guard—hasten to overthrow all obstacles!\nThe Five Peaks and Four Waterways—heed this mighty summons!\nHasten to descend, each taking your place in the palace halls.\nReceive the talisman and execute the command, presenting your report before the Jade Clarity.\n\nSwiftly, swiftly, by decree of the Great Crimson Heavenly Emperor!\n\nHeavenly Soldiers! Heavenly Soldiers! Earthly Numinous! Earthly Numinous!\nAs yin and yang converge, let the Thunder Department manifest its form!\nSolemnly summon the Four Great Heavenly Generals—Gao, Tao, Cui, and Zhao—to swiftly arrive at the altar.\nVisualize their presence at the four corners.\n\nInvoke the Heavenly Worthy of Numinous Communication and Response.\n\nSummon Xie Bai. Burn the talisman.\n\nIn the profound and obscure, heaven and earth are born as one.\nDivine transformations swift and fleeting, gathering to take form.\nAt the call, instantly arrive; at the summons, swiftly attend.\nSwiftly, swiftly, by decree of the Great Crimson Heavenly Emperor.\n\nNow I submit this memorial—before the altar, heed and await.\nAll petitions and wishes shall be conveyed to the imperial presence.\nOn this day, the talismanic attendant Xie Youbai follows the master’s command.\nSwiftly, swiftly, as the Great Crimson Heavenly Emperor’s salvation decree.\n\n*Zi* appears at *wen*, *wu* emerges at *chū*.\nInvoke the Heavenly Worthy of Numinous Communication and Response.\n\nOṃ dou hūṃ hūṃ—Brahma’s response, thunder’s roar, all is seized.\nOṃ xìng jiū pán tuó lì—seize the ghosts and spirits under heaven.\nBy the master’s command, swiftly as fire, urgently obey the Great Crimson Heavenly Emperor’s decree.\n\n*Wu* appears at *wen*. Visualize their arrival.\nHaving received the summons, they have bathed and come.\nToday, on behalf of so-and-so, I humbly request:\nCompose your majestic dignity, guard and shield the altar’s sanctity.\nOpen the gates of heaven, seal the doors of earth.\nSecure the passes of tigers and leopards.\nAscend to the imperial court, treading upon cloud roots.\nDraw near the dragon and phoenix chariots.\nEnhance the radiance of divine favor, silently align with numinous blessings.\n\nInvoke the Heavenly Worthy of the Golden Truth, Expounder of the Teachings.\n\nDescend, Master.\n\nTo learn without a master—profound principles are difficult to grasp alone.\nTeaching must be upright; the supreme Dao is wondrously transmitted heart-to-heart.\nVessels and channels flow as one; lineage branches continue unbroken.\nThus did the Most High solemnly establish the rites of transmission.\nHence later generations deeply revere succession.\nFor all who take refuge, how dare we forget to invoke and report?\n\nWe, the disciples under your gate, together with the officiating officers,\nIn silent contemplation of the master’s chamber,\nWith sincere devotion, bow and invoke:\nAncestral Master Feng the Perfected of the Purple Mansion, Initiator of the Teachings;\nAncestral Master Chen the Perfected of Pure Simplicity and Wondrous Dao, the Recluse;\nAncestral Master Liu the Perfected, Supreme Minister of the Great Ultimate, Communicator of the Mysteries;\nAncestral Master Xu the Perfected, Central Heaven’s Pivot, Subduer of Demons;\nAncestral Master Yang the Perfected, Cloud-Clad Recluse of Qingyin;\nAncestral Master Huang the Perfected, True Constant Master Yunzhuang of Pucheng;\nLineage Master Ye the Perfected of Yutian, Wind and Rain Commander of the Western Terrace;\nAnd all the successive masters of the Fire Mansion who have expounded and propagated the teachings.\nWe reverently hope for the master’s compassion, to deign to take notice.\nMay your clarity and brilliance be heard, embodied in talismans and auspicious signs through the ages.\nMay dreams convey the sacred mother’s numinous script, grandly manifesting in the Kaiyuan era.\nMay the leaves of the jiao altar be moved, and extraordinary omens appear to the Supreme One.\nThe texts of the stone chamber, hidden in the Shu capital’s lineage.\nThe Most High Lord Lao renewed and came forth—\nBeneath the mountain, the green ox demoness was captured and dragged to the well’s iron chain.\nThe literary star shines auspiciously; the Pivot Mansion stores good fortune.\nBy day, fire flows and the sky swells—emptiness reveals its transformations.\nBy night, colored clouds thread the Dipper—treading light, the spirit soars.\nThose who inherit from Pucheng may be guides and markers.\nThose who continue from Yutian are worthy of emulation.\nAt a whistle, winds churn and thunder roars; at a gesture, rain ceases and winds still.\nInscribed in the eight-character family record, eternally bestowing generation after generation.\nCrowned with the Daoist arts of all ranks, flourishing through descendants without end.\n\nOn this evening, we reverently pray:\nJade pendants chime, rosy clouds drift in the ethereal distance.\nDescending from the celestial thoroughfare, transcending the dust of the mortal world.\nWith utmost care, we humbly present this to be heard.\n\nInvoke the Heavenly Worthy of the Dao, the Scriptures, the Master, and the Treasures.\nOffer incense to behold the Master.\n\nThe Cloud Chariot scatters flowers, offers tea—\n[Rank and Name], with utmost reverence, humbly petitions:\nThe Founding Masters who inaugurated the teachings—Master Feng of the Purple Mansion, Master Chen of Profound Stillness, Master Liu of Penetrating Mystery, Master Xu the Demon-Queller—and all the successive Masters of the Fire Mansion who transmitted the Dao, conferred the methods, and propagated the lineage—\nwe reverently gaze upon your compassion, humbly beseeching your regard and remembrance.\n\nWe have heard that the Dao you preserved and the lineage you upheld extend far through the veins and channels, their virtue and teachings reaching perfection, their models enduring through the refining and shaping of generations.\n\nToday, on behalf of [Name], we submit this plea, casting our lot with the Dipper’s pole, aligning with the stars’ celestial course.\n\nWe reflect with deep concern that we, mere remnants of the Mystery Gate, dwell in a realm of sparse talent. Our names are presumptuously appended to the immortal ranks, yet we have repeatedly violated the precepts and failed to comprehend the statutes and regulations of our ancestral teachings. We have recklessly usurped the practices, and without guidance, how could we hope to evoke a response?\n\nWe beseech your assent to the matters herein petitioned. May the Dipper’s decrees be proclaimed and disseminated, the stellar courts command their subordinates, the offices of Mystery respond in echo, and the generals whose destinies align with this mandate move in unison—form and shadow following, the steps of the *gang* connecting with the numinous, the talismans proving efficacious.\n\nWe, in our lowly station, are utterly without recourse, our devotion in prayer reaching its utmost. We speak with reverence.\n\nInvoke the Heavenly Worthy of the Seven Primes’ Protective Cover\n\nThe Lamp’s Radiance—\nWe have heard that the Dipper governs the Seven Primes, wielding the power of life, death, and illumination. The lamps, divided into five colors, reveal the mechanisms of fortune and misfortune. Their light illumines the human realm while their station resides in the heavens. By the red talismans, flames soar brilliantly; the celestial bodies above shine in unison with the radiant pole, as if the armillary sphere itself were in command. We humbly hope for a luminous response, that our devout prayers may be answered.\n\nThe Master kindles the lamp, the assembly chants the divine incantations—\nThe Master visualizes the Dipper’s alignment:\n*\"By the Supreme’s decree, the Dipper’s lamp is kindled.\nThe Seven Primes descend to save and deliver all beings.\nLeft Assistants and Right Aides manifest their mighty spirits.\nMarshal Tianpeng commands the heavenly hosts.\nThe Envoys of the Five Thunders, the Six Jia and Six Ding.\nThe Great Sage Zhenwu, the Three Stars of the Terrace.\nDispel illness, eradicate misfortune, sever the heads of demonic spirits.\nThose who defy the decree perish; those who obey it live.\nThe Dipper’s lamp shines—body and home are illuminated.\nFortune and longevity endure, ever preserving harmony.\nThe lamp’s radiance shines, guiding mortals to long life.\nThe three *hun* souls rest in health, the seven *po* souls in peace.\nThe bright lamp gathers light, wandering spirits do not flee.\nThe seven *po* souls remain secure, the myriad spirits all return.\nIn the Dipper’s luminous expanse, one dwells forever in splendor.\nThe Seven Primes descend, receiving the divine proclamation.\nThe lamp’s brightness or dimness reveals fortune or misfortune.\nBy the power of the mighty spirits, all wishes are fulfilled.\"*\n\nThe Talisman of the Basin is cast for divination—\nWe have heard that the clear and pure is the realm of divine water, and the attentive and receptive is the secret of the true talisman. By observing the movement within stillness, one may fathom the mechanisms of the sublime. We humbly pray that the light overflows with grace, the brush of fortune writes with spring’s warmth, and the pulse of life knows no end. Like a long-flowing river finding its course, may the direction we tread be brightly revealed.\n\nThe auspicious report and all documents are now to be proclaimed.\n\nProclaim the document, cast the basin, and summon the two messengers—\nThe Talisman is burned in the Fire Mansion of Taiyi to issue the summons:\n*\"The Dipper’s Star-Holding and Rāhu Messengers, the Dipper’s Attendant Officers, heed this proclamation and swiftly descend to the altar court.\nHasten by the decree of the Great Red Heavenly Emperor!\"*\n\nWithin the Dipper, there are generals who assist the turning of the jade armillary, discerning good and punishing evil, scrutinizing transgressions and false words. The Jade Balance issues commands, its might reigning over the Jasper Pool. At our call, come swiftly as wind and fire to the altar’s base. Do not delay or disobey.\nBy the decree of the Great Red Heavenly Emperor, hasten!\n\nThreefold Decree—\n*\"Oṃ! Cittī! Star Emperor Mahāsahā!\nDuo sāhālī! Dītī! Juśahā!\nOṃ! [ ]! Cittī! Śeṣa!\"*\n\nSpirits of the Dipper’s midst, numinous powers of the stellar bodies—\nTo the left, you are Radiant; to the right, Wondrously True.\nYour transformations are unfathomable, emerging from darkness and entering the unseen.\nWe now summon and invoke you—swiftly descend to the altar court.\nBy the decree of the Great Red Heavenly Emperor, hasten!\n\nVisualize their descent.\n\nThe Master announces the matter—\nThe talismans are burned and combined:\nJust now, the summons was issued, and we trust you have graciously descended. On this occasion, we, the altar’s host, perform the Dipper’s rites for [Name], to dissolve calamities and dispel misfortunes. We seek to welcome the celestial favor and extend our reverence. We dare to trouble your divine power to bear this combined talisman to the Dipper’s officials, requesting the descent of your benevolent radiance upon the lamp’s assembly, to be enacted in accordance with the decree. We await your luminous response with reverence.\n\nStep the Dipper’s steps, visualize the dispatch—\n\nThe Heavenly Worthy of Numinous Communication and Response\n\n[Rank and Name], together with the altar officers and the assembly, with united sincerity, humbly petition:\nThe Three Clarities’ August Sages, the Ten Poles’ Lofty Perfected, the Nine Sovereigns of the Northern Dipper, the myriad spirits and sages of the Four Mansion—\nThe Masters, Generals, and Marshals of the Fire Mansion, the deities observing the lamp’s feast—\nwe venture to offend your true compassion, humbly beseeching your luminous regard.\n\nWe have heard that burning incense returns to the void beneath the Flowery Canopy, its fragrant smoke already ascending in the sacred script. With minds stilled, we gaze toward the Northern Pole’s cinnabar clouds, longing to ride the golden chariot. Yet we remain in the desolate vastness of the *fan* qi, still separated from the world’s defilements.\n\nGazing up at the ninefold steps, we offer our single sincerity. Purple clouds billow over the crimson bridge, auspicious mists surge through the colorful banners. Embroidered robes lead the way, swiftly descending to the jasper altar; silver flames intertwine, as if the Dipper’s pole were arrayed in a forest of stars.\n\nWe, together with the altar officers, look afar toward the celestial steps, welcoming the stellar chariot.\n\nBurn the Talisman to Receive the Celestial Descent—\nInvoke the Descent of the Sages.\n\nWe, your humble servants, prostrate ourselves in profound reverence, and most respectfully invoke:\n\nThe Great Sage Father of the Dipper of the Central Heaven,\nThe Celestial Lord of the Dragon Han of the Northern Pole,\nThe Great Sage Mother of the Dipper of the Central Heaven,\nThe Heavenly Empress of Sacred Virtue and Golden Radiance,\nThe August Star Sovereign of Greedy Wolf of the North Dipper’s Net-Pole Palace,\nThe Supreme Emperor of the Numinous Pass Palace of the North Dipper,\nThe August Star Sovereign of Giant Gate,\nThe Star Sovereign of Store of Wealth of the North Dipper’s Purple Pole Palace,\nThe Star Sovereign of Literary Brilliance of the North Dipper’s Heavenly Motion Palace,\nThe Dipper Lord of the North Dipper’s Imperial Seat Palace,\nThe August Star Sovereign of Integrity and Chastity,\nThe Great Emperor of the North Dipper’s Supreme Palace,\nThe August Star Sovereign of Military Brilliance,\nThe Supreme Emperor of the North Dipper’s Pass-Convergence Palace,\nThe August Star Sovereign of Destruction,\nThe Great Emperor of the Cavern Yang Palace,\nThe August Star Sovereign of the Heavenly Honored Outer Assistant,\nThe Perfected of the Hidden Origin Palace,\nThe August Star Sovereign of the Inner Assistant,\nThe Nine August Life-Prolonging Ladies of the Great Sage North Dipper of the Central Heaven.\n\nWe, your humble servants, prostrate ourselves in gratitude, and reverently gaze toward the stellar compassion, beseeching the descent of the Jade Radiance upon the orchid dais.\n\nThe cloud chariot, having received our invocation, has graciously descended. We now prepare floating tea as our humble offering.\n\nPresenting the Tea—\n\nWe, your humble servants, together in sincerity, most respectfully address:\n\nThe Wondrous Dao of the Void Emperor of the Ten Poles,\nThe High Perfected of the Northern Pole,\nThe Celestial Lord of the Dragon Han of the *fan* qi,\nThe Heavenly Empress of Sacred Virtue and Golden Radiance,\nThe Great Dao Lords of the Nine Dipper Sovereigns,\nThe True Governors of the Dipper Palaces,\nThe Star Lords of our Original Destiny,\nThe Master Lords of the Fire Bureau,\nThe Heavenly Marshals of Thunder,\nThe Deities invoked at the Lamp Altar—\nwe reverently gaze toward your sagely compassion, beseeching your luminous regard.\n\nWe have heard that the dust of the world is as minute as a grain of sand, yet the subtle transformations of the Dao operate without bound. The Dipper governs the tally of yin in the human realm, truly manifesting unfathomable merit. From ancient times to the present, most numinous and most sagely, since the Supreme Ultimate first divided heaven and earth, the jade pivot has already arrayed itself at the Northern Asterism. The nine-petaled lotus blossoms forth at once, and the seven regulators of the Jade Balance give rise to the myriad kinds. Thus, though the nobility and baseness of human stations may differ, the illumination of destiny’s allotment remains unchanged. Whether called misfortune or fortune, calamity or blessing, all arise from the same origin, governed by the same sovereign. Yet their great compassion and great vows ever respond to devotion with descending mercy. By virtue of their profound power and profound grace, they repeatedly answer prayers in an instant. We now humbly lay bare our hearts, and as the sword-talismans align, the sagely chariot descends. The lamp flames blaze, and the divine radiance descends; the numinous conclave is complete. The dark effigy is arrayed in splendor, and the bright water and fragrant wine are presented as the first offering.\n\nRitual Proceedings—\n\nWe, your humble servants, together in sincerity, most respectfully address:\n\nThe Wondrous Dao of the Void Emperor of the Ten Poles,\nThe High Perfected,\nThe Celestial Lord of the Dragon Han of the *fan* qi,\nThe Heavenly Empress of Sacred Virtue and Golden Radiance,\nThe Great Dao Lords of the Nine Dipper Sovereigns,\nThe Boundless True Governors of the Dipper Palaces,\nThe Star Lords of our Original Destiny,\nThe Master Lords of the Fire Bureau,\nThe Marshal Generals of the Three Realms,\nand all the mighty numina—\nwe reverently gaze toward your sagely compassion, beseeching your luminous regard.\n\nWe have heard that in responding to the Nine Heavens and the Nine Earths, none are more revered than the Nine Sovereigns. Whether called the Northern Pole or the Northern Asterism, none are more illustrious than the North Dipper. Resplendent above, they traverse the heavens. Thus, all who possess ears and eyes cannot fail to see and hear.\n\nAnd all who possess life and destiny are equally endowed by this bestowal.\nTheir merit pervades the myriad transformations; their Dao/Way unites the Three Powers.\nVast as the numina of seas and mountains, they are revered; their subtle blessings, like the nurturing moisture of rain, are universally received.\nEven the fish and eels of rivers and streams turn their hearts in morning devotion—\nhow could any calamity not be dispelled, any blessing not be attained?\nYet what is felt must be communicated, what is sought must be answered; thus we present our earnest offering.\n\nWith pure sincerity, we, your humble servants, reverently address:\nThe Perfected of the Wondrous Dao/Way of the Supreme Void,\nThe Celestial Lord of the Dragon Han of the *fan* qi,\nThe Heavenly Empress of Sacred Virtue and Golden Radiance,\nThe Great Dao Lords of the Nine Dipper Sovereigns,\nThe Boundless True Governors of the Dipper Palaces,\nThe Star Lords of our Original Destiny,\nThe Master Lords of the Fire Bureau,\nThe Thunder Gods and Celestial Marshals,\nand all the mighty numina of the Three Realms—\nwe reverently gaze toward your sagely compassion, beseeching your luminous regard.\n\nWe have heard that they serve as the pivot and master,\ngoverning the six qi and directing the four seasons,\nordering the principles of governance, unifying Heaven and Earth,\nencompassing the five phases and presiding over the eight trigrams.\nTheir radiance descends upon the earthly realm; their station crowns the center of Heaven.\n\nIn the beginning, before the Great Simplicity, there was neither form nor image.\nYet since the formation of the Primal Yellow, transformation has followed its warp and weft.\nThe August Person took brush in hand to inscribe talismans; the Supreme One opened the scrolls to expound their mysteries.\nSeated upon the jade register, they taught the golden precepts.\nTreading the luminous path of their teachers, they revealed the subtleties of the ancestral texts.\nTheir commands soar as spirits; their audience with the Emperor is swift.\nThus the numinous writ of the Fire Bureau is made manifest.\n\nWe humbly recall that these teachings have been transmitted through generations,\nand we, your humble servants, are permitted to offer our earnest pleas.\nOur sunflower-and-bean sincerity may move you, though our meager offerings of stagnant waters and humble libations are unworthy.\nYet we present this clear water and fragrant wine as our final offering.\n\nThe ritual proceeds; memorials or petitions are presented.\nWe have heard that the Dao/Way is without intent yet may be sought through devotion;\nthe Supreme One revealed the canon of life extension.\nHeaven does not speak yet responds with perfect efficacy;\nthe Dipper Perfected bequeathed the statutes for averting misfortune.\nThe stellar chariots descend, their rosy hems gathered in assembly.\nThe rites of the three offerings now complete, how dare we falter in wholehearted devotion?\n\nWe recall that in high antiquity, knotted cords sufficed without written words.\nThen came the August Person, who took brush in hand to expound the luminous scriptures.\nThus, sealed petitions may convey our grateful pleas,\nand brush and paper may fully express our earnest intent.\nThe imperial hearing is near; the sagely regard is not distant.\nNine prostrations raise our gaze toward the celestial countenance;\nthrice we purify our hands to unfold the cloud-bound scriptures.\nThe golden chariots and jade carriages have already descended to the mortal dust.\nThe jade missives and golden writs shall soon bestow their gracious decrees in response.\n\nWe now command the divine officers of the ritual altar to swiftly bear our petition aloft.\nThus, we present:\nThe memorial text and the petition of the heart.\n\nWe shall kneel to make our reverent address.\nThe proclamation of the talismanic writ is complete.\n\nThe master paces the ritual steps, prostrates upon the earth, and awaits the divine response. Upon receiving it, he rises to offer incense.\n\n**Dissolving Calamities**\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves the calamities of the Three Disasters.\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves the calamities of the Four Malevolences.\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves the calamities of the Five Phases.\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves the calamities of the Six Harms.\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves the calamities of the Seven Injuries.\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves the calamities of the Eight Difficulties.\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves the calamities of the Nine Stars.\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves the calamities of husband and wife.\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves the calamities of men and women.\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves the calamities of childbirth.\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves the calamities of repeated misfortune.\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves the calamities of epidemics.\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves the calamities of illness and disease.\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves the calamities of malevolent spirits.\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves the calamities of tigers and wolves.\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves the calamities of insects and snakes.\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves the calamities of bandits and robbers.\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves the calamities of cangues and cudgels.\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves the calamities of unnatural death.\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves the calamities of curses and oaths.\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves the calamities of Heaven’s Net.\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves the calamities of Earth’s Snare.\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves the calamities of blades and weapons.\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves the calamities of water and fire.\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves all calamities.\n\nThus, the Seven Primes,\nGreat Sages of wondrous spiritual efficacy,\nDeliver and ferry across all calamities and hardships,\nLifting sentient beings from suffering.\nShould there be those who urgently invoke,\nRecitation ensures peace and safety.\nAll rely upon the generation of a hundred blessings,\nAll harmonize with the Five Phases.\nThe Three Hun souls attain peace and health,\nAnd malevolent spirits cannot linger.\nTrue qi descends from the Five Directions,\nAnd myriad blessings naturally converge.\nLongevity transcends the Eight Difficulties,\nAll through reverence for the Seven Stars.\nLife after life, the body remains at ease,\nAnd generation after generation, the spirit stays pure.\nGoodness mirrors the reflection in light,\nResponse echoes the sound within the valley.\nThe Three Primes’ spirits jointly guard,\nThe myriad sages’ eyes share clarity.\nWithout disaster, without obstruction,\nForever preserving the tranquility of the Dao-heart.\n\n**Transformation, Medical Treatment, Divination**\nWe, your humble servants, so-and-so and others, with utmost sincerity, reverently address the Supreme Void’s Wondrous Dao, the Ten August Perfected, the Brahma-qi Dragon Han Heavenly Lords, the Purple Radiance Golden Perfected Sagely Virtue Heavenly Empress, the Northern Dipper’s Nine August Dao Lords, the ranked true sovereigns of the Dipper Palace, the Star Lords of our original destiny, the Fire Mansion Master Lords, the Heavenly Thunder Masters, and all the exalted perfected invoked at the lamp altar. We gaze reverently toward your auspicious radiance, praying that your luminous regard may illumine us.\n\nWe have heard that repentance and reverence dare not transgress the scriptural teachings, and that earnest petitions may perhaps move the celestial heart. The rivers and seas are vast and deep, heaven and earth broad and great—there is nothing they do not encompass, nothing they do not embrace. Thus, there is that which is received, and that which is contained.\n\nWe humbly reflect that we, your servants, are but fleeting and insignificant lives, adrift in the midst of the world. Though we have roughly studied the Dao, we remain ashamed to follow the current. In observing the precepts, our conduct has been lacking; in cultivating ourselves, we have not been upright. The seven emotions and six desires still entangle us, and the three karmic actions and six senses remain impure. Thereby, though we have received the dharma, we have only invited further transgressions. We have concealed truth and feigned falsity, discoursed on emptiness and expounded on existence, leaked the secret purport of the mysterious precepts, and increased the sins recorded in the Black Book. Our actions accumulate many faults, and we dwell without a single good deed. At times, we tread the steps of the flying Dipper’s pace yet err in the sequence of left and right; or we focus our thoughts and direct our contemplation yet confuse what is heard and seen in their order. The offerings of incense and fire have not been without negligence, and the writing of talismans and registers has indeed been flawed.\n\nThough these transgressions may be unknown to others in the brightness of day, in the hidden darkness the gods are surely enraged. Now that we have revealed them and sought forgiveness, may we, your servants, be permitted to inscribe our names in the registers of the Upper Clarity’s capital, that our forms and spirits may ascend to the tranquil void and together pursue the wondrous journey. May our aspirations be truly pure, and may we forever serve the transformation of the Void and Non-being.\n\nWe first pray for celestial auspiciousness and earthly prosperity, for a sagely ruler and worthy ministers, for the sun and moon’s steadfast brightness, and for timely rain and sunshine. May the four seas be free of the omens of war, and may the people sing of years of abundance and joy.\n\nNext, we pray for the ritual master, so-and-so, that his fortune may align with the Great Harmony, that his destiny may surpass predetermination, and that no demonic forces may assail him. May the resources of his official salary and celestial horses support him, and may his body be endowed with luminous blessings. May his spirit be clarified and rectified, and may his entire household—young and old—enjoy peace and health in all four seasons.\n\nMay your servants’ seven generations of ancestors swiftly attain the realm of carefree wandering. May the lingering souls in the Three Wretched Realms all ascend to the land of bliss. May all sentient beings partake of your vast grace.\n\nNow, as the incense wanes and the precious talismans near their end, the water clock hastens its flow. The remaining light still shines afar upon the thatched hut, while the clear imperial progress has already preceded the imperial carriage. The ranks of mandarin ducks and egrets are heard in the jingling of their pendants; the phoenix’s call and the luan’s song are glimpsed in the order of their caps and robes. The rainbow banners and feathered canopies now rest in the celestial palace, while the tiger guards and dragon stewards return to the golden gates. The crimson mists and scarlet clouds billow, and the jade towers and gem chambers stand in lofty cold. We have fulfilled our initial intent, yet the end remains beyond reach. Our earnest devotion, swift in coming and fleeting in going, only deepens our lingering attachment.\n\nWe, your servants, along with the ritual master, gaze afar toward the celestial steps and take leave of the immortal’s chariot.\n\nThe rite of supplication and exorcism for the Great Unity Fire Mansion is now complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太乙火府奏告祈禳仪 经名：太乙火府奏告祈禳仪。 撰人不详。 一卷。 底本出处：《正统道藏》洞真部威仪类。 太乙火府奏告祈禳仪 举步虚 焚符於水盂诤秽 太虚无体，净秽皆空。 妄觉一生，尘缘竞起。 既非真境，即是魔宫。 是故行持，先当荡涤。 谨奉真符告召：九凤破秽大将军、八方大力威神、乾罗怛那洞罡太玄使者、五方五龙神君、华池文浴夫人、沧水绣衣使者、吞魔食鬼将军、铜头铁面骑吏，本佩法箓仙灵、解秽合干将吏，并请遵依元降齐赴灵场，布炁行神，流铃掷火，变化法水，荡秽气於八弦，斩馘魔精，布真风於十极，万灵振伏，十方肃清，天无氛秽，地无妖尘，冥慧洞清，大量玄玄，一如告命。 净天地神咒次举华夏 师三礼上香 道由心学，信假香传。 手执玉炉，心存九天。 真灵下盻，仙筛临轩。 臣今所启，咸赐如言。 跪默启",
      "translated_text": "**Liturgical Petition to the Fire Bureau of the Great One for Prayer and Exorcism**\n\n**Title:** *Liturgical Petition to the Fire Bureau of the Great One for Prayer and Exorcism*\n**Author:** Unknown\n**Volume:** One\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, *Weiyi* Category\n\n---\n\n**Liturgical Petition to the Fire Bureau of the Great One for Prayer and Exorcism**\n\nProceed with ethereal steps,\nBurn the talisman in the water vessel to purge defilement.\n\nThe Great Void has no form,\nPurity and filth alike are empty.\nFalse perceptions arise in an instant,\nWorldly entanglements contend in their wake.\nSince this is no true realm,\nIt is but a demonic palace.\nThus, in practice and discipline,\nOne must first sweep clean.\n\nWith reverence, we present the true talisman and summon:\nThe Nine Phoenixes, Great Generals of Defilement-Breaking;\nThe Mighty Divine Beings of the Eight Directions;\nThe Envoys of the *Qianluo Danna* and the Cavernous *Gang* of the Supreme Mystery;\nThe Divine Lords of the Five Dragons of the Five Directions;\nThe Lady of the Flowery Pond and the Ritual Ablution;\nThe Emissaries of the Azure Waters in Brocade Robes;\nThe Generals Who Devour Demons and Consume Ghosts;\nThe Bronze-Headed, Iron-Faced Mounted Officers;\nThe Immortal Spirits who bear the registers of the Daoist precepts;\nThe Officers Who Resolve Defilement and Harmonize the *Gan*—\nAll are respectfully invited to heed the primordial descent,\nTo assemble at the sacred precinct,\nTo spread *qi* and invoke the spirits,\nTo cast bells and hurl fire,\nTo transform the dharma-water,\nTo purge the foul *qi* from the eight limits,\nTo sever and annihilate demonic essences,\nTo spread the true wind across the ten poles,\nTo make the myriad spirits tremble in submission,\nTo purify the ten directions,\nTo clear the heavens of miasmic defilement,\nTo cleanse the earth of demonic dust,\nTo illumine the darkness with wisdom,\nTo embrace the vastness of the mysterious and profound—\nAll as commanded.\n\n**Next:** Recitation of the *Divine Incantation for the Purity of Heaven and Earth*, followed by the raising of the floral offering.\n\nThe master performs the triple bow and offers incense.\n\nThe Dao is studied in the heart,\nFaith is conveyed through the fragrant smoke.\nHolding the jade censer,\nThe heart abides in the Nine Heavens.\nThe true spirits gaze downward,\nThe immortal sieves descend to the hall.\nAll that your servant now petitions,\nMay it be granted as spoken.\n\nKneeling in silent invocation.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 354,
      "start_sentence": 0,
      "end_sentence": 19,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.1252760887146,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\太乙火府奏告祈禳仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "具位臣某，恭焚真香，诚惶诚恐，稽首顿首，启奏供养玉清圣境元始天尊、上清真境灵宝天尊、太清仙境道德天尊、昊天至尊玉皇上帝、星主北极紫微大帝、太微天皇大帝、承天效法后土皇地祇神霄真王长生大帝、东极青华大帝、九天应元雷声溥化天尊、九天雷祖大帝、上清紫微碧玉宫太乙大天帝、六天洞渊大帝、六波天主帝君、可韩司丈人真君、九天采访使真君、五方五老天尊、十方灵宝天尊、三十二天帝君、诸天上帝高真、十极十华真宰、琼章道藏经线神仙、斗父北极龙汉天君、斗母紫光金真圣德天后、中天北斗九皇道君、斗中帝座星君、北斗九皇夫人内妃、擎羊陀罗二仙使者、斗中神仙灵官将吏、天罡大圣万真节度星君、日宫月府星君、五方五德星尹、玄都四曜星君、南斗六司星君、东西中三斗星君、三台华盖星君、二十八宿星君、十二宫分星君、普天玄象星宰、南极长生注生大帝、南极福禄寿星君、西台金真万炁元君、本命元辰福禄寿星君、大小运限禄马星君、当生流年照临星宰、三元三官大帝、北极天蓬苍天上帝、北极天猷丹天上帝、北极翊圣皓天上帝、北极佑圣玄天上帝、天曹太皇万福真君、天曹玉历上生真君、天曹掠剩大夫真君、天曹注福注禄注寿真君、天曹会上无边真宰、九天生神大帝、九天储福定命真君、九天司命上卿真君、九天监生大神、九天卫房圣母元君、九天朝元诸司真宰、星河桥塔生化神祇、五雷院使真君、雷霆都司元命真君、北极驱邪使泰玄都三省真君、俞书三省使真君、灵宝五师真君、火府传教紫府冯真人、祖师希夷陈真人、祖师通玄刘真人、祖师中天枢相伏魔许真人、祖师清隐上仙披云杨真人、祖师云庄黄真人、宗师西台风雨令玉田叶真人、火府演振流芳历代师真、火府主法都雷总管李元君、主帅显顺大将军丘元帅、副帅灵变大将军王元帅、雷枢大神陈元帅、雷机大神李元帅、雷卫大神孔元帅、雷烈大神崔元帅、雷光大神周元帅、雷令大神纪元帅、雷阵大神刘元帅、雷威大神林元帅、驱督家书白元帅、通奏直符谢元帅，开坛听令，四大雷神、诸阶法中官将吏兵、水府土司、无边真宰、阳间岳渎祀典神祇、名山洞府得道神仙、雷府殟司列职真宰、行年太岁至德尊神、内廷五杞之神、京都城隍之神、京畿庙貌祀典神祇、坛靖所奉香火明神、日分功曹使者、虚空来往神仙、所启无边真宰，干冒真慈洞回昭格。 伏念臣猥，以公微冒，参玄秘无功，及物有过。 在躬第，惟有受於投词，诅敢或忘於请命？",
      "translated_text": "The humble servant [Name], in reverent offering of true incense, with utmost awe and trepidation, prostrates and bows his head to humbly address and make supplication to the following:\n\nThe Most High Jade Clarity Sacred Realm, the Primordial Heavenly Worthy of Original Beginning;\nThe Highest Clarity True Realm, the Heavenly Worthy of Numinous Treasure;\nThe Grand Clarity Immortal Realm, the Heavenly Worthy of Dao and Virtue;\nThe August Heavenly Supreme Jade Emperor;\nThe Stellar Lord, the Northern Pole Purple Tenuity Great Emperor;\nThe Heavenly Emperor of the Grand Tenuity;\nThe Earth Spirit, the Queen of Earth who Upholds Heaven and Emulates the Dao, the Divine Radiance True King, the Great Emperor of Longevity;\nThe Eastern Pole Azure Radiance Great Emperor;\nThe Heavenly Worthy of Universal Transformation through the Thunderous Voice of the Nine Heavens;\nThe Great Emperor, Ancestor of Thunder in the Nine Heavens;\nThe Great Heavenly Emperor of the Highest Clarity Purple Tenuity Azure Jade Palace;\nThe Great Emperors of the Six Heavens of Profound Abyss;\nThe Lord Emperors of the Six Waves of Heaven;\nThe True Lord, Controller of the Han, the Venerable Master;\nThe True Lord, Envoy of Inspection in the Nine Heavens;\nThe Heavenly Worthies of the Five Directions and Five Elders;\nThe Heavenly Worthies of Numinous Treasure in the Ten Directions;\nThe Lords of the Thirty-Two Heavens;\nThe Highest Perfected of the Various Heavens;\nThe True Sovereigns of the Ten Poles and Ten Radiant Realms;\nThe Divine Immortals of the Jade Chapters and Daoist Canon;\nThe Heavenly Lord of the Northern Dipper, Dragon Han;\nThe Heavenly Empress of the Northern Dipper, the Golden Perfected of Purple Radiance, the Sagely Virtue Queen of Heaven;\nThe Nine August Sovereigns of the Central Heavenly Northern Dipper;\nThe Star Lords of the Imperial Thrones within the Dipper;\nThe Inner Consorts, the Nine August Ladies of the Northern Dipper;\nThe Two Divine Envoys, the Bearers of the Goat and Rāhu;\nThe Divine Immortals, Spirit Officials, and Generals within the Dipper;\nThe Star Lord of the Great Saint of Heavenly Stem, Commander of the Myriad Perfected;\nThe Star Lords of the Sun Palace and Moon Mansion;\nThe Stellar Governors of the Five Directions and Five Virtues;\nThe Four Luminaries of the Mysterious Capital;\nThe Six Controllers of the Southern Dipper;\nThe Three Dippers of the Eastern, Western, and Central Heavens;\nThe Three Terraces and Canopy Star Lords;\nThe Twenty-Eight Constellations;\nThe Twelve Zodiacal Star Lords;\nThe Stellar Sovereigns of the Celestial Phenomena throughout the Heavens;\nThe Great Emperor of Longevity and Life-Registration at the Southern Pole;\nThe Stellar Lords of Fortune, Prosperity, and Longevity at the Southern Pole;\nThe Primordial Lady of the Golden Perfection and Myriad Qi at the Western Terrace;\nThe Stellar Lords of the Original Destiny, Fortune, Prosperity, and Longevity of One’s Natal Year;\nThe Stellar Lords of the Greater and Lesser Cycles, and the Horses of Fortune;\nThe Stellar Sovereigns Governing the Current Year’s Illumination;\nThe Great Emperors of the Three Primes and Three Officials;\nThe Heavenly Emperor of the Northern Pole, Azure Heaven;\nThe Heavenly Emperor of the Northern Pole, Vermilion Heaven;\nThe Heavenly Emperor of the Northern Pole, Radiant Heaven;\nThe Heavenly Emperor of the Northern Pole, Mysterious Heaven;\nThe True Lord of Myriad Blessings, the Grand Heavenly Court;\nThe True Lord of Life-Registration in the Jade Calendar, the Heavenly Court;\nThe True Lord, Minister of Excess, the Heavenly Court;\nThe True Lords of Fortune, Prosperity, and Longevity Registration, the Heavenly Court;\nThe Boundless True Sovereigns of the Heavenly Court Assemblies;\nThe Great Emperor of Life-Generation in the Nine Heavens;\nThe True Lord of Destiny-Determination and Blessing-Storage in the Nine Heavens;\nThe True Lord, Minister of Life-Command in the Nine Heavens;\nThe Great Spirits of Life-Monitoring in the Nine Heavens;\nThe Sagely Mother and Primordial Lady of the Nine Heavens’ Womb Protection;\nThe True Sovereigns of the Nine Heavens’ Audience Assemblies;\nThe Divine Spirits of the Star River Bridge and Pagoda of Life and Transformation;\nThe True Lords of the Five Thunder Courts;\nThe True Lord of the Thunder Bureau, the Primordial Destiny;\nThe True Lords of the Three Ministries of the Northern Pole, the Great Mysterious Capital, and the Expeller of Evil;\nThe True Lords, Scribes of the Three Ministries;\nThe Five Masters of Numinous Treasure;\nThe Purple Court Instructor of the Fire Mansion, Master Feng;\nThe Patriarchal Perfected, the Reclusive Master Chen;\nThe Patriarchal Perfected, the Master of Penetrating Mystery, Liu;\nThe Patriarchal Perfected, the Central Heavenly Pivot, the Demon-Quelling Master Xu;\nThe Patriarchal Perfected, the Cloud-Clad Master Yang of Hidden Clarity;\nThe Patriarchal Perfected, Master Huang of Cloud Manor;\nThe Lineage Master, the Wind and Rain Commander of the Western Terrace, Master Ye of Jade Field;\nThe Illustrious Perfected of the Fire Mansion through the Ages;\nThe Lord of the Fire Mansion, the Thunder Marshal General Li;\nThe Marshal General of Manifest Obedience, Marshal Qiu;\nThe Vice Marshal General of Numinous Transformation, Marshal Wang;\nThe Thunder Pivot Great Spirit, Marshal Chen;\nThe Thunder Mechanism Great Spirit, Marshal Li;\nThe Thunder Guard Great Spirit, Marshal Kong;\nThe Thunder Fierce Great Spirit, Marshal Cui;\nThe Thunder Radiance Great Spirit, Marshal Zhou;\nThe Thunder Command Great Spirit, Marshal Ji;\nThe Thunder Formation Great Spirit, Marshal Liu;\nThe Thunder Might Great Spirit, Marshal Lin;\nThe Dispatcher of Household Documents, Marshal Bai;\nThe Direct Memorialist, Marshal Xie—\nAll are summoned to open the altar and heed the command.\n\nThe Four Great Thunder Spirits, the officials, generals, and soldiers of the various ranks within the Dharma;\nThe Water Mansion and Earth Controllers;\nThe Boundless True Sovereigns;\nThe Divine Spirits of the Sacred Peaks and Waterways in the mortal realm;\nThe Perfected Immortals of the renowned mountains and grotto-heavens;\nThe True Sovereigns of the Thunder Mansion’s Dark Bureau;\nThe Augustly Virtuous Honored Spirit of the Current Year’s Grand Year Star;\nThe Divine Spirits of the Five Sacrifices within the Inner Court;\nThe City Gods of the Capital;\nThe Divine Spirits of the Temples and Shrines within the Capital Region;\nThe Illuminated Spirits of the incense offerings at this altar and sanctuary;\nThe Day-Dividing Merit Recorders and Envoys;\nThe Divine Immortals traversing the Void;\nThe Boundless True Sovereigns to whom this petition is addressed—\nMay they deign to turn their gaze in response to this humble servant’s reverent address.\n\nReflecting upon this unworthy servant’s meager merits, I have presumptuously intruded upon the profound mysteries, yet remain without accomplishment in aiding others, and bear transgressions in my duties. In this humble position, I have only received the submitted petitions—how dare I ever forget to beseech your mandates?",
      "overlap_context": "Next:** Recitation of the *Divine Incantation for the Purity of Heaven and Earth*, followed by the raising of the floral offering.\n\nThe master performs the triple bow and offers incense.\n\nThe Dao is studied in the heart,\nFaith is conveyed through the fragrant smoke.\nHolding the jade censer,\nThe heart abides in the Nine Heavens.\nThe true spirits gaze downward,\nThe immortal sieves descend to the hall.\nAll that your servant now petitions,\nMay it be granted as spoken.\n\nKneeling in silent invocation.",
      "start_char": 354,
      "end_char": 1310,
      "start_sentence": 20,
      "end_sentence": 22,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.45701289176941,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\太乙火府奏告祈禳仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "以今奉，为某恪遵科教，肃建星坛，像斗然灯，投符作占。 伏愿天之高，星辰之远，一忱可格於齐临； 地之大，河海之深，跬步敢期於毕至； 珠悬黍米，法演骞林，驻驿停骖，环衰龙而当座，鸣珂委佩翼序鹭以联班少，听洞章同跻妙道。 臣干冒威严，下情无任激切屏营之至，稽首顿首，再拜谨言。 举消灾解厄天尊 召将　焚降令符　召社令六神 天灵天灵，三界威神。 木客邪鬼，令化微尘。 风雷雨部，四渎神王。 五岳真君，各拱坛界。 分别章表，上达玉清。 急急如大赤天帝律令敕。 召四将 上清有敕，速召雷神。 直坛四将，火急摧倾。 五岳四渎，各听威声。 关召速降，各列宫庭。 奉符用命，面奏玉清。 急急如大赤天帝敕。 天丁天丁，地灵地灵。 阴阳交合，雷部现形。 谨召开坛听令，高、陶、崔、赵四大天将，速至坛所疾。 存至四角 举灵通感应天尊",
      "translated_text": "With this present offering, for so-and-so, who reverently follows the ritual teachings, solemnly establishes the Star Altar, kindles the Dipper’s lamps in likeness, and casts talismans for divination—\n\nMay the loftiness of Heaven and the remoteness of the stars deign to respond to this single devotion as though descending in full assembly;\nMay the vastness of Earth and the depths of rivers and seas not scorn these halting steps, but grant their presence in completion;\nLike pearls suspended or millet grains arrayed, may the ritual unfold as a forest of soaring branches—\nMay the post-horses pause and the chariot teams halt, encircling the altar in the form of coiled dragons, while jade pendants chime and sashes drape in ordered ranks like egrets in flight, to hear the sacred liturgy and together ascend the wondrous Dao.\n\nThis humble servant, presuming upon your majesty, prostrates himself in utmost trepidation and reverence. With bowed head and repeated bows, he respectfully declares:\n\nInvoke the Heavenly Worthies for Disaster-Dispelling and Calamity-Resolving.\nSummon the Generals—ignite and burn the Command Talismans for Descent.\nCall forth the Community Deities and the Six Spirits.\nHeavenly Numinous! Heavenly Numinous! Mighty spirits of the Three Realms!\nWoodland specters and wayward ghosts—be reduced to fine dust by this command!\nWind, Thunder, and Rain Departments, the Divine Kings of the Four Waterways,\nThe True Lords of the Five Peaks—each guard the altar’s bounds.\nDistinguish and transmit these petitions upward to the Jade Clarity.\n\nSwiftly, swiftly, in accordance with the statutes and decrees of the Great Crimson Heavenly Emperor!\n\nSummon the Four Generals.\nBy edict of the Upper Clarity, swiftly call forth the Thunder Gods!\nThe Four Generals of the Altar’s Guard—hasten to overthrow all obstacles!\nThe Five Peaks and Four Waterways—heed this mighty summons!\nHasten to descend, each taking your place in the palace halls.\nReceive the talisman and execute the command, presenting your report before the Jade Clarity.\n\nSwiftly, swiftly, by decree of the Great Crimson Heavenly Emperor!\n\nHeavenly Soldiers! Heavenly Soldiers! Earthly Numinous! Earthly Numinous!\nAs yin and yang converge, let the Thunder Department manifest its form!\nSolemnly summon the Four Great Heavenly Generals—Gao, Tao, Cui, and Zhao—to swiftly arrive at the altar.\nVisualize their presence at the four corners.\n\nInvoke the Heavenly Worthy of Numinous Communication and Response.",
      "overlap_context": "traversing the Void;\nThe Boundless True Sovereigns to whom this petition is addressed—\nMay they deign to turn their gaze in response to this humble servant’s reverent address.\n\nReflecting upon this unworthy servant’s meager merits, I have presumptuously intruded upon the profound mysteries, yet remain without accomplishment in aiding others, and bear transgressions in my duties. In this humble position, I have only received the submitted petitions—how dare I ever forget to beseech your mandates?",
      "start_char": 1310,
      "end_char": 1665,
      "start_sentence": 23,
      "end_sentence": 47,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.513718605041504,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\太乙火府奏告祈禳仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "召谢白　焚符 杳杳冥冥，天地同生。 神化焂忽，聚而成形。 闻呼即至，遇召速临。 急急如大赤天帝敕。 吾今通奏，坛前听候，所启所愿，通达御前。 当日直符谢佑白伸随师勑令。 急急如大赤天帝救。 子文午出 举灵通感应天尊 唵兜吽吽，梵应雷轰摄。 唵杏鸠盘陀利，摄天下鬼神，依师勑令，速如火令急奉大赤天帝敕。 午文存至 适伸告召，已沐来临，以今奉为某，伏请整肃威严，护卫坛惮，开天门，闭地户，聿严虎豹之关，朝帝所蹑云根，共近龙鸾之驭，益昭神贶，潜格灵庥。 举金真演教天尊 降师 学而不从师，玄理难於自悟，教者必以正，至道妙於心传，脉络贯通，宗支接续，此太上聿严於授度。 故后人深重於继承，凡有皈投，敢忘关告。 门下具职，谨同斋官，默想师闱，志心拜请祖师启教紫府冯真人、祖师纯素妙道希夷陈真人、祖师太极上相通玄刘真人、祖师中天枢相伏魔许真人、祖师清隐上仙披云杨真人、祖师浦城真常先生云庄黄真人、宗师西台风雨令玉田叶真人、火府历代演振师真，恭望师慈，俯垂省录，宓闻清明，在躬符章瑞世，梦传圣母灵书，丕显於开元，感叶醮筵，异相遂彰於太一。 石室之文，斯隐蜀都之派。 维新老君现而来，山下之青牛魔女，擒而掣井中之铁锁。 文星炳瑞，枢府储祥。 白昼而流火涨天，冲虚示化。 清夜而彩云贯斗，蹑景飞神。 嗣之浦城者，皆可荃蹄。 继之玉田者，足为矜式。 啸命而风翻雷激，指挥而雨止风停。 着八字之家书，永锡生生世世。 冠诸阶之道法，茂延子子孙孙。 是夕恭愿，玉佩铿锵，霞倨缥缈，自天衢而下、迈格尘世之。 小心谨启以闻。 举道经师宝天尊 上信香见师",
      "translated_text": "Summon Xie Bai. Burn the talisman.\n\nIn the profound and obscure, heaven and earth are born as one.\nDivine transformations swift and fleeting, gathering to take form.\nAt the call, instantly arrive; at the summons, swiftly attend.\nSwiftly, swiftly, by decree of the Great Crimson Heavenly Emperor.\n\nNow I submit this memorial—before the altar, heed and await.\nAll petitions and wishes shall be conveyed to the imperial presence.\nOn this day, the talismanic attendant Xie Youbai follows the master’s command.\nSwiftly, swiftly, as the Great Crimson Heavenly Emperor’s salvation decree.\n\n*Zi* appears at *wen*, *wu* emerges at *chū*.\nInvoke the Heavenly Worthy of Numinous Communication and Response.\n\nOṃ dou hūṃ hūṃ—Brahma’s response, thunder’s roar, all is seized.\nOṃ xìng jiū pán tuó lì—seize the ghosts and spirits under heaven.\nBy the master’s command, swiftly as fire, urgently obey the Great Crimson Heavenly Emperor’s decree.\n\n*Wu* appears at *wen*. Visualize their arrival.\nHaving received the summons, they have bathed and come.\nToday, on behalf of so-and-so, I humbly request:\nCompose your majestic dignity, guard and shield the altar’s sanctity.\nOpen the gates of heaven, seal the doors of earth.\nSecure the passes of tigers and leopards.\nAscend to the imperial court, treading upon cloud roots.\nDraw near the dragon and phoenix chariots.\nEnhance the radiance of divine favor, silently align with numinous blessings.\n\nInvoke the Heavenly Worthy of the Golden Truth, Expounder of the Teachings.\n\nDescend, Master.\n\nTo learn without a master—profound principles are difficult to grasp alone.\nTeaching must be upright; the supreme Dao is wondrously transmitted heart-to-heart.\nVessels and channels flow as one; lineage branches continue unbroken.\nThus did the Most High solemnly establish the rites of transmission.\nHence later generations deeply revere succession.\nFor all who take refuge, how dare we forget to invoke and report?\n\nWe, the disciples under your gate, together with the officiating officers,\nIn silent contemplation of the master’s chamber,\nWith sincere devotion, bow and invoke:\nAncestral Master Feng the Perfected of the Purple Mansion, Initiator of the Teachings;\nAncestral Master Chen the Perfected of Pure Simplicity and Wondrous Dao, the Recluse;\nAncestral Master Liu the Perfected, Supreme Minister of the Great Ultimate, Communicator of the Mysteries;\nAncestral Master Xu the Perfected, Central Heaven’s Pivot, Subduer of Demons;\nAncestral Master Yang the Perfected, Cloud-Clad Recluse of Qingyin;\nAncestral Master Huang the Perfected, True Constant Master Yunzhuang of Pucheng;\nLineage Master Ye the Perfected of Yutian, Wind and Rain Commander of the Western Terrace;\nAnd all the successive masters of the Fire Mansion who have expounded and propagated the teachings.\nWe reverently hope for the master’s compassion, to deign to take notice.\nMay your clarity and brilliance be heard, embodied in talismans and auspicious signs through the ages.\nMay dreams convey the sacred mother’s numinous script, grandly manifesting in the Kaiyuan era.\nMay the leaves of the jiao altar be moved, and extraordinary omens appear to the Supreme One.\nThe texts of the stone chamber, hidden in the Shu capital’s lineage.\nThe Most High Lord Lao renewed and came forth—\nBeneath the mountain, the green ox demoness was captured and dragged to the well’s iron chain.\nThe literary star shines auspiciously; the Pivot Mansion stores good fortune.\nBy day, fire flows and the sky swells—emptiness reveals its transformations.\nBy night, colored clouds thread the Dipper—treading light, the spirit soars.\nThose who inherit from Pucheng may be guides and markers.\nThose who continue from Yutian are worthy of emulation.\nAt a whistle, winds churn and thunder roars; at a gesture, rain ceases and winds still.\nInscribed in the eight-character family record, eternally bestowing generation after generation.\nCrowned with the Daoist arts of all ranks, flourishing through descendants without end.\n\nOn this evening, we reverently pray:\nJade pendants chime, rosy clouds drift in the ethereal distance.\nDescending from the celestial thoroughfare, transcending the dust of the mortal world.\nWith utmost care, we humbly present this to be heard.\n\nInvoke the Heavenly Worthy of the Dao, the Scriptures, the Master, and the Treasures.\nOffer incense to behold the Master.",
      "overlap_context": "ecute the command, presenting your report before the Jade Clarity.\n\nSwiftly, swiftly, by decree of the Great Crimson Heavenly Emperor!\n\nHeavenly Soldiers! Heavenly Soldiers! Earthly Numinous! Earthly Numinous!\nAs yin and yang converge, let the Thunder Department manifest its form!\nSolemnly summon the Four Great Heavenly Generals—Gao, Tao, Cui, and Zhao—to swiftly arrive at the altar.\nVisualize their presence at the four corners.\n\nInvoke the Heavenly Worthy of Numinous Communication and Response.",
      "start_char": 1665,
      "end_char": 2330,
      "start_sentence": 48,
      "end_sentence": 80,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.88322138786316,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\太乙火府奏告祈禳仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "云舆　散花　献茶 具位某，虔诚上启：祖师启教紫府冯真人、祖师希夷陈真人、祖师通玄刘真人、祖师伏魔许真人、火府古今历代传道授法演派师真，恭望师慈，俯垂省录，伏闻师所存道，所存派系，远通於脉络，德之至，教之至，范模永赖於甄陶。 以今奉为某丐，投告盟斗极，顺度星躔。 重念某玄门末绪，道域疏才，姓名冒缀於仙阶，多违戒律，科格罔明 於祖训，滥窃行持，匪藉提撕，曷由感格，所祈事理，乞赐允俞。 仰冀宣行，斗敕播告，星垣俾所属之，玄曹声发响应，命合干之将帅，形动影随，罡步通灵，符章有验，干冒师严。 某下情无任，虔祷之至，谨言。 举七元覆护天尊　明灯 盖闻斗运七元，宰生杀照临之柄。 灯分五色，验吉凶祸福之机。 光烛人间，位居天上，仗丹符而飞焰灿然，象纬之当空，炳璇极以同辉，俨若玑衡之在御。 仰希昭报，式副虔祈。 法师然灯　众讽神咒 师存思合斗 太上有敕，点发斗灯。 七元来降，救度众生。 左辅右弼，显现威灵。 天蓬元帅，统领天兵。 五雷使者，六甲六丁。 真武大圣，台中三星。 去病除祸，斩馘妖精。 违敕者死，顺敕者生。 斗灯一照，身宅光明。 福果长寿，永保利贞。 灯光朗耀，照人长生。 三魂安健，七魄康宁。 明灯摄光，游精不飞。 七魄安守，万神总归。 斗中齐景，长处光辉。 七元来降，受神告闻。 灯光明暗，知吉知凶。 威神之力，万愿皆从。 投盆符　作占 臣闻清清泠泠者，神水之乡。 心心授授者，真符之秘必也。 验静中之动，于以测玄上之机。 伏愿光溢恩波，春融福笔，寿无极无穷之脉。 譬彼长流定所，戴所履之方昭哉。 吉报所有牒文，兹当宣示。 宣　牒投盆　符召二使者 太乙火府焚符告召：斗中擎羊陀罗二仙使者，斗中通事舍人，闻今告召速降坛庭。 急急奉大赤天帝君敕。 斗中有将，职赞璇玑。 掌#1善罚恶，察过言非。 玉衡布令，威镇瑶池。 闻吾呼召，风火奔驰。 赴临坛下，毋辄稽违。 急准大赤天帝敕。 三敕灵咤哩星帝摩娑诃，多萨诃哩啼聚莎诃，唵□咤哩摄。 天中斗神，斗曜之灵。 左有汝明，右有妙真。 神变莫测，出幽入冥。 吾今关召，速降坛庭。 急准大赤天帝敕。 存降。 法师白事　焚合符 适伸告召，谅沐降临，当府以今奉为某舒坛建斗，解厄消灾。 欲迓宸麻以伸寅奉，敢烦神力，赉此合符，上诣斗官，请降恩光，俯临灯席，准敕奉行，拱俟昭报。 步斗存遣 灵通感应天尊 具位臣某，与斋官合坛官众等，谨同诚上启：三清上圣，十极高真，北斗九皇道君，四府万灵众圣。 火府师君将帅，灯筵观鉴神祇，干冒真慈洞回昭鉴。 臣闻烧香归虚无华盖，已腾於宝篆，冥心望北极丹霄，傒驾於金舆，载维梵气之玄寥，尚隔红尘之秽浊。 仰瞻九陛，俯罄一诚。 紫云蓊勃於绛桥，瑞雾纷驰於彩仗，绣衣前导，焂忽降下於瑶坛； 银焰交辉，恍若森罗於璇极。 臣与斋官遥望天阶，奉迎星驭。 焚接驾符 降圣",
      "translated_text": "The Cloud Chariot scatters flowers, offers tea—\n[Rank and Name], with utmost reverence, humbly petitions:\nThe Founding Masters who inaugurated the teachings—Master Feng of the Purple Mansion, Master Chen of Profound Stillness, Master Liu of Penetrating Mystery, Master Xu the Demon-Queller—and all the successive Masters of the Fire Mansion who transmitted the Dao, conferred the methods, and propagated the lineage—\nwe reverently gaze upon your compassion, humbly beseeching your regard and remembrance.\n\nWe have heard that the Dao you preserved and the lineage you upheld extend far through the veins and channels, their virtue and teachings reaching perfection, their models enduring through the refining and shaping of generations.\n\nToday, on behalf of [Name], we submit this plea, casting our lot with the Dipper’s pole, aligning with the stars’ celestial course.\n\nWe reflect with deep concern that we, mere remnants of the Mystery Gate, dwell in a realm of sparse talent. Our names are presumptuously appended to the immortal ranks, yet we have repeatedly violated the precepts and failed to comprehend the statutes and regulations of our ancestral teachings. We have recklessly usurped the practices, and without guidance, how could we hope to evoke a response?\n\nWe beseech your assent to the matters herein petitioned. May the Dipper’s decrees be proclaimed and disseminated, the stellar courts command their subordinates, the offices of Mystery respond in echo, and the generals whose destinies align with this mandate move in unison—form and shadow following, the steps of the *gang* connecting with the numinous, the talismans proving efficacious.\n\nWe, in our lowly station, are utterly without recourse, our devotion in prayer reaching its utmost. We speak with reverence.\n\nInvoke the Heavenly Worthy of the Seven Primes’ Protective Cover\n\nThe Lamp’s Radiance—\nWe have heard that the Dipper governs the Seven Primes, wielding the power of life, death, and illumination. The lamps, divided into five colors, reveal the mechanisms of fortune and misfortune. Their light illumines the human realm while their station resides in the heavens. By the red talismans, flames soar brilliantly; the celestial bodies above shine in unison with the radiant pole, as if the armillary sphere itself were in command. We humbly hope for a luminous response, that our devout prayers may be answered.\n\nThe Master kindles the lamp, the assembly chants the divine incantations—\nThe Master visualizes the Dipper’s alignment:\n*\"By the Supreme’s decree, the Dipper’s lamp is kindled.\nThe Seven Primes descend to save and deliver all beings.\nLeft Assistants and Right Aides manifest their mighty spirits.\nMarshal Tianpeng commands the heavenly hosts.\nThe Envoys of the Five Thunders, the Six Jia and Six Ding.\nThe Great Sage Zhenwu, the Three Stars of the Terrace.\nDispel illness, eradicate misfortune, sever the heads of demonic spirits.\nThose who defy the decree perish; those who obey it live.\nThe Dipper’s lamp shines—body and home are illuminated.\nFortune and longevity endure, ever preserving harmony.\nThe lamp’s radiance shines, guiding mortals to long life.\nThe three *hun* souls rest in health, the seven *po* souls in peace.\nThe bright lamp gathers light, wandering spirits do not flee.\nThe seven *po* souls remain secure, the myriad spirits all return.\nIn the Dipper’s luminous expanse, one dwells forever in splendor.\nThe Seven Primes descend, receiving the divine proclamation.\nThe lamp’s brightness or dimness reveals fortune or misfortune.\nBy the power of the mighty spirits, all wishes are fulfilled.\"*\n\nThe Talisman of the Basin is cast for divination—\nWe have heard that the clear and pure is the realm of divine water, and the attentive and receptive is the secret of the true talisman. By observing the movement within stillness, one may fathom the mechanisms of the sublime. We humbly pray that the light overflows with grace, the brush of fortune writes with spring’s warmth, and the pulse of life knows no end. Like a long-flowing river finding its course, may the direction we tread be brightly revealed.\n\nThe auspicious report and all documents are now to be proclaimed.\n\nProclaim the document, cast the basin, and summon the two messengers—\nThe Talisman is burned in the Fire Mansion of Taiyi to issue the summons:\n*\"The Dipper’s Star-Holding and Rāhu Messengers, the Dipper’s Attendant Officers, heed this proclamation and swiftly descend to the altar court.\nHasten by the decree of the Great Red Heavenly Emperor!\"*\n\nWithin the Dipper, there are generals who assist the turning of the jade armillary, discerning good and punishing evil, scrutinizing transgressions and false words. The Jade Balance issues commands, its might reigning over the Jasper Pool. At our call, come swiftly as wind and fire to the altar’s base. Do not delay or disobey.\nBy the decree of the Great Red Heavenly Emperor, hasten!\n\nThreefold Decree—\n*\"Oṃ! Cittī! Star Emperor Mahāsahā!\nDuo sāhālī! Dītī! Juśahā!\nOṃ! [ ]! Cittī! Śeṣa!\"*\n\nSpirits of the Dipper’s midst, numinous powers of the stellar bodies—\nTo the left, you are Radiant; to the right, Wondrously True.\nYour transformations are unfathomable, emerging from darkness and entering the unseen.\nWe now summon and invoke you—swiftly descend to the altar court.\nBy the decree of the Great Red Heavenly Emperor, hasten!\n\nVisualize their descent.\n\nThe Master announces the matter—\nThe talismans are burned and combined:\nJust now, the summons was issued, and we trust you have graciously descended. On this occasion, we, the altar’s host, perform the Dipper’s rites for [Name], to dissolve calamities and dispel misfortunes. We seek to welcome the celestial favor and extend our reverence. We dare to trouble your divine power to bear this combined talisman to the Dipper’s officials, requesting the descent of your benevolent radiance upon the lamp’s assembly, to be enacted in accordance with the decree. We await your luminous response with reverence.\n\nStep the Dipper’s steps, visualize the dispatch—\n\nThe Heavenly Worthy of Numinous Communication and Response\n\n[Rank and Name], together with the altar officers and the assembly, with united sincerity, humbly petition:\nThe Three Clarities’ August Sages, the Ten Poles’ Lofty Perfected, the Nine Sovereigns of the Northern Dipper, the myriad spirits and sages of the Four Mansion—\nThe Masters, Generals, and Marshals of the Fire Mansion, the deities observing the lamp’s feast—\nwe venture to offend your true compassion, humbly beseeching your luminous regard.\n\nWe have heard that burning incense returns to the void beneath the Flowery Canopy, its fragrant smoke already ascending in the sacred script. With minds stilled, we gaze toward the Northern Pole’s cinnabar clouds, longing to ride the golden chariot. Yet we remain in the desolate vastness of the *fan* qi, still separated from the world’s defilements.\n\nGazing up at the ninefold steps, we offer our single sincerity. Purple clouds billow over the crimson bridge, auspicious mists surge through the colorful banners. Embroidered robes lead the way, swiftly descending to the jasper altar; silver flames intertwine, as if the Dipper’s pole were arrayed in a forest of stars.\n\nWe, together with the altar officers, look afar toward the celestial steps, welcoming the stellar chariot.\n\nBurn the Talisman to Receive the Celestial Descent—\nInvoke the Descent of the Sages.",
      "overlap_context": "rnally bestowing generation after generation.\nCrowned with the Daoist arts of all ranks, flourishing through descendants without end.\n\nOn this evening, we reverently pray:\nJade pendants chime, rosy clouds drift in the ethereal distance.\nDescending from the celestial thoroughfare, transcending the dust of the mortal world.\nWith utmost care, we humbly present this to be heard.\n\nInvoke the Heavenly Worthy of the Dao, the Scriptures, the Master, and the Treasures.\nOffer incense to behold the Master.",
      "start_char": 2330,
      "end_char": 3485,
      "start_sentence": 81,
      "end_sentence": 149,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.80313539505005,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\太乙火府奏告祈禳仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "臣等中谢谨谨，奏请中天大圣斗父、北极龙汉天君、中天大圣斗母、紫光金真圣德天后、北斗纲极宫太尉贪狼星皇君、北斗灵关宫上帝、巨门星皇君、北斗紫极。 宫司空禄存星皇君、北斗运天宫游击文曲星皇君、北斗帝席宫斗君、廉贞星皇君、北斗上尊宫大帝、武曲星皇君、北斗关会宫上帝、破军星皇君、洞阳宫大帝、天尊外辅星皇君、隐元宫大帝真人、内弼星皇君、中天大圣北斗九皇延生夫人。 臣等中谢，恭望星慈，特赐瑶光，降临兰席。 云舆 适伸奏请，己沐降临，辄备浮茶，用伸上献。 进茶 具位臣某等，谨同诚上启：虚皇妙道十极，高真北极，梵炁龙汉天君，紫光金真胜德天后，北斗九皇大道君，斗宫列班真宰，本命元辰星君，火府师君，雷神天帅，灯坛所启，观鉴神祇，恭望圣慈，洞垂昭鉴。 臣闻周沙界入微尘，密运无方之化，判人间司阴符，实弘不测之功，亘古亘今至灵至圣，自天地肇分於太极，而璇玑已列於北辰。 莲花九苞一时出现，玉衡七政万类生成。 故人品之贵贱虽殊，在命分之照临不异。 凡曰祸而曰福，暨与灾而与祥，悉自权舆，得由主宰。 然其大悲大愿，每赴感以垂慈，资其厚德厚恩，屡有求而吋应肃，干喉舌敷露腹心，剑符合而圣驭降临。 灯焰辉而神光下，烛灵终毕集，玄象森罗，明水芳醪，式陈初献。 法事 具位臣某等，谨同诚上启： 虚皇妙道十极高真，梵炁龙汉天君，紫光金真圣德天后，北斗九皇大道君，斗宫无边真宰本命元辰星君，火府师君，帅将三界一切威灵，恭望圣慈，洞回昭鉴。 臣闻应九天，应九地，尊无越於九皇，曰北极，曰北辰，显莫踰於北斗。 昭然在上，划尔当空。 故有耳目者，靡不见闻。",
      "translated_text": "We, your humble servants, prostrate ourselves in profound reverence, and most respectfully invoke:\n\nThe Great Sage Father of the Dipper of the Central Heaven,\nThe Celestial Lord of the Dragon Han of the Northern Pole,\nThe Great Sage Mother of the Dipper of the Central Heaven,\nThe Heavenly Empress of Sacred Virtue and Golden Radiance,\nThe August Star Sovereign of Greedy Wolf of the North Dipper’s Net-Pole Palace,\nThe Supreme Emperor of the Numinous Pass Palace of the North Dipper,\nThe August Star Sovereign of Giant Gate,\nThe Star Sovereign of Store of Wealth of the North Dipper’s Purple Pole Palace,\nThe Star Sovereign of Literary Brilliance of the North Dipper’s Heavenly Motion Palace,\nThe Dipper Lord of the North Dipper’s Imperial Seat Palace,\nThe August Star Sovereign of Integrity and Chastity,\nThe Great Emperor of the North Dipper’s Supreme Palace,\nThe August Star Sovereign of Military Brilliance,\nThe Supreme Emperor of the North Dipper’s Pass-Convergence Palace,\nThe August Star Sovereign of Destruction,\nThe Great Emperor of the Cavern Yang Palace,\nThe August Star Sovereign of the Heavenly Honored Outer Assistant,\nThe Perfected of the Hidden Origin Palace,\nThe August Star Sovereign of the Inner Assistant,\nThe Nine August Life-Prolonging Ladies of the Great Sage North Dipper of the Central Heaven.\n\nWe, your humble servants, prostrate ourselves in gratitude, and reverently gaze toward the stellar compassion, beseeching the descent of the Jade Radiance upon the orchid dais.\n\nThe cloud chariot, having received our invocation, has graciously descended. We now prepare floating tea as our humble offering.\n\nPresenting the Tea—\n\nWe, your humble servants, together in sincerity, most respectfully address:\n\nThe Wondrous Dao of the Void Emperor of the Ten Poles,\nThe High Perfected of the Northern Pole,\nThe Celestial Lord of the Dragon Han of the *fan* qi,\nThe Heavenly Empress of Sacred Virtue and Golden Radiance,\nThe Great Dao Lords of the Nine Dipper Sovereigns,\nThe True Governors of the Dipper Palaces,\nThe Star Lords of our Original Destiny,\nThe Master Lords of the Fire Bureau,\nThe Heavenly Marshals of Thunder,\nThe Deities invoked at the Lamp Altar—\nwe reverently gaze toward your sagely compassion, beseeching your luminous regard.\n\nWe have heard that the dust of the world is as minute as a grain of sand, yet the subtle transformations of the Dao operate without bound. The Dipper governs the tally of yin in the human realm, truly manifesting unfathomable merit. From ancient times to the present, most numinous and most sagely, since the Supreme Ultimate first divided heaven and earth, the jade pivot has already arrayed itself at the Northern Asterism. The nine-petaled lotus blossoms forth at once, and the seven regulators of the Jade Balance give rise to the myriad kinds. Thus, though the nobility and baseness of human stations may differ, the illumination of destiny’s allotment remains unchanged. Whether called misfortune or fortune, calamity or blessing, all arise from the same origin, governed by the same sovereign. Yet their great compassion and great vows ever respond to devotion with descending mercy. By virtue of their profound power and profound grace, they repeatedly answer prayers in an instant. We now humbly lay bare our hearts, and as the sword-talismans align, the sagely chariot descends. The lamp flames blaze, and the divine radiance descends; the numinous conclave is complete. The dark effigy is arrayed in splendor, and the bright water and fragrant wine are presented as the first offering.\n\nRitual Proceedings—\n\nWe, your humble servants, together in sincerity, most respectfully address:\n\nThe Wondrous Dao of the Void Emperor of the Ten Poles,\nThe High Perfected,\nThe Celestial Lord of the Dragon Han of the *fan* qi,\nThe Heavenly Empress of Sacred Virtue and Golden Radiance,\nThe Great Dao Lords of the Nine Dipper Sovereigns,\nThe Boundless True Governors of the Dipper Palaces,\nThe Star Lords of our Original Destiny,\nThe Master Lords of the Fire Bureau,\nThe Marshal Generals of the Three Realms,\nand all the mighty numina—\nwe reverently gaze toward your sagely compassion, beseeching your luminous regard.\n\nWe have heard that in responding to the Nine Heavens and the Nine Earths, none are more revered than the Nine Sovereigns. Whether called the Northern Pole or the Northern Asterism, none are more illustrious than the North Dipper. Resplendent above, they traverse the heavens. Thus, all who possess ears and eyes cannot fail to see and hear.",
      "overlap_context": "the ninefold steps, we offer our single sincerity. Purple clouds billow over the crimson bridge, auspicious mists surge through the colorful banners. Embroidered robes lead the way, swiftly descending to the jasper altar; silver flames intertwine, as if the Dipper’s pole were arrayed in a forest of stars.\n\nWe, together with the altar officers, look afar toward the celestial steps, welcoming the stellar chariot.\n\nBurn the Talisman to Receive the Celestial Descent—\nInvoke the Descent of the Sages.",
      "start_char": 3485,
      "end_char": 4152,
      "start_sentence": 150,
      "end_sentence": 168,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.17073702812195,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\太乙火府奏告祈禳仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "而具性命者，均从赋予。 功参万化，道贯三才，大如海岳之灵祇，举拜涵濡之泽微。 若江河之鱼鳝，亦倾朝戴之心。 顾何灾不灭，何福不臻。 抑所感必通所求，必应用敷悃。 素仰读高明明，水芳醪，式陈亚献。 法事 具位臣某等谨同诚上启： 虚皇妙道，十极高真，梵炁龙汉天君，紫光金真圣德天后，北斗九皇大道君，斗宫无边真宰，本命元辰星君，火府师君，雷神天帅，三界官属，一切威灵，恭望圣慈，洞回昭鉴。 臣闻为枢机，作主宰，运六气，而御四时。 理纲纪，统乾坤，总五行，而司八卦。 光临下土，位冠中天。 原夫太素之未，分无形无象，粤自混黄之成，化有纬有经，皇人按笔以书符，太上开函而演奥。 座扶玉局，教阐金科，蹑景履师，绰着家书之妙。 旨飞神，谒帝聿，彰火府之灵文。 仰惟奕世以相传，爰许微臣而致恳念，葵藿之诚可格愧潢污之荐非仪，明水芳醪，式陈终献。 法事　进章　或表 臣闻道无心，而可情求，太上示延生之典。 天不言而能善应，斗真垂度厄之科，星驭俯临霞裾并，集礼既成於三献，诚敢怠於一心。 仰维上古之结绳，不假文字，继自皇人之按笔以演洞章。 故封缄得以将恳谢之辞，而毫楮遂式达敷陈之意。 宸聪伊迩，圣鉴非遥，九顿首以望天颜，三熏手而披云笈。 金舆玉辇，昭回己格於凡尘。 玉字金书，报应即颁於温诏。 臣谨关法坛神吏，急急捧奏，以闻爰有：表文心章。 谨当跪奏。 宣关毕",
      "translated_text": "And all who possess life and destiny are equally endowed by this bestowal.\nTheir merit pervades the myriad transformations; their Dao/Way unites the Three Powers.\nVast as the numina of seas and mountains, they are revered; their subtle blessings, like the nurturing moisture of rain, are universally received.\nEven the fish and eels of rivers and streams turn their hearts in morning devotion—\nhow could any calamity not be dispelled, any blessing not be attained?\nYet what is felt must be communicated, what is sought must be answered; thus we present our earnest offering.\n\nWith pure sincerity, we, your humble servants, reverently address:\nThe Perfected of the Wondrous Dao/Way of the Supreme Void,\nThe Celestial Lord of the Dragon Han of the *fan* qi,\nThe Heavenly Empress of Sacred Virtue and Golden Radiance,\nThe Great Dao Lords of the Nine Dipper Sovereigns,\nThe Boundless True Governors of the Dipper Palaces,\nThe Star Lords of our Original Destiny,\nThe Master Lords of the Fire Bureau,\nThe Thunder Gods and Celestial Marshals,\nand all the mighty numina of the Three Realms—\nwe reverently gaze toward your sagely compassion, beseeching your luminous regard.\n\nWe have heard that they serve as the pivot and master,\ngoverning the six qi and directing the four seasons,\nordering the principles of governance, unifying Heaven and Earth,\nencompassing the five phases and presiding over the eight trigrams.\nTheir radiance descends upon the earthly realm; their station crowns the center of Heaven.\n\nIn the beginning, before the Great Simplicity, there was neither form nor image.\nYet since the formation of the Primal Yellow, transformation has followed its warp and weft.\nThe August Person took brush in hand to inscribe talismans; the Supreme One opened the scrolls to expound their mysteries.\nSeated upon the jade register, they taught the golden precepts.\nTreading the luminous path of their teachers, they revealed the subtleties of the ancestral texts.\nTheir commands soar as spirits; their audience with the Emperor is swift.\nThus the numinous writ of the Fire Bureau is made manifest.\n\nWe humbly recall that these teachings have been transmitted through generations,\nand we, your humble servants, are permitted to offer our earnest pleas.\nOur sunflower-and-bean sincerity may move you, though our meager offerings of stagnant waters and humble libations are unworthy.\nYet we present this clear water and fragrant wine as our final offering.\n\nThe ritual proceeds; memorials or petitions are presented.\nWe have heard that the Dao/Way is without intent yet may be sought through devotion;\nthe Supreme One revealed the canon of life extension.\nHeaven does not speak yet responds with perfect efficacy;\nthe Dipper Perfected bequeathed the statutes for averting misfortune.\nThe stellar chariots descend, their rosy hems gathered in assembly.\nThe rites of the three offerings now complete, how dare we falter in wholehearted devotion?\n\nWe recall that in high antiquity, knotted cords sufficed without written words.\nThen came the August Person, who took brush in hand to expound the luminous scriptures.\nThus, sealed petitions may convey our grateful pleas,\nand brush and paper may fully express our earnest intent.\nThe imperial hearing is near; the sagely regard is not distant.\nNine prostrations raise our gaze toward the celestial countenance;\nthrice we purify our hands to unfold the cloud-bound scriptures.\nThe golden chariots and jade carriages have already descended to the mortal dust.\nThe jade missives and golden writs shall soon bestow their gracious decrees in response.\n\nWe now command the divine officers of the ritual altar to swiftly bear our petition aloft.\nThus, we present:\nThe memorial text and the petition of the heart.\n\nWe shall kneel to make our reverent address.\nThe proclamation of the talismanic writ is complete.",
      "overlap_context": "ureau,\nThe Marshal Generals of the Three Realms,\nand all the mighty numina—\nwe reverently gaze toward your sagely compassion, beseeching your luminous regard.\n\nWe have heard that in responding to the Nine Heavens and the Nine Earths, none are more revered than the Nine Sovereigns. Whether called the Northern Pole or the Northern Asterism, none are more illustrious than the North Dipper. Resplendent above, they traverse the heavens. Thus, all who possess ears and eyes cannot fail to see and hear.",
      "start_char": 4152,
      "end_char": 4719,
      "start_sentence": 169,
      "end_sentence": 195,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.526137113571167,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\太乙火府奏告祈禳仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "师步罡伏地，待报得报，即起上香。 解厄 大圣北斗七元君，能解三灾厄。 大圣北斗七元君，能解四煞厄。 大圣北斗七元君，能解五行厄。 大圣北斗七元君，能解六害厄。 大圣北斗七元君，能解七伤厄。 大圣北斗七元君，能解八难厄。 大圣北斗七元君，能解九星厄。 大圣北斗七元君，能解夫妻厄。 大圣北斗七元君，能解男女厄。 大圣北斗七元君，能解产生厄。 大圣北斗七元君，能解复连厄。 大圣北斗七元君，能解疫疠厄。 大圣北斗七元君，能解疾病厄。 大圣北斗七元君，能解精邪厄。 大圣北斗七元君，能解虎狼厄。 大圣北斗七元君，能解虫蛇厄。 大圣北斗七元君，能解劫贼厄。 大圣北斗七元君，能解枷棒厄。 大圣北斗七元君，能解横死厄。 大圣北斗七元君，能解咒誓厄。 大圣北斗七元君，能解天罗厄。 大圣北斗七元君，能解地网厄。 大圣北斗七元君，能解刀兵厄。 大圣北斗七元君，能解水火厄。 大圣北斗七元君，能解一切厄。 於是七元君，大圣善通灵。 济度诸厄难，超出苦众生。 若有急告者，持诵保安平。 尽凭生百福，咸契於五行。 三魂得安健，邪魅不能停。 五方降真炁，万福自来并。 长生超八难，皆由奉七星。 生生身自在，世世保神清。 善似光中影，应如谷裹声。 三元神共护，万圣眼同明。 无灾亦无障，永保道心宁。 迁转　受医　起占 具位臣某等，谨重诚上启虚皇妙道十极高真、梵炁龙汉天君、紫光金真圣德天后，北斗九皇大道君、斗宫列班真宰、本命元辰星君、火府师君、天神雷师，灯坛所启，列位高真，恭望祥光，洞回昭鉴。 臣闻悔过虔恭，诅敢式违於经教，奏章恳愿，庶几可格於天心。 江海弘深，乾坤广大，维无不包而无不入，故有所受而有所容。 伏念某等，薾尔微生，混然中处，粗知学道，尚愧随流，抚戒行之，既亏顾操，修之弗正，七情六欲尤致牵缠，三业六根未能清净。 因而授法，愈以招非，出伪隐真，谈空说有，漏泄玄科之秘旨，益增黑簿之罪名，动积多愆，居无片善，或蹑纪飞罡而次序乖於左右，或存思注想而闻见乱於后先。 香火之祀罔虚，符篆之书实舛。 虽昭昭之际人所不知，然冥冥之中神赫其怒，迨兹发露咸丐赦原俾臣等，籍上清都字题丹晨形神冲寂共期玄妙之游，志意真纯，永奉虚无之化，上愿天祥地泰，君圣臣贤，日月贞明，雨旸时若，四海息战争之祸兆，民歌丰乐之年。 次愿斋官某，吉叶太和，数超前定，魔无干犯。 俾禄马之资扶，身有光明锡魂，神之澄正一家长幼四序康安。 臣等七世先灵，早达逍遥之境。 三涂滞魄，俱登快乐之乡。 凡在有情，冀叨洪施，以今香残宝篆，漏趣铜壶，余光遥映於蓬茅，清跸已先於辇辂，鹓行鹭列，维闻环佩之珊珊； 凤啸鸾吟，仅睹冠裳之秩秩，霓旌羽盖已在璇霄，虎卫龙酿还归金阙，丹雾绛霞之郁勃，琼楼玉宇之高寒，克厥初图。 厥终莫尽，勤拳之意，焂而来忽而往，徒深依恋之情。 臣与斋官，遥望天阶，奉辞仙驭。 太乙火府奏告祈禳仪竟 #1『掌』当为『赏』。",
      "translated_text": "The master paces the ritual steps, prostrates upon the earth, and awaits the divine response. Upon receiving it, he rises to offer incense.\n\n**Dissolving Calamities**\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves the calamities of the Three Disasters.\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves the calamities of the Four Malevolences.\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves the calamities of the Five Phases.\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves the calamities of the Six Harms.\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves the calamities of the Seven Injuries.\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves the calamities of the Eight Difficulties.\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves the calamities of the Nine Stars.\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves the calamities of husband and wife.\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves the calamities of men and women.\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves the calamities of childbirth.\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves the calamities of repeated misfortune.\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves the calamities of epidemics.\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves the calamities of illness and disease.\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves the calamities of malevolent spirits.\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves the calamities of tigers and wolves.\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves the calamities of insects and snakes.\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves the calamities of bandits and robbers.\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves the calamities of cangues and cudgels.\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves the calamities of unnatural death.\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves the calamities of curses and oaths.\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves the calamities of Heaven’s Net.\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves the calamities of Earth’s Snare.\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves the calamities of blades and weapons.\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves the calamities of water and fire.\nGreat Sage of the Seven Primes of the Northern Dipper,\nWho dissolves all calamities.\n\nThus, the Seven Primes,\nGreat Sages of wondrous spiritual efficacy,\nDeliver and ferry across all calamities and hardships,\nLifting sentient beings from suffering.\nShould there be those who urgently invoke,\nRecitation ensures peace and safety.\nAll rely upon the generation of a hundred blessings,\nAll harmonize with the Five Phases.\nThe Three Hun souls attain peace and health,\nAnd malevolent spirits cannot linger.\nTrue qi descends from the Five Directions,\nAnd myriad blessings naturally converge.\nLongevity transcends the Eight Difficulties,\nAll through reverence for the Seven Stars.\nLife after life, the body remains at ease,\nAnd generation after generation, the spirit stays pure.\nGoodness mirrors the reflection in light,\nResponse echoes the sound within the valley.\nThe Three Primes’ spirits jointly guard,\nThe myriad sages’ eyes share clarity.\nWithout disaster, without obstruction,\nForever preserving the tranquility of the Dao-heart.\n\n**Transformation, Medical Treatment, Divination**\nWe, your humble servants, so-and-so and others, with utmost sincerity, reverently address the Supreme Void’s Wondrous Dao, the Ten August Perfected, the Brahma-qi Dragon Han Heavenly Lords, the Purple Radiance Golden Perfected Sagely Virtue Heavenly Empress, the Northern Dipper’s Nine August Dao Lords, the ranked true sovereigns of the Dipper Palace, the Star Lords of our original destiny, the Fire Mansion Master Lords, the Heavenly Thunder Masters, and all the exalted perfected invoked at the lamp altar. We gaze reverently toward your auspicious radiance, praying that your luminous regard may illumine us.\n\nWe have heard that repentance and reverence dare not transgress the scriptural teachings, and that earnest petitions may perhaps move the celestial heart. The rivers and seas are vast and deep, heaven and earth broad and great—there is nothing they do not encompass, nothing they do not embrace. Thus, there is that which is received, and that which is contained.\n\nWe humbly reflect that we, your servants, are but fleeting and insignificant lives, adrift in the midst of the world. Though we have roughly studied the Dao, we remain ashamed to follow the current. In observing the precepts, our conduct has been lacking; in cultivating ourselves, we have not been upright. The seven emotions and six desires still entangle us, and the three karmic actions and six senses remain impure. Thereby, though we have received the dharma, we have only invited further transgressions. We have concealed truth and feigned falsity, discoursed on emptiness and expounded on existence, leaked the secret purport of the mysterious precepts, and increased the sins recorded in the Black Book. Our actions accumulate many faults, and we dwell without a single good deed. At times, we tread the steps of the flying Dipper’s pace yet err in the sequence of left and right; or we focus our thoughts and direct our contemplation yet confuse what is heard and seen in their order. The offerings of incense and fire have not been without negligence, and the writing of talismans and registers has indeed been flawed.\n\nThough these transgressions may be unknown to others in the brightness of day, in the hidden darkness the gods are surely enraged. Now that we have revealed them and sought forgiveness, may we, your servants, be permitted to inscribe our names in the registers of the Upper Clarity’s capital, that our forms and spirits may ascend to the tranquil void and together pursue the wondrous journey. May our aspirations be truly pure, and may we forever serve the transformation of the Void and Non-being.\n\nWe first pray for celestial auspiciousness and earthly prosperity, for a sagely ruler and worthy ministers, for the sun and moon’s steadfast brightness, and for timely rain and sunshine. May the four seas be free of the omens of war, and may the people sing of years of abundance and joy.\n\nNext, we pray for the ritual master, so-and-so, that his fortune may align with the Great Harmony, that his destiny may surpass predetermination, and that no demonic forces may assail him. May the resources of his official salary and celestial horses support him, and may his body be endowed with luminous blessings. May his spirit be clarified and rectified, and may his entire household—young and old—enjoy peace and health in all four seasons.\n\nMay your servants’ seven generations of ancestors swiftly attain the realm of carefree wandering. May the lingering souls in the Three Wretched Realms all ascend to the land of bliss. May all sentient beings partake of your vast grace.\n\nNow, as the incense wanes and the precious talismans near their end, the water clock hastens its flow. The remaining light still shines afar upon the thatched hut, while the clear imperial progress has already preceded the imperial carriage. The ranks of mandarin ducks and egrets are heard in the jingling of their pendants; the phoenix’s call and the luan’s song are glimpsed in the order of their caps and robes. The rainbow banners and feathered canopies now rest in the celestial palace, while the tiger guards and dragon stewards return to the golden gates. The crimson mists and scarlet clouds billow, and the jade towers and gem chambers stand in lofty cold. We have fulfilled our initial intent, yet the end remains beyond reach. Our earnest devotion, swift in coming and fleeting in going, only deepens our lingering attachment.\n\nWe, your servants, along with the ritual master, gaze afar toward the celestial steps and take leave of the immortal’s chariot.\n\nThe rite of supplication and exorcism for the Great Unity Fire Mansion is now complete.",
      "overlap_context": "nance;\nthrice we purify our hands to unfold the cloud-bound scriptures.\nThe golden chariots and jade carriages have already descended to the mortal dust.\nThe jade missives and golden writs shall soon bestow their gracious decrees in response.\n\nWe now command the divine officers of the ritual altar to swiftly bear our petition aloft.\nThus, we present:\nThe memorial text and the petition of the heart.\n\nWe shall kneel to make our reverent address.\nThe proclamation of the talismanic writ is complete.",
      "start_char": 4719,
      "end_char": 5951,
      "start_sentence": 196,
      "end_sentence": 251,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.249340295791626,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\太乙火府奏告祈禳仪.txt",
        "category": "威仪类"
      }
    }
  ]
}