{
  "source_id": "太上洞玄灵宝智慧本愿大戒上品经",
  "source_file": "chunked_daozang\\太上洞玄灵宝智慧本愿大戒上品经.json",
  "total_chunks": 9,
  "total_original_chars": 8704,
  "total_translated_chars": 50108,
  "total_translation_time": 237.41577553749084,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝智慧本愿大戒上品经.txt",
    "category": "本文类"
  },
  "full_translation": "*The Supreme Cavern Mystery Numinous Treasure Sutra of the Wisdom and Original Vows of the Precepts, Upper Grade*\n\n**Sutra Title:** *The Supreme Cavern Mystery Numinous Treasure Sutra of the Wisdom and Original Vows of the Precepts, Upper Grade*. Also known as: *The Supreme Sutra of the Wisdom and Original Vows of the Precepts for Dispelling Demons, Preserving the Body, and Settling the Mind, Upper Grade*.\n\nComposed by an unknown author, approximately dating to the Eastern Jin dynasty. One of the ancient *Numinous Treasure Scriptures*. One scroll.\n\n**Base Text:** *Daoist Canon of the Zhengtong Era*, Cavern Mystery Section, Textual Category.\n**Collated with:** Dunhuang manuscripts P.2468, S.6394, and P.2400.\n\n---\n\n### *The Supreme Cavern Mystery Numinous Treasure Sutra of the Wisdom and Original Vows of the Precepts, Upper Grade*\n\n**1.**\nThe Celestial Pole Immortal Duke respectfully inquired of the Celestial Pole Dharma Master.\n\nWhile the Immortal Duke was in quiet retreat on Mount Tiantai, reverently cultivating the Dao, he bowed in worship and addressed the Numinous Treasure Mystic Master, the Celestial Pole Supreme Void Perfected One:\n\n**2.**\n\"As your disciple, I am fortunate to attend in the presence of the Heavenly Worthy. My humble words, though slight, encompass the myriad kalpas; gazing deeply into the source of the Dao, my joy surpasses all measure. Yet, from my youth, I have been fond of the Way of divine transcendents and the path of ascending in broad daylight. My thoughts ever aspire to the sagely realms, though I have only glimpsed them faintly. The great scriptures are profound and distant, their subtleties difficult to fathom. I now seek oral instructions to dispel the darkness of my ignorance, to thoroughly illuminate the void and the obscure, where being and non-being are wholly exhausted.\n\nRecently, I have yet to fully comprehend the causes and conditions of past lives and the origins of human existence. Today, I beseech the Heavenly Worthy to enlighten what I have not yet awakened to.\"\n\nAt that moment, the Supreme Cavern Perfected One chanted and intoned the *Cavern Hymns of the Void*, his countenance radiant with joy.\n\n**3.**\nWith a golden glow upon his face and a smile, he spoke: \"This one has cultivated the Dao across countless kalpas, attaining the jade name of the Celestial Pole. Dwelling among the wise, he shall stride alone through the Jade Capital, transcending the Three Realms—how majestic is the task of the Supreme Immortal Duke! Thus, his compassion extends to gods and humans, and his thoughts turn to guiding later learners. He constantly saves beings by relinquishing his own form, possessing virtue yet remaining unnamed. The assessments of the Mystic Metropolis are surely not in vain.\n\nHe then addressed the Celestial Pole Perfected One: 'You have received the command of the Supreme Void Sovereign Dao Lord to serve as his master and protector. You must fully instruct him in the profound mysteries of the Supreme Great Cavern—why wait for him to ask repeatedly? I, unworthy, am merely the Dharma Master of the Teaching Assembly. As for holding the scroll, that is your duty.'\"\n\n**4.**\nThe Celestial Pole Perfected One replied: \"This youth of pure integrity has a name inscribed on the golden tablets. His nature is pure and transcendent, his brilliance surpassing the Supreme. Profound and subtle, he penetrates the void—thus, he is destined for the role of Immortal Duke, a great vessel for propagating the Dao. Though I, unworthy, have received the charge of instruction, I am ashamed to be inadequate as his master. Yet, the Supreme One has issued a command—how dare I not pour forth all that I contain?\"\n\nThe governance of all mysteries depends upon you, Dharma Master.\"\n\nThe Celestial Pole Perfected One said: \"The Dao is Non-Being. Pervading the boundless, if you seek it, it lies near within yourself—yet it is also Being. Through Being one enters Non-Being; through accumulated contemplation one attains the wondrous. The myriad things teem like illusions, all destined to return to emptiness. The human body is no different: when the body dies, the spirit departs. It may be likened to a house—when the house collapses, the person cannot stand; when the body decays, the spirit cannot dwell. Thus, one must restrain thoughts to stabilize the will, quiet the body to settle the spirit, treasure qi to preserve essence, and forget both reflection and care. Inwardly meditate and visualize, and body and spirit will unite as one. When body and spirit unite, one approaches the true body. This truly arises from the fundamental conduct of past lives, from accumulated contemplation and repeated resonance, from merit that aids all beings and virtue that shades the myriad things. Through the turning of karmic conditions, sin and blessing stand in opposition, life and death alternate, noble and base employ one another, worthy and foolish vie, poor and rich deceive, good and evil manifest—their suffering is measureless, all earned by the vows and deeds of human beings. It is neither the Dao nor Heaven, neither Earth nor man, nor the work of the myriad things, but precisely the heart. Once this duality is fixed, it is difficult to escape. Among the weak and lost, few believe in the Dao, many cling to past lives. Without accumulating goodness and stabilizing contemplation, without cultivating virtue in one’s person, yet desiring to neglect virtue and forget the self, forcibly seeking external things—how can this be attained? Having already failed, none avoid harm to the body. Therefore, the man of Dao draws from his own person and seeks nothing from others. As the scripture says: 'Cultivate it in the self, and one’s virtue becomes true.' This is what it means.\n\nTo study the Dao without receiving the Great Wisdom, the Fundamental Vows, and the Upper Grade Precepts of the Dao Conduct, one has no means to ascend as an immortal. You possess past-life karmic affinity, which is why you behold this scripture. Its text is recondite; first establish faith and verify the heart, then transmit it. It must not be rashly shown to the faithless. If they do not believe, they will surely entertain heterodox thoughts. Once heterodox thoughts arise, both parties incur transgression. Therefore, conceal it in the realm of Non-Being and await one destined to become an Immortal King before revealing it.\"\n\nAt that moment, clouds and dragons leapt and danced, the various heavens scattered blossoms, flying incense and curling smoke arose, mountains and seas stilled their waves, all things fell silent, ghosts and demons vanished, divine and demonic forces submitted, the Five Sufferings were wholly resolved, those long bound in hell were released, the wicked turned to goodness, and the faithful and obedient received blessings. Then the Celestial Pole Perfected One commanded the scripture-attendant, the immortal Liu Wenjing, to part the clouds and report before bestowing the scripture.\n\n**The Upper Grade Precepts of the Fundamental Vows of Great Wisdom**\nThe Celestial Pole Perfected One said: \"In past lives, one reverently served scripture masters, recited with the mouth and practiced with the body, gave alms to those in distress, took joy in the Three Treasures, was loyal to lord and filial to parents, longed for mountains and rivers, dwelt among worthy scholars, maintained an empty mind and embraced the Dao, burned incense and scattered blossoms, protected and delivered all beings, cultivated virtue and amended faults, believed in and submitted to past-life karma, stilled thoughts and restrained emotions. In such conduct, above one may ascend as an immortal and deliver the world; below one may revolve through cycles of wealth and nobility, be born as a person of honor, with a majestic and handsome appearance, pure and transcendent talent and wisdom. In the Way of being human, nothing is lacking.\n\nThose who, dwelling in wealth and nobility, scorn the poor and lowly will in this life be repaid with poverty and lowliness. Those who delight in killing in this life will be repaid with early death and injury...\"\n\nThose who, dwelling in the world, mock the plain and homely will in this life be repaid with plainness and homeliness. Those who, dwelling in the world with keen intelligence, do not teach others will in this life be repaid with dullness and obstruction. Those who, dwelling in the world in constant health, mock the afflicted and sick will in this life be repaid with chronic illness. Those who, dwelling in the world, do not believe in the Dao and mock the scriptures and teachings will in this life be repaid with utter foolishness, forever cut off from the Dao.\n\nThose who, dwelling in the world, steal another’s husband will in this life be repaid with early widowhood. Those who, dwelling in the world, seduce another’s wife will in this life be repaid with lifelong solitude. Those who, dwelling in the world, pledge to be husband and wife but later fail to be reborn together in the human realm, dying as lowly ghosts, will in this life be repaid according to their original vow, suffering from perverse illnesses. Without the great Dharma, none can untangle their karmic bonds or dispel these perverse illnesses.\n\nAs for fathers and mothers, brothers and sisters, husbands and wives, rulers and ministers, teachers and guardians, friends—all are bound by past-life vows, wishing to become karmic conditions, revolving through cycles of rebirth. None are without their counterparts, hence it is said that fortune and misfortune are unfathomable.\n\nOnly the scholar of the immortal Dao should forget karmic conditions, sever the bonds of life and death, and merge into the mysterious, entering the wondrous gate. Those who can do this are fit to be called students of the Dao.\n\nWhen seeing a household with wife and children, one should wish for all to swiftly escape the prison of love, restrain the mind, and uphold the precepts. When seeing someone drinking wine, one should wish for all to restrain themselves at the Gate of Life, avoiding calamity and chaos. When seeing palace women, one should wish for all to guard purity, endure with resolve, and aspire to virtue and chastity. When seeing the licentious, one should wish for all to cast aside impure thoughts and turn their minds toward restraint. When seeing women, one should wish for all to endure the severing of frivolity and delight in the Dao for self-joy. When seeing a perfected person, one should wish for all to tread the path of faith and right transformation, daily entering the Dharma gate. When seeing the multitude, one should wish for all to extend benevolence without contention, embracing the Dao and bringing peace to the world.\n\nWhen seeing the good, one should wish for all to constantly hold them in mind, emulating their Way. When seeing the wicked, one should wish for all to abandon evil and turn toward good, avoiding transgressions against the king’s law. When seeing the poor, one should wish for all to diminish the self and bestow kindness, later receiving great fortune. When seeing the rich, one should wish for all to aid and relieve all beings, receiving blessings for generations. When seeing the noble, one should wish for all to follow their teachings, fully aligning with classical precepts. When seeing the lowly, one should wish for all to diligently cultivate without slack, each attaining their aspirations.\n\nWhen seeing the emperor, one should wish for all to revere and uphold the kingly Dao, honoring him as father and mother. When seeing the prime minister, one should wish for all to receive his teachings and governance, with the four directions turning toward benevolence. When seeing soldiers and armor, one should wish for all to harbor thoughts of benevolence, with the world yielding to the worthy. When seeing the prince, one should wish for all to daily sing of great peace, upholding the state and continuing the family line.\n\nWhen seeing the worthy, one should wish for all to practice their virtue, with the Dao revered as the world’s model. When seeing a Dharma master, one should wish for all to clearly understand the Dharma and its measures, attaining the Dao and non-action. When seeing a mountain-dwelling Daoist, one should wish for all to fully perceive the Dharma gate, swiftly ascending as immortals. When seeing education and transformation, one should wish for all to personally receive the sagely teachings, becoming vast and erudite.\n\nWhen seeing a sage, one should wish for all to honor and serve them, with all nations gazing in reverence. When seeing an immortal, one should wish for all to perfect the true Dao, ascending to the heavenly halls. When seeing city walls, one should wish for all to be strictly ordered and adorned, with the Dao as their foundation. When seeing a great nation, one should wish for all to revere and admire virtue, like rivers flowing to the sea. When seeing a small nation, one should wish for all to know restraint, embrace emptiness, and be content in their place.\n\nWhen seeing the marketplace, one should wish for all to gather like clouds around the worthy, widely propagating the right Dao. When seeing a quiet abode, one should wish for all to accumulate towering merit, with heaven and humans attaining their aspirations. When seeing fasting, precepts, and incense offerings, one should wish for all to daily renew their virtue and morality, with schools and teachings refined and proper.\n\nWhen seeing scripture recitation, one should wish for all to fully enter the Dharma gate, hearing the wondrous teachings. When seeing scriptural teachings, one should wish for all to individually receive, read, and practice them, universally spreading transformation. When seeing towers and observatories, one should wish for all to penetrate and observe the ten directions, with nothing hidden or concealed. When seeing high mountains, one should wish for all to establish virtue like them, never regressing.\n\nWhen seeing the great sea, one should wish for all to possess boundless wisdom and thought, aiding in the completion of family and state. When seeing a flourishing forest for dwelling, one should wish for all to reside in peace and ease, sheltering all beings. When seeing diligent study, one should wish for all to become masters and teachers, nurturing disciples and spreading teachings.\n\nWhen seeing clean hands, one should wish for all to constantly hold scriptures, never ceasing even for a moment. When seeing eloquent speech, one should wish for all to delight in chanting the profound scriptures, daily renewed without weariness. When seeing moving feet, one should wish for all to transcend the Three Realms, flying to the Upper Clarity. When seeing stillness, one should wish for all to extinguish illusions and halt the true, abiding in tranquil emptiness.\n\nWhen seeing food and drink, one should wish for all to cast off burdens and enter purity, preserving the flavor of the Dao. When seeing great storehouses, one should wish for all to eliminate disasters and calamities, becoming fields of fortune. When seeing illness, one should wish for all to rely on the Dao for peace, avoiding this suffering and distress. When seeing death and mourning, one should wish for all to study the Dao and abide forever, delivering beings from the Three Wretched Realms.\n\nWhen seeing hunting, one should wish for all to refrain from beginning or ending it, avoiding the sin of uninterrupted suffering. When seeing barbarians, one should wish for all to be born in the Central Kingdom, not in the borderlands. When seeing the young, one should wish for all to study in a timely manner, achieving scholarly renown. When seeing the aged and infirm, one should wish for all to nurture life with the Dao, avoiding further decline and decrepitude.\n\nWhen seeing the Three Luminaries, one should wish for all to universally radiate numinous brilliance, dispelling darkness and gloom. When seeing clouds and rain, one should wish for all to overflow with beneficent moisture, suiting every need. When seeing pristine snow, one should wish for all to dwell perpetually in purity, carefree and at ease. When seeing the numinous wind, one should wish for all to unfold their hidden virtues and scatter them afar, their power flowing near and far. When seeing pure water, one should wish for all to wash away filth and attain clarity, their minds made equal. When seeing fine incense, one should wish for all to receive this fragrance and purity, all defilements vanishing. When seeing lovely flowers, one should wish for all to delight in revering the sages, their marks of excellence complete. When seeing carriages and horses, one should wish for all to attain the Dao and abide in non-action, riding phoenixes and driving dragons. When seeing music and song, one should wish for all to chant scriptures and praise the Dharma, finding joy in the Dao. When seeing blessed food, one should wish for all to be ever sated, enjoying the celestial kitchens of the world, their virtue flowing to all beings as water returns to the sea, their ancestral temples enduring, their descendants noble and long-lived, ever dwelling in honor and prosperity, and in every generation, together with the Four Assemblies, to be born into royal houses.\n\nWhen seeing alms given freely, one should wish for all to have their misfortunes extinguished in the Nine Yin, their blessings arising in the Ten Directions, their virtue vast as mountains and seas, all flourishing without fail, their seven ancestors reborn in heaven, their descendants wise and loyal, their wealth and nobility towering, all desires fulfilled, studying the Dao to become flying immortals, riding clouds and driving dragons.\n\nDaoists, whether sitting or lying down, should constantly wish for us all: that the Four Great Elements unite in virtue, our bodies in harmony with the true Dao, eternally dwelling in the Mysterious Capital, our masters and companions natural, delivering the Ten Directions, the world receiving grace, carefree in non-action, penetrating the wondrous gate.\n\n**Three Invocations for Scriptural Homage**\n\nThe True One’s oral instructions state: When jade lads and maidens attendant upon the scriptures hear this invocation, they rejoice and protect the practitioner’s body. All great scriptures employ this invocation in their rites of homage.\n\nThose who reverently perform scriptural homage in meditative stillness should silently recite its words—this is the secret invocation of the highest immortals:\n\n*\"Delight in the Dharma as one’s spouse,\nCherish the scriptures as pearls and jade.\nUphold the precepts to restrain the six senses,\nContemplate the Dao to dispel desires.\nSerene and unperturbed, the upright qi abides,\nDetached and tranquil, the spirit still and silent.\nHeavenly demons all revere and guard,\nLifetimes of great blessings received.\nFlourishing are family and state,\nThriving the scriptures and the Dao.\nHeaven and humanity share this vow,\nEthereally entering the Great Vehicle.\nEstablishing fields of blessing in the heart,\nThe Dharma wheel ascends in boundless ascent.\nSeven ancestors reborn in celestial halls,\nMy body ascends at midday.\nThe Great Dao pervades the Mysterious Void,\nWith mindfulness, all is perfectly aligned.\nRefining the body to join the immortals,\nAttaining the vajra body.\nTranscending the Three Realms’ trials,\nThe Five Sufferings of hell dissolved.\nAll return to the Most High’s scriptures,\nIn still contemplation, bowing in homage.\"*\n\nThis invocation is titled *\"The Hidden Scripture of Wisdom and Daoist Conduct: The Original Vow of the Precious Precepts of the Uppermost Precepts\"*—transmitted by the Most High August Sovereign of the Void to the Most High Lord of the Great Dao, the Lord of the Great Dao to the Lord of the Grand Tenuity, the Lord of the Grand Tenuity to the Ninefold Radiance of the Grand Realized Ones, the Grand Realized Ones to the Great Dharma Master of the Grand Ultimate, and thence to the High Immortal Duke Wang of the Grand Ultimate, never disclosed to the median immortals. After a thousand years and three transmissions, even those without their names inscribed on the Most High’s golden tablets shall never encounter these scriptural precepts. Daoists, should the time come when they receive them, must guard and uphold them in secrecy.\n\nTen jade lads attend the Most High, overseeing and protecting the disciples’ bodies. At times, worthy scholars and faithful men and women may not be entirely cut off from the sacred texts. On their natal days, the first day of the sexagenary cycle, the *gengshen* days, and the eight seasonal nodes, they should fast and recite the scripture once through.\n\nThe Perfected One of the Grand Ultimate said: *\"To study the Dao of ascending as an immortal, one must establish one thousand two hundred acts of goodness, never receiving retribution. To establish three thousand acts of merit is to ascend to heaven in broad daylight—all such acts rescue people from mortal peril, and bestowing kindness upon them is especially virtuous. In studying the Dao, one should ensure that all conduct accords with the Dharma, broadly establishing fields of blessing, arousing the mind of great compassion, and constantly awakening the intention of the Dao in movement and stillness. Those who can do this—practicing breath refinement, consuming elixirs, wearing talismans, reciting scriptures, and cultivating focused contemplation without weariness—how could they fail to attain immortality? Those lacking such virtue, though they consume elixirs, wear talismans, recite scriptures, and observe fasts, will still meet their end without verification. Disciples, ponder these essential words.\"*\n\nThe Perfected One of the Grand Ultimate said: *\"Establishing three hundred acts of goodness can secure long life as an earthbound immortal. If even one act is incomplete, one must begin anew, and all prior merits are lost. Only those whose thoughts constantly dwell in the heart-mind achieve this. Guiding others to do good is itself an act of goodness.\"*\n\nThe Perfected One of the Grand Ultimate said: *\"Constantly chanting and reciting, walking while practicing great compassion, putting others before oneself, extolling goodness and transforming evil, severing all karmic ties, extinguishing thoughts and guarding emptiness, the heart like the Grand Mystery, seeking only the Dao—only then can one be said to speak of the divine immortals’ path.\"*\n\nThe Perfected One of the Grand Ultimate said: *\"I formerly received the Ten Wholesome Exhortations and Merit-Assisting Precepts of the Grand Ultimate’s Wisdom from the Highest August Sovereign of the Void. In every lifetime, I have revered and practiced the great Dharma, making the deliverance of beings effortless—this is the natural field of blessing. The Most High, in universally teaching heaven and humanity, now grants each their original vow, enabling entry into the Dharma gate, eternal abiding in non-action, no longer subject to the Ten Sufferings and Eight Difficulties, the dissolution of karmic retribution, the cessation of hells, the Three Officials at peace, lifetimes of honor and joy, all freed from the net of entanglements, future lives secure and tranquil, the heavenly nature serene, and all wishes fulfilled. The precepts are as above, transmitted to the worthy and faithful.\"*\n\n**The Ten Wholesome Exhortations state:**\n1. Exhort and assist in revering the Three Treasures, supporting Dharma masters, so that in the world one becomes a noble person, virtuous, filial, and highly talented, honored and towering, respected by all, with flourishing family and clan.\n   - The Three Treasures are the Dao, the scriptures, and the masters. Those who nurture life, teach goodness, and serve as models for others are called Dharma masters.\n2. Exhort and assist in copying scriptures, so that in the world one becomes wise, widely learned in wondrous traces, constantly encountering sagely eras, seeing all scriptural teachings, and able to recite their passages.\n\n**The Ten Wholesome Exhortations state further:**\n\n3. Exhort and assist in establishing fasting retreats for quiet cultivation, so that in the world one’s family and household become exalted and noble, the body ascends to the heavens, food and sustenance arise naturally, and one constantly abides in non-action.\n\n4. Exhort and assist in offering incense and oil to relieve the needy, so that in the world one becomes fragrant and flourishing, pure and radiant, with a majestic appearance and towering, refined bearing.\n\n5. Exhort and assist in providing Dharma masters with ritual robes, so that in the world one becomes eternally refined, roaming freely within the Central Kingdom, never falling among borderland barbarians, with sons and daughters upright and dignified, adorned in caps and jade pendants.\n\n6. Exhort and assist the king, parents, and the people in loyalty and filial piety, so that in the world one has many descendants, with sons and daughters wise and learned, spared from all suffering.\n\n7. Exhort and assist in fasting, quietude, and scripture recitation, so that in the world one never falls into hell but ascends directly to the heavens, pays homage to the host of sages, swiftly regains one’s true form, and is reborn into a royal household, where all desires are fulfilled, cherished possessions are abundant, the seven generations of ancestors rejoice together, all good affinities are complete, and from beginning to end one enjoys glory and bliss. The Dharma Wheel turns in accord, and one will attain the immortal Dao.\n\n8. Exhort and assist others in studying the scriptures, so that in the world one’s wisdom and insight become penetrating and clear, with dignified bearing in movement and stillness, and one constantly serves as a teacher to others.\n\n9. Exhort and assist in all acts of almsgiving and admonition, so that in the world one enjoys longevity, wealth, and happiness, free from resentment and affliction.\n\n10. Exhort and assist all people in eliminating jealousy and desire, practicing all virtues, so that in the world one lives in peace and joy, free from calamity and disorder. The sick recover on their own, officials are promoted to high rank, and one is revered by all. None fail to receive blessings, the household remains pure and noble, heavenly beings cherish and nurture them, spirits and demons respect and protect them, and they are always born in lands of fortune.\n\nThese are called the *Highest Exhortations of the Dao of Supreme Wisdom*, all drawn from the first scroll of the *Scripture of Great Wisdom*. The method was transmitted by the Perfected One of the Great Ultimate, who practiced and propagated the Dao.\n\nThose with accumulated blessings may encounter this text; they should treasure and uphold it. To recklessly show it to the unfaithful brings misfortune in this very life. After death, one becomes a lowly ghost, confined in hell, enduring the Five Sufferings, and in future lives loses the human path. Those who deface the scriptures or violate the precepts suffer the same fate.\n\nThe Perfected One of the Great Ultimate said: Among human evils, none are greater than jealousy, killing, greed, extravagance, arrogance, and lust. If even one of these dwells in the heart, it will surely cut short one’s years and lifespan. To cling to such faults while seeking to learn the immortal Dao—is this not lamentable?\n\nThe Perfected One of the Great Ultimate said: The *Five Thousand Character Scripture of the Dao and Its Virtue* is the greatest of all scriptures. This Dao, therefore, pervades heaven, earth, and humanity, and all things follow it from beginning to end. The superior person who receives and recites it becomes a Celestial King of the Highest; the middling person becomes a Flying Immortal; the lesser person is reborn into the household of a Wheel-Turning Sage King, never entering hell, and always dwelling in blessed lands. When their lifespan ends, the Heavenly Emperor sends a cloud chariot to welcome their soul, which is then settled in the Hall of Fortune. The number of beings thus delivered is immeasurable—it cannot be fully described.\n\nOnce there was a woman who received and recited this scripture. Her husband constantly resented and berated her, yet she never wavered. One day, she ascended to heaven in broad daylight. Her husband, after death, entered hell and endured years of torment. The woman, now a flying immortal, descended to observe him and instructed him to recite the *Scripture of the Dao and Its Virtue*, saying he would then be saved. At that moment, a heavenly being descended, and the Lord of Mount Tai summoned the man and questioned him. He answered in full: \"I was constantly taught by my wife to revere this scripture. Now that she has ascended as an immortal, I seek deliverance out of past gratitude.\" The Lord said: \"Though you did not originally study, you have consistently revered the Great Dao and honored the scriptures. You may now be sent to the Hall of Fortune, where your meals will be provided. After a thousand years, you will be reborn among humans and may receive and recite this scripture.\" The man replied: \"If I am reborn into the human path, I will surely devote myself to this scripture to seek deliverance from the world.\" After a thousand years, he was reborn among humans. At thirteen, he began to love the *Five Thousand Character Scripture*, studied under a master, received its oral instructions, and became exceptionally wise and intelligent. Though the king invited him with honors, he declined and ascended to heaven in broad daylight. His earlier reverence for the scripture and the deliverance by his virtuous wife were due to this accumulated blessing from past lives.\n\nOnce there was a wise and enlightened Daoist who fasted in a quiet chamber but could not obtain his midday meal. A layman and laywoman, deeply devoted to the Great Dharma, were moved by the Daoist’s endurance of hunger while reciting the scriptures. Day after day, they provided his midday meal and attended his lectures. The Daoist, pitying their devotion, transmitted the scripture to the man and woman, teaching them its oral instructions. Each recited it ten thousand times. The Celestial Emperor’s dragon carriage descended to welcome them, and they ascended to heaven in broad daylight. Such examples are too numerous to record in full.\n\nEven if one cannot study the immortal Dao, all may receive and revere the *Five Thousand Character Scripture*, thereby attaining the Dao of non-action. In this life, one preserves and extends life, the household enjoys peace, and after death, one proceeds directly to the heavens, never again imprisoned in the Three Bureaus’ hells. The key lies in sincere devotion—through this, such great blessings may be effortlessly attained.\n\nThe *Scripture of the Perfect Writs of the Great Cavern* and the *Precious Scripture of the Hidden Mysteries of the Highest Cavern* must not be transmitted to ordinary people. They are meant only for those who can study the immortal Dao and should be cultivated and recited accordingly. If lightly transmitted to the unworthy, one will be imprisoned in hell alongside seven generations of ancestors, enduring the Five Poisonous Torments. Beware, beware!\n\nThe Perfected One of the Great Ultimate said: The delusion of worldly people is that they distance themselves from their ancestors, instead competing to serve ghosts and spirits, slaughtering living beings to seek life—how far have they strayed from true life! While alive, they do not cultivate goodness or refine the self, enduring the severing of desires. Only after death do they lavishly bury their bones, unaware that their souls have already endured the Five Poisons, imprisoned in hell, suffering the agonies of the Three Wretched Paths, and cycling through the Five Destinies.\n\nLife in this world is brief, yet they amass wealth and treasures without end, burdening themselves with heavy loads. When blessings are exhausted and sins arrive, the body dies, the name perishes, and wealth scatters like dust before the wind.\n\nThe Daoist who observes fasts, burns incense, purifies himself, and recites scriptures performs the most noble of worldly deeds. Yet if he does not wish to witness such things, he should regard them as though unseen. When he hears the incantations of shamans and ghost-speakers, he exhausts his wealth and offers lavish gifts to them. Observing fasts in stillness and detachment brings blessings, while shamans’ songs and dances summon misfortune. When misfortune strikes, both their souls and ours endure trials and punishments, with calamities unending, shuttling through the Three Wretched Paths—suffering from which escape is nearly impossible. Once the retribution is complete, they may be reborn as one of the Six Livestock, deprived of the human Way. Even if they return to the human realm, they will be born into lowly stations, some with incomplete faculties, others with hideous forms, their bodies foul and rank, whether male or female—stubborn, foolish, and despised, cast aside by all, drifting through the world in destitution until death from hunger and cold. Such people all bear the karmic consequences of past lives, having come from the Six Livestock before barely regaining the human Way.\n\nYet if in this life they endure hardship and willingly embrace poverty, repenting past wrongs and striving to cultivate the future, seeking to uphold the Dharma to liberate themselves, they will gradually witness retribution in this world, and in the next life receive great blessings. They will be born into the families of the wealthy, noble, or royal, their features perfect, their appearance dignified and majestic, radiant and resplendent, delighting all who behold them. They will be kind, benevolent, trustworthy, and virtuous, endowed with great talent and grand vision. Whether they desire sons or daughters, it shall be as their original vow dictates. They will encounter good companions, forming karmic connections and affinities, naturally meeting in the unseen realm, becoming brothers and descendants to one another. Thus, generation after generation, they will be wise and filial, perpetually reborn in succession, never to be cut off.\n\nThus it is said: \"Interdependence of fortune and misfortune—who can fathom its limits?\" This is what is meant by \"descendants maintaining unbroken ancestral sacrifices.\" The Perfected of the Supreme Ultimate said: The Dao of the Mysterious and the White—ancients who cultivated it prolonged their years and extended their lives, attaining longevity. Yet those who practice it today diminish their years and shorten their lives, hastening their deaths. Can one blame the arts? The fault lies with oneself—is this not lamentable?\n\nThe Perfected of the Supreme Ultimate said: For one who studies the Dao, first be filial to parents, loyal to one’s lord, compassionate to subordinates, and trustworthy to friends. Let your words be irreproachable, admonish evil and praise good, free from partiality or self-interest, and without violating external teachings—thus fulfilling the human Dao. Next, abstain from wine, sensual pleasures, jealousy, killing, extravagance, greed, arrogance, and indolence. Then, sever the Five Pungents, fatty meats, and rich flavors. Next, let thoughts and contemplation merge, and the mind become pure and empty. Then, consume restorative roots, uphold the great precepts, cultivate steadfast resolve, practice embryonic breathing and guiding-and-pulling, harmonize inhalation and saliva, accumulate merit, endure what others cannot endure, relinquish what others cannot relinquish, do what others cannot do, dwell where others cannot dwell, wear what others cannot wear, eat what others cannot eat, uphold what others cannot uphold, and study what others cannot study. Only when the Dao is practiced thus may one be stabilized with numinous medicines, partake of cloud sprouts, cause corpse worms to sink and decay, dissolve impurities, and purify the Three Palaces, so the Five Viscera may rest in tranquility. Then, with prolonged fasting and deep contemplation, silently recite the cavernous scriptures, savor their wondrous flavors, and refine the elixir. Can one who does so fail to attain the Dao of ascending as an immortal?\n\nThe Heavenly Worthy addressed the Perfected of the Supreme Ultimate: If one does not cultivate the human Dao, is disloyal to lord and kin, indulges in wine and sensuality, kills and plunders, is arrogant and self-indulgent, deceives and misleads the worthy, borrows without repayment—if in youth one acts thus, and in maturity cannot reform, allowing the heart to remain untroubled, yet desires to embrace fasting and study the Dao, hoping for the ascent of a flying immortal—is this not pitiable? Is this not pitiable? Such a person will long dwell in hell, tread the Five Poisons, climb mountains of knives and forests of swords, endure boiling cauldrons and scorching flames, be steeped in searing torment, unable even to die. Hungry, they will eat iron; thirsty, they will drink fire. Emerging, they will face freezing ice, their flesh cut to the bone. Only then will they be handed over to the Three Officials, exiled to labor in mountains and seas, bearing loads of earth and stone, whipped and interrogated, enduring the Three Paths and Five Ways, traversing the Ten Sufferings and Eight Hardships—agonies beyond measure, inexpressible in full.\n\nThe Perfected of the Supreme Ultimate said: Such a person is not even equal to an ordinary scholar who practices benevolence and righteousness, reveres and trusts the Dao and virtue, and follows only what is good. Though subject to the transformations of time and change, they wander freely within the world, pure and at ease. When their lives end, they enter the abodes of blessings, avoiding imprisonment, and may become spirits. Reborn in the human realm, they do not lose their original vow, gradually deepen their roots of faith, form affinities with the worthy and sagely, and day by day shed their impurities, ultimately entering the immortal Dao.\n\nThe Perfected of the Supreme Ultimate said: The peril is that one attains the human Dao yet does not cultivate virtue and nurture nature to preserve life. The peril is hearing the scriptures yet not believing them. The peril is believing the scriptures yet coveting wealth and refusing them. The peril is receiving the scriptures yet not reciting and expounding them. The peril is reciting and expounding them yet not practicing their teachings. The peril is practicing their teachings yet not persevering in the Dao. The peril is serving a master yet not remaining devoted for life. The peril is taking medicines yet not attaining the proper cessation of breath. The peril is the Dao not being fully realized yet boasting of ascending and soaring. The peril is practicing silent fasting and reading scriptures yet dwelling in secluded mountains and being unable to endure the hardship. These ten perils reside within a person—if not guarded against, the body will find no remedy. Thus it is said: \"The great peril is that I have a body.\" This is what is meant—can one not reflect upon it? Can one not reflect upon it?\n\nWhen the Perfected of the Supreme Ultimate had finished transmitting the scriptures, expounding the Dharma, and teaching the precepts, he sang of the sufferings of the Three Paths and Five Ways, sighing these words:\n\nThe Three Powers and the myriad things,\nEach depend on their allotted span.\nBeginning and end await the kalpa’s reckoning,\nWhen blessings are exhausted, heaven and earth collapse.\nTraversing the Five Ways,\nHow bitter to die and be reborn again.\nRevolving through the Three Paths,\nComing and going with calamity.\nGreat worthies, heed these precepts,\nEndure your nature, relinquish your passions.\nFoolish men do not believe the Dharma,\nTheir sins and pains ever cling to them.\nI grieve that the world has no end,\nAnd so now I declare it anew:\nIf you wish to escape these perils,\nTake refuge in the scriptures of the Most High.\nSin and blessing do not come from another—\nTruly, they arise from your own body.\nThus the great worthy seals his lips,\nSeeking to sever all evil affinities.\nExtinguish thoughts, return to dual forgetting,\nAwait the long dissolution of interdependence.\nPropagate the Dao to pacify the world,\nAnd in the end, you will behold the True One.\nLust and jealousy are the roots of misfortune,\nThe greatest perils to life.\nTo harbor and nurture such types—\nI fear they will surely meet early ruin.\nKnowing evil yet not reforming—\nHow can this be the Dao’s peace?\nHolding poison while fasting upright,\nIt makes me sigh deeply.\nKarma from past lives is indeed real,\nYet the weak and short-lived call it nonexistent.\nAll desire to see it before their eyes,\nBut once it passes, they call it remote.\nGreat worthies, illumine the Dao’s teachings,\nGrieving for the stubborn and foolish.\nTenderly, I think of their suffering,\nDiligently, I cause myself sorrow.\nA person’s life is already spent,\nLike a flame in oil.\nThe Four Great are but a temporary meeting,\nThe Five Agents a provisional borrowing.\nIn the prime of life, study diligently,\nSeek to preserve what is yours.\nWhen blessings are exhausted, body and spirit scatter,\nAnd in darkness, descend to hell.\n\nThe highest sages, in awe of this, sought the Dao to transcend such calamity. The urgent path is to practice immortality and uphold the precepts to restrain the heart’s passions. In emptiness and purity, the upright qi resides, and immortals and sages naturally seek one another. If you do not believe these teachings, why dwell in the mountains and forests?\n\nGreat worthies delight in the scriptures and precepts, receiving them as treasures for the body. To pursue study is ever lamented as too late; to cultivate the self is ever regretted as too slow. By the time one unravels the profound and obscure, in a flash, the years have grown old. Clutching the scrolls to the end, one will only meet death with bitter sorrow.\n\nThus, in my youthful years, I abandoned the world to study the Dao. The Supreme Ultimate Perfected One said: \"When I once studied the Dao, I received it from the Supreme Lord of the Void and Sovereign. Practicing it with devotion, I became a Perfected One. If a Daoist wishes to receive my Great Precepts, the master should first read them once to reveal their essence. Only those who are truly students of immortality should come bearing sincerity to the master’s gate. After fasting and purifying for three days, contemplating the Dao and reflecting on the precepts, they may then be transmitted. These precepts are of utmost gravity—each is guarded by mighty spirit-deities. Be cautious, be cautious!\n\nThe Immortal Lord said: \"These Great Precepts are bestowed upon Daoist students of immortality. Diligently seek what is extraordinary in the world, for all things shall return to emptiness. All is Dharma, through which one may ascend beyond the sufferings of the Three Paths and attain the Dao. Those who encounter this are fulfilling their past vows. Receive it and follow it; do not fail to cultivate it diligently.\"\n\nOn the first day of the new year, the Immortal Lord received the precepts and composed this hymn:\n\nIn the secluded mountains, still and desolate,\nI gaze upon towering cliffs, steep and sheer.\nPristine snow veils the front courtyard,\nWhile fierce winds howl through the eastern grove.\nBefore the Heavenly Worthy, I linger in reverence,\nImmersed in the profound, my cares dissolve.\nPitying those who fall into sin,\nMy heart cannot shake this sorrow.\nTurning from scriptures and precepts to trust in demonic illusions,\nAbandoning fasting and stillness for the allure of wine and song—\nThey cycle through the Five Paths and Three Realms,\nPassing through the dark depths of hell.\nSuch suffering is beyond words,\nYet they endure death and rebirth, unable to bear it.\nOnly the Dao and virtue can save beings—\nWhy wait until distressed before seeking them?\n\nThe Immortal Lord addressed his disciple Zheng Siyuan: \"In my youth, I wandered through famous mountains, traversing perilous paths, living among birds and beasts. I endured every hardship, suppressed my desires, cast aside worldly thoughts, and practiced generosity with restraint. Later, I was reborn as a human, embraced the Dao, and brought peace to the world. I constantly cultivated compassion, cherished the Dao, and preserved truth, never daring to neglect it. After fasting and purifying for a year without completion, on the winter solstice, the Heavenly Perfected descended and bestowed upon me the Great Scripture and the Way of the Upper Immortals. The Heavenly Perfected commanded me to undertake a great fast in profound stillness, reciting and studying the scriptures in sequence. Thus, I became a Perfected One.\n\nThe scriptures and Dao I once received are treasured by the Supreme Lord, not the teachings of middling immortals. Through countless kalpas, they have been transmitted to Upper Immortals—Immortal Lords, Immortal Kings, and Immortal Ministers—not only to me. My past lives and yours shared this vow. By performing good deeds and accumulating merit without ceasing, we attained immortal names in the Dark Capital. Now, as teacher and friend, I transmit this to you.\n\nAfter I depart this world, there will be those who delight in the Dao, whose hearts are kind and compassionate, and who are born into my lineage. You must pass on all the teachings and practices I have imparted to them, for it is destined that these be recorded and transmitted through the ages. This is due to the karmic bonds and affinities we shared in past lives. Transmit one copy in accordance with the regulations to a worthy disciple. If no such person exists, seal one copy and entrust it to the Five Sacred Mountains.\n\nThese are the oral instructions of the Supreme Ultimate Perfected One. Keep them secret, be cautious, be ever cautious, and reflect on them always.\"\n\nHere ends the *Supreme Scripture of the Dao and Its Virtue: The Great Precepts of Original Vows and Wisdom, Upper Grade*.\n\nThe master of the Dao (Dunhuang manuscript: \"nun\"; likely altered by Buddhist followers) attains the Way of non-action (Dunhuang manuscript: \"attains the Way like the Buddha\"). Through tranquil observation (Dunhuang manuscript: \"tranquil temple\"), all enter the gateway of the Dao (Dunhuang manuscript: \"all ascend the high seat\"). Universally practicing (Dunhuang manuscript: \"universally seeing\"; closer to the original), they follow the lineage of their masters (Dunhuang manuscript: \"Confucian lineage\"). Not committing transgressions from beginning to end, they ultimately attain freedom from error (Dunhuang manuscript: \"not initiating transgressions, ultimately entering non-action\"). As for hunting and fishing (Dunhuang manuscript: \"fishing and hunting\"), those who attain birth (Dunhuang manuscript: \"guest kings\"; closer to the original) in border regions (Dunhuang manuscript: \"borderlands\") study fame (Dunhuang manuscript: \"flourishing command\"). Receiving this fragrant admonition (Dunhuang manuscript: \"receiving this fragrant and flourishing form\"), they praise the Dao (Dunhuang manuscript: \"revere and speak of it\"). Their (Dunhuang manuscript: \"their time\"; closer to the original) connection (Dunhuang manuscript: \"opening\"; closer to the original) to the teachings is such that they follow and attend (Dunhuang manuscript: \"follow and transmit\") with constant mindfulness and recitation (Dunhuang manuscript: \"constant mindfulness, fasting, laughter, and recitation\").\n\nWhen first entering the gateway of the Dao (Dunhuang manuscript: \"wondrously entering the gateway of the Way\"), they cultivate tranquility (Dunhuang manuscript: \"tranquil temple\"). Forsaking worldly attachments (Dunhuang manuscript: \"worldly adornments\"), they turn the Wheel of the Dao (Dunhuang manuscript: \"turning wheel\"). With it (Dunhuang manuscript: \"and\"; emended from \"and\" to \"with\" per the Dunhuang manuscript), they harmonize (Dunhuang manuscript: \"cooperate\") the turning wheel (Dunhuang manuscript omits the interpolated \"birth\" character). Thus, they attain boundless (Dunhuang manuscript: \"boundless\"; emended from \"innumerable\" to \"boundless\") blessings. Always (Dunhuang manuscript: \"once\") responding fully (Dunhuang manuscript: \"speaking fully\"), they address the customs of their time, whether male or female (Dunhuang manuscript: \"the men of their clans\"; \"clan\" is likely the correct reading over \"customs\"). They uphold the scriptures (the character \"scripture\" is supplied from the Dunhuang manuscript) and avoid lavish burials (Dunhuang manuscript: \"lavish burials\"; emended from \"funeral burials\"). They recognize the difficulty of liberation (Dunhuang manuscript: \"difficulty of explanation\") and do not refuse (Dunhuang manuscript: \"do not yield\").\n\nThe text omits the characters \"Supreme Ultimate\" (per the Dunhuang manuscript). With it (the character \"with\" is supplied from the Dunhuang manuscript), one may sever yet cannot be severed, study yet cannot be studied. The Three Palaces are purified (Dunhuang manuscript: \"The Three Offices are harmonized\"; closer to the original). The Heavenly Worthy addresses (the Dunhuang manuscript omits \"the Heavenly Worthy addresses the Supreme Ultimate\"). Ordinary people (Dunhuang manuscript: \"ordinary worthies\") practice benevolence and righteousness (Dunhuang manuscript: \"the human Way\"). The Dao and its virtue (Dunhuang manuscript: \"the Dao and the scriptures\"; closer to the original) are thus (the character \"thus\" is supplied from the Dunhuang manuscript). For I possess a body (Dunhuang manuscript: \"and my body\"), they harm (Dunhuang manuscript: \"harm\") me. Then (emended from \"and\" to \"then\" per the Dunhuang manuscript), demonic forces (emended from \"demonic forces\" per the Dunhuang manuscript) arise. How (the interpolated character \"more\" is deleted per the Dunhuang manuscript) could this not be so?",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上洞玄灵宝智慧本愿大戒上品经 经名：太上洞玄灵宝智意本愿大戒上品经。 又名：《太上消魔保身安志智慧本愿大戒上品经》。 撰人不详，约出於东晋。 系古《灵宝经》之一。 一卷。 底本出处：《正统道藏》洞玄部本文类。 参校本：敦煌P.2468、 S.6394、P.2400 号抄本。 太上洞玄灵宝智慧本愿大戒上品经#1 太极仙公请问太极法师 仙公於天台山静斋念道，稽首礼拜，请问灵宝玄师太极太虚真人#2 曰：弟子有幸，得侍对天尊，自以微言，弥纶万劫，洞观道源，过泰之欢，莫有谕也。 顾玄少好神仙白日飞腾之道，心想上圣，恒以仿佛，大经微远，妙赜难通，将禀口诀，释我冥津，洞畅虚漠，有无都尽矣。 近而未究人生宿世因缘本行之由，今愿天尊觉所未悟。 是时太上高玄真人啸咏步虚洞章，欢然容豫#3，耀金颜而含笑言曰：此子累劫念道，致太极玉名，寄慧人中，将独步玉京，超逸三界，巍巍乎太上仙公之任矣。 故慈心於天人，念度於后学也。 常以外身而济物，有德而弗名，玄都所铨，谅不虚矣。 而谓太极真人曰：卿受太上虚皇道君之命，为其师保，亦必尽教以高上大洞之渊赜也，岂俟彼多陈乎。 吾受任忝为都教之法师耳#4，至於执卷由子矣。 太极真人答曰：此童真之人，名刊金简，才质清远，景秀太上，玄微洞虚，故当为仙公之任，弘道大度者也。 吾忝受教化，愧#5不足为彼宗匠，太上有命。 何敢不倾韫#6哉。",
      "translated_text": "*The Supreme Cavern Mystery Numinous Treasure Sutra of the Wisdom and Original Vows of the Precepts, Upper Grade*\n\n**Sutra Title:** *The Supreme Cavern Mystery Numinous Treasure Sutra of the Wisdom and Original Vows of the Precepts, Upper Grade*. Also known as: *The Supreme Sutra of the Wisdom and Original Vows of the Precepts for Dispelling Demons, Preserving the Body, and Settling the Mind, Upper Grade*.\n\nComposed by an unknown author, approximately dating to the Eastern Jin dynasty. One of the ancient *Numinous Treasure Scriptures*. One scroll.\n\n**Base Text:** *Daoist Canon of the Zhengtong Era*, Cavern Mystery Section, Textual Category.\n**Collated with:** Dunhuang manuscripts P.2468, S.6394, and P.2400.\n\n---\n\n### *The Supreme Cavern Mystery Numinous Treasure Sutra of the Wisdom and Original Vows of the Precepts, Upper Grade*\n\n**1.**\nThe Celestial Pole Immortal Duke respectfully inquired of the Celestial Pole Dharma Master.\n\nWhile the Immortal Duke was in quiet retreat on Mount Tiantai, reverently cultivating the Dao, he bowed in worship and addressed the Numinous Treasure Mystic Master, the Celestial Pole Supreme Void Perfected One:\n\n**2.**\n\"As your disciple, I am fortunate to attend in the presence of the Heavenly Worthy. My humble words, though slight, encompass the myriad kalpas; gazing deeply into the source of the Dao, my joy surpasses all measure. Yet, from my youth, I have been fond of the Way of divine transcendents and the path of ascending in broad daylight. My thoughts ever aspire to the sagely realms, though I have only glimpsed them faintly. The great scriptures are profound and distant, their subtleties difficult to fathom. I now seek oral instructions to dispel the darkness of my ignorance, to thoroughly illuminate the void and the obscure, where being and non-being are wholly exhausted.\n\nRecently, I have yet to fully comprehend the causes and conditions of past lives and the origins of human existence. Today, I beseech the Heavenly Worthy to enlighten what I have not yet awakened to.\"\n\nAt that moment, the Supreme Cavern Perfected One chanted and intoned the *Cavern Hymns of the Void*, his countenance radiant with joy.\n\n**3.**\nWith a golden glow upon his face and a smile, he spoke: \"This one has cultivated the Dao across countless kalpas, attaining the jade name of the Celestial Pole. Dwelling among the wise, he shall stride alone through the Jade Capital, transcending the Three Realms—how majestic is the task of the Supreme Immortal Duke! Thus, his compassion extends to gods and humans, and his thoughts turn to guiding later learners. He constantly saves beings by relinquishing his own form, possessing virtue yet remaining unnamed. The assessments of the Mystic Metropolis are surely not in vain.\n\nHe then addressed the Celestial Pole Perfected One: 'You have received the command of the Supreme Void Sovereign Dao Lord to serve as his master and protector. You must fully instruct him in the profound mysteries of the Supreme Great Cavern—why wait for him to ask repeatedly? I, unworthy, am merely the Dharma Master of the Teaching Assembly. As for holding the scroll, that is your duty.'\"\n\n**4.**\nThe Celestial Pole Perfected One replied: \"This youth of pure integrity has a name inscribed on the golden tablets. His nature is pure and transcendent, his brilliance surpassing the Supreme. Profound and subtle, he penetrates the void—thus, he is destined for the role of Immortal Duke, a great vessel for propagating the Dao. Though I, unworthy, have received the charge of instruction, I am ashamed to be inadequate as his master. Yet, the Supreme One has issued a command—how dare I not pour forth all that I contain?\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 577,
      "start_sentence": 0,
      "end_sentence": 20,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.4711012840271,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝智慧本愿大戒上品经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "众妙之统，仰赖於法师矣。 太极真人曰：夫道，无也。 弥络无穷，子欲寻之，近在我身，乃复有也。 因有以入无，积念以得妙。 万物芸芸，譬於幻耳，皆当归空。 人身亦然，身死神逝。 喻#7之如屋，屋坏则人不立，身败则神弗居，当制念以定志，静身以安神，宝炁以存精，思虑兼忘，冥想内视，则身神并一。 身神并一，近为真身也。 此实由宿世本行，积念累感，功济一切，德荫万物，因缘轮转，罪福相对，生死相灭，贵贱相使，贤愚相倾，贫富相欺，善恶相显，其苦无量，皆人行愿所得也。 非道非天，非地非人，非万物所为矣，正由心耳。 此对既锺，亦难脱也。 弱丧之徒，信道者少，宿命者多，不积善定念，修德其身，而欲忽德忘身，强求外物，其可得哉，既已不克，莫不伤身矣。 故有道之士，取诸我身，无求乎人，经云#8：修之身，其德乃真，斯之谓也。 夫学道，不受大智慧道行本愿上品大戒，无缘上仙也。 子有宿命，是以见此经。 其文隐秘，立信效心，然后而传，不可妄示不信。 既其不信，必发异念，异念既生，彼此获罪，是故藏之於无，待有应为仙王者乃告焉。 是时云龙踊跃，诸天散华，飞香奏烟，山海静波，触类窜默，鬼魅#9消亡，神魔降伏，五苦咸解，长离地狱，恶者反善，信顺受福。 尔乃命太极侍经，仙人刘文静披云报而授经也。 智慧本愿大戒上品 太极真人曰：宿世礼奉经师，口诵身行，布施厄困，愿乐三宝，君亲忠孝，远慕山水，栖憩贤儒，虚心有道，烧香散华，护度一切，修德补过，信顺宿命，静思忍情，其行也，上可升仙度世，下可轮转富贵，生为人尊，容貌伟秀，才智清远，为人之道，莫不具足。 夫居世富贵，笑於贫贱，今报以贫贱； 居世好杀，今报以夭伤；",
      "translated_text": "The governance of all mysteries depends upon you, Dharma Master.\"\n\nThe Celestial Pole Perfected One said: \"The Dao is Non-Being. Pervading the boundless, if you seek it, it lies near within yourself—yet it is also Being. Through Being one enters Non-Being; through accumulated contemplation one attains the wondrous. The myriad things teem like illusions, all destined to return to emptiness. The human body is no different: when the body dies, the spirit departs. It may be likened to a house—when the house collapses, the person cannot stand; when the body decays, the spirit cannot dwell. Thus, one must restrain thoughts to stabilize the will, quiet the body to settle the spirit, treasure qi to preserve essence, and forget both reflection and care. Inwardly meditate and visualize, and body and spirit will unite as one. When body and spirit unite, one approaches the true body. This truly arises from the fundamental conduct of past lives, from accumulated contemplation and repeated resonance, from merit that aids all beings and virtue that shades the myriad things. Through the turning of karmic conditions, sin and blessing stand in opposition, life and death alternate, noble and base employ one another, worthy and foolish vie, poor and rich deceive, good and evil manifest—their suffering is measureless, all earned by the vows and deeds of human beings. It is neither the Dao nor Heaven, neither Earth nor man, nor the work of the myriad things, but precisely the heart. Once this duality is fixed, it is difficult to escape. Among the weak and lost, few believe in the Dao, many cling to past lives. Without accumulating goodness and stabilizing contemplation, without cultivating virtue in one’s person, yet desiring to neglect virtue and forget the self, forcibly seeking external things—how can this be attained? Having already failed, none avoid harm to the body. Therefore, the man of Dao draws from his own person and seeks nothing from others. As the scripture says: 'Cultivate it in the self, and one’s virtue becomes true.' This is what it means.\n\nTo study the Dao without receiving the Great Wisdom, the Fundamental Vows, and the Upper Grade Precepts of the Dao Conduct, one has no means to ascend as an immortal. You possess past-life karmic affinity, which is why you behold this scripture. Its text is recondite; first establish faith and verify the heart, then transmit it. It must not be rashly shown to the faithless. If they do not believe, they will surely entertain heterodox thoughts. Once heterodox thoughts arise, both parties incur transgression. Therefore, conceal it in the realm of Non-Being and await one destined to become an Immortal King before revealing it.\"\n\nAt that moment, clouds and dragons leapt and danced, the various heavens scattered blossoms, flying incense and curling smoke arose, mountains and seas stilled their waves, all things fell silent, ghosts and demons vanished, divine and demonic forces submitted, the Five Sufferings were wholly resolved, those long bound in hell were released, the wicked turned to goodness, and the faithful and obedient received blessings. Then the Celestial Pole Perfected One commanded the scripture-attendant, the immortal Liu Wenjing, to part the clouds and report before bestowing the scripture.\n\n**The Upper Grade Precepts of the Fundamental Vows of Great Wisdom**\nThe Celestial Pole Perfected One said: \"In past lives, one reverently served scripture masters, recited with the mouth and practiced with the body, gave alms to those in distress, took joy in the Three Treasures, was loyal to lord and filial to parents, longed for mountains and rivers, dwelt among worthy scholars, maintained an empty mind and embraced the Dao, burned incense and scattered blossoms, protected and delivered all beings, cultivated virtue and amended faults, believed in and submitted to past-life karma, stilled thoughts and restrained emotions. In such conduct, above one may ascend as an immortal and deliver the world; below one may revolve through cycles of wealth and nobility, be born as a person of honor, with a majestic and handsome appearance, pure and transcendent talent and wisdom. In the Way of being human, nothing is lacking.\n\nThose who, dwelling in wealth and nobility, scorn the poor and lowly will in this life be repaid with poverty and lowliness. Those who delight in killing in this life will be repaid with early death and injury...\"",
      "overlap_context": "fected One replied: \"This youth of pure integrity has a name inscribed on the golden tablets. His nature is pure and transcendent, his brilliance surpassing the Supreme. Profound and subtle, he penetrates the void—thus, he is destined for the role of Immortal Duke, a great vessel for propagating the Dao. Though I, unworthy, have received the charge of instruction, I am ashamed to be inadequate as his master. Yet, the Supreme One has issued a command—how dare I not pour forth all that I contain?\"",
      "start_char": 577,
      "end_char": 1253,
      "start_sentence": 21,
      "end_sentence": 43,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.419047832489014,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝智慧本愿大戒上品经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "居世绝秀#10笑於丑陋，今报以丑陋； 居世聪明，不教於人，今报以顽塞； 居世常康，笑於困病，今报以滞疾； 居世不信道，笑於经教，今报以下愚，长与道隔； 居世夺人夫婿，今报以少寡； 居世诱人妇女，今报以鳏独； 居世发心为夫妻，而后不得俱生人道，死为下鬼，今#11报以本念，成於邪病也。 自非大法，莫有解其宿缠而消此邪病矣。 夫为父母、兄弟、姊妹、夫妻、君臣、师保、朋友，皆前世#12所念，愿为因缘，展转#13相生也，莫不有对者哉，故曰倚伏难穷矣。 唯学仙道士，当兼忘因缘，绝灭生死，同归乎玄，以入妙门。 能如是者，始可与言学道之夫也。 若见居家妻子，当愿一切早出爱狱，摄意奉戒； 若见饮酒，当愿一切制於命门，以远祸乱； 若见采女，当愿一切守清忍志，慕在贤贞#14，若见淫人，当愿一切除弃邪念，翘心禁戒； 若见妇人，当愿一切忍割浮华，乐道自娱； 若见真人，当愿一切履信正化，日入法门； 若见众人，当愿一切推仁无争，怀道安世； 若见善人，当愿一切时刻存念，仰轨其道； 若见恶人，当愿一切弃凶即吉，不犯王法； 若见贫人，当愿一切损身施惠，后受大福； 若见富人，当愿一切救济万物，世世受禄； 若见贵人，当愿一切承其教旨，悉合#15典训； 若见贱人，当愿一切勤修匪懈，各得所为； 若见帝王，当愿一切奉仰王道，孝如父母； 若见宰相，当愿一切受其教制，四方归仁； 若见兵甲，当愿一切各念仁心，天下让贤； 若见王子，当愿一切日歌太平，系国承家； 若见贤人，当愿一切履行其德，道为世宗； 若见法师#16，当愿一切明解法度，得道无为#17； 若见栖山道士，当愿一切悉见法门，速得升仙； 若见教化，当愿一切亲受圣教，皆为渊博； 若见圣人，当愿一切尊礼侍见，诸国并瞻； 若见仙人，当愿一切真道悉成，飞升天堂； 若见城郭，当愿一切严整修饰，以道为基； 若见大国，当愿一切归崇慕德，若水注海； 若见小国，当愿一切知止虚冲，安其所居； 若见市朝，当愿一切裙贤云萃，悉弘正道； 若见静观#18当愿一切功德巍巍，天人得志； 若见斋戒行香，当愿一切道德日新，庠序雅正； 若见诵经，当愿一切尽入法门#19咸闻妙旨； 若见经教，当愿一切各各受读礼习，普行#20教化； 若见楼观，当愿一切洞观十方，无所亿藏； 若见高山，当愿一切立德如彼，无复退转； 若见大海，当愿一切智思无量，辅成家国； 若见栖憩茂林，当愿一切安居自在，荫庇含识； 若见好学，当愿一切得成师宗#21养徒敷教； 若见净手，当愿一切常执经书，无时暂辍； 若见善口，当愿一切耽咏洞经，日新不厌； 若见动足，当愿一切超步三界，飞行上清； 若见静止，当愿一切灭景停真，安闲空寂； 若见饮食，当愿一切弃累入净，存得道味； 若见大藏，当愿一切除其灾害，施为福田； 若见疾病，当愿一切以道自安，免此苦厄； 若见死丧，当愿一切学道常存，济度三涂； 若见畋猎，当愿一切不为始终，免无间罪#22； 若见夷狄，当愿一切得生#23中国，不生边境； 若见少年，当愿一切及时学问，遂成学名#24； 若见老病，当愿一切以道摄生，不更衰耄；",
      "translated_text": "Those who, dwelling in the world, mock the plain and homely will in this life be repaid with plainness and homeliness. Those who, dwelling in the world with keen intelligence, do not teach others will in this life be repaid with dullness and obstruction. Those who, dwelling in the world in constant health, mock the afflicted and sick will in this life be repaid with chronic illness. Those who, dwelling in the world, do not believe in the Dao and mock the scriptures and teachings will in this life be repaid with utter foolishness, forever cut off from the Dao.\n\nThose who, dwelling in the world, steal another’s husband will in this life be repaid with early widowhood. Those who, dwelling in the world, seduce another’s wife will in this life be repaid with lifelong solitude. Those who, dwelling in the world, pledge to be husband and wife but later fail to be reborn together in the human realm, dying as lowly ghosts, will in this life be repaid according to their original vow, suffering from perverse illnesses. Without the great Dharma, none can untangle their karmic bonds or dispel these perverse illnesses.\n\nAs for fathers and mothers, brothers and sisters, husbands and wives, rulers and ministers, teachers and guardians, friends—all are bound by past-life vows, wishing to become karmic conditions, revolving through cycles of rebirth. None are without their counterparts, hence it is said that fortune and misfortune are unfathomable.\n\nOnly the scholar of the immortal Dao should forget karmic conditions, sever the bonds of life and death, and merge into the mysterious, entering the wondrous gate. Those who can do this are fit to be called students of the Dao.\n\nWhen seeing a household with wife and children, one should wish for all to swiftly escape the prison of love, restrain the mind, and uphold the precepts. When seeing someone drinking wine, one should wish for all to restrain themselves at the Gate of Life, avoiding calamity and chaos. When seeing palace women, one should wish for all to guard purity, endure with resolve, and aspire to virtue and chastity. When seeing the licentious, one should wish for all to cast aside impure thoughts and turn their minds toward restraint. When seeing women, one should wish for all to endure the severing of frivolity and delight in the Dao for self-joy. When seeing a perfected person, one should wish for all to tread the path of faith and right transformation, daily entering the Dharma gate. When seeing the multitude, one should wish for all to extend benevolence without contention, embracing the Dao and bringing peace to the world.\n\nWhen seeing the good, one should wish for all to constantly hold them in mind, emulating their Way. When seeing the wicked, one should wish for all to abandon evil and turn toward good, avoiding transgressions against the king’s law. When seeing the poor, one should wish for all to diminish the self and bestow kindness, later receiving great fortune. When seeing the rich, one should wish for all to aid and relieve all beings, receiving blessings for generations. When seeing the noble, one should wish for all to follow their teachings, fully aligning with classical precepts. When seeing the lowly, one should wish for all to diligently cultivate without slack, each attaining their aspirations.\n\nWhen seeing the emperor, one should wish for all to revere and uphold the kingly Dao, honoring him as father and mother. When seeing the prime minister, one should wish for all to receive his teachings and governance, with the four directions turning toward benevolence. When seeing soldiers and armor, one should wish for all to harbor thoughts of benevolence, with the world yielding to the worthy. When seeing the prince, one should wish for all to daily sing of great peace, upholding the state and continuing the family line.\n\nWhen seeing the worthy, one should wish for all to practice their virtue, with the Dao revered as the world’s model. When seeing a Dharma master, one should wish for all to clearly understand the Dharma and its measures, attaining the Dao and non-action. When seeing a mountain-dwelling Daoist, one should wish for all to fully perceive the Dharma gate, swiftly ascending as immortals. When seeing education and transformation, one should wish for all to personally receive the sagely teachings, becoming vast and erudite.\n\nWhen seeing a sage, one should wish for all to honor and serve them, with all nations gazing in reverence. When seeing an immortal, one should wish for all to perfect the true Dao, ascending to the heavenly halls. When seeing city walls, one should wish for all to be strictly ordered and adorned, with the Dao as their foundation. When seeing a great nation, one should wish for all to revere and admire virtue, like rivers flowing to the sea. When seeing a small nation, one should wish for all to know restraint, embrace emptiness, and be content in their place.\n\nWhen seeing the marketplace, one should wish for all to gather like clouds around the worthy, widely propagating the right Dao. When seeing a quiet abode, one should wish for all to accumulate towering merit, with heaven and humans attaining their aspirations. When seeing fasting, precepts, and incense offerings, one should wish for all to daily renew their virtue and morality, with schools and teachings refined and proper.\n\nWhen seeing scripture recitation, one should wish for all to fully enter the Dharma gate, hearing the wondrous teachings. When seeing scriptural teachings, one should wish for all to individually receive, read, and practice them, universally spreading transformation. When seeing towers and observatories, one should wish for all to penetrate and observe the ten directions, with nothing hidden or concealed. When seeing high mountains, one should wish for all to establish virtue like them, never regressing.\n\nWhen seeing the great sea, one should wish for all to possess boundless wisdom and thought, aiding in the completion of family and state. When seeing a flourishing forest for dwelling, one should wish for all to reside in peace and ease, sheltering all beings. When seeing diligent study, one should wish for all to become masters and teachers, nurturing disciples and spreading teachings.\n\nWhen seeing clean hands, one should wish for all to constantly hold scriptures, never ceasing even for a moment. When seeing eloquent speech, one should wish for all to delight in chanting the profound scriptures, daily renewed without weariness. When seeing moving feet, one should wish for all to transcend the Three Realms, flying to the Upper Clarity. When seeing stillness, one should wish for all to extinguish illusions and halt the true, abiding in tranquil emptiness.\n\nWhen seeing food and drink, one should wish for all to cast off burdens and enter purity, preserving the flavor of the Dao. When seeing great storehouses, one should wish for all to eliminate disasters and calamities, becoming fields of fortune. When seeing illness, one should wish for all to rely on the Dao for peace, avoiding this suffering and distress. When seeing death and mourning, one should wish for all to study the Dao and abide forever, delivering beings from the Three Wretched Realms.\n\nWhen seeing hunting, one should wish for all to refrain from beginning or ending it, avoiding the sin of uninterrupted suffering. When seeing barbarians, one should wish for all to be born in the Central Kingdom, not in the borderlands. When seeing the young, one should wish for all to study in a timely manner, achieving scholarly renown. When seeing the aged and infirm, one should wish for all to nurture life with the Dao, avoiding further decline and decrepitude.",
      "overlap_context": "nduct, above one may ascend as an immortal and deliver the world; below one may revolve through cycles of wealth and nobility, be born as a person of honor, with a majestic and handsome appearance, pure and transcendent talent and wisdom. In the Way of being human, nothing is lacking.\n\nThose who, dwelling in wealth and nobility, scorn the poor and lowly will in this life be repaid with poverty and lowliness. Those who delight in killing in this life will be repaid with early death and injury...\"",
      "start_char": 1253,
      "end_char": 2464,
      "start_sentence": 44,
      "end_sentence": 101,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.140558004379272,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝智慧本愿大戒上品经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "若见三光，当愿一切普明灵曜，暗冥即消； 若见云雨，当愿一切惠泽盈溢，无所不宜； 若见素雪，当愿一切常居洁白，逍遥自在； 若见灵风，当愿一切韫怀披散，德流遐迩； 若见净水，当愿一切洗垢清虚，平等其心； 若见名香，当愿一切受兹芳净#25，众秽萧然； 若见好华，当愿一切乐敬诸圣，相好具足； 若见车马，当愿一切得道无为，乘凤驾龙； 若见弦歌，当愿一切骯经叹法#26，以道娱乐； 若见福食，当愿一切无不饱满，世享天厨，德流生人，如水归海，宗庙胤长，常居贵盛，世与四辈，俱生王家； 若见散施，当愿一切祸灭九阴，福起十方，德如山海，莫不兴隆，七祖生天，子孙贤忠，富贵巍巍，所欲皆从，学道飞仙，驾云乘龙。 道士坐卧，常愿我等，四大合德，同体道真，长存玄都，师友自然，济度十方，天下受恩，逍遥无为，洞观妙门。 礼经祝三首 真人口诀云； 侍经仙童玉女闻此祝，皆欢悦而佑兆身也，是大经悉用此祝而礼拜矣。 若冥心礼经者，亦心祝其文，乃上仙之秘祝也。 乐法以为妻，爱经如珠玉。 持戒制六情，念道遣所欲。 淡泊正气停，萧然神静默。 天魔并敬护，世世受大福。 郁郁家国盛，济济经道兴。 天人同其#27愿，缥缈入大乘。 因心立福田，靡靡法轮升。 七祖生天堂，我身白日腾。 大道洞玄虚，有念无不契#28。 炼质入仙真，遂成金刚体。 超度三界难，地狱五苦解。 悉归太上经，静念稽首礼。 此戒名智慧隐经道行本愿上戒宝真品，太上虚皇传太上大道君，道君传太微帝君，帝君传九微太真，太真传太极大法师，及传太极高仙王公，不告诸中仙矣。 千年三传，若无太上金简仙名者，亦终不与此经戒相遇也。 道士运会，脱有得之，当秘而奉焉。 太上仙童十人随侍#29视戒，营护弟子之身。 时有贤儒、信道男女，兆不得闭绝於圣文矣，若本命、甲子、庚申、八节日，斋而诵一徧也。 太极真人曰：学升仙之道，当立千二百善功，终不受报，立功三千，白日登天，皆济人应死之难也，施惠其人尤善矣。 学道当令众行合法，广建福田，发大慈之心，动静常起道意，能如是也，吐纳服药，佩符，读经，精思，终身不倦者，岂有不得仙乎。 人无此德，服药佩符，读经斋戒，故终命而不验矣，学士明思要言。 太极真人曰：立三百善功，可得长存地仙，若一功不全，则更从一始，而都失前功矣。 常有其念在於心膂者，则是也。 子导人作善，即为善功矣。 太极真人曰：常念啸咏#30，经行大慈，先人后身，扬善化恶，断绝众缘，灭念守虚，心如太玄，唯道是求，始谓能言神仙之道也。 太极真人曰：吾昔受太极智慧十善劝助功德戒於高上大道虚皇，世世宗奉，修行大法，度人甚易，此自然之福田也。 太上以普教天人，今各得本愿，始入法门#31，长存无为，不更十苦八难，罪对罢散，地狱休息，三官宁闲，世世荣乐，咸脱罗网，后生安泰，天性恬然，所愿随行，其戒如上，以传贤信。 十善劝戒曰：劝助礼敬三宝，养法师，令人世为君子，贤孝高才，贵巍巍，生为人尊，门族昌炽。 三宝者，谓道经师也。 能养生教善，行为人范，是名法师也。 戒曰：劝助治写经书，令人世世聪明，博闻妙迹，恒值圣世，见诸经教，能诵章句。",
      "translated_text": "When seeing the Three Luminaries, one should wish for all to universally radiate numinous brilliance, dispelling darkness and gloom. When seeing clouds and rain, one should wish for all to overflow with beneficent moisture, suiting every need. When seeing pristine snow, one should wish for all to dwell perpetually in purity, carefree and at ease. When seeing the numinous wind, one should wish for all to unfold their hidden virtues and scatter them afar, their power flowing near and far. When seeing pure water, one should wish for all to wash away filth and attain clarity, their minds made equal. When seeing fine incense, one should wish for all to receive this fragrance and purity, all defilements vanishing. When seeing lovely flowers, one should wish for all to delight in revering the sages, their marks of excellence complete. When seeing carriages and horses, one should wish for all to attain the Dao and abide in non-action, riding phoenixes and driving dragons. When seeing music and song, one should wish for all to chant scriptures and praise the Dharma, finding joy in the Dao. When seeing blessed food, one should wish for all to be ever sated, enjoying the celestial kitchens of the world, their virtue flowing to all beings as water returns to the sea, their ancestral temples enduring, their descendants noble and long-lived, ever dwelling in honor and prosperity, and in every generation, together with the Four Assemblies, to be born into royal houses.\n\nWhen seeing alms given freely, one should wish for all to have their misfortunes extinguished in the Nine Yin, their blessings arising in the Ten Directions, their virtue vast as mountains and seas, all flourishing without fail, their seven ancestors reborn in heaven, their descendants wise and loyal, their wealth and nobility towering, all desires fulfilled, studying the Dao to become flying immortals, riding clouds and driving dragons.\n\nDaoists, whether sitting or lying down, should constantly wish for us all: that the Four Great Elements unite in virtue, our bodies in harmony with the true Dao, eternally dwelling in the Mysterious Capital, our masters and companions natural, delivering the Ten Directions, the world receiving grace, carefree in non-action, penetrating the wondrous gate.\n\n**Three Invocations for Scriptural Homage**\n\nThe True One’s oral instructions state: When jade lads and maidens attendant upon the scriptures hear this invocation, they rejoice and protect the practitioner’s body. All great scriptures employ this invocation in their rites of homage.\n\nThose who reverently perform scriptural homage in meditative stillness should silently recite its words—this is the secret invocation of the highest immortals:\n\n*\"Delight in the Dharma as one’s spouse,\nCherish the scriptures as pearls and jade.\nUphold the precepts to restrain the six senses,\nContemplate the Dao to dispel desires.\nSerene and unperturbed, the upright qi abides,\nDetached and tranquil, the spirit still and silent.\nHeavenly demons all revere and guard,\nLifetimes of great blessings received.\nFlourishing are family and state,\nThriving the scriptures and the Dao.\nHeaven and humanity share this vow,\nEthereally entering the Great Vehicle.\nEstablishing fields of blessing in the heart,\nThe Dharma wheel ascends in boundless ascent.\nSeven ancestors reborn in celestial halls,\nMy body ascends at midday.\nThe Great Dao pervades the Mysterious Void,\nWith mindfulness, all is perfectly aligned.\nRefining the body to join the immortals,\nAttaining the vajra body.\nTranscending the Three Realms’ trials,\nThe Five Sufferings of hell dissolved.\nAll return to the Most High’s scriptures,\nIn still contemplation, bowing in homage.\"*\n\nThis invocation is titled *\"The Hidden Scripture of Wisdom and Daoist Conduct: The Original Vow of the Precious Precepts of the Uppermost Precepts\"*—transmitted by the Most High August Sovereign of the Void to the Most High Lord of the Great Dao, the Lord of the Great Dao to the Lord of the Grand Tenuity, the Lord of the Grand Tenuity to the Ninefold Radiance of the Grand Realized Ones, the Grand Realized Ones to the Great Dharma Master of the Grand Ultimate, and thence to the High Immortal Duke Wang of the Grand Ultimate, never disclosed to the median immortals. After a thousand years and three transmissions, even those without their names inscribed on the Most High’s golden tablets shall never encounter these scriptural precepts. Daoists, should the time come when they receive them, must guard and uphold them in secrecy.\n\nTen jade lads attend the Most High, overseeing and protecting the disciples’ bodies. At times, worthy scholars and faithful men and women may not be entirely cut off from the sacred texts. On their natal days, the first day of the sexagenary cycle, the *gengshen* days, and the eight seasonal nodes, they should fast and recite the scripture once through.\n\nThe Perfected One of the Grand Ultimate said: *\"To study the Dao of ascending as an immortal, one must establish one thousand two hundred acts of goodness, never receiving retribution. To establish three thousand acts of merit is to ascend to heaven in broad daylight—all such acts rescue people from mortal peril, and bestowing kindness upon them is especially virtuous. In studying the Dao, one should ensure that all conduct accords with the Dharma, broadly establishing fields of blessing, arousing the mind of great compassion, and constantly awakening the intention of the Dao in movement and stillness. Those who can do this—practicing breath refinement, consuming elixirs, wearing talismans, reciting scriptures, and cultivating focused contemplation without weariness—how could they fail to attain immortality? Those lacking such virtue, though they consume elixirs, wear talismans, recite scriptures, and observe fasts, will still meet their end without verification. Disciples, ponder these essential words.\"*\n\nThe Perfected One of the Grand Ultimate said: *\"Establishing three hundred acts of goodness can secure long life as an earthbound immortal. If even one act is incomplete, one must begin anew, and all prior merits are lost. Only those whose thoughts constantly dwell in the heart-mind achieve this. Guiding others to do good is itself an act of goodness.\"*\n\nThe Perfected One of the Grand Ultimate said: *\"Constantly chanting and reciting, walking while practicing great compassion, putting others before oneself, extolling goodness and transforming evil, severing all karmic ties, extinguishing thoughts and guarding emptiness, the heart like the Grand Mystery, seeking only the Dao—only then can one be said to speak of the divine immortals’ path.\"*\n\nThe Perfected One of the Grand Ultimate said: *\"I formerly received the Ten Wholesome Exhortations and Merit-Assisting Precepts of the Grand Ultimate’s Wisdom from the Highest August Sovereign of the Void. In every lifetime, I have revered and practiced the great Dharma, making the deliverance of beings effortless—this is the natural field of blessing. The Most High, in universally teaching heaven and humanity, now grants each their original vow, enabling entry into the Dharma gate, eternal abiding in non-action, no longer subject to the Ten Sufferings and Eight Difficulties, the dissolution of karmic retribution, the cessation of hells, the Three Officials at peace, lifetimes of honor and joy, all freed from the net of entanglements, future lives secure and tranquil, the heavenly nature serene, and all wishes fulfilled. The precepts are as above, transmitted to the worthy and faithful.\"*\n\n**The Ten Wholesome Exhortations state:**\n1. Exhort and assist in revering the Three Treasures, supporting Dharma masters, so that in the world one becomes a noble person, virtuous, filial, and highly talented, honored and towering, respected by all, with flourishing family and clan.\n   - The Three Treasures are the Dao, the scriptures, and the masters. Those who nurture life, teach goodness, and serve as models for others are called Dharma masters.\n2. Exhort and assist in copying scriptures, so that in the world one becomes wise, widely learned in wondrous traces, constantly encountering sagely eras, seeing all scriptural teachings, and able to recite their passages.",
      "overlap_context": "om the Three Wretched Realms.\n\nWhen seeing hunting, one should wish for all to refrain from beginning or ending it, avoiding the sin of uninterrupted suffering. When seeing barbarians, one should wish for all to be born in the Central Kingdom, not in the borderlands. When seeing the young, one should wish for all to study in a timely manner, achieving scholarly renown. When seeing the aged and infirm, one should wish for all to nurture life with the Dao, avoiding further decline and decrepitude.",
      "start_char": 2464,
      "end_char": 3730,
      "start_sentence": 102,
      "end_sentence": 147,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.31013631820679,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝智慧本愿大戒上品经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "戒曰：劝助建斋静治#32，令人世世门户高贵，身登天堂，饮食自然，常居无为。 戒曰：劝助香油以济众乏，令人世世芳盛，香洁光明，容眸绝伟，天姿高秀。 戒曰：劝助法师法服，令人世世长雅，逍遥中国，不堕边夷，男女端正，冠冕玉佩。 戒曰：劝助国王父母子民忠孝，令人世世多嗣，男女贤儒，不更诸苦。 戒曰：劝助斋静读经，令人世世不堕地狱，即升天堂，礼见众圣，速得反形，化生王家，在意所欲，玩好#33备足，七祖同欢，善缘悉备，终始荣乐，法轮#34运至，将得仙道。 戒曰：劝助众人经学，令人世世才智洞达，动静威仪，常为人师。 戒曰：劝助一切布施谏诤，令人世世寿考富乐，常无怨恼。 戒曰：劝助一切民人除嫉去欲，履行众善，令人世世安乐，祸乱不生，病者自愈，仕宦高迁，为众所仰，莫不吉佑，门户清贵，天人爱育，神魔敬护，常生福地。 此戒名太上智慧劝进要戒上品，皆大智慧经上卷所言也，法传太极真人，以#35治道行矣。 兆有宿福，值见此文，秘而奉焉。 妄示不信，祸及见世，死为下鬼，闭於地狱，旋转五苦，后生失人道，毁经戒者亦然。 太极真人曰：人行之恶，莫大於嫉杀贪奢骄淫也。 若此一在心，必伐尔年命矣。 挟之#36以学神仙者，不亦悲乎。 太极真人曰：道德五千文，经之大也。 是道也，故通乎天地人，万物从之以终始也。 上士受诵为太上仙王，中士受诵为飞仙，下士受诵转轮#37圣王家，不经地狱，常生福国，命过之时，天帝云车迎其魂神，安处福堂也。 此度人无量#38，不可具言也。 昔有妇人，受诵是经，夫恒愠怒之，终亦不退，妇遂白日升天，夫死入地狱，受考历岁，妇飞、行看之，令读道德经，今当见救。 时天人飞下，太山府君即呼问之，其具答：常#39为妇人所教，礼於是经，妇人升仙，我故缘昔恩求救耳。 府君曰：子本虽不学，要是常#40礼大道，敬信经法，令可送着福堂，给其厨食，千年汝当生人中，可受诵是经。 男人曰：我若得生人道，必宗受是经，以求度世。 却千年，生人中，年十三岁，始好五千文，从师受诵口诀，高才聪明，国王礼聘不就，乃白日升仙。 其先敬经，贤妻相度，缘此宿恩也。 昔有贤明道士，斋於静室，不能得中食。 时俗姓男女#41，敬乐大法，感此道士忍饥而诵经，日日为设中食，时往听经，道士哀其敬信，以经#42传男子女人，教以口诀，各诵之万徧。 太上龙舆下迎，白日升天。 此例甚多，非可悉记也。 凡人虽不能学仙道，皆得受五千文礼敬，以致无为之道，在世保延性命，家门安乐，死径生天堂，不更三官地狱囚徒中也。 其诀在信好，则此大福可坐得矣。 大洞真经，太上洞玄隐书宝经，不可传凡人也，皆必是能学仙之士，所当修诵焉。 若轻传於凡夫者，将与七祖父母同幽於地狱，更五毒之考矣，慎之慎之。 太极真人曰：世人之惑也，而远其先人，并竞事鬼神，及杀生以求生，去生不亦远哉。 生时不修善治身，忍割可欲，死方厚葬#43其骸骨，不知魂魄已更五毒，幽囚地狱，苦恼三涂，轮转五道也。 生世无几，而聚敛财宝，无有足时，为己重担，福尽罪至，身死名灭，财宝四散也，若疾风之扇尘矣。",
      "translated_text": "**The Ten Wholesome Exhortations state further:**\n\n3. Exhort and assist in establishing fasting retreats for quiet cultivation, so that in the world one’s family and household become exalted and noble, the body ascends to the heavens, food and sustenance arise naturally, and one constantly abides in non-action.\n\n4. Exhort and assist in offering incense and oil to relieve the needy, so that in the world one becomes fragrant and flourishing, pure and radiant, with a majestic appearance and towering, refined bearing.\n\n5. Exhort and assist in providing Dharma masters with ritual robes, so that in the world one becomes eternally refined, roaming freely within the Central Kingdom, never falling among borderland barbarians, with sons and daughters upright and dignified, adorned in caps and jade pendants.\n\n6. Exhort and assist the king, parents, and the people in loyalty and filial piety, so that in the world one has many descendants, with sons and daughters wise and learned, spared from all suffering.\n\n7. Exhort and assist in fasting, quietude, and scripture recitation, so that in the world one never falls into hell but ascends directly to the heavens, pays homage to the host of sages, swiftly regains one’s true form, and is reborn into a royal household, where all desires are fulfilled, cherished possessions are abundant, the seven generations of ancestors rejoice together, all good affinities are complete, and from beginning to end one enjoys glory and bliss. The Dharma Wheel turns in accord, and one will attain the immortal Dao.\n\n8. Exhort and assist others in studying the scriptures, so that in the world one’s wisdom and insight become penetrating and clear, with dignified bearing in movement and stillness, and one constantly serves as a teacher to others.\n\n9. Exhort and assist in all acts of almsgiving and admonition, so that in the world one enjoys longevity, wealth, and happiness, free from resentment and affliction.\n\n10. Exhort and assist all people in eliminating jealousy and desire, practicing all virtues, so that in the world one lives in peace and joy, free from calamity and disorder. The sick recover on their own, officials are promoted to high rank, and one is revered by all. None fail to receive blessings, the household remains pure and noble, heavenly beings cherish and nurture them, spirits and demons respect and protect them, and they are always born in lands of fortune.\n\nThese are called the *Highest Exhortations of the Dao of Supreme Wisdom*, all drawn from the first scroll of the *Scripture of Great Wisdom*. The method was transmitted by the Perfected One of the Great Ultimate, who practiced and propagated the Dao.\n\nThose with accumulated blessings may encounter this text; they should treasure and uphold it. To recklessly show it to the unfaithful brings misfortune in this very life. After death, one becomes a lowly ghost, confined in hell, enduring the Five Sufferings, and in future lives loses the human path. Those who deface the scriptures or violate the precepts suffer the same fate.\n\nThe Perfected One of the Great Ultimate said: Among human evils, none are greater than jealousy, killing, greed, extravagance, arrogance, and lust. If even one of these dwells in the heart, it will surely cut short one’s years and lifespan. To cling to such faults while seeking to learn the immortal Dao—is this not lamentable?\n\nThe Perfected One of the Great Ultimate said: The *Five Thousand Character Scripture of the Dao and Its Virtue* is the greatest of all scriptures. This Dao, therefore, pervades heaven, earth, and humanity, and all things follow it from beginning to end. The superior person who receives and recites it becomes a Celestial King of the Highest; the middling person becomes a Flying Immortal; the lesser person is reborn into the household of a Wheel-Turning Sage King, never entering hell, and always dwelling in blessed lands. When their lifespan ends, the Heavenly Emperor sends a cloud chariot to welcome their soul, which is then settled in the Hall of Fortune. The number of beings thus delivered is immeasurable—it cannot be fully described.\n\nOnce there was a woman who received and recited this scripture. Her husband constantly resented and berated her, yet she never wavered. One day, she ascended to heaven in broad daylight. Her husband, after death, entered hell and endured years of torment. The woman, now a flying immortal, descended to observe him and instructed him to recite the *Scripture of the Dao and Its Virtue*, saying he would then be saved. At that moment, a heavenly being descended, and the Lord of Mount Tai summoned the man and questioned him. He answered in full: \"I was constantly taught by my wife to revere this scripture. Now that she has ascended as an immortal, I seek deliverance out of past gratitude.\" The Lord said: \"Though you did not originally study, you have consistently revered the Great Dao and honored the scriptures. You may now be sent to the Hall of Fortune, where your meals will be provided. After a thousand years, you will be reborn among humans and may receive and recite this scripture.\" The man replied: \"If I am reborn into the human path, I will surely devote myself to this scripture to seek deliverance from the world.\" After a thousand years, he was reborn among humans. At thirteen, he began to love the *Five Thousand Character Scripture*, studied under a master, received its oral instructions, and became exceptionally wise and intelligent. Though the king invited him with honors, he declined and ascended to heaven in broad daylight. His earlier reverence for the scripture and the deliverance by his virtuous wife were due to this accumulated blessing from past lives.\n\nOnce there was a wise and enlightened Daoist who fasted in a quiet chamber but could not obtain his midday meal. A layman and laywoman, deeply devoted to the Great Dharma, were moved by the Daoist’s endurance of hunger while reciting the scriptures. Day after day, they provided his midday meal and attended his lectures. The Daoist, pitying their devotion, transmitted the scripture to the man and woman, teaching them its oral instructions. Each recited it ten thousand times. The Celestial Emperor’s dragon carriage descended to welcome them, and they ascended to heaven in broad daylight. Such examples are too numerous to record in full.\n\nEven if one cannot study the immortal Dao, all may receive and revere the *Five Thousand Character Scripture*, thereby attaining the Dao of non-action. In this life, one preserves and extends life, the household enjoys peace, and after death, one proceeds directly to the heavens, never again imprisoned in the Three Bureaus’ hells. The key lies in sincere devotion—through this, such great blessings may be effortlessly attained.\n\nThe *Scripture of the Perfect Writs of the Great Cavern* and the *Precious Scripture of the Hidden Mysteries of the Highest Cavern* must not be transmitted to ordinary people. They are meant only for those who can study the immortal Dao and should be cultivated and recited accordingly. If lightly transmitted to the unworthy, one will be imprisoned in hell alongside seven generations of ancestors, enduring the Five Poisonous Torments. Beware, beware!\n\nThe Perfected One of the Great Ultimate said: The delusion of worldly people is that they distance themselves from their ancestors, instead competing to serve ghosts and spirits, slaughtering living beings to seek life—how far have they strayed from true life! While alive, they do not cultivate goodness or refine the self, enduring the severing of desires. Only after death do they lavishly bury their bones, unaware that their souls have already endured the Five Poisons, imprisoned in hell, suffering the agonies of the Three Wretched Paths, and cycling through the Five Destinies.\n\nLife in this world is brief, yet they amass wealth and treasures without end, burdening themselves with heavy loads. When blessings are exhausted and sins arrive, the body dies, the name perishes, and wealth scatters like dust before the wind.",
      "overlap_context": "uous, filial, and highly talented, honored and towering, respected by all, with flourishing family and clan.\n   - The Three Treasures are the Dao, the scriptures, and the masters. Those who nurture life, teach goodness, and serve as models for others are called Dharma masters.\n2. Exhort and assist in copying scriptures, so that in the world one becomes wise, widely learned in wondrous traces, constantly encountering sagely eras, seeing all scriptural teachings, and able to recite their passages.",
      "start_char": 3731,
      "end_char": 4988,
      "start_sentence": 148,
      "end_sentence": 182,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.17128038406372,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝智慧本愿大戒上品经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "道士持斋烧香，清挣读经，天下之盛事也。 而不欲见，见之如不见矣。 闻巫师鬼语，皆倾产厚礼奉之也。 持斋静漠而致福，巫师歌舞而招祸。 祸之及也，彼我魂神俱致考罚，殃对无已，往返三恶之道，其苦难脱#44。 罪竟后生，或堕六畜，失於人道，设使还人中，当为下贱矣，或六根不具，或形质丑陋，体炁臭秽，唯男唯女，顽痴可恶，为众所弃，流弊世间，至死饥寒。 其人也，皆受先世罪对，而从六畜中来，始还人道故也。 若於今世忍苦甘贫，悔往修来，趣求奉法，以自解脱者，亦见世渐报，来生将受大福，当生富贵侯王之家，相好具足，容貌端伟，光华灼烁，众见心欢，慈仁信好，高才宏略，欲男欲女，在我本愿也。 念寻善友，为因缘知识，自当冥 会，皆来为兄弟子孙，所以世世贤孝，展转相生，乃无绝矣。",
      "translated_text": "The Daoist who observes fasts, burns incense, purifies himself, and recites scriptures performs the most noble of worldly deeds. Yet if he does not wish to witness such things, he should regard them as though unseen. When he hears the incantations of shamans and ghost-speakers, he exhausts his wealth and offers lavish gifts to them. Observing fasts in stillness and detachment brings blessings, while shamans’ songs and dances summon misfortune. When misfortune strikes, both their souls and ours endure trials and punishments, with calamities unending, shuttling through the Three Wretched Paths—suffering from which escape is nearly impossible. Once the retribution is complete, they may be reborn as one of the Six Livestock, deprived of the human Way. Even if they return to the human realm, they will be born into lowly stations, some with incomplete faculties, others with hideous forms, their bodies foul and rank, whether male or female—stubborn, foolish, and despised, cast aside by all, drifting through the world in destitution until death from hunger and cold. Such people all bear the karmic consequences of past lives, having come from the Six Livestock before barely regaining the human Way.\n\nYet if in this life they endure hardship and willingly embrace poverty, repenting past wrongs and striving to cultivate the future, seeking to uphold the Dharma to liberate themselves, they will gradually witness retribution in this world, and in the next life receive great blessings. They will be born into the families of the wealthy, noble, or royal, their features perfect, their appearance dignified and majestic, radiant and resplendent, delighting all who behold them. They will be kind, benevolent, trustworthy, and virtuous, endowed with great talent and grand vision. Whether they desire sons or daughters, it shall be as their original vow dictates. They will encounter good companions, forming karmic connections and affinities, naturally meeting in the unseen realm, becoming brothers and descendants to one another. Thus, generation after generation, they will be wise and filial, perpetually reborn in succession, never to be cut off.",
      "overlap_context": "ing the severing of desires. Only after death do they lavishly bury their bones, unaware that their souls have already endured the Five Poisons, imprisoned in hell, suffering the agonies of the Three Wretched Paths, and cycling through the Five Destinies.\n\nLife in this world is brief, yet they amass wealth and treasures without end, burdening themselves with heavy loads. When blessings are exhausted and sins arrive, the body dies, the name perishes, and wealth scatters like dust before the wind.",
      "start_char": 4988,
      "end_char": 5310,
      "start_sentence": 183,
      "end_sentence": 192,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.855262994766235,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝智慧本愿大戒上品经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "故曰倚伏因缘，孰知其极也，又云子孙以祭祀不辍#45，此之谓也。 太极#46真人曰：玄素之道也，古人修之延年益命，以致长生矣，今人为之，消年损命，以招早死矣。 可复怨术邪，罪自己也，不亦悲哉。 太极#47真人曰：夫学道之为#48人也，先孝於所亲，忠於所君，愍於所使，信於所友，言而可复，谏恶扬善，无彼无此，吾我之私，不违外教，能事人道也。 次绝酒、声色、嫉妬、杀害、奢贪、骄怠也。 次断五辛、肥生、滋味之肴也。 次令想念兼冥，心亲清虚也。 次服食休根，奉持大戒，坚质勤志，导引胎息，吐纳和液，修建功德，忍人不能忍，割人不能割#49，行人不能行，居人不能居，衣人不能衣，食人不能食，守人不能守，学人不能学#50也。 道行如此，乃可镇以灵药，餐於云芽，尸虫沉落，秽漏消灭，三宫涤荡#51，五脏安闲矣。 将长斋久思，静咏洞经，耽味众妙，兼以丹液也。 能如是者，岂有不得升仙之道乎。 天尊告太极#52真人曰：若其不修人道，君亲不忠，耽酒好色，杀伐贪残，骄奢自恣，欺诱贤良，借贷不还，少已有如此之行矣，长不能革，使心夷然，而欲怀之，以斋戒学道，希肉飞之举，弗亦哀乎，弗亦哀乎。 斯人也，将长处地狱，履於五毒，刀山剑树，汤火炎燎，煮渍五体，求死不得，饥则食铁，渴则饮火，出临寒冰，伤肌切骨，方付三官，谪役山海，担负土石，鞭笞考对，备经三徒五道，往返十苦八难之中，其苦无量，不可具言也。 太极#53真人曰：是人也，乃不如外学凡人#54，奉修仁义#55，敬信道德#56，唯善而从矣#57，任化来往，在时迁易，逍遥域内，清净自适，命过亦入福舍，不经囚徒，或为鬼神也。 后生人道，不失本愿，转得信根，贤圣结缘，秽累日尽，终入仙道。 太极#58，真人曰：患人得全人道也，而不修德养性，以全於命矣； 患闻经也，而不信矣； 患信经也，贪财而不受矣； 患受经也，而不讲诵矣； 患讲诵也，而不修其事矣； 患修其事也，而不恒其道矣； 患奉师也，而不终其身矣； 患服药也，而未应中息矣； 患道行不备也，而夸求升腾矣； 患静斋读经也，处幽山而不堪其忧矣。 此十患在人之身也，若不戒之，身无济理。 所以云：有大患者，为我有身#59，斯之谓矣，可不思与，可不思与。 太极真人传经说法演戒竟，歌三徒五道苦痛，叹其辞曰： 三才及万物，倚伏各有龄。 终始待劫数，福尽天地倾。 往返於五道，苦哉更死生。 展转三徒中，去来与祸并。 大贤慎兹戒，忍性念割情。 愚夫不信法，罪痛常自婴。 吾念世无已，今故重告明。 若欲度斯患，归命太上经。 罪福不由他，谅自发尔身。 大贤故闭口，欲绝诸恶缘。 灭念归兼忘，倚伏待长泯。 弘道以安世，终当见正真。 淫嫉为祸首，灭身之至患。 含养如此辈#60，恐必致夭残。 知恶而不革，岂是道所安。 怀毒日斋直，令我发长叹。 宿命有信然，弱丧谓之无。 皆欲眼前见，过目则言悠。 大贤明道教，惨戚愍顽夫。 依依念子苦，勤勤令我忧。 人命已消尽，亦犹膏中火。 四大暂相遇，五物权时假。 盛年当勤学，趣求存吾我。 福尽身神散，冥冥地狱下。",
      "translated_text": "Thus it is said: \"Interdependence of fortune and misfortune—who can fathom its limits?\" This is what is meant by \"descendants maintaining unbroken ancestral sacrifices.\" The Perfected of the Supreme Ultimate said: The Dao of the Mysterious and the White—ancients who cultivated it prolonged their years and extended their lives, attaining longevity. Yet those who practice it today diminish their years and shorten their lives, hastening their deaths. Can one blame the arts? The fault lies with oneself—is this not lamentable?\n\nThe Perfected of the Supreme Ultimate said: For one who studies the Dao, first be filial to parents, loyal to one’s lord, compassionate to subordinates, and trustworthy to friends. Let your words be irreproachable, admonish evil and praise good, free from partiality or self-interest, and without violating external teachings—thus fulfilling the human Dao. Next, abstain from wine, sensual pleasures, jealousy, killing, extravagance, greed, arrogance, and indolence. Then, sever the Five Pungents, fatty meats, and rich flavors. Next, let thoughts and contemplation merge, and the mind become pure and empty. Then, consume restorative roots, uphold the great precepts, cultivate steadfast resolve, practice embryonic breathing and guiding-and-pulling, harmonize inhalation and saliva, accumulate merit, endure what others cannot endure, relinquish what others cannot relinquish, do what others cannot do, dwell where others cannot dwell, wear what others cannot wear, eat what others cannot eat, uphold what others cannot uphold, and study what others cannot study. Only when the Dao is practiced thus may one be stabilized with numinous medicines, partake of cloud sprouts, cause corpse worms to sink and decay, dissolve impurities, and purify the Three Palaces, so the Five Viscera may rest in tranquility. Then, with prolonged fasting and deep contemplation, silently recite the cavernous scriptures, savor their wondrous flavors, and refine the elixir. Can one who does so fail to attain the Dao of ascending as an immortal?\n\nThe Heavenly Worthy addressed the Perfected of the Supreme Ultimate: If one does not cultivate the human Dao, is disloyal to lord and kin, indulges in wine and sensuality, kills and plunders, is arrogant and self-indulgent, deceives and misleads the worthy, borrows without repayment—if in youth one acts thus, and in maturity cannot reform, allowing the heart to remain untroubled, yet desires to embrace fasting and study the Dao, hoping for the ascent of a flying immortal—is this not pitiable? Is this not pitiable? Such a person will long dwell in hell, tread the Five Poisons, climb mountains of knives and forests of swords, endure boiling cauldrons and scorching flames, be steeped in searing torment, unable even to die. Hungry, they will eat iron; thirsty, they will drink fire. Emerging, they will face freezing ice, their flesh cut to the bone. Only then will they be handed over to the Three Officials, exiled to labor in mountains and seas, bearing loads of earth and stone, whipped and interrogated, enduring the Three Paths and Five Ways, traversing the Ten Sufferings and Eight Hardships—agonies beyond measure, inexpressible in full.\n\nThe Perfected of the Supreme Ultimate said: Such a person is not even equal to an ordinary scholar who practices benevolence and righteousness, reveres and trusts the Dao and virtue, and follows only what is good. Though subject to the transformations of time and change, they wander freely within the world, pure and at ease. When their lives end, they enter the abodes of blessings, avoiding imprisonment, and may become spirits. Reborn in the human realm, they do not lose their original vow, gradually deepen their roots of faith, form affinities with the worthy and sagely, and day by day shed their impurities, ultimately entering the immortal Dao.\n\nThe Perfected of the Supreme Ultimate said: The peril is that one attains the human Dao yet does not cultivate virtue and nurture nature to preserve life. The peril is hearing the scriptures yet not believing them. The peril is believing the scriptures yet coveting wealth and refusing them. The peril is receiving the scriptures yet not reciting and expounding them. The peril is reciting and expounding them yet not practicing their teachings. The peril is practicing their teachings yet not persevering in the Dao. The peril is serving a master yet not remaining devoted for life. The peril is taking medicines yet not attaining the proper cessation of breath. The peril is the Dao not being fully realized yet boasting of ascending and soaring. The peril is practicing silent fasting and reading scriptures yet dwelling in secluded mountains and being unable to endure the hardship. These ten perils reside within a person—if not guarded against, the body will find no remedy. Thus it is said: \"The great peril is that I have a body.\" This is what is meant—can one not reflect upon it? Can one not reflect upon it?\n\nWhen the Perfected of the Supreme Ultimate had finished transmitting the scriptures, expounding the Dharma, and teaching the precepts, he sang of the sufferings of the Three Paths and Five Ways, sighing these words:\n\nThe Three Powers and the myriad things,\nEach depend on their allotted span.\nBeginning and end await the kalpa’s reckoning,\nWhen blessings are exhausted, heaven and earth collapse.\nTraversing the Five Ways,\nHow bitter to die and be reborn again.\nRevolving through the Three Paths,\nComing and going with calamity.\nGreat worthies, heed these precepts,\nEndure your nature, relinquish your passions.\nFoolish men do not believe the Dharma,\nTheir sins and pains ever cling to them.\nI grieve that the world has no end,\nAnd so now I declare it anew:\nIf you wish to escape these perils,\nTake refuge in the scriptures of the Most High.\nSin and blessing do not come from another—\nTruly, they arise from your own body.\nThus the great worthy seals his lips,\nSeeking to sever all evil affinities.\nExtinguish thoughts, return to dual forgetting,\nAwait the long dissolution of interdependence.\nPropagate the Dao to pacify the world,\nAnd in the end, you will behold the True One.\nLust and jealousy are the roots of misfortune,\nThe greatest perils to life.\nTo harbor and nurture such types—\nI fear they will surely meet early ruin.\nKnowing evil yet not reforming—\nHow can this be the Dao’s peace?\nHolding poison while fasting upright,\nIt makes me sigh deeply.\nKarma from past lives is indeed real,\nYet the weak and short-lived call it nonexistent.\nAll desire to see it before their eyes,\nBut once it passes, they call it remote.\nGreat worthies, illumine the Dao’s teachings,\nGrieving for the stubborn and foolish.\nTenderly, I think of their suffering,\nDiligently, I cause myself sorrow.\nA person’s life is already spent,\nLike a flame in oil.\nThe Four Great are but a temporary meeting,\nThe Five Agents a provisional borrowing.\nIn the prime of life, study diligently,\nSeek to preserve what is yours.\nWhen blessings are exhausted, body and spirit scatter,\nAnd in darkness, descend to hell.",
      "overlap_context": "hting all who behold them. They will be kind, benevolent, trustworthy, and virtuous, endowed with great talent and grand vision. Whether they desire sons or daughters, it shall be as their original vow dictates. They will encounter good companions, forming karmic connections and affinities, naturally meeting in the unseen realm, becoming brothers and descendants to one another. Thus, generation after generation, they will be wise and filial, perpetually reborn in succession, never to be cut off.",
      "start_char": 5310,
      "end_char": 6547,
      "start_sentence": 193,
      "end_sentence": 244,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.119179487228394,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝智慧本愿大戒上品经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "上圣畏是故，寻道度斯祸。 学仙行为急，奉戒制情心。 虚夷正气居，仙圣自相寻。 若不信法言，胡为栖山林。 大贤乐经戒，受之为身宝。 就学恒苦晚，治身恨不早。 比当披幽赜，倏忽年已老。 执卷吸尔极，将更死痛恼。 吾故及弱龄，弃世以学道。 太极真人曰：吾昔学道时，受之於太上虚皇，奉而修之，遂成真人矣。 道士若欲受吾大戒品文，师先读一过，以示其心也，其必是学仙之士者，当赍信诣师门，乃#61对斋三日，念道思戒，然伟传矣。 此戒至重，各各有威神部护其人，慎哉，慎哉。 仙公曰：此大戒施於学仙道士也。 好寻世间非常，万物皆当归空，尽是法，可缘之度三徒之苦，以得道也。 遇之者，子宿愿也。 受宜从之，勿不勤修。 仙公以元正之日受戒，而作颂曰： 幽名山以静漠兮，眄峻石之岑岑。 素雪翳乎前庭兮，劲风肃於东林。 对天尊之容与兮，耽冥赜而散拎。 愍世人之堕罪兮，悲念之不去心。 背经戒以信邪魅#62兮，弃斋静而美酒音。 轮五道与三徒兮，经地狱之幽沉。 斯苦痛之可言兮，更死生而难任，唯道德之济物兮，岂#63待困而不寻。 仙公告弟子郑思远曰：吾少游诸名山，履於崄，在禽兽之左右，辛苦备至，忍情遣念，损口惠施，后身成人，怀道安世，恒修慈爱，念道存真，无时敢替也。 斋直一年而未竟，其冬至之日，天真眄降，见授大经上仙之道。 天真令我大斋长静，按经施诵，次而学之，遂成真人矣。 吾昔所受经道，太上所贵也，非中仙之所学矣。 历劫以来，常传上仙，仙公仙王仙卿，不但我也。 吾先世与子同发此愿，施行善功，勤积不怠，致玄都有仙名，今相为师友，是以相授耳。 吾去世也，将有乐道慈心居士，来生吾门者，子当以今道业，事事一通付之，法应世世录传也，皆是我前世与彼有宿恩，因缘使然也。 子以一通依科传付弟子佳者也。 若无其人，一通封付五岳名山矣。 此太极真人口诀，子秘之，慎之慎之，时思之。 太上洞玄灵宝智慧本愿大戒上品经竟 #1 案敦煌P.2468抄本（以下简称敦本），此经题名作「太上消魔宝真安志智慧本愿大戒上品」。 此名与宋文明灵宝经目、灵宝中盟经目、斋坛安镇经目之着录相近。 #2 灵宝玄师太极太虚真人：敦本作「太极法师真人徐来勒」 #3 容豫：敦本作「容与」。 #4 「耳」 字据敦本补。 #5 「愧」 字原作「故」，据敦本改。 #6 韫：敦本作「蕴」。 后文中「韫」字，敦本亦皆作「蕴」。 不复出校记。 #7 喻：原作「谕」，据敦本改。 #8 经云：敦本作「道言」。 #9 鬼魅：敦本作「鬼魁」。 #10 绝秀：敦本作「绝易」。 易，言貌美也。 #11 今：原作「或」，据敦本改。 上文「下鬼」，敦本作「鬼神」。 #12 前世：敦本作「先身」。 #13 展转：敦本作「辗转」。 后文皆同此。 #14 守清忍志慕在贤贞：敦本作「守情忍色，志慕在贤」。 近是。 #15 合：原作「令」，据敦本改。",
      "translated_text": "The highest sages, in awe of this, sought the Dao to transcend such calamity. The urgent path is to practice immortality and uphold the precepts to restrain the heart’s passions. In emptiness and purity, the upright qi resides, and immortals and sages naturally seek one another. If you do not believe these teachings, why dwell in the mountains and forests?\n\nGreat worthies delight in the scriptures and precepts, receiving them as treasures for the body. To pursue study is ever lamented as too late; to cultivate the self is ever regretted as too slow. By the time one unravels the profound and obscure, in a flash, the years have grown old. Clutching the scrolls to the end, one will only meet death with bitter sorrow.\n\nThus, in my youthful years, I abandoned the world to study the Dao. The Supreme Ultimate Perfected One said: \"When I once studied the Dao, I received it from the Supreme Lord of the Void and Sovereign. Practicing it with devotion, I became a Perfected One. If a Daoist wishes to receive my Great Precepts, the master should first read them once to reveal their essence. Only those who are truly students of immortality should come bearing sincerity to the master’s gate. After fasting and purifying for three days, contemplating the Dao and reflecting on the precepts, they may then be transmitted. These precepts are of utmost gravity—each is guarded by mighty spirit-deities. Be cautious, be cautious!\n\nThe Immortal Lord said: \"These Great Precepts are bestowed upon Daoist students of immortality. Diligently seek what is extraordinary in the world, for all things shall return to emptiness. All is Dharma, through which one may ascend beyond the sufferings of the Three Paths and attain the Dao. Those who encounter this are fulfilling their past vows. Receive it and follow it; do not fail to cultivate it diligently.\"\n\nOn the first day of the new year, the Immortal Lord received the precepts and composed this hymn:\n\nIn the secluded mountains, still and desolate,\nI gaze upon towering cliffs, steep and sheer.\nPristine snow veils the front courtyard,\nWhile fierce winds howl through the eastern grove.\nBefore the Heavenly Worthy, I linger in reverence,\nImmersed in the profound, my cares dissolve.\nPitying those who fall into sin,\nMy heart cannot shake this sorrow.\nTurning from scriptures and precepts to trust in demonic illusions,\nAbandoning fasting and stillness for the allure of wine and song—\nThey cycle through the Five Paths and Three Realms,\nPassing through the dark depths of hell.\nSuch suffering is beyond words,\nYet they endure death and rebirth, unable to bear it.\nOnly the Dao and virtue can save beings—\nWhy wait until distressed before seeking them?\n\nThe Immortal Lord addressed his disciple Zheng Siyuan: \"In my youth, I wandered through famous mountains, traversing perilous paths, living among birds and beasts. I endured every hardship, suppressed my desires, cast aside worldly thoughts, and practiced generosity with restraint. Later, I was reborn as a human, embraced the Dao, and brought peace to the world. I constantly cultivated compassion, cherished the Dao, and preserved truth, never daring to neglect it. After fasting and purifying for a year without completion, on the winter solstice, the Heavenly Perfected descended and bestowed upon me the Great Scripture and the Way of the Upper Immortals. The Heavenly Perfected commanded me to undertake a great fast in profound stillness, reciting and studying the scriptures in sequence. Thus, I became a Perfected One.\n\nThe scriptures and Dao I once received are treasured by the Supreme Lord, not the teachings of middling immortals. Through countless kalpas, they have been transmitted to Upper Immortals—Immortal Lords, Immortal Kings, and Immortal Ministers—not only to me. My past lives and yours shared this vow. By performing good deeds and accumulating merit without ceasing, we attained immortal names in the Dark Capital. Now, as teacher and friend, I transmit this to you.\n\nAfter I depart this world, there will be those who delight in the Dao, whose hearts are kind and compassionate, and who are born into my lineage. You must pass on all the teachings and practices I have imparted to them, for it is destined that these be recorded and transmitted through the ages. This is due to the karmic bonds and affinities we shared in past lives. Transmit one copy in accordance with the regulations to a worthy disciple. If no such person exists, seal one copy and entrust it to the Five Sacred Mountains.\n\nThese are the oral instructions of the Supreme Ultimate Perfected One. Keep them secret, be cautious, be ever cautious, and reflect on them always.\"\n\nHere ends the *Supreme Scripture of the Dao and Its Virtue: The Great Precepts of Original Vows and Wisdom, Upper Grade*.",
      "overlap_context": "\nBut once it passes, they call it remote.\nGreat worthies, illumine the Dao’s teachings,\nGrieving for the stubborn and foolish.\nTenderly, I think of their suffering,\nDiligently, I cause myself sorrow.\nA person’s life is already spent,\nLike a flame in oil.\nThe Four Great are but a temporary meeting,\nThe Five Agents a provisional borrowing.\nIn the prime of life, study diligently,\nSeek to preserve what is yours.\nWhen blessings are exhausted, body and spirit scatter,\nAnd in darkness, descend to hell.",
      "start_char": 6547,
      "end_char": 7738,
      "start_sentence": 245,
      "end_sentence": 301,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.006321668624878,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝智慧本愿大戒上品经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "#16 法师：敦本作「沙门尼」。 当系佛徒所改。 #17 得道无为：敦本作「得道如佛」。 #18 静观：敦本作「静寺」。 #19 尽入法门：敦本作「尽上高座」。 #20 普行：敦本作「普见」。 近是。 #21 师宗：敦本作「儒宗」。 #22 不为始终免无闲罪：敦本作「不为罪始，终入无为」。 上文「畋猎」，敦本作「鱼猎」。 #23 得生：敦本作「宾王」，近是。 下文「边境」，敦本作「边地」。 #24 学名：敦本作「盛令」。 #25 受兹芳诤：敦本作「受姿芳盛」。 #26 叹法：敦本作「敬说」。 #27 其：敦本作「期」，近是。 #28 契：敦本作「启」，近是。 #29 随侍：敦本作「随传」。 #30 常念哺咏：敦本作「常念斋笑咏。 」 #31 始入法门：敦本作「妙入道门」。 #32 静治：敦本作「静寺」。 #33 玩好：敦本作「玩服」。 #34 法轮：敦本作「转轮」。 #35 「以」字原作「及」，据敦本改。 #36 挟之：敦本作「协之」。 #37 「转轮」二字上原衍一「生」字，据敦本删。 #38 无量：原作「无数量」，据敦本删「数」字。 #39#40 常：敦本作「尝」。 上文「具答」，敦本作「具言」。 #41 时俗姓男女：敦本作「时族姓男子」。 案「俗」字当作「族」为是。 #42「经」字据敦本补。 #43 厚葬：原作「殡葬」，据敦本改。 #44 难脱：敦本作「难说」。 #45 不辗：敦本作「不让」。 #46 #47 #48 #49 敦本无「太极」 二字。 #50 「为」字据敦本补。 #51 割人不能割：五字据敦本补。 #52 学人不能学：五字据敦本补。 #53 三宫涤荡：敦本作「三官调畅」，近是。 #54 敦本无「天尊告太极」 五字。 #55 凡人：敦本作「凡贤」 。 #56 仁义：敦本作「人道」。 #57 道德：敦本作「道经」，近是。 #58 「矣」字据敦本补。 #59 为我有身：敦本作「及我身也」。 #60 辈：敦本作「害」。 #61 乃：原作「及」，据敦本改。 #62 邪魅：原作「邪魅」，据敦本改。 #63 「岂」字上原衍「更」字，据敦本删。",
      "translated_text": "The master of the Dao (Dunhuang manuscript: \"nun\"; likely altered by Buddhist followers) attains the Way of non-action (Dunhuang manuscript: \"attains the Way like the Buddha\"). Through tranquil observation (Dunhuang manuscript: \"tranquil temple\"), all enter the gateway of the Dao (Dunhuang manuscript: \"all ascend the high seat\"). Universally practicing (Dunhuang manuscript: \"universally seeing\"; closer to the original), they follow the lineage of their masters (Dunhuang manuscript: \"Confucian lineage\"). Not committing transgressions from beginning to end, they ultimately attain freedom from error (Dunhuang manuscript: \"not initiating transgressions, ultimately entering non-action\"). As for hunting and fishing (Dunhuang manuscript: \"fishing and hunting\"), those who attain birth (Dunhuang manuscript: \"guest kings\"; closer to the original) in border regions (Dunhuang manuscript: \"borderlands\") study fame (Dunhuang manuscript: \"flourishing command\"). Receiving this fragrant admonition (Dunhuang manuscript: \"receiving this fragrant and flourishing form\"), they praise the Dao (Dunhuang manuscript: \"revere and speak of it\"). Their (Dunhuang manuscript: \"their time\"; closer to the original) connection (Dunhuang manuscript: \"opening\"; closer to the original) to the teachings is such that they follow and attend (Dunhuang manuscript: \"follow and transmit\") with constant mindfulness and recitation (Dunhuang manuscript: \"constant mindfulness, fasting, laughter, and recitation\").\n\nWhen first entering the gateway of the Dao (Dunhuang manuscript: \"wondrously entering the gateway of the Way\"), they cultivate tranquility (Dunhuang manuscript: \"tranquil temple\"). Forsaking worldly attachments (Dunhuang manuscript: \"worldly adornments\"), they turn the Wheel of the Dao (Dunhuang manuscript: \"turning wheel\"). With it (Dunhuang manuscript: \"and\"; emended from \"and\" to \"with\" per the Dunhuang manuscript), they harmonize (Dunhuang manuscript: \"cooperate\") the turning wheel (Dunhuang manuscript omits the interpolated \"birth\" character). Thus, they attain boundless (Dunhuang manuscript: \"boundless\"; emended from \"innumerable\" to \"boundless\") blessings. Always (Dunhuang manuscript: \"once\") responding fully (Dunhuang manuscript: \"speaking fully\"), they address the customs of their time, whether male or female (Dunhuang manuscript: \"the men of their clans\"; \"clan\" is likely the correct reading over \"customs\"). They uphold the scriptures (the character \"scripture\" is supplied from the Dunhuang manuscript) and avoid lavish burials (Dunhuang manuscript: \"lavish burials\"; emended from \"funeral burials\"). They recognize the difficulty of liberation (Dunhuang manuscript: \"difficulty of explanation\") and do not refuse (Dunhuang manuscript: \"do not yield\").\n\nThe text omits the characters \"Supreme Ultimate\" (per the Dunhuang manuscript). With it (the character \"with\" is supplied from the Dunhuang manuscript), one may sever yet cannot be severed, study yet cannot be studied. The Three Palaces are purified (Dunhuang manuscript: \"The Three Offices are harmonized\"; closer to the original). The Heavenly Worthy addresses (the Dunhuang manuscript omits \"the Heavenly Worthy addresses the Supreme Ultimate\"). Ordinary people (Dunhuang manuscript: \"ordinary worthies\") practice benevolence and righteousness (Dunhuang manuscript: \"the human Way\"). The Dao and its virtue (Dunhuang manuscript: \"the Dao and the scriptures\"; closer to the original) are thus (the character \"thus\" is supplied from the Dunhuang manuscript). For I possess a body (Dunhuang manuscript: \"and my body\"), they harm (Dunhuang manuscript: \"harm\") me. Then (emended from \"and\" to \"then\" per the Dunhuang manuscript), demonic forces (emended from \"demonic forces\" per the Dunhuang manuscript) arise. How (the interpolated character \"more\" is deleted per the Dunhuang manuscript) could this not be so?",
      "overlap_context": " is due to the karmic bonds and affinities we shared in past lives. Transmit one copy in accordance with the regulations to a worthy disciple. If no such person exists, seal one copy and entrust it to the Five Sacred Mountains.\n\nThese are the oral instructions of the Supreme Ultimate Perfected One. Keep them secret, be cautious, be ever cautious, and reflect on them always.\"\n\nHere ends the *Supreme Scripture of the Dao and Its Virtue: The Great Precepts of Original Vows and Wisdom, Upper Grade*.",
      "start_char": 7739,
      "end_char": 8708,
      "start_sentence": 302,
      "end_sentence": 352,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.922887563705444,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝智慧本愿大戒上品经.txt",
        "category": "本文类"
      }
    }
  ]
}