{
  "source_id": "太上灵宝净明入道品",
  "source_file": "chunked_daozang\\太上灵宝净明入道品.json",
  "total_chunks": 3,
  "total_original_chars": 1657,
  "total_translated_chars": 9831,
  "total_translation_time": 46.99561667442322,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\方法类\\太上灵宝净明入道品.txt",
    "category": "方法类"
  },
  "full_translation": "*The Supreme Numinous Treasure Scripture on Entering the Dao through Purity and Brightness*\n\n**Title:** *The Supreme Numinous Treasure Scripture on Entering the Dao through Purity and Brightness*. Author unknown. Three sections in one scroll. Base text from *The Orthodox Daoist Canon*, Dongxuan Section, Methods Category.\n\n---\n\n*The Supreme Numinous Treasure Scripture on Entering the Dao through Purity and Brightness*\n\nThe Supreme Numinous Treasure Purity and Brightness Secret Sanctuary resides west of the Jade Capital Mountain of the Supreme Clarity Mystic Metropolis in the Upper Clarity Heaven. It is the sanctuary where the Dao Lord practices the Daoist rites, unifying the methods of the Three Luminaries to harmonize Heaven and Earth, serve ruler and kin, command spirits and gods, deliver beings, and expel demonic forces.\n\nThose who receive this teaching style themselves as \"Disciples of Loyalty and Filial Piety of the Supreme Numinous Treasure Registers.\" They preside over the Purity and Brightness Secret Sanctuary, jointly administering its ritual affairs. Those of profound merit and distant service are addressed accordingly herein.\n\nOne must practice with utmost sincerity, adhering to three principles: first, filial piety and fraternal duty; second, refining the body; third, delivering beings. Daily, one burns incense and performs morning rites, prostrating to the myriad heavens to accumulate blessings and longevity for the king and parents. Next, for all sentient beings, one summons the divine spirits in proper order—consulting them when matters arise, dismissing them swiftly when none.\n\nWithin the bounds of the heart, one must always uphold uprightness, filial piety, and friendliness, never indulging in licentiousness, flattery, deceit, or contempt for the Dao and its methods. To avert future transgressions, keep a small ledger, daily recording one’s deeds. If deceit lurks in the heart, it will remain unrecorded. Upon discovering such faults, correct them at once, and the methods will naturally prove efficacious. Should one violate these precepts, calamity will swiftly follow. By adhering to this path, distant merit and proper investiture will elevate one beyond the mortal dust. Celestial scriptures and secret methods will suddenly arrive—ask the disciple: can you practice thus?\n\nThose who receive the Purity and Brightness method must hold themselves in awe, daily revering their sovereign, honoring their six relations with filial piety, enduring hardship in cultivation, and diligently aiding and delivering others. Within the heart, one should feel as though bearing an unrepayable debt, yet strive to repay it. Thus, the voice softens, the breath calms, and anger dissipates—this is the essence of Purity and Brightness. In one’s dwelling, keep a mirror and a basin of water to understand the intent behind this method.\n\nAll who receive the Purity and Brightness method are recorded by the Celestial Emperor and entrusted with no light duty. Their transgressions are erased in the Northern Bureau, their names inscribed in the Southern Palace. Twelve officials stand before them, twelve behind, accompanying their every move, regardless of purity or filth. Even mortal attendants, who follow one’s left and right, dare not act wantonly. How much less should one disregard these celestial gods, whose names are inscribed in the immortal registers and who guard and protect you?\n\nThose who receive the Purity and Brightness method possess bones of gold and flesh of jade, already in communion with the divine. Their hands judge the hidden yin realms, their words bridge the numinous and wondrous. If one harbors licentiousness, it is as though casting gold and jade into the dirt. Beware of agitation, lest it disturb the qi and blood. When qi and blood remain firm and whole, demonic forces cannot enter, and one attains true perfection, avoiding premature death. The foundation of ascension and transcendence lies in eschewing lust and desire—remember this well.\n\nThose who receive the Purity and Brightness method remain in the world temporarily, as their kalpas are not yet complete, and they do not immediately ascend. Yet by accumulating merit and piling up deeds, they will surely depart the mortal and enter the sacred. Kindness may arise from harm, so do not casually abandon wife and children. Harm may arise from kindness, so do not covet wife and children, lest you drown within the inner chambers. Sever affection with righteousness, relinquish love and emotion, and together ascend to the celestial realms.\n\nAs for those who greedily amass wealth, insatiably craving without end; who harm others to bequeath to their children; who exhaust their bodies and deplete their marrow to please women—all such actions must cease. If one can transform others with the Dao and cultivate together, this is true understanding of the root. Should they refuse, then on the day of your enlightenment, they too will reap vast blessings—why cling to trivial matters of the present?\n\nThose who receive the Purity and Brightness method must prioritize aiding others. Seeing another’s father, another’s mother, regard them as your own. Pity the aged, succor the orphaned, pity the poor, and tend the sick. When others face peril or illness, feel as though it were your own. With such a heart, you grasp the principle herein—remember this.\n\nThose who receive the Purity and Brightness method must value integrity and fairness. Those in office must not rely on wealth and power; the poor must not shame their poverty and lowliness. The Celestial Lord apportions fate without the slightest partiality. I observe that many disciples, after receiving this method, practice with reckless intent, often harming beings. They arbitrarily execute gods and spirits, command thunder and clouds as though ordering servants. The wealthy, when summoned, do not come; the poor, seeing profit, rush to obey. Or, in anger, they curse and employ gods and spirits to exact vengeance and kill foes. They distort celestial decrees, dismantle statutes, and alter characters—all of which I deeply deplore.\n\nThose who receive the Purity and Brightness method, even if they do not ascend to perfection, can achieve liberation through the corpse. Though they may not openly command spirits, the hidden realms will still obey. Do not grow impatient or restless; perseverance is key. Many of my disciples, after receiving the method, fail to measure their accumulated merit and immediately blame their masters. Without an inch of merit, they seek to ascend; lacking divine clarity, they demand the profound mysteries. Let this serve as a warning.\n\nThose who receive the Purity and Brightness method must not recklessly transmit it to others; first, perfect yourself as a master of deliverance. Wait until you perceive, in the unseen realm, that your position is among the officials of yin. When you encounter one whose karmic conditions align, face east, burn incense, and inquire of me. If I permit it, then transmit it. Thus, I am the master of deliverance, and you become the master of transmission.\n\nThe Sun Palace’s Filial Piety Luminous King is the ancestral master. Master Wu is the registrar, Matron Chen the scripture master, and Lord Zhang of the Daily Office the supervising master of deliverance. When dozens of disciples attain the Dao, then one day, upon ascending to perfection, you shall be as I am.\n\nThose who receive the Purity and Brightness method must transmit it only to those whose karmic conditions align, who embody loyalty and filial piety, whose qi and blood are full and complete, and whose integrity is unyielding. Do not withhold it from the poor nor grant it solely to the wealthy. To violate this is to incur guilt across three generations.\n\nWhen one who has received the Purity and Brightness method seeks to transmit and deliver it, they must prepare a memorial and submit it to the ancestral master, the Supreme Emperor of the Sun Palace, performing the customary jiao rites for the Three Realms to bear witness and give thanks. Act within your means; do not borrow or squander wealth, for this would contravene my immediate decree. There is no fixed ritual.\n\nWhen transmitting the method to another, after submitting the memorial, include within it a pledge attesting to the nine generations of the disciple. Upon their promotion to an immortal office, they shall be appointed as a Four-Character Immortal Aide. That night, inscribe nine talismans and fashion nine straw figures. Burn them facing the Heavenly Gate, and these straw figures shall transform into nine Direct Talismans. With these talismans in hand, one may traverse the Six Paths of Hell without hindrance, for wherever the talisman arrives, liberation follows. Present this talismanic script to the Celestial Pivot Bureau to receive official documents as an immortal officer. Those already holding immortal offices shall ascend in rank thereafter.\n\nWhen inscribing the talismans, wear the sun upon your crown and tread upon the Dipper. Transmit the words orally and receive them in the heart, inscribing them while facing the Heavenly Gate. Write the talismans in cinnabar. The incantation for inscribing the talisman reads:\n\nThe *Secret Canon of Pure Clarity* for Ascending to Immortal Office. The loyal and filial child brings blessings upon their kin. For nine generations, they receive rank and are ordained to ascend as immortals. Wherever the precious register is carried, all defer and yield. Hasten, hasten, in accordance with the statutes and ordinances.\n\nThereafter, transmit the aforementioned script and carry it in practice. Clasp the Zi talisman and pace the Dipper, envisioning the sun above your head. Here ends the *Scripture of the Most High Numinous Treasure: Pure Clarity’s Entry into the Dao*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上灵宝净明入道品 经名：太上灵宝净明入道品。 撰人不详。 三篇同卷。 底本出处：《正统道藏》洞玄部方法类。 太上灵宝净明入道品 太上灵宝净明秘院，在太上上清玄都玉京山之西，乃道君修法之院，兼三景之法而统之，以和天地，以奉君亲，以役鬼神，以度人物，以逐邪魔。 自号太上灵宝法箓忠孝弟子，主净明秘院同管法事。 有邃职遥勋，即於此下称之。 当至心行持，一孝悌，二炼形，三救度。 逐日烧香朝礼，礼拜诸天，为国王父母资崇福寿。 次为一切有情，方乃依次呼召神明，有事委问之，无事即遣其速归。 局分心中，常务正直孝友，不得邪淫谄曲、轻道慢法。 如欲降未来之愆，即当置一小册，日录所为。 其有欺心，自不可形於纸者是也。 凡有似此，即速改之，则法术自灵； 如或违之，则灾咎立至。 但能依此，则遥勋正授，超举凡尘。 天书秘法，忽然而至，问弟子能行否？ 凡得净明法者，当自畏惧，逐日恭敬君上，孝悌六亲，克苦修行，勤诚济拔，心中常如负人不可报之恩，思有必可报之意，则怡声下气，无志无怒，正得净明之体。 坐卧处，常置一鉴、一盂水，则自知吾立法之意。 凡得净明法者，皆上帝记录，委任不轻，罪消北府，记名南宫，吏十二在前，吏十二在后，无论污洁，行止必随。 今人出入，有左右使令，尚不敢轻为淫僻。 况此天神，名在仙箓，护卫於子，子可忽诸？ 凡得净明法者，金骨玉肉，已与神通。 手判幽阴，言接灵妙。 若怀淫僻，则正如以金玉弃之土壤，慎无摇荡，损动炁血。 炁血坚完，则妖邪不入，自得正真，不致夭折。 飞升超举，长生之本，在於不贪淫欲，切宜记之。 凡得净明法者，在世暂以尘劫未足，不即超升。 如能积行累功，计必离凡入圣。 恩生於害，无嫌弃妻子於等闲。 害生於恩，莫羡慕妻子，而沦丧闺门之内。 以义断恩，割爱舍情，同归霄汉。 若夫贪求聚物，克意无厌； 损物陷人，以遗儿女； 劳形竭髓，以悦妇人； 则此皆可已。 如能化之以道，同学修行，可谓知本。 设或不从，则於成道之日，彼亦大蒙福瘾，何必区区眼目之事。 凡得净明法者，务在济物。 见他人之父，见他人之母，如我父母。 矜老恤孤，怜贫悯病，如病危急，若在己身。 如此用心，可得吾理，当念之。 凡得净明法者，务在廉平。 居官者，无恃富贵。 居贫者，莫羞贫贱。 天公受分，毫发无私。 我见诸弟子得吾法之后，妄意行持，居多害物，擅自斩伐考戮鬼神，叱咤云雷，如使奴仆。 富贵者，逢召不至。 贫贱者，见利即往。 或因怒骂，使役鬼神，使之报怨杀雠。 了曲用天宪，拆破条文，增添字划，皆吾所甚病也。 凡得净明法者，虽不升真，亦能尸解。 虽未明中役鬼，亦且暗处伏从。 即不得便生愤躁，要在坚切。 我诸弟子，多有受法之后，不量已之积累，便即咎怨父师。 无寸功，而便欲飞升。 神未明达，而便欲坚求玄奥。 则又可以为戒也。 凡得净明法者，不得妄以付人，且自为度师。 直候见闻，位在阴官，当遇缘合之人，望东烧香，以问於我，我许即传。 即我是度师，汝为传教之师。 日宫太阳孝道明王，乃祖师也。 吴君为籍师，谌姆为经师，日直，元君张公，即监度师。 如数十弟子成道，则他日升真，当如我矣。",
      "translated_text": "*The Supreme Numinous Treasure Scripture on Entering the Dao through Purity and Brightness*\n\n**Title:** *The Supreme Numinous Treasure Scripture on Entering the Dao through Purity and Brightness*. Author unknown. Three sections in one scroll. Base text from *The Orthodox Daoist Canon*, Dongxuan Section, Methods Category.\n\n---\n\n*The Supreme Numinous Treasure Scripture on Entering the Dao through Purity and Brightness*\n\nThe Supreme Numinous Treasure Purity and Brightness Secret Sanctuary resides west of the Jade Capital Mountain of the Supreme Clarity Mystic Metropolis in the Upper Clarity Heaven. It is the sanctuary where the Dao Lord practices the Daoist rites, unifying the methods of the Three Luminaries to harmonize Heaven and Earth, serve ruler and kin, command spirits and gods, deliver beings, and expel demonic forces.\n\nThose who receive this teaching style themselves as \"Disciples of Loyalty and Filial Piety of the Supreme Numinous Treasure Registers.\" They preside over the Purity and Brightness Secret Sanctuary, jointly administering its ritual affairs. Those of profound merit and distant service are addressed accordingly herein.\n\nOne must practice with utmost sincerity, adhering to three principles: first, filial piety and fraternal duty; second, refining the body; third, delivering beings. Daily, one burns incense and performs morning rites, prostrating to the myriad heavens to accumulate blessings and longevity for the king and parents. Next, for all sentient beings, one summons the divine spirits in proper order—consulting them when matters arise, dismissing them swiftly when none.\n\nWithin the bounds of the heart, one must always uphold uprightness, filial piety, and friendliness, never indulging in licentiousness, flattery, deceit, or contempt for the Dao and its methods. To avert future transgressions, keep a small ledger, daily recording one’s deeds. If deceit lurks in the heart, it will remain unrecorded. Upon discovering such faults, correct them at once, and the methods will naturally prove efficacious. Should one violate these precepts, calamity will swiftly follow. By adhering to this path, distant merit and proper investiture will elevate one beyond the mortal dust. Celestial scriptures and secret methods will suddenly arrive—ask the disciple: can you practice thus?\n\nThose who receive the Purity and Brightness method must hold themselves in awe, daily revering their sovereign, honoring their six relations with filial piety, enduring hardship in cultivation, and diligently aiding and delivering others. Within the heart, one should feel as though bearing an unrepayable debt, yet strive to repay it. Thus, the voice softens, the breath calms, and anger dissipates—this is the essence of Purity and Brightness. In one’s dwelling, keep a mirror and a basin of water to understand the intent behind this method.\n\nAll who receive the Purity and Brightness method are recorded by the Celestial Emperor and entrusted with no light duty. Their transgressions are erased in the Northern Bureau, their names inscribed in the Southern Palace. Twelve officials stand before them, twelve behind, accompanying their every move, regardless of purity or filth. Even mortal attendants, who follow one’s left and right, dare not act wantonly. How much less should one disregard these celestial gods, whose names are inscribed in the immortal registers and who guard and protect you?\n\nThose who receive the Purity and Brightness method possess bones of gold and flesh of jade, already in communion with the divine. Their hands judge the hidden yin realms, their words bridge the numinous and wondrous. If one harbors licentiousness, it is as though casting gold and jade into the dirt. Beware of agitation, lest it disturb the qi and blood. When qi and blood remain firm and whole, demonic forces cannot enter, and one attains true perfection, avoiding premature death. The foundation of ascension and transcendence lies in eschewing lust and desire—remember this well.\n\nThose who receive the Purity and Brightness method remain in the world temporarily, as their kalpas are not yet complete, and they do not immediately ascend. Yet by accumulating merit and piling up deeds, they will surely depart the mortal and enter the sacred. Kindness may arise from harm, so do not casually abandon wife and children. Harm may arise from kindness, so do not covet wife and children, lest you drown within the inner chambers. Sever affection with righteousness, relinquish love and emotion, and together ascend to the celestial realms.\n\nAs for those who greedily amass wealth, insatiably craving without end; who harm others to bequeath to their children; who exhaust their bodies and deplete their marrow to please women—all such actions must cease. If one can transform others with the Dao and cultivate together, this is true understanding of the root. Should they refuse, then on the day of your enlightenment, they too will reap vast blessings—why cling to trivial matters of the present?\n\nThose who receive the Purity and Brightness method must prioritize aiding others. Seeing another’s father, another’s mother, regard them as your own. Pity the aged, succor the orphaned, pity the poor, and tend the sick. When others face peril or illness, feel as though it were your own. With such a heart, you grasp the principle herein—remember this.\n\nThose who receive the Purity and Brightness method must value integrity and fairness. Those in office must not rely on wealth and power; the poor must not shame their poverty and lowliness. The Celestial Lord apportions fate without the slightest partiality. I observe that many disciples, after receiving this method, practice with reckless intent, often harming beings. They arbitrarily execute gods and spirits, command thunder and clouds as though ordering servants. The wealthy, when summoned, do not come; the poor, seeing profit, rush to obey. Or, in anger, they curse and employ gods and spirits to exact vengeance and kill foes. They distort celestial decrees, dismantle statutes, and alter characters—all of which I deeply deplore.\n\nThose who receive the Purity and Brightness method, even if they do not ascend to perfection, can achieve liberation through the corpse. Though they may not openly command spirits, the hidden realms will still obey. Do not grow impatient or restless; perseverance is key. Many of my disciples, after receiving the method, fail to measure their accumulated merit and immediately blame their masters. Without an inch of merit, they seek to ascend; lacking divine clarity, they demand the profound mysteries. Let this serve as a warning.\n\nThose who receive the Purity and Brightness method must not recklessly transmit it to others; first, perfect yourself as a master of deliverance. Wait until you perceive, in the unseen realm, that your position is among the officials of yin. When you encounter one whose karmic conditions align, face east, burn incense, and inquire of me. If I permit it, then transmit it. Thus, I am the master of deliverance, and you become the master of transmission.\n\nThe Sun Palace’s Filial Piety Luminous King is the ancestral master. Master Wu is the registrar, Matron Chen the scripture master, and Lord Zhang of the Daily Office the supervising master of deliverance. When dozens of disciples attain the Dao, then one day, upon ascending to perfection, you shall be as I am.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1248,
      "start_sentence": 0,
      "end_sentence": 65,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.49157118797302,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\太上灵宝净明入道品.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "凡得净明法者，以缘合、忠孝、炁血完实、直谅可受之人而传之。 即不得以贫而不授，富而则传。 违之，罪及三世。 凡得净明法者，将欲传度，即具表，奏祖师太阳上帝，依常式醮设三界。 证明谢恩，务在量力，不得举债破费财物，失所吾一时旨喻，不限定仪也。 凡得净明法者，遇人传付之时，即表奏之后，於表奏内，保明弟子九代。 加升仙职，便补为四字仙佐。 其夜书符九道，结草人九个，望天门烧，则此草人化为九直符。 执符以往，不论地狱六道，即此符到处，便得解释。 以此符文，於天枢院请领文字，便是仙官。 如有仙职者，后升阶次。 书符之时，戴日履斗，口传心受，望天门书之。 符朱书 书符咒曰",
      "translated_text": "Those who receive the Purity and Brightness method must transmit it only to those whose karmic conditions align, who embody loyalty and filial piety, whose qi and blood are full and complete, and whose integrity is unyielding. Do not withhold it from the poor nor grant it solely to the wealthy. To violate this is to incur guilt across three generations.\n\nWhen one who has received the Purity and Brightness method seeks to transmit and deliver it, they must prepare a memorial and submit it to the ancestral master, the Supreme Emperor of the Sun Palace, performing the customary jiao rites for the Three Realms to bear witness and give thanks. Act within your means; do not borrow or squander wealth, for this would contravene my immediate decree. There is no fixed ritual.\n\nWhen transmitting the method to another, after submitting the memorial, include within it a pledge attesting to the nine generations of the disciple. Upon their promotion to an immortal office, they shall be appointed as a Four-Character Immortal Aide. That night, inscribe nine talismans and fashion nine straw figures. Burn them facing the Heavenly Gate, and these straw figures shall transform into nine Direct Talismans. With these talismans in hand, one may traverse the Six Paths of Hell without hindrance, for wherever the talisman arrives, liberation follows. Present this talismanic script to the Celestial Pivot Bureau to receive official documents as an immortal officer. Those already holding immortal offices shall ascend in rank thereafter.\n\nWhen inscribing the talismans, wear the sun upon your crown and tread upon the Dipper. Transmit the words orally and receive them in the heart, inscribing them while facing the Heavenly Gate. Write the talismans in cinnabar. The incantation for inscribing the talisman reads:",
      "overlap_context": "ose karmic conditions align, face east, burn incense, and inquire of me. If I permit it, then transmit it. Thus, I am the master of deliverance, and you become the master of transmission.\n\nThe Sun Palace’s Filial Piety Luminous King is the ancestral master. Master Wu is the registrar, Matron Chen the scripture master, and Lord Zhang of the Daily Office the supervising master of deliverance. When dozens of disciples attain the Dao, then one day, upon ascending to perfection, you shall be as I am.",
      "start_char": 1248,
      "end_char": 1531,
      "start_sentence": 66,
      "end_sentence": 79,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.037325859069824,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\太上灵宝净明入道品.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "净明秘典升入仙官。 忠孝之子，福及其亲。 九世蒙秩，受命升仙。 宝箓行处，无不奉以周旋。 急急如律令。 然后，方付上件文字，舆之行持。 掐子文步斗，想日在头上。 太上灵宝净明入道品竟",
      "translated_text": "The *Secret Canon of Pure Clarity* for Ascending to Immortal Office. The loyal and filial child brings blessings upon their kin. For nine generations, they receive rank and are ordained to ascend as immortals. Wherever the precious register is carried, all defer and yield. Hasten, hasten, in accordance with the statutes and ordinances.\n\nThereafter, transmit the aforementioned script and carry it in practice. Clasp the Zi talisman and pace the Dipper, envisioning the sun above your head. Here ends the *Scripture of the Most High Numinous Treasure: Pure Clarity’s Entry into the Dao*.",
      "overlap_context": "alisman arrives, liberation follows. Present this talismanic script to the Celestial Pivot Bureau to receive official documents as an immortal officer. Those already holding immortal offices shall ascend in rank thereafter.\n\nWhen inscribing the talismans, wear the sun upon your crown and tread upon the Dipper. Transmit the words orally and receive them in the heart, inscribing them while facing the Heavenly Gate. Write the talismans in cinnabar. The incantation for inscribing the talisman reads:",
      "start_char": 1531,
      "end_char": 1624,
      "start_sentence": 80,
      "end_sentence": 87,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 3.466719627380371,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\太上灵宝净明入道品.txt",
        "category": "方法类"
      }
    }
  ]
}