{
  "source_id": "太上洞渊三昧神咒斋清旦行道仪",
  "source_file": "chunked_daozang\\太上洞渊三昧神咒斋清旦行道仪.json",
  "total_chunks": 4,
  "total_original_chars": 2771,
  "total_translated_chars": 19019,
  "total_translation_time": 95.47120976448059,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\威仪类\\太上洞渊三昧神咒斋清旦行道仪.txt",
    "category": "威仪类"
  },
  "full_translation": "*The Ritual of Dawn Dao-Recitation for the Supreme Cavernous Abyss Samādhi Divine Incantation Retreat*\n\n**Scripture Title:** *The Ritual of Dawn Dao-Recitation for the Supreme Cavernous Abyss Samādhi Divine Incantation Retreat*\nCompiled by Du Guangting of the Tang Dynasty.\nTwo sections in one scroll.\nSource text: *Daoist Canon of the Zhengtong Era*, Cavernous Mystery Division, Category of Dignified Observances.\n\n*The Ritual of Dawn Dao-Recitation for the Supreme Cavernous Abyss Samādhi Divine Incantation Retreat*\nEdited and revised by Master Guangcheng, Du Guangting.\n\nBefore the Mystic Master, ranks are established, and the recitation begins:\n\"All assembled in the Dao-chamber, each direct your minds and pledge your lives to the Three Treasures.\"\n\nNext, the *Hua-Xia Hymn* is intoned.\nNext, the *Entering the Chamber Incantation*.\nNext, the *Five Directions Incense* is offered, beginning with the East.\nNext, the *Incense for the Imperial Table* is offered.\nNext, each bows to the master, visualizing as prescribed: bowing to the master while envisioning the Azure Cloud Azure Emperor, as in the *Yellow Register Ritual*.\nNext, the *Guardian Spirit Incantation*.\nNext, the *Dharma Drum* is sounded twenty-four times.\nNext, the *Incense Burner Invocation*:\n\n\"Supreme Mystic Origin, Five Numinous Venerable Lord,\nSummon now the Merit-Recording Attendants,\nThe Left and Right Dragon-Tiger Lords,\nThe Incense-Bearing Messengers,\nThe Three Qi Orthodox Spirits—\nHasten to report and ascend, opening the gates to the Three Heavens’ Supreme Mystic Origin Dao Lord.\nYour servant now burns incense on behalf of the retreat sponsor [Name],\nConducting the great retreat of the *Supreme Cavernous Abyss Samādhi Divine Incantation*,\nTo succor and protect the realms of humans and heavens,\nTo dissolve and dispel calamities and misfortunes.\nMay the life-qi of the Supreme Ten Directions’ Orthodox Perfected descend and flow into our bodies.\nMay this petition swiftly reach the presence of the Supreme Mystic Elder, the Utmost Real, the Boundless Dao, the Great Unity Jade Emperor.\"\nEach performs three bows.\n\nNext, each declares their ritual rank:\n\"Disciple of the Three Luminaries of the Supreme Clarity Mystic Capital and Great Cavern,\nUnsurpassed Master of the Three Caverns,\nPresiding over the ritual affairs of the *Samādhi Divine Incantation Great Retreat*,\n[Name], Master of [Sacred Peak] and [Celestial Title],\nLesser Manifestation Perfected.\"\n\nYour servants [Names], with unified sincerity, reverently address:\nThe Primordial Heavenly Venerable of the Void and Spontaneous Origin,\nThe Boundless Dao, the Supreme Great Dao Lord,\nThe Utmost Mystic Elder, the Supreme Mystic Origin Venerable Lord,\nThe Great Sage Perfected who have attained the Dao,\nThe Utmost Real Lords and Venerable Ones,\nThe Great Dharma Masters of the *Cavernous Abyss Samādhi Divine Incantation*,\nThe Thirty-Six Divisions of Venerable Scriptures within the Mysteries,\nThe Supreme Unity of the Upper Prime, the Three Heavens’ Void Cavern,\nThe Myriad Sage Dao Lords,\nThe Twenty-Four Exalted Venerables,\nThe Perfected of the Ten Directions,\nThe Heavenly Immortals, Earthly Immortals, True Immortals, Flying Immortals,\nThe Divine Immortals of the Five Peaks,\nThe Three Treasures’ Majestic Spirits of all heavens and the utmost realms,\nThe Three Realms’ True Numinous Ones who respond to conditions and perceptions.\n\nWe, your servants, have long been favored with profound blessings,\nPresuming to bear the Great Dharma.\nRevering the sacred scriptures and precious formulas,\nWe have been permitted to receive and cultivate them.\"\n\nAt this covenanted hour of proclamation, when transformation is to be declared,\nWe aid and uphold the state, succoring and shielding gods and humans.\nExtending universally to the hidden and the manifest, all are enabled to attain liberation.\nMoreover, having received these sacred commands, how dare we not make them known above?\n\nNext, the reading of the invocation:\nFollowing the meaning of the words, with utmost sincerity and reverence, we perform the fast,\nDirectly beseeching blessings and seeking grace.\nWe, your servants, unworthy of our offices in the Mysteries,\nMust duly comply and act accordingly.\n\nWith solemnity, we array incense and candles, setting forth the altar precincts.\nIn accordance with the rites of the Supreme Unity Heavenly Worthy and the Venerable Elder,\nWe undertake the grand fast of the *Cavernous Abyss Samādhi Divine Incantation*.\nDay and night, we exert ourselves with devotion, reciting scriptures and performing the Dao-circumambulation.\nWe invoke the Five Quarters’ Celestial Emperors and the heavenly officials and soldiers,\nThe majestic spirits of the Three Caverns, the dragon and tiger mounts.\nExpelling rebellious demons, sweeping away pernicious influences,\nDispersing qi and deploying spirits, subduing malevolent forces.\nDispelling calamities and bestowing blessings, aiding the Dao and manifesting its power.\nThe true numinous ones of heaven and earth respond and descend in timely fashion.\n\nAt this pure dawn of the Dao-circumambulation, with the first offering of incense,\nWe dedicate our bodies, spirits, and lives to the Great Dao.\nWe, your servants, prostrate ourselves, dedicating our lives to the Three Supreme Worthies.\nBy this merit, may it flow to the altars of state,\nHonoring the ancestral spirits and former sages.\nAscending to the Purple Palaces of the Perfected, soaring to the Clear Capital,\nRiding the phoenix chariot in circling flight, securing the dragon’s fortune for eternal endurance.\nMay the land be broader than the realms of Yao and the traces of Yu,\nThe imperial destiny more glorious than the eras of Zhou and Han.\nMay the two images be harmonious and tranquil, the three luminaries radiant and bright.\nAfter attaining the Dao, ascending into the formless,\nHarmonizing and uniting with the Dao in truth.\n\nWith the second offering of incense,\nWe dedicate our bodies, spirits, and lives to the Great Dao.\nWe, your servants, prostrate ourselves, dedicating our lives to the Supreme Scriptures.\nBy this merit, may it ascend as prayers for the Emperor:\nMay the two poles stand firm together, the three radiances shine equally bright.\nMay his benevolence equal that of Yao and Tang, his transformative power surpass that of Fuxi and Gao.\nMay the Empress, consorts, and imperial ladies,\nThe Crown Prince and the various princes,\nVirtuously assist the Purple Throne, their achievements upholding the imperial ultimate.\nMay the civil and military ministers, officials within and without,\nBestow impartial grace, bringing harmony and completing transformation.\nMay weapons be forever sheathed, floods and droughts never arise.\nMay plagues and poisons not invade, auspicious signs surely gather.\nMay the eight frontiers and nine wilds attain the winds of purity and tranquility.\nFrom the hidden to the manifest, may all witness the era of ascending peace.\nAfter attaining the Dao, ascending into the formless,\nHarmonizing and uniting with the Dao in truth.\n\nWith the third offering of incense,\nWe dedicate our bodies, spirits, and lives to the Great Dao.\nWe, your servants, prostrate ourselves, dedicating our lives to the Three Great Masters.\nBy this merit, may it flow to the disciple’s household, the nine ancestral generations and seven lineages,\nAnd all the hidden spirits.\nMay they be released from the Earth Prison, born in the Heavenly Mansion of Spirits.\nMay enmities be resolved, transgressions dissolved and pacified.\nMay the disciple’s family and kin, the six relations together,\nReceive blessings and protection from former lives.\nMay the debts and faults of this life and past be entirely absolved through repentance,\nAll calamities and misfortunes extinguished.\nMay true numinous ones protect and guard, virtue and the Dao support and uphold.\nMay misfortunes be cleared away, evil demons crushed and scattered.\nMay heavenly soldiers and divine generals bestow blessings and confer auspicious signs.\nAfter attaining the Dao, ascending into the formless,\nHarmonizing and uniting with the Dao in truth.\n\nNext, the salutation to the quarters.\nNext, the repentance to the quarters.\n\nNext, at the Ghost Gate, visualize the spirits and recite the secret incantation to command the demons.\nNext, circumambulate the void in three revolutions.\nNext, perform the three prostrations.\n\nWith utmost sincerity, bow the head to the ground before the Supreme Boundless Great Dao.\nWith utmost sincerity, bow the head to the ground before the Thirty-Six Divisions of Venerable Scriptures.\nWith utmost sincerity, bow the head to the ground before the Great Dharma Master of the Mysterious Center.\n\nNext, again declare the dharma ranks:\nFulfilling the dharma offices, upholding the Three Mysteries’ divine incantations and the grand purification ritual, so-and-so of such-and-such mountain.\n\nYour servants, so-and-so and others, respectfully and solemnly address:\nThe Supreme Boundless Great Dao, the Most High Mysterious Ancient, the Supreme Mysterious Primordial Lord of the Dao;\nThe Cavern Spirits, Cavern Abyss, Cavern Mystery, and Cavern Truth;\nThe Treasured Might of the Three Mysteries’ Divine Incantations Sutra;\nThe Heavenly Immortals, Earthly Immortals, True Immortals, and Flying Immortals;\nThe Divine Immortals of the Five Peaks;\nThe Perfected Ones of the Ten Directions;\nThe Great Sage Assemblies who have attained the Dao;\nThe Most Perfected Lords and Venerable Masters;\nThe officials and retinues of the Three Realms;\nAll revered numinous beings.\n\nWe, your servants, have presumptuously received this blessed opportunity to tread the dharma gate.\nWe bear the precious scriptures and the profound dharma of the Cavern Abyss.\nOur duty is to proclaim and propagate the wondrous teachings, to deliver and liberate humans and devas.\nTo assist the state and establish merit, to uphold and propagate the true transformation.\n\nSo-and-so, such-and-such official, has requested the performance of the Supreme Divine Incantation Grand Purification.\nWe have arrayed the altar, prepared abundant offerings and sincere gifts.\nWe turn the scriptures and perform the Dao, burn incense and light lamps.\nWe repent and atone for transgressions, dissolve and dispel calamities and faults.\nWe notify the Three Realms and summon the myriad spirits.\nWe invite the twelve hundred officials, heavenly soldiers, and divine generals\nTo exterminate evil and subdue vengeful demons.\nWe pour forth our hidden sincerity, hoping for communion and response.\n\nWe humbly beseech the lofty sages of the ten directions, the Three Supreme Ones of the Most High,\nWhose compassion flows abundantly, whose majestic radiance shines below.\nCommand the heavenly and earthly bureaus, the Five Emperors and Three Officials,\nThe Mount Tai and Fengdu administrations, the officials of the peaks and marshes,\nTo absolve so-and-so, such-and-such official, of the deep-seated stains accumulated\nFrom past lives to the present, through countless kalpas, boundless and immeasurable.\nFormer transgressions unrepented, new sins added thereafter,\nBound in the courts of heaven and earth, the yin and yang repositories,\nWithin the peaks and marshes, the water and fire bureaus.\nSome are entangled in litigation, others marked by punishments.\nThus inviting calamities, with no means to pray and atone.\nOr defiling the Three Luminaries, slighting the Four Great Elements,\nOpenly violating prohibitions, secretly offending the spirits.\nEntangled and enmeshed, beyond recollection.\nThrough this repentance and atonement, we beg for their complete eradication.\nGrant that enmities and debts be harmonized, transgressions and faults cleansed.\nMay offenses be dissolved, calamities transcended.\nMay karmic retributions in the dark abyss all receive pardon.\nMay they roam freely in the celestial realms, be refined and transformed in the blessed courtyards.\nBestow protection and extend auspiciousness, eternally prospering their blessed destiny.\n\nIf there are plagues or illnesses, proceed with the following phrases.\nIf there are no such matters, cease here.\n\nNow, within the nation’s lands and the household’s dwelling,\nEpidemic poisons spread.\nThe children wail piteously, suffering misfortune and violence.\nWe look up to implore the mysterious protection, to pity and deliver the living beings.\n\nAccording to the Orthodox Unity’s statutes of the Three Heavens’ Dharma Masters,\nWe execute the subjugation of demons and control of ghosts, restraining and binding demonic spirits.\nRespectfully, on behalf of so-and-so, such-and-such official,\nWe invoke the Five Supreme High Granary Lords, with one hundred thousand soldiers,\nTo capture and eliminate the ghosts of the Three Mounds and Five Tombs.\nWe invoke the Five Heavenly Bureau Qi-Moving Lords, with one hundred thousand soldiers,\nTo capture and eliminate the ghosts of the one hundred twenty prohibitions, punishments, jealousies, and destructions within so-and-so’s household.\nWe invoke the Five Lords of the Central Bureau’s Upright Qi, riding white chariots and white horses, with one hundred thousand soldiers,\nTo capture and eliminate the ghosts of all evil spirits, demons, and calamities within so-and-so’s household.\nWe invoke the Five Lords of Interrogation and Summoning, with one hundred thousand soldiers,\nTo capture and eliminate the ghosts of so-and-so’s household’s subordinate officials, old qi, earth spirits, and lunar eclipses.\nWe invoke the Five Lords of Qi-Moving and Affliction-Dissolving, Guardians of the Household, with one hundred twenty officials, one hundred thousand soldiers,\nTo capture and eliminate the ghosts of the five poisons, hundred diseases, and adverse qi in so-and-so’s new and old residences.\nWe invoke the Five Heavenly Lords of Fault and Rebellion, with one hundred twenty officials, one hundred thousand soldiers,\nTo capture and eliminate the ghosts of depletion, harm, essence-demons, and those that attract external demons and thieves within so-and-so’s household.\nWe invoke the Five Lords of the Broad Bureau, with one hundred twenty officials, one hundred thousand soldiers,\nTo capture and eliminate the ghosts of the twelve months’ positions, destructive killings, and depletions within so-and-so’s household.\nWe invoke the Five Lords of the Northern City’s Edicts, Transformations, Counsel, and Deliberation, with one hundred twenty officials, one hundred thousand soldiers,\nTo capture and eliminate the ghosts of the northern general’s destruction of the king within so-and-so’s household.\nWe invoke the One Thousand Two Hundred Heavenly Heart Censors and Attendants, with one hundred thousand soldiers,\nTo capture and eliminate the ghosts of seasonal epidemics, five poisons, pestilential qi, and diseases within so-and-so’s household.\nWe invoke the Five Lords of the Level Heaven, with one hundred twenty officials, one hundred thousand soldiers,\nTo capture and eliminate the ghosts of punishments, curses, and ancestral temple qi within so-and-so’s household.\nWe invoke the Five Supreme Lords of Great Harmony, with one hundred twenty officials, one hundred thousand soldiers,\nTo capture and eliminate the ghosts of mountain spirits, wild ways, five divisions of soldiers, and hunting within so-and-so’s household.\nWe invoke the Five Lords of Spirit-Gathering and Supreme Clarity, with one hundred twenty officials, one hundred thousand soldiers,\nTo capture and eliminate the ghosts that deplete and disturb human spirits, frighten and agitate souls, causing restless dreams within so-and-so’s household.\n\nThe twelve divisions of heavenly officials, soldiers, and troops, all assembled in their ranks, descend in timely response.\nThey encircle the courtyard and dwelling, arraying the eight directions.\nAbove, they shake thunder and lightning; on all sides, they deploy their formations.\nWithin the household’s inner and outer precincts, they search and capture the wicked and evil,\nSevering filth and executing the malevolent, burning and sweeping away demonic afflictions.\nThe old qi of the Six Heavens, the essences of the myriad elders,\nThe thousand ghosts and ten thousand spirits, the epidemic poisons of the five directions,\nThe mountain spirits and strange lights, the inner and outer strongholds,\nThe lingering punishments and flowing calamities, the earth lords’ harmful qi,\nThe stellar illuminations and continuous misfortunes, the karmic retributions not of the deceased,\nThe newly dead and long departed, the yin and yang killings,\nThe qi of punishments and curses, the jealous ghosts and envious spirits—\nAll are captured, exterminated, and eradicated, forever severed and cut off.\nThe lords of yin and yang, all the orthodox spirits,\nSecurely guard the directions, repelling and expelling the false and perverse.\n\nShould any violate prohibitions or disturb the dragon spirits,\nThrough prayers, repentance, and expiation, transform misfortune into fortune.\n\nThe seventy-two ranks of spirits—those of punishment and virtue—assist the Dao and pacify the people, dispelling disaster and bringing forth fortune. Offenses and transgressions are absolved; illness and misfortune cannot intrude. Some say it is complete healing. Nine generations and seven mysteries ascend to heaven and realize the Dao. Attaining auspicious blessings, they forever preserve peace and tranquility. On the day when merits are proclaimed, ranks are elevated and rewards bestowed. For private households, this brings their own abundant blessings. To be continued hereafter.\n\nSupreme prayers:\nMay heaven and earth shine in harmony, sun and moon remain steadfast in clarity.\nMay the five planets follow their constant course, all directions enjoy prosperity.\nMay the imperial enterprise stand firm, the sage’s longevity extend far.\nMay the altars of soil and grain be revered and numinous, ancestral and former sages be honored.\nMay the precious reign flourish, its blessings extending throughout the realm.\nMay ministers serve with loyalty and integrity, millet and grain yield abundant harvests.\nMay weapons of war sheathe themselves, auspicious signs manifest far and wide.\nMay the myriad states pay homage to the court, the remotest lands present tribute.\n\nFor this household, the flow of qi spreads, the power of goodness permeates.\nAuspicious blessings renew daily, kin and relations share in fortune.\nThe three realms and six destinies, all creatures that fly or sink—\nWherever the sagely grace reaches, all under heaven are wholly saved.\n\nAbove, this manifests the great compassion of the Heavenly Worthy;\nBelow, it answers the sincere repentance of this servant and the assembly.\nRespectfully offered.\n\n[Next: the Twelve Vows]\n[Next: the Incense Burner Incantation]\n[Next: the Study of Immortality]\n[Next: the Exiting-the-Door Incantation]\n[Next: Offering Incense before the Mysterious Master]\n[Next: the Dedication and Praise]\n[Next: the Dispersal of Punishments as per the usual rite]\n\nThe *Dawn Ritual of the Wondrous Samādhi Divine Incantations of the Cavernous Abyss* of the Most High is now complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上洞渊三昧神咒斋清旦行道仪 经名：太上洞渊三昧神咒斋清旦行道仪。 唐杜光庭编。 二仪同卷。 底本出处：《正统道藏》洞玄部威仪类。 太上洞渊三昧神咒斋清旦行道仪 广成先生杜光庭删定 於玄师前立班定，唱道： 道场众等人，各运心归命三宝。 次华夏赞引 次入户咒 次上五方香东方为始。 次上御案香 次各礼师存念如法礼师思青云青 帝，如黄线仪。 次卫灵咒 次呜法鼓二十四通 次发炉咒 太上玄元五灵老君，当召功曹使者，左右龙虎君，捧香使者，三气正神，急上关启三天太上玄元道君。 臣今正尔烧香，奉为斋官某乙，修太上洞渊三昧神咒大斋，拯护人天，消禳灾沴。 愿得太上十方正真生气，降流臣等身中。 所启速达，径御太上玄老至真无极大道太一玉皇帝御前。 人各三礼。 次各称法位 上清玄都大洞三景弟子无上三洞法师，奉行三昧神咒大斋法事，某岳某帝先生，小兆真人。 臣某等，同诚上启：虚无自然元始天尊，无极大道太上大道君，无上玄老太上玄元老君，已得道大圣众，至真诸君丈人，通玄洞渊三昧神咒三十六部尊经玄中大法师，上元太一空洞三天太真，万圣道主，二十四高尊，十方真人，天仙地仙真仙飞仙，五岳神仙，诸天至极三宝威神，随机应感三界真灵。 臣等夙荷玄休，叨佩大法。 尊经宝诀，得以禀修。",
      "translated_text": "*The Ritual of Dawn Dao-Recitation for the Supreme Cavernous Abyss Samādhi Divine Incantation Retreat*\n\n**Scripture Title:** *The Ritual of Dawn Dao-Recitation for the Supreme Cavernous Abyss Samādhi Divine Incantation Retreat*\nCompiled by Du Guangting of the Tang Dynasty.\nTwo sections in one scroll.\nSource text: *Daoist Canon of the Zhengtong Era*, Cavernous Mystery Division, Category of Dignified Observances.\n\n*The Ritual of Dawn Dao-Recitation for the Supreme Cavernous Abyss Samādhi Divine Incantation Retreat*\nEdited and revised by Master Guangcheng, Du Guangting.\n\nBefore the Mystic Master, ranks are established, and the recitation begins:\n\"All assembled in the Dao-chamber, each direct your minds and pledge your lives to the Three Treasures.\"\n\nNext, the *Hua-Xia Hymn* is intoned.\nNext, the *Entering the Chamber Incantation*.\nNext, the *Five Directions Incense* is offered, beginning with the East.\nNext, the *Incense for the Imperial Table* is offered.\nNext, each bows to the master, visualizing as prescribed: bowing to the master while envisioning the Azure Cloud Azure Emperor, as in the *Yellow Register Ritual*.\nNext, the *Guardian Spirit Incantation*.\nNext, the *Dharma Drum* is sounded twenty-four times.\nNext, the *Incense Burner Invocation*:\n\n\"Supreme Mystic Origin, Five Numinous Venerable Lord,\nSummon now the Merit-Recording Attendants,\nThe Left and Right Dragon-Tiger Lords,\nThe Incense-Bearing Messengers,\nThe Three Qi Orthodox Spirits—\nHasten to report and ascend, opening the gates to the Three Heavens’ Supreme Mystic Origin Dao Lord.\nYour servant now burns incense on behalf of the retreat sponsor [Name],\nConducting the great retreat of the *Supreme Cavernous Abyss Samādhi Divine Incantation*,\nTo succor and protect the realms of humans and heavens,\nTo dissolve and dispel calamities and misfortunes.\nMay the life-qi of the Supreme Ten Directions’ Orthodox Perfected descend and flow into our bodies.\nMay this petition swiftly reach the presence of the Supreme Mystic Elder, the Utmost Real, the Boundless Dao, the Great Unity Jade Emperor.\"\nEach performs three bows.\n\nNext, each declares their ritual rank:\n\"Disciple of the Three Luminaries of the Supreme Clarity Mystic Capital and Great Cavern,\nUnsurpassed Master of the Three Caverns,\nPresiding over the ritual affairs of the *Samādhi Divine Incantation Great Retreat*,\n[Name], Master of [Sacred Peak] and [Celestial Title],\nLesser Manifestation Perfected.\"\n\nYour servants [Names], with unified sincerity, reverently address:\nThe Primordial Heavenly Venerable of the Void and Spontaneous Origin,\nThe Boundless Dao, the Supreme Great Dao Lord,\nThe Utmost Mystic Elder, the Supreme Mystic Origin Venerable Lord,\nThe Great Sage Perfected who have attained the Dao,\nThe Utmost Real Lords and Venerable Ones,\nThe Great Dharma Masters of the *Cavernous Abyss Samādhi Divine Incantation*,\nThe Thirty-Six Divisions of Venerable Scriptures within the Mysteries,\nThe Supreme Unity of the Upper Prime, the Three Heavens’ Void Cavern,\nThe Myriad Sage Dao Lords,\nThe Twenty-Four Exalted Venerables,\nThe Perfected of the Ten Directions,\nThe Heavenly Immortals, Earthly Immortals, True Immortals, Flying Immortals,\nThe Divine Immortals of the Five Peaks,\nThe Three Treasures’ Majestic Spirits of all heavens and the utmost realms,\nThe Three Realms’ True Numinous Ones who respond to conditions and perceptions.\n\nWe, your servants, have long been favored with profound blessings,\nPresuming to bear the Great Dharma.\nRevering the sacred scriptures and precious formulas,\nWe have been permitted to receive and cultivate them.\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 552,
      "start_sentence": 0,
      "end_sentence": 27,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.732953310012817,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\太上洞渊三昧神咒斋清旦行道仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "而盟告之辰，约当宣化。 辅赞邦国，济护天人。 普及幽明，咸令开度。 况奉词旨，敢不上闻。 次读词 按如词言义，惟丹切虔修斋，直请福希恩。 臣等忝职玄司，所宜遵副是用。 肃严香烛，敷列坛场。 依太一天尊，玄老具典，奉修洞渊三昧神咒大斋。 夙夜翘勤，转经行道。 请五方上帝及天官吏兵，三洞威神，龙虎骑乘。 驱除妖逆，扫荡氛邪。 布气行神，降伏魔祟。 消灾致福，助道宣威。 天地真灵，应时感降。 以今清旦行道，初捻上香，归身归神归命大道。 臣等首体投地，归命太上三尊。 以是功德，归流社稷，尊灵宗桃先圣。 升真紫阙，腾景清都。 乘凤辇以徊翔，福龙图於延永。 地广於尧对禹迹，祚隆於周历汉年。 二象和宁，三光昭朗。 得道之后，升入无形，和与道合真。 以今二捻上香，归、身归神归命大道。 臣等首体投地，归命太上尊经。 以是功德，上祝皇帝，二仪并固，三景齐明。 仁格尧汤，化超羲嗥。 后妃嫔主，太子诸王，德赞紫宸，功扶皇极。 文武卿佐，中外职僚，敷恩泽以无私，致雍熙而成化。 干戈永戢，水旱不兴。 疫毒无侵，休祥允萃。 八弦九野，克臻清静之风。 自幽及明，共睹升平之运。 得道之后，升入无形，和与道合真。 以今三捻上香，归身归神归命大道。 臣等首体投地，归命太大三师。 以是功德，归流弟子某家，九玄七祖，一切幽灵。 释罪地司，生神天府。 冤仇和解，罪迭消平。 某家眷属，六亲同臻，福佑前生。 今世往债宿瑕，俱乘忏谢之缘，尽息灾凶之咎。 真灵佑护，道德匡扶。 厄运清消，邪魔摧荡。 天兵神将，介福垂祥。 得道之后，升入无形，和与道合真。 次礼方 次忏方",
      "translated_text": "At this covenanted hour of proclamation, when transformation is to be declared,\nWe aid and uphold the state, succoring and shielding gods and humans.\nExtending universally to the hidden and the manifest, all are enabled to attain liberation.\nMoreover, having received these sacred commands, how dare we not make them known above?\n\nNext, the reading of the invocation:\nFollowing the meaning of the words, with utmost sincerity and reverence, we perform the fast,\nDirectly beseeching blessings and seeking grace.\nWe, your servants, unworthy of our offices in the Mysteries,\nMust duly comply and act accordingly.\n\nWith solemnity, we array incense and candles, setting forth the altar precincts.\nIn accordance with the rites of the Supreme Unity Heavenly Worthy and the Venerable Elder,\nWe undertake the grand fast of the *Cavernous Abyss Samādhi Divine Incantation*.\nDay and night, we exert ourselves with devotion, reciting scriptures and performing the Dao-circumambulation.\nWe invoke the Five Quarters’ Celestial Emperors and the heavenly officials and soldiers,\nThe majestic spirits of the Three Caverns, the dragon and tiger mounts.\nExpelling rebellious demons, sweeping away pernicious influences,\nDispersing qi and deploying spirits, subduing malevolent forces.\nDispelling calamities and bestowing blessings, aiding the Dao and manifesting its power.\nThe true numinous ones of heaven and earth respond and descend in timely fashion.\n\nAt this pure dawn of the Dao-circumambulation, with the first offering of incense,\nWe dedicate our bodies, spirits, and lives to the Great Dao.\nWe, your servants, prostrate ourselves, dedicating our lives to the Three Supreme Worthies.\nBy this merit, may it flow to the altars of state,\nHonoring the ancestral spirits and former sages.\nAscending to the Purple Palaces of the Perfected, soaring to the Clear Capital,\nRiding the phoenix chariot in circling flight, securing the dragon’s fortune for eternal endurance.\nMay the land be broader than the realms of Yao and the traces of Yu,\nThe imperial destiny more glorious than the eras of Zhou and Han.\nMay the two images be harmonious and tranquil, the three luminaries radiant and bright.\nAfter attaining the Dao, ascending into the formless,\nHarmonizing and uniting with the Dao in truth.\n\nWith the second offering of incense,\nWe dedicate our bodies, spirits, and lives to the Great Dao.\nWe, your servants, prostrate ourselves, dedicating our lives to the Supreme Scriptures.\nBy this merit, may it ascend as prayers for the Emperor:\nMay the two poles stand firm together, the three radiances shine equally bright.\nMay his benevolence equal that of Yao and Tang, his transformative power surpass that of Fuxi and Gao.\nMay the Empress, consorts, and imperial ladies,\nThe Crown Prince and the various princes,\nVirtuously assist the Purple Throne, their achievements upholding the imperial ultimate.\nMay the civil and military ministers, officials within and without,\nBestow impartial grace, bringing harmony and completing transformation.\nMay weapons be forever sheathed, floods and droughts never arise.\nMay plagues and poisons not invade, auspicious signs surely gather.\nMay the eight frontiers and nine wilds attain the winds of purity and tranquility.\nFrom the hidden to the manifest, may all witness the era of ascending peace.\nAfter attaining the Dao, ascending into the formless,\nHarmonizing and uniting with the Dao in truth.\n\nWith the third offering of incense,\nWe dedicate our bodies, spirits, and lives to the Great Dao.\nWe, your servants, prostrate ourselves, dedicating our lives to the Three Great Masters.\nBy this merit, may it flow to the disciple’s household, the nine ancestral generations and seven lineages,\nAnd all the hidden spirits.\nMay they be released from the Earth Prison, born in the Heavenly Mansion of Spirits.\nMay enmities be resolved, transgressions dissolved and pacified.\nMay the disciple’s family and kin, the six relations together,\nReceive blessings and protection from former lives.\nMay the debts and faults of this life and past be entirely absolved through repentance,\nAll calamities and misfortunes extinguished.\nMay true numinous ones protect and guard, virtue and the Dao support and uphold.\nMay misfortunes be cleared away, evil demons crushed and scattered.\nMay heavenly soldiers and divine generals bestow blessings and confer auspicious signs.\nAfter attaining the Dao, ascending into the formless,\nHarmonizing and uniting with the Dao in truth.\n\nNext, the salutation to the quarters.\nNext, the repentance to the quarters.",
      "overlap_context": "en Directions,\nThe Heavenly Immortals, Earthly Immortals, True Immortals, Flying Immortals,\nThe Divine Immortals of the Five Peaks,\nThe Three Treasures’ Majestic Spirits of all heavens and the utmost realms,\nThe Three Realms’ True Numinous Ones who respond to conditions and perceptions.\n\nWe, your servants, have long been favored with profound blessings,\nPresuming to bear the Great Dharma.\nRevering the sacred scriptures and precious formulas,\nWe have been permitted to receive and cultivate them.\"",
      "start_char": 552,
      "end_char": 1194,
      "start_sentence": 28,
      "end_sentence": 74,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.05548667907715,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\太上洞渊三昧神咒斋清旦行道仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "次於鬼门上存神命魔密咒 次步虚旋行三周 次三礼 至心稽首，太上无极大道。 至心稽首，三十六部尊经。 至心稽首，玄中大法师。 次重称法位 具法职，奉行三昧神咒大斋法事，某岳先生。 臣某等，谨重上启：太上无极大道无上玄老太上玄元老君，洞神洞渊洞玄洞真，三昧神咒经宝威神，天仙地仙真仙飞仙，五岳神仙，十方真人，已得道大圣众，至真诸君丈人，三界官属，一切尊灵。 臣等叨承福会，获履法门。 参佩宝经，洞渊大法。 职当宣弘妙旨，济度人天。 佐国立功，奉扬正化。 某官某乙，请修无上神咒大斋。 敷列坛场，精丰信币。 转经行道，烧香然灯。 忏谢罪尤，解消灾咎。 关告三界，延降万神。 请千二百官天兵将吏，诛除妖恶，摧伏冤魔。 沥恳冥心，以期通感。 伏惟十方高圣，太上三尊，慈泽滂流，威光下烛。 勑天司地府，五帝三官，太山酆都，岳渍官属，赦除某官某乙前生今世，亿劫以来积迭深瑕，无边无量。 前恶未忏，后罪又加。 结在天地之曹，阴阳之府，岳渍之内，水火之司。 或讼逮所延，考罚所注。 致招灾咎，祈谢无由。 或秽慢三光，轻凌四大。 明干禁忌，幽触神祇。 结固缠绵，不可忆识。 因今忏谢，并乞荡除。 赐冤债和平，愆尤除涤。 原销触犯，超度灾凶。 罪对幽渊，咸蒙赦宥。 从容天界，炼化福庭。 垂佑延祥，永隆嘉祚。 若有灾疾，即次用下句。 若无事即已。 今以国土，居宅之内。 疫毒流行。 赤子嗷嗷，坐罹凶横。 仰祈玄佑，愍济生灵。 臣按三天法师正一科品，诛邪制鬼，收束魔灵。 谨为某官某乙，谒请无上高仓君五人，兵士十万人，主为收除三丘五墓之鬼。 谒请天曹运气君五人，兵士十万人，主收除某家百二十禁忌刑杀嫉拓之鬼。 谒请都曹正气素车白马君五人，兵士十万人，主收除某家众邪妖精祸害之鬼。 谒请考召君五人，兵士十万人，收除某家下官故气土精月食之鬼。 谒请运气解患守宅君五人，官将百二十人，兵士十万人，主收除某家新宅故宅五毒百病逆气之鬼。 谒请天上咎逆君五人，官将百二十人，兵士十万人，主收除某家耗害精邪招引外魔盗贼之鬼。 谒请广司君五人，官将百二十人，兵士十万人，收除某家十二月位破杀虚耗之鬼。 谒请北城诏命化喻谋议君五人，官将百二十人，兵士十万人，收除某家北将破王之鬼。 谒请天心刺史从事一千二百人，兵士十万人，主收除某家时行五毒温疫气病剖剔之鬼。 谒请平天君五人，官将百二十人，兵士十万人，收除某家刑祷咒诅房庙考气之鬼。 谒请无上太和君五人，官将百二十人，兵士十万人，收除某家魍魉野道五部兵猎游□之鬼。 谒请收神上明君五人，官将百二十人，兵士十万人，收除某家耗乱人神恐动魂魄梦寐不安之鬼。 一十二部天官吏兵，一合具官，应时临降。 周币庭宇，罗列八方。 上震雷霆，旁布行阵。 於宫宅内外搜捕奸邪，剪秽诛凶，焚荡妖沴。 六天故气，众老之精。 千鬼万神，五方疫毒。 魍魉光怪，中外强□。 宿考流殃，及土公害气。 星烛复连，咎注非尸。 新死故亡，雌雄逆杀。 刑祷之气，妬鬼神。 收灭诛锄，永令断绝。 阴阳主宰，一切正神。 安镇方隅，辟斥邪妄。 若有犯干禁忌，惊扰龙神，祈谢修禳，回凶就吉。",
      "translated_text": "Next, at the Ghost Gate, visualize the spirits and recite the secret incantation to command the demons.\nNext, circumambulate the void in three revolutions.\nNext, perform the three prostrations.\n\nWith utmost sincerity, bow the head to the ground before the Supreme Boundless Great Dao.\nWith utmost sincerity, bow the head to the ground before the Thirty-Six Divisions of Venerable Scriptures.\nWith utmost sincerity, bow the head to the ground before the Great Dharma Master of the Mysterious Center.\n\nNext, again declare the dharma ranks:\nFulfilling the dharma offices, upholding the Three Mysteries’ divine incantations and the grand purification ritual, so-and-so of such-and-such mountain.\n\nYour servants, so-and-so and others, respectfully and solemnly address:\nThe Supreme Boundless Great Dao, the Most High Mysterious Ancient, the Supreme Mysterious Primordial Lord of the Dao;\nThe Cavern Spirits, Cavern Abyss, Cavern Mystery, and Cavern Truth;\nThe Treasured Might of the Three Mysteries’ Divine Incantations Sutra;\nThe Heavenly Immortals, Earthly Immortals, True Immortals, and Flying Immortals;\nThe Divine Immortals of the Five Peaks;\nThe Perfected Ones of the Ten Directions;\nThe Great Sage Assemblies who have attained the Dao;\nThe Most Perfected Lords and Venerable Masters;\nThe officials and retinues of the Three Realms;\nAll revered numinous beings.\n\nWe, your servants, have presumptuously received this blessed opportunity to tread the dharma gate.\nWe bear the precious scriptures and the profound dharma of the Cavern Abyss.\nOur duty is to proclaim and propagate the wondrous teachings, to deliver and liberate humans and devas.\nTo assist the state and establish merit, to uphold and propagate the true transformation.\n\nSo-and-so, such-and-such official, has requested the performance of the Supreme Divine Incantation Grand Purification.\nWe have arrayed the altar, prepared abundant offerings and sincere gifts.\nWe turn the scriptures and perform the Dao, burn incense and light lamps.\nWe repent and atone for transgressions, dissolve and dispel calamities and faults.\nWe notify the Three Realms and summon the myriad spirits.\nWe invite the twelve hundred officials, heavenly soldiers, and divine generals\nTo exterminate evil and subdue vengeful demons.\nWe pour forth our hidden sincerity, hoping for communion and response.\n\nWe humbly beseech the lofty sages of the ten directions, the Three Supreme Ones of the Most High,\nWhose compassion flows abundantly, whose majestic radiance shines below.\nCommand the heavenly and earthly bureaus, the Five Emperors and Three Officials,\nThe Mount Tai and Fengdu administrations, the officials of the peaks and marshes,\nTo absolve so-and-so, such-and-such official, of the deep-seated stains accumulated\nFrom past lives to the present, through countless kalpas, boundless and immeasurable.\nFormer transgressions unrepented, new sins added thereafter,\nBound in the courts of heaven and earth, the yin and yang repositories,\nWithin the peaks and marshes, the water and fire bureaus.\nSome are entangled in litigation, others marked by punishments.\nThus inviting calamities, with no means to pray and atone.\nOr defiling the Three Luminaries, slighting the Four Great Elements,\nOpenly violating prohibitions, secretly offending the spirits.\nEntangled and enmeshed, beyond recollection.\nThrough this repentance and atonement, we beg for their complete eradication.\nGrant that enmities and debts be harmonized, transgressions and faults cleansed.\nMay offenses be dissolved, calamities transcended.\nMay karmic retributions in the dark abyss all receive pardon.\nMay they roam freely in the celestial realms, be refined and transformed in the blessed courtyards.\nBestow protection and extend auspiciousness, eternally prospering their blessed destiny.\n\nIf there are plagues or illnesses, proceed with the following phrases.\nIf there are no such matters, cease here.\n\nNow, within the nation’s lands and the household’s dwelling,\nEpidemic poisons spread.\nThe children wail piteously, suffering misfortune and violence.\nWe look up to implore the mysterious protection, to pity and deliver the living beings.\n\nAccording to the Orthodox Unity’s statutes of the Three Heavens’ Dharma Masters,\nWe execute the subjugation of demons and control of ghosts, restraining and binding demonic spirits.\nRespectfully, on behalf of so-and-so, such-and-such official,\nWe invoke the Five Supreme High Granary Lords, with one hundred thousand soldiers,\nTo capture and eliminate the ghosts of the Three Mounds and Five Tombs.\nWe invoke the Five Heavenly Bureau Qi-Moving Lords, with one hundred thousand soldiers,\nTo capture and eliminate the ghosts of the one hundred twenty prohibitions, punishments, jealousies, and destructions within so-and-so’s household.\nWe invoke the Five Lords of the Central Bureau’s Upright Qi, riding white chariots and white horses, with one hundred thousand soldiers,\nTo capture and eliminate the ghosts of all evil spirits, demons, and calamities within so-and-so’s household.\nWe invoke the Five Lords of Interrogation and Summoning, with one hundred thousand soldiers,\nTo capture and eliminate the ghosts of so-and-so’s household’s subordinate officials, old qi, earth spirits, and lunar eclipses.\nWe invoke the Five Lords of Qi-Moving and Affliction-Dissolving, Guardians of the Household, with one hundred twenty officials, one hundred thousand soldiers,\nTo capture and eliminate the ghosts of the five poisons, hundred diseases, and adverse qi in so-and-so’s new and old residences.\nWe invoke the Five Heavenly Lords of Fault and Rebellion, with one hundred twenty officials, one hundred thousand soldiers,\nTo capture and eliminate the ghosts of depletion, harm, essence-demons, and those that attract external demons and thieves within so-and-so’s household.\nWe invoke the Five Lords of the Broad Bureau, with one hundred twenty officials, one hundred thousand soldiers,\nTo capture and eliminate the ghosts of the twelve months’ positions, destructive killings, and depletions within so-and-so’s household.\nWe invoke the Five Lords of the Northern City’s Edicts, Transformations, Counsel, and Deliberation, with one hundred twenty officials, one hundred thousand soldiers,\nTo capture and eliminate the ghosts of the northern general’s destruction of the king within so-and-so’s household.\nWe invoke the One Thousand Two Hundred Heavenly Heart Censors and Attendants, with one hundred thousand soldiers,\nTo capture and eliminate the ghosts of seasonal epidemics, five poisons, pestilential qi, and diseases within so-and-so’s household.\nWe invoke the Five Lords of the Level Heaven, with one hundred twenty officials, one hundred thousand soldiers,\nTo capture and eliminate the ghosts of punishments, curses, and ancestral temple qi within so-and-so’s household.\nWe invoke the Five Supreme Lords of Great Harmony, with one hundred twenty officials, one hundred thousand soldiers,\nTo capture and eliminate the ghosts of mountain spirits, wild ways, five divisions of soldiers, and hunting within so-and-so’s household.\nWe invoke the Five Lords of Spirit-Gathering and Supreme Clarity, with one hundred twenty officials, one hundred thousand soldiers,\nTo capture and eliminate the ghosts that deplete and disturb human spirits, frighten and agitate souls, causing restless dreams within so-and-so’s household.\n\nThe twelve divisions of heavenly officials, soldiers, and troops, all assembled in their ranks, descend in timely response.\nThey encircle the courtyard and dwelling, arraying the eight directions.\nAbove, they shake thunder and lightning; on all sides, they deploy their formations.\nWithin the household’s inner and outer precincts, they search and capture the wicked and evil,\nSevering filth and executing the malevolent, burning and sweeping away demonic afflictions.\nThe old qi of the Six Heavens, the essences of the myriad elders,\nThe thousand ghosts and ten thousand spirits, the epidemic poisons of the five directions,\nThe mountain spirits and strange lights, the inner and outer strongholds,\nThe lingering punishments and flowing calamities, the earth lords’ harmful qi,\nThe stellar illuminations and continuous misfortunes, the karmic retributions not of the deceased,\nThe newly dead and long departed, the yin and yang killings,\nThe qi of punishments and curses, the jealous ghosts and envious spirits—\nAll are captured, exterminated, and eradicated, forever severed and cut off.\nThe lords of yin and yang, all the orthodox spirits,\nSecurely guard the directions, repelling and expelling the false and perverse.\n\nShould any violate prohibitions or disturb the dragon spirits,\nThrough prayers, repentance, and expiation, transform misfortune into fortune.",
      "overlap_context": "be entirely absolved through repentance,\nAll calamities and misfortunes extinguished.\nMay true numinous ones protect and guard, virtue and the Dao support and uphold.\nMay misfortunes be cleared away, evil demons crushed and scattered.\nMay heavenly soldiers and divine generals bestow blessings and confer auspicious signs.\nAfter attaining the Dao, ascending into the formless,\nHarmonizing and uniting with the Dao in truth.\n\nNext, the salutation to the quarters.\nNext, the repentance to the quarters.",
      "start_char": 1194,
      "end_char": 2425,
      "start_sentence": 75,
      "end_sentence": 143,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.14710545539856,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\太上洞渊三昧神咒斋清旦行道仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "七十二位，刑德众神，助道安人，祛灾致福。 罪咎蠲释，疾厄无侵。 或云痊平。 九世七玄，生天证道。 克臻祯贶，常保安宁。 言功之辰，加爵进赏。 若私家，即自嘉祚。 后续此。 上愿乾坤昭 泰，日月贞明。 五纬顺常，万方康乐。 帝图隆固，圣寿遐长。 社稷尊灵，宗桃先圣。 惟昌宝历，孚佑寰区。 臣仕忠贞，黍稷丰稔。 兵戈自戢，符瑞彰闻。 万国朝宗，穷荒入贡。 某家道气流布，善力资熏。 嘉祚日新，亲缘同福。 三徒六趣，蠢动飞沉。 圣泽所覃，普天全济。 上明天尊大慈之施，下副臣众等忏谢之诚。 谨启。 次十二愿 次复炉咒 次学仙 次出户咒 次玄师前上香 次回向赞 次弹罚散如常仪 太上洞渊三昧神咒斋清旦行道仪竟",
      "translated_text": "The seventy-two ranks of spirits—those of punishment and virtue—assist the Dao and pacify the people, dispelling disaster and bringing forth fortune. Offenses and transgressions are absolved; illness and misfortune cannot intrude. Some say it is complete healing. Nine generations and seven mysteries ascend to heaven and realize the Dao. Attaining auspicious blessings, they forever preserve peace and tranquility. On the day when merits are proclaimed, ranks are elevated and rewards bestowed. For private households, this brings their own abundant blessings. To be continued hereafter.\n\nSupreme prayers:\nMay heaven and earth shine in harmony, sun and moon remain steadfast in clarity.\nMay the five planets follow their constant course, all directions enjoy prosperity.\nMay the imperial enterprise stand firm, the sage’s longevity extend far.\nMay the altars of soil and grain be revered and numinous, ancestral and former sages be honored.\nMay the precious reign flourish, its blessings extending throughout the realm.\nMay ministers serve with loyalty and integrity, millet and grain yield abundant harvests.\nMay weapons of war sheathe themselves, auspicious signs manifest far and wide.\nMay the myriad states pay homage to the court, the remotest lands present tribute.\n\nFor this household, the flow of qi spreads, the power of goodness permeates.\nAuspicious blessings renew daily, kin and relations share in fortune.\nThe three realms and six destinies, all creatures that fly or sink—\nWherever the sagely grace reaches, all under heaven are wholly saved.\n\nAbove, this manifests the great compassion of the Heavenly Worthy;\nBelow, it answers the sincere repentance of this servant and the assembly.\nRespectfully offered.\n\n[Next: the Twelve Vows]\n[Next: the Incense Burner Incantation]\n[Next: the Study of Immortality]\n[Next: the Exiting-the-Door Incantation]\n[Next: Offering Incense before the Mysterious Master]\n[Next: the Dedication and Praise]\n[Next: the Dispersal of Punishments as per the usual rite]\n\nThe *Dawn Ritual of the Wondrous Samādhi Divine Incantations of the Cavernous Abyss* of the Most High is now complete.",
      "overlap_context": "the deceased,\nThe newly dead and long departed, the yin and yang killings,\nThe qi of punishments and curses, the jealous ghosts and envious spirits—\nAll are captured, exterminated, and eradicated, forever severed and cut off.\nThe lords of yin and yang, all the orthodox spirits,\nSecurely guard the directions, repelling and expelling the false and perverse.\n\nShould any violate prohibitions or disturb the dragon spirits,\nThrough prayers, repentance, and expiation, transform misfortune into fortune.",
      "start_char": 2425,
      "end_char": 2724,
      "start_sentence": 144,
      "end_sentence": 174,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.535664319992065,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\太上洞渊三昧神咒斋清旦行道仪.txt",
        "category": "威仪类"
      }
    }
  ]
}