{
  "source_id": "太上通灵八史圣文真形图",
  "source_file": "chunked_daozang\\太上通灵八史圣文真形图.json",
  "total_chunks": 3,
  "total_original_chars": 3674,
  "total_translated_chars": 22760,
  "total_translation_time": 110.86743354797363,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\灵图类\\太上通灵八史圣文真形图.txt",
    "category": "灵图类"
  },
  "full_translation": "**The Supreme Peripheral Numinous Eight Historians’ Sacred Text of True Forms**\n\n**Scripture Title:** *The Supreme Peripheral Numinous Eight Historians’ Sacred Text of True Forms*. Author unknown. One scroll. Base text from: *Daoist Canon of the Zhengtong Era*, *Dongshen* Section, *Lingtu* (Numinous Charts) Category.\n\n---\n\n**The Supreme Peripheral Numinous Eight Historians’ Sacred Text of True Forms**\n\nThe Celestial Historian of the August Heaven is named *Lingang* (Approaching Ridge).\nThe Celestial Historian of the Lofty Heaven is named *Jiangang* (Establishing Ridge).\nThe Celestial Historian of the Heavenly Thearch is named *Tiangang* (Heavenly Ridge).\nThe Celestial Historian of the Supreme Thearch is named *Riyuan* (Sun’s Source).\n\n**First Historian:** Husband, *Lingang*; wife, *Zhuxia* (Pillar Below).\nActive on *si*, *wu*, and *wei* days, residing in households. Attired in red robes, with divided hems, white brush, and *jinxian* cap.\n\n**Second Historian:** Husband, *Jiangang*; wife, *Xuanjing* (Mysterious Essence).\nActive on *shen*, *you*, and *xu* days, residing in households. Attired in white robes, with divided seams, white brush, and *jinxian* cap.\n\n**Third Historian:** Husband, *Tiangang*; wife, *Yuejing* (Moon’s Essence).\nActive on *hai*, *zi*, and *chou* days, residing in households. Attired in black robes, with divided hems, white brush, and *jinxian* cap.\n\n**Fourth Historian:** Husband, *Riyuan*; wife, *Taixuan* (Supreme Mystery).\nActive on *yin*, *mao*, and *chen* days, residing in households. Attired in green robes, with divided hems, white brush, and *jinxian* cap.\n\nThese eight historians’ names are invoked in households on their respective days. When divining by the celestial stems, call their names to inquire, and they will reveal matters. For women seeking answers, invoke the wives’ names.\n\nThese historians serve in rotation for nine days, then ascend for three days before resuming, cycling endlessly.\n\nIn all matters, the Eight Historians cherish speech; one must not curse or revile them, nor summon them with disrespect. After three years, they may be petitioned. Even when illness is terminal, they may be dispatched to intercede, and life will be preserved.\n\nThe Yellow Thearch said: \"For a state’s prosperity, cultivate this knowledge. For a scholar’s wealth, invoke this method. The spirits’ power can summon it—treasures and goods will gather like clouds, and all endeavors will be peaceful, securing descendants’ desires.\"\n\nThe Eight Historians pacify the hun-soul and settle the po-soul. Those who seek these spirits will retain dark hair, attain longevity, and maintain purity and radiance. To pursue inner learning, this text may be employed. Thus, the forms of the Eight Historians are recorded.\n\nIf one encounters adversity, recite the names of the Eight Historians, and they will reveal matters of fortune or misfortune, near or far. Speak of this to others, even if they cannot serve them.\n\nMerely possessing this text will illuminate one’s mind like the sun and moon.\n\nThose who desire wisdom should perform divination at opportune moments. Once the Eight Historians are invoked, they will reveal hidden affairs, foresee the unforeseen, scrutinize the intricacies of distant matters, and discern fortune or misfortune—though they cannot avert calamity.\n\nFor gentlemen seeking minor matters or wealth, have the Eight Historians observe a hundred-day abstention. Summon them on their appointed days without kneeling. If they do not speak, understand in your heart.\n\nThe images of the Eight Historians should accompany you. In times of disgrace or defilement, seal them in a vessel; if the chamber is polluted, the spirits will not descend.\n\nIt is further said: After a hundred days of purification, summon the Eight Historians. On each historian’s appointed day, invoke their name within the chamber. Place a tray of fruits in the left pivot of the door, along with a cup of wine, and recite:\n\n*\"Your descendant [Name] delights in the Dao and its arts. Today, I wish to invoke the Way of the Eight Historians. With reverence, I offer sweet fruits and fine wine as an offering.\"*\n\nTo invoke the Eight Historians, prepare wine and fruits on their respective days, and offer them to two historians. One offering is placed at the threshold, with a small mat draped over the door pivot as a seat. Arrange two trays of dates and chestnuts, along with two cups of wine, before the seat. The Daoist faces the door pivot and, without bowing, declares:\n\n*\"Your descendant [Name], who cherishes the Dao and its arts, now purifies and offers sweet fruits, precious dates, fine wine, and fragrant incense. I humbly invite the Eight Historians of the August Heaven—*Lingang* and *Zhuxia*—to partake abundantly, to the point of intoxication and satiety. May [Name] commune with the numinous, attain foresight in divination, perceive hidden affairs, foresee the unforeseen, examine the verifications of distant intricacies, and befriend these spirits, moving and resting with them. From this day forth, let there be responses of sound, light, and shadow—do not be alarmed.\"*\n\nOn subsequent historians’ appointed days, repeat the offering as before. Each invocation must call their names, and each offering will yield verification. If, after years, responses wane, repeat the offering.\n\nThese are the talismans of the Eight Trigrams of the August Heavenly Thearchs. Inscribe them on paulownia wood boards, three inches wide and nine inches long, painted red with cinnabar, and written in black ink. After a hundred-day abstention, place them facing the proper direction, and the spirits will descend, bestowing wealth and nobility, resolving legal disputes, silencing slander, attracting wealth, and dispelling misfortune and anomalies. Offer wine to the spirits to witness their efficacy.\n\nThe two talismans for *si*, *wu*, and *wei* days reside in households.\nThe two talismans for *shen*, *you*, and *xu* days reside in households.\nThe two talismans for *hai*, *zi*, and *chou* days reside in households.\nThe two talismans for *yin*, *mao*, and *chen* days reside in households.\n\n**The Eight Historians’ Numinous Talisman**\n\nThe Yellow Thearch said: \"The Mysterious Cavern’s Eight Trigrams Spirit Talisman was concealed by the Supreme Thearch within the *Huagai* (Canopy) and *Taiwei* (Supreme Subtlety) constellations of the Dipper. My former master observed and transcribed it, creating the *Mysterious Cavern’s Mighty Numinous Spirit Talisman of the Dao’s Evolution*. Carrying it into the Hu lands, I used this chart. The Brahmins thereby devised myriad arts of transformation and returned to the Central Plains, acknowledging me as the Dao Lord, recognizing the *Mysterious Cavern* as equal in merit to Heaven.\n\nThe spirits’ clarity and scrutiny, their might and verification, the sincerity of their essence, and the virtue of the Dao’s evolution—these are bestowed upon minor omens. Dare one wear them constantly? They were concealed within the *Huagai*, doubly secret.\n\nIf a worthy or Daoist whose name has entered the constellations obtains this *Numinous Talisman*, they become a literary immortal.\"\n\nThe noble person, through clarity and understanding, commands the spirits as servants. Should the foolish obtain it, their minds open and they attain rank, sitting to achieve wealth and nobility. As secret as the *Huagai*, they ascend with Master Li.\n\nThe Yellow Emperor said: The *Huagai Mysterious Cavern’s Numinous Dao-Evolving Qian Talisman*, named *Haocheng*, governs the two constellations of the northwest, presiding beneath the Northern Dipper, the *Taiwei*, and the *Huagai*’s imperial seat, serving as the spirit sovereign of presentation. The pure and refined scholar, whose name has entered the constellations, writes it on a small paper and wears it. The spirit attaches to their person, enabling communion with the numinous, dispelling all illness, sitting or standing at will, moving without obstruction. After three years, they ascend in broad daylight to the stars. Inscribed in cinnabar on white silk and bound to the body’s omens, the Eight Historians attend them, commanding myriad tasks. All illnesses heal spontaneously, and they sit to witness the world’s future events. The foolish and unprincipled must not wear this. Simply conceal and treasure it, and the entire household will be free from harm, attaining clarity, wealth, and high office of its own accord.\n\nThe Yellow Emperor said: The *Huagai Mysterious Cavern’s Numinous Dao-Evolving Kun Talisman*, named *Jianchong*, serves as the spirit sovereign of the Pillar Historian. It governs the two constellations of the southwest, presiding beneath the Northern Dipper, the *Taiwei*, and the *Huagai*’s seat, used as the Qian method.\n\nThe Yellow Emperor said: The *Huagai Mysterious Cavern’s Numinous Dao-Evolving Zhen Talisman* serves as the spirit sovereign of *Xuanju* and *Jiangang*. It governs the two constellations of the east, belonging to the Northern Dipper’s first star, used as the preceding method.\n\nThe Yellow Emperor said: The *Huagai Mysterious Cavern’s Numinous Dao-Evolving Xun Talisman*, named *Mingyi*, serves as the spirit sovereign of *Xuanjing*. It governs the two constellations of the southeast, belonging to the Northern Dipper’s second star, used as the preceding method.\n\nThe Yellow Emperor said: The *Huagai Mysterious Cavern’s Numinous Dao-Evolving Kan Talisman*, named *Renwang*, serves as the spirit sovereign of *Tiangang*. It governs the north, belonging to the Northern Dipper’s third star, used as the Qian method.\n\nThe Yellow Emperor said: The *Huagai Mysterious Cavern’s Numinous Treasure Dao-Evolving Li Talisman*, named *Mingshang*, serves as the spirit sovereign of the moon’s essence. It governs the south, belonging to the Northern Dipper’s fourth star, used as the Qian method.\n\nThe Yellow Emperor said: The *Huagai Mysterious Cavern’s Numinous Treasure Dao-Evolving Gen Talisman*, named *Guoyi*, serves as the spirit sovereign of the sun’s origin. It governs the two constellations of the east, belonging to the Northern Dipper’s fifth star, used as the Qian method.\n\nThe Yellow Emperor said: The *Huagai Mysterious Cavern’s Numinous Dao-Evolving Dui Talisman*, named *Jianyang*, serves as the spirit sovereign of *Taixuan*. It governs the two constellations of the west, belonging to the Northern Dipper’s sixth star, used as the Qian method.\n\nThe Yellow Emperor said: Heaven and Earth each return to their origin; Qian and Kun unite in virtue, governing within the Dipper. The Five Thearchs preside, the *Taiwei* reigns as sovereign. The hexagrams array their measures, the twenty-eight constellations eternally receive their original qi, their movements governed by the mechanism, each returning to govern its respective star’s talisman. They command the Eight Essences, relying on the *Gang* pillar below. Only with this may one proceed.\n\nDescendants who cultivate this become perfected beings. Conceal and treasure it; do not transmit it even for a thousand gold. The Yellow Emperor said: If you would cultivate the Dao, first cultivate the body. Stabilize the hun and po, and guard against reckless speech. Purify yourself for a hundred days, bathing in the *Hua* spring. First sacrifice to the Eight Spirits near the hall’s pivot. Then employ the Eight Talismans, and the Historians will promptly attend. They move and rest with you, serving as your envoys. Wearing the talismans at the eight solar terms, you commune with the imperial stars. White hair turns black again, fallen teeth regrow. Following the Historians, you ride dragons, emerging from darkness into light. They dispel disasters and avert harm, manifesting transformations before you. Should you act contrary to the method, do not proceed—heaven’s constellations will hold you accountable.\n\nThe Yellow Emperor said: For divination, on yang days (zi), attach the talisman to the left elbow; on yin days (chou), to the right elbow. Visualize the perfected one summoning the Historian to the talisman, pointing to the Eight Historians to invoke them. Matters hidden in the yin, their twists and turns, the Eight Historians all know and will speak of them. You must then deliberate and explain. In divination, guard your words, for the Historians know them. The perfected one ascends to the Dipper’s midst; if the spirits grow angry, they will no longer serve you.\n\nIf the querent suffers from illness or official matters, or requires exorcism of disasters, you must, according to the method, return to the Dipper and consult it. Those with destined fortune and virtue should be saved first. Instruct the master to seek a teacher, medicine, or objects in a specific place, and hasten there to obtain them. The Historians will respond immediately, proceeding to the location to await the person or object, or to arrange their acquisition. The Historians act as spirit qi; the sick recover upon seeing the object. If the object startles them, the Historians may manifest as phoenixes to alarm them.\n\nIn mountains and forests, whether bright or dim, above or below, if something is obscured, call upon the Historians to inquire, and they will already know and tell you. The Yellow Emperor said: In practicing this Dao, cherish your words and do not recklessly speak of good fortune. When the people encounter inauspicious, evil, or strange calamities, the Historians will respond to your words and seek omens to manifest these misfortunes. If the common folk grow fearful, do not recite the talisman or summon the Historians, lest they grow resentful and bring harm, disasters, or punishments upon people, acting wantonly. With a mind as penetrating as the Dao, you will foresee the future as clearly as the sun and moon. Demons, evil spirits, and slanderous villains dare not act. You will repel weapons, secure office, and attain wealth and nobility without difficulty. This Dao must be kept secret.\n\nThe Yellow Emperor said: If you possess the radiant grace to receive the star talismans but cannot cultivate them, store them in a five-colored bag and hang it within your bed’s canopy. If a worthy and enlightened person wishes to cultivate them, follow the above method, placing them in a crimson bag within your robe. Now, the Five Viscera are governed by the Crimson Palace’s Perfected One, *Zidan*, who will constantly befriend you. For exorcising disasters, averting harm, or any matter, wear the talisman as described below.\n\nWhen wearing the talisman, purify the time and offer a libation to it. Burn incense, place dates, ginseng, and *fuling* tea before the mat, and use yellow silk as a pure path. Bow twice and pray, saying:\n\nGreat-grandson, your servant So-and-so, declares: On this clear and bright auspicious day and propitious hour, it is fitting to offer libation to the Eight Trigrams’ Celestial Deities of the Eight Luminaries. With reverence, I present sweet, fragrant chestnuts and dates, and humbly invoke the Eight Lords, the Nine Lords, the Divine Sovereign Fuxi, the Supreme One of the Pillow, the Mighty Offering of the Qian Heavenly Lord and Father, the Illuminated Master of the Dao, and the Perfected One of the Talismanic Way. May the Eight Lords descend and shine their light. May the worthy great-grandson be assisted by the Eight Scribes of the Celestial Offices. Today, the great transformation of Kaiyang unfolds; receive the talisman and embrace the true. Open the path to dispel natural misfortunes and improprieties. Inquire of the matters to come and their auspicious omens; foretell the future. Promote benevolence and righteousness, and boundless blessings shall extend endlessly. Long enjoy good fortune, and the receipt of divination shall never cease.\n\nThe Yellow Emperor said: Having made the offering, if you remain unaware that the August Heaven witnesses your sincerity, you should, at midnight, face north and declare: \"I traverse Heaven and Earth, my feet tread upon Wenchang, my heart rests in the Great Clarity. Harmonious qi takes form. The Twenty-Eight Constellations hasten directly to the Imperial Court.\"\n\nShould you grasp the essential secret, the Eight Essences are most true. United in radiance with the celestial deities, they are the foundation of the Eight Scribes. The Heavenly Lords of the Eight Trigrams and the Heavenly Sovereign Fuxi—only when you obtain the star talisman will the spirits act. By wearing it, your knowledge increases, and you perceive what has yet to come. First, sacrifice to the Eight Deities, then employ the Eight Talismans. Heaven and Earth unite in fragrance, foreknowing what has not yet manifested and averting calamities already incurred.\n\nAt the beginning of the ten-day period, bathe and purify yourself with orchid incense. May the register of death be expunged, and may you don the robe of immortality. Befriend the Scribes, together ascend to the August Star, your body entrusted to the sun and moon, in harmony with the Four Dragons. Long receive good fortune, and may your life be boundless.\n\nThe Yellow Emperor said: If you undertake great matters of Heaven and Earth on behalf of others to seek their fate, place the talisman upon your head and fully concentrate on its characters’ meaning. Command the Scribe Jia to mount the Azure Dragon and return to the Dipper, to discern the fortunes or misfortunes of the household of So-and-so. The Scribe will ascend into the Dipper constellation and descend to inform the person of Heaven and Earth’s calamities or blessings, and of the fortunes or misfortunes in their life. Should exorcism be required, bid the Scribe to save them. Pray for longevity, and it shall be granted without fail.\n\nThe Yellow Emperor said: If you wish to exorcise disasters, avert harm, and transform misfortune into blessing, first recite the names of the Eight Scribes. Today, on this day of Haocheng, bid them descend and present themselves to exorcise calamities for the household of So-and-so. Whatever is required, the Perfected One shall swiftly dispatch the adamantine courier to hasten and return. Whatever you summon by mouth shall be obtained without fail. Transform misfortune into blessing, but do not kill, nor issue partial commands, lest people rush about in madness, drawn to love only themselves.\n\nIf you must issue a command, first remove and set aside the talisman, then command the Scribe at dusk before retiring. The same applies to matters of the bedchamber, lest the woman be shamed.\n\nThe Yellow Emperor said: If a woman possesses a love for the Dao, she should be allowed to serve the spirits in accordance with the method.\n\nIt is also stated in the *Illustrated Scripture of the Scribes*: \"Men serve their husbands, women serve their wives. Husband and wife serve together, as Qian and Kun follow the course of Heaven.\" Thus, when two are of one mind, their strength can sever metal. When they cultivate goodness together, their benefits run deep. Only then may they mount the Azure Dragon and roam the world with the spirits.\n\nGuard this well, guard it closely. Do not let the unruly Three Women or wicked, deceitful wives practice it. Those who cannot cultivate this will instead bring harm upon you. But if you diligently pursue it, once the Dao is achieved, the spirits will recognize you as a true person, and Heaven will naturally send the Jade Maiden of the Azure Waist to you.\n\nThe Yellow Emperor said: My former master, Lord Li, sat in the Court of Serene Contention and inscribed the position of the Supreme Micro-Emperor within the Dipper constellation. There, he beheld these Eight Talismanic Scripts and transmitted them to Lesser Omen. As I, Lesser Omen, did not understand their proper sequence, I kowtowed beneath the constellation and made offerings. When I copied the Eight Scribes, they came forth, relying on the spirit of the Eight Scribes and the Eight Trigrams. The talismans of the Eight Trigrams can restrain them, and the Eight Scribes will not bring harm to households.\n\nEvery household has Eight Scribes stationed before the central pillar of the hall, and they also stand upright within the Dipper. The Dipper Lord said: \"The affairs of the Daoist practitioner require the star talisman to restrain the unruly and punish transgressions.\" Only by receiving and cultivating the talisman will the spirits act. The prohibition of the Scribe Star Talisman is weighty. Do not transmit it lightly; unless the recipient is a worthy person or a gentleman, be cautious. Do not transmit it for a thousand gold; transmit it only to the worthy. If transmitted to the unworthy, calamity will ensue.\n\nIf you find such a person, make the offering as I have described. Follow the method of offering to the talisman, but do not offer beneath the Dipper. If you receive the Dipper Lord’s talisman without knowing this, the Scribe spirits will be startled. If they do not ascend to make their report, the Dipper Lord will hold the person accountable, and both will suffer calamity.\n\nFor the offering, arrange the seats of the Five Emperors in the four directions, each seat two *zhang* in length. Use silk according to the method to make mats for the seats. Place three tables in each seat, immaculately clean. Offer seven incense burners, seven lamps, seven bowls of date tea, and seven portions of the five fruits. In the center, arrange one round seat for the Scribe, with one table bearing one incense burner, one lamp, three portions of the five fruits, and a plate of green chestnuts and dates. Place the talisman in the center. On the round seat, arrange five plates of fruit and five incense burners. Invoke the Five Emperors, the Dipper Deities, the Twenty-Eight Constellations, the Most High Lord Lao, and the Divine Sovereign Fuxi. Then call the names of the Eight Trigrams and the Perfected One of the Talismanic Way. State: \"So-and-so, who loves the Dao, has come to seek and request the transmission of the star talisman. Today, it is fitting to transmit it to the worthy and enlightened. Arrange the five-colored seats according to their hues, bright and resplendent. Offer tea, seasonal fruits, and other items with meticulous reverence. Though you may not focus your thoughts, perform the offering beneath the Dipper. Do not invite many people, lest the spirits not descend.\"\n\nAfter the offering, transmit the talisman to the worthy one, who shall receive it with a bow. The true shall then be attached to them. First, purify yourself according to the method, and only then may you transmit it. When offering to the talisman or beneath the Dipper, do not call out loudly; simply invoke them in your heart.\n\nHere ends the *Illustrated Scripture of the Sacred Writ and True Forms of the Eight Scribes, Communicating with the Divine*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上通灵八史圣文真形图 经名：太上通灵八史圣文真形图。 撰人不详。 一卷。 底本出成：《正统道藏》洞神部灵图类。 太上通灵八史圣文真形图 皇天史罡字临罡，高天史罡字建罡， 天帝史罡字天罡，上帝史罡字日源。 第一史，夫临罡，妻字柱下。 巳午未日，在人家，赤衣、分积、白笔、进贤冠。 第二史，夫建罡，妻字玄精。 申酉戌日，在人家，白衣、分绩、白笔、进贤冠。 第三史，夫天罡，妻字月精。 亥子丑日，在人家，黑衣、分积、白笔、进贤冠。 第四史，夫日源，妻字太玄。 寅卯辰日，在人家，青衣、分积、白笔、进贤冠。 此八史名，以此日下人家，若以占甲，当呼其字问之，即令人知消息。 若女问事，呼妻名字。 此诸史上下直九日，及三日复上，周而复始。 凡事八史皆爱口，不得骂晋，毁辱八史，皆不惊唤。 若三年以上，皆可求请。 若有疾病，欲命尽时，亦可使行请，命必得矣。 黄帝曰：国之欲，兴修知此。 文人之欲，富招致此。 神能致此，神财物如云，所向克平安，保子孙诸欲事。 八史安魂定魄，能求此神，头发不白，得寿长，清身洁泽。 欲求内学，斯文可措，故记八史之象。 若有逆召，可念八史，吉凶远近之事，史皆知之。 以语人，若不能事者。 但家有此文，令人意昭如日月也。 凡欲聪明者，当作逢占，致八史已致之，后可知阴密之事。 预知未然之意，审察万里委曲之旨，适可知吉凶，不能却灾矣。 凡君子内发小事之为致财也，使 八史戒百日，以其日召之，不须跪。 若不得语，且可心知也。 八史像，当自随之。 若有丧辱，可封着器中，他室中有污辱，神则不下矣。 又说斋洁百日后，始召八史，时各以其史下日，呼史字於室中，左枢内果子一盘，酒一杯，咒曰：曾孙某，好乐道术，今愿八史之道。 谨奉甘果美酒，当以祭之。 若致八史，法各以其日下酒果等，祭之二史。 一祭於堂户问，以小席衣户枢为坐，以盘盛枣栗二盘，酒二杯，着坐前，道士面向户枢。 如祭之不拜，也言曰：曾孙某甲，爱好道术，谨斋洁上供甘果枣珍饥美酒芳香，奉请皇天八史临罡柱下，愿大饮大食醉饱为度，使某甲通神明达，所占先知阴密之事，须知未然之意，察万里之验委曲之旨，与其为友俱行俱止，从今日为始，然后必有音响光影之应，勿怪也。 至后史下日，复祭之如前法。 此法各当呼其名史字，皆一祭之有应验之征，复经年历岁，疏问不应者，复祭之耳。 此八卦皇天帝神符，以梧桐木板，广三寸长九寸，朱涂上，墨书符。 如戒百日，置之如方面，其神即来，下令人富贵，消官事，消口舌，宜钱财，灭祸除怪。 宜酌酒祭其神，所以知验。 右二符巳午未日，下在人家。 右二符申酉戌日，下在人家。 右二符亥子丑日，下在人家。 右二符寅卯辰日，下在人家。 八史通灵符 黄帝曰：玄洞八卦神符，上帝秘於华盖太微斗宿中，先师仰看画之，以为玄洞威灵神精演道符，持以入胡，以吾为此图。 婆罗门因造变化术数万，来还中原，以吾为道君，知玄洞与天同功也。 神之明察也，威神验也，使精之信也，演道之德。 以受小兆，敢常佩之，因藏於华盖，重秘之。 如贤人、道士名已入宿者，得此通灵符，文仙也。",
      "translated_text": "**The Supreme Peripheral Numinous Eight Historians’ Sacred Text of True Forms**\n\n**Scripture Title:** *The Supreme Peripheral Numinous Eight Historians’ Sacred Text of True Forms*. Author unknown. One scroll. Base text from: *Daoist Canon of the Zhengtong Era*, *Dongshen* Section, *Lingtu* (Numinous Charts) Category.\n\n---\n\n**The Supreme Peripheral Numinous Eight Historians’ Sacred Text of True Forms**\n\nThe Celestial Historian of the August Heaven is named *Lingang* (Approaching Ridge).\nThe Celestial Historian of the Lofty Heaven is named *Jiangang* (Establishing Ridge).\nThe Celestial Historian of the Heavenly Thearch is named *Tiangang* (Heavenly Ridge).\nThe Celestial Historian of the Supreme Thearch is named *Riyuan* (Sun’s Source).\n\n**First Historian:** Husband, *Lingang*; wife, *Zhuxia* (Pillar Below).\nActive on *si*, *wu*, and *wei* days, residing in households. Attired in red robes, with divided hems, white brush, and *jinxian* cap.\n\n**Second Historian:** Husband, *Jiangang*; wife, *Xuanjing* (Mysterious Essence).\nActive on *shen*, *you*, and *xu* days, residing in households. Attired in white robes, with divided seams, white brush, and *jinxian* cap.\n\n**Third Historian:** Husband, *Tiangang*; wife, *Yuejing* (Moon’s Essence).\nActive on *hai*, *zi*, and *chou* days, residing in households. Attired in black robes, with divided hems, white brush, and *jinxian* cap.\n\n**Fourth Historian:** Husband, *Riyuan*; wife, *Taixuan* (Supreme Mystery).\nActive on *yin*, *mao*, and *chen* days, residing in households. Attired in green robes, with divided hems, white brush, and *jinxian* cap.\n\nThese eight historians’ names are invoked in households on their respective days. When divining by the celestial stems, call their names to inquire, and they will reveal matters. For women seeking answers, invoke the wives’ names.\n\nThese historians serve in rotation for nine days, then ascend for three days before resuming, cycling endlessly.\n\nIn all matters, the Eight Historians cherish speech; one must not curse or revile them, nor summon them with disrespect. After three years, they may be petitioned. Even when illness is terminal, they may be dispatched to intercede, and life will be preserved.\n\nThe Yellow Thearch said: \"For a state’s prosperity, cultivate this knowledge. For a scholar’s wealth, invoke this method. The spirits’ power can summon it—treasures and goods will gather like clouds, and all endeavors will be peaceful, securing descendants’ desires.\"\n\nThe Eight Historians pacify the hun-soul and settle the po-soul. Those who seek these spirits will retain dark hair, attain longevity, and maintain purity and radiance. To pursue inner learning, this text may be employed. Thus, the forms of the Eight Historians are recorded.\n\nIf one encounters adversity, recite the names of the Eight Historians, and they will reveal matters of fortune or misfortune, near or far. Speak of this to others, even if they cannot serve them.\n\nMerely possessing this text will illuminate one’s mind like the sun and moon.\n\nThose who desire wisdom should perform divination at opportune moments. Once the Eight Historians are invoked, they will reveal hidden affairs, foresee the unforeseen, scrutinize the intricacies of distant matters, and discern fortune or misfortune—though they cannot avert calamity.\n\nFor gentlemen seeking minor matters or wealth, have the Eight Historians observe a hundred-day abstention. Summon them on their appointed days without kneeling. If they do not speak, understand in your heart.\n\nThe images of the Eight Historians should accompany you. In times of disgrace or defilement, seal them in a vessel; if the chamber is polluted, the spirits will not descend.\n\nIt is further said: After a hundred days of purification, summon the Eight Historians. On each historian’s appointed day, invoke their name within the chamber. Place a tray of fruits in the left pivot of the door, along with a cup of wine, and recite:\n\n*\"Your descendant [Name] delights in the Dao and its arts. Today, I wish to invoke the Way of the Eight Historians. With reverence, I offer sweet fruits and fine wine as an offering.\"*\n\nTo invoke the Eight Historians, prepare wine and fruits on their respective days, and offer them to two historians. One offering is placed at the threshold, with a small mat draped over the door pivot as a seat. Arrange two trays of dates and chestnuts, along with two cups of wine, before the seat. The Daoist faces the door pivot and, without bowing, declares:\n\n*\"Your descendant [Name], who cherishes the Dao and its arts, now purifies and offers sweet fruits, precious dates, fine wine, and fragrant incense. I humbly invite the Eight Historians of the August Heaven—*Lingang* and *Zhuxia*—to partake abundantly, to the point of intoxication and satiety. May [Name] commune with the numinous, attain foresight in divination, perceive hidden affairs, foresee the unforeseen, examine the verifications of distant intricacies, and befriend these spirits, moving and resting with them. From this day forth, let there be responses of sound, light, and shadow—do not be alarmed.\"*\n\nOn subsequent historians’ appointed days, repeat the offering as before. Each invocation must call their names, and each offering will yield verification. If, after years, responses wane, repeat the offering.\n\nThese are the talismans of the Eight Trigrams of the August Heavenly Thearchs. Inscribe them on paulownia wood boards, three inches wide and nine inches long, painted red with cinnabar, and written in black ink. After a hundred-day abstention, place them facing the proper direction, and the spirits will descend, bestowing wealth and nobility, resolving legal disputes, silencing slander, attracting wealth, and dispelling misfortune and anomalies. Offer wine to the spirits to witness their efficacy.\n\nThe two talismans for *si*, *wu*, and *wei* days reside in households.\nThe two talismans for *shen*, *you*, and *xu* days reside in households.\nThe two talismans for *hai*, *zi*, and *chou* days reside in households.\nThe two talismans for *yin*, *mao*, and *chen* days reside in households.\n\n**The Eight Historians’ Numinous Talisman**\n\nThe Yellow Thearch said: \"The Mysterious Cavern’s Eight Trigrams Spirit Talisman was concealed by the Supreme Thearch within the *Huagai* (Canopy) and *Taiwei* (Supreme Subtlety) constellations of the Dipper. My former master observed and transcribed it, creating the *Mysterious Cavern’s Mighty Numinous Spirit Talisman of the Dao’s Evolution*. Carrying it into the Hu lands, I used this chart. The Brahmins thereby devised myriad arts of transformation and returned to the Central Plains, acknowledging me as the Dao Lord, recognizing the *Mysterious Cavern* as equal in merit to Heaven.\n\nThe spirits’ clarity and scrutiny, their might and verification, the sincerity of their essence, and the virtue of the Dao’s evolution—these are bestowed upon minor omens. Dare one wear them constantly? They were concealed within the *Huagai*, doubly secret.\n\nIf a worthy or Daoist whose name has entered the constellations obtains this *Numinous Talisman*, they become a literary immortal.\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1283,
      "start_sentence": 0,
      "end_sentence": 56,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.046411752700806,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\灵图类\\太上通灵八史圣文真形图.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "君子以明达，神为使令。 愚人得之，心开得位，坐致富贵。 秘如华盖，李君同升也。 黄帝曰：华盖玄洞通灵演道乾符，字昊成，位西北方二宿，治北斗太微华盖帝座下，临呈之神主也。 清洁上士，名已入宿，以小纸书，佩之。 神附躬，令人通神灵，百病消除，坐在立亡，出入无间，三年之后，白日升天星中。 朱书白素，附以兆身，八史事人，役使万端，百病自愈，坐见天下未来之事。 愚士不正，慎勿佩此。 但秘之藏之，举家无患，明达富贵，高官自至。 黄帝曰：华盖玄洞通灵演道坤符，字间冲，柱史之神主也。 位西南二宿，治北斗太微华盖座下，用如乾法。 黄帝曰：华盖玄洞通灵演道震符，玄举建罡之神主也。 治东方二宿，属北斗第一星，用如前法。 黄帝曰：华盖玄洞通灵演道巽符，字明一，玄精之神主也。 治东南二宿，属北斗第二星，用如此前法。 黄帝曰：华盖玄洞通灵演道坎符，字仁王，天罡之神主也。 治北方，属北斗第三星，法如乾。 黄帝曰：华盖玄洞灵宝演道离符，字明上，月精之神主也。 治南方，属北斗第四星，法如乾。 黄帝曰：华盖玄洞灵宝演道艮符，字·过意，日原之神主也。 治东方二宿，属北斗第五星，用如乾法。 黄帝曰：华盖玄洞通灵演道兑符，字见阳，太玄之神主也。 治西方二宿，属北斗第六星，如乾法用。 黄帝曰：天地各归其原，乾坤合德，治在斗中，五帝为主，太微为君。 众卦布度，二十八宿，永受本气，运由机关，还治各属一星之符。 制令八精，所凭临罡柱下，须此乃行。 子孙修之，得为真人，秘而藏之，千金勿传。 黄帝曰：子能修道，当先修身。 安魂定魄，慎勿妄言。 洁斋百日，沐浴华泉。 先祠八神，近於堂枢。 次用八符，史辄来凭。 俱行俱止，为人使令。 八节佩符，通达皇星。 发白更黑，齿落更生。 随史乘龙，出幽入冥。 禳灾却害，变化示子。 所如法一非反，逆子勿行之，天宿责人。 黄帝曰：凡人求占，阳日子以符着左肘，阴日丑以符着右肘，存真人念史以着符，手指八史即语子来，人事阴密，委曲节次，八史即皆知以语，子当论以。 凡占慎言史知之，真人上斗中，神怒后不为人使也。 若问者有病官之事，应禳灾命，子如法便还斗中参之。 有命福德者，合为救之先。 令主某处求师，药及物急往便得。 史辄应口，前往处持物候人，或令置得之也。 史法为神气，病人见物便差，若物所令惊出，史或作鸾惊之。 若山林明暗，上中覆盖之，下不知何物，呼史问之，即已知语子也。 黄帝曰：子行此道，当爱惜言语，不得妄言吉祥。 民有凶恶衰祸怪异之事，史随子口便发，以求兆为人作凶异。 今百姓惧怖，慎勿附符念，史所有责怒，史又为人作害灾刑，恣意所开，志意洞达，前知未然，昭如日月，魍魉邪恶凶谗敢发，辟兵宜官，财钱富贵为之不难，此道要秘。 黄帝曰：子有光恩当得星符，不能行修，当盛以五彩袋悬在卧帐中。 若有贤明知，欲修之如上法，盛绛袋在子衣中。 今当五藏以绛宫真人子丹主之神，常来与子丹为友，若禳灾却害诸所事，皆更着符如下法。 当带符之时，以除净时醮祭符，以烧香、枣果、参、茯苓汤置席前，以黄绢帛为净道，再拜祝曰：",
      "translated_text": "The noble person, through clarity and understanding, commands the spirits as servants. Should the foolish obtain it, their minds open and they attain rank, sitting to achieve wealth and nobility. As secret as the *Huagai*, they ascend with Master Li.\n\nThe Yellow Emperor said: The *Huagai Mysterious Cavern’s Numinous Dao-Evolving Qian Talisman*, named *Haocheng*, governs the two constellations of the northwest, presiding beneath the Northern Dipper, the *Taiwei*, and the *Huagai*’s imperial seat, serving as the spirit sovereign of presentation. The pure and refined scholar, whose name has entered the constellations, writes it on a small paper and wears it. The spirit attaches to their person, enabling communion with the numinous, dispelling all illness, sitting or standing at will, moving without obstruction. After three years, they ascend in broad daylight to the stars. Inscribed in cinnabar on white silk and bound to the body’s omens, the Eight Historians attend them, commanding myriad tasks. All illnesses heal spontaneously, and they sit to witness the world’s future events. The foolish and unprincipled must not wear this. Simply conceal and treasure it, and the entire household will be free from harm, attaining clarity, wealth, and high office of its own accord.\n\nThe Yellow Emperor said: The *Huagai Mysterious Cavern’s Numinous Dao-Evolving Kun Talisman*, named *Jianchong*, serves as the spirit sovereign of the Pillar Historian. It governs the two constellations of the southwest, presiding beneath the Northern Dipper, the *Taiwei*, and the *Huagai*’s seat, used as the Qian method.\n\nThe Yellow Emperor said: The *Huagai Mysterious Cavern’s Numinous Dao-Evolving Zhen Talisman* serves as the spirit sovereign of *Xuanju* and *Jiangang*. It governs the two constellations of the east, belonging to the Northern Dipper’s first star, used as the preceding method.\n\nThe Yellow Emperor said: The *Huagai Mysterious Cavern’s Numinous Dao-Evolving Xun Talisman*, named *Mingyi*, serves as the spirit sovereign of *Xuanjing*. It governs the two constellations of the southeast, belonging to the Northern Dipper’s second star, used as the preceding method.\n\nThe Yellow Emperor said: The *Huagai Mysterious Cavern’s Numinous Dao-Evolving Kan Talisman*, named *Renwang*, serves as the spirit sovereign of *Tiangang*. It governs the north, belonging to the Northern Dipper’s third star, used as the Qian method.\n\nThe Yellow Emperor said: The *Huagai Mysterious Cavern’s Numinous Treasure Dao-Evolving Li Talisman*, named *Mingshang*, serves as the spirit sovereign of the moon’s essence. It governs the south, belonging to the Northern Dipper’s fourth star, used as the Qian method.\n\nThe Yellow Emperor said: The *Huagai Mysterious Cavern’s Numinous Treasure Dao-Evolving Gen Talisman*, named *Guoyi*, serves as the spirit sovereign of the sun’s origin. It governs the two constellations of the east, belonging to the Northern Dipper’s fifth star, used as the Qian method.\n\nThe Yellow Emperor said: The *Huagai Mysterious Cavern’s Numinous Dao-Evolving Dui Talisman*, named *Jianyang*, serves as the spirit sovereign of *Taixuan*. It governs the two constellations of the west, belonging to the Northern Dipper’s sixth star, used as the Qian method.\n\nThe Yellow Emperor said: Heaven and Earth each return to their origin; Qian and Kun unite in virtue, governing within the Dipper. The Five Thearchs preside, the *Taiwei* reigns as sovereign. The hexagrams array their measures, the twenty-eight constellations eternally receive their original qi, their movements governed by the mechanism, each returning to govern its respective star’s talisman. They command the Eight Essences, relying on the *Gang* pillar below. Only with this may one proceed.\n\nDescendants who cultivate this become perfected beings. Conceal and treasure it; do not transmit it even for a thousand gold. The Yellow Emperor said: If you would cultivate the Dao, first cultivate the body. Stabilize the hun and po, and guard against reckless speech. Purify yourself for a hundred days, bathing in the *Hua* spring. First sacrifice to the Eight Spirits near the hall’s pivot. Then employ the Eight Talismans, and the Historians will promptly attend. They move and rest with you, serving as your envoys. Wearing the talismans at the eight solar terms, you commune with the imperial stars. White hair turns black again, fallen teeth regrow. Following the Historians, you ride dragons, emerging from darkness into light. They dispel disasters and avert harm, manifesting transformations before you. Should you act contrary to the method, do not proceed—heaven’s constellations will hold you accountable.\n\nThe Yellow Emperor said: For divination, on yang days (zi), attach the talisman to the left elbow; on yin days (chou), to the right elbow. Visualize the perfected one summoning the Historian to the talisman, pointing to the Eight Historians to invoke them. Matters hidden in the yin, their twists and turns, the Eight Historians all know and will speak of them. You must then deliberate and explain. In divination, guard your words, for the Historians know them. The perfected one ascends to the Dipper’s midst; if the spirits grow angry, they will no longer serve you.\n\nIf the querent suffers from illness or official matters, or requires exorcism of disasters, you must, according to the method, return to the Dipper and consult it. Those with destined fortune and virtue should be saved first. Instruct the master to seek a teacher, medicine, or objects in a specific place, and hasten there to obtain them. The Historians will respond immediately, proceeding to the location to await the person or object, or to arrange their acquisition. The Historians act as spirit qi; the sick recover upon seeing the object. If the object startles them, the Historians may manifest as phoenixes to alarm them.\n\nIn mountains and forests, whether bright or dim, above or below, if something is obscured, call upon the Historians to inquire, and they will already know and tell you. The Yellow Emperor said: In practicing this Dao, cherish your words and do not recklessly speak of good fortune. When the people encounter inauspicious, evil, or strange calamities, the Historians will respond to your words and seek omens to manifest these misfortunes. If the common folk grow fearful, do not recite the talisman or summon the Historians, lest they grow resentful and bring harm, disasters, or punishments upon people, acting wantonly. With a mind as penetrating as the Dao, you will foresee the future as clearly as the sun and moon. Demons, evil spirits, and slanderous villains dare not act. You will repel weapons, secure office, and attain wealth and nobility without difficulty. This Dao must be kept secret.\n\nThe Yellow Emperor said: If you possess the radiant grace to receive the star talismans but cannot cultivate them, store them in a five-colored bag and hang it within your bed’s canopy. If a worthy and enlightened person wishes to cultivate them, follow the above method, placing them in a crimson bag within your robe. Now, the Five Viscera are governed by the Crimson Palace’s Perfected One, *Zidan*, who will constantly befriend you. For exorcising disasters, averting harm, or any matter, wear the talisman as described below.\n\nWhen wearing the talisman, purify the time and offer a libation to it. Burn incense, place dates, ginseng, and *fuling* tea before the mat, and use yellow silk as a pure path. Bow twice and pray, saying:",
      "overlap_context": " Plains, acknowledging me as the Dao Lord, recognizing the *Mysterious Cavern* as equal in merit to Heaven.\n\nThe spirits’ clarity and scrutiny, their might and verification, the sincerity of their essence, and the virtue of the Dao’s evolution—these are bestowed upon minor omens. Dare one wear them constantly? They were concealed within the *Huagai*, doubly secret.\n\nIf a worthy or Daoist whose name has entered the constellations obtains this *Numinous Talisman*, they become a literary immortal.\"",
      "start_char": 1283,
      "end_char": 2525,
      "start_sentence": 57,
      "end_sentence": 109,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.70457458496094,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\灵图类\\太上通灵八史圣文真形图.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "曾孙臣某甲言，今日清明良日吉时，宜醮八卦通天神八明，谨奉栗枣甘美芳香，谒请八君九君神皇伏羲，枕中太乙雄供乾皇天君父，师道明太上行符真人，八君临照，曾孙贤者辅身八史天官，今日开阳大化，受符纳真，开通以降自然愆恶不当，请问来事吉兆，告以未来，推行仁义，福延无穷，长享吉利，受占未央。 黄帝曰：既祭之，子未知皇天睹其直，子当以夜半时，北向现曰：吾行天地，足蹑文昌，心托太清，和气成形，二十八宿，径造皇庭。 若知旨诀，八精最真，合光天神，八史所凭，八卦天君，伏羲天皇，须得星符，神乃得行。 服之益知，便见未然，先祠八神，次用八符，天地合香，前知未兆，却知已殃。 上旬沐浴，斋洁兰香，愿除死籍，更着长生，与史为友，俱朝皇星，身托日月，参同四龙，长受吉利，万寿无疆。 黄帝曰：子央天地大事，为人求命，当以符着头上，尽存其字意，命史甲乘青龙还斗中，参知天地某甲家吉凶。 史即上入斗宿，下语人天地灾否，及人命有吉凶之事，应禳便令史救之，请命得寿无不验。 黄帝曰：子欲禳灾却害，转祸为福，当先念八史字，今日昊成，当使临呈，为某甲家禳灾，应须得某物，原真人剎刚驰行疾反，即随口所召无不得也。 以祸为福，莫杀人，亦勿偏有所命，使人狂走来爱己也。 若宜有所责命，当解置符，而命史暮卧，有房室之事亦然，令妇人不知耻也。 黄帝曰：若妇人有好道者，当令奉神用。 亦如法史图曰：男子奉其夫，女子奉其妻，夫妻共奉之，若乾坤之顺天行也。 故二人同心，其利断金。 共修之善，其利甚探。 乃可乘青龙，与神同游天下也。 秘之秘之，勿令不节三女，恶行始妇为之，不能修此，反误子尔。 但勤为之，道成之后，神知子真人，天自使以青腰玉女。 黄帝曰：先师李君，坐寂诤之庭，着太微帝位斗宿中，见此八符文，以授小兆。 吾以小兆未知逆顺，即叩头宿下祭。 如写八史，即来，凭八史八卦精神，八卦之符也能制，八史不为人家作害也。 人家皆有八史，在堂枢前更直，斗中上曰：斗君道人事，须得星符，能制不道，恶犯违也。 受符修之，神乃行。 史星符禁重，不得转传自非贤人君子，兆慎之。 千金勿传，传必得贤，非贤致殃。 若有其人，当以吾祭，皆法祭符，斗下不祭。 如受斗君，不知令人史神惊，既不为使上启，斗君责人并受其殃。 祭作五帝座四，座长二丈，法缯为席座，座三案严净，香灯枣汤七，五果七，中史员座一，案香灯各一，五果三，青栗枣一盘，符置中央，员座上五，盘果五，香火，请五帝、斗神、二十八宿、太上老君、伏羲神皇，次呼八卦字行符真人，某甲好道，比来求请，今当受其星符，传付贤明，五彩为座，随色鲜明，汤茶时果，随事精严，克励丹诚，虽不挂念，放斗下祭之，勿与多人，神不下临。 祭毕，送付贤者，拜而受之，真便附也。 先斋如法，及可付也。 祭符及斗下，并不得口请令声大，但心念请之尔。 太上通灵八史圣文真形图竟",
      "translated_text": "Great-grandson, your servant So-and-so, declares: On this clear and bright auspicious day and propitious hour, it is fitting to offer libation to the Eight Trigrams’ Celestial Deities of the Eight Luminaries. With reverence, I present sweet, fragrant chestnuts and dates, and humbly invoke the Eight Lords, the Nine Lords, the Divine Sovereign Fuxi, the Supreme One of the Pillow, the Mighty Offering of the Qian Heavenly Lord and Father, the Illuminated Master of the Dao, and the Perfected One of the Talismanic Way. May the Eight Lords descend and shine their light. May the worthy great-grandson be assisted by the Eight Scribes of the Celestial Offices. Today, the great transformation of Kaiyang unfolds; receive the talisman and embrace the true. Open the path to dispel natural misfortunes and improprieties. Inquire of the matters to come and their auspicious omens; foretell the future. Promote benevolence and righteousness, and boundless blessings shall extend endlessly. Long enjoy good fortune, and the receipt of divination shall never cease.\n\nThe Yellow Emperor said: Having made the offering, if you remain unaware that the August Heaven witnesses your sincerity, you should, at midnight, face north and declare: \"I traverse Heaven and Earth, my feet tread upon Wenchang, my heart rests in the Great Clarity. Harmonious qi takes form. The Twenty-Eight Constellations hasten directly to the Imperial Court.\"\n\nShould you grasp the essential secret, the Eight Essences are most true. United in radiance with the celestial deities, they are the foundation of the Eight Scribes. The Heavenly Lords of the Eight Trigrams and the Heavenly Sovereign Fuxi—only when you obtain the star talisman will the spirits act. By wearing it, your knowledge increases, and you perceive what has yet to come. First, sacrifice to the Eight Deities, then employ the Eight Talismans. Heaven and Earth unite in fragrance, foreknowing what has not yet manifested and averting calamities already incurred.\n\nAt the beginning of the ten-day period, bathe and purify yourself with orchid incense. May the register of death be expunged, and may you don the robe of immortality. Befriend the Scribes, together ascend to the August Star, your body entrusted to the sun and moon, in harmony with the Four Dragons. Long receive good fortune, and may your life be boundless.\n\nThe Yellow Emperor said: If you undertake great matters of Heaven and Earth on behalf of others to seek their fate, place the talisman upon your head and fully concentrate on its characters’ meaning. Command the Scribe Jia to mount the Azure Dragon and return to the Dipper, to discern the fortunes or misfortunes of the household of So-and-so. The Scribe will ascend into the Dipper constellation and descend to inform the person of Heaven and Earth’s calamities or blessings, and of the fortunes or misfortunes in their life. Should exorcism be required, bid the Scribe to save them. Pray for longevity, and it shall be granted without fail.\n\nThe Yellow Emperor said: If you wish to exorcise disasters, avert harm, and transform misfortune into blessing, first recite the names of the Eight Scribes. Today, on this day of Haocheng, bid them descend and present themselves to exorcise calamities for the household of So-and-so. Whatever is required, the Perfected One shall swiftly dispatch the adamantine courier to hasten and return. Whatever you summon by mouth shall be obtained without fail. Transform misfortune into blessing, but do not kill, nor issue partial commands, lest people rush about in madness, drawn to love only themselves.\n\nIf you must issue a command, first remove and set aside the talisman, then command the Scribe at dusk before retiring. The same applies to matters of the bedchamber, lest the woman be shamed.\n\nThe Yellow Emperor said: If a woman possesses a love for the Dao, she should be allowed to serve the spirits in accordance with the method.\n\nIt is also stated in the *Illustrated Scripture of the Scribes*: \"Men serve their husbands, women serve their wives. Husband and wife serve together, as Qian and Kun follow the course of Heaven.\" Thus, when two are of one mind, their strength can sever metal. When they cultivate goodness together, their benefits run deep. Only then may they mount the Azure Dragon and roam the world with the spirits.\n\nGuard this well, guard it closely. Do not let the unruly Three Women or wicked, deceitful wives practice it. Those who cannot cultivate this will instead bring harm upon you. But if you diligently pursue it, once the Dao is achieved, the spirits will recognize you as a true person, and Heaven will naturally send the Jade Maiden of the Azure Waist to you.\n\nThe Yellow Emperor said: My former master, Lord Li, sat in the Court of Serene Contention and inscribed the position of the Supreme Micro-Emperor within the Dipper constellation. There, he beheld these Eight Talismanic Scripts and transmitted them to Lesser Omen. As I, Lesser Omen, did not understand their proper sequence, I kowtowed beneath the constellation and made offerings. When I copied the Eight Scribes, they came forth, relying on the spirit of the Eight Scribes and the Eight Trigrams. The talismans of the Eight Trigrams can restrain them, and the Eight Scribes will not bring harm to households.\n\nEvery household has Eight Scribes stationed before the central pillar of the hall, and they also stand upright within the Dipper. The Dipper Lord said: \"The affairs of the Daoist practitioner require the star talisman to restrain the unruly and punish transgressions.\" Only by receiving and cultivating the talisman will the spirits act. The prohibition of the Scribe Star Talisman is weighty. Do not transmit it lightly; unless the recipient is a worthy person or a gentleman, be cautious. Do not transmit it for a thousand gold; transmit it only to the worthy. If transmitted to the unworthy, calamity will ensue.\n\nIf you find such a person, make the offering as I have described. Follow the method of offering to the talisman, but do not offer beneath the Dipper. If you receive the Dipper Lord’s talisman without knowing this, the Scribe spirits will be startled. If they do not ascend to make their report, the Dipper Lord will hold the person accountable, and both will suffer calamity.\n\nFor the offering, arrange the seats of the Five Emperors in the four directions, each seat two *zhang* in length. Use silk according to the method to make mats for the seats. Place three tables in each seat, immaculately clean. Offer seven incense burners, seven lamps, seven bowls of date tea, and seven portions of the five fruits. In the center, arrange one round seat for the Scribe, with one table bearing one incense burner, one lamp, three portions of the five fruits, and a plate of green chestnuts and dates. Place the talisman in the center. On the round seat, arrange five plates of fruit and five incense burners. Invoke the Five Emperors, the Dipper Deities, the Twenty-Eight Constellations, the Most High Lord Lao, and the Divine Sovereign Fuxi. Then call the names of the Eight Trigrams and the Perfected One of the Talismanic Way. State: \"So-and-so, who loves the Dao, has come to seek and request the transmission of the star talisman. Today, it is fitting to transmit it to the worthy and enlightened. Arrange the five-colored seats according to their hues, bright and resplendent. Offer tea, seasonal fruits, and other items with meticulous reverence. Though you may not focus your thoughts, perform the offering beneath the Dipper. Do not invite many people, lest the spirits not descend.\"\n\nAfter the offering, transmit the talisman to the worthy one, who shall receive it with a bow. The true shall then be attached to them. First, purify yourself according to the method, and only then may you transmit it. When offering to the talisman or beneath the Dipper, do not call out loudly; simply invoke them in your heart.\n\nHere ends the *Illustrated Scripture of the Sacred Writ and True Forms of the Eight Scribes, Communicating with the Divine*.",
      "overlap_context": "ivate them, follow the above method, placing them in a crimson bag within your robe. Now, the Five Viscera are governed by the Crimson Palace’s Perfected One, *Zidan*, who will constantly befriend you. For exorcising disasters, averting harm, or any matter, wear the talisman as described below.\n\nWhen wearing the talisman, purify the time and offer a libation to it. Burn incense, place dates, ginseng, and *fuling* tea before the mat, and use yellow silk as a pure path. Bow twice and pray, saying:",
      "start_char": 2525,
      "end_char": 3678,
      "start_sentence": 110,
      "end_sentence": 140,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.11644721031189,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\灵图类\\太上通灵八史圣文真形图.txt",
        "category": "灵图类"
      }
    }
  ]
}