{
  "source_id": "太上养生胎息气经",
  "source_file": "chunked_daozang\\太上养生胎息气经.json",
  "total_chunks": 3,
  "total_original_chars": 3528,
  "total_translated_chars": 20388,
  "total_translation_time": 100.34695720672607,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\方法类\\太上养生胎息气经.txt",
    "category": "方法类"
  },
  "full_translation": "**The Supreme Scripture on Nurturing Life Through Embryonic Breathing**\n\n**Scripture Title:** *The Supreme Scripture on Nurturing Life Through Embryonic Breathing*. Author unknown. One scroll. Base text from *Daoist Canon of the Zhengtong Era*, *Dongshen* Section, Methods Category.\n\n*The Supreme Scripture on Nurturing Life Through Embryonic Breathing*\nThe *Shangqing* texts—*The Dao and Its Virtue*, *The Yellow Court Scripture*, and *Essential Collection on Nurturing Life*—enable one who follows them to dispel the myriad illnesses and ascend as an immortal of the *Shangqing* realm.\n\nIn all methods of qi-absorption, the mind must abide as an infant in the womb, achieving completion in ten months, with sinews and bones harmonized and supple. By stilling the mind and quieting thoughts, harmonious qi arrives of itself. With regulated breathing and proper swallowing, hunger ceases, the hundred pores open, and the in-breath flows without obstruction. Constantly drawing in the vital qi of the six yang hours, one’s strength increases daily.\n\n**Method of the Six Yang Hours**\n- **Midnight (Zi hour):** Inhale nine times nine, eighty-one breaths.\n- **Dawn (Yin hour):** Inhale eight times eight, sixty-four breaths.\n- **Breakfast (Chen hour):** Inhale seven times seven, forty-nine breaths.\n- **Noon (Wu hour):** Inhale six times six, thirty-six breaths.\n- **Afternoon (Shen hour):** Inhale five times five, twenty-five breaths.\n- **Dusk (Xu hour):** Inhale four times four, sixteen breaths.\n\nIn qi-absorption, the tongue must be dark; the dark must follow the gates of entry and exit.\n- The nose is the **Heavenly Gate**; when absorbing qi, the hun and po souls return to the Heavenly Gate.\n- The mouth is the **Earthly Door**; when absorbing qi, the hun and po souls return to the Earthly Door.\n\n*The Yellow Court Scripture* states:\n*\"The essence of the hundred grains is the earth’s spirit,\nThe five flavors’ external allure is foul with demonic stench.\nWash the numinous root with jade pool’s clear water—\nIf you cultivate this, you will replenish the Gate of Life.\"*\n\nTo attain longevity, draw qi in through the nose and release it through the mouth—this is the proper flow of qi. By cultivating thus with an unwavering true heart, expelling the Three Corpses, forsaking glory and desire, success accrues daily, and one gradually approaches the Dao.\n\nThe true person’s nature is serene and tranquil, their mind pure and refined, their words aligned with the Dao, their heart’s conduct flawless. Rinsing and swallowing the numinous fluid, the hundred flavors within the abdomen are self-sufficient. The Triple Burner is unblocked, the upright qi regulated, and qi circulates throughout, penetrating the five viscera and fortifying the marrow.\n\nThe Dao is the master of the myriad qi. The Dao is qi. Qi is the gate of essence. If one guards essence, it is like a house with an occupant—its measure endures for a hundred generations. If one lacks essence, it is like a house without an occupant—calamity befalls its generation.\n\nQi is preserved through essence. Essence is qi. When essence and qi are both complete, this is called a **true person**.\n\nHumans possess three cinnabar fields:\n- **Upper Cinnabar Field:** The mud-pill palace of the brain, where the Red Emperor’s son, Qing, resides, styled Yuanxian.\n- **Middle Cinnabar Field:** The heart, where the true person Guangjian dwells, styled Zidan.\n- **Lower Cinnabar Field:** The infant’s valley of mystery, styled Yuanyangzi, the gate of qi and essence.\n\nEach of the three palaces has its three spirits. If the spirits relax and qi leaks, qi leaks and essence dissipates; when essence dissipates, the spirits perish. Essence is a wondrous substance, the root of the true person’s longevity. The root of longevity is the seat of qi. When essence is complete, qi is complete; when essence leaks, qi leaks. Only essence and qi must be preserved in their entirety.\n\nThe ancient sages’ supreme Dao was to cherish qi and guard essence, thereby attaining longevity. When desire stirs the passions, restraint is not freely wielded—how can stability be maintained? This single lapse is perilous, like a mountain’s collapse or the sea’s exhaustion. The mountain is the treasure of qi; the treasure is the kidneys. The kidneys are the root of life. If the root lacks essence, the leaves wither; if the leaves wither, the branches decay; if the branches decay, the body withers. To seek rebirth then—how can it be saved?\n\nInhaled qi is yin; exhaled qi is yang. These two absorb the essence of the sun and moon. Qi is emptiness; emptiness is natural non-action; non-action is the heart’s stillness. With no external seeking and inner tranquility, tranquility stabilizes the spirit, the spirit stabilizes and qi harmonizes, harmonized qi invites the primordial qi, primordial qi arrives and the five viscera are nourished, the five viscera nourished and the hundred vessels flow freely, the hundred vessels flowing freely and the fluids ascend in response. Then the five flavors are unmissed, hunger and thirst vanish, and one extends years and reverses aging.\n\nQi transforms into blood, blood into marrow. In one year, qi is renewed; in two years, blood; in three years, the vessels; in four years, the flesh; in five years, the marrow; in six years, the sinews; in seven years, the bones; in eight years, the hair; in nine years, the form is transformed into a true person. After refining the nine returns and achieving mastery, the profound mysteries of immortality are beyond full description.\n\n**Shangqing Secret Methods of Qi**\n- **East:** Green sprout—this is the liver. Consume the green sprout, drinking the morning blossom. The morning blossom is the root of the upper teeth. With the tongue’s surface, lick the lips, rinse, and swallow.\n- **South:** Vermilion cinnabar—this is the heart. Consume the vermilion cinnabar, drinking from the cinnabar pool. The cinnabar pool is the root of the lower teeth. With the tongue’s surface, stir the tooth roots, rinse, and swallow.\n- **West:** Bright stone—this is the lungs. Consume the bright stone, drinking the numinous fluid. The numinous fluid is the saliva within the lips. With the tongue, circle the teeth seven times, rinse, and swallow.\n- **North:** Mysterious nourishment—this is the kidneys. Consume the mysterious nourishment, drinking the jade syrup. The jade syrup is the tongue. Guide the primordial qi with the nose, draw it into the mouth, breathe, and swallow.\n- **Center:** Wu and Ji—lofty Mount Tai. Mount Tai is the guardian of essence. Consume the essence-qi, drinking the sweet spring. The sweet spring lies before the dark prominence at the tooth roots; the flowery pool is beneath the tongue’s root, also called Jade Bloom or Golden Beam. Rinse and swallow each three times.\n\n**Method of Qi-Absorption:**\nRegularly rise at midnight (Zi hour) or dawn (Yin hour), adjust your attire, and with the Golden Beam, tap the Jade Bloom. Harmonize the flowery pool, rinse the sweet spring and numinous fluid, retract the nose’s breath, guide it upward to the head, then downward into the mouth, transforming it into jade spring. Draw the qi to the tongue’s root, swallow and send it forth, causing the throat to hum, the abdomen to hum, and guide the qi into the cinnabar field—like a newborn’s cry, this is called the **root of longevity**.\n\nHunger is sated with the natural qi; thirst is quenched with the nectar of the flowery pool, ensuring lasting satiety.\n\n**Upper Clarity Method:**\nEssence is my spirit; qi is my Dao. Cultivate essence to nourish the spirit, drink qi to imbibe its fragrance—like an infant in the womb. In seclusion, grasp the yang form to solidify it; yin completes its shape—this is refining essence to replenish the brain, also called \"refining and rinsing to fill the mouth with fluid,\" where all five flavors arise.\n\nEat at dawn and dusk to nourish yin; the five viscera generate lingzhi and jade bloom, allowing one to perceive a person’s inner nature from their outward appearance, with spirit and bearing clear and bright. One must tilt the head back to expel water from the viscera, then lean forward to expel food from the viscera. Next, lean against a wall, raise one foot, clench the fists, and stir the mouth with the tongue until the fluid fills it. Then visualize the qi being swallowed into the navel, descending to the feet as the measure, and clearly observe the intestines and stomach. If a finger can extinguish a lamp’s flame, this is the completion of eighty-one cycles, the end and beginning of heaven and earth. Refining the nine returns transforms blood into essence, essence into sinew, sinew into jade, and jade into immortal bones. This grants the natural ability to see a thousand li, becoming the body’s secret treasure, extending years and reversing aging, so that riding clouds and mounting cranes to ascend as an immortal may be awaited with ease. Those whose qi and form do not align with the Dao must not be taught, for leaking sacred texts to the unworthy brings calamity upon nine generations.\n\nWhen swallowing qi, exert force, keep the mouth closed, and raise the tongue to hollow the space beneath—this is called \"swallowing primordial qi.\" Daily, reduce food intake; each morning, absorb qi. Drink a cup of fine wine at all times—this is for beginners. Within the realm of heaven and earth, the sage dwells therein, attaining the Dao. Those lacking wisdom, the Dao, or benevolence dwell therein as well, but reap misfortune. The Dao of heaven is established as yin and yang; the Dao of earth as softness and hardness; the Dao of humanity as benevolence and righteousness. Heaven and earth contain essence, and the myriad things transform and arise. The Dao cannot be sought through emotion nor explained through language; the myriad things follow heaven and return to spontaneity.\n\n**Timed Visualization for Supplementation and Drainage:**\nThe sage seeking longevity knows that bedroom affairs can kill. My life is in my hands—all illnesses stem from indulgence and failure to preserve essence. Today, people only know to take medicine but not to cherish and protect their essence and marrow. Preserving essence and marrow extends life. Drinking jade spring is the mysterious fluid. Endowed with an eight-chi frame and a heart containing the myriad existences, the vessel of life holds the secret art of long life. Guard it as a treasure: calm the spirit, refine the form, walk on water without sinking, enter fire without burning. This is qi circulating within and spirit responding without, purifying the five viscera, exhaling and inhaling to supplement and drain the true origin.\n\n**Lung Visceral Diagram:**\nUse swallowing to drain, exhaling to supplement.\nThe lung is the qi of *dui*, the essence of metal, its color white. It governs the *po*, transforming into a jade youth, seven inches tall, a white beast. When its spirit is preserved, its form is whole. The lung connects to the large intestine and governs the nose above. Excessive fear scatters the *po* from the lung; intolerance of cold indicates a thin lung. A fresh, pale complexion shows the lung is free of other ailments. Rumbling in the large intestine signals qi congestion; frequent sighing is inauspicious. The lung governs the seven palaces of Jingmen. On the day of the Beginning of Autumn, at dawn, sit facing due west, strike the heavenly drum seven times, drink the jade spring nectar three times, close the eyes and concentrate, visualizing the white qi of *dui* palace entering the mouth and swallowing it thrice. Then the youthful spirit is at peace, no evil can harm, no blade can injure, and years are extended with longevity—this is supplementing and draining spirit and qi to calm and settle the numinous *po*.\n\n**Heart Visceral Diagram:**\nUse exhaling to drain, hissing to supplement.\nThe heart is the qi of *li*, the essence of fire, its color red. Its spirit is the Vermilion Bird, transforming into a jade maiden, eight inches tall. To pacify its spirit and preserve its form, harmonize it with the center. The heart connects to the small intestine, governs blood and vessels, and rules the tongue above. Blood congestion startles the tongue, causing loss of taste; heart disorder leads to frequent sighing. The heart governs the nine palaces of Jingmen, harmonious and whole in form. On the day of the Beginning of Summer, at dawn, sit facing due south, tap the Golden Beam nine times, rinse with the mysterious spring, swallow thrice, focus the mind and visualize, drawing the red qi of *li* palace into the mouth and swallowing it thrice to supplement the numinous palace. The jade maiden of *li* is at peace, the body secure, no misfortune can harm, and the spirit attains numinosity.\n\n**Liver Visceral Diagram:**\nUse hissing to drain, blowing to supplement.\nThe liver is the qi of *zhen*, the essence of wood, its color green. It governs the *hun*, its spirit like a dragon, transforming into two jade youths, one green and one yellow, each seven inches tall, one bearing a dragon, the other holding jade nectar. To secure its longevity, harmonize it with the Great Clarity. The liver connects to the sinews and governs the eyes above; heat in the eyes injures the liver. The liver governs the affairs of spring, containing the essence-qi of spring, when the myriad things flourish, following the way of yang. On the day of the Beginning of Spring, at dawn, sit facing east, strike the teeth three times, hold the breath for seven cycles, draw the green qi of *zhen* palace into the mouth, and swallow it thrice to reach the two youths of the liver—this is the subtlety of nourishing essence.\n\n**Spleen Visceral Diagram:**\nUse exhaling to drain, exhaling to supplement.\nThe spleen is the qi of *kun*, the essence of earth, its color yellow, resembling an overturned basin. Its spirit is like a phoenix, transforming into a jade maiden, six inches tall. It harmonizes with the Great Yin and governs the mouth above; a moist, lustrous complexion indicates no other ailments. The spleen has no fixed position, lodging in each of the four seasons for eighteen days each. At dawn, sit upright in the central palace, hold the breath for five cycles, strike the heavenly drum seven times, draw the yellow qi of the central palace into the mouth and swallow it, drinking jade nectar to attain its subtlety.\n\nHumans receive the Dao of heaven, managing the upright qi, guarding the essence of the bedroom, and preserving life to attain longevity. Visualize the flowery pool, drink jade fluid, harmonize the qi to prevail, regulate the hundred vessels, close the breath at the essence’s source, contain the true to reverse aging—this is the secret of guarding the true for long life.\n\nThe kidneys’ chart employs *chui* for draining and *yan* for replenishing the kidneys, which govern essence and the qi of Kan. Their color is black. Their form is round, also called \"curved.\" Their spirit resembles a white deer, transforming into a jade youth, one foot in length. All things refine their essence, align with their will, and preserve their truth, uniting with the Great Clarity. The kidneys correspond to the bones and govern the ears above. If the waist cannot straighten, the kidneys are cold.\n\nOn the day of the Beginning of Winter, face north, sit at dawn, strike the golden beam five times, drink jade spring thrice, draw the black qi of the Dark Palace into the mouth and swallow it to attain the jade youth’s composition. When spirit and body harmonize, one may attain long life.\n\nThe gallbladder’s chart employs *xi* for draining and *xu* for replenishing the gallbladder, the essence of metal and the qi of water. Its color is green. Its spirit resembles a tortoise, transforming into a jade maiden, one foot in length, its spirit courageous. The gallbladder corresponds to the bladder; a greenish complexion indicates no other ailments. Regularly at the start of the month, sit upright, focus the mind on the northern darkness, draw black qi into the mouth, swallow nine times, and drink the nectar of jade spring to achieve the qi’s subtlety.\n\nJoy and anger harm one’s nature; excessive pleasure injures the spirit. When the spirit is harmed, life is encroached upon; when nature is damaged, life is harmed. Cultivate nature to vitalize qi, preserve the spirit to calm the heart. When qi is balanced, the body harmonizes; when essence is whole, the heart is at ease. These are the secret words of refining truth, the immortal arts of long life.\n\nQi is the master of the body; to master it is to guard essence. Essence is the body’s utmost; the Dao connects to immortality. Essence is the root of life; preserving essence and valuing qi enable long life—this is the Dao’s foundation. Humans lose the Dao; the Dao does not lose humans.\n\nFor qi-ingestion, sit calmly in a quiet chamber, close the eyes in stillness, distend the abdomen and puff the cheeks to fill the mouth with qi, then open the qi passage, click the teeth, and swallow, nine times constituting one breath. In spring and summer, ingest cool qi; in autumn and winter, ingest warm qi. Each night at the fifth watch, cover the mouth with both palms, press firmly into the palms, gather saliva to rub the face until the skin glows. Frequently sip jujube-honey decoction to aid this, eat sparingly daily, and ingest qi each morning—qi will readily take form.\n\nIn all cultivation, never let others know. If others know, my life arises; if my life arises, fame arrives; if fame arrives, misfortune comes; if misfortune comes, there is no peace. The utmost Dao’s nature is most still and thus incorruptible. Knowing this and refining it is called true correctness.\n\nJade uncarved becomes no vessel; humans unlearned know not the Dao. Water’s nature, unadulterated, is clear; undisturbed, it is level—this is the true nature embracing unity, serene and vast, outwardly empty and inwardly void. The utmost Dao is non-action, yet nothing is left undone. Emptiness and nothingness unite with the body, naturally merging with truth, abiding in stillness for long duration.\n\nThe Great Dao models heaven and emulates earth. The ancients recounted antiquity, ascending from the mundane to sagehood and transforming into immortal bones. They inhaled and exhaled yin and yang, breathed as an embryo breathes the sun and moon, closed the mouth to contain emptiness, and the upper and lower numinous fluids arrived of themselves, slowly swallowing them.\n\nThose who study the Dao ingest qi as the worldly crave food—thus the Dao is accomplished. The Dao’s method lies in inner cultivation, preserving the whole form. Preserving the Dao calms the spirit; immortal arts differ, but the perfected one’s utmost Dao depends on the person. Humans can magnify the Dao; the Dao does not magnify humans. The qi-Dao is lofty and wondrous, attaining long life.\n\nAll qi-swallowing connects three swallows: two dry, one moist. Dry refers to clouds moving; moist refers to rain descending. Following heaven’s Dao, the nose draws in qi, the hun-soul returns to the heavenly gate, the mouth savors the five flavors, and the hun and po souls return to the earthly portal.\n\nIt is also said: the nose connects to the Jade Pool of Upper Clarity; the mouth connects to the Human Gate of Great Harmony. Rinsing to fill with numinous fluid, the five viscera become clear and refreshed. The mysterious and wondrous Dao does not abandon the myriad things; the myriad things arise of themselves. Qi is the hundred practices; the Dao of qi forms itself.\n\nThe Dao—its arising is like toil; its ceasing is like rest. Not resting is called exhaustion; using essence without cease is called labor. Labor leads to depletion; depletion leads to death. That which is pure and unadulterated, still and unchanging—this is the utmost of cultivating Dao-qi.\n\nThe pure and plain Dao unites with the spirit as one. \"One\" is what the perfected call \"natural.\" Qi can harmonize the six viscera, pacify the heart-spirit, and enable long life. This is the undying Dao. You possess the immortal’s countenance and have obtained my *Qi Classic*. Within it are the Yellow Court Perfected One, the Central Jade Maiden, and the Great Emperor of Fusang. You have received this, inscribed in gold, the secret words of refining truth.\n\nThus concludes the *Supreme Scripture on Nurturing Life and Embryonic Breathing*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上养生胎息气经 经名：太上养生胎息气经。 不着撰人。 一卷。 底本出处：《正统道藏》洞神部方法类。 太上养生胎息气经 上清《道德》并《黄庭经》、《养生要集》，人能依此，去万病，通上清神仙。 凡服气法，存心如婴儿在母胎，十月成就，筋骨和柔。 以冥心息念，和气自至，呼吸如法，咽之不饥，百毛孔开，入息不拥滞，常取六阳时食生气，气力日增。 六阳时法 夜半子时，服九九八十一。 平旦寅时，服八八六十四。 食时辰时，服七七四十九。 正中午时，服六六三十六。 哺时申时，服五五二十五。 黄昏戌时，服四四一十六。 夫服气，舌须玄，玄须依门户出入。 鼻为天门，服气魂魄归天门； 口为地户，服气魂魄归地户。 《黄庭经》曰：百谷之实土地精，五味外美邪魔腥。 玉池清水灌灵根，子能修之补命门。 欲获长生，从鼻入口出，即为顺气。 修依此，真心不辗，下却三尸，舍荣去爱，日渐成功，然始近道。 凡真人本性幽闲，用心清雅，发言合道，心行无瑕，漱咽灵津，腹中百味自足，通三焦，理正气，气自周遍，大通五藏，骨髓坚溢。 夫道为万气之主。 道者，气也。 气为精门，人若守精，如屋有人，其量百世； 人若无精，如屋无人，祸及其世。 气者，保於精。 精者，气也。 精气两全，是曰真人。 人有三丹田：上丹田泥丸脑，赤帝子卿，字元先； 中丹田心，真人光坚，字子丹； 下丹田婴儿谷玄，字元阳子，气精门也。 三宫各有三神，神舒气漏，气漏精泄，精泄即神丧。 精者妙物，真人长生根。 长生根者，气之位。 精全气全，精泄气泄。 唯精与气，须保全真。 先贤至道，爱气保精而能长生。 夫色动於情，制不自由，安能固哉此一倾危，如山崩海竭。 山者，气之宝，宝者，肾也。 肾为命根，根无精则叶痿，叶痿则枝朽，枝朽则身枯矣！ 思欲再生，焉能救也。 凡入气为阴，出气为阳，此二者服日月精华。 气者，虚无； 虚无者，自然无为； 无为者，心不动也。 外无求，内自然安静，安静则神定，神定即气和，气和即元气自至，元气自至即五藏滋润，五藏滋润即百脉通流，百脉通流即津液上应，津液上应即不思五味，无饥渴，延年却老。 气化为血，血化为髓，一年易气，二年易血，三年易脉，四年易肉，五年易髓，六年易筋，七年易骨，八年易发，九年易形为真人。 炼九还已通，神仙玄妙，不可具载。 上清气秘法 束方青牙，青牙者，肝。 服食青牙，饮以朝华。 朝华，上齿根也。 以舌表舐唇，漱而咽之。 南方朱丹，朱丹者，心。 服食朱丹，饮以丹池，丹池者，下齿根。 以舌表搅齿根，漱而咽之。 西方明石，明石者，肺。 服食明石，饮以灵液，灵液者，唇裹津。 以舌搅齿七匝，漱而咽之。 北方玄滋，玄滋者，肾。 服食玄滋，饮以玉饴，玉饴者，舌。 以鼻导引元气，入口呼吸而咽之。 中央戊己，昂昂太山，太山者，守精也。 服食精气，饮以醴泉。 醴泉在齿根玄膺前，华池在舌本下，一名玉英，又名金梁，已上漱而咽之，各三通也。 凡服气法：常以夜半子时寅时起，正衣冠，以金梁叩玉英，调华池，漱醴泉及灵液，缩鼻还之，上至头，下引入口中，变为玉泉，引气至於舌根，咽而送之，令喉中呜，腹中呜，引气入丹田，如儿生能啼，谓长生根也。",
      "translated_text": "**The Supreme Scripture on Nurturing Life Through Embryonic Breathing**\n\n**Scripture Title:** *The Supreme Scripture on Nurturing Life Through Embryonic Breathing*. Author unknown. One scroll. Base text from *Daoist Canon of the Zhengtong Era*, *Dongshen* Section, Methods Category.\n\n*The Supreme Scripture on Nurturing Life Through Embryonic Breathing*\nThe *Shangqing* texts—*The Dao and Its Virtue*, *The Yellow Court Scripture*, and *Essential Collection on Nurturing Life*—enable one who follows them to dispel the myriad illnesses and ascend as an immortal of the *Shangqing* realm.\n\nIn all methods of qi-absorption, the mind must abide as an infant in the womb, achieving completion in ten months, with sinews and bones harmonized and supple. By stilling the mind and quieting thoughts, harmonious qi arrives of itself. With regulated breathing and proper swallowing, hunger ceases, the hundred pores open, and the in-breath flows without obstruction. Constantly drawing in the vital qi of the six yang hours, one’s strength increases daily.\n\n**Method of the Six Yang Hours**\n- **Midnight (Zi hour):** Inhale nine times nine, eighty-one breaths.\n- **Dawn (Yin hour):** Inhale eight times eight, sixty-four breaths.\n- **Breakfast (Chen hour):** Inhale seven times seven, forty-nine breaths.\n- **Noon (Wu hour):** Inhale six times six, thirty-six breaths.\n- **Afternoon (Shen hour):** Inhale five times five, twenty-five breaths.\n- **Dusk (Xu hour):** Inhale four times four, sixteen breaths.\n\nIn qi-absorption, the tongue must be dark; the dark must follow the gates of entry and exit.\n- The nose is the **Heavenly Gate**; when absorbing qi, the hun and po souls return to the Heavenly Gate.\n- The mouth is the **Earthly Door**; when absorbing qi, the hun and po souls return to the Earthly Door.\n\n*The Yellow Court Scripture* states:\n*\"The essence of the hundred grains is the earth’s spirit,\nThe five flavors’ external allure is foul with demonic stench.\nWash the numinous root with jade pool’s clear water—\nIf you cultivate this, you will replenish the Gate of Life.\"*\n\nTo attain longevity, draw qi in through the nose and release it through the mouth—this is the proper flow of qi. By cultivating thus with an unwavering true heart, expelling the Three Corpses, forsaking glory and desire, success accrues daily, and one gradually approaches the Dao.\n\nThe true person’s nature is serene and tranquil, their mind pure and refined, their words aligned with the Dao, their heart’s conduct flawless. Rinsing and swallowing the numinous fluid, the hundred flavors within the abdomen are self-sufficient. The Triple Burner is unblocked, the upright qi regulated, and qi circulates throughout, penetrating the five viscera and fortifying the marrow.\n\nThe Dao is the master of the myriad qi. The Dao is qi. Qi is the gate of essence. If one guards essence, it is like a house with an occupant—its measure endures for a hundred generations. If one lacks essence, it is like a house without an occupant—calamity befalls its generation.\n\nQi is preserved through essence. Essence is qi. When essence and qi are both complete, this is called a **true person**.\n\nHumans possess three cinnabar fields:\n- **Upper Cinnabar Field:** The mud-pill palace of the brain, where the Red Emperor’s son, Qing, resides, styled Yuanxian.\n- **Middle Cinnabar Field:** The heart, where the true person Guangjian dwells, styled Zidan.\n- **Lower Cinnabar Field:** The infant’s valley of mystery, styled Yuanyangzi, the gate of qi and essence.\n\nEach of the three palaces has its three spirits. If the spirits relax and qi leaks, qi leaks and essence dissipates; when essence dissipates, the spirits perish. Essence is a wondrous substance, the root of the true person’s longevity. The root of longevity is the seat of qi. When essence is complete, qi is complete; when essence leaks, qi leaks. Only essence and qi must be preserved in their entirety.\n\nThe ancient sages’ supreme Dao was to cherish qi and guard essence, thereby attaining longevity. When desire stirs the passions, restraint is not freely wielded—how can stability be maintained? This single lapse is perilous, like a mountain’s collapse or the sea’s exhaustion. The mountain is the treasure of qi; the treasure is the kidneys. The kidneys are the root of life. If the root lacks essence, the leaves wither; if the leaves wither, the branches decay; if the branches decay, the body withers. To seek rebirth then—how can it be saved?\n\nInhaled qi is yin; exhaled qi is yang. These two absorb the essence of the sun and moon. Qi is emptiness; emptiness is natural non-action; non-action is the heart’s stillness. With no external seeking and inner tranquility, tranquility stabilizes the spirit, the spirit stabilizes and qi harmonizes, harmonized qi invites the primordial qi, primordial qi arrives and the five viscera are nourished, the five viscera nourished and the hundred vessels flow freely, the hundred vessels flowing freely and the fluids ascend in response. Then the five flavors are unmissed, hunger and thirst vanish, and one extends years and reverses aging.\n\nQi transforms into blood, blood into marrow. In one year, qi is renewed; in two years, blood; in three years, the vessels; in four years, the flesh; in five years, the marrow; in six years, the sinews; in seven years, the bones; in eight years, the hair; in nine years, the form is transformed into a true person. After refining the nine returns and achieving mastery, the profound mysteries of immortality are beyond full description.\n\n**Shangqing Secret Methods of Qi**\n- **East:** Green sprout—this is the liver. Consume the green sprout, drinking the morning blossom. The morning blossom is the root of the upper teeth. With the tongue’s surface, lick the lips, rinse, and swallow.\n- **South:** Vermilion cinnabar—this is the heart. Consume the vermilion cinnabar, drinking from the cinnabar pool. The cinnabar pool is the root of the lower teeth. With the tongue’s surface, stir the tooth roots, rinse, and swallow.\n- **West:** Bright stone—this is the lungs. Consume the bright stone, drinking the numinous fluid. The numinous fluid is the saliva within the lips. With the tongue, circle the teeth seven times, rinse, and swallow.\n- **North:** Mysterious nourishment—this is the kidneys. Consume the mysterious nourishment, drinking the jade syrup. The jade syrup is the tongue. Guide the primordial qi with the nose, draw it into the mouth, breathe, and swallow.\n- **Center:** Wu and Ji—lofty Mount Tai. Mount Tai is the guardian of essence. Consume the essence-qi, drinking the sweet spring. The sweet spring lies before the dark prominence at the tooth roots; the flowery pool is beneath the tongue’s root, also called Jade Bloom or Golden Beam. Rinse and swallow each three times.\n\n**Method of Qi-Absorption:**\nRegularly rise at midnight (Zi hour) or dawn (Yin hour), adjust your attire, and with the Golden Beam, tap the Jade Bloom. Harmonize the flowery pool, rinse the sweet spring and numinous fluid, retract the nose’s breath, guide it upward to the head, then downward into the mouth, transforming it into jade spring. Draw the qi to the tongue’s root, swallow and send it forth, causing the throat to hum, the abdomen to hum, and guide the qi into the cinnabar field—like a newborn’s cry, this is called the **root of longevity**.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1278,
      "start_sentence": 0,
      "end_sentence": 68,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.48650026321411,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太上养生胎息气经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "饥食自然气，渴饮华池浆，使长饱也。 上清法 精是吾神，气是吾道。 畜精养神，饮气芳香； 谓婴儿在胞中。 幽隐握阳形固，阴成其形； 谓炼精补脑，一名炼漱满津液，口中五味皆至。 朝食暮食阴，五藏生灵芝玉英，视人从表知裹，神仪清朗。 须仰排水藏，覆排食藏，次倚壁翘一足，拳两手，以舌搅口中，候津液满口，即想气咽入脐，至脚为度，彻视肠胃，指能吹灯，谓九九八十一，天地之终始。 能炼九还，即血化为精，精化为筋，筋化为玉，玉变仙骨。 此得自然目视千里，得之为身之秘宝，延年却老，乘云驾鹤，登仙可翘足而待之。 非其气像，不合道者，勿传。 谓泄漏灵文，传之非道，九族受殃。 凡咽气用力，闲口举舌，令舌下空，名咽元气。 日日臧食，朝朝进气，时时饮好酒一杯，谓初学人，天地之问，圣人在其中，得其道也。 不智、不道、不仁在其中，得其殃。 立天之道日阴与阳，立地之道日柔与刚，立人之道曰仁与义。 天地含精，万物化生，道不可以情求，不可以语诂，万物任天，归乎自然矣。 检时含景补泻图 圣人欲得长生，房中之事能杀人，我命在我，有万病者皆由恣意，不知保惜。 今人唯知服药，不知爱保精髓。 保精髓者，以致延命。 饮玉泉即玄液也。 禀八尺之质，含万有之心，生命之器，灵秘长生之术，如宝守之，安神炼形，履水不溺，入火不焚，谓气运於内，神应於外，淘炼五藏，吐纳补泻真元。 肺藏图用咽为泻，呼为补 夫肺，兑之气，金之精，其色白。 肺主魄，化为玉童，长七寸，白兽。 其神存，其形全。 肺合大肠，上主鼻。 多怖惧，魄离肺也； 不耐寒，肺薄； 颜色鲜白，肺无他病； 大肠呜，气拥也； 频嘘不祥。 肺主七官京门。 立秋日，平旦面正西坐，呜天鼓七通，饮玉泉浆，三咽，瞑目正思，兑宫白气入口，吞之三，则童神安，百邪不能殃，兵刃不能害，延年益寿，谓补泻神气，安息灵魄。 心藏图用呵为泻，嘘为补 夫心者，离之气，火之精，其色赤。 其神朱雀，化为玉女，长八寸。 欲安其神而全其形，合乎中和。 心合小肠，主血脉，上主舌。 血拥惊舌，不知味； 心乱多嘘。 心主九宫惊门，和而形全。 立夏日，平旦面向南端坐，叩金梁九通，漱玄泉，三咽，精思注想，吸离官赤气入口，三吞，以补灵府，离玉女，神平体安，百殃不害，神至灵也。 肝藏图用嘘为泻，吹为补 夫肝，震之气，木之精，其色青，肝主魂，其神如龙，化为二玉童，一青一黄。 各长七寸，一负龙，一持玉浆。 欲安其龄，合乎太清。 肝合乎胜理，上主目，目热肝伤也。 肝主春用事，含春精气，万物繁茂，顺阳之道。 立春日，常以寅时面向束，平坐，叩齿三通，闭气七息，吸震宫青气，三吞之，致二童肝，养精之妙也。 脾藏图用呼为泻，呵为补 夫脾者，坤之气，土之精，其色黄，像覆盆。 其神如凤，化为玉女，长六寸。 合太阴，上主口，颜色湿润无他也。 脾无定位，寄王四季，各一十八日。 清旦正坐中官，禁忌五息，呜天鼓七，吸中宫黄气，入口吞之，饮玉醴以致其妙。 人禀天道，经营正气，守我房中之精，保命得长生。 存想华池，饮玉液，和气相胜，百脉调畅，闭息精源，含真却老，此名守真长生秘诀。",
      "translated_text": "Hunger is sated with the natural qi; thirst is quenched with the nectar of the flowery pool, ensuring lasting satiety.\n\n**Upper Clarity Method:**\nEssence is my spirit; qi is my Dao. Cultivate essence to nourish the spirit, drink qi to imbibe its fragrance—like an infant in the womb. In seclusion, grasp the yang form to solidify it; yin completes its shape—this is refining essence to replenish the brain, also called \"refining and rinsing to fill the mouth with fluid,\" where all five flavors arise.\n\nEat at dawn and dusk to nourish yin; the five viscera generate lingzhi and jade bloom, allowing one to perceive a person’s inner nature from their outward appearance, with spirit and bearing clear and bright. One must tilt the head back to expel water from the viscera, then lean forward to expel food from the viscera. Next, lean against a wall, raise one foot, clench the fists, and stir the mouth with the tongue until the fluid fills it. Then visualize the qi being swallowed into the navel, descending to the feet as the measure, and clearly observe the intestines and stomach. If a finger can extinguish a lamp’s flame, this is the completion of eighty-one cycles, the end and beginning of heaven and earth. Refining the nine returns transforms blood into essence, essence into sinew, sinew into jade, and jade into immortal bones. This grants the natural ability to see a thousand li, becoming the body’s secret treasure, extending years and reversing aging, so that riding clouds and mounting cranes to ascend as an immortal may be awaited with ease. Those whose qi and form do not align with the Dao must not be taught, for leaking sacred texts to the unworthy brings calamity upon nine generations.\n\nWhen swallowing qi, exert force, keep the mouth closed, and raise the tongue to hollow the space beneath—this is called \"swallowing primordial qi.\" Daily, reduce food intake; each morning, absorb qi. Drink a cup of fine wine at all times—this is for beginners. Within the realm of heaven and earth, the sage dwells therein, attaining the Dao. Those lacking wisdom, the Dao, or benevolence dwell therein as well, but reap misfortune. The Dao of heaven is established as yin and yang; the Dao of earth as softness and hardness; the Dao of humanity as benevolence and righteousness. Heaven and earth contain essence, and the myriad things transform and arise. The Dao cannot be sought through emotion nor explained through language; the myriad things follow heaven and return to spontaneity.\n\n**Timed Visualization for Supplementation and Drainage:**\nThe sage seeking longevity knows that bedroom affairs can kill. My life is in my hands—all illnesses stem from indulgence and failure to preserve essence. Today, people only know to take medicine but not to cherish and protect their essence and marrow. Preserving essence and marrow extends life. Drinking jade spring is the mysterious fluid. Endowed with an eight-chi frame and a heart containing the myriad existences, the vessel of life holds the secret art of long life. Guard it as a treasure: calm the spirit, refine the form, walk on water without sinking, enter fire without burning. This is qi circulating within and spirit responding without, purifying the five viscera, exhaling and inhaling to supplement and drain the true origin.\n\n**Lung Visceral Diagram:**\nUse swallowing to drain, exhaling to supplement.\nThe lung is the qi of *dui*, the essence of metal, its color white. It governs the *po*, transforming into a jade youth, seven inches tall, a white beast. When its spirit is preserved, its form is whole. The lung connects to the large intestine and governs the nose above. Excessive fear scatters the *po* from the lung; intolerance of cold indicates a thin lung. A fresh, pale complexion shows the lung is free of other ailments. Rumbling in the large intestine signals qi congestion; frequent sighing is inauspicious. The lung governs the seven palaces of Jingmen. On the day of the Beginning of Autumn, at dawn, sit facing due west, strike the heavenly drum seven times, drink the jade spring nectar three times, close the eyes and concentrate, visualizing the white qi of *dui* palace entering the mouth and swallowing it thrice. Then the youthful spirit is at peace, no evil can harm, no blade can injure, and years are extended with longevity—this is supplementing and draining spirit and qi to calm and settle the numinous *po*.\n\n**Heart Visceral Diagram:**\nUse exhaling to drain, hissing to supplement.\nThe heart is the qi of *li*, the essence of fire, its color red. Its spirit is the Vermilion Bird, transforming into a jade maiden, eight inches tall. To pacify its spirit and preserve its form, harmonize it with the center. The heart connects to the small intestine, governs blood and vessels, and rules the tongue above. Blood congestion startles the tongue, causing loss of taste; heart disorder leads to frequent sighing. The heart governs the nine palaces of Jingmen, harmonious and whole in form. On the day of the Beginning of Summer, at dawn, sit facing due south, tap the Golden Beam nine times, rinse with the mysterious spring, swallow thrice, focus the mind and visualize, drawing the red qi of *li* palace into the mouth and swallowing it thrice to supplement the numinous palace. The jade maiden of *li* is at peace, the body secure, no misfortune can harm, and the spirit attains numinosity.\n\n**Liver Visceral Diagram:**\nUse hissing to drain, blowing to supplement.\nThe liver is the qi of *zhen*, the essence of wood, its color green. It governs the *hun*, its spirit like a dragon, transforming into two jade youths, one green and one yellow, each seven inches tall, one bearing a dragon, the other holding jade nectar. To secure its longevity, harmonize it with the Great Clarity. The liver connects to the sinews and governs the eyes above; heat in the eyes injures the liver. The liver governs the affairs of spring, containing the essence-qi of spring, when the myriad things flourish, following the way of yang. On the day of the Beginning of Spring, at dawn, sit facing east, strike the teeth three times, hold the breath for seven cycles, draw the green qi of *zhen* palace into the mouth, and swallow it thrice to reach the two youths of the liver—this is the subtlety of nourishing essence.\n\n**Spleen Visceral Diagram:**\nUse exhaling to drain, exhaling to supplement.\nThe spleen is the qi of *kun*, the essence of earth, its color yellow, resembling an overturned basin. Its spirit is like a phoenix, transforming into a jade maiden, six inches tall. It harmonizes with the Great Yin and governs the mouth above; a moist, lustrous complexion indicates no other ailments. The spleen has no fixed position, lodging in each of the four seasons for eighteen days each. At dawn, sit upright in the central palace, hold the breath for five cycles, strike the heavenly drum seven times, draw the yellow qi of the central palace into the mouth and swallow it, drinking jade nectar to attain its subtlety.\n\nHumans receive the Dao of heaven, managing the upright qi, guarding the essence of the bedroom, and preserving life to attain longevity. Visualize the flowery pool, drink jade fluid, harmonize the qi to prevail, regulate the hundred vessels, close the breath at the essence’s source, contain the true to reverse aging—this is the secret of guarding the true for long life.",
      "overlap_context": " (Zi hour) or dawn (Yin hour), adjust your attire, and with the Golden Beam, tap the Jade Bloom. Harmonize the flowery pool, rinse the sweet spring and numinous fluid, retract the nose’s breath, guide it upward to the head, then downward into the mouth, transforming it into jade spring. Draw the qi to the tongue’s root, swallow and send it forth, causing the throat to hum, the abdomen to hum, and guide the qi into the cinnabar field—like a newborn’s cry, this is called the **root of longevity**.",
      "start_char": 1278,
      "end_char": 2522,
      "start_sentence": 69,
      "end_sentence": 128,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.002941370010376,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太上养生胎息气经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "肾藏图用吹为泻，咽为补夫肾，主精，坎之气，其色黑。 其像圆，一名而曲。 其神如白鹿，化为玉童，长一尺。 万物治其精，顺其志，全其真，合乎太清。 肾合骨，上主耳。 腰不能伸，肾玲。 立冬日，面北向，平旦坐，呜金梁五通，饮玉泉三，吸玄宫黑气吞之，以致玉童之撰，神和体平，而能长生矣。 胆藏图用嘻为泻，嘘为补 夫胆，金之精，水之气，其色青。 其神如龟，化为玉女，长一尺，其神勇。 胆合膀胱，颜貌青，无其他。 常以孟月端坐，正思北玄，吸黑气入口，九吞，饮玉泉之浆，气之致也。 喜怒损性，一展乐伤神，神伤侵命，损性害生，养性以生气，保神以安心，气平，体和，精全心逸。 此炼真秘言，灵宝长生之诀。 夫气为身之主，主之者守精。 精是身之至，道通神仙； 精是命根，保精重气而能长生，道之宗也。 人自失道，非道失人。 凡服气，静室安坐，寂然瞑目，努腹鼓腮，令气满口，即气肠开，叩齿咽之，九下为一息。 春夏服玲气，秋冬服暖气，每夜至五更，即以两掌掩口，着力掌中，取津液拭摩面，皮光泽，时时含枣蜜汤助之，日日喊食，朝朝进气，气即易成。 凡修行切勿令人知，人知即我生，我生即名至，名至即祸来，祸来即不安。 至道性余至静则廉，知之修炼谓之正真。 玉不琢不成器，人不学不知道。 水性不杂即清，不动即平，谓之真性抱一，闲旷寂然，外无内虚，至道无为，无所不为，虚无合体，自然合真，湛然长久？ 夫大道法天象地。 古人述古，从凡入圣而变仙骨。 呼吸阴阳，胎息日月，闭口含虚，合口上下灵液自至，徐徐咽之。 学道之人，服气犹如世人思食，道即成矣。 道法内修，可保全形。 全道安神，仙道有异，真人至道，道自依人，人能弘道，非道弘人，气道高妙而获长生。 凡咽气皆连三咽，二乾一湿； 乾谓云行，湿谓雨施。 顺天之道，鼻引气魂，魄归天门，口嗜五味，魂魄归地户。 又云：鼻通玉池上清，口通人门太和，漱满灵液，五藏清爽。 玄妙之道，不遗万物，万物自生，气为百行，自成气之道。 道，其生也若劳，其死也若休，而不休日弊，精用不已日劳，劳即竭，竭即死。 所谓纯一而不杂，静一而不变，此养道气之至。 纯素之道，与神为一。 一，真人所谓自然。 气可以和六腑，宁心神，使得长生。 此文不死之道，子有仙相，得吾《气经》，内有黄庭真人、中华玉女、扶桑大帝，君得之，镂金书，炼真之秘言焉。 太上养生胎息气经竟",
      "translated_text": "The kidneys’ chart employs *chui* for draining and *yan* for replenishing the kidneys, which govern essence and the qi of Kan. Their color is black. Their form is round, also called \"curved.\" Their spirit resembles a white deer, transforming into a jade youth, one foot in length. All things refine their essence, align with their will, and preserve their truth, uniting with the Great Clarity. The kidneys correspond to the bones and govern the ears above. If the waist cannot straighten, the kidneys are cold.\n\nOn the day of the Beginning of Winter, face north, sit at dawn, strike the golden beam five times, drink jade spring thrice, draw the black qi of the Dark Palace into the mouth and swallow it to attain the jade youth’s composition. When spirit and body harmonize, one may attain long life.\n\nThe gallbladder’s chart employs *xi* for draining and *xu* for replenishing the gallbladder, the essence of metal and the qi of water. Its color is green. Its spirit resembles a tortoise, transforming into a jade maiden, one foot in length, its spirit courageous. The gallbladder corresponds to the bladder; a greenish complexion indicates no other ailments. Regularly at the start of the month, sit upright, focus the mind on the northern darkness, draw black qi into the mouth, swallow nine times, and drink the nectar of jade spring to achieve the qi’s subtlety.\n\nJoy and anger harm one’s nature; excessive pleasure injures the spirit. When the spirit is harmed, life is encroached upon; when nature is damaged, life is harmed. Cultivate nature to vitalize qi, preserve the spirit to calm the heart. When qi is balanced, the body harmonizes; when essence is whole, the heart is at ease. These are the secret words of refining truth, the immortal arts of long life.\n\nQi is the master of the body; to master it is to guard essence. Essence is the body’s utmost; the Dao connects to immortality. Essence is the root of life; preserving essence and valuing qi enable long life—this is the Dao’s foundation. Humans lose the Dao; the Dao does not lose humans.\n\nFor qi-ingestion, sit calmly in a quiet chamber, close the eyes in stillness, distend the abdomen and puff the cheeks to fill the mouth with qi, then open the qi passage, click the teeth, and swallow, nine times constituting one breath. In spring and summer, ingest cool qi; in autumn and winter, ingest warm qi. Each night at the fifth watch, cover the mouth with both palms, press firmly into the palms, gather saliva to rub the face until the skin glows. Frequently sip jujube-honey decoction to aid this, eat sparingly daily, and ingest qi each morning—qi will readily take form.\n\nIn all cultivation, never let others know. If others know, my life arises; if my life arises, fame arrives; if fame arrives, misfortune comes; if misfortune comes, there is no peace. The utmost Dao’s nature is most still and thus incorruptible. Knowing this and refining it is called true correctness.\n\nJade uncarved becomes no vessel; humans unlearned know not the Dao. Water’s nature, unadulterated, is clear; undisturbed, it is level—this is the true nature embracing unity, serene and vast, outwardly empty and inwardly void. The utmost Dao is non-action, yet nothing is left undone. Emptiness and nothingness unite with the body, naturally merging with truth, abiding in stillness for long duration.\n\nThe Great Dao models heaven and emulates earth. The ancients recounted antiquity, ascending from the mundane to sagehood and transforming into immortal bones. They inhaled and exhaled yin and yang, breathed as an embryo breathes the sun and moon, closed the mouth to contain emptiness, and the upper and lower numinous fluids arrived of themselves, slowly swallowing them.\n\nThose who study the Dao ingest qi as the worldly crave food—thus the Dao is accomplished. The Dao’s method lies in inner cultivation, preserving the whole form. Preserving the Dao calms the spirit; immortal arts differ, but the perfected one’s utmost Dao depends on the person. Humans can magnify the Dao; the Dao does not magnify humans. The qi-Dao is lofty and wondrous, attaining long life.\n\nAll qi-swallowing connects three swallows: two dry, one moist. Dry refers to clouds moving; moist refers to rain descending. Following heaven’s Dao, the nose draws in qi, the hun-soul returns to the heavenly gate, the mouth savors the five flavors, and the hun and po souls return to the earthly portal.\n\nIt is also said: the nose connects to the Jade Pool of Upper Clarity; the mouth connects to the Human Gate of Great Harmony. Rinsing to fill with numinous fluid, the five viscera become clear and refreshed. The mysterious and wondrous Dao does not abandon the myriad things; the myriad things arise of themselves. Qi is the hundred practices; the Dao of qi forms itself.\n\nThe Dao—its arising is like toil; its ceasing is like rest. Not resting is called exhaustion; using essence without cease is called labor. Labor leads to depletion; depletion leads to death. That which is pure and unadulterated, still and unchanging—this is the utmost of cultivating Dao-qi.\n\nThe pure and plain Dao unites with the spirit as one. \"One\" is what the perfected call \"natural.\" Qi can harmonize the six viscera, pacify the heart-spirit, and enable long life. This is the undying Dao. You possess the immortal’s countenance and have obtained my *Qi Classic*. Within it are the Yellow Court Perfected One, the Central Jade Maiden, and the Great Emperor of Fusang. You have received this, inscribed in gold, the secret words of refining truth.\n\nThus concludes the *Supreme Scripture on Nurturing Life and Embryonic Breathing*.",
      "overlap_context": "en times, draw the yellow qi of the central palace into the mouth and swallow it, drinking jade nectar to attain its subtlety.\n\nHumans receive the Dao of heaven, managing the upright qi, guarding the essence of the bedroom, and preserving life to attain longevity. Visualize the flowery pool, drink jade fluid, harmonize the qi to prevail, regulate the hundred vessels, close the breath at the essence’s source, contain the true to reverse aging—this is the secret of guarding the true for long life.",
      "start_char": 2522,
      "end_char": 3469,
      "start_sentence": 129,
      "end_sentence": 170,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.857515573501587,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太上养生胎息气经.txt",
        "category": "方法类"
      }
    }
  ]
}