{
  "source_id": "太上瑶台益算宝籍延年忏",
  "source_file": "chunked_daozang\\太上瑶台益算宝籍延年忏.json",
  "total_chunks": 2,
  "total_original_chars": 2569,
  "total_translated_chars": 20883,
  "total_translation_time": 84.03313446044922,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\威仪类\\太上瑶台益算宝籍延年忏.txt",
    "category": "威仪类"
  },
  "full_translation": "**The Most High Jade Terrace Scripture for Increasing Lifespan and the Precious Register of Extended Years**\n\n*Title:* **The Most High Jade Terrace Scripture for Increasing Lifespan and the Precious Register of Extended Years** (*Taishang Yaotai Yisuan Baoji Yannian Chan*). One scroll.\n\n*Source:* *Zhengtong Daoist Canon*, *Dongshen* Section, *Weiyi* Category.\n\n---\n\nWith reverence, we invoke the august names of the Jade Capital and the sacred texts of the Golden Towers. To uphold them is to eternally preserve distant longevity; to venerate them is to perpetually draw upon supreme longevity.\n\nHere, the incense burners condense emerald mists, and candles illuminate crimson lotuses. We recite the wondrous sounds of the *Lingbao* scriptures, gazing upon the Most Holy of the Void and Nonexistence.\n\nThus, the Three Primes gather blessings, and the Eight Festivals beseech grace. At the appointed hour of the Moon Palace, the jade bells of Heavenly Treasures resonate in stillness; at the dawn of the Star Altar, the jade chimes of the Jasper Pool sound softly.\n\nWe raise the Dharma’s voice, chanting the drifting celestial hymns. With one hundred and fifty prostrations, we invoke the sagely titles of the Heavenly Worthies; in response to a hundred thousand myriad layers, the imperial wisdom of the Milky Way descends.\n\nBy the potent power subtly bestowed, the ninefold-refined Golden Elixir augments one’s lifespan; through the vast workings of mysterious compassion, the Jade Registers of the Three Clarities elevate one’s destiny.\n\nWe humbly entreat the High Emperor of the Purple Palace and the Most Holy of the Clear Capital, that their flourishing may endure like the pine and cypress, their fragrance rivaling the orchid and cassia. They grasp the Crimson Axe in their palms, casting a white radiance upon their crowns.\n\nTrue immortals assemble in celebration, as the secret talismans of extended years shield the body; dragons and tigers bestow blessings, as the numinous talismans of life preservation ward off calamity. Longevity swells like the Five Peaks, and fortune arises from the Ten Directions.\n\nWith utmost sincerity, we take refuge and pay homage.\n\n**Devoutly, we take refuge and submit our lives.** For each honored one, first recite: *\"Devoutly, we take refuge and submit our lives,\"* then intone the sacred title of the Heavenly Worthy.\n\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Mysterious Vault, the Supreme Emperor.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Grand Ultimate, the High Emperor.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Golden Radiance, the Purple Palace.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Jasper Treasure, the Cinnabar Terrace.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Vast Illuminating Virtue and the Dao.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Universal Salvation for the Mortal Realm.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Fortune Star’s Descending Blessings.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Benevolent Sun’s Returning Light.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Nine Palaces’ Lifespan Augmentation.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Eight Trigrams’ Extended Years.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Great Emperor of Pure Tenuity.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Purple Ultimate, the Primordial Emperor.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Floating Gauze and Emerald Sleeves.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Fragrant and Resplendent Treasure Mountain.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Longevity Honored in the Five Peaks.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Fortune Vast as the Four Seas.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Perpetual Arrival of the Phoenix Calendar.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Preserving the Tortoise Longevity.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Nine Heavens’ Blessings Assembled.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Ten Poles’ Descending Blessings.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Void and Phoenix Tower.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Vast and Distant Tortoise Terrace.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy Who Increases a Hundred Blessings.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy Who Receives a Thousand Auspices.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Terrace Mountain Who Receives Destiny.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Song Peak Who Ascends to Immortality.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Jade Light Illuminating the Chamber.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Treasure Torch Floating in the Void.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Nine Numinous Who Dispel Misfortune.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Two Qi’s Extended Life.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Ninefold Clarity’s Sagely Virtue.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Eight Sceneries’ Void and True.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Brightly Shining Longevity Star.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Fortune Sea’s Clarity.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Ascending the Ten Grotto-Heavens.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Three Sovereigns’ Manifest Response.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Perpetually Nourishing Myriad Goodness.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Eternally Harmonizing a Thousand Spirits.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Attaining the Dao Through Mountain Worship.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Ascending to Immortality Through Tree Veneration.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Golden Heaven’s Descending Image.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Jade Seat’s Upright Illumination.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Universally Receiving Sagely Transformation.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Pervasively Bestowing the True Wind.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Mysterious and Plain Wondrous Dao.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Azure Jade Numinous Text.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Cinnabar Terrace’s Lifespan Augmentation.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Precious Register’s Elevated Destiny.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Nine Heavens’ Eternal Joy.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Myriad Qi’s Perpetual Existence.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Sevenfold Brightness and Simurgh Canopy.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Nine-Colored Dragon Chariot.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Soaring Across the Eight Poles.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Mirroring and Illuminating the Ten Directions.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Auspicious Signs in Dreams.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Manifesting Numinous Traces.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Perpetually Expanding the Realm of Longevity.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Vastly Pouring Forth the Fount of Fortune.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Warding Off Calamities and Deflecting Misfortune.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Preserving Life and Extending Years.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Jade Void and Grotto Pass.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Golden Flower’s Upper Palace.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Ten Thousand Heavens’ Master of the Dao.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Three Realms’ Participation in the Mysteries.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Western City’s Responsive Sageliness.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Southern Culmen’s Penetrating Numinosity.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Merit Achieved and Tiger Longevity.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Dao Aligned with Dragon Might.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Perpetually Arriving Myriad Blessings.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Firmly Securing a Thousand Years.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Mysterious Dragon’s Dharma Chariot.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Plain Tiger’s Cloud Formation.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Radiant Moon’s Phase.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Marvelous Celestial Regalia.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Soaring Across the Eight Sceneries.\n\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Crimson Cord’s Nine Radiance.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Solemn and Sublime Majesty.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Subtle and Vast Cause.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Dao Attained on Mount Song.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Hua Peak’s Extended Longevity.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Purple Palace’s Thousand Springs.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Seven Treasures’ Flowering Grove.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Golden Hall’s Eternal Life.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Jade Grotto’s Everlasting Spring.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Myriad Spirits Gathering Auspiciousness.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Hundred Blessings Manifesting Auspicious Signs.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Peaceful and Prosperous Realm.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Transformations Harmonizing Humans and Devas.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Responding to Wishes with Supreme Power.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Following Thoughts to Fulfill the Heart.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Hundred Treasures’ Jasper Palace.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Sevenfold Radiance Jade Terrace.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Ninefold Light Crane Canopy.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Eight Sceneries’ Simurgh Chariot.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Mysterious Wind’s Vast Harmony.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Sagely Virtue’s Lofty Clarity.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Ever-Flourishing Scenic Elm.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Responding to Thoughts with Immediate Fulfillment.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Eternal Preservation and Guardianship.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Moon’s Cassia Everlasting Spring.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Supreme and Wondrous Dao.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Utmost Great Void.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Purple Gold Immortal Realm.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Yellow Jade Mysterious Hall.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Dragon’s Self-Mastery.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Imperial Chariot’s Eternal Life.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the White Light’s Auspicious Radiance.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Vermilion Axe’s True Script.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Vastly Arriving Blessings.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Perpetually Gathering Auspicious Omens.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Soaring Simurgh’s Cloud Pavilion.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Returning Dragon’s Jeweled Palace.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Jade Hall’s Eternal Celebration.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Golden Palace’s Perpetual Clarity.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of All-Pervading and Unfathomable Mystery.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Boundless Wisdom and Compassion.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Roaming the Jade Grotto.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Multicolored Rain’s Transformations.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Universally Receiving Sagely Blessings.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Eternally Benefiting Dao Affinities.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Jade Clarity Supreme Sage.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Golden Portal’s Utmost Perfected.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Nine Heavens Gathering Celebration.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Ten Grottoes’ Supreme Birth.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Penglai’s Effortless Ascent.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Kunlun’s Soaring Ascent.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Vast and Clear Blessing Sea.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Towering Longevity Mountain.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Peace and Bliss Everywhere.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Great Peace in All Places.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Supreme Clarity’s Utmost Dao.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Empty Portal’s Lofty Perfected.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Azure Clouds’ Golden Palace.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Purple Qi Jade Tower.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Vastly Bestowing Sagely Transformations.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Universally Harmonizing Heavenly Compassion.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Universally Arriving Hundred Blessings.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Perpetually Continuing Long Years.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Merits Fully Accomplished and Profoundly Complete.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Dao Aligned with the Mysterious Void.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Great Clarity’s Grotto Palace.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Supreme Realm’s Cloud Palace.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Nine Voids’ Jade Observatory.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Four Illuminations’ Golden Portal.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Perpetually Arriving Vast Blessings.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Eternally Preserving Long Life.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Longevity Star’s Eternal Radiance.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Inexhaustible Blessing Sea.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Vermilion City’s Lifespan.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Hua Peak’s Immortal Attainment.\nDevoutly, we take refuge and submit our lives to the Purple Pole Perfected of Longevity Extended and Years Increased.\nDevoutly, we take refuge and submit our lives to the Azure Empyrean Perfected of Vast Blessings and Extended Years.\nDevoutly, we take refuge and submit our lives to the Crimson Portal Perfected of Jade Talisman Preserving Life.\nDevoutly, we take refuge and submit our lives to the Cinnabar Empyrean Perfected of Golden Register Protecting Life.\n\nThe rites of offering and cultivation are now complete; we reverently pray to the deities and express our gratitude.\n\nIn seeking to widely explore and profoundly revere, we have specially exhausted our utmost sincerity. Desiring to pursue the extraordinary cause of longevity’s continuation, we humbly rely upon the Dao’s transformations of the Mysterious Origin. Thus, we gaze upward at the sagely images and personally face the numinous compassion. We know that lifespan can be augmented and immortality can be learned. Earnestly hoping for sagely grace, may the divine luminaries descend upon auspicious omens; reverently entrusting ourselves to the vast primordial qi, may creation subtly bestow its protection and guardianship. The incense smoke rises in verdant mists; the lamps burn with the brilliance of red lotuses. Through this, we initiate our reverent practice and extend our morning obeisance. A single strike of the Penglai bell resounds, and the melodious tones of the immortal grottoes’ terraces are heard everywhere.\n\nWe prostrate ourselves and pray: may you descend upon the ritual arena riding the rainbow banner and arrive at the jeweled realm following the iridescent pennants. May the human world’s calendrical years be ever renewed like the phoenix’s chronicle; may the time within the alchemical crucible be eternally secure like the tortoise’s longevity. Grant us the essentials of the Nine Palaces and transmit the texts of the Six Jia. May all within the four seas and eight directions universally attain long life and enduring vision.\n\nWe bow our heads to the Supreme Void’s Most High, Correct, and True Three Treasures.\n\nThe *Jade Terrace Longevity Register’s Ritual of Extended Years* is now complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上瑶台益算宝籍延年忏 经名：太上瑶台益算宝籍延年忏。 一卷。 底本出处：《正统道藏》洞神部威仪类。 太上瑶台益算宝籍延年忏 恭以玉京御号，金阙灵文。 奉之，则可以永保遐龄； 礼之，则可以常资上寿。 於是炉凝翠霭，烛映红蕖，课灵宝之妙音，瞻虚无之至圣。 遂乃三元集福，八节祈恩。 月殿登时，天宝之琼锺静扣； 星坛朝处，瑶池之玉磬轻敲。 将揭法音，哦飘仙梵。 礼一百五十，天尊睿号； 应百千万重，云汉宸聪。 睿力潜臻，九转之金丹益算； 玄慈广运，三清之玉籍上生。 伏惟紫府高皇、清都至圣，续以椿松之盛，比其兰桂之芳。 握赤斧於掌中，覆白光於顶上。 真仙集庆，延年之秘箓护身； 龙虎垂休，保命之灵符捍厄。 寿增五岳，福起十方。 谨当虔诚，归依朝礼。 志心归命每位先称志心归命，次念天尊圣号。 志心归命，玄穹上帝天尊。 志心归命，太极高皇天尊。 志心归命，金辉紫殿天尊。 志心归命，琼宝丹台天尊。 志心归命，广明德道天尊 志心归命，溥度人寰天尊 志心归命，福星垂佑天尊 志心归命，惠日回光天尊 志心归命，九宫益算天尊 志心归命，八卦延年天尊 志心归命，清微大帝天尊 志心归命，紫极元皇天尊 志心归命，浮罗翠袖天尊 志心归命，郁察宝山天尊 志心归命，寿崇五岳天尊 志心归命，福广四溟天尊 志心归命，常臻凤历天尊 志心归命，克保龟龄天尊 志心归命，九天集福天尊 志心归命，十极垂休天尊 志心归命，虚无凤阙天尊 志心归命，浩渺龟台天尊 志心归命，能增百福天尊 志心归命，克纳千祥天尊 志心归命，亭山受命天尊。 志心归命，嵩岳升真天尊。 志心归命，玉光照室天尊。 志心归命，宝炬浮空天尊。 志心归命，九灵消祸天尊。 志心归命，二炁延生天尊。 志心归命，九清圣德天尊。 志心归命，八景虚真天尊。 志心归命，寿星朗耀天尊。 志心归命，福海澄清天尊。 志心归命，飞升十洞天尊。 志心归命，应现三皇天尊。 志心归命，常滋万善天尊。 志心归命，永协千灵天尊。 志心归命，拜山得道天尊。 志心归命，礼树登仙天尊。 志心归命，金天垂像天尊。 志心归命，玉坐端明天尊。 志心归命，咸承睿化天尊。 志心归命，普洽真风天尊。 志心归命，玄素妙道天尊。 志心归命，青玉灵文天尊。 志心归命，丹台益算天尊。 志心归命，宝籍上生天尊。 志心归命，九天常乐天尊。 志心归命，万炁长存天尊。 志心归命，七明鸾盖天尊。 志心归命，九色龙舆天尊。 志心归命，飞腾八极天尊。 志心归命，鉴映十方天尊。 志心归命，感梦瑞相天尊。 志心归命，显现灵踪天尊。 志心归命，长增寿域天尊。 志心归命，广注福源天尊。 志心归命，棱灾捍厄天尊。 志心归命，保命延年天尊。 志心归命，玉虚洞关天尊。 志心归命，金华上宫天尊。 志心归命，万天师道天尊。 志心归命，三界参玄天尊。 志心归命，西城感圣天尊。 志心归命，南极通灵天尊。 志心归命，功成虎寿天尊。 志心归命，道契龙威天尊。 志心归命，常臻万福天尊。 志心归命，克固千龄天尊。 志心归命，玄龙法驾天尊。 志心归命，素虎云骈天尊。 志心归命，光明月相天尊。 志心归命，奇彩天仪天尊。 志心归命，翱翔八景天尊。",
      "translated_text": "**The Most High Jade Terrace Scripture for Increasing Lifespan and the Precious Register of Extended Years**\n\n*Title:* **The Most High Jade Terrace Scripture for Increasing Lifespan and the Precious Register of Extended Years** (*Taishang Yaotai Yisuan Baoji Yannian Chan*). One scroll.\n\n*Source:* *Zhengtong Daoist Canon*, *Dongshen* Section, *Weiyi* Category.\n\n---\n\nWith reverence, we invoke the august names of the Jade Capital and the sacred texts of the Golden Towers. To uphold them is to eternally preserve distant longevity; to venerate them is to perpetually draw upon supreme longevity.\n\nHere, the incense burners condense emerald mists, and candles illuminate crimson lotuses. We recite the wondrous sounds of the *Lingbao* scriptures, gazing upon the Most Holy of the Void and Nonexistence.\n\nThus, the Three Primes gather blessings, and the Eight Festivals beseech grace. At the appointed hour of the Moon Palace, the jade bells of Heavenly Treasures resonate in stillness; at the dawn of the Star Altar, the jade chimes of the Jasper Pool sound softly.\n\nWe raise the Dharma’s voice, chanting the drifting celestial hymns. With one hundred and fifty prostrations, we invoke the sagely titles of the Heavenly Worthies; in response to a hundred thousand myriad layers, the imperial wisdom of the Milky Way descends.\n\nBy the potent power subtly bestowed, the ninefold-refined Golden Elixir augments one’s lifespan; through the vast workings of mysterious compassion, the Jade Registers of the Three Clarities elevate one’s destiny.\n\nWe humbly entreat the High Emperor of the Purple Palace and the Most Holy of the Clear Capital, that their flourishing may endure like the pine and cypress, their fragrance rivaling the orchid and cassia. They grasp the Crimson Axe in their palms, casting a white radiance upon their crowns.\n\nTrue immortals assemble in celebration, as the secret talismans of extended years shield the body; dragons and tigers bestow blessings, as the numinous talismans of life preservation ward off calamity. Longevity swells like the Five Peaks, and fortune arises from the Ten Directions.\n\nWith utmost sincerity, we take refuge and pay homage.\n\n**Devoutly, we take refuge and submit our lives.** For each honored one, first recite: *\"Devoutly, we take refuge and submit our lives,\"* then intone the sacred title of the Heavenly Worthy.\n\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Mysterious Vault, the Supreme Emperor.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Grand Ultimate, the High Emperor.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Golden Radiance, the Purple Palace.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Jasper Treasure, the Cinnabar Terrace.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Vast Illuminating Virtue and the Dao.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Universal Salvation for the Mortal Realm.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Fortune Star’s Descending Blessings.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Benevolent Sun’s Returning Light.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Nine Palaces’ Lifespan Augmentation.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Eight Trigrams’ Extended Years.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Great Emperor of Pure Tenuity.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Purple Ultimate, the Primordial Emperor.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Floating Gauze and Emerald Sleeves.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Fragrant and Resplendent Treasure Mountain.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Longevity Honored in the Five Peaks.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Fortune Vast as the Four Seas.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Perpetual Arrival of the Phoenix Calendar.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Preserving the Tortoise Longevity.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Nine Heavens’ Blessings Assembled.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Ten Poles’ Descending Blessings.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Void and Phoenix Tower.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Vast and Distant Tortoise Terrace.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy Who Increases a Hundred Blessings.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy Who Receives a Thousand Auspices.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Terrace Mountain Who Receives Destiny.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Song Peak Who Ascends to Immortality.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Jade Light Illuminating the Chamber.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Treasure Torch Floating in the Void.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Nine Numinous Who Dispel Misfortune.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Two Qi’s Extended Life.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Ninefold Clarity’s Sagely Virtue.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Eight Sceneries’ Void and True.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Brightly Shining Longevity Star.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Fortune Sea’s Clarity.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Ascending the Ten Grotto-Heavens.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Three Sovereigns’ Manifest Response.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Perpetually Nourishing Myriad Goodness.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Eternally Harmonizing a Thousand Spirits.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Attaining the Dao Through Mountain Worship.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Ascending to Immortality Through Tree Veneration.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Golden Heaven’s Descending Image.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Jade Seat’s Upright Illumination.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Universally Receiving Sagely Transformation.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Pervasively Bestowing the True Wind.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Mysterious and Plain Wondrous Dao.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Azure Jade Numinous Text.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Cinnabar Terrace’s Lifespan Augmentation.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Precious Register’s Elevated Destiny.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Nine Heavens’ Eternal Joy.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Myriad Qi’s Perpetual Existence.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Sevenfold Brightness and Simurgh Canopy.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Nine-Colored Dragon Chariot.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Soaring Across the Eight Poles.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Mirroring and Illuminating the Ten Directions.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Auspicious Signs in Dreams.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Manifesting Numinous Traces.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Perpetually Expanding the Realm of Longevity.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Vastly Pouring Forth the Fount of Fortune.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Warding Off Calamities and Deflecting Misfortune.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Preserving Life and Extending Years.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Jade Void and Grotto Pass.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Golden Flower’s Upper Palace.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Ten Thousand Heavens’ Master of the Dao.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Three Realms’ Participation in the Mysteries.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Western City’s Responsive Sageliness.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Southern Culmen’s Penetrating Numinosity.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Merit Achieved and Tiger Longevity.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Dao Aligned with Dragon Might.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Perpetually Arriving Myriad Blessings.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Firmly Securing a Thousand Years.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Mysterious Dragon’s Dharma Chariot.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Plain Tiger’s Cloud Formation.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Radiant Moon’s Phase.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Marvelous Celestial Regalia.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Soaring Across the Eight Sceneries.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1446,
      "start_sentence": 0,
      "end_sentence": 98,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.889442682266235,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太上瑶台益算宝籍延年忏.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "志心归命，绛绶九华天尊。 志心归命，庄严殊胜天尊。 志心归命，微妙洪因天尊。 志心归命，嵩山成道天尊。 志心归命，华岳延龄天尊。 志心归命，千春紫殿天尊。 志心归命，七宝华林天尊。 志心归命，金堂永寿天尊。 志心归命，玉洞长春天尊。 志心归命，万灵集瑞天尊。 志心归命，百福呈祥天尊。 志心归命，升平国土天尊。 志心归命，化洽人天天尊。 志心归命，应愿至力天尊。 志心归命，随念遂心天尊。 志心归命，百宝琼殿天尊。 志心归命，七映玉台天尊。 志心归命，九光鹤盖天尊。 志心归命，八景鸾舆天尊。 志心归命，玄风广洽天尊。 志心归命，圣德高明天尊。 志心归命，景榆恒盛天尊。 志心归命，应念克就天尊。 志心归命，保镇长存天尊。 志心归命，月桂常春天尊。 志心归命，至极妙道天尊。 志心归命，无上太虚天尊。 志心归命，紫金仙界天尊。 志心归命，黄玉玄堂天尊。 志心归命，龙成自在天尊。 志心归命，銮阁长生天尊。 志心归命，白光瑞彩天尊。 志心归命，赤斧真文天尊。 志心归命，广臻福祉天尊。 志心归命，恒集祯祺天尊。 志心归命，翔鸾云阁天尊。 志心归命，回龙宝阙天尊。 志心归命，玉堂长庆天尊。 志心归命，金殿常明天尊。 志心归命，圆通莫测天尊。 志心归命，慧爱无边天尊。 志心归命，遨游玉洞天尊。 志心归命，缤纷雨化天尊。 志心归命，咸承睿祉天尊。 志心归命，永益道缘天尊。 志心归命，玉清上圣天尊。 志心归命，金阙至真天尊。 志心归命，九天集庆天尊。 志心归命，十洞上生天尊。 志心归命，蓬莱轻举天尊。 志心归命，昆阆冲升天尊。 志心归命，泓澄福海天尊。 志心归命，嵯峨寿山天尊。 志心归命，随处安乐天尊。 志心归命，所在太平天尊。 志心归命，上清至道天尊。 志心归命，虚阙高真天尊。 志心归命，碧霞金殿天尊。 志心归命，紫炁玉楼天尊。 志心归命，广施睿化天尊。 志心归命，普洽天慈天尊。 志心归命，咸臻百福天尊。 志心归命，常续长年天尊。 志心归命，功成渊备天尊。 志心归命，道契玄虚天尊。 志心归命，太清洞阙天尊。 志心归命，上境云宫天尊。 志心归命，九虚玉观天尊。 志心归命，四明金阙天尊。 志心归命，常臻广福天尊。 志心归命，永保长生天尊。 志心归命，寿星永曜天尊。 志心归命，福海无穷天尊。 志心归命，赤城寿命天尊。 志心归命，华岳成仙天尊。 志心归命，长生益算紫极真人。 志心归命，广福延年碧落真人。 志心归命，玉符保命绛阙真人。 志心归命，金箓护命丹霄真人。 礼毕资修，敬神祈谢。 窃以广探崇奉，特罄精严，将求延续之殊因，俯仗玄元之道化。 遂则仰瞻圣像，躬对灵慈。 是知寿算能资，神仙可学。 切希睿泽，神明诞降於祯祥； 仰托洪钧，造化潜垂於卫佑。 香爇氛氲之翠霭，灯然灿烂之红蕖。 用启修崇，获伸朝礼。 一击蓬壶之磬，遍闻秀洞之台。 伏愿乘虹节而降道场，从霓旌而临宝界。 显是人间甲子，凤历长新； 密期壶裹光阴，龟龄永固。 授以九宫之要，传其六甲之文。 尽令四海八方，咸得长生久视。 稽首虚皇无上正真三宝。 太上瑶台益算宝籍延年忏竟",
      "translated_text": "Devoutly, we take refuge and submit our lives to the Heavenly Worthy of the Crimson Cord’s Nine Radiance.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Solemn and Sublime Majesty.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Subtle and Vast Cause.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Dao Attained on Mount Song.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Hua Peak’s Extended Longevity.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Purple Palace’s Thousand Springs.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Seven Treasures’ Flowering Grove.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Golden Hall’s Eternal Life.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Jade Grotto’s Everlasting Spring.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Myriad Spirits Gathering Auspiciousness.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Hundred Blessings Manifesting Auspicious Signs.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Peaceful and Prosperous Realm.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Transformations Harmonizing Humans and Devas.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Responding to Wishes with Supreme Power.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Following Thoughts to Fulfill the Heart.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Hundred Treasures’ Jasper Palace.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Sevenfold Radiance Jade Terrace.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Ninefold Light Crane Canopy.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Eight Sceneries’ Simurgh Chariot.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Mysterious Wind’s Vast Harmony.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Sagely Virtue’s Lofty Clarity.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Ever-Flourishing Scenic Elm.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Responding to Thoughts with Immediate Fulfillment.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Eternal Preservation and Guardianship.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Moon’s Cassia Everlasting Spring.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Supreme and Wondrous Dao.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Utmost Great Void.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Purple Gold Immortal Realm.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Yellow Jade Mysterious Hall.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Dragon’s Self-Mastery.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Imperial Chariot’s Eternal Life.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the White Light’s Auspicious Radiance.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Vermilion Axe’s True Script.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Vastly Arriving Blessings.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Perpetually Gathering Auspicious Omens.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Soaring Simurgh’s Cloud Pavilion.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Returning Dragon’s Jeweled Palace.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Jade Hall’s Eternal Celebration.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Golden Palace’s Perpetual Clarity.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of All-Pervading and Unfathomable Mystery.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Boundless Wisdom and Compassion.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Roaming the Jade Grotto.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Multicolored Rain’s Transformations.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Universally Receiving Sagely Blessings.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Eternally Benefiting Dao Affinities.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Jade Clarity Supreme Sage.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Golden Portal’s Utmost Perfected.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Nine Heavens Gathering Celebration.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Ten Grottoes’ Supreme Birth.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Penglai’s Effortless Ascent.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Kunlun’s Soaring Ascent.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Vast and Clear Blessing Sea.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Towering Longevity Mountain.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Peace and Bliss Everywhere.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Great Peace in All Places.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Supreme Clarity’s Utmost Dao.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Empty Portal’s Lofty Perfected.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Azure Clouds’ Golden Palace.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Purple Qi Jade Tower.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Vastly Bestowing Sagely Transformations.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Universally Harmonizing Heavenly Compassion.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Universally Arriving Hundred Blessings.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Perpetually Continuing Long Years.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Merits Fully Accomplished and Profoundly Complete.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Dao Aligned with the Mysterious Void.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Great Clarity’s Grotto Palace.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Supreme Realm’s Cloud Palace.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Nine Voids’ Jade Observatory.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Four Illuminations’ Golden Portal.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Perpetually Arriving Vast Blessings.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Eternally Preserving Long Life.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Longevity Star’s Eternal Radiance.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Inexhaustible Blessing Sea.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Vermilion City’s Lifespan.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Hua Peak’s Immortal Attainment.\nDevoutly, we take refuge and submit our lives to the Purple Pole Perfected of Longevity Extended and Years Increased.\nDevoutly, we take refuge and submit our lives to the Azure Empyrean Perfected of Vast Blessings and Extended Years.\nDevoutly, we take refuge and submit our lives to the Crimson Portal Perfected of Jade Talisman Preserving Life.\nDevoutly, we take refuge and submit our lives to the Cinnabar Empyrean Perfected of Golden Register Protecting Life.\n\nThe rites of offering and cultivation are now complete; we reverently pray to the deities and express our gratitude.\n\nIn seeking to widely explore and profoundly revere, we have specially exhausted our utmost sincerity. Desiring to pursue the extraordinary cause of longevity’s continuation, we humbly rely upon the Dao’s transformations of the Mysterious Origin. Thus, we gaze upward at the sagely images and personally face the numinous compassion. We know that lifespan can be augmented and immortality can be learned. Earnestly hoping for sagely grace, may the divine luminaries descend upon auspicious omens; reverently entrusting ourselves to the vast primordial qi, may creation subtly bestow its protection and guardianship. The incense smoke rises in verdant mists; the lamps burn with the brilliance of red lotuses. Through this, we initiate our reverent practice and extend our morning obeisance. A single strike of the Penglai bell resounds, and the melodious tones of the immortal grottoes’ terraces are heard everywhere.\n\nWe prostrate ourselves and pray: may you descend upon the ritual arena riding the rainbow banner and arrive at the jeweled realm following the iridescent pennants. May the human world’s calendrical years be ever renewed like the phoenix’s chronicle; may the time within the alchemical crucible be eternally secure like the tortoise’s longevity. Grant us the essentials of the Nine Palaces and transmit the texts of the Six Jia. May all within the four seas and eight directions universally attain long life and enduring vision.\n\nWe bow our heads to the Supreme Void’s Most High, Correct, and True Three Treasures.\n\nThe *Jade Terrace Longevity Register’s Ritual of Extended Years* is now complete.",
      "overlap_context": "submit our lives to the Heavenly Worthy of the Mysterious Dragon’s Dharma Chariot.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Plain Tiger’s Cloud Formation.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Radiant Moon’s Phase.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of the Marvelous Celestial Regalia.\nDevoutly, we take refuge and submit our lives to the Heavenly Worthy of Soaring Across the Eight Sceneries.",
      "start_char": 1447,
      "end_char": 2870,
      "start_sentence": 99,
      "end_sentence": 193,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.14369177818298,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太上瑶台益算宝籍延年忏.txt",
        "category": "威仪类"
      }
    }
  ]
}