{
  "source_id": "太上玉晨郁仪结璘奔日月图",
  "source_file": "chunked_daozang\\太上玉晨郁仪结璘奔日月图.json",
  "total_chunks": 6,
  "total_original_chars": 5071,
  "total_translated_chars": 31556,
  "total_translation_time": 160.32067847251892,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\灵图类\\太上玉晨郁仪结璘奔日月图.txt",
    "category": "灵图类"
  },
  "full_translation": "*The Supreme Jade Dawn Esoteric Diagram of Yu Yi and Jie Lin Racing the Sun and Moon*\n\n**Scripture Title:** *The Supreme Jade Dawn Esoteric Diagram of Yu Yi and Jie Lin Racing the Sun and Moon*. Author unknown, approximately composed during the Northern and Southern Dynasties. Compiled from excerpts of *The Central Scripture of the Nine Perfected* and adapted into one scroll. Source text: *Daoist Canon of the Zhengtong Era*, *Dongxuan Section*, *Category of Sacred Diagrams*.\n\n---\n\nThe *Central Chapter of the Supreme Hidden Writ* states: Should you aspire to perfection, you must visualize the Sun Lord, riding dragons and phoenixes, borne upon celestial radiance and clouds. Journey eastward to the Forest of Rarities, then enter the Gate of the Emperor. Through concentrated meditation, you shall attain it—this essential Dao is not arduous. Your name shall ascend to the Numinous Clarity, where you shall be ranked among the Perfected Officials and wield the *Script of Yu Yi*.\n\nThe *Central Chapter of the Supreme Hidden Writ* further states: Should you seek to ascend to Heaven, you must visualize the Moon Lady, driving ten celestial dragons, mounted upon my flowing chimes. Travel westward to the Six Ridges, then enter the Emperor’s Hall. Through concentrated meditation, you shall behold her and ascend to pay homage to the Celestial August. There, you shall wield the *Seal of Jie Lin*.\n\nThe esoteric Dao of racing the sun and moon, as described above, is treasured and concealed by the Supreme Clarity, the Great Ultimate, the Nine August Ones, and the Four Perfected. It is the jade script of the Mysterious Void Primordial Lady. Unless one’s name is inscribed in the Golden Pavilion and recorded in the Eastern Florescence, they shall never hear even the titles of these two chapters.\n\nTo practice this, one must first purify through a hundred days of abstention, severing all worldly affairs, before it may be undertaken. With prolonged practice, one shall ascend to race the sun and moon, and be granted fifty jade boys and fifty jade maidens as attendants.\n\nThe *Crimson Script of Yu Yi* and the *Yellow Seal of Jie Lin* are the sacred and secret texts of the Supreme Jade Emperor Lord. They are concealed within the chambers of the Nine Heavens, upon the Cinnabar-Jade Terrace. None may see or hear of them save those who diligently cultivate the Dao with a sincere heart, and who bear the predestined register of the Flying Mystery Celestial Immortals. Even to speak their titles carelessly is forbidden. Those who transgress shall be examined by the Three Officials, and neither Heaven nor Earth shall absolve them.\n\nInitially, the scripture was permitted to be transmitted to one person every three hundred years. Afterward, for seven hundred years, it may again be transmitted to one person. If the numinous perfected or hidden spirits deem someone worthy of receiving it, it shall be passed on. The method of transmission is through master and disciple, in accordance with the statutes of the Revered Mystery. To transmit it to the unworthy, or to violate the precepts, is to leak and profane celestial writ. Those who betray their oaths through negligence shall become lowly ghosts after death, and their seven generations of ancestors shall suffer the punishments of the wind-knife.\n\nUnless bound by shared destiny, one should remain silent.\n\nOn the Terrace of the Western Mystery Mountain, these two scriptures are inscribed upon jade tablets in golden characters. They are also present, though not in full, in the Pure Void Heaven of Wangwu. The immortals of the Central Palace and the various officials of the Grand Clarity do not even know what these texts pertain to.\n\nWithin the stone chamber’s pivot at the northern cavern of Mount Emei, twenty characters are carved into the stone: *\"Yu Yi draws the essence of the sun; Jie Lin summons the spirit of the moon. Attaining the Dao, one dwells in the Upper Palace, ranked as a Perfected of Great Courage.\"* Lesser immortals who see this find themselves utterly unable to comprehend its meaning. Many such immortals have never even glimpsed the titles or registers of these texts.\n\nThe Golden Liquid and Nine Elixirs are but minor arts, all insufficient to ascend to the Upper Clarity. To practice this Dao, one need not be wise or foolish—only that such texts do not exist in the mortal realm. The true methods of the Mysterious Law are transmitted only after vows are sworn. Those who obtain and practice them attain the rank of Upper Perfected, then ride the Eight Radiance Jade Wheels, roaming the Nine Mornings. Thus, the secret words say: *\"Only when you master Yu Yi and Jie Lin do you become a Perfected of the Upper Clarity. Without cultivating this Dao, you cannot behold the Three Primordial Lords.\"*\n\nThe Perfected of the Great Simplicity said: *\"Store within you the essence of the sun and the Five Emperor Lords; hold in your mouth the scripture of the Supreme Yu Yi. Only when this Dao is accomplished will you meet the Lord of the Sun. Without it, your efforts are in vain, and you will only bring distress upon yourself.\"* He also said: *\"Store within you the essence of the moon and the Five Empress Ladies; hold in your mouth the chapter of the Supreme Jie Lin. Only when this Dao is accomplished will you meet the Lady of the Moon. Without it, your efforts are in vain, and you will only invite sorrow.\"* These two passages were the oral instructions the Perfected of the Great Simplicity received from the Supreme Thearch.\n\nThe *Hidden Writ of the Supreme* states: *\"When storing, grasp it.\"* The Thearch said: *\"Hold it in your mouth.\"* The Perfected of the Great Simplicity taught Lord Pei that when storing, one should hold one scripture in the mouth and grasp another, practicing both simultaneously. The Perfected of the Great Simplicity transmitted to the Perfected of Pure Numinosity, Lord Pei, these two matters—the scriptures of the Supreme Yu Yi and Jie Lin—to summon the spirits of the sun and moon, ascend to the sun and moon, and traverse the celestial radiance to soar through the Great Void. All ride cloud chariots and feathered canopies, driving a host of dragons to ascend to the Purple Court of the August Heaven.\n\nThe *Inner Vision of the Central Realm* says: *\"If you wish to walk the void, store the sun and moon within. If you wish to ascend to the Pure Numinosity, store the Five Stars within. Practice in secret, never leaving your chamber—this is the way.\"* The *Plain Memorial of the Cinnabar Talismans* states: *\"Great is Yu Yi! Wondrous is Jie Lin! They are unseen by lesser Perfected, unheard by lesser immortals. Through them, one summons the spirits of the sun, moon, and Five Essences, rides dragons to walk the void, and treads upon radiant clouds. Following the Five Emperors, one enters the Gate of Heaven. Whoever hears of this must not speak carelessly. Only when leaving the mortal world may it be transmitted, and only after swearing a golden oath. It must be entrusted to disciples of sincere heart. Those who recklessly reveal its contents will be reported by the Jade Lads, punished, and barred from immortality. The Jade Lads and Jade Maidens will depart, never to return, and the scriptures will be lost. One will incur the judgment of the Three Officials. Beware of speech, for words are the source of transgression.\"*\n\nThe *Purport of the Jade Hall* of the Sun Palace states: *\"At dawn on the first day of the lunar month, sit in quietude, purify yourself, and settle your mind. Strike your teeth thirty-six times. First, visualize your cinnabar field as a great sea, the sun rising from it. Your body sits atop your crown, solid as mountain stone. Recite the incantation: *'Yang arises from the Primordial Sea, ascending from below. The undifferentiated yang essence scatters the host of yin. Within it dwells a great spirit, the Lord Yu Yi. Descend with this true qi to bathe my form.'*\"*\n\nThe *Purport of the Jade Hall* states: *\"After reciting the incantation, swallow saliva nine times. Next, visualize the sun rising, its golden light illuminating your true form. Face the Sun Palace and recite the incantation: *'The Golden Wheel manifests its auspice, resplendent with yang brightness. The flaming radiance soars, streaming essence for ten thousand li. Demonic vapors extinguish their flames; dust and filth are swept clean. Ascend through emptiness, riding qi on high.'*\"*\n\nThe *Purport of the Jade Hall* states: *\"After reciting the incantation, swallow saliva nine times. Then, mount the fire dragon and hasten to the Sun Palace. Recite the incantation: *'The fire dragon leads the way, piercing the crown with flying light. The spirit enters the boundless, paying homage to Yu Yi. In an instant, ascend and merge with the numinous radiance. The One True follows its origin, burning away the corpse of Peng.'*\"*\n\nThe *Purport of the Jade Hall* states: *\"After reciting the incantation, swallow saliva nine times and contemplate entering the Sun Palace, merging with your body as one. After a long while, forget your form, warm as spring. Practicing this for one year dispels illness, commands ghosts and spirits, and allows natural coming and going. After two years, one attains communion with immortals and receives the attendance of the Three Realms. After three years, the Demon Kings will vouch for you.\"*\n\nAfter nine years of practice, the Five Emperors descend to befriend you, and a decree is issued to name you a *Zhenren* (Perfected One), granting you eternal life.\n\nThe *Supreme Jade Dawn’s* *Yu Yi’s Hastening Gaze Red Radiance Jade Scripture* states: The method of *cai fu fei gen* (gathering and ingesting flying roots) and swallowing the qi of the sun was once transmitted by the Celestial Emperor of the Grand Tenuity. It is also called the *Red Cinnabar Metal Essence Stone Radiance Water Mother Jade Embryo Scripture*. The practice is as follows: At sunrise, face east and click your teeth nine times. Then, softly invoke the names of the sun’s soul and the five emperors within it:\n\n*Sun Soul, Vermilion Radiance, Illuminating Veil, Green Reflected Glow, Rosy Clouds, Crimson Youth, Mystic Flame, Whirling Simurgh.*\n\nRecite these sixteen characters while holding your fists firmly. Visualize the five-colored streaming radiance within the sun approaching your body, with the sunlight and flowing radiance both entering your mouth.\n\nThe *Purple Scripture of the Upper Clarity* states: The method of swallowing the essence of the moon is practiced at moonrise. Face west and click your teeth ten times. Softly invoke the names of the moon’s spirit and the Lady of the Moon:\n\n*Moon Spirit, Warm and Serene, Fragrant and Luminous, Veiled and Vast, Graceful and Void, Numinous Orchid, Luxuriant Blossom, Jade Petals, Pure Gold, Limpid and Bright, Radiant Countenance, Terrace’s Standard.*\n\nRecite these twenty-four characters, then close your eyes and hold your fists firmly. Visualize the five-colored essence and light of the moon entering your mouth. Within the moon, there is also a yellow qi, as large as the pupil of an eye, called the *flying blossom jade embryo’s essence*. Those who cultivate this Way become immortals who hasten to the sun and moon.\n\nFor the practice of *Yu Yi’s Hastening to the Sun*, one should daily await the moment of sunrise. If the sun is not visible, remain in a quiet chamber, face east, click your teeth nine times, close your eyes, and hold your breath for nine cycles. Then swallow the sun’s radiant light nine times, visualizing the light and radiance entering your mouth before ingesting it. Afterward, softly invoke:\n\n*Within the Sun, the Azure Emperor, whose taboo name is Yuan Chang Yuan and style name is Zhao Long Tao, wears a cyan jade brocade mantle, a skirt of azure blossoms and flying feathers, and a morning crown of emerald lotus.*\n\n*Within the Sun, the Vermilion Emperor, whose taboo name is Dan Ling Zhi and style name is Lü Hong Ying, wears a crimson jade brocade mantle, a skirt of vermilion blossoms and flying feathers, and a luminous crown of red lotus.*\n\n*Within the Sun, the White Emperor, whose taboo name is Hao Yu Jiang and style name is Hui Jin Xia, wears a white jade brocade mantle, a skirt of white feathers and flying blossoms, and a crown of luminous white lotus.*\n\n*Within the Sun, the Black Emperor, whose taboo name is Cheng Qin Ting and style name is Xuan Lü Yan, wears a black jade brocade mantle, a skirt of black feathers and flying blossoms, and a crown of dark mountain lotus.*\n\n*Within the Sun, the Yellow Emperor, whose taboo name is Shou Yi Fu and style name is Biao Hui Xiang, wears a yellow jade brocade mantle, a skirt of yellow feathers and flying blossoms, and a purple crown of yellow lotus.*\n\nThe spirit within the moon’s essence is named *Warm and Serene Terrace’s Standard*.\n\nRepeat this invocation three times, then close your eyes and hold your fists firmly. Visualize the five-colored streaming radiance within the sun approaching your body, descending to your feet, then ascending to the crown of your head. Next, visualize the five-colored qi of the sunlight and radiance entering your mouth. Within the flowing radiance of the sunlight, there is also a purple qi, as large as the pupil of an eye, layered in dozens, resplendent within the five-colored light. This is called the *flying root water mother*. Together with the five qi, it enters your mouth. Face the sun and swallow the radiance forty-five times. Afterward, click your teeth nine times and softly invoke:\n\n*Red furnace’s cinnabar qi, celestial orb’s flying essence, hardness receives softness, flame and water’s yin flower. Sun’s primal radiance, named Great Brightness, nine yangs harmonize as one, twin mists arise together. Congeal the soul and harmonize the po, essence of the five qi. Within, the Five Emperors are born, riding the light to command form. Gather the flying in emptiness, sip the root to fullness. Head draped in dragon blossoms, mantle of vermilion, sash of azure. Bridle the crow’s flowing mystery, radiance reflects the Upper Clarity. Bestowed with jade tablets, name inscribed in the Golden Pavilion. Feast on morning radiance, unite with the Dao in numinosity. Ascend as an immortal to the Grand Tenuity, soaring to the Purple Court.*\n\nAfter the invocation, visualize the Azure Emperor descending from the sunlight to your left, the Vermilion Emperor to your right, the White Emperor to your back, the Black Emperor above your left hand, and the Yellow Emperor above your right hand. All Five Emperors arrive—visualize their attire in vivid detail. Then click your teeth five times, swallow saliva nine times, and softly invoke:\n\n*Red furnace’s cinnabar radiance, orb of ninefold brilliance, great radiance dawns, resplendent vermilion essence. Five Emperors initiate the dawn, illuminating the myriad beings of the cavernous void. Behold the descent of the Upper Perfected, vast and boundless. Circulate qi and refine the gathered, flowing through the five forms. Transform my spirit, infuse the six viscera with numinosity. Together with the Emperor Lords, unite with the Supreme One’s peerless essence. Mount the crimson clouds, ninefold sun-chariot of yang’s mirror. Ascend to the sun’s midst, merge with the Emperor in numinosity. Lifespan equals heaven and earth, twin dawns converge.*\n\nAfterward, click your teeth three times, swallow saliva three times, and softly invoke:\n\n*Moon’s spirit and essence, Warm and Serene Terrace’s Standard, enable me to reach the sun’s cavern-heaven. On the eastern peak of Chang Qiu, receive the scripture of wielding spirits, bear the talisman of the nine provinces, feast on azure essence’s nectar, drink cloud-jade’s richness. Feast in the realm of the eight poles, ascend the terrace of luminous perfection, sit in the Hall of Sparse Forests, chant the verses of jade dawn.*\n\nAfter the invocation, visualize the crimson cloud chariot of the *yang mirror*, drawn by nine red dragons, arriving before you from the sunlight. Then visualize the Five Emperors riding together toward the sun. Forget your form for a long while, swallow saliva fourteen times, then close your eyes and focus your thoughts until a semblance appears. Bow twice toward the sun. Those who practice this Way for a long time will surely attain the ability to ride the radiance and hasten to the sun. This concludes the *Yu Yi’s Way*.\n\nIf a Daoist abstains from grains in the mountains, maintains perpetual fasting on the Five Peaks, severs ties with the mundane world, and deeply contemplates purity and perfection, they may daily ingest the sun’s root-radiance and swallow the essence of the Great Yang. Soon, their body will emanate jade-like luster, and their face will glow with flowing light.\n\nShould worldly affairs entangle you, preventing stillness of form, or should you wander the paths of the mundane with your heart ensnared in webs of distraction, then perform this practice on the third, fifth, seventh, ninth, thirteenth, fifteenth, seventeenth, nineteenth, and twenty-fifth days of the lunar month—ten times within a single month—following the method described above. These are the days when the sun’s soul descends to meet the earth, when the flying root is full, and when the water mother and her dream-hosts gather.\n\nAfter eighteen years of such practice, the Supreme Clarity will refine you with golden perfection, polish you with jade radiance, and elevate you to the rank of True Sovereign. You will soar through the great void, riding the threefold splendor of the celestial blossoms, illuminating all beneath heaven.\n\n**The Supreme’s Sun-Qi Opening Brightness Talisman**\nOn the final night of the lunar month at midnight, write this talisman in cinnabar on blue-green paper, face east, and ingest it to first announce yourself to the sun’s soul. When taking the talisman, hold your breath, grasp it in your left hand, and recite the incantation in your heart:\n\n*\"The Vermilion Script of the Great Subtlety,\nNamed Opening Brightness,\nSummons the sun’s upper soul\nTo transform this form.\nAt dawn’s first light, arrayed in solemnity,\nDeparting from the round courtyard,\nFlying blossoms and water mother,\nSun-root and golden essence,\nPurple radiance streaming,\nCalled the Fivefold Numinous.\"*\n\nOnce the incantation is complete, ingest the talisman.\n\n**The Lunar Palace**\nOn the full moon, visualize yourself as Kunlun Mountain, seated at its summit with the great sea below. As the moon’s wheel first rises, swallow saliva three times, and knock your teeth together thrice. Recite the incantation:\n\n*\"True radiance first arises,\nSupreme Yang within Yin,\nWaters surge in the dark wheel,\nGolden dew glimmers faintly,\nThe source of fluids flows freely,\nIlluminating the jade chamber,\nQi swells with luminous might,\nFeasting upon the soaring flight.\"*\n\nAfter reciting, swallow saliva nine times. Next, visualize the moonlight as a half-crescent, its golden radiance shining upon your body, and recite:\n\n*\"Radiance scatters from the celestial pool,\nGolden waters in half-arc,\nLight brightens the hidden night,\nIllumining my dark pearl,\nDrinking the crystalline nectar,\nFragrance permeates the numinous frame,\nAfter cycles of true convergence,\nRiding the radiance in soaring flight.\"*\n\nOnce the incantation is complete, swallow saliva nine times and knock your teeth. Visualize the moon as full, true water forming a bridge descending to the mountain’s stones. Your body, riding a multicolored phoenix, enters the moon. Recite:\n\n*\"The celestial source flows in cycles,\nLight pierces the layered towers,\nDawn’s glow suffuses the ten directions,\nFive fluids stir the hidden depths,\nSoaring through emptiness, seizing the radiance,\nThe true body takes flight,\nA single perfection ascends in audience,\nThe Yang cycle knows no sorrow.\"*\n\nAfter reciting, swallow saliva nine times. Envision entering the lunar palace, merging with your body, and after a long while, forget your form. Feel the golden light scattering in all directions, illuminating the entire sky.\n\nPracticing this for one year banishes illness, and spirits come and go at your command. After two years, you commune with the true, and the Three Realms attend you. After three years, the demon kings will vouch for you.\n\nAfter nine years of practice, the achievement is complete, and the Five Ladies descend to summon your form, whereupon you attain the rank of flying immortal.\n\n**The Jade Dawn’s Jeweled Radiance Rushing to the Moon and the Yellow Effulgence Jade Scripture**\n\nThe *Numinous Writ of the Purple Text* states: The method of gathering and ingesting yin blossoms, of swallowing the moon’s essence, was once transmitted by the Celestial Emperor of the Grand Tenuity. It is also called *The Yellow Qi Yang Essence Concealed in Heaven and Hidden in the Moon Scripture*.\n\nTo practice the Way of Jeweled Radiance Rushing to the Moon, one should await the moment of the moon’s first rising. If there is no moon, proceed in a quiet chamber, facing west toward the moon. Knock the teeth ten times, close the eyes, hold the breath for nine cycles, and then swallow the moonlight nine times. Envision the moonlight entering your mouth, and then swallow it.\n\nOnce done, softly intone:\n*\"The Azure Emperor’s Lady of the Moon, whose taboo name is Zhu Yine, and whose style is Fenyan Ying, wears a robe of azure-flowered jade brocade with a cape of kingfisher-green, and a flying-feather skirt embroidered with dragon and phoenix patterns.\nThe Vermilion Emperor’s Lady of the Moon, whose taboo name is Yi Yiliao, and whose style is Wanyan Xu, wears a robe of cinnabar-bud jade brocade with a cape of vermilion, and a flying-feather skirt of fallen phoenix plumes.\nThe White Emperor’s Lady of the Moon, whose taboo name is Ling Sulan, and whose style is Yulian Hua, wears a robe of white nephrite brocade with four-dragon motifs and a cape of white silk, and a flying-feather skirt adorned with white luan-bird patterns.\nThe Black Emperor’s Lady of the Moon, whose taboo name is Jie Lianqiao, and whose style is Chun Shujin, wears a robe of dark jadeite brocade with nine-cloud motifs and a cape of black silk, and a flying-feather skirt embroidered with black dragon patterns.\nThe Yellow Emperor’s Lady of the Moon, whose taboo name is Qing Yingjin, and whose style is Jiong Dingrong, wears a robe of yellow cloud-mountain brocade with a cape of yellow silk, and a flying-feather skirt of green phoenix embroidery.\"*\n\nEach of the Ladies wears her hair in a three-cornered cloud-toppled chignon, with the rest flowing down to her waist. Within the sun dwell the five-colored soul-essences of the inner spirits, named Zhu Jing Chi Tong.\n\nRecite the invocation three times, then close the eyes and clench the fists. Envision the five-colored flowing essences from the moon descending to embrace your entire body, down to your feet. Envision the five qi ascending to the crown of your head. Then, the five-colored flowing essences of the moonlight all enter your mouth. Within the flowing essence of the moonlight, there is also a yellow qi, large as the pupil of an eye, layered in dozens, following within the five-colored radiance of the moon’s essence. This is called the flying yellow moon-blossom essence. Together with the five qi, it enters your mouth. Facing the moon, swallow the essence fifty times. Once done, swallow saliva ten times. Then knock the teeth ten times again and softly intone:\n\n*\"Yellow essence, mysterious splendor,\nPrimal yin’s ascending qi,\nDispersing pent-up cold gales,\nOrdering numinous powers to gather the stomach,\nEmpty waves and rippling tassels,\nWandering through pure vessels,\nMoon’s essence, night’s radiance,\nExalted in the Dark Palace,\nFive Ladies, each safeguarding their mother’s standing,\nIn the ten thousand directions,\nHarmonizing the hun and restraining the po,\nThe five wombs flowing freely,\nRiding the clouds to fly the essence,\nSoaring in emptiness to the east,\nCrowning the head with numinous clouds,\nRadiant blossoms summoning the wind,\nLeft girded with the dragon tally,\nRight bearing the tiger insignia,\nPhoenix-feathered vermilion cape,\nJade pendants and golden earrings,\nThe soaring tree binding the slopes,\nNamed the Wood King,\nThe divine toad controlling the roots,\nNow waning, now waxing,\nBright essence inwardly reflecting,\nDark waters spouting beams,\nGranting the jade tablet of scripture,\nInscribing the name in the cloud chamber,\nIngesting the moon’s blossoms,\nMerging with the true,\nFlying immortal of the Purple Tenuity,\nAscending in audience to the Grand August One.\"*\n\nOnce the invocation is complete, envision the Azure Emperor’s Lady descending from the moonlight to stand at your left, and the Vermilion Emperor’s Lady descending from the moonlight to stand at your right.\n\nEnvision the White Emperor’s Lady descending from the moonlight to stand at your back; envision the Black Emperor’s Lady descending from the moonlight to stand upon your left hand; envision the Yellow Emperor’s Lady descending from the moonlight to stand upon your right hand. When all Five Emperor’s Ladies have arrived, visualize their attire in vivid detail. Then knock the teeth nine times, swallow saliva nine times, and softly intone:\n\n\"Yellow essence unfurls its radiance,\nPrimal yin reveals its inner splendor,\nIllumining the vision of the Great Mystery,\nOpening the caverns of the ten thousand directions,\nDispersing the misty chill winds,\nSeven dawns suspending their jade,\nThe Three Convergences of yin revolve,\nHeaven and Earth exhale their light,\nPurple luminaries roam and descend,\nFloating blossoms fill the nine voids,\nPerfect clarity bestows its hues,\nThe six qi transform and interflow,\nThe Five Emperor’s Ladies,\nGrasping clouds and seizing winds,\nDivine capes of dense gauze,\nAdorned with jade pendants and golden earrings,\nFeathered skirts brushing the clouds,\nWafting mists fanning the east,\nThe soaring tree unfurling the dawn,\nIts branches lush as the sacred fern,\nCloud toads refining and polishing,\nNurturing the Wood King,\nPenetrating roots for ten thousand miles,\nShading and sheltering the five bodies,\nHun and po harmonized and transformed,\nThe six mysteries brimming with numinous power,\nReturning from old age to infancy,\nJade-like radiance reverting to youth,\nThe Perfected Lords merging in transformation,\nTogether in the luminous peach of well-being,\nTimely riding the Flowing Chime,\nTen dragons drawing the cloud chariot,\nAscending to the bright moon,\nAttaining the rank of Preserving August One,\nLifespan uniting with the two images,\nHeaven and Earth enduring without end.\"\n\nWhen the incantation is complete, knock the teeth seven times, swallow saliva seven times, and softly intone:\n\n\"Spirit of the sun’s essence,\nNamed the Crimson Lad of Radiant Pearl,\nGuide me westward to\nThe Gate of the Six Peaks,\nEntering the Jade Palace of Harmonious Dawn,\nThe White Mound of Eight Strings,\nThe Upper Chamber of Eight Sceneries,\nTo receive the talisman of Ten Brightnesses,\nTo wear the insignia of the Night-Shining Flowing Star,\nTo sit in the Palace of Great Harmony,\nTo ascend the Terrace of Seven Numinosities,\nTo drink the moon’s blossoms and cloud cream,\nTo feast on the amber of yellow jade and the nectar of purple springs,\nTo chant the Lofty Numinous Stanzas,\nTo recite the True Verses of the Jade Dawn.\"\n\nWhen the incantation is complete, envision to your right the Flowing Chime Cloud Chariot, drawn by ten yellow dragons, arriving from the moonlight before you. Then envision yourself riding together with the Five Ladies, hastening toward the moon.\n\nReturning to your own form, after a long while, swallow saliva thirty times, then open your eyes and concentrate intently, visualizing until a semblance appears, and bow twice toward the moon. Those who practice this Way for a long time will surely attain the ability to ride the luminous chariot and hasten to the moon—thus concludes the Way of the Jade Dawn’s *Jie Lin*.\n\n**Essential Instructions for Practice:**\nAs with absorbing moonlight, if practiced nightly, one will swiftly perceive the body emanating light, the eyes possessing flying essence. The essential method is to perform this on the 2nd, 4th, 6th, 8th, 10th, 14th, 16th, 18th, 22nd, 24th, and 26th days of the month—eleven times in a lunar cycle—sufficient to attain immortality. On these evenings, yin essence takes flight and converges, the Three Qi overflow, the moon’s waters crystallize into blossoms, and the Yellow Spirit descends to receive them.\n\nAfter eighteen years of practice, the Upper Clarity will refine the hun and transmute the substance, suffusing it with jade-like radiance, riding the dark reins of luminous chariots to traverse the Great Void.\n\n**Purple Tenuity’s Talisman for Absorbing the Moon’s Essence and the Great Mystery’s Yin-Generating Sign**\nOn the last night of the lunar month at midnight, inscribe in yellow upon blue paper, face east to ingest it, first announcing it to the moon’s essence. At this time, one should first ingest the Talisman of Opening Numinosity.\n\nWhen about to ingest the moon talisman, hold the breath, grasp the talisman in the right hand, and silently recite:\n\"Purple Tenuity’s yellow script,\nNamed the Great Mystery,\nSummons the moon’s blossom waters,\nNurtures the po and harmonizes the hun,\nWithin the square, solemn affairs commence,\nIssuing from the Mysterious Pass,\nConcealing heaven and veiling the moon,\nThe Five Numinous Ladies,\nNine paths of flying light,\nIllumine the Mud Pill Palace.\"\n\nWhen the incantation is complete, ingest the talisman.\n\nIt is also said: One who knows the name of the moon’s po will be free from calamity for life, and no harm will befall them. The Most High concealed the names and titles of the Sun and Moon Emperor’s Ladies within the Palace of Primordial Simplicity—those who know them become divine immortals.\n\nIt is further said: One who knows the name of the sun’s essence will be free from illness for life, and no misfortune will touch them. The Most High concealed the names of the sun and moon’s essences within the Palace of Purple Emptiness and Jade—those who know them command spirits and employ numina.\n\nFor those practicing the Way of Hastening to the Sun and Moon, proceed as convenient; it need not be performed in full. Seek a secluded chamber, ensuring only the first glimmer of the sun or moon is visible. If one does not sever worldly affairs and remains entangled with external matters, this Way cannot be practiced.\n\nNightly, burn incense and visualize the names of the Five Emperors and Five Ladies, silently reciting: \"May I unite with the Perfected Lords and the Great One, merging our luminous forms as one.\" After twenty-four years of such practice, one may also ascend to heaven in broad daylight, without necessarily performing the hastening visualization. Constantly visualize them at your left and right, silently reciting the incantation—an ancient teaching not to be heard by the ears.\n\nFor those who have already attained the immortal Way and refined their essence through meditation, two years of visualization will yield semblances, three years will manifest forms, and in five years, one may hasten to the sun and moon. For those who are not yet immortals but seek to refine their essence, progress will not be swift. With prolonged practice, one will ascend to the Two Luminaries, becoming an Upper Clarity Perfected—once every seven hundred years, this is transmitted to a single person.\n\nHere ends *The Jade Dawn’s Diagram of Yu Yi and Jie Lin Hastening to the Sun and Moon*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上玉晨郁仪结璘奔日月图 经名：太上玉晨郁仪结璘奔日月图，撰人不详，约出於南北朝。 系摘录《九真中经》改编而成。 一卷。 底本出处：《正统道藏》洞玄部灵图类。 太上玉晨郁仪结璘奔日月图 太上隐书中篇曰：子欲为真，当存日君，驾龙骖凤，乘天景云，东游希林，遂入帝门，精思乃得，要道不烦，名上清灵，列位真官，乃执郁仪文。 太上隐书中篇曰：子欲升天，当存月夫人，驾十天龙，乘我流铃，西到六岭，遂入帝堂，精思乃见，上朝天皇，乃执结璘章。 右奔日月隐道，太上上清太极九皇四真人之所宝秘，玄虚元君之玉章也。 自非有金阁玉名，及录字东华，皆不闻见二篇目矣。 行之者，先清斋百日，绝交人事，乃可为之也。 久久行之，上奔日月，得给玉童玉女各五十人。 太上郁仪赤文、结璘黄章，乃太上玉帝君之灵秘篇也。 藏之於九天之房，丹瑶之台，非勤心好真，宿有飞玄天仙之骨录者，莫得而见闻也。 闻其篇目，皆不可妄言称及。 妄言称及，犯者受考三官，天地不赦。 初令三百年得宣传一人，却后七百年，复得传一人。 若神真冥告有宜授者，传之也。 传受之法，皆师友相授，以崇玄科也。 非其人，不遵法度，为泄宣天文也。 漏慢违誓，死为下鬼，乃七祖受考风刀之罪。 自非同气，宁当闭口。 西玄山洞台中，有此二经，刻以玉简，书以金字。 及王屋清虚天，皆有而不备具也。 中官仙人、泰清诸官，并不知此书是何事也。 峨媚山北洞中石室户枢，刻石书字曰：郁仪引日精，结璘致月神，得道处上官，位称大夫真。 凡二十字，下仙见之，甚自不解其意义是何等事也。 如此仙人，自有不见其篇目录者多矣。",
      "translated_text": "*The Supreme Jade Dawn Esoteric Diagram of Yu Yi and Jie Lin Racing the Sun and Moon*\n\n**Scripture Title:** *The Supreme Jade Dawn Esoteric Diagram of Yu Yi and Jie Lin Racing the Sun and Moon*. Author unknown, approximately composed during the Northern and Southern Dynasties. Compiled from excerpts of *The Central Scripture of the Nine Perfected* and adapted into one scroll. Source text: *Daoist Canon of the Zhengtong Era*, *Dongxuan Section*, *Category of Sacred Diagrams*.\n\n---\n\nThe *Central Chapter of the Supreme Hidden Writ* states: Should you aspire to perfection, you must visualize the Sun Lord, riding dragons and phoenixes, borne upon celestial radiance and clouds. Journey eastward to the Forest of Rarities, then enter the Gate of the Emperor. Through concentrated meditation, you shall attain it—this essential Dao is not arduous. Your name shall ascend to the Numinous Clarity, where you shall be ranked among the Perfected Officials and wield the *Script of Yu Yi*.\n\nThe *Central Chapter of the Supreme Hidden Writ* further states: Should you seek to ascend to Heaven, you must visualize the Moon Lady, driving ten celestial dragons, mounted upon my flowing chimes. Travel westward to the Six Ridges, then enter the Emperor’s Hall. Through concentrated meditation, you shall behold her and ascend to pay homage to the Celestial August. There, you shall wield the *Seal of Jie Lin*.\n\nThe esoteric Dao of racing the sun and moon, as described above, is treasured and concealed by the Supreme Clarity, the Great Ultimate, the Nine August Ones, and the Four Perfected. It is the jade script of the Mysterious Void Primordial Lady. Unless one’s name is inscribed in the Golden Pavilion and recorded in the Eastern Florescence, they shall never hear even the titles of these two chapters.\n\nTo practice this, one must first purify through a hundred days of abstention, severing all worldly affairs, before it may be undertaken. With prolonged practice, one shall ascend to race the sun and moon, and be granted fifty jade boys and fifty jade maidens as attendants.\n\nThe *Crimson Script of Yu Yi* and the *Yellow Seal of Jie Lin* are the sacred and secret texts of the Supreme Jade Emperor Lord. They are concealed within the chambers of the Nine Heavens, upon the Cinnabar-Jade Terrace. None may see or hear of them save those who diligently cultivate the Dao with a sincere heart, and who bear the predestined register of the Flying Mystery Celestial Immortals. Even to speak their titles carelessly is forbidden. Those who transgress shall be examined by the Three Officials, and neither Heaven nor Earth shall absolve them.\n\nInitially, the scripture was permitted to be transmitted to one person every three hundred years. Afterward, for seven hundred years, it may again be transmitted to one person. If the numinous perfected or hidden spirits deem someone worthy of receiving it, it shall be passed on. The method of transmission is through master and disciple, in accordance with the statutes of the Revered Mystery. To transmit it to the unworthy, or to violate the precepts, is to leak and profane celestial writ. Those who betray their oaths through negligence shall become lowly ghosts after death, and their seven generations of ancestors shall suffer the punishments of the wind-knife.\n\nUnless bound by shared destiny, one should remain silent.\n\nOn the Terrace of the Western Mystery Mountain, these two scriptures are inscribed upon jade tablets in golden characters. They are also present, though not in full, in the Pure Void Heaven of Wangwu. The immortals of the Central Palace and the various officials of the Grand Clarity do not even know what these texts pertain to.\n\nWithin the stone chamber’s pivot at the northern cavern of Mount Emei, twenty characters are carved into the stone: *\"Yu Yi draws the essence of the sun; Jie Lin summons the spirit of the moon. Attaining the Dao, one dwells in the Upper Palace, ranked as a Perfected of Great Courage.\"* Lesser immortals who see this find themselves utterly unable to comprehend its meaning. Many such immortals have never even glimpsed the titles or registers of these texts.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 647,
      "start_sentence": 0,
      "end_sentence": 27,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.946261405944824,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\灵图类\\太上玉晨郁仪结璘奔日月图.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "其金液九丹，盖小术也，皆不得飞行上清。 欲行此道，不必贤愚，但地上无此文耳。 真官玄法，启誓乃传，有得而行，位为上真，乃乘八景琼轮，游行九晨。 故秘言曰：子得郁仪结璘，乃成上清之真，不修此道，不得见三元君。 太素真人曰：子存日精五帝君，口含太上郁仪文，须此道成，乃见日中君，无此徒劳自烦冤。 又曰：子存月精五帝夫人，口含太上结璘章，须此道成，乃见月夫人，无此徒劳自悼伤。 右二条，太素真人受太帝君诀言。 太上隐书云：存时执之。 帝君云含之。 太素真人教裴君，存时含一文，执一文，并行之也。 太素真人传清灵真人裴君二事，太上郁仪结璘文章，以致於日月之精神，上奔日月，通天光飞太空之道也。 皆乘云车羽盖，驾命群龙，而上升皇天紫庭也。 内视中方曰：子欲步空，当存日月，子欲登清灵，当存五星，密室密行，不出户庭，此之谓也。 素奏丹符曰：大哉郁仪，妙乎结璘，非上真不见，非上仙不闻，以致日月五精之神，乘龙步空，足摄景云，逐与五帝，上入天门，有人闻之，慎勿妄言，去世可出，誓金乃传，要付弟子，有心之人，妄道篇目，玉童上言，泄则被考，身终不仙，玉童玉女，去而不还，书文必失，获刑三官，子其慎言，言为罪源。 日宫 玉堂宗旨云：当於朔旦平坐，清斋静定，叩齿三十六通，先存自己丹田为大海，日从海出，本身坐顶门，身如山石，咒曰： 阳生元海，自下而升，混混阳精，逐散群阴，中有大神，郁仪之君，降此真气，濯我身形。 玉堂宗旨云：诵咒毕，咽津九过，次存日升，金光照映我真形，我朝日宫，咒曰： 金轮呈瑞，洞焕阳明，炎光奔飞，万里流精，魔爽灭焰，尘垢荡清，冲虚飞步，驭气高升。 玉堂宗旨云：诵咒毕，咽液九过，次乘火龙，奔日宫，咒曰： 火龙前驱，透顶光飞，神入无何，朝拜郁仪，瞬目上御，混合灵辉，一真逐本，烧灭彭尸。 玉堂宗旨云：诵咒毕，咽液九过思入日宫，与身为一，良久忘形，融融如春，行之一年辟病，役使鬼神，去来自然； 二年通仙，三界侍卫； 三年魔王保举；",
      "translated_text": "The Golden Liquid and Nine Elixirs are but minor arts, all insufficient to ascend to the Upper Clarity. To practice this Dao, one need not be wise or foolish—only that such texts do not exist in the mortal realm. The true methods of the Mysterious Law are transmitted only after vows are sworn. Those who obtain and practice them attain the rank of Upper Perfected, then ride the Eight Radiance Jade Wheels, roaming the Nine Mornings. Thus, the secret words say: *\"Only when you master Yu Yi and Jie Lin do you become a Perfected of the Upper Clarity. Without cultivating this Dao, you cannot behold the Three Primordial Lords.\"*\n\nThe Perfected of the Great Simplicity said: *\"Store within you the essence of the sun and the Five Emperor Lords; hold in your mouth the scripture of the Supreme Yu Yi. Only when this Dao is accomplished will you meet the Lord of the Sun. Without it, your efforts are in vain, and you will only bring distress upon yourself.\"* He also said: *\"Store within you the essence of the moon and the Five Empress Ladies; hold in your mouth the chapter of the Supreme Jie Lin. Only when this Dao is accomplished will you meet the Lady of the Moon. Without it, your efforts are in vain, and you will only invite sorrow.\"* These two passages were the oral instructions the Perfected of the Great Simplicity received from the Supreme Thearch.\n\nThe *Hidden Writ of the Supreme* states: *\"When storing, grasp it.\"* The Thearch said: *\"Hold it in your mouth.\"* The Perfected of the Great Simplicity taught Lord Pei that when storing, one should hold one scripture in the mouth and grasp another, practicing both simultaneously. The Perfected of the Great Simplicity transmitted to the Perfected of Pure Numinosity, Lord Pei, these two matters—the scriptures of the Supreme Yu Yi and Jie Lin—to summon the spirits of the sun and moon, ascend to the sun and moon, and traverse the celestial radiance to soar through the Great Void. All ride cloud chariots and feathered canopies, driving a host of dragons to ascend to the Purple Court of the August Heaven.\n\nThe *Inner Vision of the Central Realm* says: *\"If you wish to walk the void, store the sun and moon within. If you wish to ascend to the Pure Numinosity, store the Five Stars within. Practice in secret, never leaving your chamber—this is the way.\"* The *Plain Memorial of the Cinnabar Talismans* states: *\"Great is Yu Yi! Wondrous is Jie Lin! They are unseen by lesser Perfected, unheard by lesser immortals. Through them, one summons the spirits of the sun, moon, and Five Essences, rides dragons to walk the void, and treads upon radiant clouds. Following the Five Emperors, one enters the Gate of Heaven. Whoever hears of this must not speak carelessly. Only when leaving the mortal world may it be transmitted, and only after swearing a golden oath. It must be entrusted to disciples of sincere heart. Those who recklessly reveal its contents will be reported by the Jade Lads, punished, and barred from immortality. The Jade Lads and Jade Maidens will depart, never to return, and the scriptures will be lost. One will incur the judgment of the Three Officials. Beware of speech, for words are the source of transgression.\"*\n\nThe *Purport of the Jade Hall* of the Sun Palace states: *\"At dawn on the first day of the lunar month, sit in quietude, purify yourself, and settle your mind. Strike your teeth thirty-six times. First, visualize your cinnabar field as a great sea, the sun rising from it. Your body sits atop your crown, solid as mountain stone. Recite the incantation: *'Yang arises from the Primordial Sea, ascending from below. The undifferentiated yang essence scatters the host of yin. Within it dwells a great spirit, the Lord Yu Yi. Descend with this true qi to bathe my form.'*\"*\n\nThe *Purport of the Jade Hall* states: *\"After reciting the incantation, swallow saliva nine times. Next, visualize the sun rising, its golden light illuminating your true form. Face the Sun Palace and recite the incantation: *'The Golden Wheel manifests its auspice, resplendent with yang brightness. The flaming radiance soars, streaming essence for ten thousand li. Demonic vapors extinguish their flames; dust and filth are swept clean. Ascend through emptiness, riding qi on high.'*\"*\n\nThe *Purport of the Jade Hall* states: *\"After reciting the incantation, swallow saliva nine times. Then, mount the fire dragon and hasten to the Sun Palace. Recite the incantation: *'The fire dragon leads the way, piercing the crown with flying light. The spirit enters the boundless, paying homage to Yu Yi. In an instant, ascend and merge with the numinous radiance. The One True follows its origin, burning away the corpse of Peng.'*\"*\n\nThe *Purport of the Jade Hall* states: *\"After reciting the incantation, swallow saliva nine times and contemplate entering the Sun Palace, merging with your body as one. After a long while, forget your form, warm as spring. Practicing this for one year dispels illness, commands ghosts and spirits, and allows natural coming and going. After two years, one attains communion with immortals and receives the attendance of the Three Realms. After three years, the Demon Kings will vouch for you.\"*",
      "overlap_context": " even know what these texts pertain to.\n\nWithin the stone chamber’s pivot at the northern cavern of Mount Emei, twenty characters are carved into the stone: *\"Yu Yi draws the essence of the sun; Jie Lin summons the spirit of the moon. Attaining the Dao, one dwells in the Upper Palace, ranked as a Perfected of Great Courage.\"* Lesser immortals who see this find themselves utterly unable to comprehend its meaning. Many such immortals have never even glimpsed the titles or registers of these texts.",
      "start_char": 647,
      "end_char": 1478,
      "start_sentence": 28,
      "end_sentence": 51,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.722989559173584,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\灵图类\\太上玉晨郁仪结璘奔日月图.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "九年功成，五帝下友，诏子为真人，得长生矣。 太上玉晨郁仪奔目赤景玉文 灵书紫文曰：采服飞根，吞日气之法，昔授之於太微天帝君，一名赤丹金精石景水母玉胞经。 其法常以日初出之时，东向叩齿九通，毕，微祝日魂名，日中五帝字曰： 日魂朱景照韬绿映回霞赤童玄炎飙象。 右呼此十六字，握固，存日中五色流霞来接一身，日光流霞俱入口中。 上清紫书曰：吞月精法，月初出时，西向叩齿十通，微祝月魄名，月中夫人字曰： 月魄暧萧芳艳翳寥婉虚灵兰郁华结翘淳金清莹炅容台标。 右咒此二十四字，毕，暝目握固，存月中五色精光俱入口中，又月中有黄气，大如目瞳，名曰飞华玉胞之精。 能修此道，则奔日月之仙也。 凡行郁仪奔日之道，旦旦常当伺视日初出之时，无日当静室中，对日东向，叩齿九通，临目闭气九息，又咽日光晖九徧，存光霞使入口中，即而吞之。 毕，微呼曰： 日中青帝，讳圆常元，字照龙韬，衣青玉锦帔，苍华飞羽裙，建翠芙蓉晨冠。 日中赤帝，讳丹灵峙，字绿虹映，衣绛玉锦帔，丹华飞羽裙，建丹芙蓉灵明冠。 日中白帝，讳浩郁将，字回金霞，衣素玉锦帔，白羽飞华裙，建皓灵芙华冠。 日中黑帝，讳澄溱渟，字玄绿炎，衣玄玉锦帔，黑羽飞华裙，建玄山芙蓉冠。 日中黄帝，讳寿逸阜，字飙晖象，衣黄玉锦帔，黄羽飞华裙，建黄芙灵紫冠。 月中夫人魂精内神，名暧萧台标。 凡三过，仍闭目握固，存见日中五色流霞，皆来接一身，下至两足，又存令五色气上至头顶，於是日光流霞五色，俱来口中。 又日光流霞之中，自复有紫气大如目瞳者，累重数十，焆焕在五色光中，名之曰飞根水母也，并俱与五气来入口中，向日吞霞，作四十五咽气。 毕，又叩齿九过，微祝曰： 赤炉丹气，圆天飞精，刚以受柔，炎水阴英，日辰元景，号曰大明，九阳齐化，二烟俱生，凝魂和魄，五气之精，中生五帝，乘光御形，采飞以虚，啜根以盈，首巾龙华，帔朱带青，辔乌流玄，霞映上清，赐书玉简，金阁刻名，服食朝霞，与道合灵，飞仙太微，上升紫庭。 祝毕，存青帝君从日光中来下，在我之左； 存赤帝君从日光中来下，在我之右； 存白帝君从日光中来下，在我之背，存黑帝君从日光中来下，在我之左手上； 存黄帝君从日光中来下，在我之右手上。 五帝都来，存服色极令仿髴。 於是叩齿五通，咽液九过，微祝曰： 赤炉丹景，圆华九明，大晖启晨，焕曜朱精，五帝肇霞，映洞万生，观落上真，空无条平，运气练采，流荡五形，使我神化，六腑敷灵，同与帝君，太乙无英，骖乘绛云，阳燧九軿，上奔日中，与帝合灵，寿均天地，二晨相倾。 毕，又叩齿三通，咽液三过，又微祝曰： 月魄精神，暧萧台标，使我得到，日窟之天，东蒙长丘，得授挥神之章，带九有之符，食青精之饴，饮云碧之腴，宴八极之域，登明真之台，坐希林之殿，咏玉晨之辞。 祝毕。 右存阳燧绛云之车，驾九赤龙，来从日光中到我之前，仍存五帝共乘而奔日也。 自忘形良久，咽液十四过讫，乃闭目极念，存思自有仿髴，便向日再拜。 能久行此道者，必得乘景奔日，此郁仪之道毕矣。 若道士休粮山中，长斋五岳，绝尘人间，远思清真，可每日服日根之霞，吞太阳之精，则立觉体生玉泽，面有流光也。",
      "translated_text": "After nine years of practice, the Five Emperors descend to befriend you, and a decree is issued to name you a *Zhenren* (Perfected One), granting you eternal life.\n\nThe *Supreme Jade Dawn’s* *Yu Yi’s Hastening Gaze Red Radiance Jade Scripture* states: The method of *cai fu fei gen* (gathering and ingesting flying roots) and swallowing the qi of the sun was once transmitted by the Celestial Emperor of the Grand Tenuity. It is also called the *Red Cinnabar Metal Essence Stone Radiance Water Mother Jade Embryo Scripture*. The practice is as follows: At sunrise, face east and click your teeth nine times. Then, softly invoke the names of the sun’s soul and the five emperors within it:\n\n*Sun Soul, Vermilion Radiance, Illuminating Veil, Green Reflected Glow, Rosy Clouds, Crimson Youth, Mystic Flame, Whirling Simurgh.*\n\nRecite these sixteen characters while holding your fists firmly. Visualize the five-colored streaming radiance within the sun approaching your body, with the sunlight and flowing radiance both entering your mouth.\n\nThe *Purple Scripture of the Upper Clarity* states: The method of swallowing the essence of the moon is practiced at moonrise. Face west and click your teeth ten times. Softly invoke the names of the moon’s spirit and the Lady of the Moon:\n\n*Moon Spirit, Warm and Serene, Fragrant and Luminous, Veiled and Vast, Graceful and Void, Numinous Orchid, Luxuriant Blossom, Jade Petals, Pure Gold, Limpid and Bright, Radiant Countenance, Terrace’s Standard.*\n\nRecite these twenty-four characters, then close your eyes and hold your fists firmly. Visualize the five-colored essence and light of the moon entering your mouth. Within the moon, there is also a yellow qi, as large as the pupil of an eye, called the *flying blossom jade embryo’s essence*. Those who cultivate this Way become immortals who hasten to the sun and moon.\n\nFor the practice of *Yu Yi’s Hastening to the Sun*, one should daily await the moment of sunrise. If the sun is not visible, remain in a quiet chamber, face east, click your teeth nine times, close your eyes, and hold your breath for nine cycles. Then swallow the sun’s radiant light nine times, visualizing the light and radiance entering your mouth before ingesting it. Afterward, softly invoke:\n\n*Within the Sun, the Azure Emperor, whose taboo name is Yuan Chang Yuan and style name is Zhao Long Tao, wears a cyan jade brocade mantle, a skirt of azure blossoms and flying feathers, and a morning crown of emerald lotus.*\n\n*Within the Sun, the Vermilion Emperor, whose taboo name is Dan Ling Zhi and style name is Lü Hong Ying, wears a crimson jade brocade mantle, a skirt of vermilion blossoms and flying feathers, and a luminous crown of red lotus.*\n\n*Within the Sun, the White Emperor, whose taboo name is Hao Yu Jiang and style name is Hui Jin Xia, wears a white jade brocade mantle, a skirt of white feathers and flying blossoms, and a crown of luminous white lotus.*\n\n*Within the Sun, the Black Emperor, whose taboo name is Cheng Qin Ting and style name is Xuan Lü Yan, wears a black jade brocade mantle, a skirt of black feathers and flying blossoms, and a crown of dark mountain lotus.*\n\n*Within the Sun, the Yellow Emperor, whose taboo name is Shou Yi Fu and style name is Biao Hui Xiang, wears a yellow jade brocade mantle, a skirt of yellow feathers and flying blossoms, and a purple crown of yellow lotus.*\n\nThe spirit within the moon’s essence is named *Warm and Serene Terrace’s Standard*.\n\nRepeat this invocation three times, then close your eyes and hold your fists firmly. Visualize the five-colored streaming radiance within the sun approaching your body, descending to your feet, then ascending to the crown of your head. Next, visualize the five-colored qi of the sunlight and radiance entering your mouth. Within the flowing radiance of the sunlight, there is also a purple qi, as large as the pupil of an eye, layered in dozens, resplendent within the five-colored light. This is called the *flying root water mother*. Together with the five qi, it enters your mouth. Face the sun and swallow the radiance forty-five times. Afterward, click your teeth nine times and softly invoke:\n\n*Red furnace’s cinnabar qi, celestial orb’s flying essence, hardness receives softness, flame and water’s yin flower. Sun’s primal radiance, named Great Brightness, nine yangs harmonize as one, twin mists arise together. Congeal the soul and harmonize the po, essence of the five qi. Within, the Five Emperors are born, riding the light to command form. Gather the flying in emptiness, sip the root to fullness. Head draped in dragon blossoms, mantle of vermilion, sash of azure. Bridle the crow’s flowing mystery, radiance reflects the Upper Clarity. Bestowed with jade tablets, name inscribed in the Golden Pavilion. Feast on morning radiance, unite with the Dao in numinosity. Ascend as an immortal to the Grand Tenuity, soaring to the Purple Court.*\n\nAfter the invocation, visualize the Azure Emperor descending from the sunlight to your left, the Vermilion Emperor to your right, the White Emperor to your back, the Black Emperor above your left hand, and the Yellow Emperor above your right hand. All Five Emperors arrive—visualize their attire in vivid detail. Then click your teeth five times, swallow saliva nine times, and softly invoke:\n\n*Red furnace’s cinnabar radiance, orb of ninefold brilliance, great radiance dawns, resplendent vermilion essence. Five Emperors initiate the dawn, illuminating the myriad beings of the cavernous void. Behold the descent of the Upper Perfected, vast and boundless. Circulate qi and refine the gathered, flowing through the five forms. Transform my spirit, infuse the six viscera with numinosity. Together with the Emperor Lords, unite with the Supreme One’s peerless essence. Mount the crimson clouds, ninefold sun-chariot of yang’s mirror. Ascend to the sun’s midst, merge with the Emperor in numinosity. Lifespan equals heaven and earth, twin dawns converge.*\n\nAfterward, click your teeth three times, swallow saliva three times, and softly invoke:\n\n*Moon’s spirit and essence, Warm and Serene Terrace’s Standard, enable me to reach the sun’s cavern-heaven. On the eastern peak of Chang Qiu, receive the scripture of wielding spirits, bear the talisman of the nine provinces, feast on azure essence’s nectar, drink cloud-jade’s richness. Feast in the realm of the eight poles, ascend the terrace of luminous perfection, sit in the Hall of Sparse Forests, chant the verses of jade dawn.*\n\nAfter the invocation, visualize the crimson cloud chariot of the *yang mirror*, drawn by nine red dragons, arriving before you from the sunlight. Then visualize the Five Emperors riding together toward the sun. Forget your form for a long while, swallow saliva fourteen times, then close your eyes and focus your thoughts until a semblance appears. Bow twice toward the sun. Those who practice this Way for a long time will surely attain the ability to ride the radiance and hasten to the sun. This concludes the *Yu Yi’s Way*.\n\nIf a Daoist abstains from grains in the mountains, maintains perpetual fasting on the Five Peaks, severs ties with the mundane world, and deeply contemplates purity and perfection, they may daily ingest the sun’s root-radiance and swallow the essence of the Great Yang. Soon, their body will emanate jade-like luster, and their face will glow with flowing light.",
      "overlap_context": "\"*\n\nThe *Purport of the Jade Hall* states: *\"After reciting the incantation, swallow saliva nine times and contemplate entering the Sun Palace, merging with your body as one. After a long while, forget your form, warm as spring. Practicing this for one year dispels illness, commands ghosts and spirits, and allows natural coming and going. After two years, one attains communion with immortals and receives the attendance of the Three Realms. After three years, the Demon Kings will vouch for you.\"*",
      "start_char": 1478,
      "end_char": 2774,
      "start_sentence": 52,
      "end_sentence": 87,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.182581663131714,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\灵图类\\太上玉晨郁仪结璘奔日月图.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "如其外累人事，未获静形，浮游世路，心拘萦网者，要以月朔三日、五日、七日、九日、十三、十五、十七、十九、二十五日，按而为之，如上法，一月之中十过也。 其日是日魂下接，飞根盈满，水母群梦之时也。 右凡行之十八年，上清当练之以金真，莹以玉光，位为真皇，飞行太空，乘华三素，以映天下。 太上服日气开明灵符 右月晦夜半，朱书青纸上，东向服之，以先告日魂也。 临服符时，闭气，左手执符，心咒曰： 太微丹书，名曰开明，致日上魂，来化某形，平旦严装，发自圆庭，飞华水母，日跟金精，紫映流光，号为五灵。 咒毕，乃服符。 月宫 复於望日，存自己如昆仑山，身坐山顶，山下大海，月轮初生，咽津三过，叩齿三通，咒曰： 真景初生，阴中至阳，水泛玄轮，金露微芒，津源畅通，辉映琼房，气增光盛，服御飞翔。 诵毕，咽津九过，次存月光如半规，金光照映我身，咒曰： 景散天池，金水半规，光明幽夜，照我玄珠，饮泛晶浆，香透灵躯，数周真会，乘景冲飞。 诵咒毕，咽津九过，叩齿，存月圆，真水成桥，下接山石，我身乘彩凤入月中，咒曰： 天源周流，光透重楼，霄映十方，五液荡幽，冲虚摄景，真身飞浮，一真上朝，阳九无忧。 诵毕，咽津九过，思入月宫，与身为一，良久忘形，觉金光四散，普天光明。 行之一年无病，役鬼神去来自然； 二年通真，三界侍卫； 三年魔王保举；",
      "translated_text": "Should worldly affairs entangle you, preventing stillness of form, or should you wander the paths of the mundane with your heart ensnared in webs of distraction, then perform this practice on the third, fifth, seventh, ninth, thirteenth, fifteenth, seventeenth, nineteenth, and twenty-fifth days of the lunar month—ten times within a single month—following the method described above. These are the days when the sun’s soul descends to meet the earth, when the flying root is full, and when the water mother and her dream-hosts gather.\n\nAfter eighteen years of such practice, the Supreme Clarity will refine you with golden perfection, polish you with jade radiance, and elevate you to the rank of True Sovereign. You will soar through the great void, riding the threefold splendor of the celestial blossoms, illuminating all beneath heaven.\n\n**The Supreme’s Sun-Qi Opening Brightness Talisman**\nOn the final night of the lunar month at midnight, write this talisman in cinnabar on blue-green paper, face east, and ingest it to first announce yourself to the sun’s soul. When taking the talisman, hold your breath, grasp it in your left hand, and recite the incantation in your heart:\n\n*\"The Vermilion Script of the Great Subtlety,\nNamed Opening Brightness,\nSummons the sun’s upper soul\nTo transform this form.\nAt dawn’s first light, arrayed in solemnity,\nDeparting from the round courtyard,\nFlying blossoms and water mother,\nSun-root and golden essence,\nPurple radiance streaming,\nCalled the Fivefold Numinous.\"*\n\nOnce the incantation is complete, ingest the talisman.\n\n**The Lunar Palace**\nOn the full moon, visualize yourself as Kunlun Mountain, seated at its summit with the great sea below. As the moon’s wheel first rises, swallow saliva three times, and knock your teeth together thrice. Recite the incantation:\n\n*\"True radiance first arises,\nSupreme Yang within Yin,\nWaters surge in the dark wheel,\nGolden dew glimmers faintly,\nThe source of fluids flows freely,\nIlluminating the jade chamber,\nQi swells with luminous might,\nFeasting upon the soaring flight.\"*\n\nAfter reciting, swallow saliva nine times. Next, visualize the moonlight as a half-crescent, its golden radiance shining upon your body, and recite:\n\n*\"Radiance scatters from the celestial pool,\nGolden waters in half-arc,\nLight brightens the hidden night,\nIllumining my dark pearl,\nDrinking the crystalline nectar,\nFragrance permeates the numinous frame,\nAfter cycles of true convergence,\nRiding the radiance in soaring flight.\"*\n\nOnce the incantation is complete, swallow saliva nine times and knock your teeth. Visualize the moon as full, true water forming a bridge descending to the mountain’s stones. Your body, riding a multicolored phoenix, enters the moon. Recite:\n\n*\"The celestial source flows in cycles,\nLight pierces the layered towers,\nDawn’s glow suffuses the ten directions,\nFive fluids stir the hidden depths,\nSoaring through emptiness, seizing the radiance,\nThe true body takes flight,\nA single perfection ascends in audience,\nThe Yang cycle knows no sorrow.\"*\n\nAfter reciting, swallow saliva nine times. Envision entering the lunar palace, merging with your body, and after a long while, forget your form. Feel the golden light scattering in all directions, illuminating the entire sky.\n\nPracticing this for one year banishes illness, and spirits come and go at your command. After two years, you commune with the true, and the Three Realms attend you. After three years, the demon kings will vouch for you.",
      "overlap_context": "ce this Way for a long time will surely attain the ability to ride the radiance and hasten to the sun. This concludes the *Yu Yi’s Way*.\n\nIf a Daoist abstains from grains in the mountains, maintains perpetual fasting on the Five Peaks, severs ties with the mundane world, and deeply contemplates purity and perfection, they may daily ingest the sun’s root-radiance and swallow the essence of the Great Yang. Soon, their body will emanate jade-like luster, and their face will glow with flowing light.",
      "start_char": 2774,
      "end_char": 3346,
      "start_sentence": 88,
      "end_sentence": 106,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.34659242630005,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\灵图类\\太上玉晨郁仪结璘奔日月图.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "九年功成，五夫人下诏子形，而得飞仙矣。 太上玉晨结璘奔月黄景玉章 灵书紫文曰：采服阴华，吞月精之法，昔授之於太微天帝君，一名黄气阳精藏天隐月经。 行结璘奔月之道，当伺视月初出之时，无月当於静室中，乃对月西向，叩齿十通， 临目闭气九息，又咽月光九过。 当存月光，使入口中，即而吞之。 毕，微呼曰： 月中青帝夫人，讳朱隐娥，字芬艳婴，衣青华琼锦帔，翠龙凤文飞羽裙。 月中赤帝夫人，讳翳逸寥，字婉筵虚，衣丹蕊玉锦帔，朱华凤落飞羽裙。 月中白帝夫人，讳灵素兰，字郁连华，衣白琳四出龙绵帔，素羽鸾章飞华裙。 月中黑帝夫人，讳结连翘，字淳属金，衣玄琅九道云锦帔，黑羽龙文飞华裙。 月中黄帝夫人，讳青营襟，字炅定容，衣黄云山云锦帔，绿羽凤华绣裙。 右夫人头上，并颓云三角髻，余发垂之至腰。 日中五色魂精内神，名珠景赤童。 凡祝三过，仍瞑目握固，存见月中五色流精，皆来接一身，下至两足，存令五气上至头顶，於是月光五色流精，俱来入口中。 又月光流精之中，自复有黄气大如目瞳者，累重数十，相随在月精光五色之中，名曰飞黄月华之精也。 并俱与五气来入口中，向月吞精，作五十咽。 毕，咽液十过。 毕，又叩齿十通，微祝曰： 黄精玄晖，元阴上气，散郁寒飙，条灵敛胃，虚波澜颖，游翟淳器，月精夜景，玄宫上贵，五君夫人，各保母立，万方，和魂制魄，五胎流通，乘霞飞精，逸虚於东，首结灵云，景华招风，左带龙符，右腰虎章，凤羽朱帔，玉佩金珰，骞树结阿，号曰木王，神蟇控根，有亏有光，明精内映，玄水吐梁，赐书玉札，刻名云房，服食月华，与真合同，飞仙紫微，上朝太皇。 祝毕，存青帝夫人从月光中来下，在我之左； 存赤帝夫人从月光中来下，在我之右；",
      "translated_text": "After nine years of practice, the achievement is complete, and the Five Ladies descend to summon your form, whereupon you attain the rank of flying immortal.\n\n**The Jade Dawn’s Jeweled Radiance Rushing to the Moon and the Yellow Effulgence Jade Scripture**\n\nThe *Numinous Writ of the Purple Text* states: The method of gathering and ingesting yin blossoms, of swallowing the moon’s essence, was once transmitted by the Celestial Emperor of the Grand Tenuity. It is also called *The Yellow Qi Yang Essence Concealed in Heaven and Hidden in the Moon Scripture*.\n\nTo practice the Way of Jeweled Radiance Rushing to the Moon, one should await the moment of the moon’s first rising. If there is no moon, proceed in a quiet chamber, facing west toward the moon. Knock the teeth ten times, close the eyes, hold the breath for nine cycles, and then swallow the moonlight nine times. Envision the moonlight entering your mouth, and then swallow it.\n\nOnce done, softly intone:\n*\"The Azure Emperor’s Lady of the Moon, whose taboo name is Zhu Yine, and whose style is Fenyan Ying, wears a robe of azure-flowered jade brocade with a cape of kingfisher-green, and a flying-feather skirt embroidered with dragon and phoenix patterns.\nThe Vermilion Emperor’s Lady of the Moon, whose taboo name is Yi Yiliao, and whose style is Wanyan Xu, wears a robe of cinnabar-bud jade brocade with a cape of vermilion, and a flying-feather skirt of fallen phoenix plumes.\nThe White Emperor’s Lady of the Moon, whose taboo name is Ling Sulan, and whose style is Yulian Hua, wears a robe of white nephrite brocade with four-dragon motifs and a cape of white silk, and a flying-feather skirt adorned with white luan-bird patterns.\nThe Black Emperor’s Lady of the Moon, whose taboo name is Jie Lianqiao, and whose style is Chun Shujin, wears a robe of dark jadeite brocade with nine-cloud motifs and a cape of black silk, and a flying-feather skirt embroidered with black dragon patterns.\nThe Yellow Emperor’s Lady of the Moon, whose taboo name is Qing Yingjin, and whose style is Jiong Dingrong, wears a robe of yellow cloud-mountain brocade with a cape of yellow silk, and a flying-feather skirt of green phoenix embroidery.\"*\n\nEach of the Ladies wears her hair in a three-cornered cloud-toppled chignon, with the rest flowing down to her waist. Within the sun dwell the five-colored soul-essences of the inner spirits, named Zhu Jing Chi Tong.\n\nRecite the invocation three times, then close the eyes and clench the fists. Envision the five-colored flowing essences from the moon descending to embrace your entire body, down to your feet. Envision the five qi ascending to the crown of your head. Then, the five-colored flowing essences of the moonlight all enter your mouth. Within the flowing essence of the moonlight, there is also a yellow qi, large as the pupil of an eye, layered in dozens, following within the five-colored radiance of the moon’s essence. This is called the flying yellow moon-blossom essence. Together with the five qi, it enters your mouth. Facing the moon, swallow the essence fifty times. Once done, swallow saliva ten times. Then knock the teeth ten times again and softly intone:\n\n*\"Yellow essence, mysterious splendor,\nPrimal yin’s ascending qi,\nDispersing pent-up cold gales,\nOrdering numinous powers to gather the stomach,\nEmpty waves and rippling tassels,\nWandering through pure vessels,\nMoon’s essence, night’s radiance,\nExalted in the Dark Palace,\nFive Ladies, each safeguarding their mother’s standing,\nIn the ten thousand directions,\nHarmonizing the hun and restraining the po,\nThe five wombs flowing freely,\nRiding the clouds to fly the essence,\nSoaring in emptiness to the east,\nCrowning the head with numinous clouds,\nRadiant blossoms summoning the wind,\nLeft girded with the dragon tally,\nRight bearing the tiger insignia,\nPhoenix-feathered vermilion cape,\nJade pendants and golden earrings,\nThe soaring tree binding the slopes,\nNamed the Wood King,\nThe divine toad controlling the roots,\nNow waning, now waxing,\nBright essence inwardly reflecting,\nDark waters spouting beams,\nGranting the jade tablet of scripture,\nInscribing the name in the cloud chamber,\nIngesting the moon’s blossoms,\nMerging with the true,\nFlying immortal of the Purple Tenuity,\nAscending in audience to the Grand August One.\"*\n\nOnce the invocation is complete, envision the Azure Emperor’s Lady descending from the moonlight to stand at your left, and the Vermilion Emperor’s Lady descending from the moonlight to stand at your right.",
      "overlap_context": "cends in audience,\nThe Yang cycle knows no sorrow.\"*\n\nAfter reciting, swallow saliva nine times. Envision entering the lunar palace, merging with your body, and after a long while, forget your form. Feel the golden light scattering in all directions, illuminating the entire sky.\n\nPracticing this for one year banishes illness, and spirits come and go at your command. After two years, you commune with the true, and the Three Realms attend you. After three years, the demon kings will vouch for you.",
      "start_char": 3346,
      "end_char": 4062,
      "start_sentence": 107,
      "end_sentence": 127,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.911526441574097,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\灵图类\\太上玉晨郁仪结璘奔日月图.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "存白帝夫人从月光中来下，在我之背； 存黑帝夫人从月光中来下，在我之左手上； 存黄帝夫人从月光中来下，在我之右手上。 五帝夫人都来，存服色，极令仿髴。 於是叩齿九通，咽液九过，微祝曰： 黄精启晖，元阴内章，映观太玄，开洞万方，散蔚寒飙，七晨悬琅，回阴三合，天地吐光，紫曜游落，浮华九空，圆明赋采，六气化通，五帝夫人，摄云把风，灵帔郁罗，佩琼带珰，羽裙拂霄，逸云扇东，骞树敷晨，盖条秀蓬，云蟇练摩，扶养木王，洞根万里，荫遏五躬，魂和神化，六玄灵充，还老归婴，玉映反童，帝君合化，并景桃康，时乘流铃，飞云十龙，上奔明月，位为保皇，寿合二象，天地无穷。 祝毕，又叩齿七通，咽液七过，微祝曰： 日魂精神，名珠景赤童，使我西到，六岭之门，入协晨玉宫，八弦素丘，八景上房，得带十明之符，佩流星夜光之章，坐太和之殿，登七灵之台，饮月华云腴，食黄琬紫津之饴，咏高上灵篇，吟玉晨真词。 祝毕。 右存流铃飞云之车，驾十黄龙，来从月光中到我之前，仍存与五夫人同乘，而奔月也。 自入己形，良久，咽液三十过讫，乃开目极念，存思自有彷佛，便向月再拜。 能久行此道者，必得乘景奔月，此结璘之道毕矣。 施行要诀，如服月光，能夕夕服之，则立觉体生光照，目有飞精也。 要法月二日、四日、六日、八日、十日、十四、十六、十八、二十二、二十四、二十六，一月之中，凡十一过，亦足成仙也。 此日之夕，是阴精飞合，三气盈溢，月水结华，黄神下接之时也。 行之十八年，上清当炼魂易质，映以玉光，乘玄辔景，飞行太空。 紫微服月精太玄阴生符 右月晦夜半，黄书青纸上，东向服之，以先告月魂也。 是时当先服开明灵符也。 临服月符，闭气，右手执符，心咒曰： 紫微黄书，名曰太玄，致月华水，养魄和魂，方中严事，发自玄关，藏天隐月，五灵夫人，飞光九道，映朗泥丸。 咒毕，乃服符。 又曰：能知月魄名，终身无灾，万害不伤。 太上藏日月帝夫人讳字於太素宫，有知之者神仙。 又曰：能知日魂名，终身无疾，万祸不犯。 太上藏日月魂名於紫虚玉宫，有知之者通神使灵。 存奔日月道者，任所便耳，不必尽为之也。 欲得静室隐止，唯令见日月之始晖处也。 若不绝人事，与外物相干者，不得行此道也。 夜常烧香，存五帝、五夫人名字，心咒曰：愿与帝君太一五神，合景如一。 於是二十四年行之，亦白日升天，亦不必行奔存之道。 恒存在我之左右，并心咒。 旧说勿令耳闻。 若已得仙道，备练精思者，二年存之，便有彷佛，三年形见，五年得奔日月也。 自非已成仙人，始欲精思者，故为不速。 能久修之，上属二景，为上清真人，七百年付一人焉。 太上玉晨郁仪结璘奔日月图竟",
      "translated_text": "Envision the White Emperor’s Lady descending from the moonlight to stand at your back; envision the Black Emperor’s Lady descending from the moonlight to stand upon your left hand; envision the Yellow Emperor’s Lady descending from the moonlight to stand upon your right hand. When all Five Emperor’s Ladies have arrived, visualize their attire in vivid detail. Then knock the teeth nine times, swallow saliva nine times, and softly intone:\n\n\"Yellow essence unfurls its radiance,\nPrimal yin reveals its inner splendor,\nIllumining the vision of the Great Mystery,\nOpening the caverns of the ten thousand directions,\nDispersing the misty chill winds,\nSeven dawns suspending their jade,\nThe Three Convergences of yin revolve,\nHeaven and Earth exhale their light,\nPurple luminaries roam and descend,\nFloating blossoms fill the nine voids,\nPerfect clarity bestows its hues,\nThe six qi transform and interflow,\nThe Five Emperor’s Ladies,\nGrasping clouds and seizing winds,\nDivine capes of dense gauze,\nAdorned with jade pendants and golden earrings,\nFeathered skirts brushing the clouds,\nWafting mists fanning the east,\nThe soaring tree unfurling the dawn,\nIts branches lush as the sacred fern,\nCloud toads refining and polishing,\nNurturing the Wood King,\nPenetrating roots for ten thousand miles,\nShading and sheltering the five bodies,\nHun and po harmonized and transformed,\nThe six mysteries brimming with numinous power,\nReturning from old age to infancy,\nJade-like radiance reverting to youth,\nThe Perfected Lords merging in transformation,\nTogether in the luminous peach of well-being,\nTimely riding the Flowing Chime,\nTen dragons drawing the cloud chariot,\nAscending to the bright moon,\nAttaining the rank of Preserving August One,\nLifespan uniting with the two images,\nHeaven and Earth enduring without end.\"\n\nWhen the incantation is complete, knock the teeth seven times, swallow saliva seven times, and softly intone:\n\n\"Spirit of the sun’s essence,\nNamed the Crimson Lad of Radiant Pearl,\nGuide me westward to\nThe Gate of the Six Peaks,\nEntering the Jade Palace of Harmonious Dawn,\nThe White Mound of Eight Strings,\nThe Upper Chamber of Eight Sceneries,\nTo receive the talisman of Ten Brightnesses,\nTo wear the insignia of the Night-Shining Flowing Star,\nTo sit in the Palace of Great Harmony,\nTo ascend the Terrace of Seven Numinosities,\nTo drink the moon’s blossoms and cloud cream,\nTo feast on the amber of yellow jade and the nectar of purple springs,\nTo chant the Lofty Numinous Stanzas,\nTo recite the True Verses of the Jade Dawn.\"\n\nWhen the incantation is complete, envision to your right the Flowing Chime Cloud Chariot, drawn by ten yellow dragons, arriving from the moonlight before you. Then envision yourself riding together with the Five Ladies, hastening toward the moon.\n\nReturning to your own form, after a long while, swallow saliva thirty times, then open your eyes and concentrate intently, visualizing until a semblance appears, and bow twice toward the moon. Those who practice this Way for a long time will surely attain the ability to ride the luminous chariot and hasten to the moon—thus concludes the Way of the Jade Dawn’s *Jie Lin*.\n\n**Essential Instructions for Practice:**\nAs with absorbing moonlight, if practiced nightly, one will swiftly perceive the body emanating light, the eyes possessing flying essence. The essential method is to perform this on the 2nd, 4th, 6th, 8th, 10th, 14th, 16th, 18th, 22nd, 24th, and 26th days of the month—eleven times in a lunar cycle—sufficient to attain immortality. On these evenings, yin essence takes flight and converges, the Three Qi overflow, the moon’s waters crystallize into blossoms, and the Yellow Spirit descends to receive them.\n\nAfter eighteen years of practice, the Upper Clarity will refine the hun and transmute the substance, suffusing it with jade-like radiance, riding the dark reins of luminous chariots to traverse the Great Void.\n\n**Purple Tenuity’s Talisman for Absorbing the Moon’s Essence and the Great Mystery’s Yin-Generating Sign**\nOn the last night of the lunar month at midnight, inscribe in yellow upon blue paper, face east to ingest it, first announcing it to the moon’s essence. At this time, one should first ingest the Talisman of Opening Numinosity.\n\nWhen about to ingest the moon talisman, hold the breath, grasp the talisman in the right hand, and silently recite:\n\"Purple Tenuity’s yellow script,\nNamed the Great Mystery,\nSummons the moon’s blossom waters,\nNurtures the po and harmonizes the hun,\nWithin the square, solemn affairs commence,\nIssuing from the Mysterious Pass,\nConcealing heaven and veiling the moon,\nThe Five Numinous Ladies,\nNine paths of flying light,\nIllumine the Mud Pill Palace.\"\n\nWhen the incantation is complete, ingest the talisman.\n\nIt is also said: One who knows the name of the moon’s po will be free from calamity for life, and no harm will befall them. The Most High concealed the names and titles of the Sun and Moon Emperor’s Ladies within the Palace of Primordial Simplicity—those who know them become divine immortals.\n\nIt is further said: One who knows the name of the sun’s essence will be free from illness for life, and no misfortune will touch them. The Most High concealed the names of the sun and moon’s essences within the Palace of Purple Emptiness and Jade—those who know them command spirits and employ numina.\n\nFor those practicing the Way of Hastening to the Sun and Moon, proceed as convenient; it need not be performed in full. Seek a secluded chamber, ensuring only the first glimmer of the sun or moon is visible. If one does not sever worldly affairs and remains entangled with external matters, this Way cannot be practiced.\n\nNightly, burn incense and visualize the names of the Five Emperors and Five Ladies, silently reciting: \"May I unite with the Perfected Lords and the Great One, merging our luminous forms as one.\" After twenty-four years of such practice, one may also ascend to heaven in broad daylight, without necessarily performing the hastening visualization. Constantly visualize them at your left and right, silently reciting the incantation—an ancient teaching not to be heard by the ears.\n\nFor those who have already attained the immortal Way and refined their essence through meditation, two years of visualization will yield semblances, three years will manifest forms, and in five years, one may hasten to the sun and moon. For those who are not yet immortals but seek to refine their essence, progress will not be swift. With prolonged practice, one will ascend to the Two Luminaries, becoming an Upper Clarity Perfected—once every seven hundred years, this is transmitted to a single person.\n\nHere ends *The Jade Dawn’s Diagram of Yu Yi and Jie Lin Hastening to the Sun and Moon*.",
      "overlap_context": "xing,\nBright essence inwardly reflecting,\nDark waters spouting beams,\nGranting the jade tablet of scripture,\nInscribing the name in the cloud chamber,\nIngesting the moon’s blossoms,\nMerging with the true,\nFlying immortal of the Purple Tenuity,\nAscending in audience to the Grand August One.\"*\n\nOnce the invocation is complete, envision the Azure Emperor’s Lady descending from the moonlight to stand at your left, and the Vermilion Emperor’s Lady descending from the moonlight to stand at your right.",
      "start_char": 4062,
      "end_char": 5138,
      "start_sentence": 128,
      "end_sentence": 164,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.21072697639465,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\灵图类\\太上玉晨郁仪结璘奔日月图.txt",
        "category": "灵图类"
      }
    }
  ]
}