{
  "source_id": "太上明鉴真经",
  "source_file": "chunked_daozang\\太上明鉴真经.json",
  "total_chunks": 4,
  "total_original_chars": 3742,
  "total_translated_chars": 20637,
  "total_translation_time": 99.08975553512573,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\太上明鉴真经.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Supreme Clarity Mirror Scripture**\n\n**Scripture Title:** *The Supreme Clarity Mirror Scripture*\nAuthor unknown; composed during the Tang dynasty to avoid the taboo character *yuan*.\n\nThis text expounds the secrets of the luminous mirror and the methods of ingesting elixirs and visualizing spirits. One scroll.\n\n**Source:** *Zhengtong Daoist Canon*, Orthodox Section, Part One.\n\n---\n\n**The Supreme Clarity Mirror Scripture**\n\nLord Lao said: The inner vision of Metal and Water, where yin activates yang, enables one to master this Way—dispersing the body and scattering form, transforming the One into the Myriad. Six armies arise, and beyond a thousand myriad leagues, breath traverses to and fro. Riding clouds and treading water, one enters and exits without obstruction. Heavenly spirits and earthly deities, malevolent ghosts and ancient specters—all hidden things become visible.\n\nThrough focused contemplation, one perceives the future in reverse. If you can preserve this, you shall become a Perfected King.\n\nLord Lao said: To practice the luminous mirror, avoid mourning households and birthing chambers. Don immaculate garments, perfumed with incense, and bathe in the five fragrances. Drink the essences of orchid and cassia, abstain from pungent and acrid foods, and forsake all rank and irritating substances. Do not approach women. In a secluded and tranquil place, within a quiet chamber—where the sounds of carriages, horses, gongs, drums, birds, and beasts cannot be heard—only then may you proceed.\n\nThe greatest taboo of this Way is startlement. Once disturbed, it cannot be restored; once failed, it cannot be accomplished. At that moment, the heart must not cling to any lingering thought, nor the ears seek to hear. Fix the mind and align the gaze, meditating with unwavering focus. Only then may it be achieved.\n\nLord Lao said: Obtain a nine-inch mirror, ensuring its surface is free of flaws, cracks, or blemishes. It must be clear, bright, and perfectly round, flawlessly reflecting the human countenance. In ancient times, my former master used a twelve-inch mirror, placing one before, behind, left, and right—these were called the *Four Compasses*.\n\nPracticing this Way is exceedingly difficult to achieve swiftly and easily. If startled, great misfortune follows, for few can master it. Wenzi and Haocheng each used a single one-foot mirror placed before them, through which they beheld spirits, yet could not attain longevity.\n\nLord Lao said: Place a nine-inch mirror on each side—these are called the *Sun and Moon*—and you may extend your years. If you wish to disperse the body and scatter form, to sit yet vanish, to stand yet disappear, to ascend to the Yellow Court, to achieve immortality and deathlessness, to command the hundred spirits, to enter water and fire, metal and stone, wood and earth, to fly at will—then you must employ my *Four Compasses* method. If you merely seek to foreknow fortune and misfortune, the *Sun and Moon* suffice.\n\nLord Lao said: The method of arranging the compasses requires placing each one foot and five inches from yourself, aligned with your eyebrows. Let purple and azure threads hang down, with patterned water below, ensuring all is level. Day and night, do not close your eyes—success is marked by this. You must not close your eyes, for if a spirit suddenly appears while your eyes are shut, you may fail to see it at once, causing the spirit to depart or, if you open your eyes abruptly, leading to shock and failure.\n\nLord Lao said: The *Four Compasses* method will reveal venerable spirits. Do not show this to anyone who is not a superior adept of the highest truth. My Way is most profound; few in the world are worthy. It is better to conceal it within the gates of the Dao.\n\nFor those practicing the *Four Compasses*, arrange them one foot and five inches from yourself, three feet high.\n\n- The **Eastern Compass** will reveal two immortals, wearing vermilion *li* crowns. Their faces are narrow, ears high upon their heads, and their bodies covered in black hair. Do not be alarmed upon seeing them.\n- The **Western Compass** will reveal the Queen Mother of the West, attended by jade maidens.\n- The **Southern Compass** will reveal the Primordial Sovereign of Central Harmony and Non-Ultimacy, with one body and eleven heads. He wears a natural crown and red robes.\n- The **Northern Compass** will reveal the Heavenly August Lord, with thirteen heads. His robes and crown match the colors of the season.\n\nLingyang Ziming, who obtained this method, said:\n- You may see two figures in yellow robes and yellow crowns. The white-bearded one is the Lord of Extended Lifespan; the younger is the Lord of Received Destiny.\n- You may see two figures in red robes and red headbands. The younger is the Lord of Bestowed Destiny; the elder is the Lord of Life Records.\n- You may see two figures in feathered robes and yellow-black crowns—the Lord of Inspecting Conduct.\n- You may see three figures in feathered robes, red in color with azure crowns—the Lords of Hearing Echoes.\n- You may see one figure in a grand crown and vermilion robes, holding a brush and tablet—the Lord of Recording Transgressions.\n- You may see one figure in yellow robes and crown, covering his face—the Lord of Increasing Years.\n- You may see two figures in red skirts—the Lords of Observing Forms.\n- You may see a jade maiden in blue robes—named the Jade Maiden of Benevolent Essence.\n- You may see a jade maiden in black robes—named the Jade Maiden of Great Mystery.\n- You may see a jade maiden in red robes—named the Jade Maiden of the Red Jade.\n- You may see a jade maiden in yellow robes—named the Jade Maiden of Constant Yang.\n- You may see three youths in blue robes with purple hems—named Ever-Present, Unfathomable, and Five Virtues.\n- You may see nine jade maidens in five-colored robes—named Supreme, Tiger, Support, Numinous Gate, Forest of Apertures, Feng, Abiding, Many, and [missing character].\n- You may see one figure with eyes three inches wide beneath them, wearing yellow robes and blue hems—the Lord of Shared Vision.\n- You may see an infant two or three feet tall, smiling at you—the Nine Capital Youths.\n- You may see a youth five or six feet tall, standing and laughing. If a natural canopy appears above him, he is the Youth of the Sun; if not, the Youth of the Moon.\n- You may see a figure with a human head and bird’s body, five-colored and dark yellow—the Supreme Sovereign of the Great One, Father of the Dao.\n- You may see nine figures, all in blue robes with white hair—the Great Sovereigns of Non-Ultimacy.\n- You may see one figure, six feet and five inches tall, with horned crown, white robes, and red collar, or adorned with tiger patterns and phoenix emblems. His surname is Li, given name Er, courtesy name Boyang. Greet him always at dawn.\n\nShould you see one figure, six feet and seven inches tall, wearing a *Chonghua* crown and white robes with blue trim—his name is Li Tao, courtesy name Boyang. Greet him always at sunrise.\n\nShould you see one figure, six feet and nine inches tall, wearing a *Chonghua* crown and five-colored robes—his name is Li [missing character], courtesy name Boguang. Greet him always at breakfast hour.\n\nShould you see one figure, seven feet and two inches tall, wearing a *Bixie* crown and gauze robes, his form like dragons and serpents—his name is Li Shi, courtesy name Menggong. Greet him always at mid-morning.\n\nShould you see one figure, seven feet and three inches tall, wearing a *Feilong* crown and crimson robes—his name is Li Chongquan, courtesy name Ziwen. Greet him always at noon.\n\nShould you see one figure, seven feet and five inches tall, wearing a *Sanjie* crown and vermilion jade robes—his name is Li Ding, courtesy name Wuyang. Greet him always at afternoon decline.\n\nShould you see one figure, eight feet tall, wearing a fur crown and black robes—his name is Li Yuan, courtesy name Boshi. Greet him always at late afternoon.\n\nShould you see one figure, eight feet and five inches tall, wearing a *Ziran* crown and dragon-serpent robes—his name is Li Yuan, courtesy name Yuansheng. Greet him always at sunset.\n\nShould you see one figure, nine feet and five inches tall, wearing a *Ziran* crown and blue-purple robes—his name is Li Yuan, courtesy name Bowen. Greet him always at dusk.\n\nLaozi said: The superior adept accomplishes this in seven days, the middling adept in ten, and the lesser adept in a month.\n\nLaozi said: Let purple and blue form the lining, joined to nine inches; the compass should measure one foot and two inches.\n\nLaozi said: The superior adept, in practicing this, first sees his own form, then the spirits within his dwelling, and finally the celestial deities.\n\nThe spirits may not all appear at once—most often, no more than six or seven deities will come.\n\nSimply gaze steadily into the compass, without fixating on the deities you see. Do not speak, do not bow; compose yourself swiftly, without fear.\n\nLaozi said: Those who practice this Dao must not fell trees in spring, nor pour water to extinguish fire in summer; in the months of the four seasons, they must not dig earth; in autumn, they must not smelt metal; in winter, they must not block water or draw from wells.\n\nLaozi said: Those who practice this Dao must not eat liver in spring, heart in summer, spleen in the months of the four seasons, lungs in autumn, or kidneys in winter. If the spirits of the five viscera grow angry, they will cause one to lose clarity and longevity.\n\nLaozi said: Those who practice this Dao must not slacken for seven days. Those who succeed should perform it once every seventy days, always as on the first day. This Dao can restore youth and reverse aging.\n\nLingyang Ziming said: It is settled and level.\n\nLaozi said: After seeing the spirits, continue the practice, and you may ask them the essentials of longevity—they will tell you all.\n\nLaozi said: Once the Dao of the Four Compasses is accomplished, you may hold to the Dao of the Single Compass and practice it, no longer needing the four.\n\nPerform the twofold fast of the Dark Gate, don a green headband, ascend to the Northern Culmen, descend into the Mysterious Trace, and mirror your affairs with it.\n\nIn practicing this Dao, you must always position the Vermilion Bird three feet high above, the Dark Warrior five feet high below, the Azure Dragon nine feet high to the left, and the White Tiger seven feet high to the right. You must also tread upon the sun and moon.\n\nLaozi said: Not only yourself—you must also have the Vermilion Bird hold a nine-inch mirror, the Dark Warrior bear a twelve-inch mirror on its back, the Azure Dragon hold the sun, and the White Tiger hold the moon. Your form will resemble that of dragons and serpents. Once you can divide your form, you may sit and see beyond the Four Seas—only then will the true beings arrive.\n\nAt night, use lamps, candles, and hemp oil for fire—this is most excellent.\n\nTo heal the sick or enter great mountains, fearing that mountain spirits and the hundred ghosts may test you, place one compass above the door and a vessel of flower-water below. Draw your sword and lay it horizontally over the water, blade facing outward. No ghost will advance. If an old demon enters the door, it will not cross the water but die, its blood pooling within.\n\nGuard this secret; do not show it to the vulgar.\n\nLaozi said: To repel the five weapons and the hundred evils, take a three-inch compass and cast the Round Heaven Talisman. Carry it on your person—on the right on yin days, on the left on yang days. Entering a great assembly, you will prevail, and all will fear you. My Dao is secret.\n\nOn such-and-such a year, month, and day, in such-and-such a prefecture, commandery, county, and village, Daoist so-and-so transmits the essentials of Laozi’s Four Compasses Bright Mirror to the student from such-and-such a prefecture, commandery, county, and village. The covenant is made with forty feet of white silk, one *dou* of rice, one bundle of firewood, and five *sheng* of salt. If the transmitter fails to impart the essential teachings, may they descend into the Yellow Springs with their body unwhole. Together with the former master, the Perfected Lord Zhang Baiyu, and the Metal Master so-and-so, they draw one mark as a sign. The transmission remains valid for three years; it must not be passed to unworthy recipients, or the transmitter will answer to the Three Officials of Heaven, Earth, and Water. Those who attain immortality must not betray the original vow.\n\nLaozi said: The Turning Heaven Talisman is also called the Round Heaven Talisman or the Covering Heaven Talisman—it was kept secret by Zuo Yuanfang.\n\nWrite it in vermilion.\n\n*(Talisman text missing in original.)*\n\nLaozi said: The Round Heaven Talisman averts disasters and misfortunes. It grants long life and enduring vision, preserving you as heaven does. Tigers and wolves will break their fangs and lose their teeth; the hundred weapons will not dare approach. Those who see it will prostrate themselves and dare not rise.\n\nWhoever bears this talisman—who can know them? With left robe and right *ji*, they shall receive heaven’s blessing, live for a thousand autumns and ten thousand years, and attain boundless longevity.\n\nSwiftly, swiftly, as in statute and command!\n\nFormerly, the Yellow Court Perfected Person, a Daoist, bowed his head and respectfully asked: Among the qi of heaven, earth, and the five phases, humans are the most noble. Yet some live long and others do not—what is the reason?\n\nLaozi said: Humans receive the qi of heaven and earth and should all live to one hundred and twenty years. But they indulge in joy and anger, greed and lust, fine flavors and rich foods, unable to cease grains. They find no joy in emptiness, dwell daily among the vulgar, and cannot contemplate the Dao. They are accompanied by evil ghosts, which is why they do not live long.\n\nThe Daoist said: If one could cease grains, find no joy in fine flavors, rich foods, or lust, could one transcend and avoid aging?\n\nLaozi said: If you can love the Dao, carefully guard body and mind, and uphold the One in your person, you may attain agelessness.\n\nThe human head is round, modeling heaven; the feet are square, modeling earth. The five viscera correspond to the five phases, the four limbs to the four seasons, the nine palaces to the nine provinces. The eyes correspond to the sun and moon, the hair to the stars. Humans align with the foundation of heaven—thus, among the ten thousand things, humans are the most noble.\n\nHeaven has a divine medicine called *Jiuheng*, spread throughout the world, growing in damp and moist places. Its leaves are lustrous like the male fowl, thriving and vigorous along the Dao. In the eighth month of autumn, male and female plants intertwine at the root, their branches and leaves entangled. Dragons and serpents obtain it and hide it away in their mouths.\n\nIn the third month of spring, when thunder roars, it emerges. Those who obtain and eat it store it in a stone chamber as a treasure. When Yao faced the great flood and the people suffered hunger and thirst, he ordered them to gather it, and all were saved. If you examine and consume it, you may attain divine transcendence. Sages who consume it seal their mouths and do not speak. Now I tell you—you may transcend your body.\n\nGather it in the mist, when male and female plants unite in the height of autumn—this is most excellent. Hang it in the north of your dwelling to dry in the shade. Pound it a thousand times, place it in a large vessel, and mix with honey to form pills the size of parasol seeds. Take three pills daily. After twenty-one days—three times seven—the Dao is complete.\n\nOn the first day of consumption, ascend to the Muddy Pellet and descend to Kunlun. On the second day, wander and rest in the Jade Hall. On the third day, pass through the Jade Gate. On the fourth day, push aside the Flowery Canopy and rest in the Crimson Palace. On the fifth day, climb Mount Hua—most excellent! All the spirits will escort you to ascend the Jade Heaven and enter the Jade Hall. After twenty-one days of consumption, men and women, young and old, will each attain their proper place.\n\nHow can one not strive with diligence? Transmit this only to the worthy.\n\nThe *Illustrated Manual of Herbs with Stalks* states: In the second month, it grows by the wayside, its color green, with nine nodes. The third node from the bottom bears twelve leaves, the fourth node twelve leaves, and the sixth node another twelve leaves—thirty-six leaves in all. Its lower root resembles a seated person, about three inches long, white at the core, with yellow skin. Its flavor is sweet and pungent.\n\nThe *Seventy-Six Divine Elixir Scripture* prescribes medicinal talismans: four distinct talismans for each of the four directions, their combination imbued with spiritual power.\n\n- **Northern Talisman of Celestial Union**\n- **Western Talisman of the Great General**\n- **Southern Talisman of the Crimson Lord’s Daughter**\n- **Eastern Talisman of the Azure-Tusked Youth**\n\nInscribe them in black and place in the north on *shou* days; in white and place in the west on *jian* days; in vermilion and place in the south on *man* days; in azure and place in the east on *cheng* days. The Yellow Lad and Jade Maiden govern the essence of the medicine. When talismans are crafted on these days and placed in the four directions, no harm shall befall the elixir.\n\nLaozi said: The lower form harbors corpse-worms like parasites. When Daoists consume this, the worms descend with the qi, and in an instant, the eyes grow bright. This expels the corpse-destroying agent. Simply observe the days of brightness and clarity to purge the body, then drink pure and limpid water. No more than seven cycles of purification are needed; the corpse-worms will descend within seven cycles. After seven cycles, even the elderly will feel rejuvenated—then withdraw in stillness.\n\nThere are also two talismans, both derived from the eighth talisman of Laozi’s *Thirty-Nine True Talismans*. Though the original text comprises two scrolls with differing talismans, they are recorded here again. Both talismans subdue the corpse-worms.\n\nWhen expelling corpse-worms, do not speak of it beforehand. Though the Three Corpses lack ears and eyes, they foreknow human intent—only secrecy ensures success. Prepare the medicine in a secluded place.\n\nAuspicious days for entering the mountains to gather herbs:\n- First day of the first month\n- Twenty-fifth day of the second month\n- Twenty-fourth day of the third month\n- Sixteenth day of the fourth month\n- Eleventh day of the fifth month\n- Sixth day of the sixth month\n- Second day of the seventh month\n- Twenty-fifth day of the eighth month\n- Twenty-first day of the ninth month\n- Sixteenth day of the tenth month\n\nThese are the days when the Celestial Granary opens—journeying to renowned mountains on these dates brings good fortune.\n\nAuspicious days for entering mountains (by month and earthly branch):\n- First month: *zi* day\n- Second month: *chou* day\n- Third month: *yin* day\n- Fourth month: *mao* day\n- Fifth month: *chen* day\n- Sixth month: *si* day\n- Seventh month: *wu* day\n- Eighth month: *wei* day\n- Ninth month: *shen* day\n- Tenth month: *you* day\n- Eleventh month: *xu* day\n- Twelfth month: *hai* day\n\nThese are the days when Heaven and Earth open—entering mountains on them is most auspicious, allowing long residence in safety and peace.\n\nLaozi said: Carry the Mountain-Entering Talisman, inscribed in cinnabar on white silk, and you may traverse the world unobstructed.\n\nLaozi said:\n- The nameless name is the dwelling of my true self; the named name is the thief of my treasury.\n- The unpossessed possession preserves my virtue; the possessed possession is the bandit of my being.\n\nNo sin is greater than lust, no misfortune greater than greed, no fault greater than desire. These three calamities are the chariot of ruin—minor, they endanger the body; major, they destroy the family.\n\nThough fasting in purity, invoke the Three Spirits:\n1. **Spirit of the Vermilion Lord**\n2. **Spirit of the Luminous Lord**\n3. **Spirit of the Yellow Lord**\n\nConstantly meditate upon them, reciting their names thrice daily in all activities—walking, standing, sitting, or lying down—to transcend calamitous years. Guard this secret; do not transmit it lightly.\n\nThe first spirit wears a crimson robe and yellow skirt; the second, a yellow robe and yellow skirt; the third, a crimson robe and yellow skirt.\n\nHere ends the *Scripture of the Supreme Clarity’s Illuminating Mirror*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上明鉴真经 经名：太上明鉴真经。 撰人不详，避渊字讳，当出於唐代。 言明镜诀及服药思神法。 一卷。 底本出处：《正统道藏》正一部。 太上明鉴真经 老子曰：金水内景，以阴发阳，能为此道，分身散形，以一为万，立成六军，千亿里外，呼吸往还，乘云履水，出入无间，天神地祇，邪鬼老魅，隐蔽之类，皆可见也。 审其精思，逆见方来，子能守之，为仙王也。 老子曰：欲行明镜，勿入丧家、产乳之中，精衣香熏，沐浴五香，并饮兰桂之液，无食熏辛之物，绝弃腥躁，无近妇人，於密靖之地，幽室之中，不闻车马之声、金鼓之音、鸟兽喧噪，乃可为之。 此道之忌，莫甚於惊，一往不复反，一败不复成也。 当其时，心不欲复有所存，耳不复欲有所听，注心正目，彷佛想念，至精不怠，乃复可成。 老子曰：当得明镜九寸，无令面有偏缺毁损疵瑕，务欲清明周正，不失人容色者善。 昔我先师，以尺二寸镜，前后左右〔各〕#1一焉，名曰四规。 行此道者，甚难速成易得，若惊则有大殃，少能者也。 文子豪成，皆以一尺镜一枚，正置其前，亦以见神，而不能长生也。 老子曰：以九寸镜各一枚，侠其左右，名曰日月，亦以延年矣。 若欲分身散形，坐在立亡，上升黄庭，长生不死，役使百灵，入水入火，入金入石，入木入土，飞行在意者，当用吾四规之道。 若但欲逆知吉凶，日月足矣。 老子曰：立规之法，皆去己一尺五寸，令与眉齐，各垂紫青线，下有华水，务令平也。 昼夜不闭目，以得为效。 不可闭目者，恐当闭目之时，神明忽见而不即见之，或失神以去，或卒开目见之，而渐致惊惧而败也。 老子曰：四规之道，必见尊神，非上士至真，勿以此示之。 吾道至密，世无其人，宁见道门。 欲行四规者，皆令去己一尺五寸，高三尺。 东规当见仙人二人，冠丹纚之冠，面貌狭小，耳高其头，身皆生黑毛，见之勿惊。 西规当见西王母，玉女侍之。 南规当见中和无极元君，一身十一头，冠自然之冠，衣色赤。 北规当见天皇君十三头，衣冠之色如其时也。 陵阳子明得此法曰：或见二人，衣黄衣，冠黄冠，白须者即延寿君也，少者受命君也。 或见二人，赤衣赤帻，年少者禀命君也，老者司命君也。 或见二人，衣羽衣，黄色玄冠者，察行君也。 或见三人，衣羽衣，赤色青冠者，听响君也。 或见一人，大冠朱衣，执笔把札者，司过君也。 或见一人，黄衣冠，掩面者，增年君也。 或见二人，赤裳者，视形君也。 或见玉女青衣者，名曰惠精玉女。 或见玉女黑衣，名曰太玄玉女。 或见玉女赤衣者，名曰赤圭玉女。 或见玉女黄衣者，名曰常阳玉女。 或见童子三人，青衣紫下俱来者，一名常在，一名绝洞，一名五德。 或见九玉女，衣服五彩俱来者，一名上，一名虎，一名扶，一名灵阙，一名孔林，一名冯，一名住，一名多，一名□#2。 或见一人，目下径三寸，黄衣青下者，同目君。 或见婴儿长二三尺，向人笑者，是九都童子。 或见童子长五六尺，立而笑，其上有自然盖者，日中童子也，上无自然盖者，月中童子也。 或见人头鸟身，五色玄黄者，上上太一君道父也。 或见九人，皆衣青衣而白首者，无极大元君也。 或见一人，长六尺五寸，冠角，白衣赤领，或虎文凤章者，姓李名耳，字伯阳，见之常以平旦。",
      "translated_text": "**The Supreme Clarity Mirror Scripture**\n\n**Scripture Title:** *The Supreme Clarity Mirror Scripture*\nAuthor unknown; composed during the Tang dynasty to avoid the taboo character *yuan*.\n\nThis text expounds the secrets of the luminous mirror and the methods of ingesting elixirs and visualizing spirits. One scroll.\n\n**Source:** *Zhengtong Daoist Canon*, Orthodox Section, Part One.\n\n---\n\n**The Supreme Clarity Mirror Scripture**\n\nLord Lao said: The inner vision of Metal and Water, where yin activates yang, enables one to master this Way—dispersing the body and scattering form, transforming the One into the Myriad. Six armies arise, and beyond a thousand myriad leagues, breath traverses to and fro. Riding clouds and treading water, one enters and exits without obstruction. Heavenly spirits and earthly deities, malevolent ghosts and ancient specters—all hidden things become visible.\n\nThrough focused contemplation, one perceives the future in reverse. If you can preserve this, you shall become a Perfected King.\n\nLord Lao said: To practice the luminous mirror, avoid mourning households and birthing chambers. Don immaculate garments, perfumed with incense, and bathe in the five fragrances. Drink the essences of orchid and cassia, abstain from pungent and acrid foods, and forsake all rank and irritating substances. Do not approach women. In a secluded and tranquil place, within a quiet chamber—where the sounds of carriages, horses, gongs, drums, birds, and beasts cannot be heard—only then may you proceed.\n\nThe greatest taboo of this Way is startlement. Once disturbed, it cannot be restored; once failed, it cannot be accomplished. At that moment, the heart must not cling to any lingering thought, nor the ears seek to hear. Fix the mind and align the gaze, meditating with unwavering focus. Only then may it be achieved.\n\nLord Lao said: Obtain a nine-inch mirror, ensuring its surface is free of flaws, cracks, or blemishes. It must be clear, bright, and perfectly round, flawlessly reflecting the human countenance. In ancient times, my former master used a twelve-inch mirror, placing one before, behind, left, and right—these were called the *Four Compasses*.\n\nPracticing this Way is exceedingly difficult to achieve swiftly and easily. If startled, great misfortune follows, for few can master it. Wenzi and Haocheng each used a single one-foot mirror placed before them, through which they beheld spirits, yet could not attain longevity.\n\nLord Lao said: Place a nine-inch mirror on each side—these are called the *Sun and Moon*—and you may extend your years. If you wish to disperse the body and scatter form, to sit yet vanish, to stand yet disappear, to ascend to the Yellow Court, to achieve immortality and deathlessness, to command the hundred spirits, to enter water and fire, metal and stone, wood and earth, to fly at will—then you must employ my *Four Compasses* method. If you merely seek to foreknow fortune and misfortune, the *Sun and Moon* suffice.\n\nLord Lao said: The method of arranging the compasses requires placing each one foot and five inches from yourself, aligned with your eyebrows. Let purple and azure threads hang down, with patterned water below, ensuring all is level. Day and night, do not close your eyes—success is marked by this. You must not close your eyes, for if a spirit suddenly appears while your eyes are shut, you may fail to see it at once, causing the spirit to depart or, if you open your eyes abruptly, leading to shock and failure.\n\nLord Lao said: The *Four Compasses* method will reveal venerable spirits. Do not show this to anyone who is not a superior adept of the highest truth. My Way is most profound; few in the world are worthy. It is better to conceal it within the gates of the Dao.\n\nFor those practicing the *Four Compasses*, arrange them one foot and five inches from yourself, three feet high.\n\n- The **Eastern Compass** will reveal two immortals, wearing vermilion *li* crowns. Their faces are narrow, ears high upon their heads, and their bodies covered in black hair. Do not be alarmed upon seeing them.\n- The **Western Compass** will reveal the Queen Mother of the West, attended by jade maidens.\n- The **Southern Compass** will reveal the Primordial Sovereign of Central Harmony and Non-Ultimacy, with one body and eleven heads. He wears a natural crown and red robes.\n- The **Northern Compass** will reveal the Heavenly August Lord, with thirteen heads. His robes and crown match the colors of the season.\n\nLingyang Ziming, who obtained this method, said:\n- You may see two figures in yellow robes and yellow crowns. The white-bearded one is the Lord of Extended Lifespan; the younger is the Lord of Received Destiny.\n- You may see two figures in red robes and red headbands. The younger is the Lord of Bestowed Destiny; the elder is the Lord of Life Records.\n- You may see two figures in feathered robes and yellow-black crowns—the Lord of Inspecting Conduct.\n- You may see three figures in feathered robes, red in color with azure crowns—the Lords of Hearing Echoes.\n- You may see one figure in a grand crown and vermilion robes, holding a brush and tablet—the Lord of Recording Transgressions.\n- You may see one figure in yellow robes and crown, covering his face—the Lord of Increasing Years.\n- You may see two figures in red skirts—the Lords of Observing Forms.\n- You may see a jade maiden in blue robes—named the Jade Maiden of Benevolent Essence.\n- You may see a jade maiden in black robes—named the Jade Maiden of Great Mystery.\n- You may see a jade maiden in red robes—named the Jade Maiden of the Red Jade.\n- You may see a jade maiden in yellow robes—named the Jade Maiden of Constant Yang.\n- You may see three youths in blue robes with purple hems—named Ever-Present, Unfathomable, and Five Virtues.\n- You may see nine jade maidens in five-colored robes—named Supreme, Tiger, Support, Numinous Gate, Forest of Apertures, Feng, Abiding, Many, and [missing character].\n- You may see one figure with eyes three inches wide beneath them, wearing yellow robes and blue hems—the Lord of Shared Vision.\n- You may see an infant two or three feet tall, smiling at you—the Nine Capital Youths.\n- You may see a youth five or six feet tall, standing and laughing. If a natural canopy appears above him, he is the Youth of the Sun; if not, the Youth of the Moon.\n- You may see a figure with a human head and bird’s body, five-colored and dark yellow—the Supreme Sovereign of the Great One, Father of the Dao.\n- You may see nine figures, all in blue robes with white hair—the Great Sovereigns of Non-Ultimacy.\n- You may see one figure, six feet and five inches tall, with horned crown, white robes, and red collar, or adorned with tiger patterns and phoenix emblems. His surname is Li, given name Er, courtesy name Boyang. Greet him always at dawn.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1268,
      "start_sentence": 0,
      "end_sentence": 47,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.99461030960083,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上明鉴真经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "或见一人，长六尺七寸，冠重华，白衣青彩，名李舕，字伯阳，见之常以日出。 或见一人，长六尺九寸，冠重华，五色衣，名李□#3，字伯光，见之常以食时。 或见一人，长七尺二寸，冠辟邪，衣罗（ ），形像龙蛇，名李石，字孟公，见之常在禺中。 或见一人，长七尺三寸，冠飞龙，衣朱衣，名李重泉，字子文，见之常以日中。 或见一人，长七尺五寸，三杰冠，朱玉衣，名李定，字无阳，见之常以日昳。 或见一人，长八尺，冠皮毛，衣黑衣，名李元，字伯始，见之常以日晡。 或见一人，长八尺五寸，冠自然，衣龙蛇，名李愿，字元生，见之常以日入。 或见一人，长九尺五寸，冠自然，衣青紫，名李愿，字伯文，见之常以黄昏。 老子曰：上士为之七日，中士一旬，下士一月成也。 老子曰：紫青为里，合之九寸，规者尺二寸。 老子曰：上士为之，先见己形，次见宅中鬼神，次见天神。 鬼神或有一身不皆见之，多不过六神、七神来也。 但熟视规中，勿熟所见神也。 亦勿语，亦勿拜，急自定，无惊恐。",
      "translated_text": "Should you see one figure, six feet and seven inches tall, wearing a *Chonghua* crown and white robes with blue trim—his name is Li Tao, courtesy name Boyang. Greet him always at sunrise.\n\nShould you see one figure, six feet and nine inches tall, wearing a *Chonghua* crown and five-colored robes—his name is Li [missing character], courtesy name Boguang. Greet him always at breakfast hour.\n\nShould you see one figure, seven feet and two inches tall, wearing a *Bixie* crown and gauze robes, his form like dragons and serpents—his name is Li Shi, courtesy name Menggong. Greet him always at mid-morning.\n\nShould you see one figure, seven feet and three inches tall, wearing a *Feilong* crown and crimson robes—his name is Li Chongquan, courtesy name Ziwen. Greet him always at noon.\n\nShould you see one figure, seven feet and five inches tall, wearing a *Sanjie* crown and vermilion jade robes—his name is Li Ding, courtesy name Wuyang. Greet him always at afternoon decline.\n\nShould you see one figure, eight feet tall, wearing a fur crown and black robes—his name is Li Yuan, courtesy name Boshi. Greet him always at late afternoon.\n\nShould you see one figure, eight feet and five inches tall, wearing a *Ziran* crown and dragon-serpent robes—his name is Li Yuan, courtesy name Yuansheng. Greet him always at sunset.\n\nShould you see one figure, nine feet and five inches tall, wearing a *Ziran* crown and blue-purple robes—his name is Li Yuan, courtesy name Bowen. Greet him always at dusk.\n\nLaozi said: The superior adept accomplishes this in seven days, the middling adept in ten, and the lesser adept in a month.\n\nLaozi said: Let purple and blue form the lining, joined to nine inches; the compass should measure one foot and two inches.\n\nLaozi said: The superior adept, in practicing this, first sees his own form, then the spirits within his dwelling, and finally the celestial deities.\n\nThe spirits may not all appear at once—most often, no more than six or seven deities will come.\n\nSimply gaze steadily into the compass, without fixating on the deities you see. Do not speak, do not bow; compose yourself swiftly, without fear.",
      "overlap_context": "th of the Moon.\n- You may see a figure with a human head and bird’s body, five-colored and dark yellow—the Supreme Sovereign of the Great One, Father of the Dao.\n- You may see nine figures, all in blue robes with white hair—the Great Sovereigns of Non-Ultimacy.\n- You may see one figure, six feet and five inches tall, with horned crown, white robes, and red collar, or adorned with tiger patterns and phoenix emblems. His surname is Li, given name Er, courtesy name Boyang. Greet him always at dawn.",
      "start_char": 1268,
      "end_char": 1678,
      "start_sentence": 48,
      "end_sentence": 61,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.607192993164062,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上明鉴真经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "老子曰：为此道者，春无伐木，夏无水灌灭火，四季之月无掘土，秋无铄金，冬无遏水杼井。 老子曰：为此道者，春无食肝，夏无食心，四季之月无食脾，秋无食肺，冬无食肾。 五脏神怒，则令人不明不寿。 老子曰：为此道者，长不怠七日，得者七十日一施之，必如初日，此道可以还年却老也。 陵阳子明曰：坦然已平。 老子曰：见神之后更施之，可问以长生之要，则具以告之。 老子曰：为此四规之道既成，可以握一规之道施之，不复用四。 幽阙二重斋，着绿帻，上入北极，下入玄踪，以镜其事。 为此道，常当上朱鸟高三尺，下玄武高五尺，左青龙高九尺，右白虎高七尺，又当履日月。 老子曰：不唯己也，又当令朱乌衔九寸镜，玄武背负尺二镜，青龙衔日，白虎衔月，己形象龙蛇。 须能分形，坐见四海之外乃止。 止者真物来，夜则以灯烛、麻油为火，大善。 欲治病人，及入大山恐山神及百鬼试人者，以一规着户上，一器华水着下，拔刀剑横水上，以刃外向，百鬼不前，有老魅至入户者，亦不得过水即死，血在水中。 秘之，勿示俗人。 老子曰：欲辟五兵百邪者，以三寸规一枚，铸圆天符，着其怀，阴日右，阳日左，入大众所为胜，人人皆畏之。 吾道秘矣。 某年某月某日，某州某郡某县某乡里，道士某以老子四规明镜要诀，授学者某州某郡某县某乡某里某，以白绢四十尺、米一斗、薪一束、盐五升为盟，丙不得不告要言，某不奉身入黄泉，一同先师，玄君张白羽偶成，金师某丙，共画一为信，三年有效乃得传，不得传非其人，身谢天地水三官，得仙不得背本之言。 老子曰：回天符，一名圆天符，一名盖天符，左元放所秘之。 朱书。 （原缺符） 老子曰：圆天符，辟灾殃，可得长生久视，与天相保。 虎狼摧牙折齿，百兵不敢向，见之则伏不敢起。 某甲服此符，谁能知者，左社右稷，当得天福，千秋万岁，长生无极。 急急如律令。 昔黄庭真人道士，稽首敢问：天地五行之气，人为贵，或寿不寿，何乃故？ 老子曰：人受天地之气，皆寿百二十岁，但喜怒贪色嗜美，甘肥快口，不能止谷，空处不乐，日居俗间，不能思道，皆邪鬼伴，故令不寿。 道士曰：若设能止谷，不乐甘肥快口好色，可以自度不老？ 老子曰：子能好道，善慎身心，奉守一身，可得不老。 人头圆法天，足方法地，五藏法五行，四肢法四时，九宫法九州，目法日月，发象星辰，子应天基，故万物之中人最为贵。 天有神药，名曰就衡，布列天下，乃生湿濡之地。 其叶光泽如长雄，生道壮盛。 秋八月，雄雌俱合根结，枝叶交错，龙蛇得之，衔用藏匿。 阳春三月，雷鸣便出，人得食之，藏之石室为宝也#4。 尧遭洪水，民饥渴，令民采之，皆用告活。 审而服之，可得神仙，圣人服之，闭口不言。 今以告子，可得度身。 候以雾采之，以盛秋雌雄合会，甚为良也。 悬之舍北，阴乾，捣千杵，盛以大盘，蜜和丸如梧子，日服三丸。 日数有三七二十一日，其道毕矣。 服之一日，上游泥丸，下还昆仑。 服之二日，游止玉堂。 服之三日，历玉户。 服之四日，排华盖，止绛宫。 服之五日，缘华山，大佳，诸神相将登玉天，上玉堂。 服之满二十一日，男女中壮小各得其所。",
      "translated_text": "Laozi said: Those who practice this Dao must not fell trees in spring, nor pour water to extinguish fire in summer; in the months of the four seasons, they must not dig earth; in autumn, they must not smelt metal; in winter, they must not block water or draw from wells.\n\nLaozi said: Those who practice this Dao must not eat liver in spring, heart in summer, spleen in the months of the four seasons, lungs in autumn, or kidneys in winter. If the spirits of the five viscera grow angry, they will cause one to lose clarity and longevity.\n\nLaozi said: Those who practice this Dao must not slacken for seven days. Those who succeed should perform it once every seventy days, always as on the first day. This Dao can restore youth and reverse aging.\n\nLingyang Ziming said: It is settled and level.\n\nLaozi said: After seeing the spirits, continue the practice, and you may ask them the essentials of longevity—they will tell you all.\n\nLaozi said: Once the Dao of the Four Compasses is accomplished, you may hold to the Dao of the Single Compass and practice it, no longer needing the four.\n\nPerform the twofold fast of the Dark Gate, don a green headband, ascend to the Northern Culmen, descend into the Mysterious Trace, and mirror your affairs with it.\n\nIn practicing this Dao, you must always position the Vermilion Bird three feet high above, the Dark Warrior five feet high below, the Azure Dragon nine feet high to the left, and the White Tiger seven feet high to the right. You must also tread upon the sun and moon.\n\nLaozi said: Not only yourself—you must also have the Vermilion Bird hold a nine-inch mirror, the Dark Warrior bear a twelve-inch mirror on its back, the Azure Dragon hold the sun, and the White Tiger hold the moon. Your form will resemble that of dragons and serpents. Once you can divide your form, you may sit and see beyond the Four Seas—only then will the true beings arrive.\n\nAt night, use lamps, candles, and hemp oil for fire—this is most excellent.\n\nTo heal the sick or enter great mountains, fearing that mountain spirits and the hundred ghosts may test you, place one compass above the door and a vessel of flower-water below. Draw your sword and lay it horizontally over the water, blade facing outward. No ghost will advance. If an old demon enters the door, it will not cross the water but die, its blood pooling within.\n\nGuard this secret; do not show it to the vulgar.\n\nLaozi said: To repel the five weapons and the hundred evils, take a three-inch compass and cast the Round Heaven Talisman. Carry it on your person—on the right on yin days, on the left on yang days. Entering a great assembly, you will prevail, and all will fear you. My Dao is secret.\n\nOn such-and-such a year, month, and day, in such-and-such a prefecture, commandery, county, and village, Daoist so-and-so transmits the essentials of Laozi’s Four Compasses Bright Mirror to the student from such-and-such a prefecture, commandery, county, and village. The covenant is made with forty feet of white silk, one *dou* of rice, one bundle of firewood, and five *sheng* of salt. If the transmitter fails to impart the essential teachings, may they descend into the Yellow Springs with their body unwhole. Together with the former master, the Perfected Lord Zhang Baiyu, and the Metal Master so-and-so, they draw one mark as a sign. The transmission remains valid for three years; it must not be passed to unworthy recipients, or the transmitter will answer to the Three Officials of Heaven, Earth, and Water. Those who attain immortality must not betray the original vow.\n\nLaozi said: The Turning Heaven Talisman is also called the Round Heaven Talisman or the Covering Heaven Talisman—it was kept secret by Zuo Yuanfang.\n\nWrite it in vermilion.\n\n*(Talisman text missing in original.)*\n\nLaozi said: The Round Heaven Talisman averts disasters and misfortunes. It grants long life and enduring vision, preserving you as heaven does. Tigers and wolves will break their fangs and lose their teeth; the hundred weapons will not dare approach. Those who see it will prostrate themselves and dare not rise.\n\nWhoever bears this talisman—who can know them? With left robe and right *ji*, they shall receive heaven’s blessing, live for a thousand autumns and ten thousand years, and attain boundless longevity.\n\nSwiftly, swiftly, as in statute and command!\n\nFormerly, the Yellow Court Perfected Person, a Daoist, bowed his head and respectfully asked: Among the qi of heaven, earth, and the five phases, humans are the most noble. Yet some live long and others do not—what is the reason?\n\nLaozi said: Humans receive the qi of heaven and earth and should all live to one hundred and twenty years. But they indulge in joy and anger, greed and lust, fine flavors and rich foods, unable to cease grains. They find no joy in emptiness, dwell daily among the vulgar, and cannot contemplate the Dao. They are accompanied by evil ghosts, which is why they do not live long.\n\nThe Daoist said: If one could cease grains, find no joy in fine flavors, rich foods, or lust, could one transcend and avoid aging?\n\nLaozi said: If you can love the Dao, carefully guard body and mind, and uphold the One in your person, you may attain agelessness.\n\nThe human head is round, modeling heaven; the feet are square, modeling earth. The five viscera correspond to the five phases, the four limbs to the four seasons, the nine palaces to the nine provinces. The eyes correspond to the sun and moon, the hair to the stars. Humans align with the foundation of heaven—thus, among the ten thousand things, humans are the most noble.\n\nHeaven has a divine medicine called *Jiuheng*, spread throughout the world, growing in damp and moist places. Its leaves are lustrous like the male fowl, thriving and vigorous along the Dao. In the eighth month of autumn, male and female plants intertwine at the root, their branches and leaves entangled. Dragons and serpents obtain it and hide it away in their mouths.\n\nIn the third month of spring, when thunder roars, it emerges. Those who obtain and eat it store it in a stone chamber as a treasure. When Yao faced the great flood and the people suffered hunger and thirst, he ordered them to gather it, and all were saved. If you examine and consume it, you may attain divine transcendence. Sages who consume it seal their mouths and do not speak. Now I tell you—you may transcend your body.\n\nGather it in the mist, when male and female plants unite in the height of autumn—this is most excellent. Hang it in the north of your dwelling to dry in the shade. Pound it a thousand times, place it in a large vessel, and mix with honey to form pills the size of parasol seeds. Take three pills daily. After twenty-one days—three times seven—the Dao is complete.\n\nOn the first day of consumption, ascend to the Muddy Pellet and descend to Kunlun. On the second day, wander and rest in the Jade Hall. On the third day, pass through the Jade Gate. On the fourth day, push aside the Flowery Canopy and rest in the Crimson Palace. On the fifth day, climb Mount Hua—most excellent! All the spirits will escort you to ascend the Jade Heaven and enter the Jade Hall. After twenty-one days of consumption, men and women, young and old, will each attain their proper place.",
      "overlap_context": "rple and blue form the lining, joined to nine inches; the compass should measure one foot and two inches.\n\nLaozi said: The superior adept, in practicing this, first sees his own form, then the spirits within his dwelling, and finally the celestial deities.\n\nThe spirits may not all appear at once—most often, no more than six or seven deities will come.\n\nSimply gaze steadily into the compass, without fixating on the deities you see. Do not speak, do not bow; compose yourself swiftly, without fear.",
      "start_char": 1679,
      "end_char": 2936,
      "start_sentence": 62,
      "end_sentence": 106,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.44885301589966,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上明鉴真经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "可不勉哉。 传之与贤。 衔草图曰：二月生於道傍，其色青，可九节，下第三节有十二叶，第四节有十二叶，第六节复有十二叶，凡三十六叶。 下根如坐人，长三寸许，中正白，皮黄。 其味甘辛。 七十六神丹经合药符，四方各别作四符，合药有神。 北方天合同符 西方大将军符 南方赤句王女符 东方青牙童符 以黑书之置北方 收日作 以白书之置西方 建日作 以朱书之置南方 满日作 以青书之置东方 成日作 黄童玉女主药精，可以合药日造符四方，不畏诸耗。 老子曰：下形中尸若虫，道士服之，即虫下时气，须臾目明。 下此煞尸，但视有明破日，荡除形身，即饮洁清。 诸不留满七破，伏尸虫下不过七破，七破老人更少，当静退也。 又二符者，同出老子三十九真符第八符，本受书二卷，符出不同，故重书。 破伏尸亦两符。 凡下尸，不得预语人，克日三尸虽无耳目，预知人但密知耳。 合药须静处，入山所宜时节：正月一日、二月二十五日、三月二十四日、四月十六日、五月十一日、六月六日、七月二日、八月二十五日、九月二十一日、十月十六日。 此是天仓开日，可以名山行来吉利。 正月子、二月丑、三月寅、四月卯、五月辰、六月巳、七月午、八月未、九月申、十月酉、十一月戌、十二月亥，此日是天地开日，入山最吉，可久居，令人安稳无患。 老子曰：入山符，丹书白素带之，横行天下。 老子曰：无名之名，盖我之宅，有名之名，丧我之橐。 无货之货，全我之德，有货之货，丧我之贼。 罪莫大於淫，祸莫大於贪，咎莫大於欲，有此三祸，名祸之车，小则危身，大则残家。 虽然斋心，念三神焉：一名灵朱君，二名灵明君，三名灵黄君。 常思念之，行住坐卧日三称其名，可度厄年也。 秘之莫传。 右第一神衣绛服黄裙，第二神衣黄服黄裙，第三神衣绛服黄裙。 太上明鉴真经竟 #1『各』字据上下文补。 #2#3原本此处缺文。 #4『藏之石室为实也』，此句原本错插入『人头圆法天』句前。",
      "translated_text": "How can one not strive with diligence? Transmit this only to the worthy.\n\nThe *Illustrated Manual of Herbs with Stalks* states: In the second month, it grows by the wayside, its color green, with nine nodes. The third node from the bottom bears twelve leaves, the fourth node twelve leaves, and the sixth node another twelve leaves—thirty-six leaves in all. Its lower root resembles a seated person, about three inches long, white at the core, with yellow skin. Its flavor is sweet and pungent.\n\nThe *Seventy-Six Divine Elixir Scripture* prescribes medicinal talismans: four distinct talismans for each of the four directions, their combination imbued with spiritual power.\n\n- **Northern Talisman of Celestial Union**\n- **Western Talisman of the Great General**\n- **Southern Talisman of the Crimson Lord’s Daughter**\n- **Eastern Talisman of the Azure-Tusked Youth**\n\nInscribe them in black and place in the north on *shou* days; in white and place in the west on *jian* days; in vermilion and place in the south on *man* days; in azure and place in the east on *cheng* days. The Yellow Lad and Jade Maiden govern the essence of the medicine. When talismans are crafted on these days and placed in the four directions, no harm shall befall the elixir.\n\nLaozi said: The lower form harbors corpse-worms like parasites. When Daoists consume this, the worms descend with the qi, and in an instant, the eyes grow bright. This expels the corpse-destroying agent. Simply observe the days of brightness and clarity to purge the body, then drink pure and limpid water. No more than seven cycles of purification are needed; the corpse-worms will descend within seven cycles. After seven cycles, even the elderly will feel rejuvenated—then withdraw in stillness.\n\nThere are also two talismans, both derived from the eighth talisman of Laozi’s *Thirty-Nine True Talismans*. Though the original text comprises two scrolls with differing talismans, they are recorded here again. Both talismans subdue the corpse-worms.\n\nWhen expelling corpse-worms, do not speak of it beforehand. Though the Three Corpses lack ears and eyes, they foreknow human intent—only secrecy ensures success. Prepare the medicine in a secluded place.\n\nAuspicious days for entering the mountains to gather herbs:\n- First day of the first month\n- Twenty-fifth day of the second month\n- Twenty-fourth day of the third month\n- Sixteenth day of the fourth month\n- Eleventh day of the fifth month\n- Sixth day of the sixth month\n- Second day of the seventh month\n- Twenty-fifth day of the eighth month\n- Twenty-first day of the ninth month\n- Sixteenth day of the tenth month\n\nThese are the days when the Celestial Granary opens—journeying to renowned mountains on these dates brings good fortune.\n\nAuspicious days for entering mountains (by month and earthly branch):\n- First month: *zi* day\n- Second month: *chou* day\n- Third month: *yin* day\n- Fourth month: *mao* day\n- Fifth month: *chen* day\n- Sixth month: *si* day\n- Seventh month: *wu* day\n- Eighth month: *wei* day\n- Ninth month: *shen* day\n- Tenth month: *you* day\n- Eleventh month: *xu* day\n- Twelfth month: *hai* day\n\nThese are the days when Heaven and Earth open—entering mountains on them is most auspicious, allowing long residence in safety and peace.\n\nLaozi said: Carry the Mountain-Entering Talisman, inscribed in cinnabar on white silk, and you may traverse the world unobstructed.\n\nLaozi said:\n- The nameless name is the dwelling of my true self; the named name is the thief of my treasury.\n- The unpossessed possession preserves my virtue; the possessed possession is the bandit of my being.\n\nNo sin is greater than lust, no misfortune greater than greed, no fault greater than desire. These three calamities are the chariot of ruin—minor, they endanger the body; major, they destroy the family.\n\nThough fasting in purity, invoke the Three Spirits:\n1. **Spirit of the Vermilion Lord**\n2. **Spirit of the Luminous Lord**\n3. **Spirit of the Yellow Lord**\n\nConstantly meditate upon them, reciting their names thrice daily in all activities—walking, standing, sitting, or lying down—to transcend calamitous years. Guard this secret; do not transmit it lightly.\n\nThe first spirit wears a crimson robe and yellow skirt; the second, a yellow robe and yellow skirt; the third, a crimson robe and yellow skirt.\n\nHere ends the *Scripture of the Supreme Clarity’s Illuminating Mirror*.",
      "overlap_context": "On the first day of consumption, ascend to the Muddy Pellet and descend to Kunlun. On the second day, wander and rest in the Jade Hall. On the third day, pass through the Jade Gate. On the fourth day, push aside the Flowery Canopy and rest in the Crimson Palace. On the fifth day, climb Mount Hua—most excellent! All the spirits will escort you to ascend the Jade Heaven and enter the Jade Hall. After twenty-one days of consumption, men and women, young and old, will each attain their proper place.",
      "start_char": 2936,
      "end_char": 3747,
      "start_sentence": 107,
      "end_sentence": 143,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.03909921646118,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上明鉴真经.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}