{
  "source_id": "太上升玄说消灾护命妙经注",
  "source_file": "chunked_daozang\\太上升玄说消灾护命妙经注.json",
  "total_chunks": 5,
  "total_original_chars": 4436,
  "total_translated_chars": 25053,
  "total_translation_time": 121.57985424995422,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\玉诀类\\太上升玄说消灾护命妙经注.txt",
    "category": "玉诀类"
  },
  "full_translation": "**The Supreme Venerable’s Ascending Mystery Scripture on Dispelling Calamities and Protecting Life, with Commentary by Master Xiūjiāng Hùnrán**\n\n**Scripture Title:** *The Supreme Venerable’s Ascending Mystery Scripture on Dispelling Calamities and Protecting Life, with Commentary*\n**Author:** Daoist Hùnránzǐ Wáng Jiè (courtesy name Dàoyuān)\n**Volume:** One\n**Source Text:** *Zhengtong Daoist Canon*, *Dongzhen* Section, *Jade Instructions* Category\n\n---\n\n**Commentary on the Title:**\n*Tài* (太) means \"ultimate\" or \"without limit.\"\n*Shàng* (上) means \"supreme.\"\n*Shēng* (升) means \"to ascend.\"\n*Xuán* (玄) means \"mysterious\" or \"profound.\"\n*Shuō* (说) means \"to expound\" or \"to enlighten.\"\n*Xiāo* (消) means \"to dispel.\"\n*Zāi* (灾) means \"calamity\" or \"harm.\"\n*Hù* (护) means \"to protect.\"\n*Mìng* (命) means \"life\" or \"destiny.\"\n*Miào* (妙) means \"wondrous,\" the mystery within the mystery.\n*Jīng* (经) means \"scripture,\" the \"heart\" and the \"path,\" the shared way all people traverse.\n\nThe Heavenly Worthy declares: The Limitless Dao gives birth to Heaven and Earth. Among the myriad things, none lacks its mystery, yet only humans possess the finest essence and the most refined spirit. Though refined, people are born in different lands and receive varying endowments, resulting in disparities of wisdom and folly. Thus, the Heavenly Worthy, moved by boundless compassion, opens the gate of expedient means to universally transform the world, illuminating the original true nature and preserving the life of the embodied self.\n\nRefine thoughts with the heart, return emotions to nature, silently activate the celestial mechanism, transform essence into *qi*, and gather it in the Palace of *Qian*, suffusing the four limbs—this is called *Ascending Mystery*. Circulate the talismanic fire to refine the spirit, swallow the golden elixir to refine the body. When the body is strong and the spirit clear, no evil can enter, no illness can arise. One attains longevity, transcends the dust, and escapes the kalpas—this is called *Dispelling Calamities and Protecting Life*.\n\nThose who can receive and uphold this Dao, circulating it throughout the body, will ride alongside the sages and immortals, sharing the same form as Heaven and Earth—this is the *Wondrous Scripture*.\n\nThe *Daode Jing* states: \"The good person is the teacher of the ungood; the ungood person is the resource of the good.\" Thus, none are to be discarded. Though sentient beings are bound by desires and attachments, within them all lies the nature of wisdom and goodness. The Heavenly Worthy expounds this scripture, revealing its profound principles to enlighten those who come after. By circulating, reciting, and delving into its teachings, one may grasp the origin of the Great Dao. Those who awaken may transform folly into wisdom, turbidity into clarity, transcend the mundane, and enter sagehood. Naturally, calamities are dispelled, sins are eradicated, life is preserved, and years are prolonged—is this not the *Wondrous Scripture*?\n\n**Eulogy:**\nThe Limitless, the Mysterious Origin,\nMajestic and sacred, the Treasure of the Numinous.\nAscending Mystery spreads the teachings,\nRevealing the Dao through scriptural discourse.\n\n---\n\n**At that time**, the Primordial Heavenly Worthy was in the Fivefold Luminous Palace within the Seven Jeweled Grove.\n\n*At that time* refers to the era of primordial chaos.\n*Primordial* (元始) signifies the ancestral *qi*.\n*The Heavenly Worthy* is the singular, most revered spirit, unmatched above Heaven or below Earth.\n*The Seven Jeweled Grove* represents the heart and the spirit.\n*The Fivefold Luminous Palace* is the Yellow Court.\n\nIn worldly terms, this corresponds to the beginning of the Dragon Han kalpa, when eight rays descended, and a single point of ancestral *qi* from the primordial kalpa transformed into ten thousand paths of upright *qi*, filling the void and coalescing into a sacred body. A singular spirit embraced the mystery of the myriad existences—hence the provisional name *Primordial Heavenly Worthy*. At the time of this discourse, he resided in the Fivefold Luminous Palace within the Seven Jeweled Grove of the Azure Heaven.\n\nIn Daoist practice, every person possesses the Primordial Heavenly Worthy. This refers to a single point of true yang *qi*, dwelling in the secret chamber of the Gate of Life. Within it hangs an empty aperture, called the Heavenly Heart, where nature also resides. It is the ancestral gathering place of the ten thousand spirits—this is the Primordial Heavenly Worthy.\n\nWhenever the first yang stirs, at the time of scripture recitation, the spirit descends to the Mysterious Pass. The *Xun* wind stirs the fire of the *Li* Palace’s samadhi, chasing the two *qi* along the Yellow Path, uniting the three natures in the Primordial Palace, and blending them into the elixir. Thus, nature is refined, as firm as metal, wholly dependent on the power of fire. Fire is governed by seven, earth by five—hence the reference to the Seven Jeweled Grove and the Fivefold Luminous Palace.\n\nThis aligns with the *Scripture of Salvation*, which states: \"The Primordial One suspends a single pearl, as large as a millet grain, in the void of the Mysterious. Five feet above the earth, it guides the way of the Heavenly Perfected.\"\n\n**Eulogy:**\nThe Primordial precedes Heaven and Earth,\nThe Effortless, the Ancestor of Kalpas.\nOne heart embraces all bodies,\nThe true descends to contemplate true emptiness.\n\n---\n\nTogether with the Limitless Assembly of Sages, he radiated boundless light, illuminating the limitless worlds.\n\nThis continues the above: when the singular spirit is rightly established, the ten thousand spirits pay homage. In worldly terms, when the Heavenly Worthy expounded the scripture, all the heavens, all the earths, the three realms, the ten directions, and the limitless assembly of sages gathered in the Seven Jeweled Grove and the Fivefold Luminous Palace, listening to the wondrous discourse. At that moment, boundless light radiated, illuminating the limitless worlds.\n\nIn Daoist practice, when refining the elixir, the turning of the Celestial Pivot reverses the mechanism of the Dipper’s handle. Then, the ten thousand spirits and ten thousand *qi* of the entire body gather in the heart. After a brief moment of refinement, the spirit becomes clear, the *qi* becomes harmonious, the heart expands, the body flourishes, the numinous embraces emptiness, and the ten thousand apertures radiate light—this is the illumination of the limitless worlds.\n\nThis corresponds to the *Scripture of Salvation*, which states: \"The lofty sages, the perfected of wondrous conduct, and innumerable multitudes floated through the void, entering the pearl together. Once within its mouth, their whereabouts were unknown. The ritual complete, the heavens resumed their positions. In an instant, all was silent, without a trace.\"\n\n**Eulogy:**\nA single millet grain contains Heaven and Earth,\nAll the perfected gather in the sacred body.\nWisdom’s light arises in the indistinct,\nIlluminating the void across all realms.\n\n---\n\nHe beheld the limitless sentient beings, suffering limitless afflictions, tossed and turned in the world, revolving through birth and death, adrift in the River of Love, swept by the Sea of Desire, sunk in the mire of sound and form, deluded by existence and non-existence.\n\nThe term \"observation\" here signifies profound insight. \"Limitless\" expresses the boundless multitude of beings in Heaven and Earth, their lives endless in succession. \"Sentient beings\" refers to the foolish and greedy among humankind, as well as all creatures possessing spirit and consciousness. In the passage that follows, the Heavenly Worthy, abiding in the stillness of the ultimate, gazes with the eye of wisdom into the great expanse, beholding within the kalpa’s defilement a class of greedy, vulgar, and benighted souls who fear neither Heaven’s decree nor the value of their own lives. Though they wear the form of humans, their hearts are like those of beasts. Alas, such beings know not human ethics, nor do they respect the laws of the land. Their minds are enslaved by their forms, chasing profit and delusion, forsaking life in ceaseless greed, never satisfied. They commit manifold transgressions, accumulating boundless karmic offenses. Once they bring calamity upon themselves, Heaven’s retribution falls upon them: in minor cases, they harm only themselves; in grave ones, their kin suffer as well. Thus they endure limitless afflictions, revolving through the world, trapped in the cycle of birth and death within the Six Paths, with no hope of escape. Adrift in the River of Love, tossed in the Sea of Desire, they sink and drown without respite.\n\nThe Heavenly Worthy, moved by the suffering of sentient beings, finds it deeply lamentable. For this reason, He reveals these truths to awaken the world, urging them to turn back early. Yet they fail to understand that those who commit evil will inevitably face retribution, like a shadow following form. Without reflection, they persist in indulging their desires, ensnared by sound and form—what their ears hear, what their eyes see—endlessly chasing externals. Their vital essence dissipates, transforming into other species without recovery, yet they remain unaware, deluded by existence and non-existence, never changing.\n\n**Eulogy:**\nThe hearts of sentient beings are self-deluded,\nCreating karma, they sink in the wheel’s depths.\nEnsnared by sound and form, love’s attachments,\nHow are they different from beasts and birds?\n\nNeither void nor non-void, neither form nor formless,\nNeither nothingness nor non-nothingness—\nFrom beginning to end, they remain in darkness,\nUnable to awaken, forever lost in confusion.\n\nThis passage continues the above, explaining that sentient beings, deluded by existence and non-existence, fail to awaken. Thus, it speaks of the origin of the great Dao: fundamentally formless, without emotion, without name. Through the transformation of qi, the One divides into Two, giving rise to form, emotion, and name. The reason sentient beings cannot attain the true Dao is that they cling to illusory forms as real, obscuring their original nature. The Dao is not inherently void, yet they grasp it as void. The Dao is not inherently form, yet they grasp it as form. The Dao is not inherently shape, yet they grasp it as shape. The Dao’s emptiness is truly real, yet they grasp it as nothingness, taking this as existence. Their deluded minds do not trust the true Dao, unaware of its coming or going. Thus, from beginning to end, they remain in darkness, unable to awaken, forever lost in confusion. For this, they commit evil and transgress, suffering defilement and disgrace, enduring endless retribution, forever losing the true Dao.\n\n**Eulogy:**\nThe great Dao is originally without form,\nTrue emptiness is not mere nothingness.\nIf one penetrates this truth,\nThe ancient family’s wind is revealed.\n\nThe Heavenly Worthy declares: You sentient beings exist within non-existence, and are non-existent within existence; you possess form within formlessness, and are formless within form. You take non-existence as existence, non-nothingness as nothingness, non-form as form, and non-emptiness as emptiness. Emptiness is emptiness, yet emptiness has no fixed emptiness; form is form, yet form has no fixed form. Form is emptiness, emptiness is form. Emptiness is the Dao’s formless body; form is all things possessing shape.\n\nIn the passage that follows, the Heavenly Worthy, moved by the world’s failure to awaken to the true Dao, repeatedly admonishes and instructs, describing the Dao’s essence and function, teaching people to perceive the Dao’s ultimate formless body. Because the non-void gives rise to form, form establishes the Dao. Form is the dwelling of the Dao, and the Dao is the function of form. Thus, where there is form, there must be spirit, and there must be the Dao. The human primordial spirit is inherently numinous and empty, yet constrained by form, it becomes obstructed and loses its clarity. It is like the sun in the sky: a thousand rivers share its reflection. When the water is clear, the moon is bright; when the water is turbid, the moon is dim. The moon does not leave the water, nor the water the moon; form does not leave spirit, nor spirit form. Form may decay, but spirit is neither born nor destroyed. Human life is but a temporary borrowing of this illusory form to accomplish the Dao. Why, then, are sentient beings so foolish? They cling to this illusory form, allowing it to control them, abandoning their root to chase the branches, never awakening to the principles of nature and destiny.\n\nThe Heavenly Worthy therefore says: You sentient beings, listen carefully to My words. \"Existing within non-existence\" means that form is not eternally real—do not mistake form for true existence. \"Non-existent within non-nothingness\" means that the human spirit is empty and numinous, enduring through past and present, neither born nor destroyed—do not mistake spirit for nothingness. \"Possessing form within formlessness\" means that the great Dao is pure and empty, originally without form—do not become infatuated with form. \"Formless within form\" means that the human spirit contains wondrousness, governing all affairs, originally without emptiness—do not stubbornly cling to emptiness. \"Taking non-existence as existence\" means that when a person is first born as an infant, they are originally simple and unadorned, not truly possessing anything—today, do not greedily pursue wealth and profit as your own. \"Taking non-nothingness as nothingness\" means that in the birth of all beings, each body and aperture, each thing and every Taiji, the wondrous principles of creation are all present within the human body—do not abandon your own existence to become nothing. \"Taking non-form as form\" means that the great Dao is empty and tranquil, pervading all things. Heaven, Earth, and the gods and spirits exist everywhere, yet originally there is no visible form—do not stubbornly take non-form as form.\n\n\"Taking non-emptiness as emptiness\" means that one who has attained the Dao transforms freely and exists eternally across kalpas, originally not empty but truly existent—do not stubbornly cling to it as nothingness and mock it as emptiness.\n\n\"Emptiness is emptiness, yet emptiness has no fixed emptiness\" means that the great Dao is formless and its transformations unfathomable, giving birth to heaven, earth, and all beings—how could there be a fixed principle of emptiness? Just as the blue sky and bright sun may suddenly transform into wind, clouds, thunder, and rain, instantly pervading the great thousandfold world, so too when a person’s nature is tranquil, it is like the vast emptiness; yet when joy or anger arises, the divine mechanism is unpredictable—is this not emptiness without fixed emptiness?\n\n\"Form is form, yet form has no fixed form\" means that when people see form with their eyes, the eyes themselves are form; if one can awaken to this, perceiving form through form, turning the light inward to reflect, and thoroughly illuminating the emptiness of the heart, then all form vanishes. Moreover, between heaven and earth, yin and yang transform and give birth to the myriad things, taking shape according to qi and changing color according to form. The sentient may become insentient—chaste women turning into stone mountains, earthworms into lilies; the insentient may become sentient—cinnabar maples into feathered beings, rotting grass into fireflies. All things transform in endless cycles of rebirth—is this not form without fixed form?\n\nThus, form is emptiness, and emptiness is form. Have you not heard the *Vajracchedikā Prajñāpāramitā Sūtra* say: \"There is no self, no person, no sentient being, no lifespan. All appearances are illusory. If all appearances are not appearances, then one sees the Tathāgata.\" These words are perfect.\n\nLet the learner savor this—perhaps they may approach understanding!\n\nA verse says:\nThe Dao’s wonder is not empty dharma,\nYet people are deluded by illusory form and heart.\nLet go of both existence and non-existence,\nAnd the land will all become level and still.\n\nHark!\nDo you comprehend?\n\nWhere the path ends at water’s end and mountain’s edge,\nbirds sing and flowers laugh—spring remains the same.\nIf one can know emptiness as not-empty,\nknow form as not-form,\nthis is called \"illumination,\"\nand one first attains the wondrous sound.\n\nRecognizing the non-empty Dharma of emptiness,\none gazes through without obstruction.\nEntering the gate of all wonders,\none naturally awakens to understanding.\nFree from the net of doubts,\none does not cling to the view of emptiness.\n\nThis passage continues the above,\ntransforming sentient beings.\nThose who can awaken to this\ndo not fall into dull emptiness\nnor cling to perverse views.\nThey abide in the single mind,\nserene and ever still,\nlucidly perceiving true emptiness—\nnothing unknown,\nnothing not penetrated.\nThe Dao is within me, not in another.\n\nIf one’s awakening reaches this stage,\none truly believes in knowing emptiness as not-empty,\nknowing form as not-form.\nThus, it is called \"illumination,\"\nand one first attains the wondrous sound.\nRecognizing the non-empty Dharma of emptiness,\none gazes through with freedom.\nThis mind connects with all minds,\nand nothing fails to fulfill its nature.\nIt pierces mountains and penetrates stone,\nwithout hindrance.\nWithin, one’s wisdom-nature generates light,\nilluminating boundlessly.\n\nThus, entering the gate of all wonders,\none naturally awakens to understanding.\nEverywhere is the Dao,\nand all things share the same truth.\nAll nets of doubt are overturned,\nrevealing one’s original nature,\nwithout clinging to the view of emptiness.\n\nA verse says:\nEmptiness is not truly empty,\nform is not truly form.\nDirectly awakening to the mystery,\none knows the white yet guards the black.\n\nPurify the six senses,\ncut off perverse obstructions.\n\"Purify\" means emptying the heart and filling the belly.\nThe \"six senses\" are the eyes, ears, nose, tongue, body, and mind.\n\"Cut off\" means to sever;\n\"remove\" means to eliminate.\n\"Perverse obstructions\" are all worldly toils, sensory desires, and defilements.\n\nThis continues the meaning of not clinging to the view of emptiness,\nteaching one to purify the six senses\nand sever perverse obstructions.\nNeither emitting within nor receiving without,\none naturally becomes spiritually clear and qi-serene,\nthe six senses at peace,\nperverse obstructions severed.\n\nA verse says:\nThoroughly penetrating the single mind,\none connects heaven and earth.\nYang flourishes while yin dissipates,\nand demonic forces retreat.\n\nNow I shall expound this wondrous scripture for you,\nentitled *The Scripture of Life Protection*,\nto deliver and ferry sentient beings,\nto propagate and transmit its teachings in the world,\nand to circulate its recitation.\n\"I\" refers to the Heavenly Worthy’s self-designation.\n\"You\" refers to those who awaken to the Dao.\n\"Expound\" means to enlighten.\n\"Wondrous\" means profound.\n\"Scripture\" is the heart—like a path,\na road shared by all.\n\"Deliver\" means to guide and lead;\n\"ferry\" means to cross to the other shore.\n\nIn this passage, the Heavenly Worthy declares:\nIf one can awaken to the Dao with clarity,\nunbound by form or fettered by perverse obstructions,\npenetrating the mechanism of transcendence\nand reaching this stage,\nonly then may I speak to you of the great Dao’s essence\nand the wonders of scripture transmission.\nThose who recite this scripture\nmay commune with spirits.\nThose who awaken to it\nmay nurture life.\nThose who attain it\nmay prolong their years.\nThus, it is called *The Scripture of Life Protection*.\nTo deliver and ferry sentient beings,\nto propagate its teachings in the world,\nand to have all circulate and recite it—\nmay each swiftly awaken to perfection,\nfulfilling the Heavenly Worthy’s intent.\n\nA verse says:\nEach body shares the Dao,\nevery heart is the scripture.\nConcentrating essence and consolidating spirit and qi,\none protects life and preserves longevity.\n\nThen there are the Flying Heavenly Divine Kings,\nthe Demolishing-Delusion Vajras,\nthe Dharma-Protecting Spirit Youths,\nthe Salvation-from-Suffering Perfected Ones,\nand the Golden Essence Fierce Beasts—\neach accompanied by hundreds of millions of attendants,\nall guarding this scripture.\n\nIn worldly terms,\nthose who cultivate the Dao and uphold this scripture\nshould, in accordance with its teachings,\nhave such spirit youths and fierce beasts\nattend and protect their bodies.\nIn terms of Daoist practice,\nthe Flying Heavenly Divine Kings\nrepresent the turning of the numinous treasure and the ascent of the mysterious.\nThe Demolishing-Delusion Vajras\nrepresent martial refinement.\nThe Dharma-Protecting Spirit Youths\nrepresent literary refinement.\nThe Salvation-from-Suffering Perfected Ones\nrepresent demon-quelling\nand the restoration of the celestial heart.\nThe Golden Essence Fierce Beasts\nare the five-colored lions.\n\nIn summary,\nwhen practicing the numinous treasure,\none should turn *The Scripture of Life Protection*.\nWhen my yellow intent enters the Eastern Sea,\nwhipping the submerged dragon to drive the fire chariot,\nascending to the palace of the Mysterious Valley—\nthis is called the Flying Heavenly Divine Kings.\nReversing the flow of the Yellow River’s waters,\nmaking them the cleansing rains of Kunlun to dispel miasmas—\nthis is called the Demolishing-Delusion Vajras.\nRiding the White Tiger from the Western Mountains to return home—\nthis is called the Dharma-Protecting Spirit Youths.\nVanquishing powerful demons\nand restoring the original spirit to its place—\nthis is called the Salvation-from-Suffering Perfected Ones.\nSitting upon the empty mystery of the five-colored lions,\nsolemn and majestic in demeanor—\nthis is called the Golden Essence Fierce Beasts.\nWith the myriad spirits and qi of the entire body\ngathered into the single heart—\nthis is called the hundreds of millions of attendants\nall guarding this scripture.\n\nThose who awaken to this mystery\ninternally cultivate unceasing, subtle practice,\nwhile externally, the ten heavenly good spirits\nconstantly protect them.\nThis scripture’s profundity\nholds inconceivable merit and virtue.\n\nA verse says:\nA single point, no more,\nis the foundation for transcending the ordinary and entering sagehood.\nThe Dao is high, and demons naturally submit;\nthe numinous and wondrous manifest majesty.\n\nWherever one makes offerings,\none wards off calamity and supports the frail,\nferrying all sentient beings\nand freeing them from defilements.\nThis means that those who recite this scripture with the Dao\nare accompanied by divine protection wherever they go.\nExternally, they subdue hordes of demons;\ninternally, they connect with the true and manifest sagehood.\nAll sentient beings\nreceive the shade of the Dao.\nThe sentient and insentient alike\nall cross to the other shore.\nThus, they ward off calamity and support the frail,\nferrying all sentient beings\nand freeing them from defilements.\n\nA verse says:\nThe Dao’s wonder is boundless,\nits divine transformations unfathomable.\nIt delivers sentient beings,\nwarding off calamity and supporting the frail.\n\nAt that time, the Heavenly Worthy spoke this verse:\n\"Seen yet not seen,\nheard yet not heard,\nfree from all extremes—\nthis is called the wondrous Dao.\"\n\nNow that the Heavenly Worthy has finished expounding the scripture,\nnot daring to praise himself,\nhe respectfully refers to \"that time\" and speaks this verse,\ndepicting the wonder of the great Dao\nand summarizing the profundity of this scripture.\n\nThese four lines of verse are the crucial point for learners.\nWhat Laozi called \"seen yet not seen is called the Even, heard yet not heard is called the Rare, grasped yet not obtained is called the Subtle.\"\nThus, the Dao abides in Heaven and Earth, yet Heaven and Earth do not know it; the Dao abides in the myriad things, yet the myriad things do not know it.\nIt cannot be clarified by settling, nor muddied by stirring.\nWithin movement, it does not move; within stillness, it is not still.\nIts wondrous essence is utterly empty, its numinous response pervades the ten thousand beings—it cannot be captured in form or description.\nOne may depart from form and abandon cleverness, applying it thus:\nWithin not-seeing, one intimately sees; within seeing, one does not see.\nWithin not-hearing, one intimately hears; within hearing, one does not hear.\nSilently comprehending, the mind connects; spirit apprehends, meaning is grasped.\nAt this juncture, one naturally departs from all manifold appearances—only then is it called the wondrous Dao.\nHow could this not be the rarest attainment for learners?\n\nA verse says:\nThe great image has no form,\nthe great sound is soundless.\nThe void shatters to dust,\nthe spirit ascends to the Great Clarity.\n\nThe *Supreme Ascension to the Mysterious: Annotated Wondrous Scripture for Eliminating Disasters and Protecting Life* concludes. #1 (Note: A \"thousand\" may be missing after \"great.\")",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上升玄说消灾护命妙经注 修江混然子注 经名：太上升玄说消灾护命妙经注。 元道士混然子王玠（字道渊）撰。 一卷。 底本出处：《正统道藏》洞真部玉诀类。 太上升玄说消灾护命妙经注 太者，无也。 上者，极也。 升，高也。 玄，妙也。 说，开化也。 消，灭也。 灾，害也。 护，保也。 命，身也。 妙，玄之又玄也。 经，心也，径也，人人共行之径路也。 天尊言：无极大道，化生天地。 万物之多，无物不有其妙，唯人得其秀而最灵。 然虽灵也，人生风土不同，禀受则有殊异，是有贤愚不等。 故天尊以慈悯力，开方便门，普化世人，明本来之真性，全见有之身命。 以心炼念，以情归性，然默运天机，流精化气，会於乾宫，充周四体，乃谓之升玄。 运符火以炼神，咽金液以炼形，形强神清，诸邪不入，百病不生，长生久视，超尘出劫，乃谓之消灾护命。 若有能受持此道，运行一身，与圣仙并驾，与天地同躯，是为妙经也。 《道德经》谓：善人，不善人之师，不善人，善人之资，故无弃人。 所以众生虽是有食爱之心，其中皆有善智之性。 天尊说此经，开化妙理，以喻后之来者。 流通读诵，究竟大道之由，悟之者，愚可以智，浊可以清，超凡入圣，自然消灾、灭罪、保命，乃得延年，岂不是妙经也哉。 颂曰：无极玄元始，巍巍灵宝尊，升玄弘教化，显道说经文。 尔时元始天尊在七宝林中五明宫内， 尔时者，昔混沌之时也。 元始者，祖气也。 天尊者，一灵至贵，天上地下，唯此独尊也。 七宝林者，心也，神也。 五明官者，黄庭也。 以世法释，当龙汉之初，八角垂芒，一点祖劫之气，化正气万道，浮满空中，结成圣体，一神含妙万有，乃强名曰元始天尊也。 当说之时，在始青天七宝林中五明宫内也。 以道用言，人人之生，皆有元始天尊。 此言一点真阳之气，居於生门密户，中间空悬一窍，乃曰天心，性亦寓焉，为万神朝会之祖，是谓元始天尊者也。 凡遇一阳初动，当转经之时，则神下坠玄关，鼓巽风吹发离宫三昧之火，追二气於黄道，会三性於元宫，混融成丹。 所以炼性，如金之坚，全藉火力以锻炼。 火以七言，土以五言，是以在七宝林中五明宫内者也。 此即《度人经》所谓：元始悬一宝珠，大如黍米，在空玄之中，去地五丈，登引天真之道也。 颂曰：元始先天地，无为浩劫宗，一心抱众体，真下玩真空。 与无极圣众俱，放无极光明，照无极世界。 此承上言，一神正位，万神朝宗。 以世法言，当天尊说经之时，则诸天诸地、三界十方、无极圣众，一时同会於七宝林中五明宫内，咸听说经之妙，是时放无极光明，照无极世界也。 以道用言，凡作丹之时，以天罡之斡运，逆回斗柄之机，则通身万神万气同会於心，熏蒸片饷，即得神清气爽，心广体胖，灵含空妙，万窍光明，是照无极世界也。 此即与《度人经》所言：上圣高尊、妙行真人、无鞅数众，浮空而来，俱入宝珠之内。 既入珠口，不知所在。 法事粗悉，诸天复位。 倏欻之间，寂无遗响是也。 颂曰：一黍藏天地，诸真集圣躯，慧光生恍惚，遍界照虚无。 观无极众生，受无极苦恼，宛转世间，轮回生死，漂浪爱河，流吹欲海，沉滞声色，迷惑有无。",
      "translated_text": "**The Supreme Venerable’s Ascending Mystery Scripture on Dispelling Calamities and Protecting Life, with Commentary by Master Xiūjiāng Hùnrán**\n\n**Scripture Title:** *The Supreme Venerable’s Ascending Mystery Scripture on Dispelling Calamities and Protecting Life, with Commentary*\n**Author:** Daoist Hùnránzǐ Wáng Jiè (courtesy name Dàoyuān)\n**Volume:** One\n**Source Text:** *Zhengtong Daoist Canon*, *Dongzhen* Section, *Jade Instructions* Category\n\n---\n\n**Commentary on the Title:**\n*Tài* (太) means \"ultimate\" or \"without limit.\"\n*Shàng* (上) means \"supreme.\"\n*Shēng* (升) means \"to ascend.\"\n*Xuán* (玄) means \"mysterious\" or \"profound.\"\n*Shuō* (说) means \"to expound\" or \"to enlighten.\"\n*Xiāo* (消) means \"to dispel.\"\n*Zāi* (灾) means \"calamity\" or \"harm.\"\n*Hù* (护) means \"to protect.\"\n*Mìng* (命) means \"life\" or \"destiny.\"\n*Miào* (妙) means \"wondrous,\" the mystery within the mystery.\n*Jīng* (经) means \"scripture,\" the \"heart\" and the \"path,\" the shared way all people traverse.\n\nThe Heavenly Worthy declares: The Limitless Dao gives birth to Heaven and Earth. Among the myriad things, none lacks its mystery, yet only humans possess the finest essence and the most refined spirit. Though refined, people are born in different lands and receive varying endowments, resulting in disparities of wisdom and folly. Thus, the Heavenly Worthy, moved by boundless compassion, opens the gate of expedient means to universally transform the world, illuminating the original true nature and preserving the life of the embodied self.\n\nRefine thoughts with the heart, return emotions to nature, silently activate the celestial mechanism, transform essence into *qi*, and gather it in the Palace of *Qian*, suffusing the four limbs—this is called *Ascending Mystery*. Circulate the talismanic fire to refine the spirit, swallow the golden elixir to refine the body. When the body is strong and the spirit clear, no evil can enter, no illness can arise. One attains longevity, transcends the dust, and escapes the kalpas—this is called *Dispelling Calamities and Protecting Life*.\n\nThose who can receive and uphold this Dao, circulating it throughout the body, will ride alongside the sages and immortals, sharing the same form as Heaven and Earth—this is the *Wondrous Scripture*.\n\nThe *Daode Jing* states: \"The good person is the teacher of the ungood; the ungood person is the resource of the good.\" Thus, none are to be discarded. Though sentient beings are bound by desires and attachments, within them all lies the nature of wisdom and goodness. The Heavenly Worthy expounds this scripture, revealing its profound principles to enlighten those who come after. By circulating, reciting, and delving into its teachings, one may grasp the origin of the Great Dao. Those who awaken may transform folly into wisdom, turbidity into clarity, transcend the mundane, and enter sagehood. Naturally, calamities are dispelled, sins are eradicated, life is preserved, and years are prolonged—is this not the *Wondrous Scripture*?\n\n**Eulogy:**\nThe Limitless, the Mysterious Origin,\nMajestic and sacred, the Treasure of the Numinous.\nAscending Mystery spreads the teachings,\nRevealing the Dao through scriptural discourse.\n\n---\n\n**At that time**, the Primordial Heavenly Worthy was in the Fivefold Luminous Palace within the Seven Jeweled Grove.\n\n*At that time* refers to the era of primordial chaos.\n*Primordial* (元始) signifies the ancestral *qi*.\n*The Heavenly Worthy* is the singular, most revered spirit, unmatched above Heaven or below Earth.\n*The Seven Jeweled Grove* represents the heart and the spirit.\n*The Fivefold Luminous Palace* is the Yellow Court.\n\nIn worldly terms, this corresponds to the beginning of the Dragon Han kalpa, when eight rays descended, and a single point of ancestral *qi* from the primordial kalpa transformed into ten thousand paths of upright *qi*, filling the void and coalescing into a sacred body. A singular spirit embraced the mystery of the myriad existences—hence the provisional name *Primordial Heavenly Worthy*. At the time of this discourse, he resided in the Fivefold Luminous Palace within the Seven Jeweled Grove of the Azure Heaven.\n\nIn Daoist practice, every person possesses the Primordial Heavenly Worthy. This refers to a single point of true yang *qi*, dwelling in the secret chamber of the Gate of Life. Within it hangs an empty aperture, called the Heavenly Heart, where nature also resides. It is the ancestral gathering place of the ten thousand spirits—this is the Primordial Heavenly Worthy.\n\nWhenever the first yang stirs, at the time of scripture recitation, the spirit descends to the Mysterious Pass. The *Xun* wind stirs the fire of the *Li* Palace’s samadhi, chasing the two *qi* along the Yellow Path, uniting the three natures in the Primordial Palace, and blending them into the elixir. Thus, nature is refined, as firm as metal, wholly dependent on the power of fire. Fire is governed by seven, earth by five—hence the reference to the Seven Jeweled Grove and the Fivefold Luminous Palace.\n\nThis aligns with the *Scripture of Salvation*, which states: \"The Primordial One suspends a single pearl, as large as a millet grain, in the void of the Mysterious. Five feet above the earth, it guides the way of the Heavenly Perfected.\"\n\n**Eulogy:**\nThe Primordial precedes Heaven and Earth,\nThe Effortless, the Ancestor of Kalpas.\nOne heart embraces all bodies,\nThe true descends to contemplate true emptiness.\n\n---\n\nTogether with the Limitless Assembly of Sages, he radiated boundless light, illuminating the limitless worlds.\n\nThis continues the above: when the singular spirit is rightly established, the ten thousand spirits pay homage. In worldly terms, when the Heavenly Worthy expounded the scripture, all the heavens, all the earths, the three realms, the ten directions, and the limitless assembly of sages gathered in the Seven Jeweled Grove and the Fivefold Luminous Palace, listening to the wondrous discourse. At that moment, boundless light radiated, illuminating the limitless worlds.\n\nIn Daoist practice, when refining the elixir, the turning of the Celestial Pivot reverses the mechanism of the Dipper’s handle. Then, the ten thousand spirits and ten thousand *qi* of the entire body gather in the heart. After a brief moment of refinement, the spirit becomes clear, the *qi* becomes harmonious, the heart expands, the body flourishes, the numinous embraces emptiness, and the ten thousand apertures radiate light—this is the illumination of the limitless worlds.\n\nThis corresponds to the *Scripture of Salvation*, which states: \"The lofty sages, the perfected of wondrous conduct, and innumerable multitudes floated through the void, entering the pearl together. Once within its mouth, their whereabouts were unknown. The ritual complete, the heavens resumed their positions. In an instant, all was silent, without a trace.\"\n\n**Eulogy:**\nA single millet grain contains Heaven and Earth,\nAll the perfected gather in the sacred body.\nWisdom’s light arises in the indistinct,\nIlluminating the void across all realms.\n\n---\n\nHe beheld the limitless sentient beings, suffering limitless afflictions, tossed and turned in the world, revolving through birth and death, adrift in the River of Love, swept by the Sea of Desire, sunk in the mire of sound and form, deluded by existence and non-existence.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1236,
      "start_sentence": 0,
      "end_sentence": 54,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.69213891029358,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\太上升玄说消灾护命妙经注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "观者，洞观也。 无极者，言天下人物之多，生生不尽之意也。 众生者，下愚贪爱之人也，及其一切含灵之物，皆是众生。 此一节以下，天尊居静极之中，以智慧目，洞观大#1 之内，劫浊之间，有等贪夫俗子下愚之人，不畏天命，不惜生身，纷纷贪爱，形虽人身，心如禽兽也。 奈何此等众生，不识人伦，不惧国法，心为形役，逐利迷情，舍死贪求，了无厌足，造成种种之愆，作下无遮罪业。 一旦自招殃咎，天灾罪己，小则自陷一身，大则祸连骨肉，是以受无极苦恼，宛转世间，轮回生死於六道之中，永无出期。 漂浪於爱河，流浪於欲海之地，汨没沉沦，无有休息。 天尊怜悯众生之苦，深可痛哉，故以此等由，开化世人，早悟回头。 殊不知造恶者必有恶报，如影随形，竟不寻思，至此唯务纵念所为，况滞於声色，耳中听，眼中见，纷纭驰逐於外，自身精神耗散，化为异类而不复，犹自不醒，迷惑有无而终不改也。 颂曰：众生心自昧，造业受轮沉，爱滞於声色，何如兽与禽。 无空有空，无色有色，无无有无，有有无有，终始暗昧，不能自明，毕竟迷惑。 此一节承上言，众生迷惑有无，不自醒悟，於此故言大道之始，本无形、无情、无名，因气化生物，一分为二，遂有形、有情、有名。 众生所以不得真道者，执着幻形为有，昧了本来之性。 道本不空，执着为空。 道本无色，执着有色。 道本无形，执着有形。 道虚真有，执着无有，以此为有。 妄心不信真道，不知其来，不知其去，是以终始暗昧，不能自明，毕竟迷惑，故造恶作非，遭於浊辱，受报无休，永失真道也。 颂曰：大道本无色，真空非是空。 若人明得透，显出旧家风。 天尊告曰：尔等众生，从不有中有，不无中无，不色中色，不空中空。 非有为有，非无为无，非色为色，非空为空。 空即是空，空无定空； 色即是色，色无定色。 即色是空，即空是色。 空者，道虚无体也。 色者，一切有形之物也。 此一节以下，天尊慈悯世人不悟真道，於此丁宁反覆告戒，形容道之体用，教人如此悟见大道至虚无体，因不虚立，故生形以立道。 形为道之室，道为形之用，是以有其形必有其神，必有其道。 人之元神本是虚灵，因形所梏，障碍不灵。 譬如空中有日，千江同色，水清月明，水浊月昏。 月不离水，水不离月，形不离神，神不离形。 形有败坏，神无生灭。 人生不过假此幻形以成於道。 何故众生如此之愚，执此幻形，被他所使，弃其本，逐其末，终不悟性命之理。 天尊故言：尔等众生，可以谛听吾说，从不有中有者，此言形非长有，不可认形为有。 不无中无，此言人性虚灵，亘古亘今，不生不灭，不可以性为无也。 不色中色者，此言大道清虚，本无其色，不贪迷其色也。 不空中空者，此言人神含妙，主宰万机，本无其空，不可固执为空也。 非有为有者，此言人初生为赤子之时，本来素俭非有，今日不可贪生厚利，为我之有也。 非无为无者，此言人物之生，一身一窍，一物一太极，造化妙理，无不在人一身，不可弃我之有而为无者也。 非色为色者，此言大道冲虚，无物不贯，天地神明，无处不存，本无形色之可睹，不可执其非色而为色者也。",
      "translated_text": "The term \"observation\" here signifies profound insight. \"Limitless\" expresses the boundless multitude of beings in Heaven and Earth, their lives endless in succession. \"Sentient beings\" refers to the foolish and greedy among humankind, as well as all creatures possessing spirit and consciousness. In the passage that follows, the Heavenly Worthy, abiding in the stillness of the ultimate, gazes with the eye of wisdom into the great expanse, beholding within the kalpa’s defilement a class of greedy, vulgar, and benighted souls who fear neither Heaven’s decree nor the value of their own lives. Though they wear the form of humans, their hearts are like those of beasts. Alas, such beings know not human ethics, nor do they respect the laws of the land. Their minds are enslaved by their forms, chasing profit and delusion, forsaking life in ceaseless greed, never satisfied. They commit manifold transgressions, accumulating boundless karmic offenses. Once they bring calamity upon themselves, Heaven’s retribution falls upon them: in minor cases, they harm only themselves; in grave ones, their kin suffer as well. Thus they endure limitless afflictions, revolving through the world, trapped in the cycle of birth and death within the Six Paths, with no hope of escape. Adrift in the River of Love, tossed in the Sea of Desire, they sink and drown without respite.\n\nThe Heavenly Worthy, moved by the suffering of sentient beings, finds it deeply lamentable. For this reason, He reveals these truths to awaken the world, urging them to turn back early. Yet they fail to understand that those who commit evil will inevitably face retribution, like a shadow following form. Without reflection, they persist in indulging their desires, ensnared by sound and form—what their ears hear, what their eyes see—endlessly chasing externals. Their vital essence dissipates, transforming into other species without recovery, yet they remain unaware, deluded by existence and non-existence, never changing.\n\n**Eulogy:**\nThe hearts of sentient beings are self-deluded,\nCreating karma, they sink in the wheel’s depths.\nEnsnared by sound and form, love’s attachments,\nHow are they different from beasts and birds?\n\nNeither void nor non-void, neither form nor formless,\nNeither nothingness nor non-nothingness—\nFrom beginning to end, they remain in darkness,\nUnable to awaken, forever lost in confusion.\n\nThis passage continues the above, explaining that sentient beings, deluded by existence and non-existence, fail to awaken. Thus, it speaks of the origin of the great Dao: fundamentally formless, without emotion, without name. Through the transformation of qi, the One divides into Two, giving rise to form, emotion, and name. The reason sentient beings cannot attain the true Dao is that they cling to illusory forms as real, obscuring their original nature. The Dao is not inherently void, yet they grasp it as void. The Dao is not inherently form, yet they grasp it as form. The Dao is not inherently shape, yet they grasp it as shape. The Dao’s emptiness is truly real, yet they grasp it as nothingness, taking this as existence. Their deluded minds do not trust the true Dao, unaware of its coming or going. Thus, from beginning to end, they remain in darkness, unable to awaken, forever lost in confusion. For this, they commit evil and transgress, suffering defilement and disgrace, enduring endless retribution, forever losing the true Dao.\n\n**Eulogy:**\nThe great Dao is originally without form,\nTrue emptiness is not mere nothingness.\nIf one penetrates this truth,\nThe ancient family’s wind is revealed.\n\nThe Heavenly Worthy declares: You sentient beings exist within non-existence, and are non-existent within existence; you possess form within formlessness, and are formless within form. You take non-existence as existence, non-nothingness as nothingness, non-form as form, and non-emptiness as emptiness. Emptiness is emptiness, yet emptiness has no fixed emptiness; form is form, yet form has no fixed form. Form is emptiness, emptiness is form. Emptiness is the Dao’s formless body; form is all things possessing shape.\n\nIn the passage that follows, the Heavenly Worthy, moved by the world’s failure to awaken to the true Dao, repeatedly admonishes and instructs, describing the Dao’s essence and function, teaching people to perceive the Dao’s ultimate formless body. Because the non-void gives rise to form, form establishes the Dao. Form is the dwelling of the Dao, and the Dao is the function of form. Thus, where there is form, there must be spirit, and there must be the Dao. The human primordial spirit is inherently numinous and empty, yet constrained by form, it becomes obstructed and loses its clarity. It is like the sun in the sky: a thousand rivers share its reflection. When the water is clear, the moon is bright; when the water is turbid, the moon is dim. The moon does not leave the water, nor the water the moon; form does not leave spirit, nor spirit form. Form may decay, but spirit is neither born nor destroyed. Human life is but a temporary borrowing of this illusory form to accomplish the Dao. Why, then, are sentient beings so foolish? They cling to this illusory form, allowing it to control them, abandoning their root to chase the branches, never awakening to the principles of nature and destiny.\n\nThe Heavenly Worthy therefore says: You sentient beings, listen carefully to My words. \"Existing within non-existence\" means that form is not eternally real—do not mistake form for true existence. \"Non-existent within non-nothingness\" means that the human spirit is empty and numinous, enduring through past and present, neither born nor destroyed—do not mistake spirit for nothingness. \"Possessing form within formlessness\" means that the great Dao is pure and empty, originally without form—do not become infatuated with form. \"Formless within form\" means that the human spirit contains wondrousness, governing all affairs, originally without emptiness—do not stubbornly cling to emptiness. \"Taking non-existence as existence\" means that when a person is first born as an infant, they are originally simple and unadorned, not truly possessing anything—today, do not greedily pursue wealth and profit as your own. \"Taking non-nothingness as nothingness\" means that in the birth of all beings, each body and aperture, each thing and every Taiji, the wondrous principles of creation are all present within the human body—do not abandon your own existence to become nothing. \"Taking non-form as form\" means that the great Dao is empty and tranquil, pervading all things. Heaven, Earth, and the gods and spirits exist everywhere, yet originally there is no visible form—do not stubbornly take non-form as form.",
      "overlap_context": "l was silent, without a trace.\"\n\n**Eulogy:**\nA single millet grain contains Heaven and Earth,\nAll the perfected gather in the sacred body.\nWisdom’s light arises in the indistinct,\nIlluminating the void across all realms.\n\n---\n\nHe beheld the limitless sentient beings, suffering limitless afflictions, tossed and turned in the world, revolving through birth and death, adrift in the River of Love, swept by the Sea of Desire, sunk in the mire of sound and form, deluded by existence and non-existence.",
      "start_char": 1237,
      "end_char": 2451,
      "start_sentence": 55,
      "end_sentence": 96,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.66606903076172,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\太上升玄说消灾护命妙经注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "非空为空者，此言成道之人，变化自在，劫劫长存，本来非空而实有，不可执着为虚无而笑之为空也。 空即是空，空无定空者，此言大道无形，变化莫测，生天生地生人物，岂有定空之理。 至如青天白日，一时风云雷雨变化，顷刻遍满大千世界是也。 如人性静之时，乃太空也，一时发其喜怒，神机不测，亦复如是。 岂不是空无定空者也？ 色即是色，色无定色者，人以眼观色，眼即色也，若能觉之，得色观色，回光返照，了彻心空，色皆无也。 且夫天地之间，阴阳化生万物，随气成质，随质变色。 有情而变无情，贞女化为石山，蚯化百合之类； 无情而变有情，丹枫化羽人，腐草化为萤之类。 万物皆化，轮回无期，岂不是色无定色者也？ 是以即色是空，即空是色。 岂不闻《金刚经》云：无我相、人相、众生相、寿者相。 凡有所相，即是虚妄。 若是诸相非相，即见如来。 斯言至矣。 学人於此玩味，其庶几乎！ 颂曰：道妙非空法，人迷幻色心，有无都放下，陆地尽平沉。 喝！ 会得么？",
      "translated_text": "\"Taking non-emptiness as emptiness\" means that one who has attained the Dao transforms freely and exists eternally across kalpas, originally not empty but truly existent—do not stubbornly cling to it as nothingness and mock it as emptiness.\n\n\"Emptiness is emptiness, yet emptiness has no fixed emptiness\" means that the great Dao is formless and its transformations unfathomable, giving birth to heaven, earth, and all beings—how could there be a fixed principle of emptiness? Just as the blue sky and bright sun may suddenly transform into wind, clouds, thunder, and rain, instantly pervading the great thousandfold world, so too when a person’s nature is tranquil, it is like the vast emptiness; yet when joy or anger arises, the divine mechanism is unpredictable—is this not emptiness without fixed emptiness?\n\n\"Form is form, yet form has no fixed form\" means that when people see form with their eyes, the eyes themselves are form; if one can awaken to this, perceiving form through form, turning the light inward to reflect, and thoroughly illuminating the emptiness of the heart, then all form vanishes. Moreover, between heaven and earth, yin and yang transform and give birth to the myriad things, taking shape according to qi and changing color according to form. The sentient may become insentient—chaste women turning into stone mountains, earthworms into lilies; the insentient may become sentient—cinnabar maples into feathered beings, rotting grass into fireflies. All things transform in endless cycles of rebirth—is this not form without fixed form?\n\nThus, form is emptiness, and emptiness is form. Have you not heard the *Vajracchedikā Prajñāpāramitā Sūtra* say: \"There is no self, no person, no sentient being, no lifespan. All appearances are illusory. If all appearances are not appearances, then one sees the Tathāgata.\" These words are perfect.\n\nLet the learner savor this—perhaps they may approach understanding!\n\nA verse says:\nThe Dao’s wonder is not empty dharma,\nYet people are deluded by illusory form and heart.\nLet go of both existence and non-existence,\nAnd the land will all become level and still.\n\nHark!\nDo you comprehend?",
      "overlap_context": "ur own. \"Taking non-nothingness as nothingness\" means that in the birth of all beings, each body and aperture, each thing and every Taiji, the wondrous principles of creation are all present within the human body—do not abandon your own existence to become nothing. \"Taking non-form as form\" means that the great Dao is empty and tranquil, pervading all things. Heaven, Earth, and the gods and spirits exist everywhere, yet originally there is no visible form—do not stubbornly take non-form as form.",
      "start_char": 2451,
      "end_char": 2842,
      "start_sentence": 97,
      "end_sentence": 115,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.056390047073364,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\太上升玄说消灾护命妙经注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "行到水穷山尽处，鸟啼花笑一般春。 若能知空不空，知色不色，名为照了，始达妙音。 识无空法，洞观无碍。 入众妙门，自然解悟。 离诸疑网，不着空见。 此一节承上文而言，为化众生。 其有能悟之者，不堕顽空，不着邪见，唯存一心，湛然常寂，了了真空，无所不知，无所不透，道在我而不在於彼。 若领悟至此地位，方信知空不空，知色不色，是以名为照了，始达妙音。 识无空法，洞观自在，此心通於他心，无物不尽其性。 穿山透石，无有隔碍，於我慧性生明，广照无际。 所以入众妙门，自然解悟，头头是道，物物同真。 一切疑网，尽行掀翻，独露本来，不着空见也。 颂曰：空空本不空，色色即非色。 直下悟玄机，知白守其黑。 清静六根，断除邪障。 清静者，虚心实腹也。 六根者，眼耳鼻舌身意也。 断，绝也。 除，去也。 邪障，一切尘劳色欲也。 此承上言不着空见之意，於此教人清静其六根，绝去其邪障，内不出，外不入，自然神清气静，六根安宁，邪障断除矣。 颂曰：了彻一心，通天彻地。 阳盛阴消，邪魔退位。 我即为尔说是妙经，名曰《护命》，济度众生，传教世间，流通读诵。 我者，天尊自称也。 尔者，言悟道之人也。 说，开化也。 妙，玄也。 经，心也，犹路也，人人共行之路也。 济者，接引之意也。 度者，超彼岸也。 此一节，天尊故言世人若能悟道明彻，不被形缚，不着邪障所缚，透得向上机关，至此田地，方才可与尔言说大道之宗，转经之妙。 这诵经之者，可以通神。 悟之者，可以养命。 得之者，可以长年。 是名曰《护命》。 济度众生，传教世间，使人人流通读诵，愿得个个早悟圆成，岂不称天尊之心哉。 颂曰：个个身同道，人人心是经，精凝神气固，护命保长生。 即有飞天神王、破邪金刚、护法灵童，救苦真人、金精猛兽，各百亿万众，俱侍卫是经。 此章以世法言，凡好道持谓是经之人，当依经说，有如是神童猛兽侍卫诵经者身。 以道用言，飞天神王者，意转灵宝升玄之道也。 破邪金刚者，武炼也。 护法灵童者，文烹也救苦真人者，退魔也，复其天心也。 金精猛兽者，五色狮子也。 总而言之，凡行灵宝之时，则当转护命之经。 命吾黄意入东海，鞭起潜龙驾火舆，上升玄谷之宫，乃曰飞天神王。 倒流黄河之水，作他昆仑荡氛之霖，乃曰破邪金刚。 从西山跨白虎以归家，乃曰护法灵童。 战退强魔，元神复位，乃曰救苦真人。 身坐空玄五色狮子之上，凛然肃正其威仪，乃曰金精猛兽。 通身万神万气悉归一心，乃曰各百亿万众俱侍卫是经也。 学人能悟此妙，内有默运绵绵如是之功，外则自有十天善神长拥护其人。 斯经玄妙，不可思议功德也哉。 颂曰：一点无多子，超凡入圣基，道高魔自伏，神妙显威仪。 随所供养，捍厄扶衰，度一切众生，离诸染着。 此言有道诵经之人，随身所至，自有一神明拥护供养，外则摄伏群魔，内则通真显圣。 一切含灵，皆沾道荫，有情无情，咸登彼岸。 所以捍其厄而扶其衰，度一切众生，离诸染着也。 颂曰：道妙无穷，神化莫测，救度众生，扶衰捍厄。 尔时天尊即说偈曰：视不见我，听不得闻，离种种边，名为妙道。 此天尊说经已毕，不敢自赞，故尊称尔时天尊，即说偈言，形容大道之妙，总结此经一篇之玄。",
      "translated_text": "Where the path ends at water’s end and mountain’s edge,\nbirds sing and flowers laugh—spring remains the same.\nIf one can know emptiness as not-empty,\nknow form as not-form,\nthis is called \"illumination,\"\nand one first attains the wondrous sound.\n\nRecognizing the non-empty Dharma of emptiness,\none gazes through without obstruction.\nEntering the gate of all wonders,\none naturally awakens to understanding.\nFree from the net of doubts,\none does not cling to the view of emptiness.\n\nThis passage continues the above,\ntransforming sentient beings.\nThose who can awaken to this\ndo not fall into dull emptiness\nnor cling to perverse views.\nThey abide in the single mind,\nserene and ever still,\nlucidly perceiving true emptiness—\nnothing unknown,\nnothing not penetrated.\nThe Dao is within me, not in another.\n\nIf one’s awakening reaches this stage,\none truly believes in knowing emptiness as not-empty,\nknowing form as not-form.\nThus, it is called \"illumination,\"\nand one first attains the wondrous sound.\nRecognizing the non-empty Dharma of emptiness,\none gazes through with freedom.\nThis mind connects with all minds,\nand nothing fails to fulfill its nature.\nIt pierces mountains and penetrates stone,\nwithout hindrance.\nWithin, one’s wisdom-nature generates light,\nilluminating boundlessly.\n\nThus, entering the gate of all wonders,\none naturally awakens to understanding.\nEverywhere is the Dao,\nand all things share the same truth.\nAll nets of doubt are overturned,\nrevealing one’s original nature,\nwithout clinging to the view of emptiness.\n\nA verse says:\nEmptiness is not truly empty,\nform is not truly form.\nDirectly awakening to the mystery,\none knows the white yet guards the black.\n\nPurify the six senses,\ncut off perverse obstructions.\n\"Purify\" means emptying the heart and filling the belly.\nThe \"six senses\" are the eyes, ears, nose, tongue, body, and mind.\n\"Cut off\" means to sever;\n\"remove\" means to eliminate.\n\"Perverse obstructions\" are all worldly toils, sensory desires, and defilements.\n\nThis continues the meaning of not clinging to the view of emptiness,\nteaching one to purify the six senses\nand sever perverse obstructions.\nNeither emitting within nor receiving without,\none naturally becomes spiritually clear and qi-serene,\nthe six senses at peace,\nperverse obstructions severed.\n\nA verse says:\nThoroughly penetrating the single mind,\none connects heaven and earth.\nYang flourishes while yin dissipates,\nand demonic forces retreat.\n\nNow I shall expound this wondrous scripture for you,\nentitled *The Scripture of Life Protection*,\nto deliver and ferry sentient beings,\nto propagate and transmit its teachings in the world,\nand to circulate its recitation.\n\"I\" refers to the Heavenly Worthy’s self-designation.\n\"You\" refers to those who awaken to the Dao.\n\"Expound\" means to enlighten.\n\"Wondrous\" means profound.\n\"Scripture\" is the heart—like a path,\na road shared by all.\n\"Deliver\" means to guide and lead;\n\"ferry\" means to cross to the other shore.\n\nIn this passage, the Heavenly Worthy declares:\nIf one can awaken to the Dao with clarity,\nunbound by form or fettered by perverse obstructions,\npenetrating the mechanism of transcendence\nand reaching this stage,\nonly then may I speak to you of the great Dao’s essence\nand the wonders of scripture transmission.\nThose who recite this scripture\nmay commune with spirits.\nThose who awaken to it\nmay nurture life.\nThose who attain it\nmay prolong their years.\nThus, it is called *The Scripture of Life Protection*.\nTo deliver and ferry sentient beings,\nto propagate its teachings in the world,\nand to have all circulate and recite it—\nmay each swiftly awaken to perfection,\nfulfilling the Heavenly Worthy’s intent.\n\nA verse says:\nEach body shares the Dao,\nevery heart is the scripture.\nConcentrating essence and consolidating spirit and qi,\none protects life and preserves longevity.\n\nThen there are the Flying Heavenly Divine Kings,\nthe Demolishing-Delusion Vajras,\nthe Dharma-Protecting Spirit Youths,\nthe Salvation-from-Suffering Perfected Ones,\nand the Golden Essence Fierce Beasts—\neach accompanied by hundreds of millions of attendants,\nall guarding this scripture.\n\nIn worldly terms,\nthose who cultivate the Dao and uphold this scripture\nshould, in accordance with its teachings,\nhave such spirit youths and fierce beasts\nattend and protect their bodies.\nIn terms of Daoist practice,\nthe Flying Heavenly Divine Kings\nrepresent the turning of the numinous treasure and the ascent of the mysterious.\nThe Demolishing-Delusion Vajras\nrepresent martial refinement.\nThe Dharma-Protecting Spirit Youths\nrepresent literary refinement.\nThe Salvation-from-Suffering Perfected Ones\nrepresent demon-quelling\nand the restoration of the celestial heart.\nThe Golden Essence Fierce Beasts\nare the five-colored lions.\n\nIn summary,\nwhen practicing the numinous treasure,\none should turn *The Scripture of Life Protection*.\nWhen my yellow intent enters the Eastern Sea,\nwhipping the submerged dragon to drive the fire chariot,\nascending to the palace of the Mysterious Valley—\nthis is called the Flying Heavenly Divine Kings.\nReversing the flow of the Yellow River’s waters,\nmaking them the cleansing rains of Kunlun to dispel miasmas—\nthis is called the Demolishing-Delusion Vajras.\nRiding the White Tiger from the Western Mountains to return home—\nthis is called the Dharma-Protecting Spirit Youths.\nVanquishing powerful demons\nand restoring the original spirit to its place—\nthis is called the Salvation-from-Suffering Perfected Ones.\nSitting upon the empty mystery of the five-colored lions,\nsolemn and majestic in demeanor—\nthis is called the Golden Essence Fierce Beasts.\nWith the myriad spirits and qi of the entire body\ngathered into the single heart—\nthis is called the hundreds of millions of attendants\nall guarding this scripture.\n\nThose who awaken to this mystery\ninternally cultivate unceasing, subtle practice,\nwhile externally, the ten heavenly good spirits\nconstantly protect them.\nThis scripture’s profundity\nholds inconceivable merit and virtue.\n\nA verse says:\nA single point, no more,\nis the foundation for transcending the ordinary and entering sagehood.\nThe Dao is high, and demons naturally submit;\nthe numinous and wondrous manifest majesty.\n\nWherever one makes offerings,\none wards off calamity and supports the frail,\nferrying all sentient beings\nand freeing them from defilements.\nThis means that those who recite this scripture with the Dao\nare accompanied by divine protection wherever they go.\nExternally, they subdue hordes of demons;\ninternally, they connect with the true and manifest sagehood.\nAll sentient beings\nreceive the shade of the Dao.\nThe sentient and insentient alike\nall cross to the other shore.\nThus, they ward off calamity and support the frail,\nferrying all sentient beings\nand freeing them from defilements.\n\nA verse says:\nThe Dao’s wonder is boundless,\nits divine transformations unfathomable.\nIt delivers sentient beings,\nwarding off calamity and supporting the frail.\n\nAt that time, the Heavenly Worthy spoke this verse:\n\"Seen yet not seen,\nheard yet not heard,\nfree from all extremes—\nthis is called the wondrous Dao.\"\n\nNow that the Heavenly Worthy has finished expounding the scripture,\nnot daring to praise himself,\nhe respectfully refers to \"that time\" and speaks this verse,\ndepicting the wonder of the great Dao\nand summarizing the profundity of this scripture.",
      "overlap_context": "ajñāpāramitā Sūtra* say: \"There is no self, no person, no sentient being, no lifespan. All appearances are illusory. If all appearances are not appearances, then one sees the Tathāgata.\" These words are perfect.\n\nLet the learner savor this—perhaps they may approach understanding!\n\nA verse says:\nThe Dao’s wonder is not empty dharma,\nYet people are deluded by illusory form and heart.\nLet go of both existence and non-existence,\nAnd the land will all become level and still.\n\nHark!\nDo you comprehend?",
      "start_char": 2842,
      "end_char": 4110,
      "start_sentence": 116,
      "end_sentence": 176,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.7740204334259,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\太上升玄说消灾护命妙经注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "此四句偈，为学人吃紧处。 老子所谓视之不见名曰夷，听之不闻名曰希，搏之不得名曰微。 所以道在天地，天地不知，道在万物，万物不知。 澄之不清，挠之不浊。 动中不动，静中不静。 妙体至虚，灵应万有，不可得而形容也。 可以离形弃智，即此用。 不见中亲见，见中不见，不闻中亲闻，闻中不闻。 默识心通，神领意会，到此之间，自离种种诸相，方名为妙道也。 岂不为学人希有之功者乎？ 颂曰：大象无形，大音希声，虚空粉碎，神升太清。 太上升玄说消灾护命妙经注竟 #1 『大』字下疑脱一『千』字。",
      "translated_text": "These four lines of verse are the crucial point for learners.\nWhat Laozi called \"seen yet not seen is called the Even, heard yet not heard is called the Rare, grasped yet not obtained is called the Subtle.\"\nThus, the Dao abides in Heaven and Earth, yet Heaven and Earth do not know it; the Dao abides in the myriad things, yet the myriad things do not know it.\nIt cannot be clarified by settling, nor muddied by stirring.\nWithin movement, it does not move; within stillness, it is not still.\nIts wondrous essence is utterly empty, its numinous response pervades the ten thousand beings—it cannot be captured in form or description.\nOne may depart from form and abandon cleverness, applying it thus:\nWithin not-seeing, one intimately sees; within seeing, one does not see.\nWithin not-hearing, one intimately hears; within hearing, one does not hear.\nSilently comprehending, the mind connects; spirit apprehends, meaning is grasped.\nAt this juncture, one naturally departs from all manifold appearances—only then is it called the wondrous Dao.\nHow could this not be the rarest attainment for learners?\n\nA verse says:\nThe great image has no form,\nthe great sound is soundless.\nThe void shatters to dust,\nthe spirit ascends to the Great Clarity.\n\nThe *Supreme Ascension to the Mysterious: Annotated Wondrous Scripture for Eliminating Disasters and Protecting Life* concludes. #1 (Note: A \"thousand\" may be missing after \"great.\")",
      "overlap_context": "formations unfathomable.\nIt delivers sentient beings,\nwarding off calamity and supporting the frail.\n\nAt that time, the Heavenly Worthy spoke this verse:\n\"Seen yet not seen,\nheard yet not heard,\nfree from all extremes—\nthis is called the wondrous Dao.\"\n\nNow that the Heavenly Worthy has finished expounding the scripture,\nnot daring to praise himself,\nhe respectfully refers to \"that time\" and speaks this verse,\ndepicting the wonder of the great Dao\nand summarizing the profundity of this scripture.",
      "start_char": 4110,
      "end_char": 4342,
      "start_sentence": 177,
      "end_sentence": 189,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.391235828399658,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\太上升玄说消灾护命妙经注.txt",
        "category": "玉诀类"
      }
    }
  ]
}