{
  "source_id": "太上老君说常清静妙经纂图解注",
  "source_file": "chunked_daozang\\太上老君说常清静妙经纂图解注.json",
  "total_chunks": 8,
  "total_original_chars": 9176,
  "total_translated_chars": 51202,
  "total_translation_time": 246.7183289527893,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\玉诀类\\太上老君说常清静妙经纂图解注.txt",
    "category": "玉诀类"
  },
  "full_translation": "*The Supreme Lord Lao’s Exalted Scripture on Constant Purity and Tranquility: An Illustrated Commentary with Diagrams*\n\n**Title:** *The Supreme Lord Lao’s Exalted Scripture on Constant Purity and Tranquility: An Illustrated Commentary with Diagrams*\n**Author:** Daoist Wang Jie (courtesy name Daoyuan) of the Yuan dynasty.\n**Length:** One scroll.\n**Source Text:** *Zhengtong Daoist Canon*, *Dongshen* Section, *Jade Instructions* Category.\n\n---\n\n**Preface to *The Supreme Lord Lao’s Exalted Scripture on Constant Purity and Tranquility***\n\nI humbly observe: To transform through the great is called sageliness; to transform through the sagely in unfathomable ways is called the numinous. The numinous sageliness of the Supreme Lord Lao resides at the inception of primordial chaos, serving as the origin of the myriad *qi*, his transformations beyond all reckoning.\n\nTracing the records, we find:\nIn the era of the first Three Sovereigns, he was the Celestial Master of the Myriad Teachings;\nIn the middle Three Sovereigns, he was Master Pangu;\nIn the age of the Later Heavenly Sovereign, he was Yu Hua Zi;\nDuring the reign of Shennong, he was known as Da Cheng Zi.\n\nBy the time of the Yellow Emperor, he appeared as the Master of Kongtong Mountain, styled Guang Cheng Zi, and transmitted the Dao to the Yellow Emperor.\nIn the age of Shaohao, he transformed as Sui Ying Zi;\nUnder Zhuanxu, he was Chi Jing Zi;\nDuring Emperor Ku, he was Lu Tu Zi;\nIn the time of Emperor Yao, he was Wu Cheng Zi;\nUnder Emperor Shun, he was Yin Shou Zi;\nIn the era of Yu of Xia, he was Zhen Xing Zi;\nDuring the reign of Tang of Shang, he was Xi Ze Zi.\n\nThough he manifested across successive ages, no trace of his birth was recorded. Only in the reign of King Yangjia of Shang did he divide his form and transform his *qi*, entering the womb of the Mysterious Wondrous Jade Maiden for eighty-one years. On the fifteenth day of the second month in the *gengchen* year of King Wuding’s reign, at the hour of *mao*, he was born in Qu Ren Village of Lai District, Ku County in Chu. His mother grasped a plum tree, and he emerged from her left side, his hair and beard already hoary, his countenance like that of a child. Thus, he took Li as his surname, was named Er with the courtesy name Boyang, and was posthumously styled Dan, known as Laozi.\n\nIn the time of King Wen of Zhou, he served as Archivist of the Royal Treasury; under King Wu, he was promoted to Historian Beneath the Pillars. He embraced simplicity, held to the uncarved, diminished thought, and restrained desire.\n\nHolding to the ancient Dao to govern present realities;\nThe hidden Dao goes unmanifest, the humble virtue remains unseen;\nInternally, one consolidates the true and nourishes life;\nExternally, one distances harm and preserves the body.\nMastering antiquity and comprehending the present, no principle remains obscure.\n\nTo the east, he instructed Confucius, eliciting the sigh of \"like a dragon\";\nTo the west, he transformed as the Golden Immortal, and the earth resounded with the lion’s roar.\nHe expounded the *Five Thousand Words of the Dao and Virtue*, bestowing them upon Yin Xi.\nThrough successive ages, he manifested transformations to propagate the Dao and its teachings.\n\nPerceiving that worldly people, lost in greed and delusion, had strayed from their original true nature,\nhe composed the *Classic of Purity and Stillness*, making it the foremost of all scriptures.\nIts words are simple yet its Dao profound,\nrevealing the causes of life and death,\nreviving the mystic wind,\nguiding people toward the Dao,\nand leading them to comprehend the principle of the three lives and the truth of undying through ten thousand kalpas.\n\nI have long studied this classic but failed to grasp its essence.\nRecently, through my teacher’s enlightenment, my heart was opened,\nand I readily attained the true and constant origin of creation.\nOnly then did I recognize the subtlety of Fuxi’s trigrams\nand understand the praise of the Sage Confucius for the *Book of Changes*.\nProbing the Golden Immortal’s prajñā wisdom, it aligns perfectly like tallying tokens.\n\nThe Supreme One’s sageliness transcends life and death, standing alone,\nspanning past and present without peer.\nThus, the hundred kings took him as their model, and successive sages transmitted his teachings.\nThose who deem it a doctrine of emptiness and heterodoxy\nare those who, lacking the sagely method, oppose the Sage.\n\nThe Dao is not distant from humanity; it is people who distance themselves from the Dao.\nThose who attain it may transform the foolish into the wise, the turbid into the clear.\nThose who cultivate it may transmute stone into gold, the ordinary into the sagely,\nrising beyond the three realms to become eternal Upper Immortals—how wondrous indeed!\n\nWith my limited insight, I have taken this scripture,\nannotated each section with the words of former sages and worthies,\nand compiled diagrams to interconnect the commentary,\nelucidating its depths and broadening its connections,\nso that with a single glance, all may be clearly seen.\nThough my words may be coarse, they do no more than directly explicate its meaning.\nI dare not claim this as definitive; may those of like mind judge it.\n\n*Preface by Wang Jie Daoyuan, the Master of Primordial Chaos*\n\n*Diagrammatic Annotations and Exegesis of the Supreme Lord Laozi’s Wondrous Classic of Constant Purity and Stillness*\n*Compiled and Annotated with Diagrams by Wang Jie Daoyuan, the Master of Primordial Chaos*\n\n\"Supreme\" (*Tai*)—nothing greater can be called Supreme.\n\"Upper\" (*Shang*)—nothing beyond can be called Upper.\n\"Lao\" (*Old*)—the Dao is revered, virtue esteemed, enduring through antiquity.\n\"Lord\" (*Jun*)—the master, the one spirit that governs all things.\n\"Expounds\" (*Shuo*)—to enlighten and transform.\n\"Constant\" (*Chang*)—the true and unchanging Dao.\n\"Purity\" (*Qing*)—utter emptiness, without form.\n\"Stillness\" (*Jing*)—absolute purity, without admixture.\n\"Wondrous\" (*Miao*)—the mystery within the mystery.\n\"Classic\" (*Jing*)—the constant Dao of Heaven, the heart of humanity; also, the path all people traverse.\n\nThe Supreme One, seeing that people lived amidst the turbidity of the kalpa,\nclinging to sensory desires and obscuring their original nature,\ngrieved over the loss of the Dao.\nThus, of necessity, he expounded the *Classic of Purity and Stillness* to enlighten the world,\nguiding them to know their origin and end.\n\nWhen a person is first born, they are as an infant.\nThe infant’s heart harbors no unkindness;\nonly as years pass and they mature,\nseeing forms with their eyes, hearing sounds with their ears,\nsmelling fragrances with their nose, tasting flavors with their tongue,\ndo greed and attachment arise without cease,\nand the stains of habit grow deeper.\nThus, emotions entangle and desires obscure, diverging from the Dao.\n\nIf one can purify the heart, still the nature,\nillumine the good, and return to the origin,\nso that not a single thought arises and no dust clings,\none naturally attains purity and stillness,\nmerging with the true Dao.\n\nLaozi said:\nThe Great Dao is formless, yet it gives birth to Heaven and Earth;\nThe Great Dao is passionless, yet it moves the sun and moon;\nThe Great Dao is nameless, yet it nurtures the myriad things.\n\nThe Dao gives birth to spontaneity.\nThe Great Dao is utter emptiness, without form, without passion, without name.\nAt the dawn of the vast kalpa,\nthere already existed the Three Qi of Brahma Purity: Supreme Clarity, Supreme Subtlety, and Supreme Simplicity,\nhidden and without image,\nvast and boundless, without light,\na single chaos alone.\nAll was yin *qi*, empty within and without,\nyet containing the principle of firm and ceaseless activity.\nCoiling and revolving to its utmost,\na single yang first stirred within,\ngiving rise to the odd and even,\ndividing into yin and yang,\nand birthing Heaven and Earth.\nThe pure *qi* ascended to become Heaven; the turbid *qi* descended to become Earth.\nOnce Heaven and Earth were separated, the myriad things dwelt between them.\nYin *qi* emerged from Earth and ascended to Heaven;\nyang *qi* descended from Heaven to Earth.\nYin and yang circulated endlessly.\nThus, the sun and moon moved, the Five *Qi* spread in order,\nthe four seasons proceeded,\nand the myriad things were nurtured.\nFrom the vastness of Heaven and Earth to the tiniest speck of dust,\nnot a single thing is not transformed and nourished by the Dao.\nThose who skillfully investigate return to themselves to seek it—\ntheir own body is Heaven and Earth.\nThough the Dao that gave birth to me has no name,\nI name it the Dao.\n\nThe *Classic of the Dao and Virtue* says:\nThere is a thing, chaotically formed, born before Heaven and Earth.\nSilent, empty, it stands alone and does not change,\ncirculating without cease—\nit may be called the Mother of the world.\nI know not its name; I style it the Dao, and by force call it Great.\nGreat means it departs; departing means it is distant; distant means it returns.\nThus, the Dao is great indeed.\n\nI know not its name; by force, I call it the Dao.\nWho speaks of the Dao? The Supreme One says the Dao is great and profoundly empty,\noriginally without name or designation.\nYet, as it cannot stand void, it assumes form and function.\nMoreover, the birth of the human body is a chaos—\na single Supreme Ultimate,\nfor the Dao of Heaven, Earth, and the myriad things is wholly within this body.\nThe heart’s emptiness and numinosity—\nthe Dao naturally returns to it.\nStillness is the nature; movement is the emotion.\nThe nature abides within as the essence;\nthe emotions operate without as the function.\nEssence and function share a single source;\nthe manifest and the subtle are without distinction—\nthis is called the Dao.\n\nThe term *Dao* speaks of essence and qi transforming into form, spirit’s emptiness and wondrous subtlety—how could one know its name? Yet if we do not speak of the Dao, by what shall we call it? Thus, not by our own will, we forcefully name it the Dao.\n\nThe *Daodejing* says: The Dao as a thing is only dim and vague. Vague indeed, dim indeed—within it there are images; dim indeed, vague indeed—within it there are things. Dark and deep indeed—within it there is truth. Thus, Yanzi, when speaking of the sages’ Dao, said: Look up at it, and it grows ever higher; delve into it, and it grows ever firmer. Glimpse it ahead, and suddenly it is behind. This is why the *Yijing* preserves what has no form, and spirit’s transformations have no fixed direction—such is the meaning here.\n\nThe Dao possesses clarity and turbidity, movement and stillness. Heaven is clear, Earth turbid; Heaven moves, Earth is still. Man is clear, woman turbid; man moves, woman is still. Descending from root to branch, it gives birth to the myriad things. Qi transforms, giving rise to form.\n\nThe Dao as a thing is empty and without image; it is only through qi’s transformations that the name *Dao* arises. The Dao is born from the One; the One is born from the Two. The Two qi interact and unite to generate the myriad things—this is the principle of nature.\n\nThe Dao dwells before Heaven and Earth, encompassing and sustaining all. Silent and nameless, it is called the True of the Limitless. Within the Limitless, the Dao arises from utmost emptiness. Yang emerges and flows freely—from the Limitless comes the Supreme Ultimate. This is the wondrous union and coagulation of the Two and the Five.\n\nThe Supreme Ultimate moves and generates yang; it is still and generates yin. Yang is clear and becomes Heaven, governing movement; yin qi is turbid and becomes Earth, governing stillness. Heaven covers Earth, Earth bears Heaven; Heaven moves, Earth is still—the Two qi intermingle. When yang qi takes precedence, it is the yang Dao; when yin qi takes precedence, it is the yin Dao. As the *Yijing* says: The Qian Dao forms man; the Kun Dao forms woman. Man embodies Heaven, thus clear and moving; woman embodies Earth, thus turbid and still. When man and woman interact, yin and yang harmonize and flow freely. Their true essence is released, descending from root to branch, giving birth to the myriad things.\n\nThe birth of all things follows this same principle. Qi and substance transform and act, each according to its kind. In ceaseless generation and transformation, the Dao is never not one. Confucius said: The noble person’s Dao begins with husband and wife; at its utmost, it is discerned in Heaven and Earth. Thus, following the natural order gives rise to humans and things; reversing it leads to Buddhahood and immortality. Master Zhou’s *Taiji Diagram* deeply grasped this essence.\n\nTherefore, this scripture’s profound subtlety lies in these few words, which already encompass the entirety of the *Zhouyi*. Speaking in terms of the elixir path: Heaven and Earth serve as furnace and cauldron; man and woman as Kan and Li. Qian’s firmness moves the yang fire without cease—this is Heaven’s clarity and man’s movement. Kun’s softness retreats with the yin tally, concealing and storing—this is Earth’s turbidity and woman’s stillness. Because yin and yang possess the mechanism of movement and stillness, one draws from Kan to fill Li, returning to the root and reverting to the source—thus descending from the root and flowing to the branch, nurturing the myriad things of one’s body. What doubt could there be?\n\nClarity is the source of turbidity; movement is the foundation of stillness. Returning to the root and reverting to the source: Clarity is the primordial yang, the ancestral qi; turbidity is the illusory form, the yin qi. Movement is the numen of yang; stillness is the ground of the heart.\n\nSpeaking of human birth: the Four Great and the entire body belong to yin. Only this single point of primordial yang, the ancestral qi, resides at the center of the human body’s Heaven and Earth—this is called the *ming* stem. Where there is a stem, there is a root. When the root is deep, the stem is naturally firm. Essence is the root; qi is the stem; spirit is the numinous master of root and stem. One who comprehends this principle can preserve the True. Naturally, when essence is complete, it transforms into qi; when qi is complete, it transforms into spirit; when spirit is complete, it transforms into emptiness. Emptiness stands alone, beyond life and death.\n\nWhen employing this in elixir practice: move inwardly with nature, shift outwardly with emotion—this is what is meant by “clarity is the source of turbidity.” With the two earths, Wu and Ji, gather the qi from all directions to attain numinosity—this is what is meant by “movement is the foundation of stillness.” This wondrous secret lies in the oral instructions.\n\nIf one can constantly maintain clarity and stillness, Heaven and Earth will all return to you. The heart must reside within the cavity. “Constant” means ordinary; “clear” means all conditions suddenly cease; “still” means not a single thought arises. If one can, in the ordinary course of daily life—whether moving, dwelling, sitting, or lying down—gather the scattered mind, preserve the good heart, neither allowing the inner to depart nor the outer to enter, and keep the heart utterly empty, taking the Dao as one’s body, then naturally desires and anger will not arise. Spirit will become clear of itself, and qi will become still of itself. Nature will abide of itself, and *ming* will halt of itself. Then the Dao of Heaven and Earth will all return to one’s body.\n\nConfucius said: The Dao is that from which one cannot be separated even for an instant; what can be separated is not the Dao. Another saying goes: The noble person does not, even for the time of a single meal, depart from benevolence. In haste, one must be thus; in turmoil, one must be thus. Yao transmitted the Dao to Shun, saying: Only be refined, only be unified, and truly hold fast to the center—this is it.\n\nThe human spirit loves clarity, yet the heart disturbs it. To entertain a thought is already to deviate. Spirit is the primordial spirit within the human body. Spirit is the utmost numen of the myriad things, empty and wondrously profound. From the beginningless kalpa until now, it has never increased or decreased. It is inherently neither clear nor turbid—this is the wonder of nature.\n\nThe Perfected One Bai Ziqing said: This spirit is not the spirit of thought; it is comparable to the Primordial Beginning. Vast, it encompasses Heaven and Earth; small, it hides within a grain of millet. Bright and penetrating, how could it have a preference for clarity? If one thinks with spirit, it is no longer spirit. How much less can spirit depart to seek clarity? Yet one does not realize that the word “clarity” binds it, causing the mind-ground to generate ever more杂念, disturbing it without cease.\n\nThe *Daode Jing* states: \"The farther one goes forth, the less one knows\"—this is so. The human mind favors stillness, yet desires pull it away. Where methods arise, deceit is born. The mind is spirit; spirit is the mind. Desire is private thought; \"pull\" means to lead astray. The inherent goodness of the mind is originally the wonder of emptiness and quiescence—neither moving nor still, beyond thought and speech. With no dharma established, all dharmas are luminously manifest—what stillness is there to favor? Damo said: \"Neither think of good nor think of evil, just be thus.\" Confucius said: \"Before joy, anger, sorrow, and pleasure are aroused, it is called the Center; when aroused and all in due measure, it is called Harmony. The Center is the root of the world; Harmony is the Dao/Way that pervades the world.\" Thus, the sages transmitted the mind-dharma to one another, enabling them to settle the mind in this way, merging with the celestial principle and free from all obstructions.\n\nThough one may possess the endowment of a worthy or sage, without the oral instructions of a true teacher, the mind has no place to rest. If one preserves it, it exists; if one does not, it vanishes—merely grasping at the mind with private conjectures. Even the Dao/Way of the sages is such that if the mind favors stillness, it becomes bound by stillness, unaware that the myriad desires have already led the good mind ten thousand miles away. How could one, through thrice returning to the numinous, recover the mind that sees Heaven and Earth? This is a point worthy of deep reflection.\n\nIf one can constantly dispel desires, the mind will naturally become still; if one clarifies the mind, the spirit will naturally become clear. Spontaneously, the six desires will not arise, and the three poisons will vanish. \"Restrain the self and return to propriety.\" The six desires are those of the eyes, ears, nose, tongue, body, and intent. The three poisons are greed, anger, and delusion. Within the human body reside the three corpse-spirits, named Peng Ju, Peng Zhi, and Peng Qiao—these are the three hun-souls. When one’s thoughts are impure, the hun-souls immediately cause one to gallop in confusion, indulging in greed and deviant lust, entering the ghostly realm and losing one’s original nature. As the *Scripture of Salvation* states: \"The ghostly realm is easily led astray.\"\n\nIf worldly people can awaken to the fact that the four great elements—earth, water, fire, and wind—temporarily combine to form this illusory body, which will ultimately decay, and perceive that all things with form share this same principle, then from this moment on, they will no longer value external things but will instead investigate the One Mind. The mind is the treasure of the body. The mind is earth; nature is the sovereign. When the sovereign comes to dwell upon the earth of the mind, it governs the myriad affairs, constantly abiding in the true silence of the profound. This numinous essence does not change with the world; it can dispel all desires, so that naturally the mind becomes still and the spirit becomes clear, the six desires do not arise, and the three poisons vanish. The *Daode Jing* states: \"The sage acts for the belly, not for the eyes\"—thus, he discards that and embraces this.\n\nThose who cannot do so fail because their minds are not clarified and their desires are not dispelled. Though people are born between Heaven and Earth, the climate and terrain differ, and thus their endowments vary. Their nature is not inherently dull, but because they receive turbid qi, the celestial constant is obscured like black clouds. Thus, when the eyes see, ears hear, nose smells, and tongue tastes, encountering objects and touching things, they leak through every aperture, letting the mind wander without return. The primordial spirit becomes scattered and dim, unable to recover its original truth, and one falls into the dark kalpas—all because the mind cannot be clarified and desires cannot be dispelled.\n\nThose who can dispel them: inwardly observe the mind, and the mind is no-mind; outwardly observe the form, and the form is no-form; observe things afar, and things are no-things. When these three are awakened to, only emptiness is seen. The numinous is not obscured. This passage speaks of the practitioner who can directly awaken, cut off desires, and purify the source, establishing a resolve as immovable as a mountain. Though one may wander among willows and flowers, being stained by the world, inwardly one observes the mind, and the mind is forgotten; outwardly one observes the form, and the form is forgotten; afar one observes things, and things are forgotten. Having awakened to the forgetting of these three, one sees only that within the body is a great void—clear, bright, and boundless—unaware of Heaven and Earth as oneself, or oneself as Heaven and Earth. Only when cultivation reaches this stage does one perceive the wonder of emptiness. This is called: \"Cases are not to be taken as images; things are not to be taken as things.\" The *Daode Jing* states: \"What cannot be seen when looked at is called *yi*; what cannot be heard when listened to is called *xi*; what cannot be grasped when sought is called *wei*. These three cannot be fathomed.\" The *Yi*’s *Gen* hexagram states: \"Stopping at the back, one does not obtain one’s body; walking in the courtyard, one does not see others\"—this is so.\n\nObserving emptiness with emptiness, emptiness has no emptiness; from nonbeing, being arises. When what is emptied is already nonexistent, even nonbeing is nonexistent—this is the formless Great Dao/Way. When nonbeing is nonexistent, there is only profound stillness; spirit and qi unite as one. When stillness has no stillness, how can desire arise? When images have no substance, desire does not arise—this is true stillness, merging with the Dao/Way in reality.\n\nThis passage continues from the above, where \"the three are awakened to, and only emptiness is seen,\" lest one cling to dead emptiness with intent. Here, it clarifies that observing emptiness with emptiness means that emptiness has no emptiness—urging one to be lively and free, to observe its subtleties when the celestial nature is without desire. The *Daode Jing* calls these two \"emerging from the same source but with different names,\" both termed \"mysterious.\" \"What is emptied is also nonexistent; even nonbeing is nonexistent\" means that once one has returned to the Dao/Way and restored emptiness, the qi is clear and bright, vast and boundless, with no images to observe. \"When nonbeing is nonexistent, there is only profound stillness\" means that once all has been forgotten, one’s true unity naturally abides. \"When stillness has no stillness, how can desire arise?\" means that nature is not dead stillness—one merely responds to changes without abiding in images, thus subduing the mind. How could desire arise?\n\nWhen desire does not arise, this is true stillness—this speaks of diligently practicing the way of the talismanic fire, having attained the pure *qi* of Brahman and reached spiritual refinement, forming the golden embryo of the sage. The yin turbidity dissolves, and the true Dao is purely yang, forged into one whole. Worldly dust no longer intrudes, wisdom manifests, and one’s nature stands firm and immaculate as a towering mountain—true stillness, unshaken.\n\nAt this stage, one transcends the mundane and enters sagehood, attaining a lifespan equal to Heaven—how could this be empty words? In true stillness, one responds to things; in responding to things, one remains unstained. In true constancy, one attains one’s nature. With no thought arising, one constantly responds and constantly abides in stillness, and all entanglements instantly cease. One is ever in pure stillness, and wisdom becomes perfect.\n\nThis passage follows the above, stating that when desire does not arise, this is true stillness, and thus proceeds to *true stillness responding to things* and *true constancy attaining one’s nature*. This is what is meant by sagehood and perfect wisdom—one’s nature is naturally true and still. When things come, one turns and responds with them, like a pearl rolling on a plate, round and smooth, fluid and unobstructed. Thus, the mind is open and unimpeded, naturally responding to things without stain and attaining one’s nature.\n\nThe *Daode Jing* says: \"The myriad things flourish, each returning to its root. Returning to the root is called stillness; returning to one’s mandate is called constancy. Knowing constancy is called illumination. Not knowing constancy, one acts recklessly and courts misfortune.\"\n\nThe *Vajracchedikā Sūtra* says: \"One should not give rise to the mind that abides in form, nor give rise to the mind that abides in sound, scent, taste, touch, or dharmas. One should give rise to the mind that abides nowhere.\"\n\nThe Perfected One Yin Xi said: \"When things come, I respond to them with feeling but do not oppose them with the mind.\"\n\nConfucius said: \"The noble person acts according to his position and does not desire what lies beyond it.\" From this, can it not be seen that one is constantly responding, constantly still, and constantly pure?\n\nThrough such purity, one gradually enters the true Dao. The Dao is entered through sincerity.\n\nWhat follows is for the transformation of sentient beings toward the Dao. Some may be foolish yet can be made wise; some may be turbid yet can be made clear. Suddenly awakening their inherent nature, one thus admonishes them to purify their minds, still their natures, not oppose the myriad entanglements, and simply cultivate in this manner. Shedding their old stains of defilement, they daily renew their virtue and naturally enter the true Dao.\n\nHaving entered the true Dao, this is called *attaining the Dao*. \"I am the Primal Beginning.\" This follows the above, stating that the learner has grasped the principle of awakened nature. Before receiving the secret oral transmission from a teacher, one is thus instructed: having entered the true Dao and being called *attaining the Dao*—this means the true Dao is not the way of cleverness, broad learning, or reciting the three mysteries. It is, in truth, the wondrous work of the three perfections within the body. One must bow to a true teacher, receive a single word at the ear, and directly settle the mind—only then does one enter the true Dao.\n\nNurturing one’s nature without losing its center, cultivating life by moving the bellows without losing the sieve, one’s nature and life naturally merge. The golden elixir flows—thus it is called *attaining the Dao*.\n\nThough called *attaining the Dao*, in reality, there is nothing attained. This follows the above, fearing that learners, though enlightened in principle, may cling to the word *attain* in their seeking, thereby turning away from the Dao. Thus, it proceeds to say that though called *attaining the Dao*, in reality, there is nothing attained—urging learners to investigate thoroughly and awaken truly.\n\nThe Dao as a thing is formless in its great image, soundless in its great tone, and cornerless in its great square. It truly has no name. If one fixes one’s thoughts on any single point of the four directions, above or below, one misses it. Yet one cannot leave this body and seek it externally. It cannot be thought, cannot be discussed, is neither movement nor stillness. The one body is the myriad distinctions; the myriad distinctions are the one body. In every thing and every phenomenon, all is manifest before one. At this point, if one can turn a single phrase, one smashes through iron walls and silver mountains, breaking through directly—only then is it *attaining the Dao*.\n\nAttaining it as non-attainment, not deluded by appearances, one’s single numinous true nature shines forth, ever abiding before the Lord of Images, bright and clear—this is called *true attainment*. As the true elixirists say: \"In non-seeing, one intimately sees; in seeing, one does not see. In non-hearing, one intimately hears; in hearing, one does not hear.\" Penetrating this barrier, the work of inquiry is complete—what attainment could there be? For the sake of transforming sentient beings, it is called *attaining the Dao*.\n\nThose who awaken to this may transmit the sagely Dao. It is all-pervading.\n\nTo transform is to open and develop. Sentient beings are those attached to things. This concludes the above, stating that through such purity, one gradually enters the true Dao. The Most High, seeing the multitude of beings under Heaven, the mingling of sages and commoners, and the rarity of those with inherent nature, thus employs the Dao’s twists and turns to expound and open their understanding. Among them, there may be those of keen capacity who, upon hearing these words, suddenly awaken, instantly shedding the roots of the dust and taking the Dao as their body. Diligently investigating within this Dao without ceasing, they cultivate earnestly—this is called *transforming sentient beings* and *attaining the Dao*.\n\nThe word *attain* originally means nothing is attained. But when speaking this word to others, it is to entice people to keep the Dao in mind without forgetting. The *Daode Jing* says: \"The good person is the teacher of the not-good person; the not-good person is the resource of the good person.\" Thus, all people are inherently endowed, none without the same nature as mine. Only because they cling to things are they called *sentient beings*. If one can truly comprehend this, one may transmit the sagely Dao.\n\nAs with the Sixth Patriarch Huineng of Lu, originally a barbarian from Guangdong, who upon hearing a traveler recite the *Vajracchedikā Sūtra* to *\"give rise to the mind that abides nowhere,\"* suddenly awakened. Later, he went to Mount Fengmu to pay homage to the Fifth Patriarch. When asked the reason, he answered like a gushing spring. Seeing his great capacity, the Fifth Patriarch...\n\nFearing others might plot against him, the Fifth Patriarch rebuked Huineng and ordered him to pound rice, so no one paid him any mind. Later, the Fifth Patriarch deliberately instructed the assembly to compose verses; whoever could clarify the mind and perceive the nature would be entrusted with the robe and bowl. All deferred to the head monk Shenxiu to compose a verse. Shenxiu’s four-line verse did not fully capture the essence. Upon hearing it, Huineng immediately followed its rhyme and said:\n\n*Bodhi has no tree,*\n*The bright mirror is not a stand.*\n*Originally, not one thing exists—*\n*Where could dust alight?*\n\nThe Fifth Patriarch nodded in secret and arranged to meet him in the central hall at midnight. Surrounding Huineng with his robe, he recited the *Vajracchedikā Sūtra* up to *\"give rise to the mind that abides nowhere.\"* There, he transmitted the mind-Dharma, bestowed the robe and bowl, and then sent him across the river, thus becoming the Patriarch of an age. This shows that one must not judge by appearance but by aspiration. Like Ma Danyang converting Ren the butcher—first a violent man, upon sudden awakening, he became virtuous. From this, can we not see that those who awaken may transmit the sagely Dao?\n\nThe Most High Lord Lao said: This title \"Most High\" is how the perfected ones refer to him. What was previously called the Dao hereafter takes another name: what is spoken of is virtue. The *Daode Jing* says that virtue aligns with virtue, while loss aligns with loss—hence the distinction between superior and inferior scholars. Learners should observe with a discerning eye.\n\nThe superior scholar does not contend; the inferior scholar loves contention—their views differ. The superior scholar is what we call a sage of great virtue. The inferior scholar is what we call a worthy clinging to attachments. The sage’s mind merges with Heaven’s principle, embracing all without distinction between wise and foolish. Blending light with the common, dwelling among the dust, humbling himself in lowliness, he files down sharpness and buries his brilliance, never revealing his edges. He treats the good with goodness and the not-good with goodness. Practicing the teaching without words, engaging in affairs without action, he disputes nothing with others—this is the superior scholar.\n\nThe worthy’s mind clings to attachments, believing others’ learning is inferior to his own. Self-righteous and self-displaying, self-praising and self-boasting, he judges the ancient worthies, calling some long and others short; he evaluates contemporaries, declaring some right and others wrong. Even the sages who become immortals or buddhas—let alone his own heterodox learning of emptiness and extinction—are not spared his contention. This is the inferior scholar.\n\nYin Xi said: The sage is like a dragon; the worthy, like a flood-dragon. A dragon can transform a flood-dragon, but a flood-dragon can never become a dragon—this is what is meant.\n\nSuperior virtue does not claim virtue; inferior virtue clings to virtue. Those who cling cannot be called virtuous. Humble virtue is whole; clinging virtue is partial.\n\nSuperior virtue is the Dao of non-action. Inferior virtue is the Dao of action. *Clinging* means obstinate and unyielding. *Virtue* means attainment—the principle of what the mind stores, the blending of nature, the unfolding of things, and the accomplishment of affairs.\n\nThis speaks of the sage of superior virtue, who never displays his own virtue. Concealing himself and hiding his traces, embracing simplicity and containing his light, concentrating his qi to attain softness, he is like an infant. The worthy of inferior virtue clings to affairs, endlessly debating worldly matters of right and wrong, gain and loss. Boasting of his own virtue, blinded by his own cleverness, he divides things into self and other, noble and base, high and low. Thus clinging, how can he understand true virtue?\n\nDoes not the *Daode Jing* say: *Superior virtue does not claim virtue, and thus possesses virtue; inferior virtue never loses virtue, and thus lacks virtue.* Superior virtue acts without acting; inferior virtue acts with deliberate action.\n\nThus, the Most High said: *I have three treasures to preserve and uphold: first, compassion; second, frugality; third, not daring to be first in the world.*\n\nConfucius said: *A sage I cannot be, but I transmit rather than innovate, trusting and loving the ancients. I humbly compare myself to Lao Peng. Silently I comprehend, learning without tiring, teaching without wearying—what do I possess?* He never once spoke of his own virtue. From this, can we not see that superior virtue does not claim virtue?\n\nThe inferior scholar who clings to virtue, judging by outward appearances, may excel in governance, literature, poetry, or esoteric arts—yet he becomes arrogant, flaunting his abilities, obstinately holding to one-sided views. How can he illuminate the Dao?\n\nEven the sages Yao and Shun shared goodness with others, and the enlightened Yu, upon hearing a single good word, would bow—when did they ever cling? Learners should ponder this deeply.\n\nThe Most High Lord Lao said: Why do sentient beings fail to attain the true Dao? Because they harbor deluded minds and seek excessive longevity.\n\nThis passage again invokes the name of the Most High, as the perfected ones warn the world to observe the conduct of sentient beings. *Sentient beings* refers to those who are ignorant and clinging—outwardly human in form, yet inwardly beast-like in heart. Their nature is a dark sea, chasing waves of desire, utterly devoid of virtue. They neither fear the laws of kings above nor cherish the bodies of parents below, engaging in theft, deceit, and every kind of villainy. They fail to attain the true Dao because their deluded minds are clouded by selfish desires, and thus the Dao slips further away.\n\nThe *Daode Jing* says: *The great Dao is level, yet the people prefer byways. The court is excessively adorned, the fields excessively overgrown, the granaries empty. They wear embroidered robes, carry sharp swords, gorge on food and drink, and hoard excess wealth—this is called the boasting of thieves. Is this not far from the Dao?*\n\nIt also says: *When the people do not fear authority, greater authority will come. Do not constrict their dwellings; do not oppress their livelihood.*\n\nThose who never know satiety are thus never sated. Such people persist until death without remorse, their hearts still craving what they lack. Their restless minds become the seeds of future rebirths, all because a single deluded heart has lost the true Dao. Once delusion arises, the spirit is startled; it is deceived and led astray.\n\nThis follows from what was said above: when the eyes behold beauty, the spirit receives it in the heart. Once the heart receives it, deluded thoughts arise, and the original spirit of the self transforms into the spirit of consciousness. The spirit, scattered by external conditions, follows the mind into confusion. The *Daode Jing* says: *So-called galloping and hunting excite the mind to madness; rare and precious goods obstruct right conduct.* Thus the spirit is startled.\n\nAll this stems from the heart-monarch failing to govern, dazzled by sensory forms. The true Dao is dissipated, and even in dreams, there is no peace. Once the spirit is startled, it clings to the myriad things, assailed by a host of desires. This means that when the spirit fixates on things, the mind-ground is no longer at peace. The spirit, startled by a single thing, becomes attached to it, drawn and ensnared by it, losing all sense of direction. Thus it clings to the myriad things without knowing satiety, even walking into danger without awareness of peril.\n\nOnce it clings to the myriad things, greed and craving arise, mistaking the thief for one’s own child. This means that when the spirit clings to things, the true nature is obscured, and it follows the machinations of the yin-soul. Such scheming leads to emotional indulgence, falling into the realm of drunken stupor and dreamlike existence. Greed draws one into the rivers of love and seas of desire, without rest or respite, entangled in a thousand threads, leading to lifelong ruin.\n\nOnce greed and craving arise, they become afflictions, self-imposed shackles. This is the source of entering the deviant path. Today they crave, tomorrow they crave; seeing, they covet; hearing, they desire. Daily they acquire all manner of things, yet their hearts never know contentment. They do not realize they are planting the roots of affliction and karmic deeds. Though their households may be abundant, thieves and robbers arise. With a hundred schemes and a thousand plots, their minds remain unsettled. As the ancients said: *Wealth burdens the body.* Thus they are bound by it, adding to their afflictions, and calamity strikes, leading to their downfall—all self-inflicted.\n\nAfflictions and delusions torment body and mind, bringing defilement and disgrace. They drift through the cycles of birth and death, forever sinking in the sea of suffering, eternally losing the true Dao. The harm to form is complete.\n\nThis section summarizes the foregoing: sentient beings, because of their deluded minds, fail to attain the true Dao. Clinging to life and fearing death, they plant the seeds of affliction. The hearts of sentient beings seek only profit to enrich their lives, pursuing immediate household abundance. They sink into the realms of form, sound, fragrance, and taste, bewildered by the allure of existence and non-existence, love and desire. They bring upon themselves afflictions, delusions, and the torment of body and mind. In their daily conduct, they are neither loyal nor filial, committing sins of deceiving heaven and cheating others, all secretly recorded by spirits. When heavenly disasters strike or retribution falls, their bodies suffer calamity. Whether in this life or the next, their transgressions are punished. Thus they endure defilement and disgrace, drifting through birth and death. Their solitary spirits, unaware, transform and are reborn among other species. For a hundred thousand kalpas, they struggle to regain human form, forever sinking in the sea of suffering, eternally losing the true Dao.\n\nIf people could turn back and take this as a warning, awakening early to the essence of the supreme Dao, they would avoid the suffering of the wheel of rebirth. Would the sages ever deceive us?\n\nThe Dao of true constancy is attained by those who awaken. Those who awaken to the Dao abide in constant purity, one with the great void. True constancy is neither born nor destroyed. From the beginningless kalpas, it has ever been thus. *Awakening* means realizing this principle; *attaining* means personally witnessing it. *Purity* means clarity without defilement.\n\nThis speaks of how, when one awakens to the original nature, it is inherently complete, requiring no artificial cultivation. Initially, through the transformation of qi, the true spirit coalesces into form, entering the shell and being enveloped by it. The numinous nature thus manifests according to the quality of qi. Hence the differences between sages and fools: even the greatly wise cannot be without the mind of the lowest fool, yet the lowest fool cannot be without the nature of the highest sage. This is why both awakening and cultivation are necessary. *Awakening* pertains to nature; *cultivation* pertains to life. Only when nature and life are cultivated together does one truly attain the Dao of constancy.\n\nOnce nature and life are united, the Dao is vast and profoundly empty. The heart naturally becomes pure and still, knowing all that comes without obstruction, responding to all that arrives without hindrance. Internally, one fully comprehends life and death; externally, one fulfills all human affairs. This concludes the marvelous essence of this scripture from beginning to end. The opening speaks of the Dao, and the closing speaks of virtue, truly distilling the marrow of the *Daode Jing*’s five thousand words. It aims to make people understand the principles of Dao and virtue: those who understand the Dao do not possess virtue—they are called superior persons; those who grasp the Dao do not lose virtue—they are called inferior persons; those with deluded minds and greedy cravings are called sentient beings.\n\nThus, at the end of this scripture, it speaks of the Dao of true constancy, which is attained by those who awaken. This reflects the Most High’s love for life and compassion for the suffering of sentient beings, employing manifold analogies to urge them to turn back early and awaken to this Dao. Some may suddenly penetrate and realize it, attaining constant purity—how wondrous is this!\n\nThe *Most High Lord Lao’s Explanation and Commentary on the Wondrous Scripture of Constant Purity* concludes.\n\n**Eulogy by the Perfected One**\nImmortal Ge Xuan said: I attained this Dao by reciting this scripture ten thousand times. This scripture is practiced by heavenly beings and is not transmitted to inferior persons. I once received it from the Lord of Eastern Florescence, who received it from the Lord of the Golden Tower, who received it from the Queen Mother of the West. The Queen Mother of the West transmitted it orally, without written record. Now, in this world, I have written and recorded it. Those superior persons who awaken to it ascend as heavenly officials...\n\nMiddle adepts who awaken to it become immortals of the Southern Palace; lesser adepts who awaken to it enjoy long years in the world, roam the Three Realms, and ascend to pay homage at the Golden Gate.\n\nThis eulogy by Immortal Ge Xuan of the Yellow Court praises the wondrousness of the *Most High Lord Lao’s Explanation and Commentary*. This scripture is not a text of written words. From the beginningless kalpas to the present, it is neither born nor destroyed, neither increased nor diminished—it is the direct path of the Dao. The mysterious barrier of the human body is called the \"scripture,\" and the work of practicing the Dao is called \"recitation.\" Recitation is not oral recitation; it is the mechanism of the opening and closing of Heaven and Earth, employing the wondrous function of the inversion of Kan and Li.\n\nWhen the immortal elder was moved to transmit the Dao, those who recited it ten thousand times were practicing this Dao. The ten thousand recitations are the work; the circulation is unceasing, continuous as if present. Obtaining a single grain-of-millet pearl and dropping it into the Yellow Court, it coalesces into the golden embryo of empty qi. Like a mother nurturing an infant, the spirit of the child irrigates it. After ten months, the fetal work is complete; the Gate of Heaven bursts open, and the yang spirit emerges, transforming endlessly—this is called a *Perfected One*. Such are the inconceivable merits and virtues of this scripture, the text practiced by heavenly beings, which must not be lightly transmitted to inferior persons.\n\nThe transmission of the Dao and the scripture must be to those of virtue, loyalty, and filial piety. Those who transmit it lightly will suffer heavenly punishment—such was the case with Zhang Ziyang, who was not human three times and suffered heavenly punishment thrice. The immortals and sages always concealed this scripture, transmitting it only orally, without written record, for fear of the arrogance of heavenly demons. Yet later generations, being less pure and simple than the ancients, would not awaken without the aid of written words. Thus, it was reluctantly recorded and transmitted to the world.\n\nSuperior adepts who awaken to it diligently cultivate and verify it, ascending as immortals of the Golden Tower. Middle adepts who awaken to it cultivate and verify it over time, becoming immortals of the Southern Palace. Lesser adepts who awaken to it become earthly immortals, enjoying long life in the world, their appearances and disappearances unfathomable. They can roam the Three Realms with the Dao and ascend to pay homage at the Golden Gate.\n\nThe Perfected One of the Left Mystery said: Those who study the Dao and uphold this scripture will have the ten heavenly benevolent spirits protect them. Then, the jade talisman secures the spirit, and the golden liquid refines the form. Form and spirit are both wondrous, merging with the Dao in truth.\n\nThe immortal elder’s repeated praise is the work of an old woman’s heart, revealing the secrets of this scripture—it is the essence of the great elixir of the golden pill, guiding later students of immortality. The so-called \"upholding and reciting\" means to faithfully receive and practice it. The \"ten heavens\" arise from the flow of *wu* into *ji*, with *wu* and *ji* each comprising five, totaling ten—hence the \"ten heavens.\"\n\nThe jade talisman is the talisman of fire. The golden liquid is the divine water. At the time of the first stirring of yang, the spirit returns to qi, qi returns to the cavity, and descending to the sea bottom, one embraces and brings forth the sun. This is the upholding and reciting of this scripture. The *wu* earth flows, compelling the essence of metal to ascend to the Southern Palace. Thereafter, the *ji* earth gathers yang and retreats the yin talisman, both returning to the position of *kun*—this is what is meant by \"the ten heavenly benevolent spirits protect the person.\"\n\nWhen the spirit is settled, the fire of stabilized qi surges forth, compelling the jade nectar and golden liquid of the body to flow and irrigate—this is what is meant by \"then the jade talisman secures the spirit, and the golden liquid refines the form.\" Form is called *ming*; spirit is called *xing*. When *xing* and *ming* unite, it is called the Dao. Thus, it is said that form and spirit are both wondrous, merging with the Dao in truth.\n\nIn terms of worldly methods, those who possess the Dao naturally have the ten heavenly benevolent spirits constantly protecting them—how could this be empty words? As the *Dao De Jing* says: \"Entering among weapons, they are not cut by blades; entering among tigers and rhinoceroses, they are not harmed by claws and teeth.\"\n\nThe Perfected One of the Orthodox Unity said: If a household possesses this scripture and one awakens to it, calamities will not approach, the multitude of sages will guard the gate, and the spirit will ascend to the upper realms to pay homage to the exalted ones. When merit is complete and virtue is perfected, one will be summoned by the Imperial Lord. With unwavering recitation and upholding, the body will ascend on purple clouds.\n\nThis passage is the eulogy of the Celestial Master Zhang Daoling. The so-called \"household\" does not refer to a family’s home but to the heart at the center of the human body. This scripture is the precious pearl, and the precious pearl is the Dao. Those who awaken to it personally witness its wondrousness. At the time when lead sees the birth of *gui*, the precious pearl is suspended in the void, five *zhang* above the earth. The revolving wheel of the flying stars of the heavens all enter the mouth of the pearl, transforming and refining into the elixir—this is true awakening.\n\nOnce the elixir congeals into flakes and the vast qi becomes pure yang, calamities naturally do not approach, and the multitude of heavenly sages secretly protect the body. Thus, one body becomes ten thousand spirits; one qi becomes ten thousand qi. On the day the elixir is formed, the embryo is cast off, the cauldron is changed, and the spirit moves to reside above the Mud Pill Palace in the Upper Capital. There, the Three Clarities dwell, and one’s body pays homage to the exalted ones. Only when merit is complete and conduct is perfected does one move the Imperial Lord to record one’s name in the registers.\n\nThose who constantly maintain purity, uphold strict precepts, and unwaveringly practice and recite this Dao will naturally receive a heavenly decree and imperial edict, summoning them to ascend on purple clouds and fly to the heavenly towers in broad daylight. Such was the case with the Celestial Master of the Han, who subdued demons and vanquished evil spirits; Immortal Ge, who performed rituals to refine the souls of the dead; and Xu Jingyang, who slew dragons and beheaded pythons. All achieved great merit in the world, and their entire households ascended. The Dao of learning immortality is indeed real.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上老君说常清静妙经纂图解注 经名：太上老君说常清静妙经慕图解注。 元代道士王玠（字道渊）撰。 一卷。 底本出处：《正统道藏》洞神部玉诀类。 太上老君说常清静妙经序 窃谓大而化之之谓圣，圣而化之不测之谓神。 夫太上老君之神圣，居混沌之始，为万炁之宗，变化不可测也。 於传考之，初三皇时为万法天师，中三皇时为盘古先生，后天皇之世为郁华子，神农时号大成子。 至轩辕时为崆峒山人，号广成子，授道与轩辕氏。 少皡时化号随应子，颛帝时号赤精子，帝誉时号录图子，帝尧时号务成子，帝舜时号尹寿子，夏禹时号真行子，商汤时号锡则子。 虽累世化身而未诞生之迹。 至商王阳甲时分身化炁，寄胎於玄妙玉女八十一年，至武丁时庚辰岁二月十五日卯时诞於楚之苦县濑乡曲仁里，母攀李树，从左胁降生，须发皓然，其颜如童，遂以李为姓，名耳字伯阳，谧曰聃，号曰老子。 至周文王时为守藏史，武王时迁柱下史。 见素抱朴，少思寡欲；",
      "translated_text": "*The Supreme Lord Lao’s Exalted Scripture on Constant Purity and Tranquility: An Illustrated Commentary with Diagrams*\n\n**Title:** *The Supreme Lord Lao’s Exalted Scripture on Constant Purity and Tranquility: An Illustrated Commentary with Diagrams*\n**Author:** Daoist Wang Jie (courtesy name Daoyuan) of the Yuan dynasty.\n**Length:** One scroll.\n**Source Text:** *Zhengtong Daoist Canon*, *Dongshen* Section, *Jade Instructions* Category.\n\n---\n\n**Preface to *The Supreme Lord Lao’s Exalted Scripture on Constant Purity and Tranquility***\n\nI humbly observe: To transform through the great is called sageliness; to transform through the sagely in unfathomable ways is called the numinous. The numinous sageliness of the Supreme Lord Lao resides at the inception of primordial chaos, serving as the origin of the myriad *qi*, his transformations beyond all reckoning.\n\nTracing the records, we find:\nIn the era of the first Three Sovereigns, he was the Celestial Master of the Myriad Teachings;\nIn the middle Three Sovereigns, he was Master Pangu;\nIn the age of the Later Heavenly Sovereign, he was Yu Hua Zi;\nDuring the reign of Shennong, he was known as Da Cheng Zi.\n\nBy the time of the Yellow Emperor, he appeared as the Master of Kongtong Mountain, styled Guang Cheng Zi, and transmitted the Dao to the Yellow Emperor.\nIn the age of Shaohao, he transformed as Sui Ying Zi;\nUnder Zhuanxu, he was Chi Jing Zi;\nDuring Emperor Ku, he was Lu Tu Zi;\nIn the time of Emperor Yao, he was Wu Cheng Zi;\nUnder Emperor Shun, he was Yin Shou Zi;\nIn the era of Yu of Xia, he was Zhen Xing Zi;\nDuring the reign of Tang of Shang, he was Xi Ze Zi.\n\nThough he manifested across successive ages, no trace of his birth was recorded. Only in the reign of King Yangjia of Shang did he divide his form and transform his *qi*, entering the womb of the Mysterious Wondrous Jade Maiden for eighty-one years. On the fifteenth day of the second month in the *gengchen* year of King Wuding’s reign, at the hour of *mao*, he was born in Qu Ren Village of Lai District, Ku County in Chu. His mother grasped a plum tree, and he emerged from her left side, his hair and beard already hoary, his countenance like that of a child. Thus, he took Li as his surname, was named Er with the courtesy name Boyang, and was posthumously styled Dan, known as Laozi.\n\nIn the time of King Wen of Zhou, he served as Archivist of the Royal Treasury; under King Wu, he was promoted to Historian Beneath the Pillars. He embraced simplicity, held to the uncarved, diminished thought, and restrained desire.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 387,
      "start_sentence": 0,
      "end_sentence": 14,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.376964092254639,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\太上老君说常清静妙经纂图解注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "执古之道以御今之有； 隐道不彰，谦德不显； 内则固真养命，外则远害全身； 博古知今，无理不澈。 东训尼父，故有如龙之叹； 西化金仙，大地作狮子吼。 述《道德》五千言，授之尹喜。 历代变现，以道弘化。 为见世人贪迷不悟，自失元真，故说《清静经》一卷，为诸经之首。 其言简而道奥，垂示生死之因，开化玄风，诱人向道，领悟三生之理、不死万劫之真。 余尝参究其经，未得其趣。 近因师点开心，易得造化真常之宗，始识羲皇画卦之妙，方知孔圣赞《易》之音，究其金仙般若之道，若合符节。 夫太上之圣，超生死而独立，亘今古而无双，是以百王取则，累圣攸传。 人或以为虚无异端之教者，便是非圣人者无法。 道本不远人，人之为道而远。 人得之者，愚可以智，浊可以清； 修之者，石可以金，凡可以圣，出乎三界之外，永为上仙，岂不玄哉。 余以管窥之见，将是经逐节引先圣先贤之语，解注于下，而又纂图贯通经注，曲畅旁通，一览澈见，言辞虽鄙，无非直解其义。 未敢为是，其与我同志者鉴诸。 混然子王玠道渊叙。 太上老君说常清静妙经纂图解注 混然子王玠道渊纂图解注 太者，无大可谓之太也。 上者，无极可极谓之上也。 老者，道尊德贵亘古今也。 君者，主也，一灵为万物之主宰也。 说者，开化也。 常者，真常之道，不变不易也。 清者，至虚无体也。 静者，至洁无杂也。 妙者，玄之又玄也。 经者，天道之常、人之有心也，又言人人共行之径路也。 太上见世人生居劫浊之中，食着物欲，昧了本初之性，忧道之失也，不得已，故说《清静经》开化世人，诱引知其本末。 言人初生是为赤子，赤子之心未尝有不善，只因年渐长成，眼中见色，耳中闻声，鼻中嗅香，舌中知味，贪爱不息，习染渐深，是以情牵欲蔽，与道相违。 人若能清其心，静其性，明其善，复其初，一念不生，诸尘不染，自然清静，与道合真矣。 老君曰：大道无形，生育天地； 大道无情，运行日月； 大道无名，长养万物。 道生，自然。 大道者，至虚无体，本无形、无情、无名也。 当浩劫之始，已有梵清景三气，太清、太微、太素，隐而无象，溟溟涬涬，辽廓无光，一混沌而已。 浑是阴气，里外虚中，有个乾健不息之理，蟠旋而极，是有一阳初动于中，便生奇耦，分阴分阳，生育天地。 清气上而为天，浊气下而为地。 天地既判，万物居其中。 阴气出地，而复上升於天，阳炁从天，而复下降於地，阴阳往来，循环不已。 是以日月运行，五炁顺布，四时行焉，故能长养万物。 大则天地，小则微尘，无一物不是道之化育。 善参究者，反身求之，我身即天地。 道虽生我无名，我故名之道也。 《道德经》云：有物混成，先天而生。 寂兮寥兮，独立而不改，周行而不殆，可已为天下母。 吾不知其名，字之曰道，强为之名曰大。 大曰逝，逝曰远，远曰反。 故道大是也。 吾不知其名，强名曰道。 言道者是谁？ 太上言道大冲虚，本无名唤，因不虚立，假形而用。 且夫人身之生也浑沦，是个太极，则天地万物之道总在我身。 心之虚灵，道自归之。 静为性，动为情。 性主乎内，为体； 情运乎外，为用。 体用一源，显微无问，乃曰道。",
      "translated_text": "Holding to the ancient Dao to govern present realities;\nThe hidden Dao goes unmanifest, the humble virtue remains unseen;\nInternally, one consolidates the true and nourishes life;\nExternally, one distances harm and preserves the body.\nMastering antiquity and comprehending the present, no principle remains obscure.\n\nTo the east, he instructed Confucius, eliciting the sigh of \"like a dragon\";\nTo the west, he transformed as the Golden Immortal, and the earth resounded with the lion’s roar.\nHe expounded the *Five Thousand Words of the Dao and Virtue*, bestowing them upon Yin Xi.\nThrough successive ages, he manifested transformations to propagate the Dao and its teachings.\n\nPerceiving that worldly people, lost in greed and delusion, had strayed from their original true nature,\nhe composed the *Classic of Purity and Stillness*, making it the foremost of all scriptures.\nIts words are simple yet its Dao profound,\nrevealing the causes of life and death,\nreviving the mystic wind,\nguiding people toward the Dao,\nand leading them to comprehend the principle of the three lives and the truth of undying through ten thousand kalpas.\n\nI have long studied this classic but failed to grasp its essence.\nRecently, through my teacher’s enlightenment, my heart was opened,\nand I readily attained the true and constant origin of creation.\nOnly then did I recognize the subtlety of Fuxi’s trigrams\nand understand the praise of the Sage Confucius for the *Book of Changes*.\nProbing the Golden Immortal’s prajñā wisdom, it aligns perfectly like tallying tokens.\n\nThe Supreme One’s sageliness transcends life and death, standing alone,\nspanning past and present without peer.\nThus, the hundred kings took him as their model, and successive sages transmitted his teachings.\nThose who deem it a doctrine of emptiness and heterodoxy\nare those who, lacking the sagely method, oppose the Sage.\n\nThe Dao is not distant from humanity; it is people who distance themselves from the Dao.\nThose who attain it may transform the foolish into the wise, the turbid into the clear.\nThose who cultivate it may transmute stone into gold, the ordinary into the sagely,\nrising beyond the three realms to become eternal Upper Immortals—how wondrous indeed!\n\nWith my limited insight, I have taken this scripture,\nannotated each section with the words of former sages and worthies,\nand compiled diagrams to interconnect the commentary,\nelucidating its depths and broadening its connections,\nso that with a single glance, all may be clearly seen.\nThough my words may be coarse, they do no more than directly explicate its meaning.\nI dare not claim this as definitive; may those of like mind judge it.\n\n*Preface by Wang Jie Daoyuan, the Master of Primordial Chaos*\n\n*Diagrammatic Annotations and Exegesis of the Supreme Lord Laozi’s Wondrous Classic of Constant Purity and Stillness*\n*Compiled and Annotated with Diagrams by Wang Jie Daoyuan, the Master of Primordial Chaos*\n\n\"Supreme\" (*Tai*)—nothing greater can be called Supreme.\n\"Upper\" (*Shang*)—nothing beyond can be called Upper.\n\"Lao\" (*Old*)—the Dao is revered, virtue esteemed, enduring through antiquity.\n\"Lord\" (*Jun*)—the master, the one spirit that governs all things.\n\"Expounds\" (*Shuo*)—to enlighten and transform.\n\"Constant\" (*Chang*)—the true and unchanging Dao.\n\"Purity\" (*Qing*)—utter emptiness, without form.\n\"Stillness\" (*Jing*)—absolute purity, without admixture.\n\"Wondrous\" (*Miao*)—the mystery within the mystery.\n\"Classic\" (*Jing*)—the constant Dao of Heaven, the heart of humanity; also, the path all people traverse.\n\nThe Supreme One, seeing that people lived amidst the turbidity of the kalpa,\nclinging to sensory desires and obscuring their original nature,\ngrieved over the loss of the Dao.\nThus, of necessity, he expounded the *Classic of Purity and Stillness* to enlighten the world,\nguiding them to know their origin and end.\n\nWhen a person is first born, they are as an infant.\nThe infant’s heart harbors no unkindness;\nonly as years pass and they mature,\nseeing forms with their eyes, hearing sounds with their ears,\nsmelling fragrances with their nose, tasting flavors with their tongue,\ndo greed and attachment arise without cease,\nand the stains of habit grow deeper.\nThus, emotions entangle and desires obscure, diverging from the Dao.\n\nIf one can purify the heart, still the nature,\nillumine the good, and return to the origin,\nso that not a single thought arises and no dust clings,\none naturally attains purity and stillness,\nmerging with the true Dao.\n\nLaozi said:\nThe Great Dao is formless, yet it gives birth to Heaven and Earth;\nThe Great Dao is passionless, yet it moves the sun and moon;\nThe Great Dao is nameless, yet it nurtures the myriad things.\n\nThe Dao gives birth to spontaneity.\nThe Great Dao is utter emptiness, without form, without passion, without name.\nAt the dawn of the vast kalpa,\nthere already existed the Three Qi of Brahma Purity: Supreme Clarity, Supreme Subtlety, and Supreme Simplicity,\nhidden and without image,\nvast and boundless, without light,\na single chaos alone.\nAll was yin *qi*, empty within and without,\nyet containing the principle of firm and ceaseless activity.\nCoiling and revolving to its utmost,\na single yang first stirred within,\ngiving rise to the odd and even,\ndividing into yin and yang,\nand birthing Heaven and Earth.\nThe pure *qi* ascended to become Heaven; the turbid *qi* descended to become Earth.\nOnce Heaven and Earth were separated, the myriad things dwelt between them.\nYin *qi* emerged from Earth and ascended to Heaven;\nyang *qi* descended from Heaven to Earth.\nYin and yang circulated endlessly.\nThus, the sun and moon moved, the Five *Qi* spread in order,\nthe four seasons proceeded,\nand the myriad things were nurtured.\nFrom the vastness of Heaven and Earth to the tiniest speck of dust,\nnot a single thing is not transformed and nourished by the Dao.\nThose who skillfully investigate return to themselves to seek it—\ntheir own body is Heaven and Earth.\nThough the Dao that gave birth to me has no name,\nI name it the Dao.\n\nThe *Classic of the Dao and Virtue* says:\nThere is a thing, chaotically formed, born before Heaven and Earth.\nSilent, empty, it stands alone and does not change,\ncirculating without cease—\nit may be called the Mother of the world.\nI know not its name; I style it the Dao, and by force call it Great.\nGreat means it departs; departing means it is distant; distant means it returns.\nThus, the Dao is great indeed.\n\nI know not its name; by force, I call it the Dao.\nWho speaks of the Dao? The Supreme One says the Dao is great and profoundly empty,\noriginally without name or designation.\nYet, as it cannot stand void, it assumes form and function.\nMoreover, the birth of the human body is a chaos—\na single Supreme Ultimate,\nfor the Dao of Heaven, Earth, and the myriad things is wholly within this body.\nThe heart’s emptiness and numinosity—\nthe Dao naturally returns to it.\nStillness is the nature; movement is the emotion.\nThe nature abides within as the essence;\nthe emotions operate without as the function.\nEssence and function share a single source;\nthe manifest and the subtle are without distinction—\nthis is called the Dao.",
      "overlap_context": ". His mother grasped a plum tree, and he emerged from her left side, his hair and beard already hoary, his countenance like that of a child. Thus, he took Li as his surname, was named Er with the courtesy name Boyang, and was posthumously styled Dan, known as Laozi.\n\nIn the time of King Wen of Zhou, he served as Archivist of the Royal Treasury; under King Wu, he was promoted to Historian Beneath the Pillars. He embraced simplicity, held to the uncarved, diminished thought, and restrained desire.",
      "start_char": 387,
      "end_char": 1608,
      "start_sentence": 15,
      "end_sentence": 77,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.46716904640198,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\太上老君说常清静妙经纂图解注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "道之为言，精气化形，神虚今妙，岂可以知其名也？ 若不言道，何以呼之？ 是不以已，强名称之曰道也。 《道德经》云：道为物，惟恍惟惚。 惚兮恍兮，其中有象； 恍兮惚兮，其中有物； 窈兮冥兮，其中有信。 故颜子欺圣人之道曰，仰之弥高，钻之弥坚，瞻之在前，忽然在后。 是以易存无体，神化无方，此之谓也。 夫道者，有清有浊，有动有静。 天清地浊，天动地静； 男清女浊，男动女静。 降本流末，而生万物。 气化，生形。 夫道之为物，虚而无象，因气化而有道之名。 道生于一，一生于二，二气感合而生万物，理自然也。 道居天地之先，包含覆载，寂静无名，乃曰无极之真也。 无极之中道因虚极而已，阳发而遂通，无极而太极，是二五之精妙合而凝也。 太极动而生阳，静而生阴。 阳清而为天，主於动； 阴炁浊而为地，主於静。 天覆於地，地载於天，天动地静，二气互交。 阳气先者为阳道，阴炁先者为阴道。 《易系》 所谓乾道成男，坤道成女。 男体天故清、故动，女体地故浊、故静。 男女相感，阴阳翕畅，泄其真精，降本流末，而生万物。 万物之生，同此之理，炁质化行，各从其类，生生化化，则道无不一焉。 孔云：君子之道，造端乎夫妇，及其至也，察乎天地。 是以顺则生人、生物，逆则成佛、成仙。 周子作《太极图》，深得其旨矣。 是故斯经尊妙，只此数语，已了一本《周易》。 以丹道言之，天地喻炉鼎，男女喻坎离，以乾刚运阳火不息，乃曰天清、男动； 以坤柔退阴符而混藏，乃曰地浊、女静。 因阴阳有动静之机，故用抽坎填离，返本还源而复道，是降其本而流其末，生养吾身之万物也。 有何疑哉？ 清者浊之源，动者静之基。 返本还源。 清者，元阳祖气也； 浊者，幻形阴气也。 动者，阳之灵也； 静者，心之地也。 言人之生也，四大一身皆属阴，唯有此一点元阳祖气在人身天地之正中，乃曰命蒂。 有蒂则有根，根深而蒂自固，精乃为根，气乃为蒂，神为根蒂之主灵。 达斯理者，可以全真，自然精全而能化气，气全而能化神，神全而能化虚，虚空独立而无死生。 当作丹之用，以性内运，以情外移，乃曰清者浊之源。 以戊己二土摄回十方之气而臻灵，乃曰动者静之基。 此妙存乎口诀。 人能常清静，天地悉皆归。 心要在腔子里。 常者，平常也。 清者，万缘顿息也。 静者，一念不生也。 言人能於每日平常二六时中行住坐卧，收其放心，存其良心，内不出，外不入，一心空澈，唯道为身，自然欲忿不生，神自清而气自静，性自住而命自停，则天地之道总归於我身矣。 孔子曰：道也者，不可须臾离也，可离非道也。 又语云：君子无终食之问违仁，造次必於是，颠沛必於是。 尧授道与舜曰，惟精惟一，允执厥中，是也。 夫人神好清而心扰之，动念即乖。 神者，人身中之元神也。 神为万物至灵，虚含洞妙。 自旷劫至今不曾添( )，不曾减( )，本无其清，亦无其浊，是自然之妙也。 白紫清真人曰：此神非是思虑神，乃与元始相比肩。 大则包地包天，小则藏诸一粟，朗朗澈，岂可以有好清也。 若以神思神，便非神也。 何况神去好清，却不知被清字缚住，则心地愈生杂念，扰之不宁也。",
      "translated_text": "The term *Dao* speaks of essence and qi transforming into form, spirit’s emptiness and wondrous subtlety—how could one know its name? Yet if we do not speak of the Dao, by what shall we call it? Thus, not by our own will, we forcefully name it the Dao.\n\nThe *Daodejing* says: The Dao as a thing is only dim and vague. Vague indeed, dim indeed—within it there are images; dim indeed, vague indeed—within it there are things. Dark and deep indeed—within it there is truth. Thus, Yanzi, when speaking of the sages’ Dao, said: Look up at it, and it grows ever higher; delve into it, and it grows ever firmer. Glimpse it ahead, and suddenly it is behind. This is why the *Yijing* preserves what has no form, and spirit’s transformations have no fixed direction—such is the meaning here.\n\nThe Dao possesses clarity and turbidity, movement and stillness. Heaven is clear, Earth turbid; Heaven moves, Earth is still. Man is clear, woman turbid; man moves, woman is still. Descending from root to branch, it gives birth to the myriad things. Qi transforms, giving rise to form.\n\nThe Dao as a thing is empty and without image; it is only through qi’s transformations that the name *Dao* arises. The Dao is born from the One; the One is born from the Two. The Two qi interact and unite to generate the myriad things—this is the principle of nature.\n\nThe Dao dwells before Heaven and Earth, encompassing and sustaining all. Silent and nameless, it is called the True of the Limitless. Within the Limitless, the Dao arises from utmost emptiness. Yang emerges and flows freely—from the Limitless comes the Supreme Ultimate. This is the wondrous union and coagulation of the Two and the Five.\n\nThe Supreme Ultimate moves and generates yang; it is still and generates yin. Yang is clear and becomes Heaven, governing movement; yin qi is turbid and becomes Earth, governing stillness. Heaven covers Earth, Earth bears Heaven; Heaven moves, Earth is still—the Two qi intermingle. When yang qi takes precedence, it is the yang Dao; when yin qi takes precedence, it is the yin Dao. As the *Yijing* says: The Qian Dao forms man; the Kun Dao forms woman. Man embodies Heaven, thus clear and moving; woman embodies Earth, thus turbid and still. When man and woman interact, yin and yang harmonize and flow freely. Their true essence is released, descending from root to branch, giving birth to the myriad things.\n\nThe birth of all things follows this same principle. Qi and substance transform and act, each according to its kind. In ceaseless generation and transformation, the Dao is never not one. Confucius said: The noble person’s Dao begins with husband and wife; at its utmost, it is discerned in Heaven and Earth. Thus, following the natural order gives rise to humans and things; reversing it leads to Buddhahood and immortality. Master Zhou’s *Taiji Diagram* deeply grasped this essence.\n\nTherefore, this scripture’s profound subtlety lies in these few words, which already encompass the entirety of the *Zhouyi*. Speaking in terms of the elixir path: Heaven and Earth serve as furnace and cauldron; man and woman as Kan and Li. Qian’s firmness moves the yang fire without cease—this is Heaven’s clarity and man’s movement. Kun’s softness retreats with the yin tally, concealing and storing—this is Earth’s turbidity and woman’s stillness. Because yin and yang possess the mechanism of movement and stillness, one draws from Kan to fill Li, returning to the root and reverting to the source—thus descending from the root and flowing to the branch, nurturing the myriad things of one’s body. What doubt could there be?\n\nClarity is the source of turbidity; movement is the foundation of stillness. Returning to the root and reverting to the source: Clarity is the primordial yang, the ancestral qi; turbidity is the illusory form, the yin qi. Movement is the numen of yang; stillness is the ground of the heart.\n\nSpeaking of human birth: the Four Great and the entire body belong to yin. Only this single point of primordial yang, the ancestral qi, resides at the center of the human body’s Heaven and Earth—this is called the *ming* stem. Where there is a stem, there is a root. When the root is deep, the stem is naturally firm. Essence is the root; qi is the stem; spirit is the numinous master of root and stem. One who comprehends this principle can preserve the True. Naturally, when essence is complete, it transforms into qi; when qi is complete, it transforms into spirit; when spirit is complete, it transforms into emptiness. Emptiness stands alone, beyond life and death.\n\nWhen employing this in elixir practice: move inwardly with nature, shift outwardly with emotion—this is what is meant by “clarity is the source of turbidity.” With the two earths, Wu and Ji, gather the qi from all directions to attain numinosity—this is what is meant by “movement is the foundation of stillness.” This wondrous secret lies in the oral instructions.\n\nIf one can constantly maintain clarity and stillness, Heaven and Earth will all return to you. The heart must reside within the cavity. “Constant” means ordinary; “clear” means all conditions suddenly cease; “still” means not a single thought arises. If one can, in the ordinary course of daily life—whether moving, dwelling, sitting, or lying down—gather the scattered mind, preserve the good heart, neither allowing the inner to depart nor the outer to enter, and keep the heart utterly empty, taking the Dao as one’s body, then naturally desires and anger will not arise. Spirit will become clear of itself, and qi will become still of itself. Nature will abide of itself, and *ming* will halt of itself. Then the Dao of Heaven and Earth will all return to one’s body.\n\nConfucius said: The Dao is that from which one cannot be separated even for an instant; what can be separated is not the Dao. Another saying goes: The noble person does not, even for the time of a single meal, depart from benevolence. In haste, one must be thus; in turmoil, one must be thus. Yao transmitted the Dao to Shun, saying: Only be refined, only be unified, and truly hold fast to the center—this is it.\n\nThe human spirit loves clarity, yet the heart disturbs it. To entertain a thought is already to deviate. Spirit is the primordial spirit within the human body. Spirit is the utmost numen of the myriad things, empty and wondrously profound. From the beginningless kalpa until now, it has never increased or decreased. It is inherently neither clear nor turbid—this is the wonder of nature.\n\nThe Perfected One Bai Ziqing said: This spirit is not the spirit of thought; it is comparable to the Primordial Beginning. Vast, it encompasses Heaven and Earth; small, it hides within a grain of millet. Bright and penetrating, how could it have a preference for clarity? If one thinks with spirit, it is no longer spirit. How much less can spirit depart to seek clarity? Yet one does not realize that the word “clarity” binds it, causing the mind-ground to generate ever more杂念, disturbing it without cease.",
      "overlap_context": " and function.\nMoreover, the birth of the human body is a chaos—\na single Supreme Ultimate,\nfor the Dao of Heaven, Earth, and the myriad things is wholly within this body.\nThe heart’s emptiness and numinosity—\nthe Dao naturally returns to it.\nStillness is the nature; movement is the emotion.\nThe nature abides within as the essence;\nthe emotions operate without as the function.\nEssence and function share a single source;\nthe manifest and the subtle are without distinction—\nthis is called the Dao.",
      "start_char": 1608,
      "end_char": 2833,
      "start_sentence": 78,
      "end_sentence": 141,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.097092628479004,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\太上老君说常清静妙经纂图解注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "《道德经》云，其出弥远，其知弥少，是也。 人心好静而欲牵之。 法出奸生。 心即神也，神即心也。 欲者，私念也。 牵者，引去也。 言人之良心本来空寂之妙，不动不静，非思非言。 一法不立，万法昭然，有何静可好？ 达磨曰：不思善，不思恶，只恁么地。 孔子曰：喜怒哀乐未发谓之中，发而皆中节谓之和。 中也者，天下之本也。 和也者，天下之达道也。 是以圣人得心法相传，故能安心如是，浑然天理，无有挂碍也。 人虽有贤哲之资，不得真师口诀，则心无栖泊之地。 存之则有，不存则无，只是把捉其心，私意揣度。 圣人之道亦以其心好静，被静缚住，却不知众欲已牵引良心出於万里之远矣。 岂圣人三返回灵，复其见天地之心也哉。 於此宜玩味。 常能遣其欲而心自静，澄其心而神自清，自然六欲不生，三毒消灭。 克己复礼。 六欲者，眼、耳、鼻、舌、身、意也。 三毒者，贪嗔痴也。 人身之中有三尸之神，其名曰彭琚、彭踬、彭蹻，是为三魂。 人有念头不正者，魂神即令人驰聘错乱，贪着邪淫，入於鬼道，丧本迷真。 《度人经》所云，鬼道易邪是也。 世人若能解悟四大一身，是地、水、火、风假合而有此幻形，到头终有败坏，睹其万物之有形者，无不同此之理，我则从今不贵其物，唯究一心。 心为一身之宝。 心是地，性是君，君来心地上居住，主宰万机，常存渊默之真。 此灵不随世变，一切物欲尽能遣之，自然心自静而神自清，六欲不生而三毒自消灭矣。 《道德经》云，圣人为腹不为目，故去彼取此，是也。 所以不能者，为心未澄、欲未遣也。 自家人生天地之间，风土不同，则命禀各有殊异。 性非不灵也盖因受气之浊性，天常如黑云之蔽，所以眼见耳听、鼻闻、舌味，对境触物随穷所漏，放其心而不知返也。 元神昏散，故不能复其本真，而自堕冥劫者，为心不能澄也，欲不能遣也。 能遣之者，内观於心，心无其心； 外观於形，形无其形； 远观於物，物无其物。 三者既悟，唯见於空。 虚灵不眛。 此一节言学人能直下悟见，绝欲清源，立志如山之不动，虽傍柳随花倚染於我，内则观於心，心亦忘也； 外则观於形，形亦忘也； 远则观於物，物亦忘也。 既悟三者都忘，唯见身中是一个太虚，清清朗朗，广大无边，不知天地为我，亦不知我为天地。 行功至此地位，方见其空之妙。 是谓案非可象，物非可物。 《道德经》云：视之不见名曰夷； 听之不闻，名曰希； 搏之不得，名曰微。 此三者不可致诘。 《易□艮卦》云，艮其背，不获其身； 行其庭，不见其人，是也。 观空以空，空无所空； 虚无生有。 所空既无，无无亦无； 大道无形。 无无既无，湛然常寂； 神气合一。 寂无所寂，欲岂能生？ 易相无体。 欲既不生，即是真静。 与道合真。 此一节乃承上云，三者既悟，唯见於空，恐人着在顽空上存意，故於此发明观空以空，空无所空，乃谓要人活泼泼地，当性天无欲之时，吾以观其徼。 《道德经》谓此两者同出而异名，同谓之玄也所空亦无，无无亦无者，此言既得复道还空，空气清朗，广大虚寒无际，实无象之可观也。 无无际无，湛然常寂者，此言既得一切忘尽，则吾身自然真一常存也。 寂无所寂，欲岂能生者，此言性非死寂，我但随应变，无住於相，如是降伏其心，岂能生也。",
      "translated_text": "The *Daode Jing* states: \"The farther one goes forth, the less one knows\"—this is so. The human mind favors stillness, yet desires pull it away. Where methods arise, deceit is born. The mind is spirit; spirit is the mind. Desire is private thought; \"pull\" means to lead astray. The inherent goodness of the mind is originally the wonder of emptiness and quiescence—neither moving nor still, beyond thought and speech. With no dharma established, all dharmas are luminously manifest—what stillness is there to favor? Damo said: \"Neither think of good nor think of evil, just be thus.\" Confucius said: \"Before joy, anger, sorrow, and pleasure are aroused, it is called the Center; when aroused and all in due measure, it is called Harmony. The Center is the root of the world; Harmony is the Dao/Way that pervades the world.\" Thus, the sages transmitted the mind-dharma to one another, enabling them to settle the mind in this way, merging with the celestial principle and free from all obstructions.\n\nThough one may possess the endowment of a worthy or sage, without the oral instructions of a true teacher, the mind has no place to rest. If one preserves it, it exists; if one does not, it vanishes—merely grasping at the mind with private conjectures. Even the Dao/Way of the sages is such that if the mind favors stillness, it becomes bound by stillness, unaware that the myriad desires have already led the good mind ten thousand miles away. How could one, through thrice returning to the numinous, recover the mind that sees Heaven and Earth? This is a point worthy of deep reflection.\n\nIf one can constantly dispel desires, the mind will naturally become still; if one clarifies the mind, the spirit will naturally become clear. Spontaneously, the six desires will not arise, and the three poisons will vanish. \"Restrain the self and return to propriety.\" The six desires are those of the eyes, ears, nose, tongue, body, and intent. The three poisons are greed, anger, and delusion. Within the human body reside the three corpse-spirits, named Peng Ju, Peng Zhi, and Peng Qiao—these are the three hun-souls. When one’s thoughts are impure, the hun-souls immediately cause one to gallop in confusion, indulging in greed and deviant lust, entering the ghostly realm and losing one’s original nature. As the *Scripture of Salvation* states: \"The ghostly realm is easily led astray.\"\n\nIf worldly people can awaken to the fact that the four great elements—earth, water, fire, and wind—temporarily combine to form this illusory body, which will ultimately decay, and perceive that all things with form share this same principle, then from this moment on, they will no longer value external things but will instead investigate the One Mind. The mind is the treasure of the body. The mind is earth; nature is the sovereign. When the sovereign comes to dwell upon the earth of the mind, it governs the myriad affairs, constantly abiding in the true silence of the profound. This numinous essence does not change with the world; it can dispel all desires, so that naturally the mind becomes still and the spirit becomes clear, the six desires do not arise, and the three poisons vanish. The *Daode Jing* states: \"The sage acts for the belly, not for the eyes\"—thus, he discards that and embraces this.\n\nThose who cannot do so fail because their minds are not clarified and their desires are not dispelled. Though people are born between Heaven and Earth, the climate and terrain differ, and thus their endowments vary. Their nature is not inherently dull, but because they receive turbid qi, the celestial constant is obscured like black clouds. Thus, when the eyes see, ears hear, nose smells, and tongue tastes, encountering objects and touching things, they leak through every aperture, letting the mind wander without return. The primordial spirit becomes scattered and dim, unable to recover its original truth, and one falls into the dark kalpas—all because the mind cannot be clarified and desires cannot be dispelled.\n\nThose who can dispel them: inwardly observe the mind, and the mind is no-mind; outwardly observe the form, and the form is no-form; observe things afar, and things are no-things. When these three are awakened to, only emptiness is seen. The numinous is not obscured. This passage speaks of the practitioner who can directly awaken, cut off desires, and purify the source, establishing a resolve as immovable as a mountain. Though one may wander among willows and flowers, being stained by the world, inwardly one observes the mind, and the mind is forgotten; outwardly one observes the form, and the form is forgotten; afar one observes things, and things are forgotten. Having awakened to the forgetting of these three, one sees only that within the body is a great void—clear, bright, and boundless—unaware of Heaven and Earth as oneself, or oneself as Heaven and Earth. Only when cultivation reaches this stage does one perceive the wonder of emptiness. This is called: \"Cases are not to be taken as images; things are not to be taken as things.\" The *Daode Jing* states: \"What cannot be seen when looked at is called *yi*; what cannot be heard when listened to is called *xi*; what cannot be grasped when sought is called *wei*. These three cannot be fathomed.\" The *Yi*’s *Gen* hexagram states: \"Stopping at the back, one does not obtain one’s body; walking in the courtyard, one does not see others\"—this is so.\n\nObserving emptiness with emptiness, emptiness has no emptiness; from nonbeing, being arises. When what is emptied is already nonexistent, even nonbeing is nonexistent—this is the formless Great Dao/Way. When nonbeing is nonexistent, there is only profound stillness; spirit and qi unite as one. When stillness has no stillness, how can desire arise? When images have no substance, desire does not arise—this is true stillness, merging with the Dao/Way in reality.\n\nThis passage continues from the above, where \"the three are awakened to, and only emptiness is seen,\" lest one cling to dead emptiness with intent. Here, it clarifies that observing emptiness with emptiness means that emptiness has no emptiness—urging one to be lively and free, to observe its subtleties when the celestial nature is without desire. The *Daode Jing* calls these two \"emerging from the same source but with different names,\" both termed \"mysterious.\" \"What is emptied is also nonexistent; even nonbeing is nonexistent\" means that once one has returned to the Dao/Way and restored emptiness, the qi is clear and bright, vast and boundless, with no images to observe. \"When nonbeing is nonexistent, there is only profound stillness\" means that once all has been forgotten, one’s true unity naturally abides. \"When stillness has no stillness, how can desire arise?\" means that nature is not dead stillness—one merely responds to changes without abiding in images, thus subduing the mind. How could desire arise?",
      "overlap_context": "ected One Bai Ziqing said: This spirit is not the spirit of thought; it is comparable to the Primordial Beginning. Vast, it encompasses Heaven and Earth; small, it hides within a grain of millet. Bright and penetrating, how could it have a preference for clarity? If one thinks with spirit, it is no longer spirit. How much less can spirit depart to seek clarity? Yet one does not realize that the word “clarity” binds it, causing the mind-ground to generate ever more杂念, disturbing it without cease.",
      "start_char": 2833,
      "end_char": 4097,
      "start_sentence": 142,
      "end_sentence": 206,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.24442672729492,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\太上老君说常清静妙经纂图解注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "欲既不生，即是真静者，此言勤行符火之道，已得梵气臻灵，结成金胎圣贤，阴浊消灭而真道纯阳，打成一片，客尘自不相干，智慧发现，性刚洁如山之嵬然，真静不摇也。 到此田地，方是超凡入圣，与天齐年，岂虚语哉。 真静应物，应物无染。 真常得性。 一念不生，常应常静，万缘顿息。 常清静矣。 智慧圆满。 此一节承上云，欲既不生，即是真静，故次之以真静应物，真常得性。 所谓圣智圆满，性自真静。 凡物之来，随物转应，如盘走珠，圆陀陀地， 转漉漉地，则此心坦荡无碍，自然应物无染而得性矣。 《道德经》云：夫物芸芸，各复归其很。 归根曰静。 复命曰常。 知常曰明。 ； 不知常，妄作，凶。 《金刚经》 云：不应住色生心，不应住声、香、味、触、法生心，应无所住而生其心。 尹喜真人曰：凡物之来，吾皆应之以情，而不对之以心。 孔子曰：君子素其位而行，不愿乎其外。 以此言之，岂不是常应常静、常清静矣。 如此清静，渐入真道。 道者以诚而入。 此以下为化众生向道，或有愚可以智，浊可以清，豁然顿悟种性者，故告戒如此清其心、静其性，不与万缘作对，只恁么修去，革其旧染之污，而日新其德，自然渐入真道矣。 既入真道，名为得道。 我即元始。 此承上云渐入真道，乃谓学者已得觉性之理，於未得师授口传其秘，於此故启喻既入真道，名为得道者，此言真道非是聪明广记，口须三昧讲说之道，实乃是身中三真三全之妙，必拜真师，耳畔一语，直下安心，方入真道。 养性不失其中，修命而运槖钥，不失其筛，自然性命混融，金液流注，是故名为得道也。 虽名得道，实无所得。 本来空寂。 此承上云名为得道，恐学人明理未澈，着在得字求想，则道反背矣，故次之以虽名为得道，实无所得，直欲学人参须实参，悟须实悟。 夫道之为物，大象无形，大音希声，大方无隅，实无名唤。 人身四维上下才着一处存思，便不是也。 又不可离了此身，向外别求。 不可思，不可议，亦非动，亦非静。 一体万殊，万殊一体。 头头物物，总皆现前到这里，转得一语，则铁壁银山，蓦直透过，方是得道。 得之无得，不被相惑，但吾一灵真性觉照，常居象帝之先，朗朗分明处，乃曰真得。 正丹家所谓不见中亲见，见中不见； 不闻中亲闻，闻中不闻。 透得这个破，参学事毕，何得之有？ 为化众生，名为得道。 能悟之者，可传圣道。 一以贯之。 化者，开发也。 众生者，贪着之人也。 此结前云如此清静，渐入真道。 太上以谓天下人物之多，圣凡混杂，是种性难见，其中岂无有根器者，故以道曲折引喻，开化其理，或有利器之人闻吾此说，直下悟见，即得顿脱根尘，唯道为身，向我道中参究不怠，勤而行之，乃曰为化众生，名为得道。 得之为言，本无所得，但为他人说此得字，诱众人必是将心想道而不忘也。 《道德经》曰：善人不善人之师，不善人善人之资。 是以人人本具，无不与我同性，只因贪着其事，乃名曰众生。 若能真个领悟之者，皆可以传於圣道也。 如六祖卢慧能本广东犵狫，一闻客人诵《金刚经》至应无所住而生其心，言下大悟，次后竟至冯母山拜见五祖，问其由，答言如涌泉。 故见其根器大利。",
      "translated_text": "When desire does not arise, this is true stillness—this speaks of diligently practicing the way of the talismanic fire, having attained the pure *qi* of Brahman and reached spiritual refinement, forming the golden embryo of the sage. The yin turbidity dissolves, and the true Dao is purely yang, forged into one whole. Worldly dust no longer intrudes, wisdom manifests, and one’s nature stands firm and immaculate as a towering mountain—true stillness, unshaken.\n\nAt this stage, one transcends the mundane and enters sagehood, attaining a lifespan equal to Heaven—how could this be empty words? In true stillness, one responds to things; in responding to things, one remains unstained. In true constancy, one attains one’s nature. With no thought arising, one constantly responds and constantly abides in stillness, and all entanglements instantly cease. One is ever in pure stillness, and wisdom becomes perfect.\n\nThis passage follows the above, stating that when desire does not arise, this is true stillness, and thus proceeds to *true stillness responding to things* and *true constancy attaining one’s nature*. This is what is meant by sagehood and perfect wisdom—one’s nature is naturally true and still. When things come, one turns and responds with them, like a pearl rolling on a plate, round and smooth, fluid and unobstructed. Thus, the mind is open and unimpeded, naturally responding to things without stain and attaining one’s nature.\n\nThe *Daode Jing* says: \"The myriad things flourish, each returning to its root. Returning to the root is called stillness; returning to one’s mandate is called constancy. Knowing constancy is called illumination. Not knowing constancy, one acts recklessly and courts misfortune.\"\n\nThe *Vajracchedikā Sūtra* says: \"One should not give rise to the mind that abides in form, nor give rise to the mind that abides in sound, scent, taste, touch, or dharmas. One should give rise to the mind that abides nowhere.\"\n\nThe Perfected One Yin Xi said: \"When things come, I respond to them with feeling but do not oppose them with the mind.\"\n\nConfucius said: \"The noble person acts according to his position and does not desire what lies beyond it.\" From this, can it not be seen that one is constantly responding, constantly still, and constantly pure?\n\nThrough such purity, one gradually enters the true Dao. The Dao is entered through sincerity.\n\nWhat follows is for the transformation of sentient beings toward the Dao. Some may be foolish yet can be made wise; some may be turbid yet can be made clear. Suddenly awakening their inherent nature, one thus admonishes them to purify their minds, still their natures, not oppose the myriad entanglements, and simply cultivate in this manner. Shedding their old stains of defilement, they daily renew their virtue and naturally enter the true Dao.\n\nHaving entered the true Dao, this is called *attaining the Dao*. \"I am the Primal Beginning.\" This follows the above, stating that the learner has grasped the principle of awakened nature. Before receiving the secret oral transmission from a teacher, one is thus instructed: having entered the true Dao and being called *attaining the Dao*—this means the true Dao is not the way of cleverness, broad learning, or reciting the three mysteries. It is, in truth, the wondrous work of the three perfections within the body. One must bow to a true teacher, receive a single word at the ear, and directly settle the mind—only then does one enter the true Dao.\n\nNurturing one’s nature without losing its center, cultivating life by moving the bellows without losing the sieve, one’s nature and life naturally merge. The golden elixir flows—thus it is called *attaining the Dao*.\n\nThough called *attaining the Dao*, in reality, there is nothing attained. This follows the above, fearing that learners, though enlightened in principle, may cling to the word *attain* in their seeking, thereby turning away from the Dao. Thus, it proceeds to say that though called *attaining the Dao*, in reality, there is nothing attained—urging learners to investigate thoroughly and awaken truly.\n\nThe Dao as a thing is formless in its great image, soundless in its great tone, and cornerless in its great square. It truly has no name. If one fixes one’s thoughts on any single point of the four directions, above or below, one misses it. Yet one cannot leave this body and seek it externally. It cannot be thought, cannot be discussed, is neither movement nor stillness. The one body is the myriad distinctions; the myriad distinctions are the one body. In every thing and every phenomenon, all is manifest before one. At this point, if one can turn a single phrase, one smashes through iron walls and silver mountains, breaking through directly—only then is it *attaining the Dao*.\n\nAttaining it as non-attainment, not deluded by appearances, one’s single numinous true nature shines forth, ever abiding before the Lord of Images, bright and clear—this is called *true attainment*. As the true elixirists say: \"In non-seeing, one intimately sees; in seeing, one does not see. In non-hearing, one intimately hears; in hearing, one does not hear.\" Penetrating this barrier, the work of inquiry is complete—what attainment could there be? For the sake of transforming sentient beings, it is called *attaining the Dao*.\n\nThose who awaken to this may transmit the sagely Dao. It is all-pervading.\n\nTo transform is to open and develop. Sentient beings are those attached to things. This concludes the above, stating that through such purity, one gradually enters the true Dao. The Most High, seeing the multitude of beings under Heaven, the mingling of sages and commoners, and the rarity of those with inherent nature, thus employs the Dao’s twists and turns to expound and open their understanding. Among them, there may be those of keen capacity who, upon hearing these words, suddenly awaken, instantly shedding the roots of the dust and taking the Dao as their body. Diligently investigating within this Dao without ceasing, they cultivate earnestly—this is called *transforming sentient beings* and *attaining the Dao*.\n\nThe word *attain* originally means nothing is attained. But when speaking this word to others, it is to entice people to keep the Dao in mind without forgetting. The *Daode Jing* says: \"The good person is the teacher of the not-good person; the not-good person is the resource of the good person.\" Thus, all people are inherently endowed, none without the same nature as mine. Only because they cling to things are they called *sentient beings*. If one can truly comprehend this, one may transmit the sagely Dao.\n\nAs with the Sixth Patriarch Huineng of Lu, originally a barbarian from Guangdong, who upon hearing a traveler recite the *Vajracchedikā Sūtra* to *\"give rise to the mind that abides nowhere,\"* suddenly awakened. Later, he went to Mount Fengmu to pay homage to the Fifth Patriarch. When asked the reason, he answered like a gushing spring. Seeing his great capacity, the Fifth Patriarch...",
      "overlap_context": "nexistent\" means that once one has returned to the Dao/Way and restored emptiness, the qi is clear and bright, vast and boundless, with no images to observe. \"When nonbeing is nonexistent, there is only profound stillness\" means that once all has been forgotten, one’s true unity naturally abides. \"When stillness has no stillness, how can desire arise?\" means that nature is not dead stillness—one merely responds to changes without abiding in images, thus subduing the mind. How could desire arise?",
      "start_char": 4097,
      "end_char": 5337,
      "start_sentence": 207,
      "end_sentence": 260,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.47458243370056,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\太上老君说常清静妙经纂图解注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "恐人谋害，叱令舂碓，人不为意。 后五祖故令大众作偈，能明心见性，见即付之衣钵。 众皆让首座神秀作偈，神秀述偈四句，未尽其善。 惠能一闻，即次其韵曰：菩提无有树，明镜亦非台。 本来无一物，何处惹尘埃？ 五祖暗点头，约其夜半付中堂，以袈裟围绕其身，将《金刚经》诵至应无所住而生其心，於此印传心法，授与衣钵，而复送之过江，遂为一代祖师。 此所以人不可以形观，当以志看。 如马丹阳度任屠，始则为凶人，一旦醒悟，即为善人。 以此论之，岂不是能悟之者，可传圣道也欤？ 太上老君曰： 此名太上者，乃真人称述之辞。 前之所言道也，於此以下又起个名唤，所言者德也。 《道德经》所谓德者同於德，失者同於失，故有上士、下士之不同也。 学者宜具只眼看。 上士无争，下士好争； 各见不同。 上士者，圣人大德之谓也。 下士者，贤人执着之谓也。 圣人之心，浑同天理，无分贤愚皆包之，和光混俗，与众同尘，谦躬处於卑下，锉锐埋锋，不露圭角。 善者善之，不善者亦善之。 行不言之教，处无为之事，与人无辩无争，乃曰上士也。 贤人之心有所执着，以谓人之学皆不如己之学，自是自彰，自矜自伐。 论其古之贤哲，则谓其曰长，某曰短； 论其今之人，孰曰是，孰曰非。 成仙成佛之圣，犹非其虚无寂灭异端之学如是好争，乃曰下士也。 尹喜曰：圣人龙之，贤人蛟之，龙能化蛟，蛟终不能化龙，此之谓也。 上德不德，下德执德。 执着之者，不名道德。 谦德者全，执德者偏。 上德者，无为之道也。 下德者，有为之道也。 执者，执着不通之谓。 德者，得也。 心之所蓄，性之混融，开物成务之理也。 此言上德之圣人未尝显己之有德，藏身潜迹，抱朴含光，专气致柔，如婴儿也。 下德之贤人执着其事，唯於世情是非、得失之场理论，扬於己德，以被聪明所蔽，故分其彼此贵贱、高低，如是执着，故不明其有道德也？ 《道德经》不云乎：上德不德，是以有德； 下德不失德，是以无德。 上德无为而无以为，下德为之而有以为。 故太上所谓我有三宝，保而持之，一曰慈，二曰俭，三曰不敢为天下先。 孔子曰：圣吾不能，我但述而不作，信而好古，窃比於我老彭。 默而识之，学而不厌，诲人不倦，何有於我哉？ 终不曾言自已之有德。 以此言之，岂不是上德不德也。 下德执德之人，着形所见，其於政事、文章、诗词、方术有能其一者，便自高大、夸逞其能，执着一偏之见，岂可以明道德也。 以尧舜之圣，善与人同，以大禹之明，闻一善言即拜，何尝执着？ 学人宜於此详味。 太上老君曰：众生所以不得真道者，何以故？ 为有妄心。 求生之厚。 此一节又题太上之名者，乃真人称述，警戒世人，於此着眼看众生所为之事。 所谓众生者，乃愚昧贪着之人，形须人身，心实乃是兽，性海黑暗，逐浪贪生，全无一分德行。 上不畏君王之法，下不惜父母之身，盗窃奸欺，靡所不至。 所以不得真道者，为其有妄想之心，私欲交蔽，则道愈失之矣。 《道德经》云：大道甚夷，而民好径，朝甚除，田甚芜，仓甚虚，服文彩，带利剑，厌饮食，财货有余，是谓盗夸，非道也哉。 又云：民不畏威则大威至。 无狭其所居，无厌其所生。",
      "translated_text": "Fearing others might plot against him, the Fifth Patriarch rebuked Huineng and ordered him to pound rice, so no one paid him any mind. Later, the Fifth Patriarch deliberately instructed the assembly to compose verses; whoever could clarify the mind and perceive the nature would be entrusted with the robe and bowl. All deferred to the head monk Shenxiu to compose a verse. Shenxiu’s four-line verse did not fully capture the essence. Upon hearing it, Huineng immediately followed its rhyme and said:\n\n*Bodhi has no tree,*\n*The bright mirror is not a stand.*\n*Originally, not one thing exists—*\n*Where could dust alight?*\n\nThe Fifth Patriarch nodded in secret and arranged to meet him in the central hall at midnight. Surrounding Huineng with his robe, he recited the *Vajracchedikā Sūtra* up to *\"give rise to the mind that abides nowhere.\"* There, he transmitted the mind-Dharma, bestowed the robe and bowl, and then sent him across the river, thus becoming the Patriarch of an age. This shows that one must not judge by appearance but by aspiration. Like Ma Danyang converting Ren the butcher—first a violent man, upon sudden awakening, he became virtuous. From this, can we not see that those who awaken may transmit the sagely Dao?\n\nThe Most High Lord Lao said: This title \"Most High\" is how the perfected ones refer to him. What was previously called the Dao hereafter takes another name: what is spoken of is virtue. The *Daode Jing* says that virtue aligns with virtue, while loss aligns with loss—hence the distinction between superior and inferior scholars. Learners should observe with a discerning eye.\n\nThe superior scholar does not contend; the inferior scholar loves contention—their views differ. The superior scholar is what we call a sage of great virtue. The inferior scholar is what we call a worthy clinging to attachments. The sage’s mind merges with Heaven’s principle, embracing all without distinction between wise and foolish. Blending light with the common, dwelling among the dust, humbling himself in lowliness, he files down sharpness and buries his brilliance, never revealing his edges. He treats the good with goodness and the not-good with goodness. Practicing the teaching without words, engaging in affairs without action, he disputes nothing with others—this is the superior scholar.\n\nThe worthy’s mind clings to attachments, believing others’ learning is inferior to his own. Self-righteous and self-displaying, self-praising and self-boasting, he judges the ancient worthies, calling some long and others short; he evaluates contemporaries, declaring some right and others wrong. Even the sages who become immortals or buddhas—let alone his own heterodox learning of emptiness and extinction—are not spared his contention. This is the inferior scholar.\n\nYin Xi said: The sage is like a dragon; the worthy, like a flood-dragon. A dragon can transform a flood-dragon, but a flood-dragon can never become a dragon—this is what is meant.\n\nSuperior virtue does not claim virtue; inferior virtue clings to virtue. Those who cling cannot be called virtuous. Humble virtue is whole; clinging virtue is partial.\n\nSuperior virtue is the Dao of non-action. Inferior virtue is the Dao of action. *Clinging* means obstinate and unyielding. *Virtue* means attainment—the principle of what the mind stores, the blending of nature, the unfolding of things, and the accomplishment of affairs.\n\nThis speaks of the sage of superior virtue, who never displays his own virtue. Concealing himself and hiding his traces, embracing simplicity and containing his light, concentrating his qi to attain softness, he is like an infant. The worthy of inferior virtue clings to affairs, endlessly debating worldly matters of right and wrong, gain and loss. Boasting of his own virtue, blinded by his own cleverness, he divides things into self and other, noble and base, high and low. Thus clinging, how can he understand true virtue?\n\nDoes not the *Daode Jing* say: *Superior virtue does not claim virtue, and thus possesses virtue; inferior virtue never loses virtue, and thus lacks virtue.* Superior virtue acts without acting; inferior virtue acts with deliberate action.\n\nThus, the Most High said: *I have three treasures to preserve and uphold: first, compassion; second, frugality; third, not daring to be first in the world.*\n\nConfucius said: *A sage I cannot be, but I transmit rather than innovate, trusting and loving the ancients. I humbly compare myself to Lao Peng. Silently I comprehend, learning without tiring, teaching without wearying—what do I possess?* He never once spoke of his own virtue. From this, can we not see that superior virtue does not claim virtue?\n\nThe inferior scholar who clings to virtue, judging by outward appearances, may excel in governance, literature, poetry, or esoteric arts—yet he becomes arrogant, flaunting his abilities, obstinately holding to one-sided views. How can he illuminate the Dao?\n\nEven the sages Yao and Shun shared goodness with others, and the enlightened Yu, upon hearing a single good word, would bow—when did they ever cling? Learners should ponder this deeply.\n\nThe Most High Lord Lao said: Why do sentient beings fail to attain the true Dao? Because they harbor deluded minds and seek excessive longevity.\n\nThis passage again invokes the name of the Most High, as the perfected ones warn the world to observe the conduct of sentient beings. *Sentient beings* refers to those who are ignorant and clinging—outwardly human in form, yet inwardly beast-like in heart. Their nature is a dark sea, chasing waves of desire, utterly devoid of virtue. They neither fear the laws of kings above nor cherish the bodies of parents below, engaging in theft, deceit, and every kind of villainy. They fail to attain the true Dao because their deluded minds are clouded by selfish desires, and thus the Dao slips further away.\n\nThe *Daode Jing* says: *The great Dao is level, yet the people prefer byways. The court is excessively adorned, the fields excessively overgrown, the granaries empty. They wear embroidered robes, carry sharp swords, gorge on food and drink, and hoard excess wealth—this is called the boasting of thieves. Is this not far from the Dao?*\n\nIt also says: *When the people do not fear authority, greater authority will come. Do not constrict their dwellings; do not oppress their livelihood.*",
      "overlap_context": "o things are they called *sentient beings*. If one can truly comprehend this, one may transmit the sagely Dao.\n\nAs with the Sixth Patriarch Huineng of Lu, originally a barbarian from Guangdong, who upon hearing a traveler recite the *Vajracchedikā Sūtra* to *\"give rise to the mind that abides nowhere,\"* suddenly awakened. Later, he went to Mount Fengmu to pay homage to the Fifth Patriarch. When asked the reason, he answered like a gushing spring. Seeing his great capacity, the Fifth Patriarch...",
      "start_char": 5337,
      "end_char": 6571,
      "start_sentence": 261,
      "end_sentence": 317,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.849239587783813,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\太上老君说常清静妙经纂图解注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "夫唯不厌，是以不厌。 如是之徒，至死不悔，其心犹念未足，辗转作下轮回种子，皆由一个妄心迷失真道也如此。 既有妄心，即惊其神； 被他欺下。 此承上云，因眼见於色，神即领受在心； 心既领受，遂起妄念，本身元神化为识神； 神随境乱，意逐情迷。 《道德》云：所谓驰骋田猎，令人心发狂； 难得之货，令人行妨。 是以即惊其神也。 皆因心君不能为主，被色相眩惑，耗散其真道，则梦寐亦不安宁也。 既惊其神，即着万物； 众欲交攻。 此言神想於物则心地自不安神故，有惊见一物而着爱於物，被物牵引放纵，不知其乡，是以着万物而不知其厌足也，合身履险亦不知危也。 既着万物，即生贪求； 认贼作子。 此言神着万物，蔽隔真性，随阴魄之营。 营则流情，落於醉生梦死之场，贪求入於爱河欲海之地，无休无息，万绪千头，则终身不救也。 既生贪求，即是烦恼。 自词枷带。 此谓贪求乃入邪道之源矣。 今日贪求，明日贪求，见之者即贪，闻之者即求。 每日种种所得，而心终不知止，却不知已造下烦恼根业，家虽丰足而生贼盗，百计千谋，心放不下。 古人所谓财多累身，所以被他缚住，添个烦恼，而祸起陨身，因自取之也。 烦恼妄想，忧苦身心，便遭浊辱，流浪生死，常沉苦海，永失真道。 着形害了。 此一节总结上云，众生为有妄心，不得真道之故，舍死贪生，作下烦恼种子。 众生之为心，唯求利以厚其生，只图目前家道丰富，沉滞色声香味之场，迷惑有无爱欲之趣，是自取於烦恼妄想，忧苦身心。 平日所为，不忠不孝，欺天瞒人之罪，鬼神暗录其尤。 一旦天灾罪己，祸害刑身，或阳报其恶，或阴罚其愆，是以遭於浊辱，流浪生死，一灵不知，所自化生，异类之中，百千万劫，难获人身，常沉苦海，永失真道也。 世人若能回头鉴此为戒，早参至道之宗，免堕轮回之苦，圣人岂欺我哉？ 真常之道，悟者自得。 得悟道者，常清静矣。 与太虚同体。 真常者，不生不灭也。 无始劫来只恁么也。 悟者，觉悟此理也。 自得者，亲闻见也。 清静者，湛然无染也。 此言人能觉悟自性，本来圆成，不假修合。 始因气化，结形真灵，入壳被形，所罩灵性，於此随气质发现。 故圣贤愚之不同，虽大智不能无下愚之心，然下愚不能无上智之性。 此所以要悟要修。 悟者，性也； 修者，命也。 性命双修，方是自得真常之道。 既得性命混一，道大冲虚，吾心自然清静，无有往而不知，无有来而不应； 内则了证死生，外则能尽人事。 此乃总结斯经一篇首尾之妙。 前言曰道，后言为德，实发《道德经》五千言之骨髓，直欲世人明此道德之理，明道者不有德，乃曰上士，执道者不失德，乃曰下士，妄心贪求者乃曰众生。 故此经末言真常之道，悟者自得，乃太上好生，慈悯众生之苦，多方曲喻，令人早早回头，领悟此道。 或有豁然贯通悟见者，即得常清静矣，岂不玄哉？ 太上老君说常清静妙经慕图解注竟 真人赞 仙人葛玄曰：吾得此道者，曾诵此经万遍。 此经是天人所习，不传下士。 吾昔授之於东华帝君，东华帝君授之於金阙帝君，金阙帝君授之於西王母。 西王母皆口口相传，不记文字。 吾今於世书而录之。 上士悟之，升为天官；",
      "translated_text": "Those who never know satiety are thus never sated. Such people persist until death without remorse, their hearts still craving what they lack. Their restless minds become the seeds of future rebirths, all because a single deluded heart has lost the true Dao. Once delusion arises, the spirit is startled; it is deceived and led astray.\n\nThis follows from what was said above: when the eyes behold beauty, the spirit receives it in the heart. Once the heart receives it, deluded thoughts arise, and the original spirit of the self transforms into the spirit of consciousness. The spirit, scattered by external conditions, follows the mind into confusion. The *Daode Jing* says: *So-called galloping and hunting excite the mind to madness; rare and precious goods obstruct right conduct.* Thus the spirit is startled.\n\nAll this stems from the heart-monarch failing to govern, dazzled by sensory forms. The true Dao is dissipated, and even in dreams, there is no peace. Once the spirit is startled, it clings to the myriad things, assailed by a host of desires. This means that when the spirit fixates on things, the mind-ground is no longer at peace. The spirit, startled by a single thing, becomes attached to it, drawn and ensnared by it, losing all sense of direction. Thus it clings to the myriad things without knowing satiety, even walking into danger without awareness of peril.\n\nOnce it clings to the myriad things, greed and craving arise, mistaking the thief for one’s own child. This means that when the spirit clings to things, the true nature is obscured, and it follows the machinations of the yin-soul. Such scheming leads to emotional indulgence, falling into the realm of drunken stupor and dreamlike existence. Greed draws one into the rivers of love and seas of desire, without rest or respite, entangled in a thousand threads, leading to lifelong ruin.\n\nOnce greed and craving arise, they become afflictions, self-imposed shackles. This is the source of entering the deviant path. Today they crave, tomorrow they crave; seeing, they covet; hearing, they desire. Daily they acquire all manner of things, yet their hearts never know contentment. They do not realize they are planting the roots of affliction and karmic deeds. Though their households may be abundant, thieves and robbers arise. With a hundred schemes and a thousand plots, their minds remain unsettled. As the ancients said: *Wealth burdens the body.* Thus they are bound by it, adding to their afflictions, and calamity strikes, leading to their downfall—all self-inflicted.\n\nAfflictions and delusions torment body and mind, bringing defilement and disgrace. They drift through the cycles of birth and death, forever sinking in the sea of suffering, eternally losing the true Dao. The harm to form is complete.\n\nThis section summarizes the foregoing: sentient beings, because of their deluded minds, fail to attain the true Dao. Clinging to life and fearing death, they plant the seeds of affliction. The hearts of sentient beings seek only profit to enrich their lives, pursuing immediate household abundance. They sink into the realms of form, sound, fragrance, and taste, bewildered by the allure of existence and non-existence, love and desire. They bring upon themselves afflictions, delusions, and the torment of body and mind. In their daily conduct, they are neither loyal nor filial, committing sins of deceiving heaven and cheating others, all secretly recorded by spirits. When heavenly disasters strike or retribution falls, their bodies suffer calamity. Whether in this life or the next, their transgressions are punished. Thus they endure defilement and disgrace, drifting through birth and death. Their solitary spirits, unaware, transform and are reborn among other species. For a hundred thousand kalpas, they struggle to regain human form, forever sinking in the sea of suffering, eternally losing the true Dao.\n\nIf people could turn back and take this as a warning, awakening early to the essence of the supreme Dao, they would avoid the suffering of the wheel of rebirth. Would the sages ever deceive us?\n\nThe Dao of true constancy is attained by those who awaken. Those who awaken to the Dao abide in constant purity, one with the great void. True constancy is neither born nor destroyed. From the beginningless kalpas, it has ever been thus. *Awakening* means realizing this principle; *attaining* means personally witnessing it. *Purity* means clarity without defilement.\n\nThis speaks of how, when one awakens to the original nature, it is inherently complete, requiring no artificial cultivation. Initially, through the transformation of qi, the true spirit coalesces into form, entering the shell and being enveloped by it. The numinous nature thus manifests according to the quality of qi. Hence the differences between sages and fools: even the greatly wise cannot be without the mind of the lowest fool, yet the lowest fool cannot be without the nature of the highest sage. This is why both awakening and cultivation are necessary. *Awakening* pertains to nature; *cultivation* pertains to life. Only when nature and life are cultivated together does one truly attain the Dao of constancy.\n\nOnce nature and life are united, the Dao is vast and profoundly empty. The heart naturally becomes pure and still, knowing all that comes without obstruction, responding to all that arrives without hindrance. Internally, one fully comprehends life and death; externally, one fulfills all human affairs. This concludes the marvelous essence of this scripture from beginning to end. The opening speaks of the Dao, and the closing speaks of virtue, truly distilling the marrow of the *Daode Jing*’s five thousand words. It aims to make people understand the principles of Dao and virtue: those who understand the Dao do not possess virtue—they are called superior persons; those who grasp the Dao do not lose virtue—they are called inferior persons; those with deluded minds and greedy cravings are called sentient beings.\n\nThus, at the end of this scripture, it speaks of the Dao of true constancy, which is attained by those who awaken. This reflects the Most High’s love for life and compassion for the suffering of sentient beings, employing manifold analogies to urge them to turn back early and awaken to this Dao. Some may suddenly penetrate and realize it, attaining constant purity—how wondrous is this!\n\nThe *Most High Lord Lao’s Explanation and Commentary on the Wondrous Scripture of Constant Purity* concludes.\n\n**Eulogy by the Perfected One**\nImmortal Ge Xuan said: I attained this Dao by reciting this scripture ten thousand times. This scripture is practiced by heavenly beings and is not transmitted to inferior persons. I once received it from the Lord of Eastern Florescence, who received it from the Lord of the Golden Tower, who received it from the Queen Mother of the West. The Queen Mother of the West transmitted it orally, without written record. Now, in this world, I have written and recorded it. Those superior persons who awaken to it ascend as heavenly officials...",
      "overlap_context": "rther away.\n\nThe *Daode Jing* says: *The great Dao is level, yet the people prefer byways. The court is excessively adorned, the fields excessively overgrown, the granaries empty. They wear embroidered robes, carry sharp swords, gorge on food and drink, and hoard excess wealth—this is called the boasting of thieves. Is this not far from the Dao?*\n\nIt also says: *When the people do not fear authority, greater authority will come. Do not constrict their dwellings; do not oppress their livelihood.*",
      "start_char": 6571,
      "end_char": 7821,
      "start_sentence": 318,
      "end_sentence": 377,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.50161838531494,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\太上老君说常清静妙经纂图解注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "中士悟之，南宫列仙； 下士悟之，在世长年，游行三界，升谒金门。 此章乃仙黄葛玄赞太上说经之妙，此经非是文字之经。 自旷劫至今，不生不灭，不增不减，为道之径路也。 人身玄关谓之经，行道工夫谓之诵。 诵非口诵，乃用乾坤阖辟之机关，运坎高颠倒之妙用。 昔仙翁感授道之后诵万遍者，行此道也。 万遍乃工夫，行运不绝，绵绵若存也。 得其一粒黍米之珠，落于黄庭，结为空气金胎，如母之育婴，儿神浇灌，十月胎完，天门迸破，阳神出现，千变万化，乃曰真人。 是此经之功德，大不可思议，天人所习之文不可轻传於下士也。 传道传经，传之有德忠孝之人。 轻传之者，叉遭天谴。 张紫阳三度非人，三遭天谴是也。 仙圣每每隐秘此经，唯以口口相传，不记文字，恐天魔之泄慢。 因后人不及古人纯朴者多，若不以文字开化，则众生何由而悟，不得已笔录其经，传流于世。 上士悟之者，勤功修证，升为金阙之仙； 中士悟之者，久久修证，乃为南宫之列仙； 下士悟之者，亦为地仙，在世长寿，隐显莫测，可以道行三界，升谒金门也。 左玄真人曰：学道之士持诵此经者，即得十天善神拥护其人，然后玉符保神，金液炼形，形神俱妙，与道合真。 仙翁重赞此者，老婆心功，剖露是经之秘，实金丹大道之宗，学道之士者，乃诱后来学仙之人也。 所谓持诵者，信受奉行之也。 十天者，流戊就己，戊己二土各五，共成十数，乃曰十天也。 玉符者，符火也。 金液者，神水也。 当其一阳初动之时，便以神归炁，炁归窍，况下海底，去抱出日头来。 是持诵此经也。 流戊土，迫逐金精，上升南宫，继此后用己土敛阳退阴符，同归坤中之位，乃曰即得十天善神拥护其人也。 神安隐，镇气发火，冲逼出其身玉浆金液流注，乃曰然后玉符保神、金液炼形也。 形曰命，神曰性，性合一乃曰道。 故言形神俱妙，与道合真也。 若以世法言，凡有道之人，自有十天善神长拥护其人，岂虚言哉？ 《道德经》 云：入甲兵不被刀刃，入虎兕不被爪牙，是也。 正一真人曰：人家有此经，悟解之者，灾障不干，众圣护门，神升上界，朝拜高尊。 功满德就，相感帝君。 诵持不退，身腾紫云。 此篇乃祖天师张道陵称赞之词。 所谓人家者，非人家之家，乃指人身正中之心也。 此经者，即宝珠也，宝珠即道也。 悟解者，亲得见闻之妙，理当铅见癸生之时，悬宝珠於空中，去地五丈，飞轮旋转诸天星宿，尽入珠口，化炼为丹，此真悟解也。 既得丹凝成片，浩气纯阳，自然灾障不干，乃得诸天众圣暗加神护其身。 是以一身万神也，一气万气也。 丹成之日，脱胎换鼎，移神上居泥丸玉山上京之上，而有三清所居，则吾身朝谒高尊，直待功成行满，乃感帝君而录籍。 身常清静，洁戒精严，行此道诵持不退者，自有天颁勑诏，来征身腾紫云，而白日飞升天阙也。 如汉祖天师诛妖馘祟，葛仙翁祭炼鬼魂，许旌阳斩蛟诛蟒，皆得大功行於世，举家飞升。 学仙之道，诚有之也。",
      "translated_text": "Middle adepts who awaken to it become immortals of the Southern Palace; lesser adepts who awaken to it enjoy long years in the world, roam the Three Realms, and ascend to pay homage at the Golden Gate.\n\nThis eulogy by Immortal Ge Xuan of the Yellow Court praises the wondrousness of the *Most High Lord Lao’s Explanation and Commentary*. This scripture is not a text of written words. From the beginningless kalpas to the present, it is neither born nor destroyed, neither increased nor diminished—it is the direct path of the Dao. The mysterious barrier of the human body is called the \"scripture,\" and the work of practicing the Dao is called \"recitation.\" Recitation is not oral recitation; it is the mechanism of the opening and closing of Heaven and Earth, employing the wondrous function of the inversion of Kan and Li.\n\nWhen the immortal elder was moved to transmit the Dao, those who recited it ten thousand times were practicing this Dao. The ten thousand recitations are the work; the circulation is unceasing, continuous as if present. Obtaining a single grain-of-millet pearl and dropping it into the Yellow Court, it coalesces into the golden embryo of empty qi. Like a mother nurturing an infant, the spirit of the child irrigates it. After ten months, the fetal work is complete; the Gate of Heaven bursts open, and the yang spirit emerges, transforming endlessly—this is called a *Perfected One*. Such are the inconceivable merits and virtues of this scripture, the text practiced by heavenly beings, which must not be lightly transmitted to inferior persons.\n\nThe transmission of the Dao and the scripture must be to those of virtue, loyalty, and filial piety. Those who transmit it lightly will suffer heavenly punishment—such was the case with Zhang Ziyang, who was not human three times and suffered heavenly punishment thrice. The immortals and sages always concealed this scripture, transmitting it only orally, without written record, for fear of the arrogance of heavenly demons. Yet later generations, being less pure and simple than the ancients, would not awaken without the aid of written words. Thus, it was reluctantly recorded and transmitted to the world.\n\nSuperior adepts who awaken to it diligently cultivate and verify it, ascending as immortals of the Golden Tower. Middle adepts who awaken to it cultivate and verify it over time, becoming immortals of the Southern Palace. Lesser adepts who awaken to it become earthly immortals, enjoying long life in the world, their appearances and disappearances unfathomable. They can roam the Three Realms with the Dao and ascend to pay homage at the Golden Gate.\n\nThe Perfected One of the Left Mystery said: Those who study the Dao and uphold this scripture will have the ten heavenly benevolent spirits protect them. Then, the jade talisman secures the spirit, and the golden liquid refines the form. Form and spirit are both wondrous, merging with the Dao in truth.\n\nThe immortal elder’s repeated praise is the work of an old woman’s heart, revealing the secrets of this scripture—it is the essence of the great elixir of the golden pill, guiding later students of immortality. The so-called \"upholding and reciting\" means to faithfully receive and practice it. The \"ten heavens\" arise from the flow of *wu* into *ji*, with *wu* and *ji* each comprising five, totaling ten—hence the \"ten heavens.\"\n\nThe jade talisman is the talisman of fire. The golden liquid is the divine water. At the time of the first stirring of yang, the spirit returns to qi, qi returns to the cavity, and descending to the sea bottom, one embraces and brings forth the sun. This is the upholding and reciting of this scripture. The *wu* earth flows, compelling the essence of metal to ascend to the Southern Palace. Thereafter, the *ji* earth gathers yang and retreats the yin talisman, both returning to the position of *kun*—this is what is meant by \"the ten heavenly benevolent spirits protect the person.\"\n\nWhen the spirit is settled, the fire of stabilized qi surges forth, compelling the jade nectar and golden liquid of the body to flow and irrigate—this is what is meant by \"then the jade talisman secures the spirit, and the golden liquid refines the form.\" Form is called *ming*; spirit is called *xing*. When *xing* and *ming* unite, it is called the Dao. Thus, it is said that form and spirit are both wondrous, merging with the Dao in truth.\n\nIn terms of worldly methods, those who possess the Dao naturally have the ten heavenly benevolent spirits constantly protecting them—how could this be empty words? As the *Dao De Jing* says: \"Entering among weapons, they are not cut by blades; entering among tigers and rhinoceroses, they are not harmed by claws and teeth.\"\n\nThe Perfected One of the Orthodox Unity said: If a household possesses this scripture and one awakens to it, calamities will not approach, the multitude of sages will guard the gate, and the spirit will ascend to the upper realms to pay homage to the exalted ones. When merit is complete and virtue is perfected, one will be summoned by the Imperial Lord. With unwavering recitation and upholding, the body will ascend on purple clouds.\n\nThis passage is the eulogy of the Celestial Master Zhang Daoling. The so-called \"household\" does not refer to a family’s home but to the heart at the center of the human body. This scripture is the precious pearl, and the precious pearl is the Dao. Those who awaken to it personally witness its wondrousness. At the time when lead sees the birth of *gui*, the precious pearl is suspended in the void, five *zhang* above the earth. The revolving wheel of the flying stars of the heavens all enter the mouth of the pearl, transforming and refining into the elixir—this is true awakening.\n\nOnce the elixir congeals into flakes and the vast qi becomes pure yang, calamities naturally do not approach, and the multitude of heavenly sages secretly protect the body. Thus, one body becomes ten thousand spirits; one qi becomes ten thousand qi. On the day the elixir is formed, the embryo is cast off, the cauldron is changed, and the spirit moves to reside above the Mud Pill Palace in the Upper Capital. There, the Three Clarities dwell, and one’s body pays homage to the exalted ones. Only when merit is complete and conduct is perfected does one move the Imperial Lord to record one’s name in the registers.\n\nThose who constantly maintain purity, uphold strict precepts, and unwaveringly practice and recite this Dao will naturally receive a heavenly decree and imperial edict, summoning them to ascend on purple clouds and fly to the heavenly towers in broad daylight. Such was the case with the Celestial Master of the Han, who subdued demons and vanquished evil spirits; Immortal Ge, who performed rituals to refine the souls of the dead; and Xu Jingyang, who slew dragons and beheaded pythons. All achieved great merit in the world, and their entire households ascended. The Dao of learning immortality is indeed real.",
      "overlap_context": "Dao by reciting this scripture ten thousand times. This scripture is practiced by heavenly beings and is not transmitted to inferior persons. I once received it from the Lord of Eastern Florescence, who received it from the Lord of the Golden Tower, who received it from the Queen Mother of the West. The Queen Mother of the West transmitted it orally, without written record. Now, in this world, I have written and recorded it. Those superior persons who awaken to it ascend as heavenly officials...",
      "start_char": 7821,
      "end_char": 8960,
      "start_sentence": 378,
      "end_sentence": 422,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.70723605155945,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\太上老君说常清静妙经纂图解注.txt",
        "category": "玉诀类"
      }
    }
  ]
}