{
  "source_id": "太上洞玄灵宝转神度命经",
  "source_file": "chunked_daozang\\太上洞玄灵宝转神度命经.json",
  "total_chunks": 4,
  "total_original_chars": 3946,
  "total_translated_chars": 23617,
  "total_translation_time": 99.69193387031555,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝转神度命经.txt",
    "category": "本文类"
  },
  "full_translation": "**The Supreme Cavern Mystery Numinous Treasure Scripture on Transforming the Spirit and Delivering the Destined Life**\n\nThe Supreme Dao Lord addressed the Southern Culmen Deliverer of Destined Lives, saying: When a person nears the end of life and their vital qi still lingers, arrange scriptures and images, invite Daoist masters, perform repentance and receive precepts, and distribute alms and possessions. Clothing, bedding, playthings, utensils, carriages, camels, horses, fields, estates, gardens, attendants, servants, cushions, curtains, tables, staffs, basins, sandals, rings, pendants, caps, headbands, belts, swords, ceremonial shoes, jade tablets, pendants, pearls, gold, silver, patterned silks, embroidered fabrics, painted and colored decorations, felt mats, and wooden couches—whatever is available should be offered in charity. Commissioning statues, transcribing scriptures, and dedicating all meritorious deeds, including banners, flowers, canopies, incense burners, bells, chimes, and supporting Daoist masters—whether dwelling in mountains, suffering poverty or illness—by performing rituals, bowing in worship, lecturing, hosting feasts, burning incense, reciting invocations, scattering flowers, lighting lamps, releasing living beings, ransoming lives, establishing temples, delivering people, pardoning prisoners, freeing servants and slaves, allowing them to enter the Dao, and making offerings to the Heavenly Worthy—all these acts benefit both the living and the deceased, their merit unfathomable. Among these, dispelling calamities, averting misfortune, and aiding the sick yield the deepest blessings, truly foremost in merit.\n\nThe Supreme Dao Lord said: Today, men and women whose destined lives are ending should universally proclaim to the ten directions, bearing witness to their repentance. From the beginningless past to this present body, through the three karmic actions and six senses, they have committed countless transgressions. All present must act with utmost sincerity so that all past offenses may be eradicated. Once eradicated, the precepts shall be expounded.\n\nThe first precept: Do not kill. Those who uphold this shall be reborn in a long-lived body. Guard the mind and do not transgress.\n\nThe second precept: Do not engage in illicit sexual conduct. Those who uphold this shall be reborn in a pure and noble body. Guard the mind and do not transgress.\n\nThe third precept: Do not steal. Those who uphold this shall be reborn in a wealthy and honored body. Guard the mind and do not transgress.\n\nThe fourth precept: Do not deceive. Those who uphold this shall be reborn in a respected and trusted body. Guard the mind and do not transgress.\n\nThe fifth precept: Do not consume intoxicants. Those who uphold this shall be reborn in a wise and enlightened body. Guard the mind and do not transgress.\n\nThe Supreme Dao Lord said: Today, men and women who have received these precepts shall hold fast to their roots, transform the spirit, and enter the wondrous realm, being reborn in a pure land, seated upon a great lotus, hearing the Dharma’s sound, never regressing, and attaining the true Dao.\n\nThe Supreme Dao Lord said: For all men and women, whether living or deceased, bow in worship to the ten directions, sincerely repenting with devoted hearts.\n\nAll present, with wholehearted devotion, take refuge in the Eastern Savior of Suffering, the Supreme Compassionate Worthy; the Heavenly Worthy of the Eastern Boundless Realm who has attained the Dao; and the innumerable hosts of immortals, perfected beings, and sages. Pay reverence to all, universally taking refuge, bearing witness to repentance. Thus, may the deceased, from the beginningless past through countless kalpas, in every rebirth, through the three karmic actions and six senses, having committed sins such as killing, stealing, sexual misconduct, licentiousness, greed, stinginess, anger, cursing, delusion, perversion, deceitful speech, falsehood, harsh words, divisive speech, consuming intoxicants and meat, breaking fasts and violating precepts, disrespecting teachers and rebelling against the Dao, slandering scriptures, defiling sacred altars, damaging sacred images, defying heaven and earth, cursing spirits, exposing oneself to stars, boasting of controlling wind and rain, the five heinous acts, unfilial conduct, and myriad transgressions beyond measure—may all these be eradicated. May they, according to their vows, be reborn in the Eastern Pure Land, hear the scriptures and the Dharma, face the Heavenly Worthy, enjoy natural sustenance, live in carefree joy, be reborn in succession, and attain the supreme Dao. Bow in reverence and take refuge in the Eastern Sacred Assembly.\n\nAll present, with wholehearted devotion, take refuge in the Southern Savior of Suffering, the Supreme Compassionate Worthy; the Heavenly Worthy of the Southern Boundless Realm who has attained the Dao; and the innumerable hosts of immortals, perfected beings, and sages. Pay reverence to all, universally taking refuge, bearing witness to repentance. Thus, may the deceased, from the beginningless past through countless kalpas, in every rebirth, through the three karmic actions and six senses, having committed sins such as killing, stealing, sexual misconduct, licentiousness, miserliness, anger, cursing, delusion, perversion, deceitful speech, falsehood, harsh words, divisive speech, consuming intoxicants and meat, breaking fasts and violating precepts, disrespecting teachers and rebelling against the Dao, slandering scriptures, defiling sacred altars, damaging sacred images, defying heaven and earth, cursing spirits, exposing oneself to stars, boasting of controlling wind and rain, the five heinous acts, unfilial conduct, and myriad transgressions beyond measure—may all these be eradicated. May they, according to their vows, be reborn in the Southern Pure Land, hear the scriptures and the Dharma, face the Heavenly Worthy, enjoy natural sustenance, live in carefree joy, be reborn in succession, and attain the supreme Dao. Bow in reverence and take refuge in the Southern Sacred Assembly.\n\nAll present, with wholehearted devotion, take refuge in the Western Savior of Suffering, the Supreme Compassionate Worthy; the Heavenly Worthy of the Western Boundless Realm who has attained the Dao; and the innumerable hosts of immortals, perfected beings, and sages. Pay reverence to all, universally taking refuge, bearing witness to repentance. Thus, may the deceased, from the beginningless past through countless kalpas, in every rebirth, through the three karmic actions and six senses, having committed sins such as killing, stealing, sexual misconduct, licentiousness, greed, stinginess, anger, cursing, delusion, perversion, deceitful speech, falsehood, harsh words, divisive speech, consuming intoxicants and meat, breaking fasts and violating precepts, disrespecting teachers and slighting the Dao, slandering scriptures, defiling sacred altars, damaging sacred images, defying heaven and earth, cursing spirits, exposing oneself to stars, boasting of controlling wind and rain, the five heinous acts, unfilial conduct, and myriad transgressions beyond measure—may all these be eradicated.\n\nMay the deceased, by their vow, be reborn in the Western Pure Land, where they shall hear the scriptures and listen to the Dharma, face the Heavenly Worthy, enjoy natural clothing and sustenance, and dwell in carefree bliss. Through successive rebirths, may they attain the supreme Dao. We bow our heads in reverence and take refuge in the sacred assembly of the West.\n\nWith sincere hearts, we entrust ourselves to the Most Compassionate Worthy of the North, the Heavenly Worthy of the Infinite Realm of the North who has attained the Dao, and the countless host of immortals, perfected beings, and sacred ranks. We pay homage in full, take refuge entirely, and bear witness to repentance. Thus, may the deceased, from the beginningless past through countless kalpas, in every rebirth, through the three karmic actions and six senses, having committed sins such as killing, stealing, sexual misconduct, licentiousness, greed, stinginess, anger, cursing, delusion, perversion, deceitful speech, falsehood, harsh words, divisive speech, consuming intoxicants and meat, breaking fasts and violating precepts, betraying the Dao and slighting teachers, slandering scriptures, damaging sacred images, defiling sacred altars, defying heaven and earth, cursing spirits, exposing oneself to the Three Luminaries, oppressing the four classes, boasting of controlling wind and rain, the five heinous acts, unfilial conduct, and myriad transgressions beyond measure—may all these be eradicated. By their vow, may they be reborn in the Northern Pure Land, where they shall hear the scriptures and listen to the Dharma, face the Heavenly Worthy, enjoy natural clothing and sustenance, dwell in carefree bliss, and through successive rebirths, attain the supreme Dao. We bow our heads in reverence and take refuge in the sacred assembly of the North.\n\nWith sincere hearts, we entrust ourselves to the Most Compassionate Worthy of the Northeast, the Heavenly Worthy of the Infinite Realm of the Northeast who has attained the Dao, and the countless host of immortals, perfected beings, and sacred ranks. We pay homage in full, take refuge entirely, and bear witness to repentance. Thus, may the deceased, from the beginningless past through countless kalpas, in every rebirth, through the three karmic actions and six senses, having committed sins such as killing, stealing, sexual misconduct, licentiousness, greed, stinginess, anger, cursing, delusion, perversion, deceitful speech, falsehood, harsh words, divisive speech, consuming intoxicants and meat, breaking fasts and violating precepts, betraying the Dao and slighting teachers, slandering scriptures, damaging sacred images, defiling sacred altars, defying heaven and earth, cursing spirits, exposing oneself to the Three Luminaries, oppressing the four classes, boasting of controlling wind and rain, the five heinous acts, unfilial conduct, and myriad transgressions beyond measure—may all these be eradicated. By their vow, may they be reborn in the Northeastern Pure Land, where they shall hear the scriptures and listen to the Dharma, face the Heavenly Worthy, enjoy natural clothing and sustenance, dwell in carefree bliss, and through successive rebirths, attain the supreme Dao. We bow our heads in reverence and take refuge in the sacred assembly of the Northeast.\n\nWith sincere hearts, we entrust ourselves to the Most Compassionate Worthy of the Southeast, the Heavenly Worthy of the Infinite Realm of the Southeast who has attained the Dao, and the countless host of immortals, perfected beings, and sacred ranks. We pay homage in full, take refuge entirely, and bear witness to repentance. Thus, may the deceased, from the beginningless past through countless kalpas, in every rebirth, through the three karmic actions and six senses, having committed sins such as killing, stealing, sexual misconduct, licentiousness, greed, stinginess, anger, cursing, delusion, perversion, deceitful speech, falsehood, harsh words, divisive speech, consuming intoxicants and meat, breaking fasts and violating precepts, betraying the Dao and slighting teachers, slandering scriptures, damaging sacred images, defiling sacred altars, trampling upon sacred precincts, defying heaven and earth, cursing spirits, exposing oneself to the Three Luminaries, oppressing the four classes, boasting of controlling wind and rain, the five heinous acts, unfilial conduct, and myriad transgressions beyond measure—may all these be eradicated. By their vow, may they be reborn in the Southeastern Pure Land, where they shall hear the scriptures and listen to the Dharma, face the Heavenly Worthy, enjoy natural clothing and sustenance, dwell in carefree bliss, and through successive rebirths, attain the supreme Dao. We bow our heads in reverence and take refuge in the sacred assembly of the Southeast.\n\nWith sincere hearts, we entrust ourselves to the Most Compassionate Worthy of the Southwest, the Heavenly Worthy of the Infinite Realm of the Southwest who has attained the Dao, and the countless host of immortals, perfected beings, and sacred ranks. We pay homage in full, take refuge entirely, and bear witness to repentance. Thus, may the deceased, from the beginningless past through countless kalpas, in every rebirth, through the three karmic actions and six senses, having committed sins such as killing, stealing, sexual misconduct, licentiousness, greed, stinginess, anger, cursing, delusion, perversion, deceitful speech, falsehood, harsh words, divisive speech, consuming intoxicants and meat, breaking fasts and violating precepts, betraying the Dao and slighting teachers, slandering scriptures, damaging sacred images, trampling upon sacred precincts, defiling sacred altars, cursing spirits, defying heaven and earth, oppressing the four classes, exposing oneself to the Three Luminaries, the five heinous acts, unfilial conduct, boasting of controlling wind and rain, and myriad transgressions beyond measure—may all these be eradicated. By their vow, may they be reborn in the Southwestern Pure Land, where they shall hear the scriptures and listen to the Dharma, face the Heavenly Worthy, enjoy natural clothing and sustenance, dwell in carefree bliss, and through successive rebirths, attain the supreme Dao. We bow our heads in reverence and take refuge in the sacred assembly of the Southwest.\n\nWith sincere hearts, we entrust ourselves to the Most Compassionate Worthy of the Northwest, the Heavenly Worthy of the Infinite Realm of the Northwest who has attained the Dao, and the countless host of immortals, perfected beings, and sacred ranks. We pay homage in full, take refuge entirely, and bear witness to repentance. Thus, may the deceased, from the beginningless past through countless kalpas, in every rebirth, through the three karmic actions and six senses, having committed sins such as killing, stealing, sexual misconduct, licentiousness, greed, stinginess, anger, cursing, delusion, perversion, deceitful speech, falsehood, harsh words, divisive speech, consuming intoxicants and meat, breaking fasts and violating precepts, betraying the Dao and slighting teachers, slandering scriptures, damaging sacred images, trampling upon sacred precincts, defiling sacred altars, cursing spirits, defying heaven and earth, oppressing the four classes, exposing oneself to the Three Luminaries, the five heinous acts, unfilial conduct, boasting of controlling wind and rain, and myriad transgressions beyond measure—may all these be eradicated.\n\nMay the deceased, by their vow, be reborn in the Pure Land of the Northwest, where they may hear the scriptures and listen to the Dharma, face the Heavenly Worthy, enjoy natural clothing and sustenance, and dwell in carefree joy. May they be reborn in turn, attaining the supreme Dao. We bow our heads in reverence and take refuge in the sacred assembly of the Northwest.\n\nWith sincere devotion, we prostrate ourselves before the Supreme Compassionate Worthy of the Upper Realm, the Heavenly Worthy of the Infinite World of the Upper Realm who has attained the Dao, and the countless hosts of immortals, perfected beings, and sacred ranks. We pay homage to all, take refuge in them entirely, and seek their witness for our repentance. May all the sins of the deceased—from the beginningless past through countless kalpas, in every rebirth, through the three karmic actions and six senses, having committed such transgressions as killing, stealing, sexual misconduct, licentiousness, greed, stinginess, anger, cursing, delusion, perversion, deceitful speech, falsehood, harsh words, divisive speech, consuming intoxicants and meat, breaking fasts and violating precepts, betraying the Dao and slighting teachers, slandering scriptures, damaging sacred images, trampling upon sacred precincts, defiling sacred altars, cursing spirits, defying heaven and earth, oppressing the four classes, exposing oneself to the Three Luminaries, the five heinous acts, unfilial conduct, boasting of controlling wind and rain, and myriad transgressions beyond measure—be eradicated. May they, by their vow, be reborn in the Pure Land of the Upper Realm, hear the scriptures and listen to the Dharma, face the Heavenly Worthy, enjoy natural clothing and sustenance, dwell in carefree joy, be reborn in turn, and attain the supreme Dao. We bow our heads in reverence and take refuge in the sacred assembly of the Upper Realm.\n\nWith sincere devotion, we prostrate ourselves before the Supreme Compassionate Worthy of the Lower Realm, the Heavenly Worthy of the Infinite World of the Lower Realm who has attained the Dao, and the countless hosts of immortals, perfected beings, and sacred ranks. We pay homage to all, take refuge in them entirely, and seek their witness for our repentance. May all the sins of the deceased—from the beginningless past through countless kalpas, in every rebirth, through the three karmic actions and six senses, having committed such transgressions as killing, stealing, sexual misconduct, greed, stinginess, anger, cursing, delusion, perversion, deceitful speech, falsehood, harsh words, divisive speech, consuming intoxicants and meat, eating the five pungent roots, violating precepts and breaking fasts, slighting teachers and betraying the Dao, damaging sacred images, slandering scriptures, hypocrisy, gossiping, envy, harming the virtuous, slandering the loyal, sowing discord in families and states, breaking oaths and covenants, revealing sacred teachings, defiling sacred altars, trampling upon sacred precincts, praying to spirits and ghosts, spreading heretical doctrines, turning from the right to the wrong, doubting the true and believing in the vulgar, cursing spirits and ghosts, bewitching the wise, defying earth and heaven, rebuking wind and rain, oppressing the four classes, exposing oneself to the Three Luminaries, unfilial and disloyal conduct, unkindness and injustice, and countless transgressions beyond measure—through the six senses of eye, ear, nose, tongue, body, and mind, be eradicated. May they, by their vow, be reborn in the Pure Land of the Lower Realm, hear the scriptures and listen to the Dharma, face the Heavenly Worthy, enjoy natural clothing and sustenance, dwell in carefree joy, be reborn in turn, and attain the supreme Dao. We bow our heads in reverence and take refuge in the sacred assembly of the Lower Realm.\n\nThe Most High Lord of the Dao addressed the Perfected One of the Southern Culmen, who delivers lives: \"From the beginning, the Primordial Beginning has spread transformation throughout the ten directions, filling the five hundred million heavens and the three thousand Dao realms. Dividing his body and scattering his shadow, his true, responsive, and transformative Dharma takes form in response to conditions, expounding the Dharma to deliver beings, rescuing and aiding all, teaching and transforming men and women, and accomplishing the multitude of beings. In each realm, there are Heavenly Worthies who are lords, the Most High Lord Lao, true teachers, jade maidens and jade lads, immortals, perfected beings, sacred ranks, generals and warriors, vajra spirit-kings, twenty-four thousand spirit-offices, one hundred twenty bureaus and departments, star palaces and cloud halls, water residences and immortal palaces—all have officials in charge, examining and assessing sins and blessings. They hold banners and establish standards, grasp registers and wield talismans, soar through the void, recite scriptures, and perform the Dao. They increase blessings and repay evil, avert misfortune and dispel calamities, patrolling day and night to inspect gains and losses, all in accordance with the Primordial Beginning, assembling in the Great Luo. Though kalpas shift and change, the established Dharma remains unaltered. The ten directions and three realms share a single system; the Three Caverns divide their gates, adapting to the capacities of those who receive them. Confessing transgressions and seeking blessings proceed from the low to the high; repenting sins and seeking grace proceed from the heart to enter the Dao. To violate this decree is to follow heretical teachings. Therefore, I proclaim that one should first approach the ten directions, where spiritual resonance and response will naturally bring about numinous efficacy.\"\n\nThe Most High Lord of the Dao addressed all men and women of the three realms: \"Each should apply their mind, follow these instructions, and comply with them.\"\n\nThe Most High Lord of the Dao said: \"When a person dies, their transformation follows their past karma. They may be reborn in the household of a wealthy and noble king, in a family of upright and virtuous character, in a body of wisdom and intelligence, in a body of complete purity, in a body of longevity and joy, in the body of a poor and lowly servant, in a body of ugliness and malice, in a body of delusion and dullness, in a body of decay and filth, in a body of premature death and affliction, in a body of illness and suffering, in a body of borderland barbarians subject to killing, in the body of a pig or dog, in the body of a bird or beast, in the body of a fish, turtle, insect, or ant, in the body of a ghost, spirit, demon, or evil being, or in the long night of the Nine Dark Realms—all are received according to their original karma. The past and future are no different from the present; what one receives in this life comes from past karma. What one sows in this life becomes past karma. The common people, being foolish, see the clear retribution of sins and blessings in this world yet do not believe in the causes and conditions of past lives. It is like eating the five grains without knowing where they were sown. The verification of sins and blessings is like an echo and shadow. Diligence in repentance prevents sins from arising; diligence in cultivating goodness ensures blessings remain.\"\n\nThe Most High Lord of the Dao said: \"When a person first dies, from the first to the hundredth day, set up an image, invite Daoist priests to perform rituals and recitations, tirelessly day and night. Thus, the soul may be born in a good place and not fall into the Three Wretched Realms.\"\n\nIf on the first day, lamps are lit, banners are made, scriptures are copied, and images are cast—each act of deliverance reaching a hundred in number—the deceased shall immediately be reborn in the Pure Lands of the Ten Directions, the realms of bliss, where worldly blessings and prosperity abound, free from all calamities and misfortunes.\n\nThe Most High Lord of the Dao said: \"At the time of parting, invite Daoist priests to burn incense on the left side of the road, recite scriptures, and perform acts of almsgiving and life-release along the way. Thus, the Celestial Officers shall not detain the departed soul, nor shall flying corpses or vengeful ghosts afflict the living.\n\nIf incense is burned and scriptures are recited to the left of the grave, the Earthly Deities and True Officers shall pacify the departed soul, the household shall remain undisturbed, and malevolent spirits or murderous ghosts shall not trouble the descendants.\n\nThe Perfected One of the Southern Culmen and all the sagely hosts, hearing the virtuous sounds, bow in reverence and carry out the rites.\"\n\nHere ends *The Most High Numinous Treasure Scripture of Turning the Spirit and Delivering the Destiny*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上洞玄灵宝转神度命经 经名：太上洞玄灵宝转神度命经。 撰人不详，约出於隋唐。 言超度亡灵罪业。 一卷。 底本出处：《正统道藏》洞玄部本文类。 太上洞玄灵宝转神度命经 太上道君告南极度命真人曰：夫人临欲终时，及其生气，安置经像，请诸道士，忏悔受戒，施散财物。 衣服卧具，玩弄器用，车舆驼马，田宅苑囿，侍从僮仆，茵褥帐幔，几杖盘盂，屦履环佩，冠帻带绶，剑舄璋玦，珠玉金银，纹缯绮谷，诱画彩缋，毡席林榻，随有舍施。 造像写经，入诸功德，旛花幢盖，香炉锺磬，及以道士，山居贫病，行道礼拜，讲读设斋，烧香诵念，散花然灯，放生赎命，立观度人，开赦囚徒，免诸仆贱，放令入道，供养天尊，利益存亡，难思功德。 若消灾却祸，拯济病人，福力最深，实为第一。 太上道君曰：今日男女，受命应终，普告十方，证明忏悔。 上从无始，逮至此身，三业六根，造罪无数。 会中时有众等，须为虔诚，使一切宿愆，并得消灭。 既消灭已，便为说戒。 第一戒者，不得杀害。 当来托生，受长寿之身。 持心勿犯。 第二戒者，不得邪淫。 当来托生，受清争之身。 持心勿犯。 第三戒者，不得偷盗。 当来托生，受富贵之身。 持心勿犯。 第四戒者，不得欺诳。 当来托生，受敬信之身。 持心勿犯。 第五戒者，不得饮酒。 当来托生，受智慧之身。 持心勿犯。 太上道君曰：今日男女，受戒毕已，持是戒根，转神入妙，生清净国，坐大莲花，观听法音，永无退堕，证成真道。 太上道君曰：为诸男女，若存若亡，礼拜十方，归心忏悔。 众等志心归命东方救苦无上慈尊、东方无极世界得道天尊、仙真圣品无鞅数众。 一切敬礼，遍悉归依，证明忏悔。 即令亡者无始以来，受身生身，从劫至劫，三业六根，构造诸罪，杀生偷盗、邪淫放荡、贪爱吝惜、嗔怒骂詈、愚痴颠倒、绮言妄语、恶口两舌、饮酒食肉、破斋犯戒、轻师叛道、訾毁经文、秽污玄坛、损坏尊像、逆天违地、祝鬼诅神、裸露星辰、吹嘘风雨，五逆不孝，万罪千愆，无量无边，悉为除灭。 随愿往生东方今土，闻经听法，面对天尊，衣食自然，逍遥快乐，展转托生，成无上道。 稽首归依东方圣众。 众等志心归命南方救苦无上慈尊、南方无极世界得道天尊、仙真圣品无鞅数众。 一切敬礼，遍悉归依，证明忏悔。 即令亡者无始以来，受身生身，从劫至劫，三业六根，构造诸罪，杀生偷盗、邪淫放荡、悭爱悟惜、嗔怒骂詈、愚痴颠倒、锜言妄语、恶口两舌、饮酒食肉、破斋犯戒、轻师叛道、訾毁经文、秽污玄坛、损坏尊像、逆天违地、祝鬼诅神、裸露星辰、吹嘘风雨、五逆不孝，万罪千愆，无量无边，悉为除灭。 随愿往生南方净土，闻经听法，面对天尊，衣食自然，逍遥快乐，展转托生，成无上道。 稽首归依南方圣众。 众等志心归命西方救苦无上慈尊、西方无极世界得道天尊、仙真圣品无鞅数众。 一切敬礼，遍悉归依，证明忏悔。 即令亡者无始以来，受身生身，从劫至劫，三业六根，构造诸罪，杀生偷盗、邪淫放荡、悭贪吝惜、嗔怒骂詈、愚痴颠倒、锜言妄语、恶口两舌、饮酒食肉、破斋犯戒、轻师慢道、訾毁经文、秽污玄坛、损坏尊像、逆天违地、祝鬼诅神、裸露星辰、吹嘘风雨、五逆不孝，万罪千愆，无量无边，悉为除灭。",
      "translated_text": "**The Supreme Cavern Mystery Numinous Treasure Scripture on Transforming the Spirit and Delivering the Destined Life**\n\nThe Supreme Dao Lord addressed the Southern Culmen Deliverer of Destined Lives, saying: When a person nears the end of life and their vital qi still lingers, arrange scriptures and images, invite Daoist masters, perform repentance and receive precepts, and distribute alms and possessions. Clothing, bedding, playthings, utensils, carriages, camels, horses, fields, estates, gardens, attendants, servants, cushions, curtains, tables, staffs, basins, sandals, rings, pendants, caps, headbands, belts, swords, ceremonial shoes, jade tablets, pendants, pearls, gold, silver, patterned silks, embroidered fabrics, painted and colored decorations, felt mats, and wooden couches—whatever is available should be offered in charity. Commissioning statues, transcribing scriptures, and dedicating all meritorious deeds, including banners, flowers, canopies, incense burners, bells, chimes, and supporting Daoist masters—whether dwelling in mountains, suffering poverty or illness—by performing rituals, bowing in worship, lecturing, hosting feasts, burning incense, reciting invocations, scattering flowers, lighting lamps, releasing living beings, ransoming lives, establishing temples, delivering people, pardoning prisoners, freeing servants and slaves, allowing them to enter the Dao, and making offerings to the Heavenly Worthy—all these acts benefit both the living and the deceased, their merit unfathomable. Among these, dispelling calamities, averting misfortune, and aiding the sick yield the deepest blessings, truly foremost in merit.\n\nThe Supreme Dao Lord said: Today, men and women whose destined lives are ending should universally proclaim to the ten directions, bearing witness to their repentance. From the beginningless past to this present body, through the three karmic actions and six senses, they have committed countless transgressions. All present must act with utmost sincerity so that all past offenses may be eradicated. Once eradicated, the precepts shall be expounded.\n\nThe first precept: Do not kill. Those who uphold this shall be reborn in a long-lived body. Guard the mind and do not transgress.\n\nThe second precept: Do not engage in illicit sexual conduct. Those who uphold this shall be reborn in a pure and noble body. Guard the mind and do not transgress.\n\nThe third precept: Do not steal. Those who uphold this shall be reborn in a wealthy and honored body. Guard the mind and do not transgress.\n\nThe fourth precept: Do not deceive. Those who uphold this shall be reborn in a respected and trusted body. Guard the mind and do not transgress.\n\nThe fifth precept: Do not consume intoxicants. Those who uphold this shall be reborn in a wise and enlightened body. Guard the mind and do not transgress.\n\nThe Supreme Dao Lord said: Today, men and women who have received these precepts shall hold fast to their roots, transform the spirit, and enter the wondrous realm, being reborn in a pure land, seated upon a great lotus, hearing the Dharma’s sound, never regressing, and attaining the true Dao.\n\nThe Supreme Dao Lord said: For all men and women, whether living or deceased, bow in worship to the ten directions, sincerely repenting with devoted hearts.\n\nAll present, with wholehearted devotion, take refuge in the Eastern Savior of Suffering, the Supreme Compassionate Worthy; the Heavenly Worthy of the Eastern Boundless Realm who has attained the Dao; and the innumerable hosts of immortals, perfected beings, and sages. Pay reverence to all, universally taking refuge, bearing witness to repentance. Thus, may the deceased, from the beginningless past through countless kalpas, in every rebirth, through the three karmic actions and six senses, having committed sins such as killing, stealing, sexual misconduct, licentiousness, greed, stinginess, anger, cursing, delusion, perversion, deceitful speech, falsehood, harsh words, divisive speech, consuming intoxicants and meat, breaking fasts and violating precepts, disrespecting teachers and rebelling against the Dao, slandering scriptures, defiling sacred altars, damaging sacred images, defying heaven and earth, cursing spirits, exposing oneself to stars, boasting of controlling wind and rain, the five heinous acts, unfilial conduct, and myriad transgressions beyond measure—may all these be eradicated. May they, according to their vows, be reborn in the Eastern Pure Land, hear the scriptures and the Dharma, face the Heavenly Worthy, enjoy natural sustenance, live in carefree joy, be reborn in succession, and attain the supreme Dao. Bow in reverence and take refuge in the Eastern Sacred Assembly.\n\nAll present, with wholehearted devotion, take refuge in the Southern Savior of Suffering, the Supreme Compassionate Worthy; the Heavenly Worthy of the Southern Boundless Realm who has attained the Dao; and the innumerable hosts of immortals, perfected beings, and sages. Pay reverence to all, universally taking refuge, bearing witness to repentance. Thus, may the deceased, from the beginningless past through countless kalpas, in every rebirth, through the three karmic actions and six senses, having committed sins such as killing, stealing, sexual misconduct, licentiousness, miserliness, anger, cursing, delusion, perversion, deceitful speech, falsehood, harsh words, divisive speech, consuming intoxicants and meat, breaking fasts and violating precepts, disrespecting teachers and rebelling against the Dao, slandering scriptures, defiling sacred altars, damaging sacred images, defying heaven and earth, cursing spirits, exposing oneself to stars, boasting of controlling wind and rain, the five heinous acts, unfilial conduct, and myriad transgressions beyond measure—may all these be eradicated. May they, according to their vows, be reborn in the Southern Pure Land, hear the scriptures and the Dharma, face the Heavenly Worthy, enjoy natural sustenance, live in carefree joy, be reborn in succession, and attain the supreme Dao. Bow in reverence and take refuge in the Southern Sacred Assembly.\n\nAll present, with wholehearted devotion, take refuge in the Western Savior of Suffering, the Supreme Compassionate Worthy; the Heavenly Worthy of the Western Boundless Realm who has attained the Dao; and the innumerable hosts of immortals, perfected beings, and sages. Pay reverence to all, universally taking refuge, bearing witness to repentance. Thus, may the deceased, from the beginningless past through countless kalpas, in every rebirth, through the three karmic actions and six senses, having committed sins such as killing, stealing, sexual misconduct, licentiousness, greed, stinginess, anger, cursing, delusion, perversion, deceitful speech, falsehood, harsh words, divisive speech, consuming intoxicants and meat, breaking fasts and violating precepts, disrespecting teachers and slighting the Dao, slandering scriptures, defiling sacred altars, damaging sacred images, defying heaven and earth, cursing spirits, exposing oneself to stars, boasting of controlling wind and rain, the five heinous acts, unfilial conduct, and myriad transgressions beyond measure—may all these be eradicated.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1281,
      "start_sentence": 0,
      "end_sentence": 44,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.69436025619507,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝转神度命经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "随愿往生西方净土，闻经听法，面对天尊，衣食自然，逍遥快乐，展转托生，成无上道。 稽首归依西方圣众。 众等志心归命北方救苦无上慈尊、北方无极世界得道天尊、仙真圣品无鞅数众。 一切敬礼，遍悉归根，证明忏悔。 即令亡者无始以来，受身生身，从劫至劫，三业六根，构造诸罪，杀生偷盗、放荡邪淫、悭贪吝惜、嗔怒骂詈、愚痴颠倒、绮言妄语、恶口两舌、饮酒食肉、破斋犯戒、叛道轻师、訾毁经文、损坏尊像、秽污玄坛、逆天违地、祝鬼诅神、裸露三光、欺凌四辈、吹嘘风雨、不孝五逆，万罪千愆，无量无边，悉为除灭。 随愿往生北方净土，闻经听法，面对天尊，衣食自然，一逍遥快乐，展转托生，成无上道。 稽首归依北方圣众。 众等志心归命东北方救苦无上慈尊、东北方无极世界得道天尊、仙真圣品无鞅数众。 一切敬礼，遍悉归依，证明忏悔。 即令亡者无始以来，受身生身，从劫至劫，三业六根，构造诸罪，杀生偷盗、放荡邪淫、悭贪吝惜、嗔怒骂詈、愚痴颠树、锜言妄语、恶口两舌、饮酒食肉、破斋犯戒、叛道轻师、訾毁经文、损坏尊像、秽污玄坛、逆天违地、祝鬼诅神、裸露三光、欺凌四辈、吹嘘风雨，不孝五逆，万罪千愆，无边无量，悉为除灭。 随愿往生东北方净土，闻经听法，面对天尊，衣食自然，逍遥快乐，展转托生，成无上道。 稽首归依东北方圣众。 众等志心归命东南方救苦无上慈尊、东南方无极世界得道天尊、仙真圣品无鞅数众。 一切敬礼，遍悉归依，证明忏悔。 即令亡者无始以来，受身生身，从劫至劫，三业六根，构造诸罪，杀生偷盗、放荡邪淫、悭贪吝惜、嗔怒骂詈、愚痴颠倒、锜言妄语、恶口两舌、饮酒食肉、破斋犯戒、叛道轻师、訾毁经文、损坏尊像、秽污玄坛、践踏灵观、逆天违地、祝鬼诅神、裸露三光、欺凌四辈、吹嘘风雨、不孝五逆，万罪千愆，无边无量，悉为除灭。 随愿往生东南方净土，闻经听法，面对天尊，衣食自然，逍遥快乐，展转托生，成无上道。 稽首归依东南方圣众。 众等志心归命西南方救苦无上慈尊、西南方无极世界得道天尊、仙真圣品无鞅数众。 一切敬礼，遍悉归依，证明忏悔。 即令亡者无始以来，受身生身，从劫至劫，三业六根，构造诸罪，杀生偷盗、放荡邪淫、悭贪吝惜、嗔怒骂詈、愚痴颠倒、锜言妄语、恶口两舌、饮酒食肉、破斋犯戒、叛道轻师、訾毁经文、损坏尊像、践踏灵观、秽污玄坛、祝鬼诅神、逆天违地、欺凌四辈、裸露三光、五逆不孝、吹嘘风雨、万罪千愆，无边无量，悉为除灭。 随愿往生西南方今土，闻经听法，面对天尊，衣食自然，逍遥快乐，展转托生，成无上道。 稽首归依西南方圣众。 众等志心归命西北方救苦无上慈尊、西北方无极世界得道天尊、仙真圣品无鞅数众，一切敬礼，遍悉归依，证明忏悔。 即令亡者无始以来，受身生身，从劫至劫，三业六根，构造诸罪，杀生偷盗、放荡邪淫、悭贪吝惜、嗔怒骂詈、愚痴颠倒、绮言妄语、恶口两舌、饮酒食肉、破斋犯戒、叛道轻师、訾毁经文、损坏尊像、践踏灵观、秽污玄坛、祝鬼诅神、逆天违地、欺凌四辈、裸露三光、五逆不孝、吹嘘风雨，万罪千愆，无边无量，悉为除灭。",
      "translated_text": "May the deceased, by their vow, be reborn in the Western Pure Land, where they shall hear the scriptures and listen to the Dharma, face the Heavenly Worthy, enjoy natural clothing and sustenance, and dwell in carefree bliss. Through successive rebirths, may they attain the supreme Dao. We bow our heads in reverence and take refuge in the sacred assembly of the West.\n\nWith sincere hearts, we entrust ourselves to the Most Compassionate Worthy of the North, the Heavenly Worthy of the Infinite Realm of the North who has attained the Dao, and the countless host of immortals, perfected beings, and sacred ranks. We pay homage in full, take refuge entirely, and bear witness to repentance. Thus, may the deceased, from the beginningless past through countless kalpas, in every rebirth, through the three karmic actions and six senses, having committed sins such as killing, stealing, sexual misconduct, licentiousness, greed, stinginess, anger, cursing, delusion, perversion, deceitful speech, falsehood, harsh words, divisive speech, consuming intoxicants and meat, breaking fasts and violating precepts, betraying the Dao and slighting teachers, slandering scriptures, damaging sacred images, defiling sacred altars, defying heaven and earth, cursing spirits, exposing oneself to the Three Luminaries, oppressing the four classes, boasting of controlling wind and rain, the five heinous acts, unfilial conduct, and myriad transgressions beyond measure—may all these be eradicated. By their vow, may they be reborn in the Northern Pure Land, where they shall hear the scriptures and listen to the Dharma, face the Heavenly Worthy, enjoy natural clothing and sustenance, dwell in carefree bliss, and through successive rebirths, attain the supreme Dao. We bow our heads in reverence and take refuge in the sacred assembly of the North.\n\nWith sincere hearts, we entrust ourselves to the Most Compassionate Worthy of the Northeast, the Heavenly Worthy of the Infinite Realm of the Northeast who has attained the Dao, and the countless host of immortals, perfected beings, and sacred ranks. We pay homage in full, take refuge entirely, and bear witness to repentance. Thus, may the deceased, from the beginningless past through countless kalpas, in every rebirth, through the three karmic actions and six senses, having committed sins such as killing, stealing, sexual misconduct, licentiousness, greed, stinginess, anger, cursing, delusion, perversion, deceitful speech, falsehood, harsh words, divisive speech, consuming intoxicants and meat, breaking fasts and violating precepts, betraying the Dao and slighting teachers, slandering scriptures, damaging sacred images, defiling sacred altars, defying heaven and earth, cursing spirits, exposing oneself to the Three Luminaries, oppressing the four classes, boasting of controlling wind and rain, the five heinous acts, unfilial conduct, and myriad transgressions beyond measure—may all these be eradicated. By their vow, may they be reborn in the Northeastern Pure Land, where they shall hear the scriptures and listen to the Dharma, face the Heavenly Worthy, enjoy natural clothing and sustenance, dwell in carefree bliss, and through successive rebirths, attain the supreme Dao. We bow our heads in reverence and take refuge in the sacred assembly of the Northeast.\n\nWith sincere hearts, we entrust ourselves to the Most Compassionate Worthy of the Southeast, the Heavenly Worthy of the Infinite Realm of the Southeast who has attained the Dao, and the countless host of immortals, perfected beings, and sacred ranks. We pay homage in full, take refuge entirely, and bear witness to repentance. Thus, may the deceased, from the beginningless past through countless kalpas, in every rebirth, through the three karmic actions and six senses, having committed sins such as killing, stealing, sexual misconduct, licentiousness, greed, stinginess, anger, cursing, delusion, perversion, deceitful speech, falsehood, harsh words, divisive speech, consuming intoxicants and meat, breaking fasts and violating precepts, betraying the Dao and slighting teachers, slandering scriptures, damaging sacred images, defiling sacred altars, trampling upon sacred precincts, defying heaven and earth, cursing spirits, exposing oneself to the Three Luminaries, oppressing the four classes, boasting of controlling wind and rain, the five heinous acts, unfilial conduct, and myriad transgressions beyond measure—may all these be eradicated. By their vow, may they be reborn in the Southeastern Pure Land, where they shall hear the scriptures and listen to the Dharma, face the Heavenly Worthy, enjoy natural clothing and sustenance, dwell in carefree bliss, and through successive rebirths, attain the supreme Dao. We bow our heads in reverence and take refuge in the sacred assembly of the Southeast.\n\nWith sincere hearts, we entrust ourselves to the Most Compassionate Worthy of the Southwest, the Heavenly Worthy of the Infinite Realm of the Southwest who has attained the Dao, and the countless host of immortals, perfected beings, and sacred ranks. We pay homage in full, take refuge entirely, and bear witness to repentance. Thus, may the deceased, from the beginningless past through countless kalpas, in every rebirth, through the three karmic actions and six senses, having committed sins such as killing, stealing, sexual misconduct, licentiousness, greed, stinginess, anger, cursing, delusion, perversion, deceitful speech, falsehood, harsh words, divisive speech, consuming intoxicants and meat, breaking fasts and violating precepts, betraying the Dao and slighting teachers, slandering scriptures, damaging sacred images, trampling upon sacred precincts, defiling sacred altars, cursing spirits, defying heaven and earth, oppressing the four classes, exposing oneself to the Three Luminaries, the five heinous acts, unfilial conduct, boasting of controlling wind and rain, and myriad transgressions beyond measure—may all these be eradicated. By their vow, may they be reborn in the Southwestern Pure Land, where they shall hear the scriptures and listen to the Dharma, face the Heavenly Worthy, enjoy natural clothing and sustenance, dwell in carefree bliss, and through successive rebirths, attain the supreme Dao. We bow our heads in reverence and take refuge in the sacred assembly of the Southwest.\n\nWith sincere hearts, we entrust ourselves to the Most Compassionate Worthy of the Northwest, the Heavenly Worthy of the Infinite Realm of the Northwest who has attained the Dao, and the countless host of immortals, perfected beings, and sacred ranks. We pay homage in full, take refuge entirely, and bear witness to repentance. Thus, may the deceased, from the beginningless past through countless kalpas, in every rebirth, through the three karmic actions and six senses, having committed sins such as killing, stealing, sexual misconduct, licentiousness, greed, stinginess, anger, cursing, delusion, perversion, deceitful speech, falsehood, harsh words, divisive speech, consuming intoxicants and meat, breaking fasts and violating precepts, betraying the Dao and slighting teachers, slandering scriptures, damaging sacred images, trampling upon sacred precincts, defiling sacred altars, cursing spirits, defying heaven and earth, oppressing the four classes, exposing oneself to the Three Luminaries, the five heinous acts, unfilial conduct, boasting of controlling wind and rain, and myriad transgressions beyond measure—may all these be eradicated.",
      "overlap_context": "r, cursing, delusion, perversion, deceitful speech, falsehood, harsh words, divisive speech, consuming intoxicants and meat, breaking fasts and violating precepts, disrespecting teachers and slighting the Dao, slandering scriptures, defiling sacred altars, damaging sacred images, defying heaven and earth, cursing spirits, exposing oneself to stars, boasting of controlling wind and rain, the five heinous acts, unfilial conduct, and myriad transgressions beyond measure—may all these be eradicated.",
      "start_char": 1281,
      "end_char": 2511,
      "start_sentence": 45,
      "end_sentence": 68,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.859575271606445,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝转神度命经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "随愿往生西北方净土，闻经听法，面对天尊，衣食自然，逍遥快乐，展转托生，成无上道。 稽首归依西北方圣众。 众等志心归命上方救苦无上慈尊、上方无极世界得道天尊、仙真圣品无鞅数众，一切敬礼，遍悉归依，证明忏悔。 即令亡者无始以来，受身生身，从劫至劫，三业六根，构造诸罪，杀生偷盗、放荡邪淫、悭贪吝惜、嗔怒骂詈、愚痴颠倒、绮言妄语、恶口两舌、饮酒食肉、破斋犯戒、叛道轻师、訾毁经文、损坏尊像、践踏灵观、秽污玄坛、祝鬼诅神、逆天违地、欺凌四辈、裸露三光、五逆不孝、吹嘘风雨，万罪千愆，无边无量，悉为除灭。 随愿往生上方净土，闻经听法，面对天尊，衣食自然，逍遥快乐，展转托生，成无上道。 稽首归依上方圣众。 众等志心归命下方救苦无上慈尊、下方无极世界得道天尊、仙真圣品无鞅数众，一切敬礼，遍悉归依，证明忏悔。 即令亡者无始以来，受身生身，从劫至劫，三业六根，构造诸罪，杀生偷盗、放荡邪淫、悭贪吝惜、嗔怒骂詈、愚痴颠倒、妄言绮语、恶口两舌、饮酒食肉、啖嚼五辛、犯戒破斋、轻师叛道、损坏尊像、訾毁经文、口是心非、说人长短、嫉拓胜己、陷害贤良、谗击忠贞、斗乱家国、违盟犯约、泄漏真科、秽污玄坛、践踏灵观、祷祀神鬼、鼓舞妖言、背正入邪、疑真信俗、祝诅神鬼、厌蛊贤明、逆地违天、诃风叱雨、欺凌四辈、裸露三光、不孝不忠、不仁不义，千愆万罪，无量无边，眼耳 鼻舌身意，六根诸罪，悉为除灭。 随愿往生下方净土，闻经听法，面对天尊，衣食自然，逍遥快乐，展转托生，成无上道。 稽首归依下方圣众。 太上道君告南极度命真人曰：元始布化，遍满十方，五亿诸天，三千道境，分身散影，真应化法，缘感立形，说法度人，救济一切，教化男女，成就众生。 一一境中，皆有帝主天尊、太上老君、真师、玉女玉童、仙真圣品、将军力士、金刚神王、二万四千灵司、一百二十曹局，星宫云殿，水府仙宫，咸有司存，考校罪福，持幢建节，把箓执符，飞空步虚，诵经行道，益善报恶，却祸消灾，昼夜巡行，检勘得失，俱遵元始，朝会大罗。 虽劫运推移，立法无改。 十方三界，同一轨仪，三洞分门，随机所受，首过请福，自下之高，谢罪求恩，由心入道。 若违此旨，便从邪法。 所以告启，先诣十方，神运感通，自获灵应。 普告三界一切男女，宜各用心，依令遵奉。 太上道君曰：人死转形，各随先业。 或生富贵国王之门，或生端正贤善之家，或生智慧聪明之身，或生具足清净之身，或生长寿快乐之身，或生贫贱奴婢之身，或生丑陋毒恶之身，或生愚痴浊钝之身，或生破坏臭秽之身，或生夭折烦恼之身，或生病患苦痛之身，或生边夷杀害之身，或生六畜猜狗之身，或生鸟兽豺狼之身，或生鱼鳖虫蚁之身，或生鬼神魔邪之身，或处九幽长夜之中，皆由本业所受。 过去未来，与今无异，今身所受，从先业来。 见世所种，作过去业。 世人凡愚，眼观见世罪福，报应分明，而不信宿命因缘，亦犹食五谷不知播种所得。 罪福之验，如影响也。 勤能忏悔，则罪不生。 勤能修善，则福常在。 太上道君曰：人初亡，从一日至百日，安置绘像，请道士行道诵念，昼夜不倦，魂生善处，不堕三涂。",
      "translated_text": "May the deceased, by their vow, be reborn in the Pure Land of the Northwest, where they may hear the scriptures and listen to the Dharma, face the Heavenly Worthy, enjoy natural clothing and sustenance, and dwell in carefree joy. May they be reborn in turn, attaining the supreme Dao. We bow our heads in reverence and take refuge in the sacred assembly of the Northwest.\n\nWith sincere devotion, we prostrate ourselves before the Supreme Compassionate Worthy of the Upper Realm, the Heavenly Worthy of the Infinite World of the Upper Realm who has attained the Dao, and the countless hosts of immortals, perfected beings, and sacred ranks. We pay homage to all, take refuge in them entirely, and seek their witness for our repentance. May all the sins of the deceased—from the beginningless past through countless kalpas, in every rebirth, through the three karmic actions and six senses, having committed such transgressions as killing, stealing, sexual misconduct, licentiousness, greed, stinginess, anger, cursing, delusion, perversion, deceitful speech, falsehood, harsh words, divisive speech, consuming intoxicants and meat, breaking fasts and violating precepts, betraying the Dao and slighting teachers, slandering scriptures, damaging sacred images, trampling upon sacred precincts, defiling sacred altars, cursing spirits, defying heaven and earth, oppressing the four classes, exposing oneself to the Three Luminaries, the five heinous acts, unfilial conduct, boasting of controlling wind and rain, and myriad transgressions beyond measure—be eradicated. May they, by their vow, be reborn in the Pure Land of the Upper Realm, hear the scriptures and listen to the Dharma, face the Heavenly Worthy, enjoy natural clothing and sustenance, dwell in carefree joy, be reborn in turn, and attain the supreme Dao. We bow our heads in reverence and take refuge in the sacred assembly of the Upper Realm.\n\nWith sincere devotion, we prostrate ourselves before the Supreme Compassionate Worthy of the Lower Realm, the Heavenly Worthy of the Infinite World of the Lower Realm who has attained the Dao, and the countless hosts of immortals, perfected beings, and sacred ranks. We pay homage to all, take refuge in them entirely, and seek their witness for our repentance. May all the sins of the deceased—from the beginningless past through countless kalpas, in every rebirth, through the three karmic actions and six senses, having committed such transgressions as killing, stealing, sexual misconduct, greed, stinginess, anger, cursing, delusion, perversion, deceitful speech, falsehood, harsh words, divisive speech, consuming intoxicants and meat, eating the five pungent roots, violating precepts and breaking fasts, slighting teachers and betraying the Dao, damaging sacred images, slandering scriptures, hypocrisy, gossiping, envy, harming the virtuous, slandering the loyal, sowing discord in families and states, breaking oaths and covenants, revealing sacred teachings, defiling sacred altars, trampling upon sacred precincts, praying to spirits and ghosts, spreading heretical doctrines, turning from the right to the wrong, doubting the true and believing in the vulgar, cursing spirits and ghosts, bewitching the wise, defying earth and heaven, rebuking wind and rain, oppressing the four classes, exposing oneself to the Three Luminaries, unfilial and disloyal conduct, unkindness and injustice, and countless transgressions beyond measure—through the six senses of eye, ear, nose, tongue, body, and mind, be eradicated. May they, by their vow, be reborn in the Pure Land of the Lower Realm, hear the scriptures and listen to the Dharma, face the Heavenly Worthy, enjoy natural clothing and sustenance, dwell in carefree joy, be reborn in turn, and attain the supreme Dao. We bow our heads in reverence and take refuge in the sacred assembly of the Lower Realm.\n\nThe Most High Lord of the Dao addressed the Perfected One of the Southern Culmen, who delivers lives: \"From the beginning, the Primordial Beginning has spread transformation throughout the ten directions, filling the five hundred million heavens and the three thousand Dao realms. Dividing his body and scattering his shadow, his true, responsive, and transformative Dharma takes form in response to conditions, expounding the Dharma to deliver beings, rescuing and aiding all, teaching and transforming men and women, and accomplishing the multitude of beings. In each realm, there are Heavenly Worthies who are lords, the Most High Lord Lao, true teachers, jade maidens and jade lads, immortals, perfected beings, sacred ranks, generals and warriors, vajra spirit-kings, twenty-four thousand spirit-offices, one hundred twenty bureaus and departments, star palaces and cloud halls, water residences and immortal palaces—all have officials in charge, examining and assessing sins and blessings. They hold banners and establish standards, grasp registers and wield talismans, soar through the void, recite scriptures, and perform the Dao. They increase blessings and repay evil, avert misfortune and dispel calamities, patrolling day and night to inspect gains and losses, all in accordance with the Primordial Beginning, assembling in the Great Luo. Though kalpas shift and change, the established Dharma remains unaltered. The ten directions and three realms share a single system; the Three Caverns divide their gates, adapting to the capacities of those who receive them. Confessing transgressions and seeking blessings proceed from the low to the high; repenting sins and seeking grace proceed from the heart to enter the Dao. To violate this decree is to follow heretical teachings. Therefore, I proclaim that one should first approach the ten directions, where spiritual resonance and response will naturally bring about numinous efficacy.\"\n\nThe Most High Lord of the Dao addressed all men and women of the three realms: \"Each should apply their mind, follow these instructions, and comply with them.\"\n\nThe Most High Lord of the Dao said: \"When a person dies, their transformation follows their past karma. They may be reborn in the household of a wealthy and noble king, in a family of upright and virtuous character, in a body of wisdom and intelligence, in a body of complete purity, in a body of longevity and joy, in the body of a poor and lowly servant, in a body of ugliness and malice, in a body of delusion and dullness, in a body of decay and filth, in a body of premature death and affliction, in a body of illness and suffering, in a body of borderland barbarians subject to killing, in the body of a pig or dog, in the body of a bird or beast, in the body of a fish, turtle, insect, or ant, in the body of a ghost, spirit, demon, or evil being, or in the long night of the Nine Dark Realms—all are received according to their original karma. The past and future are no different from the present; what one receives in this life comes from past karma. What one sows in this life becomes past karma. The common people, being foolish, see the clear retribution of sins and blessings in this world yet do not believe in the causes and conditions of past lives. It is like eating the five grains without knowing where they were sown. The verification of sins and blessings is like an echo and shadow. Diligence in repentance prevents sins from arising; diligence in cultivating goodness ensures blessings remain.\"\n\nThe Most High Lord of the Dao said: \"When a person first dies, from the first to the hundredth day, set up an image, invite Daoist priests to perform rituals and recitations, tirelessly day and night. Thus, the soul may be born in a good place and not fall into the Three Wretched Realms.\"",
      "overlap_context": "s, divisive speech, consuming intoxicants and meat, breaking fasts and violating precepts, betraying the Dao and slighting teachers, slandering scriptures, damaging sacred images, trampling upon sacred precincts, defiling sacred altars, cursing spirits, defying heaven and earth, oppressing the four classes, exposing oneself to the Three Luminaries, the five heinous acts, unfilial conduct, boasting of controlling wind and rain, and myriad transgressions beyond measure—may all these be eradicated.",
      "start_char": 2511,
      "end_char": 3757,
      "start_sentence": 69,
      "end_sentence": 95,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.50626730918884,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝转神度命经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "若随初一日，然灯造旛，写经铸像，度人各满百数，亡者即得受生十方净土，快乐之国，见世福利，无诸灾祸。 太上道君曰：送终之时，请道士路左烧香，念诵布施，放生道路。 灵官不拘亡魂，飞尸注鬼，不咎生人。 若墓左烧香诵经，则土地真官安稳亡魂，家宅不惊，凶注杀鬼，不干子孙。 南极真人，及诸圣众，伺声称善，稽首奉行。 太上洞玄灵宝转神度命经竟",
      "translated_text": "If on the first day, lamps are lit, banners are made, scriptures are copied, and images are cast—each act of deliverance reaching a hundred in number—the deceased shall immediately be reborn in the Pure Lands of the Ten Directions, the realms of bliss, where worldly blessings and prosperity abound, free from all calamities and misfortunes.\n\nThe Most High Lord of the Dao said: \"At the time of parting, invite Daoist priests to burn incense on the left side of the road, recite scriptures, and perform acts of almsgiving and life-release along the way. Thus, the Celestial Officers shall not detain the departed soul, nor shall flying corpses or vengeful ghosts afflict the living.\n\nIf incense is burned and scriptures are recited to the left of the grave, the Earthly Deities and True Officers shall pacify the departed soul, the household shall remain undisturbed, and malevolent spirits or murderous ghosts shall not trouble the descendants.\n\nThe Perfected One of the Southern Culmen and all the sagely hosts, hearing the virtuous sounds, bow in reverence and carry out the rites.\"\n\nHere ends *The Most High Numinous Treasure Scripture of Turning the Spirit and Delivering the Destiny*.",
      "overlap_context": "knowing where they were sown. The verification of sins and blessings is like an echo and shadow. Diligence in repentance prevents sins from arising; diligence in cultivating goodness ensures blessings remain.\"\n\nThe Most High Lord of the Dao said: \"When a person first dies, from the first to the hundredth day, set up an image, invite Daoist priests to perform rituals and recitations, tirelessly day and night. Thus, the soul may be born in a good place and not fall into the Three Wretched Realms.\"",
      "start_char": 3757,
      "end_char": 3924,
      "start_sentence": 96,
      "end_sentence": 101,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.631731033325195,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝转神度命经.txt",
        "category": "本文类"
      }
    }
  ]
}