{
  "source_id": "太上洞玄灵宝往生救苦妙经",
  "source_file": "chunked_daozang\\太上洞玄灵宝往生救苦妙经.json",
  "total_chunks": 6,
  "total_original_chars": 6950,
  "total_translated_chars": 33147,
  "total_translation_time": 158.09025764465332,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝往生救苦妙经.txt",
    "category": "本文类"
  },
  "full_translation": "**The Supreme Cavernous Mystery Numinous Treasure Sutra of Rebirth and Salvation from Suffering**\n\n**Sutra Title:** *The Supreme Cavernous Mystery Numinous Treasure Sutra of Rebirth and Salvation from Suffering*. Author unknown, likely composed during the Northern and Southern Dynasties or the Sui-Tang period. Exhorts cultivation of the Dao, prayer for blessings, and eradication of sins. One fascicle.\n\n**Base Text:** *Zhengtong Daoist Canon*, Cavernous Mystery Division, Textual Category.\n**Collated with:** Dunhuang manuscript P.2384.\n\n---\n\n#1 The Heavenly Worthy once wandered in the Fragrant Grove Garden, where he expounded the wondrous Dharma for all sentient beings, opening and revealing the wondrous gate. At that time, a five-colored, subtle, and marvelous radiance issued from his mouth, its light pervading the ten directions and the boundless worlds, even illuminating the Nine Dark Hells of the boundless nether realms. From heaven above to earth below, none remained unilluminated.\n\nAmong the assembly was a Perfected One named Dharma Comprehension, who rose from his seat, adjusted his robes and cap, prostrated himself, and knelt to address the Heavenly Worthy: \"All in this assembly, through merits and virtues accumulated over past lives, have met once in ten thousand kalpas with the Heavenly Worthy, who now proclaims the wondrous Dharma. All disciples, prostrating and kowtowing, their five limbs touching the ground, earnestly beseech the Dharma, their blood flowing upon the earth.\"\n\nThereupon, the Heavenly Worthy, moved by great compassion, raised his hand and snapped his fingers, admonishing his disciples: \"Excellent, excellent! You must think of all sentient beings with utmost care and reverence. This Dharma is profoundly deep; only a true person could have entreated its revelation. Now, for your sake, I shall expound these causes and conditions. Listen carefully, listen carefully! Guard purity, observe diligently, cherish and uphold it, revering it day and night, and never neglect the rites.\n\nIf there are sentient beings who, with haughty minds, do not believe, slight its reception, harbor slanderous thoughts, and fail to generate faith and reverence, their minds unguarded in purity—then in future lives, they shall become beasts, all manner of creeping things. Even in this present life, on the day of their rebirth, their eyebrows and beards shall fall out, their entire bodies erupting in sores, their flesh rotting away. They shall dwell exposed like birds, abandoned among men. All who see them shall feel revulsion; parents, wives, and children shall grieve to the breaking of their hearts. Such are those who suffer—how can their pain be endured? All this arises from the causes they themselves have wrought; it is not the fault of others. Each must reflect deeply and act with discernment.\"\n\n#2 Dharma Comprehension said: \"I do not yet understand—what kalpas did these sinful beings live in past lives? What are the roots of their suffering, and what karmic causes do they face? I humbly beseech the Heavenly Worthy to graciously bestow his compassion and elucidate the roots of their sins.\"\n\nThe Heavenly Worthy replied to the Perfected One of the Left Mystery: #3 \"These sinful beings each have their own karmic causes. Kalpa after kalpa, generation after generation, they establish blessings and create enmity, all arising from their own actions. The great sages of the ten directions never lead beings astray. Now, I wish to tell you all: listen carefully as I expound this sutra of the Three Wretched Realms and Five Sufferings.\n\nAll you disciples, men and women alike, in a single thought, arouse the mind of diligence. For seven days and seven nights, eat only vegetable fare and observe a strict fast. On the tenth day of the month, within a single day’s twelve hours, burn incense and perform the Dao-circumambulation. Invite the Daoist masters to establish the ritual arena, light forty-nine lamps, and hang banners and canopies. Recite this sutra seven times day and night, repenting for seven days and seven nights. Then you, all disciples, along with your fragrant-fire companions, the seven generations of ancestors, and past departed ones, shall have the roots of your karmic sins and transgressions entirely dissolved.\n\nIf there are those who have not encountered this sutra and fall into hell, yet utter the names of the Three Treasures even once, I shall follow their cry to deliver them, leading them out of hell and into heaven. How much more so for you, who for seven days and seven nights eat only vegetable fare, observe a strict fast, burn incense and light lamps, recite this sutra, and repent—all the past sins within your bodies shall be eradicated. If you do not repent, your sins shall be difficult to remove. All you disciples, listen carefully!\n\nAmong the Perfected Ones of the ten directions, all men and women—whether for the departed, the living, or themselves—may offer gold, silver, elephants, horses, carriages, clothing, bedding, or donate fields and dwellings. They may relinquish the precious treasures upon their bodies or other miscellaneous valuables, encouraging the creation of sutras and images. Or they may offer alms to the Dharma masters, dedicating their wealth and sincerity, approaching the masters to request the Dharma, recite the sutra, receive the precepts, bare their hearts in repentance, kowtow before the honored ones, and listen to the masters’ expositions. They may repent for their own thousand sins and myriad afflictions, wishing for their dissolution.\"\n\n#4 The Heavenly Worthy said: \"If there are those of true sincerity who can arouse a good mind and wish to create sutras and images, they should prepare whatever they can at that very moment, according to their means. Do not delay, lest the prior vow be lost. It shall become an enemy to the self, a fault spoken for ten thousand kalpas. If there are offerings of goods for vegetarian feasts or alms given to Dharma masters, they should be distributed immediately, not left for later. If the mind wavers, creating obstacles for others, then in the past, one shall surely enter hell, enduring all manner of suffering and affliction, becoming a hungry ghost. Or one may become an animal, and even if reborn as a human, one shall be deaf, blind, or afflicted with the six illnesses, poor and lowly. Or one may become an orphan, dependent on others for sustenance, suffering hunger, cold, and hardship, with none to show compassion. In the dead of night, one shall weep in sorrow, grief and distress filling the heart, never knowing joy. Or one may become a pig, dog, ox, sheep, or other beast, constantly subjected to slaughter, repaying past transgressions. Even if spoken of for countless kalpas, their sufferings cannot be exhausted.\n\nNow, I tell you, all disciples: cultivate yourselves with utmost care.\"\n\n#5 The Perfected One of the Left Mystery prostrated himself and addressed the Heavenly Worthy: \"I beseech you, for the sake of all sentient beings in the kalpas of karmic roots and sins, to expound this sutra of the Three Wretched Realms, Five Sufferings, and Eight Difficulties.\"\n\nBlind and deaf beings alike all raised their heads to listen. Those who heard this sutra universally received joy, rejoicing with delight, bowing their heads in reverence, wishing to hear more.\n\nThe Heavenly Worthy addressed all sentient beings: \"Good men and good women, I have often surveyed the heavens and wandered through the hells, where I have seen suffering beings bearing great yokes upon their necks, wooden shackles upon their arms, heavy fetters upon their feet, iron spikes upon their bodies, fire in their mouths, blades and needles piercing their backs, sword trees impaling their hearts, evil birds pecking out their eyes, iron plows tearing their tongues, molten copper poured into their mouths, every joint ablaze, iron pellets burning their throats until they rot, cauldrons of boiling water seething and simmering, copper pillars pressing against their bodies. Some ascend mountains of knives, their flesh and bones ground to pulp. Some enter furnaces of charcoal, their fat dripping and igniting, then are cast into freezing ice, piercing their hearts and bones. Some are made to lie upon iron beds, their bodies festered and rotting, transforming into ghostly forms, their shapes distorted beyond recognition. Some lie within fields of snow, their hearts and entrails torn apart, blades cutting into their flesh until blood and muscle turn to mud, their bones ground to dust, their sinews gathered into heaps, only to be reborn as hungry ghosts. Ox-headed demons raise their clubs, hell wardens wield their forks, driving and tormenting the sinners without respite. For countless kalpas they revolve in this cycle—when shall they ever return?\n\nAll you sentient beings, strive to restrain yourselves and mortify your bodies, diligently cultivate merit and virtue. All you disciples and assemblies, rouse your original resolve—only then may you attain liberation.\"\n\nBefore the words were finished, the Perfected One of the Left Mystery again addressed the Heavenly Worthy: \"I pray, what karmic offenses did these beings commit in their past lives? What cruel acts did they perform? Which precepts did they violate? The ignorant among us do not understand. We beseech the Heavenly Worthy to take pity on those suffering punishment, to reveal their transgressions so that they may be cautious and refrain from further wrongdoing. We do not know what meritorious deeds to cultivate to eradicate these karmic roots.\"\n\nThen all the assemblies aroused the Dao-mind, bowing their heads to the Heavenly Worthy, wishing to hear the explicit teaching.\n\nThe Heavenly Worthy declared: \"All you assemblies, if your hearts delight in hearing this sutra of the Two Wretched Paths, Five Sufferings, and Eight Difficulties, listen carefully and take it to heart. This sutra is subtle and wondrous, beyond conception. Among all sutras, it is foremost. Among the highest teachings, it is foremost. In repentance and deliverance of the deceased, in rescuing from suffering, it is foremost. This sutra is noble, the king of all sutras.\n\nThe Three Wretched Paths are: first, the hell realm; second, the animal realm; third, the hungry ghost realm. These are called the Three Wretched Paths.\n\nThe Five Sufferings are: first, embracing the copper pillar; second, treading the mountain of knives; third, climbing the tree of swords; fourth, entering the cauldron of boiling water; fifth, swallowing fire and eating coals. These are called the Five Sufferings.\n\nThe Eight Difficulties are: first, being born and escaping the Three Evil Realms; second, having escaped and become human, leaving the female form to become male; third, having attained a male body, possessing all six senses and four limbs; fourth, possessing all six senses and being born in the Central Kingdom; fifth, being born in the Central Kingdom and encountering a sagely ruler and parents; sixth, encountering a sagely ruler and cultivating the Dao with joy throughout one’s life, with a kind and benevolent heart; seventh, having cultivated a benevolent heart and believing in the Dao of immortality; eighth, believing in the Dao and virtue yet not being born in an era of great peace under a sagely emperor, and for ten thousand kalpas not encountering the Three Treasures. These are called the Eight Difficulties.\n\nThe Three Calamities are: first, the calamity of conscription and great warfare; second, the calamity of chronic illness throughout the year; third, the calamity of encountering great floods while traveling or at rest. These are called the Three Calamities.\n\nThe Five Sufferings are: first, the suffering of drowning in water; second, the suffering of burning in fire; third, the suffering of being killed or wounded by bandits; fourth, the suffering of being possessed by demonic spirits; fifth, the suffering of all poisons, stings, bites, and deep pain. These are called the Five Sufferings.\n\nThe Five Turbidities are: first, the turbidity of perverse views; second, the turbidity of the kalpa’s decline, when days and months grow short; third, the turbidity of sentient beings, their spirits dimmed; fourth, the turbidity of afflictions, with anger and strife; fifth, the turbidity of the lifespan, with premature death, wives and children parted midway, orphaned boys and girls grieving in sorrow. These are called the Five Turbidities.\n\nThe Eight Practices are: first, enduring wrongs without complaint; second, yielding virtue to others; third, not desiring what others desire; fourth, tolerating matters without seeking redress; fifth, distancing oneself from the unprincipled and concealing oneself in quietude; sixth, wholeheartedly serving the state, mindful of the Three Treasures, burning incense to the sun and moon, maintaining perpetual fasting, making offerings to those who have left the household life, never violating benevolence and trust; seventh, never betraying the scriptures and precepts, living in the world without breaking fasts, diligently sweeping clean rooms, tending lamps and stoves, rescuing the poor, the lowly, women in childbirth, the old, the sick, the orphaned, the weak, and all deficient beings—upon seeing them, arousing a heart of compassion; eighth, dedicating one’s life to the Dao, never slandering those who have left the household life, harboring no judgments, constantly reciting scriptures, seeing all living beings and arousing a heart of compassion, treating all equally, without self or other, good and evil, beauty and ugliness all the same as one’s own body. These are called the Eight Practices.\n\nThe Four Immeasurables are: first, immeasurable kindness; second, immeasurable love; third, immeasurable goodness; fourth, immeasurable patience. These are called the Four Immeasurables.\n\nThe Six Dusts are: first, the ear hearing gong and shang tones; second, the eye seeing blue, yellow, white, black, and red; third, the nose knowing fragrance and stench; fourth, the body knowing hardness and softness, dryness and dampness; fifth, the tongue knowing pungent, sour, bitter, harsh, and sweet; sixth, the mind knowing good and evil, joy and anger, sorrow and happiness. That which comes from without is called dust; that which stirs within is called emotion.\"\n\nThese are called the Six Emotions and Six Dusts.\n\nThe Six Penetrations are: ear, eye, nose, body, tongue, and mind—these are called the Six Penetrations, the Six Roots sharing commonality.\n\nThe Three Poisons are: first, greed and lust; second, anger and hatred; third, ignorance and delusion. These are called the Three Poisons.\n\nThe Heavenly Worthy addressed Left Mystery Perfected One, saying: \"When I previously expounded this Scripture of the Three Paths and Five Sufferings for all sentient beings, all—whether near or far—attained wisdom and understanding, entering the Dharma Gate together.\"\n\nLeft Mystery Perfected One again addressed the Heavenly Worthy, saying: \"All sentient beings whose roots are in sin, having now heard the Heavenly Worthy expound the retribution of sin and blessing, including those beneath your seat and all disciples—hungry ghosts, animals, and beings suffering from cold, hunger, and hardship—upon hearing this scripture, all clearly understood. Each has cultivated and refined themselves, no longer daring to commit further transgressions. For those who have passed away, if they are in hell enduring the transgressions of the Three Paths, Five Sufferings, and Eight Difficulties, what method is foremost to save the departed and relieve their suffering?\"\n\nThe Heavenly Worthy addressed the Perfected One, saying: \"If you wish to save the departed, at the time of their passing, seek masters from all directions to proclaim the precepts and repentance for the deceased. Have them recite and transfer the scripture at the roadside tomb, inviting masters to burn incense for the departed, praise and repent, and dedicate resources to the deceased, including the possessions of their sons and daughters, redirecting them for almsgiving. This accrues the deepest merit. On the forty-ninth day, the hundredth day, and other commemorative days, reduce offerings, commission scriptures and images, observe fasts, and light forty-nine lamps. Make banners of forty-nine feet of silk and hang them on tall poles. If this cannot be accomplished, then make small banners of seven feet, commission the *Scripture of Lingbao* and the *Scripture of the Five Sufferings*, and recite them day and night seven times. Within the forty-nine days, the sins of the departed will be determined. Within a hundred days, they will be assigned to one of the Five Paths. The method just expounded for saving the departed from suffering is foremost.\"\n\nLeft Mystery Perfected One again addressed the Heavenly Worthy, saying: \"Among those in the Three Paths, Five Sufferings, and Eight Difficulties, all sentient beings who have heard this scripture—can the departed, following their vows, be reborn in places of bliss? May they hear of this?\"\n\nThe Heavenly Worthy addressed Left Mystery Perfected One, saying: \"All the living and the dead who hear me expound this scripture should cultivate merit and virtue, following their vows to be reborn. Listen to my Five Remembrances. For the living and the dead, those who recite this scripture seven times will enable all sentient beings and the departed to be reborn according to their vows as novices, leaving the household life to serve the Three Treasures.\"\n\nThe Dharma Explanation states: \"Now, hearing that the Heavenly Worthy is about to expound the text of the Five Remembrances, all sentient beings rejoice and leap with joy, wholeheartedly desiring to hear.\"\n\nThe Heavenly Worthy addressed Left Mystery Perfected One, saying: \"Those who wish to recite my Five Remembrances must observe long fasts, maintain purity, wear clean garments, single-mindedly invite a master, and receive and practice according to the Dharma. If this is not done, they will surely fall into hell with no return. Strive diligently, maintain purity, uphold and receive with wholehearted devotion, never daring to lose proper decorum.\"\n\nThe Heavenly Worthy addressed Left Mystery Perfected One and all human and ghost beings, saying: \"Listen with a tranquil mind to the Scripture of the Five Remembrances.\n\n**First Remembrance:**\nConstantly cherish the Three Treasures with compassion,\nWishing to deliver and lift from the fiery pit.\nMyriad sins and a thousand calamities all disperse,\nThe lame and sick, long-bound, all can walk.\nDemons and evil ghosts are imprisoned in hell,\nMen and women of the world generate the mind for the Dao.\nThe five rebellious enemies all rejoice together,\nCauldrons of boiling water transform into lotus ponds.\nAll sentient beings in the Dharma realm chant goodness,\nThe departed follow and are reborn.\n**Second Remembrance:**\nSeeing all the multitudes before me,\nStrive to observe long fasts and build bridges.\nRecall the suffering of hell and the Three Paths,\nDiligently practice almsgiving and burn incense.\nReceive the precepts, recite scriptures, and honor with reverence,\nAll the departed ascend to heaven.\nThe Heavenly Worthy snaps his fingers, addressing all,\nThe dark hells swiftly generate light.\nAll sentient beings in the Dharma realm diligently cultivate the Dao,\nOne day they will be reborn in the center.\n**Third Remembrance:**\nThe departed are most pitiable,\nOnce in the tomb, they rarely see the sky.\nThey refused to establish the Dao field,\nReceiving mud money at the four seasons and eight festivals.\nIn hell, they endure suffering and affliction,\nTheir mouths cry out in vain to the August Heaven.\nIn life, they refused to cultivate merit and virtue,\nNow shackled in iron, beaten with rods and whips.\nIn a single day, they die ten thousand deaths,\nEven as the six kinds of livestock for years.\nHungry and cold, their backs broken, unable to speak,\nAfter a year or two, they are pierced through the nose and led.\nFilial sons and daughters perform meritorious deeds,\nThe five rebellious sons and daughters sever karmic ties.\nSated with wine and meat, they seek livelihoods,\nYet not a single coin is offered for the departed.\nIf in life they had performed abundant merit,\nThe departed would be reborn before the Three Treasures.\n**Fourth Remembrance:**\nSentient beings lack a good mind,\nSlandering the Three Treasures, they sink into perdition.\nThough entering the Dao field, their intentions are impure,\nPraising and speaking of the left-home ones.\nThey are made to embrace copper pillars and iron beds,\nSword trees and knife mountains press upon their bodies.\nIn agony, they seek a master but find none,\nOx-headed hell guards forcibly approach.\nIron forks thrust them into cauldrons of boiling water,\nPestles pound, mills grind them into fine dust.\nThey constantly endure all manner of suffering,\nAll because they slandered the left-home ones.\nThose who leave home do not necessarily enter hell,\nAll sentient beings scorn the mind for the Dao.\nI tell all sentient beings:\nStrive to firmly uphold a good mind for the Dao.\nAll sentient beings, turn your thoughts to right mindfulness,\nFollow your vows to be reborn in the Fragrant Grove.\n**Fifth Remembrance:**\nFellow students of the Five Remembrances, leave home early,\nThe heavy hindrances of ignorance sprout the seed of wisdom.\nHell transforms into the bliss of heaven,\nIron beds and copper pillars produce lotus flowers.\nAll sentient beings receive happiness,\nAccompanied by three or five, they ascend on clouds.\nAt all six periods, they constantly hear the sound of bells and chimes,\nWishing their descendants would always leave home.\nClad in Dharma robes, they convert the multitudes,\nTheir mouths recite the *Lingbao*, severing demonic evil.\nThe seven generations of ancestors ascend to heaven,\nThe departed are reborn to serve amidst fragrant flowers.\"\n\nThe Heavenly Worthy addressed Left Mystery Perfected One, saying: \"Previously, I expounded these Five Remembrances for all sentient beings, clearly explaining this scripture, yet I fear they may not yet understand.\"\n\n\"All you Perfected Ones of the ten directions, expound these teachings again with skillful means, with utmost care and diligence. If there are sentient beings who awaken understanding in their hearts, maintain single-minded right mindfulness, protect purity, and uphold this scripture—those who virtuously recite it, or dedicate it to the living or deceased, travelers, the ill, or all beings—by directing their thoughts toward it, they will eradicate the sins of ten thousand kalpas for both themselves and others. In their dreams, they will constantly behold the Three Treasures, encounter good spiritual friends, and wherever they are reborn, they will always enjoy happiness. If they maintain long-term purity, observe the precepts, burn incense, and pay homage day and night during the six periods without ever forgetting, then in this life and the next, they will carry the scripture and precepts within, leave home as novices, and make offerings to the Three Treasures. If they establish meditation halls, copy and uphold the scripture, adorn and display its scrolls, and propagate it to those who have not yet heard, all who see and hear it will accumulate boundless merit.\n\nLeft Mystery Perfected One bowed in reverence and addressed the Heavenly Worthy, saying: 'All sentient beings are blindly attached, consumed by greed, anger, and hatred, their hearts not yet turned toward the Dao. Even if they do turn their hearts, they may offer a hundred fine horses, a thousand jeweled chariots, and all manner of external goods as alms, yet their minds remain coarse and clamorous, unaware of the merit they gain.'\n\nThe Heavenly Worthy, moved by compassion, expounded further. All present bowed their heads in right mindfulness and wholeheartedly vowed to practice.\n\nThe Heavenly Worthy addressed Left Mystery Perfected One, saying: 'All sentient beings who do not believe in or honor the Three Treasures, scriptures, images, purity, or precepts—observe the laity: among them are the poor, the lowly, the deaf, the blind, those afflicted with the six illnesses, those lacking in good appearance, and those who fall short of human status. If there are beings who wish to practice almsgiving but do not generate faith or reverence, nor honor the Three Treasures, such individuals will surely receive this retribution. It is like a mirror reflecting a person: clarity and purity follow one’s original nature, with no杂见. If one is black, black is seen; if white, white is seen—all follows the root. Sin is likewise. If you do not believe, hell is present before you. Hell resides within the human body; there is no need to seek it afar.'\n\nAll in the ten directions bowed in reverence, wholeheartedly turning toward the Dao, wishing to see and hear.\n\nThe Heavenly Worthy addressed all present: 'After my passing, if there are sentient beings who obtain this scripture, uphold, recite, and protect its purity, or skillfully expound it for others—if there are those who, lacking faith, defile it with impurity—they will incur sins in the future and be reborn as beasts. But if there are beings who relinquish their wealth, treasures, and external goods to make offerings, dedicating them to scriptures and images, or to purity feasts and life ransoming, they will gain merit in the future, assuredly ascend to heaven, forever dwelling in noble households, kalpa after kalpa, generation after generation, bound to good causes. They will eradicate the sins of ten thousand kalpas and be delivered to ascend as immortals.'\n\nThe Heavenly Worthy continued: 'All you sentient beings, listen carefully as I explain the five kinds of almsgiving and their merits, which should never depart from your thoughts. First, if there are beings who, of their own volition, practice almsgiving and encourage others to offer support to Dharma masters for the creation of scriptures and images—even a single coin—will receive a reward forty thousand times over. Ten thousand coins or more yield an immeasurable reward. For ten thousand kalpas, they will constantly enjoy happiness, teaching and transforming all, forever serving as masters to others.\n\nSecond, if there are beings who practice almsgiving and encourage others to support the copying of scriptures, as well as the adornment of meditation halls with banners, flowers, lamps, and candles—even a single coin—will receive a reward forty thousand times over. Ten thousand coins or more yield an immeasurable reward. They will be reborn in the central lands, endowed with wisdom and clarity, constantly beholding the Three Treasures, forever free from afflictions, abiding in effortless bliss.\n\nThird, if there are beings who suddenly generate great compassion and encourage others to practice almsgiving for the poor, the lowly, the orphaned, the weak, the elderly, the sick, the hungry, widows, the cold, travelers, and sojourners—even a single coin—will receive a reward twenty-five thousand times over. Ten thousand coins or more yield an immeasurable reward. Wherever they are reborn, they will always enjoy wealth and nobility, with clothing and food naturally provided.\n\nFourth, if there are beings who, for the sake of past and present parents, suddenly generate vast vows and encourage all to practice almsgiving among Dharma masters, novices, and faithful men and women—even a single coin—will receive a reward twenty thousand times over. Ten thousand coins or more yield an immeasurable reward. Through skillful encouragement, they will turn others’ hearts toward the Dao. In this life, they will receive their reward, leave home, attain longevity, constantly expound the scriptures, and inspire good thoughts in others.\n\nFifth, if there are beings who generate good thoughts, take pity on all, and encourage almsgiving to teach butchers to cease killing, to turn their hearts toward ransoming lives, to constantly recite the Dao, observe the precepts, and practice accordingly—extending to prisoners, women in childbirth, the hungry, the cold, all creatures, the five grave offenders, and the unfilial—if they reverse their minds to generate compassion, restrain their speech, turn\n\nThough their blessings may be abundant, they are insufficient to offset their transgressions; not a single fragment of merit remains. Only when one calculates merits to counterbalance faults does one begin to comprehend the nature of sin and blessing.\n\nI exhort all men and women: cease from further transgressions, and blessings shall endure. Through this causal connection, it is called \"ten-thousandfold reward.\" All assembled here, be vigilant—most vigilant!\n\nAt that time, all in the assembly praised the teaching, bowed their heads in reverence, paid homage to the Heavenly Worthy, and respectfully withdrew.\n\nThe Heavenly Worthy, moved by compassion, further expounded in verse:\n\nAll dharmas in their essence\nAre pure and ever serene.\nRetribution arises from the mind—\nSuffering and joy are not external causes.\nHell and heaven,\nClearly lie before your eyes.\nThe future is profoundly obscure;\nExamine and contemplate it deeply.\nReflect on your present life,\nWhere delusion leads you astray.\nThe mind cannot attain clarity,\nBound and entangled by its own knots.\nIn darkness, what can be seen or known?\nTime flows on like a passing stream.\nIn an instant, youthful radiance fades,\nAnd one swiftly descends to the Yellow Springs.\nGood and evil are not two dharmas;\nRight and wrong share a single source.\nThose who perceive them generate distinctions,\nFor their minds are clouded by ignorance.\nFollowing one’s desires, one enters the gates of celestial immortals;\nDefying them, one passes through the doors of hell.\nThrough profound reflection and self-realization,\nOne becomes the Supreme Worthy.\nAlas for the deluded,\nWho know not the true Dao!\nLike rotting reins controlling six horses,\nOne lives in constant fear of a sudden bolt.\nClinging thoughts arise moment by moment,\nAnd faults lie in the restless mind.\nAbandon form, forget good and evil,\nSeal the senses and close the gates.\nBirth and death are retributive responses,\nSurely arising from this very body.\nIf one discerns existence and cessation,\nIn quiescence, one returns to the Real.\nEmerging into life brings differentiation;\nEntering death is utterly equal.\nEarth, water, fire, and wind disperse,\nYet each finds affinity in its place.\nHeaven and earth govern the great order,\nWith no intent toward any individual.\nCalculating the principles of rebirth,\nIt is neither fruit nor cause.\nCollect the mind and cultivate inner conduct—\nEnlightenment comes in less than ten days.\nIf the mind races toward external realms,\nOne remains in darkness without bound.\nAmong all treasuries of merit,\nPraise stands foremost.\nWith expedient means, one guides those lost at the ford;\nThrough compassion, one skillfully leads them.\nAccumulating good becomes a field of blessings;\nAccumulating evil breeds calamity and misfortune.\nProvisional names are inherently empty;\nWhat constancy lies in skillful adaptation?\nDeluded and unaware,\nOne remains lost for days unending.\nTerrified of hell,\nOne suffers torment in boiling cauldrons and hanging agonies.\nI open the source of still waters,\nTo wash away the dust of habitual defilements.\nOnce body and mind are purified,\nFor endless kalpas, they shall not decay.\nOf old, I heard that those who uphold the precepts\nCultivate forbearance and attain uprightness.\nNow, beholding the Heavenly Worthy,\nWords cannot express His praise.\nEighty-one marks of excellence shine forth,\nSeventy-two signs of purity adorn Him.\nHis body is lustrous as jade, firm as vajra,\nForever free from decline or decay.\nHis cinnabar lips seem about to part,\nHis radiant teeth gleam in response.\nHis voice is naturally gentle,\nCompassion flows from His inherent nature.\nHis wisdom is like a bellows and key,\nHis meditative mind like a mirror of water.\nThis arises from upholding the precepts,\nAttaining fruition as a Great Sage.\n\nThus concludes *The Supreme Cavernous Numinous Treasure Sutra of Rebirth and Salvation from Suffering*.\n\nNow, the Heavenly Worthy once more addressed the assembly, saying:\n\n\"All beings within the Dharma Realm, heed my words! I now proclaim to all living beings: those who have perished in the past and emerged from hell shall ascend upon clouds and mist, their steps light upon the turning axis of the Dao. Though their cries of anguish resound, their sins are thus.\n\nI declare to you, all beings: for those who have committed the four hundred myriad transgressions—whether starving elders, laboring women, or those who have fallen into rebirth—if they make offerings among the assembly to Dharma masters and novices, to pure men and women of faith, all shall be spared the trials of childbirth, their mouths freed from restraint. Before the Three Treasures, if they present even a single piece of incense, their merits shall be boundless, their blessings measureless.\"\n\nHere ends the text of the Dunhuang manuscript; the following verses are absent.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上洞玄灵宝往生救苦妙经 经名：太上洞玄灵宝往生救苦妙经。 撰人不详，约出於南北朝或隋唐。 劝修道祈福灭罪。 一卷。 底本出处：《正统道藏》洞玄部本文类。 参校本：敦煌P.2384号残写本。 太上洞玄灵宝往生救苦妙经＃1 天尊昔游香林园中，为一切众生宣说妙法，开阐妙门。 尔时即有五色微妙光明，从口中出，其光徧照十方无极世界，及无极九幽地狱之中。 天上地下，无不光照。 众中有一真人，名曰法解，从座而起，严整衣冠，稽首长跪，上白天尊言：合座诸众，前生前业，积福累功，万劫一会，得遇天尊，宣说妙法。 诸徒弟子，稽首叩头，五体投地，殷勤请法，血流满地。 於是天尊施大慈悲，举手弹指，念诸弟子：善哉善哉，可念众生，殷勤珍重。 此法实深，非是真人，不能启请。 吾今所以为汝等故，说此因缘，谛听谛听，护净遵奉，珍重受持，昼夜恭敬，勿使失仪。 若有众生，高心不信，轻慢受持，心生诽谤，不生信敬，心不护净。 若当来世作畜生，一切蠢动，又及见存受生之日，眉须堕落，徧体生疮，举身烂坏＃2，鸟栖露宿，弃於人间。 百姓见者，皆悉恶心，父母妻儿，肝肠断绝。 如此之辈，受苦之人，痛当奈何。 并是众生，缘身自造，非是他悞，各各自思，审而奉行＃3。 法解曰：不审此等罪人，前生何劫，受罪之根，缘对何因。 惟愿天尊曲垂慈泽，喻以罪根。 天尊答左玄真人＃4曰：此等罪人，前生各有因缘。 劫劫代代，立福造怨，种种相生，悉由身造。 十方大圣，终不悞人。 吾今欲告汝等，各自谛听，闻我说是三涂五苦之经。 汝等弟子，一切男女，一念之中，发心精进，七日七夜，菜食长斋。 月当十直，一日之中，十二时节，烧香行道，请诸道师，建立道场。 然四十九灯，悬诸旛盖，转读此经，昼夜七徧，七日七夜忏悔，汝等诸徒弟子，香火知识，七祖父母，过去亡人，宿业罪根，并得解脱。 若有诸人，未遇此经，堕落地狱，一声称扬三宝名者，我即寻声往救，出离地狱，即上天堂。 况复汝等七日七夜，菜食长斋，烧香然灯，转读此经忏悔，汝等一切弟子，身中所有宿罪，并得除灭。 若不忏悔，罪难可除。 汝等弟子，审谛听之。 或有十方真人，一切男女，或为亡人，或为见在，又及己身，或将金银、象马车乘、衣服卧具之物，或舍田宅，脱身上珍奇及诸杂宝，劝造经像，或将布施与法师＃5，以财质心，就师请法，转读经文，及以受戒，披心忏悔，叩头尊前，听师讲说，自忏己身千罪万恼，愿得消灭。 天尊曰：若有真心＃6，能发善意，欲造经像，当时随其多少分数，即以具办。 勿留在后，恐失前愿。 与身为怨，万劫口过，若有施物与斋食，及与法师布施之物，当即分付，勿留在后。 心不＃7东西，与人作业，若当过去，必入地狱，受诸苦恼，身为饿鬼。 或作畜生，纵得人身，聋瞽六疾，贫穷下贱。 或作孤儿，寄他养育，饥寒困苦，无人怜爱。 半夜三更，思忆号哭，愁恼在心，未尝有乐＃8。 或作猪狗，牛羊杂兽，恒被生杀，以报前愆，众劫说之，亦难可尽。 吾今告汝诸徒弟子，审谛修身。 左玄真人稽首作礼＃9，上白天尊言：愿为一切众劫罪根众生，说此三涂五苦八难之经。",
      "translated_text": "**The Supreme Cavernous Mystery Numinous Treasure Sutra of Rebirth and Salvation from Suffering**\n\n**Sutra Title:** *The Supreme Cavernous Mystery Numinous Treasure Sutra of Rebirth and Salvation from Suffering*. Author unknown, likely composed during the Northern and Southern Dynasties or the Sui-Tang period. Exhorts cultivation of the Dao, prayer for blessings, and eradication of sins. One fascicle.\n\n**Base Text:** *Zhengtong Daoist Canon*, Cavernous Mystery Division, Textual Category.\n**Collated with:** Dunhuang manuscript P.2384.\n\n---\n\n#1 The Heavenly Worthy once wandered in the Fragrant Grove Garden, where he expounded the wondrous Dharma for all sentient beings, opening and revealing the wondrous gate. At that time, a five-colored, subtle, and marvelous radiance issued from his mouth, its light pervading the ten directions and the boundless worlds, even illuminating the Nine Dark Hells of the boundless nether realms. From heaven above to earth below, none remained unilluminated.\n\nAmong the assembly was a Perfected One named Dharma Comprehension, who rose from his seat, adjusted his robes and cap, prostrated himself, and knelt to address the Heavenly Worthy: \"All in this assembly, through merits and virtues accumulated over past lives, have met once in ten thousand kalpas with the Heavenly Worthy, who now proclaims the wondrous Dharma. All disciples, prostrating and kowtowing, their five limbs touching the ground, earnestly beseech the Dharma, their blood flowing upon the earth.\"\n\nThereupon, the Heavenly Worthy, moved by great compassion, raised his hand and snapped his fingers, admonishing his disciples: \"Excellent, excellent! You must think of all sentient beings with utmost care and reverence. This Dharma is profoundly deep; only a true person could have entreated its revelation. Now, for your sake, I shall expound these causes and conditions. Listen carefully, listen carefully! Guard purity, observe diligently, cherish and uphold it, revering it day and night, and never neglect the rites.\n\nIf there are sentient beings who, with haughty minds, do not believe, slight its reception, harbor slanderous thoughts, and fail to generate faith and reverence, their minds unguarded in purity—then in future lives, they shall become beasts, all manner of creeping things. Even in this present life, on the day of their rebirth, their eyebrows and beards shall fall out, their entire bodies erupting in sores, their flesh rotting away. They shall dwell exposed like birds, abandoned among men. All who see them shall feel revulsion; parents, wives, and children shall grieve to the breaking of their hearts. Such are those who suffer—how can their pain be endured? All this arises from the causes they themselves have wrought; it is not the fault of others. Each must reflect deeply and act with discernment.\"\n\n#2 Dharma Comprehension said: \"I do not yet understand—what kalpas did these sinful beings live in past lives? What are the roots of their suffering, and what karmic causes do they face? I humbly beseech the Heavenly Worthy to graciously bestow his compassion and elucidate the roots of their sins.\"\n\nThe Heavenly Worthy replied to the Perfected One of the Left Mystery: #3 \"These sinful beings each have their own karmic causes. Kalpa after kalpa, generation after generation, they establish blessings and create enmity, all arising from their own actions. The great sages of the ten directions never lead beings astray. Now, I wish to tell you all: listen carefully as I expound this sutra of the Three Wretched Realms and Five Sufferings.\n\nAll you disciples, men and women alike, in a single thought, arouse the mind of diligence. For seven days and seven nights, eat only vegetable fare and observe a strict fast. On the tenth day of the month, within a single day’s twelve hours, burn incense and perform the Dao-circumambulation. Invite the Daoist masters to establish the ritual arena, light forty-nine lamps, and hang banners and canopies. Recite this sutra seven times day and night, repenting for seven days and seven nights. Then you, all disciples, along with your fragrant-fire companions, the seven generations of ancestors, and past departed ones, shall have the roots of your karmic sins and transgressions entirely dissolved.\n\nIf there are those who have not encountered this sutra and fall into hell, yet utter the names of the Three Treasures even once, I shall follow their cry to deliver them, leading them out of hell and into heaven. How much more so for you, who for seven days and seven nights eat only vegetable fare, observe a strict fast, burn incense and light lamps, recite this sutra, and repent—all the past sins within your bodies shall be eradicated. If you do not repent, your sins shall be difficult to remove. All you disciples, listen carefully!\n\nAmong the Perfected Ones of the ten directions, all men and women—whether for the departed, the living, or themselves—may offer gold, silver, elephants, horses, carriages, clothing, bedding, or donate fields and dwellings. They may relinquish the precious treasures upon their bodies or other miscellaneous valuables, encouraging the creation of sutras and images. Or they may offer alms to the Dharma masters, dedicating their wealth and sincerity, approaching the masters to request the Dharma, recite the sutra, receive the precepts, bare their hearts in repentance, kowtow before the honored ones, and listen to the masters’ expositions. They may repent for their own thousand sins and myriad afflictions, wishing for their dissolution.\"\n\n#4 The Heavenly Worthy said: \"If there are those of true sincerity who can arouse a good mind and wish to create sutras and images, they should prepare whatever they can at that very moment, according to their means. Do not delay, lest the prior vow be lost. It shall become an enemy to the self, a fault spoken for ten thousand kalpas. If there are offerings of goods for vegetarian feasts or alms given to Dharma masters, they should be distributed immediately, not left for later. If the mind wavers, creating obstacles for others, then in the past, one shall surely enter hell, enduring all manner of suffering and affliction, becoming a hungry ghost. Or one may become an animal, and even if reborn as a human, one shall be deaf, blind, or afflicted with the six illnesses, poor and lowly. Or one may become an orphan, dependent on others for sustenance, suffering hunger, cold, and hardship, with none to show compassion. In the dead of night, one shall weep in sorrow, grief and distress filling the heart, never knowing joy. Or one may become a pig, dog, ox, sheep, or other beast, constantly subjected to slaughter, repaying past transgressions. Even if spoken of for countless kalpas, their sufferings cannot be exhausted.\n\nNow, I tell you, all disciples: cultivate yourselves with utmost care.\"\n\n#5 The Perfected One of the Left Mystery prostrated himself and addressed the Heavenly Worthy: \"I beseech you, for the sake of all sentient beings in the kalpas of karmic roots and sins, to expound this sutra of the Three Wretched Realms, Five Sufferings, and Eight Difficulties.\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1239,
      "start_sentence": 0,
      "end_sentence": 44,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.171743631362915,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝往生救苦妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "盲聋众生，齐皆＃10仰听，闻经之者，普受快乐，皆悉欢喜，稽首愿闻。 天尊告一切众生＃11曰：善男子，善女人等，我尝历观诸天，及游於地狱之中，见有受罪众生，项负＃12大枷，臂挂双杻，脚着大械，身负铁锥，口中衔火，刀针刺背，剑树撞心，恶鸟啄睛，铁犁耕舌，镕铜灌口，百节火然，烧铁为丸，入喉＃13喉烂，镬汤煎煮，铜柱逼身。 或上刀山，骨肉糜碎。 或入炉炭，脂滴火然，转入寒冰，伤心切骨，遣卧铁床，溃烂＃14床间，变作鬼身，毁形难见。 或在雪田之内，分擘＃15心肠，锋刃到身，血肉如泥＃16，硙作微尘，扬骨聚筋，还成饿鬼，牛头举棒，狱卒＃17擎叉，驱役罪人，未尝有歇，轮回亿劫，何日得还。 汝等众生，努力克己削身，勤修功德。 汝等弟子，及诸众等，各励本心，当得解脱。 言语未讫，左玄真人又白天尊曰＃19：未审此等众生，前生前业，作何罪衅，行何楚毒，触何戒律。 众等愚痴，不自晓了，唯愿天尊，哀愍众等受罪之人，示以所犯＃20当使慎之，勿得更造。 不知修建行何功德，拔此罪根。 时诸众等，各发道心，稽首天尊，愿闻显说。 天尊告曰＃21：卿等诸众，心欲乐闻，说些二涂五苦八难之经者，宜各＃22谛听在心。 此经微妙，不可思议。 众经之中，最为第一。 上品之中，最为第一。 忏悔拔出过去亡人，救难之中，最为第一。 此经尊贵，众经中王。 向言三涂者，地狱道一，畜生道二，饿鬼道三。 是名三涂。 五苦者，抱铜柱一，履刀山二，循剑树三，入镬汤四，吞火食炭五，是名五苦。 八难者，夫人生得免三恶道一； 既得为人，去女为男二； 即得男身，六情四体貌具三； 六情具足，得生中国四； 得生中国，更值＃23有道国君父母五； 值有道之君，一生乐道＃24； 慈仁善心六； 善心既发，信道长生七； 既信道德，不生＃25逢太平帝主，万劫与三宝相遇八。 故曰八难。 三灾者，征行大兵，为一灾； 终年长病，为二灾； 行住逢大水，为三灾。 是名三灾。 五苦＃26者，一水漂溺之苦，二火燔灼＃27之苦，三盗贼杀伤之苦，四鬼魅着人之苦，五一切毒螫触啮痛深之苦。 是名五苦＃28。 五浊者，一见浊邪物＃29，二劫运浊，日月短促； 三众生浊，精神不明； 四烦恼浊，嗔恚斗争； 五命限浊，短夭少亡，妇儿妻子，中道离别，孤男孤女，痛苦伤心。 是名五浊。 八行者，一能身受非事，不自申诉； 二能让德与人； 三能不欲人之所＃30欲； 四能容物事＃31不申理； 五能远离无道之人，藏身在静处； 六能一心奉国，心念三宝，日月烧香，长斋不绝，供养出家人，不违仁信； 七能不负经戒，一生在俗，恒不破斋，勤能洒扫静室，修灯灶火，救拔一切贫穷，下贱产妇，老病孤弱，不具足众生，所见之者，皆发慈心； 八能一生念道，不谤毁出家人，心无是非，口恒念诵，见一切蠢动，皆发慈念之心，一切平等，无有彼我，善恶好丑，与我身无异。 是名八行。 四等者，一者惟慈，二者惟爱，三者惟善，四者惟忍。 是名四等。 六尘者，一耳听宫商，二眼见青黄白黑赤，三鼻知香臭，四身知刚柔燥湿，五舌知辛酸酗苦甘，六心知善恶喜怒哀乐，外来曰尘，内动曰情。",
      "translated_text": "Blind and deaf beings alike all raised their heads to listen. Those who heard this sutra universally received joy, rejoicing with delight, bowing their heads in reverence, wishing to hear more.\n\nThe Heavenly Worthy addressed all sentient beings: \"Good men and good women, I have often surveyed the heavens and wandered through the hells, where I have seen suffering beings bearing great yokes upon their necks, wooden shackles upon their arms, heavy fetters upon their feet, iron spikes upon their bodies, fire in their mouths, blades and needles piercing their backs, sword trees impaling their hearts, evil birds pecking out their eyes, iron plows tearing their tongues, molten copper poured into their mouths, every joint ablaze, iron pellets burning their throats until they rot, cauldrons of boiling water seething and simmering, copper pillars pressing against their bodies. Some ascend mountains of knives, their flesh and bones ground to pulp. Some enter furnaces of charcoal, their fat dripping and igniting, then are cast into freezing ice, piercing their hearts and bones. Some are made to lie upon iron beds, their bodies festered and rotting, transforming into ghostly forms, their shapes distorted beyond recognition. Some lie within fields of snow, their hearts and entrails torn apart, blades cutting into their flesh until blood and muscle turn to mud, their bones ground to dust, their sinews gathered into heaps, only to be reborn as hungry ghosts. Ox-headed demons raise their clubs, hell wardens wield their forks, driving and tormenting the sinners without respite. For countless kalpas they revolve in this cycle—when shall they ever return?\n\nAll you sentient beings, strive to restrain yourselves and mortify your bodies, diligently cultivate merit and virtue. All you disciples and assemblies, rouse your original resolve—only then may you attain liberation.\"\n\nBefore the words were finished, the Perfected One of the Left Mystery again addressed the Heavenly Worthy: \"I pray, what karmic offenses did these beings commit in their past lives? What cruel acts did they perform? Which precepts did they violate? The ignorant among us do not understand. We beseech the Heavenly Worthy to take pity on those suffering punishment, to reveal their transgressions so that they may be cautious and refrain from further wrongdoing. We do not know what meritorious deeds to cultivate to eradicate these karmic roots.\"\n\nThen all the assemblies aroused the Dao-mind, bowing their heads to the Heavenly Worthy, wishing to hear the explicit teaching.\n\nThe Heavenly Worthy declared: \"All you assemblies, if your hearts delight in hearing this sutra of the Two Wretched Paths, Five Sufferings, and Eight Difficulties, listen carefully and take it to heart. This sutra is subtle and wondrous, beyond conception. Among all sutras, it is foremost. Among the highest teachings, it is foremost. In repentance and deliverance of the deceased, in rescuing from suffering, it is foremost. This sutra is noble, the king of all sutras.\n\nThe Three Wretched Paths are: first, the hell realm; second, the animal realm; third, the hungry ghost realm. These are called the Three Wretched Paths.\n\nThe Five Sufferings are: first, embracing the copper pillar; second, treading the mountain of knives; third, climbing the tree of swords; fourth, entering the cauldron of boiling water; fifth, swallowing fire and eating coals. These are called the Five Sufferings.\n\nThe Eight Difficulties are: first, being born and escaping the Three Evil Realms; second, having escaped and become human, leaving the female form to become male; third, having attained a male body, possessing all six senses and four limbs; fourth, possessing all six senses and being born in the Central Kingdom; fifth, being born in the Central Kingdom and encountering a sagely ruler and parents; sixth, encountering a sagely ruler and cultivating the Dao with joy throughout one’s life, with a kind and benevolent heart; seventh, having cultivated a benevolent heart and believing in the Dao of immortality; eighth, believing in the Dao and virtue yet not being born in an era of great peace under a sagely emperor, and for ten thousand kalpas not encountering the Three Treasures. These are called the Eight Difficulties.\n\nThe Three Calamities are: first, the calamity of conscription and great warfare; second, the calamity of chronic illness throughout the year; third, the calamity of encountering great floods while traveling or at rest. These are called the Three Calamities.\n\nThe Five Sufferings are: first, the suffering of drowning in water; second, the suffering of burning in fire; third, the suffering of being killed or wounded by bandits; fourth, the suffering of being possessed by demonic spirits; fifth, the suffering of all poisons, stings, bites, and deep pain. These are called the Five Sufferings.\n\nThe Five Turbidities are: first, the turbidity of perverse views; second, the turbidity of the kalpa’s decline, when days and months grow short; third, the turbidity of sentient beings, their spirits dimmed; fourth, the turbidity of afflictions, with anger and strife; fifth, the turbidity of the lifespan, with premature death, wives and children parted midway, orphaned boys and girls grieving in sorrow. These are called the Five Turbidities.\n\nThe Eight Practices are: first, enduring wrongs without complaint; second, yielding virtue to others; third, not desiring what others desire; fourth, tolerating matters without seeking redress; fifth, distancing oneself from the unprincipled and concealing oneself in quietude; sixth, wholeheartedly serving the state, mindful of the Three Treasures, burning incense to the sun and moon, maintaining perpetual fasting, making offerings to those who have left the household life, never violating benevolence and trust; seventh, never betraying the scriptures and precepts, living in the world without breaking fasts, diligently sweeping clean rooms, tending lamps and stoves, rescuing the poor, the lowly, women in childbirth, the old, the sick, the orphaned, the weak, and all deficient beings—upon seeing them, arousing a heart of compassion; eighth, dedicating one’s life to the Dao, never slandering those who have left the household life, harboring no judgments, constantly reciting scriptures, seeing all living beings and arousing a heart of compassion, treating all equally, without self or other, good and evil, beauty and ugliness all the same as one’s own body. These are called the Eight Practices.\n\nThe Four Immeasurables are: first, immeasurable kindness; second, immeasurable love; third, immeasurable goodness; fourth, immeasurable patience. These are called the Four Immeasurables.\n\nThe Six Dusts are: first, the ear hearing gong and shang tones; second, the eye seeing blue, yellow, white, black, and red; third, the nose knowing fragrance and stench; fourth, the body knowing hardness and softness, dryness and dampness; fifth, the tongue knowing pungent, sour, bitter, harsh, and sweet; sixth, the mind knowing good and evil, joy and anger, sorrow and happiness. That which comes from without is called dust; that which stirs within is called emotion.\"",
      "overlap_context": "t, constantly subjected to slaughter, repaying past transgressions. Even if spoken of for countless kalpas, their sufferings cannot be exhausted.\n\nNow, I tell you, all disciples: cultivate yourselves with utmost care.\"\n\n#5 The Perfected One of the Left Mystery prostrated himself and addressed the Heavenly Worthy: \"I beseech you, for the sake of all sentient beings in the kalpas of karmic roots and sins, to expound this sutra of the Three Wretched Realms, Five Sufferings, and Eight Difficulties.\"",
      "start_char": 1239,
      "end_char": 2465,
      "start_sentence": 45,
      "end_sentence": 97,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.79380178451538,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝往生救苦妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "是名六情六尘。 六通者，耳眼鼻身舌心，是名六通，六根＃32共同。 三毒者，贪淫一，嗔恚二，愚痴三。 是名三毒。 天尊重＃33告左玄真人曰：向为一切众生说此三涂五苦经者，一切远近，皆蒙慧解，并入法门。 左玄真人又白天尊曰＃34：一切罪根众生，今蒙天尊说罪福报对，向於座下及诸弟子，饥寒乏劣饿鬼畜生，闻说此经，皆悉晓然。 各自熏修，不敢更造。 为过去亡者，若在地狱之中，受三涂五苦八难之愆，欲救亡人，其法若个最得为先，济亡人之苦。 天尊告真人曰：汝等欲救亡人，当舍寿之时，诸方觅师，为亡人宣戒忏悔，即为转读路上圹所，请师为亡人烧香，赞叹忏悔＃35，舍＃36资亡人，及以男女缘身之资，回将布施，得福最深。 至七七日、百日割减，造经及像，斋戒然四十九灯，造四十九尺缯旛，悬在长竿。 若不可得办，即造＃37小旛七尺，造灵宝及五苦之经，读诵昼夜七徧。 亡人七七之内，定其罪名。 百日之中，配入五道。 向说此经，救亡人之苦，此法最为第一。 左玄真人又白天尊言＃38：向者三涂五苦八难之中，一切众生既闻经已，一切亡人随愿往生快乐之处，可得闻否。 天尊告左玄真人曰：一切存亡，闻我说此经者，当修福德，随愿往生，听吾五念，为存为亡诵经七徧者，一切众生及过去亡人，随愿往生童子，出家供养三宝。 法解曰：今闻天尊欲说五念之文，一切众生欢喜踊跃，一心乐闻。 天尊告左玄真人曰：欲诵吾五念者，长斋护净，着净洁之衣，一心请师，依法受行。 若不如此，必堕落地狱，无有还期。 努力精进，护净受持，一心奉事，不敢失仪。 天尊告左玄真及诸人鬼，一心静听五念之经。 一念三宝常慈愍，愿得拔度出火坑。 万罪千灾尽消散，跛痾积逮皆能行。 邪魔恶鬼在狱禁，百姓男女道心生。 五逆冤家并欢乐，镬汤变作莲花池。 法界众生口念善，过去亡人随往生。 二念见前诸众等，努力长斋作桥梁。 忆此地狱三涂苦，勤行布施尽烧香。 受戒读经珍重礼，一切过去上天堂。 天尊弹指告诸众，黑暗地狱早生光。 法界众生＃39勤修道，一旦往生在中央。 三念亡人甚可怜，一入圹中难见天。 道场建立不肯施，四时八节得泥钱。 地狱之中受苦恼，口中唱枉告皇天。 平生不肯修功德，过去枷杻铁杖鞭。 一日之中万生死，纵作六畜经数年。 饥寒脊破不能语，年过一二穿鼻牵。 慈孝男女为作福，五逆男女断因缘。 饱食酒肉觅生业，未为亡人舍一钱。 一旦生时多作福，亡去往生三宝前。 四念众生无善心，谤毁三宝自沈沦。 虽入道场不正意，称扬说道出家人。 铜柱铁床遣抱卧，剑树刀山来逼身。 苦痛寻师觅不得，牛头狱卒＃强来亲。 铁叉叉着镬汤裹，碓捣硙磨作微尘。 种种苦恼常经历，直为毁谤出家人。 出家未必入地狱，一切众生慢道心。 告语苍生＃40诸众等，努力坚持好道心。 一切众生回正念，随愿往生在香林＃41。 五念同学早出家，愚痴重障生慧芽。 地狱翻作天堂乐，铁床铜柱出莲花。 一切众生受快乐，三五相伴升云霞＃42。 六时恒闻锺磬响，唯愿子孙常出家。 身披法服化诸众，口诵灵宝断魔邪。 七祖父母天堂上，过去往生侍香华。 天尊告左玄真人曰：向者说此五念，为诸众生显说此经，犹恐未解。",
      "translated_text": "These are called the Six Emotions and Six Dusts.\n\nThe Six Penetrations are: ear, eye, nose, body, tongue, and mind—these are called the Six Penetrations, the Six Roots sharing commonality.\n\nThe Three Poisons are: first, greed and lust; second, anger and hatred; third, ignorance and delusion. These are called the Three Poisons.\n\nThe Heavenly Worthy addressed Left Mystery Perfected One, saying: \"When I previously expounded this Scripture of the Three Paths and Five Sufferings for all sentient beings, all—whether near or far—attained wisdom and understanding, entering the Dharma Gate together.\"\n\nLeft Mystery Perfected One again addressed the Heavenly Worthy, saying: \"All sentient beings whose roots are in sin, having now heard the Heavenly Worthy expound the retribution of sin and blessing, including those beneath your seat and all disciples—hungry ghosts, animals, and beings suffering from cold, hunger, and hardship—upon hearing this scripture, all clearly understood. Each has cultivated and refined themselves, no longer daring to commit further transgressions. For those who have passed away, if they are in hell enduring the transgressions of the Three Paths, Five Sufferings, and Eight Difficulties, what method is foremost to save the departed and relieve their suffering?\"\n\nThe Heavenly Worthy addressed the Perfected One, saying: \"If you wish to save the departed, at the time of their passing, seek masters from all directions to proclaim the precepts and repentance for the deceased. Have them recite and transfer the scripture at the roadside tomb, inviting masters to burn incense for the departed, praise and repent, and dedicate resources to the deceased, including the possessions of their sons and daughters, redirecting them for almsgiving. This accrues the deepest merit. On the forty-ninth day, the hundredth day, and other commemorative days, reduce offerings, commission scriptures and images, observe fasts, and light forty-nine lamps. Make banners of forty-nine feet of silk and hang them on tall poles. If this cannot be accomplished, then make small banners of seven feet, commission the *Scripture of Lingbao* and the *Scripture of the Five Sufferings*, and recite them day and night seven times. Within the forty-nine days, the sins of the departed will be determined. Within a hundred days, they will be assigned to one of the Five Paths. The method just expounded for saving the departed from suffering is foremost.\"\n\nLeft Mystery Perfected One again addressed the Heavenly Worthy, saying: \"Among those in the Three Paths, Five Sufferings, and Eight Difficulties, all sentient beings who have heard this scripture—can the departed, following their vows, be reborn in places of bliss? May they hear of this?\"\n\nThe Heavenly Worthy addressed Left Mystery Perfected One, saying: \"All the living and the dead who hear me expound this scripture should cultivate merit and virtue, following their vows to be reborn. Listen to my Five Remembrances. For the living and the dead, those who recite this scripture seven times will enable all sentient beings and the departed to be reborn according to their vows as novices, leaving the household life to serve the Three Treasures.\"\n\nThe Dharma Explanation states: \"Now, hearing that the Heavenly Worthy is about to expound the text of the Five Remembrances, all sentient beings rejoice and leap with joy, wholeheartedly desiring to hear.\"\n\nThe Heavenly Worthy addressed Left Mystery Perfected One, saying: \"Those who wish to recite my Five Remembrances must observe long fasts, maintain purity, wear clean garments, single-mindedly invite a master, and receive and practice according to the Dharma. If this is not done, they will surely fall into hell with no return. Strive diligently, maintain purity, uphold and receive with wholehearted devotion, never daring to lose proper decorum.\"\n\nThe Heavenly Worthy addressed Left Mystery Perfected One and all human and ghost beings, saying: \"Listen with a tranquil mind to the Scripture of the Five Remembrances.\n\n**First Remembrance:**\nConstantly cherish the Three Treasures with compassion,\nWishing to deliver and lift from the fiery pit.\nMyriad sins and a thousand calamities all disperse,\nThe lame and sick, long-bound, all can walk.\nDemons and evil ghosts are imprisoned in hell,\nMen and women of the world generate the mind for the Dao.\nThe five rebellious enemies all rejoice together,\nCauldrons of boiling water transform into lotus ponds.\nAll sentient beings in the Dharma realm chant goodness,\nThe departed follow and are reborn.\n**Second Remembrance:**\nSeeing all the multitudes before me,\nStrive to observe long fasts and build bridges.\nRecall the suffering of hell and the Three Paths,\nDiligently practice almsgiving and burn incense.\nReceive the precepts, recite scriptures, and honor with reverence,\nAll the departed ascend to heaven.\nThe Heavenly Worthy snaps his fingers, addressing all,\nThe dark hells swiftly generate light.\nAll sentient beings in the Dharma realm diligently cultivate the Dao,\nOne day they will be reborn in the center.\n**Third Remembrance:**\nThe departed are most pitiable,\nOnce in the tomb, they rarely see the sky.\nThey refused to establish the Dao field,\nReceiving mud money at the four seasons and eight festivals.\nIn hell, they endure suffering and affliction,\nTheir mouths cry out in vain to the August Heaven.\nIn life, they refused to cultivate merit and virtue,\nNow shackled in iron, beaten with rods and whips.\nIn a single day, they die ten thousand deaths,\nEven as the six kinds of livestock for years.\nHungry and cold, their backs broken, unable to speak,\nAfter a year or two, they are pierced through the nose and led.\nFilial sons and daughters perform meritorious deeds,\nThe five rebellious sons and daughters sever karmic ties.\nSated with wine and meat, they seek livelihoods,\nYet not a single coin is offered for the departed.\nIf in life they had performed abundant merit,\nThe departed would be reborn before the Three Treasures.\n**Fourth Remembrance:**\nSentient beings lack a good mind,\nSlandering the Three Treasures, they sink into perdition.\nThough entering the Dao field, their intentions are impure,\nPraising and speaking of the left-home ones.\nThey are made to embrace copper pillars and iron beds,\nSword trees and knife mountains press upon their bodies.\nIn agony, they seek a master but find none,\nOx-headed hell guards forcibly approach.\nIron forks thrust them into cauldrons of boiling water,\nPestles pound, mills grind them into fine dust.\nThey constantly endure all manner of suffering,\nAll because they slandered the left-home ones.\nThose who leave home do not necessarily enter hell,\nAll sentient beings scorn the mind for the Dao.\nI tell all sentient beings:\nStrive to firmly uphold a good mind for the Dao.\nAll sentient beings, turn your thoughts to right mindfulness,\nFollow your vows to be reborn in the Fragrant Grove.\n**Fifth Remembrance:**\nFellow students of the Five Remembrances, leave home early,\nThe heavy hindrances of ignorance sprout the seed of wisdom.\nHell transforms into the bliss of heaven,\nIron beds and copper pillars produce lotus flowers.\nAll sentient beings receive happiness,\nAccompanied by three or five, they ascend on clouds.\nAt all six periods, they constantly hear the sound of bells and chimes,\nWishing their descendants would always leave home.\nClad in Dharma robes, they convert the multitudes,\nTheir mouths recite the *Lingbao*, severing demonic evil.\nThe seven generations of ancestors ascend to heaven,\nThe departed are reborn to serve amidst fragrant flowers.\"\n\nThe Heavenly Worthy addressed Left Mystery Perfected One, saying: \"Previously, I expounded these Five Remembrances for all sentient beings, clearly explaining this scripture, yet I fear they may not yet understand.\"",
      "overlap_context": "ed the Four Immeasurables.\n\nThe Six Dusts are: first, the ear hearing gong and shang tones; second, the eye seeing blue, yellow, white, black, and red; third, the nose knowing fragrance and stench; fourth, the body knowing hardness and softness, dryness and dampness; fifth, the tongue knowing pungent, sour, bitter, harsh, and sweet; sixth, the mind knowing good and evil, joy and anger, sorrow and happiness. That which comes from without is called dust; that which stirs within is called emotion.\"",
      "start_char": 2465,
      "end_char": 3823,
      "start_sentence": 98,
      "end_sentence": 153,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.9574773311615,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝往生救苦妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "卿等十方诸真人等，方便重说，珍重殷勤。 若有众生，心中悟解，一心正念，护净受持，善行读诵此经者，及为存亡远行，疾病一切，举心回向，彼此灭罪万劫。 梦想之中，常见三宝，逢善知识，在处受生，恒值快乐。 若能长斋受戒，昼夜六时烧香礼拜，心无暂忘。 在生过去，身怀经戒，童子出家，供养三宝。 若能建立静堂，抄写受持，装演韬轴＃43，宣布未闻者，皆令闻见。 如此福德，最为无量。 左玄真人稽首作礼，上白天尊曰：一切众生，痴盲耽着，贪怒嗔恚，心未回向。 或心回向，乃将骏马百疋，宝车千乘，及诸外具，而将布施，心乃粗疏号叫＃44，不审得福如何。 天尊慈悲，重为说之。 时诸众等，叩头正念，一心奉行。 天尊告左玄真人曰：一切众生，心中不信不贵三宝经像斋戒，但看在俗众生，即有贫穷下贱，聋盲六疾，失於相好，不及人次。 若有众生，身欲布施，心中不生信敬，不贵三宝，如此等辈，必获此报。 譬如镜中照人，清白随其本身，更无杂见，黑即见黑，白即见白，随其本根。 罪亦如是＃45。 汝若不信，有地狱见在。 地狱在人身中，无劳远觅。 十方诸众，稽首作礼，一心归向，愿得见闻。 天尊告诸众等：我过去后，若有一切众生，得吾此经，受行读诵，坚持护净，及为诸人方便显说。 若有众生，心中不信，故污不净，当来受罪，还为六畜。 若有众生，能舍资财，及诸宝物外具之辈，以将布施，来入经像，及以斋食赎生，当来获福，定得生天，恒居贵门，劫劫代代，与善因缘，灭罪万劫，拔度升仙。 天尊告曰：汝等众生＃46，谛听吾说五种舍施之功，念念之中，不离其心。 第一者，若有众生，能自发心舍施劝助诸＃47人，施与法师，营造经像。 一钱以上，皆与四十万＃48倍报。 一万以上，报不可胜。 万劫之中，常见快乐。 教化一切，恒为人师。 第二者，若有众生，布施劝助持写经书，及静堂旛花灯烛，一钱以上，皆与四十万＃49倍报。 一万以上，报不可胜。 过去生中国，聪明智慧，清净具足，常见三宝，永无烦恼，快乐无为。 第三者，若有众生，忽发大慈之心，劝助一切人，布施贫穷下贱，孤弱老病，饿妪嫠妇＃50，饥寒远行，寄客众生等。 一钱以上，皆与二十五万＃51倍报。 一万以上，报不可胜。 愿在处托生＃52，恒得富贵，衣食自然。 第四者，若有众生，为过去及见存父母，忽发洪愿，劝助一切众生，布施众中法师童子＃53、清信男子女人＃54。 一钱以上，皆＃55二十万倍报。 一万以上，报不可胜。 方便劝助，令得回心。 一生受报，愿得出家，久视长生，恒演经教，劝生善心。 第五者，若有一切众生，能生善心，怜念一切，劝助布施，教化屠儿休杀，回心赎生，口恒念道，奉戒而行。 及狱囚产难＃56饥寒，一切蠢动，五逆不孝，反生慈心，钳口＃57合舌，回称三宝，永断酒肉，怜念聋盲，百姓男女，皆似我生。 布施一钱以上，一十八万倍报。 一万以上，报不可胜。 过去受生，恒在三宝前＃58。 天尊重告诸弟子等：我说劝助布施，其中有人，施一之功，觅万之报。 布施虽多，将罪对福，福乃至有余，然可报之万倍。",
      "translated_text": "\"All you Perfected Ones of the ten directions, expound these teachings again with skillful means, with utmost care and diligence. If there are sentient beings who awaken understanding in their hearts, maintain single-minded right mindfulness, protect purity, and uphold this scripture—those who virtuously recite it, or dedicate it to the living or deceased, travelers, the ill, or all beings—by directing their thoughts toward it, they will eradicate the sins of ten thousand kalpas for both themselves and others. In their dreams, they will constantly behold the Three Treasures, encounter good spiritual friends, and wherever they are reborn, they will always enjoy happiness. If they maintain long-term purity, observe the precepts, burn incense, and pay homage day and night during the six periods without ever forgetting, then in this life and the next, they will carry the scripture and precepts within, leave home as novices, and make offerings to the Three Treasures. If they establish meditation halls, copy and uphold the scripture, adorn and display its scrolls, and propagate it to those who have not yet heard, all who see and hear it will accumulate boundless merit.\n\nLeft Mystery Perfected One bowed in reverence and addressed the Heavenly Worthy, saying: 'All sentient beings are blindly attached, consumed by greed, anger, and hatred, their hearts not yet turned toward the Dao. Even if they do turn their hearts, they may offer a hundred fine horses, a thousand jeweled chariots, and all manner of external goods as alms, yet their minds remain coarse and clamorous, unaware of the merit they gain.'\n\nThe Heavenly Worthy, moved by compassion, expounded further. All present bowed their heads in right mindfulness and wholeheartedly vowed to practice.\n\nThe Heavenly Worthy addressed Left Mystery Perfected One, saying: 'All sentient beings who do not believe in or honor the Three Treasures, scriptures, images, purity, or precepts—observe the laity: among them are the poor, the lowly, the deaf, the blind, those afflicted with the six illnesses, those lacking in good appearance, and those who fall short of human status. If there are beings who wish to practice almsgiving but do not generate faith or reverence, nor honor the Three Treasures, such individuals will surely receive this retribution. It is like a mirror reflecting a person: clarity and purity follow one’s original nature, with no杂见. If one is black, black is seen; if white, white is seen—all follows the root. Sin is likewise. If you do not believe, hell is present before you. Hell resides within the human body; there is no need to seek it afar.'\n\nAll in the ten directions bowed in reverence, wholeheartedly turning toward the Dao, wishing to see and hear.\n\nThe Heavenly Worthy addressed all present: 'After my passing, if there are sentient beings who obtain this scripture, uphold, recite, and protect its purity, or skillfully expound it for others—if there are those who, lacking faith, defile it with impurity—they will incur sins in the future and be reborn as beasts. But if there are beings who relinquish their wealth, treasures, and external goods to make offerings, dedicating them to scriptures and images, or to purity feasts and life ransoming, they will gain merit in the future, assuredly ascend to heaven, forever dwelling in noble households, kalpa after kalpa, generation after generation, bound to good causes. They will eradicate the sins of ten thousand kalpas and be delivered to ascend as immortals.'\n\nThe Heavenly Worthy continued: 'All you sentient beings, listen carefully as I explain the five kinds of almsgiving and their merits, which should never depart from your thoughts. First, if there are beings who, of their own volition, practice almsgiving and encourage others to offer support to Dharma masters for the creation of scriptures and images—even a single coin—will receive a reward forty thousand times over. Ten thousand coins or more yield an immeasurable reward. For ten thousand kalpas, they will constantly enjoy happiness, teaching and transforming all, forever serving as masters to others.\n\nSecond, if there are beings who practice almsgiving and encourage others to support the copying of scriptures, as well as the adornment of meditation halls with banners, flowers, lamps, and candles—even a single coin—will receive a reward forty thousand times over. Ten thousand coins or more yield an immeasurable reward. They will be reborn in the central lands, endowed with wisdom and clarity, constantly beholding the Three Treasures, forever free from afflictions, abiding in effortless bliss.\n\nThird, if there are beings who suddenly generate great compassion and encourage others to practice almsgiving for the poor, the lowly, the orphaned, the weak, the elderly, the sick, the hungry, widows, the cold, travelers, and sojourners—even a single coin—will receive a reward twenty-five thousand times over. Ten thousand coins or more yield an immeasurable reward. Wherever they are reborn, they will always enjoy wealth and nobility, with clothing and food naturally provided.\n\nFourth, if there are beings who, for the sake of past and present parents, suddenly generate vast vows and encourage all to practice almsgiving among Dharma masters, novices, and faithful men and women—even a single coin—will receive a reward twenty thousand times over. Ten thousand coins or more yield an immeasurable reward. Through skillful encouragement, they will turn others’ hearts toward the Dao. In this life, they will receive their reward, leave home, attain longevity, constantly expound the scriptures, and inspire good thoughts in others.\n\nFifth, if there are beings who generate good thoughts, take pity on all, and encourage almsgiving to teach butchers to cease killing, to turn their hearts toward ransoming lives, to constantly recite the Dao, observe the precepts, and practice accordingly—extending to prisoners, women in childbirth, the hungry, the cold, all creatures, the five grave offenders, and the unfilial—if they reverse their minds to generate compassion, restrain their speech, turn",
      "overlap_context": "and chimes,\nWishing their descendants would always leave home.\nClad in Dharma robes, they convert the multitudes,\nTheir mouths recite the *Lingbao*, severing demonic evil.\nThe seven generations of ancestors ascend to heaven,\nThe departed are reborn to serve amidst fragrant flowers.\"\n\nThe Heavenly Worthy addressed Left Mystery Perfected One, saying: \"Previously, I expounded these Five Remembrances for all sentient beings, clearly explaining this scripture, yet I fear they may not yet understand.\"",
      "start_char": 3823,
      "end_char": 5053,
      "start_sentence": 154,
      "end_sentence": 199,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.374374389648438,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝往生救苦妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "其福虽多，补罪不足，福无一片＃59，计功补过，罪福始知。 告诸男女，勿更造罪，福乃长为，以此因缘，名为万倍。 一切众等，慎之慎之。 时诸众等，称善稽首，各礼天尊，珍重而退＃60。 天尊慈悲，重说颂曰： 一切诸法本，清净常湛然。 报对从心起，苦乐非外缘。 地狱与天堂，分明在眼前。 未来甚冥昧，审谛熟精研。 念尔一生中，颠倒相引牵。 心不能明了，结缚自萦缠。 冥冥何见晓，悠悠如逝川。 鲦欻红颜灭，挥霍入黄泉。 善恶无二法，是非同一源。 见者生分别，良由心识昏。 称意天仙户，违心地狱门。 深思自了悟，乃成无上尊。 哀哉迷惑子，正道不知存。 朽索驭六马，常恐有惊奔。 攀缘念念起，为过在心猿。 遗形忘善恶，塞兑闭诸根。 生死是对报，谅自因尔身。 若然辩存殁，寂灭即归真。 出生乃差别，入死甚平均。 地水火风散，随处自相亲。 天地为大治，无意在人人。 计校受生理，非果亦非因。 摄心修内行，悟道不盈旬。 驰心向外境，幽昧无涯津。 凡诸功德藏，以赞叹为首。 方便接迷津，慈悲能善诱。 积善为福田，积恶成殃咎。 假名本自无，权变何常有。 颠倒不觉悟，昏迷来日久。 怖畏於地狱，煎悬生受苦。 吾开定水源，洗除习尘垢。 身心既清净，永劫无灰朽。 昔闻持戒者，忍辱生端正。 今得见天尊，非言所歌咏。 八十一好明，七十二相净。 玉润金刚身，永劫无衰盛。 丹唇如欲开，皓齿因斯映。 音声自柔软，慈悲出本性。 慧源犹橐钥，定心如水镜。 此由持戒来，证果为大圣。 太上洞玄灵宝往生救苦妙经竟 ＃1 案P.2384抄本卷首残缺，卷尾完好。 题：「天尊为一切众生说三涂五苦存亡往生救苦拔出地狱妙经」。 与《道藏》本标题颇为不同。 ＃2 烂坏：敦煌本作「洪烂」。 ＃3 奉行：敦煌本作「觉察」。 ＃4 左玄真人：四字据敦煌本补。 ＃5 敦煌本此句作「或将来布施，施与法师」。 ＃6 若有真心，能发善意：敦煌本作「所有出心有意」。 ＃7 心不：敦煌本作「万一」。 ＃8 有乐：敦煌本作「有忘」。 ＃9 左玄真人稽首作礼：敦煌本作「右玄真人叉手作礼」。 ＃10 齐皆：敦煌本作「斋心」。 ＃11 一切众生：四字据敦煌本补。 ＃12 项负：敦煌本作「咽着」。 ＃13 入喉：原作「入口」，据敦煌本改。 ＃14 渍烂：敦煌本作「肉烂」。 ＃15 分擘：敦煌本作「分百」。 ＃16 锋刃锉身，血肉如泥：敦煌本作「到对斩身，细将入磴，血肉分别」。 ＃17＃18 狱卒：敦煌本作「狱师」。 ＃19 左玄真人又白天尊曰：敦煌本作「右玄真人从众中出，稽首作礼，五体投地，上白天尊言」。 凡二十一字。 ＃20 所犯：敦煌本作「勿犯」。 ＃21 天尊告日：敦煌本作「天尊告右玄真人。 」 ＃22 者，宜各：敦煌本作「汝等弟子」。 ＃23 更值：敦煌本作「便值」。 ＃24 乐道：敦煌本作「学道」。 ＃25 「不生」二字据敦煌本补。 ＃26＃27 五苦：敦煌本作「五毒」。 ＃28 燔灼：敦煌本作「焚燃」。 ＃29 邪物：敦煌本作「耶见」。 ＃30 「所」字据敦煌本补。 ＃31 物事：敦煌本作「无事」。 ＃32 六根：敦煌本作「并六根」。",
      "translated_text": "Though their blessings may be abundant, they are insufficient to offset their transgressions; not a single fragment of merit remains. Only when one calculates merits to counterbalance faults does one begin to comprehend the nature of sin and blessing.\n\nI exhort all men and women: cease from further transgressions, and blessings shall endure. Through this causal connection, it is called \"ten-thousandfold reward.\" All assembled here, be vigilant—most vigilant!\n\nAt that time, all in the assembly praised the teaching, bowed their heads in reverence, paid homage to the Heavenly Worthy, and respectfully withdrew.\n\nThe Heavenly Worthy, moved by compassion, further expounded in verse:\n\nAll dharmas in their essence\nAre pure and ever serene.\nRetribution arises from the mind—\nSuffering and joy are not external causes.\nHell and heaven,\nClearly lie before your eyes.\nThe future is profoundly obscure;\nExamine and contemplate it deeply.\nReflect on your present life,\nWhere delusion leads you astray.\nThe mind cannot attain clarity,\nBound and entangled by its own knots.\nIn darkness, what can be seen or known?\nTime flows on like a passing stream.\nIn an instant, youthful radiance fades,\nAnd one swiftly descends to the Yellow Springs.\nGood and evil are not two dharmas;\nRight and wrong share a single source.\nThose who perceive them generate distinctions,\nFor their minds are clouded by ignorance.\nFollowing one’s desires, one enters the gates of celestial immortals;\nDefying them, one passes through the doors of hell.\nThrough profound reflection and self-realization,\nOne becomes the Supreme Worthy.\nAlas for the deluded,\nWho know not the true Dao!\nLike rotting reins controlling six horses,\nOne lives in constant fear of a sudden bolt.\nClinging thoughts arise moment by moment,\nAnd faults lie in the restless mind.\nAbandon form, forget good and evil,\nSeal the senses and close the gates.\nBirth and death are retributive responses,\nSurely arising from this very body.\nIf one discerns existence and cessation,\nIn quiescence, one returns to the Real.\nEmerging into life brings differentiation;\nEntering death is utterly equal.\nEarth, water, fire, and wind disperse,\nYet each finds affinity in its place.\nHeaven and earth govern the great order,\nWith no intent toward any individual.\nCalculating the principles of rebirth,\nIt is neither fruit nor cause.\nCollect the mind and cultivate inner conduct—\nEnlightenment comes in less than ten days.\nIf the mind races toward external realms,\nOne remains in darkness without bound.\nAmong all treasuries of merit,\nPraise stands foremost.\nWith expedient means, one guides those lost at the ford;\nThrough compassion, one skillfully leads them.\nAccumulating good becomes a field of blessings;\nAccumulating evil breeds calamity and misfortune.\nProvisional names are inherently empty;\nWhat constancy lies in skillful adaptation?\nDeluded and unaware,\nOne remains lost for days unending.\nTerrified of hell,\nOne suffers torment in boiling cauldrons and hanging agonies.\nI open the source of still waters,\nTo wash away the dust of habitual defilements.\nOnce body and mind are purified,\nFor endless kalpas, they shall not decay.\nOf old, I heard that those who uphold the precepts\nCultivate forbearance and attain uprightness.\nNow, beholding the Heavenly Worthy,\nWords cannot express His praise.\nEighty-one marks of excellence shine forth,\nSeventy-two signs of purity adorn Him.\nHis body is lustrous as jade, firm as vajra,\nForever free from decline or decay.\nHis cinnabar lips seem about to part,\nHis radiant teeth gleam in response.\nHis voice is naturally gentle,\nCompassion flows from His inherent nature.\nHis wisdom is like a bellows and key,\nHis meditative mind like a mirror of water.\nThis arises from upholding the precepts,\nAttaining fruition as a Great Sage.\n\nThus concludes *The Supreme Cavernous Numinous Treasure Sutra of Rebirth and Salvation from Suffering*.",
      "overlap_context": ", and inspire good thoughts in others.\n\nFifth, if there are beings who generate good thoughts, take pity on all, and encourage almsgiving to teach butchers to cease killing, to turn their hearts toward ransoming lives, to constantly recite the Dao, observe the precepts, and practice accordingly—extending to prisoners, women in childbirth, the hungry, the cold, all creatures, the five grave offenders, and the unfilial—if they reverse their minds to generate compassion, restrain their speech, turn",
      "start_char": 5053,
      "end_char": 6367,
      "start_sentence": 200,
      "end_sentence": 279,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.819596767425537,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝往生救苦妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "＃33 「重」字据敦煌本补。 ＃34 又白天尊曰：敦煌本作「曰法解稽首作礼，上白天尊言。 」凡十二字。 ＃35 赞叹忏悔：敦煌本作「叹忏」二字。 ＃36 「舍」字据敦煌本补。 ＃37 「造」字据敦煌本补。 ＃38 又白天尊言：敦煌本作「曰法解稽首作礼，上白天尊古闷。 」凡十二字。 ＃39 法界众生：敦煌本作『寄语后生』 。 ＃40 告语苍生：敦煌本作『寄语后生』 。 ＃41 敦煌本此句作『过去亡人出地狱」。 ＃42 升云霞：教煌本作『礼三宝』。 ＃43 韬轴：敦煌本作『蹈轴』 。 ＃44 号叫：敦煌本作『豪意』。 ＃45 罪亦如是：原作「罪一如此」。 据敦煌本改。 ＃46 告日：汝等众生：敦煌本作「告诸众等」。 ＃47 「诸」字据敦煌本补。 ＃48＃49 四十万：敦煌本作『卅万』 。 ＃50 饿妪厘妇：敦煌本作『饿苟产妇』 。 苟，当作姁。 ＃51 皆与二十五万：敦煌本作『皆廿万』。 ＃52 托生：敦煌本作『堕生』 。 ＃53 布施众中法师童子：敦煌本作『 布施法师、山中师童子】 。 ＃54 清信男子女人：敦煌本作『清信男女人等』。 ＃55 皆：原作「者」，据敦煌本改。 ＃56 产难：敦煌本作『产苟』。 苟通姁。 ＃57 钳口：敦煌本作「传口」，近是。 ＃58 三宝前：敦煌本作『三宝座前』 。 ＃59 一片：原作「一斤」，据敦煌本改。 ＃60 中敦煌本经文止於此，无以下大段颂诗。",
      "translated_text": "Now, the Heavenly Worthy once more addressed the assembly, saying:\n\n\"All beings within the Dharma Realm, heed my words! I now proclaim to all living beings: those who have perished in the past and emerged from hell shall ascend upon clouds and mist, their steps light upon the turning axis of the Dao. Though their cries of anguish resound, their sins are thus.\n\nI declare to you, all beings: for those who have committed the four hundred myriad transgressions—whether starving elders, laboring women, or those who have fallen into rebirth—if they make offerings among the assembly to Dharma masters and novices, to pure men and women of faith, all shall be spared the trials of childbirth, their mouths freed from restraint. Before the Three Treasures, if they present even a single piece of incense, their merits shall be boundless, their blessings measureless.\"\n\nHere ends the text of the Dunhuang manuscript; the following verses are absent.",
      "overlap_context": "n Him.\nHis body is lustrous as jade, firm as vajra,\nForever free from decline or decay.\nHis cinnabar lips seem about to part,\nHis radiant teeth gleam in response.\nHis voice is naturally gentle,\nCompassion flows from His inherent nature.\nHis wisdom is like a bellows and key,\nHis meditative mind like a mirror of water.\nThis arises from upholding the precepts,\nAttaining fruition as a Great Sage.\n\nThus concludes *The Supreme Cavernous Numinous Treasure Sutra of Rebirth and Salvation from Suffering*.",
      "start_char": 6368,
      "end_char": 7016,
      "start_sentence": 280,
      "end_sentence": 311,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 5.973263740539551,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝往生救苦妙经.txt",
        "category": "本文类"
      }
    }
  ]
}