{
  "source_id": "太上老君说常清静经注（元李道纯）",
  "source_file": "chunked_daozang\\太上老君说常清静经注（元李道纯）.json",
  "total_chunks": 3,
  "total_original_chars": 2685,
  "total_translated_chars": 15588,
  "total_translation_time": 68.38481116294861,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\玉诀类\\太上老君说常清静经注（元李道纯）.txt",
    "category": "玉诀类"
  },
  "full_translation": "**The Supreme Lord Lao’s Annotated Scripture on Constant Clarity and Stillness (Part I)**\n\n**Scripture Title:** *The Supreme Lord Lao’s Annotated Scripture on Constant Clarity and Stillness*\n**Commentator:** Li Daochun, a Daoist of the Yuan dynasty\n**Volume:** One\n**Source Text:** *Zhengtong Daoist Canon*, *Dongshen* Section, *Jade Instructions* Category\n**Collated Editions:** Annotations by Du Guangting and other masters\n\n---\n\n**The Supreme Lord Lao’s Annotated Scripture on Constant Clarity and Stillness (Part I)**\n*Annotated by Li Daochun of Qing’an, Lay Disciple of Duliang*\n\nThe Lord Lao said:\nThe Great Dao is formless, yet it gives birth to Heaven and Earth;\nThe Great Dao is without emotion, yet it moves the sun and moon;\nThe Great Dao is nameless, yet it nurtures the myriad things.\nI know not its name, so I forcefully call it the *Dao*.\nYet the moment one speaks of what can be called *Dao*, it is no longer the eternal Dao.\nIf it cannot be spoken, how then can it be named *Dao*?\nAh! This single word *Dao* has already expressed it.\n\nIt cannot be seen when looked upon,\ncannot be heard when listened to,\ncannot be grasped when seized,\ncannot be exhausted when used.\nVague and indistinct,\nit does not belong to the realm of sound and perception.\nRare and subtle,\nit has no fixed form.\nIf one treats it as sound and perception, comprehension will not suffice to grasp it;\nif one seeks a fixed form, inquiry will not suffice to respond to change.\n\nThough the Dao is formless,\nthrough the birth of Heaven and Earth, its form becomes visible;\nthough the Dao is without emotion,\nthrough the movement of the sun and moon, its nature can be discerned;\nthough the Dao is nameless,\nthrough the nurturing of the myriad things, its name can be established.\n\nThe *Appended Judgments* of the *Book of Changes* states:\n*\"In Heaven, it forms images; on Earth, it takes shape—thus transformation is manifest.\"*\nIs this not the form of the Dao?\nIt further says:\n*\"It drums them with thunder and lightning, moistens them with wind and rain. The sun and moon revolve, alternating cold and heat.\"*\nIs this not the nature of the Dao?\nIt also says:\n*\"The Dao of Qian becomes male; the Dao of Kun becomes female.\"*\nIs this not the name of the Dao?\n\nThe Dao is originally nameless, yet the sages forcibly named it *Dao* to encompass the myriad changes of the world, to unify its diverse paths—this is what is meant by the broad, level, and straight great Way.\nThe Dao possesses clarity and turbidity, movement and stillness.\nHeaven is clear, Earth is turbid;\nHeaven moves, Earth is still.\nMale is clear, female is turbid;\nmale moves, female is still.\nDescending from root to branch, it gives birth to the myriad things.\nClarity is the source of turbidity; movement is the foundation of stillness.\nIf one can constantly abide in clarity and stillness, Heaven and Earth will all return to it.\n\nBefore the Primordial Chaos divided, the principle of movement and stillness already existed;\nonce clarity and turbidity were distinguished, the mechanism of movement and stillness began to operate.\nThat which ascends in clarity is called Heaven; that which descends in turbidity is called Earth.\nHeaven and Earth—one opening, one closing—one yin, one yang, mutually moving and mutually still, their mechanism ceaseless, thus the four seasons are formed, and the hundred things are born.\nAmong the natures of Heaven and Earth, man is the most noble; among things, man is the most spiritually endowed.\nMan models himself on Heaven, woman on Earth;\nman is clear, woman turbid—this is the ascent and descent of Heaven and Earth;\nman moves, woman is still—this is the opening and closing of Heaven and Earth.\nThe intermingling of Heaven and Earth gives birth to the transformation of the myriad things.\nDescending from root to branch, generation after generation, transformation after transformation, without cease.\n\nThe Supreme Lord first speaks of the formless, the emotionless, the nameless—the beginning of Heaven and Earth—then speaks of movement and stillness, calling it the mother of the named myriad things.\nIf there is one who knows that these two emerge from the same source but bear different names, then they will understand that clarity and turbidity are fundamentally one, that movement and stillness are not two.\nThough the stream may be turbid, its source remains ever clear;\nthough its function may be active, its essence remains ever still.\nThrough long abiding in clarity and stillness, spirit and Dao become one, merging with Heaven and Earth.\n\nMan’s spirit favors clarity, yet the heart disturbs it;\nman’s heart favors stillness, yet desires drag it away.\nIf one can constantly dispel desires, the heart will naturally become still;\nif one can settle the heart, the spirit will naturally become clear.\nThus the six desires will not arise, and the three poisons will dissipate.\nThe man of Dao constantly uses the Dao to restrain desires, not desires to restrain the Dao.\nBy using the Dao to restrain desires, the spirit becomes clear, the heart becomes still.\nThe supreme Dao and the spirit-qi intermingle, pervading the Three Powers and the myriad things, responding to change without end—vast in expanse, yet penetrating the most subtle.\n\nIf one uses desires to restrain the Dao, one loses the Dao.\nThe man who loses the Dao—once the heart of desire sprouts, there is nothing it will not reach.\nExternally, power and profit entangle him; internally, thoughts and anxieties torment him.\nThe heart is turned by things, the spirit is enslaved by the heart.\nOnce heart and spirit are no longer clear and still, where then is the Dao?\n\nIf one can constantly restrain desires, the returning heart will not move;\nif the returning heart does not move, it will naturally become limpid and profound, free from the slightest obscurity, returning to the great original clarity and stillness—what desires could there be?\nThe *Commentary on the Book of Changes* states:\n*\"Below the mountain is the marsh—Diminishing. The noble man restrains anger and curbs desires.\"*\nDoes this not refer to this?\n\nThe reason one cannot do so is that the heart is not yet settled and desires are not yet dispelled.\nFor one who can dispel them:\nInternally observe the heart—there is no heart;\nexternally observe the form—there is no form;\ndistantly observe things—there are no things.\nOnce these three are awakened to, only emptiness is seen.\n\nThe Supreme Lord said:\n*\"Clarity and stillness are the norm of the world.\"*\nWhat is meant by \"norm\"? It is the utmost impartiality, without selfishness.\nOnly the utmost impartiality of Heavenly principle can overcome the utmost selfishness of human desire.\nThe reason worldly people cannot attain the Dao is not that they are incapable, but that they are deluded by the desires of things.\nTo cut off desire, one must first forget self and others.\nTo forget self and others is to internally forget the heart, externally forget the form, and distantly forget things.\nOnce these three are forgotten, Heavenly principle is fully restored—this is called \"greatness,\" which is the meaning of *Gen* (Stillness).\n\nThe *Book of Changes* states:\n*\"Stillness in the back—one does not obtain one’s body. Walking in the courtyard—one does not see others. No blame.\"*\n*\"Stillness in the back\"* is to internally observe the heart—there is no heart.\n*\"One does not obtain one’s body\"* is to externally observe the form—there is no form.\n*\"Walking in the courtyard—one does not see others\"* is to distantly observe things—there are no things.\n\n\"‘No blame’ is the absence of desire. As the *Most High* states, *'No fault is greater than desire'*—this is its meaning. When the desires of things are seen as empty, the celestial purity of stillness is restored. To observe emptiness as empty—emptiness has nothing to be empty. What is to be emptied being none, even ‘non-emptiness’ is none. ‘Non-emptiness’ being none, profound clarity abides in constant quiescence. Quiescence having nothing to be quiescent, how can desire arise? Desire not arising, this is true stillness. Truly constant in responding to things, truly constant in attaining nature. Constant in response, constant in stillness—constant in purity and stillness. Though the myriad affairs seem not empty, when unified by the One, they ultimately return to the primordial thing. This is the essential method for dispelling desire. By means of emptiness, desire is dispelled; desire not arising, harmony with emptiness is also none. Emptiness being none, even ‘non-emptiness’ is none. ‘Non-emptiness’ being none, profound clarity abides in quiescence. Quiescence being none, this is called true stillness.\n\nThat which is profoundly clear and constantly quiescent is the congealing of spirit into emptiness and stillness. That which is quiescent yet has nothing to be quiescent is the merging of spirit beyond emptiness and stillness. The so-called true stillness is not non-movement. If stillness were taken as non-movement, it would have a fixed form. Having a fixed form, it would be insufficient to respond to change. Thus, to be truly constant in responding to things and truly constant in attaining nature is to move in response to things while the true essence remains unmoved. Those who see thus abide constantly in response, constantly in stillness, constantly in purity and stillness. Such purity and stillness gradually enter the true Dao. Having entered the true Dao, it is called ‘attaining the Dao.’ Though called ‘attaining the Dao,’ in reality there is nothing attained. For the sake of transforming sentient beings, it is called ‘attaining the Dao.’ Those who awaken to this may transmit the sagely Dao.\n\nQuiescent and unmoving as its essence, responsive and unimpeded in its function—this is called true stillness. As for essence and function arising from one source, the manifest and the subtle without separation, the Dao of true constancy is attained. The word ‘attained’ is but a forced designation. If one claims there is something truly attained, it is insufficient to be called the Dao. The sage only fears that the world does not understand the principle of mutual arising of being and non-being, falling into the erroneous views of permanence or annihilation. Thus, by speaking of ‘attaining the Dao,’ he accommodates and completes them, allowing gradual accumulation to culminate in sudden realization. As for silently accomplishing it, being trusted without words—the sagely Dao may be achieved.\n\nThe so-called transmission is a transmission of non-transmission. The sagely Dao is sagely yet unknowable in its essence. As Lord Lao said: *'The superior person does not contend; the inferior person loves to contend. The highest virtue does not act virtuous; the lesser virtue clings to virtue.'* Those who cling are not called virtuous or of the Dao. Following the Confucian texts’ teaching of non-contention and practicing the Buddhist sutras’ conduct of non-contention—this single method emerges from no-method, penetrating insight merging in darkness—this is the superior person. The inferior person is not thus: the inferior person’s heart loves to prevail, constantly self-satisfied and self-displaying, thus self-aggrandizing and provoking contention. Even with the slightest good, he clings to it as his own virtue; I must call it non-existent. The superior person is the opposite: the superior person obscures his virtue with humility, nurtures himself without self-display, thus refraining from self-aggrandizement. Only by not contending does none in the world contend with him. What the *Most High* calls *'the highest virtue does not act virtuous, therefore it has virtue'*—this is its meaning. Those who cling, even to virtue, do not yet understand it; how can they understand the Dao?\n\nSentient beings do not attain the true Dao because they have deluded minds. Having deluded minds, they startle their spirit. Spirit startled, they cling to the myriad things. Clinging to the myriad things, they generate craving. Generating craving, they become afflicted. Affliction and delusion, anxiety and suffering of body and mind—thus they encounter defilement and disgrace, drift in the cycle of birth and death, constantly sink in the sea of suffering, and forever lose the true Dao. The inferior person loves to contend and cling to virtue because he has a deluded mind—this is the reason. As the ancients said: *'Constantly extinguish the deluded mind, do not extinguish the illuminating mind.'* All minds that do not cease are deluded minds; all minds that do not move are illuminating minds. When deluded thoughts first sprout, right and wrong divide; when the pivot is first set in motion, honor and disgrace are determined. Can one not be diligent?\n\nIf the deluded mind does not cease, it gives rise to all kinds of karmic conditions, leading to treading defiled paths, encountering calamities, and falling into dark destinies—none of which does not begin with the deluded mind. Those who study the Dao must be vigilant at the outset; if the beginning is not cautious, how can there be an end? When deluded thoughts first sprout, one does not self-awaken; spirit is enslaved by the heart, the heart is pulled by things, the Three Corpses rage fiercely, the Six Desires clamor and disturb—how can one not cling to things? Clinging to things gives rise to craving. Craving arising, affliction follows; deluded thoughts and various conditions intertwine without release, leading to anxiety and suffering of body and mind, encountering defilement and disgrace, drifting in the cycle of birth and death, constantly sinking in the sea of suffering, forever losing the true Dao. How lamentable! Thus, the deluded mind is the root of cyclic existence. Sentient beings do not attain the true Dao because the deluded mind is not extinguished—this is the reason.\n\nThe Dao of true constancy is attained by those who awaken. Those who awaken to the Dao abide in constant purity and stillness. Seeing this body, it too arises from deluded thoughts. The body born, then come emotional conditions; emotional conditions arising, then come anxiety and suffering. Deluded conditions proliferate, directly entering the cycle of rebirth—without beginning before, without end after—this is the case for all in the world. Only those who awaken to the Dao maintain the illuminating mind, seeing through the various conditioned appearances as all delusion and illusion, not allowing them to taint or cling. The illuminating mind existing, the deluded mind cannot act. With long and thorough practice, one next stabilizes and verifies the pure body. Those who see thus attain the Dao of true constancy.\n\nThe so-called illuminating mind is the celestial mind; true constancy is non-delusion. Understanding this mind, the mind of delusion is restored, and the Dao of non-delusion is accomplished. Non-delusion is thus the next restoration.\"\n\nThe *Book of Changes* states: \"In returning, one perceives the heart-mind of Heaven and Earth.\" At this stage, even the most minute and subtle things are all illuminated beforehand. As for the state of suchness, unmoving—ever clear, ever knowing—utterly awakened, utterly numinous, perpetually pure, perpetually still: the Dao of true constancy is here fully realized, and the sagely task is complete.\n\nIn the *Laozi’s Scripture on Constant Purity and Stillness* (Annotation #1, \"Responding to Things with True Constancy\"), Du Guangting, Hou Shanyuan, Liu Tongche, and other commentaries concur, while the unannotated text reads \"Responding to Things with True Stillness.\"",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上老君说常清静经注(一) 经名：太上老君说常清静经注。 元代道士李道纯注。 一卷。 底本出处：《正统道藏》洞神部玉诀类。 参校本：杜光庭等诸家注本。 太上老君说常清静经注(一) 都梁参学清庵莹蟾子李道纯注 老君曰：大道无形，生育天地； 大道无情，运行日月； 大道无名，长养万物。 吾不知其名，强名曰道。 才言可道，即非常道。 既不可道，何以名道？ 咦，只这道之一字，已道了也。 视之不足见，听之不足闻，搏之不可得，用之不可既。 惟惚惟恍，不属声闻； 曰希曰夷，无有定体。 若作声闻，会不足以成； 若作定体，求不足以应变。 道虽无形，因天地生育，其形可见； 道虽无情，推日月运行，其情可察； 道虽无冬，穷万物长养，其名可立。 《易系》云：在天成象，在地成形，变化见矣。 非道之形乎？ 又曰，鼓之以雷霆，润之以风雨。 日月运行，一寒一暑。 非道之情乎？ 又曰，乾道成男，坤道成女。 非道之名乎？ 道本无名，圣人强立名道者，通天下万变，归天下之殊途，坦平蓦直、大路之谓也。 夫道者，有清有浊，有动有静。 天清地浊，天动地静； 男清女浊，男动女静。 降本流末，而生万物。 清者浊之源，动者静之基。 人能常清静，天地悉皆归。 鸿蒙未判，动静之理已存； 清浊既分，动静之机始发。 清而升者曰天，浊而降者曰地。 天地一阖辟、一阴阳，互动互静，机缄不已，四时成焉，百物生焉。 天地之性，人为贵，人於物之最灵。 男法天，女法地，男清女浊，即天地升降也； 男动女静，即天地阖辟也。 天地絪缊，万物化生。 降本流末，生生化化，而无有休息。 太上始言无形、无情、无名，天地之始，次言有动、有静，谓有名万物之母也。 若复有人知此两者同出异名，则知清浊本一，动静不二； 流虽浊而其源常清，用虽动而其体常静。 清静久久，神与道俱，与天地为一。 夫人神好清而心扰之，人心好静而欲牵之。 常能遣其欲而心自静，澄其心 而神自清，自然六欲不生，三毒消灭。 有道之士，常以道制欲，不以欲制道。 以道制欲，神所以清，心所以静，至道与神炁，混混沦沦，周乎三才、万物，应变而无穷，至广大，尽精微矣。 苟以欲制道，失道者也。 失道之士，欲心一萌，无所不至，权利牵於外，念虑煎於内，心为物转，神为心役。 心神既不清静，道安在哉？ 常能制欲则归心不动，归心不动则自然澄澄湛湛，绝点翳纯清，复其本然清静之大矣，何欲之有？ 《易传》云：山下有泽损，君子以惩忿窒欲，其斯之谓欤？ 所以不能者，为心未澄、欲未遣也。 能遣之者，内观其心，心无其心； 外观其形，形无其形； 远观其物，物无其物。 三者既悟，惟见於空。 太上云：清静为天下正。 所谓正者，至公无私也。 惟天理之至公，为能胜人欲之至私。 世人所以不能造道者，非不能也，为物欲之所眩也。 绝欲之要，必先忘物我。 忘物我者，内忘其心，外忘其形，远忘其物。 三者既忘，复全天理，是名大，即艮止之义也。 《易》云：艮其背，不获其身； 行其庭，不见其人。 无咎。 艮其背，即内观其心，心无其心也。 不获其身，即外观其形，形无其形也。 行其庭，不见其人，即远观其物，物无其物也。",
      "translated_text": "**The Supreme Lord Lao’s Annotated Scripture on Constant Clarity and Stillness (Part I)**\n\n**Scripture Title:** *The Supreme Lord Lao’s Annotated Scripture on Constant Clarity and Stillness*\n**Commentator:** Li Daochun, a Daoist of the Yuan dynasty\n**Volume:** One\n**Source Text:** *Zhengtong Daoist Canon*, *Dongshen* Section, *Jade Instructions* Category\n**Collated Editions:** Annotations by Du Guangting and other masters\n\n---\n\n**The Supreme Lord Lao’s Annotated Scripture on Constant Clarity and Stillness (Part I)**\n*Annotated by Li Daochun of Qing’an, Lay Disciple of Duliang*\n\nThe Lord Lao said:\nThe Great Dao is formless, yet it gives birth to Heaven and Earth;\nThe Great Dao is without emotion, yet it moves the sun and moon;\nThe Great Dao is nameless, yet it nurtures the myriad things.\nI know not its name, so I forcefully call it the *Dao*.\nYet the moment one speaks of what can be called *Dao*, it is no longer the eternal Dao.\nIf it cannot be spoken, how then can it be named *Dao*?\nAh! This single word *Dao* has already expressed it.\n\nIt cannot be seen when looked upon,\ncannot be heard when listened to,\ncannot be grasped when seized,\ncannot be exhausted when used.\nVague and indistinct,\nit does not belong to the realm of sound and perception.\nRare and subtle,\nit has no fixed form.\nIf one treats it as sound and perception, comprehension will not suffice to grasp it;\nif one seeks a fixed form, inquiry will not suffice to respond to change.\n\nThough the Dao is formless,\nthrough the birth of Heaven and Earth, its form becomes visible;\nthough the Dao is without emotion,\nthrough the movement of the sun and moon, its nature can be discerned;\nthough the Dao is nameless,\nthrough the nurturing of the myriad things, its name can be established.\n\nThe *Appended Judgments* of the *Book of Changes* states:\n*\"In Heaven, it forms images; on Earth, it takes shape—thus transformation is manifest.\"*\nIs this not the form of the Dao?\nIt further says:\n*\"It drums them with thunder and lightning, moistens them with wind and rain. The sun and moon revolve, alternating cold and heat.\"*\nIs this not the nature of the Dao?\nIt also says:\n*\"The Dao of Qian becomes male; the Dao of Kun becomes female.\"*\nIs this not the name of the Dao?\n\nThe Dao is originally nameless, yet the sages forcibly named it *Dao* to encompass the myriad changes of the world, to unify its diverse paths—this is what is meant by the broad, level, and straight great Way.\nThe Dao possesses clarity and turbidity, movement and stillness.\nHeaven is clear, Earth is turbid;\nHeaven moves, Earth is still.\nMale is clear, female is turbid;\nmale moves, female is still.\nDescending from root to branch, it gives birth to the myriad things.\nClarity is the source of turbidity; movement is the foundation of stillness.\nIf one can constantly abide in clarity and stillness, Heaven and Earth will all return to it.\n\nBefore the Primordial Chaos divided, the principle of movement and stillness already existed;\nonce clarity and turbidity were distinguished, the mechanism of movement and stillness began to operate.\nThat which ascends in clarity is called Heaven; that which descends in turbidity is called Earth.\nHeaven and Earth—one opening, one closing—one yin, one yang, mutually moving and mutually still, their mechanism ceaseless, thus the four seasons are formed, and the hundred things are born.\nAmong the natures of Heaven and Earth, man is the most noble; among things, man is the most spiritually endowed.\nMan models himself on Heaven, woman on Earth;\nman is clear, woman turbid—this is the ascent and descent of Heaven and Earth;\nman moves, woman is still—this is the opening and closing of Heaven and Earth.\nThe intermingling of Heaven and Earth gives birth to the transformation of the myriad things.\nDescending from root to branch, generation after generation, transformation after transformation, without cease.\n\nThe Supreme Lord first speaks of the formless, the emotionless, the nameless—the beginning of Heaven and Earth—then speaks of movement and stillness, calling it the mother of the named myriad things.\nIf there is one who knows that these two emerge from the same source but bear different names, then they will understand that clarity and turbidity are fundamentally one, that movement and stillness are not two.\nThough the stream may be turbid, its source remains ever clear;\nthough its function may be active, its essence remains ever still.\nThrough long abiding in clarity and stillness, spirit and Dao become one, merging with Heaven and Earth.\n\nMan’s spirit favors clarity, yet the heart disturbs it;\nman’s heart favors stillness, yet desires drag it away.\nIf one can constantly dispel desires, the heart will naturally become still;\nif one can settle the heart, the spirit will naturally become clear.\nThus the six desires will not arise, and the three poisons will dissipate.\nThe man of Dao constantly uses the Dao to restrain desires, not desires to restrain the Dao.\nBy using the Dao to restrain desires, the spirit becomes clear, the heart becomes still.\nThe supreme Dao and the spirit-qi intermingle, pervading the Three Powers and the myriad things, responding to change without end—vast in expanse, yet penetrating the most subtle.\n\nIf one uses desires to restrain the Dao, one loses the Dao.\nThe man who loses the Dao—once the heart of desire sprouts, there is nothing it will not reach.\nExternally, power and profit entangle him; internally, thoughts and anxieties torment him.\nThe heart is turned by things, the spirit is enslaved by the heart.\nOnce heart and spirit are no longer clear and still, where then is the Dao?\n\nIf one can constantly restrain desires, the returning heart will not move;\nif the returning heart does not move, it will naturally become limpid and profound, free from the slightest obscurity, returning to the great original clarity and stillness—what desires could there be?\nThe *Commentary on the Book of Changes* states:\n*\"Below the mountain is the marsh—Diminishing. The noble man restrains anger and curbs desires.\"*\nDoes this not refer to this?\n\nThe reason one cannot do so is that the heart is not yet settled and desires are not yet dispelled.\nFor one who can dispel them:\nInternally observe the heart—there is no heart;\nexternally observe the form—there is no form;\ndistantly observe things—there are no things.\nOnce these three are awakened to, only emptiness is seen.\n\nThe Supreme Lord said:\n*\"Clarity and stillness are the norm of the world.\"*\nWhat is meant by \"norm\"? It is the utmost impartiality, without selfishness.\nOnly the utmost impartiality of Heavenly principle can overcome the utmost selfishness of human desire.\nThe reason worldly people cannot attain the Dao is not that they are incapable, but that they are deluded by the desires of things.\nTo cut off desire, one must first forget self and others.\nTo forget self and others is to internally forget the heart, externally forget the form, and distantly forget things.\nOnce these three are forgotten, Heavenly principle is fully restored—this is called \"greatness,\" which is the meaning of *Gen* (Stillness).\n\nThe *Book of Changes* states:\n*\"Stillness in the back—one does not obtain one’s body. Walking in the courtyard—one does not see others. No blame.\"*\n*\"Stillness in the back\"* is to internally observe the heart—there is no heart.\n*\"One does not obtain one’s body\"* is to externally observe the form—there is no form.\n*\"Walking in the courtyard—one does not see others\"* is to distantly observe things—there are no things.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1242,
      "start_sentence": 0,
      "end_sentence": 77,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.965479612350464,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\太上老君说常清静经注（元李道纯）.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "无咎即无欲也。 太上云，咎莫大於欲得，即此义也。 至於物欲见空，则清静之天复矣。 观空亦空，空无所空。 所空既无，无无亦无。 无无既无，湛然常寂。 寂无所寂，欲岂能生？ 欲既不生，即是真静。 真常应物#1，真常得性。 常应常静，常清静矣。 攸攸万事不是空，一以贯之，终归元物。 此遣欲之要也。 以空遣欲，欲既不生，和空亦无。 空既无矣，无亦无也。 无无既无，湛然寂然。 湛寂亦无，是名真静。 湛然常寂者，凝神入空寂也。 寂无所寂者，融神出空寂也。 所谓真静，非不动也。 若以不动为静，则是有定体也。 有定体，则不足以应变。 所以真常应物，真常得性者，动而应物而真体不动也。 作如是见者，常应常静，常清静矣。 如此清静，渐入真道。 既入真道，名为得道。 虽名得道，实无所得。 为化众生，名为得道。 能悟之者，可传圣道。 寂然不动为体，感而遂通为用，是名真静。 至於体用一源，显微无间，真常之道得矣。 得之一字，亦是强名。 若谓实有所得，则不足以为道。 圣人惟恐世人不知有无相生之理，落断常邪见，故以得道委曲成全，使其积渐而至顿成也。 至於嘿而成之，不言而信，圣道可造也。 所谓传者，不传之传也。 圣道者，圣而不可知之之谓也。 老君曰：上士无争，下士好争； 上德不德，下德执德。 执着之者，不名道德。 遵儒书不争之言，行释经无争之行。 此一法出於无法，洞观冥契，是名上士也。 下士则不然：下士之心好胜，常自满自见，是自矜伐，致争之由也。 才有微善，执为己德，吾必谓之无也。 上士返是：上士晦德以谦，自牧不自见，是不自矜伐。 夫惟不争，故天下莫能与之争。 太上所谓上德不德，是以有德，即此义也。 执着之者，德尚不明，何以明道哉？ 众生所以不得真道者，为有妄心。 既有妄心，即惊其神。 既惊其神，即着万物。 既着万物，即生贪求。 既生贪求，即是烦恼。 烦恼妄想，忧苦身心，便遭浊辱，流浪生死，常沉苦海，永失真道。 下士好争执德，为有妄心，所以然也。 古德云：常灭妄心，不灭照心。 一切不止之心，皆妄心也； 一切不动之心，皆照心也。 妄想一萌邪正分，枢机一发荣辱判。 可不勉哉？ 妄心不止，生种种差别因缘，至於涉秽途、触祸机、落阴趣，未有不始於妄心也。 学道之士，固当谨始，始若不馑，焉得有终？ 妄念始萌，不自知觉，神为心役，心为物牵，纵三尸之炽盛，为六欲之扰攘，岂得不着物耶？ 着物之故，贪求心生。 既生贪求，即是烦恼，妄想种种相缘无由解脱，至於忧苦身心，便遭浊辱，流浪生死，常沉苦海，永失真道。 良可悲哉。 所以妄想之心，轮回之根本也。 众生所以不得真道者，为妄想心不灭，所以然也。 真常之道，悟者自得。 得悟道者，常清静矣。 见在此身，亦从妄想中来。 身生而后有情缘，情缘而后有忧苦。 妄增缘起，直入轮回，前无始而后无终者，举世皆然。 惟悟道者照心常存，照破种种缘相皆是妄幻，勿令染着。 照心既存，妄心无能为也。 久久纯熟，次定证清静身。 作是见者，真常之、道得矣。 所谓照心者，即天心也； 真常者，即无妄也。 了悟此心，则有妄之心复矣，无妄之道成矣。 无妄所以次复也。",
      "translated_text": "\"‘No blame’ is the absence of desire. As the *Most High* states, *'No fault is greater than desire'*—this is its meaning. When the desires of things are seen as empty, the celestial purity of stillness is restored. To observe emptiness as empty—emptiness has nothing to be empty. What is to be emptied being none, even ‘non-emptiness’ is none. ‘Non-emptiness’ being none, profound clarity abides in constant quiescence. Quiescence having nothing to be quiescent, how can desire arise? Desire not arising, this is true stillness. Truly constant in responding to things, truly constant in attaining nature. Constant in response, constant in stillness—constant in purity and stillness. Though the myriad affairs seem not empty, when unified by the One, they ultimately return to the primordial thing. This is the essential method for dispelling desire. By means of emptiness, desire is dispelled; desire not arising, harmony with emptiness is also none. Emptiness being none, even ‘non-emptiness’ is none. ‘Non-emptiness’ being none, profound clarity abides in quiescence. Quiescence being none, this is called true stillness.\n\nThat which is profoundly clear and constantly quiescent is the congealing of spirit into emptiness and stillness. That which is quiescent yet has nothing to be quiescent is the merging of spirit beyond emptiness and stillness. The so-called true stillness is not non-movement. If stillness were taken as non-movement, it would have a fixed form. Having a fixed form, it would be insufficient to respond to change. Thus, to be truly constant in responding to things and truly constant in attaining nature is to move in response to things while the true essence remains unmoved. Those who see thus abide constantly in response, constantly in stillness, constantly in purity and stillness. Such purity and stillness gradually enter the true Dao. Having entered the true Dao, it is called ‘attaining the Dao.’ Though called ‘attaining the Dao,’ in reality there is nothing attained. For the sake of transforming sentient beings, it is called ‘attaining the Dao.’ Those who awaken to this may transmit the sagely Dao.\n\nQuiescent and unmoving as its essence, responsive and unimpeded in its function—this is called true stillness. As for essence and function arising from one source, the manifest and the subtle without separation, the Dao of true constancy is attained. The word ‘attained’ is but a forced designation. If one claims there is something truly attained, it is insufficient to be called the Dao. The sage only fears that the world does not understand the principle of mutual arising of being and non-being, falling into the erroneous views of permanence or annihilation. Thus, by speaking of ‘attaining the Dao,’ he accommodates and completes them, allowing gradual accumulation to culminate in sudden realization. As for silently accomplishing it, being trusted without words—the sagely Dao may be achieved.\n\nThe so-called transmission is a transmission of non-transmission. The sagely Dao is sagely yet unknowable in its essence. As Lord Lao said: *'The superior person does not contend; the inferior person loves to contend. The highest virtue does not act virtuous; the lesser virtue clings to virtue.'* Those who cling are not called virtuous or of the Dao. Following the Confucian texts’ teaching of non-contention and practicing the Buddhist sutras’ conduct of non-contention—this single method emerges from no-method, penetrating insight merging in darkness—this is the superior person. The inferior person is not thus: the inferior person’s heart loves to prevail, constantly self-satisfied and self-displaying, thus self-aggrandizing and provoking contention. Even with the slightest good, he clings to it as his own virtue; I must call it non-existent. The superior person is the opposite: the superior person obscures his virtue with humility, nurtures himself without self-display, thus refraining from self-aggrandizement. Only by not contending does none in the world contend with him. What the *Most High* calls *'the highest virtue does not act virtuous, therefore it has virtue'*—this is its meaning. Those who cling, even to virtue, do not yet understand it; how can they understand the Dao?\n\nSentient beings do not attain the true Dao because they have deluded minds. Having deluded minds, they startle their spirit. Spirit startled, they cling to the myriad things. Clinging to the myriad things, they generate craving. Generating craving, they become afflicted. Affliction and delusion, anxiety and suffering of body and mind—thus they encounter defilement and disgrace, drift in the cycle of birth and death, constantly sink in the sea of suffering, and forever lose the true Dao. The inferior person loves to contend and cling to virtue because he has a deluded mind—this is the reason. As the ancients said: *'Constantly extinguish the deluded mind, do not extinguish the illuminating mind.'* All minds that do not cease are deluded minds; all minds that do not move are illuminating minds. When deluded thoughts first sprout, right and wrong divide; when the pivot is first set in motion, honor and disgrace are determined. Can one not be diligent?\n\nIf the deluded mind does not cease, it gives rise to all kinds of karmic conditions, leading to treading defiled paths, encountering calamities, and falling into dark destinies—none of which does not begin with the deluded mind. Those who study the Dao must be vigilant at the outset; if the beginning is not cautious, how can there be an end? When deluded thoughts first sprout, one does not self-awaken; spirit is enslaved by the heart, the heart is pulled by things, the Three Corpses rage fiercely, the Six Desires clamor and disturb—how can one not cling to things? Clinging to things gives rise to craving. Craving arising, affliction follows; deluded thoughts and various conditions intertwine without release, leading to anxiety and suffering of body and mind, encountering defilement and disgrace, drifting in the cycle of birth and death, constantly sinking in the sea of suffering, forever losing the true Dao. How lamentable! Thus, the deluded mind is the root of cyclic existence. Sentient beings do not attain the true Dao because the deluded mind is not extinguished—this is the reason.\n\nThe Dao of true constancy is attained by those who awaken. Those who awaken to the Dao abide in constant purity and stillness. Seeing this body, it too arises from deluded thoughts. The body born, then come emotional conditions; emotional conditions arising, then come anxiety and suffering. Deluded conditions proliferate, directly entering the cycle of rebirth—without beginning before, without end after—this is the case for all in the world. Only those who awaken to the Dao maintain the illuminating mind, seeing through the various conditioned appearances as all delusion and illusion, not allowing them to taint or cling. The illuminating mind existing, the deluded mind cannot act. With long and thorough practice, one next stabilizes and verifies the pure body. Those who see thus attain the Dao of true constancy.\n\nThe so-called illuminating mind is the celestial mind; true constancy is non-delusion. Understanding this mind, the mind of delusion is restored, and the Dao of non-delusion is accomplished. Non-delusion is thus the next restoration.\"",
      "overlap_context": "restored—this is called \"greatness,\" which is the meaning of *Gen* (Stillness).\n\nThe *Book of Changes* states:\n*\"Stillness in the back—one does not obtain one’s body. Walking in the courtyard—one does not see others. No blame.\"*\n*\"Stillness in the back\"* is to internally observe the heart—there is no heart.\n*\"One does not obtain one’s body\"* is to externally observe the form—there is no form.\n*\"Walking in the courtyard—one does not see others\"* is to distantly observe things—there are no things.",
      "start_char": 1242,
      "end_char": 2476,
      "start_sentence": 78,
      "end_sentence": 157,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.271417140960693,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\太上老君说常清静经注（元李道纯）.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "《易》曰：复其见天地之心乎。 到这里，纤芥幽微，悉皆先照。 至於如如不动，了了常知，至觉至灵，常清常静。 真常之道，至是尽矣，圣人之能事毕矣。 太上老君说常清静经注 #1『真常应物』，杜光庭、侯善渊、刘通彻等注本同，白文本作『真静应物』。",
      "translated_text": "The *Book of Changes* states: \"In returning, one perceives the heart-mind of Heaven and Earth.\" At this stage, even the most minute and subtle things are all illuminated beforehand. As for the state of suchness, unmoving—ever clear, ever knowing—utterly awakened, utterly numinous, perpetually pure, perpetually still: the Dao of true constancy is here fully realized, and the sagely task is complete.\n\nIn the *Laozi’s Scripture on Constant Purity and Stillness* (Annotation #1, \"Responding to Things with True Constancy\"), Du Guangting, Hou Shanyuan, Liu Tongche, and other commentaries concur, while the unannotated text reads \"Responding to Things with True Stillness.\"",
      "overlap_context": "es as all delusion and illusion, not allowing them to taint or cling. The illuminating mind existing, the deluded mind cannot act. With long and thorough practice, one next stabilizes and verifies the pure body. Those who see thus attain the Dao of true constancy.\n\nThe so-called illuminating mind is the celestial mind; true constancy is non-delusion. Understanding this mind, the mind of delusion is restored, and the Dao of non-delusion is accomplished. Non-delusion is thus the next restoration.\"",
      "start_char": 2476,
      "end_char": 2596,
      "start_sentence": 158,
      "end_sentence": 163,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 4.147914409637451,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\太上老君说常清静经注（元李道纯）.txt",
        "category": "玉诀类"
      }
    }
  ]
}