{
  "source_id": "太上黄庭内景玉经",
  "source_file": "chunked_daozang\\太上黄庭内景玉经.json",
  "total_chunks": 4,
  "total_original_chars": 3962,
  "total_translated_chars": 26066,
  "total_translation_time": 141.7653260231018,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\本文类\\太上黄庭内景玉经.txt",
    "category": "本文类"
  },
  "full_translation": "**The Supreme Yellow Court Inner Radiance Jade Scripture**\n\n**Scripture Title:** *The Supreme Yellow Court Inner Radiance Jade Scripture*. Also known as *The Highest Clarity Yellow Court Inner Radiance Jade Scripture*, *The Yellow Court Inner Radiance Scripture*, and *The Yellow Court Scripture*. Composed by Wei Huadu of the Jin dynasty.\n\n**Spring.**\n\n**Source Text:** *Daoist Canon of the Orthodox Unity* (Washing Mysteries Section, *Benwen* Category).\n**Collated Editions:**\n1. *Essentials from the Brick Canon*, appended to the final collection, *Dou* fascicle (hereafter *Essentials Edition*).\n2. *Elucidations on the Supreme Unity and Yellow Court Scriptures* by Dong Yisu of the Qing dynasty (hereafter *Dong Edition*).\n\n---\n\n### **First Chapter: Highest Clarity**\nBefore the Purple Radiance of the Highest Clarity, the Supreme Dao’s Jade Dawn Lord,\nLeisurely composes seven-word verses with elixir pearls,\nDispersing and transforming the five forms into ten thousand spirits—\nThus is the *Yellow Court* made into the Inner Chapters.\nThe zither-heart’s triple refrains dance the weary embryo,\nNine qi shine brightly, emerging from the celestial inquiry.\nThe divine canopy’s youth generates purple mist—\nThis is called the jade script, fit for refined study.\nChant it ten thousand times to ascend the Three Heavens,\nA thousand disasters dissolve, a hundred illnesses heal.\nFear not the ferocity of tigers and wolves,\nAnd thus reverse aging to extend the years forever.\n\n---\n\n### **Second Chapter: Above**\nAbove resides the hun-soul, below the Pass of Origin,\nLeft is Lesser Yang, right Greater Yin,\nBehind lies the Secret Gate, before the Gate of Life—\nExhaling the sun, inhaling the moon.\nThe Primordial Black unites with the constellations,\nPurple mist ascends and descends through the Three Pristine.\nIrrigate the five flowers, plant the numinous root,\nThe seven liquids flow through the central chamber,\nRevolving purple, embracing yellow, entering the cinnabar field.\nThe secluded chamber’s inner radiance illuminates the Yang Gate.\n\n---\n\n### **Third Chapter: The Mouth**\nThe mouth is the Jade Pool, the Palace of Supreme Harmony,\nRinsing and swallowing the numinous fluid, calamities do not dry.\nThe body generates radiant light, the qi like fragrant orchids,\nDispelling a hundred evils, refining the jade countenance.\nThose who diligently cultivate it ascend to Broad Cold,\nDay and night without sleep, thus attaining perfection.\nThunder roars, lightning flashes, the spirits stir.\n\n---\n\n### **Fourth Chapter: The Yellow Court**\nThe Yellow Court’s inner person wears brocade robes,\nPurple blossoms fly like skirts, cloud-gauze trailing.\nCinnabar and green, verdant branches, jade-like stalks,\nSeven-tiered jade locks seal the double doors,\nHeavily veiled by the Golden Gate, the secret mechanism.\nThe dark spring’s secluded gate towers high,\nWithin the Three Fields, essence and qi are subtle.\nThe delicate maiden, graceful, veiled in celestial radiance,\nThe layered halls gleam, displaying eight mights.\nHeaven’s Court and Earth’s Pass array axes,\nThe Numinous Terrace stands firm, never decaying.\n\n---\n\n### **Fifth Chapter: The Central Pool**\nThe Central Pool’s inner spirit wears crimson pearls,\nCinnabar brocade cloud-robes girded with tigers.\nThe three-inch crossing is where the numinous dwells,\nHidden mushrooms flourish, self-supporting.\nThe numinous radiance obscures, luxuriant and mutual.\n\n---\n\n### **Sixth Chapter: Heaven’s Center**\nHeaven’s Central Peak refines essence with care,\nThe numinous abode cleansed, the Jade Emperor resides.\nThe roads of communication remain unceasingly open.\nThe brows are named Floral Canopy, covering the bright,\nThe Nine Darks, sun and moon, penetrate the Primordial Void.\nWithin the abode dwells the Perfected, ever-clothed—\nThose who discern this know no illness or fatigue.\nCrimson pearls, numinous skirts, floral emotions,\nBeneath the tongue, the Dark Gullet spans life and death.\nEmerging from azure, entering the mysterious, the two blacks—\nIf you encounter this, you ascend to the Celestial Han.\n\n---\n\n### **Seventh Chapter: The Ultimate Dao**\nThe Ultimate Dao is not troubled by remembering the true,\nThe Mud Pill’s hundred nodes all harbor spirits.\nThe hair spirit, Azure Flower, named Supreme Origin,\nThe brain spirit, Essence Root, named Mud Pill,\nThe eye spirit, Bright Above, named Heroic Mystery,\nThe nose spirit, Jade Mound, named Numinous,\nThe ear spirit, Empty Leisure, named Secluded Field,\nThe tongue spirit, Commanding Life, named Upright,\nThe tooth spirit, Startled Blade, named Net Thousand.\nThe spirits of the face all honor the Mud Pill,\nThe Mud Pill’s nine Perfected each have their chambers,\nA square inch in this place—\nWithin, they all wear purple robes, flying gauze skirts.\nSimply contemplate this unity to live without end,\nNot dwelling separately within the brain,\nTheir ranks seated facing outward,\nTheir abode in the heart naturally corresponds.\n\n---\n\n### **Eighth Chapter: The Heart Spirit**\nThe heart spirit, Cinnabar Origin, named Guardian of the Numinous,\nThe lung spirit, Luminous Flower, named Void,\nThe liver spirit, Dragon Mist, named Containing Brightness,\nThe luxuriant obscurity guides the mist, master of the turbid,\nThe kidney spirit, Dark Mystery, named Nurturing Infant,\nThe spleen spirit, Constant Presence, named Soul,\nThe gallbladder spirit, Dragon Radiance, named Majestic Brightness.\nThe spirits of the six bowels and five viscera,\nAll operate within the heart, circulating the celestial scripture.\nDay and night, preserve them to attain longevity.\n\n---\n\n### **Ninth Chapter: The Lung Section**\nThe Lung Section’s palace resembles a floral canopy,\nBelow sits a youth in the Jade Gate,\nThe Seven Origins’ child governs qi regulation,\nExternally corresponding to the Central Peak, the nose’s position.\nWhite brocade robes, yellow cloud sashes—\nIf breathing is labored, the body is unwell.\nHastily visualize White Origin, harmonizing the six qi,\nThe spirit weary, long gazing brings no harm,\nUse it unceasingly, the form does not stagnate.\n\n---\n\n### **Tenth Chapter: The Heart Section**\nThe Heart Section’s palace holds a lotus containing blossoms,\nBelow dwells the youth, Cinnabar Origin’s family,\nGoverning cold and heat, harmonizing construction and defense.\nCinnabar brocade flying skirts draped in jade gauze,\nGolden bells, vermilion sashes, seated in dance.\nRegulating blood, ordering life, the body does not wither.\nExternally corresponding to the mouth and tongue, spouting jade blossoms.\nAt the brink of death, call upon it to revive,\nPractice it long, and you will soar through the great radiance.\n\n---\n\n### **Eleventh Chapter: The Liver Section**\nThe Liver Section’s palace is wrapped in layered emerald,\nBelow resides the Azure Youth, the Divine Duke,\nGoverning all barriers, the beginning of clarity and brightness.\nAzure brocade draped, jade pendants worn,\nHarmonizing the hun and po, balancing fluids.\nExternally corresponding to the eyes, sun and moon.\nThe hundred illnesses converge—preserve the Flourishing,\nTogether use it for seven days to naturally fill.\nAt the verge of death, invoke the spirit to revive,\nGathering the hun, returning the po, forever without...\n\n### **Twelfth Chapter: The Kidney Section**\nThe Kidney Section’s palace is the Mysterious Pass, round and deep,\nWithin resides the Youth of Obscure Primordiality, sovereign of the Dark Mystery,\nGoverning the six viscera, source of the nine fluids.\nExternally corresponding to the two ears, the hundred-fluid springs,\nAzure brocade cloud-robes swirling with dragon banners.\nAbove, it summons luminous mist, sun and moon’s haze,\nThe hundred illnesses and thousand calamities—hasten to preserve it.\nThe two Water Lords face the Gate of Life,\nEnabling one to attain long life and ascend the Nine Heavens.\n\n### **Thirteenth Chapter: The Spleen Section**\nThe Spleen Section’s palace belongs to wu and ji,\nWithin dwells the Luminous Youth, wrapped in yellow robes,\nDissolving grains, dispersing qi, governing teeth,\nThis is the Great Granary, the two Bright Youths,\nSeated in the nine-tiered Golden Terrace Citadel,\nSquare and round, a cun within the Gate of Life.\nIt harmonizes the hundred grains, the five fragrant flavors,\nRepelling emaciation and illness, averting harm.\nExternally corresponding to the dwelling of the cubit, radiant complexion,\nIts brilliance arises to manifest.\nYellow brocade, jade robes, tiger-patterned sash,\nFocus the mind on the Three Elders, and you will lightly soar,\nAttaining long life, rising high, far from death’s misfortune.\n\n### **Fourteenth Chapter: The Gallbladder Section**\nThe Gallbladder Section’s palace is the essence of the six viscera,\nWithin resides the Youth, radiant with majestic brightness,\nThunder and lightning resound eightfold, brandishing jade banners,\nDragon standards cross the sky, casting fire bells.\nGoverning all strength and qi, commanding tiger soldiers,\nExternally corresponding to the pupils of the eyes, the bridge of the nose,\nBrain and hair mutually supporting, both resplendent.\nNine-colored brocade robes, green floral skirts,\nAdorned with gold belts, jade, dragon-and-tiger patterns.\nIf you can preserve its majestic brightness, you will ride the auspicious clouds,\nCommanding the myriad spirits to pay homage at the Three Origins.\n\n### **Fifteenth Chapter: The Spleen’s Length**\nThe Spleen stretches a foot, covering the Great Granary,\nWithin its central region, the Venerable Lord governs brightness,\nIts name is Lingyuan, called Hunkang,\nCuring the hundred illnesses, digesting grains.\nYellow robes, purple sashes, dragon-and-tiger emblems,\nProlonging essence, enhancing life—reliant on this Lord.\nCall my name thrice, and the spirit will naturally commune,\nThe Three Elders sit together, each with their own methods,\nWhether essence or embryo, they hold distinct prescriptions,\nPeach kernels unite to extend life’s blossoms.\nMale and female traverse the ninefold path to Peach Prosperity,\nDao-Father and Dao-Mother face each other,\nMaster-Father and Master-Mother dwell in the Cinnabar Mystery,\nYou may employ visualization to ascend the void,\nDivergent paths converge in one essential end.\nSeal the Three Passes, grasp firmness,\nRinse with golden nectar, swallow jade blossoms,\nThus attaining non-hunger, the Three Worms perish,\nHeart and intent ever harmonious, bringing joyous prosperity.\nThe clouds and qi of the Five Peaks billow,\nPreserve and bathe in a single jade hut to recompense yourself,\nThe five forms complete and sturdy, free from calamity.\n\n### **Sixteenth Chapter: Gazing Above**\nGazing above, the Three Origins like linked pearls,\nLuminous and resplendent, illuminating the nine corners,\nThe Five Spirits nightly kindle, illuminating the eight regions.\nIf you preserve the Inner Sovereign and wander with me,\nClad in phoenix robes, bearing tiger talismans,\nYou will swiftly ascend to the formless void.\nWithin the square inch, profound thoughts are concealed,\nNeither square nor round, sealing windows and doors,\nThe Three Spirits return essence, and the old become robust,\nHun and po guard within, not contending with the Supreme.\nThe Yellow Court’s inner vision—life and death’s contest ceases.\nSpirits born within the abdomen, bearing jade bells,\nDivine influx fills the obscure gates—how could it be lost?\nJade branches stretch ten thousand spans, offering shelter,\nThe Three Hun naturally tranquil, the Emperor’s decree commands.\n\n### **Seventeenth Chapter: The Spirit Terrace**\nThe Spirit Terrace, lush and misty, overlooks the Yellow Wilds,\nThree inches, distinct chambers above and below,\nThe Pass of Inquiry governs the camp and guard, receiving the Lofty Mystery,\nThe Cavern Chamber, Purple Ultimate, Spirit Gate.\nThus did the Supreme once instruct me:\nOn the left, the Divine Duke speaks the spirit’s words,\nOn the right, White Prime stands in attendance,\nThe Hall of Light, Golden Cabinet, Jade Chamber—inquire within,\nThe Perfected of Supreme Clarity stand before me.\nThe Yellow-Robed Youth’s cinnabar qi frequently stirs,\nI ask: where do the two brows reside?\nWithin, they flank the sun and moon, arraying the constellations,\nThe Seven Luminaries, Nine Origins crown the Gate of Life.\n\n### **Eighteenth Chapter: The Three Passes**\nWithin the Three Passes, essence and qi run deep,\nIn the Nine Subtleties, obscure and dark.\nThe mouth is Heaven’s Pass, the spirit’s mechanism,\nThe feet are Earth’s Pass, the gate of life,\nThe hands are Human’s Pass, grasping prosperity and decline.\n\n### **Nineteenth Chapter: If Attained**\nIf you attain the Three Officials and preserve the Mysterious Elixir,\nThe Great One’s flowing pearl rests in Kunlun,\nLayered towers and pavilions, twelvefold rings,\nNaturally high and low, all are real.\nJade Hall, crimson chambers, all are Mysterious Palaces,\nThe Jade Armillary, Jade Balance, orchid-hued,\nGazing upon the Youths seated in leisure,\nI ask: whose children are these within me?\nWhere have they gone? Entering the Muddy Pellet,\nThousands upon thousands, hundreds upon hundreds, each distinct,\nTen upon ten, like layered mountains.\nCloud standards, jade blossoms flank the ears,\nThe Red Emperor, Yellow Elder, and my hun,\nThe Three Perfected support the bones, sharing the chamber,\nThe Five Dippers radiant, the Seven Origins,\nSun and moon flying through the Six Harmonies,\nThe Emperor’s homeland, the center of heaven, the earth’s gate,\nThe facial spirits and hun all preserved.\n\n### **Twentieth Chapter: Breathing**\nInhaling and exhaling primordial qi to seek transmission,\nThe Transmitted Duke’s son seems present,\nCrimson birds contract, white stone’s source,\nCongealing essence, nurturing the embryo, transforming life,\nRetaining the embryo, halting essence—this is long life.\nThe Three Qi revolve to the right, the Nine Paths,\nThe Orthodox One contains blossoms, thus filling.\nGazing afar, the heart like a net,\nBeneath the golden chamber, can it not be overturned?\nExtending my white-haired years, returning to infancy.\n\n### **Twenty-First Chapter: The Jade Chamber**\nWithin the Jade Chamber, the Eight Simplicities gather,\nThe Muddy Pellet Lady stands at the center,\nThe Long Valley, Mysterious Homeland encircles the outskirts,\nSix dragons scatter and fly, difficult to distinguish.\nLong life demands utmost caution in the chamber’s urgency,\nWhy court death, inviting the calamity of the spirits’ neglect?\nOnly inhale qi, absorb the essence of the child,\nThe inch-field, foot-dwelling can govern life.\nIf you indulge in regret, a hundred stains,\nLeaves fall, the tree withers, losing its verdancy,\nQi lost, fluids leak—this is no longer your form.\nFocus on sealing, mastering the vision, thus attaining long tranquility,\nPreserve my Muddy Pellet’s Three Wonders,\nSerene and idle, gazing inward, naturally clear,\nThings do not disturb, at peace,\nAbundant indeed—no affairs, the old become youthful again,\nRecite the Jade Scripture, enter Supreme Clarity.\n\n### **Twenty-Second Chapter: Constant Remembrance**\nConstantly remember the Three Chambers, interconnected,\nThrough penetrating vision, see without inside or outside,\nPreserve and rinse the Five Sprouts, free from hunger and thirst,\nDivine blossoms hold the towel, the Six Dings exhaust themselves.\nSwiftly guard the Essence Chamber, do not recklessly leak,\nSeal and treasure it—this is longevity.\nArising from within the form, initially not distant,\nThe Three Officials are near, easily concealed.\nVoid and stillness, emptiness’s simplicity,\nMake the form thus—it should not be.\nThe Nine Chambers, perfectly empty, house the spirit’s brightness,\nPreserve thoughts, regulate the hundred contemplations,\nCultivate the six viscera, let them not decay,\nThen you will soar and enter the clouds.\n\n### **Twenty-Third Chapter: Cultivating Life**\nThe Dao of cultivating life is not cumbersome,\nSimply refine the *Dongxuan* and *Jade Canon*,\nAnd practice the Eight Radiant Spirits within the form,\nThe Twenty-Four Perfected emerge naturally.\nSit in lofty repose, non-action—soul and spirit at peace,\nIn clarity and stillness, the spirit appears and speaks with me,\nAbiding in the Purple Chamber amid curtains,\nStanding or sitting outside the room, the Three and Five Mysteries.\n\nBurn incense, join hands before the Jade Flower,\nTogether enter the Great Chamber through the Gate of the Turning Sphere,\nProfoundly study the garden of the Dao in tranquility,\nInward vision, subtle gaze—all truths are seen.\nThe Perfected reside within; do not seek neighbors,\nWhy search afar for causes and conditions?\n\n### **Twenty-Fourth Chapter: Concealing Radiance**\nConceal radiance, hide the form, set apart from the world,\nContain qi, nourish essence—lips like cinnabar,\nGrasp life’s nature, guard emptiness,\nYour name enters the Upper Clarity, death’s register erased,\nThe joy of the Three Spirits arises from reclusion.\n\nSwiftly roam and wander without lingering cares,\nAdorned in garments, the Eight Winds drive,\nHarness the Three Primes, ride the morning clouds,\nGolden ranks align, following the Jade Chariot,\nWhy not ascend the mountain and recite my scripture?\nLush and secluded, the Perfected’s abode,\nEntering the mountain—what difficulty? Yet you hesitate,\nWhile the world’s clamor reeks like a refuse heap.\n\n### **Twenty-Fifth Chapter: The Five Phases**\nThe Five Phases revolve, returning to the One,\nThree and Five merge qi, the nine-nines’ nodes,\nUse them to conceal the earth, reverse the Eight Guards,\nThe Hidden Ox, Dark Gate—arrayed in ranks.\n\nThe Three Clarities emerge from the boundary of life and death,\nThe Grotto Chamber’s numinous image—sun and moon lose their chambers,\nThe Father is the Mud-Pill Palace, the Mother the Feminine One,\nThe Three Luminaries shine brilliantly into the child.\n\nAbide in the Mysterious True—all affairs are complete,\nThe spirit of the body must not be lost.\n\n### **Twenty-Sixth Chapter: Soaring Aloft**\nSoaring above the sun and moon, I ascend the Dao,\nYu Yi and Jie Lin unite in harmonious protection,\nThen you may see the Jade Clarity’s Vacuous Ancient,\nAnd reverse aging, replenish the brain’s blood.\n\nMouth holding divine fungus, embracing the Five Stars,\nWaist girded with Tiger Tallies, wearing the Golden Clasp,\nHarness the clouds, receive life, feast in the Eastern Mists.\n\n### **Twenty-Seventh Chapter: The Mysterious Origin**\nThe Mysterious Origin’s Upper One refines soul and spirit,\nThe One as a thing is elusive, hard to suddenly perceive,\nOnly by attaining the Utmost True can skill be attained,\nMost taboo are dead qi and all foul impurities,\nThe Six Spirits gather and feast in emptiness.\n\nBind the pearl, secure essence, nourish the spirit’s root,\nJade laughter, golden key—ever whole and firm,\nClose the mouth, curl the tongue, consume the fetal fluid,\nThus I refine and attain flight and transcendence.\n\n### **Twenty-Eighth Chapter: Transmitting to Others**\nWeary of others, the Daoist is not divine,\nAccumulating essence, amassing qi—this is the True.\n\nThe Yellow Lad’s wondrous voice is rarely heard,\nJade script, crimson tablets, vermilion characters.\nInscribed: \"Perfected One, turban of gold,\nBearing armor, holding talismans, open the Seven Gates,\nFire soldiers, talismanic charts—prepare the Numinous Pass,\nFront lofty, rear low, high and low arrayed.\nWield a hundred-foot sword, dance the brocade banner,\nTen Absolute Trays swirl in the void,\nFire bells crown the clouds, trailing smoke,\nAbiding between the Yellow Gates of the brows,\nThis is no branch or leaf—it is the root itself.\"\n\n### **Twenty-Ninth Chapter: Purple Clarity**\nThe Purple Clarity’s August Sovereign of the Great Dao,\nGreat Mystery, Great Harmony—flanking attendants,\nTransforming and generating the ten thousand things, causing me to transmit,\nAscending through the Ten Heavens, riding jade.\n\nDay and night, seven days—think without sleep,\nIf you can cultivate this, you may attain longevity.\nAccumulating merit, completing refinement—it is not natural,\nIt arises from sincerity and also from guarding,\nInwardly guarding firmly—the True of the True,\nIn emptiness and tranquility, the spirit comes of itself.\n\n### **Thirtieth Chapter: The Hundred Grains**\nThe hundred grains’ essence is the earth’s quintessence,\nThe five flavors’ external beauty reeks of demonic filth,\nConfusing the spirit’s brightness, scattering the fetal qi,\nHow then can one reverse aging and return to infancy?\nThe Three Hun suddenly scatter, the Po crumble!\n\nWhy not consume the qi of Great Harmony’s essence?\nThus you may not die and enter the Yellow Tranquility.\n\n### **Thirty-First Chapter: The Heart Canon**\nThe Heart Canon—one body, the Five Viscera’s sovereign,\nIn movement and stillness, contemplate the Dao and virtue,\nPurity and good qi naturally radiate light,\nSitting and rising, I am with you in the hall,\nDay’s sun shines, dusk conceals—\nPenetrate the Flowery Essence, harmonize the Yin.\n\n### **Thirty-Second Chapter: Passing Through**\nPassing through the Six Directions, conceal at Mao and You,\nThe spirits of the two kidneys govern longevity,\nRevolve and descend, align with the Dipper, hide the First Nine,\nKnow the masculine, guard the feminine—you may be ageless,\nKnow the white, guard the black—see the seated guardian.\n\n### **Thirty-Third Chapter: Liver Qi**\nLiver qi surges, clear and long,\nArraying the Six Viscera, generating the Three Luminaries.\nHeart’s essence, intent focused—internally unwavering,\nAbove it joins the Three Burners, below the Jade Nectar.\nMysterious fluid flows like clouds, dispelling foul fragrance,\nGoverning and cleansing, teeth and hair refine the Five Directions.\nDraw the fluid from the Mysterious Gullet into the Bright Hall,\nBelow irrigate the throat—spirit’s brightness penetrates.\nSit beneath the Flowery Canopy, wander the Noble Capital,\nDrifting through the Three Clarities, resting on the clear frost,\nFive-colored cloud qi swirls in verdant profusion,\nClose the eyes, inwardly gaze—naturally behold,\nCause the various heart spirits to return and honor themselves,\nThe Sevenfold Mystic Flower opens the Gate of Life,\nUnblock the Heavenly Dao, preserve the Mysterious Root.\nEven at one hundred twenty years, return is still possible,\nBeyond this, guarding the Dao is truly difficult,\nOnly await the Nine Turnings’ Eight Jade Elixir,\nMust again refine thoughts, preserve the Seven Origins,\nThe sun and moon’s radiance rescues the old and decrepit,\nLiver qi circulates endlessly without cease.\n\n### **Thirty-Fourth Chapter: The Lungs**\nThe lungs’ qi arises from the Three Burners,\nVision and hearing in darkness await the youthful,\nRegulate the Five Flowers, refine teeth and hair,\nThirty-six swallows of the Jade Pool,\nOpening and dredging the hundred vessels—blood and fluid begin.\n\nComplexion radiates the light of gold and jade,\nTeeth firm, hair black—unaware of whiteness,\nPreserve this true spirit, do not let it fall,\nRecall the Purple Palace has a seat,\nThe host of spirits gather, turning and seeking one another.\n\n### **Thirty-Fifth Chapter: Concealing and Hiding**\nConceal and hide the feathered canopy, observe the Heavenly Abode,\nPay homage to the sun, joyfully call to one another,\nThe Eight Mighties of the Bright Spirit rightly repel evil,\nThe spleen spirit returns to its home in the stomach.\n\nIndulge and nourish the numinous root, never wither,\nSeal the Gate of Life, protect the Jade Capital,\nThe ten thousand spirits then flourish—lifespan overflows,\nThis is called the spleen established in the Central Palace.\n\nThe Five Viscera and Six Bowels—spirits’ sovereign,\nAbove it joins the Heavenly Gate, enters the Bright Hall,\nGuard the feminine, preserve the masculine, crown the Three Luminaries,\nExternally square, internally round—the spirit abides within.\nUnblock blood and vessels, the Five Viscera flourish,\nBones green, sinews red, marrow like frost,\nThe spleen rescues the seven orifices, dispelling misfortune,\nSun and moon arrayed, setting forth Yin and Yang.\n\nThe two spirits meet and transform into jade blossoms,\nTasteless yet the celestial beings’ sustenance.\nZidan presents hunger’s fare—pure yellow frost,\nCalled langgao and jade essence.\n\nThe Supreme conceals the Eightfold Jade Ring,\nIrrigating the eight fluids, the kidneys receive essence.\nHidden in Great Yin, my form appears,\nThe Three Mysteries’ wind stirs, emerging in Primordial Azure.\n\nIn the fleeting and indistinct, utmost purity and numinosity,\nPlaying upon the Terrace of Recitation, beholding Red Life.\nIn the carefree realm, nurturing the true and flourishing glory,\nInwardly gazing in silence, refining the Five Forms.\n\nThe Three Qi linger, attaining spirit clarity,\nConcealed dragons, hidden zhi, cloud-borne langying.\nThis can sate hunger and command the ten thousand spirits,\nAbove, the Profound Profundity; below, the Tiger’s Seal.\n\n**Chapter Thirty-Six: Ablutions**\n\nFor ablutions, be thoroughly pure, forsake rich perfumes,\nEnter the chamber facing east, recite the Jade Chapters.\nOnce ten thousand repetitions are complete, meaning shines forth,\nLet hair loose, desireless, to abide long.\n\nThe Five Flavors all arrive, the upright qi returns,\nCalm the heart, still the vexation—do not harbor resentment.\nWhen the count is fulfilled, body and spirit refined,\nThe Yellow Flower Jade Maiden reveals to you the truth.\n\nThe Perfected One having arrived, the Six Dings are dispatched,\nThen bestowed the *Hidden Zhi* and *Great Cavern Scripture*.\nTen recitations, four bows, pay homage to the Supreme,\nFirst to the Great Emperor, then turn northward—\nThe *Yellow Court Inner Scripture* and Jade Writ flow unimpeded.\n\nThe granter is called Master, the receiver takes the oath,\nWith cloud-brocade and phoenix silk, golden knots entwined,\nIn place of cutting hair, flesh and skin remain whole.\nHand in hand, ascend the mountain to face the liquid cinnabar,\nOnly then may the Golden Writ and Jade Effulgence be proclaimed.\n\nHaving received the transmission, report to the Three Officials,\nLest the seven ancestors suffer the misfortune of dark writs.\nThe Supreme’s subtle words induce spirit weariness—\nThis is the scripture of the deathless Dao.\n\nHere ends the *Supreme Yellow Court Inner Effulgences Jade Scripture*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上黄庭内景玉经 经名：太上黄庭内景玉经。 又名《上清黄庭内景玉经》、《黄庭内景经》、《黄庭经》。 晋·魏华毒撰。 一春。 底本出处：《正统道藏》洞玄部本文类。 参校版本：一、《砖藏转要》本，收入该书尾集第斗册（简称辑要本）。 二、清户董一穗宁·《太上一黄、庭经发微》本（简称董本》。 上清章第一 上清紫霞虚皇前，太上大道玉晨君，闲居药珠作七言，散化五形变万神，是为《黄庭》作内篇。 琴心三迭舞胎倦，九气映明出霄问，神盖童子生紫烟，是曰玉书可精研。 咏之万遍升三天，千灾以消百病痊，不惮虎狼之凶残，亦以却老年永延。 上有章第二 上有魂灵下关元，左为少阳右太，后有密户前生门，出日入月呼吸。 元黑所合列宿分，紫烟上下三素。 灌溉五华植灵根，七掖洞流冲庐，回紫抱黄入丹田，幽室内明照阳门。 口为章第三 口为玉池太和宫，漱咽灵液灾不干，体生光华气香兰，却灭百邪玉炼颜。 审能修之登广寒，昼夜不寐乃成真，雷呜电激神泯泯。 黄庭章第四 黄庭内人服锦衣，紫华飞裙云气罗，丹青绿条翠灵柯，七筵玉钥闭两扉，重掩金关密枢机。 玄泉幽阙高崔鬼，三田之中精气微，娇女窈窕翳霄晖，重堂焕焕扬八威，天庭地关列斧斤，灵台盘固永不衰。 中池章第五 中池内神服赤珠，丹锦云袍带虎，横津三寸灵所居，隐芝翳郁自相扶。 天中章第六 天中之岳精谨修，灵宅既清玉帝，通利道路无终休。 眉号华盖覆明，九幽日月洞虚元，宅中有真常衣，审能见之无疾息。 赤珠灵裙华情，舌下玄膺生死岸。 出青入玄二黑，子若遇之升天汉。 至道章第七 至道一不烦鴂存真，泥丸百节皆有神，发神苍华字太元，脑神精根字泥丸，眼神明上字英玄，鼻神玉垄字灵，耳神空闲字幽田，舌神通命字正，齿神愕锋字罗千。 一面之神宗泥，泥丸九真皆有房，方圆一寸处此，中，同服紫衣飞罗裳。 但思一部寿无穷，非各别住居脑中，列位次坐向外方，所存在心自相当。 心神章第八 心神丹元字守灵，肺神皓华字虚，肝神龙烟字含明，翳郁导烟主浊，肾神玄冥字育婴，脾神常在字魂，胆神龙曜字威明。 六腑五脏神体 ，皆在心内运天经，昼夜存之自长生。 肺部章第九 肺部之宫似华盖，下有童子坐玉阙，七元之子主调气，外应中岳鼻齐位。 素锦衣裳黄云带，喘息呼吸体不快，急存白元和六气，神倦久视无灾害，用之不已形不滞。 心部章第十 心部之宫莲含华，下有童子丹元家，主适寒热荣卫和，丹锦飞裳披玉罗，金铃朱带坐婆娑。 调血理命身不枯，外应口舌吐玉华，临绝呼之亦登苏，久久行之飞太霞。 肝部章第十一 肝部之宫翠重裹，下有青童神公，主诸关镜聪明始，青锦披裳佩玉，和制魂魄津液平，外应眼目日月。 百病所钟存无英，同用七日自充 ，垂绝念神死复生，摄魂还魄永无",
      "translated_text": "**The Supreme Yellow Court Inner Radiance Jade Scripture**\n\n**Scripture Title:** *The Supreme Yellow Court Inner Radiance Jade Scripture*. Also known as *The Highest Clarity Yellow Court Inner Radiance Jade Scripture*, *The Yellow Court Inner Radiance Scripture*, and *The Yellow Court Scripture*. Composed by Wei Huadu of the Jin dynasty.\n\n**Spring.**\n\n**Source Text:** *Daoist Canon of the Orthodox Unity* (Washing Mysteries Section, *Benwen* Category).\n**Collated Editions:**\n1. *Essentials from the Brick Canon*, appended to the final collection, *Dou* fascicle (hereafter *Essentials Edition*).\n2. *Elucidations on the Supreme Unity and Yellow Court Scriptures* by Dong Yisu of the Qing dynasty (hereafter *Dong Edition*).\n\n---\n\n### **First Chapter: Highest Clarity**\nBefore the Purple Radiance of the Highest Clarity, the Supreme Dao’s Jade Dawn Lord,\nLeisurely composes seven-word verses with elixir pearls,\nDispersing and transforming the five forms into ten thousand spirits—\nThus is the *Yellow Court* made into the Inner Chapters.\nThe zither-heart’s triple refrains dance the weary embryo,\nNine qi shine brightly, emerging from the celestial inquiry.\nThe divine canopy’s youth generates purple mist—\nThis is called the jade script, fit for refined study.\nChant it ten thousand times to ascend the Three Heavens,\nA thousand disasters dissolve, a hundred illnesses heal.\nFear not the ferocity of tigers and wolves,\nAnd thus reverse aging to extend the years forever.\n\n---\n\n### **Second Chapter: Above**\nAbove resides the hun-soul, below the Pass of Origin,\nLeft is Lesser Yang, right Greater Yin,\nBehind lies the Secret Gate, before the Gate of Life—\nExhaling the sun, inhaling the moon.\nThe Primordial Black unites with the constellations,\nPurple mist ascends and descends through the Three Pristine.\nIrrigate the five flowers, plant the numinous root,\nThe seven liquids flow through the central chamber,\nRevolving purple, embracing yellow, entering the cinnabar field.\nThe secluded chamber’s inner radiance illuminates the Yang Gate.\n\n---\n\n### **Third Chapter: The Mouth**\nThe mouth is the Jade Pool, the Palace of Supreme Harmony,\nRinsing and swallowing the numinous fluid, calamities do not dry.\nThe body generates radiant light, the qi like fragrant orchids,\nDispelling a hundred evils, refining the jade countenance.\nThose who diligently cultivate it ascend to Broad Cold,\nDay and night without sleep, thus attaining perfection.\nThunder roars, lightning flashes, the spirits stir.\n\n---\n\n### **Fourth Chapter: The Yellow Court**\nThe Yellow Court’s inner person wears brocade robes,\nPurple blossoms fly like skirts, cloud-gauze trailing.\nCinnabar and green, verdant branches, jade-like stalks,\nSeven-tiered jade locks seal the double doors,\nHeavily veiled by the Golden Gate, the secret mechanism.\nThe dark spring’s secluded gate towers high,\nWithin the Three Fields, essence and qi are subtle.\nThe delicate maiden, graceful, veiled in celestial radiance,\nThe layered halls gleam, displaying eight mights.\nHeaven’s Court and Earth’s Pass array axes,\nThe Numinous Terrace stands firm, never decaying.\n\n---\n\n### **Fifth Chapter: The Central Pool**\nThe Central Pool’s inner spirit wears crimson pearls,\nCinnabar brocade cloud-robes girded with tigers.\nThe three-inch crossing is where the numinous dwells,\nHidden mushrooms flourish, self-supporting.\nThe numinous radiance obscures, luxuriant and mutual.\n\n---\n\n### **Sixth Chapter: Heaven’s Center**\nHeaven’s Central Peak refines essence with care,\nThe numinous abode cleansed, the Jade Emperor resides.\nThe roads of communication remain unceasingly open.\nThe brows are named Floral Canopy, covering the bright,\nThe Nine Darks, sun and moon, penetrate the Primordial Void.\nWithin the abode dwells the Perfected, ever-clothed—\nThose who discern this know no illness or fatigue.\nCrimson pearls, numinous skirts, floral emotions,\nBeneath the tongue, the Dark Gullet spans life and death.\nEmerging from azure, entering the mysterious, the two blacks—\nIf you encounter this, you ascend to the Celestial Han.\n\n---\n\n### **Seventh Chapter: The Ultimate Dao**\nThe Ultimate Dao is not troubled by remembering the true,\nThe Mud Pill’s hundred nodes all harbor spirits.\nThe hair spirit, Azure Flower, named Supreme Origin,\nThe brain spirit, Essence Root, named Mud Pill,\nThe eye spirit, Bright Above, named Heroic Mystery,\nThe nose spirit, Jade Mound, named Numinous,\nThe ear spirit, Empty Leisure, named Secluded Field,\nThe tongue spirit, Commanding Life, named Upright,\nThe tooth spirit, Startled Blade, named Net Thousand.\nThe spirits of the face all honor the Mud Pill,\nThe Mud Pill’s nine Perfected each have their chambers,\nA square inch in this place—\nWithin, they all wear purple robes, flying gauze skirts.\nSimply contemplate this unity to live without end,\nNot dwelling separately within the brain,\nTheir ranks seated facing outward,\nTheir abode in the heart naturally corresponds.\n\n---\n\n### **Eighth Chapter: The Heart Spirit**\nThe heart spirit, Cinnabar Origin, named Guardian of the Numinous,\nThe lung spirit, Luminous Flower, named Void,\nThe liver spirit, Dragon Mist, named Containing Brightness,\nThe luxuriant obscurity guides the mist, master of the turbid,\nThe kidney spirit, Dark Mystery, named Nurturing Infant,\nThe spleen spirit, Constant Presence, named Soul,\nThe gallbladder spirit, Dragon Radiance, named Majestic Brightness.\nThe spirits of the six bowels and five viscera,\nAll operate within the heart, circulating the celestial scripture.\nDay and night, preserve them to attain longevity.\n\n---\n\n### **Ninth Chapter: The Lung Section**\nThe Lung Section’s palace resembles a floral canopy,\nBelow sits a youth in the Jade Gate,\nThe Seven Origins’ child governs qi regulation,\nExternally corresponding to the Central Peak, the nose’s position.\nWhite brocade robes, yellow cloud sashes—\nIf breathing is labored, the body is unwell.\nHastily visualize White Origin, harmonizing the six qi,\nThe spirit weary, long gazing brings no harm,\nUse it unceasingly, the form does not stagnate.\n\n---\n\n### **Tenth Chapter: The Heart Section**\nThe Heart Section’s palace holds a lotus containing blossoms,\nBelow dwells the youth, Cinnabar Origin’s family,\nGoverning cold and heat, harmonizing construction and defense.\nCinnabar brocade flying skirts draped in jade gauze,\nGolden bells, vermilion sashes, seated in dance.\nRegulating blood, ordering life, the body does not wither.\nExternally corresponding to the mouth and tongue, spouting jade blossoms.\nAt the brink of death, call upon it to revive,\nPractice it long, and you will soar through the great radiance.\n\n---\n\n### **Eleventh Chapter: The Liver Section**\nThe Liver Section’s palace is wrapped in layered emerald,\nBelow resides the Azure Youth, the Divine Duke,\nGoverning all barriers, the beginning of clarity and brightness.\nAzure brocade draped, jade pendants worn,\nHarmonizing the hun and po, balancing fluids.\nExternally corresponding to the eyes, sun and moon.\nThe hundred illnesses converge—preserve the Flourishing,\nTogether use it for seven days to naturally fill.\nAt the verge of death, invoke the spirit to revive,\nGathering the hun, returning the po, forever without...",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1136,
      "start_sentence": 0,
      "end_sentence": 46,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.149126052856445,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上黄庭内景玉经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "肾部章第十二 肾部之宫玄关圆，中有童子冥上玄，主诸六腑九液源，外应两耳百液津，苍锦云衣舞龙幡。 上致明霞日月烟，百病千灾急当存，两部水王对生门，使人长生升九天。 脾部章第十三 脾部之宫属戊己，中有明童黄裳裹，消谷散气摄牙齿，是为太仓两明童，坐在金台城九重，方圆一寸命门中。 主调百谷五味香，辟却虚羸无病伤，外应尺宅气色芳，光华所生以表明，黄锦玉衣带虎章，注念三老子轻翔，长生高倦远死殃。 胆部章第十四 胆部之官六腑精，中有童子曜威明，雷电八振扬玉旌，龙旗横天掷火铃。 主诸气力摄虎兵，外应眼童鼻柱问，脑发相扶亦俱鲜，九色锦衣绿华裙，佩金带玉龙虎文，能存威明乘庆云，役使万神朝三元。 脾长章第十五 脾长一尺掩太仓，中部老君治明，厥字灵元名混康，治人百病消谷，黄衣紫带龙虎章，长精益命赖君。 三呼我名神自通，三老同坐各有，或精或胎别执方，桃核合延生华。 男女徊九有桃康，道父道母对相，师父师母丹玄乡，可用存思登虚，殊途一会归要终。 闭塞三关握固，含漱金醴吞玉英，遂至不饥三虫，心意常和致欣昌。 五岳之云气彭，保灌一玉庐以自偿，五形完坚无灾殃。 上睹章第十六 上睹三元如连珠，落落明景照九隅，五灵夜烛焕八区。 子存内皇与我游，身披凤衣衔虎符，一至不久升虚无。 方寸之中念深藏，不方不圆闭牖窗，三神还精老方壮，魂魄内守不争太上黄庭内景玉经命丧竞。 神生腹中衔玉铛，灵注幽阙那得，琳条万寻可荫仗，三魂自宁帝书命。 灵台章第十七 灵台郁蔼望黄野，三寸异室有上下，问关营卫高玄受，洞房紫极灵门户。 是昔太上告我者，左神公子发神语，右有白元并立处，明堂金匮玉房问，上清真人当吾前。 黄裳子丹气频烦，借问何在两眉端？ 内侠日月列宿陈，七曜九元冠生门。 三关章第十八 三关之中精气深，九微之内幽且阴，口为天关精神机，足为地关生命扉，手为人关把盛衰。 若得章第十九 若得三官存玄丹，太一流珠安昆仑，重中楼阁十二环，自高自下皆真。 玉堂绛宇尽玄宫，游玑玉衡色兰，瞻望童子坐盘桓，问谁家子在我？ 此人何去入泥丸，千千百百自相，一一十十似重山。 云仪玉华侠耳，赤帝黄老与我魂，三真扶骨共房，五斗焕明是七元，日月飞行六合，帝乡天中地户端，面部魂神皆相存。 呼吸章第二十 呼吸元气以求传，传公公子似在，朱乌吐缩白石源，结精育胞化生，留胎止精可长生。 三气右徊九道，正一含华乃充盈，遥望一心如罗 ，金室之下可不倾，延我白首反孩婴。 琼室章第二十一 琼室之中八素集，泥丸夫人当中立，长谷玄乡绕郊邑，六龙散飞难分别。 长生至慎房中急，何为死作令神忽之祸乡三灵殁。 但当吸气录子精，寸田尺宅可治生，若当央梅百渍，叶去树枯失青青，气亡液漏非已形。 专闭御景乃长宁，保我泥丸三奇，恬淡闲视内自明，物物不干泰而，殷矣匪事老复丁，思咏玉书入上清。 常念章第二十二 常念三房相通达，洞视得见无内外，存漱五芽不饥渴，神华执巾六丁竭。 急守精室勿妄泄，闭而宝之可长。 起自形中初不阔，三官近在易隐。 虚无寂寂空中素，使形如是不当。 九室正虚神明舍，存思百念视节，六腑修治勿令故，行自翱翔入云",
      "translated_text": "### **Twelfth Chapter: The Kidney Section**\nThe Kidney Section’s palace is the Mysterious Pass, round and deep,\nWithin resides the Youth of Obscure Primordiality, sovereign of the Dark Mystery,\nGoverning the six viscera, source of the nine fluids.\nExternally corresponding to the two ears, the hundred-fluid springs,\nAzure brocade cloud-robes swirling with dragon banners.\nAbove, it summons luminous mist, sun and moon’s haze,\nThe hundred illnesses and thousand calamities—hasten to preserve it.\nThe two Water Lords face the Gate of Life,\nEnabling one to attain long life and ascend the Nine Heavens.\n\n### **Thirteenth Chapter: The Spleen Section**\nThe Spleen Section’s palace belongs to wu and ji,\nWithin dwells the Luminous Youth, wrapped in yellow robes,\nDissolving grains, dispersing qi, governing teeth,\nThis is the Great Granary, the two Bright Youths,\nSeated in the nine-tiered Golden Terrace Citadel,\nSquare and round, a cun within the Gate of Life.\nIt harmonizes the hundred grains, the five fragrant flavors,\nRepelling emaciation and illness, averting harm.\nExternally corresponding to the dwelling of the cubit, radiant complexion,\nIts brilliance arises to manifest.\nYellow brocade, jade robes, tiger-patterned sash,\nFocus the mind on the Three Elders, and you will lightly soar,\nAttaining long life, rising high, far from death’s misfortune.\n\n### **Fourteenth Chapter: The Gallbladder Section**\nThe Gallbladder Section’s palace is the essence of the six viscera,\nWithin resides the Youth, radiant with majestic brightness,\nThunder and lightning resound eightfold, brandishing jade banners,\nDragon standards cross the sky, casting fire bells.\nGoverning all strength and qi, commanding tiger soldiers,\nExternally corresponding to the pupils of the eyes, the bridge of the nose,\nBrain and hair mutually supporting, both resplendent.\nNine-colored brocade robes, green floral skirts,\nAdorned with gold belts, jade, dragon-and-tiger patterns.\nIf you can preserve its majestic brightness, you will ride the auspicious clouds,\nCommanding the myriad spirits to pay homage at the Three Origins.\n\n### **Fifteenth Chapter: The Spleen’s Length**\nThe Spleen stretches a foot, covering the Great Granary,\nWithin its central region, the Venerable Lord governs brightness,\nIts name is Lingyuan, called Hunkang,\nCuring the hundred illnesses, digesting grains.\nYellow robes, purple sashes, dragon-and-tiger emblems,\nProlonging essence, enhancing life—reliant on this Lord.\nCall my name thrice, and the spirit will naturally commune,\nThe Three Elders sit together, each with their own methods,\nWhether essence or embryo, they hold distinct prescriptions,\nPeach kernels unite to extend life’s blossoms.\nMale and female traverse the ninefold path to Peach Prosperity,\nDao-Father and Dao-Mother face each other,\nMaster-Father and Master-Mother dwell in the Cinnabar Mystery,\nYou may employ visualization to ascend the void,\nDivergent paths converge in one essential end.\nSeal the Three Passes, grasp firmness,\nRinse with golden nectar, swallow jade blossoms,\nThus attaining non-hunger, the Three Worms perish,\nHeart and intent ever harmonious, bringing joyous prosperity.\nThe clouds and qi of the Five Peaks billow,\nPreserve and bathe in a single jade hut to recompense yourself,\nThe five forms complete and sturdy, free from calamity.\n\n### **Sixteenth Chapter: Gazing Above**\nGazing above, the Three Origins like linked pearls,\nLuminous and resplendent, illuminating the nine corners,\nThe Five Spirits nightly kindle, illuminating the eight regions.\nIf you preserve the Inner Sovereign and wander with me,\nClad in phoenix robes, bearing tiger talismans,\nYou will swiftly ascend to the formless void.\nWithin the square inch, profound thoughts are concealed,\nNeither square nor round, sealing windows and doors,\nThe Three Spirits return essence, and the old become robust,\nHun and po guard within, not contending with the Supreme.\nThe Yellow Court’s inner vision—life and death’s contest ceases.\nSpirits born within the abdomen, bearing jade bells,\nDivine influx fills the obscure gates—how could it be lost?\nJade branches stretch ten thousand spans, offering shelter,\nThe Three Hun naturally tranquil, the Emperor’s decree commands.\n\n### **Seventeenth Chapter: The Spirit Terrace**\nThe Spirit Terrace, lush and misty, overlooks the Yellow Wilds,\nThree inches, distinct chambers above and below,\nThe Pass of Inquiry governs the camp and guard, receiving the Lofty Mystery,\nThe Cavern Chamber, Purple Ultimate, Spirit Gate.\nThus did the Supreme once instruct me:\nOn the left, the Divine Duke speaks the spirit’s words,\nOn the right, White Prime stands in attendance,\nThe Hall of Light, Golden Cabinet, Jade Chamber—inquire within,\nThe Perfected of Supreme Clarity stand before me.\nThe Yellow-Robed Youth’s cinnabar qi frequently stirs,\nI ask: where do the two brows reside?\nWithin, they flank the sun and moon, arraying the constellations,\nThe Seven Luminaries, Nine Origins crown the Gate of Life.\n\n### **Eighteenth Chapter: The Three Passes**\nWithin the Three Passes, essence and qi run deep,\nIn the Nine Subtleties, obscure and dark.\nThe mouth is Heaven’s Pass, the spirit’s mechanism,\nThe feet are Earth’s Pass, the gate of life,\nThe hands are Human’s Pass, grasping prosperity and decline.\n\n### **Nineteenth Chapter: If Attained**\nIf you attain the Three Officials and preserve the Mysterious Elixir,\nThe Great One’s flowing pearl rests in Kunlun,\nLayered towers and pavilions, twelvefold rings,\nNaturally high and low, all are real.\nJade Hall, crimson chambers, all are Mysterious Palaces,\nThe Jade Armillary, Jade Balance, orchid-hued,\nGazing upon the Youths seated in leisure,\nI ask: whose children are these within me?\nWhere have they gone? Entering the Muddy Pellet,\nThousands upon thousands, hundreds upon hundreds, each distinct,\nTen upon ten, like layered mountains.\nCloud standards, jade blossoms flank the ears,\nThe Red Emperor, Yellow Elder, and my hun,\nThe Three Perfected support the bones, sharing the chamber,\nThe Five Dippers radiant, the Seven Origins,\nSun and moon flying through the Six Harmonies,\nThe Emperor’s homeland, the center of heaven, the earth’s gate,\nThe facial spirits and hun all preserved.\n\n### **Twentieth Chapter: Breathing**\nInhaling and exhaling primordial qi to seek transmission,\nThe Transmitted Duke’s son seems present,\nCrimson birds contract, white stone’s source,\nCongealing essence, nurturing the embryo, transforming life,\nRetaining the embryo, halting essence—this is long life.\nThe Three Qi revolve to the right, the Nine Paths,\nThe Orthodox One contains blossoms, thus filling.\nGazing afar, the heart like a net,\nBeneath the golden chamber, can it not be overturned?\nExtending my white-haired years, returning to infancy.\n\n### **Twenty-First Chapter: The Jade Chamber**\nWithin the Jade Chamber, the Eight Simplicities gather,\nThe Muddy Pellet Lady stands at the center,\nThe Long Valley, Mysterious Homeland encircles the outskirts,\nSix dragons scatter and fly, difficult to distinguish.\nLong life demands utmost caution in the chamber’s urgency,\nWhy court death, inviting the calamity of the spirits’ neglect?\nOnly inhale qi, absorb the essence of the child,\nThe inch-field, foot-dwelling can govern life.\nIf you indulge in regret, a hundred stains,\nLeaves fall, the tree withers, losing its verdancy,\nQi lost, fluids leak—this is no longer your form.\nFocus on sealing, mastering the vision, thus attaining long tranquility,\nPreserve my Muddy Pellet’s Three Wonders,\nSerene and idle, gazing inward, naturally clear,\nThings do not disturb, at peace,\nAbundant indeed—no affairs, the old become youthful again,\nRecite the Jade Scripture, enter Supreme Clarity.\n\n### **Twenty-Second Chapter: Constant Remembrance**\nConstantly remember the Three Chambers, interconnected,\nThrough penetrating vision, see without inside or outside,\nPreserve and rinse the Five Sprouts, free from hunger and thirst,\nDivine blossoms hold the towel, the Six Dings exhaust themselves.\nSwiftly guard the Essence Chamber, do not recklessly leak,\nSeal and treasure it—this is longevity.\nArising from within the form, initially not distant,\nThe Three Officials are near, easily concealed.\nVoid and stillness, emptiness’s simplicity,\nMake the form thus—it should not be.\nThe Nine Chambers, perfectly empty, house the spirit’s brightness,\nPreserve thoughts, regulate the hundred contemplations,\nCultivate the six viscera, let them not decay,\nThen you will soar and enter the clouds.",
      "overlap_context": "e is wrapped in layered emerald,\nBelow resides the Azure Youth, the Divine Duke,\nGoverning all barriers, the beginning of clarity and brightness.\nAzure brocade draped, jade pendants worn,\nHarmonizing the hun and po, balancing fluids.\nExternally corresponding to the eyes, sun and moon.\nThe hundred illnesses converge—preserve the Flourishing,\nTogether use it for seven days to naturally fill.\nAt the verge of death, invoke the spirit to revive,\nGathering the hun, returning the po, forever without...",
      "start_char": 1136,
      "end_char": 2427,
      "start_sentence": 47,
      "end_sentence": 93,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 44.2826623916626,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上黄庭内景玉经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "治生章第二十三 治生之道了不烦，但修洞玄与玉篇，兼行形中八景神，二十四真出自然，高拱无为魂魄安，清静神见与我言，安在紫房帏幕间，立坐室外三五玄。 烧香接手玉华前，共入太室纵玑门，高研恬淡道之园，内视密盼尽见真，真人在己莫问邻，何处远索求因缘。 隐景章第二十四 隐景藏形与世殊，含气养精口如朱，带执性命守虚无，名入上清死录除，三神之乐由隐居。 倏钦游遨无遗忧，珊服一整八风驱，控驾三素乘晨霞，金辈正位从玉舆，何不登山诵我书。 郁郁窈窈真人墟，入山何难故踌躇，人问纷纷臭如帑。 五行章第二十五 五行相推反归一，三五合气九九节，可用隐地回八卫，伏牛幽阙罗品列。 三明出於生死际，洞房灵象斗日失室月，父日泥丸母雌一，三光焕照入子。 能存玄真万事毕，一身精神不可失。 高奔章第二十六 高奔日月吾上道，郁仪结璘善相保，乃见玉清虚无老，可以回颜填血脑。 口衔灵芝拥五星，腰带虎录佩金当，驾钦接生宴束蒙。 玄元章第二十七 玄元上一魂魄炼，一之为物叵卒见，须得至真始顾巧，至忌死气诸秽贱，六神合集虚中宴。 结珠固精养神根，玉笑金钥常完坚，闭口屈舌食胎津，使我遂炼获飞倦。 传人章第二十八 倦人道士非有神，积精累气以为真。 黄童妙音难可闻，玉书绛简赤丹文。 字曰真人巾金巾，负甲持符开七门，火兵符图备灵关，前昂后卑高下陈。 执剑百丈舞锦蟠，十绝盘空扇纷纭，火铃冠霄坠落烟，安在黄阙两眉问，此非枝叶实是根。 紫清章第二十九 紫清上皇大道君，太玄太和侠侍，化生万物使我传，飞升十天驾玉。 昼夜七日思勿眠，子能修之可长。 积功成炼非自然，是由精诚亦守，内守坚固真之真，虚中恬淡自致神。 百谷章第三十 百谷之实土地精，五味外美邪魔腥，臭乱神明胎气零，那从反老得还婴？ 三魂忽忽魄糜倾！ 何不食气太和精，故能不死入黄宁。 心典章第三十 心典一体五脏王，动静念之道德，清洁善气自明光，坐起吾俱共栋，昼日曜景暮闭藏，通达华精调阴。 经历章第三十二 经历六合隐卯酉，两肾之神主延寿，转降适斗藏初九，知雄守雌可无老，知白守黑见坐守。 肝气章第三十三 肝气郁勃清且长，罗列六腑生三光。 心精意专内不倾，上合三焦下玉浆。 玄液云行去臭香，治荡发齿炼五方。 取津玄膺入明堂，下溉喉咙神明通。 坐侍华盖游贵京，飘飘三清席清冻，五色云气纷青葱，闭目内陌自相望，使诸心神还自崇，七玄英华开命门，通利天道存玄根。 百二十年犹可还，过此守道诚甚难，唯待九转八琼丹，要复精思存七元，日月之华救老残，肝气周流终无端。 肺之章第三十四 肺之为气三焦起，视听幽冥候童，调理五华精发齿，三十六咽玉池，开通百脉血液始。 颜色生光金玉，齿坚发黑不知白，存此真神勿落 ，当忆紫宫有座席，众神合会转相索。 隐藏章第三十五 隐藏羽盖看天舍，朝拜太阳乐相呼，明神八威正辟邪，脾神还归是胃家。 耽养灵根不复枯，闭塞命门保玉都，万神方砟寿有余，是谓脾建在中宫。 五脏六腑神明主，上合天门入明堂，守雌存雄顶三光，外方内圆神在中。 通利血脉五脏丰，骨青筋赤髓如霜，脾救七窍去不祥，日月列布设阴阳。",
      "translated_text": "### **Twenty-Third Chapter: Cultivating Life**\nThe Dao of cultivating life is not cumbersome,\nSimply refine the *Dongxuan* and *Jade Canon*,\nAnd practice the Eight Radiant Spirits within the form,\nThe Twenty-Four Perfected emerge naturally.\nSit in lofty repose, non-action—soul and spirit at peace,\nIn clarity and stillness, the spirit appears and speaks with me,\nAbiding in the Purple Chamber amid curtains,\nStanding or sitting outside the room, the Three and Five Mysteries.\n\nBurn incense, join hands before the Jade Flower,\nTogether enter the Great Chamber through the Gate of the Turning Sphere,\nProfoundly study the garden of the Dao in tranquility,\nInward vision, subtle gaze—all truths are seen.\nThe Perfected reside within; do not seek neighbors,\nWhy search afar for causes and conditions?\n\n### **Twenty-Fourth Chapter: Concealing Radiance**\nConceal radiance, hide the form, set apart from the world,\nContain qi, nourish essence—lips like cinnabar,\nGrasp life’s nature, guard emptiness,\nYour name enters the Upper Clarity, death’s register erased,\nThe joy of the Three Spirits arises from reclusion.\n\nSwiftly roam and wander without lingering cares,\nAdorned in garments, the Eight Winds drive,\nHarness the Three Primes, ride the morning clouds,\nGolden ranks align, following the Jade Chariot,\nWhy not ascend the mountain and recite my scripture?\nLush and secluded, the Perfected’s abode,\nEntering the mountain—what difficulty? Yet you hesitate,\nWhile the world’s clamor reeks like a refuse heap.\n\n### **Twenty-Fifth Chapter: The Five Phases**\nThe Five Phases revolve, returning to the One,\nThree and Five merge qi, the nine-nines’ nodes,\nUse them to conceal the earth, reverse the Eight Guards,\nThe Hidden Ox, Dark Gate—arrayed in ranks.\n\nThe Three Clarities emerge from the boundary of life and death,\nThe Grotto Chamber’s numinous image—sun and moon lose their chambers,\nThe Father is the Mud-Pill Palace, the Mother the Feminine One,\nThe Three Luminaries shine brilliantly into the child.\n\nAbide in the Mysterious True—all affairs are complete,\nThe spirit of the body must not be lost.\n\n### **Twenty-Sixth Chapter: Soaring Aloft**\nSoaring above the sun and moon, I ascend the Dao,\nYu Yi and Jie Lin unite in harmonious protection,\nThen you may see the Jade Clarity’s Vacuous Ancient,\nAnd reverse aging, replenish the brain’s blood.\n\nMouth holding divine fungus, embracing the Five Stars,\nWaist girded with Tiger Tallies, wearing the Golden Clasp,\nHarness the clouds, receive life, feast in the Eastern Mists.\n\n### **Twenty-Seventh Chapter: The Mysterious Origin**\nThe Mysterious Origin’s Upper One refines soul and spirit,\nThe One as a thing is elusive, hard to suddenly perceive,\nOnly by attaining the Utmost True can skill be attained,\nMost taboo are dead qi and all foul impurities,\nThe Six Spirits gather and feast in emptiness.\n\nBind the pearl, secure essence, nourish the spirit’s root,\nJade laughter, golden key—ever whole and firm,\nClose the mouth, curl the tongue, consume the fetal fluid,\nThus I refine and attain flight and transcendence.\n\n### **Twenty-Eighth Chapter: Transmitting to Others**\nWeary of others, the Daoist is not divine,\nAccumulating essence, amassing qi—this is the True.\n\nThe Yellow Lad’s wondrous voice is rarely heard,\nJade script, crimson tablets, vermilion characters.\nInscribed: \"Perfected One, turban of gold,\nBearing armor, holding talismans, open the Seven Gates,\nFire soldiers, talismanic charts—prepare the Numinous Pass,\nFront lofty, rear low, high and low arrayed.\nWield a hundred-foot sword, dance the brocade banner,\nTen Absolute Trays swirl in the void,\nFire bells crown the clouds, trailing smoke,\nAbiding between the Yellow Gates of the brows,\nThis is no branch or leaf—it is the root itself.\"\n\n### **Twenty-Ninth Chapter: Purple Clarity**\nThe Purple Clarity’s August Sovereign of the Great Dao,\nGreat Mystery, Great Harmony—flanking attendants,\nTransforming and generating the ten thousand things, causing me to transmit,\nAscending through the Ten Heavens, riding jade.\n\nDay and night, seven days—think without sleep,\nIf you can cultivate this, you may attain longevity.\nAccumulating merit, completing refinement—it is not natural,\nIt arises from sincerity and also from guarding,\nInwardly guarding firmly—the True of the True,\nIn emptiness and tranquility, the spirit comes of itself.\n\n### **Thirtieth Chapter: The Hundred Grains**\nThe hundred grains’ essence is the earth’s quintessence,\nThe five flavors’ external beauty reeks of demonic filth,\nConfusing the spirit’s brightness, scattering the fetal qi,\nHow then can one reverse aging and return to infancy?\nThe Three Hun suddenly scatter, the Po crumble!\n\nWhy not consume the qi of Great Harmony’s essence?\nThus you may not die and enter the Yellow Tranquility.\n\n### **Thirty-First Chapter: The Heart Canon**\nThe Heart Canon—one body, the Five Viscera’s sovereign,\nIn movement and stillness, contemplate the Dao and virtue,\nPurity and good qi naturally radiate light,\nSitting and rising, I am with you in the hall,\nDay’s sun shines, dusk conceals—\nPenetrate the Flowery Essence, harmonize the Yin.\n\n### **Thirty-Second Chapter: Passing Through**\nPassing through the Six Directions, conceal at Mao and You,\nThe spirits of the two kidneys govern longevity,\nRevolve and descend, align with the Dipper, hide the First Nine,\nKnow the masculine, guard the feminine—you may be ageless,\nKnow the white, guard the black—see the seated guardian.\n\n### **Thirty-Third Chapter: Liver Qi**\nLiver qi surges, clear and long,\nArraying the Six Viscera, generating the Three Luminaries.\nHeart’s essence, intent focused—internally unwavering,\nAbove it joins the Three Burners, below the Jade Nectar.\nMysterious fluid flows like clouds, dispelling foul fragrance,\nGoverning and cleansing, teeth and hair refine the Five Directions.\nDraw the fluid from the Mysterious Gullet into the Bright Hall,\nBelow irrigate the throat—spirit’s brightness penetrates.\nSit beneath the Flowery Canopy, wander the Noble Capital,\nDrifting through the Three Clarities, resting on the clear frost,\nFive-colored cloud qi swirls in verdant profusion,\nClose the eyes, inwardly gaze—naturally behold,\nCause the various heart spirits to return and honor themselves,\nThe Sevenfold Mystic Flower opens the Gate of Life,\nUnblock the Heavenly Dao, preserve the Mysterious Root.\nEven at one hundred twenty years, return is still possible,\nBeyond this, guarding the Dao is truly difficult,\nOnly await the Nine Turnings’ Eight Jade Elixir,\nMust again refine thoughts, preserve the Seven Origins,\nThe sun and moon’s radiance rescues the old and decrepit,\nLiver qi circulates endlessly without cease.\n\n### **Thirty-Fourth Chapter: The Lungs**\nThe lungs’ qi arises from the Three Burners,\nVision and hearing in darkness await the youthful,\nRegulate the Five Flowers, refine teeth and hair,\nThirty-six swallows of the Jade Pool,\nOpening and dredging the hundred vessels—blood and fluid begin.\n\nComplexion radiates the light of gold and jade,\nTeeth firm, hair black—unaware of whiteness,\nPreserve this true spirit, do not let it fall,\nRecall the Purple Palace has a seat,\nThe host of spirits gather, turning and seeking one another.\n\n### **Thirty-Fifth Chapter: Concealing and Hiding**\nConceal and hide the feathered canopy, observe the Heavenly Abode,\nPay homage to the sun, joyfully call to one another,\nThe Eight Mighties of the Bright Spirit rightly repel evil,\nThe spleen spirit returns to its home in the stomach.\n\nIndulge and nourish the numinous root, never wither,\nSeal the Gate of Life, protect the Jade Capital,\nThe ten thousand spirits then flourish—lifespan overflows,\nThis is called the spleen established in the Central Palace.\n\nThe Five Viscera and Six Bowels—spirits’ sovereign,\nAbove it joins the Heavenly Gate, enters the Bright Hall,\nGuard the feminine, preserve the masculine, crown the Three Luminaries,\nExternally square, internally round—the spirit abides within.\nUnblock blood and vessels, the Five Viscera flourish,\nBones green, sinews red, marrow like frost,\nThe spleen rescues the seven orifices, dispelling misfortune,\nSun and moon arrayed, setting forth Yin and Yang.",
      "overlap_context": "mselves.\nSwiftly guard the Essence Chamber, do not recklessly leak,\nSeal and treasure it—this is longevity.\nArising from within the form, initially not distant,\nThe Three Officials are near, easily concealed.\nVoid and stillness, emptiness’s simplicity,\nMake the form thus—it should not be.\nThe Nine Chambers, perfectly empty, house the spirit’s brightness,\nPreserve thoughts, regulate the hundred contemplations,\nCultivate the six viscera, let them not decay,\nThen you will soar and enter the clouds.",
      "start_char": 2427,
      "end_char": 3714,
      "start_sentence": 94,
      "end_sentence": 143,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 45.467686891555786,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上黄庭内景玉经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "两神相会化玉英，淡然无味天人粮，子丹进饥肴正黄霜，乃曰琅膏及玉。 太上隐环八素琼，溉益八液肾受精，伏於太阴见我形，扬风三玄出始青。 恍惚之间至清灵，戏於讽台见赤生，逸域熙真养华荣，内盼沉默炼五形。 三气徘徊得神明，隐龙遁芝云琅英，可以充饥使万灵，上盖玄玄下虎章。 沐浴章第三＋六 沐浴盛洁弃肥熏，入室束向诵玉篇，约得万遍义自鲜，散发无欲以长存。 五味皆至正气还，夷心寂闷勿烦冤。 过数已毕体神精，黄华玉女告子情，真人既至使六丁，即授隐芝大洞经。 十读四拜朝太上，先谒太帝后北向，黄庭内经玉书畅。 授者日师受者盟，云锦凤罗金钮缠，以代割发肌肤全，携手登山敌液丹，金书玉景乃可宣。 传得审授告三官，勿令七祖受冥文患，太上微言致神倦，不死之道此其文。 太上黄庭内景玉经竟",
      "translated_text": "The two spirits meet and transform into jade blossoms,\nTasteless yet the celestial beings’ sustenance.\nZidan presents hunger’s fare—pure yellow frost,\nCalled langgao and jade essence.\n\nThe Supreme conceals the Eightfold Jade Ring,\nIrrigating the eight fluids, the kidneys receive essence.\nHidden in Great Yin, my form appears,\nThe Three Mysteries’ wind stirs, emerging in Primordial Azure.\n\nIn the fleeting and indistinct, utmost purity and numinosity,\nPlaying upon the Terrace of Recitation, beholding Red Life.\nIn the carefree realm, nurturing the true and flourishing glory,\nInwardly gazing in silence, refining the Five Forms.\n\nThe Three Qi linger, attaining spirit clarity,\nConcealed dragons, hidden zhi, cloud-borne langying.\nThis can sate hunger and command the ten thousand spirits,\nAbove, the Profound Profundity; below, the Tiger’s Seal.\n\n**Chapter Thirty-Six: Ablutions**\n\nFor ablutions, be thoroughly pure, forsake rich perfumes,\nEnter the chamber facing east, recite the Jade Chapters.\nOnce ten thousand repetitions are complete, meaning shines forth,\nLet hair loose, desireless, to abide long.\n\nThe Five Flavors all arrive, the upright qi returns,\nCalm the heart, still the vexation—do not harbor resentment.\nWhen the count is fulfilled, body and spirit refined,\nThe Yellow Flower Jade Maiden reveals to you the truth.\n\nThe Perfected One having arrived, the Six Dings are dispatched,\nThen bestowed the *Hidden Zhi* and *Great Cavern Scripture*.\nTen recitations, four bows, pay homage to the Supreme,\nFirst to the Great Emperor, then turn northward—\nThe *Yellow Court Inner Scripture* and Jade Writ flow unimpeded.\n\nThe granter is called Master, the receiver takes the oath,\nWith cloud-brocade and phoenix silk, golden knots entwined,\nIn place of cutting hair, flesh and skin remain whole.\nHand in hand, ascend the mountain to face the liquid cinnabar,\nOnly then may the Golden Writ and Jade Effulgence be proclaimed.\n\nHaving received the transmission, report to the Three Officials,\nLest the seven ancestors suffer the misfortune of dark writs.\nThe Supreme’s subtle words induce spirit weariness—\nThis is the scripture of the deathless Dao.\n\nHere ends the *Supreme Yellow Court Inner Effulgences Jade Scripture*.",
      "overlap_context": "the spleen established in the Central Palace.\n\nThe Five Viscera and Six Bowels—spirits’ sovereign,\nAbove it joins the Heavenly Gate, enters the Bright Hall,\nGuard the feminine, preserve the masculine, crown the Three Luminaries,\nExternally square, internally round—the spirit abides within.\nUnblock blood and vessels, the Five Viscera flourish,\nBones green, sinews red, marrow like frost,\nThe spleen rescues the seven orifices, dispelling misfortune,\nSun and moon arrayed, setting forth Yin and Yang.",
      "start_char": 3714,
      "end_char": 4045,
      "start_sentence": 144,
      "end_sentence": 155,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.865850687026978,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上黄庭内景玉经.txt",
        "category": "本文类"
      }
    }
  ]
}