{
  "source_id": "太上消灾祈福醮仪",
  "source_file": "chunked_daozang\\太上消灾祈福醮仪.json",
  "total_chunks": 5,
  "total_original_chars": 3712,
  "total_translated_chars": 25361,
  "total_translation_time": 131.4908106327057,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\威仪类\\太上消灾祈福醮仪.txt",
    "category": "威仪类"
  },
  "full_translation": "**The Supreme Rite for Dispelling Disasters and Praying for Blessings**\n\n**Sutra Title:** *The Supreme Rite for Dispelling Disasters and Praying for Blessings*. One fascicle. Source text: *Daoist Canon of the Zhengtong Era*, *Dongshen* Section, *Weiyi* Category.\n\n---\n\n**The Supreme Rite for Dispelling Disasters and Praying for Blessings**\n\nFirst, submit the memorial and close the ritual space; the invocations follow the standard form.\n\nNext, intone the *Hall Hymn*.\n\nThen, each pays homage to the master, visualizing as prescribed.\n\nNext, recite the *Incantations of the Five Directions’ Guardian Spirits of the Luminous Numinosity*:\n\n**East:**\nNinefold *qi* of the Azure Heavens,\nGreat Spirit of the Bright Star,\nRadiant upon the eastern quarter,\nIllumining the Nine Gates.\nRevolving the candle of yang light,\nSweeping away defilement and miasma.\nThe Luminous Youth,\nGuards my chamber in readiness.\nSubduing demons and binding specters,\nHe reports above to the Imperial Lord.\nUpholding the true Dao,\nWith vermilion script on jade tablets.\nThe talismanic commands of the Nine Heavens,\nTransmitted by dragon couriers.\nAll under heaven is pacified and secured;\nI attain the flight of immortality.\n\n**South:**\nCinnabar Heavens of the South,\nThreefold *qi* flowing in light.\nThe Fire Star revolves its candle,\nIllumining the Great Sun.\nAbove dwells the Vermilion Essence,\nThe Luminous Numinous Youth.\nCommanding the hosts of fire,\nGuarding the Three Palaces in readiness.\nBeheading evil and binding specters,\nSevering and suppressing demonic malevolence.\nAs decreed by the Northern Emperor,\nThrough the eight thrusts of wind and fire.\nInterlocking bells blaze in splendor—\nDare any disobey?\nThe true Dao flows forth;\nI partake of the supreme merit.\nPreserving heaven’s enduring existence,\nFor kalpas without end.\n\n**West:**\nHeavens of the Sevenfold *qi*,\nGreat White streaming in essence.\nLight gleams at the Golden Gate,\nIllumining the Great Darkness.\nWithin abides the White Sovereign,\nNamed the Imperial Numinosity.\nProtecting the spirit and securing peace,\nGuarding my bodily form.\nSevering the roots of evil,\nThe true Dao shines forth.\nPalaces and halls are arrayed in solemnity,\nThe Three Luminaries fast in unison.\nThe Dao harmonizes with spontaneity;\nI ascend in flight to the Purple Court.\nThe talismanic commands of the Numinous Treasure\nBestow universal grace upon the ten thousand beings.\nMerit extends to all;\nHeaven and earth are at peace.\n\n**North:**\nMystic Heavens of the North,\nFivefold *qi* lingering in circuit.\nThe Chronogram Star blazes resplendent,\nLight gleaming in the Great Subtlety.\nThe Black Numinous Honored Spirit,\nClad in the raiment of flying immortals.\nGuarding the Five Gates in readiness,\nInspecting essences and seizing the false.\nDare any test their power—\nThe *huoluo* blades sever and shatter.\nAs proclaimed by the jade talismans,\nThe spirits manifest their eightfold might.\nThe gates of evil are sealed;\nThe true Dao shines forth in clarity.\nIllumining my body,\nThe Three Luminaries shine in unison.\nI spur the void and ride the floating,\nMy form ascending in immortal flight.\n\n**Center:**\nThe Yellow Center governs *qi*,\nOverseeing the Mysterious True.\nThe Star of Stability emits its radiance,\nFlowing and blazing through the Nine Heavens.\nThe Luminous Youths,\nTwelve in number.\nPrimal *qi* and yang essence,\nFlaming upward in crimson smoke.\nIllumining all under heaven,\nAnd the bodies of your servants.\nA hundred evils are shattered,\nTen thousand ghosts slain.\nThe divine incantation of the Central Mountain\nIs universally enacted by heaven’s agents.\nThe Five Numinosities secure peace;\nMy body ascends as an immortal.\n\nNext, the *doujiang* chants; the ritual drum is sounded twenty-four times.\n\nNext, the incense burner is kindled.\n\nThe Most High, True and Mysterious, Five Numinous Venerable Lord, summon the Attendant Officers, the Left and Right Dragon-Tiger Lords, the Incense-Bearing Attendants, and the Three *qi* True Spirits. Hasten to report to the Three Heavens’ True Primordial Lord of the Dao.\n\nYour servant now burns incense, conducts the fast, and establishes the ritual, reverently offering it for the ritual’s sponsor, disciple [Name], with the intent of the fast. All other sincere supplications are recorded in the *qingci*. May the life-*qi* of the Supreme Ten Directions’ True and Upright Ones descend and flow into the bodies of your servants, so that what your servant petitions may swiftly reach the presence of the Most High, Boundless, and Great Dao’s Three Clarities and Supreme Saints, before the Jade Emperor of the Vast Heavens.\n\nNext, the assembled officials each kneel and emerge from their stations.\n\nReverently, the Five Body True Officials and Attendant Officers within your servant’s body emerge to ascend the Three Heavens, executing the law and unfolding transformation. The Yin-Yang Attendant Officers, who deliver the Dao and dispel disasters, disperse misfortune and resolve calamities—twelve each—emerge. From the registers of the methods your servant has received, the Generals of the Central Establishment, the Front Division’s Merit-Reporting Generals, the Rear Division’s Merit-Executing Generals, the Courier Station and Relay Station Officers, the Four Division Inspectors, the Exhausted Merit Officers, the Upper Immortals, the Upper Numinosities, the Direct Attendant Officers of the Left and Right, the Yin-Yang Spirit-Decision Officers—two each—emerge.\n\nAs they emerge, they don their solemn attire, caps and pendants, and array their majestic presence. The Attendant Officers wear vermilion yang caps, celestial crowns, black silk unlined robes, and gird themselves with dragon-headed swords. The Petition-Bearing Attendants wear dark yin caps, Nine Virtues crowns, crimson ceremonial unlined robes, and gird themselves with tiger tallies, each holding jade tablets. The Direct Service Attendant Officers stand at the four directions. The Orthodox Unity Attendant Officers stand at the center. The Healing Attendant Officers safeguard your servant’s body. The Left Attendant Officers bear the standard at the front; the Right Attendant Officers hold the banners at the rear. The Yang Spirit-Decision Officers stand to the left; the Yin Spirit-Decision Officers stand to the right. The Upper Division Attendant Officers stand above; the Middle Division Attendant Officers stand within the body; the *Qi*-Hastening Attendant Officers urge the ten directions. The Upper Division Attendants gaze afar to the heavens above; the Middle Division Attendants survey the eight directions; the General Attendant Officers encircle your servant’s body.\n\nThe Tiger-Swift Officers of the Gentlemen-Attendants detect treachery; the Hook-Riding Officers patrol the ranks. The General Attendant Officers stand as archers; the Heavenly Ding Warriors enforce rectitude. The Rectifying Attendants gather the spirits; the Spirit-Feeding Attendants gather the ghosts; the Ghost-Feeding Attendants gather the *qi*; the *Qi*-Feeding Attendants gather the poisons; the Poison-Feeding Attendants gather the essences; the Essence-Feeding Attendants gather the perverse; the Perverse-Feeding Attendants execute the talismans. The Temple-Destroying Attendants command the fierce winds; the Relay Officers ride the post-horses; the Memorial-Presenting Attendants mount the flying dragons. All these mounted and stationed officers stand to your servant’s left and right, before and behind, receiving your servant’s words to report and relay to the local earth gods and altar deities, overseeing and summoning the *jiazi* officials, lords, generals, and attendants. With reverent sincerity, they jointly address the petition:\n\nTo the Supreme and Boundless Dao, the Most High Lord Lao, the Most High Venerable, the Nine Elders of the Immortal Metropolis, the Nine *Qi* Venerable, the myriad layers of Dao-*qi*, and the one thousand two hundred lords and officials beneath the Jade Steps of the Great Clarity—\nIn this moment of celestial and human resonance, we beseech your protection through the talismans. Ascending and descending in hidden depths, nothing but utmost sincerity can reach you.\n\nWithin the depths of pure devotion, we restrain ourselves and gaze upward, where the Primal Mirror’s gate stands open. How much more so the true canon of the sacred scriptures, which expands the numinous ordinances to reveal the teachings. The celestial vault’s great image, the divine radiance of the ethereal light—there are celestial stations from which to look down, and auspicious omens that externally bind.\n\nNow, the master of this rite, [Name], for the matter of [specific purpose], solemnly prepares the altar’s offerings, reverently awaiting the deities’ descent in spirit. We humbly extend our sincerity like floating duckweed, hoping for the slightest response to our vigilant gaze. May the words of our petition reach and move you, not betraying the earnestness of our intent.\n\nWe implore the *gongcao* messengers, the divine generals, and the spirit officials to swiftly ascend and present our plea, that the response may descend in timely accord. May what we pray for be fulfilled, and what we wish for be granted. Your servants and the master of this rite, with utmost reverence and awe, bow twice in prostration to make this known.\n\nNext, each declares their name and rank:\n\nYour humble servants, the ritual officiants [Names and titles], with unified sincerity, reverently address:\n\nThe Primordial Heavenly Worthy of Virtual Emptiness and Spontaneous Nature,\nThe Supreme Dao Lord of the Boundless Dao,\nThe Most High Lord Lao, August Emperor of Supreme Virtue and Primordial Unity,\nThe Most High Jade Emperor of the Vast Heaven, Who Holds the Talisman, Governs the Calendar, and Embodies the Dao,\nThe August Emperor of the Purple Tenuity,\nThe Great Emperor of the Northern Culmen of the Purple Tenuity,\nThe Great Emperor of the Southern Culmen Who Bestows Life,\nThe Heavenly Worthy Jade Emperor and Star Lord within the Dipper,\nThe Ten Spirit Lords of the Great Unity,\nThe Eleven Luminaries and Star Lords,\nThe Seven Primes of the Northern Dipper and Their Star Lords,\nThe Left and Right Assistant Star Lords,\nThe Six Controllers of the Southern Dipper and Their Star Lords,\nThe Three Officials of Heaven, Earth, and Water,\nThe Twenty-Eight Constellations and Their Star Lords,\nThe True Lords of the Nine Heavens Who Store Blessings and Determine Destiny,\nThe True Lords of the Nine Heavens Who Respond to the Primordial and Protect Fate,\nThe True Lords of the Nine Heavens Who Govern Life and Record Deeds,\nThe True Lords of the Nine Heavens Who Hold the Registers and Calculate Accounts,\nThe Great Gods of the Nine Heavens Who Oversee Birth and Prolong Life,\nThe Great Dharma Master of the Mysterious Center,\nThe Orthodox Unity Perfected,\nThe Three Heavens’ Assistant and Mysterious Great Dharma Masters,\nThe True Lord of Myriad Blessings of the Heavenly Court,\nThe True Lord Who Determines Names in the Jade Calendar of the Heavenly Court,\nThe True Lord Who Prolongs Life and Protects Destiny of the Heavenly Court,\nThe True Lord Who Supports the Weak and Delivers from Calamity of the Heavenly Court,\nThe True Lord Who Holds the Registers and Calculates Accounts of the Heavenly Court,\nThe True Lord of the Treasury of Wealth and the Registers of Emolument of the Heavenly Court,\nThe True Lords Who Govern Life and Record Deeds of the Heavenly Court,\nThe True Lords Who Oversee Wrongdoing and Peril of the Heavenly Court,\nThe True Officials Who Introduce Petitions at the Gate of the Heavenly Court,\nThe True Officers Who Present Petitions on the Appointed Day at the Gate of the Heavenly Court,\nThe Numinous Court of the Abyssal Water Palace and Blessed Land,\nThe True Lords of the Star and Dipper of One’s Present Life,\nThe True Official of One’s Original Destiny and Celestial Stem,\nThe True Officials of the City God, Village Earth God, and Local Earth Deities,\nThe officials and attendants of the Three Realms,\nand all majestic and numinous beings.\n\nWe have heard that the Jade Heaven is stern and distant, its threshold too vast for the dwellings of the kalpas; the Golden Grotto is remote and pure, its halls too lofty to gaze upon in vain.\n\nThe August Emperor reigns on high, grasping the threads of transformation at the center. He opens the ten directions without obstruction, his heart responding to things as they move; he is hailed as the Great Compassion of the Three Realms, regarding all people as his children, even the young and frail. Beholding the Terrace of Yuluo, he rolls and unfurls the kalpas as if casting away a mustard seed. Gazing back upon the myriad multitudes, he grieves for the ephemeral mayfly beneath the sun; looking down upon the nine dusts, he sighs for the Han Palace as if it were but an anthill. Ever mindful of the vulgar below, whose true path is long severed, he relies upon the statutes of deliverance, permitting the utmost sincerity of their pleas to be fully expressed.\n\nNow, the master of this offering, the disciple [Name], for [specific matter], solemnly presents the tokens of sincerity and secretly petitions the immortal court, hoping for the heavenly grace to descend and observe, that his heart’s devotion may be singularly conveyed. We humbly beseech the Three Clarities to align their paths, departing the resplendent chambers of Li Qu; the Ten Poles to stream forth their chariots, following the flying void of the Dharma procession. The hundred million Heavenly Emperors shall trail their reins in the cinnabar whirlwind; the twelve hundred Lords and Sovereigns shall welcome them with jade-green standards. Casting fire for ten thousand leagues, they summon yang from below and call forth yin; revolving the three wheels of incense, they ascend beyond the sun and enter the moon. To the farthest east, they float upon the blazing waters; to the utmost west, they reach the twilight of Yu and Yi. Southward they journey to the Crimson Mound Palace, at the center they coil within the Yellow Qi’s abode. The northern halls of darkness extend to the City of Night; the frigid springs of Qiuhan descend to the Spirit Valley below.\n\nAs for the Master of Lu, hailed as the Teaching Father, he follows the retinue of the Great Ultimate. In the west, the Buddha is revered, ever attending in secret from the Realm of Extended Truth. The Mandate of the Primordial Beginning—who would dare not revere it? Thus, we humbly present these modest words, lifting our gaze to the clouded heavens. Knocking upon the azure sky, we perform the rites and invoke the sacred names to summon the deities.\n\nWe humbly pray that you, in your boundless grace, deign to look upon the sentiments of mortals and graciously descend in your swift chariot. We, the master of this offering and his attendants, bow our heads and prostrate ourselves to beseech:\n\nNext, we invoke the sacred ranks, offer incense, present tea, and pour libations of wine.\nNext, we perform the initial offering rites.\nNext, we solemnly recite the Dharma names.\n\nWe, your humble servants [Names], with utmost sincerity, jointly address the Three Clarities, the Most High Saints, the numinous immortals of the altar, and the sovereigns of the Three Realms:\n\nWe have heard that the One True scatters its radiance, originally without distinction of high or low; the myriad beings take form, all nurtured by the pure and harmonious qi. Yet as life and death grow distant, likes and dislikes multiply in profusion. Though the defiled body may sink into deep delusion, the Great Dao still extends its saving grace. When the roots of transgression grow severe, unseen retribution is silently imposed; but if one awakens to a hundred wrongs, ten thousand calamities are instantly dissolved.\n\nNow, the master of this offering, the disciple [Name], finds his spirit ensnared in darkness, his ethereal soul trembling in alarm. Through the vast kalpas, he has sunk into mutual ruin, causing his primordial spirit to flee in agitation. He does not tread the path of awakening, delighting instead in scaling the heights of delusion; he does not rest in the true court, willingly rushing into the snares of the world. Reflecting upon his past, he has endured toil and hardship beyond measure. Now, in this present life, his fate hangs as precariously as the lightning of day; reconsidering his accumulated deeds, his merits fall short by half a hair’s weight.\n\nHe may have turned against the Dao and deceived Heaven, or defiled the sacred and offended his superiors. He may have carelessly neglected scriptures and rituals, or slighted his parents and teachers. He may have failed in filial piety and brotherly love while managing his household, or transgressed the bounds of public and private conduct in his affairs. He may have defiled the true sanctuaries or violated the dignity of the celestial spirits. He may have trespassed against the great prohibitions of the Three Luminaries or disrupted the solemn sacrifices of seven generations. He may have harmed living creatures, engaged in licentious worship of spirits, or drowned himself in wine and reckless speech. He may have been ensnared by sensual pleasures, amassed wealth through injustice, or wielded cunning in devious ways. He may have been stubborn and self-righteous, or gluttonous and insatiable. He may have upheld the Dao yet failed in meritorious conduct, or managed his household yet neglected the rites of instruction. He may have disregarded human ethics or oppressed the weak. Together, these transgressions have plunged him into the five desires, exceeding the sins of a thousand lifetimes.\n\nYet, mindful of the boundless compassion of the Most High Saints, who shelter all beings and open the path to deliverance, the master of this offering, [Name], approaches the Dao in repentance, praying for Heaven’s vast forbearance. We humbly implore the Jade Void Great Emperor of the Celestial Pole, the august True Ones, to bestow mercy upon the dry bones, to grant life to the walking corpse, to dissolve the hidden transgressions of this single body, and to erase the unseen torments of a hundred generations. May past sins melt away like ice before their time, and may the blessings of rectification swiftly arrive like clouds. Prostrate and trembling, we await your response, longing to present our words and offer our cinnabar caskets.\n\nThough we have carefully examined our plea, we still fear it may be flawed. Daring to transgress the heavenly prohibitions, we tremble as we make this declaration:\n\nNext, we proclaim the Blue Petition,\nas its words fully express our utmost sincerity.\nMay our reverent devotion be acknowledged,\nand the gifts of life and growth be repaid.\n\nThe master of this offering, the disciple [Name], prays that the merits of this fast be recorded in the registers, that the fruits of the Dao sustain his being, that his lifespan and blessings be augmented in the days to come, and that his years be preserved henceforth. Reverently bearing the virtue of the true spirits, he seeks only the grace of their blessings.\n\nWe, the master of this offering and his attendants, overwhelmed with emotion, bow our heads and prostrate ourselves again.\n\nNext, we offer incense and pour libations of wine once more.\nNext, we perform the secondary offering rites.\n\nWe humbly renew our sincerity and address the Three Clarities, the Most High Saints, and the majestic spirits of the Ten Poles:\n\nWe have heard that the Jade Emperor observes all, and the Golden Perfected scrutinize everything. Moved by the pleas of all beings, they bestow their grace upon every creature. The lofty scholar aspires to immortality, and the ten thousand immortals gather like dew; the virtuous person accumulates blessings, and a hundred blessings adorn them with wondrous splendor. The principle values subtlety, and the response aligns with reverence.\n\nNow, the master of this offering, the disciple [Name], for [specific matter], raises his words in the clear night and directs his thoughts to the purple gates of Heaven. From the earliest dawn, he has sought the orchid’s path, reverently awaiting the divine favor.\n\nWe humbly pray that the master of this offering, the disciple [Name], may cast off the snares of the world and ascend the ranks of immortality. May his entire household be permitted to enter the Grotto of Huayang; may the Liu and Gang families, with all their kin, rise together in the cinnabar and emerald chariots. May the reckonings of yin and yang be escaped, and the roots of life and death forever severed. If he seeks office and emolument, may he ascend to lofty heights; if he calculates wealth and stores, may his goods and assets flourish. May the blessings of high and low be shared, and all within and without rejoice in prosperity. May the unseen realms know no strife between humans and ghosts, and may all undertakings be met with felicity. May joy be equal among descendants, and protection extend to kin and stranger alike. May disasters of water, fire, weapons, and bandits never invade his home; may the adversities of sun, moon, stars, and constellations never afflict his body.\n\nMay he long encounter the flourishing of all things and forever escape the nine calamities.\n\nYour servant and the sponsor of this rite, unable to contain the depth of our prayers and supplications, now present the full ceremonial offering of paper money and horses, reverently facing the altar to humbly submit our petition.\n\nFirst, we present the paper money and horses, offer incense thrice, and pour the libation.\nNext, we conclude the final offering of the ritual proceedings.\n\nWith utmost sincerity, your servant now respectfully invokes:\nThe Three Clarities and Supreme Emperors,\nThe Ten Loftiest Perfected,\nThe officials of the Three Realms,\nAnd the divine spirits of this altar.\n\nWe have heard that to be irreverent is to forgo supplication—thus the sages left us texts of simplicity.\nHeaven itself does not oppose the Dao, and the Great Way accords with the plainness of its unfolding.\nThe sponsor of this rite, concealing nothing in his earnest devotion, lifts his gaze to implore your sacred grace.\nHow could we not offer our most reverent hearts, ever mindful of the overseers of retribution,\nAdhering to the luminous statutes and observing conduct,\nBinding ourselves to the precepts of the immortals and fulfilling our vows?\nA single day’s covenant is honored with a hundred lives unwearied.\n\nMoreover, as the ritual draws to its close, we exhaust our treasures in grand ceremony.\nHow fares the night? The Silver River descends from the clear Han.\nThe flames of the phoenix-crowned lamps dim among the ninefold radiance;\nThe incense of the magpie-tailed censers fades amid the hundred harmonies.\nEight stanzas of cavernous scriptures are chanted, three libations of jade wine are poured.\nThe vermilion flames of the celestial paper money rise into the void;\nThe jade bells of the immortal melodies hasten their return to the heavens.\nCrimson standards wind in procession, purple banners advance in measured grace.\nThose who return to the Jade Capital are the boundless Lord Emperors;\nThose who ascend to the Golden Portals are the Most High True Sovereigns.\nAll spirits follow the cinnabar chariots, the host of sages mount the purple reins.\nFlanking them, moon-phoenixes take flight, dividing their course toward the cavernous chambers;\nBelow, cloud-dragons are reined in, gazing upon the vast seas as they descend.\nThe divine officials resume their stations, the celestial officers return to heaven,\nBestowing blessings to fill the hall, fleeting divine light lingering before our eyes.\n\nAs for the myriad forms of life, may all share in the nurturing benevolence;\nThe silent depths of the nine nether realms, may all receive the grace of transcendence.\n\nYour servant and the sponsor, gazing in awe at the divine procession, fix our thoughts upon the vast emptiness,\nWeeping at the dusty crossroads, unable to detain the sacred footsteps.\nOvercome with longing and devotion, we prostrate ourselves again and again in farewell.\n\nNext, the hymn of sending forth the deities.\nNext, the dispatching of the officials to resume their stations.\n\nThe rite now concluded, the attending messengers and functionaries who emerged earlier\nShall re-enter through the Gates of Myriad Mysteries—those on the left returning to the left, those on the right to the right.\nThe chief functionary shall lead and oversee them, restoring them to the Golden Hall and Jade Chamber,\nReady to be summoned at need, as in former times.\n\nNext, the restoration of the incense burner.\nMay the incense officials, the Dragon and Tiger Lords of Left and Right, and all attending spirit-officers,\nAt this place of ritual offering, naturally generate golden nectar, cinnabar and azure mushrooms,\nWhile the hundred spirits and host of perfected gather before this incense burner.\nMay the sponsor receive blessings, his household be enveloped in grace,\nAnd the jade maidens and immortal youths of the ten directions, bearing the incense smoke as their missive,\nSwiftly convey the words herein uttered\nTo the presence of the Utmost True and Boundless Dao,\nThe Three Clarities and Supreme Saints,\nAnd the Jade Emperor of the Vast Heaven.\n\nThe rite of the *Taishang* Supplication for Blessings and Averting Disasters is now complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上消灾祈福醮仪 经名：太上消灾祈福醮仪。 一卷。 底本出处：《正统道藏》洞神部威仪类。 太上消灾祈福醮仪 先奏告关牒，禁坛，祝如常式 次启堂颂 次各礼师，存念如法 次宣五方卫灵神咒 东方 九炁青天，明星大神，焕照东乡，洞映九门。 转烛阳光，扫秽除氛。 开明童子，备守我轩。 收魔束妖，上对帝君。 奉承正道，赤书玉文。 九天符命，摄龙驿传。 普天安镇，我得飞仙。 南方 南方丹天，三炁流光。 荧星转烛，洞照太阳。 上有赤精，开明灵童。 总御火兵，备守三宫。 斩邪束妖，剪截魔凶。 北帝所承，风火八冲。 流铃交焕，敢有不从。 正道流行，我享上功。 保天长存，亿劫无终。 西方 七炁之天，太白流精。 光耀金门，洞照太冥。 中有素皇，号曰帝灵。 保神安镇，卫我身形。 断截邪源，正道开明。 宫殿整肃，三景斋并。 道合自然，飞升紫庭。 灵宝符命，普惠万生。 功加一切，天地咸宁。 北方 北方玄天，五炁徘徊。 辰星焕烂，光耀太微。 黑灵尊神，飞仙羽衣。 备卫五门，检精捕非。 敢有干试，豁落斩摧。 玉符所告，神振八威。 邪门闭塞，正道明开。 映照我身，三光同辉。 策空驾浮，举形仙飞。 中央 黄中理炁，总统玄真。 镇星吐辉，流焕九天。 开光童子，一十二人。 元炁阳精，炎上朱烟。 洞照天下，及臣等身。 百邪摧落，杀鬼万千。 中山神咒，普天使然。 五灵安镇，身飞上仙。 次都讲唱，呜法鼓二十四通 次发炉 无上真玄五灵老君，当召功曹使者、左右龙虎君、捧香使者、三炁正神，急上关启三天真元道君。 臣今正尔烧香，修斋设醮，谨奉为醮主弟子臣某为斋意，其余诚恳，具载青词。 愿得太上十方正真生炁，降流入臣等身中，令臣所启，速达径御至真无极大道三清上圣，昊天玉皇上帝御前。 次众官，各长跪出官 谨出臣身中五体真官功曹吏，出上三天，执法开化。 阴阳功曹，度道消灾，散祸解厄君吏各十二人出。 臣所受法箓治中建节监功大将军前部，效功后部，效杀驿廷、令驿延丞，四部监功竭者，上仙上灵，直使功曹左右官使者，阴阳神决吏官，各二人出。 出者，严装显服，冠带垂缨，整其威仪。 功曹弁朱阳之帻，冠通天之冠，衣皂纨单衣，腰带龙头之剑。 捧持谒簿使者，弁玄阴之帻，冠九德之冠，衣绛章单衣，腰带虎符，齐执玉版。 直事功曹，住立四方。 正一功曹，住立中央。 治病功曹，营卫臣身。 左官使者，建节在前； 右官使者，持幢在后。 阳神决吏，立左； 阴神决吏，立右。 上部功曹，住立上方； 中部功曹，住立身中； 促炁功曹，催促十方。 上部使者，远望上天； 中部使者，远瞻八方； 都官使者，匝绕臣身。",
      "translated_text": "**The Supreme Rite for Dispelling Disasters and Praying for Blessings**\n\n**Sutra Title:** *The Supreme Rite for Dispelling Disasters and Praying for Blessings*. One fascicle. Source text: *Daoist Canon of the Zhengtong Era*, *Dongshen* Section, *Weiyi* Category.\n\n---\n\n**The Supreme Rite for Dispelling Disasters and Praying for Blessings**\n\nFirst, submit the memorial and close the ritual space; the invocations follow the standard form.\n\nNext, intone the *Hall Hymn*.\n\nThen, each pays homage to the master, visualizing as prescribed.\n\nNext, recite the *Incantations of the Five Directions’ Guardian Spirits of the Luminous Numinosity*:\n\n**East:**\nNinefold *qi* of the Azure Heavens,\nGreat Spirit of the Bright Star,\nRadiant upon the eastern quarter,\nIllumining the Nine Gates.\nRevolving the candle of yang light,\nSweeping away defilement and miasma.\nThe Luminous Youth,\nGuards my chamber in readiness.\nSubduing demons and binding specters,\nHe reports above to the Imperial Lord.\nUpholding the true Dao,\nWith vermilion script on jade tablets.\nThe talismanic commands of the Nine Heavens,\nTransmitted by dragon couriers.\nAll under heaven is pacified and secured;\nI attain the flight of immortality.\n\n**South:**\nCinnabar Heavens of the South,\nThreefold *qi* flowing in light.\nThe Fire Star revolves its candle,\nIllumining the Great Sun.\nAbove dwells the Vermilion Essence,\nThe Luminous Numinous Youth.\nCommanding the hosts of fire,\nGuarding the Three Palaces in readiness.\nBeheading evil and binding specters,\nSevering and suppressing demonic malevolence.\nAs decreed by the Northern Emperor,\nThrough the eight thrusts of wind and fire.\nInterlocking bells blaze in splendor—\nDare any disobey?\nThe true Dao flows forth;\nI partake of the supreme merit.\nPreserving heaven’s enduring existence,\nFor kalpas without end.\n\n**West:**\nHeavens of the Sevenfold *qi*,\nGreat White streaming in essence.\nLight gleams at the Golden Gate,\nIllumining the Great Darkness.\nWithin abides the White Sovereign,\nNamed the Imperial Numinosity.\nProtecting the spirit and securing peace,\nGuarding my bodily form.\nSevering the roots of evil,\nThe true Dao shines forth.\nPalaces and halls are arrayed in solemnity,\nThe Three Luminaries fast in unison.\nThe Dao harmonizes with spontaneity;\nI ascend in flight to the Purple Court.\nThe talismanic commands of the Numinous Treasure\nBestow universal grace upon the ten thousand beings.\nMerit extends to all;\nHeaven and earth are at peace.\n\n**North:**\nMystic Heavens of the North,\nFivefold *qi* lingering in circuit.\nThe Chronogram Star blazes resplendent,\nLight gleaming in the Great Subtlety.\nThe Black Numinous Honored Spirit,\nClad in the raiment of flying immortals.\nGuarding the Five Gates in readiness,\nInspecting essences and seizing the false.\nDare any test their power—\nThe *huoluo* blades sever and shatter.\nAs proclaimed by the jade talismans,\nThe spirits manifest their eightfold might.\nThe gates of evil are sealed;\nThe true Dao shines forth in clarity.\nIllumining my body,\nThe Three Luminaries shine in unison.\nI spur the void and ride the floating,\nMy form ascending in immortal flight.\n\n**Center:**\nThe Yellow Center governs *qi*,\nOverseeing the Mysterious True.\nThe Star of Stability emits its radiance,\nFlowing and blazing through the Nine Heavens.\nThe Luminous Youths,\nTwelve in number.\nPrimal *qi* and yang essence,\nFlaming upward in crimson smoke.\nIllumining all under heaven,\nAnd the bodies of your servants.\nA hundred evils are shattered,\nTen thousand ghosts slain.\nThe divine incantation of the Central Mountain\nIs universally enacted by heaven’s agents.\nThe Five Numinosities secure peace;\nMy body ascends as an immortal.\n\nNext, the *doujiang* chants; the ritual drum is sounded twenty-four times.\n\nNext, the incense burner is kindled.\n\nThe Most High, True and Mysterious, Five Numinous Venerable Lord, summon the Attendant Officers, the Left and Right Dragon-Tiger Lords, the Incense-Bearing Attendants, and the Three *qi* True Spirits. Hasten to report to the Three Heavens’ True Primordial Lord of the Dao.\n\nYour servant now burns incense, conducts the fast, and establishes the ritual, reverently offering it for the ritual’s sponsor, disciple [Name], with the intent of the fast. All other sincere supplications are recorded in the *qingci*. May the life-*qi* of the Supreme Ten Directions’ True and Upright Ones descend and flow into the bodies of your servants, so that what your servant petitions may swiftly reach the presence of the Most High, Boundless, and Great Dao’s Three Clarities and Supreme Saints, before the Jade Emperor of the Vast Heavens.\n\nNext, the assembled officials each kneel and emerge from their stations.\n\nReverently, the Five Body True Officials and Attendant Officers within your servant’s body emerge to ascend the Three Heavens, executing the law and unfolding transformation. The Yin-Yang Attendant Officers, who deliver the Dao and dispel disasters, disperse misfortune and resolve calamities—twelve each—emerge. From the registers of the methods your servant has received, the Generals of the Central Establishment, the Front Division’s Merit-Reporting Generals, the Rear Division’s Merit-Executing Generals, the Courier Station and Relay Station Officers, the Four Division Inspectors, the Exhausted Merit Officers, the Upper Immortals, the Upper Numinosities, the Direct Attendant Officers of the Left and Right, the Yin-Yang Spirit-Decision Officers—two each—emerge.\n\nAs they emerge, they don their solemn attire, caps and pendants, and array their majestic presence. The Attendant Officers wear vermilion yang caps, celestial crowns, black silk unlined robes, and gird themselves with dragon-headed swords. The Petition-Bearing Attendants wear dark yin caps, Nine Virtues crowns, crimson ceremonial unlined robes, and gird themselves with tiger tallies, each holding jade tablets. The Direct Service Attendant Officers stand at the four directions. The Orthodox Unity Attendant Officers stand at the center. The Healing Attendant Officers safeguard your servant’s body. The Left Attendant Officers bear the standard at the front; the Right Attendant Officers hold the banners at the rear. The Yang Spirit-Decision Officers stand to the left; the Yin Spirit-Decision Officers stand to the right. The Upper Division Attendant Officers stand above; the Middle Division Attendant Officers stand within the body; the *Qi*-Hastening Attendant Officers urge the ten directions. The Upper Division Attendants gaze afar to the heavens above; the Middle Division Attendants survey the eight directions; the General Attendant Officers encircle your servant’s body.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1053,
      "start_sentence": 0,
      "end_sentence": 80,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.299383878707886,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太上消灾祈福醮仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "郎吏虎贲，察奸钩骑，都官侯射，天丁力士治正，执正吏收神，食神吏收鬼，食鬼吏收炁，食炁吏收毒，食毒吏收精，食精吏收邪，食邪吏诛符，破庙吏刚风，骑置吏驿马，上章吏飞龙，骑吏等并皆屯住臣左右前后，受臣词语，关启此间土地里社正神，监察考召甲子诸官君将吏，谨同诚上启：太上无极大道太上老君，太上丈人，九老仙都君，九炁丈人，百千万重道炁，千二百官君。 太清玉陛下，恭以天人交感，在祈佑以所符； 陟降中潜，非至诚之不格。",
      "translated_text": "The Tiger-Swift Officers of the Gentlemen-Attendants detect treachery; the Hook-Riding Officers patrol the ranks. The General Attendant Officers stand as archers; the Heavenly Ding Warriors enforce rectitude. The Rectifying Attendants gather the spirits; the Spirit-Feeding Attendants gather the ghosts; the Ghost-Feeding Attendants gather the *qi*; the *Qi*-Feeding Attendants gather the poisons; the Poison-Feeding Attendants gather the essences; the Essence-Feeding Attendants gather the perverse; the Perverse-Feeding Attendants execute the talismans. The Temple-Destroying Attendants command the fierce winds; the Relay Officers ride the post-horses; the Memorial-Presenting Attendants mount the flying dragons. All these mounted and stationed officers stand to your servant’s left and right, before and behind, receiving your servant’s words to report and relay to the local earth gods and altar deities, overseeing and summoning the *jiazi* officials, lords, generals, and attendants. With reverent sincerity, they jointly address the petition:\n\nTo the Supreme and Boundless Dao, the Most High Lord Lao, the Most High Venerable, the Nine Elders of the Immortal Metropolis, the Nine *Qi* Venerable, the myriad layers of Dao-*qi*, and the one thousand two hundred lords and officials beneath the Jade Steps of the Great Clarity—\nIn this moment of celestial and human resonance, we beseech your protection through the talismans. Ascending and descending in hidden depths, nothing but utmost sincerity can reach you.",
      "overlap_context": "icers hold the banners at the rear. The Yang Spirit-Decision Officers stand to the left; the Yin Spirit-Decision Officers stand to the right. The Upper Division Attendant Officers stand above; the Middle Division Attendant Officers stand within the body; the *Qi*-Hastening Attendant Officers urge the ten directions. The Upper Division Attendants gaze afar to the heavens above; the Middle Division Attendants survey the eight directions; the General Attendant Officers encircle your servant’s body.",
      "start_char": 1053,
      "end_char": 1254,
      "start_sentence": 81,
      "end_sentence": 83,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.528664827346802,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太上消灾祈福醮仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "唯精衷之内控，仰元鉴之有门。 矧蕊笈之真诠，廓灵科而示教。 璇穹大象，霄景神辉。 有躔次以下临，有休祥之外系。 今醮主某为某事，肃严坛供，仰驻神游。 庶伸苹藻之诚，以埃监观之应。 词言通感，不负效心。 伏乞功曹使者、将吏灵官，速上奏陈，应时感降。 所祈获遂，所愿协从。 臣与醮主诚惶诚恐，稽首再拜以闻。 次各称名位 具法位臣某等谨同诚上启：虚无自然元始天尊、无极大道太上道君，太上老君混元上德皇帝，太上开天执符御历含真体道昊天玉皇上帝，紫微天皇大帝，紫微北极大帝，南极注生大帝，斗中天尊玉帝星君，十神太一真君，十一曜星君，北斗七元星君，左右辅弼星君，南斗六司星君，天地水三官，二十八宿星君，九天储福定命真君，九天应元保运真君，九天司命司录真君，九天掌籍掌算真君，九天监生延生大神，玄中大法师、正一真人、三天辅玄大法师，天曹太皇万福真君，天曹定名玉历真君，天曹延生保命真君，天曹扶衰度厄真君，天曹掌籍掌算真君，天曹财库禄籍真君，天曹司命司录真君，天曹司非司危真君，天曹门下引进真官，天曹门下上章直日典者，洞渊水府福地灵曹，见生星斗真君，本命元辰真官，城隍里社土地真官，三界官属，一切威灵。 臣闻玉天严远，难陛浩劫之家； 金洞渺清，徒仰素灵之馆。",
      "translated_text": "Within the depths of pure devotion, we restrain ourselves and gaze upward, where the Primal Mirror’s gate stands open. How much more so the true canon of the sacred scriptures, which expands the numinous ordinances to reveal the teachings. The celestial vault’s great image, the divine radiance of the ethereal light—there are celestial stations from which to look down, and auspicious omens that externally bind.\n\nNow, the master of this rite, [Name], for the matter of [specific purpose], solemnly prepares the altar’s offerings, reverently awaiting the deities’ descent in spirit. We humbly extend our sincerity like floating duckweed, hoping for the slightest response to our vigilant gaze. May the words of our petition reach and move you, not betraying the earnestness of our intent.\n\nWe implore the *gongcao* messengers, the divine generals, and the spirit officials to swiftly ascend and present our plea, that the response may descend in timely accord. May what we pray for be fulfilled, and what we wish for be granted. Your servants and the master of this rite, with utmost reverence and awe, bow twice in prostration to make this known.\n\nNext, each declares their name and rank:\n\nYour humble servants, the ritual officiants [Names and titles], with unified sincerity, reverently address:\n\nThe Primordial Heavenly Worthy of Virtual Emptiness and Spontaneous Nature,\nThe Supreme Dao Lord of the Boundless Dao,\nThe Most High Lord Lao, August Emperor of Supreme Virtue and Primordial Unity,\nThe Most High Jade Emperor of the Vast Heaven, Who Holds the Talisman, Governs the Calendar, and Embodies the Dao,\nThe August Emperor of the Purple Tenuity,\nThe Great Emperor of the Northern Culmen of the Purple Tenuity,\nThe Great Emperor of the Southern Culmen Who Bestows Life,\nThe Heavenly Worthy Jade Emperor and Star Lord within the Dipper,\nThe Ten Spirit Lords of the Great Unity,\nThe Eleven Luminaries and Star Lords,\nThe Seven Primes of the Northern Dipper and Their Star Lords,\nThe Left and Right Assistant Star Lords,\nThe Six Controllers of the Southern Dipper and Their Star Lords,\nThe Three Officials of Heaven, Earth, and Water,\nThe Twenty-Eight Constellations and Their Star Lords,\nThe True Lords of the Nine Heavens Who Store Blessings and Determine Destiny,\nThe True Lords of the Nine Heavens Who Respond to the Primordial and Protect Fate,\nThe True Lords of the Nine Heavens Who Govern Life and Record Deeds,\nThe True Lords of the Nine Heavens Who Hold the Registers and Calculate Accounts,\nThe Great Gods of the Nine Heavens Who Oversee Birth and Prolong Life,\nThe Great Dharma Master of the Mysterious Center,\nThe Orthodox Unity Perfected,\nThe Three Heavens’ Assistant and Mysterious Great Dharma Masters,\nThe True Lord of Myriad Blessings of the Heavenly Court,\nThe True Lord Who Determines Names in the Jade Calendar of the Heavenly Court,\nThe True Lord Who Prolongs Life and Protects Destiny of the Heavenly Court,\nThe True Lord Who Supports the Weak and Delivers from Calamity of the Heavenly Court,\nThe True Lord Who Holds the Registers and Calculates Accounts of the Heavenly Court,\nThe True Lord of the Treasury of Wealth and the Registers of Emolument of the Heavenly Court,\nThe True Lords Who Govern Life and Record Deeds of the Heavenly Court,\nThe True Lords Who Oversee Wrongdoing and Peril of the Heavenly Court,\nThe True Officials Who Introduce Petitions at the Gate of the Heavenly Court,\nThe True Officers Who Present Petitions on the Appointed Day at the Gate of the Heavenly Court,\nThe Numinous Court of the Abyssal Water Palace and Blessed Land,\nThe True Lords of the Star and Dipper of One’s Present Life,\nThe True Official of One’s Original Destiny and Celestial Stem,\nThe True Officials of the City God, Village Earth God, and Local Earth Deities,\nThe officials and attendants of the Three Realms,\nand all majestic and numinous beings.\n\nWe have heard that the Jade Heaven is stern and distant, its threshold too vast for the dwellings of the kalpas; the Golden Grotto is remote and pure, its halls too lofty to gaze upon in vain.",
      "overlap_context": "ey jointly address the petition:\n\nTo the Supreme and Boundless Dao, the Most High Lord Lao, the Most High Venerable, the Nine Elders of the Immortal Metropolis, the Nine *Qi* Venerable, the myriad layers of Dao-*qi*, and the one thousand two hundred lords and officials beneath the Jade Steps of the Great Clarity—\nIn this moment of celestial and human resonance, we beseech your protection through the talismans. Ascending and descending in hidden depths, nothing but utmost sincerity can reach you.",
      "start_char": 1254,
      "end_char": 1768,
      "start_sentence": 84,
      "end_sentence": 97,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.74211812019348,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太上消灾祈福醮仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "粤帝尊而在上，握化纪以居中。 启十方之无碍，心应物而动； 号三界之大慈，父视人如殇。 俯仰郁罗之台，卷舒投芥之劫。 回瞻万兆，悲晋晷於蜉蝣； 俯盻九尘，嗟汉宫於蝼蚁。 永惟下俗，本绝真阶。 盖凭开度之科，许罄精微之恳。 今醮主弟子某为某事，严持信币，密款仙庭，冀天贶以临观，庶人心而专达。 伏望三清并轨，离曲密之华房； 十极流軿，从飞虚之法驾。 百亿天帝，后辔丹飙； 千二官君，前迎翠节。 掷火万里，下呼阳而召阴； 旋香三轮，上出日而入月。 极东浮於炽水，尽西景於虞沂。 南造朱陵之宫，中盘黄炁之府。 朔阴之馆，北尽於夜城； 丘寒之泉，下殚於神谷。 至於鲁，称教父，由太极之从行。 西号释尊，自延真而密侍。 元始符命，畴敢不祇。 辄布菲词，仰披云望。 叩碧天而祀事，称圣号以降神。 伏愿曲鉴凡情，允垂飕驾。 臣与醮主等谨稽首再拜上请： 次请圣位，上香，上荼，献酒 次奏初献法事 次重称法名 具位臣某等谨同诚上启：三清上圣，十极高真，醮位灵仙，三界主宰。 臣闻：一真布景，本无高下之基； 万兆肖形，尽毓清和之炁。 即生死而寖远，遂好恶以森繁。 秽身纵溺於沉迷，大道尚垂於营救。 或罪根之弥甚，始阴责以潜加，苟悟百非，即消万祸。 今醮主弟子某识神冥滞，营魄振惊。 由浩劫以沦胥，俾元灵而奔躁。 不趋觉路，乐登陟於迷途； 不憩真庭，甘奔驰於世网。 念回还於先日，历劳苦於至艰。 爰至今身，命亦危於昼电； 再思积行，功未半於秋毫。 或反道而欺天，或黩尊而犯上，或漏慢经法，或凌侮父师，或治家失孝悌之欢，或临事滥公私之节，或掩秽於真馆，或犯突於上灵，或冒大禁於三光，或堕严禋於七世，或伤残物命，或淫祀鬼神，或沉湎酒嘐，或皆迷声色，或积财於不义，或运智於多岐，或狠愎自贤，或饕餮无状，或奉道亏立功之行，或居家迷开训之仪，或禀人伦，或沉女弱。 共沦五欲，已剧千生。 迪惟高圣之宣慈，大庇含生而开度。 醮主某诣道自首，祈天博容，伏乞璇极上真玉虚大帝，垂恩枯骨，锡命行尸，解片体之阴愆，除亿曾之冥考。 阅罪先期於冰释，逆厘次伫於云臻。 俯伏对扬，屏营待报，欲陈词意，仰进丹合。 臣虽已考详，尚虞踳驳。 谨冒天禁，战悸宣闻： 次宣青词 具如词旨，备极精虔。 冀伸钦伫之心，用谢生成之赐。 醮主弟子伏愿斋功纪籍，道果资身，增寿禄於将来，保年龄於向去。 仰荷真灵之德，惟蕲福佑之恩。 臣与醮主等不任激切之至，谨稽首再拜。 次再上香献酒 次奏亚献法事 臣谨重诚上启：三清上圣，十极威灵。 臣闻：玉帝鉴观，金真洞察。 感群生而布款，采庶品以流恩。 上士希仙，即万仙而浆就； 善人缴福，乃百福以妙严。 理贵精微，事符歆答。 今醮主弟子某伏为某事，腾词清夜，驰意紫阍。 夙启兰科，仰膺灵贶。 伏愿醮主弟子某落除世网，进补仙阶。 许映全家，俱入华阳之洞； 刘纲尽室，并升丹绿之軿。 阴阳之数已逃，生死之根永谢。 或干禄仕，冀登践於崇高； 或计赀储，俾丰盈於货殖。 尊卑福履，中外欣昌，幽冥息人鬼之非，出处有亨嘉之会。 庆均嗣续，庇及亲疏。 水火兵贼之灾虞，无侵里闬； 日月星辰之否厄，不犯形躯。",
      "translated_text": "The August Emperor reigns on high, grasping the threads of transformation at the center. He opens the ten directions without obstruction, his heart responding to things as they move; he is hailed as the Great Compassion of the Three Realms, regarding all people as his children, even the young and frail. Beholding the Terrace of Yuluo, he rolls and unfurls the kalpas as if casting away a mustard seed. Gazing back upon the myriad multitudes, he grieves for the ephemeral mayfly beneath the sun; looking down upon the nine dusts, he sighs for the Han Palace as if it were but an anthill. Ever mindful of the vulgar below, whose true path is long severed, he relies upon the statutes of deliverance, permitting the utmost sincerity of their pleas to be fully expressed.\n\nNow, the master of this offering, the disciple [Name], for [specific matter], solemnly presents the tokens of sincerity and secretly petitions the immortal court, hoping for the heavenly grace to descend and observe, that his heart’s devotion may be singularly conveyed. We humbly beseech the Three Clarities to align their paths, departing the resplendent chambers of Li Qu; the Ten Poles to stream forth their chariots, following the flying void of the Dharma procession. The hundred million Heavenly Emperors shall trail their reins in the cinnabar whirlwind; the twelve hundred Lords and Sovereigns shall welcome them with jade-green standards. Casting fire for ten thousand leagues, they summon yang from below and call forth yin; revolving the three wheels of incense, they ascend beyond the sun and enter the moon. To the farthest east, they float upon the blazing waters; to the utmost west, they reach the twilight of Yu and Yi. Southward they journey to the Crimson Mound Palace, at the center they coil within the Yellow Qi’s abode. The northern halls of darkness extend to the City of Night; the frigid springs of Qiuhan descend to the Spirit Valley below.\n\nAs for the Master of Lu, hailed as the Teaching Father, he follows the retinue of the Great Ultimate. In the west, the Buddha is revered, ever attending in secret from the Realm of Extended Truth. The Mandate of the Primordial Beginning—who would dare not revere it? Thus, we humbly present these modest words, lifting our gaze to the clouded heavens. Knocking upon the azure sky, we perform the rites and invoke the sacred names to summon the deities.\n\nWe humbly pray that you, in your boundless grace, deign to look upon the sentiments of mortals and graciously descend in your swift chariot. We, the master of this offering and his attendants, bow our heads and prostrate ourselves to beseech:\n\nNext, we invoke the sacred ranks, offer incense, present tea, and pour libations of wine.\nNext, we perform the initial offering rites.\nNext, we solemnly recite the Dharma names.\n\nWe, your humble servants [Names], with utmost sincerity, jointly address the Three Clarities, the Most High Saints, the numinous immortals of the altar, and the sovereigns of the Three Realms:\n\nWe have heard that the One True scatters its radiance, originally without distinction of high or low; the myriad beings take form, all nurtured by the pure and harmonious qi. Yet as life and death grow distant, likes and dislikes multiply in profusion. Though the defiled body may sink into deep delusion, the Great Dao still extends its saving grace. When the roots of transgression grow severe, unseen retribution is silently imposed; but if one awakens to a hundred wrongs, ten thousand calamities are instantly dissolved.\n\nNow, the master of this offering, the disciple [Name], finds his spirit ensnared in darkness, his ethereal soul trembling in alarm. Through the vast kalpas, he has sunk into mutual ruin, causing his primordial spirit to flee in agitation. He does not tread the path of awakening, delighting instead in scaling the heights of delusion; he does not rest in the true court, willingly rushing into the snares of the world. Reflecting upon his past, he has endured toil and hardship beyond measure. Now, in this present life, his fate hangs as precariously as the lightning of day; reconsidering his accumulated deeds, his merits fall short by half a hair’s weight.\n\nHe may have turned against the Dao and deceived Heaven, or defiled the sacred and offended his superiors. He may have carelessly neglected scriptures and rituals, or slighted his parents and teachers. He may have failed in filial piety and brotherly love while managing his household, or transgressed the bounds of public and private conduct in his affairs. He may have defiled the true sanctuaries or violated the dignity of the celestial spirits. He may have trespassed against the great prohibitions of the Three Luminaries or disrupted the solemn sacrifices of seven generations. He may have harmed living creatures, engaged in licentious worship of spirits, or drowned himself in wine and reckless speech. He may have been ensnared by sensual pleasures, amassed wealth through injustice, or wielded cunning in devious ways. He may have been stubborn and self-righteous, or gluttonous and insatiable. He may have upheld the Dao yet failed in meritorious conduct, or managed his household yet neglected the rites of instruction. He may have disregarded human ethics or oppressed the weak. Together, these transgressions have plunged him into the five desires, exceeding the sins of a thousand lifetimes.\n\nYet, mindful of the boundless compassion of the Most High Saints, who shelter all beings and open the path to deliverance, the master of this offering, [Name], approaches the Dao in repentance, praying for Heaven’s vast forbearance. We humbly implore the Jade Void Great Emperor of the Celestial Pole, the august True Ones, to bestow mercy upon the dry bones, to grant life to the walking corpse, to dissolve the hidden transgressions of this single body, and to erase the unseen torments of a hundred generations. May past sins melt away like ice before their time, and may the blessings of rectification swiftly arrive like clouds. Prostrate and trembling, we await your response, longing to present our words and offer our cinnabar caskets.\n\nThough we have carefully examined our plea, we still fear it may be flawed. Daring to transgress the heavenly prohibitions, we tremble as we make this declaration:\n\nNext, we proclaim the Blue Petition,\nas its words fully express our utmost sincerity.\nMay our reverent devotion be acknowledged,\nand the gifts of life and growth be repaid.\n\nThe master of this offering, the disciple [Name], prays that the merits of this fast be recorded in the registers, that the fruits of the Dao sustain his being, that his lifespan and blessings be augmented in the days to come, and that his years be preserved henceforth. Reverently bearing the virtue of the true spirits, he seeks only the grace of their blessings.\n\nWe, the master of this offering and his attendants, overwhelmed with emotion, bow our heads and prostrate ourselves again.\n\nNext, we offer incense and pour libations of wine once more.\nNext, we perform the secondary offering rites.\n\nWe humbly renew our sincerity and address the Three Clarities, the Most High Saints, and the majestic spirits of the Ten Poles:\n\nWe have heard that the Jade Emperor observes all, and the Golden Perfected scrutinize everything. Moved by the pleas of all beings, they bestow their grace upon every creature. The lofty scholar aspires to immortality, and the ten thousand immortals gather like dew; the virtuous person accumulates blessings, and a hundred blessings adorn them with wondrous splendor. The principle values subtlety, and the response aligns with reverence.\n\nNow, the master of this offering, the disciple [Name], for [specific matter], raises his words in the clear night and directs his thoughts to the purple gates of Heaven. From the earliest dawn, he has sought the orchid’s path, reverently awaiting the divine favor.\n\nWe humbly pray that the master of this offering, the disciple [Name], may cast off the snares of the world and ascend the ranks of immortality. May his entire household be permitted to enter the Grotto of Huayang; may the Liu and Gang families, with all their kin, rise together in the cinnabar and emerald chariots. May the reckonings of yin and yang be escaped, and the roots of life and death forever severed. If he seeks office and emolument, may he ascend to lofty heights; if he calculates wealth and stores, may his goods and assets flourish. May the blessings of high and low be shared, and all within and without rejoice in prosperity. May the unseen realms know no strife between humans and ghosts, and may all undertakings be met with felicity. May joy be equal among descendants, and protection extend to kin and stranger alike. May disasters of water, fire, weapons, and bandits never invade his home; may the adversities of sun, moon, stars, and constellations never afflict his body.",
      "overlap_context": "Blessed Land,\nThe True Lords of the Star and Dipper of One’s Present Life,\nThe True Official of One’s Original Destiny and Celestial Stem,\nThe True Officials of the City God, Village Earth God, and Local Earth Deities,\nThe officials and attendants of the Three Realms,\nand all majestic and numinous beings.\n\nWe have heard that the Jade Heaven is stern and distant, its threshold too vast for the dwellings of the kalpas; the Golden Grotto is remote and pure, its halls too lofty to gaze upon in vain.",
      "start_char": 1768,
      "end_char": 3000,
      "start_sentence": 98,
      "end_sentence": 173,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.956939935684204,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太上消灾祈福醮仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "长遘百昌，永逃九厄。 臣与醮主等不任祈祝之至，所献钱马都状之仪，恭对醮筵，谨当敷奏。 次奏钱马，三上香，献酒 次奏终献法事 臣谨重诚上启：三清上帝，十极高真，三界官属，醮席真灵。 臣闻：渎则不告，圣人垂简易之文； 天且弗违，大道顺披陈之素。 醮主某密形至恳，仰叩灵恩。 敢不尽畏丹心，动防司杀，奉明科而视履，约仙禁以践言。 一日告盟，百身无斁。 伏况法事粗悉，罄宝目於鸿仪； 夜如何其，落银河於清汉。 凤冠灯焰，将暗於九光； 鹊尾炉香，欲残於百和。 洞章八阕，玉酒三终。 燎朱火於天钱，即归空际； 促琼锺於仙籁，将返霄间。 绛节逶迤，紫旗容与。 还玉京者，无极之尊帝。 复金阙者，太上之真皇。 众灵咸从於丹辕，列圣皆骖於紫策。 傍飞月凤，指洞室以分驱； 俯控云龙，瞰沧溟而下迈。 神司复位，将吏还天，委禧福以充庭，瞥灵光而在目。 至於生生万品，皆均乐育之私； 寂寂九幽，尽被超升之泽。 臣与醮主等凝瞻法从，结想太空，泣恨尘岐，难留圣躅。 臣等不胜攀恋祷祝望恩之至，谨稽首再拜奉送。 次送神颂 次遣官还位 臣醮奏事讫，向来所出功曹使者，各从众妙门而入，在左还左，在右还右。 直使功曹主领检押，复安金堂玉室，须召即到，一如故事。 次复炉 香官使者、左右龙虎君、侍香诸灵官，当令醮奏之所，自然生金液，丹碧芝英，百灵众真，交会在此香火炉前。 伏愿醮主受福，阖家蒙恩，十方仙童、玉女侍卫，香烟传奏，向来所启之言。 速达径御，至真无极大道、三清上圣，昊天玉皇上帝御前。 太上消灾祈福醮仪竟",
      "translated_text": "May he long encounter the flourishing of all things and forever escape the nine calamities.\n\nYour servant and the sponsor of this rite, unable to contain the depth of our prayers and supplications, now present the full ceremonial offering of paper money and horses, reverently facing the altar to humbly submit our petition.\n\nFirst, we present the paper money and horses, offer incense thrice, and pour the libation.\nNext, we conclude the final offering of the ritual proceedings.\n\nWith utmost sincerity, your servant now respectfully invokes:\nThe Three Clarities and Supreme Emperors,\nThe Ten Loftiest Perfected,\nThe officials of the Three Realms,\nAnd the divine spirits of this altar.\n\nWe have heard that to be irreverent is to forgo supplication—thus the sages left us texts of simplicity.\nHeaven itself does not oppose the Dao, and the Great Way accords with the plainness of its unfolding.\nThe sponsor of this rite, concealing nothing in his earnest devotion, lifts his gaze to implore your sacred grace.\nHow could we not offer our most reverent hearts, ever mindful of the overseers of retribution,\nAdhering to the luminous statutes and observing conduct,\nBinding ourselves to the precepts of the immortals and fulfilling our vows?\nA single day’s covenant is honored with a hundred lives unwearied.\n\nMoreover, as the ritual draws to its close, we exhaust our treasures in grand ceremony.\nHow fares the night? The Silver River descends from the clear Han.\nThe flames of the phoenix-crowned lamps dim among the ninefold radiance;\nThe incense of the magpie-tailed censers fades amid the hundred harmonies.\nEight stanzas of cavernous scriptures are chanted, three libations of jade wine are poured.\nThe vermilion flames of the celestial paper money rise into the void;\nThe jade bells of the immortal melodies hasten their return to the heavens.\nCrimson standards wind in procession, purple banners advance in measured grace.\nThose who return to the Jade Capital are the boundless Lord Emperors;\nThose who ascend to the Golden Portals are the Most High True Sovereigns.\nAll spirits follow the cinnabar chariots, the host of sages mount the purple reins.\nFlanking them, moon-phoenixes take flight, dividing their course toward the cavernous chambers;\nBelow, cloud-dragons are reined in, gazing upon the vast seas as they descend.\nThe divine officials resume their stations, the celestial officers return to heaven,\nBestowing blessings to fill the hall, fleeting divine light lingering before our eyes.\n\nAs for the myriad forms of life, may all share in the nurturing benevolence;\nThe silent depths of the nine nether realms, may all receive the grace of transcendence.\n\nYour servant and the sponsor, gazing in awe at the divine procession, fix our thoughts upon the vast emptiness,\nWeeping at the dusty crossroads, unable to detain the sacred footsteps.\nOvercome with longing and devotion, we prostrate ourselves again and again in farewell.\n\nNext, the hymn of sending forth the deities.\nNext, the dispatching of the officials to resume their stations.\n\nThe rite now concluded, the attending messengers and functionaries who emerged earlier\nShall re-enter through the Gates of Myriad Mysteries—those on the left returning to the left, those on the right to the right.\nThe chief functionary shall lead and oversee them, restoring them to the Golden Hall and Jade Chamber,\nReady to be summoned at need, as in former times.\n\nNext, the restoration of the incense burner.\nMay the incense officials, the Dragon and Tiger Lords of Left and Right, and all attending spirit-officers,\nAt this place of ritual offering, naturally generate golden nectar, cinnabar and azure mushrooms,\nWhile the hundred spirits and host of perfected gather before this incense burner.\nMay the sponsor receive blessings, his household be enveloped in grace,\nAnd the jade maidens and immortal youths of the ten directions, bearing the incense smoke as their missive,\nSwiftly convey the words herein uttered\nTo the presence of the Utmost True and Boundless Dao,\nThe Three Clarities and Supreme Saints,\nAnd the Jade Emperor of the Vast Heaven.\n\nThe rite of the *Taishang* Supplication for Blessings and Averting Disasters is now complete.",
      "overlap_context": "alth and stores, may his goods and assets flourish. May the blessings of high and low be shared, and all within and without rejoice in prosperity. May the unseen realms know no strife between humans and ghosts, and may all undertakings be met with felicity. May joy be equal among descendants, and protection extend to kin and stranger alike. May disasters of water, fire, weapons, and bandits never invade his home; may the adversities of sun, moon, stars, and constellations never afflict his body.",
      "start_char": 3000,
      "end_char": 3630,
      "start_sentence": 174,
      "end_sentence": 210,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.963703870773315,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太上消灾祈福醮仪.txt",
        "category": "威仪类"
      }
    }
  ]
}