{
  "source_id": "太上洞神五星赞",
  "source_file": "chunked_daozang\\太上洞神五星赞.json",
  "total_chunks": 3,
  "total_original_chars": 2940,
  "total_translated_chars": 19017,
  "total_translation_time": 99.46927165985107,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\赞颂类\\太上洞神五星赞.txt",
    "category": "赞颂类"
  },
  "full_translation": "**Hymn of the Supreme Cavern-Spirit Five Stars**\n*Composed by Zhang Pingzi*\n\nThe Eastern Star of the Year, also called the Wood Star or Waḍauma, belongs to the East and governs Qi and Wu.\n\nThe Eastern Star of the Year is in truth the essence of Wood, the son of the Azure Emperor. Vast and luminous, wherever it resides brings fortune—none can rival its grandeur. When the ruler’s virtue is perfect and the Dao and righteousness prevail, winds and rains arrive in harmony, the hundred grains ripen, the sovereign enjoys longevity and prosperity, the people grow wealthy and upright, the Central Kingdom knows peace, and the Four Barbarians submit at court.\n\nIf the ruler’s governance is cruel and oppressive, forsaking benevolence and harmony, the star bristles with wrath, and the realm plunges into strife. Should he reject remonstrance and heed slander, violating the standards of reverence and solemnity, calamity fills the earth, inferiors usurp their superiors, and younger brothers plot against their elder brothers.\n\nWhen its hue is reddish-yellow, winds and droughts multiply. When white or black, floods and warfare arise. If it conjoins with Metal, great generals perish. If obscured by the Moon, consorts and empresses fall from favor. Entering the Supreme Subtlety, the ruler faces sorrow, but amnesties follow, and the lands of Qin in the Eastern Well know peace.\n\nShould it guard the Ghosts, the state employs axes and drills. Encircling the Void and Danger, Qi suffers disasters. Dwelling in the Chamber, ruler and ministers rejoice together. Lingering in the Heart, millet and grain flourish. Guarding the Horn, loyal and worthy men are promoted. Abiding in the Tail, the altars of soil and grain exult. Passing through the Clan, many joys arise within. Traversing the Neck, Han and Zheng dispatch armies. Entering the Winnowing Basket, the palace brims with strife. Crossing the Dipper, Wu and Yue know peace. Mounting the Void, ancestral ranks fall into disorder. Trespassing the Woman, the palace women revel in delight. Guarding the Ox, famine, cold, and tiger attacks afflict the land. Circling the Rooftop, sacrifices to the gods lose their fragrance. Trespassing the House, yin and yang hasten their course. Guarding the Wall, the voices of Yao and Shun resound as one. Entering the Straddler, the virtuous are cast aside. Passing through the Bond, envoys bearing decrees depart. Guarding the Stomach, the people suffer hunger and sickness. Dwelling in the Mane, the king enforces harsh punishments. Moving in reverse, it brings disaster and banditry. Appearing by day, the ruler grows weak while ministers overstep their bounds.\n\nShould the Net guard the Bond, disaster befalls men and oxen. Mounting the Stomach to enter the Well, prisons overflow with lawsuits and soldiers grieve. Circling Heaven, the dead exceed half. Trespassing the Willow, the five grains grow dense. Lingering in the Spread, ruler and ministers live in harmony. Entering the Wings, grain withers and people flee. Circling the Axle, the wilds teem with mourning and sickness. Trespassing the Chamber, generals and ministers share in sorrow.\n\nO rulers of the land, take heed and cultivate solitude! Pacify and nurture the people, ever increasing your cultivation of luminous blessings. The divine principle aids the good and punishes the wicked, curbing desires. Reverently serve the Three Luminaries and diligently cultivate eternal felicity.\n\nWherever the Wood Star travels, the corresponding regions follow its course. When its color is azure, it brings fortune and celebration, augmenting offices and emoluments. If it moves in reverse and its hue changes, it brings disaster, and where it meets Earth, the lives of men and their destinies mirror its effects.\n\nTo avert its baleful influences, one should plant the five fruit trees and display azure banners; wearing azure robes brings good fortune.\n\nThe Southern Sparkling Deluder Star, also called the Fire Star, the Cloud River, or the Punishment Star, belongs to the South and governs Chu and Yue.\n\nThe essence of the South is also called the Punishment Star, the son of the Vermilion Emperor, who oversees scrutiny and illumination. Each year, in the tenth and eleventh months, it enters the first palace of the Supreme Subtlety to receive its mandate. It does not tarry in the lands of the virtuous but moves in and out of the domains of the unrighteous.\n\nWhen it lingers or trespasses, it brings calamity; when it encircles, it brings disaster. When it emerges, war stirs; when it withdraws, war subsides. Its circling and halting bring illness and mourning. This arises from the ruler’s negligence and arrogance, causing ministers and subjects to suffer harm. Whether advancing or retreating, its movements are unpredictable in scale—now bringing floods, now drought, prosperity and scarcity alternating in turn. It appears swiftly at dawn and ascends gradually at dusk. Its comings and goings defy measure: now present, now absent; now enraged, now seething; now horned, now radiant.\n\nWhen it enters the Palace of Supreme Subtlety, the elder sister of Marquis Wen of Wei perishes; when it trespasses the Purple Forbidden precincts, a king dies. If it lingers over the Celestial River, floods surge; if it resides in the Stomach constellation, the realm’s granaries stand empty. Should it pierce the Feathered Forest, forbidden troops muster; if it tarries in the Spread constellation, the year is bountiful and the people prosper. Entering the Southern Dipper brings disaster to the chief minister; trespassing the Eastern Well brings water and fire omens. Dwelling in the Lesser Subtlety, recluses face peril; encircling the Celestial Orchard, the myriad households suffer famine. Circling the Ghost constellation, war and mourning arise together; entering the Pleiades, the northern barbarians lie in ambush. Residing in the Heart constellation, the ruler detests it; trespassing the Yellow Dragon, the empress and consorts grow anxious. Trespassing the House constellation, rice becomes tenfold in price; ascending the Rooftop, war erupts in the southern lands. Dwelling in the Tail, ministers grow disobedient; entering the Horn, generals are executed or wounded. Trespassing the Neck and the Throat, cities are submerged; trespassing the Ghost, the dead lie in sight of one another. Lingering in the Straddler, fathers disown sons; trespassing the Chariot, ministers rebel against the king. Ascending the Void, the ruler must go forth himself; dwelling in the Net, borderlands face surrendering troops. Entering the Wall, worthy scholars remain obscure; lingering in the Three Stars, war rages on all sides. Touching the Woman, cloth and silk become exorbitantly dear; dwelling in the Ox, the six livestock perish. Trespassing the Willow, famine and drought cost lands; trespassing the Horn, war erupts within the palace walls. Entering the Chariot-spokes, all people are conscripted; trespassing the Bond, troops march forth in strength. When it moves in reverse through the Dipper or encircles the Chamber, ministers flee, fathers and sons are torn apart. Traversing the heavens, the realm seethes like a boiling cauldron; lingering in the Winnowing Basket, people eat chaff and bran.\n\nFor rulers of lands, how can they not be vigilant? By restraining the self and returning to ritual, their posterity shall surely flourish. Let the ruler and father on high cultivate great blessings; let ministers and sons stand as if before an abyss. Thus, malevolent disasters shall vanish of themselves, and the celestial emolument shall endure forever.\n\nWhen the Fire Star lingers over a land’s celestial division, it often brings fires, sores and swellings, disputes and slander, upheaval and change, as well as subordinates plotting against superiors and sudden terrors. If it reaches one’s natal constellation, it induces madness, feverish illnesses, and cautions against bows, arrows, blades, and staves—lest wounds and bloodshed occur—and against eerie, portentous speech. To avert its baleful influences, one should receive talismans upon red garments, distribute red adzuki beans to the poor, hang crimson banners, perform lamp-lighting meritorious deeds, recite scriptures inscribed on golden tablets and jade slips, light star lamps, and offer earth from one’s home—all bring good fortune.\n\nThe Central Quelling Star, also called the Earth Sentinel or the Rooster Exchange, governs Zhou and Liang. Here is the Quelling Star, the essence of Earth in the center, the son of the Yellow Emperor, also named the Earth Sentinel. The land where it resides must not be invaded. Its division suffers no disasters, and the five grains ripen in abundance. The ruler enjoys prosperity and joy, for his virtue is steadfast. If the ruler lacks inner benevolence and righteousness yet adorns himself with outward splendor, the star strays from its course, becoming ominous and perverse. Above, chaos reigns; below, strife erupts; east and west rebel. Heaven sends down disasters—hail and ceaseless rain, mountains collapsing, earth splitting, ghosts wailing in lament.\n\nWhen it trespasses Wood, the empress and consorts fall; when it conjoins Water, armies suffer defeat after defeat. Touching the Horn, the rear palace rejoices; entering the Throat, the myriad things fail to thrive. Trespassing the Chamber, war erupts and the earth quakes; passing through the Root, the heir apparent rejoices. Dwelling in the Heart, the sagely ruler enjoys virtue; in the Tail, bandits roam openly. Circling the Winnowing Basket, floods scatter the people; entering the Dipper, ascension to the throne faces no contention. Encircling the Ox, treacherous ministers plot against the ruler; trespassing the Woman, the violent and powerful run rampant. Ascending the Void, wind and cold bring dear rice; entering the Rooftop, public corvée brings disaster. Trespassing the House, palaces and halls are extensively renovated; circling the Wall, the arts of Dao flourish. Ascending the Straddler, noblewomen grow powerful and floods surge; dwelling in the Bond, deceitful ministers arise. Trespassing the Stomach, floods, famine, and war bring chaos; trespassing the Pleiades, generals march west. Trespassing the Net, dukes and marquises are deposed; ascending the Chariot, cities fall and people panic. Circling the Three Stars, great ministers are dispatched; entering the Well, scorching droughts and disasters converge. In the Ghost, ministers and aides hatch treacherous schemes; trespassing the Willow, the realm enjoys peace. When the star lingers, all directions are governed; dwelling in the Spread, the five grains never cease. Entering the Chariot-spokes, harvests suffer and war erupts; dwelling in the Wings, the world is purged and cleared. Obscuring the Battle-axe, great ministers are executed; trespassing the Law, chief ministers face the cauldron.\n\nFor all who hold office, know the subtle and the minute. Be diligent in upholding the law, revering Heaven’s majesty and blessings, and extending the foundations of state and family.\n\nThe Earth Star has an iron body. Wherever it resides, if virtue and governance are not cultivated, that land suffers disaster. If the constellation it occupies is vast and distant, the calamity may last a decade; or it may bring the deaths of feudal lords and the hunger and want of the common people. If the land does not heed the celestial mandate, war and strife shall arise. If the Earth Star’s virtue is not cultivated, floods and droughts shall not be regulated, and insects shall damage the grains and wheat. If blessings are cultivated, one gains office and emolument.\n\nIf it reaches one’s natal constellation, great disaster strikes: parents may die, siblings may scatter, one may lose office and rank, old disputes may resurface, and one may become orphaned and alone. To avert its baleful influences, one should recite scriptures inscribed on golden tablets and jade slips, wear black garments, ride a black horse, burn benzoin incense, offer fish and turtle as food, establish a water shrine, and perform meritorious rites—all bring good fortune.\n\nThe Western Venus Star, also called the Metal Star, the Long-Lived, or the Radiant One, governs the western barbarians and the Hu people. The Venus Star is the essence of Lesser Yin, the son of the White Emperor, also called the Long-Lived. It governs righteousness. When large and bright, it resembles a general, renowned for executing punishments. When enraged, its rays blaze and it roars in fury; when pleased, its horns retract and it hides its form. Passing Fire brings successive funerals; conjoining Water brings war near and far. Trespassing the Horn, the realm wages war; entering the Throat, water bandits arise together. Dwelling in the Root, generals receive enfeoffment; residing in the Heart, insects and fires run rampant.\n\nWhen it resides in Room, earthworks drain the state; trespassing Tail, governance falters and people contend. Dwelling in Winnowing Basket brings wind and drought, yet amnesty follows; entering Dipper, calamities remain unresolved. Encircling Ox, earth’s qi dissipates; reaching Girl, treasuries empty entirely. Mounting Danger, generals lay down armor; trespassing Chamber, warriors cease campaigns. Entering Stride, rivers overflow their sources; guarding Wall, the state enforces harsh punishments. Mounting Bond, white-robed assemblies convene; entering Stomach, the inner realm finds peace. Trespassing Mane, Hu armies surge greatly; guarding Net, amnesties accompany military marches. Mounting Turtle, the wilds see political change; passing Well and Ghost, ministers and generals share anxieties. Entering Willow, the primary general gains enfeoffment; lingering in Star, death in battle spreads through encampments. Hook and Wing—feudal lords greatly mobilize troops; entering Imperial Chariot, the sovereign raises sieves and hangs banners. Guarding Heavenly Field, recipients receive ranks and emoluments; at high noon, earthly barbarians run rampant with unchecked ferocity. Losing lodging, evil perishes and armies break; unseen, generals are slain and cities razed. Should mountains collapse on all sides, corvée labor encroaches upon the noble. When the lord is yielding and ministers strong, the blade of war turns in battle. When power is seized by rival factions, omens of disorder repeatedly appear. When ministers’ integrity falters, the lord’s heart turns to perversity.\n\nAlas! Lords who hold land and ministers who serve as pillars of state—let them neither overstep nor exceed, but revere Heaven and stand in awe of the gods. Govern the state through the Dao, and rectify the self through virtue. Then blessings will endure for descendants, and transformation extend to the people.\n\nThe Venus Star, the Great General, governs righteousness, punitive expeditions, and warfare. It completes one celestial circuit every eight years; wherever it transits among the lodgings, warfare often follows. When it passes over one’s natal star, one indulges in depravity, music, and licentiousness. The method of averting its influence lies in promoting martial teachings and auspicious banners.\n\nThe Northern Chronographic Star, also called the Water Star or *Di*, belongs to the north and governs the lands of Yan and Zhao. The Chronographic Star, also known as the essence of Water, is the son of the Black Emperor, taking the form of a deputy general, and governs hearing. It scrutinizes the sentiments of lord and ministers; wherever it resides, there is anxiety and unease. If the lord examines his laws and decrees, clarifies his teachings, distances slanderers, and embraces the loyal and upright, curbing indulgence and excess, then the state and family will prosper. But if the lord neglects city walls, fails to employ worthy ministers, follows his own whims, and befriends petty men, then Heaven’s portents descend, disasters strike his domain, the five grains fail to ripen, wind and rain fall unseasonably, yin and yang fall into disorder, and famine and cold press upon one another. When it conjoins Metal, weapons stir; when trespassed by Earth, the primary general faces calamity. By observing its rays and horns, one discerns the scale of disasters; by carefully noting its concealments and appearances, one examines the reproaches of lord and ministers. When violent waters rise and its color turns green, great mourning follows. When it appears pale and hollow, this is auspicious. Rising at dawn in spring and setting at dusk in autumn, it fulfills its course. When winter grows warm and summer cold, it encroaches upon Greater Yang and obscures its light, or approaches Lesser Yin and exchanges embraces. Guarding Horn hastens punishments and brings water disasters; lingering in Throat causes grain prices to soar. Residing in Heart, the realm enjoys great peace; guarding Room, treacherous ministers plot. Dwelling in Tail, rivers and seas overflow; entering Winnowing Basket, great men grow anxious. Trespassing Void, the land turns red for a thousand miles; mounting Ox and Cow, a hundred rivers dam and flood. Encroaching upon Girl, cloth and silk double in price; guarding Danger, rebellious ministers rise in succession. Entwining Stride, ministers below are imprisoned; guarding Stomach, warfare and floods bring people sorrow. Circling Net, border armies are swiftly alarmed; residing in Mane, the administration’s punishments run rampant. Hooking Beak brings calamitous warfare; entering Well, water and earth become adversaries. Mounting Turtle and entering Ghost bring water disasters and war, with epidemics and many worries. Lingering in Willow, high ministers incur guilt; guarding Wings, ancestral temples require repair. Encroaching upon the Supreme Palace, ministers harm one another; guarding Imperial Chariot, the empress’s clan harbors many feuds. Entering Wall, the court trembles in fear; trespassing Chamber, lawsuits stall in prison. Residing in Spread, high ministers monopolize the state; trespassing Room, the empress’s faction is seized. Guarding Bond, water ruins all things; in Establishment, the prime minister’s praise is ceaseless.\n\nOnly through reverence for Earth, careful observance of ritual, trembling with caution, dwelling in peace yet mindful of peril, and diligently cultivating commanding virtue may one secure blessings and peace.\n\nThe Water Star is the pivot of the ministers, governing the Son of Heaven’s secret essentials, the conferral and reception of marquisates and earldoms, and the affairs of the year. It completes one celestial circuit annually; wherever it transits in the field divisions, it often brings water disasters, warfare, ominous rumors, or unsettles people’s hearts, inclining them toward sour and pungent flavors. The method of averting its influence lies in constructing city walls and moats, and digging channels to divert water—then fortune follows.\n\nHere ends the *Eulogy of the Five Stars* from the *Supreme Cavernous Divine*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上洞神五星赞 经名：太上洞神五星赞。 原题账平子撰。 一卷。 底本出处：《正统道藏》洞神部赞颂类。 太上洞神五星赞 张平子撰 东方岁星，一名木星，一名嗢吺斯，属东方，主齐吴。 东方岁星，实曰木精，苍帝之子，大而能明，所在为福，莫之与京。 人君至德，道义常行，则风雨诗若，百谷熟成，君寿而昌，人富而贞，中国安乐，四夷来庭。 君政残暴，失仁和之诚，则芒角而怒，宇内交争。 拒谏信谗，违恭肃之程，则祸满寰瀛，下陵其上，弟谋其兄。 赤黄，多风多旱。 白黑，为水为兵。 与金合，而大将损。 被月掩，而妃后倾。 入太微，君忧有赦在东井秦地安宁。 守与鬼，国用斧钻。 绕虚危，齐地灾生。 居房君臣咸乐。 留心，禾黍丰盈。 守角，忠贤荐用。 留尾，社稷欢荣。 历氏，内多有喜。 经亢，韩郑出征。 入箕，宫中口舌。 经斗，昊越和平。 乘虚，昭穆失次。 犯女，宫掖欢情。 守牛，饥冻虎害。 绕危，祠杞不馨。 犯室，阴阳皆速。 守壁，尧舜同声。 入奎，有道者甩。 经娄，致命者行。 守胃，人多饥疾。 在昴，王者严刑。 逆行，为灾、为贼。 昼见，主柔臣横犯。 毕守娄，灾及人牛。 乘赀入井，狱诉兵愁。 绕天，尸者过半。 犯柳，五谷繁稠。 留张，君臣和悦。 入翼，谷损人流。 绕斡，野有丧病。 犯房，将相皆忧。 勖哉有土，君子慎独。 绥抚婺，增修景福。 神理佑善，惩恶窒欲。 敬奉三光，克修永谷。 木星所到，分野顺行。 色青，为福为庆，如官益禄。 逆行色变，为灾与土同到，人生宿亦如之。 其禳法，宜栽种五果树木，又宜悬青旛，着青衣则吉。 南方荧惑星，一名火星，一名云汉，一名罚星，属南方楚越。 南方之精，亦曰罚星，赤帝之子，主察视明。 每年十月十一月，入太微一宫而受制。 过有道之野不停，伺无道之国出入。",
      "translated_text": "**Hymn of the Supreme Cavern-Spirit Five Stars**\n*Composed by Zhang Pingzi*\n\nThe Eastern Star of the Year, also called the Wood Star or Waḍauma, belongs to the East and governs Qi and Wu.\n\nThe Eastern Star of the Year is in truth the essence of Wood, the son of the Azure Emperor. Vast and luminous, wherever it resides brings fortune—none can rival its grandeur. When the ruler’s virtue is perfect and the Dao and righteousness prevail, winds and rains arrive in harmony, the hundred grains ripen, the sovereign enjoys longevity and prosperity, the people grow wealthy and upright, the Central Kingdom knows peace, and the Four Barbarians submit at court.\n\nIf the ruler’s governance is cruel and oppressive, forsaking benevolence and harmony, the star bristles with wrath, and the realm plunges into strife. Should he reject remonstrance and heed slander, violating the standards of reverence and solemnity, calamity fills the earth, inferiors usurp their superiors, and younger brothers plot against their elder brothers.\n\nWhen its hue is reddish-yellow, winds and droughts multiply. When white or black, floods and warfare arise. If it conjoins with Metal, great generals perish. If obscured by the Moon, consorts and empresses fall from favor. Entering the Supreme Subtlety, the ruler faces sorrow, but amnesties follow, and the lands of Qin in the Eastern Well know peace.\n\nShould it guard the Ghosts, the state employs axes and drills. Encircling the Void and Danger, Qi suffers disasters. Dwelling in the Chamber, ruler and ministers rejoice together. Lingering in the Heart, millet and grain flourish. Guarding the Horn, loyal and worthy men are promoted. Abiding in the Tail, the altars of soil and grain exult. Passing through the Clan, many joys arise within. Traversing the Neck, Han and Zheng dispatch armies. Entering the Winnowing Basket, the palace brims with strife. Crossing the Dipper, Wu and Yue know peace. Mounting the Void, ancestral ranks fall into disorder. Trespassing the Woman, the palace women revel in delight. Guarding the Ox, famine, cold, and tiger attacks afflict the land. Circling the Rooftop, sacrifices to the gods lose their fragrance. Trespassing the House, yin and yang hasten their course. Guarding the Wall, the voices of Yao and Shun resound as one. Entering the Straddler, the virtuous are cast aside. Passing through the Bond, envoys bearing decrees depart. Guarding the Stomach, the people suffer hunger and sickness. Dwelling in the Mane, the king enforces harsh punishments. Moving in reverse, it brings disaster and banditry. Appearing by day, the ruler grows weak while ministers overstep their bounds.\n\nShould the Net guard the Bond, disaster befalls men and oxen. Mounting the Stomach to enter the Well, prisons overflow with lawsuits and soldiers grieve. Circling Heaven, the dead exceed half. Trespassing the Willow, the five grains grow dense. Lingering in the Spread, ruler and ministers live in harmony. Entering the Wings, grain withers and people flee. Circling the Axle, the wilds teem with mourning and sickness. Trespassing the Chamber, generals and ministers share in sorrow.\n\nO rulers of the land, take heed and cultivate solitude! Pacify and nurture the people, ever increasing your cultivation of luminous blessings. The divine principle aids the good and punishes the wicked, curbing desires. Reverently serve the Three Luminaries and diligently cultivate eternal felicity.\n\nWherever the Wood Star travels, the corresponding regions follow its course. When its color is azure, it brings fortune and celebration, augmenting offices and emoluments. If it moves in reverse and its hue changes, it brings disaster, and where it meets Earth, the lives of men and their destinies mirror its effects.\n\nTo avert its baleful influences, one should plant the five fruit trees and display azure banners; wearing azure robes brings good fortune.\n\nThe Southern Sparkling Deluder Star, also called the Fire Star, the Cloud River, or the Punishment Star, belongs to the South and governs Chu and Yue.\n\nThe essence of the South is also called the Punishment Star, the son of the Vermilion Emperor, who oversees scrutiny and illumination. Each year, in the tenth and eleventh months, it enters the first palace of the Supreme Subtlety to receive its mandate. It does not tarry in the lands of the virtuous but moves in and out of the domains of the unrighteous.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 704,
      "start_sentence": 0,
      "end_sentence": 58,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.27269220352173,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\赞颂类\\太上洞神五星赞.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "何常勾犯为祸，环绕为殃。 出则兵动，入则兵藏。 周旋止息，为病为丧。 由人君之慢易，俾臣下之灾伤。 或进或退，大小无常，为水为旱，丰俭迭兴。 每晨见而行疾，及昏出而渐升，出处失度，乍存乍亡，有怒有勃，或角或芒。 入太微魏文侯姐落，犯紫微野死之王。 守天江河津泛溢，在胃宿天下空仓。 透羽林禁兵必起，留张宿岁美人康。 入南斗灾及宰相，犯东井水火之拜。 守少微处士被厄，绕天园万姓饥荒。 环鬼兵丧并起，入昴胡虏潜藏。 居心星王者恶之，陵轩辕妃后忧惶。 犯室米贵十倍，乘危兵起南乡。 在尾人臣不顺，入角将军诛伤。 勾亢漂没城邑，犯鬼死者相望。 留奎父不亲子，犯驷臣叛於王。 凌空国君自出，守毕边有兵降。 入璧贤士不显，留参兵连四方。 抵女布帛涌贵，守牛六畜尸僵。 勾柳饥旱失地，犯角兵起萧墙。 入轸人皆从役，犯娄出兵为强。 逆行于斗，环绕於房。 股肱出走，父子分张。 经天海内鼎沸，留箕人食糟糠。 有土之君，于何不臧。 克己复礼，其后必昌。 君父居上，宜修景福。 为臣为子，如临泉谷。 妖祸自灭，永终天禄。 火星临分野土地，多为火灾、疮肿、口舌、移改，及下人谋上，惊恐之厄。 到人本命，令人心狂、热疾，慎弓箭刀杖，损伤见血之厄，妖怪言语。 其禳法，以腓衣裳受符，宜施赤小豆与贫人，宜悬诽旛，宜造灯火功德，宜转金简玉诀之经，点星灯，施观家土则吉。 中央镇星，一名地侯，一名鸡换，主周、梁。 爰有镇星，中央土精。 黄帝之子，地侯别名。 所在之国，不可加兵。 其分无灾，五谷熟成。 人君昌乐，由君之贞。 君若内无仁义，外犹华饰，其星失度，为妖为慝，上乱下争，束西叛逆。 上天降灾为雹为霖，山崩地坼，鬼哭哀吟。 与木相犯，妃后陨倾。 与水相合，军败连营。 抵角后宫有喜，入亢万物无成。 犯房兵起地动，历氏储副欢荣。 守心圣主有德，在尾盗贼公行。 绕箕水灾人散，入斗登位无争。 环牛贼臣谋主，犯女暴贵纵横。 乘虚风寒米贵，入危公役灾生。 犯室广修宫殿，绕壁道术彰明。 乘奎女贵水涌，守娄奸诈臣生。 勾胃水饥兵乱，勾昴将出西征。 犯毕公侯受废，乘赀邑破人惊。 环参大臣出使，入井炎旱灾并。 在鬼臣佐异谋，犯柳天下和平。 留星万方皆理，居张五谷不停。 入轸谷伤兵起，守翼寰宇廓清。 掩钺大臣诛戮，犯法将相忧烹。 凡厥在位，知几知微，克勤奉法，敬天之威福，延胤祚邦家之基。 土星铁身，所到宿分，不修德政，其地灾殃。 若宫宿阔远，灾乃十年； 或乃诸侯死丧，百姓饥俭。 不顺国命，则兴攻战之灾。 土主不修令德，则水早不调，虫伤谷麦。 修福，则加官益禄。 到人本命生宿，则为大灾，或父母丧亡，或兄弟离析，失官落职，发旧口舌，令人孤俩。 其所禳法，宜转金简玉经，着皂衣服，宜乘骊马，烧安息香，施鱼鳖食，设水府，醮造功德，则吉。 西方太白星，一名金星，一名长庚，一名那颉，主西蕃胡人也。 太白之星，少阴之精，白帝之子，亦日长庚，所主者义。 其大而明，将军之象，诛罚为名。 怒则芒救叱咤，喜则敛角潜形。 过火凶丧相次，合水远迩加兵。 犯角天下兵战，入亢水贼并生。 守氏将军受封，居心虫火纵横。",
      "translated_text": "When it lingers or trespasses, it brings calamity; when it encircles, it brings disaster. When it emerges, war stirs; when it withdraws, war subsides. Its circling and halting bring illness and mourning. This arises from the ruler’s negligence and arrogance, causing ministers and subjects to suffer harm. Whether advancing or retreating, its movements are unpredictable in scale—now bringing floods, now drought, prosperity and scarcity alternating in turn. It appears swiftly at dawn and ascends gradually at dusk. Its comings and goings defy measure: now present, now absent; now enraged, now seething; now horned, now radiant.\n\nWhen it enters the Palace of Supreme Subtlety, the elder sister of Marquis Wen of Wei perishes; when it trespasses the Purple Forbidden precincts, a king dies. If it lingers over the Celestial River, floods surge; if it resides in the Stomach constellation, the realm’s granaries stand empty. Should it pierce the Feathered Forest, forbidden troops muster; if it tarries in the Spread constellation, the year is bountiful and the people prosper. Entering the Southern Dipper brings disaster to the chief minister; trespassing the Eastern Well brings water and fire omens. Dwelling in the Lesser Subtlety, recluses face peril; encircling the Celestial Orchard, the myriad households suffer famine. Circling the Ghost constellation, war and mourning arise together; entering the Pleiades, the northern barbarians lie in ambush. Residing in the Heart constellation, the ruler detests it; trespassing the Yellow Dragon, the empress and consorts grow anxious. Trespassing the House constellation, rice becomes tenfold in price; ascending the Rooftop, war erupts in the southern lands. Dwelling in the Tail, ministers grow disobedient; entering the Horn, generals are executed or wounded. Trespassing the Neck and the Throat, cities are submerged; trespassing the Ghost, the dead lie in sight of one another. Lingering in the Straddler, fathers disown sons; trespassing the Chariot, ministers rebel against the king. Ascending the Void, the ruler must go forth himself; dwelling in the Net, borderlands face surrendering troops. Entering the Wall, worthy scholars remain obscure; lingering in the Three Stars, war rages on all sides. Touching the Woman, cloth and silk become exorbitantly dear; dwelling in the Ox, the six livestock perish. Trespassing the Willow, famine and drought cost lands; trespassing the Horn, war erupts within the palace walls. Entering the Chariot-spokes, all people are conscripted; trespassing the Bond, troops march forth in strength. When it moves in reverse through the Dipper or encircles the Chamber, ministers flee, fathers and sons are torn apart. Traversing the heavens, the realm seethes like a boiling cauldron; lingering in the Winnowing Basket, people eat chaff and bran.\n\nFor rulers of lands, how can they not be vigilant? By restraining the self and returning to ritual, their posterity shall surely flourish. Let the ruler and father on high cultivate great blessings; let ministers and sons stand as if before an abyss. Thus, malevolent disasters shall vanish of themselves, and the celestial emolument shall endure forever.\n\nWhen the Fire Star lingers over a land’s celestial division, it often brings fires, sores and swellings, disputes and slander, upheaval and change, as well as subordinates plotting against superiors and sudden terrors. If it reaches one’s natal constellation, it induces madness, feverish illnesses, and cautions against bows, arrows, blades, and staves—lest wounds and bloodshed occur—and against eerie, portentous speech. To avert its baleful influences, one should receive talismans upon red garments, distribute red adzuki beans to the poor, hang crimson banners, perform lamp-lighting meritorious deeds, recite scriptures inscribed on golden tablets and jade slips, light star lamps, and offer earth from one’s home—all bring good fortune.\n\nThe Central Quelling Star, also called the Earth Sentinel or the Rooster Exchange, governs Zhou and Liang. Here is the Quelling Star, the essence of Earth in the center, the son of the Yellow Emperor, also named the Earth Sentinel. The land where it resides must not be invaded. Its division suffers no disasters, and the five grains ripen in abundance. The ruler enjoys prosperity and joy, for his virtue is steadfast. If the ruler lacks inner benevolence and righteousness yet adorns himself with outward splendor, the star strays from its course, becoming ominous and perverse. Above, chaos reigns; below, strife erupts; east and west rebel. Heaven sends down disasters—hail and ceaseless rain, mountains collapsing, earth splitting, ghosts wailing in lament.\n\nWhen it trespasses Wood, the empress and consorts fall; when it conjoins Water, armies suffer defeat after defeat. Touching the Horn, the rear palace rejoices; entering the Throat, the myriad things fail to thrive. Trespassing the Chamber, war erupts and the earth quakes; passing through the Root, the heir apparent rejoices. Dwelling in the Heart, the sagely ruler enjoys virtue; in the Tail, bandits roam openly. Circling the Winnowing Basket, floods scatter the people; entering the Dipper, ascension to the throne faces no contention. Encircling the Ox, treacherous ministers plot against the ruler; trespassing the Woman, the violent and powerful run rampant. Ascending the Void, wind and cold bring dear rice; entering the Rooftop, public corvée brings disaster. Trespassing the House, palaces and halls are extensively renovated; circling the Wall, the arts of Dao flourish. Ascending the Straddler, noblewomen grow powerful and floods surge; dwelling in the Bond, deceitful ministers arise. Trespassing the Stomach, floods, famine, and war bring chaos; trespassing the Pleiades, generals march west. Trespassing the Net, dukes and marquises are deposed; ascending the Chariot, cities fall and people panic. Circling the Three Stars, great ministers are dispatched; entering the Well, scorching droughts and disasters converge. In the Ghost, ministers and aides hatch treacherous schemes; trespassing the Willow, the realm enjoys peace. When the star lingers, all directions are governed; dwelling in the Spread, the five grains never cease. Entering the Chariot-spokes, harvests suffer and war erupts; dwelling in the Wings, the world is purged and cleared. Obscuring the Battle-axe, great ministers are executed; trespassing the Law, chief ministers face the cauldron.\n\nFor all who hold office, know the subtle and the minute. Be diligent in upholding the law, revering Heaven’s majesty and blessings, and extending the foundations of state and family.\n\nThe Earth Star has an iron body. Wherever it resides, if virtue and governance are not cultivated, that land suffers disaster. If the constellation it occupies is vast and distant, the calamity may last a decade; or it may bring the deaths of feudal lords and the hunger and want of the common people. If the land does not heed the celestial mandate, war and strife shall arise. If the Earth Star’s virtue is not cultivated, floods and droughts shall not be regulated, and insects shall damage the grains and wheat. If blessings are cultivated, one gains office and emolument.\n\nIf it reaches one’s natal constellation, great disaster strikes: parents may die, siblings may scatter, one may lose office and rank, old disputes may resurface, and one may become orphaned and alone. To avert its baleful influences, one should recite scriptures inscribed on golden tablets and jade slips, wear black garments, ride a black horse, burn benzoin incense, offer fish and turtle as food, establish a water shrine, and perform meritorious rites—all bring good fortune.\n\nThe Western Venus Star, also called the Metal Star, the Long-Lived, or the Radiant One, governs the western barbarians and the Hu people. The Venus Star is the essence of Lesser Yin, the son of the White Emperor, also called the Long-Lived. It governs righteousness. When large and bright, it resembles a general, renowned for executing punishments. When enraged, its rays blaze and it roars in fury; when pleased, its horns retract and it hides its form. Passing Fire brings successive funerals; conjoining Water brings war near and far. Trespassing the Horn, the realm wages war; entering the Throat, water bandits arise together. Dwelling in the Root, generals receive enfeoffment; residing in the Heart, insects and fires run rampant.",
      "overlap_context": "ern Sparkling Deluder Star, also called the Fire Star, the Cloud River, or the Punishment Star, belongs to the South and governs Chu and Yue.\n\nThe essence of the South is also called the Punishment Star, the son of the Vermilion Emperor, who oversees scrutiny and illumination. Each year, in the tenth and eleventh months, it enters the first palace of the Supreme Subtlety to receive its mandate. It does not tarry in the lands of the virtuous but moves in and out of the domains of the unrighteous.",
      "start_char": 704,
      "end_char": 1928,
      "start_sentence": 59,
      "end_sentence": 132,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.79437732696533,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\赞颂类\\太上洞神五星赞.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "在房土功干国，犯尾失政人争。 守箕风旱有赦，入斗灾祸难平。 环牛地炁发泄，抵女府库皆倾。 乘危将军解甲，犯室武士休征。 入奎川源泛溢，守壁国用严刑。 乘娄白衣有会，入胃守内安宁。 犯昴胡兵大起，守毕有赦兵行。 乘赀参野有易政，历井鬼臣将忧并。 入柳元戎益封，留星战死连营。 勾翼轸诸侯大振师旅，入轩辕人主建筛悬旌。 守天田人受爵禄，当午地戎虏肆意峥嵘。 失舍邪亡军破，不见杀将屠城。 或山崩四面，执役侵贵。 君柔臣强，兵锋转战。 互执台权，祆祥屡见。 臣节见亏，主心邪变。 呜呼，有土之君，股肱之臣，不僭不滥，敬天畏神。 道以理国，德以匡身。 福留后嗣，化及人民。 金星太白大将军，主义主伐主兵革。 八年一周天，所临宿分，多兵革焉。 临人本命宿，则好邪行音乐也。 所禳之法，宜讲武教旗吉。 北方辰星，一名水星，一名嘀，属北方，主燕、赵。 北方辰星，亦日水精，黑帝之子，偏将之形，所主者听。 伺察君臣之情，所在之位，忧而不宁。 君若审其法度，明其教令，远其谗邪，亲其忠正，无纵欲逸，邦家之庆。 君若不理城阙，不任贤臣，纵舍由己，呢比小人。 上天垂象，灾及其邻，五谷不稔，风雨不均，阴阳错乱，饥寒荐臻。 与金合而干戈动，被土犯而元戎厄。 睹芒角而知大小灾，祥审伏见察君臣谴谪。 暴水涨而色青，大丧。 发而虚白，其顺也。 春晨而秋夕，其为也。 冬温而夏寒，逼太阳而掩映，接少阴而交欢。 守角刑速而水灾，留亢米谷腾涌。 在心天下太平，守房奸臣谋动。 居尾江海横流，入箕大人忧戄。 犯虚宿万里赤地，乘斗牛百川央壅。 凌女布帛倍贵，守危乱臣继。 缠入奎臣下被囚，守胃兵水人愁，绕毕边兵惊速，在昴执政刑流。 勾觜兵灾为孽，入井水土相雠。 乘参入鬼水灾兵起，疾疫多忧。 留柳星贵臣得罪，守轸翼宗庙宜修。 逼太微群臣相害，守轩辕后族多仇。 入壁朝廷咸戄，犯氏狱诉稽留。 居张贵臣专国，犯室后党被收。 守娄水败万物，在建相赞难休缅。 惟有土敬，慎其仪，兢兢栗栗，居安苦危，勤修令德，福履绥之。 水星枢相也，主天王秘要，改受侯伯爵禄之事、一年一周天，所到分野，多主水灾、兵起、妖言，或人令心不定，好食辛酸。 所禳之法，宜筑城池，开渠引水，则吉。 太上洞神五星赞竟",
      "translated_text": "When it resides in Room, earthworks drain the state; trespassing Tail, governance falters and people contend. Dwelling in Winnowing Basket brings wind and drought, yet amnesty follows; entering Dipper, calamities remain unresolved. Encircling Ox, earth’s qi dissipates; reaching Girl, treasuries empty entirely. Mounting Danger, generals lay down armor; trespassing Chamber, warriors cease campaigns. Entering Stride, rivers overflow their sources; guarding Wall, the state enforces harsh punishments. Mounting Bond, white-robed assemblies convene; entering Stomach, the inner realm finds peace. Trespassing Mane, Hu armies surge greatly; guarding Net, amnesties accompany military marches. Mounting Turtle, the wilds see political change; passing Well and Ghost, ministers and generals share anxieties. Entering Willow, the primary general gains enfeoffment; lingering in Star, death in battle spreads through encampments. Hook and Wing—feudal lords greatly mobilize troops; entering Imperial Chariot, the sovereign raises sieves and hangs banners. Guarding Heavenly Field, recipients receive ranks and emoluments; at high noon, earthly barbarians run rampant with unchecked ferocity. Losing lodging, evil perishes and armies break; unseen, generals are slain and cities razed. Should mountains collapse on all sides, corvée labor encroaches upon the noble. When the lord is yielding and ministers strong, the blade of war turns in battle. When power is seized by rival factions, omens of disorder repeatedly appear. When ministers’ integrity falters, the lord’s heart turns to perversity.\n\nAlas! Lords who hold land and ministers who serve as pillars of state—let them neither overstep nor exceed, but revere Heaven and stand in awe of the gods. Govern the state through the Dao, and rectify the self through virtue. Then blessings will endure for descendants, and transformation extend to the people.\n\nThe Venus Star, the Great General, governs righteousness, punitive expeditions, and warfare. It completes one celestial circuit every eight years; wherever it transits among the lodgings, warfare often follows. When it passes over one’s natal star, one indulges in depravity, music, and licentiousness. The method of averting its influence lies in promoting martial teachings and auspicious banners.\n\nThe Northern Chronographic Star, also called the Water Star or *Di*, belongs to the north and governs the lands of Yan and Zhao. The Chronographic Star, also known as the essence of Water, is the son of the Black Emperor, taking the form of a deputy general, and governs hearing. It scrutinizes the sentiments of lord and ministers; wherever it resides, there is anxiety and unease. If the lord examines his laws and decrees, clarifies his teachings, distances slanderers, and embraces the loyal and upright, curbing indulgence and excess, then the state and family will prosper. But if the lord neglects city walls, fails to employ worthy ministers, follows his own whims, and befriends petty men, then Heaven’s portents descend, disasters strike his domain, the five grains fail to ripen, wind and rain fall unseasonably, yin and yang fall into disorder, and famine and cold press upon one another. When it conjoins Metal, weapons stir; when trespassed by Earth, the primary general faces calamity. By observing its rays and horns, one discerns the scale of disasters; by carefully noting its concealments and appearances, one examines the reproaches of lord and ministers. When violent waters rise and its color turns green, great mourning follows. When it appears pale and hollow, this is auspicious. Rising at dawn in spring and setting at dusk in autumn, it fulfills its course. When winter grows warm and summer cold, it encroaches upon Greater Yang and obscures its light, or approaches Lesser Yin and exchanges embraces. Guarding Horn hastens punishments and brings water disasters; lingering in Throat causes grain prices to soar. Residing in Heart, the realm enjoys great peace; guarding Room, treacherous ministers plot. Dwelling in Tail, rivers and seas overflow; entering Winnowing Basket, great men grow anxious. Trespassing Void, the land turns red for a thousand miles; mounting Ox and Cow, a hundred rivers dam and flood. Encroaching upon Girl, cloth and silk double in price; guarding Danger, rebellious ministers rise in succession. Entwining Stride, ministers below are imprisoned; guarding Stomach, warfare and floods bring people sorrow. Circling Net, border armies are swiftly alarmed; residing in Mane, the administration’s punishments run rampant. Hooking Beak brings calamitous warfare; entering Well, water and earth become adversaries. Mounting Turtle and entering Ghost bring water disasters and war, with epidemics and many worries. Lingering in Willow, high ministers incur guilt; guarding Wings, ancestral temples require repair. Encroaching upon the Supreme Palace, ministers harm one another; guarding Imperial Chariot, the empress’s clan harbors many feuds. Entering Wall, the court trembles in fear; trespassing Chamber, lawsuits stall in prison. Residing in Spread, high ministers monopolize the state; trespassing Room, the empress’s faction is seized. Guarding Bond, water ruins all things; in Establishment, the prime minister’s praise is ceaseless.\n\nOnly through reverence for Earth, careful observance of ritual, trembling with caution, dwelling in peace yet mindful of peril, and diligently cultivating commanding virtue may one secure blessings and peace.\n\nThe Water Star is the pivot of the ministers, governing the Son of Heaven’s secret essentials, the conferral and reception of marquisates and earldoms, and the affairs of the year. It completes one celestial circuit annually; wherever it transits in the field divisions, it often brings water disasters, warfare, ominous rumors, or unsettles people’s hearts, inclining them toward sour and pungent flavors. The method of averting its influence lies in constructing city walls and moats, and digging channels to divert water—then fortune follows.\n\nHere ends the *Eulogy of the Five Stars* from the *Supreme Cavernous Divine*.",
      "overlap_context": "d. It governs righteousness. When large and bright, it resembles a general, renowned for executing punishments. When enraged, its rays blaze and it roars in fury; when pleased, its horns retract and it hides its form. Passing Fire brings successive funerals; conjoining Water brings war near and far. Trespassing the Horn, the realm wages war; entering the Throat, water bandits arise together. Dwelling in the Root, generals receive enfeoffment; residing in the Heart, insects and fires run rampant.",
      "start_char": 1928,
      "end_char": 2813,
      "start_sentence": 133,
      "end_sentence": 184,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.402202129364014,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\赞颂类\\太上洞神五星赞.txt",
        "category": "赞颂类"
      }
    }
  ]
}