{
  "source_id": "太上洞玄灵宝法烛经",
  "source_file": "chunked_daozang\\太上洞玄灵宝法烛经.json",
  "total_chunks": 4,
  "total_original_chars": 3929,
  "total_translated_chars": 22863,
  "total_translation_time": 107.54910373687744,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝法烛经.txt",
    "category": "本文类"
  },
  "full_translation": "**The Supreme Cavern Mystery Numinous Treasure Dharma Candle Sutra**\n\n**Sutra Title:** *The Supreme Cavern Mystery Numinous Treasure Dharma Candle Sutra*. The compiler is unknown, though it likely emerged during the Sui or Tang dynasties. It expounds the essentials of Numinous Treasure purification and precepts, closely resembling Lu Xiujing’s *Ritual Explanation of the Numinous Treasure Purification: Light, Candle, Precepts, Penalties, Lamps, and Vows*. One scroll. Source text: *Daoist Canon of the Zhengtong Era*, Cavern Mystery Section, *Benwen* Category.\n\n---\n\n### **The Dharma Candle**\n\n**Dharma** refers to rules and standards, collectively termed \"Dharma.\" The compass draws circles, the square marks angles—all things attain correctness through them.\n\n**Candle** denotes an object that emits light, assisting the moon and continuing the sun, dispelling darkness and illuminating obscurity. By its brightness, one gains vision.\n\nCrookedness lacks Dharma and thus cannot rectify itself; applying Dharma without clarity fails to reveal gains and losses. To rectify, one cannot be without Dharma; to apply Dharma, one cannot be without illumination. To stabilize oneself, one must purify; purification cannot proceed without encountering this sutra. This sutra thus serves as the candle of Dharma. Holding fast to it and traversing the Daoist canon, one attains true realization.\n\n---\n\nThe Dao declares: Among all things, humans are most noble; among humans, life is most precious. Life depends on nothing but spirit and qi. Spirit and qi within the body govern the vitality of the four limbs. One cannot be without qi for even a moment, nor lose spirit in movement or stillness. Losing spirit causes the five viscera to decay; losing qi leads to collapse and death. Qi and spirit always move in tandem—spirit and qi rely on each other to strengthen. When spirit departs, qi perishes; when qi severs, the body is lost.\n\nAll know to fear death and delight in life, yet fail to recognize that the work of living lies in spirit and qi. Instead, they repeatedly harm their minds, violate their qi, indulge their spirits, and carve away their lives. They do not cherish stillness or preserve their true nature, thus inviting ruin and decay.\n\nHow can one not treasure essence and guard qi to seek prolonged vision? Harmonizing and nurturing all things brings the blessings of branches and leaves.\n\nThe sages, seeing the common people rushing after the five desires and unable to stabilize themselves, established purification rites. Through addressing affairs, they ceased affairs; through precepts, they restrained inner bandits; through dignity, they guarded against external thieves. Chanting and recitation engage body and speech, guiding movement back to stillness. Meditating on the spirit engages the mind, steering existence toward emptiness. In stillness and emptiness, one merges with the Dao—like reining in the hooves of a swift steed to align the chariot of returning to truth.\n\nYan Zun said: \"Empty the heart to trace the origins of Dao and virtue; still the qi to await the numinous brightness.\" This is the meaning.\n\nYet in the degenerate age, scholars value ornament over substance. Blessings lie in stillness, yet they seek them in motion; life rests within, yet they abandon the self for external things. Such people, though eager to practice purification, do not understand its methods. Or they understand the methods but not its essence; or grasp its essence but not its meaning; or comprehend its meaning but not its intent. Confused and disordered, they act without restraint, drifting astray and losing their foundation, forever unaware. Like sailing against a gale while following a swift current, they do not know to turn back to the source, thus sinking forever in the sea of suffering. How can this not be lamentable? How can it not be grievous?\n\nTherefore, this sutra expounds ten chapters to be applied during purification rites, titled *The Dharma Candle*. One chapter on preliminary invocation, six chapters on the six periods of ritual practice, and three chapters on the three periods of spirit meditation. If the Dharma master illuminates these while conducting purification and presiding over the altar, and the assembly receives them with empty minds and solemn vows, then their vision and hearing will be clear, and they may glimpse the gate of the Great Dao.\n\n---\n\nThe Dao declares: **Dao** is the name for the ultimate principle. **Virtue** is acting in accordance with principle. **Sutra** is the path of passage.\n\nDao is like a road; virtue is good virtue; sutra is like a measured path; practice is like walking; Dharma is like a model. Those who study the Dao must rely on Dharma to seek the sutra, practice goodness to cultivate virtue, and thus attain the Dao. Without performing meritorious deeds but merely holding to one thing without deviation, one will never achieve the Dao—like sitting at home without walking, how can one reach the destination?\n\nThe Dao is completed through the union of three to form virtue. If virtue is not fulfilled by three, nothing can be accomplished. The three are: Dao, virtue, and the person. The person is one; practicing meritorious deeds is two; virtue sufficient to complete the Dao is three. Only when these three unite does one attain the Dao.\n\nIf one merely performs meritorious deeds but does not understand the Dao, one will not attain it. If one merely understands the Dao but lacks meritorious deeds, one will not attain it. If there is Dao and Dharma but no person, then the ultimate principle is obscured and returns to nothingness—like planting grain, sowing seeds in the earth without water to moisten them, how can they grow? With ruler and minister but no people, how can governance proceed? With heaven and earth but no beings, how can nurturance be fulfilled? Thus it is said: \"The three generate the myriad things.\"\n\n---\n\nThe Dao declares: Those who wish to govern others must first govern themselves; those who wish to rectify others must first rectify themselves. To govern the body and rectify the heart, nothing precedes purification and uprightness.\n\n**Purification** means alignment—aligning the uneven conduct of people. **Uprightness** means rectification—rectifying the hearts of people entering the Dao. Pure thoughts and tranquil spirit are the meaning of purification.\n\nThe purpose of purification is that human life is burdened by the four great afflictions. When hungry, one worries about food; when cold, one worries about clothing. Once clothing and food are sufficient, one worries about accumulation. The poor desire wealth; the lowly desire nobility. Thus, cravings for flavors, sounds, and sights multiply. Before attainment, one worries about failure; after attainment, one worries about loss. The mind has no moment of stability, and one toils in anxiety throughout life.\n\nIn restless striving and competitive action, affairs accumulate in turmoil. Right and wrong, gain and loss, sorrow and joy, anger and delight, thoughts and anxieties swirl in confusion. The body labors, the spirit suffers, the Dao’s qi distances itself, the hun and po depart, the body becomes an empty city, and malevolent forces daily encroach. Illness and misfortune befall, life is cut short, and the body perishes, suffering the punishments of the three paths, with calamities flowing into future generations.\n\nThus, the sage establishes purification through fasting and stillness, casting aside worldly toil, summoning back the hun and po, and resting the spirit. One must be utterly sincere, reverent, and solemn, refraining from speech and ceasing idle chatter, avoiding jest and laughter, and any cause for reproach. Banish stray thoughts and chaotic notions; let the eyes not gaze upon forms, nor witness right and wrong. Let the ears not listen to sounds, nor hear of ill or auspicious omens. With detachment as the heart’s disposition and emptiness as its intent, harmony as its guiding principle and moderation in food as its foundation, one contemplates the Dao and preserves the spirit. Then, heaven and humanity resonate, disasters vanish, blessings descend, and one attains the nature of life.\n\nThus it is said: *Stillness is the rectitude of all under heaven.*\n\nThe Dao declares: *In fasting, merely cultivate correctness. Heaven and earth become serene. Cut off thoughts utterly, and with a single thought, union is achieved.* The qi of the Dao flows freely, entering the human path. The generals, officials, and soldiers one receives will guard and protect, heeding one’s commands, fulfilling every wish.\n\nIf one cannot maintain stillness but instead is restless and overburdened with cares, violating harmony and defying the natural order, offending the hidden laws, lacking good conduct, and refusing to amend an evil heart, then the officials and soldiers will abandon and no longer serve. One’s requests will go unfulfilled, and misfortunes will converge.\n\nThus it is said: *One governs all under heaven by acting without contrivance.*\n\nThe Dao declares: *Fasting may be called the ordering of a hundred practices, the establishment of ten thousand virtues.* One must be able to endure humiliation, to be yielding and gentle, to be compassionate and loving, to be benevolent and giving, to accumulate hidden merits, to be loyal and filial, to be utterly sincere, to be cautious and trustworthy, to be vigilant and reverent. Only after mastering these ten abilities may one engage in fasting and tranquil reflection, turning inward to listen and gaze within, returning awareness to the body’s form. The mouth does not speak idly, the body does not move recklessly.\n\nThus, the formless is perceived as form, the soundless is heard as sound, the tasteless is savored as sweetness, and the wordless is answered in kind. The divine descends, blessings converge, and one attains a heart transformed and a mind sanctified. Auspicious dreams and visions appear, one discerns omens of what is yet to come, and no wish goes unfulfilled—this is the proof.\n\nIf outwardly one fails to uphold dignified conduct and inwardly neglects the precepts, with no deeds worth recording and no merits worth manifesting, lacking sincerity and wavering in doubt, with inner and outer in discord, words and heart at odds, temperament hasty and nature perverse, given to duplicity and double-tongued speech, harboring secret curses and envy, thoughts misaligned with the self, spirit dissipated in excess and desire, coveting wealth and lusting after beauty, unable to master body and mind—then, though one may fast, one will gain no blessing throughout life.\n\nWhy is this so? Because the mind does not abide within, the hun and po are labored and scattered without, and harmonious qi departs. Thus, nothing can be moved to resonance.\n\nThus it is said: *Eliminate desire to attain stillness, and all under heaven will be rectified.*\n\nThe Dao declares: *In practicing the Dao through fasting, one must uphold the precepts and broadly deliver all without limit.* The subtle and wondrous prohibitions restrain and gather the mind’s impulses, subduing the heart to attain purity. Calamities and defilements vanish. One employs the expedient means of wisdom, extricating oneself from the difficulties of birth and death, cutting off all thoughts, and entering the realm of non-action. Observe deeply the arising, examine closely the ceasing, discern the afflictions, and heal them with the medicine of kindness.\n\nIf one sees forms of profit, cover the eyes with admonition. If one hears resentful or hateful words, block the ears with admonition. If one tastes sweet and fragrant delicacies, restrain the mouth with admonition. If one craves wealth and treasures, indulging in love and desire, curb the heart with admonition. If one intends to commit transgressions or pursue evil deeds, break the feet with admonition. Having grasped the essentials, if the body does not transgress the precepts, one transcends the snares of the world and does not enter its dust.\n\nAmidst the throng of worldly attachments, the heart abides in the treasury of the Dao’s precepts. In the dwelling of sorrow and adversity, the heart rests in the hall of benevolent deliverance. In the chamber of darkness, the heart stands at the threshold of extinction. Beneath the unstable roof, the heart dwells at the gate of expedient means. Upon the ground of serpents and vipers, the heart treads the path of renunciation. In the lair of tigers and leopards, the heart resides in the abode of blessings and virtue. Aboard a perilous floating vessel, the heart is steadfast on the way to self-deliverance. Near the blazing forest, the heart focuses on the essentials of quenching. In the thorny garden, the heart stands behind the shield of vigilance. This is how I uphold the precepts and employ the expedient means of wisdom.\n\nThus it is said: *Blunt the sharpness, untangle the knots.*\n\nThe Dao declares: *The way of humanity is founded upon three dependencies and five regulators.*\n\nWhat are the three dependencies? The first is spirit, the second is qi, and the third is form. Spirit stands through qi, qi moves through spirit, form exists through spirit, and spirit is stored through form. When spirit departs, qi scatters; when qi scatters, form perishes. Thus, the sage first nurtures the spirit, then nurtures qi, and then nurtures form. When these three are harmonized and mutually attuned, one may attain longevity.\n\nWhat are the five regulators? The first is essence, which governs the perception of the five colors; the second is spirit, which governs the hearing of the five sounds; the third is the hun, which governs the discernment of good and evil; the fourth is the po, which governs the examination of purity and turbidity; the fifth is qi, which governs the recognition of pain and itching.\n\nThus, the body is the dwelling of spirit and hun. The five viscera are the chambers of essence and hun. The nine orifices are the doors and windows of spirit and qi. When a person’s eyes see, ears hear, nose breathes, mouth speaks, and body senses pain and itching, all these are the workings of spirit, essence, hun, po, and qi. If one of these is absent, one becomes foolish; if two are absent, one becomes confused; if three are absent, one declines and weakens; if four are absent, a hundred illnesses arise; if five are absent, one dies.\n\nIn death, the eyes can no longer see, the ears can no longer hear, the nose can no longer breathe, the mouth can no longer speak, and the body no longer senses pain or itching. Is this because the eyes, ears, nose, mouth, and body no longer exist? It is simply that spirit, essence, hun, po, and qi have departed.\n\nThus, joy and anger scatter essence so that it is not stored; sorrow and worry obstruct the spirit so that it does not flow; fright and terror cause the hun and po to fly away; excessive eating and drinking stagnate the form and block the qi.\n\nThus, the sage observes: those who lose their spirit die young; those who lose their essence go mad; those who lose their hun weep in sorrow; those who lose their po grow pallid; those who lose their will become disordered; those who lose their intent become listless.\n\nTherefore, empty the heart and dispel desires, blunt sharpness and resolve entanglements. Do not let fondness for beauty and excess harm the essence; do not let thoughts of love and hatred harm the spirit; do not let joy and pleasure in unrestrained postures harm the hun; do not let fury and rage in vehement outbursts harm the po; do not let immoderate eating and drinking harm the form; do not let extreme sorrow and lamentation harm the qi.\n\nInstead, dwell in tranquility and seclusion, harmonize with the qi of Heaven and Earth, preserve it within the body, follow the four seasons, adapt to cold and heat, regulate yin and yang, balance joy and anger, moderate food and drink, adjust sorrow and suffering, avoid mist and dew, escape wind and rain. Treasure qi and replenish essence, nourish the hun with the spirit of the valley. Inwardly, see as though blind; reverse hearing as though deaf. Be empty and indifferent, unattached to east or west. Within, preserve the five viscera, distinguishing their colors and forms.\n\nPreserving the heart augments essence; preserving the liver augments clarity; preserving the lungs makes the body radiant; preserving the spleen makes the body light; preserving the kidneys lengthens the qi. When spirit and qi are guarded within, where can illness arise?\n\nThus it is said: \"The spirit of the valley never dies.\"\n\nThe Dao teaches: humans receive the five viscera, endowed by the five phases. Externally, they form the body; internally, they shape temperament. Bones belong to Wood; blood to Water; flesh to Earth; teeth to Metal; warmth of qi to Fire. The liver embodies benevolence; the lungs, righteousness; the heart, propriety; the kidneys, trust; the spleen, wisdom. The nature of Wood is strong and upright; Fire, fierce and intense; Earth, kind and harmonious; Metal, stern and keen; Water, modest and retiring.\n\nMoreover, at the inception of endowment, each possesses purity or turbidity, hardness or softness. Those endowed with pure qi are wise, sagely, and enlightened. Those with soft qi are gentle, harmonious, compassionate, sincere, and honest. Those with hard qi are lofty, stern, and heroic. Those with turbid qi are foolish, cruel, and violent. Each follows its endowment to determine temperament.\n\nTemperament is destiny. The foolish indulge it and shorten their lives; the wise deeply perceive and restrain their nature. They rectify the heart and conduct, reverently contemplate the supreme Dao, examine and perceive the original heart, and ensure all actions accord with the Dao. Where nothing is possessed and nothing is discordant, they use the laws of Heaven to restrain and sever their fundamental nature, transform their temperament, subdue their hearts, follow the teachings of their masters, and submit their lives to the venerable masters, never daring to slacken. Thus, heavenly spirits respect them, earthly deities protect them, the malevolent and rebellious fear them, venerable masters aid them, the Controller of Destiny records them, inscribing their names in the left register. The Southern Dipper records their names in the register of life; the Northern Dipper erases them from the ledger of death. They become perfected beings.\n\nSubduing nature and bearing destiny—this is what it means.\n\nThus it is said: \"Returning to destiny is called constancy. Not knowing constancy, reckless action brings misfortune.\"\n\nThe Dao teaches: to guard the Dao and meditate in stillness, first sit upright, close the gates of ears and eyes, and return the radiance of spirit to the Crimson Palace. Sever all thoughts; do not forcefully fix the gaze or allow wandering thoughts. Gradually, the breath becomes subtle. Continuing thus, one naturally ceases to be aware of breathing. Unaware of breath, one no longer perceives the body. To forget the body is to attain stability, the gateway to the Dao.\n\nAt such a time, the spirit resides in the emptiness of Heaven, gazing left and right without seeing anything—this is the proof.\n\nThus it is said: \"Block the openings, close the gates. Use its light, return to its radiance.\"\n\nThe Dao teaches: within the human body are the Three Ones—spirit, hun, and po. The central One is the spirit, the essence of harmony, its qi upright. The left One is the hun, the essence of pure yang, its qi clear. The right One is the po, the essence of pure yin, its qi turbid. The central One is my spirit, the child of the Dao. The left and right Ones each assist my spirit. Their qi, clear or turbid, determines whether their actions are good or evil.\n\nThe left One daily urges me toward goodness; its merits grow daily, and I attain the true Dao. The right One daily teaches me evil, drawing me into wickedness. My evil deepens, and I sink into the city of depravity. Those who practice the Dao, desiring to understand these Three Ones, awaken to good and evil, and distinguish right from wrong, must still the body and quiet the mind, diligently study the scriptures, and reflect inwardly. Then wisdom arises naturally. They subdue the five desires, cleanse the six emotions, cultivate goodness, and accumulate merit. Thus, the right One—demons, ghosts, and all evil—will be subdued and unable to disturb them.\n\nWith focused and upright thoughts, resonance is swiftly achieved. If one does not discern right from wrong, lacks good deeds, and forcibly closes the ears and eyes to contemplate the spirit and practice the Dao, then all manner of evil will assail them, generating wicked thoughts. As one thought fades, another arises, endlessly following one after another, without respite. Thus confused and deluded, they remain unsettled for ten thousand kalpas.\n\nThus it is said: \"Embrace the One, cleanse the mysterious mirror.\"\n\nThe Dao teaches: humans possess spirit, essence, hun, and po, their bodies distinct from common creatures. Their nobility aligns with Heaven and Earth in the Dao; their worth unites with the divine in virtue; their clarity connects with the sun and moon in perception. If they can still the form and settle the mind, purify with sincerity and observe the fast, revere the Three Treasures, and deeply recognize the positions of the celestial officials and soldiers, they may return their radiance to inwardly observe the palaces within the body, preserve the dwelling places of the divine luminaries, and constantly seek the true in emptiness, the existent in nothingness. Then, the heights of the nine heavens may be illuminated, the depths of the nine earths may be seen, the mysterious essence may descend, and the Primordial Beginning may be received.\n\nThe Most High is most honored and manifests through utmost sincerity; the Dao of life is most weighty and responds to utmost sincerity. Thus, those who seek life arise from within the abdomen. Within a single form, one knows the body of Heaven and Earth, encompassing eighty-one domains, containing the four seas and five peaks. Clouds rise and rain falls through exhalation; moisture and fluids gather through inhalation. The form remains while the spirit travels, swift as pointing to the palm.\n\nSeated in cultivation within the chamber of the heart and breast, one may yet attain blessings beyond the eight extremities. When spirit harmonizes and mist gathers, it arises from unwavering purity. In a single moment, calamities dissolve and longevity is attained—everlasting life lies within oneself.\n\nThus it is said:\nWithout gazing through the window, one sees the Dao of Heaven.\nWithout stepping beyond the door, one knows all under Heaven.\n\nThe *Most High Cavernous Mystery Numinous Treasure Dharma Candle Sutra* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上洞玄灵宝法烛经 经名：太上洞玄灵宝法烛经。 撰人不详，似出於隋唐。 尝灵宝斋戒要旨，与陆修静《灵宝斋说光烛戒罚灯祝愿仪》近似。 一卷。 底本出处：《正统道藏》洞玄部本文类。 太上洞玄灵宝法烛经 法烛 法者，规矩之谓，总称曰法。 规圆矩方，万物从之得正。 烛者，有光之物，佐月嗣日，开昏朗暗，用其明，得有所见也。 邪曲无法，则无以自正，用法无明，则莫见得失。 欲正不可无法，用法不可无明，自定不可不斋，斋不可不见此经。 此经故为法之烛，秉之游道藏，故克获於真实也。 道言：万物人为贵，人以生为宝。 生之所赖，唯神与气。 神气之在人身，为四体之命，人不可须臾无气，不可俯仰失神。 失神则五脏溃坏，失气则颠蹙而亡。 气之与神，常相随而行，神之与气，常相宗为强。 神去则气亡，气绝则身丧。 一切皆知畏死而乐生，不知生活之功，在於神气，而数凶其心，而犯其气，屡淫其神，而雕其命，不爱其静，存守其真，故致於枉残也。 人何可不惜精守气，以要久延之视，和爱育物为枝叶之福。 圣人以百姓奔竞五欲，不能自定，故立斋法，因事息事，禁戒以关内寇，威仪以防外贼。 礼诵役身口，乘动以反静也。 思神役心念，御有以归虚也。 能静能虚，则与道合，譬回逸骥之足，以整归真之驾。 严遵云：虚心以原道德，静气以期神明。 此之谓也。 而末世学者贵华贱实，福在於静而动以求之，命在於我而舍己就物。 若斯之徒，虽欣修斋，不解斋法，或解斋法，不识斋体，或识斋体，不达斋义，或达斋义，不得斋意，纷纭错乱，靡所不为，流宕失宗，永不自觉。 譬背惊风而顺迅流，不知诉洄反源，遂长沦於苦海，可不悲哉。 可不痛哉。 於是说经十章，以施斋时，名曰法烛。 宿启说一章，六时行道说六章，三时思神说三章。 若法师必炳之以行斋临坛法，众皆虚心盟受者，则视听明朗，庶睹大道之门矣。 道言：道者，至理之目。 德者，顺理而行。 经者，由通之径也。 道犹道路也，德谓善德也，经犹径度也，行犹行步也，法犹法式也。 夫人学道，要当依法寻经，行善成德，以至於道。 若不作功德，但守一不移，终不成道。 譬如人坐於家中而不行步，岂得道里耶。 夫道三合而成德，德不满三，诸事不成。 三者，谓道、德、人也。 人，一也。 行功德，二也。 德足成道，三也。 三事合，乃得道也。 若人但作功德，而不晓道，亦不得道。 若但晓道而无功德，亦不得道。 若有道法而无人，则至理翳没，归於无有。 譬如种谷，投种土中，而无水润，何能生乎。 有君有臣而无民，何宰牧乎。 有天有地而无人物，何成养乎。 故曰：三生万物。 道言：欲治人者，当先治身。 欲正人者，当先自正。 治身正心，莫先於斋直。 斋者，齐也，齐人参差之行。 直者，正也，正人入道之心。 念浄神静，斋之义也。 所以斋者，凡人之生有四大之累。 饥则忧食，寒则忧衣，衣食既足，忧当积蓄。 贫者愿富，贱者愿贵。 於是荣味声色，众欲互生。 未得忧不得，既得又忧失，志无须臾之定，乃终身忧勤矣。 动作求竞，事务扰积，是非得失，哀乐喜怒，思虑烦冤，形劳神苦，致道气远己，魂魄离人，身如空城，凶邪日臻，婴痾遇疾，夭命丧身，罹谪三涂，殃流后世。",
      "translated_text": "**The Supreme Cavern Mystery Numinous Treasure Dharma Candle Sutra**\n\n**Sutra Title:** *The Supreme Cavern Mystery Numinous Treasure Dharma Candle Sutra*. The compiler is unknown, though it likely emerged during the Sui or Tang dynasties. It expounds the essentials of Numinous Treasure purification and precepts, closely resembling Lu Xiujing’s *Ritual Explanation of the Numinous Treasure Purification: Light, Candle, Precepts, Penalties, Lamps, and Vows*. One scroll. Source text: *Daoist Canon of the Zhengtong Era*, Cavern Mystery Section, *Benwen* Category.\n\n---\n\n### **The Dharma Candle**\n\n**Dharma** refers to rules and standards, collectively termed \"Dharma.\" The compass draws circles, the square marks angles—all things attain correctness through them.\n\n**Candle** denotes an object that emits light, assisting the moon and continuing the sun, dispelling darkness and illuminating obscurity. By its brightness, one gains vision.\n\nCrookedness lacks Dharma and thus cannot rectify itself; applying Dharma without clarity fails to reveal gains and losses. To rectify, one cannot be without Dharma; to apply Dharma, one cannot be without illumination. To stabilize oneself, one must purify; purification cannot proceed without encountering this sutra. This sutra thus serves as the candle of Dharma. Holding fast to it and traversing the Daoist canon, one attains true realization.\n\n---\n\nThe Dao declares: Among all things, humans are most noble; among humans, life is most precious. Life depends on nothing but spirit and qi. Spirit and qi within the body govern the vitality of the four limbs. One cannot be without qi for even a moment, nor lose spirit in movement or stillness. Losing spirit causes the five viscera to decay; losing qi leads to collapse and death. Qi and spirit always move in tandem—spirit and qi rely on each other to strengthen. When spirit departs, qi perishes; when qi severs, the body is lost.\n\nAll know to fear death and delight in life, yet fail to recognize that the work of living lies in spirit and qi. Instead, they repeatedly harm their minds, violate their qi, indulge their spirits, and carve away their lives. They do not cherish stillness or preserve their true nature, thus inviting ruin and decay.\n\nHow can one not treasure essence and guard qi to seek prolonged vision? Harmonizing and nurturing all things brings the blessings of branches and leaves.\n\nThe sages, seeing the common people rushing after the five desires and unable to stabilize themselves, established purification rites. Through addressing affairs, they ceased affairs; through precepts, they restrained inner bandits; through dignity, they guarded against external thieves. Chanting and recitation engage body and speech, guiding movement back to stillness. Meditating on the spirit engages the mind, steering existence toward emptiness. In stillness and emptiness, one merges with the Dao—like reining in the hooves of a swift steed to align the chariot of returning to truth.\n\nYan Zun said: \"Empty the heart to trace the origins of Dao and virtue; still the qi to await the numinous brightness.\" This is the meaning.\n\nYet in the degenerate age, scholars value ornament over substance. Blessings lie in stillness, yet they seek them in motion; life rests within, yet they abandon the self for external things. Such people, though eager to practice purification, do not understand its methods. Or they understand the methods but not its essence; or grasp its essence but not its meaning; or comprehend its meaning but not its intent. Confused and disordered, they act without restraint, drifting astray and losing their foundation, forever unaware. Like sailing against a gale while following a swift current, they do not know to turn back to the source, thus sinking forever in the sea of suffering. How can this not be lamentable? How can it not be grievous?\n\nTherefore, this sutra expounds ten chapters to be applied during purification rites, titled *The Dharma Candle*. One chapter on preliminary invocation, six chapters on the six periods of ritual practice, and three chapters on the three periods of spirit meditation. If the Dharma master illuminates these while conducting purification and presiding over the altar, and the assembly receives them with empty minds and solemn vows, then their vision and hearing will be clear, and they may glimpse the gate of the Great Dao.\n\n---\n\nThe Dao declares: **Dao** is the name for the ultimate principle. **Virtue** is acting in accordance with principle. **Sutra** is the path of passage.\n\nDao is like a road; virtue is good virtue; sutra is like a measured path; practice is like walking; Dharma is like a model. Those who study the Dao must rely on Dharma to seek the sutra, practice goodness to cultivate virtue, and thus attain the Dao. Without performing meritorious deeds but merely holding to one thing without deviation, one will never achieve the Dao—like sitting at home without walking, how can one reach the destination?\n\nThe Dao is completed through the union of three to form virtue. If virtue is not fulfilled by three, nothing can be accomplished. The three are: Dao, virtue, and the person. The person is one; practicing meritorious deeds is two; virtue sufficient to complete the Dao is three. Only when these three unite does one attain the Dao.\n\nIf one merely performs meritorious deeds but does not understand the Dao, one will not attain it. If one merely understands the Dao but lacks meritorious deeds, one will not attain it. If there is Dao and Dharma but no person, then the ultimate principle is obscured and returns to nothingness—like planting grain, sowing seeds in the earth without water to moisten them, how can they grow? With ruler and minister but no people, how can governance proceed? With heaven and earth but no beings, how can nurturance be fulfilled? Thus it is said: \"The three generate the myriad things.\"\n\n---\n\nThe Dao declares: Those who wish to govern others must first govern themselves; those who wish to rectify others must first rectify themselves. To govern the body and rectify the heart, nothing precedes purification and uprightness.\n\n**Purification** means alignment—aligning the uneven conduct of people. **Uprightness** means rectification—rectifying the hearts of people entering the Dao. Pure thoughts and tranquil spirit are the meaning of purification.\n\nThe purpose of purification is that human life is burdened by the four great afflictions. When hungry, one worries about food; when cold, one worries about clothing. Once clothing and food are sufficient, one worries about accumulation. The poor desire wealth; the lowly desire nobility. Thus, cravings for flavors, sounds, and sights multiply. Before attainment, one worries about failure; after attainment, one worries about loss. The mind has no moment of stability, and one toils in anxiety throughout life.\n\nIn restless striving and competitive action, affairs accumulate in turmoil. Right and wrong, gain and loss, sorrow and joy, anger and delight, thoughts and anxieties swirl in confusion. The body labors, the spirit suffers, the Dao’s qi distances itself, the hun and po depart, the body becomes an empty city, and malevolent forces daily encroach. Illness and misfortune befall, life is cut short, and the body perishes, suffering the punishments of the three paths, with calamities flowing into future generations.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1246,
      "start_sentence": 0,
      "end_sentence": 66,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.377386808395386,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝法烛经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "是以圣人立斋清浄，屏遣尘劳，具录魂魄，休息精神，当至诚恭肃，绝语止谊，不得戏笑，有所呵谴，及杂想乱念，目不视色，不见是非耳。 不听音，不闻凶祥，以淡泊为心，虚无为意，中和为主，少食为本，念道存神，则天人相感，灾除福降，性命得矣。 故曰：清浄为天下正。 道言：斋但修正，天地寂然，绝思无所，一念即合。 道气流行，入人道中，所受将军、吏兵则卫护，听人驱使，万向如愿。 若不能清净，而躁扰多虑，违和犯顺，忤逆冥科，身无善行，心恶不改，则吏兵委离，不为人使，所求不合，凶害丛至。 故曰：取天下常以无事。 道言：斋者，可谓整百行，建万善者也。 要当能忍辱，能柔弱，能慈爱，能仁施，能阴德，能忠孝，能至诚，能谨信，能戒慎，能肃敬。 备此十能，然后乃可修斋静思，反听内视，还念形中，口不妄言，身不妄动。 故无色之色为之见，无声之声为之闻，无味之味为之甘，不言之言为之应。 神明为之降，福气为之臻，则得心化意圣，好梦善景，能睹未然之征，无愿不获，以此为效。 若外不奉威仪，内不守戒律，行无可记，功无可着，精诚不至，怀疑犹豫，内外不相应，口心不相副，情急性戾，多态两舌，阴诅嫉妬，志思不正於身，精神消於淫欲，贪财好色，不能自制身心。 如此虽修斋直，终身无福。 夫何故然？ 以意思不存於内，魂魄劳役於外，和气去，故不能有所感动也。 故曰：无欲以静，天下自正。 道言：为道修斋，当奉行戒法，广度无极。 法禁微妙，检摄意态，伏心就净，殃垢消灭，行智慧之便，拔生死之难，绝一切之想，就无为之地，深观所起，细察所灭，观其所病，疗以惠药。 若见色利，以诫掩目。 或闻怨恶之言，以诫塞耳。 若食甘香之美，以诫度口。 若愿想财宝，放情爱欲，以诫挫心。 若欲奸非，趣向恶事，以诫折足。 既总其要，身不犯诫，超出尘罗，不入尘俗。 处众爱之中，心在道诫之藏，处忧患之舍，心在善救之堂。 住暗冥之室，心在断灭之户。 倚不固之屋，心在方便之门。 坐蛇虺之地，心在舍远之径。 居虎豹之薮，心在福德之馆。 乘浮船之险，心固自济之路。 近盛火之林，心惟灌灭之要。 立荆棘之园，心在铠捍之障。 是我持诫行智慧之便也。 故曰：挫其锐，解其纷。 道言：立人之道，有三因五主。 何谓三因？ 一曰神，二曰气，三曰形也。 神因气而立，气因神而行，形因神而存，神因形而藏。 神逝则气散，气散则形亡。 故圣人先於养神，次於养气，次於养形，三者和而相得，乃能长生。 何谓五主？ 一曰精，主见五色； 二曰神，主闻五音； 三曰魂，主别善恶； 四曰魄，主察清浊； 五曰气，主识痛痒。 故形体者，是神魂之屋宅。 五脏者，精魂之房室。 九窍者，是神气之门牖。 欲人生目视耳听、鼻息口言、形知痛痒者，皆是精神魂魄气所为也。 若其一不存，则愚痴； 二不存，则昏惑； 三不存，则衰耗； 四不存，则百疾生； 五不存，则死亡。 夫亡者，目不能有所见，耳不能有所闻，鼻不能复息，口不能复言，形不知痛痒，此岂复无耳目鼻口形耶，特是精神魂魄之亡耳。 故喜怒则精散而不藏，愁忧则神闭塞而不行，惊恐则魂魄飞扬，食饮过差则形滞气不通。",
      "translated_text": "Thus, the sage establishes purification through fasting and stillness, casting aside worldly toil, summoning back the hun and po, and resting the spirit. One must be utterly sincere, reverent, and solemn, refraining from speech and ceasing idle chatter, avoiding jest and laughter, and any cause for reproach. Banish stray thoughts and chaotic notions; let the eyes not gaze upon forms, nor witness right and wrong. Let the ears not listen to sounds, nor hear of ill or auspicious omens. With detachment as the heart’s disposition and emptiness as its intent, harmony as its guiding principle and moderation in food as its foundation, one contemplates the Dao and preserves the spirit. Then, heaven and humanity resonate, disasters vanish, blessings descend, and one attains the nature of life.\n\nThus it is said: *Stillness is the rectitude of all under heaven.*\n\nThe Dao declares: *In fasting, merely cultivate correctness. Heaven and earth become serene. Cut off thoughts utterly, and with a single thought, union is achieved.* The qi of the Dao flows freely, entering the human path. The generals, officials, and soldiers one receives will guard and protect, heeding one’s commands, fulfilling every wish.\n\nIf one cannot maintain stillness but instead is restless and overburdened with cares, violating harmony and defying the natural order, offending the hidden laws, lacking good conduct, and refusing to amend an evil heart, then the officials and soldiers will abandon and no longer serve. One’s requests will go unfulfilled, and misfortunes will converge.\n\nThus it is said: *One governs all under heaven by acting without contrivance.*\n\nThe Dao declares: *Fasting may be called the ordering of a hundred practices, the establishment of ten thousand virtues.* One must be able to endure humiliation, to be yielding and gentle, to be compassionate and loving, to be benevolent and giving, to accumulate hidden merits, to be loyal and filial, to be utterly sincere, to be cautious and trustworthy, to be vigilant and reverent. Only after mastering these ten abilities may one engage in fasting and tranquil reflection, turning inward to listen and gaze within, returning awareness to the body’s form. The mouth does not speak idly, the body does not move recklessly.\n\nThus, the formless is perceived as form, the soundless is heard as sound, the tasteless is savored as sweetness, and the wordless is answered in kind. The divine descends, blessings converge, and one attains a heart transformed and a mind sanctified. Auspicious dreams and visions appear, one discerns omens of what is yet to come, and no wish goes unfulfilled—this is the proof.\n\nIf outwardly one fails to uphold dignified conduct and inwardly neglects the precepts, with no deeds worth recording and no merits worth manifesting, lacking sincerity and wavering in doubt, with inner and outer in discord, words and heart at odds, temperament hasty and nature perverse, given to duplicity and double-tongued speech, harboring secret curses and envy, thoughts misaligned with the self, spirit dissipated in excess and desire, coveting wealth and lusting after beauty, unable to master body and mind—then, though one may fast, one will gain no blessing throughout life.\n\nWhy is this so? Because the mind does not abide within, the hun and po are labored and scattered without, and harmonious qi departs. Thus, nothing can be moved to resonance.\n\nThus it is said: *Eliminate desire to attain stillness, and all under heaven will be rectified.*\n\nThe Dao declares: *In practicing the Dao through fasting, one must uphold the precepts and broadly deliver all without limit.* The subtle and wondrous prohibitions restrain and gather the mind’s impulses, subduing the heart to attain purity. Calamities and defilements vanish. One employs the expedient means of wisdom, extricating oneself from the difficulties of birth and death, cutting off all thoughts, and entering the realm of non-action. Observe deeply the arising, examine closely the ceasing, discern the afflictions, and heal them with the medicine of kindness.\n\nIf one sees forms of profit, cover the eyes with admonition. If one hears resentful or hateful words, block the ears with admonition. If one tastes sweet and fragrant delicacies, restrain the mouth with admonition. If one craves wealth and treasures, indulging in love and desire, curb the heart with admonition. If one intends to commit transgressions or pursue evil deeds, break the feet with admonition. Having grasped the essentials, if the body does not transgress the precepts, one transcends the snares of the world and does not enter its dust.\n\nAmidst the throng of worldly attachments, the heart abides in the treasury of the Dao’s precepts. In the dwelling of sorrow and adversity, the heart rests in the hall of benevolent deliverance. In the chamber of darkness, the heart stands at the threshold of extinction. Beneath the unstable roof, the heart dwells at the gate of expedient means. Upon the ground of serpents and vipers, the heart treads the path of renunciation. In the lair of tigers and leopards, the heart resides in the abode of blessings and virtue. Aboard a perilous floating vessel, the heart is steadfast on the way to self-deliverance. Near the blazing forest, the heart focuses on the essentials of quenching. In the thorny garden, the heart stands behind the shield of vigilance. This is how I uphold the precepts and employ the expedient means of wisdom.\n\nThus it is said: *Blunt the sharpness, untangle the knots.*\n\nThe Dao declares: *The way of humanity is founded upon three dependencies and five regulators.*\n\nWhat are the three dependencies? The first is spirit, the second is qi, and the third is form. Spirit stands through qi, qi moves through spirit, form exists through spirit, and spirit is stored through form. When spirit departs, qi scatters; when qi scatters, form perishes. Thus, the sage first nurtures the spirit, then nurtures qi, and then nurtures form. When these three are harmonized and mutually attuned, one may attain longevity.\n\nWhat are the five regulators? The first is essence, which governs the perception of the five colors; the second is spirit, which governs the hearing of the five sounds; the third is the hun, which governs the discernment of good and evil; the fourth is the po, which governs the examination of purity and turbidity; the fifth is qi, which governs the recognition of pain and itching.\n\nThus, the body is the dwelling of spirit and hun. The five viscera are the chambers of essence and hun. The nine orifices are the doors and windows of spirit and qi. When a person’s eyes see, ears hear, nose breathes, mouth speaks, and body senses pain and itching, all these are the workings of spirit, essence, hun, po, and qi. If one of these is absent, one becomes foolish; if two are absent, one becomes confused; if three are absent, one declines and weakens; if four are absent, a hundred illnesses arise; if five are absent, one dies.\n\nIn death, the eyes can no longer see, the ears can no longer hear, the nose can no longer breathe, the mouth can no longer speak, and the body no longer senses pain or itching. Is this because the eyes, ears, nose, mouth, and body no longer exist? It is simply that spirit, essence, hun, po, and qi have departed.\n\nThus, joy and anger scatter essence so that it is not stored; sorrow and worry obstruct the spirit so that it does not flow; fright and terror cause the hun and po to fly away; excessive eating and drinking stagnate the form and block the qi.",
      "overlap_context": "riving and competitive action, affairs accumulate in turmoil. Right and wrong, gain and loss, sorrow and joy, anger and delight, thoughts and anxieties swirl in confusion. The body labors, the spirit suffers, the Dao’s qi distances itself, the hun and po depart, the body becomes an empty city, and malevolent forces daily encroach. Illness and misfortune befall, life is cut short, and the body perishes, suffering the punishments of the three paths, with calamities flowing into future generations.",
      "start_char": 1246,
      "end_char": 2468,
      "start_sentence": 67,
      "end_sentence": 124,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.282801389694214,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝法烛经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "故圣人见失神者夭，失精者狂，失魂者悲哭，失魄者脱色，失志者乱，失意者无气。 是以虚心去欲，挫锐解纷，不以好美盈溢伤精，不以思虑爱憎伤神，不以喜乐恣态伤魂，不以忿怒激切伤魄，不以饮食过差伤形，不以悲哀极言伤气。 乃安居屏处，合天地之气，存在於身，顺四时，适寒暑，节阴阳，和喜怒，裁食饮，调忧苦，避雾露，逃风雨，宝气补精，谷神养魂，内视若盲，反听若聋，虚无淡泊，不在东西，内存五脏，分别色状。 存心即益精，存肝即益明，存肺即身光，存脾即体轻，存肾即气长，神气内守，病安所从。 故曰：谷神不死。 道言：人禀五脏，资於五行，外为形体，内为性情。 骨属木，血属水，肉属土，牙齿属金，气暖属火。 肝仁，肺义，心礼，肾信，脾智。 木性强直，火性猛烈，土性仁和，金性严毳，水性谦退。 又禀气之始，各有清浊刚柔。 禀气清者，聪明圣达。 气之柔者，则优和慈仁，质朴淳笃。 气之刚者，则高严壮烈。 气之浊者，则愚痴凶虐。 各随其所属所禀，以定情性。 性者，命也。 愚者恣之以夭其命，知者深见迮伏其性，正心正行，恭念至道，察见本心，施为百行为合道。 以不有不合者，则以天科法律抑割本情，改易其性，迮伏其心，奉行师法，归命师老，不敢懈替。 如是则天神敬之，地祇护之，凶逆畏之，师老佑之，司命度之，着左契，南斗纪名生录，北斗削除死籍，得为真人。 伏性载命，此之谓也。 故曰：复命曰常，不知常，妄作凶。 道言：守道静思，先当正坐，闭门耳目，还神光明於绛宫，绝去诸念，不得强有所视，思想仿佛，久久喘息稍微，从是以往，自然不复自觉喘息。 不觉喘息，便不复自知有身也。 至能忘身，则是得定，向道门者也。 当尔之时，神在天上虚空之中，左顾右视，无所一见，以此为证。 故曰：塞其兑，闭其门，用其光，复归其明。 道言：人身中有三一者，神、魂、魄也。 中央之一，神也，中和之精也，其气正。 左方之一，魂也，纯阳之精，其气清。 右方之一，魄也，纯阴之精，其气浊。 中央之一，即我神也，道之子也。 左右各一，辅相我神，其气清浊，则其行有善恶。 左方之一，日日闻告我为善，其功德日盛，我得成正道。 右方之一，日日教告我恶事，牵我入恶中，我恶日深，沦没邪城。 为道者若欲明此三一，觉悟善恶，分别邪正，唯当闲身静意，熟读诸经，还自思惟，则智慧自生，挫遣五欲，荡涤六情，行修善积，则功德成就。 则右方之一，邪魔群鬼，悉皆慑伏，不能干我也。 思念专正，立致感通。 若不晓邪正，又无善功，强闭耳目，思神行道，此则众邪便共干人，造作邪念。 前念适灭，后念复起，更相因袭，无有解也。 已如此乱惑，万劫不定，故曰：载营抱一，涤除玄览。 道言：人有精神魂魄，体与凡类殊异，尊与天地同道，贵与神明合德，明与日月通察，必能静形定意，精诚斋戒，勤敬三宝，深识天官吏兵之位，复还光内观形内之宫室，存念神景之所处，常以虚中求真，无中求有，则九天之上可得照，九地之下可得睹，玄精可降，元始可禀。 太上至尊而为至诚显，生道至重而为至诚感。 故求生者，腹中而起，一形之中，则知天地之体也，而包八十一域，含四海五岳，云兴雨施，在於吹嘘，凑泽润液，在於呼吸，形在神往，忽若指掌。",
      "translated_text": "Thus, the sage observes: those who lose their spirit die young; those who lose their essence go mad; those who lose their hun weep in sorrow; those who lose their po grow pallid; those who lose their will become disordered; those who lose their intent become listless.\n\nTherefore, empty the heart and dispel desires, blunt sharpness and resolve entanglements. Do not let fondness for beauty and excess harm the essence; do not let thoughts of love and hatred harm the spirit; do not let joy and pleasure in unrestrained postures harm the hun; do not let fury and rage in vehement outbursts harm the po; do not let immoderate eating and drinking harm the form; do not let extreme sorrow and lamentation harm the qi.\n\nInstead, dwell in tranquility and seclusion, harmonize with the qi of Heaven and Earth, preserve it within the body, follow the four seasons, adapt to cold and heat, regulate yin and yang, balance joy and anger, moderate food and drink, adjust sorrow and suffering, avoid mist and dew, escape wind and rain. Treasure qi and replenish essence, nourish the hun with the spirit of the valley. Inwardly, see as though blind; reverse hearing as though deaf. Be empty and indifferent, unattached to east or west. Within, preserve the five viscera, distinguishing their colors and forms.\n\nPreserving the heart augments essence; preserving the liver augments clarity; preserving the lungs makes the body radiant; preserving the spleen makes the body light; preserving the kidneys lengthens the qi. When spirit and qi are guarded within, where can illness arise?\n\nThus it is said: \"The spirit of the valley never dies.\"\n\nThe Dao teaches: humans receive the five viscera, endowed by the five phases. Externally, they form the body; internally, they shape temperament. Bones belong to Wood; blood to Water; flesh to Earth; teeth to Metal; warmth of qi to Fire. The liver embodies benevolence; the lungs, righteousness; the heart, propriety; the kidneys, trust; the spleen, wisdom. The nature of Wood is strong and upright; Fire, fierce and intense; Earth, kind and harmonious; Metal, stern and keen; Water, modest and retiring.\n\nMoreover, at the inception of endowment, each possesses purity or turbidity, hardness or softness. Those endowed with pure qi are wise, sagely, and enlightened. Those with soft qi are gentle, harmonious, compassionate, sincere, and honest. Those with hard qi are lofty, stern, and heroic. Those with turbid qi are foolish, cruel, and violent. Each follows its endowment to determine temperament.\n\nTemperament is destiny. The foolish indulge it and shorten their lives; the wise deeply perceive and restrain their nature. They rectify the heart and conduct, reverently contemplate the supreme Dao, examine and perceive the original heart, and ensure all actions accord with the Dao. Where nothing is possessed and nothing is discordant, they use the laws of Heaven to restrain and sever their fundamental nature, transform their temperament, subdue their hearts, follow the teachings of their masters, and submit their lives to the venerable masters, never daring to slacken. Thus, heavenly spirits respect them, earthly deities protect them, the malevolent and rebellious fear them, venerable masters aid them, the Controller of Destiny records them, inscribing their names in the left register. The Southern Dipper records their names in the register of life; the Northern Dipper erases them from the ledger of death. They become perfected beings.\n\nSubduing nature and bearing destiny—this is what it means.\n\nThus it is said: \"Returning to destiny is called constancy. Not knowing constancy, reckless action brings misfortune.\"\n\nThe Dao teaches: to guard the Dao and meditate in stillness, first sit upright, close the gates of ears and eyes, and return the radiance of spirit to the Crimson Palace. Sever all thoughts; do not forcefully fix the gaze or allow wandering thoughts. Gradually, the breath becomes subtle. Continuing thus, one naturally ceases to be aware of breathing. Unaware of breath, one no longer perceives the body. To forget the body is to attain stability, the gateway to the Dao.\n\nAt such a time, the spirit resides in the emptiness of Heaven, gazing left and right without seeing anything—this is the proof.\n\nThus it is said: \"Block the openings, close the gates. Use its light, return to its radiance.\"\n\nThe Dao teaches: within the human body are the Three Ones—spirit, hun, and po. The central One is the spirit, the essence of harmony, its qi upright. The left One is the hun, the essence of pure yang, its qi clear. The right One is the po, the essence of pure yin, its qi turbid. The central One is my spirit, the child of the Dao. The left and right Ones each assist my spirit. Their qi, clear or turbid, determines whether their actions are good or evil.\n\nThe left One daily urges me toward goodness; its merits grow daily, and I attain the true Dao. The right One daily teaches me evil, drawing me into wickedness. My evil deepens, and I sink into the city of depravity. Those who practice the Dao, desiring to understand these Three Ones, awaken to good and evil, and distinguish right from wrong, must still the body and quiet the mind, diligently study the scriptures, and reflect inwardly. Then wisdom arises naturally. They subdue the five desires, cleanse the six emotions, cultivate goodness, and accumulate merit. Thus, the right One—demons, ghosts, and all evil—will be subdued and unable to disturb them.\n\nWith focused and upright thoughts, resonance is swiftly achieved. If one does not discern right from wrong, lacks good deeds, and forcibly closes the ears and eyes to contemplate the spirit and practice the Dao, then all manner of evil will assail them, generating wicked thoughts. As one thought fades, another arises, endlessly following one after another, without respite. Thus confused and deluded, they remain unsettled for ten thousand kalpas.\n\nThus it is said: \"Embrace the One, cleanse the mysterious mirror.\"\n\nThe Dao teaches: humans possess spirit, essence, hun, and po, their bodies distinct from common creatures. Their nobility aligns with Heaven and Earth in the Dao; their worth unites with the divine in virtue; their clarity connects with the sun and moon in perception. If they can still the form and settle the mind, purify with sincerity and observe the fast, revere the Three Treasures, and deeply recognize the positions of the celestial officials and soldiers, they may return their radiance to inwardly observe the palaces within the body, preserve the dwelling places of the divine luminaries, and constantly seek the true in emptiness, the existent in nothingness. Then, the heights of the nine heavens may be illuminated, the depths of the nine earths may be seen, the mysterious essence may descend, and the Primordial Beginning may be received.\n\nThe Most High is most honored and manifests through utmost sincerity; the Dao of life is most weighty and responds to utmost sincerity. Thus, those who seek life arise from within the abdomen. Within a single form, one knows the body of Heaven and Earth, encompassing eighty-one domains, containing the four seas and five peaks. Clouds rise and rain falls through exhalation; moisture and fluids gather through inhalation. The form remains while the spirit travels, swift as pointing to the palm.",
      "overlap_context": "ger hear, the nose can no longer breathe, the mouth can no longer speak, and the body no longer senses pain or itching. Is this because the eyes, ears, nose, mouth, and body no longer exist? It is simply that spirit, essence, hun, po, and qi have departed.\n\nThus, joy and anger scatter essence so that it is not stored; sorrow and worry obstruct the spirit so that it does not flow; fright and terror cause the hun and po to fly away; excessive eating and drinking stagnate the form and block the qi.",
      "start_char": 2468,
      "end_char": 3733,
      "start_sentence": 125,
      "end_sentence": 167,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.91857695579529,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝法烛经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "坐修於胸心之裹，然臻福八极之表，神和雾集，在於不移清净，一时之间，消灾致寿，长生在己也。 故曰：不窥牖，见天道。 不出户，知天下。 太上洞玄灵宝法烛经竟",
      "translated_text": "Seated in cultivation within the chamber of the heart and breast, one may yet attain blessings beyond the eight extremities. When spirit harmonizes and mist gathers, it arises from unwavering purity. In a single moment, calamities dissolve and longevity is attained—everlasting life lies within oneself.\n\nThus it is said:\nWithout gazing through the window, one sees the Dao of Heaven.\nWithout stepping beyond the door, one knows all under Heaven.\n\nThe *Most High Cavernous Mystery Numinous Treasure Dharma Candle Sutra* concludes.",
      "overlap_context": "d.\n\nThe Most High is most honored and manifests through utmost sincerity; the Dao of life is most weighty and responds to utmost sincerity. Thus, those who seek life arise from within the abdomen. Within a single form, one knows the body of Heaven and Earth, encompassing eighty-one domains, containing the four seas and five peaks. Clouds rise and rain falls through exhalation; moisture and fluids gather through inhalation. The form remains while the spirit travels, swift as pointing to the palm.",
      "start_char": 3733,
      "end_char": 3810,
      "start_sentence": 168,
      "end_sentence": 171,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 2.9703385829925537,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\太上洞玄灵宝法烛经.txt",
        "category": "本文类"
      }
    }
  ]
}