{
  "source_id": "太上老君说五斗金章受生经",
  "source_file": "chunked_daozang\\太上老君说五斗金章受生经.json",
  "total_chunks": 2,
  "total_original_chars": 2396,
  "total_translated_chars": 13785,
  "total_translation_time": 63.86027216911316,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\本文类\\太上老君说五斗金章受生经.txt",
    "category": "本文类"
  },
  "full_translation": "*The Scripture on the Five Celestial Talons and Golden Chapters for Receiving Life, as Spoken by the Most High Lord Lao*\n\nAt that time, the Most High Lord Lao resided in the Great Clarity Realm, within the Great Crimson Heaven, in the Hall of Golden Radiance. He summoned the Five Elder Thearchs, the Eastern Dipper Lord of Life-Allotment, the Southern Dipper Lord of Birth, the Western Dipper Lord of Name-Recording, the Northern Dipper Lord of Death, the Central Dipper Lord of Universal Oversight, the Nine Heavens Lords of Life-Generation, the Nine Heavens Lords of Life-Allotment, the Nine Heavens Lords of Fortune-Allotment, the Nine Heavens Lords of Registers and Calculations, the Nine Heavens Lords of Treasury and Fortune, the Nine Heavens Lords of Disaster-Dispelling and Misfortune-Scattering, the Nine Heavens Holy Mothers and the Nine Heavens Supreme Unity Primordial Lords, the Nine Heavens Great Gods of Life-Supervision, the Seven Luminaries of the Northern Dipper, the Six Controllers of the Southern Dipper, and the Lords of the Original Destiny and Life-Founding Stars of the Natal Constellations. Each was accompanied by their respective divine attendants, golden lads, jade maidens, and boundless sacred assemblies. Together they gathered, bowing in reverence, burning incense, scattering flowers, pacing the void in circumambulation, kneeling before the Dao, and attentively listening to the sacred teachings.\n\nThe Most High Lord Lao expounded the profound and wondrous, addressing the Five Elder Thearchs of the Five Directions and all the sacred assemblies, saying: \"In the primordial chaos, before the division of Heaven and Earth, the primordial transformation was undifferentiated. I spread qi throughout the ten directions, completing the myriad forms, giving birth to Heaven and Earth. Embracing yin and embracing yang, the yang qi ascended to generate the various heavens, while the yin qi descended to generate the various earths. The surplus of yang qi transformed into men, and the surplus of yin qi transformed into women. The intermingling of yin and yang qi naturally gave rise to the generative transformations of humanity.\n\nOnce humanity existed, predestined karmic conditions brought forth good and evil, long life and short, nobility and lowliness, wealth and poverty. The retribution for good and evil follows as closely as a shadow follows form, as an echo responds to sound. Good deeds beget good rewards; evil deeds bring evil consequences. Planting orchids yields fragrance; sowing millet yields grain. Good conduct invites auspiciousness; evil conduct invites calamity. All karmic conditions arise from the merit of one’s deeds.\n\nMoreover, when humans are born into the lower realm, their lives are tied to Heaven. At birth, they stand between Heaven and Earth, possessing both yin and yang, each endowed with the proper qi of the Five Phases and governed by the Five Dippers. Their original destiny and natal constellations correspond to the twelve zodiacal branches. Those born under *jia* and *yi* are allotted life by the Eastern Dipper; those born under *bing* and *ding* by the Southern Dipper; those born under *wu* and *ji* by the Central Dipper; those born under *geng* and *xin* by the Western Dipper; and those born under *ren* and *gui* by the Northern Dipper. At the moment of life-allotment, each receives the true qi of the Five Phases. The true qi intermingles, knitting the essence to form the embryo. After ten months in the womb, the embryo completes its cycle through the ten directions, absorbing the life-generating qi of the ten directions.\n\nEncompassing the primordial beginning, it is profound and obscure. Within it lies essence—elusive and intangible. Within it lies substance—unseen by sight, unheard by sound. Detached from all extremes, it is called the Wondrous Dao. The Wondrous Dao resides within humans; it must not be lightly lost. Losing it is easy, preserving it is difficult. Many stray from the true Dao, pursuing false sources. Many indulge in lust and killing, in greed and wrath. Many sink into hell, losing their human form.\n\nAt the moment of receiving life, the Lords of the Five Dippers and the sacred assemblies of the Nine Heavens allot life, fortune, wealth, poverty, longevity, brevity, good fortune, and misfortune. All these are self-created and self-received by sentient beings.\n\nIf, during one’s time in the world, one reveres the Great Dao, makes offerings to the Heavenly Worthies, honors parents, harmonizes with the six relations, avoids jealousy and envy, greed and lust, observes fasts and precepts, performs good deeds, or receives the Three Precepts, Five Precepts, Ten Precepts, Twelve Precepts, Fourteen Precepts for Conduct, Twenty-Four Precepts, Thirty-Six Precepts, Seventy-Two Precepts, One Hundred Eight Precepts, or the Three Hundred Great Precepts; or if one cultivates the Upper Clarity Fast, the Golden Register Fast, the Three Primes Fast, the Three Sevens Fast, the *gengshen* Fast, the *jiazi* Fast, or the Natal Fast—such precepts and fasts, when upheld by good men and good women, bind them to the celestial beings. Life after life, they do not lose their human form, enjoying wealth, nobility, intelligence, and excellence among humanity. Their five limbs are complete, and their ten features are dignified.\n\nMoreover, at birth, humans receive the true qi and golden talismanic chapters bestowed by the Five Elder Thearchs of the Five Directions. These intermingle naturally to give rise to human life.\n\nNow I proclaim the true scripture and divine incantation of the **First Golden Talismanic Chapter of the Eastern Direction**:\n\n*In the Eastern Direction, the Nine Qi of the Primordial Azure Heaven.*\n*The Azure Numinous Primordial Elder, the Nine Qi Heavenly Lord.*\n*The Perfected One holds the brush, inscribing it into the human body.*\n*The virtue of Wood knits the essence, uniting with the Dao to merge with the true.*\n\nThis talismanic chapter resides in the human liver. If one suffers from liver disease, write it in cinnabar, burn it to ashes, and ingest it for an immediate cure.\n\nThe **Second Golden Talismanic Chapter of the Southern Direction**:\n\n*In the Southern Direction, the Three Qi of the Vermilion Numinous Cinnabar Heaven.*\n*The Cinnabar Numinous True Elder, the Three Qi Heavenly Lord.*\n*The Lords of Life-Allotment and Record-Keeping, the revered deities of the Crimson Palace.*\n*The virtue of Fire illumines the essence, uniting with the Dao to merge with the true.*\n\nThis talismanic chapter resides in the human heart. If one suffers from heart disease, write it in cinnabar, burn it to ashes, and ingest it for an immediate cure.\n\nThe **Third Golden Talismanic Chapter of the Central Direction**:\n\n*The Universal Overseer of the Multitudes of Spirits, the Heaven of the Twelve.*\n*The Primordial Numinous Primordial Elder, the Twelve Heavenly Lords.*\n*The Registrar and Auditor of Records, the deity who governs the spleen.*\n*The virtue of Earth stabilizes the essence, uniting with the Dao to merge with the true.*\n\nThis talismanic chapter resides in the human spleen. If one suffers from spleen disease, write it in cinnabar, burn it to ashes, and ingest it for an immediate cure.\n\n**The Fourth Golden Talismanic Chapter of the Western Direction**:\n\n*The Seven Qi of the West, the Heaven of Great White.*\n*The August Numinous Primordial Elder, the Seven Qi Heavenly Lords.*\n*The Recorder who Pacifies the Po, the deity who governs the lung.*\n*The virtue of Metal fortifies the essence, uniting with the Dao to merge with the true.*\n\nThis talismanic chapter resides in the human lung. If one suffers from lung disease, write it in cinnabar, burn it to ashes, and ingest it for an immediate cure.\n\n**The Fifth Golden Talismanic Chapter of the Northern Direction**:\n\n*The Five Qi of the North, the Heaven of Profound Center.*\n*The Five Numinous Primordial Elders, the Five Qi Heavenly Lords.*\n*The Pursuer of Life and Releaser of Death, the deity who governs the kidney.*\n*The virtue of Water harmonizes the essence, uniting with the Dao to merge with the true.*\n\nThis talismanic chapter resides in the human kidney. If one suffers from kidney disease, write it in cinnabar, burn it to ashes, and ingest it for an immediate cure.\n\nAt that time, Lord Lao spoke again of these Five Directional True Writings and Divine Incantations, summoning the Five Directional Dipper Star Lords to descend with these talismanic true writings and divine incantations. Each was bestowed upon the Five Dipper Star Lords, inscribed in golden script and jade seal characters, according to their respective directions. All received and upheld them, inscribing the lives of worldly people, with these sacred writings pacifying and guarding the five viscera, each residing within the human body.\n\nAll human lives are governed by the generative qi of the Nine Heavens and the life-determining spirits of the Five Dipper Star Lords. If there are those who know their root and origin, on the days beneath the Northern Dipper during the Three Origins, Five La, or their own life-bestowing birthdays, they should solemnly prepare an altar, perform rites according to their means, and offer sacrifices to the Five Directions and Five Elders—manifestations of my transformed body, the life-registering sagely hosts of the Five Dipper Star Lords and life-determining spirits. They should present offerings of money and goods to repay the assembled perfected ones, who will then inscribe their lives, allowing them to be born in the Central Kingdom and receive the sheltering grace of the Great Dao.\n\nAt the time of birth, the celestial and terrestrial bureaus permit the pledging of one’s life-bound money. Those born under *jia* or *yi* belong to the Eastern Dipper’s Nine Qi; at birth, they pledged nine myriad strings of cash. Those born under *bing* or *ding* belong to the Southern Dipper’s Three Qi; at birth, they pledged three myriad strings of cash. Those born under *wu* or *ji* belong to the Central Dipper’s Twelve Qi; at birth, they pledged twelve myriad strings of cash. Those born under *geng* or *xin* belong to the Western Dipper’s Seven Qi; at birth, they pledged seven myriad strings of cash. Those born under *ren* or *gui* belong to the Northern Dipper’s Five Qi; at birth, they pledged five myriad strings of cash.\n\nIf there are faithful men and women who cultivate myriad good roots, ensuring their goodness remains unbroken through successive lives, they must offer sacrifices to repay their life-bound money. The celestial and terrestrial bureaus each possess clear records: the Twelve Life-Bound Ones and the Twelve Treasury Spirits. Those born in the *zi* hour belong to the first treasury; those born in the *chen* hour, the second; those born in the *shen* hour, the third; those born in the *hai* hour, the fourth; those born in the *mao* hour, the fifth; those born in the *wei* hour, the sixth; those born in the *yin* hour, the seventh; those born in the *wu* hour, the eighth; those born in the *xu* hour, the ninth; those born in the *si* hour, the tenth; those born in the *you* hour, the eleventh; and those born in the *chou* hour, the twelfth. Each person possesses their own treasury of fate and fortune. If, on their life-bound day, they complete the sacrificial rites without omission, they will enjoy peace in this life, smooth passage in all endeavors, unobstructed good fortune, and the fulfillment of their wishes. Their life-bound stellar officials will constantly bestow shelter, ensuring longevity. At the time of death, they will not lose their human form but will be reborn into wealth, nobility, civil or martial prominence, with stars of fortune and emolument illuminating their destiny, womb palace, and life. They will enjoy peace, longevity, and avoid inauspicious conditions.\n\nIf there are men or women of meager fate and insufficient means to perform the rites, on their life-bound day, they may invite one or two, or three to five Orthodox Unity Daoist priests to their home or a temple. They may recite the *Precious Scripture of the Five Dipper Golden Chapters* or undertake the recitation themselves. For each recitation, they may deduct ten thousand strings of cash. Alternatively, with sincere devotion, they may invoke the Life-Receiving Heavenly Worthy, reciting a thousand or ten thousand times, ensuring rebirth among humans for three successive lives as a man, with all five limbs intact, tenfold majesty, and universal reverence, encountering the supreme and perfect Dao.\n\nAt that time, the Five Directional Five Elder Emperor Lords, the Five Dipper Star Lords, the Six Bureau Star Lords of the Southern Dipper, the Seven Origins Star Lords of the Northern Dipper, the Sagely Hosts of the Nine Heavens, the Life-Bound Star Officials, the Origin-Star Officials, the Merit Officers and Spirit Officials, the Golden Lads and Jade Maidens, and the assembled immortals, having heard Lord Lao expound this true scripture, rejoiced as one, bowed in gratitude to the Mysterious Origin, and each vowed to receive and uphold it.\n\nThen, the Primordial Elder Emperor Lord stepped forward, knelt, and offered this verse in reverence, bowing in gratitude before withdrawing with solemnity:\n\n*I bow to the True Origin, the Supreme Worthy,*\n*With wholehearted faith in the inconceivable.*\n*Such wondrous dharma I had never heard—*\n*Today, at this moment, I have attained it all.*\n*It illuminates darkness with radiant light,*\n*And serves as a skilled physician for illness.*\n*Wondrous indeed, the divine incantations and five sacred talismans!*\n*I vow to take refuge and receive them all.*\n\nThus concludes *The Scripture of the Five Dipper Golden Chapters on Receiving Life*, as spoken by Lord Lao the Most High.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上老君说五斗金章受生经 经名：太上老君说五斗金章受生经。 撰人不详，约出於唐宋间。 假托太上老君为五斗星君等宣说五方金章灵符，劝人施财设醮，诵经祈福。 一卷。 底本出处：《正统道藏》洞神部本文类。 太上老君说五斗金章受生经 尔时，太上老君在太清境上、大赤天中、黄金殿内，召五老帝君及东斗注算君、南斗上生君、西斗记名君、北斗落死君、中斗总监君、九天生神君、九天注生君、九天注禄君、九天掌籍掌算君、九天财库禄库君、九天消灾散祸君、九天圣母九天太一元君、九天监生大神、北斗七元星君、南斗六司星君、本命元辰建生星斗君，各随本部功曹灵官、金童玉女无量圣众，一时同会，稽首礼拜，烧香散花，步虚旋绕，长跪道前，谛听法言。 太上老君广宣要妙，告示五方五老一切圣众曰：吾昔於混沌之中，天地未分，元化体一，布气十方，成就万象，生天生地，负阴抱阳，阳气上升，化生诸天，阴气下降，化生诸地，阳之余气化为男子，阴之余气化为女人，阴阳二气，混合自然，生生化化，乃有人伦。 既有人伦，宿命因缘，有善有恶，有长有短，有贵有贱，有富有贫，善恶之报，如影逐形，如响应声，作善善应，作恶恶成，种兰得香，种粟得粮，为善降祥，为恶降殃，一切因缘，皆由福业。 且人生下土，命系上天，人之生也，顶天履地，有阴有阳，各有五行正气，各有五斗所管，本命元辰，十二相属，且甲乙生人东斗注生，丙丁生人南斗注生，戊己生人中斗注生，庚辛生人西斗注生，壬癸生人北斗注生，注生之时，各禀五行真气，真气混合，结秀成胎，受胎十月，周回十方，十方生气。 包罗元始，杳杳冥冥，其中有精，恍恍惚惚，其中有物，视不见我，听不得闻，离种种边，名为妙道。 妙道在人，不可轻失，失之甚易，保之甚难，多迷真道，多逐邪源，多好淫杀，多好贪嗔，多沉地狱，多失人身。 受生之时，五斗星君，九天圣众，注生注禄，注富注贫，注长注短，注吉注凶，皆由众生，自作自受。 若人在世之日，心崇大道，供养天尊，孝顺父母，和同六亲，不嫉不妬，不贪不淫，或持斋戒，或作善缘，或受三戒五戒，十戒十二可从戒，十四持身戒，二十四戒，三十六戒，七十二戒，一百八戒，三百大戒； 或修上清斋、金箓斋、三元斋、三七斋、庚申斋、甲子斋、本命斋，如是斋戒，若有善男子善女人受持之者，名系天人，世世生生，不失人身，富贵聪明，人中殊胜，五体具足，十相端严。 且人之生也，皆受五方五老帝君各降真气，金章灵符，混合自然，化生为人。 吾今宣说东方第一金章灵符真文神咒： 东方九炁，始青天中。 青灵始老，九炁天君。 真人按笔，下注人身。 木德结秀，会道合真。 此章灵符镇人肝中，若人肝受病，以朱书烧灰服之，立愈。 南方第二金章灵符真文神咒： 南方三气，赤灵丹天。 丹灵真老，三气天君。 司命司录，绛阙尊神。 火德明秀，会道合真。 此章灵符镇人心中，若人心受病，以朱书烧灰服之，立愈。 中央第三金章灵符真文神咒： 总监众灵，十二之天。 元灵元老，十二天君。 都录校籍，主镇脾神。 土德镇秀，会道合真。 此章灵符镇人脾中，若人脾受病，以朱书烧灰服之，立愈。",
      "translated_text": "*The Scripture on the Five Celestial Talons and Golden Chapters for Receiving Life, as Spoken by the Most High Lord Lao*\n\nAt that time, the Most High Lord Lao resided in the Great Clarity Realm, within the Great Crimson Heaven, in the Hall of Golden Radiance. He summoned the Five Elder Thearchs, the Eastern Dipper Lord of Life-Allotment, the Southern Dipper Lord of Birth, the Western Dipper Lord of Name-Recording, the Northern Dipper Lord of Death, the Central Dipper Lord of Universal Oversight, the Nine Heavens Lords of Life-Generation, the Nine Heavens Lords of Life-Allotment, the Nine Heavens Lords of Fortune-Allotment, the Nine Heavens Lords of Registers and Calculations, the Nine Heavens Lords of Treasury and Fortune, the Nine Heavens Lords of Disaster-Dispelling and Misfortune-Scattering, the Nine Heavens Holy Mothers and the Nine Heavens Supreme Unity Primordial Lords, the Nine Heavens Great Gods of Life-Supervision, the Seven Luminaries of the Northern Dipper, the Six Controllers of the Southern Dipper, and the Lords of the Original Destiny and Life-Founding Stars of the Natal Constellations. Each was accompanied by their respective divine attendants, golden lads, jade maidens, and boundless sacred assemblies. Together they gathered, bowing in reverence, burning incense, scattering flowers, pacing the void in circumambulation, kneeling before the Dao, and attentively listening to the sacred teachings.\n\nThe Most High Lord Lao expounded the profound and wondrous, addressing the Five Elder Thearchs of the Five Directions and all the sacred assemblies, saying: \"In the primordial chaos, before the division of Heaven and Earth, the primordial transformation was undifferentiated. I spread qi throughout the ten directions, completing the myriad forms, giving birth to Heaven and Earth. Embracing yin and embracing yang, the yang qi ascended to generate the various heavens, while the yin qi descended to generate the various earths. The surplus of yang qi transformed into men, and the surplus of yin qi transformed into women. The intermingling of yin and yang qi naturally gave rise to the generative transformations of humanity.\n\nOnce humanity existed, predestined karmic conditions brought forth good and evil, long life and short, nobility and lowliness, wealth and poverty. The retribution for good and evil follows as closely as a shadow follows form, as an echo responds to sound. Good deeds beget good rewards; evil deeds bring evil consequences. Planting orchids yields fragrance; sowing millet yields grain. Good conduct invites auspiciousness; evil conduct invites calamity. All karmic conditions arise from the merit of one’s deeds.\n\nMoreover, when humans are born into the lower realm, their lives are tied to Heaven. At birth, they stand between Heaven and Earth, possessing both yin and yang, each endowed with the proper qi of the Five Phases and governed by the Five Dippers. Their original destiny and natal constellations correspond to the twelve zodiacal branches. Those born under *jia* and *yi* are allotted life by the Eastern Dipper; those born under *bing* and *ding* by the Southern Dipper; those born under *wu* and *ji* by the Central Dipper; those born under *geng* and *xin* by the Western Dipper; and those born under *ren* and *gui* by the Northern Dipper. At the moment of life-allotment, each receives the true qi of the Five Phases. The true qi intermingles, knitting the essence to form the embryo. After ten months in the womb, the embryo completes its cycle through the ten directions, absorbing the life-generating qi of the ten directions.\n\nEncompassing the primordial beginning, it is profound and obscure. Within it lies essence—elusive and intangible. Within it lies substance—unseen by sight, unheard by sound. Detached from all extremes, it is called the Wondrous Dao. The Wondrous Dao resides within humans; it must not be lightly lost. Losing it is easy, preserving it is difficult. Many stray from the true Dao, pursuing false sources. Many indulge in lust and killing, in greed and wrath. Many sink into hell, losing their human form.\n\nAt the moment of receiving life, the Lords of the Five Dippers and the sacred assemblies of the Nine Heavens allot life, fortune, wealth, poverty, longevity, brevity, good fortune, and misfortune. All these are self-created and self-received by sentient beings.\n\nIf, during one’s time in the world, one reveres the Great Dao, makes offerings to the Heavenly Worthies, honors parents, harmonizes with the six relations, avoids jealousy and envy, greed and lust, observes fasts and precepts, performs good deeds, or receives the Three Precepts, Five Precepts, Ten Precepts, Twelve Precepts, Fourteen Precepts for Conduct, Twenty-Four Precepts, Thirty-Six Precepts, Seventy-Two Precepts, One Hundred Eight Precepts, or the Three Hundred Great Precepts; or if one cultivates the Upper Clarity Fast, the Golden Register Fast, the Three Primes Fast, the Three Sevens Fast, the *gengshen* Fast, the *jiazi* Fast, or the Natal Fast—such precepts and fasts, when upheld by good men and good women, bind them to the celestial beings. Life after life, they do not lose their human form, enjoying wealth, nobility, intelligence, and excellence among humanity. Their five limbs are complete, and their ten features are dignified.\n\nMoreover, at birth, humans receive the true qi and golden talismanic chapters bestowed by the Five Elder Thearchs of the Five Directions. These intermingle naturally to give rise to human life.\n\nNow I proclaim the true scripture and divine incantation of the **First Golden Talismanic Chapter of the Eastern Direction**:\n\n*In the Eastern Direction, the Nine Qi of the Primordial Azure Heaven.*\n*The Azure Numinous Primordial Elder, the Nine Qi Heavenly Lord.*\n*The Perfected One holds the brush, inscribing it into the human body.*\n*The virtue of Wood knits the essence, uniting with the Dao to merge with the true.*\n\nThis talismanic chapter resides in the human liver. If one suffers from liver disease, write it in cinnabar, burn it to ashes, and ingest it for an immediate cure.\n\nThe **Second Golden Talismanic Chapter of the Southern Direction**:\n\n*In the Southern Direction, the Three Qi of the Vermilion Numinous Cinnabar Heaven.*\n*The Cinnabar Numinous True Elder, the Three Qi Heavenly Lord.*\n*The Lords of Life-Allotment and Record-Keeping, the revered deities of the Crimson Palace.*\n*The virtue of Fire illumines the essence, uniting with the Dao to merge with the true.*\n\nThis talismanic chapter resides in the human heart. If one suffers from heart disease, write it in cinnabar, burn it to ashes, and ingest it for an immediate cure.\n\nThe **Third Golden Talismanic Chapter of the Central Direction**:\n\n*The Universal Overseer of the Multitudes of Spirits, the Heaven of the Twelve.*\n*The Primordial Numinous Primordial Elder, the Twelve Heavenly Lords.*\n*The Registrar and Auditor of Records, the deity who governs the spleen.*\n*The virtue of Earth stabilizes the essence, uniting with the Dao to merge with the true.*\n\nThis talismanic chapter resides in the human spleen. If one suffers from spleen disease, write it in cinnabar, burn it to ashes, and ingest it for an immediate cure.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1271,
      "start_sentence": 0,
      "end_sentence": 34,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.21189522743225,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\太上老君说五斗金章受生经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "西方第四金章灵符真文神咒： 西方七气，太白之天。 皓灵皇老，七气天君。 记名安魄，主镇肺神。 金德坚秀，会道合真。 此章灵符镇人肺中，若人肺受病，以朱书烧灰服之，立愈。 北方第五金章灵符真文神咒： 北方五气，玄中之天。 五灵玄老，五气天君。 追生落死，主镇肾神。 水德善秀，会道合真。 此章灵符镇人肾中，若人肾受病，以朱书烧灰服之，立愈。 尔时，老君再说此五方真文神咒，即召五方五斗星君，降此灵符真文神咒，各授五斗星君，即以金书玉篆，各依其方，总得受持，注生世人，以此灵文安镇五脏，各镇人身。 凡人性命，皆由九天生气五斗星君本命元辰主掌灵神，若复有人能知根本，但遇三元五腊本命生辰北斗下日，严置坛场，随力章醮，供养五方五老，乃吾化身注生圣众五斗星君、本命元辰，醮献钱财，以答众真，注我生身，得生中国，得遇大道荫佑之恩。 当生之时，天曹地府愿许本命钱，且甲乙生人，命属东斗九气，为人受生之时，曾许本命银钱九万贯文； 丙丁生人，命属南斗三气，为人受生之时，曾许本命银钱三万贯文； 戊己生人，命属中斗一十二气，为人受生之时，曾许本命银钱一十二万贯文； 庚辛生人，命属西斗七气，为人受生之时，曾许本命银钱七万贯文； 壬癸生人，命属北斗五气，为人受生之时，曾许本命银钱五万贯文。 若有善信男女，种诸善根，善根不断，世世为人，当须醮送五本命钱，天曹地府各有明文，十二本命，十二库神。 子生之人第一库中，辰生之人第二库中，申生之人第三库中，亥生之人第四库中，卯生之人第五库中，未生之人第六库中，寅生之· 人第七库中，午生之人第八库中，戌生之人第九库中，巳生之人第十库中，酉生之人第十一库中，丑生之人第十二库中。 乃是生人各有财禄命库，若人本命之日，依此烧醮了足，别无少欠，即得见世安乐，出入通达，吉无不利，所愿如心，自有本命星官常垂荫佑，使保天年，过世之时？ 不失人身，得生富贵文武，星临财星禄星，五福照曜身命胎宫，安乐长寿，不值恶缘。 若有男女生身果薄，无力章醮，可於本命之日，请正一道士，或一或二，或三或五，或於宫观、或就家庭，持诵《五斗金章宝经》，或以自愿持讽，每诵一遍，折钱一万贯文，又志心持念托化受生天尊，或千或万，当来托生人中，三世长为男子之身，五体全备，十相端严，一切恭敬，得遇无上正真之道。 是时五方五老帝君、五斗星君、南斗六司星君、北斗七元星君、九天圣众、本命星官、元辰星官、功曹灵官、金童玉女、一会神仙，得闻老君说此真经，一时欢喜，礼谢玄元，各愿受持。 时有始老帝君，出班长跪，而作是偈，稽首礼谢，珍重而退。 稽首真元无上尊，一心信奉不思议。 如斯妙法未曾闻，今日今时尽得之。 能为黑暗开光明，能为疾病作良医。 妙哉神咒五灵符，誓愿归依各受持。 太上老君说五斗金章受生经竟",
      "translated_text": "**The Fourth Golden Talismanic Chapter of the Western Direction**:\n\n*The Seven Qi of the West, the Heaven of Great White.*\n*The August Numinous Primordial Elder, the Seven Qi Heavenly Lords.*\n*The Recorder who Pacifies the Po, the deity who governs the lung.*\n*The virtue of Metal fortifies the essence, uniting with the Dao to merge with the true.*\n\nThis talismanic chapter resides in the human lung. If one suffers from lung disease, write it in cinnabar, burn it to ashes, and ingest it for an immediate cure.\n\n**The Fifth Golden Talismanic Chapter of the Northern Direction**:\n\n*The Five Qi of the North, the Heaven of Profound Center.*\n*The Five Numinous Primordial Elders, the Five Qi Heavenly Lords.*\n*The Pursuer of Life and Releaser of Death, the deity who governs the kidney.*\n*The virtue of Water harmonizes the essence, uniting with the Dao to merge with the true.*\n\nThis talismanic chapter resides in the human kidney. If one suffers from kidney disease, write it in cinnabar, burn it to ashes, and ingest it for an immediate cure.\n\nAt that time, Lord Lao spoke again of these Five Directional True Writings and Divine Incantations, summoning the Five Directional Dipper Star Lords to descend with these talismanic true writings and divine incantations. Each was bestowed upon the Five Dipper Star Lords, inscribed in golden script and jade seal characters, according to their respective directions. All received and upheld them, inscribing the lives of worldly people, with these sacred writings pacifying and guarding the five viscera, each residing within the human body.\n\nAll human lives are governed by the generative qi of the Nine Heavens and the life-determining spirits of the Five Dipper Star Lords. If there are those who know their root and origin, on the days beneath the Northern Dipper during the Three Origins, Five La, or their own life-bestowing birthdays, they should solemnly prepare an altar, perform rites according to their means, and offer sacrifices to the Five Directions and Five Elders—manifestations of my transformed body, the life-registering sagely hosts of the Five Dipper Star Lords and life-determining spirits. They should present offerings of money and goods to repay the assembled perfected ones, who will then inscribe their lives, allowing them to be born in the Central Kingdom and receive the sheltering grace of the Great Dao.\n\nAt the time of birth, the celestial and terrestrial bureaus permit the pledging of one’s life-bound money. Those born under *jia* or *yi* belong to the Eastern Dipper’s Nine Qi; at birth, they pledged nine myriad strings of cash. Those born under *bing* or *ding* belong to the Southern Dipper’s Three Qi; at birth, they pledged three myriad strings of cash. Those born under *wu* or *ji* belong to the Central Dipper’s Twelve Qi; at birth, they pledged twelve myriad strings of cash. Those born under *geng* or *xin* belong to the Western Dipper’s Seven Qi; at birth, they pledged seven myriad strings of cash. Those born under *ren* or *gui* belong to the Northern Dipper’s Five Qi; at birth, they pledged five myriad strings of cash.\n\nIf there are faithful men and women who cultivate myriad good roots, ensuring their goodness remains unbroken through successive lives, they must offer sacrifices to repay their life-bound money. The celestial and terrestrial bureaus each possess clear records: the Twelve Life-Bound Ones and the Twelve Treasury Spirits. Those born in the *zi* hour belong to the first treasury; those born in the *chen* hour, the second; those born in the *shen* hour, the third; those born in the *hai* hour, the fourth; those born in the *mao* hour, the fifth; those born in the *wei* hour, the sixth; those born in the *yin* hour, the seventh; those born in the *wu* hour, the eighth; those born in the *xu* hour, the ninth; those born in the *si* hour, the tenth; those born in the *you* hour, the eleventh; and those born in the *chou* hour, the twelfth. Each person possesses their own treasury of fate and fortune. If, on their life-bound day, they complete the sacrificial rites without omission, they will enjoy peace in this life, smooth passage in all endeavors, unobstructed good fortune, and the fulfillment of their wishes. Their life-bound stellar officials will constantly bestow shelter, ensuring longevity. At the time of death, they will not lose their human form but will be reborn into wealth, nobility, civil or martial prominence, with stars of fortune and emolument illuminating their destiny, womb palace, and life. They will enjoy peace, longevity, and avoid inauspicious conditions.\n\nIf there are men or women of meager fate and insufficient means to perform the rites, on their life-bound day, they may invite one or two, or three to five Orthodox Unity Daoist priests to their home or a temple. They may recite the *Precious Scripture of the Five Dipper Golden Chapters* or undertake the recitation themselves. For each recitation, they may deduct ten thousand strings of cash. Alternatively, with sincere devotion, they may invoke the Life-Receiving Heavenly Worthy, reciting a thousand or ten thousand times, ensuring rebirth among humans for three successive lives as a man, with all five limbs intact, tenfold majesty, and universal reverence, encountering the supreme and perfect Dao.\n\nAt that time, the Five Directional Five Elder Emperor Lords, the Five Dipper Star Lords, the Six Bureau Star Lords of the Southern Dipper, the Seven Origins Star Lords of the Northern Dipper, the Sagely Hosts of the Nine Heavens, the Life-Bound Star Officials, the Origin-Star Officials, the Merit Officers and Spirit Officials, the Golden Lads and Jade Maidens, and the assembled immortals, having heard Lord Lao expound this true scripture, rejoiced as one, bowed in gratitude to the Mysterious Origin, and each vowed to receive and uphold it.\n\nThen, the Primordial Elder Emperor Lord stepped forward, knelt, and offered this verse in reverence, bowing in gratitude before withdrawing with solemnity:\n\n*I bow to the True Origin, the Supreme Worthy,*\n*With wholehearted faith in the inconceivable.*\n*Such wondrous dharma I had never heard—*\n*Today, at this moment, I have attained it all.*\n*It illuminates darkness with radiant light,*\n*And serves as a skilled physician for illness.*\n*Wondrous indeed, the divine incantations and five sacred talismans!*\n*I vow to take refuge and receive them all.*\n\nThus concludes *The Scripture of the Five Dipper Golden Chapters on Receiving Life*, as spoken by Lord Lao the Most High.",
      "overlap_context": "al Direction**:\n\n*The Universal Overseer of the Multitudes of Spirits, the Heaven of the Twelve.*\n*The Primordial Numinous Primordial Elder, the Twelve Heavenly Lords.*\n*The Registrar and Auditor of Records, the deity who governs the spleen.*\n*The virtue of Earth stabilizes the essence, uniting with the Dao to merge with the true.*\n\nThis talismanic chapter resides in the human spleen. If one suffers from spleen disease, write it in cinnabar, burn it to ashes, and ingest it for an immediate cure.",
      "start_char": 1272,
      "end_char": 2432,
      "start_sentence": 35,
      "end_sentence": 65,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.648376941680908,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\太上老君说五斗金章受生经.txt",
        "category": "本文类"
      }
    }
  ]
}