{
  "source_id": "太乙金华宗旨",
  "source_file": "chunked_daozang\\太乙金华宗旨.json",
  "total_chunks": 9,
  "total_original_chars": 10629,
  "total_translated_chars": 58181,
  "total_translation_time": 273.43177795410156,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\藏外\\太乙金华宗旨.txt",
    "category": "藏外"
  },
  "full_translation": "**The Supreme Principles of the Golden Flower of the Great One**\n\n**Chapter One: The Celestial Heart**\n\nThe natural is called the Dao. The Dao has no name or form—only singular nature, only the primordial spirit. Nature and life cannot be seen; they are lodged in celestial light. Celestial light cannot be seen; it is lodged in the two eyes. Since ancient times, the immortals and perfected ones have transmitted this orally, passing it from one to another. Since the Supreme Lord revealed the teachings, they were transmitted through Donghua to others, reaching the Northern and Southern Schools. The Complete Reality School flourished to its peak, yet its flourishing lay in its multitude of followers, while its decline stemmed from the loss of the heart-transmission. By today, it has become utterly diluted and degenerate! Degeneration has reached its extreme, and at the extreme, it must return. Thus, the Pure Brightness Patriarch Xu, in his compassion, universally delivered beings and established these principles of transmission beyond the teachings, guiding those of superior roots. Those who hear this meet an opportunity rare across kalpas; those who receive it encounter a dharma assembly of the moment. All should reverently embody Patriarch Xu’s苦心, establishing a firm foundation in the midst of human relations and daily life before cultivating the true and awakening to nature.\n\nNow, as I presumptuously serve as your guide, I first elucidate *The Supreme Principles of the Golden Flower of the Great One*, then expound upon them in detail. The *Great One* refers to the supreme. The alchemical secrets all rely on effortful practice to attain effortlessness, yet this is not the principle of direct, single-leap entry. The transmitted principles directly elevate the work of nature, not falling into secondary methods—hence their subtlety.\n\nThe *Golden Flower* is light. What color is light? Drawing its image from the golden flower, it secretly contains the character of light within. This is the true *qi* of the primordial Great One, the singular essence of the watery lead. The practice of *returning the light* employs the method of reversal, directing contemplation toward the Celestial Heart. The Celestial Heart resides in the sun and moon of the eyes.\n\n*The Yellow Court Scripture* states: *\"A cun-field and chi-residence can nurture life.\"* The *chi-residence* is the face; the *cun-field* upon the face—what is this if not the Celestial Heart? Within this square inch lie the sublime realms of *Yulu Xiaotai* and the marvels of *Yujing Danque*, the abode of the spirit most empty and numinous. The Confucians call it *\"the empty center\"*; the Buddhists, *\"the numinous terrace\"*; the Daoists, *\"the ancestral earth,\"* *\"the Yellow Court,\"* *\"the mysterious pass,\"* *\"the primordial aperture.\"* The Celestial Heart is like a dwelling, while light is its master. Thus, with a single return of the light, the *qi* of the entire body ascends in homage, like a sagely king establishing his capital and setting the axis—all bearing jade and silk come from the myriad states. Or like a master of keen discernment, where servants and maids naturally obey commands, each attending to their duties.\n\nDisciples need only return the light—this is the supreme, wondrous recitation. Light is easily stirred but difficult to stabilize. After prolonged return, this light congeals, becoming the natural dharmakāya, and the spirit coalesces above the nine heavens. This is what *The Heart Seal Scripture* calls *\"silent audience and ascension.\"* In practicing these principles, there is no other method of advancement—only pure contemplation of this.\n\n*The Śūraṅgama Sūtra* states: *\"Pure contemplation leads to flight; one must be born in heaven.\"* Heaven is not the azure sky but being born in the body of the *Qian* palace. Over time, naturally, there arises a body beyond the body.\n\nThe Golden Flower is the Golden Elixir. The transformations of spirit and illumination depend entirely on the heart. Though this wondrous secret does not err by a hair’s breadth, it is profoundly dynamic. It demands both intelligence and tranquility—only those of extreme intelligence can practice it; only those of extreme stillness can preserve it.\n\n**Chapter Two: The Primordial Spirit and the Conscious Spirit**\n\nHeaven and Earth regard humans as mayflies; the Great Dao regards Heaven and Earth as bubbles. Only the primordial spirit and true nature transcend the primordial and ascend beyond. Their essence and *qi* perish with Heaven and Earth. Yet with the primordial spirit present, there is the Infinite. The generation of Heaven and Earth arises from this.\n\nDisciples need only guard the primordial spirit to transcend life beyond yin and yang, outside the Three Realms. This is possible only through seeing nature—what is called the original face.\n\nWhen a person enters the womb, the primordial spirit resides in the square inch, while the conscious spirit dwells in the lower heart. The lower heart of flesh and blood is shaped like a large peach, covered by the lungs, assisted by the liver, and supported by the large and small intestines. If one goes a day without eating, discomfort arises in the heart. Upon hearing a fright, it leaps; upon encountering anger, it stifles. Witnessing death brings sorrow; seeing beauty brings dizziness. Yet the Celestial Heart above the head never stirs in the slightest.\n\nHow could the Celestial Heart fail to move the true intention within the square inch? When it moves, it is not wondrous—yet it is most wondrous. For ordinary people, it moves only at death, which is inauspicious. Most wondrous is when the light has congealed into the dharmakāya, gradually becoming spiritually responsive and desiring to move—this is the untransmitted secret of ages.\n\nThe lower conscious heart is like a powerful warlord or fierce general, taking advantage of the sovereign’s dimness to seize control. Over time, the great sword is inverted. Now, by concentrating and guarding the primordial palace, it is as if a wise and enlightened ruler sits upon the throne. The two eyes returning the light are like loyal ministers assisting on the left. With internal governance pacified, naturally, all traitors lay down their weapons and beg for life.\n\nIn the Dao of the Elixir, essence-water, spirit-fire, and intention-earth are the supreme secrets. Essence-water is the true unity of primordial *qi*; spirit-fire is light; intention-earth is the Celestial Heart of the central palace. Spirit-fire is employed, intention-earth is the essence, and essence-water is the foundation.\n\nHumans are born of intention, and the body is not merely seven feet. Within the body resides the *po*. The *po* acts through the conscious spirit, and the conscious spirit arises from the *po*. The *po* is yin, the substance of the conscious spirit. If the conscious spirit is not severed, through endless lives, the *po* transforms its form and alters its substance.\n\nOnly the *hun* is where the spirit is stored. By day, the *hun* lodges in the eyes; by night, it rests in the liver. Lodging in the eyes, it sees; resting in the liver, it dreams. Dreaming is the spirit’s journey—across the nine heavens and nine earths, traversed in an instant.\n\nWhen awakened, one is plunged into profound obscurity, bound by form—bound, that is, by the *po*. Thus, turning the light inward refines the *hun*, preserves the spirit, subdues the *po*, and severs the conscious mind. The ancient method of transcending the world entails refining away all yin dregs to return to pure yang—nothing more than dissolving the *po* and perfecting the *hun*.\n\nTurning the light inward is the secret to dissolving yin and restraining the *po*. Though it may not yet achieve the return to pure yang, the method of turning the light is itself the turning back, for light is yang, and to turn it is to return it. By abiding in this practice, essence-water naturally abounds, spirit-fire arises, intention-earth solidifies, and the sacred embryo may take form.\n\nThe dung beetle rolls its ball, and within the ball, white life emerges—such is the pure work of concentrated spirit. If even a ball of dung can nurture life to hatch from its shell, then how could the resting place of the Celestial Heart, where spirit is directed, fail to generate a body?\n\nOnce the single numinous nature descends into the Palace of Qian, it divides into *hun* and *po*. The *hun* resides in the Celestial Heart—yang, the light and clarity of illumination—born of the Great Void, sharing the same form as the Primordial Beginning. The *po* is yin, the heavy and turbid qi, clinging to the mundane heart of form. The *hun* delights in life, while the *po* longs for death. All desires for beauty and stirring of qi are the work of the *po*—the conscious spirit. After death, it feasts on blood offerings; in life, it suffers greatly, for yin returns to yin. Like attracts like.\n\nWhen the practitioner refines away the yin *po*, they become pure yang.\n\n**Chapter Three: Turning the Light Inward to Guard the Center**\n\nWhence comes the name \"turning the light inward\"? It originates with the Perfected One of Wenshi. Turning the light inward condenses the qi of heaven and earth, yin and yang—this is what is meant by \"pure thought,\" \"pure qi,\" and \"pure contemplation.\"\n\nAt first, practicing this method feels as if something exists within nothing. With time and mastery, a body arises beyond the body—nothing becomes as if something. After a hundred days of dedicated practice, the light becomes true, and only then is it spirit-fire. After a hundred days, a single point of true yang spontaneously arises within the light, like a millet pearl—just as conception occurs when husband and wife unite. One must then remain still and await it. The turning of the light is the fire-timing.\n\nWithin the primordial transformation, yang light presides as the sovereign. In the realm of form, it is the sun; in humans, it is the eyes. Nothing leaks the spirit-mind more readily than this. Thus, the Way of Golden Flower employs the method of reversal.\n\nTurning the light inward does not mean merely returning the essence of one’s body; it is the return of the true qi of creation. It is not merely the cessation of momentary delusions but the emptying of kalpas of samsara. Therefore, one breath corresponds to a year in the human world, and one breath to a hundred years in the long night of the nine paths.\n\nFrom the moment of birth, people follow circumstances and live in accord with them, never once turning their gaze inward. As yang qi wanes and perishes, they enter the realm of the nine darknesses. Thus, the *Śūraṅgama Sūtra* states: \"Pure thought ascends; pure emotion descends.\" Learners, with more emotion than thought, sink into lower realms. Only by observing the breath in stillness can true awakening arise—this is the method of reversal.\n\nThe *Classic of the Hidden Talisman* says: \"The mechanism lies in the eyes.\" The *Yellow Emperor’s Inner Canon* states: \"The essence of the human body all ascends and gathers in the empty orifices.\" Mastering this single point is where longevity and transcendence both lie. This is the practice that unifies the three teachings.\n\nThe light is neither within nor beyond the body. Mountains, rivers, the great earth, the illumination of sun and moon—all are this light, so it is not confined within the body. Wisdom, intelligence, all movement and transformation—none are apart from this light, so it is also beyond the body.\n\nThe light of heaven and earth fills the cosmos; the light of a single body likewise pervades the sky and covers the earth. Thus, when one turns the light inward, all—heaven, earth, mountains, and rivers—turns with it.\n\nThe essence of a person ascends and gathers in the eyes—this is the great pivot of the human body. Consider this: if one does not sit in stillness for even a day, where will this light flow and come to rest? But if one can sit in stillness for even a moment, the kalpas of birth and death are resolved from that point. All methods return to stillness—truly inconceivable, this wondrous path.\n\nYet in practice, one proceeds from shallow to deep, from coarse to refined, with unbroken continuity as the key. The work remains the same from beginning to end, though its warmth and coolness are known only to the practitioner. The goal is to return to the vastness of heaven and sea, where the ten thousand methods are as they are—only then is the method truly grasped.\n\nThe sages of past and present all transmitted this: it is nothing other than reflection. Confucius called it \"extending knowledge,\" the Buddha \"observing the mind,\" and Laozi \"inner contemplation\"—all refer to this method. Yet though everyone speaks of \"reflection,\" few grasp it, for they do not understand its meaning.\n\n\"Reflection\" means turning the mind of self-awareness back to the unmanifest origin of form and spirit. Within these six feet of ours, we return to seek the body of the ten heavens before their birth. Today, people sit in stillness for an hour or two, glance inward at their selfish thoughts, and call it \"reflection\"—how could they ever reach the end?\n\nThe patriarchs of Buddhism and Daoism taught people to \"look at the tip of the nose,\" but this does not mean fixing the mind on the nose’s end, nor does it mean gazing at the nose while the mind rests in the central yellow. Where the eyes go, the mind follows—how can it be both above and below, now here and now there? These are all mistaken pointers for the moon.\n\nWhat, then, is the true meaning? The phrase \"tip of the nose\" is most subtle—it merely uses the nose as a reference point for the eyes. It is not about the nose itself. If the eyes are opened too wide, they see far and miss the nose. If they are closed too tightly, they see nothing at all. Opening too wide scatters the mind outward; closing too tightly drives it inward into dullness.\n\nOnly when the eyelids are lowered to the proper degree—neither too open nor too closed—can the tip of the nose be seen just right, and thus it serves as the reference point. The key lies in lowering the lids to the exact middle, allowing the light to enter naturally without any effort to direct or withhold it. When observing the tip of the nose, merely glance at it once when first settling into stillness to set the reference, then let it go. Like a plasterer using a plumb line, once the line is hung at the start, the work proceeds accordingly—there is no need to keep staring at the line.\n\n*Śamatha-vipaśyanā* is the Buddha’s teaching, and it is not secret. With both eyes gazing evenly at the tip of the nose, sit upright and settle the mind on the central point—not necessarily within the head, but simply where the two [eyes] align at their midpoint. Light is a living, vibrant thing; when the mind is fixed at the midpoint between the two [eyes], the light naturally enters without needing to focus on the central palace. These few words encompass the essential principle. For further details on entering and exiting stillness, one may consult the *Śamatha-vipaśyanā* texts for verification.\n\nThe term \"central point\" (*yuán zhōng*) is most subtle. The center is nowhere absent, pervading the great Dao in its entirety—here, it merely hints at the mechanism of creation, serving as the gateway to entry. \"Central\" (*yuán*) means taking this as the starting sign, not as a fixed attachment. The meaning of these two characters is profoundly alive and wondrous.\n\n*Śamatha* and *vipaśyanā* are inseparable—they are *samādhi* and *prajñā*. Whenever a thought arises thereafter, do not remain seated as before. Instead, investigate where this thought arises, from where it originates, and where it ceases. Examine it repeatedly, and you will find it unattainable. This is seeing the arising of the thought—do not then seek its origin further, for the mind is unattainable. \"I have pacified your mind for you\"—this is true insight. The opposite of this is called false insight.\n\nIf, after such investigation, nothing is found, simply return to the continuous practice of *śamatha*, followed by *vipaśyanā*, and *vipaśyanā* followed by *śamatha*—this is the dual cultivation of *samādhi* and *prajñā*, known as \"turning the light around.\" \"Turning\" (*huí*) is *śamatha*, and \"light\" (*guāng*) is *vipaśyanā*. *Śamatha* without *vipaśyanā* is having the turning but no light; *vipaśyanā* without *śamatha* is having the light but no turning. Take heed of this.\n\n**Chapter Four: Turning the Light Around and Regulating the Breath**\n\nThe principle is simply to proceed with a pure mind, without seeking verification, for verification will come of its own accord. Generally, beginners’ afflictions boil down to two: dullness and distraction. To remedy these, there is no better method than entrusting the mind to the breath. The breath is one’s own mind—when the mind moves, qi arises, for qi is the transformation of the mind. Human thoughts are swift: in an instant, a single deluded thought corresponds to a single breath. Thus, inner and outer breathing follow one another like sound and echo. In a day, there are tens of thousands of breaths, and thus tens of thousands of deluded thoughts. When the spirit’s clarity is exhausted, one becomes like withered wood or dead ashes.\n\nYet can one be without thoughts? One cannot. Can one be without breath? One cannot. Better to turn the affliction into medicine—this is the interdependence of mind and breath. Therefore, \"turning the light around\" is combined with breath regulation, a method that fully employs the \"ear’s light.\" There is the \"eye’s light\"—the external union of sun and moon—and the \"ear’s light\"—the internal union of sun and moon’s essence. Yet essence is merely where light congeals; they emerge from the same source but have different names. Thus, wisdom and clarity are but a single spiritual light.\n\nWhen sitting, lower the eyelids, set the reference point, and then let go. If letting go entirely proves difficult, then focus the mind on listening to the breath. The breath’s inhalation and exhalation should not be audible to the ear; listen only for its soundlessness. If there is sound, it is coarse and cannot enter subtlety. Instead, patiently and gently refine it, making it increasingly subtle, and the subtler it becomes, the stiller it grows. Over time, the subtle breath will suddenly cease, and the true breath will appear—then the essence of the mind can be recognized.\n\nFor when the mind is refined, the breath is refined; when the mind is unified, qi moves. When the breath is refined, the mind is refined; when qi is unified, the mind moves. To stabilize the mind, one must first cultivate the heroic spirit, for the mind has no place to grasp—thus, one relies on qi as the starting sign, which is the guarding of pure qi. You may not understand the word \"move\" (*dòng*): it refers to being pulled by a thread, akin to the character \"restrain\" (*zhì*). If one can be made to move by rushing about, can one not also be made to rest through pure stillness? This is how the great sages, observing the interplay of mind and qi, devised expedient means to benefit later generations.\n\nThe alchemical texts say: \"The hen can hatch eggs by constantly listening\"—this is the essential secret. The hen’s ability to hatch eggs depends on warmth. Warmth can only heat the shell; it cannot enter the interior. Thus, the mind draws qi inward, and in listening, the mind is wholly focused. When the mind enters, qi enters, and with the warmth of qi, life is born. Even when the mother hen leaves the nest, she keeps her ear cocked, for her spirit remains undivided. Where the spirit is undivided, warmth persists day and night without interruption, and the spirit becomes alive.\n\nWhen the spirit is alive, it is because the mind has first died. To \"die the mind\" does not mean withering it, but making it single-minded and undivided. The Buddha said: \"Place the mind in one place, and nothing will be unaccomplished.\" The mind tends to wander, so refine it with qi; qi tends to coarsen, so refine it with the mind. How could there be no stability in this? Generally, the two afflictions of dullness and distraction can only be resolved through daily, uninterrupted practice of stillness, which will naturally lead to great rest. If one does not sit in stillness, even if distracted, one remains unaware. Once aware of distraction, this very awareness is the opportunity to dispel it.\n\nDullness one is unaware of and dullness one is aware of—how vastly different they are! Unaware dullness is true dullness. Aware dullness is not entirely dullness, for clarity is present within it.\n\nDistraction is the spirit’s scattering; dullness is the spirit’s lack of clarity. Distraction is easier to remedy, while dullness is harder to cure. It is like illness: pain and itching can be treated with medicine, but dullness is the symptom of numbness and insensitivity. What is scattered can be gathered, what is chaotic can be ordered, but dullness is sluggish and obscure. In distraction, there is still some direction, but in dullness, the *po* soul dominates entirely. In distraction, the *hun* soul still lingers, but in dullness, pure yin prevails.\n\nDuring stillness practice, if one drifts toward sleep, this is dullness. To counter dullness, focus on regulating the breath. The breath here refers to the inhalation and exhalation through the mouth and nose—though not the true breath, the true breath’s movement is also lodged within it. Whenever sitting, one must quiet the mind and refine the qi. How to quiet the mind? By attending to the breath. The breath’s coming and going is known only to the mind; it should not be audible to the ears. If inaudible, it becomes subtle; subtle, it becomes clear. If audible, the qi grows coarse; coarse, it becomes turbid; turbid, it leads to dullness and sleep—this is the natural principle.\n\nThough the mind is directed toward the breath, one must skillfully apply this focus—it is a use that is no-use, requiring only a faint awareness. This phrase holds a subtle meaning. What is \"illumination\"? It is the eye’s light turning inward. The eyes should see inwardly, not outwardly; not seeing outwardly yet remaining alert is inward seeing—though not literally so. What is \"listening\"? It is the ear’s light turning inward. The ears should listen inwardly, not outwardly; not listening outwardly yet remaining alert is inward listening—though not literally so. To listen is to listen to silence; to see is to see formlessness. If the eyes do not look outward and the ears do not listen outward, they may turn inward and scatter. Only by inward seeing and inward listening can one avoid both outward scattering and inward dissipation, thus preventing dullness in the center—this is the union of sun and moon, the intermingling of their essences.\n\nWhen dullness and sleepiness arise, rise and walk about until the spirit clears, then sit again. In the early morning, when time permits, sitting for the duration of one incense stick is ideal. After noon, worldly affairs multiply and dullness easily sets in, yet one need not rigidly adhere to one incense stick. As long as all conditions are set aside and one sits in stillness for a time, over time one will find entry and avoid falling into dullness and sleep.\n\n---\n\n**Chapter Five: Errors in Turning the Light Around**\n\nAs your practice gradually matures, though you may have reached the barren tree and rocky crag, mistakes remain plentiful. Here, I will offer detailed guidance. The subtleties of this matter can only be known once one has arrived; now, I may speak of them.\n\nOur tradition differs from the Chan school in that it proceeds step by step with verification. Let me first explain the points of divergence, then the verifications.\n\nWhen about to engage in the essential practice, I employ expedient means: do not overuse the mind, but allow it to be lively and free, so that qi harmonizes and the mind settles. Only then enter stillness. In stillness, one must grasp the opportunity and the key—do not sit in a state of emptiness, which is the blankness of unawareness. Amidst the release of all conditions, remain alert and self-possessed. Yet one must not rely on intention or enthusiasm, for excessive earnestness easily leads to this. It is not that earnestness is inappropriate, but the true subtlety lies in the realm of \"as if present, as if absent\"—it may be attained through a state of intentional non-intention.\n\nAmidst alert clarity, release remains effortless. One must also avoid falling into the *skandha* realm, where the five aggregates become the workings of *māra*. Some enter samādhi with an excess of withered wood and dead ashes, lacking the vitality of spring across the great earth. This is falling into the yin realm: the qi grows cold, the breath sinks, and many signs of cold and decay appear. Over time, one becomes like wood or stone.\n\nOne must also avoid being carried away by the myriad conditions. Upon entering stillness, if various thoughts suddenly arise and cannot be dismissed, following them may feel agreeable—this is the master becoming enslaved. Over time, one falls into the realm of desire. The superior among these may be reborn in heaven, the inferior among foxes and spirits. Dwelling in famous mountains, they enjoy their own pleasures—wind and moon, flowers and fruits, jade trees and fragrant herbs—for three to five hundred years, even thousands, yet when their retribution ends, they are reborn among the various destinies. These are all erroneous paths.\n\nOnce the erroneous paths are known, one may seek verification.\n\n---\n\n**Chapter Six: Verifications of Turning the Light Around**\n\nVerifications are many and cannot be undertaken by those of shallow roots or limited capacity; one must aspire to deliver all beings. Nor can they be undertaken with a careless or arrogant mind; one must approach these words with reverence.\n\nIn stillness, a continuous, unbroken flow arises, and the spirit becomes joyful and at ease, as if intoxicated or bathed—this is the body suffused with yang harmony, the first blossoming of the Golden Flower. Then, all sensations subside, and the bright moon hangs in the sky, revealing the entire world as a realm of light—this is the opening of the mind’s essence, the full radiance of the Golden Flower. Next, the body becomes replete and impervious to wind and frost; what others find dull, I encounter with heightened vitality. Golden halls rise, jade terraces stand; the decaying things of the world, when I breathe true qi upon them, instantly revive. Red blood transforms into milk, and this seven-foot frame of flesh becomes nothing but gold and treasure—this is the great congealing of the Golden Flower.\n\nThe first stage corresponds to the *Sutra on Visualizing the Buddha of Infinite Life*, which states: *\"The withered great waters and the symbolic trees of the Dharma.\"* The setting sun begins from primordial chaos, the Wuji. The highest good is like water—clear and flawless—this is the sovereign of the Taiji, the Lord emerging from *Zhen*.\n\nThe *Zhen* trigram corresponds to wood, hence the symbolic representation of the rows of trees—seven tiers of trees for the seven apertures of radiant clarity. The northwest *Qian* direction, shifted one position, becomes *Kan*, symbolizing the withered great waters, an image of *Qian* and *Kan*. *Kan* governs the *Zi* direction; at the winter solstice, thunder lies hidden within the earth, rumbling faintly, until *Zhen* emerges as yang rises above the ground—this is the image of the rows of trees. The rest may be deduced by analogy.\n\nThe second stage begins here, as the great earth turns to ice, becoming a lapis lazuli jeweled ground where luminosity gradually congeals. Thus arises the lotus terrace, and from it, the Buddha—what else could this manifestation of golden nature be but the Buddha, the fully awakened Golden Immortal? This is the great verification of the process. Three verifiable signs may be observed in the present:\n\nFirst, when seated, the spirit enters the valley; hearing others speak is like listening from a mile away, yet every word is distinctly clear, and their voices echo as if answering from within the valley. Though they are heard, I remain untouched by hearing—this is the spirit abiding in the valley, verifiable at any time.\n\nSecond, in stillness, the eyes radiate a brilliant light, filling all before them with whiteness, as if enveloped in clouds. Opening the eyes to seek the body, it cannot be found—this is the empty chamber generating brightness, inner and outer luminosity united, the auspiciousness of perfect stillness.\n\nThird, in stillness, the flesh becomes fine and supple, like silk or jade, and in sitting, one feels unable to remain grounded, as if floating upward—this is the spirit returning to the crown of the head, and with time, ascension may be awaited at any moment.\n\nThese three are verifiable in the present. Yet the manifestations are inexhaustible, varying with each practitioner’s capacity, as the *Mohe Zhiguan* states: *\"The arising of wholesome roots takes diverse forms.\"* This matter is like one who drinks water—cool or warm, only the drinker knows. One must trust oneself truly.\n\nThe primordial qi of pre-heaven is to be sought within present verification. Once this qi is attained, the elixir forms instantly—this is the single grain of true millet pearl. One grain upon another, from the subtle to the manifest.\n\nThere is the pre-heaven of the moment—a single grain—and the pre-heaven of the whole—a single grain extending to the boundless. Each grain possesses its own power; here, boldness is the foremost principle.\n\n**Chapter Seven: The Method of Revolving the Light**\n\nRevolve the light step by step, without neglecting one’s proper duties. As the ancients said: *\"When affairs arise, respond to them; when things appear, recognize them.\"* Address matters with right mindfulness, and the light will not be swayed by external phenomena—the light will naturally return. This is the revolving of the light in formlessness, yet how much more so when the light is truly focused in form?\n\nIn daily life, maintain moment-to-moment reflection, free from the slightest trace of self or other—this is the revolving of the light in every circumstance, the foremost wondrous function. Rising early to dispel all entanglements and sitting in stillness for one or two hours is most excellent. In all dealings with affairs and people, employ the method of reflection, ensuring no interruption. Practicing thus for two or three months, the immortals of heaven will surely come to affirm it.\n\n**Chapter Eight: The Carefree Formula**\n\nThe Jade Clarity left behind the carefree formula:\nFour words—concentrate the spirit and enter the qi cavity.\nIn the sixth month, suddenly white snow flies;\nAt the third watch, the sun’s wheel blazes forth.\nFrom the water, the *Xun* wind is blown aloft;\nIn the heavens, one roams and returns to feast on *Kun*’s virtue.\nThere is yet one phrase within the profound:\nThe land of Nothing-Whatsoever is the true dwelling.\n\nA single regulated verse encompasses all mysteries. The essence of the great Dao lies in nothing other than *\"non-doing while doing.\"* Only through non-doing does one avoid attachment to form and locality; only through non-doing while doing does one avoid falling into stagnant emptiness or dead void.\n\nAll functioning revolves around the center, yet the pivot lies entirely in the two eyes. The two eyes are the handle of the Dipper, governing the rotation of creation and the circulation of yin and yang. The great medicine is ever the water’s gold—namely, the lead of the watery realm.\n\nThe earlier discussion of revolving the light was guidance for beginners, turning the outer to master the inner, like the minister aiding the sovereign. This pertains to those of middle and lower capacity, who refine the lower two passes to penetrate the upper one. Now, as the threads become clearer and the mechanism more familiar, heaven does not withhold the Dao—it reveals the supreme principle. Guard this well, guard this well! Exert yourselves, exert yourselves!\n\nRevolving the light is but a general term. With each advance in practice, the light’s brilliance intensifies, and the method of return becomes ever more wondrous. Previously, the outer was used to master the inner; now, one resides at the center to govern the outer. Previously, the minister aided the sovereign; now, the sovereign is served and proclaimed—what a complete reversal!\n\nWhen entering stillness, first harmonize body and mind, attaining ease and tranquility. Release all entanglements, clinging to nothing. The celestial mind is rightly positioned in the hands. Then, lower the eyelids as if receiving a sacred decree to summon a great minister—who would dare disobey?\n\nNext, with the two eyes, inwardly illuminate the *Kan* palace. Where the light reaches, true yang emerges in response. *Li* outwardly is yang but inwardly yin—this is the *Qian* body. When a single yin enters to become the master, it follows things and generates the mind, flowing outward in endless cycles. Now, with the revolving light inwardly illuminating, one does not follow things to generate the mind. Yin qi halts, and as the light radiates, pure yang arises. Like attracts like, so *Kan*’s yang ascends—not *Kan*’s yang, but *Qian*’s yang responding to *Qian*’s yang.\n\nWhen the two meet, they intertwine inseparably, vibrantly active, now appearing, now vanishing, now floating, now sinking. Within one’s original palace, it seems as vast as the infinite void, the body light and wondrous, ready to ascend—this is the clouds filling the dry mountains.\n\nNext, the coming and going leave no trace, floating and sinking are indistinguishable, the pulse stills, and qi halts—this is the true union, the moon cradling ten thousand waters.\n\nWhen in profound stillness, the celestial mind stirs—this is the return of the solitary yang, the living *zi* hour. Yet this subtle movement must be explained in detail.\n\nFor ordinary people, every glance and every listening causes the ears and eyes to chase after things, ceasing only when the object departs. In such motion and stillness, the common folk prevail, while the celestial sovereign is enslaved by them—this is dwelling among ghosts. Now, however, every motion and stillness resides with the person, and the celestial sovereign becomes a true person. When it moves, one moves with it—this is the Celestial Root; when it stills, one stills with it—this is the Moon Grotto. Stillness and motion arise without origin, and one follows them without origin; rest and activity rise and fall, and one follows them in their rising and falling—this is the Celestial Root and Moon Grotto idly coming and going.\n\nWhen the celestial mind is serene, to move against its timing is to err by immaturity; when the celestial mind has already stirred, to move in response afterward is to err by lateness. The moment the celestial mind stirs, one must ascend with true intention to the *Qian* palace, guiding with the spirit-light gazing at the crown—this is movement in timely response.\n\nOnce the celestial mind ascends to the *Qian* crown, it roams freely and at ease. Should it suddenly incline toward stillness, swiftly draw it with true intention into the Yellow Court, directing the gaze of the eyes to the central Yellow Spirit Chamber. Then, as the inclination toward stillness arises, not a single thought stirs. In gazing inward, one suddenly forgets the gaze itself. At this moment, body and mind undergo a great release, all conditions vanish without trace, and even the crucible and furnace of one’s spirit-chamber seem nowhere to be found. Seeking one’s own body, it is utterly unattainable—this is the moment when heaven enters earth, when the myriad wonders return to the root, the very instant of \"congealing spirit into the qi cavern.\"\n\nIn one turning of the light: at first, the scattered seeks to gather, the six senses cease functioning—this is nurturing the original source, adding oil to sustain life. Then, the gathered naturally drifts in ease, without expending the slightest effort—this is settling the spirit in the ancestral aperture, drawing together the primordial. Finally, echoes and reflections vanish entirely, and profound stillness prevails—this is hibernating in the qi cavern, the myriad wonders returning to the root.\n\nWithin one stage lie three stages; within one stage lie nine stages—all to be elaborated later. Now, taking one stage as comprising three: when nurturing begins in initial stillness, gathering is also nurturing, hibernation is also nurturing, and in the end, nurturing becomes hibernation. The middle layer may be inferred by analogy, where distinctions arise without altering the essence—this is the formless aperture, where a thousand places are one place. Distinctions arise without altering the timing—this is the timeless moment, an instant spanning kalpas and eons.\n\nThe human heart cannot stir without extreme stillness. To stir while forgetting the stirring is not the stirring of the original substance. Thus it is said: \"Moved by things, it stirs—this is the desire of nature.\" If it stirs not by things but of itself, this is the stirring of heaven. To know that stirring by things is the desire of nature, while stirring not by things but of itself is the stirring of heaven—if one does not oppose heaven’s stirring with heaven’s nature, the phrase falls into speaking of \"desire,\" for desire lies in the presence of things. This is thought stepping beyond its proper place, movement within movement.\n\nWhen not a single thought arises, the correct thought is born—this is true intention. Within profound stillness, the celestial mechanism suddenly stirs—is this not movement without intention? Action without acting—this is that intention.\n\nThe first two lines of the poem encapsulate the workings of Golden Flower. The next two express the mutual embodiment of sun and moon: the sixth month is the fire of *Li*, the flying white snow is the true yin within *Li* about to return to *Kun*. The third watch is the water of *Kan*, the solar orb is the solitary yang within *Kan* about to blaze forth and return to *Qian*. The extraction of *Kan* to fill *Li* is contained therein.\n\nThe following two lines describe the Dipper’s handle in operation, the full mechanism of ascent and descent—is not the water within *Kan*? The eyes are the wind of *Xun*; the gaze of the eyes enters the *Kan* palace to summon the essence of the great yang. The heavens above are the *Qian* palace; \"roaming and returning to feast on *Kun*’s virtue\" is the spirit entering and illuminating the center, heaven entering earth, nurturing the fire.\n\nThe final two lines point to the supreme secret within the secret, the secret within the supreme secret—from beginning to end, it cannot be parted from, what is called \"washing the heart and cleansing the thoughts,\" the bathing. The sagely learning begins with knowing where to halt and ends with halting at perfection, commencing from the limitless and returning to the limitless.\n\nBuddhism takes \"arising mind without abiding\" as the great essence of its treasury of teachings. Our Dao takes the two words \"attaining emptiness\" to complete the full work of nature and life. In sum, the three teachings reduce to a single phrase: the divine elixir for emerging from death and entering life.\n\nWhat is the \"divine elixir\"? Simply \"no mind in all circumstances.\"\n\nThe most arcane aspect of our Dao is bathing. The entire work of this text can be resolved in two words: \"heart empty.\" Now, with a single word, the secret is revealed, sparing decades of seeking.\n\nYou disciples fail to understand that within one stage lie three stages. I compare it to Buddhism’s three contemplations: emptiness, provisional existence, and the mean. First is the contemplation of emptiness, seeing all things as empty. Next is the contemplation of provisional existence: though knowing their emptiness, one does not destroy the myriad things but establishes all affairs within emptiness. Then, neither destroying the myriad things nor attaching to them—this is the contemplation of the mean.\n\nWhen practicing the contemplation of emptiness, one also knows the myriad things cannot be destroyed and yet does not attach to them—this encompasses all three contemplations. Yet ultimately, seeing emptiness is the most powerful, so one practices the contemplation of emptiness. In emptiness, emptiness is indeed empty, provisional existence is also empty, and the mean is also empty. In practicing the contemplation of provisional existence, one relies more on the power of the preceding stage: provisional existence is indeed provisional, emptiness is also provisional, and the mean is also provisional. In the mean, one also conceives of emptiness, yet it is not called emptiness but the mean.\n\nYet when practicing the contemplation of provisional existence, it is not called provisional but the mean—while as for the mean, there is no need to speak further.\n\nThough I sometimes speak of *li* alone and sometimes of *kan* in conjunction, I have never altered a single word. When I open my mouth to say it, the pivot lies entirely in the two eyes. This \"pivot\" is function—function that steers and turns the transformations of creation, not that creation is confined to this alone.\n\nThe six roots and seven apertures are all treasuries of radiant light; why single out the two eyes while ignoring the rest? One employs the yang of *kan* while still using the light of *li* to illumine and gather—this makes it clear.\n\nMaster Zhu’s teacher, whose name was Yuan-yu, once said: “A blind man cannot cultivate the Dao, but a deaf man may.” This accords with my own words, differing only in emphasizing the primary and secondary.\n\nThe sun and moon are originally one thing. What is called the dark place at the center is the true essence of the moon; the moon’s cavern is not in the moon but in the sun—what is called the moon’s cavern. Otherwise, one could simply say “moon” and be done. The white place within the moon is the true light of the sun; the sun’s light is instead in the moon—what is called the root of heaven. Otherwise, one could simply say “heaven” and be done.\n\nSun and moon, when separated, are only half; when united, they form a complete whole. Like a husband and wife: living apart, they do not make a household; only when man and woman are together is a family complete. Yet things are poor metaphors for the Dao. Husband and wife, when apart, remain two people; sun and moon, when apart, do not form a complete whole.\n\nUnderstand this, and the ears and eyes are likewise. I say that a blind man has no ears, and a deaf man has no eyes. Seen thus, what need is there to speak of one thing, or two eyes, or six resentments? The six roots are one root. What need to speak of seven apertures? The seven apertures are one aperture. My words merely reveal their interconnectedness, so that duality is not perceived. You disciples cling to their separateness, and so everywhere you replace your eyes.\n\n**Chapter Nine: A Hundred Days of Foundation-Laying**\nThe *Xinyin Jing* says: “When wind is turned back and blended, the hundred-day work is efficacious.” In sum, one must establish the foundation for a hundred days before true light appears. You disciples still possess only the light of the eyes—this is neither the fire of spirit, nor the light of nature, nor the torch of wisdom.\n\nAfter a hundred days of turning back, essence and qi naturally become full, true yang naturally arises, and true fire naturally exists within water. Proceeding with this, union occurs naturally, the embryo forms naturally, and I remain in the heaven of unknowing—while the infant is spontaneously perfected. If one harbors even the slightest intention, it is heterodox.\n\nA hundred days of foundation-laying—yet it is not merely a hundred days.\n\n**One Day of Foundation-Laying**\nOne day of foundation-laying—yet it is not merely a day. One breath of foundation-laying—yet it is not the breath of inhalation and exhalation. The breath is the heart itself; when the heart becomes breath, it is primordial spirit, primordial qi, primordial essence. Rising and falling, parting and uniting—all arise from the heart. Being and non-being, emptiness and fullness—all reside within thought. One breath, one life-sustaining hold—how could it be limited to a hundred days? Yet a hundred days is also but a single breath. The hundred days lie solely in gaining power: if power is gained by day, it is received by night; if power is gained by night, it is received by day. The hundred days of foundation-laying are but a jade decree. The words of perfected beings invariably resonate with the human body. The words of true teachers invariably resonate with the learner. This is the mystery within mystery—what cannot be explained. Only upon seeing one’s nature does one understand. Thus, learners must seek a true teacher to transmit the record, allowing their nature to unfold freely, each manifestation verified without fail.\n\n---\n\n**Chapter Ten: The Light of Nature and the Light of Discernment**\nThe method of turning the light inward originally pervades movement, stillness, sitting, and reclining—it depends solely on grasping the mechanism. I have previously instructed: *“In an empty chamber, light arises of itself.”* This light is not external. However, there is one point to note: before the light is seen, its appearance serves as verification. If one sees it as light and clings to it with intention, one falls into the realm of discriminative thought—this is not the light of nature. Disciples, pay no heed to whether there is light or not; simply ensure that no thought arises from thought.\n\nWhat is “no thought”? It is attained where all ceases, where all is settled.\nWhat is “arising thought”? One thought, one life-sustaining hold—this thought is the correct thought, unlike the thoughts of ordinary days. The present mind is thought; thought is the present mind. This mind is both light and elixir.\n\nWhen ordinary people see objects, their eyes perceive without discrimination—this is the light of nature, like a mirror reflecting without intent, like water reflecting without intent. After a moment, it becomes the “light of discernment,” for it begins to discriminate. When a mirror holds an image, the mirror is no longer a mirror; when water holds a reflection, the water is no longer water. When light is accompanied by discernment, what light remains?\n\nAt first, disciples possess the light of nature, but with the turning of thought, it becomes discernment. Once discernment arises, the light vanishes without a trace—not that the light is absent, but that the light has become discernment. The Yellow Emperor said: *“Sound does not generate sound but generates echo.”* This is the same principle. *The Śūraṅgama’s Investigative Entry* states: *“Not in dust, not in discernment—only select the root.”* What does this mean?\n\nDust is the external world, the so-called realm of objects, which has no connection to us. To pursue it is to mistake objects for oneself. Objects must return: the penetrating returns to doors and windows, brightness returns to the sun and moon. Borrowing them as one’s own, they are never truly ours. As for that which does not return to you—if not yours, then whose? Brightness returns to the sun and moon, but the luminosity of the sun and moon does not return. The heavens may lack sun and moon at times, but humans never lack the nature to see sun and moon. If so, then the discernment of sun and moon—can it truly be considered ours? Those who distinguish between brightness and darkness—when brightness and darkness are both forgotten, where does discernment reside? Thus, even this returns. This is the inner dust.\n\nOnly the seeing of nature does not return. When one sees the act of seeing, seeing is no longer seeing—then even the seeing of nature returns. What returns is the seeing of nature in the flow of discriminative thought, which is what Ānanda meant by *“the fault lies in your mind and eyes, causing you to wander.”* Initially, when entering the discernment of returning and distinguishing, the first seven all demonstrate that each returns. Thus, the seeing of nature is retained as Ānanda’s staff. Ultimately, even the seeing of nature is entwined with the eight consciousnesses (eye-consciousness, ear-consciousness, nose-consciousness, tongue-consciousness, body-consciousness, mind-consciousness, transmitting consciousness, and storehouse consciousness)—it is not truly non-returning. Only when even this is broken through does one attain the true seeing of nature, the true non-returning.\n\nDisciples, in turning the light inward, you are precisely turning toward the light of the original non-returning. Thus, not a trace of discernment is to be employed. What causes you to wander is only these six roots; what enables you to attain bodhi is also only these six roots. Yet neither dust nor discernment is used—it is not the roots that are used, but the nature within the roots.\n\nIf you turn the light inward without falling into discernment, you employ the primordial nature within the roots. If you turn the light inward while falling into discernment, you employ the discerning nature within the roots. The distinction lies within a hair’s breadth. Employing the mind is the light of discernment; letting go is the light of nature. A hair’s breadth spans a thousand miles—this must not be confused.\n\nIf discernment is not severed, spirit does not arise. If the mind is not empty, the elixir does not form. When the mind is pure, the elixir is present; when the mind is empty, the medicine is present. Not attaching to a single thing is called “mind purity”; not retaining a single thing is called “mind emptiness.” To see emptiness as empty is still not true emptiness. To forget even emptiness—this is called true emptiness.\n\n---\n\n**Chapter Eleven: The Union of Kan and Li**\nAll leakage of essence and spirit, all movement that engages with objects—this is Li. All gathering and turning of spirit and discernment, all stillness that inwardly contains—this is Kan. That which flows outward through the seven apertures is Li; that which returns inward through the seven apertures is Kan. One yin governs the pursuit of forms and sounds; one yang governs the return of hearing and sight. Kan and Li are yin and yang; yin and yang are nature and life; nature and life are body and mind; body and mind are spirit illumination.\n\nOnce one restrains and ceases the outflow of essence and spirit, not allowing them to wander with external conditions—that is true union. And in silent cross-legged sitting, there is no need to speak of it further.\n\n---\n\n**Chapter Twelve: The Celestial Cycle**\nThe celestial cycle is not governed by qi but by the arrival of the mind as its wondrous secret. If one insists on how the celestial cycle should be, this is forced growth. Guard without intention; move without purpose.\n\nGazing up at the heavens, the three hundred and sixty-five degrees are in constant flux, yet the handle of the Dipper remains eternally unmoving. The heart is the same. The heart is the turning mechanism; qi is the multitude of stars.\n\nThe qi of this body—its four limbs and hundred parts—is originally interconnected; one must not exert excessive force. In this refining, recognize the spirit of consciousness and sever deluded perceptions. Only then does the medicine arise. The medicine is not a tangible thing; it is the radiance of inherent nature, the true qi of prior heaven. Yet it appears only after great stillness, and there is no method of gathering—those who speak of gathering are gravely mistaken. With prolonged perception, the mind-ground becomes luminous, naturally emptying all leaks and liberating one from the sea of dust. If today it is dragon and tiger, tomorrow water and fire, it remains mere delusion.\n\nAs I once received from the mouth of the True One of Fire Dragon: I know not how the alchemical texts describe it differently. A day has one celestial cycle; a moment has one celestial cycle. Where Kan and Li unite, there is one cycle. My union is the turning of heaven itself. Unable to rest in the immediate, there are times of union and times of non-union. Yet heaven’s revolution never ceases for even a moment. If yin and yang harmoniously unite, the great earth is bathed in yang warmth, my central palace is rightly positioned, and all things flourish at once—this is the alchemical method of bathing. What else could it be but the great celestial cycle?\n\nWithin this, the firing times truly differ in magnitude, yet ultimately no distinction of great or small remains. When skill becomes natural, one no longer knows what Kan and Li are, nor what heaven and earth are—what is union, what is one or two cycles, where to seek the difference between great and small? In sum, the revolving of the entire body, though appearing vast, is small. Yet in a single revolution, heaven, earth, and the ten thousand things all revolve with it, and even within the square inch of the heart, it is vast.\n\nThe firing times of the golden elixir must return to spontaneity. Without spontaneity, heaven remains heaven, the ten thousand things remain the ten thousand things. To force their union is to fail in union. For instance, when the heavens are parched and yin and yang disharmonious, though Qian and Kun never cease their daily revolution, there remains much that is unnatural. If I can revolve yin and yang, adjusting them to spontaneity, clouds gather and rain falls, grasses and trees thrive, mountains and rivers flow freely. Even if there is discord, it dissipates at once—this is the great celestial cycle.\n\nAs for the wondrousness of the living midnight hour, to fixate on the exact midnight hour is to cling to form. Without clinging to form, one does not point to the exact midnight hour. How then to recognize the living midnight hour? Once recognized, there is indeed an exact midnight hour—are the two one or distinct? Neither exact nor living, one must perceive it truly. When true, all is exact, all is living. Without true perception, what is exact? What is living?\n\nFor example, the living midnight hour is what one perceives at all times. Yet when it arrives at the exact midnight hour, with will and qi clear and bright, the living midnight hour becomes even more manifest. Those who have not clearly recognized the living hour seek verification only in the exact hour. When the exact hour appears, the living hour is nothing short of wondrous.\n\n**Chapter Thirteen: Song of Exhortation to the World**\nI, burning with the heat of the elixir for the world’s deliverance,\nSpare not my compassion nor my loquacity.\nThe World-Honored One, too, acted for the great causal condition,\nDirectly pointing to birth and death—how lamentable!\nThe Old Lord, too, fretted over this body of mine,\nTransmitting the Valley Spirit, unrecognized by men.\nNow I briefly speak the path to seeking the true:\nThe Yellow Center penetrates the principle, bearing the Great Change,\nRightly positioned within the body is the mysterious pass.\nBetween zi and wu, one may settle the breath,\nLight returns to the ancestral aperture, the ten thousand spirits at peace.\nThe medicine arises from the rivers and plains, a single qi emerging,\nPiercing the curtain, transforming with golden radiance.\nA red sun ever blazing—\nYet people mistake it for the essence of Kan and Li.\nMoving heart and kidney creates separation—\nHow can one speak of harmonizing with heaven’s heart?\nIf heaven accords, the Dao naturally accords.\nLay down the ten thousand conditions, not a single thought arising.\nThis is the true Wuji of prior heaven,\nThe Great Void, silent and vast, its signs concealed.\nAt the gate of life and destiny, forget consciousness;\nWhen consciousness is forgotten, the original true appears.\nWater clear, the pearl manifests—profound and unfathomable,\nThe hindrances of beginningless kalpas suddenly empty.\nFrom the Jade Capital descends the Nine Dragons’ Register,\nNow ascending the Cloud Han, mounting the celestial pass,\nWielding thunder, driving lightning.\nConcentrating spirit and settling breath is the initial mechanism,\nRetreating to the secret ground is constant quiescence.\n\nI once delivered two lyrics to Zhang Zhennu—both contain the great Dao.\nThe hours after zi and before wu are not the time—it is Kan and Li.\nSettling the breath means each breath returning to the root, the Yellow Center.\nSitting means the heart unmoving.\nThe spine’s path is not the wheel on the back—\nIt is the direct thoroughfare to the Jade Capital.\nThe double pass—here there is that which is hard to speak.\nWhen the earth’s thunder shakes and mountain rain falls—true qi is born.\nWhen the yellow sprout emerges from the soil—the medicine is born.\nThese small two sections encompass the great path of cultivation.\nUnderstanding this, one will not be confused by others’ words.\n\nLong ago, the Master and Yanzi ascended the summit of Mount Tai,\nGazing toward the White Horse Gate of Wu.\nYanzi saw it as a bolt of silk;\nThe Master quickly covered his eyes,\nFearing he had overused his vision, causing the spirit-light to scatter.\nHow can one not strive to return the light?\nReturning the light lies in pure-hearted practice,\nSimply gathering the true breath to illumine the central palace.\nWith time, it naturally becomes spiritually efficacious and transformative.\nIn sum: stilling the heart to fix the illumination is the foundation;\nForgetting the heart and congealing qi is the effect;\nQi settling and heart emptying is elixir completion;\nHeart and qi merging as one is the nurturing;\nIlluminating the heart and seeing nature is the completion of the Dao.\n\nYou disciples must each strive to practice.\nTo waste time is lamentable.\nA day without practice is a day as a ghost.\nA single breath in this practice is a single breath as a true immortal.\nStrive! Strive!",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太乙金华宗旨 第一章天心 自然曰道，道无名相，一性而已，一元神而已。 性命不可见，寄之天光，天光不可见，寄之两目。 古来仙真，口口相传，传一得一。 自太上见化，东华递传某，以及南北两宗，全真可为极盛，盛者盛其徒众，衰者衰于心传，以至今曰，滥泛极矣!凌替极矣!极则返，故蒙净明许祖，垂慈普度，特立教外别传之旨，接引上根。 闻者干劫难逢，受者一时法会，皆当仰体许租苦心，必于人伦曰用间，立定脚跟，方可修真悟性。 我今叨为度师，先以太乙金华宗旨发明，然后细为开说，太乙者，无上之谓。 丹诀总假有为而臻无为，非一超直入之旨。 所传宗旨，直提性功，不落第二法门，所以为妙。 金华即光也，光是何色？ 取象於金华，亦秘一光字在内，是先天太乙之真气，水乡铅只一位者此也。 回光之功，全用逆法，注想天心，天心居曰月中。 《黄庭经》云：“寸田尺宅可治生，尺宅面也，面上寸田，非天心而何？ 方寸中具有郁罗肖台之胜，玉京丹阙之奇，乃至虚至灵之神所住。 ”儒曰：“虚中”； 释曰：“灵台”； 道曰：“祖土”； 曰“黄庭”、曰“玄关”、曰“先天窍”。 盖天心犹宅舍一般，光乃主人翁也。 故一回光，周身之气皆上朝，如圣王定都立极，执玉帛者万国； 又如主人精明，奴婢自然奉命，各司其事。 诸子只去回光，便是无上妙诵。 光易动而难定，回之既久，此光凝结，即是自然法身，而凝神于九霄之上矣。 《心印经》所谓“默朝飞升”者，此也。 宗旨行去，别无求进之法，在纯想于此。 《楞严经》云：“纯想即飞，必生天上，天非苍苍之天，即生身于乾宫是也。 久之，自然身外有身。 ” 金华即金丹，神明变化，各师于心，此种妙诀，虽不差毫末，然而甚活，全要聪明，又须沉静，非极聪明人行不得，非极沉静人守不得。 第二章元神、识神 天地视人如蜉蝣，大道视天地亦泡影。 惟元神真性，则超元全而上之。 其精气则随天地而败坏矣。 然有元神在，即无极也。 生天生地皆由此矣。 学人但能守护元神，则超生在阴阳之外，不在三界之中，此惟见性方可，所谓本来面目也。 凡人投胎时，元神居方寸，而识神则居下心。 下面血肉心，形如大桃，有肺以覆翼之，肝佐之，大小肠承之，假如一曰不食，心上便大不自在，至闻惊而跳，闻怒而闷，见死亡则悲，见美色则眩，头上天心何尝微微些动也。 间天心不能动乎方寸中之真意，如何能动。 到动时便不妙，然亦最妙，凡人死时方动，此为不妙;最妙者，光已凝结为法身，渐渐灵通欲动矣，此千古不传之秘也。 下识心，如强藩悍将，欺天君暗弱，便遥执纪纲，久之太阿倒置矣。 今凝守元宫，如英明之主在上，二目回光，如左有大臣尽心辅弼，内政既肃，自然一切奸雄，无不倒戈乞命矣。 丹道，以精水、神火、意土三者，为无上之诀。 精水云何乃先天真一之气，神火即光也，意土即中宫天心也。 以神火为用，意土为体，精水为基。 凡人以意生身，身不止七尺者为身也。 盖身中有魄焉，魄附识而用，识依魄而生。 魄阴也，识之体也，识不断，则生生世世，魄之变形易质无已也。 惟有魂，神之所藏也。 魂昼寓于目，夜舍于肝，寓目而视，舍肝而梦，梦者神游也，九天九地，刹那历遍。",
      "translated_text": "**The Supreme Principles of the Golden Flower of the Great One**\n\n**Chapter One: The Celestial Heart**\n\nThe natural is called the Dao. The Dao has no name or form—only singular nature, only the primordial spirit. Nature and life cannot be seen; they are lodged in celestial light. Celestial light cannot be seen; it is lodged in the two eyes. Since ancient times, the immortals and perfected ones have transmitted this orally, passing it from one to another. Since the Supreme Lord revealed the teachings, they were transmitted through Donghua to others, reaching the Northern and Southern Schools. The Complete Reality School flourished to its peak, yet its flourishing lay in its multitude of followers, while its decline stemmed from the loss of the heart-transmission. By today, it has become utterly diluted and degenerate! Degeneration has reached its extreme, and at the extreme, it must return. Thus, the Pure Brightness Patriarch Xu, in his compassion, universally delivered beings and established these principles of transmission beyond the teachings, guiding those of superior roots. Those who hear this meet an opportunity rare across kalpas; those who receive it encounter a dharma assembly of the moment. All should reverently embody Patriarch Xu’s苦心, establishing a firm foundation in the midst of human relations and daily life before cultivating the true and awakening to nature.\n\nNow, as I presumptuously serve as your guide, I first elucidate *The Supreme Principles of the Golden Flower of the Great One*, then expound upon them in detail. The *Great One* refers to the supreme. The alchemical secrets all rely on effortful practice to attain effortlessness, yet this is not the principle of direct, single-leap entry. The transmitted principles directly elevate the work of nature, not falling into secondary methods—hence their subtlety.\n\nThe *Golden Flower* is light. What color is light? Drawing its image from the golden flower, it secretly contains the character of light within. This is the true *qi* of the primordial Great One, the singular essence of the watery lead. The practice of *returning the light* employs the method of reversal, directing contemplation toward the Celestial Heart. The Celestial Heart resides in the sun and moon of the eyes.\n\n*The Yellow Court Scripture* states: *\"A cun-field and chi-residence can nurture life.\"* The *chi-residence* is the face; the *cun-field* upon the face—what is this if not the Celestial Heart? Within this square inch lie the sublime realms of *Yulu Xiaotai* and the marvels of *Yujing Danque*, the abode of the spirit most empty and numinous. The Confucians call it *\"the empty center\"*; the Buddhists, *\"the numinous terrace\"*; the Daoists, *\"the ancestral earth,\"* *\"the Yellow Court,\"* *\"the mysterious pass,\"* *\"the primordial aperture.\"* The Celestial Heart is like a dwelling, while light is its master. Thus, with a single return of the light, the *qi* of the entire body ascends in homage, like a sagely king establishing his capital and setting the axis—all bearing jade and silk come from the myriad states. Or like a master of keen discernment, where servants and maids naturally obey commands, each attending to their duties.\n\nDisciples need only return the light—this is the supreme, wondrous recitation. Light is easily stirred but difficult to stabilize. After prolonged return, this light congeals, becoming the natural dharmakāya, and the spirit coalesces above the nine heavens. This is what *The Heart Seal Scripture* calls *\"silent audience and ascension.\"* In practicing these principles, there is no other method of advancement—only pure contemplation of this.\n\n*The Śūraṅgama Sūtra* states: *\"Pure contemplation leads to flight; one must be born in heaven.\"* Heaven is not the azure sky but being born in the body of the *Qian* palace. Over time, naturally, there arises a body beyond the body.\n\nThe Golden Flower is the Golden Elixir. The transformations of spirit and illumination depend entirely on the heart. Though this wondrous secret does not err by a hair’s breadth, it is profoundly dynamic. It demands both intelligence and tranquility—only those of extreme intelligence can practice it; only those of extreme stillness can preserve it.\n\n**Chapter Two: The Primordial Spirit and the Conscious Spirit**\n\nHeaven and Earth regard humans as mayflies; the Great Dao regards Heaven and Earth as bubbles. Only the primordial spirit and true nature transcend the primordial and ascend beyond. Their essence and *qi* perish with Heaven and Earth. Yet with the primordial spirit present, there is the Infinite. The generation of Heaven and Earth arises from this.\n\nDisciples need only guard the primordial spirit to transcend life beyond yin and yang, outside the Three Realms. This is possible only through seeing nature—what is called the original face.\n\nWhen a person enters the womb, the primordial spirit resides in the square inch, while the conscious spirit dwells in the lower heart. The lower heart of flesh and blood is shaped like a large peach, covered by the lungs, assisted by the liver, and supported by the large and small intestines. If one goes a day without eating, discomfort arises in the heart. Upon hearing a fright, it leaps; upon encountering anger, it stifles. Witnessing death brings sorrow; seeing beauty brings dizziness. Yet the Celestial Heart above the head never stirs in the slightest.\n\nHow could the Celestial Heart fail to move the true intention within the square inch? When it moves, it is not wondrous—yet it is most wondrous. For ordinary people, it moves only at death, which is inauspicious. Most wondrous is when the light has congealed into the dharmakāya, gradually becoming spiritually responsive and desiring to move—this is the untransmitted secret of ages.\n\nThe lower conscious heart is like a powerful warlord or fierce general, taking advantage of the sovereign’s dimness to seize control. Over time, the great sword is inverted. Now, by concentrating and guarding the primordial palace, it is as if a wise and enlightened ruler sits upon the throne. The two eyes returning the light are like loyal ministers assisting on the left. With internal governance pacified, naturally, all traitors lay down their weapons and beg for life.\n\nIn the Dao of the Elixir, essence-water, spirit-fire, and intention-earth are the supreme secrets. Essence-water is the true unity of primordial *qi*; spirit-fire is light; intention-earth is the Celestial Heart of the central palace. Spirit-fire is employed, intention-earth is the essence, and essence-water is the foundation.\n\nHumans are born of intention, and the body is not merely seven feet. Within the body resides the *po*. The *po* acts through the conscious spirit, and the conscious spirit arises from the *po*. The *po* is yin, the substance of the conscious spirit. If the conscious spirit is not severed, through endless lives, the *po* transforms its form and alters its substance.\n\nOnly the *hun* is where the spirit is stored. By day, the *hun* lodges in the eyes; by night, it rests in the liver. Lodging in the eyes, it sees; resting in the liver, it dreams. Dreaming is the spirit’s journey—across the nine heavens and nine earths, traversed in an instant.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1257,
      "start_sentence": 0,
      "end_sentence": 50,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.93163728713989,
      "metadata": {
        "source_file": "dao\\藏外\\太乙金华宗旨.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "觉则冥冥焉，渊渊焉，拘于形也，即拘于魄也。 故回光所以炼魂，即所以保神，即所以制魄，即所以断识。 古人出世法，炼尽阴滓，以返纯乾，不过消魄全魂耳。 回光者，消阴制魄之诀也，虽无返乾之功，止有回光之诀，光即乾也，回之即返之也。 只守此法，自然精水充足，神火发生，意土凝定，而圣胎可结矣。 蜣螂转丸，而丸中生白，神注之纯功也。 粪丸中尚可生胎离壳，而吾天心休息处，注神于此，安得不生身乎。 一灵真性，既落乾宫，便分魂魄。 魂在天心，阳也，轻清之照也，此自太虚得来，与元始同形。 魄阴也，沉浊之气也，附于有形之凡心。 魂好生，魄望死。 一切好色动气皆魄之所为，即识神也。 死后享血食，活则大苦，阴返阴也。 物以类聚也，学人炼尽阴魄，即为纯阳也。 第三章回光守中 回光之名何昉乎？ 昉之自文始真人也。 回光则天地阴阳之气无不凝，所谓精思者此也，纯气者此也，纯想者此也。 初行此诀，乃有中似无，久之功成，身外有身，乃无中似有。 百日专功，光才真，方为神火。 百日后，光中自然一点真阳，忽生黍珠，如夫妇交合有胎，便当静以待之，光之回，即火候也。 夫元化之中，有阳光为主宰，有形者为日，在人为目，走漏神识，莫此甚顺也。 故金华之道，全用逆法。 回光者，非回一身之精华，直回造化之真气，非止一时之妄念，直空干劫之轮回。 故一息当一年，人间时刻也，一息当百年，九途长夜也。 凡人自的一声之后，逐境顺生，至老未尝逆视，阳气衰灭，便是九幽之界。 故《楞严经》云：“纯想即飞，纯情即堕”。 学人想少情多，沉沦下道。 惟诵观息静便成正觉，用逆法也。 《阴符经》云：“机在目”。 《黄帝素间》云：“人身精华，皆上注于空窍是也。 ”得此一节，长生者在兹，超升者亦在兹矣。 此是贯彻三教工夫。 光不在身中，亦不在身外，山河大地，日月照临，无非此光，故不独在身中。 聪明智慧，一切运转，亦无非此光，所以亦在身外。 天地之光华，布满大干，一身之光华，亦自漫天盖地，所以一回光，天地山河一切皆回矣。 人之精华，上注于目，此人身之大关键也。 子辈思之，一日不静坐，此光流转，何所底止！ 若一刻能静坐，万劫干生，从此了彻。 万法归于静，真不可思议，此妙蹄也。 然工夫下手，由浅入深，由粗入细，总以不间断为妙。 工夫始终则一，但其间冷暖自知，要归于天空海阔，万法如如，方为得手。 圣圣相传，不离反照。 孔云：“致知”，释曰：“观心”，老云：“内观”，皆此法也。 但反照二字，人人能言，不能得手，未识二字之义耳。 反者，自知觉之心，反乎形神末兆之初，则吾六尺之中，反求十天地末生之体。 今人但一、二时中间静坐，反顾己私，便云反照，安得到头！ 佛道二祖，教人看鼻尖者，非谓着念于鼻端也。 亦非谓眼观鼻端，念又注中黄也。 眼之所至，心亦至焉，何能一上而一下也，又何能忽上而忽下也。 此皆误指而为月。 毕竟如何？ 曰鼻端二字最妙，只是借鼻以为眼之准耳。 初不在鼻上，盖以大开眼，则视远，而不见鼻矣。 太闭眼。 则眼合，亦不见鼻矣。 大开失之外走，易于散乱。 太闭失之内驰，易于昏沉。",
      "translated_text": "When awakened, one is plunged into profound obscurity, bound by form—bound, that is, by the *po*. Thus, turning the light inward refines the *hun*, preserves the spirit, subdues the *po*, and severs the conscious mind. The ancient method of transcending the world entails refining away all yin dregs to return to pure yang—nothing more than dissolving the *po* and perfecting the *hun*.\n\nTurning the light inward is the secret to dissolving yin and restraining the *po*. Though it may not yet achieve the return to pure yang, the method of turning the light is itself the turning back, for light is yang, and to turn it is to return it. By abiding in this practice, essence-water naturally abounds, spirit-fire arises, intention-earth solidifies, and the sacred embryo may take form.\n\nThe dung beetle rolls its ball, and within the ball, white life emerges—such is the pure work of concentrated spirit. If even a ball of dung can nurture life to hatch from its shell, then how could the resting place of the Celestial Heart, where spirit is directed, fail to generate a body?\n\nOnce the single numinous nature descends into the Palace of Qian, it divides into *hun* and *po*. The *hun* resides in the Celestial Heart—yang, the light and clarity of illumination—born of the Great Void, sharing the same form as the Primordial Beginning. The *po* is yin, the heavy and turbid qi, clinging to the mundane heart of form. The *hun* delights in life, while the *po* longs for death. All desires for beauty and stirring of qi are the work of the *po*—the conscious spirit. After death, it feasts on blood offerings; in life, it suffers greatly, for yin returns to yin. Like attracts like.\n\nWhen the practitioner refines away the yin *po*, they become pure yang.\n\n**Chapter Three: Turning the Light Inward to Guard the Center**\n\nWhence comes the name \"turning the light inward\"? It originates with the Perfected One of Wenshi. Turning the light inward condenses the qi of heaven and earth, yin and yang—this is what is meant by \"pure thought,\" \"pure qi,\" and \"pure contemplation.\"\n\nAt first, practicing this method feels as if something exists within nothing. With time and mastery, a body arises beyond the body—nothing becomes as if something. After a hundred days of dedicated practice, the light becomes true, and only then is it spirit-fire. After a hundred days, a single point of true yang spontaneously arises within the light, like a millet pearl—just as conception occurs when husband and wife unite. One must then remain still and await it. The turning of the light is the fire-timing.\n\nWithin the primordial transformation, yang light presides as the sovereign. In the realm of form, it is the sun; in humans, it is the eyes. Nothing leaks the spirit-mind more readily than this. Thus, the Way of Golden Flower employs the method of reversal.\n\nTurning the light inward does not mean merely returning the essence of one’s body; it is the return of the true qi of creation. It is not merely the cessation of momentary delusions but the emptying of kalpas of samsara. Therefore, one breath corresponds to a year in the human world, and one breath to a hundred years in the long night of the nine paths.\n\nFrom the moment of birth, people follow circumstances and live in accord with them, never once turning their gaze inward. As yang qi wanes and perishes, they enter the realm of the nine darknesses. Thus, the *Śūraṅgama Sūtra* states: \"Pure thought ascends; pure emotion descends.\" Learners, with more emotion than thought, sink into lower realms. Only by observing the breath in stillness can true awakening arise—this is the method of reversal.\n\nThe *Classic of the Hidden Talisman* says: \"The mechanism lies in the eyes.\" The *Yellow Emperor’s Inner Canon* states: \"The essence of the human body all ascends and gathers in the empty orifices.\" Mastering this single point is where longevity and transcendence both lie. This is the practice that unifies the three teachings.\n\nThe light is neither within nor beyond the body. Mountains, rivers, the great earth, the illumination of sun and moon—all are this light, so it is not confined within the body. Wisdom, intelligence, all movement and transformation—none are apart from this light, so it is also beyond the body.\n\nThe light of heaven and earth fills the cosmos; the light of a single body likewise pervades the sky and covers the earth. Thus, when one turns the light inward, all—heaven, earth, mountains, and rivers—turns with it.\n\nThe essence of a person ascends and gathers in the eyes—this is the great pivot of the human body. Consider this: if one does not sit in stillness for even a day, where will this light flow and come to rest? But if one can sit in stillness for even a moment, the kalpas of birth and death are resolved from that point. All methods return to stillness—truly inconceivable, this wondrous path.\n\nYet in practice, one proceeds from shallow to deep, from coarse to refined, with unbroken continuity as the key. The work remains the same from beginning to end, though its warmth and coolness are known only to the practitioner. The goal is to return to the vastness of heaven and sea, where the ten thousand methods are as they are—only then is the method truly grasped.\n\nThe sages of past and present all transmitted this: it is nothing other than reflection. Confucius called it \"extending knowledge,\" the Buddha \"observing the mind,\" and Laozi \"inner contemplation\"—all refer to this method. Yet though everyone speaks of \"reflection,\" few grasp it, for they do not understand its meaning.\n\n\"Reflection\" means turning the mind of self-awareness back to the unmanifest origin of form and spirit. Within these six feet of ours, we return to seek the body of the ten heavens before their birth. Today, people sit in stillness for an hour or two, glance inward at their selfish thoughts, and call it \"reflection\"—how could they ever reach the end?\n\nThe patriarchs of Buddhism and Daoism taught people to \"look at the tip of the nose,\" but this does not mean fixing the mind on the nose’s end, nor does it mean gazing at the nose while the mind rests in the central yellow. Where the eyes go, the mind follows—how can it be both above and below, now here and now there? These are all mistaken pointers for the moon.\n\nWhat, then, is the true meaning? The phrase \"tip of the nose\" is most subtle—it merely uses the nose as a reference point for the eyes. It is not about the nose itself. If the eyes are opened too wide, they see far and miss the nose. If they are closed too tightly, they see nothing at all. Opening too wide scatters the mind outward; closing too tightly drives it inward into dullness.",
      "overlap_context": "and the conscious spirit arises from the *po*. The *po* is yin, the substance of the conscious spirit. If the conscious spirit is not severed, through endless lives, the *po* transforms its form and alters its substance.\n\nOnly the *hun* is where the spirit is stored. By day, the *hun* lodges in the eyes; by night, it rests in the liver. Lodging in the eyes, it sees; resting in the liver, it dreams. Dreaming is the spirit’s journey—across the nine heavens and nine earths, traversed in an instant.",
      "start_char": 1257,
      "end_char": 2493,
      "start_sentence": 51,
      "end_sentence": 108,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.03517413139343,
      "metadata": {
        "source_file": "dao\\藏外\\太乙金华宗旨.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "惟垂帘得中，恰好望见鼻端，故取以为准。 只是垂帘恰好，任彼光自然透入，不劳你注射与不注射。 看鼻端，只于最初入静处举眼一视，定个准则便放下。 如泥水匠人用线一般，彼自起手一挂，便依了做上去，不只管把线看也。 止观是佛法，原不秘的。 以两目讳观鼻端正身安坐，系心缘中，不必言头中，但于两〇中间，齐平处系念便了。 光是活泼泼的东西，系念两〇中间，光自然透入，不必着意于中宫也，此数语已括尽要旨。 其余入静出静前后，以下止观书印证可也。 缘中二字极妙。 中无不在，遍大干旨在里许，聊指造化之机，缘此入门耳。 缘者缘此为端倪，非有定着也，此二字之义，活甚妙甚。 止观二字，原离不得，即定慧也。 以后凡念起时，不要仍旧几坐，当究此念在何处，从何起，从何灭，反复推究，了不可得。 即见此念起处也，不要又讨过起处，觅心了不可得。 吾与汝安心竟，此是正观，反此者，名为邪观。 如是不可得已，即仍旧绵绵去止，而继之以观，观而继之以止，是定慧双修，此为回光。 回者止也，光者观也。 止而不观，名为有回而无光，观而不止，名为有光而无回，志之。 第四章回光调息 宗旨只要纯心行去，不求验而验自至。 大约初机病痛，昏沉散乱，二种尽之。 却此有机窍，无过寄心于息，息者自心也。 自心为息，心一动，而即有气，气本心之化也。 吾人念至速，雾顷一妄念，即一呼吸应之。 故内呼吸与外呼吸，如声响之相随，一日有几万息，即有几万妄念。 神明漏尽，如木稿灰死矣。 然则欲无念乎，不能无念也，欲无息乎，不能无息也。 莫若即其病而为药，则心息相依是已。 故回光兼之以调息，此法全用耳光。 一是目光，一是耳光。 目光者，外日月交光也，耳光者，内日月交精也。 然精即光之凝定处，同出而异名也。 故聪明总一灵光而已。 坐时用目垂帘后，定个准则便放下。 然竟放下，又恐不能，即存心于听息。 息之出入，不可使耳闻，听惟听其无声也。 一有声，便粗浮而不入细，即耐心轻轻微微些，愈放愈微，愈微愈静，久之，忽然微者速断，此则真息现前，而心体可识矣。 盖心细则息细，心一则动气也，息细则心细，气一则动心也。 定心必先之以养杰者，亦以心无处入手，故缘气为之端倪，所谓纯气之守也。 子辈不明动字，动者以线索牵动言，即制字之别名也。 即可以奔趋使之动，独不可以纯静使之宁乎。 此大圣人，视心气之交，而善立方便，以惠后人也。 丹书云：“鸡能抱卵心常听”，此要诀也。 盖鸡之所以能生卵者，以暖气也。 暖气止能温其壳，不能入其中，则以心引气入，其听也，一心注焉，心入则气入，得暖气而生矣。 故母鸡虽有时出外，而常作侧耳势，其神之所注未常少间也。 神之所注，未尝少间，即暖气亦昼夜无间，而神活矣。 神活着，由其心之先死也。 人能死心，元神活矣。 死心非枯稿之谓，乃专一不二之谓也。 佛云：“置心一处，无事不办。 ”心易走，即以气纯之，气易粗，即以心细之，如此而焉有不定者乎。 大约昏沉、散乱二病，只要静功，日日无间，自有大休息处。 若不静坐时，虽有散乱，亦不自知。 既知散乱，即是却散乱之机也。",
      "translated_text": "Only when the eyelids are lowered to the proper degree—neither too open nor too closed—can the tip of the nose be seen just right, and thus it serves as the reference point. The key lies in lowering the lids to the exact middle, allowing the light to enter naturally without any effort to direct or withhold it. When observing the tip of the nose, merely glance at it once when first settling into stillness to set the reference, then let it go. Like a plasterer using a plumb line, once the line is hung at the start, the work proceeds accordingly—there is no need to keep staring at the line.\n\n*Śamatha-vipaśyanā* is the Buddha’s teaching, and it is not secret. With both eyes gazing evenly at the tip of the nose, sit upright and settle the mind on the central point—not necessarily within the head, but simply where the two [eyes] align at their midpoint. Light is a living, vibrant thing; when the mind is fixed at the midpoint between the two [eyes], the light naturally enters without needing to focus on the central palace. These few words encompass the essential principle. For further details on entering and exiting stillness, one may consult the *Śamatha-vipaśyanā* texts for verification.\n\nThe term \"central point\" (*yuán zhōng*) is most subtle. The center is nowhere absent, pervading the great Dao in its entirety—here, it merely hints at the mechanism of creation, serving as the gateway to entry. \"Central\" (*yuán*) means taking this as the starting sign, not as a fixed attachment. The meaning of these two characters is profoundly alive and wondrous.\n\n*Śamatha* and *vipaśyanā* are inseparable—they are *samādhi* and *prajñā*. Whenever a thought arises thereafter, do not remain seated as before. Instead, investigate where this thought arises, from where it originates, and where it ceases. Examine it repeatedly, and you will find it unattainable. This is seeing the arising of the thought—do not then seek its origin further, for the mind is unattainable. \"I have pacified your mind for you\"—this is true insight. The opposite of this is called false insight.\n\nIf, after such investigation, nothing is found, simply return to the continuous practice of *śamatha*, followed by *vipaśyanā*, and *vipaśyanā* followed by *śamatha*—this is the dual cultivation of *samādhi* and *prajñā*, known as \"turning the light around.\" \"Turning\" (*huí*) is *śamatha*, and \"light\" (*guāng*) is *vipaśyanā*. *Śamatha* without *vipaśyanā* is having the turning but no light; *vipaśyanā* without *śamatha* is having the light but no turning. Take heed of this.\n\n**Chapter Four: Turning the Light Around and Regulating the Breath**\n\nThe principle is simply to proceed with a pure mind, without seeking verification, for verification will come of its own accord. Generally, beginners’ afflictions boil down to two: dullness and distraction. To remedy these, there is no better method than entrusting the mind to the breath. The breath is one’s own mind—when the mind moves, qi arises, for qi is the transformation of the mind. Human thoughts are swift: in an instant, a single deluded thought corresponds to a single breath. Thus, inner and outer breathing follow one another like sound and echo. In a day, there are tens of thousands of breaths, and thus tens of thousands of deluded thoughts. When the spirit’s clarity is exhausted, one becomes like withered wood or dead ashes.\n\nYet can one be without thoughts? One cannot. Can one be without breath? One cannot. Better to turn the affliction into medicine—this is the interdependence of mind and breath. Therefore, \"turning the light around\" is combined with breath regulation, a method that fully employs the \"ear’s light.\" There is the \"eye’s light\"—the external union of sun and moon—and the \"ear’s light\"—the internal union of sun and moon’s essence. Yet essence is merely where light congeals; they emerge from the same source but have different names. Thus, wisdom and clarity are but a single spiritual light.\n\nWhen sitting, lower the eyelids, set the reference point, and then let go. If letting go entirely proves difficult, then focus the mind on listening to the breath. The breath’s inhalation and exhalation should not be audible to the ear; listen only for its soundlessness. If there is sound, it is coarse and cannot enter subtlety. Instead, patiently and gently refine it, making it increasingly subtle, and the subtler it becomes, the stiller it grows. Over time, the subtle breath will suddenly cease, and the true breath will appear—then the essence of the mind can be recognized.\n\nFor when the mind is refined, the breath is refined; when the mind is unified, qi moves. When the breath is refined, the mind is refined; when qi is unified, the mind moves. To stabilize the mind, one must first cultivate the heroic spirit, for the mind has no place to grasp—thus, one relies on qi as the starting sign, which is the guarding of pure qi. You may not understand the word \"move\" (*dòng*): it refers to being pulled by a thread, akin to the character \"restrain\" (*zhì*). If one can be made to move by rushing about, can one not also be made to rest through pure stillness? This is how the great sages, observing the interplay of mind and qi, devised expedient means to benefit later generations.\n\nThe alchemical texts say: \"The hen can hatch eggs by constantly listening\"—this is the essential secret. The hen’s ability to hatch eggs depends on warmth. Warmth can only heat the shell; it cannot enter the interior. Thus, the mind draws qi inward, and in listening, the mind is wholly focused. When the mind enters, qi enters, and with the warmth of qi, life is born. Even when the mother hen leaves the nest, she keeps her ear cocked, for her spirit remains undivided. Where the spirit is undivided, warmth persists day and night without interruption, and the spirit becomes alive.\n\nWhen the spirit is alive, it is because the mind has first died. To \"die the mind\" does not mean withering it, but making it single-minded and undivided. The Buddha said: \"Place the mind in one place, and nothing will be unaccomplished.\" The mind tends to wander, so refine it with qi; qi tends to coarsen, so refine it with the mind. How could there be no stability in this? Generally, the two afflictions of dullness and distraction can only be resolved through daily, uninterrupted practice of stillness, which will naturally lead to great rest. If one does not sit in stillness, even if distracted, one remains unaware. Once aware of distraction, this very awareness is the opportunity to dispel it.",
      "overlap_context": "ollows—how can it be both above and below, now here and now there? These are all mistaken pointers for the moon.\n\nWhat, then, is the true meaning? The phrase \"tip of the nose\" is most subtle—it merely uses the nose as a reference point for the eyes. It is not about the nose itself. If the eyes are opened too wide, they see far and miss the nose. If they are closed too tightly, they see nothing at all. Opening too wide scatters the mind outward; closing too tightly drives it inward into dullness.",
      "start_char": 2493,
      "end_char": 3727,
      "start_sentence": 109,
      "end_sentence": 163,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.202354907989502,
      "metadata": {
        "source_file": "dao\\藏外\\太乙金华宗旨.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "昏沉而不知，与昏沉而知，相去奚啻干里！ 不知之昏沉，真昏沉也。 知之昏沉，非全昏沉也，清明在是矣。 散乱者，神驰也，昏沉者，神未清也，散乱易治，而昏沉难医。 譬之病焉，有痛有痒者，药之可也，昏沉则麻木不仁之症也。 散者可以收之，乱者可以整之，若昏沉，则蠢蠢焉，冥冥焉。 散乱尚有方所，至昏沉全是魄用事也。 散乱尚有魂在，至昏沉则纯阴为主矣。 静坐时欲睡去，便是昏沉。 却昏沉，只在调息，息即口鼻出入之息，虽非真息，而真息之出入，亦于此寄焉。 凡坐须要静心纯气，心何以静，用在息上，息之出入，惟心自知，不可使耳闻，不闻则细，细则清，闻则气粗，粗则浊，浊则昏沉而欲睡，自然之理也。 虽然心用在息上，又善要会用，亦是不用之用，只要微微照听可耳。 此句有微义，何谓照即眼光自照。 目惟内视而不外视，不外视而惺然者，即内视也，非实有内视。 何谓听即耳光自听，耳惟内听而不外听，不外听而惺然者，即内听也，非实有内听。 听者听其无声，视者视其无形。 目不外视，耳不外听，则闭而欲内驰。 惟内视内听，则既不外走，又不内驰，而中不昏沉矣，此即曰月交精交光也。 昏沉欲睡，即起散步，神清再坐。 清晨有暇，坐一蛀香为妙。 过午人事多扰，易落昏沉，然亦不必限定一蛀香，只要诸缘放下，静坐片时，久久便有入头，不落昏沉睡者。 第五章回光差谬 诸子工夫，渐渐纯熟，然枯木岩前错落多，正要细细开示。 此中消息，身到方知，吾今则可以言矣。 吾宗与禅宗不同，有一步一步证验，请先言其差别处，然后再言证验。 宗旨将行之际，予作方便，勿多用心，放教活泼泼地，令气和心适，然后入静。 静时正要得机得窍，不可坐在无事中里，所谓无记空也。 万缘放下之中，惺惺自若也。 又不可以意兴承当，凡大认真，即易有此。 非言不宜认真，但真消息，在若存若亡之间，以有意无意得之可也。 惺惺不昧之中，放下自若也。 又不可堕于蕴界，所谓蕴界者，乃五阴魔用事。 如一般入定，而稿木死灰之意多，大地阳春之意少。 此则落于阴界，其气冷，其息沉，且有许多寒衰景象，久之便堕木石。 又不可随于万缘，如一入静，而无端众绪忽至，欲却之不能，随之反觉顺适，此名主为奴役，久之落于色欲界。 上者生天，下者生狸奴中，若狐仙是也。 彼在名山中，亦自受用，风月花果，舆树瑶草，三五百年受用去，多至数千岁，然报尽还生诸趣中。 此数者，皆差路也。 差路既知，然后可求证验。 第六章回光证验 证验亦多，不可以小根小器承当，必思度尽众生。 不可以轻心慢心承当，必须请事斯语。 静中绵绵无间，神情悦豫，如醉如浴，此为遍体阳和，金华乍吐也。 既而万颧俱寂，皓月中天，觉大地俱是光明境界，此为心体开明，金华正放也。 既而遍体充实，不畏风霜，人当之兴味索然者，我遇之精神更旺，黄金起屋，白玉为台； 世间腐朽之物，我以真气呵之立生； 红血为乳，七尺肉团，无非金宝，此则金华大凝也。 第一段，是应《观无量寿经》云：“凋落大水，行树法象。 ”日落者，从混沌立基，无极也。 上善若水，清而无暇，此即太极主宰，出震之帝也。",
      "translated_text": "Dullness one is unaware of and dullness one is aware of—how vastly different they are! Unaware dullness is true dullness. Aware dullness is not entirely dullness, for clarity is present within it.\n\nDistraction is the spirit’s scattering; dullness is the spirit’s lack of clarity. Distraction is easier to remedy, while dullness is harder to cure. It is like illness: pain and itching can be treated with medicine, but dullness is the symptom of numbness and insensitivity. What is scattered can be gathered, what is chaotic can be ordered, but dullness is sluggish and obscure. In distraction, there is still some direction, but in dullness, the *po* soul dominates entirely. In distraction, the *hun* soul still lingers, but in dullness, pure yin prevails.\n\nDuring stillness practice, if one drifts toward sleep, this is dullness. To counter dullness, focus on regulating the breath. The breath here refers to the inhalation and exhalation through the mouth and nose—though not the true breath, the true breath’s movement is also lodged within it. Whenever sitting, one must quiet the mind and refine the qi. How to quiet the mind? By attending to the breath. The breath’s coming and going is known only to the mind; it should not be audible to the ears. If inaudible, it becomes subtle; subtle, it becomes clear. If audible, the qi grows coarse; coarse, it becomes turbid; turbid, it leads to dullness and sleep—this is the natural principle.\n\nThough the mind is directed toward the breath, one must skillfully apply this focus—it is a use that is no-use, requiring only a faint awareness. This phrase holds a subtle meaning. What is \"illumination\"? It is the eye’s light turning inward. The eyes should see inwardly, not outwardly; not seeing outwardly yet remaining alert is inward seeing—though not literally so. What is \"listening\"? It is the ear’s light turning inward. The ears should listen inwardly, not outwardly; not listening outwardly yet remaining alert is inward listening—though not literally so. To listen is to listen to silence; to see is to see formlessness. If the eyes do not look outward and the ears do not listen outward, they may turn inward and scatter. Only by inward seeing and inward listening can one avoid both outward scattering and inward dissipation, thus preventing dullness in the center—this is the union of sun and moon, the intermingling of their essences.\n\nWhen dullness and sleepiness arise, rise and walk about until the spirit clears, then sit again. In the early morning, when time permits, sitting for the duration of one incense stick is ideal. After noon, worldly affairs multiply and dullness easily sets in, yet one need not rigidly adhere to one incense stick. As long as all conditions are set aside and one sits in stillness for a time, over time one will find entry and avoid falling into dullness and sleep.\n\n---\n\n**Chapter Five: Errors in Turning the Light Around**\n\nAs your practice gradually matures, though you may have reached the barren tree and rocky crag, mistakes remain plentiful. Here, I will offer detailed guidance. The subtleties of this matter can only be known once one has arrived; now, I may speak of them.\n\nOur tradition differs from the Chan school in that it proceeds step by step with verification. Let me first explain the points of divergence, then the verifications.\n\nWhen about to engage in the essential practice, I employ expedient means: do not overuse the mind, but allow it to be lively and free, so that qi harmonizes and the mind settles. Only then enter stillness. In stillness, one must grasp the opportunity and the key—do not sit in a state of emptiness, which is the blankness of unawareness. Amidst the release of all conditions, remain alert and self-possessed. Yet one must not rely on intention or enthusiasm, for excessive earnestness easily leads to this. It is not that earnestness is inappropriate, but the true subtlety lies in the realm of \"as if present, as if absent\"—it may be attained through a state of intentional non-intention.\n\nAmidst alert clarity, release remains effortless. One must also avoid falling into the *skandha* realm, where the five aggregates become the workings of *māra*. Some enter samādhi with an excess of withered wood and dead ashes, lacking the vitality of spring across the great earth. This is falling into the yin realm: the qi grows cold, the breath sinks, and many signs of cold and decay appear. Over time, one becomes like wood or stone.\n\nOne must also avoid being carried away by the myriad conditions. Upon entering stillness, if various thoughts suddenly arise and cannot be dismissed, following them may feel agreeable—this is the master becoming enslaved. Over time, one falls into the realm of desire. The superior among these may be reborn in heaven, the inferior among foxes and spirits. Dwelling in famous mountains, they enjoy their own pleasures—wind and moon, flowers and fruits, jade trees and fragrant herbs—for three to five hundred years, even thousands, yet when their retribution ends, they are reborn among the various destinies. These are all erroneous paths.\n\nOnce the erroneous paths are known, one may seek verification.\n\n---\n\n**Chapter Six: Verifications of Turning the Light Around**\n\nVerifications are many and cannot be undertaken by those of shallow roots or limited capacity; one must aspire to deliver all beings. Nor can they be undertaken with a careless or arrogant mind; one must approach these words with reverence.\n\nIn stillness, a continuous, unbroken flow arises, and the spirit becomes joyful and at ease, as if intoxicated or bathed—this is the body suffused with yang harmony, the first blossoming of the Golden Flower. Then, all sensations subside, and the bright moon hangs in the sky, revealing the entire world as a realm of light—this is the opening of the mind’s essence, the full radiance of the Golden Flower. Next, the body becomes replete and impervious to wind and frost; what others find dull, I encounter with heightened vitality. Golden halls rise, jade terraces stand; the decaying things of the world, when I breathe true qi upon them, instantly revive. Red blood transforms into milk, and this seven-foot frame of flesh becomes nothing but gold and treasure—this is the great congealing of the Golden Flower.\n\nThe first stage corresponds to the *Sutra on Visualizing the Buddha of Infinite Life*, which states: *\"The withered great waters and the symbolic trees of the Dharma.\"* The setting sun begins from primordial chaos, the Wuji. The highest good is like water—clear and flawless—this is the sovereign of the Taiji, the Lord emerging from *Zhen*.",
      "overlap_context": "d nothing will be unaccomplished.\" The mind tends to wander, so refine it with qi; qi tends to coarsen, so refine it with the mind. How could there be no stability in this? Generally, the two afflictions of dullness and distraction can only be resolved through daily, uninterrupted practice of stillness, which will naturally lead to great rest. If one does not sit in stillness, even if distracted, one remains unaware. Once aware of distraction, this very awareness is the opportunity to dispel it.",
      "start_char": 3727,
      "end_char": 4951,
      "start_sentence": 164,
      "end_sentence": 213,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.51524829864502,
      "metadata": {
        "source_file": "dao\\藏外\\太乙金华宗旨.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "震为木，故以行树象焉，七重行树，七窍光明也。 西北乾方，移一位为坎，旧落大水，乾坎之象。 坎为子方，冬至雷在地中，隐隐隆隆，至震而阳方出地上矣，行树之象也，余可类推矣。 第二段，即肇基于此，大地为冰，琉璃宝地，光明渐渐凝矣。 所以有蓬台而继之有佛也，金性即现，非佛而何，佛者大觉金仙也。 此大段证验耳。 现在证验，可考有三； 一则坐去，神入谷中，闻人说话，如隔里许，一一明了，而声入皆如谷中答响，未尝不闻，我未尝一闻，此为神在谷中，随时可以自验； 一则静中，目光腾腾，满前皆白，如在云中，开眼觅身，无从觅视，此为虚室生白，内外通明，吉祥止止也； 一则静中，肉身纲细，如绵如玉，坐中若留不住，而腾腾上浮，此为神归顶天，久之上升可以立待。 此三者，皆现在可验者也。 然亦是说不尽的，随人根器，各现殊胜。 如《摩诃止观》中所云：“善根发相是也。 ”此事如人饮水，冷暖自知，须自己信得过方真。 先天一气，即在现前证验中自讨，一气若得，丹亦立成，此一粒真黍珠也。 一粒复一粒从微而至着。 有时时之先天，一粒是也，有统体之先天，一粒乃至无量是也。 一粒有一粒力量，此要自己胆大，为第一义。 第七章回光活法 回光循循然行去，不要废弃正业。 古人云：“事来要应过，物来要识破。 ”子以正念治事，即光不为物转，光即自回。 此时时无相之回光也，尚可行之，而况有真正着相回光乎。 日用间，能刻刻随事返照，不着一毫人我相。 便是随地回光，此第一妙用。 清晨能遣尽诸缘，静坐一、二时最妙。 凡应事接物，只用返照法，便无一刻间断。 如此行之，三月两月，天上诸真，必来印证矣。 第八章道遥诀 玉清留下道遥诀，四字凝神入气穴。 六月俄看白雪飞，三更又见日轮赫。 水中吹起藉巽风，天上游归食坤德。 更有一句玄中玄，无何有乡是真宅。 律诗一首，玄奥已尽。 大道之要，不外无为而为四宇。 惟无为，故不滞方所形象，惟无为而为，故不堕顽空死虚。 作用不外一中，而枢机全在二目。 二目者，斗柄也，斡旋造化，转运阴阳，其大药则始终一水中金，即水乡铅而已。 前言回光，乃指点初机，从外以制内，即辅以得主。 此为中、下之士，修下二关，以透上一关者也。 今头绪渐明，机括渐熟，天不爱道，直泄无上宗旨，诸子秘之秘之，勉之勉之！ 夫回光其总名耳。 工夫进一层，则光华盛一番，回法更妙一番。 前者由外制内，今则居中御外。 前者即辅相主，今则奉主宣献，面目一大颠倒矣。 法子欲入静，先调摄身心，自在安和，放下万缘，一丝不挂。 天心正位手中，然后两目垂帘，如奉圣旨，以召大臣，孰敢不遵。 次以二目内照坎宫，光华所到，真阳即出以应之。 离外阳而内阴，乾体也。 一阴入内而为主，随物生心，顺出流转，今回光内照，不随物生，阴气即住，而光华注照，则纯阳也。 同类必亲，故坎阳上腾，非坎阳也，仍是乾阳应乾阳耳。 二物一遇，便纽结不散，絪缊活动，倏来倏去，倏浮倏沉，自己元宫中，恍若太虚无量，遍身轻妙欲腾，所谓云满干山也。 次刚来往无踪，浮沉无辨，脉住气停，此则真交媾矣，所谓月涵万水也。",
      "translated_text": "The *Zhen* trigram corresponds to wood, hence the symbolic representation of the rows of trees—seven tiers of trees for the seven apertures of radiant clarity. The northwest *Qian* direction, shifted one position, becomes *Kan*, symbolizing the withered great waters, an image of *Qian* and *Kan*. *Kan* governs the *Zi* direction; at the winter solstice, thunder lies hidden within the earth, rumbling faintly, until *Zhen* emerges as yang rises above the ground—this is the image of the rows of trees. The rest may be deduced by analogy.\n\nThe second stage begins here, as the great earth turns to ice, becoming a lapis lazuli jeweled ground where luminosity gradually congeals. Thus arises the lotus terrace, and from it, the Buddha—what else could this manifestation of golden nature be but the Buddha, the fully awakened Golden Immortal? This is the great verification of the process. Three verifiable signs may be observed in the present:\n\nFirst, when seated, the spirit enters the valley; hearing others speak is like listening from a mile away, yet every word is distinctly clear, and their voices echo as if answering from within the valley. Though they are heard, I remain untouched by hearing—this is the spirit abiding in the valley, verifiable at any time.\n\nSecond, in stillness, the eyes radiate a brilliant light, filling all before them with whiteness, as if enveloped in clouds. Opening the eyes to seek the body, it cannot be found—this is the empty chamber generating brightness, inner and outer luminosity united, the auspiciousness of perfect stillness.\n\nThird, in stillness, the flesh becomes fine and supple, like silk or jade, and in sitting, one feels unable to remain grounded, as if floating upward—this is the spirit returning to the crown of the head, and with time, ascension may be awaited at any moment.\n\nThese three are verifiable in the present. Yet the manifestations are inexhaustible, varying with each practitioner’s capacity, as the *Mohe Zhiguan* states: *\"The arising of wholesome roots takes diverse forms.\"* This matter is like one who drinks water—cool or warm, only the drinker knows. One must trust oneself truly.\n\nThe primordial qi of pre-heaven is to be sought within present verification. Once this qi is attained, the elixir forms instantly—this is the single grain of true millet pearl. One grain upon another, from the subtle to the manifest.\n\nThere is the pre-heaven of the moment—a single grain—and the pre-heaven of the whole—a single grain extending to the boundless. Each grain possesses its own power; here, boldness is the foremost principle.\n\n**Chapter Seven: The Method of Revolving the Light**\n\nRevolve the light step by step, without neglecting one’s proper duties. As the ancients said: *\"When affairs arise, respond to them; when things appear, recognize them.\"* Address matters with right mindfulness, and the light will not be swayed by external phenomena—the light will naturally return. This is the revolving of the light in formlessness, yet how much more so when the light is truly focused in form?\n\nIn daily life, maintain moment-to-moment reflection, free from the slightest trace of self or other—this is the revolving of the light in every circumstance, the foremost wondrous function. Rising early to dispel all entanglements and sitting in stillness for one or two hours is most excellent. In all dealings with affairs and people, employ the method of reflection, ensuring no interruption. Practicing thus for two or three months, the immortals of heaven will surely come to affirm it.\n\n**Chapter Eight: The Carefree Formula**\n\nThe Jade Clarity left behind the carefree formula:\nFour words—concentrate the spirit and enter the qi cavity.\nIn the sixth month, suddenly white snow flies;\nAt the third watch, the sun’s wheel blazes forth.\nFrom the water, the *Xun* wind is blown aloft;\nIn the heavens, one roams and returns to feast on *Kun*’s virtue.\nThere is yet one phrase within the profound:\nThe land of Nothing-Whatsoever is the true dwelling.\n\nA single regulated verse encompasses all mysteries. The essence of the great Dao lies in nothing other than *\"non-doing while doing.\"* Only through non-doing does one avoid attachment to form and locality; only through non-doing while doing does one avoid falling into stagnant emptiness or dead void.\n\nAll functioning revolves around the center, yet the pivot lies entirely in the two eyes. The two eyes are the handle of the Dipper, governing the rotation of creation and the circulation of yin and yang. The great medicine is ever the water’s gold—namely, the lead of the watery realm.\n\nThe earlier discussion of revolving the light was guidance for beginners, turning the outer to master the inner, like the minister aiding the sovereign. This pertains to those of middle and lower capacity, who refine the lower two passes to penetrate the upper one. Now, as the threads become clearer and the mechanism more familiar, heaven does not withhold the Dao—it reveals the supreme principle. Guard this well, guard this well! Exert yourselves, exert yourselves!\n\nRevolving the light is but a general term. With each advance in practice, the light’s brilliance intensifies, and the method of return becomes ever more wondrous. Previously, the outer was used to master the inner; now, one resides at the center to govern the outer. Previously, the minister aided the sovereign; now, the sovereign is served and proclaimed—what a complete reversal!\n\nWhen entering stillness, first harmonize body and mind, attaining ease and tranquility. Release all entanglements, clinging to nothing. The celestial mind is rightly positioned in the hands. Then, lower the eyelids as if receiving a sacred decree to summon a great minister—who would dare disobey?\n\nNext, with the two eyes, inwardly illuminate the *Kan* palace. Where the light reaches, true yang emerges in response. *Li* outwardly is yang but inwardly yin—this is the *Qian* body. When a single yin enters to become the master, it follows things and generates the mind, flowing outward in endless cycles. Now, with the revolving light inwardly illuminating, one does not follow things to generate the mind. Yin qi halts, and as the light radiates, pure yang arises. Like attracts like, so *Kan*’s yang ascends—not *Kan*’s yang, but *Qian*’s yang responding to *Qian*’s yang.\n\nWhen the two meet, they intertwine inseparably, vibrantly active, now appearing, now vanishing, now floating, now sinking. Within one’s original palace, it seems as vast as the infinite void, the body light and wondrous, ready to ascend—this is the clouds filling the dry mountains.\n\nNext, the coming and going leave no trace, floating and sinking are indistinguishable, the pulse stills, and qi halts—this is the true union, the moon cradling ten thousand waters.",
      "overlap_context": ". Red blood transforms into milk, and this seven-foot frame of flesh becomes nothing but gold and treasure—this is the great congealing of the Golden Flower.\n\nThe first stage corresponds to the *Sutra on Visualizing the Buddha of Infinite Life*, which states: *\"The withered great waters and the symbolic trees of the Dharma.\"* The setting sun begins from primordial chaos, the Wuji. The highest good is like water—clear and flawless—this is the sovereign of the Taiji, the Lord emerging from *Zhen*.",
      "start_char": 4951,
      "end_char": 6204,
      "start_sentence": 214,
      "end_sentence": 266,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.5601327419281,
      "metadata": {
        "source_file": "dao\\藏外\\太乙金华宗旨.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "俟其冥冥中，忽然天心一动，此则一阳来复，活子时也。 然而此中消息要细说，凡人一视一听，耳目逐物而动，物去则已，此之动静，全是民庶，而天君反随之役，是尝与鬼居矣。 今则一动一静，皆与人居，天君乃真人也。 彼动即与之俱动，动则天根;静则与之俱静，静则月窟;静动无端，亦与之为静动无端;休息上下，亦与之为休息上下，所谓天根月窟闲来往也。 天心镇静，动违其时，则失之嫩;天心已动，而后动以应之，则失之老;天心一动，即以真意上升乾宫，而神光视顶，为导引焉，此动而应时者也。 天心既升乾顶，游扬自得，忽而欲寂，急以真意引入黄庭，而目光视中黄神室焉，既而欲寂者，一念不生矣。 视内者，忽忘其视矣，尔时身心，便当一场大放，万缘泯迹，即我之神室炉鼎，亦不知在何所，欲觅己身，了不可得，此为天入地中，众妙归根之时也，即此便是凝神入气穴。 夫一回光也，始而散者欲敛，六用不行，此为涵养本原，添油接命也。 既而敛者，自然优游，不费纤毫之力，此为安神祖窍，翕聚先天也。 既而影响俱灭，寂然大定，此为蛰藏气穴，众妙归根也。 一节中具有三节，一节中具有九节，俱是后日发挥。 今以一节中，具三节言之，当其涵养而初静也。 翕聚亦为涵养，蛰藏亦为涵养，至后而涵养皆蛰藏矣。 中一层可类推，不易处而处分矣，此为无形之窍，干处万处一处也。 不易时而时分焉，此为无候之时。 元会运世一刻也。 凡心非静极，则不能动，动动忘动，非本体之动也。 故曰感于物而动，性之欲也，若不感于物而动，即天之动也。 是知以物而动，性之欲也，若不以物而自动，即天之动也。 不以天之动对天之性，句落下说个欲字，欲在有物也，此为出位之思，动而有动矣。 一念不起，则正念乃生，此为真意。 寂然大定中，而天机忽动，非无意之动乎，无为而为，即此意也。 诗首二句，全括金华作用。 次二句是日月互体意，六月即离火也，白雪飞即离中真阴将返乎坤也。 三更即坎水也，日轮即坎中一一阳将赫然而返乎乾也。 取坎填离，即在其中。 次二句说斗柄作用，升降全机，水中非坎乎。 目为巽风，目光照入坎宫，摄召太阳之精是也。 天上即乾宫，游归食坤德，即神入照中，天入地中，养火也。 末二句是指出诀中之诀，诀中之诀，始终离不得，所谓洗心涤虑，为沐浴也。 圣学以知止始，以止至善终，始乎无极，归乎无极。 佛以无住而生心，为一大藏教旨。 吾道以“致虚”二字，完性命全功。 总之三教不过一句，为出死入生之神丹。 “神丹”为何曰一切处无心而已。 吾道最秘者沐浴，如此一部全功，不过“心空”二字，足以了之，今一言指破，省却数十年参访矣。 子辈不明一节中具三节，我以佛家“空、假、中”三观为喻，三观先空，看一切物皆空;次假，虽知其空，然不毁万物，仍于空中建立一切事;既不毁万物，而又不着万物，此为中观。 当其修空观时，亦知万物不可毁，而又不着，此兼三观也。 然毕竟以看得空为得力，故修空观。 则空固空，假亦空，中亦空。 修假观，是用上得力居多，则假固假，空亦假，中亦假。 中道时亦作空想，然不名为空而名为中矣。",
      "translated_text": "When in profound stillness, the celestial mind stirs—this is the return of the solitary yang, the living *zi* hour. Yet this subtle movement must be explained in detail.\n\nFor ordinary people, every glance and every listening causes the ears and eyes to chase after things, ceasing only when the object departs. In such motion and stillness, the common folk prevail, while the celestial sovereign is enslaved by them—this is dwelling among ghosts. Now, however, every motion and stillness resides with the person, and the celestial sovereign becomes a true person. When it moves, one moves with it—this is the Celestial Root; when it stills, one stills with it—this is the Moon Grotto. Stillness and motion arise without origin, and one follows them without origin; rest and activity rise and fall, and one follows them in their rising and falling—this is the Celestial Root and Moon Grotto idly coming and going.\n\nWhen the celestial mind is serene, to move against its timing is to err by immaturity; when the celestial mind has already stirred, to move in response afterward is to err by lateness. The moment the celestial mind stirs, one must ascend with true intention to the *Qian* palace, guiding with the spirit-light gazing at the crown—this is movement in timely response.\n\nOnce the celestial mind ascends to the *Qian* crown, it roams freely and at ease. Should it suddenly incline toward stillness, swiftly draw it with true intention into the Yellow Court, directing the gaze of the eyes to the central Yellow Spirit Chamber. Then, as the inclination toward stillness arises, not a single thought stirs. In gazing inward, one suddenly forgets the gaze itself. At this moment, body and mind undergo a great release, all conditions vanish without trace, and even the crucible and furnace of one’s spirit-chamber seem nowhere to be found. Seeking one’s own body, it is utterly unattainable—this is the moment when heaven enters earth, when the myriad wonders return to the root, the very instant of \"congealing spirit into the qi cavern.\"\n\nIn one turning of the light: at first, the scattered seeks to gather, the six senses cease functioning—this is nurturing the original source, adding oil to sustain life. Then, the gathered naturally drifts in ease, without expending the slightest effort—this is settling the spirit in the ancestral aperture, drawing together the primordial. Finally, echoes and reflections vanish entirely, and profound stillness prevails—this is hibernating in the qi cavern, the myriad wonders returning to the root.\n\nWithin one stage lie three stages; within one stage lie nine stages—all to be elaborated later. Now, taking one stage as comprising three: when nurturing begins in initial stillness, gathering is also nurturing, hibernation is also nurturing, and in the end, nurturing becomes hibernation. The middle layer may be inferred by analogy, where distinctions arise without altering the essence—this is the formless aperture, where a thousand places are one place. Distinctions arise without altering the timing—this is the timeless moment, an instant spanning kalpas and eons.\n\nThe human heart cannot stir without extreme stillness. To stir while forgetting the stirring is not the stirring of the original substance. Thus it is said: \"Moved by things, it stirs—this is the desire of nature.\" If it stirs not by things but of itself, this is the stirring of heaven. To know that stirring by things is the desire of nature, while stirring not by things but of itself is the stirring of heaven—if one does not oppose heaven’s stirring with heaven’s nature, the phrase falls into speaking of \"desire,\" for desire lies in the presence of things. This is thought stepping beyond its proper place, movement within movement.\n\nWhen not a single thought arises, the correct thought is born—this is true intention. Within profound stillness, the celestial mechanism suddenly stirs—is this not movement without intention? Action without acting—this is that intention.\n\nThe first two lines of the poem encapsulate the workings of Golden Flower. The next two express the mutual embodiment of sun and moon: the sixth month is the fire of *Li*, the flying white snow is the true yin within *Li* about to return to *Kun*. The third watch is the water of *Kan*, the solar orb is the solitary yang within *Kan* about to blaze forth and return to *Qian*. The extraction of *Kan* to fill *Li* is contained therein.\n\nThe following two lines describe the Dipper’s handle in operation, the full mechanism of ascent and descent—is not the water within *Kan*? The eyes are the wind of *Xun*; the gaze of the eyes enters the *Kan* palace to summon the essence of the great yang. The heavens above are the *Qian* palace; \"roaming and returning to feast on *Kun*’s virtue\" is the spirit entering and illuminating the center, heaven entering earth, nurturing the fire.\n\nThe final two lines point to the supreme secret within the secret, the secret within the supreme secret—from beginning to end, it cannot be parted from, what is called \"washing the heart and cleansing the thoughts,\" the bathing. The sagely learning begins with knowing where to halt and ends with halting at perfection, commencing from the limitless and returning to the limitless.\n\nBuddhism takes \"arising mind without abiding\" as the great essence of its treasury of teachings. Our Dao takes the two words \"attaining emptiness\" to complete the full work of nature and life. In sum, the three teachings reduce to a single phrase: the divine elixir for emerging from death and entering life.\n\nWhat is the \"divine elixir\"? Simply \"no mind in all circumstances.\"\n\nThe most arcane aspect of our Dao is bathing. The entire work of this text can be resolved in two words: \"heart empty.\" Now, with a single word, the secret is revealed, sparing decades of seeking.\n\nYou disciples fail to understand that within one stage lie three stages. I compare it to Buddhism’s three contemplations: emptiness, provisional existence, and the mean. First is the contemplation of emptiness, seeing all things as empty. Next is the contemplation of provisional existence: though knowing their emptiness, one does not destroy the myriad things but establishes all affairs within emptiness. Then, neither destroying the myriad things nor attaching to them—this is the contemplation of the mean.\n\nWhen practicing the contemplation of emptiness, one also knows the myriad things cannot be destroyed and yet does not attach to them—this encompasses all three contemplations. Yet ultimately, seeing emptiness is the most powerful, so one practices the contemplation of emptiness. In emptiness, emptiness is indeed empty, provisional existence is also empty, and the mean is also empty. In practicing the contemplation of provisional existence, one relies more on the power of the preceding stage: provisional existence is indeed provisional, emptiness is also provisional, and the mean is also provisional. In the mean, one also conceives of emptiness, yet it is not called emptiness but the mean.",
      "overlap_context": " yang responding to *Qian*’s yang.\n\nWhen the two meet, they intertwine inseparably, vibrantly active, now appearing, now vanishing, now floating, now sinking. Within one’s original palace, it seems as vast as the infinite void, the body light and wondrous, ready to ascend—this is the clouds filling the dry mountains.\n\nNext, the coming and going leave no trace, floating and sinking are indistinguishable, the pulse stills, and qi halts—this is the true union, the moon cradling ten thousand waters.",
      "start_char": 6204,
      "end_char": 7423,
      "start_sentence": 267,
      "end_sentence": 308,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.383323669433594,
      "metadata": {
        "source_file": "dao\\藏外\\太乙金华宗旨.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "亦作假观，然不名为假而名为中矣，至于中则不必言矣。 吾虽有时单言离，有时兼说坎，究竟不曾移动一一句。 开口提云：枢机全在二目。 所谓枢机者用也，用即斡旋造化，非言造化止此也。 六根七窍，悉是光明藏，岂取二目，而他概不问乎，用坎阳，仍用离光照摄，即此便明。 朱子云阳师讳元育，尝云：“瞎子不好修道，聋子不妨。 ”与吾言暗合，特表其主辅轻重耳。 日月原是一物，其曰中之暗处，是真月之精，月窟不在月而在日，所谓月之窟也，不然自言月足矣。 月中之白处，是真日之光，日光反在月中，所谓天之根也，不然自言天足矣。 一日一月，分开止是半个，合来方成一个全体。 如一夫一妇，独居不成室家，有夫有妇，方算得一家完全。 然而物难喻道，夫妇分开，不失为两人，日月分开，不成全体矣。 知此则耳目犹是也。 吾谓瞎子已无耳，聋子已无目，如此看来，说甚一物，说甚两目，说甚六恨，六根一根也。 说甚七窍，七窍一窍也。 吾言只透露其相通处，所以不见有两，子辈专执其隔处，所以随处换却眼睛。 第九章百曰筑基 《心印经》云：“回风混合，百曰功灵。 ”总之立基百日，方有真光如。 子辈尚是目光，非神火也，非性光也，非慧智炬烛也。 回之百日，则精气自足，真阳自生，水中自有真火，以此持行，自然交媾，自然结胎，吾方在不识不知之天，而婴儿自成矣。 若略作意见，便是外道。 百日立基，非百日也。",
      "translated_text": "Yet when practicing the contemplation of provisional existence, it is not called provisional but the mean—while as for the mean, there is no need to speak further.\n\nThough I sometimes speak of *li* alone and sometimes of *kan* in conjunction, I have never altered a single word. When I open my mouth to say it, the pivot lies entirely in the two eyes. This \"pivot\" is function—function that steers and turns the transformations of creation, not that creation is confined to this alone.\n\nThe six roots and seven apertures are all treasuries of radiant light; why single out the two eyes while ignoring the rest? One employs the yang of *kan* while still using the light of *li* to illumine and gather—this makes it clear.\n\nMaster Zhu’s teacher, whose name was Yuan-yu, once said: “A blind man cannot cultivate the Dao, but a deaf man may.” This accords with my own words, differing only in emphasizing the primary and secondary.\n\nThe sun and moon are originally one thing. What is called the dark place at the center is the true essence of the moon; the moon’s cavern is not in the moon but in the sun—what is called the moon’s cavern. Otherwise, one could simply say “moon” and be done. The white place within the moon is the true light of the sun; the sun’s light is instead in the moon—what is called the root of heaven. Otherwise, one could simply say “heaven” and be done.\n\nSun and moon, when separated, are only half; when united, they form a complete whole. Like a husband and wife: living apart, they do not make a household; only when man and woman are together is a family complete. Yet things are poor metaphors for the Dao. Husband and wife, when apart, remain two people; sun and moon, when apart, do not form a complete whole.\n\nUnderstand this, and the ears and eyes are likewise. I say that a blind man has no ears, and a deaf man has no eyes. Seen thus, what need is there to speak of one thing, or two eyes, or six resentments? The six roots are one root. What need to speak of seven apertures? The seven apertures are one aperture. My words merely reveal their interconnectedness, so that duality is not perceived. You disciples cling to their separateness, and so everywhere you replace your eyes.\n\n**Chapter Nine: A Hundred Days of Foundation-Laying**\nThe *Xinyin Jing* says: “When wind is turned back and blended, the hundred-day work is efficacious.” In sum, one must establish the foundation for a hundred days before true light appears. You disciples still possess only the light of the eyes—this is neither the fire of spirit, nor the light of nature, nor the torch of wisdom.\n\nAfter a hundred days of turning back, essence and qi naturally become full, true yang naturally arises, and true fire naturally exists within water. Proceeding with this, union occurs naturally, the embryo forms naturally, and I remain in the heaven of unknowing—while the infant is spontaneously perfected. If one harbors even the slightest intention, it is heterodox.\n\nA hundred days of foundation-laying—yet it is not merely a hundred days.",
      "overlap_context": "g emptiness is the most powerful, so one practices the contemplation of emptiness. In emptiness, emptiness is indeed empty, provisional existence is also empty, and the mean is also empty. In practicing the contemplation of provisional existence, one relies more on the power of the preceding stage: provisional existence is indeed provisional, emptiness is also provisional, and the mean is also provisional. In the mean, one also conceives of emptiness, yet it is not called emptiness but the mean.",
      "start_char": 7423,
      "end_char": 7984,
      "start_sentence": 309,
      "end_sentence": 331,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.396541118621826,
      "metadata": {
        "source_file": "dao\\藏外\\太乙金华宗旨.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "一日立基，非一日也。 一息立基，非呼吸之谓也。 息者自心也，自心为息，元神也，元气也，元精也。 升降离合，悉从心起，有无虚实，咸在念中。 一息一生持，何止百日，然百日亦一息也。 百曰只在得力，昼间得力，夜中受用，夜中得力，昼间受用。 百日立基，玉旨耳。 上真言语，无不与人身应。 真师言语，无不与学人应。 此是玄中玄，不可解者也。 见性乃知，所以学人，必求真师授记，任性发出，一一皆验。 第十章性光识光 回光之法，原通行住坐卧，只要自得机窍。 吾前开示云； “虚室生自”，光非白邪。 但有一说，初未见光时，此为效验，若见为光，而有意着之，即落意识，非性光也。 子不管他有光无光，只要无念生念。 何为无念？ 干休干处得； 何为生念？ 一念一生持，此念乃正念，与平曰念不同。 今心为念，念者现在心也。 此心即光即药。 凡人视物，任眼一照去，不及分别，此为，性光，，如镜之无心而照也，如水之无心而鉴也。 少刻即为“识光”，以其分别也。 镜有影已无镜矣，水有象已无水矣。 光有识尚何光哉！ 子辈初则“性光”，转念则识，识起而光杳无可觅，非无光也，光已为识矣。 黄帝曰：“声动不生声而生响”，即此义也。 《楞严推勘入门》曰：“不在尘，不在识，惟选根”，此则何意？ 尘是外物，所谓器界也。 与吾了不相涉，逐之则认物为己。 物必有还，通还户牖，明还日月，借他为自，终非吾有。 至于不汝还者，非汝而谁。 明还日月，见日月之明无还也。 天有无日月之时，人无有无见日月之性。 若然则分别日月者，还可与为吾有耶。 不知因明暗而分别者，当明暗两忘之时，分别何在，故亦有还，此为内尘也。 惟见性无还，见见之时，见非是见，则见性亦还矣。 还者还其识念流转之见性，即阿难使汝流转，心目为咎也。 初入还辨见时，上七者，皆明其一一有还，故留见性，以为阿难拄杖。 究竟见性既带八识（眼识、耳识、鼻识、舌识、身识、意识、传送识、阿赖耶识），非真不还也。 最后并此亦破，则方为真见性，真不还矣。 子辈回光，正回其最初不还之光，故一毫识念用不着。 使汝流转者，惟此六根，使汝成菩提者，亦惟此六根。 而尘与识皆不用，非用根也，用其根中之性耳。 今不堕识回光，则用根中之元性，落识而回光，则用根中之识性，毫厘之辨在此也。 用心即为识光，放下乃为性光。 毫厘干里，不可不辨。 识不断，则神不生； 心不空，则丹不结。 心净则丹，心空即药。 不着一物，是名心净，不留一物，是名心空。 空见为空，空犹末空，空忘其空，斯名真空。 第十一章坎离交媾 凡漏泄精神，动而交物者，皆离也。 凡收转神识，静而中涵者，皆坎也。 七窍之外走者为离，七窍之内返者为坎。 一阴主于逐色随声，一阳主于返闻收见。 坎离即阴阳，阴阳即性命，性命即身心，身心即神照。 一自敛息精神，不为境缘流转，那是真交。 而沉默趺坐时，又无论矣。 第十二章周天 周天非以气作主，以心到为妙诀。 若毕竟如何周天，是助长也，无心而守，无意而行。 仰观乎天，三百六十五度，刻刻变迁，而斗柄终古不动，吾心亦犹是也。 心即璇玑，气即众星。",
      "translated_text": "**One Day of Foundation-Laying**\nOne day of foundation-laying—yet it is not merely a day. One breath of foundation-laying—yet it is not the breath of inhalation and exhalation. The breath is the heart itself; when the heart becomes breath, it is primordial spirit, primordial qi, primordial essence. Rising and falling, parting and uniting—all arise from the heart. Being and non-being, emptiness and fullness—all reside within thought. One breath, one life-sustaining hold—how could it be limited to a hundred days? Yet a hundred days is also but a single breath. The hundred days lie solely in gaining power: if power is gained by day, it is received by night; if power is gained by night, it is received by day. The hundred days of foundation-laying are but a jade decree. The words of perfected beings invariably resonate with the human body. The words of true teachers invariably resonate with the learner. This is the mystery within mystery—what cannot be explained. Only upon seeing one’s nature does one understand. Thus, learners must seek a true teacher to transmit the record, allowing their nature to unfold freely, each manifestation verified without fail.\n\n---\n\n**Chapter Ten: The Light of Nature and the Light of Discernment**\nThe method of turning the light inward originally pervades movement, stillness, sitting, and reclining—it depends solely on grasping the mechanism. I have previously instructed: *“In an empty chamber, light arises of itself.”* This light is not external. However, there is one point to note: before the light is seen, its appearance serves as verification. If one sees it as light and clings to it with intention, one falls into the realm of discriminative thought—this is not the light of nature. Disciples, pay no heed to whether there is light or not; simply ensure that no thought arises from thought.\n\nWhat is “no thought”? It is attained where all ceases, where all is settled.\nWhat is “arising thought”? One thought, one life-sustaining hold—this thought is the correct thought, unlike the thoughts of ordinary days. The present mind is thought; thought is the present mind. This mind is both light and elixir.\n\nWhen ordinary people see objects, their eyes perceive without discrimination—this is the light of nature, like a mirror reflecting without intent, like water reflecting without intent. After a moment, it becomes the “light of discernment,” for it begins to discriminate. When a mirror holds an image, the mirror is no longer a mirror; when water holds a reflection, the water is no longer water. When light is accompanied by discernment, what light remains?\n\nAt first, disciples possess the light of nature, but with the turning of thought, it becomes discernment. Once discernment arises, the light vanishes without a trace—not that the light is absent, but that the light has become discernment. The Yellow Emperor said: *“Sound does not generate sound but generates echo.”* This is the same principle. *The Śūraṅgama’s Investigative Entry* states: *“Not in dust, not in discernment—only select the root.”* What does this mean?\n\nDust is the external world, the so-called realm of objects, which has no connection to us. To pursue it is to mistake objects for oneself. Objects must return: the penetrating returns to doors and windows, brightness returns to the sun and moon. Borrowing them as one’s own, they are never truly ours. As for that which does not return to you—if not yours, then whose? Brightness returns to the sun and moon, but the luminosity of the sun and moon does not return. The heavens may lack sun and moon at times, but humans never lack the nature to see sun and moon. If so, then the discernment of sun and moon—can it truly be considered ours? Those who distinguish between brightness and darkness—when brightness and darkness are both forgotten, where does discernment reside? Thus, even this returns. This is the inner dust.\n\nOnly the seeing of nature does not return. When one sees the act of seeing, seeing is no longer seeing—then even the seeing of nature returns. What returns is the seeing of nature in the flow of discriminative thought, which is what Ānanda meant by *“the fault lies in your mind and eyes, causing you to wander.”* Initially, when entering the discernment of returning and distinguishing, the first seven all demonstrate that each returns. Thus, the seeing of nature is retained as Ānanda’s staff. Ultimately, even the seeing of nature is entwined with the eight consciousnesses (eye-consciousness, ear-consciousness, nose-consciousness, tongue-consciousness, body-consciousness, mind-consciousness, transmitting consciousness, and storehouse consciousness)—it is not truly non-returning. Only when even this is broken through does one attain the true seeing of nature, the true non-returning.\n\nDisciples, in turning the light inward, you are precisely turning toward the light of the original non-returning. Thus, not a trace of discernment is to be employed. What causes you to wander is only these six roots; what enables you to attain bodhi is also only these six roots. Yet neither dust nor discernment is used—it is not the roots that are used, but the nature within the roots.\n\nIf you turn the light inward without falling into discernment, you employ the primordial nature within the roots. If you turn the light inward while falling into discernment, you employ the discerning nature within the roots. The distinction lies within a hair’s breadth. Employing the mind is the light of discernment; letting go is the light of nature. A hair’s breadth spans a thousand miles—this must not be confused.\n\nIf discernment is not severed, spirit does not arise. If the mind is not empty, the elixir does not form. When the mind is pure, the elixir is present; when the mind is empty, the medicine is present. Not attaching to a single thing is called “mind purity”; not retaining a single thing is called “mind emptiness.” To see emptiness as empty is still not true emptiness. To forget even emptiness—this is called true emptiness.\n\n---\n\n**Chapter Eleven: The Union of Kan and Li**\nAll leakage of essence and spirit, all movement that engages with objects—this is Li. All gathering and turning of spirit and discernment, all stillness that inwardly contains—this is Kan. That which flows outward through the seven apertures is Li; that which returns inward through the seven apertures is Kan. One yin governs the pursuit of forms and sounds; one yang governs the return of hearing and sight. Kan and Li are yin and yang; yin and yang are nature and life; nature and life are body and mind; body and mind are spirit illumination.\n\nOnce one restrains and ceases the outflow of essence and spirit, not allowing them to wander with external conditions—that is true union. And in silent cross-legged sitting, there is no need to speak of it further.\n\n---\n\n**Chapter Twelve: The Celestial Cycle**\nThe celestial cycle is not governed by qi but by the arrival of the mind as its wondrous secret. If one insists on how the celestial cycle should be, this is forced growth. Guard without intention; move without purpose.\n\nGazing up at the heavens, the three hundred and sixty-five degrees are in constant flux, yet the handle of the Dipper remains eternally unmoving. The heart is the same. The heart is the turning mechanism; qi is the multitude of stars.",
      "overlap_context": "irit, nor the light of nature, nor the torch of wisdom.\n\nAfter a hundred days of turning back, essence and qi naturally become full, true yang naturally arises, and true fire naturally exists within water. Proceeding with this, union occurs naturally, the embryo forms naturally, and I remain in the heaven of unknowing—while the infant is spontaneously perfected. If one harbors even the slightest intention, it is heterodox.\n\nA hundred days of foundation-laying—yet it is not merely a hundred days.",
      "start_char": 7984,
      "end_char": 9210,
      "start_sentence": 332,
      "end_sentence": 398,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.98791003227234,
      "metadata": {
        "source_file": "dao\\藏外\\太乙金华宗旨.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "吾身之气，四肢百体，原是贯通，不要十分着力。 于此锻炼识神，断除妄见，然后药生，药非有形之物，此性光也。 而即先天之真气，然必于大定后方见，并无采法，言采者大谬矣。 见之既久，心地光明，自然心空漏尽，解脱尘海。 若今日龙虎，明日水火，终成妄想。 吾昔受火龙真人口诀如是，不知丹书所说更何如也。 一日有一周天，一刻有一周天，坎离交处，便是一周。 我之交，即天之回转也。 未能当下休歇，所以有交之时，即有不交之时。 然天之回旋也，未尝少息。 果能阴阳交泰，大地阳和，我之中宫正位，万物一时畅遂，即丹经沐浴法也。 非大周天而何此中火候，实实有大小不同，究竟无大小可别。 到得工夫自然，不知坎离为何物，天地为何等，孰为交，孰为一周两周，何处觅大小之别耶。 总之一身旋运，虽见得极大亦小，若一回旋，天地万物，悉与之回旋，即在方寸处，亦为极大。 金丹火候，要归自然。 不自然，天地自还天地，万物各归万物。 欲强之使合，终不能合。 即如天时亢旱，阴阳不和。 乾坤未尝一日不周，然终见得有多少不自然处。 我能转运阴阳，调适自然，一时云蒸雨降，草木酣适，山河流畅，纵有乖戾，亦觉顿释，此即大周天也。 问活子时其妙，必认定正子时似着相，不着相不指明正子时。 从何识活子时，即识得活子时，确然又有一正子时，是二是一，非正非活，总要人看得真，一真则无不正，无不活矣。 见得不真，何者为正，何者为活耶。 即如活子时，是人所时时见得的。 毕竟到正子时，志气清明，活子时愈觉发现。 人未识得活的明了，只向正的时候验取，则正者现前，活者无不神妙矣。 第十三章劝世歌 吾因度世丹中热，不惜婆心并饶舌。 世尊亦为大因缘，直指生死真可惜。 老君也患有吾身，传示谷神人不识。 吾今略说寻真路：黄中通理载大易， 正位居体是玄关。 子午中间堪定息，光回祖窍万神安。 药产川原一气出， 透幕变化有金光。 一轮红曰常赫赫，世人错认坎离精。 搬运心肾成间隔， 如何人道合天心。 天若符合道自合，放下万缘毫不起。 此是先天真无极， 太虚穆穆朕兆捐。 性命关头忘意识，意识忘后见本真。 水清珠现玄难测， 无始烦障一旦空。 玉京降下九龙册，步云汉今登天关，掌雷霆兮驱霹雳。 凝神定息是初机，退藏密地为常寂。 吾昔度张珍奴二词，皆有大道。 子后午前非时也，坎离耳。 定息者，息息归根，中黄也。 坐者，心不动也。 夹脊者，非背上轮子，乃直透玉京大路也。 双关者，此处有难言者。 地雷震动山头雨者，真气生也。 黄芽出土者，药生也。 小小二段，已尽修行大路，明此可不惑人言。 昔夫子与颜子登泰山顶，望吴门白马，颜子见为疋练，夫子急掩其目，恐其太用眼力，神光走落，回光可不勉哉！ 回光在纯心行去，只将真息凝照于中宫，久之自然通灵达变也。 总是心静照定为基，心忘气凝为效，气息心空为丹成，心气浑一为温养，明心见性为了道。 子辈各宜勉力行去，错过光阴可惜也。 一日不行，一日即鬼也。 一息行此，一息真仙也。 勉之！ 勉之！",
      "translated_text": "The qi of this body—its four limbs and hundred parts—is originally interconnected; one must not exert excessive force. In this refining, recognize the spirit of consciousness and sever deluded perceptions. Only then does the medicine arise. The medicine is not a tangible thing; it is the radiance of inherent nature, the true qi of prior heaven. Yet it appears only after great stillness, and there is no method of gathering—those who speak of gathering are gravely mistaken. With prolonged perception, the mind-ground becomes luminous, naturally emptying all leaks and liberating one from the sea of dust. If today it is dragon and tiger, tomorrow water and fire, it remains mere delusion.\n\nAs I once received from the mouth of the True One of Fire Dragon: I know not how the alchemical texts describe it differently. A day has one celestial cycle; a moment has one celestial cycle. Where Kan and Li unite, there is one cycle. My union is the turning of heaven itself. Unable to rest in the immediate, there are times of union and times of non-union. Yet heaven’s revolution never ceases for even a moment. If yin and yang harmoniously unite, the great earth is bathed in yang warmth, my central palace is rightly positioned, and all things flourish at once—this is the alchemical method of bathing. What else could it be but the great celestial cycle?\n\nWithin this, the firing times truly differ in magnitude, yet ultimately no distinction of great or small remains. When skill becomes natural, one no longer knows what Kan and Li are, nor what heaven and earth are—what is union, what is one or two cycles, where to seek the difference between great and small? In sum, the revolving of the entire body, though appearing vast, is small. Yet in a single revolution, heaven, earth, and the ten thousand things all revolve with it, and even within the square inch of the heart, it is vast.\n\nThe firing times of the golden elixir must return to spontaneity. Without spontaneity, heaven remains heaven, the ten thousand things remain the ten thousand things. To force their union is to fail in union. For instance, when the heavens are parched and yin and yang disharmonious, though Qian and Kun never cease their daily revolution, there remains much that is unnatural. If I can revolve yin and yang, adjusting them to spontaneity, clouds gather and rain falls, grasses and trees thrive, mountains and rivers flow freely. Even if there is discord, it dissipates at once—this is the great celestial cycle.\n\nAs for the wondrousness of the living midnight hour, to fixate on the exact midnight hour is to cling to form. Without clinging to form, one does not point to the exact midnight hour. How then to recognize the living midnight hour? Once recognized, there is indeed an exact midnight hour—are the two one or distinct? Neither exact nor living, one must perceive it truly. When true, all is exact, all is living. Without true perception, what is exact? What is living?\n\nFor example, the living midnight hour is what one perceives at all times. Yet when it arrives at the exact midnight hour, with will and qi clear and bright, the living midnight hour becomes even more manifest. Those who have not clearly recognized the living hour seek verification only in the exact hour. When the exact hour appears, the living hour is nothing short of wondrous.\n\n**Chapter Thirteen: Song of Exhortation to the World**\nI, burning with the heat of the elixir for the world’s deliverance,\nSpare not my compassion nor my loquacity.\nThe World-Honored One, too, acted for the great causal condition,\nDirectly pointing to birth and death—how lamentable!\nThe Old Lord, too, fretted over this body of mine,\nTransmitting the Valley Spirit, unrecognized by men.\nNow I briefly speak the path to seeking the true:\nThe Yellow Center penetrates the principle, bearing the Great Change,\nRightly positioned within the body is the mysterious pass.\nBetween zi and wu, one may settle the breath,\nLight returns to the ancestral aperture, the ten thousand spirits at peace.\nThe medicine arises from the rivers and plains, a single qi emerging,\nPiercing the curtain, transforming with golden radiance.\nA red sun ever blazing—\nYet people mistake it for the essence of Kan and Li.\nMoving heart and kidney creates separation—\nHow can one speak of harmonizing with heaven’s heart?\nIf heaven accords, the Dao naturally accords.\nLay down the ten thousand conditions, not a single thought arising.\nThis is the true Wuji of prior heaven,\nThe Great Void, silent and vast, its signs concealed.\nAt the gate of life and destiny, forget consciousness;\nWhen consciousness is forgotten, the original true appears.\nWater clear, the pearl manifests—profound and unfathomable,\nThe hindrances of beginningless kalpas suddenly empty.\nFrom the Jade Capital descends the Nine Dragons’ Register,\nNow ascending the Cloud Han, mounting the celestial pass,\nWielding thunder, driving lightning.\nConcentrating spirit and settling breath is the initial mechanism,\nRetreating to the secret ground is constant quiescence.\n\nI once delivered two lyrics to Zhang Zhennu—both contain the great Dao.\nThe hours after zi and before wu are not the time—it is Kan and Li.\nSettling the breath means each breath returning to the root, the Yellow Center.\nSitting means the heart unmoving.\nThe spine’s path is not the wheel on the back—\nIt is the direct thoroughfare to the Jade Capital.\nThe double pass—here there is that which is hard to speak.\nWhen the earth’s thunder shakes and mountain rain falls—true qi is born.\nWhen the yellow sprout emerges from the soil—the medicine is born.\nThese small two sections encompass the great path of cultivation.\nUnderstanding this, one will not be confused by others’ words.\n\nLong ago, the Master and Yanzi ascended the summit of Mount Tai,\nGazing toward the White Horse Gate of Wu.\nYanzi saw it as a bolt of silk;\nThe Master quickly covered his eyes,\nFearing he had overused his vision, causing the spirit-light to scatter.\nHow can one not strive to return the light?\nReturning the light lies in pure-hearted practice,\nSimply gathering the true breath to illumine the central palace.\nWith time, it naturally becomes spiritually efficacious and transformative.\nIn sum: stilling the heart to fix the illumination is the foundation;\nForgetting the heart and congealing qi is the effect;\nQi settling and heart emptying is elixir completion;\nHeart and qi merging as one is the nurturing;\nIlluminating the heart and seeing nature is the completion of the Dao.\n\nYou disciples must each strive to practice.\nTo waste time is lamentable.\nA day without practice is a day as a ghost.\nA single breath in this practice is a single breath as a true immortal.\nStrive! Strive!",
      "overlap_context": "---\n\n**Chapter Twelve: The Celestial Cycle**\nThe celestial cycle is not governed by qi but by the arrival of the mind as its wondrous secret. If one insists on how the celestial cycle should be, this is forced growth. Guard without intention; move without purpose.\n\nGazing up at the heavens, the three hundred and sixty-five degrees are in constant flux, yet the handle of the Dipper remains eternally unmoving. The heart is the same. The heart is the turning mechanism; qi is the multitude of stars.",
      "start_char": 9210,
      "end_char": 10428,
      "start_sentence": 399,
      "end_sentence": 461,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.419455766677856,
      "metadata": {
        "source_file": "dao\\藏外\\太乙金华宗旨.txt",
        "category": "藏外"
      }
    }
  ]
}