{
  "source_id": "太上灵宝首入净明四规明鉴经",
  "source_file": "chunked_daozang\\太上灵宝首入净明四规明鉴经.json",
  "total_chunks": 2,
  "total_original_chars": 2146,
  "total_translated_chars": 12342,
  "total_translation_time": 56.741692543029785,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏太平部\\太上灵宝首入净明四规明鉴经.txt",
    "category": "正统道藏太平部"
  },
  "full_translation": "**The Supreme Numinous Treasure’s First Entry into the Four Rules of Pure Brightness and the Mirror of Clarity Sutra**\n\n**Title:** *The Supreme Numinous Treasure’s First Entry into the Four Rules of Pure Brightness and the Mirror of Clarity Sutra*\n**Author:** Unknown\n\n**Chapter One: The Fundamental Chapter**\n\nThe Dao is inherent in one’s nature; it is not something externally imposed. Filial piety and fraternal duty are the roots of the Dao, not something forcibly enacted. From filial piety and fraternal duty, one extends to loyalty; thus, these accumulate to form conduct. When conduct is complete, the Dao daily flourishes. Therefore, the noble scholar who studies the Dao establishes loyalty and filial piety as the foundation. With the foundation set, the Dao grows day by day.\n\nThe Dao merges indistinguishably; it is the same for the foolish and the wise. Foolishness and wisdom do not divide the Dao. The foolish are benighted, the wise are cunning; benightedness obscures clarity, cunning undermines authenticity. Lacking clarity and authenticity, one drifts ever farther from the Dao. To know the Dao is to dispel foolishness, to cast off cleverness, and to achieve true clarity. Being true, one aligns with the Dao, and the Dao then becomes yours.\n\nTo study the Dao is to attain immortality; immortality is not difficult—loyalty and filial piety come first. Without loyalty and filial piety, to seek the Dao and hope for immortality is something that has never been. Bi Gan sacrificed his life to fulfill loyalty; life is what people cherish most, yet Bi Gan did not cling to his life but relinquished it to seek the Dao. He trusted in the Dao’s completeness, knowing it would not fail him, and thus became an immortal. Great Shun devoted his life to fulfill filial piety; toil is what people most dread, yet Shun did not shrink from labor but endured it to seek the Dao. He trusted in the Dao’s completeness, knowing it would not fail him, and thus became truly steadfast.\n\nThe Dao of loyalty and filial piety does not necessarily grant longevity, yet the nature of longevity persists beyond death without fading. Those ranked among the immortals are called \"long-lived.\" Some speak of cultivating qi to extend years, but those who live long without merit grasp only a fraction of the truth. The noble one’s attainment of the Dao lies in the perfection of the eight eights.\n\nThus, Shan Juan sacrificed himself to perfect integrity; Nan Rong repeated the jade tablet’s lesson to perfect prudence; Rong Qi endured poverty to perfect magnanimity; Yan Hui found abundance in a bamboo bowl and gourd ladle. Such people all stand foremost among the immortal ministers—how could they be mere emaciated recluses of mountains and marshes?\n\nLater generations, having lost the Dao, are disloyal and unfilial, bringing chaos to their states. When the state collapses, they find no refuge and retreat to the mountains to study the Dao. This is like abandoning a mansion to enter a raging fire.\n\nHave you not seen that when the people are disloyal, Heaven raises ministers of greed and plunder? When children are unfilial, wives bear descendants who ruin the clan. War, drought, and locusts are not the state’s fault. If the ruler is disloyal and unfilial above, and ministers and people are disloyal and unfilial below, qi resonates and gives rise to these calamities. Those who cause chaos accumulate transgressions within themselves; evil intentions fill them, and sins amass until rebellion sprouts in their hearts. Heaven uses this to correct their crimes, employing others’ hands to kill them. To call the people innocent—how can such words be known?\n\nAs disciples, we teach that loyalty and filial piety are the foundation. Establishing this foundation to attain immortality, the immortals of the world can be counted in full. Never has there been one who was disloyal and unfilial yet ascended to the celestial court to serve the imperial throne.\n\n**Chapter Two: Cultivating the Self**\n\nLoyalty and filial piety free one from transgressions and distance misfortune. Cultivation dispels falsehood and deception; without falsehood and deception, the body is at peace. Cultivation means using the mind to reach the mind, using nature to reach nature. When mind and nature are thoroughly illuminated, their radiance shines forth.\n\nReturn the qi of the cinnabar field to the celestial palace; restore the qi of primordial essence to the great sea. Do not be burdened by external things, so that the physical form cannot constrain you, nor can glory and splendor tempt you. Knowing sufficiency, one is always content, and afflictions fade. Knowing harmony, one harmonizes, and disputes dissolve.\n\nThe body does not belong to itself—how then can it possess things? Untainted by external things, how can there be delusion? When mind and nature are true, when essence and spirit are full, by day there is no false awareness, and one’s actions are genuine. By night there are no false dreams, and one’s rest is secure.\n\nGather the mind back to the body; gather thoughts to attain correctness. One’s qi steams forth, one’s spirit expands, and one’s vision soars. Communing spirit with spirit, the spirit becomes numinous of itself. Seizing qi with qi, qi emerges into the great void. Within the great void, the spirit stands solitary. Solitary and unshaken, the mind and nature remain unshaken. When mind and nature are harmonized, talismans and elixirs become mere tools, to be discarded.\n\nThe superior scholar need not retreat to the mountains, sever human affairs, abandon wife and children, withdraw to the wilderness, or forsake glory and splendor to be called one who cultivates. To cultivate mind and nature, to clarify the mind and unblock qi, to never fail in filial piety and fraternal duty—this differs from the emaciated youths of mountains and marshes.\n\nThose who understand my Dao find it not difficult to practice. Use the mind to reach the mind; use nature to transform nature. Let nature rest in oneness; let the mind rest in the spirit. When mind and nature are perfectly fused, one naturally attains longevity. With longevity, one naturally transforms; the supreme Dao is not difficult to know, and the supreme Dao is exceedingly easy.\n\nPetty people abandon the easy to seek the difficult. When first entering the Dao of Pure Brightness, loyalty, and filial piety, one should seek what is easy. Mastering the easy, one need not fear the difficult. This is the clarity and thorough illumination of mind and nature, the inherent truth of humanity, not something feigned.\n\nAttaining the Dao of true constancy, the Dao is thus present.\n\n**Chapter Three: Establishing Merit**\n\nIn the world, there is a wondrous Dao from which sagely merit arises and numinous clarity emerges. Numinous clarity means the mind manifests as spirit, and nature manifests as clarity. With merit, one attains the Dao, for the Dao does not obscure our mind and nature. Without merit, one loses the Dao, drifting from the path of mind and nature. The mind is not clear, and nature is not numinous.\n\nThe superior scholar who grasps the Dao’s wonder resides in the truth of mind and nature, and delusion is far removed.\n\nTo distance oneself from delusion is the way to achieve merit. With a single thought, lead and mercury arise; with a second thought, the yellow sprout flourishes; with a third thought, tiger and dragon unite—the precious cauldron is settled, auspicious clouds emerge, for the clarity and discernment of mind and nature are thus complete.\n\nHerein, one accumulates what is practiced and knows what to esteem. What is esteemed? Esteeming benevolence, righteousness, loyalty, and filial piety. When loyalty and filial piety are perfected, the root is established, and merit may be cultivated. The Dao of establishing merit entails no yang blessings squandered, no yin transgressions committed, no burdens from things, no blame from others, no reproach from spirits. Thus, one aligns above with the Three Origins and below with the myriad beings.\n\nLesser scholars invoke talismanic water and administer medicinal decoctions—merely treating one illness to save one person, yet calling it merit; this is no true merit. Such are the affairs of Daoists, mere expedient dharma gates. Our loyalty, filial piety, purity, and clarity serve as the ministers. Elevating all under heaven to longevity, settling the four seas into Great Peace, the ruler is at ease, the people prosper, and the myriad beings naturally follow. Leading the three armies, one achieves victory without battle, subduing the enemy’s forces. Thus, our troops are ever-victorious. Through our loyalty, the disloyal are transformed into loyalty; through our filial piety, the unfilial are transformed into filial piety—how boundless is such merit!\n\nWhy is this so? Where there is delusion and truth, only the utmost truth of the world can subdue the delusions of all people. The loyal, though they sacrifice their lives, do not fear; the filial, though they toil, do not resent—this is the utmost truth of the world. The superior scholar, through truth, obscures delusion, and delusion naturally clears. Then the merit of the world is accomplished—how much more so for people, how much more for spirits and gods?\n\n**Chapter Four: Completing the End**\n\nIn learning, what is prized is a beginning, but there must also be an end. Heaven’s affairs begin in spring and culminate in winter, completing the year. Earth’s affairs begin in the east and culminate in the north, achieving the transformation into immortality. Learning begins with filial piety and culminates in the Dao, completing one’s studies.\n\nThe superior scholar establishes loyalty and filial piety through refinement; the middling scholar, through resolve; the lesser scholar, through effort. Those who obscure the Dao act contrary to this, lacking loyalty and filial piety.\n\nWhat does it mean for the superior scholar to establish loyalty and filial piety through refinement? To lead the world with words. What does it mean for the middling scholar to establish loyalty and filial piety through resolve? To take the lead in conduct. What does it mean for the lesser scholar to achieve loyalty and filial piety through effort? To set an example for the multitude.\n\nThose who do so have their names inscribed in the Southern昌 Upper Palace, their registers entered among the immortals, and the Dao of loyalty and filial piety is thus fulfilled. Those who obscure the Dao act contrary to this, being neither filial nor loyal, and thus fail to complete the Dao. In life, they violate prohibitions; in death, they transgress the laws. Those who violate prohibitions are punished by officials according to established codes. Those who transgress the laws are judged in the unseen realms, facing karmic retribution.\n\nThe disloyal incur misfortune from their lords; the unfilial, from their children. The unprincipled suffer disgrace; the reckless, rebellion; the narrow-minded, vexation; the ungenerous, greed and perpetual want. The intolerant provoke many conflicts; the unyielding, self-inflicted harm.\n\nThus, those who live without integrity—after death, their souls become jesters among men, servile spirits, or beasts of burden. Those who live without courage—after death, their souls become soldiers among men, executed spirits, or the six livestock. From these examples, one may infer the rest.\n\nTherefore, those who know the Dao revere these principles, guarding their hearts and sincerely embracing the eight directions. Establishing the eight directions as a foundation, one builds upon this foundation to illuminate one’s nature. When mind and nature are illuminated, one does not seek the numinous, yet the numinous is naturally numinous—this is called purity and clarity.\n\nIn the practice of purity and clarity, loyalty and filial piety are the practice; when the Dao of loyalty and filial piety is perfected, what is purity? Not being stained by things. What is clarity? Not being obstructed by things. Unstained and unobstructed, loyalty and filial piety are naturally attained. Living thus, dying thus. When loyalty and filial piety are established, mind and nature are attained.\n\n*The Supreme Numinous Treasure’s Primary Scripture of Purity and Clarity’s Four Regulations and Luminous Mirror* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上灵宝首入净明四规明鉴经 经名：太上灵宝首入净明四规明鉴经。 撰人不详。 四经同卷。 底本出处：《正统道藏》太平部。 太上灵宝首入净明四规明鉴经 章本章第一 道者性所有，固非外而铄。 孝弟道之本，固非强而为。 得孝弟而推之忠，故积而成行。 行备而道日充，是以尚士学道，忠孝以立本也，本立而道日生矣。 道混乎其同，同於愚智，愚智不谓道而分也。 愚者昧，智者巧，昧则不明，巧则不真，不明不真，去道所以远也。 知道则廓愚，以为明去智，以成真明，真而信於道，道则为汝有矣。 学道以致仙，仙非难也，忠孝者先之。 不忠不孝，而求乎道，而冀乎仙，未之有也。 比干杀身以成忠，生者人之所甚爱，比干不爱其身，而舍生以求道，信道有备，知其不误，其为仙也。 大舜终身以成孝，劳者人所甚畏，大舜不惮其劳，而服劳以求道，信道有备，知其不误，其为信也。 忠孝之道，非必长生，而长生之性，存死而不昧，列於仙班，谓之长生。 有曰养炁延年，无功而多岁齿者特，未得其一二尔。 君子之致乎道，八八极是也。 故善卷杀身以成廉，南容复圭以成慎，荣期安贫以成宽，颜回箪瓢以为裕。 如是之人，皆冠於仙卿，是岂山泽之癯者哉。 后世失道之人，不忠不孝，以乱其国家。 国家败，乃无所容其身，乃入山以学道。 是犹舍厦屋，而入炎火也。 子不见，民之不忠，天生聚敛之臣。 子之不孝，妇生败宗之孙。 兵戈旱蝗，非国之罪也。 君不忠不孝於上，臣民不忠不孝於下，炁感而生，天生兵戈。 为乱者，衅积於己，恶心盈而罪贯积，逆乱萌於心。 天以此正其罪，假手於其人杀之尔。 而曰民之无辜，岂知言哉。 吾为弟子，说忠孝为本，立本以成仙，则天下之仙举可数矣。 未有不忠不孝，而参天庭奉宸极也。 修身章第二 忠孝则无罪戾，去祸远矣。 服炼则无妄伪，无妄伪则身安矣。 服炼者，以心达心，以性达性，心性洞达，其光焕发。 回丹田之炁，而归天宫，还元精之炁，而归大海。 不以外物累，而形骸不能拘也，荣华不能诱也。 知足常足，烦恼远矣。 知和而和，是非消矣。 身不自有，何有於物。 外物不染，何有於妄。 其心性真，其精神足，昼则无妄觉，所为者真也。 夜则无妄梦，所安者固也。 摄意归于身，摄想得乎正。 其炁蒸然，其神廓然，其见飞飞然。 以神交神，神者自神。 以炁夺炁，炁出太空。 太空之中，其神卓然。 卓然不荡也，不荡之心性也，不荡之性心也。 心性调，而符药为筌蹄，而可弃也。 上士非必入山，绝人事，去妻子，入旷野、舍荣华，而谓之服炼。 服炼心性，心明炁达，孝弟不亏，与山泽之臞童者异矣。 知吾道者，不难行矣。 以心达心，以性化性。 性止於一，心止於神。 心性圆融，而自长生。 得长生而自变化，上道不难知，上道则甚易也。 小人舍易以求难。 初入净明忠孝之道，当求其易，得其易则不患其难也。 可则心性之明彻，洞达人所固有非伪为也。 得真常之道，道斯在也。 建功章第三 天下有妙道，圣功生焉，神明出焉。 神明者，心出为神，性出为明。 有功以达，夫道不昧吾之心性也。 无功以失乎道，则去心性之道，心不明而性不神也。 上士得道之妙，在心性即真，而妄者远矣。",
      "translated_text": "**The Supreme Numinous Treasure’s First Entry into the Four Rules of Pure Brightness and the Mirror of Clarity Sutra**\n\n**Title:** *The Supreme Numinous Treasure’s First Entry into the Four Rules of Pure Brightness and the Mirror of Clarity Sutra*\n**Author:** Unknown\n\n**Chapter One: The Fundamental Chapter**\n\nThe Dao is inherent in one’s nature; it is not something externally imposed. Filial piety and fraternal duty are the roots of the Dao, not something forcibly enacted. From filial piety and fraternal duty, one extends to loyalty; thus, these accumulate to form conduct. When conduct is complete, the Dao daily flourishes. Therefore, the noble scholar who studies the Dao establishes loyalty and filial piety as the foundation. With the foundation set, the Dao grows day by day.\n\nThe Dao merges indistinguishably; it is the same for the foolish and the wise. Foolishness and wisdom do not divide the Dao. The foolish are benighted, the wise are cunning; benightedness obscures clarity, cunning undermines authenticity. Lacking clarity and authenticity, one drifts ever farther from the Dao. To know the Dao is to dispel foolishness, to cast off cleverness, and to achieve true clarity. Being true, one aligns with the Dao, and the Dao then becomes yours.\n\nTo study the Dao is to attain immortality; immortality is not difficult—loyalty and filial piety come first. Without loyalty and filial piety, to seek the Dao and hope for immortality is something that has never been. Bi Gan sacrificed his life to fulfill loyalty; life is what people cherish most, yet Bi Gan did not cling to his life but relinquished it to seek the Dao. He trusted in the Dao’s completeness, knowing it would not fail him, and thus became an immortal. Great Shun devoted his life to fulfill filial piety; toil is what people most dread, yet Shun did not shrink from labor but endured it to seek the Dao. He trusted in the Dao’s completeness, knowing it would not fail him, and thus became truly steadfast.\n\nThe Dao of loyalty and filial piety does not necessarily grant longevity, yet the nature of longevity persists beyond death without fading. Those ranked among the immortals are called \"long-lived.\" Some speak of cultivating qi to extend years, but those who live long without merit grasp only a fraction of the truth. The noble one’s attainment of the Dao lies in the perfection of the eight eights.\n\nThus, Shan Juan sacrificed himself to perfect integrity; Nan Rong repeated the jade tablet’s lesson to perfect prudence; Rong Qi endured poverty to perfect magnanimity; Yan Hui found abundance in a bamboo bowl and gourd ladle. Such people all stand foremost among the immortal ministers—how could they be mere emaciated recluses of mountains and marshes?\n\nLater generations, having lost the Dao, are disloyal and unfilial, bringing chaos to their states. When the state collapses, they find no refuge and retreat to the mountains to study the Dao. This is like abandoning a mansion to enter a raging fire.\n\nHave you not seen that when the people are disloyal, Heaven raises ministers of greed and plunder? When children are unfilial, wives bear descendants who ruin the clan. War, drought, and locusts are not the state’s fault. If the ruler is disloyal and unfilial above, and ministers and people are disloyal and unfilial below, qi resonates and gives rise to these calamities. Those who cause chaos accumulate transgressions within themselves; evil intentions fill them, and sins amass until rebellion sprouts in their hearts. Heaven uses this to correct their crimes, employing others’ hands to kill them. To call the people innocent—how can such words be known?\n\nAs disciples, we teach that loyalty and filial piety are the foundation. Establishing this foundation to attain immortality, the immortals of the world can be counted in full. Never has there been one who was disloyal and unfilial yet ascended to the celestial court to serve the imperial throne.\n\n**Chapter Two: Cultivating the Self**\n\nLoyalty and filial piety free one from transgressions and distance misfortune. Cultivation dispels falsehood and deception; without falsehood and deception, the body is at peace. Cultivation means using the mind to reach the mind, using nature to reach nature. When mind and nature are thoroughly illuminated, their radiance shines forth.\n\nReturn the qi of the cinnabar field to the celestial palace; restore the qi of primordial essence to the great sea. Do not be burdened by external things, so that the physical form cannot constrain you, nor can glory and splendor tempt you. Knowing sufficiency, one is always content, and afflictions fade. Knowing harmony, one harmonizes, and disputes dissolve.\n\nThe body does not belong to itself—how then can it possess things? Untainted by external things, how can there be delusion? When mind and nature are true, when essence and spirit are full, by day there is no false awareness, and one’s actions are genuine. By night there are no false dreams, and one’s rest is secure.\n\nGather the mind back to the body; gather thoughts to attain correctness. One’s qi steams forth, one’s spirit expands, and one’s vision soars. Communing spirit with spirit, the spirit becomes numinous of itself. Seizing qi with qi, qi emerges into the great void. Within the great void, the spirit stands solitary. Solitary and unshaken, the mind and nature remain unshaken. When mind and nature are harmonized, talismans and elixirs become mere tools, to be discarded.\n\nThe superior scholar need not retreat to the mountains, sever human affairs, abandon wife and children, withdraw to the wilderness, or forsake glory and splendor to be called one who cultivates. To cultivate mind and nature, to clarify the mind and unblock qi, to never fail in filial piety and fraternal duty—this differs from the emaciated youths of mountains and marshes.\n\nThose who understand my Dao find it not difficult to practice. Use the mind to reach the mind; use nature to transform nature. Let nature rest in oneness; let the mind rest in the spirit. When mind and nature are perfectly fused, one naturally attains longevity. With longevity, one naturally transforms; the supreme Dao is not difficult to know, and the supreme Dao is exceedingly easy.\n\nPetty people abandon the easy to seek the difficult. When first entering the Dao of Pure Brightness, loyalty, and filial piety, one should seek what is easy. Mastering the easy, one need not fear the difficult. This is the clarity and thorough illumination of mind and nature, the inherent truth of humanity, not something feigned.\n\nAttaining the Dao of true constancy, the Dao is thus present.\n\n**Chapter Three: Establishing Merit**\n\nIn the world, there is a wondrous Dao from which sagely merit arises and numinous clarity emerges. Numinous clarity means the mind manifests as spirit, and nature manifests as clarity. With merit, one attains the Dao, for the Dao does not obscure our mind and nature. Without merit, one loses the Dao, drifting from the path of mind and nature. The mind is not clear, and nature is not numinous.\n\nThe superior scholar who grasps the Dao’s wonder resides in the truth of mind and nature, and delusion is far removed.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1235,
      "start_sentence": 0,
      "end_sentence": 70,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.25603151321411,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\太上灵宝首入净明四规明鉴经.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "远於妄，所以成功也。 一思而铅汞生，再想而黄芽茁，三想而虎龙交，宝鼎安矣，庆云生矣，心性之了辩故也。 於此，而积所习，知所尚。 何谓所尚，尚乎仁义忠孝。 忠孝备而成本，可以立功。 立功之道，无阳福，无阴愆，无物累，无人非，无鬼责。 所以上合於三元，下合於万物也。 下士呼符水，治药饵已。 人之一疾，救人之一病，而谓之功，非功也。 此道家之事，方便法门尔。 吾之忠孝净明者，以之为相。 举天下之民跻於寿，措四海而归太平。 使君上安，民自阜，万物莫不自然以之。 将举三军之众，而神於不战，以屈人之兵。 则吾之兵，常胜之兵也。 以吾之忠使不忠之人尽变以为忠，以吾之孝使不孝之人尽变以为孝，其功可胜计哉。 何则有妄有真，惟天下之至真，可以摄天下之人妄。 忠者尽忠杀身不畏，孝者尽孝虽劳不恶，则天下之甚真也。 上士以真冥妄，妄自清矣。 则天下之功成，况於人乎，况於鬼神乎。 成终章第四 学贵乎始，必有乎终。 天事始乎春，至冬而岁成。 地事始乎东，至北而化成仙。 学始乎孝，至道而学成。 上士以文立忠孝，中士以志立忠孝，下士以力致忠孝。 昧道者反此，不有於忠孝。 何谓上士以文立忠孝，以言为天下唱。 何谓中士以志立忠孝，以行为天下先。 何谓下士以力致忠孝，以身为众人率。 如此者，南昌上宫着名，升籍入仙，而忠孝之道终矣。 昧者反之，不孝不忠，故不成乎道。 生则犯禁，死则犯科。 犯禁者治於官，有典刑。 犯科者治於幽，有反报。 不忠者有臣祸，不孝者有子祸。 不廉者辱，不慎者撗逆，不宽者恼，不裕者贪而常不足。 不容者多所触，不忍者自罹其毒。 故生而不廉死之魂，为人则侣优，为鬼则顺，为物则牛马。 生而不怯死之魂，为人则士卒，为鬼则戮，为物则六畜。 凡即此，可以类推也。 是以知道者畏之，谨心诚八极。 立八极以为基，立基以明立性。 心性明，则不期於神，而神自神，谓之净明。 净明之习，忠孝以为习，积忠孝之道备矣。 何谓净，不染物。 何谓明，不触物物。 不染不触，忠孝自得。 生乎由是，死乎由是。 忠孝立，而心性得矣。 太上灵宝首入净明四规明鉴经竟",
      "translated_text": "To distance oneself from delusion is the way to achieve merit. With a single thought, lead and mercury arise; with a second thought, the yellow sprout flourishes; with a third thought, tiger and dragon unite—the precious cauldron is settled, auspicious clouds emerge, for the clarity and discernment of mind and nature are thus complete.\n\nHerein, one accumulates what is practiced and knows what to esteem. What is esteemed? Esteeming benevolence, righteousness, loyalty, and filial piety. When loyalty and filial piety are perfected, the root is established, and merit may be cultivated. The Dao of establishing merit entails no yang blessings squandered, no yin transgressions committed, no burdens from things, no blame from others, no reproach from spirits. Thus, one aligns above with the Three Origins and below with the myriad beings.\n\nLesser scholars invoke talismanic water and administer medicinal decoctions—merely treating one illness to save one person, yet calling it merit; this is no true merit. Such are the affairs of Daoists, mere expedient dharma gates. Our loyalty, filial piety, purity, and clarity serve as the ministers. Elevating all under heaven to longevity, settling the four seas into Great Peace, the ruler is at ease, the people prosper, and the myriad beings naturally follow. Leading the three armies, one achieves victory without battle, subduing the enemy’s forces. Thus, our troops are ever-victorious. Through our loyalty, the disloyal are transformed into loyalty; through our filial piety, the unfilial are transformed into filial piety—how boundless is such merit!\n\nWhy is this so? Where there is delusion and truth, only the utmost truth of the world can subdue the delusions of all people. The loyal, though they sacrifice their lives, do not fear; the filial, though they toil, do not resent—this is the utmost truth of the world. The superior scholar, through truth, obscures delusion, and delusion naturally clears. Then the merit of the world is accomplished—how much more so for people, how much more for spirits and gods?\n\n**Chapter Four: Completing the End**\n\nIn learning, what is prized is a beginning, but there must also be an end. Heaven’s affairs begin in spring and culminate in winter, completing the year. Earth’s affairs begin in the east and culminate in the north, achieving the transformation into immortality. Learning begins with filial piety and culminates in the Dao, completing one’s studies.\n\nThe superior scholar establishes loyalty and filial piety through refinement; the middling scholar, through resolve; the lesser scholar, through effort. Those who obscure the Dao act contrary to this, lacking loyalty and filial piety.\n\nWhat does it mean for the superior scholar to establish loyalty and filial piety through refinement? To lead the world with words. What does it mean for the middling scholar to establish loyalty and filial piety through resolve? To take the lead in conduct. What does it mean for the lesser scholar to achieve loyalty and filial piety through effort? To set an example for the multitude.\n\nThose who do so have their names inscribed in the Southern昌 Upper Palace, their registers entered among the immortals, and the Dao of loyalty and filial piety is thus fulfilled. Those who obscure the Dao act contrary to this, being neither filial nor loyal, and thus fail to complete the Dao. In life, they violate prohibitions; in death, they transgress the laws. Those who violate prohibitions are punished by officials according to established codes. Those who transgress the laws are judged in the unseen realms, facing karmic retribution.\n\nThe disloyal incur misfortune from their lords; the unfilial, from their children. The unprincipled suffer disgrace; the reckless, rebellion; the narrow-minded, vexation; the ungenerous, greed and perpetual want. The intolerant provoke many conflicts; the unyielding, self-inflicted harm.\n\nThus, those who live without integrity—after death, their souls become jesters among men, servile spirits, or beasts of burden. Those who live without courage—after death, their souls become soldiers among men, executed spirits, or the six livestock. From these examples, one may infer the rest.\n\nTherefore, those who know the Dao revere these principles, guarding their hearts and sincerely embracing the eight directions. Establishing the eight directions as a foundation, one builds upon this foundation to illuminate one’s nature. When mind and nature are illuminated, one does not seek the numinous, yet the numinous is naturally numinous—this is called purity and clarity.\n\nIn the practice of purity and clarity, loyalty and filial piety are the practice; when the Dao of loyalty and filial piety is perfected, what is purity? Not being stained by things. What is clarity? Not being obstructed by things. Unstained and unobstructed, loyalty and filial piety are naturally attained. Living thus, dying thus. When loyalty and filial piety are established, mind and nature are attained.\n\n*The Supreme Numinous Treasure’s Primary Scripture of Purity and Clarity’s Four Regulations and Luminous Mirror* concludes.",
      "overlap_context": "here is a wondrous Dao from which sagely merit arises and numinous clarity emerges. Numinous clarity means the mind manifests as spirit, and nature manifests as clarity. With merit, one attains the Dao, for the Dao does not obscure our mind and nature. Without merit, one loses the Dao, drifting from the path of mind and nature. The mind is not clear, and nature is not numinous.\n\nThe superior scholar who grasps the Dao’s wonder resides in the truth of mind and nature, and delusion is far removed.",
      "start_char": 1235,
      "end_char": 2060,
      "start_sentence": 71,
      "end_sentence": 121,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.485661029815674,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\太上灵宝首入净明四规明鉴经.txt",
        "category": "正统道藏太平部"
      }
    }
  ]
}