{
  "source_id": "太上灵宝芝草品",
  "source_file": "chunked_daozang\\太上灵宝芝草品.json",
  "total_chunks": 6,
  "total_original_chars": 5509,
  "total_translated_chars": 31574,
  "total_translation_time": 131.43303418159485,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\太上灵宝芝草品.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Supreme Numinous Treasure: Catalog of Sacred Fungi**\n\n*Scripture Title:* The Supreme Numinous Treasure: Catalog of Sacred Fungi. Author unknown, likely composed during the Northern and Southern Dynasties or the Sui-Tang period. Not recorded in the *Lingbao Scripture Catalog*. One scroll. Source text: *Zhengtong Daoist Canon*, Orthodox Section, Part One.\n\n**The Supreme Numinous Treasure: Catalog of Sacred Fungi**\n\nThe art of prolonging life fundamentally relies upon consuming elixirs to attain longevity. As the *Book of Hidden Marvels* states: \"The immortals command spirits.\" Thus, Guangchengzi dwelled upon Mount Kongtong, revealing the Dao and its governance to the Yellow Emperor. Chisongzi ascended the Kunlun Palace, ingesting *shuiyu* (water jade) to instruct the Flame Emperor. They roamed with wind and rain, ascending and descending to investigate subtle omens, traversing famous mountains, and observing flora—unveiling the mysteries of the obscure.\n\nThe forms of sacred fungi (*zhi*) are manifold, their myriad manifestations difficult to distinguish. Thus, illustrations were drawn, their appearances recorded, and their descriptions transmitted, that seekers might follow them to attain the path of immortality.\n\n**Azure Jade Fungus** grows upon the mountains of Yangzhou. Its flavor is sweet and sour; consuming it grants twelve myriad years of life. Wang Ziqiao ate it and ascended as an immortal. A green tiger guards it. According to the illustration, it has four layers, with two branches on the second layer—its stem and cap are entirely azure.\n\n**Cinnabar Jade Fungus** (also called *Zishi Fungus*) grows upon the mountains of Yuzhou. Its form is as depicted, and its flavor is bitter. Chisongzi consumed it and attained immortality. A red tiger and red fish guard it. According to the illustration, its stem and cap are crimson, with two layers. The lower layer bears two small fungi, and the upper layer has two small fungi, each with a cap.\n\n**Yellow Jade Fungus** grows upon Mount Penglai. Its color is yellow, and its flavor is pungent. The Eastern King Father consumed it, attaining ninety thousand years of life and immortality. A yellow tiger and yellow fish guard it. It has three layers; the lower layer bears three branches, one of which produces nine caps. Its stem and cap are entirely yellow.\n\n**White Jade Fungus** grows within Mount Fangzhang. Its flavor is pungent and white. It has four layers; on the lowest layer, two grow upward, and three grow upon the upper layer. It may also sprout upon great stones, in yellow sands, at the roots of rotting wood, beneath tall trees, or on the shady sides of famous mountains. Consuming it grants immortality. A white tiger guards it.\n\n**Black Jade Fungus** grows within Mount Gui. Its flavor is sweet and sour. Xianyuzi consumed it and attained immortality. A black tiger guards it nearby, its form as depicted. It has two small branches growing in layers, its color black, with four layers—its stem and cap are both crimson.\n\n**Five Thearchs’ Jade Fungus** grows within the renowned mountains of Songgao. It possesses five colors and five transformations corresponding to the Five Phases. Its flavor changes with the four seasons. Consuming it in accordance with the seasons grants ten thousand years of immortality. It has three layers; the lower two layers bear two opposing branches.\n\n**Azure Thearch’s Jade Fungus** grows beneath great trees in famous mountains, veiled by yellow clouds. Its cap is azure, its lining crimson, its stem white, and its flavor sour. Harvested on *jiayi* days in spring and consumed, it grants ageless immortality.\n\n**Cinnabar Thearch’s Jade Fungus** grows on the sunny sides of famous mountains. Its cap is crimson, its lining yellow, and its stem white. Red clouds hover above it, and its flavor is sweet and bitter. Harvested in summer and consumed, it grants four thousand years of immortality.\n\n**Yellow Thearch’s Jade Fungus** grows atop famous mountains, above which five-colored clouds appear. Its cap is yellow, its stem white, and its flavor sweet and bitter. Consuming it banishes fear and grants thirty thousand years of life, attaining immortality.\n\n**White Thearch’s Jade Fungus** grows between layered stones on the sunny sides of famous mountains. Its cap is white, its stem azure, and its lining black, with a sweet flavor. Consuming it grants three thousand years of immortality.\n\n**Black Thearch’s Jade Fungus** grows within great valleys on the shady sides of famous mountains, veiled by black clouds. Its cap is black, its lining azure, and its stem yellow, with a sweet and sour flavor. Harvested in winter and consumed, it prevents aging and grants immortality.\n\n**Eastern Fungus** grows within great valleys on the sunny sides of famous mountains. Its lining is azure and crimson, with two layers and a white cap. Its stem is azure, and its flavor is sour. Consuming it extends life to ten myriad years of immortality.\n\n**Southern Fungus** grows on the sunny sides of famous mountains. It is crimson, with a crimson cap and stem, bearing three branches. Its flavor is bitter. Harvested with a bamboo knife, dried in the shade for a hundred days, and consumed in coin-sized portions, it grants thirty thousand years of immortality.\n\n**Central Fungus** grows on the shady sides of famous mountains. Its cap is white, its stem yellow, and its lining black. Its branches resemble a single stem with a cap, two branches at the midpoint, their tips curling downward like suspended canopies. A yellow ram guards it. Harvested with a wooden knife and consumed, it grants immortality.\n\n**Western Fungus** grows on the shady sides of famous mountains. Its cap is white, its lining black, and its stem azure, with three branches growing together. Its flavor is sweet and pungent. Consuming it grants ten thousand years of immortality.\n\n**Northern Fungus** grows on the shady sides of famous mountains. Its cap is black, with three branches growing together from the stem. Its flavor is sweet and pleasant. Consuming it grants immortality—one who eats it will not drown in water, will not age, and will attain eighty myriad years of life. A black ox guards it.\n\n**Stone Mortar Fungus** grows upon Mount Shaoshi, beneath red clouds, with yellow tigers guarding it on both sides. Its cap is crimson, its stem black, and it grows opposite the *Stone Jade Fungus*. To harvest it, one must fast and bathe for thirty days. When a rooster crows at dawn, the gatherer declares themselves *Tianzhai Jiangjun* (Heavenly Fasting General), dons colorful robes, and wears a dark crown and sash. Consuming a single *ge* (measure) grants sixty myriad years of life. (Alternatively, sixteen myriad years.)\n\n**Growing between great stones**, its flavor is sweet and tart, its lower roots square, and it stands three *chi* tall.\n\n**Wood Spirit Fungus** grows upon the northern slopes of Mount Songgao. Its cap is yellow with a black underside, and above it hover red clouds with vermilion sparrows guarding it. Harvested on a *wu* or *ji* day of the sixth month and consumed, it grants nine thousand years of life, rendering one immortal. Its form resembles a square stone with a single flat surface.\n\n**Ghost Mushroom Fungus** grows upon the northern slopes of renowned mountains. Its cap is white, shaped like a steamer, and two ghosts guard it—vanishing at the sight of humans. Gathered at night and dried in the shade for a hundred days, consuming a *daogui* (measure) ensures all before one submit. The Weaving Maiden consumed it and ascended to heaven as an immortal.\n\n**Human Might Fungus** grows upon the mountains of Songgao, Shaoshi, and Taishi. It resembles a human figure, crimson in hue, crowned with a cap that shifts between yellow and red, and tastes sweet. Consuming it prevents aging, and partaking of it grants eighty myriad years of immortal life.\n\n**Golden Essence Fungus** grows upon Mount Hua. Its cap is white, its stem wreathed in white clouds, and it resembles a young pheasant. Its flavor is sweet and pungent. Harvested on a *ren* day of the tenth month, dried in the shade for a hundred days, and consumed, it grants eight thousand years of life.\n\nHan Zhong consumed it and ascended as an immortal.\n\n**Yellow Fungus** grows upon Mount Huangtu, its yellow cap layered thrice, its flavor sweet. Consuming it grants life equal to heaven and earth. Its stem is white.\n\n**Golden-Born Fungus** grows upon the southern slopes of renowned mountains, its cap white, its lining red, its stem crimson. Harvested in spring or summer, dried in the shade for a hundred days, and consumed in a *ge* (measure), it cures yin ailments and extends lifespan.\n\n**Tortoise Might Fungus** grows within the deep abysses of Mount Chang, its hue blue-black, its cap marked with tortoise patterns, wrapped in blue-white, its stem black, its flavor sour and bitter. Harvested and consumed, it grants ten thousand years of immortal life.\n\n**Dragon Might Fungus** grows upon the northern slopes of Mount Tai, its stem blue, its cap purple, its lining white, its patterns resembling dragons and serpents, its flavor sweet and sour. Harvested in spring and consumed, it grants one hundred sixty thousand years of immortal life.\n\n**Bird Might Fungus** grows upon the northern slopes of the southern mountains of Mount Heng, its cap crimson, its stem black, its flavor sour. Consuming it lightens the body and grants ten thousand years of immortal life without aging.\n\n**Fire Essence Fungus** grows upon the northern slopes of Mount Huo, its cap crimson, its lining yellow, its stem yellow. Above it drift red clouds resembling a pheasant. Harvested on a *bingwu* day of the fifth month and consumed, it grants nine thousand years of immortal life.\n\n**Fire Tin Fungus** grows beside great trees on the southern slopes of renowned mountains, its hue fiery red, its stem blue, its cap crimson, flames rising from its five branches like fire, its flavor sweet and bitter. Harvested in summer and consumed, it extends lifespan and grants immortal life.\n\n**Master Red Pine’s Fungus** grows amid thousand-year-old pines upon Mount Yuan, resembling a wooden figure. Harvested, dried in the shade for a hundred days, and consumed, it grants life equal to heaven and earth as an immortal.\n\n**Wood Essence Fungus** grows within renowned mountains, its woody base resembling a spinning wheel in winter. Gathered at any time, its color is white, its flavor sweet and bitter. Consuming it lightens the body and grants immortal life. Its capless form resembles a fork, its stem crimson.\n\n**Wood Spirit Fungus** grows upon Mount Tai of Qi, known as the Eastern Peak, its cap blue, its lining red, its stem crimson, above it drift blue clouds resembling a chicken. Harvested on a *ren* day and consumed, it grants ten million years of immortal life.\n\n**Heaven’s Eye Fungus** grows upon the southern slopes of renowned mountains, its color blue, its stem bifurcated midway, its upper branches curved like an inverted cap, red, covering a larger cap. Harvested with a bamboo knife, dried in the shade for a hundred days, and consumed, it grants fifty thousand years of immortal life, veiled by black clouds.\n\n**Heaven’s Heart Fungus** grows upon the southern slopes of renowned mountains, nestled between stones, its cap blue, its stem red, its flavor sour. Harvested with a bamboo knife, dried in the shade for a hundred days, and consumed in the measure of a fingernail, it grants three thousand years of immortal life. Above it drift red clouds, below it a white ram stands guard.\n\n**White Bloom Fungus** grows upon the southern slopes of Mount Tai, its hue blue, its five stems branching in pairs. Sweet and delightful, consuming it grants ten thousand years of immortal life.\n\n**Water Spirit Fungus** grows upon Mount Heng, its cap black, its stem blue, above it drift black clouds resembling a horse. Harvested and consumed, it grants six thousand years of immortal life.\n\n**Earth Fungus** grows within great marshes on the southern slopes of renowned mountains, its white cap resembling porcelain, its flavor pungent and bitter. Consuming it ensures neither cold nor heat; harvested in summer and consumed, it grants immortal life.\n\n**Jade Gazing Fungus** grows within the northern ridges of renowned mountains, its cap yellow, its stem red, its flavor sweet. Consuming it grants two thousand years of immortal life. Below, three stems grow together, their caps blue, their stems red. Above, two stems rise, their caps yellow, their stems red.\n\n**Wood Vein Fungus** grows within renowned mountains, its upper part blue, its lining yellow, its flavor sweet and sour. Harvested in spring and consumed, it grants seven hundred years of immortal life without aging.\n\n**Bronze Fungus** grows within deep valleys and springs on the northern slopes of renowned mountains, inverted like a steamer, its color blue-yellow-red, its flavor pungent and bitter. Consuming a *ge* (measure) grants eternal life as an immortal.\n\n**Heaven’s Crimson Fungus** grows within hills and valleys, its cap black, its lining red, its stem red, its flavor sweet with a hint of pungency. Consuming it ensures neither cold nor heat, granting six thousand years of immortal life.\n\n**Poria Fungus** grows beneath dodder on the winter solstice, resembling an ox’s hoof, its color black, its flavor sweet. Consuming it allows one to see objects a thousand *li* away and grants ten thousand years of immortal life.\n\n**Northern Fungus** grows upon earthen mountains, resembling a snake, its color crimson, its lining white, its flavor sweet and sour. Consuming it grants twenty thousand years of immortal life without aging.\n\n**Wood Mushroom Fungus** grows upon trees within northern valleys of renowned mountains, sprouting from three knots in the wood, its color blue, its flavor sweet and pungent. Consuming it grants ten thousand years of immortal life.\n\n**Wind Essence Fungus** grows within renowned mountains, its cap blue, its three stems growing together, its flavor sweet. Harvested with a bronze knife and consumed, it grants ten thousand years of immortal life.\n\n**Spirit Essence Fungus** grows upon the northern slopes of renowned mountains, its cap crimson, its two layers of stem purple. Consuming it grants twenty thousand years of immortal life, guarded above by dark ochre clouds.\n\n**Bird Vein Fungus** bears a white cap, a black stem, its lining marked with patterns six *chi* long and four *cun* thick, its flavor sweet. Consuming it grants forty thousand years of immortal life.\n\n**Jade Mushroom Fungus** grows upon the southern slopes of renowned mountains. Harvested in mid and late summer, dried in the shade for a hundred days, and consumed, it grants one hundred thousand years of immortal life.\n\n**Dusk Essence Fungus**, resembling the **Night Essence Fungus**, its face red, its lower part yellow-white, its stem vermilion, its cap crimson, growing inverted. **Day Essence Fungus** grows in autumn upon the southern slopes of renowned mountains, its color crimson, its two stems growing together. Harvested with a wooden knife, dried in the shade for a hundred days, and consumed in a *ge* (measure), it grants thirty thousand years of life. Its stem and cap are both crimson.\n\n**Night Essence Fungus** grows upon the northern slopes of renowned mountains, its hue blue-green, its stem blue, its flavor sour, its cap inverted outward, bearing dew. Drinking it grants thirty thousand years of life.\n\n**White Jade Fungus** grows within the valleys of Mount Tai, its leaves blue, its lower part red, each side layered thrice with crimson stems.\n\nHarvested and consumed, it grants eighty thousand years of life. **Dawn Essence Fungus** grows in summer. White in color, capless, square like stone, its flavor bitter. Harvested with a bronze knife, dried in the shade for a hundred days, and consumed, it grants ten thousand years of immortality. Two persons guard it above.\n\n**Spring Essence Fungus** is blue-green and red, its cap inverted, bearing horns, with two seeds hanging downward, its flavor bitter. Harvested with a bronze knife, regardless of quantity, and consumed, it grants thirty thousand years of life. Five-colored clouds cover it.\n\n**Earth Fungus** displays five hues—now yellow, now blue-green, now red, now white, now black—with three branches bearing seeds. Consumed, it extends life and grants immortality.\n\n**Wood Fungus Yellow Essence** grows within great stones. Its leaves span two *cun* in width and one *chi* in length, blue-green in color, three leaves growing together, its base square like stone. It grows in winter and summer, its flavor sweet and pleasant. Consumed, it grants ageless immortality.\n\n**Summer Essence Fungus** grows within renowned mountains. Its cap is red, bearing two seed-like pearls within, its flavor sweet. Harvested with a bamboo knife, dried in the shade for a hundred days, and consumed, it grants forty thousand years of immortality.\n\n**Autumn Essence Fungus** grows within sunken hollows, surrounded by many fragrant herbs. Its cap is yellow, its interior red, three crooked branches growing together, their heads drooping, their stems blue-green. Consumed, it grants ten thousand years of life.\n\n**White Cloud Fungus** displays five colors, round like a drum, bearing six red seeds above. Its stem is also red, its flavor sour. Consumed, it grants ten thousand years of immortality.\n\n**Left Spirit Fungus** has a black cap facing upward toward the sky, a white stem, and is guarded by a woman. Drinking the dew within grants two thousand years of life. It grows within renowned mountains.\n\n**Right Spirit Fungus** grows within renowned mountains. Its cap is blue-green, its stem white, with three branches. Harvested with a bone knife, dried in the shade for a hundred days, and consumed in the amount of a melon seed, it grants ten thousand years of life. A white deer guards it below.\n\n**Wood Fortune Fungus** is blue-green, bearing branch-like veins, growing within renowned mountains, its flavor sweet. Consumed, it grants ten thousand years of life. It has five stems and a blue-green cap.\n\n**Stone Fungus** grows within renowned mountains. It emits light at night. Harvested at noon on a summer day, the red central portion is consumed, granting ten thousand years of immortality. Its stem is white, its head resembling a lotus.\n\n**Red Jade Fungus** grows within renowned mountains. Its cap is white, its interior veined, its stem blue-green, its flavor pungent. Consumed, it prevents aging, and two hundred spirits follow the immortal.\n\n**Iron Essence Fungus** grows in autumn. Its cap is purple, its interior yellow, with five branches, its flavor sweet. Harvested with a bronze knife and consumed in the amount of a wood ear, it grants three thousand years of immortality. Five-colored clouds cover it above.\n\n**Branch Essence Fungus** grows upon the northern slopes of renowned mountains. Its cap is white, its stem white. Harvested with a wooden knife, dried in the shade for a hundred days, and consumed in the amount of a bean, it grants ten thousand years of immortality. Only the yellow central portion is edible.\n\n**Earth Fungus** grows within renowned mountains. Its cap is blue-green, its stem white. Consumed, it grants ten thousand years of immortality.\n\n**Stone Essence** grows within renowned mountains. Its cap is white, its stem white. Consumed, it grants sixty thousand years of immortality. A *fangcun* (square *cun*) is taken thrice daily.\n\n**Stone Essence Fungus** grows in autumn. Its cap is red, its interior white, its stem red, its flavor sour. Consumed, it grants ten thousand years of immortality. A red bird guards it above.\n\n**River-Sealed Fungus** grows in autumn. Yellow in color, three branches growing together. Drinking the dew upon it grants nine thousand years of immortality. Its cap faces upward.\n\n**Water Fungus** has a blue-green cap, a white interior, and a blue-green stem. Consumed daily in the amount of a *ge*, it cures illness and grants ten thousand years of immortality.\n\n**Beast Fungus** grows beneath pine and cypress trees in renowned mountains. Its cap is white, its stem white. Harvested on the Summer Solstice, one *ge* is taken daily. After three years, one transforms and attains immortality.\n\n**Sea Gate Fungus** grows upon sand and stone in autumn. Four-layered, resembling a cap, blue-green in color, its stem red, two branches growing together. Drinking the dew upon it grants ten thousand years of immortality. Five-colored clouds cover it above.\n\n**Cloud Jade Fungus** grows in late autumn. Its stem is blue-green, its leaves blue-green, and a white bird guards it above. Drinking the dew upon it grants one thousand years of immortality.\n\n**Blue-Green Fungus** has a double-layered blue-green cap, a white interior, a white stem, its flavor sweet and sour. Consumed daily in the amount of a *ge*, it grants one thousand years of immortality.\n\n**Cloud Fungus** has a blue-green cap, a yellow stem, its flavor like honey. Consumed, it grants one thousand years of immortality. Five-colored clouds cover it above.\n\n**Kunlun Fungus** grows in autumn. Its cap is double-layered yellow, its stem yellow, its flavor sweet. Drinking the dew upon it grants three thousand years of immortality.\n\n**Human Essence Fungus** grows within renowned mountains. Its head is blue-green, its cap white, its interior red, three branches growing together, its flavor sweet. Drinking the dew upon it grants ten thousand years of immortality.\n\n**Mountain Glory Fungus** grows in the deep, shady, damp cliffs of renowned peaks. Red in color, resembling a four-tiered pagoda. Consumed, it grants one thousand years of immortality.\n\n**Purple Fungus** resembles a human head, its flavor pungent. Consumed, it sharpens the mind, prevents death, and lightens the body.\n\n**Winter Willow Fungus** grows in autumn upon the southern slopes of Mount Tai. Its cap is yellow, with three yellow stems, its roots distinct yet sharing the same cap, its flavor sweet and pungent. Dried in the shade for a hundred days and consumed, it grants two thousand years of immortality.\n\n**Red Essence Fungus** grows in summer. Its cap is yellow, its stem blue-green, its interior white, with nine double layers. Consumed, it grants five thousand years of immortality. Five-colored grasses grow on either side.\n\n**Purple Stone Fungus** has a bitter flavor, a red cap, a yellow interior, and a red stem. Consumed, it grants deathless immortality.\n\n**Purple Cap Fungus** has three stems sharing a single base, its cap square and purple, two *chi* in size, its flavor sweet. Consumed, it grants three thousand years of immortality.\n\n**Red Essence Fungus** is red and flaming, its flavor sweet. Harvested with an iron knife, dried in the shade for a hundred days, and consumed, it grants two thousand years of immortality. Two persons guard it, resembling torches of fire. Its stem and flames are both red.\n\n**Mountain-Welcoming Connected Fungus**—consumed, it enables one to walk a thousand *li* in a day and grants eight thousand years of immortality. It has three stems sharing a single root, the central stem bearing a cap, all purple in color, while the two lower stems lack caps.\n\n**Purple Mountain Fungus** is deep purple-red, with four layers and a red cap. Consumed, it grants three thousand years of immortality.\n\n**Purple Fungus** has a white cap, a yellow interior, and resembles the moon, with a white stem. Consumed, it bestows luminous immortality.\n\n**Wood Fungus**—consumed, it grants a thousand years of immortality.\n**Water Fungus**—consumed, it grants a thousand years of immortality. It resembles the character *wang* in shape.\n\n**Double-Purple Fungus** has a yellow cap, a red stem, and two stems growing conjoined. Consumed, it grants immortality.\n\n**Six-Pillar Purple Fungus** has a red cap, a red stem, and a yellow sheath. Consumed, it confers immortality. Its top bears a cap, while the lower three layers lack one.\n\n**Purple-Stalk Fungus** is red, with a white interior, resembling a snake, and has a bitter flavor. It dispels cold-heat pathogenic qi; consuming one *ge* daily grants immortality. Harvested in autumn.\n\n**Purple Fungus** has a sweet flavor, a white cap, three stems, and a stem that is yellow above and red below. Consumed, it grants immortality, filling the bones and body with solidity and transforming the intestines into sinew. Its top bears a cap, while the lower layer lacks one.\n\n**Double-Purple Fungus** resembles the above in form, with a sweet-bitter flavor. Consumed, it grants immortality. Its white cap rises upward, with a yellow stem, a red root, three stems, a cap on top, and two lower stems lacking caps.\n\n**Purple Fungus** has a red cap, a white interior, a red stem, and a sweet flavor. Consumed, it extends lifespan and grants immortality.\n\n**Stalk Fungus** has a red exterior, a white sheath, and a sweet flavor. Consumed in winter, it prevents aging and grants immortality, resembling a snake’s tail.\n\n**Purple Fungus** has a red cap, a white interior, a black stem, and a sweet flavor. Harvested and consumed in autumn, it grants immortality.\n\n**Fire Fungus** has a red cap, a white interior, a black stem, and a bitter flavor. Harvested and consumed in winter or summer, it grants immortality. Five-colored clouds cover it above, with two stems growing in crossed formation.\n\n**Stalk Fungus** has three layers, is red, with a white cap, and a sweet-spicy flavor. Consumed, it extends lifespan and grants immortality.\n\n**Water Fungus** has a red cap, a white interior, and a white stem. Three stems emerge upward to form a cap. Consumed, it extends lifespan and grants immortality.\n\n**Palace Fungus**—consumed, it extends lifespan and prevents aging, granting immortality.\n\nIn total, there are eleven sections.\n\n**Vermilion-Capped Fungus** has a red cap and a red stem.\n**Gate Fungus**—harvested in summer or autumn, consuming a *cun*-square piece daily grants a lifespan equal to heaven and earth. It has a purple cap and a purple stem, in seven segments, with the central stem longer and two caps resembling pearl wheels.\n\n**Upper Fortune Fungus**—consumed, it grants immortality, allowing one to travel through the void. It has a green cap and a vermilion stem, in eleven segments: six above, two in the middle, and three below.\n\n**Jade Essence Fungus** grows in the great sea, with a sweet flavor. Consumed, it grants two thousand years of immortality. It has a vermilion cap and a jade stem, both vermilion in color.\n\n**Marquis-Substituting Fungus** is round above and square below. Harvested in spring (or the fifth month), consuming it grants a lifespan of ten thousand years. It resembles a vermilion barrel.\n\n**Cloud Fungus**—consumed for six years, red clouds guard it above. It has a vermilion cap, vermilion stem, and vermilion leaves, with six leaves.\n\n**Deathless Fungus**—consumed, it grants ten thousand years of immortality. Red clouds hover above it, with a purple cap, purple stem, and four stems lacking caps.\n\n**Vermilion Fungus**—consumed, it grants a thousand years of immortality. It has a vermilion cap and a vermilion stem.\n\n**Heavenly Might Fungus** is green, harvested and consumed in all seasons, granting ten thousand years of lifespan. Red clouds cover it above, with a green cap and a green stem.\n\n**Evil-Repelling Fungus** grows in the sea, is green, and consumed, grants a thousand years of immortality. Its form resembles a human.\n\n**Heavenly Cold Fungus** is yellow and human-shaped. Consumed, it grants a thousand years of immortality.\n\n**Red Blossom Fungus** has a spicy flavor. Harvested and consumed in all seasons, it grants a lifespan of three thousand years. Two stems cross, one lacking a cap, one with a vermilion tip resembling an unopened flower.\n\n**Heavenly Fungus**—harvested in all seasons, dried in the shade for a hundred days, and consumed in a *cun*-square piece, it grants immortality. It has a vermilion cap and a purple stem.\n\n**Heavenly Land Fungus**—harvested with a bronze knife and consumed, it grants three thousand years of immortality. Two stems grow conjoined, vermilion in color, resembling an unopened lotus bud.\n\n**Heavenly Gate Fungus**—consumed, it grants ten thousand years of immortality. Two stems grow conjoined, with a vermilion cap and a white sheath.\n\n**Earth Essence Fungus** is guarded by two rams. Consuming the dew upon it grants six thousand years of immortality. Three stems grow conjoined, with a vermilion cap and a green stem.\n\n**Sun Essence Fungus** has a sweet flavor. Harvested with a bamboo knife, dried in the shade for a hundred days, and consumed in a *cun*-square piece, it grants five thousand years of immortality. It is vermilion, with three stems lacking caps, all sharing a single stem.\n\n**Moon Essence Fungus**—harvested in all seasons with a bamboo knife, consumed like a bean, it grants five thousand years of immortality. One person guards it, with a yellow cap and a yellow stem.\n\n**Four Seasons Essence Fungus**—consuming its dew grants twenty thousand years of lifespan. Two green dragons guard it, it is red, and five-colored clouds cover it above. It has two layers, a vermilion cap, and a vermilion stem.\n\n**Black Essence Fungus** has a sweet-sour flavor. Harvested with a bone knife and consumed, it grants two thousand years of immortality. Dried in the shade for a hundred days, two rams guard it below. It has a purple cap, a purple stem, and two leaves.\n\n**Wood Essence Fungus** has a sweet flavor. Consumed, it grants two thousand years of immortality. Dried in the shade for a hundred days, three horses stand above it. Harvested with a bone knife, its cap is purple and curls upward.\n\n**Water Essence Fungus** has a bitter flavor. Harvested in summer and consumed in pieces the size of a fingernail, it grants five thousand years of immortality. It has a green cap, with four stems piercing through the cap; if capless, the stem is white.\n\n**Gold Essence Fungus** has a sweet flavor. Harvested with a wooden knife and consumed, it grants a thousand years of immortality. Dried in the shade for a hundred days, when eaten, it divides into five segments resembling rising flames. It is vermilion, with a single vermilion cap and vermilion stem. When the cap first emerges, the stem is green.\n\n**Water Fungus** grows beside many waters and has a bitter flavor. Harvested in summer and consumed in pieces the size of a fingernail, it grants a hundred thousand years of immortality. Its cap is purple, with three points at the top; the stem is green, extending through without a cap.\n\n**Rain Essence Fungus** grows in summer. It has a sweet flavor, and consuming any amount grants six thousand years of immortality. Its cap is green, with a purple stem, and four sprouts grow from it.\n\n**Water Essence Fungus** grows beside mountain waters. It is greenish-black, with four branches growing together; the cap faces upward and has a slightly bitter flavor. Drinking its dew grants a hundred thousand years of immortality.\n\n**Cloud Essence Fungus** grows on Mount Hua and has a sour flavor. Harvested with a bamboo knife, consuming any amount grants nine thousand years of immortality. Its cap is purple, and its stem is white.\n\n**Tiger Essence Fungus** grows on the northern slopes of Mount Hua. It is yellow, resembling tiger skin, and has a sweet flavor. Consuming it prevents aging and grants keen intelligence and immortality. Its stem is vermilion.\n\n**The Supreme Numinous Treasure’s Catalog of Fungal Varieties is complete.**",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上灵宝芝草品 经名：太上灵宝芝草品。 撰人不详，约出於南北朝或隋唐。 灵宝经目着录未出。 一卷。 底本出处：《正统道藏》正一部。 太上灵宝芝草品 窃以延命之术，本因饵药长生。 鸿宝宛秘之书论云：仙人使鬼。 是以广成子居崆峒山上，示道治而授轩辕。 赤松子升昆仑宫，服水玉而教炎帝。 仍随风雨上下，究察机祥，游历名山，顾观草木，阐验幽昧。 芝英一作精形品万端，实难辨别，故画图记，着状贴传，请挝寻求，得臻仙路耶。 青玉芝，生於扬州山。 其味甘酸，服之十二万岁。 王子乔食，仙矣。 苍虎守之。 依图取服，有四重，第二重有二枝，盖茎并皆青也。 赤玉芝，一作子食芝。 生於郁州山，状如此，其味苦。 赤松子食之，得仙。 赤虎、赤鱼守之。 依图取服，茎盖赤，有二重，下重有二小芝，上重二小芝，并有盖。 黄玉芝，生於蓬莱山，其色黄，辛。 东王父食之，寿九万岁，仙矣。 黄虎、黄鱼守之。 三重，下重有三枝，一有生九盖。 盖茎并黄也。 白玉芝，生於方丈山中，其味辛白，盖四重，下一重上，有二枚生，并有三枚生上重，或生大石之上、黄沙之中、腐木之根、高树之下、名山之阴。 得而食之，仙矣。 白虎守之。 黑玉芝，生於龟山之中，其味甘酸。 鲜于子食之，得仙矣。 傍有黑虎守之，其状如此。 上有二小枝重生，其色黑，有四重，茎盖并赤。 五帝玉芝，生於嵩高名山中，有五色及五变五行，四时有味，以四时取服之，为万年仙矣。 有三重，下二重二枝相对。 青帝玉芝，生於名山之中大树之下，黄云覆之，青盖、赤里，其茎白，其味酸。 春甲乙日取食之，令人不老仙矣。 赤帝玉芝，生於名山之阳，赤盖、黄裹、白茎。 上有赤云，其味甘苦。 夏采食之，令人得四千年仙矣。 黄帝玉芝，生於名山之上，上有五色云。 黄盖、白茎其味甘苦，食之令人不惊恐，长生三万年，得仙矣。 白帝玉芝，生於名山之阳重石之间，白盖、青茎、里黑，其味甘。 食之令人得三千年仙矣。 黑帝玉芝，生於名山之阴大谷之中，黑云覆之。 黑盖、青里、黄茎，其味甘酸。 冬间采食之，今人不老，得仙矣。 东方芝，生於名山之阳大谷中，青赤里，二重白盖，青茎，其味酸。 食之延年，十万岁仙矣。 南方芝，生於名山之阳，赤色、赤盖，赤茎，有三枝，其味苦。 用竹刀采之，阴乾百日，食之如钱，得三万岁仙矣。 中央芝，生於名山之阴，白盖，黄茎，里黑，枝如一茎盖，二枝要半，上屈头，垂如悬盖。 傍有黄羊捍守之。 用木刀采食之，仙矣。 西方芝，生於名山之阴，白盖、黑里、青茎，有三枝俱生，其味甘辛，食之万年仙矣。 北方芝，生於名山之阴，黑盖，茎三枝并生。 其味甘美，食之仙矣。 入水不溺，不老，得八万年。 有黑牛守之。 石臼芝，生於少室山上，有赤云，两边黄虎守之。 盖赤、黑茎，与石玉芝相对生。 取之当斋戒沐浴三十日，雄鸡过转鸣，自称天斋将军，使者彩衣，冠带玄服。 往取食之一合，六十万岁。 一作十六。",
      "translated_text": "**The Supreme Numinous Treasure: Catalog of Sacred Fungi**\n\n*Scripture Title:* The Supreme Numinous Treasure: Catalog of Sacred Fungi. Author unknown, likely composed during the Northern and Southern Dynasties or the Sui-Tang period. Not recorded in the *Lingbao Scripture Catalog*. One scroll. Source text: *Zhengtong Daoist Canon*, Orthodox Section, Part One.\n\n**The Supreme Numinous Treasure: Catalog of Sacred Fungi**\n\nThe art of prolonging life fundamentally relies upon consuming elixirs to attain longevity. As the *Book of Hidden Marvels* states: \"The immortals command spirits.\" Thus, Guangchengzi dwelled upon Mount Kongtong, revealing the Dao and its governance to the Yellow Emperor. Chisongzi ascended the Kunlun Palace, ingesting *shuiyu* (water jade) to instruct the Flame Emperor. They roamed with wind and rain, ascending and descending to investigate subtle omens, traversing famous mountains, and observing flora—unveiling the mysteries of the obscure.\n\nThe forms of sacred fungi (*zhi*) are manifold, their myriad manifestations difficult to distinguish. Thus, illustrations were drawn, their appearances recorded, and their descriptions transmitted, that seekers might follow them to attain the path of immortality.\n\n**Azure Jade Fungus** grows upon the mountains of Yangzhou. Its flavor is sweet and sour; consuming it grants twelve myriad years of life. Wang Ziqiao ate it and ascended as an immortal. A green tiger guards it. According to the illustration, it has four layers, with two branches on the second layer—its stem and cap are entirely azure.\n\n**Cinnabar Jade Fungus** (also called *Zishi Fungus*) grows upon the mountains of Yuzhou. Its form is as depicted, and its flavor is bitter. Chisongzi consumed it and attained immortality. A red tiger and red fish guard it. According to the illustration, its stem and cap are crimson, with two layers. The lower layer bears two small fungi, and the upper layer has two small fungi, each with a cap.\n\n**Yellow Jade Fungus** grows upon Mount Penglai. Its color is yellow, and its flavor is pungent. The Eastern King Father consumed it, attaining ninety thousand years of life and immortality. A yellow tiger and yellow fish guard it. It has three layers; the lower layer bears three branches, one of which produces nine caps. Its stem and cap are entirely yellow.\n\n**White Jade Fungus** grows within Mount Fangzhang. Its flavor is pungent and white. It has four layers; on the lowest layer, two grow upward, and three grow upon the upper layer. It may also sprout upon great stones, in yellow sands, at the roots of rotting wood, beneath tall trees, or on the shady sides of famous mountains. Consuming it grants immortality. A white tiger guards it.\n\n**Black Jade Fungus** grows within Mount Gui. Its flavor is sweet and sour. Xianyuzi consumed it and attained immortality. A black tiger guards it nearby, its form as depicted. It has two small branches growing in layers, its color black, with four layers—its stem and cap are both crimson.\n\n**Five Thearchs’ Jade Fungus** grows within the renowned mountains of Songgao. It possesses five colors and five transformations corresponding to the Five Phases. Its flavor changes with the four seasons. Consuming it in accordance with the seasons grants ten thousand years of immortality. It has three layers; the lower two layers bear two opposing branches.\n\n**Azure Thearch’s Jade Fungus** grows beneath great trees in famous mountains, veiled by yellow clouds. Its cap is azure, its lining crimson, its stem white, and its flavor sour. Harvested on *jiayi* days in spring and consumed, it grants ageless immortality.\n\n**Cinnabar Thearch’s Jade Fungus** grows on the sunny sides of famous mountains. Its cap is crimson, its lining yellow, and its stem white. Red clouds hover above it, and its flavor is sweet and bitter. Harvested in summer and consumed, it grants four thousand years of immortality.\n\n**Yellow Thearch’s Jade Fungus** grows atop famous mountains, above which five-colored clouds appear. Its cap is yellow, its stem white, and its flavor sweet and bitter. Consuming it banishes fear and grants thirty thousand years of life, attaining immortality.\n\n**White Thearch’s Jade Fungus** grows between layered stones on the sunny sides of famous mountains. Its cap is white, its stem azure, and its lining black, with a sweet flavor. Consuming it grants three thousand years of immortality.\n\n**Black Thearch’s Jade Fungus** grows within great valleys on the shady sides of famous mountains, veiled by black clouds. Its cap is black, its lining azure, and its stem yellow, with a sweet and sour flavor. Harvested in winter and consumed, it prevents aging and grants immortality.\n\n**Eastern Fungus** grows within great valleys on the sunny sides of famous mountains. Its lining is azure and crimson, with two layers and a white cap. Its stem is azure, and its flavor is sour. Consuming it extends life to ten myriad years of immortality.\n\n**Southern Fungus** grows on the sunny sides of famous mountains. It is crimson, with a crimson cap and stem, bearing three branches. Its flavor is bitter. Harvested with a bamboo knife, dried in the shade for a hundred days, and consumed in coin-sized portions, it grants thirty thousand years of immortality.\n\n**Central Fungus** grows on the shady sides of famous mountains. Its cap is white, its stem yellow, and its lining black. Its branches resemble a single stem with a cap, two branches at the midpoint, their tips curling downward like suspended canopies. A yellow ram guards it. Harvested with a wooden knife and consumed, it grants immortality.\n\n**Western Fungus** grows on the shady sides of famous mountains. Its cap is white, its lining black, and its stem azure, with three branches growing together. Its flavor is sweet and pungent. Consuming it grants ten thousand years of immortality.\n\n**Northern Fungus** grows on the shady sides of famous mountains. Its cap is black, with three branches growing together from the stem. Its flavor is sweet and pleasant. Consuming it grants immortality—one who eats it will not drown in water, will not age, and will attain eighty myriad years of life. A black ox guards it.\n\n**Stone Mortar Fungus** grows upon Mount Shaoshi, beneath red clouds, with yellow tigers guarding it on both sides. Its cap is crimson, its stem black, and it grows opposite the *Stone Jade Fungus*. To harvest it, one must fast and bathe for thirty days. When a rooster crows at dawn, the gatherer declares themselves *Tianzhai Jiangjun* (Heavenly Fasting General), dons colorful robes, and wears a dark crown and sash. Consuming a single *ge* (measure) grants sixty myriad years of life. (Alternatively, sixteen myriad years.)",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1185,
      "start_sentence": 0,
      "end_sentence": 65,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.846509218215942,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上灵宝芝草品.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "生大石之间，其味甘酸，下根四方，高三尺。 木神芝，生於嵩高山之阴，黄盖，黑里，上有赤云及朱雀守之。 以六月戊己辰日，采而食之，得九千岁，令人仙矣。 状如四方石，有一坦者。 鬼菌芝，生於名山之阴，白盖，状如甑，二鬼守之，见人即灭。 以夜采之，阴乾百日，食如刀圭，所向尽服。 织女服之，仙升天矣。 人威芝，生於嵩高少室太室之山。 状如人，赤色、戴盖，乍黄乍赤，味甘。 食之，令人不老，服之十万年仙矣。 金精芝，生於华山，白盖，茎上有白云，状如雀鸡。 其味甘辛。 十月壬日采之，阴乾百日，食之八千岁。",
      "translated_text": "**Growing between great stones**, its flavor is sweet and tart, its lower roots square, and it stands three *chi* tall.\n\n**Wood Spirit Fungus** grows upon the northern slopes of Mount Songgao. Its cap is yellow with a black underside, and above it hover red clouds with vermilion sparrows guarding it. Harvested on a *wu* or *ji* day of the sixth month and consumed, it grants nine thousand years of life, rendering one immortal. Its form resembles a square stone with a single flat surface.\n\n**Ghost Mushroom Fungus** grows upon the northern slopes of renowned mountains. Its cap is white, shaped like a steamer, and two ghosts guard it—vanishing at the sight of humans. Gathered at night and dried in the shade for a hundred days, consuming a *daogui* (measure) ensures all before one submit. The Weaving Maiden consumed it and ascended to heaven as an immortal.\n\n**Human Might Fungus** grows upon the mountains of Songgao, Shaoshi, and Taishi. It resembles a human figure, crimson in hue, crowned with a cap that shifts between yellow and red, and tastes sweet. Consuming it prevents aging, and partaking of it grants eighty myriad years of immortal life.\n\n**Golden Essence Fungus** grows upon Mount Hua. Its cap is white, its stem wreathed in white clouds, and it resembles a young pheasant. Its flavor is sweet and pungent. Harvested on a *ren* day of the tenth month, dried in the shade for a hundred days, and consumed, it grants eight thousand years of life.",
      "overlap_context": "ws upon Mount Shaoshi, beneath red clouds, with yellow tigers guarding it on both sides. Its cap is crimson, its stem black, and it grows opposite the *Stone Jade Fungus*. To harvest it, one must fast and bathe for thirty days. When a rooster crows at dawn, the gatherer declares themselves *Tianzhai Jiangjun* (Heavenly Fasting General), dons colorful robes, and wears a dark crown and sash. Consuming a single *ge* (measure) grants sixty myriad years of life. (Alternatively, sixteen myriad years.)",
      "start_char": 1185,
      "end_char": 1432,
      "start_sentence": 66,
      "end_sentence": 78,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.863971710205078,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上灵宝芝草品.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "韩众食之仙矣。 黄芝，生於黄土山，黄盖三重，其味甘。 食之与天地等。 一茎色白。 生金芝，生於名山之阳，白盖、赤里、赤茎。 春夏采之，阴乾百日，食之一合，阴病除，增年也。 龟威芝，生於常山深渊之中，其色青黑，龟文盖，青白裹，茎黑，味酸苦。 采而食之，为万岁仙矣。 龙威芝，生於太山之阴，青茎、紫盖、白里，其文似龙蛇，其味甘酸。 春采食之，令人十六万年仙矣。 鸟威芝，生於南岳丘山之阴，赤盖、黑茎，其味酸。 食之令人身轻，不老万岁仙矣。 火精芝，生於霍山之阴，赤盖、黄里、黄茎。 上有赤云，似鸟鸡之形，其味甘。 五月丙午日采之，九千年仙矣。 火锡芝，生於名山之阳大树之傍，色赤如火，青茎、赤盖，炎起五枝似火，其味甘苦。 夏采而食之，延年得仙矣。 赤松子芝，生於垸山，有千岁松树者，生於其间，状似木人形。 采之，阴乾百日，食之，与天地等仙矣。 木精芝，生於名山之中，冬即木本如纺车，捃拾采拣无时。 其色白，其味甘苦。 食之令人身轻仙矣。 无盖似叉，茎赤。 木神芝，生於齐泰山，山名曰东岳，青盖、赤裹、赤茎，上有青云如鸡之状。 以壬日采而贪之，千万岁仙矣。 天目芝，生於名山之阳，其色青，茎半有二枝，上如曲盖，赤，覆大盖上。 竹刀采之，阴乾百日，食之，五万年仙矣，有黑云覆之。 天心芝，生於名山之阳夹石之上，青盖、赤茎，其味酸。 以竹刀采之，阴乾百日，食如一爪甲，成三千年仙矣。 上有赤云，下有白羊守之。 白英芝，生於太山之阳，青色、青，五茎枝相对。 甘美，食之，万岁仙矣。 水神芝，生於恒山，黑盖，青茎，上有黑云如马形。 采食之，六千岁仙矣。 土芝，生於名山之阳大泽之中，白盖，如瓷，味辛苦。 食之不寒不热，夏采服之，仙矣。 望玉芝，生於名山之阴冈阙中，黄盖，赤茎，味甘。 食之令人二千年仙矣。 下有三茎并生，盖青，茎赤。 上有二茎，黄盖，赤茎。 木文芝，生於名山之中，上青，下里黄，味甘酸。 春采食之，七百年不老仙矣。 铜芝，生於名山之阴源泉深谷之中，反如甑，色青黄赤，味辛苦。 食一合，长生仙矣。 天绛芝，生於陵谷，黑盖，赤裹，赤茎，味甘小辛。 食之令人不寒不热，六千年仙矣。 茯苓芝，以冬至日生兔丝下，状似牛蹄，黑色，味甘。 食之令人千里外见物，寿万年仙矣。 北方芝，生於土山。 状如蛇，赤色、白里，味甘酸。 食之令人不老二万年仙矣。 木菌芝，生於名山之阴谷中树木上，生木三节，色青，味甘辛。 食之万年仙矣。 风精芝，生於名山之中。 青盖，茎三枝并生，味甘。 铜刀采食之，万年仙矣。 灵精芝，生於名山之阴。 赤盖，二重紫茎。 食之二万年仙矣。 上有苍赭云守之。 鸟文芝，白盖，黑茎，里有文长六尺，厚四寸。 味甘。 食之四万岁矣。 玉菌芝，生於名山之阳。 仲夏、季夏采之，阴乾百日，食之十万年仙矣。 仿夜精芝样，面赤，下黄白，朱茎，赤盖，反上生。 昼精芝，秋生於名山之阳。 赤色，二枝并生。 以木刀采之，阴乾百日，食之一合，令人三万岁。 茎盖并赤。 夜精芝，生於名山之阴。 青益、青茎、味酸，盖反仰向外，有露，饮之令人三万岁。 白玉芝，生於太山谷中，叶青，下赤，每边三重赤茎。",
      "translated_text": "Han Zhong consumed it and ascended as an immortal.\n\n**Yellow Fungus** grows upon Mount Huangtu, its yellow cap layered thrice, its flavor sweet. Consuming it grants life equal to heaven and earth. Its stem is white.\n\n**Golden-Born Fungus** grows upon the southern slopes of renowned mountains, its cap white, its lining red, its stem crimson. Harvested in spring or summer, dried in the shade for a hundred days, and consumed in a *ge* (measure), it cures yin ailments and extends lifespan.\n\n**Tortoise Might Fungus** grows within the deep abysses of Mount Chang, its hue blue-black, its cap marked with tortoise patterns, wrapped in blue-white, its stem black, its flavor sour and bitter. Harvested and consumed, it grants ten thousand years of immortal life.\n\n**Dragon Might Fungus** grows upon the northern slopes of Mount Tai, its stem blue, its cap purple, its lining white, its patterns resembling dragons and serpents, its flavor sweet and sour. Harvested in spring and consumed, it grants one hundred sixty thousand years of immortal life.\n\n**Bird Might Fungus** grows upon the northern slopes of the southern mountains of Mount Heng, its cap crimson, its stem black, its flavor sour. Consuming it lightens the body and grants ten thousand years of immortal life without aging.\n\n**Fire Essence Fungus** grows upon the northern slopes of Mount Huo, its cap crimson, its lining yellow, its stem yellow. Above it drift red clouds resembling a pheasant. Harvested on a *bingwu* day of the fifth month and consumed, it grants nine thousand years of immortal life.\n\n**Fire Tin Fungus** grows beside great trees on the southern slopes of renowned mountains, its hue fiery red, its stem blue, its cap crimson, flames rising from its five branches like fire, its flavor sweet and bitter. Harvested in summer and consumed, it extends lifespan and grants immortal life.\n\n**Master Red Pine’s Fungus** grows amid thousand-year-old pines upon Mount Yuan, resembling a wooden figure. Harvested, dried in the shade for a hundred days, and consumed, it grants life equal to heaven and earth as an immortal.\n\n**Wood Essence Fungus** grows within renowned mountains, its woody base resembling a spinning wheel in winter. Gathered at any time, its color is white, its flavor sweet and bitter. Consuming it lightens the body and grants immortal life. Its capless form resembles a fork, its stem crimson.\n\n**Wood Spirit Fungus** grows upon Mount Tai of Qi, known as the Eastern Peak, its cap blue, its lining red, its stem crimson, above it drift blue clouds resembling a chicken. Harvested on a *ren* day and consumed, it grants ten million years of immortal life.\n\n**Heaven’s Eye Fungus** grows upon the southern slopes of renowned mountains, its color blue, its stem bifurcated midway, its upper branches curved like an inverted cap, red, covering a larger cap. Harvested with a bamboo knife, dried in the shade for a hundred days, and consumed, it grants fifty thousand years of immortal life, veiled by black clouds.\n\n**Heaven’s Heart Fungus** grows upon the southern slopes of renowned mountains, nestled between stones, its cap blue, its stem red, its flavor sour. Harvested with a bamboo knife, dried in the shade for a hundred days, and consumed in the measure of a fingernail, it grants three thousand years of immortal life. Above it drift red clouds, below it a white ram stands guard.\n\n**White Bloom Fungus** grows upon the southern slopes of Mount Tai, its hue blue, its five stems branching in pairs. Sweet and delightful, consuming it grants ten thousand years of immortal life.\n\n**Water Spirit Fungus** grows upon Mount Heng, its cap black, its stem blue, above it drift black clouds resembling a horse. Harvested and consumed, it grants six thousand years of immortal life.\n\n**Earth Fungus** grows within great marshes on the southern slopes of renowned mountains, its white cap resembling porcelain, its flavor pungent and bitter. Consuming it ensures neither cold nor heat; harvested in summer and consumed, it grants immortal life.\n\n**Jade Gazing Fungus** grows within the northern ridges of renowned mountains, its cap yellow, its stem red, its flavor sweet. Consuming it grants two thousand years of immortal life. Below, three stems grow together, their caps blue, their stems red. Above, two stems rise, their caps yellow, their stems red.\n\n**Wood Vein Fungus** grows within renowned mountains, its upper part blue, its lining yellow, its flavor sweet and sour. Harvested in spring and consumed, it grants seven hundred years of immortal life without aging.\n\n**Bronze Fungus** grows within deep valleys and springs on the northern slopes of renowned mountains, inverted like a steamer, its color blue-yellow-red, its flavor pungent and bitter. Consuming a *ge* (measure) grants eternal life as an immortal.\n\n**Heaven’s Crimson Fungus** grows within hills and valleys, its cap black, its lining red, its stem red, its flavor sweet with a hint of pungency. Consuming it ensures neither cold nor heat, granting six thousand years of immortal life.\n\n**Poria Fungus** grows beneath dodder on the winter solstice, resembling an ox’s hoof, its color black, its flavor sweet. Consuming it allows one to see objects a thousand *li* away and grants ten thousand years of immortal life.\n\n**Northern Fungus** grows upon earthen mountains, resembling a snake, its color crimson, its lining white, its flavor sweet and sour. Consuming it grants twenty thousand years of immortal life without aging.\n\n**Wood Mushroom Fungus** grows upon trees within northern valleys of renowned mountains, sprouting from three knots in the wood, its color blue, its flavor sweet and pungent. Consuming it grants ten thousand years of immortal life.\n\n**Wind Essence Fungus** grows within renowned mountains, its cap blue, its three stems growing together, its flavor sweet. Harvested with a bronze knife and consumed, it grants ten thousand years of immortal life.\n\n**Spirit Essence Fungus** grows upon the northern slopes of renowned mountains, its cap crimson, its two layers of stem purple. Consuming it grants twenty thousand years of immortal life, guarded above by dark ochre clouds.\n\n**Bird Vein Fungus** bears a white cap, a black stem, its lining marked with patterns six *chi* long and four *cun* thick, its flavor sweet. Consuming it grants forty thousand years of immortal life.\n\n**Jade Mushroom Fungus** grows upon the southern slopes of renowned mountains. Harvested in mid and late summer, dried in the shade for a hundred days, and consumed, it grants one hundred thousand years of immortal life.\n\n**Dusk Essence Fungus**, resembling the **Night Essence Fungus**, its face red, its lower part yellow-white, its stem vermilion, its cap crimson, growing inverted. **Day Essence Fungus** grows in autumn upon the southern slopes of renowned mountains, its color crimson, its two stems growing together. Harvested with a wooden knife, dried in the shade for a hundred days, and consumed in a *ge* (measure), it grants thirty thousand years of life. Its stem and cap are both crimson.\n\n**Night Essence Fungus** grows upon the northern slopes of renowned mountains, its hue blue-green, its stem blue, its flavor sour, its cap inverted outward, bearing dew. Drinking it grants thirty thousand years of life.\n\n**White Jade Fungus** grows within the valleys of Mount Tai, its leaves blue, its lower part red, each side layered thrice with crimson stems.",
      "overlap_context": "n figure, crimson in hue, crowned with a cap that shifts between yellow and red, and tastes sweet. Consuming it prevents aging, and partaking of it grants eighty myriad years of immortal life.\n\n**Golden Essence Fungus** grows upon Mount Hua. Its cap is white, its stem wreathed in white clouds, and it resembles a young pheasant. Its flavor is sweet and pungent. Harvested on a *ren* day of the tenth month, dried in the shade for a hundred days, and consumed, it grants eight thousand years of life.",
      "start_char": 1432,
      "end_char": 2735,
      "start_sentence": 79,
      "end_sentence": 151,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.93528962135315,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上灵宝芝草品.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "采而食之，八万岁矣。 朝精芝，夏生。 白色、无盖，如方石，味苦。 铜刀采之，阴乾百日，食之万年仙矣。 上有二人守之。 春精芝，青赤色，反盖，有角，上有二子下垂，味苦。 铜刀采之，无间多少，食之三万岁。 有五色云覆之。 土菌芝，五色，乍黄、乍青、乍赤、乍白、乍黑，上有三枝，有子。 食之，延年仙矣。 木菌黄芝，生於大石中。 叶广二寸，长一尺，青色，三叶并生，下如方石。 冬夏生，味甘美，食之不老仙矣。 夏精芝，生於名山之中。 赤色盖，二子如珠，盖中生，味甘。 竹刀采之，阴乾百日，食之四万年仙矣。 秋精芝，生於坎陷中，旁多有香草，黄盖，赤里，三枝并曲生，头垂下，青茎。 食之，万岁。 白云芝，有五色圆如鼓，上有六子，赤色。 茎亦赤色，味酸。 食之万年仙矣。 左神芝，黑盖，反向天，白茎，有女人守之。 饮中露，二千年。 生於名山之中。 右神芝，生於名山。 青盖，白茎，三枝。 骨刀采之，阴乾百日，食如瓜甲许，寿万年。 下有白鹿守之。 木禄芝，青色，有支文，生於名山，味甘。 食之万岁。 上有五茎，青盖。 石菌芝，生於名山。 夜则有光。 夏午日采取中央赤者食之，万年仙矣。 白茎，头中似莲样。 赤圭芝，生於名山。 白盖，里有纹，青茎，味辛。 食之不老，二百神明从仙矣。 铁精芝，秋生。 紫盖，黄里，五枝味甘。 铜刀采之，食如木耳许，寿三千年仙矣。 上有五色云覆之。 柯精芝，生於名山之阴。 白盖，白茎，木刀采之，阴乾百日，食之如豆大，万岁仙矣。 中央黄者可食。 土菌芝，生於名山。 青盖，白茎，食之万年仙矣。 石芝，生於名山。 白盖，白茎，食之令人六万岁仙矣。 方寸七，以上日三服之。 石精芝，秋生。 赤盖，白里，赤茎，味酸。 食之为万年仙矣。 上有赤鸟守之。 河闭芝，秋生。 黄色，三枝并生。 饮上露，九千年仙矣。 反盖向上。 水菌芝，青盖，白里，青茎。 食之日一合，去病为万岁仙矣。 兽菌芝，生於名山松栢树下。 白盖，白茎。 夏至日采之，日取一合食，三年变化仙矣。 海阙芝，秋生沙石上。 四重，似盖，青色，赤茎，二枝并生。 上有露，饮之万年仙矣。 上有五色云覆之。 云瑶芝，精秋生。 青茎，青叶，上有白鸟守之。 饮上露，千年仙矣。 青菌芝，青盖二重，白里，白茎，味甘酸。 日食一合，千年仙矣。 云芝，青盖，黄茎，味如蜜。 食之千年得仙矣。 上有五色云覆之。 昆仑芝，秋生。 黄盖二重，黄茎，其味甘。 上有露，饮之三千年仙矣。 人精芝，生於名山。 头青，盖白，里赤，茎三枝并生，味甘。 饮上露，为万年仙矣。 山英芝，生於名岳深崖阴近湿处。 赤色，如四重浮图级。 食之，千年仙矣。 紫芝，似人头，味辛。 食之，令人心通，不死身轻耳。 冬如芝，秋生太山之阳。 黄盖，三黄茎，别根同盖，味甘辛。 阴乾百日，食之，二千年仙矣。 赤精芝，夏生。 黄盖，青茎，白里，九二重。 食之五千年仙矣。 两边五色草。 紫石芝，味苦，赤盖，黄里，赤茎。 食之令人不死仙矣。 紫盖芝，三茎共本，下圆上方二尺紫盖，味甘。 食之三千年仙矣。 赤精芝，赤色炎起，味甘。 铁刀采之，阴乾百日，食之二千年仙矣。 二人守之似火炬样。 茎炎俱赤。",
      "translated_text": "Harvested and consumed, it grants eighty thousand years of life. **Dawn Essence Fungus** grows in summer. White in color, capless, square like stone, its flavor bitter. Harvested with a bronze knife, dried in the shade for a hundred days, and consumed, it grants ten thousand years of immortality. Two persons guard it above.\n\n**Spring Essence Fungus** is blue-green and red, its cap inverted, bearing horns, with two seeds hanging downward, its flavor bitter. Harvested with a bronze knife, regardless of quantity, and consumed, it grants thirty thousand years of life. Five-colored clouds cover it.\n\n**Earth Fungus** displays five hues—now yellow, now blue-green, now red, now white, now black—with three branches bearing seeds. Consumed, it extends life and grants immortality.\n\n**Wood Fungus Yellow Essence** grows within great stones. Its leaves span two *cun* in width and one *chi* in length, blue-green in color, three leaves growing together, its base square like stone. It grows in winter and summer, its flavor sweet and pleasant. Consumed, it grants ageless immortality.\n\n**Summer Essence Fungus** grows within renowned mountains. Its cap is red, bearing two seed-like pearls within, its flavor sweet. Harvested with a bamboo knife, dried in the shade for a hundred days, and consumed, it grants forty thousand years of immortality.\n\n**Autumn Essence Fungus** grows within sunken hollows, surrounded by many fragrant herbs. Its cap is yellow, its interior red, three crooked branches growing together, their heads drooping, their stems blue-green. Consumed, it grants ten thousand years of life.\n\n**White Cloud Fungus** displays five colors, round like a drum, bearing six red seeds above. Its stem is also red, its flavor sour. Consumed, it grants ten thousand years of immortality.\n\n**Left Spirit Fungus** has a black cap facing upward toward the sky, a white stem, and is guarded by a woman. Drinking the dew within grants two thousand years of life. It grows within renowned mountains.\n\n**Right Spirit Fungus** grows within renowned mountains. Its cap is blue-green, its stem white, with three branches. Harvested with a bone knife, dried in the shade for a hundred days, and consumed in the amount of a melon seed, it grants ten thousand years of life. A white deer guards it below.\n\n**Wood Fortune Fungus** is blue-green, bearing branch-like veins, growing within renowned mountains, its flavor sweet. Consumed, it grants ten thousand years of life. It has five stems and a blue-green cap.\n\n**Stone Fungus** grows within renowned mountains. It emits light at night. Harvested at noon on a summer day, the red central portion is consumed, granting ten thousand years of immortality. Its stem is white, its head resembling a lotus.\n\n**Red Jade Fungus** grows within renowned mountains. Its cap is white, its interior veined, its stem blue-green, its flavor pungent. Consumed, it prevents aging, and two hundred spirits follow the immortal.\n\n**Iron Essence Fungus** grows in autumn. Its cap is purple, its interior yellow, with five branches, its flavor sweet. Harvested with a bronze knife and consumed in the amount of a wood ear, it grants three thousand years of immortality. Five-colored clouds cover it above.\n\n**Branch Essence Fungus** grows upon the northern slopes of renowned mountains. Its cap is white, its stem white. Harvested with a wooden knife, dried in the shade for a hundred days, and consumed in the amount of a bean, it grants ten thousand years of immortality. Only the yellow central portion is edible.\n\n**Earth Fungus** grows within renowned mountains. Its cap is blue-green, its stem white. Consumed, it grants ten thousand years of immortality.\n\n**Stone Essence** grows within renowned mountains. Its cap is white, its stem white. Consumed, it grants sixty thousand years of immortality. A *fangcun* (square *cun*) is taken thrice daily.\n\n**Stone Essence Fungus** grows in autumn. Its cap is red, its interior white, its stem red, its flavor sour. Consumed, it grants ten thousand years of immortality. A red bird guards it above.\n\n**River-Sealed Fungus** grows in autumn. Yellow in color, three branches growing together. Drinking the dew upon it grants nine thousand years of immortality. Its cap faces upward.\n\n**Water Fungus** has a blue-green cap, a white interior, and a blue-green stem. Consumed daily in the amount of a *ge*, it cures illness and grants ten thousand years of immortality.\n\n**Beast Fungus** grows beneath pine and cypress trees in renowned mountains. Its cap is white, its stem white. Harvested on the Summer Solstice, one *ge* is taken daily. After three years, one transforms and attains immortality.\n\n**Sea Gate Fungus** grows upon sand and stone in autumn. Four-layered, resembling a cap, blue-green in color, its stem red, two branches growing together. Drinking the dew upon it grants ten thousand years of immortality. Five-colored clouds cover it above.\n\n**Cloud Jade Fungus** grows in late autumn. Its stem is blue-green, its leaves blue-green, and a white bird guards it above. Drinking the dew upon it grants one thousand years of immortality.\n\n**Blue-Green Fungus** has a double-layered blue-green cap, a white interior, a white stem, its flavor sweet and sour. Consumed daily in the amount of a *ge*, it grants one thousand years of immortality.\n\n**Cloud Fungus** has a blue-green cap, a yellow stem, its flavor like honey. Consumed, it grants one thousand years of immortality. Five-colored clouds cover it above.\n\n**Kunlun Fungus** grows in autumn. Its cap is double-layered yellow, its stem yellow, its flavor sweet. Drinking the dew upon it grants three thousand years of immortality.\n\n**Human Essence Fungus** grows within renowned mountains. Its head is blue-green, its cap white, its interior red, three branches growing together, its flavor sweet. Drinking the dew upon it grants ten thousand years of immortality.\n\n**Mountain Glory Fungus** grows in the deep, shady, damp cliffs of renowned peaks. Red in color, resembling a four-tiered pagoda. Consumed, it grants one thousand years of immortality.\n\n**Purple Fungus** resembles a human head, its flavor pungent. Consumed, it sharpens the mind, prevents death, and lightens the body.\n\n**Winter Willow Fungus** grows in autumn upon the southern slopes of Mount Tai. Its cap is yellow, with three yellow stems, its roots distinct yet sharing the same cap, its flavor sweet and pungent. Dried in the shade for a hundred days and consumed, it grants two thousand years of immortality.\n\n**Red Essence Fungus** grows in summer. Its cap is yellow, its stem blue-green, its interior white, with nine double layers. Consumed, it grants five thousand years of immortality. Five-colored grasses grow on either side.\n\n**Purple Stone Fungus** has a bitter flavor, a red cap, a yellow interior, and a red stem. Consumed, it grants deathless immortality.\n\n**Purple Cap Fungus** has three stems sharing a single base, its cap square and purple, two *chi* in size, its flavor sweet. Consumed, it grants three thousand years of immortality.\n\n**Red Essence Fungus** is red and flaming, its flavor sweet. Harvested with an iron knife, dried in the shade for a hundred days, and consumed, it grants two thousand years of immortality. Two persons guard it, resembling torches of fire. Its stem and flames are both red.",
      "overlap_context": "shade for a hundred days, and consumed in a *ge* (measure), it grants thirty thousand years of life. Its stem and cap are both crimson.\n\n**Night Essence Fungus** grows upon the northern slopes of renowned mountains, its hue blue-green, its stem blue, its flavor sour, its cap inverted outward, bearing dew. Drinking it grants thirty thousand years of life.\n\n**White Jade Fungus** grows within the valleys of Mount Tai, its leaves blue, its lower part red, each side layered thrice with crimson stems.",
      "start_char": 2735,
      "end_char": 4035,
      "start_sentence": 152,
      "end_sentence": 252,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.874610900878906,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上灵宝芝草品.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "迎山连芝，食之，日行千里，八千岁仙矣。 三枝，中枝顶有盖，共根生，紫色，下二枝无盖。 紫山芝，赤紫色，四重，赤盖。 食之三千年仙矣。 紫芝，白盖，黄里，似月，白茎。 食之有光明仙矣。 木芝，食之千年仙矣。 水芝，食之千年仙矣。 似王字样 重紫芝，黄盖，赤茎，二枝并生相连。 食之，仙矣。 六柱紫芝，赤盖，赤茎，黄裹。 食之得仙矣。 顶有盖，下三重无盖。 紫科芝，赤色，白里，似蛇，味苦。 除寒热邪气，日食一合，仙矣。 秋取之。 紫芝，味甘，白盖，三枝，茎上黄下赤。 食之仙矣，骨体满实，肠化为筋。 上有盖，下一重无盖。 重紫芝，状如此。 味甘苦。 食之仙矣。 白盖如起，黄茎，赤根，三枝，顶上有盖，下一重二枝无盖。 紫芝，赤盖、白里、赤茎、味甘。 食之延年仙矣。 科芝，赤表，白裹，味甘。 冬服之令人不老而仙，似蛇尾。 紫芝，赤盖、白里、黑茎，味甘。 秋采食之，仙矣。 火芝，赤盖、白里、黑茎、味苦。 冬夏采食之，仙矣。 上有五色云覆之。 两枝交叉分生。 科芝，三重，赤色、盖白、味甘辛。 食之延年得仙矣。 水芝，赤盖、白里、白茎。 三枝，通上出盖，食之，延年仙矣。 宫芝，食之延年不老仙矣。 总有十一段也。 朱盖，赤茎。 阙芝，夏秋采服方寸七，与天地等毕。 紫盖，紫茎，七段。 当中一枝长，两盖似珠轮。 上禄芝，食之仙矣。 乘虚行也。 青盖、朱茎。 十一段，上六，中二，下三。 玉精芝，大海中生。 味甘。 服之二千年仙也。 朱盖，玉茎，朱色。 代侯芝，上圆下方。 春一作五月。 采食之，寿万年也。 似桶朱色。 昙芝，食之六年，上有红云守之。 朱盖，朱茎，朱叶，有六叶。 不死芝，食之万年。 上有红云，紫盖，紫茎，四枝无盖。 朱芝，食之令人千岁仙矣。 朱盖，朱茎。 天威芝，青色，四时采食之，千万年。 有云赤色覆之。 青盖，青茎。 辟精芝，生海中。 青色，食之千年矣。 其状似人形。 天寒芝，黄色如人形。 食之千岁仙矣。 赤英芝，味辛。 四时采食之，寿三千年也。 二枝交叉，一枝无盖，一枝头朱，一头似花未开。 天芝，四时采，阴乾百日，服方寸七以仙矣。 朱盖，紫茎。 天陆芝，铜刀采食之，为三千年仙矣。 两茎并生，朱色，似莲药未开。 天阙芝，食之万年仙矣。 二茎并生，朱盖，白裹。 地精芝，二羊守之。 服上露者，六千年仙矣。 三茎并生，朱盖青茎。 日精芝，味甘。 竹刀采，阴乾百日，服方寸七，五千年仙矣。 朱色，三枝，无盖，共一枝。 月精芝，竹刀四时采之，食如豆，五千年仙矣。 一人守之，黄盖，黄茎。 四时精芝，服上露，二万年。 二青龙守之，赤色，上有五色云覆之。 二重，朱盖，朱茎。 黑精芝，味甘酸。 骨刀采食之，二千年仙矣。 阴乾百日，下有羊守之。 紫盖，紫茎，有两叶。 木精芝，味甘。 食之二千年仙矣。 阴乾百日，上有三马。 骨刀采之。 盖紫色，反向上。",
      "translated_text": "**Mountain-Welcoming Connected Fungus**—consumed, it enables one to walk a thousand *li* in a day and grants eight thousand years of immortality. It has three stems sharing a single root, the central stem bearing a cap, all purple in color, while the two lower stems lack caps.\n\n**Purple Mountain Fungus** is deep purple-red, with four layers and a red cap. Consumed, it grants three thousand years of immortality.\n\n**Purple Fungus** has a white cap, a yellow interior, and resembles the moon, with a white stem. Consumed, it bestows luminous immortality.\n\n**Wood Fungus**—consumed, it grants a thousand years of immortality.\n**Water Fungus**—consumed, it grants a thousand years of immortality. It resembles the character *wang* in shape.\n\n**Double-Purple Fungus** has a yellow cap, a red stem, and two stems growing conjoined. Consumed, it grants immortality.\n\n**Six-Pillar Purple Fungus** has a red cap, a red stem, and a yellow sheath. Consumed, it confers immortality. Its top bears a cap, while the lower three layers lack one.\n\n**Purple-Stalk Fungus** is red, with a white interior, resembling a snake, and has a bitter flavor. It dispels cold-heat pathogenic qi; consuming one *ge* daily grants immortality. Harvested in autumn.\n\n**Purple Fungus** has a sweet flavor, a white cap, three stems, and a stem that is yellow above and red below. Consumed, it grants immortality, filling the bones and body with solidity and transforming the intestines into sinew. Its top bears a cap, while the lower layer lacks one.\n\n**Double-Purple Fungus** resembles the above in form, with a sweet-bitter flavor. Consumed, it grants immortality. Its white cap rises upward, with a yellow stem, a red root, three stems, a cap on top, and two lower stems lacking caps.\n\n**Purple Fungus** has a red cap, a white interior, a red stem, and a sweet flavor. Consumed, it extends lifespan and grants immortality.\n\n**Stalk Fungus** has a red exterior, a white sheath, and a sweet flavor. Consumed in winter, it prevents aging and grants immortality, resembling a snake’s tail.\n\n**Purple Fungus** has a red cap, a white interior, a black stem, and a sweet flavor. Harvested and consumed in autumn, it grants immortality.\n\n**Fire Fungus** has a red cap, a white interior, a black stem, and a bitter flavor. Harvested and consumed in winter or summer, it grants immortality. Five-colored clouds cover it above, with two stems growing in crossed formation.\n\n**Stalk Fungus** has three layers, is red, with a white cap, and a sweet-spicy flavor. Consumed, it extends lifespan and grants immortality.\n\n**Water Fungus** has a red cap, a white interior, and a white stem. Three stems emerge upward to form a cap. Consumed, it extends lifespan and grants immortality.\n\n**Palace Fungus**—consumed, it extends lifespan and prevents aging, granting immortality.\n\nIn total, there are eleven sections.\n\n**Vermilion-Capped Fungus** has a red cap and a red stem.\n**Gate Fungus**—harvested in summer or autumn, consuming a *cun*-square piece daily grants a lifespan equal to heaven and earth. It has a purple cap and a purple stem, in seven segments, with the central stem longer and two caps resembling pearl wheels.\n\n**Upper Fortune Fungus**—consumed, it grants immortality, allowing one to travel through the void. It has a green cap and a vermilion stem, in eleven segments: six above, two in the middle, and three below.\n\n**Jade Essence Fungus** grows in the great sea, with a sweet flavor. Consumed, it grants two thousand years of immortality. It has a vermilion cap and a jade stem, both vermilion in color.\n\n**Marquis-Substituting Fungus** is round above and square below. Harvested in spring (or the fifth month), consuming it grants a lifespan of ten thousand years. It resembles a vermilion barrel.\n\n**Cloud Fungus**—consumed for six years, red clouds guard it above. It has a vermilion cap, vermilion stem, and vermilion leaves, with six leaves.\n\n**Deathless Fungus**—consumed, it grants ten thousand years of immortality. Red clouds hover above it, with a purple cap, purple stem, and four stems lacking caps.\n\n**Vermilion Fungus**—consumed, it grants a thousand years of immortality. It has a vermilion cap and a vermilion stem.\n\n**Heavenly Might Fungus** is green, harvested and consumed in all seasons, granting ten thousand years of lifespan. Red clouds cover it above, with a green cap and a green stem.\n\n**Evil-Repelling Fungus** grows in the sea, is green, and consumed, grants a thousand years of immortality. Its form resembles a human.\n\n**Heavenly Cold Fungus** is yellow and human-shaped. Consumed, it grants a thousand years of immortality.\n\n**Red Blossom Fungus** has a spicy flavor. Harvested and consumed in all seasons, it grants a lifespan of three thousand years. Two stems cross, one lacking a cap, one with a vermilion tip resembling an unopened flower.\n\n**Heavenly Fungus**—harvested in all seasons, dried in the shade for a hundred days, and consumed in a *cun*-square piece, it grants immortality. It has a vermilion cap and a purple stem.\n\n**Heavenly Land Fungus**—harvested with a bronze knife and consumed, it grants three thousand years of immortality. Two stems grow conjoined, vermilion in color, resembling an unopened lotus bud.\n\n**Heavenly Gate Fungus**—consumed, it grants ten thousand years of immortality. Two stems grow conjoined, with a vermilion cap and a white sheath.\n\n**Earth Essence Fungus** is guarded by two rams. Consuming the dew upon it grants six thousand years of immortality. Three stems grow conjoined, with a vermilion cap and a green stem.\n\n**Sun Essence Fungus** has a sweet flavor. Harvested with a bamboo knife, dried in the shade for a hundred days, and consumed in a *cun*-square piece, it grants five thousand years of immortality. It is vermilion, with three stems lacking caps, all sharing a single stem.\n\n**Moon Essence Fungus**—harvested in all seasons with a bamboo knife, consumed like a bean, it grants five thousand years of immortality. One person guards it, with a yellow cap and a yellow stem.\n\n**Four Seasons Essence Fungus**—consuming its dew grants twenty thousand years of lifespan. Two green dragons guard it, it is red, and five-colored clouds cover it above. It has two layers, a vermilion cap, and a vermilion stem.\n\n**Black Essence Fungus** has a sweet-sour flavor. Harvested with a bone knife and consumed, it grants two thousand years of immortality. Dried in the shade for a hundred days, two rams guard it below. It has a purple cap, a purple stem, and two leaves.\n\n**Wood Essence Fungus** has a sweet flavor. Consumed, it grants two thousand years of immortality. Dried in the shade for a hundred days, three horses stand above it. Harvested with a bone knife, its cap is purple and curls upward.",
      "overlap_context": " Consumed, it grants deathless immortality.\n\n**Purple Cap Fungus** has three stems sharing a single base, its cap square and purple, two *chi* in size, its flavor sweet. Consumed, it grants three thousand years of immortality.\n\n**Red Essence Fungus** is red and flaming, its flavor sweet. Harvested with an iron knife, dried in the shade for a hundred days, and consumed, it grants two thousand years of immortality. Two persons guard it, resembling torches of fire. Its stem and flames are both red.",
      "start_char": 4036,
      "end_char": 5227,
      "start_sentence": 253,
      "end_sentence": 351,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.88485074043274,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上灵宝芝草品.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "水精芝，味苦。 夏采食如爪甲，五千年仙矣。 青盖，四茎穿出盖上，无盖，白茎。 金精芝，味甘。 木刀采食之，千岁仙矣。 阴乾百日，食之五段，似火焰起。 朱色，一朱盖，朱茎。 一盖如初生，茎青色。 水芝，生於众水旁，味苦。 夏采食如爪甲，十万年仙矣。 盖紫色，顶有三角，茎青色，通出无盖。 雨精芝，夏生。 味甘，食无拘多少，六千年仙矣。 其盖青，紫茎，有四苗生。 水精芝，生山水旁。 青黑色，四枝并生，盖仰，味小苦。 饮上露，十万年仙矣。 云精芝，生於华山，味酸。 竹刀采之，食无多少，九千年仙矣。 盖紫色，茎白。 虎精芝，生於华山之阴。 黄色，如虎皮，味甘，食之令人不老，聪明仙矣。 茎朱色。 太上灵宝芝草品竟",
      "translated_text": "**Water Essence Fungus** has a bitter flavor. Harvested in summer and consumed in pieces the size of a fingernail, it grants five thousand years of immortality. It has a green cap, with four stems piercing through the cap; if capless, the stem is white.\n\n**Gold Essence Fungus** has a sweet flavor. Harvested with a wooden knife and consumed, it grants a thousand years of immortality. Dried in the shade for a hundred days, when eaten, it divides into five segments resembling rising flames. It is vermilion, with a single vermilion cap and vermilion stem. When the cap first emerges, the stem is green.\n\n**Water Fungus** grows beside many waters and has a bitter flavor. Harvested in summer and consumed in pieces the size of a fingernail, it grants a hundred thousand years of immortality. Its cap is purple, with three points at the top; the stem is green, extending through without a cap.\n\n**Rain Essence Fungus** grows in summer. It has a sweet flavor, and consuming any amount grants six thousand years of immortality. Its cap is green, with a purple stem, and four sprouts grow from it.\n\n**Water Essence Fungus** grows beside mountain waters. It is greenish-black, with four branches growing together; the cap faces upward and has a slightly bitter flavor. Drinking its dew grants a hundred thousand years of immortality.\n\n**Cloud Essence Fungus** grows on Mount Hua and has a sour flavor. Harvested with a bamboo knife, consuming any amount grants nine thousand years of immortality. Its cap is purple, and its stem is white.\n\n**Tiger Essence Fungus** grows on the northern slopes of Mount Hua. It is yellow, resembling tiger skin, and has a sweet flavor. Consuming it prevents aging and grants keen intelligence and immortality. Its stem is vermilion.\n\n**The Supreme Numinous Treasure’s Catalog of Fungal Varieties is complete.**",
      "overlap_context": "rmilion stem.\n\n**Black Essence Fungus** has a sweet-sour flavor. Harvested with a bone knife and consumed, it grants two thousand years of immortality. Dried in the shade for a hundred days, two rams guard it below. It has a purple cap, a purple stem, and two leaves.\n\n**Wood Essence Fungus** has a sweet flavor. Consumed, it grants two thousand years of immortality. Dried in the shade for a hundred days, three horses stand above it. Harvested with a bone knife, its cap is purple and curls upward.",
      "start_char": 5228,
      "end_char": 5534,
      "start_sentence": 352,
      "end_sentence": 375,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.027801990509033,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上灵宝芝草品.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}