{
  "source_id": "太上飞行九晨玉经",
  "source_file": "chunked_daozang\\太上飞行九晨玉经.json",
  "total_chunks": 12,
  "total_original_chars": 13451,
  "total_translated_chars": 87041,
  "total_translation_time": 418.0816354751587,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\玉诀类\\太上飞行九晨玉经.txt",
    "category": "玉诀类"
  },
  "full_translation": "*The Supreme Jade Scripture of Soaring Through the Nine Mornings*\n\nThe *Supreme Jade Scripture of Soaring Through the Nine Mornings*. Its compiler is unknown, though it likely emerged during the Eastern Jin or Southern Dynasties. According to quotations in the *Supreme Secret Essentials*, this scripture was originally a chapter within the *Supreme Scripture of the Ninefold Returning Dao of Soaring Feathered Flight*, later extracted as an independent text. It comprises one scroll. Base text from: *Daoist Canon of the Zhengtong Era*, Dongxuan Section, Jade Instructions Category. Collated with: *Inner Mystery Scripture of the River Chart of Supreme Clarity* and *Golden Simplified Jade Characters of the Heavenly Steps and Earthly Records of the Supreme Clarity Scripture of the Great Tenuity Emperor Lord*.\n\n---\n\nThe Supreme Lord of the Great Dao addressed the Perfected Duke of the Northern Pole, saying: \"In times past, I roamed the northern heavens, steering my chariot through the Vast Cold, treading upon the Florid Canopy, my hands parting the Nine Origins. I wandered the Cloud Palaces of Leisurely Radiance, sported in the Northern Mystery, roamed the chambers of the Northern Darkness, and beheld the gates of the Cavernous Millennia. Gazing upon the revolving jade pivot, I summoned the turning of kalpas; hastening the conjunction of epochs, I danced the Wheel of Offerings. Sighing at the withering of the myriad beings, I looked down upon the enduring existence of heaven and earth—thus did I perceive the marvels of the Nine Stars and awaken to the supreme numen of the Dipper’s Handle.\n\nThe Nine Stars are indeed the spiritual root of the Nine Heavens, the luminous beam of sun and moon, the abyssal origin of the ten thousand kinds. Thus, heaven possesses nine qi, and the Nine Stars are their subtle essence; earth possesses the Nine Provinces, and the Nine Stars are their divine lords; humans possess nine apertures, and the Nine Stars are their life repositories; the Nine Palaces of yin and yang have the Nine Stars as their gates; the Five Peaks and Four Seas have the Nine Stars as their abyssal courts. The Five and Nine arrayed in ranks, their guiding threads endless, they govern the celestial lodges, revolve the Three Luminaries, regulate the Four and Five, ensuring heaven and earth endure—whence the ten thousand kinds take them as their origin, and gods and immortals rely upon them.\n\nIf heaven lacked the Nine Stars, it would have no means to attain lofty purity; if earth lacked the Nine Stars, it would have no means to attain supreme numen; if humans lacked the Nine Stars, their nine apertures would remain dim. The Celestial Thearch combines them to commune with the Perfected; gods and immortals rely upon them to attain completion; the Five Phases ride them to achieve transcendence; the myriad beings receive them to attain life.\n\nWhen heaven is clear and earth tranquil, the Nine Stars shine resplendent; when heaven is agitated and earth obstructed, the Nine Stars darken and dim. The revolving pivot summons the kalpa’s appointed time; the Celestial Pass regulates the qi of the Five Phases. They convey the great axle of the Hollow Void, hastening the responsive conjunctions of the Nine Heavens. Thus does divine radiance revolve and blaze, the Dark Surveillance overseeing the myriad lives. When they traverse positions obliquely, they announce omens of fortune and calamity.\n\nIt is by the Nine Stars’ weaving and turning that heaven and earth undergo the great conjunctions of cosmic cycles, and the Hundred and Six respond to their tally. When yin and yang violently clash, the two qi obstruct and agitate, heaven overturns and earth collapses, the Nine Seas merge into darkness, gold and jade dissolve and vanish—yet not even the tip of a hair is lost. All is determined by the revolutions of the Nine Stars and the hastening of the revolving pivot.\n\nTo comprehend the workings of heaven and earth and the subtleties of the Dark Net is to attain its mean—whereupon one may tread the hidden steps of the Hollow Constant, conceal one’s radiance and elude form, transform the Three Luminaries, and instantly perfect the myriad beings. The black specks of concealment and submersion bear twenty-five names; their purport is profound and recondite, too secret to transmit below.\n\nAbove dwell the Nine Luminous Lords of the Mornings; within reside the Nine August Ladies. Their ethereal souls and numinous spirits are all the majestic deities of the Nine Dippers, exhaling the radiance of the Seven Luminaries, streaming their light through the gates of the Nine Heavens. They illumine the dark and empty, leaving no trace unmanifest.\n\nWhen their yang rays blaze, they become the Flowing Gold Fire Bells; when their yin rays gleam, they become the Vast and Falling Seven Origins—all are the numinous strategies of the Loftiest, the majestic chapters of the Primordial Beginning. The oral instructions of the Dragon-Soaring Measured Silk are concealed within the unspoken, arrayed beneath the Florid Canopy of the Mornings. When one offers the sheep’s sore to the heavens to summon the Perfected, then the Dark Radiance obliquely illumines the covenant ground, the Nine Mornings descend upon the numinous chamber, the Ladies rejoice upon their couches, and the Dark Dipper records names in the Hidden Writ.\n\nOne who knows this Dao, by merely preserving it, may escape the great kalpic conjunctions and traverse the vast calamities of the jia-shen era. Cultivating it for two times seven years, one may don the vast wings of the wild swan and soar aloft, cleaving the Purple Empyrean to ascend the mornings.\n\nThis is the supreme Dao of the Jade Clarity—it does not compare to the middling immortals of the Supreme Clarity. The Jade Clarity is the lofty Perfected of the Supreme Clarity; the Supreme Clarity is the lofty spirits of the Grand Clarity; the Grand Clarity is the lofty numina of the Flying Immortals.\n\nThose who practice the Dao of the Jade Clarity, when they emerge, have all the heavens attend their chariots, with jade lads and jade maidens—three thousand each—serving them. They bear the thirty-seven-colored standards, ride the twelve-jeweled wheels of the purple-cloud flying chariot, with phoenix songs leading the way and the Dark Zither following behind. The Six Masters clear the path, and flying dragons flank the shafts. Their rank accords with the High Immortals, arrayed in the charts of the Jade Clarity.\n\nThose who practice the Dao of the Supreme Clarity, when they emerge, have the Five Lodges as their attendants, with jade lads and jade maidens—one thousand five hundred each—serving them. They bear the purple-feathered standards, ride the flying-cloud cinnabar carriage, with phoenixes and simurghs leading the way and the Heavenly Zither played behind. Dark dragons clear the path, and the Five Thearchs attend the chariot. Their rank accords with the left and right ministers of the Supreme Clarity.\n\nThose who practice the Dao of the Grand Clarity, when they emerge, have the Five Thearchs as their attendants, with jade lads and jade maidens—eight hundred each—serving them. They bear the five-colored standards, ride the dragon carriage of flying mist, with nine phoenixes wailing ahead and eight simurghs singing behind. White hornless dragons clear the path, and the Grand Tie attend the chariot.\n\nThus, among the Perfected there are degrees of loftiness, and within the Mysterious there are gradations of rank. The Dao of the Jade Clarity is profoundly distant and utterly remote—it does not compare to the middling Perfected or the ranks of Flying Immortals.\n\nThe Nine Stars’ method of aligning with the Dark Radiance is a Dao I received from the Primordial Beginning. For seven hundred million kalpas, through the formation and dissolution of heaven and earth, the rise and fall of the myriad kinds, this Dao alone has endured. Even now, I cultivate it above the cloudy radiance, yet cannot forget it in due season—so enamored am I of this Dao’s loftiness and marvel, and so delighted in the Ladies’ company.\n\nMoreover, those who in this life first learn the soaring flight of the wild swan, yet know not the hidden art of treading the void—how shall they ever push open the gates of the layered empyreans and witness the beginning and end of heaven and earth?\"\n\nWithout this Dao, you will remain estranged from the Nine Mornings’ domain, and the Ladies’ transcendent wanderings will forever elude you. Though you may possess an illustrious name in the imperial registers, soaring high and surpassing all, you will only be able to ride cloud-dragons and roam the Five Peaks—merely avoiding death, nothing more. Thus, to tread the Dipper’s handle, circle the Flowery Morn, and ascend through the radiant jade heavens shall remain beyond your reach for ages to come.\n\nYou are now tasked with governing the kalpic tides, presiding over the celestial statutes of the Ten Heavens, and adjudicating the records of gods and immortals. It is fitting that you receive this method to guide the myriad lives. I now transmit it to you—guard it well and cultivate it in secret.\n\nThe Perfected of the Nine Mornings said: To practice the Dao of flying steps, first bathe and purify yourself a day prior. On the appointed day, lay out the star chart in the central courtyard, aligning it with the Dipper’s monthly station. Kneel facing north, burn incense beneath the Dark Radiance star, and strike your teeth thirty-six times. With eyes closed, visualize the Year Star at your left flank, the Grand White Star at your right flank, the Sparkling Deluder Star above your head, the Chronogram Star below your navel, and the Quelling Star at your heart.\n\nNext, drape your robe over the Nine Stars. First raise your left hand, bending it above your head in the Dipper’s shape. Visualize the Yang Brightness Star in your left palm, the Yin Essence Star at your left elbow, the Perfected Person at your left breast, and the Dark Radiance Star at your navel—hence the incense is burned beneath the Dark Radiance Star, so that your intentions may ascend and resonate with celestial clarity. Visualize the Cinnabar Prime Star at your right thigh, the Northern Culmen Star at your right knee, the Celestial Barrier Star at your right calf, the Auxiliary Star below your navel, and the Corrector Star above your head. When complete, softly recite the incantation:\n\n*\"I robe myself in the Celestial Dipper,\ndon a golden kerchief,\nmount the stalwart handle,\nenter the Dipper’s gate,\npay homage to the Perfected,\nbow to the Flowery Morn.\nThe twenty-eight lodgings\nenvelop my body.\nRiding the void, stepping the ethereal,\nI ascend in flight, weightless.\"*\n\nWhen finished, swallow qi nine times and stop.\n\nNext, raise your right hand in the Dipper’s shape above your head. Visualize the Yang Brightness Star returning to your right palm, the Yin Essence Star at your right elbow, the Perfected Person at your right breast, the Dark Radiance Star at your heart, the Cinnabar Prime Star at your left thigh, the Northern Culmen Star at your left knee, the Celestial Barrier Star at your left calf, the Corrector Star at your left brow, and the Auxiliary Star at your right eye. When complete, softly recite the incantation:\n\n*\"I ride the celestial stalwart,\nstep the Nine Origins,\ntread the Dipper’s handle,\npractice flying immortality,\nattain the celestial mind.\nThe myriad spirits submit,\nmy form conceals, my radiance hides,\ntransforming in myriad ways.\nShould any dare obstruct,\nbind them at the Dipper’s gate,\nsweep away misfortune,\nrectify the true and luminous.\nTo my left gleam the fire bells,\nto my right shine the numinous banners.\nMy awe-inspiring radiance spans ten thousand leagues,\nmy whistle summons all before me.\nWhat the Jade Emperor has decreed\nshall unfailingly come to pass.\"*\n\nWhen finished, swallow qi sixteen times and stop.\n\nNext, mount the Dipper and circle beyond its stars, stepping the Dipper’s hun and po. From the Celestial Pivot Star, face the Yang Brightness Star. Then ascend to the Celestial Rotation and Celestial Jade Stars, proceeding in order to the Hidden Prime Star. Circle back and forth three times, then upon the Hidden Prime Star, chant the *Three Caverns’ Flying Void Chapter* before ascending to the Yang Brightness Star.\n\nStand and visualize the Lady’s form as described earlier.\n\nThe first star, the Celestial Pivot, is the hun-spirit of the Yang Brightness Star. The Celestial Pivot’s might is unshining, its light unilluminating; it permeates the Great Void, spanning nine hundred and twenty leagues, and faces the northwest gate of the Yang Brightness Star. This star is called the *Palace of the Primordial Dipper’s Stalwart Essence, Supreme Perfected August Lady of the Nine Mornings*. Her surname is Illuminating Pervasion, her taboo name is Dark Mystery, and her true name is Supreme Essence. She wears a flying-cloud flowery topknot, her remaining hair cascading to her waist. She is clad in a three-colored robe of purple, yellow, and azure, girdled with a nine-belled sash. Her mouth constantly exhales a radiance of azure qi, which pours onto the Yang Brightness Star, brightening its brilliance.\n\nWhen practicing the flying steps, first visualize the Lady’s surname, taboo name, and form. Then recite the incantation, so that her hun-spirit may become serene and upright, the Bright Star rejoice in awe, and the celestial radiance thoroughly illuminate, allowing both hun and shadow to ascend together to the Morn.\n\nStand with feet together upon the Celestial Pivot Star, facing the Yang Brightness Star. Place your left hand over your heart, point your right hand at the Yang Brightness Star, strike your teeth nine times, swallow saliva nine times, and hold your breath for three cycles. Then softly recite the incantation:\n\n*\"Celestial Consorts of the Nine Stars,\ncongeal qi and refine the true.\nThe seven luminaries entwine,\nstyled the Jade Morn.\nAbove, they erect the flowery canopy;\nbelow, they tread the Dipper’s handle.\nTheir bodies ride the celestial mechanism,\nflying steps upon the jasper carriage.\nHun-essence and po-spirit\nunite with form to become immortal.\nPreserving the primordial sun and moon,\nheaven and earth endure forever.\nTransforming with the kalpic tides,\nthey join the Ladies in unbroken ascent,\nrising to the Nine Heavens,\nfloating radiance naturally follows.\"*\n\nWhen finished, hold your breath for three cycles. Then step with your left foot onto the Celestial Rotation Star, advance your right foot to join the left, and circulate qi.\n\nThe second star, the Celestial Rotation, is the hun-spirit of the Yin Essence Star. The Celestial Rotation’s radiance is distant yet luminous, shining yet unflickering. It permeates the Great Void, spanning five hundred and fifty leagues, and faces the west gate of the Yin Essence Star. This star is called the *Palace of the Dark Dipper’s Void Essence, Supreme Mysterious August Lady*. Her surname is Mystic Mirror, her taboo name is Seething Brilliance, and her true name is Golden Return. She wears a flying-cloud flowery topknot, her remaining hair cascading to her waist. She is clad in a flying brocade skirt and phoenix-patterned brocade cloak, girdled with a numinous flying purple sash. Her mouth constantly exhales a radiance of black qi, which pours onto the Yin Essence Star, brightening its splendor.\n\nWhen practicing the flying steps, visualize the Lady’s surname, taboo name, and form. Stand with feet together upon the Celestial Rotation Star, facing the Yin Essence Star. Place your left hand over your heart, point your right hand at the Yin Essence Star, strike your teeth nine times, swallow saliva nine times, and hold your breath for nine cycles. Then softly recite the incantation:\n\n*\"Northern Mysterious August Spirit,\nthe Nine Heavens open to clarity.\nJade splendor subtly illumines,\nweaving the Purple Court.\nToday I practice flying steps,\nthe myriad paths shine brightly.\nHun and po become serene and upright,\npeacefully attaching to my form.\nLet none take flight alone—\ntogether we ascend to the Northern Star.\nAbove, I inhale the dark essence,\ndrink the jade spring.\nTransforming through the nine subtleties,\nI preserve life and celestial numen.\"*\n\nWhen finished, hold your breath for three cycles, then advance your left foot to tread upon the Celestial Mechanism Star, followed by your right foot to join it, and release your breath.\n\nThe third, the Celestial Mechanism Star, is the po-essence of the Perfected Person Star. The Celestial Mechanism Star is fierce yet not manifest, radiant yet not dazzling, subtly pervading the Great Void, spanning seven hundred and seventy li. It faces the southeast gate of the Perfected Person Star. This star is called the Palace of Supreme Essence, the Spirit Consort Yuanhuang, Lady of Primordial Augustness. Her surname is Everbright, her taboo name is Transforming Cloud, and her true name is Flowing Flame. She wears the Morning Infant Treasure Crown upon her head, a robe of luminous cloud brocade, and a sash of the Six Mountains’ Dawn Flight. Her mouth constantly exhales the essence of yellow qi, directing it upon the Perfected Person Star to illumine the star’s brilliance.\n\nWhen practicing the flying steps, visualize the Lady’s surname, taboo name, and form. Stand with feet together upon the Celestial Mechanism Star, facing the Perfected Person Star. Place your right hand over your heart, point your left hand at the Perfected Person Star, strike your teeth nine times, swallow saliva nine times, and hold your breath for twelve cycles. Then softly recite the incantation:\n\n*\"Primordial August Spirit Consort,\ntrue essence of the Nine Stars,\nabove you govern the Mechanism’s measure,\noverseeing all heavens.\nBelow you examine the myriad regions,\npurple mist swirls in the turning light.\nToday is supremely auspicious,\nthe Yellow Path unfolds.\nMoisture flows beyond the nine bounds,\ncurving to bathe my form.\nFlying in Yu’s steps,\nI ascend to the Emperor’s Dawn,\nsharing the August One’s brow,\neternally enjoying kalpas of years.\"*\n\nWhen finished, hold your breath for three cycles, then advance your left foot to tread upon the Celestial Balance Star, followed by your right foot to join it, and release your breath.\n\nThe fourth, the Celestial Balance Star, is the po-essence of the Dark Mystery Star. The Celestial Balance Star is faint and concealed, hidden yet subtly luminous, subtly shining through the Great Void, spanning eight hundred li. It faces the east gate of the Dark Mystery Star. This star is called the Palace of Fundamental Extremity, the Supreme Spirit Consort Huahuang, Lady of August Flower. Her surname is Opening Life, her taboo name is Moving Brightness, and her true name is Infant Barrier. She wears a crown of seven measures, a robe of crimson silk with phoenix patterns, and a sash of golden numen and jade light. Her mouth constantly exhales the essence of red qi, directing it upon the Dark Mystery Star to illumine the star’s radiance.\n\nWhen practicing the flying steps, visualize the Lady’s surname, taboo name, and form. Stand with feet together upon the Celestial Balance Star, facing the Dark Mystery. Place your right hand over your heart, point your left hand at the Dark Mystery, strike your teeth nine times, swallow saliva three times, and hold your breath for three cycles. Then softly recite the prayer:\n\n*\"August Spirit Consort,\nentitled Lady of Flower,\nyou pacify and guard the Flowery Canopy,\nthe Northern Supreme Palace.\nTo your left attend Jade Maidens,\nto your right guard Spirit Lads.\nYou guide the seven essences,\nradiance of the nine luminants.\nFor me, summon true power,\nflying steps upon celestial firmness.\nLet my hun and po,\ntogether ascend to the Emperor’s Hall.\"*\n\nWhen finished, hold your breath for three cycles, then advance your left foot to tread upon the Jade Balance, followed by your right foot to join it, and release your breath.\n\nThe fifth, the Jade Balance Star, is the hun-spirit of the Cinnabar Prime Star. The Jade Balance Star is vast yet silent, surging yet not resplendent, subtly pervading the Great Void, spanning seven hundred and twenty li. It faces the northeast gate of the Cinnabar Prime Star. This star is called the Palace of Recorded Brightness, the Central August Lady of the Golden Canopy in the North. Her surname is Primordial Square, her taboo name is Divine Martiality, and her true name is Sudden. She wears the Purple Dawn Flying Flower Crown upon her head, a robe of nine colors, and a sash of divine tiger jade patterns. Her mouth constantly exhales the light of white qi, directing it upon the Cinnabar Prime Star to illumine the star’s radiance.\n\nWhen practicing the flying steps, visualize the Lady’s surname, taboo name, and form. Stand with feet together upon the Jade Balance Star, facing the Cinnabar Prime. Place your right hand over your heart, point your left hand at the Cinnabar Prime, strike your teeth three times, swallow saliva three times, and hold your breath for three cycles. Then softly recite the incantation:\n\n*\"Central August Consort,\ndwelling in the Supreme Prime,\nthe Nine Ladles pour forth radiance,\nessence blazes through the eight limits.\nSwirling mist billows,\nscattering numinous crimson chambers.\nLet my po-spirit,\nharmonize with heaven and earth.\nForm and hun together ascend,\nriding the void with jade reins,\ncrimson carriage and purple chariot.\nFlying northward,\nI receive the hidden scriptures.\"*\n\nWhen finished, hold your breath for three cycles, then advance your left foot to tread upon the Open Yang Star, followed by your right foot to join it, and release your breath.\n\nThe sixth, the Open Yang Star, is the po-spirit of the Northern Culmen Star. The Open Yang Star is bright yet subtly illuminating, radiant yet not resplendent, penetrating the Great Void, spanning seven hundred and seventy li. It faces the lower opening of the Northern Culmen’s northern cavern gate. This star is called the Palace of Purple Culmen, the August Primordial Lady of Morning Flower, Anshang. Her surname is King Prime, her taboo name is Root Flower, and her true name is Dark Convergence. She wears the Jade Dawn Advancing Worthiness Crown upon her head, a robe of flying azure feathers, and a sash of flowing gold fire bells. Her mouth constantly exhales the essence of green qi, directing it upon the Northern Culmen Star to illumine the star’s radiance.\n\nWhen practicing the flying steps, visualize the Lady’s surname, taboo name, and form. Stand with feet together upon the Open Yang Star, facing the Northern Culmen. Place your left hand over your heart, point your right hand at the Northern Culmen, strike your teeth three times, swallow saliva five times, and hold your breath for five cycles. Then softly recite the incantation:\n\n*\"Emperor of the Nine Heavens,\nancestor of the Yellow Flower,\nturning the jade mechanism,\ngoverning the eight directions.\nLet my flying steps\ntread the celestial net’s records.\nReversing and intertwining,\nthree and five crosswise,\ncommuning with the eight subtleties,\nfeathered robe of mysterious yellow.\nDragon carriage and jade light,\nflying through the great void,\neternally enjoying long life,\nsharing heaven and earth’s merit.\"*\n\nWhen finished, hold your breath for five cycles, then advance your left foot to tread upon the Shaking Brilliance Star, followed by your right foot to join it, and release your breath.\n\nThe seventh, the Shaking Brilliance Star, is the great brightness of the hun-spirit of the Celestial Pass Star. The Shaking Brilliance Star’s light revolves through the empty void, circling the Celestial Pass. Subtly shining through the Great Void, it spans nine hundred li. Above, it faces the south gate of the Celestial Pass Star; below, it faces the Northern Culmen Star. This star is called the Palace of Heavenly Motion, the Jade Flower Spirit August Lady. Her surname is Measure Prime, her taboo name is Final Convergence, and her true name is Opening Light. She wears a topknot of flying flowers and crumbling clouds, her remaining hair flowing to her waist. She is clad in a seven-colored night-luminous cloud brocade skirt, a nine-colored brocade mantle, and holds the Nine Heavens’ Numinous Jade Staff. Her mouth only exhales the essence of red qi, directing it upon the Celestial Pass Star to illumine the star’s great light.\n\nTo practice the Dao of Flying Steps, one must visualize the surname, taboo name, and form of the Lady. Stand with feet together upon the Light-Spreading Star, facing the Celestial Pass Star. Place the left hand upon the heart and point the right hand toward the Celestial Pass. Knock the teeth nine times, swallow saliva nine times, and hold the breath for three cycles. Then softly intone the incantation:\n\n*\"Heaven and Earth revolve,\nSeven lights shine brightly,\nNine qi spiral and flow,\nAbove in accord with Jade Clarity.\nWithin resides the Lady,\nNamed Flower Spirit.\nMysteriously reflecting beyond the Nine,\nNo hairbreadth remains unborn.\nThis day is most auspicious,\nFlying steps ascend the Purple Court.\nMay my hun and po\nPeacefully attach to my form,\nTransforming through the empty void,\nExiting darkness, entering obscurity.\nHeaven and Earth together revolve,\nUnshaken for ten thousand kalpas.\nPreserve immortality at Upper Primordial,\nNine Mornings unite in essence.\"*\n\nConclude by holding the breath for seven cycles. Then step with the left foot upon the Cavern-Luminous Star, advance the right foot to join it, and circulate qi.\n\nThe Eighth, the Cavern-Luminous Star, is the yang-bright essence-soul of the Auxiliary Star. The Cavern-Luminous Star’s light revolves through all heavens, gathering and conveying the upper constellations, flowing smoothly through the Great Void, spanning nine hundred and ninety li. Above, it faces the southwest gate of the Auxiliary Star. It lies upon the upper beam of the Celestial Pass, the yang radiance of the Northern Culmen. This star is called the Palace of Empty Perfection, the Ever-Bright Constant August Lady. Her surname is Dark Ascent, her taboo name is Without Rhyme, and her true name is Empty Transformation. She wears a topknot of flying clouds and crumbling flowers, her remaining hair flowing to her waist. She is clad in a flying gauze patterned robe, girded with a nine-light sash. Her mouth constantly exhales the essence of blue-green qi, directing it upon the Auxiliary Star to perpetually illumine its great yang light.\n\nTo practice the Dao of Flying Steps, one must visualize the surname, taboo name, and form of the Lady. Stand with feet together upon the Cavern-Luminous Star, facing the Auxiliary Star. Place the right hand upon the heart and point the left hand toward the Conveying Star. Knock the teeth nine times, swallow saliva nine times, and hold the breath for three cycles. Then softly intone the incantation:\n\n*\"Three and Five take flight,\nHeaven and Earth unfold.\nNine Primordials revolve the net,\nJoining and binding the Upper Capital.\nCelestial perfected scatter numinous power,\nMyriad Ways overflow in prosperity.\nThe Lady curves her reflection,\nThis day is most auspicious.\nFlying steps tread the Dipper’s soul,\nSpiraling along the Jade Net.\nHead bears the flowered canopy,\nFeet tread the Constant Yang.\nPlayfully roaming the Three Clarities,\nTransforming in ten thousand directions.\nPreserve immortality naturally,\nEnjoying boundless longevity.\"*\n\nConclude by holding the breath for twelve cycles. Then step with the left foot upon the Hidden Primordial Star, advance the right foot to join it, and circulate qi.\n\nThe Ninth, the Hidden Primordial Star, is the bright-empty numinous-soul of the Supporting Star. The Hidden Primordial Star conceals its breath beneath the flowered canopy, its subtle light shining within the empty void, spanning nine hundred and ninety li. Above, it faces the southeast gate of the Supporting Star. This star is called the Palace of Primordial Treasure, the Upper August Lady of Empty Mystery and Transformation. Her surname is Dark Pervasion, her taboo name is Myriad First, and her true name is Constant Yang. She wears a seven-tiered jade crown of flying clouds, a green-patterned brocade robe, and a nine-light night-illuminating girdle. Her mouth constantly exhales the essence of black qi, directing it upon the Supporting Star to illumine the hidden and radiant light of the cavernous void.\n\nTo practice the Dao of Flying Steps, one must visualize the surname, taboo name, and form of the Lady. Stand with feet together upon the Hidden Primordial Star, facing the Supporting Star. Place the left hand upon the heart and point the right hand toward the Supporting Star. Knock the teeth twelve times, swallow saliva once, and hold the breath for one cycle. Then softly intone the incantation:\n\n*\"Step upon the Heavenly Net,\nFlying through the Feathered Gate.\nExiting and entering the Three Lives,\nEscaping the body, concealed and submerged.\nTransforming form and shadow,\nA thousand unions, ten thousand divisions.\nSpirit pacified, qi settled,\nRefining and conveying the immortal soul.\nThe entire body ascends in flight,\nClad in brocade skirts.\nFlowing bells intertwine,\nTiger-patterned pendants adorn the body.\nRoaring and shouting at the Five Thearchs,\nWielding the reins to ride the luminous clouds.\nAscend to the Northern Culmen,\nPaying homage to the August Lord.\"*\n\nConclude by holding the breath for one cycle, then return with feet together upon the Celestial Pivot Star. Perform the single step back and forth three times; no further visualization or incantation is required. The practice of treading the Dipper’s soul is thus complete. Cease visualization and incantation.\n\nUpon first ascending a star, perform this once. After three repetitions back and forth, stand again upon the Celestial Pivot Star, facing the Yang-Bright Star, and sing the *Wandering and Roaming Nine Mornings Feathered Stanzas* three times. Then ascend the Net to the Yang-Bright Star and proceed with the Flying Steps.\n\nThe lyrics of the Feathered Stanzas are as follows:\n\n*Cloud Net descends from Heaven’s Discipline,\nNine Dippers in the emerald jade void.\nPurple canopy upon layered peaks,\nMysterious essence brightens the Eight Corners.\nAbove dwell the Nine Morning Guests,\nChanting and reciting hidden texts.\nFlying steps roam the Northern Han,\nLong life abides in Heaven and Earth.\nReining the Dark Feathered Terrace,\nFlying through the Nine Primordials’ realm.\nCavernous void, deep and secluded,\nCloud Net soars through empty space.\nBelow are the gatherers of perfection,\nGazing upward at the Jade Morning Palace.\nThree circuits upon the Yang-Bright,\nNine returns into the cavernous wilds.\nHigh steps ascend the Imperial Honored,\nLong songs in the Dragon-Flight tongue.\nJade auroras reflect the Northern Wastes,\nJasper branches with emerald hidden boughs.\nEmpty birth in the Nine Numinous Terrace,\nRadiant essence shines through the Great Distant.\nCelestial Pass revolves through layered darkness,\nKalpas and meetings repeatedly pass.\nRiding my feathered chariot,\nFlying steps weave the Weaving Maid’s River.\nPreserve the numinous in empty constancy,\nForever forgetting Heaven and Earth’s excess.*\n\nThese three stanzas originate from the Jade Clarity Upper Palace. All the Nine Yang Jade Lads and Nine Flower Jade Maidens perpetually sing them upon the Flowered Morning to harmonize the exchange of form and soul and awaken the numinous perfected at the hidden pass.\n\nIn practicing the Dao of Flying Steps through the Seven Primordials and treading the Nine Stars, without these song-stanzas, one must not rashly ascend the Heavenly Net or tread the Dark Dipper. Violating this, the Nine Stars will seize one’s hun and po, confining them beneath the Dipper’s Net. This causes people to become wild and lose their nature, anger and delusion arising recklessly. Within three years, none will escape bodily death. It is not that the Dao does not wish for people to attain immortality, but rather that people cannot fathom the Dao’s profound source. How could one not proceed with care?\n\nThe Nine Stars are the roots of the Nine Heavens, the bright essence of Jade Clarity. The Nine Souls are the luminous numina of the Nine Stars. People merely know the wonders of treading the Seven Stars but remain ignorant of the supreme numinosity of the Nine Stars’ hun and po.\n\nIt is not that the Seven Stars do not wish to convey people to the Dipper, but rather that the hun, po, and spirit of the human body fear the numinous power of the Dipper’s stars and dare not ascend with them into the void. Those who wish to cultivate the Way of Flying Steps must know the hun and po of the Dipper Stars—the hidden esoteric instructions of the Nine August Ladies’ inner names and the Perpetual Void.\n\nBy practicing according to the chart, how could one fail to ascend the Northern Prime and pay homage above to the Radiant Dawn? Yet this Way is lofty and wondrous, a treasured secret of Jade Clarity not readily transmitted; few among the middle immortals have attained it. Those who know its method will see the Nine Stars inwardly illumine, the Ladies descend from their thrones, and the Dipper’s hun rejoice—together they will escort the practitioner into the inner palace of the Nine Primes.\n\nThe Yang Bright Star is Heaven’s Grand Commandant, governing transgressions and overseeing all matters. Above, it presides over the perfected of the Nine Heavens; in the middle, it supervises the flying immortals of the Five Peaks; below, it leads the true persons of later learners. The merits and faults of gods and spirits, the weight of their deeds—none are beyond its jurisdiction. The star spans nine hundred and twenty miles, its expanse all lapis lazuli and crystal. Within it stand jade trees bearing azure fruit, where golden-winged ravens roost. Spontaneously growing there are azure essence jade mushrooms; consuming a single mouthful grants a lifespan of ninety thousand years. The star has nine gates, each radiating four beams of light that silently illuminate nine hundred million miles. Above it stands the Azure City Jade Tower, where the Perfected of the Dipper resides, known as the Supreme Palace Azure City Jade Tower Nine Mornings Lord. His surname is Shangyun, his taboo name Fayingrong, and his style Dongdongyang Yaotianchui. He wears a Nine Mornings Jade Crown, robes of azure feathered flight, and holds the Mysterious Chart of the Dipper in his hands, seated within the Jade Tower. There exists a register of esoteric names, the Jade Record; one must know the Nine Mornings Lord’s inner taboo name. Those who know it will see the Jade Dawn inwardly illumine and the Mysterious Star descend in darkness. Cultivating this Way, one may soar through the Great Void and ascend into the Nine Gates.\n\nTo practice the Way of Flying Steps, first stand upon the Yang Bright Star. Press the right hand to the heart, point the left hand toward the northeast, hold the breath for nine cycles, click the teeth nine times, swallow saliva three times, and with eyes closed, visualize the Nine Mornings Lord’s surname, taboo name, and form. Remaining upon the Yang Bright Star, softly intone the incantation:\n\n*\"Flying Heaven’s Nine Mornings, above you occupy the Mysterious Chief,\nYour might shakes the Eight Radiants, governing transgressions and rectifying wrongs.\nToday I take the Flying Steps, ten thousand Ways open wide,\nNine Perfected align in splendor, heaven turns and earth revolves.\nGhostly schemes—necks severed; human rebels—crushed and felled.\nThe Three Bonds seize the wayward, the rebellious shall decline.\nDivine spirits attend and guard, bestowing towering fortune.\nGaining Heaven’s heart, bones transform and form takes flight,\nHands grasp the Seven Nets, feet tread the Nine Gates.\nCloud-walking, rain-stepping, ascending to the Supreme Microcosm.\"*\n\nWhen finished, turn left upon the Yang Bright Star nine times, then stand facing the Ghost Gate. Hold the breath for three cycles, step with the left foot onto the Yin Essence Star, advance the right foot to join it, and release the breath.\n\nThe Yin Essence Star is Heaven’s Grand Minister, governing official rank and destiny. Above, it presides over the celestial lodges; below, it leads the myriad spirits and those who study immortality. The fate and rank of all who cultivate the Way and of the common people—none are beyond its jurisdiction. The star spans five hundred and fifty miles, its expanse also lapis lazuli and crystal. Within it stand jade trees bearing black fruit, where golden-winged ravens roost. Spontaneously growing there are mysterious mushrooms and jade nectar; consuming a single mouthful grants a lifespan of fifty thousand years. The star has five gates, each radiating four beams of light that silently illuminate nine hundred million miles. Above it stands the Five-Colored Jade Tower, where the Perfected of the Dipper’s Handle resides, known as the Middle Prime Palace Five-Colored Jade Tower Northern Supreme Morning Lord. His surname is Yuying, his taboo name Xuan Shangpin, and his style Changyang Wenjimingguang. He wears a Mysterious Essence Jade Crown, robes of dark feathered flight, and holds a five-colored feathered tally in his hands, seated within the Jade Tower. There exists a register of esoteric names, the Vermilion Terrace; one must know the Northern Supreme Lord’s inner taboo name. Those who know it will see the Northern Supreme inwardly illumine and the Yin Essence descend in darkness. Cultivating this Way, one may soar through the Great Void and ascend into the Five Gates.\n\nTo practice the Way of Flying Steps, first stand upon the Yin Essence Star. Point the left hand toward your life-destiny star, press the right hand to the heart, hold the breath for five cycles, click the teeth five times, swallow saliva five times, and with eyes closed, visualize the Northern Supreme Morning Lord’s taboo name, style, and form. Remaining upon the Yin Essence Star, softly intone the incantation:\n\n*\"Mysterious Morning of the Northern Spirit, quintessence of the Five Qi,\nYour form conceals the Six Records, your heart stores the Radiant Star.\nSun and moon flank and illumine, the Three Lights adorn your form.\nToday is supremely auspicious, stepping the Nets of the Purple Court.\nAbove, the Heavenly Gates open, receiving the fortune of the Vermilion Spirit.\nEndless blessings and honor, exalted rank and glory,\nTen thousand wishes fulfilled, all directions propitious.\nSoaring beneath the Flowery Canopy, roaming the Jade Clarity,\nAscending to the Northern Morning, the Nine Perfected align in procession.\"*\n\nWhen finished, turn left upon the Yin Essence Star five times, then stand facing your life-destiny star. Hold the breath for three cycles, step with the left foot onto the Assistant Star, advance the right foot to join it, and release the breath. Do not tread upon the Perfected Person Star—step only upon the Assistant Star.\n\nThe Perfected Person Star is Heaven’s Minister of Works, governing divine immortals. Above, it presides over the lofty perfected of the Nine Heavens; in the middle, it supervises the numinous immortals of the Five Peaks; below, it leads those who study the Way and the lineage of true immortals—none are beyond its jurisdiction. The star spans seven hundred and seventy miles, its expanse also lapis lazuli and crystal. Within it stand jade trees bearing yellow fruit, where golden-winged ravens roost. Spontaneously growing there are yellow essence jade mushrooms; consuming a single mouthful grants a lifespan of thirty million years. The star has twelve gates, each radiating four beams of light that brilliantly illuminate nine hundred million miles. Above it stands the Yellow Terrace Jade Tower, where the Perfected resides, known as the True Prime Palace Central Yellow Terrace Jade Tower Lord of the Radiant Dawn. His surname is Guixi, his taboo name Miaoyinguang, and his style Tongdu Yuandu Ningzhi. He wears a Flying Morning Treasure Crown, robes of azure feathered flight, and holds the Azure Register of the Dipper in his hands, seated within the Jade Tower. There exists a register of esoteric names, the Square Cauldron; one must know the Radiant Dawn Lord’s inner taboo name. Those who know it will see the Radiant Dawn inwardly illumine and the Perfected descend in darkness.\n\nTo cultivate this Dao is to soar through the Great Void and ascend into the Twelve Registers. In practicing the Dao of Flying Steps, one must not tread upon the star of the Perfected; instead, stand with feet together upon the Adjuvant Star—this is what is called \"reclining beneath the Flowering Canopy.\"\n\nThe Northern Elder Perfected Lord said: If you wish to ascend bodily, do not offend the Perfected; if you wish to fly, do not transgress the Celestial Net; if you seek immortality, you must pay homage to the Radiant Dawn. When performing the Dao, avoid the Perfected’s star and stand upon the Adjuvant Star, bow to the Perfected, and pay court to the Radiant Dawn to seek flight through the void.\n\nThe Adjuvant Star is called \"Void,\" and the Auxiliary Star is called \"Constant.\" \"Constant\" is the eternal yang; \"Void\" is concealment. It bears a taboo name that must not be spoken aloud. It may only be transmitted beneath the Radiant Dawn through the Rite of the Sheep and Crow, pledging upon torn silk. Should one obtain this secret taboo and hold it in the heart while practicing, to leak it lightly would bring the Wind Blade of Punishment upon one’s seven generations of ancestors.\n\nStanding upon the Adjuvant Star, place the right hand over the heart, point the left hand toward the northwest, hold the breath for nine cycles, click the teeth nine times, swallow saliva nine times, and with eyes closed, visualize the Radiant Dawn Lord’s surname, taboo name, and form. Remain standing upon the Perfected’s star and softly recite the incantation:\n\n*\"Great Subtlety connects to the True,\nAdjuvant aids the Radiant Dawn.\nExhaling the radiance of ninefold essence,\nGathering qi into purple mist,\nFlying auroras stream and reflect,\nIlluminating the Ten Heavens.\nAbove, it governs the Primal Balance;\nBelow, it embraces the divine immortals.\nToday, in flying steps,\nI pay homage to the Perfected.\nFirst, I seek void-travel;\nSecond, I beg for concealment of form;\nThird, I wish to ascend to the Northern Portal;\nFourth, I desire the Dragon Robe and azure sash,\nBroidered mantle and green skirt,\nTo ride the Eight Effulgences,\nRoam the Nine Mysteries,\nEnter the celestial lodgings,\nAnd share the Emperor’s chariot.\"*\n\nWhen finished, circle the Adjuvant Star seven times to the left, face the Perfected, hold the breath for three cycles, step with the left foot upon the Mysterious Darkness, advance the right foot to join it, and release the breath.\n\nThe Mysterious Darkness Star is the Celestial Vanguard, master of punishing rebellion. Above, it commands the ghostly spirits of the Nine Heavens; in the middle, it oversees the Three Offices of the Northern Emperor; below, it surveils the myriad multitudes, punishing rebellion and disobedience. All who harbor malevolent intent are subject to its jurisdiction. The star spans eight hundred miles, its substance like lapis lazuli and crystal. Within it grows a jade tree bearing crimson fruit, where golden-winged birds alight. Spontaneously arising cinnabar mushrooms and flowing jade-essence grant a lifespan of eighty million years upon consuming a single mouthful. The star has three gates, each radiating four beams of light that glow fiercely for nine hundred million miles. Above it stands the Vermilion Terrace Jade Tower, where the Perfected of the Dipper emerges—known as the Vermilion Terrace Jade Tower Dark Prime Flying Canopy Radiant Dawn Lord of the Central Secluded Palace. His surname is Dark Pivot, his taboo name Fixed Proclamation of Awareness, and his style Dharma Brightness Spreading the Celestial Pillar. He wears a Three-Flowered Treasure Dawn Crown, robes of cinnabar brocade flight, and holds the Life-Spirit Staff in his hands, seated within the Jade Tower. Should there be a register of esoteric names, the Jade Tablet, one must know the Flying Canopy Lord’s inner taboo name. Those who know it will see the Flying Canopy inwardly illumine and the Mysterious Darkness descend in darkness. To cultivate this Dao is to soar through the Great Void and ascend into the Three Gates.\n\nWhen practicing the Dao of Flying Steps, first stand upon the Mysterious Darkness Star, place the right hand over the heart, point the left hand toward the heavens, hold the breath for nine cycles, click the teeth three times, swallow saliva three times, and with eyes closed, visualize the Flying Canopy Lord’s surname, taboo name, and form. Remain standing upon the Mysterious Darkness Star and softly recite the incantation:\n\n*\"Celestial Perfected walk the Dao,\nTreading upon luminous traces to conceal form.\nThe Seven Origins gleam and scatter;\nThe Nine Dawns unite as one.\nHand grasping the Celestial Balance,\nFeet treading the Flying Star,\nLeft, the Fire Marshal assists;\nRight, the Vermilion Soldiers command.\nMight shakes the Ten Heavens,\nRadiance streams into the Highest Clarity.\nFirst, slay the schemers;\nThen, punish the demonic essences.\nWhoever dares oppose the upright\nShall be severed by the Blade Punishment.\nAll subject to the Three Principles\nMust submit and obey.\nTransforming and traversing,\nProceeding to the Flowering Court as the heart desires,\nRiding the void in flying steps,\nAscending to the Emperor’s numinous presence.\"*\n\nWhen finished, circle three times to the left, face the heavens, hold the breath for three cycles, step with the left foot upon the Cinnabar Prime Star, advance the right foot to join it, and release the breath.\n\nThe Cinnabar Prime Star is the Dipper Sovereign of Heaven, master of the Registers of Destiny. Above, it governs the celestial records of the Nine Heavens; in the middle, it oversees the departments of ghosts and spirits; below, it presides over the destiny registers of those who study the True. All in the heavens and upon the earth are subject to its governance. The star spans seven hundred and twenty miles, its substance like lapis lazuli and crystal. Within it grows a crimson tree bearing white fruit, where golden-winged birds alight. Spontaneously arising golden essence and refined elixir grant a lifespan of seventy thousand years upon consuming a single mouthful. The star has seven gates, each radiating four beams of light that glow fiercely for nine hundred million miles. Above it stands the Plain Terrace Golden Tower, where the Perfected of the Treading Cycle resides—known as the Plain Terrace Golden Tower Treading Cycle Perfected of the Principle-Spirit Palace, the Golden Chief of the Seven Dawns. His surname is Supreme Opening, his taboo name Dark Illumination of Light, and his style Vermilion Radiance of Primordial Transformation and Five Paths. He wears a Seven-Treasure Flying Heaven Crown, robes of white brocade flight, and holds the Azure Prime Register in his hands, seated within the Golden Tower. Should there be a register of esoteric names, the Kun Terrace, one must know the Seven Dawns Lord’s inner taboo name. Those who know it will see the Seven Dawns inwardly illumine and the Cinnabar Prime descend in darkness. To cultivate this Dao is to soar through the Great Void and ascend into the Seven Gates.\n\nWhen practicing the Dao of Flying Steps, first stand upon the Cinnabar Prime Star, place the right hand over the heart, point the left hand toward the Celestial Pass, hold the breath for seven cycles, click the teeth three times, swallow saliva three times, and with eyes closed, visualize the Seven Dawns Lord’s surname, taboo name, and form. Remain standing upon the Cinnabar Prime Star and softly recite the invocation:\n\n*\"Flying steps tread the cycle,\nAscending the Cinnabar Prime.\nRiding the Chief and falling lodgings,\nSummoning the Dipper’s soul,\nErasing death and commanding life,\nSeparating the azure and white tallies.\nThe Three Harmonies complete the Dao,\nExtending years and destiny,\nEnjoying blessings and long life,\nEqual to the Radiant Dawn’s bloom.\nFlesh flies, bones grow light,\nRiding luminous traces and mounting clouds.\nImmortal robes and feathered garments,\nTinkling pendants in profusion,\nFive colors gleaming and resplendent,\nAscending into the Seven Gates.\"*\n\nWhen finished, circle the star seven times, return to face the Celestial Pass, hold the breath for seven cycles, step with the left foot upon the Northern Culmen, advance the right foot to join it, and release the breath.\n\nThe Northern Culmen Star is the Grand Standard of Heaven, governing ascent and advancement. Above, it oversees the Perfected of the Nine Heavens; at the center, it commands the Flying Immortals of the Five Peaks; below, it presides over the bodies of scholars. All meritorious efforts and attainments of the Dao, the turning of the wheel and the stages of ascent, are wholly encompassed therein. The star spans seven hundred and seventy *li*, its substance like lapis lazuli and crystal. At its heart stands a black tree with white fruit, where the Golden-Winged One roosts. There grow spontaneously dark mushrooms and water-jade; consuming a single mouthful grants a lifespan of fifty thousand years.\n\nThe star has eight gates, each with four rays of light that illumine nine hundred million *li*. Above stands the Dark Terrace and Jade Tower, where the Master of the Step-Net resides, known as the Lord of Flying Radiance of the Dark Terrace and Jade Tower within the Palace of Cyclic Brightness. His surname is Bright Numinous, his personal name is Long Bright Transformation, and his courtesy name is Profound Origin, Origin Prospering, Upper Prime.\n\nHe wears a crown of Flying Essence and Radiance, robes of purple brocade with flying skirts, and holds in hand the Nine Dipper Jade Tablet, seated within the Jade Tower. If one possesses a mystic name on the Golden Terrace, one must know the inner name of the Lord of Flying Radiance. Those who know it shall see the Lord of Flying Radiance descend in illumination, the Dark Mystery of the Northern Culmen alighting, and by cultivating this Dao, one may soar through the Great Void and ascend within the Eight Gates.\n\nTo practice the Dao of Flying Steps, first stand upon the Northern Culmen Star. With the right hand, press the heart; with the left, point to the Golden Gate. Hold the breath for eight cycles, knock the teeth three times, swallow saliva three times, close the eyes, and visualize the name, personal name, and form of the Lord of Flying Radiance. Knock the teeth, stand upon the Northern Culmen, and softly intone the incantation:\n\n*\"The heavens move in threes and fives,\nThe Middle Prime revolves.\nFlying steps beneath the radiant canopy,\nRiding the Dipper and mounting the dawn,\nFalling into the cycle of three destinies,\nWandering amidst drifting mists.\nToday is supremely auspicious,\nAscending to seek the Divine Immortals.\nNames inscribed on jade tablets,\nCharacters engraved in purple script.\nAzure skirts and feathered robes,\nCrimson sashes and brocade skirts.\nThe Eight Radiance Cinnabar Chariot\nConveys me to ascend the hall.\nAttaining the rank of Immortal Minister,\nLord of the Northern Ascent.\nAll that is invoked,\nShall be as spoken.\"*\n\nWhen finished, circle the star eight times, return to face the west, hold the breath for eight cycles, step with the left foot upon the Celestial Pass, advance the right foot to join it, and release the breath.\n\nThe Celestial Pass Star is the Supreme Emperor of Heaven, governing the mechanisms of Heaven and Earth, such as the nurturing of the four seasons, the alternation of Heaven and Earth’s fortune and adversity, and the convergence of kalpas—all are subject to it. The star spans nine hundred *li*, its substance like lapis lazuli and crystal. At its heart stands the Three-Flowered Tree with five-colored fruit, where the Golden-Winged One roosts. There grows spontaneously the Nine-Flavored Mushroom Paste; consuming a single mouthful, the body emits nine-colored light, and one gains a lifespan of ninety thousand years.\n\nThe star has one gate, with nine rays of light that govern the qi of the Nine Heavens, illumining nine hundred million *li*. Above stands the Nine-Layered Jade Tower, where the Dragon-Riding Perfected resides, known as the Lord of the Ninefold Cloud Canopy of the Northern Dawn within the Nine-Layered Jade Tower of the Opening Assembly Palace. His surname is Dark Pivot, his personal name is Turning Light, and his courtesy name is Meeting Prime, End Bright, Heavenly Disciple.\n\nHe wears a Nine Prime Treasure Crown, robes of nine-colored brocade, and holds in hand the Radiant Spirit’s Seal, seated within the Jade Tower. If one possesses a mystic name on the Jade Register of the Nine Heavens’ Imperial Diagram, one must know the inner name of the Lord of the Northern Canopy. Those who know it shall see the Lord of the Northern Canopy descend in illumination, the Dark Mystery of the Celestial Pass alighting. By cultivating this Dao, one may soar through the Great Void and ascend within the One Gate.\n\nTo practice the Dao of Flying Steps, stand upon the Celestial Pass Star. With the left hand, press the heart; with the right, point to the Earthly Door. Hold the breath for one cycle, knock the teeth three times, swallow saliva three times, close the eyes, and visualize the name, personal name, and form of the Lord of the Northern Canopy. Stand upon the Celestial Pass Star and intone the incantation:\n\n*\"The Primordial Heaven turns the Pass,\nThe Earth’s cycle revolves the Pivot.\nNine Numinous cross the degrees,\nThrees and fives mutually advance.\nThe Four Sevens’ banners and lodgings,\nThe Five Emperors wander.\nReceiving the Dark and stepping into the Void,\nAscending to tread the Jade Mechanism.\nClothed in the Dipper, shod in the Dipper,\nFlowing pendants radiate majesty.\nThose who follow me prosper,\nThose who oppose me decline.\nI traverse the Heavenly Perfected,\nTen thousand *li* open vast.\nThe body soars upon the azure disk,\nThe soul ascends, the form takes flight.\nTranscending the kalpa’s convergence,\nAscending into the Supreme Subtlety.\"*\n\nWhen finished, circle the star once, return to face the Earthly Door, hold the breath for one cycle, step with the left foot upon the Auxiliary Star, advance the right foot to join it, and release the breath.\n\nThe Auxiliary Star is the star of the Heavenly Venerable Jade Emperor, called the Constant. The Constant is the Constant Yang, governing the Flying Immortals. Above, it oversees the Nine Heavens; below, it commands the Nine Earths. The offices of the Divine Immortals of the Five Peaks and Four Marshes all derive from it. The star spans nine hundred and ninety *li*, its substance like lapis lazuli and crystal. At its heart stands the Azure-Flowered Tree, upon which naturally appear characters of nine sounds. Above is the Azure Crow, the Three-Legged Crow, where grows spontaneously lapis lazuli mushroom-jade. Consuming a single mouthful, one attains the same Perfection as the Jade Emperor.\n\nThe star has eight gates, through which the eight qi communicate. Each gate has four rays of light that illumine the Nine Heavens. Within stands the Purple Qi Jade Tower, where the Wandering Perfected of the Three Destinies resides, known as the Lord of the Nine Dawns of the Imperial Seat within the Purple Qi Jade Tower of the Palace of the Imperial Mat. His surname is Essence Constant, his personal name is Constant Without Flaw, and his courtesy name is Dark Unraveling, Void Correct, Upper Opening, Prolonging.\n\nHe wears a Flying Essence Jade Crown, robes of nine colors, and holds in hand the Fire Pendants, seated within the Jade Tower. If one possesses a mystic name of the Upper Clarity and knows the inner name of the Imperial Venerable, those who know it shall see the Imperial Venerable descend in illumination, the Dark Mystery of the Auxiliary Star alighting. By cultivating this Dao, one may soar through the Great Void and ascend within the Eight Gates.\n\nTo practice the Dao of Flying Steps, stand upon the Auxiliary Star. With the right hand, press the heart; with the left, point to the Sparkling Deluder Star. Hold the breath for three cycles, knock the teeth three times, swallow saliva three times, close the eyes, and visualize the name, personal name, and form of the Imperial Venerable. Stand upon the Auxiliary Star and softly intone the incantation:\n\n*\"Heaven and Earth interweave,\nThree destinies connect the numinous.\nAscending to tread the celestial lodgings,\nSoaring through the Nine Stars.\nIn the left hand, the Hidden Script;\nIn the right, the Feathered Canon.\nBowing to pay homage to the Imperial Venerable,\nReceiving the Emperor’s name.\nAttaining to traverse the Radiant Canopy,\nSoaring in the Purple Court.\nToday, practicing the Dao,\nTen thousand blessings converge.\nReceiving boundless fortune,\nForever enjoying long life.\nThe body transforms into feathers,\nAscending to the Upper Clarity.\"*\n\nWhen finished, circle the star three times, then face south again. Hold the breath for three cycles, turn the left foot to tread upon the Auxiliary Star, advance the right foot to join it, and release the breath.\n\nThe Auxiliary Star is the true star of the Supreme Thearch, called \"Void.\" Void means ever-hidden and empty, governing boundless transformations. The star spans nine hundred and ninety leagues, formed of lapis lazuli and crystal, with a Three-Florescence Tree growing at its center. Upon it, the Jade Chapters of the Nine Heavens naturally manifest. Atop the tree perches a golden-beaked phoenix, holding a fire-bell in its mouth, from which the radiance of the Seven Luminaries naturally arises. To consume a single breath from it is to attain the same true essence as the Supreme Thearch.\n\nThe star has nine gates, interlocking with the Nine Heavens. Each gate emits four rays of light, blazing beyond the Eight Extremes into the endless center. Within stands the Jade Terrace and Purple Palace, where the Three Yang Perfected wander—styled the Supreme Venerable of the Jade Tower and Purple Sash, the True Primordial Dawn Lord of the Imperial Palace. His surname is Dark Void, his personal name Void-Prior-Nothingness, his courtesy name Hidden Primordial Awareness, Radiant Obscure Yang, Boundless Seclusion.\n\nHe wears a Flying Heaven Jade Crown, robes of Nine Heavens Dragon Silk, and holds the Imperial Script in hand, seated within the Purple Palace. If one possesses the Mystic Name of the Nine Heavens and knows the inner personal name of the Imperial True One, one may conceal form and hide the body. Practicing this Way, one may ascend within the Nine Gates.\n\nTo perform the Flying Steps, stand upon the Auxiliary Star, right hand over the heart, left hand pointing to the Northern Asterism. Hold the breath for five cycles, knock the teeth three times, swallow saliva seven times, close the eyes, and visualize the name, personal name, and form of the True Primordial Dawn Lord. Stand facing backward upon the Auxiliary Star and softly intone the incantation:\n\n*\"The Dao harmonizes with the Three Subtleties,\nThe Mysterious Void uplifts the true.\nExiting the constant, entering the empty,\nEscaping form at Heaven’s Pass.\nFloating through the Eight Extremes,\nRiding the purple mist’s radiance.\nFlying steps traverse the Nine Heavens,\nTransforming into myriad thousands.\nRoaming beneath the Northern Canopy,\nWhistling to summon the Sentient Array.\nAll sought, all wished,\nNone unfulfilled as spoken.\nLongevity matching Heaven and Earth,\nPreserving the years of the Florid Dawn.\"*\n\nWhen finished, circle the star five times, then face the Northern Asterism. Hold the breath for seven cycles, turn the left foot twice, and stand again upon the Yang Brightness Star. From the Yang Brightness Star, perform the single-step Yu Pace, circling the Nine Stars nine times in nine returns. No further visualization or incantation is needed.\n\nWhen done, return to the Auxiliary Star and sit upright, reclining beneath the Florid Canopy. Visualize the Nine Dawns’ robes covering you as in the initial method. Close the eyes and imagine your body within crimson clouds, riding the Celestial Net through the void, ascending to the gates of the Nine Heavens. Follow the Net’s revolutions nine times, then sense the body as if falling through empty space, returning to sit upon the star chart. Wipe the eyes nine times with the hands, pinch the two eye-gates nine times, and perform the Great Incantation of the Celestial Cycle. Knock the teeth nine times, then face northwest and intone:\n\n*\"Supreme Nine Numinous Ones,\nAugust Florid Sovereign,\nTogether gazing upon the celestial lodgings,\nRevolving the Three Luminaries’ degrees.\nTransforming the four seasons,\nThe Five Agents attain immortality.\nToday, practicing the true,\nUniversally commanding the myriad spirits.\nThe Five Peaks and Four Floods,\nAnd all numinous mountains,\nThe officials of Heaven, Earth, and Water,\nAll guard my chariot.\nThe sun’s flashing lightning,\nThe Six Yin’s exhaling clouds,\nFierce beasts driven away,\nThe myriad spirits scattering in four directions.\nPoisonous dragons devour ghosts,\nLeveling and extinguishing evil’s source.\nThose who plot against me are punished,\nThose who offend me are vexed.\nThose who delight in me gain longevity,\nThose who wish for me attain immortality.\nI bear the Numinous Tally,\nMy body wears the Seven Origins.\nFlowing gold and fire-bells\nAdorn my body.\nHead crowned with the Florid Canopy,\nFeet treading radiant clouds.\nMouth holding celestial essence,\nHands grasping Heaven’s Pass.\nVoid and constant transform,\nA thousand unions, ten thousand divisions.\nMetal, Wood, Water, Fire,\nInstantly become spontaneous.\nFlying with the Yu Pace,\nWandering the Nine Gates.\nExiting and entering the Three Clarities,\nHeaven and Earth endure forever.\"*\n\nWhen finished, knock the teeth three more times and swallow saliva fourteen times. The Way of the Nine Dawns concludes here.\n\nTo practice the Way of the Nine Dawns, one must observe the following schedule: during the first, seventh, fourth, and tenth months—the four *meng* months—use the fifth and ninth days of the first decade, exclusively on the first day at dawn. In the second, eighth, fifth, and eleventh months—the four *zhong* months—use the fifteenth and nineteenth days of the middle decade at noon. In the third, ninth, sixth, and twelfth months—the four *ji* months—use the twenty-fifth and twenty-ninth days of the last decade at midnight. Thus, six days are selected from each month, one from each decade, practiced three times monthly, totaling thirty-six times yearly, corresponding to the celestial rotation of the Heavenly Pass and the three hundred sixty degrees of the nine heavens’ qi.\n\nOn these appointed days, inscribe the names of the nine heavens while practicing the Way, thereby transcending the *yang* cycle of nine hundred and six kalpas. The body avoids the calamities of the great deluge and the vast kalpic disasters. After nine years, one ascends the net of serene flight, strides upon the void’s纪, and soars beyond the mortal realm.\n\nThe *Mysterious Chart of the Nine Dawns* on the golden tablets states: To cultivate the flying steps of the Nine Dawns, one must also adhere to the days of *Stepping the Heavenly Net*, practicing both in tandem to hasten celestial ascent, as the *Mysterious Dipper* repeatedly bears witness. Those who undertake both practices should first perform the Nine Dawns, then proceed to *Stepping the Heavenly Net*. Though these two methods differ in incantations, they originate from the same source.\n\n*Stepping the Heavenly Net* was once transmitted by the Lord Emperor of the Grand Tenuity to the Perfected Sovereign of the Luminous Cavern. *Stepping the Heavenly Net*, flying the earth’s纪, grasping the *Mysterious Dipper*, climbing the stellar *Kui*, connecting with the Nine Perfected, riding the flying dragon, wandering the Three Destinies, floating through the Three Lives, securing the Three Treasures, emerging from the Six Harms, concealing within the Six Yin, entering the Six纪, pacifying *Tianying*, guarding the extended term, preserving the Primordial Auxiliary, treading the Great Assistant, employing the *Flowing Cinnabar Chamber*, ascending to *Wenchang*, revolving through the Nine Paths, and attaining the rank of the Nine Elders. After twenty years of practice, one receives the scriptures and becomes a Perfected of the Highest Clarity.\n\nOrdinary people perceive the Seven Stars as near, unaware that stepping them is profoundly distant. If a Daoist knows the Heavenly Net may be stepped yet fails to ensure the hun and po follow the body, it is not that the body cannot lead the hun and po, but rather that the hun and po fear the might of the Seven Stars and dare not ascend with the body. Thus, the three hun remain uncontrolled, the seven po scatter, and one merely steps the Net with an empty corpse while the spirits do not follow—truly a futile labor.\n\nIf you wish to step the Net, purify the heart and still the mind, banish sorrow and care, and relinquish all distracting thoughts. Then, circumambulate three times, ascend the stars, and invoke the spirits, ensuring the hun and po deities together pass the Numinous Pass. Suddenly, the body becomes unbound, and one forgets oneself entirely. With utmost purity, proceed as if treading empty space. After one year, one repels misfortune; after two, one repels weapons; after three, one repels death; after four, one becomes an earthbound immortal. A thousand harms and ten thousand evils—none dare encroach. From this point onward, blessings and fortune arise without end. One commands spirits and employs numinous powers, harnessing flying dragons, receiving the *Taiyi*’s sacred fungus, and being attended by jade lads from the Jade Emperor. After thirty-four years of practice, one becomes a Perfected of the Highest Clarity.\n\nIn stepping the Net, do not traverse horizontally across the Net, for the Net is the straight line connecting the boundaries of the stars. To cross the Heavenly Net horizontally is to sever the celestial path—a grave prohibition. Furthermore, do not tread upon the stars of the Perfected—this is a great taboo. Violating either of these requires removing the headscarf, bowing, and making amends to the Net’s image. Prepare a cloth nine feet long and six feet wide, arranging the stellar positions upon it. Use blue ink for the stars and red ink for the Net, storing it in a pure box. Each time before practice, burn incense, retrieve the cloth, and be attended by seven jade maidens to guard the scriptures and seven jade lads to protect the stars. Women stepping the Net should use crimson cloth.\n\nThe Lord Emperor of the Grand Tenuity, in transmitting the scripture of *Stepping the Heavenly Net*, strictly followed the methods of the divine Perfected. First, burn incense at the practice site, hold the breath seven times, and circumambulate the Dipper’s stars three times outside, beginning at *Yin Jing* and ending at *Yang Ming*. Only then may one exhale and begin treading the Seven Stars, stepping onto *Yang Ming* with the body. Face *Yang Ming* and hold the breath while silently invoking:\n\n*\"Great *Yang Ming*, august *Wenchang* of the mysterious extreme, may my hun and po together wander the Heavenly Net.\"*\n\nAfter the invocation, step onto *Yang Ming* with the left foot, then advance the right foot to *Yin Jing*, silently invoking:\n\n*\"North Pole of *Yin Jing*, supreme *Xuanji*, may my hun and po together pass the divine ford.\"*\n\nNext, step onto the North Pole with the left foot, silently invoking:\n\n*\"Celestial radiance of the North Pole, revolving to the mysterious celestial time, may my hun and po together reach the Mysterious Pass.\"*\n\nThen, step onto *Tian Guan* with the right foot, advance the left foot to align with it, and exhale. If the great invocation is not completed before holding the breath, one may exhale above the *Dan Yuan* star and hold the breath again, softly invoking:\n\n*\"Metal, Wood, Water, Fire, Earth—\nthe Five Phases revolve.\nThe Seven Stars shine resplendently,\nthe Heavenly Net most mighty.\nThe Auxiliary Star pacifies abundance,\nthe Assistant Star repels decline.\nThe Nine Perfected and the Supreme,\n*Taiyi* and *Taiwei*,\nthe Three Treasuries and Jade Emperor,\nthe Three Honored Ones repel misfortune.\nHeaven turns, Earth revolves,\nhun and po follow.\nMay I become a flying immortal,\ntrue radiance lingering.\nMy name enters the Golden Chamber,\nthe Jade Gate opens.\nRiding the dragon, ascending the void,\nsun and moon shine together.\nWandering the Highest Clarity,\njingling bells and emerald robes.\nLeft foot treading lightning,\nright hand commanding thunder.\nTen thousand evils on earth,\nsubdued and slain, dare not pursue.\nEvil hearts gazing upon me,\nbe shattered and destroyed.\nThe Jade Emperor commands jade maidens,\nto attend and return with me.\nHun, po, spirit, and soul,\nunite in form and ascend in flight.\"*\n\nFor the reverse stepping method, halt at *Tian Guan*, face the North Pole, and softly invoke:\n\n*\"Supreme Primordial Time,\nFlorid Canopy and Purple Numinous,\nJade Chamber of the North Pole,\nconcealing radiance and transforming essence.\nMysterious Terrace of *Taiwei*,\nJade City of the Nine Perfected,\nmay I, a flying immortal,\nwander the cloud courts.\nReversing the steps of the Heavenly Net,\nhun and po both live.\nRiding the dragon to the Florid Palace,\nattaining the flower of the Way.\nLeft side bearing jade chimes,\nright waist girded with golden bells.\nTiger belt and dragon skirt,\nwhistling to command celestial soldiers.\nRiding the threefold purity,\nascending to the Highest Clarity.\"*\n\nUpon completing the invocation, hold the breath, lift the left foot to tread upon the North Pole, and the right foot upon *Danyuan*. Next, raise the left foot to tread upon *Xuanming*, then bring the right foot parallel with the left, facing the star of the Perfected One, and regulate the breath. Softly invoke:\n\n*\"Supreme Ultimate of the Nine Essences,\nHigh Perfected of the Supreme Sovereign,\nemerging to ascend Primordial Clarity,\nentering to conceal in Profound Yin.\nNurture me, [name], to love the immortal path.\nThe Jade Terrace suddenly opens,\nthe Golden Hall’s eight gates appear.\nGrant me the scripture to wear,\ncrimson dragon and azure skirt,\nto assist the Purple Tenuity,\nsage ruler of later generations.\nRiding ten flying dragons,\ndark canopy and radiant numina,\ninscribed upon the Profound Chart,\nsun and moon conjoined as one.\"*\n\nAfter the invocation, hold the breath again, tread the left foot upon the *Bixing* star, advance the right foot to *Yinjing*, then advance the left foot to *Yangming*. Bring the right foot parallel with the left, regulate the breath, and softly invoke:\n\n*\"Celestial Pivot of Upright Yang,\nthe Dipper’s revolving rise and fall.\nAdvancing, turn the Primordial Mechanism;\nretreating, move the Numinous Net.\nSubdue the *po* to bring tranquility,\nrestrain the *hun* to ensure well-being.\nHun, po, and body together\nascend to the Heavenly Hall.\nFacing the Golden Gates,\nthe Highest Supreme Sovereign,\nright hand supporting the Immortal Mother,\nleft hand supporting the Immortal Father.\nPurple kingfishers and flying blossoms,\ndragon robes and tiger skirts.\nGirded with the true scarf and jade,\na halo crowning the head.\nHolding divine bells in hand,\ngolden chimes at the waist.\nChanting the *Dongzhen* scriptures,\nthe sevenfold wondrous verses.\nFrom the Void and Primordial,\nborn to be a king,\nsoaring through the nine paths,\ngrasping the Dipper and climbing the Net.\nPreceded by the Great One,\nfollowed by the Profound Youth,\ntransmit to me the oral instructions,\nsitting in dissolution, standing in vanishing.\nThe essentials of reverse stepping,\na position as Immortal Minister.\nThe five viscera self-generated,\nwelcoming the heavens in harmony.\nMay wishes as conceived be fulfilled,\nmay all sought be prosperous.\nAll malign forces submit and harm,\nconcealed in distant lands.\nThose who hate me—heaven strikes them,\nwater extinguishes, fire perishes.\"*\n\nFor the reverse stepping method, hold the breath again, circle three times outside the Dipper’s stars, beginning at *Yangming* and ending at *Yangming*. Regulate the breath and invoke:\n\n*\"Highest Supreme Perfected,\nSeven Luminaries most revered,\nreverse stepping to seek life,\nascending to the Heavenly Origin.\nMay I, a flying immortal,\nenter the Purple Gate.\"*\n\nThen hold the breath once more, tread the left foot upon *Yangming*, the right foot upon *Yinjing*, advance the right foot to *Xuanming*, the left foot to *Danyuan*, then the right foot to the North Pole, the left foot to *Tianguan*. Bring the right foot parallel with the left, regulate the breath, and invoke:\n\n*\"Sevenfold reversal and rotation,\nascending the Jade Constellations.\nSix Eras assist me,\nThree Nets align my steps.\nThe Jade Emperor glances left,\nthe Highest Supreme looks right,\nteaching me to ride the stars,\nsoaring to ascend the Profound Path.\nGrant the boon of flying immortality,\nthe blessing of undying destiny.\nRoaming the Highest Clarity,\nriding the flowery Threefold Purity.\nGolden, azure, and kingfisher skirts,\nentering and exiting the Nine Abodes.\nThe Northern Sovereign bows in greeting,\nthe Southern Perfected offers thanks.\nName inscribed on the Immortal Terrace,\na thousand transformations, myriad changes.\nGaining the friendship of sage lords,\nassisting in the Great Peace.\nMay all wishes follow the heart,\nall affairs come to fruition.\nThose who harbor malice toward me—\nblade punishment, fire entombment.\"*\n\nHaving completed the forward, reverse, and counter-stepping methods of the three paths, lift both feet together upon the *Yangming* star. With the right hand, press the heart; with the left hand, point to the *Xuanming* star. Hold the breath for three cycles, knock the teeth twenty-one times, and swallow saliva twenty-seven times. This is called *Grasping the Dipper*.\n\nSoftly invoke:\n\n*\"Yangming of the Great Simplicity,\nestablishing the celestial mansion of the Yellow Chamber.\nWithin resides a great spirit,\nleft holding the Supreme Sovereign,\nright grasping the High Perfected.\nDragons bearing kingfisher robes,\nflying brocade with tiger patterns.\nGirded with jade talismans,\ncrowned with lotus coronets.\nEmerging from nothingness, entering the Void,\ngolden perfection and jade radiance.\nNuminous and majestic,\nnamed Yangming.\nTreading upon crimson mists,\nchanting the *Dongzhang* scriptures.\nGrant me the hidden writings,\nteach me the steps of the Net.\nContending in threefold circuits,\ngrasping the Dipper, self-forgetting.\nMay I, a flying immortal,\ntranscend the Void and traverse emptiness.\nName inscribed in the Highest Clarity,\nriding the dark dragon’s chariot.\nWherever intention leads,\nmay all desires follow.\nThe Three Honored Ones unite in harmony,\nhun and po inwardly communicate.\nSummoning divine officials,\njade maidens and jade lads.\nThose who harbor malice toward me—\npunished by lightning and wind,\ntreacherous schemes—tongues severed,\nbanished to the ten directions.\"*\n\nUpon completing the invocation, suddenly forget the self within the heart, and after a long while, descend.\n\nThe method of *Grasping the Dipper* complete, tread both feet upon the *Yinjing* star. With the left hand, press the heart; with the right hand, point to the star of the Perfected One. Hold the breath for three cycles, knock the teeth three times, and swallow saliva three times. This is called *Climbing the Pivot*.\n\nEntering the *Taiwei* Palace, softly invoke:\n\n*\"Within the Profound Simplicity of Yinjing,\nthe Flowery Gate of the Central Palace arises.\nWithin resides the Jade Emperor,\nthe North Pole most majestic.\nPhoenix-embroidered collar,\ndragon-kingfisher azure skirts.\nTiger-girded with bells,\nsupporting the vermilion mushroom coronet.\nNamed Yinjing,\nSovereign of the Supreme.\nGrant me the scripture of myriad years,\nto step the Primordial Unity,\nclimb the Pivot and ascend,\nroaming the Numinous Pass.\nExternally restraining the seven *sa*,\ninternally governing the three *hun*.\nRefining the *po* from worldly burdens,\ntreasuring the *hun* as the womb spirit.\nHun and po guard the body,\ntogether ascending as immortals,\nsoaring to the Highest Clarity,\nreturning with the countenance of an infant.\nAll intentions fulfilled,\nten thousand desires without difficulty.\nThose who harbor malice toward me—\ntheir forms perish, their palaces crumble.\nCommanding the Six Heavens,\nemploying the host of spirits.\"*\n\nThe method of *Climbing the Pivot* complete, tread both feet upon the *Bixing* star. With feet together, face the star of the Perfected One and bow four times. Kneel, hold the breath for four cycles, knock the teeth four times, and swallow saliva four times. This is called *Meeting the Perfected*.\n\nKneeling, softly invoke:\n\n*\"Supreme Ultimate of the Nine Essences,\nLuminous Perfected of the Upper Origin.\nHolding the balance of the Upright Mechanism,\nexhaling and inhaling purple mists.\nGolden light and jade radiance,\nmajesty illuminating the ten heavens.\nGoverning and guiding the Three Luminaries,\nharmonizing yang and balancing yin.\nOrdering the origin and bestowing qi,\ntransforming the old to renew.\nAbove, governing the Central Constellation,\nmystery within the Mysterious Pass.\nGolden chambers and jade portals,\nthe Northern Flank’s convenience.\nEmerging to ride the Eight Radiances,\nfloating and roaming the Great Origin.\nDragon brocade and phoenix robes,\ntiger-kingfisher flying skirts.\nCrimson banners and green sashes,\npurple feathers with sevenfold edges.\nGirded with divine talismans,\ncrowned with supporting coronets.\nAbove, perching in the Nine Voids,\nbelow, soaring in the Heavenly Abyss.\nSelf-styled Jade Sovereign,\nUltimate Perfected of the Nine Heavens.\nPitying my love of the Dao,\ngrant me the hidden scriptures.\nPersonally ascending the Pivot and Pillar,\npaying homage to the Numinous Lord.\nBeseeching the cinnabar writings,\nthe cause of life’s affinity.\nGoverning the heavens’ Three and Five,\nsoaring through the Eight Profound.\nThe five viscera self-generated,\nhighest grade of flying immortals.\nGaining the wings of the Jade Emperor,\nminister to later sages.\nRank of Grand Master,\nriding clouds and flying verification.\nMay all wishes be fulfilled,\nall malign forces kept at bay.\nThose who harbor malice toward me—\ntheir forms shattered, gates destroyed.\"*\n\nHaving completed the Way of Connecting with the Perfected, one then steps with both feet onto the Star of Profound Darkness. With the right hand placed upon the heart and the left hand pointing to the Star of Cinnabar Prime, hold the breath for three cycles, knock the teeth three times seven, and swallow saliva thrice—this is called \"Treading the Dipper.\"\n\nA whispered invocation follows:\n\"Radiance of the Grotto-Heaven,\nboundless in the Profound Darkness,\nqi fills the Great Void,\ncoming and going without form.\nHidden in heaven, concealed in earth,\npervading and irrigating the unborn,\nsuddenly ascending the Brazen Sky,\nstepping above the Purple Court.\nGazing north to the Thunder Chamber,\ngazing south to the Lightning City,\ndazzling and confounding the myriad transformations,\nno longer in their former shape.\nIn the flickering flow of light,\ntouching the hand, they instantly form.\nShould you seek to conceal yourself,\nknow my name.\nEmpty and primal, haughty and aloof,\nninefold transformations of the Profound Darkness.\nSitting and rising with the Six Jia,\nvisiting and registering with the Six Ding.\nGrant me the hidden scriptures,\nto tread the Dipper and traverse the stars.\nLooking up, I behold the Supreme Sovereign,\nrobed in cinnabar and azure,\nholding the numinous radiance in hand,\njade bells girded at the waist.\nAbove, I beseech flight as an immortal,\nto be born together with heaven.\nMy name inscribed in the Grand Tenuity,\nfloating and transforming in the Highest Clarity.\nBelow, I beseech transformation,\nto conceal my light and record my form.\nMay all affairs be as wished,\nall past grievances smoothed.\nThose who harbor malice toward me—\nslain by divine soldiers.\"\n\nThe *Golden Root Scripture of the Supreme Ultimate* states:\n\"When you ascend the Profound Darkness and tread the Dipper to conceal your form,\nshould you desire transformation,\nyou must know my name.\nRevolving heaven and moving earth,\nthe myriad things instantly take shape.\"\n\nWhen treading the Profound Darkness or desiring concealment, one must hold this name in the heart.\n\nHaving completed the Way of Treading the Dipper, one then steps with both feet onto the Star of Cinnabar Prime. With the left hand placed upon the heart and the right hand pointing to the North Star, hold the breath for three cycles, knock the teeth thrice, and swallow saliva thrice—this is called \"Treading the Guideline.\"\n\nA whispered invocation follows:\n\"Supreme Nine Terraces,\nCinnabar Prime and the Mysterious Guideline,\nexternally governing the North Star,\ninternally rectifying the heavenly principle.\nGolden Gates shine without,\nJade Court radiates within.\nAt its center dwells the Most Honored,\nstyled the Crimson Child,\ngoverning within Cinnabar Prime,\nin the Crimson Chamber.\nEmbroidered clouds of kingfisher hue,\ndragon robes and tiger skirts.\nIn the right hand, the Imperial Register;\nin the left, the Handle of the Dipper.\nFeet treading upon radiant clouds,\nhead crowned with purple coronets.\nTo the right, hanging bells;\nto the left, jade pendants.\nGrant me the hidden scriptures,\nto tread the Guideline and wander.\nAbove, I beseech flight as an immortal,\nriding the dark dragon.\nMy name inscribed in the Cinnabar Terrace,\nin the Jade Hall of the Supreme Ultimate.\nWherever I turn, wherever I seek,\nblessings and fortune come to meet me.\nThose who harbor malice toward me—\nmay they be annihilated.\nAttended by divine officials,\njade maidens and jade lads.\"\n\nHaving completed the Way of Treading the Guideline, one then steps with both feet onto the North Star. With the right hand placed upon the heart and the left hand pointing to the Celestial Pivot Star, hold the breath for three cycles, knock the teeth thrice, and swallow saliva thrice—this is called \"Treading the Net.\"\n\nA whispered invocation follows:\n\"Mysterious and supreme Grand Tenuity,\nPurple Canopy of the North Star.\nBelow dwells the Supreme Perfected,\nsoaring beyond the Nine Exteriors.\nKingfisher skirts in flight,\ngolden bells and azure sashes.\nAt the waist, a jade radiance,\ndark clouds swirling and gathering.\nGrant me the hidden scriptures,\nto ascend and traverse the Seven Qi.\nAscending the Clarity to sport in the mist,\nthe Perfected gather in assembly.\nI beseech flight as an immortal,\nmy name inscribed in the Cinnabar Chamber.\nWherever I turn, may my wishes be fulfilled,\nwithout calamity or harm.\nThose who harbor malice toward me—\nmay they suffer defeat and injury.\"\n\nHaving completed the Way of Treading the Net, one then steps with both feet onto the Celestial Pivot Star. With the right hand placed upon the heart and the left hand pointing to the Celestial Pivot, hold the breath for three cycles, knock the teeth thrice, and swallow saliva thrice—this is called \"Riding the Dragon.\"\n\nA whispered invocation follows:\n\"Supreme Seven Poles,\nPurple Tenuity beyond the stars.\nPrecious Mystery and Golden Chamber,\nwithout, the Jade Gate.\nRevolving through the Nine Palaces,\nharmonizing the Celestial Pivot.\nAt its center dwells the Honored Divinity,\nstyled the Purple Sovereign.\nGrant me the hidden scriptures,\nto carry me and ride the dragon.\nAbove, soaring through the Nine Heavens;\nbelow, flying through the Primal Earth.\nRadiant clouds and cinnabar chariots,\ndark flowers and kingfisher skirts.\nAt the waist, a dragon tally;\non the head, tiger-patterned kerchiefs.\nEncompassing the birth of the myriad things,\ninstructing and guiding the flying immortals.\nFreeing me from the name of death,\neternally preserved in heaven and earth.\nRiding the dragon and treading the Dipper,\nwherever I turn, I receive favor.\nThose who harbor malice toward me—\nwind blades and fire consume them.\"\n\nHaving completed the Way of Riding the Dragon, one then steps with both feet onto the Auxiliary Star, holds the breath for one cycle, knocks the teeth thrice, and swallows saliva once—this is called \"Wandering the Three Destinies,\" revolving and treading the Celestial Flower.\n\nA whispered invocation follows:\n\"Star of the Supreme Ultimate’s Auxiliary,\nits essence residing in the Purple Barrier.\nNurturing life and fostering destiny,\npreciously guarding the spirit-soul.\nThe Golden Chamber opens again,\nto behold the Lord of the Auxiliary.\nGrant me the hidden scriptures,\nto make me wander and revolve.\nMy name listed with the Sage Sovereign,\nflying immortal of the Nine Heavens.\nKerchief of gold and girdle of the Perfected,\nentering and exiting the Grotto-Gate.\"\n\nHaving completed Wandering the Three Destinies, one then returns to tread upon the Star of Assistance, stepping with both feet, holding the breath for one cycle, knocking the teeth thrice, and swallowing saliva once—this is called \"Pacing the Three Yangs,\" entering and exiting the Three Lives.\n\nA whispered invocation follows:\n\"Mud-Pill Palace of the Great Void,\nCelestial Honored One of the Purple Palace.\nMysterious Void and True Pivot,\nforemost of the Emperor.\nIn the Dao, the Jade Sovereign;\nin the body, the Mud-Pill.\nRiding the swift and sudden arising,\nqi piercing the Primal Empyrean.\nEssence entering the Hall of Light,\nstrengthening the embryo and benefiting the soul.\nThe Vermilion Mountain opens again,\nto draw near the Numinous Prime.\nTo the left, gathering the radiance of the sun;\nto the right, plucking the root of the moon.\nFlowing fire ten thousand fathoms,\ngolden net and azure skirts.\nAt the waist, the Celestial Bone;\non the head, the Floral Crown.\nGrant me the hidden scriptures,\nto traverse the Celestial Pivot.\nI beseech flight as an immortal,\nto command the myriad spirits.\nWherever I turn, all converges,\nfortune and virtue like mountains.\"\n\nWhen performing these practices, one faces north, holding the hidden scriptures, and acts accordingly. One may also follow the text while observing the stars, without reciting from memory.\n\n\"In spring, stepping the Seven Stars is called 'Treading the Three Principles';\nin summer, stepping the Seven Stars is called 'Following the Six Records';\nin autumn, stepping the Seven Stars is called 'Walking the Six Harms';\nin winter, stepping the Seven Stars is called 'Ascending the Six Terminations.'\nThe *Supreme Jade Scripture of the Nine Dawns’ Aerial Flight* concludes.\n\n[Note: #1 'Knocking the teeth' was originally miswritten as 'flowing teeth.'\n#2 'Right foot' was originally miswritten as 'advancing foot.'\n#3 'Auxiliary star' was originally miswritten as 'turning star.'\n#4 'Mysterious name' was originally miswritten as 'mysterious brightness.'\n#5 'Stepping the Dipper' was originally miswritten as 'stepping halfway.'\n#6 The character '毕' was originally miswritten as '车.']\"",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上飞行九晨玉经 经名：太上飞行九晨玉经。 撰人不详，约出於东晋南朝。 据《无上秘要》引文，此经原为《太上迥元九道飞行羽经》中一篇，徒分出单行。 一卷。 底本出处：《正统道藏》洞玄部玉诀类。 参校：《上清河图内玄经》、《洞真上清太微帝君步天纲飞地纪金简玉字上经》。 太上飞行九晨玉经 太上大道君告北极真公曰：吾昔璇於北天，策驾广寒，足践华盖，手排九元，逸景云宫，遨戏北玄，逍遥朔阴之馆，赏于洞毫之门，盻璇玑以召运，促劫会以舞输，叹万物之凋衰，俯天地之长存，乃觉九星之奇妙，悟斗魁之至灵也。 夫九星者，寔九天之灵根，日月之明梁，万品之渊宗也。 故天有九气，则以九星为其灵细； 地有九州，则以九星为其神主； 人有九孔，则以九星为其命府； 阴阳九宫，则以九星为其门户； 五岳四海，则以九星为其渊府。 五九参列，纲维无穷，制御天宿，回转三辰，调理四五，致天地得存，万品之所宗，神仙之所凭。 夫天无九星，则无以为高清； 地无九星，则无以为至灵； 人无九星，则九孔不明。 上帝兼之以通真，神仙凭之以得成，五行乘之以致度，万物禀之以得生也。 天清地静，则九星焕明，天激地否，则九星翳昏，璇玑召劫度之期，天关运五行之气，输空洞之大辐，促九天之应会。 是以神光转灼，玄监万生，傍行越位，以告灾祥。 天地所以有大运之交，百六应符，皆九星纬转数终，所以阴阳勃蚀，二气否激，天翻地覆，九海冥一，金玉化消，毫末不失也。 悉九星之所回，璇玑之所促。 明天地之用，玄纲之妙，得其中则有空常隐步，藏景逃形，变化三辰，万物立成。 黑点隐沦，二十五名，其趣幽微，秘不下传，上有九晨华君，中有九皇夫人，魂精魄灵，皆九斗之威神，吐焕七曜之光，流映九天之门，洞朗幽虚，无毫不彰也。 其星阳芒则为流金火铃，阴芒则为豁落七元，皆高上之灵策，元始之威章也。 龙飞尺素之诀，隐讳口口之中，列帛华晨之下，羊疡礼天以招真，则玄光曲照于盟场，九晨下降於灵宇，夫人欢悦於寝席，玄斗记名於隐书。 有知此道，存之便足以免大劫之会，度洪灾於甲申也。 修之二七年，便得晏鸿翮而腾翔，斥紫霄而升晨也。 此玉清之上道，不比上清之中仙也。 玉清则上清之高真，上清则太清之高神，太清则飞仙之高灵。 凡行玉清之道，出则诸天侍轩，给玉童玉女各三千人，建三七色之节，驾紫云飞轩十二琼轮，前导凤歌，后从玄钧，六师启路，飞龙翼辕，其位准高仙，列图玉清。 行上清之道，出则五宿侍卫，给玉童玉女各一千五百人，建紫毛之节，驾飞云丹舆，前吹凤鸾，后奏天钧，玄龙启道，五帝参轩，位准上清左右位卿。 行太清之道，出则五帝侍卫，给玉童玉女各八百人，建五色之节，驾龙舆飞烟，前啸九凤，后吹八鸾，白虬启道，太栓参轩。 故真中有高卑，玄中有阶次也。 玉清之道，玄远绝邈，不比中真及飞仙之徒。 九星上法玄映之道，吾昔受之於元始，于今七亿万劫，经天地成败，方品衰灭，而其道独存。 今犹修之於云景之上，而不能忘之於时节者，意玩此道高妙，爱乐夫人接遇也。 况来生始学飞晏之举，而不知幽寻步空之法，何由得披重霄之门，观天地之始终乎。",
      "translated_text": "*The Supreme Jade Scripture of Soaring Through the Nine Mornings*\n\nThe *Supreme Jade Scripture of Soaring Through the Nine Mornings*. Its compiler is unknown, though it likely emerged during the Eastern Jin or Southern Dynasties. According to quotations in the *Supreme Secret Essentials*, this scripture was originally a chapter within the *Supreme Scripture of the Ninefold Returning Dao of Soaring Feathered Flight*, later extracted as an independent text. It comprises one scroll. Base text from: *Daoist Canon of the Zhengtong Era*, Dongxuan Section, Jade Instructions Category. Collated with: *Inner Mystery Scripture of the River Chart of Supreme Clarity* and *Golden Simplified Jade Characters of the Heavenly Steps and Earthly Records of the Supreme Clarity Scripture of the Great Tenuity Emperor Lord*.\n\n---\n\nThe Supreme Lord of the Great Dao addressed the Perfected Duke of the Northern Pole, saying: \"In times past, I roamed the northern heavens, steering my chariot through the Vast Cold, treading upon the Florid Canopy, my hands parting the Nine Origins. I wandered the Cloud Palaces of Leisurely Radiance, sported in the Northern Mystery, roamed the chambers of the Northern Darkness, and beheld the gates of the Cavernous Millennia. Gazing upon the revolving jade pivot, I summoned the turning of kalpas; hastening the conjunction of epochs, I danced the Wheel of Offerings. Sighing at the withering of the myriad beings, I looked down upon the enduring existence of heaven and earth—thus did I perceive the marvels of the Nine Stars and awaken to the supreme numen of the Dipper’s Handle.\n\nThe Nine Stars are indeed the spiritual root of the Nine Heavens, the luminous beam of sun and moon, the abyssal origin of the ten thousand kinds. Thus, heaven possesses nine qi, and the Nine Stars are their subtle essence; earth possesses the Nine Provinces, and the Nine Stars are their divine lords; humans possess nine apertures, and the Nine Stars are their life repositories; the Nine Palaces of yin and yang have the Nine Stars as their gates; the Five Peaks and Four Seas have the Nine Stars as their abyssal courts. The Five and Nine arrayed in ranks, their guiding threads endless, they govern the celestial lodges, revolve the Three Luminaries, regulate the Four and Five, ensuring heaven and earth endure—whence the ten thousand kinds take them as their origin, and gods and immortals rely upon them.\n\nIf heaven lacked the Nine Stars, it would have no means to attain lofty purity; if earth lacked the Nine Stars, it would have no means to attain supreme numen; if humans lacked the Nine Stars, their nine apertures would remain dim. The Celestial Thearch combines them to commune with the Perfected; gods and immortals rely upon them to attain completion; the Five Phases ride them to achieve transcendence; the myriad beings receive them to attain life.\n\nWhen heaven is clear and earth tranquil, the Nine Stars shine resplendent; when heaven is agitated and earth obstructed, the Nine Stars darken and dim. The revolving pivot summons the kalpa’s appointed time; the Celestial Pass regulates the qi of the Five Phases. They convey the great axle of the Hollow Void, hastening the responsive conjunctions of the Nine Heavens. Thus does divine radiance revolve and blaze, the Dark Surveillance overseeing the myriad lives. When they traverse positions obliquely, they announce omens of fortune and calamity.\n\nIt is by the Nine Stars’ weaving and turning that heaven and earth undergo the great conjunctions of cosmic cycles, and the Hundred and Six respond to their tally. When yin and yang violently clash, the two qi obstruct and agitate, heaven overturns and earth collapses, the Nine Seas merge into darkness, gold and jade dissolve and vanish—yet not even the tip of a hair is lost. All is determined by the revolutions of the Nine Stars and the hastening of the revolving pivot.\n\nTo comprehend the workings of heaven and earth and the subtleties of the Dark Net is to attain its mean—whereupon one may tread the hidden steps of the Hollow Constant, conceal one’s radiance and elude form, transform the Three Luminaries, and instantly perfect the myriad beings. The black specks of concealment and submersion bear twenty-five names; their purport is profound and recondite, too secret to transmit below.\n\nAbove dwell the Nine Luminous Lords of the Mornings; within reside the Nine August Ladies. Their ethereal souls and numinous spirits are all the majestic deities of the Nine Dippers, exhaling the radiance of the Seven Luminaries, streaming their light through the gates of the Nine Heavens. They illumine the dark and empty, leaving no trace unmanifest.\n\nWhen their yang rays blaze, they become the Flowing Gold Fire Bells; when their yin rays gleam, they become the Vast and Falling Seven Origins—all are the numinous strategies of the Loftiest, the majestic chapters of the Primordial Beginning. The oral instructions of the Dragon-Soaring Measured Silk are concealed within the unspoken, arrayed beneath the Florid Canopy of the Mornings. When one offers the sheep’s sore to the heavens to summon the Perfected, then the Dark Radiance obliquely illumines the covenant ground, the Nine Mornings descend upon the numinous chamber, the Ladies rejoice upon their couches, and the Dark Dipper records names in the Hidden Writ.\n\nOne who knows this Dao, by merely preserving it, may escape the great kalpic conjunctions and traverse the vast calamities of the jia-shen era. Cultivating it for two times seven years, one may don the vast wings of the wild swan and soar aloft, cleaving the Purple Empyrean to ascend the mornings.\n\nThis is the supreme Dao of the Jade Clarity—it does not compare to the middling immortals of the Supreme Clarity. The Jade Clarity is the lofty Perfected of the Supreme Clarity; the Supreme Clarity is the lofty spirits of the Grand Clarity; the Grand Clarity is the lofty numina of the Flying Immortals.\n\nThose who practice the Dao of the Jade Clarity, when they emerge, have all the heavens attend their chariots, with jade lads and jade maidens—three thousand each—serving them. They bear the thirty-seven-colored standards, ride the twelve-jeweled wheels of the purple-cloud flying chariot, with phoenix songs leading the way and the Dark Zither following behind. The Six Masters clear the path, and flying dragons flank the shafts. Their rank accords with the High Immortals, arrayed in the charts of the Jade Clarity.\n\nThose who practice the Dao of the Supreme Clarity, when they emerge, have the Five Lodges as their attendants, with jade lads and jade maidens—one thousand five hundred each—serving them. They bear the purple-feathered standards, ride the flying-cloud cinnabar carriage, with phoenixes and simurghs leading the way and the Heavenly Zither played behind. Dark dragons clear the path, and the Five Thearchs attend the chariot. Their rank accords with the left and right ministers of the Supreme Clarity.\n\nThose who practice the Dao of the Grand Clarity, when they emerge, have the Five Thearchs as their attendants, with jade lads and jade maidens—eight hundred each—serving them. They bear the five-colored standards, ride the dragon carriage of flying mist, with nine phoenixes wailing ahead and eight simurghs singing behind. White hornless dragons clear the path, and the Grand Tie attend the chariot.\n\nThus, among the Perfected there are degrees of loftiness, and within the Mysterious there are gradations of rank. The Dao of the Jade Clarity is profoundly distant and utterly remote—it does not compare to the middling Perfected or the ranks of Flying Immortals.\n\nThe Nine Stars’ method of aligning with the Dark Radiance is a Dao I received from the Primordial Beginning. For seven hundred million kalpas, through the formation and dissolution of heaven and earth, the rise and fall of the myriad kinds, this Dao alone has endured. Even now, I cultivate it above the cloudy radiance, yet cannot forget it in due season—so enamored am I of this Dao’s loftiness and marvel, and so delighted in the Ladies’ company.\n\nMoreover, those who in this life first learn the soaring flight of the wild swan, yet know not the hidden art of treading the void—how shall they ever push open the gates of the layered empyreans and witness the beginning and end of heaven and earth?\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1229,
      "start_sentence": 0,
      "end_sentence": 39,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.15905022621155,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\太上飞行九晨玉经.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "既无此道，与九晨乖域，夫人绝游也。 徒有玄名帝录，超卓高腾，正可得策驾云龙，游盻五岳，但不死而已。 如此望践斗魁，旋步华晨，腾景玉清，当未有期也。 子方当匡御劫运，封掌十天科简玄录，理判神仙，宜受此法，以综万生。 今出相付，子秘而修焉。 九晨真人曰：行飞步之道，先一日沐浴斋摩，是日於中庭布星图，随斗建也。 北向长跪，烧香於玄冥星下，叩齿三十六通，闭眼存岁星在左胁，太白星在右胁，荧惑星在头上，辰星在脐下，镇星在心。 次覆衣九星，先举左手屈於头上，如斗势，存阳明星在左手掌中，阴精星在左肘上，真人弯在左乳上，玄冥星当必，故烧香於玄冥星下，而启事因心而应天明也。 丹元星在右陛上，北极星在右膝头上，天关星在右足胚上，辅星在脐下，弼星在头上。 毕，微咒曰： 衣天斗，戴金巾，乘魁刚，入斗门，朝真人，拜华晨，二十八宿，覆络我身，乘空步虚，飞升肩然。 毕，咽气九过止。 次举右手，如斗势，临头上，存阳明还右手掌中，阴精星右肘上，真人星在右乳上，玄冥星当心上，丹元星在左陛上，北极星在左膝头上，天关星在左足胚上，弼星在左月上，辅星在右目上，毕，微咒曰： 我乘天刚； 步九元，履斗魁，行飞仙，得天心，万神权，隐形藏景，变化万端，敢有干试，收系斗门，扫除不祥，正真明分，左焕火铃，右辉灵幡，威光万里，啸命立前，玉帝所咒，靡不如言。 毕，咽气十六过止。 次乘斗，旋行斗星之外，步斗魂魄。 从天枢星上对阳明，次登天璇、天玑，以次周於隐元，往反三过毕，於隐元星上歌三洞飞空章，而登阳明也。 便立思夫人形象，如左也。 第一天枢星，则阳明星之魂神也。 天枢星威而不曜，光而不照，潜洞太虚，围九百二十里，对阳明星之西北门。 其星则号元斗宫魁精玄上真皇夫人，姓明通，讳罂玄，真名上精，头建飞云华颓之髻，余发散至腰，衣紫黄青三色之裯，带九铃之绶，口恒吐青气之光，以注於肠明星上，以明星之焕也。 修飞步之道，当思夫人姓讳形象，然后咒，则魂神澄正，明星惧悦，天光洞映，使魂影俱飞登晨也。 并足上天枢星上，对阳明星，左手抚心，右手指阳明星，叩齿九通，咽液九过，闭气三息，而微咒曰： 天妃九星，凝气结真，七曜缠络，号曰玉晨，上建华盖，下蹑斗魁，身乘天机，飞步琼轩，魂精魄灵，与形合仙，保元日月，天地长存，随运变化，夫人齐连，上升九天，浮景自然。 毕，闭气三息，次左足蹑天璇，进右足与左足并，通气。 第二天璇星，则阴精星之魂神也。 天璇星景而远映，照而不焕，潜洞太虚，围五百五十里，对阴精星之西门。 其星则号玄斗宫虚精上玄皇夫人，姓玄镜，讳郁勃光，真名金归，头建飞云华颓之髻，余发散至腰，衣飞锦罗裙凤文锦被，带灵飞紫绶，口恒吐黑气之光，以注於阴精星上，以明星之晖曜也。 修飞步之道，当思夫人姓讳形像，并足上天璇星上，对阴精星，左手抚心，右手指阴精星，叩齿九通，咽液九过，闭气九息，而微咒曰： 北玄皇灵，九上开清，玉华潜映，纬络紫庭，今日飞步，万道通明，魂魄澄正，安附我形，无使飞翔，同升北星，上噏玄精，饮以玉泉，变化九微，保命天灵。",
      "translated_text": "Without this Dao, you will remain estranged from the Nine Mornings’ domain, and the Ladies’ transcendent wanderings will forever elude you. Though you may possess an illustrious name in the imperial registers, soaring high and surpassing all, you will only be able to ride cloud-dragons and roam the Five Peaks—merely avoiding death, nothing more. Thus, to tread the Dipper’s handle, circle the Flowery Morn, and ascend through the radiant jade heavens shall remain beyond your reach for ages to come.\n\nYou are now tasked with governing the kalpic tides, presiding over the celestial statutes of the Ten Heavens, and adjudicating the records of gods and immortals. It is fitting that you receive this method to guide the myriad lives. I now transmit it to you—guard it well and cultivate it in secret.\n\nThe Perfected of the Nine Mornings said: To practice the Dao of flying steps, first bathe and purify yourself a day prior. On the appointed day, lay out the star chart in the central courtyard, aligning it with the Dipper’s monthly station. Kneel facing north, burn incense beneath the Dark Radiance star, and strike your teeth thirty-six times. With eyes closed, visualize the Year Star at your left flank, the Grand White Star at your right flank, the Sparkling Deluder Star above your head, the Chronogram Star below your navel, and the Quelling Star at your heart.\n\nNext, drape your robe over the Nine Stars. First raise your left hand, bending it above your head in the Dipper’s shape. Visualize the Yang Brightness Star in your left palm, the Yin Essence Star at your left elbow, the Perfected Person at your left breast, and the Dark Radiance Star at your navel—hence the incense is burned beneath the Dark Radiance Star, so that your intentions may ascend and resonate with celestial clarity. Visualize the Cinnabar Prime Star at your right thigh, the Northern Culmen Star at your right knee, the Celestial Barrier Star at your right calf, the Auxiliary Star below your navel, and the Corrector Star above your head. When complete, softly recite the incantation:\n\n*\"I robe myself in the Celestial Dipper,\ndon a golden kerchief,\nmount the stalwart handle,\nenter the Dipper’s gate,\npay homage to the Perfected,\nbow to the Flowery Morn.\nThe twenty-eight lodgings\nenvelop my body.\nRiding the void, stepping the ethereal,\nI ascend in flight, weightless.\"*\n\nWhen finished, swallow qi nine times and stop.\n\nNext, raise your right hand in the Dipper’s shape above your head. Visualize the Yang Brightness Star returning to your right palm, the Yin Essence Star at your right elbow, the Perfected Person at your right breast, the Dark Radiance Star at your heart, the Cinnabar Prime Star at your left thigh, the Northern Culmen Star at your left knee, the Celestial Barrier Star at your left calf, the Corrector Star at your left brow, and the Auxiliary Star at your right eye. When complete, softly recite the incantation:\n\n*\"I ride the celestial stalwart,\nstep the Nine Origins,\ntread the Dipper’s handle,\npractice flying immortality,\nattain the celestial mind.\nThe myriad spirits submit,\nmy form conceals, my radiance hides,\ntransforming in myriad ways.\nShould any dare obstruct,\nbind them at the Dipper’s gate,\nsweep away misfortune,\nrectify the true and luminous.\nTo my left gleam the fire bells,\nto my right shine the numinous banners.\nMy awe-inspiring radiance spans ten thousand leagues,\nmy whistle summons all before me.\nWhat the Jade Emperor has decreed\nshall unfailingly come to pass.\"*\n\nWhen finished, swallow qi sixteen times and stop.\n\nNext, mount the Dipper and circle beyond its stars, stepping the Dipper’s hun and po. From the Celestial Pivot Star, face the Yang Brightness Star. Then ascend to the Celestial Rotation and Celestial Jade Stars, proceeding in order to the Hidden Prime Star. Circle back and forth three times, then upon the Hidden Prime Star, chant the *Three Caverns’ Flying Void Chapter* before ascending to the Yang Brightness Star.\n\nStand and visualize the Lady’s form as described earlier.\n\nThe first star, the Celestial Pivot, is the hun-spirit of the Yang Brightness Star. The Celestial Pivot’s might is unshining, its light unilluminating; it permeates the Great Void, spanning nine hundred and twenty leagues, and faces the northwest gate of the Yang Brightness Star. This star is called the *Palace of the Primordial Dipper’s Stalwart Essence, Supreme Perfected August Lady of the Nine Mornings*. Her surname is Illuminating Pervasion, her taboo name is Dark Mystery, and her true name is Supreme Essence. She wears a flying-cloud flowery topknot, her remaining hair cascading to her waist. She is clad in a three-colored robe of purple, yellow, and azure, girdled with a nine-belled sash. Her mouth constantly exhales a radiance of azure qi, which pours onto the Yang Brightness Star, brightening its brilliance.\n\nWhen practicing the flying steps, first visualize the Lady’s surname, taboo name, and form. Then recite the incantation, so that her hun-spirit may become serene and upright, the Bright Star rejoice in awe, and the celestial radiance thoroughly illuminate, allowing both hun and shadow to ascend together to the Morn.\n\nStand with feet together upon the Celestial Pivot Star, facing the Yang Brightness Star. Place your left hand over your heart, point your right hand at the Yang Brightness Star, strike your teeth nine times, swallow saliva nine times, and hold your breath for three cycles. Then softly recite the incantation:\n\n*\"Celestial Consorts of the Nine Stars,\ncongeal qi and refine the true.\nThe seven luminaries entwine,\nstyled the Jade Morn.\nAbove, they erect the flowery canopy;\nbelow, they tread the Dipper’s handle.\nTheir bodies ride the celestial mechanism,\nflying steps upon the jasper carriage.\nHun-essence and po-spirit\nunite with form to become immortal.\nPreserving the primordial sun and moon,\nheaven and earth endure forever.\nTransforming with the kalpic tides,\nthey join the Ladies in unbroken ascent,\nrising to the Nine Heavens,\nfloating radiance naturally follows.\"*\n\nWhen finished, hold your breath for three cycles. Then step with your left foot onto the Celestial Rotation Star, advance your right foot to join the left, and circulate qi.\n\nThe second star, the Celestial Rotation, is the hun-spirit of the Yin Essence Star. The Celestial Rotation’s radiance is distant yet luminous, shining yet unflickering. It permeates the Great Void, spanning five hundred and fifty leagues, and faces the west gate of the Yin Essence Star. This star is called the *Palace of the Dark Dipper’s Void Essence, Supreme Mysterious August Lady*. Her surname is Mystic Mirror, her taboo name is Seething Brilliance, and her true name is Golden Return. She wears a flying-cloud flowery topknot, her remaining hair cascading to her waist. She is clad in a flying brocade skirt and phoenix-patterned brocade cloak, girdled with a numinous flying purple sash. Her mouth constantly exhales a radiance of black qi, which pours onto the Yin Essence Star, brightening its splendor.\n\nWhen practicing the flying steps, visualize the Lady’s surname, taboo name, and form. Stand with feet together upon the Celestial Rotation Star, facing the Yin Essence Star. Place your left hand over your heart, point your right hand at the Yin Essence Star, strike your teeth nine times, swallow saliva nine times, and hold your breath for nine cycles. Then softly recite the incantation:\n\n*\"Northern Mysterious August Spirit,\nthe Nine Heavens open to clarity.\nJade splendor subtly illumines,\nweaving the Purple Court.\nToday I practice flying steps,\nthe myriad paths shine brightly.\nHun and po become serene and upright,\npeacefully attaching to my form.\nLet none take flight alone—\ntogether we ascend to the Northern Star.\nAbove, I inhale the dark essence,\ndrink the jade spring.\nTransforming through the nine subtleties,\nI preserve life and celestial numen.\"*",
      "overlap_context": "the rise and fall of the myriad kinds, this Dao alone has endured. Even now, I cultivate it above the cloudy radiance, yet cannot forget it in due season—so enamored am I of this Dao’s loftiness and marvel, and so delighted in the Ladies’ company.\n\nMoreover, those who in this life first learn the soaring flight of the wild swan, yet know not the hidden art of treading the void—how shall they ever push open the gates of the layered empyreans and witness the beginning and end of heaven and earth?\"",
      "start_char": 1229,
      "end_char": 2475,
      "start_sentence": 40,
      "end_sentence": 70,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.50111675262451,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\太上飞行九晨玉经.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "毕，闭气三息，次进左足蹑天玑星，次右足来并，通气。 第三天玑星，则真人星之魄精也。 天玑星猛而不显，晖而不曜，潜洞太虚，围七百七十里，对真人星之东南门也。 其星则号上精宫灵妃元皇夫人，姓常明，讳化云，真名流爓，头建晨婴宝冠，衣飞云明光锦，带六山飞晨之绶，口恒吐黄气之精，以注真人星上，以明星之曜也。 修飞步之道，当思夫人姓讳形象，并足上天机星上，对真人星，右手抚心，左手指真人星，叩齿九通，咽液九过，闭气十二息，而微咒曰： 灵妃元皇，九星中真，上理玑度，总监诸天，下试群方，璇景紫烟，是日上吉，黄道敷陈，润流九外，曲洒我身，飞行禹步，上入帝晨，与皇同眉，永享劫年。 毕，闭气三息，次进左足蹑天权星，进右足与左足并，通气。 第四天权星，则玄冥星之魄精也。 天权星微而隐，隐而同映，潜焕太虚，围八百里，对玄冥星之东门也。 其星则号纲极宫上灵神妃华皇夫人，姓开生，讳运明，真名婴关，头建七称之冠，衣绯罗凤文之，带金真玉光，口恒吐赤气之精，以注玄冥星上，以明星之焕曜也。 修飞步之道。 当思夫人姓讳形像，并足上天权星上，对玄冥，右手抚心，左手指玄冥，叩齿九通，咽液三过，闭气三息，而微祝曰： 神妃上灵，号曰华皇，安镇华盖，北上之宫，左侍玉女，右卫灵童，道引七精，九晖之光，为我致真，飞步天刚，使我魂魄，俱升帝堂。 毕，闭气三息，次进左足蹑玉衡，进右足与左足并，通气。 第五玉衡星，则丹元星之魂灵也。 玉衡星大而嘿，踊而不焕，潜洞太虚，围七百二十里，对丹元星东北门也。 其星则号纪明官北上金盖中皇夫人，姓元方，讳神武，真名勃，头建紫晨飞华之冠，衣九色之，带神虎玉文，口恒吐白气之光，以注丹元星上，以明星之晖也。 修飞步之道，当思夫人姓讳形象，并足上玉衡星，上对丹元星，右手抚心，左手指丹元，叩#1齿三通，咽液三过，便闭气三息，而微咒曰： 皇华中妃，上元所居，九斗吐晖，精焕八竭，流烟郁勃，散灵朱庐，使我魄灵，天地同符，形魂俱升，驾空策虚，玉光绪络，丹軿紫舆，飞行北上，参受隐书。 毕，闭气三息，次进左足蹑闿阳星，进右足与左足并，通气。 第六闱阳星，则北极星之魄灵也。 闿阳星朗而潜照，晖而不焕，洞微太虚，围七百七十里，对北极之下开北洞之门也。 其星则号紫极宫安上晨华元皇夫人，姓王元，讳根华，真名冥会，头建玉晨进贤之冠，衣飞青羽褥，带流金火铃，口恒吐绿气之精，以注北极星上，以明星之曜晖也。 修飞步之道，当思夫人姓讳形像，并足上闿阳星上，对北极星，而左手抚心，右手指北极，叩齿三通，咽液五过，闭气五息，而微咒曰： 九天上帝，黄华之宗，运转璇玑，总轮八方，使我飞步，蹑纪天纲，反覆交并，三五纵横，通灵八微，羽衣玄黄，龙舆玉景，飞行太空，长享眉寿，天地同功。 毕，闭气五息，次左足蹑摇光星，进右足并，通气。 第七摇光星，则天关星之魂太明也。 摇光星则光转空洞，回旋天关也。 潜焕太虚，围九百里，上对天关星之南门，下对北极星也。 其星则号运天宫玉华灵皇夫人，姓度元，讳终会，真名启光，头建飞华颓云之髻，余发散至腰，衣七色夜光云锦之裙，九色锦帔，九天威灵玉策，口但吐赤气之精，注天关星上，以明星之大光也。",
      "translated_text": "When finished, hold your breath for three cycles, then advance your left foot to tread upon the Celestial Mechanism Star, followed by your right foot to join it, and release your breath.\n\nThe third, the Celestial Mechanism Star, is the po-essence of the Perfected Person Star. The Celestial Mechanism Star is fierce yet not manifest, radiant yet not dazzling, subtly pervading the Great Void, spanning seven hundred and seventy li. It faces the southeast gate of the Perfected Person Star. This star is called the Palace of Supreme Essence, the Spirit Consort Yuanhuang, Lady of Primordial Augustness. Her surname is Everbright, her taboo name is Transforming Cloud, and her true name is Flowing Flame. She wears the Morning Infant Treasure Crown upon her head, a robe of luminous cloud brocade, and a sash of the Six Mountains’ Dawn Flight. Her mouth constantly exhales the essence of yellow qi, directing it upon the Perfected Person Star to illumine the star’s brilliance.\n\nWhen practicing the flying steps, visualize the Lady’s surname, taboo name, and form. Stand with feet together upon the Celestial Mechanism Star, facing the Perfected Person Star. Place your right hand over your heart, point your left hand at the Perfected Person Star, strike your teeth nine times, swallow saliva nine times, and hold your breath for twelve cycles. Then softly recite the incantation:\n\n*\"Primordial August Spirit Consort,\ntrue essence of the Nine Stars,\nabove you govern the Mechanism’s measure,\noverseeing all heavens.\nBelow you examine the myriad regions,\npurple mist swirls in the turning light.\nToday is supremely auspicious,\nthe Yellow Path unfolds.\nMoisture flows beyond the nine bounds,\ncurving to bathe my form.\nFlying in Yu’s steps,\nI ascend to the Emperor’s Dawn,\nsharing the August One’s brow,\neternally enjoying kalpas of years.\"*\n\nWhen finished, hold your breath for three cycles, then advance your left foot to tread upon the Celestial Balance Star, followed by your right foot to join it, and release your breath.\n\nThe fourth, the Celestial Balance Star, is the po-essence of the Dark Mystery Star. The Celestial Balance Star is faint and concealed, hidden yet subtly luminous, subtly shining through the Great Void, spanning eight hundred li. It faces the east gate of the Dark Mystery Star. This star is called the Palace of Fundamental Extremity, the Supreme Spirit Consort Huahuang, Lady of August Flower. Her surname is Opening Life, her taboo name is Moving Brightness, and her true name is Infant Barrier. She wears a crown of seven measures, a robe of crimson silk with phoenix patterns, and a sash of golden numen and jade light. Her mouth constantly exhales the essence of red qi, directing it upon the Dark Mystery Star to illumine the star’s radiance.\n\nWhen practicing the flying steps, visualize the Lady’s surname, taboo name, and form. Stand with feet together upon the Celestial Balance Star, facing the Dark Mystery. Place your right hand over your heart, point your left hand at the Dark Mystery, strike your teeth nine times, swallow saliva three times, and hold your breath for three cycles. Then softly recite the prayer:\n\n*\"August Spirit Consort,\nentitled Lady of Flower,\nyou pacify and guard the Flowery Canopy,\nthe Northern Supreme Palace.\nTo your left attend Jade Maidens,\nto your right guard Spirit Lads.\nYou guide the seven essences,\nradiance of the nine luminants.\nFor me, summon true power,\nflying steps upon celestial firmness.\nLet my hun and po,\ntogether ascend to the Emperor’s Hall.\"*\n\nWhen finished, hold your breath for three cycles, then advance your left foot to tread upon the Jade Balance, followed by your right foot to join it, and release your breath.\n\nThe fifth, the Jade Balance Star, is the hun-spirit of the Cinnabar Prime Star. The Jade Balance Star is vast yet silent, surging yet not resplendent, subtly pervading the Great Void, spanning seven hundred and twenty li. It faces the northeast gate of the Cinnabar Prime Star. This star is called the Palace of Recorded Brightness, the Central August Lady of the Golden Canopy in the North. Her surname is Primordial Square, her taboo name is Divine Martiality, and her true name is Sudden. She wears the Purple Dawn Flying Flower Crown upon her head, a robe of nine colors, and a sash of divine tiger jade patterns. Her mouth constantly exhales the light of white qi, directing it upon the Cinnabar Prime Star to illumine the star’s radiance.\n\nWhen practicing the flying steps, visualize the Lady’s surname, taboo name, and form. Stand with feet together upon the Jade Balance Star, facing the Cinnabar Prime. Place your right hand over your heart, point your left hand at the Cinnabar Prime, strike your teeth three times, swallow saliva three times, and hold your breath for three cycles. Then softly recite the incantation:\n\n*\"Central August Consort,\ndwelling in the Supreme Prime,\nthe Nine Ladles pour forth radiance,\nessence blazes through the eight limits.\nSwirling mist billows,\nscattering numinous crimson chambers.\nLet my po-spirit,\nharmonize with heaven and earth.\nForm and hun together ascend,\nriding the void with jade reins,\ncrimson carriage and purple chariot.\nFlying northward,\nI receive the hidden scriptures.\"*\n\nWhen finished, hold your breath for three cycles, then advance your left foot to tread upon the Open Yang Star, followed by your right foot to join it, and release your breath.\n\nThe sixth, the Open Yang Star, is the po-spirit of the Northern Culmen Star. The Open Yang Star is bright yet subtly illuminating, radiant yet not resplendent, penetrating the Great Void, spanning seven hundred and seventy li. It faces the lower opening of the Northern Culmen’s northern cavern gate. This star is called the Palace of Purple Culmen, the August Primordial Lady of Morning Flower, Anshang. Her surname is King Prime, her taboo name is Root Flower, and her true name is Dark Convergence. She wears the Jade Dawn Advancing Worthiness Crown upon her head, a robe of flying azure feathers, and a sash of flowing gold fire bells. Her mouth constantly exhales the essence of green qi, directing it upon the Northern Culmen Star to illumine the star’s radiance.\n\nWhen practicing the flying steps, visualize the Lady’s surname, taboo name, and form. Stand with feet together upon the Open Yang Star, facing the Northern Culmen. Place your left hand over your heart, point your right hand at the Northern Culmen, strike your teeth three times, swallow saliva five times, and hold your breath for five cycles. Then softly recite the incantation:\n\n*\"Emperor of the Nine Heavens,\nancestor of the Yellow Flower,\nturning the jade mechanism,\ngoverning the eight directions.\nLet my flying steps\ntread the celestial net’s records.\nReversing and intertwining,\nthree and five crosswise,\ncommuning with the eight subtleties,\nfeathered robe of mysterious yellow.\nDragon carriage and jade light,\nflying through the great void,\neternally enjoying long life,\nsharing heaven and earth’s merit.\"*\n\nWhen finished, hold your breath for five cycles, then advance your left foot to tread upon the Shaking Brilliance Star, followed by your right foot to join it, and release your breath.\n\nThe seventh, the Shaking Brilliance Star, is the great brightness of the hun-spirit of the Celestial Pass Star. The Shaking Brilliance Star’s light revolves through the empty void, circling the Celestial Pass. Subtly shining through the Great Void, it spans nine hundred li. Above, it faces the south gate of the Celestial Pass Star; below, it faces the Northern Culmen Star. This star is called the Palace of Heavenly Motion, the Jade Flower Spirit August Lady. Her surname is Measure Prime, her taboo name is Final Convergence, and her true name is Opening Light. She wears a topknot of flying flowers and crumbling clouds, her remaining hair flowing to her waist. She is clad in a seven-colored night-luminous cloud brocade skirt, a nine-colored brocade mantle, and holds the Nine Heavens’ Numinous Jade Staff. Her mouth only exhales the essence of red qi, directing it upon the Celestial Pass Star to illumine the star’s great light.",
      "overlap_context": "ftly recite the incantation:\n\n*\"Northern Mysterious August Spirit,\nthe Nine Heavens open to clarity.\nJade splendor subtly illumines,\nweaving the Purple Court.\nToday I practice flying steps,\nthe myriad paths shine brightly.\nHun and po become serene and upright,\npeacefully attaching to my form.\nLet none take flight alone—\ntogether we ascend to the Northern Star.\nAbove, I inhale the dark essence,\ndrink the jade spring.\nTransforming through the nine subtleties,\nI preserve life and celestial numen.\"*",
      "start_char": 2475,
      "end_char": 3770,
      "start_sentence": 71,
      "end_sentence": 100,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.45172381401062,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\太上飞行九晨玉经.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "修飞步之道，当思夫人姓讳形像，并足上播光星上，对天关星，而左手抚心，右手指天关，叩齿九通，咽液九过，闭气三息，而微咒曰： 天地回转，七光大明，旋输九气，上应玉清，中有夫人，号曰华灵，玄映九外，无毫不生，是日良吉，飞步紫庭，使我魂魄，安附身形，变化空洞，出幽入冥，天地同输，万劫不倾，保仙上元，九晨齐精。 毕，闭气七息，次左足蹑洞明星，进右足并，通气。 第八洞明星，则辅星之魂精阳明也。 洞明星则光回诸天，总输上宿，流畅太虚，围九百九十里，上对辅星西南门也。 在天关之上梁，北极之阳芒也。 其星则号空真宫太明常皇夫人，姓幽升，讳无韵，真名空变，头建飞云华颓之髻，余发散至腰，衣飞罗文，带九光之绶，口恒吐青气之精，注於辅星之上，以常阳大光也。 修飞步之道，当思夫人姓讳形像，并足上洞明星，上对辅星，而右手抚心，左手指输星，叩齿九通，咽液九过，闭气三息，而微呎曰： 三五飞行，天地开张，九元回纲，合纽上京，天真散灵，万道溢昌，夫人曲映，是日吉良，飞步斗魂，旋行玉纲，头戴华盖，足履常阳，璇戏三清，变化万方，保仙自然，享寿无穷。 毕，闭气十二息，次左足蹑隐元星，进右足并，通气。 第九隐元星，则弼星之魂明空灵也。 隐元星则隐息华盖之下，潜光曜於空洞之中，围九百九十里，上对弼星之东南门也。 其星则号元宝宫空玄变灵上皇夫人，姓冥通，讳万先，真名常阳，头建飞云七称玉冠，衣青文锦裯，带九光夜烛，口怛吐黑气之精，注於弼星之上，以明焕隐洞之光也。 修飞步之道，当思夫人姓讳形像，并足上隐元星上，对弼星，而左手抚心，右手指弼星，叩齿十二通，咽液一过，闭气一息，而微咒曰： 上步天纲，飞行羽门，出入三生，逃身隐沦，变化形影，千合万分，神安气镇，炼度仙魂，举体同飞，衣服锦裙，流铃交落，身佩虎文，啸咤五帝，策驾景云，上造北辰，朝谒皇君。 毕，闭气一息止，还并足上天枢星上，单步往反三周，不须复存思咒说也。 步斗魂事毕，存咒止。 初登星一过行之尔，往反三过毕，还立天枢星上，向阳明星而歌，诵徘徊游行九晨羽章三篇毕，便登纲上阳明星，上行飞步也。 羽章词如左： 云纲落天纪，九斗翠玉虚。 紫盖重霄岭，玄精朗八嵎。 上有九晨宾，吟咏隐与书。 飞步遨北汉，长龄天地居。 控辔玄羽台，飞行九元所。 洞虚深幽邃，云纲乘空举。 下有采真士，仰照玉晨府。 三周阳明上，九回入洞野。 高步登帝尊，长歌龙飞语。 玉霄映北朔，琼条翠隐柯。 空生九灵台，焕精曜太遐。 天关运重冥，劫会屡经过。 乘我羽行驾，飞步织女河。 保灵空常化，永忘天地多。 此三章，出玉清上宫，诸九阳玉童、九华玉女，皆恒歌诵之於华晨之上，以和形魂之交畅，启灵真於幽关也。 凡修飞步七元行九星之道，无此歌章，皆不得妄上天纲，足蹑玄斗也。 犯之九星则执子魂魄，闭於斗纲之下也。 令人猖狂失性，嗔怒妄兴，不出三年，无不丧身。 非道不欲使人得仙，而人不能明道渊源耳。 如此岂可不详而行焉。 九星则九天之根，玉清之明精，九魂则九星之明灵，人徒知步七星之妙，而不知九星魂魄之至灵也。",
      "translated_text": "To practice the Dao of Flying Steps, one must visualize the surname, taboo name, and form of the Lady. Stand with feet together upon the Light-Spreading Star, facing the Celestial Pass Star. Place the left hand upon the heart and point the right hand toward the Celestial Pass. Knock the teeth nine times, swallow saliva nine times, and hold the breath for three cycles. Then softly intone the incantation:\n\n*\"Heaven and Earth revolve,\nSeven lights shine brightly,\nNine qi spiral and flow,\nAbove in accord with Jade Clarity.\nWithin resides the Lady,\nNamed Flower Spirit.\nMysteriously reflecting beyond the Nine,\nNo hairbreadth remains unborn.\nThis day is most auspicious,\nFlying steps ascend the Purple Court.\nMay my hun and po\nPeacefully attach to my form,\nTransforming through the empty void,\nExiting darkness, entering obscurity.\nHeaven and Earth together revolve,\nUnshaken for ten thousand kalpas.\nPreserve immortality at Upper Primordial,\nNine Mornings unite in essence.\"*\n\nConclude by holding the breath for seven cycles. Then step with the left foot upon the Cavern-Luminous Star, advance the right foot to join it, and circulate qi.\n\nThe Eighth, the Cavern-Luminous Star, is the yang-bright essence-soul of the Auxiliary Star. The Cavern-Luminous Star’s light revolves through all heavens, gathering and conveying the upper constellations, flowing smoothly through the Great Void, spanning nine hundred and ninety li. Above, it faces the southwest gate of the Auxiliary Star. It lies upon the upper beam of the Celestial Pass, the yang radiance of the Northern Culmen. This star is called the Palace of Empty Perfection, the Ever-Bright Constant August Lady. Her surname is Dark Ascent, her taboo name is Without Rhyme, and her true name is Empty Transformation. She wears a topknot of flying clouds and crumbling flowers, her remaining hair flowing to her waist. She is clad in a flying gauze patterned robe, girded with a nine-light sash. Her mouth constantly exhales the essence of blue-green qi, directing it upon the Auxiliary Star to perpetually illumine its great yang light.\n\nTo practice the Dao of Flying Steps, one must visualize the surname, taboo name, and form of the Lady. Stand with feet together upon the Cavern-Luminous Star, facing the Auxiliary Star. Place the right hand upon the heart and point the left hand toward the Conveying Star. Knock the teeth nine times, swallow saliva nine times, and hold the breath for three cycles. Then softly intone the incantation:\n\n*\"Three and Five take flight,\nHeaven and Earth unfold.\nNine Primordials revolve the net,\nJoining and binding the Upper Capital.\nCelestial perfected scatter numinous power,\nMyriad Ways overflow in prosperity.\nThe Lady curves her reflection,\nThis day is most auspicious.\nFlying steps tread the Dipper’s soul,\nSpiraling along the Jade Net.\nHead bears the flowered canopy,\nFeet tread the Constant Yang.\nPlayfully roaming the Three Clarities,\nTransforming in ten thousand directions.\nPreserve immortality naturally,\nEnjoying boundless longevity.\"*\n\nConclude by holding the breath for twelve cycles. Then step with the left foot upon the Hidden Primordial Star, advance the right foot to join it, and circulate qi.\n\nThe Ninth, the Hidden Primordial Star, is the bright-empty numinous-soul of the Supporting Star. The Hidden Primordial Star conceals its breath beneath the flowered canopy, its subtle light shining within the empty void, spanning nine hundred and ninety li. Above, it faces the southeast gate of the Supporting Star. This star is called the Palace of Primordial Treasure, the Upper August Lady of Empty Mystery and Transformation. Her surname is Dark Pervasion, her taboo name is Myriad First, and her true name is Constant Yang. She wears a seven-tiered jade crown of flying clouds, a green-patterned brocade robe, and a nine-light night-illuminating girdle. Her mouth constantly exhales the essence of black qi, directing it upon the Supporting Star to illumine the hidden and radiant light of the cavernous void.\n\nTo practice the Dao of Flying Steps, one must visualize the surname, taboo name, and form of the Lady. Stand with feet together upon the Hidden Primordial Star, facing the Supporting Star. Place the left hand upon the heart and point the right hand toward the Supporting Star. Knock the teeth twelve times, swallow saliva once, and hold the breath for one cycle. Then softly intone the incantation:\n\n*\"Step upon the Heavenly Net,\nFlying through the Feathered Gate.\nExiting and entering the Three Lives,\nEscaping the body, concealed and submerged.\nTransforming form and shadow,\nA thousand unions, ten thousand divisions.\nSpirit pacified, qi settled,\nRefining and conveying the immortal soul.\nThe entire body ascends in flight,\nClad in brocade skirts.\nFlowing bells intertwine,\nTiger-patterned pendants adorn the body.\nRoaring and shouting at the Five Thearchs,\nWielding the reins to ride the luminous clouds.\nAscend to the Northern Culmen,\nPaying homage to the August Lord.\"*\n\nConclude by holding the breath for one cycle, then return with feet together upon the Celestial Pivot Star. Perform the single step back and forth three times; no further visualization or incantation is required. The practice of treading the Dipper’s soul is thus complete. Cease visualization and incantation.\n\nUpon first ascending a star, perform this once. After three repetitions back and forth, stand again upon the Celestial Pivot Star, facing the Yang-Bright Star, and sing the *Wandering and Roaming Nine Mornings Feathered Stanzas* three times. Then ascend the Net to the Yang-Bright Star and proceed with the Flying Steps.\n\nThe lyrics of the Feathered Stanzas are as follows:\n\n*Cloud Net descends from Heaven’s Discipline,\nNine Dippers in the emerald jade void.\nPurple canopy upon layered peaks,\nMysterious essence brightens the Eight Corners.\nAbove dwell the Nine Morning Guests,\nChanting and reciting hidden texts.\nFlying steps roam the Northern Han,\nLong life abides in Heaven and Earth.\nReining the Dark Feathered Terrace,\nFlying through the Nine Primordials’ realm.\nCavernous void, deep and secluded,\nCloud Net soars through empty space.\nBelow are the gatherers of perfection,\nGazing upward at the Jade Morning Palace.\nThree circuits upon the Yang-Bright,\nNine returns into the cavernous wilds.\nHigh steps ascend the Imperial Honored,\nLong songs in the Dragon-Flight tongue.\nJade auroras reflect the Northern Wastes,\nJasper branches with emerald hidden boughs.\nEmpty birth in the Nine Numinous Terrace,\nRadiant essence shines through the Great Distant.\nCelestial Pass revolves through layered darkness,\nKalpas and meetings repeatedly pass.\nRiding my feathered chariot,\nFlying steps weave the Weaving Maid’s River.\nPreserve the numinous in empty constancy,\nForever forgetting Heaven and Earth’s excess.*\n\nThese three stanzas originate from the Jade Clarity Upper Palace. All the Nine Yang Jade Lads and Nine Flower Jade Maidens perpetually sing them upon the Flowered Morning to harmonize the exchange of form and soul and awaken the numinous perfected at the hidden pass.\n\nIn practicing the Dao of Flying Steps through the Seven Primordials and treading the Nine Stars, without these song-stanzas, one must not rashly ascend the Heavenly Net or tread the Dark Dipper. Violating this, the Nine Stars will seize one’s hun and po, confining them beneath the Dipper’s Net. This causes people to become wild and lose their nature, anger and delusion arising recklessly. Within three years, none will escape bodily death. It is not that the Dao does not wish for people to attain immortality, but rather that people cannot fathom the Dao’s profound source. How could one not proceed with care?\n\nThe Nine Stars are the roots of the Nine Heavens, the bright essence of Jade Clarity. The Nine Souls are the luminous numina of the Nine Stars. People merely know the wonders of treading the Seven Stars but remain ignorant of the supreme numinosity of the Nine Stars’ hun and po.",
      "overlap_context": "lower Spirit August Lady. Her surname is Measure Prime, her taboo name is Final Convergence, and her true name is Opening Light. She wears a topknot of flying flowers and crumbling clouds, her remaining hair flowing to her waist. She is clad in a seven-colored night-luminous cloud brocade skirt, a nine-colored brocade mantle, and holds the Nine Heavens’ Numinous Jade Staff. Her mouth only exhales the essence of red qi, directing it upon the Celestial Pass Star to illumine the star’s great light.",
      "start_char": 3770,
      "end_char": 5009,
      "start_sentence": 101,
      "end_sentence": 140,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.611055850982666,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\太上飞行九晨玉经.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "非七星不欲运人上斗，而人身魂神畏斗星之灵魄，不敢随人而腾空也。 欲修飞步之道，宜知斗星之魂魄，九皇夫人内名空常之隐诀也。 而按图修行，岂当不得飞登北元，上谒华晨者哉。 但此道高妙，玉清宝秘不行，中仙鲜有得者。 知其法则九星内映，夫人降席，斗魂感悦，则共拥兆而升入九元之内宫。 阳明星，天之太尉，司政主非，上总九天上真，中监五岳飞仙，下领后学真人，天地神灵功过轻重，莫不隶焉。 星围九百二十里，皆琉璃水晶，中有玉树青实，金翅之乌栖宿其上，自生青精玉芝，食之一口，寿九万年。 星有九门，有四光芒，皆焖照九亿万里中，上有青城玉楼据斗真人，号曰太上宫青城玉楼九晨君，姓上云，讳法婴容，字董洞阳摇天槌。 头建九晨玉冠，衣青羽飞裳，手执斗中玄图，坐玉楼之中。 有玄名玉录，当得知九晨君内讳。 知者玉晨下映，明星玄降，修其道飞行太空，升入九门之内也。 修飞步之道，当先於阳明星上，右手抚心，左手指天东北，闭气九息，叩齿九通，咽液三过，闭眼思九晨君姓讳形像，留立阳明星上，便微祝曰： 飞天九晨，上据玄魁，威振八焕，司政纠非，今日飞步，万道通开，九真齐景，天转地回，鬼谋戮颈，人逆斩摧，三纲所捕，逆者将衰，神灵侍卫，享福巍巍，得天之心，骨化形飞，手攀七纲，足践九扉，云行雨步，上升太微。 毕，左转阳明星上九回，立向鬼门，闭气三息，转左足蹑阴精，进右足并於阴精星上，通气。 阴精星，天之上宰，主禄位，上总天宿，下领万灵及学仙之人，诸学道及兆民宿命禄位，莫不隶焉。 ．星围五百五十里，亦皆琉璃水精，中有玉树黑实，金翅之所栖，自生玄芝玉饴，食之一口，得寿五万年。 星有五门，门有四光芒，焖照九亿万里中，上有五色玉楼攀魁真人，号曰中元宫五色玉楼北上晨君，姓育婴，讳玄上贫，字昌阳文激明光。 头建玄精玉冠，衣玄羽飞裳，手执五色羽节，坐玉楼之中。 若有玄名 朱台，当得知上晨君内讳，知者则北上下映，阴精玄降，修行其道，则飞行太空，升入五门之内也。 修飞步之道，当先於阴．精星上，左手指本命，右手抚心，闭气五息，叩齿五通，咽液五过，闭目思北上晨君讳字形像，留立阴精星上，便微咒曰： 玄晨北灵，五气上精，体隐六纪，心藏景星，日月侠映，三光饬形，今日元吉，步纲紫庭，上开天户，受福朱灵，享祚无极，禄位尊荣，万愿交覆，所向利贞，腾飞华盖，遨翔玉清，上诣北晨，九真齐軿。 毕，左转阴精星上五回，向本命上立，闭气三通，转左足蹑弼星，进右足并，通气。 不得蹑真人星，但蹑弼星耳。 真人星，天之司空，主神仙，上总九天高真，中监五岳灵仙，下领学道之人，真仙之流，莫不隶焉。 星围七百七十里，亦皆瑠璃水精，中有玉树黄实，金翅之所栖，自生黄精玉芝，食之一口，得寿三千万岁。 星有十二门，门有四光芒，烂照九亿万里中，上有黄台玉楼真人，号日真元宫中黄台玉楼主仙华晨君，姓归，讳妙阴光，字通度元度凝脂。 头建飞晨宝冠，衣青羽飞裳，手执斗中青箓，坐玉楼之中，若有玄名方诸，当得知华晨君内讳，知者则华晨下映，真人玄降。",
      "translated_text": "It is not that the Seven Stars do not wish to convey people to the Dipper, but rather that the hun, po, and spirit of the human body fear the numinous power of the Dipper’s stars and dare not ascend with them into the void. Those who wish to cultivate the Way of Flying Steps must know the hun and po of the Dipper Stars—the hidden esoteric instructions of the Nine August Ladies’ inner names and the Perpetual Void.\n\nBy practicing according to the chart, how could one fail to ascend the Northern Prime and pay homage above to the Radiant Dawn? Yet this Way is lofty and wondrous, a treasured secret of Jade Clarity not readily transmitted; few among the middle immortals have attained it. Those who know its method will see the Nine Stars inwardly illumine, the Ladies descend from their thrones, and the Dipper’s hun rejoice—together they will escort the practitioner into the inner palace of the Nine Primes.\n\nThe Yang Bright Star is Heaven’s Grand Commandant, governing transgressions and overseeing all matters. Above, it presides over the perfected of the Nine Heavens; in the middle, it supervises the flying immortals of the Five Peaks; below, it leads the true persons of later learners. The merits and faults of gods and spirits, the weight of their deeds—none are beyond its jurisdiction. The star spans nine hundred and twenty miles, its expanse all lapis lazuli and crystal. Within it stand jade trees bearing azure fruit, where golden-winged ravens roost. Spontaneously growing there are azure essence jade mushrooms; consuming a single mouthful grants a lifespan of ninety thousand years. The star has nine gates, each radiating four beams of light that silently illuminate nine hundred million miles. Above it stands the Azure City Jade Tower, where the Perfected of the Dipper resides, known as the Supreme Palace Azure City Jade Tower Nine Mornings Lord. His surname is Shangyun, his taboo name Fayingrong, and his style Dongdongyang Yaotianchui. He wears a Nine Mornings Jade Crown, robes of azure feathered flight, and holds the Mysterious Chart of the Dipper in his hands, seated within the Jade Tower. There exists a register of esoteric names, the Jade Record; one must know the Nine Mornings Lord’s inner taboo name. Those who know it will see the Jade Dawn inwardly illumine and the Mysterious Star descend in darkness. Cultivating this Way, one may soar through the Great Void and ascend into the Nine Gates.\n\nTo practice the Way of Flying Steps, first stand upon the Yang Bright Star. Press the right hand to the heart, point the left hand toward the northeast, hold the breath for nine cycles, click the teeth nine times, swallow saliva three times, and with eyes closed, visualize the Nine Mornings Lord’s surname, taboo name, and form. Remaining upon the Yang Bright Star, softly intone the incantation:\n\n*\"Flying Heaven’s Nine Mornings, above you occupy the Mysterious Chief,\nYour might shakes the Eight Radiants, governing transgressions and rectifying wrongs.\nToday I take the Flying Steps, ten thousand Ways open wide,\nNine Perfected align in splendor, heaven turns and earth revolves.\nGhostly schemes—necks severed; human rebels—crushed and felled.\nThe Three Bonds seize the wayward, the rebellious shall decline.\nDivine spirits attend and guard, bestowing towering fortune.\nGaining Heaven’s heart, bones transform and form takes flight,\nHands grasp the Seven Nets, feet tread the Nine Gates.\nCloud-walking, rain-stepping, ascending to the Supreme Microcosm.\"*\n\nWhen finished, turn left upon the Yang Bright Star nine times, then stand facing the Ghost Gate. Hold the breath for three cycles, step with the left foot onto the Yin Essence Star, advance the right foot to join it, and release the breath.\n\nThe Yin Essence Star is Heaven’s Grand Minister, governing official rank and destiny. Above, it presides over the celestial lodges; below, it leads the myriad spirits and those who study immortality. The fate and rank of all who cultivate the Way and of the common people—none are beyond its jurisdiction. The star spans five hundred and fifty miles, its expanse also lapis lazuli and crystal. Within it stand jade trees bearing black fruit, where golden-winged ravens roost. Spontaneously growing there are mysterious mushrooms and jade nectar; consuming a single mouthful grants a lifespan of fifty thousand years. The star has five gates, each radiating four beams of light that silently illuminate nine hundred million miles. Above it stands the Five-Colored Jade Tower, where the Perfected of the Dipper’s Handle resides, known as the Middle Prime Palace Five-Colored Jade Tower Northern Supreme Morning Lord. His surname is Yuying, his taboo name Xuan Shangpin, and his style Changyang Wenjimingguang. He wears a Mysterious Essence Jade Crown, robes of dark feathered flight, and holds a five-colored feathered tally in his hands, seated within the Jade Tower. There exists a register of esoteric names, the Vermilion Terrace; one must know the Northern Supreme Lord’s inner taboo name. Those who know it will see the Northern Supreme inwardly illumine and the Yin Essence descend in darkness. Cultivating this Way, one may soar through the Great Void and ascend into the Five Gates.\n\nTo practice the Way of Flying Steps, first stand upon the Yin Essence Star. Point the left hand toward your life-destiny star, press the right hand to the heart, hold the breath for five cycles, click the teeth five times, swallow saliva five times, and with eyes closed, visualize the Northern Supreme Morning Lord’s taboo name, style, and form. Remaining upon the Yin Essence Star, softly intone the incantation:\n\n*\"Mysterious Morning of the Northern Spirit, quintessence of the Five Qi,\nYour form conceals the Six Records, your heart stores the Radiant Star.\nSun and moon flank and illumine, the Three Lights adorn your form.\nToday is supremely auspicious, stepping the Nets of the Purple Court.\nAbove, the Heavenly Gates open, receiving the fortune of the Vermilion Spirit.\nEndless blessings and honor, exalted rank and glory,\nTen thousand wishes fulfilled, all directions propitious.\nSoaring beneath the Flowery Canopy, roaming the Jade Clarity,\nAscending to the Northern Morning, the Nine Perfected align in procession.\"*\n\nWhen finished, turn left upon the Yin Essence Star five times, then stand facing your life-destiny star. Hold the breath for three cycles, step with the left foot onto the Assistant Star, advance the right foot to join it, and release the breath. Do not tread upon the Perfected Person Star—step only upon the Assistant Star.\n\nThe Perfected Person Star is Heaven’s Minister of Works, governing divine immortals. Above, it presides over the lofty perfected of the Nine Heavens; in the middle, it supervises the numinous immortals of the Five Peaks; below, it leads those who study the Way and the lineage of true immortals—none are beyond its jurisdiction. The star spans seven hundred and seventy miles, its expanse also lapis lazuli and crystal. Within it stand jade trees bearing yellow fruit, where golden-winged ravens roost. Spontaneously growing there are yellow essence jade mushrooms; consuming a single mouthful grants a lifespan of thirty million years. The star has twelve gates, each radiating four beams of light that brilliantly illuminate nine hundred million miles. Above it stands the Yellow Terrace Jade Tower, where the Perfected resides, known as the True Prime Palace Central Yellow Terrace Jade Tower Lord of the Radiant Dawn. His surname is Guixi, his taboo name Miaoyinguang, and his style Tongdu Yuandu Ningzhi. He wears a Flying Morning Treasure Crown, robes of azure feathered flight, and holds the Azure Register of the Dipper in his hands, seated within the Jade Tower. There exists a register of esoteric names, the Square Cauldron; one must know the Radiant Dawn Lord’s inner taboo name. Those who know it will see the Radiant Dawn inwardly illumine and the Perfected descend in darkness.",
      "overlap_context": "hin three years, none will escape bodily death. It is not that the Dao does not wish for people to attain immortality, but rather that people cannot fathom the Dao’s profound source. How could one not proceed with care?\n\nThe Nine Stars are the roots of the Nine Heavens, the bright essence of Jade Clarity. The Nine Souls are the luminous numina of the Nine Stars. People merely know the wonders of treading the Seven Stars but remain ignorant of the supreme numinosity of the Nine Stars’ hun and po.",
      "start_char": 5009,
      "end_char": 6229,
      "start_sentence": 141,
      "end_sentence": 168,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.29790163040161,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\太上飞行九晨玉经.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "修行其道，则飞行太空，升入十二册之内也。 修飞步之道，皆不得蹑真人星也，当并足弼星上，所谓偃息华盖者也。 北老真公曰：子欲腾身，勿干真人，子欲飞行，勿枉天纲，子欲神仙，当拜华晨。 行道当避真人星，立弼星之上，拜真人，朝华晨，而求飞空也。 弼星曰空，辅星日常。 常者常阳，空者隐藏，其有讳，不得传於人口。 可於华晨之下，羊鸦礼天，裂素盟而传，得此秘讳，心存而行之，轻泄七祖负考风刀也。 当於弼星上，右手抚心，左手指西北，闭气九息，叩齿九通，咽液九过，闭眼思主仙华晨君姓讳形像，留立真人星上，便微咒曰： 太微通真，弼辅华晨，吐焕九精，结气紫烟，飞霞流映，光曜十天，上理元衡，下拥神仙，今日飞步，请礼真人，, 一求空行，二乞隐身，三愿上升北掖，四便龙衣啊服，锦帔青裙，驾乘八景，浮游九玄，得入天宿，与帝同轩。 毕，左回弼星七过，向真人，闭气三息，转左足蹑玄冥，进右#2足并，通气。 玄冥星，天之游击，主伐逆，上总九天鬼神，中领北帝三官，下监万兆，伐逆不臣，诸以凶勃，莫不隶焉。 星围八百里，亦皆瑠璃水精，中有玉树赤实，金翅之所栖，自生丹芝流瑛，食之一口，得寿八千万年。 星有三门，门有四光芒，焖照九亿万里中，上有朱台玉楼出斗真人，号曰纽幽宫中朱台玉楼玄上飞盖晨君，姓冥枢，讳定宣觉，字法明度播天柱。 头建三华宝晨冠，衣丹锦飞裳，手执命灵之节，坐玉楼之中。 若有玄名玉格，当得知飞盖晨君内讳，知者则飞盖下映，玄冥玄降，修行其道，则飞行太空，升入三门之内也。 修飞步之道，当先於玄冥星上，右手抚心，左手指天，闭气九息，叩齿三通，咽液三过，闭眼思飞盖晨君姓讳形像，留立玄冥星上，便微咒曰： 天真行道，步景藏形，七元焕落，九晨齐并，手把天衡，足践飞星，左辅火甲，右御朱兵，威振十天，流焕上清，先戮谋议，后伐妖精，敢有干正，斩以刀刑，三纲所制，莫不伏听，变化往反，适心华庭，乘空飞步，上造帝灵。 毕，左回三转，向天闭气三息，转左足践丹元星，进右足并，通气。 丹元星，天之斗君，主命录籍，上总九天谱箓，中统鬼神部目，下领学真兆民命籍，诸天诸地，莫不总统。 星围七百二十里，亦皆瑠璃水精，中有赤树白实，金翅之所栖，自生金精冶炼之膏，食之一口，得寿七万年。 星有七门，门有四光芒，焖照九亿万里中，上有素台金楼蹑纪真人，号曰纲神宫中素台金楼蹑纪真人金魁七晨君，姓上开，讳冥通光，字朱焕元变五道。 头建七宝飞天冠，衣白锦飞裙，手执青元箓籍，坐金楼之中。 若有玄名昆台，当得知七晨君内讳，知者则七晨下映，丹元玄降，修行其道，则飞行太空，升入七门之内也。 修飞步之道，当先於丹元星上，右手抚心，左手指天关，闭气七息，叩齿三通，咽液三过，闭眼思七晨君姓讳形像，留立丹元星上，便微祝曰： 飞行蹑纪，上步丹元，乘魁落宿，呼命斗魂，削死勒生，青白简分，三合成道，年命长延，享利眉寿，齐生华晨，肉飞骨轻，驾景乘云，仙衣羽服，流铃纷纷，五色焕惧，升入七门。 毕，回星上七转，还向天关，闭气七息，转左足践北极，进右足并，通气。",
      "translated_text": "To cultivate this Dao is to soar through the Great Void and ascend into the Twelve Registers. In practicing the Dao of Flying Steps, one must not tread upon the star of the Perfected; instead, stand with feet together upon the Adjuvant Star—this is what is called \"reclining beneath the Flowering Canopy.\"\n\nThe Northern Elder Perfected Lord said: If you wish to ascend bodily, do not offend the Perfected; if you wish to fly, do not transgress the Celestial Net; if you seek immortality, you must pay homage to the Radiant Dawn. When performing the Dao, avoid the Perfected’s star and stand upon the Adjuvant Star, bow to the Perfected, and pay court to the Radiant Dawn to seek flight through the void.\n\nThe Adjuvant Star is called \"Void,\" and the Auxiliary Star is called \"Constant.\" \"Constant\" is the eternal yang; \"Void\" is concealment. It bears a taboo name that must not be spoken aloud. It may only be transmitted beneath the Radiant Dawn through the Rite of the Sheep and Crow, pledging upon torn silk. Should one obtain this secret taboo and hold it in the heart while practicing, to leak it lightly would bring the Wind Blade of Punishment upon one’s seven generations of ancestors.\n\nStanding upon the Adjuvant Star, place the right hand over the heart, point the left hand toward the northwest, hold the breath for nine cycles, click the teeth nine times, swallow saliva nine times, and with eyes closed, visualize the Radiant Dawn Lord’s surname, taboo name, and form. Remain standing upon the Perfected’s star and softly recite the incantation:\n\n*\"Great Subtlety connects to the True,\nAdjuvant aids the Radiant Dawn.\nExhaling the radiance of ninefold essence,\nGathering qi into purple mist,\nFlying auroras stream and reflect,\nIlluminating the Ten Heavens.\nAbove, it governs the Primal Balance;\nBelow, it embraces the divine immortals.\nToday, in flying steps,\nI pay homage to the Perfected.\nFirst, I seek void-travel;\nSecond, I beg for concealment of form;\nThird, I wish to ascend to the Northern Portal;\nFourth, I desire the Dragon Robe and azure sash,\nBroidered mantle and green skirt,\nTo ride the Eight Effulgences,\nRoam the Nine Mysteries,\nEnter the celestial lodgings,\nAnd share the Emperor’s chariot.\"*\n\nWhen finished, circle the Adjuvant Star seven times to the left, face the Perfected, hold the breath for three cycles, step with the left foot upon the Mysterious Darkness, advance the right foot to join it, and release the breath.\n\nThe Mysterious Darkness Star is the Celestial Vanguard, master of punishing rebellion. Above, it commands the ghostly spirits of the Nine Heavens; in the middle, it oversees the Three Offices of the Northern Emperor; below, it surveils the myriad multitudes, punishing rebellion and disobedience. All who harbor malevolent intent are subject to its jurisdiction. The star spans eight hundred miles, its substance like lapis lazuli and crystal. Within it grows a jade tree bearing crimson fruit, where golden-winged birds alight. Spontaneously arising cinnabar mushrooms and flowing jade-essence grant a lifespan of eighty million years upon consuming a single mouthful. The star has three gates, each radiating four beams of light that glow fiercely for nine hundred million miles. Above it stands the Vermilion Terrace Jade Tower, where the Perfected of the Dipper emerges—known as the Vermilion Terrace Jade Tower Dark Prime Flying Canopy Radiant Dawn Lord of the Central Secluded Palace. His surname is Dark Pivot, his taboo name Fixed Proclamation of Awareness, and his style Dharma Brightness Spreading the Celestial Pillar. He wears a Three-Flowered Treasure Dawn Crown, robes of cinnabar brocade flight, and holds the Life-Spirit Staff in his hands, seated within the Jade Tower. Should there be a register of esoteric names, the Jade Tablet, one must know the Flying Canopy Lord’s inner taboo name. Those who know it will see the Flying Canopy inwardly illumine and the Mysterious Darkness descend in darkness. To cultivate this Dao is to soar through the Great Void and ascend into the Three Gates.\n\nWhen practicing the Dao of Flying Steps, first stand upon the Mysterious Darkness Star, place the right hand over the heart, point the left hand toward the heavens, hold the breath for nine cycles, click the teeth three times, swallow saliva three times, and with eyes closed, visualize the Flying Canopy Lord’s surname, taboo name, and form. Remain standing upon the Mysterious Darkness Star and softly recite the incantation:\n\n*\"Celestial Perfected walk the Dao,\nTreading upon luminous traces to conceal form.\nThe Seven Origins gleam and scatter;\nThe Nine Dawns unite as one.\nHand grasping the Celestial Balance,\nFeet treading the Flying Star,\nLeft, the Fire Marshal assists;\nRight, the Vermilion Soldiers command.\nMight shakes the Ten Heavens,\nRadiance streams into the Highest Clarity.\nFirst, slay the schemers;\nThen, punish the demonic essences.\nWhoever dares oppose the upright\nShall be severed by the Blade Punishment.\nAll subject to the Three Principles\nMust submit and obey.\nTransforming and traversing,\nProceeding to the Flowering Court as the heart desires,\nRiding the void in flying steps,\nAscending to the Emperor’s numinous presence.\"*\n\nWhen finished, circle three times to the left, face the heavens, hold the breath for three cycles, step with the left foot upon the Cinnabar Prime Star, advance the right foot to join it, and release the breath.\n\nThe Cinnabar Prime Star is the Dipper Sovereign of Heaven, master of the Registers of Destiny. Above, it governs the celestial records of the Nine Heavens; in the middle, it oversees the departments of ghosts and spirits; below, it presides over the destiny registers of those who study the True. All in the heavens and upon the earth are subject to its governance. The star spans seven hundred and twenty miles, its substance like lapis lazuli and crystal. Within it grows a crimson tree bearing white fruit, where golden-winged birds alight. Spontaneously arising golden essence and refined elixir grant a lifespan of seventy thousand years upon consuming a single mouthful. The star has seven gates, each radiating four beams of light that glow fiercely for nine hundred million miles. Above it stands the Plain Terrace Golden Tower, where the Perfected of the Treading Cycle resides—known as the Plain Terrace Golden Tower Treading Cycle Perfected of the Principle-Spirit Palace, the Golden Chief of the Seven Dawns. His surname is Supreme Opening, his taboo name Dark Illumination of Light, and his style Vermilion Radiance of Primordial Transformation and Five Paths. He wears a Seven-Treasure Flying Heaven Crown, robes of white brocade flight, and holds the Azure Prime Register in his hands, seated within the Golden Tower. Should there be a register of esoteric names, the Kun Terrace, one must know the Seven Dawns Lord’s inner taboo name. Those who know it will see the Seven Dawns inwardly illumine and the Cinnabar Prime descend in darkness. To cultivate this Dao is to soar through the Great Void and ascend into the Seven Gates.\n\nWhen practicing the Dao of Flying Steps, first stand upon the Cinnabar Prime Star, place the right hand over the heart, point the left hand toward the Celestial Pass, hold the breath for seven cycles, click the teeth three times, swallow saliva three times, and with eyes closed, visualize the Seven Dawns Lord’s surname, taboo name, and form. Remain standing upon the Cinnabar Prime Star and softly recite the invocation:\n\n*\"Flying steps tread the cycle,\nAscending the Cinnabar Prime.\nRiding the Chief and falling lodgings,\nSummoning the Dipper’s soul,\nErasing death and commanding life,\nSeparating the azure and white tallies.\nThe Three Harmonies complete the Dao,\nExtending years and destiny,\nEnjoying blessings and long life,\nEqual to the Radiant Dawn’s bloom.\nFlesh flies, bones grow light,\nRiding luminous traces and mounting clouds.\nImmortal robes and feathered garments,\nTinkling pendants in profusion,\nFive colors gleaming and resplendent,\nAscending into the Seven Gates.\"*\n\nWhen finished, circle the star seven times, return to face the Celestial Pass, hold the breath for seven cycles, step with the left foot upon the Northern Culmen, advance the right foot to join it, and release the breath.",
      "overlap_context": "wer Lord of the Radiant Dawn. His surname is Guixi, his taboo name Miaoyinguang, and his style Tongdu Yuandu Ningzhi. He wears a Flying Morning Treasure Crown, robes of azure feathered flight, and holds the Azure Register of the Dipper in his hands, seated within the Jade Tower. There exists a register of esoteric names, the Square Cauldron; one must know the Radiant Dawn Lord’s inner taboo name. Those who know it will see the Radiant Dawn inwardly illumine and the Perfected descend in darkness.",
      "start_char": 6229,
      "end_char": 7463,
      "start_sentence": 169,
      "end_sentence": 194,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.88628959655762,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\太上飞行九晨玉经.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "北极星，天之太常，主升进，上总九天真，中统五岳飞仙，下领学者之身，凡功勤得道，转轮阶级，悉总之焉。 星围七百七十里，亦皆瑠璃水精，中有黑树白子，金翅之所栖，自生玄芝水瑛，食之一口，得寿五万年。 星有八门，门有四光芒，爓照九亿万里中，上有玄台玉楼步纲真人，号曰纪明宫中玄台玉楼北晨飞华君，姓明灵，讳长明化，字渊源源昌上元。 头建飞精华冠，衣紫锦飞裳，手执九斗玉策，坐玉楼之中。 若有玄名金台，当得知飞华君内讳，知者则飞华下映，北极玄降修行其道，则飞行太空，上升八门之内也。 修飞步之道，当先於北极星上，右手抚心，左手指金门，闭气八息，叩齿三通，咽液三过，闭目思飞华君姓讳形像，叩齿，立北极上，便微咒曰： 天行三五，中元回旋，飞步华盖，御斗乘晨，落纪三命，徘徊游烟，今日元吉，上希神仙，名书玉简，刊字紫篇，青襦羽服，丹帔锦裙，八景丹舆，运我升轩，位为仙卿，北上之君，请求所咒，靡不如言。 毕，回星上八转，还向西方，闭气八息，转左足践天关，进右足并，通气。 天关星，天之上帝，主天地机运，如四时长养，天地否泰劫会，莫不隶焉。 星围九百里，亦皆瑠璃水精，中有三华之树，五色之实，金翅之所栖，生自然九味芝膏，服之一口，身生九色之光，得寿九万年。 星有一门，门有九光芒，总运九天之气，爓照九亿万里中，上有九层玉楼乘龙真人，号曰开会宫九层玉楼总云九元北盖晨君，姓玄枢，讳转光，字会元终明天徒。 头建九元宝冠，衣九色锦裳，手执晖神之章，坐玉楼之中。 若有玄名九天帝图玉箓，当得知北盖晨君内讳，知者则北盖君下映，天关玄降，修行其道，飞行太虚，升入一门之内也。 修飞步之道，当於天关星上，左手抚心，右手指地户，闭气一息，叩齿三通，咽液三过，闭眼思北盖晨君姓讳形像，留立天关星上，便咒曰： 天元运关，地纪转维，九灵交度，三五相推，四七幡宿，五帝徘徊，承玄步虚，上蹑玉机，衣斗履斗，流铃焕威，顺我者吉，逆我者衰，我行天真，万里廓开，身腾苍饼，魂升形飞，长离劫会，升入太微。 毕，回星上一转，还向地户，闭气一息，转左足践辅#3星，进右足并，通气。 辅星，天尊玉帝之星也，曰常。 常者常阳，主飞仙，上总九天，下领九地，五岳四渍神仙之官，悉由之焉。 星围九百九十里，亦皆瑠璃水精，中有青华之树，自有九音之字，上有青乌三足乌，生自然琉璃芝瑛，食之一口，得与玉帝同真。 星有八门，交通八气，门有四光芒，爓照九天之上，中有紫气玉楼游行三命真人，号曰帝席宫中紫气玉楼帝尊九晨君，姓精常，讳常无瓷，字玄解子空正上开延。 头建飞精玉冠，衣九色衣，手执火铃，坐玉楼之中。 若有玄名上清，得知帝尊内讳，知者则帝尊下映，辅星玄降，修行其道，飞行太空，升入八门之内也。 修飞步之道，当於辅星上，右手抚心，左手指荧惑星，闭气三息，叩齿三通，咽液三过，闭眼思帝尊姓讳形像，留立辅星上，便微咒曰： 乾坤交覆，三命接灵，上步天宿，飞行九星，左把隐书，右执羽经，拜谒帝尊，受帝之名，得越华盖，腾翔紫庭，今日行道，万庆交并，受福巍巍，永享长生，身变毛羽，飞升上清。",
      "translated_text": "The Northern Culmen Star is the Grand Standard of Heaven, governing ascent and advancement. Above, it oversees the Perfected of the Nine Heavens; at the center, it commands the Flying Immortals of the Five Peaks; below, it presides over the bodies of scholars. All meritorious efforts and attainments of the Dao, the turning of the wheel and the stages of ascent, are wholly encompassed therein. The star spans seven hundred and seventy *li*, its substance like lapis lazuli and crystal. At its heart stands a black tree with white fruit, where the Golden-Winged One roosts. There grow spontaneously dark mushrooms and water-jade; consuming a single mouthful grants a lifespan of fifty thousand years.\n\nThe star has eight gates, each with four rays of light that illumine nine hundred million *li*. Above stands the Dark Terrace and Jade Tower, where the Master of the Step-Net resides, known as the Lord of Flying Radiance of the Dark Terrace and Jade Tower within the Palace of Cyclic Brightness. His surname is Bright Numinous, his personal name is Long Bright Transformation, and his courtesy name is Profound Origin, Origin Prospering, Upper Prime.\n\nHe wears a crown of Flying Essence and Radiance, robes of purple brocade with flying skirts, and holds in hand the Nine Dipper Jade Tablet, seated within the Jade Tower. If one possesses a mystic name on the Golden Terrace, one must know the inner name of the Lord of Flying Radiance. Those who know it shall see the Lord of Flying Radiance descend in illumination, the Dark Mystery of the Northern Culmen alighting, and by cultivating this Dao, one may soar through the Great Void and ascend within the Eight Gates.\n\nTo practice the Dao of Flying Steps, first stand upon the Northern Culmen Star. With the right hand, press the heart; with the left, point to the Golden Gate. Hold the breath for eight cycles, knock the teeth three times, swallow saliva three times, close the eyes, and visualize the name, personal name, and form of the Lord of Flying Radiance. Knock the teeth, stand upon the Northern Culmen, and softly intone the incantation:\n\n*\"The heavens move in threes and fives,\nThe Middle Prime revolves.\nFlying steps beneath the radiant canopy,\nRiding the Dipper and mounting the dawn,\nFalling into the cycle of three destinies,\nWandering amidst drifting mists.\nToday is supremely auspicious,\nAscending to seek the Divine Immortals.\nNames inscribed on jade tablets,\nCharacters engraved in purple script.\nAzure skirts and feathered robes,\nCrimson sashes and brocade skirts.\nThe Eight Radiance Cinnabar Chariot\nConveys me to ascend the hall.\nAttaining the rank of Immortal Minister,\nLord of the Northern Ascent.\nAll that is invoked,\nShall be as spoken.\"*\n\nWhen finished, circle the star eight times, return to face the west, hold the breath for eight cycles, step with the left foot upon the Celestial Pass, advance the right foot to join it, and release the breath.\n\nThe Celestial Pass Star is the Supreme Emperor of Heaven, governing the mechanisms of Heaven and Earth, such as the nurturing of the four seasons, the alternation of Heaven and Earth’s fortune and adversity, and the convergence of kalpas—all are subject to it. The star spans nine hundred *li*, its substance like lapis lazuli and crystal. At its heart stands the Three-Flowered Tree with five-colored fruit, where the Golden-Winged One roosts. There grows spontaneously the Nine-Flavored Mushroom Paste; consuming a single mouthful, the body emits nine-colored light, and one gains a lifespan of ninety thousand years.\n\nThe star has one gate, with nine rays of light that govern the qi of the Nine Heavens, illumining nine hundred million *li*. Above stands the Nine-Layered Jade Tower, where the Dragon-Riding Perfected resides, known as the Lord of the Ninefold Cloud Canopy of the Northern Dawn within the Nine-Layered Jade Tower of the Opening Assembly Palace. His surname is Dark Pivot, his personal name is Turning Light, and his courtesy name is Meeting Prime, End Bright, Heavenly Disciple.\n\nHe wears a Nine Prime Treasure Crown, robes of nine-colored brocade, and holds in hand the Radiant Spirit’s Seal, seated within the Jade Tower. If one possesses a mystic name on the Jade Register of the Nine Heavens’ Imperial Diagram, one must know the inner name of the Lord of the Northern Canopy. Those who know it shall see the Lord of the Northern Canopy descend in illumination, the Dark Mystery of the Celestial Pass alighting. By cultivating this Dao, one may soar through the Great Void and ascend within the One Gate.\n\nTo practice the Dao of Flying Steps, stand upon the Celestial Pass Star. With the left hand, press the heart; with the right, point to the Earthly Door. Hold the breath for one cycle, knock the teeth three times, swallow saliva three times, close the eyes, and visualize the name, personal name, and form of the Lord of the Northern Canopy. Stand upon the Celestial Pass Star and intone the incantation:\n\n*\"The Primordial Heaven turns the Pass,\nThe Earth’s cycle revolves the Pivot.\nNine Numinous cross the degrees,\nThrees and fives mutually advance.\nThe Four Sevens’ banners and lodgings,\nThe Five Emperors wander.\nReceiving the Dark and stepping into the Void,\nAscending to tread the Jade Mechanism.\nClothed in the Dipper, shod in the Dipper,\nFlowing pendants radiate majesty.\nThose who follow me prosper,\nThose who oppose me decline.\nI traverse the Heavenly Perfected,\nTen thousand *li* open vast.\nThe body soars upon the azure disk,\nThe soul ascends, the form takes flight.\nTranscending the kalpa’s convergence,\nAscending into the Supreme Subtlety.\"*\n\nWhen finished, circle the star once, return to face the Earthly Door, hold the breath for one cycle, step with the left foot upon the Auxiliary Star, advance the right foot to join it, and release the breath.\n\nThe Auxiliary Star is the star of the Heavenly Venerable Jade Emperor, called the Constant. The Constant is the Constant Yang, governing the Flying Immortals. Above, it oversees the Nine Heavens; below, it commands the Nine Earths. The offices of the Divine Immortals of the Five Peaks and Four Marshes all derive from it. The star spans nine hundred and ninety *li*, its substance like lapis lazuli and crystal. At its heart stands the Azure-Flowered Tree, upon which naturally appear characters of nine sounds. Above is the Azure Crow, the Three-Legged Crow, where grows spontaneously lapis lazuli mushroom-jade. Consuming a single mouthful, one attains the same Perfection as the Jade Emperor.\n\nThe star has eight gates, through which the eight qi communicate. Each gate has four rays of light that illumine the Nine Heavens. Within stands the Purple Qi Jade Tower, where the Wandering Perfected of the Three Destinies resides, known as the Lord of the Nine Dawns of the Imperial Seat within the Purple Qi Jade Tower of the Palace of the Imperial Mat. His surname is Essence Constant, his personal name is Constant Without Flaw, and his courtesy name is Dark Unraveling, Void Correct, Upper Opening, Prolonging.\n\nHe wears a Flying Essence Jade Crown, robes of nine colors, and holds in hand the Fire Pendants, seated within the Jade Tower. If one possesses a mystic name of the Upper Clarity and knows the inner name of the Imperial Venerable, those who know it shall see the Imperial Venerable descend in illumination, the Dark Mystery of the Auxiliary Star alighting. By cultivating this Dao, one may soar through the Great Void and ascend within the Eight Gates.\n\nTo practice the Dao of Flying Steps, stand upon the Auxiliary Star. With the right hand, press the heart; with the left, point to the Sparkling Deluder Star. Hold the breath for three cycles, knock the teeth three times, swallow saliva three times, close the eyes, and visualize the name, personal name, and form of the Imperial Venerable. Stand upon the Auxiliary Star and softly intone the incantation:\n\n*\"Heaven and Earth interweave,\nThree destinies connect the numinous.\nAscending to tread the celestial lodgings,\nSoaring through the Nine Stars.\nIn the left hand, the Hidden Script;\nIn the right, the Feathered Canon.\nBowing to pay homage to the Imperial Venerable,\nReceiving the Emperor’s name.\nAttaining to traverse the Radiant Canopy,\nSoaring in the Purple Court.\nToday, practicing the Dao,\nTen thousand blessings converge.\nReceiving boundless fortune,\nForever enjoying long life.\nThe body transforms into feathers,\nAscending to the Upper Clarity.\"*",
      "overlap_context": "blessings and long life,\nEqual to the Radiant Dawn’s bloom.\nFlesh flies, bones grow light,\nRiding luminous traces and mounting clouds.\nImmortal robes and feathered garments,\nTinkling pendants in profusion,\nFive colors gleaming and resplendent,\nAscending into the Seven Gates.\"*\n\nWhen finished, circle the star seven times, return to face the Celestial Pass, hold the breath for seven cycles, step with the left foot upon the Northern Culmen, advance the right foot to join it, and release the breath.",
      "start_char": 7464,
      "end_char": 8709,
      "start_sentence": 195,
      "end_sentence": 218,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.98788285255432,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\太上飞行九晨玉经.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "毕，回星上三过，还向南方，闭气三息，转左足还践弼星上，进右足并，通气。 弼星，太帝真星也，曰空，空者恒空隐也，主变化无方。 星围九百九十里，亦瑠璃水精，中有三华之树，自生九天玉章，上有金口之凤，口衔火铃，中生自然七曜之晖，得食一口，与太帝同真。 星有九门，交关九天，门有四光芒，爓照八极之外，无央之中也。 中有玉台紫馆徘徊三阳真人，号曰上尊宫中玉楼紫绾帝真元晨君，姓幽空，讳空无先，字隐元觉冥阳晖幽寥无。 头建飞天玉冠，衣九天龙衣，手执帝章，坐紫馆之中。 若有玄名#4九天，得知帝真内讳，知者则能隐形藏身，修行其道，则飞升九门之内也。 修飞步之道，当於弼星上，右手抚心，左手指北辰星，闭气五息，叩齿三通，咽液七过，闭眼思帝真元晨君姓讳形像，却立弼星上，便微咒曰： 道合三微，玄虚举真，出常入空，逃形天关，浮翔八极，驾景紫烟，飞步九天，变化亿千，遨戏北盖，啸命句陈，所求所愿，靡不如言，长龄天地，保年华晨。 毕，回星上五转，还向北辰星，闭气七息，左转两足，还并立阳明星上，从阳明星单行禹步，周回九星，往反九回止，皆不须复存咒也。 毕，还弼星上平坐，偃息华盖，存九晨覆衣如初法，闭眼思己身在绛云之内，乘天纲飞空，上升九天之门，随纲转输九过毕，觉身如落空，还坐星图之上，便以手拭目九过，捻两眼门九过，而行周天大咒，叩齿九通，仰西北而咒曰： 高上九灵，皇上华君，总仰天宿，回度三辰，变化四节，五行成仙，是日行真，普命万神，五岳四渍，及诸灵山，天地水官，悉卫我轩，太阳激电，六阴吐云，猛兽驱除，万精四奔，毒龙食鬼，平灭邪源，谋我者刑，干我者烦，乐我者寿，愿我者仙，我带灵策，体佩七元，流金火铃，焕落我身，头戴华盖，足蹑景云，口衔天精，手握天关，空常变化，千合万分，金木水火，立成自然，飞行禹步，徘徊九门，出入三清，天地长存。 毕，又叩齿三通，咽液二七过，都止。 九晨之道毕於此也。",
      "translated_text": "When finished, circle the star three times, then face south again. Hold the breath for three cycles, turn the left foot to tread upon the Auxiliary Star, advance the right foot to join it, and release the breath.\n\nThe Auxiliary Star is the true star of the Supreme Thearch, called \"Void.\" Void means ever-hidden and empty, governing boundless transformations. The star spans nine hundred and ninety leagues, formed of lapis lazuli and crystal, with a Three-Florescence Tree growing at its center. Upon it, the Jade Chapters of the Nine Heavens naturally manifest. Atop the tree perches a golden-beaked phoenix, holding a fire-bell in its mouth, from which the radiance of the Seven Luminaries naturally arises. To consume a single breath from it is to attain the same true essence as the Supreme Thearch.\n\nThe star has nine gates, interlocking with the Nine Heavens. Each gate emits four rays of light, blazing beyond the Eight Extremes into the endless center. Within stands the Jade Terrace and Purple Palace, where the Three Yang Perfected wander—styled the Supreme Venerable of the Jade Tower and Purple Sash, the True Primordial Dawn Lord of the Imperial Palace. His surname is Dark Void, his personal name Void-Prior-Nothingness, his courtesy name Hidden Primordial Awareness, Radiant Obscure Yang, Boundless Seclusion.\n\nHe wears a Flying Heaven Jade Crown, robes of Nine Heavens Dragon Silk, and holds the Imperial Script in hand, seated within the Purple Palace. If one possesses the Mystic Name of the Nine Heavens and knows the inner personal name of the Imperial True One, one may conceal form and hide the body. Practicing this Way, one may ascend within the Nine Gates.\n\nTo perform the Flying Steps, stand upon the Auxiliary Star, right hand over the heart, left hand pointing to the Northern Asterism. Hold the breath for five cycles, knock the teeth three times, swallow saliva seven times, close the eyes, and visualize the name, personal name, and form of the True Primordial Dawn Lord. Stand facing backward upon the Auxiliary Star and softly intone the incantation:\n\n*\"The Dao harmonizes with the Three Subtleties,\nThe Mysterious Void uplifts the true.\nExiting the constant, entering the empty,\nEscaping form at Heaven’s Pass.\nFloating through the Eight Extremes,\nRiding the purple mist’s radiance.\nFlying steps traverse the Nine Heavens,\nTransforming into myriad thousands.\nRoaming beneath the Northern Canopy,\nWhistling to summon the Sentient Array.\nAll sought, all wished,\nNone unfulfilled as spoken.\nLongevity matching Heaven and Earth,\nPreserving the years of the Florid Dawn.\"*\n\nWhen finished, circle the star five times, then face the Northern Asterism. Hold the breath for seven cycles, turn the left foot twice, and stand again upon the Yang Brightness Star. From the Yang Brightness Star, perform the single-step Yu Pace, circling the Nine Stars nine times in nine returns. No further visualization or incantation is needed.\n\nWhen done, return to the Auxiliary Star and sit upright, reclining beneath the Florid Canopy. Visualize the Nine Dawns’ robes covering you as in the initial method. Close the eyes and imagine your body within crimson clouds, riding the Celestial Net through the void, ascending to the gates of the Nine Heavens. Follow the Net’s revolutions nine times, then sense the body as if falling through empty space, returning to sit upon the star chart. Wipe the eyes nine times with the hands, pinch the two eye-gates nine times, and perform the Great Incantation of the Celestial Cycle. Knock the teeth nine times, then face northwest and intone:\n\n*\"Supreme Nine Numinous Ones,\nAugust Florid Sovereign,\nTogether gazing upon the celestial lodgings,\nRevolving the Three Luminaries’ degrees.\nTransforming the four seasons,\nThe Five Agents attain immortality.\nToday, practicing the true,\nUniversally commanding the myriad spirits.\nThe Five Peaks and Four Floods,\nAnd all numinous mountains,\nThe officials of Heaven, Earth, and Water,\nAll guard my chariot.\nThe sun’s flashing lightning,\nThe Six Yin’s exhaling clouds,\nFierce beasts driven away,\nThe myriad spirits scattering in four directions.\nPoisonous dragons devour ghosts,\nLeveling and extinguishing evil’s source.\nThose who plot against me are punished,\nThose who offend me are vexed.\nThose who delight in me gain longevity,\nThose who wish for me attain immortality.\nI bear the Numinous Tally,\nMy body wears the Seven Origins.\nFlowing gold and fire-bells\nAdorn my body.\nHead crowned with the Florid Canopy,\nFeet treading radiant clouds.\nMouth holding celestial essence,\nHands grasping Heaven’s Pass.\nVoid and constant transform,\nA thousand unions, ten thousand divisions.\nMetal, Wood, Water, Fire,\nInstantly become spontaneous.\nFlying with the Yu Pace,\nWandering the Nine Gates.\nExiting and entering the Three Clarities,\nHeaven and Earth endure forever.\"*\n\nWhen finished, knock the teeth three more times and swallow saliva fourteen times. The Way of the Nine Dawns concludes here.",
      "overlap_context": "nect the numinous.\nAscending to tread the celestial lodgings,\nSoaring through the Nine Stars.\nIn the left hand, the Hidden Script;\nIn the right, the Feathered Canon.\nBowing to pay homage to the Imperial Venerable,\nReceiving the Emperor’s name.\nAttaining to traverse the Radiant Canopy,\nSoaring in the Purple Court.\nToday, practicing the Dao,\nTen thousand blessings converge.\nReceiving boundless fortune,\nForever enjoying long life.\nThe body transforms into feathers,\nAscending to the Upper Clarity.\"*",
      "start_char": 8709,
      "end_char": 9490,
      "start_sentence": 219,
      "end_sentence": 232,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.089665174484253,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\太上飞行九晨玉经.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "行九晨之道，当以正月、七月、四月、十月、四孟月，同用上旬五、九，唯一日也，平旦。 二月、八月、五月、十一月，四仲月，同用中旬十五、十九正中。 三月、九月、六月、十二月，四季月，同用下旬二十五、二十九夜半。 此一月六日，旬适取其一日，一月三过行之，一年三十六过，以应天关转轮九天之气三百六十度之数也。 以其日行道，皆九天书名，得过阳九百六之运，身免洪波大劫之灾，九年乃得晏飞纲而上步，乘空纪而超足也。 九晨玄图金简文曰：修飞步九晨之道，亦当依步天纲之日，兼而行之，益求飞天之速，玄斗屡鉴也。 若兼修者，当先行九晨，而后行步天纲也。 此二法咒咒为异，原同一法。 步天纲，太微帝君昔授皇清洞真君，步天纲，飞地纪，据玄斗，攀星魁，接九真，乘飞龙，游三命，浮三生，固三宝，出六害，隐六阴，入六纪，镇天英，守延期，存元辅，蹑大弼，用流丹房，上升文昌，展转九道，位为九老。 行之二十年，受书为上清真人。 凡人望七星为近，不知步之甚远。 道士苟知天纲之可步，而不知魂魄不追其身，非身之不将魂魄也，魂魄畏七星之威，不敢追身而上行也。 故三魂不摄，七魄荡散，徒以空尸步纲，而神不我从，实徒劳也。 子欲步纲，澄心虚静，不思哀忧，不念荧味，於是回行三匝，登星启祝，使魂魄二神俱过灵关，豁然纵体，奄忽自忘，盛洁乃步，恒如蹈空。 一年辟非，二年辟兵，三年辟死，四年地仙，千害万邪，众莫敢干。 自此以往，福庆无端，致神使灵，縿驾飞龙，太极赐芝，玉帝给童。 行二七年，为上清真人。 步法勿横行干纲也，直画连星之界分，曰纲也。 犯横天纲，皆伐断天道，大禁也。 步纲勿蹑真人星，大忌。 犯此二者，皆脱巾叩头谢纲象，以布帛为之，长九尺，广六尺，罗列星位於帛上，以青笔为星，丹笔为纲，盛之洁箱。 每欲施行，烧香出之，侍书有玉女七人，卫星有玉童七人。 妇人步纲，用绛帛。 太微帝君教授步天纲之经，谨按神真上法，先烧香於行事之所，闭气七回，行斗星之外三匝，始於阴精，匝於阳明，毕乃通气，始得足蹑於七星，身上步於阳明耳。 於是向阳明星，又闭气而心祝曰： 阳明大魁，玄极文昌，使某魂魄，俱游天纲。 祝毕，乃左足蹑阳明，又进右足蹑阴精，心祝曰： 阴精北极，太上璇玑，使某魂魄，俱过神津。 次左足蹑北极，心祝曰： 北极天光，回适玄辰，使某魂魄，俱至玄关。 次右足蹑天关，进左足前与并，乃通息。 大祝之一闭息不竟纲者，可於丹元星上通息更闭，微祝曰： 金木水火土，．五行相推，七星焕焕，天纲最威，辅星镇盛，弼星却衰，九真太上，太极太微，三府玉帝，三尊辟非，天动地转，魂魄相随，使我飞仙，真光徘徊，名入金房，玉门乃开，乘龙陟空，日月同辉，游行上清，呜铃翠衣，左蹑流电，右御奔雷，地上万邪，伏死敢 追，恶心视我，使尔斩摧，帝命玉女，营侍以归，魂真魄神，合形升飞。 倒行法，止於天关，倒向北极，微祝曰： 太上元辰，华盖紫灵，北极玉房，藏景化精，太微玄台，九真玉城，愿某飞仙，得行云庭，反步天纲，魂魄俱生，乘龙华宫，得道之英，左佩玉铛，右腰金铃，虎带龙裙，啸摄天兵，乘景三素，飞登上清。",
      "translated_text": "To practice the Way of the Nine Dawns, one must observe the following schedule: during the first, seventh, fourth, and tenth months—the four *meng* months—use the fifth and ninth days of the first decade, exclusively on the first day at dawn. In the second, eighth, fifth, and eleventh months—the four *zhong* months—use the fifteenth and nineteenth days of the middle decade at noon. In the third, ninth, sixth, and twelfth months—the four *ji* months—use the twenty-fifth and twenty-ninth days of the last decade at midnight. Thus, six days are selected from each month, one from each decade, practiced three times monthly, totaling thirty-six times yearly, corresponding to the celestial rotation of the Heavenly Pass and the three hundred sixty degrees of the nine heavens’ qi.\n\nOn these appointed days, inscribe the names of the nine heavens while practicing the Way, thereby transcending the *yang* cycle of nine hundred and six kalpas. The body avoids the calamities of the great deluge and the vast kalpic disasters. After nine years, one ascends the net of serene flight, strides upon the void’s纪, and soars beyond the mortal realm.\n\nThe *Mysterious Chart of the Nine Dawns* on the golden tablets states: To cultivate the flying steps of the Nine Dawns, one must also adhere to the days of *Stepping the Heavenly Net*, practicing both in tandem to hasten celestial ascent, as the *Mysterious Dipper* repeatedly bears witness. Those who undertake both practices should first perform the Nine Dawns, then proceed to *Stepping the Heavenly Net*. Though these two methods differ in incantations, they originate from the same source.\n\n*Stepping the Heavenly Net* was once transmitted by the Lord Emperor of the Grand Tenuity to the Perfected Sovereign of the Luminous Cavern. *Stepping the Heavenly Net*, flying the earth’s纪, grasping the *Mysterious Dipper*, climbing the stellar *Kui*, connecting with the Nine Perfected, riding the flying dragon, wandering the Three Destinies, floating through the Three Lives, securing the Three Treasures, emerging from the Six Harms, concealing within the Six Yin, entering the Six纪, pacifying *Tianying*, guarding the extended term, preserving the Primordial Auxiliary, treading the Great Assistant, employing the *Flowing Cinnabar Chamber*, ascending to *Wenchang*, revolving through the Nine Paths, and attaining the rank of the Nine Elders. After twenty years of practice, one receives the scriptures and becomes a Perfected of the Highest Clarity.\n\nOrdinary people perceive the Seven Stars as near, unaware that stepping them is profoundly distant. If a Daoist knows the Heavenly Net may be stepped yet fails to ensure the hun and po follow the body, it is not that the body cannot lead the hun and po, but rather that the hun and po fear the might of the Seven Stars and dare not ascend with the body. Thus, the three hun remain uncontrolled, the seven po scatter, and one merely steps the Net with an empty corpse while the spirits do not follow—truly a futile labor.\n\nIf you wish to step the Net, purify the heart and still the mind, banish sorrow and care, and relinquish all distracting thoughts. Then, circumambulate three times, ascend the stars, and invoke the spirits, ensuring the hun and po deities together pass the Numinous Pass. Suddenly, the body becomes unbound, and one forgets oneself entirely. With utmost purity, proceed as if treading empty space. After one year, one repels misfortune; after two, one repels weapons; after three, one repels death; after four, one becomes an earthbound immortal. A thousand harms and ten thousand evils—none dare encroach. From this point onward, blessings and fortune arise without end. One commands spirits and employs numinous powers, harnessing flying dragons, receiving the *Taiyi*’s sacred fungus, and being attended by jade lads from the Jade Emperor. After thirty-four years of practice, one becomes a Perfected of the Highest Clarity.\n\nIn stepping the Net, do not traverse horizontally across the Net, for the Net is the straight line connecting the boundaries of the stars. To cross the Heavenly Net horizontally is to sever the celestial path—a grave prohibition. Furthermore, do not tread upon the stars of the Perfected—this is a great taboo. Violating either of these requires removing the headscarf, bowing, and making amends to the Net’s image. Prepare a cloth nine feet long and six feet wide, arranging the stellar positions upon it. Use blue ink for the stars and red ink for the Net, storing it in a pure box. Each time before practice, burn incense, retrieve the cloth, and be attended by seven jade maidens to guard the scriptures and seven jade lads to protect the stars. Women stepping the Net should use crimson cloth.\n\nThe Lord Emperor of the Grand Tenuity, in transmitting the scripture of *Stepping the Heavenly Net*, strictly followed the methods of the divine Perfected. First, burn incense at the practice site, hold the breath seven times, and circumambulate the Dipper’s stars three times outside, beginning at *Yin Jing* and ending at *Yang Ming*. Only then may one exhale and begin treading the Seven Stars, stepping onto *Yang Ming* with the body. Face *Yang Ming* and hold the breath while silently invoking:\n\n*\"Great *Yang Ming*, august *Wenchang* of the mysterious extreme, may my hun and po together wander the Heavenly Net.\"*\n\nAfter the invocation, step onto *Yang Ming* with the left foot, then advance the right foot to *Yin Jing*, silently invoking:\n\n*\"North Pole of *Yin Jing*, supreme *Xuanji*, may my hun and po together pass the divine ford.\"*\n\nNext, step onto the North Pole with the left foot, silently invoking:\n\n*\"Celestial radiance of the North Pole, revolving to the mysterious celestial time, may my hun and po together reach the Mysterious Pass.\"*\n\nThen, step onto *Tian Guan* with the right foot, advance the left foot to align with it, and exhale. If the great invocation is not completed before holding the breath, one may exhale above the *Dan Yuan* star and hold the breath again, softly invoking:\n\n*\"Metal, Wood, Water, Fire, Earth—\nthe Five Phases revolve.\nThe Seven Stars shine resplendently,\nthe Heavenly Net most mighty.\nThe Auxiliary Star pacifies abundance,\nthe Assistant Star repels decline.\nThe Nine Perfected and the Supreme,\n*Taiyi* and *Taiwei*,\nthe Three Treasuries and Jade Emperor,\nthe Three Honored Ones repel misfortune.\nHeaven turns, Earth revolves,\nhun and po follow.\nMay I become a flying immortal,\ntrue radiance lingering.\nMy name enters the Golden Chamber,\nthe Jade Gate opens.\nRiding the dragon, ascending the void,\nsun and moon shine together.\nWandering the Highest Clarity,\njingling bells and emerald robes.\nLeft foot treading lightning,\nright hand commanding thunder.\nTen thousand evils on earth,\nsubdued and slain, dare not pursue.\nEvil hearts gazing upon me,\nbe shattered and destroyed.\nThe Jade Emperor commands jade maidens,\nto attend and return with me.\nHun, po, spirit, and soul,\nunite in form and ascend in flight.\"*\n\nFor the reverse stepping method, halt at *Tian Guan*, face the North Pole, and softly invoke:\n\n*\"Supreme Primordial Time,\nFlorid Canopy and Purple Numinous,\nJade Chamber of the North Pole,\nconcealing radiance and transforming essence.\nMysterious Terrace of *Taiwei*,\nJade City of the Nine Perfected,\nmay I, a flying immortal,\nwander the cloud courts.\nReversing the steps of the Heavenly Net,\nhun and po both live.\nRiding the dragon to the Florid Palace,\nattaining the flower of the Way.\nLeft side bearing jade chimes,\nright waist girded with golden bells.\nTiger belt and dragon skirt,\nwhistling to command celestial soldiers.\nRiding the threefold purity,\nascending to the Highest Clarity.\"*",
      "overlap_context": "d with the Florid Canopy,\nFeet treading radiant clouds.\nMouth holding celestial essence,\nHands grasping Heaven’s Pass.\nVoid and constant transform,\nA thousand unions, ten thousand divisions.\nMetal, Wood, Water, Fire,\nInstantly become spontaneous.\nFlying with the Yu Pace,\nWandering the Nine Gates.\nExiting and entering the Three Clarities,\nHeaven and Earth endure forever.\"*\n\nWhen finished, knock the teeth three more times and swallow saliva fourteen times. The Way of the Nine Dawns concludes here.",
      "start_char": 9491,
      "end_char": 10746,
      "start_sentence": 233,
      "end_sentence": 268,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.15989017486572,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\太上飞行九晨玉经.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "祝毕，乃闭气，举左足蹑北极，右足蹑丹元，次举左足蹑玄冥，前右足与左足并，而向真人之星通息，微祝曰： 太极九精，上皇高真，出登元清，入隐玄阴，育某长某，使某好仙，玉台忽开，金堂八门，乞某佩书，绛龙青裙，上佐紫微，后圣之君，乘十飞龙，玄盖景灵，列名玄图，日月同并。 祝毕，因又闭气，左足蹑弼星，进右足蹑阴精，又进左足蹑阳明，前右足与左足并，乃通息，微祝曰： 天魁正阳，斗运低昂，前转元机，后动灵纲，制魄以宁，拘魂以康，魂魄与身，俱行天堂，向见金阙，高上太皇，右扶仙母，左扶仙公，紫翠飞华，龙袍虎裳，带真巾玉，项生圆光，手把神铃，腰佩金铛，口咏洞真，七变妙章，先自虚元，生而为王，飞行九道，据斗攀纲，前从太一，后从玄郎，告某口诀，坐在立亡，反行至要，位为仙卿，五藏自生，与天相迎，所愿如念，所求克昌，万邪伏害，易地隐藏，恶我天伐，水灭火丧。 反行法，又闭气，右迥斗星之外三匝，始於阳明，匝於阳明，通息，祝曰： 高上太真，七耀至尊，反行寻生，上步天元，使某飞仙，得入，紫门。 因又了闭气，左足蹑阳明，右足蹑阴精，先前右足蹑玄冥，左足蹑丹元，次右足蹑北极，左足蹑天关，右足前与并，乃通息，祝曰： 七变返旋，上行玉宿，六纪辅我，三纲合步，玉帝左盻，高上右顾，教我乘星，腾登玄路，乞赐飞仙，不死之祚，游行上清，乘华三素，金青翠裙，出入九舍，北皇见揖，南真见谢，名书仙台，千变万化j 得友圣君，太平辅佐，所愿从心，万事成就，有恶我者，刀刑火墓。 顺行、倒行、反行，三道都毕，乃又举两足俱上阳明星，以右手抚心，左手指玄冥星，闭气三息，叩齿三七，咽液三九，名日据斗。 微祝曰： 阳明太素，立辰黄房，中有大神，左纣上皇，右把高真，龙衔翠衣，飞锦虎文，腰带玉符，首戴莲冠，出无入虚，金真玉光，灵尊巍峨，号曰阳明，足蹑朱姻，口咏洞章，赐某隐书，见教步纲，争周行三复，据斗自忘，使某飞仙，超虚俘空，名书上清，乘玄驾龙，意有所之，愿乐皆从，三尊合穗，魂魄内通，致给神官，玉女玉童，有恶某者，刑之电风，奸谋断舌，裔之十方。 祝毕，存心中忽然忘身，良久而下。 据斗之道既毕，又两足俱上阴精星，以左手抚心，以右手指真人星，闭气三息，叩齿三通，咽液三过，名曰攀魁。 入太微，微祝曰：, 阴精玄素中华阙生门，中有玉帝，北极至伟，凤绣库领，龙翠碧裙，腰虎佩铃，扶芝丹冠，号曰阴精，太上之君，授某亿书，使步一元，攀魁上升，遂游灵关，外拘七洒，内制三魂，魄炼俗累，魂宝胎神，魂魄守身，与之俱仙”飞行上清，还佩婴颜，所向如心，万欲无难，有恶某者，形死丰官，威摄六天，役使群神。 攀魁之道既毕，乃又两足俱上弼星，并足向，真人星四拜毕，跪闭气四息，卯齿四通，咽液四过，名日接真。 跪微咒曰： 太极九精，上元明真，正机把衡，吐纳紫烟，金光玉映，威照十天，摄御'三光，调阳和阴，理元赋气，改易故新，上治中宿，玄关之玄，金室玉户，北掖便，出驾八景，浮游太元，龙锦凤衣，虎翠飞裙，绛旌绿帔，紫羽七缘，腰带神符，首戴扶冠，上栖九虚，下翔天渊，自号玉皇，九天极真，哀某好道，授某隐篇，躬登弼魁，朝拜灵君，乞愿丹书，为生之缘，治天三五，飞行八玄，五藏自生，上品飞仙，得翼玉帝，后圣之臣，位高大夫，乘云飞验，所愿皆合，众邪莫干，有恶我者，暴形破门。",
      "translated_text": "Upon completing the invocation, hold the breath, lift the left foot to tread upon the North Pole, and the right foot upon *Danyuan*. Next, raise the left foot to tread upon *Xuanming*, then bring the right foot parallel with the left, facing the star of the Perfected One, and regulate the breath. Softly invoke:\n\n*\"Supreme Ultimate of the Nine Essences,\nHigh Perfected of the Supreme Sovereign,\nemerging to ascend Primordial Clarity,\nentering to conceal in Profound Yin.\nNurture me, [name], to love the immortal path.\nThe Jade Terrace suddenly opens,\nthe Golden Hall’s eight gates appear.\nGrant me the scripture to wear,\ncrimson dragon and azure skirt,\nto assist the Purple Tenuity,\nsage ruler of later generations.\nRiding ten flying dragons,\ndark canopy and radiant numina,\ninscribed upon the Profound Chart,\nsun and moon conjoined as one.\"*\n\nAfter the invocation, hold the breath again, tread the left foot upon the *Bixing* star, advance the right foot to *Yinjing*, then advance the left foot to *Yangming*. Bring the right foot parallel with the left, regulate the breath, and softly invoke:\n\n*\"Celestial Pivot of Upright Yang,\nthe Dipper’s revolving rise and fall.\nAdvancing, turn the Primordial Mechanism;\nretreating, move the Numinous Net.\nSubdue the *po* to bring tranquility,\nrestrain the *hun* to ensure well-being.\nHun, po, and body together\nascend to the Heavenly Hall.\nFacing the Golden Gates,\nthe Highest Supreme Sovereign,\nright hand supporting the Immortal Mother,\nleft hand supporting the Immortal Father.\nPurple kingfishers and flying blossoms,\ndragon robes and tiger skirts.\nGirded with the true scarf and jade,\na halo crowning the head.\nHolding divine bells in hand,\ngolden chimes at the waist.\nChanting the *Dongzhen* scriptures,\nthe sevenfold wondrous verses.\nFrom the Void and Primordial,\nborn to be a king,\nsoaring through the nine paths,\ngrasping the Dipper and climbing the Net.\nPreceded by the Great One,\nfollowed by the Profound Youth,\ntransmit to me the oral instructions,\nsitting in dissolution, standing in vanishing.\nThe essentials of reverse stepping,\na position as Immortal Minister.\nThe five viscera self-generated,\nwelcoming the heavens in harmony.\nMay wishes as conceived be fulfilled,\nmay all sought be prosperous.\nAll malign forces submit and harm,\nconcealed in distant lands.\nThose who hate me—heaven strikes them,\nwater extinguishes, fire perishes.\"*\n\nFor the reverse stepping method, hold the breath again, circle three times outside the Dipper’s stars, beginning at *Yangming* and ending at *Yangming*. Regulate the breath and invoke:\n\n*\"Highest Supreme Perfected,\nSeven Luminaries most revered,\nreverse stepping to seek life,\nascending to the Heavenly Origin.\nMay I, a flying immortal,\nenter the Purple Gate.\"*\n\nThen hold the breath once more, tread the left foot upon *Yangming*, the right foot upon *Yinjing*, advance the right foot to *Xuanming*, the left foot to *Danyuan*, then the right foot to the North Pole, the left foot to *Tianguan*. Bring the right foot parallel with the left, regulate the breath, and invoke:\n\n*\"Sevenfold reversal and rotation,\nascending the Jade Constellations.\nSix Eras assist me,\nThree Nets align my steps.\nThe Jade Emperor glances left,\nthe Highest Supreme looks right,\nteaching me to ride the stars,\nsoaring to ascend the Profound Path.\nGrant the boon of flying immortality,\nthe blessing of undying destiny.\nRoaming the Highest Clarity,\nriding the flowery Threefold Purity.\nGolden, azure, and kingfisher skirts,\nentering and exiting the Nine Abodes.\nThe Northern Sovereign bows in greeting,\nthe Southern Perfected offers thanks.\nName inscribed on the Immortal Terrace,\na thousand transformations, myriad changes.\nGaining the friendship of sage lords,\nassisting in the Great Peace.\nMay all wishes follow the heart,\nall affairs come to fruition.\nThose who harbor malice toward me—\nblade punishment, fire entombment.\"*\n\nHaving completed the forward, reverse, and counter-stepping methods of the three paths, lift both feet together upon the *Yangming* star. With the right hand, press the heart; with the left hand, point to the *Xuanming* star. Hold the breath for three cycles, knock the teeth twenty-one times, and swallow saliva twenty-seven times. This is called *Grasping the Dipper*.\n\nSoftly invoke:\n\n*\"Yangming of the Great Simplicity,\nestablishing the celestial mansion of the Yellow Chamber.\nWithin resides a great spirit,\nleft holding the Supreme Sovereign,\nright grasping the High Perfected.\nDragons bearing kingfisher robes,\nflying brocade with tiger patterns.\nGirded with jade talismans,\ncrowned with lotus coronets.\nEmerging from nothingness, entering the Void,\ngolden perfection and jade radiance.\nNuminous and majestic,\nnamed Yangming.\nTreading upon crimson mists,\nchanting the *Dongzhang* scriptures.\nGrant me the hidden writings,\nteach me the steps of the Net.\nContending in threefold circuits,\ngrasping the Dipper, self-forgetting.\nMay I, a flying immortal,\ntranscend the Void and traverse emptiness.\nName inscribed in the Highest Clarity,\nriding the dark dragon’s chariot.\nWherever intention leads,\nmay all desires follow.\nThe Three Honored Ones unite in harmony,\nhun and po inwardly communicate.\nSummoning divine officials,\njade maidens and jade lads.\nThose who harbor malice toward me—\npunished by lightning and wind,\ntreacherous schemes—tongues severed,\nbanished to the ten directions.\"*\n\nUpon completing the invocation, suddenly forget the self within the heart, and after a long while, descend.\n\nThe method of *Grasping the Dipper* complete, tread both feet upon the *Yinjing* star. With the left hand, press the heart; with the right hand, point to the star of the Perfected One. Hold the breath for three cycles, knock the teeth three times, and swallow saliva three times. This is called *Climbing the Pivot*.\n\nEntering the *Taiwei* Palace, softly invoke:\n\n*\"Within the Profound Simplicity of Yinjing,\nthe Flowery Gate of the Central Palace arises.\nWithin resides the Jade Emperor,\nthe North Pole most majestic.\nPhoenix-embroidered collar,\ndragon-kingfisher azure skirts.\nTiger-girded with bells,\nsupporting the vermilion mushroom coronet.\nNamed Yinjing,\nSovereign of the Supreme.\nGrant me the scripture of myriad years,\nto step the Primordial Unity,\nclimb the Pivot and ascend,\nroaming the Numinous Pass.\nExternally restraining the seven *sa*,\ninternally governing the three *hun*.\nRefining the *po* from worldly burdens,\ntreasuring the *hun* as the womb spirit.\nHun and po guard the body,\ntogether ascending as immortals,\nsoaring to the Highest Clarity,\nreturning with the countenance of an infant.\nAll intentions fulfilled,\nten thousand desires without difficulty.\nThose who harbor malice toward me—\ntheir forms perish, their palaces crumble.\nCommanding the Six Heavens,\nemploying the host of spirits.\"*\n\nThe method of *Climbing the Pivot* complete, tread both feet upon the *Bixing* star. With feet together, face the star of the Perfected One and bow four times. Kneel, hold the breath for four cycles, knock the teeth four times, and swallow saliva four times. This is called *Meeting the Perfected*.\n\nKneeling, softly invoke:\n\n*\"Supreme Ultimate of the Nine Essences,\nLuminous Perfected of the Upper Origin.\nHolding the balance of the Upright Mechanism,\nexhaling and inhaling purple mists.\nGolden light and jade radiance,\nmajesty illuminating the ten heavens.\nGoverning and guiding the Three Luminaries,\nharmonizing yang and balancing yin.\nOrdering the origin and bestowing qi,\ntransforming the old to renew.\nAbove, governing the Central Constellation,\nmystery within the Mysterious Pass.\nGolden chambers and jade portals,\nthe Northern Flank’s convenience.\nEmerging to ride the Eight Radiances,\nfloating and roaming the Great Origin.\nDragon brocade and phoenix robes,\ntiger-kingfisher flying skirts.\nCrimson banners and green sashes,\npurple feathers with sevenfold edges.\nGirded with divine talismans,\ncrowned with supporting coronets.\nAbove, perching in the Nine Voids,\nbelow, soaring in the Heavenly Abyss.\nSelf-styled Jade Sovereign,\nUltimate Perfected of the Nine Heavens.\nPitying my love of the Dao,\ngrant me the hidden scriptures.\nPersonally ascending the Pivot and Pillar,\npaying homage to the Numinous Lord.\nBeseeching the cinnabar writings,\nthe cause of life’s affinity.\nGoverning the heavens’ Three and Five,\nsoaring through the Eight Profound.\nThe five viscera self-generated,\nhighest grade of flying immortals.\nGaining the wings of the Jade Emperor,\nminister to later sages.\nRank of Grand Master,\nriding clouds and flying verification.\nMay all wishes be fulfilled,\nall malign forces kept at bay.\nThose who harbor malice toward me—\ntheir forms shattered, gates destroyed.\"*",
      "overlap_context": "oncealing radiance and transforming essence.\nMysterious Terrace of *Taiwei*,\nJade City of the Nine Perfected,\nmay I, a flying immortal,\nwander the cloud courts.\nReversing the steps of the Heavenly Net,\nhun and po both live.\nRiding the dragon to the Florid Palace,\nattaining the flower of the Way.\nLeft side bearing jade chimes,\nright waist girded with golden bells.\nTiger belt and dragon skirt,\nwhistling to command celestial soldiers.\nRiding the threefold purity,\nascending to the Highest Clarity.\"*",
      "start_char": 10746,
      "end_char": 12103,
      "start_sentence": 269,
      "end_sentence": 286,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 45.010884523391724,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\太上飞行九晨玉经.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "接真之道既毕，乃又两足俱上玄冥星，以右手抚心，以左手指丹元星，闭气三息，叩齿三七通，胭掖三过，名曰步斗。 微祝曰： 洞天神光，迥亿玄冥，气盈太虚，去来无形，隐天藏地，周灌无生，忽登天钢，上步紫庭，北视雷房，南显电城，眩惑万变，非复故形，恍惚流景，触手立成，欲求藏身，得我姓名，虚元傲兀，九变玄冥，坐起六甲，谒署六丁，赐某隐书，步斗行星，仰见上皇，披丹巾青，手把灵光，腰带玉铃，上乞飞仙，与天俱生，名书太微，浮化上清，下乞变化，藏景录形，万事如愿，前由皆平，有恶我者，戮以神兵。 太极真经金根上文曰：子登玄冥，步斗#5隐形，子欲变化，当得我名，回天动地，万物立成。 步玄冥时，及欲隐时，当心存此名字。 步斗之道既毕#6，乃又两足俱上丹元星，以左手抚心，以右手指北极星，闭气三息，叩齿三通，咽液三过，名曰蹑纪。 微祝曰： 太上九台，丹元玄纪，外管北极，内正天理，金阙映外，玉庭耀裹，中有至尊，号曰赤子，治在丹元，绛房之中，翠云绣华，龙帔虎裳，右执皇箓，左把魁纲，足蹑景云，首巾紫冠，右佩流铃，左带玉珰。 赐某隐书，蹑纪游行，上乞飞仙，乘玄驾龙，书名丹台，太极玉堂，所向所求，福禄来迎，有恶某者，愿为灭亡，给侍神官，玉女玉童。 蹑纪之道既毕，乃又两足俱上北极星，以右手抚心，以左手指天关星，闭气三息，叩齿三通，咽液三过，名曰步纲。 微祝曰： 玄上太微，北极紫盖，下有太真，游翔九外，翠华飞裙，金铃青带，腰佩玉光，玄云奄蔼，赐某隐书，上行七气，登清戏烟，真人合会，乞丐飞仙，书名丹室，所向如愿，无灾无害，有恶我者，令彼伤败。 步纲之道既毕，乃又两足俱上天关星，以右手抚心，左手指天关，闭气三息，叩齿三通，咽液三过，名曰乘龙。 微祝曰： 太上七极，紫微绝辰，宝玄金房，外有玉门，周运九官，调和天关，中有尊神，号曰紫皇，授某隐书，携某乘龙，上游九天，下飞地元，景云丹舆，玄华翠裳，腰佩龙策，头巾虎文，包生万物，教训飞仙，脱某死名，天地长存，乘龙步斗，所向受恩，有恶我者，风刀火然。 乘龙之道既毕，乃又两足俱上辅星，闭气一息，叩齿三通，咽液一过，名曰游行三命，旋步天英也。 微祝曰： 太极辅星，精在紫关，养生育命，宝守神魂，金房再开，奉见辅君，赐某隐书，使某游旋，列名圣皇，飞仙九天，巾金佩真，出入洞门。 游行三命既毕，乃回行诣弼星，两足俱上，闭气一息，叩齿三通，咽液一过，名曰徘徊三阳，出入三生。 微祝曰： 太虚泥丸，紫宫天尊，玄空真纽，为帝之先，在道玉皇，在身泥丸，冯感欻生，气贯霄元，精入明堂，强胎益魂，朱山再开，奉近灵元，左采日华，右掇月根，流火万丈，金罗碧裙，腰带天骨，首戴华冠，赐某隐书，得行天关，乞愿飞仙，役使万神，万向皆会，福德如山。 行事时； 皆北向执隐书而为之也，亦可按文视星，不必暗诵而作也。",
      "translated_text": "Having completed the Way of Connecting with the Perfected, one then steps with both feet onto the Star of Profound Darkness. With the right hand placed upon the heart and the left hand pointing to the Star of Cinnabar Prime, hold the breath for three cycles, knock the teeth three times seven, and swallow saliva thrice—this is called \"Treading the Dipper.\"\n\nA whispered invocation follows:\n\"Radiance of the Grotto-Heaven,\nboundless in the Profound Darkness,\nqi fills the Great Void,\ncoming and going without form.\nHidden in heaven, concealed in earth,\npervading and irrigating the unborn,\nsuddenly ascending the Brazen Sky,\nstepping above the Purple Court.\nGazing north to the Thunder Chamber,\ngazing south to the Lightning City,\ndazzling and confounding the myriad transformations,\nno longer in their former shape.\nIn the flickering flow of light,\ntouching the hand, they instantly form.\nShould you seek to conceal yourself,\nknow my name.\nEmpty and primal, haughty and aloof,\nninefold transformations of the Profound Darkness.\nSitting and rising with the Six Jia,\nvisiting and registering with the Six Ding.\nGrant me the hidden scriptures,\nto tread the Dipper and traverse the stars.\nLooking up, I behold the Supreme Sovereign,\nrobed in cinnabar and azure,\nholding the numinous radiance in hand,\njade bells girded at the waist.\nAbove, I beseech flight as an immortal,\nto be born together with heaven.\nMy name inscribed in the Grand Tenuity,\nfloating and transforming in the Highest Clarity.\nBelow, I beseech transformation,\nto conceal my light and record my form.\nMay all affairs be as wished,\nall past grievances smoothed.\nThose who harbor malice toward me—\nslain by divine soldiers.\"\n\nThe *Golden Root Scripture of the Supreme Ultimate* states:\n\"When you ascend the Profound Darkness and tread the Dipper to conceal your form,\nshould you desire transformation,\nyou must know my name.\nRevolving heaven and moving earth,\nthe myriad things instantly take shape.\"\n\nWhen treading the Profound Darkness or desiring concealment, one must hold this name in the heart.\n\nHaving completed the Way of Treading the Dipper, one then steps with both feet onto the Star of Cinnabar Prime. With the left hand placed upon the heart and the right hand pointing to the North Star, hold the breath for three cycles, knock the teeth thrice, and swallow saliva thrice—this is called \"Treading the Guideline.\"\n\nA whispered invocation follows:\n\"Supreme Nine Terraces,\nCinnabar Prime and the Mysterious Guideline,\nexternally governing the North Star,\ninternally rectifying the heavenly principle.\nGolden Gates shine without,\nJade Court radiates within.\nAt its center dwells the Most Honored,\nstyled the Crimson Child,\ngoverning within Cinnabar Prime,\nin the Crimson Chamber.\nEmbroidered clouds of kingfisher hue,\ndragon robes and tiger skirts.\nIn the right hand, the Imperial Register;\nin the left, the Handle of the Dipper.\nFeet treading upon radiant clouds,\nhead crowned with purple coronets.\nTo the right, hanging bells;\nto the left, jade pendants.\nGrant me the hidden scriptures,\nto tread the Guideline and wander.\nAbove, I beseech flight as an immortal,\nriding the dark dragon.\nMy name inscribed in the Cinnabar Terrace,\nin the Jade Hall of the Supreme Ultimate.\nWherever I turn, wherever I seek,\nblessings and fortune come to meet me.\nThose who harbor malice toward me—\nmay they be annihilated.\nAttended by divine officials,\njade maidens and jade lads.\"\n\nHaving completed the Way of Treading the Guideline, one then steps with both feet onto the North Star. With the right hand placed upon the heart and the left hand pointing to the Celestial Pivot Star, hold the breath for three cycles, knock the teeth thrice, and swallow saliva thrice—this is called \"Treading the Net.\"\n\nA whispered invocation follows:\n\"Mysterious and supreme Grand Tenuity,\nPurple Canopy of the North Star.\nBelow dwells the Supreme Perfected,\nsoaring beyond the Nine Exteriors.\nKingfisher skirts in flight,\ngolden bells and azure sashes.\nAt the waist, a jade radiance,\ndark clouds swirling and gathering.\nGrant me the hidden scriptures,\nto ascend and traverse the Seven Qi.\nAscending the Clarity to sport in the mist,\nthe Perfected gather in assembly.\nI beseech flight as an immortal,\nmy name inscribed in the Cinnabar Chamber.\nWherever I turn, may my wishes be fulfilled,\nwithout calamity or harm.\nThose who harbor malice toward me—\nmay they suffer defeat and injury.\"\n\nHaving completed the Way of Treading the Net, one then steps with both feet onto the Celestial Pivot Star. With the right hand placed upon the heart and the left hand pointing to the Celestial Pivot, hold the breath for three cycles, knock the teeth thrice, and swallow saliva thrice—this is called \"Riding the Dragon.\"\n\nA whispered invocation follows:\n\"Supreme Seven Poles,\nPurple Tenuity beyond the stars.\nPrecious Mystery and Golden Chamber,\nwithout, the Jade Gate.\nRevolving through the Nine Palaces,\nharmonizing the Celestial Pivot.\nAt its center dwells the Honored Divinity,\nstyled the Purple Sovereign.\nGrant me the hidden scriptures,\nto carry me and ride the dragon.\nAbove, soaring through the Nine Heavens;\nbelow, flying through the Primal Earth.\nRadiant clouds and cinnabar chariots,\ndark flowers and kingfisher skirts.\nAt the waist, a dragon tally;\non the head, tiger-patterned kerchiefs.\nEncompassing the birth of the myriad things,\ninstructing and guiding the flying immortals.\nFreeing me from the name of death,\neternally preserved in heaven and earth.\nRiding the dragon and treading the Dipper,\nwherever I turn, I receive favor.\nThose who harbor malice toward me—\nwind blades and fire consume them.\"\n\nHaving completed the Way of Riding the Dragon, one then steps with both feet onto the Auxiliary Star, holds the breath for one cycle, knocks the teeth thrice, and swallows saliva once—this is called \"Wandering the Three Destinies,\" revolving and treading the Celestial Flower.\n\nA whispered invocation follows:\n\"Star of the Supreme Ultimate’s Auxiliary,\nits essence residing in the Purple Barrier.\nNurturing life and fostering destiny,\npreciously guarding the spirit-soul.\nThe Golden Chamber opens again,\nto behold the Lord of the Auxiliary.\nGrant me the hidden scriptures,\nto make me wander and revolve.\nMy name listed with the Sage Sovereign,\nflying immortal of the Nine Heavens.\nKerchief of gold and girdle of the Perfected,\nentering and exiting the Grotto-Gate.\"\n\nHaving completed Wandering the Three Destinies, one then returns to tread upon the Star of Assistance, stepping with both feet, holding the breath for one cycle, knocking the teeth thrice, and swallowing saliva once—this is called \"Pacing the Three Yangs,\" entering and exiting the Three Lives.\n\nA whispered invocation follows:\n\"Mud-Pill Palace of the Great Void,\nCelestial Honored One of the Purple Palace.\nMysterious Void and True Pivot,\nforemost of the Emperor.\nIn the Dao, the Jade Sovereign;\nin the body, the Mud-Pill.\nRiding the swift and sudden arising,\nqi piercing the Primal Empyrean.\nEssence entering the Hall of Light,\nstrengthening the embryo and benefiting the soul.\nThe Vermilion Mountain opens again,\nto draw near the Numinous Prime.\nTo the left, gathering the radiance of the sun;\nto the right, plucking the root of the moon.\nFlowing fire ten thousand fathoms,\ngolden net and azure skirts.\nAt the waist, the Celestial Bone;\non the head, the Floral Crown.\nGrant me the hidden scriptures,\nto traverse the Celestial Pivot.\nI beseech flight as an immortal,\nto command the myriad spirits.\nWherever I turn, all converges,\nfortune and virtue like mountains.\"\n\nWhen performing these practices, one faces north, holding the hidden scriptures, and acts accordingly. One may also follow the text while observing the stars, without reciting from memory.",
      "overlap_context": "ng homage to the Numinous Lord.\nBeseeching the cinnabar writings,\nthe cause of life’s affinity.\nGoverning the heavens’ Three and Five,\nsoaring through the Eight Profound.\nThe five viscera self-generated,\nhighest grade of flying immortals.\nGaining the wings of the Jade Emperor,\nminister to later sages.\nRank of Grand Master,\nriding clouds and flying verification.\nMay all wishes be fulfilled,\nall malign forces kept at bay.\nThose who harbor malice toward me—\ntheir forms shattered, gates destroyed.\"*",
      "start_char": 12104,
      "end_char": 13271,
      "start_sentence": 287,
      "end_sentence": 309,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.8205246925354,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\太上飞行九晨玉经.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "春步七星名日步三纲，夏步七星名日蹑六纪，秋步七星名曰行六害，冬步七星名曰登六绝。 太上飞行九晨玉经竟 #1『叩齿』原本误作『流齿』。 #2『右足』原本误作『进足」。 #3『辅星』原本误作『转星』。 #4『玄名』原本误作『玄明』。 #5『步斗』原本误作『步半」。 #6『毕』字原本误作『车』。",
      "translated_text": "\"In spring, stepping the Seven Stars is called 'Treading the Three Principles';\nin summer, stepping the Seven Stars is called 'Following the Six Records';\nin autumn, stepping the Seven Stars is called 'Walking the Six Harms';\nin winter, stepping the Seven Stars is called 'Ascending the Six Terminations.'\nThe *Supreme Jade Scripture of the Nine Dawns’ Aerial Flight* concludes.\n\n[Note: #1 'Knocking the teeth' was originally miswritten as 'flowing teeth.'\n#2 'Right foot' was originally miswritten as 'advancing foot.'\n#3 'Auxiliary star' was originally miswritten as 'turning star.'\n#4 'Mysterious name' was originally miswritten as 'mysterious brightness.'\n#5 'Stepping the Dipper' was originally miswritten as 'stepping halfway.'\n#6 The character '毕' was originally miswritten as '车.']\"",
      "overlap_context": "n thousand fathoms,\ngolden net and azure skirts.\nAt the waist, the Celestial Bone;\non the head, the Floral Crown.\nGrant me the hidden scriptures,\nto traverse the Celestial Pivot.\nI beseech flight as an immortal,\nto command the myriad spirits.\nWherever I turn, all converges,\nfortune and virtue like mountains.\"\n\nWhen performing these practices, one faces north, holding the hidden scriptures, and acts accordingly. One may also follow the text while observing the stars, without reciting from memory.",
      "start_char": 13271,
      "end_char": 13430,
      "start_sentence": 310,
      "end_sentence": 317,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 4.105650186538696,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\太上飞行九晨玉经.txt",
        "category": "玉诀类"
      }
    }
  ]
}