{
  "source_id": "太上说玄天大圣真武本传神咒妙经",
  "source_file": "chunked_daozang\\太上说玄天大圣真武本传神咒妙经.json",
  "total_chunks": 4,
  "total_original_chars": 3881,
  "total_translated_chars": 23657,
  "total_translation_time": 121.20563316345215,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\谱箓类\\太上说玄天大圣真武本传神咒妙经.txt",
    "category": "谱箓类"
  },
  "full_translation": "**The Supreme Lord’s Scripture of the Wondrous Incantations of the Divine Transmission of the Dark Heaven Great Sage Perfected Warrior**\n\n**Scripture Title:** *The Supreme Lord’s Scripture of the Wondrous Divine Soul of the Dark Heaven Great Sage Perfected Warrior’s Original Transmission*\n**Author:** Unknown\n**Volume:** One\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Dongshen Section*, *Registers and Records Category*\n\n---\n\n**The Supreme Lord’s Scripture of the Wondrous Incantations of the Divine Transmission of the Dark Heaven Great Sage Perfected Warrior**\n\nWe reverently invoke the Dark Heaven Great Sage:\nThe numinous spirit of the northern *ren* and *gui*,\nTrue Honored One of the Golden Tower, incarnate transformation,\nPeerless General named Perfected Warrior.\nMajestic countenance blazes as the Supreme Yin Lord,\nHis radiance drawn from the *Xu* and *Wei* constellations.\nEyes flash lightning to subdue drought demons,\nTen thousand riders like clouds command the Nine Earths.\nClad in purple robes, girded with a golden sash, he grasps his divine blade;\nA verdant tortoise and colossal serpent bear his sacred feet.\nSix *Ding* and six *Jia* spirits attend left and right,\nEight Slayer Generals guard before and behind.\nHis power to dispel calamity and bestow blessings defies reckoning—\nWe bow in devotion, offering homage with single-minded reverence.\n\nAt that time, the Supreme Emperor of Purple Tenuity, on the Central Day of the First Yuan of the Dragon Han Era, within the North Polar Palace of the Great Clarity’s realm, before the Purple Tenuity Hall, assembled the sagely hosts of all heavens: the Northern and Southern Dippers, the Eastern and Western Courts, the Five Stars of the Five Directions, the Six Luminaries of the Six Palaces, the Twenty-Eight Constellations, the Twelve Palace Spirits, the Flying Heavenly Kings, and the boundless immortals. All drew near the imperial throne, reverently awaiting his august command.\n\nThen a Jade Youth conveyed the Emperor’s decree:\n“To the Great General of the North, the Dark Warrior General: You shall heed the sacred mandate of the Jade Emperor. Thrice each month, you shall lead the divine legions to traverse all heavens, conducting thorough inspections. Wherever you encounter perverse *qi* or malevolent stars straying from their courses, swiftly execute them. Moreover, on the Three Primals, Eight Festivals, *jiazi*, *gengshen* days, and each monthly cyclical sign, descend to the lower realms. Record the good, punish the wicked, aid the upright, and expel the perverse. Rescue and deliver the celestial and human, quell demons and seize toxins. Thus shall you fulfill the supreme will—be diligent in this duty.”\n\nAt that moment, the Perfected One named Wondrous Conduct stepped forth from the ranks, prostrated before the Emperor, and said: “Your servant, by past karmic affinity, has been privileged to hear the wondrous principle. The Great General of the North, the Dark Warrior General, patrols the heavens and humanity, recording good and punishing evil. Yet I know not by what karmic cause this general manifests, nor what divine powers he wields to subdue gods and demons. I humbly beseech Your August Majesty to grant this foolish one a measure of enlightenment.”\n\nThen the Supreme Emperor, leaning upon his armrest, replied: “Excellent, Perfected One, that you inquire on behalf of the mortal realm! Yet the karmic cause of the Dark Warrior’s manifestation is vast and unfathomable, subtle and beyond comprehension. For he is the incarnate transformation of the Mysterious Origin Sage Ancestor, the divine marvel that protects and delivers the celestial and human. The Dao is formless, beyond all imagery; its transformations are myriad, its emptiness inscrutable. Now, the Mysterious Origin Sage Ancestor has manifested eighty-one times as the Venerable Lord and eighty-two times as the Dark Warrior. Thus we know the Dark Warrior is the transformed body of the Venerable Lord, the numinous verification of the *Wuqu* star. His essence arises from the two constellations *Xu* and *Wei*, the fusion of water and fire. Sometimes armored, clad in robes; sometimes booted, yet barefoot. Ever with disheveled azure locks, ever wielding his divine blade, his voice shakes the Nine Heavens, his might pervades the Four Quarters. Where he advances, dark mists gather; where he treads, the verdant tortoise and colossal serpent follow. His divine soldiers and generals number fifty million; jade boys and jade maidens attend him in twenty-four ranks. He bears the Numinous Talisman of the North Emperor and the Treasure Seal of *Qianyuan*. To command him is to summon Thunder Lords and Lightning Mothers; to escort him are Wind Lords and Rain Masters. The Eight Slayer Generals guard his front and rear; the Six *Jia* Generals follow left and right. The Celestial Stem *Tiangang* and Great Unity lead his vanguard; Earth Lords and City Gods obey his commands. He annihilates all demons and aids all goodness. He ascends the Golden Tower and hastens to Kunlun, opens the Gate of Heaven and seals the Door of Earth. In the obscure and indistinct, he discerns all destinies. Dwelling in the *ren* and *gui* direction, he assists the *jia* and *geng* generals. Sometimes he rides a dark steed, sometimes strides a verdant rainbow. His eyes flash like lightning, his brows arch like cloud formations. His body spans a thousand *zhang*, his crown bears the Three Terraces. When he moves, mountains and waters tremble; when he is still, heaven and earth harmonize. By such manifestations does his divine power become known.”\n\nThen the Perfected One bowed again and said: “Your servant is most fortunate to receive these sacred words. Yet if the Dark Warrior General is the manifestation of the Mysterious Origin, how did his origins begin? I humbly beseech Your Majesty to elucidate, that my ignorance may be dispelled.”\n\nThereupon, the Supreme Emperor of Purple Tenuity expounded in profound discourse, revealing the cause and resolving the supreme mystery.\n\n“Long ago, in the Palace of No Desire in the Great Luo Realm, Queen Consort Shansheng of the Kingdom of Pure Joy dreamed she swallowed the sun and, upon waking, conceived. Her *qi* rejected all perversity; daily she cultivated the Dao. After fourteen months—more than four hundred days—on the third day of the third month in the *jiachen* year of the Kaihuang Era, at the hour of *wu*, she gave birth within the palace. His appearance was extraordinary. When he matured, he renounced his home, bid farewell to his parents, and entered Mount Wudang to cultivate the Dao. After forty-two years, his merit complete and fruitfulness fulfilled, he ascended to heaven in broad daylight. The Jade Emperor issued an edict, enfeoffing him as the Supreme Mystery and entrusting him to guard the North. Such was the beginning of his manifested traces.”\n\nThe Perfected One bowed again and addressed the Supreme Emperor of Purple Tenuity: “The Jade Emperor’s edict of enfeoffment must bear a wondrous intent. I venture to inquire of its general purport, that my meager understanding may be enlightened.”\n\nAt that time, the Emperor replied to Wondrous Conduct: “The celestial scriptures are secret—how may they be proclaimed? To reveal heavenly mechanisms would be most improper. The hidden language of the Great Brahma—how may it be made known to all?”\n\nThe Perfected One Wondrous Conduct bowed and prostrated himself, then petitioned again: “Though your servant’s karmic affinity is slight, surely Your Sagely Majesty’s grace is boundless.”\n\nTurning his thoughts to the assembled Perfected, the Emperor deigned to grant great favor. Should one treat these mysteries with careless disdain, one would fall into evil destinies, suffering as a lowly ghost for ten thousand kalpas and a thousand rebirths.\n\nAt that time, the Supreme Emperor of Purple Tenuity, moved by this Perfected One’s earnest devotion and repeated petitions, revealed the imperial kalpa to all the Perfected. These secret words, inscribed in golden seal-script upon a tablet a full *zhang* in breadth, were called the Heavenly Talisman. Whoever beheld it would dwell forever among the Celestial Immortals; whoever heard it would never pass through hell.\n\nThe edict read:\n\nFrom the Golden Portals of the Vast Heaven, under the Threefold Review,\nA missive is issued to the youth of sacred kalpa-study and immortal learning, the Prince of Pure Joy Kingdom:\nOnly you, transformed by the Mysterious Origin and revered as the One of Heaven, teach without words. None know your divine subtlety—boundless as the kalpas, towering as the *ren*.\nIf one preserves emptiness in the heart and substance in the belly, harmonizing one’s light with the dust,\nCarving open creation and scattering the simplicity of the primal chaos,\nFor six million years, through eighty-two bodies,\nBending the straight to save the crooked, filling the hollow and renewing the worn,\nGenerating yin and nurturing yang, raising the dead to life—\nSuch merit asks no reward; such virtue is true.\nNow you shall manifest once more, eternally guarding the Northern Heavens.\nAbove, you shall punish rebellious omens; below, you shall extinguish demonic vapors.\nHolding the talismanic registers, you shall subdue and restrain demonic traces.\nAt the assembly of the Imperial Perfected, you shall drive spirits and ride dragons.\nThe Generals of Jia and Geng shall assist and protect your merit.\nEncircling the Six Directions, you shall universally bless the people.\nYour Dao parallels Heaven and Earth; all spirits defer to you.\nYou are hereby specially appointed as Supreme Marshal of the Mysterious Origin, charged with overseeing the Bureau of Primordial Harmony and Celestial Transitions.\nUpon receipt of this decree, act accordingly.\n\nThe Supreme Emperor of Purple Tenuity then addressed the Perfected One: “This text is the Jade Emperor’s secret edict, the august proclamation of the Heavenly Thearch. It must not be lightly transmitted, lest one incur divine censure.”\n\nThe Perfected One bowed deeply and again addressed the Emperor: “I have heard that the Mysterious Warrior General possesses boundless divine power, yet does not occupy the ranks of the deities but instead guards the North. What is the wondrous cause of this efficacy? What is the profound covenant of his numinous clarity? I humbly beseech an explanation to dispel my ignorance.”\n\nThe Emperor’s voice responded to the Perfected One: “In the North above the Central Heaven, all the luminaries pay homage. Without the most divine, who could restrain and suppress?”\n\nThe Perfected One then inquired of the Supreme Emperor of Purple Tenuity: “If there are those among the heavenly and earthly who reverently aspire to the Mysterious Warrior General, what blessings and benefits may they obtain?”\n\nThe Emperor replied: “This divine general, on the sixth, sixteenth, and twenty-sixth days of every month, undergoes celestial review and patrols the Ten Caves. Additionally, on the seventh day of the first month, the eighth day of the second month, the ninth day of the third month, the fourth day of the fourth month, the fifth day of the fifth month, the seventh day of the sixth month, the seventh day of the seventh month, the thirteenth day of the eighth month, the ninth day of the ninth month, the twenty-first day of the tenth month, the seventh day of the eleventh month, and the twenty-seventh day of the twelfth month, he descends to the human realm to sever demonic influences, expel pestilence, protect lives, and ensure longevity, thus fulfilling the mandate of Heaven. Those whose qi is upright and whose hearts are pure, who are wholly loyal and perfectly filial, shall have their names inscribed on jade tablets and be recommended for ascension to immortality. There are further esoteric regulations too numerous to recount.”\n\nThe Perfected One bowed again and addressed the Supreme Emperor of Purple Tenuity: “I have now heard the cause of his manifest transformation. How may those who revere the Mysterious Warrior General pay homage? What expedient means may they employ to obtain blessings and benefits? I humbly request your instruction.”\n\nAt that time, the Emperor addressed the Perfected One: “Within Heaven and Earth, those who with sincere devotion worship the Mysterious Warrior—who, in their lifetime, abstain from foul and rank foods, from poisoned or polluted substances, from onions, garlic, leeks, and coriander, from indulgence in lust and desire, and from assisting in births or handling corpses—if they can sever these attachments, then they may aspire with true devotion. On the days of his descent, they shall receive auspicious blessings. On those nights, they must first purify body and mind, stilling all distracting thoughts.”\n\nBy the fifth watch, one should personally prepare incense and candles, pure fruits, and jujube broth, arranging them in three positions. With single-minded devotion, bow deeply and pray—no wish shall go unanswered. Then, with purified thoughts and utmost sincerity, recite the divine incantation:\n\n*In the northern darkness of the Mysterious Heaven,\nThe profound and distant Divine Lord.\nWith countless transformations,\nThe numinous truth of the Dark Warrior.\nSoaring through the skies, overturning the earth,\nDriving thunder and racing clouds.\nWith a host of ten thousand, sweeping away demonic miasma.\nThunder Lords attend as retainers,\nJade Maidens serve as generals.\nGhosts and spirits submit in surrender,\nDragons and tigers flee in concealment.\nVigilant over the Five Peaks,\nAll spirits obey in reverence.\nStriking bells and beating drums,\nPatrolling the cosmos.\nSeizing rebellious ghosts,\nCrushing and slaying demonic hordes.\nExpelling evil and aiding the upright,\nThe Dao’s qi ever draws near.\nSwiftly, swiftly, as the Primordial Celestial Sovereign’s decree commands!*\n\n*Born of the Great Yin,\nEssence of the Water Palace.\nCorresponding above to the Void and Danger constellations,\nSerpent and Tortoise conjoined in form.\nRoaming the Nine Lands,\nCommanding the myriad spirits.\nNo hidden place unperceived,\nNo wish unfulfilled.\nFrom kalpa’s end to kalpa’s beginning,\nSevering and vanquishing demonic essences.\nRescuing and protecting all beings,\nBringing peace to households and nations.\nWhen the kalpa nears its close and the final *jia* day arrives,\nDemon miasmas spread unchecked.\nThe Celestial Sovereign, in his might,\nThus sends me forth in spirit.\nTo propagate the true teaching,\nDispel evil, and repel weapons.\nTransforming and harmonizing the multitudes,\nAiding the restoration of the central realm.\nShould any petty ghost dare appear,\nMy gaze alone shall topple the Five Peaks.\nSwiftly, swiftly, as the Great Mystery’s decree commands!*\n\nThe Wondrous Practitioner of the Dao said: “The marvel of merit and the cause of manifest responses—I have humbly heard them and my confusion is dispelled. Yet there are those among the barbarian tribes, the foolish and dull-witted, who may hear these words but hold no faith in their hearts. If there are indeed karmic retributions, may you reveal them in brief.”\n\nThe Purple Tenuity Great Emperor replied: “Though they be foolish and dull, they must recognize heat and cold. Though they dwell among barbarians, they must know suffering and joy. Those who believe shall find their spirits and souls clear and refreshed; those who defy shall be ensnared by misfortune and calamity. Thus may they become impoverished despite wealth, or bear many children despite poverty; their sons may perish by the sword in war, their daughters may suffer harm from illicit pregnancies. Constantly entangled in lawsuits, ever mired in the sea of suffering, their estates dwindle, their resources dissipate. Such is the consequence of their own faults, the cause they have reaped. Where this divine general presides, fierce demons lower their heads, and perverse paths vanish. Therefore, those who revere him shall find blessings arising like clouds, while disasters scatter like lightning. You have earnestly inquired, and so I reveal this mechanism, tracing the subtle origins of the Dao’s principles, that the people of heaven may receive great felicity. Though my words are concise, I wish you to understand them clearly. Were it not for one such as yourself, this should remain secret.”\n\nThe Perfected One said: “May I hear of the wondrous workings of this principle?”\n\nThe Great Emperor replied: “Formerly, on the Shangyuan Festival of the first year of *Yongshou*, the Primordial Celestial Worthy, upon the Eight Radiant Celestial Palace, seated upon the Five Clouds Throne, addressed the Thirty-Six Celestial Sovereigns, the Seventy-Two Perfected Ones of the Blessed Lands, the boundless Flying Celestial Great Spirits, the Limitless Longevity Great Sages, the Golden Lads and Jade Maidens, the Nine Phoenixes and Eight Simurghs, all arrayed in resplendent attendance to left and right. The Eight Sounds resonated of themselves, and all the sages rejoiced. Solemnly, they listened as the Celestial Worthy expounded the wondrous Dharma of the utmost truth. The Dao’s qi was purified, encircling the supreme Mystery of the Primordial Origin, delving into the subtleties of its profound principles.\n\nSuddenly, from the northeast of the Celestial Gate, seven great peals of thunder resounded, and ten thousand eyes turned as one to behold the grievances of the lower realm, where demonic miasmas coiled upward to the heavens. The assembled Perfected fell silent, and the Great Dao stood still. Then, the Wondrous Practitioner of the Dao inquired as to the cause.\n\nThe Primordial One, having expounded the wondrous Dharma and gathered auspicious signs, asked: ‘What extraordinary cause has provoked this disturbance? May you reveal its profound import to resolve the doubts of all.’\n\nThe Great Emperor said: ‘The people of the Lower Kalpa all receive the utmost Dao, endowed with the pure qi of primordial chaos to sustain their mortal forms. Yet now, as the kalpic destiny nears its end, demonic forces gradually grow strong. They follow only perverse paths, forgetting their original source, delighting in the worship of evil spirits, and flatteringly seeking fleeting blessings. Bewildered and confused, greedy and obstinate, they are neither righteous nor benevolent, neither loyal nor filial. Now, the Demon Kings of the Six Heavens and the Five Offices of Pestilence, disregarding the proper order, wrongfully bring harm—whether old or young, male or female—cutting short their allotted years and forcing them to abandon the world before their time. Thus, their lonely souls, filled with resentment, surge upward in a coil that cannot disperse. Such violent deaths are truly pitiable.’\n\nThe Wondrous Practitioner of the Dao then addressed the Primordial One: ‘The assembled Perfected pity these beings—by what means may they be delivered?’\n\nThe Celestial Worthy struck his teeth once, and a radiance streamed ten thousand miles to the north, summoning the Great Mystery General to sever the demonic hordes and rescue all beings.\n\nThe Perfected One asked: ‘By what cause does this general hold dominion over the northern quarter, subduing lower ghosts and sweeping away demonic miasmas?’\n\nThe Great Emperor replied: ‘Before the unfolding of creation, this spirit already embodied divine numinosity. Assuming names and titles, he delivered people and aided the world, never boasting of his virtues nor priding himself on his abilities. For this, the Jade Emperor enfeoffed him as the Dark Warrior.’\n\nThe Perfected One said: ‘How may this general descend to the lower realm to deliver all beings, sparing them from violent deaths, liberating the dead, and ensuring the living’s well-being?’\n\nThe Celestial Worthy issued a flying talisman to summon the general. The Dark Warrior, receiving the decree, led his divine troops to the Crimson Steps of the Never-Night Palace, where he beheld the Great Dao of mighty renown. Bowing deeply, he knelt and addressed the Celestial Worthy: ‘By what cause today do I merit this special summons? I am fortunate to behold your compassionate countenance—what is the purport of your wondrous decree?’ Kneeling upon the alchemical platform, he reverently received the command.\n\nThe Celestial Worthy declared: ‘I observe the lower realm, where grievances surge to the heavens. All are alarmed, and the exalted Perfected pity them. You shall go there—proceed with reverence!’”\n\nThus did the Dark Warrior receive the mandate and take leave of Heaven. Turning his radiance inward, he unbound his hair and went barefoot, treading upon the tortoise and serpent. His immortal retinue surged forth like thunder, celestial warriors arrayed in resplendent guard. In an instant, he traversed the cosmos—shearing the cruel and venomous demons, mending the wanton ravages of pestilence. The souls of the netherworld found rebirth; suffering and sickness departed. The living and the dead were sundered; grievances dissolved. The common folk dwelt in peace; the land knew tranquility.\n\nThe Dark Warrior beheld the Celestial Worthy once more and recounted the power of the Dao. The work accomplished, the task fulfilled, the turbid descended and the pure ascended. Withdrawing his auspicious radiance, he returned to his original station, aligning the celestial pivots and directing the earthly forces, aiding the Gate of Heaven above.\n\nThen he intoned the incantation:\n\nIn the Great Beginning, in the Great Simplicity,\nFormless and imageless,\nNone knew the heavy and turbid,\nWho could discern the light and pure?\nWithin the primordial chaos, I divided darkness and light.\nHeaven gained its vigor,\nEarth gained its stability,\nThe people gained their sustenance,\nAll things gained their sprouting.\nThe perverse were rectified,\nThe spirits gained their numinosity.\nWithin the Three Powers,\nAll myriad beings flourished.\n\nWhen the Great Dao dispersed,\nBenevolence and righteousness arose.\nWhen rites and music were established,\nDeceit and perversity followed.\nThe Six Principles faltered,\nThe Four Peoples contended.\nAbove, there was no magnanimity,\nBelow, no loyalty or integrity.\nDemons and ghosts,\nGoblins and spirits,\nRampant in their venom,\nDisturbed the living.\nEntire households fell ill,\nYears burdened by misfortune.\nWealth dissipated,\nKin were left forlorn.\nLives passed away,\nCalamities entwined.\nFoul and noxious qi\nAscended to the celestial court.\n\nThe Celestial Worthy issued his command,\nBidding me to restore peace.\nAll demons were sheared,\nAll ghosts were seared.\nThe officers of pestilence\nBound their heads in submission.\nGhostly spirits were extinguished,\nEvil demons were overthrown.\n\nI possess ten billion fierce warriors,\nFifty million divine troops.\nIn Heaven above,\nOn Earth below,\nThey follow my descent and ascent.\nThose who resist me perish,\nThose who obey me live.\nThose who revile me are shamed,\nThose who revere me are honored.\nThose who honor me gain longevity,\nThose who defy me meet their end.\n\nBy this decree,\nBoth humans and ghosts heed.\nSwiftly, swiftly,\nAs the Great Mysterious Law commands!\n\nAt that time, the Wondrously Practiced Perfected, the immeasurable flying heavenly divine kings, and the assembly of perfected immortals, having heard these words, leapt forth in reverence, praising the merit and virtue. The secret registers, sealed in jade caskets, were later transmitted to the mortal world by banished immortals. Those devoted to the Dao bowed their heads in devotion and put them into practice.\n\nThus concludes *The Wondrous Scripture of the Divine Incantation of the Great Sage of the Dark Heaven, the Perfected Warrior, as Spoken by the Most High*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞神部谱录类 太上说玄天大圣真武本传神咒妙经 经名：太上说玄天大圣真武本传神魂妙经。 撰人不详。 一卷。 底本出处：《正统道藏》洞神部谱录类。 太上说玄天大圣真武本传神咒妙经 仰启玄天大圣者，北方壬癸至灵神。 金阙真尊应化身，无上将军号真武。 威容赫奕太阴君，列宿虚危分秀气。 双睛掣电伏旱魔，万骑如云威九地。 紫袍金带按神锋，苍龟巨蛇捧圣足。 六丁六甲左右随，八煞将军前后卫。 消灾降福不思议，皈命一心今奉礼。 尔时，紫微大帝於龙汉元年中元之日，在太清境上北极宫中，向紫微之殿前列诸天之上圣、南北二斗、东西两曹，洎五方之五星，及六宫之六曜，二十八宿、十二宫神、飞天神王、无极仙众，咸亲帝座、肃拱宸威。 时有，玉童传大帝之勑：北方大将玄武将军，宜察玉皇圣命劲令，每月三度，统领神兵，躬往诸天，徧为巡察。 凡遇邪气，及有妖星逆次流缠，速须剪戮。 又遇三元八节、甲子庚申，一月一辰，降於下界。 录善罚恶，辅正除邪。 济拔天人，松妖摄毒。 以副上意，切切为之。 时有，真人，名曰妙行，特离班次，炼伏帝前曰：臣宿有因缘，得闻妙理。 北方大将玄武将军，巡察天人，录善罚恶。 不知此将，应化何因？ 有何神通？ 鬼神降伏。 愿惟大造，少悟小聪。 是时，大帝隐几而言：妙哉真人，能为凡间。 然其玄武应化之因，渺邈难穷，希夷莫究。 盖乃玄元圣祖，护度天人，应化之身，神明之妙。 盖无形之为道，非有象之可言。 变化亿千，虚无难测。 且玄元圣祖，八十一次显为老君，八十二次变为玄武。 故知玄武者，老君变化之身，武曲显灵之验。 本虚危之二宿，交水火之两精。 或挂甲而衣袍，或穿靴而跣足。 常披绀发，每仗神锋，声震九天，威分四部。 拥之者早森玄雾，蹑之者苍龟巨蛇。 神兵神将，从之者皆五千万众。 玉童玉女，侍之者各二十四行。 授北帝之灵符，佩乾元之宝印。 驱之有雷公电母，御之有风伯雨师。 卫前后则八煞将军，随左右则六甲神将。 天罡太一，率於驱使之前。 社令城隍，悉处指挥之下。 有妖皆剪，无善不扶。 朝金阙而赴昆仑，开天门而闭地户。 杳冥恍惚，审察穷通。 居其壬癸之方，助有甲庚之将。 或乘玄骏，或跨苍虹。 目闪电光，眉横云阵。 身长千丈，顶戴三台。 其动也，山水蒙。 其静也，地天泰。 以兹显化，故乃神通。 是时，真人再拜稽首曰：臣之庆幸，荷此纶辞。 然其玄武之将军，乃玄元之应化。 其始之边，其事云何。 愿赐详言，以开蒙鄙。 於是，紫微大帝敷以玄言，释彼所因，解无上事。 昔大罗境上无欲天宫，净乐国王善胜皇后，梦而吞日，觉乃怀孕。 其毋气不纳邪，日常行道，既经一十四月，乃及四百余辰。 於开皇元年甲辰之岁三月三日午时，降诞於王宫，相貌殊伦。 后既长成，遂舍家辞父母，入武当山修道。 四十二年，功成果满，白日升天。 玉皇有诏，封为太玄，镇於北方。 显迹之因，自此始也。 真人稽首再拜，白紫微大帝曰：玉皇诏封，必有妙旨。 敢问大略，以开小聪。 尔时，告於妙行曰：天书秘密，何以谈扬。 恐泄天机，深为不便。 大梵隐语，奚使众闻。 妙行真人拜首稽首，复奏言曰：臣虽缘薄，圣必恩宽。",
      "translated_text": "**The Supreme Lord’s Scripture of the Wondrous Incantations of the Divine Transmission of the Dark Heaven Great Sage Perfected Warrior**\n\n**Scripture Title:** *The Supreme Lord’s Scripture of the Wondrous Divine Soul of the Dark Heaven Great Sage Perfected Warrior’s Original Transmission*\n**Author:** Unknown\n**Volume:** One\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Dongshen Section*, *Registers and Records Category*\n\n---\n\n**The Supreme Lord’s Scripture of the Wondrous Incantations of the Divine Transmission of the Dark Heaven Great Sage Perfected Warrior**\n\nWe reverently invoke the Dark Heaven Great Sage:\nThe numinous spirit of the northern *ren* and *gui*,\nTrue Honored One of the Golden Tower, incarnate transformation,\nPeerless General named Perfected Warrior.\nMajestic countenance blazes as the Supreme Yin Lord,\nHis radiance drawn from the *Xu* and *Wei* constellations.\nEyes flash lightning to subdue drought demons,\nTen thousand riders like clouds command the Nine Earths.\nClad in purple robes, girded with a golden sash, he grasps his divine blade;\nA verdant tortoise and colossal serpent bear his sacred feet.\nSix *Ding* and six *Jia* spirits attend left and right,\nEight Slayer Generals guard before and behind.\nHis power to dispel calamity and bestow blessings defies reckoning—\nWe bow in devotion, offering homage with single-minded reverence.\n\nAt that time, the Supreme Emperor of Purple Tenuity, on the Central Day of the First Yuan of the Dragon Han Era, within the North Polar Palace of the Great Clarity’s realm, before the Purple Tenuity Hall, assembled the sagely hosts of all heavens: the Northern and Southern Dippers, the Eastern and Western Courts, the Five Stars of the Five Directions, the Six Luminaries of the Six Palaces, the Twenty-Eight Constellations, the Twelve Palace Spirits, the Flying Heavenly Kings, and the boundless immortals. All drew near the imperial throne, reverently awaiting his august command.\n\nThen a Jade Youth conveyed the Emperor’s decree:\n“To the Great General of the North, the Dark Warrior General: You shall heed the sacred mandate of the Jade Emperor. Thrice each month, you shall lead the divine legions to traverse all heavens, conducting thorough inspections. Wherever you encounter perverse *qi* or malevolent stars straying from their courses, swiftly execute them. Moreover, on the Three Primals, Eight Festivals, *jiazi*, *gengshen* days, and each monthly cyclical sign, descend to the lower realms. Record the good, punish the wicked, aid the upright, and expel the perverse. Rescue and deliver the celestial and human, quell demons and seize toxins. Thus shall you fulfill the supreme will—be diligent in this duty.”\n\nAt that moment, the Perfected One named Wondrous Conduct stepped forth from the ranks, prostrated before the Emperor, and said: “Your servant, by past karmic affinity, has been privileged to hear the wondrous principle. The Great General of the North, the Dark Warrior General, patrols the heavens and humanity, recording good and punishing evil. Yet I know not by what karmic cause this general manifests, nor what divine powers he wields to subdue gods and demons. I humbly beseech Your August Majesty to grant this foolish one a measure of enlightenment.”\n\nThen the Supreme Emperor, leaning upon his armrest, replied: “Excellent, Perfected One, that you inquire on behalf of the mortal realm! Yet the karmic cause of the Dark Warrior’s manifestation is vast and unfathomable, subtle and beyond comprehension. For he is the incarnate transformation of the Mysterious Origin Sage Ancestor, the divine marvel that protects and delivers the celestial and human. The Dao is formless, beyond all imagery; its transformations are myriad, its emptiness inscrutable. Now, the Mysterious Origin Sage Ancestor has manifested eighty-one times as the Venerable Lord and eighty-two times as the Dark Warrior. Thus we know the Dark Warrior is the transformed body of the Venerable Lord, the numinous verification of the *Wuqu* star. His essence arises from the two constellations *Xu* and *Wei*, the fusion of water and fire. Sometimes armored, clad in robes; sometimes booted, yet barefoot. Ever with disheveled azure locks, ever wielding his divine blade, his voice shakes the Nine Heavens, his might pervades the Four Quarters. Where he advances, dark mists gather; where he treads, the verdant tortoise and colossal serpent follow. His divine soldiers and generals number fifty million; jade boys and jade maidens attend him in twenty-four ranks. He bears the Numinous Talisman of the North Emperor and the Treasure Seal of *Qianyuan*. To command him is to summon Thunder Lords and Lightning Mothers; to escort him are Wind Lords and Rain Masters. The Eight Slayer Generals guard his front and rear; the Six *Jia* Generals follow left and right. The Celestial Stem *Tiangang* and Great Unity lead his vanguard; Earth Lords and City Gods obey his commands. He annihilates all demons and aids all goodness. He ascends the Golden Tower and hastens to Kunlun, opens the Gate of Heaven and seals the Door of Earth. In the obscure and indistinct, he discerns all destinies. Dwelling in the *ren* and *gui* direction, he assists the *jia* and *geng* generals. Sometimes he rides a dark steed, sometimes strides a verdant rainbow. His eyes flash like lightning, his brows arch like cloud formations. His body spans a thousand *zhang*, his crown bears the Three Terraces. When he moves, mountains and waters tremble; when he is still, heaven and earth harmonize. By such manifestations does his divine power become known.”\n\nThen the Perfected One bowed again and said: “Your servant is most fortunate to receive these sacred words. Yet if the Dark Warrior General is the manifestation of the Mysterious Origin, how did his origins begin? I humbly beseech Your Majesty to elucidate, that my ignorance may be dispelled.”\n\nThereupon, the Supreme Emperor of Purple Tenuity expounded in profound discourse, revealing the cause and resolving the supreme mystery.\n\n“Long ago, in the Palace of No Desire in the Great Luo Realm, Queen Consort Shansheng of the Kingdom of Pure Joy dreamed she swallowed the sun and, upon waking, conceived. Her *qi* rejected all perversity; daily she cultivated the Dao. After fourteen months—more than four hundred days—on the third day of the third month in the *jiachen* year of the Kaihuang Era, at the hour of *wu*, she gave birth within the palace. His appearance was extraordinary. When he matured, he renounced his home, bid farewell to his parents, and entered Mount Wudang to cultivate the Dao. After forty-two years, his merit complete and fruitfulness fulfilled, he ascended to heaven in broad daylight. The Jade Emperor issued an edict, enfeoffing him as the Supreme Mystery and entrusting him to guard the North. Such was the beginning of his manifested traces.”\n\nThe Perfected One bowed again and addressed the Supreme Emperor of Purple Tenuity: “The Jade Emperor’s edict of enfeoffment must bear a wondrous intent. I venture to inquire of its general purport, that my meager understanding may be enlightened.”\n\nAt that time, the Emperor replied to Wondrous Conduct: “The celestial scriptures are secret—how may they be proclaimed? To reveal heavenly mechanisms would be most improper. The hidden language of the Great Brahma—how may it be made known to all?”\n\nThe Perfected One Wondrous Conduct bowed and prostrated himself, then petitioned again: “Though your servant’s karmic affinity is slight, surely Your Sagely Majesty’s grace is boundless.”",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1262,
      "start_sentence": 0,
      "end_sentence": 72,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.27741098403931,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\谱箓类\\太上说玄天大圣真武本传神咒妙经.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "曲念众真，特垂大便。 苟轻泄慢，当堕恶途。 万劫千生，受为下鬼。 是时，紫微大帝，念此真人，着意勤拳，再三请问，遂宣帝劫，以示众真。 夫此秘言，金书篆字，大方一丈，号曰天符。 见之者永处天仙，聆之者不历地狱。 其诏文曰： 金阙昊天三省门下，牒奉劫学仙圣童、净乐国子，惟卿玄元之化，天一之尊，不言而教。 莫知其神渺渺，劫仞绵绵。 若存虚心实腹，和光同尘。 凿开造化，朴散胚浑。 六百万岁，八十二身。 曲全枉直，洼盈弊新。 生阴育阳，起死成人。 其功不恃，其德乃真。 今宜再显，永镇北旻。 上罚逆象，下灭妖氛。 掌握图箓，摄制魔踪。 帝真灵会，驱神驾龙。 甲庚之将，赞卫尔勋。 周环六合，普福兆民。 道参天地，万神所推。 可特拜太玄元帅，领元和迁校府公事。 册到奉行。 紫微乃言，告真人曰：此文者，玉皇秘勑，天帝徽宣。 不可轻传，恐遭降责。 真人稽首，又白帝言：臣闻玄武将军神通至大，不居诸位，而镇北方。 妙用之因，神明之契，必有，奥旨，愿释鄙怀。 大帝遗音，告真人曰：天中北上，众曜拱之。 以匪至神，孰能镇遏。 真人乃启．於紫微：若有天人，志心钦仰，其於福利，有所得乎？ 大帝曰：此神将，是岁每月六日、十六日、二十六日，诸天审察，十洞巡游。 及正月七日，二月八日，三月九日，四月四日，五月五日，六月七日，七月七日，八月十三日，九月九日，十月二十一日，十一月七日，十二月二十七日。 下降人问，剪灭邪魔，驱除瘟疟，保人庆寿，以全天命。 其有气正心纯，忠全孝尽，名书玉简，保举升仙。 更有玄科，莫可并述。 真人稽首再拜，白紫微大帝曰：显化之因，则闻命矣。 天人钦仰玄武将军，作何皈依？ 设何方便？ 而得福利，幸赐一言。 大帝是时告真人曰：天地之内，能有志心，奉祀玄武。 一生之内，不食腥膻，自毙毒伤厌秽之物，及於蕊菜、大蒜、胡姜，耽淫嗜欲，扶尸接产，若能断得，方可志心。 凡临下降之辰，皆有祯祥之庆。 其夜先当澡沦身心，不汨思虑。",
      "translated_text": "Turning his thoughts to the assembled Perfected, the Emperor deigned to grant great favor. Should one treat these mysteries with careless disdain, one would fall into evil destinies, suffering as a lowly ghost for ten thousand kalpas and a thousand rebirths.\n\nAt that time, the Supreme Emperor of Purple Tenuity, moved by this Perfected One’s earnest devotion and repeated petitions, revealed the imperial kalpa to all the Perfected. These secret words, inscribed in golden seal-script upon a tablet a full *zhang* in breadth, were called the Heavenly Talisman. Whoever beheld it would dwell forever among the Celestial Immortals; whoever heard it would never pass through hell.\n\nThe edict read:\n\nFrom the Golden Portals of the Vast Heaven, under the Threefold Review,\nA missive is issued to the youth of sacred kalpa-study and immortal learning, the Prince of Pure Joy Kingdom:\nOnly you, transformed by the Mysterious Origin and revered as the One of Heaven, teach without words. None know your divine subtlety—boundless as the kalpas, towering as the *ren*.\nIf one preserves emptiness in the heart and substance in the belly, harmonizing one’s light with the dust,\nCarving open creation and scattering the simplicity of the primal chaos,\nFor six million years, through eighty-two bodies,\nBending the straight to save the crooked, filling the hollow and renewing the worn,\nGenerating yin and nurturing yang, raising the dead to life—\nSuch merit asks no reward; such virtue is true.\nNow you shall manifest once more, eternally guarding the Northern Heavens.\nAbove, you shall punish rebellious omens; below, you shall extinguish demonic vapors.\nHolding the talismanic registers, you shall subdue and restrain demonic traces.\nAt the assembly of the Imperial Perfected, you shall drive spirits and ride dragons.\nThe Generals of Jia and Geng shall assist and protect your merit.\nEncircling the Six Directions, you shall universally bless the people.\nYour Dao parallels Heaven and Earth; all spirits defer to you.\nYou are hereby specially appointed as Supreme Marshal of the Mysterious Origin, charged with overseeing the Bureau of Primordial Harmony and Celestial Transitions.\nUpon receipt of this decree, act accordingly.\n\nThe Supreme Emperor of Purple Tenuity then addressed the Perfected One: “This text is the Jade Emperor’s secret edict, the august proclamation of the Heavenly Thearch. It must not be lightly transmitted, lest one incur divine censure.”\n\nThe Perfected One bowed deeply and again addressed the Emperor: “I have heard that the Mysterious Warrior General possesses boundless divine power, yet does not occupy the ranks of the deities but instead guards the North. What is the wondrous cause of this efficacy? What is the profound covenant of his numinous clarity? I humbly beseech an explanation to dispel my ignorance.”\n\nThe Emperor’s voice responded to the Perfected One: “In the North above the Central Heaven, all the luminaries pay homage. Without the most divine, who could restrain and suppress?”\n\nThe Perfected One then inquired of the Supreme Emperor of Purple Tenuity: “If there are those among the heavenly and earthly who reverently aspire to the Mysterious Warrior General, what blessings and benefits may they obtain?”\n\nThe Emperor replied: “This divine general, on the sixth, sixteenth, and twenty-sixth days of every month, undergoes celestial review and patrols the Ten Caves. Additionally, on the seventh day of the first month, the eighth day of the second month, the ninth day of the third month, the fourth day of the fourth month, the fifth day of the fifth month, the seventh day of the sixth month, the seventh day of the seventh month, the thirteenth day of the eighth month, the ninth day of the ninth month, the twenty-first day of the tenth month, the seventh day of the eleventh month, and the twenty-seventh day of the twelfth month, he descends to the human realm to sever demonic influences, expel pestilence, protect lives, and ensure longevity, thus fulfilling the mandate of Heaven. Those whose qi is upright and whose hearts are pure, who are wholly loyal and perfectly filial, shall have their names inscribed on jade tablets and be recommended for ascension to immortality. There are further esoteric regulations too numerous to recount.”\n\nThe Perfected One bowed again and addressed the Supreme Emperor of Purple Tenuity: “I have now heard the cause of his manifest transformation. How may those who revere the Mysterious Warrior General pay homage? What expedient means may they employ to obtain blessings and benefits? I humbly request your instruction.”\n\nAt that time, the Emperor addressed the Perfected One: “Within Heaven and Earth, those who with sincere devotion worship the Mysterious Warrior—who, in their lifetime, abstain from foul and rank foods, from poisoned or polluted substances, from onions, garlic, leeks, and coriander, from indulgence in lust and desire, and from assisting in births or handling corpses—if they can sever these attachments, then they may aspire with true devotion. On the days of his descent, they shall receive auspicious blessings. On those nights, they must first purify body and mind, stilling all distracting thoughts.”",
      "overlap_context": "ral purport, that my meager understanding may be enlightened.”\n\nAt that time, the Emperor replied to Wondrous Conduct: “The celestial scriptures are secret—how may they be proclaimed? To reveal heavenly mechanisms would be most improper. The hidden language of the Great Brahma—how may it be made known to all?”\n\nThe Perfected One Wondrous Conduct bowed and prostrated himself, then petitioned again: “Though your servant’s karmic affinity is slight, surely Your Sagely Majesty’s grace is boundless.”",
      "start_char": 1262,
      "end_char": 2057,
      "start_sentence": 73,
      "end_sentence": 116,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.82485580444336,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\谱箓类\\太上说玄天大圣真武本传神咒妙经.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "至五更，躬然香烛，净果枣汤，位列有三。 志纯于一，稽首梼告，无愿不从。 然乃净思虔诚，诵其神咒： 北方玄天，杳杳神君。 亿千变化，玄武灵真。 腾天倒地，驱雷奔云。 队仗千万，扫荡妖氛。 雷公侍从，玉女将军。 鬼神降伏，龙虎潜奔。 威镇五岳，万灵咸遵。 鸣钟击鼓，游行乾坤。 收捕逆鬼，摧斩魔群。 除邪辅正，道气常臻。 急急如元始上帝律令勑。 太阴化生，水位之精。 虚危上应，龟蛇合形。 盘游九地，统摄万灵。 无幽不察，无愿不成。 劫终劫始，剪伐魔精。 救护群品，家国咸宁。 数终末甲，妖氛流行。 上帝有劲，吾故降灵。 戏扬正教，荡邪辟兵。 化洽黎兆，协赞中兴。 敢有小鬼，欲来现形。 吾目一视，五岳摧倾。 急急如太玄律令勑。 妙行真人曰：功德之妙，显应之因。 幸以窃闻，顿开迷懵。 其有蛮夷之辈，愚蠢之人。 耳纵得闻，心无所信。 设有果报，可示一言。 紫微大帝日：虽云愚蠢，必识炎冻。 纵处蛮夷，须知苦乐。 信则神魂清爽，违则祸患萦仍。 致使富乏兄孙， 贫多子息，或男值兵戈而殒命，或女罹淫孕而伤生。 常出入於讼庭，每沈沦於苦海。 销磨产业，耗散资财。 盖缘自咎，故获斯因。 此神将所在，狞妖缩首，邪道遁形。 是以奉之者，福逐云生，灾随电散。 汝因恳问，吾故泄机，陈道纪於微源，使天民之巨庆。 言虽简要，欲汝晓明。 非乃至人，秘之宜也。 真人曰：妙用之理，可得一闻。 大帝曰：昔永寿元年上元之日，元始天尊於八景天宫，向五云座上，与三十六天上帝，七十二福地真人，无量飞天大神，无极长生大圣，金童玉女，九凤八鸾，侍卫於辉光，罗列於左右。 八音自响，众圣咸欣。 严听天尊，说至真之妙法。 肃清道气，绕无上之玄元，方妙理之研精。 俄天门之东北，七声大震，十目齐观，睹下界之冤魔，结冲天之秽气。 众真默尔，大道寂然。 时，妙行真人，问所由於。 元始既敷妙法，合集殊祥，是何异因，於此辄冒。 可垂奥旨，以解众疑。 大帝曰：下元生人，皆禀至道。 受氤氲之清气，以扶卫於赤身。 今以劫运将终，妖魔渐盛。 唯从邪道，不省本源。 乐奉邪神，谄求余福。 昏迷沈乱，贪欲刚强。 不义不仁，不忠不孝。 今为六天魔王，五府瘟曹。 不以尊车，枉致伤害。 或老或少，或女或男。 未尽天年，徒违人世，本非死限。 故使魂孤，怨恨上冲，盘结不散。 此之暴卒，实可悲哀。 妙行真人上白元始：众真矜彼众生，何缘度之？ 天尊乃叩齿一通，流光万里北方，命召太玄将军，剪戮众妖，救度群品。 真人曰：不审此将，而以何缘，位镇北方？ 威降下鬼，扫荡妖氛。 大帝曰：此神未开造化，先票神灵。 易号假名，度人济物。 不伐其善，不矜其能。 荷其玉帝，封为玄武。 真人曰：焉得此将，而往下方，咸度群品，免遭横死，亡者解脱，存者康宁。 天尊以飞符，召之此将。 玄武蒙诏，神兵从行。 至不夜之丹墀，睹强名之大道。 作礼长跪，稽首进言：今日何缘，蒙符特召。 慈颜幸睹，妙旨何归。 炼伏轩墀，俯膺令命。 天尊告曰：吾观下界，怨气冲天。 大众咸惊，高真矜愍。 卿之往彼，汝则钦哉。",
      "translated_text": "By the fifth watch, one should personally prepare incense and candles, pure fruits, and jujube broth, arranging them in three positions. With single-minded devotion, bow deeply and pray—no wish shall go unanswered. Then, with purified thoughts and utmost sincerity, recite the divine incantation:\n\n*In the northern darkness of the Mysterious Heaven,\nThe profound and distant Divine Lord.\nWith countless transformations,\nThe numinous truth of the Dark Warrior.\nSoaring through the skies, overturning the earth,\nDriving thunder and racing clouds.\nWith a host of ten thousand, sweeping away demonic miasma.\nThunder Lords attend as retainers,\nJade Maidens serve as generals.\nGhosts and spirits submit in surrender,\nDragons and tigers flee in concealment.\nVigilant over the Five Peaks,\nAll spirits obey in reverence.\nStriking bells and beating drums,\nPatrolling the cosmos.\nSeizing rebellious ghosts,\nCrushing and slaying demonic hordes.\nExpelling evil and aiding the upright,\nThe Dao’s qi ever draws near.\nSwiftly, swiftly, as the Primordial Celestial Sovereign’s decree commands!*\n\n*Born of the Great Yin,\nEssence of the Water Palace.\nCorresponding above to the Void and Danger constellations,\nSerpent and Tortoise conjoined in form.\nRoaming the Nine Lands,\nCommanding the myriad spirits.\nNo hidden place unperceived,\nNo wish unfulfilled.\nFrom kalpa’s end to kalpa’s beginning,\nSevering and vanquishing demonic essences.\nRescuing and protecting all beings,\nBringing peace to households and nations.\nWhen the kalpa nears its close and the final *jia* day arrives,\nDemon miasmas spread unchecked.\nThe Celestial Sovereign, in his might,\nThus sends me forth in spirit.\nTo propagate the true teaching,\nDispel evil, and repel weapons.\nTransforming and harmonizing the multitudes,\nAiding the restoration of the central realm.\nShould any petty ghost dare appear,\nMy gaze alone shall topple the Five Peaks.\nSwiftly, swiftly, as the Great Mystery’s decree commands!*\n\nThe Wondrous Practitioner of the Dao said: “The marvel of merit and the cause of manifest responses—I have humbly heard them and my confusion is dispelled. Yet there are those among the barbarian tribes, the foolish and dull-witted, who may hear these words but hold no faith in their hearts. If there are indeed karmic retributions, may you reveal them in brief.”\n\nThe Purple Tenuity Great Emperor replied: “Though they be foolish and dull, they must recognize heat and cold. Though they dwell among barbarians, they must know suffering and joy. Those who believe shall find their spirits and souls clear and refreshed; those who defy shall be ensnared by misfortune and calamity. Thus may they become impoverished despite wealth, or bear many children despite poverty; their sons may perish by the sword in war, their daughters may suffer harm from illicit pregnancies. Constantly entangled in lawsuits, ever mired in the sea of suffering, their estates dwindle, their resources dissipate. Such is the consequence of their own faults, the cause they have reaped. Where this divine general presides, fierce demons lower their heads, and perverse paths vanish. Therefore, those who revere him shall find blessings arising like clouds, while disasters scatter like lightning. You have earnestly inquired, and so I reveal this mechanism, tracing the subtle origins of the Dao’s principles, that the people of heaven may receive great felicity. Though my words are concise, I wish you to understand them clearly. Were it not for one such as yourself, this should remain secret.”\n\nThe Perfected One said: “May I hear of the wondrous workings of this principle?”\n\nThe Great Emperor replied: “Formerly, on the Shangyuan Festival of the first year of *Yongshou*, the Primordial Celestial Worthy, upon the Eight Radiant Celestial Palace, seated upon the Five Clouds Throne, addressed the Thirty-Six Celestial Sovereigns, the Seventy-Two Perfected Ones of the Blessed Lands, the boundless Flying Celestial Great Spirits, the Limitless Longevity Great Sages, the Golden Lads and Jade Maidens, the Nine Phoenixes and Eight Simurghs, all arrayed in resplendent attendance to left and right. The Eight Sounds resonated of themselves, and all the sages rejoiced. Solemnly, they listened as the Celestial Worthy expounded the wondrous Dharma of the utmost truth. The Dao’s qi was purified, encircling the supreme Mystery of the Primordial Origin, delving into the subtleties of its profound principles.\n\nSuddenly, from the northeast of the Celestial Gate, seven great peals of thunder resounded, and ten thousand eyes turned as one to behold the grievances of the lower realm, where demonic miasmas coiled upward to the heavens. The assembled Perfected fell silent, and the Great Dao stood still. Then, the Wondrous Practitioner of the Dao inquired as to the cause.\n\nThe Primordial One, having expounded the wondrous Dharma and gathered auspicious signs, asked: ‘What extraordinary cause has provoked this disturbance? May you reveal its profound import to resolve the doubts of all.’\n\nThe Great Emperor said: ‘The people of the Lower Kalpa all receive the utmost Dao, endowed with the pure qi of primordial chaos to sustain their mortal forms. Yet now, as the kalpic destiny nears its end, demonic forces gradually grow strong. They follow only perverse paths, forgetting their original source, delighting in the worship of evil spirits, and flatteringly seeking fleeting blessings. Bewildered and confused, greedy and obstinate, they are neither righteous nor benevolent, neither loyal nor filial. Now, the Demon Kings of the Six Heavens and the Five Offices of Pestilence, disregarding the proper order, wrongfully bring harm—whether old or young, male or female—cutting short their allotted years and forcing them to abandon the world before their time. Thus, their lonely souls, filled with resentment, surge upward in a coil that cannot disperse. Such violent deaths are truly pitiable.’\n\nThe Wondrous Practitioner of the Dao then addressed the Primordial One: ‘The assembled Perfected pity these beings—by what means may they be delivered?’\n\nThe Celestial Worthy struck his teeth once, and a radiance streamed ten thousand miles to the north, summoning the Great Mystery General to sever the demonic hordes and rescue all beings.\n\nThe Perfected One asked: ‘By what cause does this general hold dominion over the northern quarter, subduing lower ghosts and sweeping away demonic miasmas?’\n\nThe Great Emperor replied: ‘Before the unfolding of creation, this spirit already embodied divine numinosity. Assuming names and titles, he delivered people and aided the world, never boasting of his virtues nor priding himself on his abilities. For this, the Jade Emperor enfeoffed him as the Dark Warrior.’\n\nThe Perfected One said: ‘How may this general descend to the lower realm to deliver all beings, sparing them from violent deaths, liberating the dead, and ensuring the living’s well-being?’\n\nThe Celestial Worthy issued a flying talisman to summon the general. The Dark Warrior, receiving the decree, led his divine troops to the Crimson Steps of the Never-Night Palace, where he beheld the Great Dao of mighty renown. Bowing deeply, he knelt and addressed the Celestial Worthy: ‘By what cause today do I merit this special summons? I am fortunate to behold your compassionate countenance—what is the purport of your wondrous decree?’ Kneeling upon the alchemical platform, he reverently received the command.\n\nThe Celestial Worthy declared: ‘I observe the lower realm, where grievances surge to the heavens. All are alarmed, and the exalted Perfected pity them. You shall go there—proceed with reverence!’”",
      "overlap_context": "evotion worship the Mysterious Warrior—who, in their lifetime, abstain from foul and rank foods, from poisoned or polluted substances, from onions, garlic, leeks, and coriander, from indulgence in lust and desire, and from assisting in births or handling corpses—if they can sever these attachments, then they may aspire with true devotion. On the days of his descent, they shall receive auspicious blessings. On those nights, they must first purify body and mind, stilling all distracting thoughts.”",
      "start_char": 2057,
      "end_char": 3272,
      "start_sentence": 117,
      "end_sentence": 202,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.133622884750366,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\谱箓类\\太上说玄天大圣真武本传神咒妙经.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "玄武於是奉命辞天，回光返照，披发跣足，降龟蹑蛇，仙仗雷奔，天丁斓卫。 俄於奖钦，徧彼乾坤。 剪酷毒之妖魔，补恣横之瘟疫。 幽魂生界，苦病离痾。 人鬼分离，冤家解脱。 黎民安泰，国土清平。 玄武再睹天尊，具言道力。 功成事遂，浊降清升。 却返祥光，复还本位。 交乾布斗，激坤指罡，上佐天关。 而作咒曰： 太初太易，无象无形。 莫知重浊，孰辩轻清。 吾於混沌，分其昏明。 天得以健，地得以宁。 民得以养，物得以萌。 邪得以正，神得以灵。 三才之内，万类咸亨。 大道既散，仁义乃兴。 礼乐既作，奸邪斯行。 六义或失，四民有争。 上不宽恕，下不忠贞。 或魔或鬼，或妖或精。 恣横荼毒，干扰生民。 全家染患，累岁刑名。 财物耗散，骨肉伶仃。 性命往逝，灾祸相萦。 秽杂之气，上达天庭。 天尊有命，令吾安平。 有妖皆剪，无鬼不烹。 瘟疫之吏，束首服膺。 鬼精灭爽，邪魔摧倾。 吾有十亿烈士，五千万兵。 天上天下。 从吾降升。 拒吾者灭，奉吾者生。 恶吾者辱，敬吾者荣。 礼吾者寿，非吾者薨。 吾有此令，人鬼咸听。 急急如太玄律令摄。 尔时，妙行真人，无量飞天神王，真仙大众，闻是说已，踊跃作礼，赞叹功德。 秘箓琅函，后有谪仙，传於人世，志道之士，稽首奉行。 太上说玄天大圣真武本传神咒妙经竟",
      "translated_text": "Thus did the Dark Warrior receive the mandate and take leave of Heaven. Turning his radiance inward, he unbound his hair and went barefoot, treading upon the tortoise and serpent. His immortal retinue surged forth like thunder, celestial warriors arrayed in resplendent guard. In an instant, he traversed the cosmos—shearing the cruel and venomous demons, mending the wanton ravages of pestilence. The souls of the netherworld found rebirth; suffering and sickness departed. The living and the dead were sundered; grievances dissolved. The common folk dwelt in peace; the land knew tranquility.\n\nThe Dark Warrior beheld the Celestial Worthy once more and recounted the power of the Dao. The work accomplished, the task fulfilled, the turbid descended and the pure ascended. Withdrawing his auspicious radiance, he returned to his original station, aligning the celestial pivots and directing the earthly forces, aiding the Gate of Heaven above.\n\nThen he intoned the incantation:\n\nIn the Great Beginning, in the Great Simplicity,\nFormless and imageless,\nNone knew the heavy and turbid,\nWho could discern the light and pure?\nWithin the primordial chaos, I divided darkness and light.\nHeaven gained its vigor,\nEarth gained its stability,\nThe people gained their sustenance,\nAll things gained their sprouting.\nThe perverse were rectified,\nThe spirits gained their numinosity.\nWithin the Three Powers,\nAll myriad beings flourished.\n\nWhen the Great Dao dispersed,\nBenevolence and righteousness arose.\nWhen rites and music were established,\nDeceit and perversity followed.\nThe Six Principles faltered,\nThe Four Peoples contended.\nAbove, there was no magnanimity,\nBelow, no loyalty or integrity.\nDemons and ghosts,\nGoblins and spirits,\nRampant in their venom,\nDisturbed the living.\nEntire households fell ill,\nYears burdened by misfortune.\nWealth dissipated,\nKin were left forlorn.\nLives passed away,\nCalamities entwined.\nFoul and noxious qi\nAscended to the celestial court.\n\nThe Celestial Worthy issued his command,\nBidding me to restore peace.\nAll demons were sheared,\nAll ghosts were seared.\nThe officers of pestilence\nBound their heads in submission.\nGhostly spirits were extinguished,\nEvil demons were overthrown.\n\nI possess ten billion fierce warriors,\nFifty million divine troops.\nIn Heaven above,\nOn Earth below,\nThey follow my descent and ascent.\nThose who resist me perish,\nThose who obey me live.\nThose who revile me are shamed,\nThose who revere me are honored.\nThose who honor me gain longevity,\nThose who defy me meet their end.\n\nBy this decree,\nBoth humans and ghosts heed.\nSwiftly, swiftly,\nAs the Great Mysterious Law commands!\n\nAt that time, the Wondrously Practiced Perfected, the immeasurable flying heavenly divine kings, and the assembly of perfected immortals, having heard these words, leapt forth in reverence, praising the merit and virtue. The secret registers, sealed in jade caskets, were later transmitted to the mortal world by banished immortals. Those devoted to the Dao bowed their heads in devotion and put them into practice.\n\nThus concludes *The Wondrous Scripture of the Divine Incantation of the Great Sage of the Dark Heaven, the Perfected Warrior, as Spoken by the Most High*.",
      "overlap_context": "hty renown. Bowing deeply, he knelt and addressed the Celestial Worthy: ‘By what cause today do I merit this special summons? I am fortunate to behold your compassionate countenance—what is the purport of your wondrous decree?’ Kneeling upon the alchemical platform, he reverently received the command.\n\nThe Celestial Worthy declared: ‘I observe the lower realm, where grievances surge to the heavens. All are alarmed, and the exalted Perfected pity them. You shall go there—proceed with reverence!’”",
      "start_char": 3272,
      "end_char": 3779,
      "start_sentence": 203,
      "end_sentence": 245,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.969743490219116,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\谱箓类\\太上说玄天大圣真武本传神咒妙经.txt",
        "category": "谱箓类"
      }
    }
  ]
}