{
  "source_id": "太上大道三元品诫谢罪上法",
  "source_file": "chunked_daozang\\太上大道三元品诫谢罪上法.json",
  "total_chunks": 5,
  "total_original_chars": 5698,
  "total_translated_chars": 36586,
  "total_translation_time": 162.97117066383362,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\玉诀类\\太上大道三元品诫谢罪上法.txt",
    "category": "玉诀类"
  },
  "full_translation": "The *Highest Daoist Rite of the Three Primordials’ Precepts for Repentance and Expiation of Sins*\n**Scripture Title:** *The Supreme Daoist Rite of the Three Primordials’ Precepts for Repentance and Expiation of Sins*\n\nThe Heavenly Worthy speaks: For all who cultivate this supreme rite, on the fifteenth day of the first, seventh, and tenth months, at the three hours of dawn, noon, and midnight, bathe the body and purify it with the five fragrances. When washing, face the southwest, and with a golden ladle, pour the fragrant water thirty-two times in a leftward circle toward the southeast. Close the eyes and visualize the sunlight above the left eye, moonlight above the right eye, the five stars entwined upon the head, and five-colored clouds swirling around the body. The Azure Dragon, White Tiger, Vermilion Bird, and Dark Warrior stand in attendance, along with lions, white cranes, immortal youths holding towels, jade maidens scattering blossoms, and flying immortals riding mounts, all guarding the body.\n\nThen strike the teeth twenty-one times and recite the incantation:\n*\"The heavens are limpid, the qi is pure, the five hues resplendent.\nSun and moon radiate their brilliance, bathing my form.\nDivine essences inwardly cleanse, fragrance refines my essence.\nLight and radiance illumine, shining upon the Supreme Clarity.\nQi admits no dust; the five palaces receive the numinous.\nSins vanish from the Three Paths, calamities dissolve in the Nine Darknesses.\nEvil roots are severed, blessings arise of themselves.\nToday I make my great vow, proclaiming this covenant to all.\nMay my body receive deliverance and ascend to the Imperial Court.\"*\n\nWhen finished, swallow thirty-two times while looking upward. Thus are the five spirits bathed.\n\nAfter bathing, don the cap, sash, and robes. Strike the teeth twelve times and recite the incantation:\n*\"The Five Turbidities are now clear, the Eight Effulgences now bright.\nToday I undergo refinement; sins perish and blessings arise.\nEver shall I fast with the Five Emperors, the perfected and supreme numina.\"*\n\nThen exit and enter the chamber to perform the Dao according to the rite. Upon entering, face east, burn incense, strike the teeth thirty-two times, and pray:\n*\"Most High Three Heavens, Mysterious Primordial Three Qi, Supreme Lord Lao, summon forth from within my body the Three and Five Merit Officials, the left and right attending messengers, the left and right incense-bearing dragon-riding couriers, the jade lads who tend the incense, the jade maidens who transmit words, the Five Emperors’ direct talismans, and the incense officials of the day—thirty-two of each—to emerge. Let those who emerge don their regalia, and let the true officials and divine spirits of this land and domain be awakened. I now burn incense and perform the Dao, presenting my supplications. May I receive the qi of the ten directions’ true perfected ones into my body, that my entreaties swiftly ascend and be heard before the boundless Heavenly Worthies, the Supreme Dao, and the Most Perfect Imperial Lords.\"*\n\n*\"I, so-and-so, a disciple of the Most High Cavernous Mystery and Numinous Treasure, by karmic affinity of past lives, was born into the transformation of the Dao. Through the guidance of my master, the Three Caverns’ Dharma Teacher so-and-so, I was uplifted and delivered, my decayed remains refined, and the scriptures’ teachings imparted. The grace of this surpassing kindness is truly boundless. Yet I was raised in the mundane world, where my five spirits contended, and my sins and impurities ran deep, never self-aware. Growing with my transgressions, they accumulated like mountains and seas. From past lives to the present, I know not their origin, spanning countless kalpas to this day. My sins are recorded in the ledgers of heaven and earth, seized by the Three Officials, bound and consigned to earthly servitude. Though I have striven to cultivate myself, my efforts have not moved the divine; true spirits do not descend, and demonic forces assail me. My thoughts scatter, and my five spirits flee. I constantly fear that one day I shall return to the dark abyss, enmeshed for ten thousand kalpas, forever beyond deliverance. Humbly, on this auspicious day of the Three Primordials’ great celebration, I purify myself, burn incense, and first repent for the transgressions of my past lives and present deeds—sins unforgiven by heaven, unabsolved by earth, unmoved by spirits, and unrelieved by ghosts—my myriad crimes and countless faults, which violate the Three Primordials’ one hundred eighty precepts, the Three Officials’ nine bureaus and one hundred twenty offices, and the judgments of the yin-yang, water-fire, and central palace examiners. Today, I burn incense, surrendering my body, spirit, and life to the boundless Heavenly Worthy, the Supreme Dao Lord, the Thirty-Two Heavens’ Emperors, the ten directions’ great sagely hosts, the perfected lords and venerable ones, the flying heavenly kings, the heavenly, flying, divine, and earthly immortals, the true persons and jade maidens of the Five Marchmounts, the celestial bodies of the heavens, the jade pivot and balance, and all the boundless numinous officials of the ten directions, the Three Realms’ Five Emperors, the Three Officials’ nine bureaus and one hundred twenty offices, the spirits of the Three Rivers, Four Seas, Nine Rivers, and Eight Poles—beseeching your great mercy to absolve all my past and present sins. By the merit of this incense offering, may my sinful roots be eradicated. I pray that my name be stricken from the earthly registers and the black ledgers of the Right Bureau, and inscribed in the Register of Longevity in the Left Bureau of the Southern Palace, to be delivered as an immortal and enjoy boundless existence. After attaining the Dao, may I ascend into formlessness and unite with the true.\"*\n\nFirst, bow nine times facing east and, kneeling, declare:\n*\"I, so-and-so, now surrender my life to the boundless Supreme Numinous Treasure Heavenly Worthy of the East, the great sagely hosts who have attained the Dao, the perfected and venerable divinities, the Supreme Clarity’s Mysterious Primordial, the boundless Three Heavens’ Supreme Dao, the Heavenly Mysterious Elder, the Supreme Lord Lao, the Supreme Venerable One, the August Supreme Lord, the August Venerable One, the Azure Numinous Perfected, the lords of the various heavens, the emperors and venerable ones of the heavens, the Supreme Emperor Lord, the Supreme Emperor Venerable One, the Nine Elders of the Immortal Capital, the Venerable One of the Nine Qi, and the myriad layers of Dao qi, the one thousand two hundred officials. Before the Jade Steps of the Supreme Clarity, the Eastern Pole Elder, the Great Azure Spirit, the Prime Minister Sima, the Azure Lad, the Golden Watchtower’s Sagely Emperor of the Latter Age, the True Yang’s Primordial Azure Divine Person, the Nine Immortals of the Numinous Treasure, the Azure Harmony Jade Maidens, the Jade Lords of the Immortal Hosts, and all the divine spirits of the Eastern Boundless Realm.\"*\n\nI humbly beseech Your boundless compassion to bestow the grace of absolution. From all my past lives to this present incarnation, I have committed offenses—failing in reverence above toward the august sagely deities of the myriad heavens, all divine spirits of the Eastern Boundless Realm, the sun, moon, and stellar lodges, the four seasons and five phases, wind and rain, thunder and lightning, clouds and mists in their due seasons; failing in reverence below toward my masters and elders, the perfected ones of the Five Marchmounts, Four Seas, Three Rivers, Nine Jiang, and Eight Poles, the jade maidens and divine immortals, the numinous officials of the Eastern Realm, the earth deities of the Three Realms, and all divine spirits of the Three Bureaus and Nine Offices.\n\nI have deceived my masters and betrayed the Dao, defiled the celestial scriptures, stolen sacred texts, altered divine sounds, disseminated the supreme Dharma for personal gain, privately transmitted teachings without sanction, broken covenants with the Five Thearchs, plotted rebellion, acted without loyalty, compassion, filial piety, kindness, or benevolence; rebelled against sovereign and father, slaughtered living beings, seized others’ possessions, violated others’ wives, committed incest, colluded with clansmen, envied those superior to me, contended for fame and rank, harbored deceit in speech, slandered the worthy, consumed wine and meat, polluted the five spirits, uttered curses and imprecations, acted without cause, disrupted fasts on auspicious days with capricious joy and anger, disdained the orphaned and widowed, abandoned the elderly, oppressed the poor, and fawned upon the powerful.\n\nSuch transgressions are beyond count, accumulated over lifetimes, deeply entrenched and unresolved. Today, as I burn incense and submit my fate to the East, I beseech Your boundless compassion to absolve all sins committed from past kalpas to this present life, as enumerated above. Grant me a new beginning, that I may reform from this day forth, adhere to the precepts, and dare not transgress again.\n\nI beseech the erasure of my name from the Three Bureaus’ registers of sin, the Black Ledgers of the Right Palace, and the roots of karmic retribution, and its inscription in the Azure Records of the Left Mansion. On this day of great celebration, I lay forth ten thousand vows, humbly confessing and repenting, submitting my fate to the Heavenly Worthy. I pray to the divine spirits and immortals to unite with me in a shared destiny, fostering auspicious affinities, that in life after life without end, I may eternally partake of the natural blessings.\n\nThis done, I remove my headscarf, kowtow, and strike my breast, each ninety times, ceasing thereafter.\n\nHaving rendered thanks to the East, I rise, turn left, and bow once toward the southeast, kneeling to declare:\nI, [Name], now submit my fate to the Supreme Numinous Treasure Heavenly Worthy of the Southeastern Boundless Realm, the great sagely hosts who have attained the Dao, the perfected and august deities, the Southern Elder Lord, the Cinnabar Numinous Elder, the Southern Pole’s Upper Prime Perfected of Everlasting Life, the Controller of Salvation Sima, the Lords of Life and Destiny, the Life-Preserving Lord Han, the Great Sage Divine King of Resurrecting the Dead and Restoring the Spirit through Bone Refinement, the Lord of Myriad Blessings, the Venerable One of Myriad Blessings, the Jade Maidens of Supreme Harmony, and all divine spirits of the Southeastern Boundless Realm.\nI beseech grace and render thanks as in the Eastern rite.\nThis done, I kowtow and strike my breast, each twelve times, ceasing thereafter.\n\nHaving rendered thanks to the Southeast, I rise, turn left, and bow thrice toward the South, kneeling to declare:\nI, [Name], now submit my fate to the Supreme Numinous Treasure Heavenly Worthy of the Southern Boundless Realm, the great sagely hosts who have attained the Dao, the perfected and august deities, the Southern Supreme Thearch of the Boundless Dao, the Cinnabar Numinous Elder, the Jade Maidens of Supreme Harmony, the Controller of Longevity Sima, the Life-Preserving Lord, the Lords of Life and Destiny, the Southern Pole’s Lord of Salvation, the Flying Perfected, the Divine King of Salvation and Rebirth, the Divine Immortal Lord of Salvation who inscribes life in the Jade Calendar, the Lords of Myriad Blessings, Myriad Salvations, Myriad Lives, and Myriad Qi, and all divine spirits of the Southern Boundless Realm.\nI render thanks as in the preceding rite.\nThis done, I kowtow and strike my breast, each thirty times, ceasing thereafter.\n\nHaving rendered thanks to the South, I rise, turn left, and bow once toward the southwest, kneeling to declare:\nI, [Name], now submit my fate to the Supreme Numinous Treasure Heavenly Worthy of the Southwestern Boundless Realm, the great sagely hosts who have attained the Dao, the perfected and august deities, the Heavenly August Elder, the Southern Pole’s Primordial Perfected Lord, the hosts of the Great Numinous of Cavern Yang, the Divine King of Flying Qi and Life, the jade maidens and divine immortals, and all divine spirits of the Southwestern Boundless Realm.\nI beseech grace and render thanks as in the preceding rite.\nThis done, I kowtow and strike my breast, each twelve times, ceasing thereafter.\n\nHaving rendered thanks to the Southwest, I rise, turn left, and bow seven times toward the West, kneeling to declare:\nI, [Name], now submit my fate to the Supreme Numinous Treasure Heavenly Worthy of the Western Boundless Realm, the great sagely hosts who have attained the Dao, the perfected and august deities, the Supreme Thearch of the Western Florescence and Supreme Mystery of the Boundless Dao, the True Mother of Golden Hall and Jade Immortals, the Sagely Emperor Lord of the Golden Watchtower’s Latter Age, the Primordial Heavenly Master, the Lord of Myriad Sages and Dao, the Perfected of the Four Poles, the jade maidens and divine immortals, and all divine spirits of the Western Boundless Realm.\nI beseech grace and render thanks as in the preceding rite.\nThis done, I kowtow and strike my breast, each seventy times, ceasing thereafter.\n\nHaving rendered thanks to the West, I rise, turn left, and bow once toward the northwest, kneeling to declare:\nI, [Name], now submit my fate to the Supreme Numinous Treasure Heavenly Worthy of the Upper Boundless Realm, the great sagely hosts who have attained the Dao, the perfected and august deities, the Supreme Thearchs of the Boundless Dao above, below, center, four directions, eight quarters, and thirty-two heavens, the august lords and venerable ones of the Supreme Non-Action and Great Dao, the Most Supreme, Unsurpassed, Unbounded, Infinite, Omniscient, All-Illuminating, and Utmost Perfected, the countless hosts of Dao qi, the Primordial Without Beginning, the Vast Without Limit, the Chaotic Without Form, the Void and Spontaneous, the Supreme Without Root, the Profoundly Quiescent and Mystically Penetrating, the Great Wisdom’s Origin, the Orthodox Unity and Alliance of the Supreme Non-Action and Great Dao, the Divine Lord within the Dao, the Supreme Without Origin, the countless august lords and venerable ones of virtue and power, the Lord of Supreme Virtue and Power, the Venerable One of Supreme Virtue and Power, the Supreme Lord of Myriad Lives, the Venerable One of Myriad Lives, the Supreme Lord of Myriad Qi, the Venerable One of Myriad Qi, the Supreme Lord of Myriad Primordials, the Venerable One of Myriad Primordials, the Supreme Lord of Myriad Blessings, the Venerable One of Myriad Blessings, the august lords and venerable ones of the Heaven of Profound Darkness, the Newly Emerged Elder Lord, the Supreme Mystery of the Three Heavens and Boundless Dao, the Supreme Venerable One, the Lords of the Three Supreme Qi, the Supreme Elder Lord, the Supreme Venerable One, the Supreme Clarity Lord, the Supreme Clarity Venerable One, the Supreme Mystery’s First Lord, the Supreme Mystery’s Venerable One, the Central Yellow Orthodox Unity Lord, the Central Yellow Venerable One, the Supreme Prime Lord, the Supreme Prime Venerable One, the Supreme Origin Lord, the Supreme Origin Venerable One, the Supreme Beginning Lord, the Supreme Beginning Venerable One, the Supreme Simplicity Lord, the Supreme Simplicity Venerable One, the Supreme Void Lord, the Supreme Void Venerable One, the Supreme Unity Lord, the Supreme Unity Venerable One, the Supreme Pattern Lord, the Supreme Pattern Venerable One, the Supreme Peace Lord, the Supreme Peace Venerable One, the Supreme Abyss Lord, the Supreme Abyss Venerable One, the Heavenly Thearch Lord, the Heavenly Thearch Venerable One, the Nine Elders of the Immortal Capital, the Nine Elders, the Lord of the Jade Calendar, the Venerable One of the Jade Calendar, the Lords of the Nine Qi, the Venerable Ones of the Nine Qi, the countless august lords and venerable ones of myriad layers of Dao qi, the twelve hundred officials and their venerable ones, before the Jade Steps of Supreme Clarity, the Supreme Jade Perfected Lord, the Supreme Jade Perfected Venerable One, the Lords of the Five Immortals, the Venerable Ones of the Five Immortals, the Lords of the Nine Numinous, the Venerable Ones of the Nine Numinous, the Twelve Perfected Lords of Supreme Clarity, the Twelve Perfected Venerable Ones, the Twenty-Four Divine Lords, the Twenty-Four Divine Venerable Ones, the Thirty-Six Perfected Lords of Supreme Clarity, the Thirty-Six Perfected Venerable Ones, the Lords of the Five Qi, the Venerable Ones of the Five Qi, the Lord of Yin-Yang and Generative Qi, the Venerable One of Generative Qi, the Supreme Supreme Unity Lord, the Supreme Unity Venerable One, the Supreme Thearch of August Heaven, the Supreme Venerable One of August Heaven, the Supreme Primordial Lord of the Boundless, the Supreme Primordial Venerable One, the Supreme Unity Lord, the Supreme Unity Venerable One, the Lord of Numinous Treasure, the Venerable One of Numinous Treasure, the Lord of True Treasure, the Venerable One of True Treasure, the Lord of Heavenly Treasure, the Venerable One of Heavenly Treasure, the Lord of Mystic Treasure, the Venerable One of Mystic Treasure, the Lord of Primordial Spirit, the Venerable One of Primordial Spirit, the Lord of Primordial Perfection, the Venerable One of Primordial Perfection, the Lord of Primordial Numinous, the Venerable One of Primordial Numinous, the August Elder Lord, the August Elder Venerable One, the Southern Pole Lord, the Southern Pole Venerable One, the Yellow Thearch Elder Lord, the Yellow Thearch Venerable One, the Yellow Elder Lord, the Yellow Elder Venerable One, the Supreme Harmony Lord, the Supreme Harmony Venerable One, the Supreme August Perfected Lord of the True Dao, the august lords and venerable ones, the Ancient Heavenly Master Lord, the Heavenly Master Venerable One, the Three Masters Lord, the Three Masters Venerable One, the Parents of Myriad Dao, the Parents of Myriad Virtues, the Parents of Heaven and Earth, from whom divine immortals emerge and gather, the Eastern King Father, the Western Queen Mother, the Lord of the Sun, the Lady of the Moon, the Lords of the Five Planets, the August Consorts of the Five Planets, the Perfected Lords of the Jade Armillary and Nine Stars, the hosts of divine immortals and perfected ones, the sagely fathers and mothers, the jade maidens and divine immortals, and all divine spirits of the Boundless Realm of the Highest Heaven of Miro.\n\nHaving sought grace and offered thanks according to the above rites, the ritual concludes. The adept knocks their head to the ground and strikes their breast, each act performed three hundred and twenty times before ceasing.\n\nThe thanks to the Upper Realm complete, the adept turns left and faces the northeast, bowing three times to the Solar Palace. Kneeling upright, they declare:\n*\"Your servant [Name] now surrenders their life to the Lady of the Sun, the Radiant Child of Vermilion Light within the Sun, the Jade Maidens of Cinnabar Clouds, and all divine immortals of the Solar Palace. I humbly beseech forgiveness for the transgressions and debts accrued since my birth—offenses that have offended the celestial radiance, bringing karmic retribution in life and death. May all be absolved and pardoned, that my body may attain luminosity, sharing the same splendor as the sun, and enjoy boundless existence, receiving blessings by nature’s grace.\"*\n\nThis done, the adept knocks their head to the ground and strikes their breast, each act performed thirty times before ceasing.\n\nThe thanks to the Solar Palace complete, the adept rises, turns left, and faces the southwest, bowing seven times to the Lunar Palace. Kneeling upright, they declare:\n*\"Your servant [Name] now surrenders their life to the Lady of the Moon, the Water Mother of Stone Radiance, the Round-Light Child, the Jade Maidens of Scattered Brilliance, and all divine immortals of the Lunar Palace. I humbly beseech forgiveness for the transgressions and debts accrued since my birth—offenses that have offended the celestial radiance, bringing karmic retribution in life and death. May all be absolved and pardoned, that my body may attain luminosity, sharing the same splendor as the moon, and enjoy boundless existence, receiving blessings by nature’s grace.\"*\n\nThis done, the adept knocks their head to the ground and strikes their breast, each act performed seventy times before ceasing.\n\nThe thanks to the Lunar Palace complete, the adept turns left and faces north, bowing nine times. Kneeling upright, they declare:\n*\"Your servant [Name] now surrenders their life to all celestial asterisms, the Jade Armillary and Nine Stars, the Seven Stars of the Northern Dipper, the Nine Stars of the Three Terraces, the Ladies of the Five Planets, the Twenty-Eight Constellations, the great deities of the three hundred and sixty-five degrees of the celestial sphere, the Perfected Sovereigns within the stars, the divine consorts and spirit maidens, and all jade maidens and divine immortals of the stellar realm. I humbly beseech forgiveness for the transgressions and debts accrued since my birth—offenses that have offended the celestial radiance, bringing karmic retribution in life and death. May all be absolved and pardoned, that my body may attain luminosity, sharing the same splendor as the stars, and enjoy boundless existence, receiving blessings by nature’s grace.\"*\n\nThis done, the adept knocks their head to the ground and strikes their breast, each act performed three hundred and sixty times before ceasing.\n\nThe thanks to the Stellar Palace complete, the adept turns left and faces the Eastern Marchmount, bowing twice. Kneeling upright, they declare:\n*\"Your servant [Name] now surrenders their life to the Great Deity of the Azure Emperor of Mount Tai, the Eastern Marchmount, the Flying Immortals and Perfected Ones, all divine officials, and the spirits of all renowned mountains and marshes. I humbly beseech forgiveness for the transgressions and debts accrued since my birth—offenses that have offended the great deities of the Eastern Marchmount and the sacred mountains. May the primordial evils be absolved and pardoned, my name inscribed in the registers of immortals, and my sins erased from the celestial records, that I may befriend the great deities by nature’s grace.\"*\n\nThis done, the adept knocks their head to the ground and strikes their breast, each act performed twenty times before ceasing.\n\nNext, the adept turns to the south and bows twice. Kneeling upright, they declare:\n*\"Your servant [Name] now surrenders their life to the Great Deity of the Vermilion Emperor of Mount Heng, the Southern Marchmount, the Flying Immortals and Perfected Ones, all divine officials, and the spirits of all renowned mountains and marshes.\"*\nThe thanks are offered in accordance with the rites for the Eastern Marchmount.\n\nNext, the adept turns to the southwest and bows twice. Kneeling upright, they declare:\n*\"Your servant [Name] now surrenders their life to the Great Deity of the Yellow Emperor of Mount Song, the Central Marchmount, the Flying Immortals and Perfected Ones, all divine officials, and the spirits of all renowned mountains and marshes.\"*\nThe thanks are offered in accordance with the rites for the Eastern Marchmount.\n\nNext, the adept turns to the west and bows twice. Kneeling upright, they declare:\n*\"Your servant [Name] now surrenders their life to the Great Deity of the White Emperor of Mount Hua, the Western Marchmount, the Flying Immortals and Perfected Ones, all divine officials, and the spirits of all renowned mountains and marshes.\"*\nThe thanks are offered in accordance with the rites for the Eastern Marchmount.\n\nNext, the adept turns to the north and bows twice. Kneeling upright, they declare:\n*\"Your servant [Name] now surrenders their life to the Great Deity of the Black Emperor of Mount Heng, the Northern Marchmount, the Flying Immortals and Perfected Ones, all divine officials, and the spirits of all renowned mountains and marshes.\"*\nThe thanks are offered in accordance with the rites for the Eastern Marchmount.\n\nThe thanks to the Five Marchmounts complete, the adept turns left and faces north, bowing twelve times to the Water Officials. Kneeling upright, they declare:\n*\"Your servant [Name] now surrenders their life to the Great Emperor of Fusang, the Divine King of the Yang Valley, the Great Deities of the Primal Source and Abyssal Depths, the Water Emperors of the Three Rivers, Four Seas, and Nine Jiang, the River Lords of the Twelve Huai and Ji, the River Marquises, the Two Thousand Stone Officials of the Rivers, the Lady of the Clear River, the divine immortals of the Water Palaces, and all divine officials. I humbly beseech forgiveness for the countless transgressions and debts accrued from past lives to this day—offenses that have violated the primordial evils under the jurisdiction of the Water Officials. May I be absolved and pardoned. Today, I burn incense and offer my first thanks to the great deities, surrendering my life and body, beseeching deliverance from death, the eradication of all karmic roots, and the removal of my name from the water registers of retribution. May my name be inscribed in the registers of immortals, that I may enjoy boundless existence and merge with the Dao in truth.\"*\n\nThis done, the adept knocks their head to the ground and strikes their breast, each act performed two hundred and eighty times before ceasing.\n\nThe thanks to the Water Officials complete, the adept turns to the north and bows three times to the Three Treasures and Sacred Scriptures. Kneeling upright, they declare:\n*\"Your servant [Name] now surrenders their life to the Most High, Boundless, and Supreme Dao of the Thirty-Six Revered Scriptures; the Three Treasures of the Numinous Texts; the charts, registers, talismans, and celestial writings of the divine immortals; the natural celestial books of gold and jade characters; the jade lads and maidens who attend the scriptures; and the mighty deities of the Three Divisions. The thanks are offered in accordance with the rites for the Eastern Marchmount.\"*\n\nThis done, the adept knocks their head to the ground and strikes their breast, each act performed three hundred and sixty times before ceasing.\n\nThe ritual concluded, the merits of the rites are declared. All officials simultaneously turn east, kneel upright, and click their teeth twenty-four times. They recite their received titles in full, prostrate themselves twice, and make their report:\n*\"To the Most High, Boundless, and Supreme Dao; the Most High Lord of the Dao; the Most High Lord Lao; the Most High Venerable One; the Supreme Mysterious Elder; the Boundless Dao of the Ten Directions; the Heavenly Worthies of the Dao and Virtue; the Most Perfect and Great Emperor; the Celestial Emperor; the Heavenly Master Lord; and the Great Dharma Master of the Numinous Treasure who Oversees the Retreat—\nWe, your humble servants, though base and unworthy, have loved the Dao and delighted in immortality. By error, we have received the duties of this office and ascended to the Nine Mysteries, yet our aspirations are feeble and our abilities meager. Still, we offer ourselves wholly, joining hands to fulfill our roles.\nOn this day of [date] at [hour], in the [prefecture], [county], [township], and [village], we have established the retreat, burned incense, recited scriptures, meditated upon the deities, and contemplated the Perfected Ones. For [number] days and nights, at [hour], we have performed the rites of repentance and thanksgiving.\nThe rites now complete, we report to the Flying Immortals, Heavenly Immortals, Earthly Immortals, and the celestial cavalry of the Five Directions; to the jade lads and maidens who attend the scriptures and incense; to the officials of the Numinous Treasure; to the Perfected Ones who oversee the retreat; and to the divine immortals who monitor the Five Marchmounts, Four Waterways, and Four Directions. May they return to their true palaces, ascend in rank among the immortals, receive imperial titles commensurate with their stations, and be appointed as Perfected Ones according to their merits, in accordance with the rites of the Great Perfected.\"*\n\nMay we, your servants, seek the Dao and attain the Dao, seek immortality and attain immortality. May we divide our forms and transform in seventy-four directions, with the Three Primes descending to summon green chariots, soaring through the Upper Clarity, ascending the radiance of the Nine Heavens, sharing splendor with the sun and moon, and aligning the wheels of the Three Treasures.\n\nWe humbly beseech the Most Sacred to oversee our cinnabar sincerity. Yet our study of the Dao remains incomplete, and the rites of fasting and purification are difficult to perfect. We fail to conform to the proper forms, transgressing in our conduct and violating the statutes, thus incurring the scrutiny of the Four Offices, the jurisdiction of the Five Emperors, and accumulating a thousand transgressions and ten thousand sins. We beg for your forgiveness and pardon.\n\nAlas, we were ignorant and unaware, blind to our offenses and punishments. May the Five Body Perfected Officials within us ascend to the Mysterious Capital in accordance with their merits, complete their duties, and return to our bodies, ascending with us to soar through the Great Void. We respectfully report this and await your decree. With utmost reverence and trepidation, we bow twice in prostration.\n\nThe rites concluded, we proceed leftward to the west, then face east to offer incense thrice, reciting the incantation:\n\n*\"Incense Officials and Messengers, Lords of the Left and Right Dragon-Tiger, Courier Dragon Riders bearing incense: may our quiet chamber and fasting hall generate spontaneous golden liquid, cinnabar essence of the hundred spirits, and intermingling mushroom blossoms before this incense flame. May we attain the Dao and achieve divine immortality, our entire household receiving blessings, all above and below granted grace. May the jade lads and maidens of the ten directions attend the incense smoke, conveying our petition directly to the presence of the Boundless Supreme Great Dao.\"*\n\nThe Heavenly Worthy declared: *\"This Three Primes Sincere Repentance Rite is the supreme method. Within the Three Primes’ palaces, conceal your form and spirit, refine the roots of transgression, and cultivate the Dao to ascend as immortals. Scholars should perform this thrice yearly. In its practice, let the cinnabar of the heart and the intent be exhausted, spirit and form enduring together without weariness or fatigue. Thus shall you move the myriad heavens, the Three Primes erase your sins from the Black Register, the Northern Emperor remove death and grant life, the Three Offices endorse your merit, and the Supreme Mystery record you among the immortals.*\n\n*Those who seek the Dao must endure hardship to penetrate the depths, cultivate cinnabar to move the spirits, persevere to achieve, accumulate merit to attain, uphold resolve to prevail, and dedicate the heart to succeed. Let the body labor at the outset so the spirit may rejoice in the end, ultimately attaining non-action and entering spontaneity.*\n\n*Yet those stained by sin covet treasures and worldly pleasures, indulging in fleeting glory, unaware of their inevitable end—returning to suffering, mired in the Three Offices, forever sinking through ten thousand kalpas, with no hope of return. Thus do the wise and foolish differ in their aspirations. The foolish value beginnings, while the wise esteem endings. The divergence between wisdom and folly—how can it be described?\"*\n\nThe Heavenly Worthy continued: *\"For scholars, on the most auspicious days of the Three Primes, refine yourselves with fragrant waters, bathe the Five Spirits, so that qi becomes serene and form upright, spirit refreshed and truth conjoined. The body shall not receive filth, qi shall not gather dust, the Three Passes shall be purified and emptied, and no evil shall intrude. The Three Fields and Eight Sceneries shall be luminous within the body. Through ingestion, guiding, and leading, the Five Palaces shall be suffused, filling inner and outer, all attaining immortality. The superior shall soar, riding radiance and clouds; the middling shall conceal and transform, sitting in stillness or standing in dissolution; the inferior shall transcend mortality, becoming Wheel-Turning Sage Kings, extinguished yet enduring, ultimately achieving divine immortality. This method is lofty and wondrous, subtle and difficult to surpass. I now reveal it to you—apply it with diligence.\"*\n\nThe Dao Lord bowed and reverently received these essential words.\n\nThe Heavenly Worthy declared: *\"Those who have accumulated study yet failed to attain the Dao are burdened by their own karmic debts, reported by the Three Offices, detained by the Nine Bureaus, and examined by the one hundred twenty left and right investigating officials. Their evil roots unsevered, demonic forces assail them, causing the Five Spirits to contend, the body to unwittingly transgress, sins and impurities to accumulate daily, and the divine immortals to depart. Though they encounter myriad methods, their karmic roots remain uncut, their efforts in vain, and they gain nothing until death.*\n\n*Now, on the great auspicious day of the Three Primes’ celebration, as the chariots of the myriad heavens return and the host of sages assemble, the records of life and death, merit and transgression are reviewed. The Dao’s universal compassion nurtures all beings. Those whose names enter the register of death are bound for kalpas, forever entangled, with no hope of liberation. To study without benefit—how grievous!*\n\n*Thus, I open the Purple Yang Jade Case and reveal the Three Primes Sincere Repentance Rite to deliver scholars, perfect their merit, and proclaim the celestial statutes. For those who have not yet attained the Dao, regardless of the measure of their merit or transgression, let all with sincerity receive this great method, erase their names from the sin registers, and inscribe them in the immortal rolls. From this day forth, I universally proclaim to the myriad heavens: without distinction of high or low, deep or distant, great or small, boundless or limitless, hidden or obscure, silent or resounding, in the profound and mysterious communion of the Great Wisdom Origin, the Three Offices, Nine Bureaus, one hundred twenty investigating officials, and all divine spirits shall comply and obey.\"*\n\nThereupon, the host of great sages of the myriad heavens, the boundless honored deities, and the Supreme Dao Lord all rose as one, raising their hands to address the assembly, snapping their fingers in approval.\n\nAt that moment, the Heavenly Worthy opened the great mercy of universal pardon. All male and female beginners among the heavenly hosts reverently practiced the great method, immediately receiving deliverance, their bodies attaining divine immortality, ascending in broad daylight to the imperial palaces. Those of virtuous heart and devout faith who respectfully followed this method were all delivered, transcending the wheel of life and death without undergoing earthly trials. With merit perfected and virtue fulfilled, they attained the Dao of immortality, their ranks equal to the flying heavens, roaming the ten directions.\n\nThe Heavenly Worthy declared: *\"On the most auspicious days of the Three Primes, practicing the Three Primes Sincere Repentance Rite will prompt the Three Offices and Nine Bureaus to separately record your names, the Five Emperors to endorse your merit, and your names to be listed among the heavens. The host of immortals shall rejoice, the myriad spirits shall grant pardon, karmic debts shall be dispersed, sinful roots universally dissolved, and the Three Assemblies moved. The Three Offices, Nine Bureaus, and one hundred twenty investigating officials shall erase your names from the Black Registers, sever karmic roots, inscribe your names in the Left Contract and Azure Record, with the myriad spirits in attendance, the Three Realms’ officials in welcome, demonic forces subdued, a thousand calamities averted, and the Dao’s truth naturally arising—thus attaining divine immortality.\"*\n\nThe Supreme Great Dao’s Three Primes Precepts Repentance Rite of Supreme Merit is here concluded.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "上大道三元品戒谢罪上法 经名：太上大道三元品戒谢罪上法。 撰人不祥，约出于东晋。 原系《三元品戒经》 中一篇，后分出单行。 一卷。 底本出处：《正统道藏》洞玄部玉诀类。 太上大道三元品戒谢罪上法 天尊言：凡修上法，常以正月十五日、七月十五日、十月十五日，平旦、正中、夜半三时，沐浴身形，五香自洗。 临沬浴时，向西南，以金杓回香汤，东南左转三十二过。 闭眼思日光在左目上，月光在右目上，五星缨络头上，五色之云，匝绕一身，青龙白虎，朱雀玄武，狮子白鹤，罗列左右，仙童执巾，玉女散华，飞仙乘骑，侍卫身形。 便叩齿二十一通，咒曰： 天澄气清，五色高明。 日月吐晖，灌我身形。 神津内盥，香扬炼精。 光景洞曜，焕映上清。 气不受尘，五府纳灵。 罪灭三涂，祸消九冥。 恶根断绝，福庆自生。 今日大愿，一切告盟。 身受开度，升入帝庭。 毕，仰咽三十二过止。 便洗沐五神也。 沐浴毕，冠带衣服。 又叩齿十二通，咒曰： 五浊已清，八景已明。 今日受炼，罪灭福生。 长与五帝，斋真上灵。 便出而入室，依法行道也。 入室东向烧香，叩齿三十二通，祝曰： 无上三天玄元始三炁太上老君，召出臣身中三五功曹、左右官使者、左右捧香驿龙骑吏、侍香玉童、传言玉女、五帝直符、直日香官，各三十二人出。 出者严装，开启此间土地里域真官正神，臣今正尔烧香行道，陈乞所愿，愿得十方正真之气，入臣等身中，令所启速达，上闻无极天尊太上大道至真上帝几前。 无上洞玄灵宝弟子某岳先生臣某，宿世缘会，得生道化，蒙三洞法师先生某所见启拔，开度腐骸，参以经法，过泰之恩，实在罔极。 而臣生长流俗，五神争竞，尘深罪秽，永不自觉，与罪同长，山海弥积，前生至今，不知缘来，凡以几劫，逮及今日，罪结天地，在何簿目，为三官执举，拘逮地役，虽自修励，而无感彻，真灵不降，众魔所伐，致思念不专，五神飞越。 常恐一旦归命幽壑，弥纶万劫，终天无拔。 谨以三元大庆吉日，清斋烧香，首谢前身及乎今日积行所犯、天所不原、地所不赦、神所不哀、鬼所不放亿罪兆过，触犯三元百八十条、三官九府百二十曹、阴阳水火、左右中宫考吏之罪。 今故烧香，归身归神归命无极天尊太上道君、三十二天上帝、十方大圣众，至真诸君丈人、飞天神王、天仙飞仙神仙地仙、五岳诸真人玉女、诸天日月星宿、璇玑玉衡，及地上十方无极诸灵官、三界五帝、三官九府百二十曹、三河四海九江八极众神灵司诸官，乞赐大恩，一切原除宿身今生所犯之罪。 以今烧香功德，拔度罪根，愿削除地简，绝灭右府黑簿罪录，度上南宫左府长生青录之中，神仙度世，永享无穷。 得道之后，升入无形，与真合同。 第一东向九拜，长跪言： 臣某今归命东方无极太上灵宝天尊、已得道大圣众、至真尊神、太清玄元无上三天无极大道、天上玄老、太上老君、太上丈人、皇上老君、皇上丈人、青灵上真、诸天常君、诸天帝丈人、太帝君、太帝丈人、九老仙都君、九气丈人等，百千万重道气、千二百官君，太清玉陛下东极老人青华大神、上相司马青童君、金阙后圣帝君、真阳始青神人、灵宝九仙君等、青和玉女、主仙玉郎，东方无极世界一切神灵。",
      "translated_text": "The *Highest Daoist Rite of the Three Primordials’ Precepts for Repentance and Expiation of Sins*\n**Scripture Title:** *The Supreme Daoist Rite of the Three Primordials’ Precepts for Repentance and Expiation of Sins*\n\nThe Heavenly Worthy speaks: For all who cultivate this supreme rite, on the fifteenth day of the first, seventh, and tenth months, at the three hours of dawn, noon, and midnight, bathe the body and purify it with the five fragrances. When washing, face the southwest, and with a golden ladle, pour the fragrant water thirty-two times in a leftward circle toward the southeast. Close the eyes and visualize the sunlight above the left eye, moonlight above the right eye, the five stars entwined upon the head, and five-colored clouds swirling around the body. The Azure Dragon, White Tiger, Vermilion Bird, and Dark Warrior stand in attendance, along with lions, white cranes, immortal youths holding towels, jade maidens scattering blossoms, and flying immortals riding mounts, all guarding the body.\n\nThen strike the teeth twenty-one times and recite the incantation:\n*\"The heavens are limpid, the qi is pure, the five hues resplendent.\nSun and moon radiate their brilliance, bathing my form.\nDivine essences inwardly cleanse, fragrance refines my essence.\nLight and radiance illumine, shining upon the Supreme Clarity.\nQi admits no dust; the five palaces receive the numinous.\nSins vanish from the Three Paths, calamities dissolve in the Nine Darknesses.\nEvil roots are severed, blessings arise of themselves.\nToday I make my great vow, proclaiming this covenant to all.\nMay my body receive deliverance and ascend to the Imperial Court.\"*\n\nWhen finished, swallow thirty-two times while looking upward. Thus are the five spirits bathed.\n\nAfter bathing, don the cap, sash, and robes. Strike the teeth twelve times and recite the incantation:\n*\"The Five Turbidities are now clear, the Eight Effulgences now bright.\nToday I undergo refinement; sins perish and blessings arise.\nEver shall I fast with the Five Emperors, the perfected and supreme numina.\"*\n\nThen exit and enter the chamber to perform the Dao according to the rite. Upon entering, face east, burn incense, strike the teeth thirty-two times, and pray:\n*\"Most High Three Heavens, Mysterious Primordial Three Qi, Supreme Lord Lao, summon forth from within my body the Three and Five Merit Officials, the left and right attending messengers, the left and right incense-bearing dragon-riding couriers, the jade lads who tend the incense, the jade maidens who transmit words, the Five Emperors’ direct talismans, and the incense officials of the day—thirty-two of each—to emerge. Let those who emerge don their regalia, and let the true officials and divine spirits of this land and domain be awakened. I now burn incense and perform the Dao, presenting my supplications. May I receive the qi of the ten directions’ true perfected ones into my body, that my entreaties swiftly ascend and be heard before the boundless Heavenly Worthies, the Supreme Dao, and the Most Perfect Imperial Lords.\"*\n\n*\"I, so-and-so, a disciple of the Most High Cavernous Mystery and Numinous Treasure, by karmic affinity of past lives, was born into the transformation of the Dao. Through the guidance of my master, the Three Caverns’ Dharma Teacher so-and-so, I was uplifted and delivered, my decayed remains refined, and the scriptures’ teachings imparted. The grace of this surpassing kindness is truly boundless. Yet I was raised in the mundane world, where my five spirits contended, and my sins and impurities ran deep, never self-aware. Growing with my transgressions, they accumulated like mountains and seas. From past lives to the present, I know not their origin, spanning countless kalpas to this day. My sins are recorded in the ledgers of heaven and earth, seized by the Three Officials, bound and consigned to earthly servitude. Though I have striven to cultivate myself, my efforts have not moved the divine; true spirits do not descend, and demonic forces assail me. My thoughts scatter, and my five spirits flee. I constantly fear that one day I shall return to the dark abyss, enmeshed for ten thousand kalpas, forever beyond deliverance. Humbly, on this auspicious day of the Three Primordials’ great celebration, I purify myself, burn incense, and first repent for the transgressions of my past lives and present deeds—sins unforgiven by heaven, unabsolved by earth, unmoved by spirits, and unrelieved by ghosts—my myriad crimes and countless faults, which violate the Three Primordials’ one hundred eighty precepts, the Three Officials’ nine bureaus and one hundred twenty offices, and the judgments of the yin-yang, water-fire, and central palace examiners. Today, I burn incense, surrendering my body, spirit, and life to the boundless Heavenly Worthy, the Supreme Dao Lord, the Thirty-Two Heavens’ Emperors, the ten directions’ great sagely hosts, the perfected lords and venerable ones, the flying heavenly kings, the heavenly, flying, divine, and earthly immortals, the true persons and jade maidens of the Five Marchmounts, the celestial bodies of the heavens, the jade pivot and balance, and all the boundless numinous officials of the ten directions, the Three Realms’ Five Emperors, the Three Officials’ nine bureaus and one hundred twenty offices, the spirits of the Three Rivers, Four Seas, Nine Rivers, and Eight Poles—beseeching your great mercy to absolve all my past and present sins. By the merit of this incense offering, may my sinful roots be eradicated. I pray that my name be stricken from the earthly registers and the black ledgers of the Right Bureau, and inscribed in the Register of Longevity in the Left Bureau of the Southern Palace, to be delivered as an immortal and enjoy boundless existence. After attaining the Dao, may I ascend into formlessness and unite with the true.\"*\n\nFirst, bow nine times facing east and, kneeling, declare:\n*\"I, so-and-so, now surrender my life to the boundless Supreme Numinous Treasure Heavenly Worthy of the East, the great sagely hosts who have attained the Dao, the perfected and venerable divinities, the Supreme Clarity’s Mysterious Primordial, the boundless Three Heavens’ Supreme Dao, the Heavenly Mysterious Elder, the Supreme Lord Lao, the Supreme Venerable One, the August Supreme Lord, the August Venerable One, the Azure Numinous Perfected, the lords of the various heavens, the emperors and venerable ones of the heavens, the Supreme Emperor Lord, the Supreme Emperor Venerable One, the Nine Elders of the Immortal Capital, the Venerable One of the Nine Qi, and the myriad layers of Dao qi, the one thousand two hundred officials. Before the Jade Steps of the Supreme Clarity, the Eastern Pole Elder, the Great Azure Spirit, the Prime Minister Sima, the Azure Lad, the Golden Watchtower’s Sagely Emperor of the Latter Age, the True Yang’s Primordial Azure Divine Person, the Nine Immortals of the Numinous Treasure, the Azure Harmony Jade Maidens, the Jade Lords of the Immortal Hosts, and all the divine spirits of the Eastern Boundless Realm.\"*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1257,
      "start_sentence": 0,
      "end_sentence": 39,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.527252197265625,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\太上大道三元品诫谢罪上法.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "乞愿直垂大慈开宥之恩，原臣身前生以来、逮及今日受生所犯，上不敬诸天大圣尊神、东方无极世界一切神灵，日月星宿、四时五行、风雨雷电、云雾时节，下不敬师父尊长、五岳四读三河四海九江八极诸真人、神仙玉女、东乡诸灵官、三界地祇、三官九署一切神明，欺师罔道，秽贱天经，窃盗圣文，改易灵音，宣传至法，贪利入身，私相化授，五帝无盟，谋图叛逆，行不忠不慈不孝不爱不仁，上逆君父，下杀众生，掠夺人物，淫犯他妻，骨肉相加，门族交通，嫉妬胜己，争竞功名，口是心非，攻击贤人，饮酒食肉，浊注五神，骂詈咒诅，自作无端，入斋吉日喜怒无常，轻孤贱寡，弃薄老人，凌贱贫穷，逐宠豪强。 诸如此罪，不可胜纪，积世结固，缠绵不解。 以今烧香，归命东方，乞愿大慈直垂哀原，赦除臣身前生亿劫以来，至今身所犯诸如上之罪，乞赐更始，於今自改，伏从禁戒，不敢又犯。 乞削地简三官罪录、右宫黑簿，恶对重根，度名左府青录之中。 今日大庆，万愿开陈，谨自首谢，归命天尊，乞神乞仙与真合同门户，兴泰善缘，来生世世罔极，长享自然。 毕，便解巾，叩头自搏，各九十过止。 谢东方毕，次起左行，向东南一拜，长跪言： 臣某今归命东南无极太上灵宝天尊、已得道大圣众、至真尊神、南上老君、丹灵老子、南极上元长生真人、度世司马、司命、司录、好生韩君、起死更生炼骨还神大圣神王、万福君、万福丈人、太和玉女、东南无极世界一切神灵。 乞恩谢如东方法。 毕，叩头自搏，各一十二过止。 谢东南毕，次起左行，向南方三拜，长跪言： 臣某今归命南方无极太上灵宝天尊、已得道大圣众、至真尊神、无极大道南上赤帝、丹灵老子、太和玉女、长生司马、好生君、司命、司录、南极度世君、飞天真人、开度受生神王、玉历注生神仙度世君、万福万度万生万气君、南方无极世界一切神灵。 谢如上法。 毕，叩头自搏各三十过止。 谢南方毕，次起左行，向西南方一拜，长跪言： 臣某今归命西南无极太上灵宝天尊、已得道大圣众、至真尊神、天皇老人、南极元真君、洞阳大灵众神、生气飞真神王、神仙玉女、西南无极世界一切神灵。 乞恩谢如上法。 毕，叩头自搏，各一十二过止。 谢西南毕，次起左行，向西方七拜，长跪言： 臣某今归命西方无极太上灵宝天尊、已得道大圣众、至真尊神、无极大道西华太妙至极上帝、金堂玉仙真母、金阙后圣上相帝君、玄古天师、万圣道主、四极真人、神仙玉女、西方无极世界一切神灵。 乞恩谢如上法。 毕，叩头自搏，各七十过止。 谢西方毕，次左行，向西北一拜，长跪言： 臣某今归命上方无极太上灵宝天尊、已得道大圣众、至真尊神、无极大道上下中央四面八方三十二天上帝、太上无为大道诸君丈人、最大至尊无上无巅无极无穷普照普察无量洞明最上正真，无鞅数众道气、元始无先寥廓无端混沌无形虚无自然太上无根冥寂玄通大智慧原、正一盟威太上无为大道、道中之道神明君、无上无初万万亿亿数无鞅数道德诸君丈人、太上道德君、道德丈人、无上万生君、万生丈人、无上万气君、万气丈人、无上万元君、万元丈人、无上万福君、万福丈人、瞑涬天神诸君丈人、新出老君、太清玄无上三天无极大道、无上丈人、太上三气君、太上老君、太上丈人、太清君、太清丈人、太玄上一．君、太玄丈人、中黄正一君、中黄丈人、太元君、太元丈人、太始君、太始丈人、太初君、太初丈人、太素君、太素丈人、太虚君、太虚丈人、太一君、太一丈人、太仪君、太仪丈人、太平君、太平丈人、太渊君、太渊丈人、天帝君、天帝丈人、九老仙都君、九老丈人、玉历君、玉历丈人、九气君、九气丈人等，百千万亿亿万万数无鞅数万重道气丈人、千二百官君、千二百官丈人、太清玉陛下、太上玉真君、玉真丈人、五仙君、五仙丈人、九灵君、九灵丈人、太清十二真君、十二真君丈人、二十四神君、二十四神君丈人、太清三十六真君、三十六真君丈人、五气君、五气丈人、阴阳生气君、生气丈人、上上太一君、太一丈人、皇天太上帝、皇天太上丈人、无极太上元君、太上元君丈人、太一君、太一丈人、神宝君、神宝丈人、真宝君、真宝丈人、天宝君、天宝丈人、灵宝君、灵宝丈人、元神君、元神丈人，元真君、元真丈人、元灵君、元灵丈人、皇老君、皇老丈人、南极君、南极丈人、黄神老君、黄神丈人、黄老君、黄老丈人、太和君、太和丈人、太上皇真道君、诸君丈人、上古天师君、天师丈人、三师君、三师丈人、万道父母、万德父母、天地父母、神仙所出，神仙所聚，东王公、西王母、日君、月夫人、五星君、五星皇妃、璇玑玉衡九星真君、众仙真人、圣父圣母、神仙玉女、上方弥罗此天无极世界一切神灵。",
      "translated_text": "I humbly beseech Your boundless compassion to bestow the grace of absolution. From all my past lives to this present incarnation, I have committed offenses—failing in reverence above toward the august sagely deities of the myriad heavens, all divine spirits of the Eastern Boundless Realm, the sun, moon, and stellar lodges, the four seasons and five phases, wind and rain, thunder and lightning, clouds and mists in their due seasons; failing in reverence below toward my masters and elders, the perfected ones of the Five Marchmounts, Four Seas, Three Rivers, Nine Jiang, and Eight Poles, the jade maidens and divine immortals, the numinous officials of the Eastern Realm, the earth deities of the Three Realms, and all divine spirits of the Three Bureaus and Nine Offices.\n\nI have deceived my masters and betrayed the Dao, defiled the celestial scriptures, stolen sacred texts, altered divine sounds, disseminated the supreme Dharma for personal gain, privately transmitted teachings without sanction, broken covenants with the Five Thearchs, plotted rebellion, acted without loyalty, compassion, filial piety, kindness, or benevolence; rebelled against sovereign and father, slaughtered living beings, seized others’ possessions, violated others’ wives, committed incest, colluded with clansmen, envied those superior to me, contended for fame and rank, harbored deceit in speech, slandered the worthy, consumed wine and meat, polluted the five spirits, uttered curses and imprecations, acted without cause, disrupted fasts on auspicious days with capricious joy and anger, disdained the orphaned and widowed, abandoned the elderly, oppressed the poor, and fawned upon the powerful.\n\nSuch transgressions are beyond count, accumulated over lifetimes, deeply entrenched and unresolved. Today, as I burn incense and submit my fate to the East, I beseech Your boundless compassion to absolve all sins committed from past kalpas to this present life, as enumerated above. Grant me a new beginning, that I may reform from this day forth, adhere to the precepts, and dare not transgress again.\n\nI beseech the erasure of my name from the Three Bureaus’ registers of sin, the Black Ledgers of the Right Palace, and the roots of karmic retribution, and its inscription in the Azure Records of the Left Mansion. On this day of great celebration, I lay forth ten thousand vows, humbly confessing and repenting, submitting my fate to the Heavenly Worthy. I pray to the divine spirits and immortals to unite with me in a shared destiny, fostering auspicious affinities, that in life after life without end, I may eternally partake of the natural blessings.\n\nThis done, I remove my headscarf, kowtow, and strike my breast, each ninety times, ceasing thereafter.\n\nHaving rendered thanks to the East, I rise, turn left, and bow once toward the southeast, kneeling to declare:\nI, [Name], now submit my fate to the Supreme Numinous Treasure Heavenly Worthy of the Southeastern Boundless Realm, the great sagely hosts who have attained the Dao, the perfected and august deities, the Southern Elder Lord, the Cinnabar Numinous Elder, the Southern Pole’s Upper Prime Perfected of Everlasting Life, the Controller of Salvation Sima, the Lords of Life and Destiny, the Life-Preserving Lord Han, the Great Sage Divine King of Resurrecting the Dead and Restoring the Spirit through Bone Refinement, the Lord of Myriad Blessings, the Venerable One of Myriad Blessings, the Jade Maidens of Supreme Harmony, and all divine spirits of the Southeastern Boundless Realm.\nI beseech grace and render thanks as in the Eastern rite.\nThis done, I kowtow and strike my breast, each twelve times, ceasing thereafter.\n\nHaving rendered thanks to the Southeast, I rise, turn left, and bow thrice toward the South, kneeling to declare:\nI, [Name], now submit my fate to the Supreme Numinous Treasure Heavenly Worthy of the Southern Boundless Realm, the great sagely hosts who have attained the Dao, the perfected and august deities, the Southern Supreme Thearch of the Boundless Dao, the Cinnabar Numinous Elder, the Jade Maidens of Supreme Harmony, the Controller of Longevity Sima, the Life-Preserving Lord, the Lords of Life and Destiny, the Southern Pole’s Lord of Salvation, the Flying Perfected, the Divine King of Salvation and Rebirth, the Divine Immortal Lord of Salvation who inscribes life in the Jade Calendar, the Lords of Myriad Blessings, Myriad Salvations, Myriad Lives, and Myriad Qi, and all divine spirits of the Southern Boundless Realm.\nI render thanks as in the preceding rite.\nThis done, I kowtow and strike my breast, each thirty times, ceasing thereafter.\n\nHaving rendered thanks to the South, I rise, turn left, and bow once toward the southwest, kneeling to declare:\nI, [Name], now submit my fate to the Supreme Numinous Treasure Heavenly Worthy of the Southwestern Boundless Realm, the great sagely hosts who have attained the Dao, the perfected and august deities, the Heavenly August Elder, the Southern Pole’s Primordial Perfected Lord, the hosts of the Great Numinous of Cavern Yang, the Divine King of Flying Qi and Life, the jade maidens and divine immortals, and all divine spirits of the Southwestern Boundless Realm.\nI beseech grace and render thanks as in the preceding rite.\nThis done, I kowtow and strike my breast, each twelve times, ceasing thereafter.\n\nHaving rendered thanks to the Southwest, I rise, turn left, and bow seven times toward the West, kneeling to declare:\nI, [Name], now submit my fate to the Supreme Numinous Treasure Heavenly Worthy of the Western Boundless Realm, the great sagely hosts who have attained the Dao, the perfected and august deities, the Supreme Thearch of the Western Florescence and Supreme Mystery of the Boundless Dao, the True Mother of Golden Hall and Jade Immortals, the Sagely Emperor Lord of the Golden Watchtower’s Latter Age, the Primordial Heavenly Master, the Lord of Myriad Sages and Dao, the Perfected of the Four Poles, the jade maidens and divine immortals, and all divine spirits of the Western Boundless Realm.\nI beseech grace and render thanks as in the preceding rite.\nThis done, I kowtow and strike my breast, each seventy times, ceasing thereafter.\n\nHaving rendered thanks to the West, I rise, turn left, and bow once toward the northwest, kneeling to declare:\nI, [Name], now submit my fate to the Supreme Numinous Treasure Heavenly Worthy of the Upper Boundless Realm, the great sagely hosts who have attained the Dao, the perfected and august deities, the Supreme Thearchs of the Boundless Dao above, below, center, four directions, eight quarters, and thirty-two heavens, the august lords and venerable ones of the Supreme Non-Action and Great Dao, the Most Supreme, Unsurpassed, Unbounded, Infinite, Omniscient, All-Illuminating, and Utmost Perfected, the countless hosts of Dao qi, the Primordial Without Beginning, the Vast Without Limit, the Chaotic Without Form, the Void and Spontaneous, the Supreme Without Root, the Profoundly Quiescent and Mystically Penetrating, the Great Wisdom’s Origin, the Orthodox Unity and Alliance of the Supreme Non-Action and Great Dao, the Divine Lord within the Dao, the Supreme Without Origin, the countless august lords and venerable ones of virtue and power, the Lord of Supreme Virtue and Power, the Venerable One of Supreme Virtue and Power, the Supreme Lord of Myriad Lives, the Venerable One of Myriad Lives, the Supreme Lord of Myriad Qi, the Venerable One of Myriad Qi, the Supreme Lord of Myriad Primordials, the Venerable One of Myriad Primordials, the Supreme Lord of Myriad Blessings, the Venerable One of Myriad Blessings, the august lords and venerable ones of the Heaven of Profound Darkness, the Newly Emerged Elder Lord, the Supreme Mystery of the Three Heavens and Boundless Dao, the Supreme Venerable One, the Lords of the Three Supreme Qi, the Supreme Elder Lord, the Supreme Venerable One, the Supreme Clarity Lord, the Supreme Clarity Venerable One, the Supreme Mystery’s First Lord, the Supreme Mystery’s Venerable One, the Central Yellow Orthodox Unity Lord, the Central Yellow Venerable One, the Supreme Prime Lord, the Supreme Prime Venerable One, the Supreme Origin Lord, the Supreme Origin Venerable One, the Supreme Beginning Lord, the Supreme Beginning Venerable One, the Supreme Simplicity Lord, the Supreme Simplicity Venerable One, the Supreme Void Lord, the Supreme Void Venerable One, the Supreme Unity Lord, the Supreme Unity Venerable One, the Supreme Pattern Lord, the Supreme Pattern Venerable One, the Supreme Peace Lord, the Supreme Peace Venerable One, the Supreme Abyss Lord, the Supreme Abyss Venerable One, the Heavenly Thearch Lord, the Heavenly Thearch Venerable One, the Nine Elders of the Immortal Capital, the Nine Elders, the Lord of the Jade Calendar, the Venerable One of the Jade Calendar, the Lords of the Nine Qi, the Venerable Ones of the Nine Qi, the countless august lords and venerable ones of myriad layers of Dao qi, the twelve hundred officials and their venerable ones, before the Jade Steps of Supreme Clarity, the Supreme Jade Perfected Lord, the Supreme Jade Perfected Venerable One, the Lords of the Five Immortals, the Venerable Ones of the Five Immortals, the Lords of the Nine Numinous, the Venerable Ones of the Nine Numinous, the Twelve Perfected Lords of Supreme Clarity, the Twelve Perfected Venerable Ones, the Twenty-Four Divine Lords, the Twenty-Four Divine Venerable Ones, the Thirty-Six Perfected Lords of Supreme Clarity, the Thirty-Six Perfected Venerable Ones, the Lords of the Five Qi, the Venerable Ones of the Five Qi, the Lord of Yin-Yang and Generative Qi, the Venerable One of Generative Qi, the Supreme Supreme Unity Lord, the Supreme Unity Venerable One, the Supreme Thearch of August Heaven, the Supreme Venerable One of August Heaven, the Supreme Primordial Lord of the Boundless, the Supreme Primordial Venerable One, the Supreme Unity Lord, the Supreme Unity Venerable One, the Lord of Numinous Treasure, the Venerable One of Numinous Treasure, the Lord of True Treasure, the Venerable One of True Treasure, the Lord of Heavenly Treasure, the Venerable One of Heavenly Treasure, the Lord of Mystic Treasure, the Venerable One of Mystic Treasure, the Lord of Primordial Spirit, the Venerable One of Primordial Spirit, the Lord of Primordial Perfection, the Venerable One of Primordial Perfection, the Lord of Primordial Numinous, the Venerable One of Primordial Numinous, the August Elder Lord, the August Elder Venerable One, the Southern Pole Lord, the Southern Pole Venerable One, the Yellow Thearch Elder Lord, the Yellow Thearch Venerable One, the Yellow Elder Lord, the Yellow Elder Venerable One, the Supreme Harmony Lord, the Supreme Harmony Venerable One, the Supreme August Perfected Lord of the True Dao, the august lords and venerable ones, the Ancient Heavenly Master Lord, the Heavenly Master Venerable One, the Three Masters Lord, the Three Masters Venerable One, the Parents of Myriad Dao, the Parents of Myriad Virtues, the Parents of Heaven and Earth, from whom divine immortals emerge and gather, the Eastern King Father, the Western Queen Mother, the Lord of the Sun, the Lady of the Moon, the Lords of the Five Planets, the August Consorts of the Five Planets, the Perfected Lords of the Jade Armillary and Nine Stars, the hosts of divine immortals and perfected ones, the sagely fathers and mothers, the jade maidens and divine immortals, and all divine spirits of the Boundless Realm of the Highest Heaven of Miro.",
      "overlap_context": "he Nine Qi, and the myriad layers of Dao qi, the one thousand two hundred officials. Before the Jade Steps of the Supreme Clarity, the Eastern Pole Elder, the Great Azure Spirit, the Prime Minister Sima, the Azure Lad, the Golden Watchtower’s Sagely Emperor of the Latter Age, the True Yang’s Primordial Azure Divine Person, the Nine Immortals of the Numinous Treasure, the Azure Harmony Jade Maidens, the Jade Lords of the Immortal Hosts, and all the divine spirits of the Eastern Boundless Realm.\"*",
      "start_char": 1257,
      "end_char": 3101,
      "start_sentence": 40,
      "end_sentence": 63,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 48.29298210144043,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\太上大道三元品诫谢罪上法.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "乞恩谢如上法。 毕，叩头自搏，各三百二十过止。 谢上方毕，次左行，向束北日官三拜，长跪言： 臣某今归命日君夫人、日中皇华洞明太光童子、丹霞玉女、日中诸神仙，乞丐原臣受生所行罪负，上触天光，生死殃对，并蒙赦除，身得光明，与日同景，长享无极，受福自然。 毕，叩头自搏，各三十过止。 谢日宫毕，次起左行，向西南月宫七拜，长跪言： 臣某今归命月君夫人、石景水母、圆光童子、散辉玉女、月宫诸神仙，乞丐原臣受生所行罪负，上触天光，生死殃对，并蒙原除，身得光明，与月同景，长享元极，受福自然。 毕，叩头自搏，各七十过止。 谢月宫毕，次左行，向北九拜，长跪言： 臣某今归命诸天星宿、璇玑玉衡、七星北斗、九星三台、五星夫人、二十八宿、周天三百六十五度星中大神、星中真皇、夫人灵妃、神仙玉女，乞丐原臣受生所行罪负，上触天光，生死殃对，并蒙原除，身得光明，与星宿同景，长享元极，受福自然。 毕，叩头自搏，各三百六十过止。 谢星宫毕，次左行，向东岳再拜，长跪言： 臣某今归命东岳泰山青帝大神、飞仙真人神仙、诸灵官、名山大泽一切神灵，乞丐原臣受生以来所行罪负，上触东岳名山大神，元恶之罪，并蒙赦宥，削除罪简，名上仙录，得与大神交友自然。 毕，叩自搏，各二十过止。 次向南方再拜，长跪言： 臣某今归命南岳衡山赤帝大神、飞仙真人、神仙诸灵官、名山大泽一切神灵。 乞丐谢如东岳法。 次向西南再拜，长跪言： 臣某今归命中岳嵩山黄帝大神、飞仙真人神仙、诸灵官、名山大泽一切神灵。 乞丐谢如东岳法。 次向西再拜，长跪言： 臣某今归命西岳华山白帝大神、飞仙真人神仙、诸灵官、名山大泽一切神灵。 乞丐谢如束岳法。 次向北再拜，长跪言： 臣某今归命北岳恒山黑帝大神，飞仙真人、神仙诸灵官、名山大泽一切神灵。 乞丐谢如东岳法。 谢五岳毕，次左行，向北方十二拜，谢水官言： 臣某今归命扶桑大帝旸谷神王、洞源洞渊清泠大神、三河四海九江水帝、十二淮济河伯河侯、河中二千石、清河夫人、水府神仙、一切诸灵官，乞丐原臣前生以来，至于今日所行罪负，无数愆目，触犯水官元恶之罪，乞见原赦，今日烧香首谢大神，归命归身，乞得生活，免诸罪根，削除水简缘对，上名生录神仙簿中，长享无极，与道合真。 毕，叩头自搏，各二百八十过止。 谢水官毕，次向北三拜，谢三宝神经，长跪言： 臣某今归命太上无极大道至真无上三十六部尊经、三宝灵文、神仙图箓符章、自然天书、金书玉字，侍经玉童玉女、三部威神，乞丐谢如东岳法。 毕，叩自搏，各三百六十过止。 斋竟言功法，众官一时东向长跪，叩齿二十四通，称所受官如具，稽首再拜，上启： 太上无极大道、太上大道君、太上老君、太上丈人、无上玄老、十方无极 大道、道德众圣天尊、至真太帝、天帝、天师君、灵宝监斋大法师。 臣等素自凡愚，不以秽贱，好道乐仙，谬受法任，得腾景九玄，志竭愚短，自效毛发，共相携率。 以今月如干日某时，於某郡县乡里中，建立斋直，烧香诵经，思神念真，如干日夜，某时行道，请谢修行。 事竟，所启上清三洞飞仙、天仙、地仙、五方天兵骑乘，及侍经侍香玉童玉女、灵宝官属、监斋众真、五岳四渎四方监察真官灵仙，谒还真宫，进品上仙，加爵帝秩，随品署真，当如太真之仪。",
      "translated_text": "Having sought grace and offered thanks according to the above rites, the ritual concludes. The adept knocks their head to the ground and strikes their breast, each act performed three hundred and twenty times before ceasing.\n\nThe thanks to the Upper Realm complete, the adept turns left and faces the northeast, bowing three times to the Solar Palace. Kneeling upright, they declare:\n*\"Your servant [Name] now surrenders their life to the Lady of the Sun, the Radiant Child of Vermilion Light within the Sun, the Jade Maidens of Cinnabar Clouds, and all divine immortals of the Solar Palace. I humbly beseech forgiveness for the transgressions and debts accrued since my birth—offenses that have offended the celestial radiance, bringing karmic retribution in life and death. May all be absolved and pardoned, that my body may attain luminosity, sharing the same splendor as the sun, and enjoy boundless existence, receiving blessings by nature’s grace.\"*\n\nThis done, the adept knocks their head to the ground and strikes their breast, each act performed thirty times before ceasing.\n\nThe thanks to the Solar Palace complete, the adept rises, turns left, and faces the southwest, bowing seven times to the Lunar Palace. Kneeling upright, they declare:\n*\"Your servant [Name] now surrenders their life to the Lady of the Moon, the Water Mother of Stone Radiance, the Round-Light Child, the Jade Maidens of Scattered Brilliance, and all divine immortals of the Lunar Palace. I humbly beseech forgiveness for the transgressions and debts accrued since my birth—offenses that have offended the celestial radiance, bringing karmic retribution in life and death. May all be absolved and pardoned, that my body may attain luminosity, sharing the same splendor as the moon, and enjoy boundless existence, receiving blessings by nature’s grace.\"*\n\nThis done, the adept knocks their head to the ground and strikes their breast, each act performed seventy times before ceasing.\n\nThe thanks to the Lunar Palace complete, the adept turns left and faces north, bowing nine times. Kneeling upright, they declare:\n*\"Your servant [Name] now surrenders their life to all celestial asterisms, the Jade Armillary and Nine Stars, the Seven Stars of the Northern Dipper, the Nine Stars of the Three Terraces, the Ladies of the Five Planets, the Twenty-Eight Constellations, the great deities of the three hundred and sixty-five degrees of the celestial sphere, the Perfected Sovereigns within the stars, the divine consorts and spirit maidens, and all jade maidens and divine immortals of the stellar realm. I humbly beseech forgiveness for the transgressions and debts accrued since my birth—offenses that have offended the celestial radiance, bringing karmic retribution in life and death. May all be absolved and pardoned, that my body may attain luminosity, sharing the same splendor as the stars, and enjoy boundless existence, receiving blessings by nature’s grace.\"*\n\nThis done, the adept knocks their head to the ground and strikes their breast, each act performed three hundred and sixty times before ceasing.\n\nThe thanks to the Stellar Palace complete, the adept turns left and faces the Eastern Marchmount, bowing twice. Kneeling upright, they declare:\n*\"Your servant [Name] now surrenders their life to the Great Deity of the Azure Emperor of Mount Tai, the Eastern Marchmount, the Flying Immortals and Perfected Ones, all divine officials, and the spirits of all renowned mountains and marshes. I humbly beseech forgiveness for the transgressions and debts accrued since my birth—offenses that have offended the great deities of the Eastern Marchmount and the sacred mountains. May the primordial evils be absolved and pardoned, my name inscribed in the registers of immortals, and my sins erased from the celestial records, that I may befriend the great deities by nature’s grace.\"*\n\nThis done, the adept knocks their head to the ground and strikes their breast, each act performed twenty times before ceasing.\n\nNext, the adept turns to the south and bows twice. Kneeling upright, they declare:\n*\"Your servant [Name] now surrenders their life to the Great Deity of the Vermilion Emperor of Mount Heng, the Southern Marchmount, the Flying Immortals and Perfected Ones, all divine officials, and the spirits of all renowned mountains and marshes.\"*\nThe thanks are offered in accordance with the rites for the Eastern Marchmount.\n\nNext, the adept turns to the southwest and bows twice. Kneeling upright, they declare:\n*\"Your servant [Name] now surrenders their life to the Great Deity of the Yellow Emperor of Mount Song, the Central Marchmount, the Flying Immortals and Perfected Ones, all divine officials, and the spirits of all renowned mountains and marshes.\"*\nThe thanks are offered in accordance with the rites for the Eastern Marchmount.\n\nNext, the adept turns to the west and bows twice. Kneeling upright, they declare:\n*\"Your servant [Name] now surrenders their life to the Great Deity of the White Emperor of Mount Hua, the Western Marchmount, the Flying Immortals and Perfected Ones, all divine officials, and the spirits of all renowned mountains and marshes.\"*\nThe thanks are offered in accordance with the rites for the Eastern Marchmount.\n\nNext, the adept turns to the north and bows twice. Kneeling upright, they declare:\n*\"Your servant [Name] now surrenders their life to the Great Deity of the Black Emperor of Mount Heng, the Northern Marchmount, the Flying Immortals and Perfected Ones, all divine officials, and the spirits of all renowned mountains and marshes.\"*\nThe thanks are offered in accordance with the rites for the Eastern Marchmount.\n\nThe thanks to the Five Marchmounts complete, the adept turns left and faces north, bowing twelve times to the Water Officials. Kneeling upright, they declare:\n*\"Your servant [Name] now surrenders their life to the Great Emperor of Fusang, the Divine King of the Yang Valley, the Great Deities of the Primal Source and Abyssal Depths, the Water Emperors of the Three Rivers, Four Seas, and Nine Jiang, the River Lords of the Twelve Huai and Ji, the River Marquises, the Two Thousand Stone Officials of the Rivers, the Lady of the Clear River, the divine immortals of the Water Palaces, and all divine officials. I humbly beseech forgiveness for the countless transgressions and debts accrued from past lives to this day—offenses that have violated the primordial evils under the jurisdiction of the Water Officials. May I be absolved and pardoned. Today, I burn incense and offer my first thanks to the great deities, surrendering my life and body, beseeching deliverance from death, the eradication of all karmic roots, and the removal of my name from the water registers of retribution. May my name be inscribed in the registers of immortals, that I may enjoy boundless existence and merge with the Dao in truth.\"*\n\nThis done, the adept knocks their head to the ground and strikes their breast, each act performed two hundred and eighty times before ceasing.\n\nThe thanks to the Water Officials complete, the adept turns to the north and bows three times to the Three Treasures and Sacred Scriptures. Kneeling upright, they declare:\n*\"Your servant [Name] now surrenders their life to the Most High, Boundless, and Supreme Dao of the Thirty-Six Revered Scriptures; the Three Treasures of the Numinous Texts; the charts, registers, talismans, and celestial writings of the divine immortals; the natural celestial books of gold and jade characters; the jade lads and maidens who attend the scriptures; and the mighty deities of the Three Divisions. The thanks are offered in accordance with the rites for the Eastern Marchmount.\"*\n\nThis done, the adept knocks their head to the ground and strikes their breast, each act performed three hundred and sixty times before ceasing.\n\nThe ritual concluded, the merits of the rites are declared. All officials simultaneously turn east, kneel upright, and click their teeth twenty-four times. They recite their received titles in full, prostrate themselves twice, and make their report:\n*\"To the Most High, Boundless, and Supreme Dao; the Most High Lord of the Dao; the Most High Lord Lao; the Most High Venerable One; the Supreme Mysterious Elder; the Boundless Dao of the Ten Directions; the Heavenly Worthies of the Dao and Virtue; the Most Perfect and Great Emperor; the Celestial Emperor; the Heavenly Master Lord; and the Great Dharma Master of the Numinous Treasure who Oversees the Retreat—\nWe, your humble servants, though base and unworthy, have loved the Dao and delighted in immortality. By error, we have received the duties of this office and ascended to the Nine Mysteries, yet our aspirations are feeble and our abilities meager. Still, we offer ourselves wholly, joining hands to fulfill our roles.\nOn this day of [date] at [hour], in the [prefecture], [county], [township], and [village], we have established the retreat, burned incense, recited scriptures, meditated upon the deities, and contemplated the Perfected Ones. For [number] days and nights, at [hour], we have performed the rites of repentance and thanksgiving.\nThe rites now complete, we report to the Flying Immortals, Heavenly Immortals, Earthly Immortals, and the celestial cavalry of the Five Directions; to the jade lads and maidens who attend the scriptures and incense; to the officials of the Numinous Treasure; to the Perfected Ones who oversee the retreat; and to the divine immortals who monitor the Five Marchmounts, Four Waterways, and Four Directions. May they return to their true palaces, ascend in rank among the immortals, receive imperial titles commensurate with their stations, and be appointed as Perfected Ones according to their merits, in accordance with the rites of the Great Perfected.\"*",
      "overlap_context": "the Parents of Heaven and Earth, from whom divine immortals emerge and gather, the Eastern King Father, the Western Queen Mother, the Lord of the Sun, the Lady of the Moon, the Lords of the Five Planets, the August Consorts of the Five Planets, the Perfected Lords of the Jade Armillary and Nine Stars, the hosts of divine immortals and perfected ones, the sagely fathers and mothers, the jade maidens and divine immortals, and all divine spirits of the Boundless Realm of the Highest Heaven of Miro.",
      "start_char": 3101,
      "end_char": 4447,
      "start_sentence": 64,
      "end_sentence": 101,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.398611307144165,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\太上大道三元品诫谢罪上法.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "令臣等求道得道，求仙得仙。 令臣等分形变化，七十四方，三元下降，降致绿軿，飞行上清，腾景九天，日月同晖，三宝齐轮。 惟蒙至圣，监映丹情，臣等学法未备，俯仰之格斋法难精，不合仪式，进止犯科，为四司所纠，五帝所执，千愆万罪，乞蒙赦贳。 哀原未悟，不见罪罚。 臣等身中五体真官，随功上诣玄都，受秩事竟，还臣等身，与臣同升，飞行太空，谨上启闻，伏须告报，臣等诚惶诚恐，稽首再拜。 谢毕，左行还西，向东三上香，咒曰： 香官使者、左右龙虎君、捧香驿龙骑吏，当令臣静室斋堂，生自然金液，丹精百灵，芝英交会，在此香火前。 令臣得道，遂获神仙，举家蒙福，上下受恩，十方玉童玉女，侍卫香烟，传臣所启，径御无极太上大道前。 天尊言：其三元品诚谢罪上法，三元宫中隐存形神，精思罪根，修仙上道，学士一岁三过行之。 行之当令心丹意尽，神形同苦，无有息倦，感彻诸天，三元削罪於黑簿，北帝落死而上生，三官保举於学功，太玄记录於上仙。 夫求道者，非苦不彻，非丹不感，非勤不获，非功不得，非志不克，非心不成也。 当使形劳於始，神欢於终，终得无为，克入自然。 罪滓之人，贪玩珍宝，见世之欢，一时之荣，岂知有终，终归於苦，涂炭三宫，长沦万劫，何时得还。 故贤愚各尚，志业不同。 愚者贵始，贤者重终。 愚智相殊，岂可言哉。 天尊言：夫为学者，身经三元上吉之日，香汤自炼，沐浴五神，则气澄形正，神爽结真，体不受秽，气不受尘，三关清虚，万邪不干，三部八景，洞明身中。 服御导引，五府生熏，内外充溢，悉得成仙。 上士飞腾，驾景乘云，中士隐化，坐在立亡，下士灭度，转轮圣王，灭而不绝，终得神仙。 其法高妙，微难可胜，今以相告，勤为用心。 道君稽首，伏受要言。 天尊言：夫为积学未得道者，皆由己身负其宿对，三官所举，九府所执，百二十曹左右考官文书考逮，恶根不灭，邪魔侵伐，致五神争竞，身犯不觉，罪秽日生，神真飞越，虽见众法，而罪根不释，徒为劳心，至死无获。 今三元大庆，开生吉日，诸天回驾，众圣同集，推校生死功过录籍，道法普慈，爱民育物，见其罪者名入死目，终劫相牵，永无解脱，学而无益，甚可痛焉。 今开紫阳玉笈，出三元品诚谢过上法，以度学者，成其功德，宣告天科各条。 学士未得道者，功过多少，咸使有心，承受大法，落灭罪簿，上名仙录。 於今更始，普告诸天，无高无下，无深无远，无大无小，无穷无极，无幽无隐，无音无响，冥寂玄通，大智慧原，三宫九府，百二十曹，一切神灵，莫不承奉。 於是诸天大圣众、无极尊神、太上道君，一时长立，举手告众，弹指称善。 是时天尊开大宥之恩，诸天男女始学者，莫不恭奉修行大法，皆即受度，身得神仙，白日登虚，上升帝宫。 其有善心信向之人，敬而奉之，皆得开度，转轮生死，不经地役，功成德满，并得仙道，位齐飞天，游乎十方也。 天尊言：夫以三元上吉之日，修行三元品诚谢罪之法，则三官九府右别录籍，五帝保举，列名诸天，众真欢喜，万神开宥，宿对披散，罪根普解，三会感彻，三宫九府百二十曹考逮，削落黑简，断绝宿根，勒名左契青录之中，万灵侍护，三界司迎，妖魔降伏，千灾不干，道真自生，克得神仙。",
      "translated_text": "May we, your servants, seek the Dao and attain the Dao, seek immortality and attain immortality. May we divide our forms and transform in seventy-four directions, with the Three Primes descending to summon green chariots, soaring through the Upper Clarity, ascending the radiance of the Nine Heavens, sharing splendor with the sun and moon, and aligning the wheels of the Three Treasures.\n\nWe humbly beseech the Most Sacred to oversee our cinnabar sincerity. Yet our study of the Dao remains incomplete, and the rites of fasting and purification are difficult to perfect. We fail to conform to the proper forms, transgressing in our conduct and violating the statutes, thus incurring the scrutiny of the Four Offices, the jurisdiction of the Five Emperors, and accumulating a thousand transgressions and ten thousand sins. We beg for your forgiveness and pardon.\n\nAlas, we were ignorant and unaware, blind to our offenses and punishments. May the Five Body Perfected Officials within us ascend to the Mysterious Capital in accordance with their merits, complete their duties, and return to our bodies, ascending with us to soar through the Great Void. We respectfully report this and await your decree. With utmost reverence and trepidation, we bow twice in prostration.\n\nThe rites concluded, we proceed leftward to the west, then face east to offer incense thrice, reciting the incantation:\n\n*\"Incense Officials and Messengers, Lords of the Left and Right Dragon-Tiger, Courier Dragon Riders bearing incense: may our quiet chamber and fasting hall generate spontaneous golden liquid, cinnabar essence of the hundred spirits, and intermingling mushroom blossoms before this incense flame. May we attain the Dao and achieve divine immortality, our entire household receiving blessings, all above and below granted grace. May the jade lads and maidens of the ten directions attend the incense smoke, conveying our petition directly to the presence of the Boundless Supreme Great Dao.\"*\n\nThe Heavenly Worthy declared: *\"This Three Primes Sincere Repentance Rite is the supreme method. Within the Three Primes’ palaces, conceal your form and spirit, refine the roots of transgression, and cultivate the Dao to ascend as immortals. Scholars should perform this thrice yearly. In its practice, let the cinnabar of the heart and the intent be exhausted, spirit and form enduring together without weariness or fatigue. Thus shall you move the myriad heavens, the Three Primes erase your sins from the Black Register, the Northern Emperor remove death and grant life, the Three Offices endorse your merit, and the Supreme Mystery record you among the immortals.*\n\n*Those who seek the Dao must endure hardship to penetrate the depths, cultivate cinnabar to move the spirits, persevere to achieve, accumulate merit to attain, uphold resolve to prevail, and dedicate the heart to succeed. Let the body labor at the outset so the spirit may rejoice in the end, ultimately attaining non-action and entering spontaneity.*\n\n*Yet those stained by sin covet treasures and worldly pleasures, indulging in fleeting glory, unaware of their inevitable end—returning to suffering, mired in the Three Offices, forever sinking through ten thousand kalpas, with no hope of return. Thus do the wise and foolish differ in their aspirations. The foolish value beginnings, while the wise esteem endings. The divergence between wisdom and folly—how can it be described?\"*\n\nThe Heavenly Worthy continued: *\"For scholars, on the most auspicious days of the Three Primes, refine yourselves with fragrant waters, bathe the Five Spirits, so that qi becomes serene and form upright, spirit refreshed and truth conjoined. The body shall not receive filth, qi shall not gather dust, the Three Passes shall be purified and emptied, and no evil shall intrude. The Three Fields and Eight Sceneries shall be luminous within the body. Through ingestion, guiding, and leading, the Five Palaces shall be suffused, filling inner and outer, all attaining immortality. The superior shall soar, riding radiance and clouds; the middling shall conceal and transform, sitting in stillness or standing in dissolution; the inferior shall transcend mortality, becoming Wheel-Turning Sage Kings, extinguished yet enduring, ultimately achieving divine immortality. This method is lofty and wondrous, subtle and difficult to surpass. I now reveal it to you—apply it with diligence.\"*\n\nThe Dao Lord bowed and reverently received these essential words.\n\nThe Heavenly Worthy declared: *\"Those who have accumulated study yet failed to attain the Dao are burdened by their own karmic debts, reported by the Three Offices, detained by the Nine Bureaus, and examined by the one hundred twenty left and right investigating officials. Their evil roots unsevered, demonic forces assail them, causing the Five Spirits to contend, the body to unwittingly transgress, sins and impurities to accumulate daily, and the divine immortals to depart. Though they encounter myriad methods, their karmic roots remain uncut, their efforts in vain, and they gain nothing until death.*\n\n*Now, on the great auspicious day of the Three Primes’ celebration, as the chariots of the myriad heavens return and the host of sages assemble, the records of life and death, merit and transgression are reviewed. The Dao’s universal compassion nurtures all beings. Those whose names enter the register of death are bound for kalpas, forever entangled, with no hope of liberation. To study without benefit—how grievous!*\n\n*Thus, I open the Purple Yang Jade Case and reveal the Three Primes Sincere Repentance Rite to deliver scholars, perfect their merit, and proclaim the celestial statutes. For those who have not yet attained the Dao, regardless of the measure of their merit or transgression, let all with sincerity receive this great method, erase their names from the sin registers, and inscribe them in the immortal rolls. From this day forth, I universally proclaim to the myriad heavens: without distinction of high or low, deep or distant, great or small, boundless or limitless, hidden or obscure, silent or resounding, in the profound and mysterious communion of the Great Wisdom Origin, the Three Offices, Nine Bureaus, one hundred twenty investigating officials, and all divine spirits shall comply and obey.\"*\n\nThereupon, the host of great sages of the myriad heavens, the boundless honored deities, and the Supreme Dao Lord all rose as one, raising their hands to address the assembly, snapping their fingers in approval.\n\nAt that moment, the Heavenly Worthy opened the great mercy of universal pardon. All male and female beginners among the heavenly hosts reverently practiced the great method, immediately receiving deliverance, their bodies attaining divine immortality, ascending in broad daylight to the imperial palaces. Those of virtuous heart and devout faith who respectfully followed this method were all delivered, transcending the wheel of life and death without undergoing earthly trials. With merit perfected and virtue fulfilled, they attained the Dao of immortality, their ranks equal to the flying heavens, roaming the ten directions.\n\nThe Heavenly Worthy declared: *\"On the most auspicious days of the Three Primes, practicing the Three Primes Sincere Repentance Rite will prompt the Three Offices and Nine Bureaus to separately record your names, the Five Emperors to endorse your merit, and your names to be listed among the heavens. The host of immortals shall rejoice, the myriad spirits shall grant pardon, karmic debts shall be dispersed, sinful roots universally dissolved, and the Three Assemblies moved. The Three Offices, Nine Bureaus, and one hundred twenty investigating officials shall erase your names from the Black Registers, sever karmic roots, inscribe your names in the Left Contract and Azure Record, with the myriad spirits in attendance, the Three Realms’ officials in welcome, demonic forces subdued, a thousand calamities averted, and the Dao’s truth naturally arising—thus attaining divine immortality.\"*",
      "overlap_context": " jade lads and maidens who attend the scriptures and incense; to the officials of the Numinous Treasure; to the Perfected Ones who oversee the retreat; and to the divine immortals who monitor the Five Marchmounts, Four Waterways, and Four Directions. May they return to their true palaces, ascend in rank among the immortals, receive imperial titles commensurate with their stations, and be appointed as Perfected Ones according to their merits, in accordance with the rites of the Great Perfected.\"*",
      "start_char": 4447,
      "end_char": 5710,
      "start_sentence": 102,
      "end_sentence": 131,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.7374324798584,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\太上大道三元品诫谢罪上法.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "太上大道三元品戒谢罪上法竟",
      "translated_text": "The Supreme Great Dao’s Three Primes Precepts Repentance Rite of Supreme Merit is here concluded.",
      "overlap_context": "l be dispersed, sinful roots universally dissolved, and the Three Assemblies moved. The Three Offices, Nine Bureaus, and one hundred twenty investigating officials shall erase your names from the Black Registers, sever karmic roots, inscribe your names in the Left Contract and Azure Record, with the myriad spirits in attendance, the Three Realms’ officials in welcome, demonic forces subdued, a thousand calamities averted, and the Dao’s truth naturally arising—thus attaining divine immortality.\"*",
      "start_char": 5711,
      "end_char": 5727,
      "start_sentence": 132,
      "end_sentence": 132,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 1.014892578125,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\太上大道三元品诫谢罪上法.txt",
        "category": "玉诀类"
      }
    }
  ]
}