{
  "source_id": "太上三皇宝斋神仙上录经",
  "source_file": "chunked_daozang\\太上三皇宝斋神仙上录经.json",
  "total_chunks": 3,
  "total_original_chars": 2099,
  "total_translated_chars": 12895,
  "total_translation_time": 64.81271243095398,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\方法类\\太上三皇宝斋神仙上录经.txt",
    "category": "方法类"
  },
  "full_translation": "*The Supreme Three Sovereigns’ Precious Fast: Register of Divine Immortals*\n\nThe *Scripture of the Supreme Three Sovereigns’ Precious Fast: Register of Divine Immortals* is of unknown authorship, likely composed during the Northern and Southern Dynasties or the Sui-Tang period. It records the rituals of the Three Sovereigns’ fast and the methods for crafting sacred objects. One fascicle. Base text from the *Daoist Canon of the Zhengtong Era*, *Dongshen* section, category of methods.\n\n---\n\n**The Three Sovereigns’ Register of Divine Immortal Prayers and Inner Spirit Treasures**\n\nThe Yellow Emperor said: All scholars who wholeheartedly aspire to the Dao, seeking life through diligent practice, enduring the great stillness of fasting, yearning for divine immortality, and beseeching the numinous from dawn to dusk without shunning hunger or cold—those who rescue and protect the myriad people, making this their karmic cause—shall have blessings flow through seven generations, escape great calamities, transcend water and fire, and enjoy peace in body and wholeness in form.\n\nThis is the supreme method of the profoundest depths, enabling one to attain divine immortality. Through study, one perfects it, and virtue/power renews daily.\n\nThe Yellow Emperor said: The Three Sovereigns are the spirits of the primordial womb. They are the secret scriptures of the Supreme Sovereign. Those who possess them become divine immortals; those who behold them extend their years; those who chant them ascend to meet the August Lords, while the ten directions’ celestial hosts all come to witness.\n\nTheir texts are most wondrous, their rank most exalted. They empower one to enter and exit water and fire, transform the hidden and obscure, govern the records of the Three Offices, and determine life in an instant. Diligence is paramount—only then will one’s name be inscribed among the immortals. Their arts are utterly authentic, not merely the scriptures alone.\n\nThe Yellow Emperor said: Those who possess this book must fast with devotion, burn incense and recite prayers, bathe in cloud and water, offer smoke to the Upper Prime, and observe the fast for three periods of nine days. With the Eight Emperor Spirit Texts, they knock their hearts and recite invocations, so that their prayers ascend to the Three Heavens. Seven generations of sins are erased, dark trials are wholly absolved, suffering is transcended, transgressions are excised, and truth is attained. Through diligent cultivation, one ascends to meet the August Lords.\n\nThe Yellow Emperor said: In the primordial era, there were the gods of the Three Sovereigns, with the Eight Emperors governing in succession, all assisted by perfected beings. Evil did not arise, nor did disasters occur—this is not what the world transmits. In the time of Fuxi and Nüwa, their reigns each lasted thirteen thousand years. Later, the Supreme Heaven bestowed upon them the Eight Emperors’ sacred scriptures and wondrous arts, the Dao of long life and eternal transformation, the Seven Records of Assisting the Sage, and the Three Marvels of Governing the World—this is that very book.\n\nMoreover, one writes the Three Sovereigns’ texts on blue silk, making banners three feet in length, inscribed in vermilion. These are hung from ten-foot bamboo poles in the courtyard. Alternatively, one may invite the August Texts upon a table, facing north as the seat. Burn incense, make vows, and knock the teeth twenty-four times in succession, then pray:\n\n*\"Fragrant smoke and jade maidens, ascend to report to the August Lords. This humble one, [name], fasts in purity, free from dust, awaiting the five spiritual penetrations. May my supreme vow be fulfilled, calamities extinguished, blessings born, and ascent to the Three Heavens achieved.\"*\n\nWhen finished, light the lamps and perform the Daoist walk, with prayers and vows following this method. All disasters, misfortunes, and harms shall be entirely dispelled; those on the brink of death from illness shall be reborn.\n\nThis fasting method requires vigilance and diligence with the lamps. One eats once at midday, and again at the time of *shengqi* (living qi) at night, after burning incense and presenting vows. This is the regimen for eating and resting at each interval. However, one must not violate the fast’s prohibitions with impurity, nor allow those lacking focus to profane its strictures. The procedures and regulations follow the above method.\n\n**Method for Compounding Upper Prime Incense Beads**\n\nTake three *jin* of aloeswood, one *jin* of frankincense, nine *liang* of *qingmu* (blue wood), five *liang* of clove, three *liang* of *xuanshen* (figwort root), six *liang* of *quetail* (sparrow’s head), three *liang* of *zhanxiang* (benzoin), two *liang* of *baizhi* (angelica root), four *liang* of true sandalwood, three *liang* of mugwort incense, four *liang* of styrax resin, and three *liang* of *mulan* (magnolia). In all, twelve ingredients, each to be pounded separately and sifted through silk. Then add ten *liang* of dried jujubes and pound together thirty thousand times. Place in a white vessel, seal tightly, and steam the incense for one day. When done, mix with honey, pound again, and form into pills the size of *wutong* seeds. Thread them with green cord, dry in the sun, and these become the **Incense Beads of the Three Sovereigns’ True Prime**. Burning them will ascend through the Nine Heavens, where perfected beings and jade maidens will sing amidst the void.\n\nFurther, add half a *jin* of realgar and four *liang* of musk, pound together, and form into pills the size of soybeans. Take one pill every nineteen days. Regular consumption sharpens the spirit without decline, sweetens the breath, and attracts perfected beings and numinous forces, summoning jade maidens while repelling all illnesses, ailments, evil ghosts, inauspicious omens, and malevolent spirits, which will flee and submit from afar.\n\nThe Yellow Emperor said: The **Fasting Method of the August Scriptures** is most true and precious, not transmitted in the mundane world. Those seeking immortality or petitioning for the myriad people’s blessings, delivering them from distress, disasters, and harms, must first perform the **Great Fasting Method of the Eight Emperors** to absolve the sins of seven generations of parents and oneself. After three years, one may inscribe one’s immortal name and attain the Dao of deathlessness. If one wishes to summon the hundred spirits, one must first accumulate fasting merits until resonance occurs naturally—only then may they be invoked. At that time, all will be clearly understood in the heart.\n\nThe Yellow Emperor said: If the myriad people suffer from urgent illnesses, dire calamities, or deep-rooted sins beyond salvation, they should petition the Three Sovereigns and perform the **Precious Fasting Method** to redeem themselves. Burn incense and light three, five, seven, nine, or thirty-six lamps, symbolizing the number of the Thirty-Six Heavens. After forty or a hundred days, all sins will be erased. The **Directors of Destiny** and **Scribes of Records** will then inscribe one’s immortal name, bestowing boundless great fortune. Bright lamps illuminate the spirits; rising smoke directs the *qi*. The Supreme Perfected delight in divine music, and the Three Sovereigns gather in feast. The petitioner attains transcendence, and blessings flow for ten thousand generations. Performing this ritual twenty-one times in a year constitutes the **Great Crossing**.\n\nThe Yellow Emperor said: To bring blessings to the myriad people and deliver them from urgent calamities and disasters, the petitioner should fast for three, five, seven, or nine days—whatever feels appropriate. Bathe in the **Mysterious Cloud Water**, burn the **August Supreme Incense**, and light the **Mysterious Fluid Candles**—three, five, seven, or nine lamps, as one wishes. Space them six *chi* apart, ensuring the candle flames do not spread too widely. Place one incense burner and one oil lamp, and do not allow anyone to pass between them. If passage is necessary, set up a **Gate of Concentration**. Constantly tend the lamps to keep the incense smoke unbroken. At midday and sunset, bow again, burn incense, and pray as one wishes. This is the **Inner Rite of the Three-Five Great Fast**.\n\n**Method for Compounding Mysterious Unction**\nTake one *hu* of sesame paste, one *jin* of true sandalwood, one *jin* of *qingmu* (blue wood), one *liang* of *xuanshen* (figwort root), and three *liang* of incense beads. Pound them, place in the paste, seal tightly, and simmer over low heat for half a day to complete.\n\n**Method for Compounding Double-Heaven Water**\nTake three *hu* of water, four *liang* of *qingmu* (blue wood), seven *liang* of true sandalwood, and two *liang* of *xuanshen* (figwort root). Combine and boil until one bubbling. When done, let it settle and cool to a suitable temperature for bathing. This is the **Mysterious Water of the Heavenly Perfected and Jade Maidens**, called the **Divine Elixir for Refining the Embryonic Spirit**. Both this method and the incense beads derive from the **Upper Record of the Precious Fast**, unseen by worldly people.\n\nIf one wishes to perceive subtle resonances and know others’ fortunes and misfortunes, one should ingest the **Talismans of the Three Sovereigns’ Hidden Heaven**. This will naturally establish resonance with the divine, allowing one to foresee the mysterious gatherings of the future.\n\n**Offering Rites**\nAfter completing the nighttime Daoist walk, spread mats and arrange seats according to the positions of the Three Sovereigns. The **Heavenly Sovereign**’s seat is black, facing north; the **Earthly Sovereign**’s seat is white, facing southwest; the **Human Sovereign**’s seat is blue-green, facing northeast. Set out three large trays, three cups of wine, dried meat made from kelp, southern-style glutinous rice dumplings, seasonal fruits, three *dou* of wine, and plain dried meat.\n\nFirst, face north and recite the incantation:\n*\"Fragrant smoke, jade maidens, ascend to report to the August Lords. I, [Name], perform this fast and Daoist walk, completing the eighteen hours. Now I burn incense and present offerings, bowing to invoke the Three Sovereigns and True Lords. May you descend with your numinous essence and enter my body, so that my petition may be presented before the Three Sovereigns’ altar.\"*\n\nNext, pour wine and bow three times, kneeling to say:\n*\"Disciple of the Cavernous Dao, [Name], humbly petitions on behalf of [Recipient’s Name] to invoke the Heavenly Sovereign, Overseer of the Grand Unity; the Earthly Sovereign, Lord of the True Unity; and the Human Sovereign, Governor of the Three Unities. May they descend to this seat and witness my sincere heart.\"*\n\nMeditate on the deities for a long while, then kneel and say:\n*\"Petitioner [Name] respectfully addresses the Three Sovereigns and True Lords. Though I am of humble and ordinary capacity, I have presumptuously received the precious scriptures of the Three Sovereigns, cultivating them inwardly and teaching them outwardly. Now, [Recipient’s Name] has submitted a petition and request. I reverently proclaim it again.\"*\n\nRead the petition aloud.\n\n*\"Having received the decree, I, along with [Number] fellow practitioners, perform the Three Sovereigns’ fast for three days and nights, completing the eighteen hours of the Daoist walk. With utmost sincerity, we humbly invoke your presence. The rites are now complete. We present simple offerings of wine and vegetables, humbly beseeching the August Sovereigns to bestow your compassionate gaze, absolve our deep transgressions and grave faults, resolve karmic entanglements, erase the black records, extend our life spans, heal all illnesses, grant eternal well-being, multiply blessings ten thousandfold, encourage virtuous deeds, bring harmony to families and nations, and ensure universal good fortune.\"*\n\nWith utmost reverence, we present this petition, humbly beseeching your compassionate assent.\n\n*Bow three times again.*\n\nThen, as our hearts dictate, we make further entreaties, saying:\n*\"The August Sovereigns, in your exalted majesty, have deigned to descend and grace this humble and impure place. Now that the rites of invocation are complete, we dare not delay your departure. With each breath, we reverently send you ascending, returning to your divine seats. We kowtow in farewell.\"*\n\n*Bow twice again, then burn incense in the censer, saying:*\n*\"Maidens of the fragrant smoke, as the true spirits descend and bestow their compassionate blessings, may they ascend to the celestial palaces. Let the incense smoke disperse and harmonize with the Dao/Way.\"*\n\nThe rites now concluded, we bow and withdraw.\n\n*The Scripture of the Most High Three Sovereigns’ Precious Fast and the Celestial Register of Divine Immortals ends here.*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上三皇宝斋神仙上录经 经名：太上三皇宝齐神仙上录经。 撰人不详，约出於南北朝或隋唐。 载三皇斋仪及信物制作法。 一卷。 底本出处：《正统道藏》洞神部方法类。 太上三皇宝斋神仙上录经 三皇神仙内神宝祝斋录门 黄帝曰：凡学士精心愿乐，勤道求生，苦斋大寂，希求神仙，朝夕求灵，不避饥寒，救护万姓，以为因缘，福流七世，兔度大患，身超水火，形安体全。 洞极上法，令兆神仙，学以成之，道德日新。 黄帝曰：三皇神者，胎灵之神也。 皇上之秘篇也。 兆有之者神仙，见之者延年，咏之者上见皇君，十方诸天皆来试观焉。 其文至妙，其位至尊，能令人出入水火，变化幽冥，司录三官，一时定生。 精勤之哉，必书仙名，其术至真，非惟经篇。 黄帝曰：兆有此书，勤心斋戒，烧香祝文，沐浴云水，燔烟上元，结斋三 九，八帝神篇，叩心祝诵，上闻三天，七世罪除，冥考都蠲，过度苦道，削罪成真，勤而修之，上见皇君矣。 黄帝曰：先天有三皇之神，八帝次其治，皆高真为辅，邪恶不生，灾害不作，非世所传。 伏羲女娲之时也，其治各一万三千岁。 后上天为八帝尊皇所受灵书妙术、长生久化之道，辅圣七录、治世三奇，此其书也。 又以青素书三皇文，三尺为幡，以朱书之，以一丈竹竿悬於庭中。 亦可以几请皇文，以北向为坐，烧香愿呎，叩齿二十四通竟，祝曰： 香烟玉女，上白皇君，小兆甲乙，清斋绝尘，期灵五通，上愿成真，灭祸生福，上升三天。 毕。 然灯行道，祝愿皆如此法也。 诸是灾难祸害，无不尽消，疾病垂命，皆得更生。 又此斋法，侍灯勤苦，当日中一食，至夜生气时，烧香陈愿毕，又一食，此则每时食息也。 但不得冒履榬殗浊，令不精专之人干犯斋禁也。 行事节度，一如上法。 合上元香珠法",
      "translated_text": "*The Supreme Three Sovereigns’ Precious Fast: Register of Divine Immortals*\n\nThe *Scripture of the Supreme Three Sovereigns’ Precious Fast: Register of Divine Immortals* is of unknown authorship, likely composed during the Northern and Southern Dynasties or the Sui-Tang period. It records the rituals of the Three Sovereigns’ fast and the methods for crafting sacred objects. One fascicle. Base text from the *Daoist Canon of the Zhengtong Era*, *Dongshen* section, category of methods.\n\n---\n\n**The Three Sovereigns’ Register of Divine Immortal Prayers and Inner Spirit Treasures**\n\nThe Yellow Emperor said: All scholars who wholeheartedly aspire to the Dao, seeking life through diligent practice, enduring the great stillness of fasting, yearning for divine immortality, and beseeching the numinous from dawn to dusk without shunning hunger or cold—those who rescue and protect the myriad people, making this their karmic cause—shall have blessings flow through seven generations, escape great calamities, transcend water and fire, and enjoy peace in body and wholeness in form.\n\nThis is the supreme method of the profoundest depths, enabling one to attain divine immortality. Through study, one perfects it, and virtue/power renews daily.\n\nThe Yellow Emperor said: The Three Sovereigns are the spirits of the primordial womb. They are the secret scriptures of the Supreme Sovereign. Those who possess them become divine immortals; those who behold them extend their years; those who chant them ascend to meet the August Lords, while the ten directions’ celestial hosts all come to witness.\n\nTheir texts are most wondrous, their rank most exalted. They empower one to enter and exit water and fire, transform the hidden and obscure, govern the records of the Three Offices, and determine life in an instant. Diligence is paramount—only then will one’s name be inscribed among the immortals. Their arts are utterly authentic, not merely the scriptures alone.\n\nThe Yellow Emperor said: Those who possess this book must fast with devotion, burn incense and recite prayers, bathe in cloud and water, offer smoke to the Upper Prime, and observe the fast for three periods of nine days. With the Eight Emperor Spirit Texts, they knock their hearts and recite invocations, so that their prayers ascend to the Three Heavens. Seven generations of sins are erased, dark trials are wholly absolved, suffering is transcended, transgressions are excised, and truth is attained. Through diligent cultivation, one ascends to meet the August Lords.\n\nThe Yellow Emperor said: In the primordial era, there were the gods of the Three Sovereigns, with the Eight Emperors governing in succession, all assisted by perfected beings. Evil did not arise, nor did disasters occur—this is not what the world transmits. In the time of Fuxi and Nüwa, their reigns each lasted thirteen thousand years. Later, the Supreme Heaven bestowed upon them the Eight Emperors’ sacred scriptures and wondrous arts, the Dao of long life and eternal transformation, the Seven Records of Assisting the Sage, and the Three Marvels of Governing the World—this is that very book.\n\nMoreover, one writes the Three Sovereigns’ texts on blue silk, making banners three feet in length, inscribed in vermilion. These are hung from ten-foot bamboo poles in the courtyard. Alternatively, one may invite the August Texts upon a table, facing north as the seat. Burn incense, make vows, and knock the teeth twenty-four times in succession, then pray:\n\n*\"Fragrant smoke and jade maidens, ascend to report to the August Lords. This humble one, [name], fasts in purity, free from dust, awaiting the five spiritual penetrations. May my supreme vow be fulfilled, calamities extinguished, blessings born, and ascent to the Three Heavens achieved.\"*\n\nWhen finished, light the lamps and perform the Daoist walk, with prayers and vows following this method. All disasters, misfortunes, and harms shall be entirely dispelled; those on the brink of death from illness shall be reborn.\n\nThis fasting method requires vigilance and diligence with the lamps. One eats once at midday, and again at the time of *shengqi* (living qi) at night, after burning incense and presenting vows. This is the regimen for eating and resting at each interval. However, one must not violate the fast’s prohibitions with impurity, nor allow those lacking focus to profane its strictures. The procedures and regulations follow the above method.\n\n**Method for Compounding Upper Prime Incense Beads**",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 709,
      "start_sentence": 0,
      "end_sentence": 29,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.84900712966919,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太上三皇宝斋神仙上录经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "用沉香三斤，熏陆一斤，青木九两，鸡舌五两，玄参三两，雀头六两，詹香三两，白芷二两，真檀四两，艾香三两，安息胶四两，木兰三两。 凡一十二种，别捣，绢筛之毕，纳乾枣十两，更捣三万杵，纳白器中，密盖蒸香一日。 毕，更蜜和捣之，丸如梧桐子，以青绳穿之，日曝令乾，此三皇真元之香珠也。 烧此皆彻九天，真人玉女，皆歌此於空玄之中。 又加雄黄半斤，麝香四两，合捣和为丸，服如大豆大，十九日一服耳。 常能服之，令人神明不衰，口生香气，又感真彻灵，降致玉女，并万病诸症恶鬼、不祥妖魔，皆自远伏也。 黄帝曰：皇文斋法，至真至贵，非世所传。 夫求长生及为万兆请福，救解厄难，除灾却害，当先行八帝大斋之法，以解七世父母，及己身除罪。 三年之后，乃得刻定仙名，以致不死之道也。 若欲劾召百神，皆须积斋成功，感应自然，乃可召之。 其时意中，皆自了於心中也。 黄帝曰：若万兆有疾病急厄，及罪积深大，不可得救者，皆当告请三皇，以为宝斋之法，以拔赎之也。 当烧香，然灯各三枚，或五枚，或七枚，或九枚，或可三十六枚，以象三十六天之数也。 如此四十日或百日，罪名皆除，於是司命司录，以结定仙名，为兆得无量大福。 明灯以照神，燔烟以向气，太真神乐，三皇燕集，兆得神仙，庆流万世。 一年之中，得三七行事，为大度也。 黄帝曰：若为万民致福，救其急难厄祸，兆当清斋三日，若五日七日九日，适意耳。 当沐浴玄云之水，烧皇上之香，然玄液之烛，三灯五灯、七灯九灯，意适耳。 相去间六尺，不得令烛行大阔。 一香垆、一油灯，不得使人从灯间中过，欲听过，立纂门。 又常守灯，令香烟不绝。 至日中、日入，又再拜，烧香祝乞，适所陈耳。 此名三五大斋内礼之法也。 作香玄腴法 用麻腴一斛，真檀一斤，青木香一斤，玄参一两，香珠三两，捣碎，纳腴中，密盖之，微火煎之，半日成也。 作重霄水之法 用水三斛，青木香四两，真檀七两，玄参二两，合治煮之，令得一沸。 毕，清澄适寒温，以自沐浴也。 此天真玉女玄水之法，名炼胎神浆。 此法及香珠，皆出於宝斋上录篇中，非世人之所见也。 兆若欲知机通感，知人罪福者，皆应服三皇幽天符，即自通感神明，逆见将来之玄会也。 醮仪 候夜行道竟，敷席设座，依三皇位。 天皇北皂为座，地皇西南白为座，人皇东北碧为座。 三大长盘，三瓯酒，昆布为脯，南粽，果随时珍，酒三斗，省肉脯。 初向北咒曰： 香烟玉女，上白皇君，某奉为某清斋行道，十八时竟，正尔烧香献礼，拜请三皇真君，愿降以灵元，下入某身，所启径御三皇几前。 次酌酒三拜，跪曰： 洞神弟子某，谨为某奉请天皇监太一君、地皇主真一君、人皇统三一君，愿并降席，鉴察丹心。 次思神良久，跪曰： 小兆某上白三皇真君，某以凡庸，谬叨正法。 昔奉受三皇宝文，内以自修，外以教世。 今有某投词披请，谨重宣闻。 读词。 谨承词旨，率同法如干人，奉为修建三皇斋直，三日三夜一十八时行道，竭诚首请，事已周竟。 谨投蔬醪，薄献苹藻，仰愿圣皇，特垂慈盻，赦宥某深愆重咎，解释冤对，削落黑简，延益祚历，疗治众疾，永蒙康裕，克隆万福，勤行德惠，家国兼泰，率土元吉。",
      "translated_text": "Take three *jin* of aloeswood, one *jin* of frankincense, nine *liang* of *qingmu* (blue wood), five *liang* of clove, three *liang* of *xuanshen* (figwort root), six *liang* of *quetail* (sparrow’s head), three *liang* of *zhanxiang* (benzoin), two *liang* of *baizhi* (angelica root), four *liang* of true sandalwood, three *liang* of mugwort incense, four *liang* of styrax resin, and three *liang* of *mulan* (magnolia). In all, twelve ingredients, each to be pounded separately and sifted through silk. Then add ten *liang* of dried jujubes and pound together thirty thousand times. Place in a white vessel, seal tightly, and steam the incense for one day. When done, mix with honey, pound again, and form into pills the size of *wutong* seeds. Thread them with green cord, dry in the sun, and these become the **Incense Beads of the Three Sovereigns’ True Prime**. Burning them will ascend through the Nine Heavens, where perfected beings and jade maidens will sing amidst the void.\n\nFurther, add half a *jin* of realgar and four *liang* of musk, pound together, and form into pills the size of soybeans. Take one pill every nineteen days. Regular consumption sharpens the spirit without decline, sweetens the breath, and attracts perfected beings and numinous forces, summoning jade maidens while repelling all illnesses, ailments, evil ghosts, inauspicious omens, and malevolent spirits, which will flee and submit from afar.\n\nThe Yellow Emperor said: The **Fasting Method of the August Scriptures** is most true and precious, not transmitted in the mundane world. Those seeking immortality or petitioning for the myriad people’s blessings, delivering them from distress, disasters, and harms, must first perform the **Great Fasting Method of the Eight Emperors** to absolve the sins of seven generations of parents and oneself. After three years, one may inscribe one’s immortal name and attain the Dao of deathlessness. If one wishes to summon the hundred spirits, one must first accumulate fasting merits until resonance occurs naturally—only then may they be invoked. At that time, all will be clearly understood in the heart.\n\nThe Yellow Emperor said: If the myriad people suffer from urgent illnesses, dire calamities, or deep-rooted sins beyond salvation, they should petition the Three Sovereigns and perform the **Precious Fasting Method** to redeem themselves. Burn incense and light three, five, seven, nine, or thirty-six lamps, symbolizing the number of the Thirty-Six Heavens. After forty or a hundred days, all sins will be erased. The **Directors of Destiny** and **Scribes of Records** will then inscribe one’s immortal name, bestowing boundless great fortune. Bright lamps illuminate the spirits; rising smoke directs the *qi*. The Supreme Perfected delight in divine music, and the Three Sovereigns gather in feast. The petitioner attains transcendence, and blessings flow for ten thousand generations. Performing this ritual twenty-one times in a year constitutes the **Great Crossing**.\n\nThe Yellow Emperor said: To bring blessings to the myriad people and deliver them from urgent calamities and disasters, the petitioner should fast for three, five, seven, or nine days—whatever feels appropriate. Bathe in the **Mysterious Cloud Water**, burn the **August Supreme Incense**, and light the **Mysterious Fluid Candles**—three, five, seven, or nine lamps, as one wishes. Space them six *chi* apart, ensuring the candle flames do not spread too widely. Place one incense burner and one oil lamp, and do not allow anyone to pass between them. If passage is necessary, set up a **Gate of Concentration**. Constantly tend the lamps to keep the incense smoke unbroken. At midday and sunset, bow again, burn incense, and pray as one wishes. This is the **Inner Rite of the Three-Five Great Fast**.\n\n**Method for Compounding Mysterious Unction**\nTake one *hu* of sesame paste, one *jin* of true sandalwood, one *jin* of *qingmu* (blue wood), one *liang* of *xuanshen* (figwort root), and three *liang* of incense beads. Pound them, place in the paste, seal tightly, and simmer over low heat for half a day to complete.\n\n**Method for Compounding Double-Heaven Water**\nTake three *hu* of water, four *liang* of *qingmu* (blue wood), seven *liang* of true sandalwood, and two *liang* of *xuanshen* (figwort root). Combine and boil until one bubbling. When done, let it settle and cool to a suitable temperature for bathing. This is the **Mysterious Water of the Heavenly Perfected and Jade Maidens**, called the **Divine Elixir for Refining the Embryonic Spirit**. Both this method and the incense beads derive from the **Upper Record of the Precious Fast**, unseen by worldly people.\n\nIf one wishes to perceive subtle resonances and know others’ fortunes and misfortunes, one should ingest the **Talismans of the Three Sovereigns’ Hidden Heaven**. This will naturally establish resonance with the divine, allowing one to foresee the mysterious gatherings of the future.\n\n**Offering Rites**\nAfter completing the nighttime Daoist walk, spread mats and arrange seats according to the positions of the Three Sovereigns. The **Heavenly Sovereign**’s seat is black, facing north; the **Earthly Sovereign**’s seat is white, facing southwest; the **Human Sovereign**’s seat is blue-green, facing northeast. Set out three large trays, three cups of wine, dried meat made from kelp, southern-style glutinous rice dumplings, seasonal fruits, three *dou* of wine, and plain dried meat.\n\nFirst, face north and recite the incantation:\n*\"Fragrant smoke, jade maidens, ascend to report to the August Lords. I, [Name], perform this fast and Daoist walk, completing the eighteen hours. Now I burn incense and present offerings, bowing to invoke the Three Sovereigns and True Lords. May you descend with your numinous essence and enter my body, so that my petition may be presented before the Three Sovereigns’ altar.\"*\n\nNext, pour wine and bow three times, kneeling to say:\n*\"Disciple of the Cavernous Dao, [Name], humbly petitions on behalf of [Recipient’s Name] to invoke the Heavenly Sovereign, Overseer of the Grand Unity; the Earthly Sovereign, Lord of the True Unity; and the Human Sovereign, Governor of the Three Unities. May they descend to this seat and witness my sincere heart.\"*\n\nMeditate on the deities for a long while, then kneel and say:\n*\"Petitioner [Name] respectfully addresses the Three Sovereigns and True Lords. Though I am of humble and ordinary capacity, I have presumptuously received the precious scriptures of the Three Sovereigns, cultivating them inwardly and teaching them outwardly. Now, [Recipient’s Name] has submitted a petition and request. I reverently proclaim it again.\"*\n\nRead the petition aloud.\n\n*\"Having received the decree, I, along with [Number] fellow practitioners, perform the Three Sovereigns’ fast for three days and nights, completing the eighteen hours of the Daoist walk. With utmost sincerity, we humbly invoke your presence. The rites are now complete. We present simple offerings of wine and vegetables, humbly beseeching the August Sovereigns to bestow your compassionate gaze, absolve our deep transgressions and grave faults, resolve karmic entanglements, erase the black records, extend our life spans, heal all illnesses, grant eternal well-being, multiply blessings ten thousandfold, encourage virtuous deeds, bring harmony to families and nations, and ensure universal good fortune.\"*",
      "overlap_context": " reborn.\n\nThis fasting method requires vigilance and diligence with the lamps. One eats once at midday, and again at the time of *shengqi* (living qi) at night, after burning incense and presenting vows. This is the regimen for eating and resting at each interval. However, one must not violate the fast’s prohibitions with impurity, nor allow those lacking focus to profane its strictures. The procedures and regulations follow the above method.\n\n**Method for Compounding Upper Prime Incense Beads**",
      "start_char": 709,
      "end_char": 1982,
      "start_sentence": 30,
      "end_sentence": 75,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.59364581108093,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太上三皇宝斋神仙上录经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "谨以奏言，请赐矜允。 再三拜。 又随意陈乞，言曰： 上降尊灵，远临鄙浊。 祈礼既毕，不敢稽留，呼吸上升，还神反位，稽首 奉辞。 次再拜，烧香复垆曰： 香烟玉女，真灵临降，垂慈布泽，上升天宫，香烟飞散，与道和合。 次毕，作礼而退。 太上三皇宝斋神仙上录经竟",
      "translated_text": "With utmost reverence, we present this petition, humbly beseeching your compassionate assent.\n\n*Bow three times again.*\n\nThen, as our hearts dictate, we make further entreaties, saying:\n*\"The August Sovereigns, in your exalted majesty, have deigned to descend and grace this humble and impure place. Now that the rites of invocation are complete, we dare not delay your departure. With each breath, we reverently send you ascending, returning to your divine seats. We kowtow in farewell.\"*\n\n*Bow twice again, then burn incense in the censer, saying:*\n*\"Maidens of the fragrant smoke, as the true spirits descend and bestow their compassionate blessings, may they ascend to the celestial palaces. Let the incense smoke disperse and harmonize with the Dao/Way.\"*\n\nThe rites now concluded, we bow and withdraw.\n\n*The Scripture of the Most High Three Sovereigns’ Precious Fast and the Celestial Register of Divine Immortals ends here.*",
      "overlap_context": " we humbly invoke your presence. The rites are now complete. We present simple offerings of wine and vegetables, humbly beseeching the August Sovereigns to bestow your compassionate gaze, absolve our deep transgressions and grave faults, resolve karmic entanglements, erase the black records, extend our life spans, heal all illnesses, grant eternal well-being, multiply blessings ten thousandfold, encourage virtuous deeds, bring harmony to families and nations, and ensure universal good fortune.\"*",
      "start_char": 1982,
      "end_char": 2122,
      "start_sentence": 76,
      "end_sentence": 85,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 5.370059490203857,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太上三皇宝斋神仙上录经.txt",
        "category": "方法类"
      }
    }
  ]
}