{
  "source_id": "太上飞步五星经",
  "source_file": "chunked_daozang\\太上飞步五星经.json",
  "total_chunks": 4,
  "total_original_chars": 3739,
  "total_translated_chars": 21966,
  "total_translation_time": 103.1973934173584,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\本文类\\太上飞步五星经.txt",
    "category": "本文类"
  },
  "full_translation": "*The Supreme Scripture of Flying Steps Among the Five Stars*\n\n**Scripture Title:** *The Supreme Scripture of Flying Steps Among the Five Stars*. Author unknown. This text expounds the method of \"flying steps\" among the Five Stars and the Seven Primes. One scroll. Base text from *The Orthodox Daoist Canon*, *Dongshen* Section, *Benwen* Category.\n\n---\n\n**The Supreme Scripture of Flying Steps Among the Five Stars**\n\nWhen stepping among the Five Stars, before ascending the stellar *gang* and upon descending from it, first visualize the essences of the Five Stars within your five viscera. Once visualization is complete, click the teeth five times, swallow saliva five times, and softly intone the prayer:\n\n> The Five Stars array their radiance, illuminating the five directions.\n> The Water Star averts calamity; the virtue of Wood brings prosperity.\n> Mars dispels misfortune; Venus repels warfare.\n> Saturn stabilizes the four quarters, benefiting household and state.\n> Names inscribed on jade tablets, recorded in the celestial chambers,\n> Riding the whirlwind, scattering light, soaring through the Great Void,\n> Emerging and vanishing into the unseen, roaming and feasting in the ten directions.\n> Five-colored clouds cover and shield, summoning the staff and seizing the wind.\n> Should the myriad spirits be commanded, one ascends as an immortal lord.\n\nWhen finished, align the heart toward the *gang* and visualize while reciting at the moment of ascent and descent. Hold the breath while ascending the *gang*; first invoke the names of the Five Stars and their consorts, then step over the *gang* and tread upon the stars.\n\nFirst, lift both feet onto Venus, from Venus ascend to Saturn, from Saturn ascend to Mars, from Mars ascend to Jupiter, from Jupiter ascend to Mercury, and from Mercury return to tread upon Venus. After three cycles, hold the breath again to ascend the *gang*, following the old method for fifteen cycles. Each time you reach a star, invoke the name of its Star Lord and consort, press the left hand to the heart, and pray: \"Flying immortal.\"\n\n- **Eastern Year Star True Sovereign Lord**, personal name Chenglan, style Qingning; **Consort**, personal name Baorong, style Feiyun.\n- **Southern Mars Star True Sovereign Lord**, personal name Weiting, style Sanrong; **Consort**, personal name Huaping, style Xuanluo.\n- **Western Venus Star True Sovereign Lord**, personal name Liaoling, style Zhenxun; **Consort**, personal name Biaoying, style Ling’en.\n- **Northern Mercury Star True Sovereign Lord**, personal name Qixuan, style Jingyuan; **Consort**, personal name Xuanhua, style Long’e.\n- **Central Saturn Star True Sovereign Lord**, personal name Canglu, style Danyan; **Consort**, personal name Kongyao, style Feixian.\n\n**The Nine Stars of the Northern Dipper:**\n1. **First Great Star**: yellow brocade robe, vermilion and azure flying skirt.\n2. **Second Prime Star**: azure brocade robe, green-feathered flying skirt.\n3. **Third True Star**: azure brocade robe, embroidered feathered floral skirt.\n4. **Fourth Pivot Star**: purple brocade robe, yellow-flowered feathered skirt.\n5. **Fifth Rigid Star**: vermilion brocade cloak, purple and azure flying skirt.\n6. **Sixth Record Star**: vermilion brocade robe, azure embroidered flying skirt.\n7. **Seventh Pass Star**: cinnabar brocade robe, azure-flowered feathered skirt.\n8. **Eighth Emperor Star**: purple brocade robe, embroidered flying cinnabar skirt.\n9. **Ninth Venerable Star**: green brocade robe, kingfisher-feathered floral skirt.\n\nAll wear their hair in cloud-like topknots.\n\nThe scripture states: When performing the ritual, always face north while holding the concealed text, for beginners of the true and wondrous have not yet ventured into subtleties, do not comprehend the orientation of stellar positions, nor recognize the directional shifts of the Mysterious Dipper. Thus, they must face north while holding the text to gradually seek understanding. Once the meaning of the text is grasped and the seasonal movements of the stars are recognized, one should follow the Dipper’s pointer and visualize the steps accordingly. In this way, there is no fixed direction, and one need not always face north. Facing north is merely for beginners. This principle can be extended by analogy; there is no need for further inquiry.\n\nThe Dao of the Supreme Perfected’s steps among the Five Stars governs the descent of the Five Stars into their chambers. Hold the breath while ascending the *gang*; first invoke the names of the Five Stars and their consorts, then step over the *gang* and tread upon the stars. This means that when first ascending the *gang*, one should firmly and resolutely proceed, invoke the names, and then step over the *gang* to tread upon the stars. Each time you reach a star, it is even better to focus the mind and invoke the name of the star’s position anew. If the repetition becomes burdensome, one may follow the old method. In ancient times, Yu Shegong, Beilian Zisheng, and the Old Man of Changling all ascended to heaven by this method, without shirking its complexity. This is like a merchant awaiting profit—how could they fear the rapids? Their goal is merely wealth. If seekers of the Dao were as single-minded as merchants, what could prevent them from attaining immortality? Yet, beginners often claim diligence but soon grow lax. They resemble a cart about to break apart, its hundred joints loosening, or an ox burdened with weight, its hooves faltering on a long journey. Such are the concerns of learners, and the amusement of those who have attained the Dao. If one can refine the inner mirror of the heart, this will resonate with the divine, and spiritual beings may dispel your ignorance, carrying you in the chariot of stellar radiance.\n\nThe Five Stars’ diagram is typically oriented toward the south, with Venus in the west and Jupiter in the east, arranged accordingly. The reason for this is that the Five Stars’ movements are hidden and unpredictable, unlike the Northern Dipper, which maintains a fixed position. Thus, their positions are determined by the five directions, not by the stars’ actual locations.\n\nThe Three Eights form twenty-four spirits; one may recite them in sequence or visualize all three Eights at once. Alternatively, one may visualize the Upper Radiance at dawn, the Middle Radiance at noon, and the Lower Radiance at midnight—this depends on the practitioner’s intention. If one retreats to a secluded mountain, free from worldly affairs, and inwardly focuses on the spirit’s gate, absorbing the true morning *qi*, then at dawn one may visualize all three Eights at once, and in each of the three periods, further visualize one Radiance—this is even better. However, worldly affairs often interfere, making this practice difficult to sustain. Yet, one should not diminish one’s efforts due to such challenges.\n\nOf old, the Perfected Lords of Western Citadel and Paulownia Peak both followed this Dao. According to the *Precious Jade Register of the White Simplicity and Azure Scripture*: \"One who does not visualize the twenty-four spirits nor knows the names of the Three Eights cannot be counted among the People of Great Peace, nor can they serve as ministers to the Later Sage.\"\n\nThe method for ascending to the Wood Star: constantly contemplate the sight of Jupiter. One should face the star with a rectified mind, place the right hand over the heart, and bow in reverence. Then, cover both eyes with the left hand, perform nine breath-holds, knock the teeth twenty-seven times, and swallow saliva nine times. With eyes closed, mentally invoke the Perfected Sovereign of Jupiter’s Central Palace and the Sovereign’s Lady, reciting their names and sobriquets thrice, and say: \"May I, together with the True Lord of Primordial Yang and the Azure Sovereign, and the Sovereign’s Lady, ascend in the Eightfold Azure Chariot of Effulgent Scenery to the Palace of the Most High.\" Upon completion, with eyes still covered by the hand, face the star and recite the incantation:\n\n\"Celestial radiance intermingles in harmony,\nEssence flows to the Eastern Direction.\nI gaze upward toward the Nine Gates,\nWhere flying auroras scatter their brilliance.\nWithin the Azure Terrace of Primordial Yang,\nResides the Azure Sovereign.\nAzure fangs cast their glow,\nIlluminating the Nine Quarters.\nThe resplendent Lady,\nSobriquet ‘Flying Cloud,’\nDons sacred brocade,\nDragon mantle and tiger-skirt,\nGirded with phoenix talismans,\nAdorned with a floral crown.\nEmerging from the formless, entering the void,\nThey roam the Great Non-Being.\nPreceded by the Azure Thearch,\nFollowed by a thousand spirits,\nThey come to welcome and receive,\nThat I may become a Flying Perfected,\nAscending to the Jade Clarity,\nThe Lofty Chambers of the Highest.\"\n\nAfter the incantation, remove the hand and no longer cover the eyes. Gaze at the star and absorb its light twenty-seven times, visualizing the nine rays entering the throat. When all is complete, knock the teeth three times to conclude.\n\nThe method for ascending to the Fire Star: contemplate the sight of Mars. One should face the star with a rectified mind, place the left hand over the heart, and bow in reverence. Then, cover the mouth with the right hand, perform three breath-holds, knock the teeth twenty-seven times, and swallow saliva nine times. With eyes closed, mentally invoke the Perfected Sovereign of Mars’ Central Palace and the Sovereign’s Lady, reciting their names and sobriquets thrice, and say: \"May I, together with the Cinnabar Fire and Vermilion Sovereign and the Sovereign’s Lady, ascend in the Eightfold Cinnabar Chariot of Effulgent Scenery to the Palace of Jade Clarity.\" Upon completion, face the star and softly recite the incantation:\n\n\"Mysterious constellations flow and reflect,\nCrimson light illumines the Southern Darkness.\nI gaze upward toward the Three Gates,\nWhere vermilion clouds form a crimson city.\nWithin resides the Cinnabar Sovereign,\nNamed ‘Abiding Stillness.’\nThe Lady’s inner illumination,\nIs called ‘Flowering Vase.’\nTogether they don cloud-frost,\nPhoenix blossoms and dragon bells,\nGirded with tiger-script talismans,\nAdorned with flying azure headscarves.\nEmerging from the formless, entering the profound,\nThey soar and roam the Five Cities.\nPreceded by the Vermilion Thearch,\nFollowed by the Six Dings,\nThey come to summon and receive,\nThat I may attain the name of Perfected,\nAscending to the Mysterious Void,\nInscribed in gold upon Jade Clarity.\"\n\nAfter the incantation, remove the hand and no longer cover the mouth. Gaze at the star and absorb its light twenty-seven times, visualizing the three rays entering the throat. When all is complete, knock the teeth three times to conclude.\n\nThe method for ascending to the Metal Star: contemplate the sight of Venus. One should face the star with a rectified mind, place the right hand over the heart, and bow in reverence. Then, cover both nostrils with the left hand, perform seven breath-holds, knock the teeth twenty-seven times, and swallow saliva nine times. With eyes closed, mentally invoke the Perfected Sovereign of Venus’ Central Palace and the Sovereign’s Lady, reciting their names and sobriquets thrice, and say: \"May I, together with the Lord of Grand Simplicity and Lesser Yang and the Sovereign’s Lady, ascend in the Eightfold Pristine Brush of Effulgent Scenery to the Palace of Jade Clarity.\" Upon completion, face the star and softly recite the incantation:\n\n\"Seven *qi* soar resplendently,\nRadiance illumines the Western Direction.\nI gaze upward toward the Seven Gates,\nWhere numinous towers gleam with brilliance.\nPristine splendor shines forth,\nVirtue marks the lineage of Metal.\nWithin resides the Lord of Lesser Yang,\nNamed ‘White Sovereign.’\nThe Lady’s numinous grace,\nGoverns the Jade Chamber.\nTogether they don gleaming brocade,\nTinkling bells and tiger talismans,\nAdorned with a dawn-supporting crown,\nGirded with golden pendants.\nEmerging from the manifest, entering the void,\nThey wander the Jade Pole Star.\nPreceded by the White Thearch,\nFollowed by the Six Gengs,\nThey descend to welcome and receive,\nAscending to the Rampart Palace.\nInscribed in gold upon the Upper Clarity,\nOne attains the title of Perfected Duke.\"\n\nAfter the incantation, remove the hand and no longer cover the nostrils. Gaze at the star and absorb its light twenty-seven times as prescribed.\n\nThe method for ascending to the Water Star: contemplate the sight of Mercury. One should face the star with a rectified mind, place both hands over the heart, and bow in reverence. Then, raise both hands to cover the ears, perform five breath-holds, knock the teeth twenty-seven times, and swallow saliva nine times. With eyes closed, mentally invoke the Perfected Sovereign of Mercury’s Central Palace and the Sovereign’s Lady, reciting their names and sobriquets thrice, and say: \"May I, together with the Sovereign of Mercury and the Sovereign’s Lady, ascend in the Eightfold Azure Chariot of Effulgent Scenery to the Upper Palace of the Upper Clarity.\" Upon completion, face the star and softly recite the incantation:\n\n\"Five *qi* soar mysteriously,\nRadiance flows to the Northern Direction.\nI gaze upward toward the Five Gates,\nWhere azure towers stand lush and dense.\nBrilliant rays reach the vista,\nNuminous reflections upon auroras.\nWithin resides the Dark Sovereign,\nSobriquet ‘Essence of the Source.’\nDragon maidens swirl in splendor,\nTogether governing the Mysterious Pass.\nTogether they don azure robes,\nPurple brocade and flying skirts,\nGirded with tiger talismans,\nAdorned with lotus crowns.\nEmerging to traverse the Nine Voids,\nEntering toward the Jade Ford.\nPreceded by the Dark Thearch,\nFollowed by the Six Rens,\nThey descend to welcome and receive,\nAscending to the Purple Chamber.\nInscribed upon the Most High,\nOne attains the title of Jade Perfected.\"\n\nAfter the incantation, remove the hands and no longer cover the ears. Proceed as prescribed.\n\nThe method for ascending to the Earth Star: contemplate the sight of Saturn. One should face the star with a rectified mind, place both hands over the heart, and bow in reverence. Then, cover the upper chamber of the Grotto Palace with the left hand, perform four breath-holds, knock the teeth twenty-seven times, and swallow saliva nine times. With eyes closed, mentally invoke the Perfected Lord of Saturn and the Sovereign’s Lady, reciting their names and sobriquets thrice, and say: \"May I, together with the Grand Dao Lord of the Central Palace and the Sovereign’s Lady, ascend in the Eightfold Yellow Chariot of Effulgent Scenery to the Palace of the Upper Clarity.\" Upon completion, face the star and softly recite the incantation:\n\n\"Four *qi* linger and converge,\nConcentrating upon the Central Origin.\nI gaze upward toward the Nine Poles,\nSurveying the Four Gates on all sides.\nThe Yellow Terrace and Purple Chamber,\nScatter their rays and brilliance.\nNuminous light swirls in splendor,\nCelestial blossoms fall upon the portico.\nWithin resides the Yellow Sovereign,\nSobriquet ‘Profound Prolongation.’\nThe Lady’s hidden virtue,\nIs called ‘Non-Excellence.’\nGoverning harmony and life-*qi*,\nGuiding the mysterious and irrigating the origin.\nTogether they don yellow clouds,\nDragon mantles and brocade skirts,\nGirded with golden talismans,\nAdorned with purple crowns.\nEmerging to traverse the Mysterious Void,\nUnfurling light at the Golden Gate.\nPreceded by the Yellow Thearch,\nFollowed by the Six Jis in chariots,\nThey descend to draw near and welcome,\nAscending to the Celestial Pass.\nInscribed in gold upon the Most High,\nJade tablets carve the name.\nSoaring through the Great Emptiness,\nOne attains the title of Jade Minister.\"\n\nWhen the incantation is complete, withdraw your hands and do not again cover the chamber of the Grotto, proceeding as in the method above.\n\n**Mingtang Internal Scripture: Heart-Opening and Forgetfulness-Dispelling Talisman**\nOn the appointed day at dawn, face the royal direction and write in vermilion. Bow twice and ingest it, reciting:\n\"Five spirits open the heart,\nPiercing hearing to sever sound.\nThree *hun* gather essence,\nAll guard the cinnabar heart.\nLet me not forget—\nFive viscera seek afar.\"\n\nAfter bowing twice and completing the incantation, ingest it. Upon finishing, swallow saliva five times and click the teeth five times. Let no one witness this.\n\nIf not using the appointed day, perform on the first, fifteenth, or twenty-seventh day of the month—three times monthly. Within a year, efficacy will manifest. This is a secret talisman.\n\n**Oral Instructions of the Perfected of Great Emptiness:**\nOn the *yi-mao* day of spring, *bing-wu* day of summer, *geng-shen* day of autumn, or *ren-zi* day of winter, at the hour beyond dusk, first grind cinnabar and realgar in equal measure until fine. Wrap them in silk to the size of a jujube, and at the appointed hour, plug both ears with them.\n\nThis is the Dao of dissolving the Three Corpses and refining the Seven *po*—a secret method. Let no one know of it.\n\nThe next day at noon, bathe in east-flowing water. After bathing, arrange the bedding anew, change into fresh garments, wash the old ones, and replace worn sandals. Sweep and sprinkle water beneath the sleeping couch, ensuring the entire chamber is immaculate.\n\nThen, lie down with the head raised, close the breath, and clench the fists for a long while. Softly recite:\n\"The Dao of Heaven is constant,\nRenewing the old to make it new.\nOn this auspicious day of the Thearch,\nBathing makes one true.\nThree *qi* dissolve the corpse,\nCinnabar and realgar pacify the *hun*.\nPrecious refinement of the Seven *po*\nDraws them near to me.\"\n\nThis is the supreme method for dissolving corpse impurities and renewing the form—a crucial secret. Perform it once in each of the four seasons.\n\nThe Perfected of Great Emptiness said: My former master taught that on the five *da* days, when the sun has risen three or four *zhang*, stand upright and face it with the heart aligned. Visualize the three *hun* spirits entering the heart together with the sunlight. After a long while, hold the breath for three cycles, swallow saliva three times, and softly recite:\n\"Radiance of the Great Yang scatters,\nShedding purple and azure light.\nEnter my *hun*,\nIllumine my five forms.\nRepel spectral trials of the heart,\nMake the heart balanced and upright.\nWithin, penetrate the Nine *qi*;\nWithout, connect to the embryo’s destiny.\nAscend as a flying immortal to the Upper Clarity,\nThe Jade Register now fixed.\"\n\nAfterward, wipe the eyes fourteen times and click the teeth fourteen times. When complete,\nThis method makes the three *hun* congeal in clarity, the cinnabar heart square and upright. All demonic arts and heart trials will cease—a true essential Dao. Practice it regularly.\n\nOn each of the five *da* days, face the sun and induce a sneeze. If no sneeze comes, use a soft object to gently stimulate the nose toward the sun, and a sneeze will follow. After sneezing, recite:\n\"Heavenly light advances,\nSix embryos ascend and connect.\nThree *hun* guard the spirit,\nSeven *po* do not perish.\nReceiving the sun’s sneeze,\nI share its divine power.\nFly as an immortal to the Upper Clarity,\nAttain the rank of Perfected Duke.\"\n\nAfter reciting, wipe the eyes fourteen times. This causes inner essence to rise and merge with the sunlight, the three *hun* to shine within, opening the heart’s spirit, dissolving the hundred essences, and circulating them through the inner palace. If not on a *da* day, this need not be done.\n\nOn the five *da* days, face north and bow five times. Silently invoke the names of the Supreme Perfected Sovereign Lord and the Lady of the Dao three times. After clicking the teeth five times, remove your headscarf, kneel long, and reverently declare:\n\"Before the august presence of the Five Stars, Sun, Moon, Supreme Perfected, Highest Realized Lords, and the Lady of the Dao; before the Jade Clarity, Supreme Clarity, Supreme Thearch, and the Great Dao Sage Lord of the Most High—\nI confess the myriad sins and transgressions of my seven generations of ancestors, parents, and myself since past lives. I beseech deliverance, that the Three Offices may issue decrees to all bureaus, releasing my guilt, erasing my name from the black registers. I pray to join the Perfected of the Five Stars, together ascending the radiant celestial array, entering the Jade Gate, ascending to the Upper Clarity, the chambers of the Highest, the halls of the Mysterious Void. Inscribed in gold as a Jade Clarity immortal, my name recorded in the Upper Clarity, I shall attain the rank of Perfected Duke. My name inscribed in the Most High, I shall become a Jade Perfected. Soaring through the Great Emptiness, I shall be a Jade Minister.\"\n\nFor Jupiter: cover the left eye with the left hand, and place the right hand over the heart.\nFor Mars: place the left hand over the heart, and cover the mouth with the right hand.\n\nFor Venus: place the right hand over the heart, and cover the nose with the left hand.\nFor Mercury: after placing both hands over the heart, cover both ears.\nFor Saturn: place both hands over the heart, and cover the upper chamber with the left hand.\n\nRecord the matters of the Eight Essentials:\nAt midday on the sixth day of the first month; at the *bu* hour on the first day of the second month;\nAt midnight on the seventh day of the third month; at the *shi* hour on the ninth day of the fourth month;\nAt midnight on the fifteenth day of the fifth month; at midday on the third day of the sixth month;\nAt midnight on the seventh day of the seventh month; at the *shen* hour on the fourth day of the eighth month;\nAt dawn on the second day of the ninth month; at dawn on the first day of the tenth month;\nAt midnight on the sixth day of the eleventh month; at midnight on the twelfth day of the twelfth month.\n\nRecord the Five Auspicious Days of the Dao.\n\nThus concludes the *Scripture of the Most High on Pacing the Five Stars*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上飞步五星经 经名：太上飞步五星经。 撰人不详。 内官飞步五星七元之法。 一卷。 底本出处斗：《正统道藏》洞神部本文类。 太上飞步五星经 步五星，初未登星罡之时，及讫下罡之时，并先存五星之精，在我五脏之中。 存毕，叩齿五通，咽液五过，微祝曰： 五星列照，焕明五方，水星却灾，木德致昌，荧感消祸，太白辟兵，镇星四据，家国利亨，名刊玉简，录字帝房，乘飙散景，飞腾太空，出入冥无，游宴十方，五云覆盖，招棒摄风，设使万灵，上为仙公。 毕。 正心向罡口 ，当上下之际而存祝也。 闭气上罡，当先呼五星名字，及夫人名字毕，乃越罡蹈星。 先举两足上太白，从太白登镇星，从镇星登火星，从火星登木星，从木星登辰星，从辰星还蹑太白。 凡三过，乃更闭气上罡，案旧往还十五过。 每至星所，辄呼星君及夫人名字，左手抚心，祝曰：飞仙。 东方岁星真皇君，讳澄澜，字清凝； 夫人讳宝容，字飞云。 南方荧惑星真皇君，讳维渟，字散融； 夫人讳华瓶，字玄罗。 西方太白星真皇君，讳寥凌，字振寻； 夫人讳飙英，字灵恩。 北方辰星真皇君，讳启咺，字精源； 夫人讳玄华，字龙娥。 中央镇星真皇君，讳藏陆，字耽延； 夫人讳空瑶，字飞贤。 北斗第一太星，黄锦帔，丹青飞裙。 北斗第二元星，青锦帔，绿羽飞裙。 北斗第三真星，青锦帔，绣羽华裙。 北斗第四钮星，紫锦帔，黄华羽裙。 北斗第五刚星，朱锦被，紫青飞裙。 北斗第六纪星，朱锦帔，青绣飞裙。 北斗第七关星，丹锦帔，青华羽裙。 北斗第八帝星，紫锦帔，绣用飞丹裙。 北斗第九尊星，绿锦帔，翠羽华裙。 右头并颓云髻。 经曰：行事时，皆北向执隐书而为之者，谓始学真妙，未涉微远，不解星位之首向，不识玄斗之指建，故当北向执书，以渐求之耳。 若既#1解书意，识星转之随时，自宜随斗所指，按而存步，如此则无有常向，不为皆向北也。 夫一切北向，自为始学者耳。 恐此将可以意通触类，不足复问邪。 太上真人步五星之道，以政五星降室。 闭气上罡，先呼五星、星夫人名字毕，乃越罡蹈星。 谓始上罡硬顿往，呼名字毕，乃越罡蹈星耳。 若每至星上，得复重心呼所至星处之名字，益其佳也。 若烦重摊常，祖可按旧而行耳昔郁涉公、北连子生、长陵老人，皆此法而得升天，不以烦难为辞也，所谓治生者俟。 商饭之汲汲，岂惮脸滩哉，所期唯钱货而已耳。 若使求道常如贾贩之用心，亦有何不得仙耶。 但惜初学者，皆言专尽勤至，而彼辄懈纵。 有似车之将故而百节缓落，又似负重之牛造远足蹇。 夫学者之所患，而为得之者之所笑，皆如此辈事耳。 苟能心研内镜者，是为感发乎神，将有灵人发子之蒙，携辰景之舆矣。 五星图布，常向南也。 以太白位在西，岁星在束，按而施之。 所以尔者，五星隐伏，纵横无常，不如北斗列象，恒在故一，以定位於五方，不得随星之所在也。 三八景合二十四神，以次念之，亦可一时顿存三八，亦可平旦存上景，日中存中景，夜半存下景，在人意为之也。 若外身幽岩，屏绝人事，内念神关，摄真朝气，将可平旦顿存三八景，三时又各重存一景，益当佳也。 但人间多事，此烦难常行耳，事不得常益自薄。",
      "translated_text": "*The Supreme Scripture of Flying Steps Among the Five Stars*\n\n**Scripture Title:** *The Supreme Scripture of Flying Steps Among the Five Stars*. Author unknown. This text expounds the method of \"flying steps\" among the Five Stars and the Seven Primes. One scroll. Base text from *The Orthodox Daoist Canon*, *Dongshen* Section, *Benwen* Category.\n\n---\n\n**The Supreme Scripture of Flying Steps Among the Five Stars**\n\nWhen stepping among the Five Stars, before ascending the stellar *gang* and upon descending from it, first visualize the essences of the Five Stars within your five viscera. Once visualization is complete, click the teeth five times, swallow saliva five times, and softly intone the prayer:\n\n> The Five Stars array their radiance, illuminating the five directions.\n> The Water Star averts calamity; the virtue of Wood brings prosperity.\n> Mars dispels misfortune; Venus repels warfare.\n> Saturn stabilizes the four quarters, benefiting household and state.\n> Names inscribed on jade tablets, recorded in the celestial chambers,\n> Riding the whirlwind, scattering light, soaring through the Great Void,\n> Emerging and vanishing into the unseen, roaming and feasting in the ten directions.\n> Five-colored clouds cover and shield, summoning the staff and seizing the wind.\n> Should the myriad spirits be commanded, one ascends as an immortal lord.\n\nWhen finished, align the heart toward the *gang* and visualize while reciting at the moment of ascent and descent. Hold the breath while ascending the *gang*; first invoke the names of the Five Stars and their consorts, then step over the *gang* and tread upon the stars.\n\nFirst, lift both feet onto Venus, from Venus ascend to Saturn, from Saturn ascend to Mars, from Mars ascend to Jupiter, from Jupiter ascend to Mercury, and from Mercury return to tread upon Venus. After three cycles, hold the breath again to ascend the *gang*, following the old method for fifteen cycles. Each time you reach a star, invoke the name of its Star Lord and consort, press the left hand to the heart, and pray: \"Flying immortal.\"\n\n- **Eastern Year Star True Sovereign Lord**, personal name Chenglan, style Qingning; **Consort**, personal name Baorong, style Feiyun.\n- **Southern Mars Star True Sovereign Lord**, personal name Weiting, style Sanrong; **Consort**, personal name Huaping, style Xuanluo.\n- **Western Venus Star True Sovereign Lord**, personal name Liaoling, style Zhenxun; **Consort**, personal name Biaoying, style Ling’en.\n- **Northern Mercury Star True Sovereign Lord**, personal name Qixuan, style Jingyuan; **Consort**, personal name Xuanhua, style Long’e.\n- **Central Saturn Star True Sovereign Lord**, personal name Canglu, style Danyan; **Consort**, personal name Kongyao, style Feixian.\n\n**The Nine Stars of the Northern Dipper:**\n1. **First Great Star**: yellow brocade robe, vermilion and azure flying skirt.\n2. **Second Prime Star**: azure brocade robe, green-feathered flying skirt.\n3. **Third True Star**: azure brocade robe, embroidered feathered floral skirt.\n4. **Fourth Pivot Star**: purple brocade robe, yellow-flowered feathered skirt.\n5. **Fifth Rigid Star**: vermilion brocade cloak, purple and azure flying skirt.\n6. **Sixth Record Star**: vermilion brocade robe, azure embroidered flying skirt.\n7. **Seventh Pass Star**: cinnabar brocade robe, azure-flowered feathered skirt.\n8. **Eighth Emperor Star**: purple brocade robe, embroidered flying cinnabar skirt.\n9. **Ninth Venerable Star**: green brocade robe, kingfisher-feathered floral skirt.\n\nAll wear their hair in cloud-like topknots.\n\nThe scripture states: When performing the ritual, always face north while holding the concealed text, for beginners of the true and wondrous have not yet ventured into subtleties, do not comprehend the orientation of stellar positions, nor recognize the directional shifts of the Mysterious Dipper. Thus, they must face north while holding the text to gradually seek understanding. Once the meaning of the text is grasped and the seasonal movements of the stars are recognized, one should follow the Dipper’s pointer and visualize the steps accordingly. In this way, there is no fixed direction, and one need not always face north. Facing north is merely for beginners. This principle can be extended by analogy; there is no need for further inquiry.\n\nThe Dao of the Supreme Perfected’s steps among the Five Stars governs the descent of the Five Stars into their chambers. Hold the breath while ascending the *gang*; first invoke the names of the Five Stars and their consorts, then step over the *gang* and tread upon the stars. This means that when first ascending the *gang*, one should firmly and resolutely proceed, invoke the names, and then step over the *gang* to tread upon the stars. Each time you reach a star, it is even better to focus the mind and invoke the name of the star’s position anew. If the repetition becomes burdensome, one may follow the old method. In ancient times, Yu Shegong, Beilian Zisheng, and the Old Man of Changling all ascended to heaven by this method, without shirking its complexity. This is like a merchant awaiting profit—how could they fear the rapids? Their goal is merely wealth. If seekers of the Dao were as single-minded as merchants, what could prevent them from attaining immortality? Yet, beginners often claim diligence but soon grow lax. They resemble a cart about to break apart, its hundred joints loosening, or an ox burdened with weight, its hooves faltering on a long journey. Such are the concerns of learners, and the amusement of those who have attained the Dao. If one can refine the inner mirror of the heart, this will resonate with the divine, and spiritual beings may dispel your ignorance, carrying you in the chariot of stellar radiance.\n\nThe Five Stars’ diagram is typically oriented toward the south, with Venus in the west and Jupiter in the east, arranged accordingly. The reason for this is that the Five Stars’ movements are hidden and unpredictable, unlike the Northern Dipper, which maintains a fixed position. Thus, their positions are determined by the five directions, not by the stars’ actual locations.\n\nThe Three Eights form twenty-four spirits; one may recite them in sequence or visualize all three Eights at once. Alternatively, one may visualize the Upper Radiance at dawn, the Middle Radiance at noon, and the Lower Radiance at midnight—this depends on the practitioner’s intention. If one retreats to a secluded mountain, free from worldly affairs, and inwardly focuses on the spirit’s gate, absorbing the true morning *qi*, then at dawn one may visualize all three Eights at once, and in each of the three periods, further visualize one Radiance—this is even better. However, worldly affairs often interfere, making this practice difficult to sustain. Yet, one should not diminish one’s efforts due to such challenges.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1275,
      "start_sentence": 0,
      "end_sentence": 56,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.96126747131348,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\太上飞步五星经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "昔西城王君、桐□上真，皆按此道也。 按《苞玄玉箓白简青经》云：不存二十四神，不知三八景名字者，不得为太平民，亦不得为后圣之臣。 欲飞登木星之法，常思见岁星，当正心视星，以右手抚心，毕而礼之，左手掩两目，乃九闭气，又叩齿二十七通，咽液九过，临闭目，心呼岁星中真皇之君、君夫人名讳字三过毕，曰：愿得与始阳青皇真君、君夫人共乘八景碧舆，上登太上官。 言毕，乃临闭目於手下，向星而咒曰： 天光交和，精流东方，仰望九门，飞霞散锋，始阳碧台，中有青皇，青牙垂晖，映照九方，郁灿夫人，字曰飞云，齐服灵锦，龙帔虎裙，腰带凤符，首巾华冠，出无入虚，遨游太无，前策青帝，后从千神，来见迎接，得为飞真，上登玉清，高上之房。 祝毕，去手勿复掩目，临目视星，〔服星〕#2之光二十七吞，存九芒尽来入喉中。 都毕，又叩齿三通止。 欲飞登火星之法，思见荧惑星，当正心视星，以左手抚心，毕而礼之，右手掩口，乃三闭气，又叩齿二十七通，咽液九过，临闭两目，心呼荧惑中真皇君、君夫人讳字三过毕，曰：愿得与丹火赤皇君、君夫人共乘八景丹舆，上登玉清官。 毕，乃向星微祝： 玄象流映，丹光南冥，仰望三门，朱云绛城，中有丹皇，名曰维停，夫人内照，是为华瓶，齐服云霜，凤华龙铃，腰带虎书，首巾飞青，出无入玄，翔遨五城，前导赤帝，后从六丁，来见招延，得真之名，上登玄虚，金书玉清。 祝毕，去手勿复掩口，临目视星，服星之光二十七吞，存令三芒尽来入喉中。 都毕，叩齿三通止。 欲飞登金星之法，思见太白星，当正心视星，以右手抚心，毕而礼之，左手掩两鼻孔，乃七闭气，又叩齿二十七通，咽液九过，临闭两目，心存太白中真皇君、君夫人讳字三过毕，曰：愿得与太素少阳君、君夫人共乘八景素笔，上登玉清官。 毕，又向星微祝： 七炁艳飞，光照西方，仰望七门，灵阙激锋，素晖烛映，德标金宗，中有少阳，号曰白皇，夫人灵恩，治在玉房，齐服皓锦，流铃虎章，首建扶晨，腰佩金珰，出有入虚，游步玉罡，前导白帝，后从六庚，来下见迎，北登墉宫，名书上清，得为真公。 祝毕，去手勿复掩鼻，临目视星，服星之光二十七吞如法。 欲飞登水星之法，思见水星，正心视星，以两手抚心，毕而礼之，举两手以掩两耳，乃五闭气，又叩齿二十七通，咽液九过，临闭两目，心呼辰星中真皇道君、君夫人名字三过毕，曰：愿得与辰星皇君、君夫人共乘八景苍舆，上登上清上元宫。 毕，又向星微祝： 五气玄飞，光流北方，仰望五门，苍阙郁繁，激芒达观，灵映景云，中有黑皇，厥字精源，龙娥纷蔼，俱理玄关，齐服苍被，紫锦飞裙，腰佩虎符，首建莲冠，出凌九虚，入向玉津，前导黑帝，后从六壬，来下见迎，上登紫房，名书太上，得为玉真。 祝毕，去手勿复掩耳，如法。 欲飞登土星之法，思见镇星，正心视星，以两手抚心，毕而礼之，左手以掩洞房上，乃四闭气，又叩齿二十七通，咽液九过，临闭两目，心呼镇星真君、君夫人讳字三过毕，曰：愿得与中央太皇道君、君夫人共乘八景黄舆，上登上清宫。 毕，又向星微祝： 四气徘徊，合注中元，仰望九极，旁观四门，黄台紫房，垂锋散芒，灵光郁散，天华落轩，中有黄皇，厥字耽延，夫人潜德，是为非贤，理和命气，导玄灌元，齐服黄云，帔龙锦裙，腰佩金符，首巾紫冠，出凌玄空，展光金门，前导黄帝，六己卫轩，来下见近，上登天关，金书太上，琅简刻名，飞行太空，得为玉卿。",
      "translated_text": "Of old, the Perfected Lords of Western Citadel and Paulownia Peak both followed this Dao. According to the *Precious Jade Register of the White Simplicity and Azure Scripture*: \"One who does not visualize the twenty-four spirits nor knows the names of the Three Eights cannot be counted among the People of Great Peace, nor can they serve as ministers to the Later Sage.\"\n\nThe method for ascending to the Wood Star: constantly contemplate the sight of Jupiter. One should face the star with a rectified mind, place the right hand over the heart, and bow in reverence. Then, cover both eyes with the left hand, perform nine breath-holds, knock the teeth twenty-seven times, and swallow saliva nine times. With eyes closed, mentally invoke the Perfected Sovereign of Jupiter’s Central Palace and the Sovereign’s Lady, reciting their names and sobriquets thrice, and say: \"May I, together with the True Lord of Primordial Yang and the Azure Sovereign, and the Sovereign’s Lady, ascend in the Eightfold Azure Chariot of Effulgent Scenery to the Palace of the Most High.\" Upon completion, with eyes still covered by the hand, face the star and recite the incantation:\n\n\"Celestial radiance intermingles in harmony,\nEssence flows to the Eastern Direction.\nI gaze upward toward the Nine Gates,\nWhere flying auroras scatter their brilliance.\nWithin the Azure Terrace of Primordial Yang,\nResides the Azure Sovereign.\nAzure fangs cast their glow,\nIlluminating the Nine Quarters.\nThe resplendent Lady,\nSobriquet ‘Flying Cloud,’\nDons sacred brocade,\nDragon mantle and tiger-skirt,\nGirded with phoenix talismans,\nAdorned with a floral crown.\nEmerging from the formless, entering the void,\nThey roam the Great Non-Being.\nPreceded by the Azure Thearch,\nFollowed by a thousand spirits,\nThey come to welcome and receive,\nThat I may become a Flying Perfected,\nAscending to the Jade Clarity,\nThe Lofty Chambers of the Highest.\"\n\nAfter the incantation, remove the hand and no longer cover the eyes. Gaze at the star and absorb its light twenty-seven times, visualizing the nine rays entering the throat. When all is complete, knock the teeth three times to conclude.\n\nThe method for ascending to the Fire Star: contemplate the sight of Mars. One should face the star with a rectified mind, place the left hand over the heart, and bow in reverence. Then, cover the mouth with the right hand, perform three breath-holds, knock the teeth twenty-seven times, and swallow saliva nine times. With eyes closed, mentally invoke the Perfected Sovereign of Mars’ Central Palace and the Sovereign’s Lady, reciting their names and sobriquets thrice, and say: \"May I, together with the Cinnabar Fire and Vermilion Sovereign and the Sovereign’s Lady, ascend in the Eightfold Cinnabar Chariot of Effulgent Scenery to the Palace of Jade Clarity.\" Upon completion, face the star and softly recite the incantation:\n\n\"Mysterious constellations flow and reflect,\nCrimson light illumines the Southern Darkness.\nI gaze upward toward the Three Gates,\nWhere vermilion clouds form a crimson city.\nWithin resides the Cinnabar Sovereign,\nNamed ‘Abiding Stillness.’\nThe Lady’s inner illumination,\nIs called ‘Flowering Vase.’\nTogether they don cloud-frost,\nPhoenix blossoms and dragon bells,\nGirded with tiger-script talismans,\nAdorned with flying azure headscarves.\nEmerging from the formless, entering the profound,\nThey soar and roam the Five Cities.\nPreceded by the Vermilion Thearch,\nFollowed by the Six Dings,\nThey come to summon and receive,\nThat I may attain the name of Perfected,\nAscending to the Mysterious Void,\nInscribed in gold upon Jade Clarity.\"\n\nAfter the incantation, remove the hand and no longer cover the mouth. Gaze at the star and absorb its light twenty-seven times, visualizing the three rays entering the throat. When all is complete, knock the teeth three times to conclude.\n\nThe method for ascending to the Metal Star: contemplate the sight of Venus. One should face the star with a rectified mind, place the right hand over the heart, and bow in reverence. Then, cover both nostrils with the left hand, perform seven breath-holds, knock the teeth twenty-seven times, and swallow saliva nine times. With eyes closed, mentally invoke the Perfected Sovereign of Venus’ Central Palace and the Sovereign’s Lady, reciting their names and sobriquets thrice, and say: \"May I, together with the Lord of Grand Simplicity and Lesser Yang and the Sovereign’s Lady, ascend in the Eightfold Pristine Brush of Effulgent Scenery to the Palace of Jade Clarity.\" Upon completion, face the star and softly recite the incantation:\n\n\"Seven *qi* soar resplendently,\nRadiance illumines the Western Direction.\nI gaze upward toward the Seven Gates,\nWhere numinous towers gleam with brilliance.\nPristine splendor shines forth,\nVirtue marks the lineage of Metal.\nWithin resides the Lord of Lesser Yang,\nNamed ‘White Sovereign.’\nThe Lady’s numinous grace,\nGoverns the Jade Chamber.\nTogether they don gleaming brocade,\nTinkling bells and tiger talismans,\nAdorned with a dawn-supporting crown,\nGirded with golden pendants.\nEmerging from the manifest, entering the void,\nThey wander the Jade Pole Star.\nPreceded by the White Thearch,\nFollowed by the Six Gengs,\nThey descend to welcome and receive,\nAscending to the Rampart Palace.\nInscribed in gold upon the Upper Clarity,\nOne attains the title of Perfected Duke.\"\n\nAfter the incantation, remove the hand and no longer cover the nostrils. Gaze at the star and absorb its light twenty-seven times as prescribed.\n\nThe method for ascending to the Water Star: contemplate the sight of Mercury. One should face the star with a rectified mind, place both hands over the heart, and bow in reverence. Then, raise both hands to cover the ears, perform five breath-holds, knock the teeth twenty-seven times, and swallow saliva nine times. With eyes closed, mentally invoke the Perfected Sovereign of Mercury’s Central Palace and the Sovereign’s Lady, reciting their names and sobriquets thrice, and say: \"May I, together with the Sovereign of Mercury and the Sovereign’s Lady, ascend in the Eightfold Azure Chariot of Effulgent Scenery to the Upper Palace of the Upper Clarity.\" Upon completion, face the star and softly recite the incantation:\n\n\"Five *qi* soar mysteriously,\nRadiance flows to the Northern Direction.\nI gaze upward toward the Five Gates,\nWhere azure towers stand lush and dense.\nBrilliant rays reach the vista,\nNuminous reflections upon auroras.\nWithin resides the Dark Sovereign,\nSobriquet ‘Essence of the Source.’\nDragon maidens swirl in splendor,\nTogether governing the Mysterious Pass.\nTogether they don azure robes,\nPurple brocade and flying skirts,\nGirded with tiger talismans,\nAdorned with lotus crowns.\nEmerging to traverse the Nine Voids,\nEntering toward the Jade Ford.\nPreceded by the Dark Thearch,\nFollowed by the Six Rens,\nThey descend to welcome and receive,\nAscending to the Purple Chamber.\nInscribed upon the Most High,\nOne attains the title of Jade Perfected.\"\n\nAfter the incantation, remove the hands and no longer cover the ears. Proceed as prescribed.\n\nThe method for ascending to the Earth Star: contemplate the sight of Saturn. One should face the star with a rectified mind, place both hands over the heart, and bow in reverence. Then, cover the upper chamber of the Grotto Palace with the left hand, perform four breath-holds, knock the teeth twenty-seven times, and swallow saliva nine times. With eyes closed, mentally invoke the Perfected Lord of Saturn and the Sovereign’s Lady, reciting their names and sobriquets thrice, and say: \"May I, together with the Grand Dao Lord of the Central Palace and the Sovereign’s Lady, ascend in the Eightfold Yellow Chariot of Effulgent Scenery to the Palace of the Upper Clarity.\" Upon completion, face the star and softly recite the incantation:\n\n\"Four *qi* linger and converge,\nConcentrating upon the Central Origin.\nI gaze upward toward the Nine Poles,\nSurveying the Four Gates on all sides.\nThe Yellow Terrace and Purple Chamber,\nScatter their rays and brilliance.\nNuminous light swirls in splendor,\nCelestial blossoms fall upon the portico.\nWithin resides the Yellow Sovereign,\nSobriquet ‘Profound Prolongation.’\nThe Lady’s hidden virtue,\nIs called ‘Non-Excellence.’\nGoverning harmony and life-*qi*,\nGuiding the mysterious and irrigating the origin.\nTogether they don yellow clouds,\nDragon mantles and brocade skirts,\nGirded with golden talismans,\nAdorned with purple crowns.\nEmerging to traverse the Mysterious Void,\nUnfurling light at the Golden Gate.\nPreceded by the Yellow Thearch,\nFollowed by the Six Jis in chariots,\nThey descend to draw near and welcome,\nAscending to the Celestial Pass.\nInscribed in gold upon the Most High,\nJade tablets carve the name.\nSoaring through the Great Emptiness,\nOne attains the title of Jade Minister.\"",
      "overlap_context": "ance at midnight—this depends on the practitioner’s intention. If one retreats to a secluded mountain, free from worldly affairs, and inwardly focuses on the spirit’s gate, absorbing the true morning *qi*, then at dawn one may visualize all three Eights at once, and in each of the three periods, further visualize one Radiance—this is even better. However, worldly affairs often interfere, making this practice difficult to sustain. Yet, one should not diminish one’s efforts due to such challenges.",
      "start_char": 1275,
      "end_char": 2655,
      "start_sentence": 57,
      "end_sentence": 79,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.486276388168335,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\太上飞步五星经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "祝毕，去手勿复掩洞房，如上法。 明堂内经开心辟忘符 开日旦，向王方，朱书，再拜服之，祝曰： 五神开心，彻听绝音，三魂摄精，尽守丹心，使我勿忘，五藏远寻。 再拜毕祝，祝毕乃服，服毕，咽液五过，叩齿五通。 勿令人见。 若不用开日，以月旦、月十五日、二十七日，一月三服，一年便验，秘符也。 太虚真人口诀：以春乙卯日，夏丙午日、秋庚申、冬壬子，冥外时，先捣朱砂、雄黄二物，分等细捣之，以绵裹之，使如枣大，临外时以塞两耳中。 此消三尸炼七魄之道，秘法也，勿令有知者。 明日日中时，以东流水沐浴，沐浴毕，更整饰床席，易着衣服，浣故者，更弊屐，洗澡之。 都毕，又扫酒於寝床下，通令所住一室盛洁也。 更安枕卧，向上闭气，握固良久，而微祝曰： 天道有常，改易故新，上帝吉日，沐浴为真，三气消尸，朱黄安魂，宝炼七魄，与我相亲。 此是消炼尸秽之上法，改易新形之要诀也。 四时唯各取一日为之。 太虚真人曰：先师见教，以五达之日，日出三四丈许，正立，以心对日，存三魂神与日光俱入心中，良久，闭气三息，咽液三过，微祝曰： 太阳散晖，垂光紫青，来入我魂，照我五形，却鬼试心，使心平正，内彻九气，外通胎命，飞仙上清，玉箓已定。 毕，以手拭目二七，叩齿二七，都毕。 此法使人三魂凝明，丹心方正，万邪藏术，心试不行，真要道也。 常当行之。 诸以五达日，向日趋令嚏。 若不得嚏，以软物向日引导鼻中，亦即嚏也。 嚏毕，祝曰： 天光来进，六胎上通，三魂守神，七魄不亡，承日呜嚏，与日神同，飞仙上清，位为真公。 祝毕，拭目二七。 是内精上交日光，三魂发明於内，使人开心神，解百精，流转於内府也。 若非五达日，可不须尔也。 以五达之日，北向五再拜，心呼上真皇君夫人名字三过毕，叩齿五通毕，解巾长跪，谨启： 五星日月上皇高真道君、道君夫人，玉清太上上清上皇上帝大道圣君几前，因自陈七祖父母以下及一身千罪万过，上世以来乞愿得解脱，三官告下诸司，使罪名离释，削除黑籍，乞愿得与五星之真，俱奔华辰，上登上清，交行玉门，上登玉清，高上之房，上登玄虚，金书玉清，名书上清，得为真公，名书太上，得为玉真，飞行太空，得为玉卿。 木星，左手掩目，右手抚心。 火星，左手抚心，右手掩口。",
      "translated_text": "When the incantation is complete, withdraw your hands and do not again cover the chamber of the Grotto, proceeding as in the method above.\n\n**Mingtang Internal Scripture: Heart-Opening and Forgetfulness-Dispelling Talisman**\nOn the appointed day at dawn, face the royal direction and write in vermilion. Bow twice and ingest it, reciting:\n\"Five spirits open the heart,\nPiercing hearing to sever sound.\nThree *hun* gather essence,\nAll guard the cinnabar heart.\nLet me not forget—\nFive viscera seek afar.\"\n\nAfter bowing twice and completing the incantation, ingest it. Upon finishing, swallow saliva five times and click the teeth five times. Let no one witness this.\n\nIf not using the appointed day, perform on the first, fifteenth, or twenty-seventh day of the month—three times monthly. Within a year, efficacy will manifest. This is a secret talisman.\n\n**Oral Instructions of the Perfected of Great Emptiness:**\nOn the *yi-mao* day of spring, *bing-wu* day of summer, *geng-shen* day of autumn, or *ren-zi* day of winter, at the hour beyond dusk, first grind cinnabar and realgar in equal measure until fine. Wrap them in silk to the size of a jujube, and at the appointed hour, plug both ears with them.\n\nThis is the Dao of dissolving the Three Corpses and refining the Seven *po*—a secret method. Let no one know of it.\n\nThe next day at noon, bathe in east-flowing water. After bathing, arrange the bedding anew, change into fresh garments, wash the old ones, and replace worn sandals. Sweep and sprinkle water beneath the sleeping couch, ensuring the entire chamber is immaculate.\n\nThen, lie down with the head raised, close the breath, and clench the fists for a long while. Softly recite:\n\"The Dao of Heaven is constant,\nRenewing the old to make it new.\nOn this auspicious day of the Thearch,\nBathing makes one true.\nThree *qi* dissolve the corpse,\nCinnabar and realgar pacify the *hun*.\nPrecious refinement of the Seven *po*\nDraws them near to me.\"\n\nThis is the supreme method for dissolving corpse impurities and renewing the form—a crucial secret. Perform it once in each of the four seasons.\n\nThe Perfected of Great Emptiness said: My former master taught that on the five *da* days, when the sun has risen three or four *zhang*, stand upright and face it with the heart aligned. Visualize the three *hun* spirits entering the heart together with the sunlight. After a long while, hold the breath for three cycles, swallow saliva three times, and softly recite:\n\"Radiance of the Great Yang scatters,\nShedding purple and azure light.\nEnter my *hun*,\nIllumine my five forms.\nRepel spectral trials of the heart,\nMake the heart balanced and upright.\nWithin, penetrate the Nine *qi*;\nWithout, connect to the embryo’s destiny.\nAscend as a flying immortal to the Upper Clarity,\nThe Jade Register now fixed.\"\n\nAfterward, wipe the eyes fourteen times and click the teeth fourteen times. When complete,\nThis method makes the three *hun* congeal in clarity, the cinnabar heart square and upright. All demonic arts and heart trials will cease—a true essential Dao. Practice it regularly.\n\nOn each of the five *da* days, face the sun and induce a sneeze. If no sneeze comes, use a soft object to gently stimulate the nose toward the sun, and a sneeze will follow. After sneezing, recite:\n\"Heavenly light advances,\nSix embryos ascend and connect.\nThree *hun* guard the spirit,\nSeven *po* do not perish.\nReceiving the sun’s sneeze,\nI share its divine power.\nFly as an immortal to the Upper Clarity,\nAttain the rank of Perfected Duke.\"\n\nAfter reciting, wipe the eyes fourteen times. This causes inner essence to rise and merge with the sunlight, the three *hun* to shine within, opening the heart’s spirit, dissolving the hundred essences, and circulating them through the inner palace. If not on a *da* day, this need not be done.\n\nOn the five *da* days, face north and bow five times. Silently invoke the names of the Supreme Perfected Sovereign Lord and the Lady of the Dao three times. After clicking the teeth five times, remove your headscarf, kneel long, and reverently declare:\n\"Before the august presence of the Five Stars, Sun, Moon, Supreme Perfected, Highest Realized Lords, and the Lady of the Dao; before the Jade Clarity, Supreme Clarity, Supreme Thearch, and the Great Dao Sage Lord of the Most High—\nI confess the myriad sins and transgressions of my seven generations of ancestors, parents, and myself since past lives. I beseech deliverance, that the Three Offices may issue decrees to all bureaus, releasing my guilt, erasing my name from the black registers. I pray to join the Perfected of the Five Stars, together ascending the radiant celestial array, entering the Jade Gate, ascending to the Upper Clarity, the chambers of the Highest, the halls of the Mysterious Void. Inscribed in gold as a Jade Clarity immortal, my name recorded in the Upper Clarity, I shall attain the rank of Perfected Duke. My name inscribed in the Most High, I shall become a Jade Perfected. Soaring through the Great Emptiness, I shall be a Jade Minister.\"\n\nFor Jupiter: cover the left eye with the left hand, and place the right hand over the heart.\nFor Mars: place the left hand over the heart, and cover the mouth with the right hand.",
      "overlap_context": "he origin.\nTogether they don yellow clouds,\nDragon mantles and brocade skirts,\nGirded with golden talismans,\nAdorned with purple crowns.\nEmerging to traverse the Mysterious Void,\nUnfurling light at the Golden Gate.\nPreceded by the Yellow Thearch,\nFollowed by the Six Jis in chariots,\nThey descend to draw near and welcome,\nAscending to the Celestial Pass.\nInscribed in gold upon the Most High,\nJade tablets carve the name.\nSoaring through the Great Emptiness,\nOne attains the title of Jade Minister.\"",
      "start_char": 2656,
      "end_char": 3590,
      "start_sentence": 80,
      "end_sentence": 110,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.39834213256836,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\太上飞步五星经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "金星，右手抚心，左手掩鼻。 水星，两手抚心毕，掩两耳。 土星，以两手抚心，左手掩洞房上。 右记八素中事。 正月六日中时，二月一日晡时， 三月七日夜半，四月九日食时， 五月十五日夜半，六月三日中时， 七月七日夜半，八月四日申时， 九月二日平旦，十月一日平旦， 十一月六日夜半，十二月十二日夜半。 右记五达吉日。 太上飞步五星经竟 #1『既』字原作『脱』，据《太上五星七元空常诀》改。 #2『服星』二字据后文补。",
      "translated_text": "For Venus: place the right hand over the heart, and cover the nose with the left hand.\nFor Mercury: after placing both hands over the heart, cover both ears.\nFor Saturn: place both hands over the heart, and cover the upper chamber with the left hand.\n\nRecord the matters of the Eight Essentials:\nAt midday on the sixth day of the first month; at the *bu* hour on the first day of the second month;\nAt midnight on the seventh day of the third month; at the *shi* hour on the ninth day of the fourth month;\nAt midnight on the fifteenth day of the fifth month; at midday on the third day of the sixth month;\nAt midnight on the seventh day of the seventh month; at the *shen* hour on the fourth day of the eighth month;\nAt dawn on the second day of the ninth month; at dawn on the first day of the tenth month;\nAt midnight on the sixth day of the eleventh month; at midnight on the twelfth day of the twelfth month.\n\nRecord the Five Auspicious Days of the Dao.\n\nThus concludes the *Scripture of the Most High on Pacing the Five Stars*.",
      "overlap_context": "ambers of the Highest, the halls of the Mysterious Void. Inscribed in gold as a Jade Clarity immortal, my name recorded in the Upper Clarity, I shall attain the rank of Perfected Duke. My name inscribed in the Most High, I shall become a Jade Perfected. Soaring through the Great Emptiness, I shall be a Jade Minister.\"\n\nFor Jupiter: cover the left eye with the left hand, and place the right hand over the heart.\nFor Mars: place the left hand over the heart, and cover the mouth with the right hand.",
      "start_char": 3591,
      "end_char": 3823,
      "start_sentence": 111,
      "end_sentence": 124,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 4.3515074253082275,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\太上飞步五星经.txt",
        "category": "本文类"
      }
    }
  ]
}