{
  "source_id": "太上老君说报父母恩重经",
  "source_file": "chunked_daozang\\太上老君说报父母恩重经.json",
  "total_chunks": 3,
  "total_original_chars": 2800,
  "total_translated_chars": 15135,
  "total_translation_time": 74.8737404346466,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\本文类\\太上老君说报父母恩重经.txt",
    "category": "本文类"
  },
  "full_translation": "The *Sutra on the Profound Debt of Parental Kindness Spoken by the Most High Lord Lao*\n\nAt that time, the Most High Lord Lao was in the Yuli Mountains of the Western Kingdom of Yuna, expounding the Dao and virtue, proclaiming precepts and commandments, and broadly discoursing on the causes and conditions of the ten directions. At that moment, fifty thousand followers accompanied him to that place, reverently attending the assembly. With raised fists and crossed hands, they paid homage to the honored countenances and exchanged greetings in full.\n\nThen, from among the assembly, a perfected one named Haikong Zhizang stepped forward, knelt at length, and addressed the Most High, saying: \"We have received our bodies and skin from our parents. The kindness of parents runs deep, yet we have no means to repay it. We only hope that the Great Compassion will take pity on all beings. If we might receive your instruction, we would bear this grace in life and death.\"\n\nThereupon, the Most High was moved for a long while before speaking to Haikong Zhizang: \"Excellent, excellent! Your question is most profound. Listen carefully, and I shall explain.\n\nWhen the form is straight, its shadow is surely upright; when the form is crooked, its shadow is surely slanted. When the sound is clear, its echo is surely pure; when the sound is impure, its echo is surely muddied. Filial piety and its absence are just like this.\n\nIf one is filial and fraternal, within a single household, young and old live in peace and joy. Heavenly beings and humans revere them, divine spirits protect them, and their descendants inherit this virtue without cease. They attract filial children to themselves.\n\nIf one is unfilial, generation after generation, the entire household becomes a nest of enemies. Though they are father and son, they are more hostile than foes. They beget the five rebellions as their children. Father and son, brothers keep separate accounts, eat different meals, share fields but divide the grain, hide delicacies, and eat in secret like thieves. Though they bear human form, they are worse than beasts. Divine spirits do not protect them; the world despises them. All their deeds in life are inauspicious. After death, they fall into hell, enduring every torment. Once their punishment is complete, they are reborn as shrikes. When their offspring can fly, they devour their mother. After a hundred kalpas, they are reborn among humans, gathering the five rebellions and all unfilial causes, becoming father and son only to harm one another. In life and death, they suffer endlessly, cycling without cease. No suffering in the world exceeds this.\n\nWhen a person is born into the world, parents are their closest kin. Without a father, there is no birth; without a mother, there is no nurture. Thus, under the shelter of heaven and earth, the mother’s womb is entrusted. Qi and consciousness coalesce, and for ten months, she carries the burden of pregnancy. Her rest and movement become irregular. When the time is full, the moment of birth arrives.\n\nThe mother fears for her life, her heart filled with sorrow and distress. Her spirit is troubled. On the day of delivery, she suffers both internal and external pain, agony pressing upon her. She cries out in anguish, enduring great torment. Trembling and terrified, she is struck with dread and lamentation.\n\nOnce born, the child is placed upon the grass, wailing. For three months, it lies on its side, constantly fearing the harm of malevolent spirits. When hungry, it needs food—only its mother feeds it. When thirsty, it needs drink—only its mother nurses it. It drinks eighty-four *sheng* of its mother’s milk. For a thousand days, she carries it, shielding it from dust and filth, placing it on dry ground while she lies in the wet. She swallows bitterness and offers sweetness. Without righteousness, no one draws near; without a mother, no one nurtures.\n\nWhen it leaves the cradle and crawls upon the ground, its ten fingernails are unclean, yet it eats without care. If the mother goes east or west, grinds grain at the mill, or attends to official or private matters in haste, she cannot return in time. Yet she knows her child cries at home. The bond between mother and child is innate, their hearts and natures attuned.\n\nThe mother’s hundred bones divide to form two bodies, yet their qi and blood remain one, their two forms inseparable. When the child thinks of its mother, her heart stirs in response. She rushes home, her breasts overflowing with milk. Arriving at the gate, she sees her child in the courtyard—perhaps in the cradle, by the door, in someone’s arms, or alone, on the bed or the floor. Sometimes it sits in its own filth, sometimes it grasps mud or grass. Sometimes it cries, sometimes it nearly stops. When it lifts its eyes and sees its mother, it wails and laughs, shakes its head, and crawls toward her, dragging its belly.\n\nAlas! It turns to its mother in sorrow. The mother bends down, stretches out her hands, wipes away the filth, blows on its mouth, and offers her breast. The child nurses, gazing at her, cooing softly. The mother rejoices at the sight of her child; the child rejoices at the sight of its mother. Their mutual affection and love are profound. No bond is closer than this.\n\nAt two or three years old, the child begins to walk and play. Cold or heat, excrement or urine—only the mother knows. When it smiles, she is happy; when it cries, she is vexed. It delights only in food, desiring nothing else. When parents return from their travels and encounter a feast, if they receive cakes or meat, they dare not eat them but carry them home to give to their child. Nine times out of ten, the child is overjoyed. If once it does not receive something, it feigns tears in a spoiled voice. This becomes its habit.\n\nA spoiled child is unfilial; a filial child is not spoiled. There must be kindness and obedience.\n\nAs the child grows older, it follows its friends. In the prime of youth, it indulges in play and pleasure. It combs its hair, seeking fine clothes. The parents select the finest garments for their child, while they themselves wear coarse and worn-out clothes. If they lack clothing, they seek it far and wide, exhausting their efforts north and south, east and west, even selling their hairpins to arrange a marriage for their child.\n\nYet as the child’s affection grows stronger, the mother becomes more distant. In private chambers, they laugh and speak together.\"\n\nAs parents grow old, their strength wanes. From dawn to dusk, the child does not come to inquire after them. Left alone in an empty chamber, they are treated like strangers. Clothing and food are scarce; hunger and cold press upon their bodies. Their hands and feet are calloused, their ears grow deaf, their eyes dim. Their bed is thin and cold, each day stretching long as a year. Frail and emaciated, their bodies teem with lice and nits. Mosquitoes and horseflies bite their flesh, keeping them awake through the night. They sigh and lament: *\"What sin have we committed to bear such an unfilial child?\"* Leaning on a staff, they shuffle to call out, bowing their heads in humility. Before they can finish speaking, their child raises their voice in anger, eyes glaring, hurling curses. Turning away, the child retreats, leaning against the wall to return. The parents beat their chests in self-reproach, their eyes swelling with tears. They wail in sorrow, *\"Better to have died sooner!\"*\n\nThe mother says to her child: *\"When you were small, had I not nurtured you, you would not have lived. Had I not fed and sheltered you, you would not have grown. I carried you for ten months, as if bearing a heavy burden. My breath came in gasps, more labored than running. At times, fever and chills left me restless, unable to sit or lie still. My belly split, my chest felt full to bursting. My hair fell out, my body wasted away—I could not eat. In the month before your birth, I was constantly fearful, dreading that we might not part. Some days were peaceful, others full of suffering. On the day of your birth, my life hung by a thread. My limbs, veins, and five organs felt as if pierced by knives, pulled by hooks, burned by fire, or chilled by ice. In that moment of separation, whether I lived or died, I endured all the sufferings of the world—words cannot describe them. Once you were born, joy and fear mingled. The pains were unbearable. For three years, I carried you day and night, never apart. I sat and slept in filth, my rest and meals untimely. I watched your every breath, tending to your hunger and thirst. When you fell ill, my heart ached. Hearing your cries of pain, I could not eat; my mouth and throat grew parched. I sought every blessing for you—gold and silver, clothing and toys—thinking only of your well-being, sparing nothing. When you were small, you followed me everywhere, never leaving my side. You ate when I ate, slept when I slept. A day without me, and you would not eat; a night without me, and you would cry without cease. How have you grown so quickly into an enemy? Now that I have you, it would have been better had I never borne you at all. I entrust this to Heaven; the unseen realm will bear witness. I only wish to pass swiftly, to be parted from you. Alas! What else can I do?\"*\n\nThen, the Most High spoke these words and manifested a divine transformation, causing the great earth to tremble. Amid the quaking, the hells of this realm were suddenly revealed. Countless beings trod upon mountains of knives, their hands pierced by trees of swords. Their tongues were torn out and impaled upon iron pillars. In agony, they wailed, their bodies festering, pus and blood oozing from every pore, their flesh torn and mangled, suffering unspeakable torment.\n\nAt this, Haikong Zhizang’s hair stood on end in terror. Tears streaming, he sobbed and addressed the Most High: *\"What sins have these souls committed to endure such suffering?\"*\n\nThe Most High replied: *\"These are the wicked who, in life, were unfilial and unkind, who abandoned their mothers, slandered the Three Treasures, and insulted those who had left the household. Now they receive their retribution—how endless their torment! Day by day, it stretches on without end. There is no escape.\"*\n\nThen the Most High spoke this verse:\n*\"Good naturally meets with good,\nEvil returns to its evil root.\nThose who in life were unfilial—\nWhat gratitude do they repay in death?\nWoe to the pain that binds them,\nPassing through the eighteen gates.\nNot on the Three Pardons’ days\nMay they ever find brief reprieve.\"*\n\nWhen the Most High had spoken this verse, the assembly wept in sorrow, their grief unceasing. They raised their hands and snapped their fingers. In that instant, the multitude turned to gaze southward, where they beheld the Heavenly Palace of the Southern Quarters. There, good men and women moved with dignified grace, their faces radiant. Heavenly feasts of a hundred flavors and endless treasures surrounded them. In perfect beauty and freedom, they enjoyed boundless bliss.\n\nOverjoyed, Zhizang addressed the Dao once more: *\"By what merit have these beings earned such reward, dwelling in Heaven, clothed and fed by nature, enjoying such happiness?\"*\n\nThe Most High replied: *\"In life, they were truly filial and kind, serving their parents with devotion. They revered the Three Treasures, practiced generosity and upheld the precepts, and honored those who had left the household. Now they receive their blessed reward, its fruits without end.\"*\n\nThen the Most High spoke this verse:\n*\"By past causes of utmost filial piety,\nThey served without fail, offering reverence.\nWith faith and respect for the Three Treasures,\nTheir boundless blessings now return.\nIn Heaven’s halls, they roam in splendor,\nTheir fortune towering, lofty and vast.\nThis joy knows no limit,\nFor blessings ever follow.\"*\n\nWhen the Most High had spoken this verse, he sighed deeply and said to Haikong Zhizang: *\"Excellent, excellent! The kindness of parents is as boundless as the vast heavens. Alas, O compassionate mother! How can it ever be repaid? I recall my past life, when I gestated in the womb of the Hong clan, my spirit congealing in the palace of the jade embryo for three thousand seven hundred years. Later, in the era of the Supreme Emperor, I was reborn in the womb of Mother Li, the yin and yang cycles completing their course over eighty-one years. Even now, after eons, I still fear I have not repaid her kindness. How much less can you, ordinary beings, fail to repay your debt? To exhaust all your strength and heart in devotion would still fall short of proper reverence—how much worse to transgress against them! In all the teachings and precepts, this is never left unspoken. Among the thirty-six scriptures, none omits these words. All the sages, past and present, have followed this teaching—how much more should you, who study the Dao, fail to repay your debt? All of you here must resolve deeply: outwardly, honor and serve your parents; inwardly, cultivate great kindness. Even if you ground your bones to dust and melted your flesh, you could not fully repay them. If any being can copy this scripture for their parents, recite and uphold it, burn incense and bow in reverence, and on the Zhongyuan Festival hold a grand offering, prepare fine incense, gather blossoms from the mountains, and arrange pure offerings with diligent devotion, praying for blessings and beseeching grace to deliver their ancestors—this is how to repay the kindness of parents’ nurturing. The sins of the five rebellions and ten evils will be extinguished.\"*\n\nIf on the first day of each month at noon, one observes a pure fast, burns incense, practices the Dao, bows in reverence, and recites this sutra, sins will also be extinguished—this is how to repay one’s parents. Moreover, on this day, one should invite a master of the highest purity and virtue to expound this sutra, elucidate its wondrous meaning, and exhort all beings to awaken hearts of kindness and filial piety. Such merit is supreme and foremost, beyond all conception. Ten thousand merits cannot compare to the act of encouraging others to lecture, recite, and repay their debt of gratitude. Among those who hear this sutra, should even one suddenly awaken a filial heart and serve their parents, their blessings and virtue will be boundless. Above, this moves all the great sages of the heavens; in the middle, it stirs the spirits of the hidden realms; below, it flows to descendants of later generations, who will all be filial and reverent without cease.\n\nAt that time, the great assembly and the Perfected of Vast Empty Wisdom Treasury, having heard the Most High expound the *Sutra on the Weight of Repaying Parents’ Kindness*, were each moved to tears. Having received these words, their filial devotion deepened, engraved in their bones and never forgotten. With profound reverence, they returned to their native lands and respectfully put the teachings into practice.\n\nHere ends the *Sutra on the Weight of Repaying Parents’ Kindness*, spoken by the Most High Lord Lao.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上老君说报父母恩重经 经名：太上老君说报父母恩重经。 撰人不详，似出於唐代。 假托太上老君为海空智藏等圣真说报恩因缘。 一卷。 底本出处：《正统道藏》洞神部本文类。 太上老君说报父母恩重经 尔时，太上老君於西那玉国郁利山中，敷畅道德，宣阐科戒，广为十方说因缘事。 於时随从五万人，俱往彼处恭幸遭筵会，擎拳叉手，礼诸尊颜，问讯既周。 是时众中有一真人，名曰海空智藏，出班长跪，白太上曰：臣等禀受发肤，皆因父母，父母恩深，无由报效。 惟愿大慈愍伤一切，如蒙启训，生死荷恩。 尔时，太上恻然良久，告海空智藏言：善哉善哉，子之所问，要乎深矣。 子可谛听，当为解说。 夫形直者其影必正，形不直者其影必斜，其声清者其响必浄，声不清者其响必浊。 孝与不孝，其义如是。 若孝悌者，一家之中老少安乐，天人钦仰，神明守护，子孙相承，孝慈不断，招感孝顺，以为其子。 若不孝者，世世相继，一门之内总是冤家，虽为父子，甚於雠敌，招五逆以为其儿，父子兄弟各财异食，同园别菜，共田分谷，隐藏珍馔，吃食如偷，虽是人形，不如禽兽，神明不佑，天下轻欺，一生所为，诸不吉利，死入地狱，受一切苦罪毕，受报为百劳鸟，生子能飞，共食其母，百劫之后，托生人中，聚集五逆，诸不孝缘，共为父子，更相残害，死生忧苦，轮转无穷，天下苦痛，莫过於此。 夫人生世，父母为亲，非父不生，非母不养。 是以天地覆荫，寄托母胎，气识相凝，怀娠十月，萦妊胞重，坐卧失常，岁满月充，诞育之候。 其母恐怖性命，惙然恻怛，心神忧丧，产孕之日，内触外触，苦痛交切，失声号叫，受大苦恼，匍匐战惧，骇愕惊嗟。 及至生已，手摩其顶，堕於草上，呱呱号啼，安藏被褥，侧身三月，常畏邪魔之所侵害。 饥时须饭，非母不哺，渴时须饮，非母不乳，计饮母乳八斛四升，千日提携，遮盖尘垢，推乾就湿，咽苦吐甘，非义不亲，非母不养。 忽离栏车，出於地上，十指爪中，食子不浄。 母或东西，碓磨邻里，官私急切，不得时还，即知我儿家中啼哭，母子天亲，心性相感。 分母百骸，而为两身，气血相传，两体无二。 儿既忆母，母即心惊，驰步走归，两乳涌出。 还到门外，见子庭中，或在栏车，或房门际，或有人抱，或无人抱，或在床上，或在地下，或时坐不浄，或时把泥草，或尚啼哭，或啼哭欲止，举眼见母，啼笑嘘嘻，摇头弄脑，曳腹而行。 呜乎呜乎！ 哀向其母，母乃为儿屈身下就，长舒两手，拭除不浄，吹嘘其口，以乳与之。 含乳看母，嘻嘻其声，母见儿喜，儿见母喜，二情思想，慈爱亲重，情亲相念，莫过於此。 二岁三岁，弄意始行，寒热屎尿，非母不悉，笑时怀喜，啼时知嗔，唯乐饮食，所余无愿。 父母行来，值他酒座，或得饼肉，不敢不食，怀挟将归，向与其子。 十回九回，恒常欢喜，一回不得，娇声佯啼，以此为常。 娇生不孝，孝子不娇，必有慈顺。 及年长大，朋友相随，年生少壮，耽玩逸乐，梳头摩发，欲得好衣，拣择精妍，持为其子，粗疏弊恶，父母自充，忽无衣裳，经求四远，倾心南北，逐子东西，横簪向头，为索妻妇。 情爱偏重，其母转疏，私房之中，共相笑语。",
      "translated_text": "The *Sutra on the Profound Debt of Parental Kindness Spoken by the Most High Lord Lao*\n\nAt that time, the Most High Lord Lao was in the Yuli Mountains of the Western Kingdom of Yuna, expounding the Dao and virtue, proclaiming precepts and commandments, and broadly discoursing on the causes and conditions of the ten directions. At that moment, fifty thousand followers accompanied him to that place, reverently attending the assembly. With raised fists and crossed hands, they paid homage to the honored countenances and exchanged greetings in full.\n\nThen, from among the assembly, a perfected one named Haikong Zhizang stepped forward, knelt at length, and addressed the Most High, saying: \"We have received our bodies and skin from our parents. The kindness of parents runs deep, yet we have no means to repay it. We only hope that the Great Compassion will take pity on all beings. If we might receive your instruction, we would bear this grace in life and death.\"\n\nThereupon, the Most High was moved for a long while before speaking to Haikong Zhizang: \"Excellent, excellent! Your question is most profound. Listen carefully, and I shall explain.\n\nWhen the form is straight, its shadow is surely upright; when the form is crooked, its shadow is surely slanted. When the sound is clear, its echo is surely pure; when the sound is impure, its echo is surely muddied. Filial piety and its absence are just like this.\n\nIf one is filial and fraternal, within a single household, young and old live in peace and joy. Heavenly beings and humans revere them, divine spirits protect them, and their descendants inherit this virtue without cease. They attract filial children to themselves.\n\nIf one is unfilial, generation after generation, the entire household becomes a nest of enemies. Though they are father and son, they are more hostile than foes. They beget the five rebellions as their children. Father and son, brothers keep separate accounts, eat different meals, share fields but divide the grain, hide delicacies, and eat in secret like thieves. Though they bear human form, they are worse than beasts. Divine spirits do not protect them; the world despises them. All their deeds in life are inauspicious. After death, they fall into hell, enduring every torment. Once their punishment is complete, they are reborn as shrikes. When their offspring can fly, they devour their mother. After a hundred kalpas, they are reborn among humans, gathering the five rebellions and all unfilial causes, becoming father and son only to harm one another. In life and death, they suffer endlessly, cycling without cease. No suffering in the world exceeds this.\n\nWhen a person is born into the world, parents are their closest kin. Without a father, there is no birth; without a mother, there is no nurture. Thus, under the shelter of heaven and earth, the mother’s womb is entrusted. Qi and consciousness coalesce, and for ten months, she carries the burden of pregnancy. Her rest and movement become irregular. When the time is full, the moment of birth arrives.\n\nThe mother fears for her life, her heart filled with sorrow and distress. Her spirit is troubled. On the day of delivery, she suffers both internal and external pain, agony pressing upon her. She cries out in anguish, enduring great torment. Trembling and terrified, she is struck with dread and lamentation.\n\nOnce born, the child is placed upon the grass, wailing. For three months, it lies on its side, constantly fearing the harm of malevolent spirits. When hungry, it needs food—only its mother feeds it. When thirsty, it needs drink—only its mother nurses it. It drinks eighty-four *sheng* of its mother’s milk. For a thousand days, she carries it, shielding it from dust and filth, placing it on dry ground while she lies in the wet. She swallows bitterness and offers sweetness. Without righteousness, no one draws near; without a mother, no one nurtures.\n\nWhen it leaves the cradle and crawls upon the ground, its ten fingernails are unclean, yet it eats without care. If the mother goes east or west, grinds grain at the mill, or attends to official or private matters in haste, she cannot return in time. Yet she knows her child cries at home. The bond between mother and child is innate, their hearts and natures attuned.\n\nThe mother’s hundred bones divide to form two bodies, yet their qi and blood remain one, their two forms inseparable. When the child thinks of its mother, her heart stirs in response. She rushes home, her breasts overflowing with milk. Arriving at the gate, she sees her child in the courtyard—perhaps in the cradle, by the door, in someone’s arms, or alone, on the bed or the floor. Sometimes it sits in its own filth, sometimes it grasps mud or grass. Sometimes it cries, sometimes it nearly stops. When it lifts its eyes and sees its mother, it wails and laughs, shakes its head, and crawls toward her, dragging its belly.\n\nAlas! It turns to its mother in sorrow. The mother bends down, stretches out her hands, wipes away the filth, blows on its mouth, and offers her breast. The child nurses, gazing at her, cooing softly. The mother rejoices at the sight of her child; the child rejoices at the sight of its mother. Their mutual affection and love are profound. No bond is closer than this.\n\nAt two or three years old, the child begins to walk and play. Cold or heat, excrement or urine—only the mother knows. When it smiles, she is happy; when it cries, she is vexed. It delights only in food, desiring nothing else. When parents return from their travels and encounter a feast, if they receive cakes or meat, they dare not eat them but carry them home to give to their child. Nine times out of ten, the child is overjoyed. If once it does not receive something, it feigns tears in a spoiled voice. This becomes its habit.\n\nA spoiled child is unfilial; a filial child is not spoiled. There must be kindness and obedience.\n\nAs the child grows older, it follows its friends. In the prime of youth, it indulges in play and pleasure. It combs its hair, seeking fine clothes. The parents select the finest garments for their child, while they themselves wear coarse and worn-out clothes. If they lack clothing, they seek it far and wide, exhausting their efforts north and south, east and west, even selling their hairpins to arrange a marriage for their child.\n\nYet as the child’s affection grows stronger, the mother becomes more distant. In private chambers, they laugh and speak together.\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1227,
      "start_sentence": 0,
      "end_sentence": 35,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.34779930114746,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\太上老君说报父母恩重经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "父母年老，气力渐衰，终朝至暮，不来省问，独守空房，犹如外客，少衣少食，饥冻切身，手脚胼胝，耳聋眼暗，单床飘薄，度日如年。 身既尪赢，多饶虮虱，蚊虻噆体，通夕不寐。 长吟叹息：何罪之有，生此不孝之子。 柱杖巡唤，低头下气，欲伸所欠，未尽前言，其儿兴声，瞋目骂詈，回头却退，扶壁而归，槌胸自非，流动目肿，连声唱苦，不如早亡。 母告儿言：汝初小时，非吾不育，饮食遮蔽，非吾不养，怀汝十月，如携重担，气息奔喘，剧於走驰，或时寒热，坐卧不安，腹皮拆裂，心胸填满，发落消瘦，不能饮食。 临生产时，逆前一月，常怀忧怖，恐不相离，或有时安，或有时患。 当生之日，命如风烛，四肢百脉，及以五藏，或如刀刺，或如钩牵，或热如火，或冷如水，比当解离，或死或生尽世间苦，口不能述。 既得生已，喜惧交集，诸苦诸痛，不可堪忍。 三年携抱，日夜不离，坐卧不浄，眠食失时，视儿气色，将息饥渴。 或有疾病，父母心痛，闻子忍苦，母不能食，心口乾燥。 万种求福，黄金白银，衣服玩具，心念子可，无所吝惜。 念汝小时，东西随我，不离寸步，食亦随我，眠亦随我，一日无我，终日不食，一夜无我，啼哭不眠。 如何长大，忽成冤对，今虽有汝，不如本无，付之於天，幽冥当鉴。 愿我早过，与你相离，奈何奈何！ 尔时，太上说斯事已，即现神变，令此大地一切震动，於震动中，忽见此方地狱之内，无数众生足践刀山，手穿剑树，拔出其舌，铁柱刺之，酷痛号哭，身体脓斓，毛孔之内，悉皆流血，大小狼藉，流曳楚毒。 於是海空智藏肃寒毛竖，流泪呜咽，上启太上曰：斯之罪魂，何罪令尔？ 是时，太上告海空智藏言：斯罪人也，生不慈孝，违弃母，诽谤三宝，侮慢出家，今之受报，涂炭何极，日趣长远，无可如何。 尔时太上仍说偈言： 善善自会善，恶恶归恶根。 生前不慈孝，死后报何恩。 苦哉萦痛毒，往返十八门。 非吾三赦日，何得暂蒙原。 尔时，太上说此偈已，大众悲号，流恸不止，便即抗手弹指。 於弹指中，即令大众回面顾视，盻於南方，即见南宫天堂之内，善男女等威仪庠序，华容挺出，天厨百味，珍玩无有穷者，恣形妍盛，娱乐自在。 智藏欢喜，重白道言：不审此人承何福对，得处天堂，衣食自然，受此快乐。 尔时，太上答海空智藏言：此人生时，至心慈孝，供养父母，礼敬三宝，布施持戒，信重出家，今受福庆，果报无穷。 是时太上仍说偈曰： 前缘至孝慈，供养礼无违。 敬信於三宝，无期福会归。 天堂裹容曳，福祉高巍巍。 斯乐今无极，由来福庆随。 尔时，太上说斯偈已，叹息良久，告海空智藏言：善哉善哉，父母恩重，昊天罔极。 呜呼慈母！ 云何可报。 吾忆前世，诞於洪氏胞，凝神琼胎之府，积三千七百年。 逮至上皇，重胞李母，阴阳数极八十一年。 思报母恩，至今劫期，犹恐不复。 何况子等凡流之辈，而不报恩。 竭力尽心，尚亏礼敬，况犯上事，而有差违。 诸教戒中不宣其目，三十六部不着斯言，千圣万圣，谁不遵教，况子学道而不报恩。 汝等众人，深宜笃志，外存孝养，内蕴弘慈，粉骨糜身，亦不能尽。 若有众生，能为父母书写此经，读诵受持，烧香礼拜，於中元日设大斋醮，市办名香，缘山摘蕊，造诸浄供，夙夜殷懃，请福祈恩，拔度先祖，名报父母养育之恩，五逆十恶罪得消灭。",
      "translated_text": "As parents grow old, their strength wanes. From dawn to dusk, the child does not come to inquire after them. Left alone in an empty chamber, they are treated like strangers. Clothing and food are scarce; hunger and cold press upon their bodies. Their hands and feet are calloused, their ears grow deaf, their eyes dim. Their bed is thin and cold, each day stretching long as a year. Frail and emaciated, their bodies teem with lice and nits. Mosquitoes and horseflies bite their flesh, keeping them awake through the night. They sigh and lament: *\"What sin have we committed to bear such an unfilial child?\"* Leaning on a staff, they shuffle to call out, bowing their heads in humility. Before they can finish speaking, their child raises their voice in anger, eyes glaring, hurling curses. Turning away, the child retreats, leaning against the wall to return. The parents beat their chests in self-reproach, their eyes swelling with tears. They wail in sorrow, *\"Better to have died sooner!\"*\n\nThe mother says to her child: *\"When you were small, had I not nurtured you, you would not have lived. Had I not fed and sheltered you, you would not have grown. I carried you for ten months, as if bearing a heavy burden. My breath came in gasps, more labored than running. At times, fever and chills left me restless, unable to sit or lie still. My belly split, my chest felt full to bursting. My hair fell out, my body wasted away—I could not eat. In the month before your birth, I was constantly fearful, dreading that we might not part. Some days were peaceful, others full of suffering. On the day of your birth, my life hung by a thread. My limbs, veins, and five organs felt as if pierced by knives, pulled by hooks, burned by fire, or chilled by ice. In that moment of separation, whether I lived or died, I endured all the sufferings of the world—words cannot describe them. Once you were born, joy and fear mingled. The pains were unbearable. For three years, I carried you day and night, never apart. I sat and slept in filth, my rest and meals untimely. I watched your every breath, tending to your hunger and thirst. When you fell ill, my heart ached. Hearing your cries of pain, I could not eat; my mouth and throat grew parched. I sought every blessing for you—gold and silver, clothing and toys—thinking only of your well-being, sparing nothing. When you were small, you followed me everywhere, never leaving my side. You ate when I ate, slept when I slept. A day without me, and you would not eat; a night without me, and you would cry without cease. How have you grown so quickly into an enemy? Now that I have you, it would have been better had I never borne you at all. I entrust this to Heaven; the unseen realm will bear witness. I only wish to pass swiftly, to be parted from you. Alas! What else can I do?\"*\n\nThen, the Most High spoke these words and manifested a divine transformation, causing the great earth to tremble. Amid the quaking, the hells of this realm were suddenly revealed. Countless beings trod upon mountains of knives, their hands pierced by trees of swords. Their tongues were torn out and impaled upon iron pillars. In agony, they wailed, their bodies festering, pus and blood oozing from every pore, their flesh torn and mangled, suffering unspeakable torment.\n\nAt this, Haikong Zhizang’s hair stood on end in terror. Tears streaming, he sobbed and addressed the Most High: *\"What sins have these souls committed to endure such suffering?\"*\n\nThe Most High replied: *\"These are the wicked who, in life, were unfilial and unkind, who abandoned their mothers, slandered the Three Treasures, and insulted those who had left the household. Now they receive their retribution—how endless their torment! Day by day, it stretches on without end. There is no escape.\"*\n\nThen the Most High spoke this verse:\n*\"Good naturally meets with good,\nEvil returns to its evil root.\nThose who in life were unfilial—\nWhat gratitude do they repay in death?\nWoe to the pain that binds them,\nPassing through the eighteen gates.\nNot on the Three Pardons’ days\nMay they ever find brief reprieve.\"*\n\nWhen the Most High had spoken this verse, the assembly wept in sorrow, their grief unceasing. They raised their hands and snapped their fingers. In that instant, the multitude turned to gaze southward, where they beheld the Heavenly Palace of the Southern Quarters. There, good men and women moved with dignified grace, their faces radiant. Heavenly feasts of a hundred flavors and endless treasures surrounded them. In perfect beauty and freedom, they enjoyed boundless bliss.\n\nOverjoyed, Zhizang addressed the Dao once more: *\"By what merit have these beings earned such reward, dwelling in Heaven, clothed and fed by nature, enjoying such happiness?\"*\n\nThe Most High replied: *\"In life, they were truly filial and kind, serving their parents with devotion. They revered the Three Treasures, practiced generosity and upheld the precepts, and honored those who had left the household. Now they receive their blessed reward, its fruits without end.\"*\n\nThen the Most High spoke this verse:\n*\"By past causes of utmost filial piety,\nThey served without fail, offering reverence.\nWith faith and respect for the Three Treasures,\nTheir boundless blessings now return.\nIn Heaven’s halls, they roam in splendor,\nTheir fortune towering, lofty and vast.\nThis joy knows no limit,\nFor blessings ever follow.\"*\n\nWhen the Most High had spoken this verse, he sighed deeply and said to Haikong Zhizang: *\"Excellent, excellent! The kindness of parents is as boundless as the vast heavens. Alas, O compassionate mother! How can it ever be repaid? I recall my past life, when I gestated in the womb of the Hong clan, my spirit congealing in the palace of the jade embryo for three thousand seven hundred years. Later, in the era of the Supreme Emperor, I was reborn in the womb of Mother Li, the yin and yang cycles completing their course over eighty-one years. Even now, after eons, I still fear I have not repaid her kindness. How much less can you, ordinary beings, fail to repay your debt? To exhaust all your strength and heart in devotion would still fall short of proper reverence—how much worse to transgress against them! In all the teachings and precepts, this is never left unspoken. Among the thirty-six scriptures, none omits these words. All the sages, past and present, have followed this teaching—how much more should you, who study the Dao, fail to repay your debt? All of you here must resolve deeply: outwardly, honor and serve your parents; inwardly, cultivate great kindness. Even if you ground your bones to dust and melted your flesh, you could not fully repay them. If any being can copy this scripture for their parents, recite and uphold it, burn incense and bow in reverence, and on the Zhongyuan Festival hold a grand offering, prepare fine incense, gather blossoms from the mountains, and arrange pure offerings with diligent devotion, praying for blessings and beseeching grace to deliver their ancestors—this is how to repay the kindness of parents’ nurturing. The sins of the five rebellions and ten evils will be extinguished.\"*",
      "overlap_context": " youth, it indulges in play and pleasure. It combs its hair, seeking fine clothes. The parents select the finest garments for their child, while they themselves wear coarse and worn-out clothes. If they lack clothing, they seek it far and wide, exhausting their efforts north and south, east and west, even selling their hairpins to arrange a marriage for their child.\n\nYet as the child’s affection grows stronger, the mother becomes more distant. In private chambers, they laugh and speak together.\"",
      "start_char": 1227,
      "end_char": 2518,
      "start_sentence": 36,
      "end_sentence": 77,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.37220644950867,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\太上老君说报父母恩重经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "若能每月一日日中，清斋烧香，行道礼拜，诵念转读此经，罪亦消灭，名报父母。 又於此日，当请高上浄德法师，开讲此经，宣通妙义，劝众生等发慈孝心。 如此功德，最上第一，不可思议。 千万功德，不如相劝讲诵报恩。 於其中问闻此经者，忽生孝心，供养父母，福德无量。 上感诸天一切大圣，中感幽冥一切灵识，下流后世远代子孙，皆生孝顺，恭敬不绝。 尔时，大众及海空智藏真人等闻太上说无上恩重报父母经，各怀涕泪，受斯语已，愈感孝诚，刻骨不忘，尊敬殷重，各还本国，稽首奉行。 太上老君说报父母恩重经竟",
      "translated_text": "If on the first day of each month at noon, one observes a pure fast, burns incense, practices the Dao, bows in reverence, and recites this sutra, sins will also be extinguished—this is how to repay one’s parents. Moreover, on this day, one should invite a master of the highest purity and virtue to expound this sutra, elucidate its wondrous meaning, and exhort all beings to awaken hearts of kindness and filial piety. Such merit is supreme and foremost, beyond all conception. Ten thousand merits cannot compare to the act of encouraging others to lecture, recite, and repay their debt of gratitude. Among those who hear this sutra, should even one suddenly awaken a filial heart and serve their parents, their blessings and virtue will be boundless. Above, this moves all the great sages of the heavens; in the middle, it stirs the spirits of the hidden realms; below, it flows to descendants of later generations, who will all be filial and reverent without cease.\n\nAt that time, the great assembly and the Perfected of Vast Empty Wisdom Treasury, having heard the Most High expound the *Sutra on the Weight of Repaying Parents’ Kindness*, were each moved to tears. Having received these words, their filial devotion deepened, engraved in their bones and never forgotten. With profound reverence, they returned to their native lands and respectfully put the teachings into practice.\n\nHere ends the *Sutra on the Weight of Repaying Parents’ Kindness*, spoken by the Most High Lord Lao.",
      "overlap_context": " could not fully repay them. If any being can copy this scripture for their parents, recite and uphold it, burn incense and bow in reverence, and on the Zhongyuan Festival hold a grand offering, prepare fine incense, gather blossoms from the mountains, and arrange pure offerings with diligent devotion, praying for blessings and beseeching grace to deliver their ancestors—this is how to repay the kindness of parents’ nurturing. The sins of the five rebellions and ten evils will be extinguished.\"*",
      "start_char": 2518,
      "end_char": 2757,
      "start_sentence": 78,
      "end_sentence": 85,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.153734683990479,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\太上老君说报父母恩重经.txt",
        "category": "本文类"
      }
    }
  ]
}