{
  "source_id": "太上洞玄灵宝上品戒经",
  "source_file": "chunked_daozang\\太上洞玄灵宝上品戒经.json",
  "total_chunks": 3,
  "total_original_chars": 3011,
  "total_translated_chars": 18508,
  "total_translation_time": 89.44876074790955,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\戒律类\\太上洞玄灵宝上品戒经.txt",
    "category": "戒律类"
  },
  "full_translation": "**The Supreme Precepts of the Cavernous Mystery’s Numinous Treasure (Upper Grade) Sutra**\n\n**Sutra Title:** *The Supreme Precepts of the Cavernous Mystery’s Numinous Treasure (Upper Grade) Sutra*. Author unknown, likely composed during the Northern and Southern Dynasties. Not recorded in extant catalogues of *Numinous Treasure* scriptures. One fascicle. Base text from *The Orthodox Daoist Canon*, Cavernous Mystery Section, Precepts and Disciplines Category.\n\n---\n\nAt that time, during the first year of the Kaihuang era, on the first day of the seventh month at noon, the Heavenly Worthy bestowed upon the Supreme Dao Lord the scripture of the *Upper-Grade Precepts of Wisdom* within the fragrant mulberry grove of the Floating Gauze Realm on Mount Yucha in the Western Jade Land. As the Dao Lord received the precepts, he prostrated himself, turning his heart toward the ten directions and contemplating the Three Worthies.\n\nThen, the hosts of celestial immortals descended from the void—dragon-drawn chariots, tiger-led carriages, phoenix-borne palanquins, and simurgh-borne litters, adorned with kingfisher plumes and feathered fans, emerald mists and radiant clouds, immortal blossoms and jeweled staves—resplendent with luminous brilliance. Cranes cried in unison, celestial music chimed, and auspicious hues filled the sky as they arrived at the ritual arena. Immortal men and jade maidens circled the altar, burning incense, pacing in void-step hymns, bowing in reverence, and gazing in awe.\n\nThe Heavenly Worthy smiled, his countenance radiating light, expounding the precepts to deliver beings. All who heard were freed from misfortune.\n\nThe Heavenly Worthy commanded the assembly of good men, good women, and celestial officials: On the first day of each month, two divine youths shall descend to the human realm to observe their good and evil deeds, recording their merits and transgressions. Those who perform good are inscribed in the celestial ledgers of virtue; those who commit evil are registered in the underworld’s rolls of iniquity. Upon the end of their lives, the virtuous receive blessings, while the wicked suffer calamity.\n\nThus, he exhorted all people: On the first day of the new year, don fresh garments of proper hues, gather at the ritual arena, and inscribe your names upon bamboo and silk to present to the celestial bureaus, that your year’s virtuous deeds may be known. On the first day of each month, attend the precept assemblies at the numinous temples to cultivate affinity and goodness for the month.\n\nAt the place where the precepts are expounded, men and women shall gather in harmony, inscribing their names and quieting their minds to listen. Those who hear the precepts and awaken to the Dao shall realize the patience of non-arising.\n\nThose who enter this Dharma gate should be like jade maidens or golden perfected beings, their bodies attuned to the Dao’s *qi*, their countenances bearing immortal grace. Amidst these wondrous words, they shall uphold true faith in the teachings, vowing to hear the Heavenly Worthy’s precepts as earth deities offer treasures.\n\nThen, a devout celestial maiden and a forbearing immortal, their star-crowned heads gleaming and moon-sashed forms luminous, held offerings and bowed in reverence. They proclaimed the Ten Supreme Vows before the assembly:\n\n1. **First Vow:** To offer one’s flesh to feed hungry birds and beasts.\n2. **Second Vow:** To anoint one’s body with eight measures of fragrant oil to fuel lamps and perpetuate light.\n3. **Third Vow:** To repay kindness with labor, aiding those burdened by toil.\n4. **Fourth Vow:** Upon encountering the destitute and naked, to bestow food and clothing.\n5. **Fifth Vow:** Upon meeting the sick, to provide medicine and broth.\n6. **Sixth Vow:** To fulfill the needs of others in their time of want.\n7. **Seventh Vow:** To bring joy to those in sorrow, easing their suffering.\n8. **Eighth Vow:** To willingly take the place of those condemned to execution or imprisonment.\n9. **Ninth Vow:** To hasten the safe delivery of pregnant women.\n10. **Tenth Vow:** To ensure the swift return of soldiers from frontier campaigns.\n\nHaving uttered these ten vows, they wept tears of sorrow and addressed the Heavenly Worthy: “Disciples’ karmic obstructions run deep. We beseech the wondrous precepts.”\n\nThe Venerable Master, grieving and disconsolate, shed tears as he spoke: “Men and women bear heavy karmic burdens. The sublime Dharma is the great causal condition for liberation. Though I wish to open the gate of universal deliverance, the roots of sentient beings are shallow—what can be done? Alas! To waste a lifetime, sinking into the six paths of rebirth is truly lamentable. For your sake, I expound these precepts. Awaken, turn your hearts, and take refuge in the true Dao. Those with transgressions must repent; those without may listen in silence.”\n\nThe Heavenly Worthy addressed the Supreme Dao Lord: “Now I shall exhort and admonish, awakening the multitudes. For all men and women, I dispel calamities, avert suffering, invoke blessings, deliver lives, and uproot the roots of affliction. The living shall perceive the Dao and escape the eight difficulties; the dead shall attain bliss, avoiding the three wretched destinies. Reborn in the human or celestial realms, they shall enjoy supreme nobility. Those who cultivate fasts and seek the Dao may become Wheel-Turning Sage Kings. All must single-mindedly receive and uphold the Ten Exhortations, heeding them without forgetfulness, contemplating them in their hearts, avoiding distractions, and listening in silence.”\n\n1. **First Exhortation:** Revere the Three Treasures, make offerings to Dharma masters, expound scriptures, nurture life, teach goodness, serve as models for others, and cultivate worthy teachings. Such high talents shall bring honor to their gates and glory to their clans.\n2. **Second Exhortation:** Copy scriptures and encourage their recitation. Through broad study and wondrous praise, one shall hear the luminous Dharma life after life, mastering its meanings and propagating its verses.\n3. **Third Exhortation:** At numinous temples, cultivate blessings and establish fasts. Offer sumptuous delicacies to the worthy and sagely, repaying their nobility. Clothing and sustenance shall come naturally.\n4. **Fourth Exhortation:** Offer fragrant oil to fuel lamps, illuminating all. In this life, one shall enjoy elegance, purity, intelligence, and unparalleled beauty, with a celestial bearing of lofty refinement.\n5. **Fifth Exhortation:** Offer sacred robes and Dharma vestments to revered masters. In this life, one shall abide in grace and freedom, avoiding borderlands to dwell always in the Central Kingdom, with one’s family adorned in crowns and one’s sons and daughters dignified and comely.\n6. **Sixth Exhortation:** Men and women, honor and nurture your parents, respect both kin and strangers, protect the weak, support the strong, love the lowly, and pacify the exalted. In this life, you shall be repaid with worthy nephews and virtuous children.\n7. **Seventh Exhortation:** Aid the sick with food, drink, medicine, and compassionate care. This is the supreme field of blessings, making one a great healer-king, receiving supreme nobility.\n8. **Eighth Exhortation:** Relieve the poor by sharing your own clothing and food, ensuring their warmth and sustenance, prolonging their lives. In this life, your gates shall flourish, and your household shall abound in wealth.\n9. **Ninth Exhortation:** Toward others, harbor no jealousy or envy. Maintain constant mindfulness, avoid creating enemies, and relinquish malice. You shall encounter only joy.\n10. **Tenth Exhortation:** Commission and venerate images of the Heavenly Worthy and sages. Whether averting calamity, facing death, or encountering suffering and disaster, all shall be rescued and protected.\n\nThe Heavenly Worthy declared: These Ten Exhortations and Essential Precepts must be believed and practiced. The karmic conditions of good and evil shall invariably yield their retribution. Those who, dwelling in worldly wealth and nobility, mock the poor and lowly shall receive poverty and lowliness in return. Those who, possessing beauty in this life, ridicule the ugly shall receive ugliness in return. Those who, endowed with intelligence, refuse to teach others shall receive stupidity and delusion in return. Those who, enjoying robust health, mock the sick and afflicted shall receive lingering illness and suffering in return. Those who, disbelieving in the Daoist teachings, ridicule the scriptures shall receive obstinacy and arrogance in return. Those who usurp another’s spouse shall receive widowhood in return. Those who seduce another’s wife shall receive solitary widowhood in return. Those who pledge themselves as husband and wife shall not be reborn together in the human realm. Those who delight in taking lives shall receive premature death and short lifespan in return.\n\nThus, I exhort all people: good deeds bring good retribution, evil deeds bring evil misfortune. These consequences are inexorable, and none can escape or be delivered from them. Each person possesses a single mind containing the six consciousnesses. Whether one performs good or evil, encountering circumstances and conditions, one who attains wisdom and restrains the passions, keeping the true gate unmoved, shall realize the Dao of immortality.\n\nFurthermore, the Six Sensory Precepts are expounded. Those of middling capacity should awaken to them:\n\n1. The eye must not wander broadly, distracted by variegated colors, lest the pupils be lost and vision impaired. By mastering the eye’s radiance, the immortal shall appear in the world.\n2. The ear must not listen indiscriminately, confused by the five tones, lest the spirit be harmed and rightness corrupted. By restraining the ear from wailing and lamentation, and mastering music, the immortal shall appear in the world.\n3. The nose must not indulge in excessive fragrances, nor be assailed by杂气, foul odors, or noxious vapors, lest the spirit be disturbed and the mind agitated. By mastering the nose’s perception of fragrance, the immortal shall appear in the world.\n4. The mouth must not crave rich flavors, fatty meats, or杂类, lest the six bowels be violated and the five viscera—spleen and lungs—harmed. By mastering the tongue’s delight in the Dharma, the immortal shall appear in the world.\n5. Desire must not sway the emotions, nor the body seek contact, lest essence and qi be disturbed. By guarding the mind and preserving oneself, and mastering the solitary root, wisdom shall be established, and the immortal shall appear in the world.\n6. The heart must not be disturbed or confused, nor the mind cling to conditions. By abiding in the inherent emptiness and stillness of the original nature, and firmly maintaining it, one masters the Dharma gate amid all conditions, and the immortal shall appear in the world.\n\nThe Heavenly Worthy said: These six roots are the great afflictions of the body. Though one may be reborn as a man or woman, if the six senses are impure, the scriptures unseen, and the Dharma-sound unheard, one remains unaware, sinking into the gate of transgression. The lifespan is brief, not fulfilling heaven’s mandate, and one lingers long in evil destinies—how pitiable! Therefore, these precepts are expounded to deliver humans and devas. With a sincere and reverent mind, take refuge in the Mysterious Cavern. With emotions serene and spirit tranquil, one’s lifespan shall be prolonged.\n\nThe Perfected of the Great Ultimate received the Six Precepts, attained the six penetrations, and rejoiced exuberantly, singing hymns of praise.\n\nThe Heavenly Worthy declared: All good men and women here present, upon hearing this praise and upholding the precepts without lapse, shall realize the true Dao. If one recites and praises these precepts, after the end of life, one shall not be bound by evil karma and shall have one’s transgressions extinguished.\n\nFurthermore, it is said: When illness arises in a person, it is due to improper self-care, delusive thoughts forming calamities, and clinging to conditions creating sickness. Many fail to awaken. Among the myriad illnesses of delusion, ten are briefly listed. To hear the root of illness, listen with a tranquil mind:\n\n1. Bewitching poisons that kill are one illness.\n2. Harboring hatred and wishing others dead is a second illness.\n3. Lust that corrupts virtue is a third illness.\n4. Dwelling on past grievances is a fourth illness.\n5. Refusing admonition is a fifth illness.\n6. Stubbornness and self-will are a sixth illness.\n7. Teaching others to harm is a seventh illness.\n8. Forcibly seizing others’ property is an eighth illness.\n9. Indulging in self-pity and complaint is a ninth illness.\n10. Using power and coercion is a tenth illness.\n\nFor these ten illnesses, if one wishes to be cured, one must apply the proper remedies, and with faith in the prescription, recovery is certain. A weak constitution and gentle nature are wondrous medicines. Acting with magnanimity and a harmonious heart are wondrous medicines. Drawing near to virtue and distancing oneself from lust are wondrous medicines. Not taking illicit wealth is a wondrous medicine. Rescuing from calamity and aiding the distressed are wondrous medicines. Supporting the elderly and weak are wondrous medicines. Enduring humiliation without resentment is a wondrous medicine. Restraining anger is a wondrous medicine. Avoiding suspicion and estrangement is a wondrous medicine. A tranquil mind and settled intent are wondrous medicines.\n\nThese wondrous medicines correspond to the illnesses. If one does not apply them with sincerity, one shall suddenly face death when the time of karmic retribution arrives. I leave these words for the world:\n\nThe Great Sage of Equanimous Mind\nExpounds these true immortal precepts,\nDesiring all beings\nTo assemble in the Hall of Myriad Blessings.\nThose with blessings, aspiring to be heavenly immortals,\nRecite the Numinous Treasure Precepts.\nOn the first and fifteenth days of the month,\nAscend the lion throne.\nCompose the body and regulate the qi,\nWith harmonious voice recite the wondrous scripture.\nPitying the people of the lower realms,\nWho do not believe in the supreme precepts,\nThey drift in the sea of suffering,\nFar from the blissful heaven of non-arising.\nUpholding this precept scripture,\nOne enters the rank of immortals and sages.\nListen in silence,\nAnd in every moment, arouse the mind for the Dao.\n\n1. When the kalpas draw to an end,\nThe world shall naturally fall into darkness.\n2. Spreading the true Dharma,\nVirtue shall align with heaven and earth.\n3. Following the winds and rains,\nKindly open the gate of sweet dew.\n4. Pitying the dry bones,\nDivine talismans shall restore the departed soul.\n5. Ancestors of former generations\nShall bless descendants with fortune.\n6. Those of evil nature\nShall transform and grow good roots.\n7. Reversing short lifespans,\nOne shall attain longevity and enduring existence.\n8. Transgressions of kalpas past\nShall all be absolved by the sage’s grace.\n9. The marks of liberation\nShall remove obstacles and blemishes.\n10. Gradually accumulating merit,\nOne shall become the Supreme Honored One.\n\nThe Perfected One’s admonition says: Why not cultivate and uphold these precepts? Now is the very time. Every moment is precious; do not waste the passing light. Practice the secret and wondrous, and only those who realize it shall know.\n\nThe Exhortation in Verse says:\nA person’s life is already fading,\nLike a flame in a lamp of hard fat.\n\nThe four great elements are like branches and leaves,\nThe five aggregates resemble flowers and fruit.\nIn the prime of youth, one ought to study diligently—\nHow can one cling to self and ego?\n\nWhen fortune is exhausted, the spirit scatters,\nAnd one sits dazed in hell’s gloom.\nThe exalted sages fear sinking,\nSeeking the Dao to escape this calamity.\n\nAll things on earth, all myriad beings,\nEach relies on the other, each possesses spirit.\nYet in the end, they await the kalpa’s reckoning—\nWhen fortune is spent, heaven and earth collapse.\n\nTraversing the five destinies,\nOne comes and goes through death and rebirth.\nFools who disbelieve the Dharma\nSuffer the pain of sins that ever cling.\n\nIf you wish to escape this affliction,\nTake refuge in the Most High’s scriptures.\nThey expound the sublime precepts—\nReceive them as treasures for the body.\n\nThose who study are ever immersed in toil,\nRegretting they did not cultivate sooner.\nAll must unravel the profound and obscure,\nFor in an instant, old age crushes one.\n\nThus in my tender youth,\nI abandoned the world to urgently seek the Dao.\n\nAfter the Heavenly Worthy proclaimed these precepts,\nAll the great assembly—\nThe deva-kings of all heavens, the hosts of heavenly beings,\nThe kings of all lands, the multitudes of their realms,\nRoyal consorts and maidens, empress dowagers and palace women,\nThe eight divisions of dragon spirits, the sages of the ten directions,\nBrahmā, the Heavenly Emperor, the perfected of the three realms,\nThe sovereign lords of the five directions, the deities of the four quarters—\nSuch countless beings, too many to name,\nUpon hearing the precepts expounded, all realized the true Dao.\n\nThe blind saw objects, the mute spoke,\nThe lame walked, the deaf heard,\nThose afflicted by earth’s ills were all cured,\nHell’s torments ceased, and the ghost realm was forever left behind.\n\nAt that time, five thousand scholars—\nEloquent orators of the heavens, the finest talents of the land,\nAspiring to the highest honors—\nTurned their hearts to reverence the Dao, bowing in homage and taking refuge.\n\nThe Heavenly Worthy, moved by compassion,\nInstantly delivered them all,\nBestowing upon each a jade tablet,\nAnd gifting them golden crowns,\nDharma robes and immortal garments,\nPresented by the devas.\n\nThey roamed free by limpid streams,\nWandering carefree through the azure vault,\nAbsorbing qi and dining on mist,\nRiding dragons and controlling cranes.\n\nThe great assembly rejoiced,\nSinging praises to the pure and empty.\nImmortals soared through the void,\nTheir names inscribed in the secret registers.\nGuided through the clouds,\nThey beheld the gates of heaven.\nAwakened to the Dao, they realized truth,\nDwelling in stillness, ever at peace.\n\nThose who revere this scripture,\nBelieve, receive, and uphold it.\n\nThe *Highest Scripture of the Numinous Treasure’s Upper Grade Precepts* of the Cavernous Mystery concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上洞玄灵宝上品戒经 经名：太上洞玄灵宝上品戒经。 撰人不详，约出於南北朝。 灵宝经目着录未出。 一卷。 底本出处：《正统道藏》洞玄部戒律类。 太上洞玄灵宝上品戒经 尔时天尊以开皇元年七月一日午时，於西那玉国郁察山中浮罗之境香桑林#1，所授太上道君智慧上品大戒法文，于时道君受戒，首体投地，回心十方，思念三尊。 是时诸天仙众腾空而来，龙车虎驾，凤辇鸾舆，翠旄羽扇，碧雾彩云，仙花宝节，赫奕光明，鸣鹤嗈嗈，音乐锵锵，腾空降彩，来诣道场。 仙人玉女，旋绕烧香，步虚赞咏，稽首瞻仰。 天尊微笑，面目放光，说戒度人，闻者消殃。 天尊敕诸善男子、善女人、天上曹官，每月一日，令二童子降於人间，察其善恶，录人是非。 行善者天曹上校其善簿，造恶者地府下注其恶名。 命终之后，善者受福，恶者受殃。 是故劝诸人等，每岁正朝元日，身服方色鲜衣，会其道场，名书竹帛，上奏天曹，以知一年己身行善。 每月一日，於灵宫观所听戒，以知一月结缘修善。 於说戒处，男子女人，和会同坐，心标名号，各自静志，坐下听人，闻戒悟道，证无生忍。 诣此法门者，应是玉女，应是金真，体合道气，相带仙容，於妙言中，正信於教，愿听天尊说戒，地祇献珍。 乃有发心天女，忍辱仙人，星冠耀首，月帔光身，执持供养稽首。 因说十上愿，白众宣陈。 一者愿舍身肉，饲饿禽兽。 二者愿身八脂泽，烧灯续明。 三者愿施力报功，济人负重。 四者见贫穷裸露，愿惠食济衣。 五者值遇病人，愿施汤药。 六者见人所要，愿济时须。 七者忧苦之人，随事令喜。 八者狱囚杀戮，身愿代刑。 九者怀孕妇人，早愿分解。 十者边疆征镇，早得归还。 发此十愿，雨泪悲泣，而白天尊：弟子罪障诚深，愿闻妙戒。 尊师忧悲不乐，垂泪告言：男子女人，障业尤重，出离妙法，大事因缘。 吾当欲开，普度含识，根基识浅，知复奈何，呜呼痛哉，虚度一生，沈沦六道。 吾为听众，说此戒文，觉悟回心，归依正道，有罪者当忏悔，无罪者默然听。 天尊告太上道君曰：今当劝戒，开悟群生，为诸男女解灾却患，请福度命，拔诸苦根。 生者见道，身脱八难，死者得乐，不历三涂。 托报人天，受胜尊贵，修斋求道，转轮圣王。 皆当一心请奉十劝戒，谛受勿忘，思念在心，莫相乱神，默然静听。 第一劝敬三宝，供养法师，讲说经文，养生教善，行为人范，贤教高才，荣贵门闾，光显家族。 第二劝写经书，令人读诵，博闻妙赞，世世听明，言义开通，宣扬章句。 第三劝於灵观，修福建斋，诸味甘膳，供养贤圣，报兹高贵，衣食自然。 第四劝施香油，然灯徧照，见世芳盛，清洁聪明，容眸绝伦，天姿高秀。 第五劝施尊师，仙衣‘法服，令人在世，长雅逍遥，不堕边夷，常生中国，家承冠冕，男女端严。 第六劝诸男女，孝养父母，恭敬亲疏，抚弱接强，爱下安上，见世受报，子侄贤良。 第七劝济病人，饮食汤药，慈悲救疗，最上福田，为大医王，受胜尊贵。 第八劝施贫穷，辍己衣食，令得饱暖，延命安存，见世门荣，多饶家富。 第九劝於他人，莫怀妬嫉，长行系念，莫作冤家，舍去毒心，遇逢欢喜。 第十劝造天尊、圣像供养，或有息难，或为死亡，投苦遇灾，皆当救护。",
      "translated_text": "**The Supreme Precepts of the Cavernous Mystery’s Numinous Treasure (Upper Grade) Sutra**\n\n**Sutra Title:** *The Supreme Precepts of the Cavernous Mystery’s Numinous Treasure (Upper Grade) Sutra*. Author unknown, likely composed during the Northern and Southern Dynasties. Not recorded in extant catalogues of *Numinous Treasure* scriptures. One fascicle. Base text from *The Orthodox Daoist Canon*, Cavernous Mystery Section, Precepts and Disciplines Category.\n\n---\n\nAt that time, during the first year of the Kaihuang era, on the first day of the seventh month at noon, the Heavenly Worthy bestowed upon the Supreme Dao Lord the scripture of the *Upper-Grade Precepts of Wisdom* within the fragrant mulberry grove of the Floating Gauze Realm on Mount Yucha in the Western Jade Land. As the Dao Lord received the precepts, he prostrated himself, turning his heart toward the ten directions and contemplating the Three Worthies.\n\nThen, the hosts of celestial immortals descended from the void—dragon-drawn chariots, tiger-led carriages, phoenix-borne palanquins, and simurgh-borne litters, adorned with kingfisher plumes and feathered fans, emerald mists and radiant clouds, immortal blossoms and jeweled staves—resplendent with luminous brilliance. Cranes cried in unison, celestial music chimed, and auspicious hues filled the sky as they arrived at the ritual arena. Immortal men and jade maidens circled the altar, burning incense, pacing in void-step hymns, bowing in reverence, and gazing in awe.\n\nThe Heavenly Worthy smiled, his countenance radiating light, expounding the precepts to deliver beings. All who heard were freed from misfortune.\n\nThe Heavenly Worthy commanded the assembly of good men, good women, and celestial officials: On the first day of each month, two divine youths shall descend to the human realm to observe their good and evil deeds, recording their merits and transgressions. Those who perform good are inscribed in the celestial ledgers of virtue; those who commit evil are registered in the underworld’s rolls of iniquity. Upon the end of their lives, the virtuous receive blessings, while the wicked suffer calamity.\n\nThus, he exhorted all people: On the first day of the new year, don fresh garments of proper hues, gather at the ritual arena, and inscribe your names upon bamboo and silk to present to the celestial bureaus, that your year’s virtuous deeds may be known. On the first day of each month, attend the precept assemblies at the numinous temples to cultivate affinity and goodness for the month.\n\nAt the place where the precepts are expounded, men and women shall gather in harmony, inscribing their names and quieting their minds to listen. Those who hear the precepts and awaken to the Dao shall realize the patience of non-arising.\n\nThose who enter this Dharma gate should be like jade maidens or golden perfected beings, their bodies attuned to the Dao’s *qi*, their countenances bearing immortal grace. Amidst these wondrous words, they shall uphold true faith in the teachings, vowing to hear the Heavenly Worthy’s precepts as earth deities offer treasures.\n\nThen, a devout celestial maiden and a forbearing immortal, their star-crowned heads gleaming and moon-sashed forms luminous, held offerings and bowed in reverence. They proclaimed the Ten Supreme Vows before the assembly:\n\n1. **First Vow:** To offer one’s flesh to feed hungry birds and beasts.\n2. **Second Vow:** To anoint one’s body with eight measures of fragrant oil to fuel lamps and perpetuate light.\n3. **Third Vow:** To repay kindness with labor, aiding those burdened by toil.\n4. **Fourth Vow:** Upon encountering the destitute and naked, to bestow food and clothing.\n5. **Fifth Vow:** Upon meeting the sick, to provide medicine and broth.\n6. **Sixth Vow:** To fulfill the needs of others in their time of want.\n7. **Seventh Vow:** To bring joy to those in sorrow, easing their suffering.\n8. **Eighth Vow:** To willingly take the place of those condemned to execution or imprisonment.\n9. **Ninth Vow:** To hasten the safe delivery of pregnant women.\n10. **Tenth Vow:** To ensure the swift return of soldiers from frontier campaigns.\n\nHaving uttered these ten vows, they wept tears of sorrow and addressed the Heavenly Worthy: “Disciples’ karmic obstructions run deep. We beseech the wondrous precepts.”\n\nThe Venerable Master, grieving and disconsolate, shed tears as he spoke: “Men and women bear heavy karmic burdens. The sublime Dharma is the great causal condition for liberation. Though I wish to open the gate of universal deliverance, the roots of sentient beings are shallow—what can be done? Alas! To waste a lifetime, sinking into the six paths of rebirth is truly lamentable. For your sake, I expound these precepts. Awaken, turn your hearts, and take refuge in the true Dao. Those with transgressions must repent; those without may listen in silence.”\n\nThe Heavenly Worthy addressed the Supreme Dao Lord: “Now I shall exhort and admonish, awakening the multitudes. For all men and women, I dispel calamities, avert suffering, invoke blessings, deliver lives, and uproot the roots of affliction. The living shall perceive the Dao and escape the eight difficulties; the dead shall attain bliss, avoiding the three wretched destinies. Reborn in the human or celestial realms, they shall enjoy supreme nobility. Those who cultivate fasts and seek the Dao may become Wheel-Turning Sage Kings. All must single-mindedly receive and uphold the Ten Exhortations, heeding them without forgetfulness, contemplating them in their hearts, avoiding distractions, and listening in silence.”\n\n1. **First Exhortation:** Revere the Three Treasures, make offerings to Dharma masters, expound scriptures, nurture life, teach goodness, serve as models for others, and cultivate worthy teachings. Such high talents shall bring honor to their gates and glory to their clans.\n2. **Second Exhortation:** Copy scriptures and encourage their recitation. Through broad study and wondrous praise, one shall hear the luminous Dharma life after life, mastering its meanings and propagating its verses.\n3. **Third Exhortation:** At numinous temples, cultivate blessings and establish fasts. Offer sumptuous delicacies to the worthy and sagely, repaying their nobility. Clothing and sustenance shall come naturally.\n4. **Fourth Exhortation:** Offer fragrant oil to fuel lamps, illuminating all. In this life, one shall enjoy elegance, purity, intelligence, and unparalleled beauty, with a celestial bearing of lofty refinement.\n5. **Fifth Exhortation:** Offer sacred robes and Dharma vestments to revered masters. In this life, one shall abide in grace and freedom, avoiding borderlands to dwell always in the Central Kingdom, with one’s family adorned in crowns and one’s sons and daughters dignified and comely.\n6. **Sixth Exhortation:** Men and women, honor and nurture your parents, respect both kin and strangers, protect the weak, support the strong, love the lowly, and pacify the exalted. In this life, you shall be repaid with worthy nephews and virtuous children.\n7. **Seventh Exhortation:** Aid the sick with food, drink, medicine, and compassionate care. This is the supreme field of blessings, making one a great healer-king, receiving supreme nobility.\n8. **Eighth Exhortation:** Relieve the poor by sharing your own clothing and food, ensuring their warmth and sustenance, prolonging their lives. In this life, your gates shall flourish, and your household shall abound in wealth.\n9. **Ninth Exhortation:** Toward others, harbor no jealousy or envy. Maintain constant mindfulness, avoid creating enemies, and relinquish malice. You shall encounter only joy.\n10. **Tenth Exhortation:** Commission and venerate images of the Heavenly Worthy and sages. Whether averting calamity, facing death, or encountering suffering and disaster, all shall be rescued and protected.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1281,
      "start_sentence": 0,
      "end_sentence": 47,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.50772261619568,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\戒律类\\太上洞玄灵宝上品戒经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "天尊告言：此十劝进要戒，当信奉行，善恶业缘，必当获报。 居世富贵，笑他贫贱者，必贫贱报。 居世美貌，笑他丑陋者，必丑陋报。 居世聪明，不教人者，必愚痴报。 居世康健，笑他病患者，必滞病息报。 居世不信道教，笑於经典者，必顽嚣报。 居世侵夺他夫婿者，必小寡报。 居世诱他妇者，必鳏独报。 居世发心为夫妇者，不同生人道报。 居世好杀生命者，必夭伤短寿报。 是故劝诸人等，行善善报，行恶恶殃，抵敌不通，无拔度者。 人有一心，含藏六识，行善行恶，遇境逢缘，达慧闭情，真门不动，当证仙道。 复说六情戒，上品中人，应当开悟。 一者眼无广瞻，乱诸华色，亡睛失瞳，视物目极，於其眼根，能制光明，仙人出现於世。 二者耳无乱听，混於五音，伤神败正，恶声啼吟於其耳根，能制音乐，仙人出现於世。 三者鼻无广丰#2，勿俱杂气，臭腥氛乱，伤神动意，於其鼻根，能制香积，仙人出现於世。 四者口无贪味，脂熏杂类，六腑犯违，五脏脾肺於其舌根，能制法喜，仙人出现於世。 五者无欲摇情，身不受触，精气乃安，守心自最，於其独根，能制定慧，仙人出现於世。 六者心无变乱，意不攀缘，本性空寂，湛然能坚，於其诸缘，能制法门，仙人出现於世。 天尊言：此六根者，身之大患，来生男女，虽受人形，六情不纯，未见经教，不闻法音，皆不自觉，沈迷罪门，受命短促，不尽天命，长处恶道，甚可哀怜。 故说是戒，开度人天。 善心敬信，归命洞玄，情恬神静，报命长延。 太极真人听受六戒，证得六通，欢喜踊跃，歌咏赞文。 天尊言曰：座下善男善女，闻此赞叹，持戒不阙，当证真道。 若人赞诵此戒，命终之后，不被恶业所拘，当得罪灭。 又曰：人有病起，不善养身，妄想成灾，攀缘作病，多不觉悟，当说是迷百病之中，略举十等，欲闻病本，听者静心。 蛊毒杀人是一病，僧他愿死是二病。 好色坏德是三病，追念旧恶是四病。 不受谏喻是五病，了戾自用是六病。 教人伤人是七病，强夺他物是八病。 好自怨诉是九病，威势迫胁是十病。 此十种病，若愿愈者，当用药治，信方必差。 体弱性柔是妙药，行宽心和是妙药。 近德远色是妙药，不取非财是妙药。 救祸济难是妙药，扶持老弱是妙药。 受辱不怨是妙药，忿怒自制是妙药。 远嫌避疑是妙药，心静意定是妙药。 说此妙药，与病相应，不用心治，俄然受死，迁流时至。 遗语世人，其言曰： 大圣平等心，说是真仙戒。 欲令一切众，同会万福堂。 有福拟天仙，说诵灵宝戒。 日朔月望，请升师子座。 端身调正气，和音说妙经。 哀愍下界人，不信上妙戒。 还漂流苦海，无生妙乐天。 持受是戒经，即入仙圣位。 各各默然听，分分发道心。 一者历数末，自当世界昏。 二者布正法，德合应乾坤。 三者顺风雨，善开甘露门。 四者愍枯骨，神符却返魂。 五者上世祖，福佑下代孙。 六者多恶性，变易生善根。 七者翻短寿，延命得长存。 八者旷劫罪，咸皆奉圣恩。 九者解脱相，除障免疵痕，十者渐积量，得成无上尊。 真人教戒曰：何不修持，今正是时，寸阴可惜，勿弃流光，宜秘密妙，行证者乃知。 劝戒颂曰： 人命已消亡，喻若刚膏中火。",
      "translated_text": "The Heavenly Worthy declared: These Ten Exhortations and Essential Precepts must be believed and practiced. The karmic conditions of good and evil shall invariably yield their retribution. Those who, dwelling in worldly wealth and nobility, mock the poor and lowly shall receive poverty and lowliness in return. Those who, possessing beauty in this life, ridicule the ugly shall receive ugliness in return. Those who, endowed with intelligence, refuse to teach others shall receive stupidity and delusion in return. Those who, enjoying robust health, mock the sick and afflicted shall receive lingering illness and suffering in return. Those who, disbelieving in the Daoist teachings, ridicule the scriptures shall receive obstinacy and arrogance in return. Those who usurp another’s spouse shall receive widowhood in return. Those who seduce another’s wife shall receive solitary widowhood in return. Those who pledge themselves as husband and wife shall not be reborn together in the human realm. Those who delight in taking lives shall receive premature death and short lifespan in return.\n\nThus, I exhort all people: good deeds bring good retribution, evil deeds bring evil misfortune. These consequences are inexorable, and none can escape or be delivered from them. Each person possesses a single mind containing the six consciousnesses. Whether one performs good or evil, encountering circumstances and conditions, one who attains wisdom and restrains the passions, keeping the true gate unmoved, shall realize the Dao of immortality.\n\nFurthermore, the Six Sensory Precepts are expounded. Those of middling capacity should awaken to them:\n\n1. The eye must not wander broadly, distracted by variegated colors, lest the pupils be lost and vision impaired. By mastering the eye’s radiance, the immortal shall appear in the world.\n2. The ear must not listen indiscriminately, confused by the five tones, lest the spirit be harmed and rightness corrupted. By restraining the ear from wailing and lamentation, and mastering music, the immortal shall appear in the world.\n3. The nose must not indulge in excessive fragrances, nor be assailed by杂气, foul odors, or noxious vapors, lest the spirit be disturbed and the mind agitated. By mastering the nose’s perception of fragrance, the immortal shall appear in the world.\n4. The mouth must not crave rich flavors, fatty meats, or杂类, lest the six bowels be violated and the five viscera—spleen and lungs—harmed. By mastering the tongue’s delight in the Dharma, the immortal shall appear in the world.\n5. Desire must not sway the emotions, nor the body seek contact, lest essence and qi be disturbed. By guarding the mind and preserving oneself, and mastering the solitary root, wisdom shall be established, and the immortal shall appear in the world.\n6. The heart must not be disturbed or confused, nor the mind cling to conditions. By abiding in the inherent emptiness and stillness of the original nature, and firmly maintaining it, one masters the Dharma gate amid all conditions, and the immortal shall appear in the world.\n\nThe Heavenly Worthy said: These six roots are the great afflictions of the body. Though one may be reborn as a man or woman, if the six senses are impure, the scriptures unseen, and the Dharma-sound unheard, one remains unaware, sinking into the gate of transgression. The lifespan is brief, not fulfilling heaven’s mandate, and one lingers long in evil destinies—how pitiable! Therefore, these precepts are expounded to deliver humans and devas. With a sincere and reverent mind, take refuge in the Mysterious Cavern. With emotions serene and spirit tranquil, one’s lifespan shall be prolonged.\n\nThe Perfected of the Great Ultimate received the Six Precepts, attained the six penetrations, and rejoiced exuberantly, singing hymns of praise.\n\nThe Heavenly Worthy declared: All good men and women here present, upon hearing this praise and upholding the precepts without lapse, shall realize the true Dao. If one recites and praises these precepts, after the end of life, one shall not be bound by evil karma and shall have one’s transgressions extinguished.\n\nFurthermore, it is said: When illness arises in a person, it is due to improper self-care, delusive thoughts forming calamities, and clinging to conditions creating sickness. Many fail to awaken. Among the myriad illnesses of delusion, ten are briefly listed. To hear the root of illness, listen with a tranquil mind:\n\n1. Bewitching poisons that kill are one illness.\n2. Harboring hatred and wishing others dead is a second illness.\n3. Lust that corrupts virtue is a third illness.\n4. Dwelling on past grievances is a fourth illness.\n5. Refusing admonition is a fifth illness.\n6. Stubbornness and self-will are a sixth illness.\n7. Teaching others to harm is a seventh illness.\n8. Forcibly seizing others’ property is an eighth illness.\n9. Indulging in self-pity and complaint is a ninth illness.\n10. Using power and coercion is a tenth illness.\n\nFor these ten illnesses, if one wishes to be cured, one must apply the proper remedies, and with faith in the prescription, recovery is certain. A weak constitution and gentle nature are wondrous medicines. Acting with magnanimity and a harmonious heart are wondrous medicines. Drawing near to virtue and distancing oneself from lust are wondrous medicines. Not taking illicit wealth is a wondrous medicine. Rescuing from calamity and aiding the distressed are wondrous medicines. Supporting the elderly and weak are wondrous medicines. Enduring humiliation without resentment is a wondrous medicine. Restraining anger is a wondrous medicine. Avoiding suspicion and estrangement is a wondrous medicine. A tranquil mind and settled intent are wondrous medicines.\n\nThese wondrous medicines correspond to the illnesses. If one does not apply them with sincerity, one shall suddenly face death when the time of karmic retribution arrives. I leave these words for the world:\n\nThe Great Sage of Equanimous Mind\nExpounds these true immortal precepts,\nDesiring all beings\nTo assemble in the Hall of Myriad Blessings.\nThose with blessings, aspiring to be heavenly immortals,\nRecite the Numinous Treasure Precepts.\nOn the first and fifteenth days of the month,\nAscend the lion throne.\nCompose the body and regulate the qi,\nWith harmonious voice recite the wondrous scripture.\nPitying the people of the lower realms,\nWho do not believe in the supreme precepts,\nThey drift in the sea of suffering,\nFar from the blissful heaven of non-arising.\nUpholding this precept scripture,\nOne enters the rank of immortals and sages.\nListen in silence,\nAnd in every moment, arouse the mind for the Dao.\n\n1. When the kalpas draw to an end,\nThe world shall naturally fall into darkness.\n2. Spreading the true Dharma,\nVirtue shall align with heaven and earth.\n3. Following the winds and rains,\nKindly open the gate of sweet dew.\n4. Pitying the dry bones,\nDivine talismans shall restore the departed soul.\n5. Ancestors of former generations\nShall bless descendants with fortune.\n6. Those of evil nature\nShall transform and grow good roots.\n7. Reversing short lifespans,\nOne shall attain longevity and enduring existence.\n8. Transgressions of kalpas past\nShall all be absolved by the sage’s grace.\n9. The marks of liberation\nShall remove obstacles and blemishes.\n10. Gradually accumulating merit,\nOne shall become the Supreme Honored One.\n\nThe Perfected One’s admonition says: Why not cultivate and uphold these precepts? Now is the very time. Every moment is precious; do not waste the passing light. Practice the secret and wondrous, and only those who realize it shall know.\n\nThe Exhortation in Verse says:\nA person’s life is already fading,\nLike a flame in a lamp of hard fat.",
      "overlap_context": "nance, prolonging their lives. In this life, your gates shall flourish, and your household shall abound in wealth.\n9. **Ninth Exhortation:** Toward others, harbor no jealousy or envy. Maintain constant mindfulness, avoid creating enemies, and relinquish malice. You shall encounter only joy.\n10. **Tenth Exhortation:** Commission and venerate images of the Heavenly Worthy and sages. Whether averting calamity, facing death, or encountering suffering and disaster, all shall be rescued and protected.",
      "start_char": 1282,
      "end_char": 2556,
      "start_sentence": 48,
      "end_sentence": 107,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.96461033821106,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\戒律类\\太上洞玄灵宝上品戒经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "四大如枝叶，五蕴似花果，盛年当勤学，岂得存吾我。 福尽神识散，宜朦地狱坐。 上圣畏沉沦，寻道度斯祸，大地及万物，倚伏各有灵。 终使待劫数，福尽天地倾。 往返於五道，去来更死生。 愚夫不信法，罪痛常自婴。 若欲度斯患，归命太上经。 演说上妙戒，受之为身宝。 就学恒苦耽，治身恨不早。 皆当披幽赜，倏忽摧人老。 吾故及弱龄，弃世急学道。 天尊说是戒己，一切大会诸天天王、诸天天众、诸国国王、诸国国众，王妃彩女，太后宫人，八部龙神、十方众圣、梵王天帝、三界众真，五方帝君、四维神主，如是众等。 不可具名，闻说戒经，皆证真道。 盲者见物，痖者能言，跛者能行，聋者得听，大地患者，皆悉瘳除，地狱停酸，永离鬼道。 时有五千学士，文藻谈天，擢国良贤，欲求冠冕，回心敬道，稽首归依。 天尊慈悲，登时沷度，各授玉简，普赐金冠，法服仙衣，诸天捧施，清溪放旷，碧落逍遥，服气餐霞，乘龙控鹤。 大众欢喜，歌赞清虚，空里飞仙，标名秘箓，云中引接，指视天门，悟道证真，静居常乐，敬经之者，信受奉行。 太上洞玄灵宝上品戒经竟 #1 香桑林：当作「长桑林」。 #2 广丰：当作「广嗅」。",
      "translated_text": "The four great elements are like branches and leaves,\nThe five aggregates resemble flowers and fruit.\nIn the prime of youth, one ought to study diligently—\nHow can one cling to self and ego?\n\nWhen fortune is exhausted, the spirit scatters,\nAnd one sits dazed in hell’s gloom.\nThe exalted sages fear sinking,\nSeeking the Dao to escape this calamity.\n\nAll things on earth, all myriad beings,\nEach relies on the other, each possesses spirit.\nYet in the end, they await the kalpa’s reckoning—\nWhen fortune is spent, heaven and earth collapse.\n\nTraversing the five destinies,\nOne comes and goes through death and rebirth.\nFools who disbelieve the Dharma\nSuffer the pain of sins that ever cling.\n\nIf you wish to escape this affliction,\nTake refuge in the Most High’s scriptures.\nThey expound the sublime precepts—\nReceive them as treasures for the body.\n\nThose who study are ever immersed in toil,\nRegretting they did not cultivate sooner.\nAll must unravel the profound and obscure,\nFor in an instant, old age crushes one.\n\nThus in my tender youth,\nI abandoned the world to urgently seek the Dao.\n\nAfter the Heavenly Worthy proclaimed these precepts,\nAll the great assembly—\nThe deva-kings of all heavens, the hosts of heavenly beings,\nThe kings of all lands, the multitudes of their realms,\nRoyal consorts and maidens, empress dowagers and palace women,\nThe eight divisions of dragon spirits, the sages of the ten directions,\nBrahmā, the Heavenly Emperor, the perfected of the three realms,\nThe sovereign lords of the five directions, the deities of the four quarters—\nSuch countless beings, too many to name,\nUpon hearing the precepts expounded, all realized the true Dao.\n\nThe blind saw objects, the mute spoke,\nThe lame walked, the deaf heard,\nThose afflicted by earth’s ills were all cured,\nHell’s torments ceased, and the ghost realm was forever left behind.\n\nAt that time, five thousand scholars—\nEloquent orators of the heavens, the finest talents of the land,\nAspiring to the highest honors—\nTurned their hearts to reverence the Dao, bowing in homage and taking refuge.\n\nThe Heavenly Worthy, moved by compassion,\nInstantly delivered them all,\nBestowing upon each a jade tablet,\nAnd gifting them golden crowns,\nDharma robes and immortal garments,\nPresented by the devas.\n\nThey roamed free by limpid streams,\nWandering carefree through the azure vault,\nAbsorbing qi and dining on mist,\nRiding dragons and controlling cranes.\n\nThe great assembly rejoiced,\nSinging praises to the pure and empty.\nImmortals soared through the void,\nTheir names inscribed in the secret registers.\nGuided through the clouds,\nThey beheld the gates of heaven.\nAwakened to the Dao, they realized truth,\nDwelling in stillness, ever at peace.\n\nThose who revere this scripture,\nBelieve, receive, and uphold it.\n\nThe *Highest Scripture of the Numinous Treasure’s Upper Grade Precepts* of the Cavernous Mystery concludes.",
      "overlap_context": "the sage’s grace.\n9. The marks of liberation\nShall remove obstacles and blemishes.\n10. Gradually accumulating merit,\nOne shall become the Supreme Honored One.\n\nThe Perfected One’s admonition says: Why not cultivate and uphold these precepts? Now is the very time. Every moment is precious; do not waste the passing light. Practice the secret and wondrous, and only those who realize it shall know.\n\nThe Exhortation in Verse says:\nA person’s life is already fading,\nLike a flame in a lamp of hard fat.",
      "start_char": 2556,
      "end_char": 3029,
      "start_sentence": 108,
      "end_sentence": 127,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.976427793502808,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\戒律类\\太上洞玄灵宝上品戒经.txt",
        "category": "戒律类"
      }
    }
  ]
}