{
  "source_id": "太上说青玄雷令法行因地妙经",
  "source_file": "chunked_daozang\\太上说青玄雷令法行因地妙经.json",
  "total_chunks": 3,
  "total_original_chars": 1617,
  "total_translated_chars": 10772,
  "total_translation_time": 55.25344228744507,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\太上说青玄雷令法行因地妙经.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "The *Most High’s Scripture on the Wondrous Practices of the Azure Mystery Thunder Decrees in the Realm of Causes*\n\n**Scripture Title:** *The Most High’s Scripture on the Wondrous Practices of the Azure Mystery Thunder Decrees in the Realm of Causes*\n**Author:** Unknown\n**Source Text:** *Zhengtong Daoist Canon*, Orthodox Section, Part One\n\n---\n\n*The Most High’s Scripture on the Wondrous Practices of the Azure Mystery Thunder Decrees in the Realm of Causes*\n\nWe invoke the Azure Mystery Earth-Thunder Decrees,\nThe eternal life-bestowing true qi of bing and ding.\nWith a stilled heart, we turn in reverence—suddenly they arrive,\nCrimson-haired and azure-faced, manifesting majestic power.\nClad in golden armor and fiery robes, gleaming like the sun,\nThey appear in true form at every prayer and supplication.\nThe soaring Numinous General, styled Illustrious Martial,\nGrasps the winds and thunders, commanding all legions.\nAiding the Dao, saving the people, fostering goodness and benefit,\nThey act on Heaven’s behalf, enacting great compassion.\nGathering blessings, dispelling calamities, driving away pestilence,\nExpelling evil, aiding the upright, sweeping away demonic miasma.\nTheir wondrous merits and fruits of victory are boundless—\nWe bow our heads in homage, offering sincere devotion.\n\nAt that time, during the first year of the Tianbao era, on the fifteenth day of the third month, the Most High Lord Lao ascended the Nine Qi Cloud-Flower Throne within the Supreme Clarity Palace, high in the realm of Great Clarity. Thereupon, the great Celestial Emperors of the Ten Poles, the perfected beings of the utmost truth, the myriads of stellar constellations, and an innumerable host—robed in misty rosy clouds, their banners and standards fluttering—rode upon whirlwinds and flying wheels, their auspicious radiance illuminating the ten directions. Phoenixes cried and simurghs sang, celestial music harmonized, and all floated through the void to heed the Most High’s proclamation of the wondrous Dao.\n\nThe assembly rejoiced, turning their heads in reverent awe.\n\nAt that moment, among the gathering was a perfected one named Wondrous Practice, whose merits transcended the Three Realms and whose deeds filled the heavens. Stepping forth from the ranks, he held a tablet and offered obeisance, kneeling to speak:\n\n“Your servant observes that in the lower realms, within the geng and xin territories of the Shu region, disasters and misfortunes arise in succession, pestilence spreads unchecked, plants and trees wither together, and the people dwindle and suffer. Thus, with all sentient beings, we remain burdened by sorrow, wishing to rely upon your compassionate light to broadly extend salvation and deliverance.”\n\nLord Lao addressed Perfected Wondrous Practice, saying: “Excellent, excellent. Return to your place, for I shall now expound. It is because the qi of Metal Heaven has reached its destined extremity that yin and yang have fallen into discord, mountains and rivers become stagnant and knotted, the land grows obstructed, calamities and pestilence overflow, and all beings endure affliction. I shall divide my radiance and issue decrees to purify below.”\n\nThe great assembly rejoiced without end, offering praise and admiration.\n\nThe Heavenly Master beneath the dais, leading his divine assembly known as the Governors of the Five Peaks and Watercourses, knelt and addressed the Dharma Lord: “Your compassionate power need not be exerted. Your servant oversees the earth deities within the Five Peaks, and I have commanded Marshal Wen to act as Heaven’s agent, aiding the Dharma to save the people, commanding the thunder troops, and thereby dispelling those calamities.”\n\nPerfected Wondrous Practice then arose and inquired of the Heavenly Master: “I wonder—from what origin does this general arise? Through what practices cultivated in former lives does he now wield command over military strategy and possess the power to shatter disasters and misfortunes?”\n\nThe Heavenly Master replied: “This general is the essence of bing and ding, the spirit of the Fire Emperor. In the first year of *Yanping* during the Han dynasty, on the third day of the third month, he transformed and descended into the household of a great scholar in Pingyang. His holy mother, while napping at midday, dreamed of swallowing sunlight and awoke pregnant. She carried the child for thirteen months, and in the first year of *Yongchu*, the *dingwei* year, on the third day of the third month at the hour of noon, he was born in her chamber. His appearance was majestic, his spirit clear, his frame imbued with the bone structure of an immortal. Upon his left flank were twenty-four celestial talismans, and upon his hands, the characters *bing* and *ding* faintly inscribed. From birth, he was wondrously gifted; as he grew, his intelligence shone. He never violated his celestial purity, maintaining focused contemplation from beginning to end. With a sincere heart, he revered the Dao, accumulating virtuous deeds to save others. His sublime causes and wondrous fruits perfectly harmonized, and thus the Three Officials commended him, the Five Thunders examined his merits, and he was memorialized before the Supreme Emperor. In the sixth year of *Yongjian*, the *xinhai* year, on the *shangding* day of the third month at the hour of noon, he received the Jade Emperor’s decree. Golden-armored divine messengers in embroidered robes delivered the celestial military tally, bestowing upon him a golden ring and jade warrant, along with cloud-script celestial writings. He was appointed to command the armies of the Peak Palace, becoming chief among the myriad spirits of the Five Peaks. His comings and goings in audience were unrestricted by the gates of Heaven. Having received his commission, he was to eternally guard the court of the peaks. A living likeness was installed to the left of the palace hall, and the next day, he manifested transformation and departed.\n\nThis divine being, commanding troops to aid the Dharma, suppresses and exterminates demonic sorcerers, subdues demons and slays monsters, delivers the dying and rescues the living, drives away plagues and sweeps away pestilence. In countless acts of goodness, he broadly benefits the multitudes. His merits in the world are beyond reckoning.”\n\nPerfected Wondrous Practice, upon hearing this account, leapt with joy and offered praise. At that moment, the Perfected One made a request.\n\nLord Lao addressed the Heavenly Master again: “You should swiftly dispatch this general for me to purify this region.” Thereupon, the Heavenly Master knelt and took his leave.\n\nThe Most High sent an emissary bearing a talisman to summon the Earth Deity Marshal Wen. Appearing in a form nine feet tall, with red hair and a green face, golden eyes and fanged teeth, his mouth like a brazier of fire, he wore a purple kerchief knotted at the front, a floral robe girded with a sash, and black boots with upturned toes. In his hand, he wielded a divine-edge sword, and astride a black steed swift as the wind, he led the celestial armies, thunder troops, and peak soldiers. Banners clustered around him as he was escorted forward. He paid reverent homage to the compassionate countenance and attentively listened to the proclamation.\n\nThe Most High issued his decree, and the Marshal received his command and departed. Displaying his divine might, he issued orders to his left and right and proceeded directly to western Shu. Within ten days, he pacified the pestilence, eradicated heterodox sects, and brought peace to the land. From yellow-haired children to white-haired elders, from women to maidens, from the young to the old, from near to far, all within the region were able to live in peace and pursue their livelihoods.\n\nThereupon, the Marshal arrayed his *gang* and stood upon the *dui* position. Pointing toward the *zhen* palace, he intoned an incantation, stirring it into being:\n\n“Spirit of the *li* palace,\nEssence of the Fire virtue.\nTrue *qi* of *bing* and *ding*,\nResplendent yang spirit.\nManifesting form on Eastern Peak,\nCommanding the Emperor’s troops.\nDriving thunder and wielding lightning,\nRolling back mist and piercing clouds.\nRelieving the people’s suffering,\nSlaying demons and destroying spirits.\nTemporal disasters swept away,\nAuspicious blessings converge.\nThe hundred spirits tremble in submission,\nThe myriad gods all revere.\nAt summons, he responds;\nAt call, he appears.\nCity gods and earth deities,\nEternally preserve purity and peace.\nI uphold the decree,\nWind and fire never cease.”\n\nWhen the Marshal had finished reciting this incantation, he withdrew his troops and led his generals to express gratitude to the Heavenly Master. Having received the command and relied upon the compassionate Dharma power, he had swept away the plague of Shu, leaving all purified. He secretly transmitted the sacred command, the talismanic seal of the Five Peaks, to the world, naming it: *Azure Mystery Earth Thunder*. He vowed to protect and assist the Dharma-enforcing Perfected Ones, to cure illnesses, drive away pestilence, eradicate evil, and guide all toward rectitude.\n\nTaking his leave, he departed. Thereupon, the Heavenly Master offered praise and ascended to audience with Lord Lao, recounting these meritorious deeds that would flow through the world, universally aiding all beings.\n\nWherever this scripture resides, divine spirits shall gather to protect it, and calamities shall not arise. The superior practitioner who upholds and practices it may propagate the true teaching, invigorate the authentic Daoist wind, ensure the peace of the state and the well-being of the people. Should pestilence, epidemics, or unrelenting drought and flood occur; should birds and rodents bear omens, or serpents and insects spread misfortune—those who take refuge in this scripture shall find all disasters and misfortunes forever dispelled, all perils silently dissolved.\n\nShould one encounter the peril of war or childbirth, the calamities of fire and flood, or the ravages of bandits and thieves; should demonic forces assail or malevolent sorcery afflict—if, with sincerity, one burns incense, chants, and recites this scripture, devoutly praying for its aid, the divine might shall descend without delay. Doors shall flourish, households prosper, and the people dwell in peace.\n\nThose who reverently prostrate before this scripture shall accrue boundless, inconceivable merit.\n\nWhen the Heavenly Worthy had finished expounding this scripture, the assembled immortals of the heavens extolled and praised it with joy, receiving and upholding its teachings with faith.\n\nThus concludes *The Wondrous Scripture on the Origin of the Azure Mystery Thunder Rites*, as spoken by the Most High.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上说青玄雷令法行因地妙经 经名：太上说青玄雷令法行因地妙经。 撰人不详。 底本出处：《正统道藏》正一部。 太上说青玄雷令法行因地妙经 仰启青玄地雷令，长生正气丙丁神。 冥心皈向欻然至，赤发青面显威灵。 金甲火袍晃耀日，应祈随祷现真形。 翉灵将军号昭武，掌握风雷统领兵。 助法救民兴善利，代天行化大慈悲。 集福消灾驱疫疠，徐邪辅正扫妖氛。 胜功妙果赞无穷，稽首皈依诚奉礼。 尔时，太上老君於天宝元年－三月十五日，在太清境上太清官中，升九炁云华之座。 於是，诸大天帝十极至真，森罗星宿，无鞅数众，缥缈霞霄，飘飖旌节，乘飙飞轮，祥光辉耀，洞焕十方，鸾啸凤鸣，仙乐和音，浮空而至，咸听太上宣扬妙道。 大众欣然，移首皈仰。 是时，会中有一真人，名曰妙行，功超三界，行满诸天，越班而出，执简奉礼，长跪而言：臣观下方，庚辛内地，蜀境之中，灾迍并起，疫疠流行，草木交荒，人民雕耗。 是故与诸众生怀忧未已，欲仗慈光，广垂济度。 老君告妙行真人曰：善哉，善哉。 汝当复位，吾为宣说。 盖因金天之炁，值此数极，致有阴阳乖错，山川郁结，土地闭塞，灾疠横流，民物受殃。 吾与分光，下令清净。 大众咸悦，赞叹未已。",
      "translated_text": "The *Most High’s Scripture on the Wondrous Practices of the Azure Mystery Thunder Decrees in the Realm of Causes*\n\n**Scripture Title:** *The Most High’s Scripture on the Wondrous Practices of the Azure Mystery Thunder Decrees in the Realm of Causes*\n**Author:** Unknown\n**Source Text:** *Zhengtong Daoist Canon*, Orthodox Section, Part One\n\n---\n\n*The Most High’s Scripture on the Wondrous Practices of the Azure Mystery Thunder Decrees in the Realm of Causes*\n\nWe invoke the Azure Mystery Earth-Thunder Decrees,\nThe eternal life-bestowing true qi of bing and ding.\nWith a stilled heart, we turn in reverence—suddenly they arrive,\nCrimson-haired and azure-faced, manifesting majestic power.\nClad in golden armor and fiery robes, gleaming like the sun,\nThey appear in true form at every prayer and supplication.\nThe soaring Numinous General, styled Illustrious Martial,\nGrasps the winds and thunders, commanding all legions.\nAiding the Dao, saving the people, fostering goodness and benefit,\nThey act on Heaven’s behalf, enacting great compassion.\nGathering blessings, dispelling calamities, driving away pestilence,\nExpelling evil, aiding the upright, sweeping away demonic miasma.\nTheir wondrous merits and fruits of victory are boundless—\nWe bow our heads in homage, offering sincere devotion.\n\nAt that time, during the first year of the Tianbao era, on the fifteenth day of the third month, the Most High Lord Lao ascended the Nine Qi Cloud-Flower Throne within the Supreme Clarity Palace, high in the realm of Great Clarity. Thereupon, the great Celestial Emperors of the Ten Poles, the perfected beings of the utmost truth, the myriads of stellar constellations, and an innumerable host—robed in misty rosy clouds, their banners and standards fluttering—rode upon whirlwinds and flying wheels, their auspicious radiance illuminating the ten directions. Phoenixes cried and simurghs sang, celestial music harmonized, and all floated through the void to heed the Most High’s proclamation of the wondrous Dao.\n\nThe assembly rejoiced, turning their heads in reverent awe.\n\nAt that moment, among the gathering was a perfected one named Wondrous Practice, whose merits transcended the Three Realms and whose deeds filled the heavens. Stepping forth from the ranks, he held a tablet and offered obeisance, kneeling to speak:\n\n“Your servant observes that in the lower realms, within the geng and xin territories of the Shu region, disasters and misfortunes arise in succession, pestilence spreads unchecked, plants and trees wither together, and the people dwindle and suffer. Thus, with all sentient beings, we remain burdened by sorrow, wishing to rely upon your compassionate light to broadly extend salvation and deliverance.”\n\nLord Lao addressed Perfected Wondrous Practice, saying: “Excellent, excellent. Return to your place, for I shall now expound. It is because the qi of Metal Heaven has reached its destined extremity that yin and yang have fallen into discord, mountains and rivers become stagnant and knotted, the land grows obstructed, calamities and pestilence overflow, and all beings endure affliction. I shall divide my radiance and issue decrees to purify below.”\n\nThe great assembly rejoiced without end, offering praise and admiration.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 506,
      "start_sentence": 0,
      "end_sentence": 21,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.455393314361572,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上说青玄雷令法行因地妙经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "座下天师所部神人，号岳渎令长，跪上白：法主不劳慈力，臣治五岳内之泰岱地祇，主令温元帅，代天行化，助法救民，统御雷兵，可弭彼难。 其妙行真人出，白天师曰：不审此将生何？ 因地修何法，行掌握兵机，能摧灾厄。 天师告曰：此将乃丙丁之精，火帝之神，於汉延平元年三月三日，化身降于平阳大儒之家。 其。 圣母昼寝，梦吞日光，觉而有娠，怀胎一十三月，於永初元年丁未之岁三月三日午时，诞于其室，貌伟神清，仙丰道骨，左胁天符二十四道，两手隐隐丙丁二字，生而灵异，长而聪明，不破天真，存思终始，直心崇道，积行救人，胜缘妙果，克谐圆满，是以三官保举，五雷考功，奏于上帝。 至永建六年岁次辛未上丁之辰午时奉玉帝勑，差金甲神人绣衣使者，捧领昊天兵符，给赐金环玉券。 云简天书，诏充岳府统兵之职，五岳万神之首。 出入朝奏，无拘天门。 受勑领职，永镇岳庭。 立生容於殿左，翌日立化于彼。 其神应化，统兵助法，禁剿妖巫，诚魔斩怪，度死济生，驱瘟荡疫，种种为善，广益兆民。 其功於世，不可思议。 妙行真人得闻是说，踊跃称叹。 是时，真人启请。 老君重告天师：汝宜为吾速遣此将，澄清斯境。 於是，天师跪辞。 太上遣使持符，召至地祇温主令，显现身长九尺，赤发青面，金睛獠牙，口若火盆，紫巾前结，花袍束带，是蹑吊墩皂靴，手仗神锋宝剑，跨追风黑骏，统领昊天兵马雷兵岳卒，旌旗簇拥，导引而来，敬礼慈容，谛听宣奉。 太上教勑，领命而行，大逞神威，号令左右，径诣西蜀。 旬日之内，平夷疫疠，剪伐邪宗。 黄童白叟，妇人女子，自小及大，由迩至远，一境之内，咸得安业。 於是，其神乃布罡，立于兑位上，指震宫，而激作咒曰： 离宫之灵，火德之精。 丙丁正炁，赫赫阳神。 存形东岳，统御帝兵。 驱雷掣电，卷雾冲云。 救民疾苦，斩邪灭精。 时灾荡尽，景福骈臻。 百灵振伏，万神咸钦。 有召即应，闻召现形。 城隍社令，永保清宁。 吾奉勑命，风火不停。 是时，元帅说是咒毕，收兵率将回谢天师，昨奉教命，仗慈法力，扫荡蜀瘟，悉皆清净，秘传号令灵符五岳总印于世，名曰：青玄地雷，誓愿翊卫执法真士，治病驱瘟，剪邪皈正。 奉辞而退。 於是，天师称赞，上朝老君，言是功德，流传於世，普济群生。",
      "translated_text": "The Heavenly Master beneath the dais, leading his divine assembly known as the Governors of the Five Peaks and Watercourses, knelt and addressed the Dharma Lord: “Your compassionate power need not be exerted. Your servant oversees the earth deities within the Five Peaks, and I have commanded Marshal Wen to act as Heaven’s agent, aiding the Dharma to save the people, commanding the thunder troops, and thereby dispelling those calamities.”\n\nPerfected Wondrous Practice then arose and inquired of the Heavenly Master: “I wonder—from what origin does this general arise? Through what practices cultivated in former lives does he now wield command over military strategy and possess the power to shatter disasters and misfortunes?”\n\nThe Heavenly Master replied: “This general is the essence of bing and ding, the spirit of the Fire Emperor. In the first year of *Yanping* during the Han dynasty, on the third day of the third month, he transformed and descended into the household of a great scholar in Pingyang. His holy mother, while napping at midday, dreamed of swallowing sunlight and awoke pregnant. She carried the child for thirteen months, and in the first year of *Yongchu*, the *dingwei* year, on the third day of the third month at the hour of noon, he was born in her chamber. His appearance was majestic, his spirit clear, his frame imbued with the bone structure of an immortal. Upon his left flank were twenty-four celestial talismans, and upon his hands, the characters *bing* and *ding* faintly inscribed. From birth, he was wondrously gifted; as he grew, his intelligence shone. He never violated his celestial purity, maintaining focused contemplation from beginning to end. With a sincere heart, he revered the Dao, accumulating virtuous deeds to save others. His sublime causes and wondrous fruits perfectly harmonized, and thus the Three Officials commended him, the Five Thunders examined his merits, and he was memorialized before the Supreme Emperor. In the sixth year of *Yongjian*, the *xinhai* year, on the *shangding* day of the third month at the hour of noon, he received the Jade Emperor’s decree. Golden-armored divine messengers in embroidered robes delivered the celestial military tally, bestowing upon him a golden ring and jade warrant, along with cloud-script celestial writings. He was appointed to command the armies of the Peak Palace, becoming chief among the myriad spirits of the Five Peaks. His comings and goings in audience were unrestricted by the gates of Heaven. Having received his commission, he was to eternally guard the court of the peaks. A living likeness was installed to the left of the palace hall, and the next day, he manifested transformation and departed.\n\nThis divine being, commanding troops to aid the Dharma, suppresses and exterminates demonic sorcerers, subdues demons and slays monsters, delivers the dying and rescues the living, drives away plagues and sweeps away pestilence. In countless acts of goodness, he broadly benefits the multitudes. His merits in the world are beyond reckoning.”\n\nPerfected Wondrous Practice, upon hearing this account, leapt with joy and offered praise. At that moment, the Perfected One made a request.\n\nLord Lao addressed the Heavenly Master again: “You should swiftly dispatch this general for me to purify this region.” Thereupon, the Heavenly Master knelt and took his leave.\n\nThe Most High sent an emissary bearing a talisman to summon the Earth Deity Marshal Wen. Appearing in a form nine feet tall, with red hair and a green face, golden eyes and fanged teeth, his mouth like a brazier of fire, he wore a purple kerchief knotted at the front, a floral robe girded with a sash, and black boots with upturned toes. In his hand, he wielded a divine-edge sword, and astride a black steed swift as the wind, he led the celestial armies, thunder troops, and peak soldiers. Banners clustered around him as he was escorted forward. He paid reverent homage to the compassionate countenance and attentively listened to the proclamation.\n\nThe Most High issued his decree, and the Marshal received his command and departed. Displaying his divine might, he issued orders to his left and right and proceeded directly to western Shu. Within ten days, he pacified the pestilence, eradicated heterodox sects, and brought peace to the land. From yellow-haired children to white-haired elders, from women to maidens, from the young to the old, from near to far, all within the region were able to live in peace and pursue their livelihoods.\n\nThereupon, the Marshal arrayed his *gang* and stood upon the *dui* position. Pointing toward the *zhen* palace, he intoned an incantation, stirring it into being:\n\n“Spirit of the *li* palace,\nEssence of the Fire virtue.\nTrue *qi* of *bing* and *ding*,\nResplendent yang spirit.\nManifesting form on Eastern Peak,\nCommanding the Emperor’s troops.\nDriving thunder and wielding lightning,\nRolling back mist and piercing clouds.\nRelieving the people’s suffering,\nSlaying demons and destroying spirits.\nTemporal disasters swept away,\nAuspicious blessings converge.\nThe hundred spirits tremble in submission,\nThe myriad gods all revere.\nAt summons, he responds;\nAt call, he appears.\nCity gods and earth deities,\nEternally preserve purity and peace.\nI uphold the decree,\nWind and fire never cease.”\n\nWhen the Marshal had finished reciting this incantation, he withdrew his troops and led his generals to express gratitude to the Heavenly Master. Having received the command and relied upon the compassionate Dharma power, he had swept away the plague of Shu, leaving all purified. He secretly transmitted the sacred command, the talismanic seal of the Five Peaks, to the world, naming it: *Azure Mystery Earth Thunder*. He vowed to protect and assist the Dharma-enforcing Perfected Ones, to cure illnesses, drive away pestilence, eradicate evil, and guide all toward rectitude.\n\nTaking his leave, he departed. Thereupon, the Heavenly Master offered praise and ascended to audience with Lord Lao, recounting these meritorious deeds that would flow through the world, universally aiding all beings.",
      "overlap_context": "ted Wondrous Practice, saying: “Excellent, excellent. Return to your place, for I shall now expound. It is because the qi of Metal Heaven has reached its destined extremity that yin and yang have fallen into discord, mountains and rivers become stagnant and knotted, the land grows obstructed, calamities and pestilence overflow, and all beings endure affliction. I shall divide my radiance and issue decrees to purify below.”\n\nThe great assembly rejoiced without end, offering praise and admiration.",
      "start_char": 506,
      "end_char": 1389,
      "start_sentence": 22,
      "end_sentence": 56,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.202975034713745,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上说青玄雷令法行因地妙经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "此经在处，当令神明拥护，祸乱不萌。 上士遵而行之，可以宣扬正教，益振真风，社稷清宁，人民道泰。 或遇瘟疸、疾疫、旱涝相仍，鸟鼠送妖，蛇虫嫁孽，皈命斯经，咸得灾衰永释，祸难潜消。 或遇刀兵、生产之厄，或遭水火、盗寇之灾，或魔鬼侵凌，或邪巫魇，祷若能焚香讽诵，志心祈祷此经，即得神威。 应时下降，自然门户兴隆，生民安泰。 若能稽颡此经，功德不可思议。 天尊说是经毕，诸天仙众称扬赞叹，皆大欢喜，信受奉行。 太上说青玄雷令法行因地妙经竟",
      "translated_text": "Wherever this scripture resides, divine spirits shall gather to protect it, and calamities shall not arise. The superior practitioner who upholds and practices it may propagate the true teaching, invigorate the authentic Daoist wind, ensure the peace of the state and the well-being of the people. Should pestilence, epidemics, or unrelenting drought and flood occur; should birds and rodents bear omens, or serpents and insects spread misfortune—those who take refuge in this scripture shall find all disasters and misfortunes forever dispelled, all perils silently dissolved.\n\nShould one encounter the peril of war or childbirth, the calamities of fire and flood, or the ravages of bandits and thieves; should demonic forces assail or malevolent sorcery afflict—if, with sincerity, one burns incense, chants, and recites this scripture, devoutly praying for its aid, the divine might shall descend without delay. Doors shall flourish, households prosper, and the people dwell in peace.\n\nThose who reverently prostrate before this scripture shall accrue boundless, inconceivable merit.\n\nWhen the Heavenly Worthy had finished expounding this scripture, the assembled immortals of the heavens extolled and praised it with joy, receiving and upholding its teachings with faith.\n\nThus concludes *The Wondrous Scripture on the Origin of the Azure Mystery Thunder Rites*, as spoken by the Most High.",
      "overlap_context": "nsmitted the sacred command, the talismanic seal of the Five Peaks, to the world, naming it: *Azure Mystery Earth Thunder*. He vowed to protect and assist the Dharma-enforcing Perfected Ones, to cure illnesses, drive away pestilence, eradicate evil, and guide all toward rectitude.\n\nTaking his leave, he departed. Thereupon, the Heavenly Master offered praise and ascended to audience with Lord Lao, recounting these meritorious deeds that would flow through the world, universally aiding all beings.",
      "start_char": 1389,
      "end_char": 1601,
      "start_sentence": 57,
      "end_sentence": 64,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.595073938369751,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上说青玄雷令法行因地妙经.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}