{
  "source_id": "太上秘法镇宅灵符",
  "source_file": "chunked_daozang\\太上秘法镇宅灵符.json",
  "total_chunks": 2,
  "total_original_chars": 1737,
  "total_translated_chars": 10817,
  "total_translation_time": 50.04489612579346,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\神符类\\太上秘法镇宅灵符.txt",
    "category": "神符类"
  },
  "full_translation": "**The Supreme Secret Method of the Talismanic Charm for Pacifying the Household**\n\n*Scripture Title:* *The Supreme Secret Method of the Talismanic Charm for Pacifying the Household*. Author unknown. One fascicle. Base text from the *Daoist Canon of the Zhengtong Era*, *Dongzhen* section, *Shenfu* (Divine Talismans) category.\n\n**The Supreme Secret Method of the Talismanic Charm for Pacifying the Household**\n\nAccording to the *Upper Prime Scripture*, Emperor Wen of Han once asked the Heavenly Elder: \"What is meant by a household said to possess the 'Three Foolish Dwellings'?\"\n\nThe Heavenly Elder replied: \"The 'Three Foolish Dwellings' are as follows: a dwelling with high ground in front and low ground behind is the first foolishness; one with flowing water to the north is the second foolishness; and one with high ground to the southeast and level ground to the northwest is the third foolishness.\"\n\nOne day, the Emperor, traveling incognito, arrived at the border of Hongnong County and saw a household residing precisely in such a \"Three Foolish Dwellings.\" The family was exceedingly wealthy, with over fifty members. The Emperor was greatly astonished and returned to the palace.\n\nThe following day, he summoned two officials versed in yin-yang arts, changed their attire, and together they visited the household’s gate, intending to inquire about the dwelling’s circumstances. Upon seeing them, the gatekeeper immediately reported to the master: \"There are three visitors at the gate seeking an audience.\"\n\nJinping, having heard this, hastily ordered them to be invited in and welcomed them into the hall. After the exchange of courtesies, they sat in the hall. Jinping prepared wine, and during the drinking, the Emperor asked the master: \"What is your surname?\"\n\nThe master replied: \"My surname is Liu, and my given name is Jinping.\"\n\nThe Emperor then asked: \"How many years have you lived in this dwelling?\"\n\nJinping answered: \"I have lived here for over thirty years.\"\n\nThe Emperor said: \"According to the *Dwelling Scripture*, this is precisely a 'Three Foolish Dwellings,' a place of great inauspiciousness where one should not reside. What method have you employed to transform it into a peaceful and auspicious dwelling? I wish to hear of it.\"\n\nJinping replied: \"From the beginning of my residence here, this dwelling was plagued by disasters—loss of wealth, harm to family members, official troubles and illnesses year after year, unrest among livestock, and distress among all household members, reducing us to extreme poverty. One evening, as dusk approached, two scholars, arriving from an unknown direction, sought lodging and food at my home. Due to my poverty, I could only offer them a simple porridge. After they had eaten, they asked why I lived in such an inauspicious dwelling. I replied that my poverty made it impossible to move elsewhere. The two scholars said: 'We possess a method to protect your dwelling; you need not relocate.' I bowed and entreated them to bestow their method upon me, and I was willing to receive their instruction. The two scholars then transmitted these seventy-two talismanic charms for pacifying the household. They declared that after ten years of pacification, great wealth and nobility would follow for twenty years, and descendants would flourish for thirty years. Moreover, a 'White-Robed Son of Heaven' would surely enter the dwelling. All these predictions have come to pass, except for the 'White-Robed Son of Heaven,' which has yet to be verified.\"\n\nEmperor Wen smiled and asked: \"Where are the two scholars now?\"\n\nJinping replied: \"After transmitting the talismanic method, they took their leave. After walking about fifty paces from the gate, they vanished, leaving only a streak of white qi ascending into the heavens.\"\n\nThe Emperor asked: \"May I see the talismans?\"\n\nJinping then presented the talismans to the Emperor. Having obtained them, Emperor Wen returned to the palace and ordered their widespread implementation. These talismans, disseminated throughout the realm, pacified households and provided universal protection, bringing purity and auspiciousness to every family and peace and well-being to every household. The Supreme Perfected bestowed their protection, preventing the arising of disasters and calamities. Longevity and fortune increased, descendants achieved honor and prominence, silkworm and field yields doubled, and livestock flourished. Malevolent spirits and pernicious influences were swept away, and demonic vapors were eradicated. The talismanic charms, wondrous and efficacious, eternally safeguarded the gates and courtyards.\n\nThe efficacy of these talismans is well-documented, with numerous accounts of their origins. Though it is difficult to recount them all, they have been carved onto printing blocks to disseminate their transmission widely.\n\n**The Diagram of the Revolving Mechanism and Eight Trigrams**\n\n- Suppresses the omen of a cauldron wailing and dogs ascending onto beds; severs firelight and severs ghosts.\n- Suppresses the circulation of inauspicious qi, harmonizing yin and yang.\n- Suppresses the omen of pigs, cats, dogs, and the like devouring their young.\n- Suppresses quarrels, malicious affairs, and encroaching harm.\n- Suppresses malevolent ghosts that bring disaster.\n- Suppresses ghosts that bring inauspicious calamities and encroaching harm.\n- Suppresses ghosts of warfare and decline.\n- Pacifies and suppresses fiercely malevolent ghosts.\n- Suppresses ghosts that cause the death or injury of cattle, horses, and livestock.\n- Summons gold and silver into the dwelling, ensuring wealth and nobility without encountering calamities.\n- Suppresses the omen of wind and fire spirits.\n- Suppresses thieves, quarrels, and groundless malevolent ghosts.\n- Suppresses the omen of waterlogging and firelight spirits.\n- Suppresses the omen of chickens crowing at night and the hundred malevolent spirits.\n- Suppresses inauspiciousness for the longevity of men and women.\n- Suppresses seasonal disharmony and eradicates malicious affairs.\n- Suppresses ghosts that cause unjust loss of wealth and conspiratorial harm.\n- Suppresses ghosts that cause loss of life and harm to family members.\n- Suppresses malevolent ghosts.\n- Suppresses ghosts that cause silkworm rearing to fail.\n- Suppresses ghosts that cause harm to livestock and injury to people.\n- Suppresses flying corpse ghosts that encroach upon and harm people.\n- Suppresses nightmares and the futility of prayers for profit.\n- This talisman greatly summons official positions.\n- Aids in official positions and severs the harm of lying corpses.\n- Suppresses the earth qi of the west that harms people.\n- Suppresses the earth qi of the north that causes depletion and harm.\n- Suppresses lying corpse ghosts that harm people.\n- Suppresses the earth qi of the south that harms people.\n- Thieves do not encroach; all affairs proceed as desired.\n- Suppresses household ghosts that harm people.\n- Suppresses quarrels and the disasters of illness.\n- Suppresses the earth qi of the center that causes shifting ghosts.\n- Dragon spirits are not Buddhas.\n- This talisman greatly fulfills prayers and desires.\n- Suppresses the omen of dogs, chickens, and foxes wailing and ascending onto roofs.\n- Summons gold and silver to enter spontaneously, bringing great wealth and nobility.\n- Suppresses snakes, insects, and various malevolent spirits.\n- Protects the dwelling, gates, and household, ensuring purity and auspiciousness.\n- Suppresses spirits of shrines and spectral apparitions.\n- Suppresses baleful stars.\n- Suppresses the frenzied spirits of the myriad things.\n- Suppresses the earth qi of the east that depletes and harms.\n- Suppresses ghosts of official punishments and imprisonment.\n- Suppresses the malevolent spirits of old trees and wood.\n- Suppresses ghosts that call out people’s names at inopportune times.\n- Suppresses thieves and the terror they instill in people.\n\nSuppresses licentious shrines and the ghosts of wickedness. The Three Luminaries, the hundred spirits, thunder, and lightning shall not invade. Suppresses the vengeful ghosts of corpses and decay. Suppresses the incursions of the Grand Year and pestilential epidemics. Suppresses ghosts that harm fields and silkworms, and those that bring illness. Suppresses ghosts that cause the heavens to overturn and the earth to upend, and those that prevent mares from bearing foals. Suppresses the hundred spectral tongues of slander and strife. Suppresses official summons and urgent matters of fire. Suppresses serpents and rats that devour silkworms, and the discord that sets husband and wife at odds. Repels evil, expels ghosts, restores order, and safeguards the household. Ensures the prosperity of fields, silkworms, and the six livestock. Suppresses pestilential qi and the hundred miscellaneous ghosts. Suppresses the hundred ghosts that seek to harm people. Suppresses ghosts that startle in dreams. Bestows upon descendants great nobility, harmony, and longevity. Suppresses ghosts of childbirth—male or female—and those of afterbirth, blood, and impurity. Suppresses ghosts that bring unending illness. Suppresses ghosts that cause the death of cattle, horses, and the six livestock, and the flight of servants and maids. Suppresses ghosts of illness, thieves, and depletion. Suppresses ghosts that terrify people. Suppresses ghosts that bring grave illness, misfortune, and short lifespans. Removes ghosts that cause abdominal distension and obstruct eating and drinking. Suppresses ghosts of childbirth depletion that seek to harm. Suppresses ghosts of burial mounds, corpses, and illness. Suppresses inauspicious ghosts that disrupt the birth of cattle.\n\n**Days of the Holy Descents each month:**\n- Seventh day of the first lunar month\n- Eighth day of the second lunar month\n- Third day of the third lunar month\n- Ninth day of the third lunar month\n- Fourth day of the fourth lunar month\n- Fifth day of the fifth lunar month\n- Seventh day of the sixth lunar month\n- Seventh day of the seventh lunar month\n- Thirteenth day of the eighth lunar month\n- Ninth day of the ninth lunar month\n- Twenty-first day of the tenth lunar month\n- Seventh day of the eleventh lunar month\n- Twenty-seventh day of the twelfth lunar month\n\n**Offering Rites:**\n- Incense papers, *chenxiang* (agarwood), and *jiangzhen* (descending incense) should each be burned in separate censers; do not mix them. All should contain musk.\n- Osmanthus, gardenia, plum blossoms, pine, cypress, pure tea, and jujube broth.\n\n**Taboo Foods:**\n- Wild goose, eel, turtle, *dian* (a type of fish), black carp, *zun* (a type of fish), *shan* (a type of fish), raw scallions, leeks, garlic, coriander, beef, and dog meat.\n\nThe Supreme Secret Method of the *Zhenzhai* Spirit Talisman is now complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上秘法镇宅灵符 经名：太上秘法镇宅灵符。 撰人不祥。 一卷。 底本出处：《正统道藏》洞真部神符类。 太上秘法镇宅灵符 谨按上元经云：昔汉孝文皇帝，问天老曰：人家谓有三愚之宅者何？ 天老答曰：三愚之宅者、其宅前高后低者为一愚，北有流水者为二愚，东南高西北平为三愚。 帝忽因一日，私行至弘农县界，见一家，正住三愚、之宅。 其宅甚是豪富，大小五十余口。 帝叹讶非常，而回宫内。 至来日、遂语阴阳官二人，更换衣服，一二人同至其家门首，欲问其宅因由。 门人一见，即报主人。 门前有三人，欲求相见。 进平闻之，急令请入，邀於厅上。 主客礼毕，就厅而坐。 进平置酒，饮酒之次，帝问主人曰：何姓？ 答曰：姓刘，名进平。 又问曰：住此宅得几多年？ 进平答曰：住此宅，今经三十余年。 帝曰：谨按宅经云，此宅正系三愚之宅，其地大凶，人不可居之。 有何方术，而成安吉之宅，愿闻之。 进平答曰：一自初居，此宅甚见灾祸，损耗财物，伤折人口，官病连年，六畜不安，大小不宁，贫乏甚至。 忽於一日，天将欲晚，有二书生，不知从何方来本家投宿谒食。 进平缘为家贫，只有些小糜粥，以供二生。 食毕，遂问进平，此宅甚凶，何得居之？ 进平对曰：实为家贫，迁移不得。 二生曰：吾有法卫，教公镇宅，不须移动。 进平拜告蒙赐法术，愿听教矣。 其二生，即传此七十二道镇宅灵符。 遂云镇宅十年，大富贵二十年，子孙昌盛三十年，必有白衣天子入宅。 所验一一见之，但只有白衣天子未见其验。 文帝笑而问曰：二生何在？ 进平对曰：传符法了，便辞而去。 出门约五十步不见，惟有白气一道，上天而去。 帝曰：符其可得而闻乎？ 进平於是将符即时进上。 文帝遂获此符，回宫劫令奉行。 此符传於天下，镇宅普护，家家清吉，户户康宁。 上、真垂佑，灾害．不生。 福寿增延，子孙荣显。 田蚕倍盛，六畜兴生。 扫除精怪，荡灭妖氛。 灵符秘妙，永镇门庭。 此符灵验，来历甚多。 述之难尽，爰用馒梓，以广其传一百。 璇玑八卦之图 厌釜呜狗上床，斩火光切鬼。 厌除炁运，阴阳不和。 厌猪猫犬等，自食子怪。 厌除口舌，恶事，侵害。 厌除祸害之鬼。 厌除凶殃侵害之鬼。 厌刀兵、衰耗之鬼。 厌镇凶恶之鬼。 厌牛马六畜死伤鬼。 招金银入宅，富贵不逢殃祸。 厌除风火之怪。 厌盗贼、口舌、无端之鬼。 厌水潦火光怪。 厌鸡夜呜，百怪之鬼。 厌不宜男女长命。 厌时气不和，恶事灭。 厌横损财，谋害之鬼。 厌亡失、克害人口之鬼。 厌恶鬼。 厌除养蚕不成之鬼。 厌牲畜物损伤人之鬼。 厌飞尸鬼侵害人口。 厌恶梦、经求无利息。 此符大招官职。 宜官职，斩伏尸为祸。 厌西方土气损人口。 厌除北方土气耗损之鬼。 厌伏尸鬼损害人口。 厌南方土气害人口。 盗贼不侵，万事称意。 厌除家鬼克害人口。 厌除口舌、疾病之灾。 厌中央土气移动鬼。 龙神非佛。 此符大招经求遂意。 厌犬鸡、狐狸呜，上屋。 招金银自入，大富贵。 厌蛇虫作诸怪祟。 保宅舍、门户、人口清吉。 厌神祠精魅鬼。 厌煞星。 厌除发狂万物之精。 厌东方土气精耗鬼。 厌除官刑狱鬼。 厌老树木作精魅鬼。 厌鬼怪不时呼人姓名。 厌盗贼惊恐人。",
      "translated_text": "**The Supreme Secret Method of the Talismanic Charm for Pacifying the Household**\n\n*Scripture Title:* *The Supreme Secret Method of the Talismanic Charm for Pacifying the Household*. Author unknown. One fascicle. Base text from the *Daoist Canon of the Zhengtong Era*, *Dongzhen* section, *Shenfu* (Divine Talismans) category.\n\n**The Supreme Secret Method of the Talismanic Charm for Pacifying the Household**\n\nAccording to the *Upper Prime Scripture*, Emperor Wen of Han once asked the Heavenly Elder: \"What is meant by a household said to possess the 'Three Foolish Dwellings'?\"\n\nThe Heavenly Elder replied: \"The 'Three Foolish Dwellings' are as follows: a dwelling with high ground in front and low ground behind is the first foolishness; one with flowing water to the north is the second foolishness; and one with high ground to the southeast and level ground to the northwest is the third foolishness.\"\n\nOne day, the Emperor, traveling incognito, arrived at the border of Hongnong County and saw a household residing precisely in such a \"Three Foolish Dwellings.\" The family was exceedingly wealthy, with over fifty members. The Emperor was greatly astonished and returned to the palace.\n\nThe following day, he summoned two officials versed in yin-yang arts, changed their attire, and together they visited the household’s gate, intending to inquire about the dwelling’s circumstances. Upon seeing them, the gatekeeper immediately reported to the master: \"There are three visitors at the gate seeking an audience.\"\n\nJinping, having heard this, hastily ordered them to be invited in and welcomed them into the hall. After the exchange of courtesies, they sat in the hall. Jinping prepared wine, and during the drinking, the Emperor asked the master: \"What is your surname?\"\n\nThe master replied: \"My surname is Liu, and my given name is Jinping.\"\n\nThe Emperor then asked: \"How many years have you lived in this dwelling?\"\n\nJinping answered: \"I have lived here for over thirty years.\"\n\nThe Emperor said: \"According to the *Dwelling Scripture*, this is precisely a 'Three Foolish Dwellings,' a place of great inauspiciousness where one should not reside. What method have you employed to transform it into a peaceful and auspicious dwelling? I wish to hear of it.\"\n\nJinping replied: \"From the beginning of my residence here, this dwelling was plagued by disasters—loss of wealth, harm to family members, official troubles and illnesses year after year, unrest among livestock, and distress among all household members, reducing us to extreme poverty. One evening, as dusk approached, two scholars, arriving from an unknown direction, sought lodging and food at my home. Due to my poverty, I could only offer them a simple porridge. After they had eaten, they asked why I lived in such an inauspicious dwelling. I replied that my poverty made it impossible to move elsewhere. The two scholars said: 'We possess a method to protect your dwelling; you need not relocate.' I bowed and entreated them to bestow their method upon me, and I was willing to receive their instruction. The two scholars then transmitted these seventy-two talismanic charms for pacifying the household. They declared that after ten years of pacification, great wealth and nobility would follow for twenty years, and descendants would flourish for thirty years. Moreover, a 'White-Robed Son of Heaven' would surely enter the dwelling. All these predictions have come to pass, except for the 'White-Robed Son of Heaven,' which has yet to be verified.\"\n\nEmperor Wen smiled and asked: \"Where are the two scholars now?\"\n\nJinping replied: \"After transmitting the talismanic method, they took their leave. After walking about fifty paces from the gate, they vanished, leaving only a streak of white qi ascending into the heavens.\"\n\nThe Emperor asked: \"May I see the talismans?\"\n\nJinping then presented the talismans to the Emperor. Having obtained them, Emperor Wen returned to the palace and ordered their widespread implementation. These talismans, disseminated throughout the realm, pacified households and provided universal protection, bringing purity and auspiciousness to every family and peace and well-being to every household. The Supreme Perfected bestowed their protection, preventing the arising of disasters and calamities. Longevity and fortune increased, descendants achieved honor and prominence, silkworm and field yields doubled, and livestock flourished. Malevolent spirits and pernicious influences were swept away, and demonic vapors were eradicated. The talismanic charms, wondrous and efficacious, eternally safeguarded the gates and courtyards.\n\nThe efficacy of these talismans is well-documented, with numerous accounts of their origins. Though it is difficult to recount them all, they have been carved onto printing blocks to disseminate their transmission widely.\n\n**The Diagram of the Revolving Mechanism and Eight Trigrams**\n\n- Suppresses the omen of a cauldron wailing and dogs ascending onto beds; severs firelight and severs ghosts.\n- Suppresses the circulation of inauspicious qi, harmonizing yin and yang.\n- Suppresses the omen of pigs, cats, dogs, and the like devouring their young.\n- Suppresses quarrels, malicious affairs, and encroaching harm.\n- Suppresses malevolent ghosts that bring disaster.\n- Suppresses ghosts that bring inauspicious calamities and encroaching harm.\n- Suppresses ghosts of warfare and decline.\n- Pacifies and suppresses fiercely malevolent ghosts.\n- Suppresses ghosts that cause the death or injury of cattle, horses, and livestock.\n- Summons gold and silver into the dwelling, ensuring wealth and nobility without encountering calamities.\n- Suppresses the omen of wind and fire spirits.\n- Suppresses thieves, quarrels, and groundless malevolent ghosts.\n- Suppresses the omen of waterlogging and firelight spirits.\n- Suppresses the omen of chickens crowing at night and the hundred malevolent spirits.\n- Suppresses inauspiciousness for the longevity of men and women.\n- Suppresses seasonal disharmony and eradicates malicious affairs.\n- Suppresses ghosts that cause unjust loss of wealth and conspiratorial harm.\n- Suppresses ghosts that cause loss of life and harm to family members.\n- Suppresses malevolent ghosts.\n- Suppresses ghosts that cause silkworm rearing to fail.\n- Suppresses ghosts that cause harm to livestock and injury to people.\n- Suppresses flying corpse ghosts that encroach upon and harm people.\n- Suppresses nightmares and the futility of prayers for profit.\n- This talisman greatly summons official positions.\n- Aids in official positions and severs the harm of lying corpses.\n- Suppresses the earth qi of the west that harms people.\n- Suppresses the earth qi of the north that causes depletion and harm.\n- Suppresses lying corpse ghosts that harm people.\n- Suppresses the earth qi of the south that harms people.\n- Thieves do not encroach; all affairs proceed as desired.\n- Suppresses household ghosts that harm people.\n- Suppresses quarrels and the disasters of illness.\n- Suppresses the earth qi of the center that causes shifting ghosts.\n- Dragon spirits are not Buddhas.\n- This talisman greatly fulfills prayers and desires.\n- Suppresses the omen of dogs, chickens, and foxes wailing and ascending onto roofs.\n- Summons gold and silver to enter spontaneously, bringing great wealth and nobility.\n- Suppresses snakes, insects, and various malevolent spirits.\n- Protects the dwelling, gates, and household, ensuring purity and auspiciousness.\n- Suppresses spirits of shrines and spectral apparitions.\n- Suppresses baleful stars.\n- Suppresses the frenzied spirits of the myriad things.\n- Suppresses the earth qi of the east that depletes and harms.\n- Suppresses ghosts of official punishments and imprisonment.\n- Suppresses the malevolent spirits of old trees and wood.\n- Suppresses ghosts that call out people’s names at inopportune times.\n- Suppresses thieves and the terror they instill in people.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1354,
      "start_sentence": 0,
      "end_sentence": 93,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.64930558204651,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\神符类\\太上秘法镇宅灵符.txt",
        "category": "神符类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "厌除淫祠奸恶之鬼。 三光百灵雷电不侵。 厌伏尸蛀煞鬼。 厌除太岁疾疫之侵。 厌不宜田蚕、疾病之鬼。 厌天返地覆，马不生儿之鬼。 厌百怪口舌之鬼。 厌官司呼唤火速事。 厌蛇鼠食蚕，夫妇反目不和事。 辟邪驱鬼，复正保家。 田蚕六畜蕃息。 厌疫气百杂鬼。 厌除百鬼不得害人。 厌梦寐惊人鬼。 宜子孙大贵，和睦长命。 厌产育男女，胎衣血腥不净鬼。 厌除疾病连绵之鬼。 厌牛马六畜死，奴婢逃亡之鬼。 厌病、盗贼、虚耗之鬼。 厌惊恐人之鬼。 厌病患沈重，臧福短寿之鬼。 除腹胀饮食不下鬼。 厌产耗鬼不来克害。 厌丘冢伏尸疾病鬼。 厌不祥牛畜生产鬼。 每月圣降之日 正月初七日、二月初八日、三月初三日圣诞初九日四月初四日、五月初五日、六月初七日、七月初七日、八月十三日、九月初九日、十月二十一日、十一月初七日、十二月二十七日。 供养之仪 笺、沈、降真、各只宜一灶不宜合和悉有麝。 木樨、栀子、梅花、松、栢、净茶、枣汤。 忌食 雁、鳗、龟、电、黑鲤、鳟鳝、生葱、韭、蒜、荽、牛、犬。 太上秘法镇宅灵符竟",
      "translated_text": "Suppresses licentious shrines and the ghosts of wickedness. The Three Luminaries, the hundred spirits, thunder, and lightning shall not invade. Suppresses the vengeful ghosts of corpses and decay. Suppresses the incursions of the Grand Year and pestilential epidemics. Suppresses ghosts that harm fields and silkworms, and those that bring illness. Suppresses ghosts that cause the heavens to overturn and the earth to upend, and those that prevent mares from bearing foals. Suppresses the hundred spectral tongues of slander and strife. Suppresses official summons and urgent matters of fire. Suppresses serpents and rats that devour silkworms, and the discord that sets husband and wife at odds. Repels evil, expels ghosts, restores order, and safeguards the household. Ensures the prosperity of fields, silkworms, and the six livestock. Suppresses pestilential qi and the hundred miscellaneous ghosts. Suppresses the hundred ghosts that seek to harm people. Suppresses ghosts that startle in dreams. Bestows upon descendants great nobility, harmony, and longevity. Suppresses ghosts of childbirth—male or female—and those of afterbirth, blood, and impurity. Suppresses ghosts that bring unending illness. Suppresses ghosts that cause the death of cattle, horses, and the six livestock, and the flight of servants and maids. Suppresses ghosts of illness, thieves, and depletion. Suppresses ghosts that terrify people. Suppresses ghosts that bring grave illness, misfortune, and short lifespans. Removes ghosts that cause abdominal distension and obstruct eating and drinking. Suppresses ghosts of childbirth depletion that seek to harm. Suppresses ghosts of burial mounds, corpses, and illness. Suppresses inauspicious ghosts that disrupt the birth of cattle.\n\n**Days of the Holy Descents each month:**\n- Seventh day of the first lunar month\n- Eighth day of the second lunar month\n- Third day of the third lunar month\n- Ninth day of the third lunar month\n- Fourth day of the fourth lunar month\n- Fifth day of the fifth lunar month\n- Seventh day of the sixth lunar month\n- Seventh day of the seventh lunar month\n- Thirteenth day of the eighth lunar month\n- Ninth day of the ninth lunar month\n- Twenty-first day of the tenth lunar month\n- Seventh day of the eleventh lunar month\n- Twenty-seventh day of the twelfth lunar month\n\n**Offering Rites:**\n- Incense papers, *chenxiang* (agarwood), and *jiangzhen* (descending incense) should each be burned in separate censers; do not mix them. All should contain musk.\n- Osmanthus, gardenia, plum blossoms, pine, cypress, pure tea, and jujube broth.\n\n**Taboo Foods:**\n- Wild goose, eel, turtle, *dian* (a type of fish), black carp, *zun* (a type of fish), *shan* (a type of fish), raw scallions, leeks, garlic, coriander, beef, and dog meat.\n\nThe Supreme Secret Method of the *Zhenzhai* Spirit Talisman is now complete.",
      "overlap_context": "sehold, ensuring purity and auspiciousness.\n- Suppresses spirits of shrines and spectral apparitions.\n- Suppresses baleful stars.\n- Suppresses the frenzied spirits of the myriad things.\n- Suppresses the earth qi of the east that depletes and harms.\n- Suppresses ghosts of official punishments and imprisonment.\n- Suppresses the malevolent spirits of old trees and wood.\n- Suppresses ghosts that call out people’s names at inopportune times.\n- Suppresses thieves and the terror they instill in people.",
      "start_char": 1355,
      "end_char": 1862,
      "start_sentence": 94,
      "end_sentence": 126,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.395590543746948,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\神符类\\太上秘法镇宅灵符.txt",
        "category": "神符类"
      }
    }
  ]
}