{
  "source_id": "太上老君说消灾经",
  "source_file": "chunked_daozang\\太上老君说消灾经.json",
  "total_chunks": 3,
  "total_original_chars": 2099,
  "total_translated_chars": 12658,
  "total_translation_time": 65.8694543838501,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\本文类\\太上老君说消灾经.txt",
    "category": "本文类"
  },
  "full_translation": "**The Most High Lord Lao’s Scripture on Dispelling Disasters**\n\n**Scripture Title:** *The Most High Lord Lao’s Scripture on Dispelling Disasters*\nAuthor unknown, approximately composed between the Tang and Song dynasties. Falsely attributed to the Most High Lord Lao, who expounds the scripture to the immortals and perfected beings, bestowing it upon Yin Xi. It exhorts people to recite the scripture and invoke the deities to dispel disasters and cure illnesses. One fascicle.\n\n**Source of the Base Text:** *Daoist Canon of the Zhengtong Era*, *Writings of the Divine Empyrean Section*, *Textual Category*.\n\n---\n\n**The Most High Lord Lao’s Scripture on Dispelling Disasters**\n\nOn the bingwu day of the twenty-eighth of the fourth month in the gengyin year, the Most High Lord Lao, together with the great sages of all heavens, sat upon the Azure Radiance Palace and the Five Clouds Throne. Immortal attendants stood in guard, their numbers beyond count, bearing banners and holding incense, arrayed to his left and right, all assembled as one.\n\nHe summoned the celestial immortals and terrestrial immortals, the immortals of the Five Marchmounts, the thirty-six sovereigns of the celestial immortals, the twenty-four sovereigns of the terrestrial immortals, the ten sovereigns of the divine immortals, and the multitude of flying immortals and great sages. Additionally, the thirty-six myriad upper immortals of foreign lands, the twenty-five myriad middle immortals, and the fourteen myriad lower immortals, along with the eight great dragon lords, the eight great ghost lords, the eight great beast lords, the lords of the Three and Five, and the twenty-four natures—all came to gather.\n\nHe commanded the celestial and terrestrial registrars of the Heavenly Capital to immediately record the names of all malevolent demons, evil ghosts, *chimei* and *wangliang*, bandits and thieves, tigers and wolves, as well as those afflicted by unjust officials, slanderous tongues, warfare, floods, fires, illnesses, disasters, and dire calamities. Regardless of gender, all who suffer must bathe in fragrant waters, observe purification and fasts, light lamps, burn incense, pay reverence, and recite this scripture in offering.\n\nIf a household is plagued by demonic hordes, bandits, spectral perils, or pestilential epidemics, or faces dire calamities, they should invoke the thirty-six vajras, the twenty-five divine kings, the twenty-seven *lishi*, and the thirty-seven celestial masters. All these vajras, divine kings, *lishi*, and celestial masters govern the myriad illnesses, disasters, and transformations, as well as all matters of fortune and misfortune, good and evil.\n\nIf faithful men and women observe perpetual purification, burn incense, and reverently recite this scripture, their merit shall be boundless. All their thousands of disasters and myriad illnesses, along with malevolent bandits, tigers, wolves, and every affliction, shall naturally vanish. The Heavenly Worthy shall bestow blessings, sheltering them, and all their aspirations shall be fulfilled without fail. Their households shall know peace, their descendants shall flourish, and those who cultivate this practice shall attain spiritual resonance. Those who treat it with contempt shall bring calamity upon their nine generations. Let this be proclaimed to all men and women, that they may understand karmic retribution and thereby gain benefit.\n\n**Vajras:**\nPrimordial Qi Vajra, Chaos Vajra, General Command Vajra,\nMyriad Manifestations Vajra, Ghost-Seizing Vajra, Registry Vajra,\nQi-Collecting Vajra, Life-Nurturing Vajra, Guardian Vajra,\nExorcising Vajra, Lifespan-Protecting Vajra, Form-Guarding Vajra,\nQi-Guarding Vajra, Truth-Practicing Vajra, Falsity-Removing Vajra,\nEvil-Dispelling Vajra, Delusion-Shattering Vajra, Memorial-Presenting Vajra,\nLower-Guarding Vajra, Illumination Vajra, Body-Protecting Vajra,\nLongevity Vajra, Transformation Vajra, Serene Stabilizing Vajra,\nBody-Stabilizing Vajra, Vermilion Bird Vajra, Dark Warrior Vajra,\nGreat Sage Vajra, Dao-Attaining Vajra, Heavenly Dao Vajra,\nEarthly Dao Vajra, Divine Dao Vajra, Fire-Head Vajra,\nFierce Vajra, Great Strength Vajra, Demon-Destroying Vajra.\n\n**Divine Kings:**\nHeavenly Great Divine King, Earthly Great Divine King, Kingly Great Divine King,\nPrimordial Essence Divine King, Essence-Born Divine King, Yin Virtue Divine King,\nQi-Refining Divine King, Spirit-Refining Divine King, Life-Refining Divine King,\nTransformation-Opening Divine King, Creation-Fashioning Divine King, True Dao Divine King,\nDivine Dao Divine King, Body-Protecting Divine King, Evil-Destroying Divine King,\nOrthodoxy-Upholding Divine King, Barbarian-Destroying Divine King, Bandit-Destroying Divine King,\nGhost-Seeking Divine King, Ghost-Slaying Divine King, Distant Travel Divine King,\nBody-Pacifying Divine King, Ghost-Killing Divine King, Specter-Devouring Divine King,\nSpirit-Capturing Divine King.\n\n**Lishi:**\nTreachery-Removing Lishi, Flattery-Removing Lishi, Grudge-Breaking Lishi,\nDelusion-Breaking Lishi, Path-Opening Lishi, Disaster-Dispelling Lishi,\nCalamity-Dispersing Lishi, Distress-Resolving Lishi, Demon-Dispelling Lishi,\nGrasping Lishi, Ghost-Leading Lishi, Ghost-Capturing Lishi,\nEvil-Capturing Lishi, Registry-Compiling Lishi, Text-Stabilizing Lishi,\nSentence-Determining Lishi, Memorial-Presenting Lishi, Monarch-Attending Lishi,\nServing Lishi, Heavenly Manifestation Lishi, Earthly Vastness Lishi,\nEvil-Seizing Lishi, Army-Breaking Lishi, Campaign-Conducting Lishi,\nSpirit-Seizing Lishi, Heaven-Crossing Lishi, Essence-Devouring Lishi.\n\n**Celestial Masters:**\nPrimordial-Initiating Celestial Master, Dao-Illuminating Celestial Master, Transformation-Opening Celestial Master,\nImmortal-Advancing Celestial Master, Radiance-Restoring Celestial Master, Clarity-Illuminating Celestial Master,\nSerene Stabilizing Celestial Master, Evil-Stabilizing Celestial Master, Ghost-Capturing Celestial Master,\nDemon-Subduing Celestial Master, Ghost-Slaying Celestial Master, Heaven-Initiating Celestial Master,\nRegistry-Compiling Celestial Master, Memorial-Presenting Celestial Master, Death-Removing Celestial Master,\nLife-Stabilizing Celestial Master, Protecting Celestial Master, Universal Salvation Celestial Master,\nDistress-Relieving Celestial Master, Death-Rescuing Celestial Master, Life-Guarding Celestial Master,\nLifespan-Conveying Celestial Master, People-Conveying Celestial Master, Life-Nurturing Celestial Master,\nGoodness-Nurturing Celestial Master, Transformation Celestial Master, Divine Marvel Celestial Master,\nAugust Supreme Celestial Master, Myriad Blessings Celestial Master, Utmost Celestial Master,\nJade Dawn Celestial Master, Supreme Sage Celestial Master, Void Sovereign Celestial Master,\nBoundless Celestial Master, Luminous Sovereign Celestial Master, Profound Abyss Celestial Master,\nUniversal Seizing Celestial Master.\n\nLord Lao said: These celestial masters reside above the thirty-six heavens, yet they descend to govern the world, universally commanding ghosts and spirits, as well as all spectral perils, pestilential qi, tigers, wolves, venomous beasts, seasonal epidemics, slanderous tongues, and curses—all are under their dominion.\n\nIf one does not believe in the Daoist teachings, violates the immortal scriptures, devotes themselves to heterodox deities, practices mundane doctrines, follows perverse customs, or sacrifices to ghosts and spirits—such transgressions shall multiply their sins. Ignorant and defiled, they turn their backs on the true faith and embrace evil, thus facing judgment. For ten thousand kalpas, they shall remain in darkness; for a thousand kalpas, they shall endure punishment before being reborn as beasts, assuming non-human forms, subjected to servitude beyond comprehension. Upon death, they shall descend into hell, with no hope of return. Their sins are too grave to recount.\n\nEven if such individuals are reborn, they shall perpetually suffer from illnesses, poverty, and hardship, never knowing peace. They shall be oppressed by officials, harmed by others, their lifespans cut short, and upon death, they shall enter the eternal night of the underworld, unknown to all. For a hundred kalpas, they shall endure punishment before regaining human form.\n\nShould one purify the heart and reform their conduct, they may attain rebirth; but those who remain deluded and refuse to turn back draw near to death, destined to dwell eternally in evil realms, with no hope of rebirth. Now I solemnly admonish you—heed this warning well.\n\nAt that moment, the perfected immortals and great sages rejoiced and leapt with joy, bowing their heads in reverence and reciting these verses:\n\nThe Dao’s words are most subtle and wondrous,\nUniversally saving and delivering gods and humans.\nThose who cultivate shall all attain the Dao;\nThose who turn away shall bring calamity upon themselves.\nThis sutra can dispel disasters,\nWash away defilement, and sever the dust of clamor.\nYet beings, lacking wisdom,\nDefy it and believe in evil spirits.\nUpon death, they enter the suffering of freezing ice,\nEnduring bitter and arduous punishments.\nOnly by turning the heart to the true Dao\nCan one receive the true body.\nWith wholehearted devotion to the immortal path,\nOne may cross the celestial ford.\nForever enjoying boundless life,\nTheir forms multiply into a million perfected beings.\nThe Nine Dark Realms are forever cast open,\nAnd the seven generations of ancestors escape the gloomy ford.\nNaturally partaking of the celestial kitchen’s fare,\nAll depend on the sagely emperor’s grace.\nSinging sacred hymns along the mysterious path,\nFor ten thousand kalpas they preserve purity.\nDelivering all beings of this world,\nThe Three Perfected respond to the sagely emperor.\nThe five directions fall silent,\nAnd the Dao’s teachings gradually illuminate the age.\n\nIt is like a man at midday—\nYet demons and specters enter his heart’s storehouse.\nYin and yang may wane or wax,\nAnd the people all suffer famine.\nWhen the perfected one is about to depart,\nThe world’s chaos becomes truly unbearable.\nThe hidden dragon stirs once more,\nClosing its eyes in the secluded chamber.\nThe madman’s inverted karma\nWill soon bring misfortune upon himself.\nSinking into the depths of hell,\nHe suffers the agony of torture and wounds.\nAll stems from the perverse views of the heart,\nLeading to such scorching terror.\nThe Diamond Mandate commands the ascent to the Dao,\nIts mighty power shattering the wilderness of delusion.\nWith songs of harmony and peace,\nThe supreme Dao is forever revealed.\nWinds are harmonious and rains timely,\nThe five grains fill the overflowing granaries.\nThe four directions all submit in reverence,\nAnd qilin and phoenix naturally appear as auspicious signs.\nWhen the enlightened ruler upholds the Dao,\nFor ten thousand kalpas, the years shall be long.\n\nLord Lao addressed Yin Xi, saying: \"This scripture is most venerable, the essential key by which all immortals attain truth. You have now received my essential teaching—you must cultivate it with utmost dedication, preserve it within, and never reveal it to the unworthy. Only those who study the Daoist path, along with faithful men and women of good intent, may receive and transmit it according to its precepts. Clearly expound its methods, strictly observe its precepts and prohibitions, and take care not to miss the proper time. I now solemnly repeat: do not transmit it recklessly. My words are profoundly secret—guard them well.\"\n\nYin Xi then prostrated himself, knelt, and received the scripture.\n\nAt that moment, all the perfected immortals and assembled transcendents, having heard the scripture expounded, withdrew from their seats with reverence. After standing in attendance for a brief while, a multitude of immortals descended from the floating void, their number beyond count. Each bore incense and flowers, holding talismans and jade tablets, and came before the Dao. Together they bowed in unison, entreating Lord Lao to return to the Jade Capital.\n\nLord Lao, now joyfully preparing to ascend, addressed Yin Xi once more: \"I shall now rise on high. You, having received this scripture, will surely attain the Dao.\"\n\nYin Xi, overcome with sorrow and tears, prostrated himself in gratitude. Suddenly, Lord Lao vanished from sight. Only the resonant music shook the mountains and rivers. Looking up, he saw the dragon-drawn chariots, swirling clouds of qi receding into the distance, their five colors radiant and bright—unrecognizable to the world. In an instant, they grew ever more distant, until they faded from view.\n\nThus concludes *The Most High Lord Lao’s Scripture on Dispelling Disasters*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上老君说消灾经 经名：太上老君说消灾经。 撰人不详，约出於唐宋间。 假托太上老君为诸仙真说经，授予尹喜。 劝人诵经念神，消灾除病。 一卷。 底本出处：《正统道藏》洞神部本文类。 太上老君说消灾经 老君以庚寅年四月二十八日丙午，与诸天大圣俱坐碧霞之殿、五云之座，真仙侍卫，无鞅数众建节捧香，罗列左右，一时同会。 即召天仙地仙、五岳众仙、天仙三十六皇主、地仙二十四皇主、神仙十皇主、飞仙大圣众，又别国主上仙三十六万人，中仙二十五万人，下仙十四万人，八大龙主、八大鬼主、八大畜主、三五之君、二十四性，悉皆来集。 勅勅天都录事地都名字，即使摄录天下邪魔恶鬼、魑魅魍魉、盗贼虎狼、及横官口舌、兵戈水火、疾病灾害急厄，患之者，莫问男女，皆当香汤沐浴，斋戒然灯，烧香礼诵，供养此经。 若家有众魔野盗精邪疾疫，急厄难之时，当呼三十六金刚，二十五神王、二十七力士、三十七天师，凡此金刚神王力士天师等名号者，皆主知万病灾变，吉凶好恶悉皆由也。 若有善信男女，能长斋烧香，礼诵此经，功德无量，所有千灾万病，恶逆盗贼虎狼，一切病难，自然消灭。 天尊降福，覆护其人，所向从心，无不获福，家门安泰，子孙隆昌，修习之人，皆致灵感，轻慢之者，祸及九祖，令可告男女，令知报应，皆得利焉。 元炁金刚，混沌金刚，总领金刚， 万兆金刚，捉鬼金铡，部录金刚， 收炁金刚，好生金刚，镇守金刚， 去邪金刚，保命金刚，守形金刚， 守炁金刚，行真金刚，除伪金刚， 除邪金刚，破惑金铡，上奏金刚， 下卫金刚，上明金刚，保身金刚， 长生金刚，变化金刚，清定金刚， 定身金刚，朱雀金刚，玄武金刚， 大圣金刚，成道金刚，天道金刚， 地道金刚，神道金刚，火头金刚， 威怒金刚，大力金刚，灭魔金刚； 天大神王，地大神王，王大神王， 元素神王，素生神王，阴德神王， 炼炁神王，炼精神王，炼生神王， 开化神王，造化神王，真道神王， 神道神王，护身神王，破邪神王， 执正神王，破夷神王，破贼神王， 觅鬼神王，斩鬼神王，远行神王， 安身神王，杀鬼神王，食魅神王， 捕精神王； 除奸力士，除佞力士，破怨力士， 破迷力士，开道力士，消灾力士， 散祸力士，解厄力士，消魔力士， 把揽力士，领鬼力士，收鬼力士， 收邪力士，抄录力士，定文力士， 定罪力士，上奏力士，对君力士， 奉承力士，天显力士，地广力士， 摄邪力士，破军力士，征伐力士， 摄神力士，横天力士，食精力仕； 启元天师，道光天师，开化天师， 进仙天师，重光天师，朗清天师， 清定天师，定邪天师，收鬼天师， 制魔天师，斩鬼天师，启天天师， 部录天师，上奏天师，除死天师， 定生天师，保护天师，普济天师， 济厄天师，救死天师，护生天师， 度命天师，度人天师，好生天师， 好善天师，变化天师，神妙天师， 皇上天师，万福天师，至极天师， 玉辰天师，上圣天师，虚皇天师， 无量天师，明皇天师，洞深天师， 普摄天师。 老君曰：此天师者，位在三十六天之上也，仍下统世界，普领鬼神，及一切精邪疫疾，虎狼毒兽，时瘟疫炁，口舌咒诅，悉皆由也。 若人不信道法，违背仙经，专事邪神，或修俗教，或习邪风，或祭祀鬼神，如此等类，罪由转盛，无知秽俗，背正信邪，故受考对，万劫无明，千劫受罪，乃得还生畜生之类，非人之形，任他役使，不可思议，死经地狱，无有还期，其罪深重，不可尽言，如此之人，纵受生，恒遭疾病，贫穷苦厄，无时安静，官府所克，众人所害，年命短促，死入长夜冥冥地下，人所不知，百劫受罪，乃得返人之形。",
      "translated_text": "**The Most High Lord Lao’s Scripture on Dispelling Disasters**\n\n**Scripture Title:** *The Most High Lord Lao’s Scripture on Dispelling Disasters*\nAuthor unknown, approximately composed between the Tang and Song dynasties. Falsely attributed to the Most High Lord Lao, who expounds the scripture to the immortals and perfected beings, bestowing it upon Yin Xi. It exhorts people to recite the scripture and invoke the deities to dispel disasters and cure illnesses. One fascicle.\n\n**Source of the Base Text:** *Daoist Canon of the Zhengtong Era*, *Writings of the Divine Empyrean Section*, *Textual Category*.\n\n---\n\n**The Most High Lord Lao’s Scripture on Dispelling Disasters**\n\nOn the bingwu day of the twenty-eighth of the fourth month in the gengyin year, the Most High Lord Lao, together with the great sages of all heavens, sat upon the Azure Radiance Palace and the Five Clouds Throne. Immortal attendants stood in guard, their numbers beyond count, bearing banners and holding incense, arrayed to his left and right, all assembled as one.\n\nHe summoned the celestial immortals and terrestrial immortals, the immortals of the Five Marchmounts, the thirty-six sovereigns of the celestial immortals, the twenty-four sovereigns of the terrestrial immortals, the ten sovereigns of the divine immortals, and the multitude of flying immortals and great sages. Additionally, the thirty-six myriad upper immortals of foreign lands, the twenty-five myriad middle immortals, and the fourteen myriad lower immortals, along with the eight great dragon lords, the eight great ghost lords, the eight great beast lords, the lords of the Three and Five, and the twenty-four natures—all came to gather.\n\nHe commanded the celestial and terrestrial registrars of the Heavenly Capital to immediately record the names of all malevolent demons, evil ghosts, *chimei* and *wangliang*, bandits and thieves, tigers and wolves, as well as those afflicted by unjust officials, slanderous tongues, warfare, floods, fires, illnesses, disasters, and dire calamities. Regardless of gender, all who suffer must bathe in fragrant waters, observe purification and fasts, light lamps, burn incense, pay reverence, and recite this scripture in offering.\n\nIf a household is plagued by demonic hordes, bandits, spectral perils, or pestilential epidemics, or faces dire calamities, they should invoke the thirty-six vajras, the twenty-five divine kings, the twenty-seven *lishi*, and the thirty-seven celestial masters. All these vajras, divine kings, *lishi*, and celestial masters govern the myriad illnesses, disasters, and transformations, as well as all matters of fortune and misfortune, good and evil.\n\nIf faithful men and women observe perpetual purification, burn incense, and reverently recite this scripture, their merit shall be boundless. All their thousands of disasters and myriad illnesses, along with malevolent bandits, tigers, wolves, and every affliction, shall naturally vanish. The Heavenly Worthy shall bestow blessings, sheltering them, and all their aspirations shall be fulfilled without fail. Their households shall know peace, their descendants shall flourish, and those who cultivate this practice shall attain spiritual resonance. Those who treat it with contempt shall bring calamity upon their nine generations. Let this be proclaimed to all men and women, that they may understand karmic retribution and thereby gain benefit.\n\n**Vajras:**\nPrimordial Qi Vajra, Chaos Vajra, General Command Vajra,\nMyriad Manifestations Vajra, Ghost-Seizing Vajra, Registry Vajra,\nQi-Collecting Vajra, Life-Nurturing Vajra, Guardian Vajra,\nExorcising Vajra, Lifespan-Protecting Vajra, Form-Guarding Vajra,\nQi-Guarding Vajra, Truth-Practicing Vajra, Falsity-Removing Vajra,\nEvil-Dispelling Vajra, Delusion-Shattering Vajra, Memorial-Presenting Vajra,\nLower-Guarding Vajra, Illumination Vajra, Body-Protecting Vajra,\nLongevity Vajra, Transformation Vajra, Serene Stabilizing Vajra,\nBody-Stabilizing Vajra, Vermilion Bird Vajra, Dark Warrior Vajra,\nGreat Sage Vajra, Dao-Attaining Vajra, Heavenly Dao Vajra,\nEarthly Dao Vajra, Divine Dao Vajra, Fire-Head Vajra,\nFierce Vajra, Great Strength Vajra, Demon-Destroying Vajra.\n\n**Divine Kings:**\nHeavenly Great Divine King, Earthly Great Divine King, Kingly Great Divine King,\nPrimordial Essence Divine King, Essence-Born Divine King, Yin Virtue Divine King,\nQi-Refining Divine King, Spirit-Refining Divine King, Life-Refining Divine King,\nTransformation-Opening Divine King, Creation-Fashioning Divine King, True Dao Divine King,\nDivine Dao Divine King, Body-Protecting Divine King, Evil-Destroying Divine King,\nOrthodoxy-Upholding Divine King, Barbarian-Destroying Divine King, Bandit-Destroying Divine King,\nGhost-Seeking Divine King, Ghost-Slaying Divine King, Distant Travel Divine King,\nBody-Pacifying Divine King, Ghost-Killing Divine King, Specter-Devouring Divine King,\nSpirit-Capturing Divine King.\n\n**Lishi:**\nTreachery-Removing Lishi, Flattery-Removing Lishi, Grudge-Breaking Lishi,\nDelusion-Breaking Lishi, Path-Opening Lishi, Disaster-Dispelling Lishi,\nCalamity-Dispersing Lishi, Distress-Resolving Lishi, Demon-Dispelling Lishi,\nGrasping Lishi, Ghost-Leading Lishi, Ghost-Capturing Lishi,\nEvil-Capturing Lishi, Registry-Compiling Lishi, Text-Stabilizing Lishi,\nSentence-Determining Lishi, Memorial-Presenting Lishi, Monarch-Attending Lishi,\nServing Lishi, Heavenly Manifestation Lishi, Earthly Vastness Lishi,\nEvil-Seizing Lishi, Army-Breaking Lishi, Campaign-Conducting Lishi,\nSpirit-Seizing Lishi, Heaven-Crossing Lishi, Essence-Devouring Lishi.\n\n**Celestial Masters:**\nPrimordial-Initiating Celestial Master, Dao-Illuminating Celestial Master, Transformation-Opening Celestial Master,\nImmortal-Advancing Celestial Master, Radiance-Restoring Celestial Master, Clarity-Illuminating Celestial Master,\nSerene Stabilizing Celestial Master, Evil-Stabilizing Celestial Master, Ghost-Capturing Celestial Master,\nDemon-Subduing Celestial Master, Ghost-Slaying Celestial Master, Heaven-Initiating Celestial Master,\nRegistry-Compiling Celestial Master, Memorial-Presenting Celestial Master, Death-Removing Celestial Master,\nLife-Stabilizing Celestial Master, Protecting Celestial Master, Universal Salvation Celestial Master,\nDistress-Relieving Celestial Master, Death-Rescuing Celestial Master, Life-Guarding Celestial Master,\nLifespan-Conveying Celestial Master, People-Conveying Celestial Master, Life-Nurturing Celestial Master,\nGoodness-Nurturing Celestial Master, Transformation Celestial Master, Divine Marvel Celestial Master,\nAugust Supreme Celestial Master, Myriad Blessings Celestial Master, Utmost Celestial Master,\nJade Dawn Celestial Master, Supreme Sage Celestial Master, Void Sovereign Celestial Master,\nBoundless Celestial Master, Luminous Sovereign Celestial Master, Profound Abyss Celestial Master,\nUniversal Seizing Celestial Master.\n\nLord Lao said: These celestial masters reside above the thirty-six heavens, yet they descend to govern the world, universally commanding ghosts and spirits, as well as all spectral perils, pestilential qi, tigers, wolves, venomous beasts, seasonal epidemics, slanderous tongues, and curses—all are under their dominion.\n\nIf one does not believe in the Daoist teachings, violates the immortal scriptures, devotes themselves to heterodox deities, practices mundane doctrines, follows perverse customs, or sacrifices to ghosts and spirits—such transgressions shall multiply their sins. Ignorant and defiled, they turn their backs on the true faith and embrace evil, thus facing judgment. For ten thousand kalpas, they shall remain in darkness; for a thousand kalpas, they shall endure punishment before being reborn as beasts, assuming non-human forms, subjected to servitude beyond comprehension. Upon death, they shall descend into hell, with no hope of return. Their sins are too grave to recount.\n\nEven if such individuals are reborn, they shall perpetually suffer from illnesses, poverty, and hardship, never knowing peace. They shall be oppressed by officials, harmed by others, their lifespans cut short, and upon death, they shall enter the eternal night of the underworld, unknown to all. For a hundred kalpas, they shall endure punishment before regaining human form.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1515,
      "start_sentence": 0,
      "end_sentence": 58,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.83236026763916,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\太上老君说消灾经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "若能洗心易行，而得生也，若迷而不回者，而近於死也，将以长处恶道，无由重生也，今重告子，明慎之焉。 是时诸真大仙，欢喜踊跃，稽首而作颂曰： 道言甚微妙，普济度天人。 习者皆成道，背者悉殃身。 此经能消灾，荡秽绝嚣尘。 众生无智慧，违者信邪神。 死入寒冰苦，受罪甚艰辛。 回心归正道，方可受真身。 一心归仙路，乃得度天津。 永享无期寿，分形百万真。 九幽长披散，七祖离冥津。 自然天厨食，皆赖圣皇恩。 灵歌唱玄路，万劫保清真。 随世人人度，三真应圣皇。 五方而静默，道法渐时光。 似如人半日，妖魅入心藏。 阴阳或衰盛，百姓并饥荒。 真人将去世，混杂实难当。 潜龙欲重起，闭目在幽房。 狂人颠倒业，不久自遭殃。 沉沦地狱下，痛毒被刑伤。 皆由心邪见，致使受燋惶。 金刚令上道，威力破迷荒。 行歌而交泰，至道永开张。 风调而雨顺，五谷满盈仓。 四方皆宾伏，麟凤自呈祥。 明君时有道，万劫保年长。",
      "translated_text": "Should one purify the heart and reform their conduct, they may attain rebirth; but those who remain deluded and refuse to turn back draw near to death, destined to dwell eternally in evil realms, with no hope of rebirth. Now I solemnly admonish you—heed this warning well.\n\nAt that moment, the perfected immortals and great sages rejoiced and leapt with joy, bowing their heads in reverence and reciting these verses:\n\nThe Dao’s words are most subtle and wondrous,\nUniversally saving and delivering gods and humans.\nThose who cultivate shall all attain the Dao;\nThose who turn away shall bring calamity upon themselves.\nThis sutra can dispel disasters,\nWash away defilement, and sever the dust of clamor.\nYet beings, lacking wisdom,\nDefy it and believe in evil spirits.\nUpon death, they enter the suffering of freezing ice,\nEnduring bitter and arduous punishments.\nOnly by turning the heart to the true Dao\nCan one receive the true body.\nWith wholehearted devotion to the immortal path,\nOne may cross the celestial ford.\nForever enjoying boundless life,\nTheir forms multiply into a million perfected beings.\nThe Nine Dark Realms are forever cast open,\nAnd the seven generations of ancestors escape the gloomy ford.\nNaturally partaking of the celestial kitchen’s fare,\nAll depend on the sagely emperor’s grace.\nSinging sacred hymns along the mysterious path,\nFor ten thousand kalpas they preserve purity.\nDelivering all beings of this world,\nThe Three Perfected respond to the sagely emperor.\nThe five directions fall silent,\nAnd the Dao’s teachings gradually illuminate the age.\n\nIt is like a man at midday—\nYet demons and specters enter his heart’s storehouse.\nYin and yang may wane or wax,\nAnd the people all suffer famine.\nWhen the perfected one is about to depart,\nThe world’s chaos becomes truly unbearable.\nThe hidden dragon stirs once more,\nClosing its eyes in the secluded chamber.\nThe madman’s inverted karma\nWill soon bring misfortune upon himself.\nSinking into the depths of hell,\nHe suffers the agony of torture and wounds.\nAll stems from the perverse views of the heart,\nLeading to such scorching terror.\nThe Diamond Mandate commands the ascent to the Dao,\nIts mighty power shattering the wilderness of delusion.\nWith songs of harmony and peace,\nThe supreme Dao is forever revealed.\nWinds are harmonious and rains timely,\nThe five grains fill the overflowing granaries.\nThe four directions all submit in reverence,\nAnd qilin and phoenix naturally appear as auspicious signs.\nWhen the enlightened ruler upholds the Dao,\nFor ten thousand kalpas, the years shall be long.",
      "overlap_context": "eyond comprehension. Upon death, they shall descend into hell, with no hope of return. Their sins are too grave to recount.\n\nEven if such individuals are reborn, they shall perpetually suffer from illnesses, poverty, and hardship, never knowing peace. They shall be oppressed by officials, harmed by others, their lifespans cut short, and upon death, they shall enter the eternal night of the underworld, unknown to all. For a hundred kalpas, they shall endure punishment before regaining human form.",
      "start_char": 1515,
      "end_char": 1885,
      "start_sentence": 59,
      "end_sentence": 85,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.486217975616455,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\太上老君说消灾经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "老君谓尹喜曰：此经尊贵，乃众仙得真之要也，子今受吾之要，直须精专，内自保之，勿示非人，唯学仙道士，及善信男女，此可依经传受，明宣道法，令深慎科戒，勿使失时，今重告子曰，不得妄传，吾言甚秘，宜慎之焉。 喜即稽首跪拜受经。 是时诸真众仙闻说经毕，退席恭敬，侍立俄顷，有诸仙驾浮空而下，无鞅数众各捧香花，持符执节来诣道前，一时稽首，奉请老君还玉京。 老君於是欢喜临驾，重谓喜曰：吾当上升矣，子受此经，必成道矣。 喜即莽然悲涕，俯伏礼谢，忽失其所在，唯闻音乐震动山川，因仰面视诸龙驾，云炁旋远，五色鲜明，世之莫识，须臾渐远，隐而不见矣。 太上老君说消灾经竟",
      "translated_text": "Lord Lao addressed Yin Xi, saying: \"This scripture is most venerable, the essential key by which all immortals attain truth. You have now received my essential teaching—you must cultivate it with utmost dedication, preserve it within, and never reveal it to the unworthy. Only those who study the Daoist path, along with faithful men and women of good intent, may receive and transmit it according to its precepts. Clearly expound its methods, strictly observe its precepts and prohibitions, and take care not to miss the proper time. I now solemnly repeat: do not transmit it recklessly. My words are profoundly secret—guard them well.\"\n\nYin Xi then prostrated himself, knelt, and received the scripture.\n\nAt that moment, all the perfected immortals and assembled transcendents, having heard the scripture expounded, withdrew from their seats with reverence. After standing in attendance for a brief while, a multitude of immortals descended from the floating void, their number beyond count. Each bore incense and flowers, holding talismans and jade tablets, and came before the Dao. Together they bowed in unison, entreating Lord Lao to return to the Jade Capital.\n\nLord Lao, now joyfully preparing to ascend, addressed Yin Xi once more: \"I shall now rise on high. You, having received this scripture, will surely attain the Dao.\"\n\nYin Xi, overcome with sorrow and tears, prostrated himself in gratitude. Suddenly, Lord Lao vanished from sight. Only the resonant music shook the mountains and rivers. Looking up, he saw the dragon-drawn chariots, swirling clouds of qi receding into the distance, their five colors radiant and bright—unrecognizable to the world. In an instant, they grew ever more distant, until they faded from view.\n\nThus concludes *The Most High Lord Lao’s Scripture on Dispelling Disasters*.",
      "overlap_context": "t,\nLeading to such scorching terror.\nThe Diamond Mandate commands the ascent to the Dao,\nIts mighty power shattering the wilderness of delusion.\nWith songs of harmony and peace,\nThe supreme Dao is forever revealed.\nWinds are harmonious and rains timely,\nThe five grains fill the overflowing granaries.\nThe four directions all submit in reverence,\nAnd qilin and phoenix naturally appear as auspicious signs.\nWhen the enlightened ruler upholds the Dao,\nFor ten thousand kalpas, the years shall be long.",
      "start_char": 1886,
      "end_char": 2161,
      "start_sentence": 86,
      "end_sentence": 91,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.550876140594482,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\太上老君说消灾经.txt",
        "category": "本文类"
      }
    }
  ]
}