{
  "source_id": "太上登真三矫灵应经",
  "source_file": "chunked_daozang\\太上登真三矫灵应经.json",
  "total_chunks": 3,
  "total_original_chars": 2226,
  "total_translated_chars": 12102,
  "total_translation_time": 62.51373314857483,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\众术类\\太上登真三矫灵应经.txt",
    "category": "众术类"
  },
  "full_translation": "*The Supreme Scripture on Ascending to Perfection Through the Three Transmutations of Numinous Response*\n\n**Scripture Title:** *The Supreme Scripture on Ascending to Perfection Through the Three Transmutations of Numinous Response*. Author unknown. Base text from *The Orthodox Daoist Canon*, *Dongzhen* section, *Zhongshu* category.\n\n---\n\nFor all who study and cultivate the Dao of immortality, encountering the *Three Transmutations Scripture* enables entry into the wondrous Dao. It differs from all other methods and arts: when applied, it is swift as spark from stone, erected amidst mist and radiance, deployed like lightning—hastening one’s journey to the immortal isles.\n\nThe *Three Transmutations* are these: above, the *Dragon Transmutation*; at the center, the *Tiger Transmutation*; below, the *Deer Transmutation*. Those who face this teaching hold the hidden and secret scripture of the *Upper Clarity* palace.\n\nIn general, the Dao of immortal cultivation—when employing the *Dragon Transmutation*—allows one to ascend to heaven and descend into earth, to penetrate mountains and enter waters. Without this art, even spirits and gods cannot fathom it. It aids the devotee of the Dao, merging with the profound and obscure, and communing with the Great Dao.\n\nThe *Dragon Transmutation* is qi. Qi is the Dao. By gazing long upon the *Dragon Transmutation*, refining the body into qi, and uniting with the Dao in truth, one’s feet shall birth clouds. The *Dragon Transmutation* ensures that devotees of the Dao, when journeying to grotto-heavens and blessed lands, find no demon, specter, or malevolent entity daring to draw near. Wherever they traverse mountains, rivers, or prefectures, the local spirits come forth in audience.\n\nMaster Sun the Perfected said: “This method is most efficacious.”\n\nThe *Tiger Transmutation* is the mother of wind and the child of water. When practiced for three years, the tiger rides the wind to come and go, swift as withered leaves borne aloft by the breeze—gathering to form a shape, scattering to become wind, merging with the pure yang qi of heaven and earth into perfect oneness.\n\nMaster Liezi said: “If I cultivate this method, I shall naturally attain the Dao.” Those who receive it hereafter must not lightly disclose or leak it.\n\nThe *Deer Transmutation* is the constant Way. It aids devotees of the Dao, enabling them to travel a thousand *li* in a day. When encountering deer, one may gather magic mushrooms, for the deer naturally discerns their location and distance. Wherever the deer arrives at a place with magic mushrooms, after circling thrice, the mushrooms cannot flee. By harvesting and consuming them according to the method, one obtains the magic mushrooms and attains immortality without death. Without this method, the magic mushrooms cannot be ingested.\n\nThe scriptures of the Three Transmutations are the numinous texts of heaven and earth, the secret arts of divine immortals. If transmitted to the unworthy, one first brings calamity upon oneself, then annihilates nine generations of ancestors. An oath must be sworn before imparting them to those of virtue.\n\n**Entering the Method**\nFor those who practice the *Deer Transmutation*, first bathe in fragrant water for three days. Then, on the night of an *jiǎzǐ* or *gēngshēn* day at midnight, set up a small altar—regardless of size or height—with one lamp, one incense burner, three flowers, and eighty-one stalks of white cogon grass spread upon it. Place seven peach leaves, then light the incense and declare: “Disciple of [prefecture, subprefecture, county], [name], by nature inclined toward purity and emptiness, yearns for the Great Dao. Now I beseech the Great Emperor of the Dipper to grant a mist-and-cloud white deer to assist my cultivation, accumulate merit, and save sentient beings.” Then take a talisman of the Jade Emperor, hold it in the mouth, and recite the incantation seven times:\n\n*White deer, white deer, bearing flowers and fruit,*\n*The Jade Emperor commands you to come to my home.*\n*Hasten, hasten, as the law commands!*\n\nAfter reciting the incantation, banish all distracting thoughts and focus the mind entirely on envisioning oneself as the Jade Emperor. Then imagine a white deer arriving on the altar from the void, bearing flowers and fruit. Receive the flowers and fruit, and with the hand, regulate the breath. After twenty-four breaths, the deer is complete; then dismiss the vision.\n\nPractice this for thirty days, imagining the white deer resting within one’s embrace upon the ground. After eighty-one breaths, dismiss it. After forty-nine days of full practice, maintain the vision for three days, and the deer will come and go within the hermitage. After thirty more days, one may freely roam the world, running as swiftly as a galloping horse, covering a thousand *li* in a day, traversing as if flying. Entering mountains to gather magic mushrooms, one moves without hindrance.\n\nIn general, when employing the *Deer Transmutation*, one must conceal it with an object. Use a bamboo pole: take fine bamboo, prepare a covering, and inscribe the character for “horse” upon it. Seal it within the bamboo, and the deer will be unable to see it. Ordinary people will perceive only a bamboo pole, while the practitioner alone sees a white deer. Alternatively, use white chaste tree wood, inscribe the character for “horse” upon it, and seal it—never letting others see it. When inscribing the character, first recite the previous incantation, envision the deer, draw in a breath of *qi*, and blow it upon the brush before writing.\n\n**For the *Tiger Transmutation***\nFirst observe a seven-day fast. On the night of a *gēngyín* day at midnight, establish an altar—square below and round above, twelve *chi* on each side, three *chi* in height—marking the boundary with ash. Place seven lamps upon it, one incense burner, seven portions of dried venison, and a handful of white cogon grass. Arrange everything properly, then light the incense and pray: “Disciple of [place], [name], by nature inclined toward purity and entering the Dao, now beseeches the Jade Emperor to grant a wind-cliff fierce tiger to serve as my mount, assisting my cultivation and delivering sentient beings.” Then take a talisman of the Jade Emperor, hold it in the mouth, and recite the incantation:\n\n*Mysterious mechanism of *gēng* and *xīn*, wind-tiger general,*\n*By the Three Heavens’ decree, come to bear me.*\n*Hasten, hasten, as the Jade Emperor’s law commands!*\n\nAfter reciting the incantation, calm the mind, guard oneness, and exclude all external affairs. With gentle, unbroken breath, focus the mind and envision a white tiger arriving from the west upon the altar. Envision it, then stroke its crown with the hand. After forty-nine breaths, dismiss the vision. At night, proceed as before.\n\nAfter sixty full days, a tiger will naturally come to one’s side. No other object is needed to control it, for heaven bestows the complete *qi*, and accomplishment comes naturally. Unaware, the body becomes light and rises over a hundred *zhang* from the earth—do not be startled or afraid. Roam the great void and journey to grotto-heavens and blessed lands; demons, specters, and heterodox entities dare not interfere. Wherever one goes, local spirits will come forth in audience.\n\nIf practiced for three years, the body naturally rides the wind, moving like withered leaves, merging with the Dao and uniting with the true *qi*. Master Liezi said: “If transmitted to the unworthy, one first destroys oneself, then brings calamity upon nine generations of ancestors.” This warning is not empty.\n\nTo summon the coiling dragon, one must choose the second day of the first lunar month, specifically an *jiǎyín* day. Draw the Eight Trigrams in their respective positions, arrange nine lamps, and prepare a wooden board of autumn wood, two *cun* and four *fen* in width (corresponding to the numbers of heaven and earth) and four *cun* and four *fen* in length. On the board, inscribe in cinnabar the six characters: \"Jade Emperor, save my life and summon the dragon.\" Also, stamp the Jade Emperor’s seal in cinnabar on paper and affix it to the board. Place the board over a basin of water, and tie a mirror to it so that its reflection shines upon the water’s surface. Cut a red dragon from fine paper, nine *cun* in length, regardless of width, and place it at the center of the water, ensuring the surface remains undisturbed. The dragon must not drift onto the board; instead, use the mirror to reflect its form into the glass.\n\nAfter reflection, recite the incantation:\n*\"Nine heavens, nine earths, enter my mirror.\nReflect and appear at once, ride the great void.\nRefine my body whole, unite with the Dao and truth.\nHasten, hasten, as decreed by law and command!\"*\n\nRecite this incantation nine times while visualizing the red dragon on the water’s surface, riding like fiery clouds within the mirror. Perform this recitation once daily from the *jiǎyín* day in the first lunar month through the following six *jiǎ* days, completing nine uninterrupted recitations. Thereafter, the dragon may be freely commanded. For timing, the *chéng* or *kāi* days are most auspicious. When invoking the dragon, first recite the incantation nine times, then face south to draw nine breaths of *qi* into the abdomen.\n\nAfterward, use the mirror to reflect the image, and a red dragon will instantly appear beneath you, roaming the eight directions, ascending to heaven and descending to earth, entering stone caves without obstruction, moving as freely as the great void. Neither water nor fire can harm you, and no poison will afflict you. To halt the dragon, it will sense your intent—stopping when you wish, rising when you command. Even a journey of ten thousand *li* will be as swift as a spark from flint. After eighty-one repetitions of this practice, the mirror and board will no longer be needed.\n\nThe mirror must be buried at the *xū* hour on a *bǐngwǔ* day in a *qián* (northwest) location, nine *cun* deep, and left undisturbed. The board should be buried at the *chǒu* hour on a *wùxū* day in the *Gōuchén* (center) courtyard, one *chi* and two *cun* deep. Thereafter, use only the Jade Emperor’s seal: stamp it in cinnabar on paper, burn the paper to ash, mix with well water, and consume it. After eighty-one days, when the *qi* is fully cultivated, write a green talisman and burn it with the seal. From then on, the dragon will arrive at your call without need of any implements.\n\nIf one rides the dragon for three years, they will unite with the Dao and true *qi*, coalescing into form when gathered and dissolving into *qi* when dispersed. Thus it is said: \"Longevity aligns with the single *qi*, and life equals the great void.\" The ancient perfected ones all relied on this talismanic scripture to ascend to truth.\n\nThis text must not be recklessly transmitted. Those who carelessly reveal this celestial treasure to the unworthy will bring calamity upon seven generations of ancestors. Even those who guard it in secret must beware, for the consequences are no trifling matter. Hold it in reverence and preserve it well.\n\n**Jade Emperor’s Seal Design**\nCarve the seal from *léijīng* jujube wood for optimal efficacy. Begin on a *tiānhé* day, making it one *cun* and two *fen* square and nine *fen* thick. Complete the carving on a *chéng* day, then on a *gēngshēn* day at midnight, purify the space with incense, wine, and fruit offerings—no meat or strong flavors. Place the seal on an altar with nine lamps and a tablet inscribed with the Jade Emperor’s name. Perform the ritual until the *chǒu* hour, then store the seal in a yellow silk pouch.\n\nWhen using the seal, follow the aforementioned method. After obtaining it, one must constantly aid the distressed, relieve suffering, assist the orphaned, the poor, the elderly, and the young, and show compassion to all in illness. Through such cultivation, divine efficacy will swiftly manifest.\n\n*Scripture of the Three Wondrous Dragon Summonings for Ascending to Perfection, by the Most High, Concluded.*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上登真三矫灵应经 经名：太上登真三矫灵应经。 撰人不详。 底本出处：《正统道藏》洞真部众街类。 太上登真三矫灵应经 凡学修仙道，遇三娇经能入妙道，与诸法不同，与诸术不同，用之如石火，立之於姻霞，施之於电光，速游仙岛矣。 夫三娇经者，上则龙矫，中则虎娇，下则鹿娇。 如此向者，是上清宫内隐秘之书。 大凡学仙之道，用龙娇者，龙能上天入地，穿山入水，不出此术，鬼神莫能测，能助奉道之士，混合杳冥，通大道也。 夫龙矫者，气也。 气者，道也。 长视龙娇，炼身为气，与道合真，足生云也。 龙娇者，奉道之士，欲游洞天福地，一切邪魔精怪恶物不敢近。 每去山川、江河、州府，到处自由神祇来朝现。 孙真人云：此法甚灵验矣。 夫虎娇者，风之母，水之子，用之三载，其虎自乘风来来往往，如风动败叶飞空，聚则为形，散则为风，与天地正阳之炁混合为一一了也。 列子云：吾将此法习之，自然成道矣。 后受之士，勿得轻漏泄耳。",
      "translated_text": "*The Supreme Scripture on Ascending to Perfection Through the Three Transmutations of Numinous Response*\n\n**Scripture Title:** *The Supreme Scripture on Ascending to Perfection Through the Three Transmutations of Numinous Response*. Author unknown. Base text from *The Orthodox Daoist Canon*, *Dongzhen* section, *Zhongshu* category.\n\n---\n\nFor all who study and cultivate the Dao of immortality, encountering the *Three Transmutations Scripture* enables entry into the wondrous Dao. It differs from all other methods and arts: when applied, it is swift as spark from stone, erected amidst mist and radiance, deployed like lightning—hastening one’s journey to the immortal isles.\n\nThe *Three Transmutations* are these: above, the *Dragon Transmutation*; at the center, the *Tiger Transmutation*; below, the *Deer Transmutation*. Those who face this teaching hold the hidden and secret scripture of the *Upper Clarity* palace.\n\nIn general, the Dao of immortal cultivation—when employing the *Dragon Transmutation*—allows one to ascend to heaven and descend into earth, to penetrate mountains and enter waters. Without this art, even spirits and gods cannot fathom it. It aids the devotee of the Dao, merging with the profound and obscure, and communing with the Great Dao.\n\nThe *Dragon Transmutation* is qi. Qi is the Dao. By gazing long upon the *Dragon Transmutation*, refining the body into qi, and uniting with the Dao in truth, one’s feet shall birth clouds. The *Dragon Transmutation* ensures that devotees of the Dao, when journeying to grotto-heavens and blessed lands, find no demon, specter, or malevolent entity daring to draw near. Wherever they traverse mountains, rivers, or prefectures, the local spirits come forth in audience.\n\nMaster Sun the Perfected said: “This method is most efficacious.”\n\nThe *Tiger Transmutation* is the mother of wind and the child of water. When practiced for three years, the tiger rides the wind to come and go, swift as withered leaves borne aloft by the breeze—gathering to form a shape, scattering to become wind, merging with the pure yang qi of heaven and earth into perfect oneness.\n\nMaster Liezi said: “If I cultivate this method, I shall naturally attain the Dao.” Those who receive it hereafter must not lightly disclose or leak it.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 393,
      "start_sentence": 0,
      "end_sentence": 17,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.484521389007568,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\众术类\\太上登真三矫灵应经.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "夫鹿娇者，常也。 能助奉道之士，日行千里。 遇鹿者，能采灵芝，自知其方位远近。 鹿到有灵芝处地上，其鹿自经三遭，其芝草自不能走之。 而依法采食，其灵芝自得，长生不死。 如不得此法，其灵芝不能服矣。 夫三娇之经，是天地之灵文，神仙之秘术，若传非人，先殃一身，后灭九祖，须立盟誓，方可传之与有德之人也。 入法 凡持鹿娇者，先须香汤沐浴三日，然后於甲子庚申日夜半时，明立小坛子，不论大小高下，用灯一盏，香一炉，花三朵，白茆草用八十一根，铺在坛上，桃叶用七个，然后焚香，具某府州县姓名，弟子性好清虚，志慕大道，今斗告大帝，乞烟霞白鹿一只，与弟子助道，积行救人然后将玉帝印一道，含放口内，念咒七遍。 咒曰： 白鹿白鹿含花果，玉帝命立至吾家。 急急如律令敕。 右念此咒讫，后心不生二念，俱舍一心存想自己身为玉帝，又想白鹿一只，后乘空而来於坛上，含花果而来与自己。 收之花果，用手摩息，其鹿二十四息而足，去之，不存想。 如此行持三十日，想如白鹿在怀裹卧地，满八十一息去之。 如满四十九日足，存三日，则在庵室中往来。 下三十日满后，一任周游行於天下，走及奔马，日行千里，往来如飞，入山采灵芝，自在无忌。 大凡用鹿娇，须用一物隐之。 可用竹竿子，即用好竹安幕，幕上书马字一个，在竹内封之了当，其鹿入不能见之，常人只见是竹竿子，自见是白鹿一只。 或白荆木，亦得中书马字一个，在木上封了，不可教人见之。 凡书字时，亦念前咒一遍，想鹿，取炁一口，吹在笔上，后书其字。 凡用虎娇者，先当斋戒七日，於庚寅日夜半子时立坛，下方上圆，地方一丈二尺，天圆三尺，用灰为界，道上安灯七盏，香一炉，鹿脯七分，白茆草一握。 安排了当，然后焚香告祝，某处姓名甲，弟子性好清虚入道今告玉帝愿赐风岩猛虎一只，与弟子乘骑，奉道济度生灵。 然后将玉帝印一道，含於口内，后念咒曰： 庚辛妙机风虎将，三天敕命及吾乘。 急急如玉帝律令敕。 咒毕，清心守一，屏除外事，鼻息绵绵，心思注想白虎一只，从西而来到坛上。 想之，用手摩之顶门，四十九息远之。 至夜，一依前法为之。 满六十日足，自有虎一只，来於胯下，更不用别物持之，天赐全炁，自然成就，不觉身轻离地百余丈，勿得惊怖，游太空及游洞天福地，精怪外道不敢相干，到处自有神祇来朝现。 若用之三年，身自得乘风，动如败叶，令与道合真也，与正炁合一也。 列子云：非人相传，先灭一身，后殃九祖。 决不虚矣。",
      "translated_text": "The *Deer Transmutation* is the constant Way. It aids devotees of the Dao, enabling them to travel a thousand *li* in a day. When encountering deer, one may gather magic mushrooms, for the deer naturally discerns their location and distance. Wherever the deer arrives at a place with magic mushrooms, after circling thrice, the mushrooms cannot flee. By harvesting and consuming them according to the method, one obtains the magic mushrooms and attains immortality without death. Without this method, the magic mushrooms cannot be ingested.\n\nThe scriptures of the Three Transmutations are the numinous texts of heaven and earth, the secret arts of divine immortals. If transmitted to the unworthy, one first brings calamity upon oneself, then annihilates nine generations of ancestors. An oath must be sworn before imparting them to those of virtue.\n\n**Entering the Method**\nFor those who practice the *Deer Transmutation*, first bathe in fragrant water for three days. Then, on the night of an *jiǎzǐ* or *gēngshēn* day at midnight, set up a small altar—regardless of size or height—with one lamp, one incense burner, three flowers, and eighty-one stalks of white cogon grass spread upon it. Place seven peach leaves, then light the incense and declare: “Disciple of [prefecture, subprefecture, county], [name], by nature inclined toward purity and emptiness, yearns for the Great Dao. Now I beseech the Great Emperor of the Dipper to grant a mist-and-cloud white deer to assist my cultivation, accumulate merit, and save sentient beings.” Then take a talisman of the Jade Emperor, hold it in the mouth, and recite the incantation seven times:\n\n*White deer, white deer, bearing flowers and fruit,*\n*The Jade Emperor commands you to come to my home.*\n*Hasten, hasten, as the law commands!*\n\nAfter reciting the incantation, banish all distracting thoughts and focus the mind entirely on envisioning oneself as the Jade Emperor. Then imagine a white deer arriving on the altar from the void, bearing flowers and fruit. Receive the flowers and fruit, and with the hand, regulate the breath. After twenty-four breaths, the deer is complete; then dismiss the vision.\n\nPractice this for thirty days, imagining the white deer resting within one’s embrace upon the ground. After eighty-one breaths, dismiss it. After forty-nine days of full practice, maintain the vision for three days, and the deer will come and go within the hermitage. After thirty more days, one may freely roam the world, running as swiftly as a galloping horse, covering a thousand *li* in a day, traversing as if flying. Entering mountains to gather magic mushrooms, one moves without hindrance.\n\nIn general, when employing the *Deer Transmutation*, one must conceal it with an object. Use a bamboo pole: take fine bamboo, prepare a covering, and inscribe the character for “horse” upon it. Seal it within the bamboo, and the deer will be unable to see it. Ordinary people will perceive only a bamboo pole, while the practitioner alone sees a white deer. Alternatively, use white chaste tree wood, inscribe the character for “horse” upon it, and seal it—never letting others see it. When inscribing the character, first recite the previous incantation, envision the deer, draw in a breath of *qi*, and blow it upon the brush before writing.\n\n**For the *Tiger Transmutation***\nFirst observe a seven-day fast. On the night of a *gēngyín* day at midnight, establish an altar—square below and round above, twelve *chi* on each side, three *chi* in height—marking the boundary with ash. Place seven lamps upon it, one incense burner, seven portions of dried venison, and a handful of white cogon grass. Arrange everything properly, then light the incense and pray: “Disciple of [place], [name], by nature inclined toward purity and entering the Dao, now beseeches the Jade Emperor to grant a wind-cliff fierce tiger to serve as my mount, assisting my cultivation and delivering sentient beings.” Then take a talisman of the Jade Emperor, hold it in the mouth, and recite the incantation:\n\n*Mysterious mechanism of *gēng* and *xīn*, wind-tiger general,*\n*By the Three Heavens’ decree, come to bear me.*\n*Hasten, hasten, as the Jade Emperor’s law commands!*\n\nAfter reciting the incantation, calm the mind, guard oneness, and exclude all external affairs. With gentle, unbroken breath, focus the mind and envision a white tiger arriving from the west upon the altar. Envision it, then stroke its crown with the hand. After forty-nine breaths, dismiss the vision. At night, proceed as before.\n\nAfter sixty full days, a tiger will naturally come to one’s side. No other object is needed to control it, for heaven bestows the complete *qi*, and accomplishment comes naturally. Unaware, the body becomes light and rises over a hundred *zhang* from the earth—do not be startled or afraid. Roam the great void and journey to grotto-heavens and blessed lands; demons, specters, and heterodox entities dare not interfere. Wherever one goes, local spirits will come forth in audience.\n\nIf practiced for three years, the body naturally rides the wind, moving like withered leaves, merging with the Dao and uniting with the true *qi*. Master Liezi said: “If transmitted to the unworthy, one first destroys oneself, then brings calamity upon nine generations of ancestors.” This warning is not empty.",
      "overlap_context": "od is most efficacious.”\n\nThe *Tiger Transmutation* is the mother of wind and the child of water. When practiced for three years, the tiger rides the wind to come and go, swift as withered leaves borne aloft by the breeze—gathering to form a shape, scattering to become wind, merging with the pure yang qi of heaven and earth into perfect oneness.\n\nMaster Liezi said: “If I cultivate this method, I shall naturally attain the Dao.” Those who receive it hereafter must not lightly disclose or leak it.",
      "start_char": 394,
      "end_char": 1384,
      "start_sentence": 18,
      "end_sentence": 50,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.59807252883911,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\众术类\\太上登真三矫灵应经.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "夫龙矫者，当於正月二日，择甲寅日，画八卦在八方位上，用灯九盏，秋木板子一片，阔二寸四分，以应天地之数，长四寸四分，於板上朱书六字：玉帝救命召龙。 并用朱砂，印玉帝印一颗於纸上，贴在板上，着在水盆上，用镜一面系於板上，底下照於水面上，用好纸剪赤龙一条，长九寸，不拘大小，於水心中内安放，不得令教水面动游，走板子上，用明镜照之，龙形入於镜中。 照之后，念咒曰： 九天九地，入吾镜中。 照之立现，乘骑太空。 炼吾一体，与道合真。 急急如律令奉敕。 化冲和念前咒九遍，然后存想水面上赤龙乘骑，如火云入於镜中来往也。 如此念咒九遍，一日念一遍，从正月中后甲寅日於头到六甲日九遍不绝，然后任便役使。 如用日辰，成开日为妙。 如用时，先念前咒九遍，向南方取炁九口，咽於腹中。 然后用镜照之，立有赤龙自於胯下，巡游八极，上天入地，入石穴无碍，处如太空，入水火不能伤身，百毒不害。 如要止，其龙知人其意，止便止，起则便起，万里如石中火落早到也。 依此行持，八十一度已后，更不用镜并板子也。 其镜须丙午日戌时，埋於乾地，入地九寸，埋之不用也。 其板子於戊戌日丑时，埋在勾陈地中庭是也，入地一尺二寸埋了。 然后只用玉帝印，用朱砂印之於纸上，烧灰，用井花水调，吞之，八十一日炁足后，又书青一道，与都印烧之。 已后任意呼召，其龙立至，不用诸物也。 如要乘骑三年，与道合真，聚则成形，散则成炁。 故曰：寿同一炁，命等太虚也。 上古真人，皆须此符经，而登真矣。 此书不可乱传，非人而轻泄天宝者，殃及七祖。 得人而秘之者，祸亦非浅矣。 敬之保之哉。 玉帝印式 右用雷惊枣木，为之极妙，可取天合日雕，方阔一寸二分，厚九分。 於成日造毕，至庚申日夜半子时，用香、酒、果斋洁，志心祭之，不用肉荤。 其印可安放於案上，用灯九盏，及牌位上书。 玉帝位前，放印祭之，至丑时，黄绢袋子盛之。 其印如要用之时，如前作法用之。 自持之后，常行扶危拔苦，救济孤贫老幼，一切疾患慈念。 如此修持，立有神验矣。 太上登真三矫灵应经竟",
      "translated_text": "To summon the coiling dragon, one must choose the second day of the first lunar month, specifically an *jiǎyín* day. Draw the Eight Trigrams in their respective positions, arrange nine lamps, and prepare a wooden board of autumn wood, two *cun* and four *fen* in width (corresponding to the numbers of heaven and earth) and four *cun* and four *fen* in length. On the board, inscribe in cinnabar the six characters: \"Jade Emperor, save my life and summon the dragon.\" Also, stamp the Jade Emperor’s seal in cinnabar on paper and affix it to the board. Place the board over a basin of water, and tie a mirror to it so that its reflection shines upon the water’s surface. Cut a red dragon from fine paper, nine *cun* in length, regardless of width, and place it at the center of the water, ensuring the surface remains undisturbed. The dragon must not drift onto the board; instead, use the mirror to reflect its form into the glass.\n\nAfter reflection, recite the incantation:\n*\"Nine heavens, nine earths, enter my mirror.\nReflect and appear at once, ride the great void.\nRefine my body whole, unite with the Dao and truth.\nHasten, hasten, as decreed by law and command!\"*\n\nRecite this incantation nine times while visualizing the red dragon on the water’s surface, riding like fiery clouds within the mirror. Perform this recitation once daily from the *jiǎyín* day in the first lunar month through the following six *jiǎ* days, completing nine uninterrupted recitations. Thereafter, the dragon may be freely commanded. For timing, the *chéng* or *kāi* days are most auspicious. When invoking the dragon, first recite the incantation nine times, then face south to draw nine breaths of *qi* into the abdomen.\n\nAfterward, use the mirror to reflect the image, and a red dragon will instantly appear beneath you, roaming the eight directions, ascending to heaven and descending to earth, entering stone caves without obstruction, moving as freely as the great void. Neither water nor fire can harm you, and no poison will afflict you. To halt the dragon, it will sense your intent—stopping when you wish, rising when you command. Even a journey of ten thousand *li* will be as swift as a spark from flint. After eighty-one repetitions of this practice, the mirror and board will no longer be needed.\n\nThe mirror must be buried at the *xū* hour on a *bǐngwǔ* day in a *qián* (northwest) location, nine *cun* deep, and left undisturbed. The board should be buried at the *chǒu* hour on a *wùxū* day in the *Gōuchén* (center) courtyard, one *chi* and two *cun* deep. Thereafter, use only the Jade Emperor’s seal: stamp it in cinnabar on paper, burn the paper to ash, mix with well water, and consume it. After eighty-one days, when the *qi* is fully cultivated, write a green talisman and burn it with the seal. From then on, the dragon will arrive at your call without need of any implements.\n\nIf one rides the dragon for three years, they will unite with the Dao and true *qi*, coalescing into form when gathered and dissolving into *qi* when dispersed. Thus it is said: \"Longevity aligns with the single *qi*, and life equals the great void.\" The ancient perfected ones all relied on this talismanic scripture to ascend to truth.\n\nThis text must not be recklessly transmitted. Those who carelessly reveal this celestial treasure to the unworthy will bring calamity upon seven generations of ancestors. Even those who guard it in secret must beware, for the consequences are no trifling matter. Hold it in reverence and preserve it well.\n\n**Jade Emperor’s Seal Design**\nCarve the seal from *léijīng* jujube wood for optimal efficacy. Begin on a *tiānhé* day, making it one *cun* and two *fen* square and nine *fen* thick. Complete the carving on a *chéng* day, then on a *gēngshēn* day at midnight, purify the space with incense, wine, and fruit offerings—no meat or strong flavors. Place the seal on an altar with nine lamps and a tablet inscribed with the Jade Emperor’s name. Perform the ritual until the *chǒu* hour, then store the seal in a yellow silk pouch.\n\nWhen using the seal, follow the aforementioned method. After obtaining it, one must constantly aid the distressed, relieve suffering, assist the orphaned, the poor, the elderly, and the young, and show compassion to all in illness. Through such cultivation, divine efficacy will swiftly manifest.\n\n*Scripture of the Three Wondrous Dragon Summonings for Ascending to Perfection, by the Most High, Concluded.*",
      "overlap_context": " the great void and journey to grotto-heavens and blessed lands; demons, specters, and heterodox entities dare not interfere. Wherever one goes, local spirits will come forth in audience.\n\nIf practiced for three years, the body naturally rides the wind, moving like withered leaves, merging with the Dao and uniting with the true *qi*. Master Liezi said: “If transmitted to the unworthy, one first destroys oneself, then brings calamity upon nine generations of ancestors.” This warning is not empty.",
      "start_char": 1385,
      "end_char": 2212,
      "start_sentence": 51,
      "end_sentence": 83,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.43113923072815,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\众术类\\太上登真三矫灵应经.txt",
        "category": "众术类"
      }
    }
  ]
}