{
  "source_id": "太上洞渊三昧神咒斋忏谢仪",
  "source_file": "chunked_daozang\\太上洞渊三昧神咒斋忏谢仪.json",
  "total_chunks": 8,
  "total_original_chars": 7137,
  "total_translated_chars": 46657,
  "total_translation_time": 243.4774887561798,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\威仪类\\太上洞渊三昧神咒斋忏谢仪.txt",
    "category": "威仪类"
  },
  "full_translation": "**The Supreme Cavern-Abyss Samādhi Divine Incantation Ritual for Fasting, Repentance, and Thanksgiving**\n\n**Scripture Title:** *The Supreme Cavern-Abyss Samādhi Divine Incantation Ritual for Fasting, Repentance, and Thanksgiving*\nCompiled by Du Guangting of the Tang Dynasty. One fascicle.\nSource of the base text: *Daoist Canon of the Zhengtong Era*, *Dongxuan* Section, *Weiyi* (Ritual Propriety) Category.\n\n---\n\n**The Supreme Cavern-Abyss Samādhi Divine Incantation Ritual for Fasting, Repentance, and Thanksgiving**\nRevised and edited by Master Guangcheng, Du Guangting\n\n**Repentance Formula**\n\nWe, your disciples, wholeheartedly take refuge and reverently bow to the Eastern Infinite Supreme Perfected Most High Supreme Unity Lord, the Three Caverns’ Heavenly Worthies.\n\nNext, facing east, perform three bows and conclude the repentance.\n\nWe, disciples [so-and-so], respectfully perform for the [such-and-such] household the divine incantation ritual, reciting the scripture of the wondrous divine incantation and practicing the Dao.\n\nFirst, we offer thanks for transgressions and sever demonic pestilence.\nWe pray for the peace of the state and household, and the protection of the people.\nWe burn incense and light lamps, contemplating the spirits and invoking the Perfected.\nWe dedicate our bodies, spirits, and lives to the Eastern Supreme Mysterious Elder, the Supreme Cavern-Abyss Samādhi Divine Incantation Three Caverns’ Heavenly Worthies, and all divine spirits.\n\nWe look up in gratitude to the Eastern Nine *Qi* Azure Heaven, the Grand Clarity Mysterious Origin Supreme Three Heavens’ Infinite Great Dao Supreme Lord Lao, the Supreme Elder, Heavenly Thearch Lord, Heavenly Thearch Elder, Great Thearch Lord, Supreme August Elder, the Thirty-Nine Perfected and Seventy-Two Sages of the Lofty Mysterious True Lords, the Nine Elders of the Immortal Metropolis, the Nine *Qi* Elder, the Primordial Azure Perfected of the Eastern Florescence, Jade Treasure High Dawn Grand Minister of War and Prime Minister Azure Youth Lord, the Primordial Elder Master of Immortal Perfected, the countless myriad layers of Dao *qi* and the Twelve Hundred Official Lords, the Azure Thearch of the Nine *Qi* Jade Gate Divine Immortals under the Great Clarity Jade Palace, the Four Bureau Perfected, and all the supremely sagely great deities of the heavens.\n\nWe look down in gratitude to the Eastern Realm of the Infinite World beneath the earth, the divine immortals and true perfected of the Five Marchmounts and Four Watercourses.\n\nWe beseech forgiveness and absolution for the [such-and-such] household, the patriarchal kin of both the living and the deceased.\nFor the seven emotions and five desires, the ten evils and six roots,\nthe accumulated sins and transgressions, boundless and immeasurable,\nfrom this day forth, we repent and offer thanks, hoping all may be cleansed and eradicated.\nMay the household and kin of [so-and-so] enjoy prolonged fortune and life, and the safety of their dwelling.\n\nWe humbly pray that the Supreme One bestow grace, commanding the King of the Samādhi Incantation, the Celestial Warriors of the Nine Heavens, the Divine Soldiers of the Five Thearchs, the Maidens of the Ten Directions, the Red Bow Great Host, to capture and destroy the Red-Headed Ones, slay the Imprisoned Abundant Children, and eradicate all rampant pestilence, warfare, famine, epidemics, plagues, ghosts, and bandits.\nMay the true *qi* suffuse and refine, the primordial essence nourish and adorn, all beings enjoy peace, and all share in the Great Peace.\n\nWe prostrate and take refuge, praying for the gift of life and creation.\nProclaim the divine decree with awe-inspiring majesty, and carry out the divine incantation.\n\n**Next, the prayer is recited:**\n\nThis exorcism incantation is recited in the manner of the *Guardian Spirit Incantation*.\nProclaim it with solemn and resounding authority, strictly commanding the ten directions to join in repentance.\nStand and recite this, declaring the divine decree with awe-inspiring majesty, so that spirits and ghosts may obey.\nThis must not be neglected.\n\nThe Dao says: In the Five Defiled Worlds, those who uphold the Three Caverns’ scriptures—\nI dispatch celestial soldiers to follow and guard their forms.\nBanish the ten-thousand-fathom ghosts of illness, driving them far from the gates and courtyards.\nSeize and eliminate the five-colored *qi*, preventing all from spreading.\nOfficial matters shall be resolved, and the sick shall recover with clarity.\nShould any dare disobey this command, the Demon King shall capture and behead them.\n\n**Next, the hymn is recited:**\n\nChant the hymn as in the *Step-in-Void* recitation.\nCircumambulate once, uniting the ten directions.\n\nIn the eastern realm of *Fuyuti*, Goumang flourishes in azure hue.\nBrahmā maidens wander the great void, their eight tones brushing the Jade Capital.\nThe Great Vehicle transcends the world, the Ten Perfected sport in the Purple Court.\nEstablishing blessings through the named fast, the long night is wholly illuminated.\nThe drum of the true Dao resounds, all demons are overthrown and toppled.\nThe Demon King comes to bow in submission, daring not to test but to be slain.\nIn the distant Eastern Florescence Heaven, nine dragons in cloud chariots welcome.\nGood spirits come to guard the gates, warriors and myriad spirits converge.\nKin may thus abide in peace, no ghost dares to listen.\nTogether we magnify the supreme traces, journeying to the Purple Phoenix City.\n\nWith wholehearted devotion, we take refuge and reverently bow to the Southern Infinite Supreme Perfected Most High Supreme Unity Lord, the Three Caverns’ Heavenly Worthies.\n\nNext, facing south, perform three bows and conclude the repentance.\n\nWe, disciples [so-and-so], respectfully perform for the [such-and-such] household the divine incantation ritual, reciting the scripture of the wondrous divine incantation and practicing the Dao.\n\nFirst, we offer thanks for transgressions and sever demonic pestilence.\nWe pray for the peace of the state and household, and the protection of the people.\nWe burn incense and light lamps, contemplating the spirits and invoking the Perfected.\nWe dedicate our bodies, spirits, and lives to the Southern Supreme Mysterious Elder, the Supreme Cavern-Abyss Samādhi Divine Incantation Three Caverns’ Heavenly Worthies, and all divine spirits.\n\nWe look up in gratitude to the Southern Three *Qi* Cinnabar Heaven, the Supreme Clarity Southern Culmen August Supreme Lord Lao, the Cavern Numinous Jade Thearch, the Upper Prime Controller, the Three Primes’ Sages, the Primordial Elder Mysterious Perfected, the Myriad Blessings Elder, the Southern Prosperity Upper Palace Life-Administering Minister of War, the Supreme Ultimate Perfected, the Grand Harmony Elder, the Mysterious Harmony Heavenly Red Thearch, the Cinnabar Numinous Lofty Immortals and Myriad Perfected, and all the supremely sagely great deities of the heavens.\n\nWe look down in gratitude to the Southern Realm of the Infinite World beneath the earth, the divine immortals and true perfected of the Five Marchmounts and Four Watercourses.\n\nWe beseech forgiveness and absolution for the [such-and-such] household, for the sins of the three karmas and six emotions, and the transgressions of violating scriptures and precepts.\nMay the myriad categories and thousand conditions all be resolved.\nMay the living and deceased of the [such-and-such] household enjoy steadfast auspiciousness, and all calamities and epidemics be forever dispelled.\n\nWe humbly pray that the Most High may bestow grace, commanding the maidens of the ten directions, the Celestial Ding warriors, the Black-Mystery Heavenly Slayer Great Soldiers, the Red Conscript Lesser Officers, the Masters of the Ten Directions, to seize and expel the demonic plague chieftain Wei Duqiao, the Wutu Lunna Wuhuan ghosts, and all their subordinate minor spirits. Release all afflictions—illnesses, chills and fevers, pestilential malaria, cholera with vomiting and diarrhea, and every kind of malevolent specter, disaster, and epidemic ghost—driving them swiftly into dispersal. Gather the poisons and withdraw the pestilence, returning each to its proper place. May the people’s sufferings and hardships all be cured and dispelled. May the true qi suffuse and nourish, the primordial harmony foster and nurture, and the myriad people rejoice in peace. May all receive the bounty of the Dao’s grace, as we proclaim the divine incantation.\n\nThe incantation declares:\nThe Dao commands all spirits,\nDemon sons and demon daughters,\nWhoever receives Our scripture,\nYou must aid and protect them.\nLet the Four Spirits not approach,\nMake the hundred ghosts swiftly depart.\nMeng Da seizes plague and disaster,\nBorn as if freed from the snares of the world.\nOfficials dissolve illness and remove it,\nWe shall promote and exalt you.\nIf you still dare harm people,\nThe true qi will naturally shield them.\n\nNext, the hymn intones:\nThe Lord of the Southern Flame Thearch,\nWhose eight frontiers are called Jambudvīpa,\nRides a flying chariot drawn by cloud-borne steeds,\nAs the Ten Perfected Immortals wander.\nThe Mysterious Woman sings upon the clouds,\nHer golden radiance overflowing her cinnabar form.\nToday the Dharma-wheel turns,\nIts Brahmanic resonance shaking the nine peaks.\nThe Heavenly King commands the demon soldiers,\nThe winds cease and the rains naturally subside.\nResplendent, the Three Luminaries shine,\nWhile all evil spirits deeply conceal themselves.\nShould any dare to test this,\nThe sword-bearing warriors shall sever their heads.\nDemon kings and myriad demon princes,\nGhost-slayers shall come to execute them.\nAs the great fast and mighty spirits arise,\nThe demons and specters are gathered in turn.\nLet none show mercy to another,\nAs the great Dao’s upright qi flows forth.\n\nWith utmost sincerity, we prostrate and take refuge, reverently bowing to the Western Direction’s Infinite Supreme Most High Perfected Supreme Unity Lord, the Three Caverns Heavenly Worthies.\n\nNext, facing the West, we perform three bows and conclude the repentance.\n\nYour servants [so-and-so] and others, on behalf of the [such-and-such] household, respectfully perform the divine incantation ritual, reciting the *Scripture of the Divine Incantation’s Wondrous Turning*. First, we express gratitude for transgressions, severing and cutting off demonic pestilence. We purify and pacify the dwelling, safeguarding the household. Burning incense and kindling bright lamps, we contemplate the spirits and meditate upon the Perfected, surrendering body, spirit, and life to the Western Direction’s Supreme Mysterious Elder, the Most High Cavernous Samādhi Divine Incantation Three Caverns Heavenly Worthies, and all divine spirits.\n\nWe look up in gratitude to the Western Direction’s Seven Qi White Heaven Supreme Clarity Western Florescence Lofty August Emperor, the Supreme Numinous Primordial Elder Lord; the Supreme Treasure Queen, Holy Thearch of Supreme Simplicity; the Lords of the Three Origins; the Seven Supreme Harmonies of the Golden Watchtower and Jade Perfected; the Western Numinous Metal Mother; the White Thearch Lofty Immortals; the Perfected of the Four Poles; and all the supremely sagely great deities of the heavens. We look down in gratitude to the divine immortals and true perfected of the Western Realm of the Infinite World beneath the earth, the Five Marchmounts and Four Watercourses.\n\nWe beseech forgiveness and absolution for the [such-and-such] household, for the offenses of this present life—those of body, mind, mouth, and intent—whether self-committed or taught to others, and the dust-like karmic burdens. May all be dissolved and removed. May the [such-and-such] household’s pestilential poisons vanish, and may all enjoy tranquility and peace.\n\nWe humbly pray that the Most High may bestow grace, commanding the Great Soldiers of the Nine Heavens, the armored conscripts of the ten directions, the Red Slayer Warriors, the Red-Riding Merit Officers, and the Great Expelling General to seize and expel the Xinling Red Crow demons and specters, the ghosts of the living and dead, the spirits of tombs and graves, the chieftain Du Nu Wuliuzi, the Red-Eyed Horned Ghosts, and all such beings, sweeping them away and severing the plague’s roots. May all illnesses and afflictions immediately vanish and be fully cured. May the true qi moisten and adorn.\n\nMay the hundred bones rest in peace. Reverently bearing the grace of the Dao, we proclaim the divine incantations.\n\nThe incantation says:\nThe Dao Lord commands all malevolent spirits below the world—\nIn the year of *renwu*, the cycle of *jiaxu*,\nRed sands slaughter cattle and horses, the Wuwan cut short the people’s lives.\nThose who receive the scriptures and wear the registers,\nThe heavenly soldiers shall guard their bodies.\nThe dead generals shall drive away the visiting ghosts,\nThe mighty warriors shall admonish their kin.\nIf you do not obey our teachings,\nYou shall bear stones and pile them by the night river.\n\nThe hymn says:\nThe spirit of the Western Harvest, named Gou Ni,\nThe Three Luminaries and the Mysterious Void,\nBrightly illuminating the four directions.\nThe thirty-two tones of the eight sounds,\nThe demonic and perverse *qi* shall retreat of themselves.\nToday we establish the fortune-bestowing fast,\nLighting lamps to illuminate the empty radiance.\nThe wind ceases, the rain does not fall,\nSlaying demons and binding wickedness.\nDefeated are the ghosts who dare to test,\nBound and sent to the celestial mechanism.\nPracticing the Dao removes the ten thousand evils,\nThe merit and virtue are most towering.\nThe Dao and its power are most refined,\nThe sagely might revives the dead.\nThe hundred demons return to the one true,\nTo whom shall blessings be added?\nReverently return and follow the Great Dao,\nAccumulating goodness, the spirits shall naturally return.\nThe foolish cannot learn,\nThe wise ever depend upon it.\nNot begrudging wealth or body,\nThey aspire to ride the void and fly.\nWith utmost sincerity, we take refuge and bow,\nReverently paying homage to the Most High and Perfect Supreme Great Unity Lord of the Three Caverns, the Heavenly Worthies of the North.\n\nNext, facing north, we perform the three bows and conclude the repentance.\n\nYour servants, so-and-so and others, respectfully perform the divine incantations and recite the wondrous scripture of the divine incantations for the such-and-such household.\nFirst, we confess our transgressions and sever the demonic pestilence,\nPurifying the dwelling and protecting the household.\nBurning incense and lighting lamps,\nWe contemplate the spirits and meditate upon the true.\nReturning body, spirit, and life.\n\nTo the Supreme Mystery Elder of the North, the Three Modes Divine Incantation of the Cavernous Abyss, the Heavenly Worthies of the Three Caverns, and all divine spirits,\nWe reverently thank the Jade Emperor of the Five *Qi* of the Mysterious Heaven, the Supreme High August Sovereign of the Void, the Dao Lord, the Most High Lord Lao, the Most High Elder, the Jade Dawn Lord of the Great Dao, the True Duke of the North Pole, the Master of Literary Beginnings, the August Elder of the Black Emperor, the High Mystery Perfected, the Natural Youth, the Great Spirits of the Nine Stars within the Dipper, the Celestial Beings of the Five Spirits, the Myriad Layers of the Most High Sagely Hosts of the Great Hua Nine Dawns,\nAnd below, we thank the Perfected and True Immortals of the Five Marchmounts and Four Streams in the boundless world of the northern lands.\n\nWe humbly pray that the Most High may bestow grace, absolving the such-and-such household, its seven generations, living kin, and six relations.\nFor disloyalty and unfiliality, lack of love and compassion,\nFor killing, theft, deviance, and lust, harsh speech and double tongues,\nFor frivolous and reckless words, anger, stinginess, and greed,\nSins as high as mountains, too numerous to recount—\nThrough today’s merit and virtue, may all be absolved and removed.\nMay the such-and-such household’s epidemics and illnesses vanish, and may all enjoy rest and peace.\n\nWe humbly pray that the Most High may bestow grace, commanding Song Jiu, the General of Literary Prosperity, the Wind and Water Generals, the Four Heavenly Kings, the Red and Radiant Celestial Capital Warriors, Huang Ying, and others,\nTogether to seize and capture the Great Demon of Azure Perfection, Fu Dan Lian Zi, the ghost Huang Nu Du Lu Na, the spirits of gates, doors, wells, and hearths, Cheng Bo, A Pian, Ran Xuan Zi Du, and others.\nMay the pestilential poisons, epidemics, and all ghosts be dispersed,\nThe dwelling purified, and the ten thousand fortunes secure in peace.\nReverently bearing the grace of the Dao, we proclaim the divine incantations.\n\nThe incantation says:\nThe Most High has true words,\nCommanding all demonic and spectral ghosts.\nThe violent and disorderly, the White-Headed,\nThe cold and heat, the tails of pestilence—begone!\nThey usually dwell in trees and stones,\nOr cling to mountains and waters.\nThose who wear the talismans, enlightened masters,\nMen and women who receive the registers,\nRecite the scriptures to resolve official entanglements,\nEstablish fasts to cure illnesses.\nHow dare the demonic defy?\nThey shall be cut down and not spared.\n\nThe hymn says:\n\nIn the northern realm of Yüdanuyue, the four seasons unfold without earthly bounds.\nIt is named the Mysterious Heaven, riding the void to trace the dark celestial tracks.\nToday we establish the great fast, forbidding all evil ghosts.\nShould any dare to test this decree, they shall wander and perish where they stand.\nBy the golden edict of the Most High, by the mandate of the Jade Emperor and the Dao Lord,\nA thousand demons naturally submit; ten thousand evils—how could they compare?\nNow we conjure the demon kings, and every petty ghost trembles in dread.\nShould any refuse to depart, the Heavenly Soldiers shall descend to seize them.\nConsigned to the Three Celestial Courts, not a single evil may remain.\nEach is commanded thus: the winds shall cease, the rains shall still.\nThose who defy this law and decree shall have their heads struck off by the celestial officers.\n\nWith utmost sincerity, we turn and submit, reverently bowing to the Boundless Most High Perfect and True Supreme Great Unity Lord, the Three Caverns’ Heavenly Worthies of the northeast.\n\nNext, facing the northeast, we perform the triple bow and conclude the repentance.\n\nYour servants, so-and-so and others, respectfully perform this divine incantation and recite the wondrous scripture of the divine incantation for the sake of such-and-such household.\nFirst, we confess our transgressions and sever the demonic pestilence.\nWe purify the dwelling and protect the household.\nLighting incense and bright lamps, we meditate on the spirits and contemplate the true.\nWe submit body, spirit, and life to the Boundless Supreme Mysterious Elder, the Most High Cavernous Samādhi Divine Incantation, the Three Caverns’ Heavenly Worthies of the northeast, and all divine spirits.\n\nWe look up in gratitude to the Primordial Azure Heaven of the Grand Clarity, the Boundless Void and Spontaneous Great Dao, the Perfect and True Supreme Sacred Numinous Treasure, the Primordial Azure Elder Lord, the Nine Heavens’ True Kings, the Eastern Radiance Void Emperor Lord, the Nine Numinous Masters, the Jade Flower Perfected, the Seasonal High Imperial Perfected, and all the supreme sacred deities of the heavens.\n\nBelow, we express gratitude to the divine immortals and true perfected of the five sacred peaks and four streams in the boundless world beneath the earth in the northeast.\n\nWe beseech forgiveness and absolution for the household of so-and-so, for our masters, our parents, for past lives and the present one.\nWe have committed manifold transgressions: failing in loyalty and filial piety, slighting the kindness of others, leaving the Six Perfections unfinished, neglecting the Four Immeasurables, accumulating hidden faults and manifest errors, our offenses heaped as high as the seas.\nThrough this repentance, we humbly beg for their complete absolution.\nMay the pestilential poisons of this household be universally dispelled, and may all enjoy peace and prosperity.\n\nWe prostrate ourselves, praying that the Most High will bestow grace, commanding the Perfected Riders of the Most High, the Husband and Wife Jade Maidens, the Great Plow of the Demon King, the spirit youths and masters of the five and ten directions, the Great Slayer Generals, the armored soldiers and valiant warriors, to capture and seize the Five Essences, the Seven Blasts, Jia Yuan, Shen You, and others, along with the Wūwán and Huángnú brothers and the pestilential disasters.\nMay all demonic essences and epidemic poisons be rebuked, seized, destroyed, and banished, utterly annihilated.\nWe pray that this household may enjoy purity and peace, its people rest and prosperity, relying upon the boundless grace of the Most High.\n\nWe proclaim the mighty power and expel the pestilential spirits with the divine incantation.\n\nThe incantation says:\nThe Elder Lord expounds the supreme teaching to dispel the Middle Kingdom’s calamities.\nOn wùyín, it is called Aconite; on gēngyín, it is named Great Thunder.\nYou Lian presides over strife; Hao Jing drains wealth.\nAt the first utterance of the divine incantation, the bodies of ghostly thieves are shattered ten thousandfold.\nGold and iron advance to execute; fire bells press from the rear.\nHasten a thousand miles away—do not dare to linger even briefly.\n\nThe hymn says:\n\nThe son of the northeast, Gèn, is named Wénlíng.\nHis dark radiance illumines all, as he establishes fasts to deliver sentient beings.\nThe fast’s covenant spans a thousand ages; he builds merit and roams the Phoenix City.\nDelivering the dead and rescuing those adrift on winds and waves, he seeks stillness to preserve his form.\nHe kindles lamps to illuminate the Three Luminaries—let no wind arise.\nThe Most High commands the demon kings, bidding all wind and rain to cease.\n\nWith utmost sincerity, we prostrate and pay homage, reverently bowing to the Boundless Most High Perfectly Real Supreme Great Unity Lord, the Three Caverns’ Heavenly Worthies of the southeast.\n\nNext, we bow three times toward the southeast and make confession.\n\nWe, your servants, reverently perform for this household the divine incantations, conducting the Dao and reciting the wondrous scriptures of the divine prayers.\nFirst, we repent our transgressions and sever the demonic pestilence.\nMay the dwelling be purified and at peace? May the household be safeguarded.\nWe burn incense and kindle bright lamps, contemplating the spirits and invoking the Perfected.\nWe dedicate body, spirit, and life to the Boundless Supreme Elder of the Dark Mystery, the Three Caverns’ Heavenly Worthies of the Samādhi Divine Incantations of the Abyssal Cavern in the southeast, and all divine spirits.\nWe humbly thank the Primordial Cinnabar Heaven of the Grand Clarity, the Cavernous Ultimate of the Void and Spontaneous Perfection, the Most Sacred Numinous Treasure’s Primordial Crimson Yang Elder Lord in the southeast; the Boundless Elder of the South; the Master of Supreme Harmony; the Three Spirits’ Mysterious Supreme Myriad Blessings August Elder; the Crimson Numinous August Emperor Mèng; the Perfected of the Great Yang; the Marshal of Life-Nurturing and Destiny-Deliverance; the Three Primordials of the Dark Mystery; the Purple Numinous Void August Lord of the Dao; the Vermilion Palace’s Crimson Essence; the Director of Fates of Nánchāng; the Perfected of the Four Poles; and all the Most Sacred and Supreme Honored Spirits of the heavens.\n\nNext, we thank the Perfected and True Immortals of the Five Peaks and Four Waterways in the boundless world of the southeast below.\n\nWe beseech forgiveness and pardon for this household’s offenses: disobedience to ruler and kin, discord with Heaven and Earth;\nkilling, theft, deviant lewdness, reckless speech, and frivolous words;\nstinginess, greed, wrath, and envy of the worthy;\nhidden evils and myriad transgressions—grievous sins without limit.\nThrough this repentance and rite, we specially implore their dissolution.\nMay this household’s adversities and hardships be far dispelled, and may all receive blessings and felicity.\nWe humbly beseech the Most High to bestow grace, commanding the Great Armies of the Three Heavens, the Jade Maidens of the Nine Heavens, the Celestial Executioners, the Celestial Wardens, the Celestial Guardians of Tiānpéng, the Masters of the Mysterious Center, the Orthodox Unity’s Merit Officers, and others to capture and bind the Hundred Dragons, sever the Wūyuán Lǐ Zǐ’áo, the Archer in the Waters, the Twelve Malarial Demons, and the ghostly servants of the six livestock. Drive them out, expel them, annihilate and eradicate them.\nMay this household enjoy harmony, joy, and prosperity, and may all delight in great peace.\nMay all universally bear the blessings of life and growth.\nWe proclaim the mighty power and perform the divine incantations.\n\nThe incantation says:\nThe Elder Lord issues a luminous decree, commanding all within the Middle Kingdom.\nGreat ghosts and lesser ghosts, demon kings and evil kings—\nafter the year jiǎxū, human fortunes wane while ghostly thieves grow strong.\nIn the ninth month, Tú Lúnnà; the Three Heavens summon Gōupó Qiāng.\nThose who recite scriptures and uphold registers—specters and demons manifest their forms.\nThe Most High bestows the true Dharma to eradicate all calamities and misfortunes.\n\nThe hymn says:\nThe spirit of the southeast, Xùn, roams the rivers under Heaven.\nThe Nine Rivers shake the Four Seas; the Five Peaks drive away your illnesses.\nThe Perfected open the Ten Directions, establishing fasts to still the dark waves.\nNo demon dares arise; all demons are restrained and commanded.\nIf there are malevolent ghosts, behead them and consign them to Xūtuóluó.\nThe Three Officials dare not stir, adhering to the statutes of the *Nǚqīng*.\n\nWith utmost sincerity, we prostrate and pay homage, reverently bowing to the Boundless Most High Perfectly Real Supreme Great Unity Lord, the Three Caverns’ Heavenly Worthies of the southwest.\n\nNext, we bow three times toward the southwest and make confession.\n\nWe, your servants, reverently perform for this household the divine incantations, conducting the Dao and reciting the wondrous scriptures of the divine prayers.\nFirst, we repent our transgressions and sever the demonic pestilence.\nMay the dwelling be purified and at peace, and the household be safeguarded.\nWe burn incense and kindle bright lamps, contemplating the spirits and invoking the Perfected.\nWe dedicate body, spirit, and life to the Boundless Supreme Elder of the Dark Mystery, the Three Caverns’ Heavenly Worthies of the Samādhi Divine Incantations of the Abyssal Cavern in the southwest, and all divine spirits.\nWe humbly thank the Primordial Plain Heaven of the Grand Clarity, the Mysterious Ultimate of the Void and Spontaneous Perfection, the August Lord of the Radiant Numinous Origin in the southwest; the Primordial Plain Elder Lord of the Numinous Treasure; the Jade Emperor of the Three Heavens; the Perfected Lord of Purple Yang; the Four Perfected of the Dipper; the August Lord of Primordial Yang; the Master of Purple Essence; the Lord of Myriad Blessings, Myriad Qi, Myriad Deliverances, and Myriad Births; the August Lord of the Void Mystery of the Western Clarity; the Seven Perfected of the Golden Palace’s Plain Numinous Jade Splendor; and all the Most Sacred and Supreme Honored Spirits of the heavens.\n\nNext, we thank the Perfected and True Immortals of the Five Peaks and Four Waterways in the boundless world of the southwest below.\n\nWe beseech forgiveness and pardon for this household’s offenses: violating the Two Modes, defiling the Three Luminaries;\ndisregarding the Four Seasons, slighting the Five Constants;\ndivulging sacred texts, defying the Immortals and Sages;\non the Three Primordials, Eight Festivals, and Ten Auspicious Days, indulging the Six Passions and committing countless transgressions.\nThrough this confession, we implore their complete eradication.\nMay this household’s blessings and virtues be adorned and ever receive felicity.\nWe humbly beseech the Most High to bestow grace, commanding and capturing the Great Demons of the Nine Heavens, the twenty-four myriad beings of the Palace of Great Yin, the Perfected Guiding Lords, the Níhé and Wànhé officers, the Hundred-Tongued Officials, the Masters of the Nine Heavens, and all to unite in purpose and power to capture and restrain the pestilential toxins.\nThe demon king Gāolínzǐ, the Qiāng and Hú clans Liáo, the Crimson Crows and Crimson Lián, the generals and commanders who perished in battle, and the Black Ghosts—swiftly annihilate them.\nMay the true qi flow freely, and may the myriad people enjoy peace and prosperity.\nWe proclaim the mighty power and perform the divine incantations.\n\nThe incantation says:\nThe Elder Lord commands the demon hosts, bidding them all submit to the Great Dao.\nIf they encounter one who recites scriptures, protect and guard them to ensure their purity.\nDīnglíng and Qiāng barbarians, the Mùsuǒ and Dī Liáo—\nthe Great-Headed become Great Dampness; the Yí ghosts turn to dryness.\nThe Perfected of Clarity wield crimson rods, growing like green grass.\nHear the incantation and depart swiftly—linger, and your skulls shall be split.\n\nThe hymn says:\nThe mother of the southwest, Kūn, subdues spirits and reports to the Celestial Court.\nEstablishing fasts to deliver seven generations, all in the long night are illuminated.\nMerits accumulate to ascend the Dark Capital; winds cease and rains do not fall.\n\nBinding demons and expelling the myriad evils, heaven and humanity descend as one.\nThe four seasons transform the kalpa’s fate—thus does the Dao arise.\nWith utmost sincerity, we bow in reverence and pay homage to the Boundless, Most Supreme, Utmost Perfected, Supreme Great One Lord of the Three Caverns, Heavenly Worthy of the Northwest.\n\nNext, facing the northwest, we perform the threefold prostration and repent.\nWe, your servants [Name] and others, reverently undertake this ritual for the [Family Name] household, reciting the divine incantations and circulating the *Mysterious Scripture of Divine Incantations*.\nFirst, we confess transgressions and sever demonic plagues.\nWe purify the dwelling and safeguard the household.\nBurning incense and kindling lamps, we meditate upon the gods and contemplate the Perfected.\nWe dedicate body, spirit, and life to the Boundless, Most Supreme, Mysterious Elder, Most High Lord of the Cavernous Abyss Samādhi Divine Incantations, the Three Cavern Heavenly Worthies, and all divine spirits.\n\nGazing upward, we give thanks to the Primordial Sovereign of the Mysterious Heaven in the Northwest, the Supreme Origin Emperor of the Nine Heavens; to the Boundless, Most Resplendent Numinous Treasure, Primordial Elder Lord; to the August Heavenly Ones; to the Nine-Canopied Flower Dawn Lord of the Northern Mystery; to the Heavenly Gate Transcendents, Flying Feathered Lords; to the Jade Immortals, Assembly of Perfected; to the Inspectors of Spirits; to the Three Ancient Masters; to the Great Sage Host of Utmost Perfected; to all the Venerable Lords and Heavenly Worthies; and to the Supreme Sage Hosts of the Gods.\n\nBelow, we give thanks to the Perfected Immortals of the Five Peaks and Four Streams in the Boundless World of the Northwest.\nWe beseech forgiveness and absolution for the household’s sins: killing, theft, deviant lust, monstrous greed, and envious grasping.\nWrath, hatred, slander, and frivolous speech—\ncountless transgressions—we beg to have wholly eradicated.\nFor both the living and the dead, we pray for peace and stability.\n\nWe humbly pray that the Most High bestow grace, commanding the Demon Kings of the Nine Heavens, the Masters of the Ten Directions, the Celestial Warriors, the Armored Soldiers of Heaven, and all true gods to seize and capture evil spirits, the five pestilences, epidemic poisons, and the malevolent forces of mountains, forests, water, and fire—wind, earth, the *Mùsuǒ* and *Dòujiā* ghosts, the *Yōulián Wénqìngzǐ*, and all who afflict humankind.\nBanish them a thousand *lǐ* and annihilate them utterly.\nLet true *qi* flow freely, primordial essence nurture and flourish.\nMay ten thousand people live in harmony and peace, households dwell in purity and tranquility.\nWe look up to receive the encompassing grace of the Great Dao.\nThe mighty power is proclaimed, and the divine incantations are performed.\n\nThe incantation says:\nThe Most High unfurls the wondrous scripture, healing the ailments of ten thousand.\nIn the years of *chén*, *sì*, *wǔ*, and *wèi*, plague spirits and demon officials thrive.\nThose who recite and distribute this scripture shall be spared from calamities of the times.\nThe red pestilence dies with the incantation; black *qi* retreats at its sound.\nDo not disturb the human realm, nor recklessly assail our righteousness.\nSwords shall sever your forms, cutting you to pieces without resistance.\n\nThe hymn says:\nThe father of the northwest, *Qián*, is called the essence of heaven and earth.\nThe nine *qi* unite as one; the five poles gather all beings.\nToday we establish the fast and chant, lighting lamps to illumine the mysterious stars.\nThe Three Luminaries shine upon the *Tuóluó*; the long night grows bright and clear.\nMysterious light illumines all—we pray for blessings to deliver all beings.\nAccumulating merit to ascend as immortals, we sever the kalpa’s demonic armies.\nAll winds and dust are cut off; trials bind the forms of ghosts.\nWith utmost sincerity, we bow in reverence and pay homage to the Boundless, Most Supreme, Utmost Perfected, Supreme Great One Lord of the Three Caverns, Heavenly Worthy of the Upper Realm.\n\nNext, facing the Heavenly Gate in the upper realm, we perform the threefold prostration and repent.\nWe, your servants [Name] and others, reverently undertake this ritual for the [Family Name] household, reciting the divine incantations and circulating the *Mysterious Scripture of Divine Incantations*.\nFirst, we confess transgressions and sever demonic plagues.\nWe purify the dwelling and safeguard the household.\nBurning incense and kindling lamps, we meditate upon the gods and contemplate the Perfected.\nWe dedicate body, spirit, and life to the Thirty-Two Heavens’ Boundless, Most Supreme, Mysterious Elder, Most High Lord of the Cavernous Abyss Samādhi Divine Incantations, the Three Cavern Heavenly Worthies, and all divine spirits.\n\nGazing upward, we give thanks to the Boundless, Most Supreme Numinous Treasure Heavenly Worthy of the Upper Realm; to the Boundless, Formless, Nameless, Infinite, and Limitless Utmost Perfected, Most High Emperor of the Great Dao; to the Primordial Father of the Nine Heavens; to the Primordial Heavenly King; to the Primordial Venerable Lord; to the Utmost Numinous Treasure, Cavernous Mystery, Most High Primordial Elder Lord; to the Boundless Host of Great Sages; to the Utmost Perfected and all Venerable Lords; and to the Supreme Sage Hosts of the Gods.\n\nBelow, we give thanks to the Perfected Immortals of the Five Peaks and Four Streams in the Boundless World of the Upper Realm.\nWe beseech forgiveness and absolution for our bodily forms, thoughts, and deeds—utterances and judgments that violate the ordained rites.\nPlagues, illnesses, official and private disputes, slander, and harm—\nwe fear being ensnared and not delivered.\nTurning our hearts to the Utmost Dao, we establish the fast and pray for blessings.\nFirst, we confess for the living and the dead: ten thousand sins, a thousand transgressions, defilement of the Three Luminaries.\nWe humbly pray that the Great Dao descend its numen, that the myriad heavens grant protection.\nMay these merits flow to the household, to the living and the dead, to the seven generations of kin—\nall delivered from the dark night, emerging into light.\nAbove, may they ascend through transformation as immortals; in the middle, may they roam as spirits in the earthly realm; below, may they be reborn among humans.\nAt the gates of kings and lords, may they encounter the Three Treasures and forge bonds of goodness.\nMay blessings and fortune be transmitted, attaining immortality and flowing to the household.\nFor the honored and the humble, the elder and the young—\nall afflictions, chronic illnesses, pestilential winds, cold poisons, epidemics, and seasonal plagues—\nmay they all be healed.\nMay medicine prove effective, bringing health within and without.\nMay the five viscera be harmonized, the six bowels flow freely.\nMay the nets of entanglement be untied, calamities and misfortunes delivered.\nMay years be added to our lifespan, longevity extended without limit.\nMay our paths in the world shine brightly, ranks and emoluments ascend.\n\nWithin, may they serve as ministers and chancellors; without, may they govern the provinces.\nIn reverence toward superiors and compassion toward inferiors, may all conduct be marked by awe.\nMay they forever preserve primal harmony, their every endeavor meeting with accord.\n\nWe humbly pray that the Most High bestow grace,\nthat the Yellow Efflorescence Valiant Warriors, the Orthodox Unity Functionaries and Messengers,\nthe Nine Heavens’ Great Hosts, the Heavenly Maidens of Jade,\nseize and bind Yingnü, Penzi, the Red-Headed Demons, the Red Ding Fire Ghosts,\nthe Red Cord White Underlings, the Red Capital Ghosts, and all such beings,\ncommanding their utter annihilation and eradication.\nThus may the upright qi settle in peace, all people be pure and refreshed,\nand households dwell in safety, ever beholden to the sagely favor.\n\nProclaiming the luminous majesty, we reverently recite the divine incantation.\nThe incantation declares:\n\nThe Heavenly Worthy’s radiant teaching—\nghosts and spirits must heed.\nLuoweng and Daye,\nHuayuan and Xiaoling,\nlet Jiaozi henceforth cease,\nlet Dunu no more arise.\nThe Cavern Abyss Retreat now established,\nthe qi of rebellion and perversity must be stilled.\nThose who remain defiant and unyielding—\nbind them with red cords,\nsplit their heads into ten thousand pieces,\nlet their fat flow and blood congeal.\n\nNext, the hymn intones:\n\nAbove, the boundless heavens of the Highest Realm,\nthe majestic Three Luminaries unfold their splendor.\nToday we cultivate the field of blessings,\nlighting lamps to illumine the Mystery.\nThe distant qi of the Nine Heavens,\nthe graceful descent of Ma Gu—\nriding the void, driving the six dragons,\nthe Heavenly Maidens attend the Emperor’s Husband.\nThe Demon Kings halt wind and rain,\nthe Most High’s decree is no falsehood.\nRevering the sublime and wondrous scripture,\nnaturally we feast from the celestial kitchens.\nGreat waters flood the kalpas,\nyet Daoists wander the celestial thoroughfares.\nNaturally distinct from the vulgar,\nthey glide over water like dragons and fish.\nCarefree, they enter the Purple Chamber,\nlingering as they return to the Great Nothingness.\n\nWith utmost sincerity, we prostrate and take refuge,\npaying reverence to the Most High, Utmost Real, Supreme, Supreme Unity Lord,\nthe Three Caverns’ Heavenly Worthies of the Lower Realm.\n\nNext, facing the earthly portal of the lower realm, we bow thrice and conclude the repentance.\n\nYour servants, so-and-so, respectfully perform for such-and-such household\nthe recitation of divine incantations and the circumambulation of the wondrous scripture.\nFirst, we confess transgressions and sever demonic pestilence,\npurifying the dwelling and safeguarding the household.\nBurning incense and kindling lamps, we meditate on the spirits and contemplate the Real.\nWe dedicate body, spirit, and life to the Seventy-Two Marshes’ Supreme Mysterious Elder,\nthe Most High Cavern Abyss Samādhi Divine Incantation’s Three Caverns’ Heavenly Worthies,\nand all divine numina.\n\nGazing upward, we give thanks to the Mysterious Yellow Heaven’s\nMost High, Boundless, Formless, Measureless, Innumerable Great Dao’s\nNine Hundred Ninety-Nine Thousand Nine Hundred Million Qi-Heaven Elders;\nthe Nine Heavens’ Mysterious Mother; the Supreme Yellow Primordial Lord;\nthe Nine Heavens’ True Elder; the Jade Void August Elder Lord;\nthe Supreme Ultimate Perfected; the Yellow Elder and Yellow Emperor;\nthe Yellow Elder Heavenly Beings; the Primordial Yellow Central Emperor;\nthe Five Elders and Upper Immortals; and all the Most Exalted Sage Deities of the Heavens.\n\nBelow, we give thanks to the nether regions of the boundless world,\nthe Five Marchmounts, the Four Streams, and the divine immortals of true perfection.\n\nWe beseech forgiveness and absolution for such-and-such household,\nall its members, young and old, the seven generations of ancestral spirits,\nparents and teachers, the six relations and kin, and all sentient beings.\nFrom kalpas past to the present life,\nthrough the three karmas and six senses,\nwe have committed manifold transgressions,\ndefiled mountains and waters, and offended the numinous deities.\nWe have faced retribution in the dark realms,\nbringing upon ourselves calamities and misfortunes.\nThrough this repentance, we humbly pray for their complete eradication.\nMay the living and deceased of such-and-such household attain blessings\nand forever be free from disasters and misfortunes.\nMay the honored and the humble, the elder and the young,\nfind all chronic illnesses universally dispelled,\nall limbs harmonized, and years and longevity increased.\nMay fortune and emolument shine brightly, health prevail within and without.\nMay dwellings be pure and secure, all directions prosper in harmony.\n\nWe humbly pray that the Most High extend grace,\nthat the true numina descend with protection.\nWe command the wardens of the ten directions,\nthe Great Brahmā Heavenly King, the Eight Divisions’ Censor Officers,\nthe Great Illuminator Overseer Spirits, the Executioner Messengers,\nthe Heavenly Ding Valiant Warriors,\nto seize and capture Wuhuan, Huangnu, Lianzi, Chisuo,\nthe Great Ghost Headran, the Hundred Offerings’ Xuanzidu,\nand all ghosts of toxic illnesses and miscellaneous maladies.\nMay all calamities and misfortunes be commanded to extermination,\nall demonic perversities and pestilential bandits utterly eradicated.\nEver beholden to the boundless grace of vast deliverance,\nwe proclaim the luminous majesty and enact the divine incantation.\n\nThe incantation declares:\n\nThe Heavenly Worthy’s true and pure Dharma\ngoverns ghosts and protects all beings.\nOn Jiazi, the myriad illnesses descend;\non Renchen, the hundred million ghosts roam.\nThe Yellow Pestilence, Zhong Shiji;\nthe Red Toxin, Xiahou Ying—\nhasten to depart from walls and paths,\ndare not linger near gates and courtyards.\nI possess ten generals,\ntheir eyes like shooting stars,\nunceasingly watching for ghosts day and night,\ncrushing them to pieces without whole form.\n\nNext, the invocation intones:\n\nBelow, the boundless kalpas stretch into darkness;\nabove, we gaze upon the Three Heavens,\nwhere the Three Luminaries shine brightly.\nToday we kindle lamps,\nthe Ten Perfected restrain the Demon Kings.\nLet winds be still, rains cease,\nas Daoists wander the Emperor’s realm.\nThe Jade Maidens awaken the Three Luminaries,\nthe Six Perfections behold the Supreme August One.\nToday the Dharma Masters assemble,\nthe divine immortals shake the ten directions.\n\nWith utmost sincerity, we prostrate and take refuge,\npaying reverence to the Most High, Utmost Real, Supreme, Supreme Unity Lord,\nthe Three Caverns’ Heavenly Worthies of the Central Realm.\n\nNext, facing the southwest human portal, we bow thrice and conclude the repentance.\n\nYour servants, so-and-so, respectfully establish the retreat and perform the Dao for such-and-such household,\nto heal illnesses, expel demonic pestilence, and avert calamities.\nThrough these meritorious deeds, we beseech forgiveness for the living and deceased of such-and-such household,\ntheir thousand transgressions and myriad sins, all to be absolved.\nWe command the Heavenly Ding of the ten directions and the thirty-six Heavenly Valiant Warriors\nto shield and protect the six relations of such-and-such household, young and old, male and female, noble and base.\nWherever they extend their protection,\nwe forbid all pestilential ghosts from causing disturbance.\nSeize and eradicate the cloud-borne Li Ziao of untimely death,\nthe human-shaped spirits of livestock that perished in flight,\nthe five woods’ hundred specters, the Man, Yi, Di, Xia, Qiang, Hu, and Cang barbarians,\nthose dwelling above mountains, below mountains, in water, in fire,\nat gates, doorways, wells, hearths, dwellings, and walls.\nAll manner of ghosts—command their complete eradication,\ndispersion, and annihilation.\nPlunge them a thousand fathoms into the earth,\nconsigning them to timely ruin, leaving no remnant.\nMay all stand in awe, ever beholden to the sagely favor.\nProclaiming the luminous command, we enact the divine incantation.\n\nThe incantation declares:\n\nThe Most High’s golden mouth commands,\nsolemnly adjuring all demons.\n\nWhen the years of Horse and Sheep arrive,\npestilence and plague shall multiply.\nDing diligently takes men and women,\nwhile Shi spares no harm to fowl and geese.\nWhere the Dharma Master turns the sutras,\nno demonic essence may pass through.\nThose who uphold the Three Caverns’ Way\nshall cross ten-thousand-fathom waves unscathed.\nSlay the ghosts—ghosts shall be utterly destroyed;\nheal the sick—sickness shall bring no further harm.\n\nThe following hymn declares:\n\nAt the center, the spirits of Wu and Ji,\nthe Yellow Emperor governs the four directions.\nToday, great harmony is established,\nand myriad evils dare not draw near.\nThe winds cease, branches still,\nrains disperse, the Three Luminaries shine.\nThus the Dao and virtue flourish,\nthe Perfect and True stand in profound accord.\nHeavenly maidens seize the demons of fate,\nthe Ten Severances slay all wrong and falsehood.\nMerits accumulate, ascending to the Mystic Capital,\nblessings and joy tower high and majestic.\nWealth and treasures are shared among five households,\nand those who perform good deeds find the gods returning to them.\nAll omens, auspicious and baleful, submit and hide—\nwho shall report good and evil?\nThe Mystic Radiance scatters in emptiness,\nthe sounding drum strikes not of itself.\nCommand all demonic and wayward spirits:\nthose who test this shall find their own decline.\nThe Most High’s golden mouth decrees—\nif disobeyed, to whom shall death’s grievance belong?\n\nThe *Dongyuan Sanmei Divine Incantation Ritual of Offering, Repentance, and Thanksgiving* is now complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上洞渊三昧神咒斋忏谢仪 经名：太上洞渊三昧神咒斋忏谢仪。 唐杜光庭编。 一卷。 底本出处：《正统道藏》洞玄部威仪类。 太上洞渊三昧神咒斋忏谢仪 广成先生杜光庭删定 忏方 臣等志心归命，敬礼东方无极太上至真上上太一君三洞天尊。 次向东方三礼讫忏 臣某等，谨为某家奉修神咒，行道转神咒妙经。 首谢罪愆，断截魔瘟。 清安家国，保护人民。 烧香明灯，思神念真。 归身归神归命，东方无上玄老太上洞渊三昧神咒三洞天尊，一切神灵。 仰谢东方九炁青天泰清玄元无上三天无极大道太上老君，太上丈人，天帝君，天帝丈人，大帝君，上皇老人，三十九真七十二圣高玄真君，九老仙都君，九气丈人，始生青真东华玉宝高晨大司马上相青童君，元老主仙真人，无鞅数量百千万重道气千二百官君，太清玉陛下青帝九气玉门神仙，四司真人，诸天至极上圣大神。 下谢地下东乡无极世界五岳四渎神仙正真。 乞丐原赦斋主某家，存亡两世父母宗亲。 七情五欲，十恶六根。 积罪积愆，无边无量。 从兹忏谢，咸冀荡除。 俾某家眷等，福命延长，保安宅宇。 伏愿太上垂恩，勅三昧咒王，九天力士，五帝神兵，十方采女，赤弓大卒，收灭赤头，杀拘盈子等。 纵行瘟毒，刀兵饥馑，疫疠鬼贼，一切清荡。 真气熏修，元精润色，万有安乐，同一太平。 稽首归依，愿垂生造。 宣勑明威，奉行神咒。 次祝曰： 此遣鬼咒，诵如卫灵咒法。 恻恻震威而宣，严勅十方同忏讫。 起立宣此，谓宣勅明威，令神鬼奉行矣。 不得忽略。 道言五浊世，有持三洞经，吾遣天丁士，随逐卫其形。 下病万丈鬼，远离於门庭。 收除五色气，一切莫令行。 官事解了了，病者差醒醒。 敢有不遵令，魔王收斩形。 次颂曰： 如颂吟，步虚咏之。 旋行一周，十方同。 东方弗于提，勾芒何青青。 梵女游太空，八音拂玉京。 大乘超世表，十真戏紫庭。 建福立名斋，长夜悉开明。 正道法鼓动，百邪悉摧倾。 魔王来稽首，敢试斩其形。 迢迢东华天，九龙云舆迎。 善神来守户，力士交万灵。 家亲乃得住，百鬼不敢听。 相与弘至迹，俱游紫凤城。 至心归命，敬礼南方无极太上至真上上太一君三洞天尊。 次向南方三礼讫忏 臣某等，谨为某家奉修神咒，行道转神咒妙经。 首谢罪愆，断截魔瘟。 清安家国，保护人民。 烧香明灯，思神念真。 归身归神归命南方无上玄老太上洞渊三昧神咒三洞天尊，一切神灵。 仰谢南方三气丹天太清南极皇上老君，洞灵玉帝，上元禁君，三元圣人，始老玄真，万福丈人，南昌上官主生司马，太极真人，太和老子，玄和天赤帝，丹灵高仙万真，诸天至极上圣大神。 下谢地下南乡无极世界五岳四渎神仙正真。 乞丐原赦某家，三业六情之罪，违经犯戒之愆。 万品千条，咸蒙解释。 俾某家存亡贞吉，灾疫永消。",
      "translated_text": "**The Supreme Cavern-Abyss Samādhi Divine Incantation Ritual for Fasting, Repentance, and Thanksgiving**\n\n**Scripture Title:** *The Supreme Cavern-Abyss Samādhi Divine Incantation Ritual for Fasting, Repentance, and Thanksgiving*\nCompiled by Du Guangting of the Tang Dynasty. One fascicle.\nSource of the base text: *Daoist Canon of the Zhengtong Era*, *Dongxuan* Section, *Weiyi* (Ritual Propriety) Category.\n\n---\n\n**The Supreme Cavern-Abyss Samādhi Divine Incantation Ritual for Fasting, Repentance, and Thanksgiving**\nRevised and edited by Master Guangcheng, Du Guangting\n\n**Repentance Formula**\n\nWe, your disciples, wholeheartedly take refuge and reverently bow to the Eastern Infinite Supreme Perfected Most High Supreme Unity Lord, the Three Caverns’ Heavenly Worthies.\n\nNext, facing east, perform three bows and conclude the repentance.\n\nWe, disciples [so-and-so], respectfully perform for the [such-and-such] household the divine incantation ritual, reciting the scripture of the wondrous divine incantation and practicing the Dao.\n\nFirst, we offer thanks for transgressions and sever demonic pestilence.\nWe pray for the peace of the state and household, and the protection of the people.\nWe burn incense and light lamps, contemplating the spirits and invoking the Perfected.\nWe dedicate our bodies, spirits, and lives to the Eastern Supreme Mysterious Elder, the Supreme Cavern-Abyss Samādhi Divine Incantation Three Caverns’ Heavenly Worthies, and all divine spirits.\n\nWe look up in gratitude to the Eastern Nine *Qi* Azure Heaven, the Grand Clarity Mysterious Origin Supreme Three Heavens’ Infinite Great Dao Supreme Lord Lao, the Supreme Elder, Heavenly Thearch Lord, Heavenly Thearch Elder, Great Thearch Lord, Supreme August Elder, the Thirty-Nine Perfected and Seventy-Two Sages of the Lofty Mysterious True Lords, the Nine Elders of the Immortal Metropolis, the Nine *Qi* Elder, the Primordial Azure Perfected of the Eastern Florescence, Jade Treasure High Dawn Grand Minister of War and Prime Minister Azure Youth Lord, the Primordial Elder Master of Immortal Perfected, the countless myriad layers of Dao *qi* and the Twelve Hundred Official Lords, the Azure Thearch of the Nine *Qi* Jade Gate Divine Immortals under the Great Clarity Jade Palace, the Four Bureau Perfected, and all the supremely sagely great deities of the heavens.\n\nWe look down in gratitude to the Eastern Realm of the Infinite World beneath the earth, the divine immortals and true perfected of the Five Marchmounts and Four Watercourses.\n\nWe beseech forgiveness and absolution for the [such-and-such] household, the patriarchal kin of both the living and the deceased.\nFor the seven emotions and five desires, the ten evils and six roots,\nthe accumulated sins and transgressions, boundless and immeasurable,\nfrom this day forth, we repent and offer thanks, hoping all may be cleansed and eradicated.\nMay the household and kin of [so-and-so] enjoy prolonged fortune and life, and the safety of their dwelling.\n\nWe humbly pray that the Supreme One bestow grace, commanding the King of the Samādhi Incantation, the Celestial Warriors of the Nine Heavens, the Divine Soldiers of the Five Thearchs, the Maidens of the Ten Directions, the Red Bow Great Host, to capture and destroy the Red-Headed Ones, slay the Imprisoned Abundant Children, and eradicate all rampant pestilence, warfare, famine, epidemics, plagues, ghosts, and bandits.\nMay the true *qi* suffuse and refine, the primordial essence nourish and adorn, all beings enjoy peace, and all share in the Great Peace.\n\nWe prostrate and take refuge, praying for the gift of life and creation.\nProclaim the divine decree with awe-inspiring majesty, and carry out the divine incantation.\n\n**Next, the prayer is recited:**\n\nThis exorcism incantation is recited in the manner of the *Guardian Spirit Incantation*.\nProclaim it with solemn and resounding authority, strictly commanding the ten directions to join in repentance.\nStand and recite this, declaring the divine decree with awe-inspiring majesty, so that spirits and ghosts may obey.\nThis must not be neglected.\n\nThe Dao says: In the Five Defiled Worlds, those who uphold the Three Caverns’ scriptures—\nI dispatch celestial soldiers to follow and guard their forms.\nBanish the ten-thousand-fathom ghosts of illness, driving them far from the gates and courtyards.\nSeize and eliminate the five-colored *qi*, preventing all from spreading.\nOfficial matters shall be resolved, and the sick shall recover with clarity.\nShould any dare disobey this command, the Demon King shall capture and behead them.\n\n**Next, the hymn is recited:**\n\nChant the hymn as in the *Step-in-Void* recitation.\nCircumambulate once, uniting the ten directions.\n\nIn the eastern realm of *Fuyuti*, Goumang flourishes in azure hue.\nBrahmā maidens wander the great void, their eight tones brushing the Jade Capital.\nThe Great Vehicle transcends the world, the Ten Perfected sport in the Purple Court.\nEstablishing blessings through the named fast, the long night is wholly illuminated.\nThe drum of the true Dao resounds, all demons are overthrown and toppled.\nThe Demon King comes to bow in submission, daring not to test but to be slain.\nIn the distant Eastern Florescence Heaven, nine dragons in cloud chariots welcome.\nGood spirits come to guard the gates, warriors and myriad spirits converge.\nKin may thus abide in peace, no ghost dares to listen.\nTogether we magnify the supreme traces, journeying to the Purple Phoenix City.\n\nWith wholehearted devotion, we take refuge and reverently bow to the Southern Infinite Supreme Perfected Most High Supreme Unity Lord, the Three Caverns’ Heavenly Worthies.\n\nNext, facing south, perform three bows and conclude the repentance.\n\nWe, disciples [so-and-so], respectfully perform for the [such-and-such] household the divine incantation ritual, reciting the scripture of the wondrous divine incantation and practicing the Dao.\n\nFirst, we offer thanks for transgressions and sever demonic pestilence.\nWe pray for the peace of the state and household, and the protection of the people.\nWe burn incense and light lamps, contemplating the spirits and invoking the Perfected.\nWe dedicate our bodies, spirits, and lives to the Southern Supreme Mysterious Elder, the Supreme Cavern-Abyss Samādhi Divine Incantation Three Caverns’ Heavenly Worthies, and all divine spirits.\n\nWe look up in gratitude to the Southern Three *Qi* Cinnabar Heaven, the Supreme Clarity Southern Culmen August Supreme Lord Lao, the Cavern Numinous Jade Thearch, the Upper Prime Controller, the Three Primes’ Sages, the Primordial Elder Mysterious Perfected, the Myriad Blessings Elder, the Southern Prosperity Upper Palace Life-Administering Minister of War, the Supreme Ultimate Perfected, the Grand Harmony Elder, the Mysterious Harmony Heavenly Red Thearch, the Cinnabar Numinous Lofty Immortals and Myriad Perfected, and all the supremely sagely great deities of the heavens.\n\nWe look down in gratitude to the Southern Realm of the Infinite World beneath the earth, the divine immortals and true perfected of the Five Marchmounts and Four Watercourses.\n\nWe beseech forgiveness and absolution for the [such-and-such] household, for the sins of the three karmas and six emotions, and the transgressions of violating scriptures and precepts.\nMay the myriad categories and thousand conditions all be resolved.\nMay the living and deceased of the [such-and-such] household enjoy steadfast auspiciousness, and all calamities and epidemics be forever dispelled.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1100,
      "start_sentence": 0,
      "end_sentence": 61,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.08753490447998,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\太上洞渊三昧神咒斋忏谢仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "伏愿太上留恩，请勅十方采女，天丁力士，乌玄天杀大兵，赤卒小吏，十方主者，收除魔瘟威都樵氏，乌涂伦那乌丸鬼等，所部小鬼。 放诸疾病，寒热瘟疟，霍乱吐痢，一切妖邪灾害疫疠之鬼，急令迸散。 摄毒收瘟，各还方位。 使民人疾厄，悉得痊除。 真气熏羞，元和养育，兆民欢泰。 咸荷道恩，告宣神咒。 次咒曰： 道告一切神，魔子及魔女，有人受吾经，汝等当扶助。 四神莫使来，百鬼令速去。 孟达摄瘟灾，生如离莱茹。 官解疾病除，吾当迁擢汝。 若故犯害人，真气自然护。 次颂曰： 南方炎帝君，八表号阎浮。 飞轩驾云舆，仙人十真游。 玄女乘霄唱，金光溢丹躯。 今日法轮转，梵响震九嵎。 天王勅魔兵，风息雨自休。 晃晃三光耀，百邪深自幽。 若有干试者，刀士斩其头。 魔王万王子，杀鬼自来诛。 兴斋及大神，魍魉以次收。 各各不相恕，大道正气流。 至心归命，敬礼西方无极太上至真上上太一君三洞天尊。 次向西方三礼讫忏 臣某等，谨为某家奉修神咒，行道转神咒妙经。 首谢罪愆，断截魔瘟。 清安宅宇，保护家门。 烧香明灯，思神念真，归身归神归命西方无上玄老太上洞渊三昧神咒三洞天尊，一切神灵。 仰谢西方七气素天泰清西华高上皇帝太灵元始老君，泰素宝后圣帝君，三元君，金阙七太和玉真，西灵金母，白帝高仙，四极真人，诸天至极上圣大神。 下谢地下西乡无极世界五岳四读神仙正真。 乞丐原赦某家，旷勑今生，身心口意。 广造诸罪，自作教人，尘沙咎累。 并乞消除。 愿某家瘟毒消亡，咸蒙惧泰。 伏乞太上垂恩，勑勒九天大兵，十方甲卒，赤杀力士，赤骑功曹使者，大驱将军，收除信陵赤乌魍魉生死之鬼，冢墓之神，都奴乌留子，赤目角子鬼，并乞荡除，断绝瘟灾。 即令消灭一切疾病，并悉痊差。 真气润色。",
      "translated_text": "We humbly pray that the Most High may bestow grace, commanding the maidens of the ten directions, the Celestial Ding warriors, the Black-Mystery Heavenly Slayer Great Soldiers, the Red Conscript Lesser Officers, the Masters of the Ten Directions, to seize and expel the demonic plague chieftain Wei Duqiao, the Wutu Lunna Wuhuan ghosts, and all their subordinate minor spirits. Release all afflictions—illnesses, chills and fevers, pestilential malaria, cholera with vomiting and diarrhea, and every kind of malevolent specter, disaster, and epidemic ghost—driving them swiftly into dispersal. Gather the poisons and withdraw the pestilence, returning each to its proper place. May the people’s sufferings and hardships all be cured and dispelled. May the true qi suffuse and nourish, the primordial harmony foster and nurture, and the myriad people rejoice in peace. May all receive the bounty of the Dao’s grace, as we proclaim the divine incantation.\n\nThe incantation declares:\nThe Dao commands all spirits,\nDemon sons and demon daughters,\nWhoever receives Our scripture,\nYou must aid and protect them.\nLet the Four Spirits not approach,\nMake the hundred ghosts swiftly depart.\nMeng Da seizes plague and disaster,\nBorn as if freed from the snares of the world.\nOfficials dissolve illness and remove it,\nWe shall promote and exalt you.\nIf you still dare harm people,\nThe true qi will naturally shield them.\n\nNext, the hymn intones:\nThe Lord of the Southern Flame Thearch,\nWhose eight frontiers are called Jambudvīpa,\nRides a flying chariot drawn by cloud-borne steeds,\nAs the Ten Perfected Immortals wander.\nThe Mysterious Woman sings upon the clouds,\nHer golden radiance overflowing her cinnabar form.\nToday the Dharma-wheel turns,\nIts Brahmanic resonance shaking the nine peaks.\nThe Heavenly King commands the demon soldiers,\nThe winds cease and the rains naturally subside.\nResplendent, the Three Luminaries shine,\nWhile all evil spirits deeply conceal themselves.\nShould any dare to test this,\nThe sword-bearing warriors shall sever their heads.\nDemon kings and myriad demon princes,\nGhost-slayers shall come to execute them.\nAs the great fast and mighty spirits arise,\nThe demons and specters are gathered in turn.\nLet none show mercy to another,\nAs the great Dao’s upright qi flows forth.\n\nWith utmost sincerity, we prostrate and take refuge, reverently bowing to the Western Direction’s Infinite Supreme Most High Perfected Supreme Unity Lord, the Three Caverns Heavenly Worthies.\n\nNext, facing the West, we perform three bows and conclude the repentance.\n\nYour servants [so-and-so] and others, on behalf of the [such-and-such] household, respectfully perform the divine incantation ritual, reciting the *Scripture of the Divine Incantation’s Wondrous Turning*. First, we express gratitude for transgressions, severing and cutting off demonic pestilence. We purify and pacify the dwelling, safeguarding the household. Burning incense and kindling bright lamps, we contemplate the spirits and meditate upon the Perfected, surrendering body, spirit, and life to the Western Direction’s Supreme Mysterious Elder, the Most High Cavernous Samādhi Divine Incantation Three Caverns Heavenly Worthies, and all divine spirits.\n\nWe look up in gratitude to the Western Direction’s Seven Qi White Heaven Supreme Clarity Western Florescence Lofty August Emperor, the Supreme Numinous Primordial Elder Lord; the Supreme Treasure Queen, Holy Thearch of Supreme Simplicity; the Lords of the Three Origins; the Seven Supreme Harmonies of the Golden Watchtower and Jade Perfected; the Western Numinous Metal Mother; the White Thearch Lofty Immortals; the Perfected of the Four Poles; and all the supremely sagely great deities of the heavens. We look down in gratitude to the divine immortals and true perfected of the Western Realm of the Infinite World beneath the earth, the Five Marchmounts and Four Watercourses.\n\nWe beseech forgiveness and absolution for the [such-and-such] household, for the offenses of this present life—those of body, mind, mouth, and intent—whether self-committed or taught to others, and the dust-like karmic burdens. May all be dissolved and removed. May the [such-and-such] household’s pestilential poisons vanish, and may all enjoy tranquility and peace.\n\nWe humbly pray that the Most High may bestow grace, commanding the Great Soldiers of the Nine Heavens, the armored conscripts of the ten directions, the Red Slayer Warriors, the Red-Riding Merit Officers, and the Great Expelling General to seize and expel the Xinling Red Crow demons and specters, the ghosts of the living and dead, the spirits of tombs and graves, the chieftain Du Nu Wuliuzi, the Red-Eyed Horned Ghosts, and all such beings, sweeping them away and severing the plague’s roots. May all illnesses and afflictions immediately vanish and be fully cured. May the true qi moisten and adorn.",
      "overlap_context": "h the earth, the divine immortals and true perfected of the Five Marchmounts and Four Watercourses.\n\nWe beseech forgiveness and absolution for the [such-and-such] household, for the sins of the three karmas and six emotions, and the transgressions of violating scriptures and precepts.\nMay the myriad categories and thousand conditions all be resolved.\nMay the living and deceased of the [such-and-such] household enjoy steadfast auspiciousness, and all calamities and epidemics be forever dispelled.",
      "start_char": 1100,
      "end_char": 1802,
      "start_sentence": 62,
      "end_sentence": 99,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.86064314842224,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\太上洞渊三昧神咒斋忏谢仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "百骸休泰。 仰荷道恩，奉宣神咒。 次咒曰： 道君勑下界一切凶恶神，岁在壬午次，年当甲戌旬。 赤碛暴牛马，乌丸夭人民。 受经佩箓者，天兵护其身。 死将驱客鬼，力士喻家亲。 若不顺吾教，负石积夜滨。 次颂曰： 西方薄收神，号曰为勾尼。 三光玄太虚，朗朗照四维。 八音三十二，魔邪气自推。 今日建福斋，然灯照空晖。 风止雨不降，斩妖束奸非。 败有干试鬼，缚送付天机。 行道除万恶，功德甚巍巍。 道德甚精研，圣力起死尸。 百邪归一正，福报汝加谁。 奉归遵大道，积善神自归。 愚人不能学，智者常依依。 不惜财宝身，贵欲乘空飞。 至心归命，敬礼北方无极太上至真上上太一君三洞天尊。 次向北方三礼讫忏 臣某等，谨为某家奉修神咒，行道转神咒妙经。 首谢罪愆，断绝魔瘟。 清安宅宇，保护家门。 烧香明灯，思神念真。 归身归神归命。 北方无上玄老太上洞渊三昧神咒三洞天尊，一切神灵。 仰谢北方五气玄天太清上上高皇玉帝虚皇道君，太上老君，太上丈人，太上大道玉晨君，北极真公，文始先生，黑帝皇老，高玄真人，自然童子，北神九真斗中大神，五灵天人，太华九晨高上万重诸天至极上圣众神。 下谢地下北乡无极世界五岳四渍神仙正真。 乞丐原赦某家，七代见存，六亲姻族。 不忠不孝，不爱不慈。 杀盗邪淫，恶口两舌。 绮语妄言，嗔怒悭贪。 罪若丘山，难为缕记。 以今功德，咸乞赦除。 愿某家疫病消除，咸蒙休泰。 伏愿太上垂恩，勅勒宋就文昌风水将军，四天大王，赤赫天都力士黄英等，同共收摄青真大魔，弗旦连子，黄奴都卢那鬼，门户井灶之鬼，承伯阿偏然玄子都等。 瘟毒疫病，一切诸鬼，并令消散。 宅舍清静，万兆康宁。 咸荷道恩，奉宣神咒。 次咒曰： 太上有真言，勑诸妖魅鬼。 暴乱号白头，寒热去瘟尾。 寻常依木石，亦有附山水。 佩法明能师，受箓女男子。 转经救官解，修斋治病起。 邪魔敢不从，剪灭不恕矣。 次颂曰：",
      "translated_text": "May the hundred bones rest in peace. Reverently bearing the grace of the Dao, we proclaim the divine incantations.\n\nThe incantation says:\nThe Dao Lord commands all malevolent spirits below the world—\nIn the year of *renwu*, the cycle of *jiaxu*,\nRed sands slaughter cattle and horses, the Wuwan cut short the people’s lives.\nThose who receive the scriptures and wear the registers,\nThe heavenly soldiers shall guard their bodies.\nThe dead generals shall drive away the visiting ghosts,\nThe mighty warriors shall admonish their kin.\nIf you do not obey our teachings,\nYou shall bear stones and pile them by the night river.\n\nThe hymn says:\nThe spirit of the Western Harvest, named Gou Ni,\nThe Three Luminaries and the Mysterious Void,\nBrightly illuminating the four directions.\nThe thirty-two tones of the eight sounds,\nThe demonic and perverse *qi* shall retreat of themselves.\nToday we establish the fortune-bestowing fast,\nLighting lamps to illuminate the empty radiance.\nThe wind ceases, the rain does not fall,\nSlaying demons and binding wickedness.\nDefeated are the ghosts who dare to test,\nBound and sent to the celestial mechanism.\nPracticing the Dao removes the ten thousand evils,\nThe merit and virtue are most towering.\nThe Dao and its power are most refined,\nThe sagely might revives the dead.\nThe hundred demons return to the one true,\nTo whom shall blessings be added?\nReverently return and follow the Great Dao,\nAccumulating goodness, the spirits shall naturally return.\nThe foolish cannot learn,\nThe wise ever depend upon it.\nNot begrudging wealth or body,\nThey aspire to ride the void and fly.\nWith utmost sincerity, we take refuge and bow,\nReverently paying homage to the Most High and Perfect Supreme Great Unity Lord of the Three Caverns, the Heavenly Worthies of the North.\n\nNext, facing north, we perform the three bows and conclude the repentance.\n\nYour servants, so-and-so and others, respectfully perform the divine incantations and recite the wondrous scripture of the divine incantations for the such-and-such household.\nFirst, we confess our transgressions and sever the demonic pestilence,\nPurifying the dwelling and protecting the household.\nBurning incense and lighting lamps,\nWe contemplate the spirits and meditate upon the true.\nReturning body, spirit, and life.\n\nTo the Supreme Mystery Elder of the North, the Three Modes Divine Incantation of the Cavernous Abyss, the Heavenly Worthies of the Three Caverns, and all divine spirits,\nWe reverently thank the Jade Emperor of the Five *Qi* of the Mysterious Heaven, the Supreme High August Sovereign of the Void, the Dao Lord, the Most High Lord Lao, the Most High Elder, the Jade Dawn Lord of the Great Dao, the True Duke of the North Pole, the Master of Literary Beginnings, the August Elder of the Black Emperor, the High Mystery Perfected, the Natural Youth, the Great Spirits of the Nine Stars within the Dipper, the Celestial Beings of the Five Spirits, the Myriad Layers of the Most High Sagely Hosts of the Great Hua Nine Dawns,\nAnd below, we thank the Perfected and True Immortals of the Five Marchmounts and Four Streams in the boundless world of the northern lands.\n\nWe humbly pray that the Most High may bestow grace, absolving the such-and-such household, its seven generations, living kin, and six relations.\nFor disloyalty and unfiliality, lack of love and compassion,\nFor killing, theft, deviance, and lust, harsh speech and double tongues,\nFor frivolous and reckless words, anger, stinginess, and greed,\nSins as high as mountains, too numerous to recount—\nThrough today’s merit and virtue, may all be absolved and removed.\nMay the such-and-such household’s epidemics and illnesses vanish, and may all enjoy rest and peace.\n\nWe humbly pray that the Most High may bestow grace, commanding Song Jiu, the General of Literary Prosperity, the Wind and Water Generals, the Four Heavenly Kings, the Red and Radiant Celestial Capital Warriors, Huang Ying, and others,\nTogether to seize and capture the Great Demon of Azure Perfection, Fu Dan Lian Zi, the ghost Huang Nu Du Lu Na, the spirits of gates, doors, wells, and hearths, Cheng Bo, A Pian, Ran Xuan Zi Du, and others.\nMay the pestilential poisons, epidemics, and all ghosts be dispersed,\nThe dwelling purified, and the ten thousand fortunes secure in peace.\nReverently bearing the grace of the Dao, we proclaim the divine incantations.\n\nThe incantation says:\nThe Most High has true words,\nCommanding all demonic and spectral ghosts.\nThe violent and disorderly, the White-Headed,\nThe cold and heat, the tails of pestilence—begone!\nThey usually dwell in trees and stones,\nOr cling to mountains and waters.\nThose who wear the talismans, enlightened masters,\nMen and women who receive the registers,\nRecite the scriptures to resolve official entanglements,\nEstablish fasts to cure illnesses.\nHow dare the demonic defy?\nThey shall be cut down and not spared.\n\nThe hymn says:",
      "overlap_context": "the armored conscripts of the ten directions, the Red Slayer Warriors, the Red-Riding Merit Officers, and the Great Expelling General to seize and expel the Xinling Red Crow demons and specters, the ghosts of the living and dead, the spirits of tombs and graves, the chieftain Du Nu Wuliuzi, the Red-Eyed Horned Ghosts, and all such beings, sweeping them away and severing the plague’s roots. May all illnesses and afflictions immediately vanish and be fully cured. May the true qi moisten and adorn.",
      "start_char": 1802,
      "end_char": 2566,
      "start_sentence": 100,
      "end_sentence": 149,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.131405115127563,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\太上洞渊三昧神咒斋忏谢仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "北方郁单越，四运开无地。 号之为玄天，乘空记玄轨。 今日建大斋，禁止百恶鬼。 敢有干试者，徘徊住便死。 太上金口勅，玉皇道君旨。 千妖自然伏，万邪何足比。 今欲咒魔王，小鬼各各忧。 若欲不去者，天丁来下求。 送付三天曹，万邪不得留。 一一告下之，风止雨自休。 不从律令者，司官斩汝头。 至心归命，敬礼东北方无极太上至真上上太一君三洞天尊。 次向束北方三礼讫忏 臣某等，谨为某家奉修神咒，行道转神咒妙经。 首谢罪愆，断截魔瘟。 清安宅宇，保护家眷。 烧香明灯，思神念真。 归身归神归命东北方无上玄老太上洞渊三昧神咒三洞天尊，一切神灵。 仰谢东北方始青天太清无极虚无自然大道至真上圣灵宝始青老君，九天真王，东明虚皇帝君，九灵先生，玉华真人，季高帝真，诸天至极上圣尊神。 下谢地下东北方无极世界五岳四读神仙正真。 乞丐原赦某家，师尊父母，前代今身。 广造诸罪，不行忠孝，轻忽人恩，六度卒修，四等无业，阴愆阳过，衅积淇海。 以今忏谢，咸乞原除。 愿某家瘟毒普消，并蒙惧泰。 伏愿太上垂恩，勑太上真骑，夫女玉女，大魔犁洪，五方十方灵童主者，大杀将军，甲卒力士，收捕五精七吹，贾元慎忧等，及乌丸黄奴兄弟瘟灾。 一切邪精疫毒，诃摄灭逐，并令消灭。 乞某家清安，人民休泰，仰赖太上罔极之恩。 奉宣明威，驱瘟神咒。 次咒曰： 老君弘至教，以消中国灾。 戊寅称附子，庚寅名大雷。 忧连主口舌，郝景耗钱财。 神咒声一发，鬼贼身万摧。 金铁前行诛，火铃后阵催。 急去千里外，不得暂徘徊。 次颂曰：",
      "translated_text": "In the northern realm of Yüdanuyue, the four seasons unfold without earthly bounds.\nIt is named the Mysterious Heaven, riding the void to trace the dark celestial tracks.\nToday we establish the great fast, forbidding all evil ghosts.\nShould any dare to test this decree, they shall wander and perish where they stand.\nBy the golden edict of the Most High, by the mandate of the Jade Emperor and the Dao Lord,\nA thousand demons naturally submit; ten thousand evils—how could they compare?\nNow we conjure the demon kings, and every petty ghost trembles in dread.\nShould any refuse to depart, the Heavenly Soldiers shall descend to seize them.\nConsigned to the Three Celestial Courts, not a single evil may remain.\nEach is commanded thus: the winds shall cease, the rains shall still.\nThose who defy this law and decree shall have their heads struck off by the celestial officers.\n\nWith utmost sincerity, we turn and submit, reverently bowing to the Boundless Most High Perfect and True Supreme Great Unity Lord, the Three Caverns’ Heavenly Worthies of the northeast.\n\nNext, facing the northeast, we perform the triple bow and conclude the repentance.\n\nYour servants, so-and-so and others, respectfully perform this divine incantation and recite the wondrous scripture of the divine incantation for the sake of such-and-such household.\nFirst, we confess our transgressions and sever the demonic pestilence.\nWe purify the dwelling and protect the household.\nLighting incense and bright lamps, we meditate on the spirits and contemplate the true.\nWe submit body, spirit, and life to the Boundless Supreme Mysterious Elder, the Most High Cavernous Samādhi Divine Incantation, the Three Caverns’ Heavenly Worthies of the northeast, and all divine spirits.\n\nWe look up in gratitude to the Primordial Azure Heaven of the Grand Clarity, the Boundless Void and Spontaneous Great Dao, the Perfect and True Supreme Sacred Numinous Treasure, the Primordial Azure Elder Lord, the Nine Heavens’ True Kings, the Eastern Radiance Void Emperor Lord, the Nine Numinous Masters, the Jade Flower Perfected, the Seasonal High Imperial Perfected, and all the supreme sacred deities of the heavens.\n\nBelow, we express gratitude to the divine immortals and true perfected of the five sacred peaks and four streams in the boundless world beneath the earth in the northeast.\n\nWe beseech forgiveness and absolution for the household of so-and-so, for our masters, our parents, for past lives and the present one.\nWe have committed manifold transgressions: failing in loyalty and filial piety, slighting the kindness of others, leaving the Six Perfections unfinished, neglecting the Four Immeasurables, accumulating hidden faults and manifest errors, our offenses heaped as high as the seas.\nThrough this repentance, we humbly beg for their complete absolution.\nMay the pestilential poisons of this household be universally dispelled, and may all enjoy peace and prosperity.\n\nWe prostrate ourselves, praying that the Most High will bestow grace, commanding the Perfected Riders of the Most High, the Husband and Wife Jade Maidens, the Great Plow of the Demon King, the spirit youths and masters of the five and ten directions, the Great Slayer Generals, the armored soldiers and valiant warriors, to capture and seize the Five Essences, the Seven Blasts, Jia Yuan, Shen You, and others, along with the Wūwán and Huángnú brothers and the pestilential disasters.\nMay all demonic essences and epidemic poisons be rebuked, seized, destroyed, and banished, utterly annihilated.\nWe pray that this household may enjoy purity and peace, its people rest and prosperity, relying upon the boundless grace of the Most High.\n\nWe proclaim the mighty power and expel the pestilential spirits with the divine incantation.\n\nThe incantation says:\nThe Elder Lord expounds the supreme teaching to dispel the Middle Kingdom’s calamities.\nOn wùyín, it is called Aconite; on gēngyín, it is named Great Thunder.\nYou Lian presides over strife; Hao Jing drains wealth.\nAt the first utterance of the divine incantation, the bodies of ghostly thieves are shattered ten thousandfold.\nGold and iron advance to execute; fire bells press from the rear.\nHasten a thousand miles away—do not dare to linger even briefly.\n\nThe hymn says:",
      "overlap_context": "igh has true words,\nCommanding all demonic and spectral ghosts.\nThe violent and disorderly, the White-Headed,\nThe cold and heat, the tails of pestilence—begone!\nThey usually dwell in trees and stones,\nOr cling to mountains and waters.\nThose who wear the talismans, enlightened masters,\nMen and women who receive the registers,\nRecite the scriptures to resolve official entanglements,\nEstablish fasts to cure illnesses.\nHow dare the demonic defy?\nThey shall be cut down and not spared.\n\nThe hymn says:",
      "start_char": 2566,
      "end_char": 3188,
      "start_sentence": 150,
      "end_sentence": 185,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.14799976348877,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\太上洞渊三昧神咒斋忏谢仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "东北艮之子，号之曰文灵。 玄光照一．切，建斋度众生。 斋契乃千载，立功游凤城。 度死拯风波，静默欲全形。 然灯照三光，不得令风起。 太上勅魔王，悉令风雨止。 至心归命，敬礼东南方无极太上至真上上太一君三洞天尊 次向东南方三礼讫忏 臣某等，谨为某家奉修神咒，行道转神祝妙经。 首谢罪愆，断截魔瘟。 清安宅宇？ 保护家宅。 烧香明灯，思神念真。 归身归神归命东南方无上玄老太上洞渊三昧神咒三洞天尊，一切神灵。 仰谢东南方始丹天太清洞极虚无自然至真上圣灵宝始赤阳元老君，南方无极老子，太和先生，三灵玄上万福皇老丈人，丹灵高皇孟帝，太阳真人，好生度命司马，玄真三元君，紫灵虚皇道君，朱宫赤精，南昌司命，四极真人，诸天至极上圣尊神。 下谢地．下东南乡无极世界五岳四演真人，至极上仙正真。 乞丐原赦某家，违误君亲，不顺天地。 杀盗邪淫，妄言绮语。 悭贪嗔怒，嫉拓贤能。 阴恶千愆，大罪无极。 因今忏礼，特乞消徐。 愿某家厄难远祛，咸蒙福庆。 伏乞太上垂恩，告勑三天大兵，九天玉女，天杀大兵，天禁大吏，天蓬守士，玄中主者，正一功 曹等，摄录收缚百龙，剪乌丸李子敖、水中射公、十二疟病、六畜奴婢鬼等，驱除斥逐，消灭荡除。 令某家和谐圻庆，咸乐太平。 普令一切，荷负生成。 宣勑明威，奉行神咒。 次咒曰： 老君有明诰，遍勑中国邦。 大鬼与小鬼，魔王及邪王。 岁次甲戌后，人衰鬼贼强。 九月涂伦那，三天勾婆羌。 诵经持箓者，魍魉辄形相。 大上垂正法，当灭诸灾殃。 次颂曰： 东南巽之神，游驰天下河。 九河振四海，五岳驱汝病。 真人启十方，建斋静玄波。 百邪不敢起，禁勅一切魔。 若有妖□鬼，斩付须他罗。 三官伏不起，依如女青科。 至心归命，敬礼西南方无极太上至真上上太一君三洞天尊。 次向西南方三礼讫忏 臣某等，谨为某家奉修神咒，行道转神咒妙经。 首谢罪愆，断截魔瘟。 清安宅宇，保护家门。 烧香明灯，思神念真。 归身归神归命西南方无上玄老太上洞渊三昧神咒三洞天尊，一切神灵仰谢西南方始素天太清玄极虚无自然皓灵上皇上元素灵道君，金华至真灵宝始素老君，三天玉皇，紫阳真公，斗中四真，元阳帝君，紫精先生，万福万气万度万生君，西明太灵虚皇道君，金阙素灵七真玉华君，诸天至极上圣尊神。 下谢地下西南乡无极世界五岳四渎神仙正真。 乞丐原赦某家，违犯二仪，秽慢三景。 不崇四序，轻侮五常。 泄露灵文，乖违仙圣。 三元八节，十直吉辰，纵恣六情，造罪无数。 以今陈首，咸乞荡除。 愿某家福善装严，常蒙吉庆。 伏愿太上垂恩，勑摄九天大魔，太阴官二十四万人，导示君真人，尼和万和士，百舌吏，九天主者，并心同力，收摄瘟毒。 魔王高邻子，羌胡氏撩，赤乌赤连，坏军死将及乌鬼等，速令消灭。 真气流行，万人安泰。 宣勅明威，奉行神咒。 次咒曰： 老君勑群魔，皆令伏大道。 若见转经人，卫护令精好。 丁灵与羌虏，木索并氐撩。 大头为大湿，夷鬼作乾燥。 明真持赤棒，生如附青草。 闻咒须急去，迟回劈破脑。 次颂曰： 西南坤之母，伏神告天庭。 建斋度七世，一切长夜明。 功积升玄都，风止雨不行。",
      "translated_text": "The son of the northeast, Gèn, is named Wénlíng.\nHis dark radiance illumines all, as he establishes fasts to deliver sentient beings.\nThe fast’s covenant spans a thousand ages; he builds merit and roams the Phoenix City.\nDelivering the dead and rescuing those adrift on winds and waves, he seeks stillness to preserve his form.\nHe kindles lamps to illuminate the Three Luminaries—let no wind arise.\nThe Most High commands the demon kings, bidding all wind and rain to cease.\n\nWith utmost sincerity, we prostrate and pay homage, reverently bowing to the Boundless Most High Perfectly Real Supreme Great Unity Lord, the Three Caverns’ Heavenly Worthies of the southeast.\n\nNext, we bow three times toward the southeast and make confession.\n\nWe, your servants, reverently perform for this household the divine incantations, conducting the Dao and reciting the wondrous scriptures of the divine prayers.\nFirst, we repent our transgressions and sever the demonic pestilence.\nMay the dwelling be purified and at peace? May the household be safeguarded.\nWe burn incense and kindle bright lamps, contemplating the spirits and invoking the Perfected.\nWe dedicate body, spirit, and life to the Boundless Supreme Elder of the Dark Mystery, the Three Caverns’ Heavenly Worthies of the Samādhi Divine Incantations of the Abyssal Cavern in the southeast, and all divine spirits.\nWe humbly thank the Primordial Cinnabar Heaven of the Grand Clarity, the Cavernous Ultimate of the Void and Spontaneous Perfection, the Most Sacred Numinous Treasure’s Primordial Crimson Yang Elder Lord in the southeast; the Boundless Elder of the South; the Master of Supreme Harmony; the Three Spirits’ Mysterious Supreme Myriad Blessings August Elder; the Crimson Numinous August Emperor Mèng; the Perfected of the Great Yang; the Marshal of Life-Nurturing and Destiny-Deliverance; the Three Primordials of the Dark Mystery; the Purple Numinous Void August Lord of the Dao; the Vermilion Palace’s Crimson Essence; the Director of Fates of Nánchāng; the Perfected of the Four Poles; and all the Most Sacred and Supreme Honored Spirits of the heavens.\n\nNext, we thank the Perfected and True Immortals of the Five Peaks and Four Waterways in the boundless world of the southeast below.\n\nWe beseech forgiveness and pardon for this household’s offenses: disobedience to ruler and kin, discord with Heaven and Earth;\nkilling, theft, deviant lewdness, reckless speech, and frivolous words;\nstinginess, greed, wrath, and envy of the worthy;\nhidden evils and myriad transgressions—grievous sins without limit.\nThrough this repentance and rite, we specially implore their dissolution.\nMay this household’s adversities and hardships be far dispelled, and may all receive blessings and felicity.\nWe humbly beseech the Most High to bestow grace, commanding the Great Armies of the Three Heavens, the Jade Maidens of the Nine Heavens, the Celestial Executioners, the Celestial Wardens, the Celestial Guardians of Tiānpéng, the Masters of the Mysterious Center, the Orthodox Unity’s Merit Officers, and others to capture and bind the Hundred Dragons, sever the Wūyuán Lǐ Zǐ’áo, the Archer in the Waters, the Twelve Malarial Demons, and the ghostly servants of the six livestock. Drive them out, expel them, annihilate and eradicate them.\nMay this household enjoy harmony, joy, and prosperity, and may all delight in great peace.\nMay all universally bear the blessings of life and growth.\nWe proclaim the mighty power and perform the divine incantations.\n\nThe incantation says:\nThe Elder Lord issues a luminous decree, commanding all within the Middle Kingdom.\nGreat ghosts and lesser ghosts, demon kings and evil kings—\nafter the year jiǎxū, human fortunes wane while ghostly thieves grow strong.\nIn the ninth month, Tú Lúnnà; the Three Heavens summon Gōupó Qiāng.\nThose who recite scriptures and uphold registers—specters and demons manifest their forms.\nThe Most High bestows the true Dharma to eradicate all calamities and misfortunes.\n\nThe hymn says:\nThe spirit of the southeast, Xùn, roams the rivers under Heaven.\nThe Nine Rivers shake the Four Seas; the Five Peaks drive away your illnesses.\nThe Perfected open the Ten Directions, establishing fasts to still the dark waves.\nNo demon dares arise; all demons are restrained and commanded.\nIf there are malevolent ghosts, behead them and consign them to Xūtuóluó.\nThe Three Officials dare not stir, adhering to the statutes of the *Nǚqīng*.\n\nWith utmost sincerity, we prostrate and pay homage, reverently bowing to the Boundless Most High Perfectly Real Supreme Great Unity Lord, the Three Caverns’ Heavenly Worthies of the southwest.\n\nNext, we bow three times toward the southwest and make confession.\n\nWe, your servants, reverently perform for this household the divine incantations, conducting the Dao and reciting the wondrous scriptures of the divine prayers.\nFirst, we repent our transgressions and sever the demonic pestilence.\nMay the dwelling be purified and at peace, and the household be safeguarded.\nWe burn incense and kindle bright lamps, contemplating the spirits and invoking the Perfected.\nWe dedicate body, spirit, and life to the Boundless Supreme Elder of the Dark Mystery, the Three Caverns’ Heavenly Worthies of the Samādhi Divine Incantations of the Abyssal Cavern in the southwest, and all divine spirits.\nWe humbly thank the Primordial Plain Heaven of the Grand Clarity, the Mysterious Ultimate of the Void and Spontaneous Perfection, the August Lord of the Radiant Numinous Origin in the southwest; the Primordial Plain Elder Lord of the Numinous Treasure; the Jade Emperor of the Three Heavens; the Perfected Lord of Purple Yang; the Four Perfected of the Dipper; the August Lord of Primordial Yang; the Master of Purple Essence; the Lord of Myriad Blessings, Myriad Qi, Myriad Deliverances, and Myriad Births; the August Lord of the Void Mystery of the Western Clarity; the Seven Perfected of the Golden Palace’s Plain Numinous Jade Splendor; and all the Most Sacred and Supreme Honored Spirits of the heavens.\n\nNext, we thank the Perfected and True Immortals of the Five Peaks and Four Waterways in the boundless world of the southwest below.\n\nWe beseech forgiveness and pardon for this household’s offenses: violating the Two Modes, defiling the Three Luminaries;\ndisregarding the Four Seasons, slighting the Five Constants;\ndivulging sacred texts, defying the Immortals and Sages;\non the Three Primordials, Eight Festivals, and Ten Auspicious Days, indulging the Six Passions and committing countless transgressions.\nThrough this confession, we implore their complete eradication.\nMay this household’s blessings and virtues be adorned and ever receive felicity.\nWe humbly beseech the Most High to bestow grace, commanding and capturing the Great Demons of the Nine Heavens, the twenty-four myriad beings of the Palace of Great Yin, the Perfected Guiding Lords, the Níhé and Wànhé officers, the Hundred-Tongued Officials, the Masters of the Nine Heavens, and all to unite in purpose and power to capture and restrain the pestilential toxins.\nThe demon king Gāolínzǐ, the Qiāng and Hú clans Liáo, the Crimson Crows and Crimson Lián, the generals and commanders who perished in battle, and the Black Ghosts—swiftly annihilate them.\nMay the true qi flow freely, and may the myriad people enjoy peace and prosperity.\nWe proclaim the mighty power and perform the divine incantations.\n\nThe incantation says:\nThe Elder Lord commands the demon hosts, bidding them all submit to the Great Dao.\nIf they encounter one who recites scriptures, protect and guard them to ensure their purity.\nDīnglíng and Qiāng barbarians, the Mùsuǒ and Dī Liáo—\nthe Great-Headed become Great Dampness; the Yí ghosts turn to dryness.\nThe Perfected of Clarity wield crimson rods, growing like green grass.\nHear the incantation and depart swiftly—linger, and your skulls shall be split.\n\nThe hymn says:\nThe mother of the southwest, Kūn, subdues spirits and reports to the Celestial Court.\nEstablishing fasts to deliver seven generations, all in the long night are illuminated.\nMerits accumulate to ascend the Dark Capital; winds cease and rains do not fall.",
      "overlap_context": "ion.\n\nThe incantation says:\nThe Elder Lord expounds the supreme teaching to dispel the Middle Kingdom’s calamities.\nOn wùyín, it is called Aconite; on gēngyín, it is named Great Thunder.\nYou Lian presides over strife; Hao Jing drains wealth.\nAt the first utterance of the divine incantation, the bodies of ghostly thieves are shattered ten thousandfold.\nGold and iron advance to execute; fire bells press from the rear.\nHasten a thousand miles away—do not dare to linger even briefly.\n\nThe hymn says:",
      "start_char": 3188,
      "end_char": 4436,
      "start_sentence": 186,
      "end_sentence": 255,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.46206021308899,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\太上洞渊三昧神咒斋忏谢仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "束妖除万邪，天人来下并。 四运改劫祚，道亦因此生。 至心归命，敬礼西北方无极太上至真上上太．一君三洞天尊。 次向西北方三礼讫忏 臣某等，谨为某家奉修神咒，行道转神咒妙经。 首谢罪愆，断截魔瘟。 清安宅宇，保护家门。 烧香明灯，思神念真。 归身归神归命西北方无上玄老太上洞渊三昧神咒三洞天尊，一切神灵。 仰谢西北始玄天高上元皇道君，九天元灵洞宝太上真老，无量太华灵宝始玄老君，皇上天人，北玄九盖华晨君，天门度世飞天羽郎，玉仙总真，监灵司马，上古三师，大圣众至真，诸君 丈人，诸天至极上圣众神。 下谢地下西北乡无极世界五岳四渍神仙正真。 乞丐原赦某家，杀盗邪淫，怪贪嫉拓。 嗔恚憎，两语绮古。 。 无量罪愆，咸乞除荡。 存亡两代，并赐安贞。 伏愿太上流恩，勅遣九天魔王，十方主者，三天力士，天绉甲卒，一切真神，收捕邪精，五瘟疫毒，山林水火，风土木索斗枷鬼，忧连文庆子等恼害人间者。 斥去千里，皆令荡灭。 使真气流行，元精润育。 万人和泰，家宅清宁，仰荷大道覆育之恩。 宣勅明威，奉行神咒。 次咒曰： 太上敷妙经，救疗万人病。 辰巳午未年，灾毒鬼官盛。 奉经分券人，得免干时横。 赤疫随咒死，黑气应声进。 不得乱人间，勿妄干吾正，锋刀斩汝形，寸断无坚硬。 次颂曰： 西北乾之父，号日天地精。 九气合为一，五极会众生。 今日建斋颂，然灯照玄星。 三光耀阤罗，朗朗长夜明。 玄光照一切，祈福度众生。 积功求升仙，截劫邪魔兵。 一切断风尘，干试束鬼形。 至心归命，敬礼上方无极太上至真上上太一君三洞天尊。 次上方向天门三礼讫忏 臣某等，谨为某家奉修神咒，行道转神咒妙经。 首谢罪愆，断截魔瘟。 清安宅宇，保护家门。 烧香明灯，思神念真。 归身归神归命上方三十二天无上玄老太上洞渊三昧神咒三洞天尊，一切神灵。 仰谢上方无极太上灵宝天尊，无极诸天太上无形无名无穷无极至真太上大道高皇太帝，九天元父，元始天王，元始丈人，至极灵宝洞玄太上元灵老君，无极大圣众，至真诸君丈人，诸天至极上圣众尊。 下谢地下上方无极世界五岳四渍神仙正真。 乞丐原赦某身形，举措心意，运为两语，评论动违科式。 瘟灾疾病，官私口舌。 恐见中伤，不蒙度脱。 归心至道，建斋祈福。 首谢存亡，万罪千愆，秽污三景。 伏乞大道降灵，诸天拥护。 愿以 是功德，归流其家，存亡二代，七玄眷属，并得免离幽夜，出处光明。 上即轮化升仙，中得游神挣土，下即反生人间。 候王之门，遭遇三宝，结友善缘。 转输福庆，克获神仙，福流某家。 尊卑长幼，所苦众患，宿疾瘟风，泠毒疫疠时行，并蒙痊愈。 医药得效，表裹康休。 五脏调和，六府宣畅。 解释罗网，度脱灾凶。 增算益年，寿延无量。 世途光显，爵禄升迁。",
      "translated_text": "Binding demons and expelling the myriad evils, heaven and humanity descend as one.\nThe four seasons transform the kalpa’s fate—thus does the Dao arise.\nWith utmost sincerity, we bow in reverence and pay homage to the Boundless, Most Supreme, Utmost Perfected, Supreme Great One Lord of the Three Caverns, Heavenly Worthy of the Northwest.\n\nNext, facing the northwest, we perform the threefold prostration and repent.\nWe, your servants [Name] and others, reverently undertake this ritual for the [Family Name] household, reciting the divine incantations and circulating the *Mysterious Scripture of Divine Incantations*.\nFirst, we confess transgressions and sever demonic plagues.\nWe purify the dwelling and safeguard the household.\nBurning incense and kindling lamps, we meditate upon the gods and contemplate the Perfected.\nWe dedicate body, spirit, and life to the Boundless, Most Supreme, Mysterious Elder, Most High Lord of the Cavernous Abyss Samādhi Divine Incantations, the Three Cavern Heavenly Worthies, and all divine spirits.\n\nGazing upward, we give thanks to the Primordial Sovereign of the Mysterious Heaven in the Northwest, the Supreme Origin Emperor of the Nine Heavens; to the Boundless, Most Resplendent Numinous Treasure, Primordial Elder Lord; to the August Heavenly Ones; to the Nine-Canopied Flower Dawn Lord of the Northern Mystery; to the Heavenly Gate Transcendents, Flying Feathered Lords; to the Jade Immortals, Assembly of Perfected; to the Inspectors of Spirits; to the Three Ancient Masters; to the Great Sage Host of Utmost Perfected; to all the Venerable Lords and Heavenly Worthies; and to the Supreme Sage Hosts of the Gods.\n\nBelow, we give thanks to the Perfected Immortals of the Five Peaks and Four Streams in the Boundless World of the Northwest.\nWe beseech forgiveness and absolution for the household’s sins: killing, theft, deviant lust, monstrous greed, and envious grasping.\nWrath, hatred, slander, and frivolous speech—\ncountless transgressions—we beg to have wholly eradicated.\nFor both the living and the dead, we pray for peace and stability.\n\nWe humbly pray that the Most High bestow grace, commanding the Demon Kings of the Nine Heavens, the Masters of the Ten Directions, the Celestial Warriors, the Armored Soldiers of Heaven, and all true gods to seize and capture evil spirits, the five pestilences, epidemic poisons, and the malevolent forces of mountains, forests, water, and fire—wind, earth, the *Mùsuǒ* and *Dòujiā* ghosts, the *Yōulián Wénqìngzǐ*, and all who afflict humankind.\nBanish them a thousand *lǐ* and annihilate them utterly.\nLet true *qi* flow freely, primordial essence nurture and flourish.\nMay ten thousand people live in harmony and peace, households dwell in purity and tranquility.\nWe look up to receive the encompassing grace of the Great Dao.\nThe mighty power is proclaimed, and the divine incantations are performed.\n\nThe incantation says:\nThe Most High unfurls the wondrous scripture, healing the ailments of ten thousand.\nIn the years of *chén*, *sì*, *wǔ*, and *wèi*, plague spirits and demon officials thrive.\nThose who recite and distribute this scripture shall be spared from calamities of the times.\nThe red pestilence dies with the incantation; black *qi* retreats at its sound.\nDo not disturb the human realm, nor recklessly assail our righteousness.\nSwords shall sever your forms, cutting you to pieces without resistance.\n\nThe hymn says:\nThe father of the northwest, *Qián*, is called the essence of heaven and earth.\nThe nine *qi* unite as one; the five poles gather all beings.\nToday we establish the fast and chant, lighting lamps to illumine the mysterious stars.\nThe Three Luminaries shine upon the *Tuóluó*; the long night grows bright and clear.\nMysterious light illumines all—we pray for blessings to deliver all beings.\nAccumulating merit to ascend as immortals, we sever the kalpa’s demonic armies.\nAll winds and dust are cut off; trials bind the forms of ghosts.\nWith utmost sincerity, we bow in reverence and pay homage to the Boundless, Most Supreme, Utmost Perfected, Supreme Great One Lord of the Three Caverns, Heavenly Worthy of the Upper Realm.\n\nNext, facing the Heavenly Gate in the upper realm, we perform the threefold prostration and repent.\nWe, your servants [Name] and others, reverently undertake this ritual for the [Family Name] household, reciting the divine incantations and circulating the *Mysterious Scripture of Divine Incantations*.\nFirst, we confess transgressions and sever demonic plagues.\nWe purify the dwelling and safeguard the household.\nBurning incense and kindling lamps, we meditate upon the gods and contemplate the Perfected.\nWe dedicate body, spirit, and life to the Thirty-Two Heavens’ Boundless, Most Supreme, Mysterious Elder, Most High Lord of the Cavernous Abyss Samādhi Divine Incantations, the Three Cavern Heavenly Worthies, and all divine spirits.\n\nGazing upward, we give thanks to the Boundless, Most Supreme Numinous Treasure Heavenly Worthy of the Upper Realm; to the Boundless, Formless, Nameless, Infinite, and Limitless Utmost Perfected, Most High Emperor of the Great Dao; to the Primordial Father of the Nine Heavens; to the Primordial Heavenly King; to the Primordial Venerable Lord; to the Utmost Numinous Treasure, Cavernous Mystery, Most High Primordial Elder Lord; to the Boundless Host of Great Sages; to the Utmost Perfected and all Venerable Lords; and to the Supreme Sage Hosts of the Gods.\n\nBelow, we give thanks to the Perfected Immortals of the Five Peaks and Four Streams in the Boundless World of the Upper Realm.\nWe beseech forgiveness and absolution for our bodily forms, thoughts, and deeds—utterances and judgments that violate the ordained rites.\nPlagues, illnesses, official and private disputes, slander, and harm—\nwe fear being ensnared and not delivered.\nTurning our hearts to the Utmost Dao, we establish the fast and pray for blessings.\nFirst, we confess for the living and the dead: ten thousand sins, a thousand transgressions, defilement of the Three Luminaries.\nWe humbly pray that the Great Dao descend its numen, that the myriad heavens grant protection.\nMay these merits flow to the household, to the living and the dead, to the seven generations of kin—\nall delivered from the dark night, emerging into light.\nAbove, may they ascend through transformation as immortals; in the middle, may they roam as spirits in the earthly realm; below, may they be reborn among humans.\nAt the gates of kings and lords, may they encounter the Three Treasures and forge bonds of goodness.\nMay blessings and fortune be transmitted, attaining immortality and flowing to the household.\nFor the honored and the humble, the elder and the young—\nall afflictions, chronic illnesses, pestilential winds, cold poisons, epidemics, and seasonal plagues—\nmay they all be healed.\nMay medicine prove effective, bringing health within and without.\nMay the five viscera be harmonized, the six bowels flow freely.\nMay the nets of entanglement be untied, calamities and misfortunes delivered.\nMay years be added to our lifespan, longevity extended without limit.\nMay our paths in the world shine brightly, ranks and emoluments ascend.",
      "overlap_context": "ī Liáo—\nthe Great-Headed become Great Dampness; the Yí ghosts turn to dryness.\nThe Perfected of Clarity wield crimson rods, growing like green grass.\nHear the incantation and depart swiftly—linger, and your skulls shall be split.\n\nThe hymn says:\nThe mother of the southwest, Kūn, subdues spirits and reports to the Celestial Court.\nEstablishing fasts to deliver seven generations, all in the long night are illuminated.\nMerits accumulate to ascend the Dark Capital; winds cease and rains do not fall.",
      "start_char": 4436,
      "end_char": 5528,
      "start_sentence": 256,
      "end_sentence": 317,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.52766966819763,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\太上洞渊三昧神咒斋忏谢仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "入为公相，出宰方岳。 奉上接下，一切惧心。 永保元亨，所为皆合。 伏愿太上流恩，劫黄英力士，正一功曹使者，九天大兵，天人玉        女，收捉盈女盆子，赤头魔鬼，赤丁火鬼，赤索白下，赤都鬼等，悉令诛灭荡除。 使正气安和，人咸清润，宅舍平安，仰荷圣恩。 告示明威，奉宣神咒。 次咒曰： 天尊有明教，鬼神当须听。 罗翁并大野，华元与小陵。 角子从此息，都奴更莫兴。 洞渊斋已建，妖逆气须澄。 强梁不伏者，缚之以赤绳。 劈头千万分，膏流血亦凝。 次颂曰： 上方无极天，巍巍三光舒。 今日建福田，然灯照玄虚。 迢迢九天气，翩翩见麻姑。 乘空驾六龙，天人束帝夫。 魔王止风雨，太上告不虚。 奉阿尊妙经，自然食天厨。 大水弥劫运，道士游天衢。 自然与俗异，水上如龙鱼。 逍遥入紫室，徘徊归太无。 至心归命，敬礼下方无极太上至真上上太一君三洞天尊。 次下方向地户三礼讫忏 臣某等，谨为某家奉修神咒，行道转神咒妙经。 首谢罪愆，断截魔瘟。 清安宅宇，保护家门。 烧香明灯，思神念真。 归身归神归命下方七十二泽无上玄老太上洞渊三昧神咒三洞天尊，一切神灵。 仰谢下方玄黄天无上无极无色无量无数太上大道九百九千九万亿道气天老，九天玄母，太黄元君，九天真老，玉虚皇老丈人，太极真人，黄老黄帝，黄老天人，元黄中帝，五老上 仙，诸天至极上圣尊神。 下谢地下下方无极世界五岳四渍神仙正真。 乞丐原赦某家，合门长幼，七世先灵，父母师尊，六亲姻族，一切众生。 自从旷劫，爰至今生。 三业六根，广造诸罪。 秽污山水，犯触灵祇。 受对幽冥，致招灾害。 以兹忏谢，咸乞荡除。 愿某家存亡获福，永无灾祸。 尊卑大小，宿疾普消。 百体宣调，增益年寿。 福禄光显，内外康休。 宅宇清安，万方交泰。 伏愿太上垂恩，真灵降佑。 劫勒十方主者，大梵天王，八部禁官，大明监神，回杀使者，天丁力士，收捕乌丸黄奴，连子赤索，大鬼头然百供玄子都等，毒疾杂病班黄之鬼。 一切灾凶，并令诛剪。 邪精瘟贼，域灭无余。 仰荷弘济罔极之恩，宣勃明威，奉行神咒。 次咒曰： 天尊真净法，治鬼护群生。 甲子万病下，壬辰亿鬼行。 黄瘟锺士季，赤毒夏侯婴。 急却离墙陌，不得傍门庭。 吾有十将军，两眼如流星，朝夕专瞰鬼，嚼碎无全形。 次烦曰： 下方无际运，冥冥劫修长。 仰顾三天上，朗朗晖三光，今日欲然灯，十真禁魔王。 静风勿令雨，道士游帝乡。 玉女启三光，六度观上皇。 今日集法师，神仙振十方。 至心归命，敬礼中央无极太上至真上上太一君三洞天尊。 次向西南方人门三礼讫忏 臣某等，谨为某家建斋行道。 救治疾病，驱遣魔瘟，禳灾却害。 以是功德，乞谢某家存亡，千愆万罪，并乞原除。 勅遣十方天丁，三十六天力士，覆护某家六亲大小，男女良贱。 随所救护之处，禁诸疫鬼，不得扰乱。 收除客死云中李子敖大殃，走死六畜人形，五木百魅，蛮夷氏虾羌胡伧虏，山上山下，水中火中，门户井灶，宅舍墙篱。 万种之鬼，一切剪除，荡散消灭。 入地千丈，随时陷没，无有遗余。 一切惧泰，仰荷圣恩。 宣勑明威，奉行神咒。 次咒曰： 太上金口勑，要誓一切魔。",
      "translated_text": "Within, may they serve as ministers and chancellors; without, may they govern the provinces.\nIn reverence toward superiors and compassion toward inferiors, may all conduct be marked by awe.\nMay they forever preserve primal harmony, their every endeavor meeting with accord.\n\nWe humbly pray that the Most High bestow grace,\nthat the Yellow Efflorescence Valiant Warriors, the Orthodox Unity Functionaries and Messengers,\nthe Nine Heavens’ Great Hosts, the Heavenly Maidens of Jade,\nseize and bind Yingnü, Penzi, the Red-Headed Demons, the Red Ding Fire Ghosts,\nthe Red Cord White Underlings, the Red Capital Ghosts, and all such beings,\ncommanding their utter annihilation and eradication.\nThus may the upright qi settle in peace, all people be pure and refreshed,\nand households dwell in safety, ever beholden to the sagely favor.\n\nProclaiming the luminous majesty, we reverently recite the divine incantation.\nThe incantation declares:\n\nThe Heavenly Worthy’s radiant teaching—\nghosts and spirits must heed.\nLuoweng and Daye,\nHuayuan and Xiaoling,\nlet Jiaozi henceforth cease,\nlet Dunu no more arise.\nThe Cavern Abyss Retreat now established,\nthe qi of rebellion and perversity must be stilled.\nThose who remain defiant and unyielding—\nbind them with red cords,\nsplit their heads into ten thousand pieces,\nlet their fat flow and blood congeal.\n\nNext, the hymn intones:\n\nAbove, the boundless heavens of the Highest Realm,\nthe majestic Three Luminaries unfold their splendor.\nToday we cultivate the field of blessings,\nlighting lamps to illumine the Mystery.\nThe distant qi of the Nine Heavens,\nthe graceful descent of Ma Gu—\nriding the void, driving the six dragons,\nthe Heavenly Maidens attend the Emperor’s Husband.\nThe Demon Kings halt wind and rain,\nthe Most High’s decree is no falsehood.\nRevering the sublime and wondrous scripture,\nnaturally we feast from the celestial kitchens.\nGreat waters flood the kalpas,\nyet Daoists wander the celestial thoroughfares.\nNaturally distinct from the vulgar,\nthey glide over water like dragons and fish.\nCarefree, they enter the Purple Chamber,\nlingering as they return to the Great Nothingness.\n\nWith utmost sincerity, we prostrate and take refuge,\npaying reverence to the Most High, Utmost Real, Supreme, Supreme Unity Lord,\nthe Three Caverns’ Heavenly Worthies of the Lower Realm.\n\nNext, facing the earthly portal of the lower realm, we bow thrice and conclude the repentance.\n\nYour servants, so-and-so, respectfully perform for such-and-such household\nthe recitation of divine incantations and the circumambulation of the wondrous scripture.\nFirst, we confess transgressions and sever demonic pestilence,\npurifying the dwelling and safeguarding the household.\nBurning incense and kindling lamps, we meditate on the spirits and contemplate the Real.\nWe dedicate body, spirit, and life to the Seventy-Two Marshes’ Supreme Mysterious Elder,\nthe Most High Cavern Abyss Samādhi Divine Incantation’s Three Caverns’ Heavenly Worthies,\nand all divine numina.\n\nGazing upward, we give thanks to the Mysterious Yellow Heaven’s\nMost High, Boundless, Formless, Measureless, Innumerable Great Dao’s\nNine Hundred Ninety-Nine Thousand Nine Hundred Million Qi-Heaven Elders;\nthe Nine Heavens’ Mysterious Mother; the Supreme Yellow Primordial Lord;\nthe Nine Heavens’ True Elder; the Jade Void August Elder Lord;\nthe Supreme Ultimate Perfected; the Yellow Elder and Yellow Emperor;\nthe Yellow Elder Heavenly Beings; the Primordial Yellow Central Emperor;\nthe Five Elders and Upper Immortals; and all the Most Exalted Sage Deities of the Heavens.\n\nBelow, we give thanks to the nether regions of the boundless world,\nthe Five Marchmounts, the Four Streams, and the divine immortals of true perfection.\n\nWe beseech forgiveness and absolution for such-and-such household,\nall its members, young and old, the seven generations of ancestral spirits,\nparents and teachers, the six relations and kin, and all sentient beings.\nFrom kalpas past to the present life,\nthrough the three karmas and six senses,\nwe have committed manifold transgressions,\ndefiled mountains and waters, and offended the numinous deities.\nWe have faced retribution in the dark realms,\nbringing upon ourselves calamities and misfortunes.\nThrough this repentance, we humbly pray for their complete eradication.\nMay the living and deceased of such-and-such household attain blessings\nand forever be free from disasters and misfortunes.\nMay the honored and the humble, the elder and the young,\nfind all chronic illnesses universally dispelled,\nall limbs harmonized, and years and longevity increased.\nMay fortune and emolument shine brightly, health prevail within and without.\nMay dwellings be pure and secure, all directions prosper in harmony.\n\nWe humbly pray that the Most High extend grace,\nthat the true numina descend with protection.\nWe command the wardens of the ten directions,\nthe Great Brahmā Heavenly King, the Eight Divisions’ Censor Officers,\nthe Great Illuminator Overseer Spirits, the Executioner Messengers,\nthe Heavenly Ding Valiant Warriors,\nto seize and capture Wuhuan, Huangnu, Lianzi, Chisuo,\nthe Great Ghost Headran, the Hundred Offerings’ Xuanzidu,\nand all ghosts of toxic illnesses and miscellaneous maladies.\nMay all calamities and misfortunes be commanded to extermination,\nall demonic perversities and pestilential bandits utterly eradicated.\nEver beholden to the boundless grace of vast deliverance,\nwe proclaim the luminous majesty and enact the divine incantation.\n\nThe incantation declares:\n\nThe Heavenly Worthy’s true and pure Dharma\ngoverns ghosts and protects all beings.\nOn Jiazi, the myriad illnesses descend;\non Renchen, the hundred million ghosts roam.\nThe Yellow Pestilence, Zhong Shiji;\nthe Red Toxin, Xiahou Ying—\nhasten to depart from walls and paths,\ndare not linger near gates and courtyards.\nI possess ten generals,\ntheir eyes like shooting stars,\nunceasingly watching for ghosts day and night,\ncrushing them to pieces without whole form.\n\nNext, the invocation intones:\n\nBelow, the boundless kalpas stretch into darkness;\nabove, we gaze upon the Three Heavens,\nwhere the Three Luminaries shine brightly.\nToday we kindle lamps,\nthe Ten Perfected restrain the Demon Kings.\nLet winds be still, rains cease,\nas Daoists wander the Emperor’s realm.\nThe Jade Maidens awaken the Three Luminaries,\nthe Six Perfections behold the Supreme August One.\nToday the Dharma Masters assemble,\nthe divine immortals shake the ten directions.\n\nWith utmost sincerity, we prostrate and take refuge,\npaying reverence to the Most High, Utmost Real, Supreme, Supreme Unity Lord,\nthe Three Caverns’ Heavenly Worthies of the Central Realm.\n\nNext, facing the southwest human portal, we bow thrice and conclude the repentance.\n\nYour servants, so-and-so, respectfully establish the retreat and perform the Dao for such-and-such household,\nto heal illnesses, expel demonic pestilence, and avert calamities.\nThrough these meritorious deeds, we beseech forgiveness for the living and deceased of such-and-such household,\ntheir thousand transgressions and myriad sins, all to be absolved.\nWe command the Heavenly Ding of the ten directions and the thirty-six Heavenly Valiant Warriors\nto shield and protect the six relations of such-and-such household, young and old, male and female, noble and base.\nWherever they extend their protection,\nwe forbid all pestilential ghosts from causing disturbance.\nSeize and eradicate the cloud-borne Li Ziao of untimely death,\nthe human-shaped spirits of livestock that perished in flight,\nthe five woods’ hundred specters, the Man, Yi, Di, Xia, Qiang, Hu, and Cang barbarians,\nthose dwelling above mountains, below mountains, in water, in fire,\nat gates, doorways, wells, hearths, dwellings, and walls.\nAll manner of ghosts—command their complete eradication,\ndispersion, and annihilation.\nPlunge them a thousand fathoms into the earth,\nconsigning them to timely ruin, leaving no remnant.\nMay all stand in awe, ever beholden to the sagely favor.\nProclaiming the luminous command, we enact the divine incantation.\n\nThe incantation declares:\n\nThe Most High’s golden mouth commands,\nsolemnly adjuring all demons.",
      "overlap_context": "he elder and the young—\nall afflictions, chronic illnesses, pestilential winds, cold poisons, epidemics, and seasonal plagues—\nmay they all be healed.\nMay medicine prove effective, bringing health within and without.\nMay the five viscera be harmonized, the six bowels flow freely.\nMay the nets of entanglement be untied, calamities and misfortunes delivered.\nMay years be added to our lifespan, longevity extended without limit.\nMay our paths in the world shine brightly, ranks and emoluments ascend.",
      "start_char": 5528,
      "end_char": 6780,
      "start_sentence": 318,
      "end_sentence": 392,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 44.05284118652344,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\太上洞渊三昧神咒斋忏谢仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "当来午未岁，其时疫疠多。 丁勤取男女，石毋害鸡鹅。 法师转经处，邪精不得过。 受持三洞人，免度万丈波。 杀鬼鬼尽灭，救病病无他。 次颂曰： 中央戊己神，黄帝统四维。 今日建大齐，万恶不敢希。 停风不动条，雨散三光辉。 道德因此弘，至真大依依。 天女执命魔，十绝杀邪非。 功积升玄都，福庆高巍巍。 财宝五家分，作福神自归。 妖祥悉伏匿，善恶执告谁。 玄朗虚中散，呜鼓不自槌。 勅魔一切妖，试者汝自衰。 太上金口劫，不从死怨谁。 太上洞渊三昧神咒斋忏谢仪竟",
      "translated_text": "When the years of Horse and Sheep arrive,\npestilence and plague shall multiply.\nDing diligently takes men and women,\nwhile Shi spares no harm to fowl and geese.\nWhere the Dharma Master turns the sutras,\nno demonic essence may pass through.\nThose who uphold the Three Caverns’ Way\nshall cross ten-thousand-fathom waves unscathed.\nSlay the ghosts—ghosts shall be utterly destroyed;\nheal the sick—sickness shall bring no further harm.\n\nThe following hymn declares:\n\nAt the center, the spirits of Wu and Ji,\nthe Yellow Emperor governs the four directions.\nToday, great harmony is established,\nand myriad evils dare not draw near.\nThe winds cease, branches still,\nrains disperse, the Three Luminaries shine.\nThus the Dao and virtue flourish,\nthe Perfect and True stand in profound accord.\nHeavenly maidens seize the demons of fate,\nthe Ten Severances slay all wrong and falsehood.\nMerits accumulate, ascending to the Mystic Capital,\nblessings and joy tower high and majestic.\nWealth and treasures are shared among five households,\nand those who perform good deeds find the gods returning to them.\nAll omens, auspicious and baleful, submit and hide—\nwho shall report good and evil?\nThe Mystic Radiance scatters in emptiness,\nthe sounding drum strikes not of itself.\nCommand all demonic and wayward spirits:\nthose who test this shall find their own decline.\nThe Most High’s golden mouth decrees—\nif disobeyed, to whom shall death’s grievance belong?\n\nThe *Dongyuan Sanmei Divine Incantation Ritual of Offering, Repentance, and Thanksgiving* is now complete.",
      "overlap_context": "below mountains, in water, in fire,\nat gates, doorways, wells, hearths, dwellings, and walls.\nAll manner of ghosts—command their complete eradication,\ndispersion, and annihilation.\nPlunge them a thousand fathoms into the earth,\nconsigning them to timely ruin, leaving no remnant.\nMay all stand in awe, ever beholden to the sagely favor.\nProclaiming the luminous command, we enact the divine incantation.\n\nThe incantation declares:\n\nThe Most High’s golden mouth commands,\nsolemnly adjuring all demons.",
      "start_char": 6780,
      "end_char": 6999,
      "start_sentence": 393,
      "end_sentence": 410,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.207334756851196,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\太上洞渊三昧神咒斋忏谢仪.txt",
        "category": "威仪类"
      }
    }
  ]
}