{
  "source_id": "太上玄司灭罪紫府消灾法忏",
  "source_file": "chunked_daozang\\太上玄司灭罪紫府消灾法忏.json",
  "total_chunks": 3,
  "total_original_chars": 2799,
  "total_translated_chars": 20414,
  "total_translation_time": 83.41284132003784,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\威仪类\\太上玄司灭罪紫府消灾法忏.txt",
    "category": "威仪类"
  },
  "full_translation": "*The Supreme Mysterious Controller’s Rite of Extinguishing Transgressions and Dispelling Calamities from the Purple Mansion*\n\n**Scripture Title:** *The Supreme Mysterious Controller’s Rite of Extinguishing Transgressions and Dispelling Calamities from the Purple Mansion* (One fascicle).\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Dongxuan* Section, *Weiyi* Category.\n\n---\n\n*The Supreme Mysterious Controller’s Rite of Extinguishing Transgressions and Dispelling Calamities from the Purple Mansion*\n\nThe ritual proceeds according to protocol; the incense serves as the token of sincere communion, while the heart is the gateway to the study of the Dao.\n\nHumankind is endowed by Heaven and Earth with life and completion, just as the sages respond to earnest devotion with manifest grace.\n\nToday, with reverence, we offer true incense and devoutly invoke:\nThe Three Clarities and Supreme Saints,\nThe Ten Poles and Lofty Perfected,\nThe Nine Heavens’ Responsive Origin, Thunder’s Universal Transformation, Heavenly Worthy of Universal Transformation,\nThe Palace of the Sun’s Most Perfected Great Sage, the Great Yang Emperor-Lord,\nThe Palace of the Moon’s Most Perfected Great Sage, the Great Yin Sovereign,\nThe Five Directions’ Five Powers Star Lords,\nThe Four Qi and Four Luminaries Star Lords,\nThe Southern Dipper’s Six Controllers of Longevity and Life-Giving Star Lords,\nThe Central Heaven’s Great Sage, the Northern Dipper’s Nine August Thearch Star Lords,\nThe Three Terraces and Canopy Star Lords,\nThe Twenty-Eight Constellations’ Star Lords,\nThe Twelve Palaces’ Divine Star Lords,\nThe Dipper’s Star Lords of the Holding Ram and Rāhu, the Two Immortal Envoys,\nThe Heavenly Stem’s Great Sage, the Purple Court’s Marshal, the Radiant Star Lord of the Astral Stride.\n\n[The supplicant’s name] above is governed by:\nThe natal Star Official of their birth,\nThe Greater and Lesser Star Officials of their destiny,\nThe Star Luminaries of their life palace in their celestial revolutions,\nThe Perfected of the Purple Mansion and the hundred numinous hosts,\nThe Year God and the Dipper’s Directing Envoy.\n\nMay the ritual altar’s descent witness and inspect your majestic numen.\nWe rely entirely upon the true incense to universally offer homage.\n\nYour humble servant now respectfully petitions, presenting the sincerest of red-hearted devotion, all fully set forth in the memorial text. By means of this morning’s rites of repentance, we reverently beseech the radiance of your grace to deign to cast your merciful gaze upon us.\n\nWe reflect that the Jade Edicts of Dragon City and the Jeweled Chapters of Phoenix Park—when recited, they may absolve transgressions and expiate faults; when revered, they may dispel calamities and avert misfortunes. Thus we have prepared incense and candles, arrayed banners and flowers, established a pure and sacred altar, and faced the sacred image of the Primordial Venerable.\n\nA hundred thoughts have become obstructive karma; with a single heart, we have acted in greed and gluttony, ever indulging the six senses. The accumulated misfortunes of days past have swiftly coalesced, for we have not contemplated the Three Goodnesses. Now the ripened evils of this time have taken form, and we shall exhaust all recourse in supplication.\n\nTo perform this rite of expiation and thanksgiving, we honor the one hundred fifty august titles of the Heavenly Worthies, aligning with the thirty-twofold golden portals of the Celestial Court’s wisdom. When the Jeweled Treasury opens, the divine sounds of the Ten Caverns suddenly resound; where the golden bells are struck, the precious palaces of the Nine Purities silently connect.\n\nWe prostrate ourselves, beseeching the Supreme Primordial Venerable and the Most Sagely of the Central Heaven: may you condescend to accept our earnest sincerity and bestow the grace of your inspection. May the offenses and transgressions committed at dawn and dusk, the misfortunes that may befall under the cyclical signs of geng and jia, all be absolved and transformed.\n\nMay the names inscribed in the Black Registers of the Northern Capital be secretly amended through cultivation; may the commands of the cinnabar talismans from the Central Marchmount be followed, with goodness increasing day by day. Disasters shall melt away like ice. With utmost sincerity, we personally perform this reverent rite, each person offering respectful devotion.\n\nWith devoted heart, we take refuge in the Heavenly Worthy of the Pure Capital.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Lofty Emperor of the Purple Mansion.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Extinguishes Sins Through Incense.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Dispels Disasters Through Image-Building.\nWith devoted heart, we take refuge in the Heavenly Worthy of Wholehearted Union with the Dao.\nWith devoted heart, we take refuge in the Heavenly Worthy of Serene Contemplation and Cultivation of the True.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Repents and Eradicates Evil Traces.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Nourishes the Boundaries of Goodness.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Jade Altar Who Universally Delivers.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Jeweled Registers’ Opening.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Purple Tenuity and Golden Portal.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Luminous Jade Palace.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Releases from Evil Realms.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Gathers Auspicious Affinities.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Repents and Dissolves Errors.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Scours and Purifies Flaws.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Frees from Karmic Obstructions.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Does Not Fall into the Wheel of Karma.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Universally Upholds the Wondrous Dao.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Broadly Bestows Numinous Compassion.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Ninefold Numinous Jade Cavern.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Seven Jeweled Golden Gates.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Mysterious Bureau’s Bestowed Grace.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Sagely Power’s Silent Permeation.\nWith devoted heart, we take refuge in the Heavenly Worthy of Compassionate Grace and Responsive Inspection.\nWith devoted heart, we take refuge in the Heavenly Worthy of Manifested Majestic Power.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Constantly Delivers Beings.\nWith devoted heart, we take refuge in the Heavenly Worthy of Boundless Salvation.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Eliminates Calamities and Obstructions.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Severs the Roots of Karma.\nWith devoted heart, we take refuge in the Heavenly Worthy of Numinous Permeation and Utmost Vastness.\nWith devoted heart, we take refuge in the Heavenly Worthy of Sagely Omnipresence.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Dissolves Transgressions and Crimes.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Delivers from Disasters and Misfortunes.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Ice Court’s Dissolution.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Eradicates the Fire Prisons.\nWith devoted heart, we take refuge in the Heavenly Worthy of Perpetual Benefit and Relief.\nWith devoted heart, we take refuge in the Heavenly Worthy of Eternal Release from Entanglements.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Delivers as Soon as Invoked.\nWith devoted heart, we take refuge in the Heavenly Worthy of Union with the Dao and Realization of the True.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Hollow Mulberry’s Jeweled Cavern.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Purple and Azure Mysterious Terrace.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Golden City’s Transformations.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Jade Palace’s Contained Radiance.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Secretly Eradicates Myriad Evils.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Does Not Fall into the Nine Dark Realms.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Dissolves Demonic Karmic Obstructions.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Releases from Lingering Misfortunes.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Removes Disasters and Gathers Blessings.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Fragrant Grove’s Jeweled Throne.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Constant Joy Jade Terrace.\nWith devoted heart, we take refuge in the Heavenly Worthy of All-Returning Sagely Power.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Broadly Bestows Mysterious Grace.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Cherishes Life.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Dharma Lamp’s Universal Illumination.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Delivers the Dusty World.\nWith devoted heart, we take refuge in the Heavenly Worthy of Boundless Wise Love.\nWith devoted heart, we take refuge in the Heavenly Worthy of Inexhaustible Majestic Power.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Golden Dawn’s Resplendent Portal.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Jade Capital’s Mysterious Terrace.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Ninefold Colored Numinous Standards.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Sevenfold Radiant Cloud Chariot.\nWith devoted heart, we take refuge in the Heavenly Worthy of Vast Celestial Compassion.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Ascends the Wondrous Dao.\nWith devoted heart, we take refuge in the Heavenly Worthy of Unobstructed Fragrant Radiance.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Ever-Bright Jeweled Torch.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Dragon City’s Supreme Sage.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Phoenix Portal’s Lofty Emperor.\nWith devoted heart, we take refuge in the Heavenly Worthy of Infinite Majestic Power.\nWith devoted heart, we take refuge in the Heavenly Worthy of Unending Luminous Might.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Transforms and Eradicates Offenses.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Delivers from Karmic Affinities.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Constantly Turns the Wheel of Wise Sun.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Eternally Establishes the Mysterious Wind.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Attains Union with the True Dao.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Jeweled Heaven and Purple Mansion.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Jade Scenery’s Pure Palace.\n\nWith devoted heart, we take refuge in the Heavenly Worthy of the Golden Wheel and Feathered Canopy.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Jeweled Cloud Gate.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Vastly Perfects All Wonders.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Universally Nurtures All Spirits.\nWith devoted heart, we take refuge in the Heavenly Worthy of Unfathomable Majestic Radiance.\nWith devoted heart, we take refuge in the Heavenly Worthy Whose Sacred Vastness Cannot Be Exhausted.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Repents and Removes Obstructive Karma.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Resolves and Dissolves Enmities.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Purple Flower and Golden Hall.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Pure Mystery and Jade Terrace.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Ninefold Radiant Cinnabar Palanquin.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Eight-Colored Cloud Chariot.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Universally Bestows Vast Grace.\nWith devoted heart, we take refuge in the Heavenly Worthy Whose Sacred Power Is Impartial.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Eradicates Demonic Transgressions.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Severs Evil Roots.\nWith devoted heart, we take refuge in the Heavenly Worthy to Whom the Myriad Heavens Turn.\nWith devoted heart, we take refuge in the Heavenly Worthy to Whom the Three Realms Pay Homage.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Purple Radiance and Jade Observatory.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Azure Clouds and Golden Citadel.\nWith devoted heart, we take refuge in the Heavenly Worthy of Dragon Might and Self-Mastery.\nWith devoted heart, we take refuge in the Heavenly Worthy of Moonlike Upright Clarity.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Constantly Bestows a Hundred Blessings.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Eternally Eradicates a Thousand Calamities.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Responds to Devotion with Power.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Follows Thoughts to Penetrate the Mysterious.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Manifests Wondrous Goodness.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Perfects Auspicious Affinities.\nWith devoted heart, we take refuge in the Heavenly Worthy Whose Heavenly Might Transforms and Inspires.\nWith devoted heart, we take refuge in the Heavenly Worthy Whose Wise Love Pervades Vast Grace.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Can Dissolve Accumulated Offenses.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Holds All Beings in Mind.\nWith devoted heart, we take refuge in the Heavenly Worthy to Whom a Thousand Spirits Extend Protection.\nWith devoted heart, we take refuge in the Heavenly Worthy in Whom Ten Thousand Misfortunes Are Sunk.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Sweeps Away Karmic Paths.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Halts the Turning Wheel of Suffering.\nWith devoted heart, we take refuge in the Heavenly Worthy on Whose Sacred Power We Rely.\nWith devoted heart, we take refuge in the Heavenly Worthy Whose Mysterious Compassion We Contemplate.\nWith devoted heart, we take refuge in the Heavenly Worthy of Jade Clarity’s Sacred Virtue.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Golden Hall’s Numinous Might.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Extends Compassion to Save All Things.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Expounds the Teaching to Deliver Humankind.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Universally Upholds the Wondrous Dao.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Broadly Bestows Mysterious Grace.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Severs Evil Thoughts.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Cleanses the Dusty Heart.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Transcends the Three Karmic Actions.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Redeems the Four Kinds of Birth.\nWith devoted heart, we take refuge in the Heavenly Worthy of Supreme Clarity’s Perfect Dao.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Great Ultimate’s Lofty Perfection.\nWith devoted heart, we take refuge in the Heavenly Worthy of Compassion for the Five Sufferings.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Delivers from the Three Wretched Realms.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Responds to Vows and Transforms.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Follows Thoughts to Dissolve Grudges.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Augments Mysterious Merit.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Supports and Upholds Dharma Power.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Extinguishes the Fire Hell.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Releases from the Icy River.\nWith devoted heart, we take refuge in the Heavenly Worthy of Great Clarity’s Perfect Dao.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Boundless Azure’s Lofty Majesty.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Limitless Ocean of Blessings.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Broadly Spreads Compassionate Radiance.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Eternally Removes Obstructions and Hardships.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Constantly Severs Karmic Affinities.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Repents and Removes Offenses.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Liberates from Deep-Rooted Grievances.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Universally Nourishes Wondrous Fruits.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Broadly Establishes Auspicious Causes.\n\nWith devoted heart, we take refuge in the Perfected of the Purple Mansion Who Sweeps Away Wrongs and Cleanses Evils.\nWith devoted heart, we take refuge in the Perfected of the Azure Empyrean Who Eradicates Transgressions and Dissolves Grievances.\nWith devoted heart, we take refuge in the Perfected of the Crimson Garden Who Supports the Weak and Defends Against Calamities.\nWith devoted heart, we take refuge in the Perfected of the General’s Terrace Who Averts Disasters and Eradicates Misfortunes.\n\nThe rites of reverence now complete, we bow in body to repent and give thanks.\nWe humbly consider that in turning toward the vow, only reverence and sincerity avail.\nTo remove the karmic roots of the Three Poisons, one must earnestly maintain the single thought of goodness.\nThus, relying on the teachings of the scriptures, we lay bare our hearts.\nWe know that transgressions can be repented, and misfortunes can be eradicated.\nWe hope to be allowed to repent before Fengdu, erasing the records of sins and evils;\nand to humbly present our prayers to Mount Tai, removing the registers of faults and grievances.\nAll the errors and missteps of our lives, and all the harms—whether by day or night—arising from the myriad conditions,\nare wholly gathered into this single repentance.\nSilently, we strike the rhythm of the Western Fullness, gazing afar toward the Southern Culmen’s palace.\nWe prostrate ourselves, praying that heavenly compassion may be moved to pardon and forgive,\nand that the true numina may be commanded to turn their wise regard.\nWhen the Dark Bureau of Sin examines our records, may our sins melt like ice;\nwhen the Purple Mansion enacts its judgments, may our calamities scatter like mist.\nRelying on the exalted virtue of the Most High, may our earnest prayers be answered.\nShould any hindrances cling to body or mind, may all be cleansed through refuge.\nWe bow our heads to the Supreme Void Emperor, the Most High, the True and Perfect Three Treasures.\n\nThe *Rites of the Most High’s Dark Bureau for Eradicating Sins and the Purple Mansion for Dispelling Disasters* now conclude.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上玄司灭罪紫府消灾法忏 经名：太上玄司灭罪紫府消灾法忏。 一卷。 底本出处：《正统道藏》洞玄部威仪类。 太上玄司灭罪紫府消灾法忏 法事如仪，启圣 香作通诚之信，心为学道之门。 人禀天地以生成，圣逐忱恂而赴感。 以今恭运真香，虔诚上启，三清上圣，十极高真，九天应元雷声普化天尊，日宫至真大圣、太阳帝君，月府至真大圣、太阴皇君，五方五德星君，四炁四曜星君，南斗六司延寿上生星君，中天大圣北斗九皇尊帝星君，三台华盖星君，二十八宿星君，十二宫神星君，斗中擎羊陀罗二仙使者，天罡大圣紫庭节度奎光星君。 某人上属当生本命星官、大小运限星官、命宫照临星曜周天躔度河汉星真，紫府高真百灵圣众，太岁神君、斗中直使。 法筵下降，鉴察威灵。 悉仗真香，普同供养。",
      "translated_text": "*The Supreme Mysterious Controller’s Rite of Extinguishing Transgressions and Dispelling Calamities from the Purple Mansion*\n\n**Scripture Title:** *The Supreme Mysterious Controller’s Rite of Extinguishing Transgressions and Dispelling Calamities from the Purple Mansion* (One fascicle).\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Dongxuan* Section, *Weiyi* Category.\n\n---\n\n*The Supreme Mysterious Controller’s Rite of Extinguishing Transgressions and Dispelling Calamities from the Purple Mansion*\n\nThe ritual proceeds according to protocol; the incense serves as the token of sincere communion, while the heart is the gateway to the study of the Dao.\n\nHumankind is endowed by Heaven and Earth with life and completion, just as the sages respond to earnest devotion with manifest grace.\n\nToday, with reverence, we offer true incense and devoutly invoke:\nThe Three Clarities and Supreme Saints,\nThe Ten Poles and Lofty Perfected,\nThe Nine Heavens’ Responsive Origin, Thunder’s Universal Transformation, Heavenly Worthy of Universal Transformation,\nThe Palace of the Sun’s Most Perfected Great Sage, the Great Yang Emperor-Lord,\nThe Palace of the Moon’s Most Perfected Great Sage, the Great Yin Sovereign,\nThe Five Directions’ Five Powers Star Lords,\nThe Four Qi and Four Luminaries Star Lords,\nThe Southern Dipper’s Six Controllers of Longevity and Life-Giving Star Lords,\nThe Central Heaven’s Great Sage, the Northern Dipper’s Nine August Thearch Star Lords,\nThe Three Terraces and Canopy Star Lords,\nThe Twenty-Eight Constellations’ Star Lords,\nThe Twelve Palaces’ Divine Star Lords,\nThe Dipper’s Star Lords of the Holding Ram and Rāhu, the Two Immortal Envoys,\nThe Heavenly Stem’s Great Sage, the Purple Court’s Marshal, the Radiant Star Lord of the Astral Stride.\n\n[The supplicant’s name] above is governed by:\nThe natal Star Official of their birth,\nThe Greater and Lesser Star Officials of their destiny,\nThe Star Luminaries of their life palace in their celestial revolutions,\nThe Perfected of the Purple Mansion and the hundred numinous hosts,\nThe Year God and the Dipper’s Directing Envoy.\n\nMay the ritual altar’s descent witness and inspect your majestic numen.\nWe rely entirely upon the true incense to universally offer homage.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 322,
      "start_sentence": 0,
      "end_sentence": 11,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.943337440490723,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\太上玄司灭罪紫府消灾法忏.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "臣今谨奏为入意其诸丹悃，具载疏文。 以今朝礼忏文，恭望恩光，垂慈鉴映。 窃以龙城玉号，凤苑琼章，课之则可以忏赎罪尤，礼之则可以消除灾厄。 於是备陈香烛，罗列旛花，设严洁之灵坛，对玄元之圣像。 百念造为障业，一心举动贪饕，恒恣六情。 积日之余殃旋结，不思三善； 今时之稔恶已成，将罄倾依。 用伸禳谢，礼一百五十天尊睿号，契三十二重金阙宸聪。 琼藏开时，十洞之灵音乍奏； 金钟扣处，九清之宝殿潜通。 伏惟无上元尊、中天至圣，俯纳精虔之恳，特垂鉴照之恩。 晨昏所犯之衅愆，庚甲傥临之祸害，咸蒙开度。 北都勾黑簿之名，潜会修持； 中岳奉丹符之命，善随日长。 灾逐冰消； 用罄虔诚，躬伸敬礼，人各恭敬。 志心归命，清都上帝天尊。 志心归命，紫府高皇天尊。 志心归命，烧香灭罪天尊。 志心归命，建像消灾天尊。 志心归命，倾心合道天尊。 志心归命，静念修真天尊。 志心归命，忏除恶迹天尊。 志心归命，资益善涯天尊。 志心归命，瑶坛广度天尊。 志心归命，宝籍洞开天尊。 志心归命，紫微金阙天尊。 志心归命，清华玉宫天尊。 志心归命，解除恶趣天尊。 志心归命，结集良缘天尊。 志心归命，忏消诖误天尊。 志心归命，荡涤瑕玭天尊。 志心归命，得离罪障天尊。 志心归命，不堕业轮天尊。 志心归命，普承妙道天尊。 志心归命，广布灵慈天尊。 志心归命，九灵玉洞天尊。 志心归命，七宝金门天尊。 志心归命，玄司垂惠天尊。 志心归命，圣德潜通天尊。 志心归命，慈恩鉴应天尊。 志心归命，威力昭彰天尊。 志心归命，常行拯物天尊。 志心归命，无量度人天尊。 志心归命，蠲消灾障天尊。 志心归命，断灭业根天尊。 志心归命，灵通至广天尊。 志心归命，圣槩无穷天尊。 志心归命，能消罪戾天尊。 志心归命，得度灾殃天尊。 志心归命，冰庭涣释天尊。 志心归命，火狱蠲除天尊。 志心归命，长资利济天尊。 志心归命，永解牵缠天尊。 志心归命，应念得度天尊。 志心归命，会道合真天尊。 志心归命，崆峒宝洞天尊。 志心归命，紫碧玄台天尊。 志心归命，金城演化天尊。 志心归命，玉殿含光天尊。 志心归命，潜除万恶天尊。 志心归命，不堕九幽天尊。 志心归命，消魔夙业天尊。 志心归命，解摘余殃天尊。 志心归命，除灾集福天尊。 志心归命，香林宝座天尊。 志心归命，常乐玉台天尊。 志心归命，咸归睿力天尊。 志心归命，广布玄恩天尊。 志心归命，惟念好生天尊。 志心归命，法灯普照天尊。 志心归命，将度尘寰天尊。 志心归命，无边慧爱天尊。 志心归命，莫尽威灵天尊。 志心归命，金晨华阙天尊。 志心归命，玉京玄台天尊。 志心归命，九色灵节天尊。 志心归命，七映云舆天尊。 志心归命，天慈广大天尊。 志心归命，观登妙道天尊。 志心归命，香光无碍天尊。 志心归命，宝炬长明天尊。 志心归命，龙城上圣天尊。 志心归命，凤阙高皇天尊。 志心归命，无穷威力天尊。 志心归命，不尽光呀天尊。 志心归命，变除罪衅天尊。 志心归命，拯度业缘天尊。 志心归命，常回慧日天尊。 志心归命，永固玄风天尊。 志心归命，得契真道天尊。 志心归命，琼天紫府天尊。 志心归命，玉景清宫天尊。",
      "translated_text": "Your humble servant now respectfully petitions, presenting the sincerest of red-hearted devotion, all fully set forth in the memorial text. By means of this morning’s rites of repentance, we reverently beseech the radiance of your grace to deign to cast your merciful gaze upon us.\n\nWe reflect that the Jade Edicts of Dragon City and the Jeweled Chapters of Phoenix Park—when recited, they may absolve transgressions and expiate faults; when revered, they may dispel calamities and avert misfortunes. Thus we have prepared incense and candles, arrayed banners and flowers, established a pure and sacred altar, and faced the sacred image of the Primordial Venerable.\n\nA hundred thoughts have become obstructive karma; with a single heart, we have acted in greed and gluttony, ever indulging the six senses. The accumulated misfortunes of days past have swiftly coalesced, for we have not contemplated the Three Goodnesses. Now the ripened evils of this time have taken form, and we shall exhaust all recourse in supplication.\n\nTo perform this rite of expiation and thanksgiving, we honor the one hundred fifty august titles of the Heavenly Worthies, aligning with the thirty-twofold golden portals of the Celestial Court’s wisdom. When the Jeweled Treasury opens, the divine sounds of the Ten Caverns suddenly resound; where the golden bells are struck, the precious palaces of the Nine Purities silently connect.\n\nWe prostrate ourselves, beseeching the Supreme Primordial Venerable and the Most Sagely of the Central Heaven: may you condescend to accept our earnest sincerity and bestow the grace of your inspection. May the offenses and transgressions committed at dawn and dusk, the misfortunes that may befall under the cyclical signs of geng and jia, all be absolved and transformed.\n\nMay the names inscribed in the Black Registers of the Northern Capital be secretly amended through cultivation; may the commands of the cinnabar talismans from the Central Marchmount be followed, with goodness increasing day by day. Disasters shall melt away like ice. With utmost sincerity, we personally perform this reverent rite, each person offering respectful devotion.\n\nWith devoted heart, we take refuge in the Heavenly Worthy of the Pure Capital.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Lofty Emperor of the Purple Mansion.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Extinguishes Sins Through Incense.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Dispels Disasters Through Image-Building.\nWith devoted heart, we take refuge in the Heavenly Worthy of Wholehearted Union with the Dao.\nWith devoted heart, we take refuge in the Heavenly Worthy of Serene Contemplation and Cultivation of the True.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Repents and Eradicates Evil Traces.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Nourishes the Boundaries of Goodness.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Jade Altar Who Universally Delivers.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Jeweled Registers’ Opening.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Purple Tenuity and Golden Portal.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Luminous Jade Palace.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Releases from Evil Realms.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Gathers Auspicious Affinities.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Repents and Dissolves Errors.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Scours and Purifies Flaws.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Frees from Karmic Obstructions.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Does Not Fall into the Wheel of Karma.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Universally Upholds the Wondrous Dao.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Broadly Bestows Numinous Compassion.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Ninefold Numinous Jade Cavern.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Seven Jeweled Golden Gates.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Mysterious Bureau’s Bestowed Grace.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Sagely Power’s Silent Permeation.\nWith devoted heart, we take refuge in the Heavenly Worthy of Compassionate Grace and Responsive Inspection.\nWith devoted heart, we take refuge in the Heavenly Worthy of Manifested Majestic Power.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Constantly Delivers Beings.\nWith devoted heart, we take refuge in the Heavenly Worthy of Boundless Salvation.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Eliminates Calamities and Obstructions.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Severs the Roots of Karma.\nWith devoted heart, we take refuge in the Heavenly Worthy of Numinous Permeation and Utmost Vastness.\nWith devoted heart, we take refuge in the Heavenly Worthy of Sagely Omnipresence.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Dissolves Transgressions and Crimes.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Delivers from Disasters and Misfortunes.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Ice Court’s Dissolution.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Eradicates the Fire Prisons.\nWith devoted heart, we take refuge in the Heavenly Worthy of Perpetual Benefit and Relief.\nWith devoted heart, we take refuge in the Heavenly Worthy of Eternal Release from Entanglements.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Delivers as Soon as Invoked.\nWith devoted heart, we take refuge in the Heavenly Worthy of Union with the Dao and Realization of the True.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Hollow Mulberry’s Jeweled Cavern.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Purple and Azure Mysterious Terrace.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Golden City’s Transformations.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Jade Palace’s Contained Radiance.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Secretly Eradicates Myriad Evils.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Does Not Fall into the Nine Dark Realms.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Dissolves Demonic Karmic Obstructions.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Releases from Lingering Misfortunes.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Removes Disasters and Gathers Blessings.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Fragrant Grove’s Jeweled Throne.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Constant Joy Jade Terrace.\nWith devoted heart, we take refuge in the Heavenly Worthy of All-Returning Sagely Power.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Broadly Bestows Mysterious Grace.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Cherishes Life.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Dharma Lamp’s Universal Illumination.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Delivers the Dusty World.\nWith devoted heart, we take refuge in the Heavenly Worthy of Boundless Wise Love.\nWith devoted heart, we take refuge in the Heavenly Worthy of Inexhaustible Majestic Power.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Golden Dawn’s Resplendent Portal.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Jade Capital’s Mysterious Terrace.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Ninefold Colored Numinous Standards.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Sevenfold Radiant Cloud Chariot.\nWith devoted heart, we take refuge in the Heavenly Worthy of Vast Celestial Compassion.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Ascends the Wondrous Dao.\nWith devoted heart, we take refuge in the Heavenly Worthy of Unobstructed Fragrant Radiance.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Ever-Bright Jeweled Torch.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Dragon City’s Supreme Sage.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Phoenix Portal’s Lofty Emperor.\nWith devoted heart, we take refuge in the Heavenly Worthy of Infinite Majestic Power.\nWith devoted heart, we take refuge in the Heavenly Worthy of Unending Luminous Might.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Transforms and Eradicates Offenses.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Delivers from Karmic Affinities.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Constantly Turns the Wheel of Wise Sun.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Eternally Establishes the Mysterious Wind.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Attains Union with the True Dao.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Jeweled Heaven and Purple Mansion.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Jade Scenery’s Pure Palace.",
      "overlap_context": "r Lord of the Astral Stride.\n\n[The supplicant’s name] above is governed by:\nThe natal Star Official of their birth,\nThe Greater and Lesser Star Officials of their destiny,\nThe Star Luminaries of their life palace in their celestial revolutions,\nThe Perfected of the Purple Mansion and the hundred numinous hosts,\nThe Year God and the Dipper’s Directing Envoy.\n\nMay the ritual altar’s descent witness and inspect your majestic numen.\nWe rely entirely upon the true incense to universally offer homage.",
      "start_char": 322,
      "end_char": 1758,
      "start_sentence": 12,
      "end_sentence": 104,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.47849893569946,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\太上玄司灭罪紫府消灾法忏.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "志心归命，金轮羽盖天尊。 志心归命，洞宝云门天尊。 志心归命，广臻众妙天尊。 志心归命，普洽群灵天尊。 志心归命，威光莫测天尊。 志心归命，圣槩难穷天尊。 志心归命，忏除障业天尊。 志心归命，分解仇雠天尊。 志心归命，紫华金殿天尊。 志心归命，清玄玉台天尊。 志心归命，九光丹辇天尊。 志心归命，八色云軿天尊。 志心归命，洪恩普施天尊。 志心归命，圣力无私天尊。 志心归命，消魔罪迹天尊。 志心归命，断绝恶根天尊。 志心归命，万天回向天尊。 志心归命，三界归依天尊。 志心归命，紫霞玉观天尊。 志心归命，青云金城天尊。 志心归命，龙威自在天尊。 志心归命，月相端明天尊。 志心归命，恒资百福天尊。 志心归命，永殄千灾天尊。 志心归命，应感得力天尊。 志心归命，随念通玄天尊。 志心归命，能彰妙善天尊。 志心归命，克就良缘天尊。 志心归命，天威感化天尊。 志心归命，睿爱覃恩天尊。 志心归命，能消积衅天尊。 志心归命，可念群生天尊。 志心归命，千灵垂佑天尊。 志心归命，万祸俱沈天尊。 志心归命，扫除业道天尊。 志心归命，停转苦轮天尊。 志心归命，依凭圣力天尊。 志心归命，思念玄慈天尊。 志心归命，玉清圣德天尊。 志心归命，金殿灵威天尊。 志心归命，垂慈济物天尊。 志心归命，阐教度人天尊。 志心归命，溥承妙道天尊。 志心归命，广布玄恩天尊。 志心归命，断除恶念天尊。 志心归命，荡涤尘心天尊。 志心归命，超离三业天尊。 志心归命，拔赎四生天尊。 志心归命，上清至道天尊。 志心归命，太极高真天尊。 志心归命，慈悲五苦天尊。 志心归命，出离三涂天尊。 志心归命，应愿感化天尊。 志心归命，随念解冤天尊。 志心归命，增益玄功天尊。 志心归命，资持法力天尊。 志心归命，消灭火狱天尊。 志心归命，浮释冰河天尊。 志心归命，太清至道天尊。 志心归命，穷碧高皇天尊。 志心归命，无边福海天尊。 志心归命，广布慈光天尊。 志心归命，永离障难天尊。 志心归命，常断业缘天尊。 志心归命，忏除罪衅天尊。 志心归命，解脱沈冤天尊。 志心归命，普滋妙果天尊。 志心归命，广福良因天尊。 志心归命，荡非涤恶紫阙真人。 志心归命，灭罪解尤碧霄真人。 志心归命，扶衰捍厄绛苑真人。 志心归命，禳灾殄祸将台真人。 敬礼已周，躬身禳谢。 窃以将盟回向，唯仗恭虔。 欲除三毒之业根、当谨一心之善念。 遂则依凭科教，披露襟怀。 是知过咎可禳，迍遭能殄。 冀容忏谢酆都，抹罪恶之书； 俯纳启祈岱岳，削过尤之籍。 所犯平生之诖误，凡关旦夕之烹伤，皆起万缘，尽归一忏。 静扣西盈之韵，遥瞻南极之宫。 伏愿垂赦宥而轸天慈，敕真灵而回睿。 赐校罪玄司之日，罪逐冰消； 行灾紫府之时，灾随雾扫。 仰赖隆崇之德，获谐垦祷之诚。 傥描挂碍身心，咸得归依洗涤。 稽首虚皇无上正真三宝。 太上玄司灭罪紫府消灾法忏竟",
      "translated_text": "With devoted heart, we take refuge in the Heavenly Worthy of the Golden Wheel and Feathered Canopy.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Jeweled Cloud Gate.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Vastly Perfects All Wonders.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Universally Nurtures All Spirits.\nWith devoted heart, we take refuge in the Heavenly Worthy of Unfathomable Majestic Radiance.\nWith devoted heart, we take refuge in the Heavenly Worthy Whose Sacred Vastness Cannot Be Exhausted.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Repents and Removes Obstructive Karma.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Resolves and Dissolves Enmities.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Purple Flower and Golden Hall.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Pure Mystery and Jade Terrace.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Ninefold Radiant Cinnabar Palanquin.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Eight-Colored Cloud Chariot.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Universally Bestows Vast Grace.\nWith devoted heart, we take refuge in the Heavenly Worthy Whose Sacred Power Is Impartial.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Eradicates Demonic Transgressions.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Severs Evil Roots.\nWith devoted heart, we take refuge in the Heavenly Worthy to Whom the Myriad Heavens Turn.\nWith devoted heart, we take refuge in the Heavenly Worthy to Whom the Three Realms Pay Homage.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Purple Radiance and Jade Observatory.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Azure Clouds and Golden Citadel.\nWith devoted heart, we take refuge in the Heavenly Worthy of Dragon Might and Self-Mastery.\nWith devoted heart, we take refuge in the Heavenly Worthy of Moonlike Upright Clarity.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Constantly Bestows a Hundred Blessings.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Eternally Eradicates a Thousand Calamities.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Responds to Devotion with Power.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Follows Thoughts to Penetrate the Mysterious.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Manifests Wondrous Goodness.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Perfects Auspicious Affinities.\nWith devoted heart, we take refuge in the Heavenly Worthy Whose Heavenly Might Transforms and Inspires.\nWith devoted heart, we take refuge in the Heavenly Worthy Whose Wise Love Pervades Vast Grace.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Can Dissolve Accumulated Offenses.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Holds All Beings in Mind.\nWith devoted heart, we take refuge in the Heavenly Worthy to Whom a Thousand Spirits Extend Protection.\nWith devoted heart, we take refuge in the Heavenly Worthy in Whom Ten Thousand Misfortunes Are Sunk.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Sweeps Away Karmic Paths.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Halts the Turning Wheel of Suffering.\nWith devoted heart, we take refuge in the Heavenly Worthy on Whose Sacred Power We Rely.\nWith devoted heart, we take refuge in the Heavenly Worthy Whose Mysterious Compassion We Contemplate.\nWith devoted heart, we take refuge in the Heavenly Worthy of Jade Clarity’s Sacred Virtue.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Golden Hall’s Numinous Might.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Extends Compassion to Save All Things.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Expounds the Teaching to Deliver Humankind.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Universally Upholds the Wondrous Dao.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Broadly Bestows Mysterious Grace.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Severs Evil Thoughts.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Cleanses the Dusty Heart.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Transcends the Three Karmic Actions.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Redeems the Four Kinds of Birth.\nWith devoted heart, we take refuge in the Heavenly Worthy of Supreme Clarity’s Perfect Dao.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Great Ultimate’s Lofty Perfection.\nWith devoted heart, we take refuge in the Heavenly Worthy of Compassion for the Five Sufferings.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Delivers from the Three Wretched Realms.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Responds to Vows and Transforms.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Follows Thoughts to Dissolve Grudges.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Augments Mysterious Merit.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Supports and Upholds Dharma Power.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Extinguishes the Fire Hell.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Releases from the Icy River.\nWith devoted heart, we take refuge in the Heavenly Worthy of Great Clarity’s Perfect Dao.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Boundless Azure’s Lofty Majesty.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Limitless Ocean of Blessings.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Broadly Spreads Compassionate Radiance.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Eternally Removes Obstructions and Hardships.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Constantly Severs Karmic Affinities.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Repents and Removes Offenses.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Liberates from Deep-Rooted Grievances.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Universally Nourishes Wondrous Fruits.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Broadly Establishes Auspicious Causes.\n\nWith devoted heart, we take refuge in the Perfected of the Purple Mansion Who Sweeps Away Wrongs and Cleanses Evils.\nWith devoted heart, we take refuge in the Perfected of the Azure Empyrean Who Eradicates Transgressions and Dissolves Grievances.\nWith devoted heart, we take refuge in the Perfected of the Crimson Garden Who Supports the Weak and Defends Against Calamities.\nWith devoted heart, we take refuge in the Perfected of the General’s Terrace Who Averts Disasters and Eradicates Misfortunes.\n\nThe rites of reverence now complete, we bow in body to repent and give thanks.\nWe humbly consider that in turning toward the vow, only reverence and sincerity avail.\nTo remove the karmic roots of the Three Poisons, one must earnestly maintain the single thought of goodness.\nThus, relying on the teachings of the scriptures, we lay bare our hearts.\nWe know that transgressions can be repented, and misfortunes can be eradicated.\nWe hope to be allowed to repent before Fengdu, erasing the records of sins and evils;\nand to humbly present our prayers to Mount Tai, removing the registers of faults and grievances.\nAll the errors and missteps of our lives, and all the harms—whether by day or night—arising from the myriad conditions,\nare wholly gathered into this single repentance.\nSilently, we strike the rhythm of the Western Fullness, gazing afar toward the Southern Culmen’s palace.\nWe prostrate ourselves, praying that heavenly compassion may be moved to pardon and forgive,\nand that the true numina may be commanded to turn their wise regard.\nWhen the Dark Bureau of Sin examines our records, may our sins melt like ice;\nwhen the Purple Mansion enacts its judgments, may our calamities scatter like mist.\nRelying on the exalted virtue of the Most High, may our earnest prayers be answered.\nShould any hindrances cling to body or mind, may all be cleansed through refuge.\nWe bow our heads to the Supreme Void Emperor, the Most High, the True and Perfect Three Treasures.\n\nThe *Rites of the Most High’s Dark Bureau for Eradicating Sins and the Purple Mansion for Dispelling Disasters* now conclude.",
      "overlap_context": "ties.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Constantly Turns the Wheel of Wise Sun.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Eternally Establishes the Mysterious Wind.\nWith devoted heart, we take refuge in the Heavenly Worthy Who Attains Union with the True Dao.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Jeweled Heaven and Purple Mansion.\nWith devoted heart, we take refuge in the Heavenly Worthy of the Jade Scenery’s Pure Palace.",
      "start_char": 1759,
      "end_char": 3078,
      "start_sentence": 105,
      "end_sentence": 192,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.991004943847656,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\太上玄司灭罪紫府消灾法忏.txt",
        "category": "威仪类"
      }
    }
  ]
}