{
  "source_id": "太上洞玄灵宝三一五气真经",
  "source_file": "chunked_daozang\\太上洞玄灵宝三一五气真经.json",
  "total_chunks": 3,
  "total_original_chars": 2668,
  "total_translated_chars": 15704,
  "total_translation_time": 76.68472528457642,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏太玄部\\太上洞玄灵宝三一五气真经.txt",
    "category": "正统道藏太玄部"
  },
  "full_translation": "*The Supreme Cavernous Mystery Numinous Treasure Scripture of the Three Ones and Five Qi*\n\n**Scripture Title:** *The Supreme Cavernous Mystery Numinous Treasure Scripture of the Three Ones and Five Qi*. Author unknown. Based on cited sources, likely composed by a Daoist of the Tang or Five Dynasties period. One fascicle. Base text from *The Orthodox Daoist Canon*, Supreme Mystery Section.\n\n---\n\nIn ancient times, the Yellow Emperor Xuanyuan once perused the *Scripture of the Celestial Sovereign’s True One*, yet failed to grasp the essentials of the Three Ones’ true qi. Thus, he journeyed to the four quarters seeking elucidation. He commanded his chariot, venturing far abroad, with Chang Yu as his driver and Fang Ming as his charioteer, while Li Mu accompanied him as an attendant. Eastward they traveled to Green Hill, where, passing Phoenix Mountain, he met the Purple Mansion Master and received the *Great Characters of the Three Sovereigns’ Inner Writ*, enabling him to summon the myriad spirits and command the host of numina.\n\nSouthward he came to Jade Mushroom’s Mystic Gorge, ascending Round Mound beneath the shade of the Fusang Tree, where he beheld the hundred spirits and gathered the blossoms of Ruoqian. Westward he met the Central Yellow Master, receiving the *Method of Nine Additions*, then passed through Kongtong Mountain, where he studied the *Scripture of Spontaneity* under Guangchengzi. Northward he reached the Vast Dyke, ascending Juci Mountain, where he encountered the Great Courtyard Lord, the Yellow Canopy Youth, and received the *Twelve Scrolls of the Divine Immortals’ Mushroom Charts*. Returning to Wangwu Mountain, he transmitted the *Scripture of the Ninefold Transmutation of Golden Liquor* to the Mysterious Woman, then journeyed once more to Cloud Terrace and Green City Mountain, where he met Master Ning.\n\nThe Master said: “I attained the Dao and became an immortal, yet I am no celestial official of the Three Sovereigns. Truly, I do not comprehend this text of the True One. Recently, the Sovereign Person was dispatched by the Fusang Lord to govern the immortal officials of Mount Emei, and has not yet departed. You may inquire of him.”\n\nThe Emperor then traveled to Mount Emei, where he purified himself for three months before finally meeting the Sovereign Person. Of what era this being hailed, none could say. His body stood nine feet tall, covered in dark fur over a foot long, while his hair measured but a few inches. His dwelling lay within a sheer cliff on the mountain’s northern face, a house of white jade with curtains of yellow jade and gossamer, suffused with the fragrance of thousand-harmony incense. His attendants were all jade maidens of the immortals, and three seated guests, each styled Supreme Clarity Immortal Kings.\n\nUpon meeting the Sovereign Person, he was offered a feast of jujubes filling a peck-measure, served with the essence of cinnabar blossoms and an array of rare fruits, and rinsed with the divine nectar of Vermilion Palace and Jade Elixir. The Yellow Emperor prostrated himself, kowtowing twice before rising.\n\nThe Sovereign Person asked: “What do you seek?”\n\nThe Emperor knelt and replied: “I wish to attain longevity.”\n\nThe Sovereign Person said: “You have surveyed the four seas, yet still desire not to die—is this not greed?”\n\nThe Emperor knelt and said: “When the myriad peoples lack a ruler, they oppress one another. Thus, I established laws to transmit to posterity. My heart privately cherishes the Dao, and I have traveled far across the four seas. Now, by fortune, I have encountered a Perfected One. I humbly beseech your compassion. I have seen the *Scripture of the True One of the Perfected*, yet though I have perused its words, I fail to grasp its meaning; though I have read its phrases, I do not comprehend its import. I beg to receive your instruction.”\n\nThe Sovereign Person was greatly astonished. Stroking his body, he sighed deeply for a long while before answering: “How did you come to hear of this? This scripture is the first chapter of the Register of Life, the numinous talisman of the Supreme Heavens, the treasure text of the Most High. By it, one ascends to heaven in broad daylight, strides through the void, and the body generates water and fire, transforming without end. The true essence of celestial immortals lies solely in the Ninefold Transmutation of Dragon Embryo Golden Liquor. Preserving form and abstaining from grains, repelling the myriad evils, commanding ghosts and spirits, attaining longevity and enduring vision—these depend on the True One’s consumption of the Five Sprouts.\n\nThese two celestial texts are perpetually entrusted to the Lord of the Southern Dipper, who records and seals them under the authority of the Grand Tally. Unless by the covenant of immortals, who may emerge but once every forty years, none may transgress the statutes to recklessly divulge them. Moreover, the Queen Mother of the West safeguards this text within the Five Cities, its outer defenses guarded by twelve immortal towers. It is stored in a coffer of purple jade, inscribed with golden seals, sealed with radiant cinnabar mushrooms, and stamped with the Middle Seal of the Most High. Those without immortal registers may not even hear of it. You are unfit to receive celestial sounds with mortal ears—depart from falsehoods.”\n\nThe Yellow Emperor kowtowed and replied: “Formerly, I received the divine elixir from the Mysterious Woman, yet have not yet compounded it. I lack only the meaning of the *True Scripture of the Five Sprouts’ Nourishment* and the *Exegesis of the True One*. Now, by this encounter, I have met a True Lord. If you do not transmit the Way of life, then I, your servant, shall never transcend the world. If I do not decline in years, what use is a fleeting existence? I only beseech your compassion to save the hearts of the common people.”\n\nThe Emperor knocked his head upon the ground until it bled and split, fainting away. After a long while, the August Person descended from the grove to raise him, and he revived. The August Person declared: “You are one who has truly attained the Dao.” Moreover, the Three Perfected Lords of Grand Purity, seeing the Emperor’s utmost sincerity, took pity and assisted him, saying to the August Person: “This man’s ancestors in former lives endured famine and hardship, yet did not feed themselves to satiety. Instead, they cut their own meager rations to relieve the hunger of a hundred starving birds, labored to save beasts and fowl, and husbanded their strength to sustain all creatures. For forty years they acted thus, their benevolence moving Heaven, their merit overshadowing the myriad things. The Most High recorded their virtue, and the Nine Heavens preserved their lineage. Thus was the radiance of their fragrant blackness transmitted to the imperial throne, their power extending through generations, their kindness bequeathed to posterity. This man’s ancestors established such goodness—how could we conceal the *Scripture of the True Sprouts* from him? Moreover, it is his earnest seeking and karmic affinity that have allowed him to meet us. You may instruct and perfect him.”\n\nThe August Person sighed and said: “Given the goodness of your past lives, why should I withhold anything? Sit again, and I shall impart to you the essential Dao.” The Emperor took his seat, and the August Person first prepared a feast, offering ritual vessels with reverence. Then, speaking slowly, he said: “The parts of the *True Scripture of the Dao* you previously received but did not understand pertain to the blackness of the Supreme Heaven, which shelters the individual body. When the body is made distinct, one may attain long life. Humanity is the most numinous of living things, yet people fail to know themselves and cannot guard their spirit to repel all evils. Those who know this need not seek protection from celestial spirits—sufficing within themselves is enough. Thus it is said: ‘The body of one person is the image of a kingdom.’ The chest and ribs are like palaces, the four limbs like suburban borders, the divisions of the bones and joints like the hundred officials, the spirit like the ruler, the blood like ministers, and the qi like the people. Therefore, to know how to govern the body is to know how to govern a kingdom. Loving the people secures the kingdom; cherishing the qi preserves the body. When the people scatter, the kingdom perishes; when the qi is exhausted, the body dies. What has perished cannot be restored; what is dead cannot be revived. Thus the perfected ones dissolve incipient calamities, cure illnesses before they arise, fortify themselves before trouble comes, and do not pursue what has already passed. The body is difficult to nourish yet easy to pollute, so examine your majesty and virtue to preserve your governance, and your desires to secure your blood and qi. Then the True One abides, the Three Ones are guarded, the body is strengthened, and longevity is distant. The Mud Pill, Crimson Palace, and Cinnabar Field are the true palaces of the Three Ones. If you guard them, the myriad poisons and thousand evils will not dare to harm you. Rinsing the Flower Pool and ceaselessly consuming the Five Sprouts will make you an immortal.”\n\n“My former teacher received this method directly from the Perfected King of the Nine Heavens, and now I inscribe it to transmit to you. When stored in the mouth, it is called the Vermilion Crow Elixir; when drawn from the body, it is called the True One. This is the celestial treasure of scripture and text. At dawn, secretly recite: ‘Eastern Green Sprout, consume the Green Sprout, drink from the Morning Flower.’ After reciting, sweep the tongue over the outer surface of the upper teeth, lick the lips, rinse the mouth, fill it, and swallow three times. Recite to the Southern Vermilion Cinnabar: ‘Consume the Vermilion Cinnabar, drink from the Cinnabar Pool.’ After reciting, sweep the tongue over the outer surface of the lower teeth, lick the lips, rinse the mouth, and swallow three times. Recite to the Central Wugeng: ‘Lofty, lofty Mount Tai, consume the essence and qi, drink from the Sweet Spring.’ After reciting, sweep the tongue over the Mysterious Throat, gather Jade Spring, lick the lips, and swallow three times. Recite to the Western Bright Stone: ‘Consume the Bright Stone, drink from the Numinous Fluid.’ After reciting, sweep the tongue over the upper teeth, lick the lips, and swallow three times, each time tapping the teeth once. After seven taps, the set is complete. Then tap the teeth five more times, totaling thirty-six taps. Next, recite to the Northern Dark Nourishment: ‘Consume the Dark Nourishment, drink from the Jade Syrup.’ After reciting, sweep the tongue over the underside of the tongue, lick the lips, and swallow three times. When finished, inhale deeply through the nose, then exhale slowly, allowing the breath to pass five times or more. The true Dao is complete.”\n\nThe Three Perfected Lords further instructed the Emperor: “Formerly, I consumed this method and attained immortality. My teacher then commanded me to enhance it by reciting over the Sweet Spring in the mouth: ‘White stone, towering and sheer, flowing springs surge through the caverns. Drink the Jade Syrup for long life, and your lifespan will ever increase.’ These twenty-two words—you may practice them. Can you persist?” The scripture states: “Practice consuming the True One without ceasing, swallow from the Flower Pool without pause, and internally circulate the qi without weariness. Having attained the Dao, you will abstain from grains. It is not a matter of months before you achieve perfection. The ancients of the Mysterious Antiquity lived long because they never consumed grains, even in haste. The *Great Possession Chapter* says: ‘The Five Grains are the chisels that carve away life, rotting the five viscera, hastening death, and shortening lifespan. Once this root enters the mouth, do not hope for longevity. If you desire not to die, keep your intestines free of dregs. If you desire long life, ensure your viscera and qi are pure and clean. Embrace the body’s flowery syrup, ascend to meet Heaven, and with Jade Water in your mouth, you and Heaven will share the same longevity.’”\n\nThe Yellow Emperor, having received the teachings, presented the August Person with all the commonplace offerings he had—jujubes, fruits, pure kitchen fare, and dark wine—vowing not to transmit the teachings. He drew a single line and took his leave. The August Person said: “If you master the Vermilion Elixir of the True One, all matters are complete. To know the One is to know all things; not to know the One is to know nothing. The One is the most noble and peerless title. The Dao arises from the One, and all numbers proceed from it. Heaven attains the One and becomes clear; spirits attain the One and become numinous; earth attains the One and becomes tranquil; humanity attains the One and lives. Gold sinks and feathers float, mountains stand and rivers flow—seen yet unseen, heard yet unheard. Preserve it, and it is present; neglect it, and it vanishes. Follow it, and there is fortune; oppose it, and there is misfortune.”\n\nGuard it closely, and your blessings shall be boundless; reveal it, and your fate withers to its darkest end. Vague and elusive—within it lies an image; elusive and vague—within it lies a thing. This is what is called the One.\n\nIf you seek long life, the Three Ones must be made clear. When hunger comes from contemplating the One, the One provides its root; when thirst comes from contemplating the One, the One provides its draught.\n\nThe ancients prized this Way of the True One, concealing its words and hiding its texts. The One alone can generate yin and give rise to yang, propelling the cycles of cold and heat. Spring attains it and blossoms; summer attains it and grows; autumn attains it and harvests; winter attains it and stores. Its greatness cannot be concealed within the Six Directions; its smallness cannot be compared to the tip of a hair. The hundred clans use it daily yet do not know it.\n\nLose nothing, grant nothing—thus the One settles in its place. Neither slow nor swift—thus the One abides in its chamber. Be at ease and unhurried, and the One will not depart. Preserve the One with diligence, and the One can commune with spirits. Drink sparingly, eat modestly, and the One will remain to nurture your breath. Facing peril without doubt, the One dispels calamity. When disaster looms ahead, contemplating the One brings life.\n\nTo know the One is not difficult—it lies in beginning and end. To know the truth yet not act is the same as not knowing. Seek knowledge without cease, and you shall ascend to the Nine August Ones. On land, fierce beasts and venomous creatures retreat; in water, demons and dragons recede. No being does not yield; no evil does not strike true.\n\nHold fast to the true and aim precisely—leaking essence means ruin. Feeding on qi for ten thousand years, one ever retains a youthful countenance.\n\nI tell you: if one can preserve the One, the One will preserve the *Highest Cavern Mystery, Numinous Treasure Scripture of the Three Ones and Five Qi*. Thus, blades cannot blunt its edge, and a hundred harms cannot harbor their malice. When others falter, you alone stand firm in peril.\n\nIs the truth of the Numinous Treasure a mere deception to Daoists? Are the profound decrees of the Supreme Sages not to be trusted by the common people? Few indeed seek it—those to come shall but brush against its gate.\n\nHere ends the *Highest Cavern Mystery, Numinous Treasure Scripture of the Three Ones and Five Qi*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上洞玄灵宝三一五气真经 经名：太上洞玄灵宝三一五气真经。 未着撰人。 据所引书目，疑为唐五代间道士所撰。 一卷。 底本出处：《正统道藏》太玄部。 太上洞玄灵宝三一五气真经 昔有黄帝轩辕曾省天皇真一之经，而不解三一真气之要，是以周流四方求其解释，尔乃命驾，出远而游，昌寓縿乘，方明为御，力牧从驾，东到青丘； 过风山见紫府先生，受三皇内文大字，以劾召万神，役使群灵； 南到玉芝玄涧，登员垄荫建木，观百灵，采若乾之华； 西见中黄子，受九加之方，过崆峒山，从广成子受自然之经； 北到鸿堤，上具茨山，见大院君黄盖童子，受《神仙芝图》十二卷，还陆王屋之山，授《金液九转神丹经》於玄女，乃复游云台青城山，见宁先生。 先生日：吾得道始仙者耳，非是三皇天真之官，实不解此真一之文，近皇人为扶桑君所使，领峨媚山仙官，今犹未去矣，子可问之。 帝又乃到峨媚山，清斋三月，得与皇人相见。 皇人者，不知何世人也。 身长九尺，玄毛被体，皆长尺余，发才长数寸，其居乃在山北绝岩之中，以白玉为屋，黄玉为肺张华罗之帏，然千和之香，侍者皆是众仙玉女，坐宾三人，皆称太清仙王。 方见皇人，设肴盈斗之枣，饮以丹华之英，杂以珍果於其间，漱朱宫玉丹之灵浆。 黄帝匍匐既到，再礼稽首而立。 皇人问曰：子欲奚求？ 黄帝跪日：愿得长生。 皇人日：子既观四海，又欲不死，不亦贪乎？ 帝跪曰：万兆无主，则相凌暴，乃为制法，足以传后。 私心好道，远涉四海，幸遇道君，愿垂哀愍，窃见真人真一之经，徒省其文而弗综其意，看其辞而不释其事，乞得请教。 皇人大惊，抚体长叹良久，乃答日：汝安得闻见此乎？ 此书乃生录之首篇，上天之灵符，太上之宝文矣。 白日升天，飞步虚空，身生水火，变化无常，其天仙之真，唯有龙胎金液九转之丹，守形绝粒，辟除万邪，使役鬼神，长生久视，尔乃血脉流宣，肠化为筋，百灾不能伤，延期至亿千，则唯有真一食五牙。 天文此二事，恒使南斗君领录参於太常挞钥，自非仙人四十年一出之约，皆不得背科而妄泄也。 又西王母安此书着五城之内，其外卫备有仙楼十二，藏以紫玉之岌，刻以黄金之割，封以丹芝光草，印以太上中章，其无仙籍者不得闻知也。 子未可听天音於地耳矣，便可去邪。 黄帝稽首答曰：昔以受神丹於玄女，未及合作，唯未受五牙食真解真经之意耳，幸今遭会得见真君，既不授以生道，是臣相命不得度世耳。 如未衰者复用暂生何为乎？ 唯乞愍济元元之心。",
      "translated_text": "*The Supreme Cavernous Mystery Numinous Treasure Scripture of the Three Ones and Five Qi*\n\n**Scripture Title:** *The Supreme Cavernous Mystery Numinous Treasure Scripture of the Three Ones and Five Qi*. Author unknown. Based on cited sources, likely composed by a Daoist of the Tang or Five Dynasties period. One fascicle. Base text from *The Orthodox Daoist Canon*, Supreme Mystery Section.\n\n---\n\nIn ancient times, the Yellow Emperor Xuanyuan once perused the *Scripture of the Celestial Sovereign’s True One*, yet failed to grasp the essentials of the Three Ones’ true qi. Thus, he journeyed to the four quarters seeking elucidation. He commanded his chariot, venturing far abroad, with Chang Yu as his driver and Fang Ming as his charioteer, while Li Mu accompanied him as an attendant. Eastward they traveled to Green Hill, where, passing Phoenix Mountain, he met the Purple Mansion Master and received the *Great Characters of the Three Sovereigns’ Inner Writ*, enabling him to summon the myriad spirits and command the host of numina.\n\nSouthward he came to Jade Mushroom’s Mystic Gorge, ascending Round Mound beneath the shade of the Fusang Tree, where he beheld the hundred spirits and gathered the blossoms of Ruoqian. Westward he met the Central Yellow Master, receiving the *Method of Nine Additions*, then passed through Kongtong Mountain, where he studied the *Scripture of Spontaneity* under Guangchengzi. Northward he reached the Vast Dyke, ascending Juci Mountain, where he encountered the Great Courtyard Lord, the Yellow Canopy Youth, and received the *Twelve Scrolls of the Divine Immortals’ Mushroom Charts*. Returning to Wangwu Mountain, he transmitted the *Scripture of the Ninefold Transmutation of Golden Liquor* to the Mysterious Woman, then journeyed once more to Cloud Terrace and Green City Mountain, where he met Master Ning.\n\nThe Master said: “I attained the Dao and became an immortal, yet I am no celestial official of the Three Sovereigns. Truly, I do not comprehend this text of the True One. Recently, the Sovereign Person was dispatched by the Fusang Lord to govern the immortal officials of Mount Emei, and has not yet departed. You may inquire of him.”\n\nThe Emperor then traveled to Mount Emei, where he purified himself for three months before finally meeting the Sovereign Person. Of what era this being hailed, none could say. His body stood nine feet tall, covered in dark fur over a foot long, while his hair measured but a few inches. His dwelling lay within a sheer cliff on the mountain’s northern face, a house of white jade with curtains of yellow jade and gossamer, suffused with the fragrance of thousand-harmony incense. His attendants were all jade maidens of the immortals, and three seated guests, each styled Supreme Clarity Immortal Kings.\n\nUpon meeting the Sovereign Person, he was offered a feast of jujubes filling a peck-measure, served with the essence of cinnabar blossoms and an array of rare fruits, and rinsed with the divine nectar of Vermilion Palace and Jade Elixir. The Yellow Emperor prostrated himself, kowtowing twice before rising.\n\nThe Sovereign Person asked: “What do you seek?”\n\nThe Emperor knelt and replied: “I wish to attain longevity.”\n\nThe Sovereign Person said: “You have surveyed the four seas, yet still desire not to die—is this not greed?”\n\nThe Emperor knelt and said: “When the myriad peoples lack a ruler, they oppress one another. Thus, I established laws to transmit to posterity. My heart privately cherishes the Dao, and I have traveled far across the four seas. Now, by fortune, I have encountered a Perfected One. I humbly beseech your compassion. I have seen the *Scripture of the True One of the Perfected*, yet though I have perused its words, I fail to grasp its meaning; though I have read its phrases, I do not comprehend its import. I beg to receive your instruction.”\n\nThe Sovereign Person was greatly astonished. Stroking his body, he sighed deeply for a long while before answering: “How did you come to hear of this? This scripture is the first chapter of the Register of Life, the numinous talisman of the Supreme Heavens, the treasure text of the Most High. By it, one ascends to heaven in broad daylight, strides through the void, and the body generates water and fire, transforming without end. The true essence of celestial immortals lies solely in the Ninefold Transmutation of Dragon Embryo Golden Liquor. Preserving form and abstaining from grains, repelling the myriad evils, commanding ghosts and spirits, attaining longevity and enduring vision—these depend on the True One’s consumption of the Five Sprouts.\n\nThese two celestial texts are perpetually entrusted to the Lord of the Southern Dipper, who records and seals them under the authority of the Grand Tally. Unless by the covenant of immortals, who may emerge but once every forty years, none may transgress the statutes to recklessly divulge them. Moreover, the Queen Mother of the West safeguards this text within the Five Cities, its outer defenses guarded by twelve immortal towers. It is stored in a coffer of purple jade, inscribed with golden seals, sealed with radiant cinnabar mushrooms, and stamped with the Middle Seal of the Most High. Those without immortal registers may not even hear of it. You are unfit to receive celestial sounds with mortal ears—depart from falsehoods.”\n\nThe Yellow Emperor kowtowed and replied: “Formerly, I received the divine elixir from the Mysterious Woman, yet have not yet compounded it. I lack only the meaning of the *True Scripture of the Five Sprouts’ Nourishment* and the *Exegesis of the True One*. Now, by this encounter, I have met a True Lord. If you do not transmit the Way of life, then I, your servant, shall never transcend the world. If I do not decline in years, what use is a fleeting existence? I only beseech your compassion to save the hearts of the common people.”",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 980,
      "start_sentence": 0,
      "end_sentence": 31,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.672858476638794,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\太上洞玄灵宝三一五气真经.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "因叩头流涕，脑破伤绝於地。 良久，皇人下林接之乃醒，告之日：子所谓真得道者也。 又太清仙王三人见帝勤心之至，愍助之，告皇人曰：此人先世祖曾遭饥困，不自饱口，割所食之饥以赈穷饿百乌，力作以救禽兽，啬役以赡蠢动，如此四十年，仁德感天，功盖万物，太上书其美，九天载其世，故令芳黑之流光乎帝位，德及数代，仁归后叶，此人先立善乃尔。 何为隐真牙之经乎？ 又亦是其勤求愿会得见吾耳，卿可教而成之也。 皇人慨然曰：子当宿世之善乃尔，吾何惜乎，可复坐，将告汝要道矣。 帝就座，皇人先为设厨，礼之僎，徐告曰：汝向所得道真经言所不解者，盖上天之黑归庇一身耳。 一身分明，便可长生也。 夫人是有生最灵者也，但人不能自知，不能守神，以却众恶耳。 知之者则不求佑於天神，止於其身则足矣。 故云：一人之身，一国之象。 胸胁之位犹宫室也，四支之列犹郊境也，骨节之分犹百官也，神犹君也。 血犹臣也，黑犹民也。 故知治身，则知治国矣。 夫爱其民所以安其国，惜其黑所以全其身，民散则国亡，黑竭则身死，亡者不可存，死者不可生。 是以至人消未起之患，治未病之疾，坚之於无事之前，不追之於既逝之后。 难养而易浊，故审威德所以保其治，嗜欲所以固血黑，然后真一存焉，三一守焉，身壮之焉，年寿遐焉。 泥丸、绛宫、丹田是三一之真宫焉，今子守之，则万毒千邪不敢伤矣。 漱华池、食五牙而不休者，便成仙人矣。 吾先师正受此方於九天真王，今书以相授也。 存之於口，名曰朱乌丹； 取之於身，名日真一。 此其天宝书文也。 向旦密祝曰：东方青牙，服食青牙，饮以朝华。 已祝，舌料上齿之表，舐唇漱口，满而咽之，三次。 祝南方朱丹：服食朱丹，饮以丹池。 已祝，舌料下齿表，舐唇漱口，咽之三次。 祝中央戊己：昂昂太山，服食精黑，饮以醴泉。 已祝，舌料舌上玄膺，取玉泉，舐唇，咽之三次。 祝西方明石：服食明石，饮以灵液。 已祝，以舌料齿上舐唇，咽之三，辄一叩齿，七下都毕，又叩齿五下，合三十六下也。 次祝北方玄滋：服食玄滋，饮以玉饴。 已祝，以舌料舌下舐唇，咽之三。 毕，因以鼻内，极而徐放之，令过五以上，真道毕矣。 三仙王又告帝曰：吾昔食此法得仙，先师令益口中醴泉下，祝曰：白石岩岩，以次行源泉涌洞，以玉浆饮之，长生，寿命益长。 凡二十二言，汝可为之，子能不乎？ 经曰：为之食真一不休，吞华池不息，内气长闭不倦者，既得道而绝粒矣，不服移月而成也。 夫玄古之人所以寿考者，造次之问不食谷也。 《大有章》曰：五谷是削命之凿，腐臭五脏，致命促缩，此根入口，无希久寿，汝欲不死，肠中无滓，汝欲长生，当令脏黑洁清，抱身华浆，与天相迎，玉水在口，天人同寿也。 黄帝受教毕，乃赠皇人以所有流俗枣果、清厨玄酒，誓以不传，画一而辞。 皇人曰：子知真一之丹，万事毕。 知一者，无一之不知也； 不知一者，无一之能知。 一者，至贵无偶之号。 道起於一，数靡不由一。 天得一以清，神得一以灵，地得一以宁，人得一以生。 金沉羽浮，山峙川流，视之不见，听之不闻； 存之则在，忽之则亡； 顺之则吉，逆之则凶；",
      "translated_text": "The Emperor knocked his head upon the ground until it bled and split, fainting away. After a long while, the August Person descended from the grove to raise him, and he revived. The August Person declared: “You are one who has truly attained the Dao.” Moreover, the Three Perfected Lords of Grand Purity, seeing the Emperor’s utmost sincerity, took pity and assisted him, saying to the August Person: “This man’s ancestors in former lives endured famine and hardship, yet did not feed themselves to satiety. Instead, they cut their own meager rations to relieve the hunger of a hundred starving birds, labored to save beasts and fowl, and husbanded their strength to sustain all creatures. For forty years they acted thus, their benevolence moving Heaven, their merit overshadowing the myriad things. The Most High recorded their virtue, and the Nine Heavens preserved their lineage. Thus was the radiance of their fragrant blackness transmitted to the imperial throne, their power extending through generations, their kindness bequeathed to posterity. This man’s ancestors established such goodness—how could we conceal the *Scripture of the True Sprouts* from him? Moreover, it is his earnest seeking and karmic affinity that have allowed him to meet us. You may instruct and perfect him.”\n\nThe August Person sighed and said: “Given the goodness of your past lives, why should I withhold anything? Sit again, and I shall impart to you the essential Dao.” The Emperor took his seat, and the August Person first prepared a feast, offering ritual vessels with reverence. Then, speaking slowly, he said: “The parts of the *True Scripture of the Dao* you previously received but did not understand pertain to the blackness of the Supreme Heaven, which shelters the individual body. When the body is made distinct, one may attain long life. Humanity is the most numinous of living things, yet people fail to know themselves and cannot guard their spirit to repel all evils. Those who know this need not seek protection from celestial spirits—sufficing within themselves is enough. Thus it is said: ‘The body of one person is the image of a kingdom.’ The chest and ribs are like palaces, the four limbs like suburban borders, the divisions of the bones and joints like the hundred officials, the spirit like the ruler, the blood like ministers, and the qi like the people. Therefore, to know how to govern the body is to know how to govern a kingdom. Loving the people secures the kingdom; cherishing the qi preserves the body. When the people scatter, the kingdom perishes; when the qi is exhausted, the body dies. What has perished cannot be restored; what is dead cannot be revived. Thus the perfected ones dissolve incipient calamities, cure illnesses before they arise, fortify themselves before trouble comes, and do not pursue what has already passed. The body is difficult to nourish yet easy to pollute, so examine your majesty and virtue to preserve your governance, and your desires to secure your blood and qi. Then the True One abides, the Three Ones are guarded, the body is strengthened, and longevity is distant. The Mud Pill, Crimson Palace, and Cinnabar Field are the true palaces of the Three Ones. If you guard them, the myriad poisons and thousand evils will not dare to harm you. Rinsing the Flower Pool and ceaselessly consuming the Five Sprouts will make you an immortal.”\n\n“My former teacher received this method directly from the Perfected King of the Nine Heavens, and now I inscribe it to transmit to you. When stored in the mouth, it is called the Vermilion Crow Elixir; when drawn from the body, it is called the True One. This is the celestial treasure of scripture and text. At dawn, secretly recite: ‘Eastern Green Sprout, consume the Green Sprout, drink from the Morning Flower.’ After reciting, sweep the tongue over the outer surface of the upper teeth, lick the lips, rinse the mouth, fill it, and swallow three times. Recite to the Southern Vermilion Cinnabar: ‘Consume the Vermilion Cinnabar, drink from the Cinnabar Pool.’ After reciting, sweep the tongue over the outer surface of the lower teeth, lick the lips, rinse the mouth, and swallow three times. Recite to the Central Wugeng: ‘Lofty, lofty Mount Tai, consume the essence and qi, drink from the Sweet Spring.’ After reciting, sweep the tongue over the Mysterious Throat, gather Jade Spring, lick the lips, and swallow three times. Recite to the Western Bright Stone: ‘Consume the Bright Stone, drink from the Numinous Fluid.’ After reciting, sweep the tongue over the upper teeth, lick the lips, and swallow three times, each time tapping the teeth once. After seven taps, the set is complete. Then tap the teeth five more times, totaling thirty-six taps. Next, recite to the Northern Dark Nourishment: ‘Consume the Dark Nourishment, drink from the Jade Syrup.’ After reciting, sweep the tongue over the underside of the tongue, lick the lips, and swallow three times. When finished, inhale deeply through the nose, then exhale slowly, allowing the breath to pass five times or more. The true Dao is complete.”\n\nThe Three Perfected Lords further instructed the Emperor: “Formerly, I consumed this method and attained immortality. My teacher then commanded me to enhance it by reciting over the Sweet Spring in the mouth: ‘White stone, towering and sheer, flowing springs surge through the caverns. Drink the Jade Syrup for long life, and your lifespan will ever increase.’ These twenty-two words—you may practice them. Can you persist?” The scripture states: “Practice consuming the True One without ceasing, swallow from the Flower Pool without pause, and internally circulate the qi without weariness. Having attained the Dao, you will abstain from grains. It is not a matter of months before you achieve perfection. The ancients of the Mysterious Antiquity lived long because they never consumed grains, even in haste. The *Great Possession Chapter* says: ‘The Five Grains are the chisels that carve away life, rotting the five viscera, hastening death, and shortening lifespan. Once this root enters the mouth, do not hope for longevity. If you desire not to die, keep your intestines free of dregs. If you desire long life, ensure your viscera and qi are pure and clean. Embrace the body’s flowery syrup, ascend to meet Heaven, and with Jade Water in your mouth, you and Heaven will share the same longevity.’”\n\nThe Yellow Emperor, having received the teachings, presented the August Person with all the commonplace offerings he had—jujubes, fruits, pure kitchen fare, and dark wine—vowing not to transmit the teachings. He drew a single line and took his leave. The August Person said: “If you master the Vermilion Elixir of the True One, all matters are complete. To know the One is to know all things; not to know the One is to know nothing. The One is the most noble and peerless title. The Dao arises from the One, and all numbers proceed from it. Heaven attains the One and becomes clear; spirits attain the One and become numinous; earth attains the One and becomes tranquil; humanity attains the One and lives. Gold sinks and feathers float, mountains stand and rivers flow—seen yet unseen, heard yet unheard. Preserve it, and it is present; neglect it, and it vanishes. Follow it, and there is fortune; oppose it, and there is misfortune.”",
      "overlap_context": "ied: “Formerly, I received the divine elixir from the Mysterious Woman, yet have not yet compounded it. I lack only the meaning of the *True Scripture of the Five Sprouts’ Nourishment* and the *Exegesis of the True One*. Now, by this encounter, I have met a True Lord. If you do not transmit the Way of life, then I, your servant, shall never transcend the world. If I do not decline in years, what use is a fleeting existence? I only beseech your compassion to save the hearts of the common people.”",
      "start_char": 980,
      "end_char": 2200,
      "start_sentence": 32,
      "end_sentence": 80,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.47163724899292,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\太上洞玄灵宝三一五气真经.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "宝之则遐 祚罔极，泄之则命凋黑穷； 忽兮恍兮，其中有象恍兮忽兮，其中有物； 此一之谓也。 必欲长生三一当明。 思一至饥，一与之根； 思一至渴，一与之浆。 古人贵此真一之道，秘口藏文，一能成阴生阳，推行寒暑，春得以发，夏得以长，秋得以收，冬得以藏，其大不可以六合隐，其小不可以芒毫比也，百姓日用而不知也汝。 失不施不与”一安其所； 不迟不疾→ 一安其室； 能暇能豫，一乃不去。 存一至勤，一能通神少饮约食，一乃留息； 临危不疑一为除灾，夭祸在前，思一得生。 知一不难，在於终始。 知真不为，与不知同。 求知不已，登彼九皇，陆辟猛兽及与毒虫，水却魍魉及与蛟龙，无物不却，无邪不中。 守真射在，泄精则亡。 食气万岁，恒有少容。 告子人能存一，一亦太上洞玄灵宝三一五气真经存人。 所以白刃无所挫其锐，百害无所容其凶。 人败已成，在危独安。 灵宝之真，岂虚诳於道士哉。 上圣玄旨，岂有不信於苍生乎？ 盖求之者鲜矣，将来染根其墙户矣。 太上洞玄灵宝三一五气真经竟",
      "translated_text": "Guard it closely, and your blessings shall be boundless; reveal it, and your fate withers to its darkest end. Vague and elusive—within it lies an image; elusive and vague—within it lies a thing. This is what is called the One.\n\nIf you seek long life, the Three Ones must be made clear. When hunger comes from contemplating the One, the One provides its root; when thirst comes from contemplating the One, the One provides its draught.\n\nThe ancients prized this Way of the True One, concealing its words and hiding its texts. The One alone can generate yin and give rise to yang, propelling the cycles of cold and heat. Spring attains it and blossoms; summer attains it and grows; autumn attains it and harvests; winter attains it and stores. Its greatness cannot be concealed within the Six Directions; its smallness cannot be compared to the tip of a hair. The hundred clans use it daily yet do not know it.\n\nLose nothing, grant nothing—thus the One settles in its place. Neither slow nor swift—thus the One abides in its chamber. Be at ease and unhurried, and the One will not depart. Preserve the One with diligence, and the One can commune with spirits. Drink sparingly, eat modestly, and the One will remain to nurture your breath. Facing peril without doubt, the One dispels calamity. When disaster looms ahead, contemplating the One brings life.\n\nTo know the One is not difficult—it lies in beginning and end. To know the truth yet not act is the same as not knowing. Seek knowledge without cease, and you shall ascend to the Nine August Ones. On land, fierce beasts and venomous creatures retreat; in water, demons and dragons recede. No being does not yield; no evil does not strike true.\n\nHold fast to the true and aim precisely—leaking essence means ruin. Feeding on qi for ten thousand years, one ever retains a youthful countenance.\n\nI tell you: if one can preserve the One, the One will preserve the *Highest Cavern Mystery, Numinous Treasure Scripture of the Three Ones and Five Qi*. Thus, blades cannot blunt its edge, and a hundred harms cannot harbor their malice. When others falter, you alone stand firm in peril.\n\nIs the truth of the Numinous Treasure a mere deception to Daoists? Are the profound decrees of the Supreme Sages not to be trusted by the common people? Few indeed seek it—those to come shall but brush against its gate.\n\nHere ends the *Highest Cavern Mystery, Numinous Treasure Scripture of the Three Ones and Five Qi*.",
      "overlap_context": " One is the most noble and peerless title. The Dao arises from the One, and all numbers proceed from it. Heaven attains the One and becomes clear; spirits attain the One and become numinous; earth attains the One and becomes tranquil; humanity attains the One and lives. Gold sinks and feathers float, mountains stand and rivers flow—seen yet unseen, heard yet unheard. Preserve it, and it is present; neglect it, and it vanishes. Follow it, and there is fortune; oppose it, and there is misfortune.”",
      "start_char": 2200,
      "end_char": 2609,
      "start_sentence": 81,
      "end_sentence": 105,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.540229558944702,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\太上洞玄灵宝三一五气真经.txt",
        "category": "正统道藏太玄部"
      }
    }
  ]
}