{
  "source_id": "太上金书玉谍宝章仪",
  "source_file": "chunked_daozang\\太上金书玉谍宝章仪.json",
  "total_chunks": 4,
  "total_original_chars": 4493,
  "total_translated_chars": 28561,
  "total_translation_time": 137.80388832092285,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\威仪类\\太上金书玉谍宝章仪.txt",
    "category": "威仪类"
  },
  "full_translation": "**The Supreme Golden Writ and Jade Register Precious Petition Ritual**\n\n**Petition for Atonement and Prayer for Peace**\n\nRespectfully, from within this servant’s five bodily palaces of the Perfected Officials, dispatch the Celestial Couriers and Clerks—two each of the Direct Envoys of the Upper Immortals and Upper Numinous Ones, two each of the Orthodox Unity Couriers, two each of the Left Palace Envoys, two each of the Right Palace Envoys, two each of the Yang Spirit Decree Clerks, two each of the Yin Spirit Decree Clerks, the Scarlet Talisman Couriers of the Ritual Chariot, and the Couriers of the Howling Wind Steeds bearing the petition—all clad in solemn attire, crowned with hanging tassels, bearing jade tablets in ordered ranks, standing before this servant to receive the words from his mouth. They shall divide and transmit them, passing through the local earth deities, the Perfected Officials of the winds and qi, the Lords of the Altars and Cities, the Two Mysteries of the Dao, the Three Origins and Four Beginnings, the Lords of the *jiazi* cyclical signs, the Seventy-Two Lords of the Officials, the Four Directions and Quarters, the Lords of the Three Origins’ Examinations and Summonses, and ascend to report to the Supreme Lord Lao, the Supreme Elder, the Celestial Master, the Lady Master, the Heir Master, the Lineage Master, and the Three Masters, as well as the Lords of the Five Qi.\n\nThis servant, dull and obstructed, deaf and blind, with sight and hearing impaired, has been mistakenly ordained as a Perfected of the Mysterious Truth. From the day of his investiture, he was bound to assist the Celestial Master, propagate the Orthodox Teachings, succor the hundred clans, and govern humans and spirits. In all petitions and supplications, none may be obstructed. Now, the disciple [Name] has for years endured misfortune and hardship; his dreams are filled with omens of ill, and flocks of crows and magpies clamor around his home. Strange birds and uncanny fowl repeatedly come to screech and jeer. His household trembles as if treading upon thin ice, with no recourse for redress. Today, he has composed his thoughts, calmed his heart, and come before this servant to beg for a petition. In accordance with the Master’s methods, this servant has recorded and submitted a petition on his behalf, now laid bare upon the altar. The Celestial Couriers and Envoys shall jointly examine and ensure its delivery. Humbly, this servant awaits the unfolding of the text.\n\n**Next: The Water Crossing Petition**\nThe disciple shall kneel, offering it to the Master, who shall unfold and read it aloud. Upon each mention of a name, the disciple shall bow in worship, ensuring the incense smoke remains unbroken.\n\nThis servant now solemnly commands the Perfected Officials of the Five Palaces and the Celestial Couriers and Clerks: [Name]’s accumulated transgressions are piled high, his faults vast as the heavens. Fearing this petition may not reach its destination, this servant now additionally invokes the Thirty-Six Void-and-Nothing Direct Talismans, the Thirty-Six Void-and-Nothing Direct Clerks, the Thirty-Six Supreme Clarity Direct Talismans, the Thirty-Six Supreme Clarity Direct Clerks, the Thirty-Six Direct Talismans of the Current Year, the Thirty-Six Direct Clerks of the Current Year, the Thirty-Six Direct Talismans of the Current Month, the Thirty-Six Direct Clerks of the Current Month, the Thirty-Six Direct Talismans of the Current Day, the Thirty-Six Direct Clerks of the Current Day, the Thirty-Six Direct Talismans of the Current Hour, the Thirty-Six Direct Clerks of the Current Hour, twenty Celestial Couriers, four Registrars, twelve Assistants, twelve Couriers for Transmission and Sealing, and twelve Golden Radiance Lads. Together with the Perfected Officials of the Five Palaces and the Celestial Couriers within this servant’s body, this servant respectfully submits a petition on behalf of [Name], now laid bare upon the altar, beseeching that it be delivered to the Jade Emperor of the Sacred Bureau, to the Three Masters’ Gate.\n\nThis servant, crude and unrefined, his bodily form unworthy of the great teachings, writes with clumsy characters, his lines uneven, his words erroneous, disordered, and misaligned, failing to meet the ritual standards. The matter rests with the Officials of Yin and Yang, the Secondary Clerks of Yin and Yang, the Four Departments of Petition Records, the Clerks of Petition Transcription, the Couriers of Transmission, and the Minor Clerks of Practice. As this petition advances, they shall correct its errors, turning left and right as needed, ensuring its proper ascent to the Celestial Treasury. Should any subordinate officials obstruct the qi, or should the demonic thieves of the Six Heavens block or intercept the petition, preventing its timely ascent, they shall be handed over to the Red-Beamed Northern Prison of the Celestial Offices for punishment according to the law. This servant’s petition shall ascend in due course to the Supreme Lord’s presence, passing through the Left Lord’s checkpoint and the Right Clerks, then through the successive gates of the various Lords, ensuring every matter is delivered.\n\nMay what this servant strikes be shattered, what he treats be healed, what he reclaims be obtained, and what he transforms be believed. The Celestial Couriers shall receive the petition and examine the text, distinguishing the hours without delay, to manifest the celestial decree.\n\nThis servant’s submission is complete. The Perfected Officials, Celestial Couriers, and Clerks shall now withdraw. Those within this servant’s body shall re-enter through the Gate of Myriad Mysteries, returning to the left if they came from the left, to the right if from the right. The Celestial Couriers and Envoys shall lead and supervise, returning to their original positions, awaiting this servant’s next summons, when they shall emerge again as before.\n\n**Three rounds of teeth-clicking and saliva-swallowing.**\nSoftly intone:\n*\"May the Celestial Couriers each return to their Golden Halls and Jade Chambers. When summoned again, they shall emerge as before.\"*\nThis servant bows twice and knocks his head to the ground.\n\n**Completion of the Petition Ritual.**\n\nWith reverence, this servant summons forth from within his body the Perfected Officials of the Five Viscera, the Couriers and Clerks—each twelve in number—to emerge. From the left division of the Three Heavens’ Celestial Numinous Ascending Petition Couriers, two officials emerge; from the right division, two officials emerge; from the central division, two officials emerge. From the Yang Heaven, two Deciding Clerks emerge; from the Earth Immortals, two Deciding Clerks emerge; from the Sacred Canon, two Deciding Clerks emerge; from the Ascending Origin, two Deciding Clerks emerge; from the Flying Chariot, two Deciding Clerks emerge; from the Rising Corpse, two Deciding Clerks emerge; from the Grand Physicians, two Deciding Clerks emerge; from the Upper Selection, two Deciding Clerks emerge; from the Middle Selection, two Deciding Clerks emerge. From the Left Official Envoys, two emerge; from the Right Official Envoys, one emerges, then another. From the Scarlet Talisman Chariot Clerks, two emerge; from the Gale-Wind Post Riders and Mounted Petition Couriers, each two emerge.\n\nThose who emerge shall don solemn attire and resplendent robes, their caps and sashes adorned with pendants, their regalia arrayed in formation before, behind, to the left, and to the right of this servant. They shall receive this servant’s words, distinguish and transmit them, and take up this servant’s petition to ascend to the Sacred Bureau. They shall inquire of the local earth deities and territorial spirits, the Perfected Officials who infuse qi, the overseers and summoners, the officials of the sexagenary cycle, the male and female officials, the male and female functionaries of the twenty-four offices, the Left and Right Commanders, the Central Palace Heralds, and the various officials of the Qiang, Hu, and Yi peoples. They shall report above to the Most High Lord Lao, the Most High Elder, the Celestial Masters, Female Masters, Heir Masters, and Lineage Masters—the Three Masters—and to the Lords of the Five Qi and their generals, officers, and soldiers, each governing their respective domains. The Right Officials shall sequentially report, faithfully recording their merits.\n\nOn the seventh day of the first month, the seventh day of the seventh month, the merits of life shall be determined and recorded; on the fifth day of the tenth month, the merits of the comprehensive petition shall be reported. Moreover, certain male officials, acting with sincere devotion, have previously submitted itemized registers of the households of this servant’s subjects, including their affiliated prefectures, counties, townships, and hamlets, their names, household registers, and ages, which have been duly filed. Now, this servant respectfully offers wine, fruit, fermented brew, and common sacrificial provisions, presenting them with utmost sincerity. Along with paper memorials, he humbly submits this petition, reporting merits and offering congratulations, beseeching the supervising officials, the overseers of the kitchens, the attending clerks, and the practicing scribes to descend together, to tread upon the site of this offering and enact its purpose, ensuring no errors or discrepancies. The immortal officials and scribes shall remain at this servant’s left and right.\n\nNext, recite the Water Crossing Petition. The disciple shall kneel and present it to the master, who shall receive and read it aloud, ensuring the incense smoke remains unbroken.\n\nWith solemn command, this servant again instructs the Perfected Officials of the Five Viscera, the masters of the Three Daoist Schools, the various Lords and Elders, the Celestial Masters, Female Masters, Heir Masters, and Lineage Masters—the Three Masters—and the Lords of the Five Qi: today, seated here, having partaken of food and drink, and received their due rewards, let bolts of silk and copper coins serve as modest tokens of gratitude. Once the kitchen overseers have completed their duties, let each return to the celestial bureaus within this servant’s body. The Couriers, Envoys, Officers, and Soldiers shall return to the left if they came from the left, to the right if from the right, coiling around this servant’s body and weaving through his hundred meridians.\n\nThis servant humbly beseeches the supervising officials to pardon the thousand transgressions and myriad faults accumulated within his body, that he may be spared punishment and reprimand. As for the immortal officials, celestial numinous officers, generals, officers, soldiers, scribes, and practicing clerks who have emerged, let them, according to their respective duties and jurisdictions, erase sins and absolve errors, strike names from the registers of death, and inscribe them in the Jade Calendar and the Ledger of Longevity. May those they protect be preserved, those they elevate ascend, and those they petition receive response. Let the Guardian Generals of the Body and the Divine Youths of the Dharma accompany and shield this servant, surveying all matters as they arise. Once their proclamations are complete, let them return within this servant’s body, re-entering through the Gate of Myriad Mysteries to their respective chambers. When summoned again, they shall emerge once more to serve. This servant bows twice and knocks his head to the ground.\n\n**Petition for the Protection of the Infant**\n\nWith reverence, this servant summons forth from within his body the Perfected Officials of the Five Viscera, the Couriers and Clerks—each two in number—to emerge. From the Upper Immortals and Upper Numinous Officials, two Courier Officials emerge; from the upper division of the Upper Immortals and Upper Numinous Ascending Petition Couriers, two officials emerge; from the middle division, two officials emerge; from the lower division, two officials emerge. From the Left and Right Official Envoys, the Yin-Yang Spirit Mediators, the Scarlet Talisman Chariot Clerks—each two emerge; from the Gale-Wind Post Riders and Mounted Petition Couriers, each two emerge. From the Perfected Officials of the Five Viscera, two Courier Clerks emerge. From the Upper Illuminated Infant Disaster-Resolving Envoys, two emerge; from the Upper Perfected Infant Tribulation-Passing Envoys, two emerge; from the Upper Life Ministers of the Central Clear Abyss, two emerge; from the Upper Life Ministers of the River’s Central Flow, two emerge; from the Middle Perfected Three Origins Tribulation-Passing Envoys, two emerge; from the Middle Perfected Three Officials Overseeing the River, two emerge; from the Middle Perfected Life Officials Overseeing the Yangtze, two emerge; from the Middle Perfected Three Officials of Life, two emerge; from the Lower Prefecture’s Water Officials of Dao and Virtue, two emerge; from the Middle Origin’s Jiangying Communicating Envoys, two emerge; from the Lower Illuminated Water’s Petitioning Envoys, two emerge; from the Lower Life’s Clear Abyss Life-Rescuing Envoys, two emerge; from the Upper Origin’s Celestial Officials of Pardon, two emerge; from the Middle Origin’s Earth Officials of Absolution, two emerge; from the Lower Origin’s Water Officials of Forgiveness, two emerge; from the Three Officials’ Huai and Ji Life-Registering Envoys, two emerge.\n\nThose who emerge shall don solemn attire and resplendent robes, their caps and sashes adorned with pendants, their dignity and bearing impeccable. Arrayed above and below, they shall assist in submitting this petition, moving to report to the Water Officials’ Bureau, to the Three Rapids and Five Lakes, to the Huai and Ji River Administrations, and to the seas and rivers. They shall appeal to the Celestial Bureaus’ Perfected Venerables and Daoist Masters on behalf of this servant’s child, so-and-so, who since birth has suffered unceasing calamities. Moreover, this servant fears that the wanton demonic spirits of the Six Heavens may harm the Three Officials, that the Three Malevolences may escape restraint and secretly assail him, that he may wrongfully suffer external misfortunes and internal demonic afflictions, and that the stone-dwelling dog-children, wet nurses, cats, rats, soldiers, hunters, and qi-ghosts may repeatedly inflict harm. With no recourse, this servant’s entire household, with single-minded devotion and exhausted thoughts, purifies its heart and surrenders its fate...\n\nThe Three Venerable Dao-Masters—the Most High Lord Lao, the Orthodox Unity Perfected Person, the Old Master by the River, and the Jade Maiden Transcendent Spirits of the Lakes—oversee all, with numinous officials delivering calamities, august deities wielding talismans, and registry-bearing messengers. They come to this servant’s petition, unraveling the origins of misfortune. According to the precepts and methods of my former master, I reverently compile this document for submission, laying it bare upon the case. I invoke the celestial officials, generals, and soldiers to guard and escort, transmitting it without delay, standing at my left and right, wherever I proceed or halt, to attend my review of the document’s text.\n\nNext, the Water-Deliverance Petition: the disciple kneels, holding it up to the master, who receives and recites it, ensuring the incense smoke in the censer does not extinguish. Calling the names, they bow twice.\n\nI solemnly charge the Perfected Officials and Direct Messengers, the left and right scribes, the attending minor clerks, the Direct Talisman and Direct Service officials, the Palace Officials of the Sun, Moon, and Stars, who oversee the Three Rivers and Four Seas, the Eight Poles and Five Lakes, the Jade Maidens of the Rivers, and the Transcendent Officials in charge—this servant reverently submits on behalf of so-and-so’s household a Great Petition for the Protection of the Infant, sealing it upon completion. Fearing inauspicious days and ominous hours, lest the petition fail to reach its destination, its words disordered or sentences awry, I beseech the Transcendent Officials and Direct Messengers, the twelve scribes, to wield long, sharp brushes, amending each line, and with dragon-sword writing knives, to excise and correct superfluous or erroneous characters, ensuring nothing is omitted, that it may promptly reach the Most High’s presence to manifest its efficacy and sincerity.\n\nYet I fear that so-and-so’s deep-rooted karmic burdens may afflict his sons and daughters, or that past evil karma may harm his household, extending calamities and sinking them into profound ruin. Should the petition’s words be lost or delayed in transmission, I earnestly invoke the Thirty-Six Void Direct Talisman Officials, the Thirty-Six Void Direct Service Officials, the Thirty-Six Supreme Clarity Direct Talisman Officials, the Thirty-Six Supreme Clarity Direct Service Officials, the Thirty-Six Direct Talisman Officials of the Current Year, the Thirty-Six Direct Service Officials of the Current Year, the Thirty-Six Direct Talisman Officials of the Current Month, the Thirty-Six Direct Service Officials of the Current Month, the Thirty-Six Direct Talisman Officials of the Current Day, the Thirty-Six Direct Service Officials of the Current Day, the Thirty-Six Direct Talisman Officials of the Current Hour, and the Thirty-Six Direct Service Officials of the Current Hour, to encircle and escort the petition, ensuring its delivery.\n\nOnce the petition is submitted, the Merit-Officials, Messengers, Generals, and Soldiers within this servant’s body shall all return to the Golden Hall and Jade Chamber within me—those on the left returning to the left, those on the right to the right, those before to the front, those behind to the rear—entering through the Gates of Myriad Wonders, coiling around my body, encompassing heaven and earth, entwining my four limbs, and weaving through my hundred meridians. When summoned again, they shall emerge to attend to their duties, as before.\n\n**Petition to Slay Evil and Destroy Ghosts**\n\nI reverently dispatch the Perfected Officials of the Five Bodily Viscera and Merit-Officials within this servant’s body, ascending to the Supreme Three Heavens—the Pure Tenuity Heaven, the Yu-Yu Heaven, and the Great Scarlet Heaven—along with the Supreme Nine Heavens’ Scarlet Yang Three-Five Merit-Officials, the Twelve High Chariot Primordial Spirits of the August Sovereign, the Scarlet Qi Scarlet Chariot Messengers, the Primordial Qi of the Mysterious Origin Messengers, the Yin-Yang True Qi Messengers, the Yellow Writ Contract Decree Covering Lords, Generals, and Soldiers, the Yin-Yang Life-Generating Lords, the Lords and Clerks of the Dao-Deliverance, Calamity-Dispersal, and Misfortune-Resolution, the Heaven-Transforming and Delusion-Dispelling Divine Lords and Soldiers, the Womb-Enveloped Perfected Persons, the Red Pine Lord and Womb-Enveloped Perfected Officials, and the Scarlet Chariot Soldiers and Clerks—twelve each.\n\nFrom within this servant’s body, I dispatch two Direct Messengers of the Upper Transcendent and Upper Numinous Bureaus, two Merit-Officials of the Qin Clan’s Two Bureaus and Three Divisions, two Merit-Officials of the Orthodox Unity’s Former Registers, two Merit-Officials of the Upper Division to Record Evil, two Merit-Officials of the Middle Division to Record Evil, two Merit-Officials of the Lower Division to Record Harm, two Merit-Officials of the Urgent Qi Division to Record Harm and Rebellion, two Messengers of the Upper Division to Seize Evil, Rebellion, and External [Entities], to Retrieve Souls and Register Spirits, two Messengers of the Middle Division to Retrieve Souls and Register Spirits, two Messengers of the Lower Division to Bind and Reverse [the Heads of] the Rebellious, two Clerks to Twist Hands and Sever Heads, two Scarlet Chariot Messengers to Supervise Executions, two Clerks of the Marketplace, two High Chariot Messengers, two Clerks to Shave Heads and Sever Ears, two Messengers to Supervise Executions of External [Entities], two Clerks to Supervise Seizures and Trials, two Clerks to Supervise Long-Sword Beheadings, two Clerks of the Rigorous Wind Cavalry to Enforce the Law, Seize Rebels, and Execute Slayings.\n\nThe Merit-Official Messengers, in solemn attire with pendent tassels and ceremonial regalia, receive this servant’s words to distinguish and report. With the following plea now presented, I beseech the capture of the external [entity], such-and-such ghost, who has repeatedly trespassed and offended. According to the True Precepts of the Celestial Master, cherishing life and detesting killing, rewarding good and punishing evil, and propagating the transformative power of the Dao, I make this earnest appeal on behalf of this mortal. Following my master’s methods, beneath the radiant stars, I bow and submit a Scarlet Petition, addressing and indicting the external [entity], such-and-such ghost. I beseech the local Earth Gods, the Qi-Monitoring Perfected Officials, the Wardens of the Domain, and the invoked Celestial Officials, Generals, and Soldiers to unite in capturing these malevolent and rebellious ghosts, to hook their livers and drag their ears, to tear out their intestines and pluck their lungs, and to bring them to the marketplace. The tongue-pulling, throat-pinching, and left-right seizing clerks, along with the head-suspending, shaving, and beheading clerks, shall stand at this servant’s front and rear, awaiting my commands to proclaim the petition’s text.\n\nNext, the Water-Deliverance Petition: the disciple kneels, holding it up to the master, who receives and recites it, offering incense without letting the smoke extinguish.\n\nI solemnly charge the Perfected Officials of the Five Bodily Viscera, the Merit-Official Generals, Soldiers, Scribes, and Minor Clerks, the Heavenly Master, the Female Master, the Lineage Master, the System Master, and the Lords of the Five Qi under the Three Masters’ tutelage. This servant reverently submits a Petition to Dispel Calamities, Resolve Harm, Slay and Behead the Malevolent, and Destroy Ghosts, presenting it to...\n\nBeneath the jurisdiction of the Three Heavenly Gates of the Sacred Bureau, the Perfected Officials of the Five Bodily Viscera within this servant’s person, along with the three-five minor clerks, twelve scribal assistants, and merit-official messengers—all donning coronets that pierce the heavens and luminous jade pendants, girded with five-colored sashes, and bearing jade tablets—shall complete their solemn preparations, grind ink and dip their brushes, and descend in timely fashion. They are charged to inscribe the petition for this household and present it to the Heavenly Offices for the apprehension of demonic malefactors. Should any subordinate officials, qi-ghosts, bandit specters, or road-blocking fiends obstruct or sever this petition’s ascent, I now solemnly invoke:\n\nThe thirty-six Direct Talisman Direct Agents and thirty-six Direct Talisman Direct Officers of this very hour,\nThe thirty-six Direct Talisman Direct Agents and thirty-six Direct Talisman Direct Officers of this very day,\nThe thirty-six Direct Talisman Direct Agents and thirty-six Direct Talisman Direct Officers of this very month,\nThe thirty-six Direct Talisman Direct Agents and thirty-six Direct Talisman Direct Officers of this very year,\nThe thirty-six Direct Talisman Direct Agents and thirty-six Direct Talisman Direct Officers of each of the four seasons,\nThe thirty-six Direct Talisman Direct Agents and thirty-six Direct Talisman Direct Officers of Yin and Yang,\nThe thirty-six Direct Talisman Direct Agents and thirty-six Direct Talisman Direct Officers of the stellar lodges,\nThe thirty-six Direct Talisman Direct Agents and thirty-six Direct Talisman Direct Officers of the Five Thearchs,\nThe thirty-six Direct Talisman Direct Agents and thirty-six Direct Talisman Direct Officers of the Six Jia,\nThe thirty-six Direct Talisman Direct Agents and thirty-six Direct Talisman Direct Officers of the Three-Five,\nThe thirty-six Direct Talisman Direct Agents and thirty-six Direct Talisman Direct Officers of Heaven-One,\nThe thirty-six Direct Talisman Direct Agents and thirty-six Direct Talisman Direct Officers of Grand Void,\nThe thirty-six Direct Talisman Direct Agents and thirty-six Direct Talisman Direct Officers of Grand Mystery,\nThe thirty-six Direct Talisman Direct Agents and thirty-six Direct Talisman Direct Officers of Grand Origin,\nThe thirty-six Direct Talisman Direct Agents and thirty-six Direct Talisman Direct Officers of Supreme Purity,\n\nTwo Merit-Officials,\nFour Registrars,\nTwelve Administrative Assistants,\nTwelve Minor Clerks,\nTwelve Golden Radiance Lads,\nSix from the Five Palaces,\nTwo Cloud-borne Petition-Supervising Couriers,\nTwo Attendants,\nTwo Petition-Examiners,\nTwo Petition-Bearers,\nLeft-Ritual-Officers and Right-Ritual-Officers,\n\nto escort and safeguard this petition as it ascends to proclaim before the Most High, Boundless, and Limitless Dao; the Most High Lord Lao; the Host of Venerable Lords; the Newly Manifest Lord Lao; the Supreme Purity and Mysterious Origin; the Three Heavens Unsurpassed; the Unsurpassed Great Dao; the Unsurpassed Heavenly Worthy; the Most High Venerable Lord; and the Jade Maiden of the Jade Emperor’s Petition-Receiving Bureau, ensuring its swift transmission.\n\nShould there be errors, omissions, improperly aligned characters, inverted phrases, or disordered sequences, the Merit-Official Messengers, Petition-Examiners, Four Departmental Attendants, and scribal assistants—along with the junior clerks, Dragon-Headed Writing Knives, and Elders—shall excise the deficient, augment the lacking, and remove the surplus, reporting in timely fashion to the Merit-Official Messengers. Clutching brushes of keen tip, they shall immediately correct and finalize the text, ensuring no supervising officials incur reprimand or rejection.\n\nShould any subordinate officials or obstructive qi deliberately intercept or sever this petition, they shall be seized and delivered to the Northern Prison of Heaven-One for punishment according to the law, thereby upholding the celestial statutes. With sealed mouths and restrained breath, the petition shall ascend directly to the presence of the Most High. Let there be no delay: the Left Lord shall pass through the gates in sequence, the Right Clerk shall present it in order, and each Venerable Lord shall transmit it through successive ranks, ensuring that all petitions reach their destination, all summons are answered, all restraints are enforced, and all dissolutions are effected.\n\nUpon completion of the petition’s proclamation, the three-five Merit-Official Lords, Generals, Clerks, and soldiers within this servant’s person shall re-enter through the Gates of Myriad Mysteries, resuming their positions in due order. The Direct Merit-Officials shall assign and record their ranks: those on the left return to the left, those on the right to the right, coiling about the body and weaving through the hundred vessels. When summoned again, they shall emerge to execute their duties, all in accordance with precedent.\n\nThis servant bows his head and prostrates twice.\n\n**Essential Offerings:**\nFifty trays of cakes and fruits,\nTwo *jin* of dried venison,\nOne *jin* of dried fish,\nOne *dou* of clear wine,\nThree *liang* of true incense,\nFive bolts of stabilizing silk,\nOne thousand two hundred cash,\nOne bolt of stabilizing pledge silk,\nOne bow,\nFive arrows,\nOne *dou* and two *sheng* of life-bestowing rice,\nOne pair of silver rings,\nTwenty-four *chi* of five-colored thread,\nOne knife.\n\n**Ritual Procedure:**\nConstruct an altar by the riverbank and arrange a high seat. Establish incense fires in the five directions. Upon completion of the petition’s recitation, burn it at the Heavenly Gate. Draw the likeness of the ghost, place it in a box weighted with an anchor, and sink it into the water’s depths—ensuring it never resurfaces. If no river is available, use three *dou* of clear water and submerge it according to the method.\n\nPrepare one brush, one inkstick, and one hundred sheets of paper, all scrupulously purified. Fumigate the petition paper with incense and expose it before the spirit tablet for three days, ensuring it remains unsoiled by wind, rain, or rodents before use.\n\nThe Rites for the Golden Script and Jade Tablet of the Most High are hereby concluded.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上金书玉牒宝章仪 经名：太上金书玉牒宝章仪。 撰人不详，约出於南北朝或隋唐。 系早期天师道出官上章仪。 一卷。 底本出处； 《正统道藏》洞神部威仪类。 太上金书玉牒宝章仪 谢过祈安章 谨出臣某身中五体真官功曹吏，出上仙上灵直使功曹吏官各二人，出正一功曹官各二人，出左官使者官各二人，出右官使者官各二人，出阳神决吏官各二人，出阴神决吏官各二人，出科车赤符吏，刚风骑置驿马上章吏官各二人，出出者严装显服，冠带垂缨，卤簿齐执玉版，住立臣前，衔受臣口中辞语，分别关启，此间土地里域，真官风气注气，社稷邑主道上二玄，三元四始，甲子诸官，七十二官君，四面方位，三元考召君等，上启太上老君，太上丈人，天师女师嗣师系师三师君门下五气君等，臣以顽塞聋瞽，视听不聪，谬为玄真，所见摽拔，授署之日，约当辅助天师，宣扬正化，救治百姓，料理人鬼，凡有告请，不容遏塞，今有弟子某频岁已来，家中迍坎，梦想凶恶，群乌众鹊，绕宅喧啾，怪乌异禽，频来嘲噪，合家惶怖若履冰危，无方披诉，即日整虑澄心，诣臣求乞章表，臣按师法，为录奏某章一通，露在案上，功曹使者对共平省，必令投达，伏听披文。 次祝水度章，弟子跪捧进师，师披进读，几称名即礼拜，勿令香姻中断。 臣谨重勑五体真官，功曹将吏，但某积殃累迭，过在弥天，奏拜章文，恐不御达，今重请虚无直符三十六人，虚无直事三十六人，泰清直符三十六人，泰清直事三十六人，今岁直符三十六人，今岁直事三十六人，今月直符三十六人，今月直事三十六人，今日直符三十六人，今日直事三十六人，今时直符三十六人，今时直事三十六人，功曹二十人，主簿四人，干佐一十二人，传书送封吏十二人，金光童子吏十二人，并臣身中五体真官功曹使者，臣谨为某拜奏，上某章一通，露在案上，乞使上达圣司玉皇帝前，三师门下，但臣顽陋，胚躯不赓大训，书字拙弱，行列不端，文字谬误，颠倒错乱，不合仪式者，事在阴阳二官，阴阳次吏，四部案章，从事录章书吏，传言书佐习事小吏，随此章文进对，回左归右，必使正定上达天府，若有下官故炁，六天鬼贼道路遏绝，邀截章文，不即上达者，仰付天曹赤梁北狱，依法治罪，令臣章书，以时上诣 太上御前左君历关右吏，次启诸君历递，乞事事投达，令臣所击者破，所治者差，所收者得，所化者信，功曹受事寻文，分别晷刻勿停，以明天宪，臣拜奏事讫，向出仙官功曹将吏悉还，臣身中从众妙门而入，在左归左，在右归右，功曹使者主领检押，还复本位，须臣后召，复出，一如故事。 叩齿咽液三遍，微祝曰： 功曹使者各归金堂玉室之中，须召复出，一如故事，臣某顿首再拜。 言功都章",
      "translated_text": "**The Supreme Golden Writ and Jade Register Precious Petition Ritual**\n\n**Petition for Atonement and Prayer for Peace**\n\nRespectfully, from within this servant’s five bodily palaces of the Perfected Officials, dispatch the Celestial Couriers and Clerks—two each of the Direct Envoys of the Upper Immortals and Upper Numinous Ones, two each of the Orthodox Unity Couriers, two each of the Left Palace Envoys, two each of the Right Palace Envoys, two each of the Yang Spirit Decree Clerks, two each of the Yin Spirit Decree Clerks, the Scarlet Talisman Couriers of the Ritual Chariot, and the Couriers of the Howling Wind Steeds bearing the petition—all clad in solemn attire, crowned with hanging tassels, bearing jade tablets in ordered ranks, standing before this servant to receive the words from his mouth. They shall divide and transmit them, passing through the local earth deities, the Perfected Officials of the winds and qi, the Lords of the Altars and Cities, the Two Mysteries of the Dao, the Three Origins and Four Beginnings, the Lords of the *jiazi* cyclical signs, the Seventy-Two Lords of the Officials, the Four Directions and Quarters, the Lords of the Three Origins’ Examinations and Summonses, and ascend to report to the Supreme Lord Lao, the Supreme Elder, the Celestial Master, the Lady Master, the Heir Master, the Lineage Master, and the Three Masters, as well as the Lords of the Five Qi.\n\nThis servant, dull and obstructed, deaf and blind, with sight and hearing impaired, has been mistakenly ordained as a Perfected of the Mysterious Truth. From the day of his investiture, he was bound to assist the Celestial Master, propagate the Orthodox Teachings, succor the hundred clans, and govern humans and spirits. In all petitions and supplications, none may be obstructed. Now, the disciple [Name] has for years endured misfortune and hardship; his dreams are filled with omens of ill, and flocks of crows and magpies clamor around his home. Strange birds and uncanny fowl repeatedly come to screech and jeer. His household trembles as if treading upon thin ice, with no recourse for redress. Today, he has composed his thoughts, calmed his heart, and come before this servant to beg for a petition. In accordance with the Master’s methods, this servant has recorded and submitted a petition on his behalf, now laid bare upon the altar. The Celestial Couriers and Envoys shall jointly examine and ensure its delivery. Humbly, this servant awaits the unfolding of the text.\n\n**Next: The Water Crossing Petition**\nThe disciple shall kneel, offering it to the Master, who shall unfold and read it aloud. Upon each mention of a name, the disciple shall bow in worship, ensuring the incense smoke remains unbroken.\n\nThis servant now solemnly commands the Perfected Officials of the Five Palaces and the Celestial Couriers and Clerks: [Name]’s accumulated transgressions are piled high, his faults vast as the heavens. Fearing this petition may not reach its destination, this servant now additionally invokes the Thirty-Six Void-and-Nothing Direct Talismans, the Thirty-Six Void-and-Nothing Direct Clerks, the Thirty-Six Supreme Clarity Direct Talismans, the Thirty-Six Supreme Clarity Direct Clerks, the Thirty-Six Direct Talismans of the Current Year, the Thirty-Six Direct Clerks of the Current Year, the Thirty-Six Direct Talismans of the Current Month, the Thirty-Six Direct Clerks of the Current Month, the Thirty-Six Direct Talismans of the Current Day, the Thirty-Six Direct Clerks of the Current Day, the Thirty-Six Direct Talismans of the Current Hour, the Thirty-Six Direct Clerks of the Current Hour, twenty Celestial Couriers, four Registrars, twelve Assistants, twelve Couriers for Transmission and Sealing, and twelve Golden Radiance Lads. Together with the Perfected Officials of the Five Palaces and the Celestial Couriers within this servant’s body, this servant respectfully submits a petition on behalf of [Name], now laid bare upon the altar, beseeching that it be delivered to the Jade Emperor of the Sacred Bureau, to the Three Masters’ Gate.\n\nThis servant, crude and unrefined, his bodily form unworthy of the great teachings, writes with clumsy characters, his lines uneven, his words erroneous, disordered, and misaligned, failing to meet the ritual standards. The matter rests with the Officials of Yin and Yang, the Secondary Clerks of Yin and Yang, the Four Departments of Petition Records, the Clerks of Petition Transcription, the Couriers of Transmission, and the Minor Clerks of Practice. As this petition advances, they shall correct its errors, turning left and right as needed, ensuring its proper ascent to the Celestial Treasury. Should any subordinate officials obstruct the qi, or should the demonic thieves of the Six Heavens block or intercept the petition, preventing its timely ascent, they shall be handed over to the Red-Beamed Northern Prison of the Celestial Offices for punishment according to the law. This servant’s petition shall ascend in due course to the Supreme Lord’s presence, passing through the Left Lord’s checkpoint and the Right Clerks, then through the successive gates of the various Lords, ensuring every matter is delivered.\n\nMay what this servant strikes be shattered, what he treats be healed, what he reclaims be obtained, and what he transforms be believed. The Celestial Couriers shall receive the petition and examine the text, distinguishing the hours without delay, to manifest the celestial decree.\n\nThis servant’s submission is complete. The Perfected Officials, Celestial Couriers, and Clerks shall now withdraw. Those within this servant’s body shall re-enter through the Gate of Myriad Mysteries, returning to the left if they came from the left, to the right if from the right. The Celestial Couriers and Envoys shall lead and supervise, returning to their original positions, awaiting this servant’s next summons, when they shall emerge again as before.\n\n**Three rounds of teeth-clicking and saliva-swallowing.**\nSoftly intone:\n*\"May the Celestial Couriers each return to their Golden Halls and Jade Chambers. When summoned again, they shall emerge as before.\"*\nThis servant bows twice and knocks his head to the ground.\n\n**Completion of the Petition Ritual.**",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1076,
      "start_sentence": 0,
      "end_sentence": 15,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.034919023513794,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太上金书玉谍宝章仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "谨出臣某身中五体真官功曹吏，出臣所佩上仙上灵官消灾散祸解厄君吏，各十二人出，三天天灵左部腾章功曹官各二人出，三天天灵右部腾章功曹官各二人出，三天天灵都部腾章功曹官各二人出，阳天决吏二人出，地仙决吏二人出，圣典决吏二人出，登元决吏二人出，腾车决吏二人出，起尸决吏二人出，太医决吏二人出，上选决吏二人出，中选决吏二人出，左官使者二人出，右官使者一、一人出，科车赤符吏二人出，刚风骑置驿马上章吏各二人出。 出者严装显服，冠带垂缨，卤簿住立臣前后左右，衔受臣言，分别关启，操臣单章，上诣 圣司，关启此问某处土地里域，真官注气，监察考召，甲子诸官，男官女官，男职女职二十四职，左右都候君，中官谒者，羌胡氏夷诸官君，上启 太上老君，太上丈人，天师女师嗣师系师三师君门下，五气君等君将吏兵，各有所典，右官历启，实记言功，正月七日，七月七日，言生定录，十月五日，都章言功，又有男官某等，奉情真诚，以先对令条牒臣民户数，所属州县乡里，名籍户口年纪，始上关籍，又臣谨以酒果醪噀，俗中供具，陈荐丹恳，并上纸刺，呈启奏事，言功赏贺，乞上官主者，监厨直事，监察主司书佐习事，一合来下降，履醮所主事施行，勿令错互，仙官书佐，在臣左右，谨披章文。 次祝水度章，弟子捧跪进於师，师接进读，勿令香姻中断。 谨重勑五体真官，三师道主诸君丈人，天师女师嗣师系师，三师君等门下，五炁君，即日座中饮食劳赏事讫，匹帛铜钱，聊充酬献，监厨受事讫，各还天曹臣身中，功曹使者将吏兵士，在左还左，在右还右，缠身绕体，经纬百脉，恩惟 上官典者，原臣身中积行所犯千罪万过，一乞赦贷，不见谪罚，所出仙官天灵，真吏君将吏，兵书佐习事等，随事主察当局主职，削罪原愆，改注死籍，刊名玉历，长生簿中，所保者全，所腾者达，所请者下，护身将军，护法灵童，随逐匡扈，随事通览，宣告事讫，各还臣身中，从众妙门而入，复於宫室，须召又到，复出奉行，臣某稽首再拜。 保护婴儿章 谨出臣身中五体真官，功曹吏官各二人出，上仙上灵二官功曹官各二人出，上仙上灵上部功曹腾章吏官各二人出，上仙上灵中部功曹腾章吏官各二人出，上仙上灵下部功曹腾章吏官各二人出，左右官使者，阴阳神央吏，科车赤符吏各二人出，刚风骑置驿马上章吏各二人出，五体真官功曹吏各二人出，上明婴儿解厄使者二人出，上真婴儿度厄使者二人出，上生丞中清沅使者二人出，上生河中生算使者二人出，中真三元度厄使者二人出，中真三官临河使者二人出，中真生官临江使者二人出，中真三官生命使者二人出，下府水官道德使者二人出，中元通候江影使者二人出，下明水中诉请使者二人出，下生清沅拔命使者二人出，上元天官赦罪使者二人出，中元地官原考使者二人出，下元水官原愆使者二人出，三官淮济生算使者二人出。 出者严装显服，冠带垂缨，整其威仪，罗列上下扶助，奏请移告水官门下，三湍五湖，淮济曹府江海之中，申诉天曹真尊道主，今为某息儿某，受生已来灾厄不息，又恐六天纵逸鬼魔，克伤三官，不拘三凶窃逼，枉遭外殃内鬼，及石下犬子乳母，猫鼠兵猎气鬼频为祟害，无方投措，合家一意罄虑，洗心归命",
      "translated_text": "With reverence, this servant summons forth from within his body the Perfected Officials of the Five Viscera, the Couriers and Clerks—each twelve in number—to emerge. From the left division of the Three Heavens’ Celestial Numinous Ascending Petition Couriers, two officials emerge; from the right division, two officials emerge; from the central division, two officials emerge. From the Yang Heaven, two Deciding Clerks emerge; from the Earth Immortals, two Deciding Clerks emerge; from the Sacred Canon, two Deciding Clerks emerge; from the Ascending Origin, two Deciding Clerks emerge; from the Flying Chariot, two Deciding Clerks emerge; from the Rising Corpse, two Deciding Clerks emerge; from the Grand Physicians, two Deciding Clerks emerge; from the Upper Selection, two Deciding Clerks emerge; from the Middle Selection, two Deciding Clerks emerge. From the Left Official Envoys, two emerge; from the Right Official Envoys, one emerges, then another. From the Scarlet Talisman Chariot Clerks, two emerge; from the Gale-Wind Post Riders and Mounted Petition Couriers, each two emerge.\n\nThose who emerge shall don solemn attire and resplendent robes, their caps and sashes adorned with pendants, their regalia arrayed in formation before, behind, to the left, and to the right of this servant. They shall receive this servant’s words, distinguish and transmit them, and take up this servant’s petition to ascend to the Sacred Bureau. They shall inquire of the local earth deities and territorial spirits, the Perfected Officials who infuse qi, the overseers and summoners, the officials of the sexagenary cycle, the male and female officials, the male and female functionaries of the twenty-four offices, the Left and Right Commanders, the Central Palace Heralds, and the various officials of the Qiang, Hu, and Yi peoples. They shall report above to the Most High Lord Lao, the Most High Elder, the Celestial Masters, Female Masters, Heir Masters, and Lineage Masters—the Three Masters—and to the Lords of the Five Qi and their generals, officers, and soldiers, each governing their respective domains. The Right Officials shall sequentially report, faithfully recording their merits.\n\nOn the seventh day of the first month, the seventh day of the seventh month, the merits of life shall be determined and recorded; on the fifth day of the tenth month, the merits of the comprehensive petition shall be reported. Moreover, certain male officials, acting with sincere devotion, have previously submitted itemized registers of the households of this servant’s subjects, including their affiliated prefectures, counties, townships, and hamlets, their names, household registers, and ages, which have been duly filed. Now, this servant respectfully offers wine, fruit, fermented brew, and common sacrificial provisions, presenting them with utmost sincerity. Along with paper memorials, he humbly submits this petition, reporting merits and offering congratulations, beseeching the supervising officials, the overseers of the kitchens, the attending clerks, and the practicing scribes to descend together, to tread upon the site of this offering and enact its purpose, ensuring no errors or discrepancies. The immortal officials and scribes shall remain at this servant’s left and right.\n\nNext, recite the Water Crossing Petition. The disciple shall kneel and present it to the master, who shall receive and read it aloud, ensuring the incense smoke remains unbroken.\n\nWith solemn command, this servant again instructs the Perfected Officials of the Five Viscera, the masters of the Three Daoist Schools, the various Lords and Elders, the Celestial Masters, Female Masters, Heir Masters, and Lineage Masters—the Three Masters—and the Lords of the Five Qi: today, seated here, having partaken of food and drink, and received their due rewards, let bolts of silk and copper coins serve as modest tokens of gratitude. Once the kitchen overseers have completed their duties, let each return to the celestial bureaus within this servant’s body. The Couriers, Envoys, Officers, and Soldiers shall return to the left if they came from the left, to the right if from the right, coiling around this servant’s body and weaving through his hundred meridians.\n\nThis servant humbly beseeches the supervising officials to pardon the thousand transgressions and myriad faults accumulated within his body, that he may be spared punishment and reprimand. As for the immortal officials, celestial numinous officers, generals, officers, soldiers, scribes, and practicing clerks who have emerged, let them, according to their respective duties and jurisdictions, erase sins and absolve errors, strike names from the registers of death, and inscribe them in the Jade Calendar and the Ledger of Longevity. May those they protect be preserved, those they elevate ascend, and those they petition receive response. Let the Guardian Generals of the Body and the Divine Youths of the Dharma accompany and shield this servant, surveying all matters as they arise. Once their proclamations are complete, let them return within this servant’s body, re-entering through the Gate of Myriad Mysteries to their respective chambers. When summoned again, they shall emerge once more to serve. This servant bows twice and knocks his head to the ground.\n\n**Petition for the Protection of the Infant**\n\nWith reverence, this servant summons forth from within his body the Perfected Officials of the Five Viscera, the Couriers and Clerks—each two in number—to emerge. From the Upper Immortals and Upper Numinous Officials, two Courier Officials emerge; from the upper division of the Upper Immortals and Upper Numinous Ascending Petition Couriers, two officials emerge; from the middle division, two officials emerge; from the lower division, two officials emerge. From the Left and Right Official Envoys, the Yin-Yang Spirit Mediators, the Scarlet Talisman Chariot Clerks—each two emerge; from the Gale-Wind Post Riders and Mounted Petition Couriers, each two emerge. From the Perfected Officials of the Five Viscera, two Courier Clerks emerge. From the Upper Illuminated Infant Disaster-Resolving Envoys, two emerge; from the Upper Perfected Infant Tribulation-Passing Envoys, two emerge; from the Upper Life Ministers of the Central Clear Abyss, two emerge; from the Upper Life Ministers of the River’s Central Flow, two emerge; from the Middle Perfected Three Origins Tribulation-Passing Envoys, two emerge; from the Middle Perfected Three Officials Overseeing the River, two emerge; from the Middle Perfected Life Officials Overseeing the Yangtze, two emerge; from the Middle Perfected Three Officials of Life, two emerge; from the Lower Prefecture’s Water Officials of Dao and Virtue, two emerge; from the Middle Origin’s Jiangying Communicating Envoys, two emerge; from the Lower Illuminated Water’s Petitioning Envoys, two emerge; from the Lower Life’s Clear Abyss Life-Rescuing Envoys, two emerge; from the Upper Origin’s Celestial Officials of Pardon, two emerge; from the Middle Origin’s Earth Officials of Absolution, two emerge; from the Lower Origin’s Water Officials of Forgiveness, two emerge; from the Three Officials’ Huai and Ji Life-Registering Envoys, two emerge.\n\nThose who emerge shall don solemn attire and resplendent robes, their caps and sashes adorned with pendants, their dignity and bearing impeccable. Arrayed above and below, they shall assist in submitting this petition, moving to report to the Water Officials’ Bureau, to the Three Rapids and Five Lakes, to the Huai and Ji River Administrations, and to the seas and rivers. They shall appeal to the Celestial Bureaus’ Perfected Venerables and Daoist Masters on behalf of this servant’s child, so-and-so, who since birth has suffered unceasing calamities. Moreover, this servant fears that the wanton demonic spirits of the Six Heavens may harm the Three Officials, that the Three Malevolences may escape restraint and secretly assail him, that he may wrongfully suffer external misfortunes and internal demonic afflictions, and that the stone-dwelling dog-children, wet nurses, cats, rats, soldiers, hunters, and qi-ghosts may repeatedly inflict harm. With no recourse, this servant’s entire household, with single-minded devotion and exhausted thoughts, purifies its heart and surrenders its fate...",
      "overlap_context": " from the right. The Celestial Couriers and Envoys shall lead and supervise, returning to their original positions, awaiting this servant’s next summons, when they shall emerge again as before.\n\n**Three rounds of teeth-clicking and saliva-swallowing.**\nSoftly intone:\n*\"May the Celestial Couriers each return to their Golden Halls and Jade Chambers. When summoned again, they shall emerge as before.\"*\nThis servant bows twice and knocks his head to the ground.\n\n**Completion of the Petition Ritual.**",
      "start_char": 1076,
      "end_char": 2350,
      "start_sentence": 16,
      "end_sentence": 25,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.30611801147461,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太上金书玉谍宝章仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "三尊道主，太上老君，正一真人，河上老子，湖中玉女灵仙，监察一切，灵官度厄，尊神执符，把籍使者，诣臣申表，披雪殃原，臣按先师科法，谨为录章申奏，露在案上，上请天官将吏，兵士营卫扶从，逐时传达，在臣左右，行立所在，听臣省阅章文。 次祝水度章，弟子跪捧上师，师接进读，勿令炉中烟绝，称名再拜。 谨重勑真官直使，左右书佐，习事小吏，直符直事、日宫月宫星宫，主察三河四海，八极五湖，河中玉女，受事仙官，臣谨为某家拜奏婴儿保护大章一通，封置事讫，恐日恶时凶，所启不达，谬悮颠倒，言句差错，乞仙官直使，十二书佐，主为修治长毫利笔，逐行调治，龙剑书刀，寻文割截剩者，为割错字为易，勿令漏没，及时径达 太上御前，以明效信，但恐某宿业深厚，妨及男女，或宿绿恶业，害及家门，逮及殃锺，延没非浅，章书漏落，不即上达，重请虚无直符三十六人，虚无直事三十六人，泰清直符三十六人，泰清直事三十六人，今岁直符三十六人，今岁直事三十六人，今月直符三十六人，今月直事三十六人，今日直符三十六人，今日直事三十六人，今时直符三十六人，今时直事三十六人，围绕章行，必令投达，奏章事讫，臣身中功曹使者君将吏兵，悉还臣身中金堂玉室之中，在左还左，在右还右，在前还前，在后还后，从众妙门而入，缠身绕体，弥纶天地，匝绕四肢，经纬百脉，须召复出，随事奉行，一如故事，臣某顿首顿首再拜。 斩恶破鬼章 谨出臣某身中五体真官功曹吏，出无上三天清微天禹余天大赤天，无上九天赤阳三五功曹，上皇真人十二高车元神，赤气赤车使者，玄元始气使者，阴阳真气使者，黄书契令覆盖君将吏兵，阴阳生气君，度道消灾散祸解厄君吏，上天变惑中化神君兵吏，中胎真人，赤松君将中胎真官，赤车兵吏各十二人，出臣身中上仙上灵二官直使功曹官各二人，出秦氏二官三部功曹官各二人，出正一功曹故录吏官各二人，出上部功曹收恶录恶吏官各二人，出中部功曹收恶录恶吏官各二人，出下部功曹收害录害吏官各二人，出促气功曹收害录逆吏官各二人，出上部使者收恶逆外□收魂录魄吏官各二人，出中部使者收魂录魄吏官各二人，出下部使者的头反缚吏官各二人，出绞手截头吏官各二人，出赤车使者监杀露，出都市吏官各二人，出高车使者官各二人，出髡头截耳 吏官各二人，出监杀外□使者宫各二人，出监杀搦案吏官各二人，出监杀长刀截头吏官各二人，出刚风骑置执法收逆斩杀吏官各二人，出功曹使者严装冠带垂缨，卤簿衔，受臣言分别关奏，谨有某词言款到，求乞收捕外□某鬼等，前后累来干犯，臣谨依天师真科，好生恶杀，赏善罚恶，宣扬法化，为肉人告诉情恳，臣辄按师法，露出明星之下，拜上赤章一通，牒奏外□某鬼等，乞此问某处土地真官注气监察真官里域邑主所请天官将吏兵士，同心并力收捕恶逆之鬼，钩肝押耳 ，抽肠拔肺，将向都市，拔舌钳咽左右走使擒捕吏，倚住左右悬头髡截斩首吏等，倚立臣前后，受臣驱使，听臣宣读章文。 次祝水度章，弟子跪捧上师，师接进读，上香勿令烟绝。 臣谨重勑五体真官功曹将士书佐小吏，天师女师嗣师系师三师门下五气君等，臣谨为某拜上消灾解害，斩馘恶逆，收□破鬼章一通，上诣",
      "translated_text": "The Three Venerable Dao-Masters—the Most High Lord Lao, the Orthodox Unity Perfected Person, the Old Master by the River, and the Jade Maiden Transcendent Spirits of the Lakes—oversee all, with numinous officials delivering calamities, august deities wielding talismans, and registry-bearing messengers. They come to this servant’s petition, unraveling the origins of misfortune. According to the precepts and methods of my former master, I reverently compile this document for submission, laying it bare upon the case. I invoke the celestial officials, generals, and soldiers to guard and escort, transmitting it without delay, standing at my left and right, wherever I proceed or halt, to attend my review of the document’s text.\n\nNext, the Water-Deliverance Petition: the disciple kneels, holding it up to the master, who receives and recites it, ensuring the incense smoke in the censer does not extinguish. Calling the names, they bow twice.\n\nI solemnly charge the Perfected Officials and Direct Messengers, the left and right scribes, the attending minor clerks, the Direct Talisman and Direct Service officials, the Palace Officials of the Sun, Moon, and Stars, who oversee the Three Rivers and Four Seas, the Eight Poles and Five Lakes, the Jade Maidens of the Rivers, and the Transcendent Officials in charge—this servant reverently submits on behalf of so-and-so’s household a Great Petition for the Protection of the Infant, sealing it upon completion. Fearing inauspicious days and ominous hours, lest the petition fail to reach its destination, its words disordered or sentences awry, I beseech the Transcendent Officials and Direct Messengers, the twelve scribes, to wield long, sharp brushes, amending each line, and with dragon-sword writing knives, to excise and correct superfluous or erroneous characters, ensuring nothing is omitted, that it may promptly reach the Most High’s presence to manifest its efficacy and sincerity.\n\nYet I fear that so-and-so’s deep-rooted karmic burdens may afflict his sons and daughters, or that past evil karma may harm his household, extending calamities and sinking them into profound ruin. Should the petition’s words be lost or delayed in transmission, I earnestly invoke the Thirty-Six Void Direct Talisman Officials, the Thirty-Six Void Direct Service Officials, the Thirty-Six Supreme Clarity Direct Talisman Officials, the Thirty-Six Supreme Clarity Direct Service Officials, the Thirty-Six Direct Talisman Officials of the Current Year, the Thirty-Six Direct Service Officials of the Current Year, the Thirty-Six Direct Talisman Officials of the Current Month, the Thirty-Six Direct Service Officials of the Current Month, the Thirty-Six Direct Talisman Officials of the Current Day, the Thirty-Six Direct Service Officials of the Current Day, the Thirty-Six Direct Talisman Officials of the Current Hour, and the Thirty-Six Direct Service Officials of the Current Hour, to encircle and escort the petition, ensuring its delivery.\n\nOnce the petition is submitted, the Merit-Officials, Messengers, Generals, and Soldiers within this servant’s body shall all return to the Golden Hall and Jade Chamber within me—those on the left returning to the left, those on the right to the right, those before to the front, those behind to the rear—entering through the Gates of Myriad Wonders, coiling around my body, encompassing heaven and earth, entwining my four limbs, and weaving through my hundred meridians. When summoned again, they shall emerge to attend to their duties, as before.\n\n**Petition to Slay Evil and Destroy Ghosts**\n\nI reverently dispatch the Perfected Officials of the Five Bodily Viscera and Merit-Officials within this servant’s body, ascending to the Supreme Three Heavens—the Pure Tenuity Heaven, the Yu-Yu Heaven, and the Great Scarlet Heaven—along with the Supreme Nine Heavens’ Scarlet Yang Three-Five Merit-Officials, the Twelve High Chariot Primordial Spirits of the August Sovereign, the Scarlet Qi Scarlet Chariot Messengers, the Primordial Qi of the Mysterious Origin Messengers, the Yin-Yang True Qi Messengers, the Yellow Writ Contract Decree Covering Lords, Generals, and Soldiers, the Yin-Yang Life-Generating Lords, the Lords and Clerks of the Dao-Deliverance, Calamity-Dispersal, and Misfortune-Resolution, the Heaven-Transforming and Delusion-Dispelling Divine Lords and Soldiers, the Womb-Enveloped Perfected Persons, the Red Pine Lord and Womb-Enveloped Perfected Officials, and the Scarlet Chariot Soldiers and Clerks—twelve each.\n\nFrom within this servant’s body, I dispatch two Direct Messengers of the Upper Transcendent and Upper Numinous Bureaus, two Merit-Officials of the Qin Clan’s Two Bureaus and Three Divisions, two Merit-Officials of the Orthodox Unity’s Former Registers, two Merit-Officials of the Upper Division to Record Evil, two Merit-Officials of the Middle Division to Record Evil, two Merit-Officials of the Lower Division to Record Harm, two Merit-Officials of the Urgent Qi Division to Record Harm and Rebellion, two Messengers of the Upper Division to Seize Evil, Rebellion, and External [Entities], to Retrieve Souls and Register Spirits, two Messengers of the Middle Division to Retrieve Souls and Register Spirits, two Messengers of the Lower Division to Bind and Reverse [the Heads of] the Rebellious, two Clerks to Twist Hands and Sever Heads, two Scarlet Chariot Messengers to Supervise Executions, two Clerks of the Marketplace, two High Chariot Messengers, two Clerks to Shave Heads and Sever Ears, two Messengers to Supervise Executions of External [Entities], two Clerks to Supervise Seizures and Trials, two Clerks to Supervise Long-Sword Beheadings, two Clerks of the Rigorous Wind Cavalry to Enforce the Law, Seize Rebels, and Execute Slayings.\n\nThe Merit-Official Messengers, in solemn attire with pendent tassels and ceremonial regalia, receive this servant’s words to distinguish and report. With the following plea now presented, I beseech the capture of the external [entity], such-and-such ghost, who has repeatedly trespassed and offended. According to the True Precepts of the Celestial Master, cherishing life and detesting killing, rewarding good and punishing evil, and propagating the transformative power of the Dao, I make this earnest appeal on behalf of this mortal. Following my master’s methods, beneath the radiant stars, I bow and submit a Scarlet Petition, addressing and indicting the external [entity], such-and-such ghost. I beseech the local Earth Gods, the Qi-Monitoring Perfected Officials, the Wardens of the Domain, and the invoked Celestial Officials, Generals, and Soldiers to unite in capturing these malevolent and rebellious ghosts, to hook their livers and drag their ears, to tear out their intestines and pluck their lungs, and to bring them to the marketplace. The tongue-pulling, throat-pinching, and left-right seizing clerks, along with the head-suspending, shaving, and beheading clerks, shall stand at this servant’s front and rear, awaiting my commands to proclaim the petition’s text.\n\nNext, the Water-Deliverance Petition: the disciple kneels, holding it up to the master, who receives and recites it, offering incense without letting the smoke extinguish.\n\nI solemnly charge the Perfected Officials of the Five Bodily Viscera, the Merit-Official Generals, Soldiers, Scribes, and Minor Clerks, the Heavenly Master, the Female Master, the Lineage Master, the System Master, and the Lords of the Five Qi under the Three Masters’ tutelage. This servant reverently submits a Petition to Dispel Calamities, Resolve Harm, Slay and Behead the Malevolent, and Destroy Ghosts, presenting it to...",
      "overlap_context": "demonic spirits of the Six Heavens may harm the Three Officials, that the Three Malevolences may escape restraint and secretly assail him, that he may wrongfully suffer external misfortunes and internal demonic afflictions, and that the stone-dwelling dog-children, wet nurses, cats, rats, soldiers, hunters, and qi-ghosts may repeatedly inflict harm. With no recourse, this servant’s entire household, with single-minded devotion and exhausted thoughts, purifies its heart and surrenders its fate...",
      "start_char": 2350,
      "end_char": 3625,
      "start_sentence": 26,
      "end_sentence": 35,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.25454640388489,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太上金书玉谍宝章仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "圣司三天门下，主遣臣身中五体真官三五小吏，十二书佐功曹使者，头戴通天之冠，夜光之璧，齐着五色之绶，齐执玉版，严装事讫，磨砚点笔，及时来下，主为某家注定章文，上诣天曹收捕妖□，若有下官故气鬼贼贼道路，遏绝臣章，不使上达者，谨重请今时直符直事三十六人，今日直符直事三十六人，今月直符直事三十六人，今岁直符直事三十六人，四时直符直事各三十六人，阴阳直符阴阳直事各三十六人，星宿直符星宿直事各三十六人，五帝直符五帝直事各三十六人，六甲直符六甲直事各三十六人，三五直符三五直事各三十六人，天一直符天一直事各三十六人，太虚直符太虚直事各三十六人，太玄直符太玄直事各三十六人，太始直符太始直事各三十六人，泰清直符泰清直事各三十六人，功曹二人，主簿四人，干佐十二人，小吏十二人，金光童子十二人，五宫六人，云中扶章督邮吏二人，从事二人，案章二人，赍章二人，左社右稷，扶护臣章，上诰 太上无极大道太上老君，诸君丈人，新出老君，泰清玄元，无上三天，无上大道，无上天尊，太上丈人，玉皇案上付省章玉女通达诣上，若有谬误脱漏，文字不端，言句倒错，不知次第者，委功曹使者案章四部从事传言书，佐习事小吏龙头书刀长者，为剔短者为益，剩者为除，随时上达功曹使者，衔毫利笔，即为正定，勿令上官典者有所谴却，若有下宫故气遮遏断截者，仰收付天一北狱之中，依法治罪，以明天宪，闭口衔气，径上 太上御前，慎勿稽停，左君历关，右吏次启，诸君历递，分别次第，必使投达所请者至，所召者到，所押者伏，所消者灭，伏待告报上章事讫，所出身中三五功曹君将吏兵，从众妙门而入，案其次第，直使功曹差次检录，在左归左，在右归右，缠身绕体，经纬百脉，须召又到，复出奉行，一如故事，臣某顿首再拜。 科要 饼果五十盘，鹿脯二觔，鱼脯一觔，清酒一斗，真香三两，镇彩五段，钱一千二百文，镇信绢一疋，弓一张，箭五只，命米一斗二升，银环一双，线五色二十四尺，刀一口。 於江岸作坛，置高座。 施安五方香火，奏章讫，天门上焚之，画鬼形像，函盛碇沉水底，千万不出，如不就江河，须清水三斗，依法沉之，笔一管，墨一铤，纸一百幅，须一一虔洁，书章纸香上熏过，露於像前，三日不被飘落，鼠污然可堪用。 太上金书玉牒宝章仪竟",
      "translated_text": "Beneath the jurisdiction of the Three Heavenly Gates of the Sacred Bureau, the Perfected Officials of the Five Bodily Viscera within this servant’s person, along with the three-five minor clerks, twelve scribal assistants, and merit-official messengers—all donning coronets that pierce the heavens and luminous jade pendants, girded with five-colored sashes, and bearing jade tablets—shall complete their solemn preparations, grind ink and dip their brushes, and descend in timely fashion. They are charged to inscribe the petition for this household and present it to the Heavenly Offices for the apprehension of demonic malefactors. Should any subordinate officials, qi-ghosts, bandit specters, or road-blocking fiends obstruct or sever this petition’s ascent, I now solemnly invoke:\n\nThe thirty-six Direct Talisman Direct Agents and thirty-six Direct Talisman Direct Officers of this very hour,\nThe thirty-six Direct Talisman Direct Agents and thirty-six Direct Talisman Direct Officers of this very day,\nThe thirty-six Direct Talisman Direct Agents and thirty-six Direct Talisman Direct Officers of this very month,\nThe thirty-six Direct Talisman Direct Agents and thirty-six Direct Talisman Direct Officers of this very year,\nThe thirty-six Direct Talisman Direct Agents and thirty-six Direct Talisman Direct Officers of each of the four seasons,\nThe thirty-six Direct Talisman Direct Agents and thirty-six Direct Talisman Direct Officers of Yin and Yang,\nThe thirty-six Direct Talisman Direct Agents and thirty-six Direct Talisman Direct Officers of the stellar lodges,\nThe thirty-six Direct Talisman Direct Agents and thirty-six Direct Talisman Direct Officers of the Five Thearchs,\nThe thirty-six Direct Talisman Direct Agents and thirty-six Direct Talisman Direct Officers of the Six Jia,\nThe thirty-six Direct Talisman Direct Agents and thirty-six Direct Talisman Direct Officers of the Three-Five,\nThe thirty-six Direct Talisman Direct Agents and thirty-six Direct Talisman Direct Officers of Heaven-One,\nThe thirty-six Direct Talisman Direct Agents and thirty-six Direct Talisman Direct Officers of Grand Void,\nThe thirty-six Direct Talisman Direct Agents and thirty-six Direct Talisman Direct Officers of Grand Mystery,\nThe thirty-six Direct Talisman Direct Agents and thirty-six Direct Talisman Direct Officers of Grand Origin,\nThe thirty-six Direct Talisman Direct Agents and thirty-six Direct Talisman Direct Officers of Supreme Purity,\n\nTwo Merit-Officials,\nFour Registrars,\nTwelve Administrative Assistants,\nTwelve Minor Clerks,\nTwelve Golden Radiance Lads,\nSix from the Five Palaces,\nTwo Cloud-borne Petition-Supervising Couriers,\nTwo Attendants,\nTwo Petition-Examiners,\nTwo Petition-Bearers,\nLeft-Ritual-Officers and Right-Ritual-Officers,\n\nto escort and safeguard this petition as it ascends to proclaim before the Most High, Boundless, and Limitless Dao; the Most High Lord Lao; the Host of Venerable Lords; the Newly Manifest Lord Lao; the Supreme Purity and Mysterious Origin; the Three Heavens Unsurpassed; the Unsurpassed Great Dao; the Unsurpassed Heavenly Worthy; the Most High Venerable Lord; and the Jade Maiden of the Jade Emperor’s Petition-Receiving Bureau, ensuring its swift transmission.\n\nShould there be errors, omissions, improperly aligned characters, inverted phrases, or disordered sequences, the Merit-Official Messengers, Petition-Examiners, Four Departmental Attendants, and scribal assistants—along with the junior clerks, Dragon-Headed Writing Knives, and Elders—shall excise the deficient, augment the lacking, and remove the surplus, reporting in timely fashion to the Merit-Official Messengers. Clutching brushes of keen tip, they shall immediately correct and finalize the text, ensuring no supervising officials incur reprimand or rejection.\n\nShould any subordinate officials or obstructive qi deliberately intercept or sever this petition, they shall be seized and delivered to the Northern Prison of Heaven-One for punishment according to the law, thereby upholding the celestial statutes. With sealed mouths and restrained breath, the petition shall ascend directly to the presence of the Most High. Let there be no delay: the Left Lord shall pass through the gates in sequence, the Right Clerk shall present it in order, and each Venerable Lord shall transmit it through successive ranks, ensuring that all petitions reach their destination, all summons are answered, all restraints are enforced, and all dissolutions are effected.\n\nUpon completion of the petition’s proclamation, the three-five Merit-Official Lords, Generals, Clerks, and soldiers within this servant’s person shall re-enter through the Gates of Myriad Mysteries, resuming their positions in due order. The Direct Merit-Officials shall assign and record their ranks: those on the left return to the left, those on the right to the right, coiling about the body and weaving through the hundred vessels. When summoned again, they shall emerge to execute their duties, all in accordance with precedent.\n\nThis servant bows his head and prostrates twice.\n\n**Essential Offerings:**\nFifty trays of cakes and fruits,\nTwo *jin* of dried venison,\nOne *jin* of dried fish,\nOne *dou* of clear wine,\nThree *liang* of true incense,\nFive bolts of stabilizing silk,\nOne thousand two hundred cash,\nOne bolt of stabilizing pledge silk,\nOne bow,\nFive arrows,\nOne *dou* and two *sheng* of life-bestowing rice,\nOne pair of silver rings,\nTwenty-four *chi* of five-colored thread,\nOne knife.\n\n**Ritual Procedure:**\nConstruct an altar by the riverbank and arrange a high seat. Establish incense fires in the five directions. Upon completion of the petition’s recitation, burn it at the Heavenly Gate. Draw the likeness of the ghost, place it in a box weighted with an anchor, and sink it into the water’s depths—ensuring it never resurfaces. If no river is available, use three *dou* of clear water and submerge it according to the method.\n\nPrepare one brush, one inkstick, and one hundred sheets of paper, all scrupulously purified. Fumigate the petition paper with incense and expose it before the spirit tablet for three days, ensuring it remains unsoiled by wind, rain, or rodents before use.\n\nThe Rites for the Golden Script and Jade Tablet of the Most High are hereby concluded.",
      "overlap_context": "nd recites it, offering incense without letting the smoke extinguish.\n\nI solemnly charge the Perfected Officials of the Five Bodily Viscera, the Merit-Official Generals, Soldiers, Scribes, and Minor Clerks, the Heavenly Master, the Female Master, the Lineage Master, the System Master, and the Lords of the Five Qi under the Three Masters’ tutelage. This servant reverently submits a Petition to Dispel Calamities, Resolve Harm, Slay and Behead the Malevolent, and Destroy Ghosts, presenting it to...",
      "start_char": 3625,
      "end_char": 4553,
      "start_sentence": 36,
      "end_sentence": 43,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.20830488204956,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太上金书玉谍宝章仪.txt",
        "category": "威仪类"
      }
    }
  ]
}