{
  "source_id": "太平经圣君秘旨",
  "source_file": "chunked_daozang\\太平经圣君秘旨.json",
  "total_chunks": 2,
  "total_original_chars": 1903,
  "total_translated_chars": 11289,
  "total_translation_time": 48.36756110191345,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏太平部\\太平经圣君秘旨.txt",
    "category": "正统道藏太平部"
  },
  "full_translation": "**The Holy Lord’s Secret Instructions from the Scripture of Great Peace**\n\n*Scripture Title:* The Holy Lord’s Secret Instructions from the Scripture of Great Peace. Originally titled *Transmission from the Supreme Minister, the Green Youth Lord*. According to Wang Ming’s *Prefatory Notes to the Collated Scripture of Great Peace*, this text was compiled by Lüqiu Fangyuan in the late Tang Dynasty, excerpted from the *Scripture of Great Peace*. In volume four of Jia Shansiang’s *Records of the Dragon’s Likeness* from the Northern Song, it is stated: *The Secret Instructions of Great Peace* in one scroll, received by the Supreme Minister, the Green Youth Lord, speaks of the method of \"guarding the One\"—referring to this book.\n\n**The Holy Lord’s Secret Instructions**\n*Transmitted by the Supreme Minister, the Green Youth Lord*\n\nThe Holy Lord said: The Three Qi unite as One—one as essence, one as spirit, one as qi. These three share a single position, the root of the qi of Heaven, Earth, and Humanity.\n\nSpirit is received from Heaven, essence from Earth, and qi from the Central Harmony. Together, they form a unity. Thus, spirit rides upon qi to move, essence dwells within it, and the three assist one another in governance.\n\nThose who desire longevity must cherish qi, revere spirit, and honor essence. Humanity originally arises from the primordial qi of chaos. Qi generates essence, essence generates spirit, and spirit generates illumination. Rooted in the qi of yin and yang, qi transforms into essence, essence into spirit, and spirit into illumination.\n\nThose who desire longevity must guard qi and unite with spirit, ensuring essence does not depart from form. Contemplate these three as one, and over time, refinement will naturally manifest. The body’s form will gradually lighten, essence will grow brighter, radiance will intensify, and the heart will find great peace, joyfully as if delighted. The qi of Great Peace will respond.\n\nCultivate the inner, and it will reflect outwardly. Within, attain longevity; without, attain governance. Without exerting physical strength, Great Peace is naturally achieved.\n\nThe method of guarding and illuminating the One: before mastery, close the eyes in darkness, seeing no light within. After prolonged guarding, light will naturally arise. Radiantly perceiving the four directions, one may travel far with the light, beholding the form and countenance of the body. The host of spirits will gather, enabling the form to transform into spirit.\n\nThe method of guarding and illuminating the One: the light may appear as true blue-green. When blue-green and clear, it is the illumination of Lesser Yang.\n\nThe method of guarding and illuminating the One: the light may appear as true red, like fire’s glow—this is the light of transcending the world.\n\nThe method of guarding and illuminating the One: the light may appear as true yellow with blue-green—this is the light of Central Harmony, the finest medicine of the Dao.\n\nThe method of guarding and illuminating the One: the light may appear as true white, like clear water—this is the illumination of Lesser Yin.\n\nThe method of guarding and illuminating the One: the light may appear as true black, clear as gazing into water—this is the light of Greater Yin.\n\nThe method of guarding and illuminating the One: when the four directions are dark, yet the abdomen shines brightly within—this is the illumination of Supreme Harmony, the Dao of perfect compliance.\n\nThe method of guarding and illuminating the One: when both outer and inner are dark, with no affiliation or perception—this person is perverse and disordered. Swiftly aid them with methods and medicines.\n\nSeek the seven principles above, and inquire within.\n\nThe method of guarding the One: the old become young again, white hair turns black, and fallen teeth regrow. Guarding the One for one month adds a year to one’s lifespan; two months, two years—proceeding thus in succession.\n\nThe method of guarding the One: initially, one should dwell in seclusion, with thick walls and sturdy barriers, free from the clamor of noise.\n\nThe method of guarding the One: when light permeates the six directions, the body remains unharmed. One may thus complete one’s years, and descendants will endure long.\n\nGuard the One without fail, and all affairs will naturally conclude. Swiftly dispel all worries—what more could one seek?\n\nIn guarding the One without end, scholars and disciples who wish to be free of care must not deceive one another. Remain composed and at ease.\n\nGuarding the One is the path to enduring wandering. Be ever vigilant, and misfortunes will depart.\n\nThe method of guarding the One: the divine medicine comes of itself.\n\nThe method of guarding the One: no harm befalls, for each person possesses something no other requires. Tigers and wolves do not gaze upon you, dragons do not rise, and all poisonous creatures flee your form.\n\nIf you wish to be forever free of care, seek the One. The hundred spirits and thousand ghosts cannot contend with you.\n\nGuard it with constant focus, and disasters will not shift.\n\nThe method of guarding the One: do not speak of its root; carefully close its gate. Do not dare to leak it; guard its spirit diligently. Outwardly dark, inwardly bright—only then can the One be achieved.\n\nThe method of guarding the One: it will journey with the spirits. The myriad spirits will come of their own accord, radiantly as if paired.\n\nThose who wish to guard the One: joy and anger are maladies. Without joy or anger, the One may be perceived.\n\nThe method of guarding the One: within, there are five guards; without, six signs. The eleven spirits share a single gateway.\n\nThe method of guarding the One: contemplate the originally formless. When fluids converge and unite, the One arises from them. Shedding age to return to youth, one may attain longevity.\n\nIf you guard the One, do not let many know. Guard the One without retreat, and there will be nothing unknown. All you seek will be obtained—attain it while seated upright.\n\nIf you desire great joy, know the One. Forsake glory and renounce fame—the One is fitting.\n\nIf you wish to nurture old age, guard the One early. Rest on a level bed, preserve the One, and you will be sated without eating, aging without decline.\n\nThe method of guarding the One begins gradually. Guard it over time, and by a hundred days, the One will arrive.\n\nThe method of guarding the One: do not contrive clever intentions—the One will manifest of itself.\n\nThose who wish to guard the One will commune with the spirits. Repose in non-action, seek within the abdomen. Though lying in the west of the mountains, you will know the east.\n\nThe method of guarding the One is the root of the myriad spirits. When the root is deep and the spirit tranquil, death has no entry.\n\nThe method of guarding the One: the old and young differ in measure. Each follows their nature, and the One will be encountered.\n\nThe method of guarding the One: be content in poverty, delight in lowliness, and seek within. The One will appear, and you will know that neither high nor low matters.\n\nThe method of guarding the One: moderation in eating is the root. The true spirit favors purity; foulness and filth cloud the qi.\n\nThe method of guarding the One: silently contemplate its essentials. Circulate without end, without beginning or trace.\n\nThe countenance and eyes radiate luminosity, the spirit becomes penetratingly clear. The method of guarding the One: one hundred days mark the Lesser Stillness, two hundred days the Middle Stillness, three hundred days the Greater Stillness. Within, joy becomes constant, and the Three Corpses fall away.\n\nThe method of guarding the One comprises three hundred and sixty-six numerical cycles. Each number holds one essence, each essence holds one spirit. When the work of guarding the One is accomplished, this spirit may be beheld.\n\nThe method of guarding the One includes the Five Inner Governances. If the mind wanders outward, the inner governances are lost. If guarding the One is done poorly, inner rebellion meets outer restraint, turning the One into an adversary.\n\nThe method of guarding the One is ever attended by the Six Controller Spirits, who together deliberate over human transgressions. The method of guarding the One is the master of all spirits, the root of human goodness, the means to dispel misfortune, and the gateway to attaining blessings.\n\nOne who guards the One is the master of the divine vessel. From the One Spirit, accumulation extends to the myriad spirits; when all share the same vessel, the Dao is attained. The method of guarding the One: if within there is great rebellion and disorder, the Five Palaces fall into discord and the Six Treasuries lose their guardianship. The host of spirits, alarmed and agitated, all depart to report at the Hall of Light. This is first revealed in the countenance and complexion, known to Heaven and Earth alike. When the host of spirits departs, the form is doomed to die.\n\nThe method of guarding the One: in doing good, the effects may be witnessed. Today, in doing good and maintaining purity, the divine luminosity gradually brightens. At first like the glow of fireflies, in time it resembles lightning’s flash.\n\nThe method of guarding the One: outwardly, merit lies in practicing benevolence and bestowing kindness, without seeking repayment; loyalty and filial piety are likewise. The method of guarding the One brings a hundred blessings and a hundred misfortunes. If what is guarded is not single-minded, and external affairs are manifold, the hundred spirits contend in rivalry, victory and defeat intertwined.\n\nThe method of guarding the One: within, the spirit is ever concentrated, cherished like an infant. How then would the hundred misfortunes dare to encroach? The method of guarding the One is one with the gods and numina of Heaven and Earth. Emerging from yin and entering yang, there is nothing it does not penetrate.\n\nThe method of guarding the One: first know the will of Heaven. It engenders and transforms the myriad things, governs without speech, accomplishes without dominion—thus the Dao gives birth to enduring vision. The method of guarding the One enables knowledge of the ten thousand threads. Yet the ten thousand threads cannot know the One.\n\nOne who guards the One may transcend the world, dispel calamities, serve a lord, avoid death, govern a household, commune with the divine, escape poverty, heal illness, attain longevity, and achieve enduring vision. It is the origin of primordial qi, the pivot of the myriad things.\n\nHeaven, failing to guard the One, loses its clarity; Earth, failing to guard the One, loses its tranquility; the sun, failing to guard the One, loses its brightness; the moon, failing to guard the One, loses its essence; the stars, failing to guard the One, lose their courses; mountains, failing to guard the One, cannot avoid collapse; waters, failing to guard the One, give rise to dust; spirits, failing to guard the One, cannot come into being; humans, failing to guard the One, cannot live.\n\nThe One is the root; all affairs proceed from it. Know the One, and the ten thousand affairs are complete.\n\nHere end the secret instructions of the Sagely Lord of the *Scripture of Great Peace*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太平经圣君秘旨 经名：太平经圣君秘旨。 原题《传上相青童君》。 据王明《太平经合校前官》考证，此经系唐末闾丘方远摘录《太平经》而成。 北宋贾善翔《犹龙传》卷四称：《太平秘旨》一卷，上相青童君受，言守一之法，即指此书。 底本出处：《正统道藏》太平部。 太平经圣君秘旨 传上相青童君 圣君曰：三气共一，一为精，一为神，一为气。 此三者共一位，本天地人之气根。 神者受之於天，精者受之於地，气者受之中和，相与共为一。 故神者乘气而行，精者居其中，三者相助为理。 欲寿者当爱气、尊神、重精。 夫人本生混沌之气，气生精，精生神，神生明。 本於阴阳之气，气转为精，精转为神，神转为明。 欲寿者当守气而合神，精不去其形，念此三合以为一，久即彬彬自见，身中形渐轻，精益明，光益精，心中大安，欣然若喜，太平气应矣。 修其内，反应於外，内以致寿，外以致理，非用筋力，自然而致太平矣。 守一明之法，未精之时，暝目冥冥，目中无有光。 守一复久，自生光明。 昭然见四方，随明而远行，尽见身形容。 群神将集，故能形化为神。 守一明法，明有正青。 青而清明者，少阳之明也。 守一明法，明正赤若火光，光者度世。 守一明法，明正黄而青者，中和之光，其道良药。 守一明法，正白如清水，此少阴之明也。 守一明法，明有正黑，清若窥水者，太阴之光。 守一明法，四方皆暗，腹中洞照。 此太和之明也，大顺之道。 守一明法，有外暗内暗，无所属，无所睹。 此人邪乱，急以方药助之。 寻上七首，内自求之。 守一之法，老而更少，发白更黑，齿落更生。 守之一月，增寿一年； 两月，增寿二年； 以次而增之。 守一之法，始思居闲处，宜重墙厚壁，不闻喧哗之音。 守一之法，光通六外，身乃无害。 可终其世，子得长久。 守一勿失，事且自毕； 急除众忧，一复何求？ 守一不穷，士子欲无忧，不可相欺，垂拱。 守一是为久游，身常自谨，患祸去之。 守一之法，神药自来。 守一之法，凡害不害，人各有一不相须。 虎狼不视，蛟龙不升，有毒之物皆逃形。 子欲长无忧，与一相求； 百神千鬼，不得相尤。 守而常专，灾害不迁。 守一之法，不言其根，谨闭其门； 不敢泄漏，谨守其神； 外暗内明，一乃可成。 守一之法，将与神游。 万神自来，昭昭可俦。 夫欲守一，喜怒为疾，不喜不怒，一乃可睹。 守一之法，内有五守，外有六候，十一之神，同一门户。 守一之法，当念本无形，凑液相合，一乃从生，去老反稚，可得长生。 子若守一，无使多知，守一不退，无一不知，所求皆得，端坐致之。 子欲大乐，与一相知，去荣辞显，一乃相宜。 子欲养老，守一为早，平床坐卧，与一相保，不食而饱，不德衰老。 守一之法，皆从渐起； 守之积久，其一百日至。 守一之法，无致巧意，一乃自效。 夫欲守一，乃与神通； 安卧无为，反求腹中； 卧在山西，反知山东。 守一之法，乃万神本根，根深神静，死之无门。 守一之法，老小异度，各因其性，一乃相遇。 守一之法，安贫乐贱，常内自求； 一乃相见，知非贵贱。 守一之法，少食为根，真神好洁，粪秽气昏。 守一之法，密思其要，周而复始，无端无徽；",
      "translated_text": "**The Holy Lord’s Secret Instructions from the Scripture of Great Peace**\n\n*Scripture Title:* The Holy Lord’s Secret Instructions from the Scripture of Great Peace. Originally titled *Transmission from the Supreme Minister, the Green Youth Lord*. According to Wang Ming’s *Prefatory Notes to the Collated Scripture of Great Peace*, this text was compiled by Lüqiu Fangyuan in the late Tang Dynasty, excerpted from the *Scripture of Great Peace*. In volume four of Jia Shansiang’s *Records of the Dragon’s Likeness* from the Northern Song, it is stated: *The Secret Instructions of Great Peace* in one scroll, received by the Supreme Minister, the Green Youth Lord, speaks of the method of \"guarding the One\"—referring to this book.\n\n**The Holy Lord’s Secret Instructions**\n*Transmitted by the Supreme Minister, the Green Youth Lord*\n\nThe Holy Lord said: The Three Qi unite as One—one as essence, one as spirit, one as qi. These three share a single position, the root of the qi of Heaven, Earth, and Humanity.\n\nSpirit is received from Heaven, essence from Earth, and qi from the Central Harmony. Together, they form a unity. Thus, spirit rides upon qi to move, essence dwells within it, and the three assist one another in governance.\n\nThose who desire longevity must cherish qi, revere spirit, and honor essence. Humanity originally arises from the primordial qi of chaos. Qi generates essence, essence generates spirit, and spirit generates illumination. Rooted in the qi of yin and yang, qi transforms into essence, essence into spirit, and spirit into illumination.\n\nThose who desire longevity must guard qi and unite with spirit, ensuring essence does not depart from form. Contemplate these three as one, and over time, refinement will naturally manifest. The body’s form will gradually lighten, essence will grow brighter, radiance will intensify, and the heart will find great peace, joyfully as if delighted. The qi of Great Peace will respond.\n\nCultivate the inner, and it will reflect outwardly. Within, attain longevity; without, attain governance. Without exerting physical strength, Great Peace is naturally achieved.\n\nThe method of guarding and illuminating the One: before mastery, close the eyes in darkness, seeing no light within. After prolonged guarding, light will naturally arise. Radiantly perceiving the four directions, one may travel far with the light, beholding the form and countenance of the body. The host of spirits will gather, enabling the form to transform into spirit.\n\nThe method of guarding and illuminating the One: the light may appear as true blue-green. When blue-green and clear, it is the illumination of Lesser Yang.\n\nThe method of guarding and illuminating the One: the light may appear as true red, like fire’s glow—this is the light of transcending the world.\n\nThe method of guarding and illuminating the One: the light may appear as true yellow with blue-green—this is the light of Central Harmony, the finest medicine of the Dao.\n\nThe method of guarding and illuminating the One: the light may appear as true white, like clear water—this is the illumination of Lesser Yin.\n\nThe method of guarding and illuminating the One: the light may appear as true black, clear as gazing into water—this is the light of Greater Yin.\n\nThe method of guarding and illuminating the One: when the four directions are dark, yet the abdomen shines brightly within—this is the illumination of Supreme Harmony, the Dao of perfect compliance.\n\nThe method of guarding and illuminating the One: when both outer and inner are dark, with no affiliation or perception—this person is perverse and disordered. Swiftly aid them with methods and medicines.\n\nSeek the seven principles above, and inquire within.\n\nThe method of guarding the One: the old become young again, white hair turns black, and fallen teeth regrow. Guarding the One for one month adds a year to one’s lifespan; two months, two years—proceeding thus in succession.\n\nThe method of guarding the One: initially, one should dwell in seclusion, with thick walls and sturdy barriers, free from the clamor of noise.\n\nThe method of guarding the One: when light permeates the six directions, the body remains unharmed. One may thus complete one’s years, and descendants will endure long.\n\nGuard the One without fail, and all affairs will naturally conclude. Swiftly dispel all worries—what more could one seek?\n\nIn guarding the One without end, scholars and disciples who wish to be free of care must not deceive one another. Remain composed and at ease.\n\nGuarding the One is the path to enduring wandering. Be ever vigilant, and misfortunes will depart.\n\nThe method of guarding the One: the divine medicine comes of itself.\n\nThe method of guarding the One: no harm befalls, for each person possesses something no other requires. Tigers and wolves do not gaze upon you, dragons do not rise, and all poisonous creatures flee your form.\n\nIf you wish to be forever free of care, seek the One. The hundred spirits and thousand ghosts cannot contend with you.\n\nGuard it with constant focus, and disasters will not shift.\n\nThe method of guarding the One: do not speak of its root; carefully close its gate. Do not dare to leak it; guard its spirit diligently. Outwardly dark, inwardly bright—only then can the One be achieved.\n\nThe method of guarding the One: it will journey with the spirits. The myriad spirits will come of their own accord, radiantly as if paired.\n\nThose who wish to guard the One: joy and anger are maladies. Without joy or anger, the One may be perceived.\n\nThe method of guarding the One: within, there are five guards; without, six signs. The eleven spirits share a single gateway.\n\nThe method of guarding the One: contemplate the originally formless. When fluids converge and unite, the One arises from them. Shedding age to return to youth, one may attain longevity.\n\nIf you guard the One, do not let many know. Guard the One without retreat, and there will be nothing unknown. All you seek will be obtained—attain it while seated upright.\n\nIf you desire great joy, know the One. Forsake glory and renounce fame—the One is fitting.\n\nIf you wish to nurture old age, guard the One early. Rest on a level bed, preserve the One, and you will be sated without eating, aging without decline.\n\nThe method of guarding the One begins gradually. Guard it over time, and by a hundred days, the One will arrive.\n\nThe method of guarding the One: do not contrive clever intentions—the One will manifest of itself.\n\nThose who wish to guard the One will commune with the spirits. Repose in non-action, seek within the abdomen. Though lying in the west of the mountains, you will know the east.\n\nThe method of guarding the One is the root of the myriad spirits. When the root is deep and the spirit tranquil, death has no entry.\n\nThe method of guarding the One: the old and young differ in measure. Each follows their nature, and the One will be encountered.\n\nThe method of guarding the One: be content in poverty, delight in lowliness, and seek within. The One will appear, and you will know that neither high nor low matters.\n\nThe method of guarding the One: moderation in eating is the root. The true spirit favors purity; foulness and filth cloud the qi.\n\nThe method of guarding the One: silently contemplate its essentials. Circulate without end, without beginning or trace.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1306,
      "start_sentence": 0,
      "end_sentence": 71,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.21510124206543,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\太平经圣君秘旨.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "面目有光明，精神洞晓。 守一之法，百日为小静，二百日为中静，三百日为大静。 内使常乐，三尸已落。 守一之法，有三百六十六数。 数有一精，精有一神。 守一功成，此神可睹。 守一之法，有内五政，游心於外，内则失政。 守一不善，内逆外谨，与一为怨。 守一之法，常有六司命神，共议人过失。 守一之法，乃诸神主，人善之根，除祸之法，致福之门。 守一者，乃神器之主，从一神积至万神，同一器则得道矣。 守一之法，内若大逆不正，五宫乖错，六府失守。 群神恐恢，俱出白於明堂，必先见於面目颜色，天地共知之。 群神将逝，形当死矣。 守一之法，为善，效验可睹。 今日为善清静，神明渐光。 始如萤火，久似电光。 守一之法，外则行仁施惠为功，不望其报，忠孝亦同。 守一之法，有百福亦有百祸。 所守不专，外事多端； 百神争竞，胜负相连。 守一之法，内常专神，爱之如赤子，百祸如何敢干。 守一之法，与天地神明同。 出阴入阳，无事不通也。 守一之法，先知天意，生化万物，不言而理，功成不宰，道生久视。 守一之法，可以知万端。 万端者，不能知一。 夫守一者，可以度世，可以消灾，可以事君，可以不死，可以理家，可以事神明，可以不穷困，可以理病，可以长生，可以久视。 元气之首，万物枢机。 天不守一失其清，地不守一失其宁，日不守一失其明，月不守一失其精，星不守一失其行，山不守一不免崩，水不守一尘土生，神不守一不生成，人不守一不活生。 一之为本，万事皆行。 子知一，万事毕矣。 太平经圣君秘旨竟",
      "translated_text": "The countenance and eyes radiate luminosity, the spirit becomes penetratingly clear. The method of guarding the One: one hundred days mark the Lesser Stillness, two hundred days the Middle Stillness, three hundred days the Greater Stillness. Within, joy becomes constant, and the Three Corpses fall away.\n\nThe method of guarding the One comprises three hundred and sixty-six numerical cycles. Each number holds one essence, each essence holds one spirit. When the work of guarding the One is accomplished, this spirit may be beheld.\n\nThe method of guarding the One includes the Five Inner Governances. If the mind wanders outward, the inner governances are lost. If guarding the One is done poorly, inner rebellion meets outer restraint, turning the One into an adversary.\n\nThe method of guarding the One is ever attended by the Six Controller Spirits, who together deliberate over human transgressions. The method of guarding the One is the master of all spirits, the root of human goodness, the means to dispel misfortune, and the gateway to attaining blessings.\n\nOne who guards the One is the master of the divine vessel. From the One Spirit, accumulation extends to the myriad spirits; when all share the same vessel, the Dao is attained. The method of guarding the One: if within there is great rebellion and disorder, the Five Palaces fall into discord and the Six Treasuries lose their guardianship. The host of spirits, alarmed and agitated, all depart to report at the Hall of Light. This is first revealed in the countenance and complexion, known to Heaven and Earth alike. When the host of spirits departs, the form is doomed to die.\n\nThe method of guarding the One: in doing good, the effects may be witnessed. Today, in doing good and maintaining purity, the divine luminosity gradually brightens. At first like the glow of fireflies, in time it resembles lightning’s flash.\n\nThe method of guarding the One: outwardly, merit lies in practicing benevolence and bestowing kindness, without seeking repayment; loyalty and filial piety are likewise. The method of guarding the One brings a hundred blessings and a hundred misfortunes. If what is guarded is not single-minded, and external affairs are manifold, the hundred spirits contend in rivalry, victory and defeat intertwined.\n\nThe method of guarding the One: within, the spirit is ever concentrated, cherished like an infant. How then would the hundred misfortunes dare to encroach? The method of guarding the One is one with the gods and numina of Heaven and Earth. Emerging from yin and entering yang, there is nothing it does not penetrate.\n\nThe method of guarding the One: first know the will of Heaven. It engenders and transforms the myriad things, governs without speech, accomplishes without dominion—thus the Dao gives birth to enduring vision. The method of guarding the One enables knowledge of the ten thousand threads. Yet the ten thousand threads cannot know the One.\n\nOne who guards the One may transcend the world, dispel calamities, serve a lord, avoid death, govern a household, commune with the divine, escape poverty, heal illness, attain longevity, and achieve enduring vision. It is the origin of primordial qi, the pivot of the myriad things.\n\nHeaven, failing to guard the One, loses its clarity; Earth, failing to guard the One, loses its tranquility; the sun, failing to guard the One, loses its brightness; the moon, failing to guard the One, loses its essence; the stars, failing to guard the One, lose their courses; mountains, failing to guard the One, cannot avoid collapse; waters, failing to guard the One, give rise to dust; spirits, failing to guard the One, cannot come into being; humans, failing to guard the One, cannot live.\n\nThe One is the root; all affairs proceed from it. Know the One, and the ten thousand affairs are complete.\n\nHere end the secret instructions of the Sagely Lord of the *Scripture of Great Peace*.",
      "overlap_context": " differ in measure. Each follows their nature, and the One will be encountered.\n\nThe method of guarding the One: be content in poverty, delight in lowliness, and seek within. The One will appear, and you will know that neither high nor low matters.\n\nThe method of guarding the One: moderation in eating is the root. The true spirit favors purity; foulness and filth cloud the qi.\n\nThe method of guarding the One: silently contemplate its essentials. Circulate without end, without beginning or trace.",
      "start_char": 1306,
      "end_char": 1945,
      "start_sentence": 72,
      "end_sentence": 104,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.152459859848022,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\太平经圣君秘旨.txt",
        "category": "正统道藏太平部"
      }
    }
  ]
}