{
  "source_id": "太微帝君二十四神回元经",
  "source_file": "chunked_daozang\\太微帝君二十四神回元经.json",
  "total_chunks": 3,
  "total_original_chars": 2534,
  "total_translated_chars": 15171,
  "total_translation_time": 70.59863066673279,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏续道藏\\太微帝君二十四神回元经.txt",
    "category": "正统道藏续道藏"
  },
  "full_translation": "**The Scripture of the Twenty-Four Spirits of the Supreme Microcosmic Emperor Returning to the Origin**\n\n**Scripture Title:** *The Scripture of the Twenty-Four Spirits of the Supreme Microcosmic Emperor Returning to the Origin*. Author unknown, approximately dating to the Northern and Southern Dynasties. Originally a chapter within *The Upper Scripture of the Grotto Chamber*, later separated into an independent scroll. Source text: *The Wanli Continuation of the Daoist Canon*. Also found in the *Seven Lots from the Bookcase of the Clouds*.\n\n---\n\nThe Supreme Microcosmic Emperor was shaped by the Great One, an inner spirit of the Purple Origin, and the Twenty-Four Perfected Ones, born from the transformation of primordial qi. They govern the essence of the highest immortals, dissolving the knots of the womb and releasing the stagnation of the Pass of Origin. Through the command of the Twenty-Four Spirits, one attains liberation.\n\nThose who cultivate and visualize their names shall govern and stabilize the entire body, preserving the primordial essence. To dissolve the knots of the joints, one must first invoke them, thereby opening the passes.\n\nThese numinous beings are the mysterious origin of knotted qi and the true spirits that form the body. They traverse the Dao amidst clouds and mist, girded by the smoke of life, summoning jade chariots and dragon steeds, arrayed in the thousands, ascending as one body into heaven in broad daylight. This is the Way of the Supreme Perfected Ones—the Twenty-Four Spirits, the mysterious origin of the Emperor of the Primordial Qi of Highest Clarity—riding the swift winds and sudden gusts.\n\nOne must always calm the body and still the mind, aligning the qi with serene conduct. Closing the eyes to gaze inward, forgetting the body to contemplate the spirits, burning incense and purifying oneself, one visualizes the spirits and guards the true. As if entering thrice into the radiant mist of the mysterious flower, after eighteen years of practice, the Supreme One commands the Supreme Microcosmic Emperor, the Five Spirits of the Great One, and the Transformative Spirit of the Primordial Chaos Dao Lord to descend with the Twenty-Four Perfected Ones, a thousand chariots and ten thousand riders, galloping on the wind and seizing the clouds, inhaling and ascending to heaven in broad daylight.\n\nThe Way of visualizing the spirits requires avoiding improper associations, retreating into seclusion, holding fast to essence and treading the void. With the mind contemplating and the eyes visualizing, guarding the subtle and the tranquil, calming the hun and settling the form, then the myriad harms shall not wound, the hundred ghosts shall flee, the thousand demons shall not arise, disasters shall disperse, and misfortunes vanish. Blessings and felicity shall be beyond measure.\n\nFirst, knock the teeth twenty-four times, then visualize:\n\nThe spirit of the brain is named *Mingjue Yuanzi*, styled *Daodu*, one cun and one fen in height, of pure white color.\nThe spirit of the hair is named *Xuanwen Hua*, styled *Daoheng*, two cun and two fen in height, of dark color.\nThe spirit of the skin is named *Tongzhong Zhong*, styled *Daolian*, one cun and five fen in height, of yellow color.\nThe spirit of the eyes is named *Xujian Sheng*, styled *Daotong*, three cun and six fen in height, clad in five colors.\nThe spirit of the neck marrow is named *Lingmo Gai*, styled *Daozhou*, five cun in height, of white color, dressed in plain white.\nThe spirit of the spine is named *Yili Fu*, styled *Daozhu*, three cun and a half in height, clad in white jade and plain white.\nThe spirit of the nose is named *Chonglong Yu*, styled *Daowei*, two cun and five fen in height, dressed in blue, white, and yellow.\nThe spirit of the tongue is named *Shiliang Zhi*, styled *Daoqi*, seven cun in height, of pure red color.\n\nThese are the names of the Eight Luminous Spirit Youths of the upper part of the body. First visualize them as if they were infants, resembling their forms within the body, each resting in their proper place. When finished, knock the teeth eight times, swallow saliva eight times, and softly recite the incantation:\n\n*The Eight Spirits of the Upper Realm, united within the body,\nThe Emperor and the Mysterious Mother, the Five Spirits arrayed,\nLifting the form to vanish and transform, flowing and changing to attain the true,\nA thousand chariots and ten thousand riders, all ascend to the imperial court,\nThe White Origin and the Non-Ultime, the Dao nourishes the Supreme Guest,\nThe Eight Numinous Ones guard the body, jade flowers hold the mist,\nIn the tenfold indistinct, they pass straight through the Gate of the Sun.*\n\nAt the beginning of visualization, first call the names of the spirits thrice, then recite the incantation, and call their names thrice again, letting the sound issue from the mouth. The three sections are the same in this regard.\n\nAt dawn, noon, and midnight, constantly visualize the Twenty-Four Spirits in sequence, invoking them as described above.\n\nThe *Scripture of the Precious Divine Brightness* states: The method of knocking the teeth—left against left is called *Striking the Heavenly Bell*; right against right is called *Beating the Heavenly Chime*; the upper and lower center teeth striking each other is called *Drumming the Heavenly Drum*.\n\nIf suddenly encountering inauspicious omens, strike the Heavenly Bell thirty times. When traversing mountains, to repel evil and invoke the might of the spirits, beat the Heavenly Chime. When visualizing and contemplating the Dao to summon the true and attract the numinous, drum the Heavenly Drum. Though the act of knocking the teeth is singular, in truth, it involves left, right, upper, and lower.\n\nThus, evil fears the sound of the Heavenly Bell, mountain spirits tremble at the movement of the Heavenly Chime, and the summoning of spirits is solemnized by the resonance of the Heavenly Drum. The mysterious and the azure possess their nodes; subtle and internal resonance cannot be sought in a single vessel nor achieved by mere coincidence. The myriad affairs and thousand matters should all be thus—expounding the Way of knocking the teeth, the sounds of the bell and drum are distinct.\n\nTherefore, the methods of the Dao must not be deviated from or confused; the protective rites must not be disordered. Deviation and confusion lead to the failure of obscurity; disorder brings the calamity of clamor and ruin. It is not that the unseen lacks coherence, but that practicing the unseen without order renders the Dao unachievable and affairs unverifiable. Truly, this arises from failing to attain the path of seeking the true. Treading the path of caution and restraint, one’s name shall be faulted by the vulgar world.\n\nStriking the Heavenly Bell thirty times refers to performing this alone to dispel inauspiciousness without other invocations. If following a specific method, knock the teeth according to its prescribed number, not necessarily thirty times.\n\nThe spirit of the throat is named *Bailiu Fang*, styled *Daotong*, eight cun and eight fen in height, clad in nine colors.\nThe spirit of the lungs is named *Suling Sheng*, styled *Daoping*, eight cun and one fen in height, of pure white.\nThe spirit of the heart is named *Huanyang Chang*, styled *Daoming*, nine cun in height, of red color.\nThe spirit of the liver is named *Kaijun Tong*, styled *Daoqing*, six cun in height, of blue and yellow color.\nThe spirit of the gallbladder is named *Longde Ju*, styled *Daofang*, two cun and six fen in height, of blue, yellow, and green color.\n\nThe spirit of the left kidney is named *Chunyuan Zhen*, styled *Daoqing*, three cun and seven fen in height, its colors shifting ceaselessly among white, red, blue, and the five hues. The spirit of the right kidney is named *Xiangdi Wu*, styled *Daosheng*, three cun and five fen in height, of white or black color. The spirit of the spleen is named *Baoyuan Quan*, styled *Daoqian*, seven cun and three fen in height, of pure yellow.\n\nWithin the central region of the body dwell the Eight Radiant Spirit Youths, whose names are to be visualized in sequence, each resembling an infant in form, faintly present within the body, each resting in its proper place. When this is complete, knock the teeth eight times, swallow saliva eight times, and recite the incantation:\n\n*\"The Eight Central Spirits, fourfold transformed and ninefold soaring,\nRefine the hun-soul and rectify the body,\nBright radiance shares its splendor.\nThe Imperial Lord unties the knots,\nThe embryo refines and returns fourfold.\nAbove, it connects with the Mysterious Mother,\nDisperses numinous power and strides in majesty.\nAttaining union with the Eight Spirits,\nTogether we ascend the shared threshold,\nA thousand chariots and ten thousand riders,\nRising to the Grand Tenuity.\"*\n\nThe spirit of the stomach is named *Tonglai Yu*, styled *Daozhan*, seven cun in height, of yellow color. The spirit within the hollow intestines is named *Zhaoteng Kang*, styled *Daohuan*, two cun and four fen in height, of yellow-red color. The spirit within the large and small intestines is named *Pengsong Liu*, styled *Daochu*, two cun and one fen in height, of red-yellow color. The spirit within the torso is named *Shouhou Bo*, styled *Daoxu*, nine cun and one fen in height, clad in nine colors. The spirit of the chest and diaphragm is named *Guangying Zhai*, styled *Daozhong*, five cun in height, of white color. The spirits of the two flanks are named *Pixia Ma*, styled *Daocheng*, four cun and one fen in height, of red-white color.\n\nThe spirit of the left yin and left yang is named *Fuliu Qi*, styled *Daogui*, two cun and three fen in height, of blue, yellow, and white color; in men, it is visualized as the left yang, in women as the left yin. The spirit of the right yin and right yang is named *Baobiao Ming*, styled *Daosheng*, two cun and three fen in height, of blue, yellow, and white color; in men, it is visualized as the right yang, in women as the right yin.\n\nWithin the lower region of the body dwell the Eight Radiant Spirit Youths, whose names are to be visualized afterward, each resembling an infant in form, faintly present within the body, each resting in its proper place. When this is complete, knock the teeth eight times, swallow saliva eight times, and softly recite the incantation:\n\n*\"The Eight Lower Spirits, dispersed in ninefold numinous form,\nPurple mist arises thickly,\nEmbracing the Origin and guarding essence.\nThe Great One, Primordial Father,\nThe Imperial Lord engenders life.\nThe Seven Clarities are freed from the register,\nThe Controller of Destiny records life.\nHun and po are at peace,\nThe Five Flowers nurture brightness.\nA thousand chariots and ten thousand riders,\nJoin me in unity,\nFirst to create the Grand Simplicity,\nBowing northward to the Highest Clarity.\"*\n\nThe singular inner spirit of the Dao is named *Daiwuma*, styled *Daojisheng*, one cun and two fen in height, of purple color; in men, it is visualized as the *Inner Spirit of the Dao*, in women as the *Central Numinous Spirit of the True Origin.*\n\nThis is the profound spirit guarding the utmost root, the supreme numen above the center. Next, visualize it in the form of an infant, seated serenely in its place.\n\nHaving completed this, knock the teeth twenty-four times and swallow saliva twenty-four times, then softly recite the incantation:\n\n*\"The Mysterious Inner Perfected of the Upper Realm,\nNurtures form and attends the dawn,\nMastering the knots and grasping the net,\nNine revolutions and eight cycles,\nThe Dipper’s stars shine within,\nPalaces and chambers arrayed ninefold,\nThe Imperial Lord unites in flourishing,\nNine Ways and seven swallows,\nEssence flows forth and inner essence emerges,\nHarmonizing and bathing the host of spirits,\nThe Five Viscera bloom with radiance,\nReversing age to regain youthful countenance,\nA thousand chariots and ten thousand riders,\nAscend with me to heaven,\nTo attend the Grand Threshold above,\nAnd bow deeply to the Jade Dawn.\"*\n\nThis is the precious name of the inner self, the spirit of transformation and life. Without knowing this name, the Dao of immortality cannot be achieved. If, on the day of untying the knots, one does not first invoke this, the knots will not be undone. If the knots remain unloosed, the Three Hun will surely lose their harmony, the Upper Prime’s inner essence will be lost, the Five Elders will lose their clarity, and the Imperial Lord will grow distant.\n\nFor men, visualize this as the spirit of a youth; for women, as the spirit of a maiden—both share the same name. To visualize the twenty-four spirits, at midnight, lie flat without a pillow, clench the fists and relax the body, regulate the breath to a gentle rhythm, and meditate upon the body’s spirits, focusing the mind on the Imperial Lord, imagining him seated in his place. Close the eyes and inwardly behold him. If any are incomplete, burn incense, sit upright with eyes closed, clench the fists upon the knees, and with concentrated intent, visualize the host of spirits, reciting the invocation as prescribed.\n\nAt dawn and noon, perform the visualization while seated upright, ensuring no one witnesses it. Always visualize inwardly, closing the eyes to meditate. On the first day of the lunar month at midnight, after visualizing the spirits, further visualize within the eyes a white *qi*, the size of a chicken’s egg, suspended before the face. Soon it transforms into two luminous mirrors, nine inches in diameter, which reflect the twenty-four spirits upon the body, illuminating them with perfect clarity. After a long while, recite the heartfelt invocation:\n\n*\"Great Luminous Precious Mirrors,\nScatter forms and disperse blossoms,\nIllumine the primordial spirit,\nSubdue the myriad demons,\nSoar to the Upper Clarity,\nPart the clouds and veil of mist,\nCommand a thousand spirits,\nSeal mountains and summon rivers.\"*\n\nConclude. Perform this once every five days—this is what is meant by \"reviewing the inner essence and inspecting the Five Spirits.\" By practicing this regularly, no calamities will arise, and one will ascend to the rank of lofty immortal.\n\nThe method of the *Fulu* youth, enabling clear vision of the Imperial Lord and the Five Spirits: On the *gengwu* day of the *jiazi* decade, at noon, take one *sheng* of pure water, add one *zhu* of true cinnabar, and stir it three to five times counterclockwise while reciting:\n\n*\"Crimson essence of the Mysterious Flow,\nRadiance enters clarity,\nThe host of body spirits,\nAll come to appear in procession,\nPiercing vision for ten thousand *li*,\nPenetrating the Nine Numinous,\nThe Imperial Lord illumines the youth,\nEnabling my ascent to the Upper Clarity.\"*\n\nAfter reciting, face east and wash the eyes fourteen times. Those who practice this regularly will gain piercing vision of the myriad spirits. The incantation should be whispered, and when washing the eyes with the water, face the lunar mansion of the month—not always east.\n\n*The Scripture of the Twenty-Four Spirits of the Highest Clarity’s Imperial Lord of the Grand Tenuity, Returning to the Origin* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太微帝君二十四神回元经 经名：太微帝君二十四神回元经。 撰人不详，约出朴南北期。 原系《洞房上经》中一篇，后分出另为一卷。 底本出处：《万历续道藏》。 又见矜《云笈七签》。 #1 太微帝君二十四神回元经 太微帝君，太一造形，紫元内神，二十四真人，混气变生，主仙上精，散解胞结，释滞关元。 二十四神所命，乃得除脱也。 兆能修存名字者，则治镇一身，保守元精。 欲解节结之法，当先祝之，乃得开关耳。 此灵并是结气之玄宗，成体之真神，运道云雾，带生烟塭，能致玉辇龙骑，千万列行，同与一体，白日登天。 此太上真人二十四神存玄元帝君上清乘飙欻之道也。 常当安身静心，正气夷行，闭目内视，忘体念神，烧香盥练，存神守真，仿髴三入蔼晖玄英。 行之十八年，太上命太微帝君太一五神，化生混灵道君，从二十四真人，千乘万骑，骋风摄云，呼吸流升，白日造天。 存神之道，勿交非类，深室避事，柄精蹑空，心存目想，微妙守冲，静魂安形，则万害不伤，百鬼避窜，千妖不行，消灾散祸，福庆不可胜纪。 先叩齿二十四通毕，乃存思： 脑神明觉元子，字道都，形长一寸一分，色正白。 发神名玄文华，字道衡，形长二寸二分，色玄。 皮肤神名通众仲，字道连，形长一寸五分，色黄。 目神名虚监生，字道童，形长三寸六分，衣五色。 项髓神名灵谟盖，字道周，形长五寸，色白，素衣。 膂神名益历辅，字道柱，形长三寸半，白玉素衣。 鼻神名冲龙玉，字道微，形长二寸五分，青白黄色衣。 舌神名始梁峙，字道岐，形长七寸，正赤色。 右一身上部八景神童名字。 先存之，并如婴儿之形，仿髴在身，各安其所。 讫，乃〔叩〕齿八通，咽液八过，而微祝曰： 上景八神，一合入身，帝君玄母，五神各陈，举形遁化，流变适真，千乘万骑，俱升帝宸，白元无英，道养太宾，八灵翼体，玉华衔烟，恍惚十周，径造日门。 初存思之始，先三呼神名字，祝讫，又三呼神名字，令声则出口，三部同尔。 平旦、日中、夜半三时，恒存二十四神，以次念之，祝呼如上法。 高上宝神明科经说曰：叩齿之法，左左相叩，名曰扣天钟。 右右相叩，名曰搥天盘。 中央上下相对相叩，名曰呜天鼓。 若卒遇凶恶不祥，当叩天钟三十过。 若经山，辟邪威神大祝，当搥天磬。 若存思念道，致真招灵，当呜天鼓。 叩齿虽一，其实有左右上下也。 故凶恶而畏天钟之响，山神而慑天磬之动，招神而肃天鼓之震矣。 玄青有节，希微内感，不可以一盘而求，不可以偶然而合也。 千章万事，皆当如此，叩齿之道演矣，钟鼓之音别矣。 是以道数不可乖错，法卫不可杂乱，乖错则有暗昧之败，杂乱则有嚣毁之祸，非冥冥之无贯也，行冥贯之无序，则道之不可成，事之不可验，良由求真之途不得也。 履迹踧之造而名愆于世俗矣。 扣天钟三十过，谓无他祝，孤行此以除不祥耳。 若有所案行，随本法叩齿之多少，不必须扣三十过也。 喉神名百流放，字道通，形长八寸八分，九色衣。 肺神名素灵生，字道平，形长八寸一分，纯白。 心神名焕阳昌，字道明，形长九寸，色赤。 肝神名开君童，子道青，形长六寸，色青黄。 胆神名龙德拘，字道放，形长二寸六分，色青黄绿。",
      "translated_text": "**The Scripture of the Twenty-Four Spirits of the Supreme Microcosmic Emperor Returning to the Origin**\n\n**Scripture Title:** *The Scripture of the Twenty-Four Spirits of the Supreme Microcosmic Emperor Returning to the Origin*. Author unknown, approximately dating to the Northern and Southern Dynasties. Originally a chapter within *The Upper Scripture of the Grotto Chamber*, later separated into an independent scroll. Source text: *The Wanli Continuation of the Daoist Canon*. Also found in the *Seven Lots from the Bookcase of the Clouds*.\n\n---\n\nThe Supreme Microcosmic Emperor was shaped by the Great One, an inner spirit of the Purple Origin, and the Twenty-Four Perfected Ones, born from the transformation of primordial qi. They govern the essence of the highest immortals, dissolving the knots of the womb and releasing the stagnation of the Pass of Origin. Through the command of the Twenty-Four Spirits, one attains liberation.\n\nThose who cultivate and visualize their names shall govern and stabilize the entire body, preserving the primordial essence. To dissolve the knots of the joints, one must first invoke them, thereby opening the passes.\n\nThese numinous beings are the mysterious origin of knotted qi and the true spirits that form the body. They traverse the Dao amidst clouds and mist, girded by the smoke of life, summoning jade chariots and dragon steeds, arrayed in the thousands, ascending as one body into heaven in broad daylight. This is the Way of the Supreme Perfected Ones—the Twenty-Four Spirits, the mysterious origin of the Emperor of the Primordial Qi of Highest Clarity—riding the swift winds and sudden gusts.\n\nOne must always calm the body and still the mind, aligning the qi with serene conduct. Closing the eyes to gaze inward, forgetting the body to contemplate the spirits, burning incense and purifying oneself, one visualizes the spirits and guards the true. As if entering thrice into the radiant mist of the mysterious flower, after eighteen years of practice, the Supreme One commands the Supreme Microcosmic Emperor, the Five Spirits of the Great One, and the Transformative Spirit of the Primordial Chaos Dao Lord to descend with the Twenty-Four Perfected Ones, a thousand chariots and ten thousand riders, galloping on the wind and seizing the clouds, inhaling and ascending to heaven in broad daylight.\n\nThe Way of visualizing the spirits requires avoiding improper associations, retreating into seclusion, holding fast to essence and treading the void. With the mind contemplating and the eyes visualizing, guarding the subtle and the tranquil, calming the hun and settling the form, then the myriad harms shall not wound, the hundred ghosts shall flee, the thousand demons shall not arise, disasters shall disperse, and misfortunes vanish. Blessings and felicity shall be beyond measure.\n\nFirst, knock the teeth twenty-four times, then visualize:\n\nThe spirit of the brain is named *Mingjue Yuanzi*, styled *Daodu*, one cun and one fen in height, of pure white color.\nThe spirit of the hair is named *Xuanwen Hua*, styled *Daoheng*, two cun and two fen in height, of dark color.\nThe spirit of the skin is named *Tongzhong Zhong*, styled *Daolian*, one cun and five fen in height, of yellow color.\nThe spirit of the eyes is named *Xujian Sheng*, styled *Daotong*, three cun and six fen in height, clad in five colors.\nThe spirit of the neck marrow is named *Lingmo Gai*, styled *Daozhou*, five cun in height, of white color, dressed in plain white.\nThe spirit of the spine is named *Yili Fu*, styled *Daozhu*, three cun and a half in height, clad in white jade and plain white.\nThe spirit of the nose is named *Chonglong Yu*, styled *Daowei*, two cun and five fen in height, dressed in blue, white, and yellow.\nThe spirit of the tongue is named *Shiliang Zhi*, styled *Daoqi*, seven cun in height, of pure red color.\n\nThese are the names of the Eight Luminous Spirit Youths of the upper part of the body. First visualize them as if they were infants, resembling their forms within the body, each resting in their proper place. When finished, knock the teeth eight times, swallow saliva eight times, and softly recite the incantation:\n\n*The Eight Spirits of the Upper Realm, united within the body,\nThe Emperor and the Mysterious Mother, the Five Spirits arrayed,\nLifting the form to vanish and transform, flowing and changing to attain the true,\nA thousand chariots and ten thousand riders, all ascend to the imperial court,\nThe White Origin and the Non-Ultime, the Dao nourishes the Supreme Guest,\nThe Eight Numinous Ones guard the body, jade flowers hold the mist,\nIn the tenfold indistinct, they pass straight through the Gate of the Sun.*\n\nAt the beginning of visualization, first call the names of the spirits thrice, then recite the incantation, and call their names thrice again, letting the sound issue from the mouth. The three sections are the same in this regard.\n\nAt dawn, noon, and midnight, constantly visualize the Twenty-Four Spirits in sequence, invoking them as described above.\n\nThe *Scripture of the Precious Divine Brightness* states: The method of knocking the teeth—left against left is called *Striking the Heavenly Bell*; right against right is called *Beating the Heavenly Chime*; the upper and lower center teeth striking each other is called *Drumming the Heavenly Drum*.\n\nIf suddenly encountering inauspicious omens, strike the Heavenly Bell thirty times. When traversing mountains, to repel evil and invoke the might of the spirits, beat the Heavenly Chime. When visualizing and contemplating the Dao to summon the true and attract the numinous, drum the Heavenly Drum. Though the act of knocking the teeth is singular, in truth, it involves left, right, upper, and lower.\n\nThus, evil fears the sound of the Heavenly Bell, mountain spirits tremble at the movement of the Heavenly Chime, and the summoning of spirits is solemnized by the resonance of the Heavenly Drum. The mysterious and the azure possess their nodes; subtle and internal resonance cannot be sought in a single vessel nor achieved by mere coincidence. The myriad affairs and thousand matters should all be thus—expounding the Way of knocking the teeth, the sounds of the bell and drum are distinct.\n\nTherefore, the methods of the Dao must not be deviated from or confused; the protective rites must not be disordered. Deviation and confusion lead to the failure of obscurity; disorder brings the calamity of clamor and ruin. It is not that the unseen lacks coherence, but that practicing the unseen without order renders the Dao unachievable and affairs unverifiable. Truly, this arises from failing to attain the path of seeking the true. Treading the path of caution and restraint, one’s name shall be faulted by the vulgar world.\n\nStriking the Heavenly Bell thirty times refers to performing this alone to dispel inauspiciousness without other invocations. If following a specific method, knock the teeth according to its prescribed number, not necessarily thirty times.\n\nThe spirit of the throat is named *Bailiu Fang*, styled *Daotong*, eight cun and eight fen in height, clad in nine colors.\nThe spirit of the lungs is named *Suling Sheng*, styled *Daoping*, eight cun and one fen in height, of pure white.\nThe spirit of the heart is named *Huanyang Chang*, styled *Daoming*, nine cun in height, of red color.\nThe spirit of the liver is named *Kaijun Tong*, styled *Daoqing*, six cun in height, of blue and yellow color.\nThe spirit of the gallbladder is named *Longde Ju*, styled *Daofang*, two cun and six fen in height, of blue, yellow, and green color.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1253,
      "start_sentence": 0,
      "end_sentence": 50,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.48391652107239,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\太微帝君二十四神回元经.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "左肾神名春元真，字道卿，形长三寸七分，数变白赤青五色无常。 右肾神名象地无，字道生，形长三寸五分，色白或黑。 脾神名宝元全，字道骞，形长七寸三分，色正黄。 右一身中部八景神童名字，次存之，并如婴儿之形，仿髴在身，各安其所。 讫，叩齿八通，咽液八过，而为咒曰： 中景八神，四变九飞，练魂正身，明景同晖，帝君解结，胎练四归，上通玄母，散灵步威，得与八神，合辇齐扉，千乘万骑，上登太微。 胃神名同来育，字道展，形长七寸，色黄。 穷肠中神名兆滕康，字道还，形长二寸四分，黄赤色。 大小肠中神名蓬送留，字道厨，形长二寸一分，色赤黄。 胴中神名受厚勃，字道虚，形长九寸一分，九色衣。 胸膈神名广瑛宅，字道仲，形长五寸，色白。 两胁神名辟瑕马，字道成，形长四寸一分，赤白色。 左阴左阳神名扶流起，字道圭，形长二寸三分，青黄白色，在男存为左阳，在女存为左阴。 右阴右阳神名苞表明，字道生，形长二寸三分，青黄白色，在男存为右阳，在女存为右阴。 右一身下部八景神童名字，后存之，并如婴儿之形，仿髴在身，各安其所。 讫，乃叩齿八通，咽液八过，而微祝曰： 下景八神，散形九灵，紫烟郁生，含元守精，太一元父，帝君挺生，七爽免籍，司命记生，魂魄以安，五华育明，千乘万骑，与我同并，先造太素，北揖上清。 道一内神，名逮无马，字道极生，形长一寸二分，紫色，男存曰道一内神，女存曰真元中灵。 右一神极根之幽神，守中之上灵也。 次有存之，如婴儿之状，安坐其所。",
      "translated_text": "The spirit of the left kidney is named *Chunyuan Zhen*, styled *Daoqing*, three cun and seven fen in height, its colors shifting ceaselessly among white, red, blue, and the five hues. The spirit of the right kidney is named *Xiangdi Wu*, styled *Daosheng*, three cun and five fen in height, of white or black color. The spirit of the spleen is named *Baoyuan Quan*, styled *Daoqian*, seven cun and three fen in height, of pure yellow.\n\nWithin the central region of the body dwell the Eight Radiant Spirit Youths, whose names are to be visualized in sequence, each resembling an infant in form, faintly present within the body, each resting in its proper place. When this is complete, knock the teeth eight times, swallow saliva eight times, and recite the incantation:\n\n*\"The Eight Central Spirits, fourfold transformed and ninefold soaring,\nRefine the hun-soul and rectify the body,\nBright radiance shares its splendor.\nThe Imperial Lord unties the knots,\nThe embryo refines and returns fourfold.\nAbove, it connects with the Mysterious Mother,\nDisperses numinous power and strides in majesty.\nAttaining union with the Eight Spirits,\nTogether we ascend the shared threshold,\nA thousand chariots and ten thousand riders,\nRising to the Grand Tenuity.\"*\n\nThe spirit of the stomach is named *Tonglai Yu*, styled *Daozhan*, seven cun in height, of yellow color. The spirit within the hollow intestines is named *Zhaoteng Kang*, styled *Daohuan*, two cun and four fen in height, of yellow-red color. The spirit within the large and small intestines is named *Pengsong Liu*, styled *Daochu*, two cun and one fen in height, of red-yellow color. The spirit within the torso is named *Shouhou Bo*, styled *Daoxu*, nine cun and one fen in height, clad in nine colors. The spirit of the chest and diaphragm is named *Guangying Zhai*, styled *Daozhong*, five cun in height, of white color. The spirits of the two flanks are named *Pixia Ma*, styled *Daocheng*, four cun and one fen in height, of red-white color.\n\nThe spirit of the left yin and left yang is named *Fuliu Qi*, styled *Daogui*, two cun and three fen in height, of blue, yellow, and white color; in men, it is visualized as the left yang, in women as the left yin. The spirit of the right yin and right yang is named *Baobiao Ming*, styled *Daosheng*, two cun and three fen in height, of blue, yellow, and white color; in men, it is visualized as the right yang, in women as the right yin.\n\nWithin the lower region of the body dwell the Eight Radiant Spirit Youths, whose names are to be visualized afterward, each resembling an infant in form, faintly present within the body, each resting in its proper place. When this is complete, knock the teeth eight times, swallow saliva eight times, and softly recite the incantation:\n\n*\"The Eight Lower Spirits, dispersed in ninefold numinous form,\nPurple mist arises thickly,\nEmbracing the Origin and guarding essence.\nThe Great One, Primordial Father,\nThe Imperial Lord engenders life.\nThe Seven Clarities are freed from the register,\nThe Controller of Destiny records life.\nHun and po are at peace,\nThe Five Flowers nurture brightness.\nA thousand chariots and ten thousand riders,\nJoin me in unity,\nFirst to create the Grand Simplicity,\nBowing northward to the Highest Clarity.\"*\n\nThe singular inner spirit of the Dao is named *Daiwuma*, styled *Daojisheng*, one cun and two fen in height, of purple color; in men, it is visualized as the *Inner Spirit of the Dao*, in women as the *Central Numinous Spirit of the True Origin.*\n\nThis is the profound spirit guarding the utmost root, the supreme numen above the center. Next, visualize it in the form of an infant, seated serenely in its place.",
      "overlap_context": " fen in height, clad in nine colors.\nThe spirit of the lungs is named *Suling Sheng*, styled *Daoping*, eight cun and one fen in height, of pure white.\nThe spirit of the heart is named *Huanyang Chang*, styled *Daoming*, nine cun in height, of red color.\nThe spirit of the liver is named *Kaijun Tong*, styled *Daoqing*, six cun in height, of blue and yellow color.\nThe spirit of the gallbladder is named *Longde Ju*, styled *Daofang*, two cun and six fen in height, of blue, yellow, and green color.",
      "start_char": 1253,
      "end_char": 1876,
      "start_sentence": 51,
      "end_sentence": 70,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.82313299179077,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\太微帝君二十四神回元经.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "讫，乃叩齿二十四通，咽液二十四过，而微咒曰： 玄上内真，养形侍晨，总纽摄纲，九度八旋，斗星内朗，宫馆九陈，帝君合昌，九道七咽，出液内精，和灌众神，五藏生华，反老童颜，千乘万骑，与我升天，上朝太陛，高揖玉晨。 右一身宝名内字，化生之精神也。 不知此名，则仙道不成矣。 若解结之日，不先祝此者，则结节不解也。 结节不解，必三魂失适，上元内丧，五老失明，帝君乖踈也。 男存为童子之神，女存为女子之神，俱同一名字也。 存二十四神，当以夜半去枕平卧，握固放体，气调而微，存思其身神，安念帝君，令仿髴居位，闭目内视之。 如有不具，便当烧香，平坐闭目，握固两膝上，精存众神，祝行如法。 其平旦、日中时存神，自平坐而行之，勿令有见之者矣。 皆内视，临闭目而存也。 月一日夜半，存神讫，又存两目中有白炁，如鸡子大，在面目前，须臾变成两明镜，径九寸，以前后照我一体上二十四神，使洞鉴分明，良久，乃心祝曰： 大明宝镜，分形散花，鉴朗元神，制却万魔，飞行上清，披云巾罗，役使千灵，封山召河。 毕。 五日一行之，所谓覆校内精，检五神者也。 常能行之。 灾害不生，而位登高仙。 拂童之道，使彻见帝君五神之法：常以甲子之旬，庚午日，日中时，取清水一升，以一铢真丹投水中搅之，左行三五过，祝曰： 玄流朱精，生光入明，身神众列，并来见行，彻视万里，中达九灵，帝君映童，使我上清。 祝毕，束向以洗目二七过。 恒行之者，彻视万神。 祝当微言，以水向月建洗目，不常东向也。 太微帝君二十四神回元经竟 #1本篇文字可参见《上清紫微帝君南极元君玉经宝诀》。",
      "translated_text": "Having completed this, knock the teeth twenty-four times and swallow saliva twenty-four times, then softly recite the incantation:\n\n*\"The Mysterious Inner Perfected of the Upper Realm,\nNurtures form and attends the dawn,\nMastering the knots and grasping the net,\nNine revolutions and eight cycles,\nThe Dipper’s stars shine within,\nPalaces and chambers arrayed ninefold,\nThe Imperial Lord unites in flourishing,\nNine Ways and seven swallows,\nEssence flows forth and inner essence emerges,\nHarmonizing and bathing the host of spirits,\nThe Five Viscera bloom with radiance,\nReversing age to regain youthful countenance,\nA thousand chariots and ten thousand riders,\nAscend with me to heaven,\nTo attend the Grand Threshold above,\nAnd bow deeply to the Jade Dawn.\"*\n\nThis is the precious name of the inner self, the spirit of transformation and life. Without knowing this name, the Dao of immortality cannot be achieved. If, on the day of untying the knots, one does not first invoke this, the knots will not be undone. If the knots remain unloosed, the Three Hun will surely lose their harmony, the Upper Prime’s inner essence will be lost, the Five Elders will lose their clarity, and the Imperial Lord will grow distant.\n\nFor men, visualize this as the spirit of a youth; for women, as the spirit of a maiden—both share the same name. To visualize the twenty-four spirits, at midnight, lie flat without a pillow, clench the fists and relax the body, regulate the breath to a gentle rhythm, and meditate upon the body’s spirits, focusing the mind on the Imperial Lord, imagining him seated in his place. Close the eyes and inwardly behold him. If any are incomplete, burn incense, sit upright with eyes closed, clench the fists upon the knees, and with concentrated intent, visualize the host of spirits, reciting the invocation as prescribed.\n\nAt dawn and noon, perform the visualization while seated upright, ensuring no one witnesses it. Always visualize inwardly, closing the eyes to meditate. On the first day of the lunar month at midnight, after visualizing the spirits, further visualize within the eyes a white *qi*, the size of a chicken’s egg, suspended before the face. Soon it transforms into two luminous mirrors, nine inches in diameter, which reflect the twenty-four spirits upon the body, illuminating them with perfect clarity. After a long while, recite the heartfelt invocation:\n\n*\"Great Luminous Precious Mirrors,\nScatter forms and disperse blossoms,\nIllumine the primordial spirit,\nSubdue the myriad demons,\nSoar to the Upper Clarity,\nPart the clouds and veil of mist,\nCommand a thousand spirits,\nSeal mountains and summon rivers.\"*\n\nConclude. Perform this once every five days—this is what is meant by \"reviewing the inner essence and inspecting the Five Spirits.\" By practicing this regularly, no calamities will arise, and one will ascend to the rank of lofty immortal.\n\nThe method of the *Fulu* youth, enabling clear vision of the Imperial Lord and the Five Spirits: On the *gengwu* day of the *jiazi* decade, at noon, take one *sheng* of pure water, add one *zhu* of true cinnabar, and stir it three to five times counterclockwise while reciting:\n\n*\"Crimson essence of the Mysterious Flow,\nRadiance enters clarity,\nThe host of body spirits,\nAll come to appear in procession,\nPiercing vision for ten thousand *li*,\nPenetrating the Nine Numinous,\nThe Imperial Lord illumines the youth,\nEnabling my ascent to the Upper Clarity.\"*\n\nAfter reciting, face east and wash the eyes fourteen times. Those who practice this regularly will gain piercing vision of the myriad spirits. The incantation should be whispered, and when washing the eyes with the water, face the lunar mansion of the month—not always east.\n\n*The Scripture of the Twenty-Four Spirits of the Highest Clarity’s Imperial Lord of the Grand Tenuity, Returning to the Origin* concludes.",
      "overlap_context": "nity,\nFirst to create the Grand Simplicity,\nBowing northward to the Highest Clarity.\"*\n\nThe singular inner spirit of the Dao is named *Daiwuma*, styled *Daojisheng*, one cun and two fen in height, of purple color; in men, it is visualized as the *Inner Spirit of the Dao*, in women as the *Central Numinous Spirit of the True Origin.*\n\nThis is the profound spirit guarding the utmost root, the supreme numen above the center. Next, visualize it in the form of an infant, seated serenely in its place.",
      "start_char": 1876,
      "end_char": 2542,
      "start_sentence": 71,
      "end_sentence": 94,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.29158115386963,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\太微帝君二十四神回元经.txt",
        "category": "正统道藏续道藏"
      }
    }
  ]
}