{
  "source_id": "太清元极至妙神珠玉颗经",
  "source_file": "chunked_daozang\\太清元极至妙神珠玉颗经.json",
  "total_chunks": 11,
  "total_original_chars": 9458,
  "total_translated_chars": 55456,
  "total_translation_time": 249.69846153259277,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\方法类\\太清元极至妙神珠玉颗经.txt",
    "category": "方法类"
  },
  "full_translation": "*The Supreme Clarity Scripture of the Peerless and Most Wondrous Divine Pearl and Jade Kernel*\n\nThe Dao speaks: The Eight Radiant Flights soar, the Mysterious Void pierces with light, the Divine Pearl and Jade Kernel embody the Great Yin and Great Yang.\n\n*The Record of Heaven’s Opening* states: The Divine Pearl is the essence of the Great Yang; the Jade Kernel is the flower of the moon’s splendor. The morning *hun* governs descent; the evening *po* governs ascent. The morning *hun* is the Yang soul of Heaven; the evening *po* is the Yin spirit of Earth. When the Yin *po* ascends, the Yang *hun* descends, responding to the flying light of the Eight Realms, giving rise to the Four Symbols. All things sprout in bud, aligning with the seasons and harmonizing with time. Their movements accord with transformation, all following the celestial patterns—from Nonbeing to Being, and within Being back to Nonbeing.\n\nThe Flowing Pearl of the Great Yang governs human Yang; the Mysterious Pearl of the Great Yin governs human Yin. When Yin and Yang symbols unite, Earth’s harmony responds, then white metal is bestowed, red snow paired, essence and blood stabilized, and the true embryo formed—only then are male and female conceived. The male corresponds to Heaven’s revered darkness; the female corresponds to Earth’s Supreme Clarity and Peerless Wondrous Darkness. When son and daughter unite in birth, Yin and Yang bow and rise in descent. First, they transform from a single darkness, then function through the Five Phases, only then do the Three Fields align, the Five Qi unfold their pattern, the Four Limbs grow in accord with the Four Seasons, and the Eight Directions settle in step with the Eight Trigrams. The Yin and Yang organs and viscera all mirror Heaven and Earth—how could they not arise from the qi’s seasons? How could they not stand through the workings of creation?\n\nAs for human cultivation, it likewise follows the same path as Heaven and Earth. To refine the Great Elixir and Golden Cinnabar, one must not depart from the creative transformations of Yin and Yang. One must rely on the cyclical applications of the celestial sphere, the revolutions of the *jiazi* cycle, the waxing and waning of the line symbols, the advance and retreat of the fire tally. Yang is born within *fu*, Yin emerges in the midst of *gou*. The *pi* and *tai* are determined at *yin* and *shen*; Qian and Kun advance at *si* and *hai*. Fire increases as water decreases, Yin coils while Yang unfurls. The Nine Returns complete the line symbols of Metal and Wood; the Seven Reversions turn within the images of Water and Fire. The true darkness of sixteen ounces is distributed among the three hundred eighty-four lines. The fire-timing of the Great Elixir, weighing one *jin*, is divided within the sixty-four hexagrams of the *Zhouyi*. One must secure the positions of ruler and minister, the harmony of husband and wife, the hierarchy of host and guest—all following the fire-timing. Inches and ounces, scales and measures, all correspond to the line statements without discrepancy. The fifty-five numbers of Heaven and Earth are arrayed within the furnace; the one hundred divisions of day and night are entirely contained within the crucible.\n\nWithin the water, the White Tiger takes form by responding to the lunar essence; within the fire, the Green Dragon embodies the solar radiance to manifest its image. Refining the elixir requires distinguishing the four seasons; advancing the fire depends entirely on the eight gates. When the qi of the Three Luminaries converges, it simmers into a hundred streams of crimson nectar; before the Twelve-Storied Tower, it forges a pool of white snow. Turning the eight jades along the path of the spinal palace, circulating the single qi upward to the Mud Pill Palace—where the Dark Pearl descends, a purple-golden lotus blooms within the pool; where the Sacred Stone flies forth, ten thousand strands of white jade laughter arise within the crucible. Beneath the Seven-Starred Tower, wind and clouds surge forth, swirling in five colors at the altar’s heart. As water and fire intermingle above and below, revolving with the waxing and waning of the moon, advancing and retreating through *Zhun* and *Meng*—whether at dawn or dusk, the Yang odd-numbered positions of the Qian hexagram advance their lines within the thirty-six; the Yin even-numbered positions of the Kun palace establish their images within the twenty-four. Only then does fire emerge within wood, metal arise within earth, the Black Tortoise exhale the raging winds of the earth, and the Red Phoenix spew the fierce flames of heaven. The Metal Lord embraces the Infant Brother to enter the chamber; the Yellow Dame guides the Maiden Sister to the gate. The celestial revolution is distributed within the four seasons; the fire-timing returns to its origin in the twelve months—place the altar at the rear.\n\nFor yearly practice, circulate the celestial revolution four times a year:\n- On the Spring Equinox, use the *Zhen* hexagram, eighty-one repetitions. In mid-spring, at the hour of *mao*, advance the fire to arouse the Green Yang. The Yang number ends at nine nines; three returns make it efficacious.\n- On the Summer Solstice, use the *Li* hexagram, seventy-two repetitions. At the Summer Solstice, facing south at noon, observe the four-six achievement. The number divides into seventy-two; the joints naturally open.\n- On the Autumn Equinox, use the *Dui* hexagram, ninety-nine repetitions. At the Autumn Equinox, stationed in the *you* position, face west to emit divine radiance. Ninety plus nine makes the number; three returns make the qi flourish.\n- On the Winter Solstice, use the *Kan* hexagram, one hundred eight repetitions. At the Winter Solstice, as Yang is born at *zi*, practice facing north. The number completes one hundred eight; four nines may be contemplated in detail.\n\nThe method for practice:\nChoose a prosperous and flourishing place, and sit according to the time.\n- On the Spring Equinox at the hour of *mao*, face east and sit gazing at the sun.\n- On the Summer Solstice at the hour of *wu*, face south and sit gazing at the sun.\n- On the Autumn Equinox at the hour of *you*, face west and sit gazing at the moon. If it is not visible, visualize it as if seeing its true form.\n- On the Winter Solstice, use the *Kan* hexagram at the hour of *zi*, face north, and sit gazing at the moon.\n\nFollowing the above method, clench the fists and concentrate the spirit. Still the thoughts, knock the teeth thirty-six times, and beat the Heavenly Drum twenty-four times. By day, gaze at the sun; by night, gaze at the moon and recite the incantation.\n- **Incantation for the Sun:**\n  *\"The sun’s flowing essence comes to protect my body. My embryo is already numinous, uniting with its true nature. Hasten, as the law commands!\"*\n- **Incantation for the Moon:**\n  *\"The moon’s aiding essence makes my embryo numinous. It settles my *po* and *hun*, forever gathering the supreme spirit. Hasten, as the law commands!\"*\n\nWith each recitation, draw in one breath, then inhale and hold it, counting the breath’s duration. When the breath is full, swallow three times. Recite the incantation three times, taking three breaths, each following the above method. Then, rub the hands together and warm the cinnabar field before stopping. This completes one session.\n\nFor monthly practice, circulate the celestial revolution once a month.\n\nThe moon is the earth’s *po*, the essence of the Supreme Yin’s water. Below, it occupies a humble position, belonging to *Kun* and *Xun*. It reigns in winter and wanes in summer, its days short and nights long. Within it lies concealed the yang essence, and inside resides the Jade Hare. The hare corresponds to *mao* (卯), aligning with the east, where grasses and trees sprout—its fire holds hidden yang within yin.\n\nThe inner realm is called the lower *jiao*, the earthly domain. The five viscera include the kidneys, and between them lies the cinnabar field. Before it lies *Xun* Sea, the water府 of man. Though its position is yin, it contains yang within. The *Eight Trigrams* call this *Kan*, meaning \"pit\" or \"receptacle of water,\" where rivers and lakes converge. Common folk, unaware of the true positions of yin and yang, mistakenly take the north as *Kan* and the south as *Li*—this is incorrect. *Kan* is the position of *Kun* and *Xun* in the south, and the odd yang within *Kan* is the fire of *wu* (午) in the south. *Li* is the position of *Qian* and *Gen* in the north, and the even yin within *Li* is the water of *hai* (亥) and *zi* (子).\n\nThe moon is outwardly yin yet inwardly yang, outwardly a petty person yet inwardly a noble one—like lead or tin yielding silver within, or cinnabar stone concealing red gold. Both gold and silver arise from yang within yin, called the \"infant.\" Above, it unites with the Supreme Yin’s *Lao Nü* within cinnabar, forming a couple bound by mutual affinity, congealing into cinnabar. *Kan* is the watery sea, the hidden palace of the dragon, also likened to the emperor’s supreme dignity, enthroned in the northern palace yet facing south in sovereignty.\n\nThe moon is earth, and earth, devoid of yang’s light, cannot nurture the myriad things. Yet when heaven and earth bestow life, all things grow toward the sun—this is the eternal Dao of heaven and earth. Thus, in navigating the world as a person, one must first adhere to the supreme Dao, then align with the celestial Dao. To follow the celestial Dao is to perpetually preserve within oneself the primordial yang, the True One, the harmonious and pure natural qi, thereby attaining longevity and enduring vision.\n\nTherefore, the practice of the celestial revolution is arranged within thirty days, corresponding to the twelve monthly hexagrams. Counting the yin and yang lines yields seventy-two, and with the five phases applied, this completes the number three hundred and sixty. Yang advances while yin retreats, cycling endlessly in perpetual return.\n\n- **Eleventh Month: *Fu* (Return) Hexagram (☳, Earth over Thunder)**\n  Fire: 10, Water: 20.\n  *The Return Hexagram first reveals one yang line,*\n  *Kan’s man and Li’s woman stand proud in their prime.*\n  *A hall filled with gold and jade, heaven and earth shine,*\n  *Radiant rosy clouds burst forth in beams divine.*\n\n- **Twelfth Month: *Lin* (Approach) Hexagram (☱, Earth over Marsh)**\n  Fire: 11, Water: 19.\n  *At nine-two, the season’s node begins to show,*\n  *Yang’s essence subtly shifts its hidden flow.*\n  *This is Great Lü, the Approach Hexagram’s name,*\n  *Transforming the body, light and free from care and blame.*\n\n- **First Month: *Tai* (Peace) Hexagram (☰, Earth over Heaven)**\n  Fire: 12, Water: 18.\n  *The Peace Hexagram, three yang lines in grace,*\n  *Three flowers in bloom ensure an enduring place.*\n  *Now I’ve refined the luminous pearl so bright,*\n  *Who in the ninefold city dares to vie for its light?*\n\n- **Second Month: *Dazhuang* (Great Strength) Hexagram (☰, Thunder over Heaven)**\n  Fire: 13, Water: 17.\n  *The furnace steadied in the chamber, Great Strength’s decree,*\n  *Dragon and tiger roar at the gates of mao and you.*\n  *Heaven and earth’s opening and closing, discern with care,*\n  *The elixir gradually forged in flames so fair.*\n\n- **Third Month: *Guai* (Breakthrough) Hexagram (☰, Marsh over Heaven)**\n  Fire: 14, Water: 16.\n  *Five and nine intertwine as yang ascends,*\n  *Radiant light emerges, auspicious portents descend.*\n  *Once the work reaches the realm of carefree flight,*\n  *The land of deathless non-action comes into sight.*\n\n- **Fourth Month: *Qian* (Heaven) Hexagram (☰, Six Yang Lines)**\n  Fire: 15, Water: 15.\n  *Yin lines recede, six yang lines now appear,*\n  *The celestial tally arrives, fire’s light shines clear.*\n  *When the celestial revolution reaches the east’s first stem,*\n  *The golden crucible’s cinnabar elixir prospers within.*\n\n- **Fifth Month: *Gou* (Coming to Meet) Hexagram (☴, Heaven over Wind)**\n  Water: 10, Fire: 20.\n  *The Coming to Meet Hexagram, one yin line’s birth,*\n  *White snow in the furnace gradually takes flight.*\n  *Jade flowers first bloom in the central palace’s glow,*\n  *The celestial crucible’s pearls overflow.*\n\n- **Sixth Month: *Dun* (Retreat) Hexagram (☶, Heaven over Mountain)**\n  Water: 11, Fire: 19.\n  *Two and six cycle back, the elixir may be reaped,*\n  *The maiden, through the matchmaker, is further refined.*\n  *Apply the celestial revolution’s power with might,*\n  *The five phases converge in the central isle’s light.*\n\n- **Seventh Month: *Pi* (Stagnation) Hexagram (☷, Heaven over Earth)**\n  Water: 12, Fire: 18.\n  *Three yang lines recede, three yin lines now rise,*\n  *Within the crucible, cinnabar’s snow deepens its guise.*\n  *Ascending and descending align with Stagnation’s decree,*\n  *Ninefold return forges gold within water’s sea.*\n\n- **Eighth Month: *Guan* (Contemplation) Hexagram (☴, Wind over Earth)**\n  Water: 13, Fire: 17.\n  *Yang wanes, yin waxes—four and six in play,*\n  *Dragon soars, tiger leaps past the celestial gate’s way.*\n  *Ninefold radiance scatters, wind and clouds convene,*\n  *A cascade of silver waves, cold as snow’s sheen.*\n\n- **Ninth Month: *Bo* (Splitting Apart) Hexagram (☷, Mountain over Earth)**\n  Water: 14, Fire: 16.\n  *One yang line resists yin’s tally’s sway,*\n  *Light and pure expel the heavy and impure away.*\n  *Now the Dipper’s handle points to xu’s domain,*\n  *Witness the celestial Dao enter the immortals’ reign.*\n\n- **Tenth Month: *Kun* (Earth) Hexagram (☷, Six Yin Lines)**\n  Water: 15, Fire: 15.\n  *The Kun Hexagram, yin’s tally in its prime,*\n  *Lead and mercury forge the returning elixir’s climb.*\n  *Like a hawk hatching the egg, the immortal’s transformation near,*\n  *Jade bones emerge from the mortal sphere.*\n\n**Method for Practicing the Hexagrams:**\n- **For Metal:** Cross the kidneys by first pressing the left foot over the right, then the right over the left. Clasp the hands tightly, gripping the palms to prevent movement. Rotate counterclockwise twelve times, then clockwise thirteen times, with a net gain of three rotations to circulate qi into the brain.\n- **For Water:** Press the tongue firmly against the outer sides of the teeth, first turning left twelve times, then right thirteen times. Swish until the saliva turns sweet, then swallow.\n- **For Wood:** Seal the mouth, inflate the cheeks, and swish twelve times. When the mouth is full of water, swallow.\n- **For Fire:** Hold the breath and count the inhalations. When the breath grows urgent, perform three consecutive swallows. With prolonged practice, gradually increase the count, aiming for a hundred breaths before stopping.\n- **For Earth:** First practice Fire, then Water, then Wood, then Metal. Circulate and guide the qi to the middle *jiao*, then stabilize it. Press with the left hand and rotate nine times.\n\nAt the end of each month, during the third watch of the night, first complete the hexagram for that month, then proceed with the water and fire counts for each preceding month. Strike the teeth and the Heavenly Drum, clasp the hands firmly, and concentrate the spirit—just as in the yearly practice.\n\nFor daily *Zhoutian* practice, perform one hexagram before noon. The hexagrams correspond to Heaven and Earth: *Qian* and *Kun* establish the lines, the line images align, and water and fire advance and retreat. Water increases while fire decreases; yang coils and yin unfolds—all within the sixty-four hexagrams. Regard *Qian* and *Kun* as the crucible, *Kan* and *Li* as the furnace. *Zhun* and *Meng* mark the beginning, *Jiji* and *Weiji* the end. The dark and new moons serve as the guiding principle; fetal breathing forms the fire tally. The count of *Zhoutian* completes in one month, like an ant circling endlessly, returning to the start.\n\nAs the *Cantong Qi* states:\n*\"The Fire Record spans six hundred chapters, yet its aim remains unchanged.\nThe text emerges with solemn care—common folk fail to ponder deeply.\"*\n\nThose cultivating inner alchemy must first rectify their furnace, for the furnace is the outer wall of the crucible—namely, the human body. Within it lies the elixir of immortality: the spirit, essence, and fluids. The furnace has eight gates—eyes, ears, mouth, and nose—serving as the portals for seeing, hearing, exhaling, and inhaling, the locks and doors of the body. Each movement must be appropriate, and these gates must be firmly guarded, preventing the eight evils and six thieves—form, color, and flavor—from harming the inner truth. Only then can one begin the practice.\n\nThe transformations occur within the earthen furnace, hence the alchemical furnace is listed below:\n\n**Daytime Practice (performed before noon):**\n1. *Shui Lei Zhun* (Water Thunder *Zhun*): Kidney transmits to Liver.\n2. *Shui Tian Xu* (Water Heaven *Xu*): Kidney transmits to Large Intestine.\n3. *Di Shui Shi* (Earth Water *Shi*): Small Intestine transmits to Kidney.\n4. *Feng Tian Xiao Xu* (Wind Heaven *Xiao Xu*): Gallbladder transmits to Large Intestine.\n5. *Di Tian Tai* (Earth Heaven *Tai*): Small Intestine transmits to Large Intestine.\n6. *Tian Huo Tong Ren* (Heaven Fire *Tong Ren*): Large Intestine transmits to Heart.\n7. *Di Shan Qian* (Earth Mountain *Qian*): Small Intestine transmits to Bladder.\n8. *Ze Lei Sui* (Marsh Thunder *Sui*): Lung transmits to Liver.\n9. *Di Ze Lin* (Earth Marsh *Lin*): Small Intestine transmits to Lung.\n10. *Huo Lei Shi Ke* (Fire Thunder *Shi Ke*): Heart transmits to Liver.\n11. *Shan Di Bo* (Mountain Earth *Bo*): Bladder transmits to Small Intestine.\n12. *Tian Lei Wu Wang* (Heaven Thunder *Wu Wang*): Large Intestine transmits to Liver.\n13. *Shan Lei Yi* (Mountain Thunder *Yi*): Bladder transmits to Liver.\n14. *Ze Shan Xian* (Marsh Mountain *Xian*): Lung transmits to Bladder.\n15. *Tian Shan Dun* (Heaven Mountain *Dun*): Large Intestine transmits to Bladder.\n16. *Huo Di Jin* (Fire Earth *Jin*): Heart transmits to Small Intestine.\n17. *Feng Huo Jia Ren* (Wind Fire *Jia Ren*): Gallbladder transmits to Heart.\n18. *Shui Shan Jian* (Water Mountain *Jian*): Kidney transmits to Bladder.\n19. *Shan Ze Sun* (Mountain Marsh *Sun*): Bladder transmits to Lung.\n20. *Ze Tian Guai* (Marsh Heaven *Guai*): Lung transmits to Large Intestine.\n21. *Ze Di Cui* (Marsh Earth *Cui*): Lung transmits to Small Intestine.\n22. *Ze Shui Kun* (Marsh Water *Kun*): Lung transmits to Kidney.\n23. *Ze Huo Ge* (Marsh Fire *Ge*): Lung transmits to Heart.\n24. *Zhen Wei Lei* (Thunder as Thunder): Liver transmits to its own organ.\n25. *Feng Shan Jian* (Wind Mountain *Jian*): Gallbladder transmits to Bladder.\n26. *Lei Huo Feng* (Thunder Fire *Feng*): Liver transmits to Heart.\n27. *Xun Wei Feng* (Wind as Wind): Gallbladder transmits to its own organ.\n28. *Feng Shui Huan* (Wind Water *Huan*): Gallbladder transmits to Kidney.\n29. *Feng Ze Zhong Fu* (Wind Marsh *Zhong Fu*): Gallbladder transmits to Lung.\n30. *Shui Huo Ji Ji* (Water Fire *Ji Ji*): Kidney transmits to Heart.\n\n**Nighttime Practice (performed after midnight):**\n1. *Shan Shui Meng* (Mountain Water *Meng*): Bladder transmits to Kidney.\n2. *Tian Shui Song* (Heaven Water *Song*): Large Intestine transmits to Kidney.\n3. *Shui Di Bi* (Water Earth *Bi*): Kidney transmits to Small Intestine.\n4. *Tian Ze Lü* (Heaven Marsh *Lü*): Large Intestine transmits to Lung.\n5. *Tian Di Pi* (Heaven Earth *Pi*): Large Intestine transmits to Small Intestine.\n6. *Huo Tian Da You* (Fire Heaven *Da You*): Heart transmits to Large Intestine.\n7. *Lei Di Yu* (Thunder Earth *Yu*): Liver transmits to Small Intestine.\n8. *Shan Feng Gu* (Mountain Wind *Gu*): Bladder transmits to Gallbladder.\n9. *Feng Di Guan* (Wind Earth *Guan*): Gallbladder transmits to Small Intestine.\n10. *Shan Huo Bi* (Mountain Fire *Bi*): Bladder transmits to Heart.\n11. *Di Lei Fu* (Earth Thunder *Fu*): Small Intestine transmits to Liver.\n12. *Shan Tian Da Xu* (Mountain Heaven *Da Xu*): Bladder transmits to Large Intestine.\n13. *Lei Shan Xiao Guo* (Thunder Mountain *Xiao Guo*): Liver transmits to Bladder.\n14. *Lei Feng Heng* (Thunder Wind *Heng*): Liver transmits to Gallbladder.\n15. *Lei Tian Da Zhuang* (Thunder Heaven *Da Zhuang*): Liver transmits to Large Intestine.\n16. *Di Huo Ming Yi* (Earth Fire *Ming Yi*): Small Intestine transmits to Heart.\n17. *Huo Ze Kui* (Fire Marsh *Kui*): Heart transmits to Lung.\n18. *Lei Shui Xie* (Thunder Water *Xie*): Liver transmits to Kidney.\n19. *Feng Lei Yi* (Wind Thunder *Yi*): Gallbladder transmits to Liver.\n20. *Tian Feng Gou* (Heaven Wind *Gou*): Large Intestine transmits to Gallbladder.\n21. *Di Feng Sheng* (Earth Wind *Sheng*): Small Intestine transmits to Gallbladder.\n22. *Shui Feng Jing* (Water Wind *Jing*): Kidney transmits to Gallbladder.\n23. *Huo Feng Ding* (Fire Wind *Ding*): Heart transmits to Gallbladder.\n24. *Gen Wei Shan* (Mountain as Mountain): Bladder transmits to its own organ.\n25. *Lei Ze Gui Mei* (Thunder Marsh *Gui Mei*): Liver transmits to Lung.\n26. *Huo Shan Lü* (Fire Mountain *Lü*): Heart transmits to Bladder.\n27. *Dui Wei Ze* (Marsh as Marsh): Lung transmits to its own organ.\n28. *Shui Ze Jie* (Water Marsh *Jie*): Kidney transmits to Lung.\n29. *Ze Feng Da Guo* (Marsh Wind *Da Guo*): Lung transmits to Gallbladder.\n30. *Huo Shui Wei Ji* (Fire Water *Wei Ji*): Heart transmits to Kidney.\n\n*Qian* is the Metal Elder; *Kun* is the Yellow Dame. The upper crucible and lower furnace employ the central numbers; *Kan* and *Li* are the elixir. *Li* is the maiden, *Kan* the infant.\n\n**Method for Practice:**\nFollow the five phases within the hexagrams, circulating *Zhoutian* according to the month. If the month has only twenty-nine days, complete the twenty-ninth hexagram and include the thirtieth; likewise, for the nighttime practice, include the thirtieth hexagram if the month has twenty-nine days.\n\n**Timed *Zhoutian* Practice:**\nThe four hexagrams *Qian*, *Kun*, *Kan*, and *Li* serve as the key. The twenty-four lines govern the twenty-four qi, corresponding to the seasonal nodes.\n\nThe preceding sixty hexagrams govern three hundred sixty lines, thus yielding one hundred eighty yang lines and one hundred eighty yin lines, which accord with the number of the *Zhoutian*. Together, they form three hundred eighty-four lines. Each line represents one *zhu*; twenty-four *zhu* make one *liang*. Three hundred eighty-four *zhu* complete the *Zhoutian* measure of one *jin* of fire timing.\n\nThus, in internal practice, one day corresponds to the celestial movement of one year—its ascent and descent, the circulation of yin and yang, within the four seasons and twelve hours. Day follows spring and summer; night follows autumn and winter. From beginning to end, day and night mirror the harmonious exchange of Heaven and Earth.\n\nMoreover, the hours of *Hai*, *Zi*, and *Chou* correspond to winter in Heaven: yin ascends to the heart of Heaven, yang descends to the Water Palace, warming and nurturing the Kidney, transforming and refining the bones. This is akin to how mountains and stones silently receive the ascending and descending qi of Heaven and Earth, transmuting into gold, silver, precious gems, cinnabar, and copper-iron. Thus, the true person’s body becomes golden sinews and jade marrow.\n\nThe hours of *Yin*, *Mao*, and *Chen* correspond to spring in Heaven: yin ascends to Heaven, yang descends to the Flowery Canopy. Grasses and trees each receive the harmonious qi of yang, blossoming into flowers, vegetables, sprouts, and vines.\n\nThe hours of *Si*, *Wu*, and *Wei* correspond to summer in Heaven: yin descends to the Water Palace, yang reaches its peak and fire is born. It warms and nurtures the Heart, refining the blood, which is transformed by true yang into white milk.\n\nThe hours of *Shen*, *You*, and *Xu* correspond to autumn in Heaven: yang reaches its peak and descends to Heaven, yin returns and ascends from Earth. It warms and nurtures the Lung, transforming the skin. Day and night correspond to the four seasons, refining yin and yang into one body. From this, one transcends the mundane and enters sagehood, transforming the common into the immortal—all through the great medicine of the Golden Elixir, the one *jin* of water and fire, the dual function of yin and yang.\n\nWithin the thirty-day great practice, employ the sixteen measures of water and fire. With firmness and softness, civil and martial, advance and retreat, regulate yin and yang. When applied without error, success is complete.\n\n**Establishing the Altar (to follow):**\n- On the first day, advance fire by one, use water fifteen.\n- On the second day, advance fire by two, use water fourteen.\n- On the third day, advance fire by three, use water thirteen.\n- On the fourth day, advance fire by four, use water twelve.\n- On the fifth day, advance fire by five, use water eleven.\n- On the sixth day, advance fire by six, use water ten.\n- On the seventh day, advance fire by seven, use water nine.\n- On the eighth day, advance fire by eight, use water eight.\n- On the ninth day, advance fire by nine, use water seven.\n- On the tenth day, advance fire by ten, use water six.\n- On the eleventh day, advance fire by eleven, use water five.\n- On the twelfth day, advance fire by twelve, use water four.\n- On the thirteenth day, advance fire by thirteen, use water three.\n- On the fourteenth day, advance fire by fourteen, use water two.\n- On the fifteenth day, advance fire by fifteen, use water one.\n- On the sixteenth day, advance water by one, use fire fifteen.\n- On the seventeenth day, advance water by two, use fire fourteen.\n- On the eighteenth day, advance water by three, use fire thirteen.\n- On the nineteenth day, advance water by four, use fire twelve.\n- On the twentieth day, advance water by five, use fire eleven.\n- On the twenty-first day, advance water by six, use fire ten.\n- On the twenty-second day, advance water by seven, use fire nine.\n- On the twenty-third day, advance water by eight, use fire eight.\n- On the twenty-fourth day, advance water by nine, use fire seven.\n- On the twenty-fifth day, advance water by ten, use fire six.\n- On the twenty-sixth day, advance water by eleven, use fire five.\n- On the twenty-seventh day, advance water by twelve, use fire four.\n- On the twenty-eighth day, advance water by thirteen, use fire three.\n- On the twenty-ninth day, advance water by fourteen, use fire two.\n- On the thirtieth day, advance water by fifteen, use fire one.\n\nThe above constitutes the three years of water and fire practice. In the fourth year, the middle three years of fire timing are exchanged. Thus, the *Hunyuan Jing* states: \"If one cultivates the practice, one must perform the thirty-day great practice.\" The *Riyue Xuanzhu Lun* also says: \"Clouds follow the dragon, wind follows the tiger; the Dao of the sun and moon is the ancestral origin.\" Furthermore, Wei Boyang’s *Cantong Qi* states: \"The lunar nodes have five and six; the warp and weft serve the sun’s envoy.\" The *Jinlong Baihu Jing* says: \"One yin and one yang form the guiding principle; advance and retreat are all within the celestial tally.\" The *Guwen Longhu Shangjing* states: \"*Kan* is the essence of the moon, *Li* is the radiance of the sun.\" The ancient sages all aligned with the celestial tally in advancing and retreating, increasing and decreasing fire timing.\n\nThe method of practice states: \"For the preceding water and fire method, proceed exactly as described.\"\n\n**Middle Three Years of Water and Fire Timing:**\nThe first altar configuration is employed in the fourth year, called the *Four Orthodox and Eight Applications of the Zhoutian*.\n\nNow, *Gen* as Metal is like mountains and stones, thus water is born within mountains and stones—this is yin within yang. The *Inner Landscape* says: \"The upper burner is Heaven; the Heart is the numinous palace. The head is the *Gen* mountain; the mouth is the valley cave, the source of water.\" Water is *Kan*, the accumulation of dark yin. Externally, it rises to Heaven, hovering beneath the Flowery Canopy, descending as rain and dew to moisten the Heart Palace—thus it is yin within yang.\n\nThe eight trigrams: *Li* is yang externally and yin internally, like an outer gentleman and an inner petty person. This is akin to cinnabar, which belongs to fire yet conceals mercury, the soul of the Grand Yin Crone, its body clad in five-colored garments. *Li* means \"attached\"; its essence is the sun and moon, possessing the five-colored brilliance of radiant splendor, the luminous hues of rosy clouds. Within it lies the Crimson Palace, which connects upward to the eyes—the eyes are the gates of the Mud Pill Palace. Within the palace resides the spirit, formless and master of Heaven and Earth, the numen of the ten thousand things, called the Primordial Beginning, its virtue harmonizing with non-action.\n\nIf one wishes to cultivate destiny, first clarify the spirit. When the spirit is pure and upright, the myriad evils cannot invade, and all malevolence submits. This is because the Heart is the root of the ten thousand methods, the great medicine of longevity. If the Heart cannot subdue itself, internal treacherous fire arises—just as cinnabar, if not dead, will fly away when exposed to fire.\n\nThus, governing the Heart is the master of life. Therefore, Heaven has eight poles, Earth has eight directions, the *Yi* has eight trigrams, man possesses eight vessels, fire moves through eight gates, and water refines eight essences. These may correspond to the four seasons and align with the eight trigrams in a single diagram, uniting at the center with the work of Earth to enable advance and retreat.\n\nThe oral formula for practice states: The work of Earth at the Central Palace circulates throughout the body, employing fifteen as its measure. The functions of water and fire follow prior methods. Only when primordial darkness exists do the ten thousand images arise; the eight trigrams and the sixty cyclical signs conceal divine mechanisms and spectral mysteries. The art of yin and yang overcoming one another is manifestly revealed in the images!\n\nThis is the true principle.\n\nThe second stage of Central Work, practiced in the fifth year, is called the \"Circulation of Sun and Moon\" or the \"Return to the Origin Circulation.\"\n\nWhen chaos first parted, the pure rose above and the turbid sank below. Yang darkness descended and revolved leftward, while yin darkness ascended and turned rightward. Thus, yang essence congealed to form the sun, and yin essence congealed to form the moon. The sun governs waxing and waning, the moon governs crescent and full phases—all within the bounds of waxing, waning, increase, and decrease.\n\nThe fire-timing of the Celestial Circulation inherits both great and small cycles. The ten thousand things bear yin and embrace yang, arising in accord with the seasons, perishing in accord with the seasons, and achieving completion through darkness.\n\nMoreover, man is the chief of the ten thousand things, born to employ the functions of Heaven and Earth. Heaven and Earth first generate the Two Modes, taking water as the True One; man likewise first generates the Two Modes, with the left and right kidneys as the pivot, also called the True One. The mysterious is the source of water. The sage says: one water, two fires—this is the yang within yin, hence named the Origin.\n\nFire is born of wood and governs the liver—this is the Green Dragon, the yang soul. Water is born of metal and governs the lungs—this is the White Tiger, the yin spirit. With the Four Images complete, Earth has no fixed form and rules the four seasons in turn.\n\nThe classic states: one water, two fires, three wood, four metal, five earth.\n\nIn cultivation, one must ignite fire within water. The left kidney pertains to yang and is the sun; the right kidney pertains to yin and is the moon. Thus, sun and moon revolve day and night without cease, giving rise to the ten thousand things. If one cultivates, day and night within the twelve hours, practicing the Dao of sun and moon, beginning with the movement of the hours, completing three thousand works, and circulating darkness through the eight vessels—this is where the immortal begins.\n\nExternal movement corresponds to internal turning; external qi converges as internal qi intermingles. The left kidney is the Green Dragon, the true internal fire; the right kidney is the White Tiger, the true internal water. After a hundred days of practice, accumulating essence and perfecting spirit, one must perform the work of water and fire. Both left and right complete a Celestial Circulation. The two darknesses of Dragon and Tiger ascend to the Golden Gate and Jade Portal, which then close—this is the third ring of the Tower of Numinous Loft, called the \"Man’s Welcome Point.\" Using both hands to seal it, the darkness descends, joining the two darknesses of Dragon and Tiger. The Central Palace naturally unites, emotions harmonize, and one does not awaken.\n\nHeaven and Earth: this is the intermingling of qi, not the union of spirit. If spirit is complete and darkness robust, yet union is not enacted, this is the union of form, not the intermingling of qi.\n\nAfter a hundred days of practice, testing will reveal no leakage or dissipation, no nightmares, and no invasion by yin ghosts. Further practicing the great fire work of the Celestial Circulation, applying the numbers of nine nines and their increases and decreases, steaming the sinews and exposing the bones, refining darkness to generate spirit—one who can practice this will be unassailed by the ten thousand illnesses, untouched by the thousand evils, and may prolong life, extend years, and ascend as a feathered immortal.\n\n**Verse:**\nWithin water, primordial fire is born;\nWithin yang, a single yin grows long.\nThe two passes connect inner and outer,\nThe two substances revolve, floating and sinking.\nNine returns: Dragon unites with Tiger;\nSeven reversals: wood joins with metal.\nThe pivot is the Dao of sun and moon—\nThis principle is most profound.\n\n**Another Verse:**\nSun and moon wax and wane, turning two wheels;\nWhen the two passes’ darkness is sufficient, spirit may be born.\nTogether they are a pair of mysterious frost children—\nYet they have misled thousands upon thousands of people.\n\nThe classic states: The sun and moon have their numbers, the great and small have their measures. From this, sagely work arises! From this, spirit and illumination emerge!\n\nHeaven is the crucible, its canopy covering the four directions. Heaven is Qian, it is metal. The *Inner Landscape* says: Above the Lung Palace is the canopy, covering the various organs below and connecting upward to the nose. The nose is the Gate of Heaven, externally governing inhalation and exhalation, moving the constructive and defensive qi, circulating through the five viscera, flowing throughout the body, dynamically changing in ascent and descent. Great and small have their measures, just as Heaven moves the stars and constellations, Earth turns the rivers and streams. Inner and outer are the same; man and Heaven are in accord. Thus, the Gate of Heaven connects to the lungs, issuing and entering pure darkness—this is the lid of the crucible.\n\nEarth is the belly of the crucible, transforming the ten thousand things. Earth is Kun. The *Inner Landscape* says: The spleen and stomach encompass water and grain, connecting upward to the mouth. The mouth is the Gate of Earth, also called the Throat Gate. It receives water and grain, which descend to the stomach chamber. There, it receives the darkness descending from the Gate of Heaven, moving and digesting, transforming water and grain, separating the clear and turbid. The clear part of grain ascends to the upper burner, the Palace of Heart and Lungs, the boundary of clarity and purity, where it transforms into spirit-darkness, essence, and fluids, nourishing life. The turbid part of grain descends to the large and small intestines.\n\nThus, the stomach is the crucible of transformation. The mouth is the Gate of Earth, the nose is the Gate of Heaven. At the center is the Mysterious Female, called the \"Human Center\"—this is the Three Powers: Heaven, Earth, and Man.\n\nThe qi of the Gate of Heaven’s breathing accords with the movements of stars and constellations; the water flowing through the Gate of Earth corresponds internally to the blood vessels, governing the constructive and defensive qi. The practice of fetal breathing, the Dao of ascent and descent, is the root and source of the stem.\n\nThus, the inner kidneys are the ultimate void; the outer kidneys are like the sun and moon. Inner and outer correspond, and yin and yang naturally unite. The work of Heaven’s ninefold use, the principle of advance and retreat in circulation—this is the gateway to cultivation and nourishment.\n\nThe classic states: \"Deep roots and firm stems are the Dao of long life and enduring vision.\"\n\nOn the first day, advance the one-by-nine work; on the second day, advance the two-by-nine work; on the third day, advance the three-by-nine work; on the fourth day, advance the four-by-nine work; on the fifth day, advance the five-by-nine work; on the sixth day, advance the six-by-nine work; on the seventh day, advance the seven-by-nine work; on the eighth day, advance the eight-by-nine work; on the ninth day, advance the nine-by-nine work. For each of the above, employ the number forty.\n\nOn the tenth day, visualize the upper work forty times, the middle work forty times, and the lower work forty times. On the eleventh day, advance the nine-by-nine work; on the twelfth day, advance the eight-by-nine work; on the thirteenth day, advance the seven-by-nine work; on the fourteenth day, advance the six-by-nine work; on the fifteenth day, advance the five-by-nine work; on the sixteenth day, advance the four-by-nine work; on the seventeenth day, advance the three-by-nine work; on the eighteenth day, advance the two-by-nine work; on the nineteenth day, advance the one-by-nine work. For each of the above, employ the number forty.\n\nOn the twentieth day, visualize the upper palace eighty times, the middle palace eighty times, and the lower palace eighty times. On the twenty-first day, advance the one-by-nine work; on the twenty-second day, advance the two-by-nine work; on the twenty-third day, advance the three-by-nine work; on the twenty-fourth day, advance the four-by-nine work; on the twenty-fifth day, advance the five-by-nine work; on the twenty-sixth day, advance the six-by-nine work; on the twenty-seventh day, advance the seven-by-nine work; on the twenty-eighth day, advance the eight-by-nine work; on the twenty-ninth day, advance the nine-by-nine work. For each of the above, employ the number forty.\n\nOn the thirtieth day, visualize the upper field one hundred twenty times, the middle field one hundred twenty times, and the lower field one hundred twenty times. The method of practice states: ...follow the monthly metal method in conducting the work, with the initial work numbers as previously described. For the upper work, visualize the upper brain; for the upper palace, visualize the central courtyard; for the upper field, visualize the lower cinnabar field.\n\nThe third application of the middle palace and the sixth year of practice are called the \"Primordial Circulation of the Zhou Heaven.\" In refining the great elixir, one must engage in the movement of the Zhou Heaven, aligning the celestial stems and earthly branches, interweaving the five and six, with the qi phases responding to the seasons. A year’s count cycles through the four seasons, shifting through the twenty-four qi, and alternating through the seventy-two hou. The work of jia and geng resides in wu and gui; metal and wood are fixed in yin and shen positions. Only then can the furnace refine the white snow, the tripod nurture the yellow sprout. When the elixir gold undergoes its first transformation, black and white correspond; the upper and lower gates open, Kan and Li unite. The dragon ascends to extinguish the fire, timely passing through the Gate of the Spinal Victory; the tiger draws forth a thousand waves, each time traversing the Dao of the Mud Pill. Once the three fields are filled with medicine, the six palaces indeed give birth to spirit.\n\nTo enable the union of spirit and qi, one must employ the Hunyuan method, circulating through the twenty-four qi and seventy-two hou. Before spring, one segment comprises three qi and nine hou: at the Beginning of Spring (first month’s node), one qi with three applications, each application with three achievements; at Rain Water (mid-first month), one qi with three applications, each application with three achievements; at the Waking of Insects (second month’s node), one qi with three applications, each application with three achievements. After spring, one segment comprises three qi and nine hou: at the Spring Equinox (mid-second month), one qi with three applications, each application with three achievements; at Pure Brightness (third month’s node), one qi with three applications, each application with three achievements; at Grain Rain (mid-third month), one qi with three applications, each application with three achievements.\n\nBefore summer, one segment comprises three qi and nine hou: at the Beginning of Summer (fourth month’s node), one qi with three applications, each application with three achievements; at Grain Full (mid-fourth month), one qi with three applications, each application with three achievements; at Grain in Ear (fifth month’s node), one qi with three applications, each application with three achievements. After summer, one segment comprises three qi and nine hou: at the Summer Solstice (mid-fifth month), one qi with three applications, each application with three achievements; at Slight Heat (sixth month’s node), one qi with three applications, each application with three achievements; at Great Heat (mid-sixth month), one qi with three applications, each application with three achievements.\n\nBefore autumn, one segment comprises three qi and nine hou: at the Beginning of Autumn (seventh month’s node), one qi with three applications, each application with three achievements; at the Limit of Heat (mid-seventh month), one qi with three applications, each application with three achievements; at White Dew (eighth month’s node), one qi with three applications, each application with three achievements. After autumn, one segment comprises three qi and nine hou: at the Autumn Equinox (mid-eighth month), one qi with three applications, each application with three achievements; at Cold Dew (ninth month’s node), one qi with three applications, each application with three achievements; at Frost Descent (mid-ninth month), one qi with three applications, each application with three achievements.\n\nBefore winter, one segment comprises three qi and nine hou: at the Beginning of Winter (tenth month’s node), one qi with three applications, each application with three achievements; at Slight Snow (mid-tenth month), one qi with three applications, each application with three achievements; at Great Snow (eleventh month’s node), one qi with three applications, each application with three achievements. After winter, one segment comprises three qi and nine hou: at the Winter Solstice (mid-eleventh month), one qi with three applications, each application with three achievements; at Slight Cold (twelfth month’s node), one qi with three applications, each application with three achievements; at Great Cold (mid-twelfth month), one qi with three applications, each application with three achievements.\n\nThe method of practice states: \"One qi with three applications\" means that within each qi of fifteen days, for every five days among the sixty hours, select the jiazi, gengshen, and one’s own life hour to perform one achievement each. The method of execution follows the monthly practice: when refining the metal method, nine revolutions constitute one achievement.\n\nThe first application of practice, in the seventh year, is called the Wondrous Water Circulation of the Zhou Heaven. That heaven endures long and perpetually is because it attains the Dao of the Orthodox Unity and True Origin. Within the furnace and tripod of heaven and earth, yin and yang unite internally, not losing the original qi, thereby attaining the Dao of natural longevity. Endowed by heaven and earth, it generates the essence of heaven and earth, becoming the child of heaven and earth. Nurtured by the covering and nourishing of heaven and earth, it transforms into a human, whose inner realm also possesses the Dao of heaven and earth’s longevity.\n\nNow, the Orthodox Unity is the venerable title of water. The origin of heaven and earth is the True Unity; the mechanism of the Five Phases is the True Water; the mother of the myriad things is the Great Mystery. If one cultivates and refines, simply employing the wondrous use of True Water to circulate through the Zhou Heaven, when practice reaches this stage, externally it can generate the myriad things, and internally it can generate the myriad spirits. Thus, it is said that the wondrous use of small achievements is grandly named Wondrous Water.\n\nHeaven One (jia) begins on the first day of the tenth month and lasts until the sixth day of the eleventh month, with water flowing for six days. Earth Two (yi) begins on the seventh day of the eleventh month and lasts until the twelfth day of the twelfth month, with water flowing for five days. Heaven Three (bing) begins on the thirteenth day of the twelfth month and lasts until the eighteenth day of the first month, with water flowing for four days. Earth Four (ding) begins on the nineteenth day of the first month and lasts until the twenty-fourth day of the second month, with water flowing for three days. Heaven Five (wu) begins on the twenty-fifth day of the second month and lasts until the thirtieth day of the third month, with water flowing for two days. Earth Six (ji) begins on the first day of the fourth month and lasts until the sixth day of the fifth month, with water flowing for one day. Heaven Seven (geng) begins on the seventh day of the fifth month and lasts until the twelfth day of the sixth month, with water flowing for two days. Earth Eight (xin) begins on the thirteenth day of the sixth month and lasts until the eighteenth day of the seventh month, with water flowing for three days. Heaven Nine (ren) begins on the nineteenth day of the seventh month and lasts until the twenty-fourth day of the eighth month, with water flowing for four days. Earth Ten (gui) begins on the twenty-fifth day of the eighth month and lasts until the thirtieth day of the ninth month, with water flowing for five days.\n\nThe second application of practice, in the eighth year, is called the Wondrous Fire Circulation of the Zhou Heaven. The sun is the celestial soul, the essence of the Great Yang fire, occupying the honored position above, residing in Qian and Gen. It flourishes in summer and declines in winter, with short nights and long days, internally concealing yin qi and harboring the golden phoenix within. The phoenix corresponds to you (the tenth Earthly Branch), externally aligning with the west. Metal and stone can generate its water. The small achievement of the Qian number is grandly named Wondrous Fire.\n\nOn the first day, fire flows eight times; on the second day, fire flows nine times...\n\nOn the third day, fire flows ten times; on the fourth day, fire flows eleven times; on the fifth day, fire flows twelve times; on the sixth day, fire flows thirteen times; on the seventh day, fire flows fourteen times; on the eighth day, fire flows fifteen times; on the ninth day, fire flows sixteen times; on the tenth day, fire flows seventeen times; on the eleventh day, fire flows eighteen times; on the twelfth day, fire flows nineteen times; on the thirteenth day, fire flows twenty times; on the fourteenth day, fire flows twenty-one times; on the fifteenth day, fire flows twenty-one times; on the sixteenth day, fire flows twenty times; on the seventeenth day, fire flows nineteen times; on the eighteenth day, fire flows eighteen times; on the nineteenth day, fire flows seventeen times; on the twentieth day, fire flows sixteen times; on the twenty-first day, fire flows fifteen times; on the twenty-second day, fire flows fourteen times; on the twenty-third day, fire flows thirteen times; on the twenty-fourth day, fire flows twelve times; on the twenty-fifth day, fire flows eleven times; on the twenty-sixth day, fire flows ten times; on the twenty-seventh day, fire flows nine times; on the twenty-eighth day, fire flows eight times; on the twenty-ninth day, fire flows seven times; on the thirtieth day, fire flows six times.\n\nThe *Method of Practice* states: ...Follow the internal practice according to the lunar cycle. In the third phase of cultivation, the ninth year is called \"Returning to the Cycle of Harvest.\" Heaven and earth ascend and descend, yin and yang converge, the eight trigrams move, and the fire timing advances and retreats. The single qi encompasses the Three Powers, employing the nine returns and seven reversals, with success rooted in the primordial method of the undifferentiated.\n\nRefining qi to generate spirit relies on the numbers of the celestial cycle, combining grains and ounces into sixty-four parts to correspond with the sixty-four hexagrams. Six grains represent the six lines. On the first day, six yang grains and six yin grains. On the second day, six yang grains and six yin grains. On the third day, six yang grains and six yin grains. On the fourth day, six yang grains and six yin grains. On the fifth day, six yang grains and six yin grains. On the sixth day, six yang grains and six yin grains. On the seventh day, six yang grains and six yin grains. On the eighth day, nine yang grains and nine yin grains. On the ninth day, six yang grains and six yin grains. On the tenth day, six yang grains and six yin grains. On the eleventh day, six yang grains and six yin grains. On the twelfth day, six yang grains and six yin grains. On the thirteenth day, six yang grains and six yin grains. On the fourteenth day, six yang grains and six yin grains. On the fifteenth day, nine yang grains and nine yin grains. On the sixteenth day, six yin grains and six yang grains. On the seventeenth day, six yin grains and six yang grains. On the eighteenth day, six yin grains and six yang grains. On the nineteenth day, six yin grains and six yang grains. On the twentieth day, six yin grains and six yang grains. On the twenty-first day, six yin grains and six yang grains. On the twenty-second day, six yin grains and six yang grains. On the twenty-third day, nine yin grains and nine yang grains. On the twenty-fourth day, six yin grains and six yang grains. On the twenty-fifth day, six yin grains and six yang grains. On the twenty-sixth day, six yin grains and six yang grains. On the twenty-seventh day, six yin grains and six yang grains. On the twenty-eighth day, six yin grains and six yang grains. On the twenty-ninth day, six yin grains and six yang grains. On the thirtieth day, nine yin grains and nine yang grains.\n\nThe *Method of Practice* states: For yang grains, hold the breath for nine cycles and swallow three times; for yin grains, hold the breath for six cycles and swallow three times.\n\n**Entering the Chamber for the Celestial Cycle**\nThe *Book of Changes* says: \"As the sun departs, the moon arrives; as the moon departs, the sun arrives—sun and moon alternate to generate light. As cold departs, heat arrives; as heat departs, cold arrives—cold and heat alternate to complete the year.\" Thus, yang lines are assigned to *Qian*, and yin lines to *Kun*. The number of old yang is thirty-six, corresponding to the four nines; the number of old yin is twenty-four, corresponding to the four sixes. Each hour, one line is practiced, and two hexagrams are employed.\n\nThe *Method of Practice* states: For a yang line, hold the breath for thirty-six cycles and swallow three times; for a yin line, hold the breath for twenty-four cycles and swallow three times. Upon completion, exert force to guide the qi into the cinnabar field, reciting: \"Splitting above and below, opening the Two Modes, circulating the Five Movements, harmonizing the Six Qi—heaven’s wheel turns west, earth’s water flows east. The ascent and descent of heaven and earth can only be matched by humans. Reverently emulate the union of yin and yang hexagrams: the *Li* and *Kan* lines, the left dragon and right tiger, aligned with the pivot of sun and moon; *Kan* in the north and *Li* in the south, following the creation of *Qian* and *Kun*.\"\n\nThe *Book of Changes* establishes firmness and softness, with lines corresponding to the six spirits and time divided into the four images. Each day, two hexagrams are used, applied at dawn and dusk. Each hour, one line is established, intersecting at *zi* and *wu*. One month comprises sixty hexagrams, aligning with the seasonal markers; ten months comprise six hundred hexagrams, distributed in the fire timing. Thus, Wei Boyang said: \"The *Fire Record* has six hundred chapters, yet their purpose is not different.\" This is the meaning. *On the Seven Reversals and Return to the Origin*\n\nWater of *zi* reaching Metal of *shen* constitutes the Nine Returns—this is the child returning to the mother. The first sequence in order is called \"return,\" while the reverse is called \"reversal.\" The Seven Reversals begin at *shen* and count to *yin*, where Fire resides within Wood. The second reversal then proceeds backward from *yin* through the Nine Returns, reaching *wu* to reveal Fire, which is the position of *Li*. Another Seven Reversals follow, retracing from *wu* back to *zi*, the position of *Kan*. The third sequence counts the Nine Returns from *zi* to *chen*, revealing Earth, then reverses the Seven Returns from *chen* to *xu*. Here, the Three Agents interact in reversal, and the Five Phases manifest Earth, completing the transformation into the *daogui*.\n\nThe *dao* is Metal, and *dao* means \"to arrive\"—to sever and reach its destination. The *gui* is the two Earths; thus, Earth is born of Metal, becoming the Yellow Sprout.\n\n**Eulogy:**\nThe Three Powers connect,\nEarth’s depth and Heaven’s height,\nWith harmony at the center,\nPreceding all things.\nSome are mortal, some sage,\nSome foolish, some wise—\nCultivating yin makes ghosts,\nCultivating yang makes immortals.\nClarity brings stillness,\nTurbidity brings struggle.\nTo achieve the Great Dao,\nOne must encounter the true key.\nTo know refinement:\nEssence, mercury, spirit complete,\nTrue Water, True Fire,\nTrue Mercury, True Lead.\nWhether in sequence or reversal,\nSeven Reversals and Nine Returns—\nThose who attain it now\nDo so by prior cause.\nFrom ancient sages,\nMouth-to-mouth transmission:\nIf one practices this method,\nThey ascend to sagehood and Heaven.\n\n**Elixir Refinement Incantation:**\nSteadfast the spirit abides,\nEndless the cavernous void.\nAfter winter’s first node,\nTemper and nurture my pearl.\nNine worms expelled,\nThree corpses swiftly removed.\nThe primordial spirit petitions me—\nGrant the celestial talisman.\nThe embryo’s spirit transforms,\nSubtly attaining the void’s origin.\nBy the Supreme’s mighty command,\nHasten as the law decrees!\n\n*The Scripture of the Supreme Clarity’s Primordial Ultimate and Most Wondrous Divine Pearl and Jade Grain concludes.*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太清无极至妙神珠玉颗经 经名：太清无极至妙神珠玉颗经。 一卷。 不署撰人，当出于晚唐五代时期。 底本出处：《正统道藏》洞神部方法类。 太清无极至妙神珠玉颗经 道言：八景飞扬，玄虚洞光，神珠玉颗，太阴太阳。 《开天记》云：神珠者，太阳之精； 玉颗者，月华之英。 朝魂主降，暮魄主升。 朝魂者，天之阳魂； 暮魄者，地之阴魄。 阴魄升时阳魂降，应飞光八境，发生四象，万物兆萌，应节顺时，动合变化，皆因天象，尽於无中变有，有内化无。 太阳流珠，主人之阳也； 太阴玄珠，主人之阴也。 阴阳符合，坤和应用，然后白金施，红雪配，精血住，真胎结，始孕男女。 夫男子者，应天之尊黑； 女子者，应地之太清 无极至妙神珠玉颗经卑黑。 儿女符合而生，阴阳俯仰而降。 始为一黑而化，五行而用，方得三田并位，五气开图，顺四时而长四肢，定八方而随八卦，阴阳府藏，皆象天地，岂不因气候而生？ 岂不因造化而立？ 至於人之修养，亦依天地同徒，欲炼大药金丹，不离阴．阳造化。 须凭周天应用，甲子运移，爻象臧加，火符进退，阳生复内，阴发遘中。 定否泰於寅申，进乾坤於巳亥，火加水减，阴卷阳舒，运九还合金木之爻，转七返在水火之象，真黑一十六两，布在三百八十四爻之中。 大药火候一斤，分於周易六十四卦之内，须得君臣定位，夫妇同和，主客尊卑，皆随火候，尺寸与铢两，皆同升斗，与爻辞不异。 列天地五十五数，皆在炉中； 分昼夜一百刻中，尽在鼎内。",
      "translated_text": "*The Supreme Clarity Scripture of the Peerless and Most Wondrous Divine Pearl and Jade Kernel*\n\nThe Dao speaks: The Eight Radiant Flights soar, the Mysterious Void pierces with light, the Divine Pearl and Jade Kernel embody the Great Yin and Great Yang.\n\n*The Record of Heaven’s Opening* states: The Divine Pearl is the essence of the Great Yang; the Jade Kernel is the flower of the moon’s splendor. The morning *hun* governs descent; the evening *po* governs ascent. The morning *hun* is the Yang soul of Heaven; the evening *po* is the Yin spirit of Earth. When the Yin *po* ascends, the Yang *hun* descends, responding to the flying light of the Eight Realms, giving rise to the Four Symbols. All things sprout in bud, aligning with the seasons and harmonizing with time. Their movements accord with transformation, all following the celestial patterns—from Nonbeing to Being, and within Being back to Nonbeing.\n\nThe Flowing Pearl of the Great Yang governs human Yang; the Mysterious Pearl of the Great Yin governs human Yin. When Yin and Yang symbols unite, Earth’s harmony responds, then white metal is bestowed, red snow paired, essence and blood stabilized, and the true embryo formed—only then are male and female conceived. The male corresponds to Heaven’s revered darkness; the female corresponds to Earth’s Supreme Clarity and Peerless Wondrous Darkness. When son and daughter unite in birth, Yin and Yang bow and rise in descent. First, they transform from a single darkness, then function through the Five Phases, only then do the Three Fields align, the Five Qi unfold their pattern, the Four Limbs grow in accord with the Four Seasons, and the Eight Directions settle in step with the Eight Trigrams. The Yin and Yang organs and viscera all mirror Heaven and Earth—how could they not arise from the qi’s seasons? How could they not stand through the workings of creation?\n\nAs for human cultivation, it likewise follows the same path as Heaven and Earth. To refine the Great Elixir and Golden Cinnabar, one must not depart from the creative transformations of Yin and Yang. One must rely on the cyclical applications of the celestial sphere, the revolutions of the *jiazi* cycle, the waxing and waning of the line symbols, the advance and retreat of the fire tally. Yang is born within *fu*, Yin emerges in the midst of *gou*. The *pi* and *tai* are determined at *yin* and *shen*; Qian and Kun advance at *si* and *hai*. Fire increases as water decreases, Yin coils while Yang unfurls. The Nine Returns complete the line symbols of Metal and Wood; the Seven Reversions turn within the images of Water and Fire. The true darkness of sixteen ounces is distributed among the three hundred eighty-four lines. The fire-timing of the Great Elixir, weighing one *jin*, is divided within the sixty-four hexagrams of the *Zhouyi*. One must secure the positions of ruler and minister, the harmony of husband and wife, the hierarchy of host and guest—all following the fire-timing. Inches and ounces, scales and measures, all correspond to the line statements without discrepancy. The fifty-five numbers of Heaven and Earth are arrayed within the furnace; the one hundred divisions of day and night are entirely contained within the crucible.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 581,
      "start_sentence": 0,
      "end_sentence": 26,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.359793663024902,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太清元极至妙神珠玉颗经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "水中白虎，感月魄而成形； 火内青龙，含日光而应象。 炼药须分四序，进火全在八门。 三光气会，煎熬百道红浆，十二楼前，锻炼一池白雪。 转八琼於脊胜之道，运一气上泥丸之宫，玄珠落处，池中开一朵紫金莲； 圣石飞来，鼎内长万道白玉笑。 七星楼下，风云发泄，往来五色坛心； 水火交腾上下，朔旦回旋，既未朝昏，进退屯蒙。 阳奇乾位，进爻在三十六中； 阴偶坤宫，立象在二十四内。 方得木中火发，土内金生，乌龟喷刮地狂风，赤凤吐烧天猛焰。 金爷抱婴兄入户，黄婆引女临门，周天分布四时中，火候．还元十二月，置坛在后。 年用周天－年四次行 春分日用震卦 八十一 仲春时在卯，进火发青阳，阳数终九九，三返用为良。 夏至日用离卦 七十二。 夏至时当午，南观四六功，数分七十二，关节自然通。 秋分日用兑卦 九十九。 秋分居酉位，西向发神光，九十加九数，三返气才昌。 冬至日用坎卦 一百八。 冬至阳生子，行功坐北方，数成一百八，四九可能详。 行功诀日 望王相地，随时而坐。 春分日卯时，面束，望太阳坐； 夏至日午时，面南，望太阳坐； 秋分日酉时，面西，望太阴坐。 如不现，即存想如见真形。 冬至日用坎卦，子时，面北，望太阴坐。 如上法，握固存神，静虑，叩齿三十六通，天鼓二十四下，昼望太阳，夜望太阴念咒。 太阳咒曰 太阳流精，来保吾身，吾胎已灵。 同合其真。 急急如律令。 太阴咒日 太阴匡精，为我胎灵，安其魄魂，永集至神。 急急如律令。 每念呢一遍，取气一口，随吸入，便缩息闭气定数，满足一口气，作三咽。 念呢三遍，取气三次，一如上法了，便父双手，擦丹田热，即止。 为一用。 月用周天一月一次行",
      "translated_text": "Within the water, the White Tiger takes form by responding to the lunar essence; within the fire, the Green Dragon embodies the solar radiance to manifest its image. Refining the elixir requires distinguishing the four seasons; advancing the fire depends entirely on the eight gates. When the qi of the Three Luminaries converges, it simmers into a hundred streams of crimson nectar; before the Twelve-Storied Tower, it forges a pool of white snow. Turning the eight jades along the path of the spinal palace, circulating the single qi upward to the Mud Pill Palace—where the Dark Pearl descends, a purple-golden lotus blooms within the pool; where the Sacred Stone flies forth, ten thousand strands of white jade laughter arise within the crucible. Beneath the Seven-Starred Tower, wind and clouds surge forth, swirling in five colors at the altar’s heart. As water and fire intermingle above and below, revolving with the waxing and waning of the moon, advancing and retreating through *Zhun* and *Meng*—whether at dawn or dusk, the Yang odd-numbered positions of the Qian hexagram advance their lines within the thirty-six; the Yin even-numbered positions of the Kun palace establish their images within the twenty-four. Only then does fire emerge within wood, metal arise within earth, the Black Tortoise exhale the raging winds of the earth, and the Red Phoenix spew the fierce flames of heaven. The Metal Lord embraces the Infant Brother to enter the chamber; the Yellow Dame guides the Maiden Sister to the gate. The celestial revolution is distributed within the four seasons; the fire-timing returns to its origin in the twelve months—place the altar at the rear.\n\nFor yearly practice, circulate the celestial revolution four times a year:\n- On the Spring Equinox, use the *Zhen* hexagram, eighty-one repetitions. In mid-spring, at the hour of *mao*, advance the fire to arouse the Green Yang. The Yang number ends at nine nines; three returns make it efficacious.\n- On the Summer Solstice, use the *Li* hexagram, seventy-two repetitions. At the Summer Solstice, facing south at noon, observe the four-six achievement. The number divides into seventy-two; the joints naturally open.\n- On the Autumn Equinox, use the *Dui* hexagram, ninety-nine repetitions. At the Autumn Equinox, stationed in the *you* position, face west to emit divine radiance. Ninety plus nine makes the number; three returns make the qi flourish.\n- On the Winter Solstice, use the *Kan* hexagram, one hundred eight repetitions. At the Winter Solstice, as Yang is born at *zi*, practice facing north. The number completes one hundred eight; four nines may be contemplated in detail.\n\nThe method for practice:\nChoose a prosperous and flourishing place, and sit according to the time.\n- On the Spring Equinox at the hour of *mao*, face east and sit gazing at the sun.\n- On the Summer Solstice at the hour of *wu*, face south and sit gazing at the sun.\n- On the Autumn Equinox at the hour of *you*, face west and sit gazing at the moon. If it is not visible, visualize it as if seeing its true form.\n- On the Winter Solstice, use the *Kan* hexagram at the hour of *zi*, face north, and sit gazing at the moon.\n\nFollowing the above method, clench the fists and concentrate the spirit. Still the thoughts, knock the teeth thirty-six times, and beat the Heavenly Drum twenty-four times. By day, gaze at the sun; by night, gaze at the moon and recite the incantation.\n- **Incantation for the Sun:**\n  *\"The sun’s flowing essence comes to protect my body. My embryo is already numinous, uniting with its true nature. Hasten, as the law commands!\"*\n- **Incantation for the Moon:**\n  *\"The moon’s aiding essence makes my embryo numinous. It settles my *po* and *hun*, forever gathering the supreme spirit. Hasten, as the law commands!\"*\n\nWith each recitation, draw in one breath, then inhale and hold it, counting the breath’s duration. When the breath is full, swallow three times. Recite the incantation three times, taking three breaths, each following the above method. Then, rub the hands together and warm the cinnabar field before stopping. This completes one session.\n\nFor monthly practice, circulate the celestial revolution once a month.",
      "overlap_context": "at Elixir, weighing one *jin*, is divided within the sixty-four hexagrams of the *Zhouyi*. One must secure the positions of ruler and minister, the harmony of husband and wife, the hierarchy of host and guest—all following the fire-timing. Inches and ounces, scales and measures, all correspond to the line statements without discrepancy. The fifty-five numbers of Heaven and Earth are arrayed within the furnace; the one hundred divisions of day and night are entirely contained within the crucible.",
      "start_char": 581,
      "end_char": 1279,
      "start_sentence": 27,
      "end_sentence": 66,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.88631510734558,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太清元极至妙神珠玉颗经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "月者地魄，太阴水之精，在下为卑位，属坤巽。 冬王夏衰，昼短夜长，中隐阳精，内隐玉兔。 兔者卯也，以应束方，草木能生，其火阴中有隐阳。 内境曰下焦为地，五脏日肾，两肾中曰丹田，前有巽海，即人之水府。 其位虽阴，中含其阳。 八卦曰坎，坎者陷也，受水之府，故江湖归矣1．世俗之徒，不知阴阳正位，只以北方为坎，南方为离，此理皆非。 坎者，南方坤巽之位也。 坎中奇阳者，即南方午之火也。 离者，北方乾艮之位也。 离中偶阴者，即北方亥子之水也。 月者外阴而内阳，外小人而内君子，亦内如铅锡中产白银，砂石之中包赤金。 金之与银，俱是阴中有阳，谓之婴儿。 上与丹砂之中太阴姥女，合为夫妇，情类相恋，凝而成砂。 坎为水海，隐龙之宫，亦喻帝王至尊，位处北阙，面南称尊。 月者地也，地无阳黑，万物不生。 禀天地而生万物，向阳而长，此者天地常道矣！ ．夫处世为人，先遵乎至道，后顺乎天道。 顺天之道也，常存其身中元阳真一、太和纯粹自然之黑，自致长生久视。 故周天之用，列於三十日中，一十二月卦，计阴阳爻，合为七十二数，加五行为用，故成三百六十之数。 阳进阴退，周而复始。 十一月地雷复卦 火十数，水二十数。 复卦初见一阳爻，坎男离女正当骄。 满堂金玉乾坤耀，透出霞光万丈高。 十二月地泽临卦。 火十一，水十九。 九二生兹见节侯，阳质渐渐转相偷。 此名大吕名临卦，转换身轻永不忧。 正月地天泰卦。 火十二，水十八。 地天泰卦三阳宁，三花既艳定长生。 我今修得明珠宝，九重城裹有谁争？ 二月雷天大壮卦。 火十三，水十七。 神室安炉大壮号，卯酉门中龙虎啸。 天地开闭审细分，还丹渐渐烧成宝。 三月泽天央卦。 火十四，水十六。 五九交交以盛阳，透出光辉见瑞祥。 既然功至逍遥地，便见无为不死乡。 四月六阳乾卦。 火十五，水十五。 退尽阴爻见六阳，天符到此火飞光。 周天到日出东甲，金鼎丹砂药自昌。 五月天风娠卦。 水十，火二十。 天风诟卦一阴生，炉中白雪渐飞升。 琼花初放中官产，天鼎流珠药自增。 六月天山遁卦。 水十一，火十九。 二六循还药可收，媳女因媒转更修。 宜下周天功力大，五行皆会在中洲。 七月天地否卦。 水十二，火十八。 三阳才退覆三阴，鼎内丹砂雪色深。 升降符合天地否，九还烧就水中金。 八月风地观卦。 水十三，火十七。 阳喊阴加四六问，龙强虎踊过天关。 九光霞散风云会，一派银波雪浪寒。 九月山地剥卦。 水十四，火十六。 阳爻一位敌阴符，剎尽轻清重浊居。 从此斗杓方建戌，会观天道入仙都。 十月六阴坤卦。 水十五，火十五。 坤象阴符第一篇，始知铅汞作还丹。 如鹞抱卯胎仙化，玉霄更骨出凡问。 行功诀日 凡卦行金，以两肾相交，先以左足压右，却以右压左，紧叉手，两手握於手心，无令转动。 逆日转十二遭，顺日转十三遭，较输三转，运气入脑。 凡济行水，以舌於牙齿外面着力紧转，先以向左转十二遭，次以向右转十三遭。 漱至甘甜，咽。 凡卦行木，合口鼓顺十二J鼓水满口即咽。 凡卦行火，闭气数息，候气急，即并三咽之。 行久闭气息，渐加数，即约百息，止。 凡卦行土，先行火，次水，次木，次金，输翰运至中院，定住，以左手按之九转。",
      "translated_text": "The moon is the earth’s *po*, the essence of the Supreme Yin’s water. Below, it occupies a humble position, belonging to *Kun* and *Xun*. It reigns in winter and wanes in summer, its days short and nights long. Within it lies concealed the yang essence, and inside resides the Jade Hare. The hare corresponds to *mao* (卯), aligning with the east, where grasses and trees sprout—its fire holds hidden yang within yin.\n\nThe inner realm is called the lower *jiao*, the earthly domain. The five viscera include the kidneys, and between them lies the cinnabar field. Before it lies *Xun* Sea, the water府 of man. Though its position is yin, it contains yang within. The *Eight Trigrams* call this *Kan*, meaning \"pit\" or \"receptacle of water,\" where rivers and lakes converge. Common folk, unaware of the true positions of yin and yang, mistakenly take the north as *Kan* and the south as *Li*—this is incorrect. *Kan* is the position of *Kun* and *Xun* in the south, and the odd yang within *Kan* is the fire of *wu* (午) in the south. *Li* is the position of *Qian* and *Gen* in the north, and the even yin within *Li* is the water of *hai* (亥) and *zi* (子).\n\nThe moon is outwardly yin yet inwardly yang, outwardly a petty person yet inwardly a noble one—like lead or tin yielding silver within, or cinnabar stone concealing red gold. Both gold and silver arise from yang within yin, called the \"infant.\" Above, it unites with the Supreme Yin’s *Lao Nü* within cinnabar, forming a couple bound by mutual affinity, congealing into cinnabar. *Kan* is the watery sea, the hidden palace of the dragon, also likened to the emperor’s supreme dignity, enthroned in the northern palace yet facing south in sovereignty.\n\nThe moon is earth, and earth, devoid of yang’s light, cannot nurture the myriad things. Yet when heaven and earth bestow life, all things grow toward the sun—this is the eternal Dao of heaven and earth. Thus, in navigating the world as a person, one must first adhere to the supreme Dao, then align with the celestial Dao. To follow the celestial Dao is to perpetually preserve within oneself the primordial yang, the True One, the harmonious and pure natural qi, thereby attaining longevity and enduring vision.\n\nTherefore, the practice of the celestial revolution is arranged within thirty days, corresponding to the twelve monthly hexagrams. Counting the yin and yang lines yields seventy-two, and with the five phases applied, this completes the number three hundred and sixty. Yang advances while yin retreats, cycling endlessly in perpetual return.\n\n- **Eleventh Month: *Fu* (Return) Hexagram (☳, Earth over Thunder)**\n  Fire: 10, Water: 20.\n  *The Return Hexagram first reveals one yang line,*\n  *Kan’s man and Li’s woman stand proud in their prime.*\n  *A hall filled with gold and jade, heaven and earth shine,*\n  *Radiant rosy clouds burst forth in beams divine.*\n\n- **Twelfth Month: *Lin* (Approach) Hexagram (☱, Earth over Marsh)**\n  Fire: 11, Water: 19.\n  *At nine-two, the season’s node begins to show,*\n  *Yang’s essence subtly shifts its hidden flow.*\n  *This is Great Lü, the Approach Hexagram’s name,*\n  *Transforming the body, light and free from care and blame.*\n\n- **First Month: *Tai* (Peace) Hexagram (☰, Earth over Heaven)**\n  Fire: 12, Water: 18.\n  *The Peace Hexagram, three yang lines in grace,*\n  *Three flowers in bloom ensure an enduring place.*\n  *Now I’ve refined the luminous pearl so bright,*\n  *Who in the ninefold city dares to vie for its light?*\n\n- **Second Month: *Dazhuang* (Great Strength) Hexagram (☰, Thunder over Heaven)**\n  Fire: 13, Water: 17.\n  *The furnace steadied in the chamber, Great Strength’s decree,*\n  *Dragon and tiger roar at the gates of mao and you.*\n  *Heaven and earth’s opening and closing, discern with care,*\n  *The elixir gradually forged in flames so fair.*\n\n- **Third Month: *Guai* (Breakthrough) Hexagram (☰, Marsh over Heaven)**\n  Fire: 14, Water: 16.\n  *Five and nine intertwine as yang ascends,*\n  *Radiant light emerges, auspicious portents descend.*\n  *Once the work reaches the realm of carefree flight,*\n  *The land of deathless non-action comes into sight.*\n\n- **Fourth Month: *Qian* (Heaven) Hexagram (☰, Six Yang Lines)**\n  Fire: 15, Water: 15.\n  *Yin lines recede, six yang lines now appear,*\n  *The celestial tally arrives, fire’s light shines clear.*\n  *When the celestial revolution reaches the east’s first stem,*\n  *The golden crucible’s cinnabar elixir prospers within.*\n\n- **Fifth Month: *Gou* (Coming to Meet) Hexagram (☴, Heaven over Wind)**\n  Water: 10, Fire: 20.\n  *The Coming to Meet Hexagram, one yin line’s birth,*\n  *White snow in the furnace gradually takes flight.*\n  *Jade flowers first bloom in the central palace’s glow,*\n  *The celestial crucible’s pearls overflow.*\n\n- **Sixth Month: *Dun* (Retreat) Hexagram (☶, Heaven over Mountain)**\n  Water: 11, Fire: 19.\n  *Two and six cycle back, the elixir may be reaped,*\n  *The maiden, through the matchmaker, is further refined.*\n  *Apply the celestial revolution’s power with might,*\n  *The five phases converge in the central isle’s light.*\n\n- **Seventh Month: *Pi* (Stagnation) Hexagram (☷, Heaven over Earth)**\n  Water: 12, Fire: 18.\n  *Three yang lines recede, three yin lines now rise,*\n  *Within the crucible, cinnabar’s snow deepens its guise.*\n  *Ascending and descending align with Stagnation’s decree,*\n  *Ninefold return forges gold within water’s sea.*\n\n- **Eighth Month: *Guan* (Contemplation) Hexagram (☴, Wind over Earth)**\n  Water: 13, Fire: 17.\n  *Yang wanes, yin waxes—four and six in play,*\n  *Dragon soars, tiger leaps past the celestial gate’s way.*\n  *Ninefold radiance scatters, wind and clouds convene,*\n  *A cascade of silver waves, cold as snow’s sheen.*\n\n- **Ninth Month: *Bo* (Splitting Apart) Hexagram (☷, Mountain over Earth)**\n  Water: 14, Fire: 16.\n  *One yang line resists yin’s tally’s sway,*\n  *Light and pure expel the heavy and impure away.*\n  *Now the Dipper’s handle points to xu’s domain,*\n  *Witness the celestial Dao enter the immortals’ reign.*\n\n- **Tenth Month: *Kun* (Earth) Hexagram (☷, Six Yin Lines)**\n  Water: 15, Fire: 15.\n  *The Kun Hexagram, yin’s tally in its prime,*\n  *Lead and mercury forge the returning elixir’s climb.*\n  *Like a hawk hatching the egg, the immortal’s transformation near,*\n  *Jade bones emerge from the mortal sphere.*\n\n**Method for Practicing the Hexagrams:**\n- **For Metal:** Cross the kidneys by first pressing the left foot over the right, then the right over the left. Clasp the hands tightly, gripping the palms to prevent movement. Rotate counterclockwise twelve times, then clockwise thirteen times, with a net gain of three rotations to circulate qi into the brain.\n- **For Water:** Press the tongue firmly against the outer sides of the teeth, first turning left twelve times, then right thirteen times. Swish until the saliva turns sweet, then swallow.\n- **For Wood:** Seal the mouth, inflate the cheeks, and swish twelve times. When the mouth is full of water, swallow.\n- **For Fire:** Hold the breath and count the inhalations. When the breath grows urgent, perform three consecutive swallows. With prolonged practice, gradually increase the count, aiming for a hundred breaths before stopping.\n- **For Earth:** First practice Fire, then Water, then Wood, then Metal. Circulate and guide the qi to the middle *jiao*, then stabilize it. Press with the left hand and rotate nine times.",
      "overlap_context": "s my *po* and *hun*, forever gathering the supreme spirit. Hasten, as the law commands!\"*\n\nWith each recitation, draw in one breath, then inhale and hold it, counting the breath’s duration. When the breath is full, swallow three times. Recite the incantation three times, taking three breaths, each following the above method. Then, rub the hands together and warm the cinnabar field before stopping. This completes one session.\n\nFor monthly practice, circulate the celestial revolution once a month.",
      "start_char": 1279,
      "end_char": 2614,
      "start_sentence": 67,
      "end_sentence": 143,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.00162410736084,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太清元极至妙神珠玉颗经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "每月月尽，日夜三更，先行了本月卦象，次更行前项逐月水火数。 叩齿天鼓，握固存神，一如年用。 日用周天－日行－卦须午前 天地配象，乾坤建爻，爻象符合，水火进退。 水加火减，阳卷阴舒，尽在六十四爻之内。 以乾坤为鼎器，坎离为药炉，屯蒙为始，既未为终。 以晦朔为纲纪，胎息成火符，周天之数，一月为满，如蚁循还，周而复始。 《参同契》云：火记六百篇，所趣等不殊，文字郑重出，俗人不熟思。 修内丹者，先正其炉，炉为鼎之外垣，即人身体是也。 中有长生药者，即神黑精液。 炉分八门者，即眼耳口鼻也，为视听吐纳之关，是素钥开闭之门户。 运动各取其宜，常令固守，勿使形色滋味，八邪六贼伤於内真，然可行功矣！ ．地炉中造化，故列丹炉下项。 一日水雷屯卦，肾传肝。 二日水天需卦，肾传大肠。 三日地水师卦，小肠传肾。 四日风天小畜卦，胆传大肠。 五日地天泰卦，小肠传大肠。 六日天火同人卦，大肠传心。 七日地山谦卦，小肠传膀胱。 土 八日泽雷随卦，肺传肝。 九日地泽临卦，小肠传肺。 十日火雷噬嗑卦，心传肝。 十一日山地剥卦，膀胱传小肠。 十二日天雷元妄卦，大肠传肝。 十三日山雷颐卦，膀胱传肝。 十四日泽山咸卦，肺传膀胱。 十五日天山遁卦，大肠传膀胱。 十六日火地晋卦，心传小肠。 十七日风火家人卦，胆传心。 十八日水山赛卦，肾传膀胱。 十九日山泽损卦，膀胱传肺。 二十日泽天央卦，肺传大肠。 二十一日泽地萃卦，肺传小肠。 二十二日泽水困卦，肺传肾。 二十三日泽火革卦，肺传心。 二十四日震为雷卦，肝传本脏。 二十五日风山渐卦，胆传膀胱。 二十六日雷火丰卦，肝传心。 二十七日巽为风卦，胆传本府。 二十八日风水涣卦，胆传肾。 二十九日风泽中孚卦，胆传肺。 三十日水火既济卦，肾传心。 夜用每夜子后行－卦 一日山水蒙卦，膀胱传肾。 二日天水讼卦，大肠传肾。 三日水地比卦，肾传小肠。 四日天泽履卦，大肠传肺。 五日天地否卦，大肠传小肠。 六日火天大有卦，心传大肠。 七日雷地豫卦，肝传小肠。 八日山风蛊卦，膀胱传胆。 九日风地观卦，胆传小肠。 十日山火贲卦，膀胱传心。 十一日地雷复卦，小肠传肝。 十二日山天大畜卦，膀胱传大肠。 十三日雷山小过卦，肝传膀胱。 十四日雷风常卦，肝传胆。 十五日雷天大壮卦，肝传大肠。 十六日地火明夷卦，小肠传心。 十七日火泽睽卦，心传肺。 十八日雷水解卦，肝传肾。 十九日风雷益卦，胆传肝。 二十日天风娠卦，大肠传胆。 二十一日地风升卦，小肠传胆。 二十二日，水风井卦，肾传胆。 二十三日火风鼎卦，心传胆。 二十四日艮为山卦，膀胱传本府。 二十五日雷泽归妹卦，肝传肺。 二十六日火山旅卦，心传膀胱。 二十七日兑为泽卦，肺传本脏。 二十八日水泽节卦，肾传肺。 二十九日泽风大过卦，肺传胆。 三十日火水未济卦，心传肾。 乾为金翁 坤为黄婆 上鼎下炉中数为用坎离为药 离为女 一坎为婴儿 行功诀日 卦中五行数，依月用周天而行。 如是小尽，二十九日卦了，兼三十日卦行，二十九夜卦兼三十日卦行。 时用周天逐时水火 乾坤坎离四卦，为之秦钥，二十四爻主二十四气，应於节候之主。",
      "translated_text": "At the end of each month, during the third watch of the night, first complete the hexagram for that month, then proceed with the water and fire counts for each preceding month. Strike the teeth and the Heavenly Drum, clasp the hands firmly, and concentrate the spirit—just as in the yearly practice.\n\nFor daily *Zhoutian* practice, perform one hexagram before noon. The hexagrams correspond to Heaven and Earth: *Qian* and *Kun* establish the lines, the line images align, and water and fire advance and retreat. Water increases while fire decreases; yang coils and yin unfolds—all within the sixty-four hexagrams. Regard *Qian* and *Kun* as the crucible, *Kan* and *Li* as the furnace. *Zhun* and *Meng* mark the beginning, *Jiji* and *Weiji* the end. The dark and new moons serve as the guiding principle; fetal breathing forms the fire tally. The count of *Zhoutian* completes in one month, like an ant circling endlessly, returning to the start.\n\nAs the *Cantong Qi* states:\n*\"The Fire Record spans six hundred chapters, yet its aim remains unchanged.\nThe text emerges with solemn care—common folk fail to ponder deeply.\"*\n\nThose cultivating inner alchemy must first rectify their furnace, for the furnace is the outer wall of the crucible—namely, the human body. Within it lies the elixir of immortality: the spirit, essence, and fluids. The furnace has eight gates—eyes, ears, mouth, and nose—serving as the portals for seeing, hearing, exhaling, and inhaling, the locks and doors of the body. Each movement must be appropriate, and these gates must be firmly guarded, preventing the eight evils and six thieves—form, color, and flavor—from harming the inner truth. Only then can one begin the practice.\n\nThe transformations occur within the earthen furnace, hence the alchemical furnace is listed below:\n\n**Daytime Practice (performed before noon):**\n1. *Shui Lei Zhun* (Water Thunder *Zhun*): Kidney transmits to Liver.\n2. *Shui Tian Xu* (Water Heaven *Xu*): Kidney transmits to Large Intestine.\n3. *Di Shui Shi* (Earth Water *Shi*): Small Intestine transmits to Kidney.\n4. *Feng Tian Xiao Xu* (Wind Heaven *Xiao Xu*): Gallbladder transmits to Large Intestine.\n5. *Di Tian Tai* (Earth Heaven *Tai*): Small Intestine transmits to Large Intestine.\n6. *Tian Huo Tong Ren* (Heaven Fire *Tong Ren*): Large Intestine transmits to Heart.\n7. *Di Shan Qian* (Earth Mountain *Qian*): Small Intestine transmits to Bladder.\n8. *Ze Lei Sui* (Marsh Thunder *Sui*): Lung transmits to Liver.\n9. *Di Ze Lin* (Earth Marsh *Lin*): Small Intestine transmits to Lung.\n10. *Huo Lei Shi Ke* (Fire Thunder *Shi Ke*): Heart transmits to Liver.\n11. *Shan Di Bo* (Mountain Earth *Bo*): Bladder transmits to Small Intestine.\n12. *Tian Lei Wu Wang* (Heaven Thunder *Wu Wang*): Large Intestine transmits to Liver.\n13. *Shan Lei Yi* (Mountain Thunder *Yi*): Bladder transmits to Liver.\n14. *Ze Shan Xian* (Marsh Mountain *Xian*): Lung transmits to Bladder.\n15. *Tian Shan Dun* (Heaven Mountain *Dun*): Large Intestine transmits to Bladder.\n16. *Huo Di Jin* (Fire Earth *Jin*): Heart transmits to Small Intestine.\n17. *Feng Huo Jia Ren* (Wind Fire *Jia Ren*): Gallbladder transmits to Heart.\n18. *Shui Shan Jian* (Water Mountain *Jian*): Kidney transmits to Bladder.\n19. *Shan Ze Sun* (Mountain Marsh *Sun*): Bladder transmits to Lung.\n20. *Ze Tian Guai* (Marsh Heaven *Guai*): Lung transmits to Large Intestine.\n21. *Ze Di Cui* (Marsh Earth *Cui*): Lung transmits to Small Intestine.\n22. *Ze Shui Kun* (Marsh Water *Kun*): Lung transmits to Kidney.\n23. *Ze Huo Ge* (Marsh Fire *Ge*): Lung transmits to Heart.\n24. *Zhen Wei Lei* (Thunder as Thunder): Liver transmits to its own organ.\n25. *Feng Shan Jian* (Wind Mountain *Jian*): Gallbladder transmits to Bladder.\n26. *Lei Huo Feng* (Thunder Fire *Feng*): Liver transmits to Heart.\n27. *Xun Wei Feng* (Wind as Wind): Gallbladder transmits to its own organ.\n28. *Feng Shui Huan* (Wind Water *Huan*): Gallbladder transmits to Kidney.\n29. *Feng Ze Zhong Fu* (Wind Marsh *Zhong Fu*): Gallbladder transmits to Lung.\n30. *Shui Huo Ji Ji* (Water Fire *Ji Ji*): Kidney transmits to Heart.\n\n**Nighttime Practice (performed after midnight):**\n1. *Shan Shui Meng* (Mountain Water *Meng*): Bladder transmits to Kidney.\n2. *Tian Shui Song* (Heaven Water *Song*): Large Intestine transmits to Kidney.\n3. *Shui Di Bi* (Water Earth *Bi*): Kidney transmits to Small Intestine.\n4. *Tian Ze Lü* (Heaven Marsh *Lü*): Large Intestine transmits to Lung.\n5. *Tian Di Pi* (Heaven Earth *Pi*): Large Intestine transmits to Small Intestine.\n6. *Huo Tian Da You* (Fire Heaven *Da You*): Heart transmits to Large Intestine.\n7. *Lei Di Yu* (Thunder Earth *Yu*): Liver transmits to Small Intestine.\n8. *Shan Feng Gu* (Mountain Wind *Gu*): Bladder transmits to Gallbladder.\n9. *Feng Di Guan* (Wind Earth *Guan*): Gallbladder transmits to Small Intestine.\n10. *Shan Huo Bi* (Mountain Fire *Bi*): Bladder transmits to Heart.\n11. *Di Lei Fu* (Earth Thunder *Fu*): Small Intestine transmits to Liver.\n12. *Shan Tian Da Xu* (Mountain Heaven *Da Xu*): Bladder transmits to Large Intestine.\n13. *Lei Shan Xiao Guo* (Thunder Mountain *Xiao Guo*): Liver transmits to Bladder.\n14. *Lei Feng Heng* (Thunder Wind *Heng*): Liver transmits to Gallbladder.\n15. *Lei Tian Da Zhuang* (Thunder Heaven *Da Zhuang*): Liver transmits to Large Intestine.\n16. *Di Huo Ming Yi* (Earth Fire *Ming Yi*): Small Intestine transmits to Heart.\n17. *Huo Ze Kui* (Fire Marsh *Kui*): Heart transmits to Lung.\n18. *Lei Shui Xie* (Thunder Water *Xie*): Liver transmits to Kidney.\n19. *Feng Lei Yi* (Wind Thunder *Yi*): Gallbladder transmits to Liver.\n20. *Tian Feng Gou* (Heaven Wind *Gou*): Large Intestine transmits to Gallbladder.\n21. *Di Feng Sheng* (Earth Wind *Sheng*): Small Intestine transmits to Gallbladder.\n22. *Shui Feng Jing* (Water Wind *Jing*): Kidney transmits to Gallbladder.\n23. *Huo Feng Ding* (Fire Wind *Ding*): Heart transmits to Gallbladder.\n24. *Gen Wei Shan* (Mountain as Mountain): Bladder transmits to its own organ.\n25. *Lei Ze Gui Mei* (Thunder Marsh *Gui Mei*): Liver transmits to Lung.\n26. *Huo Shan Lü* (Fire Mountain *Lü*): Heart transmits to Bladder.\n27. *Dui Wei Ze* (Marsh as Marsh): Lung transmits to its own organ.\n28. *Shui Ze Jie* (Water Marsh *Jie*): Kidney transmits to Lung.\n29. *Ze Feng Da Guo* (Marsh Wind *Da Guo*): Lung transmits to Gallbladder.\n30. *Huo Shui Wei Ji* (Fire Water *Wei Ji*): Heart transmits to Kidney.\n\n*Qian* is the Metal Elder; *Kun* is the Yellow Dame. The upper crucible and lower furnace employ the central numbers; *Kan* and *Li* are the elixir. *Li* is the maiden, *Kan* the infant.\n\n**Method for Practice:**\nFollow the five phases within the hexagrams, circulating *Zhoutian* according to the month. If the month has only twenty-nine days, complete the twenty-ninth hexagram and include the thirtieth; likewise, for the nighttime practice, include the thirtieth hexagram if the month has twenty-nine days.\n\n**Timed *Zhoutian* Practice:**\nThe four hexagrams *Qian*, *Kun*, *Kan*, and *Li* serve as the key. The twenty-four lines govern the twenty-four qi, corresponding to the seasonal nodes.",
      "overlap_context": "inflate the cheeks, and swish twelve times. When the mouth is full of water, swallow.\n- **For Fire:** Hold the breath and count the inhalations. When the breath grows urgent, perform three consecutive swallows. With prolonged practice, gradually increase the count, aiming for a hundred breaths before stopping.\n- **For Earth:** First practice Fire, then Water, then Wood, then Metal. Circulate and guide the qi to the middle *jiao*, then stabilize it. Press with the left hand and rotate nine times.",
      "start_char": 2614,
      "end_char": 4034,
      "start_sentence": 144,
      "end_sentence": 226,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.47761821746826,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太清元极至妙神珠玉颗经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "前六十卦主三百六十爻，故阳爻一百八十，阴爻一百八十，符合周天之数，共成三百八十四爻。 一爻为一铢，二十四铢为一两，三百八十四铢，共成周天一斤火候之数也。 故内功一日，应其天运一年升降，阴阳运行，四序十二时中。 昼法春夏，夜法秋冬，昼夜始终，天地交泰。 且以亥子丑时，应天之冬，阴升於天心，阳降於水府，温养於肾，变炼於骨，亦如山石之类，暗受天地阴阳升降之气，化成金银珍宝、丹砂铜铁。 故真人之身，金筋玉髓。 寅卯辰时，应天之春，阴升於天，阳降於华盖，草木各受阳和之气，生成花菜苗蔓。 巳午未时，应天之夏，阴降水府，阳极火生，温养於心，变炼於血，，被真阳换化为白乳。 申酉戌时，应天之秋，阳极而降天，阴复而升地，温养於肺，变换於皮肤，昼夜以应四时，阴阳炼乎一体。 从此超凡入圣，化俗成仙。 皆因大药金丹，水火一斤，阴阳二用。 但於三十日大功之内，用水火一十六数，刚柔文武，进退阴阳，运用无差，成功毕矣！ 立坛在后 一日进火一，用水十五。 二日进火二，用水十四。 三日进火三，用水十三。 四日进火四，用水十二。 五日进火五，用水十一。 六日进火六，用水十。 七日进火七，用水九。 八日进火八，用水八。 九日进火九，用水七。 十日进火十，用水六。 十一日进火十一，用水五。 十二日进火十二，用水四。 十三日进火十三，用水三。 十四日进火十四，用水二。 十五日进火十五，用水一。 十六日进水一，用火十五。 十七日进水二，用火十四。 十八日进水三，用火十三。 十九日进水四，用火十二。 二十日进水五，用火、十一。 二十一日进水六，用火十。 二十二日进水七，用火九。 二十三日进水八，用火八。 二十四日进水九，用火七。 二十五日进水十，用火六。 二十六日进水十一，用火五。 二十七日进水十二，用火四。 二十八日进水十三，用火三。 二十九日进水十四，用火二。 三十日进水十五，用火一。 已上是上三年水火之功，第四年换中三年火侯，故《混元经》云：若人修炼，须行三十日大功。 又《日月玄珠论》云：云从龙，风从虎，日月之道为宗祖。 又魏伯阳《参同契》云：月节有五六，经纬奉日使。 又《金龙白虎经》云：一阴一阳为纲纪，进退皆在天符裹。 《古文龙虎上经》云：坎戊月精，离巳日光。 古圣皆合天符进退，火候加喊。 行功诀曰：前项水火法，一依前项水火行。 中三年水火候坛象第一用第四年行名曰四正八用周天 夫金艮为山石，故水生於山石之中，是阳中之阴； 《内境》日：上焦为天，心为灵府，头为艮山，口为洞谷，出水之源。 水者，坎也，积阴之黑，外於上天，凌於华盖，覆为雨露，浸润心宫，既阳中阴也。 八卦者，离外阳而内阴也，外君子内小人，亦如丹砂属火，隐水银，太阴姥女之魂，身服五彩之衣。 离者，丽也，其精为日月，有五彩华丽辉焕，霞明之色。 中有绛宫，上通於目，目为泥丸宫门。 宫中有神，神之无质，天地之主，万物之灵，号称元始，德合无为。 凡欲修命，先澄其神，神清正则万邪不干，众恶归伏，皆由其心为万法之根源，长生之大药。 心若不能自伏，内生奸火，亦如丹砂不死，见火能飞。",
      "translated_text": "The preceding sixty hexagrams govern three hundred sixty lines, thus yielding one hundred eighty yang lines and one hundred eighty yin lines, which accord with the number of the *Zhoutian*. Together, they form three hundred eighty-four lines. Each line represents one *zhu*; twenty-four *zhu* make one *liang*. Three hundred eighty-four *zhu* complete the *Zhoutian* measure of one *jin* of fire timing.\n\nThus, in internal practice, one day corresponds to the celestial movement of one year—its ascent and descent, the circulation of yin and yang, within the four seasons and twelve hours. Day follows spring and summer; night follows autumn and winter. From beginning to end, day and night mirror the harmonious exchange of Heaven and Earth.\n\nMoreover, the hours of *Hai*, *Zi*, and *Chou* correspond to winter in Heaven: yin ascends to the heart of Heaven, yang descends to the Water Palace, warming and nurturing the Kidney, transforming and refining the bones. This is akin to how mountains and stones silently receive the ascending and descending qi of Heaven and Earth, transmuting into gold, silver, precious gems, cinnabar, and copper-iron. Thus, the true person’s body becomes golden sinews and jade marrow.\n\nThe hours of *Yin*, *Mao*, and *Chen* correspond to spring in Heaven: yin ascends to Heaven, yang descends to the Flowery Canopy. Grasses and trees each receive the harmonious qi of yang, blossoming into flowers, vegetables, sprouts, and vines.\n\nThe hours of *Si*, *Wu*, and *Wei* correspond to summer in Heaven: yin descends to the Water Palace, yang reaches its peak and fire is born. It warms and nurtures the Heart, refining the blood, which is transformed by true yang into white milk.\n\nThe hours of *Shen*, *You*, and *Xu* correspond to autumn in Heaven: yang reaches its peak and descends to Heaven, yin returns and ascends from Earth. It warms and nurtures the Lung, transforming the skin. Day and night correspond to the four seasons, refining yin and yang into one body. From this, one transcends the mundane and enters sagehood, transforming the common into the immortal—all through the great medicine of the Golden Elixir, the one *jin* of water and fire, the dual function of yin and yang.\n\nWithin the thirty-day great practice, employ the sixteen measures of water and fire. With firmness and softness, civil and martial, advance and retreat, regulate yin and yang. When applied without error, success is complete.\n\n**Establishing the Altar (to follow):**\n- On the first day, advance fire by one, use water fifteen.\n- On the second day, advance fire by two, use water fourteen.\n- On the third day, advance fire by three, use water thirteen.\n- On the fourth day, advance fire by four, use water twelve.\n- On the fifth day, advance fire by five, use water eleven.\n- On the sixth day, advance fire by six, use water ten.\n- On the seventh day, advance fire by seven, use water nine.\n- On the eighth day, advance fire by eight, use water eight.\n- On the ninth day, advance fire by nine, use water seven.\n- On the tenth day, advance fire by ten, use water six.\n- On the eleventh day, advance fire by eleven, use water five.\n- On the twelfth day, advance fire by twelve, use water four.\n- On the thirteenth day, advance fire by thirteen, use water three.\n- On the fourteenth day, advance fire by fourteen, use water two.\n- On the fifteenth day, advance fire by fifteen, use water one.\n- On the sixteenth day, advance water by one, use fire fifteen.\n- On the seventeenth day, advance water by two, use fire fourteen.\n- On the eighteenth day, advance water by three, use fire thirteen.\n- On the nineteenth day, advance water by four, use fire twelve.\n- On the twentieth day, advance water by five, use fire eleven.\n- On the twenty-first day, advance water by six, use fire ten.\n- On the twenty-second day, advance water by seven, use fire nine.\n- On the twenty-third day, advance water by eight, use fire eight.\n- On the twenty-fourth day, advance water by nine, use fire seven.\n- On the twenty-fifth day, advance water by ten, use fire six.\n- On the twenty-sixth day, advance water by eleven, use fire five.\n- On the twenty-seventh day, advance water by twelve, use fire four.\n- On the twenty-eighth day, advance water by thirteen, use fire three.\n- On the twenty-ninth day, advance water by fourteen, use fire two.\n- On the thirtieth day, advance water by fifteen, use fire one.\n\nThe above constitutes the three years of water and fire practice. In the fourth year, the middle three years of fire timing are exchanged. Thus, the *Hunyuan Jing* states: \"If one cultivates the practice, one must perform the thirty-day great practice.\" The *Riyue Xuanzhu Lun* also says: \"Clouds follow the dragon, wind follows the tiger; the Dao of the sun and moon is the ancestral origin.\" Furthermore, Wei Boyang’s *Cantong Qi* states: \"The lunar nodes have five and six; the warp and weft serve the sun’s envoy.\" The *Jinlong Baihu Jing* says: \"One yin and one yang form the guiding principle; advance and retreat are all within the celestial tally.\" The *Guwen Longhu Shangjing* states: \"*Kan* is the essence of the moon, *Li* is the radiance of the sun.\" The ancient sages all aligned with the celestial tally in advancing and retreating, increasing and decreasing fire timing.\n\nThe method of practice states: \"For the preceding water and fire method, proceed exactly as described.\"\n\n**Middle Three Years of Water and Fire Timing:**\nThe first altar configuration is employed in the fourth year, called the *Four Orthodox and Eight Applications of the Zhoutian*.\n\nNow, *Gen* as Metal is like mountains and stones, thus water is born within mountains and stones—this is yin within yang. The *Inner Landscape* says: \"The upper burner is Heaven; the Heart is the numinous palace. The head is the *Gen* mountain; the mouth is the valley cave, the source of water.\" Water is *Kan*, the accumulation of dark yin. Externally, it rises to Heaven, hovering beneath the Flowery Canopy, descending as rain and dew to moisten the Heart Palace—thus it is yin within yang.\n\nThe eight trigrams: *Li* is yang externally and yin internally, like an outer gentleman and an inner petty person. This is akin to cinnabar, which belongs to fire yet conceals mercury, the soul of the Grand Yin Crone, its body clad in five-colored garments. *Li* means \"attached\"; its essence is the sun and moon, possessing the five-colored brilliance of radiant splendor, the luminous hues of rosy clouds. Within it lies the Crimson Palace, which connects upward to the eyes—the eyes are the gates of the Mud Pill Palace. Within the palace resides the spirit, formless and master of Heaven and Earth, the numen of the ten thousand things, called the Primordial Beginning, its virtue harmonizing with non-action.\n\nIf one wishes to cultivate destiny, first clarify the spirit. When the spirit is pure and upright, the myriad evils cannot invade, and all malevolence submits. This is because the Heart is the root of the ten thousand methods, the great medicine of longevity. If the Heart cannot subdue itself, internal treacherous fire arises—just as cinnabar, if not dead, will fly away when exposed to fire.",
      "overlap_context": " for Practice:**\nFollow the five phases within the hexagrams, circulating *Zhoutian* according to the month. If the month has only twenty-nine days, complete the twenty-ninth hexagram and include the thirtieth; likewise, for the nighttime practice, include the thirtieth hexagram if the month has twenty-nine days.\n\n**Timed *Zhoutian* Practice:**\nThe four hexagrams *Qian*, *Kun*, *Kan*, and *Li* serve as the key. The twenty-four lines govern the twenty-four qi, corresponding to the seasonal nodes.",
      "start_char": 4034,
      "end_char": 5345,
      "start_sentence": 227,
      "end_sentence": 286,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.350879430770874,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太清元极至妙神珠玉颗经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "故治心者，生命之主也。 是故天有八极，地有八方，易有八卦，人生八脉，火行八门，水炼八琼，可以四时应象，八卦同图，中合土功，方成进退。 行功口诀日：中宫土功，周流遍身，十五为用。 水火功用依前法，元有其黑，始生万象，八卦甲子，神机鬼藏，阴阳相胜之术，昭然进乎象矣！ 此乃真理也。 中功第二用第五年行名之日月周天又名还元周天 夫混沌开辟，上清下浊，阳黑降而左旋，阴黑腾而右转，故以阳精结而为日，阴精结而为月，日主亏盈，月主弦望，皆在盈亏加臧之内。 周天火候，大小相承，万物负阴而抱阳，应时而生，顺时而煞，得黑而成。 且夫人为万物之首，生如天地之用。 天地先生二仪，以水为真一； 人亦先生二仪，左右肾为枢机，亦名真一。 玄者，水之源也，圣人云一水二火，此是阴中之阳也，故名为元。 夫火生于木，能王其肝，即青龙阳魂也； 水生于金，能王其肺，肺即白虎阴魄也。 四象既全，其土无正形，分王四季。 经云．．一水二火，三木四金，五土。 凡人修行，须当水中发火，左肾属阳为日，右肾属阴为月，故日月昼夜，无时而不运转，方始万物发生。 人若修行，昼夜於十二时中，行日月之道，下手运时，功满三千，黑行八脉，此是神仙下手处也。 夫外运即内转，外气合而内气交，左肾为青龙，真内火也，右肾为白虎，真内水也。 若行百日，积精全神，须当行水火之功，左右皆一周天之数，龙虎二黑，上腾金阙玉户方闭，谓重楼第三环，名日人迎穴，用双手闭之，其黑下降，相接龙虎二黑，中宫自交，情和不醒。 天地，此乃气交而神不交也。 若神全黑壮，交会不施，此乃形交而气不交也。 行功百日，试之必无漏泄，夜无恶梦，阴鬼不侵。 更行周天大火功，九九加臧之数，蒸筋暴骨，炼黑生神，人能行之，万病不侵，千邪不入，可以延年益寿，羽化飞升。 颂日 水内生元火，阳中长一阴，二关通内外，两物转浮沉。 九还龙合虎，七返木交金，枢机日月道，此理最幽深。 又颂日 日月盈亏转两轮，二关黑足可生神，都来一对玄霜子，迷却千千万万人。 经言：日月有数，大小有定，圣功生焉！ ．神明出焉！ ．天者，鼎也，华盖下覆四方。 天者，乾也，金也。 《内境》日：肺宫上为华盖，下覆诸藏，上通於鼻。 鼻为天门，外降呼吸，运动荣卫，循环五藏。 流注一身，动变浮沉，大小有定，亦如天运星斗，地转江河，内与外同，人与天契。 故天门连肺，出入清黑， 为鼎之盖。 地者，鼎之腹，变化万物。 地者，坤也。 《内境》日：脾胃也，包罗水谷，上通於口，口为地户，亦曰咽门。 收纳水谷，下伏胃院，受天门外降之黑，转动消磨，造化水谷，分擘清浊。 谷之清者，升於上焦心肺宫，清争之界，化为神黑精液，长养身命。 谷之浊者，下泄大小肠。 故胃者，造化鼎也。 口为地户，鼻为天门，玄牝中央，名日人中，是三才天地人也。 天门呼吸之气，上符星辰行度； 地户流转之水，内应血脉，所主荣卫，所用胎息，升降之道，根蒂之源。 故内肾为虚极，外肾同日月，内外相应，阴阳自交。 天元用九之功，进退循环之理，以为修养之门也。 经云：深根固蒂，长生久视之道。",
      "translated_text": "Thus, governing the Heart is the master of life. Therefore, Heaven has eight poles, Earth has eight directions, the *Yi* has eight trigrams, man possesses eight vessels, fire moves through eight gates, and water refines eight essences. These may correspond to the four seasons and align with the eight trigrams in a single diagram, uniting at the center with the work of Earth to enable advance and retreat.\n\nThe oral formula for practice states: The work of Earth at the Central Palace circulates throughout the body, employing fifteen as its measure. The functions of water and fire follow prior methods. Only when primordial darkness exists do the ten thousand images arise; the eight trigrams and the sixty cyclical signs conceal divine mechanisms and spectral mysteries. The art of yin and yang overcoming one another is manifestly revealed in the images!\n\nThis is the true principle.\n\nThe second stage of Central Work, practiced in the fifth year, is called the \"Circulation of Sun and Moon\" or the \"Return to the Origin Circulation.\"\n\nWhen chaos first parted, the pure rose above and the turbid sank below. Yang darkness descended and revolved leftward, while yin darkness ascended and turned rightward. Thus, yang essence congealed to form the sun, and yin essence congealed to form the moon. The sun governs waxing and waning, the moon governs crescent and full phases—all within the bounds of waxing, waning, increase, and decrease.\n\nThe fire-timing of the Celestial Circulation inherits both great and small cycles. The ten thousand things bear yin and embrace yang, arising in accord with the seasons, perishing in accord with the seasons, and achieving completion through darkness.\n\nMoreover, man is the chief of the ten thousand things, born to employ the functions of Heaven and Earth. Heaven and Earth first generate the Two Modes, taking water as the True One; man likewise first generates the Two Modes, with the left and right kidneys as the pivot, also called the True One. The mysterious is the source of water. The sage says: one water, two fires—this is the yang within yin, hence named the Origin.\n\nFire is born of wood and governs the liver—this is the Green Dragon, the yang soul. Water is born of metal and governs the lungs—this is the White Tiger, the yin spirit. With the Four Images complete, Earth has no fixed form and rules the four seasons in turn.\n\nThe classic states: one water, two fires, three wood, four metal, five earth.\n\nIn cultivation, one must ignite fire within water. The left kidney pertains to yang and is the sun; the right kidney pertains to yin and is the moon. Thus, sun and moon revolve day and night without cease, giving rise to the ten thousand things. If one cultivates, day and night within the twelve hours, practicing the Dao of sun and moon, beginning with the movement of the hours, completing three thousand works, and circulating darkness through the eight vessels—this is where the immortal begins.\n\nExternal movement corresponds to internal turning; external qi converges as internal qi intermingles. The left kidney is the Green Dragon, the true internal fire; the right kidney is the White Tiger, the true internal water. After a hundred days of practice, accumulating essence and perfecting spirit, one must perform the work of water and fire. Both left and right complete a Celestial Circulation. The two darknesses of Dragon and Tiger ascend to the Golden Gate and Jade Portal, which then close—this is the third ring of the Tower of Numinous Loft, called the \"Man’s Welcome Point.\" Using both hands to seal it, the darkness descends, joining the two darknesses of Dragon and Tiger. The Central Palace naturally unites, emotions harmonize, and one does not awaken.\n\nHeaven and Earth: this is the intermingling of qi, not the union of spirit. If spirit is complete and darkness robust, yet union is not enacted, this is the union of form, not the intermingling of qi.\n\nAfter a hundred days of practice, testing will reveal no leakage or dissipation, no nightmares, and no invasion by yin ghosts. Further practicing the great fire work of the Celestial Circulation, applying the numbers of nine nines and their increases and decreases, steaming the sinews and exposing the bones, refining darkness to generate spirit—one who can practice this will be unassailed by the ten thousand illnesses, untouched by the thousand evils, and may prolong life, extend years, and ascend as a feathered immortal.\n\n**Verse:**\nWithin water, primordial fire is born;\nWithin yang, a single yin grows long.\nThe two passes connect inner and outer,\nThe two substances revolve, floating and sinking.\nNine returns: Dragon unites with Tiger;\nSeven reversals: wood joins with metal.\nThe pivot is the Dao of sun and moon—\nThis principle is most profound.\n\n**Another Verse:**\nSun and moon wax and wane, turning two wheels;\nWhen the two passes’ darkness is sufficient, spirit may be born.\nTogether they are a pair of mysterious frost children—\nYet they have misled thousands upon thousands of people.\n\nThe classic states: The sun and moon have their numbers, the great and small have their measures. From this, sagely work arises! From this, spirit and illumination emerge!\n\nHeaven is the crucible, its canopy covering the four directions. Heaven is Qian, it is metal. The *Inner Landscape* says: Above the Lung Palace is the canopy, covering the various organs below and connecting upward to the nose. The nose is the Gate of Heaven, externally governing inhalation and exhalation, moving the constructive and defensive qi, circulating through the five viscera, flowing throughout the body, dynamically changing in ascent and descent. Great and small have their measures, just as Heaven moves the stars and constellations, Earth turns the rivers and streams. Inner and outer are the same; man and Heaven are in accord. Thus, the Gate of Heaven connects to the lungs, issuing and entering pure darkness—this is the lid of the crucible.\n\nEarth is the belly of the crucible, transforming the ten thousand things. Earth is Kun. The *Inner Landscape* says: The spleen and stomach encompass water and grain, connecting upward to the mouth. The mouth is the Gate of Earth, also called the Throat Gate. It receives water and grain, which descend to the stomach chamber. There, it receives the darkness descending from the Gate of Heaven, moving and digesting, transforming water and grain, separating the clear and turbid. The clear part of grain ascends to the upper burner, the Palace of Heart and Lungs, the boundary of clarity and purity, where it transforms into spirit-darkness, essence, and fluids, nourishing life. The turbid part of grain descends to the large and small intestines.\n\nThus, the stomach is the crucible of transformation. The mouth is the Gate of Earth, the nose is the Gate of Heaven. At the center is the Mysterious Female, called the \"Human Center\"—this is the Three Powers: Heaven, Earth, and Man.\n\nThe qi of the Gate of Heaven’s breathing accords with the movements of stars and constellations; the water flowing through the Gate of Earth corresponds internally to the blood vessels, governing the constructive and defensive qi. The practice of fetal breathing, the Dao of ascent and descent, is the root and source of the stem.\n\nThus, the inner kidneys are the ultimate void; the outer kidneys are like the sun and moon. Inner and outer correspond, and yin and yang naturally unite. The work of Heaven’s ninefold use, the principle of advance and retreat in circulation—this is the gateway to cultivation and nourishment.\n\nThe classic states: \"Deep roots and firm stems are the Dao of long life and enduring vision.\"",
      "overlap_context": "men of the ten thousand things, called the Primordial Beginning, its virtue harmonizing with non-action.\n\nIf one wishes to cultivate destiny, first clarify the spirit. When the spirit is pure and upright, the myriad evils cannot invade, and all malevolence submits. This is because the Heart is the root of the ten thousand methods, the great medicine of longevity. If the Heart cannot subdue itself, internal treacherous fire arises—just as cinnabar, if not dead, will fly away when exposed to fire.",
      "start_char": 5345,
      "end_char": 6577,
      "start_sentence": 287,
      "end_sentence": 337,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.783602237701416,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太清元极至妙神珠玉颗经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "一日进一九功， 二日进二九功， 三日进三九功， 四日进四九功， 五日进五九功， 六日进六九功， 七日进七九功， 八日进八九功， 九日进九九功。 已上每一用四十之数。 十日存上功四十中功四十下功四十， 十一日进九九功， 十二日进八九功， 十三日进七九功， 十四日进六九功， 十五日进五九功， 十六日进四九功， 十七日进三九功， 十八日进二九功， 十九日进一九功。 已上每一用四十之数。 二十日存上宫八十中宫八十下宫八十， 二十一日进一九功， 二十二日进二九功， 二十三日进三九功， 二十四日进四九功， 二十五日进五九功， 二十六日进六九功， 二十七日进七九功， 二十八日进八九功， 二十九日进九九功。 已上每用四十之数 三十日存上田百二十中田百二十下田百二十。 行功诀日．．一依月用行金法，下手功数，即依前项。 上功想上脑，上宫想中院，上田想下丹田。 中宫第三用第六年用名曰混元周天 修炼大丹，须在周天运动，甲子符同，五六相交，气候应节。 一年之数，四序循环，二十四气迁移，七十二候更变，甲庚在戊癸之功，金木定寅申之位，方可炉烹白雪，鼎养黄芽，丹金一变，黑白相符，上下关开，坎离合体，龙腾灭火，时通脊胜之门； 虎引千波，每运泥丸之道。 既得三田药满，果然六府神生。",
      "translated_text": "On the first day, advance the one-by-nine work; on the second day, advance the two-by-nine work; on the third day, advance the three-by-nine work; on the fourth day, advance the four-by-nine work; on the fifth day, advance the five-by-nine work; on the sixth day, advance the six-by-nine work; on the seventh day, advance the seven-by-nine work; on the eighth day, advance the eight-by-nine work; on the ninth day, advance the nine-by-nine work. For each of the above, employ the number forty.\n\nOn the tenth day, visualize the upper work forty times, the middle work forty times, and the lower work forty times. On the eleventh day, advance the nine-by-nine work; on the twelfth day, advance the eight-by-nine work; on the thirteenth day, advance the seven-by-nine work; on the fourteenth day, advance the six-by-nine work; on the fifteenth day, advance the five-by-nine work; on the sixteenth day, advance the four-by-nine work; on the seventeenth day, advance the three-by-nine work; on the eighteenth day, advance the two-by-nine work; on the nineteenth day, advance the one-by-nine work. For each of the above, employ the number forty.\n\nOn the twentieth day, visualize the upper palace eighty times, the middle palace eighty times, and the lower palace eighty times. On the twenty-first day, advance the one-by-nine work; on the twenty-second day, advance the two-by-nine work; on the twenty-third day, advance the three-by-nine work; on the twenty-fourth day, advance the four-by-nine work; on the twenty-fifth day, advance the five-by-nine work; on the twenty-sixth day, advance the six-by-nine work; on the twenty-seventh day, advance the seven-by-nine work; on the twenty-eighth day, advance the eight-by-nine work; on the twenty-ninth day, advance the nine-by-nine work. For each of the above, employ the number forty.\n\nOn the thirtieth day, visualize the upper field one hundred twenty times, the middle field one hundred twenty times, and the lower field one hundred twenty times. The method of practice states: ...follow the monthly metal method in conducting the work, with the initial work numbers as previously described. For the upper work, visualize the upper brain; for the upper palace, visualize the central courtyard; for the upper field, visualize the lower cinnabar field.\n\nThe third application of the middle palace and the sixth year of practice are called the \"Primordial Circulation of the Zhou Heaven.\" In refining the great elixir, one must engage in the movement of the Zhou Heaven, aligning the celestial stems and earthly branches, interweaving the five and six, with the qi phases responding to the seasons. A year’s count cycles through the four seasons, shifting through the twenty-four qi, and alternating through the seventy-two hou. The work of jia and geng resides in wu and gui; metal and wood are fixed in yin and shen positions. Only then can the furnace refine the white snow, the tripod nurture the yellow sprout. When the elixir gold undergoes its first transformation, black and white correspond; the upper and lower gates open, Kan and Li unite. The dragon ascends to extinguish the fire, timely passing through the Gate of the Spinal Victory; the tiger draws forth a thousand waves, each time traversing the Dao of the Mud Pill. Once the three fields are filled with medicine, the six palaces indeed give birth to spirit.",
      "overlap_context": "fensive qi. The practice of fetal breathing, the Dao of ascent and descent, is the root and source of the stem.\n\nThus, the inner kidneys are the ultimate void; the outer kidneys are like the sun and moon. Inner and outer correspond, and yin and yang naturally unite. The work of Heaven’s ninefold use, the principle of advance and retreat in circulation—this is the gateway to cultivation and nourishment.\n\nThe classic states: \"Deep roots and firm stems are the Dao of long life and enduring vision.\"",
      "start_char": 6578,
      "end_char": 7177,
      "start_sentence": 338,
      "end_sentence": 377,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.635507583618164,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太清元极至妙神珠玉颗经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "欲令神黑相交，须用混元之法 周天度二十四气七十二候 春前一节三气九候 立春正月节，一气三用，一用三功。 雨水正月中，一气三用，一用三功。 惊垫二月节，一气三用，一用三功。 春后一节，三气九候 春分二月中，一气三用，一用三功。 清明三月节，一气三用，一用三功。 谷雨三月中，一气三用，一用三功。 夏前一节三气九候 立夏四月节，一气三用，一用三功。 小满四月中，一气三用，一用三功。 芒种五月节，一气三用，一用三功。 夏后一节三气九候 夏至五月中，一气三用，一用三功。 小暑六月节，一气三用，一用三功。 大暑六月中，一气三用，一用三功。 秋前一节三气九候 立秋七月节，一气三用，一用三功。 处暑七月中，一气三用，一用三功。 白露八月节，一气三用，一用三功。 秋后一节三气九候 秋分八月中，一气三用，一用三功。 寒露九月节，一气三用，一用三功。 霜降九月中，一气三用，一用三功。 冬前一节三气九候 立冬十月节，一气三用，一用三功。 小雪十月中，一气三用，一用三功。 大雪十一月节，一气三用，一用三功。 冬后一节三气九候 冬至十一月中一气三用，一用三功。 小寒十二月节，一气三用，一用三功。 大塞十二月中，一气三用，一用三功。 行功诀日．．一气三用者，每一气十五日，每五日於六十时中，择甲子庚申本命，各行一功。 下手法一依月用法，行金法行九转为一功。 下功第－用第七年行名曰妙水周天 天能长且久者，谓得正一真元之道，天地炉鼎之中，阴阳交合於内，不失元黑，而得自然长久之道。 禀天地而生成天地之精，为天地之子，受天地覆育，化成为人，内境亦有天地长久之道。 夫正一者，即水之尊号也。 夫天地之始者，真一也； 五行之机者，真水也； 万物之母者，太玄也。 若人修炼，但妙用真水，运度周天。 若行功到此，外即能生万物，内即能生万神，故云妙用数小功，大名日妙水。 天一甲，自十月一日至十一月六日，水行六口。 地二乙，自十一月七日至十二月十二日，水行五口。 天三丙，自十二月十三日至正月十八日，水行四口。 地四丁，自正月十九日至二月二十四日，水行三口。 天五戊，自二月二十五日至三月三十日，水行二口○ 地六巳，自四月一日至五月六日，水行一口。 天七庚，自五月七日至六月十二日，水行二口。 地八辛，自六月十三日至七月十八日，水行三口。 天九壬，自七月十九日至八月二十四日，水行四口。 地十癸，自八月二十五日至九月三十日，水行五口。 下功第二用第八年行名曰妙火周天 日者天魂，太阳火之精，处上为尊，位居乾艮，夏王冬衰，夜短昼长，内藏阴气，中隐金鹦。 鹦者酉也，外应西方，金石能生其水，乾数小功大名，日妙火。 一日火行八， 二日火行九，",
      "translated_text": "To enable the union of spirit and qi, one must employ the Hunyuan method, circulating through the twenty-four qi and seventy-two hou. Before spring, one segment comprises three qi and nine hou: at the Beginning of Spring (first month’s node), one qi with three applications, each application with three achievements; at Rain Water (mid-first month), one qi with three applications, each application with three achievements; at the Waking of Insects (second month’s node), one qi with three applications, each application with three achievements. After spring, one segment comprises three qi and nine hou: at the Spring Equinox (mid-second month), one qi with three applications, each application with three achievements; at Pure Brightness (third month’s node), one qi with three applications, each application with three achievements; at Grain Rain (mid-third month), one qi with three applications, each application with three achievements.\n\nBefore summer, one segment comprises three qi and nine hou: at the Beginning of Summer (fourth month’s node), one qi with three applications, each application with three achievements; at Grain Full (mid-fourth month), one qi with three applications, each application with three achievements; at Grain in Ear (fifth month’s node), one qi with three applications, each application with three achievements. After summer, one segment comprises three qi and nine hou: at the Summer Solstice (mid-fifth month), one qi with three applications, each application with three achievements; at Slight Heat (sixth month’s node), one qi with three applications, each application with three achievements; at Great Heat (mid-sixth month), one qi with three applications, each application with three achievements.\n\nBefore autumn, one segment comprises three qi and nine hou: at the Beginning of Autumn (seventh month’s node), one qi with three applications, each application with three achievements; at the Limit of Heat (mid-seventh month), one qi with three applications, each application with three achievements; at White Dew (eighth month’s node), one qi with three applications, each application with three achievements. After autumn, one segment comprises three qi and nine hou: at the Autumn Equinox (mid-eighth month), one qi with three applications, each application with three achievements; at Cold Dew (ninth month’s node), one qi with three applications, each application with three achievements; at Frost Descent (mid-ninth month), one qi with three applications, each application with three achievements.\n\nBefore winter, one segment comprises three qi and nine hou: at the Beginning of Winter (tenth month’s node), one qi with three applications, each application with three achievements; at Slight Snow (mid-tenth month), one qi with three applications, each application with three achievements; at Great Snow (eleventh month’s node), one qi with three applications, each application with three achievements. After winter, one segment comprises three qi and nine hou: at the Winter Solstice (mid-eleventh month), one qi with three applications, each application with three achievements; at Slight Cold (twelfth month’s node), one qi with three applications, each application with three achievements; at Great Cold (mid-twelfth month), one qi with three applications, each application with three achievements.\n\nThe method of practice states: \"One qi with three applications\" means that within each qi of fifteen days, for every five days among the sixty hours, select the jiazi, gengshen, and one’s own life hour to perform one achievement each. The method of execution follows the monthly practice: when refining the metal method, nine revolutions constitute one achievement.\n\nThe first application of practice, in the seventh year, is called the Wondrous Water Circulation of the Zhou Heaven. That heaven endures long and perpetually is because it attains the Dao of the Orthodox Unity and True Origin. Within the furnace and tripod of heaven and earth, yin and yang unite internally, not losing the original qi, thereby attaining the Dao of natural longevity. Endowed by heaven and earth, it generates the essence of heaven and earth, becoming the child of heaven and earth. Nurtured by the covering and nourishing of heaven and earth, it transforms into a human, whose inner realm also possesses the Dao of heaven and earth’s longevity.\n\nNow, the Orthodox Unity is the venerable title of water. The origin of heaven and earth is the True Unity; the mechanism of the Five Phases is the True Water; the mother of the myriad things is the Great Mystery. If one cultivates and refines, simply employing the wondrous use of True Water to circulate through the Zhou Heaven, when practice reaches this stage, externally it can generate the myriad things, and internally it can generate the myriad spirits. Thus, it is said that the wondrous use of small achievements is grandly named Wondrous Water.\n\nHeaven One (jia) begins on the first day of the tenth month and lasts until the sixth day of the eleventh month, with water flowing for six days. Earth Two (yi) begins on the seventh day of the eleventh month and lasts until the twelfth day of the twelfth month, with water flowing for five days. Heaven Three (bing) begins on the thirteenth day of the twelfth month and lasts until the eighteenth day of the first month, with water flowing for four days. Earth Four (ding) begins on the nineteenth day of the first month and lasts until the twenty-fourth day of the second month, with water flowing for three days. Heaven Five (wu) begins on the twenty-fifth day of the second month and lasts until the thirtieth day of the third month, with water flowing for two days. Earth Six (ji) begins on the first day of the fourth month and lasts until the sixth day of the fifth month, with water flowing for one day. Heaven Seven (geng) begins on the seventh day of the fifth month and lasts until the twelfth day of the sixth month, with water flowing for two days. Earth Eight (xin) begins on the thirteenth day of the sixth month and lasts until the eighteenth day of the seventh month, with water flowing for three days. Heaven Nine (ren) begins on the nineteenth day of the seventh month and lasts until the twenty-fourth day of the eighth month, with water flowing for four days. Earth Ten (gui) begins on the twenty-fifth day of the eighth month and lasts until the thirtieth day of the ninth month, with water flowing for five days.\n\nThe second application of practice, in the eighth year, is called the Wondrous Fire Circulation of the Zhou Heaven. The sun is the celestial soul, the essence of the Great Yang fire, occupying the honored position above, residing in Qian and Gen. It flourishes in summer and declines in winter, with short nights and long days, internally concealing yin qi and harboring the golden phoenix within. The phoenix corresponds to you (the tenth Earthly Branch), externally aligning with the west. Metal and stone can generate its water. The small achievement of the Qian number is grandly named Wondrous Fire.\n\nOn the first day, fire flows eight times; on the second day, fire flows nine times...",
      "overlap_context": ". Only then can the furnace refine the white snow, the tripod nurture the yellow sprout. When the elixir gold undergoes its first transformation, black and white correspond; the upper and lower gates open, Kan and Li unite. The dragon ascends to extinguish the fire, timely passing through the Gate of the Spinal Victory; the tiger draws forth a thousand waves, each time traversing the Dao of the Mud Pill. Once the three fields are filled with medicine, the six palaces indeed give birth to spirit.",
      "start_char": 7177,
      "end_char": 8373,
      "start_sentence": 378,
      "end_sentence": 437,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.054407119750977,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太清元极至妙神珠玉颗经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "三日火行十， 四日火行十一， 五日火行十二， 六日火行十三， 七日火行十四， 八日火行十五， 九日火行十六， 十日火行十七， 十一日火行十八， 十二日火行十九， 十三日火行二十， 十四日火行二十一， 十五日火行二十一， 十六日火行二十， 十七日火行十九， 十八日火行十八， 十九日火行十七， 二十日火行十六， 二十一日火行十五， 二十二日火行十四， 二十三日火行十三， 二十四日火行十二， 二十五日火行十一， 二十六日火行十， 二十七日火行九， 二十八日火行八， 二十九日火行七， 三十日火行六。",
      "translated_text": "On the third day, fire flows ten times; on the fourth day, fire flows eleven times; on the fifth day, fire flows twelve times; on the sixth day, fire flows thirteen times; on the seventh day, fire flows fourteen times; on the eighth day, fire flows fifteen times; on the ninth day, fire flows sixteen times; on the tenth day, fire flows seventeen times; on the eleventh day, fire flows eighteen times; on the twelfth day, fire flows nineteen times; on the thirteenth day, fire flows twenty times; on the fourteenth day, fire flows twenty-one times; on the fifteenth day, fire flows twenty-one times; on the sixteenth day, fire flows twenty times; on the seventeenth day, fire flows nineteen times; on the eighteenth day, fire flows eighteen times; on the nineteenth day, fire flows seventeen times; on the twentieth day, fire flows sixteen times; on the twenty-first day, fire flows fifteen times; on the twenty-second day, fire flows fourteen times; on the twenty-third day, fire flows thirteen times; on the twenty-fourth day, fire flows twelve times; on the twenty-fifth day, fire flows eleven times; on the twenty-sixth day, fire flows ten times; on the twenty-seventh day, fire flows nine times; on the twenty-eighth day, fire flows eight times; on the twenty-ninth day, fire flows seven times; on the thirtieth day, fire flows six times.",
      "overlap_context": "g the honored position above, residing in Qian and Gen. It flourishes in summer and declines in winter, with short nights and long days, internally concealing yin qi and harboring the golden phoenix within. The phoenix corresponds to you (the tenth Earthly Branch), externally aligning with the west. Metal and stone can generate its water. The small achievement of the Qian number is grandly named Wondrous Fire.\n\nOn the first day, fire flows eight times; on the second day, fire flows nine times...",
      "start_char": 8373,
      "end_char": 8677,
      "start_sentence": 438,
      "end_sentence": 465,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 4.375231504440308,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太清元极至妙神珠玉颗经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "行功诀曰．．一依月用内行法 下功第三用第九年行名曰还返周禾 天地升降，阴阳交会，八卦运动，火候进退，一气三才，虑用九还七返，成功皆因混元之法。 炼气生神，皆在周天之数，合铢两为六十四分，以应六十四卦。 六铢者，六爻也。 一 日阳六铢，阴铢六。 二日阳铢六，阴铢六。 三日阳铢六，阴铢六。 四日阳铢六，阴铢六。 五日阳铢六，阴铢六。 六日阳铢六，阴铢六。 七日阳铢六，阴铢六。 八日阳九铢，阴九铢。 九日阳铢六，阴铢六。 十日阳铢六，阴铢六。 十一．日阳铢六，阴铢六。 十二日阳铢六，阴铢六。 十三日阳铢六，阴铢六。 十四日阳铢六，阴铢六。 十五日阳铢九，阴铢九。 十六日阴六铢，阳六铢。 十七日阴铢六，阳铢六。 十八日阴铢六，阳铢六。 十九日阴铢六，阳铢六。 二十日阴铢六，阳铢六。 二十】日阴铢六，阳铢六。 二十二日阴铢六，阳铢六。 二十三日阴九铢，阳九铢。 二十四日阴铢六，阳铢六。 二十五日阴铢六，阳铢六。 二十六日阴铢六，阳铢六。 二十七日阴铢六，阳铢六。 二十八日阴铢六，阳铢六。 二十九日阴铢六，阳铢六。 三十日阴铢九，阳铢九。 行功诀曰：阳铢闭九息而三咽，阴铢闭六息而三咽。 入室周天 《周易》云：日往则月来，月往则日来，日月相推而明生焉！ ．寒往则暑来，暑往则寒来，寒暑相推而岁成焉。 故立阳爻属乾，阴爻属坤，老阳之数三十六，应四九之象； 老阴之数二十四，为四六之象。 一时行一爻一用仍两卦。 行功诀曰：阳爻闭气三十六息，三咽； 阴爻闭气二十四息，三咽，讫，并努气入丹田道言：剖判上下，开辟两仪，流转五运，配合六气，天轮西转，地水束流，天地之升降，惟人可应之。 复慕阴阳卦相合，离坎爻，左龙右虎，同日月之枢机，北坎南离，随乾坤之造化。 《周易》配定刚柔，爻应六神，时分四象。 每日两卦，用在朝昏，时建一爻交於子午，一月六十卦，以应节符； 十月六百卦，分於火候。 故魏伯阳云：《火记》六百篇，所趣等不殊。 是此说也。 七返还元论",
      "translated_text": "The *Method of Practice* states: ...Follow the internal practice according to the lunar cycle. In the third phase of cultivation, the ninth year is called \"Returning to the Cycle of Harvest.\" Heaven and earth ascend and descend, yin and yang converge, the eight trigrams move, and the fire timing advances and retreats. The single qi encompasses the Three Powers, employing the nine returns and seven reversals, with success rooted in the primordial method of the undifferentiated.\n\nRefining qi to generate spirit relies on the numbers of the celestial cycle, combining grains and ounces into sixty-four parts to correspond with the sixty-four hexagrams. Six grains represent the six lines. On the first day, six yang grains and six yin grains. On the second day, six yang grains and six yin grains. On the third day, six yang grains and six yin grains. On the fourth day, six yang grains and six yin grains. On the fifth day, six yang grains and six yin grains. On the sixth day, six yang grains and six yin grains. On the seventh day, six yang grains and six yin grains. On the eighth day, nine yang grains and nine yin grains. On the ninth day, six yang grains and six yin grains. On the tenth day, six yang grains and six yin grains. On the eleventh day, six yang grains and six yin grains. On the twelfth day, six yang grains and six yin grains. On the thirteenth day, six yang grains and six yin grains. On the fourteenth day, six yang grains and six yin grains. On the fifteenth day, nine yang grains and nine yin grains. On the sixteenth day, six yin grains and six yang grains. On the seventeenth day, six yin grains and six yang grains. On the eighteenth day, six yin grains and six yang grains. On the nineteenth day, six yin grains and six yang grains. On the twentieth day, six yin grains and six yang grains. On the twenty-first day, six yin grains and six yang grains. On the twenty-second day, six yin grains and six yang grains. On the twenty-third day, nine yin grains and nine yang grains. On the twenty-fourth day, six yin grains and six yang grains. On the twenty-fifth day, six yin grains and six yang grains. On the twenty-sixth day, six yin grains and six yang grains. On the twenty-seventh day, six yin grains and six yang grains. On the twenty-eighth day, six yin grains and six yang grains. On the twenty-ninth day, six yin grains and six yang grains. On the thirtieth day, nine yin grains and nine yang grains.\n\nThe *Method of Practice* states: For yang grains, hold the breath for nine cycles and swallow three times; for yin grains, hold the breath for six cycles and swallow three times.\n\n**Entering the Chamber for the Celestial Cycle**\nThe *Book of Changes* says: \"As the sun departs, the moon arrives; as the moon departs, the sun arrives—sun and moon alternate to generate light. As cold departs, heat arrives; as heat departs, cold arrives—cold and heat alternate to complete the year.\" Thus, yang lines are assigned to *Qian*, and yin lines to *Kun*. The number of old yang is thirty-six, corresponding to the four nines; the number of old yin is twenty-four, corresponding to the four sixes. Each hour, one line is practiced, and two hexagrams are employed.\n\nThe *Method of Practice* states: For a yang line, hold the breath for thirty-six cycles and swallow three times; for a yin line, hold the breath for twenty-four cycles and swallow three times. Upon completion, exert force to guide the qi into the cinnabar field, reciting: \"Splitting above and below, opening the Two Modes, circulating the Five Movements, harmonizing the Six Qi—heaven’s wheel turns west, earth’s water flows east. The ascent and descent of heaven and earth can only be matched by humans. Reverently emulate the union of yin and yang hexagrams: the *Li* and *Kan* lines, the left dragon and right tiger, aligned with the pivot of sun and moon; *Kan* in the north and *Li* in the south, following the creation of *Qian* and *Kun*.\"\n\nThe *Book of Changes* establishes firmness and softness, with lines corresponding to the six spirits and time divided into the four images. Each day, two hexagrams are used, applied at dawn and dusk. Each hour, one line is established, intersecting at *zi* and *wu*. One month comprises sixty hexagrams, aligning with the seasonal markers; ten months comprise six hundred hexagrams, distributed in the fire timing. Thus, Wei Boyang said: \"The *Fire Record* has six hundred chapters, yet their purpose is not different.\" This is the meaning. *On the Seven Reversals and Return to the Origin*",
      "overlap_context": "es; on the twenty-first day, fire flows fifteen times; on the twenty-second day, fire flows fourteen times; on the twenty-third day, fire flows thirteen times; on the twenty-fourth day, fire flows twelve times; on the twenty-fifth day, fire flows eleven times; on the twenty-sixth day, fire flows ten times; on the twenty-seventh day, fire flows nine times; on the twenty-eighth day, fire flows eight times; on the twenty-ninth day, fire flows seven times; on the thirtieth day, fire flows six times.",
      "start_char": 8678,
      "end_char": 9565,
      "start_sentence": 466,
      "end_sentence": 517,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.880106210708618,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太清元极至妙神珠玉颗经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "子水至申金为九还，是子还於母，第一顺即为还，逆则为返。 七返从申数至寅，木中有火。 第二却从寅逆还九，至午见火，是离位也。 又却七返，从午回至子，为坎位也。 第三从子还九数至辰，见其土，又从辰返七至戌，为之三物相返，五行见土，方成变化为刀圭。 刀者金也，刀者到也，以斩伐到其所也。 圭者二土也，故土生於金，为黄芽也。 赞曰 三才相连，厚地高天，冲和在中，万物之先。 有凡有圣，有愚有贤，修阴即鬼，修阳即仙。 清静即定，混浊即难，要成大道，须遇真荃。 欲知修炼，精黑神全，真水真火，真汞真铅。 或顺或逆，七返九还，今时得遇，皆是前缘。 古来上圣，口口相传，若修此法，入圣升天。 炼丹咒 稳稳神居，绵绵洞虚，冬后一节，温养吾珠。 九虫尽去，三尸速除，元神奏我，愿赐天符。 胎灵神化，妙达虚元，太上劫摄，急急如律令。 太清元极至妙神珠玉颗经竟",
      "translated_text": "Water of *zi* reaching Metal of *shen* constitutes the Nine Returns—this is the child returning to the mother. The first sequence in order is called \"return,\" while the reverse is called \"reversal.\" The Seven Reversals begin at *shen* and count to *yin*, where Fire resides within Wood. The second reversal then proceeds backward from *yin* through the Nine Returns, reaching *wu* to reveal Fire, which is the position of *Li*. Another Seven Reversals follow, retracing from *wu* back to *zi*, the position of *Kan*. The third sequence counts the Nine Returns from *zi* to *chen*, revealing Earth, then reverses the Seven Returns from *chen* to *xu*. Here, the Three Agents interact in reversal, and the Five Phases manifest Earth, completing the transformation into the *daogui*.\n\nThe *dao* is Metal, and *dao* means \"to arrive\"—to sever and reach its destination. The *gui* is the two Earths; thus, Earth is born of Metal, becoming the Yellow Sprout.\n\n**Eulogy:**\nThe Three Powers connect,\nEarth’s depth and Heaven’s height,\nWith harmony at the center,\nPreceding all things.\nSome are mortal, some sage,\nSome foolish, some wise—\nCultivating yin makes ghosts,\nCultivating yang makes immortals.\nClarity brings stillness,\nTurbidity brings struggle.\nTo achieve the Great Dao,\nOne must encounter the true key.\nTo know refinement:\nEssence, mercury, spirit complete,\nTrue Water, True Fire,\nTrue Mercury, True Lead.\nWhether in sequence or reversal,\nSeven Reversals and Nine Returns—\nThose who attain it now\nDo so by prior cause.\nFrom ancient sages,\nMouth-to-mouth transmission:\nIf one practices this method,\nThey ascend to sagehood and Heaven.\n\n**Elixir Refinement Incantation:**\nSteadfast the spirit abides,\nEndless the cavernous void.\nAfter winter’s first node,\nTemper and nurture my pearl.\nNine worms expelled,\nThree corpses swiftly removed.\nThe primordial spirit petitions me—\nGrant the celestial talisman.\nThe embryo’s spirit transforms,\nSubtly attaining the void’s origin.\nBy the Supreme’s mighty command,\nHasten as the law decrees!\n\n*The Scripture of the Supreme Clarity’s Primordial Ultimate and Most Wondrous Divine Pearl and Jade Grain concludes.*",
      "overlap_context": "ix spirits and time divided into the four images. Each day, two hexagrams are used, applied at dawn and dusk. Each hour, one line is established, intersecting at *zi* and *wu*. One month comprises sixty hexagrams, aligning with the seasonal markers; ten months comprise six hundred hexagrams, distributed in the fire timing. Thus, Wei Boyang said: \"The *Fire Record* has six hundred chapters, yet their purpose is not different.\" This is the meaning. *On the Seven Reversals and Return to the Origin*",
      "start_char": 9565,
      "end_char": 9933,
      "start_sentence": 518,
      "end_sentence": 536,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.893376350402832,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太清元极至妙神珠玉颗经.txt",
        "category": "方法类"
      }
    }
  ]
}