{
  "source_id": "太清金阙玉华仙书八极神章三皇内秘文",
  "source_file": "chunked_daozang\\太清金阙玉华仙书八极神章三皇内秘文.json",
  "total_chunks": 18,
  "total_original_chars": 19721,
  "total_translated_chars": 112624,
  "total_translation_time": 581.1360502243042,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\方法类\\太清金阙玉华仙书八极神章三皇内秘文.txt",
    "category": "方法类"
  },
  "full_translation": "**The Supreme Clarity Golden Palace Jade Flower Immortal Writ of the Eight Poles Divine Chapters and Three Sovereigns’ Esoteric Text**\n\n**Title:** *The Supreme Clarity Golden Palace Jade Flower Immortal Writ of the Eight Poles Divine Chapters and Three Sovereigns’ Esoteric Text*. Author unknown. Mentioning Chen Tuan, it likely dates to the Northern Song. Discusses talismans, incantations, and magical arts. Three scrolls. Base text from *Daoist Canon of the Zhengtong Era*, *Methods* section of the *Dongshen* Department.\n\n---\n\n**Preface to *The Supreme Clarity Golden Palace Jade Flower Immortal Writ of the Eight Poles Divine Chapters and Three Sovereigns’ Esoteric Text***\n\nAt the inception of the Nine Mysteries, when the Two Images had yet to take form, the Void congealed in radiant splendor, and the numinous wind gathered in purity. The divine chapters coalesced within primordial chaos, and the jade script emerged from solitary transformation, standing at the threshold of being and non-being, gleaming before the Dark and Yellow. Sun and moon drew from it to illuminate, Heaven and Earth relied upon it to cover and bear. Thereupon, the Supreme Void Emperor commanded the Primordial Beginning Great Sage to compile it within the Golden Palace, inscribe it upon the Jade Chapters, and conceal it within the Upper Mystery. Before it descended to the lower realms, it was bestowed upon those of the Dao, who received this text. Thus, the Yellow Emperor received the talismans, Fuxi received the diagrams, Gaoxin obtained the celestial scriptures, and Great Yu acquired the *Luo River Writ*—the divine way of descent and revelation began here.\n\nMoreover, the Mysterious Origin pitied the world’s degeneracy and, through successive ages, served as the Emperor’s Teacher. When human ethics grew shallow and false, he bestowed the *Dao* and *Virtue* to restore simplicity; when ghosts and spirits caused chaos, he revealed this text to dispel demons and evil. Thus, the Western Terrace concealed its numinous script, and the Eastern Flower sealed its true secrets. Its dragon-script cloud-seal is not transmitted to the unworthy; those who receive it must not retreat, and those who employ it must guard it with devotion. Though one may not yet attain the Dao of immortality, one may wander the world in this life, having already realized the fruit of earthly immortality. It should be stored in a jade or stone casket, wrapped in a five-colored pouch, and hidden within the cinnabar chamber—never treated with negligence or disrespect.\n\n---\n\n**Scroll One of *The Supreme Clarity Golden Palace Jade Flower Immortal Writ of the Eight Poles Divine Chapters and Three Sovereigns’ Esoteric Text***\n\n**Chapter One: The Subtle Rectification**\n\nThe Heavenly Sovereign Lord said: Before the Great Void, there was silence and formlessness. How did the utmost essence stir and resonate, so that the True One abided therein? The True One moved, and the primordial *qi* transformed of itself. The primordial *qi* held the void within the center and the center within the void—vast beyond measure, subtle beyond perception. Gradually, it thickened in misty fusion, unchanging in primordial unity, the origin of the ten thousand forms, their first signs appearing here.\n\nThat which was clear, bright, and luminous floated to become Heaven; that which was turbid, stagnant, and murky accumulated to become Earth. That which was harmonious, gentle, and compliant congealed to become humans; that which was supremely numinous, firm, and refined transformed into spirits; that which was perverse, dark, and contrary dispersed into other kinds. All were born of the single *qi*, divided into myriad distinctions yet each in its place. Though the myriad movements were tangled and chaotic, all could attain sageliness.\n\nExtinguished, they revived; cycling, they renewed—such is the essence of the Dao and virtue, the heart of humans and spirits. Their resonance is inexhaustible, never departing from the realm of activity. Thus, the Dao is the image of emptiness and nothingness, the root of creation and transformation, the origin of spirit and illumination, the source of Heaven and Earth. Boundless without exterior, infinitesimal without interior, vast and unbounded without end, obscure and fathomless without limit—profound beyond measure, yet its great luminosity sheds light; utterly still and without intent, yet the myriad things take form. In primordial unity, there is no thing; in utter silence, there is no sound. The ten thousand forms arise from it, and the Five Phases are completed through it. That which is born has its limit, that which is completed has its decline. Generation upon generation, completion upon completion—through past and present, it remains serene and unchanging. This is the Dao.\n\nVirtue is what Heaven and Earth receive, what yin and yang rely upon, woven with the Five Phases as warp and the Four Seasons as weft. The ruler governs it, the teacher instructs it. In the unseen and the manifest, in movement and stillness, all flourish as they should. Its grace flows ceaselessly, yet the multitude of beings do not know this as virtue. Thus, the Dao and virtue are the ancestors of Heaven and Earth; Heaven and Earth are the parents of the ten thousand things. The revered one who encompasses the heavens is the guiding principle of emptiness and nothingness; the spirits of the Eight Poles are the handles of Heaven and Earth. The clarity of the sun and moon are the measures of Heaven and Earth; the myriad stars and celestial forms are the changing ways of Heaven and Earth. The Five Phases and Six *Qi* are the pivot and mechanism of Heaven and Earth; emperors, kings, and lords are the masters who govern the Three Powers. The multitude of beings are the shifting *qi* of yin and yang; spirits, demons, ghosts, and monsters are the echoes of Heaven and Earth. Divine mushrooms and immortal herbs are transformations of pure essence and luminosity.\n\nThus, the source of the ten thousand things lies in the Dao and virtue as their root, with the True One as their origin, prior even to the Emperor of Forms.\n\n---\n\n**Chapter Two: The Divine Ancestry**\n\nThe Heavenly Sovereign Lord said: Heaven and Earth cannot generate themselves. That which generates Heaven and Earth is the Supreme Ultimate. The Supreme Ultimate cannot move itself. That which moves the Supreme Ultimate is the true essence. The true essence moves and transforms naturally. That which is spirit and illumination is called the Void Emperor, who dwells in the Ninefold Clarity and oversees the mysterious transformations. The one who governs the myriad spirits is called the Primordial Beginning Lord. The Primordial Beginning Lord is also known as: (1) the True Person of Pangu, (2) the Lord of the Nine Sovereigns, (3) the Divine King of the Eight Poles, and (4) the Great Perfected Holder of the Celestial Net.\n\nThe form of Heaven was like a vast canopy. The sun and moon had not yet shone, the stars had not yet gleamed. The Mysterious Origin was empty and boundless, vast and obscure, silent and still—chaotic and nameless. Above, there was nothing to which it was tethered; below, nothing to which it was rooted. Above, there were no Eight Poles; below, no Five Peaks. Above, there was no change or communication; below, no pivot or mechanism. Then the Primordial Beginning Lord emerged within this primordial unity. Constantly inhaling and exhaling the primordial *qi*, he later generated change and communication. Stirred by the true essence, he reached the Supreme Ultimate’s single *qi*, which divided to form the Two Modes. Above, the Three Clarities were arrayed; below, the Four Great Kalpas unfolded. After another forty thousand kalpas, the Earth gave birth to Gangxu, Gangxu gave birth to Binqian, Binqian gave birth to the dragon, the dragon gave birth to water, and the blood of the shore stones and mountains transformed into the Great Primordial Lesser Mother.\n\nThe Great Primordial Lesser Mother gave birth to one capable of human speech, whose form and countenance were surpassingly wondrous. She roamed between the earth and the hidden realms, inhaling and exhaling primordial *qi*. The Primordial Beginning Lord perceived this and communed with her in *qi*, whereupon the sun and moon gained their radiance, the stars their brilliance. The Five Movements self-differentiated, and the Six *Qi* self-rectified.\n\nAfter another forty thousand kalpas, the Primordial Beginning transformed into the True Person Pan Gu, who opened her left heart and small intestine, enabling her to bear offspring. After yet another forty thousand kalpas, the Heavenly August Sovereign was born, possessing thirteen heads. The Heavenly August Sovereign begot the Earthly August Sovereign, and the Earthly August Sovereign begot the Human August Sovereign—these are the esoteric methods of the Three Sovereigns, the very essence of this tradition.\n\nThereafter, the Five Directions were arrayed, forming the spirits of the Five Peaks, who became the lords of the Five Phases. In heaven, they are the Five Stars and Five *Qi*; on earth, the Five Phases and Five Peaks. In the east is the spirit of the Eastern Peak, lord of yang wood. In the south is the spirit of the Southern Peak, lord of radiant fire. In the west is the spirit of the Western Peak, lord of great brilliance. In the north is the spirit of the Northern Peak, lord of numinous governance. At the center is the spirit of the Central Peak, the Yellow Emperor of the Gongsun clan. He serves as the pivot of the myriad images and holds the register of harmonious exchange.\n\nWithin the Great Canopy of Heaven, the Eight Heavens of the Thirty-Two Emperors, and the Eight Poles with their seven hundred twenty lords, there are thirty-six Cavern-Heavens of emptiness and void, along with the gods of the Eight Directions who subdue demons.\n\nThe Upper Three Heavens of Radiance:\nThe Azure Radiance’s Four Cavern-Heavens:\nThe Cavern-Heaven of the Solar Essence Treasure Register, wherein the lord of solar light presides as sovereign, the Son of the Great Yang as patriarch, followed by divine kings and immortals. All within govern the illumination of the world.\nThe Cavern-Heaven of the Lunar Splendor Luminous Response, wherein the yang spirit of the Great Yin Star presides as sovereign, the Maiden of Lunar Splendor as matriarch, followed by divine kings and immortals. All within govern the interchanges of stars and constellations, the alternations of yin and yang, the fortunes and misfortunes of the myriad things.\nThe Cavern-Heaven of the Southern Dipper’s Life-Registering, wherein the Great Emperor of Longevity of the Southern Dipper presides as sovereign, the Star Lord of Longevity as matriarch, followed by divine kings and immortals. All within govern the records of sentient beings in water and on land, their nobility and baseness, and hold the registers of life and death for all living things.\nThe Cavern-Heaven of the Northern Dipper’s Seven Talismanic Registers, wherein the Great Emperor of the Purple Tenuity of the Northern Pole presides as sovereign, followed by divine kings and immortals. All within govern the bestowal of blessings and retribution in rituals, the severance of demonic influences, and the eradication of malevolent spirits.\n\nThe Wind Radiance’s Four Cavern-Heavens:\nThe Cavern-Heaven of the Treasure Flower Divine Light, the Cavern-Heaven of the Supreme Simplicity Pure Yang, the Cavern-Heaven of the Golden Flower Western Jade, and the Cavern-Heaven of the Accumulated Essence Absolute Purity. The gods and immortals of these four cavern-heavens all govern the office of civil brilliance and hold authority over the affairs of the netherworld.\n\nThe Cloud Radiance’s Four Cavern-Heavens:\nThe Cavern-Heaven of the Great Void Divine Response, the Cavern-Heaven of the Seven Luminances Flaming Demon, the Cavern-Heaven of the Void Boundary Blade Profit, and the Cavern-Heaven of the Eight Poles Tranquil Crossing. The gods and immortals of these four cavern-heavens all govern the severance of the Ten Good Deeds and oversee the office of immortal ascension.\n\nBeyond these Three Heavens of Radiance, from below to above, the center serves as the measure—this is the realm above the Celestial Pass.\n\nThe Middle Three Heavens of Radiance:\nThe Mist Radiance’s Four Cavern-Heavens:\nThe Cavern-Heaven of the Purple Ultimate Tranquil Brahma, the Cavern-Heaven of the Divine Radiance Jade Clarity, the Cavern-Heaven of the Yang Brightness Vermilion Phoenix, and the Cavern-Heaven of the Eastern Florescence Azure Youth. The gods and immortals of these four cavern-heavens all govern the affairs of the water palaces, earthly deities, sea mountains, and blessed lands, as well as the offices of the island immortals of the Three Isles and Ten Continents, earthbound immortals, sword immortals, and those who cultivate virtue and practice the Dao.\n\nThe Rosy Radiance’s Four Cavern-Heavens:\nThe Cavern-Heaven of the Feathered Wind Void Whiteness, the Cavern-Heaven of the Supreme Simplicity Harmonious Yang, the Cavern-Heaven of the Jade Clouds Upper Perfected, and the Cavern-Heaven of the Primordial Beginning Assembly of Immortals. The gods and immortals of these four cavern-heavens all attain the merit of the six transformations of yang brightness and the great changes of yin essence, governing the ascension of immortals and holding the offices of the Southern Palace.\n\nThe *Qi* Radiance’s Four Cavern-Heavens:\nThe Cavern-Heaven of the Supreme Beginning Jade Clarity, the Cavern-Heaven of the Supreme Harmony Four Sages, the Cavern-Heaven of the Divine Radiance Demon-Subduing, and the Cavern-Heaven of the Heavenly Flower Upper Minister. The gods and immortals of these four cavern-heavens all govern the passage of *qi* through kalpas, the ethereal and corporeal souls of the sun and moon, the conjunctions and deviations of stars, the rise and fall of rulers, the majestic *qi* of heaven and earth, and the gathering of wind and rain.\n\nAbove this center, the Three Heavens of Radiance condense the essence of yang’s origin, connecting with the cosmos, congealing true *qi*, forming palaces and courts, and belonging to the realm of the Three Bounds.\n\nThe Lower Three Heavens of Radiance:\nThe Scenic Radiance’s Four Cavern-Heavens:\nThe Cavern-Heaven of the Great Clarity Golden Portal, the Cavern-Heaven of the Divine Perfected Mysterious Transformation, the Cavern-Heaven of the Lord of Wood and Queen Mother of Metal, and the Cavern-Heaven of the Three Primordials Ultimate Change. These four cavern-heavens are presided over by the Great Emperor of Jade, with divine kings and immortals within. All govern the affairs of heaven above, earth below, and the netherworld, the Three Systems and Seven Governances, and hold authority over the myriad matters.\n\nThe Azure Radiance’s Four Cavern-Heavens:\nThe Cavern-Heaven of the Azure Void Supreme Unity, the Cavern-Heaven of the Purple Essence Night Light, the Cavern-Heaven of the Essence Flower Great Void, and the Cavern-Heaven of the Jade Yang Ultimate Non-Being. The gods and immortals of these four cavern-heavens are presided over by the Great Emperor of Jade and govern all affairs of the heavenly immortals, heavenly officials, and the gains and losses of heavenly beings.\n\nThe Cinnabar Radiance’s Four Cavern-Heavens:\nThe Cavern-Heaven of the Brocade Forest, the Cavern-Heaven of the Cloud Forest, the Cavern-Heaven of the Divine Essence, and the Cavern-Heaven of the Great Canopy. These four cavern-heavens are jointly presided over by the Earthly August Sovereign and the Heavenly August Emperor, with divine kings and heavenly officials within. All govern the sacred teachings of the Three Clarities, the numinous texts of the Eight Poles, and the examination of immortal scriptures and divine talismans.\n\nAbove the Nine Heavens of Radiance and beyond the Eight Poles lies the Heaven of the Great Canopy. Within it is the Sacred Realm of Jade Clarity, the Supreme Sacred Ancestor, the Supreme Immortal Lord, the Mother of the Great Dao, and the Lord of the Single *Qi*, known as the Primordial Beginning.\n\nWithin it lies the True Realm of Supreme Clarity, the abode of the Primordial August Lord of the Great Dao. Therein lies the Immortal Realm of Grand Clarity, the abode of the Most High Lord Lao. Upon the Mountain of Jade Capital grow forests of pearls and purple fruits, with jade blossoms and phoenix marrow flourishing above. Within are eighty-one paths, connecting to the eighty-one cavern-heavens of the mortal world.\n\nThe ancestral sages of Heaven, the ancestral lords of Heaven, the divine kings of Heaven, the imperial lords of Heaven, the heavenly officials of Heaven, the heavenly immortals of Heaven, the heavenly beings of Heaven, the great sages of Heaven, the spirits of the Nine Heavens of Radiance, and the lords of the Five Marchmounts—all gather at the Mountain of Jade Capital once every five days. Within the Three Realms, before the Primordial Beginning, though the distance spans the Eight Heavens and Nine Earths, myriad leagues in all directions, all assemble in but a moment.\n\nBeneath the Five Marchmounts, the earthly immortals preside as follows: the True Martial True Lord of the North. Born into the mortal world, he accumulated hidden merits from his ancestors, from youth admired the true wind, and from early years cultivated the Daoist arts. He mastered the origins and currents of creation and deeply probed the wondrous principles of divine transformation. The Lord of Jade Clarity bestowed upon him ten celestial scriptures of the *Slaying Ghosts Jade Texts*, iron mirrors and bronze talismans to dispel yin spirits and demonic illusions. With unbound hair, he wields the jade celestial blade of Jade Clarity, dons the feathered robes of the Eight Trigrams, and treads upon the celestial tortoise and serpent.\n\nThe Director of Fates of the Southern Marchmount is Lady Wei of Sui. The Director of Fates of the Eastern Marchmount is Lady Wang of Purple Tenuity. The Director of Fates of the Western Marchmount is the thirteenth beloved daughter of the Queen Mother of the West. The Director of Fates of the Northern Marchmount is Lord Cui, a Tang minister. The Director of Fates of the Central Marchmount is Lord Li Jing, a Tang minister. The Officers of Sin and Fortune of the Three Primes are the Three Mao True Lords.\n\nThe wife of the Grand Beginning became the Lady of Emei Mountain; Zhang Liang of Han became the Lord of Wangwu Mountain, overseeing the affairs of those drowned in the five lakes, four seas, three ravines, and nine rivers. Master Wang Xi became the Immortal Lord of the Upper Island of Penglai; Master Juanzi of Great Radiance became the Immortal Lord of the Middle Island of Penglai. The True Lord Xu presides over the Palace of Cinnabar Terrace, managing the merits and conduct of immortals throughout the world. Lord Yang became the Lord of Tiantai Mountain and later the Jade Emperor’s celestial scribe. Shao Jian became the master of the Lesser Grotto of Mount Lu; Master Chen Tuan oversees the Immortal Lord of the Lower Island of Penglai. Zhongli Jia presides over the Immortal Lord of the Jasper Terrace Palace and concurrently serves as the Great Preceptor of the Southern Continent, expounding the Dharma.\n\nThus, the seventy-two blessed lands, eighty-one cavern-heavens, minor immortals of the ten continents and three islands, hidden scholars of the nine earths, ghostly officials of the netherworld, divine lords of Fengdu, minor spirits of mountains and waters, and riverine and maritime deities—all Daoist adepts who have not yet ascended to Heaven—are not recorded in the Jade Register, nor are their names inscribed upon the Golden Tablet.\n\n**Chapter Three: The Ghostly Lineage**\n\nGhosts are the utmost numinous beings without form, empty and spiritually quiescent, their wondrousness like an echo in a valley that does not flow.\n\n**The Eight Ghosts of the East:**\n1. The Yin-Corpse Ghost, dwelling in the East, appearing as a young child, often transforming into a woman’s form to follow celestial spirits.\n2. The Luo-Da Ghost.\n3. The Yang-Ming Ghost.\n4. The Crimson Phoenix Ghost.\n5. The Lone Blossom Ghost.\n6. The Great Spring Ghost.\n7. The Wen-Ming Ghost.\n8. The Divine Demon Ghost.\n\nThese eight ghosts are upright spirits employed by celestial deities, without selfish intent to harm mortal lives. They all reside in the position of the Year-Star’s virtue in the East.\n\n**The Eight Ghosts of the South:**\n1. The Wu-Luo-Na Ghost.\n2. The Celestial Great Matron Ghost.\n3. The Earth-Thunder Ghost.\n4. The Spirit-Numinous Ghost.\n5. The Nine-Corpse Ghost.\n6. The Wooden Well Ghost.\n7. The Sun Dao Celestial Spirit Ghost.\n8. The Oxherd and Weaver Girl Ghost.\n\nThese eight ghosts each have the head of a rooster and the body of a human, clad in yellow gauze robes with vermilion flames. They follow celestial spirits as officers of wind and hail, residing in the position of the Fire Star’s virtue in the South.\n\n**The Eight Ghosts of the West:**\n1. The Pure-Living Ghost.\n2. The Wu-Na-Po-Corpse Ghost.\n3. The Bewitching Ghost.\n4. The Hoary Camel Ghost.\n5. The Barbarian-Changing Ghost.\n6. The Celestial Star Ghost.\n7. The Imperial Roaring Ghost.\n8. The Yin-Demon Ghost.\n\nThese eight ghosts are upright and without private malice, following celestial spirits to judge and execute the wicked and unjust. They reside in the position of the Grand White Star.\n\n**The Eight Ghosts of the North:**\n1. The Yaksha Ghost.\n2. The Fu-Luo Ghost.\n3. The Human Emperor Ghost.\n4. The Auspicious Transformation Ghost.\n5. The Bo-Li Ghost.\n6. The Demon-Mouth Ghost.\n7. The Executioner Ghost.\n8. The Golden Phoenix Maiden Ghost.\n\nThese eight ghosts serve as the martial forces of the Northern Emperor, upright and without deceit, ever following the Northern Emperor to sweep away all harmful spirits. Their forms resemble celestial spirits, and they reside in the position of the Danger Star and Chronographic Star in the North.\n\n**The Eight Ghosts of the Center:**\n1. The Monk-Roaring Ghost.\n2. The Crying-Roaring Ghost.\n3. The Tail-Star Ghost.\n4. The Sea-Slaying Ghost.\n5. The Six-Ding Ghost.\n6. The Six-Jia Ghost.\n7. The Jade Maiden Ghost.\n8. The Five Paths Ghost.\n\nThese eight ghosts also follow celestial spirits, accompanying the Five Marchmounts to pursue the dead and deliver karmic retribution. Their forms resemble divine beings, and they reside in the position of the Quelling Star in the Center.\n\nThe Heavenly August Lord said: These forty celestial ghosts of the five directions are the upright officers of the Five Marchmounts, the righteous soldiers of the five directions, and the celestial spirits’ employment of the upright *qi* of emptiness and non-being. They assist the virtue of Heaven and Earth, wielding wind and thunder, following the aides of the Five Marchmounts to sweep away deceit and treachery. Each of the five-directional ghosts commands a host of three hundred thousand spirit-soldiers, aiding the upright *qi* of Heaven and Earth.\n\nTo employ and command the ghosts of the five directions, there is also a method.\n\nOn Metal Days, command the eight ghosts of the West; on Wood Days, the eight ghosts of the East; on Fire Days, the eight ghosts of the South; on Water Days, the eight ghosts of the North; and on Earth Days, the eight ghosts of the Center.\n\nTo employ them, first inscribe the True Form Talisman of the Heavenly August Lord upon yellow silk, five *cun* in length and width. Write it in cinnabar, burn it to ash, and swallow it with fragrant water while facing the Gate of Heaven. Once the talisman enters the abdomen, one’s spirit transforms instantly—all ghosts bow in submission upon seeing it, and all spirits submit and return, serving as guardians to shield against external harm.\n\nThen, on the corresponding day, write the name of one ghost upon white paper, hold it directly before the Gate of Heaven, recite the Heavenly August Lord’s incantation three times, draw *qi* three times, and blow it onto the seal. Coat the seal with cinnabar, face the direction, call the ghost’s name loudly once, and press the seal onto the paper. With each impression of the ghost’s name, the ghost manifests—sometimes as a Jade Maiden of the Six Dings or Six Jias. Question the ghosts in detail, and all their revelations will conform to your wishes. They may appear as a gentle breeze, a wisp of mist, clouds and rosy dawn, or transform into dragons and tigers, myriad forms of things, the bodies of mountains, forests, and cliffs, sheep or horses, flying or running creatures. They may ride clouds and cranes to roam beyond the world or swiftly traverse the Four Great Continents, observing all matters. To resolve injustices, take a sword one *chi* and two *cun* long, with a sharp, protruding blade. Hold the sword in the left hand toward the Gate of Heaven, grasp the Heavenly August Lord’s seal in the right, recite the Heavenly August Lord’s incantation three times, draw *qi* three times, blow it onto the seal, coat the seal with cinnabar, and press the tip of the sword with the seal before casting it into the air. The ghost will instantly comprehend your intent—even if separated by thousands of miles or vast rivers and seas, the target’s head will fall in an instant.\n\nThe Heavenly August Lord said: Long ago, there was a divine sage named Master Zhi Xu, who, before mastering inner mysteries, first grasped the principles of transformation. As he began his journey, he roamed beyond the Four Seas at will. Thus, in commanding the myriad spirits and attaining the multitude of wonders, none transcended this text. For those who encounter it, focus on emptiness and purity; do not let passions and desires violate these precepts. Align the heart with uprightness, guard the mind with Great Harmony, forget worldly concerns and embrace simplicity, gradually entering the lineage of immortals. If the Six Dusts remain unceasing, worldly attachments linger, desires persist, and mundane habits endure, one diverges from my teachings.\n\n**Section on the Lineage of Spirits**\nThe Heavenly August Lord said: Beyond the celestial ghosts of the five directions, all lesser spirits belong to the lineage of *jing* and *mei*. Though their anomalies differ, they cannot aid the virtue of the upright *qi* and all belong to the category of private gods and demonic spirits. With my imperial seal and my imperial incantation, they manifest immediately and can be commanded like household servants. My method employs spirits as fiercely as wildfire burning autumn down, and commands ghosts as swiftly as ocean waves sweeping away withered leaves.\n\nBeyond the upright spirits and upright ghosts, there are seventy-two *jing* spirits, which will be described in detail later. These ghosts are unclaimed by Heaven, ungoverned by Earth, unruled by the Five Marchmounts, unbound by mountains and seas. They do not follow great virtue nor aid the true wind, delighting in killing and chaos, lewdness and bloodshed. Such unrighteous ghosts are called private gods.\n\nOne is named the *Mo Hun Tun Shi Jing* (Demon-Soul Corpse-Devouring Spirit), appearing as a sixteen-year-old girl with a cinnabar face, vermilion lips, green eyebrows, and rosy cheeks. Her eyes are as clear as autumn waters, her body as smooth as congealed fat. She favors emerald robes and wears a moth-winged crown atop her head. Most who see her mistake her for an immortal maiden. She transforms into towers and palaces, using demonic *qi* to alter halls and chambers, causing illnesses and disrupting the mysterious wind, hindering the well-being of cultivators. This ghost spirit is surnamed Ren, with a single purple hair between her left eyebrow, about an inch long. Originally a ten-thousand-year-old fox, she has lived through countless ages, transforming into a seductive form to bewitch many. When Daoist cultivators encounter her in the mountains, they need only call her by her lesser name, *Mo Hun Tun Shi Gui*, and upon hearing it, her form vanishes instantly. Thus, knowing the root dispels the unholy.\n\nAnother is named the *Wu Tong Si Shen Zhi Gui Jing* (Five-Unions Private God Ghost Spirit), appearing as a handsome man with a single foot. He wanders the world, causing lewdness and disorder in people’s homes, sometimes lingering for years without departing. He originated from a household servant who, after death, gained the power of the Five Unions. In modern times, when women claim to share a bed with their husbands yet experience strange laughter, weeping, sudden deaths and revivals, or hear voices laughing in the air, speaking without cause, or when possessions vanish inexplicably, it is often this spirit afflicting them. To expel him, use a five-*cun* piece of yellow paper, inscribe the True Form Talisman of the Heavenly August Lord in cinnabar, burn it to ash, and have the afflicted woman swallow it with fragrant water while facing the Gate of Heaven. Hold the Heavenly August Lord’s seal toward the Gate of Heaven, recite the incantation three times, draw *qi* three times and chant it into the seal, then write the name of the Five Unions on white paper. Coat the seal with cinnabar, press it onto the paper, and have the woman carry it in a red silk pouch on her head. The spirit will vanish immediately.\n\nOne is named the *Mao Mao Shen* (Cat-Fur Spirit), appearing as a man over thirty, dressed in black with bare feet and chicken-like claws. He often possesses women, falsely claiming the title of a celestial spirit and foretelling the future. Modern *shi po* (spirit mediums) are often possessed by this spirit, which originated from the restless soul of a wrongfully deceased person.\n\nAnother is named the *Xue Shi Shen* (Blood Corpse Spirit), appearing as a monkey covered in bird-like fur, with red eyes and white eyebrows. It may transform into a snake, spider, or shrimp-like form. It often possesses women, consuming their visceral essence and drinking their blood, causing emaciation, illness, and death. After killing, it assumes its original form and enters another person’s body. Modern cases of consumptive diseases passed between men and women are examples of this.\n\nThe essence of this spirit originates from the old dog spirit of the *Tun Mao* (Feather-Swallowing) nation. Another name is the *Zhu Jiao Bai Fu Gui* (Pig-Horned White-Bellied Ghost). Its essence appears as a child of seven or eight, clad in purple with black feet, often transforming into the likeness of grain or water. If one mistakenly consumes it, it causes illness—silent, speechless, and leading to death—known as the \"speechless disease.\" Daoist practitioners who desire only to drink water, their faces lacking luster, or those who lose their appetite at the sight of food, are afflicted by this entity within. Beware of consuming it.\n\nThis ghost arises from the restless soul of a woman who died in childbirth. Another name is the *Nü Cha Jing* (Female Fork Spirit), resembling a coarse, ill-favored woman in blue robes. It often possesses the bodies of children at night, stealing their souls and causing them to cry incessantly. Another is the *Tiao Liao Jing Gui* (Whipped Sprite Ghost), commanding three or four child-like attendants of varying forms—some with donkey heads and human bodies, yellow robes and red faces, carrying a sack filled with malevolent qi. It roams the eight directions, spreading pestilence among people. Modern references to epidemic diseases (*tian xing bing*) are manifestations of this ghost, which transforms into miasmic vapors.\n\nThis ghost emerges from unbalanced *qi* of the Five Phases, formed from the restless souls of the wrongfully deceased. Another name is the *Yao Chai Qu Shi Shen* (Biting-Breaking Crooked Stone Spirit), appearing as a young maiden with delicate beauty. It may transform into a human figure, fond of nocturnal slumber, and in dreams, it engages in yin-yang unions to steal a person’s true qi. This ghost originates from those who practiced *cai yin* (yin absorption) meditation but failed, also called the *Qing Ling Shan Shuang* (Clear Spirit and Bright Soul) ghost. Modern accounts of nocturnal ghostly unions refer to this. Unclaimed by celestial bureaus or earthly deities, it is a private spirit of heaven and earth, the essence of the eight mountains.\n\nAnother is named *Lei Sheng Ji* (Thunderous Roar), resembling a crouching tiger with a flowered, green neck. It roams high peaks at night but poses no harm to humans—it is the essence of a millennium-old copper vein. Another is *Chun Qiong Quan* (Spring Jade Spring), appearing as a sixteen-year-old girl with three buns, yellow robes, a long skirt, and bare feet, often holding fire and walking at night, extinguishing after a few steps. It is the essence of a millennium-old gold ore.\n\nAnother is *Shu Shao Nian* (Bound Youth), resembling a small boy with a hat and loose shoes, dressed in white with a refined appearance. It often appears at sunrise, holding a bird or fish, playing on human paths—it is the essence of a millennium-old silver vein. Another is the *Shuang Shi Shi Jing* (Double Stone Corpse Essence), with crimson, disheveled hair, tattered green robes, and green eyes, towering over ten feet tall. It lurks in mountains, responding to people, calling their names, and often causes rockslides or rolling stones in treacherous terrain, harming many. It arises from the unclaimed, solitary souls of those crushed to death by stones in the mountains. Unclaimed by heaven or earth, unrestrained by rivers, it harms living beings and takes lives.\n\nAnother is the *Yu Bai Shui Hao Jing* (Fish-White Water-Wasting Spirit), fiercely lurking in ponds. It transforms into the likeness of a drowned woman floating by the water’s edge. Those who see it and attempt to rescue her often drown—this entity is the essence of a restless soul who drowned. Another is the *Zhu She Bai Mian Jing* (Crimson Snake White-Faced Spirit), a ghostly form often seen by water, calling out to demand a replacement. If one encounters it and walks ten steps, the ghost exhales its qi, overpowering the person’s will and causing them to drown. This, too, is the essence of a drowned soul.\n\nAnother is *Wang Yu Zhen*, appearing as a small girl in an ornate crown and splendid robes, with delicate bones and a lovely face, dressed in blue with crimson shoes. She is often accompanied by two or three maidservants. This ghost frequents empty houses, rocky cliffs, walled altars, and secluded mountain depths, bewitching young men, nine out of ten of whom die. Those who see her have a single blue hair between their right eyebrows, about two inches long. She loves songs and poetry, and as dusk falls, she enchants the hearts of men. Many such cases exist in mountain valleys. Her essence originates from a three-thousand-year-old white snake spirit.\n\nAnother is the *Qiu Cao Ye Jing* (Autumn Grass Leaf Spirit), appearing as a young maiden with a moist complexion and a restrained demeanor, her hair wrapped in red silk. If encountered, she is often followed by five to seven companions. She can transform water into wine and is skilled in recitation. This entity dwells in vast pools, remote paths, and secluded mountain valleys with sparse populations and lush flora. It arises from the essence of an ancient, arching rat.\n\nAnother is the *Zhu Mei Hun* (Crimson-Browed Soul), resembling a malevolent ghost with two heads on one body, horse feet, tiger hands, a red, naked form, and a height of over ten feet. It often deceitfully claims to be a divine person or falsely poses as a local earth deity. Those unaware of its origins who offer incense and worship over time will inevitably have their lives taken. Its essence comes from an ancient tree spirit.\n\nAnother is *Huo Gong Sun*, resembling a flying bird with two heads on one body, colorful feathers, and a red beak, about the size of a chicken. This entity can also drain a person’s spirit through breath, gradually leading to death. It is the essence of a thousand-year-old soaring spirit. Another is the *Hai Seng Ni* (Sea Monk Nun), appearing as a fish with the form of a woman, her face and head strikingly beautiful, wearing a bone crown and bone hairpin. She roams mountains and waters, sometimes entering rivers and seas. When she encounters people, she often exhales, mixing water vapor with her breath to strike them—none survive. Hence, she is called the \"fish with a woman’s head,\" known for her eloquence. She is the essence of an ancient human soul.\n\nAnother is the *Lu Shen Jie Shi Jing* (Deer-Bodied Precept Corpse Essence), appearing human in the form of a woman dressed in white mourning clothes, often weeping by the water’s edge. Those who see her and attempt to inquire are doomed—this entity is the essence of a thousand-year-old carp. Another is the *E Du Gui* (Vicious Poison Ghost), appearing human but often unseen. If one mistakenly enters water, it seizes their feet, preventing escape and leading to death. None can break free.\n\nOne is the *Huang Xiao Bai Mian Jing* (Yellow-Mourning White-Faced Essence), appearing as a small serpent with vermilion scales and five feet, often roaming near wells. Those who see it mistake it for someone about to leap into the well, compelling them to act against their will and drown. This entity is the transformed essence of a strong soul from those who died by throwing themselves into wells.\n\nAnother is the *Xing Zha Po* (Star-Chattering Crone), a mass of black qi coiled around the mouth of a well. Anyone who sees it inevitably falls in and dies. This is the vengeful spirit of a well-spring ghost.\n\nAnother is the *Quan Quan You Hun Jing* (Utterly Hidden Ghost Essence), whose form is invisible, lurking in the depths of water. Often, one hears only its wails and laughter. It stirs clouds and mist and can harm human lives, unclaimed by heaven or earth, ungoverned by the Five Peaks. This entity originates from the essence of a thousand-year-old crab.\n\nAnother is the *Xia Jia Du Jing* (Summer Charm Poison Essence), resembling a white serpent with a horn atop its head. It often hides within women’s bellies, causing their faces to yellow and their hair to fall out. During difficult childbirth, it transforms into a white serpent and vanishes in a flash of light. This is the essence of the yin-toxic qi of a rotting corpse.\n\nAnother is the *Huang Yuan Tian* (Yellow Distant Heaven), appearing ghostlike and often concealed within women’s bellies. It speaks to the mother from within, though the woman’s life will not be long. This is the transformed essence of a thousand-year-old plant spirit.\n\nAnother is the *Zhang Yan Zui* (Zhang Yan the Most), taking the form of a disheveled woman in tattered clothes, fond of stealing from households. Those who glimpse its true form encounter it as the vengeful spirit of a wronged ghost, originally the soul of a household servant.\n\nAnother is the *Liu Yuan Heng* (Liu Yuan the Perverse), resembling an infant and capable of transforming to follow objects. Often, it inhabits clay figurines, so when families worship and offer to such idols, they later gain uncanny efficacy—only for the entity to bring misfortune and calamity. This is the essence of an ancient clay effigy.\n\nAnother is the *Gao Yang Ge* (Gao Yang the Elder Brother), appearing as a coarse young woman with a penchant for lewdness. If she engages with a person, they may die from obsessive attachment, only for her spirit to return and possess another. This is the essence of a strong soul from the dead.\n\nAnother is the *Yue Niang Jing* (Moon Maiden Essence), taking the form of a woman with a fondness for lust and desire. Often inhabiting clay deities, she appears in temples as a woman of refined beauty, inspiring infatuation. By dusk, she arrives to seduce her victim—this is the transformed essence of a spirit idol.\n\nAnother is the *Ma Yuan Shi Zi Jing* (Horse Origin Lion Essence), a brotherhood of five, appearing as naked, red-bodied ghosts. One carries a fan, another a small gourd, and a third a qi pouch. These four spirits and five demons bring misfortune, commanding wind and sand to afflict the living with chills and fever, driving them to crave icy water—symptoms of malaria. They are the Five Directions’ Five Wasting Ghosts.\n\nAnother is the *Du Chang Jing* (Du Chang Essence), shaped like a black rat, fond of wandering through halls and chambers of human dwellings to cause strange losses. When items in granaries or storerooms inexplicably vanish or spoil, this is its doing. It is the essence of a thousand-year-old rat.\n\nAnother is the *She Huang Xiao Shi Jing* (Earth Altar Filial Corpse Essence), resembling a vermilion rat of indeterminate size, lurking in dark places. It exhales qi from afar to strike a person’s shadow, and those afflicted inevitably suffer from malignant sores and die. This is the essence of an ancient, long-abandoned object.\n\nAnother is the *Hei Hua Jing* (Black Flower Essence), shaped like a dog but hairless, with red skin and six eyes. It hides in secluded places, exhaling qi from afar to strike its victims, causing sudden internal distress, vomiting of saliva and blood, and eventual death. This is the unrighteous spirit of a household.\n\nAnother is the *Niu Shou Bai Du Jing* (Ox-Headed Hundred Poisons Essence), with fleshy horns atop its head, a green face, vermilion eyes, an eagle’s beak, a tiger’s neck, horse’s hooves, and a human body. It roams mountain valleys to claim lives. This is the essence of an old horse from the Lion Kingdom that once obtained a dragon pearl, later transforming improperly into a human form and scattering across the eight directions—now commonly found in mountain valleys.\n\nAnother is the *Gui Long Wan Tian Jing* (Cassia Dragon Evening Heaven Essence), appearing as a hornless dragon, commanding clouds and mist. It dwells in ponds and delights in devouring human brains. This is the water-dwelling essence of a dragon that shifted mountains in western Sichuan.\n\nAnother is the *Deng Chao Huang Tian Jing* (Deng Nest Yellow Heaven Essence), resembling a giant turtle with a horn atop its head and four eyes. It dwells in water, damaging dikes and shattering riverbanks, often drinking human brains through the soles of feet or palms. This is the essence of a water demon.\n\nAnother is the *Cao Hong Tian Yan Jing* (Cao Hong Heaven-Eye Essence), with disheveled hair and a single foot, appearing as a woman. It roams mountain valleys, often laughing and raising its foot to ride the wind and fly. It exhales qi to transform and devours human lives. This is a heavenly demon, originally the essence of a ten-thousand-year-old withered cypress.\n\nAnother is the *Tao Nu Xin* (Peach Slave the New), appearing as a sallow, swollen woman in pale clothes, wielding a large pestle by night and sometimes visible by day. It lurks in caves, grottos, or long-abandoned rooms. Those who see it invariably fall ill. This is the essence of a thousand-year-old spider.\n\nAnother is the *Song Qiu Gu Hun Jing* (Song Mound Lone Soul Essence), taking the form of a woman who wanders mountains and forests, often weeping beneath the grass. If questioned, she claims to be a woman from a good family. Following her leads only to disaster. Those who recognize her will note the absence of her left ear—this is the essence of a thousand-year-old wild leopard cat.\n\nAnother is the *Wu Ai Ai Jing* (Wu Ai the Beloved Essence), appearing as a woman who claims to be from a respectable family, often carrying a child or accompanied by one or two maidservants. She roams mountain valleys, fond of bewitching the hearts of cultivators. Those who seek the Dao without this text to discern truth from falsehood risk great harm and loss.\n\nThe ghost bears a red, dish-like mark on its left cheek, roughly the size of a bean. When addressed by its nickname—\"Left-Cheek Red Mark Hao Ai Ai Essence\"—the ghost reveals its true nature, for this is no mere spirit but the essence of a thousand-year-old stubborn stone.\n\nAnother is the *Zuo Shou Quan Xie Jing* (Left Guardian of Complete Evil Essence), appearing as a divine warrior, often wielding a sharp blade and carrying a severed head through the mountains. Its roar shakes boulders like a raging tiger, and those who mistakenly encounter it meet certain death. This is the essence of a dead male spirit in the mountains, unclaimed by heaven or earth, now a malevolent spirit of the eight directions.\n\nAnother is the *Old Monk Essence*, taking the form of an aged monk in tattered brown robes, carrying several scrolls of scripture. It wanders mountain valleys or the edges of narrow paths, its left eye crimson and its eyebrows thick as a brush. It speaks kindly to travelers, offering good deeds and conversation, yet none who engage with it escape being devoured. This is the essence of an old monk from Nanyun Mountain, transformed by malevolent qi.\n\nAnother is the *Sheep-Head Peddler Essence*, a four-horned, blue-skinned being with a human body. It roams the four seas, seducing the daughters of households. In the present age, women who die at night after appearing alive by day are victims of this creature—it is the essence of a thousand-year-old sea dog.\n\nAnother is the *Chen Kuang Shi Chi Jing* (Chen the Mad Corpse-Runner Essence), with the head of a tiger and the body of a bird, its fleshy wings carrying it through the sky. It preys on the flesh of the living, the essence of a ten-thousand-year-old river pig.\n\nAnother is the *Tun Mo Xiao Zhi Jing* (Swallowing Demon Small Upright Essence), often adorned with a golden floral crown and plain robes, appearing as a divine being. It exhales malevolent qi to conjure palaces, luring beautiful women inside to feast on their blood and flesh. It demands sacrifices and indulges in debauchery, deceiving many into worship. This is a spirit despised by heaven and earth, born from the essence of an old chicken.\n\nAnother is the *Guo Hua Xiao Shen Jing* (Guo Hua Small Spirit Essence), a ghostly figure with a human face, clad in coarse cloth, its deep-set eyes gleaming. It carries a small blade, lurking in mountains and wilds, and those who encounter it are slashed and devoured. This is the essence of a minor earth spirit from an unruly place.\n\nAnother is the *Shan Yue Sun Qing Jing* (Mountain Peak Sun Qing Essence), dressed in yellow, resembling an elderly yin-aligned person. It often appears in secluded mountain valleys, its left hand always holding a bird with five-colored, brocade-like plumage. When it releases the bird before a person, its beauty captivates the onlooker, who inevitably falls gravely ill. This is the essence of an ancient crow from a hidden valley.\n\nAnother is the *Yellow Maiden Essence*, appearing as a young girl with twin cloud-like buns and purple robes. At night, she often appears and speaks to travelers, then transforms into wind to seize them, returning to feast on their blood and flesh. This is the essence of a long-lived lion.\n\nAnother is the *Zhou De Da Mei Jing* (Zhou De Great Delusion Essence), taking the form of a robust woman wearing a seven-star jade pearl crown and a five-colored, floral-patterned robe. Her cloud-like hair is pinned with care, her brows and eyes like autumn ripples. She carries a child’s withered skull, which she transforms into an embroidered pouch to lure onlookers. She speaks: *\"I am a woman of a respectable household, rarely venturing out, yet a fleeting fancy for the wild led me here.\"* Many, entranced by her beauty, are drawn to her like starving turtles to blood, their lives thrown into chaos. Once they unite with her, their bones and marrow are ground to dust. This ghost bears a bean-sized blemish on its forehead—a mark recorded by heaven and earth. It is the essence of an ancient river turtle, thriving in scorching lands, ungoverned by heaven or earth, its scattered soul untouched by the eight caverns for eight generations.\n\nAnother is the *Qi Qi Xiao Hao Jing* (Dripping Small Wasting Essence), appearing as a young woman with a plain coiled bun, crimson robes, and red shoes. Her jade-like face and flower-like beauty enchant with songs and verses of wind and moon. On moonlit nights or at dusk, she claims to be a neighbor’s daughter, and young men who delight in her company gradually waste away, their yang souls consumed until death. This is the essence of the unbetrothed soul of a maiden.\n\nAnother is the *Su Xiao Yao Jing* (Su Xiao Demon Essence), resembling a young man, appearing unpredictably at dusk or dawn. It walks apart from travelers, bringing misfortune, and those who see it meet no peace. This is the ghost of one who died unjustly from a lingering illness.\n\nAnother is the *Yuan Lang Gu Mei Jing* (Garden Lad Gu Delusion Essence), appearing as a yang-aligned person in white or yellow robes. At night, it calls out to people’s souls, and those who respond meet certain death. Thus, in the present age, those who hear what seems like a voice calling them at dawn, dusk, or night—whether in the mountains, a dwelling, or elsewhere—should note: if the first call is loud and the next two faint, it is this spirit. This is the essence of an ancient coffin plank.\n\nAnother is the *Yang Hua Gui Shi Jing* (Poplar Blossom Ghost Corpse Essence), appearing as a man in white or blue robes, four-eyed and footless. It roams quiet places at night, crying out in feigned pain. Those who mistake it for a truly suffering person and inquire are answered—only to die. This is the essence of an ancient coffin.\n\nAnother is the *Yellow River Great and Small Essence*, often seen in groups of three to five, or seven to eight, some headless, others without feet, mouths, noses, eyes, or ears, or missing arms and elbows. They gather near fires at dusk, and those who see them often fall gravely ill. These are the hungry ghosts of long-dead, unclaimed wandering souls.\n\nAnother is the *Teng She Bai Hu Xiao Hao Jing* (Soaring Serpent White Tiger Small Wasting Essence), appearing as a woman in floral robes and a crown, her beauty striking. She favors nighttime wanderings, lingering by roadsides in daylight. She claims to be a woman of a good family, weary from travel, and asks for a ride on one’s back. Many, thinking it a kind deed, unknowingly invite disaster upon themselves.\n\nThis is the essence of an ancient, long-lived rabbit.\n\nAnother is the *Hunxing Wangliang Essence*, appearing as a ghostly figure, dozens of feet in length and three to five feet in girth, its eyes like flickering flames. At dusk or in the dead of night, it stands alone by the water’s edge or along wild paths. Those who see it invariably fall mildly ill, though it cannot claim their lives. This essence arises from a stone, a clod of earth, or a rotting log by the water or roadside, steeped in damp qi over the years until it takes form.\n\nAnother is the *Jiafu Essence*, human in shape, resembling a young maiden in mourning white. It often appears in halls, weeping or laughing at nightfall, singing or wandering alone, or in pairs or threes. Wherever this essence manifests, those who see it will surely die. This is the ghost of a deceased woman lingering in an old dwelling.\n\nAnother is the *Lianglin Qingmian Essence*, clad in white, its hair unbound and disheveled. It often causes doors and households to creak and stir, unsettling the home. This is the essence of a deceased man’s lingering corpse within the dwelling.\n\nAnother is *Li Tong*, shaped like a maiden, her beauty striking, her bearing refined and graceful. She roams the night, dressed in crimson robes and a tall crown, skilled in poetry and song, reciting verses with every step. Many are enchanted by her. This is the essence of an aged lampstand.\n\nAnother is the *Gu Nu Seng Essence*, appearing as a woman in mourning or colorful attire, emerging at night beneath lamplight with her head and face veiled. She delights in playing with lamps and choking people to death. This is the essence of a broom.\n\nAnother is the *Sha Mu Hun Essence*, taking the form of two or three people. It emerges in the deep of night, mimicking the sound of footsteps within the home. It often inflicts illness and harms children. This is the essence of aged household objects.\n\nAnother is the *Tu Yu Essence*, resembling a white rat or a ghostly figure. In the dead of night, it delights in hurling tiles and bricks. This spirit brings prosperity to the household—it is the essence of bronze and iron. To capture it, take a sheet of white paper and inscribe upon it the *Heavenly Sovereign’s Incantation Seal*. Fashion a paper wick, anoint it with oil, and light it where the presence is suspected. Use another lamp to illuminate the area; where the flame dips, dig at dawn, and you will surely retrieve the object.\n\nAnother is the *Da Luo Sha Gui Essence*, its form ever-changing. It knows good and ill fortune, riding birds into homes at night or stirring sounds in chambers. It may weep before people. These are the lingering dead of a household, neither claimed by heavenly nor earthly spirits—what the world calls *wayward spirits* taking form.\n\nAnother is the *Tie Yun Luo Ye Essence*, master of clouds and mist, appearing as a child with eyes like lightning flashing behind its head and taloned hands and feet. It manifests in firelight at night, and during droughts, it often hides within women’s bodies, causing misfortune to the household. This is the essence of a *perverse dragon* yet to ascend.\n\nAnother is the *Zhao Shi Zong Essence*, resembling a man in unknowable attire. It causes people to dream strange dreams at night, suddenly feeling a weight upon them. Those who see it invariably fall ill. Neither heavenly nor earthly authorities claim it—an unregistered spirit taking form.\n\nAnother is the *He Du Kou Essence*, appearing as a man, often lurking in caves. It exhales upon people, causing illness, wandering pains, and unrelenting agony in the limbs, as if bitten by a tiger. This is the essence of a long-lived mountain tiger.\n\nAnother is the *Hui Hu Shen Essence*, with the head of a tiger and the body of a gray donkey, its four feet clawed, its eyes like lightning. It excels in transformation, reaching every wind-swept place, delighting in taking lives and devouring children. This is the essence of an aged woman, empowered by ash to change form.\n\nAnother is the *Tang Yong Ming Essence*, with the head of a camel and the body of a man, clad in red robes and barefoot, wielding a small knife. It haunts kitchens and hearths, stealing food and drink, leaving it cold and spoiled. Those who consume it invariably fall ill.\n\nAnother is the *Ning Nüzi Essence*, human in form with five topknots, four eyebrows, four eyes, and four hands, dressed in yellow with bird-like feet. It roams the mortal world, draining blood, causing people to sleep deeply, leaving dark marks on their bodies that linger for days. Encountering it brings minor misfortune. This essence arises from a long-lived venomous snake in the deep mountains.\n\nAnother is *Zheng Da Fu*, its essence formless, often suddenly appearing in homes as chasing fireballs. This is the essence of an aged spirit by the door.\n\nAnother is the *Qi Xian Xue Zhuo Essence*, resembling a flame, glowing like a lamp, appearing in threes or fives, moving in clusters. It often manifests at dusk in ancient altars, tombs, roads, and wild fields. Its transformations vary in size, appearing and vanishing unpredictably—what people call *ghost fire*. This arises from blood—of the living, the dead, or beasts—spilled in desolate places, streets, cliffs, or mountains, lingering unabsorbed for three days before stealing a wisp of yin or yang qi to take form. The blood of the living burns red; the blood of the dead burns green with smoke. To observe it, hold the *Heavenly Sovereign’s Divine Seal* at the *Gate of Heaven*, recite the *Heavenly Sovereign’s Incantation* thrice, and blow three breaths upon the seal. Direct the seal toward the fire, and the ghost fire will draw near. Seal it again, and the ghost fire will vanish. Upon inspection, its form will be broken, revealing a vessel filled with bloody water, or remnants of skin, fur, or tattered cloth stained with fresh blood.\n\n---\n\n**Heavenly Statutes, Chapter Five**\n\nThe Heavenly Sovereign said: The *Heavenly Statutes* are the laws of the Eight Poles and the jade texts of the Nine Heavens.\n\nThe Heavenly Statutes serve to capture celestial soldiers, behead mighty spirits, sever demonic essences, eradicate malevolent wastage, slay ghostly apparitions, and sweep away misfortune—all of which are but the righteous qi of the Heavenly Statutes at their grandest. The Heavenly Statutes are for the beheading and sweeping away of demonic spirits, like a raging fire incinerating a single autumn hair; they eradicate ghostly apparitions as the vast sea washes away a rotten leaf, leaving nothing unscoured.\n\nThe method states: To sever demonic essences and ghostly apparitions, merely observe their forms and speak of the roots of their transformations. Declare their names, and they shall not dare depart. Then, follow the seal method, commanding the five directions’ righteous ghosts by name to drive the demonic essence to the beheading altar. Alternatively, consign the demonic essence to the Four Great Hells, each according to one’s intent.\n\nTo behead them, take the beheading sword, grasp it in the left hand at the *Gate of Heaven*, recite the *Heavenly Sovereign’s Incantation* thrice, draw a single breath, and blow upon the seal. Apply cinnabar to the seal, then stamp the sword’s tip once. Cast the sword into the air, and the summoned ghost shall discern the practitioner’s intent. After a moment, the beheading shall be complete, and the true form of the demonic essence shall be revealed.\n\nThe Heavenly Sovereign said: The altar must be bounded with cinnabar in three layers, whether upon stone or earth, five *chi* in length and five *chi* in width. Upon encountering any demonic essence, the Heavenly Statutes must be employed to sever its root, thereby preventing future hauntings. Should one see a demon and fail to behead it, witness a monster and fail to eradicate it, or see a suffering patient and fail to save them, this too is a sin of uncompassionate heart.\n\nThus, demonic essences are eradicated in distant lands, ghostly apparitions are beheaded at the Yellow Springs, and malevolent wastage is driven from the ritual altar to aid the rectification of the true wind, preventing demonic spirits from harming our people.\n\nThe Heavenly Sovereign said: Upon encountering a demonic ghost, swiftly burn half a bundle of white paper money for the beheaded essence.\n\n**The Four Hells of the Heavenly Statutes for Beheading Demonic Essences**\n**Diagram of the Heavenly Sovereign’s Altar for Rectifying the Dao**\nTo behead them, take the seal, summon the ghost by name, and drive the demonic essence to be beheaded. If not yet beheaded, consign it to hell to prevent its escape.\n\n**Seal of the Heavenly Sovereign’s Altar**\nThis seal is placed in the northwest at *Qian*.\n*(Original diagram missing)*\nThis seal is placed in the northeast at *Gen*.\n*(Original diagram missing)*\nThis seal is placed in the southeast at *Xun*.\nThis seal is placed in the southwest at *Kun*.\n\n**Chapter Six: The Heavenly Sovereign’s Divine Seals**\nThe Heavenly Sovereign said: Those who receive the *Inner Writings of the Three Sovereigns* thereby receive the Three Sovereigns’ inner seals. The Heavenly Sovereign’s upper seal is four *cun* in length and three *cun* in width; the Earthly Sovereign’s middle seal is three *cun* and five *fen* in length and width; the Human Sovereign’s lower seal is three *cun* in length and width.\n\nTake a segment of the heartwood of a thunder-struck jujube tree—or, failing that, a cart axle—and prepare the seal material accordingly. At the time of the investiture ritual, place it in the direction of *Heavenly Medicine* and arrange it alongside the altar, serving the four directions. First, select a pure chamber, barring chickens, dogs, women, and wives from the exterior. Within, rectify the spirit, bathe in purity, and face the eight directions in reverence before opening the seal.\n\nOn the day the seal is carved, if winds stir sand and stones, clouds and mists gather, thunder roars from the four directions, and rain clamors, these are the ominous signs of the seal’s opening power. Once the seal is carved, it must be encased in a crimson silk pouch, stored in a stone box, and secreted within a cavern or stone chamber to accord with the Dao of Heaven.\n\nWhen employing the seal in ritual, first burn incense and silently invoke the Three Sovereigns, the lofty perfected, and the Five Marchmounts to request the seal. Then, command the ghostly soldiers of the world to sever and behead the demonic spirits and malevolent gods within the realm. The Heavenly Sovereign said: The might of this seal’s method governs the myriad spirits, and none shall fail to submit.\n\nRecite the divine incantation and blow upon the seal. With the Heavenly Sovereign’s seal, stamp the stars and they shall fall; stamp the moon and it shall wane; stamp the sun and it shall eclipse; stamp clouds and mist and they shall disperse; stamp wind and rain and they shall cease. Use the seal to summon the ghosts of the five directions, and there shall be no wind unobtained, no rain unsummoned—such is the power of the Heavenly Sovereign’s upper seal.\n\nWith the Earthly Sovereign’s middle seal, stamp the earth and it shall split; stamp grass and trees and they shall turn to ash; stamp flying birds and they shall plummet; stamp tigers and insects and they shall die—such is the power of the Earthly Sovereign’s middle seal.\n\nWith the Human Sovereign’s lower seal, stamp all ailments and none shall not be cured. Should one suffer misfortune, swallow the seal with fragrant water, and none shall not be blessed with good fortune, vigor, and prosperity. Stamp a person’s back heart, and they shall instantly die; stamp their front heart, and they shall instantly revive—such is the power of the Human Sovereign’s lower seal.\n\nThus, the Three Sovereigns’ divine seals govern the Dao of the Three Primes with unparalleled greatness. To verify their efficacy, take a seven-year-old child, apply cinnabar to the seal, recite the incantation, and stamp their front heart—the mark shall appear on their back. Such is the proven method of the Three Sovereigns’ inner secret writ. Without these divine seals, demons shall not fear; with them, the hundred evils shall flee in terror.\n\n**Chapter Seven: The Heavenly Sovereign’s Divine Incantation**\nThe incantation states:\nGreat Emperor of the Purple Tenuity, Celestial Deity of the North Pole,\n*Kuai-kuai*, *chi-mei*, *chi-liang*, *piao-xing*,\nCelestial Soldiers of the Eight Caverns, Fierce Soldiers of the Five Marchmounts,\nGreat Commander-in-Chief, Nine Numinous Ones of Water and Fire,\nSeven Luminaries, Seven Mansions,\nBlack Killer, Heavenly Peng,\nPrime Ministers of the Three Heavens, Lofty Honored Ones of the Ten Poles,\nHeavenly Ying, Heavenly Zhi,\nFour Slayers, Yellow Lord,\nHeavenly Xin, Heavenly Nei,\nHeavenly Fu, Heavenly Heng,\nDivine Generals of the Southern Numinous,\nProtectors of the Precious Seal,\nEarthly Lads of the Nine Lands,\nGhost Kings, Celestial Perfected,\nHeavenly Pillar, Heavenly Time,\nHeavenly Ren, Heavenly Ding,\nTwenty-Eight Mansions,\nTwelve Hourly Generals,\nMonthly Attendants,\nDaily Divine Lads,\nFollow the method, follow the decree,\nEnter my seal!\n\nSwift as the law’s command!\n\nBy the decree of the Most High Perfected, the Celestial August Emperor of the Great Canopy.\n\n**Chapter Eight: The Celestial August Emperor’s True Form Talisman**\n\nThe Celestial August Lord declares: The traces of the true form are none other than Our true form, the jade register’s talismanic script. Inscribe the talisman upon silk with cinnabar and a new brush, then wear or affix it—one’s spirit transforms instantly, myriad ghosts self-annihilate, hundred demons bind their forms, and all malevolent spirits vanish without trace, while the divine and sagely draw near.\n\nIn the method of absorption, swallow the talisman into the belly, and the ghosts and spirits shall reveal their true visages—truly the form of the Celestial August Emperor. For this reason, the celestial spirits submit to it.\n\nThe Celestial August Lord declares: Within the world’s seas, for all who suffer unhealed ailments, disasters befalling the self, chronic and severe illness, years of peril, or sudden afflictions unable to be relieved—inscribe this talisman in vermilion, burn it to ash, and swallow it with fragrant water. None shall fail to swiftly recover.\n\n**Chapter Nine: The Altar Rites for the Transmission of the Three August Ones’ Method**\n\nThe altar measures eight feet square, with a stone mound as the highest tier and an earthen mound as the next. The petition to the Three August Ones and Five Marchmounts follows this form:\n\n*[State your] prefecture, county, village, and dharma rank. Your servant, [Name], respectfully declares: From youth, your servant has pondered the Dao of immortality, ascending the divine wind, yearning for the true and mysterious, desiring to seek great fortune. Now, on [date], by karmic affinity, I have encountered the golden script, its wondrous transformations held within, and dare to employ it privately.*\n\n*With reverence, I present this memorial, humbly invoking the Three August Emperors and the Five Directional August Immortal Lords. May the merciful radiance of the great and compassionate Perfected Ones, the lofty immortals, shine forth—what place shall remain unillumined? As the compassionate breeze scatters, how can any land be left untouched?*\n\n*Your servant, [Name], a mere ant in feeling, a life adrift in the bitter sea, endowed with the nature of the numinous yet a body scorched by flames—now that the sacred mound is prepared and the jade blossoms fresh, I pray the Celestial Lords’ cinnabar light descend swiftly, the sacred mound arrayed in ranks, to grant your servant, [Name], the covenant of confirmation and dare to receive the mysterious scriptural Dao.*\n\n*[Date], [Rank and Name], respectfully submits this memorial.*\n\nWhen the sacred mound is ready for the rite, begin at the *hai* hour, proceeding until the *zi* hour. Face the Celestial Gate, adjust your robes and cap, bow, then burn the memorial of invocation. After a moment, an uncommon fragrance enters the nose, radiant light dazzles the eyes, and ethereal luminosity flows—suddenly, simurghs and cranes soar through the void, the body chills with trembling, and the spirit is awestruck. This is the sign of the Immortal Lords and host of sages descending upon the mound.\n\nAs the Immortal Lords alight, the tea and wine may change color. At this moment, adjust your robes, bow to the mound in the eight directions, and do not succumb to fear. Compose your spirit within, calm your heart and mind, and pray to the August Ones: *\"Your servant, [Name], now receives the celestial scriptures’ secret writings and humbly begs the covenant of confirmation.\"*\n\nFrom the *zi* to the *mao* hour, the mound may be dismantled. Face the Celestial Gate and burn five portions of spirit money. All paper horses and money are offered at the Ghost Gate. Burn a small memorial with three bundles of white paper money, commanding the Forty Great Ghosts of the Five Directions to gather them. Then employ the seal to enact the method, subdue ghosts, expel evil, seal mountains and dwellings—all shall respond naturally to its resonance.\n\n**Chapter Ten: The Three August Ones’ Sword Method**\n\nThe Celestial August Lord declares: On a *jiazi* day, take three catties and six taels of bright steel and forge a sword two feet and four inches long. Engrave upon it the true form talismans of the Celestial August, Terrestrial August, and Human August Ones, then wrap it in plain silk. Weight it with a cord and lower it into a well untouched by humans for many years. After forty-nine days, retrieve the sword and talisman—it shall have absorbed the earth’s numinous spirits, its iron turning white, its blade blood-red. No ghost or demon beholding it shall fail to be subdued and destroyed. This is called the *Hongquan Iron*, a sword transformed by the divine and numinous.\n\nStore it in a precious casket. When wielded, speak the method’s incantations, and its divine might shall respond without fail.\n\n**The Upper Scroll of the Three August Ones’ Esoteric Writings of the Eight Poles’ Divine Chapters from the Jade Flower Immortal Writings of the Golden Gate of Great Clarity concludes.**\n\n**The Middle Scroll of the Three August Ones’ Esoteric Writings of the Eight Poles’ Divine Chapters from the Jade Flower Immortal Writings of the Golden Gate of Great Clarity begins.**\n\nThis text, the *Mysterious Gate of the Boundless Cavern Chapter*, is the origin of the cinnabar terrace and jasper grove, the beginning of cloud blossoms and rosy dawns—a natural treasure script of the Great Canopy in Heaven. Its purple writings on jade slips were formed from the red qi exhaled by the August Ones of Highest Heaven, their cinnabar splendor congealing into talismanic script. It was concealed in the Purple Tenuity and inscribed upon jade, gold, and blossoming jasper tablets.\n\nWithin it are methods for dwelling in mountains, the Eight Luminous Divine Lads of the Great Cavern, enabling one to remain unharmed by wolves and tigers, immune to venomous creatures, to behold numinous mushrooms, discern immortal medicines, distinguish the true from the false, recognize immortal guests, and master the arts of transformation, subjugation, and divine strategy—all contained herein. Those who encounter it must hold it in deepest secrecy.\n\n**Chapter One: The Terrestrial August One’s Divine Seal**\n\nThe Terrestrial August One’s divine seal governs the vast earth at the center of the mundane world, over which all matters are sovereign. Thus, the seal’s great purport precedes all methods.\n\nFor those who cannot rely on external breath—such as immortal medicines transforming form, borrowing objects to assume shapes, or adopting names to manifest images—many take the forms of birds and beasts or male and female figures. When illuminated by this seal, all are utterly undone.\n\nAuspicious mushrooms and wondrous herbs, when transformed or altered, shall all be made manifest by this seal’s light.\n\n**Eulogy of the Terrestrial August One’s Divine Seal’s Numinous Extremity:**\n\nThe *Kuai* wind and Eight Slayers subdue celestial spirits,\nThe Nine Mysteries and Four-Eyed Old Man submit.\nThe Great Beginning’s feathered transformations wield the great handle,\nEarth’s malevolent essences behold its awe-inspiring might.\nProfound, profound—the celestial writings are the divine ancestors,\nBeyond the mysterious, mysterious—nothing more remains.\nOne may await the jade blossom’s numinous light talismans,\nEradicating traces of divine winds and sweeping away harm.\n\nThe precious seal, the jade dragon’s prime ministerial pivot,\nIts divine mechanism governs and drives most fittingly.\nHeaven’s secrets and demonic spirits lie beyond all bounds,\nThe seal’s blade and immortal spirits pierce the azure void.\n\n**The Dragon-Florescence Radiant Gold Script Seal**\n\nThe Dragon-Florescence’s resplendent gold-script seal—\nAt a single glimpse, all demonic hordes bind their forms.\nThe Purple Star of the Great Ultimate subdues thirty thousand,\nSweeping away evil and dispelling ranks of malevolent spirits.\nThe Mysterious Numinous lends me the seal’s power,\nAiding the true heavens to sweep away all monstrous traces.\nThe earth purified, the void ascended—ghosts and spirits quail,\nFacing the mountain, harnessing qi is the supreme pivot.\nLingzhi transforms into a hundred thousand forms,\nImmortal herbs become birds and beasts.\nWhen the seal illumines the void, nothing escapes its grasp,\nFor the great transformation of nature brooks no sentiment.\n\n**Incantation of the Terrestrial August One:**\n*\"Southern Seven Stars, Earth’s Gate of Six Dings,\nSix Jia Jade Maidens, heed my seal’s command—\nSwiftly, swiftly, as the law decrees!\"*\n\n**Second Chapter: True Form Talismanic Seal of the Terrestrial August One**\n**Talismanic Diagram of the Terrestrial August One’s True Form Jade Seal**\n*Four inches in length, four inches in width—*\n*Inscribed in cinnabar on yellow paper.*\n\nThe Terrestrial August Lord declares: For those dwelling in mountain caves or hermitages, or secluded in forests and valleys, at dawn each day, inscribe this true-form divine talisman, burn it to ash, mix with fragrant water, and—facing the Gate of Heaven—consume it. This will prolong life and extend years, while evil qi cannot assail you. For those living in the mountains, gathering all immortal lingzhi and numinous herbs, swallow the talisman and enter the abdomen, then illumine with the seal—such herbs will come of their own accord.\n\n**Third Chapter: Proper Practices for Mountain-Dwelling Adepts**\nThe Terrestrial August Lord declares: Among all beings, humans are the most noble. Thus, all living things must have their root, and all affairs must have their proper course. If a superficial learner suddenly conceives a virtuous thought yet fails to grasp the true principle or fathom the mysterious and profound, and rashly enters the famous mountains, they will encounter the five pitfalls and eight slayers’ misfortunes, or unforeseen mountain disasters—injuries from insects, maulings by tigers—leading many to their deaths, unaware that dwelling in mountains has its own method.\n\nThe formula states:\n- Those born in the *yin* or *chen* hours should dwell in the *qian* or *kan* mountains as their land of blessing.\n- Those born in the *mao*, *si*, or *wu* hours should dwell in the *kun* mountain as their land of blessing.\n- Those born in the *shen* or *wei* hours should dwell in the *gen* mountain as their land of blessing.\n- Those born in the *you* hour should dwell in the *zhen* mountain as their land of blessing.\n- Those born in the *xu* hour should dwell in the *xun* mountain as their land of blessing.\n- Those born in the *hai*, *zi*, or *chou* hours should dwell in the *li* or *dui* mountains as their land of blessing.\n\nThough one may have a blessed land to dwell in, if the due east, due south, or southeast faces a valley, and in spring or summer the trees appear withered, the grasses parched, and the stones and woods lack moisture, this is called a \"Scorching Slayer Mountain.\" Those who dwell here will often suffer mountain fires—seek another mountain more suitable.\n\n**Fourth Chapter: Offering Rites to the Mountain Lord**\nThe Terrestrial August Lord declares: Great mountains have great mountain lords, and small mountains have small mountain lords. For those entering the mountains to cultivate the Dao who do not perform offerings to invite their lord, it is as if one enters another’s home without cause—the spirits and humans will grow distant in sentiment. When entering a mountain to select a cave or hermitage, spread a clean cloth upon the ground or a stone at the mountain’s gate, place a dish of plain food, a portion of tea and wine, and make offerings for a short while. Burn a bundle of white spirit-money, and cast a small petition into the fire for the attendant to burn. The petition should state: *\"On such-and-such a year, month, and day, I enter this mountain to seek the Dao of long life. Not daring to dwell here privately, I now perform offerings to invite the mountain lord’s divine spirit, beseeching your protection and aid.\"* Only then may one enter and dwell in the mountain, as if relying on a patron.\n\n**Fifth Chapter: Selecting Caves by the High Mystery’s Vital Qi**\nThe Terrestrial August Lord declares: Though one may dwell in a blessed land, one must still select a cave abode. For a blessed land, if within the mountain’s due east there is a cave chamber with a door five *chi* or more in height—no less than three *zhang*—this is a divine immortal’s grotto. If the door is less than five *chi* in height, it is but a \"Yang Mist Hermitage,\" unsuitable for dwelling. If the cave is over three *zhang* in height, it is a \"Cloud Embryo Isle\"—though one may dwell there, it harbors strong yin and harsh yang that injure the human spirit and soul.\n\nIf there is a stone chamber in the due south with a door five *chi* or more in height—no less than three *zhang*—this is called a \"Grotto Abode.\" A stone chamber in the southeast is the \"Luminous Radiance Grotto\"; in the due west, it is called the \"Soul Cavern\"; in the due north, the \"Corpse Hollow\"; and in the northeast, the \"Stone Poison.\" Dwelling in a \"Stone City Grotto\" will naturally evoke auspicious responses, and lingzhi and elixir herbs will manifest. But those who dwell in hollows and caverns will not only suffer from spectral perils but also sever the vital qi of heaven and earth and the bloodline of immortals. Without divine scriptures, the calamity will be great.\n\nWhen entering a suitable mountain without a grotto, if one sees in the southeast flourishing trees, moist stones, and lush grasses, with water flowing in three bends resembling the character *shang*, one may cut thatch to build a hermitage and cultivate the root of life—this too is a blessed land of immortals, and one is certain to become a celestial official.\n\n**Sixth Chapter: Sealing the Mountain and Purifying the Earth by the Primordial Heaven**\nThe Terrestrial August Lord declares: Having settled in an immortal’s abode, one must seal the mountain and purify the earth to prevent malevolent spirits from trespassing upon one’s domain. Take six peachwood boards, each seven inches long, three inches wide, and one inch thick, leaving the bark on one side and smoothing the other. With a new brush and fragrant ink, inscribe a Six Ding spirit talisman on each board. Coat the seal with cinnabar, hold it in the left hand, face the Gate of Heaven, recite the Terrestrial August Incantation three times, draw three breaths of qi, and blow upon the seal. Recoat the seal with cinnabar and impress it once upon each Six Ding talisman. Then place the boards to guard the six directions—naturally, malevolent spirits will vanish without trace, tigers and leopards will conceal their forms, birds will cease their cries, and all creatures will disappear. Dwelling here for long, one will ascend to the celestial realms by the Dao.\n\n**Seventh Chapter: Discerning Immortal Guests and Malevolent Spirits**\nThe Terrestrial August Lord declares: Those who dwell long in famous grottoes and immortal abodes, as days and years deepen and their resolve for the Dao grows pure, will naturally have immortal guests and divine officials descend.\n\nTo discern these, if at dawn or dusk one suddenly sees rainbow-hued clouds drifting through the void, true incense wafting into the valley, or auspicious colors and propitious qi lingering, these are signs of exalted perfected beings on their passage. With sincere devotion, one should reverently announce to the Heavenly August Lord and seek the Way of liberation—then the exalted perfected, moved by compassion, will naturally descend to instruct.\n\nIf wandering among cliffs, valleys, streams, or forested peaks, one suddenly sees clouds and radiance enveloping the scene, with rare beasts and auspicious birds gathering all around, or if there appears one clad in red robes with a vermilion dragon, or another in yellow robes with jade pendants, or six maidens in purple attire, or those bearing staffs, banners, and canopies—these are divine immortals descending.\n\nIf in the emptiness of forests, valleys, or mountain peaks, one suddenly sees black qi or dark clouds swirling, with indistinct figures in caps and robes, whether few or many, drifting in confusion—these are malevolent spirits assembling. Thus, when immortals are about to descend, a fragrant breeze first permeates the valley, entering the nose and mind. If no such fragrant wind appears, it is not the advent of immortals. Exercise caution and do not gaze upon them.\n\n**Eighth Chapter: Discerning the Thirty-Six Transformed Forms of Zhi-Grasses**\n\n1. Immortal-Foot Zhi: purple star.\n2. Cinnabar Zhi: vermilion star.\n3. Purple Zhi: yellow star.\n4. Radiant Zhi: azure star.\n5. Cloud Zhi: primal star.\n6. Heavenly Zhi: black star.\n7. Earthly Zhi: green star.\n8. Mist Zhi: brown star.\n9. Divine Zhi: marked with red veins like tangled threads.\n\nThese nine zhi are of a single nature. Born in renowned mountains, they are congealed from the spiritual qi of numinous stones over myriad ages, varying in size and white as cold jade. At night in the valleys, their light pierces the heavens; though they appear as stone, their hues are lustrous and fresh, distinguished by their star-like specks.\n\n1. Azure Zhi: blue blossoms.\n2. Numinous Zhi: black blossoms.\n3. Flame Zhi: purple blossoms.\n4. Water Zhi: white blossoms.\n5. Qi Zhi: yellow blossoms.\n6. Jade Zhi: vermilion blossoms.\n7. Treasure Zhi: pink blossoms.\n8. Dragon Zhi: azure blossoms.\n9. Tiger Zhi: green blossoms.\n\nThese nine zhi are of a single nature, their roots growing by rivers, seas, mountains, and streams, or along great and small waterways. Born from the accumulated essence of mountain and water, they resemble fine hemp leaves, standing three to five feet tall, evergreen through winter and summer. Their crowns are often veiled in faint, cloud-like qi, distinguished by their colors and blossoms.\n\n1. Jade Zhi: flower-shaped.\n2. Pillar Zhi: wood-shaped.\n3. Floral Zhi: bird-shaped.\n4. Golden Zhi: human-shaped.\n5. Mystic Zhi: cloud-cluster-shaped.\n6. Brocade Zhi: beast-shaped.\n7. Azure Zhi: formless.\n8. Moist Zhi: water-shaped.\n9. Wind Zhi: tower-and-pagoda-shaped.\n\nThese nine zhi share a single root-nature. They grow in stone chambers of grotto-heavens and mountain caves, transformed from the condensation of cloud-roots and mist-tips. Their size is unfathomable, resembling stalactites with forms of dragons, tigers, flying birds, and human figures clinging to stone walls. Their color is like burning cinnabar, glowing day and night, exuding fragrant qi in visible shapes.\n\nThese twenty-seven varieties are the jade-blossomed, gold-stemmed, feather-transformed immortal zhi. Those who encounter and ingest them will ascend to the celestial rivers, transmuting mortal bones into immortal ones, transforming into perfected beings, transcending the mundane to enter sageliness, and soaring through the nine heavens. Thus the ancients said: \"When numinous zhi enters the belly, one ascends to heaven in broad daylight.\"\n\n1. Cloud-Essence Zhi: cloud-cluster-shaped.\n2. Yellow Zhi: dog-shaped.\n3. Heroic Zhi: tower-and-pavilion-shaped.\n4. Auspicious Zhi: mandarin-duck-shaped.\n5. Elegant Zhi: crane-shaped.\n6. Florid Zhi: flower-and-fruit-shaped.\n7. Wood Zhi: moth-shaped.\n8. Grass Zhi: tiger-shaped.\n9. Supreme Zhi: human-shaped.\n\nThese nine zhi are transformations of a single root. Their forms are unpredictable, often growing on withered trees, rotting stumps, palace courtyards, or the beams of water pavilions. Ingesting them can prolong life and extend years, offering modest benefit.\n\n**Ninth Chapter: Discerning the Thirty-Six Forms of Immortal Medicines**\n\n1. Cinnabar Essence: red in form.\n2. Malachite Essence: blue in form.\n3. Gypsum Essence: white in form.\n4. Realgar Essence: red in form.\n5. Sulphur Essence: yellow in form.\n6. Hollow Malachite Essence: pale red in form.\n7. Alum Essence: green in form.\n8. Mica Essence: black in form.\n9. Cinnabar Sand Essence: purple in form.\n\nThese nine immortal medicine essences are transformations of metals and stones, each resembling a great demon with crimson hair and red brows, manifesting in various forms. Their distinct body colors serve as markers.\n\n1. Black Stone Essence: sixteen legs.\n2. Yu’s Remnant Essence: twenty-four legs.\n3. Well-Spring Stone Essence: twelve legs.\n4. Basin Earth Essence: ten legs.\n5. Orpiment Essence: legless, with fleshy wings, adept at flying.\n6. Talc Essence: eight legs.\n7. Actinolite Essence: six legs.\n8. Stone Fat Essence: four legs.\n9. Mercury Essence: two legs.\n\nThese nine stone essences are also transformations of metals and stones. They resemble scorpions of indeterminate size, white as silk, distinguished by the presence or absence of legs.\n\n1. Ginseng Essence: like a small child in plain robes, holding flowers.\n2. Poria Essence: like a small child holding pine or cypress.\n\nA **Lycium Berry Essence**, resembling a small dog, howling in mountain valleys at night.\nA **Rhubarb Essence**, appearing as a woman, bare-bodied yet clutching garments.\nAn **Amber Essence**, like a tiger, capable of soaring through the air.\nA **Millennial Kudzu Essence**, resembling a scaleless dragon, often concealed in stone caves.\nAn **Aged Vine Essence**, shaped like a lump of flesh, which when broken reveals a paste-like substance.\nA **Solomon’s Seal Essence**, like a child holding a sprig of Solomon’s seal.\nA **Atractylodes Essence**, like a child holding a sprig of atractylodes, often roaming high peaks and ridges, appearing at night.\n\nThese nine essences of immortal herbs are all transformations of plants. They are commonly found in famous mountains, distinguished by their forms, colors, and bodily features.\n\nA **Gastrodia Essence**, crimson as blood.\nA **Polygala Essence**, white in color.\nA **Rehmannia Essence**, yellow in hue.\nAn **Achyranthes Essence**, earth-toned.\nAn **Aconite Essence**, black in color.\nA **White Wood Essence**, purple in hue.\nA **Cistanche Essence**, green in color.\nA **Usnea Essence**, azure.\nA **Licorice Essence**, brown.\n\nThese nine essences of immortal herbs are transformations of *zhi* mushrooms. They are often found in famous mountains, resembling large spiders with vermilion eyes, no mouth, and four legs. The *zhi* mushrooms from which they arise are distinguished by their colors.\n\nTo discern these thirty-six immortal herbs and their transformations: take a sheet of white paper and inscribe the name of the desired essence or herb upon it. Hold the **Earth Sovereign Seal** toward the Gate of Heaven, grasp the seal, and recite the **Earth Sovereign Incantation** three times. Draw in three breaths of *qi* and exhale them onto the seal, then coat the seal with cinnabar. Imprint the seal upon the inscribed name, and the transformed *zhi* mushroom will manifest from afar. Press the seal again, and the herb in its true form will appear. Consuming it will refine the mortal body, summoning wind and clouds beneath one’s feet, granting immortality and everlasting vision.\n\n**Chapter Ten: The Earth Sovereign’s Ingestion of Immortal Herbs for Ascension and Dao-Attainment**\n\nTake sixteen *jin* of **Southern-Facing Artemisia**, wash and soak it clean. Peel three *jin* of **White Poria** and three *jin* of **Asparagus Root** (with hearts removed). Place all three ingredients into a mortar and pound them three thousand five hundred times until they resemble a smooth paste. Transfer the mixture into an earthenware pot, add one *dan* of water, and simmer over a slow fire until reduced to three *dou*. Discard the dregs, then continue simmering the liquid until it thickens to the consistency of honey. Seal it in a jar.\n\nEach day, dissolve half a *liang* in fine wine and consume it on an empty stomach. Avoid meat, mallow, sour or salty foods, and sexual activity. After one hundred days, long-standing ailments will vanish, and all diseases will be eradicated. After one year, the five viscera will be harmonized, the body will glow with luminosity, and one will naturally abstain from grains. The mind will be clear, the spirit refreshed, and one will be untouched by cold or heat, the complexion radiant and moist. After three years, the body will generate jade-like luster, a halo will encircle the neck, and with prolonged ingestion, one will transcend life and death, roaming beyond the mundane, known as a **Refined Practitioner Immortal**—one who has attained the Dao through *zhi* mushrooms.\n\n**The Supreme Clarity Golden Palace Jade Flower Immortal Scripture: Eight Poles Divine Chapters, Three Sovereigns’ Esoteric Writings, Scroll Two**\n\n**The Supreme Clarity Golden Palace Jade Flower Immortal Scripture: Eight Poles Divine Chapters, Three Sovereigns’ Esoteric Writings, Scroll Three**\n\nThe Dao, reaching nothingness, gives birth to Heaven and Earth.\nHeaven, in its ceaseless motion, leaves the North Star unmoved, embracing emptiness without depletion...\n\nThe Earth, in its utmost stillness, never ceases its eastward flow, nor exhausts its clouds; thus Heaven endures and Earth abides—why then should man alone face death? This is because man fails to comprehend the inclinations of Heaven and Earth, neglects the spirits that govern the cosmic order, mistakes fleeting attachments for love, and worldly desires for kinship. Before reaching middle age, many invite calamity upon their fate.\n\nNow, therefore, the origins of the Great Void are revealed, the primal essence of Heaven and Earth is clarified, and the methods of refining the spirit are disclosed—to deliver all beings and prevent the loss of the human Dao. Those who encounter this teaching and cultivate with devotion may ascend to Heaven in broad daylight; those who refine *qi* through the Dao may abide in the world without dying.\n\nThis text is the profound esoterica of the Supreme Mystery, a deep revelation of celestial mechanics. It is sealed within a jade casket—should it be recklessly disseminated, nine generations of ancestors will suffer misfortune. Guard it well, guard it well.\n\n**Chapter One: Restraining Evil and Cultivating Goodness**\nThe essence of Yang is the *hun* and the spirit; the essence of Yin is the *po* and the *shi*. When the spirit prevails, goodness arises; when the *po* grows strong, evil emerges. Restraining evil and cultivating goodness brings order; forgetting goodness and following evil brings chaos. With prolonged order, the *shi* perishes and the *po* vanishes; with prolonged chaos, the spirit departs and the *hun* scatters. Thus, when the *shi* perishes and the *po* vanishes, spirit and form unite, ascending with the Great Yang to become an immortal. When the spirit departs and the *hun* scatters, the *shi* and *po* sink, descending with the Great Yin to become a ghost. Such is the natural principle.\n\n**Chapter Two: Establishing the Upright and Forgetting the Deviant**\nIn cultivating the Dao, one must establish the upright and forget the deviant. If the upright is not established, disorder arises, harming the spirit; if the deviant is not forgotten, myriad evils are attracted, bringing harm to the body. Thus, establishing the upright brings one daily closer to the Dao of immortality, while following the deviant draws one daily nearer to the path of ghosts. Clinging to emotions, failing to sever thoughts, ceasing not from desires, and allowing the heart to remain turbid—indulging in greed, gluttony, and cravings, refusing to relinquish attachments, and following the heart’s every whim—these are the ways of the deviant.\n\n**Chapter Three: Clarity and Confusion**\nFailing to recognize the worthy, failing to choose friends wisely, failing to discern the Dharma—how can one avoid delusion? Failing to recognize the two truths’ reversals, failing to examine the intermingling of Yin and Yang, practicing without restraint, suppressing one’s nature and exhausting the spirit—how can one avoid harm? Failing to grasp the profound mystery and clinging to minor techniques—how can one avoid illness? Expending effort in vain and inviting death—how can one avoid error?\n\n**Chapter Four: Fortifying the Body**\nFortifying the body is the first task of nurturing life and the root of the Great Dao. Dwelling in seclusion, one forgets sound and color, abiding in purity and harmony with Heaven’s accord. Yet one must discern what harms and benefits, recognize prohibitions and taboos, understand the internal and external, and know the cycles of generation and destruction. Still the floral fluids in the Jade Pool, preserve the flowing *ghee* in the Purple Palace. When essence accumulates, primordial *qi* arises spontaneously; when *qi* flourishes, the spirit gathers of its own accord; when the spirit flourishes and gathers, the Five *Qi* circulate naturally. Once the Five *Qi* circulate, one gradually approaches the state of the profound and ultimate truth.\n\n**Chapter Five: Refining Spirit and Qi**\nThe *Divine Water* and *River Chariot* gleam ever anew,\nRepeatedly refining the *Knife and Square* without end.\nThe *Li* trigram’s image drips with jade-like drops,\nScattering emerald mists in ever-deepening depths.\nEmploy the union of *Kan* and *Li*, the Dragon and Tiger,\nOnce at midnight, once at noon—each ascent and descent.\nUp and down they soar in ceaseless motion.\nSeek further the primordial origin, advancing step by step,\nAt each step, the hours of *Mao* and *You*.\nPassing through Kunlun, the jade-like *ghee* flows,\nEntering the Flower Pool, divided into three mouths.\nFlowing upward, exchanging and merging with pure Yang,\nFilling the entire realm, coursing through all the organs.\nWith the Eight Uprights and Three Lines, the fire’s number is complete,\nSpirit and *qi* unite, the body becomes indestructible.\n\n**Formula:**\nDrip by drip, the jade-like nectar glistens like water,\nRefining and returning to the origin, replenishing the marrow’s void.\nWhen the Eight Trigrams’ upright *qi* arise as one,\nThey surge through the double passes, transforming the body’s countenance.\n\n**Chapter Six: Emergence of the Sacred Embryo**\nAzure, so clear; emerald, so rich—\nA single luminous pearl, untouched by dust.\nWhen dust is utterly gone, the original truth appears.\nOnce the original truth appears, there is no great or small,\nTransforming and penetrating the spirit, becoming the *Chenying*.\nEssence embraces blood, blood embraces essence,\nEssence and blood unite, flesh and bone are born.\nWhen flesh and bone are born, Heaven and Earth divide;\nHeaven and Earth divide, the spleen resides in *zhi*,\n*Zhi* resides in the spleen, the *hun* enters the liver,\nHeart and kidneys harmonize, the *po* enters the lungs,\nThe five organs are at peace, the spirit is wholly complete.\nThen the Three Powers divide into six positions,\nWithin them, the Essence Palace receives the Gate of Abundance.\nThe Six Pitches divide the lines, determining the Five Tones;\nWhen the Five Tones are complete, the Yang number is fulfilled.\nHalf a celestial cycle burns and bends,\nSpirit divides, form stabilizes, *zhi* and essence refine,\nContinuously tempering and refining the upright *qi*.\nWhen upright *qi* arises, the spirit naturally communicates,\nAnd after ten months of work, the sacred embryo is formed.\nOnce the sacred embryo is complete, it moves freely without obstruction,\nRoaming the Four Great Continents and ascending to Penglai Palace,\nAbiding for a million years without decay.\n\n**Formula:**\nWhen the Yang number is fulfilled, nurture the sacred embryo,\nEssence enfolds the initial spirit, hands and feet awaken.\nFrom nine to nine, refine and witness nine,\nA single body divides into multiple forms.\n\n**Chapter Seven: Transcending to Immortality**\nThe Dao’s origin is One, yet its applications are three. Above, there is the ascent and descent of Heaven and Earth’s Yin and Yang, the ceaseless intertwining of the Two *Qi*, cycling endlessly without losing their order—this is the Dao. Mastering it, one soars amidst the clouds of the empyrean, where the sun and moon traverse, the Two Eights and Nine Sixes, essence and brilliance mutually consuming, *hun* and *po* uniting without losing their measure—this is the Dao. Ascending further, one reaches the Southern Palace, where below the Five Phases transmit and convey, receiving *qi* and forming combinations, generating lines and producing images without losing their principle—this is the Dao. Mastering it, one ascends to the Three Isles, where there is no beginning and no end.\n\nThe Human Sovereign Lord said: All cultivators who refine the spirit, strengthen the bones, and fortify life do not transcend these divine chapters. Following the currents of the Dao, some dwell in mountain caves, some in forest hermitages, others choose a quiet chamber. Burning incense and flowers, the pure *qi* flourishes. Then, on an auspicious day, one faces the eight directions—east, west, south, north, and the four intermediates. After paying homage, the furnace is set, *qi* is refined, *qi* stabilizes essence, essence stabilizes the spirit, and the spirit engenders life.\n\nWith prolonged refinement, wondrous transformation perfects the true. Through nine revolutions and five returns, three reversions and eight changes, one’s celestial bearing aligns, youthful purity returns, the frail grow strong, the aged regain vigor, the robust become youthful, and the young revert to infancy. Thus, from the mortal one attains sagehood; refining the sage leads to immortality, refining the immortal leads to perfection, refining the perfected leads to subtlety, refining subtlety merges with the spirit, and refining the spirit unites with emptiness—where *qi* and the primordial Dao begin.\n\nKnow then that the Dao resides within me: I soar beyond the four seas, or enter the imperial realm, ascend to the Golden Gates to pay homage to the exalted perfected, my name inscribed among the Nine Origins, my rank aligned with the stars. Some abide above the Nine Heavens, some lodge in the halls of the Eight Poles, some join the host of immortals at the Dark Capital’s court, or accompany the exalted perfected in the Great Veil Heaven. Some wander famous mountains and sea peaks, or attend the assemblies of the Southern Palace; some ascend to heaven to review the names of humans and ghosts, or descend to the world to record merits and transgressions from rites and fasts. Some govern the great mountains and rivers, or oversee the registers of life and death. Some ride phoenix chariots with the immortals, journeying north to the Purple Garden; or pass south through Golden Springs, gathering wise companions to pluck herbs and flowers. Some travel west to Tortoise Mountain to pay court to the Queen Mother in her golden palace; or cross the Fusang Tree to drink crimson wine in the Jade Orchard. Free from the highest, free from action, the immortal perfected abide in spontaneity—empty perfection transforms into the immortal adept.\n\nHow does one become an immortal adept? First, sever the six roots and cut off the six dusts: sight perceives no objects, hearing detects no sounds. Serene and tranquil, clear and subtle, empty and luminous, embracing the primordial, the celestial truth undergoes six transformations—through the utmost spirit refining *qi*, one achieves this. It is not attained through worldly passions, greed, or attachments of love.\n\n**Chapter Eight: The Talismans and Seals of the Human Sovereign**\nThe talisman is the true form of dragon script; the seal is the upright *qi* of the Great Void. It embodies the profound intent of the Celestial Origin, the union of celestial mechanisms, the wondrous operation of the utmost truth’s great pivot—the ancestral method for commanding spirits and ghosts, the key to subduing demons and heresies. Struck by this seal’s power, one can conceal form and disperse shadow, hide *qi* and gather spirit, causing yin and yang to transform the body sixfold, rendering it invisible to humans and ghosts alike.\n\n**Illustration of the Human Sovereign’s Seal**\nThree *cun* in length, three *cun* in width.\n\n**The True Form Talisman of the Human Sovereign**\nThree *cun* in length, three *cun* in width.\n\n**Chapter Nine: The Divine Incantation of the Human Sovereign**\nThe nine *qi* intermingle in misty fusion; the jade incantation follows. Lofty and wondrous, the celestial prison—supreme among the ten poles, divine sovereign of the Great Void, great lords of the eight heavens, Wood Father and Metal Mother, the supreme and mysterious perfected—each descends true *qi* to expel and annihilate the traces of evil.\n\nThe Vermilion Emperor of the South rides clouds upon a fire dragon.\nThe White Emperor of the West swiftly severs demonic miasma.\nThe Black Emperor of the North shines with rosy dawn’s divine radiance.\nThe Azure Emperor of the East commands the phoenix’s mighty cry.\n\nThe nine heavens’ nine spirits, the celestial soldiers of the Ghost Gate, the jade maidens of the direct talismans, the unbridled might of Tai Sui, the officers and soldiers of the Five Peaks, the celestial scholars of the capital bureau, the eight-eyed divine youths, the Northern Dipper’s stalwart pivot, the four-eyed elder *Xi*, the great slayer who devours demons, the forty stalwart warriors, the Six Ding and Six Jia—enter within my seal.\n\n*Swiftly, swiftly, in accordance with the statutes and ordinances, obey and seize!*\n\n**Chapter Ten: The Method of Knowing Life and Death and the Five Illusory Petitions**\n**The Method of Knowing Death:**\nJoin palms but extend the fourth finger; when it opens, King Yama will surely know.\n\nThe formula states: On the seventh, seventeenth, and twenty-seventh days of each month—three times monthly—one may know the omens of life and death for ten days. Face east at sunrise, recite the Human Sovereign’s incantation once, and draw in three mouthfuls of the sun’s crystalline *qi*, swallowing them into the abdomen. Then sit upright facing east, aligning the celestial origin with the earthly essentials, and extend the fourth finger. If it does not open, this is an omen that the myriad spirits are intact and death has not come. If it suddenly opens, this signifies that heaven and humanity cannot save, the spirit and *qi* have departed the body—an omen of death. To determine the day of death, fix it according to the Five Phases’ day. If the day is Metal, death will come on the third day after the omen. For Wood, the fourth day; for Water, the fifth; for Earth, the seventh; for Fire, the ninth. Once the ghostly emissaries come to pursue, and the day of death is known, employ the Five Illusory Arts to feign life.\n\nThe Five Illusory Methods avert calamities from heavenly tribulations above and the exhaustion of great destiny below. If faced with the tribulation of heavenly waters—where the heavens tilt and the depths overflow, rivers and seas swell to emptiness, floods surge and spread, mountains and peaks vanish, the watery wheel revolves in all four directions, and yin essence emerges—leaving the world with no place to stand and the heavens with no void, vast and desolate, devoid of all people—one may use this method to feign and enter water without perceiving it. If one knows the tribulation of heaven and earth’s wind and fire—where flames congeal the void, raging flames race through the vast expanse, the empty and dark sea burns, mountains are blown away, the dark heavens above and the dark earth below vanish, and all the myriad existences turn to ash—one may use this method to feign and enter as if in tranquil meditation. If all is war, with battles raging on all sides, lands annexed, corpses piled like mountains, and blood flowing like seas, one may use this method to feign so that ordinary people cannot see one’s form, and one may wander the clouds unobstructed. If faced with the peril of the three limits, the calamity of emptiness and doom, the convergence of great and minor destinies, the mutual devouring of fetal fortune and official salary, or a fate that meets death, one may use this method to feign so that creation cannot alter it, yin and yang cannot shift it, ghosts and spirits cannot know it—and one may live to one hundred twenty years, becoming a person of long life.\n\n**Wei Furén of the Southern Peak** continued: The vulgar of the dusty world, the unlearned, though they revere the Dao with sincere hearts and enter the famous mountains, do not recognize the numinous fungus when they encounter it and have no method when facing tigers and leopards. How is this different from throwing oneself into a place of death? Many who initially sought long life have instead met untimely demise. I pity these people and once petitioned the Celestial Emperor, who bestowed this scripture upon me. With the Five Talismans and True Registers, one may execute evil and behead monsters, restrain tigers and wolves, cause the myriad demons to hide their traces, and the hundred ghosts to flee their forms—enabling all who cultivate the true to attain the Dao of non-action. Naturally, the mountain forests are pure and still, the numinous fungus blooms with dew, gold and jade emerge, and refined *qi* suffuses the air. Some may consume the fungus and wear coarse cloth, dwell in truth and savor the Dao, refining the spirit to irrigate the human and divine—how could this not be peace?\n\n**The Five Talismans’ True Texts:**\nChoose the terrain when dwelling in the mountains. Mountains have nobility and baseness; *qi* has life and death. When desiring to reside, one must select the terrain. Where great mountains form, small mountains are noble; where small mountains form, great mountains are noble. Where rocky mountains form, earthen mountains are noble; where earthen mountains form, rocky mountains are noble. Among such mountains—great or small, earthen or rocky—those with many mountains paying homage are noble. Selecting such noble mountains, where the five fortunes of vital *qi* converge, one may dwell in secluded grottoes and abodes, nestle in cliffs and peaks, or thatch a hut and befriend cranes and deer. Those who reside here long may practice the arts of harmonious nurturing and attain long life. Why? Because their yang essence is robust and refined *qi* suffuses them.\n\n**Discerning Grotto Abodes:**\nWhat are called *grottoes*, *abodes*, *caverns*, *caves*, and *hollows*? Mountains facing east are called *grottoes*; those facing south, *abodes*; those facing southeast, *cliffs*; those facing southwest, *caverns*; those facing north, *hollows*; and those facing northeast, *pitfalls*. Those who dwell in grottoes, abodes, cliffs, and caverns naturally receive the descent and protection of lofty perfected immortals, transcendent scholars, and reclusive gentlemen, thereby attaining the mysterious and wondrous. Those who dwell in hollows and pitfalls will be pressed and violated by poisonous insects, fierce beasts, old demons, and mountain spirits—because these places all reverse the proper *qi* of heaven and earth.\n\n**Verifying and Recognizing the Numinous Fungus:**\nThere are the cinnabar fungus, azure fungus, flesh fungus, purple fungus, golden fungus, immortal fungus, herbaceous fungus, orchid fungus, jade fungus, fruit fungus, crimson fungus, the fungus that sways without wind, the fungus that shines with divine light at night, the pristine and fragrant fungus, the fungus where grotto heavens and cranes cry, the numinous fungus, the jade-grain fungus, the cloud-dew pure fungus, the azure-jade white-stemmed fungus, the five-brightness nine-radiance fungus, the yang essence pristine medicine fungus, the Great One’s eight-wind fungus, the brocade-patterned purple-stemmed fungus, the light-containing jade-green fungus, and the azure cinnabar pristine blossom fungus.\n\nThe above twenty-four varieties of *lingzhi* fungi—each time one obtains a single specimen and consumes it, the partaker may attain a lifespan of a thousand years.\n\n**Five Talismans of True Form**\n- The Azure Emperor’s Talisman, governed by the Wood Virtue and the Year Star Lord of the East\n- The Vermilion Emperor’s Talisman, governed by the Fire Virtue and the Sparkling Deluder Star Lord of the South\n- The White Emperor’s Talisman, governed by the Metal Virtue and the Grand White Star Lord of the West\n- The Black Emperor’s Talisman, governed by the Water Virtue and the Chronographic Star Lord of the North\n- The Yellow Emperor’s Talisman, governed by the Earth Virtue and the Quelling Star Perfected Lord of the Center\n\n**Five Divine Incantations**\n- The Azure Emperor’s Incantation: *\"By the Fire Mandate, the Celestial Lad and Heavenly Sovereign seize—hasten, hasten, as in the statutes and ordinances!\"*\n- The Vermilion Emperor’s Incantation: *\"By the Starry Maw of the Celestial Dipper and the Great Primordial, seize—hasten, hasten, as in the statutes and ordinances!\"*\n- The White Emperor’s Incantation: *\"By the White-Clad Four Spirits and the Great Void, seize—hasten, hasten, as in the statutes and ordinances!\"*\n- The Black Emperor’s Incantation: *\"By the Five Stars guarding the Dipper and the Five Emperors, seize—hasten, hasten, as in the statutes and ordinances!\"*\n- The Yellow Emperor’s Incantation: *\"By the Dragon’s Radiance, Heavenly Peng, and Black Slayer, seize—hasten, hasten, as in the statutes and ordinances!\"*\n\n**Discerning the Upright and the Perverse**\nWhenever dwelling in a hut, a mountain, or a grotto, one must discern the upright from the perverse. The method is already prepared within the hut—some may thereby ascend and be uplifted.\n\n**Gathering the Fungus**\nWhen gathering *lingzhi*, one should do so during the third month, the time when mountains open and the numinous fungus appears. Deploy the Five Talismans to unveil it, and it may naturally be obtained. Seek it on the proper day, with phoenix scripts and dragon seal-characters, and it may be found.\n\n**Auspicious Omens of the Fungus**\nWherever the fungus resides, there are sure to be extraordinary signs: by day, five-colored clouds densely cover the area; by night, rosy light suffuses and coils around it. Or one may see qi phenomena rising and falling hundreds or thousands of feet high, resembling serpents.\n\n**Talisman for Certain Victory in Games of Skill**\nDraw this talisman on paper according to the required dimensions, following the prescribed method. Place it beneath the left foot for men, the right for women—great efficacy will ensue.\n\n**Talisman of the Most High Lord Lao for Entering Mountains**\nInscribe this in cinnabar on plain paper, writing horizontally. Carry it when traveling through the world, and no misfortune shall befall you.\n\n**Talisman of the Perfected for Protection Against Mountain Spirits**\nWear this for a year when entering mountains, and mountain spirits will not dare approach, nor will the hundred ghosts be able to seize you.\n\n**Wood-Dissolving Talisman**\nOn a *jiǎ* or *yǐ* day (first or second of the ten Heavenly Stems), inscribe this talisman in cinnabar on paper and burn it to ingest. Face east, and if the affliction is as severe as death, it will depart after one day. Take the patient’s headscarf or turban and place it outside, substituting a bamboo effigy in their stead. The person will have already fled far away to another land—do not turn back or harbor concerns.\n\n**Five Methods of Transforming Form**\n- **Metal Method of Vanishing Form Talisman**\n\n**Lord Renhuang says:** Those of the Metal destiny, following this diagram, shall swallow the Vanishing Form Talisman and carry it within the abdomen. Donning the Concealing Garment and the Invisibility Cap, they shall tread the *gang* steps thrice in accordance with their purpose—thus shall they not perish.\n\n**Wood Method of Vanishing Form Talisman**\n**Lord Renhuang says:** Those of the Wood destiny, having swallowed the talisman, shall be concealed within the transformations of the Earth Deity, where ghosts and spirits shall naturally fail to perceive their form.\n\n**Water Method of Vanishing Form Talisman**\n**Lord Renhuang says:** Those of the Water destiny, having swallowed this talisman and tread the *gang* steps into the directional position, shall be concealed within the transformations of the spirits, where ghosts and spirits shall naturally fail to perceive their form.\n\n**Fire Method of Vanishing Form Talisman**\n**Lord Renhuang says:** Those of the Fire destiny, having swallowed this talisman and tread the *gang* steps into the directional position, shall be concealed within the transformations of the spirits, where ghosts and spirits shall naturally fail to perceive their form.\n\n**Earth Method of Vanishing Form Talisman**\n**Lord Renhuang says:** Those of the Earth destiny, having tread the *gang* steps and swallowed this talisman into the directional position, shall be concealed within the transformations of the spirits, where ghosts and spirits shall naturally fail to perceive their form.\n\nHere ends the *Lower Scroll of the Esoteric Writings of the Three Sovereigns: The Eight Poles Divine Chapters from the Jade Flower Immortal Writ of the Great Clarity’s Golden Portal*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太清金阙玉华仙书八极神章三皇内秘文 经名：太清金阙玉华仙书八极神章三皇内秘文。 撰人不详。 内言及陈搏，当出於北宋。 言符咒法术。 三卷。 底本出处：《正统道藏》洞神部方法类。 太清金阙玉华仙书八极神章三皇内秘文序 九玄之初，二象未构，空洞凝华，灵风集粹，神章结於混成，玉字标於独化，挺乎有无之际，焕乎玄黄之先。 日月得之以照临，乾坤资之以覆载。 於是无上虚皇命元始大圣编于金阙，次於玉章，内秘上玄，未流下土，降鉴有道，乃赐斯文。 故轩辕受符，伏牺受图，高辛得天经，大禹获洛书，神道有摄降，启於兹矣。 又玄元愍俗，历为帝师，人伦浮伪则垂道德，以示淳朴，鬼神杂扰则降此文，以荡妖邪。 斯又西台而隐灵文，东华而秘真诀。 其龙章云篆，非贤不传，戒之不退，用之保专。 虽未得神仙之道，而亦在世游行，已证地仙之果也。 可以玉石作匣，五彩为囊，秘藏丹房，而勿慢轻矣。 太清金阙玉华仙书八极神章三皇内秘文卷上 微正章第一 天皇君曰：太虚之先，寂寥无象，何以至精感激，而真一存焉，真一运行而元气自化。 元气有中之无，无中之有，广不可量，微不可察，氤氲渐着，混元无移，万象之端，兆朕於此。 以清彻明朗者浮之为天，浊滞烦昧者积之为地，平和柔顺者结之为人，至灵刚秀者化之为神，错谬阴戾者散而为异类。 皆禀一气之所生，分万殊而各位，虽群动紏纷而皆可圣矣。 灭而复生，周而复始，道德之体，人神之心，感应不穷，未尝倍於动用之境矣。 故道者乃虚无之象，造化之根，神明之本，天地之源。 其大无外，其微无内，浩旷无端，杳冥无际，而至幽靡测，而大明垂光，至静无心而品物有方。 混元无物，寂悄无声，万象以之而生，五行以之而成。 生者有极，成者有亏，生生成成，今古湛然不移，此之为道也。 德者，天地所禀，阴阳所资，经以五行，纬以四时，牧之以君，训之以师，幽冥动植，咸畅其宜，恩流不息，群生不知此之为德也。 是知道德者，乃天地之祖也； 天地者，乃万物之父母也； 罗天之尊者，乃虚无之纪纲也； 八极之神者，乃天地之柄也； 日月清明者，乃天地之度数也； 万星群象者，乃天地之变道也； 五行六气者，乃天地之枢机也； 帝王国君者，乃三才之主总也； 群品之类者，乃阴阳之移气也； 精邪鬼怪者，乃天地之影响也； 灵芝仙药者，乃精明纯粹所化也。 是知万物之源者，皆道德为根，象帝之先，真一之为本也。 神宗章第二 天皇君曰：天地者，不能自有生也。 生天地者，太极也。 太极者，不能自运也。 运太极者，真精也。 真精者，自然运化也。 惟神惟明，是曰虚皇，高居九清，乃司玄化。 总御万灵者，曰元始君也。 元始君者，一曰盘古真人，二日九皇都主，三曰八极神王，四曰大罗仙总持。 天形如巨盖，日月未着明，星辰未着光，玄元虚旷，况荡弥冥，寂寂默默，混沌无名。 上无所系，下无所根，上无八极，下无五岳，上无变通，下无枢机，时元始君混成焉。 常呼吸元气，后生变通，感激真精，至於太极一气，分判而成两仪，上列三清，下分四大劫。 又经四万劫，地生刚须，刚须生滨牵，滨牵生龙，龙生水，岸石山血，血化为大元少母。",
      "translated_text": "**The Supreme Clarity Golden Palace Jade Flower Immortal Writ of the Eight Poles Divine Chapters and Three Sovereigns’ Esoteric Text**\n\n**Title:** *The Supreme Clarity Golden Palace Jade Flower Immortal Writ of the Eight Poles Divine Chapters and Three Sovereigns’ Esoteric Text*. Author unknown. Mentioning Chen Tuan, it likely dates to the Northern Song. Discusses talismans, incantations, and magical arts. Three scrolls. Base text from *Daoist Canon of the Zhengtong Era*, *Methods* section of the *Dongshen* Department.\n\n---\n\n**Preface to *The Supreme Clarity Golden Palace Jade Flower Immortal Writ of the Eight Poles Divine Chapters and Three Sovereigns’ Esoteric Text***\n\nAt the inception of the Nine Mysteries, when the Two Images had yet to take form, the Void congealed in radiant splendor, and the numinous wind gathered in purity. The divine chapters coalesced within primordial chaos, and the jade script emerged from solitary transformation, standing at the threshold of being and non-being, gleaming before the Dark and Yellow. Sun and moon drew from it to illuminate, Heaven and Earth relied upon it to cover and bear. Thereupon, the Supreme Void Emperor commanded the Primordial Beginning Great Sage to compile it within the Golden Palace, inscribe it upon the Jade Chapters, and conceal it within the Upper Mystery. Before it descended to the lower realms, it was bestowed upon those of the Dao, who received this text. Thus, the Yellow Emperor received the talismans, Fuxi received the diagrams, Gaoxin obtained the celestial scriptures, and Great Yu acquired the *Luo River Writ*—the divine way of descent and revelation began here.\n\nMoreover, the Mysterious Origin pitied the world’s degeneracy and, through successive ages, served as the Emperor’s Teacher. When human ethics grew shallow and false, he bestowed the *Dao* and *Virtue* to restore simplicity; when ghosts and spirits caused chaos, he revealed this text to dispel demons and evil. Thus, the Western Terrace concealed its numinous script, and the Eastern Flower sealed its true secrets. Its dragon-script cloud-seal is not transmitted to the unworthy; those who receive it must not retreat, and those who employ it must guard it with devotion. Though one may not yet attain the Dao of immortality, one may wander the world in this life, having already realized the fruit of earthly immortality. It should be stored in a jade or stone casket, wrapped in a five-colored pouch, and hidden within the cinnabar chamber—never treated with negligence or disrespect.\n\n---\n\n**Scroll One of *The Supreme Clarity Golden Palace Jade Flower Immortal Writ of the Eight Poles Divine Chapters and Three Sovereigns’ Esoteric Text***\n\n**Chapter One: The Subtle Rectification**\n\nThe Heavenly Sovereign Lord said: Before the Great Void, there was silence and formlessness. How did the utmost essence stir and resonate, so that the True One abided therein? The True One moved, and the primordial *qi* transformed of itself. The primordial *qi* held the void within the center and the center within the void—vast beyond measure, subtle beyond perception. Gradually, it thickened in misty fusion, unchanging in primordial unity, the origin of the ten thousand forms, their first signs appearing here.\n\nThat which was clear, bright, and luminous floated to become Heaven; that which was turbid, stagnant, and murky accumulated to become Earth. That which was harmonious, gentle, and compliant congealed to become humans; that which was supremely numinous, firm, and refined transformed into spirits; that which was perverse, dark, and contrary dispersed into other kinds. All were born of the single *qi*, divided into myriad distinctions yet each in its place. Though the myriad movements were tangled and chaotic, all could attain sageliness.\n\nExtinguished, they revived; cycling, they renewed—such is the essence of the Dao and virtue, the heart of humans and spirits. Their resonance is inexhaustible, never departing from the realm of activity. Thus, the Dao is the image of emptiness and nothingness, the root of creation and transformation, the origin of spirit and illumination, the source of Heaven and Earth. Boundless without exterior, infinitesimal without interior, vast and unbounded without end, obscure and fathomless without limit—profound beyond measure, yet its great luminosity sheds light; utterly still and without intent, yet the myriad things take form. In primordial unity, there is no thing; in utter silence, there is no sound. The ten thousand forms arise from it, and the Five Phases are completed through it. That which is born has its limit, that which is completed has its decline. Generation upon generation, completion upon completion—through past and present, it remains serene and unchanging. This is the Dao.\n\nVirtue is what Heaven and Earth receive, what yin and yang rely upon, woven with the Five Phases as warp and the Four Seasons as weft. The ruler governs it, the teacher instructs it. In the unseen and the manifest, in movement and stillness, all flourish as they should. Its grace flows ceaselessly, yet the multitude of beings do not know this as virtue. Thus, the Dao and virtue are the ancestors of Heaven and Earth; Heaven and Earth are the parents of the ten thousand things. The revered one who encompasses the heavens is the guiding principle of emptiness and nothingness; the spirits of the Eight Poles are the handles of Heaven and Earth. The clarity of the sun and moon are the measures of Heaven and Earth; the myriad stars and celestial forms are the changing ways of Heaven and Earth. The Five Phases and Six *Qi* are the pivot and mechanism of Heaven and Earth; emperors, kings, and lords are the masters who govern the Three Powers. The multitude of beings are the shifting *qi* of yin and yang; spirits, demons, ghosts, and monsters are the echoes of Heaven and Earth. Divine mushrooms and immortal herbs are transformations of pure essence and luminosity.\n\nThus, the source of the ten thousand things lies in the Dao and virtue as their root, with the True One as their origin, prior even to the Emperor of Forms.\n\n---\n\n**Chapter Two: The Divine Ancestry**\n\nThe Heavenly Sovereign Lord said: Heaven and Earth cannot generate themselves. That which generates Heaven and Earth is the Supreme Ultimate. The Supreme Ultimate cannot move itself. That which moves the Supreme Ultimate is the true essence. The true essence moves and transforms naturally. That which is spirit and illumination is called the Void Emperor, who dwells in the Ninefold Clarity and oversees the mysterious transformations. The one who governs the myriad spirits is called the Primordial Beginning Lord. The Primordial Beginning Lord is also known as: (1) the True Person of Pangu, (2) the Lord of the Nine Sovereigns, (3) the Divine King of the Eight Poles, and (4) the Great Perfected Holder of the Celestial Net.\n\nThe form of Heaven was like a vast canopy. The sun and moon had not yet shone, the stars had not yet gleamed. The Mysterious Origin was empty and boundless, vast and obscure, silent and still—chaotic and nameless. Above, there was nothing to which it was tethered; below, nothing to which it was rooted. Above, there were no Eight Poles; below, no Five Peaks. Above, there was no change or communication; below, no pivot or mechanism. Then the Primordial Beginning Lord emerged within this primordial unity. Constantly inhaling and exhaling the primordial *qi*, he later generated change and communication. Stirred by the true essence, he reached the Supreme Ultimate’s single *qi*, which divided to form the Two Modes. Above, the Three Clarities were arrayed; below, the Four Great Kalpas unfolded. After another forty thousand kalpas, the Earth gave birth to Gangxu, Gangxu gave birth to Binqian, Binqian gave birth to the dragon, the dragon gave birth to water, and the blood of the shore stones and mountains transformed into the Great Primordial Lesser Mother.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1236,
      "start_sentence": 0,
      "end_sentence": 53,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.757047176361084,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太清金阙玉华仙书八极神章三皇内秘文.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "大元少母生能人言，容姿绝妙，常游地藏之间，呼吸元气。 元始知之，与之通气，然后日月有明，星辰有光，五运自分，六气自正。 后经四万劫，元始化为盘古真人，与之开其左心、小肠，后方能育。 又经四万劫，生天皇王，十三头。 天皇王生地皇王，地皇王生人皇王，是有三皇内秘之法，乃斯文也。 然后布列五方，成五岳之神，为五行之主也。 在天为五星、五气，在地为五行、五岳。 东方有东岳之神，乃阳木之君。 南方有南岳之神，乃离明之君。 西方有西岳之神，乃大着之君。 北方有北岳之神，乃灵宰之君。 中央有中岳之神，乃轩辕公孙之帝。 枢以万象之主，掌以交泰之籍也。 天中大罗八天三十二帝，八极有七百二十君，虚无三十六洞天，有八方消魔神王之神也。 上三霄： 苍霄四洞天：日精宝箓洞天，内有日光之主为正，太阳天子为宗，以次神王，以次神仙，在其内者，并主一切世间照临之事。 月华明应洞天，以太阴星阳神为主，月华天女为正，其内神王，其内神仙，并主星辰交变、阴阳否泰、万物休咎之事。 南斗注生洞天，内有南斗长生大帝为主，长生星君为正，内有神王，内有神仙，并主水陆趣生录贵贱之事，掌以群生生死之籍。 北斗七符箓罗洞天，内有北极紫微大帝为主，内有神王，内有神仙，并主斋醮罪福，除断鬼邪、扫荡精魅之事也。 风霄四洞天：宝华神光洞天、太素精阳洞天、金华西玉洞天、积英绝粹洞天。 此四洞天神，四洞天仙，并主文明之职，掌握阴府之事也。 云霄四洞天：太虚神应洞天、七明焰魔洞天、虚境刀利洞天、八极静度洞天。 此四洞天神，四洞天仙，并主以十善行绝之事，统以升仙之职。 此三霄之外，自下至上，以中为度，乃天关之上矣。 中三霄： 烟霄四洞天：紫极静梵洞天、神霄玉清洞天、阳明朱凤洞天、东华青童洞天。 此四洞天神，四洞天仙，并主水府地祇海岳福地之事，三岛十洲地仙散仙剑仙、积德积行修行上士之职也。 霞霄四洞天：羽风虚白洞天、太易和阳洞天、琼云上真洞天、太初集仙洞天。 此四洞天神，四洞天仙，皆得阳明六化阴精大变之功也，主以列仙升天，握以南宫之职。 气霄四洞天：太始玉清洞天、太和四圣洞天、神霄消魔洞天、天华上相洞天。 此四洞天神，四洞天仙，并以主运气劫度，日月魂魄，星辰交失，人主兴废，天地威气，风雨之集聚。 自中以上为度，此三霄凝精阳首，接宇宙，结真气，作宫庭，属三境之所也。 下三霄： 景霄四洞天：太清金阙洞天、神真玄化洞天、木公金母洞天、三元极变洞天。 此四洞天乃玉皇大帝为主，内有神王，内有神仙，皆主天上地下阴府，三统七御，掌握万事之职也。 碧霄四洞天：碧虚太一洞天、紫英夜光洞天、精华太空洞天、玉阳无极洞天。 此四洞天神，四洞天仙，乃玉皇大帝为主，并职天上一切天仙天官、天人得失之事也。 丹霄四洞天：锦林洞天、云林洞天、神精洞天、大罗洞天。 此四洞天以地皇正主，天皇大帝都主，中有神王，中有天官，并主三清圣教，八极灵文之职，检校仙书神诀之事。 九霄之上、八极之外，名曰大罗之天，中有玉清圣境，无上圣宗，无上仙君，大道之母，一气之君，号曰元始也。",
      "translated_text": "The Great Primordial Lesser Mother gave birth to one capable of human speech, whose form and countenance were surpassingly wondrous. She roamed between the earth and the hidden realms, inhaling and exhaling primordial *qi*. The Primordial Beginning Lord perceived this and communed with her in *qi*, whereupon the sun and moon gained their radiance, the stars their brilliance. The Five Movements self-differentiated, and the Six *Qi* self-rectified.\n\nAfter another forty thousand kalpas, the Primordial Beginning transformed into the True Person Pan Gu, who opened her left heart and small intestine, enabling her to bear offspring. After yet another forty thousand kalpas, the Heavenly August Sovereign was born, possessing thirteen heads. The Heavenly August Sovereign begot the Earthly August Sovereign, and the Earthly August Sovereign begot the Human August Sovereign—these are the esoteric methods of the Three Sovereigns, the very essence of this tradition.\n\nThereafter, the Five Directions were arrayed, forming the spirits of the Five Peaks, who became the lords of the Five Phases. In heaven, they are the Five Stars and Five *Qi*; on earth, the Five Phases and Five Peaks. In the east is the spirit of the Eastern Peak, lord of yang wood. In the south is the spirit of the Southern Peak, lord of radiant fire. In the west is the spirit of the Western Peak, lord of great brilliance. In the north is the spirit of the Northern Peak, lord of numinous governance. At the center is the spirit of the Central Peak, the Yellow Emperor of the Gongsun clan. He serves as the pivot of the myriad images and holds the register of harmonious exchange.\n\nWithin the Great Canopy of Heaven, the Eight Heavens of the Thirty-Two Emperors, and the Eight Poles with their seven hundred twenty lords, there are thirty-six Cavern-Heavens of emptiness and void, along with the gods of the Eight Directions who subdue demons.\n\nThe Upper Three Heavens of Radiance:\nThe Azure Radiance’s Four Cavern-Heavens:\nThe Cavern-Heaven of the Solar Essence Treasure Register, wherein the lord of solar light presides as sovereign, the Son of the Great Yang as patriarch, followed by divine kings and immortals. All within govern the illumination of the world.\nThe Cavern-Heaven of the Lunar Splendor Luminous Response, wherein the yang spirit of the Great Yin Star presides as sovereign, the Maiden of Lunar Splendor as matriarch, followed by divine kings and immortals. All within govern the interchanges of stars and constellations, the alternations of yin and yang, the fortunes and misfortunes of the myriad things.\nThe Cavern-Heaven of the Southern Dipper’s Life-Registering, wherein the Great Emperor of Longevity of the Southern Dipper presides as sovereign, the Star Lord of Longevity as matriarch, followed by divine kings and immortals. All within govern the records of sentient beings in water and on land, their nobility and baseness, and hold the registers of life and death for all living things.\nThe Cavern-Heaven of the Northern Dipper’s Seven Talismanic Registers, wherein the Great Emperor of the Purple Tenuity of the Northern Pole presides as sovereign, followed by divine kings and immortals. All within govern the bestowal of blessings and retribution in rituals, the severance of demonic influences, and the eradication of malevolent spirits.\n\nThe Wind Radiance’s Four Cavern-Heavens:\nThe Cavern-Heaven of the Treasure Flower Divine Light, the Cavern-Heaven of the Supreme Simplicity Pure Yang, the Cavern-Heaven of the Golden Flower Western Jade, and the Cavern-Heaven of the Accumulated Essence Absolute Purity. The gods and immortals of these four cavern-heavens all govern the office of civil brilliance and hold authority over the affairs of the netherworld.\n\nThe Cloud Radiance’s Four Cavern-Heavens:\nThe Cavern-Heaven of the Great Void Divine Response, the Cavern-Heaven of the Seven Luminances Flaming Demon, the Cavern-Heaven of the Void Boundary Blade Profit, and the Cavern-Heaven of the Eight Poles Tranquil Crossing. The gods and immortals of these four cavern-heavens all govern the severance of the Ten Good Deeds and oversee the office of immortal ascension.\n\nBeyond these Three Heavens of Radiance, from below to above, the center serves as the measure—this is the realm above the Celestial Pass.\n\nThe Middle Three Heavens of Radiance:\nThe Mist Radiance’s Four Cavern-Heavens:\nThe Cavern-Heaven of the Purple Ultimate Tranquil Brahma, the Cavern-Heaven of the Divine Radiance Jade Clarity, the Cavern-Heaven of the Yang Brightness Vermilion Phoenix, and the Cavern-Heaven of the Eastern Florescence Azure Youth. The gods and immortals of these four cavern-heavens all govern the affairs of the water palaces, earthly deities, sea mountains, and blessed lands, as well as the offices of the island immortals of the Three Isles and Ten Continents, earthbound immortals, sword immortals, and those who cultivate virtue and practice the Dao.\n\nThe Rosy Radiance’s Four Cavern-Heavens:\nThe Cavern-Heaven of the Feathered Wind Void Whiteness, the Cavern-Heaven of the Supreme Simplicity Harmonious Yang, the Cavern-Heaven of the Jade Clouds Upper Perfected, and the Cavern-Heaven of the Primordial Beginning Assembly of Immortals. The gods and immortals of these four cavern-heavens all attain the merit of the six transformations of yang brightness and the great changes of yin essence, governing the ascension of immortals and holding the offices of the Southern Palace.\n\nThe *Qi* Radiance’s Four Cavern-Heavens:\nThe Cavern-Heaven of the Supreme Beginning Jade Clarity, the Cavern-Heaven of the Supreme Harmony Four Sages, the Cavern-Heaven of the Divine Radiance Demon-Subduing, and the Cavern-Heaven of the Heavenly Flower Upper Minister. The gods and immortals of these four cavern-heavens all govern the passage of *qi* through kalpas, the ethereal and corporeal souls of the sun and moon, the conjunctions and deviations of stars, the rise and fall of rulers, the majestic *qi* of heaven and earth, and the gathering of wind and rain.\n\nAbove this center, the Three Heavens of Radiance condense the essence of yang’s origin, connecting with the cosmos, congealing true *qi*, forming palaces and courts, and belonging to the realm of the Three Bounds.\n\nThe Lower Three Heavens of Radiance:\nThe Scenic Radiance’s Four Cavern-Heavens:\nThe Cavern-Heaven of the Great Clarity Golden Portal, the Cavern-Heaven of the Divine Perfected Mysterious Transformation, the Cavern-Heaven of the Lord of Wood and Queen Mother of Metal, and the Cavern-Heaven of the Three Primordials Ultimate Change. These four cavern-heavens are presided over by the Great Emperor of Jade, with divine kings and immortals within. All govern the affairs of heaven above, earth below, and the netherworld, the Three Systems and Seven Governances, and hold authority over the myriad matters.\n\nThe Azure Radiance’s Four Cavern-Heavens:\nThe Cavern-Heaven of the Azure Void Supreme Unity, the Cavern-Heaven of the Purple Essence Night Light, the Cavern-Heaven of the Essence Flower Great Void, and the Cavern-Heaven of the Jade Yang Ultimate Non-Being. The gods and immortals of these four cavern-heavens are presided over by the Great Emperor of Jade and govern all affairs of the heavenly immortals, heavenly officials, and the gains and losses of heavenly beings.\n\nThe Cinnabar Radiance’s Four Cavern-Heavens:\nThe Cavern-Heaven of the Brocade Forest, the Cavern-Heaven of the Cloud Forest, the Cavern-Heaven of the Divine Essence, and the Cavern-Heaven of the Great Canopy. These four cavern-heavens are jointly presided over by the Earthly August Sovereign and the Heavenly August Emperor, with divine kings and heavenly officials within. All govern the sacred teachings of the Three Clarities, the numinous texts of the Eight Poles, and the examination of immortal scriptures and divine talismans.\n\nAbove the Nine Heavens of Radiance and beyond the Eight Poles lies the Heaven of the Great Canopy. Within it is the Sacred Realm of Jade Clarity, the Supreme Sacred Ancestor, the Supreme Immortal Lord, the Mother of the Great Dao, and the Lord of the Single *Qi*, known as the Primordial Beginning.",
      "overlap_context": "later generated change and communication. Stirred by the true essence, he reached the Supreme Ultimate’s single *qi*, which divided to form the Two Modes. Above, the Three Clarities were arrayed; below, the Four Great Kalpas unfolded. After another forty thousand kalpas, the Earth gave birth to Gangxu, Gangxu gave birth to Binqian, Binqian gave birth to the dragon, the dragon gave birth to water, and the blood of the shore stones and mountains transformed into the Great Primordial Lesser Mother.",
      "start_char": 1236,
      "end_char": 2485,
      "start_sentence": 54,
      "end_sentence": 93,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.70053482055664,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太清金阙玉华仙书八极神章三皇内秘文.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "中有上清真境，元皇大道君所居。 中有太清仙境，太上老君所居。 玉京之山，珠林紫实，琼花凤髓，以生其上。 中有八十一路，以通尘世八十一洞天。 天中之祖圣、天中之祖宗、天中之神王、天中之帝君、天中之天官、天中之天仙、天中之天人、天中之大圣、九霄之神、五岳之君，皆五日一朝赴玉京之山。 三境之内，元始之前，虽八天九地万万余里，远近皆集，顷刻之间也。 五岳之下，地仙所职者，北方真武真君。 生伏尘世，祖积阴功，幼慕真风，少习道业，精达造化之源流，深测神变之妙理。 遇玉清君授以斩鬼玉文天书十部，铁镜铜符，以荡阴精妖魅，以散发执玉清天丁剑，披八卦羽化衣服，踏天地龟蛇者是也。 南岳司命者，隋魏夫人也。 东岳司命者，乃紫微王夫人也。 西岳司命者，乃西王母第十三爱女也。 北岳司命者，乃唐臣崔府君也。 中岳司命者，乃唐臣李靖也。 三元罪福官者，乃三茆真君也。 太初之妇为峨媚山道君，汉张子房为王屋 山道君，主五湖四海三涧九江沈溺死人之事。 王喜先生为蓬莱上岛仙主，大景先生涓子为蓬莱中岛仙主，许真君为丹台宫主，管天下神仙功行之事。 杨太君为天台山道君，后为玉皇佐书仙吏。 邵坚为匡庐山小有洞主，陈搏先生管蓬莱下岛仙主，钟离嘉管瑶台宫仙主，又权南洲讲法太师。 是以七十二福地、八十一洞天、十洲三岛小仙、九地隐士、阴府鬼官、酆都神主、山水小使、江海民神，修行仙子未升天者，皆不上於玉籍，名号未列於金简也。 鬼宗章第三 鬼者无形之至灵者也，虚焉神寂而莫识，其妙焉若谷应而不流。 东方八鬼：一曰阴尸之鬼，於东方，状如幼童，多化作女人身，以从天神者。 一曰罗达之鬼，一曰阳明之鬼，一曰赤风之鬼，一曰孤花之鬼，一曰大泉之鬼，一曰汶鸣之鬼，一曰神魔之鬼。 此类八鬼，乃天神所役正直之鬼，以无私意害贼人之性命也。 并居东方岁德之位也。 南方八鬼：一曰乌罗那鬼，一曰天大婆鬼，一曰地雷咤鬼，一曰精灵鬼，一曰九尸鬼，一曰木井鬼，一曰孙道天神鬼，一曰牛女鬼。 此八鬼各皆鸡首人身，身着黄纱服衣，衣朱焰色，随天神为风雹之吏，并居南方火德荧惑之位也。 西方八鬼：一曰纯生鬼，一曰无那魄尸鬼，一日注迷鬼，一曰毫驼鬼，一曰蛮变鬼，一曰天星鬼，一曰皇咤鬼，一曰阴魅鬼。 此八鬼正无私邪，并随天神处断妖邪，斩杀不平之人，并居太白之位也。 北方八鬼：一曰夜叉鬼，一曰伏罗鬼，一曰人帝鬼，一曰祥化鬼，一曰波离鬼，一曰魔吻鬼，一曰执杀鬼，一曰金凤女子鬼。 此八鬼乃北方北帝之用兵，正直无曲，常随北帝君以荡扫诸耗魅，其形状若天神，并居北方危宿辰星之位也。 中央八鬼：一曰僧咤鬼，一曰鸣咤鬼，一曰尾星鬼，一曰海杀鬼，一曰六丁鬼，一曰六甲鬼，一曰玉女鬼，一曰五道鬼。 此八鬼亦随天神，以从五岳，追取死人、送变祸福者，其鬼状若神形，并居中央镇星之位也。 天皇君曰：此五方四十天鬼乃五岳之正吏，五方之正兵，天神之用虚无之正气也。 助天地之德以使，风雷，从五岳之佐，以扫奸诈。 其五方之鬼，每一鬼下各领吏兵三十万，助天地之正气也。 凡欲役使五方之鬼者，亦有法焉。",
      "translated_text": "Within it lies the True Realm of Supreme Clarity, the abode of the Primordial August Lord of the Great Dao. Therein lies the Immortal Realm of Grand Clarity, the abode of the Most High Lord Lao. Upon the Mountain of Jade Capital grow forests of pearls and purple fruits, with jade blossoms and phoenix marrow flourishing above. Within are eighty-one paths, connecting to the eighty-one cavern-heavens of the mortal world.\n\nThe ancestral sages of Heaven, the ancestral lords of Heaven, the divine kings of Heaven, the imperial lords of Heaven, the heavenly officials of Heaven, the heavenly immortals of Heaven, the heavenly beings of Heaven, the great sages of Heaven, the spirits of the Nine Heavens of Radiance, and the lords of the Five Marchmounts—all gather at the Mountain of Jade Capital once every five days. Within the Three Realms, before the Primordial Beginning, though the distance spans the Eight Heavens and Nine Earths, myriad leagues in all directions, all assemble in but a moment.\n\nBeneath the Five Marchmounts, the earthly immortals preside as follows: the True Martial True Lord of the North. Born into the mortal world, he accumulated hidden merits from his ancestors, from youth admired the true wind, and from early years cultivated the Daoist arts. He mastered the origins and currents of creation and deeply probed the wondrous principles of divine transformation. The Lord of Jade Clarity bestowed upon him ten celestial scriptures of the *Slaying Ghosts Jade Texts*, iron mirrors and bronze talismans to dispel yin spirits and demonic illusions. With unbound hair, he wields the jade celestial blade of Jade Clarity, dons the feathered robes of the Eight Trigrams, and treads upon the celestial tortoise and serpent.\n\nThe Director of Fates of the Southern Marchmount is Lady Wei of Sui. The Director of Fates of the Eastern Marchmount is Lady Wang of Purple Tenuity. The Director of Fates of the Western Marchmount is the thirteenth beloved daughter of the Queen Mother of the West. The Director of Fates of the Northern Marchmount is Lord Cui, a Tang minister. The Director of Fates of the Central Marchmount is Lord Li Jing, a Tang minister. The Officers of Sin and Fortune of the Three Primes are the Three Mao True Lords.\n\nThe wife of the Grand Beginning became the Lady of Emei Mountain; Zhang Liang of Han became the Lord of Wangwu Mountain, overseeing the affairs of those drowned in the five lakes, four seas, three ravines, and nine rivers. Master Wang Xi became the Immortal Lord of the Upper Island of Penglai; Master Juanzi of Great Radiance became the Immortal Lord of the Middle Island of Penglai. The True Lord Xu presides over the Palace of Cinnabar Terrace, managing the merits and conduct of immortals throughout the world. Lord Yang became the Lord of Tiantai Mountain and later the Jade Emperor’s celestial scribe. Shao Jian became the master of the Lesser Grotto of Mount Lu; Master Chen Tuan oversees the Immortal Lord of the Lower Island of Penglai. Zhongli Jia presides over the Immortal Lord of the Jasper Terrace Palace and concurrently serves as the Great Preceptor of the Southern Continent, expounding the Dharma.\n\nThus, the seventy-two blessed lands, eighty-one cavern-heavens, minor immortals of the ten continents and three islands, hidden scholars of the nine earths, ghostly officials of the netherworld, divine lords of Fengdu, minor spirits of mountains and waters, and riverine and maritime deities—all Daoist adepts who have not yet ascended to Heaven—are not recorded in the Jade Register, nor are their names inscribed upon the Golden Tablet.\n\n**Chapter Three: The Ghostly Lineage**\n\nGhosts are the utmost numinous beings without form, empty and spiritually quiescent, their wondrousness like an echo in a valley that does not flow.\n\n**The Eight Ghosts of the East:**\n1. The Yin-Corpse Ghost, dwelling in the East, appearing as a young child, often transforming into a woman’s form to follow celestial spirits.\n2. The Luo-Da Ghost.\n3. The Yang-Ming Ghost.\n4. The Crimson Phoenix Ghost.\n5. The Lone Blossom Ghost.\n6. The Great Spring Ghost.\n7. The Wen-Ming Ghost.\n8. The Divine Demon Ghost.\n\nThese eight ghosts are upright spirits employed by celestial deities, without selfish intent to harm mortal lives. They all reside in the position of the Year-Star’s virtue in the East.\n\n**The Eight Ghosts of the South:**\n1. The Wu-Luo-Na Ghost.\n2. The Celestial Great Matron Ghost.\n3. The Earth-Thunder Ghost.\n4. The Spirit-Numinous Ghost.\n5. The Nine-Corpse Ghost.\n6. The Wooden Well Ghost.\n7. The Sun Dao Celestial Spirit Ghost.\n8. The Oxherd and Weaver Girl Ghost.\n\nThese eight ghosts each have the head of a rooster and the body of a human, clad in yellow gauze robes with vermilion flames. They follow celestial spirits as officers of wind and hail, residing in the position of the Fire Star’s virtue in the South.\n\n**The Eight Ghosts of the West:**\n1. The Pure-Living Ghost.\n2. The Wu-Na-Po-Corpse Ghost.\n3. The Bewitching Ghost.\n4. The Hoary Camel Ghost.\n5. The Barbarian-Changing Ghost.\n6. The Celestial Star Ghost.\n7. The Imperial Roaring Ghost.\n8. The Yin-Demon Ghost.\n\nThese eight ghosts are upright and without private malice, following celestial spirits to judge and execute the wicked and unjust. They reside in the position of the Grand White Star.\n\n**The Eight Ghosts of the North:**\n1. The Yaksha Ghost.\n2. The Fu-Luo Ghost.\n3. The Human Emperor Ghost.\n4. The Auspicious Transformation Ghost.\n5. The Bo-Li Ghost.\n6. The Demon-Mouth Ghost.\n7. The Executioner Ghost.\n8. The Golden Phoenix Maiden Ghost.\n\nThese eight ghosts serve as the martial forces of the Northern Emperor, upright and without deceit, ever following the Northern Emperor to sweep away all harmful spirits. Their forms resemble celestial spirits, and they reside in the position of the Danger Star and Chronographic Star in the North.\n\n**The Eight Ghosts of the Center:**\n1. The Monk-Roaring Ghost.\n2. The Crying-Roaring Ghost.\n3. The Tail-Star Ghost.\n4. The Sea-Slaying Ghost.\n5. The Six-Ding Ghost.\n6. The Six-Jia Ghost.\n7. The Jade Maiden Ghost.\n8. The Five Paths Ghost.\n\nThese eight ghosts also follow celestial spirits, accompanying the Five Marchmounts to pursue the dead and deliver karmic retribution. Their forms resemble divine beings, and they reside in the position of the Quelling Star in the Center.\n\nThe Heavenly August Lord said: These forty celestial ghosts of the five directions are the upright officers of the Five Marchmounts, the righteous soldiers of the five directions, and the celestial spirits’ employment of the upright *qi* of emptiness and non-being. They assist the virtue of Heaven and Earth, wielding wind and thunder, following the aides of the Five Marchmounts to sweep away deceit and treachery. Each of the five-directional ghosts commands a host of three hundred thousand spirit-soldiers, aiding the upright *qi* of Heaven and Earth.\n\nTo employ and command the ghosts of the five directions, there is also a method.",
      "overlap_context": "ine kings and heavenly officials within. All govern the sacred teachings of the Three Clarities, the numinous texts of the Eight Poles, and the examination of immortal scriptures and divine talismans.\n\nAbove the Nine Heavens of Radiance and beyond the Eight Poles lies the Heaven of the Great Canopy. Within it is the Sacred Realm of Jade Clarity, the Supreme Sacred Ancestor, the Supreme Immortal Lord, the Mother of the Great Dao, and the Lord of the Single *Qi*, known as the Primordial Beginning.",
      "start_char": 2485,
      "end_char": 3725,
      "start_sentence": 94,
      "end_sentence": 132,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.8061466217041,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太清金阙玉华仙书八极神章三皇内秘文.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "如金日者使西方八鬼，木日使东方八鬼，火日使南方八鬼，水日使北方八鬼，土日使中央八鬼。 欲使之者，先书天皇真形符於黄罗之上，长五寸，阔五寸，以朱书为上，烧作灰，面望天门以香汤吞之。 其符入腹，精神立变，万鬼见之自伏，万神见之自归，以为护身而兔外害矣。 然后於其日方书一鬼名於白纸上，在於面正望天门，念天皇上帝咒三徧，取气三口，吹於印上，用朱砂涂印，面望其方，大呼鬼名一声，用印印於纸上。 鬼名一印，其鬼自现，或六丁、或六甲玉女。 诸鬼细言问之，一切所告之怀，无不遂意。 或为轻风，或为薄雾，或作云霞，或变龙虎，或化万物之形状，或化山林岩石之体，或为羊马，或作飞走，或乘云鹤游戏方外，或促地游四大神洲，观一切万事。 欲断不平之事，取剑一口，长三尺二寸，锋突刃利者，乃左手执剑於天门，右手执天皇上帝之印，念天皇御叹三徧，取气三口，吹在印上，朱砂涂印，剑尖一印，掷剑在空中。 其鬼以知其人意，虽千万里重隔江海，顷刻之间，人头落焉。 天皇君曰：昔有古神人致虚先生，未行内妙，先达变通之理。 将入初程，遂意游四海之外，是以摄御万灵，同臻众妙者，俱不出於斯文焉。 学夫遭遇，专以虚白，勿得情欲违犯也。 将心归正，志守太和，忘意抱淳，渐入仙宗，如有六尘不息，牛牧不忘，情欲不断，俗操不绝者，与吾文异矣。 精宗章第四 天皇君曰：五方天鬼之外，一切小灵并属精魅之宗，虽怪之异，无以助正气之德，皆属私神魔精之类，以吾之御印，以吾之御咒，随即见形，可以役使如家奴仆焉。 吾之法者，使其神也，如烈火焚其秋毫，役其鬼也，若海波漂其枯叶。 正神之外，正鬼之外，有七十二精，后以细述焉。 此鬼天不收，地不管，五岳不御，山海不拘，不从大德，不助真风，好杀好乱，淫邪食血肉，不正之鬼，号曰私神名也。 一名魔魂吞尸精，形如二八女子，丹脸朱唇，绿眉红颊，目澄秋水，体凝脂膏，好着翠蓝，服顶以蛾华冠，人见之多认为仙女。 化成楼宇，以妖气变化宫庭，构人生成疾患，乱我之玄风，使修行之人不康矣。 其鬼精姓任，左眉间有紫毫一茎，长一寸许，本是万年狐狸，历世之久，变化为妹色，惑人者多矣。 修仙学道之士，入山忽见之，但呼其小名曰摩魂吞尸鬼，其鬼闻人言其名而身自灭矣，故曰知根不圣也。 一名五统私神之鬼精，其状如一美男子之貌，独一足，好游世间，淫乱生人之室者，有连年累月不去者，本出於一人家家奴，后死有五统之力。 今世之妇女，言有夫兼寝，生人怪笑怪哭，忽死忽生，空中自笑，忽与人言，遣发不去，着魅阴人，或偷盗外物以助家者是也。 欲去之者，用黄纸五寸，朱书天皇真形符在上，作灰，用香汤，令妇人女子望天门吞之，执天皇上帝印於天门，念天皇咒三徧，取气三口咒入印中，用白纸书五统名迹在上，以朱砂涂印上，印於纸上，令扫人女子用绯袋戴之於头心，即时灭矣。 一名猫毛神，状如三十余男子，皂衣赤足，鸡爪人形，多着阴人，诈称通天神之号，善知未来之事，今之师婆是此神所着也，本出强魂枉死之人也。 一名血尸神，神形如鸟毛之猴，朱目白眉，或化蛇，或化蜘蛛、虾麻之状，多着妇人身中，以食人五脏精华，饮人肌血，令人日瘦，作病命亡，其鬼却化本形复入别人体中，今之男女以传袭痨病是也。",
      "translated_text": "On Metal Days, command the eight ghosts of the West; on Wood Days, the eight ghosts of the East; on Fire Days, the eight ghosts of the South; on Water Days, the eight ghosts of the North; and on Earth Days, the eight ghosts of the Center.\n\nTo employ them, first inscribe the True Form Talisman of the Heavenly August Lord upon yellow silk, five *cun* in length and width. Write it in cinnabar, burn it to ash, and swallow it with fragrant water while facing the Gate of Heaven. Once the talisman enters the abdomen, one’s spirit transforms instantly—all ghosts bow in submission upon seeing it, and all spirits submit and return, serving as guardians to shield against external harm.\n\nThen, on the corresponding day, write the name of one ghost upon white paper, hold it directly before the Gate of Heaven, recite the Heavenly August Lord’s incantation three times, draw *qi* three times, and blow it onto the seal. Coat the seal with cinnabar, face the direction, call the ghost’s name loudly once, and press the seal onto the paper. With each impression of the ghost’s name, the ghost manifests—sometimes as a Jade Maiden of the Six Dings or Six Jias. Question the ghosts in detail, and all their revelations will conform to your wishes. They may appear as a gentle breeze, a wisp of mist, clouds and rosy dawn, or transform into dragons and tigers, myriad forms of things, the bodies of mountains, forests, and cliffs, sheep or horses, flying or running creatures. They may ride clouds and cranes to roam beyond the world or swiftly traverse the Four Great Continents, observing all matters. To resolve injustices, take a sword one *chi* and two *cun* long, with a sharp, protruding blade. Hold the sword in the left hand toward the Gate of Heaven, grasp the Heavenly August Lord’s seal in the right, recite the Heavenly August Lord’s incantation three times, draw *qi* three times, blow it onto the seal, coat the seal with cinnabar, and press the tip of the sword with the seal before casting it into the air. The ghost will instantly comprehend your intent—even if separated by thousands of miles or vast rivers and seas, the target’s head will fall in an instant.\n\nThe Heavenly August Lord said: Long ago, there was a divine sage named Master Zhi Xu, who, before mastering inner mysteries, first grasped the principles of transformation. As he began his journey, he roamed beyond the Four Seas at will. Thus, in commanding the myriad spirits and attaining the multitude of wonders, none transcended this text. For those who encounter it, focus on emptiness and purity; do not let passions and desires violate these precepts. Align the heart with uprightness, guard the mind with Great Harmony, forget worldly concerns and embrace simplicity, gradually entering the lineage of immortals. If the Six Dusts remain unceasing, worldly attachments linger, desires persist, and mundane habits endure, one diverges from my teachings.\n\n**Section on the Lineage of Spirits**\nThe Heavenly August Lord said: Beyond the celestial ghosts of the five directions, all lesser spirits belong to the lineage of *jing* and *mei*. Though their anomalies differ, they cannot aid the virtue of the upright *qi* and all belong to the category of private gods and demonic spirits. With my imperial seal and my imperial incantation, they manifest immediately and can be commanded like household servants. My method employs spirits as fiercely as wildfire burning autumn down, and commands ghosts as swiftly as ocean waves sweeping away withered leaves.\n\nBeyond the upright spirits and upright ghosts, there are seventy-two *jing* spirits, which will be described in detail later. These ghosts are unclaimed by Heaven, ungoverned by Earth, unruled by the Five Marchmounts, unbound by mountains and seas. They do not follow great virtue nor aid the true wind, delighting in killing and chaos, lewdness and bloodshed. Such unrighteous ghosts are called private gods.\n\nOne is named the *Mo Hun Tun Shi Jing* (Demon-Soul Corpse-Devouring Spirit), appearing as a sixteen-year-old girl with a cinnabar face, vermilion lips, green eyebrows, and rosy cheeks. Her eyes are as clear as autumn waters, her body as smooth as congealed fat. She favors emerald robes and wears a moth-winged crown atop her head. Most who see her mistake her for an immortal maiden. She transforms into towers and palaces, using demonic *qi* to alter halls and chambers, causing illnesses and disrupting the mysterious wind, hindering the well-being of cultivators. This ghost spirit is surnamed Ren, with a single purple hair between her left eyebrow, about an inch long. Originally a ten-thousand-year-old fox, she has lived through countless ages, transforming into a seductive form to bewitch many. When Daoist cultivators encounter her in the mountains, they need only call her by her lesser name, *Mo Hun Tun Shi Gui*, and upon hearing it, her form vanishes instantly. Thus, knowing the root dispels the unholy.\n\nAnother is named the *Wu Tong Si Shen Zhi Gui Jing* (Five-Unions Private God Ghost Spirit), appearing as a handsome man with a single foot. He wanders the world, causing lewdness and disorder in people’s homes, sometimes lingering for years without departing. He originated from a household servant who, after death, gained the power of the Five Unions. In modern times, when women claim to share a bed with their husbands yet experience strange laughter, weeping, sudden deaths and revivals, or hear voices laughing in the air, speaking without cause, or when possessions vanish inexplicably, it is often this spirit afflicting them. To expel him, use a five-*cun* piece of yellow paper, inscribe the True Form Talisman of the Heavenly August Lord in cinnabar, burn it to ash, and have the afflicted woman swallow it with fragrant water while facing the Gate of Heaven. Hold the Heavenly August Lord’s seal toward the Gate of Heaven, recite the incantation three times, draw *qi* three times and chant it into the seal, then write the name of the Five Unions on white paper. Coat the seal with cinnabar, press it onto the paper, and have the woman carry it in a red silk pouch on her head. The spirit will vanish immediately.\n\nOne is named the *Mao Mao Shen* (Cat-Fur Spirit), appearing as a man over thirty, dressed in black with bare feet and chicken-like claws. He often possesses women, falsely claiming the title of a celestial spirit and foretelling the future. Modern *shi po* (spirit mediums) are often possessed by this spirit, which originated from the restless soul of a wrongfully deceased person.\n\nAnother is named the *Xue Shi Shen* (Blood Corpse Spirit), appearing as a monkey covered in bird-like fur, with red eyes and white eyebrows. It may transform into a snake, spider, or shrimp-like form. It often possesses women, consuming their visceral essence and drinking their blood, causing emaciation, illness, and death. After killing, it assumes its original form and enters another person’s body. Modern cases of consumptive diseases passed between men and women are examples of this.",
      "overlap_context": "ighteous soldiers of the five directions, and the celestial spirits’ employment of the upright *qi* of emptiness and non-being. They assist the virtue of Heaven and Earth, wielding wind and thunder, following the aides of the Five Marchmounts to sweep away deceit and treachery. Each of the five-directional ghosts commands a host of three hundred thousand spirit-soldiers, aiding the upright *qi* of Heaven and Earth.\n\nTo employ and command the ghosts of the five directions, there is also a method.",
      "start_char": 3725,
      "end_char": 5020,
      "start_sentence": 133,
      "end_sentence": 159,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.03897452354431,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太清金阙玉华仙书八极神章三皇内秘文.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "其精本出吞毛之国老犬精也。 一名猪角白腹鬼，精形如七八岁童子，紫衣乌足，其形多化为谷水之状，人悮食之，令人作病，无言默语而至死者是也，号为不语病。 修仙之士但欲饮水，映面无光，或欲饮食，见食变色者是此怪在内也，慎勿食之。 其鬼本出於产死之强魂也。 一名女叉精，状如粗恶妇人，着青衣，於夜间多着小儿腹内，以盗小儿之魂魄，令小儿夜啼是也。 一名条了精鬼，总领三四卒小儿，形状不等，有驴首人身，黄衣面赤，执一囊服，内含邪气，爱游八方以散时疠於人。 今人言天行病者，乃是此鬼也，乃变疡气。 其鬼本出於五行不正之气，是人强魂所化也。 一名咬拆曲石神，状如少女，夭姿姝色，或变为人属，爱夜寝，若梦阴阳，相夺人之真气。 其鬼本出人世采阴坐禅不成之辈，又名清灵善爽之鬼，今人言夜梦鬼交是也。 天曹不收，地神不管，天地私神，八山之精也。 一名雷声急，状若伏虎，花斑绿项，爱夜游高峰之上，於人无患，乃万岁铜矿之精是也。 一名春琼泉，状若二八女子，三髻，黄衣长裙，赤足，多执火夜行，不过数步自灭矣。 乃万年金苗之精也。 一名束少年，状若小童，顶帽撒履，衣白貌秀，多日出时执一禽鱼，戏游於人路，乃万年银苗之精也。 一名双石尸精，其形朱发披散，诽衣碧目，身长丈许，多在山中，与人相应，或叫人姓名，多於石堆崄峻处崩崖滚石，以打损人者多矣。 本出山中石打死无主孤魂之精也。 此乃天地不收，江河不拘，多害生灵，损人性命。 一名鱼白水耗精，凶恶揪池多有之。 其变形状，若一阴人之覆浮於水边，人见之救拔而多溺於水，此怪乃水溺死强魂之精也。 一名朱蛇白面精，乃鬼形多游水边，口叫要人替声，人见之行十步许，其鬼以气喷人，其人不由自己心，乃投身於水也，此者亦水溺死之强魂也。 一名王玉真，形状如小女，带峨冠华服，骨秀颜姿丽，青衣朱履，常领侍女两三人，其鬼多处空宅，石岩、围坛、深山人寂之处，以魅少年之君，十有九死。 凡见之者，右眉间有青毫一茎，长二寸许，好歌曲，善诗词，以至昏暮好惑生人之心，今之山谷中甚有焉。 其精本出於三千年白蛇之精也。 一名秋草叶精，其状乃少女之形，貌润体钳，红帛裹髻。 或见相逐，常有五七人，能化水为酒浆，善吟咏。 此怪以大湫远路孤静人稀山谷花木间有之，其怪本出於年深拱鼠之精也。 一名朱眉魂，状如恶鬼之形，两首一身，马足虎手，赤体无衣，长数丈余，多诈称神人，又诳为土地，人不知其根者，以香火供养，积日之久，无不贼人之命矣。 其精本出於年深者树之精也。 一名霍公孙，状若飞鸟，两首一身，锦毛赤觜，大小如鸡之形，其怪亦能呼吸人之精神，渐令人死矣。 此乃数千年伏翔之精也。 一名海僧尼，状乃一鱼，形如女子，面首甚有姝色，骨冠骨髻，游於山水，或入河海水中。 此怪见人多吐气，以混水气向人，人着者无不死矣。 故人谓之曰有鱼妇人头，善能言语者是也。 此乃年深人魂之精也。 一名鹿身戒尸精，乃人形也，若女子衣白孝服，多啼哭於水边，人见之欲问，令人死矣。 此怪乃千年鲤鱼之精也。 一名恶毒鬼，其形如人状，人多不见，悮入水中，在水执人脚足不能出，令人至死，不能得出矣。",
      "translated_text": "The essence of this spirit originates from the old dog spirit of the *Tun Mao* (Feather-Swallowing) nation. Another name is the *Zhu Jiao Bai Fu Gui* (Pig-Horned White-Bellied Ghost). Its essence appears as a child of seven or eight, clad in purple with black feet, often transforming into the likeness of grain or water. If one mistakenly consumes it, it causes illness—silent, speechless, and leading to death—known as the \"speechless disease.\" Daoist practitioners who desire only to drink water, their faces lacking luster, or those who lose their appetite at the sight of food, are afflicted by this entity within. Beware of consuming it.\n\nThis ghost arises from the restless soul of a woman who died in childbirth. Another name is the *Nü Cha Jing* (Female Fork Spirit), resembling a coarse, ill-favored woman in blue robes. It often possesses the bodies of children at night, stealing their souls and causing them to cry incessantly. Another is the *Tiao Liao Jing Gui* (Whipped Sprite Ghost), commanding three or four child-like attendants of varying forms—some with donkey heads and human bodies, yellow robes and red faces, carrying a sack filled with malevolent qi. It roams the eight directions, spreading pestilence among people. Modern references to epidemic diseases (*tian xing bing*) are manifestations of this ghost, which transforms into miasmic vapors.\n\nThis ghost emerges from unbalanced *qi* of the Five Phases, formed from the restless souls of the wrongfully deceased. Another name is the *Yao Chai Qu Shi Shen* (Biting-Breaking Crooked Stone Spirit), appearing as a young maiden with delicate beauty. It may transform into a human figure, fond of nocturnal slumber, and in dreams, it engages in yin-yang unions to steal a person’s true qi. This ghost originates from those who practiced *cai yin* (yin absorption) meditation but failed, also called the *Qing Ling Shan Shuang* (Clear Spirit and Bright Soul) ghost. Modern accounts of nocturnal ghostly unions refer to this. Unclaimed by celestial bureaus or earthly deities, it is a private spirit of heaven and earth, the essence of the eight mountains.\n\nAnother is named *Lei Sheng Ji* (Thunderous Roar), resembling a crouching tiger with a flowered, green neck. It roams high peaks at night but poses no harm to humans—it is the essence of a millennium-old copper vein. Another is *Chun Qiong Quan* (Spring Jade Spring), appearing as a sixteen-year-old girl with three buns, yellow robes, a long skirt, and bare feet, often holding fire and walking at night, extinguishing after a few steps. It is the essence of a millennium-old gold ore.\n\nAnother is *Shu Shao Nian* (Bound Youth), resembling a small boy with a hat and loose shoes, dressed in white with a refined appearance. It often appears at sunrise, holding a bird or fish, playing on human paths—it is the essence of a millennium-old silver vein. Another is the *Shuang Shi Shi Jing* (Double Stone Corpse Essence), with crimson, disheveled hair, tattered green robes, and green eyes, towering over ten feet tall. It lurks in mountains, responding to people, calling their names, and often causes rockslides or rolling stones in treacherous terrain, harming many. It arises from the unclaimed, solitary souls of those crushed to death by stones in the mountains. Unclaimed by heaven or earth, unrestrained by rivers, it harms living beings and takes lives.\n\nAnother is the *Yu Bai Shui Hao Jing* (Fish-White Water-Wasting Spirit), fiercely lurking in ponds. It transforms into the likeness of a drowned woman floating by the water’s edge. Those who see it and attempt to rescue her often drown—this entity is the essence of a restless soul who drowned. Another is the *Zhu She Bai Mian Jing* (Crimson Snake White-Faced Spirit), a ghostly form often seen by water, calling out to demand a replacement. If one encounters it and walks ten steps, the ghost exhales its qi, overpowering the person’s will and causing them to drown. This, too, is the essence of a drowned soul.\n\nAnother is *Wang Yu Zhen*, appearing as a small girl in an ornate crown and splendid robes, with delicate bones and a lovely face, dressed in blue with crimson shoes. She is often accompanied by two or three maidservants. This ghost frequents empty houses, rocky cliffs, walled altars, and secluded mountain depths, bewitching young men, nine out of ten of whom die. Those who see her have a single blue hair between their right eyebrows, about two inches long. She loves songs and poetry, and as dusk falls, she enchants the hearts of men. Many such cases exist in mountain valleys. Her essence originates from a three-thousand-year-old white snake spirit.\n\nAnother is the *Qiu Cao Ye Jing* (Autumn Grass Leaf Spirit), appearing as a young maiden with a moist complexion and a restrained demeanor, her hair wrapped in red silk. If encountered, she is often followed by five to seven companions. She can transform water into wine and is skilled in recitation. This entity dwells in vast pools, remote paths, and secluded mountain valleys with sparse populations and lush flora. It arises from the essence of an ancient, arching rat.\n\nAnother is the *Zhu Mei Hun* (Crimson-Browed Soul), resembling a malevolent ghost with two heads on one body, horse feet, tiger hands, a red, naked form, and a height of over ten feet. It often deceitfully claims to be a divine person or falsely poses as a local earth deity. Those unaware of its origins who offer incense and worship over time will inevitably have their lives taken. Its essence comes from an ancient tree spirit.\n\nAnother is *Huo Gong Sun*, resembling a flying bird with two heads on one body, colorful feathers, and a red beak, about the size of a chicken. This entity can also drain a person’s spirit through breath, gradually leading to death. It is the essence of a thousand-year-old soaring spirit. Another is the *Hai Seng Ni* (Sea Monk Nun), appearing as a fish with the form of a woman, her face and head strikingly beautiful, wearing a bone crown and bone hairpin. She roams mountains and waters, sometimes entering rivers and seas. When she encounters people, she often exhales, mixing water vapor with her breath to strike them—none survive. Hence, she is called the \"fish with a woman’s head,\" known for her eloquence. She is the essence of an ancient human soul.\n\nAnother is the *Lu Shen Jie Shi Jing* (Deer-Bodied Precept Corpse Essence), appearing human in the form of a woman dressed in white mourning clothes, often weeping by the water’s edge. Those who see her and attempt to inquire are doomed—this entity is the essence of a thousand-year-old carp. Another is the *E Du Gui* (Vicious Poison Ghost), appearing human but often unseen. If one mistakenly enters water, it seizes their feet, preventing escape and leading to death. None can break free.",
      "overlap_context": "person.\n\nAnother is named the *Xue Shi Shen* (Blood Corpse Spirit), appearing as a monkey covered in bird-like fur, with red eyes and white eyebrows. It may transform into a snake, spider, or shrimp-like form. It often possesses women, consuming their visceral essence and drinking their blood, causing emaciation, illness, and death. After killing, it assumes its original form and enters another person’s body. Modern cases of consumptive diseases passed between men and women are examples of this.",
      "start_char": 5020,
      "end_char": 6301,
      "start_sentence": 160,
      "end_sentence": 197,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.08799505233765,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太清金阙玉华仙书八极神章三皇内秘文.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "一名黄孝白面精，状若小蛇，朱鳞，有足五只，多游於井边，人见之以为投井，使人自然生心不由己，而投井死矣。 此乃投井之强魂所化也。 一名星咤婆，其形黑气，盘结於井口之空，人或见之，无不落井死矣。 此乃井泉之鬼冤魂所化也。 一名全全幽魂精，其不见形状，如在水底，人多闻哭笑之声者是也。 能兴云雾，亦能贼人性命，天地不收，五岳不管，此怪本出千年蟹之精也。 一名夏佳毒精，形若白蛇，当顶有一角，多藏妇人腹中，令妇人面黄发脱者是也。 或临产难，化白蛇之形而作光去矣。 此乃臭死尸阴毒之气所化也。 一名黄远天，状若鬼形，多藏妇人腹中，故隔腹与母言者是也，其妇人之命亦不长久矣。 此乃千年草木之精所化也。 一名张彦最，状若一妇人，诽衣乱发，好於宅舍中盗物，而人或见现形者，此乃冤灵死鬼之魂，本人家奴婢所化也。 一名刘远横，状若婴儿，逐物变化，多着泥子之身，故人家男女以供养坚子，后有灵验，致得祆怪变成凶祸者，此乃本是年深泥人所化也。 一名高阳哥，状若少女，容姿甚粗，多好淫乱，其或与人交感，世有男女执爱死，而后复有魂来着人成事者是也。 本出死人中强魂所化也。 一名月娘精，状若妇人，好淫乱色欲，多着泥神之体，令人或入庙宇，见庙中女流之神貌端容洁，心生爱慕，忽至昏暮来宿以乱人者，乃坚神所得精化也。 一名马元师子精，弟兄五人，状若鬼形，赤体无衣，一鬼将一扇，一鬼将一小葫芦，一鬼将一气袋，此是四神五怪，往往不利，善驭风砂，游历世间以着生人，令人作寒热，欲饮冻水，今虐疾者是也。 此乃五方五耗之鬼也。 一名杜昌精，形如黑鼠，好游人世宫室厅宅中，以异耗矣。 今之仓库房内无故物失坏者是也。 此乃是千年老鼠之精也。 一名社镮孝尸精，形如朱鼠，大小不测，藏於黑处，以气远噀人影，人着其气，无不患恶疮而死也。 此乃岁深故物之精也。 一名黑花精，形如一犬，非有犬毛，赤皮六眼，多藏孤静处，远见人以一气噀人，人着，令人心内忽然烦闷，吐涎吐血而成其疾以死矣。 此乃宅中不正之神精也。 一名牛首百都精，肉角当顶，青面朱目，鹰觜虎项，马足人身，多游山谷以陨人之命，此乃师子国一老马之精，始得龙珠，后变形不正，次化人身，散入八方，今之山谷多有之矣。 一名桂龙晚天精，其状龙形无角，善役云雾，多游水塘中，好食生人脑髓，此乃西川龙移山迹水怪精也。 一名邓巢黄天精，其状共一大龟鳌，而当顶有角，四目，好游水中，作坏堤岸，碎河口，亦多从足心、手心饮生人脑髓，此乃水怪之精也。 一名曹洪天眼精，散发一足，若女子之形，以游山谷，见人多笑举足，乘风能飞，吐气变化，善能吃生人之命，此是天怪，本乃万年枯柏之精也。 一名桃奴新，其形一黄肿妇人，着淡衣，夜执大出，昼亦现之，多在此岩窟穴，或久静宅房皆有焉。 人见之无不疾病，此乃千年虾蛛之精也。 一名宋丘孤魂精，状乃一妇人，多游山林，常哭於草下，有人问之，多言我是良人家之妇人。 因循其端，无不成祸矣。 识之者其鬼精无左耳，此乃千年野狸猫之精也。 一名吴爱爱精，状乃女形，口称良人家，常抱一小儿，或携一两侍女，好游山谷，好魔障修行人之心，欲学道者不遇此书辩邪正，甚有乱而有损也。",
      "translated_text": "One is the *Huang Xiao Bai Mian Jing* (Yellow-Mourning White-Faced Essence), appearing as a small serpent with vermilion scales and five feet, often roaming near wells. Those who see it mistake it for someone about to leap into the well, compelling them to act against their will and drown. This entity is the transformed essence of a strong soul from those who died by throwing themselves into wells.\n\nAnother is the *Xing Zha Po* (Star-Chattering Crone), a mass of black qi coiled around the mouth of a well. Anyone who sees it inevitably falls in and dies. This is the vengeful spirit of a well-spring ghost.\n\nAnother is the *Quan Quan You Hun Jing* (Utterly Hidden Ghost Essence), whose form is invisible, lurking in the depths of water. Often, one hears only its wails and laughter. It stirs clouds and mist and can harm human lives, unclaimed by heaven or earth, ungoverned by the Five Peaks. This entity originates from the essence of a thousand-year-old crab.\n\nAnother is the *Xia Jia Du Jing* (Summer Charm Poison Essence), resembling a white serpent with a horn atop its head. It often hides within women’s bellies, causing their faces to yellow and their hair to fall out. During difficult childbirth, it transforms into a white serpent and vanishes in a flash of light. This is the essence of the yin-toxic qi of a rotting corpse.\n\nAnother is the *Huang Yuan Tian* (Yellow Distant Heaven), appearing ghostlike and often concealed within women’s bellies. It speaks to the mother from within, though the woman’s life will not be long. This is the transformed essence of a thousand-year-old plant spirit.\n\nAnother is the *Zhang Yan Zui* (Zhang Yan the Most), taking the form of a disheveled woman in tattered clothes, fond of stealing from households. Those who glimpse its true form encounter it as the vengeful spirit of a wronged ghost, originally the soul of a household servant.\n\nAnother is the *Liu Yuan Heng* (Liu Yuan the Perverse), resembling an infant and capable of transforming to follow objects. Often, it inhabits clay figurines, so when families worship and offer to such idols, they later gain uncanny efficacy—only for the entity to bring misfortune and calamity. This is the essence of an ancient clay effigy.\n\nAnother is the *Gao Yang Ge* (Gao Yang the Elder Brother), appearing as a coarse young woman with a penchant for lewdness. If she engages with a person, they may die from obsessive attachment, only for her spirit to return and possess another. This is the essence of a strong soul from the dead.\n\nAnother is the *Yue Niang Jing* (Moon Maiden Essence), taking the form of a woman with a fondness for lust and desire. Often inhabiting clay deities, she appears in temples as a woman of refined beauty, inspiring infatuation. By dusk, she arrives to seduce her victim—this is the transformed essence of a spirit idol.\n\nAnother is the *Ma Yuan Shi Zi Jing* (Horse Origin Lion Essence), a brotherhood of five, appearing as naked, red-bodied ghosts. One carries a fan, another a small gourd, and a third a qi pouch. These four spirits and five demons bring misfortune, commanding wind and sand to afflict the living with chills and fever, driving them to crave icy water—symptoms of malaria. They are the Five Directions’ Five Wasting Ghosts.\n\nAnother is the *Du Chang Jing* (Du Chang Essence), shaped like a black rat, fond of wandering through halls and chambers of human dwellings to cause strange losses. When items in granaries or storerooms inexplicably vanish or spoil, this is its doing. It is the essence of a thousand-year-old rat.\n\nAnother is the *She Huang Xiao Shi Jing* (Earth Altar Filial Corpse Essence), resembling a vermilion rat of indeterminate size, lurking in dark places. It exhales qi from afar to strike a person’s shadow, and those afflicted inevitably suffer from malignant sores and die. This is the essence of an ancient, long-abandoned object.\n\nAnother is the *Hei Hua Jing* (Black Flower Essence), shaped like a dog but hairless, with red skin and six eyes. It hides in secluded places, exhaling qi from afar to strike its victims, causing sudden internal distress, vomiting of saliva and blood, and eventual death. This is the unrighteous spirit of a household.\n\nAnother is the *Niu Shou Bai Du Jing* (Ox-Headed Hundred Poisons Essence), with fleshy horns atop its head, a green face, vermilion eyes, an eagle’s beak, a tiger’s neck, horse’s hooves, and a human body. It roams mountain valleys to claim lives. This is the essence of an old horse from the Lion Kingdom that once obtained a dragon pearl, later transforming improperly into a human form and scattering across the eight directions—now commonly found in mountain valleys.\n\nAnother is the *Gui Long Wan Tian Jing* (Cassia Dragon Evening Heaven Essence), appearing as a hornless dragon, commanding clouds and mist. It dwells in ponds and delights in devouring human brains. This is the water-dwelling essence of a dragon that shifted mountains in western Sichuan.\n\nAnother is the *Deng Chao Huang Tian Jing* (Deng Nest Yellow Heaven Essence), resembling a giant turtle with a horn atop its head and four eyes. It dwells in water, damaging dikes and shattering riverbanks, often drinking human brains through the soles of feet or palms. This is the essence of a water demon.\n\nAnother is the *Cao Hong Tian Yan Jing* (Cao Hong Heaven-Eye Essence), with disheveled hair and a single foot, appearing as a woman. It roams mountain valleys, often laughing and raising its foot to ride the wind and fly. It exhales qi to transform and devours human lives. This is a heavenly demon, originally the essence of a ten-thousand-year-old withered cypress.\n\nAnother is the *Tao Nu Xin* (Peach Slave the New), appearing as a sallow, swollen woman in pale clothes, wielding a large pestle by night and sometimes visible by day. It lurks in caves, grottos, or long-abandoned rooms. Those who see it invariably fall ill. This is the essence of a thousand-year-old spider.\n\nAnother is the *Song Qiu Gu Hun Jing* (Song Mound Lone Soul Essence), taking the form of a woman who wanders mountains and forests, often weeping beneath the grass. If questioned, she claims to be a woman from a good family. Following her leads only to disaster. Those who recognize her will note the absence of her left ear—this is the essence of a thousand-year-old wild leopard cat.\n\nAnother is the *Wu Ai Ai Jing* (Wu Ai the Beloved Essence), appearing as a woman who claims to be from a respectable family, often carrying a child or accompanied by one or two maidservants. She roams mountain valleys, fond of bewitching the hearts of cultivators. Those who seek the Dao without this text to discern truth from falsehood risk great harm and loss.",
      "overlap_context": "n soul.\n\nAnother is the *Lu Shen Jie Shi Jing* (Deer-Bodied Precept Corpse Essence), appearing human in the form of a woman dressed in white mourning clothes, often weeping by the water’s edge. Those who see her and attempt to inquire are doomed—this entity is the essence of a thousand-year-old carp. Another is the *E Du Gui* (Vicious Poison Ghost), appearing human but often unseen. If one mistakenly enters water, it seizes their feet, preventing escape and leading to death. None can break free.",
      "start_char": 6302,
      "end_char": 7611,
      "start_sentence": 198,
      "end_sentence": 232,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.45676922798157,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太清金阙玉华仙书八极神章三皇内秘文.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "其鬼左脸上有赤盘痕一个，若豆许，见呼其小名左脸赤盘痕昊爱爱精，鬼精见知其迹，而非此乃千年顽石精也。 一名左守全邪精，状若一天神武夫，常持一利刃，携一人头在山中大，若巨虎烈石之声，人悮逢之无不死矣。 此乃山中一死雄魂之精也。 天地不收，常为八极神邪之精。 一名老僧精，形乃一老僧，披褐弱态，手携经文数卷，於山谷、或於小道边，左目赤色，眉毛若堵鬃，见僧人作一善事言谈，生人与语，无不遭其食啖，此乃南云山一老僧，得妖气而化此精也。 一名使卖羊头精，四角人身，色青，多游四海以淫生人之室女。 今世之人忽有妇女昼生夜死者，乃此怪所害，亦乃千年海犬所化也。 一名陈狂尸驰精，虎首禽身，肉翅飞空，以吃生人之肌肉，此乃万年江猪所化也。 一名吞魔小直精，多戴金花冠，素色服，状若神人，能喷妖气化为宫宇，以取世间有姝色者妇人在内，好血肉，求醮祀，淫乱生人，假托神人以要瞻敬者多矣。 此乃天地厌神，本出老鸡之精也。 一名郭华小神精，鬼形人面，布衣深目，常携一小刃突出，多游山野，人或见之，以尖刃利面吞啖血肉。 此乃不正之地小祇之精也。 一名山岳孙青精，黄衣，状如老阴之人，多现於山谷幽野中。 左手常携一禽，五彩锦毛，见人时以放之，人见其禽锦毛可爱，以观之，无不卒病。 此乃幽谷一老乌鸟之精也。 一名黄女精，状如一小女，双云髻，紫衣，人夜多见问之，其鬼则化为风以取人，归食其血肉，此乃年深师子之精也。 一名周德大昧精，状乃壮女之形，顶七星玉珠冠，衣彩色五花服，云鬓钳润，眉目似秋波，常携一儿枯脑骨，见人将枯脑骨化为绣囊，人见之无不观矣。 其女有语曰：我本闺门不出，偶一思野色以戏步至此，人多迷性好色，如饥龟饮血，无不乱其生人，既与其合，乃骨膏而粉碎也。 此鬼於印堂中有斑点一个，如豆许，乃天地记也。 此乃江中老龟之精也。 此鬼极热之方多有之，天地不主管，八洞不收握，八世散魂精也。 一名漆漆小耗精，状乃一女形，素结发髻，朱衣红履，琼貌花容，善歌曲，好吟风月。 或至月夜，或至日暮，多言我乃君家之邻女，而少年之子见而喜交，积久月深则令阳魂日消而死矣。 此乃人家未出嫁闺魂之精也。 一名苏小妖精，状若小男子之形，或在昏暮，或早，出现无时，见人相离而行，与人为祸，见之者无康矣。 此乃年深伤寒枉死之鬼也。 一名园郎姑昧精，形乃一阳人之状，白衣或黄，於夜间呼人神魂，人应之无不死矣。 故今之人世，或早暮、或夜间出游，或居山、或在房舍、或听似有人叫之声者，而不出三声，一声大，两声小者是也。 此年深函板之精也。 一名杨花鬼尸精，形乃一男子之状，白衣或青，四目无足，常夜游静处，以作人叫呼，口称疼痛之苦，人或听将为实病之人，或有问者应声，人即死矣。 此乃年深柩棺之精也。 一名黄河大小精，常有三五人，或七八人相逐，或无头足，或无口鼻，或无眼耳，或无臂肘，或聚於黄昏火傍，人见之多生大病於身田，此乃年深无主飘砖之魂饿鬼之精也。 一名腾蛇白虎小耗精，状乃女子形，花衣冠，好容貌，多好夜游，昼巡於道边，或言我乃良家之女，路行辛苦力弱，欲要人背而行之，人多以为好事而不知祸埋身矣。",
      "translated_text": "The ghost bears a red, dish-like mark on its left cheek, roughly the size of a bean. When addressed by its nickname—\"Left-Cheek Red Mark Hao Ai Ai Essence\"—the ghost reveals its true nature, for this is no mere spirit but the essence of a thousand-year-old stubborn stone.\n\nAnother is the *Zuo Shou Quan Xie Jing* (Left Guardian of Complete Evil Essence), appearing as a divine warrior, often wielding a sharp blade and carrying a severed head through the mountains. Its roar shakes boulders like a raging tiger, and those who mistakenly encounter it meet certain death. This is the essence of a dead male spirit in the mountains, unclaimed by heaven or earth, now a malevolent spirit of the eight directions.\n\nAnother is the *Old Monk Essence*, taking the form of an aged monk in tattered brown robes, carrying several scrolls of scripture. It wanders mountain valleys or the edges of narrow paths, its left eye crimson and its eyebrows thick as a brush. It speaks kindly to travelers, offering good deeds and conversation, yet none who engage with it escape being devoured. This is the essence of an old monk from Nanyun Mountain, transformed by malevolent qi.\n\nAnother is the *Sheep-Head Peddler Essence*, a four-horned, blue-skinned being with a human body. It roams the four seas, seducing the daughters of households. In the present age, women who die at night after appearing alive by day are victims of this creature—it is the essence of a thousand-year-old sea dog.\n\nAnother is the *Chen Kuang Shi Chi Jing* (Chen the Mad Corpse-Runner Essence), with the head of a tiger and the body of a bird, its fleshy wings carrying it through the sky. It preys on the flesh of the living, the essence of a ten-thousand-year-old river pig.\n\nAnother is the *Tun Mo Xiao Zhi Jing* (Swallowing Demon Small Upright Essence), often adorned with a golden floral crown and plain robes, appearing as a divine being. It exhales malevolent qi to conjure palaces, luring beautiful women inside to feast on their blood and flesh. It demands sacrifices and indulges in debauchery, deceiving many into worship. This is a spirit despised by heaven and earth, born from the essence of an old chicken.\n\nAnother is the *Guo Hua Xiao Shen Jing* (Guo Hua Small Spirit Essence), a ghostly figure with a human face, clad in coarse cloth, its deep-set eyes gleaming. It carries a small blade, lurking in mountains and wilds, and those who encounter it are slashed and devoured. This is the essence of a minor earth spirit from an unruly place.\n\nAnother is the *Shan Yue Sun Qing Jing* (Mountain Peak Sun Qing Essence), dressed in yellow, resembling an elderly yin-aligned person. It often appears in secluded mountain valleys, its left hand always holding a bird with five-colored, brocade-like plumage. When it releases the bird before a person, its beauty captivates the onlooker, who inevitably falls gravely ill. This is the essence of an ancient crow from a hidden valley.\n\nAnother is the *Yellow Maiden Essence*, appearing as a young girl with twin cloud-like buns and purple robes. At night, she often appears and speaks to travelers, then transforms into wind to seize them, returning to feast on their blood and flesh. This is the essence of a long-lived lion.\n\nAnother is the *Zhou De Da Mei Jing* (Zhou De Great Delusion Essence), taking the form of a robust woman wearing a seven-star jade pearl crown and a five-colored, floral-patterned robe. Her cloud-like hair is pinned with care, her brows and eyes like autumn ripples. She carries a child’s withered skull, which she transforms into an embroidered pouch to lure onlookers. She speaks: *\"I am a woman of a respectable household, rarely venturing out, yet a fleeting fancy for the wild led me here.\"* Many, entranced by her beauty, are drawn to her like starving turtles to blood, their lives thrown into chaos. Once they unite with her, their bones and marrow are ground to dust. This ghost bears a bean-sized blemish on its forehead—a mark recorded by heaven and earth. It is the essence of an ancient river turtle, thriving in scorching lands, ungoverned by heaven or earth, its scattered soul untouched by the eight caverns for eight generations.\n\nAnother is the *Qi Qi Xiao Hao Jing* (Dripping Small Wasting Essence), appearing as a young woman with a plain coiled bun, crimson robes, and red shoes. Her jade-like face and flower-like beauty enchant with songs and verses of wind and moon. On moonlit nights or at dusk, she claims to be a neighbor’s daughter, and young men who delight in her company gradually waste away, their yang souls consumed until death. This is the essence of the unbetrothed soul of a maiden.\n\nAnother is the *Su Xiao Yao Jing* (Su Xiao Demon Essence), resembling a young man, appearing unpredictably at dusk or dawn. It walks apart from travelers, bringing misfortune, and those who see it meet no peace. This is the ghost of one who died unjustly from a lingering illness.\n\nAnother is the *Yuan Lang Gu Mei Jing* (Garden Lad Gu Delusion Essence), appearing as a yang-aligned person in white or yellow robes. At night, it calls out to people’s souls, and those who respond meet certain death. Thus, in the present age, those who hear what seems like a voice calling them at dawn, dusk, or night—whether in the mountains, a dwelling, or elsewhere—should note: if the first call is loud and the next two faint, it is this spirit. This is the essence of an ancient coffin plank.\n\nAnother is the *Yang Hua Gui Shi Jing* (Poplar Blossom Ghost Corpse Essence), appearing as a man in white or blue robes, four-eyed and footless. It roams quiet places at night, crying out in feigned pain. Those who mistake it for a truly suffering person and inquire are answered—only to die. This is the essence of an ancient coffin.\n\nAnother is the *Yellow River Great and Small Essence*, often seen in groups of three to five, or seven to eight, some headless, others without feet, mouths, noses, eyes, or ears, or missing arms and elbows. They gather near fires at dusk, and those who see them often fall gravely ill. These are the hungry ghosts of long-dead, unclaimed wandering souls.\n\nAnother is the *Teng She Bai Hu Xiao Hao Jing* (Soaring Serpent White Tiger Small Wasting Essence), appearing as a woman in floral robes and a crown, her beauty striking. She favors nighttime wanderings, lingering by roadsides in daylight. She claims to be a woman of a good family, weary from travel, and asks for a ride on one’s back. Many, thinking it a kind deed, unknowingly invite disaster upon themselves.",
      "overlap_context": "to disaster. Those who recognize her will note the absence of her left ear—this is the essence of a thousand-year-old wild leopard cat.\n\nAnother is the *Wu Ai Ai Jing* (Wu Ai the Beloved Essence), appearing as a woman who claims to be from a respectable family, often carrying a child or accompanied by one or two maidservants. She roams mountain valleys, fond of bewitching the hearts of cultivators. Those who seek the Dao without this text to discern truth from falsehood risk great harm and loss.",
      "start_char": 7611,
      "end_char": 8892,
      "start_sentence": 233,
      "end_sentence": 265,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.13005471229553,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太清金阙玉华仙书八极神章三皇内秘文.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "此乃年深一老兔之精也。 一名昏形魍魉精，形乃一鬼之状，长数十尺，阔三五尺围，两目如火光，长至昏暮，或夜间，独立水边，或野路上，人见之无不有小疾，而亦不能害人之命。 此乃水边野路一块石、一块土或枯朽之木，得水湿之气，积岁而成此精矣。 一名嘉夫精，人状，若少女，孝服白衣，多见於厅堂。 夜暮或哭笑、或歌吟、或独行、或三二人，此精现处，人见之无不死矣。 此乃故宅中阴人伏尸之鬼也。 一名两林青面精，身着白衣，发未皆散，多令人家门户作声，宅舍不安，此乃宅中阳人伏尸精也。 一名李童，形如室女，丽色容妹，端身清秀，多游夜间，朱衣高冠，善能诗曲，举步吟咏，媚人者多矣。 此乃年深灯檠之精也。 一名故奴僧精，形若妇人，孝衣或彩衣，夜出灯下，以物帛覆头面者是也。 亦能言好弄灯，好楁人咽喉至死，此乃扫帚之精也。 一名杀木魂精，其形如三二人，爱更深出，弄行步之声於宅中，亦多注病，能害小儿，此乃年深器物之精也。 一名土玉精，状若白鼠，或鬼形，常夜深爱抛掷瓦砖，此鬼令人宅舍昌盛，此乃铜铁之精也。 欲取之时，用白纸一张，上书天皇咒印，作纸捻注油，遇夜点然于所疑之处，别用灯照之，有物处其灯焰垂下，天明发之，必获其物也。 一名大罗杀鬼精，形无定，多知吉凶，於夜驾禽入宅，或房室作声，向人或下泪，此乃户家亲未托生者，天神不收，地神不管，世之所谓邪灵化精者。 一名铁云罗耶精，善施云雾，形若小儿，脑后有目若电光，手足如禽爪，夜现火光，值早多藏妇人腹中，其家不昌，乃乖龙未登位之精。 一名赵氏宗精，状若男子，衣物不测，令人夜寝若梦非梦，忽见人来压身者是也。 人见之无不成病。 天曹不收，地神不管，无籍而化精者。 一名贺度口精，状若男子形，多现於穴窟，见人吐气，着人令人作病，走注疼痛，手足如折不止，世以为虎咬者是。 此乃年深深山虎精也。 一名灰虎神精，虎首灰驴形，四足有爪，目如电光，善变化，通风处无不到，好伤人命，啖小儿，此乃年老阴人之精，得灰力能变化。 一名唐永鸣精，驼首人形，红衣赤足，手执小刀，常游厨灶盗饮食，无故冷残，动者人再食，无不作疾者。 一名佞女子精，人形五髻，四眉四目四手，衣黄、禽足，多游人世，能吸人血，令人睡觉，见身青黑点，二三日不消者是也。 遇此令人有小灾小祸。 此精乃深山年深毒蛇之精。 一名郑达伏，其精无形状，多於宅中忽现，火块相逐者，乃年深门侧之精也。 一名气祆血着精，其状如火焰，相照如灯，或三或五，相附而行，多暮夜现於古坛冢，道路圹野而皆甚有之。 其变化或大或小不定，人若遂之，或有或无，今人所谓鬼火者是也。 此乃本出闲室街市山崖之处，或生人、或死人血、或禽兽之血，在地三日不化，得阴阳盗一灵气在内，而后变化作此。 如阳人之血焰红，阴人之血焰碧有烟。 欲要看者，执天皇神印於天门，念天皇咒三遍，取三口气吹在印上，望有火处以印照之，其鬼火自来。 再印印之，其鬼火自灭。 而看其形状乃破，器内盛赤血水，或皮或毛、或故帛上有鲜□□□之也。 天条章第五 天皇君曰：天条者，八极上法、九霄玉文之条也。",
      "translated_text": "This is the essence of an ancient, long-lived rabbit.\n\nAnother is the *Hunxing Wangliang Essence*, appearing as a ghostly figure, dozens of feet in length and three to five feet in girth, its eyes like flickering flames. At dusk or in the dead of night, it stands alone by the water’s edge or along wild paths. Those who see it invariably fall mildly ill, though it cannot claim their lives. This essence arises from a stone, a clod of earth, or a rotting log by the water or roadside, steeped in damp qi over the years until it takes form.\n\nAnother is the *Jiafu Essence*, human in shape, resembling a young maiden in mourning white. It often appears in halls, weeping or laughing at nightfall, singing or wandering alone, or in pairs or threes. Wherever this essence manifests, those who see it will surely die. This is the ghost of a deceased woman lingering in an old dwelling.\n\nAnother is the *Lianglin Qingmian Essence*, clad in white, its hair unbound and disheveled. It often causes doors and households to creak and stir, unsettling the home. This is the essence of a deceased man’s lingering corpse within the dwelling.\n\nAnother is *Li Tong*, shaped like a maiden, her beauty striking, her bearing refined and graceful. She roams the night, dressed in crimson robes and a tall crown, skilled in poetry and song, reciting verses with every step. Many are enchanted by her. This is the essence of an aged lampstand.\n\nAnother is the *Gu Nu Seng Essence*, appearing as a woman in mourning or colorful attire, emerging at night beneath lamplight with her head and face veiled. She delights in playing with lamps and choking people to death. This is the essence of a broom.\n\nAnother is the *Sha Mu Hun Essence*, taking the form of two or three people. It emerges in the deep of night, mimicking the sound of footsteps within the home. It often inflicts illness and harms children. This is the essence of aged household objects.\n\nAnother is the *Tu Yu Essence*, resembling a white rat or a ghostly figure. In the dead of night, it delights in hurling tiles and bricks. This spirit brings prosperity to the household—it is the essence of bronze and iron. To capture it, take a sheet of white paper and inscribe upon it the *Heavenly Sovereign’s Incantation Seal*. Fashion a paper wick, anoint it with oil, and light it where the presence is suspected. Use another lamp to illuminate the area; where the flame dips, dig at dawn, and you will surely retrieve the object.\n\nAnother is the *Da Luo Sha Gui Essence*, its form ever-changing. It knows good and ill fortune, riding birds into homes at night or stirring sounds in chambers. It may weep before people. These are the lingering dead of a household, neither claimed by heavenly nor earthly spirits—what the world calls *wayward spirits* taking form.\n\nAnother is the *Tie Yun Luo Ye Essence*, master of clouds and mist, appearing as a child with eyes like lightning flashing behind its head and taloned hands and feet. It manifests in firelight at night, and during droughts, it often hides within women’s bodies, causing misfortune to the household. This is the essence of a *perverse dragon* yet to ascend.\n\nAnother is the *Zhao Shi Zong Essence*, resembling a man in unknowable attire. It causes people to dream strange dreams at night, suddenly feeling a weight upon them. Those who see it invariably fall ill. Neither heavenly nor earthly authorities claim it—an unregistered spirit taking form.\n\nAnother is the *He Du Kou Essence*, appearing as a man, often lurking in caves. It exhales upon people, causing illness, wandering pains, and unrelenting agony in the limbs, as if bitten by a tiger. This is the essence of a long-lived mountain tiger.\n\nAnother is the *Hui Hu Shen Essence*, with the head of a tiger and the body of a gray donkey, its four feet clawed, its eyes like lightning. It excels in transformation, reaching every wind-swept place, delighting in taking lives and devouring children. This is the essence of an aged woman, empowered by ash to change form.\n\nAnother is the *Tang Yong Ming Essence*, with the head of a camel and the body of a man, clad in red robes and barefoot, wielding a small knife. It haunts kitchens and hearths, stealing food and drink, leaving it cold and spoiled. Those who consume it invariably fall ill.\n\nAnother is the *Ning Nüzi Essence*, human in form with five topknots, four eyebrows, four eyes, and four hands, dressed in yellow with bird-like feet. It roams the mortal world, draining blood, causing people to sleep deeply, leaving dark marks on their bodies that linger for days. Encountering it brings minor misfortune. This essence arises from a long-lived venomous snake in the deep mountains.\n\nAnother is *Zheng Da Fu*, its essence formless, often suddenly appearing in homes as chasing fireballs. This is the essence of an aged spirit by the door.\n\nAnother is the *Qi Xian Xue Zhuo Essence*, resembling a flame, glowing like a lamp, appearing in threes or fives, moving in clusters. It often manifests at dusk in ancient altars, tombs, roads, and wild fields. Its transformations vary in size, appearing and vanishing unpredictably—what people call *ghost fire*. This arises from blood—of the living, the dead, or beasts—spilled in desolate places, streets, cliffs, or mountains, lingering unabsorbed for three days before stealing a wisp of yin or yang qi to take form. The blood of the living burns red; the blood of the dead burns green with smoke. To observe it, hold the *Heavenly Sovereign’s Divine Seal* at the *Gate of Heaven*, recite the *Heavenly Sovereign’s Incantation* thrice, and blow three breaths upon the seal. Direct the seal toward the fire, and the ghost fire will draw near. Seal it again, and the ghost fire will vanish. Upon inspection, its form will be broken, revealing a vessel filled with bloody water, or remnants of skin, fur, or tattered cloth stained with fresh blood.\n\n---\n\n**Heavenly Statutes, Chapter Five**\n\nThe Heavenly Sovereign said: The *Heavenly Statutes* are the laws of the Eight Poles and the jade texts of the Nine Heavens.",
      "overlap_context": "fall gravely ill. These are the hungry ghosts of long-dead, unclaimed wandering souls.\n\nAnother is the *Teng She Bai Hu Xiao Hao Jing* (Soaring Serpent White Tiger Small Wasting Essence), appearing as a woman in floral robes and a crown, her beauty striking. She favors nighttime wanderings, lingering by roadsides in daylight. She claims to be a woman of a good family, weary from travel, and asks for a ride on one’s back. Many, thinking it a kind deed, unknowingly invite disaster upon themselves.",
      "start_char": 8892,
      "end_char": 10159,
      "start_sentence": 266,
      "end_sentence": 301,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.91627812385559,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太清金阙玉华仙书八极神章三皇内秘文.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "以擒天丁、斩大神、断祆精、除邪耗、杀鬼魅，扫不祥，而莫非天条之正气大焉。 夫天条者，斩扫其祆神也，如烈火焚一秋毫，除荡鬼魅也，若大海漂一朽叶，无不荡除。 法曰：凡斩断邪精鬼魅者，但见其形而言其所变化之根，道其姓名而自不敢去矣。 然后依印法，令五方正鬼数名，以驱其精邪，以就斩鬼坛上。 或令其精邪受四大地狱者，各随其意。 如斩之者，取斩鬼剑，以左手执之于天门，念天皇呎三徧，取气一口，吹於印上，用朱砂涂印，印剑尖一印，掷剑空中，其所使之鬼以知人意，良久斩讫，而见其精怪真形矣。 天皇君曰：其坛须用朱砂为界，三层，或石上、土上，须长五尺，阔五尺，凡见一切精魅之形，须天条以绝其根，而兔后魅之惑矣。 如见精不斩，见怪不除，见病人痛苦不救者，亦为心不慈悲之罪也。 故除精怪於他方，斩鬼魅於泉台，驱邪耗於法坛，以助真风之正，而不令魔鬼害我之民也。 天皇君曰：每遇一精鬼，急烧白钱半束，与其所斩之精鬼也。 天条四地狱斩断精 邪正一天皇坛图 如欲斩之，取其印，呼鬼姓名，驱邪精而斩之也。 如未斩时，寄封地狱，毋令走也。 天皇镇坛符式 此符安於西北乾上 （原缺符） 此符安於东北艮上 （原缺符） 此符安於东南巽上 此符安於西南坤上 天皇神印章第六 天皇君曰：凡受《三皇内文》 者，乃受三皇内印是也。 天皇上印长四寸，阔三寸； 地皇中印长三寸五分，阔三寸五分； 人皇下印长三寸，阔三寸。 取一段雷震枣木心，不然车轴木亦可，料印材之许。 以受醮之时，安於天医之方，以随坛供侍坛四方。 先择一浄室，外绝鸡犬女子妇人，内正其神，须清浄沐浴以面拜八方，然后开印。 雕印之日，有风吹砂走石，聚云雾霭，四方雷霆鸣吼，雨声聒者，乃开印之威兆也。 其印既以开成，须用绯绢锦帛作囊，石水作匣，秘於岩宇，藏於石室，以顺天理也。 如欲施法用印，先以焚香，暗拜三皇高真五岳以请印，使役天下鬼兵，断斩世内精魅祆神，以天皇君曰其印方之威，统摄万灵而无不臻焉。 以念神咒，吹之於印上，以天皇印上，印星则星落，印月则月缺，印日则日 蚀，印云雾则云雾收藏，印风雨则风雨停息，用印召五方之鬼，而求风无不风，求雨则无不雨，此天皇上印之威力也。 以地皇中印，印地则地裂，印草木则化为灰尘，印飞鸟则坠地，印虎虫则死伏，此地皇中印之威力也。 以人皇下印，印一切病患，无不康矣。 若复有人有一切凶祸，以香汤吞印，无不吉庆，人壮禄旺。 以印印之后心，则其人立便死，再印前心，则其人立苏，此人皇下印之威力也。 故三皇神印，三元治摄道中，尤有其大。 人欲验其征者，取一七岁童子，用朱砂涂印，念咒印前心，印之，其后心痕出矣。 然故三皇内秘文法验，若无此神印，邪无以畏之，有此神印，则百邪窜形矣。 天皇神既章第七 咒曰：紫微大帝，北极天神，魁魁魑魅，魑魉魒星，八洞天丁，五岳狞兵，大统大将，水火九灵，七曜七宿，黑杀天蓬，三霄上相，十极高尊，天英天直，四杀黄君，天心天内，天辅天衡，南灵神将，宝印奉行，九土童子，鬼王天真，天柱天时，天壬天丁，二十八宿，十二时将军，月直使者，日直神童，随法随勅，入吾印中。",
      "translated_text": "The Heavenly Statutes serve to capture celestial soldiers, behead mighty spirits, sever demonic essences, eradicate malevolent wastage, slay ghostly apparitions, and sweep away misfortune—all of which are but the righteous qi of the Heavenly Statutes at their grandest. The Heavenly Statutes are for the beheading and sweeping away of demonic spirits, like a raging fire incinerating a single autumn hair; they eradicate ghostly apparitions as the vast sea washes away a rotten leaf, leaving nothing unscoured.\n\nThe method states: To sever demonic essences and ghostly apparitions, merely observe their forms and speak of the roots of their transformations. Declare their names, and they shall not dare depart. Then, follow the seal method, commanding the five directions’ righteous ghosts by name to drive the demonic essence to the beheading altar. Alternatively, consign the demonic essence to the Four Great Hells, each according to one’s intent.\n\nTo behead them, take the beheading sword, grasp it in the left hand at the *Gate of Heaven*, recite the *Heavenly Sovereign’s Incantation* thrice, draw a single breath, and blow upon the seal. Apply cinnabar to the seal, then stamp the sword’s tip once. Cast the sword into the air, and the summoned ghost shall discern the practitioner’s intent. After a moment, the beheading shall be complete, and the true form of the demonic essence shall be revealed.\n\nThe Heavenly Sovereign said: The altar must be bounded with cinnabar in three layers, whether upon stone or earth, five *chi* in length and five *chi* in width. Upon encountering any demonic essence, the Heavenly Statutes must be employed to sever its root, thereby preventing future hauntings. Should one see a demon and fail to behead it, witness a monster and fail to eradicate it, or see a suffering patient and fail to save them, this too is a sin of uncompassionate heart.\n\nThus, demonic essences are eradicated in distant lands, ghostly apparitions are beheaded at the Yellow Springs, and malevolent wastage is driven from the ritual altar to aid the rectification of the true wind, preventing demonic spirits from harming our people.\n\nThe Heavenly Sovereign said: Upon encountering a demonic ghost, swiftly burn half a bundle of white paper money for the beheaded essence.\n\n**The Four Hells of the Heavenly Statutes for Beheading Demonic Essences**\n**Diagram of the Heavenly Sovereign’s Altar for Rectifying the Dao**\nTo behead them, take the seal, summon the ghost by name, and drive the demonic essence to be beheaded. If not yet beheaded, consign it to hell to prevent its escape.\n\n**Seal of the Heavenly Sovereign’s Altar**\nThis seal is placed in the northwest at *Qian*.\n*(Original diagram missing)*\nThis seal is placed in the northeast at *Gen*.\n*(Original diagram missing)*\nThis seal is placed in the southeast at *Xun*.\nThis seal is placed in the southwest at *Kun*.\n\n**Chapter Six: The Heavenly Sovereign’s Divine Seals**\nThe Heavenly Sovereign said: Those who receive the *Inner Writings of the Three Sovereigns* thereby receive the Three Sovereigns’ inner seals. The Heavenly Sovereign’s upper seal is four *cun* in length and three *cun* in width; the Earthly Sovereign’s middle seal is three *cun* and five *fen* in length and width; the Human Sovereign’s lower seal is three *cun* in length and width.\n\nTake a segment of the heartwood of a thunder-struck jujube tree—or, failing that, a cart axle—and prepare the seal material accordingly. At the time of the investiture ritual, place it in the direction of *Heavenly Medicine* and arrange it alongside the altar, serving the four directions. First, select a pure chamber, barring chickens, dogs, women, and wives from the exterior. Within, rectify the spirit, bathe in purity, and face the eight directions in reverence before opening the seal.\n\nOn the day the seal is carved, if winds stir sand and stones, clouds and mists gather, thunder roars from the four directions, and rain clamors, these are the ominous signs of the seal’s opening power. Once the seal is carved, it must be encased in a crimson silk pouch, stored in a stone box, and secreted within a cavern or stone chamber to accord with the Dao of Heaven.\n\nWhen employing the seal in ritual, first burn incense and silently invoke the Three Sovereigns, the lofty perfected, and the Five Marchmounts to request the seal. Then, command the ghostly soldiers of the world to sever and behead the demonic spirits and malevolent gods within the realm. The Heavenly Sovereign said: The might of this seal’s method governs the myriad spirits, and none shall fail to submit.\n\nRecite the divine incantation and blow upon the seal. With the Heavenly Sovereign’s seal, stamp the stars and they shall fall; stamp the moon and it shall wane; stamp the sun and it shall eclipse; stamp clouds and mist and they shall disperse; stamp wind and rain and they shall cease. Use the seal to summon the ghosts of the five directions, and there shall be no wind unobtained, no rain unsummoned—such is the power of the Heavenly Sovereign’s upper seal.\n\nWith the Earthly Sovereign’s middle seal, stamp the earth and it shall split; stamp grass and trees and they shall turn to ash; stamp flying birds and they shall plummet; stamp tigers and insects and they shall die—such is the power of the Earthly Sovereign’s middle seal.\n\nWith the Human Sovereign’s lower seal, stamp all ailments and none shall not be cured. Should one suffer misfortune, swallow the seal with fragrant water, and none shall not be blessed with good fortune, vigor, and prosperity. Stamp a person’s back heart, and they shall instantly die; stamp their front heart, and they shall instantly revive—such is the power of the Human Sovereign’s lower seal.\n\nThus, the Three Sovereigns’ divine seals govern the Dao of the Three Primes with unparalleled greatness. To verify their efficacy, take a seven-year-old child, apply cinnabar to the seal, recite the incantation, and stamp their front heart—the mark shall appear on their back. Such is the proven method of the Three Sovereigns’ inner secret writ. Without these divine seals, demons shall not fear; with them, the hundred evils shall flee in terror.\n\n**Chapter Seven: The Heavenly Sovereign’s Divine Incantation**\nThe incantation states:\nGreat Emperor of the Purple Tenuity, Celestial Deity of the North Pole,\n*Kuai-kuai*, *chi-mei*, *chi-liang*, *piao-xing*,\nCelestial Soldiers of the Eight Caverns, Fierce Soldiers of the Five Marchmounts,\nGreat Commander-in-Chief, Nine Numinous Ones of Water and Fire,\nSeven Luminaries, Seven Mansions,\nBlack Killer, Heavenly Peng,\nPrime Ministers of the Three Heavens, Lofty Honored Ones of the Ten Poles,\nHeavenly Ying, Heavenly Zhi,\nFour Slayers, Yellow Lord,\nHeavenly Xin, Heavenly Nei,\nHeavenly Fu, Heavenly Heng,\nDivine Generals of the Southern Numinous,\nProtectors of the Precious Seal,\nEarthly Lads of the Nine Lands,\nGhost Kings, Celestial Perfected,\nHeavenly Pillar, Heavenly Time,\nHeavenly Ren, Heavenly Ding,\nTwenty-Eight Mansions,\nTwelve Hourly Generals,\nMonthly Attendants,\nDaily Divine Lads,\nFollow the method, follow the decree,\nEnter my seal!",
      "overlap_context": "s Incantation* thrice, and blow three breaths upon the seal. Direct the seal toward the fire, and the ghost fire will draw near. Seal it again, and the ghost fire will vanish. Upon inspection, its form will be broken, revealing a vessel filled with bloody water, or remnants of skin, fur, or tattered cloth stained with fresh blood.\n\n---\n\n**Heavenly Statutes, Chapter Five**\n\nThe Heavenly Sovereign said: The *Heavenly Statutes* are the laws of the Eight Poles and the jade texts of the Nine Heavens.",
      "start_char": 10159,
      "end_char": 11432,
      "start_sentence": 302,
      "end_sentence": 344,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.2978835105896,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太清金阙玉华仙书八极神章三皇内秘文.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "急急如律令。 吾奉大罗上仙天皇大帝君勅摄。 天皇真形符章第八 天皇君曰：真形之迹者，乃吾之真形玉箓篆也。 用丹砂新笔书符于帛，以戴贴之，精神立变，万鬼自灭，百魔束形，群祆潜迹，而神圣臻焉。 摄法人吞之於腹内，其鬼神乃现真貌，真为天皇之形也。 以此者故得天神归之矣。 天皇君曰：世海之内，凡有一切病患不痊、灾祸干己、久疾笃困、危厄频年、卒得一切病患不能伸者，以朱书此符，烧作灰，用香汤吞下，无不速痊疾矣。 三皇授法坛仪式章第九 坛方八尺，石丘为上，土丘为次。 请三皇五岳表式： 具州县乡村，法位，臣姓某上言：臣某少思仙道，攀缘神风，若慕真玄，欲求大庆。 今於某年月日，宿遭真契，得遇金书，妙化以怀，辄敢私用。 谨具表文，上请三皇大帝、五方五帝仙君，右臣某仰愿大度慈师高真怜悯，慧光二布，岂有不烛之方，慈风既散，奚有独偏之地。 伏念臣某蝼蚁之情，苦海之命，含灵之性，憔焰之身，今者灵丘已备，琼花皆鲜，上祝天君丹光早降，灵丘列位，与弟子臣某，乞赐证盟，敢受玄文之道。 年月日，具位姓名，谨具表状。 若以灵丘就祭，自亥时启，行至子时，面望天门，肃整衣冠，拜讫，烧请醮表文，少时觉异香入鼻，光彩烁目，虚空流光，倏忽鸾鹤飞空，身寒巨颤，神明怖惧，此是仙君众圣降丘之兆也。 仙君降址，其中茶酒变色，当此之际，整肃衣冠，八方拜丘，不得怖惧，须内正其神，安心定意，以祝上圣，言臣某今受天文秘书，愿赐证盟。 自子至卯时，方得收丘。 面望天门，烧钱五分，一切钱马於鬼门，用一小状烧白钱三束，令五方四十大鬼，以众收之。 然后用印施法，摄鬼驱邪，封山居洞，一切有无，皆自然而感应也。 三皇剑法章第十 天皇君曰：於甲子日，用明钢三斤六两，打作一剑，长二尺四寸，用金镂渗天皇、地皇、人皇真形符在上，用素帛缠之，以索坠入年深人不取水者井中。 四十九日方取其剑符，以摄地祇神灵在内，其铁自白，刀血红，人鬼见之无不摄灭，名曰红泉铁，神祇所化之剑也。 以封於宝匣，欲使之，如说法之语，响应而神威无不应矣。 太清金阙玉华仙书八极神章三皇内秘文卷上竟 太清金阙玉华仙书八极神章三皇内秘文卷中 斯文玄阙无极洞章，乃丹台瑶林之先，云华霞秀之始，天中大罗自然宝书也。 其紫书琼札皆上帝高真吐红气以成文，噀丹辉而结篆，秘於紫微，标於璧玉金华秀简者尔。 中有居山之法，有大洞八素神童，使自然狼虎不伤，毒虫不害，观灵芝，明仙药，辩邪正，识仙宾，知如化伏神策，而俱不出此焉。 有获遇之者，以为深秘。 地皇神印章第一 地皇神印者，以枢权尘世大地之中，一切万事无不统御焉。 故印之大旨，於法之先矣。 其有不可外呼吸，且如太初仙药化形，假物为形，托名成象者，多有或作禽兽形，或作男女之形，以印照之，而尽败坏也。 灵芝瑞草，变形作化，以印照之，而皆可至矣。 地皇神印灵极赞： 魁风八杀天神伏，九玄四目老翁归。 太初羽化大首柄，陆地邪精见摄威。 湛湛天书为神祖，玄玄玄外更无余。 可期玉华灵光篆，绝迹神风扫耗除。 宝印琼龙上相枢，机神统御最当驱。 天秘魔魅多方外，印刀仙灵洞碧虚。",
      "translated_text": "Swift as the law’s command!\n\nBy the decree of the Most High Perfected, the Celestial August Emperor of the Great Canopy.\n\n**Chapter Eight: The Celestial August Emperor’s True Form Talisman**\n\nThe Celestial August Lord declares: The traces of the true form are none other than Our true form, the jade register’s talismanic script. Inscribe the talisman upon silk with cinnabar and a new brush, then wear or affix it—one’s spirit transforms instantly, myriad ghosts self-annihilate, hundred demons bind their forms, and all malevolent spirits vanish without trace, while the divine and sagely draw near.\n\nIn the method of absorption, swallow the talisman into the belly, and the ghosts and spirits shall reveal their true visages—truly the form of the Celestial August Emperor. For this reason, the celestial spirits submit to it.\n\nThe Celestial August Lord declares: Within the world’s seas, for all who suffer unhealed ailments, disasters befalling the self, chronic and severe illness, years of peril, or sudden afflictions unable to be relieved—inscribe this talisman in vermilion, burn it to ash, and swallow it with fragrant water. None shall fail to swiftly recover.\n\n**Chapter Nine: The Altar Rites for the Transmission of the Three August Ones’ Method**\n\nThe altar measures eight feet square, with a stone mound as the highest tier and an earthen mound as the next. The petition to the Three August Ones and Five Marchmounts follows this form:\n\n*[State your] prefecture, county, village, and dharma rank. Your servant, [Name], respectfully declares: From youth, your servant has pondered the Dao of immortality, ascending the divine wind, yearning for the true and mysterious, desiring to seek great fortune. Now, on [date], by karmic affinity, I have encountered the golden script, its wondrous transformations held within, and dare to employ it privately.*\n\n*With reverence, I present this memorial, humbly invoking the Three August Emperors and the Five Directional August Immortal Lords. May the merciful radiance of the great and compassionate Perfected Ones, the lofty immortals, shine forth—what place shall remain unillumined? As the compassionate breeze scatters, how can any land be left untouched?*\n\n*Your servant, [Name], a mere ant in feeling, a life adrift in the bitter sea, endowed with the nature of the numinous yet a body scorched by flames—now that the sacred mound is prepared and the jade blossoms fresh, I pray the Celestial Lords’ cinnabar light descend swiftly, the sacred mound arrayed in ranks, to grant your servant, [Name], the covenant of confirmation and dare to receive the mysterious scriptural Dao.*\n\n*[Date], [Rank and Name], respectfully submits this memorial.*\n\nWhen the sacred mound is ready for the rite, begin at the *hai* hour, proceeding until the *zi* hour. Face the Celestial Gate, adjust your robes and cap, bow, then burn the memorial of invocation. After a moment, an uncommon fragrance enters the nose, radiant light dazzles the eyes, and ethereal luminosity flows—suddenly, simurghs and cranes soar through the void, the body chills with trembling, and the spirit is awestruck. This is the sign of the Immortal Lords and host of sages descending upon the mound.\n\nAs the Immortal Lords alight, the tea and wine may change color. At this moment, adjust your robes, bow to the mound in the eight directions, and do not succumb to fear. Compose your spirit within, calm your heart and mind, and pray to the August Ones: *\"Your servant, [Name], now receives the celestial scriptures’ secret writings and humbly begs the covenant of confirmation.\"*\n\nFrom the *zi* to the *mao* hour, the mound may be dismantled. Face the Celestial Gate and burn five portions of spirit money. All paper horses and money are offered at the Ghost Gate. Burn a small memorial with three bundles of white paper money, commanding the Forty Great Ghosts of the Five Directions to gather them. Then employ the seal to enact the method, subdue ghosts, expel evil, seal mountains and dwellings—all shall respond naturally to its resonance.\n\n**Chapter Ten: The Three August Ones’ Sword Method**\n\nThe Celestial August Lord declares: On a *jiazi* day, take three catties and six taels of bright steel and forge a sword two feet and four inches long. Engrave upon it the true form talismans of the Celestial August, Terrestrial August, and Human August Ones, then wrap it in plain silk. Weight it with a cord and lower it into a well untouched by humans for many years. After forty-nine days, retrieve the sword and talisman—it shall have absorbed the earth’s numinous spirits, its iron turning white, its blade blood-red. No ghost or demon beholding it shall fail to be subdued and destroyed. This is called the *Hongquan Iron*, a sword transformed by the divine and numinous.\n\nStore it in a precious casket. When wielded, speak the method’s incantations, and its divine might shall respond without fail.\n\n**The Upper Scroll of the Three August Ones’ Esoteric Writings of the Eight Poles’ Divine Chapters from the Jade Flower Immortal Writings of the Golden Gate of Great Clarity concludes.**\n\n**The Middle Scroll of the Three August Ones’ Esoteric Writings of the Eight Poles’ Divine Chapters from the Jade Flower Immortal Writings of the Golden Gate of Great Clarity begins.**\n\nThis text, the *Mysterious Gate of the Boundless Cavern Chapter*, is the origin of the cinnabar terrace and jasper grove, the beginning of cloud blossoms and rosy dawns—a natural treasure script of the Great Canopy in Heaven. Its purple writings on jade slips were formed from the red qi exhaled by the August Ones of Highest Heaven, their cinnabar splendor congealing into talismanic script. It was concealed in the Purple Tenuity and inscribed upon jade, gold, and blossoming jasper tablets.\n\nWithin it are methods for dwelling in mountains, the Eight Luminous Divine Lads of the Great Cavern, enabling one to remain unharmed by wolves and tigers, immune to venomous creatures, to behold numinous mushrooms, discern immortal medicines, distinguish the true from the false, recognize immortal guests, and master the arts of transformation, subjugation, and divine strategy—all contained herein. Those who encounter it must hold it in deepest secrecy.\n\n**Chapter One: The Terrestrial August One’s Divine Seal**\n\nThe Terrestrial August One’s divine seal governs the vast earth at the center of the mundane world, over which all matters are sovereign. Thus, the seal’s great purport precedes all methods.\n\nFor those who cannot rely on external breath—such as immortal medicines transforming form, borrowing objects to assume shapes, or adopting names to manifest images—many take the forms of birds and beasts or male and female figures. When illuminated by this seal, all are utterly undone.\n\nAuspicious mushrooms and wondrous herbs, when transformed or altered, shall all be made manifest by this seal’s light.\n\n**Eulogy of the Terrestrial August One’s Divine Seal’s Numinous Extremity:**\n\nThe *Kuai* wind and Eight Slayers subdue celestial spirits,\nThe Nine Mysteries and Four-Eyed Old Man submit.\nThe Great Beginning’s feathered transformations wield the great handle,\nEarth’s malevolent essences behold its awe-inspiring might.\nProfound, profound—the celestial writings are the divine ancestors,\nBeyond the mysterious, mysterious—nothing more remains.\nOne may await the jade blossom’s numinous light talismans,\nEradicating traces of divine winds and sweeping away harm.\n\nThe precious seal, the jade dragon’s prime ministerial pivot,\nIts divine mechanism governs and drives most fittingly.\nHeaven’s secrets and demonic spirits lie beyond all bounds,\nThe seal’s blade and immortal spirits pierce the azure void.",
      "overlap_context": "e Heavens, Lofty Honored Ones of the Ten Poles,\nHeavenly Ying, Heavenly Zhi,\nFour Slayers, Yellow Lord,\nHeavenly Xin, Heavenly Nei,\nHeavenly Fu, Heavenly Heng,\nDivine Generals of the Southern Numinous,\nProtectors of the Precious Seal,\nEarthly Lads of the Nine Lands,\nGhost Kings, Celestial Perfected,\nHeavenly Pillar, Heavenly Time,\nHeavenly Ren, Heavenly Ding,\nTwenty-Eight Mansions,\nTwelve Hourly Generals,\nMonthly Attendants,\nDaily Divine Lads,\nFollow the method, follow the decree,\nEnter my seal!",
      "start_char": 11432,
      "end_char": 12707,
      "start_sentence": 345,
      "end_sentence": 387,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.61419701576233,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太清金阙玉华仙书八极神章三皇内秘文.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "龙华秀宝金文篆，群祆一见自束形。 太极紫星伏三万，荡荡除邪辟列精。 玄灵假吾神印力，一助真霄扫怪无。 浄地凌空神鬼怖，对山驭气最为枢。 灵芝化形千百体，仙药成禽作兽形。 以印照空无不摄，自然大化岂容情。 地皇咒曰： 南方七星，地户六丁，六甲玉女，奉吾印行，急急如律勑摄。 地皇真形符篆章第二 地皇真形玉篆符图　长四寸　阔四寸　用黄纸　朱书篆 地皇君曰：凡居止山洞住庵，或幽栖林谷，每日卯旦，书此真迹神符，作灰，用香汤，望天门吞之，则令人益寿延生，而邪气不干矣。 并居山之人，收一切仙芝灵药，而以符吞之入腹，用印照之，其药自来也。 修士居山所宜章第三 地皇君曰：群类之中，惟人最贵，故生物必有其本，为事必有所宜。 以末学之夫，忽生善念，未达真理，不明玄奥，便入名山，乃遭五陷八杀之凶，或入山不测之祸，虫残虎伤之害，以至死者多矣，而不知居山自有法也。 诀曰：寅辰生人，居乾坎二山为福地。 卯巳午生人，居坤山为福地。 申未生人，居艮山为福地。 酉生人，居震山为福地。 戌生人，居巽山为福地。 亥子丑生人，居离兑二山为福地。 凡居正东、正南、东南，虽有福地合居，或有山谷当面，於春夏之间，见树本不荣茂，草苗似乾焦之色，而石木不润者，此名炎杀之山。 入山之人居之，多遭山火之难矣，以别居所宜之山也。 入山醮仪山主章第四 地皇君曰：大山有大山神主，小山有小山神主也。 入山修道之流，而不醮请其主，如人无故入人家也，其神与人之情则有所远矣。 凡入山择洞居庵，至山门下地上、或石上，铺净布巾一条，素食一盘，茶酒各一分，供养少时，烧白钱一束，以小状一纸投火，司烧之。 其状内言：某年月日，令入山求长生之道，不敢私住，故醮请山主神灵，愿垂护佑。 如此方可入山居住，若有所倚托也。 高玄生气择洞章第五 地皇君曰：凡人入山所居，虽然福地，而亦择其洞府也。 福地所宜，山中正东有洞室，门高五十尺已上，三丈已下者，乃神仙洞府也。 如门高五尺已下者，乃阳烟之庵也，而不可居。 洞高三丈已上者，乃云胎之岛也，虽居之，亦有强阴厉阳伤人之魂神也。 正南有石室，门高五十尺已上，三丈已下者，乃曰洞府也。 石室东南者，霍明洞府也； 正西者，名曰魂穴； 正北有石室者，名曰魄窟； 东北有门，名曰石毒也。 石城洞府居之，自有祥瑞感应，灵芝丹草出现也。 若穴窟中居者，非独精邪之患，皆天地之生气，离神仙之血脉也。 若无神书，其祸大矣。 凡入所宜之山，山无洞府，见东南木荣石润草滋，同商一字，水三折者，亦可翦茅作庵，而修命蒂，亦乃神仙之福地，必出天官也。 封山元天净地章第六 地皇君曰：既居仙府，须封山净地，不令邪精犯我之境也。 取山桃板六片，长七寸，阔三寸，厚一寸，面上存皮，一面光，以新笔香墨，各书六丁神符一道在桃板上。 用朱砂涂印，左手执印，向天门念地皇咒三徧，取气三口吹於印上，用朱砂再涂印，印於六丁符上，各印一印，将桃板镇安於六绝之，自然精邪灭迹，虎豹潜形，飞鸟不鸣，万类不现，久而居之，神升上界之道。 辩识仙宾邪神章第七 地皇君曰：久居名洞仙府之中，日深岁故，志道精纯者，自有仙宾神官降矣。",
      "translated_text": "**The Dragon-Florescence Radiant Gold Script Seal**\n\nThe Dragon-Florescence’s resplendent gold-script seal—\nAt a single glimpse, all demonic hordes bind their forms.\nThe Purple Star of the Great Ultimate subdues thirty thousand,\nSweeping away evil and dispelling ranks of malevolent spirits.\nThe Mysterious Numinous lends me the seal’s power,\nAiding the true heavens to sweep away all monstrous traces.\nThe earth purified, the void ascended—ghosts and spirits quail,\nFacing the mountain, harnessing qi is the supreme pivot.\nLingzhi transforms into a hundred thousand forms,\nImmortal herbs become birds and beasts.\nWhen the seal illumines the void, nothing escapes its grasp,\nFor the great transformation of nature brooks no sentiment.\n\n**Incantation of the Terrestrial August One:**\n*\"Southern Seven Stars, Earth’s Gate of Six Dings,\nSix Jia Jade Maidens, heed my seal’s command—\nSwiftly, swiftly, as the law decrees!\"*\n\n**Second Chapter: True Form Talismanic Seal of the Terrestrial August One**\n**Talismanic Diagram of the Terrestrial August One’s True Form Jade Seal**\n*Four inches in length, four inches in width—*\n*Inscribed in cinnabar on yellow paper.*\n\nThe Terrestrial August Lord declares: For those dwelling in mountain caves or hermitages, or secluded in forests and valleys, at dawn each day, inscribe this true-form divine talisman, burn it to ash, mix with fragrant water, and—facing the Gate of Heaven—consume it. This will prolong life and extend years, while evil qi cannot assail you. For those living in the mountains, gathering all immortal lingzhi and numinous herbs, swallow the talisman and enter the abdomen, then illumine with the seal—such herbs will come of their own accord.\n\n**Third Chapter: Proper Practices for Mountain-Dwelling Adepts**\nThe Terrestrial August Lord declares: Among all beings, humans are the most noble. Thus, all living things must have their root, and all affairs must have their proper course. If a superficial learner suddenly conceives a virtuous thought yet fails to grasp the true principle or fathom the mysterious and profound, and rashly enters the famous mountains, they will encounter the five pitfalls and eight slayers’ misfortunes, or unforeseen mountain disasters—injuries from insects, maulings by tigers—leading many to their deaths, unaware that dwelling in mountains has its own method.\n\nThe formula states:\n- Those born in the *yin* or *chen* hours should dwell in the *qian* or *kan* mountains as their land of blessing.\n- Those born in the *mao*, *si*, or *wu* hours should dwell in the *kun* mountain as their land of blessing.\n- Those born in the *shen* or *wei* hours should dwell in the *gen* mountain as their land of blessing.\n- Those born in the *you* hour should dwell in the *zhen* mountain as their land of blessing.\n- Those born in the *xu* hour should dwell in the *xun* mountain as their land of blessing.\n- Those born in the *hai*, *zi*, or *chou* hours should dwell in the *li* or *dui* mountains as their land of blessing.\n\nThough one may have a blessed land to dwell in, if the due east, due south, or southeast faces a valley, and in spring or summer the trees appear withered, the grasses parched, and the stones and woods lack moisture, this is called a \"Scorching Slayer Mountain.\" Those who dwell here will often suffer mountain fires—seek another mountain more suitable.\n\n**Fourth Chapter: Offering Rites to the Mountain Lord**\nThe Terrestrial August Lord declares: Great mountains have great mountain lords, and small mountains have small mountain lords. For those entering the mountains to cultivate the Dao who do not perform offerings to invite their lord, it is as if one enters another’s home without cause—the spirits and humans will grow distant in sentiment. When entering a mountain to select a cave or hermitage, spread a clean cloth upon the ground or a stone at the mountain’s gate, place a dish of plain food, a portion of tea and wine, and make offerings for a short while. Burn a bundle of white spirit-money, and cast a small petition into the fire for the attendant to burn. The petition should state: *\"On such-and-such a year, month, and day, I enter this mountain to seek the Dao of long life. Not daring to dwell here privately, I now perform offerings to invite the mountain lord’s divine spirit, beseeching your protection and aid.\"* Only then may one enter and dwell in the mountain, as if relying on a patron.\n\n**Fifth Chapter: Selecting Caves by the High Mystery’s Vital Qi**\nThe Terrestrial August Lord declares: Though one may dwell in a blessed land, one must still select a cave abode. For a blessed land, if within the mountain’s due east there is a cave chamber with a door five *chi* or more in height—no less than three *zhang*—this is a divine immortal’s grotto. If the door is less than five *chi* in height, it is but a \"Yang Mist Hermitage,\" unsuitable for dwelling. If the cave is over three *zhang* in height, it is a \"Cloud Embryo Isle\"—though one may dwell there, it harbors strong yin and harsh yang that injure the human spirit and soul.\n\nIf there is a stone chamber in the due south with a door five *chi* or more in height—no less than three *zhang*—this is called a \"Grotto Abode.\" A stone chamber in the southeast is the \"Luminous Radiance Grotto\"; in the due west, it is called the \"Soul Cavern\"; in the due north, the \"Corpse Hollow\"; and in the northeast, the \"Stone Poison.\" Dwelling in a \"Stone City Grotto\" will naturally evoke auspicious responses, and lingzhi and elixir herbs will manifest. But those who dwell in hollows and caverns will not only suffer from spectral perils but also sever the vital qi of heaven and earth and the bloodline of immortals. Without divine scriptures, the calamity will be great.\n\nWhen entering a suitable mountain without a grotto, if one sees in the southeast flourishing trees, moist stones, and lush grasses, with water flowing in three bends resembling the character *shang*, one may cut thatch to build a hermitage and cultivate the root of life—this too is a blessed land of immortals, and one is certain to become a celestial official.\n\n**Sixth Chapter: Sealing the Mountain and Purifying the Earth by the Primordial Heaven**\nThe Terrestrial August Lord declares: Having settled in an immortal’s abode, one must seal the mountain and purify the earth to prevent malevolent spirits from trespassing upon one’s domain. Take six peachwood boards, each seven inches long, three inches wide, and one inch thick, leaving the bark on one side and smoothing the other. With a new brush and fragrant ink, inscribe a Six Ding spirit talisman on each board. Coat the seal with cinnabar, hold it in the left hand, face the Gate of Heaven, recite the Terrestrial August Incantation three times, draw three breaths of qi, and blow upon the seal. Recoat the seal with cinnabar and impress it once upon each Six Ding talisman. Then place the boards to guard the six directions—naturally, malevolent spirits will vanish without trace, tigers and leopards will conceal their forms, birds will cease their cries, and all creatures will disappear. Dwelling here for long, one will ascend to the celestial realms by the Dao.\n\n**Seventh Chapter: Discerning Immortal Guests and Malevolent Spirits**\nThe Terrestrial August Lord declares: Those who dwell long in famous grottoes and immortal abodes, as days and years deepen and their resolve for the Dao grows pure, will naturally have immortal guests and divine officials descend.",
      "overlap_context": "e-inspiring might.\nProfound, profound—the celestial writings are the divine ancestors,\nBeyond the mysterious, mysterious—nothing more remains.\nOne may await the jade blossom’s numinous light talismans,\nEradicating traces of divine winds and sweeping away harm.\n\nThe precious seal, the jade dragon’s prime ministerial pivot,\nIts divine mechanism governs and drives most fittingly.\nHeaven’s secrets and demonic spirits lie beyond all bounds,\nThe seal’s blade and immortal spirits pierce the azure void.",
      "start_char": 12708,
      "end_char": 13994,
      "start_sentence": 388,
      "end_sentence": 436,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.558513164520264,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太清金阙玉华仙书八极神章三皇内秘文.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "以辩之者，如早暮忽有彩霞流虚，真香入谷，瑞色祥气徘徊者，乃高真游矣。 以志祝恭心上告天皇，而求解脱之道，其高真慈愍，而自有降教也。 如或游岩谷溪际林峰，忽见云光围覆，而异兽祥禽径集，皆在左右，忽有红服朱龙者，忽有黄服玉佩者，或有紫衣六妹者，或有执节持旛张盖者，此乃神仙降焉。 如林谷山峰虚空之中，忽见黑气皂云，中间徘徊冠巾服饰，或寡或众，多相恍惚者，乃邪神会集也。 故神仙欲降遇之地，先有香风透谷，入鼻脑也。 如非神仙者，无香风之验也。 宜慎之，勿自观之也。 辩识三十六种芝草变形章第八 一曰仙足芝，紫星。 一曰丹芝，朱星。 一曰紫芝，黄星。 一曰景芝，青星。 一曰云芝，元星。 一曰天芝，黑星。 一曰地芝，绿星。 一曰烟芝，褐星。 一日神芝，有红文，如缠绊线。 此九芝者，皆一性之物也。 其物本出名山，万万年精神灵石之气所结，大小不等，皆色白如寒玉，夜於岩谷，光射太空，往观之如石，其色润鲜，上有星点辩之也。 一曰碧芝，青花。 一曰灵芝，黑花。 一曰焰芝，紫花。 一曰水芝，白花。 一曰气芝，黄花。 一曰玉芝，朱花。 一曰宝芝，粉红花。 一曰龙芝，碧花。 一曰虎芝，绿花。 此九芝，皆一性之物，其根生於江海山水、大小河边，本出山水秀气积而所生，状若细麻叶之形，高三五尺，冬夏不凋，其上常似有云淡气相覆，以其色花辩之。 一曰琼芝，花形。 一曰柱芝，木形。 一曰花芝，禽形。 一曰金芝，人形。 一曰玄芝，云朵形。 一曰锦芝，兽形。 一曰青芝，无形状。 一曰湿芝，水形。 一曰风芝，楼塔之形。 此九芝者，乃一根之性也。 多生石山洞府石室中，其本出云根烟梢凝结而所化也。 其大小不测，状若石乳，生成龙虎飞禽人物之象，贴於石壁也。 色如朱火，昼夜有光，香风氤氲而有形象。 辩之此二十七品，乃琼花金蒂羽化仙芝也。 若得遇而采之者，以服讫，上升云汉，点凡骨作仙骨，化仙人作真人，超凡人圣，身腾九霄，故古仙有言灵芝入腹，白日升於天上者是也。 一曰云精芝，如云朵。 一曰黄芝，如犬形。 一曰英芝，状如楼阁之形。 一曰瑞芝，鸳鸯之形。 一曰秀芝，鹤形。 一曰华芝，花果之形。 一曰木芝，如木蛾形。 一曰草芝，如虎之形。 一曰上芝，人形。 此九芝，乃一根所化成之物也。 形状不测，多生於枯木朽株，宫殿庭室水楝之上，而有之也。 若采服之，可以延年益寿，有小补矣。 辩识三十六种仙药形像章第九 一名朱砂精，形赤。 一名曾青精，形青。 一名石膏精，形白。 一名雄黄精，形赤。 一名硫黄精，形黄。 一名空青精，形淡赤。 一名白矾精，形绿。 一名云母石精，形黑。 一名石砂精，形紫。 此九种仙药之精，皆金石所化也，形状如一大鬼，朱发红眉而多现矣。 然各有体色，辩焉。 一名乌石精，十六足。 一名禹余精，二＋四足。 一名井泉石精，十二足。 一名盥土精，十足。 一名雌黄精，无足，肉翅，善飞。 一名滑石精，八足。 一名阳起石精，六足。 一名石脂精，四足。 一名水银精，二足。 此九种石精，皆金石所化也。 形如一蝎，大小莫测，色如白练，其有无足以辩之也。 一名人参精，如小儿，素衣，手执花。 一名茯苓精，如小儿手执松栢。",
      "translated_text": "To discern these, if at dawn or dusk one suddenly sees rainbow-hued clouds drifting through the void, true incense wafting into the valley, or auspicious colors and propitious qi lingering, these are signs of exalted perfected beings on their passage. With sincere devotion, one should reverently announce to the Heavenly August Lord and seek the Way of liberation—then the exalted perfected, moved by compassion, will naturally descend to instruct.\n\nIf wandering among cliffs, valleys, streams, or forested peaks, one suddenly sees clouds and radiance enveloping the scene, with rare beasts and auspicious birds gathering all around, or if there appears one clad in red robes with a vermilion dragon, or another in yellow robes with jade pendants, or six maidens in purple attire, or those bearing staffs, banners, and canopies—these are divine immortals descending.\n\nIf in the emptiness of forests, valleys, or mountain peaks, one suddenly sees black qi or dark clouds swirling, with indistinct figures in caps and robes, whether few or many, drifting in confusion—these are malevolent spirits assembling. Thus, when immortals are about to descend, a fragrant breeze first permeates the valley, entering the nose and mind. If no such fragrant wind appears, it is not the advent of immortals. Exercise caution and do not gaze upon them.\n\n**Eighth Chapter: Discerning the Thirty-Six Transformed Forms of Zhi-Grasses**\n\n1. Immortal-Foot Zhi: purple star.\n2. Cinnabar Zhi: vermilion star.\n3. Purple Zhi: yellow star.\n4. Radiant Zhi: azure star.\n5. Cloud Zhi: primal star.\n6. Heavenly Zhi: black star.\n7. Earthly Zhi: green star.\n8. Mist Zhi: brown star.\n9. Divine Zhi: marked with red veins like tangled threads.\n\nThese nine zhi are of a single nature. Born in renowned mountains, they are congealed from the spiritual qi of numinous stones over myriad ages, varying in size and white as cold jade. At night in the valleys, their light pierces the heavens; though they appear as stone, their hues are lustrous and fresh, distinguished by their star-like specks.\n\n1. Azure Zhi: blue blossoms.\n2. Numinous Zhi: black blossoms.\n3. Flame Zhi: purple blossoms.\n4. Water Zhi: white blossoms.\n5. Qi Zhi: yellow blossoms.\n6. Jade Zhi: vermilion blossoms.\n7. Treasure Zhi: pink blossoms.\n8. Dragon Zhi: azure blossoms.\n9. Tiger Zhi: green blossoms.\n\nThese nine zhi are of a single nature, their roots growing by rivers, seas, mountains, and streams, or along great and small waterways. Born from the accumulated essence of mountain and water, they resemble fine hemp leaves, standing three to five feet tall, evergreen through winter and summer. Their crowns are often veiled in faint, cloud-like qi, distinguished by their colors and blossoms.\n\n1. Jade Zhi: flower-shaped.\n2. Pillar Zhi: wood-shaped.\n3. Floral Zhi: bird-shaped.\n4. Golden Zhi: human-shaped.\n5. Mystic Zhi: cloud-cluster-shaped.\n6. Brocade Zhi: beast-shaped.\n7. Azure Zhi: formless.\n8. Moist Zhi: water-shaped.\n9. Wind Zhi: tower-and-pagoda-shaped.\n\nThese nine zhi share a single root-nature. They grow in stone chambers of grotto-heavens and mountain caves, transformed from the condensation of cloud-roots and mist-tips. Their size is unfathomable, resembling stalactites with forms of dragons, tigers, flying birds, and human figures clinging to stone walls. Their color is like burning cinnabar, glowing day and night, exuding fragrant qi in visible shapes.\n\nThese twenty-seven varieties are the jade-blossomed, gold-stemmed, feather-transformed immortal zhi. Those who encounter and ingest them will ascend to the celestial rivers, transmuting mortal bones into immortal ones, transforming into perfected beings, transcending the mundane to enter sageliness, and soaring through the nine heavens. Thus the ancients said: \"When numinous zhi enters the belly, one ascends to heaven in broad daylight.\"\n\n1. Cloud-Essence Zhi: cloud-cluster-shaped.\n2. Yellow Zhi: dog-shaped.\n3. Heroic Zhi: tower-and-pavilion-shaped.\n4. Auspicious Zhi: mandarin-duck-shaped.\n5. Elegant Zhi: crane-shaped.\n6. Florid Zhi: flower-and-fruit-shaped.\n7. Wood Zhi: moth-shaped.\n8. Grass Zhi: tiger-shaped.\n9. Supreme Zhi: human-shaped.\n\nThese nine zhi are transformations of a single root. Their forms are unpredictable, often growing on withered trees, rotting stumps, palace courtyards, or the beams of water pavilions. Ingesting them can prolong life and extend years, offering modest benefit.\n\n**Ninth Chapter: Discerning the Thirty-Six Forms of Immortal Medicines**\n\n1. Cinnabar Essence: red in form.\n2. Malachite Essence: blue in form.\n3. Gypsum Essence: white in form.\n4. Realgar Essence: red in form.\n5. Sulphur Essence: yellow in form.\n6. Hollow Malachite Essence: pale red in form.\n7. Alum Essence: green in form.\n8. Mica Essence: black in form.\n9. Cinnabar Sand Essence: purple in form.\n\nThese nine immortal medicine essences are transformations of metals and stones, each resembling a great demon with crimson hair and red brows, manifesting in various forms. Their distinct body colors serve as markers.\n\n1. Black Stone Essence: sixteen legs.\n2. Yu’s Remnant Essence: twenty-four legs.\n3. Well-Spring Stone Essence: twelve legs.\n4. Basin Earth Essence: ten legs.\n5. Orpiment Essence: legless, with fleshy wings, adept at flying.\n6. Talc Essence: eight legs.\n7. Actinolite Essence: six legs.\n8. Stone Fat Essence: four legs.\n9. Mercury Essence: two legs.\n\nThese nine stone essences are also transformations of metals and stones. They resemble scorpions of indeterminate size, white as silk, distinguished by the presence or absence of legs.\n\n1. Ginseng Essence: like a small child in plain robes, holding flowers.\n2. Poria Essence: like a small child holding pine or cypress.",
      "overlap_context": "out trace, tigers and leopards will conceal their forms, birds will cease their cries, and all creatures will disappear. Dwelling here for long, one will ascend to the celestial realms by the Dao.\n\n**Seventh Chapter: Discerning Immortal Guests and Malevolent Spirits**\nThe Terrestrial August Lord declares: Those who dwell long in famous grottoes and immortal abodes, as days and years deepen and their resolve for the Dao grows pure, will naturally have immortal guests and divine officials descend.",
      "start_char": 13994,
      "end_char": 15233,
      "start_sentence": 437,
      "end_sentence": 517,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.630463123321533,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太清金阙玉华仙书八极神章三皇内秘文.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "一名枸杞精，如小犬，夜鸣山谷。 一名大黄精，如女子，执衣裸形。 一名琥珀精，如一虎，能飞空。 一名万年老葛精，如龙无鳞甲，多藏石穴。 一名老藤精，如肉块，破之如膏。 一名黄精精，如小儿手执黄精苗。 一名苍木精，如小儿手执苍朮苗，多游高峰岭上，夜出现。 此九种仙药之精，皆草木所化也。 其名山多有之，以形色体象辩焉。 一名天麻精，色赤如血。 一名远志精，色白。 一名地黄精，色黄。 一名牛膝精，土色。 一名乌头精，色黑。 一名白木精，色紫。 一名徒蓉精，色绿。 一名松萝精，色青。 一名甘草精，色褐。 此九种仙药之精，乃芝草所化也，今名山多有之，形如大虾蛛，朱目无口，四足，而所化芝草，以颜色中辩之。 此三十六种仙药名，辩认化形，取白纸一张，上书某物精草之名，用地皇印望天门，执印念地皇咒三徧，取气三口，吹於印上，以朱砂涂印，印於纸上所写之名，其所化芝草，远近自来现矣。 再用印印之，乃现本形之药，以服讫，身换凡胎，足下生风云，令人不死，长生久视矣。 地皇君服饵仙朮升仙得道章第十 取向南面术一十六斤，以水洗浸净，白茯苓去皮三斤，天门冬去心三斤，三味入臼内。 杵三千五百下，令若烂泥相似，同入一瓦釜中，用水一石，慢火煎熬至三斗，取滓不用，再熬其汁成膏状，若蜜汁许，封入甍罐中。 每日用好酒，空心化下半两。 忌食荤肉、葵菜、酸咸、房室之事。 服之百日，宿疾顿消，万病除矣。 服之一年，五脏缠绵，肉身光莹，自然不食五谷，心清神爽，寒暑不侵，容貌泽润。 服至三年，身生玉瑛，项有圆光，久久服之，以出生死，云行方外，名曰精行仙人，乃志芝草得道者也。 太清金阙玉华仙书八极神章三皇内秘文卷中 太清金阙玉华仙书八极神章三皇内秘文卷下 道至无而生天地。 天至动也，而北辰不移，含虚不亏；",
      "translated_text": "A **Lycium Berry Essence**, resembling a small dog, howling in mountain valleys at night.\nA **Rhubarb Essence**, appearing as a woman, bare-bodied yet clutching garments.\nAn **Amber Essence**, like a tiger, capable of soaring through the air.\nA **Millennial Kudzu Essence**, resembling a scaleless dragon, often concealed in stone caves.\nAn **Aged Vine Essence**, shaped like a lump of flesh, which when broken reveals a paste-like substance.\nA **Solomon’s Seal Essence**, like a child holding a sprig of Solomon’s seal.\nA **Atractylodes Essence**, like a child holding a sprig of atractylodes, often roaming high peaks and ridges, appearing at night.\n\nThese nine essences of immortal herbs are all transformations of plants. They are commonly found in famous mountains, distinguished by their forms, colors, and bodily features.\n\nA **Gastrodia Essence**, crimson as blood.\nA **Polygala Essence**, white in color.\nA **Rehmannia Essence**, yellow in hue.\nAn **Achyranthes Essence**, earth-toned.\nAn **Aconite Essence**, black in color.\nA **White Wood Essence**, purple in hue.\nA **Cistanche Essence**, green in color.\nA **Usnea Essence**, azure.\nA **Licorice Essence**, brown.\n\nThese nine essences of immortal herbs are transformations of *zhi* mushrooms. They are often found in famous mountains, resembling large spiders with vermilion eyes, no mouth, and four legs. The *zhi* mushrooms from which they arise are distinguished by their colors.\n\nTo discern these thirty-six immortal herbs and their transformations: take a sheet of white paper and inscribe the name of the desired essence or herb upon it. Hold the **Earth Sovereign Seal** toward the Gate of Heaven, grasp the seal, and recite the **Earth Sovereign Incantation** three times. Draw in three breaths of *qi* and exhale them onto the seal, then coat the seal with cinnabar. Imprint the seal upon the inscribed name, and the transformed *zhi* mushroom will manifest from afar. Press the seal again, and the herb in its true form will appear. Consuming it will refine the mortal body, summoning wind and clouds beneath one’s feet, granting immortality and everlasting vision.\n\n**Chapter Ten: The Earth Sovereign’s Ingestion of Immortal Herbs for Ascension and Dao-Attainment**\n\nTake sixteen *jin* of **Southern-Facing Artemisia**, wash and soak it clean. Peel three *jin* of **White Poria** and three *jin* of **Asparagus Root** (with hearts removed). Place all three ingredients into a mortar and pound them three thousand five hundred times until they resemble a smooth paste. Transfer the mixture into an earthenware pot, add one *dan* of water, and simmer over a slow fire until reduced to three *dou*. Discard the dregs, then continue simmering the liquid until it thickens to the consistency of honey. Seal it in a jar.\n\nEach day, dissolve half a *liang* in fine wine and consume it on an empty stomach. Avoid meat, mallow, sour or salty foods, and sexual activity. After one hundred days, long-standing ailments will vanish, and all diseases will be eradicated. After one year, the five viscera will be harmonized, the body will glow with luminosity, and one will naturally abstain from grains. The mind will be clear, the spirit refreshed, and one will be untouched by cold or heat, the complexion radiant and moist. After three years, the body will generate jade-like luster, a halo will encircle the neck, and with prolonged ingestion, one will transcend life and death, roaming beyond the mundane, known as a **Refined Practitioner Immortal**—one who has attained the Dao through *zhi* mushrooms.\n\n**The Supreme Clarity Golden Palace Jade Flower Immortal Scripture: Eight Poles Divine Chapters, Three Sovereigns’ Esoteric Writings, Scroll Two**\n\n**The Supreme Clarity Golden Palace Jade Flower Immortal Scripture: Eight Poles Divine Chapters, Three Sovereigns’ Esoteric Writings, Scroll Three**\n\nThe Dao, reaching nothingness, gives birth to Heaven and Earth.\nHeaven, in its ceaseless motion, leaves the North Star unmoved, embracing emptiness without depletion...",
      "overlap_context": " Essence: legless, with fleshy wings, adept at flying.\n6. Talc Essence: eight legs.\n7. Actinolite Essence: six legs.\n8. Stone Fat Essence: four legs.\n9. Mercury Essence: two legs.\n\nThese nine stone essences are also transformations of metals and stones. They resemble scorpions of indeterminate size, white as silk, distinguished by the presence or absence of legs.\n\n1. Ginseng Essence: like a small child in plain robes, holding flowers.\n2. Poria Essence: like a small child holding pine or cypress.",
      "start_char": 15233,
      "end_char": 15957,
      "start_sentence": 518,
      "end_sentence": 550,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.658996105194092,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太清金阙玉华仙书八极神章三皇内秘文.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "地至静也，而东流不辍，兴云不竭，故天长地久，人何独而有死焉。 盖人不知天地之趣，荒迷纪纲之神，以将恩情为爱，尘欲为亲，未及中年，多先祸命。 今者故开太虚之首，明辫天地之元，诀神明之法，以度群生，免失人身之道。 得遇者以功志神，能白日升天，以道炼气，能在世而不死。 斯文乃高玄内秘，深泄天机，秘之玉匣，乱传漏慢此书，九祖沉殃，尔秘之秘之。 制恶兴善章第一 阳之精曰魂与神，阴之精日魄与尸。 神胜则为善，魄强则为恶，制恶兴善则理，忘善从恶则乱，理久而尸灭魄亡，乱久而神逝魂散。 故尸灭魄亡者，神与形合，与太阳而为仙； 神逝魂消者，尸与魄沦，与太阴而为鬼。 皆自然之理也。 立正忘邪章第二 人之修道，当立其正而忘其邪。 正之不立，则生诸乱而损伤於神，邪之不忘，则感众恶而反害於身。 故立其正，则仙道日邻，从其邪，则鬼道日亲。 不忘情绝念，不止欲澄心，专为贪饕嗜欲，不舍爱情，从心所欲者，为其邪也。 明昏乱章第三 不识贤，不择友，不辩法，能无迷乎？ 不识二真反覆，不察阴阳混成，行功无节，屈性伐神，能无损乎？ 不达玄妙，独执小术，能无病乎？ 虚功受死，能无误乎？ 固形体章第四 固形者，以养生之初务，为大道之根元。 幽栖忘其声色，纯素安於天和。 然要辩其损益，识其禁忌，明其内外，知其生克，息华液於玉池，保流酥於紫府。 精积成而元气自生，气旺灵而元神自集，神旺集而五气自运，五气既运，为通玄至真之渐也。 炼神气章第五 神水河车莹兮莹，返复刀圭新更新。 卦铺离象垂琼滴，洒翠潜烟深更深。 运用坎离交龙虎，子后午前一度举，一上一下往来腾。 更寻元首节节推，节节推时卯与酉。 昆仑透过玉酥膏，运入华池分三口。 泝流交换接纯阳，遍满寰瀛诸藏走。 八正三爻火数成，神气相合体不朽。 诀曰：点滴琼浆莹若水，烹炼还元补虚髓。 八爻正气一齐兴，冲透双关换颜体。 出圣胎章第六 青兮清，翠兮浓，一颗明珠绝埃尘。 绝埃尘兮尘尽去，尽去尘兮现本真。 本真现兮无大小，变化通灵作姹婴。 精抱血，血抱精，精血相投肌骨生。 肌骨生兮分天地，天地分兮脾在志，志在脾兮魂入肝，心肾相和魄入肺，五藏安神尽总全。 然后三才分六位，其中精府受盛门。 六律分爻定五音，五音全兮阳数足。 一半周天烧弯曲，神分形定志精细，缎炼连绵烹正气。 正气兴兮神自通，彼物着灵十月功。 十月功成圣胎就，出入无阻能游走，遍游四大上蓬宫，百万年光无衰朽。 诀曰：阳数足时养圣胎，精裹初灵手足开。 从九至九炼见九，一身分出数身来。 超仙章第七 道元一也，而用之有三，上有天地阴阳升降，二气绵绵，周而复始，往来不失其序之道也。 达之则逸於霄汉云中，有日月往来，二八九六，精华相吞，魂魄交媾，而不失其度之道也。 升之则迁於南宫，下有五行传送，受气配合，生爻产象，而不失其理之道也。 达之则升三岛，不始不终矣。 人皇君曰：修士志神炼骨壮命，而俱不出此神章也。 以用道之流，或居山洞、或居庵林、或择一静室，香花焚之，清气生华，然后择一奇日，面拜八方，东西南北四维。 拜讫，安炉炼气，因气安精，因精安神，因神致生也。",
      "translated_text": "The Earth, in its utmost stillness, never ceases its eastward flow, nor exhausts its clouds; thus Heaven endures and Earth abides—why then should man alone face death? This is because man fails to comprehend the inclinations of Heaven and Earth, neglects the spirits that govern the cosmic order, mistakes fleeting attachments for love, and worldly desires for kinship. Before reaching middle age, many invite calamity upon their fate.\n\nNow, therefore, the origins of the Great Void are revealed, the primal essence of Heaven and Earth is clarified, and the methods of refining the spirit are disclosed—to deliver all beings and prevent the loss of the human Dao. Those who encounter this teaching and cultivate with devotion may ascend to Heaven in broad daylight; those who refine *qi* through the Dao may abide in the world without dying.\n\nThis text is the profound esoterica of the Supreme Mystery, a deep revelation of celestial mechanics. It is sealed within a jade casket—should it be recklessly disseminated, nine generations of ancestors will suffer misfortune. Guard it well, guard it well.\n\n**Chapter One: Restraining Evil and Cultivating Goodness**\nThe essence of Yang is the *hun* and the spirit; the essence of Yin is the *po* and the *shi*. When the spirit prevails, goodness arises; when the *po* grows strong, evil emerges. Restraining evil and cultivating goodness brings order; forgetting goodness and following evil brings chaos. With prolonged order, the *shi* perishes and the *po* vanishes; with prolonged chaos, the spirit departs and the *hun* scatters. Thus, when the *shi* perishes and the *po* vanishes, spirit and form unite, ascending with the Great Yang to become an immortal. When the spirit departs and the *hun* scatters, the *shi* and *po* sink, descending with the Great Yin to become a ghost. Such is the natural principle.\n\n**Chapter Two: Establishing the Upright and Forgetting the Deviant**\nIn cultivating the Dao, one must establish the upright and forget the deviant. If the upright is not established, disorder arises, harming the spirit; if the deviant is not forgotten, myriad evils are attracted, bringing harm to the body. Thus, establishing the upright brings one daily closer to the Dao of immortality, while following the deviant draws one daily nearer to the path of ghosts. Clinging to emotions, failing to sever thoughts, ceasing not from desires, and allowing the heart to remain turbid—indulging in greed, gluttony, and cravings, refusing to relinquish attachments, and following the heart’s every whim—these are the ways of the deviant.\n\n**Chapter Three: Clarity and Confusion**\nFailing to recognize the worthy, failing to choose friends wisely, failing to discern the Dharma—how can one avoid delusion? Failing to recognize the two truths’ reversals, failing to examine the intermingling of Yin and Yang, practicing without restraint, suppressing one’s nature and exhausting the spirit—how can one avoid harm? Failing to grasp the profound mystery and clinging to minor techniques—how can one avoid illness? Expending effort in vain and inviting death—how can one avoid error?\n\n**Chapter Four: Fortifying the Body**\nFortifying the body is the first task of nurturing life and the root of the Great Dao. Dwelling in seclusion, one forgets sound and color, abiding in purity and harmony with Heaven’s accord. Yet one must discern what harms and benefits, recognize prohibitions and taboos, understand the internal and external, and know the cycles of generation and destruction. Still the floral fluids in the Jade Pool, preserve the flowing *ghee* in the Purple Palace. When essence accumulates, primordial *qi* arises spontaneously; when *qi* flourishes, the spirit gathers of its own accord; when the spirit flourishes and gathers, the Five *Qi* circulate naturally. Once the Five *Qi* circulate, one gradually approaches the state of the profound and ultimate truth.\n\n**Chapter Five: Refining Spirit and Qi**\nThe *Divine Water* and *River Chariot* gleam ever anew,\nRepeatedly refining the *Knife and Square* without end.\nThe *Li* trigram’s image drips with jade-like drops,\nScattering emerald mists in ever-deepening depths.\nEmploy the union of *Kan* and *Li*, the Dragon and Tiger,\nOnce at midnight, once at noon—each ascent and descent.\nUp and down they soar in ceaseless motion.\nSeek further the primordial origin, advancing step by step,\nAt each step, the hours of *Mao* and *You*.\nPassing through Kunlun, the jade-like *ghee* flows,\nEntering the Flower Pool, divided into three mouths.\nFlowing upward, exchanging and merging with pure Yang,\nFilling the entire realm, coursing through all the organs.\nWith the Eight Uprights and Three Lines, the fire’s number is complete,\nSpirit and *qi* unite, the body becomes indestructible.\n\n**Formula:**\nDrip by drip, the jade-like nectar glistens like water,\nRefining and returning to the origin, replenishing the marrow’s void.\nWhen the Eight Trigrams’ upright *qi* arise as one,\nThey surge through the double passes, transforming the body’s countenance.\n\n**Chapter Six: Emergence of the Sacred Embryo**\nAzure, so clear; emerald, so rich—\nA single luminous pearl, untouched by dust.\nWhen dust is utterly gone, the original truth appears.\nOnce the original truth appears, there is no great or small,\nTransforming and penetrating the spirit, becoming the *Chenying*.\nEssence embraces blood, blood embraces essence,\nEssence and blood unite, flesh and bone are born.\nWhen flesh and bone are born, Heaven and Earth divide;\nHeaven and Earth divide, the spleen resides in *zhi*,\n*Zhi* resides in the spleen, the *hun* enters the liver,\nHeart and kidneys harmonize, the *po* enters the lungs,\nThe five organs are at peace, the spirit is wholly complete.\nThen the Three Powers divide into six positions,\nWithin them, the Essence Palace receives the Gate of Abundance.\nThe Six Pitches divide the lines, determining the Five Tones;\nWhen the Five Tones are complete, the Yang number is fulfilled.\nHalf a celestial cycle burns and bends,\nSpirit divides, form stabilizes, *zhi* and essence refine,\nContinuously tempering and refining the upright *qi*.\nWhen upright *qi* arises, the spirit naturally communicates,\nAnd after ten months of work, the sacred embryo is formed.\nOnce the sacred embryo is complete, it moves freely without obstruction,\nRoaming the Four Great Continents and ascending to Penglai Palace,\nAbiding for a million years without decay.\n\n**Formula:**\nWhen the Yang number is fulfilled, nurture the sacred embryo,\nEssence enfolds the initial spirit, hands and feet awaken.\nFrom nine to nine, refine and witness nine,\nA single body divides into multiple forms.\n\n**Chapter Seven: Transcending to Immortality**\nThe Dao’s origin is One, yet its applications are three. Above, there is the ascent and descent of Heaven and Earth’s Yin and Yang, the ceaseless intertwining of the Two *Qi*, cycling endlessly without losing their order—this is the Dao. Mastering it, one soars amidst the clouds of the empyrean, where the sun and moon traverse, the Two Eights and Nine Sixes, essence and brilliance mutually consuming, *hun* and *po* uniting without losing their measure—this is the Dao. Ascending further, one reaches the Southern Palace, where below the Five Phases transmit and convey, receiving *qi* and forming combinations, generating lines and producing images without losing their principle—this is the Dao. Mastering it, one ascends to the Three Isles, where there is no beginning and no end.\n\nThe Human Sovereign Lord said: All cultivators who refine the spirit, strengthen the bones, and fortify life do not transcend these divine chapters. Following the currents of the Dao, some dwell in mountain caves, some in forest hermitages, others choose a quiet chamber. Burning incense and flowers, the pure *qi* flourishes. Then, on an auspicious day, one faces the eight directions—east, west, south, north, and the four intermediates. After paying homage, the furnace is set, *qi* is refined, *qi* stabilizes essence, essence stabilizes the spirit, and the spirit engenders life.",
      "overlap_context": "the Dao through *zhi* mushrooms.\n\n**The Supreme Clarity Golden Palace Jade Flower Immortal Scripture: Eight Poles Divine Chapters, Three Sovereigns’ Esoteric Writings, Scroll Two**\n\n**The Supreme Clarity Golden Palace Jade Flower Immortal Scripture: Eight Poles Divine Chapters, Three Sovereigns’ Esoteric Writings, Scroll Three**\n\nThe Dao, reaching nothingness, gives birth to Heaven and Earth.\nHeaven, in its ceaseless motion, leaves the North Star unmoved, embracing emptiness without depletion...",
      "start_char": 15957,
      "end_char": 17220,
      "start_sentence": 551,
      "end_sentence": 607,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 69.76116752624512,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太清金阙玉华仙书八极神章三皇内秘文.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "久久致炼，妙化成真。 夫九转五还、三返八变，齐天容，少返纯，衰者得强，老者得壮，壮者得童，童者得婴。 故自凡而得圣，乃炼圣至於仙，炼仙至於真，炼真至於妙，炼妙合於神，炼神合虚，虚气乃元道之始也。 则知道在我，飞游四海之外，或入帝乡之中，上朝金阙，面拜高真，名列九元，位配星辰。 或安九天之上，或宿八极之堂，或与群仙共诣玄都之府，或伴高真玩于大罗之天，或游名山海岳，或赴南宫之会，或上天拣择人鬼姓名，或下界检录斋醮罪福，或掌括名山大川，或总持生书死籍。 或与诸仙同鸾驾，而北游紫圃。 或南过金泉，集贤宾而采草木花实。 或西游龟山，朝王母於金殿。 或迈扶桑，饮红酒于琼园。 无上无为，自在仙真，空真化真仙子。 仙子者，从何而得焉。 始绝六根、断六尘，视之不见其物，听之不闻其声，平和恬淡，澄净精微，虚明含元，天真六化，至神炼气而成。 且非尘情贪欲，恩爱而得者也。 人皇符印章第八 符者，真形之龙篆也。 印者，太虚之正气也。 天元深旨，天机之媾，妙运至真之斡大端，驱神鬼之祖法，摄邪祆之枢机，皆击於此印之力，功能隐形散影，藏气收神，使阴阳六变其体，令人鬼不见其形也。 人皇印图 长三寸　阔三寸",
      "translated_text": "With prolonged refinement, wondrous transformation perfects the true. Through nine revolutions and five returns, three reversions and eight changes, one’s celestial bearing aligns, youthful purity returns, the frail grow strong, the aged regain vigor, the robust become youthful, and the young revert to infancy. Thus, from the mortal one attains sagehood; refining the sage leads to immortality, refining the immortal leads to perfection, refining the perfected leads to subtlety, refining subtlety merges with the spirit, and refining the spirit unites with emptiness—where *qi* and the primordial Dao begin.\n\nKnow then that the Dao resides within me: I soar beyond the four seas, or enter the imperial realm, ascend to the Golden Gates to pay homage to the exalted perfected, my name inscribed among the Nine Origins, my rank aligned with the stars. Some abide above the Nine Heavens, some lodge in the halls of the Eight Poles, some join the host of immortals at the Dark Capital’s court, or accompany the exalted perfected in the Great Veil Heaven. Some wander famous mountains and sea peaks, or attend the assemblies of the Southern Palace; some ascend to heaven to review the names of humans and ghosts, or descend to the world to record merits and transgressions from rites and fasts. Some govern the great mountains and rivers, or oversee the registers of life and death. Some ride phoenix chariots with the immortals, journeying north to the Purple Garden; or pass south through Golden Springs, gathering wise companions to pluck herbs and flowers. Some travel west to Tortoise Mountain to pay court to the Queen Mother in her golden palace; or cross the Fusang Tree to drink crimson wine in the Jade Orchard. Free from the highest, free from action, the immortal perfected abide in spontaneity—empty perfection transforms into the immortal adept.\n\nHow does one become an immortal adept? First, sever the six roots and cut off the six dusts: sight perceives no objects, hearing detects no sounds. Serene and tranquil, clear and subtle, empty and luminous, embracing the primordial, the celestial truth undergoes six transformations—through the utmost spirit refining *qi*, one achieves this. It is not attained through worldly passions, greed, or attachments of love.\n\n**Chapter Eight: The Talismans and Seals of the Human Sovereign**\nThe talisman is the true form of dragon script; the seal is the upright *qi* of the Great Void. It embodies the profound intent of the Celestial Origin, the union of celestial mechanisms, the wondrous operation of the utmost truth’s great pivot—the ancestral method for commanding spirits and ghosts, the key to subduing demons and heresies. Struck by this seal’s power, one can conceal form and disperse shadow, hide *qi* and gather spirit, causing yin and yang to transform the body sixfold, rendering it invisible to humans and ghosts alike.\n\n**Illustration of the Human Sovereign’s Seal**\nThree *cun* in length, three *cun* in width.",
      "overlap_context": " bones, and fortify life do not transcend these divine chapters. Following the currents of the Dao, some dwell in mountain caves, some in forest hermitages, others choose a quiet chamber. Burning incense and flowers, the pure *qi* flourishes. Then, on an auspicious day, one faces the eight directions—east, west, south, north, and the four intermediates. After paying homage, the furnace is set, *qi* is refined, *qi* stabilizes essence, essence stabilizes the spirit, and the spirit engenders life.",
      "start_char": 17220,
      "end_char": 17708,
      "start_sentence": 608,
      "end_sentence": 626,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.811811447143555,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太清金阙玉华仙书八极神章三皇内秘文.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "人皇真形符篆 长三寸　阔三寸 人皇神咒章第九 九气氤氲，玉咒以从，高华妙狱，十极上尊，太虚神主，八天大君，木翁金母，无上玄真，各降真气，驱灭邪踪。 南方赤帝，云乘火龙，西方白帝，利斩祆氛，北方黑帝，霞映神晶，东方青帝，鸟咤啰英。 九天九神，鬼门天丁，玉女直符，太岁纵横，五岳吏兵，天士都司，八目神童，北斗魁罡，四目老翕，吞魔大杀，四十壮充，六丁六甲，入吾印中。 急急如律令，奉勃摄。 知生死五假素奏上法章第十 知死法：合掌但开第四指，开时必定阎罗知。 诀曰：每月初七、十七、二十七、一月三次，每次知十日生死之兆也。 焚香面东，日初出，望东方念人皇咒一徧，取日晶气三口，咽归腹中，然后面东正坐，将天元地要相合，开手第四指。 如不开时，乃万神全而未死之兆也。 如忽开放者，乃人天不相救，神气不在壳，是死之兆也。 然看何日死者，於五行之日定之。 如其日金者，於知死之日外第三日死也。 木日第四日，水日第五日，土日第七日，火日第九日。 其鬼使来追，既知其死日，后用假命五术以假之。 五假法者，上避天劫之灾，下避大运之穷。 如有天水之劫，上倾下溢，河海涨空，江水泛突，横流漂荡，山岳无有，水轮四旋，阴精故出，世无所存，天无所空，浩浩旷冥，尽无民辈，以法假之，入水不见其水。 知天地风火之劫，焰着凝空，烈驰洞阔，交虚晦海，焚地吹山，上无玄天，下无玄地，一切万有，化作灰尘，以法假之，如入静梵。 如一切干戈，征伐四起，国土并吞，横尸如山，血流若海，以法假之，凡人不见其形，自在云游无阻。 如三限之危，空亡之厄，大小运并，胎禄相食，亡命合死，以法假之，造化不能移，阴阳不能迁，鬼神不能知，而寿一百二十岁，长生之人也。 南岳魏夫人续云：尘世俗辈，末学之人，敬有道心，便入名山，遇灵芝则不识，逢虎豹则无术，何异将身去投死地者哉。 始欲长生，而反遭横夭者多矣，吾哀见此辈，昔告上帝，得赐此经，以五符真箓诛邪斩怪，收束虎狼，使万魔潜迹，百鬼窜形，令一切修真之士，皆得无为之道也。 自然山林清静，灵芝露英，金玉发泄，秀气熏蒸，或茹芝被褐，栖真味道，精灌人神，岂不宁哉。 五符真文，择境居山，山有贵贱，气有死生，凡欲居之，必当择境。 大山成处，以小山为贵； 小山成处，以大山为贵； 石山成处，以土山为贵； 土山成处，以石山为贵； 如此大小土石等山，以众山朝者为贵。 择此贵山，生气五福之隅，则可幽居洞府，栖隐岩峦，或诛茅结庐，与鹤鹿为友，住此久者，能行顺养之术，可致长生矣。 何哉？ 为其阳精实壮，秀气熏蒸故也。 识辩洞府，有曰洞、曰府、曰穴、曰窟者，何也？ 凡山面东者谓之洞，山面南者谓之府，山面东南者谓之岩，山面西南者谓之穴，山面北者谓之窟，山面东北者谓之坎也。 洞府岩穴中居之者，自然高真上仙、达人逸士，时来降佑，当获玄妙矣。 若窟坎中居之者，则有毒虫猛兽、老魅山精，迫促凌犯矣。 盖为皆灵文逆天地之正气故也。 验认灵芝，有曰丹芝、碧芝、肉芝、紫芝、金芝、仙芝、草芝、兰芝、琼芝、果芝、绛芝、无风自摇芝，夜神光烛芝、太素含香芝、有洞天鹤鸣芝、灵芝、玉颗芝、云露清芝、碧琅白玕芝、五明九光芝、阳精素药芝、太一八风芝、锦纹紫茎芝、含光包翠芝、青丹素华芝。",
      "translated_text": "**The True Form Talisman of the Human Sovereign**\nThree *cun* in length, three *cun* in width.\n\n**Chapter Nine: The Divine Incantation of the Human Sovereign**\nThe nine *qi* intermingle in misty fusion; the jade incantation follows. Lofty and wondrous, the celestial prison—supreme among the ten poles, divine sovereign of the Great Void, great lords of the eight heavens, Wood Father and Metal Mother, the supreme and mysterious perfected—each descends true *qi* to expel and annihilate the traces of evil.\n\nThe Vermilion Emperor of the South rides clouds upon a fire dragon.\nThe White Emperor of the West swiftly severs demonic miasma.\nThe Black Emperor of the North shines with rosy dawn’s divine radiance.\nThe Azure Emperor of the East commands the phoenix’s mighty cry.\n\nThe nine heavens’ nine spirits, the celestial soldiers of the Ghost Gate, the jade maidens of the direct talismans, the unbridled might of Tai Sui, the officers and soldiers of the Five Peaks, the celestial scholars of the capital bureau, the eight-eyed divine youths, the Northern Dipper’s stalwart pivot, the four-eyed elder *Xi*, the great slayer who devours demons, the forty stalwart warriors, the Six Ding and Six Jia—enter within my seal.\n\n*Swiftly, swiftly, in accordance with the statutes and ordinances, obey and seize!*\n\n**Chapter Ten: The Method of Knowing Life and Death and the Five Illusory Petitions**\n**The Method of Knowing Death:**\nJoin palms but extend the fourth finger; when it opens, King Yama will surely know.\n\nThe formula states: On the seventh, seventeenth, and twenty-seventh days of each month—three times monthly—one may know the omens of life and death for ten days. Face east at sunrise, recite the Human Sovereign’s incantation once, and draw in three mouthfuls of the sun’s crystalline *qi*, swallowing them into the abdomen. Then sit upright facing east, aligning the celestial origin with the earthly essentials, and extend the fourth finger. If it does not open, this is an omen that the myriad spirits are intact and death has not come. If it suddenly opens, this signifies that heaven and humanity cannot save, the spirit and *qi* have departed the body—an omen of death. To determine the day of death, fix it according to the Five Phases’ day. If the day is Metal, death will come on the third day after the omen. For Wood, the fourth day; for Water, the fifth; for Earth, the seventh; for Fire, the ninth. Once the ghostly emissaries come to pursue, and the day of death is known, employ the Five Illusory Arts to feign life.\n\nThe Five Illusory Methods avert calamities from heavenly tribulations above and the exhaustion of great destiny below. If faced with the tribulation of heavenly waters—where the heavens tilt and the depths overflow, rivers and seas swell to emptiness, floods surge and spread, mountains and peaks vanish, the watery wheel revolves in all four directions, and yin essence emerges—leaving the world with no place to stand and the heavens with no void, vast and desolate, devoid of all people—one may use this method to feign and enter water without perceiving it. If one knows the tribulation of heaven and earth’s wind and fire—where flames congeal the void, raging flames race through the vast expanse, the empty and dark sea burns, mountains are blown away, the dark heavens above and the dark earth below vanish, and all the myriad existences turn to ash—one may use this method to feign and enter as if in tranquil meditation. If all is war, with battles raging on all sides, lands annexed, corpses piled like mountains, and blood flowing like seas, one may use this method to feign so that ordinary people cannot see one’s form, and one may wander the clouds unobstructed. If faced with the peril of the three limits, the calamity of emptiness and doom, the convergence of great and minor destinies, the mutual devouring of fetal fortune and official salary, or a fate that meets death, one may use this method to feign so that creation cannot alter it, yin and yang cannot shift it, ghosts and spirits cannot know it—and one may live to one hundred twenty years, becoming a person of long life.\n\n**Wei Furén of the Southern Peak** continued: The vulgar of the dusty world, the unlearned, though they revere the Dao with sincere hearts and enter the famous mountains, do not recognize the numinous fungus when they encounter it and have no method when facing tigers and leopards. How is this different from throwing oneself into a place of death? Many who initially sought long life have instead met untimely demise. I pity these people and once petitioned the Celestial Emperor, who bestowed this scripture upon me. With the Five Talismans and True Registers, one may execute evil and behead monsters, restrain tigers and wolves, cause the myriad demons to hide their traces, and the hundred ghosts to flee their forms—enabling all who cultivate the true to attain the Dao of non-action. Naturally, the mountain forests are pure and still, the numinous fungus blooms with dew, gold and jade emerge, and refined *qi* suffuses the air. Some may consume the fungus and wear coarse cloth, dwell in truth and savor the Dao, refining the spirit to irrigate the human and divine—how could this not be peace?\n\n**The Five Talismans’ True Texts:**\nChoose the terrain when dwelling in the mountains. Mountains have nobility and baseness; *qi* has life and death. When desiring to reside, one must select the terrain. Where great mountains form, small mountains are noble; where small mountains form, great mountains are noble. Where rocky mountains form, earthen mountains are noble; where earthen mountains form, rocky mountains are noble. Among such mountains—great or small, earthen or rocky—those with many mountains paying homage are noble. Selecting such noble mountains, where the five fortunes of vital *qi* converge, one may dwell in secluded grottoes and abodes, nestle in cliffs and peaks, or thatch a hut and befriend cranes and deer. Those who reside here long may practice the arts of harmonious nurturing and attain long life. Why? Because their yang essence is robust and refined *qi* suffuses them.\n\n**Discerning Grotto Abodes:**\nWhat are called *grottoes*, *abodes*, *caverns*, *caves*, and *hollows*? Mountains facing east are called *grottoes*; those facing south, *abodes*; those facing southeast, *cliffs*; those facing southwest, *caverns*; those facing north, *hollows*; and those facing northeast, *pitfalls*. Those who dwell in grottoes, abodes, cliffs, and caverns naturally receive the descent and protection of lofty perfected immortals, transcendent scholars, and reclusive gentlemen, thereby attaining the mysterious and wondrous. Those who dwell in hollows and pitfalls will be pressed and violated by poisonous insects, fierce beasts, old demons, and mountain spirits—because these places all reverse the proper *qi* of heaven and earth.\n\n**Verifying and Recognizing the Numinous Fungus:**\nThere are the cinnabar fungus, azure fungus, flesh fungus, purple fungus, golden fungus, immortal fungus, herbaceous fungus, orchid fungus, jade fungus, fruit fungus, crimson fungus, the fungus that sways without wind, the fungus that shines with divine light at night, the pristine and fragrant fungus, the fungus where grotto heavens and cranes cry, the numinous fungus, the jade-grain fungus, the cloud-dew pure fungus, the azure-jade white-stemmed fungus, the five-brightness nine-radiance fungus, the yang essence pristine medicine fungus, the Great One’s eight-wind fungus, the brocade-patterned purple-stemmed fungus, the light-containing jade-green fungus, and the azure cinnabar pristine blossom fungus.",
      "overlap_context": "lestial Origin, the union of celestial mechanisms, the wondrous operation of the utmost truth’s great pivot—the ancestral method for commanding spirits and ghosts, the key to subduing demons and heresies. Struck by this seal’s power, one can conceal form and disperse shadow, hide *qi* and gather spirit, causing yin and yang to transform the body sixfold, rendering it invisible to humans and ghosts alike.\n\n**Illustration of the Human Sovereign’s Seal**\nThree *cun* in length, three *cun* in width.",
      "start_char": 17708,
      "end_char": 19018,
      "start_sentence": 627,
      "end_sentence": 666,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.530107259750366,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太清金阙玉华仙书八极神章三皇内秘文.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "右芝草，略有二十四品，每获一品，食之者寿可千岁。 五符真形 东方木德岁星君所主青帝符 南方火德荧惑星君所主赤帝符 西方金德太白星君所主白帝符 北方水德辰星君所主黑帝符 中央土德镇星真君所主黄帝符 五符神咒 青帝咒曰：火令童子天皇摄急急如律令。 赤帝咒曰：吻皇星斗太初摄急急如律令。 白帝咒曰：白衣四神太虚摄急急如律令。 黑帝咒曰：五星守斗五帝摄急急如律令。 黄帝咒曰：龙耀天蓬黑杀摄急急如律令。 察辩邪正，凡居庵，或居山、或居洞，须要辩察邪正也。 其法於庵中备矣，或便得升举者。 凡欲采芝，当以三月之际，山开之月，灵芝出现之时，以五符法披之，自然可获。 每直日凤章龙篆，而寻求之，乃可得矣。 凡芝在处，定有异兆，但见白昼五云覆郁，夜有霞光弥绕，或有气象高下千百尺，状若蛇者是也。 此符搏戏必胜以纸随广狭依前法书定足下男左女右大验也 此符太上老君入山朱书素纸上横行天下无咎 此符真人带之一年入山精不敢傍百鬼莫能摄也 木解符以甲乙日朱书此符纸上烧服之正东手被如死一日起去乘其巾帻於外处即以竹代身已远去他乡勿得回虑也 五假化形图 金假法亡形符",
      "translated_text": "The above twenty-four varieties of *lingzhi* fungi—each time one obtains a single specimen and consumes it, the partaker may attain a lifespan of a thousand years.\n\n**Five Talismans of True Form**\n- The Azure Emperor’s Talisman, governed by the Wood Virtue and the Year Star Lord of the East\n- The Vermilion Emperor’s Talisman, governed by the Fire Virtue and the Sparkling Deluder Star Lord of the South\n- The White Emperor’s Talisman, governed by the Metal Virtue and the Grand White Star Lord of the West\n- The Black Emperor’s Talisman, governed by the Water Virtue and the Chronographic Star Lord of the North\n- The Yellow Emperor’s Talisman, governed by the Earth Virtue and the Quelling Star Perfected Lord of the Center\n\n**Five Divine Incantations**\n- The Azure Emperor’s Incantation: *\"By the Fire Mandate, the Celestial Lad and Heavenly Sovereign seize—hasten, hasten, as in the statutes and ordinances!\"*\n- The Vermilion Emperor’s Incantation: *\"By the Starry Maw of the Celestial Dipper and the Great Primordial, seize—hasten, hasten, as in the statutes and ordinances!\"*\n- The White Emperor’s Incantation: *\"By the White-Clad Four Spirits and the Great Void, seize—hasten, hasten, as in the statutes and ordinances!\"*\n- The Black Emperor’s Incantation: *\"By the Five Stars guarding the Dipper and the Five Emperors, seize—hasten, hasten, as in the statutes and ordinances!\"*\n- The Yellow Emperor’s Incantation: *\"By the Dragon’s Radiance, Heavenly Peng, and Black Slayer, seize—hasten, hasten, as in the statutes and ordinances!\"*\n\n**Discerning the Upright and the Perverse**\nWhenever dwelling in a hut, a mountain, or a grotto, one must discern the upright from the perverse. The method is already prepared within the hut—some may thereby ascend and be uplifted.\n\n**Gathering the Fungus**\nWhen gathering *lingzhi*, one should do so during the third month, the time when mountains open and the numinous fungus appears. Deploy the Five Talismans to unveil it, and it may naturally be obtained. Seek it on the proper day, with phoenix scripts and dragon seal-characters, and it may be found.\n\n**Auspicious Omens of the Fungus**\nWherever the fungus resides, there are sure to be extraordinary signs: by day, five-colored clouds densely cover the area; by night, rosy light suffuses and coils around it. Or one may see qi phenomena rising and falling hundreds or thousands of feet high, resembling serpents.\n\n**Talisman for Certain Victory in Games of Skill**\nDraw this talisman on paper according to the required dimensions, following the prescribed method. Place it beneath the left foot for men, the right for women—great efficacy will ensue.\n\n**Talisman of the Most High Lord Lao for Entering Mountains**\nInscribe this in cinnabar on plain paper, writing horizontally. Carry it when traveling through the world, and no misfortune shall befall you.\n\n**Talisman of the Perfected for Protection Against Mountain Spirits**\nWear this for a year when entering mountains, and mountain spirits will not dare approach, nor will the hundred ghosts be able to seize you.\n\n**Wood-Dissolving Talisman**\nOn a *jiǎ* or *yǐ* day (first or second of the ten Heavenly Stems), inscribe this talisman in cinnabar on paper and burn it to ingest. Face east, and if the affliction is as severe as death, it will depart after one day. Take the patient’s headscarf or turban and place it outside, substituting a bamboo effigy in their stead. The person will have already fled far away to another land—do not turn back or harbor concerns.\n\n**Five Methods of Transforming Form**\n- **Metal Method of Vanishing Form Talisman**",
      "overlap_context": " wind, the fungus that shines with divine light at night, the pristine and fragrant fungus, the fungus where grotto heavens and cranes cry, the numinous fungus, the jade-grain fungus, the cloud-dew pure fungus, the azure-jade white-stemmed fungus, the five-brightness nine-radiance fungus, the yang essence pristine medicine fungus, the Great One’s eight-wind fungus, the brocade-patterned purple-stemmed fungus, the light-containing jade-green fungus, and the azure cinnabar pristine blossom fungus.",
      "start_char": 19019,
      "end_char": 19524,
      "start_sentence": 667,
      "end_sentence": 690,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.349541425704956,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太清金阙玉华仙书八极神章三皇内秘文.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 17,
      "original_text": "人皇君曰：金命人依此图，吞隐形符在腹，着衣归，戴隐形帽，依罡步所为三次，而不死也。 木假法亡形符 人皇君曰：木命人吞符，达地祇神藏造化中，鬼神自不见其形也。 水假法亡形符 人皇君曰：水命人吞此符，依罡步入方位神藏造化中，鬼神自不见其 形也。 火假法亡形符 人皇君曰：火命人吞此符，依罡步入方位神藏造化中，鬼神自不见其形也。 土假法亡形符 人皇君曰：土命人依罡步，吞此符，入方位神藏造化中，鬼神自不见其形也。 太清金阙玉华仙书八极神章三皇内秘文卷下竟",
      "translated_text": "**Lord Renhuang says:** Those of the Metal destiny, following this diagram, shall swallow the Vanishing Form Talisman and carry it within the abdomen. Donning the Concealing Garment and the Invisibility Cap, they shall tread the *gang* steps thrice in accordance with their purpose—thus shall they not perish.\n\n**Wood Method of Vanishing Form Talisman**\n**Lord Renhuang says:** Those of the Wood destiny, having swallowed the talisman, shall be concealed within the transformations of the Earth Deity, where ghosts and spirits shall naturally fail to perceive their form.\n\n**Water Method of Vanishing Form Talisman**\n**Lord Renhuang says:** Those of the Water destiny, having swallowed this talisman and tread the *gang* steps into the directional position, shall be concealed within the transformations of the spirits, where ghosts and spirits shall naturally fail to perceive their form.\n\n**Fire Method of Vanishing Form Talisman**\n**Lord Renhuang says:** Those of the Fire destiny, having swallowed this talisman and tread the *gang* steps into the directional position, shall be concealed within the transformations of the spirits, where ghosts and spirits shall naturally fail to perceive their form.\n\n**Earth Method of Vanishing Form Talisman**\n**Lord Renhuang says:** Those of the Earth destiny, having tread the *gang* steps and swallowed this talisman into the directional position, shall be concealed within the transformations of the spirits, where ghosts and spirits shall naturally fail to perceive their form.\n\nHere ends the *Lower Scroll of the Esoteric Writings of the Three Sovereigns: The Eight Poles Divine Chapters from the Jade Flower Immortal Writ of the Great Clarity’s Golden Portal*.",
      "overlap_context": "iǎ* or *yǐ* day (first or second of the ten Heavenly Stems), inscribe this talisman in cinnabar on paper and burn it to ingest. Face east, and if the affliction is as severe as death, it will depart after one day. Take the patient’s headscarf or turban and place it outside, substituting a bamboo effigy in their stead. The person will have already fled far away to another land—do not turn back or harbor concerns.\n\n**Five Methods of Transforming Form**\n- **Metal Method of Vanishing Form Talisman**",
      "start_char": 19524,
      "end_char": 19771,
      "start_sentence": 691,
      "end_sentence": 701,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.029569387435913,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太清金阙玉华仙书八极神章三皇内秘文.txt",
        "category": "方法类"
      }
    }
  ]
}