{
  "source_id": "太清玉司左院秘要上法",
  "source_file": "chunked_daozang\\太清玉司左院秘要上法.json",
  "total_chunks": 3,
  "total_original_chars": 2333,
  "total_translated_chars": 15495,
  "total_translation_time": 73.54077625274658,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\太清玉司左院秘要上法.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Supreme Esoteric Method of the Jade Bureau of the Left Court of the Great Clarity**\n\n**Scripture Title:** *The Supreme Esoteric Method of the Jade Bureau of the Left Court of the Great Clarity*\n**Original Attribution:** Compiled by Master Xiaying of Dongshan\n**Volume:** One\n**Source Text:** *Daoist Canon of the Zhengtong Era*, Orthodox Section\n\n---\n\n**The Supreme Esoteric Method of the Jade Bureau of the Left Court of the Great Clarity**\n*Compiled by Master Xiaying of Dongshan*\n\nThe method of the Jade Bureau of the Left Court of the Great Clarity takes the Central Yellow Lord of the Great Clarity, the Celestial Master of the Supreme Clarity—namely, the Most High Lord Lao—as its teaching master. It also corresponds to the brightest star among the Six Stars of Gouchen, known as the **Celestial August Emperor Yaopo Treasure Lord**.\n\nThe \"Jade Bureau\" refers to the bureau of the Jade Emperor of the Great Clarity. The division into left and right courts distinguishes the offices for male and female officials who receive the method. Its governance extends to the Palace of the Great Clarity and the Supreme Ultimate, overseeing worldly illnesses, water and fire, celestial disasters, human affairs, ghosts and spirits, the Three Primes, the Five Peaks and Four Waterways, the Eight Seas and Nine Provinces—nothing lies beyond its purview. Unlike other methods, it is the method of the immortals of the Great Clarity.\n\nIn ancient times, the Immortal Elder of the Great Clarity transmitted it to the Treasure Chastity of the Great Clarity. Treasure Chastity of the Great Clarity then bestowed it upon the Perfected Wang of Donghua, who, upon achieving the Dao and departing the world, became the Left Minister of the Supreme Ultimate. At that time, the method of the Jade Bureau of the Great Clarity was employed to protect the world and save the people.\n\nNow, this compilation of esoteric essentials is presented as a complete text, dispensing with oral instructions, to be transmitted to the descendants of the Wang clan, that they may serve as hereditary masters generation after generation, practicing the method of the Jade Bureau of the Great Clarity. They shall swear an oath to Heaven, seal the pact with cinnabar, and perpetuate the transmission of the method to assist in the transformation of the Dao, bringing blessings to the celestial and human descendants. Though ten thousand years pass and kalpas turn, should the world perish, the method shall endure. If greed, licentiousness, or unvirtuous conduct arise again, the method shall cease to be practiced.\n\nWhen transmitting the method of the Jade Bureau of the Great Clarity, one must select an auspicious day for fasting and purification, then prostrate and present a memorial. Address the realm of the Great Clarity, the Most High Lord Lao, and the August Emperor of the Golden Watchtower, stating the intent to receive the method. Perform two bows to the master as a memorial.\n\nNext, on a *jiazi* or *gengshen* day, or another auspicious day for cultivating the Dao, enter the chamber facing north and silently pay homage to the Nine Immortal Teaching Masters, the Central Yellow Lord of the Great Clarity. The Celestial Master of the Great Clarity, the Yellow Lord, resides within the Golden Palace of the Supreme Ultimate of the Great Clarity, its golden watchtower enclosing him. Within the human body, he dwells in the Mud-Pill Palace of the Cavern Chamber at midnight, in the left spleen at dawn, and in the lower cinnabar field at dusk. The Yellow Lord has distinct names in the Cavern Chamber, the spleen, and the cinnabar field, as recorded in the superior scriptures and methods.\n\nVisualize entering two inches between your brows, where within the golden palace and yellow watchtower, you behold the Yellow Lord wearing a golden hibiscus crown, his countenance like that of a newborn infant, clad in a yellow brocade robe adorned with dragon and tiger emblems. He sits amidst golden lungs and purple clouds, facing outward. The recipient of the method, now diminished to the size of a lotus seed, stands before the Yellow Lord, kowtowing and entreating to practice the Supreme Method of the Jade Bureau of the Great Clarity, commanding and restraining ghosts and spirits.\n\nNext, visualize the Yellow Lord personally bestowing a jade seal and sash. From between your brows, one thousand two hundred divine youths of the Great Clarity leap forth, arrayed around you at a distance, each clad in embroidered robes and golden armor, their jade axes bristling. Then visualize Tang Ju of the Upper Prime, Li Ju of the Middle Prime, Xu Kangcha of the Lower Prime, Tang Hong of the Upper Prime, Ge Yong of the Middle Prime, and Zhou Wu of the Lower Prime. Additionally, Generals Xu, Li, Yue, Li, Huang, and Wang emerge from your Three Departments, standing to your left and right in golden armor, swords in hand.\n\nNext, visualize the armies of the Great Clarity from the five directions—fifty thousand celestial soldiers and mounted officials—each clad in robes of their respective directional colors, emerging from your five viscera and arraying themselves in formation on all sides. Then visualize within the golden palace a purple cloud like incense smoke rising from the crown of your head, spreading to form a vast purple canopy filling heaven and earth. Above the clouds, the Yellow Lord manifests a nine-foot-tall form, golden in hue, with a beak-like nose, eyebrows five inches long, ears seven inches long, and three lines on his forehead running from top to bottom. His feet bear the Eight Trigrams. He sits upon a divine tortoise as his throne, within a hall of gold and jade, its steps of white silver, his robes woven of five-colored clouds. He wears a tiered crown and wields a sharp-edged sword. One hundred twenty yellow youths attend him; to his left are twelve azure dragons, to his right twenty-six white tigers. Before him stand four vermilion phoenixes, behind him seventy-two dark warriors. Twelve *qiongqi* beasts lead the procession, followed by thirty-six *pixie* spirits. Thunder and lightning surge within, boundless and radiant, as a million celestial soldiers in golden armor stand in solemn array.\n\nAt this moment, form the mudra of the Great Clarity—its root lies at the base of the middle finger. Visualize yourself as the Celestial Youth of the Great Clarity, wearing a crown that pierces the heavens, a jade pendant, a sword at your belt, a red brocade robe, and vermilion shoes. Prostrate and declare: *\"Your servant [Name], charged with the affairs of the Jade Bureau of the Left Court of the Great Clarity, humbly addresses [matter at hand]. If receiving the method, present a memorial here and proceed to the Yellow Lord. When inscribing talismans, suppressing demons, or summoning spirits, conclude each matter by visualizing the spirits returning to your body.\"*\n\nFrom midnight until dawn, the Yellow Lord resides in the Cavern Chamber; at noon and dusk, he dwells in their respective places. Enter the chamber free from defilement, without need for additional rituals. The above visualization is best performed daily, though it may also be done as needed. When lying down, align with the Celestial Dipper; when sitting or standing, constantly contemplate the Northern Dipper, with five-colored clouds covering your head and body.\n\n**Seal of the Teaching Master of the Great Clarity**\n**Seal of the Jade Bureau**\n\nCarve the Dipper beneath with jujube wood from a thunderbolt-struck tree, and offer sacrifices on the day of Gengshen. For matters addressed by talismans from the True and Sacred Writ of the Jade Bureau of the Great Clarity, invoke and pray thus:\n\nTo the Supreme Venerable Lord of the Golden Portals, Heavenly Emperor of the Great Clarity’s Immortal Realm; the Nine Immortals’ Teaching Master, the Central Yellow Lord and Great Clarity Immortal King; the Primordial Sovereign of Heaven; the Primordial Sovereign of Earth; the Primordial Sovereign of the Jade Emperor; the Perfected Lord of Heavenly Treasures; the Perfected Lord of the Great One; the Left Primordial Lord of the Great One; the Right Primordial Lord of the Great One; the Seven Primordial Lords of the Northern Dipper; the Divine Lord of Heavenly Commission; and the Heavenly Youth of the Great Clarity.\n\nTo the twelve hundred Divine Officers of the Great Clarity, the twelve hundred Immortal Youths of the Great Clarity, and all the true gods, generals, and names of the spirits within one’s body:\n\nAll memorials, petitions, and documents from the Left Bureau of the Jade Bureau shall first be presented to the Palace of Primordial Generation of the Great One. Urgently request the Earthly Thearchs and their attendants to expedite matters of governance, dispatching the appointed youths of the day for major affairs. Dispatch the Divine Officers, summoning the soldiers and cavalry of the Great Clarity’s Divine Officers and Youths, with twelve hundred as the standard complement. Assess the merit of the petitioner’s virtue and request the descent of an appropriate number to assist in executing the celestial laws. The handling of documents and dispatch of orders follow the protocols of worldly offices, with ranks and measures adjusted as circumstances require, contingent upon the petitioner’s conduct.\n\nUse the celestial script of the Perfected Ones of the Great Clarity.\n\n**Divine Officers of the Upper Bureau of the Great Clarity (1,200 in total)**\n**Names of the Divine Officers and Youths of the Jade Bureau of the Great Clarity**\n\n*Officer in Charge of the Law:* Divine Officer Zhang Jiming—black-complexioned, bearded, aged fifty-six.\n*Officer of Direct Service:* Divine Officer Meng Keyan—yellowish-white complexion, aged thirty-four.\n*Officer Assisting the Dao:* Divine Officer Li Guoping—white-complexioned with a slight mustache, aged forty-seven.\n*Officer of Talisman Enforcement:* Divine Officer Zhu Shideng—ruddy-complexioned with a mustache, aged forty-nine.\n*Officer of Seal Execution:* Divine Officer Huang Yanxian—purple-complexioned with a mustache and beard, aged fifty-one.\n*Officer of Investigation and Verification:* Divine Officer Zhao Boling—white-complexioned, aged twenty-one.\n*Officer of Pursuit and Inquiry:* Divine Officer Shang Congyi—yellowish-white complexioned with a mustache, aged thirty.\n*Officer of Confirmation:* Divine Officer Zhang Kangbi—slightly dark-complexioned, beardless, aged sixty-two.\n*Officer of Memorial Presentation:* Divine Officer Wang Ziming—greenish-complexioned with a mustache, aged thirty-eight.\n*Officer of Direct Judgment:* Divine Officer Chen Yanqing—white-complexioned, aged twenty-one.\nAll wear dark caps, vermilion robes, green shoes, and bear swords.\n\n**Youths of Direct Service of the Great Clarity**\nDeng Chongqing, Su Jinqing, Jia Daoqing, Xia Yuqing, Dong Yaoqing, Wang Zhengqing.\nAll wear double topknots, green robes, and vermilion shoes.\n\nWhen the master inscribes talismans, face north on the days of Gengshen or Jiazi, writing in cinnabar. Visualize as prescribed above, and when activating the talisman, recite the Life-Protecting Incantation, which may also be used universally with the Life-Protecting Incantation of the Heavenly Youth of the Supreme Great Clarity:\n\n*\"Heaven above gives me life, and I uphold my own words.\"*\n\nTo the recipient, declare: *\"You must act with utmost urgency, as decreed by law!\"*\n\nThe Life-Protecting Talisman of the Heavenly Youth is completed by combining the incantation with the talisman. Write with proper brush technique and ink.\n\nAll methods may be adapted or employed as circumstances demand.\n\nThe Twenty-Four Talismans of the Supreme Clarity\n\nThese twenty-four talismans may all be swallowed, worn, or employed for exorcism, suppression, summoning, and binding—specific applications are noted below. Place them as directed by the master’s instructions.\n\nWhenever inscribing talismans, first visualize one’s own spirit entering the Dipper’s mouth, then manifest the Seven Sovereigns of Heaven, Earth, the Jade Emperor, Heavenly Treasure, Grand Unity, Left Origin, and Right Origin, standing as a subject before the lord. Grind cinnabar and ink without counting, grasp the brush, and silently recite the incantation:\n\n*\"Seven Sovereigns, aid my brush to drive away evil and save the myriad spirits!\"*\n*\"Hasten, hasten, as decreed by law!\"*\n\nOnly then set brush to paper.\n\n**Talisman of the Supreme Clarity’s Lord, the Yellow Elder Lord**\nPress the middle joint of the middle finger while visualizing. The spirit is the Heavenly Youth of the Supreme Clarity, with the Yellow Elder seated above the head. Hold the breath, focus the mind, and inscribe in a single stroke.\n\nBy command of the Supreme Clarity’s Jade Bureau, the celestial soldiers, mounted officers, numinous officials, and spirit youths—hasten to transmit and bind the qi of illness! The eight evils of the five directions, seize and deliver to Heaven! The Big Dipper’s power subdues the earth spirits.\n\nLet the great gods of the Five Roads capture and bind the lawless dead, the mountain specters of the Five Yous, the descendants of Xiao Wenzhe—fifteen kinds of demonic thieves—cut off their heads, sever their feet, and cast them into the prison of restraint, never to move recklessly again.\n\n*\"Slay, slay, slay!\"* By the seal of command.\nSealed by the Seven Origins’ Celestial Big Dipper qi.\n\n**Gathering Form**\nThe Twenty-Four Brush Techniques of the Great Dharma Master of the Three Heavens, Orthodox Unity Perfected Person, inscribed in secret script on stone within the Ghost City Grotto of Mount Qingcheng.\n\nAll twenty-four talismans above are to be completed in a single stroke, prizing likeness to their forms. As for the brush’s descent—whether reversing, following, coiling, or bending—adjust up and down, giving and taking, as intention dictates. Observe the speed, weight, and momentum to capture the essence, naming and employing them accordingly.\n\nFor example, in the *Sun Crow’s Pecking* technique, visualize one’s hand and brush as the Sun God descending to peck and slay demonic entities. For *Sharp Blade Dispelling Evil*, envision wielding a sword to slash—brush must move swiftly to embody this force.\n\n**Talisman of the Heavenly Commissioner’s Divine Generals for Curing Myriad Evils**\nFour talismans transmitted by Master Xuan of the Eastern Florescence King Perfected Person.\nAll above are universally applicable for curing illness and dispelling evil.\n\n**Hand Seals for Talisman Script**\nPress the second finger with the thumb, then the fourth finger, using the thumb to draw qi while pressing the middle joint of the fourth finger.\n\n**Hand Seal for Treating People**\nPress the second finger against the upper line of the thumb.\n\n**Hand Seal for Treating Ghosts**\nPress the second finger against the lower line of the thumb.\n\n**Oral Formula of the Supreme Clarity Perfected Person**\nConstantly visualize the true form of the Yellow Elder Lord, swallow the purple qi from his mouth a hundred times—then ghosts and spirits will fear and submit.\n\nOne who knows the Yellow Elder’s inner taboo name may be appointed as a Grand Master of the Great Ultimate, a minister or high official.\n\nWhen inscribing talismans, draw the true qi of the Yellow Elder, combine it with the Big Dipper’s power, and absorb the red light of the Northern Dipper—then commands and restraints will be as effective as before.\n\nHere concludes the secret essential methods of the Supreme Clarity’s Left Academy.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太清玉司左院秘要上法 经名：太清玉司左院秘要上法。 原题洞山真人霞映撰次。 一卷。 底本出处：《正统道藏》正部。 太清玉司左院秘要上法 洞山真人霞映撰次 太清玉司左院法，以中央黄老君太清仙主为教主，即太上老君也。 又为勾陈六星中，一星最明者，号曰： 天皇大帝曜魄宝君。 其玉司者，谓太清玉帝之司也。 有左右院者，盖受法男女官之别局也。 治在太清太极宫，以主世间疾病、水火、天灾、人事、鬼神、三元，五岳四渎，八海九州，无不关预者。 与他法不同，以太清仙官之法故也。 昔太清仙伯，授之於太清宝贞。 太清宝贞，以授东华王真人，道成去世，当为太极左卿。 时以太清玉司之法，护世救民。 今撰次秘要，以为完书，不烦口诀，以授王氏子孙，使世世为嗣师，以行太清玉司之法。 指天为誓，歃丹为盟，继世嗣法，以佐道化，福及天人子孙。 万年劫换，世灭其法，再出贪淫不善，法当不行。 授太清玉司法，占日斋戒预拜表。 太清仙境，太上老君，金阙天皇大帝，陈授法之意。 礼师二为表。 次以甲子庚申，或修道吉日，入室北向，默朝九仙教主中央黄老君。 太清仙主黄老，居太清太极金宫黄阙之裹，下在人身，以夜半居泥丸洞房中，食时左脾中，哺在下丹中。 黄老君在洞房、脾中、丹田，各有名字，在上经法中。 思我眉间入二寸，有金宫黄阙中，见黄老君戴金芙蓉冠，貌如婴儿始生之形，着黄锦玉衣，龙虎之章，坐金肺紫云中，面向外。 存授法者，已形小如莲实，在黄老前，叩请行持太清玉司上法，禁勑鬼神。 次存黄老君亲赐玉印绶，见太清灵官童子，各一千二百人，赫然自眉间跃出，在己左右围远，各绣衣金甲，玉斧森列。 次存上元唐矩，中元李拒，下元徐康叉，上元唐宏，中元葛雍，下元周武。 又徐李乐，又李黄王将军，从己三部出，列在左右，金甲仗剑。 次存五方太清，仙兵骑吏五万人，各服方色衣，从己五脏中出，阵列四向。 次存金宫中，有紫云如香烟出己顶上，布成紫云，遍满天地。 云上见黄老君，化身长九尺，黄色，鸟喙隆鼻，眉长五寸，耳长七寸，额有三理上下彻，足有八卦。 次神龟为床，金楼玉堂，白银为阶，五色云为衣，重垒之冠，锋鋋之剑，从黄童一百二十人，左有十二青龙，右有二十六白虎，前有四朱雀，后有七十二玄武。 前导十二穷奇从，后三十六辟邪。 雷电在其中，晃晃无极，拥天兵百万，金容俨坐。 即搯太清诀，中指根是也，存身为太清天童君，戴通天冠，玉佩带剑，红锦衣朱履，启曰：行太清玉司左院事臣某，伏为某事，若授法即於此拜一表，诣黄老君。 若篆符禁邪考召，随事毕，各存神归身中。 夜半至早时，黄老君在洞房，午时及哺，各随其处。 净秽入室，更不别立法式。 已上存思，日能为之佳。 或遇事为之，亦可。 仍卧随天罡，坐立常思北斗，头身五云为覆。 太清教主印 玉司院印",
      "translated_text": "**The Supreme Esoteric Method of the Jade Bureau of the Left Court of the Great Clarity**\n\n**Scripture Title:** *The Supreme Esoteric Method of the Jade Bureau of the Left Court of the Great Clarity*\n**Original Attribution:** Compiled by Master Xiaying of Dongshan\n**Volume:** One\n**Source Text:** *Daoist Canon of the Zhengtong Era*, Orthodox Section\n\n---\n\n**The Supreme Esoteric Method of the Jade Bureau of the Left Court of the Great Clarity**\n*Compiled by Master Xiaying of Dongshan*\n\nThe method of the Jade Bureau of the Left Court of the Great Clarity takes the Central Yellow Lord of the Great Clarity, the Celestial Master of the Supreme Clarity—namely, the Most High Lord Lao—as its teaching master. It also corresponds to the brightest star among the Six Stars of Gouchen, known as the **Celestial August Emperor Yaopo Treasure Lord**.\n\nThe \"Jade Bureau\" refers to the bureau of the Jade Emperor of the Great Clarity. The division into left and right courts distinguishes the offices for male and female officials who receive the method. Its governance extends to the Palace of the Great Clarity and the Supreme Ultimate, overseeing worldly illnesses, water and fire, celestial disasters, human affairs, ghosts and spirits, the Three Primes, the Five Peaks and Four Waterways, the Eight Seas and Nine Provinces—nothing lies beyond its purview. Unlike other methods, it is the method of the immortals of the Great Clarity.\n\nIn ancient times, the Immortal Elder of the Great Clarity transmitted it to the Treasure Chastity of the Great Clarity. Treasure Chastity of the Great Clarity then bestowed it upon the Perfected Wang of Donghua, who, upon achieving the Dao and departing the world, became the Left Minister of the Supreme Ultimate. At that time, the method of the Jade Bureau of the Great Clarity was employed to protect the world and save the people.\n\nNow, this compilation of esoteric essentials is presented as a complete text, dispensing with oral instructions, to be transmitted to the descendants of the Wang clan, that they may serve as hereditary masters generation after generation, practicing the method of the Jade Bureau of the Great Clarity. They shall swear an oath to Heaven, seal the pact with cinnabar, and perpetuate the transmission of the method to assist in the transformation of the Dao, bringing blessings to the celestial and human descendants. Though ten thousand years pass and kalpas turn, should the world perish, the method shall endure. If greed, licentiousness, or unvirtuous conduct arise again, the method shall cease to be practiced.\n\nWhen transmitting the method of the Jade Bureau of the Great Clarity, one must select an auspicious day for fasting and purification, then prostrate and present a memorial. Address the realm of the Great Clarity, the Most High Lord Lao, and the August Emperor of the Golden Watchtower, stating the intent to receive the method. Perform two bows to the master as a memorial.\n\nNext, on a *jiazi* or *gengshen* day, or another auspicious day for cultivating the Dao, enter the chamber facing north and silently pay homage to the Nine Immortal Teaching Masters, the Central Yellow Lord of the Great Clarity. The Celestial Master of the Great Clarity, the Yellow Lord, resides within the Golden Palace of the Supreme Ultimate of the Great Clarity, its golden watchtower enclosing him. Within the human body, he dwells in the Mud-Pill Palace of the Cavern Chamber at midnight, in the left spleen at dawn, and in the lower cinnabar field at dusk. The Yellow Lord has distinct names in the Cavern Chamber, the spleen, and the cinnabar field, as recorded in the superior scriptures and methods.\n\nVisualize entering two inches between your brows, where within the golden palace and yellow watchtower, you behold the Yellow Lord wearing a golden hibiscus crown, his countenance like that of a newborn infant, clad in a yellow brocade robe adorned with dragon and tiger emblems. He sits amidst golden lungs and purple clouds, facing outward. The recipient of the method, now diminished to the size of a lotus seed, stands before the Yellow Lord, kowtowing and entreating to practice the Supreme Method of the Jade Bureau of the Great Clarity, commanding and restraining ghosts and spirits.\n\nNext, visualize the Yellow Lord personally bestowing a jade seal and sash. From between your brows, one thousand two hundred divine youths of the Great Clarity leap forth, arrayed around you at a distance, each clad in embroidered robes and golden armor, their jade axes bristling. Then visualize Tang Ju of the Upper Prime, Li Ju of the Middle Prime, Xu Kangcha of the Lower Prime, Tang Hong of the Upper Prime, Ge Yong of the Middle Prime, and Zhou Wu of the Lower Prime. Additionally, Generals Xu, Li, Yue, Li, Huang, and Wang emerge from your Three Departments, standing to your left and right in golden armor, swords in hand.\n\nNext, visualize the armies of the Great Clarity from the five directions—fifty thousand celestial soldiers and mounted officials—each clad in robes of their respective directional colors, emerging from your five viscera and arraying themselves in formation on all sides. Then visualize within the golden palace a purple cloud like incense smoke rising from the crown of your head, spreading to form a vast purple canopy filling heaven and earth. Above the clouds, the Yellow Lord manifests a nine-foot-tall form, golden in hue, with a beak-like nose, eyebrows five inches long, ears seven inches long, and three lines on his forehead running from top to bottom. His feet bear the Eight Trigrams. He sits upon a divine tortoise as his throne, within a hall of gold and jade, its steps of white silver, his robes woven of five-colored clouds. He wears a tiered crown and wields a sharp-edged sword. One hundred twenty yellow youths attend him; to his left are twelve azure dragons, to his right twenty-six white tigers. Before him stand four vermilion phoenixes, behind him seventy-two dark warriors. Twelve *qiongqi* beasts lead the procession, followed by thirty-six *pixie* spirits. Thunder and lightning surge within, boundless and radiant, as a million celestial soldiers in golden armor stand in solemn array.\n\nAt this moment, form the mudra of the Great Clarity—its root lies at the base of the middle finger. Visualize yourself as the Celestial Youth of the Great Clarity, wearing a crown that pierces the heavens, a jade pendant, a sword at your belt, a red brocade robe, and vermilion shoes. Prostrate and declare: *\"Your servant [Name], charged with the affairs of the Jade Bureau of the Left Court of the Great Clarity, humbly addresses [matter at hand]. If receiving the method, present a memorial here and proceed to the Yellow Lord. When inscribing talismans, suppressing demons, or summoning spirits, conclude each matter by visualizing the spirits returning to your body.\"*\n\nFrom midnight until dawn, the Yellow Lord resides in the Cavern Chamber; at noon and dusk, he dwells in their respective places. Enter the chamber free from defilement, without need for additional rituals. The above visualization is best performed daily, though it may also be done as needed. When lying down, align with the Celestial Dipper; when sitting or standing, constantly contemplate the Northern Dipper, with five-colored clouds covering your head and body.\n\n**Seal of the Teaching Master of the Great Clarity**\n**Seal of the Jade Bureau**",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1118,
      "start_sentence": 0,
      "end_sentence": 45,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.99510645866394,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太清玉司左院秘要上法.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "以霹雳枣心刻斗下，庚申日祭之。 太清玉司真圣书符治事，启祝： 太清仙境太上老君金阙天皇大帝，九仙教主中央黄老君太清仙王，天皇元看，地皇元君，玉皇元君，天宝真君，太一真君，太一左元君，太一右元君，北斗七元君，天委神君，太清天童君。 太清灵官千二百人，太清仙童一千二百人，及存见身中真神将军名号等。 其玉司左院奏状章表，并先以状开太一元生府。 请速进御地祇主者文事，书差直日童子若干大事。 遣灵官，请太清兵马灵官童子，每以千二百人为额。 自量功德表，请人数下降，助行天法。 文字行遣，如世有司，高下随宜，在人为。 用太清真人天书。 太清上院千二百灵官 太清玉司灵官童子姓名 掌法灵官张继明，面黑有髯，年五十六。 直事灵官孟可言，面黄白，年三十四。 助道灵官李国平，面白微髭，年四十七。 勑符灵官朱士登，面朱有髭，年四十九。 行印灵官黄彦先，面紫髭胡，年五十一。 考按灵官赵伯灵，面白，年二十一。 追问灵官尚从一，面黄白有髭，年三十。 对定灵官张康弼，面微黑无髭，年六十二。 上奏灵官王子明，面青有髭，年三十八。 直狱灵官陈彦卿，面白，年二十一。 并玄冠朱衣青履仗剑 太清直事童子 邓冲卿、苏进卿、贾道卿、夏禹卿、董耀卿、王正卿。 并双髻，青衣，朱履。 法师书符，庚申甲子北向以丹书之，存思如上法，及常持护命咒发符，并通用太上太清天童护命咒：皇天生我，自持言我。 治人曰：汝至急急如律令。 天童护命符，合咒成符。 笔法墨书 尽为法更随事劫用",
      "translated_text": "Carve the Dipper beneath with jujube wood from a thunderbolt-struck tree, and offer sacrifices on the day of Gengshen. For matters addressed by talismans from the True and Sacred Writ of the Jade Bureau of the Great Clarity, invoke and pray thus:\n\nTo the Supreme Venerable Lord of the Golden Portals, Heavenly Emperor of the Great Clarity’s Immortal Realm; the Nine Immortals’ Teaching Master, the Central Yellow Lord and Great Clarity Immortal King; the Primordial Sovereign of Heaven; the Primordial Sovereign of Earth; the Primordial Sovereign of the Jade Emperor; the Perfected Lord of Heavenly Treasures; the Perfected Lord of the Great One; the Left Primordial Lord of the Great One; the Right Primordial Lord of the Great One; the Seven Primordial Lords of the Northern Dipper; the Divine Lord of Heavenly Commission; and the Heavenly Youth of the Great Clarity.\n\nTo the twelve hundred Divine Officers of the Great Clarity, the twelve hundred Immortal Youths of the Great Clarity, and all the true gods, generals, and names of the spirits within one’s body:\n\nAll memorials, petitions, and documents from the Left Bureau of the Jade Bureau shall first be presented to the Palace of Primordial Generation of the Great One. Urgently request the Earthly Thearchs and their attendants to expedite matters of governance, dispatching the appointed youths of the day for major affairs. Dispatch the Divine Officers, summoning the soldiers and cavalry of the Great Clarity’s Divine Officers and Youths, with twelve hundred as the standard complement. Assess the merit of the petitioner’s virtue and request the descent of an appropriate number to assist in executing the celestial laws. The handling of documents and dispatch of orders follow the protocols of worldly offices, with ranks and measures adjusted as circumstances require, contingent upon the petitioner’s conduct.\n\nUse the celestial script of the Perfected Ones of the Great Clarity.\n\n**Divine Officers of the Upper Bureau of the Great Clarity (1,200 in total)**\n**Names of the Divine Officers and Youths of the Jade Bureau of the Great Clarity**\n\n*Officer in Charge of the Law:* Divine Officer Zhang Jiming—black-complexioned, bearded, aged fifty-six.\n*Officer of Direct Service:* Divine Officer Meng Keyan—yellowish-white complexion, aged thirty-four.\n*Officer Assisting the Dao:* Divine Officer Li Guoping—white-complexioned with a slight mustache, aged forty-seven.\n*Officer of Talisman Enforcement:* Divine Officer Zhu Shideng—ruddy-complexioned with a mustache, aged forty-nine.\n*Officer of Seal Execution:* Divine Officer Huang Yanxian—purple-complexioned with a mustache and beard, aged fifty-one.\n*Officer of Investigation and Verification:* Divine Officer Zhao Boling—white-complexioned, aged twenty-one.\n*Officer of Pursuit and Inquiry:* Divine Officer Shang Congyi—yellowish-white complexioned with a mustache, aged thirty.\n*Officer of Confirmation:* Divine Officer Zhang Kangbi—slightly dark-complexioned, beardless, aged sixty-two.\n*Officer of Memorial Presentation:* Divine Officer Wang Ziming—greenish-complexioned with a mustache, aged thirty-eight.\n*Officer of Direct Judgment:* Divine Officer Chen Yanqing—white-complexioned, aged twenty-one.\nAll wear dark caps, vermilion robes, green shoes, and bear swords.\n\n**Youths of Direct Service of the Great Clarity**\nDeng Chongqing, Su Jinqing, Jia Daoqing, Xia Yuqing, Dong Yaoqing, Wang Zhengqing.\nAll wear double topknots, green robes, and vermilion shoes.\n\nWhen the master inscribes talismans, face north on the days of Gengshen or Jiazi, writing in cinnabar. Visualize as prescribed above, and when activating the talisman, recite the Life-Protecting Incantation, which may also be used universally with the Life-Protecting Incantation of the Heavenly Youth of the Supreme Great Clarity:\n\n*\"Heaven above gives me life, and I uphold my own words.\"*\n\nTo the recipient, declare: *\"You must act with utmost urgency, as decreed by law!\"*\n\nThe Life-Protecting Talisman of the Heavenly Youth is completed by combining the incantation with the talisman. Write with proper brush technique and ink.\n\nAll methods may be adapted or employed as circumstances demand.",
      "overlap_context": "s in the Cavern Chamber; at noon and dusk, he dwells in their respective places. Enter the chamber free from defilement, without need for additional rituals. The above visualization is best performed daily, though it may also be done as needed. When lying down, align with the Celestial Dipper; when sitting or standing, constantly contemplate the Northern Dipper, with five-colored clouds covering your head and body.\n\n**Seal of the Teaching Master of the Great Clarity**\n**Seal of the Jade Bureau**",
      "start_char": 1118,
      "end_char": 1744,
      "start_sentence": 46,
      "end_sentence": 76,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.709800720214844,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太清玉司左院秘要上法.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "太清二十四符 右二十四符，皆可吞服佩带，禳镇考召，注事於下，安其所，随师指勑。 凡书符，先存己神入斗口，现天、地、玉皇、天宝、太一、左元、右元七无君，如臣对君，研朱墨无数，握笔默咒曰： 七元君，助笔驱邪救万灵。 急急如律令然后落笔。 太清道主黄老君符 掐中指中节存。 神为太清天童君，黄老在头上，闭气心念，一笔书之。 太清玉司勑，天兵骑吏，灵官灵童，急摄传注病气，五方八邪，收付天，罡制社。 令五道主者大神，收捉无道伤亡，五酉山魈，萧文觉子孙，断头落脚一十五种鬼贼，摄入禁狱，不得妄动。 煞煞煞勑印。 七元名天罡气封。 聚形 三天大法师正一真人，二十四势笔法，青城山鬼城洞刻石秘文。 已上二十四符，并一笔取成，贵其像似。 至於落笔，有逆顺蟠屈，上下，取与，以意求之。 看其迟疾轻重取势，名以用之。 如太阳乌啄势，则存我手及笔，为太阳神来啄杀鬼物也。 利刃挥邪，勋存剑挥剑斩之，须下笔奔速，令像此势。 天委神将符治万邪 东华王真人玄师师授四符 已上治病去邪通用。 篆符手诀 大指以第二指，搯第四指，用大指取气，搯四指中节。 治人手诀 第二指搯大指上文。 治鬼手诀 第二指搯大指下文。 太清真人口诀，常思黄老君真形，咽黄老口中紫气百数，则鬼神畏伏。 能知黄老内讳，射为太极公卿大夫之官矣。 篆符取黄老真气，并加天罡，吸北斗赤光，则勑制如向矣。 太清玉付左院秘要上法竟",
      "translated_text": "The Twenty-Four Talismans of the Supreme Clarity\n\nThese twenty-four talismans may all be swallowed, worn, or employed for exorcism, suppression, summoning, and binding—specific applications are noted below. Place them as directed by the master’s instructions.\n\nWhenever inscribing talismans, first visualize one’s own spirit entering the Dipper’s mouth, then manifest the Seven Sovereigns of Heaven, Earth, the Jade Emperor, Heavenly Treasure, Grand Unity, Left Origin, and Right Origin, standing as a subject before the lord. Grind cinnabar and ink without counting, grasp the brush, and silently recite the incantation:\n\n*\"Seven Sovereigns, aid my brush to drive away evil and save the myriad spirits!\"*\n*\"Hasten, hasten, as decreed by law!\"*\n\nOnly then set brush to paper.\n\n**Talisman of the Supreme Clarity’s Lord, the Yellow Elder Lord**\nPress the middle joint of the middle finger while visualizing. The spirit is the Heavenly Youth of the Supreme Clarity, with the Yellow Elder seated above the head. Hold the breath, focus the mind, and inscribe in a single stroke.\n\nBy command of the Supreme Clarity’s Jade Bureau, the celestial soldiers, mounted officers, numinous officials, and spirit youths—hasten to transmit and bind the qi of illness! The eight evils of the five directions, seize and deliver to Heaven! The Big Dipper’s power subdues the earth spirits.\n\nLet the great gods of the Five Roads capture and bind the lawless dead, the mountain specters of the Five Yous, the descendants of Xiao Wenzhe—fifteen kinds of demonic thieves—cut off their heads, sever their feet, and cast them into the prison of restraint, never to move recklessly again.\n\n*\"Slay, slay, slay!\"* By the seal of command.\nSealed by the Seven Origins’ Celestial Big Dipper qi.\n\n**Gathering Form**\nThe Twenty-Four Brush Techniques of the Great Dharma Master of the Three Heavens, Orthodox Unity Perfected Person, inscribed in secret script on stone within the Ghost City Grotto of Mount Qingcheng.\n\nAll twenty-four talismans above are to be completed in a single stroke, prizing likeness to their forms. As for the brush’s descent—whether reversing, following, coiling, or bending—adjust up and down, giving and taking, as intention dictates. Observe the speed, weight, and momentum to capture the essence, naming and employing them accordingly.\n\nFor example, in the *Sun Crow’s Pecking* technique, visualize one’s hand and brush as the Sun God descending to peck and slay demonic entities. For *Sharp Blade Dispelling Evil*, envision wielding a sword to slash—brush must move swiftly to embody this force.\n\n**Talisman of the Heavenly Commissioner’s Divine Generals for Curing Myriad Evils**\nFour talismans transmitted by Master Xuan of the Eastern Florescence King Perfected Person.\nAll above are universally applicable for curing illness and dispelling evil.\n\n**Hand Seals for Talisman Script**\nPress the second finger with the thumb, then the fourth finger, using the thumb to draw qi while pressing the middle joint of the fourth finger.\n\n**Hand Seal for Treating People**\nPress the second finger against the upper line of the thumb.\n\n**Hand Seal for Treating Ghosts**\nPress the second finger against the lower line of the thumb.\n\n**Oral Formula of the Supreme Clarity Perfected Person**\nConstantly visualize the true form of the Yellow Elder Lord, swallow the purple qi from his mouth a hundred times—then ghosts and spirits will fear and submit.\n\nOne who knows the Yellow Elder’s inner taboo name may be appointed as a Grand Master of the Great Ultimate, a minister or high official.\n\nWhen inscribing talismans, draw the true qi of the Yellow Elder, combine it with the Big Dipper’s power, and absorb the red light of the Northern Dipper—then commands and restraints will be as effective as before.\n\nHere concludes the secret essential methods of the Supreme Clarity’s Left Academy.",
      "overlap_context": "cantation, which may also be used universally with the Life-Protecting Incantation of the Heavenly Youth of the Supreme Great Clarity:\n\n*\"Heaven above gives me life, and I uphold my own words.\"*\n\nTo the recipient, declare: *\"You must act with utmost urgency, as decreed by law!\"*\n\nThe Life-Protecting Talisman of the Heavenly Youth is completed by combining the incantation with the talisman. Write with proper brush technique and ink.\n\nAll methods may be adapted or employed as circumstances demand.",
      "start_char": 1744,
      "end_char": 2355,
      "start_sentence": 77,
      "end_sentence": 108,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.835869073867798,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太清玉司左院秘要上法.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}