{
  "source_id": "太清服气口诀",
  "source_file": "chunked_daozang\\太清服气口诀.json",
  "total_chunks": 3,
  "total_original_chars": 2921,
  "total_translated_chars": 15975,
  "total_translation_time": 81.06643223762512,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\方法类\\太清服气口诀.txt",
    "category": "方法类"
  },
  "full_translation": "**The Supreme Clarity Oral Formula for Qi Absorption**\n\n**Text Title:** *Taiqing Fuqi* (*Absorbing Qi of the Supreme Clarity*)\n**Alternative Title:** *Shangqing Fuqi Koujue* (*Oral Formula for Absorbing Qi of the Highest Clarity*)\n**Author:** Anonymous\n**Volume:** One\n**Source:** *Daoist Canon of the Zhengtong Era*, *Methods* section of the *Dongshen* Department\n\nAll things in the world are born, receiving form and manifestation from yin and yang. Yin and yang bestow transformation, deriving from primordial qi to differentiate cold and heat. Thus, when the Great Yang arises, it bears the radiant glow that gives life to all beings; when the Great Yin stirs, it carries the somber qi that withers all sprouts. None escape the influence of qi in their birth and decay—this is the constant principle before the moon, known to the noble person.\n\nAs it is said: \"One who consumes primordial qi cannot be slain by Heaven nor concealed by Earth\"—how excellent! When primordial qi is exchanged between the kidneys and nose, and yin and yang are divided within the viscera, with exhalation and inhalation unerring and regulation unbroken, then the gateway to longevity may be attained.\n\nThe oral formula I record here is the method for absorbing primordial qi. Its many secrets are transmitted only by mouth, for they cannot be contained in brush and paper. Though I describe but a portion, it is the essential teaching of this school. All who are devoted to this practice must not lightly disclose it.\n\nWithin the human abdomen lie three barriers: the first is below the heart. Beginners in qi absorption always feel fullness below the heart in the stomach. Eat sparingly, and with prolonged practice, you will naturally sense the passage downward to the barrier below the viscera, where the abdomen feels full. With further practice, you will feel it reach the Cinnabar Field below the navel. Only then will you sense qi circulating throughout the body, though it has yet to enter the *jiu* (turtledove) center. Later, when qi emerges from the *jiu*, you will be able to heal others.\n\nWhen first learning, you must settle the body in a quiet place and proceed with care. Once qi enters the abdomen, you may practice while walking, standing, sitting, or lying down without hindrance. If the stomach’s qi has not descended, do not attempt other methods, for they will be difficult to master.\n\nAt the start of qi absorption, inhale and hold the breath briefly, as if closing it, until full. Upon exhalation, release only two-thirds of the breath, then hold again. After a short pause, swallow. Repeat until the abdomen is full, then rest. Practice this day and night at all four times, for beginners’ qi has not yet entered the Cinnabar Field and easily scatters. Continuous practice ensures the qi remains connected. Once qi enters the Cinnabar Field, even if you cease absorption, it will not disperse.\n\nThe four times are dawn, dusk, midnight, and noon. If the heart feels full, refrain from absorbing qi and chew a small amount of licorice or cinnamon to disperse the fullness. The Cinnabar Field will not yet be full, nor will it feel so. When primordial qi descends, a slight oppression arises naturally.\n\nWhen first absorbing qi, practice four times daily. At dawn and dusk, use both the supine and prone postures; at midnight and noon, use only the supine posture. For the supine posture, lie on a low pillow, face up, draw in the legs, and raise the knees. Place both hands at the sides, then swallow qi. After ten swallows, qi will fill the Cinnabar Field. Wait an hour after swallowing, then guide the qi with intention into the *jiu* center.\n\nFor the prone posture, lie with the abdomen flat, propping the chest with a blanket to elevate it. Extend the hands and feet, then swallow ten times. With each swallow, guide the qi with intention to descend along the spine and exit through the *shu* (heat) viscera. At dawn and dusk, practice first prone, then supine. Each swallow must produce a sound; without sound, the effort is in vain.\n\nWhen swallowing qi, do so slowly and deeply in the throat. Do not swallow forcefully, or coughing will result. Between each swallow, pause for ten breaths, or rest as needed at your leisure.\n\nDo not swallow qi mixed with saliva; swallow it dry. If saliva arises, swallow it separately. When swallowing saliva, use inhalation to prevent wind from entering deeply—proceed with care.\n\nAfter receiving the method for absorbing qi, recite the incantation to complete the transmission. In daily practice, incantations are unnecessary, but recite them each time when healing others.\n\nBeyond the four regular sessions, if at any time you feel a lack of strength in the abdomen, swallow qi as needed. Initially, absorbed qi often leaks downward from the *shu* viscera—consolidate it to prevent leakage, guiding it with intention to disperse.\n\nWhen first absorbing qi, the mind must be at ease, free of doubt and fear. Do not worry or hesitate, for fear obstructs the flow of qi. If the four limbs are harmonized, remain content in stillness, desiring nothing. Progress will be daily, and joy will be boundless.\n\nDo not think of food while absorbing qi; remain free of all thoughts. If thoughts of food arise, suppress them as if unconcerned. Without suppression, the mind will dwell on them. If thirsty, boil *bili* vine decoction with a small amount of fresh ginger, simmering it once or twice. Drink a bowl, and thirst will subside. Ginger-honey decoction also suffices. If you can restrain yourself, even facing fine delicacies all day will not stir desire.\n\nAbsorb qi without missing the proper times, keeping the Cinnabar Field always full. Even if you attend to daily affairs, it will not hinder practice. With long habit, even missing an hour or two will not matter.\n\nWhen swallowing qi, the supine posture expels water, and the prone posture expels food. The food viscera lies on the right, the water viscera on the left.\n\nWith prolonged practice, qi will naturally reach the *jiu* head. When swallowing qi in the prone posture, guide it with intention to descend along the spine, focusing on the abdomen near the spine. Listen for the sound to descend and exit through the *shu* viscera, directing it to the right.\n\nIf qi becomes full and oppressive, leaking downward uncontrollably, it is not a concern. Guide the qi to exit through the crown and the four limbs. With long practice, you will sense this naturally.\n\nIf you have not yet sensed it, simply rely on focused intention—that is sufficient. With prolonged practice of swallowing qi, you will attain the qi of the Cinnabar Field, and when you pat it, it will resound with a *peng-peng* sound. Even if the qi in the head has not yet filled, this is still achievable. If you wish for the head to be fully filled, simply take in more qi—this will suffice. As qi moves like a creeping insect, with time you will naturally sense it; there is no other method.\n\nSomeone asked: How can it resemble the sensation of eating? For beginners, it must be like this. With long practice, it will become the same as eating.\n\nAfter swallowing qi, circulate it throughout the body. Do not force it to exit; let it leave naturally, as when one goes about their affairs. If your strength wanes, swallow qi again—there is no need to wait for a set time.\n\nVisualize internally until the intestines are empty. Close your eyes and inwardly observe, and you will see the waste in your intestines—it is extremely difficult to empty completely. Even after fasting for over twenty days, it will only just be gone. When first fasting for fourteen days, you must eat one or two meals of cooked vegetables daily to expel old waste. At each meal, you may eat a bowl of alfalfa mustard greens or turnip greens without issue. Boil away the bitter juice, add a little oil and ghee, and season lightly with salt, soy sauce, or vinegar to give it flavor. Do not add rice or grains, as the goal is to purge the intestines of grain qi. After eating vegetables for four or five days, then stop eating the vegetables and only drink their juice for another three to five days before ceasing entirely.\n\nEach day, drink a little wine as you please. Once the abdomen is empty, drink a large amount of wine to induce vomiting and expel phlegm from the chest—this will make you extremely refined. Each day, you must eat pepper, about three to two *liang*. Take one *he* of pepper, clean it thoroughly, and remove the seeds. For those who keep their mouths closed or avoid dust, use wine, water, creeping fig infusion, or vegetable broth to swallow it. This will benefit qi and expel foul substances from the abdomen—this is a secret method.\n\nGinger has the property of softening things. If there is food in the abdomen, drinking ginger soup is not an issue, but once the food is gone, it is no longer appropriate. If vegetables contain wild wormwood or *huying*, they must not be eaten, as they can disrupt one’s qi.\n\nWhen swallowing qi in the supine posture, guide it into the intestines and then into the *jiu* head. When swallowing in the prone posture, guide it to exit through the *shu* viscera.\n\nHumans have both *shu* viscera and *sheng* viscera. After practicing for a month, qi will begin to enter, coiling in the intestines with a faint sound, circling and humming as it turns—this is the sign. Follow the method.\n\nThe more the intestines coil and turn, the better. Twelve turns are superior; ten, nine, seven, five, or three turns are progressively lower. Those with only two or three turns are the lowest. The intestines of the base are wide and short—keen but lacking wisdom. Width pertains to keenness, shortness to lack of wisdom. The best is to have long intestines; if they are short and thin, one is not of the human kind.\n\nThe heart governs spirit-qi, the liver governs restrained qi, the lungs govern killing qi, the spleen governs Dao-qi, and the kidneys govern original qi. The qi swallowed at the proper time is internal qi.\n\nThose with long intestines find it easier to retain qi; those with short intestines find it harder. When practicing qi-swallowing and the intestines churn with sound, press the right side against a bowl, clasp your head with your right hand, and pull your left foot with your left hand, straightening your body and right foot. Swallow qi and guide it into the right foot—this allows for prolonged practice. Each time qi descends with a sound, the sound coils and winds through the intestines, and where it coils, a sound is made. Count the coils and track the sound as it flows and turns with a *yo-yo* murmur. A faint sound indicates smooth circulation.\n\nThe human intestines have four bends and nodes, the number of which you should also remember.\n\n**Method for Distinguishing External Qi and Original Qi**\nOriginal qi and external qi do not mix. If you swallow external qi, it will soon leak out from below and not remain in the intestines. If you circulate qi to the head and brain, the heat in the brain will rise and flow toward the feet—this is the same. If you first circulate yang qi, you will feel the feet first cool, then warm. Why is this? Because yang qi expels yin qi, hence the effect. If you first circulate yin qi, yang qi will exit first, and the feet will feel as hot as fire before cooling. All other cases follow this pattern. If you can circulate qi into the head, you will begin to prevent facial wrinkles.\n\nFrom the *Lao Jun Tai Xu Tai Shang Wu Shang Zi Ran Tai Qi Jing*.\n\n**Lord Lao’s Method for Guarding Unity and Cultivating the Body**\nAt midnight, when original qi begins to arise, lick your teeth with your tongue, moisten your lips above and below, inhale through the nose, and swallow through the mouth—repeat twenty-seven times. This will cause the generative qi to flow through the hundred vessels, granting long life.\n\n**Method for Cultivating the Body:**\nUpon rising in the morning, first exhale slowly. Rub your palms together until hot, then stroke your forehead fourteen times—this is called \"nourishing the Mud Pill Palace,\" ensuring the body’s spirits are complete.\n\nNext, rub your hands together until hot and wipe your face fourteen times—this is called \"dry bathing.\" It dispels malign qi, for the face is the dwelling of the Foot-Long True Person; seeing it keeps one free from illness.\n\nNext, rub your hands together until hot and stroke your body fourteen times—this is called \"bathing the body,\" preventing cold and wind.\n\nNext, rub your hands together until hot and stroke your hair from the forehead fourteen times, visualizing the hair spirit guarding life—this is called \"bathing the head.\" It prevents hair from turning white and teeth from falling out, allowing them to regrow.\n\nNext, rub your hands together until hot and clasp your ears from below, pulling upward fourteen times—this sharpens hearing. Each ear has two spirits, named Jiao Nü.\n\n**Method for Guarding Unity and Cultivating the Body:**\nUpon rising in the morning, after dressing, stroke your head and recite the incantation:\n*\"Great fortune, long life, all illnesses cured,\nMeet at the Gate of Blessing,\nThe five viscera harmonized, no worries,\nAll spirits fast and follow my body,\nGranting me fearlessness even in old age.\"*\n\nAfter reciting, step forward. First, advance the left foot and say: *\"Qian, next.\"*\nThen advance the right foot and say: *\"Yuan, next.\"*\nAdvance the left foot again and say: *\"Heng, next.\"*\nAdvance the right foot and say: *\"Li, next.\"*\nFinally, advance the left foot and say: *\"Zhen, auspicious.\"*\n\n\"As it is said: *Qian, Yuan, Heng, Li, Zhen.*\nThe body governs the ten thousand spirits;\nAt the Jade Gate, one beholds the bright sun and attains great fortune, fulfilling all desires.\n\n**Method for Guarding Unity:**\nAlways cherish qi, be cautious in speech,\nLet qi enter abundantly and exit sparingly,\nReturn qi to replenish the primordial,\nContemplate the primordial qi—\nThus shall one attain longevity.\n\n**Method for Guarding Unity:**\nWhen lying down, always follow the four seasons and eight solar terms:\nIn spring and summer, rise early, awakening with the orioles;\nIn autumn and winter, rise late, awaiting the sunlight without aversion.\nTo act contrary is to invite harm.\n\n**Incantation for Commanding the Body’s Spirits:**\nSolemnly command the five viscera and six bowels within my body,\nThe nine palaces and twelve spirit chambers,\nThe four limbs and five constituents,\nSinews, bones, marrow, and brain,\nSkin, flesh, blood, and vessels,\nOrifices, constructive and defensive qi,\nOne hundred eighty muscle gates,\nThree hundred sixty bone joints,\nOne thousand two hundred forms and shadows,\nTwelve thousand essences and radiances,\nThe three hun on the left, the seven po on the right,\nThe three ghosts and five spirits—\nAtop my head, the Vermilion Bird;\nBeneath my feet, the Dark Warrior;\nTo my left, the Azure Dragon, supporting and guiding;\nTo my right, the White Tiger, escorting and sending;\nThe Vermilion Bird leads before, bearing banners and pennants;\nThe Dark Warrior follows behind, bearing bells and drums.\nLet my heart resist evil,\nMy liver resist illness,\nMy lungs resist treachery,\nMy kidneys resist confusion,\nMy spleen resist death,\nMy gallbladder resist fear,\nMy stomach resist filth.\nMay my qi soar on wings,\nFurther enhanced by guiding and pulling.\nSwiftly, swiftly, as I have declared!\n\nIf one treads upon filth or any inauspicious place,\nOne must bathe and rinse to dissolve the body’s impurities.\nThe method employs:\nTen liang of bamboo leaves,\nFour liang of peeled peach bark,\nBoiled in one *hu* and two *dou* of clear water until a single boil,\nThen cooled to a suitable temperature for bathing—\nAll misfortunes shall vanish.\n\nIf washing the hair, this method is not solely employed,\nFor this is the refined essence for bathing the body.\nThus, one must not wash the head with it;\nInstead, follow the usual method for washing the hair.\n\nHere ends the *Taiqing Oral Instructions on Ingesting Qi*.\"",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太清服气口诀 经名：太清服气。 诀。 又名《上清服气口诀》。 不着撰人。 一卷。 底本出处：《正统道藏》洞神部方法类。 太清服气口诀 夫万物之生，禀阴阳而成形汇兆。 阴阳施化，从元气而寒暑成分。 故太阳兴也，有暄暄之色，以生众品； 太阴动也，有苍苍之气，以杀群萌。 莫不感气而生灭，斯即月前常觊，君子所知。 故云夫食元气天不能杀，地不能藏者，佳矣！ 且交接元气於肾鼻之问，分阴阳於藏腑之内，吐纳无爽，持摄不乖，则长生之端，可以期矣。 今予所录口诀者，即服元气之法也。 其有诸秘，乃於口传，非纸笔可能载。 虽厅述多少，亦一家之要。 凡诸好事之俦，得之不可轻泄也。 凡人腹中三处有隔，即心下有隔，初学服气者，皆觉心下胃中满，但少食，久作之，自觉通下至藏下有隔，即觉腹中满，久而作之，自觉至脐下丹田中，然后觉气周行身中，犹自未入鸠中，后觉鸠中气出，即能与人疗病也。 初学时必须安身静处细意，行之不已，气入腹中，即於行住坐卧一切处不妨，胃中气未下即不得。 诸处作难成。 初服气皆因入息即住其息，少时似闭气满，其息出时，三分可二分出，还住，少时咽之，咽已，又作，至腹中满，休。 必须日夜四时作，为初学人气未入丹田，还易散意，欲得气相接也。 气入丹田已，纵不服，亦气不散。 四时者，朝暮子午时也。 心裹满，但不服气，咬少许甘草、桂亦得，其满即散，丹田未满，亦未到满也。 元气下时，自然有少闷也。 凡初服气，日夜要须四度。 朝暮二时用仰覆势，夜半及午唯用仰势。 其仰势但用低枕，仰卧，缩两脚，坚两膝，但两手着两胁边，即咽气。 解咽，只十咽，气即满丹田。 待一时咽了，然后以意运入鸠中。 其覆热以腹坦状，以被支胸，令高，手脚并伸着林，即咽十咽，每咽皆以意运，令沿脊下，从熟藏中出。 每朝暮服气，先覆后仰，每咽气皆须一下下作声始得，不解作声，徒劳耳。 凡咽气皆须喉中深徐徐咽，不得猛，猛即发嗽。 凡咽气每一回咽，中间隔十息，亦作事停歇，从容任意。 凡咽气不得和唾咽，气须要乾咽，中问有津液来，别咽之。 咽液亦须用入息，恐生风入极，须用心。 初从受服气法，要须诵咒受法了后，平常自用气，亦不要诵咒，与人疗病始回回诵咒。 凡服气四度外，或非时腹中觉少气力不健，任意咽多少亦得。 凡初服气未固，多从熟藏下泄，宜固之，勿令下泄，以意运令散。 初服气必须心意坦然，无疑无畏，不忧不惧，若有畏惧，气即难行。 凡服气若四体调和，必须意裹听然自足，不羡一切事，即日胜一日，欢快无极也。 凡服气不得思食，坦然无所念始得，若思食必须抑捺如不在意，不抑捺，心即须念。 如渴，煮薜荔汤，汤中着生姜少许，更煮一两沸，渴吃一，碗，其渴即定，姜蜜汤亦得。 若能自抑捺，纵终日对嘉肴，亦无所思。 凡服气但不失时节，丹田常满，纵日别出行人事亦不妨，久久行惯，纵失一时两时亦无得。 凡咽气仰排水，覆排食。 食藏在右，水藏在左。 凡咽气久，即自至鸠头，凡咽气，覆存沿脊下，祇意存腹中，近脊寻声下，熟藏中出，仍令声从右边下。 凡咽气满闷下泄不能禁，亦非事。 所云存气使出顶及四肢，久行之自觉。",
      "translated_text": "**The Supreme Clarity Oral Formula for Qi Absorption**\n\n**Text Title:** *Taiqing Fuqi* (*Absorbing Qi of the Supreme Clarity*)\n**Alternative Title:** *Shangqing Fuqi Koujue* (*Oral Formula for Absorbing Qi of the Highest Clarity*)\n**Author:** Anonymous\n**Volume:** One\n**Source:** *Daoist Canon of the Zhengtong Era*, *Methods* section of the *Dongshen* Department\n\nAll things in the world are born, receiving form and manifestation from yin and yang. Yin and yang bestow transformation, deriving from primordial qi to differentiate cold and heat. Thus, when the Great Yang arises, it bears the radiant glow that gives life to all beings; when the Great Yin stirs, it carries the somber qi that withers all sprouts. None escape the influence of qi in their birth and decay—this is the constant principle before the moon, known to the noble person.\n\nAs it is said: \"One who consumes primordial qi cannot be slain by Heaven nor concealed by Earth\"—how excellent! When primordial qi is exchanged between the kidneys and nose, and yin and yang are divided within the viscera, with exhalation and inhalation unerring and regulation unbroken, then the gateway to longevity may be attained.\n\nThe oral formula I record here is the method for absorbing primordial qi. Its many secrets are transmitted only by mouth, for they cannot be contained in brush and paper. Though I describe but a portion, it is the essential teaching of this school. All who are devoted to this practice must not lightly disclose it.\n\nWithin the human abdomen lie three barriers: the first is below the heart. Beginners in qi absorption always feel fullness below the heart in the stomach. Eat sparingly, and with prolonged practice, you will naturally sense the passage downward to the barrier below the viscera, where the abdomen feels full. With further practice, you will feel it reach the Cinnabar Field below the navel. Only then will you sense qi circulating throughout the body, though it has yet to enter the *jiu* (turtledove) center. Later, when qi emerges from the *jiu*, you will be able to heal others.\n\nWhen first learning, you must settle the body in a quiet place and proceed with care. Once qi enters the abdomen, you may practice while walking, standing, sitting, or lying down without hindrance. If the stomach’s qi has not descended, do not attempt other methods, for they will be difficult to master.\n\nAt the start of qi absorption, inhale and hold the breath briefly, as if closing it, until full. Upon exhalation, release only two-thirds of the breath, then hold again. After a short pause, swallow. Repeat until the abdomen is full, then rest. Practice this day and night at all four times, for beginners’ qi has not yet entered the Cinnabar Field and easily scatters. Continuous practice ensures the qi remains connected. Once qi enters the Cinnabar Field, even if you cease absorption, it will not disperse.\n\nThe four times are dawn, dusk, midnight, and noon. If the heart feels full, refrain from absorbing qi and chew a small amount of licorice or cinnamon to disperse the fullness. The Cinnabar Field will not yet be full, nor will it feel so. When primordial qi descends, a slight oppression arises naturally.\n\nWhen first absorbing qi, practice four times daily. At dawn and dusk, use both the supine and prone postures; at midnight and noon, use only the supine posture. For the supine posture, lie on a low pillow, face up, draw in the legs, and raise the knees. Place both hands at the sides, then swallow qi. After ten swallows, qi will fill the Cinnabar Field. Wait an hour after swallowing, then guide the qi with intention into the *jiu* center.\n\nFor the prone posture, lie with the abdomen flat, propping the chest with a blanket to elevate it. Extend the hands and feet, then swallow ten times. With each swallow, guide the qi with intention to descend along the spine and exit through the *shu* (heat) viscera. At dawn and dusk, practice first prone, then supine. Each swallow must produce a sound; without sound, the effort is in vain.\n\nWhen swallowing qi, do so slowly and deeply in the throat. Do not swallow forcefully, or coughing will result. Between each swallow, pause for ten breaths, or rest as needed at your leisure.\n\nDo not swallow qi mixed with saliva; swallow it dry. If saliva arises, swallow it separately. When swallowing saliva, use inhalation to prevent wind from entering deeply—proceed with care.\n\nAfter receiving the method for absorbing qi, recite the incantation to complete the transmission. In daily practice, incantations are unnecessary, but recite them each time when healing others.\n\nBeyond the four regular sessions, if at any time you feel a lack of strength in the abdomen, swallow qi as needed. Initially, absorbed qi often leaks downward from the *shu* viscera—consolidate it to prevent leakage, guiding it with intention to disperse.\n\nWhen first absorbing qi, the mind must be at ease, free of doubt and fear. Do not worry or hesitate, for fear obstructs the flow of qi. If the four limbs are harmonized, remain content in stillness, desiring nothing. Progress will be daily, and joy will be boundless.\n\nDo not think of food while absorbing qi; remain free of all thoughts. If thoughts of food arise, suppress them as if unconcerned. Without suppression, the mind will dwell on them. If thirsty, boil *bili* vine decoction with a small amount of fresh ginger, simmering it once or twice. Drink a bowl, and thirst will subside. Ginger-honey decoction also suffices. If you can restrain yourself, even facing fine delicacies all day will not stir desire.\n\nAbsorb qi without missing the proper times, keeping the Cinnabar Field always full. Even if you attend to daily affairs, it will not hinder practice. With long habit, even missing an hour or two will not matter.\n\nWhen swallowing qi, the supine posture expels water, and the prone posture expels food. The food viscera lies on the right, the water viscera on the left.\n\nWith prolonged practice, qi will naturally reach the *jiu* head. When swallowing qi in the prone posture, guide it with intention to descend along the spine, focusing on the abdomen near the spine. Listen for the sound to descend and exit through the *shu* viscera, directing it to the right.\n\nIf qi becomes full and oppressive, leaking downward uncontrollably, it is not a concern. Guide the qi to exit through the crown and the four limbs. With long practice, you will sense this naturally.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1263,
      "start_sentence": 0,
      "end_sentence": 52,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.544703006744385,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太清服气口诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "如未觉，柢凭存即是。 凡咽气久，柢得丹田气，拍之彭彭即得。 纵心头未满，亦得。 如欲心头饱满，柢是多取气即得。 气如蛊行，久即自觉，更无别法。 问云：何得似吃食时？ 一种初学柢合如此，久久即共吃食时一也。 服气了，运通身，非令出，任其自出，如人行事，气力少即咽，亦不须候时。 内视肠中粪尽，闭目内视，即见肠中粪，极难尽。 纵断食二十余日，始尽。 初断食二七日，须日别吃一两顿煮菜，推宿粪令下，始得每顿吃一碗首蓿芥、芜菁嵩无妨，练却苦汁，入少油酥，任少着盐酱醋，作气味，勿着米饰等，且欲肠中谷气尽，吃菜可四五日，已后除却菜吃汁，又三数日，然后总停。 每须吃少酒任性，腹中空讫，大吃一顿酒，令吐胸中痰，即极精。 每日须吃椒，日三两，服椒一合，净择去子。 及闭口者，及去尘，以酒水、薜荔、汤菜汁，任意送之。 令下益气、及推腹中恶物，此是秘法。 姜性能烂物，腹中有食吃姜· 汤，非事，如食尽讫即非所宜。 如菜中有邪蒿及葫英，必不得食，能乱人气。 凡仰咽气入肠，运入鸠中，覆咽运，令从熟藏出。 凡人有熟藏、生藏，行之一月，气始入，盘屈肠中作小声，绕肠转呜，始是。 如法。 凡人盘屈肠转数多者为上，十二转已下，或十转九转，或七转五转，或三转两转，三两转者为下。 贱人肠厅而短，聪而无智，康属聪，短属不智，唯欲得肠长为上，若短更细不是人类。 心为神气，肝为禁气，肺为杀气，脾为道气，肾为元气，令时正咽者是内气。 凡人肠长者，气易固，肠短者，气难固。 凡服气如肠中搅转作声，即须右胁着钵，以右手叉头，以左手牵左脚，令屈直身及右脚。 咽气令入右脚中，即可久行，气每下作声，声绕盘屈子肠，屈处作声，皆记得屈，数其声流转哟哟然，小声即是流通好也。 人肠中四绿，又有节坎，坎数，亦自记得。 分别外气元气诀 元气与外气都不相杂，若咽生气入，须臾即从下泄出去，不得停肠中，若运气得应头脑中，头脑中热气上运向脚，亦如之。 若先运阳气，即觉脚先玲后热。 何故如此？ 绿阳气排阴气出，所以如此。 如先运阴气，亦阳气先出，脚如火热，然后始脚玲，他皆仿此。 若能运气入头，始免面皱也。 出《老君太虚太上无上自然太起经》。 老君治身守一法，当以夜半时元气始生，舌掠齿，上下舐唇，以鼻纳气，口咽之，三九止，则生气通流於百脉，令人长生。 治身法：朝起先嘘，两手掌摩令热，律额上二七，名曰存泥丸，令人身神具。 治身次，以两手相摩令热，拭面二七，名日乾浴。 令却恶气，面为尺宅真人居其中，见之令人不病。 次相摩两手令热，律身体二七，名为浴身，令人却寒风。 次相摩两手令热，从额律头发二七，寻存持发神守生，名为浴头。 令人发不白，齿落更生，次复摩两手令热，从耳下叉两耳，逆上二七，令人聪彻。 耳各有二神，神字娇女。 治身守一法：朝起，衣衣毕，手律头，咒曰：大吉，长生，百病除愈，会於福门，五藏调和，无忧患，诸神斋戒随我身，令我至老不畏人。 毕，下状，先前左足，咒曰：乾次。 前右足后祝曰：元次。 前左足复咒曰：亨次。 前右足后咒曰：利次。 前左足复咒曰：贞吉。",
      "translated_text": "If you have not yet sensed it, simply rely on focused intention—that is sufficient. With prolonged practice of swallowing qi, you will attain the qi of the Cinnabar Field, and when you pat it, it will resound with a *peng-peng* sound. Even if the qi in the head has not yet filled, this is still achievable. If you wish for the head to be fully filled, simply take in more qi—this will suffice. As qi moves like a creeping insect, with time you will naturally sense it; there is no other method.\n\nSomeone asked: How can it resemble the sensation of eating? For beginners, it must be like this. With long practice, it will become the same as eating.\n\nAfter swallowing qi, circulate it throughout the body. Do not force it to exit; let it leave naturally, as when one goes about their affairs. If your strength wanes, swallow qi again—there is no need to wait for a set time.\n\nVisualize internally until the intestines are empty. Close your eyes and inwardly observe, and you will see the waste in your intestines—it is extremely difficult to empty completely. Even after fasting for over twenty days, it will only just be gone. When first fasting for fourteen days, you must eat one or two meals of cooked vegetables daily to expel old waste. At each meal, you may eat a bowl of alfalfa mustard greens or turnip greens without issue. Boil away the bitter juice, add a little oil and ghee, and season lightly with salt, soy sauce, or vinegar to give it flavor. Do not add rice or grains, as the goal is to purge the intestines of grain qi. After eating vegetables for four or five days, then stop eating the vegetables and only drink their juice for another three to five days before ceasing entirely.\n\nEach day, drink a little wine as you please. Once the abdomen is empty, drink a large amount of wine to induce vomiting and expel phlegm from the chest—this will make you extremely refined. Each day, you must eat pepper, about three to two *liang*. Take one *he* of pepper, clean it thoroughly, and remove the seeds. For those who keep their mouths closed or avoid dust, use wine, water, creeping fig infusion, or vegetable broth to swallow it. This will benefit qi and expel foul substances from the abdomen—this is a secret method.\n\nGinger has the property of softening things. If there is food in the abdomen, drinking ginger soup is not an issue, but once the food is gone, it is no longer appropriate. If vegetables contain wild wormwood or *huying*, they must not be eaten, as they can disrupt one’s qi.\n\nWhen swallowing qi in the supine posture, guide it into the intestines and then into the *jiu* head. When swallowing in the prone posture, guide it to exit through the *shu* viscera.\n\nHumans have both *shu* viscera and *sheng* viscera. After practicing for a month, qi will begin to enter, coiling in the intestines with a faint sound, circling and humming as it turns—this is the sign. Follow the method.\n\nThe more the intestines coil and turn, the better. Twelve turns are superior; ten, nine, seven, five, or three turns are progressively lower. Those with only two or three turns are the lowest. The intestines of the base are wide and short—keen but lacking wisdom. Width pertains to keenness, shortness to lack of wisdom. The best is to have long intestines; if they are short and thin, one is not of the human kind.\n\nThe heart governs spirit-qi, the liver governs restrained qi, the lungs govern killing qi, the spleen governs Dao-qi, and the kidneys govern original qi. The qi swallowed at the proper time is internal qi.\n\nThose with long intestines find it easier to retain qi; those with short intestines find it harder. When practicing qi-swallowing and the intestines churn with sound, press the right side against a bowl, clasp your head with your right hand, and pull your left foot with your left hand, straightening your body and right foot. Swallow qi and guide it into the right foot—this allows for prolonged practice. Each time qi descends with a sound, the sound coils and winds through the intestines, and where it coils, a sound is made. Count the coils and track the sound as it flows and turns with a *yo-yo* murmur. A faint sound indicates smooth circulation.\n\nThe human intestines have four bends and nodes, the number of which you should also remember.\n\n**Method for Distinguishing External Qi and Original Qi**\nOriginal qi and external qi do not mix. If you swallow external qi, it will soon leak out from below and not remain in the intestines. If you circulate qi to the head and brain, the heat in the brain will rise and flow toward the feet—this is the same. If you first circulate yang qi, you will feel the feet first cool, then warm. Why is this? Because yang qi expels yin qi, hence the effect. If you first circulate yin qi, yang qi will exit first, and the feet will feel as hot as fire before cooling. All other cases follow this pattern. If you can circulate qi into the head, you will begin to prevent facial wrinkles.\n\nFrom the *Lao Jun Tai Xu Tai Shang Wu Shang Zi Ran Tai Qi Jing*.\n\n**Lord Lao’s Method for Guarding Unity and Cultivating the Body**\nAt midnight, when original qi begins to arise, lick your teeth with your tongue, moisten your lips above and below, inhale through the nose, and swallow through the mouth—repeat twenty-seven times. This will cause the generative qi to flow through the hundred vessels, granting long life.\n\n**Method for Cultivating the Body:**\nUpon rising in the morning, first exhale slowly. Rub your palms together until hot, then stroke your forehead fourteen times—this is called \"nourishing the Mud Pill Palace,\" ensuring the body’s spirits are complete.\n\nNext, rub your hands together until hot and wipe your face fourteen times—this is called \"dry bathing.\" It dispels malign qi, for the face is the dwelling of the Foot-Long True Person; seeing it keeps one free from illness.\n\nNext, rub your hands together until hot and stroke your body fourteen times—this is called \"bathing the body,\" preventing cold and wind.\n\nNext, rub your hands together until hot and stroke your hair from the forehead fourteen times, visualizing the hair spirit guarding life—this is called \"bathing the head.\" It prevents hair from turning white and teeth from falling out, allowing them to regrow.\n\nNext, rub your hands together until hot and clasp your ears from below, pulling upward fourteen times—this sharpens hearing. Each ear has two spirits, named Jiao Nü.\n\n**Method for Guarding Unity and Cultivating the Body:**\nUpon rising in the morning, after dressing, stroke your head and recite the incantation:\n*\"Great fortune, long life, all illnesses cured,\nMeet at the Gate of Blessing,\nThe five viscera harmonized, no worries,\nAll spirits fast and follow my body,\nGranting me fearlessness even in old age.\"*\n\nAfter reciting, step forward. First, advance the left foot and say: *\"Qian, next.\"*\nThen advance the right foot and say: *\"Yuan, next.\"*\nAdvance the left foot again and say: *\"Heng, next.\"*\nAdvance the right foot and say: *\"Li, next.\"*\nFinally, advance the left foot and say: *\"Zhen, auspicious.\"*",
      "overlap_context": " left.\n\nWith prolonged practice, qi will naturally reach the *jiu* head. When swallowing qi in the prone posture, guide it with intention to descend along the spine, focusing on the abdomen near the spine. Listen for the sound to descend and exit through the *shu* viscera, directing it to the right.\n\nIf qi becomes full and oppressive, leaking downward uncontrollably, it is not a concern. Guide the qi to exit through the crown and the four limbs. With long practice, you will sense this naturally.",
      "start_char": 1263,
      "end_char": 2500,
      "start_sentence": 53,
      "end_sentence": 101,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.91428089141846,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太清服气口诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "同曰：乾元亨利贞。 身为万神主，玉户见，白日大吉得所望。 守一法：常爱气，慎言语，令气入多出少，还气补於元，思念元气，终得长生。 守一法：卧常随四时八节，春夏早起，与鹦俱兴，秋冬晚起，必待日光无厌，逆之则伤。 敕身神咒 谨敕臣身中五藏六腑，九官十二神室，四肢五体，筋骨髓脑，皮肤血脉，孔窍荣卫，百八十肌关，三百六十骨节，千二百形影，万二千精光，左三魂，右七魄，三鬼五神，头戴朱雀，足履玄武，左扶青龙，右据白虎，青龙扶迎，白虎扶送，朱雀导前持幡幢，玄武随后负钟鼓。 令臣心不受邪，肝不受病，肺不受奸，肾不受昏，脾不受死，胆不受怖，胃不受秽。 吾气奋翼，更加导引，急急如臣所告。 若履秽及诸不诤处，当洗浴盥漱，解形以除其秽。 法用以竹叶十两，桃皮削取白四两，以清水一斛二斗，煮令一沸，适寒温以浴，万掩消除也。 若沐者盖不但用，此练尸之素浆，正以浴耳。 如此便不得以沐头，更依如常沐法也。 太清服气口诀竟",
      "translated_text": "\"As it is said: *Qian, Yuan, Heng, Li, Zhen.*\nThe body governs the ten thousand spirits;\nAt the Jade Gate, one beholds the bright sun and attains great fortune, fulfilling all desires.\n\n**Method for Guarding Unity:**\nAlways cherish qi, be cautious in speech,\nLet qi enter abundantly and exit sparingly,\nReturn qi to replenish the primordial,\nContemplate the primordial qi—\nThus shall one attain longevity.\n\n**Method for Guarding Unity:**\nWhen lying down, always follow the four seasons and eight solar terms:\nIn spring and summer, rise early, awakening with the orioles;\nIn autumn and winter, rise late, awaiting the sunlight without aversion.\nTo act contrary is to invite harm.\n\n**Incantation for Commanding the Body’s Spirits:**\nSolemnly command the five viscera and six bowels within my body,\nThe nine palaces and twelve spirit chambers,\nThe four limbs and five constituents,\nSinews, bones, marrow, and brain,\nSkin, flesh, blood, and vessels,\nOrifices, constructive and defensive qi,\nOne hundred eighty muscle gates,\nThree hundred sixty bone joints,\nOne thousand two hundred forms and shadows,\nTwelve thousand essences and radiances,\nThe three hun on the left, the seven po on the right,\nThe three ghosts and five spirits—\nAtop my head, the Vermilion Bird;\nBeneath my feet, the Dark Warrior;\nTo my left, the Azure Dragon, supporting and guiding;\nTo my right, the White Tiger, escorting and sending;\nThe Vermilion Bird leads before, bearing banners and pennants;\nThe Dark Warrior follows behind, bearing bells and drums.\nLet my heart resist evil,\nMy liver resist illness,\nMy lungs resist treachery,\nMy kidneys resist confusion,\nMy spleen resist death,\nMy gallbladder resist fear,\nMy stomach resist filth.\nMay my qi soar on wings,\nFurther enhanced by guiding and pulling.\nSwiftly, swiftly, as I have declared!\n\nIf one treads upon filth or any inauspicious place,\nOne must bathe and rinse to dissolve the body’s impurities.\nThe method employs:\nTen liang of bamboo leaves,\nFour liang of peeled peach bark,\nBoiled in one *hu* and two *dou* of clear water until a single boil,\nThen cooled to a suitable temperature for bathing—\nAll misfortunes shall vanish.\n\nIf washing the hair, this method is not solely employed,\nFor this is the refined essence for bathing the body.\nThus, one must not wash the head with it;\nInstead, follow the usual method for washing the hair.\n\nHere ends the *Taiqing Oral Instructions on Ingesting Qi*.\"",
      "overlap_context": "\n*\"Great fortune, long life, all illnesses cured,\nMeet at the Gate of Blessing,\nThe five viscera harmonized, no worries,\nAll spirits fast and follow my body,\nGranting me fearlessness even in old age.\"*\n\nAfter reciting, step forward. First, advance the left foot and say: *\"Qian, next.\"*\nThen advance the right foot and say: *\"Yuan, next.\"*\nAdvance the left foot again and say: *\"Heng, next.\"*\nAdvance the right foot and say: *\"Li, next.\"*\nFinally, advance the left foot and say: *\"Zhen, auspicious.\"*",
      "start_char": 2500,
      "end_char": 2900,
      "start_sentence": 102,
      "end_sentence": 114,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.60744833946228,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\太清服气口诀.txt",
        "category": "方法类"
      }
    }
  ]
}