{
  "source_id": "太清道德显化仪",
  "source_file": "chunked_daozang\\太清道德显化仪.json",
  "total_chunks": 11,
  "total_original_chars": 7015,
  "total_translated_chars": 45412,
  "total_translation_time": 233.69794273376465,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\威仪类\\太清道德显化仪.txt",
    "category": "威仪类"
  },
  "full_translation": "*The Ritual of the Manifestation of the Dao and Virtue of the Great Clarity*\n\n**Scripture Title:** *The Ritual of the Manifestation of the Dao and Virtue of the Great Clarity*. One fascicle. Source text: *Daoist Canon of the Zhengtong Era*, \"Worship and Ritual\" category of the *Dongshen* section.\n\n**The Ritual of the Manifestation of the Dao and Virtue of the Great Clarity**\n**Offering Longevity and Sacrifices**\n\nRecite the *Guardian Spirit Incantation*, invoke the register of ranks, and declare the officiant’s title:\n\n*\"Your servant, [Name], humbly addresses the Most High, the Primordial and Boundless Three Heavens, the Peerless Great Dao, the Supreme Lord Lao, the Heavenly Worthy of Dao and Virtue; the Holy Mother, the Great Sage of the Prior Heaven; the Primordial Sovereign of the Great Monad; the Lords, Masters, and Elders of the Great Clarity and the Cavernous Spirit; the Ministers, Chancellors, and Governors of the Three Heavens and Four Quarters; the Officials and Clerks of the Celestial Bureaus; and the Perfected and Spirits of the Three Realms.*\n\n*May your vast compassion turn and cast its gaze upon us.*\n\nYour servant has heard: The Great Void is vast and boundless, and above lies the Celestial Realm. The primordial qi is subtle and faint, yet within it abides the essence of the Dao. Gazing upon the realm of the Great Clarity, it is the home of the infinite kalpas. The qi of the Dao spans myriad eons, layered across the vastness of primordial chaos. Here, the lords of this domain number one thousand two hundred, who serve as ministers of creation. From wondrous being to wondrous non-being, it is ever elusive and indistinct. Though the Dao does not govern, its power is manifest through the nurturing of the people; though its traces are unfathomable, its teachings are made evident for the sake of the world.\n\nYour servant, in humble study of the records, presumes to glimpse the sacred and divine. In the ninth year of King Wuding’s reverent reign, on the full moon when the Dipper’s handle pointed to *yin*, it was said that the birth of the Primordial One occurred on this very day. Thus, the celebration of this rite has flourished in the world. Yet this merely expresses the longing of human hearts—how could it truly enhance the radiance of the sagely virtue?\n\nToday, your disciples, [Names], rejoice and revere with deepest devotion, singing praises without end. We open the pure altar and prepare the offering, hastening to the cinnabar steps to raise our cups. We humbly pray that you will not disdain our lowliness but deign to turn your gaze upon us. May the Azure Ox and the Purple Qi appear as they did when crossing the Han Valley; may the White Horse with Crimson Mane descend as on the day of Mount Mao. May the host of perfected ones gather, and a single thought reach you in secret.\n\nYour servants gaze upon the celestial steps, overwhelmed with reverent anticipation. With utmost sincerity, we bow twice and prostrate ourselves, offering this invocation. We beseech the presence of the sages.\"*\n\nWith utmost sincerity and reverence, we humbly invoke:\nThe Most High Heavenly Emperor of Great Clarity,\nThe Heavenly Elder of Great Clarity,\nThe Nine Elders of the Immortal Capital of Great Clarity,\nThe Nine Qi Elders of Great Clarity,\nThe Azure Youth of the Fangzhu Palace, Supreme Minister,\nThe King of Total Perfection of the Western City, Supreme Chancellor,\nThe Primordial Sovereign of the Southern Culmen, Supreme Guardian,\nThe Primordial Sovereign of Supreme Simplicity of the White Mountain Palace, Supreme Tutor,\nThe Great Dharma Master of the Mysterious Center, the Riverbank Elder,\nMaster Yin the Perfected of Wenshi,\nThe Supreme Minister Zhang the Perfected of Grand Mystery,\nThe Supreme Minister Ge the Perfected of Heavenly Mechanism,\nThe Supreme Minister Xu the Perfected of Heavenly Pivot,\nThe Supreme Minister Fuqiu the Perfected, Recorder,\nThe Great Perfected of Supreme Origin of the Upper Epoch,\nThe Immortal Elder of Grand Culmen of the Middle Epoch,\nThe Immortal Earl of Great Clarity of the Lower Epoch,\nThe Supreme Minister of Grand Culmen of the Cavernous Divine,\nThe Immortal Earl of Grand Culmen of the Cavernous Divine,\nThe Supreme Immortal of Grand Mystery of the Cavernous Divine,\nThe Marshal General Protecting the Three Heavens of the Cavernous Divine,\nThe Commander of the Nine Heavens’ Great Armies of the Cavernous Divine,\nThe Chamberlain of the Grand Culmen of the Cavernous Divine,\nThe Chamberlain of the Grand Culmen of the Cavernous Divine,\nThe Minister of the Wood Department of the Cavernous Divine,\nThe Minister of the Fire Department of the Cavernous Divine,\nThe Minister of the Metal Department of the Cavernous Divine,\nThe Minister of the Water Department of the Cavernous Divine,\nThe Minister of the Earth Department of the Cavernous Divine,\nThe Grand Minister Protecting the Armies of the Grand Culmen of the Cavernous Divine,\nThe Grand Minister of Prolonged Calculation of the Grand Culmen of the Cavernous Divine,\nThe Grand Minister of the Supreme Immortals of the Purple Palace of the Cavernous Divine,\nThe Inspector of Immortal Might of the Great Immortals of the Cavernous Divine,\nThe Grand Master of the Supreme Immortals of the Grand Culmen of the Cavernous Divine,\nThe Guard Captain Slaying Demons of the Three Heavens of the Cavernous Divine,\nThe Grand Minister of the Azure Void of the Cavernous Divine,\nThe Inspector of Life-Preserving Supreme Immortals of the Nine Heavens of the Cavernous Divine,\nThe Grand Inspector of the Seven Governors of the Purple Tenuity of the Cavernous Divine,\nThe Grand Inspector of the Alliance Might of the Golden Watchtower of the Cavernous Divine,\nThe Grand Inspector of the Yang Valley of Fusang of the Cavernous Divine,\nThe Grand Inspector of the Supreme Immortals of the Grand Culmen of the Cavernous Divine,\nThe Grand Inspector of the Immortal Decrees of the Mysterious Capital of the Cavernous Divine,\nThe Registrar of the Immortal Armies of the Immortal Courts of the Grand Culmen of the Cavernous Divine,\nThe Censor Protecting the Courts of the Nine Heavens of the Cavernous Divine,\nThe Grand Inspector of the Clouds and Mists of the Nine Heavens of the Cavernous Divine,\nThe Captain of the Purple Palace of the Cavernous Divine,\nThe Inspector of the Sixfold Clarity of the Cavernous Void of the Cavernous Divine,\nThe Guard Captain of the Eight Poles and Immortal Capitals of the Cavernous Divine,\nThe Grand Inspector of the Northern Culmen of the Cavernous Divine,\nThe Lord Controller of the Divine Assemblies of the Grand Culmen of the Cavernous Divine,\nThe Twelve Hundred Officials of Great Clarity,\nThe Court Officials of the Petition Offices of Great Clarity,\nThe Golden Lads and Jade Maidens Attending Incense on the Left and Right of Great Clarity,\nThe Dragon and Tiger Lords Attending Guards on the Left and Right of Great Clarity,\nThe Perfected Langganzhen,\nThe Perfected Kou of Mount Song,\nThe Perfected Who Have Received the Dao Through the Ages of Great Clarity,\nThe Divine Immortals Who Enlightened the Three Realms of Great Clarity,\nThe Envoys of the Incense Office of the Day,\nThe Local Earth Deities of the Present Realm.\n\nDescend, O Sages!\n\nWith awe and trepidation, we bow our heads and prostrate ourselves, humbly invoking the Most High Lord Lao, the Supreme Venerable of the Dao, the Heavenly Worthy of Virtue and Power, of the Boundless Great Dao of the Three Heavens of Great Clarity and Primordial Origin.\n\nWe reverently await your boundless compassion, that your radiant presence may grace the jeweled throne.\n\nThe Celestial Procession\n\nUndaunted by our mortal folly, we presumptuously summon the heavenly retinue. We envision the divine dragons harnessed to your chariot, the celestial steeds clearing the path, the twelve guardian officials leading the way with their cries, and the ninety thousand flying immortals following behind. Banners of tenfold splendor float upon the clouds and mist; the great carriage rings with jade bells, while fans of fivefold brilliance gleam with the light of sun and moon. We draw upon the auspicious omens of antiquity and rely upon the faintest glimmer of your presence in the midst of heaven. Selecting but one marvel from the myriad wonders, we strive to adorn our offering with the utmost magnificence. May the seven treasures of our devotion serve as tokens of our celebratory rites.\n\nWe bow our heads and prostrate ourselves, overwhelmed with reverence and awe.\n\nThe Hymn of Pacing the Void\n\nThe jeweled throne descends upon the golden hall,\nIts radiance illumines the jade portico.\nTen thousand Perfected gather at the Emperor’s abode,\nTheir flying sandals treading the roots of clouds.\n\nWe have heard: of old, your immortal form was first bathed in the divine waters. Drawing from the Yellow Flower Pool of the Eastern Well, your hair emanated golden light; pouring from the Flowing Gush Pool of the Western Hua, your body was suffused with jade-like luster. Since the nine dragons first offered their auspicious tribute, this has brought glory through the ages. Now we take up this name and extol its excellence. Extending the lineage of the Spirit Stream, its beneficence knows no end; dividing the afterwaves of the Eastern Well, flying immortals may find refuge therein.\n\nBefore the Dao, we humbly present our offering.\n\nThe Flowing Grace of the Dharma Source, the Heavenly Worthy\n\nThe Offering of Incense\n\nWe have heard: within the Dao, incense alone is esteemed. That which issues from the Pure Subtlety is called Liberation—it possesses the power to deliver the hidden and manifest. That which grows in the Grotto of Assembly is named Return to Life—it holds the marvel of reviving the dead and restoring the bones. Yet its efficacy lies not in the substance itself, but in its virtue. We also know that it is not perceived by the nose, but by the heart.\n\nIf the fragrance of mortal flowers and trees could suffice, how could the divine immortals of heaven lack such? Yet in ritual, rarity is prized—when the offering is extraordinary, its sincerity cannot be concealed, and thus heaven may receive it. We, your servants, humbly present our offering before the Dao.\n\n**Cloud-Script Celestial Worthy of Fragrant Offerings**\n\n**The Offering of Flowers**\n\nWe have heard: in the immortal gardens, myriad blossoms flourish in countless varieties. From the sunlit caverns of Everlasting Day, one plucks the blooms of the Ruo Tree; from the soaring forests of the Dark Garden, one gathers the azure stamens of the Void-Blue. Their lush petals unfurl, and the spirit-winds lengthen the day; their crimson and violet hues glow, and the Dao’s sun melts into spring. These are no common colors or scents of the mortal world—they are fitting for the highest veneration. Placing these jadelike blossoms upon the mat, we pray to bring joy to heaven; transforming them into jeweled canopies in the void, we seek shelter beneath the Dao’s shade. We, your servants, humbly present our offering before the Dao.\n\n**Radiant Jade-Bloom Celestial Worthy**\n\n**The Offering of Candles**\n\nWe have heard: though lamps and candles may seem small, they remedy what yin and yang cannot reach. Orchid-oil wicks extend the daylight, exhaling flickering crimson flames; the sun-mirror gathers essence, casting forth radiant vermilion glow. Yet in the immortal realms of the Great Clarity, how could such feeble light be needed? Still, the meaning may lie in repaying the sun’s grace, and thus ritual demands the offering of rows of torches. Our hearts are thus—we seek the enduring brightness of a single flame; the Dao’s power manifests it, illuminating the ten directions with boundless light. We, your servants, humbly present our offering before the Dao.\n\n**Unobstructed Wisdom-Light Celestial Worthy**\n\n**The Offering of Tea**\n\nWe have heard: among the wondrous plants of the world, all are the nourishment of the perfected immortals. The Seven-Luminous Stone Fungus, tribute from the Kunwu of the West; the Ten-Knotted Divine Herb, borne from the depths of the Northern Void. How much more do the many medicines of the Dao surpass them—how could mortal tea alone be worthy of admiration? Yet in offering it to the Most High, we duly perform the revered rites. The Penglai Mountains number three—dare we boast of its transcendent wonders? In the Upper Clarity, it ranks first—yet still there are those who seek the elixir to transform their bones. We, your servants, humbly present our offering before the Dao.\n\n**Spirit-Pervading Measure Celestial Worthy**\n\n**The Offering of Wine**\n\nWe have heard: when the Great Chariot once journeyed to the Four Limits, the immortals vied to present their longevity cups. The Azure Lad of the Eastern Sea offered the feast of Jade Nectar and Golden Springs; the Nine Heavens’ Lord opened the banquet of Cloud Brew and Moon Essence. Jade blossoms were tribute from Vermilion Mound; sweet dew flowed from the Purple Palace. Recalling the splendor of those bygone days, we renew the rites today. Raising the Northern Dipper, we pour the celestial draught, offering the spring’s joy to the ninefold heavens; brewing the Western River, we craft the wine of longevity, praying all under heaven may share in the intoxication of bliss. We, your servants, humbly present our offering before the Dao.\n\n**Jade-Light Floating Luminance Celestial Worthy**\n\n**The Offering of Fruit**\n\nWe, your servants, recall: when the imperial chariot once made its sacred progress, immortal fruits were presented as tribute from the provincial domains. The Queen Mother of the West, sovereign of the Nine Numinous Ones, offered the golden-purple *jiaoli*; the Lady of the Southern Culmen proffered the vermilion-spirit *huozao*. From the east were plucked the mulberries of Fusang; from the north were gathered the gourds of the Hollow Cavern. As we cherish the lingering beauty of those bygone days, we emulate the mortal rites with our humble offering. Though the fruit that takes three thousand years to ripen is not deemed abundant, and the branch that bears for seven hundred years without flaw is scarce, we pray these may be graciously bestowed. We, your servants, humbly present our offering before the Dao.\n\n**Celestial Worthy of Rare and Subtle Savors**\n\n**The Presentation of Vegetable Offerings**\nWe, your servants, recall: the virtue of heaven and earth requires no form or likeness; the radiance of sun and moon needs no embellishment of painting. How much more does the Great Dao reside beyond names and words, and the Profound Mystery transcend the bounds of thought? Though one may compare it to the sands of ten thousand kalpas, its measure remains unfathomable; how could a single phrase upon these tablets ever suffice to praise it in full? Yet the clouds of dew’s revelation are indeed majestic, and the wind’s blade truly awe-inspiring. Just as rivers and seas do not scorn the smallest streams, trusting in this boundless assurance, so too does the great virtue of heaven and earth daily bestow its blessings without fail. With these sincere words of red devotion, we humbly make them known.\n\nProclaim the petition, open the passage, return to the origin, and dedicate the merit.\n**Manifestation of Ritual Texts**\n**Pacing the Void**\n\nMinister humbly observes: To depict the form of the Great Void, even the perfected ones cannot fathom its bounds; to capture the radiance of the sun and moon, even the most skilled artisans cannot render their brilliance. Reverently we consider the Supreme Clarity’s immortal realm, the Most High Lord Lao, the Primordial Emperor of Supreme Virtue, the Jade Sovereign of the Dao and Virtue. Born before the limitless, emerged above the Great Void, neither existent nor nonexistent, neither sound nor form, uniquely the source of the supreme Dao; able to be long or short, square or round, the unnamed mother of the myriad things. Vastly encompassing the cosmos, subtly entering the finest hairtip. Towering and boundless, beyond all naming; dim and silent, beyond all knowing.\n\nFrom the primal origin’s first stirring, the mysterious transformation flowed in secret. High and low established the forms of purity and turbidity; movement and stillness governed the bodies of hardness and softness. Wind and thunder, mountains and marshes linked the eight trigrams in mutual generation; spring and summer, autumn and winter turned the four seasons without error. Sun, moon, and stars adorned the heavens above; people and all beings thrived between. Multitudinous and teeming, endlessly transforming—this is how the primordial qi was set in motion to open heaven and earth.\n\nWhen the Nine August Ones had arisen and dynasties succeeded one another, he descended into the world as teacher, adapting his teachings to the times. He established the great principles and set the records, scriptures becoming the world’s grand canon; he benefited use and enriched life, accomplishing the multitudes’ affairs. This is how he established the human Dao through the ages.\n\nThereafter he founded the guiding principles of Dao and virtue, creating the methods of purity and emptiness. The sevenfold wondrous scriptures guided beings through the three vehicles; the nine-return elixir formulas were entrusted to advanced practitioners for cultivation. At times he expounded the origins of ritual and music, at others he expounded the teachings of the floating [Buddhist] doctrine. From root to branch, from essence to coarse manifestation, all was complete. A thousand methods, ten thousand gates, yet all converged in a hundred considerations—this is how he established teachings and transformations in accord with the customs of the times.\n\nExtending his form through the three realms, manifesting traces in the ten directions: sometimes illuminating the Pole Star to govern celestial patterns, sometimes concealing his radiance as a pillar of history to assist the state. He pointed to white bones and made them human, saved beings from flood and delivered them from kalpas. Aiding the imperiled, rescuing the distressed, no response failed to reach; delivering the dead, saving the living. Those with karmic affinity who encountered this were delivered across ancient and modern times in measureless numbers.\n\nThus his numinous power blazes resplendent, his merit and virtue tower sublime. In heaven he is the honored one among the myriad sages; in the world he is the leader of the three teachings. The thirty-six heavens and thirty-six earths all lie within his grasp; eighty-one years and eighty-one bodies first revealed his transformative traces. Neither divine intelligence nor sagely wisdom can exhaust his wonders or plumb his source. Though ten thousand voices and tongues extol him, even through kalpas unending they cannot complete the task; if but a single word or phrase were uttered in description, what benefit would it bring to the Dao?\n\nNow this minister and disciples such as so-and-so, gazing toward the azure sea with spirit flowing, beholding Mount Tai with eyes straining, recklessly and deludedly attempt to offer praise. Taking the sacred titles as their framework, they distilled nine rites; selecting from the immortal scriptures to sing praises, preserving not even one in ten. Only in the depth of their utmost reverence did they fail to notice the crudeness of their words.\n\nWe humbly pray that the Dao-heart silently respond, that heavenly insight secretly perceive. Though these trivial and fragmentary words are surely unworthy of notice, yet the vast and boundless measure of the rivers and seas accepts all without exception. Each of us moves with sincere heart, together proclaiming the wondrous model.\n\nRaise, and let each person reverently\nWith devoted heart bow in homage:\nVast and dim, obscure and silent, darkly merging with the mysterious.\nFrom the beginning, empty and without root, the Great Void as the body of the Dao;\nFirst issuing forth, the primordial qi congealed, the ancestral qi established the root of heaven.\nCreating the three powers, unfolding the ten thousand patterns,\nDwelling within the imageless and formless, abiding before the Grand Beginning and Grand Simplicity.\nDivine Treasure Venerable, together with the Most High Lord Lao, the Primordial Emperor of Supreme Virtue.\nIn the midst of the indistinct and obscure, a form appeared;\nAbove, no further ancestral Dao to surpass him as honored one.\nEmbracing and containing creation, moving yin and yang,\nCarving and chiseling the formless to establish heaven and earth.\nAbove assisting the Great Luo’s Primordial Beginning’s transformation,\nIn the middle propagating the Numinous Treasure Dao Lord’s wind.\nRevered dwelling in the Supreme Clarity’s Grand Ultimate Palace,\nHe is called the Lord of the Great Dao of Non-Doing.\nWith devoted heart bow in homage:\nBreaking open the primordial chaos, splitting the mysterious and the yellow.\nThe Dao-qi congealed and mixed, from the Great Luo generating the three realms;\nThe primordial net unfolded, from the ancestral kalpa transforming and giving birth to the myriad heavens.\nAbove arrayed the nine skies, below divided the three realms,\nEstablishing the realms of cultivation, founding the sacred immortals’ mysterious regions.\nPervading the great chiliocosm, completing the lineage of the August One.\nLord of the Ten Thousand Heavens, together with the Most High Lord Lao, the Primordial Emperor of Supreme Virtue.\nEver since the primordial qi flowed in the vast expanse,\nFrom the ancestral kalpa the root of heaven was established.\nFive thousand five hundred billion layers of heavens,\nThree Caverns and thirty-six divisions of teachings.\nEach according to their realm clarifying the stages of cultivation,\nAll becoming the ranks and grades of perfected immortals.\nHeavenly beings, perfected sages, all took him as teacher;\nHis merit and virtue towering, surpassing ten thousand kalpas.\nWith devoted heart bow in homage:\nDescending in the age of the Nine August Ones to establish teachings,\nEntrusting successive generations as teacher.\nFrom Fuxi to King Kang of Zhou,\nSpanning more than ten thousand years of the world,\nBeginning with Yuhua and ending with Guoshu,\nThose called “Master” numbered fifteen.\nEmbodying the primordial and extending benevolence,\nOpening things and accomplishing affairs,\nDemonstrating the model for a hundred kings,\nBecoming the standard for ten thousand ages.\nTeacher of emperors and kings through the ages,\nTogether with the Most High Lord Lao, the Primordial Emperor of Supreme Virtue.\nThe imperial kingly wind established according to the age,\nTongxuan, Pangu, the ancient firstborn.\nYuhua, Guangshou, the great accomplishment named,\nGuangcheng, responding to circumstances, the Red Essence titled.\nLu Tu, Wucheng, Yin Shou listed,\nZhenxing, Xize, Xieyi named.\nYu Cheng, Jing Cheng, Guoshu the last—\nThrough the ages as teacher, this can be recounted.\nWith devoted heart bow in homage:\nResponding to conditions to establish transformations,\nDelivering beings according to the kalpa.\nThe *Dao and Virtue* of five thousand words,\nOpening the ancestor of the golden elixir;\nThe talismanic scriptures of fifteen hundred scrolls,\nTransmitting the lineage of the Orthodox Unity.\n\nThe teachings emerge from one source yet bear different names,\nThe Dao flows in parallel without contradiction.\nHeaven and humanity look up in reliance,\nImmortals and sages find their refuge—\nThe Great Dharma Master of the Mysterious,\nTogether with the Most High Lord Lao, the Primordial Emperor of Supreme Virtue.\n\nIn his transformed body, the Serene Elder first spread the teaching,\nIn the Eastern Land, many rulers and ministers found deliverance.\nThe Dao returned to Wen and Yin to reveal the golden elixir,\nThe Dharma was entrusted to the Heavenly Master to clarify the Orthodox Unity.\nZhen Duo and Song Lun transmitted the arts of refinement,\nQian Zhi and Gan Ji received the scriptural disciplines.\nHow many immortals were forged from the dross of the world—\nThe mysterious wind of ten thousand ages shall never fade.\n\nWith devoted heart bow in homage:\nExpounding the true essence of the One,\nOpening the gate of Non-Duality.\nIlluminating the origin of ritual and music,\nClarifying the return of virtue and the Dao.\n\nIn the East, the sigh of the ascending dragon arose in Lu,\nWhere the fruit of Nirvana was established,\nAnd the teachings of the floating *bhikṣu* were expounded.\nFrom the Western Hu came the welcome of the elephant-borne,\nWho styled himself the Ancient Firstborn,\nAnd was called the Reclusive Noble One.\nThough their names stood like tripods,\nTheir virtue flowed as rivers.\nThe patriarchs of the Three Teachings,\nTogether with the Most High Lord Lao, the Primordial Emperor of Supreme Virtue.\n\nFrom the Yin and Zhou dynasties, his traces first appeared,\nThrough the Xia era, he established his rules and patterns.\nTransforming the customs of eighty-one lands,\nFor nine hundred years, he made the Dao’s transformation manifest.\nConfucius heard the wind and became a teacher of ritual and music,\nŚākyamuni bowed his head to receive the floating *bhikṣu*.\nThus we know the Three Teachings share a common return—\nLater scholars, in their confusion, only bring suffering upon themselves.\n\nWith devoted heart bow in homage:\nThe Dao reaches back to the ancient beginning,\nVirtue wondrously merges in the mysterious.\nAbove, he is the August One; below, the King.\nAttaining it, one may govern the self within\nAnd rule the state without—\nNothing is beyond its fitting use.\nEmbracing the strengths of Yin-Yang, Ming-Jia, Ru, and Mo,\nExhausting the discourse on order and chaos, heaven and humanity through the ages.\nProfound and distant, it attains the utmost compliance;\nVast and fleeting, it returns to the Nameless.\n\nThe Heavenly Worthy of Dao and Virtue,\nTogether with the Most High Lord Lao, the Primordial Emperor of Supreme Virtue.\n\nWhen the two chapters of *Dao and Virtue* first descended to the world,\nThe hundred schools’ myriad doctrines all presented their words.\nEmpty the heart, fill the belly, blend with the subtle and formless,\nReturn to life’s mandate, guard the mysterious female.\nWithout action, without desire, return to purity and stillness,\nAbide in constant virtue, cherish spontaneity.\nCultivation, ordering, governance, and peace are but its remnants—\nFrom ancient times to the present, immortals have attained it thus.\n\nWith devoted heart bow in homage:\nEntering the realm of being from non-being,\nEntrusting *qi* to form the body.\n\nFrom the six *qi* of Yudan,\nThe auspicious lightning—\nIts kalpas are beyond reckoning.\nUntil the five colors of Heavenly Water,\nThe dream of the pearl—\nOnly then did his body appear.\nFirst ascending to heaven on the white deer,\nThen manifesting in Shu on the green sheep.\nTraces beyond traces,\nSpontaneous and natural.\n\nThe Heavenly Worthy Descending to Birth,\nTogether with the Most High Lord Lao, the Primordial Emperor of Supreme Virtue.\n\nA host of immortals bore the sun as they descended from heaven,\nFive-colored flowing pearls wove the sacred embryo.\nThrough eighty-one years, corresponding to the *Qian* trigram,\nBorn on the fifth day of the third month, matching the Luo numbers.\nHis surname derived from grasping the plum tree,\nEmerging from the dust, he stepped upon the lotus.\nUnique in honor above and below heaven,\nHis countenance and dignity were peerless.\n\nWith devoted heart bow in homage:\nTransformations without limit,\nMiracles beyond measure.\n\nSometimes as one thousand two hundred,\nLord Lao manifests in the heavens.\nSometimes as one hundred eighty,\nThe Dao Lord guides the mortal realm.\nHis titles are not confined to thirty-six,\nHis names not limited to seventy-two.\nThough his Dharma-body fills all,\nLike empty space, his wondrous essence—\nOriginally ever serene and still—\nBlends with the ten thousand transformations.\n\nTogether with the Most High Lord Lao, the Primordial Emperor of Supreme Virtue.\n\nHis wondrous essence originally returns to the Ultimate One,\nA thousand or ten thousand transformed bodies are not many.\nIn spring, the Supreme Radiance; in summer, the Aged One;\nIn autumn, the Spirit Light; in winter, the Youth.\nIn the world, he is called the Fortune Spirit, manifesting as the Dark Warrior,\nIn heaven, the Star Lord, governing the *Gouchen*.\nLike the precious moon in the void,\nWherever there are clear waves, it is seen.\n\nWith devoted heart bow in homage:\nHis merits surpass the ranks of sages,\nHis virtue crowns the Two Modes.\n\nSpreading kindness, his benevolence is like spring’s growth;\nToward the ten thousand things, he responds to conditions and answers calls.\nLike the moon appearing in a thousand rivers,\nHe rescues suffering from the tiniest speck of dust,\nDelivers the multitudes from the vast kalpa.\nFather of compassion to the four kinds of birth,\nTeacher of benevolence to the three realms.\nLimitless in delivering beings,\nTogether with the Most High Lord Lao, the Primordial Emperor of Supreme Virtue.\n\nThe true parents of all beings in the three realms,\nAt the end and beginning of kalpas, he delivers heaven and humanity.\nSevering evil, revealing signs to destroy Pang Xun,\nRelieving illness, extending compassion to revive Guang Ying.\nThe Hua and Xia, the Man and Rong, all receive his transformation,\nEven insects and plants receive his grace.\nHis divided bodies respond like motes of dust,\nHis merits and virtues are beyond all praise.\n\nThe preceding litany of merits and virtues has now reached completion.\nYet seeking the Great Void in words and images,\nHow can one perceive its truth?\nExhausting the descriptions of the most exalted virtue,\nIts beauty cannot be surpassed.\nHow can the brush’s limited glimpse capture the wondrousness of the Great Purity?\nFleeting as the leopard’s glance through a tube,\nGrievous is the profanation of the dragon’s court.\n\nHaving completed this litany of praise,\nWe trust it will be received with gracious regard.\nWe, your humble servants, drill and gaze upon the mysterious wind,\nGradually polishing ourselves in its wondrous transformation.\nNot that we do not delight in embracing the One and guarding the feminine,\nBut how can we resist the dust and the rush of the world?\nThe Dao grows ever more distant,\nOur spirits ever more base—\nHow can we reach the state of inner contemplation?\nOur hearts not yet clear,\nDesires not yet dispelled—\nNo way to attain the heaven of constant stillness.\nPity these humble lives,\nWe stand lost and forlorn.\n\nWe only pray that the Compassionate Venerable,\nMoved by pity, will specially bestow his Dharma-power,\nLifting us with his strength.\nMay we repent and sever karmic ties,\nSoon escape the net of deep delusion,\nWash away accumulated habits,\nAnd all return to the wind of purity.\n\nThe assembly, with utmost sincerity,\nTogether offers repentance.\nBowing our heads, we take refuge in the Three Pure Ones above,\nThe Non-Action Teaching Master, the Primordial Venerable.\nThe Perfected Immortals of the Great Purity of Dao and Virtue,\nThe Divine Ministers of the Supreme Ultimate Cavern.\n\nWe, your servants, since the beginningless kalpa,\nHave been obscured by ignorance, greed, and love,\nVeiling our true hearts.\nSometimes violating the one thousand two hundred new precepts,\nSometimes transgressing the one hundred eighty great precepts.\nRight and wrong, self and others—\nFalse views arise.\nEmptiness and form, being and non-being—\nWe fall into the dust of Dharma.\nIn the boundless sea of desire, no discipline,\nIn the surging river of love, no shore.\nWe regret this body’s lack of constancy,\nHow often have we paused in the cycle of birth and death?\n\nBowing before the Great Compassionate Venerable One,\nwe repent and vow to attain the supreme Dao.\nAgain we address the assembly of shared karma in this Dao-field:\ncompose your minds, gather your thoughts, and reveal your true sincerity.\nUpholding the Ten Vows, we forge karmic bonds,\ndissolving the dust-like myriad sins.\n\nThe first vow: may the Sage live ten thousand years;\nthe second: may the world enjoy universal peace;\nthe third: may the Dao and virtue ever unfold;\nthe fourth: may wind and rain come in due season;\nthe fifth: may the old and young practice kindness and filial piety;\nthe sixth: may those fated to die young be spared;\nthe seventh: may the Three Wretched Realms know no suffering;\nthe eighth: may warfare cease throughout the land;\nthe ninth: may water and fire bring no harm;\nthe tenth: may plagues and pestilence not spread.\n\nSins arise from the mind—repent with the mind;\nwhen the mind is extinguished, sins too vanish.\nMind and sin both empty—\nthis is called true repentance.\n\n**Dedication**\nAll that has been offered—homage to the Perfected, confession of faults,\npraise of merits—is now complete.\nWe humbly pray that your compassion not be withheld,\nand that blessings be universally bestowed.\nMay transgressions be erased from the Black Register, sins cleansed like wind-blown dust;\nmay blessings and longevity be inscribed in the Vermilion Record, the sprouts of goodness growing daily.\nFor these supreme causes,\nwith sincere hearts we invoke the Most Manifest Transformative Heavenly Worthy,\nwhose inconceivable merits are beyond thought.\n\n**Manifest Transformation Ritual of Offering**\nProclamation of the *Guardian Spirit Mantra*, invocation of the ranks of the Dharma.\n\nBy the authority vested in this rite,\nthe Most Manifest Transformation Offering of the Great Purity is performed.\n\nThe Libationer, your minister [Name], respectfully addresses:\nthe Most High Lord Lao, Primordial Emperor of Supreme Virtue,\nthe Heavenly Worthy of Dao and Virtue of the Great Purity,\nthe Primordial Celestial Empress,\nthe Primordial Sovereign of the Great One,\nthe Lords and Elders of the Great Purity,\nthe Four Assistants and the Elder of the River,\nMaster Wen Shi,\nthe Four Phases of the Three Heavens,\nthe Divine Ministers and Assistants of the Cavernous Mystery,\nall the immortal bureaus,\nthe twelve hundred officials of the Great Purity,\nthe Golden Lads and Jade Maidens to left and right,\nthe Dragon-Tiger Lords,\nthe officials of the Three Realms,\nand all majestic spirits.\nMay your vast compassion deign to look down and perceive clearly.\n\nYour minister has heard:\nThere is a thing, chaotically formed,\nforced to be called the Dao.\n\nBeyond the realm of silence and invisibility, it exists without form or name. Yet within the boundless and indistinct, it bears image and essence, giving rise to all things. From it emerge the myriad transformations of heaven and earth; through it, the cycles of yin and yang and the four seasons attain completion. The ebb and flow of form, color, wisdom, and strength are inexhaustible; the interplay of advance and retreat, existence and extinction, deviance and rectitude knows no end. Without a sovereign governing between them, how could they endure so ceaselessly and eternally?\n\nOnly our Primordial One is the Ancestor of the Dao. Mindful that all existence is but an extension of the self, how could it not be upheld? And since all beings arise from the self, how could they be forsaken? Thus, the spirit is dispersed across kalpas, manifesting even in the tiniest speck of dust. As the Teacher of Emperors, the Teacher of Kings, and the Teacher of Lords, it endures through ten thousand generations without weariness. Establishing the Dao of Heaven, the Dao of Earth, and the Dao of Humanity, it brings harmony to the Three Powers. Its transformative influence extends to the vast and the minute, its virtue flowing unseen and revealed alike. Though all things return to it, it does not claim mastery—such is the constancy of its power. Though the people benefit from it, none can comprehend it—thus is it called great.\n\nYour minister, a humble scholar of the thatched hut, a mere straw dog among men, has long been graced by the boundless favor of creation, dwelling in the lowest ranks yet sheltered in its shadow. Though I am but a fragment of the Dao, a single manifestation of the One, and though I embody the completeness of yielding submission, knowing the masculine yet guarding the feminine, I have yet to fathom the subtlety of the Valley Spirit. Now, on this sacred occasion of the Primordial Qi’s descent, I recall that these eighty-one bodies are but the full embodiment of the Great Void, and that across seventy billion kalpas, they remain unchanged from the primordial years of the Origin. Though small and lowly, I cannot but reflect on the fleeting nature of this floating life. Moved by the compassion of the Venerable One, who bestows grace upon all sentient beings, may all return to their roots and attain the Dao of longevity. Through cultivation and the verification of practice, may we encounter the era of Great Prosperity.\n\nYour ministers now reverently offer incense and present the first libation.\n*First Libation, Proclamation of Words*\nIn accordance with the ritual text, may these words ascend to the heavens, reaching the ears of the Dao. We humbly beseech your divine compassion to deign to look upon them.\n\nWe have heard: That which is natural arises from the Dao, which does not itself generate, yet through which generation occurs—such is the wondrous function of its activity. Though it does not possess, it enables possession; though it does not have, it gives rise to the primal image. Concealed within the empty and vast, it is the perfection of truth, rooted in the Great Nothingness. Beginning without beginning, ending without end, it defies all attempts to describe the affairs of its creation. Neither bound by the present nor the past, how could it be confined to the ages of the world?\n\nYet in its role as teacher, it takes transformation as its heart, and though it does not shun the mingling of its light with the dust, it reveals its form. In the ninth year of the *chen* cycle during the reign of High Ancestor, when the Shang calendar marked the first month and the Dipper’s handle pointed to *yin*, the sun’s brilliance suddenly doubled in splendor—a sign that a perfected one would appear in the world. Eighty-one years, the ultimate number of the Great Yang; seventy-two marks, the first manifestation of the Primordial Qi. In the northern valley of Li, a radiance shone forth; in the western palace of Shu, its glory flourished. From this, its name became known, and its transformative influence spread. Seeking the Dao from the Primordial Lady, it illuminated the principle that scholars must have a teacher. Concealing its virtue as the Pillar Historian, it revealed the sage’s resolve not to abandon the world. It propagated the profound teachings in the Central Lands and expounded the floating doctrines in the Western Regions. Though the true immortals’ appearances and withdrawals were beyond the ken of the vulgar, their records and transmissions shone clearly, confirmed by the celestial scriptures without doubt.\n\nYour ministers, having heard of these signs in Qiao Prefecture and traced the ancient sites of Lai, now touch the remnants that still endure, lamenting that we were not born in that earlier age. Clutching the cypress of the courtyard, we find the chariot of the wind already distant; bathing in the sacred pool, we strain to glimpse the immortal form. Bowing before the painted image of the Perfected One, it is no different from gazing at the blue sky through clouds; examining the records of its great deeds, we grasp but the faintest trace, like the tip of a hair on Mount Tai. Our hearts are filled with longing, yet our resolve to return remains unfulfilled.\n\nNow, on the anniversary of its descent into the world, we respectfully perform the rites of celebration. Ninefold radiant nectar, white jade and patterned blossoms—we envision the immortals toasting to their eternal longevity. The Three Mysteries’ purple fruits, the crimson trees’ vermilion fruits—we recall the myriad emperors raising their cups in homage. As the banquet in the forest of rarity reaches its height, how could the impure world’s joys compare? Yet the Dao, in its compassion, engages with all things.\n\nYour ministers, moved by reverence and devotion in serving the Dao, offer our sincere intentions, not for the sake of the ritual itself, but for the sincerity it embodies. May the lofty spirits, in their luminous response, accept not the form of our offerings, but the purity of our hearts. Though our gratitude exceeds all bounds, we know not the measure of our presumption.\n\nYour ministers bow twice in reverence and offer the second libation of incense.\n*Second Libation, Presentation of the Memorial*\nWe have heard: In the Great Beginning and the Great Simplicity, there were no images, no forms—the great Dao’s origin cannot be fathomed. It gives birth to heaven and earth, empowers gods and emperors—its mysterious workings defy all description.\n\nThroughout the ages, the arts of the Dao have emerged from a hundred schools, yet Confucianism, Buddhism, and the teachings of the Yellow Emperor and Laozi stand as the Three Teachings. Though rites and music cannot be compared to the schools of names, laws, military strategy, or power, none surpass the loftiness of effortless transformation. Though the emptiness of meditation differs from the debates over hardness, whiteness, similarity, and difference, how could it compare to the responsiveness of non-action? The principles of the Numinous Treasure and the True One, the methods of the Golden Elixir and the cultivation of nature and life—these are profound indeed. In their greatest form, they can lead to transcendence; in their lesser form, they still protect families and states. The Dao is revered, its virtue esteemed; thus, it surpasses all antiquity and endures alone. Its subtlety and depth are such that mediocre minds cannot comprehend them.\n\nThe narrow-minded scholars of the world often speak recklessly, some dismissing it as heterodoxy, others condemning it as an external path. Yet what can be added to the perfection of the natural and ultimate principle? Those of limited wisdom and selfishness simply reveal their own lack of understanding.\n\nYour ministers, though unworthy and of humble station, have often recited the profound scriptures. Inspired by the teachings of the divine luminaries, we aspire to the winds of purity and seek to cleanse ourselves. We lament that the sages have departed ever further, and pity the world’s descent into baseness. Is our Dao not true? Have we not seen the customs of the ancient eras of Fuxi and Shennong? The subtle words have faded—who can now illuminate the texts of the *Yinfu* and the *Daode*?\n\nBy the blessed dawn of our Master’s sacred birth, we are entrusted with the flourishing of the Dao. We humbly pray that the world’s teachings be magnified and the ancestral winds of the lineage be reinvigorated. May the celestial scriptures of the Three Caverns be restored in full; may the supreme Dao of non-action endure through the vast kalpas. As for harmonizing with creation to achieve merit, or equaling the boundless void in longevity—these are virtues the True Venerable has long possessed, far beyond the words of this humble servant.\n\nWe bow in reverence, offering incense and completing the final libation.\n\n*After the final libation, the petition is read:*\nWe have heard: when heaven and earth unite, sweet dew descends; when Kan and Li achieve balance, the yellow sprout is born. The essence of the elixir crucible stands apart from the vulgar world—how then could the smoke and dust of the red realm befit the exalted immortals? Thus, in this rite of water offering, we emulate the ancient ritual of presenting broth. A single spoonful at dusk, drawn from the pouch to test the immortal formula; nine cycles of white snow, transmuting the bones with the remnant elixir.\n\nWith utmost devotion, we raise and present the offering.\n\n*The broth is offered, the scriptures are presented, and the deities are sent forth.*\n\nWe have heard: the numinous dwells in the indistinct, present wherever one turns; the Dao abides in emptiness, responding to every entreaty. It matches the boundless vastness of the Great Luo realm, yet stands as the august sovereign of the ten thousand existents. To seek it in form is already mistaken—how much more so to conceive of it in terms of coming and going? Yet since we, as mortals, emulate this rite, if we do not follow its traces, how can we convey our sincerity? Thus do we offer incense, flowers, lamps, and candles to express what is fitting; petitions and memorials to convey our intent. We bear the weight of your exalted scrutiny, trembling lest we incur reproach for irreverence. Now, as this rite of celebration reaches its completion, not even the swiftest pennants could hold it back. We envision the nine-rayed crane canopy descending from the azure vault; the eight-scene dragon chariot ascending through the blue firmament and returning on high. Our gaze strains toward the clouds, tears and sobs streaming down our faces. Words may end, but the heart’s intent knows no bounds; though our forms stand apart, our devotion draws near. In days of old, the white deer could still be sought at Qiao City—how might the blue ram come to Shu Prefecture in days to come? Our humble hearts overflow with longing beyond measure. With reverence, we bow our heads and send forth the deities. The palanquin turns—we chant the hymn of praise.\n\nThe Grand Clarity Rite of Dao and Virtue’s Manifest Transformation now concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太清道德显化仪 经名：太清道德显化仪。 一卷。 底本出处：《正统道藏》洞神部威仪类。 太清道德显化仪 上寿供献 宣卫灵咒，请称箓职 具职臣姓某上启太清玄元无上三天无极大道太上老君、道德天尊，圣母先天大圣后、太乙元君，太清洞神诸君丈人、上相上宰上保上傅君，三天四相宰辅卿监诸司官典，列位仙曹灵官，三界真灵。 咸望洪慈，洞回降鉴。 臣闻：太虚寥廓，上有帝乡，元炁微茫，中存道体。 乃睠太清之境，是为浩劫之家。 道炁亿万，重界鸿蒙，而是域官君千二百名，造化以为臣。 妙有妙无，惟恍惟忽。 功虽不宰，由仁民爱育而功施； 迹本难穷，因垂世立教而边显。 臣某窃稽纪传，妄测圣神。 昔武丁恭巳之九年，当斗柄建寅之望日。 谓混元之诞，实在兹辰。 故贺典之修，盛行于世。 此特表人心向慕云尔，乌足为圣德光益者哉。 今之日，弟子某等，欣戴深深，歌咏不已。 辟清坛而设醮，趋丹陛以称觞。 伏愿不弃贱微，特回宴蠁。 青牛紫炁，俨如度函谷之时； 白马朱鬃，宛若降茅山之日。 群真共会，一念潜通。 臣等瞻望天阶，不胜凝俟之至。 谨稽首再拜，奉请。 请圣",
      "translated_text": "*The Ritual of the Manifestation of the Dao and Virtue of the Great Clarity*\n\n**Scripture Title:** *The Ritual of the Manifestation of the Dao and Virtue of the Great Clarity*. One fascicle. Source text: *Daoist Canon of the Zhengtong Era*, \"Worship and Ritual\" category of the *Dongshen* section.\n\n**The Ritual of the Manifestation of the Dao and Virtue of the Great Clarity**\n**Offering Longevity and Sacrifices**\n\nRecite the *Guardian Spirit Incantation*, invoke the register of ranks, and declare the officiant’s title:\n\n*\"Your servant, [Name], humbly addresses the Most High, the Primordial and Boundless Three Heavens, the Peerless Great Dao, the Supreme Lord Lao, the Heavenly Worthy of Dao and Virtue; the Holy Mother, the Great Sage of the Prior Heaven; the Primordial Sovereign of the Great Monad; the Lords, Masters, and Elders of the Great Clarity and the Cavernous Spirit; the Ministers, Chancellors, and Governors of the Three Heavens and Four Quarters; the Officials and Clerks of the Celestial Bureaus; and the Perfected and Spirits of the Three Realms.*\n\n*May your vast compassion turn and cast its gaze upon us.*\n\nYour servant has heard: The Great Void is vast and boundless, and above lies the Celestial Realm. The primordial qi is subtle and faint, yet within it abides the essence of the Dao. Gazing upon the realm of the Great Clarity, it is the home of the infinite kalpas. The qi of the Dao spans myriad eons, layered across the vastness of primordial chaos. Here, the lords of this domain number one thousand two hundred, who serve as ministers of creation. From wondrous being to wondrous non-being, it is ever elusive and indistinct. Though the Dao does not govern, its power is manifest through the nurturing of the people; though its traces are unfathomable, its teachings are made evident for the sake of the world.\n\nYour servant, in humble study of the records, presumes to glimpse the sacred and divine. In the ninth year of King Wuding’s reverent reign, on the full moon when the Dipper’s handle pointed to *yin*, it was said that the birth of the Primordial One occurred on this very day. Thus, the celebration of this rite has flourished in the world. Yet this merely expresses the longing of human hearts—how could it truly enhance the radiance of the sagely virtue?\n\nToday, your disciples, [Names], rejoice and revere with deepest devotion, singing praises without end. We open the pure altar and prepare the offering, hastening to the cinnabar steps to raise our cups. We humbly pray that you will not disdain our lowliness but deign to turn your gaze upon us. May the Azure Ox and the Purple Qi appear as they did when crossing the Han Valley; may the White Horse with Crimson Mane descend as on the day of Mount Mao. May the host of perfected ones gather, and a single thought reach you in secret.\n\nYour servants gaze upon the celestial steps, overwhelmed with reverent anticipation. With utmost sincerity, we bow twice and prostrate ourselves, offering this invocation. We beseech the presence of the sages.\"*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 453,
      "start_sentence": 0,
      "end_sentence": 28,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.205514907836914,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太清道德显化仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "志心谨谨，奉请太清太上天帝君、太清天帝丈人、太清九老仙都君、太清九炁丈人、上相方诸宫青童君、上宰西城总真王君、上保太丹南极元君、上傅白山宫太素元君、玄中大法师河上丈人、文始先生尹真人、泰玄上相张真君、天机上相葛真君、天枢上相许真君、佥书上相浮丘真君、上元大有真人、中元太极仙翁、下元太清仙伯、洞神太极上相、洞神太极仙伯、洞神太玄上仙、统洞神三天护法都帅、洞神九天大兵统、洞神太微仆射、洞神太极仆射、洞神木部尚书、洞神火部尚书、洞神金部尚书、洞神水部尚书、洞神土部尚书、洞神太微护兵大卿、洞神太极益算大卿、洞神紫府上仙大卿、洞神大仙仙威监、洞神太极上仙大夫、洞神三天斩妖护尉、洞神碧虚上仙大卿、洞神九天保命上仙监、洞神紫微七政大监、洞神金阙盟威大监、洞神扶桑旸谷大监、洞神太极上仙监、洞神玄都仙令大监、洞神太极仙府兵录、洞神九天护府司直、洞神九天云雾大监、洞神紫府校尉、洞神明六明虚真监、洞神八极仙都护尉、洞神北极大监、洞神太极总神都司君、太清千二百官君、太清上章诸宫曹官、太清左右侍香金童玉女、太清左右侍卫龙虎君、琅琅干真人、嵩山寇真人、太清历代授道真人、太清开化三界神仙、日直香官使者、当境土地正神。 降圣 臣等诚惶诚恐，稽首顿首，再拜谨谨，奏请太清玄元无上三天无极大道太上老君、道德天尊。 臣等恭望洪慈，流光宝座。 太清乐引 臣等不揣凡愚，僭邀天仗。 伏想神龙骖驾，天马启途，十二卫官以前呵，九万飞仙而后从。 流霄建节，云霞浮十绝之旛； 大辂鸣銮，日月耀五明之扇。 臣等挹瑞彩於上古，依末光於中天。 采一事之奇可，极铺张之美陈。 七珍之供愿，将庆贺之仪。 臣等无任稽首再拜、舞蹈之至。 步虚 宝座临金殿，霞光照玉轩。 万真朝帝所，飞舄蹑云根。 臣闻：昔既诞於仙姿，盖先陈於神水。 挹东井黄华之沼，体发金光； 注西华流汨之池，身生玉泽。 一自九龙之荐瑞，遂令千古以为荣。 兹取其名，载扬厥美。 衍灵溪之一脉，流泽何穷； 分东井之余波，飞仙可托。 臣等仰对道前，谨伸上献。 法源流润天尊 献香 臣闻：在道之中，惟香是尚。 出清微者名解脱，有济幽度显之功； 产聚窟者号返生，有起死回骸之妙。 盖功非在物，而在德； 亦闻不以鼻，而以心。",
      "translated_text": "With utmost sincerity and reverence, we humbly invoke:\nThe Most High Heavenly Emperor of Great Clarity,\nThe Heavenly Elder of Great Clarity,\nThe Nine Elders of the Immortal Capital of Great Clarity,\nThe Nine Qi Elders of Great Clarity,\nThe Azure Youth of the Fangzhu Palace, Supreme Minister,\nThe King of Total Perfection of the Western City, Supreme Chancellor,\nThe Primordial Sovereign of the Southern Culmen, Supreme Guardian,\nThe Primordial Sovereign of Supreme Simplicity of the White Mountain Palace, Supreme Tutor,\nThe Great Dharma Master of the Mysterious Center, the Riverbank Elder,\nMaster Yin the Perfected of Wenshi,\nThe Supreme Minister Zhang the Perfected of Grand Mystery,\nThe Supreme Minister Ge the Perfected of Heavenly Mechanism,\nThe Supreme Minister Xu the Perfected of Heavenly Pivot,\nThe Supreme Minister Fuqiu the Perfected, Recorder,\nThe Great Perfected of Supreme Origin of the Upper Epoch,\nThe Immortal Elder of Grand Culmen of the Middle Epoch,\nThe Immortal Earl of Great Clarity of the Lower Epoch,\nThe Supreme Minister of Grand Culmen of the Cavernous Divine,\nThe Immortal Earl of Grand Culmen of the Cavernous Divine,\nThe Supreme Immortal of Grand Mystery of the Cavernous Divine,\nThe Marshal General Protecting the Three Heavens of the Cavernous Divine,\nThe Commander of the Nine Heavens’ Great Armies of the Cavernous Divine,\nThe Chamberlain of the Grand Culmen of the Cavernous Divine,\nThe Chamberlain of the Grand Culmen of the Cavernous Divine,\nThe Minister of the Wood Department of the Cavernous Divine,\nThe Minister of the Fire Department of the Cavernous Divine,\nThe Minister of the Metal Department of the Cavernous Divine,\nThe Minister of the Water Department of the Cavernous Divine,\nThe Minister of the Earth Department of the Cavernous Divine,\nThe Grand Minister Protecting the Armies of the Grand Culmen of the Cavernous Divine,\nThe Grand Minister of Prolonged Calculation of the Grand Culmen of the Cavernous Divine,\nThe Grand Minister of the Supreme Immortals of the Purple Palace of the Cavernous Divine,\nThe Inspector of Immortal Might of the Great Immortals of the Cavernous Divine,\nThe Grand Master of the Supreme Immortals of the Grand Culmen of the Cavernous Divine,\nThe Guard Captain Slaying Demons of the Three Heavens of the Cavernous Divine,\nThe Grand Minister of the Azure Void of the Cavernous Divine,\nThe Inspector of Life-Preserving Supreme Immortals of the Nine Heavens of the Cavernous Divine,\nThe Grand Inspector of the Seven Governors of the Purple Tenuity of the Cavernous Divine,\nThe Grand Inspector of the Alliance Might of the Golden Watchtower of the Cavernous Divine,\nThe Grand Inspector of the Yang Valley of Fusang of the Cavernous Divine,\nThe Grand Inspector of the Supreme Immortals of the Grand Culmen of the Cavernous Divine,\nThe Grand Inspector of the Immortal Decrees of the Mysterious Capital of the Cavernous Divine,\nThe Registrar of the Immortal Armies of the Immortal Courts of the Grand Culmen of the Cavernous Divine,\nThe Censor Protecting the Courts of the Nine Heavens of the Cavernous Divine,\nThe Grand Inspector of the Clouds and Mists of the Nine Heavens of the Cavernous Divine,\nThe Captain of the Purple Palace of the Cavernous Divine,\nThe Inspector of the Sixfold Clarity of the Cavernous Void of the Cavernous Divine,\nThe Guard Captain of the Eight Poles and Immortal Capitals of the Cavernous Divine,\nThe Grand Inspector of the Northern Culmen of the Cavernous Divine,\nThe Lord Controller of the Divine Assemblies of the Grand Culmen of the Cavernous Divine,\nThe Twelve Hundred Officials of Great Clarity,\nThe Court Officials of the Petition Offices of Great Clarity,\nThe Golden Lads and Jade Maidens Attending Incense on the Left and Right of Great Clarity,\nThe Dragon and Tiger Lords Attending Guards on the Left and Right of Great Clarity,\nThe Perfected Langganzhen,\nThe Perfected Kou of Mount Song,\nThe Perfected Who Have Received the Dao Through the Ages of Great Clarity,\nThe Divine Immortals Who Enlightened the Three Realms of Great Clarity,\nThe Envoys of the Incense Office of the Day,\nThe Local Earth Deities of the Present Realm.\n\nDescend, O Sages!\n\nWith awe and trepidation, we bow our heads and prostrate ourselves, humbly invoking the Most High Lord Lao, the Supreme Venerable of the Dao, the Heavenly Worthy of Virtue and Power, of the Boundless Great Dao of the Three Heavens of Great Clarity and Primordial Origin.\n\nWe reverently await your boundless compassion, that your radiant presence may grace the jeweled throne.\n\nThe Celestial Procession\n\nUndaunted by our mortal folly, we presumptuously summon the heavenly retinue. We envision the divine dragons harnessed to your chariot, the celestial steeds clearing the path, the twelve guardian officials leading the way with their cries, and the ninety thousand flying immortals following behind. Banners of tenfold splendor float upon the clouds and mist; the great carriage rings with jade bells, while fans of fivefold brilliance gleam with the light of sun and moon. We draw upon the auspicious omens of antiquity and rely upon the faintest glimmer of your presence in the midst of heaven. Selecting but one marvel from the myriad wonders, we strive to adorn our offering with the utmost magnificence. May the seven treasures of our devotion serve as tokens of our celebratory rites.\n\nWe bow our heads and prostrate ourselves, overwhelmed with reverence and awe.\n\nThe Hymn of Pacing the Void\n\nThe jeweled throne descends upon the golden hall,\nIts radiance illumines the jade portico.\nTen thousand Perfected gather at the Emperor’s abode,\nTheir flying sandals treading the roots of clouds.\n\nWe have heard: of old, your immortal form was first bathed in the divine waters. Drawing from the Yellow Flower Pool of the Eastern Well, your hair emanated golden light; pouring from the Flowing Gush Pool of the Western Hua, your body was suffused with jade-like luster. Since the nine dragons first offered their auspicious tribute, this has brought glory through the ages. Now we take up this name and extol its excellence. Extending the lineage of the Spirit Stream, its beneficence knows no end; dividing the afterwaves of the Eastern Well, flying immortals may find refuge therein.\n\nBefore the Dao, we humbly present our offering.\n\nThe Flowing Grace of the Dharma Source, the Heavenly Worthy\n\nThe Offering of Incense\n\nWe have heard: within the Dao, incense alone is esteemed. That which issues from the Pure Subtlety is called Liberation—it possesses the power to deliver the hidden and manifest. That which grows in the Grotto of Assembly is named Return to Life—it holds the marvel of reviving the dead and restoring the bones. Yet its efficacy lies not in the substance itself, but in its virtue. We also know that it is not perceived by the nose, but by the heart.",
      "overlap_context": "r lowliness but deign to turn your gaze upon us. May the Azure Ox and the Purple Qi appear as they did when crossing the Han Valley; may the White Horse with Crimson Mane descend as on the day of Mount Mao. May the host of perfected ones gather, and a single thought reach you in secret.\n\nYour servants gaze upon the celestial steps, overwhelmed with reverent anticipation. With utmost sincerity, we bow twice and prostrate ourselves, offering this invocation. We beseech the presence of the sages.\"*",
      "start_char": 453,
      "end_char": 1371,
      "start_sentence": 29,
      "end_sentence": 59,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.26379370689392,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太清道德显化仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "若人间卉木之为馨，岂天上神仙之所欠。 然礼以少为贵者，物取其奇，则诚之不可掩夫，天其可享。 臣等仰对道前，谨伸上献。 香云结篆天尊 献花 臣闻：仙苑群芳，奇花万种。 常旸日窟，仰攀若木之华； 玄圃骞林，采撷空青之蕊。 繁英吐而灵风昼永，朱紫艳而道日春融。 盖非凡世之色香，宜备至尊之赏玩。 把琼芳於席上，愿奉天欢； 化宝盖於空中，同依道荫。 臣等仰对道前，谨伸奉献。 琼英绚彩天尊 献烛 臣闻：原灯烛之虽微，济阴阳之不及。 兰膏继晷，吐朱焰之荧荧； 阳燧取精，扬丹辉之耀耀。 乃若太清之仙境，岂资爝火之余光。 义或取於报阳，礼宜供於列炬。 臣心如此，鉴一点之长明； 道力发之，徧十方而洞照。 臣等仰对道前，谨伸奉献。 慧光无碍天尊 献茶 臣闻：凡卉木神奇之品，皆真仙服食之腴。 七明石芝，西锡昆吾之贡； 十结神草，北来空洞之深。 况道家之众药尤多，岂人世之一茶足羡。 然以奉至尊之寿，固宜效所贵之仪。 蓬莱山有三，敢自诧通仙之妙； 上清品第一，尚有希换骨之仙。 臣等仰对道前，谨伸奉献。 灵通品量天尊 献酒 臣闻：大驾昔游於四极，寿觞争献於群仙。 东海青童，奉碧醴金津之宴； 九天上帝，开云浆月液之筵。 琼花贡自朱陵，甘液来从紫府。 遐想当年之美，再修今日之仪。 援北斗，酌天浆，上奉九重之春色； 酿西江，为寿酒，愿同六合於醉乡。 臣等仰对道前，谨伸奉献。 玉光浮润天尊 献果",
      "translated_text": "If the fragrance of mortal flowers and trees could suffice, how could the divine immortals of heaven lack such? Yet in ritual, rarity is prized—when the offering is extraordinary, its sincerity cannot be concealed, and thus heaven may receive it. We, your servants, humbly present our offering before the Dao.\n\n**Cloud-Script Celestial Worthy of Fragrant Offerings**\n\n**The Offering of Flowers**\n\nWe have heard: in the immortal gardens, myriad blossoms flourish in countless varieties. From the sunlit caverns of Everlasting Day, one plucks the blooms of the Ruo Tree; from the soaring forests of the Dark Garden, one gathers the azure stamens of the Void-Blue. Their lush petals unfurl, and the spirit-winds lengthen the day; their crimson and violet hues glow, and the Dao’s sun melts into spring. These are no common colors or scents of the mortal world—they are fitting for the highest veneration. Placing these jadelike blossoms upon the mat, we pray to bring joy to heaven; transforming them into jeweled canopies in the void, we seek shelter beneath the Dao’s shade. We, your servants, humbly present our offering before the Dao.\n\n**Radiant Jade-Bloom Celestial Worthy**\n\n**The Offering of Candles**\n\nWe have heard: though lamps and candles may seem small, they remedy what yin and yang cannot reach. Orchid-oil wicks extend the daylight, exhaling flickering crimson flames; the sun-mirror gathers essence, casting forth radiant vermilion glow. Yet in the immortal realms of the Great Clarity, how could such feeble light be needed? Still, the meaning may lie in repaying the sun’s grace, and thus ritual demands the offering of rows of torches. Our hearts are thus—we seek the enduring brightness of a single flame; the Dao’s power manifests it, illuminating the ten directions with boundless light. We, your servants, humbly present our offering before the Dao.\n\n**Unobstructed Wisdom-Light Celestial Worthy**\n\n**The Offering of Tea**\n\nWe have heard: among the wondrous plants of the world, all are the nourishment of the perfected immortals. The Seven-Luminous Stone Fungus, tribute from the Kunwu of the West; the Ten-Knotted Divine Herb, borne from the depths of the Northern Void. How much more do the many medicines of the Dao surpass them—how could mortal tea alone be worthy of admiration? Yet in offering it to the Most High, we duly perform the revered rites. The Penglai Mountains number three—dare we boast of its transcendent wonders? In the Upper Clarity, it ranks first—yet still there are those who seek the elixir to transform their bones. We, your servants, humbly present our offering before the Dao.\n\n**Spirit-Pervading Measure Celestial Worthy**\n\n**The Offering of Wine**\n\nWe have heard: when the Great Chariot once journeyed to the Four Limits, the immortals vied to present their longevity cups. The Azure Lad of the Eastern Sea offered the feast of Jade Nectar and Golden Springs; the Nine Heavens’ Lord opened the banquet of Cloud Brew and Moon Essence. Jade blossoms were tribute from Vermilion Mound; sweet dew flowed from the Purple Palace. Recalling the splendor of those bygone days, we renew the rites today. Raising the Northern Dipper, we pour the celestial draught, offering the spring’s joy to the ninefold heavens; brewing the Western River, we craft the wine of longevity, praying all under heaven may share in the intoxication of bliss. We, your servants, humbly present our offering before the Dao.\n\n**Jade-Light Floating Luminance Celestial Worthy**\n\n**The Offering of Fruit**",
      "overlap_context": "ce, the Heavenly Worthy\n\nThe Offering of Incense\n\nWe have heard: within the Dao, incense alone is esteemed. That which issues from the Pure Subtlety is called Liberation—it possesses the power to deliver the hidden and manifest. That which grows in the Grotto of Assembly is named Return to Life—it holds the marvel of reviving the dead and restoring the bones. Yet its efficacy lies not in the substance itself, but in its virtue. We also know that it is not perceived by the nose, but by the heart.",
      "start_char": 1371,
      "end_char": 1958,
      "start_sentence": 60,
      "end_sentence": 104,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.340571641921997,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太清道德显化仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "臣闻：乘舆，昔巡狩之时； 仙果，省职方之贡。 九灵西母，进金紫之交黎； 南极夫人，上赤灵之火枣。 东掇扶桑之椹，北收空洞之瓜。 想遗美之如存，效凡仪而有献。 颂三千岁，方成之实，未足为多； 得七百年，不汗之枝，愿言分赐。 臣等仰对道前，谨伸奉献。 宛味希夷天尊 进疏 臣闻天地之德，固无待於形容； 日月之光，又何加於绘画。 况大道在名言之表，而重玄超思议之前。 虽喻以尘沙万劫，测量而莫尽； 岂形诸案牍一言，褒赞之能详。 盖露表之云云，实风刀之凛凛。 河海於细流，不择恃此无虞； 天地之大德，日生受之必至。 所陈丹悃，谨用上闻。 宣疏，宣关，向来，回向 显化礼文 步虚",
      "translated_text": "We, your servants, recall: when the imperial chariot once made its sacred progress, immortal fruits were presented as tribute from the provincial domains. The Queen Mother of the West, sovereign of the Nine Numinous Ones, offered the golden-purple *jiaoli*; the Lady of the Southern Culmen proffered the vermilion-spirit *huozao*. From the east were plucked the mulberries of Fusang; from the north were gathered the gourds of the Hollow Cavern. As we cherish the lingering beauty of those bygone days, we emulate the mortal rites with our humble offering. Though the fruit that takes three thousand years to ripen is not deemed abundant, and the branch that bears for seven hundred years without flaw is scarce, we pray these may be graciously bestowed. We, your servants, humbly present our offering before the Dao.\n\n**Celestial Worthy of Rare and Subtle Savors**\n\n**The Presentation of Vegetable Offerings**\nWe, your servants, recall: the virtue of heaven and earth requires no form or likeness; the radiance of sun and moon needs no embellishment of painting. How much more does the Great Dao reside beyond names and words, and the Profound Mystery transcend the bounds of thought? Though one may compare it to the sands of ten thousand kalpas, its measure remains unfathomable; how could a single phrase upon these tablets ever suffice to praise it in full? Yet the clouds of dew’s revelation are indeed majestic, and the wind’s blade truly awe-inspiring. Just as rivers and seas do not scorn the smallest streams, trusting in this boundless assurance, so too does the great virtue of heaven and earth daily bestow its blessings without fail. With these sincere words of red devotion, we humbly make them known.\n\nProclaim the petition, open the passage, return to the origin, and dedicate the merit.\n**Manifestation of Ritual Texts**\n**Pacing the Void**",
      "overlap_context": "lion Mound; sweet dew flowed from the Purple Palace. Recalling the splendor of those bygone days, we renew the rites today. Raising the Northern Dipper, we pour the celestial draught, offering the spring’s joy to the ninefold heavens; brewing the Western River, we craft the wine of longevity, praying all under heaven may share in the intoxication of bliss. We, your servants, humbly present our offering before the Dao.\n\n**Jade-Light Floating Luminance Celestial Worthy**\n\n**The Offering of Fruit**",
      "start_char": 1958,
      "end_char": 2241,
      "start_sentence": 105,
      "end_sentence": 127,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.840370655059814,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太清道德显化仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "臣闻：状太虚之体，虽至人莫叩其端倪； 圆日月之容，纵巧匠难施其光彩。 恭惟太清仙境、太上老君、混元上德皇帝、道德天尊玉陛下。 生於无极之先，出於太虚之上。 匪有匪无，匪声匪色，独为至道之宗； 能长能短，能方能圆，莫名万物之母。 大包宇宙，细入毫芒。 巍巍荡荡，无能名； 昏昏默默，不可识。 粤自洪源肇启，玄化潜流。 高卑奠清浊之形，动静制刚柔之体。 风雷山泽，联八卦以相生； 春夏秋冬，运四时而不忒。 日月星辰，丽乎上； 人民品物，生其间。 总总林林，生生化化，此则运元炁而开天地者也。 及其九皇既立，历代相承。 乃降世以为师，遂因时而设教。 陈纲立纪，经论天下之大经； 利用厚生，成就生民之众务。 此则随世代而立人道者也。 然后建道德之宗旨，作清虚之法程。 七部妙经，随三乘而接引； 九还丹诀，付上士以修行。 间陈礼乐之原，或演浮屠之学。 本末毕具，精粗备陈。 万法千门，一致百虑，此则顺时俗而立教化者也。 以至分形三界，应迹十方。 或耀魄勾陈，上理星象。 或韬光柱史，下佐国家。 指白骨以成人，救洪灾而度劫。 扶危拯难，无感不通，济死度生。 有缘者遇此，则亘古今而度人无量者也。 故神通辉赫，功德崇高。 在天为万圣之尊，在世为三教之长。 三十六天、三十六地，咸归掌握之中； 八十一岁、八十一身，始显化生之迹。 神明不能极其妙，圣智不能穷其源。 虽万声万舌而赞扬，穷劫难尽； 若一话一言之陈述，於道何裨。 以今臣与弟子某等，望沧海以神流，瞻泰山之目极，不量诳惑，辄效褕扬。 取圣号以为纲，删成九礼； 摘仙经而颂美，十不一存。 惟其极爱敬之深，不自觉文辞之陋。 伏愿道心默感，天鉴潜通。 以涓尘琐琐之言，固毋足采； 然江海汪汪之量，何所不容。 臣等各运诚心，共宣妙范。 举，按人各恭敬 志心皈命礼，杳冥昏默，冥寂玄通。 粤从空洞无本，太空为道体； 初发玄元始凝，祖炁立天根。 造化三才，开张万范，处无象无形之内，居太初太易之前。 神宝丈人，众和太上老君、混元上德皇帝。 恍惚杳冥中有象，上无复祖道为尊。 包含造化运阴阳，剖琢虚无立天地。 上辅大罗元始化，中弘灵宝道君风。 尊居太清太极宫，是号无为大道主。 志心皈命礼，凿开混沌，剖破玄黄。 道炁混凝，由大罗而生三境； 元纲流演，从祖劫而化生诸天。 上列九霄，下分三界，立境界之修品，奠真仙之奥区。 徧及大千，成宗皇一。 万天教主，众和太上老君，混元上德皇帝。 一自洪蒙流梵炁，便从祖劫立天根。 五千五百亿重天，三洞三十六部教。 各从境界明修品，悉为真仙第等阶。 天人真圣尽师承，功德巍巍超万劫。 志心皈命礼，降九皇而设教，委历代以为师。 自伏羲以至周康，阅世者数万余载，始郁华而终郭叔，称子者十有五名。 体元长仁，开物成务，示百王之轨范，作万古之楷模。 历代帝王师，众和太上老君、混元上德皇帝。 皇帝王风随世立，通玄盘古古先生。 郁华广寿大成称，广成随应赤精号。 录图务成尹寿列，真行锡则燮邑名。 育成经成郭叔终，历代为师兹可述。 志心皈命礼，因机立化，随劫度人。 道德五千余言，开辟金丹之祖； 符箓千五百卷，流传正一之宗。",
      "translated_text": "Minister humbly observes: To depict the form of the Great Void, even the perfected ones cannot fathom its bounds; to capture the radiance of the sun and moon, even the most skilled artisans cannot render their brilliance. Reverently we consider the Supreme Clarity’s immortal realm, the Most High Lord Lao, the Primordial Emperor of Supreme Virtue, the Jade Sovereign of the Dao and Virtue. Born before the limitless, emerged above the Great Void, neither existent nor nonexistent, neither sound nor form, uniquely the source of the supreme Dao; able to be long or short, square or round, the unnamed mother of the myriad things. Vastly encompassing the cosmos, subtly entering the finest hairtip. Towering and boundless, beyond all naming; dim and silent, beyond all knowing.\n\nFrom the primal origin’s first stirring, the mysterious transformation flowed in secret. High and low established the forms of purity and turbidity; movement and stillness governed the bodies of hardness and softness. Wind and thunder, mountains and marshes linked the eight trigrams in mutual generation; spring and summer, autumn and winter turned the four seasons without error. Sun, moon, and stars adorned the heavens above; people and all beings thrived between. Multitudinous and teeming, endlessly transforming—this is how the primordial qi was set in motion to open heaven and earth.\n\nWhen the Nine August Ones had arisen and dynasties succeeded one another, he descended into the world as teacher, adapting his teachings to the times. He established the great principles and set the records, scriptures becoming the world’s grand canon; he benefited use and enriched life, accomplishing the multitudes’ affairs. This is how he established the human Dao through the ages.\n\nThereafter he founded the guiding principles of Dao and virtue, creating the methods of purity and emptiness. The sevenfold wondrous scriptures guided beings through the three vehicles; the nine-return elixir formulas were entrusted to advanced practitioners for cultivation. At times he expounded the origins of ritual and music, at others he expounded the teachings of the floating [Buddhist] doctrine. From root to branch, from essence to coarse manifestation, all was complete. A thousand methods, ten thousand gates, yet all converged in a hundred considerations—this is how he established teachings and transformations in accord with the customs of the times.\n\nExtending his form through the three realms, manifesting traces in the ten directions: sometimes illuminating the Pole Star to govern celestial patterns, sometimes concealing his radiance as a pillar of history to assist the state. He pointed to white bones and made them human, saved beings from flood and delivered them from kalpas. Aiding the imperiled, rescuing the distressed, no response failed to reach; delivering the dead, saving the living. Those with karmic affinity who encountered this were delivered across ancient and modern times in measureless numbers.\n\nThus his numinous power blazes resplendent, his merit and virtue tower sublime. In heaven he is the honored one among the myriad sages; in the world he is the leader of the three teachings. The thirty-six heavens and thirty-six earths all lie within his grasp; eighty-one years and eighty-one bodies first revealed his transformative traces. Neither divine intelligence nor sagely wisdom can exhaust his wonders or plumb his source. Though ten thousand voices and tongues extol him, even through kalpas unending they cannot complete the task; if but a single word or phrase were uttered in description, what benefit would it bring to the Dao?\n\nNow this minister and disciples such as so-and-so, gazing toward the azure sea with spirit flowing, beholding Mount Tai with eyes straining, recklessly and deludedly attempt to offer praise. Taking the sacred titles as their framework, they distilled nine rites; selecting from the immortal scriptures to sing praises, preserving not even one in ten. Only in the depth of their utmost reverence did they fail to notice the crudeness of their words.\n\nWe humbly pray that the Dao-heart silently respond, that heavenly insight secretly perceive. Though these trivial and fragmentary words are surely unworthy of notice, yet the vast and boundless measure of the rivers and seas accepts all without exception. Each of us moves with sincere heart, together proclaiming the wondrous model.\n\nRaise, and let each person reverently\nWith devoted heart bow in homage:\nVast and dim, obscure and silent, darkly merging with the mysterious.\nFrom the beginning, empty and without root, the Great Void as the body of the Dao;\nFirst issuing forth, the primordial qi congealed, the ancestral qi established the root of heaven.\nCreating the three powers, unfolding the ten thousand patterns,\nDwelling within the imageless and formless, abiding before the Grand Beginning and Grand Simplicity.\nDivine Treasure Venerable, together with the Most High Lord Lao, the Primordial Emperor of Supreme Virtue.\nIn the midst of the indistinct and obscure, a form appeared;\nAbove, no further ancestral Dao to surpass him as honored one.\nEmbracing and containing creation, moving yin and yang,\nCarving and chiseling the formless to establish heaven and earth.\nAbove assisting the Great Luo’s Primordial Beginning’s transformation,\nIn the middle propagating the Numinous Treasure Dao Lord’s wind.\nRevered dwelling in the Supreme Clarity’s Grand Ultimate Palace,\nHe is called the Lord of the Great Dao of Non-Doing.\nWith devoted heart bow in homage:\nBreaking open the primordial chaos, splitting the mysterious and the yellow.\nThe Dao-qi congealed and mixed, from the Great Luo generating the three realms;\nThe primordial net unfolded, from the ancestral kalpa transforming and giving birth to the myriad heavens.\nAbove arrayed the nine skies, below divided the three realms,\nEstablishing the realms of cultivation, founding the sacred immortals’ mysterious regions.\nPervading the great chiliocosm, completing the lineage of the August One.\nLord of the Ten Thousand Heavens, together with the Most High Lord Lao, the Primordial Emperor of Supreme Virtue.\nEver since the primordial qi flowed in the vast expanse,\nFrom the ancestral kalpa the root of heaven was established.\nFive thousand five hundred billion layers of heavens,\nThree Caverns and thirty-six divisions of teachings.\nEach according to their realm clarifying the stages of cultivation,\nAll becoming the ranks and grades of perfected immortals.\nHeavenly beings, perfected sages, all took him as teacher;\nHis merit and virtue towering, surpassing ten thousand kalpas.\nWith devoted heart bow in homage:\nDescending in the age of the Nine August Ones to establish teachings,\nEntrusting successive generations as teacher.\nFrom Fuxi to King Kang of Zhou,\nSpanning more than ten thousand years of the world,\nBeginning with Yuhua and ending with Guoshu,\nThose called “Master” numbered fifteen.\nEmbodying the primordial and extending benevolence,\nOpening things and accomplishing affairs,\nDemonstrating the model for a hundred kings,\nBecoming the standard for ten thousand ages.\nTeacher of emperors and kings through the ages,\nTogether with the Most High Lord Lao, the Primordial Emperor of Supreme Virtue.\nThe imperial kingly wind established according to the age,\nTongxuan, Pangu, the ancient firstborn.\nYuhua, Guangshou, the great accomplishment named,\nGuangcheng, responding to circumstances, the Red Essence titled.\nLu Tu, Wucheng, Yin Shou listed,\nZhenxing, Xize, Xieyi named.\nYu Cheng, Jing Cheng, Guoshu the last—\nThrough the ages as teacher, this can be recounted.\nWith devoted heart bow in homage:\nResponding to conditions to establish transformations,\nDelivering beings according to the kalpa.\nThe *Dao and Virtue* of five thousand words,\nOpening the ancestor of the golden elixir;\nThe talismanic scriptures of fifteen hundred scrolls,\nTransmitting the lineage of the Orthodox Unity.",
      "overlap_context": "ull? Yet the clouds of dew’s revelation are indeed majestic, and the wind’s blade truly awe-inspiring. Just as rivers and seas do not scorn the smallest streams, trusting in this boundless assurance, so too does the great virtue of heaven and earth daily bestow its blessings without fail. With these sincere words of red devotion, we humbly make them known.\n\nProclaim the petition, open the passage, return to the origin, and dedicate the merit.\n**Manifestation of Ritual Texts**\n**Pacing the Void**",
      "start_char": 2241,
      "end_char": 3503,
      "start_sentence": 128,
      "end_sentence": 206,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.99884819984436,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太清道德显化仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "教同出而异名，道并行而不悖。 天人仰赖，仙圣依归，玄中大法师，众和太上老君、混元上德皇帝。 化身静老初行教，东国君臣得度多。 道归文尹显金丹，法付天师明正一。 真多宋伦傅炼养，谦之干吉得经科。 枇糠陶铸几神仙，万古玄风长不泯。 志心皈命礼，阐真一旨，开不二门。 通礼乐之原，明道德之归。 东鲁起见龙之叹，设泥洹之果，演浮屠之教； 西胡来乘象之迎，自号古先生，时称隐君子，名虽鼎立，德并川流。 三教宗师，众和太上老君、混元上德皇帝。 粤自殷周初显迹，周流夏世立规程。 八十一国变胡风，九百余年明道化。 宣圣闻风师礼乐，烦陀稽首受浮屠。 乃知三教本同归，后学纷纷徒自苦。 志心皈命礼，道通古始，德妙玄同。 上为皇，下为王，得之则可内治身，外治国，无所不宜。 兼阴阳名法儒墨之长，极古今治乱天人之辩。 深矣远矣，至大顺； 恍兮忽兮，归无名。 道德天尊，众和太上老君、混元上德皇帝。 道德二篇初降世，百家众说总陈言。 虚心实腹混希夷，复命归根守玄牝。 无为无欲归清静，常德常名贵自然。 修齐治平特其余，今古神仙从此得。 志心皈命礼，以无入有，委炁成形。 自郁单六炁，电之祥，难穷载劫； 迨天水五色，珠之梦，始现其身。 一从白鹿以升天，再显青羊而降蜀。 非迹之迹，自然而然。 降生天尊，众和太上老君、混元上德皇帝。 众仙捧日从天下，五色流珠结圣胎。 历年九九应乾元，诞日五三符洛数。 得姓元因攀李树，出尘生即步莲花。 天上天下独为尊，相好端严俱第一。 志心皈命礼，变化无方，神通莫测。 或为千二百，老子应现诸天。 或为百八十，道君接引凡界。 号不专於三十六号，名非止於七十二名。 虽法身充满，如虚空而妙体，本来常湛寂，混沌万变。 众和太上老君、混元上德皇帝。 妙体本来归至一，化身千百未为多。 春为上景夏老翕，秋化神光冬童子。 世号福神现玄武，天称星主理句陈。 譬如宝月在虚空，凡有澄波无不见。 志心皈命礼，功高列圣，德冠两仪。 布惠行，仁如春生； 於万物，随机赴感。 似月现於千江，拯苦难於微尘，济黎元於浩劫。 四生慈父。 三界仁师。 无量度人，众和太上老君、混元上德皇帝。 三界众生真父母，劫终劫始度天人。 翦凶示相灭庞勋，救疾垂慈起光映。 华夏蛮戎俱受化，昆虫草木亦蒙恩。 分身应化若微尘，功德赞扬莫能尽。 上来礼赞功德，已遂周成。 盖以求太虚於言象，恶睹其真； 尽盛德之形容，难加其美。 尸太清之为妙，岂副墨之能知。 藐然豹管之窥，甚矣龙墀之渎。 既周赞礼，谅沐鉴观。 切念臣等钻仰玄风，渐摩妙化。 非不悦抱一守雌之道，其无如抗尘走俗者何。 道愈远，神愈卑，何自致内观之地； 心未澄，欲未遣，无由造常寂之天。 哀此微生，爽然自失。 惟愿慈尊之矜，悯特施法，力以提携。 令臣等忏断业缘，早出沈迷之网； 洗空结习，咸归清净之风。 法众虔诚，同伸忏悔。 稽首皈依三清上，无为教主混元尊。 太清道德众真仙，太极洞神诸宰辅。 臣等自从无始劫，无明贪爱蔽真心。 或违千二百新科，或犯百八十大戒。 是非人我生邪见，空色有无堕法尘。 茫茫欲海了无律，衮衮爱河那有岸。 自恨此身无定故，轮回生死几曾停。",
      "translated_text": "The teachings emerge from one source yet bear different names,\nThe Dao flows in parallel without contradiction.\nHeaven and humanity look up in reliance,\nImmortals and sages find their refuge—\nThe Great Dharma Master of the Mysterious,\nTogether with the Most High Lord Lao, the Primordial Emperor of Supreme Virtue.\n\nIn his transformed body, the Serene Elder first spread the teaching,\nIn the Eastern Land, many rulers and ministers found deliverance.\nThe Dao returned to Wen and Yin to reveal the golden elixir,\nThe Dharma was entrusted to the Heavenly Master to clarify the Orthodox Unity.\nZhen Duo and Song Lun transmitted the arts of refinement,\nQian Zhi and Gan Ji received the scriptural disciplines.\nHow many immortals were forged from the dross of the world—\nThe mysterious wind of ten thousand ages shall never fade.\n\nWith devoted heart bow in homage:\nExpounding the true essence of the One,\nOpening the gate of Non-Duality.\nIlluminating the origin of ritual and music,\nClarifying the return of virtue and the Dao.\n\nIn the East, the sigh of the ascending dragon arose in Lu,\nWhere the fruit of Nirvana was established,\nAnd the teachings of the floating *bhikṣu* were expounded.\nFrom the Western Hu came the welcome of the elephant-borne,\nWho styled himself the Ancient Firstborn,\nAnd was called the Reclusive Noble One.\nThough their names stood like tripods,\nTheir virtue flowed as rivers.\nThe patriarchs of the Three Teachings,\nTogether with the Most High Lord Lao, the Primordial Emperor of Supreme Virtue.\n\nFrom the Yin and Zhou dynasties, his traces first appeared,\nThrough the Xia era, he established his rules and patterns.\nTransforming the customs of eighty-one lands,\nFor nine hundred years, he made the Dao’s transformation manifest.\nConfucius heard the wind and became a teacher of ritual and music,\nŚākyamuni bowed his head to receive the floating *bhikṣu*.\nThus we know the Three Teachings share a common return—\nLater scholars, in their confusion, only bring suffering upon themselves.\n\nWith devoted heart bow in homage:\nThe Dao reaches back to the ancient beginning,\nVirtue wondrously merges in the mysterious.\nAbove, he is the August One; below, the King.\nAttaining it, one may govern the self within\nAnd rule the state without—\nNothing is beyond its fitting use.\nEmbracing the strengths of Yin-Yang, Ming-Jia, Ru, and Mo,\nExhausting the discourse on order and chaos, heaven and humanity through the ages.\nProfound and distant, it attains the utmost compliance;\nVast and fleeting, it returns to the Nameless.\n\nThe Heavenly Worthy of Dao and Virtue,\nTogether with the Most High Lord Lao, the Primordial Emperor of Supreme Virtue.\n\nWhen the two chapters of *Dao and Virtue* first descended to the world,\nThe hundred schools’ myriad doctrines all presented their words.\nEmpty the heart, fill the belly, blend with the subtle and formless,\nReturn to life’s mandate, guard the mysterious female.\nWithout action, without desire, return to purity and stillness,\nAbide in constant virtue, cherish spontaneity.\nCultivation, ordering, governance, and peace are but its remnants—\nFrom ancient times to the present, immortals have attained it thus.\n\nWith devoted heart bow in homage:\nEntering the realm of being from non-being,\nEntrusting *qi* to form the body.\n\nFrom the six *qi* of Yudan,\nThe auspicious lightning—\nIts kalpas are beyond reckoning.\nUntil the five colors of Heavenly Water,\nThe dream of the pearl—\nOnly then did his body appear.\nFirst ascending to heaven on the white deer,\nThen manifesting in Shu on the green sheep.\nTraces beyond traces,\nSpontaneous and natural.\n\nThe Heavenly Worthy Descending to Birth,\nTogether with the Most High Lord Lao, the Primordial Emperor of Supreme Virtue.\n\nA host of immortals bore the sun as they descended from heaven,\nFive-colored flowing pearls wove the sacred embryo.\nThrough eighty-one years, corresponding to the *Qian* trigram,\nBorn on the fifth day of the third month, matching the Luo numbers.\nHis surname derived from grasping the plum tree,\nEmerging from the dust, he stepped upon the lotus.\nUnique in honor above and below heaven,\nHis countenance and dignity were peerless.\n\nWith devoted heart bow in homage:\nTransformations without limit,\nMiracles beyond measure.\n\nSometimes as one thousand two hundred,\nLord Lao manifests in the heavens.\nSometimes as one hundred eighty,\nThe Dao Lord guides the mortal realm.\nHis titles are not confined to thirty-six,\nHis names not limited to seventy-two.\nThough his Dharma-body fills all,\nLike empty space, his wondrous essence—\nOriginally ever serene and still—\nBlends with the ten thousand transformations.\n\nTogether with the Most High Lord Lao, the Primordial Emperor of Supreme Virtue.\n\nHis wondrous essence originally returns to the Ultimate One,\nA thousand or ten thousand transformed bodies are not many.\nIn spring, the Supreme Radiance; in summer, the Aged One;\nIn autumn, the Spirit Light; in winter, the Youth.\nIn the world, he is called the Fortune Spirit, manifesting as the Dark Warrior,\nIn heaven, the Star Lord, governing the *Gouchen*.\nLike the precious moon in the void,\nWherever there are clear waves, it is seen.\n\nWith devoted heart bow in homage:\nHis merits surpass the ranks of sages,\nHis virtue crowns the Two Modes.\n\nSpreading kindness, his benevolence is like spring’s growth;\nToward the ten thousand things, he responds to conditions and answers calls.\nLike the moon appearing in a thousand rivers,\nHe rescues suffering from the tiniest speck of dust,\nDelivers the multitudes from the vast kalpa.\nFather of compassion to the four kinds of birth,\nTeacher of benevolence to the three realms.\nLimitless in delivering beings,\nTogether with the Most High Lord Lao, the Primordial Emperor of Supreme Virtue.\n\nThe true parents of all beings in the three realms,\nAt the end and beginning of kalpas, he delivers heaven and humanity.\nSevering evil, revealing signs to destroy Pang Xun,\nRelieving illness, extending compassion to revive Guang Ying.\nThe Hua and Xia, the Man and Rong, all receive his transformation,\nEven insects and plants receive his grace.\nHis divided bodies respond like motes of dust,\nHis merits and virtues are beyond all praise.\n\nThe preceding litany of merits and virtues has now reached completion.\nYet seeking the Great Void in words and images,\nHow can one perceive its truth?\nExhausting the descriptions of the most exalted virtue,\nIts beauty cannot be surpassed.\nHow can the brush’s limited glimpse capture the wondrousness of the Great Purity?\nFleeting as the leopard’s glance through a tube,\nGrievous is the profanation of the dragon’s court.\n\nHaving completed this litany of praise,\nWe trust it will be received with gracious regard.\nWe, your humble servants, drill and gaze upon the mysterious wind,\nGradually polishing ourselves in its wondrous transformation.\nNot that we do not delight in embracing the One and guarding the feminine,\nBut how can we resist the dust and the rush of the world?\nThe Dao grows ever more distant,\nOur spirits ever more base—\nHow can we reach the state of inner contemplation?\nOur hearts not yet clear,\nDesires not yet dispelled—\nNo way to attain the heaven of constant stillness.\nPity these humble lives,\nWe stand lost and forlorn.\n\nWe only pray that the Compassionate Venerable,\nMoved by pity, will specially bestow his Dharma-power,\nLifting us with his strength.\nMay we repent and sever karmic ties,\nSoon escape the net of deep delusion,\nWash away accumulated habits,\nAnd all return to the wind of purity.\n\nThe assembly, with utmost sincerity,\nTogether offers repentance.\nBowing our heads, we take refuge in the Three Pure Ones above,\nThe Non-Action Teaching Master, the Primordial Venerable.\nThe Perfected Immortals of the Great Purity of Dao and Virtue,\nThe Divine Ministers of the Supreme Ultimate Cavern.\n\nWe, your servants, since the beginningless kalpa,\nHave been obscured by ignorance, greed, and love,\nVeiling our true hearts.\nSometimes violating the one thousand two hundred new precepts,\nSometimes transgressing the one hundred eighty great precepts.\nRight and wrong, self and others—\nFalse views arise.\nEmptiness and form, being and non-being—\nWe fall into the dust of Dharma.\nIn the boundless sea of desire, no discipline,\nIn the surging river of love, no shore.\nWe regret this body’s lack of constancy,\nHow often have we paused in the cycle of birth and death?",
      "overlap_context": "s, the Red Essence titled.\nLu Tu, Wucheng, Yin Shou listed,\nZhenxing, Xize, Xieyi named.\nYu Cheng, Jing Cheng, Guoshu the last—\nThrough the ages as teacher, this can be recounted.\nWith devoted heart bow in homage:\nResponding to conditions to establish transformations,\nDelivering beings according to the kalpa.\nThe *Dao and Virtue* of five thousand words,\nOpening the ancestor of the golden elixir;\nThe talismanic scriptures of fifteen hundred scrolls,\nTransmitting the lineage of the Orthodox Unity.",
      "start_char": 3503,
      "end_char": 4828,
      "start_sentence": 207,
      "end_sentence": 284,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.079235792160034,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太清道德显化仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "以今仰对大慈尊，忏悔愿成无上道。 重告道场同业众，静心摄念露真诚。 受持十愿结良缘，消灭尘沙千万罪。 一愿圣人寿万岁，二愿天下溥安宁， 三愿道德常演化，四愿风雨顺时行， 五愿老幼行慈孝，六愿夭阏获全生， 七愿三途无苦难，八愿徧地息刀兵， 九愿水火不兴害，十愿疫瘴不流行。 罪从心起将心忏，心若灭时罪亦无。 无心无罪两俱空，此即是名真忏悔。 回向 向来朝礼至真，披陈忏悔，赞扬功德，并已周圆。 伏愿不舍慈悲，普施恩贶。 削愆尤於黑簿，罪垢风清； 纪福寿於丹书，善芽日长。 为上因缘，志心称念太清显化天尊，不可思议功德。 显化设醮仪 宣卫灵咒，请称法位 具位奉行，太清显化醮法。 祭酒臣某上启太清玄元无上三天无极大道太上老君、混元上德皇帝、道德天尊，先天太后，太乙元君，太清诸君丈人，太清四辅河上丈人、文始先生，三天四相，洞神宰辅卿监、一切仙曹，太清千二百官君，左右金童玉女龙虎君，三界官属，一切威灵。 咸望洪慈，俯垂洞鉴。 臣闻：有物混成，强名曰道。",
      "translated_text": "Bowing before the Great Compassionate Venerable One,\nwe repent and vow to attain the supreme Dao.\nAgain we address the assembly of shared karma in this Dao-field:\ncompose your minds, gather your thoughts, and reveal your true sincerity.\nUpholding the Ten Vows, we forge karmic bonds,\ndissolving the dust-like myriad sins.\n\nThe first vow: may the Sage live ten thousand years;\nthe second: may the world enjoy universal peace;\nthe third: may the Dao and virtue ever unfold;\nthe fourth: may wind and rain come in due season;\nthe fifth: may the old and young practice kindness and filial piety;\nthe sixth: may those fated to die young be spared;\nthe seventh: may the Three Wretched Realms know no suffering;\nthe eighth: may warfare cease throughout the land;\nthe ninth: may water and fire bring no harm;\nthe tenth: may plagues and pestilence not spread.\n\nSins arise from the mind—repent with the mind;\nwhen the mind is extinguished, sins too vanish.\nMind and sin both empty—\nthis is called true repentance.\n\n**Dedication**\nAll that has been offered—homage to the Perfected, confession of faults,\npraise of merits—is now complete.\nWe humbly pray that your compassion not be withheld,\nand that blessings be universally bestowed.\nMay transgressions be erased from the Black Register, sins cleansed like wind-blown dust;\nmay blessings and longevity be inscribed in the Vermilion Record, the sprouts of goodness growing daily.\nFor these supreme causes,\nwith sincere hearts we invoke the Most Manifest Transformative Heavenly Worthy,\nwhose inconceivable merits are beyond thought.\n\n**Manifest Transformation Ritual of Offering**\nProclamation of the *Guardian Spirit Mantra*, invocation of the ranks of the Dharma.\n\nBy the authority vested in this rite,\nthe Most Manifest Transformation Offering of the Great Purity is performed.\n\nThe Libationer, your minister [Name], respectfully addresses:\nthe Most High Lord Lao, Primordial Emperor of Supreme Virtue,\nthe Heavenly Worthy of Dao and Virtue of the Great Purity,\nthe Primordial Celestial Empress,\nthe Primordial Sovereign of the Great One,\nthe Lords and Elders of the Great Purity,\nthe Four Assistants and the Elder of the River,\nMaster Wen Shi,\nthe Four Phases of the Three Heavens,\nthe Divine Ministers and Assistants of the Cavernous Mystery,\nall the immortal bureaus,\nthe twelve hundred officials of the Great Purity,\nthe Golden Lads and Jade Maidens to left and right,\nthe Dragon-Tiger Lords,\nthe officials of the Three Realms,\nand all majestic spirits.\nMay your vast compassion deign to look down and perceive clearly.\n\nYour minister has heard:\nThere is a thing, chaotically formed,\nforced to be called the Dao.",
      "overlap_context": "cured by ignorance, greed, and love,\nVeiling our true hearts.\nSometimes violating the one thousand two hundred new precepts,\nSometimes transgressing the one hundred eighty great precepts.\nRight and wrong, self and others—\nFalse views arise.\nEmptiness and form, being and non-being—\nWe fall into the dust of Dharma.\nIn the boundless sea of desire, no discipline,\nIn the surging river of love, no shore.\nWe regret this body’s lack of constancy,\nHow often have we paused in the cycle of birth and death?",
      "start_char": 4829,
      "end_char": 5276,
      "start_sentence": 285,
      "end_sentence": 306,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.872979879379272,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太清道德显化仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "在希夷之表，无形无名； 以无情於恍忽之中，有象有精，而有物。 天地万化由之而出，阴阳四时得之而成。 形色智力、消息之来者不穷，进退存亡、邪正之相寻何已。 苟无主宰於其间者，乌能悠久而不息哉。 惟我混元，是为道祖。 念群有皆吾之有，能不扶持； 而众生自我而生，奈何委弃。 遂分灵於浩劫，将应化於微尘。 为皇者师、帝者师、王者师，更万世而无倦； 立天之道、地之道、人之道，使三才之咸安。 化被洪纤，风行隐显。 万物归而不为主，其德乃贞； 百姓用而莫能知，可名为大。 臣某蓬荜贱士，刍狗陈人。 夙荷大造之恩，获处下风之列。 分於道，形於一，虽同委顺之全； 知其雄，守其雌，未悟谷神之妙。 属遇真元之令节，诿为祖炁之降辰。 八十一身，犹是太虚之全体； 七亿万劫，不殊元始之初年。 蕞尔寒微，亦念浮生之易失。 慈尊哀悯，特施余泽於含灵。 复命归根，咸使得长生之道； 修缘证行，庶逢开大有之期。 臣等致恭上香，初献。 初献，宣词 按如词旨，一讽达天聪，仰觊道慈，俯垂省览。 臣闻：自然者，道由不生，所以生，生妙用谓； 神以不有，而能有，有况元象。 隐於空洞而至真，本於太无。 始乎无始，终乎无终，固难拟化生之事； 今则非今，古则非古，岂容系世代之时。 惟其职教，化以为心，不免和光，尘而示体。 昔高宗御极，当岁在辰之九年，以殷正纪，时实斗柄，建寅之二月。 忽睹阳景重辉之瑞，乃知真人出世之符。 八十一年极太阳之九数，七十二相又元炁之一初。 于北玄李谷以有光，视西蜀太官而为盛。 由是姓名始着，风化斯行。 访道元君，明学者必有师之义； 隐德柱史，见圣人不遗世之心。 流玄教，於中华； 演浮屠，於西域。 虽真仙隐显，本非世俗之能知； 而纪传昭彰，证以天经而不惑。 臣某等闻风谯郡，访古濑乡。 抚遗迹之犹存，恨生世之不早。 攀庭桧而飙轮已远，濯灵池而仙体难瞻。 拜真像於丹青，无异睹青天於云雾； 考丰功於简册，仅能得泰山之毫芒。 空怀睠恋之心，莫寓皈依之志。 钦遇降生之日，敬修庆贺之仪。 九光甘液，白玉文英，遐想群仙之上寿； 三玄紫奈，绛树丹实，缅怀万帝之称觞。 正希林之宴方酣，岂浊世之欢肯顾。 然道以慈悲而接物而。 臣怀爱敬以事君，精念潜通，匪于其人，而于其意。 高灵昭答，不享其礼，而享其诚。 过望之私，不知其僭。 臣等再拜致恭，上香亚献。 亚献，宣进状 臣闻：太初太易，无象无形，大道莫穷其宗祖； 生天生地，神鬼神帝，玄功靡得而名言。 惟古今道术，杂出於百家； 而儒释黄老，并列於三教。 虽礼乐，非名法兵权之比； 然未如，无为自化之尤高。 虽禅空异坚白同异之辞，然岂若不言善应之为，愈况灵宝真一之旨，洎金丹性命之方。 大者，可以致神仙； 小者，犹能芘家国。 道尊德贵，是宜超上古而独存； 巧妙功深，以故非中人之能识。 纷纷曲士，往往危辞。 或目以异端，或毁为外道。 且自然至理，於兹又何加焉。 彼小智自私，见其不知量也。 臣谨与弟子某等，虽惭下俗，每诵玄经，闻神明之教而作兴，慕清静之风而洗濯。 叹圣去以踰远，怜世降而愈卑。 吾道非乎，独不见，太古羲农之俗； 微言绝矣，孰能明，阴符道德之书。",
      "translated_text": "Beyond the realm of silence and invisibility, it exists without form or name. Yet within the boundless and indistinct, it bears image and essence, giving rise to all things. From it emerge the myriad transformations of heaven and earth; through it, the cycles of yin and yang and the four seasons attain completion. The ebb and flow of form, color, wisdom, and strength are inexhaustible; the interplay of advance and retreat, existence and extinction, deviance and rectitude knows no end. Without a sovereign governing between them, how could they endure so ceaselessly and eternally?\n\nOnly our Primordial One is the Ancestor of the Dao. Mindful that all existence is but an extension of the self, how could it not be upheld? And since all beings arise from the self, how could they be forsaken? Thus, the spirit is dispersed across kalpas, manifesting even in the tiniest speck of dust. As the Teacher of Emperors, the Teacher of Kings, and the Teacher of Lords, it endures through ten thousand generations without weariness. Establishing the Dao of Heaven, the Dao of Earth, and the Dao of Humanity, it brings harmony to the Three Powers. Its transformative influence extends to the vast and the minute, its virtue flowing unseen and revealed alike. Though all things return to it, it does not claim mastery—such is the constancy of its power. Though the people benefit from it, none can comprehend it—thus is it called great.\n\nYour minister, a humble scholar of the thatched hut, a mere straw dog among men, has long been graced by the boundless favor of creation, dwelling in the lowest ranks yet sheltered in its shadow. Though I am but a fragment of the Dao, a single manifestation of the One, and though I embody the completeness of yielding submission, knowing the masculine yet guarding the feminine, I have yet to fathom the subtlety of the Valley Spirit. Now, on this sacred occasion of the Primordial Qi’s descent, I recall that these eighty-one bodies are but the full embodiment of the Great Void, and that across seventy billion kalpas, they remain unchanged from the primordial years of the Origin. Though small and lowly, I cannot but reflect on the fleeting nature of this floating life. Moved by the compassion of the Venerable One, who bestows grace upon all sentient beings, may all return to their roots and attain the Dao of longevity. Through cultivation and the verification of practice, may we encounter the era of Great Prosperity.\n\nYour ministers now reverently offer incense and present the first libation.\n*First Libation, Proclamation of Words*\nIn accordance with the ritual text, may these words ascend to the heavens, reaching the ears of the Dao. We humbly beseech your divine compassion to deign to look upon them.\n\nWe have heard: That which is natural arises from the Dao, which does not itself generate, yet through which generation occurs—such is the wondrous function of its activity. Though it does not possess, it enables possession; though it does not have, it gives rise to the primal image. Concealed within the empty and vast, it is the perfection of truth, rooted in the Great Nothingness. Beginning without beginning, ending without end, it defies all attempts to describe the affairs of its creation. Neither bound by the present nor the past, how could it be confined to the ages of the world?\n\nYet in its role as teacher, it takes transformation as its heart, and though it does not shun the mingling of its light with the dust, it reveals its form. In the ninth year of the *chen* cycle during the reign of High Ancestor, when the Shang calendar marked the first month and the Dipper’s handle pointed to *yin*, the sun’s brilliance suddenly doubled in splendor—a sign that a perfected one would appear in the world. Eighty-one years, the ultimate number of the Great Yang; seventy-two marks, the first manifestation of the Primordial Qi. In the northern valley of Li, a radiance shone forth; in the western palace of Shu, its glory flourished. From this, its name became known, and its transformative influence spread. Seeking the Dao from the Primordial Lady, it illuminated the principle that scholars must have a teacher. Concealing its virtue as the Pillar Historian, it revealed the sage’s resolve not to abandon the world. It propagated the profound teachings in the Central Lands and expounded the floating doctrines in the Western Regions. Though the true immortals’ appearances and withdrawals were beyond the ken of the vulgar, their records and transmissions shone clearly, confirmed by the celestial scriptures without doubt.\n\nYour ministers, having heard of these signs in Qiao Prefecture and traced the ancient sites of Lai, now touch the remnants that still endure, lamenting that we were not born in that earlier age. Clutching the cypress of the courtyard, we find the chariot of the wind already distant; bathing in the sacred pool, we strain to glimpse the immortal form. Bowing before the painted image of the Perfected One, it is no different from gazing at the blue sky through clouds; examining the records of its great deeds, we grasp but the faintest trace, like the tip of a hair on Mount Tai. Our hearts are filled with longing, yet our resolve to return remains unfulfilled.\n\nNow, on the anniversary of its descent into the world, we respectfully perform the rites of celebration. Ninefold radiant nectar, white jade and patterned blossoms—we envision the immortals toasting to their eternal longevity. The Three Mysteries’ purple fruits, the crimson trees’ vermilion fruits—we recall the myriad emperors raising their cups in homage. As the banquet in the forest of rarity reaches its height, how could the impure world’s joys compare? Yet the Dao, in its compassion, engages with all things.\n\nYour ministers, moved by reverence and devotion in serving the Dao, offer our sincere intentions, not for the sake of the ritual itself, but for the sincerity it embodies. May the lofty spirits, in their luminous response, accept not the form of our offerings, but the purity of our hearts. Though our gratitude exceeds all bounds, we know not the measure of our presumption.\n\nYour ministers bow twice in reverence and offer the second libation of incense.\n*Second Libation, Presentation of the Memorial*\nWe have heard: In the Great Beginning and the Great Simplicity, there were no images, no forms—the great Dao’s origin cannot be fathomed. It gives birth to heaven and earth, empowers gods and emperors—its mysterious workings defy all description.\n\nThroughout the ages, the arts of the Dao have emerged from a hundred schools, yet Confucianism, Buddhism, and the teachings of the Yellow Emperor and Laozi stand as the Three Teachings. Though rites and music cannot be compared to the schools of names, laws, military strategy, or power, none surpass the loftiness of effortless transformation. Though the emptiness of meditation differs from the debates over hardness, whiteness, similarity, and difference, how could it compare to the responsiveness of non-action? The principles of the Numinous Treasure and the True One, the methods of the Golden Elixir and the cultivation of nature and life—these are profound indeed. In their greatest form, they can lead to transcendence; in their lesser form, they still protect families and states. The Dao is revered, its virtue esteemed; thus, it surpasses all antiquity and endures alone. Its subtlety and depth are such that mediocre minds cannot comprehend them.\n\nThe narrow-minded scholars of the world often speak recklessly, some dismissing it as heterodoxy, others condemning it as an external path. Yet what can be added to the perfection of the natural and ultimate principle? Those of limited wisdom and selfishness simply reveal their own lack of understanding.\n\nYour ministers, though unworthy and of humble station, have often recited the profound scriptures. Inspired by the teachings of the divine luminaries, we aspire to the winds of purity and seek to cleanse ourselves. We lament that the sages have departed ever further, and pity the world’s descent into baseness. Is our Dao not true? Have we not seen the customs of the ancient eras of Fuxi and Shennong? The subtle words have faded—who can now illuminate the texts of the *Yinfu* and the *Daode*?",
      "overlap_context": "f the River,\nMaster Wen Shi,\nthe Four Phases of the Three Heavens,\nthe Divine Ministers and Assistants of the Cavernous Mystery,\nall the immortal bureaus,\nthe twelve hundred officials of the Great Purity,\nthe Golden Lads and Jade Maidens to left and right,\nthe Dragon-Tiger Lords,\nthe officials of the Three Realms,\nand all majestic spirits.\nMay your vast compassion deign to look down and perceive clearly.\n\nYour minister has heard:\nThere is a thing, chaotically formed,\nforced to be called the Dao.",
      "start_char": 5276,
      "end_char": 6501,
      "start_sentence": 307,
      "end_sentence": 386,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.328115463256836,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太清道德显化仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "幸吾师震夙之辰，为我道兴隆之托。 伏愿恢弘世教，振策宗风。 三洞天书，愿全文之复出； 无为上道，随浩劫以长存。 乃若任造化以为功，齐太虚而比寿，皆真尊所宜素有，非小臣可得尽言。 臣等拜手致恭，上香终献。 终献，宣疏 臣闻：天地相合，以降甘露； 坎离既济，则生黄芽。 以丹鼎英精，既迥殊於流俗； 则红尘烟火，岂可奉於高仙。 兹因酌水之仪，而效献汤之礼。 黄昏一匕，探囊愿试於仙方； 白雪九还，换骨蕲分於余剂。 臣等虔恭捧扬奉献。 进汤，奉经 送圣",
      "translated_text": "By the blessed dawn of our Master’s sacred birth, we are entrusted with the flourishing of the Dao. We humbly pray that the world’s teachings be magnified and the ancestral winds of the lineage be reinvigorated. May the celestial scriptures of the Three Caverns be restored in full; may the supreme Dao of non-action endure through the vast kalpas. As for harmonizing with creation to achieve merit, or equaling the boundless void in longevity—these are virtues the True Venerable has long possessed, far beyond the words of this humble servant.\n\nWe bow in reverence, offering incense and completing the final libation.\n\n*After the final libation, the petition is read:*\nWe have heard: when heaven and earth unite, sweet dew descends; when Kan and Li achieve balance, the yellow sprout is born. The essence of the elixir crucible stands apart from the vulgar world—how then could the smoke and dust of the red realm befit the exalted immortals? Thus, in this rite of water offering, we emulate the ancient ritual of presenting broth. A single spoonful at dusk, drawn from the pouch to test the immortal formula; nine cycles of white snow, transmuting the bones with the remnant elixir.\n\nWith utmost devotion, we raise and present the offering.\n\n*The broth is offered, the scriptures are presented, and the deities are sent forth.*",
      "overlap_context": "g.\n\nYour ministers, though unworthy and of humble station, have often recited the profound scriptures. Inspired by the teachings of the divine luminaries, we aspire to the winds of purity and seek to cleanse ourselves. We lament that the sages have departed ever further, and pity the world’s descent into baseness. Is our Dao not true? Have we not seen the customs of the ancient eras of Fuxi and Shennong? The subtle words have faded—who can now illuminate the texts of the *Yinfu* and the *Daode*?",
      "start_char": 6501,
      "end_char": 6720,
      "start_sentence": 387,
      "end_sentence": 403,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.731032371520996,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太清道德显化仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "臣闻：神潜恍惚，无往不存。 道在虚无，有求辄应。 配渺渺大罗之境，而巍巍万有之尊。 且求於色相者已非，矧拟以去来者踰远。 然既因人，而仿为此礼； 苟非循迹，而莫致其诚。 是故香花灯烛，以表其宜； 词疏表章，以通其意。 荷高明之委鉴，惧亵渎之贻诛。 兹贺礼之告成，非飙斿之可挽。 伏想九光鹤盖，自碧落以来迎； 八景龙舆，凌青冥而上返。 臣等云霄极目，涕泗交颐。 言有尽而意无穷，形虽疏而心甚迩。 当年白鹿尚可访於谯城，异日青羊安得来於蜀郡。 臣等下情不胜攀恋之至，谨稽首拜送。 回軿颂",
      "translated_text": "We have heard: the numinous dwells in the indistinct, present wherever one turns; the Dao abides in emptiness, responding to every entreaty. It matches the boundless vastness of the Great Luo realm, yet stands as the august sovereign of the ten thousand existents. To seek it in form is already mistaken—how much more so to conceive of it in terms of coming and going? Yet since we, as mortals, emulate this rite, if we do not follow its traces, how can we convey our sincerity? Thus do we offer incense, flowers, lamps, and candles to express what is fitting; petitions and memorials to convey our intent. We bear the weight of your exalted scrutiny, trembling lest we incur reproach for irreverence. Now, as this rite of celebration reaches its completion, not even the swiftest pennants could hold it back. We envision the nine-rayed crane canopy descending from the azure vault; the eight-scene dragon chariot ascending through the blue firmament and returning on high. Our gaze strains toward the clouds, tears and sobs streaming down our faces. Words may end, but the heart’s intent knows no bounds; though our forms stand apart, our devotion draws near. In days of old, the white deer could still be sought at Qiao City—how might the blue ram come to Shu Prefecture in days to come? Our humble hearts overflow with longing beyond measure. With reverence, we bow our heads and send forth the deities. The palanquin turns—we chant the hymn of praise.",
      "overlap_context": "stands apart from the vulgar world—how then could the smoke and dust of the red realm befit the exalted immortals? Thus, in this rite of water offering, we emulate the ancient ritual of presenting broth. A single spoonful at dusk, drawn from the pouch to test the immortal formula; nine cycles of white snow, transmuting the bones with the remnant elixir.\n\nWith utmost devotion, we raise and present the offering.\n\n*The broth is offered, the scriptures are presented, and the deities are sent forth.*",
      "start_char": 6720,
      "end_char": 6951,
      "start_sentence": 404,
      "end_sentence": 420,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.177430868148804,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太清道德显化仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "太清道德显化仪竟",
      "translated_text": "The Grand Clarity Rite of Dao and Virtue’s Manifest Transformation now concludes.",
      "overlap_context": "returning on high. Our gaze strains toward the clouds, tears and sobs streaming down our faces. Words may end, but the heart’s intent knows no bounds; though our forms stand apart, our devotion draws near. In days of old, the white deer could still be sought at Qiao City—how might the blue ram come to Shu Prefecture in days to come? Our humble hearts overflow with longing beyond measure. With reverence, we bow our heads and send forth the deities. The palanquin turns—we chant the hymn of praise.",
      "start_char": 6951,
      "end_char": 6962,
      "start_sentence": 421,
      "end_sentence": 421,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 0.8600492477416992,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太清道德显化仪.txt",
        "category": "威仪类"
      }
    }
  ]
}