{
  "source_id": "太白经",
  "source_file": "chunked_daozang\\太白经.json",
  "total_chunks": 5,
  "total_original_chars": 4146,
  "total_translated_chars": 23820,
  "total_translation_time": 113.38017082214355,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\众术类\\太白经.txt",
    "category": "众术类"
  },
  "full_translation": "**The *Tai Bai Jing***\n\n**Title:** *Tai Bai Jing* (*Scripture of the Great White*). The original text does not specify an author, but it likely dates to the late Tang or Five Dynasties period. The *Daoist Canon Index* attributes it to Shi Jianwu. One scroll. Source text: *Zhengtong Daoist Canon*, *Dongshen* Section, *Zhongshu* Category.\n\n### *Tai Bai Jing*\n\nThe *Sacred Records of the Yellow Emperor* states: In the first year of the Yellow Emperor’s reign, on the first *yin* day of the *yin* month, he fasted at Mount Shou. Fang Ming and Li Mu accompanied him to the summit of Mount Juci, where they paid homage to the Great Lord Chen. There, he was bestowed with the *Twelve Scrolls of the Divine Mushroom and Numinous Charts* and nineteen formulas for gold and silver.\n\nThe Yellow Emperor then ascended Mount Wangwu, where he opened a stone casket and uncovered a jade tablet, obtaining the Way of the Nine Cauldrons’ divine elixir and the flying snow furnace fire. Later, he traveled to Mount Emei, where he encountered the Heavenly Perfected Sovereign. He bowed in reverence and entreated the Way of the Immortals.\n\nThe Sovereign said: \"Do you not know that Heaven possesses the Mysterious One, born of the Great Yang, named Flowing Pearl? It is the gate of all wonders. If you cultivate it, you may attain longevity, ascend on clouds, and pay homage to the Jade Emperor.\"\n\nThe Yellow Emperor received this teaching with gratitude. At Mount Ke, he cast a golden crucible and compounded the Great Return Elixir of Flowing Pearl. He commanded that it be transmitted to later generations. At Lake of the Crucible, he ingested the elixir and ascended to Heaven. At that time, seventy-two of his ministers who had also consumed the elixir ascended with him.\n\nPreviously, the Yellow Emperor, fearing that the Way of the Golden Elixir might be lost, entrusted the Nine Cauldrons’ divine elixir to his eldest son, charging him to transmit it to posterity. He admonished him, saying: \"This Way is most weighty. It must be passed only to the worthy. If given to the unfit, it will bring disaster upon them.\"\n\nThe eldest son then fasted on Mount Dongming, casting a golden fish into the eastern flowing waters and swearing a blood oath. Later, he transmitted the Way to the Master of Mount Shu. From then on, it was passed from sage to sage, from worthy to worthy, from the benevolent to the benevolent. Those who attained the Dao were beyond count. Heaven’s love for humanity is profound, yet if one’s heart does not align with the Dao, success remains elusive. Among ten thousand, nine thousand fail to believe, and when they hear the Way, they clap in mockery—this is all too clear.\n\nThus, the celestial mechanism must not be lightly disclosed, nor the crucible and vessels carelessly handled. The foolish, cunning, greedy, deceitful, and false must never be allowed to see it or speak of it. Yet, in the transmission and refinement of the Way, there are ten prohibitions and ten permissions, forming the Ten Admonitions.\n\n### The Ten Prohibitions\n\n1. **Those who flatter with clever words and ingratiating manners, urgently seeking to obtain the Way while scorning others as fools and themselves as cunning.** They claim that if the Dao does not oppose them, their hearts will harbor no resentment. If a single word aligns with the Way, they demand it be transmitted to them. They speak of other matters while alluding to this one, or point to others to imply themselves, employing deceit in myriad forms and uttering honeyed words. Such persons must never be spoken to.\n\n2. **Those who boast of their mastery of the Great Elixir’s methods, the gates of metal and stone, the refinement of cinnabar and mercury, or claim to have personally handled crucibles yet remain indifferent to the deeper meaning.** They first proclaim their own superiority, then barter knowledge for other matters. They boast of their schemes, claiming to encompass Heaven and Earth, repeatedly visiting and probing with questions. Such persons must never be spoken to.\n\n3. **Those who, clad in tattered robes and worn shoes, claim poverty and beg for salvation, swearing gratitude in life and remembrance in death, invoking Heaven and Earth as witnesses and the gods as guarantors.** Such persons must never be spoken to.\n\n4. **Those who, upon first acquaintance, speak with excessive familiarity and cunning words, probing shallowly into the Way.** If their questions are answered, they praise themselves and extol the other as a divine immortal. If their questions are difficult, they grow angry, slander the other, and dismiss them as frauds. They claim their own learning surpasses others’, yet their knowledge is shallow and fleeting. Such persons must never be spoken to.\n\n5. **Those whose nature is avaricious, who covet gold yet refuse to spend even a single coin, scheming only for personal gain.** They bow low, flatter, and claim, \"You are so kind—you surely won’t demand payment from me!\" Yet they clench their fists, stubbornly demanding the highest arts. Such persons must never be spoken to.\n\n6. **Those lacking discernment, who disregard the formulas and act arbitrarily, refusing to learn from a master.** Some claim a thousand coins suffice for one firing, others five hundred for one calcination. Gold vanishes with the smoke, stones scatter with the flames. When their desires are unmet, they slander the truly worthy, declaring that alchemy never succeeds and that such things do not exist in the world. They revile immortals when they see them and scowl at recluses, assuming all others are as ignorant as themselves. Such persons must never be spoken to.\n\n7. **Those who, observing others, declare them unworthy, or seeing a man of integrity, call him evil-hearted.** They think, \"If even I cannot succeed, how can you fulfill my desires?\" Though they have lived many years, they are not yet old. They dismiss the elderly as narrow-minded and the widely experienced as mere meddlers. They presume to command the wise and question the learned, grasping a brush to measure the sky or tossing bricks to attract jade. Such persons must never be spoken to.\n\n8. **Those of shallow and inferior nature, ignorant of the source of creation, their understanding dim and unable to comprehend the Dao of Heaven and Earth.** They seek only minor arts, fixated on profit. They care only for wealth, neglecting their spirit. They refine cinnabar and mercury, using silver, lead, copper, and malachite to boil mercury. When discussing such matters, they listen with delight, but upon hearing of the supreme medicine, they sneer in silence. They mistake the false for the true, claiming to progress from small to great. Such persons must never be spoken to.\n\n9. **Those who, though they know the arts of transcending the world and seek those who have attained the Dao, remain haughty and unwilling to humble themselves.** They scrutinize others’ expressions and demeanor, scheming through the night and pursuing their aims at dawn.\n\nThose who harbor only the thought of offering jade disks, yet lack the resolve to cede cities. They display petty cunning, seeking to deceive great sages. They dare to pose simple questions, only to provoke extraordinary matters. As the saying goes: *\"One who does not quicken their pace downhill will seldom encounter opportunity.\"* Yet when the moment passes and is never met again, they may boast of frugality, claim loyalty, while cowardice rules their own hearts. They urge others to act in secret, startling them, feigning kindness and mercy, recklessly expounding esoteric texts, deceiving the foolish, and brazenly misleading the wise—all to curry favor, offering obsequious deference. Another saying warns: *\"Those who transmit the Way to me do so only to repay human sentiment, not for wealth or treasure.\"* Such persons must never be spoken to.\n\n10. **Those who, having chanced upon a master and grasped a fragment of the teaching, grow arrogant and fail to discern yin and yang.** They may grasp the head but not the tail, or the tail but not the head. How petty and easily sated! They boast to others of their knowledge. If they meet one who truly knows, they fawn and flatter, bowing and pleading, *\"O Immortal Brother!\"* They offer wives and concubines, vowing to live and die together, to serve as slaves and servants, forever awaiting commands, hoping for eternal union, even willing to be ground to dust. Later, when they learn a little of the path and deem themselves secure, they turn on their *\"Immortal Brother,\"* their bodies withering, their faces growing cold, their feasts dwindling day by day. Like one who catches a fish and forgets the trap, or reaches the shore and discards the raft, they declare, *\"I have now attained the great matter and no longer need my former master. Remove the gate and threshold—I shall refine lead and mercury on my own!\"*\n\nLittle do they know that the perfected see through people and things, foreseeing past and future. They discern from the outset that such a person is no vessel of greatness. How could they transmit the great affair of immortality, the supreme mechanism of Heaven and Earth, merely for pleasant words, a smiling face, or a cup of wine and a home-cooked meal? At first, such persons believe their work is done and betray their *\"Immortal Brother.\"* Later, when they gradually realize their error, they slander the lofty adept, bringing misfortune upon themselves—who can blame them for their regret?\n\nAlas! From ancient times to the present, such persons abound in the world. They, too, must never be spoken to.\n\nThese ten types of persons must not be spoken to—those who have attained the Dao should carefully heed this. To reveal the mysteries to them is to invite one’s own remorse. Yet to withhold the teaching entirely, calling it the *\"hidden treasury of Heaven’s Way,\"* is also improper. To transmit it to the unworthy is to squander the Dao, recklessly meddling with yin and yang—a grave error.\n\n**The Ten Worthy of Transmission**\n\n1. Regardless of poverty or wealth, high or low status—whether emperor, minister, lord, scholar, warrior, commoner, farmer, artisan, or merchant—any who possess the Dao may be taught. Yet one must first examine their character, weigh their worthiness, and only then transmit the teaching.\n\n2. Those who do not seek alchemical gold or silver, nor rely on power or influence; who remain humble in wealth and unassuming in office; who seek the great Dao and long only for longevity; whose words are free of flattery and whose conduct is without deceit; who do not act on impulse but carefully consider their lifelong aspirations—if such a person is found, they may be entrusted with the teaching.\n\n3. First, engage them in discourse to assess their foundation. If they are not ignorant of yin and yang, can comprehend the trigrams, understand the principles of creation, recognize the benevolence of Heaven and Earth, penetrate obscurity and clarity, deeply grasp advance and retreat, the Five Phases and Four Images, the Seven Returns and Nine Revolutions; if their conduct aligns with their practice, their body with their heart, yet they fear misfortune despite lacking virtue, or possess keen perception but lack true insight—if their beginnings are auspicious but their ends inauspicious, their gains followed by losses, with no chance for regret—then, if they can guard secrets, feigning foolishness while holding wisdom, carefully examine them. Such a person may be taught.\n\n4. Those who toil endlessly over family affairs, obsess over reputation and status, pursue pride and elegance—these must not be spoken to. But those who uphold truth and integrity, are content with little, unburdened by worldly affairs, free from family entanglements, indifferent to fame and profit, unfeeling toward kin, and guileless toward others—these may be taught.\n\n5. Those with a heart of kindness and mercy, without partiality; who wish to give generously but lack the means; who revere the lofty yet live in poverty—carefully observe their conduct and concealment. These may be taught.\n\n6. Those who serve their lord with loyalty, remain humble in high office, endure meager salaries and poverty with patience, uphold truth without restlessness, cultivate tranquility, avoid frivolity, dwell in emptiness, and do not covet fame or rank—these may be taught.\n\n7. Those who serve their parents at home with filial piety, known throughout the neighborhood; whose benevolence and virtue shine forth; who maintain purity and simplicity, and aspire to longevity—these may be taught.\n\n8. Those who do not contend with others, whose hearts are free of enmity; who take the Dao of Heaven as their mind, not fixating on the elixir; who merge with the Dao without intent, finding the Dao naturally before them—these may be taught.\n\n9. Those without family or burdens, like wild cranes and solitary clouds; unconstrained by worldly affairs, unbound by social conventions; unknown to others and knowing no one; who long for longevity but have not met the supreme Dao—these may be taught.\n\n10. Those who, when the Dao flourishes, dwell in mountain caves, alone in clouded forests, their years and virtues high, their worldly ties severed. Then, observing their words and deeds, if they do not deceive the weak or the guileless—these may be taught.\n\nThese ten types of persons are worthy of transmission. Those who have attained the Dao may, within a hundred years, transmit the teaching to three such individuals. As for the ten unworthy types mentioned earlier—take care never to transmit to them.\n\nWhen transmitting the teaching, one must possess the **Ten Perfections** to achieve the great elixir. Without them, do not act recklessly.\n\n**The Ten Perfections**\n\n1. A place for cultivation and refinement. Carefully select a famous mountain or great peak, with auspicious terrain—mountains that gather and waters that flow—where the Five Phases generate one another, avoiding inauspicious mountains or malevolent waters that deplete and harm. Do not choose a place defiled by the eyes of the vulgar, where the impure and the sacred mingle. This is unacceptable.\n\n2. Sufficient resources. If resources are ample, nothing will be lacking, and no delays will arise. The cultivator’s heart must be naturally at ease, not fabricating what does not exist or hesitating in doubt, lest regret follow.\n\n3. A steadfast youth, who must be an extraordinary person. If not of lofty and numinous nature, they cannot be employed; merely having them attend to the talismans is insufficient, for they must not be privy to the Way. Beware lest they, being of small capacity, lightly divulge it to others.\n\n4. The construction of the furnace and crucible, their height and depth, width and thickness, must all adhere to the established method. The direction from which the earth is taken, the clay’s orientation, the time and day of kindling the fire, the opening and closing of doors, the quantity of space, the number of layers—each must attain its proper Dao.\n\n5. The crucible’s method must follow the Way, including its height and size, weight and breadth, thickness and depth. All must be meticulously examined to fathom its profound subtleties, aligning with the true text. Do not act recklessly. One who recognizes the true crucible is already a person of wisdom.\n\n6. One must recognize the true medicine. Having recognized the true medicine, one must know the time of its gathering. Thus, the Prince of Huainan said: *\"Gather it before the silkworms feed, use it after the fire’s transformation.\"* From this, we know it is neither metal nor stone, but a plant. The plant flourishes in the second month, decays in the eighth, and lies dormant in the tenth—this is clearly evident. In the eighth month, autumn stirs, frost descends, and withered branches and fallen leaves return to the earth.\n\n7. [Missing]\n\nEighth Perfection: Gathering, harvesting, and preserving must be done with cleansing—this is called \"bathing.\" Once bathed, strip away the roots and leaves, remove the bones and retain the essence, then welcome it into the chamber and assemble it. Thus, the union begins.\n\nNinth Perfection: When placing it into the crucible, arrange it according to the method, clearly distinguishing the Four Symbols, matching the Five Phases, aligning with the Two Modes, and uniting the Two Luminaries. The Creator is I—who then brings forth generation?\n\nTenth Perfection: Water and fire. Presence and absence unite at *zi* and *wu*, waxing and waning with the hour, all within the moon’s cycle. Flight and concealment are fully determined by the hexagrams. Only when cultivation reaches this point may one apply true focus—this is called the Tenth Perfection, and one who attains it is called a *zhi-shi* (perfected person). Yet if even one of the Ten Perfections is lacking, one cannot speak of the Dao. If the Ten Perfections are complete but one is flawed, the Dao remains incomplete. Thus, the *zhi-shi* examines and acts accordingly—is this not so?\n\nThe *Biography of the Master of Siming* states: \"Four\" refers to the Four Symbols—east, west, south, and north. \"Bright\" refers to the sun and moon. \"Prior\" means before heaven and earth, the first of all things. \"Life\" is the Dao. The Dao gives birth to the One, the One gives birth to the Two, the Two give birth to the Three, and the Three give birth to the myriad things. It also says: The One is water; the Two is fire; the Three is wood. These three can complete the myriad things, and the myriad things are earth. Thus, the Three revolve and ultimately return to earth, and earth is Five. Five is the father of Four, and Four is the son of Five. Therefore, Five is the emperor and king, and Four is the eldest son. Thus, the emperor and king possess the virtue of nurturing, while the eldest son holds the power of execution. Together, the emperor and the eldest son form the number Nine—is this not so?\n\nSome ask: The Three governs *Zhen* (Thunder), and *Zhen* governs the eastern palace. Four belongs to *Dui* (Lake), the western palace—why then is it called the eldest son? The answer: The eldest son begins in the *Zhen* palace and ends in the *Dui* palace, thus sharing the same name and color. Stillness is the root of movement. The *Book of Changes* says: \"Like sounds resonate; like qi seeks its kind.\" This is its meaning. It also says: The Five Phases generate one another; the Four Symbols restrain one another, ultimately returning to earth. The myriad things are born from earth and die returning to earth. The Five Phases have different names but share the same essence—this shared essence is called the Mysterious. The Mysterious is water. Water can generate wood, wood can generate fire, fire can generate earth, and earth can generate metal. Metal is the White Tiger; wood is the Azure Dragon; fire is the Vermilion Bird; water is the Dark Warrior. The Dark Warrior restrains the Vermilion Bird; the White Tiger restrains the Azure Dragon. Thus, the ancients said: To stabilize the four directions, first observe the colors. Therefore, these matters are discussed together.\n\nFor example, silver, lead, cinnabar, and mercury naturally determine the four directions. In this way, one readily discerns water and fire and simultaneously knows the Dragon and Tiger. How could one not understand that water can extinguish fire and metal can overcome wood? How then could one remain deluded about the Great Dao? From this perspective, the thousands of classics and myriad books, the various masters and their discourses—all expounding the Five Phases, Eight Trigrams, Four Symbols, and Six Positions—would have long since lost their coherence without this foundation. For they do not speak of the divine water and flowery pond, nor do they discuss the mutual arousal of Dragon and Tiger.\n\nLi Quan’s commentary on the *Yin Fu Jing*, citing the Yellow Emperor, states: Among the hundred methods of golden elixir, the essential lies in the divine water and flowery pond. Though the texts have existed from ancient times to the present, their principles remain obscure. The divine water and flowery pond are the mother of the myriad things, possessing a singular virtue, the first of the Five Phases. Seated facing south, it exists prior to heaven, prior to earth, and possesses substance—it is the mother of heaven and earth. Knowing the white and guarding the black, neither hard nor soft, like stone yet like water, it competes with nothing and is the most revered among the five metals and eight minerals. When settled, its color is like the Great Void, containing the five hues. The ancients said: \"One thing contains five colors, eternally serving as the immortal’s emolument.\" How could the worthy and the gentlemen not understand this?\n\nOnce the divine water is clarified and transformed into the flowery pond, the Dragon and Tiger may then arouse each other within it. After the Dragon and Tiger have aroused each other, the flowery pond is discarded as useless. Thus, the ancients said: \"Use lead yet do not use lead—you must work within the lead. If you seek within the lead, you will still err as before.\" It also says: \"Use lead yet do not use lead—you must take from within the lead. To refine the Great Return Elixir, you must know that lead is the mother.\" And again: \"Having recognized mercury within cinnabar, you must seek gold within lead.\" And: \"Lead is the mother of sprouts; sprouts are the children of lead. Once the golden essence is obtained, discard the lead.\" And: \"If sprouts are lead, abandon lead by ten thousand *li*. If sprouts are not lead, begin with lead.\" And again: \"The original elixir is fundamentally lead; within lead also lies the original elixir. To make the elixir, do not use lead—lead is the Great Elixir Field. The field is earth. The myriad things are born from earth.\"\n\nQingxiazi said: The Dao of immortality encompasses a thousand transformations and ten thousand changes, but none surpass the Dao of lead, mercury, divine water, and the flowery pond—particularly the single method of the mutual arousal of Dragon and Tiger. Since the time of the Yellow Emperor, this has never been committed to writing; only oral transmission of secret formulas and heart-to-heart transmission of spiritual talismans have preserved it. Now, I directly point to the divine water and flowery pond for the world, though I have not yet discussed the mutual arousal of Dragon and Tiger within the text. As for the refinement of the crucible, the regulation of fire times, and the advance and retreat of the firing process—these are the same as in other schools, and I will not elaborate further here.\n\nAs for the Eight Trigrams, Five Phases, seven returns and nine revolutions, the forms of crucibles and furnaces, the *jiji* and *weiji* hexagrams—these are all distinct matters. The alchemical school values only the practical methods of operation. If one can comprehend the divine water, flowery pond, and the mutual arousal of Dragon and Tiger, one has already grasped the essential secret of the Great Return Elixir.\n\nShi Jianwu’s verse says:\nThe divine water and flowery pond are the elixir itself,\nEast and west, high and low, observe each other.\nI urge you: do not play with common lead—\nYour livelihood and career would be better abandoned.\n\nLead—why fear it when it is fundamentally lead?\nYet where within lead can one seek immortality?\n\nThe Return Elixir is perfected in all directions—east, west, south, and north—\nYet how can one fault the immortals for refusing to transmit it?\nOf the same color and name, harmonizing in fine resonance,\nIt may gleam brightly or sink deeply.\nHeaven and Earth inverted, driving thunder and rain,\nHow could the Dragon’s leap ever escape the Supreme Yin?\nThe *Tai Bai Jing* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太白经 经名：太白经。 原未题撰人，约出朴唐末五代。 《道藏子目引得》题作施肩吾撰。 一卷。 底本出处：《正统道藏》洞神部众街类。 太白经 《黄帝圣记经》曰：黄帝元年寅月寅日，斋於首山，方明、力牧从黄帝，以上具茨，谒大陈君，授以黄帝《神芝灵图》十二卷，金银方十九首。 黄帝又登王屋山，开石函，发玉岌，得九鼎神丹飞雪炉火之道。 黄帝复到峨媚山，见天真皇人，礼请神仙之道。 皇人曰：子岂不知天有玄一，生於太阳，名为流珠，为众妙之门，得而修之，可令子长生，升云飞朝玉帝。 黄帝拜受，於刻山铸金鼎，修合流珠大还神丹。 令传后人，而於鼎湖，服而上升。 时有大臣七十二人，得丹服者，亦从黄帝上升。 先是黄帝恐金丹道绝，授与元子九鼎神丹。 令传后人。 而诚之日：此道至重，必以授贤。 苟非其人，自招灾咎。 元子则斋於东明山，以金鱼投於束流水，敌血而盟。 后元子又传束山子。 自此以圣传圣，以贤传贤，以仁传仁，得道者不可胜计。 天之爱人甚矣。 而人自非心不合道，固难成也。 返成不信，天下十有九矣。 闻道抚掌，此亦明矣。 是则天机不可轻泄，鼎器不可窃弄，愚下狡诈贪婪欺妄者，故不可令见，不可与语。 然传修炼有十不可者，有十可者，为之十诚云耳。 十不可者 一、以巧言媚容，急向热取。 谓他人为痴，谓我为奸，自云若是道不违人，即心无憎惜。 一言道合，必传与我。 或说他事并此事，或指他人喻此人，狡诈多方，甘言出口，此辈慎不可与语也。 二、先自说大丹方术，金石门庭，伏毗扑茅，寻草结汞。 又曰曾亲经手嫌，不能为意在。 先说我强，博换他事。 谓我机关，罗笼天地，频来数到，束问西探，慎不可与语也。 三、只以盏嘐蛮炙，双袜缅鞋，自说贫寒，望垂救拔，生成荷德，死殁知恩，指天地为盟，向神祇作誓，此辈慎不可与语也。 四、入头相狎，巧语多辞，探迹浅探，考求道理，问得即喜我，乃称扬彼人者，神仙中人。 难问则瞋我，则诽谤彼人者，诳妄之士，浮学日浅，不及我长，此辈慎不可与语也。 五、立性好利，柢待要金，怯贪不使於一文，奸．狡但求於好事，乾语湿咯，低拜屈腰，自称尔好事，必然不要我钱。 空把两拳。 坚求至艺，此辈慎不可与语也。 六、自无见识，不按方书，任意看量，不从师授，或一千文为一火，或五百文作一灰，金逐烟消，石随焰散，不称愚意，却谤真贤，以谓从来伏丹万无一成，大约世问终无此事，见仙人则谤，逢处士即瞋，将谓他人并同於我，此辈慎不可与语也。 七、自观彼人，言此人无福，· 以条灭士，言此人恶心。 我尚不成尔，焉能遂我已。 岁时久历尔，且年纪未多，以老人为褊知，以广行为历事，便拟指呼贤达，孩问智人，握管窥天，抛砖引玉，此辈慎不可与语也。 八、根性浅劣，宁知造化之源。 见识昏蒙，不达乾坤之道。 只求小术，专在利门，所务家资，懒成意气。 伏毗伏粉丹砂，以银铅铜，用碌煮汞。 论此事即听心欢喜，闻至药则玲笑不言。 自此以假求真，且说从小入大，此辈慎不可与语也。 九、既知出尘之术，能求得道之人。 偏能屈节低心，亦甚瞻颜望色。 入夜则寻思计较。 明朝则便去推求。",
      "translated_text": "**The *Tai Bai Jing***\n\n**Title:** *Tai Bai Jing* (*Scripture of the Great White*). The original text does not specify an author, but it likely dates to the late Tang or Five Dynasties period. The *Daoist Canon Index* attributes it to Shi Jianwu. One scroll. Source text: *Zhengtong Daoist Canon*, *Dongshen* Section, *Zhongshu* Category.\n\n### *Tai Bai Jing*\n\nThe *Sacred Records of the Yellow Emperor* states: In the first year of the Yellow Emperor’s reign, on the first *yin* day of the *yin* month, he fasted at Mount Shou. Fang Ming and Li Mu accompanied him to the summit of Mount Juci, where they paid homage to the Great Lord Chen. There, he was bestowed with the *Twelve Scrolls of the Divine Mushroom and Numinous Charts* and nineteen formulas for gold and silver.\n\nThe Yellow Emperor then ascended Mount Wangwu, where he opened a stone casket and uncovered a jade tablet, obtaining the Way of the Nine Cauldrons’ divine elixir and the flying snow furnace fire. Later, he traveled to Mount Emei, where he encountered the Heavenly Perfected Sovereign. He bowed in reverence and entreated the Way of the Immortals.\n\nThe Sovereign said: \"Do you not know that Heaven possesses the Mysterious One, born of the Great Yang, named Flowing Pearl? It is the gate of all wonders. If you cultivate it, you may attain longevity, ascend on clouds, and pay homage to the Jade Emperor.\"\n\nThe Yellow Emperor received this teaching with gratitude. At Mount Ke, he cast a golden crucible and compounded the Great Return Elixir of Flowing Pearl. He commanded that it be transmitted to later generations. At Lake of the Crucible, he ingested the elixir and ascended to Heaven. At that time, seventy-two of his ministers who had also consumed the elixir ascended with him.\n\nPreviously, the Yellow Emperor, fearing that the Way of the Golden Elixir might be lost, entrusted the Nine Cauldrons’ divine elixir to his eldest son, charging him to transmit it to posterity. He admonished him, saying: \"This Way is most weighty. It must be passed only to the worthy. If given to the unfit, it will bring disaster upon them.\"\n\nThe eldest son then fasted on Mount Dongming, casting a golden fish into the eastern flowing waters and swearing a blood oath. Later, he transmitted the Way to the Master of Mount Shu. From then on, it was passed from sage to sage, from worthy to worthy, from the benevolent to the benevolent. Those who attained the Dao were beyond count. Heaven’s love for humanity is profound, yet if one’s heart does not align with the Dao, success remains elusive. Among ten thousand, nine thousand fail to believe, and when they hear the Way, they clap in mockery—this is all too clear.\n\nThus, the celestial mechanism must not be lightly disclosed, nor the crucible and vessels carelessly handled. The foolish, cunning, greedy, deceitful, and false must never be allowed to see it or speak of it. Yet, in the transmission and refinement of the Way, there are ten prohibitions and ten permissions, forming the Ten Admonitions.\n\n### The Ten Prohibitions\n\n1. **Those who flatter with clever words and ingratiating manners, urgently seeking to obtain the Way while scorning others as fools and themselves as cunning.** They claim that if the Dao does not oppose them, their hearts will harbor no resentment. If a single word aligns with the Way, they demand it be transmitted to them. They speak of other matters while alluding to this one, or point to others to imply themselves, employing deceit in myriad forms and uttering honeyed words. Such persons must never be spoken to.\n\n2. **Those who boast of their mastery of the Great Elixir’s methods, the gates of metal and stone, the refinement of cinnabar and mercury, or claim to have personally handled crucibles yet remain indifferent to the deeper meaning.** They first proclaim their own superiority, then barter knowledge for other matters. They boast of their schemes, claiming to encompass Heaven and Earth, repeatedly visiting and probing with questions. Such persons must never be spoken to.\n\n3. **Those who, clad in tattered robes and worn shoes, claim poverty and beg for salvation, swearing gratitude in life and remembrance in death, invoking Heaven and Earth as witnesses and the gods as guarantors.** Such persons must never be spoken to.\n\n4. **Those who, upon first acquaintance, speak with excessive familiarity and cunning words, probing shallowly into the Way.** If their questions are answered, they praise themselves and extol the other as a divine immortal. If their questions are difficult, they grow angry, slander the other, and dismiss them as frauds. They claim their own learning surpasses others’, yet their knowledge is shallow and fleeting. Such persons must never be spoken to.\n\n5. **Those whose nature is avaricious, who covet gold yet refuse to spend even a single coin, scheming only for personal gain.** They bow low, flatter, and claim, \"You are so kind—you surely won’t demand payment from me!\" Yet they clench their fists, stubbornly demanding the highest arts. Such persons must never be spoken to.\n\n6. **Those lacking discernment, who disregard the formulas and act arbitrarily, refusing to learn from a master.** Some claim a thousand coins suffice for one firing, others five hundred for one calcination. Gold vanishes with the smoke, stones scatter with the flames. When their desires are unmet, they slander the truly worthy, declaring that alchemy never succeeds and that such things do not exist in the world. They revile immortals when they see them and scowl at recluses, assuming all others are as ignorant as themselves. Such persons must never be spoken to.\n\n7. **Those who, observing others, declare them unworthy, or seeing a man of integrity, call him evil-hearted.** They think, \"If even I cannot succeed, how can you fulfill my desires?\" Though they have lived many years, they are not yet old. They dismiss the elderly as narrow-minded and the widely experienced as mere meddlers. They presume to command the wise and question the learned, grasping a brush to measure the sky or tossing bricks to attract jade. Such persons must never be spoken to.\n\n8. **Those of shallow and inferior nature, ignorant of the source of creation, their understanding dim and unable to comprehend the Dao of Heaven and Earth.** They seek only minor arts, fixated on profit. They care only for wealth, neglecting their spirit. They refine cinnabar and mercury, using silver, lead, copper, and malachite to boil mercury. When discussing such matters, they listen with delight, but upon hearing of the supreme medicine, they sneer in silence. They mistake the false for the true, claiming to progress from small to great. Such persons must never be spoken to.\n\n9. **Those who, though they know the arts of transcending the world and seek those who have attained the Dao, remain haughty and unwilling to humble themselves.** They scrutinize others’ expressions and demeanor, scheming through the night and pursuing their aims at dawn.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1248,
      "start_sentence": 0,
      "end_sentence": 55,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.71581172943115,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\太白经.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "但有纳璧之心，殊无割城之意。 专呈小巧，拟弄大贤。 敢於容易之问，获起殊常之事。 又日：下坡不走快，便难逢事在。 乘时人不再遇，或自谈俭素，自说忠良，於己自怯，劝人行阴惊，假陈慈惠，妄说方书，迷诳小人，平欺君子，为求好事，干送小心。 又曰：传我者祇为於人情酬尔，不言於财宝，此辈慎不可与语也。 十、偶遇名人，少知宗旨，自为轻薄，不辩阴阳。 或得其头，不尽其尾。 得其尾，不得其头。 是何小器易盈，向人自街。 或知者则殷葱承侍，拜告仙兄，而见妾出妻，同生同活，愿为奴赛，永奉指呼，唯期地久天长，终愿粉身碎骨。 后乃薄知去处，将谓万全，便於仙兄，当时解体，姿颜渐玲，盘酌日疏，自以得鱼忘荃，到岸舍械，我今已得大事，不要前人，请去门栏，自修铅汞。 殊不知至人鉴人识物，占往知来，先审斯人，终非大器，岂以口言貌笑，杯酒家餐，而传授神仙大事，天地至机者哉。 如此辈始则自谓事了，先负仙兄，终则渐觉事非，却谤高士，自贻伊戚，谁致悔尤。 噫，茫茫古今，世问此辈甚多，慎不可与语也。 右此十不可与语者，得道君子慎而鉴之。 若泄玄机，自招悔咎。 然则得人不传，谓之秘藏天道，亦不可也。 非其人而传者，枉泄天道，窃弄阴阳，大不可也。 十可者 一、不问贫穷富贵尊卑，帝王宰辅，侯伯文武，庶人士农工商等，但有道者可传。 然先审其人，评其可否，方可传授。 二、不以黄白事，不以势力所知，在富如贫，居官若庶，志求大道，只慕长生，言不谄谀，行无狡曲，不可以暂时为事，故审平昔之期，若是其人，此可传付。 三、先与言论，审察根基，傥若不昧阴阳，能明卦象，知造化之理，识天地之恩，洞达晦明，深晓进退，五行四象，七返九还，行与业同，身将心正，又虑福而无德，聪而不明，始吉终凶，先得后失，不可追悔，必也藏机密事，抱智而愚，慎审其人，此可传授。 四、若见孜孜於家事，苦苦於身名，务於意气，事於风雅，此不可与语也。 若见守真任直，少能自足，薄於人事，不与家累，淡薄名利，於亲无情，於人不诈，此可传授。 五、有慈惠之心，无亲疏之意，欲博施而力不备，重高人而家具贫，细察行藏，此可传授。 六、事君忠节，居上不矜，俸薄家贫，守真不躁，而能恬淡自牧，不事轻浮，心在虚无，不急名禄，此可传授。 七、事亲於家，孝闻闻里，仁德兼着，清淡自持，志慕长生，此可传授。 八、与物无竞，心绝冤亲，自将天道为心，不以还丹为念，无心合道，道自目前，此可传授。 九、无家绝累，野鹤孤云，不为人事所拘，不备时宜之礼，人不识我，我不识人，心慕长生，不逢至道者，此可传授。 十、时有道倡，多居岩室，独处云林，岁腊齐高，亲交双泯。 然后察言观行，不欺彼弱无心者，此可传授。 右此十可者，得道之士，百年之内，可传三人。 前有十不可者，慎勿传也。 然传授之时，须具十全，方得成就大丹，若不十全，不可妄为也。 十全者 一全，有修炼之地。 慎择名山大岳，来山去水，五行相生，不为凶山恶水，虚耗所忌，不为凡人俗眼，来去秽恶混杂，此未可也。 二全，备其财本，财本若备，无所牵率，不令所少短，并须修炼之人心意，自然而然，不得将无作有，迟疑之问，有所忧悔。",
      "translated_text": "Those who harbor only the thought of offering jade disks, yet lack the resolve to cede cities. They display petty cunning, seeking to deceive great sages. They dare to pose simple questions, only to provoke extraordinary matters. As the saying goes: *\"One who does not quicken their pace downhill will seldom encounter opportunity.\"* Yet when the moment passes and is never met again, they may boast of frugality, claim loyalty, while cowardice rules their own hearts. They urge others to act in secret, startling them, feigning kindness and mercy, recklessly expounding esoteric texts, deceiving the foolish, and brazenly misleading the wise—all to curry favor, offering obsequious deference. Another saying warns: *\"Those who transmit the Way to me do so only to repay human sentiment, not for wealth or treasure.\"* Such persons must never be spoken to.\n\n10. **Those who, having chanced upon a master and grasped a fragment of the teaching, grow arrogant and fail to discern yin and yang.** They may grasp the head but not the tail, or the tail but not the head. How petty and easily sated! They boast to others of their knowledge. If they meet one who truly knows, they fawn and flatter, bowing and pleading, *\"O Immortal Brother!\"* They offer wives and concubines, vowing to live and die together, to serve as slaves and servants, forever awaiting commands, hoping for eternal union, even willing to be ground to dust. Later, when they learn a little of the path and deem themselves secure, they turn on their *\"Immortal Brother,\"* their bodies withering, their faces growing cold, their feasts dwindling day by day. Like one who catches a fish and forgets the trap, or reaches the shore and discards the raft, they declare, *\"I have now attained the great matter and no longer need my former master. Remove the gate and threshold—I shall refine lead and mercury on my own!\"*\n\nLittle do they know that the perfected see through people and things, foreseeing past and future. They discern from the outset that such a person is no vessel of greatness. How could they transmit the great affair of immortality, the supreme mechanism of Heaven and Earth, merely for pleasant words, a smiling face, or a cup of wine and a home-cooked meal? At first, such persons believe their work is done and betray their *\"Immortal Brother.\"* Later, when they gradually realize their error, they slander the lofty adept, bringing misfortune upon themselves—who can blame them for their regret?\n\nAlas! From ancient times to the present, such persons abound in the world. They, too, must never be spoken to.\n\nThese ten types of persons must not be spoken to—those who have attained the Dao should carefully heed this. To reveal the mysteries to them is to invite one’s own remorse. Yet to withhold the teaching entirely, calling it the *\"hidden treasury of Heaven’s Way,\"* is also improper. To transmit it to the unworthy is to squander the Dao, recklessly meddling with yin and yang—a grave error.\n\n**The Ten Worthy of Transmission**\n\n1. Regardless of poverty or wealth, high or low status—whether emperor, minister, lord, scholar, warrior, commoner, farmer, artisan, or merchant—any who possess the Dao may be taught. Yet one must first examine their character, weigh their worthiness, and only then transmit the teaching.\n\n2. Those who do not seek alchemical gold or silver, nor rely on power or influence; who remain humble in wealth and unassuming in office; who seek the great Dao and long only for longevity; whose words are free of flattery and whose conduct is without deceit; who do not act on impulse but carefully consider their lifelong aspirations—if such a person is found, they may be entrusted with the teaching.\n\n3. First, engage them in discourse to assess their foundation. If they are not ignorant of yin and yang, can comprehend the trigrams, understand the principles of creation, recognize the benevolence of Heaven and Earth, penetrate obscurity and clarity, deeply grasp advance and retreat, the Five Phases and Four Images, the Seven Returns and Nine Revolutions; if their conduct aligns with their practice, their body with their heart, yet they fear misfortune despite lacking virtue, or possess keen perception but lack true insight—if their beginnings are auspicious but their ends inauspicious, their gains followed by losses, with no chance for regret—then, if they can guard secrets, feigning foolishness while holding wisdom, carefully examine them. Such a person may be taught.\n\n4. Those who toil endlessly over family affairs, obsess over reputation and status, pursue pride and elegance—these must not be spoken to. But those who uphold truth and integrity, are content with little, unburdened by worldly affairs, free from family entanglements, indifferent to fame and profit, unfeeling toward kin, and guileless toward others—these may be taught.\n\n5. Those with a heart of kindness and mercy, without partiality; who wish to give generously but lack the means; who revere the lofty yet live in poverty—carefully observe their conduct and concealment. These may be taught.\n\n6. Those who serve their lord with loyalty, remain humble in high office, endure meager salaries and poverty with patience, uphold truth without restlessness, cultivate tranquility, avoid frivolity, dwell in emptiness, and do not covet fame or rank—these may be taught.\n\n7. Those who serve their parents at home with filial piety, known throughout the neighborhood; whose benevolence and virtue shine forth; who maintain purity and simplicity, and aspire to longevity—these may be taught.\n\n8. Those who do not contend with others, whose hearts are free of enmity; who take the Dao of Heaven as their mind, not fixating on the elixir; who merge with the Dao without intent, finding the Dao naturally before them—these may be taught.\n\n9. Those without family or burdens, like wild cranes and solitary clouds; unconstrained by worldly affairs, unbound by social conventions; unknown to others and knowing no one; who long for longevity but have not met the supreme Dao—these may be taught.\n\n10. Those who, when the Dao flourishes, dwell in mountain caves, alone in clouded forests, their years and virtues high, their worldly ties severed. Then, observing their words and deeds, if they do not deceive the weak or the guileless—these may be taught.\n\nThese ten types of persons are worthy of transmission. Those who have attained the Dao may, within a hundred years, transmit the teaching to three such individuals. As for the ten unworthy types mentioned earlier—take care never to transmit to them.\n\nWhen transmitting the teaching, one must possess the **Ten Perfections** to achieve the great elixir. Without them, do not act recklessly.\n\n**The Ten Perfections**\n\n1. A place for cultivation and refinement. Carefully select a famous mountain or great peak, with auspicious terrain—mountains that gather and waters that flow—where the Five Phases generate one another, avoiding inauspicious mountains or malevolent waters that deplete and harm. Do not choose a place defiled by the eyes of the vulgar, where the impure and the sacred mingle. This is unacceptable.\n\n2. Sufficient resources. If resources are ample, nothing will be lacking, and no delays will arise. The cultivator’s heart must be naturally at ease, not fabricating what does not exist or hesitating in doubt, lest regret follow.",
      "overlap_context": "sing such matters, they listen with delight, but upon hearing of the supreme medicine, they sneer in silence. They mistake the false for the true, claiming to progress from small to great. Such persons must never be spoken to.\n\n9. **Those who, though they know the arts of transcending the world and seek those who have attained the Dao, remain haughty and unwilling to humble themselves.** They scrutinize others’ expressions and demeanor, scheming through the night and pursuing their aims at dawn.",
      "start_char": 1248,
      "end_char": 2540,
      "start_sentence": 56,
      "end_sentence": 95,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.319364070892334,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\太白经.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "三全，直时童子，须是奇人。 若非高上灵性，不可指使，柢令直符，不可与知道。 虑若小驮，轻泄於人。 四全，起炉鳌，高低尺寸，阔狭厚薄，并依法则。 取土方向泥，起火时日，门户开闭，多少方所，重迭数目，各臻其道。 五全，鼎器法则，须依其道，亦有高低小大，将狭斤两，厚薄深浅，并须子细究寻玄妙，契合真文，不可妄为。 若识真鼎，已是智人。 六全，须识真药。 既识真药，须知收采之时。 故准南王日：采於蚕食之前，用於火化之后。 则知非金石，则木也。 木王於二月，废於八月，伏於十月，此昭然可见矣。 八月秋动霜零，乾条叶落，还归於地也。 七全。 阙。",
      "translated_text": "3. A steadfast youth, who must be an extraordinary person. If not of lofty and numinous nature, they cannot be employed; merely having them attend to the talismans is insufficient, for they must not be privy to the Way. Beware lest they, being of small capacity, lightly divulge it to others.\n\n4. The construction of the furnace and crucible, their height and depth, width and thickness, must all adhere to the established method. The direction from which the earth is taken, the clay’s orientation, the time and day of kindling the fire, the opening and closing of doors, the quantity of space, the number of layers—each must attain its proper Dao.\n\n5. The crucible’s method must follow the Way, including its height and size, weight and breadth, thickness and depth. All must be meticulously examined to fathom its profound subtleties, aligning with the true text. Do not act recklessly. One who recognizes the true crucible is already a person of wisdom.\n\n6. One must recognize the true medicine. Having recognized the true medicine, one must know the time of its gathering. Thus, the Prince of Huainan said: *\"Gather it before the silkworms feed, use it after the fire’s transformation.\"* From this, we know it is neither metal nor stone, but a plant. The plant flourishes in the second month, decays in the eighth, and lies dormant in the tenth—this is clearly evident. In the eighth month, autumn stirs, frost descends, and withered branches and fallen leaves return to the earth.\n\n7. [Missing]",
      "overlap_context": "at gather and waters that flow—where the Five Phases generate one another, avoiding inauspicious mountains or malevolent waters that deplete and harm. Do not choose a place defiled by the eyes of the vulgar, where the impure and the sacred mingle. This is unacceptable.\n\n2. Sufficient resources. If resources are ample, nothing will be lacking, and no delays will arise. The cultivator’s heart must be naturally at ease, not fabricating what does not exist or hesitating in doubt, lest regret follow.",
      "start_char": 2541,
      "end_char": 2809,
      "start_sentence": 96,
      "end_sentence": 110,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.382690191268921,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\太白经.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "八全，采取收持，须能洗洒，谓之沐浴。 沐浴既诤除根收叶，去骨留肥，迎入房拢，从兹会合。 九全，若入鼎炉，安排依法，分明四象，匹配五行，不乖二仪，并交两曜。 造物者我，发生者谁。 十全，水火也。 有无并合子午，依时亏圆，并在於月中。 飞伏尽由於卦裹，精修到此，方好用心，名为十全，得称至士。 然十全无有一者，则不可与言道。 十全而有一不全。 即亦阙於道。 故至士审而行之，不其然乎。 《四明先生传》曰：四者，则四象，束西南北也。 明者，日月也。 先者，先天地，为万物之先也。 生者，道也。 道生一，一生二，二生三，三生万物。 又曰：一者，水。 二者，火，三者，木。 此三者能成万物，万物者土也。 所谓三者，能运转终归土，土者五也。 五为四之父，四为五之子，故五为帝王，四为长子。 故帝王有养育之德，长子有杀伐之权。 故帝王与长子，合其九数。 岂不然乎哉。 或曰：三主乎震，震主束宫。 四为兑宫。 却称长子。 答曰：然长子始於震宫，终於兑宫，故同名共色。 静为动根。 《易》曰：同声相应，同气相求。 即其义也。 又曰：五行相生，四象相制，终归於土。 万物从土生，归土死。 五行名异而体同，同谓之玄。 玄，水也。 水能生木，木能生火，火能生土，土能生金。 金为白虎，木为青龙，火为朱雀，水为玄武。 以玄武制朱雀，以白虎制青龙。 故古人曰：欲定四方，先看颜色。 故并事而说之。 且如银铅砂汞，自定四方。 如是则便识水火，兼知龙虎。 岂不知水能杀火，金能克木乎，又何以迷於大道乎。 以此论之，千经万书，诸子群论，广明五行八卦，四象六位，不尔失总久矣。 盖不言神水华池，亦不论龙虎交感。 李诠注《阴符经》按黄帝曰：金丹之术百数，其要在神水华池。 但古今虽有其文，不显其理。 且神水华池者，万物之母。 而有一德，五行之首，坐而面南，先天而生，先地而有实，天地之母。 知白守黑，不刚不柔，如石如水，与物无竞，为五金八石之尊。 澄之若太虚之色，含於五彩。 古人曰：一物含五彩，永作神仙禄。 贤人君子岂不明乎。 既明神水，销作华池，然后於中交感龙虎，龙虎既已交感。 则弃华池无用也。 故古人曰：用铅不用铅，须向铅中作。 若向铅中求，依前还是错。 又曰：用铅不用铅，须向铅中取。 欲炼大还丹，须知铅是母。 又曰：既识砂中汞，须求铅裹金。 又曰：铅为牙母，牙为铅子。 既得金华，舍铅不使。 又曰：牙若是铅，弃铅万里。 牙若非铅，从铅而始，又曰：还丹本元铅，铅裹亦元丹。 造丹不用铅，铅是大丹田。 田者，土也。 万物从土而生。 故青霞子曰：神仙之道，千变万化，莫过於铅汞神水华池之道，独有龙虎交感一门，自轩辕已来，不上文墨，柢口传秘诀，心授灵符。 今且直指神水华池於世问，未论龙虎交感於文内，其有修炼炉鼎，火候进退，与诸家并同，此更不参述也。 至於八卦五行，七返九还，鼎炉法样，既济未济，尽是殊事。 盖丹家自要贵重作用之道，但能得知水火华池，龙虎交感，已得大还丹之秘要也。 施肩吾颂曰： 神水华池便是丹，束西高下自相看。 劝君莫把凡铅弄，活计生涯便好捐。 铅则何妨本自铅，铅中何处觅神仙。",
      "translated_text": "Eighth Perfection: Gathering, harvesting, and preserving must be done with cleansing—this is called \"bathing.\" Once bathed, strip away the roots and leaves, remove the bones and retain the essence, then welcome it into the chamber and assemble it. Thus, the union begins.\n\nNinth Perfection: When placing it into the crucible, arrange it according to the method, clearly distinguishing the Four Symbols, matching the Five Phases, aligning with the Two Modes, and uniting the Two Luminaries. The Creator is I—who then brings forth generation?\n\nTenth Perfection: Water and fire. Presence and absence unite at *zi* and *wu*, waxing and waning with the hour, all within the moon’s cycle. Flight and concealment are fully determined by the hexagrams. Only when cultivation reaches this point may one apply true focus—this is called the Tenth Perfection, and one who attains it is called a *zhi-shi* (perfected person). Yet if even one of the Ten Perfections is lacking, one cannot speak of the Dao. If the Ten Perfections are complete but one is flawed, the Dao remains incomplete. Thus, the *zhi-shi* examines and acts accordingly—is this not so?\n\nThe *Biography of the Master of Siming* states: \"Four\" refers to the Four Symbols—east, west, south, and north. \"Bright\" refers to the sun and moon. \"Prior\" means before heaven and earth, the first of all things. \"Life\" is the Dao. The Dao gives birth to the One, the One gives birth to the Two, the Two give birth to the Three, and the Three give birth to the myriad things. It also says: The One is water; the Two is fire; the Three is wood. These three can complete the myriad things, and the myriad things are earth. Thus, the Three revolve and ultimately return to earth, and earth is Five. Five is the father of Four, and Four is the son of Five. Therefore, Five is the emperor and king, and Four is the eldest son. Thus, the emperor and king possess the virtue of nurturing, while the eldest son holds the power of execution. Together, the emperor and the eldest son form the number Nine—is this not so?\n\nSome ask: The Three governs *Zhen* (Thunder), and *Zhen* governs the eastern palace. Four belongs to *Dui* (Lake), the western palace—why then is it called the eldest son? The answer: The eldest son begins in the *Zhen* palace and ends in the *Dui* palace, thus sharing the same name and color. Stillness is the root of movement. The *Book of Changes* says: \"Like sounds resonate; like qi seeks its kind.\" This is its meaning. It also says: The Five Phases generate one another; the Four Symbols restrain one another, ultimately returning to earth. The myriad things are born from earth and die returning to earth. The Five Phases have different names but share the same essence—this shared essence is called the Mysterious. The Mysterious is water. Water can generate wood, wood can generate fire, fire can generate earth, and earth can generate metal. Metal is the White Tiger; wood is the Azure Dragon; fire is the Vermilion Bird; water is the Dark Warrior. The Dark Warrior restrains the Vermilion Bird; the White Tiger restrains the Azure Dragon. Thus, the ancients said: To stabilize the four directions, first observe the colors. Therefore, these matters are discussed together.\n\nFor example, silver, lead, cinnabar, and mercury naturally determine the four directions. In this way, one readily discerns water and fire and simultaneously knows the Dragon and Tiger. How could one not understand that water can extinguish fire and metal can overcome wood? How then could one remain deluded about the Great Dao? From this perspective, the thousands of classics and myriad books, the various masters and their discourses—all expounding the Five Phases, Eight Trigrams, Four Symbols, and Six Positions—would have long since lost their coherence without this foundation. For they do not speak of the divine water and flowery pond, nor do they discuss the mutual arousal of Dragon and Tiger.\n\nLi Quan’s commentary on the *Yin Fu Jing*, citing the Yellow Emperor, states: Among the hundred methods of golden elixir, the essential lies in the divine water and flowery pond. Though the texts have existed from ancient times to the present, their principles remain obscure. The divine water and flowery pond are the mother of the myriad things, possessing a singular virtue, the first of the Five Phases. Seated facing south, it exists prior to heaven, prior to earth, and possesses substance—it is the mother of heaven and earth. Knowing the white and guarding the black, neither hard nor soft, like stone yet like water, it competes with nothing and is the most revered among the five metals and eight minerals. When settled, its color is like the Great Void, containing the five hues. The ancients said: \"One thing contains five colors, eternally serving as the immortal’s emolument.\" How could the worthy and the gentlemen not understand this?\n\nOnce the divine water is clarified and transformed into the flowery pond, the Dragon and Tiger may then arouse each other within it. After the Dragon and Tiger have aroused each other, the flowery pond is discarded as useless. Thus, the ancients said: \"Use lead yet do not use lead—you must work within the lead. If you seek within the lead, you will still err as before.\" It also says: \"Use lead yet do not use lead—you must take from within the lead. To refine the Great Return Elixir, you must know that lead is the mother.\" And again: \"Having recognized mercury within cinnabar, you must seek gold within lead.\" And: \"Lead is the mother of sprouts; sprouts are the children of lead. Once the golden essence is obtained, discard the lead.\" And: \"If sprouts are lead, abandon lead by ten thousand *li*. If sprouts are not lead, begin with lead.\" And again: \"The original elixir is fundamentally lead; within lead also lies the original elixir. To make the elixir, do not use lead—lead is the Great Elixir Field. The field is earth. The myriad things are born from earth.\"\n\nQingxiazi said: The Dao of immortality encompasses a thousand transformations and ten thousand changes, but none surpass the Dao of lead, mercury, divine water, and the flowery pond—particularly the single method of the mutual arousal of Dragon and Tiger. Since the time of the Yellow Emperor, this has never been committed to writing; only oral transmission of secret formulas and heart-to-heart transmission of spiritual talismans have preserved it. Now, I directly point to the divine water and flowery pond for the world, though I have not yet discussed the mutual arousal of Dragon and Tiger within the text. As for the refinement of the crucible, the regulation of fire times, and the advance and retreat of the firing process—these are the same as in other schools, and I will not elaborate further here.\n\nAs for the Eight Trigrams, Five Phases, seven returns and nine revolutions, the forms of crucibles and furnaces, the *jiji* and *weiji* hexagrams—these are all distinct matters. The alchemical school values only the practical methods of operation. If one can comprehend the divine water, flowery pond, and the mutual arousal of Dragon and Tiger, one has already grasped the essential secret of the Great Return Elixir.\n\nShi Jianwu’s verse says:\nThe divine water and flowery pond are the elixir itself,\nEast and west, high and low, observe each other.\nI urge you: do not play with common lead—\nYour livelihood and career would be better abandoned.\n\nLead—why fear it when it is fundamentally lead?\nYet where within lead can one seek immortality?",
      "overlap_context": "Having recognized the true medicine, one must know the time of its gathering. Thus, the Prince of Huainan said: *\"Gather it before the silkworms feed, use it after the fire’s transformation.\"* From this, we know it is neither metal nor stone, but a plant. The plant flourishes in the second month, decays in the eighth, and lies dormant in the tenth—this is clearly evident. In the eighth month, autumn stirs, frost descends, and withered branches and fallen leaves return to the earth.\n\n7. [Missing]",
      "start_char": 2810,
      "end_char": 4046,
      "start_sentence": 111,
      "end_sentence": 185,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.438552141189575,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\太白经.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "束西南北还丹了，争奈仙家不肯传。 同色同名合好音，亦能烁烁亦沉沉。 乾坤颠倒驱雷雨，龙跃安能出上阴。 太白经竟",
      "translated_text": "The Return Elixir is perfected in all directions—east, west, south, and north—\nYet how can one fault the immortals for refusing to transmit it?\nOf the same color and name, harmonizing in fine resonance,\nIt may gleam brightly or sink deeply.\nHeaven and Earth inverted, driving thunder and rain,\nHow could the Dragon’s leap ever escape the Supreme Yin?\nThe *Tai Bai Jing* concludes.",
      "overlap_context": "ion. If one can comprehend the divine water, flowery pond, and the mutual arousal of Dragon and Tiger, one has already grasped the essential secret of the Great Return Elixir.\n\nShi Jianwu’s verse says:\nThe divine water and flowery pond are the elixir itself,\nEast and west, high and low, observe each other.\nI urge you: do not play with common lead—\nYour livelihood and career would be better abandoned.\n\nLead—why fear it when it is fundamentally lead?\nYet where within lead can one seek immortality?",
      "start_char": 4047,
      "end_char": 4111,
      "start_sentence": 186,
      "end_sentence": 189,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 2.5237526893615723,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\太白经.txt",
        "category": "众术类"
      }
    }
  ]
}