{
  "source_id": "女丹十则",
  "source_file": "chunked_daozang\\女丹十则.json",
  "total_chunks": 9,
  "total_original_chars": 6024,
  "total_translated_chars": 32026,
  "total_translation_time": 150.34900093078613,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\藏外\\女丹十则.txt",
    "category": "藏外"
  },
  "full_translation": "Here is the translation:\n\n---\n\n*Ten Principles of Female Alchemy*\n*Recorded by the Ancient Mother of Xiangyi of Golden Flower Mountain*\n*Edited and Revised by Chen Yingning*\n\n**Reader’s Notice:**\n\n1. This book bears no author’s name, and the old attribution to the \"Ancient Mother of Xiangyi of Golden Flower Mountain\" is crude and shallow. Though the author may not have wished to use their real name, why fabricate a sacred title? Thus, it has been omitted from this edition.\n\n2. Though the book is titled *Ten Principles*, the fifth and sixth principles are largely identical in content, while the tenth is overly vague, rendering its separate inclusion unnecessary. For these three sections, substantial revisions and abridgments have been made to spare the reader undue tedium. Other sections have also been edited or condensed. Should scholars compare the original with this edition, they will recognize the necessity of these revisions—not as meddlesome interference, but as reasoned improvement.\n\n3. Beyond the main text, all appended annotations are my own. Readers are urged to pay close attention, for these commentaries are the fruit of decades of experience, unlike the careless, baseless assertions one often finds in others’ writings.\n\n4. The appended *Kun Formula* is not definitively attributed to Sun Buer, though its prose is concise and admirable. As for Fu Jinquan’s annotations, they are regrettably cluttered with metaphors, which may hinder comprehension. The origins of the terms \"Yellow Sprout\" and \"White Snow\" at the end of the text are explained in detail in my notes—readers should study them carefully.\n\n5. Since ancient times, fewer than thirty texts on female alchemy containing true methods have been preserved in this land. One cannot expect to find many more. Scholars must read them all to grasp the fundamentals, then seek teachers and fellow practitioners for hands-on cultivation. Only then may success be hoped for. Beware of half-understanding and self-satisfaction.\n\n*July, Year 24 of the Republic of China*\n*Year 4,632 of the Yellow Emperor’s Calendar*\n\n---\n\nChen Yingning of Wanjiang wrote this preface in proxy.\n\n**First Principle: Nurturing the True and Transforming Qi**\n\n*(Yingning notes: In Daoist practice, oral instructions are paramount—whether a text’s prose is refined or crude matters little. Some works may suffer from flawed theories, awkward phrasing, shallow insights, or superstitious admixtures, all of which may invite disdain and cause even their authentic oral instructions to fade into obscurity. This is deeply regrettable. In compiling this book, I aim to guide women of above-average learning. Had I merely transcribed the original texts, I might have drawn ridicule from the cultivated. Thus, I have distilled their essence, excised their flaws, and though the result may not be entirely pure, it is far more presentable than the originals.)*\n\nFemale cultivation differs from that of males. In men, yang descends and dissipates; in women, yang ascends. Men possess a rigid constitution; women, a yielding one. Men preserve the yang essence of the dantian, preventing its external leakage. Over time, they employ the true fire within the body to refine essence into qi, qi into spirit, and spirit into emptiness, thereby attaining the Dao. Women, being of yin constitution, must transform the spiritual marrow of the breasts to alter their qi quality. Through prolonged refinement, the red naturally reverts to white, and blood transforms into qi. Once blood has become qi, they too employ the fire talisman to advance and retreat, enabling qi to revert to pure yang and the Dao to return to its true state.\n\nThus, in their initial work, women first refine their physical form before refining their original essence—a reversal of the male path, which begins with refining original essence before the physical form.\n\nWhat is meant by *nurturing the true*? The human heart is easily swayed; if constrained within, it grows restless. Therefore, the first step teaches the method of nurturing the true, which naturally alleviates restlessness, harmonizes the four limbs, and prepares one for further progress.\n\nDuring daily seated practice, one must mobilize the qi mechanism within the dantian and sea of blood, directing it toward the mind’s inner chamber. There, a wisp of clear qi emerges from the sea of blood. With prolonged focus, this qi stirs and, following its own momentum, soars upward to the niwan. It then descends, and at this moment, one subtly guides it with intention, following its movement from the niwan down the *chonglou*. Here, intention must not be forced, lest the body be harmed. Instead, allow the qi to descend naturally from the *chonglou* to the space between the breasts, where an empty cavity resides. After prolonged concentration, if movement arises, proceed as before. Within forty or fifty days, the qi will penetrate, blood will transform into qi, and the red will revert to white. At this stage, the primordial elixir manifests, and the heart of the Dao becomes sincere.\n\nIf one persists in quiet abiding, unwavering in morning and evening, and diligent at all times, how could the great elixir fail to coalesce, or the female immortal remain unrealized? This is the first step in female cultivation. If one attains its most profound and wondrous state, all subsequent work will advance from this foundation.\n\nStudents, take heed.\n\n*(Yingning notes: When the qi descends from the niwan, the text first says, \"subtly guide it with intention,\" then warns, \"do not use intention.\" So, is intention to be used or not?)*\n\nShould intention be used or not? At this stage of movement, it lies between the intentional and the unintentional. To follow its natural course, one says, \"Do not use intention.\" Yet it cannot be left unattended, hence one says, \"Guide it subtly with intention.\"\n\n**Second Principle: The Nine Cycles of Refining Form**\nRefining form means regulation and nurturance. Blood and fluids, belonging to yin and yang, congeal and reside below, stored in the Sea of Blood and the womb, transformed at the summit of the Five Skandhas Mountain. They irrigate the entire body, nourishing the hundred vessels, circulating without cease, overflowing through the meridians, only to become dregs and be discarded. After two hundred and forty ke and thirty double-hours have passed, the refined essence re-emerges, the primordial transforms form, and it is retained for the sustenance of life. This is what is meant by the pure qi ascending to the breasts, while the turbid qi flows downward as stagnation—the pivot where mortals and immortals diverge. Thus, in female cultivation, one must first discern the pure from the turbid to refine the true form.\n\nHow is form refined? While seated, employ the spirit’s mechanism to move, waiting until the mouth is filled with fluid. Gently rinse several times, allowing it to settle and clarify. Then, draw in pure qi through the nose, swallowing it along with the jade-like fluid, descending past the Tower of Jade into the Crimson Palace, down to the Yellow Chamber, and halting at the Sea of Blood in the Pass of Origin. After a brief pause, circulate it from the Sea of Blood to the Tailbone, ascending along the Spine’s Ridge to penetrate the Crown Gate and enter the Mud Pill Palace. From there, descend again to the space between the breasts and rest. After a long pause, let the fluid transform into qi—this is one cycle. Repeat this three times for a total of three cycles. Once complete, use both hands to rotate the breasts thirty-six times. Then, cup them and gently guide them to the center, moving downward to the Sea of Blood, and repeat the process as before. One session consists of three cycles, and three sessions yield nine cycles in total.\n\nIf a woman is serene, dignified, deeply rooted, and of profound capacity, practicing this for no more than a hundred days will refine her form, and the path to longevity will open. From here, further progress may be sought, and the great elixir will be within reach.\n\n**Third Principle: Applying the Fire and Talisman**\nMen refine the medicine first, then the form. Women refine the form first, then the medicine. Their physical constitutions differ, so the order of practice varies. Female cultivators should follow the previous instructions diligently. When, in the Sea of Blood within the Elixir Field, the qi mechanism warms, a wisp of pure qi will naturally surge upward to the Heart Chamber and reach the breasts. At this moment, one must not stir a single thought. Continue the practice as before, and the qi will naturally descend again, returning to the Sea of Blood. By this time, the qi mechanism has stirred, true qi has arisen, and the yin of red blood has transformed into the yang of white qi. If the fire and talisman are not applied, the qi will revert to red blood, the white will turn back to red, and all effort will have been in vain.\n\nAt this stage, one must use true fire to refine it and true talisman to respond to it. When the talisman arrives and the fire is sufficient, the qi will congeal. At this moment of congealment, a distinct phenomenon arises. If not clearly explained, the application of fire and talisman may err, risking harm to the primordial elixir. Practitioners must memorize this carefully and not forget.\n\nIf this step is misapplied, not only will prior efforts be wasted, but future practice will be difficult, and there may even be harm to body and life, with the risk of blood collapse. Take heed: when the qi returns to the Sea of Blood, though it emerges from the blood, it is not blood itself. Like a traveler returning home in disguise, even family and wife may not recognize them—how could they be as before? Thus, as it descends, the Sea of Blood must feel like a fish drawing in water. At this time, the four limbs grow languid as if drunk, and the bliss is akin to the union of husband and wife, an ecstasy beyond restraint.\n\n*(Yingning notes: Some say the bliss felt in the body at this moment surpasses that of the union of man and woman manyfold. For certain women, naturally cold in temperament, who encounter weak men, there may be no pleasure at all in such encounters. But in the practice of Daoist cultivation, a woman—though alone, with a pure heart and few desires, seated in quiet meditation—if she harmonizes the yin and yang within her body according to the method and enters the most profound and wondrous state, will encounter extraordinary phenomena. The bliss is beyond words. While men practicing quiet cultivation may sometimes experience blissful phenomena, compared to the degree of bliss in women, it is but two or three parts out of ten. This pertains to the physiological differences between men and women, not something that can be forced by human effort.)*\n\nUpon reaching this stage, one must firmly maintain control and under no circumstances indulge in laxity. With a single thought, concentrate and guard the Central Palace, allowing it to gather for a long while—naturally, it will surge upward to breach the passes, ascending into the Mud Pill Palace and transforming into Jade Nectar. Then, with intention, guide it downward past the Tower of Multi-Storied Chambers, halting between the two breasts. Employ the method of congealing qi to blend it, ensuring it gathers without dispersing. With prolonged practice, one will naturally return to the root and restore the original state, thereby connecting with fetal breathing. Once fetal breathing is established, the Dao of immortality may be attained in a matter of days. Women cultivators should mutually encourage one another in this pursuit.\n\n**Fourth Principle: Silent Circulation of Fetal Breathing**\nFor women cultivators who diligently follow the preceding oral instructions with wholehearted devotion, true qi will naturally grow day by day, and blood will transform into fluid, flowing from between the breasts to circulate through the hundred vessels, nourishing the entire body. This fluid, born of blood’s transformation, must be constantly warmed and nurtured by internally circulating the primordial harmonizing qi, so that it may stabilize the Central Field and serve as the foundation for transcendence.\n\nWhat is meant by \"internally circulating the primordial harmonizing qi\"? It refers to breath that arises from and is stabilized within the center. In women’s cultivation, having obtained Jade Nectar, one must employ this qi to congeal it, ensuring the fluid does not dissipate and may instead coalesce into the Reverted Elixir. During this internal circulation, the movement neither adheres to nor departs from the mouth and nose—though it bears the name of breathing, it possesses no form of breathing. Why is this? It borrows the function of breathing to fulfill the meaning of breathing.\n\nFor the breathing of the mouth and nose belongs to the postnatal realm, while internal circulation pertains to the prenatal. At this stage, emphasis is placed on the prenatal, not the postnatal. Prenatal breathing has a name but no form, and as the postnatal breath of the mouth and nose naturally rises and falls, so too does it. With prolonged practice, each breath returns to the root, and the qi of respiration no longer depends on the mouth and nose. Thus, fetal breathing is achieved, and the Dao of immortality is not far off.\n\n*(Chen Yingning’s note: The original text did not clearly explain this stage of practice. Fearing that later learners might struggle to comprehend it, I have endeavored to simplify it. I have revised and abridged much of the original text to make it more accessible.)*\n\nAt its subtler turns and finer points, the transmission must come through a master’s oral instruction and direct guidance. The disciple must also inwardly grasp and spiritually comprehend it, personally verifying it within their own body. With deep and prolonged practice, the moment will come when all falls naturally into place. Should one suddenly achieve thorough penetration, they will spontaneously align with the marvels of the Dao, and need no longer be rigidly bound by written words.\n\n**Fifth Principle: Broadening Meritorious Conduct**\n\nIf a woman can quietly cultivate the supreme Dao, having refined the jade-fluid returning elixir, recognized her prenatal visage, and stabilized her fetal breathing practice, she must then rely on external conduct to nurture the root of the Dao. Only thus can she avoid external deficiencies while internally receiving support. She should serve her parents-in-law with utmost filial devotion, interact with others with sincerity and kindness, show compassion to orphans and widows, relieve suffering and aid the poor, respect her teachers and elders, and live in harmony with her neighbors. Her movements should not be frivolous, her speech not arrogant. All her actions should conform to principle and propriety, so that her qi and disposition become naturally harmonious. Without seeking meritorious conduct, it will establish itself.\n\n*(Chen Yingning’s note: This section has been greatly abridged; what remains is sufficient.)*\n\n**Sixth Principle: Resolute Commitment and Steadfast Practice**\n\nIf a female cultivator of the Dao can find an enlightened teacher, grasp the oral instructions, refine her character, and vow to devote herself to practice with unwavering perseverance, then the attainment of immortality may be realized in due time. Yet the nature of women is often fickle and mutable; when faced with adversity, it is difficult to ensure that her original resolve will not falter. She may be led astray by misleading paths, adopting perverse or biased views, thereby squandering all prior efforts and sinking into the sea of karmic suffering—alas, how lamentable!\n\nThough many in the world transmit the Dao, those who receive its true transmission are rare, and many err, misleading both themselves and others. Here, the oral instructions of *Nüdan* are clearly expounded to guide those of karmic affinity. May they leap free from the sea of delusion, reach the other shore, and ensure that no jade-like soul is shattered in the Yellow Springs, while the rosy-cheeked gain the art of preserving their youth. If this is maintained without loss, boundless joy shall be theirs—how could this not be a cause for celebration?\n\nThe precepts are as follows:\n1. **First Precept:** Honor and serve one’s parents-in-law.\n2. **Second Precept:** Uphold integrity and uprightness.\n3. **Third Precept:** Be cautious in speech.\n4. **Fourth Precept:** Exercise care in conduct.\n5. **Fifth Precept:** Revere the teacher and honor the Dao.\n6. **Sixth Precept:** Maintain an unchanging resolve.\n\n*(Chen Yingning’s note: Four-fifths of the original text has been omitted as it is of no great importance. As for the six precepts, though each was originally accompanied by explanations, these have not been included, for their general meaning is already clear.)*\n\n**Seventh Rule: Cultivating the Original Spirit**\nThe practice of women is swifter than that of men. In the female elixir method, from nurturing the true to embryonic breathing, the greater part of the work is already accomplished—unlike the male practice, which requires many additional steps to reach the stage of spirit regulation. Thus, once the work of nurturing the true and embryonic breathing is complete, the female method proceeds directly to external cultivation. When external conduct is sufficiently refined, one may then undertake the work of refining and regulating the spirit. For during prior refinement, blood has already been transformed into *qi*, and this *qi* may now be transmuted into spirit. At this juncture, if one does not temper the temperament and supplement it with external conduct, there is a risk that the spirit may fail to stabilize, leading to the loss of all prior progress. One must adhere strictly to the precepts, observe the methods with discipline, and polish the mind until it becomes like a block of crystal—refined again and again, polished without cease, until inner and outer are immaculate, transparent within and without, the form empty and free of the slightest dust. When this stage is reached, a radiant, numinous, and transformative mechanism will naturally arise, illuminating the cavity within. In deep meditation, one neither eats nor hungers, neither moves nor speaks. At this time, a guardian must be present to prevent startling disturbances, lest the spirit be harmed or demonic influences intrude, which would cause grave harm. Women who have reached this point must remain vigilant, avoiding any misstep. Day and night, someone must keep watch. If her breath ceases entirely and her complexion remains unchanged—whether for a day or two, five or seven days, or even ten—she must not be disturbed. Only when her breath returns faintly and the light of her spirit begins to emerge may one call to her in a low voice. After she emerges from meditation, her food, clothing, and comforts should be provided as she wishes. Companions of the same path must remain constantly attentive, guarding her until the spirit has fully departed the body, at which point the danger will have passed.\n\n**Eighth Rule: Moving the Spirit Beyond the Shell**\nThe female path proceeds from yin to yang, and when yang reaches its apex, the spirit becomes whole. Yet even when the body is as pure as an ice vessel and the spirit as clear as autumn waters, the spirit must not be allowed to linger too long within. Thus, when the melon ripens, it falls of its own accord; when the spirit is perfected, it naturally departs. At this time, one should employ the method of spirit projection, guiding the spirit beyond the body. However, the departure must not be too swift, nor should the initial excursions be overly prolonged, lest the spirit become lost and unable to return. The spirit should be withdrawn back into the body, moving in and out, beginning nearby and gradually extending farther. One must not be reckless; only when the spirit is fully matured may it be allowed free movement. Once mastery is achieved, there will be no fear. Yet the work of spirit projection requires careful consideration. Before the yang spirit emerges, its nature is utterly still, and the practice remains governed by the rules of nurturing the true. Only when the spirit is perfected does this stage conclude. After the yang spirit has emerged, its nature becomes dynamic, no longer resembling the prior phase of cultivation. One must then employ the method of liberating the spirit, allowing it to become luminous, unobstructed, and freely active. Whether wandering mountains and rivers or responding to circumstances with transformative manifestations, one should seize opportunities to perform meritorious deeds. When merit is complete and the work is fulfilled, there will come a day of ascension.\n\n**Ninth Rule: Awaiting Ascension**\nWhen the female elixir is perfected and a body of pure yang is cultivated, one is unbound and moves freely. Yet one must broadly perform virtuous deeds and plant good roots, never allowing the freedom of spirit projection to lead to neglect of the Dao’s fruition. One must not recklessly reveal the marvels of creation, nor deviate from the uprightness of heaven’s principle through perverse conduct. Such transgressions will surely invite retribution. Instead, one should subtly apply one’s powers to protect the nation and save the people. When merit and conduct are complete, high sages and perfected beings will naturally come to deliver one to ascension—ascending to the Golden Gates, receiving imperial decrees, and dwelling eternally in the celestial palace, where boundless joy awaits.\n\nBut why must female immortals await deliverance? Though their weak constitution has been refined through internal practice into a yang body, the residual yin essence has not yet been fully dissolved. They lack the final stage of returning to emptiness and have not fully mastered the wondrous transformations of heaven and earth. Thus, they cannot transcend the world on their own, for their bodily form remains insufficiently firm. This differs from the male body, which, when refined into an indestructible vajra form and the work of returning to emptiness is complete, becomes suffused with the radiance of spirit, filling heaven and earth. Therefore, men need not await deliverance to attain the Dao and achieve perfection, personally attending the Celestial Emperor and roaming the Penglai Isles.\n\n*(Chen Yingning’s note: I cannot endorse this theory. I record it here merely as it stands. If a woman truly possesses great wisdom, great power, and great liberation, then at the pinnacle of her practice, she will advance further—seeing form and emptiness as non-dual, self and other as forgotten, her original nature radiant and transcending all beginnings. Only then will she realize that the mundane world and celestial palace are equal in suffering and joy, that yin and yang, though named differently, emerge from the same source. The ten directions and three realms do not lie beyond the Gate of the Mysterious Female; immortals, buddhas, and sentient beings all seek sustenance from the Mother. At this stage, what need is there to speak of awaiting ascension? \"Emerge from the same source,\" \"the Gate of the Mysterious Female,\" and \"seek sustenance from the Mother\" are phrases from Laozi’s *Dao De Jing*, each containing profound meaning.)*\n\n**Tenth Rule: Attaining the Dao and Achieving Perfection**\n\nThe value of cultivation lies in transforming the mortal frame into a sacred vessel—without this, one remains no more than a frog at the bottom of a well, forever bound to the sea of karmic suffering, unable to escape the cycles of rebirth or transcend the turning of kalpas. If a woman in the world can maintain a heart unstained by even a speck of dust and a qi unbroken by a hundred setbacks, following her teacher’s oral instructions and cultivating in secret day and night, she may attain the fruit of the supreme vehicle in as little as three to five years. Why, then, should anyone shrink from such a path?\n\n*(This passage has been substantially revised, as it consisted of empty rhetoric.)*\n\n**Appendix: The Kun Formula**\n*By Sun Bu’er, the Pure and Primordial Sovereign*\n*Collated by Fu Jinquan, the Unitary Master*\n\nTrue transmission has its secrets—true transmission has its secrets.\nWomen embody the yielding virtue of *kun*, yet within true yin resides true yang, making their cultivation comparatively effortless. The key lies in applying effort within *you* (\"being\"). *You* is the beginning of *wu* (\"non-being\"); from *you* to *wu* is the station of true yang. Though these two lines emphasize the work of *ming* (destiny/life-cultivation), they unite *xing* (nature) and *ming* in one, forming the foremost pivot of the *kun*-Way.\n\nThe first line requires returning to *wu* within *you*; the second, generating *you* within *wu*.\nOne must understand *geng* and *jia*—let the Confucian scholars expound upon this.\n*Geng* and *jia* clarify the entry point for *ming*-work.\n*Geng* is metal, the tiger; *jia* is wood, the dragon. *Geng*-metal is the foundation of refinement, while *jia*-wood constantly fears its restraint—yet within restraint lies the germ of life. Alchemists delight in seeking life within death: when the *geng*-tiger descends, the *jia*-dragon rises; in their descent and ascent, the mechanism of creation and destruction is embedded, and the principle of inversion becomes ever more real. Knowing this moment of creation and destruction, of inversion, one applies the method to sever the dragon’s head and lead the tiger by its tail, ensuring the dragon does not summon clouds nor the tiger stir winds. When wind and clouds subside, the sky clears and the moon shines bright; when dragon and tiger are subdued, nature and emotion harmonize. Returning to the furnace to refine, the millet-pearl is immediately formed—no method of preserving life surpasses this.\n\nThe word \"know\" implies quiet observation and vigilant guarding. When the wind threatens to rise, one must seize the tiger; when rain is about to fall, one may sever the dragon—neither too soon nor too late, striking at the opportune moment to forge and temper. Without understanding this principle, one has no means to learn the Dao. Only by integrating it with the study of the classics can one avoid falling into emptiness.\n\nBeneath the study of the *Doctrine of the Mean*, one attains the turning phrase—this is seeing the Dao. The principles of governance must be investigated, the nature-school thoroughly penetrated; one cultivates both nature and life, joining yin and yang. The elixir path is contained within the *Book of Changes*. The *Tuan* says: \"Supreme is the primal power of Kun! All things rely upon it to come into being.\" Kun belongs to old yin; when yin reaches its extreme, yang is born. Following heaven, it gives life to humans and creatures; following the self, it completes the Dao and realizes the true. Carefully examining where true yang arises within Kun, one knows where the true One is produced within the body. Seeking and securing this One, the treasure of life is made whole.\n\nThe work of nature is the beginning and end of entering the Dao. If one does not thoroughly penetrate nature, this treasure cannot abide constantly. It must be like the autumn moon in serene meditation, unstained by the slightest dust. When the beginning of no-beginning is already clear, and the non-empty emptiness is all-pervading freedom, then nature and life are dually cultivated, yin and yang joined.\n\nOne must teach others to discern keenly between being and non-being, not to squander a heart full of ardor. Yin and yang are precisely being and non-being. One must attend carefully to the treasury of scriptures: in three days, the coming of true yang and the going of true yin will both be orderly. The head of the incoming dragon may be severed, the tail of the departing tiger retained. When the two qi intermingle in harmonious union, the dharma-body is formed. Otherwise, one merely exhausts heart and blood—how can one refine and cultivate?\n\nThe mechanism lies before one’s eyes; qi is drawn forth from here. Above is the heavenly valley, below the spring cave. Fix attention on these two places without the slightest deviation. At the critical moment, it is essential to begin with the eyes and initiate intent, with intent initiate qi, with qi condense spirit, with spirit refine the true. Communing with heaven and earth, there is nowhere it does not work. If the heavenly valley does not grow warm, qi does not ascend; if the bubbling spring does not grow warm, qi does not descend. One must direct the eyes and intent to focus, applying effort above and below to guide it. Fix attention on the two cavities without the slightest error. Practicing at midnight and noon, over time one becomes proficient, then proceeds to refinement. Timely realization and diligent cultivation will naturally yield yellow sprouts and white snow.\n\n*(Yingning’s note: \"Yellow sprouts and white snow\" are originally proper terms in external alchemy. Here, they are used as metaphors for internal alchemy. On this point, I cannot refrain from speaking. Consulting the *Secret Formula of Golden Medicine* by the Ancestor of Fuli in Chapter Seven: \"Purple powder like frost, yellow sprouts filling the room.\" Xu the True Man’s *Stone Casket Record* in the *Purple Mother Treatise* says: \"One crucible of cinnabar can be ingested; long ingestion reverses yang and changes the bones, reversing yang and changing bones to become an immortal. It requires divine talismans and white snow. Great indeed is the divine talisman, true white snow—it revives the dead and brings Xu Jia back to life.\" Also, the *Stone Casket Record* in the *Luminous Roundness of the Divine Chamber Treatise* says: \"Each and every grain, true pearls red; red blossoms and purple veins give birth to the golden lord. When the golden lord, water, and earth combine, refining yields yellow sprouts that become white snow. Purple sand and red powder drift about; drifting about is the green dragon’s cream. When red powder is scarce and the white tiger aged, refining yields dragon’s cream and tiger’s brain. In the Hall of Longevity, it is the wish-fulfilling jewel. To transmute ten thousand taels of gold is nothing—it can transmute the feeble old man to eternal youth.\" Observing the above, red blossoms, purple veins, yellow sprouts, white snow, red powder, and purple sand—these terms all refer to tangible substances produced in the external alchemical furnace. They have these forms, can be seen with the eyes, held in the hands, and swallowed into the belly, hence called the golden elixir. Later cultivators, failing to receive the true transmission—or even if they did, guarding it as a secret and not daring to make it public—transformed it so that the coalescence of essence, qi, and spirit within the human body was called the golden elixir. This already deviates from the ancient immortals’ methods, though there are still traces to seek. In a second transformation, they further appropriated Buddhist terms like true suchness, perfect enlightenment, and the wondrous mind of nirvana, as well as Confucian terms like the Ultimate of Non-being, the Supreme Ultimate, heavenly principle, and innate knowledge, all indiscriminately applied to the golden elixir. Thus, later students of immortality fell into a fog, utterly bewildered, growing ever more confused. The art of transmuting mercury into gold, which the Chinese would not disclose, has been lost and later discovered by foreigners. The medicine of immortality, which the Chinese dare not acknowledge, may yet be seized first by outsiders. For a nation of five thousand years, the most ancient civilization, and a race of four hundred million civilized people, to forget their heritage and seek the Dao in foreign lands—how lamentable!)*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "女丹十则 金华山香逸古母述陈撄宁删订 读者须知 一、此书无着者姓氏，旧题为金华山香逸古母，此种名称，大觉浅陋，作书者虽不欲用自己真姓名，然何必伪造圣号乎？ 故削去不录。 二、此书虽标题十则，然第五则与第六则，内容大致相同，第十则所论，又太觉空泛，无另立一条之必要，故于此三则中，皆大加删节，免得惹起读者之厌烦，其它各则，亦有删节并改之处。 学者若将原本与此本对照，则知有不能不删改之理由，非多事也。 三、除本文而外，凡有余所加之按语，读者切宜注意。 因为那些评论，都是经过数十年的阅历，方能写出，不是像别人做文章，随便乱说，毫无凭据。 四、附录《坤诀》一篇，虽不敢断定确属孙不二之手笔，但文字亦简洁可喜，至于傅金铨的解注，惜其满纸喻言，恐学者难于领会，篇末黄芽、白雪四字之来源，余说得甚详，读者应当研究。 五、女丹经内藏真诀者，自古及今，遍国中只有二十余种，不能觅多，学者必须全读，方能得其门径，然后再寻师访友，实地练习，庶几可望成功。 切勿一知半解，自满自足。 中华民国二十四年七月，黄帝纪元四千六百三十二年。",
      "translated_text": "Here is the translation:\n\n---\n\n*Ten Principles of Female Alchemy*\n*Recorded by the Ancient Mother of Xiangyi of Golden Flower Mountain*\n*Edited and Revised by Chen Yingning*\n\n**Reader’s Notice:**\n\n1. This book bears no author’s name, and the old attribution to the \"Ancient Mother of Xiangyi of Golden Flower Mountain\" is crude and shallow. Though the author may not have wished to use their real name, why fabricate a sacred title? Thus, it has been omitted from this edition.\n\n2. Though the book is titled *Ten Principles*, the fifth and sixth principles are largely identical in content, while the tenth is overly vague, rendering its separate inclusion unnecessary. For these three sections, substantial revisions and abridgments have been made to spare the reader undue tedium. Other sections have also been edited or condensed. Should scholars compare the original with this edition, they will recognize the necessity of these revisions—not as meddlesome interference, but as reasoned improvement.\n\n3. Beyond the main text, all appended annotations are my own. Readers are urged to pay close attention, for these commentaries are the fruit of decades of experience, unlike the careless, baseless assertions one often finds in others’ writings.\n\n4. The appended *Kun Formula* is not definitively attributed to Sun Buer, though its prose is concise and admirable. As for Fu Jinquan’s annotations, they are regrettably cluttered with metaphors, which may hinder comprehension. The origins of the terms \"Yellow Sprout\" and \"White Snow\" at the end of the text are explained in detail in my notes—readers should study them carefully.\n\n5. Since ancient times, fewer than thirty texts on female alchemy containing true methods have been preserved in this land. One cannot expect to find many more. Scholars must read them all to grasp the fundamentals, then seek teachers and fellow practitioners for hands-on cultivation. Only then may success be hoped for. Beware of half-understanding and self-satisfaction.\n\n*July, Year 24 of the Republic of China*\n*Year 4,632 of the Yellow Emperor’s Calendar*\n\n---",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 460,
      "start_sentence": 0,
      "end_sentence": 12,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.539650678634644,
      "metadata": {
        "source_file": "dao\\藏外\\女丹十则.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "皖江陈撄宁作此代序。 第一则　养真化气 （撄宁曰：道家工夫，贵在口诀，至于文章之优劣，殊无足重轻。 故尝有理论不圆者，或字句欠通者，或见解卑陋者，或夹杂迷信者，皆能使人生鄙视之心，遂致其真口诀亦湮没而无闻，甚可惜也。 余今编辑此书，盖欲度中材以上有学识之女子，若慨依原本录之，未免贻讥于大雅，兹特撮拾其精华，削去疵累，虽未尽臻纯粹，然已较原本为可观矣。 ） 女子修行，与男子有别，男子阳从下泄，女子阳从上升。 男子体刚，女子体柔，男子常保守丹田之阳精，不使外泄，积之既久，用身中真火锻炼，使精化为气，气化为神，神化为虚，而证道矣。 女子乃阴体，须用乳房灵脂，变化气质，久久运炼，自然赤反为白，血化为气，血既化气，仍用火符进退，亦能气反纯阳，了道归真。 故女子初工，先炼形质，后炼本元，不似男子之工先炼本元，后炼形质也。 何谓养真？ 凡人之心，最易摇动，若使其常守于内，便生厌烦，故起手先教以养真之法，自然厌烦少释，四体安和，方能再求进步。 平日坐炼之时，必须从丹田血海之中，运动气机，照着心内神室，觉有一缕清气，自血海而出，定久之际，其气必动，随其气机鼓舞，向上飞腾，冲到泥丸，复转下降，斯时微以意引之，随着气机从泥丸降下重楼，此时切不可用意，恐伤形体，即随气机自重楼下至两乳间，内有空穴，凝聚良久，若有动机，照前行持，不过四五十日，其气已透，血化为气，赤反为白，斯时丹元已露，道心已诚。 若能坚持静守，朝夕不懈，时刻用功，何患大丹不结，女仙不成者哉？ 此乃女修第一步工夫，果能行到极玄极妙地位，以后工夫，皆从此前进。 学者勉之。 （撄宁按：当气机从泥丸下降时，既曰：\"微以意引之\"。 又曰：\"不可用意。 \"究竟用意乎？",
      "translated_text": "Chen Yingning of Wanjiang wrote this preface in proxy.\n\n**First Principle: Nurturing the True and Transforming Qi**\n\n*(Yingning notes: In Daoist practice, oral instructions are paramount—whether a text’s prose is refined or crude matters little. Some works may suffer from flawed theories, awkward phrasing, shallow insights, or superstitious admixtures, all of which may invite disdain and cause even their authentic oral instructions to fade into obscurity. This is deeply regrettable. In compiling this book, I aim to guide women of above-average learning. Had I merely transcribed the original texts, I might have drawn ridicule from the cultivated. Thus, I have distilled their essence, excised their flaws, and though the result may not be entirely pure, it is far more presentable than the originals.)*\n\nFemale cultivation differs from that of males. In men, yang descends and dissipates; in women, yang ascends. Men possess a rigid constitution; women, a yielding one. Men preserve the yang essence of the dantian, preventing its external leakage. Over time, they employ the true fire within the body to refine essence into qi, qi into spirit, and spirit into emptiness, thereby attaining the Dao. Women, being of yin constitution, must transform the spiritual marrow of the breasts to alter their qi quality. Through prolonged refinement, the red naturally reverts to white, and blood transforms into qi. Once blood has become qi, they too employ the fire talisman to advance and retreat, enabling qi to revert to pure yang and the Dao to return to its true state.\n\nThus, in their initial work, women first refine their physical form before refining their original essence—a reversal of the male path, which begins with refining original essence before the physical form.\n\nWhat is meant by *nurturing the true*? The human heart is easily swayed; if constrained within, it grows restless. Therefore, the first step teaches the method of nurturing the true, which naturally alleviates restlessness, harmonizes the four limbs, and prepares one for further progress.\n\nDuring daily seated practice, one must mobilize the qi mechanism within the dantian and sea of blood, directing it toward the mind’s inner chamber. There, a wisp of clear qi emerges from the sea of blood. With prolonged focus, this qi stirs and, following its own momentum, soars upward to the niwan. It then descends, and at this moment, one subtly guides it with intention, following its movement from the niwan down the *chonglou*. Here, intention must not be forced, lest the body be harmed. Instead, allow the qi to descend naturally from the *chonglou* to the space between the breasts, where an empty cavity resides. After prolonged concentration, if movement arises, proceed as before. Within forty or fifty days, the qi will penetrate, blood will transform into qi, and the red will revert to white. At this stage, the primordial elixir manifests, and the heart of the Dao becomes sincere.\n\nIf one persists in quiet abiding, unwavering in morning and evening, and diligent at all times, how could the great elixir fail to coalesce, or the female immortal remain unrealized? This is the first step in female cultivation. If one attains its most profound and wondrous state, all subsequent work will advance from this foundation.\n\nStudents, take heed.\n\n*(Yingning notes: When the qi descends from the niwan, the text first says, \"subtly guide it with intention,\" then warns, \"do not use intention.\" So, is intention to be used or not?)*",
      "overlap_context": "ers should study them carefully.\n\n5. Since ancient times, fewer than thirty texts on female alchemy containing true methods have been preserved in this land. One cannot expect to find many more. Scholars must read them all to grasp the fundamentals, then seek teachers and fellow practitioners for hands-on cultivation. Only then may success be hoped for. Beware of half-understanding and self-satisfaction.\n\n*July, Year 24 of the Republic of China*\n*Year 4,632 of the Yellow Emperor’s Calendar*\n\n---",
      "start_char": 460,
      "end_char": 1173,
      "start_sentence": 13,
      "end_sentence": 31,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.186217784881592,
      "metadata": {
        "source_file": "dao\\藏外\\女丹十则.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "不用意乎？ 盖此时动作，是有意与无意之间。 因要顺其自然，故曰：\"不可用意。 \"又不能置之不理。 故曰：\"以意引之。 \"） 第二则　九转炼形 炼形者，是谓调摄之义。 血液【属】阴阳，凝居于下，藏于血海胞里，化于五蕴山头，灌溉一身，荣养百脉，循环不已，游溢诸经，变为渣滓之物，去而不用。 直到二百四十刻漏三十时辰已周，那时镕华复露，先天化形，留为生人之用。 此即所谓气之清者，上升于乳，气之浊者，下流为瘀，生人生仙之机，实分于此。 故女子之修炼，预先认得清浊，方能炼得真形。 夫形何以炼？ 当其坐时，用神机运动，候口中液满，微漱数遍，俟其清澄，然后用鼻引清气，随同玉液，咽下重楼，入于绛宫，下降黄房，至关元血海而止。 略一凝定，从血海运至尾闾，升上夹脊，透顶门径入泥丸，仍从泥丸复行下降，至两乳间而止。 停聚良久，使津化为气，是为一转。 如是者三三转。 既毕，方用两手运两乳，回转三十六。 转毕，以两手捧至中间，轻轻运至血海而止，仍又依前运炼。 一番三转，三番共得九转。 倘女子沉潜庄重，根深器厚者，行之不过百日，而形已炼成，长生有路矣。 从此再求上进，大丹可期。 第三则　运用火符 男子先炼药，后炼形。 女子先炼形，后炼药。 因其体相攸分，故前后工夫差别。 学道女子，照依前段口诀，用心行持，若行到丹田血海之中，气机温暖，自然有清气一缕，上冲心舍，直至两乳，此时切不可动念。 仍旧行工运转，自然复行下降，仍旧归于血海，斯时气机已动，真气已生，赤血之阴，变为白气之阳，若不用火行符，其气仍然化为赤血，白者复变为红，枉费工夫。 到此时当用真火以炼之，又用真符以应之，符到火足，其气必凝。 当此气凝之候，别有景象，倘不分明讲出，恐用火符差失，有坏丹元。 修士至此，切宜细心熟记，毋自忘失。 若此刻工夫一误，不惟前工枉费，后工难修，而且有伤身命，防有血崩之患。 学者要记清楚，当其气归血海时，此气虽从血中化出，并非是血。 如人出外，变相归家，即家人妇子皆不能识认，安能如前日之相投？ 故其下降时，血海之中，必如鱼吸水一般，斯时四肢若醉，其快乐如夫妇交媾，有莫能自禁之势。 （撄宁按：有人说此时身中快乐之感觉，胜过男女之事若干倍。 因为某种女子，生性冷淡，又遇男子身体虚弱者，临时在女子面前，毫无快感。 而修道做工夫的女子则不然，虽独自一身，清心寡欲，在静室中打坐。 果能如法将自己身内之阴阳配合调和，入于至玄至妙之境，即有特别之景象发现。 其快乐不可用言语形容。 至于男子做清静工夫者，虽有时身中亦发现快乐之景象，但比较女子快乐之程度，仅得其十之二三而已。 此则关乎男女生理上之不同，非人力所能强为也。 ）",
      "translated_text": "Should intention be used or not? At this stage of movement, it lies between the intentional and the unintentional. To follow its natural course, one says, \"Do not use intention.\" Yet it cannot be left unattended, hence one says, \"Guide it subtly with intention.\"\n\n**Second Principle: The Nine Cycles of Refining Form**\nRefining form means regulation and nurturance. Blood and fluids, belonging to yin and yang, congeal and reside below, stored in the Sea of Blood and the womb, transformed at the summit of the Five Skandhas Mountain. They irrigate the entire body, nourishing the hundred vessels, circulating without cease, overflowing through the meridians, only to become dregs and be discarded. After two hundred and forty ke and thirty double-hours have passed, the refined essence re-emerges, the primordial transforms form, and it is retained for the sustenance of life. This is what is meant by the pure qi ascending to the breasts, while the turbid qi flows downward as stagnation—the pivot where mortals and immortals diverge. Thus, in female cultivation, one must first discern the pure from the turbid to refine the true form.\n\nHow is form refined? While seated, employ the spirit’s mechanism to move, waiting until the mouth is filled with fluid. Gently rinse several times, allowing it to settle and clarify. Then, draw in pure qi through the nose, swallowing it along with the jade-like fluid, descending past the Tower of Jade into the Crimson Palace, down to the Yellow Chamber, and halting at the Sea of Blood in the Pass of Origin. After a brief pause, circulate it from the Sea of Blood to the Tailbone, ascending along the Spine’s Ridge to penetrate the Crown Gate and enter the Mud Pill Palace. From there, descend again to the space between the breasts and rest. After a long pause, let the fluid transform into qi—this is one cycle. Repeat this three times for a total of three cycles. Once complete, use both hands to rotate the breasts thirty-six times. Then, cup them and gently guide them to the center, moving downward to the Sea of Blood, and repeat the process as before. One session consists of three cycles, and three sessions yield nine cycles in total.\n\nIf a woman is serene, dignified, deeply rooted, and of profound capacity, practicing this for no more than a hundred days will refine her form, and the path to longevity will open. From here, further progress may be sought, and the great elixir will be within reach.\n\n**Third Principle: Applying the Fire and Talisman**\nMen refine the medicine first, then the form. Women refine the form first, then the medicine. Their physical constitutions differ, so the order of practice varies. Female cultivators should follow the previous instructions diligently. When, in the Sea of Blood within the Elixir Field, the qi mechanism warms, a wisp of pure qi will naturally surge upward to the Heart Chamber and reach the breasts. At this moment, one must not stir a single thought. Continue the practice as before, and the qi will naturally descend again, returning to the Sea of Blood. By this time, the qi mechanism has stirred, true qi has arisen, and the yin of red blood has transformed into the yang of white qi. If the fire and talisman are not applied, the qi will revert to red blood, the white will turn back to red, and all effort will have been in vain.\n\nAt this stage, one must use true fire to refine it and true talisman to respond to it. When the talisman arrives and the fire is sufficient, the qi will congeal. At this moment of congealment, a distinct phenomenon arises. If not clearly explained, the application of fire and talisman may err, risking harm to the primordial elixir. Practitioners must memorize this carefully and not forget.\n\nIf this step is misapplied, not only will prior efforts be wasted, but future practice will be difficult, and there may even be harm to body and life, with the risk of blood collapse. Take heed: when the qi returns to the Sea of Blood, though it emerges from the blood, it is not blood itself. Like a traveler returning home in disguise, even family and wife may not recognize them—how could they be as before? Thus, as it descends, the Sea of Blood must feel like a fish drawing in water. At this time, the four limbs grow languid as if drunk, and the bliss is akin to the union of husband and wife, an ecstasy beyond restraint.\n\n*(Yingning notes: Some say the bliss felt in the body at this moment surpasses that of the union of man and woman manyfold. For certain women, naturally cold in temperament, who encounter weak men, there may be no pleasure at all in such encounters. But in the practice of Daoist cultivation, a woman—though alone, with a pure heart and few desires, seated in quiet meditation—if she harmonizes the yin and yang within her body according to the method and enters the most profound and wondrous state, will encounter extraordinary phenomena. The bliss is beyond words. While men practicing quiet cultivation may sometimes experience blissful phenomena, compared to the degree of bliss in women, it is but two or three parts out of ten. This pertains to the physiological differences between men and women, not something that can be forced by human effort.)*",
      "overlap_context": "g in morning and evening, and diligent at all times, how could the great elixir fail to coalesce, or the female immortal remain unrealized? This is the first step in female cultivation. If one attains its most profound and wondrous state, all subsequent work will advance from this foundation.\n\nStudents, take heed.\n\n*(Yingning notes: When the qi descends from the niwan, the text first says, \"subtly guide it with intention,\" then warns, \"do not use intention.\" So, is intention to be used or not?)*",
      "start_char": 1173,
      "end_char": 2253,
      "start_sentence": 32,
      "end_sentence": 74,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.57246446609497,
      "metadata": {
        "source_file": "dao\\藏外\\女丹十则.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "到此地位，必须拿定主宰，切不可放纵。 一念凝守中宫，停聚良久，他自然向上冲关，升入泥丸，化为玉液。 以意引下重楼，还至两乳间而止。 用凝气法以混合之，使其聚而不散，久久行之，自能达本还原，以通胎息。 若胎息既通，则仙道可计日而至。 女真修士，当共勉之。 第四则　默运胎息 女真修炼者，果能照前口诀，尽心行持，自然真气日生，血化为液，自两乳中间，流通百脉，润泽周身。 此液是血化成，必须常用内运元和之气，以温养之，方能镇静中田，以为超升之本。 何谓内运元和之气？ 盖呼吸由中而生，亦由中而定也。 女真修炼，既得玉液，须运用此气以凝之，其液方无走失，并可倚此而结成还丹。 当其内运之时，其势不着于口鼻，而又不离于口鼻，虽有呼吸之名，实无呼吸之相。 何也？ 借呼吸以为呼吸之义也。 盖口鼻之呼吸，乃后天呼吸，内运之呼吸，是先天呼吸。 此时注重先天，不注重后天，先天呼吸，有名无形，随后天口鼻之呼吸，一出一入，自然升降。 久久行之，则息息归根，呼吸之气，不由于口鼻。 而胎息已成，仙道不远矣。 （陈撄宁按：此段工夫，原文就未成说得明白，余恐后学不易了解，遂力求浅显。 将原文删改大半，比较容易明了。",
      "translated_text": "Upon reaching this stage, one must firmly maintain control and under no circumstances indulge in laxity. With a single thought, concentrate and guard the Central Palace, allowing it to gather for a long while—naturally, it will surge upward to breach the passes, ascending into the Mud Pill Palace and transforming into Jade Nectar. Then, with intention, guide it downward past the Tower of Multi-Storied Chambers, halting between the two breasts. Employ the method of congealing qi to blend it, ensuring it gathers without dispersing. With prolonged practice, one will naturally return to the root and restore the original state, thereby connecting with fetal breathing. Once fetal breathing is established, the Dao of immortality may be attained in a matter of days. Women cultivators should mutually encourage one another in this pursuit.\n\n**Fourth Principle: Silent Circulation of Fetal Breathing**\nFor women cultivators who diligently follow the preceding oral instructions with wholehearted devotion, true qi will naturally grow day by day, and blood will transform into fluid, flowing from between the breasts to circulate through the hundred vessels, nourishing the entire body. This fluid, born of blood’s transformation, must be constantly warmed and nurtured by internally circulating the primordial harmonizing qi, so that it may stabilize the Central Field and serve as the foundation for transcendence.\n\nWhat is meant by \"internally circulating the primordial harmonizing qi\"? It refers to breath that arises from and is stabilized within the center. In women’s cultivation, having obtained Jade Nectar, one must employ this qi to congeal it, ensuring the fluid does not dissipate and may instead coalesce into the Reverted Elixir. During this internal circulation, the movement neither adheres to nor departs from the mouth and nose—though it bears the name of breathing, it possesses no form of breathing. Why is this? It borrows the function of breathing to fulfill the meaning of breathing.\n\nFor the breathing of the mouth and nose belongs to the postnatal realm, while internal circulation pertains to the prenatal. At this stage, emphasis is placed on the prenatal, not the postnatal. Prenatal breathing has a name but no form, and as the postnatal breath of the mouth and nose naturally rises and falls, so too does it. With prolonged practice, each breath returns to the root, and the qi of respiration no longer depends on the mouth and nose. Thus, fetal breathing is achieved, and the Dao of immortality is not far off.\n\n*(Chen Yingning’s note: The original text did not clearly explain this stage of practice. Fearing that later learners might struggle to comprehend it, I have endeavored to simplify it. I have revised and abridged much of the original text to make it more accessible.)*",
      "overlap_context": " in quiet meditation—if she harmonizes the yin and yang within her body according to the method and enters the most profound and wondrous state, will encounter extraordinary phenomena. The bliss is beyond words. While men practicing quiet cultivation may sometimes experience blissful phenomena, compared to the degree of bliss in women, it is but two or three parts out of ten. This pertains to the physiological differences between men and women, not something that can be forced by human effort.)*",
      "start_char": 2254,
      "end_char": 2743,
      "start_sentence": 75,
      "end_sentence": 95,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.39902114868164,
      "metadata": {
        "source_file": "dao\\藏外\\女丹十则.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "至其细微曲折，要在为师者口传面授。 并要学人心领神悟，在自己身中实地证验。 功深日久，水到渠成。 果能一旦豁然贯通，自然暗合道妙，固不必拘拘于文字之间矣。 ） 第五则　广立功行 女子果能潜修至道，已经炼得玉液还丹，认得先天面目，又兼保得住胎息工夫，至此必须借外行以培植道本，方才外无所亏，而内有所助，所以事奉翁姑，宜尽孝思，与人应接，当存忠厚。 矜孤恤寡，救苦济贫，尊敬师长，和睦乡邻。 举动勿轻浮，言语勿傲慢，一切行为，皆归理法之中，自然气质冲和，不求功行，而功行自立。 （撄宁按：此篇删去大半，仅此已足。 ）",
      "translated_text": "At its subtler turns and finer points, the transmission must come through a master’s oral instruction and direct guidance. The disciple must also inwardly grasp and spiritually comprehend it, personally verifying it within their own body. With deep and prolonged practice, the moment will come when all falls naturally into place. Should one suddenly achieve thorough penetration, they will spontaneously align with the marvels of the Dao, and need no longer be rigidly bound by written words.\n\n**Fifth Principle: Broadening Meritorious Conduct**\n\nIf a woman can quietly cultivate the supreme Dao, having refined the jade-fluid returning elixir, recognized her prenatal visage, and stabilized her fetal breathing practice, she must then rely on external conduct to nurture the root of the Dao. Only thus can she avoid external deficiencies while internally receiving support. She should serve her parents-in-law with utmost filial devotion, interact with others with sincerity and kindness, show compassion to orphans and widows, relieve suffering and aid the poor, respect her teachers and elders, and live in harmony with her neighbors. Her movements should not be frivolous, her speech not arrogant. All her actions should conform to principle and propriety, so that her qi and disposition become naturally harmonious. Without seeking meritorious conduct, it will establish itself.\n\n*(Chen Yingning’s note: This section has been greatly abridged; what remains is sufficient.)*",
      "overlap_context": " and falls, so too does it. With prolonged practice, each breath returns to the root, and the qi of respiration no longer depends on the mouth and nose. Thus, fetal breathing is achieved, and the Dao of immortality is not far off.\n\n*(Chen Yingning’s note: The original text did not clearly explain this stage of practice. Fearing that later learners might struggle to comprehend it, I have endeavored to simplify it. I have revised and abridged much of the original text to make it more accessible.)*",
      "start_char": 2743,
      "end_char": 2998,
      "start_sentence": 96,
      "end_sentence": 106,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.365935325622559,
      "metadata": {
        "source_file": "dao\\藏外\\女丹十则.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "第六则　志坚行持 女真修士，若能得明师，知口诀，敦品行，矢志用功，恒久不怠，则神仙指日可成。 然女子之性情，易漓易变，遇有不如意事，难保不顿改初心。 或为歧途所引，妄起偏僻之见，致令前功尽弃，孽海沉沦，嗟何及矣！ 世间传道者虽多，而得其真传者盖鲜，往往自误误人。 今于女丹口诀，显明指示，以度有缘。 所望跳出迷津，得登彼岸，使黄泉无碎玉之魂，红粉得驻颜之术，长守不失，享乐无穷，岂不快哉？ 戒规列后： 第一戒：孝养翁姑。 第二戒：端方正直。 第三戒：谨慎言语。 第四戒：小心行持。 第五戒：尊师重道。 第六戒：立志不变。 （撄宁按：原文删除五分之四，因其无关重要。 至于诫规六条，虽每条皆附有解释，亦未录。 因其大意已明。 ）",
      "translated_text": "**Sixth Principle: Resolute Commitment and Steadfast Practice**\n\nIf a female cultivator of the Dao can find an enlightened teacher, grasp the oral instructions, refine her character, and vow to devote herself to practice with unwavering perseverance, then the attainment of immortality may be realized in due time. Yet the nature of women is often fickle and mutable; when faced with adversity, it is difficult to ensure that her original resolve will not falter. She may be led astray by misleading paths, adopting perverse or biased views, thereby squandering all prior efforts and sinking into the sea of karmic suffering—alas, how lamentable!\n\nThough many in the world transmit the Dao, those who receive its true transmission are rare, and many err, misleading both themselves and others. Here, the oral instructions of *Nüdan* are clearly expounded to guide those of karmic affinity. May they leap free from the sea of delusion, reach the other shore, and ensure that no jade-like soul is shattered in the Yellow Springs, while the rosy-cheeked gain the art of preserving their youth. If this is maintained without loss, boundless joy shall be theirs—how could this not be a cause for celebration?\n\nThe precepts are as follows:\n1. **First Precept:** Honor and serve one’s parents-in-law.\n2. **Second Precept:** Uphold integrity and uprightness.\n3. **Third Precept:** Be cautious in speech.\n4. **Fourth Precept:** Exercise care in conduct.\n5. **Fifth Precept:** Revere the teacher and honor the Dao.\n6. **Sixth Precept:** Maintain an unchanging resolve.\n\n*(Chen Yingning’s note: Four-fifths of the original text has been omitted as it is of no great importance. As for the six precepts, though each was originally accompanied by explanations, these have not been included, for their general meaning is already clear.)*",
      "overlap_context": "d kindness, show compassion to orphans and widows, relieve suffering and aid the poor, respect her teachers and elders, and live in harmony with her neighbors. Her movements should not be frivolous, her speech not arrogant. All her actions should conform to principle and propriety, so that her qi and disposition become naturally harmonious. Without seeking meritorious conduct, it will establish itself.\n\n*(Chen Yingning’s note: This section has been greatly abridged; what remains is sufficient.)*",
      "start_char": 2999,
      "end_char": 3310,
      "start_sentence": 107,
      "end_sentence": 124,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.578890562057495,
      "metadata": {
        "source_file": "dao\\藏外\\女丹十则.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "第七则　调养元神 女子之功，比男子便捷。 女丹从养真至胎息，其工夫已做完大半，不若男工有许多作用，方能得到调神地步。 所以女丹法从养真至胎息工毕，便接录外行工修，俟其外行有余，即可炼调神一段工夫。 盖因其前日运炼之时，已将血化为气，此气便可化神。 到此时候，若不陶冶性情，辅助以外行，恐将来凝之不住，反致前功尽弃。 必须照依戒规，，严遵法度，将心地磨炼成一块水晶相似。 炼而复炼，磨而复磨，直至内外洁白，表里玲珑，体相皆空，纤尘不染，行到此地，自有一片清灵善化之机，照映在腔子里，入定之际，不食不饥，不动不言，此时必须用人保护，不可受惊骇。 恐伤神着魔，为害不浅。 女修至此，当留心注意，毋致差失，日夜要人看守，若见他气息俱无，颜色不改，或一二日，或五七日，或十余日，皆不可惊动。 待他鼻息微微，神光半露，方可低声呼之，倘彼出定之后，饮食衣服，随意所适，同志伴侣，必须刻刻堤防，直养到出神以后，方免危险。 第八则　移神出壳 女子之道，从阴返阳，阳极而神全。 直炼至身若冰壶，神如秋水，但亦不可使之久留身中。 故瓜熟自落，神圆则迁。 此时宜用出神之法，将神移出身外。 然不可出之太速，且初出时间亦不宜过久，恐神迷而无所归。 宜将所出之神回转于内体之内，一出一入，由近及远，切记不可放纵，必俟调养老成，方可任其去来，纯熟之后，自无畏避。 然出神之工，又当详论，夫阳神未出之前，其性至静，其工仍同养真规矩，直待神圆方止。 若阳神既出而后，其性属动，便不似前段功修，当用逸神之法，使其神灵通活泼，而无障碍。 或游山而玩水，或随缘显化，遇有机会，便立功行，苟能行满功圆，自有飞升之一日。 第九则　待度飞升 女丹修成，养就纯阳之体，摆脱拘束，出没自由。 务宜广行功德，多种善根，切不可因其神出逍遥，便将道果置之度外，多言泄造物之奇，邪僻失天理之正，种种妄为，定遭遣责。 只宜暗施法力，护国救民，待到功行圆满，自有上圣高真前来度脱飞升。 上朝金阙，膺受敕封，永住天宫，无边快乐。 但女真何故必须待度？ 盖因其本为弱质，幸得内功修炼，以成阳体。 而阴凝之质尚未消尽，缺少还虚一段运用，未能尽天地之妙化，所以不得超升世外者。 悉由体相之不坚也。 不若男子之体，炼成金刚不坏之身，还虚功成，神光充满天地，故不必待度，而可以了道成真，亲朝上帝，游晏蓬莱也。 （撄宁按：此条理论，余不敢赞同。 姑存其说而已。 女子果能有大智慧，具大力量，得大解脱者，则于百尺竿头，更进一步，色空不二，人我两忘，本性光明，直超无始，方知尘世天宫，苦乐平等，男女阴阳，异名同出。 十方三界，不离玄牝之门，仙佛众生，皆贵求食于母，到此尚有何待飞升之可言耶？ 异名同出。 玄牝之门，求食于母，这三句见于老子《道德经》。 其中含有深义。 第十则　了道成真",
      "translated_text": "**Seventh Rule: Cultivating the Original Spirit**\nThe practice of women is swifter than that of men. In the female elixir method, from nurturing the true to embryonic breathing, the greater part of the work is already accomplished—unlike the male practice, which requires many additional steps to reach the stage of spirit regulation. Thus, once the work of nurturing the true and embryonic breathing is complete, the female method proceeds directly to external cultivation. When external conduct is sufficiently refined, one may then undertake the work of refining and regulating the spirit. For during prior refinement, blood has already been transformed into *qi*, and this *qi* may now be transmuted into spirit. At this juncture, if one does not temper the temperament and supplement it with external conduct, there is a risk that the spirit may fail to stabilize, leading to the loss of all prior progress. One must adhere strictly to the precepts, observe the methods with discipline, and polish the mind until it becomes like a block of crystal—refined again and again, polished without cease, until inner and outer are immaculate, transparent within and without, the form empty and free of the slightest dust. When this stage is reached, a radiant, numinous, and transformative mechanism will naturally arise, illuminating the cavity within. In deep meditation, one neither eats nor hungers, neither moves nor speaks. At this time, a guardian must be present to prevent startling disturbances, lest the spirit be harmed or demonic influences intrude, which would cause grave harm. Women who have reached this point must remain vigilant, avoiding any misstep. Day and night, someone must keep watch. If her breath ceases entirely and her complexion remains unchanged—whether for a day or two, five or seven days, or even ten—she must not be disturbed. Only when her breath returns faintly and the light of her spirit begins to emerge may one call to her in a low voice. After she emerges from meditation, her food, clothing, and comforts should be provided as she wishes. Companions of the same path must remain constantly attentive, guarding her until the spirit has fully departed the body, at which point the danger will have passed.\n\n**Eighth Rule: Moving the Spirit Beyond the Shell**\nThe female path proceeds from yin to yang, and when yang reaches its apex, the spirit becomes whole. Yet even when the body is as pure as an ice vessel and the spirit as clear as autumn waters, the spirit must not be allowed to linger too long within. Thus, when the melon ripens, it falls of its own accord; when the spirit is perfected, it naturally departs. At this time, one should employ the method of spirit projection, guiding the spirit beyond the body. However, the departure must not be too swift, nor should the initial excursions be overly prolonged, lest the spirit become lost and unable to return. The spirit should be withdrawn back into the body, moving in and out, beginning nearby and gradually extending farther. One must not be reckless; only when the spirit is fully matured may it be allowed free movement. Once mastery is achieved, there will be no fear. Yet the work of spirit projection requires careful consideration. Before the yang spirit emerges, its nature is utterly still, and the practice remains governed by the rules of nurturing the true. Only when the spirit is perfected does this stage conclude. After the yang spirit has emerged, its nature becomes dynamic, no longer resembling the prior phase of cultivation. One must then employ the method of liberating the spirit, allowing it to become luminous, unobstructed, and freely active. Whether wandering mountains and rivers or responding to circumstances with transformative manifestations, one should seize opportunities to perform meritorious deeds. When merit is complete and the work is fulfilled, there will come a day of ascension.\n\n**Ninth Rule: Awaiting Ascension**\nWhen the female elixir is perfected and a body of pure yang is cultivated, one is unbound and moves freely. Yet one must broadly perform virtuous deeds and plant good roots, never allowing the freedom of spirit projection to lead to neglect of the Dao’s fruition. One must not recklessly reveal the marvels of creation, nor deviate from the uprightness of heaven’s principle through perverse conduct. Such transgressions will surely invite retribution. Instead, one should subtly apply one’s powers to protect the nation and save the people. When merit and conduct are complete, high sages and perfected beings will naturally come to deliver one to ascension—ascending to the Golden Gates, receiving imperial decrees, and dwelling eternally in the celestial palace, where boundless joy awaits.\n\nBut why must female immortals await deliverance? Though their weak constitution has been refined through internal practice into a yang body, the residual yin essence has not yet been fully dissolved. They lack the final stage of returning to emptiness and have not fully mastered the wondrous transformations of heaven and earth. Thus, they cannot transcend the world on their own, for their bodily form remains insufficiently firm. This differs from the male body, which, when refined into an indestructible vajra form and the work of returning to emptiness is complete, becomes suffused with the radiance of spirit, filling heaven and earth. Therefore, men need not await deliverance to attain the Dao and achieve perfection, personally attending the Celestial Emperor and roaming the Penglai Isles.\n\n*(Chen Yingning’s note: I cannot endorse this theory. I record it here merely as it stands. If a woman truly possesses great wisdom, great power, and great liberation, then at the pinnacle of her practice, she will advance further—seeing form and emptiness as non-dual, self and other as forgotten, her original nature radiant and transcending all beginnings. Only then will she realize that the mundane world and celestial palace are equal in suffering and joy, that yin and yang, though named differently, emerge from the same source. The ten directions and three realms do not lie beyond the Gate of the Mysterious Female; immortals, buddhas, and sentient beings all seek sustenance from the Mother. At this stage, what need is there to speak of awaiting ascension? \"Emerge from the same source,\" \"the Gate of the Mysterious Female,\" and \"seek sustenance from the Mother\" are phrases from Laozi’s *Dao De Jing*, each containing profound meaning.)*\n\n**Tenth Rule: Attaining the Dao and Achieving Perfection**",
      "overlap_context": " integrity and uprightness.\n3. **Third Precept:** Be cautious in speech.\n4. **Fourth Precept:** Exercise care in conduct.\n5. **Fifth Precept:** Revere the teacher and honor the Dao.\n6. **Sixth Precept:** Maintain an unchanging resolve.\n\n*(Chen Yingning’s note: Four-fifths of the original text has been omitted as it is of no great importance. As for the six precepts, though each was originally accompanied by explanations, these have not been included, for their general meaning is already clear.)*",
      "start_char": 3311,
      "end_char": 4453,
      "start_sentence": 125,
      "end_sentence": 163,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.975783824920654,
      "metadata": {
        "source_file": "dao\\藏外\\女丹十则.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "夫修行所贵者，在于转凡躯而成圣体，不然者犹如井底之蛙耳。 终是孽海中物，焉能脱轮回而超劫运乎？ 世间女子，果能有一尘不染之心，百折不回之气，依师口诀，日夜潜修，亦不过三五载功程，便证上乘果位，人又何惮而不为哉。 （此条删改大半，因其纯是空言。 ） 附录坤诀 清净元君孙不二着　济一子傅金铨校订 真传有诀，真传有诀。 夫女子秉坤柔之德，而真阴之中具有真阳，修炼较易。 其诀俱在有【中】着力，有者无之始，从有至无，即是真阳之位。 此二句虽重在命功，却合性命而言，乃坤道第一大关键。 上句要于有中还无，下句要于无中生有。 庚甲须知，学儒详说。 庚甲申明，命功入手处。 庚者，金也、虎也。 甲者，木也、龙也。 庚金为修炼之本，甲木常畏其克，而克中反有生机。 炼丹家最喜死中求活，故庚虎既降，甲龙即兴，一降一兴，生杀之机已伏，颠倒之理弥真。 知此生杀颠倒之时，用法斩龙之头，牵虎之尾，使龙不兴云，虎不招风，风云息而天清月皎，龙虎降而性合情投，归炉起炼，立结黍珠，保命之法，莫妙于此。 \"知\"字，有潜心守视之意。 风欲来即须擒虎，雨将降乃可斩龙，不先不后，及时斩取，方可锻炼。 不明理，又无以学道也。 从经学参入，方不落空。",
      "translated_text": "The value of cultivation lies in transforming the mortal frame into a sacred vessel—without this, one remains no more than a frog at the bottom of a well, forever bound to the sea of karmic suffering, unable to escape the cycles of rebirth or transcend the turning of kalpas. If a woman in the world can maintain a heart unstained by even a speck of dust and a qi unbroken by a hundred setbacks, following her teacher’s oral instructions and cultivating in secret day and night, she may attain the fruit of the supreme vehicle in as little as three to five years. Why, then, should anyone shrink from such a path?\n\n*(This passage has been substantially revised, as it consisted of empty rhetoric.)*\n\n**Appendix: The Kun Formula**\n*By Sun Bu’er, the Pure and Primordial Sovereign*\n*Collated by Fu Jinquan, the Unitary Master*\n\nTrue transmission has its secrets—true transmission has its secrets.\nWomen embody the yielding virtue of *kun*, yet within true yin resides true yang, making their cultivation comparatively effortless. The key lies in applying effort within *you* (\"being\"). *You* is the beginning of *wu* (\"non-being\"); from *you* to *wu* is the station of true yang. Though these two lines emphasize the work of *ming* (destiny/life-cultivation), they unite *xing* (nature) and *ming* in one, forming the foremost pivot of the *kun*-Way.\n\nThe first line requires returning to *wu* within *you*; the second, generating *you* within *wu*.\nOne must understand *geng* and *jia*—let the Confucian scholars expound upon this.\n*Geng* and *jia* clarify the entry point for *ming*-work.\n*Geng* is metal, the tiger; *jia* is wood, the dragon. *Geng*-metal is the foundation of refinement, while *jia*-wood constantly fears its restraint—yet within restraint lies the germ of life. Alchemists delight in seeking life within death: when the *geng*-tiger descends, the *jia*-dragon rises; in their descent and ascent, the mechanism of creation and destruction is embedded, and the principle of inversion becomes ever more real. Knowing this moment of creation and destruction, of inversion, one applies the method to sever the dragon’s head and lead the tiger by its tail, ensuring the dragon does not summon clouds nor the tiger stir winds. When wind and clouds subside, the sky clears and the moon shines bright; when dragon and tiger are subdued, nature and emotion harmonize. Returning to the furnace to refine, the millet-pearl is immediately formed—no method of preserving life surpasses this.\n\nThe word \"know\" implies quiet observation and vigilant guarding. When the wind threatens to rise, one must seize the tiger; when rain is about to fall, one may sever the dragon—neither too soon nor too late, striking at the opportune moment to forge and temper. Without understanding this principle, one has no means to learn the Dao. Only by integrating it with the study of the classics can one avoid falling into emptiness.",
      "overlap_context": "erge from the same source. The ten directions and three realms do not lie beyond the Gate of the Mysterious Female; immortals, buddhas, and sentient beings all seek sustenance from the Mother. At this stage, what need is there to speak of awaiting ascension? \"Emerge from the same source,\" \"the Gate of the Mysterious Female,\" and \"seek sustenance from the Mother\" are phrases from Laozi’s *Dao De Jing*, each containing profound meaning.)*\n\n**Tenth Rule: Attaining the Dao and Achieving Perfection**",
      "start_char": 4454,
      "end_char": 4958,
      "start_sentence": 164,
      "end_sentence": 186,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.434249877929688,
      "metadata": {
        "source_file": "dao\\藏外\\女丹十则.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "于学庸下得转语，斯为见道。 为理宜参，性宗须彻，性命双修，阴阳相接。 丹道统于《易》中，《彖》曰：\"至哉坤元，万物资生。 \"坤属老阴，阴极阳生，顺承乎天，则生人生物； 顺承乎己，则成道成真。 细究坤之真阳发于何处，即知吾身真一产于何方。 求得此一，固得此一，命宝乃全。 性功为入道之始终，于性不彻，此宝未能常住，必如秋月澄禅，纤尘不染，无始之始，既已了然，不空之空，咸归自在，斯性命双修，阴阳相接矣。 教人熟辩有无，莫负一腔热血。 阴阳即有无，要于藏经中留心，三日则真阳之来，真阴之往，俱已井然。 来龙之头可断，去虎之尾能留，二气相交，絪缊和洽，方成法体。 不然徒费心血，又何能修炼耶？ 机在目前，气由此拔，上有天谷，下有泉穴，认定二处，不宜差别。 临机切要，惟是以目始意，以意始气，以气凝神，以神炼真，通天达地，无往不灵。 苟或天谷不热，气不上升； 涌泉不热，气不下行。 必须意目注视，上下其力以引之，认定二穴，不可少有差错，子午行功，久久纯熟，再行烹炼。 应时须悟参修，自有黄芽白雪。 （撄宁按：黄芽白雪，本是外丹之专名。 今用作内丹之比喻，于此吾有不能己于言者。 考浮黎鼻祖《金药秘诀》第七章云：紫粉如霜，黄芽满室，许真人《石函记》紫母论云：\"一鼎丹砂可服食，久服回阳能换骨，回阳换骨作神仙，须是神符并白雪。 大哉神符真白雪，返魂再活生徐甲。 \"又《石函记》神室圆明论云：\"颗颗粒粒真珠红，红英紫脉生金公，金公水土相并合，练就黄芽成白雪，紫砂红粉乱飘飘，乱飘飘兮青龙膏，红粉少，白虎老，练就龙膏并虎脑，长生殿上如意宝。 点金万两何足道，能点衰翁永不老。 \"试观以上所言，红英，紫脉，黄芽，白雪，红粉，紫砂，这些名词，都是外丹炉火中所炼出来的实质实物。 实有这些形状，可以看在眼里，可以拿在手内； 可以吞入腹内，故叫作金丹。 后世修炼家不得其真传，或者虽得其真传，又守秘密，不敢公开，遂一变相将吾人肉体上之精气神团结不散者，名为金丹。 已是不合古神仙之法度，然而尚有迹象可求，再后第二变又将佛教所用的名词如真如，圆觉，涅盘妙心，儒教所用的名词，如无极，太极，天理良知等类，一概附会上去。 都名为金丹，于是后世学仙者，遂堕入五里雾中，弄得莫明其妙，可谓愈趋越下矣。 点汞成金之术，中国人不肯公开，遂致失传，反而被国外人发明出来，长生不老之药，中国人不敢自己承认，将来又要被外国人捷足先登。 以五千年开化最古之国家，四百兆文明之种族，竟至数典忘祖，道失而求诸异邦，可胜慨哉！",
      "translated_text": "Beneath the study of the *Doctrine of the Mean*, one attains the turning phrase—this is seeing the Dao. The principles of governance must be investigated, the nature-school thoroughly penetrated; one cultivates both nature and life, joining yin and yang. The elixir path is contained within the *Book of Changes*. The *Tuan* says: \"Supreme is the primal power of Kun! All things rely upon it to come into being.\" Kun belongs to old yin; when yin reaches its extreme, yang is born. Following heaven, it gives life to humans and creatures; following the self, it completes the Dao and realizes the true. Carefully examining where true yang arises within Kun, one knows where the true One is produced within the body. Seeking and securing this One, the treasure of life is made whole.\n\nThe work of nature is the beginning and end of entering the Dao. If one does not thoroughly penetrate nature, this treasure cannot abide constantly. It must be like the autumn moon in serene meditation, unstained by the slightest dust. When the beginning of no-beginning is already clear, and the non-empty emptiness is all-pervading freedom, then nature and life are dually cultivated, yin and yang joined.\n\nOne must teach others to discern keenly between being and non-being, not to squander a heart full of ardor. Yin and yang are precisely being and non-being. One must attend carefully to the treasury of scriptures: in three days, the coming of true yang and the going of true yin will both be orderly. The head of the incoming dragon may be severed, the tail of the departing tiger retained. When the two qi intermingle in harmonious union, the dharma-body is formed. Otherwise, one merely exhausts heart and blood—how can one refine and cultivate?\n\nThe mechanism lies before one’s eyes; qi is drawn forth from here. Above is the heavenly valley, below the spring cave. Fix attention on these two places without the slightest deviation. At the critical moment, it is essential to begin with the eyes and initiate intent, with intent initiate qi, with qi condense spirit, with spirit refine the true. Communing with heaven and earth, there is nowhere it does not work. If the heavenly valley does not grow warm, qi does not ascend; if the bubbling spring does not grow warm, qi does not descend. One must direct the eyes and intent to focus, applying effort above and below to guide it. Fix attention on the two cavities without the slightest error. Practicing at midnight and noon, over time one becomes proficient, then proceeds to refinement. Timely realization and diligent cultivation will naturally yield yellow sprouts and white snow.\n\n*(Yingning’s note: \"Yellow sprouts and white snow\" are originally proper terms in external alchemy. Here, they are used as metaphors for internal alchemy. On this point, I cannot refrain from speaking. Consulting the *Secret Formula of Golden Medicine* by the Ancestor of Fuli in Chapter Seven: \"Purple powder like frost, yellow sprouts filling the room.\" Xu the True Man’s *Stone Casket Record* in the *Purple Mother Treatise* says: \"One crucible of cinnabar can be ingested; long ingestion reverses yang and changes the bones, reversing yang and changing bones to become an immortal. It requires divine talismans and white snow. Great indeed is the divine talisman, true white snow—it revives the dead and brings Xu Jia back to life.\" Also, the *Stone Casket Record* in the *Luminous Roundness of the Divine Chamber Treatise* says: \"Each and every grain, true pearls red; red blossoms and purple veins give birth to the golden lord. When the golden lord, water, and earth combine, refining yields yellow sprouts that become white snow. Purple sand and red powder drift about; drifting about is the green dragon’s cream. When red powder is scarce and the white tiger aged, refining yields dragon’s cream and tiger’s brain. In the Hall of Longevity, it is the wish-fulfilling jewel. To transmute ten thousand taels of gold is nothing—it can transmute the feeble old man to eternal youth.\" Observing the above, red blossoms, purple veins, yellow sprouts, white snow, red powder, and purple sand—these terms all refer to tangible substances produced in the external alchemical furnace. They have these forms, can be seen with the eyes, held in the hands, and swallowed into the belly, hence called the golden elixir. Later cultivators, failing to receive the true transmission—or even if they did, guarding it as a secret and not daring to make it public—transformed it so that the coalescence of essence, qi, and spirit within the human body was called the golden elixir. This already deviates from the ancient immortals’ methods, though there are still traces to seek. In a second transformation, they further appropriated Buddhist terms like true suchness, perfect enlightenment, and the wondrous mind of nirvana, as well as Confucian terms like the Ultimate of Non-being, the Supreme Ultimate, heavenly principle, and innate knowledge, all indiscriminately applied to the golden elixir. Thus, later students of immortality fell into a fog, utterly bewildered, growing ever more confused. The art of transmuting mercury into gold, which the Chinese would not disclose, has been lost and later discovered by foreigners. The medicine of immortality, which the Chinese dare not acknowledge, may yet be seized first by outsiders. For a nation of five thousand years, the most ancient civilization, and a race of four hundred million civilized people, to forget their heritage and seek the Dao in foreign lands—how lamentable!)*",
      "overlap_context": "pearl is immediately formed—no method of preserving life surpasses this.\n\nThe word \"know\" implies quiet observation and vigilant guarding. When the wind threatens to rise, one must seize the tiger; when rain is about to fall, one may sever the dragon—neither too soon nor too late, striking at the opportune moment to forge and temper. Without understanding this principle, one has no means to learn the Dao. Only by integrating it with the study of the classics can one avoid falling into emptiness.",
      "start_char": 4958,
      "end_char": 5986,
      "start_sentence": 187,
      "end_sentence": 218,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.29678726196289,
      "metadata": {
        "source_file": "dao\\藏外\\女丹十则.txt",
        "category": "藏外"
      }
    }
  ]
}