{
  "source_id": "女青鬼律",
  "source_file": "chunked_daozang\\女青鬼律.json",
  "total_chunks": 11,
  "total_original_chars": 10714,
  "total_translated_chars": 61482,
  "total_translation_time": 307.9403419494629,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\戒律类\\女青鬼律.txt",
    "category": "戒律类"
  },
  "full_translation": "**Nüqing Ghost Statutes**\n\n**Sutra Title:** *Nüqing Ghost Statutes*. Author unknown, approximately dated to the Wei-Jin and Northern and Southern Dynasties period. Originally in eight scrolls, six scrolls remain extant. Base text from *Daoist Canon of the Zhengtong Era*, *Dongshen* Section, Precepts and Statutes category.\n\n**Nüqing Ghost Statutes, Scroll One**\n\nThe Statutes state: When Heaven and Earth first came into being, primordial *qi* flowed forth, and the myriad spirits distributed *qi*. There were no ghosts of ugliness, rebellion, perversity, or evil—no unrighteousness. Sons were filial, daughters chaste; rulers observed propriety, ministers were loyal. The Six Directions were as one, and there was no suffering or harm.\n\nAfter the era of the Heavenly Sovereign Yuan, myriad cunning arose. The Great Dao was not believed in; the Five Directions turned to slaughter, and pestilential *qi* gradually arose. Tigers, wolves, and the ten thousand beasts grew large by receiving *qi*; the hundred insects, snakes, and specters multiplied daily. Heaven has sixty days, and each day has one spirit. The spirit presiding over a day allows a thousand ghosts to fly about, unrestrained. The Great Dao did not forbid it; the Heavenly Master did not command it. Thus, the world was left to chaos, with calamities chasing one another. Only in the midst of slaughter were the common people afflicted, and the dead numbered in the hundreds of millions.\n\nThe Most High Great Dao could not bear to witness this. On the seventh day of the seventh month in the second year, at noon, these *Ghost Statutes* in eight scrolls descended, recording the arts of the names and fortunes of the ghosts and spirits under Heaven. They were commanded to the Heavenly Master Zhang Daoling, ordering him to restrain the ghosts and spirits, preventing them from recklessly moving east, west, south, or north.\n\nIf later generations of Daoist men and women encounter this esoteric scripture and know the names of the ghosts to be auspicious, the ten thousand ghosts will not intrude, and the thousand spirits will submit in reverence. Those who uphold and practice these statutes must not recklessly transmit them to unworthy persons. If transmitted to the unworthy, calamity will flow for seven generations—do not blame the Dao for fault.\n\n**Record of Masters’ Names and Lineages:**\n\nThe ghost of the High Heaven, ten thousand *zhang* tall, is named Hundred Ghosts. The Central Sovereign’s surname is recorded as the lord of the Six Directions’ ghosts, dwelling in the southeast corner of Mount Tai by the waters of the Dao. All the dead gather there. Ghosts also ascend to Heaven to be questioned, examined, and punished—once each month. Since ancient times, over thirty-six thousand years have passed, and there are thirty-six thousand spirits equal in number to the ghosts.\n\nThe Three Elders of the Southern Village, commonly called the Five Paths Ghost, surnamed Che, named Ni, preside over the records of the dead and examine the sins of the living—all are directed to them. This ghost resides in the northwest corner of Mount Tai and also has subordinate officials. When summoned to Mount Tai, it returns once. This ghost is a celestial executioner; it only heeds written documents, neither touching Heaven above nor Earth below.\n\nThe Cloud-Middle Yuan Head, a ghost of ruined armies and treacherous generals, surnamed Li, named Sanko.\n\nThe Northern Dipper Three Terraces Beckoning Ghost, surnamed Ban, named Wan.\n\nThe Western Dipper Three Terraces Ghost, surnamed Che, named Qiu.\n\nThe Southern Dipper Three Terraces Ghost, surnamed Ming, named Wenfu.\n\nThe Central Dipper Three Terraces Ghost, surnamed Wang, named Xian.\n\nThe Eastern Dipper Three Terraces Ghost, surnamed Ting, named Che.\n\nThe names and surnames of the Five Dippers’ executioner ghosts preside over the killing of people.\n\nThe Eastern Direction Malevolent Spirit Ghost, surnamed Jian, named Jiaozi.\n\nThe Southern Direction Malevolent Spirit Ghost, surnamed Jing, named Yu, also named Houzhu.\n\nThe Western Direction Malevolent Spirit Ghost, surnamed Tianxie, named Guzi.\n\nThe Northern Direction Malevolent Spirit Ghost, surnamed Wang, named Jing.\n\nThe Central Direction Malevolent Spirit Ghost, surnamed Dai, named Yingzi.\n\nThe names and surnames of the Five Directions’ malevolent spirit ghosts preside over the killing of people.\n\nThe Five Directions’ Rebellious Executioner Annotated Ghost is named Xu.\n\nThe Five Directions’ Duty Talisman Annotated Ghost is named Jie. The Heavenly Examination Rebellious Executioner Duty Talisman Ghost is named Tianyang, also named Yue.\n\nThe Heavenly One Spirit Chief Malevolent Descendants Ghost is named Gaoyaozi.\n\nThe Heavenly One Spirit Chief Harmful Returning Ghost is named Tanqiezi.\n\nThe Heavenly Flying Executioner Chief Shackle Ghost is named Liangfu, also named Rufu.\n\nThe Heavenly Faithful Chief Ghost is named Taiziyuan.\n\nThe above five ghosts are constantly dispatched by the Three Officials Emperor to investigate human sins. These ghosts constantly dwell among people but cannot be seen.\n\nThe Heavenly Cloud-Middle Yuan Named Wandering Ghost is thirty-six thousand *zhang* tall.\n\nThe Heavenly Cloud-Middle Wandering Ghost is named Aizi, also named Xi.\n\nThe Heavenly Cloud-Middle Twenty-Eight Constellations Duty Executioner Ghost is named Yuzi.\n\nThe above three ghosts are the Yin-Yang ghosts of Heaven, presiding over the killing of the living.\n\nThe Eastern Direction Azure Emperor Duty Talisman Ghost is named Boshenzi, also named Guozi.\n\nThe Western Direction White Emperor Duty Talisman Ghost is named Bohezi.\n\nThe Southern Direction Vermilion Emperor Duty Talisman Ghost is named Taibozi.\n\nThe Northern Direction Black Emperor Duty Talisman Ghost is named Tianyizi.\n\nThe Central Direction Yellow Emperor Duty Talisman Ghost is named Boxi, also named Yuan.\n\nThe Five Directions’ Duty Talisman Ghosts constantly kill people and livestock, presiding over strange deaths and ghostly apparitions, dispatched by ancestors.\n\nThe Eastern Direction Azure Emperor Yuan Named Executioner Ghost, surnamed Yuan, named Guxuan. Commanded by the Eastern Direction Jia-Yi Lords, it kills on Jia-Yi days, Chen days, and at the hour of Wu.\n\nThe Southern Direction Vermilion Emperor, surnamed Bian, named Ru.\n\nThe Western Direction White Emperor, surnamed Zhi, named Yan.\n\nThe Northern Direction Black Emperor, surnamed Xia, named Ming.\n\nThe above Four Directions’ executioner ghosts preside over the killing of the world’s rebellious and unfilial.\n\nThe Northern Dipper presides over the killing of one person: seven thousand *zhang* tall, clad in black above and below, surnamed Hao, named Huanlinzi.\n\nThe Dipper’s Net adds seven executioners, nine *zhang* tall, wearing red headbands, presiding over the killing of the world’s treacherous and rebellious ghosts.\n\nThe Great One presides over the killing of formless and nameless ghosts, one *zhang* and six *chi* tall, wearing red headbands and red robes.\n\nThe Heavenly Three-Five Examination Executioner Ghost is named Hui, one *zhang* and seven *chi* tall, clad in white with a red headband, holding a halberd toward people.\n\nThe Heavenly Emperor’s Constant Transgression-Overseeing Ghost, surnamed Xiafan, named Banzi, descends at dusk during the hour of *Rending* to listen to people’s speech, discerning their hearts and minds, then reports back for examination and execution.\n\nThe Five Marchmounts Ghost is named Jinqiang.\n\nThe above Northern Dipper and other ghosts preside over the killing of the treacherous and rebellious, overseeing speech and silence.\n\nThe Jiazi Day Ghost is named Yuanguang.\n\nThe Yichou Day Ghost is named Bingzhang.\n\nThe Bingyin Day Ghost is named Zhaochang.\n\nThe pronunciation of *Zhao* is *Zhao*. The Dingmao Day Ghost is named Zifang. The Wuchen Day Ghost is named Shengjin. The Jisi Day Ghost is named Chuanbian. The Gengwu Day Ghost is named Chaifang. The Xinwei Day Ghost is named Yin Fu. *Wu gu* cut. The Renshen Day Ghost is named Shisong. The Guiyou Day Ghost is named Yiluo. The pronunciation of *luo* is *luo*. The Jiaxu Day Ghost is named Jiaguang. The Yihai Day Ghost is named Bianjin. *Bian wu guan* cut. The Bingzi Day Ghost is named Liuxia. The Dingchou Day Ghost is named Wangmou. The Wuyin Day Ghost is named Quexin. The Jimao Day Ghost is named Yaozi. The Gengchen Day Ghost is named Erzi. The Xinsi Day Ghost is named Yuansheng. The Renwu Day Ghost is named Xian. The Guiwei Day Ghost is named Lichu. The Jiashen Day Ghost is named Yaguang. The pronunciation of *ya* is *yizhe*. The Yiyou Day Ghost is named Niexia. The Bingxu Day Ghost is named Zasheng. *Lang dong* cut. The Dinghai Day Ghost is named Shishe. *Zhi she* cut. The Wuzi Day Ghost is named Zhengfang. The Jichou Day Ghost is named Zhidu. The Gengyin Day Ghost is named Ling. The pronunciation of *ling* is *qin*. The Xinmao Day Ghost is named Fu. *Fu bei* cut. One pronunciation is *fu*, another is *bu*. The Renchen Day Ghost is named Qi. The Guisi Day Ghost is named Beifang. The Jiawu Day Ghost is named Mazijiao. The Yiwei Day Ghost is named Bufuxiang. The Bingshen Day Ghost is named Yougong. The Dingyou Day Ghost is named Jinqing Yiji. The Wuxu Day Ghost is named Zhao Taogao. The Jihai Day Ghost is named Zhu Fuzi. The Gengzi Day Ghost is named Jifang. The Xinchou Day Ghost is named Yi. *Yi shi* cut. The Renyin Day Ghost is named Luojie. The Guimao Day Ghost is named Jianmu. The Jiachen Day Ghost is named Suoliang. The Yisi Day Ghost is named Leiyuan. The Bingwu Day Ghost is named Tingnong. *Nu dao* cut. The Dingwei Day Ghost is named Yiwu. The Wushen Day Ghost is named Quehui. The Jiyou Day Ghost is named Daijie. The Gengxu Day Ghost is named Zongfu. The Xinhai Day Ghost is named Anxuan. The Renzi Day Ghost is named Daozi. The Guichou Day Ghost is named Changshi. The Jiayin Day Ghost is named Biezhuang. The Yimao Day Ghost is named Tian’an. The Bingchen Day Ghost is named Tianji. The pronunciation of *ji* is *ta ji*. The Dingsi Day Ghost is named Tianheng. The Wuwu Day Ghost is named Erben. The pronunciation of *ben* is *ben*. The Jiwei Day Ghost is named E’e. The Gengshen Day Ghost is named Yili. The Xinyou Day Ghost is named Yihu. The Renxu Day Ghost is named Daofu. The pronunciation of *quan* is *quan*. The Guihai Day Ghost is named Dagao Di.\n\nThe above sixty ghosts of the sixty Jiazi days, each with distinct forms, red hair and black garments, ears but no eyes, fly a thousand *li*, their bodies threefold. They slay the treacherous and unfilial, harming the people of heaven. If one recalls their names according to the day, the ghosts dare not approach.\n\nEvery ten days of Jiazi form a *xun*: the inauspicious spirit of the Jiazi *xun* is surnamed Xuan, named Yuheng. The Jiaxu *xun*’s inauspicious spirit is surnamed He, named Peng. The Jiashen *xun*’s inauspicious spirit is surnamed Ji, named Ying. The pronunciation of *ying* is *ying*. The Jiawu *xun*’s inauspicious spirit is surnamed Ben, named Man. The Jiachen *xun*’s inauspicious spirit is surnamed He, named Jianzi. The Jiayin *xun*’s inauspicious spirit is surnamed Su, named Zao.\n\nThe above six Jia spirits are the inauspicious and malevolent lords of killing. People born into the world are not granted a hundred years of life; morning does not guarantee evening, and death outnumbers life. The treacherous killing ghosts pervade the human realm, deceitfully manifesting as myriad illnesses. The five rebellious *qi* cause chills and fever, headaches, or abdominal masses, vomiting, shortness of breath, distension of the five viscera, inverted vision, locked jaw, contracted limbs, and loss of self-awareness, with life hanging by a thread as the malevolent ghosts draw near.\n\nMen and women under heaven, you may consult my charts to know the names of these ghosts, then apply my talisman of the Great Mystery, invoking the generative *qi* of the Three Heavens, the life of the three, five, seven, and nine, to bestow upon the people of heaven—so that those who die may live again. Since the Great Beginning, I have witnessed men and women deceived by cunning ghosts, disbelieving in my truth, and thus I concealed this scripture, for the dead are beyond count. Grieving for them, I now reissue these statutes and commands, revealing the names, garments, colors, and heights of the ghosts and spirits under heaven. Know the statutes, align with the *qi* of the Orthodox Unity, and by recalling the names of the day, ten thousand ghosts will not dare to interfere. If you remain ignorant, claiming no spirit within, you will incur the resentment of the Great Dao above and blame from others below. You will harm yourself; be cautious in the years of the Three-Five. You will see those under heaven who disbelieve in the true *qi* and mock it, even consorting with ghosts. Reflect and discern: how can you hope to live today? Think thrice, do not transgress, and be vigilant.\n\nThe statutes say: The Dao of Heaven employs ghosts to assist the spirits in deploying *qi*. People fear ghosts but not spirits, so ghosts falsely assume their names and titles. Hearing that ghosts possess primordial spirit, people heed their words a hundredfold. Thus, the regulation of yin and yang, the purification of body and mind, and the absence of depravity can restrain ghosts. The thirty-six thousand and more spirits under heaven are all at your command. If your person is not upright, you will suffer their calamities—consider whether you prosper.\n\nThe Northern Dipper governs killing, the Southern Dipper bestows life. Killing is the heavenly net, life is the Three Terraces. As with the human body, above it corresponds to heaven and earth, modeled on the sun and moon. The Dao is not distant; the Three-Five returns in cycles—how precious this is! Among the scattered people under heaven, those who are filial, loyal, and trustworthy may inscribe the names of the sixty-day ghosts, place them in a black pouch, and on the first day of the first month at noon, personally visit a master’s abode to receive them. Fasten the pouch to your left or right arm, and as you come and go, ghosts will not dare to interfere.\n\nUnder heaven at peace, return them to their original governance. When traveling by night and fearing encounter with evil, you may recite their ghostly names—ghosts will not dare confront you. People remain unaware that ghosts and spirits govern themselves; those who go about unprotected suffer calamity, failing to grasp the proper way. Through the cycles of three and six years, you will perish of your own accord.\n\n*End of Scroll One of the Nüqing Guilu*\n*Dongshen Section, Precepts and Disciplines*\n\n**Nüqing Guilu**\n*Scripture Title: Nüqing Guilu*\n*Author unknown, roughly dated to the Wei-Jin and Northern and Southern Dynasties period. Originally eight scrolls, six survive.*\n*Source text: Zhengtong Daoist Canon, Dongshen Section, Precepts and Disciplines*\n\n**Nüqing Guilu, Scroll Two**\n\nThe Supreme Laws of the Three Heavens of Great Clarity and Primordial Origin now command the Three Officials of Heaven, Earth, and Water: when heaven first came into being, only the divine was revered. In this benighted age, chaos and perversion abound; true spirits are unseen, and only ghosts confound humankind. Now we shall record the names of ghosts and establish the Three-Five spirits to govern them.\n\nHerein are set forth the names of mountain and sea ghosts from the second scroll. Wear them for three years, and ten thousand ghosts will not dare confront you. As you come and go, you will master and subdue demonic forces.\n\nThe Dao says: a thousand-year-old tree becomes human; a hundred-year-old stone turns into a maiden; the forms of all beasts harbor ghostly shapes. Know their names, and ghosts revert to their true forms—do not transmit them.\n\nThe mountain sprite’s ghost stands a foot tall, named Zhuorou.\nThe tree sprite’s ghost is named Qunyao. (Also called *Shi*.)\nThe stone sprite’s ghost is named *Yinrouzi*.\nThe tiger sprite’s ghost is named Jianzhuangzi.\nThe snake sprite’s ghost is named *Qishigui*.\nThe beast sprite’s ghost is named Daxiaozi.\nThe monkey sprite’s ghost is named Maliizi.\nThe fox sprite’s ghost is named Daiwu.\nThe *wu* tree’s ghost is named Lianbuzhi.\nThe Five Peaks’ ghost is named Jiexiaozi.\nThe great mountain’s ghost is named Gongqiang.\nThe small mountain’s ghost is named Hebing.\nThe great tree’s ghost is named Fangyu.\nThe small tree’s ghost is named Zhuanqi.\nThe mountain chamber’s ghost is named Qixue.\nThe stone hollow’s ghost is named Shuilian.\nThe earth spirit’s ghost is named Keyu.\nThe spreading stone’s ghost is named Yuesu.\nThe banyan’s ghost is named Ruyuan.\nThe pomegranate’s ghost is named Wu□. (Pronounced *zhen*.)\nThe hundred insects’ ghost is named Xia□.\nThe empty stream’s ghost is named Huo□. (Pronounced *zhu*.)\nThe river’s ghost is named Nilinzi.\nThe desert’s ghost is named Xian□.\nThe fertile land’s ghost is named Kanfen.\nThe Shandu’s ghost is named Tianwang.\nThe mountain-covering ghost is named Zhujiaji.\nThe five-colored ghost is named Houxiang.\nThe Great Mystery’s ghost is named Jiji.\nThe male lecher’s ghost is named Daiwen.\nThe female lecher’s ghost is named Jiejiao.\nThe green *qi* fever ghost is named Gaoyuan.\nThe white *qi* fever ghost is named Bosang.\nThe red *qi* fever ghost is named Shixuan.\nThe yellow *qi* fever ghost is named Juntai.\nThe black *qi* fever ghost is named Wenxia.\nThe household’s ghost is named Yaozi.\nThe dining vessel’s ghost is named Houfu.\nThe latrine’s ghost is named Xiangtian.\nThe well ghost is named Qiong.\nThe stove ghost is named Ganyuan.\nThe bed ghost is named Heziyifu.\nThe parasol’s ghost is named Yan.\nThe banner’s ghost is named Tuo.\nThe drum’s ghost is named Luan.\nThe reed pipe’s ghost is named □.\nThe pit’s ghost is named Fuzhi. (Also called Luoyuan.)\nThe embankment’s ghost is named Hezi. (Also called Ruzheng.)\nThe halberd’s ghost is named Erqin.\nThe sword’s ghost is named Jianzifu.\nThe armor’s ghost is named Zixian.\nThe chariot’s ghost is named Ru Xianzi. (Also the ox-cart’s ghost.)\nThe thousand-year-old white bone’s ghost is named Yuanshi.\nThe hundred-year-old white bone’s ghost is named Yinshi.\nThe fifty-year-old ghost is named □□.\nThe celestial peak’s ghost is named Jinshengzi.\nThe heavenly whip’s ghost is named Kefuyuan.\nThe Green Earth Lord’s ghost is named Yuan.\nThe Red Earth Lord’s ghost is named Chihe Yuan.\nThe Yellow Earth Lord’s ghost is named Keyuan.\nThe White Earth Lord’s ghost is named Shuben.\nThe Black Earth Lord’s ghost is named Shimin.\nThe River Earl’s ghost is named Da.\nThe Nine Rivers’ ghost is named Huo.\nThe Three Rivers’ ghost is named Jian.\nThe Four Waterways’ ghost is named Hou.\nThe dog and horse’s ghost is named Ci.\nThe chariot’s ghost is named Tong.\nThe *puyuan* tree’s ghost is named Tiansi. (Also called the war chariot.)\nThe iron sprite’s ghost is named Yiyuan.\nThe metal sprite’s ghost is named Yichong.\nThe bronze vessel’s ghost is named Yangsha.\nThe Five Peaks’ ghost is named Er□. (Also called the mountain man.)\nThe chaos ghost is named Qu. (Also called Tanfa.)\nThe pillar’s ghost is named Wenluo. (Also called Yuanluo.)\nThe five axes’ ghost is named Wusheng.\nThe eldest son’s ghost is named □. (Also called Zishi.)\nThe clothing’s ghost is named Shi□.\nThe five colors’ ghost is named Tijing.\nThe five flavors’ ghost is named Yuan□.\n\nThe statutes say: in a single lifetime under heaven, there are a thousand myriad ghosts—ever more distant from the divine, ever closer to the demonic. Under heaven’s turmoil, they cannot be known. Those who suffer misfortune and meet death number in the thousands and tens of thousands, yet the ghosts do not cease. Now their true names are recorded so that people may know them. Once you know a ghost’s name, evil will not dare approach. Call its name thrice, and the ghost’s *qi* is severed; heavenly ghosts descend, earthly ghosts are slain together. All ghosts have names—know the names of the Three Terraces’ ghosts, and the ten thousand ghosts will be at your command.\n\nThe statutes say: When the human body suffers illness, distress, or urgent calamity, the master may employ talismans to summon the names of ghost-slaying spirits and apply the method of subduing ghosts. If a household’s misfortunes and ailments persist, place a talisman facing north in the central courtyard upon the day’s celestial stem, grasp the Celestial Pass with the left hand and the Fire Phase with the right, and recite the incantation thrice: *\"Heavenly One, Lady Green, slay the ghost—ten thousand thousand, Great One, Nine Qi, seize the demonic spirits and ghosts. Death spirits, Perfect Dao, seek the boundless—chichichi!\"* Then turn right toward the Heavenly Gate and hold the breath for twenty-four cycles. Upon resuming breath, face the Earthly Portal and recite thrice: *\"Great One commands me to slay the myriad ghosts—ghosts depart, spirits arrive!\"* Perform this urgently three times, and the hundred demons will instantly appear before and behind you. The gods will escort the celestial net, hastening the interrogation of all ghosts, leaving none to escape. This may be used to heal the body, but do not recklessly show it to the uninitiated.\n\nThe ghost of Great Harmony has no body but possesses a head. Its head is three feet long, its eyes three inches wide, its ears seven inches broad, its brows five inches wide, its mouth three inches across, its nose two inches large, its beard three feet long, and its hair ten feet long. It inhales the *qi* of heaven and exhales it as clouds. If you encounter it while traveling, its name is Zibei—call it thrice, and its form will manifest, and all accompanying ghosts will submit. When traveling, do not carry gold or coins on your person, for their radiant *qi* will cause ghosts to flee upon seeing them. If coins are on you, ghosts will know you understand their concealment. Should you encounter one while traveling by water, call out Hefen, for it is also a water ghost, capable of transforming into the shape of a crow, bright as a raven. Slay it, but tell no one. After three years of such practice, you may traverse mountains and seas without fear—greatly auspicious.\n\n*End of Scroll Two of the Nüqing Ghost Statutes*\nProduced by the Daoist Academic Information Network\n\nProduced by Hong Baijian\nSource: *Zhengtong Daoist Canon*\nSponsor: *Scroll Three of the Nüqing Ghost Statutes*\n**Daoist Precepts and Prohibitions**\n\nThe Heavenly Master declares: Behold the men and women of the world—daily they act without loyalty, and though they perform good deeds, no reward comes. Disasters and calamities arise day by day. Heaven examines the ghostly thieves, and the Five Poisons spread unchecked, all born of disbelief and neglect. Those who guard the One and practice virtue bring misfortune upon themselves; you shall not attain long life in this world. I have received the stern command of the Most High to reveal this to the people of heaven, that they may know the prohibitions and not transgress the divine statutes of the *Nüqing Xuan Du Ghost Statutes*. Let all of you hear and understand: the rebellious shall return to obedience, the wicked to goodness. Reform the past and cultivate the future—abide by these ghostly statutes.\n\n1. You shall not, whether going east or west, south or north, depart or return without reporting your going or announcing your return, following your own will without restraint. All such acts violate the statutes, and thirty-two years shall be deducted from your lifespan.\n\n2. You shall not invoke heaven as though it were godless, nor speak of the Daoist master’s decrees to disrupt governance and sow disorder. To claim yourself a Daoist while speaking falsehoods violates the ghostly statutes, and thirteen years shall be deducted from your lifespan by heaven.\n\n3. You shall not mingle truth with falsehood, nor disrupt the sagely and enlightened with lewdness. You shall not drink wine, eat meat, or rail against the Dao, lest one thousand three hundred years be deducted from your lifespan.\n\n4. You shall not spread malicious words, slander others, or fabricate teachings without faith in the heavenly Dao. To speak emptily of what is without substance shall cost you one thousand two hundred years of your lifespan.\n\n5. You shall not engage in duplicity, falsehood, or capricious anger, nor persist in rebellion and slaughter without heeding the balance of yin and yang. Heaven shall deduct one hundred thirty-two years from your lifespan.\n\n6. You shall not disrespect the elderly, curse your kin, or invoke curses between husband and wife, nor harm one another with venomous intent. To commit the Five Iniquities of unfilial conduct shall cost you one hundred eighty years of your lifespan.\n\n7. You shall not, upon receiving the Dao, act with disdain, nor transmit it to the unworthy. You shall not covet wealth or profit at others’ expense, nor borrow without repayment, treating others’ possessions as your own. Heaven shall deduct one thousand eight hundred years from your lifespan.\n\n8. You shall not engage in quarrelsome speech, nor indulge in drunkenness and lust under the pretext of the Great Dao. You shall not utter ghostly words to entangle men and women, nor drink wine or eat meat during the hours of yin. Three hundred years shall be deducted from your lifespan.\n\n9. You shall not wander east and west, entangling men and women, nor fail to resolve calamities, thereby fostering perverse disorder. Heaven shall deduct thirteen thousand years from your lifespan, and the misfortune shall flow through seven generations.\n\n10. You shall not transmit the Dao to maidens, nor enter the Gate of Life to harm the spirit and violate *qi*. To act with perverse wickedness shall bring death without descendants. You shall not reverse male and female, inverting yin and yang, lest three hundred years be deducted from your lifespan.\n\n11. You shall not expose the union of yin and yang, offending the Three Luminaries. To engage in such acts under the influence of wine, yielding to lustful contact, shall cost you three hundred years of your lifespan.\n\n12. You shall not cause one’s *qi* to live while another’s *qi* dies, nor coerce a Perfected One. Heaven shall deduct thirty-three years from your lifespan.\n\n13. You shall not cause father and son to dwell apart, nor scatter the household. Heaven shall deduct twenty-two years from your lifespan.\n\n14. You shall not indulge in excessive desires and depravity, nor gather men and women to spread perverse and heretical words. Heaven shall deduct one hundred twenty years from your lifespan.\n\n15. You shall not, among those of the same teaching, slander one another, nor speak of the Dao without faith in the Three and Five. To debate the length of heaven’s *qi* shall cost you eight hundred twenty-three years of your lifespan.\n\n16. You shall not flee from your parents to wander the four directions, nor stand in the position of true *qi* to gather and unite with others. Heaven shall deduct three hundred twenty years from your lifespan.\n\n17. You shall not destroy what heaven has begotten, nor recklessly slay beasts, shoot flying birds, or reverse south and north, following your own will without adhering to the ghostly statutes. Heaven shall deduct three thousand years from your lifespan.\n\n18. You shall not pry into others’ affairs, nor expose the secrets of households. You shall not conceal goodness and reveal evil, nor seduce others’ wives or scheme against their husbands. To rebel against the Three Luminaries, secretly harm others, or invoke curses—committing the Five Iniquities of unfilial conduct—shall cost you one thousand two hundred twenty years of your lifespan.\n\n19. On the day you practice the Dao, you shall not indulge in lustful thoughts. Though your *qi* may grow long, you shall not indulge yourself, nor make private vows, thereby fostering unfilial conduct. With a heart of perversity and no Dao within, you are a child without the Way. Heaven shall deduct thirty thousand years from your lifespan.\n\n20. You shall not, while contemplating the spirits, fail to receive their response, nor generate *qi* through practice only to draw down primordial *qi* for lustful indulgence. To cling to desire and love of form, never parting hand from foot, day and night without cease—such is the way of the faithless. Heaven shall deduct three hundred forty-two years from your lifespan.\n\n21. You shall not recklessly transmit the Red *Qi* to the uninitiated, nor engage in contact of mouth, hand, chest, or heart. To forsake the Dao and betray your master, leaving the teaching without method, shall cost you three hundred years of your lifespan.\n\n22. You shall not recklessly transmit scriptures to the uninitiated, nor reveal the names and taboos of Daoist parents, nor leak essential secrets to the profane. Heaven shall deduct three hundred years from your lifespan.\n\nThe Heavenly Master declares: I have received the command of the Most High, and the prohibitions are most severe. Yet you, men and women, have lived in confusion from birth to this day, unaware of the restrictions, creating your own teachings in defiance of heaven. When the Examiner arrives, heaven shall deduct your allotted years, and you shall know bitter sorrow, never beholding the Great Peace.\n\nThose who live as libationers and Daoist priests, spreading transformation with merit, may redeem transgressions through their deeds. If the people do not heed this, yet you possess the heart to spread transformation, you may reform the past and cultivate the future, focusing solely on nurturing your nature. Thus, you may transcend the Three Calamities and Nine Tribulations of heaven.\n\nYou, who persist in evil and rebellion, forsaking loyalty and filial piety—fear for your years and life, which you cannot preserve. I grieve for you, and thus I earnestly exhort you again and again.\n\nThe Heavenly Master declares: Men and women of the world, upon seeing these admonitions of goodness, fail to follow them, instead pursuing their own desires. They teach others to act wrongly, engaging in slander and spreading the teachings of ghosts.\n\nThe young and old rush headlong into fleeting worldly pleasures—these are the axes that hew at the body, the halberds that destroy life, joys of a single moment that bring a thousand years of disaster. You who already know the Dao, and you who do not yet know it: upon seeing these ghostly statutes, both new and old regulations, you may all follow and apply them. On the days of three, five, seven, and nine, take care to practice the cultivation of generative qi. If you adhere to my diagrams and avoid violating the Three Qi, you may attain transcendence and transform a thousand people. Those who do not know the true names of their father and mother remain common folk. Daoist priests who know the Yellow Writs and covenants yet do not know the Twenty-Four Divine Persons are but false practitioners. The Dao’s ultimate reckoning is complete; heaven possesses its Three and Five, yet you remain ignorant—how then can you claim the Dao is not divine? If you do not know the Dao, how can you say the qi is not luminous?\n\nHearing a hundred times is not as good as seeing once. Why do you not transform your heart and renew your innards, entering into the generative qi of my Way? Then you may become a true person, and on the day of Great Peace, ascend to heaven in flight. If you still do not ascend, yet your lifespan does not end in death, you shall become an earthbound immortal and witness the Great Peace. Day by day, you grow ever more vexed and troubled, disbelieving and disloyal, practicing only what is contrary to the Dao. You shall not see the Great Peace. I grieve for you—what more can I do?\n\nThe Heavenly Master declares: Men and women of the world, you already know the great Dao of long life on the days of three, five, seven, and nine, yet you do not follow my methods, instead engaging in evil, lewdness, and disorder. I fear you shall perish before the wicked. I earnestly admonish you once more—ponder this well.\n\nThe Heavenly Master declares: Practice restraint and follow the Dao. Be diligent in observing the regulations. Let your eyes not gaze recklessly, your mouth not speak recklessly, your heart not harbor reckless thoughts, your feet not wander recklessly. Draw near to the good and distance yourself from evil. Harmonize with the spontaneity of the body, and thus there shall be no need for repeated instruction. Reflect upon this carefully.\n\n*End of Scroll Three of the Nüqing Guilu*\n*Beginning of Scroll Four of the Nüqing Guilu*\n\nThe Heavenly Master bows his head, reverently upholding the Dao of the former kings, governing the people and restraining ghosts. Now, with the qi of the Alliance’s Might and Orthodox Unity, and the Nüqing Guilu, he commands all demonic and spectral beings of the world, assisting the Dao in its flourishing transformation. He carves the true names of ghosts, and those in authority must strictly enforce them, so that the Dao’s qi may spread throughout the world, and rebellious spirits submit as guests. If you know the names of ghosts, they shall flee of their own accord and dare not harm people. Keep this always in mind, and do not violate it.\n\n**General of the Dao’s Upper Army: named Houfu.**\n\n**General of the Dao’s Lower Army: named Yiche.**\n**Heavenly Rebel Ghost: named Wenyanxuan.**\n**Earthly Rebel Ghost: named Jingzi.**\n\nThe four ghosts above govern wind and rain, causing harm to people as they follow the seasons. When traveling on roads and encountering great wind and rain, call out the names of these four ghosts, and evil qi will not dare to afflict you.\n\n**Ancient Ominous Ghost: named Jinzhongshi.**\n**Rebel Ghost: named Nonger Zilanluan.**\n\nThe two ghosts above are the spirits of ancient corpses in ruined tombs, or the ghosts of shamans and unorthodox Daoist masters. They inflict harm upon people in a hundred ways. If you know their names, the ghosts will submit and remain still, daring not to move.\n\n**Heavenly Upright Ghost: named Dieshe Diedajie.**\n**Earthly Upright Ghost: named Xinmu (Xin pronounced as *qin*).**\n\nThe two ghosts above are the death-bringing guardian ghosts of houses, dwelling constantly upon the beams of people’s halls. At night, they harm people, chickens, dogs, and the six livestock. If you know their names, the ghosts will submit and dare not move. These ghosts do not dare harm people; in households with virtue and power, they instead protect against external misfortune and calamities, preventing them from entering the home.\n\n**Shenjiunian**\n**Hou Mugao**\n\nThe two ghosts above appear when people build houses without matching the color of the pillars to the ridgepole. If seen at dawn or dusk, or under the light of stars and the moon, they possess spirits that bring harm and turn people into rebels. If you know their names, the ghosts will not harm people.\n\n**Lingjinghua**\n**Shi Buzuo**\n\nThe two ghosts above are the spirits of bronze and gold coins in people’s homes. They manifest as these ghosts, sometimes transforming into human form, causing unrest in the household. Call out to them, and they will depart.\n\n**Yibagen**\n**Shegu**\n**Yinjiu**\n\nThe three ghosts above dwell in the four corners of the walls within people’s homes. They appear when the master and mistress of the house lack the Dao, failing to follow the harmony of yin and yang. These ghosts serve as *baizhifu* (white straight talismans), and the *baizhifu* report matters to remove people’s names from the register of the living. If you know their names, the ghosts will not dare to move. Command the ghosts to be suppressed in the four corners of the house by writing with cinnabar on a peachwood thorn twelve inches long, and hang it above the door. The method of command is as follows:\n\nThis talisman is governed by the Azure Dragon in the east, the White Tiger in the west, the Vermilion Bird in the south, the Dark Warrior in the north, and the Yellow Qilin in the center. It repels demonic thieves. *Hastily, hasten as the statutes command!*\n\nThis talisman controls a hundred ghosts.\n\n**Tianzai**\n**Miexiang (Mie pronounced as *e*, Xiang as *zhu*)**\n\nThe two ghosts above are the *menbo* (gate elders) and *hucheng* (door guardians). By day, they serve as divine protectors of the household; by night, they become ghosts. If you know their names, at the hour of *ren ding* (9–11 p.m.), call out their names to the left and right of the door, clap your hands three times, turn your head away, and hold the gesture two or three times—these ghosts will then cease and dare not cause harm.\n\n**Fujinmu**\n**Hekaikangcu**\n\nThe two ghosts above dwell in trees or bamboo groves on people’s properties, where crows, turtledoves, egrets, and flocks of birds perch. All such places harbor demonic influences. If you know their names, call out to them three times every evening. The ghosts will realize they cannot overpower you and, within seven to nine days, will die of their own accord. If they do not die, they will often blow in the dark, submitting and no longer harming people.\n\n**Zigan Fangzhuan (Gan pronounced as *ju*, Zhuan as *zhuan*).**\n**Taishun (Shun pronounced as *shen*).**\n**Chenfa**\n\nThe three ghosts above are the world’s ghosts that afflict people with epilepsy. They wear red clothing and black headscarves and are responsible for seizing people’s souls. If you know their names and are ill, you will recover immediately, and the ghosts will not dare to interfere.\n\n**Sanghuazai**\n**Biqitu Fu**\n\nThe two ghosts above are the essences of women’s menstrual blood. Ghosts often crave the taste of yin-yang blood. When a woman’s menstruation arrives, visualize them day and night and call out their names—the ghosts will not dare to harm people. These ghosts are three feet tall and wear blue clothing from head to toe.\n\n**Yuji (Ji pronounced as *bi*)**\n**Jingzao (Zao pronounced as *ni*)**\n\nThe two ghosts above are the ghosts that attend women during childbirth. When a woman is giving birth, call out the names of these ghosts, and they will not harm her. These ghosts are three inches and three-tenths tall and wear black clothing from head to toe.\n\n**Xujinghua**\n\nThis ghost harms people’s fields and silkworms—it is the Silkworm Maiden Ghost. On the day of *Lichun* (Beginning of Spring) at dawn, face the Gate of Heaven and recite the following incantation three times:\n\n*\"Radiant and pure is the August Heaven,*\n*Vast and eternal, filled with many spirits.*\n*Yin does not reach you—*\n*Ma Gu, come to my home,*\n*Let silkworms multiply a thousand ten-thousandfold,*\n*And fields yield a thousand billion bushels.*\n*Contemplate the upper and lower of Heaven,*\n*The upper and middle of Earth,*\n*And the great Dao that abides.*\n*Command Hua to serve me, rebuke and expel!*\n*Hasten to slay a hundred harms,*\n*What can petty demons do, howling like wolves?\"*\n\n**Jinjin (Jin pronounced as *xiao*, the second character as *li*)**\n\nThis ghost is the Sweeping Ghost of dawn and dusk, causing people to lose their wealth. If you know its name, at dawn each day, face the Gate of Heaven and call out its name three times, reciting the following incantation:\n\n*\"Stone Unborn, Stone Unborn,*\n*Taiyi commands you to serve me.*\n*What demon dares oppose?*\n*Make it swiftly depart, swiftly depart!\"*\n\nThe Dao thus commands all men and women under Heaven to receive the Dao, ponder the true essentials of the oral instructions, and hold them forth to their descendants. You may thereby visualize the divine luminaries and, with truth, dispel the demonic. Within these eight scrolls, the fourth scroll is the most authentic and can deliver the world. Do not violate or transgress it—be cautious.\n\nThe Heavenly Master commands: Within the *Lü* (Statutes) of the *Nüqing*, ghosts dare not disobey. Flying talismans connect to Heaven, the One Origin and Three Spirits—this is the essential method of the Heavenly Master’s own body and its divine ghosts. *\"Keep soldiers at a distance! The Great King governs the Origin, the One, the Nine, and the Three Qi. The Elder of the Nine Qi, the Father and Mother Taiyi, command me to gather the slayers—come forth at once!\"* After a long pause, bow three times and recite the *chi* (rebuke) twenty-four times in a low voice.\n\nThe above is the Heavenly Master’s command to the great demon of water—ghosts will not dare to harm people.\n\n*End of Scroll Four of the Nüqing Guilu*\n*Beginning of Scroll Five of the Nüqing Guilu*\n\nThe Dao says: The world is in turmoil, ever like floating clouds. Rulers plot against their ministers, wives scheme against their husbands. Mars and Venus transform into humans, lingering near children with deceitful words. They weave webs of falsehood and treachery, choking the throats of the young so they cannot swallow. They spread rumors along the roads, whispering that you will die within the year. First, there is great joy, then terror—such is the turning of Heaven and Earth’s fate.\n\nThose entrusted with leadership must ensure diligence, ever guarding the One to cultivate eternal existence. Do not indulge the heart’s whims, nor abandon the Three and Five to pursue depravity. Though the great Dao of Heaven imposes no prohibitions, the Three Offices’ overseers select the *zhongmin* (seed people). Those who harmonize with *qi* number eighteen thousand—how many have endured from ancient times to now? Before your allotted span is complete, refine your body, transform your heart and bowels, and become a true person of the Dao. The master transmits oral instructions to reveal the worthy; wearing my contract and seal takes precedence. Should you meet the Perfected Lords of Great Peace and the Immortal Sages, the Five Emperors’ overseers will impart secret teachings. The Three, Five, Seven, and Nine—revered *qi* of the Dao—are governed in the pure subtlety of Kunlun Mountain. Recently, the Three Heavens have entered the human body, unraveling the snares of the net to bow before the Venerable Lord. Calm the heart, settle the intent, and walk the path to immortality; whether long or short, do not falter halfway. You may reach the covenant by contemplating the *yuanchen* (primordial cyclical signs); the cycles of Seven and Nine distinguish the true person.\n\nThe people of the world are stubborn and foolish, seeing the age’s turmoil yet unaware of sorrow. Cold ghosts come to wander with you, while Venus traverses the heavens, its six red trails stretching long. Old men on the roads support one another, hunger gnawing at their cheeks as they bow their heads in supplication. Grain and gold grow scarce and unattainable; calamity, warfare, and great peril arrive in the *gengzi* year. Consider your fate bound to this destiny—beyond the frontier, in distant prefectures, the Hu and Yi barbarians, their necks swollen and throats inflamed, are a rebellious people. Born of noxious winds and poisons, they serve Heaven in body. Great and small alike come to this land; I possess Hu ghosts by the hundreds of millions. They feed on human blood and essence, their hair bristling in defiance—why have they entered your realm? The chaos of armies and horses defies description. Should you be linked to them even for a day, you will find no forward step, your limbs stiffening and stretching uncontrollably. If you doubt the *gengzi* year, reflect on my words today. Sun and moon may darken, their light lost; the five grains will fail to grow as perverse ghosts roam. In this *gengzi* year, few will escape annihilation—if any remain, they will swarm like flying wasps. Great and small will follow one another, the Three and Five uniting in pairs. Should you fail to encounter this fate, you will perish before the year arrives. Not one in a hundred will survive—what recourse remains? Heaven and sun, moon and earth, will be reborn. Only in the Great Peace below will the *zhongmin* in Heaven behold their mother. If you disbelieve the great Dao, consider these words: is it not filial piety that sustains the Dao? How can one speak of such a day? Why not study a little and attain the immortals? Crossing the threshold of Great Peace, you become a true person, sun and moon arrayed like streaming stars. The Three, Five, Seven, and Nine—Dao’s luminous and dark *qi*—are distributed across the Nine Provinces like brothers. All share one contract, their hearts united, each following the Dao’s guiding scriptures. The great essentials of yellow and red guard long life; the upper register’s supreme purple tallies the human count. The myriad’s reckoning unites with the divine spirits; feigning foolishness and silence, they preserve the Three Ones in accordance with the Dao’s scriptures. Though a thousand shadows obscure, clarity emerges in action. The Dao of Heaven is vast and boundless, yet its truth endures; day follows night, and Heaven and Earth abide. Take the sun as husband and the moon as wife—how does their *qi* commingle? The divine mausoleum of the great mountain shelters the spirits; witnessing the primordial transformation, they dwell without fixed abode. Hands bound in sincerity, they do not relax their vigilance, transcending the teachings of kings to embrace the Dao.\n\nWithin the Northern Dipper resides the Great White Star, its three points vast and luminous, resembling a human form. It roams the world, transforming discord into harmony—those who know awaken, while the ignorant tremble. Who rectifies this Dao and bears a name? The Wooden Child and the Three Terraces ever accompany it. The covenant awaits the great assembly when the world is at peace; the Five Phases array themselves, metal and wood born, fire and water as parents, earth as the encampment. The Dao emerges from primordial *qi*, following the ancient scriptures. The inner and outer luminous spirits manifest their true forms, weaving the purple loom to ascend the Heavenly Court. Gazing toward the eight extremities, one ascends the Grand Clarity; the number sixty-four arises from the One. If your heart does not comprehend, your mouth may speak the names—Heaven and Earth’s yin and yang place humanity first. The five viscera and bones harbor spirits; those who delight in long life all become flying immortals. Dispel great calamities and avert disasters; know a little of the Three and Five to govern the body. Long practice of the Seven and Nine refines *qi*’s divisions; crossing into Great Peace, you become *zhongmin*. The men and women of the world gather like clouds, assembling before the Perfected of the Great One and the Immortal Dao. After three days without hesitation, they return; one heart, two mouths, they ascend in resonance with Heaven. Your long life emerges from your heart; the Three, Five, Seven, and Nine unite as kin. Only the great *qi* of rectitude makes one *zhongmin*, liberating the body’s gods from the snares of the net. Ascending in broad daylight to the Heavenly Hall, one emerges after a thousand years, a body sixteen *zhang* tall. The Five Marchmounts and Four Seas issue from the Nine Provinces, merging into an ocean that ceases to flow.\n\nThus emerges the *Nüqing Guilu*; how joyful is its transmission throughout the world! The wise will come of their own accord to seek the true companions; the foolish will depart to dwell on Mount Tai. White bones lie scattered, ghosts lurking in darkness, their wails unceasing—what can I do? Immortal youths and jade maidens dwell with the spirits; how should they regard such beings? The world’s true decline is imminent; the *gengzi* year’s fate approaches. Not one in a thousand will escape—only those with resolve will meet an age of clarity. Shun evil, pursue goodness without seeking glory; dust-stained robes may yet clothe the form. The heart abides in the Great One, chanting scriptures; by day cultivate goodness, by night preserve life. Let your hair flow unbound as you walk the Yellow Court, invoking the Supreme Lord’s Dao and name. Emerging from the Mysterious Capital to enter the Grand Clarity, you receive esoteric instructions to transcend calamities. Foolish worldly children know not life—when will they unite with the perverse spirits? The Great One descends to record names, fearing your body will not long endure. Vow not to die, and follow my scriptures.\n\nThe Heavenly Master says: The great Dao bestows its precepts, transmitted by Nüqing—the Three, Five, Seven, and Nine are the root of long life. [Respectfully] uphold and practice them, passing them down through the generations. If you possess a heart and share in my *qi*, you must reflect on practicing benevolence and righteousness, guarding loyalty across the Six Directions, focusing on nurturing your nature, and taking the Dao as your home. Do not betray or transgress. The true words of the Supreme Lord, the Master, and the Great One: Thus, on the seventh day of the first month of the first year, we put this into practice. Among a thousand followers, Wang Chang and Zhao Sheng were the two who could be transformed and guided by the Dao’s *qi*, enabling them to fully attain the great principle of long life.\n\nDo not offend the spirits of men and women. Do not invoke heaven or summon earth. Do not sacrifice to stale *qi*. Do not point at ghosts or call upon spirits. Do not indulge in lust or act with disrespect. Do not speak of *qi* with obscurity. Do not harbor dual minds or crooked intentions. Do not recklessly transmit demonic teachings. Do not violate the Five Spirits or the Seven Governors. Do not collude with ghosts. Do not disrupt the divine order. Do not let the profane overcome the sacred. Do not come or go without restraint. In haste or distress, do not wail and beseech ghosts and spirits.\n\n*End of Scroll Five of the Nüqing Demon Statutes*\n*Scroll Six of the Nüqing Demon Statutes begins*\n\nThe Heavenly Master says: In recent years, yin and yang have fallen out of harmony, water and drought have been unseasonable, and disasters and omens have repeatedly appeared—all due to human affairs losing their proper order.\n\nHumans, as beings of middling capacity, emulate earth to follow heaven, moving and resting in accord with the seasons, communicating without contention, benefiting without harm. Thus can they attain the state of divine transcendence. Yet in this degenerate age, the Dao is abandoned, and people frantically vie for self-interest. They defy heaven and earth, oppose and betray their masters and elders. Hierarchies blur, superiors and inferiors grow estranged. Good and evil are indistinguishable, and the worthy withdraw into obscurity. The state lacks loyal ministers; loyalty and benevolence are forsaken. Laws and decrees go unenforced; deceit and fraud prevail. Bandits and rebels fill the land, bringing humiliation to the Central Kingdom. The myriad people scatter, suffering from famine and cold. Half perish, and nine out of ten are wounded. How grievous! How grievous!\n\nChaos cannot endure. The ravenous must be eradicated. The Dao’s fortune is set to rise, and the era of Great Peace draws near. Now is the time to drive out the wicked and preserve the good seed of humanity. All libationers, men and women, and every living person must swiftly verify and examine one another, seeking out the loyal and worthy who revere and cherish the Dao. Those who are naturally inclined toward virtue are few; diligent supervision is required. If one can reform their errors, they shall be counted among the meritorious.\n\nAmong people, there is no distinction of high or low, no adherence to noble or base. Only evil is to be regarded as true, and no private embellishments are permitted. Those who are nominated but prove unworthy, or who are unjust, shall be punished accordingly, with no hope of long life.\n\nKings, lords, governors, and all officials—if you heed my words, promote the good and instruct the people, exhorting those who cannot reform, replacing punishments with benevolence—then the libationers shall record your deeds and submit them to heaven. Those who labor shall receive manifest rewards and ascend to the ranks of divine transcendents. But those who lack sincerity, shirk their duties, or avoid committing their names to the practice of goodness shall be deemed wicked and cast out. The records of the upright shall be precise, without the slightest deviation.\n\nWhen the common people delight in goodness and are counted among the virtuous, they shall return to their native villages to bring peace to the land. When all people cultivate goodness, the world shall attain Great Peace. Calamities and rebellions shall cease, and disasters shall no longer arise. How joyous! How joyous!\n\nNow I dispatch the Five Lords, each leading ten thousand ghosts, to spread across the land and execute the wicked. Those slain shall not be called mad, nor shall they be recklessly spared upon investigation. If ghosts err and wrongly afflict the virtuous, their lords shall absolve and protect them. If ghosts refuse to depart, they shall be strictly seized and punished. Reward the good and punish the evil, clearly adhering to the statutes of the Dao.\n\nThe Lord of the Eastern Blue *Qi* is surnamed Liu, named Yuan Da. He commands ten thousand ghosts, spreading diseases of malignant winds.\n\nThe Lord of the Southern Red *Qi* is surnamed Zhang, named Yuan Bo. He commands ten thousand ghosts, spreading diseases of febrile toxins.\n\nThe Lord of the Western White *Qi* is surnamed Zhao, named Gong Ming. He commands ten thousand ghosts, spreading diseases of *qi* infixation.\n\nThe Lord of the Northern Dark *Qi* is surnamed Zhong, named Shi Ji. He commands ten thousand ghosts, spreading diseases of virulent poisons, cholera, and excruciating abdominal pain.\n\nThe Lord of the Central Yellow *Qi* is surnamed Shi, named Wen Ye. He commands ten thousand ghosts, spreading diseases of malignant sores and ulcers.\n\nAll who wish to inscribe their names in the Register of the Living and become the seed people shall follow this document. Call upon the names of these ghost lords according to the affliction, and once their names and the names of their ghosts are known, the illness shall be cured. Let each person copy this text once, carry it on their person, and recite it, so that all calamities and harms may be dispelled.\n\nThe Eastern Blue Fever Ghost is named Jiu Yuan.\nThe Southern Red Fever Ghost is named Shi Yan.\nThe Western White Fever Ghost is named Yao.\nThe Northern Black Fever Ghost is named Tian Xia.\nThe Central Yellow Fever Ghost is named Tai Huang Nu.\nThe Sixth Fever Ghost is named Zhu Nü.\nThe Seventh Fever Ghost is named Bo Ling.\nThe paternal grandfather is named Liang Zhou.\nThe paternal grandmother is named Jiao Cheng.\n\nThe father is named Yan Nian. The mother is named Chu Zhong.\n\nThe five directional fever ghosts, together with their seven brothers—eleven in all, including their paternal grandparents and parents—possess forms capable of flight. They move with the moon to spread poison and punish the wicked.\n\nThe first *gu* ghost is named Shi Qu.\nThe second *gu* ghost is named Jiu.\nThe third *gu* ghost is named Li Jiu.\nThe fourth *gu* ghost is named Cheng Yan.\nThe fifth *gu* ghost is named Bu Shi.\nThe sixth *gu* ghost is named Wu Wu.\nThe seventh *gu* ghost is named Lü Zhi.\nThe eighth *gu* ghost is named Yu Yi.\nThe ninth *gu* ghost is named Shi Qian.\n\nThese nine *gu* ghosts perpetrate all manner of vile poisons, bewitching and confounding the world. Together with the five fever ghosts, including Tai Huang Nu, they spread their toxic *qi*.\n\nThe fever ghost of the first month is named Wei.\nThe fever ghost of the second month is named Zhong.\nThe fever ghost of the third month is named Liu.\nThe fever ghost of the fourth month is named Cun.\nThe fever ghost of the fifth month is named Lei.\nThe fever ghost of the sixth month is named [omitted].\nThe fever ghost of the seventh month is named Ban.\nThe fever ghost of the eighth month is named Huai.\nThe fever ghost of the ninth month is named Nong.\nThe fever ghost of the tenth month is named Bei.\nThe fever ghost of the eleventh month is named Ying.\nThe fever ghost of the twelfth month is named Jian.\n\nThese twelve monthly fever ghosts, each following their respective month, roam the world and harm all living beings.\n\nThe fever ghost of the *zi* day is named Gen.\nThe fever ghost of the *chou* day is named Dang.\nThe fever ghost of the *yin* day is named Yi.\nThe fever ghost of the *mao* day is named Yi.\nThe fever ghost of the *chen* day is named E.\nThe fever ghost of the *si* day is named Ai.\nThe fever ghost of the *wu* day is named Wu.\nThe fever ghost of the *wei* day is named Nu Zhang.\nThe fever ghost of the *shen* day is named Wei.\nThe fever ghost of the *you* day is named Shi.\nThe fever ghost of the *xu* day is named Zhi.\nThe fever ghost of the *hai* day is named You.\n\nThese twelve daily fever ghosts, each governing their respective day, bring illness to people from the twelve earthly branches and heavenly stems. Together with the monthly and daily ghosts and *gu*, they follow Liu Yuan Da and others to poison the five directions. Those who do not follow the Dao’s precepts shall all suffer their misfortune. Those who cultivate goodness, cherish the Dao, and uphold its teachings—if they know these names—shall collectively subdue them. Those who ought to depart shall flee far away; those who must remain shall be restrained from their malevolent factions. They shall bind one another and refrain from harming the virtuous.\n\nThe ghost afflicting the sick at dawn is named Wen Tong.\nThe Metal essence ghost is named Yin Dui.\nThe Wood essence ghost is named Yi Zhen.\nThe Fire essence ghost is named Fu Li.\nThe Water essence ghost is named Tuo Kan.\nThe Earth essence ghost is named Cheng Kun.\nThe Five Essences ghost is named Jiao Qian.\nThe Wandering *Ga* ghost is named Huo Zhang.\nThe Blood-eating ghost is named Ren Fang.\nThe Tiger and Wolf ghost is named Kai Ju.\nThe Serpent and Dragon ghost is named Jia Zi.\nThe Fox and Wildcat ghost is named Gou Ju.\nThe Turtle and Alligator ghost is named Di Yang.\nThe Ghost of those who died in the open is named Tian Yang.\nThe Ghost of those who died from wounds is named Zhen Guo.\nThe Ghost of those who died in prison is named Shi Su Fen.\nThe Ghost of those who died from starvation is named Fu Cang.\nThe Ghost of those who died away from home is named Ni Qian.\nThe Ghost of men who died from harm is named [omitted] Wu Qian.\nThe Ghost of women who died from harm is named Ai Chi Dan.\nThe Grave Litigation ghost is named Hai Zhi.\nThe Mound Officer ghost is named Di Ling.\nThe Tomb Lord ghost is named Tu Xia Hou.\nThe Grave Underling ghost is named Er Qian Shi.\n\nThese twenty-four ghosts roam freely, weaving nets to block the four directions and filling the six harmonies. They manipulate the reckoning of the five phases, appointing and displacing one another. They form ranks in official bureaus, leading processions in and out with armed escorts, wielding power to kill the innocent and indulge their whims. Those lacking fortune shall all encounter their suffering. Those who aspire to the Dao, practicing arts of suppression and exorcism, wielding talismans and incantations to restrain them, shall preserve their good fortune and integrity.\n\nThe Ghost of those beheaded.\nThe Ghost of those who died by accident.\n\nThe Ghost of funeral carriages.\nThe Ghost of □□.\nThe Ghost of heavenly calamities.\nThe Ghost of calamity’s imposition.\nThe Ghost of male and female.\nThe Ghost of borrowed death.\nThe Ghost of traveling strangers.\nThe Ghost of earthly calamities.\nThe Ghost of heavenly misfortune.\nThe Ghost of earthly misfortune.\nThe Ghost of heavenly slaughter.\nThe Ghost of earthly slaughter.\nThe Ghost of the Dark Talisman of Sun and Moon.\nThe Thirty-Six Slaughter Ghosts.\nThe One Hundred Twenty Calamity-Imposing Ghosts.\nThe Thousand-Calamity, Ten-Thousand-Specter Ghosts.\nThe *wangliang* spirits and demonic ghosts.\nThe Deluding and Inauspicious Ghosts.\nThe Fire-Reversing, Evil-Imposing Ghosts.\nThe Way-Reversing, Ugly-Bandit Ghosts.\nThe Great Dao’s Deviant Spirits, the Thousand-*Qi* Ghosts.\nThe One Thousand Two Hundred Officials of Reversed Authority.\nThe Thousand Masters and Ten Thousand Physicians of the Earth.\nThe Heaven-Earth-Water Three Officials’ Reversed and Spectral Ghosts.\nThe Ghosts clinging to ears and horns.\nThe Ghosts who call themselves the August Heavenly Thearch and the Earthly Jade Sovereign.\nThe fox and wildcat old spirits who name themselves.\nThe Ghosts of strong □ and deceitful voices in dwellings.\nThe demonic and terrifying ghosts in dwellings.\nThe ghosts of numinous groves and ancient convulsions in dwellings.\nThe ghosts of strange lights in dwellings.\nThe ghosts of depletion and waste in dwellings.\nThe ghosts of vulgarity, humiliation, separation, and resentment in dwellings.\nThe ghosts of litigation and arrest in dwellings and tombs.\n\nThese thirty-six ghosts all roam the world, seizing upon human weakness and awaiting evil, aiding and abetting misfortune, creating disasters and harm. They dare to alter forms and appearances, bullying people at will. Those who study the Dao, establishing merit and building virtue, may petition the Most High, submitting all for governance. At the year’s beginning, they file memorials, listing names to sever their power. All ghosts fear and tremble, fleeing of their own accord. Those who do not petition shall be bound by this ordinance.\n\n*End of Scroll Six of the Nüqing Ghost Statutes*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "女青鬼律 经名：女青鬼律。 撰人不祥，约出於魏晋南北期。 原本八卷，现存六卷。 底本出处：《正统道藏》洞神部戒律类。 女青鬼律卷之一 律曰：天地初生，元气施行，万神布气，无有丑逆祆邪不正之鬼，男孝女贞，君礼臣忠，六合如一，元有患害。 自后天皇元年以来，转生百巧，不信大 道，五方逆杀，疫气渐兴，虎狼万兽，受气长大，百虫蛇魅，与日滋甚。 天有六十日，日有一神。 神直一日，日有千鬼飞行，不可禁止。 大道不禁，天师不勑，放纵天下，凶凶相逐。 唯任杀中民，死者千亿。 太上大道不忍见之，二年七月七日日中时下此鬼律八卷，纪天下鬼神姓名吉凶之术，以勑天师张道陵，使勑鬼神，不得妄转东西南北。 后有道男女生，见吾秘经，知鬼姓名皆吉，万鬼不干，千神宾伏。 奉行如律，不得妄传非其人，传非其人，灾流七世，勿怨道咎。 师纪姓名谱曰： 高天万丈鬼，百鬼，中皇姓，系天六方鬼之主，住在太山束南角道水中，诸死人所归。 鬼亦上天，对问考罚，月一上。 上古以来，已三万六千余年，如有三万六千神与鬼等数。 南乡三老鬼，俗五道鬼，姓车名匿，主诸死人录籍，考计生人罪，皆向之。 此鬼在太山西北角，亦有官属。 太山有召一还。 此鬼天煞，唯闻文书，上不着天，下不着地。 云中元头坏军死将逆恶大鬼，姓李名三可。 北斗三台招摇大鬼，姓伴名玩。 西斗三台鬼，姓车名球。 南斗三台鬼，姓溟名温夫。 中斗三台鬼，姓王名咸。 束斗三台鬼，姓角名车。 右五斗煞鬼名姓，主煞人。 东方凶神鬼，姓坚名角子。 南方凶神鬼，姓精名玉，又名后竹。 西方凶神鬼，姓天邪名古子。 抑救切 北方凶神鬼，姓王名精。 中央凶神鬼，姓戴名应子。 右五方凶神鬼姓名，主煞人。 五方逆煞注鬼名勖。 五方直符注鬼名结，天考逆煞直符鬼 名天殃，一名越。 天一神长恶子孙鬼，名高睪子。 天一神长伤还子鬼，名谭契子。 天飞行长镮子鬼，名梁扶，一名汝夫。 天信义长鬼子，名太紫元。 右五鬼，三官帝常遣司察人罪。 鬼恒在人问，不可得见。 天云中元名游行鬼，长三万六千丈。 天云中游行鬼，名瑷子，又名憘。 音熙 天云中二十八宿直煞鬼，名域子。 右三鬼，天阴阳鬼，主煞生人。 东方青帝直符鬼，名伯神子，一名果子。 西方白帝直符鬼，名伯和子。 南方赤帝直符鬼，名泰伯子。 北方黑帝直符鬼，名忝衣子。 中央黄帝直符鬼，名伯溪，一名渊。 右五方直符鬼，常煞人六畜，主作光怪死鬼，先人所使。 东方青帝元名煞鬼，姓元名谷玄。 从东方甲乙君使令，以甲乙日、辰日午时煞也 南方赤帝，姓变名乳。 西方白帝，姓名颜。 之豉切 北方黑帝，姓遐名明。 右四方煞鬼，主煞天下逆恶不孝。 北斗主煞一人，上下乌衣，长七千丈， 姓昊名还临子。 斗纲加煞七人，长九丈，赤帻，主煞天下奸邪逆鬼。 太一主煞无形无名鬼，长一丈六尺，赤帻赤衣服，天三五考煞鬼，名慧，长一丈七尺，白衣赤帻，持戟向人。 天帝常司过鬼，姓遐反，名班子，日暝人定时下听人口语，逆知心神，还启考煞。 五岳鬼，名进强。 右北斗等鬼，主煞奸邪，司听语默。 甲子日鬼，名元光。 乙丑日鬼，名邴彰。 邴音丙 丙寅日鬼，名钊昌。",
      "translated_text": "**Nüqing Ghost Statutes**\n\n**Sutra Title:** *Nüqing Ghost Statutes*. Author unknown, approximately dated to the Wei-Jin and Northern and Southern Dynasties period. Originally in eight scrolls, six scrolls remain extant. Base text from *Daoist Canon of the Zhengtong Era*, *Dongshen* Section, Precepts and Statutes category.\n\n**Nüqing Ghost Statutes, Scroll One**\n\nThe Statutes state: When Heaven and Earth first came into being, primordial *qi* flowed forth, and the myriad spirits distributed *qi*. There were no ghosts of ugliness, rebellion, perversity, or evil—no unrighteousness. Sons were filial, daughters chaste; rulers observed propriety, ministers were loyal. The Six Directions were as one, and there was no suffering or harm.\n\nAfter the era of the Heavenly Sovereign Yuan, myriad cunning arose. The Great Dao was not believed in; the Five Directions turned to slaughter, and pestilential *qi* gradually arose. Tigers, wolves, and the ten thousand beasts grew large by receiving *qi*; the hundred insects, snakes, and specters multiplied daily. Heaven has sixty days, and each day has one spirit. The spirit presiding over a day allows a thousand ghosts to fly about, unrestrained. The Great Dao did not forbid it; the Heavenly Master did not command it. Thus, the world was left to chaos, with calamities chasing one another. Only in the midst of slaughter were the common people afflicted, and the dead numbered in the hundreds of millions.\n\nThe Most High Great Dao could not bear to witness this. On the seventh day of the seventh month in the second year, at noon, these *Ghost Statutes* in eight scrolls descended, recording the arts of the names and fortunes of the ghosts and spirits under Heaven. They were commanded to the Heavenly Master Zhang Daoling, ordering him to restrain the ghosts and spirits, preventing them from recklessly moving east, west, south, or north.\n\nIf later generations of Daoist men and women encounter this esoteric scripture and know the names of the ghosts to be auspicious, the ten thousand ghosts will not intrude, and the thousand spirits will submit in reverence. Those who uphold and practice these statutes must not recklessly transmit them to unworthy persons. If transmitted to the unworthy, calamity will flow for seven generations—do not blame the Dao for fault.\n\n**Record of Masters’ Names and Lineages:**\n\nThe ghost of the High Heaven, ten thousand *zhang* tall, is named Hundred Ghosts. The Central Sovereign’s surname is recorded as the lord of the Six Directions’ ghosts, dwelling in the southeast corner of Mount Tai by the waters of the Dao. All the dead gather there. Ghosts also ascend to Heaven to be questioned, examined, and punished—once each month. Since ancient times, over thirty-six thousand years have passed, and there are thirty-six thousand spirits equal in number to the ghosts.\n\nThe Three Elders of the Southern Village, commonly called the Five Paths Ghost, surnamed Che, named Ni, preside over the records of the dead and examine the sins of the living—all are directed to them. This ghost resides in the northwest corner of Mount Tai and also has subordinate officials. When summoned to Mount Tai, it returns once. This ghost is a celestial executioner; it only heeds written documents, neither touching Heaven above nor Earth below.\n\nThe Cloud-Middle Yuan Head, a ghost of ruined armies and treacherous generals, surnamed Li, named Sanko.\n\nThe Northern Dipper Three Terraces Beckoning Ghost, surnamed Ban, named Wan.\n\nThe Western Dipper Three Terraces Ghost, surnamed Che, named Qiu.\n\nThe Southern Dipper Three Terraces Ghost, surnamed Ming, named Wenfu.\n\nThe Central Dipper Three Terraces Ghost, surnamed Wang, named Xian.\n\nThe Eastern Dipper Three Terraces Ghost, surnamed Ting, named Che.\n\nThe names and surnames of the Five Dippers’ executioner ghosts preside over the killing of people.\n\nThe Eastern Direction Malevolent Spirit Ghost, surnamed Jian, named Jiaozi.\n\nThe Southern Direction Malevolent Spirit Ghost, surnamed Jing, named Yu, also named Houzhu.\n\nThe Western Direction Malevolent Spirit Ghost, surnamed Tianxie, named Guzi.\n\nThe Northern Direction Malevolent Spirit Ghost, surnamed Wang, named Jing.\n\nThe Central Direction Malevolent Spirit Ghost, surnamed Dai, named Yingzi.\n\nThe names and surnames of the Five Directions’ malevolent spirit ghosts preside over the killing of people.\n\nThe Five Directions’ Rebellious Executioner Annotated Ghost is named Xu.\n\nThe Five Directions’ Duty Talisman Annotated Ghost is named Jie. The Heavenly Examination Rebellious Executioner Duty Talisman Ghost is named Tianyang, also named Yue.\n\nThe Heavenly One Spirit Chief Malevolent Descendants Ghost is named Gaoyaozi.\n\nThe Heavenly One Spirit Chief Harmful Returning Ghost is named Tanqiezi.\n\nThe Heavenly Flying Executioner Chief Shackle Ghost is named Liangfu, also named Rufu.\n\nThe Heavenly Faithful Chief Ghost is named Taiziyuan.\n\nThe above five ghosts are constantly dispatched by the Three Officials Emperor to investigate human sins. These ghosts constantly dwell among people but cannot be seen.\n\nThe Heavenly Cloud-Middle Yuan Named Wandering Ghost is thirty-six thousand *zhang* tall.\n\nThe Heavenly Cloud-Middle Wandering Ghost is named Aizi, also named Xi.\n\nThe Heavenly Cloud-Middle Twenty-Eight Constellations Duty Executioner Ghost is named Yuzi.\n\nThe above three ghosts are the Yin-Yang ghosts of Heaven, presiding over the killing of the living.\n\nThe Eastern Direction Azure Emperor Duty Talisman Ghost is named Boshenzi, also named Guozi.\n\nThe Western Direction White Emperor Duty Talisman Ghost is named Bohezi.\n\nThe Southern Direction Vermilion Emperor Duty Talisman Ghost is named Taibozi.\n\nThe Northern Direction Black Emperor Duty Talisman Ghost is named Tianyizi.\n\nThe Central Direction Yellow Emperor Duty Talisman Ghost is named Boxi, also named Yuan.\n\nThe Five Directions’ Duty Talisman Ghosts constantly kill people and livestock, presiding over strange deaths and ghostly apparitions, dispatched by ancestors.\n\nThe Eastern Direction Azure Emperor Yuan Named Executioner Ghost, surnamed Yuan, named Guxuan. Commanded by the Eastern Direction Jia-Yi Lords, it kills on Jia-Yi days, Chen days, and at the hour of Wu.\n\nThe Southern Direction Vermilion Emperor, surnamed Bian, named Ru.\n\nThe Western Direction White Emperor, surnamed Zhi, named Yan.\n\nThe Northern Direction Black Emperor, surnamed Xia, named Ming.\n\nThe above Four Directions’ executioner ghosts preside over the killing of the world’s rebellious and unfilial.\n\nThe Northern Dipper presides over the killing of one person: seven thousand *zhang* tall, clad in black above and below, surnamed Hao, named Huanlinzi.\n\nThe Dipper’s Net adds seven executioners, nine *zhang* tall, wearing red headbands, presiding over the killing of the world’s treacherous and rebellious ghosts.\n\nThe Great One presides over the killing of formless and nameless ghosts, one *zhang* and six *chi* tall, wearing red headbands and red robes.\n\nThe Heavenly Three-Five Examination Executioner Ghost is named Hui, one *zhang* and seven *chi* tall, clad in white with a red headband, holding a halberd toward people.\n\nThe Heavenly Emperor’s Constant Transgression-Overseeing Ghost, surnamed Xiafan, named Banzi, descends at dusk during the hour of *Rending* to listen to people’s speech, discerning their hearts and minds, then reports back for examination and execution.\n\nThe Five Marchmounts Ghost is named Jinqiang.\n\nThe above Northern Dipper and other ghosts preside over the killing of the treacherous and rebellious, overseeing speech and silence.\n\nThe Jiazi Day Ghost is named Yuanguang.\n\nThe Yichou Day Ghost is named Bingzhang.\n\nThe Bingyin Day Ghost is named Zhaochang.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1355,
      "start_sentence": 0,
      "end_sentence": 75,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.652642011642456,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\女青鬼律.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "钊音昭 丁卯日鬼，名子方。 戊辰日鬼，名生进。 己巳日鬼，名传弁。 庚午日鬼，名柴方。 辛未日鬼，名音父。 五故切 壬申日鬼，名石松。 癸酉日鬼，名倚。 音落 甲戌日鬼，名甲光。 乙亥日鬼，名进。 遍五官切 丙子日鬼，名留遐。 丁丑日鬼，名王眸。 戊寅日鬼，名却心。 己卯日鬼，名遥子。 庚辰日鬼，名耳子。 辛巳日鬼，名元声。 壬午日鬼，名衔。 癸未日鬼，名历厨。 甲申日鬼，名琊光。 琊以者切 乙酉日鬼，名聂下。 丙戌日鬼，名杂生。 狼董切 丁亥日鬼，名石。 之蛇切 戊子日鬼，名证方。 己丑日鬼，名旨都。 庚寅日鬼，名苓。 音琴 辛卯日鬼，名。 扶北切。 一音馥，一音卜。 壬辰日鬼，名契， 癸巳日鬼，名辈方。 甲午日鬼，名麻子角。 乙未日鬼，名不扶响。 丙申日鬼，名右公。 丁酉日鬼，名进卿一集。 戊戌日鬼，名召厹高。 己亥日鬼，名珠夫子。 庚子日鬼，名季方。 辛丑日鬼，名。 以是切 壬寅日鬼，名罗结。 癸卯日鬼，名健木。 甲辰日鬼，名索良。 乙巳日鬼，名畾元。 丙午日鬼，名挺浓。 奴道切 丁未日鬼，名矣伍。 戊申日鬼，名却。 巳酉日鬼，名戴劫。 庚戌日鬼，名总夫。 辛亥日鬼，名安悬。 壬子日鬼，名道子。 癸丑日鬼，名唱适。 甲寅日鬼，名别状。 乙卯日鬼，名天暗。 丙辰日鬼，名天。 他计切 丁巳日鬼，名天横。 戊午日鬼，名耳。 音奔。 己未日鬼，名恶恶。 庚申日鬼，名义俚。 辛酉日鬼，名义呼。 壬戌日鬼，名道夫。 音权 癸亥日鬼，名答高敌。 右甲子六十日直煞逆鬼六十人，人身元异，赤毛元衣，有耳元目，飞行千里，其身三。 凶逆不孝，煞害天民。 人随日忆知其名，鬼不敢近人。 甲子十日一旬，凶神姓玄名玉衡。 甲戌十日一旬，凶神姓恒名捧。 甲申十日一旬，凶神姓既名。 音盈 甲午十日一旬，凶神姓本名满。 甲辰十日一旬，凶神姓恒名坚子。 甲寅十日一旬，凶神姓苏名造。 右六甲神逆恶主煞神君。 人生於世，元百年之生，朝不保暮，死多生少。 逆煞之鬼，流布人间，诳作百病。 五逆疾炁，寒热头痛，或腹内结坚，吐逆短炁，五内胀满，目视颠倒，口唵手足脔缩，不自知虑，命在日夕，凶鬼来守。 天下男女，汝曹自可按吾图书视鬼等名，施吾太玄之下符，上三天生炁，三五七九之生，以与天民，天民死而更生。 自见天下男女，从太始以来鬼黠，不信吾真，故隐秘斯经，而死者不可肚数。 念之伤悼，今重下律令，天下鬼神姓名、衣服、彩色、长短。 知律，至正一之炁，子可随日名，万鬼不敢干。 子自不知，言吾元神，上怨大道，下咎於人。 子反自中伤，可慎三五之年，子自当见天下不信真炁者，及笑还与鬼私通。 念子自当分别，今日何可得生，子自三思，勿违犯，慎之。 律曰：天道以鬼助神施炁，人畏鬼，不畏神，诡托名於彼，自号其位。 人闻鬼存元神，百其语言，故制阴阳，清身和心，元有邪淫，可以制鬼。 御天下三万六千余神，皆为子使，令子身不正，反受其殃，念子昌乎。 北斗主煞，南斗注生，煞是天纲，生是三台，自如人身，上应天地，法之日月，道在不远，三五来返，超然其可贵也。 天下散民中有孝顺忠信者，可书六十日鬼名，着乌囊贮之，常以正月一日日中时以身诣师家受之，系着左右臂，以此行来，鬼不敢干。",
      "translated_text": "The pronunciation of *Zhao* is *Zhao*. The Dingmao Day Ghost is named Zifang. The Wuchen Day Ghost is named Shengjin. The Jisi Day Ghost is named Chuanbian. The Gengwu Day Ghost is named Chaifang. The Xinwei Day Ghost is named Yin Fu. *Wu gu* cut. The Renshen Day Ghost is named Shisong. The Guiyou Day Ghost is named Yiluo. The pronunciation of *luo* is *luo*. The Jiaxu Day Ghost is named Jiaguang. The Yihai Day Ghost is named Bianjin. *Bian wu guan* cut. The Bingzi Day Ghost is named Liuxia. The Dingchou Day Ghost is named Wangmou. The Wuyin Day Ghost is named Quexin. The Jimao Day Ghost is named Yaozi. The Gengchen Day Ghost is named Erzi. The Xinsi Day Ghost is named Yuansheng. The Renwu Day Ghost is named Xian. The Guiwei Day Ghost is named Lichu. The Jiashen Day Ghost is named Yaguang. The pronunciation of *ya* is *yizhe*. The Yiyou Day Ghost is named Niexia. The Bingxu Day Ghost is named Zasheng. *Lang dong* cut. The Dinghai Day Ghost is named Shishe. *Zhi she* cut. The Wuzi Day Ghost is named Zhengfang. The Jichou Day Ghost is named Zhidu. The Gengyin Day Ghost is named Ling. The pronunciation of *ling* is *qin*. The Xinmao Day Ghost is named Fu. *Fu bei* cut. One pronunciation is *fu*, another is *bu*. The Renchen Day Ghost is named Qi. The Guisi Day Ghost is named Beifang. The Jiawu Day Ghost is named Mazijiao. The Yiwei Day Ghost is named Bufuxiang. The Bingshen Day Ghost is named Yougong. The Dingyou Day Ghost is named Jinqing Yiji. The Wuxu Day Ghost is named Zhao Taogao. The Jihai Day Ghost is named Zhu Fuzi. The Gengzi Day Ghost is named Jifang. The Xinchou Day Ghost is named Yi. *Yi shi* cut. The Renyin Day Ghost is named Luojie. The Guimao Day Ghost is named Jianmu. The Jiachen Day Ghost is named Suoliang. The Yisi Day Ghost is named Leiyuan. The Bingwu Day Ghost is named Tingnong. *Nu dao* cut. The Dingwei Day Ghost is named Yiwu. The Wushen Day Ghost is named Quehui. The Jiyou Day Ghost is named Daijie. The Gengxu Day Ghost is named Zongfu. The Xinhai Day Ghost is named Anxuan. The Renzi Day Ghost is named Daozi. The Guichou Day Ghost is named Changshi. The Jiayin Day Ghost is named Biezhuang. The Yimao Day Ghost is named Tian’an. The Bingchen Day Ghost is named Tianji. The pronunciation of *ji* is *ta ji*. The Dingsi Day Ghost is named Tianheng. The Wuwu Day Ghost is named Erben. The pronunciation of *ben* is *ben*. The Jiwei Day Ghost is named E’e. The Gengshen Day Ghost is named Yili. The Xinyou Day Ghost is named Yihu. The Renxu Day Ghost is named Daofu. The pronunciation of *quan* is *quan*. The Guihai Day Ghost is named Dagao Di.\n\nThe above sixty ghosts of the sixty Jiazi days, each with distinct forms, red hair and black garments, ears but no eyes, fly a thousand *li*, their bodies threefold. They slay the treacherous and unfilial, harming the people of heaven. If one recalls their names according to the day, the ghosts dare not approach.\n\nEvery ten days of Jiazi form a *xun*: the inauspicious spirit of the Jiazi *xun* is surnamed Xuan, named Yuheng. The Jiaxu *xun*’s inauspicious spirit is surnamed He, named Peng. The Jiashen *xun*’s inauspicious spirit is surnamed Ji, named Ying. The pronunciation of *ying* is *ying*. The Jiawu *xun*’s inauspicious spirit is surnamed Ben, named Man. The Jiachen *xun*’s inauspicious spirit is surnamed He, named Jianzi. The Jiayin *xun*’s inauspicious spirit is surnamed Su, named Zao.\n\nThe above six Jia spirits are the inauspicious and malevolent lords of killing. People born into the world are not granted a hundred years of life; morning does not guarantee evening, and death outnumbers life. The treacherous killing ghosts pervade the human realm, deceitfully manifesting as myriad illnesses. The five rebellious *qi* cause chills and fever, headaches, or abdominal masses, vomiting, shortness of breath, distension of the five viscera, inverted vision, locked jaw, contracted limbs, and loss of self-awareness, with life hanging by a thread as the malevolent ghosts draw near.\n\nMen and women under heaven, you may consult my charts to know the names of these ghosts, then apply my talisman of the Great Mystery, invoking the generative *qi* of the Three Heavens, the life of the three, five, seven, and nine, to bestow upon the people of heaven—so that those who die may live again. Since the Great Beginning, I have witnessed men and women deceived by cunning ghosts, disbelieving in my truth, and thus I concealed this scripture, for the dead are beyond count. Grieving for them, I now reissue these statutes and commands, revealing the names, garments, colors, and heights of the ghosts and spirits under heaven. Know the statutes, align with the *qi* of the Orthodox Unity, and by recalling the names of the day, ten thousand ghosts will not dare to interfere. If you remain ignorant, claiming no spirit within, you will incur the resentment of the Great Dao above and blame from others below. You will harm yourself; be cautious in the years of the Three-Five. You will see those under heaven who disbelieve in the true *qi* and mock it, even consorting with ghosts. Reflect and discern: how can you hope to live today? Think thrice, do not transgress, and be vigilant.\n\nThe statutes say: The Dao of Heaven employs ghosts to assist the spirits in deploying *qi*. People fear ghosts but not spirits, so ghosts falsely assume their names and titles. Hearing that ghosts possess primordial spirit, people heed their words a hundredfold. Thus, the regulation of yin and yang, the purification of body and mind, and the absence of depravity can restrain ghosts. The thirty-six thousand and more spirits under heaven are all at your command. If your person is not upright, you will suffer their calamities—consider whether you prosper.\n\nThe Northern Dipper governs killing, the Southern Dipper bestows life. Killing is the heavenly net, life is the Three Terraces. As with the human body, above it corresponds to heaven and earth, modeled on the sun and moon. The Dao is not distant; the Three-Five returns in cycles—how precious this is! Among the scattered people under heaven, those who are filial, loyal, and trustworthy may inscribe the names of the sixty-day ghosts, place them in a black pouch, and on the first day of the first month at noon, personally visit a master’s abode to receive them. Fasten the pouch to your left or right arm, and as you come and go, ghosts will not dare to interfere.",
      "overlap_context": "t, surnamed Xiafan, named Banzi, descends at dusk during the hour of *Rending* to listen to people’s speech, discerning their hearts and minds, then reports back for examination and execution.\n\nThe Five Marchmounts Ghost is named Jinqiang.\n\nThe above Northern Dipper and other ghosts preside over the killing of the treacherous and rebellious, overseeing speech and silence.\n\nThe Jiazi Day Ghost is named Yuanguang.\n\nThe Yichou Day Ghost is named Bingzhang.\n\nThe Bingyin Day Ghost is named Zhaochang.",
      "start_char": 1355,
      "end_char": 2797,
      "start_sentence": 76,
      "end_sentence": 173,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.58004069328308,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\女青鬼律.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "天下太平，送还本治。 夜行恐逢恶，可服其鬼名，鬼不敢当，人不知鬼神自治，空身受灾，不达义方，通三六之年，子自灭亡。 女青鬼律卷之一竟 洞神部戒律类 女青鬼律 经名：女青鬼律。 撰人不祥，约出於魏晋南北期。 原本八卷，现存六卷。 底本出处：《正统道藏》洞神部戒律类。 女青鬼律卷之二 太清玄元上三天太上律勑天地水三官主者，皇天初生，唯神为尊。 今世愦愦，邪乱纷纷，不见真神，唯鬼乱人。 今当纪别鬼名，定立三五神以治鬼。 重下第二卷山海鬼姓名，服之三年，万鬼不敢当。 行来出入，制御邪魅。 道曰：千年之木成人，百岁之石为僮女，百兽之形皆有鬼形。 子知其名，鬼复真形，勿传。 山精之鬼长一尺，名濯肉。 木精之鬼，名群夭。 乌老切。 一名式 石精之鬼，名肉子。 环於巾切 虎精之鬼，名健庄子。 蛇精之鬼，名石圭。 音戚 狩精之鬼，名大皛子。 何乌切 猴精之鬼，名马痢子。 侧毫切 狐精之鬼，名迨午。 音代 树之鬼，名连不智。 各勿切 五垮之鬼，名截逍子。 洿音乌 大山之鬼，名弓强。 小山之鬼，名和邴。 大树之鬼，名方域。 小木之鬼，名转其。 山室之鬼，名启削。 石舀之鬼，名水连。 舀口感切 土志之鬼，名客臾。 音至 博石之鬼，名月遡。 音诉 榕木之鬼，名汝远。 槫徒砖切 木榴之鬼，名呜□。 音震 百虫之鬼，名遐。 莫号切 空流之鬼，名活。 音朱 江之鬼，名逆鳞子。 孙容切 漠明之鬼，名咸□。 昌利之鬼，名堪坋。 音坟 山都之鬼，名天王。 盖山之鬼，名柱佳乩。 古兮切 五色之鬼，名后向。 太玄之鬼，名居集。 男淫之鬼，名戴文。 女淫之鬼，名截交。 青熙温鬼，名高远。 白炁温鬼，名伯桑。 赤炁温鬼，名士玄。 黄炁温鬼，名君太。 黑炁温鬼，名文遐。 屋室之鬼，名摇子。 食器之鬼，名后服。 圊厕之鬼，名项天。 井鬼，名琼。 灶鬼，名干远。 床鬼，名赫子一扶。 伞盖鬼，名晏。 麾幢鬼，名托。 鼓音鬼，名乱。 笙篁鬼，名。 坩坑鬼，名父雉。 一名罗元。 圩莒鬼，名赫子。 一名入征。 圩音区 戟之鬼，名耳禽。 音棚 刀鬼，名剑子夫。 甲铠之鬼，名子贤。 元子车鬼，名如贤子又马车牛之鬼 千岁白骨鬼，名远世。 百岁白骨鬼，名音世。 五十年鬼，名。 音忠音绛 天岳鬼，名瑾生子。 天鞭鬼，名客夫元。 地青土公鬼，名元。 地赤土公鬼，名赤赫元。 地黄土公鬼，名克元。 地白土公鬼，名述本。 地黑土公鬼，名士民。 河伯鬼，名达。 九江鬼，名活。 三河鬼，名建。 四渎鬼，名候。 犬马鬼，名赐。 车鬼，名恸。 朴榬之鬼，名天赐。 一名兵车。 铁精之鬼，名医愿。 金精之鬼，名夷冲。 铜器鬼，名扬煞。 五岳之鬼，名耳。 一名山夫。 乱之鬼，名趣。 一名叹发。 柱木之鬼，名文罗，一名元罗 五斧之鬼，名兀生。 长男之鬼，名。 一名子石。 衣服之鬼，名是。 苦颊切 五彩之鬼，名提敬。 五味之鬼，名元。 侧巾切 律曰：天下一生之中，自有千亿之鬼，去神更远，去鬼而近。 天下凶凶，不可得知。 此遭凶遇死者千万有人，而鬼不已。 今记其真名，使人知之。 一知鬼名，邪不敢前，三呼其鬼名，鬼炁即绝，天鬼来下，、地鬼并煞。 凡鬼皆有姓名，子知三台鬼名，万鬼使令。",
      "translated_text": "Under heaven at peace, return them to their original governance. When traveling by night and fearing encounter with evil, you may recite their ghostly names—ghosts will not dare confront you. People remain unaware that ghosts and spirits govern themselves; those who go about unprotected suffer calamity, failing to grasp the proper way. Through the cycles of three and six years, you will perish of your own accord.\n\n*End of Scroll One of the Nüqing Guilu*\n*Dongshen Section, Precepts and Disciplines*\n\n**Nüqing Guilu**\n*Scripture Title: Nüqing Guilu*\n*Author unknown, roughly dated to the Wei-Jin and Northern and Southern Dynasties period. Originally eight scrolls, six survive.*\n*Source text: Zhengtong Daoist Canon, Dongshen Section, Precepts and Disciplines*\n\n**Nüqing Guilu, Scroll Two**\n\nThe Supreme Laws of the Three Heavens of Great Clarity and Primordial Origin now command the Three Officials of Heaven, Earth, and Water: when heaven first came into being, only the divine was revered. In this benighted age, chaos and perversion abound; true spirits are unseen, and only ghosts confound humankind. Now we shall record the names of ghosts and establish the Three-Five spirits to govern them.\n\nHerein are set forth the names of mountain and sea ghosts from the second scroll. Wear them for three years, and ten thousand ghosts will not dare confront you. As you come and go, you will master and subdue demonic forces.\n\nThe Dao says: a thousand-year-old tree becomes human; a hundred-year-old stone turns into a maiden; the forms of all beasts harbor ghostly shapes. Know their names, and ghosts revert to their true forms—do not transmit them.\n\nThe mountain sprite’s ghost stands a foot tall, named Zhuorou.\nThe tree sprite’s ghost is named Qunyao. (Also called *Shi*.)\nThe stone sprite’s ghost is named *Yinrouzi*.\nThe tiger sprite’s ghost is named Jianzhuangzi.\nThe snake sprite’s ghost is named *Qishigui*.\nThe beast sprite’s ghost is named Daxiaozi.\nThe monkey sprite’s ghost is named Maliizi.\nThe fox sprite’s ghost is named Daiwu.\nThe *wu* tree’s ghost is named Lianbuzhi.\nThe Five Peaks’ ghost is named Jiexiaozi.\nThe great mountain’s ghost is named Gongqiang.\nThe small mountain’s ghost is named Hebing.\nThe great tree’s ghost is named Fangyu.\nThe small tree’s ghost is named Zhuanqi.\nThe mountain chamber’s ghost is named Qixue.\nThe stone hollow’s ghost is named Shuilian.\nThe earth spirit’s ghost is named Keyu.\nThe spreading stone’s ghost is named Yuesu.\nThe banyan’s ghost is named Ruyuan.\nThe pomegranate’s ghost is named Wu□. (Pronounced *zhen*.)\nThe hundred insects’ ghost is named Xia□.\nThe empty stream’s ghost is named Huo□. (Pronounced *zhu*.)\nThe river’s ghost is named Nilinzi.\nThe desert’s ghost is named Xian□.\nThe fertile land’s ghost is named Kanfen.\nThe Shandu’s ghost is named Tianwang.\nThe mountain-covering ghost is named Zhujiaji.\nThe five-colored ghost is named Houxiang.\nThe Great Mystery’s ghost is named Jiji.\nThe male lecher’s ghost is named Daiwen.\nThe female lecher’s ghost is named Jiejiao.\nThe green *qi* fever ghost is named Gaoyuan.\nThe white *qi* fever ghost is named Bosang.\nThe red *qi* fever ghost is named Shixuan.\nThe yellow *qi* fever ghost is named Juntai.\nThe black *qi* fever ghost is named Wenxia.\nThe household’s ghost is named Yaozi.\nThe dining vessel’s ghost is named Houfu.\nThe latrine’s ghost is named Xiangtian.\nThe well ghost is named Qiong.\nThe stove ghost is named Ganyuan.\nThe bed ghost is named Heziyifu.\nThe parasol’s ghost is named Yan.\nThe banner’s ghost is named Tuo.\nThe drum’s ghost is named Luan.\nThe reed pipe’s ghost is named □.\nThe pit’s ghost is named Fuzhi. (Also called Luoyuan.)\nThe embankment’s ghost is named Hezi. (Also called Ruzheng.)\nThe halberd’s ghost is named Erqin.\nThe sword’s ghost is named Jianzifu.\nThe armor’s ghost is named Zixian.\nThe chariot’s ghost is named Ru Xianzi. (Also the ox-cart’s ghost.)\nThe thousand-year-old white bone’s ghost is named Yuanshi.\nThe hundred-year-old white bone’s ghost is named Yinshi.\nThe fifty-year-old ghost is named □□.\nThe celestial peak’s ghost is named Jinshengzi.\nThe heavenly whip’s ghost is named Kefuyuan.\nThe Green Earth Lord’s ghost is named Yuan.\nThe Red Earth Lord’s ghost is named Chihe Yuan.\nThe Yellow Earth Lord’s ghost is named Keyuan.\nThe White Earth Lord’s ghost is named Shuben.\nThe Black Earth Lord’s ghost is named Shimin.\nThe River Earl’s ghost is named Da.\nThe Nine Rivers’ ghost is named Huo.\nThe Three Rivers’ ghost is named Jian.\nThe Four Waterways’ ghost is named Hou.\nThe dog and horse’s ghost is named Ci.\nThe chariot’s ghost is named Tong.\nThe *puyuan* tree’s ghost is named Tiansi. (Also called the war chariot.)\nThe iron sprite’s ghost is named Yiyuan.\nThe metal sprite’s ghost is named Yichong.\nThe bronze vessel’s ghost is named Yangsha.\nThe Five Peaks’ ghost is named Er□. (Also called the mountain man.)\nThe chaos ghost is named Qu. (Also called Tanfa.)\nThe pillar’s ghost is named Wenluo. (Also called Yuanluo.)\nThe five axes’ ghost is named Wusheng.\nThe eldest son’s ghost is named □. (Also called Zishi.)\nThe clothing’s ghost is named Shi□.\nThe five colors’ ghost is named Tijing.\nThe five flavors’ ghost is named Yuan□.\n\nThe statutes say: in a single lifetime under heaven, there are a thousand myriad ghosts—ever more distant from the divine, ever closer to the demonic. Under heaven’s turmoil, they cannot be known. Those who suffer misfortune and meet death number in the thousands and tens of thousands, yet the ghosts do not cease. Now their true names are recorded so that people may know them. Once you know a ghost’s name, evil will not dare approach. Call its name thrice, and the ghost’s *qi* is severed; heavenly ghosts descend, earthly ghosts are slain together. All ghosts have names—know the names of the Three Terraces’ ghosts, and the ten thousand ghosts will be at your command.",
      "overlap_context": "ponds to heaven and earth, modeled on the sun and moon. The Dao is not distant; the Three-Five returns in cycles—how precious this is! Among the scattered people under heaven, those who are filial, loyal, and trustworthy may inscribe the names of the sixty-day ghosts, place them in a black pouch, and on the first day of the first month at noon, personally visit a master’s abode to receive them. Fasten the pouch to your left or right arm, and as you come and go, ghosts will not dare to interfere.",
      "start_char": 2797,
      "end_char": 4280,
      "start_sentence": 174,
      "end_sentence": 306,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.907114028930664,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\女青鬼律.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "律曰：人身有疾病厄急，可令主者施符呼名鬼煞名，用制鬼法。 人家有灾疾不止，可於中庭北向以符着日辰上，使左手揲天关，右手揲火行三咒言：天一女青煞鬼，万千太一九炁收邪神鬼，死神至道，求无极叱叱。 便右回转向天门，闭炁二十四通。 通息，还向地户三咒言：太一使我煞万鬼，鬼去神至。 急急如此三通，百魅立到前后，诸神扶送天纲，催切诸鬼相考，无有漏脱。 可以治身，勿妄以示俗人。 太和之鬼，无身有头，头长三尺，目大三寸，耳广七寸，眉广五寸，口广三寸，鼻大二寸，须长三尺，发长一丈，呼吸天炁，吐之成云。 子行见者其名子碑，三呼之，形自见，终鬼从者皆自伏。 子行勿以金钱着身，其有光炁，鬼逆见之避人。 有钱在身不可，鬼知子解藏之。 若水行见者，呼河纷，其亦作水鬼，易形为乌形，明如乌大。 子煞之，勿告人。 三年人行来，出入山海，永无所畏，大吉。 女青鬼律卷之二竟 制作单位 道教学术资讯网站",
      "translated_text": "The statutes say: When the human body suffers illness, distress, or urgent calamity, the master may employ talismans to summon the names of ghost-slaying spirits and apply the method of subduing ghosts. If a household’s misfortunes and ailments persist, place a talisman facing north in the central courtyard upon the day’s celestial stem, grasp the Celestial Pass with the left hand and the Fire Phase with the right, and recite the incantation thrice: *\"Heavenly One, Lady Green, slay the ghost—ten thousand thousand, Great One, Nine Qi, seize the demonic spirits and ghosts. Death spirits, Perfect Dao, seek the boundless—chichichi!\"* Then turn right toward the Heavenly Gate and hold the breath for twenty-four cycles. Upon resuming breath, face the Earthly Portal and recite thrice: *\"Great One commands me to slay the myriad ghosts—ghosts depart, spirits arrive!\"* Perform this urgently three times, and the hundred demons will instantly appear before and behind you. The gods will escort the celestial net, hastening the interrogation of all ghosts, leaving none to escape. This may be used to heal the body, but do not recklessly show it to the uninitiated.\n\nThe ghost of Great Harmony has no body but possesses a head. Its head is three feet long, its eyes three inches wide, its ears seven inches broad, its brows five inches wide, its mouth three inches across, its nose two inches large, its beard three feet long, and its hair ten feet long. It inhales the *qi* of heaven and exhales it as clouds. If you encounter it while traveling, its name is Zibei—call it thrice, and its form will manifest, and all accompanying ghosts will submit. When traveling, do not carry gold or coins on your person, for their radiant *qi* will cause ghosts to flee upon seeing them. If coins are on you, ghosts will know you understand their concealment. Should you encounter one while traveling by water, call out Hefen, for it is also a water ghost, capable of transforming into the shape of a crow, bright as a raven. Slay it, but tell no one. After three years of such practice, you may traverse mountains and seas without fear—greatly auspicious.\n\n*End of Scroll Two of the Nüqing Ghost Statutes*\nProduced by the Daoist Academic Information Network",
      "overlap_context": " they cannot be known. Those who suffer misfortune and meet death number in the thousands and tens of thousands, yet the ghosts do not cease. Now their true names are recorded so that people may know them. Once you know a ghost’s name, evil will not dare approach. Call its name thrice, and the ghost’s *qi* is severed; heavenly ghosts descend, earthly ghosts are slain together. All ghosts have names—know the names of the Three Terraces’ ghosts, and the ten thousand ghosts will be at your command.",
      "start_char": 4281,
      "end_char": 4667,
      "start_sentence": 307,
      "end_sentence": 321,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.413791179656982,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\女青鬼律.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "制作 洪百坚 资料来源 正统道藏 赞助人 女青鬼律卷之三 道律禁忌 天师曰：视天下男女，日用不忠，行善不报，灾害日兴。 天考鬼贼，五毒流行，皆生於不信不念。 守一行善，身招其祸，念子不得久世长生。 吾受太上教勑严切，令以示天民，令知禁忌，不犯鬼神灵书《女青玄都鬼律》。 令使汝曹，皆悉知闻，逆者还顺，恶者还善，改往修来，当依鬼律令。 一者，不得自东自西，自南自北，出入去来，去无所关，还无所白，任意从心，皆负律令，除算三十二。 二者，不得呼天无神，言道师旨，败刑乱政，自言己是道人，言非皆负鬼律，天夺算一十三。 三者，不得持真入伪，奸乱圣明，饮酒食肉，呼嗟无道，夺算千三百。 四者，不得传宣恶语，道说他人，妄作一法，不信天道，虚言元实，天夺算千二百。 五者，不得传虚两舌妄语，喜怒无常，专行逆煞，不慎阴阳，天夺算百三十二。 六者，不得轻慢老人，骂詈亲戚，夫妻咒诅，自相煞害，毒心造凶，不孝五逆，天夺算一百八十。 七者，不得受道不知轻慢，传非其人，贪财受利，取人自益，借物不还，以为私宝，天夺算一千八百。 八者，不得斗争言语，因醉淫色，假托大道，妄言鬼语，要结男女，饮酒食寅，天夺算三百。 九者，不得游行东西，周合男女，消灾不解，因成邪乱，天夺算万三千，死殃流七世。 十者，不得传道童女，因入生门，伤神犯气，逆恶无道，身死无后：不得反男为女，阴阳倒错，天夺算三百。 十一者，不得露合阴阳，触犯三光，因酒往还，承威相接，天夺三百。 十二者，不得一人气生，一人气死，逼犯真人，天夺算三十三。 十三者，不得一父子别居，室家离散，天夺算二十二。 十四者，不得嗜欲恶失，男女聚集，妄道邪言，天夺算百二十。 十五者，不得同法相，更相道说，不信三五，评论天气长短，天夺算八百二十三。 十六者，不得逃遁父母，游行四方，位立真气，自相收合，天夺算三百二十。 十七者，不得灭天所生，妄煞走兽，弹射飞乌，指南作北，任心所从，不依鬼律，天夺算三千。 十八者，不得干知人事，宣布他家，藏善出恶，奸人妇女，谋图人壻，逆戾三光，阴贼咒诅，不孝五逆，天夺算千二百二十。 十九者，不得行道之日，贪色淫心，行气有长，自解不已，私共约誓，因生不孝，奸心五内，无道之子，天夺算三万。 二十者，不得思神不报，因行生气，取降元炁，贪淫爱色，手足不离，弥日竟夕，如此无道，天夺算三百四十二。 二十一者，不得以赤炁妄传俗人，口手胸心，更相交接，委道自叛，师主无法，天夺算三百。 二十二者，不得妄以经书授与俗人，道父母名讳，泄漏真要诀语俗人，天夺算三百。 天师曰：吾受太上旨教，禁忌甚重，汝男女愦愦生来，至今不知禁制，自作一法，与天相违。 考至主者，天夺子算讫，恐将可痛，不见太平。 生者及祭酒道士，宣化有功，功过相赎，民若不用，故有宣化之心，可自改往修来，专一养性，可度天三灾九厄。 子唯行恶逆，不行忠孝，恐子年命不自保，念子可伤，幸复重嘱丁宁甚也。 天师曰：天下男女，见善戒之文，不能从用，唯欲从其所欲，教人行非，走作口舌，专作鬼教。",
      "translated_text": "Produced by Hong Baijian\nSource: *Zhengtong Daoist Canon*\nSponsor: *Scroll Three of the Nüqing Ghost Statutes*\n**Daoist Precepts and Prohibitions**\n\nThe Heavenly Master declares: Behold the men and women of the world—daily they act without loyalty, and though they perform good deeds, no reward comes. Disasters and calamities arise day by day. Heaven examines the ghostly thieves, and the Five Poisons spread unchecked, all born of disbelief and neglect. Those who guard the One and practice virtue bring misfortune upon themselves; you shall not attain long life in this world. I have received the stern command of the Most High to reveal this to the people of heaven, that they may know the prohibitions and not transgress the divine statutes of the *Nüqing Xuan Du Ghost Statutes*. Let all of you hear and understand: the rebellious shall return to obedience, the wicked to goodness. Reform the past and cultivate the future—abide by these ghostly statutes.\n\n1. You shall not, whether going east or west, south or north, depart or return without reporting your going or announcing your return, following your own will without restraint. All such acts violate the statutes, and thirty-two years shall be deducted from your lifespan.\n\n2. You shall not invoke heaven as though it were godless, nor speak of the Daoist master’s decrees to disrupt governance and sow disorder. To claim yourself a Daoist while speaking falsehoods violates the ghostly statutes, and thirteen years shall be deducted from your lifespan by heaven.\n\n3. You shall not mingle truth with falsehood, nor disrupt the sagely and enlightened with lewdness. You shall not drink wine, eat meat, or rail against the Dao, lest one thousand three hundred years be deducted from your lifespan.\n\n4. You shall not spread malicious words, slander others, or fabricate teachings without faith in the heavenly Dao. To speak emptily of what is without substance shall cost you one thousand two hundred years of your lifespan.\n\n5. You shall not engage in duplicity, falsehood, or capricious anger, nor persist in rebellion and slaughter without heeding the balance of yin and yang. Heaven shall deduct one hundred thirty-two years from your lifespan.\n\n6. You shall not disrespect the elderly, curse your kin, or invoke curses between husband and wife, nor harm one another with venomous intent. To commit the Five Iniquities of unfilial conduct shall cost you one hundred eighty years of your lifespan.\n\n7. You shall not, upon receiving the Dao, act with disdain, nor transmit it to the unworthy. You shall not covet wealth or profit at others’ expense, nor borrow without repayment, treating others’ possessions as your own. Heaven shall deduct one thousand eight hundred years from your lifespan.\n\n8. You shall not engage in quarrelsome speech, nor indulge in drunkenness and lust under the pretext of the Great Dao. You shall not utter ghostly words to entangle men and women, nor drink wine or eat meat during the hours of yin. Three hundred years shall be deducted from your lifespan.\n\n9. You shall not wander east and west, entangling men and women, nor fail to resolve calamities, thereby fostering perverse disorder. Heaven shall deduct thirteen thousand years from your lifespan, and the misfortune shall flow through seven generations.\n\n10. You shall not transmit the Dao to maidens, nor enter the Gate of Life to harm the spirit and violate *qi*. To act with perverse wickedness shall bring death without descendants. You shall not reverse male and female, inverting yin and yang, lest three hundred years be deducted from your lifespan.\n\n11. You shall not expose the union of yin and yang, offending the Three Luminaries. To engage in such acts under the influence of wine, yielding to lustful contact, shall cost you three hundred years of your lifespan.\n\n12. You shall not cause one’s *qi* to live while another’s *qi* dies, nor coerce a Perfected One. Heaven shall deduct thirty-three years from your lifespan.\n\n13. You shall not cause father and son to dwell apart, nor scatter the household. Heaven shall deduct twenty-two years from your lifespan.\n\n14. You shall not indulge in excessive desires and depravity, nor gather men and women to spread perverse and heretical words. Heaven shall deduct one hundred twenty years from your lifespan.\n\n15. You shall not, among those of the same teaching, slander one another, nor speak of the Dao without faith in the Three and Five. To debate the length of heaven’s *qi* shall cost you eight hundred twenty-three years of your lifespan.\n\n16. You shall not flee from your parents to wander the four directions, nor stand in the position of true *qi* to gather and unite with others. Heaven shall deduct three hundred twenty years from your lifespan.\n\n17. You shall not destroy what heaven has begotten, nor recklessly slay beasts, shoot flying birds, or reverse south and north, following your own will without adhering to the ghostly statutes. Heaven shall deduct three thousand years from your lifespan.\n\n18. You shall not pry into others’ affairs, nor expose the secrets of households. You shall not conceal goodness and reveal evil, nor seduce others’ wives or scheme against their husbands. To rebel against the Three Luminaries, secretly harm others, or invoke curses—committing the Five Iniquities of unfilial conduct—shall cost you one thousand two hundred twenty years of your lifespan.\n\n19. On the day you practice the Dao, you shall not indulge in lustful thoughts. Though your *qi* may grow long, you shall not indulge yourself, nor make private vows, thereby fostering unfilial conduct. With a heart of perversity and no Dao within, you are a child without the Way. Heaven shall deduct thirty thousand years from your lifespan.\n\n20. You shall not, while contemplating the spirits, fail to receive their response, nor generate *qi* through practice only to draw down primordial *qi* for lustful indulgence. To cling to desire and love of form, never parting hand from foot, day and night without cease—such is the way of the faithless. Heaven shall deduct three hundred forty-two years from your lifespan.\n\n21. You shall not recklessly transmit the Red *Qi* to the uninitiated, nor engage in contact of mouth, hand, chest, or heart. To forsake the Dao and betray your master, leaving the teaching without method, shall cost you three hundred years of your lifespan.\n\n22. You shall not recklessly transmit scriptures to the uninitiated, nor reveal the names and taboos of Daoist parents, nor leak essential secrets to the profane. Heaven shall deduct three hundred years from your lifespan.\n\nThe Heavenly Master declares: I have received the command of the Most High, and the prohibitions are most severe. Yet you, men and women, have lived in confusion from birth to this day, unaware of the restrictions, creating your own teachings in defiance of heaven. When the Examiner arrives, heaven shall deduct your allotted years, and you shall know bitter sorrow, never beholding the Great Peace.\n\nThose who live as libationers and Daoist priests, spreading transformation with merit, may redeem transgressions through their deeds. If the people do not heed this, yet you possess the heart to spread transformation, you may reform the past and cultivate the future, focusing solely on nurturing your nature. Thus, you may transcend the Three Calamities and Nine Tribulations of heaven.\n\nYou, who persist in evil and rebellion, forsaking loyalty and filial piety—fear for your years and life, which you cannot preserve. I grieve for you, and thus I earnestly exhort you again and again.\n\nThe Heavenly Master declares: Men and women of the world, upon seeing these admonitions of goodness, fail to follow them, instead pursuing their own desires. They teach others to act wrongly, engaging in slander and spreading the teachings of ghosts.",
      "overlap_context": "sts to flee upon seeing them. If coins are on you, ghosts will know you understand their concealment. Should you encounter one while traveling by water, call out Hefen, for it is also a water ghost, capable of transforming into the shape of a crow, bright as a raven. Slay it, but tell no one. After three years of such practice, you may traverse mountains and seas without fear—greatly auspicious.\n\n*End of Scroll Two of the Nüqing Ghost Statutes*\nProduced by the Daoist Academic Information Network",
      "start_char": 4667,
      "end_char": 5969,
      "start_sentence": 322,
      "end_sentence": 358,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.049336433410645,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\女青鬼律.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "老小凶凶，天下一时之乐，千年之祸，伐身之斧，灭命之殳也。 子已知道，及未知者，见吾鬼律，新故科文，皆可从用。 三五七九之日，慎行生炁。 子依吾图局，不犯三炁，如可仙，化民一千。 不知道父母真名，故为俗人。 道士虽知黄书契令，不知二十四神人，故为伪人。 道极数讫，天有三五，子自不知，何得言道不神？ 子不知道，何得言炁不明？ 百闻不如一见，子何不自改心易肠，入吾生炁，得为真人，太平之日飞举上天。 子只复不飞，寿终不死，便为地仙，得见太平。 子日一日，愤闷愤闷，不信不忠，唯行无道，不见太平，念子自衰，吾当何苦。 天师曰：天下男女已知三五七九长生大道，子不依吾法，行恶淫乱，恐子死没恶人之先，幸复告想可勤之。 天师曰：制节行道，谨慎科文，目不妄视，口不妄言，心不妄念，足不妄游，亲善远恶，与体自然，故不重教，幸复可思之。 女青鬼律卷之三竟 女青鬼律卷之四 天师稽首，敢承先王之道，制民勑鬼，今当以盟威正一之气、女青鬼律役使天下邪魅妖□，助道兴化，勒鬼真名，主者明加切正，使天下道气宣布，邪逆宾伏，子知鬼名姓，鬼自趋走，不敢害人。 子常念之，勿违犯矣。 道上将军名侯夫",
      "translated_text": "The young and old rush headlong into fleeting worldly pleasures—these are the axes that hew at the body, the halberds that destroy life, joys of a single moment that bring a thousand years of disaster. You who already know the Dao, and you who do not yet know it: upon seeing these ghostly statutes, both new and old regulations, you may all follow and apply them. On the days of three, five, seven, and nine, take care to practice the cultivation of generative qi. If you adhere to my diagrams and avoid violating the Three Qi, you may attain transcendence and transform a thousand people. Those who do not know the true names of their father and mother remain common folk. Daoist priests who know the Yellow Writs and covenants yet do not know the Twenty-Four Divine Persons are but false practitioners. The Dao’s ultimate reckoning is complete; heaven possesses its Three and Five, yet you remain ignorant—how then can you claim the Dao is not divine? If you do not know the Dao, how can you say the qi is not luminous?\n\nHearing a hundred times is not as good as seeing once. Why do you not transform your heart and renew your innards, entering into the generative qi of my Way? Then you may become a true person, and on the day of Great Peace, ascend to heaven in flight. If you still do not ascend, yet your lifespan does not end in death, you shall become an earthbound immortal and witness the Great Peace. Day by day, you grow ever more vexed and troubled, disbelieving and disloyal, practicing only what is contrary to the Dao. You shall not see the Great Peace. I grieve for you—what more can I do?\n\nThe Heavenly Master declares: Men and women of the world, you already know the great Dao of long life on the days of three, five, seven, and nine, yet you do not follow my methods, instead engaging in evil, lewdness, and disorder. I fear you shall perish before the wicked. I earnestly admonish you once more—ponder this well.\n\nThe Heavenly Master declares: Practice restraint and follow the Dao. Be diligent in observing the regulations. Let your eyes not gaze recklessly, your mouth not speak recklessly, your heart not harbor reckless thoughts, your feet not wander recklessly. Draw near to the good and distance yourself from evil. Harmonize with the spontaneity of the body, and thus there shall be no need for repeated instruction. Reflect upon this carefully.\n\n*End of Scroll Three of the Nüqing Guilu*\n*Beginning of Scroll Four of the Nüqing Guilu*\n\nThe Heavenly Master bows his head, reverently upholding the Dao of the former kings, governing the people and restraining ghosts. Now, with the qi of the Alliance’s Might and Orthodox Unity, and the Nüqing Guilu, he commands all demonic and spectral beings of the world, assisting the Dao in its flourishing transformation. He carves the true names of ghosts, and those in authority must strictly enforce them, so that the Dao’s qi may spread throughout the world, and rebellious spirits submit as guests. If you know the names of ghosts, they shall flee of their own accord and dare not harm people. Keep this always in mind, and do not violate it.\n\n**General of the Dao’s Upper Army: named Houfu.**",
      "overlap_context": "hree Calamities and Nine Tribulations of heaven.\n\nYou, who persist in evil and rebellion, forsaking loyalty and filial piety—fear for your years and life, which you cannot preserve. I grieve for you, and thus I earnestly exhort you again and again.\n\nThe Heavenly Master declares: Men and women of the world, upon seeing these admonitions of goodness, fail to follow them, instead pursuing their own desires. They teach others to act wrongly, engaging in slander and spreading the teachings of ghosts.",
      "start_char": 5969,
      "end_char": 6453,
      "start_sentence": 359,
      "end_sentence": 376,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.04167866706848,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\女青鬼律.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "道下将军名逸车 天上逆鬼名文延玄 地下逆鬼名精子 右四鬼主风雨时随之作害人，行来道路遭大风雨，呼四鬼名，恶气不敢加。 古凶鬼谨忠世 逆鬼弄耳孨子脔切 右二鬼是古死人败冢，或巫师、不正道士之鬼。 鬼害人百行，子知其名，鬼自伏住，不敢动。 天正鬼迭卧迭大结切 地正鬼枔木枔音琴 右二鬼是宅中死煞守鬼，常住人堂屋梁上，夜主伤害人鸡犬六畜。 子知其名，鬼伏住不敢动。 此鬼不敢害人，宅中应有福德之家，此鬼主护人外客殃煞，不敢过宅中。 申久年　　后穆高 右二鬼，人家作屋，不契柱色鼻，朝成立见，星月有灵神，主煞人为邪。 子知其名，鬼不害人。 令精华　　是补坐 右二鬼，人家宅中有铜金钱精，主作於此鬼，鬼或变化作人形，居宅不安，呼之即去。 已巴艮　　赦姑　　殷咎 右三鬼，是人屋中四壁角中鬼，主人夫妻无道，不顺阴阳。 此鬼白直符，直符白奏事，除人生籍。 子知名，鬼不敢动。 并勑鬼着屋四壁角厌，用桃刺长尺二朱书，又悬门户上，勑法如左。 此符青龙主东，白虎主西，朱雀主南，玄武主北，中央黄驎，辟除鬼贼，急急如律令。 右符制百鬼 天载　　蔑向音恶注两切 右二鬼是门伯户丞，白日为神福室，暮作鬼。 子知名，人定时於门户左右呼其名，三掌手，反首持两三过，此鬼即止，不敢作害。 斧金木　　和铠钾粗 右二鬼是人家宅上有树或竹林，为乌鸠止，白鹭、群乌所依，此皆有邪魅。 子知其名，夕夕三呼之，鬼知人不可干，不过七日、九日，鬼自死。 不煞鬼者，多暗中吹之，鬼伏住不害人。 紫肝方转。 肝，喜俱切。 转，陟脔切。 汰循上音大，下音娠。 尘发 右三鬼是世中癫痫煞人之鬼，其赤衣服，乌冠帻，主收人魂。 子知其名，有疾即差，鬼不敢干。 桑华载　　辟气途付 右二鬼是女人月水之精，鬼常贪阴阳血味，女子月水来，日夕存之，呼名，鬼不敢害人。 鬼长三尺，上下青衣。 语忌　　敬遭唯鼻切 右二鬼，女临产鬼。 女子产生时，呼此鬼名，即不害人。 鬼长三寸三分，上下乌衣。 勖精华 右一鬼，主害人田蚕，蚕女鬼。 夫立春日平旦，可向天门三咒曰： 天之皇清明，长远上多神，阴不及与汝，马姑来我宅中，使蚕大得千万倍次田亩，汝收千亿斛，思天中上下，天地中上，止大道。 勑华为我使叱咄，急杀百伤，小魅何狼粹。 金进百逍力追切 右一鬼是旦夕扫除鬼，令人失财。 子知名，可日日平旦向天门三呼名，咒曰： 石未子，石未子，太一使汝为我使，何物逆鬼，令速出、速出。 道以令天下男女，各受道，思口诀真要，以持示子。 子可以存念神明，以真除邪。 八卷之中，有第四卷，至真，可以度世。 子勿违犯，慎之。 天师勑邪中是闻律，鬼莫不伏听。 飞符连天，一元三灵，此天师自睨身中神鬼要法。 远兵士，太王主元一九三气，丈人九气，父母太一，使我收煞，汝急出来。 良久，俯三叱，叱二十四，暗暗。 右天师勑水大邪，鬼不敢害人。 女青鬼律卷之四竟 女青鬼律卷之五 道曰：天下愤愤，常如浮云。 君图其臣，妇谋其夫。 荧惑太白变作人，专作苟语小儿边。 走作邪伪相交连，扑子喉咽不得吞。 治进道路更相传，念子死亡不出年。 一则大乐后相恐，天地运会故令然。",
      "translated_text": "**General of the Dao’s Lower Army: named Yiche.**\n**Heavenly Rebel Ghost: named Wenyanxuan.**\n**Earthly Rebel Ghost: named Jingzi.**\n\nThe four ghosts above govern wind and rain, causing harm to people as they follow the seasons. When traveling on roads and encountering great wind and rain, call out the names of these four ghosts, and evil qi will not dare to afflict you.\n\n**Ancient Ominous Ghost: named Jinzhongshi.**\n**Rebel Ghost: named Nonger Zilanluan.**\n\nThe two ghosts above are the spirits of ancient corpses in ruined tombs, or the ghosts of shamans and unorthodox Daoist masters. They inflict harm upon people in a hundred ways. If you know their names, the ghosts will submit and remain still, daring not to move.\n\n**Heavenly Upright Ghost: named Dieshe Diedajie.**\n**Earthly Upright Ghost: named Xinmu (Xin pronounced as *qin*).**\n\nThe two ghosts above are the death-bringing guardian ghosts of houses, dwelling constantly upon the beams of people’s halls. At night, they harm people, chickens, dogs, and the six livestock. If you know their names, the ghosts will submit and dare not move. These ghosts do not dare harm people; in households with virtue and power, they instead protect against external misfortune and calamities, preventing them from entering the home.\n\n**Shenjiunian**\n**Hou Mugao**\n\nThe two ghosts above appear when people build houses without matching the color of the pillars to the ridgepole. If seen at dawn or dusk, or under the light of stars and the moon, they possess spirits that bring harm and turn people into rebels. If you know their names, the ghosts will not harm people.\n\n**Lingjinghua**\n**Shi Buzuo**\n\nThe two ghosts above are the spirits of bronze and gold coins in people’s homes. They manifest as these ghosts, sometimes transforming into human form, causing unrest in the household. Call out to them, and they will depart.\n\n**Yibagen**\n**Shegu**\n**Yinjiu**\n\nThe three ghosts above dwell in the four corners of the walls within people’s homes. They appear when the master and mistress of the house lack the Dao, failing to follow the harmony of yin and yang. These ghosts serve as *baizhifu* (white straight talismans), and the *baizhifu* report matters to remove people’s names from the register of the living. If you know their names, the ghosts will not dare to move. Command the ghosts to be suppressed in the four corners of the house by writing with cinnabar on a peachwood thorn twelve inches long, and hang it above the door. The method of command is as follows:\n\nThis talisman is governed by the Azure Dragon in the east, the White Tiger in the west, the Vermilion Bird in the south, the Dark Warrior in the north, and the Yellow Qilin in the center. It repels demonic thieves. *Hastily, hasten as the statutes command!*\n\nThis talisman controls a hundred ghosts.\n\n**Tianzai**\n**Miexiang (Mie pronounced as *e*, Xiang as *zhu*)**\n\nThe two ghosts above are the *menbo* (gate elders) and *hucheng* (door guardians). By day, they serve as divine protectors of the household; by night, they become ghosts. If you know their names, at the hour of *ren ding* (9–11 p.m.), call out their names to the left and right of the door, clap your hands three times, turn your head away, and hold the gesture two or three times—these ghosts will then cease and dare not cause harm.\n\n**Fujinmu**\n**Hekaikangcu**\n\nThe two ghosts above dwell in trees or bamboo groves on people’s properties, where crows, turtledoves, egrets, and flocks of birds perch. All such places harbor demonic influences. If you know their names, call out to them three times every evening. The ghosts will realize they cannot overpower you and, within seven to nine days, will die of their own accord. If they do not die, they will often blow in the dark, submitting and no longer harming people.\n\n**Zigan Fangzhuan (Gan pronounced as *ju*, Zhuan as *zhuan*).**\n**Taishun (Shun pronounced as *shen*).**\n**Chenfa**\n\nThe three ghosts above are the world’s ghosts that afflict people with epilepsy. They wear red clothing and black headscarves and are responsible for seizing people’s souls. If you know their names and are ill, you will recover immediately, and the ghosts will not dare to interfere.\n\n**Sanghuazai**\n**Biqitu Fu**\n\nThe two ghosts above are the essences of women’s menstrual blood. Ghosts often crave the taste of yin-yang blood. When a woman’s menstruation arrives, visualize them day and night and call out their names—the ghosts will not dare to harm people. These ghosts are three feet tall and wear blue clothing from head to toe.\n\n**Yuji (Ji pronounced as *bi*)**\n**Jingzao (Zao pronounced as *ni*)**\n\nThe two ghosts above are the ghosts that attend women during childbirth. When a woman is giving birth, call out the names of these ghosts, and they will not harm her. These ghosts are three inches and three-tenths tall and wear black clothing from head to toe.\n\n**Xujinghua**\n\nThis ghost harms people’s fields and silkworms—it is the Silkworm Maiden Ghost. On the day of *Lichun* (Beginning of Spring) at dawn, face the Gate of Heaven and recite the following incantation three times:\n\n*\"Radiant and pure is the August Heaven,*\n*Vast and eternal, filled with many spirits.*\n*Yin does not reach you—*\n*Ma Gu, come to my home,*\n*Let silkworms multiply a thousand ten-thousandfold,*\n*And fields yield a thousand billion bushels.*\n*Contemplate the upper and lower of Heaven,*\n*The upper and middle of Earth,*\n*And the great Dao that abides.*\n*Command Hua to serve me, rebuke and expel!*\n*Hasten to slay a hundred harms,*\n*What can petty demons do, howling like wolves?\"*\n\n**Jinjin (Jin pronounced as *xiao*, the second character as *li*)**\n\nThis ghost is the Sweeping Ghost of dawn and dusk, causing people to lose their wealth. If you know its name, at dawn each day, face the Gate of Heaven and call out its name three times, reciting the following incantation:\n\n*\"Stone Unborn, Stone Unborn,*\n*Taiyi commands you to serve me.*\n*What demon dares oppose?*\n*Make it swiftly depart, swiftly depart!\"*\n\nThe Dao thus commands all men and women under Heaven to receive the Dao, ponder the true essentials of the oral instructions, and hold them forth to their descendants. You may thereby visualize the divine luminaries and, with truth, dispel the demonic. Within these eight scrolls, the fourth scroll is the most authentic and can deliver the world. Do not violate or transgress it—be cautious.\n\nThe Heavenly Master commands: Within the *Lü* (Statutes) of the *Nüqing*, ghosts dare not disobey. Flying talismans connect to Heaven, the One Origin and Three Spirits—this is the essential method of the Heavenly Master’s own body and its divine ghosts. *\"Keep soldiers at a distance! The Great King governs the Origin, the One, the Nine, and the Three Qi. The Elder of the Nine Qi, the Father and Mother Taiyi, command me to gather the slayers—come forth at once!\"* After a long pause, bow three times and recite the *chi* (rebuke) twenty-four times in a low voice.\n\nThe above is the Heavenly Master’s command to the great demon of water—ghosts will not dare to harm people.\n\n*End of Scroll Four of the Nüqing Guilu*\n*Beginning of Scroll Five of the Nüqing Guilu*\n\nThe Dao says: The world is in turmoil, ever like floating clouds. Rulers plot against their ministers, wives scheme against their husbands. Mars and Venus transform into humans, lingering near children with deceitful words. They weave webs of falsehood and treachery, choking the throats of the young so they cannot swallow. They spread rumors along the roads, whispering that you will die within the year. First, there is great joy, then terror—such is the turning of Heaven and Earth’s fate.",
      "overlap_context": "üqing Guilu, he commands all demonic and spectral beings of the world, assisting the Dao in its flourishing transformation. He carves the true names of ghosts, and those in authority must strictly enforce them, so that the Dao’s qi may spread throughout the world, and rebellious spirits submit as guests. If you know the names of ghosts, they shall flee of their own accord and dare not harm people. Keep this always in mind, and do not violate it.\n\n**General of the Dao’s Upper Army: named Houfu.**",
      "start_char": 6453,
      "end_char": 7787,
      "start_sentence": 377,
      "end_sentence": 448,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.06333351135254,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\女青鬼律.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "受任主者当令勤，尽当守一修长存。 勿得任意唯捉心，不行三五唯邪淫。 言天大道而不禁，三官主者择种民。 取合炁者万八千，从来至今有几人。 大限未足子勤身，改心易肠道真人。 师受口诀以见贤，佩吾券契一为先。 得见太平神仙君，五帝主者传秘言。 三五七九道炁尊，治在清微昆仑山。 近见三天入人身，解脱纲罗拜老君。 安心定意行至仙，长短须已勿半身。 可至契令思元辰，七九之运别真人。 天下人民各顽愚，见世愤愤不知忧。 寒鬼入来与子游，太白流横长六朱。 老公道上更相扶，饥饿搏颊辄叩头。 米谷金贵不可求，灾兵大厄庚子年。 念子命运与此坚，方外故州胡夷人。 交颈肿领恶逆民，化生风毒身奉天。 大小皆来至此间，余有胡鬼亿万千。 食人血性逆毛迁，今来入国汝何缘。 兵马浩乱不可言，念子一旦与相连，入步不进屈辄申。 子若不信庚子年， 自当思吾今日言。 日月冥冥恐无光，五谷不生逆鬼行。 是庚子岁约不亡，若有余人如飞蜂。 大小更互道相从，三五相逐一合双。 念子一旦不值逢，未至此年当死亡。 百不遗一柰何从，天日与月当更生。 唯留下地太平中，种民在天见母亲。 不信大道念可言，非不慈孝道不存。 一旦如此岂可言，何不少学得神仙。 大平过度为真人，日月列布如流星。 三五七九道黑明，分布九州若父兄。 皆同一契心合并，义各如一道引经。 黄赤大要守长生，上部太紫人数并。 万万之纪合神灵，托愚作痴不言声。 以守三一从道经，千黑不失事见明。 天道荡荡信自有，日来暮去天地久。 以日为夫月为妻，天气交接等何如。 神垄大山依神居，自见元化不安庐。 束手真实不发舒，超王之教故可胥。 北斗中有太白星，三角浩浩象人形。 游走天下化不平，有知者悟愚者惊。 谁正此道有姓名，木子三台常与并。 约在大会天下平，五行列布金木生。 火水父母土为营，道出元炁从老经。 合景内外神真形，罗缕紫机上天庭。 远望八极登太清，八八之数从一生。 子心不解口语名，天地阴阳人为先。 五体骨节皆有神，乐人长生俱飞仙。 除辟大厄却灾患，少知三五以治身。 长行七九真炁分，太平度世为种民。 天下男女合如云，会於太一仙道人。 三日不摩徊复还，一心两口上应天。 子之长生出子心，三五七九一为亲。 唯炁大正为种民，解脱罗网具身神。 白日高飞入天堂，千年出一丈六躯。 五岳四渍出九州，合成海水不复流。 故出女青鬼律书，传行天下乐何如。 有智自来谒真俦，元者自去太山居。 白骨纵横鬼暗恶，喻啊不止奈何余。 仙童玉女依神居，望见斯辈当何如。 切切天下真欲弊，庚子之年其运至。 千无一人可得脱，有心相遇世道清。 远恶从善不求荣，尘垢之衣以蔽形。 心在太一咏诵经，白日修善暮守生。 被发而行在黄庭，上启太上道姓名。 一出玄都入太清，口授异诀过灾殃。 念世愚子不知生，何当合会随邪灵。 太一来下条姓名，恐子一身不久停。 发愿不死从吾经。 天师曰：大道垂律，女青所传，三五七九，长生之本，〔谨〕以奉行，世世相传。 子有心分，来入吾炁，自当思行仁义，六合守忠，专一养性，以道为家，不得负违。 太上真言，师老太一。 今故以元年正月七日奉行，从者千人之中，有王长、赵升二人，可以道炁化度，令毕得长生大义。",
      "translated_text": "Those entrusted with leadership must ensure diligence, ever guarding the One to cultivate eternal existence. Do not indulge the heart’s whims, nor abandon the Three and Five to pursue depravity. Though the great Dao of Heaven imposes no prohibitions, the Three Offices’ overseers select the *zhongmin* (seed people). Those who harmonize with *qi* number eighteen thousand—how many have endured from ancient times to now? Before your allotted span is complete, refine your body, transform your heart and bowels, and become a true person of the Dao. The master transmits oral instructions to reveal the worthy; wearing my contract and seal takes precedence. Should you meet the Perfected Lords of Great Peace and the Immortal Sages, the Five Emperors’ overseers will impart secret teachings. The Three, Five, Seven, and Nine—revered *qi* of the Dao—are governed in the pure subtlety of Kunlun Mountain. Recently, the Three Heavens have entered the human body, unraveling the snares of the net to bow before the Venerable Lord. Calm the heart, settle the intent, and walk the path to immortality; whether long or short, do not falter halfway. You may reach the covenant by contemplating the *yuanchen* (primordial cyclical signs); the cycles of Seven and Nine distinguish the true person.\n\nThe people of the world are stubborn and foolish, seeing the age’s turmoil yet unaware of sorrow. Cold ghosts come to wander with you, while Venus traverses the heavens, its six red trails stretching long. Old men on the roads support one another, hunger gnawing at their cheeks as they bow their heads in supplication. Grain and gold grow scarce and unattainable; calamity, warfare, and great peril arrive in the *gengzi* year. Consider your fate bound to this destiny—beyond the frontier, in distant prefectures, the Hu and Yi barbarians, their necks swollen and throats inflamed, are a rebellious people. Born of noxious winds and poisons, they serve Heaven in body. Great and small alike come to this land; I possess Hu ghosts by the hundreds of millions. They feed on human blood and essence, their hair bristling in defiance—why have they entered your realm? The chaos of armies and horses defies description. Should you be linked to them even for a day, you will find no forward step, your limbs stiffening and stretching uncontrollably. If you doubt the *gengzi* year, reflect on my words today. Sun and moon may darken, their light lost; the five grains will fail to grow as perverse ghosts roam. In this *gengzi* year, few will escape annihilation—if any remain, they will swarm like flying wasps. Great and small will follow one another, the Three and Five uniting in pairs. Should you fail to encounter this fate, you will perish before the year arrives. Not one in a hundred will survive—what recourse remains? Heaven and sun, moon and earth, will be reborn. Only in the Great Peace below will the *zhongmin* in Heaven behold their mother. If you disbelieve the great Dao, consider these words: is it not filial piety that sustains the Dao? How can one speak of such a day? Why not study a little and attain the immortals? Crossing the threshold of Great Peace, you become a true person, sun and moon arrayed like streaming stars. The Three, Five, Seven, and Nine—Dao’s luminous and dark *qi*—are distributed across the Nine Provinces like brothers. All share one contract, their hearts united, each following the Dao’s guiding scriptures. The great essentials of yellow and red guard long life; the upper register’s supreme purple tallies the human count. The myriad’s reckoning unites with the divine spirits; feigning foolishness and silence, they preserve the Three Ones in accordance with the Dao’s scriptures. Though a thousand shadows obscure, clarity emerges in action. The Dao of Heaven is vast and boundless, yet its truth endures; day follows night, and Heaven and Earth abide. Take the sun as husband and the moon as wife—how does their *qi* commingle? The divine mausoleum of the great mountain shelters the spirits; witnessing the primordial transformation, they dwell without fixed abode. Hands bound in sincerity, they do not relax their vigilance, transcending the teachings of kings to embrace the Dao.\n\nWithin the Northern Dipper resides the Great White Star, its three points vast and luminous, resembling a human form. It roams the world, transforming discord into harmony—those who know awaken, while the ignorant tremble. Who rectifies this Dao and bears a name? The Wooden Child and the Three Terraces ever accompany it. The covenant awaits the great assembly when the world is at peace; the Five Phases array themselves, metal and wood born, fire and water as parents, earth as the encampment. The Dao emerges from primordial *qi*, following the ancient scriptures. The inner and outer luminous spirits manifest their true forms, weaving the purple loom to ascend the Heavenly Court. Gazing toward the eight extremities, one ascends the Grand Clarity; the number sixty-four arises from the One. If your heart does not comprehend, your mouth may speak the names—Heaven and Earth’s yin and yang place humanity first. The five viscera and bones harbor spirits; those who delight in long life all become flying immortals. Dispel great calamities and avert disasters; know a little of the Three and Five to govern the body. Long practice of the Seven and Nine refines *qi*’s divisions; crossing into Great Peace, you become *zhongmin*. The men and women of the world gather like clouds, assembling before the Perfected of the Great One and the Immortal Dao. After three days without hesitation, they return; one heart, two mouths, they ascend in resonance with Heaven. Your long life emerges from your heart; the Three, Five, Seven, and Nine unite as kin. Only the great *qi* of rectitude makes one *zhongmin*, liberating the body’s gods from the snares of the net. Ascending in broad daylight to the Heavenly Hall, one emerges after a thousand years, a body sixteen *zhang* tall. The Five Marchmounts and Four Seas issue from the Nine Provinces, merging into an ocean that ceases to flow.\n\nThus emerges the *Nüqing Guilu*; how joyful is its transmission throughout the world! The wise will come of their own accord to seek the true companions; the foolish will depart to dwell on Mount Tai. White bones lie scattered, ghosts lurking in darkness, their wails unceasing—what can I do? Immortal youths and jade maidens dwell with the spirits; how should they regard such beings? The world’s true decline is imminent; the *gengzi* year’s fate approaches. Not one in a thousand will escape—only those with resolve will meet an age of clarity. Shun evil, pursue goodness without seeking glory; dust-stained robes may yet clothe the form. The heart abides in the Great One, chanting scriptures; by day cultivate goodness, by night preserve life. Let your hair flow unbound as you walk the Yellow Court, invoking the Supreme Lord’s Dao and name. Emerging from the Mysterious Capital to enter the Grand Clarity, you receive esoteric instructions to transcend calamities. Foolish worldly children know not life—when will they unite with the perverse spirits? The Great One descends to record names, fearing your body will not long endure. Vow not to die, and follow my scriptures.\n\nThe Heavenly Master says: The great Dao bestows its precepts, transmitted by Nüqing—the Three, Five, Seven, and Nine are the root of long life. [Respectfully] uphold and practice them, passing them down through the generations. If you possess a heart and share in my *qi*, you must reflect on practicing benevolence and righteousness, guarding loyalty across the Six Directions, focusing on nurturing your nature, and taking the Dao as your home. Do not betray or transgress. The true words of the Supreme Lord, the Master, and the Great One: Thus, on the seventh day of the first month of the first year, we put this into practice. Among a thousand followers, Wang Chang and Zhao Sheng were the two who could be transformed and guided by the Dao’s *qi*, enabling them to fully attain the great principle of long life.",
      "overlap_context": "uilu*\n\nThe Dao says: The world is in turmoil, ever like floating clouds. Rulers plot against their ministers, wives scheme against their husbands. Mars and Venus transform into humans, lingering near children with deceitful words. They weave webs of falsehood and treachery, choking the throats of the young so they cannot swallow. They spread rumors along the roads, whispering that you will die within the year. First, there is great joy, then terror—such is the turning of Heaven and Earth’s fate.",
      "start_char": 7788,
      "end_char": 9131,
      "start_sentence": 449,
      "end_sentence": 522,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.41510081291199,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\女青鬼律.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "不得犯男女神灵， 不得呼天引地， 不得祠祭故炁， 不得指鬼呼神， 不得淫色违慢， 不得言炁不明， 不得两心不正， 不得妄传鬼教， 不得犯五灵七政， 不得与鬼通同， 不得干乱神只， 不得入俗胜真， 不得行来出入。 以急有厄，呼嗟鬼神。 女青鬼律卷之五竟 女青鬼律卷之六 天师曰：自顷年以来，阴阳不调，水旱不适，灾变屡见者，皆由人事失理使其然也。 人为中才，法地则天，动静以时，通而不争，利而无害，故能神仙。 末世废道，急竞为身，不顺天地，伐逆师尊。 尊卑不别，上下乖离。 善恶不分，贤者隐匿。 国无忠臣，亡义违仁。 法令不行，更相欺诈。 致使寇贼充斥，洿辱中华，万民流散，荼毒饥寒，被死者半，十有九伤，岂不痛哉！ 岂不痛哉！ 乱不可久，狼子宜除，道运应兴，太平期近。 今当驱除，留善种人，男女祭酒，一切生民，急相核实，搜索忠贤，恭慕道德，按名列言，自然者寡，督厉宜勤。 若能改过，即为勋人。 人无尊卑，不遵贵贱。 唯恶为真，不得私饰。 所举参错，不直之人，此者坐之，无望久活。 帝王牧守，长吏百僚，若信吾言，举善而教，不能则劝，流刑行仁，祭酒领录，条列上天，有劳显报，位登神仙。 有不用心，惮劳回避，不肯着名，奉行善者，即还恶人，陷於驱除，直符疏记，毫分不差。 百姓乐善，得为善人，时还本乡，以安国土。 人人念善，天下太平，祸乱不作，灾害不生，岂不快乎，岂不快乎。 今遣五主，各领万鬼，分布天下，诛除凶恶，被诛不得称狂，察之不得妄救。 鬼若滥误，谬加善人，主者解释，佑而护之。 鬼若不去，严加收治，赏善罚恶，明遵道科。 东方青炁鬼主姓刘，名元达。 领万鬼，行恶风之病。 南方赤炁鬼主姓张，名元伯。 领万鬼，行热毒之病。 西方白炁鬼主姓赵，名公明。 领万鬼，行注炁之病。 北方炁炁鬼主姓钟，名士季。 领万鬼，行恶毒霍乱心腹绞痛之病。 中央黄炁鬼主姓史，名文业。 领万鬼，行恶疮瘫肿之病。 右五方鬼主，诸欲着名生录为种民者，按此文书，随病呼之，知领鬼姓名，病即差矣。 人人各写一通，系身读之，令罹灾害皆消。 东方青温鬼名咎远。 南方赤温鬼名士言。 西方白温鬼名尧。 北方黑温鬼名天遐。 中央黄温鬼名太黄奴。 第六温鬼名诛女。 第七温鬼名伯陵。 祖父名梁州。 祖母名交成。",
      "translated_text": "Do not offend the spirits of men and women. Do not invoke heaven or summon earth. Do not sacrifice to stale *qi*. Do not point at ghosts or call upon spirits. Do not indulge in lust or act with disrespect. Do not speak of *qi* with obscurity. Do not harbor dual minds or crooked intentions. Do not recklessly transmit demonic teachings. Do not violate the Five Spirits or the Seven Governors. Do not collude with ghosts. Do not disrupt the divine order. Do not let the profane overcome the sacred. Do not come or go without restraint. In haste or distress, do not wail and beseech ghosts and spirits.\n\n*End of Scroll Five of the Nüqing Demon Statutes*\n*Scroll Six of the Nüqing Demon Statutes begins*\n\nThe Heavenly Master says: In recent years, yin and yang have fallen out of harmony, water and drought have been unseasonable, and disasters and omens have repeatedly appeared—all due to human affairs losing their proper order.\n\nHumans, as beings of middling capacity, emulate earth to follow heaven, moving and resting in accord with the seasons, communicating without contention, benefiting without harm. Thus can they attain the state of divine transcendence. Yet in this degenerate age, the Dao is abandoned, and people frantically vie for self-interest. They defy heaven and earth, oppose and betray their masters and elders. Hierarchies blur, superiors and inferiors grow estranged. Good and evil are indistinguishable, and the worthy withdraw into obscurity. The state lacks loyal ministers; loyalty and benevolence are forsaken. Laws and decrees go unenforced; deceit and fraud prevail. Bandits and rebels fill the land, bringing humiliation to the Central Kingdom. The myriad people scatter, suffering from famine and cold. Half perish, and nine out of ten are wounded. How grievous! How grievous!\n\nChaos cannot endure. The ravenous must be eradicated. The Dao’s fortune is set to rise, and the era of Great Peace draws near. Now is the time to drive out the wicked and preserve the good seed of humanity. All libationers, men and women, and every living person must swiftly verify and examine one another, seeking out the loyal and worthy who revere and cherish the Dao. Those who are naturally inclined toward virtue are few; diligent supervision is required. If one can reform their errors, they shall be counted among the meritorious.\n\nAmong people, there is no distinction of high or low, no adherence to noble or base. Only evil is to be regarded as true, and no private embellishments are permitted. Those who are nominated but prove unworthy, or who are unjust, shall be punished accordingly, with no hope of long life.\n\nKings, lords, governors, and all officials—if you heed my words, promote the good and instruct the people, exhorting those who cannot reform, replacing punishments with benevolence—then the libationers shall record your deeds and submit them to heaven. Those who labor shall receive manifest rewards and ascend to the ranks of divine transcendents. But those who lack sincerity, shirk their duties, or avoid committing their names to the practice of goodness shall be deemed wicked and cast out. The records of the upright shall be precise, without the slightest deviation.\n\nWhen the common people delight in goodness and are counted among the virtuous, they shall return to their native villages to bring peace to the land. When all people cultivate goodness, the world shall attain Great Peace. Calamities and rebellions shall cease, and disasters shall no longer arise. How joyous! How joyous!\n\nNow I dispatch the Five Lords, each leading ten thousand ghosts, to spread across the land and execute the wicked. Those slain shall not be called mad, nor shall they be recklessly spared upon investigation. If ghosts err and wrongly afflict the virtuous, their lords shall absolve and protect them. If ghosts refuse to depart, they shall be strictly seized and punished. Reward the good and punish the evil, clearly adhering to the statutes of the Dao.\n\nThe Lord of the Eastern Blue *Qi* is surnamed Liu, named Yuan Da. He commands ten thousand ghosts, spreading diseases of malignant winds.\n\nThe Lord of the Southern Red *Qi* is surnamed Zhang, named Yuan Bo. He commands ten thousand ghosts, spreading diseases of febrile toxins.\n\nThe Lord of the Western White *Qi* is surnamed Zhao, named Gong Ming. He commands ten thousand ghosts, spreading diseases of *qi* infixation.\n\nThe Lord of the Northern Dark *Qi* is surnamed Zhong, named Shi Ji. He commands ten thousand ghosts, spreading diseases of virulent poisons, cholera, and excruciating abdominal pain.\n\nThe Lord of the Central Yellow *Qi* is surnamed Shi, named Wen Ye. He commands ten thousand ghosts, spreading diseases of malignant sores and ulcers.\n\nAll who wish to inscribe their names in the Register of the Living and become the seed people shall follow this document. Call upon the names of these ghost lords according to the affliction, and once their names and the names of their ghosts are known, the illness shall be cured. Let each person copy this text once, carry it on their person, and recite it, so that all calamities and harms may be dispelled.\n\nThe Eastern Blue Fever Ghost is named Jiu Yuan.\nThe Southern Red Fever Ghost is named Shi Yan.\nThe Western White Fever Ghost is named Yao.\nThe Northern Black Fever Ghost is named Tian Xia.\nThe Central Yellow Fever Ghost is named Tai Huang Nu.\nThe Sixth Fever Ghost is named Zhu Nü.\nThe Seventh Fever Ghost is named Bo Ling.\nThe paternal grandfather is named Liang Zhou.\nThe paternal grandmother is named Jiao Cheng.",
      "overlap_context": "d righteousness, guarding loyalty across the Six Directions, focusing on nurturing your nature, and taking the Dao as your home. Do not betray or transgress. The true words of the Supreme Lord, the Master, and the Great One: Thus, on the seventh day of the first month of the first year, we put this into practice. Among a thousand followers, Wang Chang and Zhao Sheng were the two who could be transformed and guided by the Dao’s *qi*, enabling them to fully attain the great principle of long life.",
      "start_char": 9132,
      "end_char": 10101,
      "start_sentence": 523,
      "end_sentence": 581,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.12608575820923,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\女青鬼律.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "父名延年。 母名出中。 右五方温鬼，兄弟七人，合祖父母、父母十一，形能飞，随月行毒，以诛恶人。 一蛊鬼名释渠。 二蛊鬼名咎。 三蛊鬼名礼咎。 四蛊鬼名成晏。 五蛊鬼名不释。 六蛊鬼名乌悟。 七蛊鬼名绿支。 八蛊鬼名育夷。 九蛊鬼名石千。 右九蛊之鬼，行诸恶毒，妖媚蛊乱天下，与五温鬼太黄奴等，共行毒炁也。 正月温鬼名惟。 二月温鬼名肿。 三月温鬼名刘。 四月温鬼名存。 五月温鬼名垒。 六月温鬼名□。 七月温鬼名半。 八月温鬼名怀。 九月温鬼名农。 十月温鬼名卑。 十一月温鬼名赢。 十二月温鬼名坚。 右十二月温鬼，各随其月，放逸天下，伤害群生。 子日温鬼名根。 丑日温鬼名荡。 寅日温鬼名怡。 卯日温鬼名疑。 辰日温鬼名厄。 巳日温鬼名爱。 午日温鬼名悟。 未日温鬼名奴长。 申日温鬼名未。 酉日温鬼名石。 戌日温鬼名志。 亥日温鬼名忧。 右十二日温鬼，各各直其日。 从十二时支干上来疾病民人，日月鬼蛊并顺刘元达等，毒害五方，不得道戒，皆受其殃。 行善精恋，存道遵教，能知名，皆共降伏。 法应去者，各自远迸，制应留者，却其凶党，更相约束，不犯善人。 昊时病人之鬼名文通。 金精鬼名因兑。 木精鬼名倚震。 火精鬼名附离。 水精鬼名托坎。 土精鬼名乘坤。 五精鬼名娇乾。 游噶鬼名获张。 血食鬼名刃方。 虎狼鬼名咳菊。 蛇龙鬼名甲子。 狐狸鬼名勾举。 鼋鼉鬼名地殃。 露死鬼名天殃。 伤死鬼名真果。 狱死鬼名史苏煁。 饿死鬼名伏藏。 客死鬼名逆千。 男伤鬼名悟千。 女伤鬼名艾赤丹。 冢讼鬼名害知。 丘丞鬼名地令。 墓伯鬼名土下侯。 冢下鬼名二千石。 右二十四鬼，放纵下罗截四方，充塞六合，擅算五行，更相署置。 官府列阵，出入导从，兵马权强，杀害无辜，瓷意快心。 寡福之人，悉逢其苦。 志士学道，方术厌禳，符章禁断，乃保利贞。 斩死之鬼。 故死之鬼。",
      "translated_text": "The father is named Yan Nian. The mother is named Chu Zhong.\n\nThe five directional fever ghosts, together with their seven brothers—eleven in all, including their paternal grandparents and parents—possess forms capable of flight. They move with the moon to spread poison and punish the wicked.\n\nThe first *gu* ghost is named Shi Qu.\nThe second *gu* ghost is named Jiu.\nThe third *gu* ghost is named Li Jiu.\nThe fourth *gu* ghost is named Cheng Yan.\nThe fifth *gu* ghost is named Bu Shi.\nThe sixth *gu* ghost is named Wu Wu.\nThe seventh *gu* ghost is named Lü Zhi.\nThe eighth *gu* ghost is named Yu Yi.\nThe ninth *gu* ghost is named Shi Qian.\n\nThese nine *gu* ghosts perpetrate all manner of vile poisons, bewitching and confounding the world. Together with the five fever ghosts, including Tai Huang Nu, they spread their toxic *qi*.\n\nThe fever ghost of the first month is named Wei.\nThe fever ghost of the second month is named Zhong.\nThe fever ghost of the third month is named Liu.\nThe fever ghost of the fourth month is named Cun.\nThe fever ghost of the fifth month is named Lei.\nThe fever ghost of the sixth month is named [omitted].\nThe fever ghost of the seventh month is named Ban.\nThe fever ghost of the eighth month is named Huai.\nThe fever ghost of the ninth month is named Nong.\nThe fever ghost of the tenth month is named Bei.\nThe fever ghost of the eleventh month is named Ying.\nThe fever ghost of the twelfth month is named Jian.\n\nThese twelve monthly fever ghosts, each following their respective month, roam the world and harm all living beings.\n\nThe fever ghost of the *zi* day is named Gen.\nThe fever ghost of the *chou* day is named Dang.\nThe fever ghost of the *yin* day is named Yi.\nThe fever ghost of the *mao* day is named Yi.\nThe fever ghost of the *chen* day is named E.\nThe fever ghost of the *si* day is named Ai.\nThe fever ghost of the *wu* day is named Wu.\nThe fever ghost of the *wei* day is named Nu Zhang.\nThe fever ghost of the *shen* day is named Wei.\nThe fever ghost of the *you* day is named Shi.\nThe fever ghost of the *xu* day is named Zhi.\nThe fever ghost of the *hai* day is named You.\n\nThese twelve daily fever ghosts, each governing their respective day, bring illness to people from the twelve earthly branches and heavenly stems. Together with the monthly and daily ghosts and *gu*, they follow Liu Yuan Da and others to poison the five directions. Those who do not follow the Dao’s precepts shall all suffer their misfortune. Those who cultivate goodness, cherish the Dao, and uphold its teachings—if they know these names—shall collectively subdue them. Those who ought to depart shall flee far away; those who must remain shall be restrained from their malevolent factions. They shall bind one another and refrain from harming the virtuous.\n\nThe ghost afflicting the sick at dawn is named Wen Tong.\nThe Metal essence ghost is named Yin Dui.\nThe Wood essence ghost is named Yi Zhen.\nThe Fire essence ghost is named Fu Li.\nThe Water essence ghost is named Tuo Kan.\nThe Earth essence ghost is named Cheng Kun.\nThe Five Essences ghost is named Jiao Qian.\nThe Wandering *Ga* ghost is named Huo Zhang.\nThe Blood-eating ghost is named Ren Fang.\nThe Tiger and Wolf ghost is named Kai Ju.\nThe Serpent and Dragon ghost is named Jia Zi.\nThe Fox and Wildcat ghost is named Gou Ju.\nThe Turtle and Alligator ghost is named Di Yang.\nThe Ghost of those who died in the open is named Tian Yang.\nThe Ghost of those who died from wounds is named Zhen Guo.\nThe Ghost of those who died in prison is named Shi Su Fen.\nThe Ghost of those who died from starvation is named Fu Cang.\nThe Ghost of those who died away from home is named Ni Qian.\nThe Ghost of men who died from harm is named [omitted] Wu Qian.\nThe Ghost of women who died from harm is named Ai Chi Dan.\nThe Grave Litigation ghost is named Hai Zhi.\nThe Mound Officer ghost is named Di Ling.\nThe Tomb Lord ghost is named Tu Xia Hou.\nThe Grave Underling ghost is named Er Qian Shi.\n\nThese twenty-four ghosts roam freely, weaving nets to block the four directions and filling the six harmonies. They manipulate the reckoning of the five phases, appointing and displacing one another. They form ranks in official bureaus, leading processions in and out with armed escorts, wielding power to kill the innocent and indulge their whims. Those lacking fortune shall all encounter their suffering. Those who aspire to the Dao, practicing arts of suppression and exorcism, wielding talismans and incantations to restrain them, shall preserve their good fortune and integrity.\n\nThe Ghost of those beheaded.\nThe Ghost of those who died by accident.",
      "overlap_context": " on their person, and recite it, so that all calamities and harms may be dispelled.\n\nThe Eastern Blue Fever Ghost is named Jiu Yuan.\nThe Southern Red Fever Ghost is named Shi Yan.\nThe Western White Fever Ghost is named Yao.\nThe Northern Black Fever Ghost is named Tian Xia.\nThe Central Yellow Fever Ghost is named Tai Huang Nu.\nThe Sixth Fever Ghost is named Zhu Nü.\nThe Seventh Fever Ghost is named Bo Ling.\nThe paternal grandfather is named Liang Zhou.\nThe paternal grandmother is named Jiao Cheng.",
      "start_char": 10102,
      "end_char": 11003,
      "start_sentence": 582,
      "end_sentence": 653,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.165215015411377,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\女青鬼律.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "丧车之鬼。 □□之鬼。 天殃之鬼。 殃注之鬼。 雌雄之鬼。 寄死之鬼。 行客之鬼。 地殃之鬼。 天凶之鬼。 地凶之鬼。 天杀之鬼。 地杀之鬼。 日月玄符鬼。 三十六杀鬼。 百二十殃注鬼。 千殃万魅鬼。 魍魉精邪鬼。 迷惑不利鬼。 火逆恶注鬼。 逆道丑贼鬼。 大道邪精千炁之鬼。 千二百官逆之鬼。 地上千师万医鬼。 天地水三官转逆魅鬼。 着耳角之鬼。 自称皇天上帝土玉鬼。 狐狸老精自号之鬼。 宅中强□奸诈声之鬼。 宅中魔邪恐怖人之鬼。 宅中灵林古痉之鬼。 宅中光怪之鬼。 宅中虚耗之鬼。 宅中鄙辱离怨之鬼。 宅冢讼逮之鬼。 右三十六鬼，皆游行世间，乘人衰隙，伺侯有恶，助佐凶殃，造作祸害，敢形易象，随便陵人。 学士知之，立功建德，启告太上，一切收治，年初章奏，列名断之，众鬼畏慑，悉自逃亡。 不告者，一如律令。 女青鬼律卷之六竟",
      "translated_text": "The Ghost of funeral carriages.\nThe Ghost of □□.\nThe Ghost of heavenly calamities.\nThe Ghost of calamity’s imposition.\nThe Ghost of male and female.\nThe Ghost of borrowed death.\nThe Ghost of traveling strangers.\nThe Ghost of earthly calamities.\nThe Ghost of heavenly misfortune.\nThe Ghost of earthly misfortune.\nThe Ghost of heavenly slaughter.\nThe Ghost of earthly slaughter.\nThe Ghost of the Dark Talisman of Sun and Moon.\nThe Thirty-Six Slaughter Ghosts.\nThe One Hundred Twenty Calamity-Imposing Ghosts.\nThe Thousand-Calamity, Ten-Thousand-Specter Ghosts.\nThe *wangliang* spirits and demonic ghosts.\nThe Deluding and Inauspicious Ghosts.\nThe Fire-Reversing, Evil-Imposing Ghosts.\nThe Way-Reversing, Ugly-Bandit Ghosts.\nThe Great Dao’s Deviant Spirits, the Thousand-*Qi* Ghosts.\nThe One Thousand Two Hundred Officials of Reversed Authority.\nThe Thousand Masters and Ten Thousand Physicians of the Earth.\nThe Heaven-Earth-Water Three Officials’ Reversed and Spectral Ghosts.\nThe Ghosts clinging to ears and horns.\nThe Ghosts who call themselves the August Heavenly Thearch and the Earthly Jade Sovereign.\nThe fox and wildcat old spirits who name themselves.\nThe Ghosts of strong □ and deceitful voices in dwellings.\nThe demonic and terrifying ghosts in dwellings.\nThe ghosts of numinous groves and ancient convulsions in dwellings.\nThe ghosts of strange lights in dwellings.\nThe ghosts of depletion and waste in dwellings.\nThe ghosts of vulgarity, humiliation, separation, and resentment in dwellings.\nThe ghosts of litigation and arrest in dwellings and tombs.\n\nThese thirty-six ghosts all roam the world, seizing upon human weakness and awaiting evil, aiding and abetting misfortune, creating disasters and harm. They dare to alter forms and appearances, bullying people at will. Those who study the Dao, establishing merit and building virtue, may petition the Most High, submitting all for governance. At the year’s beginning, they file memorials, listing names to sever their power. All ghosts fear and tremble, fleeing of their own accord. Those who do not petition shall be bound by this ordinance.\n\n*End of Scroll Six of the Nüqing Ghost Statutes*",
      "overlap_context": "ases, appointing and displacing one another. They form ranks in official bureaus, leading processions in and out with armed escorts, wielding power to kill the innocent and indulge their whims. Those lacking fortune shall all encounter their suffering. Those who aspire to the Dao, practicing arts of suppression and exorcism, wielding talismans and incantations to restrain them, shall preserve their good fortune and integrity.\n\nThe Ghost of those beheaded.\nThe Ghost of those who died by accident.",
      "start_char": 11004,
      "end_char": 11439,
      "start_sentence": 654,
      "end_sentence": 691,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.52600383758545,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\女青鬼律.txt",
        "category": "戒律类"
      }
    }
  ]
}