{
  "source_id": "孙真人摄养论",
  "source_file": "chunked_daozang\\孙真人摄养论.json",
  "total_chunks": 2,
  "total_original_chars": 1814,
  "total_translated_chars": 11520,
  "total_translation_time": 50.67683005332947,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\方法类\\孙真人摄养论.txt",
    "category": "方法类"
  },
  "full_translation": "**Sun Zhenren’s Treatise on Nurturing Life**\n\n*Title:* *Sun Zhenren’s Treatise on Nurturing Life* (also known as *Sun Zhenren’s Treatise on Cultivating Life*). Composed by Sun Simiao of the Tang dynasty. One fascicle. Base text from the *Daoist Canon of the Zhengtong Era*, *Dongshen* section, category of methods.\n\n**Sun Zhenren’s Treatise on Nurturing Life**\n\n**First Month:** The kidney *qi* is afflicted, and the lung’s *qi* is weak. One should reduce salty and sour flavors while increasing pungent tastes to assist the kidneys and supplement the lungs, thereby harmonizing and nourishing the stomach *qi*. Avoid exposure to freezing cold or extreme warmth; rise early and retire late to relax body and spirit. Do not eat raw scallions, as they harm the body’s fluids and blood. Do not eat raw knotweed, as it inevitably causes *zheng* and *feng* disorders, with wandering wind rising on the face. Do not consume spoiled or stored foods, as they diminish one’s lifespan. Do not eat the meat of tigers, leopards, or wildcats, as it disturbs the spirit and hun-soul.\n\nOn the fourth day of this month, it is suitable to pluck white hairs. On the seventh day, one should quietly contemplate the true and observe abstinence to accumulate blessings. On the eighth day, bathing is appropriate, but traveling far is forbidden.\n\n**Second Month:** The kidney *qi* is weak, and the liver is in its proper ascendance. One should reduce sour flavors and increase pungent tastes to assist the kidneys and supplement the liver. It is fitting to calm the diaphragm and expel phlegm-water, inducing slight sweating through the skin to disperse the *qi* accumulated during the dark winter. Do not eat daylilies, aged vinegar, or fermented grains, as they provoke *zheng* disorders. Do not eat garlic (large or small), as it causes *qi* congestion and obstructs the diaphragm. Do not consume mallow or parrot eggs, as they stagnate the blood and *qi*, congealing the essence. Do not eat rabbit or fox meat, as they disturb the spirit and hun-soul.\n\nOn the eighth day of this month, it is suitable to pluck white hairs. On the ninth day, avoid all fish, which Daoist adepts greatly fear. On the fourteenth day, traveling far is inadvisable. In mid-spring, when the *qi* is balanced, one should moderate alcohol to preserve the true nature.\n\n**Third Month:** The kidney *qi* has subsided, and the heart *qi* gradually approaches; the *qi* of wood is in its proper ascendance. One should reduce sweet flavors and increase pungent tastes to replenish essence and benefit *qi*. Carefully avoid the west wind, relax the body, and ease the disposition to attain peace and tranquility. Do not engage in excessive killing, so as to accord with the Dao of Heaven. Do not eat daylilies, aged vinegar, or fermented grains, as they provoke *zheng* and *shan* disorders and give rise to epidemics. Do not eat raw mallow, as it causes *qi* distension and transforms into water diseases. Do not consume any animal spleens, for the spleen spirit is in its ascendance. Do not eat parrot eggs, as they cause lifelong confusion.\n\nOn the third day of this month, avoid the five viscera and the hearts of all grasses, for consuming them invites calamity from Heaven and Earth. On the sixth day, bathing is appropriate. On the twelfth day, plucking white hairs is suitable. On the twenty-seventh day, traveling far is forbidden; instead, observe abstinence and quietly contemplate the true.\n\n**Fourth Month:** The liver viscus is afflicted, and the heart viscus gradually strengthens. One should increase sour flavors and reduce bitter tastes to supplement the kidneys and assist the liver, thereby regulating the stomach *qi*. Do not expose oneself recklessly to the stars; avoid winds from the northwest and west. Do not eat garlic, as it harms the spirit and hun-soul and depletes the gallbladder *qi*. Do not eat raw knotweed, as it causes excessive nasal mucus and phlegm-water. Do not eat parrot or pheasant meat, as they provoke paralysis and abscesses, counteracting the primordial *qi*. Do not eat eel, as it harms people.\n\nOn the fourth day of this month, bathing and plucking white hairs are appropriate. On the seventh day, one should calm the mind, quiet the thoughts, and observe abstinence, which will surely bring blessings. Traveling far is forbidden on this day.\n\n**Fifth Month:** The *qi* of the liver viscus rests, and the heart is in its proper ascendance. One should reduce sour flavors and increase bitter tastes to benefit the liver and supplement the kidneys, securing and consolidating the essence-*qi*. Rise and retire early. After any emission, do not expose the body beneath the stars; carefully avoid the north wind. Do not dwell in damp places, so as to avoid inviting pathogenic *qi*. Do not eat lotus root or Chinese chives, as they cause *zheng* disorders, harm the spirit, and deplete *qi*. Do not eat horse meat or the meat of river deer or stags, as they disturb the spirit and *qi*.\n\nOn the fifth day of this month, observe abstinence and maintain purity and stillness. On this day, avoid seeing any fresh blood and do not consume any vegetables. On the sixteenth day, strictly refrain from indulging in desires; violating this shortens lifespan and harms the spirit. Traveling far is forbidden on this day. On the twenty-seventh day, bathing and plucking white hairs are appropriate.\n\n**Sixth Month:** The liver *qi* is weak, and the spleen viscus alone is in its ascendance. One should reduce bitter flavors and increase salty tastes, moderating rich and heavy foods to supplement the liver and assist the kidneys, thereby strengthening the sinews and bones. Carefully guard against wind; contracting it causes paralysis of the hands and feet. Do not soak hands and feet in cold water. Do not eat mallow, as it inevitably leads to water *pi* disorders. Do not eat Sichuan pepper, as it causes *qi* congestion.\n\nOn the sixth day of this month, observing abstinence and bathing are auspicious. This day is also suitable for breaking ground and commencing construction. On the twenty-fourth day, plucking white hairs is appropriate, but traveling far is forbidden. On the twenty-seventh day, bathing, quietly contemplating the true, and performing acts of hidden merit are auspicious.\n\n**Seventh Month:** The liver and heart are deficient in *qi*, and the lung viscus alone is in its ascendance. One should calm the emotions and nature, increase salty flavors and reduce pungent tastes to assist the *qi* and supplement the sinews, thereby nurturing the spleen and stomach. Do not expose oneself to extreme heat, nor indulge in cold; avoid profuse sweating. Do not eat Sichuan pepper, as it causes *qi* congestion. Do not eat pork, as it depletes one’s spirit and *qi*.\n\nDuring this month, do not dwell on evil matters, which Daoist adepts greatly abhor. On the fifth day, bathing is appropriate. On the seventh day, one should eliminate concerns and observe abstinence. On the ninth day, repent past transgressions and seek new blessings. On the twenty-eighth day, plucking white hairs is suitable. On the twenty-ninth day, traveling far is forbidden.\n\n**Eighth Month:** The *qi* of the heart viscus is weak, and the metal of the lungs is in its active phase. One should reduce bitter flavors and increase pungent tastes to assist the sinews and supplement the blood, thereby nurturing the heart and liver. Do not contract perverse winds, as they cause sores to arise in the flesh and bones, leading to epidemic *li* disorders. Do not eat garlic (small), as it harms the spirit and *qi*, disturbing the hun and po souls. Do not eat tripe, as it causes coughing illnesses in winter that persist for years without healing. Do not eat parrot or pheasant meat, as they deplete one’s spirit and *qi*.\n\nOn the fourth day of this month, do not purchase shoes or footwear, which Daoist adepts greatly abhor. On the eighteenth day, observe abstinence, contemplate auspicious matters, and invoke blessings from Heaven and humanity. On the twentieth day, plucking white hairs is appropriate, but traveling far is forbidden—those who depart will not return. Bathing is also auspicious on this day.\n\n**Ninth Month:** The yang *qi* has already declined, and the yin *qi* is greatly ascendant. Violent winds frequently arise; carefully guard against thieving perverse winds.\n\nIt is advisable to reduce bitterness and increase saltiness to nourish the liver, benefit the kidneys, assist the spleen, and support the stomach. Do not brave wind and frost, nor indulge in drunkenness or overeating. Do not eat *zun* greens, for they harbor unseen insects. Do not eat ginger or garlic, as they harm the spirit and *qi*. Do not eat frost-bitten raw vegetables or melons, which cause heart pain. Do not eat mallow, as it transforms into water disease. Do not eat dog meat, which diminishes one’s lifespan.\n\nOn the ninth day of this month, observe abstinence. On the sixteenth day, bathing and plucking white hairs are auspicious. On the twenty-seventh day, avoid traveling far, for it is called the Day of Nets.\n\n**Tenth Month:** The *qi* of the heart and lungs is weak, while the kidney *qi* is strong. It is fitting to reduce pungency and bitterness to nourish the kidney viscera. Do not strain the sinews or bones, nor expose the skin. Avoid reckless moxibustion or acupuncture, for the blood is sluggish and bodily fluids do not flow freely. Do not eat raw pepper, which harms the blood vessels. Do not eat raw *qu*, as it increases phlegm and water. Do not eat bear, tripe, or *zun* greens, which dull one’s complexion.\n\nOn the first day of this month, bathing is auspicious. On the fourth and fifth days, avoid meting out punishments, which Daoist adepts greatly abhor. On the tenth day, avoid traveling far. On the thirteenth day, plucking white hairs is appropriate. On the fifteenth day, observe abstinence, contemplate the true, and you will surely receive blessings. On the twentieth day, traveling far is strictly forbidden.\n\n**Eleventh Month:** The kidney viscera now govern, while the heart and lungs are weak. It is fitting to increase bitterness and eliminate saltiness to regulate the lungs and stomach. Do not apply moxibustion to the abdomen or back, nor expose yourself to sudden warmth. Carefully guard against thieving perverse winds, for those who violate this will suffer facial swelling and stiff, painful waist and spine. Do not eat badger meat, which harms the spirit and soul. Do not eat snails, clams, crabs, or turtles, as they deplete one’s primordial *qi* and foster corpse worms. Do not eat vinegar stored through summer, which triggers head wind and leads to water disease. Do not eat raw vegetables, which cause heart pain.\n\nOn the third day of this month, observe abstinence and contemplate in stillness. On the tenth day, plucking white hairs is appropriate, but traveling far is forbidden—do not depart. Instead, contemplate goodness, and Heaven will grant blessings and dispel misfortune. On the sixteenth day, bathing is auspicious.\n\n**Twelfth Month:** Earth now governs, and the *qi* of water does not flow. It is fitting to reduce sweetness and increase bitterness to nourish the heart, assist the lungs, and regulate the kidney viscera. Do not brave frost and dew, nor discharge bodily fluids or sweat. Do not eat mallow, as it transforms into water disease. Do not eat *qiu*, which often triggers painful illnesses. Do not eat *dian* turtles.\n\n*Sun Zhenren’s Treatise on Nourishing Life* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "孙真人摄养论 经名：孙真人摄养论。 又名《孙真人摄生论》。 唐·孙思邈撰。 一卷。 底本出处：《正统道藏》洞神部方法类。 孙真人摄养论 正月肾气受病，肺藏气微。 宜臧咸酸增辛味，助肾补肺，安养胃气。 勿冒冰冻，勿极温暖，早起夜卧，以缓形神。 勿食生葱，损人津血。 勿食生寥，必为症疯，面起游风。 勿食垫藏之物，臧折人寿。 勿食虎豹狸肉，令人神魂不安。 此月四日，宜拔白发； 七日宜静念思真，斋戒增福； 八日宜沐浴，其日忌远行。 二月肾气微，肝当正王。 宜臧酸增辛，助肾补肝，宜静膈去痰水，小泄皮肤微汗，以散玄冬蕴伏之气。 勿食黄花菜、陈醋、值，发症疾。 勿食大小蒜，令人气壅，关膈不通。 勿食葵及鹦子，滞人血气，冱精。 勿食兔及狐貉肉，令人神魂不安。 此月八日，宜拔白发； 九日忌食一切鱼，仙家大畏。 十四日不宜远行。 仲春气正，宜节酒保全真性。 三月肾气已息，心气渐临，木气正王。 宜臧甘增辛，补精益气，慎避西风，散体缓形，便性安泰。 勿专杀伐，以顺天道。 勿食黄花菜、陈醋、值，发症疝，起瘟疫。 勿食生葵，令人气胀，化为水疾。 勿食诸脾，脾神当王。 勿食鹦子，令人终身昏乱。 此月三日，忌食五藏及百草心，食之天地遗殃。 六日宜沐浴，十二日宜拔白发，二十七日忌远行，宜斋戒，念静思真。 四月肝藏已病，心藏渐壮。 宜增酸臧苦，补肾助肝，调胃气。 勿暴露星宿，避西北二方风。 勿食大蒜，伤神魂，损胆气。 勿食生兹，令人多涕唾，发痰水。 勿食鹦雉肉，令人生瘫疽，逆元气。 勿食鳝鱼，害人。 此月四日，宜沐浴，拔白发。 七日宜安心静虑，斋戒，必有福庆。 其日忌远行。 五月肝藏气休，心正王。 宜臧酸增苦，益肝补肾，固密精气，卧起俱早。 每发泄，勿露体星宿下，慎避北风。 勿处湿地，以招邪气。 勿食莲韭，以为症症，伤神损气。 勿食马肉及獐鹿肉，令人神气不安。 此月五日，宜斋戒，清静。 此日忌见一切生血，勿食一切菜。 十六日切忌嗜欲，犯之夭寿，伤神。 其日忌远行。 二十七日宜沐浴，拔白发。 六月肝气微，脾藏独王。 宜臧苦增咸，节约肥浓，补肝助肾，益筋骨，慎束风，犯之令人手足瘫痪。 勿用玲水浸手足。 勿食葵，必成水癖。 勿食茱萸，令人气壅。 此月六日，宜斋戒、沐浴，吉。 其日又宜起土兴工。 二十四日宜拔白发，其日忌远行。 二十七日宜沐浴，念静思真，施阴惊事吉。 七月肝心少气，肺藏独王。 宜安宁情性，增咸臧辛，助气补筋，以养脾胃。 无冒极热，勿恣冻玲，无发大汗。 勿食茱萸，令人气壅。 勿食猜肉，损人神气。 此月勿思恶事，仙家大忌。 五日宜沐浴，七日宜绝虑，斋戒。 九日谢前愆，求祈新庆。 二十八日宜拔白发。 二十九日忌远行。 八月心藏气微，肺金用事。 宜减苦增辛，助筋补血，以养心肝。 无犯邪风，令人骨肉生疮，以为疠痢。 勿食小蒜，伤人神气，魂魄不安。 勿食堵肚，冬成嗽疾，经年不差。 勿食鹦雉肉，损人神气。 此月四日，勿市鞋履附足之物，仙家大忌。 十八日宜斋戒，思念吉事，天人兴福之时。 二十日宜拔白发，忌远行，去而不返。 又宜沐浴，吉。 九月阳气已衰，阴气大盛，暴风数起，切忌贼邪之风。",
      "translated_text": "**Sun Zhenren’s Treatise on Nurturing Life**\n\n*Title:* *Sun Zhenren’s Treatise on Nurturing Life* (also known as *Sun Zhenren’s Treatise on Cultivating Life*). Composed by Sun Simiao of the Tang dynasty. One fascicle. Base text from the *Daoist Canon of the Zhengtong Era*, *Dongshen* section, category of methods.\n\n**Sun Zhenren’s Treatise on Nurturing Life**\n\n**First Month:** The kidney *qi* is afflicted, and the lung’s *qi* is weak. One should reduce salty and sour flavors while increasing pungent tastes to assist the kidneys and supplement the lungs, thereby harmonizing and nourishing the stomach *qi*. Avoid exposure to freezing cold or extreme warmth; rise early and retire late to relax body and spirit. Do not eat raw scallions, as they harm the body’s fluids and blood. Do not eat raw knotweed, as it inevitably causes *zheng* and *feng* disorders, with wandering wind rising on the face. Do not consume spoiled or stored foods, as they diminish one’s lifespan. Do not eat the meat of tigers, leopards, or wildcats, as it disturbs the spirit and hun-soul.\n\nOn the fourth day of this month, it is suitable to pluck white hairs. On the seventh day, one should quietly contemplate the true and observe abstinence to accumulate blessings. On the eighth day, bathing is appropriate, but traveling far is forbidden.\n\n**Second Month:** The kidney *qi* is weak, and the liver is in its proper ascendance. One should reduce sour flavors and increase pungent tastes to assist the kidneys and supplement the liver. It is fitting to calm the diaphragm and expel phlegm-water, inducing slight sweating through the skin to disperse the *qi* accumulated during the dark winter. Do not eat daylilies, aged vinegar, or fermented grains, as they provoke *zheng* disorders. Do not eat garlic (large or small), as it causes *qi* congestion and obstructs the diaphragm. Do not consume mallow or parrot eggs, as they stagnate the blood and *qi*, congealing the essence. Do not eat rabbit or fox meat, as they disturb the spirit and hun-soul.\n\nOn the eighth day of this month, it is suitable to pluck white hairs. On the ninth day, avoid all fish, which Daoist adepts greatly fear. On the fourteenth day, traveling far is inadvisable. In mid-spring, when the *qi* is balanced, one should moderate alcohol to preserve the true nature.\n\n**Third Month:** The kidney *qi* has subsided, and the heart *qi* gradually approaches; the *qi* of wood is in its proper ascendance. One should reduce sweet flavors and increase pungent tastes to replenish essence and benefit *qi*. Carefully avoid the west wind, relax the body, and ease the disposition to attain peace and tranquility. Do not engage in excessive killing, so as to accord with the Dao of Heaven. Do not eat daylilies, aged vinegar, or fermented grains, as they provoke *zheng* and *shan* disorders and give rise to epidemics. Do not eat raw mallow, as it causes *qi* distension and transforms into water diseases. Do not consume any animal spleens, for the spleen spirit is in its ascendance. Do not eat parrot eggs, as they cause lifelong confusion.\n\nOn the third day of this month, avoid the five viscera and the hearts of all grasses, for consuming them invites calamity from Heaven and Earth. On the sixth day, bathing is appropriate. On the twelfth day, plucking white hairs is suitable. On the twenty-seventh day, traveling far is forbidden; instead, observe abstinence and quietly contemplate the true.\n\n**Fourth Month:** The liver viscus is afflicted, and the heart viscus gradually strengthens. One should increase sour flavors and reduce bitter tastes to supplement the kidneys and assist the liver, thereby regulating the stomach *qi*. Do not expose oneself recklessly to the stars; avoid winds from the northwest and west. Do not eat garlic, as it harms the spirit and hun-soul and depletes the gallbladder *qi*. Do not eat raw knotweed, as it causes excessive nasal mucus and phlegm-water. Do not eat parrot or pheasant meat, as they provoke paralysis and abscesses, counteracting the primordial *qi*. Do not eat eel, as it harms people.\n\nOn the fourth day of this month, bathing and plucking white hairs are appropriate. On the seventh day, one should calm the mind, quiet the thoughts, and observe abstinence, which will surely bring blessings. Traveling far is forbidden on this day.\n\n**Fifth Month:** The *qi* of the liver viscus rests, and the heart is in its proper ascendance. One should reduce sour flavors and increase bitter tastes to benefit the liver and supplement the kidneys, securing and consolidating the essence-*qi*. Rise and retire early. After any emission, do not expose the body beneath the stars; carefully avoid the north wind. Do not dwell in damp places, so as to avoid inviting pathogenic *qi*. Do not eat lotus root or Chinese chives, as they cause *zheng* disorders, harm the spirit, and deplete *qi*. Do not eat horse meat or the meat of river deer or stags, as they disturb the spirit and *qi*.\n\nOn the fifth day of this month, observe abstinence and maintain purity and stillness. On this day, avoid seeing any fresh blood and do not consume any vegetables. On the sixteenth day, strictly refrain from indulging in desires; violating this shortens lifespan and harms the spirit. Traveling far is forbidden on this day. On the twenty-seventh day, bathing and plucking white hairs are appropriate.\n\n**Sixth Month:** The liver *qi* is weak, and the spleen viscus alone is in its ascendance. One should reduce bitter flavors and increase salty tastes, moderating rich and heavy foods to supplement the liver and assist the kidneys, thereby strengthening the sinews and bones. Carefully guard against wind; contracting it causes paralysis of the hands and feet. Do not soak hands and feet in cold water. Do not eat mallow, as it inevitably leads to water *pi* disorders. Do not eat Sichuan pepper, as it causes *qi* congestion.\n\nOn the sixth day of this month, observing abstinence and bathing are auspicious. This day is also suitable for breaking ground and commencing construction. On the twenty-fourth day, plucking white hairs is appropriate, but traveling far is forbidden. On the twenty-seventh day, bathing, quietly contemplating the true, and performing acts of hidden merit are auspicious.\n\n**Seventh Month:** The liver and heart are deficient in *qi*, and the lung viscus alone is in its ascendance. One should calm the emotions and nature, increase salty flavors and reduce pungent tastes to assist the *qi* and supplement the sinews, thereby nurturing the spleen and stomach. Do not expose oneself to extreme heat, nor indulge in cold; avoid profuse sweating. Do not eat Sichuan pepper, as it causes *qi* congestion. Do not eat pork, as it depletes one’s spirit and *qi*.\n\nDuring this month, do not dwell on evil matters, which Daoist adepts greatly abhor. On the fifth day, bathing is appropriate. On the seventh day, one should eliminate concerns and observe abstinence. On the ninth day, repent past transgressions and seek new blessings. On the twenty-eighth day, plucking white hairs is suitable. On the twenty-ninth day, traveling far is forbidden.\n\n**Eighth Month:** The *qi* of the heart viscus is weak, and the metal of the lungs is in its active phase. One should reduce bitter flavors and increase pungent tastes to assist the sinews and supplement the blood, thereby nurturing the heart and liver. Do not contract perverse winds, as they cause sores to arise in the flesh and bones, leading to epidemic *li* disorders. Do not eat garlic (small), as it harms the spirit and *qi*, disturbing the hun and po souls. Do not eat tripe, as it causes coughing illnesses in winter that persist for years without healing. Do not eat parrot or pheasant meat, as they deplete one’s spirit and *qi*.\n\nOn the fourth day of this month, do not purchase shoes or footwear, which Daoist adepts greatly abhor. On the eighteenth day, observe abstinence, contemplate auspicious matters, and invoke blessings from Heaven and humanity. On the twentieth day, plucking white hairs is appropriate, but traveling far is forbidden—those who depart will not return. Bathing is also auspicious on this day.\n\n**Ninth Month:** The yang *qi* has already declined, and the yin *qi* is greatly ascendant. Violent winds frequently arise; carefully guard against thieving perverse winds.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1241,
      "start_sentence": 0,
      "end_sentence": 86,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.60199213027954,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\孙真人摄养论.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "宜臧苦增咸，补肝益肾，助脾资胃。 勿冒风霜，无恣醉饱。 勿食尊菜，有虫不见。 勿食姜蒜，损人神气。 勿食经霜生菜及瓜，令人心痛。 勿食葵，化为水病。 勿食犬肉，臧算夭寿。 此月九日； 宜斋戒。 十六日宜沐浴，拔白发。 二十七日忌远行，呼为罗网之日。 十月心肺气弱，肾气强盛。 宜臧辛苦，以养肾藏。 无伤筋骨，勿泄皮肤。 勿妄缄灸，以其血涩，津液不行。 勿食生椒，损人血脉。 勿食生趣，以增痰水。 勿食熊、堵肉、尊菜，衰人颜色。 此月一日，宜沐浴。 四日、五日勿责罚，仙家大忌。 是月十日忌远行，十三日宜拔白发，十五日宜斋戒，静念思真，必获福庆。 二十日，切忌远行。 十一月肾藏正主，心肺衰微。 宜增苦味绝咸，补理肺胃。 勿灸腹背，勿暴温暖，慎避贼邪之风，犯之令人面肿，腰脊强痛。 勿食貉肉，伤人神魂。 勿食螺蚌蟹鳖，损人元气，长尸虫。 勿食经夏醋，发头风，成水病。 勿食生菜，令人心痛。 此月三日，宜斋戒静念。 十日宜拔白发，其日忌远行，不可出，宜念善，天与福去灾。 十六日宜沐浴，吉。 十二月土当王，水气不行。 宜臧甘增苦，补心助肺，调理肾藏。 勿冒霜露，勿泄津液及汗。 勿食葵，化为水病。 勿食球，多发痛疾。 勿食电鳖。 孙真人摄养论竟",
      "translated_text": "It is advisable to reduce bitterness and increase saltiness to nourish the liver, benefit the kidneys, assist the spleen, and support the stomach. Do not brave wind and frost, nor indulge in drunkenness or overeating. Do not eat *zun* greens, for they harbor unseen insects. Do not eat ginger or garlic, as they harm the spirit and *qi*. Do not eat frost-bitten raw vegetables or melons, which cause heart pain. Do not eat mallow, as it transforms into water disease. Do not eat dog meat, which diminishes one’s lifespan.\n\nOn the ninth day of this month, observe abstinence. On the sixteenth day, bathing and plucking white hairs are auspicious. On the twenty-seventh day, avoid traveling far, for it is called the Day of Nets.\n\n**Tenth Month:** The *qi* of the heart and lungs is weak, while the kidney *qi* is strong. It is fitting to reduce pungency and bitterness to nourish the kidney viscera. Do not strain the sinews or bones, nor expose the skin. Avoid reckless moxibustion or acupuncture, for the blood is sluggish and bodily fluids do not flow freely. Do not eat raw pepper, which harms the blood vessels. Do not eat raw *qu*, as it increases phlegm and water. Do not eat bear, tripe, or *zun* greens, which dull one’s complexion.\n\nOn the first day of this month, bathing is auspicious. On the fourth and fifth days, avoid meting out punishments, which Daoist adepts greatly abhor. On the tenth day, avoid traveling far. On the thirteenth day, plucking white hairs is appropriate. On the fifteenth day, observe abstinence, contemplate the true, and you will surely receive blessings. On the twentieth day, traveling far is strictly forbidden.\n\n**Eleventh Month:** The kidney viscera now govern, while the heart and lungs are weak. It is fitting to increase bitterness and eliminate saltiness to regulate the lungs and stomach. Do not apply moxibustion to the abdomen or back, nor expose yourself to sudden warmth. Carefully guard against thieving perverse winds, for those who violate this will suffer facial swelling and stiff, painful waist and spine. Do not eat badger meat, which harms the spirit and soul. Do not eat snails, clams, crabs, or turtles, as they deplete one’s primordial *qi* and foster corpse worms. Do not eat vinegar stored through summer, which triggers head wind and leads to water disease. Do not eat raw vegetables, which cause heart pain.\n\nOn the third day of this month, observe abstinence and contemplate in stillness. On the tenth day, plucking white hairs is appropriate, but traveling far is forbidden—do not depart. Instead, contemplate goodness, and Heaven will grant blessings and dispel misfortune. On the sixteenth day, bathing is auspicious.\n\n**Twelfth Month:** Earth now governs, and the *qi* of water does not flow. It is fitting to reduce sweetness and increase bitterness to nourish the heart, assist the lungs, and regulate the kidney viscera. Do not brave frost and dew, nor discharge bodily fluids or sweat. Do not eat mallow, as it transforms into water disease. Do not eat *qiu*, which often triggers painful illnesses. Do not eat *dian* turtles.\n\n*Sun Zhenren’s Treatise on Nourishing Life* concludes.",
      "overlap_context": "wear, which Daoist adepts greatly abhor. On the eighteenth day, observe abstinence, contemplate auspicious matters, and invoke blessings from Heaven and humanity. On the twentieth day, plucking white hairs is appropriate, but traveling far is forbidden—those who depart will not return. Bathing is also auspicious on this day.\n\n**Ninth Month:** The yang *qi* has already declined, and the yin *qi* is greatly ascendant. Violent winds frequently arise; carefully guard against thieving perverse winds.",
      "start_char": 1241,
      "end_char": 1736,
      "start_sentence": 87,
      "end_sentence": 125,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.074837923049927,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\孙真人摄养论.txt",
        "category": "方法类"
      }
    }
  ]
}