{
  "source_id": "宋中太乙宫碑铭",
  "source_file": "chunked_daozang\\宋中太乙宫碑铭.json",
  "total_chunks": 2,
  "total_original_chars": 1807,
  "total_translated_chars": 10849,
  "total_translation_time": 54.82055902481079,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\记传类\\宋中太乙宫碑铭.txt",
    "category": "记传类"
  },
  "full_translation": "**Inscription for the Taiyi Palace at Songzhong**\n\n*Title:* Inscription for the Taiyi Palace at Songzhong. Composed by Lü Huiqing of the Song Dynasty. One chapter.\n\n*Inscription for the Taiyi Palace at Songzhong*\nComposed by Minister Lü Huiqing, Gentleman for Court Service, Drafter of Imperial Edicts, Concurrent Reader-in-Waiting, and Supervisor of the Directorate of Education, in reverent compliance with imperial command.\n\nIn the fourth year of the Xining reign (1071), the Directorate of Astronomy memorialized that the deity of the Five Blessings of Taiyi, in the seventh year of its cycle—coinciding with the *sheti* year of the *Geti* epoch—would descend to the Central Palace. Its name was the True Chamber, its domain the capital’s hinterland, and its auspice the prosperity of the people and the flourishing of all things. As this heralded an era of great peace, they requested the establishment of a shrine in accordance with precedent. The Son of Heaven approved the memorial and commanded the Directorate of Palace Construction to erect a palace south of the capital. Construction began in the winter of the fourth year and was completed in the spring of the sixth year (1073). The complex comprised three gates and seven halls, with separate shrines for the Ten Taiyi and the Spirit of the Year, while the Five Blessings resided at its center. The emperor personally bestowed names upon them, all signifying the reception of the deities’ repose, and inscribed the name of the True Chamber Hall himself. The four walls of its corridors were adorned with murals depicting the court of the hundred spirits—from the celestial realm of the Five Emperors, sun, moon, and stars, to the terrestrial domain of the Five Peaks and the Four Seas—each occupying its proper rank and title. The hierarchy of vestments, the distinctions of ritual objects, the design of altars and sacred precincts, and the rites of prayer and sacrifice were all grounded in the teachings of Taiyi, supplemented by Daoist doctrine.\n\nThe emperor ordered the relevant officials to prepare the ceremonial regalia and, at the winter solstice of the present year, to enshrine the divine images in the palace. He further commanded this minister, Huiqing, to inscribe a stele to record the event.\n\nYour minister, bowing in reverence, reflects upon the *Rites of Zhou: Spring Office*, wherein the Minister of Rites is charged with overseeing the sacrifices to the celestial deities. The most exalted of these is the August Heavenly Thearch, while the humblest extend to the Directors of the Center and Fate, the Masters of Wind and Rain. Scholars, guided by astronomical texts, assign each deity a fixed position. Among the subordinate officials of the Minister of Rites are the *Fengxiang* and *Baozhang* officers, who observe the celestial positions and the terrestrial correspondences of the realm to discern omens. The *Fanshen* officers, who serve the spirits, are versed in the laws of the Three Luminaries, determining the abodes of ghosts and gods, distinguishing their names and attributes, and summoning them. The Grand Invocators are responsible for the six forms of prayer to invoke blessings. Thus, the Minister of Rites oversees the canons of sacrifice, the *Fengxiang* and *Baozhang* officers preside over divination based on celestial changes, the *Fanshen* officers map the dwellings of the spirits, and the Grand Invocators conduct the prayers. Taken together, these are all the duties of the ritual officials.\n\nThough the title *Taiyi* does not appear in the classics, historical records describe its star as lying south of the Celestial Unity in the Purple Palace, identifying it as the spirit of the Heavenly Thearch. It commands sixteen deities, discerning the fortunes and misfortunes of nations. The second star of the Northern Culmen, the brightest and reddest, marks its seat, while the Three Steps serve as the celestial staircase by which Taiyi ascends and descends. Though the astronomers’ accounts of the stars cannot be entirely verified, their theories derive from established traditions, their positions can be precisely located, and their prognostications have often proven accurate. Given the exalted status ascribed to Taiyi, it is evident that the ancient veneration of the supreme celestial deity as Taiyi, assisted by the Five Emperors, and the practice of worshipping it at the suburban altars, was not confined to the local customs of the people of Bo or the institutions of the Han dynasty alone.\n\nAs the duties of the ritual officials have since been lost, the divinations of the *Fengxiang* and *Baozhang* officers have devolved into the methods of the Bureau of Astrology. The Daoist depictions of the deities’ images, the distinctions in their vestments and ranks, and the rituals of altars and sacrifices likely preserve the remnants of the *Fanshen* officers’ mapping of the spirits’ abodes and the Grand Invocators’ prayers for blessings. Today, the officials regard the Five Blessings as deities who relocate their palace every forty-five years, traversing the central and four cardinal regions. Roughly every two hundred twenty-five years, they complete a cycle, during which they must pass through the Central Palace. Yet when we examine past records, their correspondences do not always align perfectly. Why is this?\n\nI venture a comparison: celestial timing is like the seasons, while human affairs are like sowing and reaping. Without human effort, even favorable seasons are like timely weather without cultivation—no harvest can be expected. Without celestial timing, even diligent labor is like sowing out of season—no growth can be achieved. The ancients held that Heaven does not accomplish without humanity, nor humanity without Heaven; this is what they meant. Why should we doubt this principle when it comes to Taiyi?\n\nI observe that since ascending the throne, the emperor has reformed governance and education, rectified the bureaucracy, and established laws and institutions in the capital. He has promoted the people’s welfare, extending benefits first to the capital region, then to the educated elite, and ensuring the military is well-provisioned. His efforts have encompassed all things, always prioritizing the four directions. Rain and shine, cold and heat have all been harmonious. False rumors cannot shake his achievements, nor can dissenting opinions exploit his shortcomings. Is this solely the result of human effort? Surely it is also aided by celestial timing. Thus, the protection of the True Chamber may well have manifested here.\n\nDuring the *Taiping Xingguo* era (976–984), the deity resided in the Yellow Chamber Palace, its domain the lands of Wu and Yue. Emperor Taizong established a shrine in the southeastern suburbs. During the *Tiansheng* era (1023–1032), it resided in the Yellow Court Palace, its domain the lands of Liang and Shu. Emperor Renzong established a shrine in the southwestern suburbs. The intent was that the Son of Heaven regards all under Heaven as his home. If a place lies within the nine provinces and four seas, its blessings are unified—how can there be boundaries of \"here\" and \"there\"? Now, as the deity resides in the Central Palace, at the convergence of the four directions, its auspicious repose will extend throughout the four seas, not merely to the emperor’s residence. Should not the means of its realization be all the more expansive?\n\nThen must the emperor extend the benevolence he has already bestowed to those yet untouched, seeking unestablished governance to refine where it has already taken root. Thus, within the bounds of heaven and earth, all shall receive his grace as one; every living thing, plant and creature alike, shall be endowed with life in perfect harmony. At such a time, governance shall reach perfection and rites and music be deliberated; sincerity shall reach its utmost and heaven and earth take heed. One may observe the great and small of all things to discern the subtleties of virtue’s production, and arrange the ranks of the divine by comparing their merits above and below. This is how we bestow blessings upon the common people and align with the decrees of the Three Spirits—its greatest significance.\n\nYet I, though unworthy, remain in office, my duty bound to classical learning and literary composition. Thus, the praise I owe to such abundant virtue is not merely a trifling matter. And now, the task of composing this inscription has fallen to me—how dare I decline on grounds of inadequacy?\n\nWith reverence, I bow my head and kowtow to present this text:\n\nIn the primordial chaos, a single qi, the offices of essence silent.\nEndless its cycles, boundless its expanse.\nWaxing and waning, fullness and void—\nwho can fathom its depths?\n\nResplendent in majesty and spirit,\nit presides as the Great Unity.\nOverseeing the Purple Palace,\nits station at the Pole Star.\nDescending the three celestial steps,\nit surveys the myriad states.\nThe great ones interpret its signs,\ncrafting the models of governance.\nTracking its movements and changes,\nrevealing what lies hidden.\nBestowing auspicious omens, resounding in the nine lands,\nit dispenses the Five Blessings.\n\nTraversing the four directions,\npassing through the true chambers,\nforty-five years—\none palace shifts.\nWho shall be its recipient?\nBlessing rests upon the virtuous.\n\nRadiant is the Great Song,\nits dominion stretching to the nine provinces.\nWise generations succeed one another,\na thousandfold, a hundredfold in fortune.\nAccustomed to peace, complacent in governance,\ncorruption threatens to accumulate.\nThen was born one of profound wisdom and sagacity,\narising to set things right.\nHis governance spread to the four quarters,\nfirst in the capital.\nExcess and perversion were suppressed,\nultimately establishing order.\nThe Five Qi converged,\ndissolving decay and eclipse.\nWashing away disasters, calming deep afflictions,\nthe barren earth was enriched.\n\nThe coming of the Great Unity—\nits approach could be foreseen.\nThe new palace, grand and resplendent,\nwas completed in no time.\nModeled after the imperial abode,\nadorned in gold and jade-green.\nBeneath the Great Unity,\nit stands secure and well-settled.\nHeaven’s design and human endeavor—\nboth now fulfilled.\nTo accomplish and to uphold one’s station—\nthe duty of sage and worthy.\nGathering the blessings of the times,\nbestowing them anew.\nExtending to the farthest shores,\nequal for all living things.\nThe two palaces rejoice in longevity,\nthe empress and consorts chosen with care.\nSons and grandsons, emperors and kings,\nshall endure for ten thousand myriad generations.\nRites perfected, music complete,\npeace and harmony prevail.\n\nI shall take up my song,\nto offer my earnest praise.\n\nThe inscription for the Stele of the Central Palace of the Great Unity of the Song is hereby concluded.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "宋中太乙宫碑铭 经名：宋中太乙官碑铭。 宋代吕惠卿撰。 一篇。 底本出处：《正统道藏》洞神部记传类。 宋中太乙宫碑铭 朝奉郎知制诰兼侍读判国子监臣吕惠卿奉劝撰 熙宁四年，司天监建言，太乙五福之神，以七年关逢摄提格之岁，行临中宫，其名为真室，其分为京师之野，其祥为民康物阜。 太平之应，请立祠如故事。 天子可其奏，命将作监即国中之南而建宫焉，经始於四年之冬，而成於六年之春。 凡为三门七殿，分祠十太一与太岁之神，而五福居其中。 上为之制名，皆以承神之既休为义，而真室之殿，又亲书之。 其廊麻四壁，图百神之朝，天至於五帝日月星辰，而地至於五岳四渍，莫不咸在其位号。 尊卑服物同异与夫坛场之制，梼杞之仪，皆以太乙之学为本，而参用道家之说焉。 天子命有司具仪仗，将以今年冬至奉安神像於其宫，劫臣惠卿书碑以记其事。 臣伏玫《周礼·春官》：宗伯之职，典祀天神，其尊达於昊天上帝，其卑逮於司中司命，风师雨师而为礼，学者当之以星官之书，皆有着位。 而宗伯之属官，则有冯相氏，保章氏，掌会天位与夫封域分野以观天下之祆祥，而凡以神仕者，掌三辰之法以犹鬼神示之居，辩其名物而致之，而太祝掌六祝之辞，以祈福祥。 盖宗伯总其祀之典，冯相、保章氏主其变动之占，凡以神仕者图其居之所在，而太祝掌其祈，合而言之，皆礼官之事而已。 太乙之号，虽不经见，而历代史官，着其星在紫宫天一之南，以为天帝神也。 主使十六神，知其咎休所在之国，北辰之第二星最赤明者，乃其座也，而三台为天阶，太乙蹑之以上下。 史官之言星，虽不可尽玫，然其说皆有师承，其位皆可指数而，其占之效者亦众。 观其言太乙之尊如此，则昔之言天神之贵日太乙，其佐日五帝，以至主之以为郊，则非特亳人之方，，汉家之制而已。 盖礼官之事既以散亡，而冯相、保章氏之占，流而为日官式局之法，而道家之所以图其像，制其服物位号之差，坛场祷祀之法，殆得所谓凡以神仕者犹其居，与夫大祝祈福祥之遗意也。 今日官以为五福之神凡四十五年一徙宫，历中央四维，大约二百二十五年，而周则二百二十五年之问，必历中官矣。 而玫之既往，其应未必尽合，何也？ 窃尝譬之，天时者，节候也，人事者，种氛也，有天时之顺而无人事，犹节候虽应而不种氛，求其有获，不可得也。 有人事之修而无天时，犹种氛虽力，而节候异，求其有生，不可得也。 古之人以为天不人不因，人不天不成者，亦谓此耳，奚独至於太乙而疑之乎？ 臣观皇帝，粤自嗣服，改修政教，整齐吏方而法度之，行先立於府寺，兴举民事而利泽之，及首加於都畿，以至士被教育，兵足凛赐。 凡百劳来，又皆先於四方，而雨旸寒燠，莫不顺适，浮言不能摇其成，异意不能幸其失，岂惟人事，抑有天时之助也。 则真室之佑，其兆於兹乎？ 在太平兴国时，临黄室宫，其野为昊越，而太宗立祠於束南郊； 在天圣时，临黄廷宫，其野为梁蜀，而仁宗立祠於西南郊。 其意以谓天子以天下为家，夫苟在吾四海九州之内，则其福一也，岂有彼此之限哉！ ．瓦夫临中央以当四维之会，则其嘉休之应将讫於四海，非止天子之所居而已也，则其所以成之者，岂宜不广哉！",
      "translated_text": "**Inscription for the Taiyi Palace at Songzhong**\n\n*Title:* Inscription for the Taiyi Palace at Songzhong. Composed by Lü Huiqing of the Song Dynasty. One chapter.\n\n*Inscription for the Taiyi Palace at Songzhong*\nComposed by Minister Lü Huiqing, Gentleman for Court Service, Drafter of Imperial Edicts, Concurrent Reader-in-Waiting, and Supervisor of the Directorate of Education, in reverent compliance with imperial command.\n\nIn the fourth year of the Xining reign (1071), the Directorate of Astronomy memorialized that the deity of the Five Blessings of Taiyi, in the seventh year of its cycle—coinciding with the *sheti* year of the *Geti* epoch—would descend to the Central Palace. Its name was the True Chamber, its domain the capital’s hinterland, and its auspice the prosperity of the people and the flourishing of all things. As this heralded an era of great peace, they requested the establishment of a shrine in accordance with precedent. The Son of Heaven approved the memorial and commanded the Directorate of Palace Construction to erect a palace south of the capital. Construction began in the winter of the fourth year and was completed in the spring of the sixth year (1073). The complex comprised three gates and seven halls, with separate shrines for the Ten Taiyi and the Spirit of the Year, while the Five Blessings resided at its center. The emperor personally bestowed names upon them, all signifying the reception of the deities’ repose, and inscribed the name of the True Chamber Hall himself. The four walls of its corridors were adorned with murals depicting the court of the hundred spirits—from the celestial realm of the Five Emperors, sun, moon, and stars, to the terrestrial domain of the Five Peaks and the Four Seas—each occupying its proper rank and title. The hierarchy of vestments, the distinctions of ritual objects, the design of altars and sacred precincts, and the rites of prayer and sacrifice were all grounded in the teachings of Taiyi, supplemented by Daoist doctrine.\n\nThe emperor ordered the relevant officials to prepare the ceremonial regalia and, at the winter solstice of the present year, to enshrine the divine images in the palace. He further commanded this minister, Huiqing, to inscribe a stele to record the event.\n\nYour minister, bowing in reverence, reflects upon the *Rites of Zhou: Spring Office*, wherein the Minister of Rites is charged with overseeing the sacrifices to the celestial deities. The most exalted of these is the August Heavenly Thearch, while the humblest extend to the Directors of the Center and Fate, the Masters of Wind and Rain. Scholars, guided by astronomical texts, assign each deity a fixed position. Among the subordinate officials of the Minister of Rites are the *Fengxiang* and *Baozhang* officers, who observe the celestial positions and the terrestrial correspondences of the realm to discern omens. The *Fanshen* officers, who serve the spirits, are versed in the laws of the Three Luminaries, determining the abodes of ghosts and gods, distinguishing their names and attributes, and summoning them. The Grand Invocators are responsible for the six forms of prayer to invoke blessings. Thus, the Minister of Rites oversees the canons of sacrifice, the *Fengxiang* and *Baozhang* officers preside over divination based on celestial changes, the *Fanshen* officers map the dwellings of the spirits, and the Grand Invocators conduct the prayers. Taken together, these are all the duties of the ritual officials.\n\nThough the title *Taiyi* does not appear in the classics, historical records describe its star as lying south of the Celestial Unity in the Purple Palace, identifying it as the spirit of the Heavenly Thearch. It commands sixteen deities, discerning the fortunes and misfortunes of nations. The second star of the Northern Culmen, the brightest and reddest, marks its seat, while the Three Steps serve as the celestial staircase by which Taiyi ascends and descends. Though the astronomers’ accounts of the stars cannot be entirely verified, their theories derive from established traditions, their positions can be precisely located, and their prognostications have often proven accurate. Given the exalted status ascribed to Taiyi, it is evident that the ancient veneration of the supreme celestial deity as Taiyi, assisted by the Five Emperors, and the practice of worshipping it at the suburban altars, was not confined to the local customs of the people of Bo or the institutions of the Han dynasty alone.\n\nAs the duties of the ritual officials have since been lost, the divinations of the *Fengxiang* and *Baozhang* officers have devolved into the methods of the Bureau of Astrology. The Daoist depictions of the deities’ images, the distinctions in their vestments and ranks, and the rituals of altars and sacrifices likely preserve the remnants of the *Fanshen* officers’ mapping of the spirits’ abodes and the Grand Invocators’ prayers for blessings. Today, the officials regard the Five Blessings as deities who relocate their palace every forty-five years, traversing the central and four cardinal regions. Roughly every two hundred twenty-five years, they complete a cycle, during which they must pass through the Central Palace. Yet when we examine past records, their correspondences do not always align perfectly. Why is this?\n\nI venture a comparison: celestial timing is like the seasons, while human affairs are like sowing and reaping. Without human effort, even favorable seasons are like timely weather without cultivation—no harvest can be expected. Without celestial timing, even diligent labor is like sowing out of season—no growth can be achieved. The ancients held that Heaven does not accomplish without humanity, nor humanity without Heaven; this is what they meant. Why should we doubt this principle when it comes to Taiyi?\n\nI observe that since ascending the throne, the emperor has reformed governance and education, rectified the bureaucracy, and established laws and institutions in the capital. He has promoted the people’s welfare, extending benefits first to the capital region, then to the educated elite, and ensuring the military is well-provisioned. His efforts have encompassed all things, always prioritizing the four directions. Rain and shine, cold and heat have all been harmonious. False rumors cannot shake his achievements, nor can dissenting opinions exploit his shortcomings. Is this solely the result of human effort? Surely it is also aided by celestial timing. Thus, the protection of the True Chamber may well have manifested here.\n\nDuring the *Taiping Xingguo* era (976–984), the deity resided in the Yellow Chamber Palace, its domain the lands of Wu and Yue. Emperor Taizong established a shrine in the southeastern suburbs. During the *Tiansheng* era (1023–1032), it resided in the Yellow Court Palace, its domain the lands of Liang and Shu. Emperor Renzong established a shrine in the southwestern suburbs. The intent was that the Son of Heaven regards all under Heaven as his home. If a place lies within the nine provinces and four seas, its blessings are unified—how can there be boundaries of \"here\" and \"there\"? Now, as the deity resides in the Central Palace, at the convergence of the four directions, its auspicious repose will extend throughout the four seas, not merely to the emperor’s residence. Should not the means of its realization be all the more expansive?",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1239,
      "start_sentence": 0,
      "end_sentence": 34,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.51275086402893,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\宋中太乙宫碑铭.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "．必将推已施之仁而孚之於所未被，求未立之政而修之於所已行，使覆载之内，蒙泽如一，动植之类，赋生咸若，於斯时也，治成而礼乐议，诚至而天地察，观物大小以称德产之精微，比义上下以秩神明之位处，乃吾所以锡庶民之福，而逆三神之厘，其尤大者也。 而臣尚得待罪从官，以经术文字为职，则所当歌颂盛德者，又非独一二而已。 而是官之作，乃以属臣，其敢以固陋辞乎！ ．谨拜手稽首而献文曰： 浑沦一气，精官嘿兮。 环无初终，廓无域兮。 消息满虚。 悦谁测兮。 煌煌威神，兆太乙兮。 临制紫宫，位辰极兮。 陆降三阶，监万国兮。 大人占之，造为式兮。 推步变迁，发潜伏兮。 降祥啧陆，维五福兮。 循行四维，历真室兮。 四十五岁，宫一易兮。 谁其当之， 祚有德兮。 赫赫有宋，荒九服兮。 世哲相承，千百禄兮。 习安玩治，蛊将积兮。 笃生睿圣，起以饬兮。 政行四方，首京邑兮。 淫诐沮伏，终以立兮。 五气来叔，消薄蚀兮。 洒澹沈灾，膏卤培兮。 太乙之来，前可迩兮。 新宫奕奕，成不日兮。 仰模帝居，丽金碧兮。 太乙之下，安且宅兮。 天造人因，方两得兮。 成能成位，圣贤职兮。 敛时景福，重敷锡兮。 延及海隅，均动植兮。 燕寿两宫，后嫔择兮。 子孙皇王，世万亿兮。 礼具乐成，底平格兮。 臣将载歌，以申救兮。 宋中太乙宫碑铭竟",
      "translated_text": "Then must the emperor extend the benevolence he has already bestowed to those yet untouched, seeking unestablished governance to refine where it has already taken root. Thus, within the bounds of heaven and earth, all shall receive his grace as one; every living thing, plant and creature alike, shall be endowed with life in perfect harmony. At such a time, governance shall reach perfection and rites and music be deliberated; sincerity shall reach its utmost and heaven and earth take heed. One may observe the great and small of all things to discern the subtleties of virtue’s production, and arrange the ranks of the divine by comparing their merits above and below. This is how we bestow blessings upon the common people and align with the decrees of the Three Spirits—its greatest significance.\n\nYet I, though unworthy, remain in office, my duty bound to classical learning and literary composition. Thus, the praise I owe to such abundant virtue is not merely a trifling matter. And now, the task of composing this inscription has fallen to me—how dare I decline on grounds of inadequacy?\n\nWith reverence, I bow my head and kowtow to present this text:\n\nIn the primordial chaos, a single qi, the offices of essence silent.\nEndless its cycles, boundless its expanse.\nWaxing and waning, fullness and void—\nwho can fathom its depths?\n\nResplendent in majesty and spirit,\nit presides as the Great Unity.\nOverseeing the Purple Palace,\nits station at the Pole Star.\nDescending the three celestial steps,\nit surveys the myriad states.\nThe great ones interpret its signs,\ncrafting the models of governance.\nTracking its movements and changes,\nrevealing what lies hidden.\nBestowing auspicious omens, resounding in the nine lands,\nit dispenses the Five Blessings.\n\nTraversing the four directions,\npassing through the true chambers,\nforty-five years—\none palace shifts.\nWho shall be its recipient?\nBlessing rests upon the virtuous.\n\nRadiant is the Great Song,\nits dominion stretching to the nine provinces.\nWise generations succeed one another,\na thousandfold, a hundredfold in fortune.\nAccustomed to peace, complacent in governance,\ncorruption threatens to accumulate.\nThen was born one of profound wisdom and sagacity,\narising to set things right.\nHis governance spread to the four quarters,\nfirst in the capital.\nExcess and perversion were suppressed,\nultimately establishing order.\nThe Five Qi converged,\ndissolving decay and eclipse.\nWashing away disasters, calming deep afflictions,\nthe barren earth was enriched.\n\nThe coming of the Great Unity—\nits approach could be foreseen.\nThe new palace, grand and resplendent,\nwas completed in no time.\nModeled after the imperial abode,\nadorned in gold and jade-green.\nBeneath the Great Unity,\nit stands secure and well-settled.\nHeaven’s design and human endeavor—\nboth now fulfilled.\nTo accomplish and to uphold one’s station—\nthe duty of sage and worthy.\nGathering the blessings of the times,\nbestowing them anew.\nExtending to the farthest shores,\nequal for all living things.\nThe two palaces rejoice in longevity,\nthe empress and consorts chosen with care.\nSons and grandsons, emperors and kings,\nshall endure for ten thousand myriad generations.\nRites perfected, music complete,\npeace and harmony prevail.\n\nI shall take up my song,\nto offer my earnest praise.\n\nThe inscription for the Stele of the Central Palace of the Great Unity of the Song is hereby concluded.",
      "overlap_context": "ine in the southwestern suburbs. The intent was that the Son of Heaven regards all under Heaven as his home. If a place lies within the nine provinces and four seas, its blessings are unified—how can there be boundaries of \"here\" and \"there\"? Now, as the deity resides in the Central Palace, at the convergence of the four directions, its auspicious repose will extend throughout the four seas, not merely to the emperor’s residence. Should not the means of its realization be all the more expansive?",
      "start_char": 1239,
      "end_char": 1755,
      "start_sentence": 35,
      "end_sentence": 72,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.30780816078186,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\宋中太乙宫碑铭.txt",
        "category": "记传类"
      }
    }
  ]
}