{
  "source_id": "宫观碑志",
  "source_file": "chunked_daozang\\宫观碑志.json",
  "total_chunks": 13,
  "total_original_chars": 13604,
  "total_translated_chars": 84758,
  "total_translation_time": 433.7352600097656,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\记传类\\宫观碑志.txt",
    "category": "记传类"
  },
  "full_translation": "**Stele Inscriptions of Daoist Abbeys**\n\n**Title of the Text:** *Inscription on the Brick Stele of the Two Combined Abbeys*\n**Authors:** Tao Gu of the Song Dynasty, Zheng Ziping of the Jin Dynasty, et al.\n**Volume:** One\n**Source Text:** *Daoist Canon of the Zhengtong Era*, \"Records and Biographies\" section under the *Dongshen* Division.\n\n---\n\n### **Inscription on the Restoration of the Queen Mother’s Abbey at Huishan in Jingzhou**\n**Composed by:** Tao Gu, Hanlin Academician and Director of the Bureau of Appointments within the Ministry of Rites\n\nThe *Rites of Sacrifice* states: *\"That which establishes the Dao among the people shall be venerated.\"* How vast is the system of rites that distinguishes the four directions! For spirits whose duties offer enduring instruction, how could their worship be neglected?\n\nAccording to the *Erya*: *\"The lands of the Ji and Zhu tribes, the northern gate, the Queen Mother of the West, and the regions beneath the sun are called the Four Wastes.\"* The deeds of the Queen Mother have long been recorded. Her name appears in official annals; her story is no mere strange tale.\n\nIn the fourth generation of the Western Zhou’s mandate, there was a ruler named King Man, who reigned for fifty years. He rode eight steeds to the Jasper Pool, raised a goblet offered by the Queen Mother, and sang the *\"Yellow Bamboo\"* ode. In the fourth generation of the Western Han’s mandate, there was an emperor named Liu Che, who also reigned for fifty years. On the seventh night of the seventh month, he met the Queen Mother at Sweet Springs Palace, where her chariot descended, and he was presented with immortal peaches.\n\nWhen King Mu of Zhou journeyed to the western limits, he watered his horses at the Tong River, drank the blood of magpies, and traversed the land of the Giant Sou. He then ascended Mount Yi, as recorded in the *\"Biography of King Mu\"* from the Ji Tombs. When Emperor Wu of Han prayed at the sacred precincts, he sacrificed at Yong, visited the court of Zhou, and erected the Pavilion of Feilian to gaze upon the Dark Garden. Thus, the *\"Shangzhi\"* hymn of the *Music Bureau* includes the *\"Turning Melody.\"*\n\nAlas! The spirit of the Xiang River plays the zither—these were the two consorts of Emperor Shun. The star of Huang Gu is the Weaver Girl of the Milky Way. Though they appear in the *Songs of Chu*, they are still enshrined in the classics, paired with solemn temples. With flutes and drums, sacrificial vessels and canopies, they receive offerings in the four seasons. With sacrificial animals, jade, and silk, they partake in the worship of the hundred spirits.\n\nHow could the Queen Mother compare? She is the Ninefold Radiant Saintly Maiden, governing the Supreme Perfected of the Three Pure Realms. She wears a jade sword that divides the light and rides a phoenix that sheds its feathers. The Eight Lang Immortals regulate her music, and nine-colored striped unicorns draw her chariot. At her whistling and singing, the sea gods dance; at her glance and gesture, the mountain spirits hasten. She assists the Five Emperors in the Golden Towers and adjudicates the Three Officials by the Crimson River. Her rank crowns the Upper Palace, and her blessings flow to the lower earth. Thus, the Abbey of the Queen Mother at Huishan is no unorthodox establishment.\n\nYet as the years of worship receded, the beams and eaves decayed. The altar songs faded, and brambles overgrew the desolate courtyard. The wells fell into ruin, and birds vanished; only crows and kites screeched over ancient steles. Yet misfortune does not last forever—its remedy lies in human effort.\n\nThe Grand Preceptor, the Duke of Qinghe, received the sacrificial meat and raised his banner, thrice governing Anding. His military achievements and governance are recorded in the annals. This land presses upon the upper reaches of the Jing River and controls the right flank of the Western Rong. Its soil suits millet and wheat, and its people are skilled in archery and horsemanship. Govern it with the Dao, and the wind will lay the grass flat; rule it without principle, and even water will capsize the boat. The loss of central authority cannot be tolerated for a single day—how much more so for the three garrisons!\n\nIn the spring of the *wuchen* year, the second month, the Duke entered the court bearing the jade tablet. He hastened to the capital, where the Son of Heaven lit courtyard torches to receive him, performed the *\"Grand Xia\"* music to honor him, sat by the palace window to soothe his heart, and bestowed upon him a grand ax and ornate reins. After the rites were completed, he received three edicts and returned to his former post.\n\nUpon resuming his duties, he came to pay homage at the sacred abbey. Moved by solemn reverence, he felt as though his gaze met a response. He commanded the overseers to gather workers and undertake repairs. They cleared the creeping vines and weeds from the courtyard, planting fine trees. They replaced the crumbling eaves of the corridors, constructing grand beams. The vermilion and azure adorned her celestial form; the kingfisher-feather curtains enhanced the elegance of her canopy. The painted rafters seemed to sigh at the distance of the western lands, while the water pavilion overlooked the long river, as if marveling at the shallowness of the eastern sea.\n\nWith the attendants now solemn and the sincerity complete, what need was there for the Jade Maidens to cast arrows into the pot, gazing at the Bright Star on Mount Taihua? Or for the Maiden of the Jasper Terrace to appear in dreams, scattering evening rain on the Terrace of the Sun? By combining the words of the young woman and the youth, may the beauty of the Supreme Perfected be fully expressed.\n\nAs for myself, my learning does not reach antiquity, and my talent falls short of the times. Though I have long served among the literary ministers, drafting edicts without merit, and have forced myself to peer through the Vermilion Phoenix Window, stealing peaches leaves me ashamed.\n\nThus, I respectfully offer this eulogy:\n\n*At the ruins of Kunlun,*\n*Beneath its towering peaks,*\n*With disheveled hair and a crown of feathers,*\n*Tigers and leopards attend her.*\n*Is it she? Is it not?*\n*Marvelous, the Queen Mother!*\n*Her chariot summoned at the Red Terrace,*\n*The seventh night her appointed time.*\n*Phoenix carriages and radiant swords,*\n*Her gaze so bright, her bearing so fair.*\n*Dwelling in the Dark Capital—thus it was,*\n*Descending to the Han Palace—thus it was.*\n*How manifold her numinous powers,*\n*How wondrous her transformations!*\n*Consult the* Mountain Classic *and* Bamboo Annals—\n*Both preserve her ancient deeds.*\n*At the mountain’s summit, by the water’s edge,*\n*Jade libations and golden zithers offered.*\n*Where have the drifting white clouds gone?*\n*The* Yellow Bamboo *lies broken, not a branch remains.*\n*I caress the old stone of Huibi Mountain,*\n*Recording the immortal shrine by the Jing River.*\n\n---\n\n### **Inscription on the Abbey of Perfected Dao Attainment of Chongyang**\nWest of the capital Jingzhao, in the Zhongnan Mountains, lies a village called Nanshi. Within it stands the Abbey of Perfected Dao Attainment of Chongyang.\n\nIn the early years of the *Dading* era, the Patriarch of the Quanzhen School, the Perfected Chongyang, first awakened to the Dao. He dug a pit for himself, piling the earth a few feet high in the shape of a horse’s mane, naming it the *\"Tomb of the Living Dead.\"* He planted four pear trees and eight crabapple trees around it. When asked the reason, he replied: *\"When the true wind of my Dao spreads widely in the future, reaching the four directions and eight boundaries without exception, I want people to know that it all began from this one tomb.\"*\n\nAfter two years, he moved to Liujiang. Later, three to five disciples built a thatched hut to guard the site. In the early years of the *Zhengda* era, the Perfected Chongyang, Zhou Quandao, came from Youzhou to offer sacrifices at the tomb of the Patriarch in Liujiang. Suddenly recalling the place where the Patriarch had cultivated, transformed, and attained the Dao, he felt it could not be left to decay. A sense of indignation arose in his heart to restore it, which he could not suppress—it was as if a spirit had moved him.\n\nOne day, a man invited him to a vegetarian feast. Upon inquiry, Zhou learned that the man was a Daoist from this very hermitage, so he accompanied him back. The Daoist community begged to borrow his influence to promote their cause. Struck by how closely their aspirations aligned with his own, Zhou gladly agreed and added, *\"In the future, I shall reside here.\"*\n\nAfter the Great Dynasty’s revolution, Daoists from all directions, wishing to repay their origins and return to their beginnings, planned to transport timber and reclaim the land. In the year *Yiwei*, by decree of the Supreme Master of the Pure Harmony, Perfected Yin, and the Teaching Master, Perfected Li of True Constancy, along with a memorial from Prefectural Governor Lord Tian, Master Li Zhiyuan of Profound Emptiness was commissioned to lead the Daoist community in grand reconstruction efforts. All labored diligently, measuring, building, and carving, their fervor unmatched by drumbeats. Three halls were erected: the Hall of the Boundless, the Hall of Radiant Dawn, and the Hall of Enlightenment. Five chambers were built: the Hall of the Three Masters, the Hall of the Divine Officials, the Hall of Gazing Light, the Hall of Morning Clarity, and the Hall of Empty Whiteness. Kitchens, storehouses, stables, abbot’s quarters, guest rooms, eaves, doors, windows—all were adorned in gold and azure, gleaming with fresh splendor. The subordinate cloisters, the Quanyang Temple at Sheliu and the Cultivation Temple at Wangguo Village, along with the monastery’s properties, were recorded separately on stone.\n\nYet some tasks remained incomplete. Zhang Zhigu and other disciples of Perfected Quanyang Zhou recalled their master’s words from the *Zhengda* era, when he had accepted the feast: *\"In the future, I shall reside here.\"* They deemed this a silent decree of Heaven, not to be defied. Thus, they raised over a thousand strings of cash, pooling their sincerity and strength to expand the site day by day, month by month, intending it as a place to pray for the nation’s longevity and blessings. Its future growth seemed boundless.\n\nIn the first year of *Xinhai*, the year Emperor Xianzong ascended the throne, an imperial edict summoned the Teaching Master, Perfected Li of True Constancy. The Emperor personally bestowed upon him a golden incense casket, five thousand taels of silver, and a golden talisman, commanding him to perform the imperial rites of sacrifice at the sacred mountains and rivers. All ceremonies prescribed in the ritual canon were meticulously observed. The following spring, on an auspicious day in the second month, imperial incense was presented to fulfill the Emperor’s mandate. Upon completion of the rites, the monastery was elevated to official status by imperial grace—a designation that began in the year *Renzi*.\n\nMaster Li of Profound Emptiness was a disciple of Quanyang and a great-grandnephew of Perfected Ma of Cinnabar Yang. Among Quanyang’s five foremost disciples, he was the eldest. The second was Master Zhang Zhiyuan of Cave Emptiness, who presided over the White Cloud Temple in Zoucheng, Dongping, and ordained over a thousand disciples, with hermitages and temples to match. The third was Master Liang Shouyi of Illuminating Origin, who oversaw the Jade Peak Temple in ancient Bin, the very monastery where Quanyang had once resided. The fourth was Master Jia Shouzhen of Beyond Clouds, and the fifth was Master Zhang Zhigu of Pure Harmony, who now succeeded Master Li in administering the main temple.\n\nThis spring, in the second month, the temple’s overseer, Wang Zhiyuan, traveled to the Great Everlasting Spring Temple in Yanjing to report to the Teaching Master, Perfected Li of True Constancy, seeking to record the full history of the site and inscribe it on stone. The Master commanded me to refine the text. At nearly eighty years old, I had long grown weary of brush and ink, but sensing the request could not be refused, I arranged the facts in order.\n\nAs for the visible traces of the Patriarch, Hu Zijin of Jade Peak had already composed a eulogy, Mao Shouda of Pingshui had written a preface, and Wang Zizheng of Beiping had penned a biography. The four characters *\"Tomb of the Living Dead\"* were in the hand of Academician Zhao Xian of Leisure, and the Teaching Master, Perfected Li of True Constancy, had added a colophon—all of which were carved on stone. The deeds of Perfected Quanyang Zhou and Masters Li of Profound Emptiness and Zhang of Cave Emptiness in life were also recorded in Qin Lili’s *Records of the Golden Lotus* and *Records of Mist and Rosy Clouds*, while the Patriarch and subsequent masters were documented in the *Precious Treasury of the Mysterious Capital*. Thus, there is no need for repetition here.\n\nThough in my youth I pursued advancement, I was distracted by the pursuit of merit and profit, leaving no time for foundational studies. Now, over thirty years later, my heart has found peace in simplicity and stillness, unbound by worldly teachings. Turning my gaze inward and listening to the silence, I have glimpsed the wondrous Dao of utmost emptiness, understanding the flow and blockage of its currents—such insights arise from the interplay of fate. The Dao has no beginning before time nor end after it. Though heaven and earth are vast, they do not lie beyond its bounds; though an autumn hair is small, it relies on the Dao to take form. How could fate be confined by numbers? It is merely a matter of whether the Dao is practiced or abandoned in the world.\n\nAs the *Book of Changes* states: *\"If it is not the right person, the Dao will not manifest in vain.\"* And again: *\"To make it spiritually luminous depends on the person.\"* Thus, when Heaven intends to bestow this Dao upon humanity, within the great transformation, it first sends forth a figure of unyielding integrity, upright and steadfast, unmoved by human desires—one who can serve as a model for others. Such was the advent of our Patriarch. His talents were unmatched, surpassing all others. Upon encountering a perfected being who enlightened him, his mind expanded, becoming vast and penetrating, roaming beyond the material world. Yet he could also withdraw into seclusion, using this place as the *\"Tomb of the Living Dead\"* to nurture himself for two years. His divine marvels, his interactions with people, his salvation of the world—each radiance connected seamlessly, unparalleled since the opening of heaven and earth. If he had not been in harmony with the hidden principles of the cosmos, how could he have achieved this?\n\nConsider the case of Immortal Everlasting Spring. Long ago, when Yan Yuan was about to transform the ruler of Wei, Confucius feared that though his virtue was profound and his trustworthiness evident, the ruler’s *qi* might not be receptive, and though his reputation was unchallenged, the ruler’s heart might not be moved. Thus, he taught Yan Yuan the *\"fasting of the mind,\"* so that wherever he passed, none would remain unchanged. Wei was but a small feudal state in the Spring and Autumn period. According to the *Royal Regulations*, a duke or marquis governed a hundred *li* square. Calculating upward, a thousand *li* square would encompass a hundred such domains, and ten thousand *li* would encompass a hundred of those. The empire’s territory spans ten thousand *li*—the disparity in grandeur and scale between it and Wei is evident.\n\nThe Emperor, moreover, resided beyond the deserts of the tens of thousands of *li* to the north. Yet once the imperial edict arrived, the National Preceptor Changchun rose at once to answer the summons—like water flowing toward the moist, like fire inclining toward the dry, a spontaneous resonance devoid of even the slightest trace of self-serving calculation. When he arrived, their exchanges were marked by joyous accord, wholly satisfying the Emperor’s intent. Thereupon, from the very ground where his virtuous inclinations first manifested, he guided the Emperor in practicing benevolence and filial piety, in curbing desires and cultivating the self, in employing the worthy and cherishing the people, in spreading virtue and bestowing kindness, in treasuring life and abhorring killing, and in aligning with the will of Heaven. The Emperor, in turn, received his counsel without doubt.\n\nOne may well imagine: over the course of forty or fifty years, how countless were the lives preserved and the captives freed through his influence? The great flourishing of the Vajra-True Wind was witnessed by all. Yet our immortal, dwelling in tranquil seclusion where no merit seemed apparent, has nonetheless been credited by the world with true achievement—this could only be the work of one who roams beyond the realm of things, whose every movement harmonizes with Heaven.\n\nHere, the profound intent of the ancestral master’s planting of the four pear and eight crabapple trees finds its confirmation. Now, in celebration of the construction of this temple and entrusted with the task of recording it, I set forth these words, that those who study the Dao may know: from the ancestral master onward, all who have received the transmission—whether in motion or stillness—act in accord with Heaven, not man. Should one adulterate it with the human, not only will no accomplishment arise, but the losses incurred will be great indeed.\n\nWhat, then, is Heaven?\n\n\"Simply sincerity—nothing more. Sincerity is the fasting of the mind. The ancients cultivated the sincerity within their breasts to respond to the sentiments of Heaven and Earth, and thus Heaven, Earth, humans, and spirits never opposed them—was this not because they had grasped the pivot of response?\n\n*Stele Inscription for the Grand Yellow Register Offering of All Under Heaven*\nComposed by Feng Zhiheng, Grand Master of the Teaching, Administrator of the Daoist Clergy, and Imperial Commissioner for the Propagation of the Mysterious and Tranquil\n\nThe profound divine mechanism latent within Emperor Xianzong’s inner being—how vast its application! Manifested as martial prowess, he has become invincible throughout the realm; expressed as civil governance, he orders the lofty and profound with mastery. The operation of this mechanism takes non-action as its essence, the Dao as its gateway, and benevolence, sageliness, centrality, uprightness, and luminosity as its ultimate return. In times of no event, it seals the myriad transformations and retreats into concealment—even if named the mirror of Heaven and Earth or the looking-glass of the ten thousand existences, its depths remain unfathomable. Yet when it responds to the world, it pours forth like a boundless spring, timely and inexhaustible. Vast as Heaven, deep as the sea, when transformed into virtue, it becomes an immeasurable expanse of depth and generosity, so that not a single being remains untouched by its moistening grace.\n\nIn harmonizing virtue with the Two Modes and aligning sequence with the Four Seasons, in the affairs of serving Heaven by preceding it—such manifestations emerge in layered succession, too numerous to recount in full. Let us take but one instance from among the myriad affairs of a single day.\n\nOn the seventeenth day of the tenth month in the winter of *guichou*, an edict arrived summoning Daoist Master Wang Zhitan, Director of the Bureau for the Cultivation of Perfection, to inquire about the methods for ensuring bodily health and longevity. Zhitan responded with a few words on nurturing life, then, seizing upon the moment when the emperor’s benevolent intent became apparent, he spoke at length in accord with his sovereign’s inclinations, saying: \"The concerns of these withered recluses of the mountains and forests pertain only to their own affairs—they are not the urgent matters of the Son of Heaven. Heaven and Earth are the parents of the ten thousand things, and humans are the most spiritually endowed among them. Yet the ruler cannot govern alone, so he establishes a sovereign. The emperor, acting on Heaven’s behalf to govern the people, should promote the greatest benefits and eliminate the greatest harms to fulfill Heaven’s will. Then the blessings and longevity bestowed by Heaven will follow as surely as an echo answers a sound or a shadow follows a form.\n\nIn past years, you swept away corrupt policies and gave the people a fresh beginning, and they have already received your bounty. Yet since the founding of our dynasty, through warfare, famine, and the uneven application of punishments, countless souls have suffered violent deaths, their spirits trapped in the dark prisons of the underworld, unable to escape. How can their number be reckoned? I humbly beseech Your Majesty’s sagely compassion to select masters of the Dao, follow the Mysterious Rites of the Yellow Register, and conduct a universal deliverance, so that the suffering souls in the nether realms may depart from their dark paths and all attain liberation and ascent. This would be the greatest of all benefactions.\"\n\nThe emperor praised and accepted his words. That very day, he dispatched dozens of imperial envoys to all regions by post-horse, each charged with conducting rites of deliverance in their respective domains. The academician Zhahuer, the *boyi chi* Alian, and Director Wang Zhitan traveled by relay carriage bearing secret instructions to the Great Everlasting Spring Abbey in Yanjing. There, the emperor specially commanded Li Zhichang, Perfected of True Constancy and Supreme Virtue, Mysterious and Profound, to preside over the offering and serve as the Great Master of Deliverance. The *duan shi* official Yalawaichi Buzhier oversaw the preparations, while the academician Zhahuer and three other envoys served as ritual officers. Along the way, they selected pure and lofty masters of the Dao to establish the Grand Yellow Register Offering of All Under Heaven, with three thousand six hundred altar stations.\n\nFrom the ninth to the sixteenth day of the third month in the spring of *jiayin*, for seven days and nights, the authorities suspended all legal proceedings, the markets and wells forbade slaughter, and the imperial treasury provided five hundred eighty taels of gold, three thousand eight hundred taels of silver, and a thousand bolts of colored silk for the requisite ritual gold and silk offerings. Incense, oil, candles, plum blossoms, sandalwood, aloeswood, dragon’s brain, and *jiangzhen* were prepared for the sacrificial rites. All other expenses were drawn from the imperial storehouses, without troubling the people. An additional fifty taels of silver notes were issued to cover any shortfalls.\n\nNine secret memorials and three jade tablets were inscribed in the emperor’s own hand. Ritual officers and envoys oversaw the proceedings, while Daoist clergy and commoners, with banners and ceremonial guards, welcomed the offerings from the Gate of Communing with the Mysterious to the altar site.\n\nThe emperor, as a ruler who upholds and preserves the Dao, first offered prayers for his imperial ancestors, the sagely departed, and the spirits of his kin—those who have already returned to the Purple Palace, ever gazing upon the sun of wisdom, and those who stand ranked upon the immortal steps, eternally protecting the imperial domain. Extending to those who died in battle, perished as captives, or suffered unjust execution, whether their spirits had claimants or not, all were regarded with equal benevolence, none abandoned.\n\nSome were loyal ministers and righteous knights who gave their lives for their lords, while others were rulers of small states who, unaware of Heaven’s mandate, violated the five prohibitions and brought upon themselves the punitive expeditions of rebellion. By ordinary standards, these two groups would be deemed irreconcilable enemies. Yet the emperor declared: \"Amid the turmoil of warring factions, how many were wronged in death? In the vastness of a sage’s governance, who is not my subject? I cherish them as deeply as a father cherishes his children, mourning those who perished unjustly. How could I, having gained the realm, bear grudges against my fellow hunters?\" Thus, all who had sunk into darkness were gathered into the deliverance.\n\nThis is an undertaking no emperor of antiquity ever attempted—indeed, not only did they never attempt it, but the power of their spiritual resonance falls far short of this. How can this be demonstrated? In ancient times, Yu convened the feudal lords at Mount Tu, where ten thousand states presented jade and silk. By the standards of the *Royal Regulations*, a lord’s domain spanned a hundred *li*, and a royal domain a thousand *li*—thus, a thousand-*li* domain would encompass a hundred hundred-*li* domains. Yet the gathering at Mount Tu represented only a ten-thousand-*li* realm. Our dynasty commands a territory of a million *li*, its power a hundredfold greater than that of the ancient Son of Heaven. Now, in performing this deed unparalleled in imperial history, the blessings for the living are self-evident. Even among the living, within each person’s circle of kin, teachers, and friends, those who suffered unjustly during four or five decades of warfare and remain trapped in the dark prisons—who among them has not received this grace?\"\n\nHow could mortal hearts, unlike wood or stone, remain unmoved within? Once stirred within, these sentiments took form in speech, and all proclaimed: \"Great is the Emperor’s virtue—it is the virtue of Heaven and Earth! His heart is the heart of Heaven and Earth! This marvel of divine mechanism, in harmony with the concordant qi, operates in perfect exchange. Through it, the Supreme Lord reaches the Three Clarities, pervades the Six Directions, and unites the spirits within and without. In the realm of the soundless and scentless, all flows and merges, naturally summoning one another, coalescing into oneness—what could remain unfulfilled?\n\nThe Great Master of the Lineage, Perpetual Perfection Realized Man Li, led five thousand gold-crowned and cloud-robed, star-crowned and purple-vested practitioners who ascended the altar in reverence. All were pure, lofty, and unsullied, deeply versed in esoteric scriptures, strictly observing the fasts and rituals of the Dao. Beneath the altar, the officiating ritual masters and the dynasty’s senior ministers witnessed their essence as utterly authentic, free from the slightest trace of human artifice. Augmented by the Dao’s compassionate workings, which conceal its use to manifest benevolence, since the eras of Dragon Han and Crimson Clarity, these deeds have been recorded in the Three Registers. They excel in saving people without abandoning a single one, in saving things without discarding a single thing. Thus, the true wind and wisdom-sun inspire and illuminate, dispelling darkness in the deepest chambers and reviving spring in frozen valleys. Every corner flows unimpeded, allowing those long mired in obscurity to bathe in hidden blessings. At the root and in their very nature, radiance reflects radiance, each illuminating itself. Should any remain unenlightened, the awakened guide the yet-to-awaken, passing clarity from one to another, emerging from one state to enter another, together beholding the manifold wonders—none sighing as if left behind.\n\nThe merit is towering, spanning from the depths below to the heights above—how could brush or tongue ever capture it? On the day of the welcoming rites, the Great Master presiding over the ritual, along with the officiating officials and all those who prepared the ceremony, commanded that this event be recorded to glorify the Emperor’s unparalleled virtue.\n\nI reflect: among the Four Great of the world, the King occupies one—this is the subtle teaching of the Daoist scriptures. Looking up and down, we discern the causes of the hidden and the manifest, life and death. Heaven and Earth establish their positions, and the Sage fulfills their potential—this aligns with the words of the *Appended Judgments* of the *Book of Changes*. The Sage’s Dao, vast and overflowing, nurtures the myriad things and ascends to the heights of Heaven—this is the language of the *Doctrine of the Mean*. All these draw upon the marvel of divine mechanism, expanding it to its fullest, progressing from the subtle to the manifest, until virtue and grace fill Heaven and Earth, and numinous radiance extends across the Four Seas.\n\nNow, this act of universal salvation—encompassing both the living and the dead, embracing all without distinction—surpasses the utmost benevolence of former kings a hundredfold. It originated from heeding a single word from the Daoist monk Zhi Tan, and was executed without hesitation, surging forth like the boundless Yangtze and Yellow River, irresistible in its force. Could this have been achieved without a foundation of utmost sincerity, a principle of unceasing cultivation in the art of shaping and aiding all things?\n\nThe imperial foundation stands firm, the Sage’s longevity boundless. With Heaven’s protection and the people’s support, the prayers of the ritual officials for blessings are already fulfilled. Bowing deeply, I compose these words:\n\nAmong the Four Great of the world, the Emperor occupies one.\nThe marvelous workings of divine mechanism, though hidden in secrecy,\nEmerge as pure and unyielding, manifesting as the virtue of loving the people.\nSome are rescued from drowning,\nOthers are raised to the realm of longevity.\nOverflowing and all-pervading,\nIt fills the Four Seas.\nBeyond such assistance,\nUnceasing sincerity remains.\nEver mindful of the lost souls,\nWhose grace has not yet reached them,\nHe pondered this day and night,\nUnable to rest or eat.\nHe inquired of the feathered ones,\nWho replied: \"Rely on the power of the Dao.\"\nDelighted by this counsel,\nHis countenance brightened.\nHe dispatched chariots in all four directions,\nEach to their respective regions.\nA great ritual for all under Heaven,\nTo urgently deliver and save.\nIn the Jade Palace of Yan,\nImperial decrees flowed in secret.\nSpirits converged in hidden communion,\nLike wind and tiger, cloud and dragon.\nAll provisions and expenses\nWere granted with exceptional generosity.\nThe lineage masters and Daoist practitioners,\nSincere and reverent,\nConducted the rites and offerings,\nThe altar rites lofty and solemn.\nThe ritual officials and senior ministers\nMaintained solemn demeanor.\nTheir qi and will were as if divine,\nTheir persons clear and bright.\nVital essence radiated outward,\nHarmonious qi accumulated within.\nThrough this, the Sage’s grace was proclaimed,\nAnd the netherworld merged with the True Void.\nThe awakened and the yet-to-awaken,\nOnce enlightened, follow in turn.\nIf one can turn their light inward for but a moment,\nThey may behold the boundless wonders.\nFor the dead, this is a stroke of fortune finer than a needle’s point,\nTruly a once-in-ten-thousand-kalpas opportunity.\nThese verses record the Emperor’s marvelous workings of divine mechanism.\n\nThis stele commemorates the reconstruction of the Hall of the Supreme Ultimate at the Palace of Great Clarity in Bozhou.\n\nComposed by Minister Wang Que, Hanlin Academician, Drafter of Edicts, and Compiler of the National History, by imperial command.\n\nWhen the present Emperor was still a prince in his fiefdom, he revered and honored the Mysterious Teachings, intending to restore the Palace of Great Clarity. In the year *jisi* (1259), he issued an edict forbidding the people from gathering firewood and ordered that military envoys not be allowed to stay overnight, lest they hinder the construction. In the second year of his reign, he specially issued an imperial rescript, reaffirming the earlier decree. In the fourth year, he dispatched Perpetual Perfection Realized Man Xiao Jushou and the attendant Helasi, commanding the Academy of Scholarly Worthies to compose a prayer text and prepare the ritual offerings for the sacrifice. In the fifth year, with the Hall of the Supreme Ultimate completed, Zhang Zhijing, the Successor of the Ever-Spring Teaching and Perfected One of Sincerity and Clarity, along with Left Minister Zhang Wenqian and Chamberlain Liu Chengli, memorialized the throne, requesting that a stele be erected to record the event. The Emperor assented and ordered the court scholar Wang Que to compose the inscription.\n\nI, having received this command, dare to bow deeply and speak thus: The Most High Lord Lao never fails to appear in any age, nor is he ever unvenerated in any era. In the *gengchen* year of King Wu Ding of Yin, he was born in Lai Xiang of Ku County, having gestated for eighty-one years. Endowed with seventy-two marks of perfection, he was called \"Laozi\" for his hoary hair and took the surname Li from the plum tree. His transformations of name and title, his numinous traces and sagely deeds, have been recounted in detail by earlier worthies—I dare not clutter this inscription with redundant words. Yet the reverence shown by former dynasties and the transmission by later generations may still be worth recounting.\n\nThe Qin burned the *Odes* and *Documents*, while the Han mingled hegemonic rule with the Dao. Though the numinous palace revered and honored him, the origins of its founding remained unrecorded. Not until the eighth year of *Yanxi* in the reign of Emperor Huan of Han did the emperor dream of Lord Lao descending into the palace courtyard. He twice dispatched the Palace Attendant Zuo Guan to the shrine to offer sacrifices, setting up an ornate canopy and employing the music of the suburban rites to heaven. He then ordered Bian Zhao, the Chancellor of Chen, to compose and inscribe an account.\n\nIn the sixth year of *Kaihuang* under Emperor Wen of Sui, an edict commanded Yang Yuanjiu, the Prefect of Bozhou, to investigate the ancient site and construct palace halls. He urged the Palace Secretary Xue Daoheng to compose the *Ode to the Shrine Courtyard*. The Tang, tracing their lineage, honored him as the Sagely Ancestor. In the first year of *Zhenguan* under Emperor Taizong, the palace was vigorously repaired, and fifty households were assigned to maintain its cleanliness. During the *Qianfeng* era of Emperor Gaozong, the emperor personally visited the Daoist palace, posthumously bestowing the august title of *Supreme Virtue Emperor of the Mysterious Origin*. The halls, altars, and structures were all ordered to be renovated, with a prefect and vice-prefect appointed to oversee seasonal offerings.\n\nIn the third year of *Kaiyuan* under Emperor Xuanzong, after the eastern pilgrimage to Mount Tai, the emperor returned to pay homage at the old residence. He personally inscribed the *Dao* and *Virtue* classics and had them carved into stone. In the twentieth year, the emperor composed the *Rainbow Skirt and Feathered Robe Dance* and the *Purple Tenuity and Eight Trigrams Dance* as offerings. In the second year of *Tianbao*, an edict renamed the Purple Ultimate Palace of Qiao Commandery as the Supreme Clarity Palace. In the fourth year, the emperor personally visited and composed the *Descending Perfection and Summoning Immortals* and *Purple Tenuity and Sending Forth Immortals* melodies for welcoming and sending off the deities. He replaced the prayer tablets with blue-green petitions, signing them as \"the succeeding emperor, your subject so-and-so,\" and ordered the officials to establish this as a fixed ritual.\n\nIn the seventh year of *Taihe* under Emperor Wenzong, the palace suffered damage from floods, and the emperor urgently appointed Li Cheng, the Military Commissioner of Xuanwu, to serve concurrently as the Superintendent of the Supreme Clarity Palace. Gradually, repairs were made, and the palace was restored to its former beauty. In the first year of *Jianlong* under Emperor Taizu of Song, envoys were dispatched to the shrine. In the fourth year of *Chunhua* under Emperor Taizong, construction of the palace halls began, and by the first year of *Zhiming*, the work was completed. An edict ordered He Meng, the Vice Director of the Bureau of Waterways, to compose an inscription. Thereafter, eunuchs were exclusively appointed to oversee the site.\n\nIn the fifth year of *Xianping* under Emperor Zhenzong, palace attendants were sent to undertake major renovations, and additional guards were assigned. In the second year of *Jingde*, gathering firewood in the four directions was prohibited. In the fifth year of *Dazhong Xiangfu*, the Minister of Revenue Ding Wei was sent to offer reverence on the emperor’s behalf. In the sixth year, the emperor personally visited, and in the seventh year, he returned to present the imperial charter and seal, bestowing the august title of *Supreme Origin and Perfect Virtue Emperor*. In the fifth year of *Shaosheng* under Emperor Zhezong, Yu Lu, the Prefect of Bozhou, reported various auspicious signs. Envoys were dispatched to offer thanksgiving sacrifices, and an edict commanded the Circuit Transport Commissioner to repair any dilapidated palace structures as needed.\n\nIn the first year of *Chongning* under Emperor Huizong, an edict ordered the Hanlin Academician Zhang Shangying to compose a record to fulfill the intentions of Emperor Zhezong. Through successive reigns of the Jin dynasty, extraordinary honors were repeatedly bestowed. Tens of thousands of *mu* of fertile land were granted to Daoist priests, exempting them from taxes and corvée. Even today, farmers and villagers still speak of it. These are but outlines of how former dynasties revered him, providing later generations who turn to the Dao with material for reflection.\n\nAs for those who transmitted his teachings: after the Blue Ox journeyed west, Yin Xi earnestly entreated him, compelling him to compose the five thousand words. He spoke of \"pure contention and non-action,\" of \"not contending and not shining,\" declaring that \"fine weapons are inauspicious.\" He likened governing a state to cooking a small fish, warned that galloping and hunting drive men mad, and taught that kings and dukes should style themselves as \"solitary\" and \"unworthy.\" By applying these principles to pacify the realm, no resources would remain untapped. As for rectifying the mind and cultivating the self, the two classics contain all that is needed—those who seek will find more than enough.\n\nThe patriarchs transmitted the *Dao and Virtue*, with four auxiliary texts following in succession, all adhering to the ancient path. Thus emerged the books *Cavernous Numinosity*, *Penetrating the Mysterious*, *Embracing the Void*, and *Southern Florescence*. As the age declined and customs grew shallow, heterodox doctrines arose alongside them. Some distorted them into illusions, while others let them drift into strange and uncanny practices.\n\nYet Heaven had not yet abandoned this Dao. In recent times, the Quanzhen school emerged, its adherents serene and steadfast, moving in accordance with the old tracks. Wang Chongyang received the transmission from Perfect Yang and Pure Yang, nurturing its roots and entrusting it to six disciples. Wherever they went, fragrance spread, and branches and leaves flourished. When the present dynasty was founded, it summoned Changchun to expound the mysteries of the Mysterious Origin. Having personally received the sagely teachings, the realm turned as one toward the Dao. Even in the humblest hamlets and the most remote postal stations, all knew to revere and honor it. Their moral conduct and virtuous deeds, their hidden merits, aligned with those of the Supreme Lord—this is why the Supreme Clarity Palace was rebuilt.\n\nThe Supreme Clarity Palace had recently suffered from war and fire, and the confluence of the Yellow and Wo Rivers had swept away what remained of the immortal halls. Only the Nine Dragon Well from thousands of years past survived. After Changchun’s ascension, the Dharma was transmitted to Zhenchang. At that time, the present Duke of Ansuxiang, Zhang Rou, was stationed in Bozhou. He ordered an official to present a memorial, urging the restoration of the palace. Zhenchang first entrusted the Hidden Perfection Master and Superintendent Shi Zhiyu and the Penetrating the Mysterious Master and Palace Director Li Zhimi to commence the work. The duke also devoted himself wholeheartedly, providing support and protection. His officers and soldiers all willingly contributed, and land extending forty *li* around the palace was granted as an endowment.\n\nBefore long, the work began, but Zhenchang passed away. When I succeeded to the teaching, I received the command of Prince Haidu to earnestly invite the Venerable Daoist Zhang Zhisu and the Cloud-Dwelling Daoist Wang Zhijin to jointly oversee the project. Cloud-Dwelling passed away shortly after, but his disciples redoubled their efforts. Venerable Daoist labored day and night without respite. The old foundations were raised by over a *zhang*, and nine bays were constructed, far surpassing the former structure in grandeur. Within, an image of the Supreme Lord was enshrined, with Shu Hua and Wen Shi arrayed to his left and right, followed by *Cavernous Numinosity*, *Penetrating the Mysterious*, *Embracing the Void*, and *Southern Florescence*. The immortal visages stood solemnly, inspiring reverence in all who beheld them.\n\nThough some details remain unfinished, the palace is already sufficient to offer incense and maintain the sacred flame, serving as a place for the dynasty to pray for blessings through ten thousand generations. Is this not magnificent?\n\nHis Imperial Majesty’s sagely virtue renews itself daily, his divine martial prowess strikes like lightning. He pacified the great western frontier, subdued the Three Han to submission, swiftly eradicated the southern rebels, and summoned all the northern khans to court. With governance distributed among his ministers and arms laid aside in favor of culture, this is an era of radiant prosperity—a thousand-year opportunity.\n\nYet he still reveres the Supreme Mystery and diligently maintains solemn sacrifices. The construction of this palace may thus be anticipated with the certainty of sun and moon.\n\nI, unworthy though I am, serve in the Hanlin Academy and have been graced with the imperial command. With due reverence, I bow twice and inscribe this record. Its words are as follows:\n\nThe sage does not act with partiality,\nAnd the people flourish in simplicity.\nOnce cunning and wit arise,\nA hundred deceptions eclipse truth.\nHeaven speaks not—\nYet from it springs the Perfected One.\nWhere did he first appear?\nBy the waters of the Guo River.\nBorn with numinous distinction,\nHe spurned sagacity and renounced cleverness.\nDwelling in substance, abiding in depth,\nHe untangled knots and blunted sharpness.\nHe refused office under a corrupt lord,\nContent to remain in lowly station.\nWith a blue ox he rode west,\nShunning fame and fleeing the world.\nThe two scrolls, *Dao* and *Virtue*,\nSet forth five thousand words.\nActing through non-action,\nProfound beyond profundity.\nIn governing the people and ordering the state,\nHis legacy endures through ten thousand generations.\nWhose descendant is he?\nThe Primordial Ancestor of the August Lord.\nEver mindful of the imperial model,\nThe Supreme Virtue of the Undifferentiated Origin.\nA shrine was raised by the river,\nA single pheasant’s wing soaring.\nThe palace was named Supreme Clarity,\nIts hall the Supreme Ultimate.\nThe immortal worthies’ names were inscribed,\nEnhancing the splendor of Qiao Prefecture.\nThe surging Yellow River\nAssaulted our Valley of Yang.\nThe towering palaces—\nNow vanished.\nRising and falling follow fate,\nAwaiting the flourishing of our time.\nWith sincerity and illumination, the teaching is perpetuated,\nThe true and constant will is carried forward.\nZhi Mi and Zhi Yu\nFirst divined the site and laid the foundations.\nChong Dao and Qi Yun,\nResponding with alacrity, took up the task.\nOne hall now complete,\nIts majesty inspires awe.\nFor ten thousand years to come,\nIt shall serve as the realm’s altar of blessing.\nThe merit is not another’s—\nChong Dao’s contribution is greatest.\nI dare not claim credit,\nFor how could I repay the sovereign’s grace?\nFrom the nine wells of Qingyuan,\nFortune flows to both rivers.\nThis humble minister inscribes this record,\nA hymn in place of strings and song.\n\n*Stele for the Reconstruction of the Ten Directions Great Heavenly Eternal Abbey in the Central Capital*\nComposed by Minister Zheng Ziping, Hanlin Academician, Expositor-in-Waiting, Participant in the Drafting of Edicts, and Compiler of the National History, by imperial command.\n\nIn the third month of the fourteenth year of the Dading era, Minister Zhong Yu of the Ministry of Revenue and Minister Yi Yan, Director of Agricultural Affairs, memorialized: “The imperial lodgings at the Ten Directions Great Heavenly Eternal Abbey are now secure, and the images are solemnly arrayed. We humbly report this.” On the full moon of that month, the Son of Heaven and the Crown Prince, accompanied by the hundred officials, paid reverent homage. Three days and nights of Daoist rites were then ordered to celebrate the completion.\n\nPreviously, Master Yan Deyuan, Abbot of the Precept Platform of the Western Capital Circuit, had been summoned to reside as abbot and was appointed Supervisor of Abbey Affairs. In the autumn of the nineteenth year, in the ninth month, an edict was issued to a scholar-official to compose an inscription for the stele. I, Ziping, unworthy though I stand at the northern gate, have been charged with this task. I dare to examine the abbey’s rise and fall, its flourishing and decay, and set it forth here.\n\nAccording to my humble study of *Illustrated Classics* and old steles, the abbey was first established in the Kaiyuan era of Emperor Xuanzong of Tang, named Heavenly Eternity. Its grandeur was unmatched. Over time, it fell into disrepair, its ruin growing ever more severe. In the seventh year of the Xiantong era, Zhang Yunshen, Military Commissioner of Lulong, renovated and restored it.\n\nIn the Five Dynasties and under the Liao, it was revered and honored alike. During the final years of the Zhenglong era of our dynasty, with government corvée and administrative burdens proliferating, the abbey’s halls were filled with registers and records stored within. Some malcontents, seeking to extort or scheme, set fire to it, and in a single night, centuries of construction were reduced to ashes.\n\nYet things do not remain forever in decline; the time seemed to await a turning point. When the Sagely Son of Heaven received the Mandate and ascended the throne, five years had scarcely passed before his achievements were complete and governance settled. From the seas within to the lands beyond, all became subjects and sovereigns in harmony. Officials perfected their duties, the people pursued their livelihoods, and artisans honed their skills. Virtue and grace overflowed, auspicious omens arrived in abundance, and all that had fallen into neglect was restored.\n\nIn the autumn of the seventh year of the Dading era, on the twenty-third day of the seventh month, an imperial edict was issued to revive the abbey. The current Minister of Revenue, Zhang Zhongyu, and the Commissioner for Agriculture, Zhang Jinyan, were appointed to oversee the project, with orders not to rush. From its commencement to completion, the work spanned eight years.\n\nThe front triple gate was inscribed *Ten Directions Great Heavenly Eternity Abbey*; the central triple gate was named *Gate of Jade Purity*. A three-tiered altar for the *Xu Huang* Offering was established. The central main hall, *Jade Purity*, was dedicated to the Three Clarities. Next stood the pavilion *Illuminating Brightness*, enshrining the August Heavenly Emperor. Beyond it was the hall *Extending Felicity*, housing the images of the Celestial Bodies. To its east stood the hall *Clarifying the Spirit*, and to its west, the hall *Engendering Perfection*, both dedicated to the Six Positions of the Celestial Bodies.\n\nIn the east was the bell tower *Numinous Sound*, also enshrining the Jade Emperor and the Emperor of Primordial Void. Next stood the pavilion *Great Brilliance*, dedicated to the Lord of the Sun. Beyond it was the hall *Five Marchmounts*, housing the emperors of the sacred peaks and the Spirit King of Changbai Mountain, *Flourishing State and Numinous Response*. To the west was the pavilion *Soaring Mystery*, housing the *Daoist Canon* and enshrining the Three Heavenly Treasure Lords. Next stood the pavilion *Luminous Purity*, dedicated to the Lady of the Moon. Beyond it was the hall *Four Watercourses*, enshrining the spirits of the Yangzi, Yellow, Huai, and Ji Rivers.\n\nThe abbey comprised grotto chambers, meditation halls, and the abbot’s quarters, totaling over one hundred and sixty bays. As for the timber of its beams and pillars, the adornment of its cinnabar and lacquer, and the craftsmanship of its painted and sculpted images—though it were wrought of dragon pines and brocade, carved from starry catalpa and fragrant nanmu, inlaid with seashell and jade, or gilded with cinnabar and vermilion, the skill of Lu Ban and the artistry of Wu Daozi would not surpass it.\n\nThe expenditure amounted to tens of millions, all drawn from the imperial wardrobe and personal effects, which were sold to the people at fair prices. Thus, the project was accomplished with such ease.\n\nWandering through its jade halls, one marvels at the work of divine craftsmanship. Wind-borne steeds and cloud chariots seem to convey the perfected immortals. Jade cases and alabaster scrolls reveal the profound mysteries of the Dao. Daoist adepts in feathered robes gather to invoke the true ones. Secluded chambers and winding rooms offer refuge to the reclusive.\n\nAlas! Not a single coin was drawn from the national treasury, nor a single laborer conscripted from the registers, nor a single soldier levied from the rosters. Yet here stands a palace of a thousand pillars, an abbey of a hundred fathoms, an altar of three tiers—majestic and resplendent, as if fashioned by heaven and earth. Without the Sagely Virtue’s resonance, the loyal ministers’ concerted efforts, how could this have been achieved?\n\nI humbly submit that the subtle and wondrous Dao, profound and beyond comprehension, is forcibly named the *Way*. The Sage attains it to govern the myriad beginnings and rule the world, matching the yielding virtue of the sage-kings of old. Next is the Great Elixir and Cloudy Liquor, enabling transcendence and light ascent, the essence of longevity and enduring vision. Then come the practices of bear-hanging and bird-stretching, exhaling the old and inhaling the new, arts of prolonging life and preserving destiny. Further still are the rites of summoning spirits and subduing disasters, averting calamities and curing illnesses, proven methods to delay aging and heal afflictions. How could the Dao’s contribution to the world be small? Yet its spiritual illumination depends on the person.\n\nIn former times, the Li-Tang dynasty traced its ancestry to the Mysterious Origin and flourished through the achievements of the Kaiyuan era. The reason for its supreme veneration lay in its prioritization of self-cultivation. Now, the Son of Heaven, recognizing the Dao’s merit in the world, has revived this abbey to bestow blessings upon the people. Prioritizing self-cultivation is a matter of seizing the moment; bestowing blessings upon the people is a matter of utmost sincerity. Can seizing the moment and utmost sincerity be spoken of in the same breath?\n\nI bow my head and knock my forehead to the ground, daring to offer this eulogy:\n\nThe *Book of Changes* speaks of the Supreme Ultimate, the radiance of heaven’s treasure—\nWho presides over this but the true and essential?\nThe gate of the myriad wonders, dark and ever darker,\nNurturing the ten thousand beings as the earth and heavens turn.\n\nVast and boundless, it spans kalpas unchanging,\nFrom the *Yan Kang* and *Long Han* eras, the first years.\nYet its spiritual illumination depends on humanity’s precedence—\nThe names of Jade Purity and Grand Purity were first transmitted.\n\nSome say it existed before the womb,\nAnd emperors and kings since time immemorial have revered it.\nWhen the Perfected Lord Kong ascended in the Kaiyuan era,\nHe honored the ancestors and devoted himself to the Dao.\n\nHe built temples to bless the realm of Yan,\nAnd over five hundred years have since passed.\nYet in an instant, human fire lamentably consumed it—\nThe time seemed to await its revival, how profound the providence!\n\nThe Sagely Emperor received the Mandate and ruled the nine regions,\nHis virtue and grace shining like the heavens’ springs.\nThe seas were calm, the beacons cold,\nAll that had fallen was restored to completion.\n\nMoved by this ancient foundation standing alone in ruin,\nUnlike the Han and Tang, his intent was not mere transcendence.\nRather, he sought to bestow abundant blessings upon the people,\nAnd entrusted this task to a trusted minister, who personally oversaw it.\n\nThe work began without haste, adapting to circumstances,\nAnd in eight years, it was completed without delay.\nThe cloud-palace of the Pure Capital shelters a thousand rafters,\nIts vast courtyards and soaring pavilions stretch endlessly.\n\nGolden and azure, radiant and resplendent,\nHow magnificent the sight, overlooking the long avenue!\nNo labor was exacted from the people, no wealth depleted—\nThe Sagely Virtue’s achievement, proclaimed by his ministers’ efforts.\n\nThis humble servant offers an inscription to be carved in stone,\nAs blessings and fortune now flow like a river.\n*Stele Inscription for the Ten Directions Great Heavenly Eternity Abbey and the Precious Canon of the Mysterious Capital*\n\nComposed by Wei Boxiao, Gentleman for Attendance, Hanlin Academician for Texts, Drafter of Edicts, and Compiler of the National History\n\nThe newly completed *Precious Canon of the Mysterious Capital* at the Ten Directions Great Heavenly Eternity Abbey was overseen by the Supervisor of Abbey Affairs, the *Chong He* Great Master Sun Mingdao, who said to the renowned scholar Wei Boxiao:\n\n\"Since the Primordial Heavenly Worthy opened the *Long Han* and *Yan Kang* kalpas, commanding the Heavenly Perfected and August Person to expound the secret Dao and transmit it to the ranks of immortals for posterity, the scriptures first came into being.\"\n\nSince the Queen Mother of the West bestowed the jade image of the Primordial upon the Yellow Emperor, Xuanyuan, and placed it atop a lofty abbey to receive incense and offerings, the abbey first came into being. Thus, without abbeys, there would be no place to house the supreme scriptures; without scriptures, there would be no means to perceive the supreme Dao. Can scriptures and abbeys exist independently?\n\nThe imperial capital was established at Yong’an over forty years ago. The Heavenly Eternity Abbey has since maintained its royal incense offerings, yet its stored canon remained incomplete. Successive abbots followed one another, each content with mere continuity, none taking it upon themselves to repair or complete it. In the *bingwu* year of the Great Rectification era, Mingdao was first entrusted with the imperial decree to supervise the abbey’s affairs. During his leisure from myriad duties, the late Emperor Shizong turned his attention to the inner canon. When the abbey’s halls were consumed by fire, he drew from the imperial treasury tens of thousands in gold to raze the old and rebuild anew. Thus, the august sages found their abode, the host of perfected found their place. Long corridors and secret halls spread like wings; scripture pavilions and ritual altars, vast courtyards and present-day chambers—all were arranged with order, their grandeur deep and serene, a spectacle for the realm.\n\nMoreover, he bestowed twenty million in cash, managed by the Ministry of Revenue, with annual surpluses allocated to support the Daoist clergy. On Five-Flower Mountain, he established a cinnabar-refining cloister and erected the Jade Splendor Hall, subordinating it to the abbey as a place for alchemists to refine and ascend. Yet the supreme scriptures alone remained incomplete. Though I am dull-witted, I swore to devote all my strength to accomplishing this noble task.\n\nTwo years later, an imperial edict arrived from the Southern Capital, entrusting the *Daoist Canon* printing blocks to the abbey. The jade scriptures of the Jade Void Abbey were relocated to the Flying Mystery Pavilion for display, while the old scriptures of the Heavenly Eternity Abbey were returned to the Jade Void. Those listed in the old registry but absent from the Jade Void’s collection were permitted to remain, to be dispatched only when replacements were found. Subsequently, for the grand universal ritual, the solemn protocols were observed, and ten individuals, including Xiao Daoji, were granted the honor of wearing the purple sash. Fifteen thousand in cash were further bestowed to procure vestments, with an additional three thousand given to the remaining clergy.\n\nMingdao, ever more inspired, believed that with the sagely Son of Heaven above, the Daoist teachings flourished. It was fitting to propagate the dharma, enlighten the deluded, and open the path to salvation. He submitted a memorial to the throne, and the imperial assent was granted. He was further encouraged to invite eminent Daoists and conduct rites with utmost purity. The following year, in the first month, the tripod was cast and the dragon departed, yet the imperial decree remained in force.\n\nUpon ascending the throne, the present emperor revered Daoist learning all the more, for its teachings originated in China. Emphasizing purity and frugality, the court officials petitioned to uphold the previous edict. With the imperial approval, on the first day of the third month, the altar was opened to receive the registers. Once the solemn rites were prepared and the master’s name was invoked, three cranes suddenly arrived from the northwest, circling the ritual altar. As the invocation concluded, they departed toward the southwest. At noon, as the sun stood at its zenith and the master ascended the altar, four more cranes hovered above. As the divine officials were summoned, a sudden yellow mist enveloped the sky, sweeping in from the northwest like a tempest. Yet when the mats were rolled away, the heavens cleared, and the cranes soared into the vast emptiness. The clergy and laity, awestruck, bowed in reverence.\n\nOn the first day of the inaugural year of the *Mingchang* era, an imperial envoy was urgently dispatched to instruct the Ministry of Revenue to expand the abbey’s left vacant land by a thousand paces. There, the *Dingmao* Auspicious Sage Hall was erected to enshrine the natal deity of the August Mother, its design matching the Hall of Extended Celebration. The northern palace’s first precinct was also granted to the abbey, where halls were constructed in rows to house the printing blocks. Two scholar-officials were appointed to collaborate with Mingdao in proofreading and collating, completing the repairs and printing a full canon. Further, a diligent Daoist was selected to serve as abbot, with the stipulation that after five years of exemplary service, he would be granted the purple robe and an honorific title. Two diligent novices were also to be tonsured annually as a permanent arrangement.\n\nMingdao, ever dutiful, spared no effort in his residence. He dispatched yellow-capped Daoists to seek lost scriptures throughout the realm and recruited artisans to gather materials. A certain Zhao Daozhen volunteered to oversee the procurement of printing blocks, soliciting donations far and wide. Within two years, all was prepared: rare timbers assembled, skilled craftsmen gathered, pillars erected, and carvings completed. In total, 1,074 lost scriptures were recovered, 21,800 printing blocks were supplemented, and 83,198 volumes were amassed, filling four storehouses with thirty-five bays and 140 shelves.\n\nMingdao then rallied the clergy to organize the canon according to the Three Caverns and Four Supplements, meticulously classifying and collating each text, resolving discrepancies, and arranging them in order. Thus, a complete canon was compiled, totaling 6,455 scrolls in 602 sections, titled *The Precious Canon of the Mysterious Capital of the Great Jin*. With the task accomplished, a stele was needed to ensure its enduring legacy. You, who have long been devoted to our teachings, have requested this inscription. I dare not refuse.\n\nI, Boxiao, respectfully note: The Daoist tradition traces its origins to the teachings of the Yellow Emperor and Laozi. Its Dao takes clarity, tranquility, and non-action as its essence, and compassion, frugality, and non-contention as its practice—all harmonizing with the subtleties of the Six Classics, indispensable even to rulers. As for its claims of immortality and the preservation of life’s essence, these are the concerns of recluses in the mountains. Thus, those who truly master the teachings of the Yellow Emperor and Laozi must grasp both root and branch. The effortless governance of Yu Shun, the compassion and frugality of Emperor Wen of Han, the gentle Dao of Emperor Guangwu, and the purity of Gai Gong—all stem from the teachings of the Yellow Emperor and Laozi, exemplifying true mastery.\n\nNow, our master has been entrusted with the imperial mandate to restore the old canon and recover lost texts from across the realm, amassing a great treasury of teachings. This endeavor, both in root and branch, is not without merit. Such an achievement is worthy of inscription. Thus, I respectfully comply and inscribe these words:\n\n*(Here follows the inscription, to be translated as a separate section.)*\n\nThe Primordial of the Vast Void,\nthe Self-So of Emptiness and Nothingness.\nFrom Nonbeing comes Being,\naccumulating to form earth and heaven.\nOnce the Two Modes were established,\nthe Seven Luminaries began their dance.\nCreation nurtures and poisons,\nlife and death shift through kalpas.\nAs human or thing,\nas ghost or immortal.\nAbove the Three Realms,\nbefore the kalpas vast.\nAbove, no further color;\nbelow, no deeper abyss.\nWithin lies the Great Brahmā,\nall-pervading, subtle, and boundless.\nThe Jade Tone gathers qi,\nthe numinous wind assembles mist.\nThus the scripture takes form,\nradiant and resplendent.\nIn the boundless Dragon Han era,\nits transmission began.\nCelestial Perfected analyzed and expounded,\nthe ranks of immortals offered reverence.\nBestowed upon the world,\nthe Five Thousand Words of Mystery.\nThe Three Caverns and Four Supplements,\nin sequence they followed.\nAfter Guan Yin,\nschools branched and spread.\nThe Han histories recorded\ntwo hundred and five chapters.\nBy the rise of Jin and Xingning,\nits light further extended.\nThrough Tang to Song,\nits warp and weft were complete.\nLost texts were sought,\ngathered from mountains and rivers.\nStored in the secret palace,\nadorned with brocade and jade.\nWhen Heaven’s Mandate changed,\nthe scriptures followed the master’s return.\nBound and shelved for long,\nthey nearly became fragmented scrolls.\nIn the Great Revival,\nthe Perfected ruled the heavens.\nThe celestial roll unfurled,\nauspicious rites were performed.\nRenewed and resplendent,\ngold and coin were bestowed.\nThe sagely grace vast as the ocean,\nilluminating the celestial springs.\nThe scriptures were carved on tablets,\nto be sought and gathered.\nFrom Wei and Liang,\nthey were brought to Han and Yan.\nThe scriptures had their gaps,\nto be supplemented and engraved.\nWith that Jade Void,\nthis Flying Mystery was exchanged.\nHow was the tripod cast?\nThe dragon-chariot soared high.\nClutching its scales in vain,\nclasping the bow, tears streamed.\nThe Emperor of Mingchang,\ndevoted to serving the immortals,\ngranted halls and constructed chambers,\nappointing officials to oversee the work.\nWith reverent harmony,\ndiligence was utmost.\nBefore a year had passed,\nauspicious conditions converged.\nA thousand treasures gathered,\nten thousand craftsmen assembled.\nThe Luhu Mountain stood tall,\ncarved moats and walls linked in splendor.\nWhen the work was complete,\nthe numinous revealed itself.\n\nAt the august feast of Emperor Shizong,\njoining the imperial banquet,\nwho would await the chariot?\nThe distant Shao music echoed.\nDescending to witness the success,\ngreat blessings were bestowed.\nMay the Son of Heaven live long,\nfor a hundred million years.\nThe Daoist teachings spread,\nflowing to the eight directions.\n\n*Record of Auspicious Responses at the Great Heavenly Offering of the Celestial-Long Everlasting Abbey*\nIn the first year of Mingchang, the second month, on the day *guimao*, the Empress Dowager’s spirit was serene and her virtue proclaimed.\nOn the following day *jiachen*, the Emperor paid court at Longqing Palace, inquired after her health at the Cixun Hall, and upon departing the sleeping chambers, could barely walk straight. Morning and evening, he attended to her meals, consulted on medicines, and never loosened his sash, believing that prayers to the gods above and below were recorded in the classics.\nOn the day *renzhi*, a seven-day Great Heavenly Offering was held at the Celestial-Long Everlasting Abbey, praying for the Empress Dowager’s boundless longevity. Five million coins were granted, along with 280 catties of plum sandalwood, aloeswood, and *jiangzhen* incense, five taels of borneol, and the following were appointed as officiants: General of Manifest Valor, Commander of the Palace Guard and Hostelry, Grand Master Yin, Western Upper Chamber Attendant Zhang Ruyou, and Left Rectifier Wanyan Aluhan. An edict was issued to the Abbot of the Celestial-Long Abbey, Master of Harmonious Pervasion Sun Mingdao: \"The Daoist teachings of Lord Lao are China’s own, unlike the Western Hu of Buddhism who clamor with cymbals. From this day forward, no ritual instruments shall be used in offerings.\"\n\nOn that day, a memorial of blue-green words was presented for the Great Heavenly Offering:\n*\"The heir and Son of Heaven, your subject, humbly addresses the Three Pure Ones, the Four Emperors, and the Two August Sovereigns. Reverently considering the great continuity of divine response, we look up to the compassionate court. Daily, we serve with devotion. Having prepared the nine provinces’ offerings, we rely on Heaven’s blessing to unfold the auspices of ten thousand years. Yet, by chance, the seasons fell out of harmony, and a slight illness arose. Thus, we knock at the profound gates of the divine, solemnly preparing this secret offering. We hope that filial piety will move the true chariot, that the divine will peer down and perceive, bestowing the extension of bright destiny. May all beings forever depend on this great shelter. Your subject, with utmost sincerity, offers this prayer.\"*\n\nOn the day *xinyou*, the Emperor visited the Celestial-Long Abbey, performed the incense offering, and returned to the palace. The officiants and High Master of Rituals reported the opening of the memorial. The Emperor observed a seven-day fast.\nOn the day *guihai*, nine memorials of blue-green words were bestowed from within the palace, along with four catties of aloeswood and ten taels of borneol.\nOn the day *yichou*, during the midday ritual, nine white cranes came from the northwest, followed by ten more, all gliding and soaring above the altar. In an instant, thousands arrived, filling the sky on all sides, circling and lingering from noon until late afternoon before slowly departing. At that time, the clouds and sky were bright and clear. From the southwest, a red light descended, illuminating the altar hall. The people of the capital gazed in worship, their voices united in praise, all attributing it to the Emperor’s filial devotion.\nOn the day *bingyin*, the Empress Dowager sent the Supervisor of Longqing Palace, Gao Gaoshou, to bestow fifty taels of silver and four bolts of silk, instructing the Daoist assembly to perform repentance rites.\nOn that same day, at midday during the ritual, four cranes came from the northwest, soon followed by over fifty, circling above the altar for a long while.\nOn the day *dingmao*, the Left Chamberlain for Ceremonials, Lu Ji, was appointed as substitute officiant. At noon during the ritual, five cranes came from the northwest, circling above the halls and pavilions. The Daoist assembly presented incense at the Ten Directions Altar. A great crane descended, skimming the eaves of the Jade Void Hall before dancing above the altar pavilions and departing.\nAt midnight, as the memorial was burned, a gentle wind arose from the northwest, swirling the paper ashes upward in spirals for hundreds of thousands of feet, straight into the heavens. Soon, a red light illuminated the jade halls, and the crowd gasped in awe, gazing in worship.\n\nOn the day *wuchen*, the rites were concluded.\n\nNot yet half a month later, the Empress Dowager’s health was restored as before. There was at this temple’s Jade Void Hall a Daoist acolyte charged with tending incense, Xu Wuzhen by name, who had witnessed all these events. He commissioned artisans to carve a wooden *Illustrated Record of the Celestial Responses to the Universal Grand Offering at the Great Temple of Heaven’s Eternity*, detailing the entire sequence from beginning to end, and entreated the Court Historian’s Compiler, Minister Zhu Lan, to inscribe the account for the annals of the realm.\n\nI reflect that in the Han dynasties, when yellow cranes descended upon the Taiye Pond and thirty white cranes passed over the Feng and Shan altars on Mount Tai, their arrival was purely fortuitous, devoid of any deliberate intent. Yet the historians of the time still deemed it an auspicious omen, recording it in the *Book of the Western Capital* and the *Records of the Eastern Observatory*, pairing it with the sagely Son of Heaven’s filial virtue—a virtue so profound that it moved Heaven and Earth and forged a communion with the divine, resplendent and luminous indeed!\n\nNow, as I too serve in the Office of the Grand Historian, it is my duty to faithfully record these events. Internally, they shall be inscribed in the imperial archives for future historians to select and preserve; externally, they shall broadcast the sovereign’s virtue to aid in governing the teachings of the Four Seas. Thus, I dared not firmly refuse Xu Wuzhen’s request. Taking his records as my source, I have compiled this *Record of Auspicious Responses to the Universal Grand Offering at the Temple of Heaven’s Eternity*.\n\nAs the *Book of Documents* states: “The foundation of love lies in one’s parents; the foundation of reverence lies in one’s elders. Begin within the family and state, and extend it to the Four Seas.” It is to be hoped that all subjects of the realm, upon hearing of this, will be moved by the Emperor’s virtue and emulate his example. May every person cultivate the conduct of Zeng and Min, and may the customs of the Tang and Yu eras—where every household was worthy of enfeoffment—be witnessed once more in our time.\n\nOn the day *wuwu* of the fifth month, the Court Gentleman for Miscellaneous Affairs, Hanlin Academician for Textual Composition and Concurrent Compiler of the Court Historians, Acting Minister Zhu Lan, bows and kneels to respectfully inscribe this.\n\n---\n\n**Stele Inscription for the Universal Grand Offering at the Great Temple of Heaven’s Eternity in the Central Capital**\n\nComposed by Jue Huaiying, Director of the Directorate of Education and Concurrent Hanlin Academician, Participating Compiler of the Court Historians, and Drafter of Imperial Edicts\n\nSince antiquity, the sages have revered Heaven and Earth and honored the spirits, and the rites of prayer, sacrifice, and offering are extolled in the *Book of Songs* and the *Book of Documents*. They established altars to mark positions, presented sacrificial animals and silk as offerings, burned incense to convey fragrance, and employed invocators to deliver prayers—seeking to avert calamity, prolong life, and invoke blessings, all with specific entreaties.\n\nIn later ages, these rites were sometimes observed and sometimes abandoned, and their details could no longer be thoroughly examined. Yet the practices of expiation and supplication were preserved solely among the Daoist tradition. Purification rites followed strict methods, and offerings adhered to prescribed forms: purification to atone for transgressions, offerings to transcend calamity—thus entreating blessings from the gods of Heaven and Earth. Since the Han and Tang dynasties, these methods have become increasingly refined. Though they differ from ancient practices, the essence remains the same: purity in approaching the rites and reverence in conveying sincerity.\n\nIn the second month of the first year of the *Mingchang* era, the Empress Dowager fell gravely ill. The Emperor attended her day and night in her chambers, consulting physicians and examining remedies. All that could be done to care for her as the mother of the realm was done to its utmost, yet her condition showed no improvement. The Son of Heaven was deeply alarmed, his anxiety etched upon his face. He dispatched attendants to summon all those skilled in prayer and supplication, declaring: “Among all methods of prayer, none is more solemn than that of the Daoists. Their so-called Universal Grand Offering surpasses all others in its comprehensiveness.” He then ordered the disbursement of five million coins from the imperial treasury to the Temple of Heaven’s Eternity, commanding that a grand offering be held. Additionally, he bestowed upon the temple quantities of plumeria, aloeswood, and borneol incense—over four hundred *jin* in total—specifically appointing the Commander of the Palace Guards and Concurrent Director of the Guest Office, Da Zhongyin; the West Upper Palace Gate Attendant, Zhang Ruyou; and the Left Rectifier, Wanyan Aluhan, to oversee the rites. He further instructed the Supervisor of the Temple, the Master of Harmonious Emptiness, Sun Mingdao: “The Dao of Lord Lao originated in China and emphasizes purity and tranquility, unlike the Western barbarian teachings of the Buddhists, which concern themselves with clashing cymbals. Henceforth, such practices shall no longer be employed in offering ceremonies.”\n\nThereupon, the Emperor observed a vigil of purification. The following day, he personally visited the altar site to present incense and offerings. Upon his return, nine secret memorials were sent from the palace, all inscribed in his own hand. The Empress Dowager also dispatched palace envoys to present silver, silks, and other gifts as offerings of repentance and gratitude. On the day the altar was opened, the meals of both palaces were vegetarian for seven days, aligning with the duration of the offering. The meticulousness of the preparations and the sincerity of the devotion were truly unparalleled.\n\nThree days into the offering, as the rites were in full progress, a crimson mist arose in the southwest, its radiance illuminating the altar and halls. Nine white cranes came from the northwest, soaring above the altar. Soon after, over ten more arrived, followed by cranes converging from all directions—so numerous they could not be counted, likely numbering in the thousands. They circled above and below from noon until dusk before gradually dispersing.\n\nAt that moment, the officiating officials and Daoist masters, moved by the spectacle, prostrated themselves in reverence before the altar. The elders and common folk of the capital, their eyes fixed upon the scene, raised their hands to their foreheads in awe, attributing it to the Emperor’s filial piety.\n\nFrom then on, cranes arrived in groups of five or four, sometimes numbering in the dozens, appearing day after day. Finally, a great crane descended in a leisurely glide, brushing against the eaves and pillars before circling above the halls and pavilions. After some time, it vanished from sight.\n\nOn the evening the memorials were burned, the sky was clear and bright, a gentle wind arose, and the smoke and ashes ascended without limit. Suddenly, a red light illuminated the altar halls, and the assembled crowd, enraptured, knew that the immortals and sages were not far from mortal kind.\n\nSoon after the offering concluded, the Empress Dowager’s health was swiftly restored, and the court and the realm rejoiced together in celebration. The Court Historian’s Compiler, Zhu Lan, recorded these events, and many scholar-officials composed songs and eulogies. Master Sun further requested this humble text to be inscribed and engraved.\n\nHuaiying remarks: The Dao of Heaven is profound and distant, and the principles of its interaction with the mortal realm cannot be fully known. What *can* be known is this: when one cultivates virtue below, responses manifest above—this is the inevitable principle.\n\nThe crane is a transcendent bird, nesting in deep forests and roaming marshes. When humans approach, it spreads its wings and departs—who compels it to come? I have heard Daoists regard it as the steed of immortals. If this is so, then the resonance between them is manifest indeed.\n\nConfucius said: \"Serve one’s father with filial piety, and one serves Heaven with clarity; serve one’s mother with filial piety, and one serves Earth with discernment—extending this, there is nothing that cannot be penetrated.\" The *Book of Documents* states: \"Spirits and deities have no fixed abode; they respond only to utmost sincerity.\" When the teachings of the Dao’s subtle essence are practiced with purity and reverence, and when they convey the sagely Son of Heaven’s devotion to his kin, how could the response not be swift?\n\nHaving recorded what I have witnessed, I append this eulogy:\n\nAbove reigns the Emperor,\nWhom all spirits revere.\nThough their hearing is keen,\nWithout sincerity, no communion is clear.\n\nO august and divine,\nHe inherits Heaven’s Way.\nNo petition he made,\nYet for his kin he did pray.\n\nHe embraced Daoist learning,\nWhose roots lie in mystery.\nThrough pure reverence alone,\nHe sought to reach Heaven’s decree.\n\nThe altar stood solemn,\nIts rites profound and concealed.\nThe spirits above took heed,\nAnd blessings swiftly revealed.\n\nThen came auspicious vapors,\nNeither cloud nor smoke,\nDescending to the altar halls,\nTheir radiance bright and woke.\n\nAnd cranes, by the hundreds,\nAppeared in flight,\nTame as if led,\nSkimming eaves in delight.\n\nOn that day, the Emperor’s devotion\nBrought blessings to his mother’s abode.\nThe Son of Heaven declared,\n\"Praise to the Daoist master!\"\n\nThe master bowed deeply,\n\"All thanks to the Emperor’s filial heart.\"\nFor ten thousand myriad years,\nMay the Dao’s teachings impart.\n\n---\n\nThe Most High is the ancestor of primordial chaos. At first, the Three Pure Ones were born—from the Jade Pure to the Grand Pure—then the Nine Qi emerged, from the Boundless to the Unconditioned. With pure yang, the Thirty-Six Heavens were divided—from the Great Yellow to the Great Veil; with pure yin, the Thirty-Six Earths were formed—from Moist Brilliance to the Abyssal Depths—all within the realm of dominion.\n\nThough dwelling upon cinnabar terraces and within purple palaces, the Three Great Immortals, Nine Great Emperors, Twenty-Seven Heavenly Lords, Eighty-One Great Ministers, One Thousand Two Hundred Celestial Officers, Twenty-Four Thousand Spirit Bureaus, Seventy Thousand Immortal Youths and Jade Maidens, Five Hundred Million Heavenly Soldiers, and Divine Kings—all attend upon them in service.\n\nThe Ten Great Grotto-Heavens, Thirty-Six Grotto-Realms, Seventy-Two Blessed Lands, Thirty-Six Pure Retreats, and Twenty-Four Transformative Governances all look up in submission.\n\nFree from the calamities of the Ninefold Yang and the Sixfold Yin, they transcend the cycles of the Stone and Mustard Seed Cities. Some attend the Primordial Beginning, reviewing the registers of the Nine Palaces’ ascent and descent; some visit the Jade Dawn, perusing the ledgers of the Three Realms’ life and death. Some tread upon cloud-brocade and their bodies gleam like gold; some sit upon lotus leaves, their faces radiating sunlight. They don crowns of sevenfold radiance and cloud-silk, draped in ninefold splendor. Some ride eightfold jade chariots; some harness five-colored divine dragons. They raise cinnabar standards of streaming clouds and unfurl crane canopies of ninefold light. Some recline behind jeweled curtains; some wave dusters adorned with pearl banners. Some, in dark caps and plain robes, ride white horses with crimson scales; some, with jade forms and golden countenances, spur azure rainbows and white beasts.\n\nSome address the August Emperor of the Golden Gate as the Lord of the Empty Firmament; some, in the Grand Tenuity, are called the Heavenly Sovereign. Some emerged in the Dragon Han era as the Master of the Mystic Center; some appeared in the Red Brightness epoch as the Ancient Teacher. Some are called Yu Hua Zi, who drew the Eight Trigrams for Fu Xi; some are called Da Cheng Zi, who sowed the hundred grains for Yan Di. Some are called Guang Cheng Zi, who withdrew to Kongtong; some are called Wu Cheng Zi, who dwelled on Guye. Some bestowed upon the Perfected of Pure Emptiness the Twenty-Four Diagrams; some granted the Heavenly Perfected Sovereign the Thirty-Six Scriptures. Secret elixir texts were sealed in jade caskets and precious chests; purple characters were stored in jasper halls and gem chambers. The *Numinous Chapters* were transmitted to the Azure Lad; the Dharma’s inception began. True images were left with the Queen Mother of the West; the first Daoist temples were built.\n\nThereupon, they descended as spirits during the Shang, in the reign of Yang Jia. They were incarnated in suffering in the Gengshen year, riding a nine-dragon carriage with light streaming from five-colored pearls. Entrusting their transcendent remains to soaring flight, they split open the left side of their wondrous body. After eighty-one years of gestation, they displayed seventy-two auspicious signs. Their appearance—pointing to a tree, they took the surname Li; with white hair, they were called the Old Master, or Bo Yang. Some called them the Grand Historian Dan, or named them Yuan, De, Ya, Shi, or styled them Sheng, Guang, Wen, Shi—no fewer than thirty-six titles.\n\nTheir eyes were like rivers, their mouths like seas; their brows like the sun, their temples like the moon. Their noses bore twin pillars; their foreheads, three ridges. Their cheeks resembled transverse ridges; their jaws, level mounds. Nine feet tall, their hands grasped ten lines. With square pupils and broad faces, their white skin bore brocade patterns—how could they possess only seventy-two marks?\n\nSince the time of Kings Wen and Wu, they held the offices of Archivist and Chronicler. Perceiving the decline of Zhou’s virtue and lamenting the unenlightened customs of the Hu, they passed through Hangu Pass, intending to cross the Flowing Sands. A purple aura stretched across the sky; a blue ox bore their carriage. Finally, they inscribed the book requested by the Pass Keeper and revived the bones of Xu Jia, who had already died. This occurred in the twenty-fifth year of King Zhao, on the jiazi day of the seventh month.\n\nToday, near the ruins of the Upper Clear Palace in Luoyang, ancient trees coil like dragons and serpents. Above one hollow lies the very spot where the Most High tethered his carriage.\n\nIn our dynasty, the Hebei Circuit was elevated to the Central Capital. The Prefectural Governor, Wanyan Echu, invited the Gatekeeper Daoist Wu Dashun to oversee this Ten Directions Palace. He summoned scholars from all quarters, enabling them to sweep and tend its halls—a great and noble endeavor.\n\nWu Dashun requested an inscription from me to be carved in stone. Fearing that the world might not understand how the Most High came to this, I have recorded these details in full.\n\nAs for the transmission of the Dao to Gengsang, there was the analogy of the crouching swan; the discourse on ritual with Confucius drew the sigh of \"like a dragon.\" Later, he was born in the market of the Green Ram, and in distant times ascended the palace of the White Deer—all matters of subsequent record. These accounts lie within the *Daoist Canon*; here, they are but briefly noted.\n\nThus respectfully recorded by Sun Chunfu.\n\nThe stele inscription for the palace and abbey is hereby concluded.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "宫观碑志 经名：合二观砖志。 宋陶谷、金郑子聘等撰。 一卷。 底本出处：《正统道藏》洞神部记传类。 宫观碑志 泾州回山重修王母宫记 翰林学士判史部流内诠事陶谷撰 祭法日：法施於人则祀之。 辩方之为法制也，不亦大哉。 神有所职，足以垂训者，孰可阙焉。 按《尔雅》：肌竹北户西王母日下谓之四荒。 王母事迹，其来久矣。 名载方册，理非语怪。 西周受命之四世，有君曰王满，享国五十载，乘八马，宴瑶池，捧王母之觞，乃歌黄竹。 西汉受命之四世，有君日帝彻，享国亦五十载，期七夕，会甘泉，降王母之驾，遂荐仙桃。 周穆之观西极也，濯马潼，饮鹊血，践巨搜之国，乃升彝山，故汲冢有《穆天子传》。 汉武之祷灵境也，祀雍时，幸朝邦，立飞廉之馆以望玄圃，故乐章有上之回曲。 呜呼！ ．湘灵鼓瑟，虞舜二妃也； 黄姑有星，天河织女也。 或楚词所传，犹能编杞典，配严祠，箫鼓豆篷，预四时之享，牺牲玉帛，陪百神之祭。 岂若王母为九光圣媛，统三清上真，佩分景之玉剑，纳去琼之凤乌，八琅仙傲以节乐，九色斑磷而在驭，啸咏则海神鼓舞，指顾则岳灵奔走，辅五帝於金阙，较三官於绛河，位冠上宫，福流下土，则回中有王母之庙，非不经也。 年杞寝远，楝宇屿坏，坛歌杏朽，蔽荆棘於荒庭，井废禽亡，噪乌鸢於古蝶。 物不终否，崇之在人。 太师清河公受脤建牙，三临安定，军功政事，纪在旅裳。 是邦也，压泾水之上游，控西戎之右地，土宜菽麦，俗习骑射，抚之有道，则风能偃草，驭之非理，则水亦覆舟。 中权失政，不可一日而处，辩三镇乎。 岁戊辰春二月，公介圭入觐，骏奔上都，天子设庭燎以延之，奏肆夏以宠之，临轩绝席以绥怀，大辖繁缨而锡命。 礼成，三接诏还旧镇。 公既旋所理，来谒灵庙，斋庄有感，盼蜜如答，伸命主者，鸠工缮修。 萝蔓草於庭除，封植嘉树，易颓檐於廊应，缔构宏材，丹青尽饰於天姿，鹊藻增严於羽帐，蕾买生画栋，如嗟西土之遥，水阅长川，若讶束瞑之浅。 容卫既肃，精诚在兹，何须玉女投壶，望明星於太华，瑶姬感梦，洒暮雨於阳台。 合征幼妇之辞，庶尽上真之美。 谷也，学非博古，才不逮时，论思谬冠於词臣，叔事敢瑜於实录，久直金鸾之殿，视草无功，强窥朱雀之窗，偷桃知愧。 谨为颂日： 昆仑之墟，崎峨之下。 戴胜蓬发，虎豹为作。 是耶非耶，怪哉王母。 丹台命驾，七夕为期。 蕾买饼凤辇，剑佩光辉。 倩兮盼兮，穆若仙姿。 宅玄都兮如彼，降汉宫兮若是。 奚灵圣之多端，骇变化之神异。 考《山经》与《竹书》，故两留於前事。 山之巅兮水之湄，奠玉牦兮荐金徽。 白云零落归何处，黄竹摧残无一枝。 抚鼻山之旧石，纪泾水之仙祠 重阳成道宫记 京兆西终南有里日南时，中有重阳成道宫焉。 盖大定初，全真祖师重阳真人始悟道时，自掘一穴，起封数尺，如马鬣之状，以活死人墓名之。 手植四梨八海棠於四周，人问其故，乃曰：吾真风将来大阐，四维八弦无所不至之日，要使人知从此一墓而始之也。 居二年，迁刘蒋，后常有三五众茸庵而守之。 正大初，全阳真人周全道清明自幽来，政祭於刘蒋祖师之茔，忽念及祖师修炼变化成道之地，不可使之芜没，胸中慨然起修茸之心，弗克自已，若有神使之然者。",
      "translated_text": "**Stele Inscriptions of Daoist Abbeys**\n\n**Title of the Text:** *Inscription on the Brick Stele of the Two Combined Abbeys*\n**Authors:** Tao Gu of the Song Dynasty, Zheng Ziping of the Jin Dynasty, et al.\n**Volume:** One\n**Source Text:** *Daoist Canon of the Zhengtong Era*, \"Records and Biographies\" section under the *Dongshen* Division.\n\n---\n\n### **Inscription on the Restoration of the Queen Mother’s Abbey at Huishan in Jingzhou**\n**Composed by:** Tao Gu, Hanlin Academician and Director of the Bureau of Appointments within the Ministry of Rites\n\nThe *Rites of Sacrifice* states: *\"That which establishes the Dao among the people shall be venerated.\"* How vast is the system of rites that distinguishes the four directions! For spirits whose duties offer enduring instruction, how could their worship be neglected?\n\nAccording to the *Erya*: *\"The lands of the Ji and Zhu tribes, the northern gate, the Queen Mother of the West, and the regions beneath the sun are called the Four Wastes.\"* The deeds of the Queen Mother have long been recorded. Her name appears in official annals; her story is no mere strange tale.\n\nIn the fourth generation of the Western Zhou’s mandate, there was a ruler named King Man, who reigned for fifty years. He rode eight steeds to the Jasper Pool, raised a goblet offered by the Queen Mother, and sang the *\"Yellow Bamboo\"* ode. In the fourth generation of the Western Han’s mandate, there was an emperor named Liu Che, who also reigned for fifty years. On the seventh night of the seventh month, he met the Queen Mother at Sweet Springs Palace, where her chariot descended, and he was presented with immortal peaches.\n\nWhen King Mu of Zhou journeyed to the western limits, he watered his horses at the Tong River, drank the blood of magpies, and traversed the land of the Giant Sou. He then ascended Mount Yi, as recorded in the *\"Biography of King Mu\"* from the Ji Tombs. When Emperor Wu of Han prayed at the sacred precincts, he sacrificed at Yong, visited the court of Zhou, and erected the Pavilion of Feilian to gaze upon the Dark Garden. Thus, the *\"Shangzhi\"* hymn of the *Music Bureau* includes the *\"Turning Melody.\"*\n\nAlas! The spirit of the Xiang River plays the zither—these were the two consorts of Emperor Shun. The star of Huang Gu is the Weaver Girl of the Milky Way. Though they appear in the *Songs of Chu*, they are still enshrined in the classics, paired with solemn temples. With flutes and drums, sacrificial vessels and canopies, they receive offerings in the four seasons. With sacrificial animals, jade, and silk, they partake in the worship of the hundred spirits.\n\nHow could the Queen Mother compare? She is the Ninefold Radiant Saintly Maiden, governing the Supreme Perfected of the Three Pure Realms. She wears a jade sword that divides the light and rides a phoenix that sheds its feathers. The Eight Lang Immortals regulate her music, and nine-colored striped unicorns draw her chariot. At her whistling and singing, the sea gods dance; at her glance and gesture, the mountain spirits hasten. She assists the Five Emperors in the Golden Towers and adjudicates the Three Officials by the Crimson River. Her rank crowns the Upper Palace, and her blessings flow to the lower earth. Thus, the Abbey of the Queen Mother at Huishan is no unorthodox establishment.\n\nYet as the years of worship receded, the beams and eaves decayed. The altar songs faded, and brambles overgrew the desolate courtyard. The wells fell into ruin, and birds vanished; only crows and kites screeched over ancient steles. Yet misfortune does not last forever—its remedy lies in human effort.\n\nThe Grand Preceptor, the Duke of Qinghe, received the sacrificial meat and raised his banner, thrice governing Anding. His military achievements and governance are recorded in the annals. This land presses upon the upper reaches of the Jing River and controls the right flank of the Western Rong. Its soil suits millet and wheat, and its people are skilled in archery and horsemanship. Govern it with the Dao, and the wind will lay the grass flat; rule it without principle, and even water will capsize the boat. The loss of central authority cannot be tolerated for a single day—how much more so for the three garrisons!\n\nIn the spring of the *wuchen* year, the second month, the Duke entered the court bearing the jade tablet. He hastened to the capital, where the Son of Heaven lit courtyard torches to receive him, performed the *\"Grand Xia\"* music to honor him, sat by the palace window to soothe his heart, and bestowed upon him a grand ax and ornate reins. After the rites were completed, he received three edicts and returned to his former post.\n\nUpon resuming his duties, he came to pay homage at the sacred abbey. Moved by solemn reverence, he felt as though his gaze met a response. He commanded the overseers to gather workers and undertake repairs. They cleared the creeping vines and weeds from the courtyard, planting fine trees. They replaced the crumbling eaves of the corridors, constructing grand beams. The vermilion and azure adorned her celestial form; the kingfisher-feather curtains enhanced the elegance of her canopy. The painted rafters seemed to sigh at the distance of the western lands, while the water pavilion overlooked the long river, as if marveling at the shallowness of the eastern sea.\n\nWith the attendants now solemn and the sincerity complete, what need was there for the Jade Maidens to cast arrows into the pot, gazing at the Bright Star on Mount Taihua? Or for the Maiden of the Jasper Terrace to appear in dreams, scattering evening rain on the Terrace of the Sun? By combining the words of the young woman and the youth, may the beauty of the Supreme Perfected be fully expressed.\n\nAs for myself, my learning does not reach antiquity, and my talent falls short of the times. Though I have long served among the literary ministers, drafting edicts without merit, and have forced myself to peer through the Vermilion Phoenix Window, stealing peaches leaves me ashamed.\n\nThus, I respectfully offer this eulogy:\n\n*At the ruins of Kunlun,*\n*Beneath its towering peaks,*\n*With disheveled hair and a crown of feathers,*\n*Tigers and leopards attend her.*\n*Is it she? Is it not?*\n*Marvelous, the Queen Mother!*\n*Her chariot summoned at the Red Terrace,*\n*The seventh night her appointed time.*\n*Phoenix carriages and radiant swords,*\n*Her gaze so bright, her bearing so fair.*\n*Dwelling in the Dark Capital—thus it was,*\n*Descending to the Han Palace—thus it was.*\n*How manifold her numinous powers,*\n*How wondrous her transformations!*\n*Consult the* Mountain Classic *and* Bamboo Annals—\n*Both preserve her ancient deeds.*\n*At the mountain’s summit, by the water’s edge,*\n*Jade libations and golden zithers offered.*\n*Where have the drifting white clouds gone?*\n*The* Yellow Bamboo *lies broken, not a branch remains.*\n*I caress the old stone of Huibi Mountain,*\n*Recording the immortal shrine by the Jing River.*\n\n---\n\n### **Inscription on the Abbey of Perfected Dao Attainment of Chongyang**\nWest of the capital Jingzhao, in the Zhongnan Mountains, lies a village called Nanshi. Within it stands the Abbey of Perfected Dao Attainment of Chongyang.\n\nIn the early years of the *Dading* era, the Patriarch of the Quanzhen School, the Perfected Chongyang, first awakened to the Dao. He dug a pit for himself, piling the earth a few feet high in the shape of a horse’s mane, naming it the *\"Tomb of the Living Dead.\"* He planted four pear trees and eight crabapple trees around it. When asked the reason, he replied: *\"When the true wind of my Dao spreads widely in the future, reaching the four directions and eight boundaries without exception, I want people to know that it all began from this one tomb.\"*\n\nAfter two years, he moved to Liujiang. Later, three to five disciples built a thatched hut to guard the site. In the early years of the *Zhengda* era, the Perfected Chongyang, Zhou Quandao, came from Youzhou to offer sacrifices at the tomb of the Patriarch in Liujiang. Suddenly recalling the place where the Patriarch had cultivated, transformed, and attained the Dao, he felt it could not be left to decay. A sense of indignation arose in his heart to restore it, which he could not suppress—it was as if a spirit had moved him.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1256,
      "start_sentence": 0,
      "end_sentence": 53,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.73387384414673,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\宫观碑志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "俄一人请斋，问之，知其为此庵道士，遂与之俱来庵中。 道众乞借光扬之力，周异其密与己契，乃欣然许之，复日：我以后当居此。 大朝革命，四方道众思其所以报本反始者，规运木植，开垦地土。 岁乙未，清和大宗师尹真人并掌教真常李真人法旨，本府总管田侯疏，委渊虚真人李公志源率道众於此盛行营造事。 皆趋务劝功，梂度筑削，有馨鼓弗胜之意。 所为殿者三：日无极，日袭明，曰开化； 为堂者五：日三师，曰灵官，日瞻明，日朝彻，日虚白，斋厨库厩，方丈散室，檐溜户牖，金碧丹艘，集然一新。 下院蛇留全阳观，王郭村修真观，及常住物业，别刻之石。 或有偏而未举之处，周全阳门徒张志古等，思及先师正大初赴斋之时，我以后当居此之一言，谓是天意默定，不可以违，乃斜得千余指，同诚戮力，日增月续，以为国家祝寿祈福之所。 想成就浸大，未易量也。 辛亥，宪宗皇帝即位之元年，诏征掌教大宗师真常李真人，上亲受金盒香，白金五千两，佩金符，代礼巡祀岳渍，凡在祀典者，靡所不举。 明年春二月吉日，以御香来致上命。 礼成，以恩例改观为官，今之官名，自壬子始也。 渊虚李公乃全阳之弟子，丹阳马真人之玄孙。 全阳高弟五人，公其长也。 次日洞虚子张志渊，主东平鄹城白云观，度弟子千余人，庵观称是。 三日明元子梁守一，主古豳之玉峰，实全阳旧居之观也。 四日云外子贾守真，五日纯和子张志古，今嗣公主持本宫事。 今年春二月，知宫王志远持状就燕京大长春宫，禀掌教真常真人，欲具始末之实，归而刻之石。 宗师以润文见命，予年近八十矣，倦於笔砚久矣，度其不可违，因按其实而编次之。 且祖师可见之迹，玉峰胡子金既已有赞，平水毛收达有引，北平王子正有传，活死人墓四字，又有赵翰林闲闲亲笔，掌教真常真人跋语，并刻之石。 全阳周真人，渊虚李公，洞虚张公生前行事，亦各在秦棂砾彦容《金莲记》、《烟霞录》中，与祖师以下众师真同载《玄都宝藏》，俱不烦赘述。 虽然，予少壮时，述在进取，问为功利所夺，於根本之学则不暇也。 今兹三十余年，心得安於淡静，不为世教所束，收视反听，颇见虚极妙道，流行闭塞之所由，亦有数存於其问耳。 夫道前无始，后无终，天地虽大，未离乎内，秋毫虽小，待之成体，数岂得而拘之哉！ ．但於世行与不行之分耳。 《易》曰：苟非其人，道不虚行。 又日：神而明之，存乎其人。 故天将以是道大界於人也，於大化中，必先假乎一刚大中正特立、不为人欲所动，可以为师范之士降于世，兹吾祖师之所以出也。 故出则其材奔逸超绝，人莫能及，一遇至人点化，方寸开廓洞达，而游乎物先，仍能退藏於密，借兹地而以为活死人墓，而养之二年，其神异，其接人，其救世，光光相接，天地开辟以来，莫兹之盛，若非与冥理相契者，其能之乎？ 姑以长春仙翕一事言之，昔颜渊将之卫化卫君辄，孔子虑德厚信征，未达人气，名闻不争，未达人心，遂教以心斋，则所过者无有不化。 卫在春秋之世，一侯服之国耳，按王制，公侯田方百里，以数推而上之，而方千里者为方百里者百，方万里则是方千里者百，国家疆土方十里万，其视卫尊严大小之相去，为可见矣。",
      "translated_text": "One day, a man invited him to a vegetarian feast. Upon inquiry, Zhou learned that the man was a Daoist from this very hermitage, so he accompanied him back. The Daoist community begged to borrow his influence to promote their cause. Struck by how closely their aspirations aligned with his own, Zhou gladly agreed and added, *\"In the future, I shall reside here.\"*\n\nAfter the Great Dynasty’s revolution, Daoists from all directions, wishing to repay their origins and return to their beginnings, planned to transport timber and reclaim the land. In the year *Yiwei*, by decree of the Supreme Master of the Pure Harmony, Perfected Yin, and the Teaching Master, Perfected Li of True Constancy, along with a memorial from Prefectural Governor Lord Tian, Master Li Zhiyuan of Profound Emptiness was commissioned to lead the Daoist community in grand reconstruction efforts. All labored diligently, measuring, building, and carving, their fervor unmatched by drumbeats. Three halls were erected: the Hall of the Boundless, the Hall of Radiant Dawn, and the Hall of Enlightenment. Five chambers were built: the Hall of the Three Masters, the Hall of the Divine Officials, the Hall of Gazing Light, the Hall of Morning Clarity, and the Hall of Empty Whiteness. Kitchens, storehouses, stables, abbot’s quarters, guest rooms, eaves, doors, windows—all were adorned in gold and azure, gleaming with fresh splendor. The subordinate cloisters, the Quanyang Temple at Sheliu and the Cultivation Temple at Wangguo Village, along with the monastery’s properties, were recorded separately on stone.\n\nYet some tasks remained incomplete. Zhang Zhigu and other disciples of Perfected Quanyang Zhou recalled their master’s words from the *Zhengda* era, when he had accepted the feast: *\"In the future, I shall reside here.\"* They deemed this a silent decree of Heaven, not to be defied. Thus, they raised over a thousand strings of cash, pooling their sincerity and strength to expand the site day by day, month by month, intending it as a place to pray for the nation’s longevity and blessings. Its future growth seemed boundless.\n\nIn the first year of *Xinhai*, the year Emperor Xianzong ascended the throne, an imperial edict summoned the Teaching Master, Perfected Li of True Constancy. The Emperor personally bestowed upon him a golden incense casket, five thousand taels of silver, and a golden talisman, commanding him to perform the imperial rites of sacrifice at the sacred mountains and rivers. All ceremonies prescribed in the ritual canon were meticulously observed. The following spring, on an auspicious day in the second month, imperial incense was presented to fulfill the Emperor’s mandate. Upon completion of the rites, the monastery was elevated to official status by imperial grace—a designation that began in the year *Renzi*.\n\nMaster Li of Profound Emptiness was a disciple of Quanyang and a great-grandnephew of Perfected Ma of Cinnabar Yang. Among Quanyang’s five foremost disciples, he was the eldest. The second was Master Zhang Zhiyuan of Cave Emptiness, who presided over the White Cloud Temple in Zoucheng, Dongping, and ordained over a thousand disciples, with hermitages and temples to match. The third was Master Liang Shouyi of Illuminating Origin, who oversaw the Jade Peak Temple in ancient Bin, the very monastery where Quanyang had once resided. The fourth was Master Jia Shouzhen of Beyond Clouds, and the fifth was Master Zhang Zhigu of Pure Harmony, who now succeeded Master Li in administering the main temple.\n\nThis spring, in the second month, the temple’s overseer, Wang Zhiyuan, traveled to the Great Everlasting Spring Temple in Yanjing to report to the Teaching Master, Perfected Li of True Constancy, seeking to record the full history of the site and inscribe it on stone. The Master commanded me to refine the text. At nearly eighty years old, I had long grown weary of brush and ink, but sensing the request could not be refused, I arranged the facts in order.\n\nAs for the visible traces of the Patriarch, Hu Zijin of Jade Peak had already composed a eulogy, Mao Shouda of Pingshui had written a preface, and Wang Zizheng of Beiping had penned a biography. The four characters *\"Tomb of the Living Dead\"* were in the hand of Academician Zhao Xian of Leisure, and the Teaching Master, Perfected Li of True Constancy, had added a colophon—all of which were carved on stone. The deeds of Perfected Quanyang Zhou and Masters Li of Profound Emptiness and Zhang of Cave Emptiness in life were also recorded in Qin Lili’s *Records of the Golden Lotus* and *Records of Mist and Rosy Clouds*, while the Patriarch and subsequent masters were documented in the *Precious Treasury of the Mysterious Capital*. Thus, there is no need for repetition here.\n\nThough in my youth I pursued advancement, I was distracted by the pursuit of merit and profit, leaving no time for foundational studies. Now, over thirty years later, my heart has found peace in simplicity and stillness, unbound by worldly teachings. Turning my gaze inward and listening to the silence, I have glimpsed the wondrous Dao of utmost emptiness, understanding the flow and blockage of its currents—such insights arise from the interplay of fate. The Dao has no beginning before time nor end after it. Though heaven and earth are vast, they do not lie beyond its bounds; though an autumn hair is small, it relies on the Dao to take form. How could fate be confined by numbers? It is merely a matter of whether the Dao is practiced or abandoned in the world.\n\nAs the *Book of Changes* states: *\"If it is not the right person, the Dao will not manifest in vain.\"* And again: *\"To make it spiritually luminous depends on the person.\"* Thus, when Heaven intends to bestow this Dao upon humanity, within the great transformation, it first sends forth a figure of unyielding integrity, upright and steadfast, unmoved by human desires—one who can serve as a model for others. Such was the advent of our Patriarch. His talents were unmatched, surpassing all others. Upon encountering a perfected being who enlightened him, his mind expanded, becoming vast and penetrating, roaming beyond the material world. Yet he could also withdraw into seclusion, using this place as the *\"Tomb of the Living Dead\"* to nurture himself for two years. His divine marvels, his interactions with people, his salvation of the world—each radiance connected seamlessly, unparalleled since the opening of heaven and earth. If he had not been in harmony with the hidden principles of the cosmos, how could he have achieved this?\n\nConsider the case of Immortal Everlasting Spring. Long ago, when Yan Yuan was about to transform the ruler of Wei, Confucius feared that though his virtue was profound and his trustworthiness evident, the ruler’s *qi* might not be receptive, and though his reputation was unchallenged, the ruler’s heart might not be moved. Thus, he taught Yan Yuan the *\"fasting of the mind,\"* so that wherever he passed, none would remain unchanged. Wei was but a small feudal state in the Spring and Autumn period. According to the *Royal Regulations*, a duke or marquis governed a hundred *li* square. Calculating upward, a thousand *li* square would encompass a hundred such domains, and ten thousand *li* would encompass a hundred of those. The empire’s territory spans ten thousand *li*—the disparity in grandeur and scale between it and Wei is evident.",
      "overlap_context": "iujiang. Later, three to five disciples built a thatched hut to guard the site. In the early years of the *Zhengda* era, the Perfected Chongyang, Zhou Quandao, came from Youzhou to offer sacrifices at the tomb of the Patriarch in Liujiang. Suddenly recalling the place where the Patriarch had cultivated, transformed, and attained the Dao, he felt it could not be left to decay. A sense of indignation arose in his heart to restore it, which he could not suppress—it was as if a spirit had moved him.",
      "start_char": 1256,
      "end_char": 2477,
      "start_sentence": 54,
      "end_sentence": 85,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.97910666465759,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\宫观碑志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "皇帝又在数万里沙漠之北，诏书既至，长春国师即起而应之，如水之流湿，火之就燥，自相感召，无一毫预谋之私。 及其到也，而於应对之际，欢欣交通，大惬上意，由是就其善端发现之地，以行仁行孝，寡欲修身，用贤爱民，布德施惠，好生恶杀，奉承天心之数语而开导之，上亦听之不疑。 想四五十年问，而天下之人赖以存活者，与脱俘囚者，可胜计耶？ 瓦真风大阐，又皆众所共见者。 我仙筑澹然独居无功之地，而天下到今以真功归之，非神游物表，动与天合者不能也。 其祖师四梨八海棠张本之远意，有征矣。 今因喜此宫之兴建，又属以记当笔，故表而出之，庶几使学道者知祖师以下得其传者，一动一静，皆天而不人也。 苟杂之以人，非惟无成，其所丧多矣。 何谓天？",
      "translated_text": "The Emperor, moreover, resided beyond the deserts of the tens of thousands of *li* to the north. Yet once the imperial edict arrived, the National Preceptor Changchun rose at once to answer the summons—like water flowing toward the moist, like fire inclining toward the dry, a spontaneous resonance devoid of even the slightest trace of self-serving calculation. When he arrived, their exchanges were marked by joyous accord, wholly satisfying the Emperor’s intent. Thereupon, from the very ground where his virtuous inclinations first manifested, he guided the Emperor in practicing benevolence and filial piety, in curbing desires and cultivating the self, in employing the worthy and cherishing the people, in spreading virtue and bestowing kindness, in treasuring life and abhorring killing, and in aligning with the will of Heaven. The Emperor, in turn, received his counsel without doubt.\n\nOne may well imagine: over the course of forty or fifty years, how countless were the lives preserved and the captives freed through his influence? The great flourishing of the Vajra-True Wind was witnessed by all. Yet our immortal, dwelling in tranquil seclusion where no merit seemed apparent, has nonetheless been credited by the world with true achievement—this could only be the work of one who roams beyond the realm of things, whose every movement harmonizes with Heaven.\n\nHere, the profound intent of the ancestral master’s planting of the four pear and eight crabapple trees finds its confirmation. Now, in celebration of the construction of this temple and entrusted with the task of recording it, I set forth these words, that those who study the Dao may know: from the ancestral master onward, all who have received the transmission—whether in motion or stillness—act in accord with Heaven, not man. Should one adulterate it with the human, not only will no accomplishment arise, but the losses incurred will be great indeed.\n\nWhat, then, is Heaven?",
      "overlap_context": " Yuan the *\"fasting of the mind,\"* so that wherever he passed, none would remain unchanged. Wei was but a small feudal state in the Spring and Autumn period. According to the *Royal Regulations*, a duke or marquis governed a hundred *li* square. Calculating upward, a thousand *li* square would encompass a hundred such domains, and ten thousand *li* would encompass a hundred of those. The empire’s territory spans ten thousand *li*—the disparity in grandeur and scale between it and Wei is evident.",
      "start_char": 2477,
      "end_char": 2776,
      "start_sentence": 86,
      "end_sentence": 94,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.424255847930908,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\宫观碑志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "曰诚而已。 诚者心斋也，古之人修胸中之诚，以应天地之情，而天地人神不违者，其得所应之枢乎？ 勃建普天黄莓大醮碑 宣差总教佐玄寂照大师教门都道录冯志亨撰 宪宗皇帝内蕴神机之妙，其为用也大矣哉。 形而为武，则已无敌於海内矣，着而为文，则复能经纬於高厚矣。 是机之运，以无为宗，以道为门，以仁圣中正通明为所归，其无事则机缄万化，而退藏之於密，虽名之以天地之鉴，万有之镜，实不可得而窥测之也。 及其应世，则博博渊泉而时出之。 溥博如天，渊泉如海，化而为德，则汪洋湛厚，靡有一物不在润泽中者。 至於与两仪合德，四时合序，先天奉天之事，层见错出，不可褊举，姑於一日二日万机之中，取一事而言之。 癸丑冬十月十有七日，诏至修真道士提点王志坦，访问身体康宁，寿数长久之说。 志坦对以养生三二语讫，因就善端发见之处，款曲将顺，投之以言日：此山林枯槁之士为一己之务，非天子之急务也。 惟天地万物父母，惟人万物之灵，爱民不能独治，遂立之君。 皇帝代天治民，当於民兴大利除大害，以奉承天心，则天降之福寿，如影响之应形声矣。 往年扫除弊政。 与民更始，而民之安生者，然已受赐矣。 惟国朝自开创以来，干戈饥馑，刑罚或中或否，其横罹凶害，沉魂滞魄，困於幽狱，无由出离者，可胜计哉！ ．愿皇帝圣慈，选有道之士，依黄录玄科，普行济度，使幽魂苦爽，出离冥途，咸遂超升，此莫大之泽矣。 上嘉纳其言，即日遣中使数十人驰驿四出，各就方国行荐拔事。 扎忽儿学士阿怜博儿赤、提点王志坦，乘传持密旨来燕京大长春宫，特命掌教真常至德又玄真人李志常主醮，作大济度师，．断事大官人牙鲁瓦赤布只儿奉营办醮事，中使扎忽儿学士已下四人作行礼官，仍随路选清高有道之士，设普天黄录大醮三千六百分位。 甲寅春三月初九日至十六日，凡七昼夜，有司不奏刑名，闻井禁屠宰，出御府黄金五百八十两，白金三千八百两，彩缯千匹，为镇金信币之须，婶花、油、烛、梅檀、沉水、龙胭、降真，为飨献之礼，其余皆府库支给，不令扰民，又以银钞五十两补其阙。 密词九通，玉简三面，皆宸翰亲署，礼官监使，道流士庶，旌幢仪卫，自通玄门，迎来醮所。 钦惟持守之君，所当先荐者，祖宗往圣，眷属先灵，就紫府已回光，常瞻慧日，至仙阶而列品，永佑皇邦，下至於兵死俘亡，横遭刑戮，一切冤枉，有主无主，同仁一视，靡有遗弃。 其或忠臣义士，各为其主，而至其死命，与小国君主，不知天命所在犯五不逮，自致逆命之讨，以常情视之，兹二者则为不赦之仇条矣，皇帝若日：群雄当战伐之冲，实多冤鬼，一圣廓乾坤之度，孰匪吾民。 但深如子，以恤横亡，岂可得鹿而忿同猎。 故尽沉沦之属，咸收荐拔之中。 此自古帝王未尝举者，岂惟未尝举，其感通之力，而相去亦远矣。 何以言之？ 昔者禹会诸侯於涂山，执玉帛者万国。 以王制考之，侯伯地方百里，方千里，则是方百里者百，方万里则是方千里百百，而涂山之会，止是方万里之地耳。 国家有十万里之疆土，其势力在古万乘百倍之上，今为此自古帝王未尝举之举，而海内万姓，亡者不言可知，虽在世者，於各人亲族师友之间，遭四五十年兵乱，但犯冤枉，沉在幽狱，其有不沾丐者乎？",
      "translated_text": "\"Simply sincerity—nothing more. Sincerity is the fasting of the mind. The ancients cultivated the sincerity within their breasts to respond to the sentiments of Heaven and Earth, and thus Heaven, Earth, humans, and spirits never opposed them—was this not because they had grasped the pivot of response?\n\n*Stele Inscription for the Grand Yellow Register Offering of All Under Heaven*\nComposed by Feng Zhiheng, Grand Master of the Teaching, Administrator of the Daoist Clergy, and Imperial Commissioner for the Propagation of the Mysterious and Tranquil\n\nThe profound divine mechanism latent within Emperor Xianzong’s inner being—how vast its application! Manifested as martial prowess, he has become invincible throughout the realm; expressed as civil governance, he orders the lofty and profound with mastery. The operation of this mechanism takes non-action as its essence, the Dao as its gateway, and benevolence, sageliness, centrality, uprightness, and luminosity as its ultimate return. In times of no event, it seals the myriad transformations and retreats into concealment—even if named the mirror of Heaven and Earth or the looking-glass of the ten thousand existences, its depths remain unfathomable. Yet when it responds to the world, it pours forth like a boundless spring, timely and inexhaustible. Vast as Heaven, deep as the sea, when transformed into virtue, it becomes an immeasurable expanse of depth and generosity, so that not a single being remains untouched by its moistening grace.\n\nIn harmonizing virtue with the Two Modes and aligning sequence with the Four Seasons, in the affairs of serving Heaven by preceding it—such manifestations emerge in layered succession, too numerous to recount in full. Let us take but one instance from among the myriad affairs of a single day.\n\nOn the seventeenth day of the tenth month in the winter of *guichou*, an edict arrived summoning Daoist Master Wang Zhitan, Director of the Bureau for the Cultivation of Perfection, to inquire about the methods for ensuring bodily health and longevity. Zhitan responded with a few words on nurturing life, then, seizing upon the moment when the emperor’s benevolent intent became apparent, he spoke at length in accord with his sovereign’s inclinations, saying: \"The concerns of these withered recluses of the mountains and forests pertain only to their own affairs—they are not the urgent matters of the Son of Heaven. Heaven and Earth are the parents of the ten thousand things, and humans are the most spiritually endowed among them. Yet the ruler cannot govern alone, so he establishes a sovereign. The emperor, acting on Heaven’s behalf to govern the people, should promote the greatest benefits and eliminate the greatest harms to fulfill Heaven’s will. Then the blessings and longevity bestowed by Heaven will follow as surely as an echo answers a sound or a shadow follows a form.\n\nIn past years, you swept away corrupt policies and gave the people a fresh beginning, and they have already received your bounty. Yet since the founding of our dynasty, through warfare, famine, and the uneven application of punishments, countless souls have suffered violent deaths, their spirits trapped in the dark prisons of the underworld, unable to escape. How can their number be reckoned? I humbly beseech Your Majesty’s sagely compassion to select masters of the Dao, follow the Mysterious Rites of the Yellow Register, and conduct a universal deliverance, so that the suffering souls in the nether realms may depart from their dark paths and all attain liberation and ascent. This would be the greatest of all benefactions.\"\n\nThe emperor praised and accepted his words. That very day, he dispatched dozens of imperial envoys to all regions by post-horse, each charged with conducting rites of deliverance in their respective domains. The academician Zhahuer, the *boyi chi* Alian, and Director Wang Zhitan traveled by relay carriage bearing secret instructions to the Great Everlasting Spring Abbey in Yanjing. There, the emperor specially commanded Li Zhichang, Perfected of True Constancy and Supreme Virtue, Mysterious and Profound, to preside over the offering and serve as the Great Master of Deliverance. The *duan shi* official Yalawaichi Buzhier oversaw the preparations, while the academician Zhahuer and three other envoys served as ritual officers. Along the way, they selected pure and lofty masters of the Dao to establish the Grand Yellow Register Offering of All Under Heaven, with three thousand six hundred altar stations.\n\nFrom the ninth to the sixteenth day of the third month in the spring of *jiayin*, for seven days and nights, the authorities suspended all legal proceedings, the markets and wells forbade slaughter, and the imperial treasury provided five hundred eighty taels of gold, three thousand eight hundred taels of silver, and a thousand bolts of colored silk for the requisite ritual gold and silk offerings. Incense, oil, candles, plum blossoms, sandalwood, aloeswood, dragon’s brain, and *jiangzhen* were prepared for the sacrificial rites. All other expenses were drawn from the imperial storehouses, without troubling the people. An additional fifty taels of silver notes were issued to cover any shortfalls.\n\nNine secret memorials and three jade tablets were inscribed in the emperor’s own hand. Ritual officers and envoys oversaw the proceedings, while Daoist clergy and commoners, with banners and ceremonial guards, welcomed the offerings from the Gate of Communing with the Mysterious to the altar site.\n\nThe emperor, as a ruler who upholds and preserves the Dao, first offered prayers for his imperial ancestors, the sagely departed, and the spirits of his kin—those who have already returned to the Purple Palace, ever gazing upon the sun of wisdom, and those who stand ranked upon the immortal steps, eternally protecting the imperial domain. Extending to those who died in battle, perished as captives, or suffered unjust execution, whether their spirits had claimants or not, all were regarded with equal benevolence, none abandoned.\n\nSome were loyal ministers and righteous knights who gave their lives for their lords, while others were rulers of small states who, unaware of Heaven’s mandate, violated the five prohibitions and brought upon themselves the punitive expeditions of rebellion. By ordinary standards, these two groups would be deemed irreconcilable enemies. Yet the emperor declared: \"Amid the turmoil of warring factions, how many were wronged in death? In the vastness of a sage’s governance, who is not my subject? I cherish them as deeply as a father cherishes his children, mourning those who perished unjustly. How could I, having gained the realm, bear grudges against my fellow hunters?\" Thus, all who had sunk into darkness were gathered into the deliverance.\n\nThis is an undertaking no emperor of antiquity ever attempted—indeed, not only did they never attempt it, but the power of their spiritual resonance falls far short of this. How can this be demonstrated? In ancient times, Yu convened the feudal lords at Mount Tu, where ten thousand states presented jade and silk. By the standards of the *Royal Regulations*, a lord’s domain spanned a hundred *li*, and a royal domain a thousand *li*—thus, a thousand-*li* domain would encompass a hundred hundred-*li* domains. Yet the gathering at Mount Tu represented only a ten-thousand-*li* realm. Our dynasty commands a territory of a million *li*, its power a hundredfold greater than that of the ancient Son of Heaven. Now, in performing this deed unparalleled in imperial history, the blessings for the living are self-evident. Even among the living, within each person’s circle of kin, teachers, and friends, those who suffered unjustly during four or five decades of warfare and remain trapped in the dark prisons—who among them has not received this grace?\"",
      "overlap_context": " eight crabapple trees finds its confirmation. Now, in celebration of the construction of this temple and entrusted with the task of recording it, I set forth these words, that those who study the Dao may know: from the ancestral master onward, all who have received the transmission—whether in motion or stillness—act in accord with Heaven, not man. Should one adulterate it with the human, not only will no accomplishment arise, but the losses incurred will be great indeed.\n\nWhat, then, is Heaven?",
      "start_char": 2776,
      "end_char": 4030,
      "start_sentence": 95,
      "end_sentence": 125,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.96917676925659,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\宫观碑志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "人非木石，安得不动於中欤！ ．既有动於中，遂形之於言，咸日：大哉皇帝之德，则天地之德也，心则天地之心也，此神机之妙，与和声协气其用之交，上帝达三清，极六合，内外之神祇，於无声无臭之中，流通混合，自相感召，旁砖为一，则亦何求而不遂哉！ ．瓦大宗师真常真人李公，所率金冠云服，星冠紫服，登坛惮者五千人，皆清高洁白，深通秘典，严持斋法有道之士。 醮下代礼官，国家重臣，观其精真充实，无一毫人伪之问，加之大道运慈，将藏用显仁之妙，自龙汉赤明之前，措之三录科中，善救人而无弃人，善救物而无弃物，宜乎真风慧日，鼓舞临照，幽室为之尽晓，寒谷为之回春，旁通曲畅，俾沉滞之属潜沐阴被，根本分上，光光相射，各自照了。 设有未悟，先觉后觉，转相汲引，以明袭明，出彼入此，同观众妙，靡有叹其独遗者。 功德巍巍，下蟠上际，岂笔舌能形容哉．迎词之日，主醮大宗师并典礼营办众官，命纪其事，以光扬皇帝莫大之盛德。 愚谓域中有四大，而王居其一，此道经之微言也。 仰观俯察，知幽明死，生之故，天地设位，圣人成能此，并易系之文也。 圣人之道，洋洋乎发育万物，峻极于天，此中庸之语也。 盖皆取能将神机之妙扩而充之，从微至着，以至德泽满天地，灵光施四海耳。 今究此存亡兼济，亲郁不择，千百倍前王至仁之一举，起本於听纳道士志坦之一言，即行之不疑，有沛然若央江河，莫之能御之势，非受善之地於裁成辅相之余，常有一至诚不息之理存者，能之乎？ 皇基孔固，圣寿无疆，天佑人助，词官祝厘之请，有所预焉。 拜手稽首，属之以辞曰：域中四大，帝居其一。 神机妙用，退藏於密，刚健纯粹，发而为爱民之德。 或出之於溺沉，或跻之於寿域。 洋溢周褊，四海充塞。 参赞之余，至诚不息。 每虑沉魂，恩波未及。 念此在此，弗遑寝食。 垂问羽流，曰凭道力。 嘉纳至言，而康而色。 使车四驰，各就方国。 普天大醮，拯救甚急。 燕京琳宫，诏旨密通。 精神潜会，风虎云龙。 百色用度，给赐特丰。 宗师道流，款恳敬恭。 行事献飨，坛惮尤崇。 礼官大臣，有肃其容。 气志如神，清明在躬。 英华发外，和气积中。 以此宣弘其圣泽，宜幽府混合於真空。 先觉后觉，悟之则伺。 诚能回光於顷刻，得观众妙於无穷实亡者针芥之幸，信万劫之难逢。 作此辞章，纪皇帝神机妙用之功。 元重修亳州太清宫太极殿碑 翰林学士承旨知制语兼修国史臣王鹊奉劲撰 今上皇帝之在藩邸也，雅知尊崇玄教，将修太清。 岁舍己未，尝有旨禁民樵采，及使臣行军，无听留宿，以妨兴建。 即位之二年，特降玺书，一如前旨。 四年，遣真常真人萧居寿、近侍合刺思，命学士院撰祝文，备礼以祭。 越五年，太极殿成，长春嗣教诚明真人张志敬，同左丞张文谦，侍中刘乘礼，奏乞树碑以纪岁月，从之。 诏词臣王鹦文其事。 臣闻命惕然，敢拜手稽首而为之言日：太上老君无世不出，无代不崇。 至於殷武丁庚辰岁，化生苦县之濑乡，谓娠至八十一年，生有七十二相，以皓首而称老子，指李木而得姓氏，其变易名号，灵踪圣迹，前贤说之详矣，兹不敢赘以芜辞。 惟前代推尊，后人绍述，或可得而言焉。",
      "translated_text": "How could mortal hearts, unlike wood or stone, remain unmoved within? Once stirred within, these sentiments took form in speech, and all proclaimed: \"Great is the Emperor’s virtue—it is the virtue of Heaven and Earth! His heart is the heart of Heaven and Earth! This marvel of divine mechanism, in harmony with the concordant qi, operates in perfect exchange. Through it, the Supreme Lord reaches the Three Clarities, pervades the Six Directions, and unites the spirits within and without. In the realm of the soundless and scentless, all flows and merges, naturally summoning one another, coalescing into oneness—what could remain unfulfilled?\n\nThe Great Master of the Lineage, Perpetual Perfection Realized Man Li, led five thousand gold-crowned and cloud-robed, star-crowned and purple-vested practitioners who ascended the altar in reverence. All were pure, lofty, and unsullied, deeply versed in esoteric scriptures, strictly observing the fasts and rituals of the Dao. Beneath the altar, the officiating ritual masters and the dynasty’s senior ministers witnessed their essence as utterly authentic, free from the slightest trace of human artifice. Augmented by the Dao’s compassionate workings, which conceal its use to manifest benevolence, since the eras of Dragon Han and Crimson Clarity, these deeds have been recorded in the Three Registers. They excel in saving people without abandoning a single one, in saving things without discarding a single thing. Thus, the true wind and wisdom-sun inspire and illuminate, dispelling darkness in the deepest chambers and reviving spring in frozen valleys. Every corner flows unimpeded, allowing those long mired in obscurity to bathe in hidden blessings. At the root and in their very nature, radiance reflects radiance, each illuminating itself. Should any remain unenlightened, the awakened guide the yet-to-awaken, passing clarity from one to another, emerging from one state to enter another, together beholding the manifold wonders—none sighing as if left behind.\n\nThe merit is towering, spanning from the depths below to the heights above—how could brush or tongue ever capture it? On the day of the welcoming rites, the Great Master presiding over the ritual, along with the officiating officials and all those who prepared the ceremony, commanded that this event be recorded to glorify the Emperor’s unparalleled virtue.\n\nI reflect: among the Four Great of the world, the King occupies one—this is the subtle teaching of the Daoist scriptures. Looking up and down, we discern the causes of the hidden and the manifest, life and death. Heaven and Earth establish their positions, and the Sage fulfills their potential—this aligns with the words of the *Appended Judgments* of the *Book of Changes*. The Sage’s Dao, vast and overflowing, nurtures the myriad things and ascends to the heights of Heaven—this is the language of the *Doctrine of the Mean*. All these draw upon the marvel of divine mechanism, expanding it to its fullest, progressing from the subtle to the manifest, until virtue and grace fill Heaven and Earth, and numinous radiance extends across the Four Seas.\n\nNow, this act of universal salvation—encompassing both the living and the dead, embracing all without distinction—surpasses the utmost benevolence of former kings a hundredfold. It originated from heeding a single word from the Daoist monk Zhi Tan, and was executed without hesitation, surging forth like the boundless Yangtze and Yellow River, irresistible in its force. Could this have been achieved without a foundation of utmost sincerity, a principle of unceasing cultivation in the art of shaping and aiding all things?\n\nThe imperial foundation stands firm, the Sage’s longevity boundless. With Heaven’s protection and the people’s support, the prayers of the ritual officials for blessings are already fulfilled. Bowing deeply, I compose these words:\n\nAmong the Four Great of the world, the Emperor occupies one.\nThe marvelous workings of divine mechanism, though hidden in secrecy,\nEmerge as pure and unyielding, manifesting as the virtue of loving the people.\nSome are rescued from drowning,\nOthers are raised to the realm of longevity.\nOverflowing and all-pervading,\nIt fills the Four Seas.\nBeyond such assistance,\nUnceasing sincerity remains.\nEver mindful of the lost souls,\nWhose grace has not yet reached them,\nHe pondered this day and night,\nUnable to rest or eat.\nHe inquired of the feathered ones,\nWho replied: \"Rely on the power of the Dao.\"\nDelighted by this counsel,\nHis countenance brightened.\nHe dispatched chariots in all four directions,\nEach to their respective regions.\nA great ritual for all under Heaven,\nTo urgently deliver and save.\nIn the Jade Palace of Yan,\nImperial decrees flowed in secret.\nSpirits converged in hidden communion,\nLike wind and tiger, cloud and dragon.\nAll provisions and expenses\nWere granted with exceptional generosity.\nThe lineage masters and Daoist practitioners,\nSincere and reverent,\nConducted the rites and offerings,\nThe altar rites lofty and solemn.\nThe ritual officials and senior ministers\nMaintained solemn demeanor.\nTheir qi and will were as if divine,\nTheir persons clear and bright.\nVital essence radiated outward,\nHarmonious qi accumulated within.\nThrough this, the Sage’s grace was proclaimed,\nAnd the netherworld merged with the True Void.\nThe awakened and the yet-to-awaken,\nOnce enlightened, follow in turn.\nIf one can turn their light inward for but a moment,\nThey may behold the boundless wonders.\nFor the dead, this is a stroke of fortune finer than a needle’s point,\nTruly a once-in-ten-thousand-kalpas opportunity.\nThese verses record the Emperor’s marvelous workings of divine mechanism.\n\nThis stele commemorates the reconstruction of the Hall of the Supreme Ultimate at the Palace of Great Clarity in Bozhou.\n\nComposed by Minister Wang Que, Hanlin Academician, Drafter of Edicts, and Compiler of the National History, by imperial command.\n\nWhen the present Emperor was still a prince in his fiefdom, he revered and honored the Mysterious Teachings, intending to restore the Palace of Great Clarity. In the year *jisi* (1259), he issued an edict forbidding the people from gathering firewood and ordered that military envoys not be allowed to stay overnight, lest they hinder the construction. In the second year of his reign, he specially issued an imperial rescript, reaffirming the earlier decree. In the fourth year, he dispatched Perpetual Perfection Realized Man Xiao Jushou and the attendant Helasi, commanding the Academy of Scholarly Worthies to compose a prayer text and prepare the ritual offerings for the sacrifice. In the fifth year, with the Hall of the Supreme Ultimate completed, Zhang Zhijing, the Successor of the Ever-Spring Teaching and Perfected One of Sincerity and Clarity, along with Left Minister Zhang Wenqian and Chamberlain Liu Chengli, memorialized the throne, requesting that a stele be erected to record the event. The Emperor assented and ordered the court scholar Wang Que to compose the inscription.\n\nI, having received this command, dare to bow deeply and speak thus: The Most High Lord Lao never fails to appear in any age, nor is he ever unvenerated in any era. In the *gengchen* year of King Wu Ding of Yin, he was born in Lai Xiang of Ku County, having gestated for eighty-one years. Endowed with seventy-two marks of perfection, he was called \"Laozi\" for his hoary hair and took the surname Li from the plum tree. His transformations of name and title, his numinous traces and sagely deeds, have been recounted in detail by earlier worthies—I dare not clutter this inscription with redundant words. Yet the reverence shown by former dynasties and the transmission by later generations may still be worth recounting.",
      "overlap_context": "d only a ten-thousand-*li* realm. Our dynasty commands a territory of a million *li*, its power a hundredfold greater than that of the ancient Son of Heaven. Now, in performing this deed unparalleled in imperial history, the blessings for the living are self-evident. Even among the living, within each person’s circle of kin, teachers, and friends, those who suffered unjustly during four or five decades of warfare and remain trapped in the dark prisons—who among them has not received this grace?\"",
      "start_char": 4030,
      "end_char": 5248,
      "start_sentence": 126,
      "end_sentence": 171,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.57833814620972,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\宫观碑志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "秦墦诗书，汉杂霸道，玄宫崇奉，未闻肇立之由。 至汉桓帝廷熹八年，因帝梦老君降于殿庭，再遣中常侍左倌诣祠致祭，座设华盖，乐用郊天，乃命陈相边诏演而铭之。 隋文帝开皇六年，诏亳州刺史杨元冑考其故迩，营建宫宇，劝内史舍人薛道衡作柯庭颂。 唐推姓系，尊为圣祖，太宗贞观元年，劲修其宫，始给人户五十以供洒扫。 高宗乾封中，亲谒道官，追上尊号为玄元上德皇帝，宫殿坛宇，并令修创，置令丞各一员，岁时荐飨。 玄宗开元三年，东封岱岳，回谒于旧宅，亲书《道》、《德》二经，俾刊诸石。 二十年，帝自制霓裳羽衣曲、紫微八卦舞以荐献。 天宝二年，制改谯郡紫极宫为太清宫也。 四载，亲幸，复制降真召仙、紫微送仙二曲以迎送之，易祝版为青词，御署则日嗣皇帝臣某，仍劫有司，着为定式。 文宗太和七年，宫经水潦，颇致摧毁，劫宣武军节度使李程兼充太清宫使，渐加修茸，寻复完美。 宋太祖建隆元年，遣使诣祠。 太宗淳化四年，遣修宫宇，建至明道元年，工毕，诏水部员外郎和蒙撰碑铭，自是专命中使监领。 真宗咸平五年，遣内侍重修，增给卫士。 景德二年，禁四向樵苏。 大中祥符五年，遣三司使丁谓代谒。 六年，躬诣，七年，复往，亲奉册宝，上尊号曰太上混元上德皇帝。 哲宗绍圣五年，知亳州喻陆奏诸瑞应，遣使醮谢，且诏本路转运司，凡官宇之弊者，随即缮完。 徽宗崇宁改元，诏翰林学士张商英作记，以成哲宗之志。 金代累朝，尤加异数，给道士良田数万亩，复其税役，田夫野叟，至今犹能道之。 此前代、推尊之略，使后世向道者以考焉。 若夫绍述之人，自青牛西迈，尹喜恳梼，强为着五千言，日清争无为，日不争不耀，佳兵为不祥，以治国若烹鲜，以驰骋田猎，令人发狂，以孤寡不谷，王公自称，推此以平天下，国家无余蕴矣。 至於正心修身，二经具载，求之则有余。 师祖述《道德》，四辅相承，率遵前轨，於是《洞灵》、《通玄》、《冲虚》、《南华》之书出焉。 世衰俗薄，邪说并兴，因之为幻惑者有之，流而为谲怪者有之。 天之未丧斯道也，近世有全真家出，恬淡有守，动循故辙，自王重阳得正阳、纯阳之传，培植基本，付作者六人，在处联芳，枝叶丛茂。 国朝开创，征长春敷畅玄元，亲承睿春，天下靡然向风，虽三家聚落，万里邮亭，皆知敬奉，其操守道行，阴德与太上符合，太清所以重建也。 太清顷罹兵烬，复值河涡合流，向之仙宫，漂荡无余，但数千年九龙井仅得存耳。 长春仙蜕，传法真常，时则有今安肃公张柔戍兵亳社，命官持疏，俾事修建。 真常先委隐真大师提点石志玉、通微大师知宫李志秘为之经始，公亦委曲用心，拯力护持，其参佐卒伍，亦皆乐赴，仍给据并宫施地周四十里。 无何厥功肇启，而真常示寂。 逮吾诚明之嗣教也。 承海都太子之命，敦请崇道真人张志素、栖云真人王志谨同办其事。 栖云未几物故，其门人辈尤为致力，崇道则朝夕以之，始终匪懈，增筑故基丈余，问架九楹，视旧制殊为壮丽。 像太上于其中，束华、文始列于左右，洞灵、通玄、冲虚、南华次之，仙貌俨然，见者加敬。 虽余者未完，已足以奉香火之供，而为国朝万世析福之地，顾不伟欤。",
      "translated_text": "The Qin burned the *Odes* and *Documents*, while the Han mingled hegemonic rule with the Dao. Though the numinous palace revered and honored him, the origins of its founding remained unrecorded. Not until the eighth year of *Yanxi* in the reign of Emperor Huan of Han did the emperor dream of Lord Lao descending into the palace courtyard. He twice dispatched the Palace Attendant Zuo Guan to the shrine to offer sacrifices, setting up an ornate canopy and employing the music of the suburban rites to heaven. He then ordered Bian Zhao, the Chancellor of Chen, to compose and inscribe an account.\n\nIn the sixth year of *Kaihuang* under Emperor Wen of Sui, an edict commanded Yang Yuanjiu, the Prefect of Bozhou, to investigate the ancient site and construct palace halls. He urged the Palace Secretary Xue Daoheng to compose the *Ode to the Shrine Courtyard*. The Tang, tracing their lineage, honored him as the Sagely Ancestor. In the first year of *Zhenguan* under Emperor Taizong, the palace was vigorously repaired, and fifty households were assigned to maintain its cleanliness. During the *Qianfeng* era of Emperor Gaozong, the emperor personally visited the Daoist palace, posthumously bestowing the august title of *Supreme Virtue Emperor of the Mysterious Origin*. The halls, altars, and structures were all ordered to be renovated, with a prefect and vice-prefect appointed to oversee seasonal offerings.\n\nIn the third year of *Kaiyuan* under Emperor Xuanzong, after the eastern pilgrimage to Mount Tai, the emperor returned to pay homage at the old residence. He personally inscribed the *Dao* and *Virtue* classics and had them carved into stone. In the twentieth year, the emperor composed the *Rainbow Skirt and Feathered Robe Dance* and the *Purple Tenuity and Eight Trigrams Dance* as offerings. In the second year of *Tianbao*, an edict renamed the Purple Ultimate Palace of Qiao Commandery as the Supreme Clarity Palace. In the fourth year, the emperor personally visited and composed the *Descending Perfection and Summoning Immortals* and *Purple Tenuity and Sending Forth Immortals* melodies for welcoming and sending off the deities. He replaced the prayer tablets with blue-green petitions, signing them as \"the succeeding emperor, your subject so-and-so,\" and ordered the officials to establish this as a fixed ritual.\n\nIn the seventh year of *Taihe* under Emperor Wenzong, the palace suffered damage from floods, and the emperor urgently appointed Li Cheng, the Military Commissioner of Xuanwu, to serve concurrently as the Superintendent of the Supreme Clarity Palace. Gradually, repairs were made, and the palace was restored to its former beauty. In the first year of *Jianlong* under Emperor Taizu of Song, envoys were dispatched to the shrine. In the fourth year of *Chunhua* under Emperor Taizong, construction of the palace halls began, and by the first year of *Zhiming*, the work was completed. An edict ordered He Meng, the Vice Director of the Bureau of Waterways, to compose an inscription. Thereafter, eunuchs were exclusively appointed to oversee the site.\n\nIn the fifth year of *Xianping* under Emperor Zhenzong, palace attendants were sent to undertake major renovations, and additional guards were assigned. In the second year of *Jingde*, gathering firewood in the four directions was prohibited. In the fifth year of *Dazhong Xiangfu*, the Minister of Revenue Ding Wei was sent to offer reverence on the emperor’s behalf. In the sixth year, the emperor personally visited, and in the seventh year, he returned to present the imperial charter and seal, bestowing the august title of *Supreme Origin and Perfect Virtue Emperor*. In the fifth year of *Shaosheng* under Emperor Zhezong, Yu Lu, the Prefect of Bozhou, reported various auspicious signs. Envoys were dispatched to offer thanksgiving sacrifices, and an edict commanded the Circuit Transport Commissioner to repair any dilapidated palace structures as needed.\n\nIn the first year of *Chongning* under Emperor Huizong, an edict ordered the Hanlin Academician Zhang Shangying to compose a record to fulfill the intentions of Emperor Zhezong. Through successive reigns of the Jin dynasty, extraordinary honors were repeatedly bestowed. Tens of thousands of *mu* of fertile land were granted to Daoist priests, exempting them from taxes and corvée. Even today, farmers and villagers still speak of it. These are but outlines of how former dynasties revered him, providing later generations who turn to the Dao with material for reflection.\n\nAs for those who transmitted his teachings: after the Blue Ox journeyed west, Yin Xi earnestly entreated him, compelling him to compose the five thousand words. He spoke of \"pure contention and non-action,\" of \"not contending and not shining,\" declaring that \"fine weapons are inauspicious.\" He likened governing a state to cooking a small fish, warned that galloping and hunting drive men mad, and taught that kings and dukes should style themselves as \"solitary\" and \"unworthy.\" By applying these principles to pacify the realm, no resources would remain untapped. As for rectifying the mind and cultivating the self, the two classics contain all that is needed—those who seek will find more than enough.\n\nThe patriarchs transmitted the *Dao and Virtue*, with four auxiliary texts following in succession, all adhering to the ancient path. Thus emerged the books *Cavernous Numinosity*, *Penetrating the Mysterious*, *Embracing the Void*, and *Southern Florescence*. As the age declined and customs grew shallow, heterodox doctrines arose alongside them. Some distorted them into illusions, while others let them drift into strange and uncanny practices.\n\nYet Heaven had not yet abandoned this Dao. In recent times, the Quanzhen school emerged, its adherents serene and steadfast, moving in accordance with the old tracks. Wang Chongyang received the transmission from Perfect Yang and Pure Yang, nurturing its roots and entrusting it to six disciples. Wherever they went, fragrance spread, and branches and leaves flourished. When the present dynasty was founded, it summoned Changchun to expound the mysteries of the Mysterious Origin. Having personally received the sagely teachings, the realm turned as one toward the Dao. Even in the humblest hamlets and the most remote postal stations, all knew to revere and honor it. Their moral conduct and virtuous deeds, their hidden merits, aligned with those of the Supreme Lord—this is why the Supreme Clarity Palace was rebuilt.\n\nThe Supreme Clarity Palace had recently suffered from war and fire, and the confluence of the Yellow and Wo Rivers had swept away what remained of the immortal halls. Only the Nine Dragon Well from thousands of years past survived. After Changchun’s ascension, the Dharma was transmitted to Zhenchang. At that time, the present Duke of Ansuxiang, Zhang Rou, was stationed in Bozhou. He ordered an official to present a memorial, urging the restoration of the palace. Zhenchang first entrusted the Hidden Perfection Master and Superintendent Shi Zhiyu and the Penetrating the Mysterious Master and Palace Director Li Zhimi to commence the work. The duke also devoted himself wholeheartedly, providing support and protection. His officers and soldiers all willingly contributed, and land extending forty *li* around the palace was granted as an endowment.\n\nBefore long, the work began, but Zhenchang passed away. When I succeeded to the teaching, I received the command of Prince Haidu to earnestly invite the Venerable Daoist Zhang Zhisu and the Cloud-Dwelling Daoist Wang Zhijin to jointly oversee the project. Cloud-Dwelling passed away shortly after, but his disciples redoubled their efforts. Venerable Daoist labored day and night without respite. The old foundations were raised by over a *zhang*, and nine bays were constructed, far surpassing the former structure in grandeur. Within, an image of the Supreme Lord was enshrined, with Shu Hua and Wen Shi arrayed to his left and right, followed by *Cavernous Numinosity*, *Penetrating the Mysterious*, *Embracing the Void*, and *Southern Florescence*. The immortal visages stood solemnly, inspiring reverence in all who beheld them.\n\nThough some details remain unfinished, the palace is already sufficient to offer incense and maintain the sacred flame, serving as a place for the dynasty to pray for blessings through ten thousand generations. Is this not magnificent?",
      "overlap_context": "rn in Lai Xiang of Ku County, having gestated for eighty-one years. Endowed with seventy-two marks of perfection, he was called \"Laozi\" for his hoary hair and took the surname Li from the plum tree. His transformations of name and title, his numinous traces and sagely deeds, have been recounted in detail by earlier worthies—I dare not clutter this inscription with redundant words. Yet the reverence shown by former dynasties and the transmission by later generations may still be worth recounting.",
      "start_char": 5248,
      "end_char": 6466,
      "start_sentence": 172,
      "end_sentence": 206,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.15826368331909,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\宫观碑志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "主上圣德日新，神武电断，西平大理，束服三韩，南州逆竖，旋即诛夷，朔漠诸王，毕来朝会，分司揆务，偃武修文，此浸明昌千载一时之运也。 然犹祇畏上玄，聿修严祀。 是宫之建，日月可冀矣。 臣待罪词林，忝承睿旨，谨再拜而铭之。 其辞日： 圣人不仁，其民淳淳。 智慧一出，百伪丧真。 天何言哉，是生至人。 厥生惟何，涡水之滨。 生而神异，绝圣弃智。 居实处厚，解纷挫锐。 不仕污君，甘处下位。 青牛西驾，避名避地。 《道》、《德》二篇，立言五千。 为以无为，玄之又玄。 爱民治国，万世可传。 其谁之子，象帝之先。 永惟帝则，混元上德。 立祠水滨，单飞雉翼。 宫曰太清，殿日太极。 仙真名县，增贲谯国。 黄河汤汤，犯我谷阳。 巍巍官殿，今也则亡。 兴起有数，待我时昌。 诚明嗣教，继志真常。 志秘、志玉，先为卜筑。 崇道、栖云，听然绍服，一殿告成，望之肃肃。 於万斯年，为国祈福。 功成匪他，崇道居多。 臣不归美，如君恩何。 庆源九井，福作两河。 小臣祚铭，以代弦歌。 中都十方大天长观重修碑 翰林侍讲学士知制诰兼修国史臣郑子聘奉劲撰 大定十四年三月，户部尚书臣仲愈、劝农使臣仅言奏：十方大天长观馆御既安，像设既严，敢以闻。 是月既望，天子暨皇太子率百执事，款谒修虔，遂命为道场三日夜以庆成。 先是，召西京路传戒坛主清虚大师阎德源住持，劫授提点观事。 越十九年秋九月，乃诏承学之臣文其碑。 臣子聪待罪北门，实当书，敢考观之所以废兴扬摧而叔之。 臣谨按《图经》及旧碑，盖肇迩唐玄宗开元中，命之日天长，颇极壮丽。 岁久不茸，颓圯滋甚。 至咸通七年，卢龙军节度使张允伸缮而新之。",
      "translated_text": "His Imperial Majesty’s sagely virtue renews itself daily, his divine martial prowess strikes like lightning. He pacified the great western frontier, subdued the Three Han to submission, swiftly eradicated the southern rebels, and summoned all the northern khans to court. With governance distributed among his ministers and arms laid aside in favor of culture, this is an era of radiant prosperity—a thousand-year opportunity.\n\nYet he still reveres the Supreme Mystery and diligently maintains solemn sacrifices. The construction of this palace may thus be anticipated with the certainty of sun and moon.\n\nI, unworthy though I am, serve in the Hanlin Academy and have been graced with the imperial command. With due reverence, I bow twice and inscribe this record. Its words are as follows:\n\nThe sage does not act with partiality,\nAnd the people flourish in simplicity.\nOnce cunning and wit arise,\nA hundred deceptions eclipse truth.\nHeaven speaks not—\nYet from it springs the Perfected One.\nWhere did he first appear?\nBy the waters of the Guo River.\nBorn with numinous distinction,\nHe spurned sagacity and renounced cleverness.\nDwelling in substance, abiding in depth,\nHe untangled knots and blunted sharpness.\nHe refused office under a corrupt lord,\nContent to remain in lowly station.\nWith a blue ox he rode west,\nShunning fame and fleeing the world.\nThe two scrolls, *Dao* and *Virtue*,\nSet forth five thousand words.\nActing through non-action,\nProfound beyond profundity.\nIn governing the people and ordering the state,\nHis legacy endures through ten thousand generations.\nWhose descendant is he?\nThe Primordial Ancestor of the August Lord.\nEver mindful of the imperial model,\nThe Supreme Virtue of the Undifferentiated Origin.\nA shrine was raised by the river,\nA single pheasant’s wing soaring.\nThe palace was named Supreme Clarity,\nIts hall the Supreme Ultimate.\nThe immortal worthies’ names were inscribed,\nEnhancing the splendor of Qiao Prefecture.\nThe surging Yellow River\nAssaulted our Valley of Yang.\nThe towering palaces—\nNow vanished.\nRising and falling follow fate,\nAwaiting the flourishing of our time.\nWith sincerity and illumination, the teaching is perpetuated,\nThe true and constant will is carried forward.\nZhi Mi and Zhi Yu\nFirst divined the site and laid the foundations.\nChong Dao and Qi Yun,\nResponding with alacrity, took up the task.\nOne hall now complete,\nIts majesty inspires awe.\nFor ten thousand years to come,\nIt shall serve as the realm’s altar of blessing.\nThe merit is not another’s—\nChong Dao’s contribution is greatest.\nI dare not claim credit,\nFor how could I repay the sovereign’s grace?\nFrom the nine wells of Qingyuan,\nFortune flows to both rivers.\nThis humble minister inscribes this record,\nA hymn in place of strings and song.\n\n*Stele for the Reconstruction of the Ten Directions Great Heavenly Eternal Abbey in the Central Capital*\nComposed by Minister Zheng Ziping, Hanlin Academician, Expositor-in-Waiting, Participant in the Drafting of Edicts, and Compiler of the National History, by imperial command.\n\nIn the third month of the fourteenth year of the Dading era, Minister Zhong Yu of the Ministry of Revenue and Minister Yi Yan, Director of Agricultural Affairs, memorialized: “The imperial lodgings at the Ten Directions Great Heavenly Eternal Abbey are now secure, and the images are solemnly arrayed. We humbly report this.” On the full moon of that month, the Son of Heaven and the Crown Prince, accompanied by the hundred officials, paid reverent homage. Three days and nights of Daoist rites were then ordered to celebrate the completion.\n\nPreviously, Master Yan Deyuan, Abbot of the Precept Platform of the Western Capital Circuit, had been summoned to reside as abbot and was appointed Supervisor of Abbey Affairs. In the autumn of the nineteenth year, in the ninth month, an edict was issued to a scholar-official to compose an inscription for the stele. I, Ziping, unworthy though I stand at the northern gate, have been charged with this task. I dare to examine the abbey’s rise and fall, its flourishing and decay, and set it forth here.\n\nAccording to my humble study of *Illustrated Classics* and old steles, the abbey was first established in the Kaiyuan era of Emperor Xuanzong of Tang, named Heavenly Eternity. Its grandeur was unmatched. Over time, it fell into disrepair, its ruin growing ever more severe. In the seventh year of the Xiantong era, Zhang Yunshen, Military Commissioner of Lulong, renovated and restored it.",
      "overlap_context": "enshrined, with Shu Hua and Wen Shi arrayed to his left and right, followed by *Cavernous Numinosity*, *Penetrating the Mysterious*, *Embracing the Void*, and *Southern Florescence*. The immortal visages stood solemnly, inspiring reverence in all who beheld them.\n\nThough some details remain unfinished, the palace is already sufficient to offer incense and maintain the sacred flame, serving as a place for the dynasty to pray for blessings through ten thousand generations. Is this not magnificent?",
      "start_char": 6466,
      "end_char": 7116,
      "start_sentence": 207,
      "end_sentence": 248,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.882423639297485,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\宫观碑志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "五季及辽，咸所严奉。 国朝正隆之季，政役繁兴，簿领充初，着籍之用，多贮其中。 或有索奸者狙火之，数百年之缔构，一昔而烬。 物不终否，时若有待，圣天子受命即位，岁方五稔，而功成治定，薄海内外，悉臣悉主，官修其方，民遂其业，工精其能，德泽洋溢，符瑞众至，百废具起。 万机之暇，游心玄妙，大定七年秋七月二十三日，乃韶复兴。 以今户部尚书张仲愈、劝农使张仅言董其役，且命勿亟。 自经始迄于落成，凡八年。 前三门榜曰十方大天长观，中三门曰玉虚之门，设虚皇醮坛三级，中大殿日玉虚，以奉三清，次有阁日通明，以奉昊天上帝，次有殿日延庆，以奉元辰众像。 翼于其束者，有殿曰澄神，翼于其西者，有殿日生真，以奉六位元辰。 束有钟阁日灵音，兼奉玉皇上帝、虚无玉帝，次有阁日大明，以奉太阳帝君，次有殿曰五岳，以奉诸岳帝暨长白山兴国灵应王，西阁日飞玄，以秘道藏，兼奉三天宝君，次有阁日清辉，以奉太阴皇君，次有殿日四渎，以奉江河淮济之神。 洞房雨麻暨方丈凡百六十楹有奇，至于栋梁楹桶之材，丹艘涂茨之饬，图绘偶像之工，虽龙杉锦相，蕾买梓星枯，阁海香琼，贲丘朱泥，班捶之巧，昊张之妙，不是过也。 凡为钱以巨万计，皆出自禁中服御之物，而以善价平民，故成功如此之易。 游题玉宇，模神工也，风马云车，游真驭也； 琅函玉岌，发道奥也； 黄冠羽服，集真倡也； 便斋曲房，安隐逸也。 於戏，不费大农之一钱，不劳版籍之一夫，不役赤籍之一卒，千柱之宫，百常之观，三级之坛，巍巍乎，奕奕乎，如天造地设，非圣德感通，忠良协赞，渠能至此者哉！ ．臣窃谓希夷微妙，深不可识，强名日道，圣人得之以阅众甫，以治天下，合陶唐氏之克让。 其次有大丹云液，上宾轻举，长生久视之要。 其次有熊经乌伸，吐故纳新，延生保命之术。 其次有考役鬼神，弭伏灾疠，却老已病之验。 道之于世，岂小补哉，神而明之，存乎其人。 昔李唐祖玄元而兴开元之功，所以致尊极者，盖先己也。 今天子以道有功于世，而复兴修者，薪福民也。 先己者，乘时也，为民者，致诚也，先己之与福民，乘时之与致诚，其可同日而语乎？ 臣拜手稽首，敢献颂日： 易有太极宝光天，孰主张是名真荃。 众妙之门玄复玄，亭毒万品堪舆旋。 旷乎浩劫不可迁，延康龙汉称初年。 神而明之人为先，玉清太清名始传。 说者谓在胚胎前，帝王以来咸致虔。 孔升真人君开元，崇祖奉道尤所专。 作为祠宫福全燕，迩来历岁逾半千。 一旦人火嗟歼旗，时若有待何夤绿。 圣皇受命临九缠，德泽昭天下漏泉。 沧海无波烽无烟，百废具举求其全。 悯此故基独归然，非同唐汉意欲仙。 庶几厚福流民编，信臣是命特临轩。 经始勿亟其从权，八稔告成素不愆。 清都云构栖万橡，广庭飞阁何连延。 照人金碧明且鲜，丽哉壮观临长阡。 民力不劳财不损，圣德所底臣力宣。 下臣献铭且名镌，福禄方至歌如川。 十方大天长观玄都宝藏碑铭 承事郎应奉翰林文字知制语芜国史院编修魏搏霄撰 十方大天长观新作《玄都宝藏》，提点观事冲和大师孙明道谓大名魏搏霄曰； 自元始天尊开龙汉延康之劫，命天真皇人辩析秘道，授之列仙，以传下世，则始有经矣。",
      "translated_text": "In the Five Dynasties and under the Liao, it was revered and honored alike. During the final years of the Zhenglong era of our dynasty, with government corvée and administrative burdens proliferating, the abbey’s halls were filled with registers and records stored within. Some malcontents, seeking to extort or scheme, set fire to it, and in a single night, centuries of construction were reduced to ashes.\n\nYet things do not remain forever in decline; the time seemed to await a turning point. When the Sagely Son of Heaven received the Mandate and ascended the throne, five years had scarcely passed before his achievements were complete and governance settled. From the seas within to the lands beyond, all became subjects and sovereigns in harmony. Officials perfected their duties, the people pursued their livelihoods, and artisans honed their skills. Virtue and grace overflowed, auspicious omens arrived in abundance, and all that had fallen into neglect was restored.\n\nIn the autumn of the seventh year of the Dading era, on the twenty-third day of the seventh month, an imperial edict was issued to revive the abbey. The current Minister of Revenue, Zhang Zhongyu, and the Commissioner for Agriculture, Zhang Jinyan, were appointed to oversee the project, with orders not to rush. From its commencement to completion, the work spanned eight years.\n\nThe front triple gate was inscribed *Ten Directions Great Heavenly Eternity Abbey*; the central triple gate was named *Gate of Jade Purity*. A three-tiered altar for the *Xu Huang* Offering was established. The central main hall, *Jade Purity*, was dedicated to the Three Clarities. Next stood the pavilion *Illuminating Brightness*, enshrining the August Heavenly Emperor. Beyond it was the hall *Extending Felicity*, housing the images of the Celestial Bodies. To its east stood the hall *Clarifying the Spirit*, and to its west, the hall *Engendering Perfection*, both dedicated to the Six Positions of the Celestial Bodies.\n\nIn the east was the bell tower *Numinous Sound*, also enshrining the Jade Emperor and the Emperor of Primordial Void. Next stood the pavilion *Great Brilliance*, dedicated to the Lord of the Sun. Beyond it was the hall *Five Marchmounts*, housing the emperors of the sacred peaks and the Spirit King of Changbai Mountain, *Flourishing State and Numinous Response*. To the west was the pavilion *Soaring Mystery*, housing the *Daoist Canon* and enshrining the Three Heavenly Treasure Lords. Next stood the pavilion *Luminous Purity*, dedicated to the Lady of the Moon. Beyond it was the hall *Four Watercourses*, enshrining the spirits of the Yangzi, Yellow, Huai, and Ji Rivers.\n\nThe abbey comprised grotto chambers, meditation halls, and the abbot’s quarters, totaling over one hundred and sixty bays. As for the timber of its beams and pillars, the adornment of its cinnabar and lacquer, and the craftsmanship of its painted and sculpted images—though it were wrought of dragon pines and brocade, carved from starry catalpa and fragrant nanmu, inlaid with seashell and jade, or gilded with cinnabar and vermilion, the skill of Lu Ban and the artistry of Wu Daozi would not surpass it.\n\nThe expenditure amounted to tens of millions, all drawn from the imperial wardrobe and personal effects, which were sold to the people at fair prices. Thus, the project was accomplished with such ease.\n\nWandering through its jade halls, one marvels at the work of divine craftsmanship. Wind-borne steeds and cloud chariots seem to convey the perfected immortals. Jade cases and alabaster scrolls reveal the profound mysteries of the Dao. Daoist adepts in feathered robes gather to invoke the true ones. Secluded chambers and winding rooms offer refuge to the reclusive.\n\nAlas! Not a single coin was drawn from the national treasury, nor a single laborer conscripted from the registers, nor a single soldier levied from the rosters. Yet here stands a palace of a thousand pillars, an abbey of a hundred fathoms, an altar of three tiers—majestic and resplendent, as if fashioned by heaven and earth. Without the Sagely Virtue’s resonance, the loyal ministers’ concerted efforts, how could this have been achieved?\n\nI humbly submit that the subtle and wondrous Dao, profound and beyond comprehension, is forcibly named the *Way*. The Sage attains it to govern the myriad beginnings and rule the world, matching the yielding virtue of the sage-kings of old. Next is the Great Elixir and Cloudy Liquor, enabling transcendence and light ascent, the essence of longevity and enduring vision. Then come the practices of bear-hanging and bird-stretching, exhaling the old and inhaling the new, arts of prolonging life and preserving destiny. Further still are the rites of summoning spirits and subduing disasters, averting calamities and curing illnesses, proven methods to delay aging and heal afflictions. How could the Dao’s contribution to the world be small? Yet its spiritual illumination depends on the person.\n\nIn former times, the Li-Tang dynasty traced its ancestry to the Mysterious Origin and flourished through the achievements of the Kaiyuan era. The reason for its supreme veneration lay in its prioritization of self-cultivation. Now, the Son of Heaven, recognizing the Dao’s merit in the world, has revived this abbey to bestow blessings upon the people. Prioritizing self-cultivation is a matter of seizing the moment; bestowing blessings upon the people is a matter of utmost sincerity. Can seizing the moment and utmost sincerity be spoken of in the same breath?\n\nI bow my head and knock my forehead to the ground, daring to offer this eulogy:\n\nThe *Book of Changes* speaks of the Supreme Ultimate, the radiance of heaven’s treasure—\nWho presides over this but the true and essential?\nThe gate of the myriad wonders, dark and ever darker,\nNurturing the ten thousand beings as the earth and heavens turn.\n\nVast and boundless, it spans kalpas unchanging,\nFrom the *Yan Kang* and *Long Han* eras, the first years.\nYet its spiritual illumination depends on humanity’s precedence—\nThe names of Jade Purity and Grand Purity were first transmitted.\n\nSome say it existed before the womb,\nAnd emperors and kings since time immemorial have revered it.\nWhen the Perfected Lord Kong ascended in the Kaiyuan era,\nHe honored the ancestors and devoted himself to the Dao.\n\nHe built temples to bless the realm of Yan,\nAnd over five hundred years have since passed.\nYet in an instant, human fire lamentably consumed it—\nThe time seemed to await its revival, how profound the providence!\n\nThe Sagely Emperor received the Mandate and ruled the nine regions,\nHis virtue and grace shining like the heavens’ springs.\nThe seas were calm, the beacons cold,\nAll that had fallen was restored to completion.\n\nMoved by this ancient foundation standing alone in ruin,\nUnlike the Han and Tang, his intent was not mere transcendence.\nRather, he sought to bestow abundant blessings upon the people,\nAnd entrusted this task to a trusted minister, who personally oversaw it.\n\nThe work began without haste, adapting to circumstances,\nAnd in eight years, it was completed without delay.\nThe cloud-palace of the Pure Capital shelters a thousand rafters,\nIts vast courtyards and soaring pavilions stretch endlessly.\n\nGolden and azure, radiant and resplendent,\nHow magnificent the sight, overlooking the long avenue!\nNo labor was exacted from the people, no wealth depleted—\nThe Sagely Virtue’s achievement, proclaimed by his ministers’ efforts.\n\nThis humble servant offers an inscription to be carved in stone,\nAs blessings and fortune now flow like a river.\n*Stele Inscription for the Ten Directions Great Heavenly Eternity Abbey and the Precious Canon of the Mysterious Capital*\n\nComposed by Wei Boxiao, Gentleman for Attendance, Hanlin Academician for Texts, Drafter of Edicts, and Compiler of the National History\n\nThe newly completed *Precious Canon of the Mysterious Capital* at the Ten Directions Great Heavenly Eternity Abbey was overseen by the Supervisor of Abbey Affairs, the *Chong He* Great Master Sun Mingdao, who said to the renowned scholar Wei Boxiao:\n\n\"Since the Primordial Heavenly Worthy opened the *Long Han* and *Yan Kang* kalpas, commanding the Heavenly Perfected and August Person to expound the secret Dao and transmit it to the ranks of immortals for posterity, the scriptures first came into being.\"",
      "overlap_context": "ith this task. I dare to examine the abbey’s rise and fall, its flourishing and decay, and set it forth here.\n\nAccording to my humble study of *Illustrated Classics* and old steles, the abbey was first established in the Kaiyuan era of Emperor Xuanzong of Tang, named Heavenly Eternity. Its grandeur was unmatched. Over time, it fell into disrepair, its ruin growing ever more severe. In the seventh year of the Xiantong era, Zhang Yunshen, Military Commissioner of Lulong, renovated and restored it.",
      "start_char": 7116,
      "end_char": 8398,
      "start_sentence": 249,
      "end_sentence": 295,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.92789673805237,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\宫观碑志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "自西王母以元始玉像遗轩辕黄帝，置诸高观之上，以奉香火，则始有观矣。 是则非观无以贮无上之经，非经无以见无上之道，经之与观可独已乎。 国家定都永安，迄今四十余年，天长观皇奉香火，旧贮藏经，缺而未完。 住持道士继承非一，因仍苟简，莫有以补缀为意者。 大定丙午，明道始奉诏提点观事，洪惟世宗皇帝万机之暇，留神内典，以观宇尝火，出内府金钱巨万计，俾撒旧而一新之。 於是上圣有居，众真有处，长廊秘殿，蟠如翼如，经阁醮坛，广庭今房，位置区别，莫不有叔，尊雄深靖，为天下壮观。 而又赐钱二千万，领以度支，岁取赢羡以给道倡。 复於五花山置烧丹院，起玉华殿，俾隶於观，以为方士飞炼之所。 而无上之经，顾独缺而未完。 愚虽不敏，誓将毕力，证兹胜事。 后二年，会有韶以南京，《道藏经》板付观，又易置玉虚观经於飞玄之阁，以备观览，天长旧经，还付玉虚，其旧有名籍而玉虚不具者，听留勿还，须补完则遣之。 继又以普天大醮仪范有肃，赐萧道济等十人簪褐，仍劝赐钱十五万，俾置羽衣，余道倡人赐钱三万。 明道用是愈益感奋，以为圣天子在上，道学兴行，宜广传法录，开度群迷，及献状于朝，嗣韶报可，仍劝招延高道，镯洁行事。 越明年正月，鼎成龙去，而诏旨具在。 主上嗣膺宝位，尤尊道学，以其教出中国。 专尚清今，有司举前韶以请，俞音既下，以三月朔旦开坛受录。 既具威仪，请师奏名，俄有三鹤自西北来，翔绕祠坛，逮奏名竟，乃西南去。 昼晷亭午登坛，复有四鹤徘徊其上，既交神吏，倏然黄雾蔽天，至自西北驭若斗风雨。 已而撒席，天宇廓清，飞鹤上翕，入于太空。 道倡士庶，骇心稽首。 明昌改元之元日，劲遣中使谕旨度支，拓观之左隙地凡千步，起丁卯瑞圣殿，以奉太母本命之神，制度与延庆坍。 其北官第一区，并以赐观，俾构屋列沪，以贮经板。 仍署文臣二员与明道经书参订，即补缀完成，印经一藏。 既又命选精勤道士一员住持，须及五年，若职事修举者，赐紫衣德号，仍岁度服勤道童二人以为常。 明道奉韶，不遑居处，分遣黄冠访遗经於天下，且募工鸠材。 有赵道真者，愿以板材自任，丐化诸方。 不二年问，胜绿俱办，瓖材会珍，良工萃巧，植屡屹立，镂堑具完。 凡得遗经千七十四卷，补板者二万一千八百册有畸，积册八万三千一百九十八，列库四区，为楹三十有五，以架计者百有四十。 明道於是倡诸道倡，依三洞四辅，品详科格，商较同异，而铨次之，勒成一藏，都卢六千四百五十五卷，为秩六百有二，题曰《大金玄都宝藏》。 亦既奏功，须文以信久远，子尝留心吾教，敢以碑铭请，幸母让。 搏霄谨按，道家者流，盖出於黄帝、老子之学，其道以清争无为为宗，以慈俭不争为用，皆胳合六经之妙，虽国君不可阙也。 至其所谓神仙保性命之真，则山林中人之事也。 故善学黄老者，则必知其本末之务，若虞舜之无为，汉文之慈俭，光武之柔道，盖公之清冷，皆出黄老之教，可谓知所务矣。 今吾师奉诏完茸旧典，而又得逸书於天下为多，兼收并蓄，足成一大藏，教其於本末之务，不为无补，是可铭者，於是敬诺而铭之其辞日：",
      "translated_text": "Since the Queen Mother of the West bestowed the jade image of the Primordial upon the Yellow Emperor, Xuanyuan, and placed it atop a lofty abbey to receive incense and offerings, the abbey first came into being. Thus, without abbeys, there would be no place to house the supreme scriptures; without scriptures, there would be no means to perceive the supreme Dao. Can scriptures and abbeys exist independently?\n\nThe imperial capital was established at Yong’an over forty years ago. The Heavenly Eternity Abbey has since maintained its royal incense offerings, yet its stored canon remained incomplete. Successive abbots followed one another, each content with mere continuity, none taking it upon themselves to repair or complete it. In the *bingwu* year of the Great Rectification era, Mingdao was first entrusted with the imperial decree to supervise the abbey’s affairs. During his leisure from myriad duties, the late Emperor Shizong turned his attention to the inner canon. When the abbey’s halls were consumed by fire, he drew from the imperial treasury tens of thousands in gold to raze the old and rebuild anew. Thus, the august sages found their abode, the host of perfected found their place. Long corridors and secret halls spread like wings; scripture pavilions and ritual altars, vast courtyards and present-day chambers—all were arranged with order, their grandeur deep and serene, a spectacle for the realm.\n\nMoreover, he bestowed twenty million in cash, managed by the Ministry of Revenue, with annual surpluses allocated to support the Daoist clergy. On Five-Flower Mountain, he established a cinnabar-refining cloister and erected the Jade Splendor Hall, subordinating it to the abbey as a place for alchemists to refine and ascend. Yet the supreme scriptures alone remained incomplete. Though I am dull-witted, I swore to devote all my strength to accomplishing this noble task.\n\nTwo years later, an imperial edict arrived from the Southern Capital, entrusting the *Daoist Canon* printing blocks to the abbey. The jade scriptures of the Jade Void Abbey were relocated to the Flying Mystery Pavilion for display, while the old scriptures of the Heavenly Eternity Abbey were returned to the Jade Void. Those listed in the old registry but absent from the Jade Void’s collection were permitted to remain, to be dispatched only when replacements were found. Subsequently, for the grand universal ritual, the solemn protocols were observed, and ten individuals, including Xiao Daoji, were granted the honor of wearing the purple sash. Fifteen thousand in cash were further bestowed to procure vestments, with an additional three thousand given to the remaining clergy.\n\nMingdao, ever more inspired, believed that with the sagely Son of Heaven above, the Daoist teachings flourished. It was fitting to propagate the dharma, enlighten the deluded, and open the path to salvation. He submitted a memorial to the throne, and the imperial assent was granted. He was further encouraged to invite eminent Daoists and conduct rites with utmost purity. The following year, in the first month, the tripod was cast and the dragon departed, yet the imperial decree remained in force.\n\nUpon ascending the throne, the present emperor revered Daoist learning all the more, for its teachings originated in China. Emphasizing purity and frugality, the court officials petitioned to uphold the previous edict. With the imperial approval, on the first day of the third month, the altar was opened to receive the registers. Once the solemn rites were prepared and the master’s name was invoked, three cranes suddenly arrived from the northwest, circling the ritual altar. As the invocation concluded, they departed toward the southwest. At noon, as the sun stood at its zenith and the master ascended the altar, four more cranes hovered above. As the divine officials were summoned, a sudden yellow mist enveloped the sky, sweeping in from the northwest like a tempest. Yet when the mats were rolled away, the heavens cleared, and the cranes soared into the vast emptiness. The clergy and laity, awestruck, bowed in reverence.\n\nOn the first day of the inaugural year of the *Mingchang* era, an imperial envoy was urgently dispatched to instruct the Ministry of Revenue to expand the abbey’s left vacant land by a thousand paces. There, the *Dingmao* Auspicious Sage Hall was erected to enshrine the natal deity of the August Mother, its design matching the Hall of Extended Celebration. The northern palace’s first precinct was also granted to the abbey, where halls were constructed in rows to house the printing blocks. Two scholar-officials were appointed to collaborate with Mingdao in proofreading and collating, completing the repairs and printing a full canon. Further, a diligent Daoist was selected to serve as abbot, with the stipulation that after five years of exemplary service, he would be granted the purple robe and an honorific title. Two diligent novices were also to be tonsured annually as a permanent arrangement.\n\nMingdao, ever dutiful, spared no effort in his residence. He dispatched yellow-capped Daoists to seek lost scriptures throughout the realm and recruited artisans to gather materials. A certain Zhao Daozhen volunteered to oversee the procurement of printing blocks, soliciting donations far and wide. Within two years, all was prepared: rare timbers assembled, skilled craftsmen gathered, pillars erected, and carvings completed. In total, 1,074 lost scriptures were recovered, 21,800 printing blocks were supplemented, and 83,198 volumes were amassed, filling four storehouses with thirty-five bays and 140 shelves.\n\nMingdao then rallied the clergy to organize the canon according to the Three Caverns and Four Supplements, meticulously classifying and collating each text, resolving discrepancies, and arranging them in order. Thus, a complete canon was compiled, totaling 6,455 scrolls in 602 sections, titled *The Precious Canon of the Mysterious Capital of the Great Jin*. With the task accomplished, a stele was needed to ensure its enduring legacy. You, who have long been devoted to our teachings, have requested this inscription. I dare not refuse.\n\nI, Boxiao, respectfully note: The Daoist tradition traces its origins to the teachings of the Yellow Emperor and Laozi. Its Dao takes clarity, tranquility, and non-action as its essence, and compassion, frugality, and non-contention as its practice—all harmonizing with the subtleties of the Six Classics, indispensable even to rulers. As for its claims of immortality and the preservation of life’s essence, these are the concerns of recluses in the mountains. Thus, those who truly master the teachings of the Yellow Emperor and Laozi must grasp both root and branch. The effortless governance of Yu Shun, the compassion and frugality of Emperor Wen of Han, the gentle Dao of Emperor Guangwu, and the purity of Gai Gong—all stem from the teachings of the Yellow Emperor and Laozi, exemplifying true mastery.\n\nNow, our master has been entrusted with the imperial mandate to restore the old canon and recover lost texts from across the realm, amassing a great treasury of teachings. This endeavor, both in root and branch, is not without merit. Such an achievement is worthy of inscription. Thus, I respectfully comply and inscribe these words:\n\n*(Here follows the inscription, to be translated as a separate section.)*",
      "overlap_context": "ly completed *Precious Canon of the Mysterious Capital* at the Ten Directions Great Heavenly Eternity Abbey was overseen by the Supervisor of Abbey Affairs, the *Chong He* Great Master Sun Mingdao, who said to the renowned scholar Wei Boxiao:\n\n\"Since the Primordial Heavenly Worthy opened the *Long Han* and *Yan Kang* kalpas, commanding the Heavenly Perfected and August Person to expound the secret Dao and transmit it to the ranks of immortals for posterity, the scriptures first came into being.\"",
      "start_char": 8398,
      "end_char": 9600,
      "start_sentence": 296,
      "end_sentence": 329,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.74429893493652,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\宫观碑志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "空洞之元，虚无自然。 从无得有，积成地天。 两仪既奠，七耀有踱。 造化亭毒，死生劫迁。 为人为物，或鬼或仙。 三界之上，浩劫之前。 上无复色，下无复渊。 中有大梵，俱津眇绵。 玉音摄气，灵风聚烟。 亦既成文，豁落瑛鲜。 龙汉荡荡，运开乃传。 天真辩析，列仙致虔。 降授世人，玄言五千。 三洞四辅，次第相沿。 关尹之后，支分派宣。 汉史载者，二百五篇。 逮晋兴宁，其光益延。 历唐至宋，纲纬乃全。 搜访遗逸，笼山络川。 贮之秘殿，饰以锦游。 天命既革，经随师还。 束置滋久，几为断编。 大定中兴，真人御乾。 乃卷天长，梼祠吉镯。 载新输奂，载锡金钱。 圣泽汪洋，昭天漏泉。 谓经有板，可蹄可荃。 取诸魏梁，致之汉燕。 谓经有峡，可补可镌。 以彼玉虚，易此飞玄。 云何鼎成，龙驾高骞。 攀鳞弗迨，抱弓涕涟。 明昌天子，志切奉仙。 赐第构屋，督工署员。 冲和奉承，勤亦至焉。 岁不再周，用集胜缘。 千材会珍，万陶萃坚。 列沪山峙，镂堑壁联巾能事既毕，灵既自甄。 於皇世宗，侑帝之筵。 俟谁驾之，韶遥绿遭。 降监成功，致福孔遗。 天子寿考，维亿万年。 沾概玄教，旁流八涎。 十方大天长观普天大醮瑞应记 明昌元年二月癸卯，皇太后微爽节宣之和。 越翼日甲辰，皇帝朝隆庆宫，问安于慈训殿，还出寝门，行不能正履，朝夕视膳，畴咨药石，未尝解带，以谓梼于上下神祇，着在典故。 壬子，劫大天长观设普天大醮七昼夜，仰祝皇太后圣寿无疆，赐钱五百万，梅檀、沉水、降真等香二百八十斤，龙脑五两，命昭勇大将军、拱卫直都指挥使兼客省使大仲尹、西上阁门使张汝猷、左振肃完颜阿鲁罕为行礼官，诏提点天长观事冲和大师孙明道日：．老君道教，乃中国之教，不比释氏西胡之人，以击钹为事，自今以始，醮上不得用法器。 即日降普天大醮，青词一通，其词日：嗣天子臣谨上启三清四帝二后，伏以祇应丕绪，仰戴慈闱，惟日奉承。 方备九州之养，赖天孚佑，克开万寿之祥，偶失时和，遽成微恙，爰款殊庭之邃，聿严秘醮之。 科，所冀孝诚俯回真驭，垂至神而洞鉴，锡景命之延洪，嘉与群生，永依大庇。 臣无任恳祷之至，谨词。 辛酉，皇帝驾幸天长观，行香礼毕，车驾还宫，行礼官暨高功大法师，闻启发牒，皇帝斋戒七日。 癸亥，内降御书青词九通，沉檀四斤J龙脑十两。 乙丑，正昼行道问，有白鹤九只自西北来，继又十只，皆缓飞翱翔于坛上，须臾数千，四面蔽天而＇至，徘徊往来，自午至申，始徐徐而去。 是时云物嘉明，西南有赤光下属坛殿，都人瞻拜，万口和附，咸以为圣上孝感之所致。 丙寅，皇太后遣隆庆宫都监高高寿赐白金五十两，彩四段，俾道众忏谢。 是日，又於正午行道问，有四鹤自西北来，徐有五十余，盘旋於坛上者久之。 丁卯，复命左宣徽使卢玑为代礼官，午时行道问，鹤五只来自西北，回翔殿阁之上，道众诣天宝坛上十方香，有大鹤下翔，掠玉虚殿檐，然后飞舞於坛阁之上而去。 中夜焚词，微风自西北来，缭绕楮灰，搏扶摇而上者数百千丈，直入霄汉。 俄有赤光照烛琳宇，众皆骇叹瞻拜。",
      "translated_text": "The Primordial of the Vast Void,\nthe Self-So of Emptiness and Nothingness.\nFrom Nonbeing comes Being,\naccumulating to form earth and heaven.\nOnce the Two Modes were established,\nthe Seven Luminaries began their dance.\nCreation nurtures and poisons,\nlife and death shift through kalpas.\nAs human or thing,\nas ghost or immortal.\nAbove the Three Realms,\nbefore the kalpas vast.\nAbove, no further color;\nbelow, no deeper abyss.\nWithin lies the Great Brahmā,\nall-pervading, subtle, and boundless.\nThe Jade Tone gathers qi,\nthe numinous wind assembles mist.\nThus the scripture takes form,\nradiant and resplendent.\nIn the boundless Dragon Han era,\nits transmission began.\nCelestial Perfected analyzed and expounded,\nthe ranks of immortals offered reverence.\nBestowed upon the world,\nthe Five Thousand Words of Mystery.\nThe Three Caverns and Four Supplements,\nin sequence they followed.\nAfter Guan Yin,\nschools branched and spread.\nThe Han histories recorded\ntwo hundred and five chapters.\nBy the rise of Jin and Xingning,\nits light further extended.\nThrough Tang to Song,\nits warp and weft were complete.\nLost texts were sought,\ngathered from mountains and rivers.\nStored in the secret palace,\nadorned with brocade and jade.\nWhen Heaven’s Mandate changed,\nthe scriptures followed the master’s return.\nBound and shelved for long,\nthey nearly became fragmented scrolls.\nIn the Great Revival,\nthe Perfected ruled the heavens.\nThe celestial roll unfurled,\nauspicious rites were performed.\nRenewed and resplendent,\ngold and coin were bestowed.\nThe sagely grace vast as the ocean,\nilluminating the celestial springs.\nThe scriptures were carved on tablets,\nto be sought and gathered.\nFrom Wei and Liang,\nthey were brought to Han and Yan.\nThe scriptures had their gaps,\nto be supplemented and engraved.\nWith that Jade Void,\nthis Flying Mystery was exchanged.\nHow was the tripod cast?\nThe dragon-chariot soared high.\nClutching its scales in vain,\nclasping the bow, tears streamed.\nThe Emperor of Mingchang,\ndevoted to serving the immortals,\ngranted halls and constructed chambers,\nappointing officials to oversee the work.\nWith reverent harmony,\ndiligence was utmost.\nBefore a year had passed,\nauspicious conditions converged.\nA thousand treasures gathered,\nten thousand craftsmen assembled.\nThe Luhu Mountain stood tall,\ncarved moats and walls linked in splendor.\nWhen the work was complete,\nthe numinous revealed itself.\n\nAt the august feast of Emperor Shizong,\njoining the imperial banquet,\nwho would await the chariot?\nThe distant Shao music echoed.\nDescending to witness the success,\ngreat blessings were bestowed.\nMay the Son of Heaven live long,\nfor a hundred million years.\nThe Daoist teachings spread,\nflowing to the eight directions.\n\n*Record of Auspicious Responses at the Great Heavenly Offering of the Celestial-Long Everlasting Abbey*\nIn the first year of Mingchang, the second month, on the day *guimao*, the Empress Dowager’s spirit was serene and her virtue proclaimed.\nOn the following day *jiachen*, the Emperor paid court at Longqing Palace, inquired after her health at the Cixun Hall, and upon departing the sleeping chambers, could barely walk straight. Morning and evening, he attended to her meals, consulted on medicines, and never loosened his sash, believing that prayers to the gods above and below were recorded in the classics.\nOn the day *renzhi*, a seven-day Great Heavenly Offering was held at the Celestial-Long Everlasting Abbey, praying for the Empress Dowager’s boundless longevity. Five million coins were granted, along with 280 catties of plum sandalwood, aloeswood, and *jiangzhen* incense, five taels of borneol, and the following were appointed as officiants: General of Manifest Valor, Commander of the Palace Guard and Hostelry, Grand Master Yin, Western Upper Chamber Attendant Zhang Ruyou, and Left Rectifier Wanyan Aluhan. An edict was issued to the Abbot of the Celestial-Long Abbey, Master of Harmonious Pervasion Sun Mingdao: \"The Daoist teachings of Lord Lao are China’s own, unlike the Western Hu of Buddhism who clamor with cymbals. From this day forward, no ritual instruments shall be used in offerings.\"\n\nOn that day, a memorial of blue-green words was presented for the Great Heavenly Offering:\n*\"The heir and Son of Heaven, your subject, humbly addresses the Three Pure Ones, the Four Emperors, and the Two August Sovereigns. Reverently considering the great continuity of divine response, we look up to the compassionate court. Daily, we serve with devotion. Having prepared the nine provinces’ offerings, we rely on Heaven’s blessing to unfold the auspices of ten thousand years. Yet, by chance, the seasons fell out of harmony, and a slight illness arose. Thus, we knock at the profound gates of the divine, solemnly preparing this secret offering. We hope that filial piety will move the true chariot, that the divine will peer down and perceive, bestowing the extension of bright destiny. May all beings forever depend on this great shelter. Your subject, with utmost sincerity, offers this prayer.\"*\n\nOn the day *xinyou*, the Emperor visited the Celestial-Long Abbey, performed the incense offering, and returned to the palace. The officiants and High Master of Rituals reported the opening of the memorial. The Emperor observed a seven-day fast.\nOn the day *guihai*, nine memorials of blue-green words were bestowed from within the palace, along with four catties of aloeswood and ten taels of borneol.\nOn the day *yichou*, during the midday ritual, nine white cranes came from the northwest, followed by ten more, all gliding and soaring above the altar. In an instant, thousands arrived, filling the sky on all sides, circling and lingering from noon until late afternoon before slowly departing. At that time, the clouds and sky were bright and clear. From the southwest, a red light descended, illuminating the altar hall. The people of the capital gazed in worship, their voices united in praise, all attributing it to the Emperor’s filial devotion.\nOn the day *bingyin*, the Empress Dowager sent the Supervisor of Longqing Palace, Gao Gaoshou, to bestow fifty taels of silver and four bolts of silk, instructing the Daoist assembly to perform repentance rites.\nOn that same day, at midday during the ritual, four cranes came from the northwest, soon followed by over fifty, circling above the altar for a long while.\nOn the day *dingmao*, the Left Chamberlain for Ceremonials, Lu Ji, was appointed as substitute officiant. At noon during the ritual, five cranes came from the northwest, circling above the halls and pavilions. The Daoist assembly presented incense at the Ten Directions Altar. A great crane descended, skimming the eaves of the Jade Void Hall before dancing above the altar pavilions and departing.\nAt midnight, as the memorial was burned, a gentle wind arose from the northwest, swirling the paper ashes upward in spirals for hundreds of thousands of feet, straight into the heavens. Soon, a red light illuminated the jade halls, and the crowd gasped in awe, gazing in worship.",
      "overlap_context": "ng—all stem from the teachings of the Yellow Emperor and Laozi, exemplifying true mastery.\n\nNow, our master has been entrusted with the imperial mandate to restore the old canon and recover lost texts from across the realm, amassing a great treasury of teachings. This endeavor, both in root and branch, is not without merit. Such an achievement is worthy of inscription. Thus, I respectfully comply and inscribe these words:\n\n*(Here follows the inscription, to be translated as a separate section.)*",
      "start_char": 9600,
      "end_char": 10824,
      "start_sentence": 330,
      "end_sentence": 389,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.605721950531006,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\宫观碑志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "戊辰巳事。 厥后曾未侠旬，皇太后康宁如初。 有本观玉虚殿侍香道人徐悟真者，目击上事，因命工锾木为《大天长观普天大醮感应图》，具录始终，嘱国史院编修官臣朱澜记其事於国之上。 窃惟束西汉时，黄鹄下太液池，白鹤三十只经岱宗杞坛之上，偶然而来，殊无意谓，当时史官犹以为嘉瑞，笔之於西京之书，东观之记，配圣天子以至孝之德，动天地一通神明，如是之昭晰着明哉！ ．而澜又职隶太史，固当备纪其实，内则书之於策，以备史臣采择，外则扬君上之美，以佐佑刑于四海之教，故不敢坚拒悟真之请，乃取其所录而叔述之，以为《天长观普天大醮瑞应记》。 《书》日：立爱惟亲，立敬惟长。 始於家邦，终于四海。 将见天下臣民闻风感德，靡然从化，人人修曾闵之行，唐虞之世比屋可封之俗，复见於今日矣。 五月戊午，征事郎、应奉翰林文字兼国史院编修官、借绊臣朱澜拜手稽首谨书。 中都十方大天长观普天大醮感应碑 国子祭酒兼翰林直学士知制诰同修国史觉怀英撰 古者圣人，尊天地，敬鬼神，梼祠祭祀之礼，见於《诗》、《书》尚矣。 坛惮以为位，牲币以为荐，熏燎以达臭，祝史以致辞，以禳夹疾，以祈寿福，亦皆有请焉。 后世或举或废，寝不能详究其说，而禳：析之事，独施於道家者流。 斋有法，醮有仪，斋以谢咎，醮以度厄→於是焉要福於天地神祇，自汉唐以来，其法益备。 虽与古殊尚，而斋洁以即事，虔敬以将诚，其致一也。 明昌元年二月，皇太后有疾不豫，皇帝日侍寝闱，咨阅方药，＇凡所以为天下养者，皆用其至，而疾不加损。 天子惕然，忧形于色，分命侍臣褊举群杞。 且谓梼祈之法，莫严於道家，其所谓普天大醮者，视他醮为尤备，乃诏出帑泉五百万，赐天长观，俾开醮席。 仍赐梅檀、沉水、龙脑等香以斤计者合四面‘有奇，特命拱卫直指挥使兼客省使大仲尹、西上阁门使胀汝猷、左振肃完颜阿鲁罕同典行礼，复韶谕提点观事冲和大师孙明道日：老君之道出於中国，专尚清诤，非若释氏西胡之法，以击钹为事，自今醮‘筵宜勿复用。 上於是宿斋，翼日驾如坛所，亲荐香火。 既还，宫内出密词九通，皆亲御宸翰，皇太后亦遣宫使赐白金彩、币，以申忏谢，启坛之日，两宫常膳皆进蔬素，凡七日，盖与醮相始终。 其备物致诚，可谓兼举矣。 既醮之三日，一行事方殷，西南有绛霭纷敷，光明辉映坛殿，白鹤九来自西北，翱翔坛上，继是至者又以十数，顷之，四面云会，不可禅数，盖无虑数千，徘徊下上，自午至哺乃稍稍散去。 于时，祠官道倡，相与振动，拜礼坛下，都人父老，万目瞻仰，莫不加手于额，以为圣上孝诚所致。 自是或五或四，或至数十，继日更至，最后有大鹤迤逦下翔，屡拂檐楹，已而回旋殿阁之上，逾时乃不见。 焚词之夕，天宇橙霁，微风肃然，烟烬上举，莫穷所至，俄有赤光照烛坛宇，众皆炼然，盖知仙圣之去人不远也。 彻醮未几，而皇太后圣体旋就康复，朝野内外，相语称庆。 国史院编修官朱澜为记其事，儒学之臣作为歌颂者甚众，孙公大师复属鄙文，传之刊镂。 怀英曰：天道幽远，其交际之理不可必知，所可知者，修于下，应于上，理之必至者矣。",
      "translated_text": "On the day *wuchen*, the rites were concluded.\n\nNot yet half a month later, the Empress Dowager’s health was restored as before. There was at this temple’s Jade Void Hall a Daoist acolyte charged with tending incense, Xu Wuzhen by name, who had witnessed all these events. He commissioned artisans to carve a wooden *Illustrated Record of the Celestial Responses to the Universal Grand Offering at the Great Temple of Heaven’s Eternity*, detailing the entire sequence from beginning to end, and entreated the Court Historian’s Compiler, Minister Zhu Lan, to inscribe the account for the annals of the realm.\n\nI reflect that in the Han dynasties, when yellow cranes descended upon the Taiye Pond and thirty white cranes passed over the Feng and Shan altars on Mount Tai, their arrival was purely fortuitous, devoid of any deliberate intent. Yet the historians of the time still deemed it an auspicious omen, recording it in the *Book of the Western Capital* and the *Records of the Eastern Observatory*, pairing it with the sagely Son of Heaven’s filial virtue—a virtue so profound that it moved Heaven and Earth and forged a communion with the divine, resplendent and luminous indeed!\n\nNow, as I too serve in the Office of the Grand Historian, it is my duty to faithfully record these events. Internally, they shall be inscribed in the imperial archives for future historians to select and preserve; externally, they shall broadcast the sovereign’s virtue to aid in governing the teachings of the Four Seas. Thus, I dared not firmly refuse Xu Wuzhen’s request. Taking his records as my source, I have compiled this *Record of Auspicious Responses to the Universal Grand Offering at the Temple of Heaven’s Eternity*.\n\nAs the *Book of Documents* states: “The foundation of love lies in one’s parents; the foundation of reverence lies in one’s elders. Begin within the family and state, and extend it to the Four Seas.” It is to be hoped that all subjects of the realm, upon hearing of this, will be moved by the Emperor’s virtue and emulate his example. May every person cultivate the conduct of Zeng and Min, and may the customs of the Tang and Yu eras—where every household was worthy of enfeoffment—be witnessed once more in our time.\n\nOn the day *wuwu* of the fifth month, the Court Gentleman for Miscellaneous Affairs, Hanlin Academician for Textual Composition and Concurrent Compiler of the Court Historians, Acting Minister Zhu Lan, bows and kneels to respectfully inscribe this.\n\n---\n\n**Stele Inscription for the Universal Grand Offering at the Great Temple of Heaven’s Eternity in the Central Capital**\n\nComposed by Jue Huaiying, Director of the Directorate of Education and Concurrent Hanlin Academician, Participating Compiler of the Court Historians, and Drafter of Imperial Edicts\n\nSince antiquity, the sages have revered Heaven and Earth and honored the spirits, and the rites of prayer, sacrifice, and offering are extolled in the *Book of Songs* and the *Book of Documents*. They established altars to mark positions, presented sacrificial animals and silk as offerings, burned incense to convey fragrance, and employed invocators to deliver prayers—seeking to avert calamity, prolong life, and invoke blessings, all with specific entreaties.\n\nIn later ages, these rites were sometimes observed and sometimes abandoned, and their details could no longer be thoroughly examined. Yet the practices of expiation and supplication were preserved solely among the Daoist tradition. Purification rites followed strict methods, and offerings adhered to prescribed forms: purification to atone for transgressions, offerings to transcend calamity—thus entreating blessings from the gods of Heaven and Earth. Since the Han and Tang dynasties, these methods have become increasingly refined. Though they differ from ancient practices, the essence remains the same: purity in approaching the rites and reverence in conveying sincerity.\n\nIn the second month of the first year of the *Mingchang* era, the Empress Dowager fell gravely ill. The Emperor attended her day and night in her chambers, consulting physicians and examining remedies. All that could be done to care for her as the mother of the realm was done to its utmost, yet her condition showed no improvement. The Son of Heaven was deeply alarmed, his anxiety etched upon his face. He dispatched attendants to summon all those skilled in prayer and supplication, declaring: “Among all methods of prayer, none is more solemn than that of the Daoists. Their so-called Universal Grand Offering surpasses all others in its comprehensiveness.” He then ordered the disbursement of five million coins from the imperial treasury to the Temple of Heaven’s Eternity, commanding that a grand offering be held. Additionally, he bestowed upon the temple quantities of plumeria, aloeswood, and borneol incense—over four hundred *jin* in total—specifically appointing the Commander of the Palace Guards and Concurrent Director of the Guest Office, Da Zhongyin; the West Upper Palace Gate Attendant, Zhang Ruyou; and the Left Rectifier, Wanyan Aluhan, to oversee the rites. He further instructed the Supervisor of the Temple, the Master of Harmonious Emptiness, Sun Mingdao: “The Dao of Lord Lao originated in China and emphasizes purity and tranquility, unlike the Western barbarian teachings of the Buddhists, which concern themselves with clashing cymbals. Henceforth, such practices shall no longer be employed in offering ceremonies.”\n\nThereupon, the Emperor observed a vigil of purification. The following day, he personally visited the altar site to present incense and offerings. Upon his return, nine secret memorials were sent from the palace, all inscribed in his own hand. The Empress Dowager also dispatched palace envoys to present silver, silks, and other gifts as offerings of repentance and gratitude. On the day the altar was opened, the meals of both palaces were vegetarian for seven days, aligning with the duration of the offering. The meticulousness of the preparations and the sincerity of the devotion were truly unparalleled.\n\nThree days into the offering, as the rites were in full progress, a crimson mist arose in the southwest, its radiance illuminating the altar and halls. Nine white cranes came from the northwest, soaring above the altar. Soon after, over ten more arrived, followed by cranes converging from all directions—so numerous they could not be counted, likely numbering in the thousands. They circled above and below from noon until dusk before gradually dispersing.\n\nAt that moment, the officiating officials and Daoist masters, moved by the spectacle, prostrated themselves in reverence before the altar. The elders and common folk of the capital, their eyes fixed upon the scene, raised their hands to their foreheads in awe, attributing it to the Emperor’s filial piety.\n\nFrom then on, cranes arrived in groups of five or four, sometimes numbering in the dozens, appearing day after day. Finally, a great crane descended in a leisurely glide, brushing against the eaves and pillars before circling above the halls and pavilions. After some time, it vanished from sight.\n\nOn the evening the memorials were burned, the sky was clear and bright, a gentle wind arose, and the smoke and ashes ascended without limit. Suddenly, a red light illuminated the altar halls, and the assembled crowd, enraptured, knew that the immortals and sages were not far from mortal kind.\n\nSoon after the offering concluded, the Empress Dowager’s health was swiftly restored, and the court and the realm rejoiced together in celebration. The Court Historian’s Compiler, Zhu Lan, recorded these events, and many scholar-officials composed songs and eulogies. Master Sun further requested this humble text to be inscribed and engraved.\n\nHuaiying remarks: The Dao of Heaven is profound and distant, and the principles of its interaction with the mortal realm cannot be fully known. What *can* be known is this: when one cultivates virtue below, responses manifest above—this is the inevitable principle.",
      "overlap_context": " above the halls and pavilions. The Daoist assembly presented incense at the Ten Directions Altar. A great crane descended, skimming the eaves of the Jade Void Hall before dancing above the altar pavilions and departing.\nAt midnight, as the memorial was burned, a gentle wind arose from the northwest, swirling the paper ashes upward in spirals for hundreds of thousands of feet, straight into the heavens. Soon, a red light illuminated the jade halls, and the crowd gasped in awe, gazing in worship.",
      "start_char": 10824,
      "end_char": 12040,
      "start_sentence": 390,
      "end_sentence": 419,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.42691111564636,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\宫观碑志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "夫鹤，逸羽也，巢於深林而游集于薮泽，人将即焉，则摇翮而去之，彼孰使而来哉？ 尝闻道家以是为仙人骥，诚然，则其为感应章章矣。 孔子日：事父孝，故事天朋，事母孝，故事地察，以至於无所不通。 《书》日：鬼神无常，享享于克诚。 夫以道德精微之教，行之以清争，以达圣天子爱亲之诚，宜乎感应之速也。 既书所闻，复系之以颂日： 维帝在上，万灵所宗。 听则甚卑，匪诚弗通。 於皇圣神，继天立道。 奚请于天，粤为亲梼。 乃卷道学，其教本玄。 用是清争，庶几格天。 展坛惟严，章词有秘。 上灵顾故，福应遗致。 爰有嘉气，非云非烟。 下属坛殿，流光晔然。 复有仙禽，以千百数。 如驯如驱，飞掠檐应。 会日圣感，福于慈闱。 天子日然，嘉尔道师。 道师稽首，惟天子孝。 千万亿年，加惠玄教。 中京重建十方上清宫记 太上者，混沌之祖也，初生三清，自玉清至於太清，又成九气，自无量至於无爱，以纯阳而上分三十六天，自太黄而至於大罗，以纯阴而下分三十六地，自润色而至於洞渊，皆在制御之域也。 虽处乎丹台之上，紫阙之内，三大仙、九大帝、二十七天君、八十一大夫、一千二百仙官、二万四千灵司、七万仙童、玉女、五亿天丁、神王，咸奔走之。 十大洞天、三十六洞府、七十二福地、三十六靖卢、二十四化治，莫不仰隶焉。 既无阳九百六之灾，而出拂石芥城之数，或朝元始，校九宫升降之籍，或谒玉晨，阅三界生死之簿，或履云华而身如金色，或坐莲叶而面放日光，七耀云霞之冠，九华离披之被，或乘八景玉辇，或驾五色神龙，建流霄之丹节，张九光之鹤盖，或隐几而罗宝帏，或挥尘而翳珠幡，或玄冠素服而御白马朱鳞，或玉质金容而策青虹白兽。 或问虚皇而号金阙帝君，或在太微而名天皇大帝，或出於龙汉之纪为玄中法师，或现於赤明之年为有古先生，或日郁华子，画八卦於伏羲，或日大成子，播百谷於炎帝，或曰广成子，隐於空同，或日务成子，居於姑射。 或授清虚真人以二十四图，或锡天真皇人以三十六部，秘丹书於琅函宝岌，藏紫字於琳馆玉房，传灵篇於青童君，教法始兴，留真像於西王母，道观初建。 尔乃降神於商，当阳甲之时，寄生於苦，在庚申之岁，阴御九龙之驾，光流五色之珠，托灵飞之遗体，剖真妙之左胁，娠八十一年，示七十二瑞，相，以其指木而姓李氏，以其白首而称老子，或曰伯阳； 甫或日太史檐，或名元、名德、名雅、名石，或字生、字光、字文、字始、何啻三十六号而已。 河目海口，日角月渊，鼻有双柱，额有三里，颊如横陇，颐若平丘，身长九尺，手握十纹，方瞳兑面，白志锦文，又岂止七十二相哉！ ．自文王、武王以来，居藏史、柱史之职，知周德之既衰，闵胡俗之未化，径由函谷，将度流沙，紫气横天，青牛税驾，末着关令所请之书，先肉徐甲既死之骨，时昭王二十五年七月甲子也。 今洛阳上清宫遗边尚存，古树蟠空，如龙蛇之状，上有一穴，实太上系车之地也。 国朝升河南府为中京，留守完颜讹出请鸦门道人武大顺来领此十方宫事。 始延四方之士，咸得洒扫於其中，一大胜事也。 武大顺丐文於予，将伐石志之。 予恐世俗未知太上之所以至此也，故备录其本末云。",
      "translated_text": "The crane is a transcendent bird, nesting in deep forests and roaming marshes. When humans approach, it spreads its wings and departs—who compels it to come? I have heard Daoists regard it as the steed of immortals. If this is so, then the resonance between them is manifest indeed.\n\nConfucius said: \"Serve one’s father with filial piety, and one serves Heaven with clarity; serve one’s mother with filial piety, and one serves Earth with discernment—extending this, there is nothing that cannot be penetrated.\" The *Book of Documents* states: \"Spirits and deities have no fixed abode; they respond only to utmost sincerity.\" When the teachings of the Dao’s subtle essence are practiced with purity and reverence, and when they convey the sagely Son of Heaven’s devotion to his kin, how could the response not be swift?\n\nHaving recorded what I have witnessed, I append this eulogy:\n\nAbove reigns the Emperor,\nWhom all spirits revere.\nThough their hearing is keen,\nWithout sincerity, no communion is clear.\n\nO august and divine,\nHe inherits Heaven’s Way.\nNo petition he made,\nYet for his kin he did pray.\n\nHe embraced Daoist learning,\nWhose roots lie in mystery.\nThrough pure reverence alone,\nHe sought to reach Heaven’s decree.\n\nThe altar stood solemn,\nIts rites profound and concealed.\nThe spirits above took heed,\nAnd blessings swiftly revealed.\n\nThen came auspicious vapors,\nNeither cloud nor smoke,\nDescending to the altar halls,\nTheir radiance bright and woke.\n\nAnd cranes, by the hundreds,\nAppeared in flight,\nTame as if led,\nSkimming eaves in delight.\n\nOn that day, the Emperor’s devotion\nBrought blessings to his mother’s abode.\nThe Son of Heaven declared,\n\"Praise to the Daoist master!\"\n\nThe master bowed deeply,\n\"All thanks to the Emperor’s filial heart.\"\nFor ten thousand myriad years,\nMay the Dao’s teachings impart.\n\n---\n\nThe Most High is the ancestor of primordial chaos. At first, the Three Pure Ones were born—from the Jade Pure to the Grand Pure—then the Nine Qi emerged, from the Boundless to the Unconditioned. With pure yang, the Thirty-Six Heavens were divided—from the Great Yellow to the Great Veil; with pure yin, the Thirty-Six Earths were formed—from Moist Brilliance to the Abyssal Depths—all within the realm of dominion.\n\nThough dwelling upon cinnabar terraces and within purple palaces, the Three Great Immortals, Nine Great Emperors, Twenty-Seven Heavenly Lords, Eighty-One Great Ministers, One Thousand Two Hundred Celestial Officers, Twenty-Four Thousand Spirit Bureaus, Seventy Thousand Immortal Youths and Jade Maidens, Five Hundred Million Heavenly Soldiers, and Divine Kings—all attend upon them in service.\n\nThe Ten Great Grotto-Heavens, Thirty-Six Grotto-Realms, Seventy-Two Blessed Lands, Thirty-Six Pure Retreats, and Twenty-Four Transformative Governances all look up in submission.\n\nFree from the calamities of the Ninefold Yang and the Sixfold Yin, they transcend the cycles of the Stone and Mustard Seed Cities. Some attend the Primordial Beginning, reviewing the registers of the Nine Palaces’ ascent and descent; some visit the Jade Dawn, perusing the ledgers of the Three Realms’ life and death. Some tread upon cloud-brocade and their bodies gleam like gold; some sit upon lotus leaves, their faces radiating sunlight. They don crowns of sevenfold radiance and cloud-silk, draped in ninefold splendor. Some ride eightfold jade chariots; some harness five-colored divine dragons. They raise cinnabar standards of streaming clouds and unfurl crane canopies of ninefold light. Some recline behind jeweled curtains; some wave dusters adorned with pearl banners. Some, in dark caps and plain robes, ride white horses with crimson scales; some, with jade forms and golden countenances, spur azure rainbows and white beasts.\n\nSome address the August Emperor of the Golden Gate as the Lord of the Empty Firmament; some, in the Grand Tenuity, are called the Heavenly Sovereign. Some emerged in the Dragon Han era as the Master of the Mystic Center; some appeared in the Red Brightness epoch as the Ancient Teacher. Some are called Yu Hua Zi, who drew the Eight Trigrams for Fu Xi; some are called Da Cheng Zi, who sowed the hundred grains for Yan Di. Some are called Guang Cheng Zi, who withdrew to Kongtong; some are called Wu Cheng Zi, who dwelled on Guye. Some bestowed upon the Perfected of Pure Emptiness the Twenty-Four Diagrams; some granted the Heavenly Perfected Sovereign the Thirty-Six Scriptures. Secret elixir texts were sealed in jade caskets and precious chests; purple characters were stored in jasper halls and gem chambers. The *Numinous Chapters* were transmitted to the Azure Lad; the Dharma’s inception began. True images were left with the Queen Mother of the West; the first Daoist temples were built.\n\nThereupon, they descended as spirits during the Shang, in the reign of Yang Jia. They were incarnated in suffering in the Gengshen year, riding a nine-dragon carriage with light streaming from five-colored pearls. Entrusting their transcendent remains to soaring flight, they split open the left side of their wondrous body. After eighty-one years of gestation, they displayed seventy-two auspicious signs. Their appearance—pointing to a tree, they took the surname Li; with white hair, they were called the Old Master, or Bo Yang. Some called them the Grand Historian Dan, or named them Yuan, De, Ya, Shi, or styled them Sheng, Guang, Wen, Shi—no fewer than thirty-six titles.\n\nTheir eyes were like rivers, their mouths like seas; their brows like the sun, their temples like the moon. Their noses bore twin pillars; their foreheads, three ridges. Their cheeks resembled transverse ridges; their jaws, level mounds. Nine feet tall, their hands grasped ten lines. With square pupils and broad faces, their white skin bore brocade patterns—how could they possess only seventy-two marks?\n\nSince the time of Kings Wen and Wu, they held the offices of Archivist and Chronicler. Perceiving the decline of Zhou’s virtue and lamenting the unenlightened customs of the Hu, they passed through Hangu Pass, intending to cross the Flowing Sands. A purple aura stretched across the sky; a blue ox bore their carriage. Finally, they inscribed the book requested by the Pass Keeper and revived the bones of Xu Jia, who had already died. This occurred in the twenty-fifth year of King Zhao, on the jiazi day of the seventh month.\n\nToday, near the ruins of the Upper Clear Palace in Luoyang, ancient trees coil like dragons and serpents. Above one hollow lies the very spot where the Most High tethered his carriage.\n\nIn our dynasty, the Hebei Circuit was elevated to the Central Capital. The Prefectural Governor, Wanyan Echu, invited the Gatekeeper Daoist Wu Dashun to oversee this Ten Directions Palace. He summoned scholars from all quarters, enabling them to sweep and tend its halls—a great and noble endeavor.\n\nWu Dashun requested an inscription from me to be carved in stone. Fearing that the world might not understand how the Most High came to this, I have recorded these details in full.",
      "overlap_context": "alm rejoiced together in celebration. The Court Historian’s Compiler, Zhu Lan, recorded these events, and many scholar-officials composed songs and eulogies. Master Sun further requested this humble text to be inscribed and engraved.\n\nHuaiying remarks: The Dao of Heaven is profound and distant, and the principles of its interaction with the mortal realm cannot be fully known. What *can* be known is this: when one cultivates virtue below, responses manifest above—this is the inevitable principle.",
      "start_char": 12040,
      "end_char": 13267,
      "start_sentence": 420,
      "end_sentence": 457,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.16500902175903,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\宫观碑志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "若夫传道於庚桑，有伏鹄之喻＇，讲礼於仲尼，有犹龙之叹，载诞青羊之肆，遐登白鹿之宫，皆后事也。 语在《道藏》，略而不书。 云云孙纯甫谨记。 宫观碑志竟",
      "translated_text": "As for the transmission of the Dao to Gengsang, there was the analogy of the crouching swan; the discourse on ritual with Confucius drew the sigh of \"like a dragon.\" Later, he was born in the market of the Green Ram, and in distant times ascended the palace of the White Deer—all matters of subsequent record. These accounts lie within the *Daoist Canon*; here, they are but briefly noted.\n\nThus respectfully recorded by Sun Chunfu.\n\nThe stele inscription for the palace and abbey is hereby concluded.",
      "overlap_context": "ered his carriage.\n\nIn our dynasty, the Hebei Circuit was elevated to the Central Capital. The Prefectural Governor, Wanyan Echu, invited the Gatekeeper Daoist Wu Dashun to oversee this Ten Directions Palace. He summoned scholars from all quarters, enabling them to sweep and tend its halls—a great and noble endeavor.\n\nWu Dashun requested an inscription from me to be carved in stone. Fearing that the world might not understand how the Most High came to this, I have recorded these details in full.",
      "start_char": 13267,
      "end_char": 13342,
      "start_sentence": 458,
      "end_sentence": 461,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 3.139983654022217,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\宫观碑志.txt",
        "category": "记传类"
      }
    }
  ]
}