{
  "source_id": "幻真先生服内元气诀",
  "source_file": "chunked_daozang\\幻真先生服内元气诀.json",
  "total_chunks": 5,
  "total_original_chars": 5016,
  "total_translated_chars": 28288,
  "total_translation_time": 135.4589352607727,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\藏外\\幻真先生服内元气诀.txt",
    "category": "藏外"
  },
  "full_translation": "Master Huan Zhen’s Method for Ingesting Internal Primordial Qi\n*Advancing the Method*\n\nWhenever one wishes to ingest qi, one must first select a high, dry, and cleanly secluded place. The chamber need not be spacious, but it must be completely free of drafts. One should always burn incense on either side, avoiding any foul or unclean substances. The bed must be thick and soft, with the feet slightly elevated. As the *Zhen Gao* states: “When the bed is high, demonic breaths cannot reach; spirits and gods often use earthly qi to blow upon people as a form of affliction, so a bed three feet high is sufficient.” The bedding should be adjusted to suit the temperature, with winter requiring slightly warmer coverings. The pillow should be just over two inches high, level with the back.\n\nEach night, after midnight when the generative qi arises—or at the first awakening before dawn—one should first expel the turbid and foul qi from the abdomen with nine exhalations. To elaborate further, this need not be strictly at dawn; whenever the celestial qi is harmonious and the abdomen is empty, the practice may commence.\n\nFirst, close the eyes and click the teeth thirty-six times to awaken the body’s spirits. Upon completion, use the fingers to pinch the inner and outer corners of the eyes, press the sides of the nose, rotate the ears, and massage the face—this is the method for the True Person’s daily conduct. Then, perform a brief set of guiding and pulling exercises to free and smooth the joints.\n\nNext, press the tongue against the upper palate, gather the saliva inside and outside the mouth, and when the mouth is full, swallow it, directing it down into the stomach. Visualize the stomach spirit receiving it, repeating this three times. This is called “rinsing and swallowing the numinous fluid,” which irrigates the five viscera and causes the face to radiate light. The general approach remains largely consistent.\n\nThen, still the spirit utterly, making the mind like withered wood and the body as if merely draped in clothing. Inwardly gaze and reverse-hear, casting aside all burdens. Only then may one begin the refinement.\n\nFor every step, keep the eyes closed and the fists firmly clenched, except when dispersing qi, at which point the fingers may be unfurled. Clenching the fists serves to close the passes and guard against the intrusion of essence and malevolent influences. Beginners in qi ingestion, whose qi pathways are not yet open, should not clench their fists. Only after a hundred days or half a year, when the qi flows smoothly and sweat appears in the palms, may one begin to clench the fists. As the *Huangting Jing* states: “Seal the three passes and clench the fists to still them; rinse and swallow the golden liquor and jade blossoms, until eventually one ceases to eat, the Three Worms perish, and with long practice, one naturally flourishes.”\n\n*Method for Refining Qi*\n\nThe method states: Each of the five viscera possesses its own proper qi. When lying down at night and holding the breath, upon awakening and before ingesting qi, one must first ensure that any undigested food is transformed, allowing the stale qi to be expelled, after which one may begin the regulated ingestion.\n\nThe method is as follows: Close the eyes, clench the fists, lie supine, place both fists between the breasts, raise the knees, lift the back and buttocks, and hold the breath. Then, drum the qi in the Sea of Qi, causing it to circulate from within outward, rolling and turning it before exhaling with a *he* sound, repeating this nine or eighteen times. This is called “refining the qi.” Upon completion, regulate it.\n\n*Method for Regulating Qi*\n\nThe method states: The nose is the Gate of Heaven, and the mouth is the Door of Earth. Thus, one inhales through the nose and exhales through the mouth, without error. Mistakes cause qi counterflow, and counterflow generates illness. During exhalation and inhalation, one must be especially cautious, ensuring that no sound is audible to the ears. Regulate the breath five, seven, or nine times until it is harmonious. This is called “regulating the qi.” Upon completion, swallow it. When sleeping at night, keep the mouth closed and do not exhale through it.\n\n*Method for Swallowing Qi*\n\nThe method states: The subtlety of ingesting internal qi lies in swallowing qi. Worldly people swallow external qi, mistaking it for internal qi, unable to distinguish between them—how can they discuss this practice? Those who engage in inhalation and exhalation must proceed with care to avoid errors.\n\nAll people receive the primordial qi of Heaven and Earth to form their bodies, and within the body, the primordial qi naturally governs. With each swallow and each cycle of exhalation and inhalation, the internal qi responds to the external qi. Naturally, the qi in the Sea of Qi rises with the exhalation, reaching the throat. At the moment of full exhalation, immediately close the mouth, drum the cheeks, and swallow, causing a muffled sound. The qi should descend with a gurgling noise, moving down the left side for men and the right for women, passing through the twenty-four joints like flowing water, distinctly audible. In this way, the internal and external qi are clearly distinguished.\n\nGuide it with intention and massage it with the hands to hasten its descent into the Sea of Qi. The Sea of Qi is located three inches below the navel and is also called the Lower Cinnabar Field. Beginners in qi ingestion, whose upper burner is not yet open, may use hand massage to accelerate the descent. Once the qi flows smoothly, massage is no longer necessary. Close the mouth and perform three consecutive swallows. A dry swallow is called “cloud movement,” while a swallow accompanied by mouth fluids is called “rain bestowal.”\n\nBeginners, whose qi has not yet begun to flow, should perform only one swallow at a time, gradually circulating it, and not immediately attempt three consecutive swallows. Only when the qi flows smoothly may one gradually increase the number, eventually achieving minor success. After one year, the qi may begin to flow freely, and after three years of practice, one may ingest qi at will.\n\nFor those newly practicing qi ingestion, whose qi has not yet flowed smoothly, if a swallow does not descend, one swallow at a time may serve as a marker. As long as the qi descends with a muffled, gurgling sound straight into the Sea of Qi, the practice is correct.\n\n*Method for Circulating Qi*\n\nThe method states: The Lower Cinnabar Field is near two posterior cavities that connect to the spinal meridian, ascending to the Muddy Pellet. The Muddy Pellet is the name for the palace of the brain. With every three consecutive swallows, swiftly visualize the Lower Cinnabar Field, where the internal primordial qi resides, and guide it with intention into the two cavities. Then, imagine two strands of white qi rising on either side of the spine, entering the Muddy Pellet, steaming and suffusing all the palaces. This qi pervades the hair, face, head, neck, arms, and fingers, descending all at once into the chest, reaching the Middle Cinnabar Field. The Middle Cinnabar Field is the spirit palace of the heart. It irrigates the five viscera, then returns to the Lower Cinnabar Field, passing through the Three Stars, flowing through the thighs, knees, shins, and ankles, and descending to the Bubbling Spring. The Bubbling Spring is the center of the sole. This is what is meant by “governing with a single qi, drumming it like thunder, and moistening it like wind and rain.”\n\nJust as the heavens possess springs, without the surging drum of thunder, they could not moisten the myriad things. If one does not expel the turbid and malign qi, it will cause unease. Though there be fluids, without rinsing and swallowing, they cannot irrigate the five viscera, bring forth their radiance, and ultimately return essence to replenish the brain. Without union, they cannot ascend against the current. Ingesting internal qi, without exhalation and inhalation, one cannot guide and employ it.\n\nThus, the Dao of expelling and the principle of circulation are modeled after heaven and earth. Visualize the turbid malign accumulations, pathogenic qi, and stagnant blood within the body being scoured by the correct nourishing qi, all expelled through the tips of the hands and feet—this is called dispersing qi. When qi disperses, extend the fingers; there is no need to clench them tightly. Each such cycle constitutes one passage. When passage is achieved, there is no illness, and one readjusts as if guiding the hand. If guiding the hand becomes difficult, drum and swallow as before.\n\nClosing the qi and drumming to swallow for thirty-six breaths is called \"minor attainment.\" If one has not yet ceased taking grains, one should still eat sparingly at this stage, ensuring the abdomen remains empty and pure. Whether sitting or lying down, whenever the abdomen is empty, swallow the qi. From dawn to dusk, performing this ten times naturally results in three hundred and sixty swallows. If one has long ingested qi and can suddenly manage three hundred and sixty swallows, this too is called \"minor attainment.\" One thousand two hundred swallows is called \"major attainment,\" also known as \"great embryonic breathing.\" Simply closing the qi and counting to one thousand two hundred breaths is likewise \"major attainment.\" Only then will the embryo not congeal, yet one still cannot refine the form and transform the substance. Even if one attains longevity, it will be like a withered tree, devoid of vital luster.\n\nThere are also methods for refining qi, closing qi, yielding qi, and distributing qi, all of which are detailed in the text. Those of like mind should study them carefully.\n\n**Method for Refining Qi**\nThe method states: To refine the form by ingesting qi, enter a chamber when slightly at leisure. Remove clothing, loosen the hair, lie supine, extend the hands without clenching, and comb the hair to ensure it flows freely. Spread it upon the mat, then regulate and swallow the qi. After swallowing, close the qi and wait until it reaches its limit. Then still the mind, sever all thoughts, and allow the qi to flow where it will to unobstruct the principles. If stifled, exhale; if panting, regulate the breath. Once the qi is calm, refine it again. Perform this ten times, then stop.\n\nFor those newly ingesting qi who have not yet achieved passage, gradually increase from one to ten when at leisure. Once passage is achieved, gradually increase to twenty or fifty. This should cause the entire body to perspire—such is the sign of its efficacy. Calm the mind and harmonize the qi, then lie down without rising into the wind. This is the fine art of reversing aging and extending years. However, perform this only when the fluids are clear and fresh; if the qi is dull and one feels drowsy, do not proceed. Practice diligently, and even if the four limbs feel heavy or obstructed, perform this method. It need not be done every morning but should be practiced when one is clear and refreshed, every ten or five days.\n\nThe *Huangting Jing* states: \"A thousand disasters vanish, a hundred illnesses heal; one need not fear the ferocity of tigers and wolves, for it also reverses aging and extends years forever.\"\n\n**Method for Yielding Qi**\nThe method states: The technique of yielding qi harmonizes the body’s qi and spirit, ensuring smoothness and comfort. Whether walking, standing, sitting, or lying down, it can be practiced. Simply regulate the qi according to the gateways, whether stretching out on the bed or sitting erect. Without thought or awareness, sink into profound stillness, making the mind like the vast emptiness. Then regulate and close the qi, whether ten or twenty breaths, allowing passage. The qi must be allowed to flow freely, without contention from intention. After a long while, the qi will exit through the pores of the body, no longer expelled through the mouth. Even if there is some residue, it will be minimal. Further regulation can extend to one thousand two hundred breaths or more, which is even better. Whether walking, standing, sitting, or lying down, it can be practiced. With diligent practice, the hundred passages open, the complexion becomes lustrous, and the qi remains clear and fresh, as if newly bathed. Perform this whenever there is disharmony, and one will naturally attain tranquility.\n\nThe *Huangting Jing* states: \"Sit loftily in non-action, and the hun and po are at peace; the pure and tranquil spirit appears and speaks with me.\"\n\n**Method for Closing Qi**\nThe method states: If, due to improper cultivation, illness suddenly arises, swiftly retire to a secluded chamber and, following the method of ingesting qi, arrange the hands and feet. Then regulate and swallow the qi. Focus on the afflicted area, close the qi, and direct intention to attack it. When the qi reaches its limit, exhale. Then swallow the qi again and continue the attack as before. If the qi becomes labored, stop; once it is regulated, attack again. Perform this twenty to fifty times until the afflicted area sweats and becomes unobstructed, then cease. If the ailment persists, practice this at midnight, the fifth watch, or repeatedly during the day, directing intention to attack. Regardless of whether the illness is in the head, face, hands, or feet, attack the afflicted area—there is no ailment that will not be cured. Thus, the mind’s command over qi surpasses even the hand, as if aided by spirits, its efficacy unmatched.\n\n**Method for Distributing Qi**\nThe method states: When intending to distribute qi to heal another’s illness, first determine the afflicted viscus of the recipient and draw qi from the corresponding direction. Have the patient face that direction, calm the mind, and quiet the thoughts to receive the qi. After distributing the qi, instruct the patient to swallow it. Malevolent spirits will flee, and pathogenic qi will be permanently expelled.\n\n**Method of the Six Qi**\nThe method states: The six qi are *xu*, *he*, *si*, *chui*, *hu*, and *xi*. Each qi corresponds to a viscus, with the remaining one governing the Triple Burner. *Si* pertains to the lungs, which govern the nose. For cold, heat, disharmony, or extreme fatigue, practice *si* exhalation and inhalation, which also treats skin sores and scabies. For such ailments, apply the method accordingly, and healing will be immediate.\n\n*He* pertains to the heart, which governs the tongue. For dry mouth, rough tongue, qi obstruction, or various pathogenic qi, use *he* to expel them. For great heat, open the mouth wide; for slight heat, open it slightly when exhaling *he*.\n\nIf intentional practice is required, it is fitting to regulate accordingly.\n\n*Hu* pertains to the spleen, which governs the central palace. For mild heat, disharmony, abdominal and stomach distension, or qi stagnation without release, use the *hu* qi to regulate it.\n\n*Chui* pertains to the kidneys, which govern the ears. For cold in the waist and abdomen or decline of yang vitality, use the *chui* qi to regulate it.\n\n*Xi* pertains to the Triple Burner. For disharmony of the Triple Burner, use *xi* to treat it.\n\nThough each qi has its specific treatment, for cold, heat, extreme fatigue, or wind-pathogen disharmony affecting the five viscera and Triple Burner, all are governed by the heart. The heart is mastered by *he*, and using *he* alone can cure all such ailments—there is no need for the six qi.\n\n*Xu* pertains to the liver, which governs the eyes. For redness, swelling, dimness, or dizziness, use *xu* to treat them.\n\n**Method for Regulating Qi and Fluids**\nThe method states: Humans consume the five flavors, each of which returns to one viscus, and each viscus has its turbid qi. All emerge through the mouth. Furthermore, the six qi and the qi of the Triple Burner converge at this gate, where various impurities gather to form turbid qi. Upon waking from sleep, a foul vapor issues from the mouth, unbearable to smell. Examine and observe this to discern its signs.\n\nWhenever the mouth is parched, bitter, or the tongue rough, the cheeks lack moisture, or swallowing causes throat pain making eating difficult, these are signs of extreme heat. Immediately open the mouth wide and exhale *he*, ensuring each swallow follows the proper gate. Exhale ten or twenty times, then strike the Heavenly Drum seven or nine times. Stir the Flower Pool beneath the tongue and swallow the fluid, repeating until the heat retreats. Cease when the mouth produces clear, sweet water—this indicates the heat has receded and the five viscera are cool.\n\nIf the mouth’s fluids are cold and tasteless, or after excessive *he* exhalation the heart feels unsettled, food and drink lose their flavor, and water is not tolerated, these are signs of cold. Use *chui* to warm it, following the method for warming heat. Wait until the mouth tastes pleasant and the heart is harmonious, then cease.\n\nThe *Yellow Court Classic* states:\n*\"The Jade Pool’s clear water irrigates the numinous root;*\n*Diligently cultivate this, and you may long endure.\"*\nIt also says:\n*\"Rinsing and swallowing the numinous fluid keeps calamity at bay.\"*\n\n**Method for Dietary Regulation and Protection**\nThe method states: After practicing qi absorption, food must follow a proper sequence. Beneficial foods should be consumed regularly, while harmful ones must be permanently avoided.\n\nEach morning, consume a small portion of bland rice porridge or sesame porridge, which greatly benefits the person, regulates spleen qi, and replenishes fluids. At midday, plain noodles, *botuo*, or cakes are excellent, but avoid eating them while hot, as this disrupts the upright qi. Onion and scallion soup is also good. Rice should be polished, and barley flour is beneficial. Throughout the four seasons, these foods are highly suitable for those practicing qi absorption. They need not be eaten daily but may be consumed as desired.\n\nDeer meat prepared as dried jerky is excellent, but during fasting or abstinence, it must not be eaten. On the thirty-six days when the spirits of the birds and beasts are active, their corresponding meats must not be consumed. Dates, chestnuts, and steamed cakes may also be eaten. Eat moderately—never to fullness, as overindulgence harms the heart and hinders qi circulation.\n\nHot noodles and radish soup are strictly forbidden. Salty, sour, and pungent foods should be gradually reduced. After each meal, exhale the turbid qi of food toxins from the mouth to prevent illness.\n\nFor those practicing qi absorption, the intestines and stomach are empty and pure. Raw, cold, vinegary, slippery, sticky, stale, hard, rotten, or indigestible foods must not be eaten. If even a single mouthful of such foods is consumed, mild pain will arise in the affected area—beware.\n\nSoft foods are most suitable. Before eating, swallow qi three to five times to take control, and also consume three to five grains of raw Sichuan pepper. After eating, swallow three more grains to guide the qi downward. This substance aids digestion, directs qi downward, unblocks the Triple Burner, benefits the five viscera, expels turbidity, digests stagnant food, and assists the upright qi. It is suitable for long-term consumption, as it repels cold, summerheat, and dampness, brightens the eyes, promotes hair growth, and enhances qi cultivation—its benefits are too numerous to list in full. Detailed methods for consuming Sichuan pepper are found in the *Taiqing Jing*.\n\nIf qi descends and causes bowel movements, release it—do not retain it, lest it cause illness. On an empty stomach, drink one or two cups of clear wine as desired, which is excellent. Warm in winter and cool in summer, it assists the upright qi and dispels pathogens—its benefits are not insignificant. However, moderation is key: excess leads to intoxication, which harms the spirit and shortens life. If compelled by social obligations, drink sparingly—just three to five sips—and afterward, open the mouth wide ten times to expel the toxins of fermentation. Regulate accordingly.\n\nOrdinarily, one or two cups may be sipped slowly, avoiding drunkenness while maintaining appetite and taste. However, avoid all impure and foul qi from childbirth, death, livestock, or other unclean sources—do not even approach them, let alone enter their vicinity, as they severely disrupt the upright qi.\n\nIf unexpectedly encountering such impurities, swiftly hold the breath, close the eyes, and pass by upwind. Then seek one or two cups of wine to cleanse the system. If the qi entering the abdomen feels unsettled, regulate the breath to expel the turbid qi, then swallow and draw in fresh qi, directing it with the mind. Massage the area with the hands, then chew Sichuan pepper and drink one or two cups of wine to disperse the impurity. If it does not disperse, do not force it—let it exit naturally. This indicates congestion in the upper burner, so qi regulation is essential to restore harmony.\n\nOily, greasy, and pungent foods severely offend the upright qi—be mindful and avoid them. Even if one has previously consumed them, ensure they do not recur.\n\nThose who practice qi absorption for one year will achieve free circulation of qi; for two years, the qi will become substantial; and by three years, the practice will be complete, with primordial qi condensed and solidified. Even if one encounters impurities, they will be unable to cause harm. Daily swallowing a thousand breaths is not considered excessive—from this, one gradually reverses aging and returns to youth.\n\nQi transforms into fluids, fluids into blood, blood into essence, essence into marrow, and marrow into *yú*. In one year, the qi is renewed; in two years, the blood; in three years, the vessels; in four years, the flesh; in five years, the marrow; in six years, the *yú*; in seven years, the bones; in eight years, the hair; and in nine years, the form. Then the thirty-six thousand true spirits within the body transform into immortal youths, and one is called a *zhenren*.\n\nWith diligent practice and no slackening, the joints become interconnected, and the five viscera grow firm. As the *Huangting Jing* states: *\"A thousand thousand, a hundred hundred, linked as one; ten by ten, layered like mountains.\"* Thus, internal qi does not escape, external qi does not enter, cold and heat cannot invade, blades and weapons cannot harm, and one ascends and transforms, equal to the Three Luminaries.\n\n**Method of Abandoning Grain**\nThe method states: To abandon grain, simply persist in diligent practice as before. After three years, the upright qi will flow freely, marrow will fill the bones, the hundred spirits will guard their positions, and the Three Corpses will flee. Gradually, one will no longer desire the scent of the five flavors, constantly longing to abstain from food. When the desire to cease arises, cessation comes effortlessly.\n\nWhenever the abdomen feels empty, one must swallow qi—regardless of morning or night, without fixed limits. Over time, one naturally understands the rhythm, and no further instruction is needed. What use are medicinal substances?\n\nGenerally, those who rely on medicines often cannot practice qi absorption. They toil daily, devoted solely to medicinal substances, yet their bodies never achieve refinement and solidity. This is not the path of the superior practitioner. As the *Huangting Jing* says: *\"The grains’ essence is the earth’s vitality; the five flavors’ external allure is foul and corrupting. It disturbs the spirit and scatters the fetal qi—how can one reverse aging and return to infancy? Why not consume the qi of Great Harmony? Thus one does not die and enters the Yellow Tranquility.\"* This is the meaning.\n\n**Admonitions on Guarding the Method**\n\nThe Method states: Most people in the world indulge in desires that harm life and cut short destiny—this has been true across all ages. If one does not take early precautions, how can regret avail anything? When a person nears death, only then do they cherish their body and life; when guilt is already determined, only then do they think of seeking good deeds; when illness has already taken hold, only then do they seek medicine. Yet by then, the celestial net has been cast—how can it be saved?\n\nThus, the wise and sagacious superior practitioners cherish life before its thread is severed, guard against misfortune before it arises, and remedy illness before it takes root. They then cast off worldly robes, gather their minds, and return to the Dao. The Dao is qi; qi is the master of the heart; essence is the root of life. Only by treasuring essence and valuing qi can one preserve both body and mind.\n\nThe *Huangting Jing* says:\n*\"Within the square inch of the heart, guard and conceal well.\nSpirit and essence return to youth and regain vigor;\nNurture the jade-tree child to stand firm as a staff.\nHasten to secure your essence to repay yourself.\"*\n\nIt also says:\n*\"For long life, be most cautious in the chamber—\nWhy wait until death to make the spirits weep?\nIf you leak the secret like rivers pouring into the sea,\nLeaves fall, the tree withers, and all verdure is lost.\"*\n\nIndeed, none who attain long life and enduring vision do so without treasuring essence and preserving qi. The Way of Inner Alchemy and the governance of the inner elixir remain unknown to the world. Even those who devote themselves to qi but do not sever desires will not escape calamity.\n\nThus it is said: People lose the Dao—the Dao does not lose people; people constantly depart from life—life does not depart from people. Cultivating gentlemen must preserve and reflect upon this themselves.\n\n**Method of Qi Absorption and Fetal Breathing**\nThe Method states: Essence is qi; qi is the Dao. First, knock the teeth together thirty-six times, then turn the head to the right in a full circle, like a turtle stretching its neck. When the fetal breath rises to the throat, swallow it. Do this three times, then close the mouth and rub the tongue inside and out to gather saliva. Rinse the mouth until full, then tilt the head back and swallow, sending it upward to nourish the Mud Pill Palace (the top of the head). This moistens the five viscera.\n\nLaozi said: *\"Sweet rain nourishes the myriad things; fetal saliva moistens the five viscera.\"* By day and night, without sleep, one becomes a perfected person, ascending to attain immortality and descending to prolong life. For any illness or suffering in the body, visualize sending qi to the afflicted area, and it will be cured. True qi expels turbid qi, surging upward and purging downward. When the spirit feels clear and refreshed, the qi naturally harmonizes.\n\nThus the sages have said: *\"Man exists within qi, and qi exists within man. Man does not depart from qi, nor qi from man. Man relies on qi to live and dies when qi is lost. The principle of life and death lies entirely in qi.\"* If one can properly regulate qi, even death cannot be sought.\n\nEach night at midnight and the fifth watch, stretch out both legs, make fists, and extend the hands five inches from the body. The pillow should not exceed two inches in height. Close the eyes and swallow as before. After washing and combing, drink a cup of warm wine to benefit fetal breathing, moisten the six bowels, and guide qi to open the hundred passages.\n\nThe esoteric method of the immortals of Mount Emei cannot be spoken of lightly. Laozi said: *\"Lingzhi and jade blossoms reside within the belly. Seeking medicines in famous mountains and great marshes strays far from the Dao. My Way is exceedingly simple—only practice it.\"*\n\nUpon rising early, stretch out both legs, regulate the breath, clasp the hands behind the head, and pull forward while the head pulls back, repeating this three times. Then interlock the hands and pull forward three to five times, followed by left and right stretches thirty to fifty times. Afterward, swallow saliva twenty times. If the four limbs feel unbalanced, rinse the mouth with saliva twenty to thirty times and swallow to dispel illness.\n\nThis method is worth ten thousand gold pieces and must not be transmitted to the unworthy. Those who rashly pass it on bring calamity upon three generations.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "幻真先生服内元气诀 进取诀 凡欲服气，先须高燥净空之处，室不在宽，务在绝风瀼。 常令左右烧香不用秽污。 床须厚软，脚稍令高《真诰》曰：床高鬼吹不及，言鬼神善因地炁以吹人为崇，床高三尺可也。 衾被适寒温，令冬稍暖尤佳。 枕高二寸馀，令与背平。 每至半夜后生气时，或五更睡之初觉，先吹出腹中浊恶之炁，一九下止。 若要细而言之，则亦不在五更，但天炁调和，腹中空，则为之。 先闭目，叩齿三十六通，以警身神。 毕，以手指捻目大小眦，兼按鼻左右，旋耳及摩面目，为真人起居之法。 更随时少为导引，以宣畅关节。 乃以舌柱上腭，料口中外津液，候满口则咽之，令下入胃，存胃神承之，如此三，止。 是谓漱咽灵液，灌溉五脏，面乃生光。 此之去就，大体略同。 便兀然放神，使心如枯木，空身若委衣，内视返听，万累都遣，然后淘之。 每事皆闭目握固，唯临散气之时，则展指也。 夫握固，所以闭关防而却精邪。 初服气之人，气道未通，则不得握固，待至百日或半年，觉气通畅，掌中汗出，则可握固。 《黄庭经》云：闭塞三关握固停，漱咽金醴吞玉英，遂至不食三虫亡，久服自然得兴昌。 淘气诀 诀曰：凡人五脏，亦各有正气。 夜卧闭息，觉后欲服气，先须转令宿食消，故气得出，然后始得调服。 其法闭目握固，仰卧，倚两拳于乳间，竖两膝，举背及尻，间闭气，则鼓气海中气，使自内向外，轮而转之，呵而出之，一九或二九止。 是曰淘气，毕则调之。 调气法 诀曰：鼻为天门，口为地户，则鼻纳之，口宜吐之，不得有误。 误则气逆，气逆则生疾。 吐纳之际，尤宜慎之，亦不使自耳闻，调之或五或七至九，令平和也。 是曰调气，毕则咽之，夜睡则闭之，不可口吐之也。 咽气诀 诀曰：服内气之妙，在乎咽气。 世人咽外气以为内炁，不能分别，何以谈哉？ 纳吐之士，宜审而为之，无或错误耳。 夫人皆禀天地之元气而生身，身中自分元气而理。 每咽及吐纳，则内气与外气相应，自然气海中气，随吐而上，直至喉中，但喉吐极之际，则辄闭口连鼓而咽之，令郁然有声，汨汨然从男左女右而下，纳二十四节，如水沥沥，分明闻之也。 如此，则内气与外气相顾，皎然而别也。 以意送之，以手摩之，令速入气海。 气海，脐下三寸是也，亦谓之下丹田。 初服气人，上焦未通，以手摩之，则令速下，若流通，不摩亦得。 一闭口，三连咽止。 乾咽，号曰云行。 一湿口咽取口中津咽，谓之雨施。 初服气之人，炁未流行，每一咽则旋行之，不可遽至三连咽也。 候气通畅，然后渐渐加之，直至于小成也。 一年后始可流通，三年功成，乃可恣服。 新服气之人，炁既未通，咽或未下，须一咽以为候，但自郁然有声，汩汩而下，直入气海。 行气诀 法曰：下丹田近后二穴，通脊脉，上达泥丸。 泥丸，脑宫津名也。 每三连咽，即速存下丹田所，得内元炁，以意送之，令入二穴。 因想见两条白炁，夹脊双引，直入泥丸，熏蒸诸宫，森然遍下毛发、面部、头项、两臂及巨手指，一时而下入胸，至中丹田。 中丹田，心宫神也。 灌五脏，却历入下丹田，至三星，遍经褷膝、胫、踝，下达涌泉。 涌泉，足心是也。 所谓分一气而理，鼓之以雷霆，润之以风雨之状也。",
      "translated_text": "Master Huan Zhen’s Method for Ingesting Internal Primordial Qi\n*Advancing the Method*\n\nWhenever one wishes to ingest qi, one must first select a high, dry, and cleanly secluded place. The chamber need not be spacious, but it must be completely free of drafts. One should always burn incense on either side, avoiding any foul or unclean substances. The bed must be thick and soft, with the feet slightly elevated. As the *Zhen Gao* states: “When the bed is high, demonic breaths cannot reach; spirits and gods often use earthly qi to blow upon people as a form of affliction, so a bed three feet high is sufficient.” The bedding should be adjusted to suit the temperature, with winter requiring slightly warmer coverings. The pillow should be just over two inches high, level with the back.\n\nEach night, after midnight when the generative qi arises—or at the first awakening before dawn—one should first expel the turbid and foul qi from the abdomen with nine exhalations. To elaborate further, this need not be strictly at dawn; whenever the celestial qi is harmonious and the abdomen is empty, the practice may commence.\n\nFirst, close the eyes and click the teeth thirty-six times to awaken the body’s spirits. Upon completion, use the fingers to pinch the inner and outer corners of the eyes, press the sides of the nose, rotate the ears, and massage the face—this is the method for the True Person’s daily conduct. Then, perform a brief set of guiding and pulling exercises to free and smooth the joints.\n\nNext, press the tongue against the upper palate, gather the saliva inside and outside the mouth, and when the mouth is full, swallow it, directing it down into the stomach. Visualize the stomach spirit receiving it, repeating this three times. This is called “rinsing and swallowing the numinous fluid,” which irrigates the five viscera and causes the face to radiate light. The general approach remains largely consistent.\n\nThen, still the spirit utterly, making the mind like withered wood and the body as if merely draped in clothing. Inwardly gaze and reverse-hear, casting aside all burdens. Only then may one begin the refinement.\n\nFor every step, keep the eyes closed and the fists firmly clenched, except when dispersing qi, at which point the fingers may be unfurled. Clenching the fists serves to close the passes and guard against the intrusion of essence and malevolent influences. Beginners in qi ingestion, whose qi pathways are not yet open, should not clench their fists. Only after a hundred days or half a year, when the qi flows smoothly and sweat appears in the palms, may one begin to clench the fists. As the *Huangting Jing* states: “Seal the three passes and clench the fists to still them; rinse and swallow the golden liquor and jade blossoms, until eventually one ceases to eat, the Three Worms perish, and with long practice, one naturally flourishes.”\n\n*Method for Refining Qi*\n\nThe method states: Each of the five viscera possesses its own proper qi. When lying down at night and holding the breath, upon awakening and before ingesting qi, one must first ensure that any undigested food is transformed, allowing the stale qi to be expelled, after which one may begin the regulated ingestion.\n\nThe method is as follows: Close the eyes, clench the fists, lie supine, place both fists between the breasts, raise the knees, lift the back and buttocks, and hold the breath. Then, drum the qi in the Sea of Qi, causing it to circulate from within outward, rolling and turning it before exhaling with a *he* sound, repeating this nine or eighteen times. This is called “refining the qi.” Upon completion, regulate it.\n\n*Method for Regulating Qi*\n\nThe method states: The nose is the Gate of Heaven, and the mouth is the Door of Earth. Thus, one inhales through the nose and exhales through the mouth, without error. Mistakes cause qi counterflow, and counterflow generates illness. During exhalation and inhalation, one must be especially cautious, ensuring that no sound is audible to the ears. Regulate the breath five, seven, or nine times until it is harmonious. This is called “regulating the qi.” Upon completion, swallow it. When sleeping at night, keep the mouth closed and do not exhale through it.\n\n*Method for Swallowing Qi*\n\nThe method states: The subtlety of ingesting internal qi lies in swallowing qi. Worldly people swallow external qi, mistaking it for internal qi, unable to distinguish between them—how can they discuss this practice? Those who engage in inhalation and exhalation must proceed with care to avoid errors.\n\nAll people receive the primordial qi of Heaven and Earth to form their bodies, and within the body, the primordial qi naturally governs. With each swallow and each cycle of exhalation and inhalation, the internal qi responds to the external qi. Naturally, the qi in the Sea of Qi rises with the exhalation, reaching the throat. At the moment of full exhalation, immediately close the mouth, drum the cheeks, and swallow, causing a muffled sound. The qi should descend with a gurgling noise, moving down the left side for men and the right for women, passing through the twenty-four joints like flowing water, distinctly audible. In this way, the internal and external qi are clearly distinguished.\n\nGuide it with intention and massage it with the hands to hasten its descent into the Sea of Qi. The Sea of Qi is located three inches below the navel and is also called the Lower Cinnabar Field. Beginners in qi ingestion, whose upper burner is not yet open, may use hand massage to accelerate the descent. Once the qi flows smoothly, massage is no longer necessary. Close the mouth and perform three consecutive swallows. A dry swallow is called “cloud movement,” while a swallow accompanied by mouth fluids is called “rain bestowal.”\n\nBeginners, whose qi has not yet begun to flow, should perform only one swallow at a time, gradually circulating it, and not immediately attempt three consecutive swallows. Only when the qi flows smoothly may one gradually increase the number, eventually achieving minor success. After one year, the qi may begin to flow freely, and after three years of practice, one may ingest qi at will.\n\nFor those newly practicing qi ingestion, whose qi has not yet flowed smoothly, if a swallow does not descend, one swallow at a time may serve as a marker. As long as the qi descends with a muffled, gurgling sound straight into the Sea of Qi, the practice is correct.\n\n*Method for Circulating Qi*\n\nThe method states: The Lower Cinnabar Field is near two posterior cavities that connect to the spinal meridian, ascending to the Muddy Pellet. The Muddy Pellet is the name for the palace of the brain. With every three consecutive swallows, swiftly visualize the Lower Cinnabar Field, where the internal primordial qi resides, and guide it with intention into the two cavities. Then, imagine two strands of white qi rising on either side of the spine, entering the Muddy Pellet, steaming and suffusing all the palaces. This qi pervades the hair, face, head, neck, arms, and fingers, descending all at once into the chest, reaching the Middle Cinnabar Field. The Middle Cinnabar Field is the spirit palace of the heart. It irrigates the five viscera, then returns to the Lower Cinnabar Field, passing through the Three Stars, flowing through the thighs, knees, shins, and ankles, and descending to the Bubbling Spring. The Bubbling Spring is the center of the sole. This is what is meant by “governing with a single qi, drumming it like thunder, and moistening it like wind and rain.”",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1277,
      "start_sentence": 0,
      "end_sentence": 55,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.04584717750549,
      "metadata": {
        "source_file": "dao\\藏外\\幻真先生服内元气诀.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "只如天有泉源，非雷霆腾鼓，无以润万物。 若不回荡浊恶之气，则令人有不安。 既有津液，非漱咽之，不堪溉灌五脏，发其光彩，终不能还精补脑； 非交合，则不能溯而上之。 咽服内气，非吐纳则不能引而用之。 是知回荡之道，运用之理，所以法天则地。 想身中浊恶结滞，邪气瘀血，被正荣气荡涤，皆从手足指端出去，谓之散气。 气散则展手指，不须握固。 如此一度，则是一通。 通则无疾，则复调之，以如使手。 使手复难，鼓咽如前。 闭炁鼓咽至三十六息，谓之小成。 若未绝粒，但至此常须少食，务令腹中旷然虚净，无问坐卧，但腹空则咽之，一日通夕至十度，自然三百六十咽矣。 若久服炁，息顿三百六十咽，亦谓之小成，一千二百咽，谓之大成，谓之大胎息。 但闭炁数至一千二百息，亦是大成。 然后胎不结，然不能炼形易质，纵得长生，同枯木无精光。 又有炼气、闭气、委气、布气并，诸诀法，具列于文，同志详焉。 炼气诀 诀曰：服气炼形，稍暇入室，脱衣散发，仰卧，展手勿握固，梳头令通，垂席上布之，则调气咽之。 咽讫便闭气，候极，乃冥心绝想，任气所之以通理，闷即吐之，喘息即调之，候气平，又炼之。 如此十遍，即止。 新服气之人，未通，有暇渐加一至十； 候通，渐加至二十至五十。 即令遍身汗出，如有此状，是其效也。 安心和气，且卧勿起冲风，乃却老延年之良术尔。 但津液清爽，时为之尔； 气惛乱欲睡，慎勿为也。 常勤行之，四肢烦闷不畅亦为之，不必每日旦，要独清爽时，为之十日、五日。 《黄庭经》云：千灾已消百病痊，不惮虎狼之凶残，亦以却老年永延。 委气诀 诀曰：夫委气之法，体气和平也，身神调畅，无问行住坐卧，皆可为之。 但依门户调气，或伸于床，或兀然而坐，无神无识，寂寂沉沉，使心同太空，因而调闭，或十气、二十气皆通。 须任气，不得与意相争。 良久，气当从百毛孔中出，不复口吐也，纵有十分无二也。 复调能数至千二百息已上，弥佳。 行住坐卧，亦可为之。 如此勤行，百关开通，颜色光泽，气清长如新沐浴之人。 但有不和则为之，亦当清泰也。 《黄庭经》云：高拱无为魂魄安，清净神见与我言。 闭气诀 诀曰：忽有修养乖宜，偶生疾患，宜速于密室，依服气法，布手足讫，则调气咽之。 念所苦之处，闭气以意想注，以意攻之，气极则吐之。 讫，复咽气，相继依前攻之，气急则止，气调复攻之。 或二十至五十，攻觉所苦处，汗出通润，即止。 如未损，即每日夜半，或五更、昼日频作，以意攻之。 不拘病在头面、手足，但有疾之处、则攻之，无不愈者。 是知心之所使气，甚于使手，有如神助，功力难比也。 布气诀 诀曰：凡欲布气与人疗病，先须依前人五脏所患之处，取方面之炁，布入前人身中，令病者面其方，息心静虑，此与炁。 布炁讫，便令咽气。 鬼贼自逃，邪气永绝。 六炁诀 诀曰：六气者，嘘、呵、呬、吹、呼、嘻是也。 气各属一脏，馀一气属三焦。 呬属肺，肺主鼻，有寒热不和及劳极，依呬吐纳，兼理皮肤疮疥，有此疾，则依状理之，立愈也。 呵属心，心主舌，口乾舌涩，气不通及诸邪气，呵以去之，大热大开口，小热小开口呵。",
      "translated_text": "Just as the heavens possess springs, without the surging drum of thunder, they could not moisten the myriad things. If one does not expel the turbid and malign qi, it will cause unease. Though there be fluids, without rinsing and swallowing, they cannot irrigate the five viscera, bring forth their radiance, and ultimately return essence to replenish the brain. Without union, they cannot ascend against the current. Ingesting internal qi, without exhalation and inhalation, one cannot guide and employ it.\n\nThus, the Dao of expelling and the principle of circulation are modeled after heaven and earth. Visualize the turbid malign accumulations, pathogenic qi, and stagnant blood within the body being scoured by the correct nourishing qi, all expelled through the tips of the hands and feet—this is called dispersing qi. When qi disperses, extend the fingers; there is no need to clench them tightly. Each such cycle constitutes one passage. When passage is achieved, there is no illness, and one readjusts as if guiding the hand. If guiding the hand becomes difficult, drum and swallow as before.\n\nClosing the qi and drumming to swallow for thirty-six breaths is called \"minor attainment.\" If one has not yet ceased taking grains, one should still eat sparingly at this stage, ensuring the abdomen remains empty and pure. Whether sitting or lying down, whenever the abdomen is empty, swallow the qi. From dawn to dusk, performing this ten times naturally results in three hundred and sixty swallows. If one has long ingested qi and can suddenly manage three hundred and sixty swallows, this too is called \"minor attainment.\" One thousand two hundred swallows is called \"major attainment,\" also known as \"great embryonic breathing.\" Simply closing the qi and counting to one thousand two hundred breaths is likewise \"major attainment.\" Only then will the embryo not congeal, yet one still cannot refine the form and transform the substance. Even if one attains longevity, it will be like a withered tree, devoid of vital luster.\n\nThere are also methods for refining qi, closing qi, yielding qi, and distributing qi, all of which are detailed in the text. Those of like mind should study them carefully.\n\n**Method for Refining Qi**\nThe method states: To refine the form by ingesting qi, enter a chamber when slightly at leisure. Remove clothing, loosen the hair, lie supine, extend the hands without clenching, and comb the hair to ensure it flows freely. Spread it upon the mat, then regulate and swallow the qi. After swallowing, close the qi and wait until it reaches its limit. Then still the mind, sever all thoughts, and allow the qi to flow where it will to unobstruct the principles. If stifled, exhale; if panting, regulate the breath. Once the qi is calm, refine it again. Perform this ten times, then stop.\n\nFor those newly ingesting qi who have not yet achieved passage, gradually increase from one to ten when at leisure. Once passage is achieved, gradually increase to twenty or fifty. This should cause the entire body to perspire—such is the sign of its efficacy. Calm the mind and harmonize the qi, then lie down without rising into the wind. This is the fine art of reversing aging and extending years. However, perform this only when the fluids are clear and fresh; if the qi is dull and one feels drowsy, do not proceed. Practice diligently, and even if the four limbs feel heavy or obstructed, perform this method. It need not be done every morning but should be practiced when one is clear and refreshed, every ten or five days.\n\nThe *Huangting Jing* states: \"A thousand disasters vanish, a hundred illnesses heal; one need not fear the ferocity of tigers and wolves, for it also reverses aging and extends years forever.\"\n\n**Method for Yielding Qi**\nThe method states: The technique of yielding qi harmonizes the body’s qi and spirit, ensuring smoothness and comfort. Whether walking, standing, sitting, or lying down, it can be practiced. Simply regulate the qi according to the gateways, whether stretching out on the bed or sitting erect. Without thought or awareness, sink into profound stillness, making the mind like the vast emptiness. Then regulate and close the qi, whether ten or twenty breaths, allowing passage. The qi must be allowed to flow freely, without contention from intention. After a long while, the qi will exit through the pores of the body, no longer expelled through the mouth. Even if there is some residue, it will be minimal. Further regulation can extend to one thousand two hundred breaths or more, which is even better. Whether walking, standing, sitting, or lying down, it can be practiced. With diligent practice, the hundred passages open, the complexion becomes lustrous, and the qi remains clear and fresh, as if newly bathed. Perform this whenever there is disharmony, and one will naturally attain tranquility.\n\nThe *Huangting Jing* states: \"Sit loftily in non-action, and the hun and po are at peace; the pure and tranquil spirit appears and speaks with me.\"\n\n**Method for Closing Qi**\nThe method states: If, due to improper cultivation, illness suddenly arises, swiftly retire to a secluded chamber and, following the method of ingesting qi, arrange the hands and feet. Then regulate and swallow the qi. Focus on the afflicted area, close the qi, and direct intention to attack it. When the qi reaches its limit, exhale. Then swallow the qi again and continue the attack as before. If the qi becomes labored, stop; once it is regulated, attack again. Perform this twenty to fifty times until the afflicted area sweats and becomes unobstructed, then cease. If the ailment persists, practice this at midnight, the fifth watch, or repeatedly during the day, directing intention to attack. Regardless of whether the illness is in the head, face, hands, or feet, attack the afflicted area—there is no ailment that will not be cured. Thus, the mind’s command over qi surpasses even the hand, as if aided by spirits, its efficacy unmatched.\n\n**Method for Distributing Qi**\nThe method states: When intending to distribute qi to heal another’s illness, first determine the afflicted viscus of the recipient and draw qi from the corresponding direction. Have the patient face that direction, calm the mind, and quiet the thoughts to receive the qi. After distributing the qi, instruct the patient to swallow it. Malevolent spirits will flee, and pathogenic qi will be permanently expelled.\n\n**Method of the Six Qi**\nThe method states: The six qi are *xu*, *he*, *si*, *chui*, *hu*, and *xi*. Each qi corresponds to a viscus, with the remaining one governing the Triple Burner. *Si* pertains to the lungs, which govern the nose. For cold, heat, disharmony, or extreme fatigue, practice *si* exhalation and inhalation, which also treats skin sores and scabies. For such ailments, apply the method accordingly, and healing will be immediate.\n\n*He* pertains to the heart, which governs the tongue. For dry mouth, rough tongue, qi obstruction, or various pathogenic qi, use *he* to expel them. For great heat, open the mouth wide; for slight heat, open it slightly when exhaling *he*.",
      "overlap_context": "descending all at once into the chest, reaching the Middle Cinnabar Field. The Middle Cinnabar Field is the spirit palace of the heart. It irrigates the five viscera, then returns to the Lower Cinnabar Field, passing through the Three Stars, flowing through the thighs, knees, shins, and ankles, and descending to the Bubbling Spring. The Bubbling Spring is the center of the sole. This is what is meant by “governing with a single qi, drumming it like thunder, and moistening it like wind and rain.”",
      "start_char": 1277,
      "end_char": 2545,
      "start_sentence": 56,
      "end_sentence": 111,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.39031720161438,
      "metadata": {
        "source_file": "dao\\藏外\\幻真先生服内元气诀.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "若须作意，是宜理之。 呼属脾，脾主中宫，如微热不和，腹胃胀满，气闷不泄，以呼字炁理之。 吹属肾，肾主耳，腰肚冷，阳道衰，以吹字炁理之。 嘻属三焦，三焦不和，嘻以治之。 气虽各有所治，但五脏三焦，冷热劳极、风邪不调，都属于心，心主呵，呵所治诸疾皆愈，不必六气也。 嘘属肝，肝主目，赤肿昏眩等，皆以嘘治之。 调气液诀 诀曰：人食五味，五味各归一藏，每藏各有浊气。 同出于口。 又六气三焦之气，皆凑此门，众秽并投，合成浊气，每睡觉，熏熏气从口而出，自不堪闻，审而察之，以知其候。 凡口中焦乾，口苦舌涩，乳颊无津，或咽唾喉中痛不能食，是热极状也，即须大张口呵之，每咽必须依门户，出之十呵、二十呵，即鸣天鼓，或七或九，以舌下撩华池而咽津，复咽令热气退，止。 但候口中清水甘泉生，即是热退五脏凉也。 若口中津液冷淡无味，或呵过多，心头汪汪然，食饮无味，不受水，则是冷状也，即当吹以温之，如温热法。 伺候口美心调，温即止。 《黄庭经》云：玉池清水灌灵根，审能修之可长存。 又云：漱咽灵液灾不干。 饮食调护诀 诀曰：服气之后，所食须有次第，可食之物有益，不可食之物必有损，损宜永断，益乃恒服。 每日平旦，食少许淡水粥，或胡麻粥，甚益人，治脾气，令人足津液。 日中淡面馎饦及饼并佳，只不得承热食之，勃乱正气也。 煮葱薤羹可佳，饭必粳米，大麦面益人。 服气之人经四时，甚宜服食之。 此等物不必日日食之，任随临时之意欲食之。 鹿肉作白脯，食之佳，如是斋戒，即不得食也。 三十六禽神直日，其象鸟并不可食。 枣、栗之徒兼饣追饼，亦得食也。 作可喂慎勿饱，饱则伤心，气尤难行。 凡热面、萝卜羹，切忌切忌。 咸酸辛物，宜渐渐节之。 每食毕，即须呵出口中食毒浊气，永无患矣。 服气之人，肠胃虚净，生冷、醋滑、粘腻、陈硬、腐败、难消之物，不用食。 若偶然食此等之物一口，所在处必当微痛，慎之。 但食软物，乃合宜也。 每食先三五咽气，而吃食令作主，兼吞三五粒生椒佳也。 食毕，更吞三粒下走引气。 此物能消食，引气向下，通三焦，利五脏，趁浊秽，消宿食，助正气也。 宜长久服之，能辟寒冱暑湿，明目生发，治气功力，不可具述，备在《太清经》中，服椒别有方。 服候有气下，则泄之，慎而勿留，留则恐为疾。 每空腹随性饮一两杯清酒，甚佳。 冬温夏冷，助正气排遣诸邪，其功不细。 戒在多，多则愍醉，醉则伤神损寿。 若遇尊贵，不获已，即宜饮，放即三五口，饮并即大开口十数下，以遣出面蘖之毒，调治之。 常时饮一二升，徐徐饮之，亦不中酒，兼不失食，味亦不退，乃如故矣。 不用冲生产、死亡并六畜，一切秽恶不洁之气，并不宜及门，况近之耶？ 甚不宜正气。 如不意卒逢以前诸秽恶，速闭气，上风闭目速过，便求一两杯酒以荡涤之。 觉气入腹不安，即须调气，过出浊气，即却咽下，更纳新气，以意送之，当以手摩之，则便含椒及饮一两杯酒，令散矣。 如不肯散，即不须过理逼，任出无苦。 此则上焦拥，故终须调气理之，使和平也。 而食油腻辛味，甚犯正气，切意省之。 尚知向犯者，使勿忤也。",
      "translated_text": "If intentional practice is required, it is fitting to regulate accordingly.\n\n*Hu* pertains to the spleen, which governs the central palace. For mild heat, disharmony, abdominal and stomach distension, or qi stagnation without release, use the *hu* qi to regulate it.\n\n*Chui* pertains to the kidneys, which govern the ears. For cold in the waist and abdomen or decline of yang vitality, use the *chui* qi to regulate it.\n\n*Xi* pertains to the Triple Burner. For disharmony of the Triple Burner, use *xi* to treat it.\n\nThough each qi has its specific treatment, for cold, heat, extreme fatigue, or wind-pathogen disharmony affecting the five viscera and Triple Burner, all are governed by the heart. The heart is mastered by *he*, and using *he* alone can cure all such ailments—there is no need for the six qi.\n\n*Xu* pertains to the liver, which governs the eyes. For redness, swelling, dimness, or dizziness, use *xu* to treat them.\n\n**Method for Regulating Qi and Fluids**\nThe method states: Humans consume the five flavors, each of which returns to one viscus, and each viscus has its turbid qi. All emerge through the mouth. Furthermore, the six qi and the qi of the Triple Burner converge at this gate, where various impurities gather to form turbid qi. Upon waking from sleep, a foul vapor issues from the mouth, unbearable to smell. Examine and observe this to discern its signs.\n\nWhenever the mouth is parched, bitter, or the tongue rough, the cheeks lack moisture, or swallowing causes throat pain making eating difficult, these are signs of extreme heat. Immediately open the mouth wide and exhale *he*, ensuring each swallow follows the proper gate. Exhale ten or twenty times, then strike the Heavenly Drum seven or nine times. Stir the Flower Pool beneath the tongue and swallow the fluid, repeating until the heat retreats. Cease when the mouth produces clear, sweet water—this indicates the heat has receded and the five viscera are cool.\n\nIf the mouth’s fluids are cold and tasteless, or after excessive *he* exhalation the heart feels unsettled, food and drink lose their flavor, and water is not tolerated, these are signs of cold. Use *chui* to warm it, following the method for warming heat. Wait until the mouth tastes pleasant and the heart is harmonious, then cease.\n\nThe *Yellow Court Classic* states:\n*\"The Jade Pool’s clear water irrigates the numinous root;*\n*Diligently cultivate this, and you may long endure.\"*\nIt also says:\n*\"Rinsing and swallowing the numinous fluid keeps calamity at bay.\"*\n\n**Method for Dietary Regulation and Protection**\nThe method states: After practicing qi absorption, food must follow a proper sequence. Beneficial foods should be consumed regularly, while harmful ones must be permanently avoided.\n\nEach morning, consume a small portion of bland rice porridge or sesame porridge, which greatly benefits the person, regulates spleen qi, and replenishes fluids. At midday, plain noodles, *botuo*, or cakes are excellent, but avoid eating them while hot, as this disrupts the upright qi. Onion and scallion soup is also good. Rice should be polished, and barley flour is beneficial. Throughout the four seasons, these foods are highly suitable for those practicing qi absorption. They need not be eaten daily but may be consumed as desired.\n\nDeer meat prepared as dried jerky is excellent, but during fasting or abstinence, it must not be eaten. On the thirty-six days when the spirits of the birds and beasts are active, their corresponding meats must not be consumed. Dates, chestnuts, and steamed cakes may also be eaten. Eat moderately—never to fullness, as overindulgence harms the heart and hinders qi circulation.\n\nHot noodles and radish soup are strictly forbidden. Salty, sour, and pungent foods should be gradually reduced. After each meal, exhale the turbid qi of food toxins from the mouth to prevent illness.\n\nFor those practicing qi absorption, the intestines and stomach are empty and pure. Raw, cold, vinegary, slippery, sticky, stale, hard, rotten, or indigestible foods must not be eaten. If even a single mouthful of such foods is consumed, mild pain will arise in the affected area—beware.\n\nSoft foods are most suitable. Before eating, swallow qi three to five times to take control, and also consume three to five grains of raw Sichuan pepper. After eating, swallow three more grains to guide the qi downward. This substance aids digestion, directs qi downward, unblocks the Triple Burner, benefits the five viscera, expels turbidity, digests stagnant food, and assists the upright qi. It is suitable for long-term consumption, as it repels cold, summerheat, and dampness, brightens the eyes, promotes hair growth, and enhances qi cultivation—its benefits are too numerous to list in full. Detailed methods for consuming Sichuan pepper are found in the *Taiqing Jing*.\n\nIf qi descends and causes bowel movements, release it—do not retain it, lest it cause illness. On an empty stomach, drink one or two cups of clear wine as desired, which is excellent. Warm in winter and cool in summer, it assists the upright qi and dispels pathogens—its benefits are not insignificant. However, moderation is key: excess leads to intoxication, which harms the spirit and shortens life. If compelled by social obligations, drink sparingly—just three to five sips—and afterward, open the mouth wide ten times to expel the toxins of fermentation. Regulate accordingly.\n\nOrdinarily, one or two cups may be sipped slowly, avoiding drunkenness while maintaining appetite and taste. However, avoid all impure and foul qi from childbirth, death, livestock, or other unclean sources—do not even approach them, let alone enter their vicinity, as they severely disrupt the upright qi.\n\nIf unexpectedly encountering such impurities, swiftly hold the breath, close the eyes, and pass by upwind. Then seek one or two cups of wine to cleanse the system. If the qi entering the abdomen feels unsettled, regulate the breath to expel the turbid qi, then swallow and draw in fresh qi, directing it with the mind. Massage the area with the hands, then chew Sichuan pepper and drink one or two cups of wine to disperse the impurity. If it does not disperse, do not force it—let it exit naturally. This indicates congestion in the upper burner, so qi regulation is essential to restore harmony.\n\nOily, greasy, and pungent foods severely offend the upright qi—be mindful and avoid them. Even if one has previously consumed them, ensure they do not recur.",
      "overlap_context": "i* pertains to the lungs, which govern the nose. For cold, heat, disharmony, or extreme fatigue, practice *si* exhalation and inhalation, which also treats skin sores and scabies. For such ailments, apply the method accordingly, and healing will be immediate.\n\n*He* pertains to the heart, which governs the tongue. For dry mouth, rough tongue, qi obstruction, or various pathogenic qi, use *he* to expel them. For great heat, open the mouth wide; for slight heat, open it slightly when exhaling *he*.",
      "start_char": 2545,
      "end_char": 3793,
      "start_sentence": 112,
      "end_sentence": 162,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.931365489959717,
      "metadata": {
        "source_file": "dao\\藏外\\幻真先生服内元气诀.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "亦有服气一年通气，二年通气实，三年功成，元气凝实，纵有触犯，无能为患。 日服千咽，不足为多，返老还童，渐从此矣。 气化为津，津化为血，血化为精，精化为髓，髓化为。 一年易气，二年易血，三年易脉，四年易肉，五年易髓，六年易，七年易骨，八年易发，九年易形，即三万六千真神，皆在身中化为仙童，号曰真人矣。 勤修不倦怠，则关节相连，五脏牢固。 《黄庭经》云：千千百百自相连，一一十十似重山。 是内气不出，外气不入，寒暑不侵，刀兵不害，升腾变化，素同三光也。 休粮诀 诀曰：凡欲休粮，但依前勤修，三年之后，正气流通，髓实骨满，百神守位，三尸遁逃。 如此渐不欲闻五味之气，常思不食，欲绝则绝，不为难也。 但觉腹空，即须咽气，无问早晚，何论限约，久久自知节候，无烦其言，何用药物！ 大抵服药之人，多不能服气，终日区区，但以药物为务，身形不得精实，固为未得亦非上士用心也。 《黄庭经》云：百谷之实土地精，五味外美邪魔腥，臭乱神明胎气零，那从返老却还婴，何不食气太和精，故能不死入黄宁。 此之谓也。 慎守诀",
      "translated_text": "Those who practice qi absorption for one year will achieve free circulation of qi; for two years, the qi will become substantial; and by three years, the practice will be complete, with primordial qi condensed and solidified. Even if one encounters impurities, they will be unable to cause harm. Daily swallowing a thousand breaths is not considered excessive—from this, one gradually reverses aging and returns to youth.\n\nQi transforms into fluids, fluids into blood, blood into essence, essence into marrow, and marrow into *yú*. In one year, the qi is renewed; in two years, the blood; in three years, the vessels; in four years, the flesh; in five years, the marrow; in six years, the *yú*; in seven years, the bones; in eight years, the hair; and in nine years, the form. Then the thirty-six thousand true spirits within the body transform into immortal youths, and one is called a *zhenren*.\n\nWith diligent practice and no slackening, the joints become interconnected, and the five viscera grow firm. As the *Huangting Jing* states: *\"A thousand thousand, a hundred hundred, linked as one; ten by ten, layered like mountains.\"* Thus, internal qi does not escape, external qi does not enter, cold and heat cannot invade, blades and weapons cannot harm, and one ascends and transforms, equal to the Three Luminaries.\n\n**Method of Abandoning Grain**\nThe method states: To abandon grain, simply persist in diligent practice as before. After three years, the upright qi will flow freely, marrow will fill the bones, the hundred spirits will guard their positions, and the Three Corpses will flee. Gradually, one will no longer desire the scent of the five flavors, constantly longing to abstain from food. When the desire to cease arises, cessation comes effortlessly.\n\nWhenever the abdomen feels empty, one must swallow qi—regardless of morning or night, without fixed limits. Over time, one naturally understands the rhythm, and no further instruction is needed. What use are medicinal substances?\n\nGenerally, those who rely on medicines often cannot practice qi absorption. They toil daily, devoted solely to medicinal substances, yet their bodies never achieve refinement and solidity. This is not the path of the superior practitioner. As the *Huangting Jing* says: *\"The grains’ essence is the earth’s vitality; the five flavors’ external allure is foul and corrupting. It disturbs the spirit and scatters the fetal qi—how can one reverse aging and return to infancy? Why not consume the qi of Great Harmony? Thus one does not die and enters the Yellow Tranquility.\"* This is the meaning.\n\n**Admonitions on Guarding the Method**",
      "overlap_context": "then swallow and draw in fresh qi, directing it with the mind. Massage the area with the hands, then chew Sichuan pepper and drink one or two cups of wine to disperse the impurity. If it does not disperse, do not force it—let it exit naturally. This indicates congestion in the upper burner, so qi regulation is essential to restore harmony.\n\nOily, greasy, and pungent foods severely offend the upright qi—be mindful and avoid them. Even if one has previously consumed them, ensure they do not recur.",
      "start_char": 3793,
      "end_char": 4243,
      "start_sentence": 163,
      "end_sentence": 177,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.909373044967651,
      "metadata": {
        "source_file": "dao\\藏外\\幻真先生服内元气诀.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "诀曰：世上之人，多嗜欲伤生伐命，今古共焉。 不早自防，追悔何及！ 夫人临终方始惜其身命，罪定而后思求善事，病成方求其药，天纲已发，何可救之？ 故贤哲上士，惜未绝之命，防未祸之祸，理未病之病，遂拂衣人寰，摄心归道。 道者，气也； 气者，心之主； 精，者命之根。 爱精重气，然后身心保之矣。 《黄庭经》云：方寸之中，谨盖藏，精神还老复丁壮，养子玉树令如杖，急固子精以自偿。 又曰：长生至慎房中急，何谓死作令神泣？ 若当诀海百渎倾，叶去树枯失青青。 夫长生久视，未有不由爱精保气能致之。 阴丹内御之道，世莫得知，虽务于气，而不解绝情欲，亦未免殃矣。 故曰：人自失道，非道失人； 人常去生，非生去人。 修养君子，自保省尔。 服气胎息诀 诀曰：精者，气也； 气者，道也。 先叩齿三十六通，右转头一匝，如龟引颈，其胎息上至咽喉，即咽之。 如此三遍，方闭口以舌内外摩料，取津满口漱流，昂头咽之，上补泥丸，泥丸即昂头是也。 下润五脏。 老子曰：甘雨润万物，胎津润五脏。 昼夜不寐，乃成真人，上致神仙，下益寿考。 在身所有疾苦，想气送至所苦处，即愈。 真气逐浊气，上冲下泄，觉神清爽，则气自冲和。 故圣人有言：夫人在气中，气在人中，人不离气，气不离人，人藉气而生，因失气而死，死生之理，尽在气也。 但调得其气，求死不得。 则每夜半及五更，展两脚，握固，展手去身五寸，其枕不得过二寸，闭目，依前法咽之。 梳洗讫，以暖一杯酒饮之，益胎息，润六府，引气开百关。 昔峨眉山仙人幽秘法，此不可言也。 老君曰：灵芝玉英，并在其腹，名山大泽，取药服之，与道甚乖。 吾道甚易，但能行之。 早起展两脚，喘息匀，以两手叉脑后，手前拽，头向后拽顿，如此三，毕； 两手相叉向前拽，前拽三两遍，左右掣三二十遍。 毕，咽津二十遍。 如觉四体不和，即乃舌漱液三二十咽，流却疾去。 万金不传非其人，造次传者，殃及三代也。",
      "translated_text": "The Method states: Most people in the world indulge in desires that harm life and cut short destiny—this has been true across all ages. If one does not take early precautions, how can regret avail anything? When a person nears death, only then do they cherish their body and life; when guilt is already determined, only then do they think of seeking good deeds; when illness has already taken hold, only then do they seek medicine. Yet by then, the celestial net has been cast—how can it be saved?\n\nThus, the wise and sagacious superior practitioners cherish life before its thread is severed, guard against misfortune before it arises, and remedy illness before it takes root. They then cast off worldly robes, gather their minds, and return to the Dao. The Dao is qi; qi is the master of the heart; essence is the root of life. Only by treasuring essence and valuing qi can one preserve both body and mind.\n\nThe *Huangting Jing* says:\n*\"Within the square inch of the heart, guard and conceal well.\nSpirit and essence return to youth and regain vigor;\nNurture the jade-tree child to stand firm as a staff.\nHasten to secure your essence to repay yourself.\"*\n\nIt also says:\n*\"For long life, be most cautious in the chamber—\nWhy wait until death to make the spirits weep?\nIf you leak the secret like rivers pouring into the sea,\nLeaves fall, the tree withers, and all verdure is lost.\"*\n\nIndeed, none who attain long life and enduring vision do so without treasuring essence and preserving qi. The Way of Inner Alchemy and the governance of the inner elixir remain unknown to the world. Even those who devote themselves to qi but do not sever desires will not escape calamity.\n\nThus it is said: People lose the Dao—the Dao does not lose people; people constantly depart from life—life does not depart from people. Cultivating gentlemen must preserve and reflect upon this themselves.\n\n**Method of Qi Absorption and Fetal Breathing**\nThe Method states: Essence is qi; qi is the Dao. First, knock the teeth together thirty-six times, then turn the head to the right in a full circle, like a turtle stretching its neck. When the fetal breath rises to the throat, swallow it. Do this three times, then close the mouth and rub the tongue inside and out to gather saliva. Rinse the mouth until full, then tilt the head back and swallow, sending it upward to nourish the Mud Pill Palace (the top of the head). This moistens the five viscera.\n\nLaozi said: *\"Sweet rain nourishes the myriad things; fetal saliva moistens the five viscera.\"* By day and night, without sleep, one becomes a perfected person, ascending to attain immortality and descending to prolong life. For any illness or suffering in the body, visualize sending qi to the afflicted area, and it will be cured. True qi expels turbid qi, surging upward and purging downward. When the spirit feels clear and refreshed, the qi naturally harmonizes.\n\nThus the sages have said: *\"Man exists within qi, and qi exists within man. Man does not depart from qi, nor qi from man. Man relies on qi to live and dies when qi is lost. The principle of life and death lies entirely in qi.\"* If one can properly regulate qi, even death cannot be sought.\n\nEach night at midnight and the fifth watch, stretch out both legs, make fists, and extend the hands five inches from the body. The pillow should not exceed two inches in height. Close the eyes and swallow as before. After washing and combing, drink a cup of warm wine to benefit fetal breathing, moisten the six bowels, and guide qi to open the hundred passages.\n\nThe esoteric method of the immortals of Mount Emei cannot be spoken of lightly. Laozi said: *\"Lingzhi and jade blossoms reside within the belly. Seeking medicines in famous mountains and great marshes strays far from the Dao. My Way is exceedingly simple—only practice it.\"*\n\nUpon rising early, stretch out both legs, regulate the breath, clasp the hands behind the head, and pull forward while the head pulls back, repeating this three times. Then interlock the hands and pull forward three to five times, followed by left and right stretches thirty to fifty times. Afterward, swallow saliva twenty times. If the four limbs feel unbalanced, rinse the mouth with saliva twenty to thirty times and swallow to dispel illness.\n\nThis method is worth ten thousand gold pieces and must not be transmitted to the unworthy. Those who rashly pass it on bring calamity upon three generations.",
      "overlap_context": "yet their bodies never achieve refinement and solidity. This is not the path of the superior practitioner. As the *Huangting Jing* says: *\"The grains’ essence is the earth’s vitality; the five flavors’ external allure is foul and corrupting. It disturbs the spirit and scatters the fetal qi—how can one reverse aging and return to infancy? Why not consume the qi of Great Harmony? Thus one does not die and enters the Yellow Tranquility.\"* This is the meaning.\n\n**Admonitions on Guarding the Method**",
      "start_char": 4243,
      "end_char": 5011,
      "start_sentence": 178,
      "end_sentence": 215,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.182032346725464,
      "metadata": {
        "source_file": "dao\\藏外\\幻真先生服内元气诀.txt",
        "category": "藏外"
      }
    }
  ]
}