{
  "source_id": "庄子内篇订正",
  "source_file": "chunked_daozang\\庄子内篇订正.json",
  "total_chunks": 37,
  "total_original_chars": 19195,
  "total_translated_chars": 96652,
  "total_translation_time": 505.43189430236816,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\玉诀类\\庄子内篇订正.txt",
    "category": "玉诀类"
  },
  "full_translation": "**Corrected Inner Chapters of the *Zhuangzi***\n*Title:* Corrected Inner Chapters of the *Zhuangzi*\n*Author:* Wu Cheng of the Yuan dynasty\n*Two fascicles*\n*Source text:* *Daoist Canon of the Zhengtong Era*, Cavern Spirit Division, Jade Instructions Category\n\n**Corrected Inner Chapters of the *Zhuangzi*, Fascicle One**\n*Composed by Wu Cheng of Linchuan*\n\n**Free and Easy Wandering**\n\nIn the northern darkness there is a fish, and its name is *Kun*.\nThe greatness of *Kun*—who knows how many thousand *li* it spans?\nIt transforms into a bird, and its name is *Peng*.\nThe back of *Peng*—who knows how many thousand *li* it spans?\nWhen it rises in fury and takes flight, its wings are like clouds hanging from the sky.\nThis bird, when the seas shift, will journey to the southern darkness.\nThe southern darkness is the Celestial Pond.\n\nThe *Qi Xie* is a record of marvels.\nIts words say: When *Peng* journeys to the southern darkness,\nit strikes the water for three thousand *li*,\nbeats against the whirlwind to ascend ninety thousand *li*,\nand departs on the six-month breath.\n\nThe wild horses, the dust motes—all living things blow upon one another with their breaths.\nIs the deep blue of heaven its true color?\nOr is it so distant that it has no limit?\nWhen *Peng* looks down, it is just like this.\n\nMoreover, when water does not accumulate in great depth, it lacks the strength to bear a great vessel. Pour a cup of water into a hollow in the hall, and a mustard seed becomes a boat for it; place the cup there, and it sticks fast, for the water is shallow and the vessel large. When wind does not accumulate in great depth, it lacks the strength to bear great wings. Thus, only when the wind lies beneath at ninety thousand *li* can it then be borne aloft. Only when one rides the back of the azure sky without obstruction can one then set one’s course for the south.\n\nThe cicada and the fledgling dove laugh at it, saying: “We burst forth and fly, darting between the elm and the sandalwood; sometimes we do not reach them and simply land on the ground. Why go ninety thousand *li* to the south?” One who travels to the nearby wilderness returns after a day’s provisions, with a belly still full. One who journeys a hundred *li* must grind grain the night before. One who travels a thousand *li* must gather three months’ provisions. What do these two creatures know?\n\nSmall knowledge does not reach great knowledge; short years do not reach long years. How do we know this is so? The morning mushroom knows not the alternation of dusk and dawn; the summer cicada knows not spring and autumn—these are short-lived things. South of the land of Chu there is the *Mingling* tree, for which five hundred years make a spring, and five hundred years an autumn. In high antiquity there was the *Dazhuang* tree, for which eight thousand years made a spring, and eight thousand years an autumn. Yet Pengzu alone is renowned for his longevity—how sad that the multitude compares itself to him!\n\nTang’s inquiry of Ji is thus: In the farthest northern reaches, beyond the lands of sparse vegetation, there is a dark sea—the Celestial Pond. There is a fish there, several thousand *li* in breadth, though none know its length; its name is *Kun*. There is a bird there, its name *Peng*, its back like Mount Tai, its wings like clouds hanging from the sky. It beats against the whirlwind, ascending ninety thousand *li*, piercing the clouds and qi, bearing the azure sky, then setting its course for the south, bound for the southern darkness.\n\nThe minnow scoffs: “Where is it going? I leap and soar, rising no more than a few *ren* before descending, wheeling among the mugwort and wormwood—this is the utmost of flight! Where is it going?” This is the distinction between great and small.\n\nThus, those whose knowledge suffices for one office, whose conduct matches one village, whose virtue pleases one lord, or whose merit wins one state—when they regard themselves, it is just like this. Yet Song Rongzi would still laugh at them. Moreover, though the whole world should praise him, he would not be encouraged; though the whole world should condemn him, he would not be disheartened. He has settled the division between inner and outer, discerned the boundary between honor and disgrace—this is all. In his relation to the world, he is not hasty.\n\nThough this may be so, there remains that which has not yet been established. Liezi could ride the wind and travel, moving with chilling grace, yet after fifteen days he would return. In his pursuit of fortune, he was not hasty. Though he thus avoided walking, he still depended on something. As for one who rides the constancy of Heaven and Earth, who harnesses the transformations of the six qi, and roams the boundless—what does he depend upon? Therefore it is said: the Perfect One is without self, the Spirit Man is without achievement, the Sage is without fame.\n\n**Chapter One**\nWhen Yao offered the world to Xu You, he said: “The sun and moon have risen, yet the torch still burns—is it not difficult for its light to compare? The timely rain has fallen, yet still you irrigate—is it not laborious for its moisture to suffice? You stand and the world is ordered, yet I remain in your place—how lacking I feel in myself. I beg to yield the world to you.”\nXu You replied: “You govern the world, and the world is already well-governed. Yet I would still take your place—would I do so for fame? Fame is but the guest of reality. Would I become a guest?”\n\nThe wren nests in the deep forest, yet needs no more than a single branch; the mole drinks from the river, yet takes no more than its fill. Return and rest, my lord. What use have I for the world? Though the cook neglects his kitchen, the priest would not step beyond the altar to take his place.\n\n**Chapter Two**\nJian Wu asked Lian Shu: “I heard words from Jie Yu—grand yet without measure, sweeping yet never returning. I was startled and terrified by his speech, as if the Milky Way stretched endlessly, vast and distant, far from human sensibilities.”\nLian Shu said: “What did he say?”\nJian Wu replied: “On the distant Mount Guye dwells a spirit-man. His skin is like ice and snow, his bearing as graceful as a maiden. He eats no grain, but drinks the wind and sips the dew. He rides the clouds and qi, harnesses flying dragons, and roams beyond the four seas. His spirit is so concentrated that it keeps things free from blight, and the harvests ripen. Yet I find this wild and hard to believe.”\nLian Shu said: “Indeed. The blind cannot partake in the splendor of patterns, nor the deaf in the sound of bells and drums. Is it only the body that may be deaf and blind? The mind, too, may suffer such afflictions. His words are like yours in this moment. That man, that power—he would unify the myriad things into one. The world clamors for order, but who would exhaust himself taking the world as his task? That man—nothing harms him. Though the great floods rise to the heavens, he does not drown; though drought melts metal and stone and scorches the mountains, he does not burn. From his dust and chaff, one could mold even a Yao or Shun—who would trouble himself with worldly affairs? The people of Song carried ceremonial caps to Yue, but the Yue, with shorn hair and tattooed bodies, had no use for them. Yao governed the people of the world and brought peace to the realm, yet when he went to see the Four Masters on Mount Guye north of the Fen River, he returned empty, having lost his grasp on the world.”\n\n**Chapter Three**\nHui Shi said to Zhuangzi: “The King of Wei gave me seeds of a great gourd. I planted them, and they grew to hold five *dan*. When I used it to hold water, its strength was not enough to lift itself. When I split it to make a ladle, its size was so vast it had no place to fit. Was it not hollow and large? Yet I deemed it useless and smashed it.”\nZhuangzi said: “You are truly inept at putting great things to use. There was a man of Song skilled in making a salve that prevented chapped hands. For generations, his family made their living by washing silk. A traveler heard of it and offered a hundred gold pieces for the formula. The family gathered and deliberated: ‘For generations, we have washed silk and earned no more than a few coins. Now, in a single morning, we could sell this skill for a hundred gold pieces—let us give it to him.’ The traveler obtained it and presented it to the King of Wu. When Yue raised a rebellion, the King of Wu sent him to lead the troops. In winter, they fought on the water, and he utterly defeated Yue, winning lands and a fief. The same salve that prevented chapped hands—one man used it to gain a fief, while another remained washing silk. The difference lay in how it was used. Now, with your five-*dan* gourd, why not consider making it into a great float and drifting upon the rivers and lakes? Instead, you fret that it is too large to hold anything—your mind is still as tangled as mugwort.”\n\n**Chapter Four**\nHui Shi said to Zhuangzi: “I have a great tree, called a *rong*. Its trunk is gnarled and swollen, unfit for the carpenter’s line; its branches are twisted and bent, unfit for the compass and square. It stands by the road, yet no craftsman glances at it. Now, your words are grand but useless—just as the crowd rejects them.”\nZhuangzi said: “Have you never seen a wildcat or weasel? It crouches low to lie in wait, then leaps east and west, heedless of high or low, only to be caught in a trap or snare. Now consider the yak—its size is like a cloud hanging from the sky. It is great indeed, yet it cannot catch a mouse. You have a great tree and worry it is useless—why not plant it in the land of Nothingness, the vast wilds, where you may wander carefree at its side, or lie at ease beneath its shade? No axe will fell it, and nothing will harm it. If it has no use, how can it come to grief?”\n\nNan Guo Ziqi leaned against his armrest and sat, gazing upward to exhale, his breath coming in gasps as though he had lost his counterpart. Yan Cheng Ziyou stood in attendance before him and asked: “What is this? Can the body truly be made like withered wood, and the heart like dead ashes? Yet the one who now leans on the armrest is not the same as the one who did so before.”\n\nZiqi said: “Yan, is it not well that you ask this? Today I have lost myself—do you understand? You have heard the *lai* of man but not the *lai* of earth; you have heard the *lai* of earth but not the *lai* of heaven.”\n\nZiyou said: “I venture to ask the method.”\n\nZiqi said: “The great clod breathes forth *qi*, and its name is wind. It does nothing, yet when it stirs, the myriad hollows roar in fury. Have you alone not heard its ceaseless murmur? The towering peaks of mountains and forests, the hollows of great trees a hundred spans around—some resemble noses, some mouths, some ears, some beams, some rings, some mortars, some pools, some puddles. Some rush forth, some wail, some scold, some inhale, some shriek, some howl, some moan, some bite. The first sings *yu*, and the followers sing *yu*. A gentle breeze elicits a faint harmony; a whirlwind, a great harmony. When the fierce gale subsides, all the hollows fall silent. Have you alone not seen their trembling and quivering?”\n\nZiyou said: “The *lai* of earth is simply the harmony of the myriad hollows; the *lai* of man is the harmony of bamboo pipes. I venture to ask about the *lai* of heaven.”\n\nZiqi said: “The wind blows in ten thousand different ways, yet each finds its own nature. All take of themselves—who then stirs them to anger?”\n\n---\n\nGreat knowledge is broad and unhurried; petty knowledge is narrow and restless. Grand words blaze forth; petty words chatter on. In sleep, their spirits intertwine; awake, their forms stir. They engage in constant strife, battling daily with their hearts. Some are slow, some cunning, some secretive. Small fears leave them trembling; great fears leave them dazed. Their words fly forth like arrows from a crossbow, ever ready to judge right and wrong. They cling like those bound by oaths, ever guarding their victories. They wither like autumn and winter, their days dwindling away. They drown in their own doings, never to return. They grow weary like a sealed vessel, aging and stagnant. The heart near death cannot be revived. Joy and anger, sorrow and delight, care and lament, fickleness and ease, exuberance and languor—like music from the void, like mushrooms born of steam. Day and night they replace one another before us, yet none know whence they sprout. Enough, enough! Morning and evening, this is how they come to be. Without that, there is no self; without the self, nothing is grasped. This is near indeed, yet we know not what moves it. As if there were a true master, yet no trace of it can be found. It acts and is trusted, yet its form is unseen. It has reality but no form.”\n\n---\n\n**Right, Chapter One**\n\nThe hundred bones, nine orifices, and six viscera—all are complete within me, yet with whom should I feel closest? Do you delight in all of them equally? Or do some hold a private claim? Are they all like servants and concubines? If so, are these servants and concubines incapable of governing one another? Do they take turns as lord and subject? Or is there a true lord residing within? Whether one seeks to know its nature or not, does it diminish or harm the truth?\n\nOnce receiving this completed form, it does not perish until its end. It grinds and wears against things, its course racing like a galloping steed, yet nothing can halt it—is this not sorrowful? A lifetime of toil without seeing success, wearily laboring without knowing where it leads—can this not be pitied? People call it \"not dying,\" but what does it avail? The body transforms, the heart follows suit—can this not be called great sorrow?\n\nIs human life inherently so deluded? Am I alone in my confusion, or are there others who are not? If one follows the sincerity of the heart and takes it as teacher, who is without a teacher? Why must one possess knowledge of succession to have a heart that chooses for itself? Even fools share in this. To form judgments before the heart is fully formed—this is like setting out for Yue today and arriving yesterday. Thus, to assert that something *is* is to assert that something *is not*. To insist that something *is not* is still to assert that something *is*. Even if one were as spiritually attuned as Yu the Great, one could not know—what then can I do?\n\nWords are not like the wind’s breath. Speakers have their say, yet what they speak remains unsettled. Is there truly speech? Or has there never been speech? Do words differ from the chirping of fledglings, or is there a distinction? Or is there no distinction?\n\nWhere does the Dao conceal itself to produce truth and falsehood? Where do words conceal themselves to produce right and wrong? Where does the Dao go that it ceases to exist? Where do words remain that they become untenable? The Dao is obscured by partial attainment; words are obscured by florid ornament. Thus arise the Confucians and Mohists, each affirming what the other denies and denying what the other affirms. To affirm what they deny and deny what they affirm, nothing surpasses clarity.\n\nThings are not inherently \"that,\" nor are they inherently \"this.\" From \"that,\" one does not see; from self-knowledge, one knows. Thus it is said: \"That\" emerges from \"this,\" and \"this\" likewise depends on \"that.\" This is the theory of the mutual arising of \"that\" and \"this.\" Yet even as \"this\" arises, \"that\" dies; as \"that\" dies, \"this\" arises. Even as \"this\" is affirmed, \"that\" is denied; as \"that\" is denied, \"this\" is affirmed. Therefore, the sage does not proceed by such distinctions but illuminates all by the light of Heaven—this too is a reliance on \"this.\"\n\n\"This\" is also \"that,\" and \"that\" is also \"this.\" \"That\" has its own right and wrong, and \"this\" has its own right and wrong. Is there truly a distinction between \"that\" and \"this\"? Or is there no distinction?\n\nDoes \"that\" and \"this\" truly exist? Or do they truly not exist? Where \"that\" and \"this\" find no counterpart, there lies the pivot of the Dao. Once the pivot finds the center of the ring, it responds to the boundless. \"This\" too is boundless, and \"not-this\" too is boundless. Thus it is said: nothing surpasses clarity.\n\nTo illustrate the non-finger-ness of a finger by means of a finger is not as good as illustrating the non-finger-ness of a finger by means of a non-finger. To illustrate the non-horse-ness of a horse by means of a horse is not as good as illustrating the non-horse-ness of a horse by means of a non-horse. Heaven and earth are one finger; the myriad things are one horse.\n\nWhat can be affirmed, affirm; what cannot be affirmed, enter into it—yet this is to invite collapse and ruin, disintegration and downfall. When the heart emerges in harmony, it becomes sound and name, omen and calamity. If he becomes an infant, join him in infancy; if he becomes boundless as a field, join him in boundlessness; if he becomes without limit, join him in limitlessness. Penetrate this, and enter into flawlessness.\n\nDo you not know the mantis? Enraged, it thrusts its arms to block the chariot wheel, unaware of its incapacity—such is the beauty of its talent. Beware, be cautious. To accumulate praise and beauty and then offend is perilous indeed.\n\nDo you not know those who raise tigers? They dare not feed them living creatures, for fear of provoking their killing rage; they dare not feed them whole creatures, for fear of provoking their tearing rage. They time their hunger and satiety, understanding the heart of their anger. Though tigers and humans are of different kinds, tigers fawn upon those who feed them—this is compliance. Thus, those they kill act in opposition.\n\nThose who love horses use baskets to collect their dung and clamshells to collect their urine. Yet when flies and gnats alight upon them and they are struck untimely, the horse may bite through the bit, break its bridle, and smash its head and chest. Though the intention is care, the love brings loss—can one not be cautious?\n\n---\n\nIn the third chapter, when Carpenter Shi reached Qi and arrived at Qu Yuan, he saw a community shrine tree. Its girth could shade an ox, its trunk measured a hundred spans, and its height towered above the mountain by ten *ren* before branches appeared. A dozen or so of its side growths could be made into boats. Spectators gathered like a marketplace. The master carpenter did not glance at it but continued on his way without pause.\n\nThe disciple, eager to examine it, ran to catch up with Carpenter Shi and said: \"Since I took up the axe and followed you, Master, I have never seen timber so magnificent as this. Yet you would not deign to look at it and walked on without pause—why?\"\n\nCarpenter Shi replied: \"Enough! Say no more. It is but a worthless tree. If made into a boat, it would sink; if made into a coffin or outer casket, it would rot swiftly; if made into vessels, they would break quickly; if used for doors or gates, it would ooze sap; if used for pillars, it would be eaten by worms. It is a tree of no use whatsoever, and thus it has attained such longevity.\"\n\nUpon returning home, Carpenter Shi dreamed that the tree of the community shrine appeared to him and said: \"To what would you compare me? Would you liken me to the so-called 'fine timber'? Consider the hawthorn, pear, orange, pomelo, and other fruit-bearing trees: when their fruits ripen, they are stripped and humiliated. Their great branches break, their small branches are torn—this is because their abilities bring suffering to their lives. Thus they do not fulfill their natural span but perish midway, self-destructing through their collision with the common world. All things are like this. As for me, I have sought to be of no use for a long time. Nearly dead, I have at last attained it—this is my great usefulness. Had I been of use, would I have grown so vast? Moreover, you and I are both things—how could you judge me thus? And you, a nearly dead worthless man, what could you know of a worthless tree?\"\n\nCarpenter Shi awoke and pondered his dream. His disciple then said:\n\n\"To seek usefulness through uselessness—then why serve as the sacred tree?\"\n\n\"Hush. Say no more. It merely lodges there, enduring the scorn of those who know it not. Were it not the sacred tree, would it have grown so vast? Moreover, what it preserves differs from the common—yet you compare it by human standards. Is this not far off?\"\n\n**Chapter Four**\n\nNanbo Zicai wandered in Shangqiu and saw a great tree unlike any other. A thousand chariots could shelter beneath it, its canopy shading all within its rustling leaves.\n\nZiqi said: \"What tree is this? It must possess extraordinary qualities.\"\n\nLooking up at its slender branches, he saw they were gnarled and unfit for beams or rafters. Looking down at its massive roots, he saw they were split and useless for coffins or outer caskets. Licking its leaves, he found they blistered the mouth. Smelling them, he was struck with a madness that lasted three days without cease.\n\nZilai said: \"This is truly a worthless tree—yet it has grown so vast! Ah! The spirit-like person takes this as worthlessness.\"\n\n**Chapter Five**\n\nIn the state of Song there was a region called Jing, where catalpa, cypress, and mulberry thrived. Those trees whose trunks were slender enough to encircle with one’s arms were felled by those seeking wood for monkey perches; those three or four spans in girth were felled by those seeking timber for grand and ornate halls; those seven or eight spans in girth were felled by the households of nobles and wealthy merchants seeking beams and pillars. Thus, none lived out their natural years but were cut down midway by axes. Such is the calamity of usefulness.\n\nNow, the ox with a white forehead, the pig with an upturned snout, or the man with hemorrhoids—none may be offered to the river. The shamans and priests all know this, for these are deemed inauspicious. Yet to the spirit-like person, these are precisely what make for great auspiciousness.\n\nThere was one called Zhili Shu, whose chin nestled into his navel, whose shoulders towered above his crown, whose topknot pointed to the heavens, whose five organs were inverted above, whose thighs framed his ribs. Mending needles and washing clothes, he earned enough to feed himself; sifting chaff and winnowing grain, he earned enough to feed ten. When the ruler conscripted soldiers, Zhili waved his arms among them; when the ruler launched great labor projects, Zhili, citing his chronic ailment, was exempted from service. When the ruler distributed grain to the infirm, he received three bushels and ten bundles of firewood. Ah! Though his body was broken, the Way moved through him and was fulfilled—things called it so, and so it was.\n\nHow does this come to be? It is so because it is so. How does this not come to be? It is not so because it is not so. Things inherently have their \"so-ness,\" things inherently have their \"rightness.\" There is nothing that is not so, nothing that is not right. Thus, whether it be a bamboo mat or a pillar, a leper or Xi Shi, the perverse and the uncanny, the twisted and the monstrous—all are united in the Dao as one.\n\nTheir division is their completion; their completion is their destruction. Yet for all things, there is neither completion nor destruction, for they return to unity in the Dao. Only the enlightened understand this unity, and so they do not employ it but rest in the ordinary. The ordinary is function; function is penetration; penetration is attainment. Attaining this, one is near the mark.\n\nFollowing this, ceasing to act while unaware of why it is so—this is the Dao. To exhaust one’s spirit in striving for unity while failing to recognize their sameness—this is called \"morning three.\" What is \"morning three\"? It is said: A monkey keeper distributed chestnuts, saying, \"Three in the morning and four at dusk.\" The monkeys were all enraged. He then said, \"Then four in the morning and three at dusk.\" The monkeys were all pleased. Yet the substance remained unchanged, and their joy and anger were put to use—this too follows the same principle.\n\nThus, the sage harmonizes with right and wrong, resting in the balance of heaven, which is called \"walking two paths.\" The ancients, in their knowledge, attained a certain limit. Where did they attain it?\n\nOne holds that things have never yet begun to exist—this is the ultimate, the utmost, beyond which nothing can be added. Next, one holds that things exist, yet boundaries have never yet arisen. Next, one holds that boundaries exist, yet right and wrong have never yet appeared. The manifestation of right and wrong is the diminishment of the Dao. The diminishment of the Dao is the formation of partiality. Can there truly be formation and diminishment? Can there truly be neither formation nor diminishment? Where there is formation and diminishment, there is Master Zhao’s zither-playing. Where there is neither formation nor diminishment, there is Master Zhao’s not playing the zither. Master Zhao’s zither-playing, Music Master Kuang’s wielding of the baton, and Master Hui’s leaning against the catalpa tree—these three men’s knowledge nearly reached its fullest, and so their deeds are recorded at life’s end. Yet because they were fond of it, they differed from others; because they were fond of it, they sought to illuminate it. What they sought to illuminate was not what could be illuminated, and so they ended in the obscurity of \"hard and white.\" And their sons, in turn, spent their lives weaving the threads of their fathers’ arts, yet achieved nothing. Could this be called achievement? Even so, it is also achievement.\n\nCould this, then, not be called achievement? Yet things and I have no achievement.\n\nThus, the dazzling confusion of the slippery doubt—this is what the sage contemplates. To act without employing it and lodge it in the commonplace: this is called \"illuminating through obscurity.\"\n\nNow, suppose there were a saying here—would it be of the same kind as this? Or not of the same kind? Whether of the same kind or not, if they are taken together as a kind, then they differ in no way from that. Even so, let me try to speak of it.\n\nThere is a beginning; there is a time before that beginning; there is a time before the time before that beginning. There is being; there is non-being; there is a time before that non-being; there is a time before the time before that non-being. Suddenly there is being and non-being, yet we do not know which of the two—being or non-being—is truly being or truly non-being.\n\nNow, I have already spoken, yet I do not know whether what I have spoken is truly speaking or truly not speaking. Nothing in the world is greater than the tip of an autumn hair, yet Mount Tai is small; nothing is longer-lived than a child who dies young, yet Pengzu died prematurely. Heaven and earth were born together with me, and the myriad things and I are one.\n\nSince we are already one, can there be speech? Since we have already called it \"one,\" can there be no speech? The one and speech make two; two and the one make three. From this point onward, even the most skillful reckoner cannot arrive at a number—how much less can the ordinary person? Thus, from non-being to being, we reach three—how much more so from being to being? Let there be no going toward anything; follow this and be done.\n\nThe Dao has never had boundaries, and speech has never had constancy. Yet because of this, there arises contention. Let me speak of this contention: there is left, there is right; there are hierarchies, there are principles; there are divisions, there are distinctions; there is competition, there is strife—these are called the eight virtues.\n\nBeyond the six directions, the sage preserves but does not discourse; within the six directions, the sage discourses but does not debate. The *Spring and Autumn Annals* and the records of former kings’ aspirations—the sage debates but does not argue.\n\nThus, division implies what is undivided; distinction implies what is undistinguished. One asks: why? The sage holds it within, while the multitude debates it to display to one another. Therefore, it is said: distinction implies what is unseen.\n\nThe great Dao is not named; great disputation speaks not; great benevolence is not benevolent; great integrity is not modest; great courage does not harm. When the Dao is made manifest, it is no longer the Dao; when speech is disputatious, it does not reach; when benevolence is constant, it does not succeed; when integrity is pure, it is not trusted; when courage is harmful, it does not succeed. These five, when rounded, nearly approach squareness.\n\nThus, to know where to stop in what one does not know—this is perfection. Who knows the disputation of no speech, the Dao of no Dao? If one can know this, it is called the Heavenly Storehouse. Pour into it and it is never full; draw from it and it never runs dry, yet one does not know whence it comes—this is called preserving the light.\n\nTherefore, in ancient times, Yao asked Shun: \"I wish to attack Zong, Kuai, and Xu’ao, yet when I sit facing south, I feel unsettled. What is the reason?\"\n\nShun replied: \"Those three rulers remain among the brambles and weeds. How could you feel at ease? In ancient times, ten suns appeared together, and all things were illuminated—how much more so for one whose virtue surpasses the sun?\"\n\n**Chapter Two**\nNie Que asked Wang Ni: \"Do you know what all things agree upon as right?\"\nWang Ni said: \"How would I know?\"\n\"Do you know what you do not know?\"\n\"How would I know?\"\n\"Then do things have no knowledge?\"\n\"How would I know? Nevertheless, let me try to speak of it. How do I know that what I call knowing is not not-knowing? How do I know that what I call not-knowing is not knowing? Now, let me ask you this: If people sleep in dampness, their waists ache and they become half-paralyzed—is that so for the loach? If they dwell in trees, they tremble with fear—is that so for the monkey? Of these three, which knows the proper dwelling? People eat the flesh of livestock; deer eat grass; centipedes relish snakes; owls and crows feast on mice. Of these four, which knows the proper taste? Monkeys mate with monkeys; deer consort with deer; loaches swim with fish. Mao Qiang and Li Ji are considered beauties by men, yet when fish see them, they dive deep; when birds see them, they fly high; when deer see them, they flee swiftly. Of these four, which knows the true beauty of the world? From my perspective, the distinctions of benevolence and righteousness, the paths of right and wrong, are tangled and confused—how could I know their distinctions?\"\nNie Que said: \"If you do not know benefit and harm, does the Perfect Man also not know benefit and harm?\"\nWang Ni said: \"The Perfect Man is divine. Though great marshes burn, he is not hot; though rivers and lakes freeze, he is not cold; though thunder splits mountains and winds shake the sea, he is not startled. One like this rides the clouds and qi, mounts the sun and moon, and roams beyond the four seas. Life and death do not alter him—how much less the distinctions of benefit and harm?\"\n\n**Chapter Three**\nQu Quezi asked Changwuzi: \"I have heard from the Master that the sage does not engage in affairs, does not pursue profit, does not avoid harm, does not seek joy, does not follow the Way; speaks as if silent, is silent as if speaking, and roams beyond the dust of the world. The Master dismissed this as reckless words, but I consider it the practice of the wondrous Way. What do you think?\"\nChangwuzi said: \"These are words that even the Yellow Emperor found perplexing—how could Confucius understand them? Moreover, you are too hasty in your calculations, like seeing an egg and demanding a rooster at dawn, or seeing a slingshot and craving roast owl. Let me speak to you recklessly—why not listen recklessly? He roams alongside the sun and moon, embraces the cosmos, joins their union, and sets aside their confusion, treating all as equal. The multitude toil ceaselessly; the sage appears foolish and dull, blending the myriad ages into one pure whole. All things are thus, mutually enfolding one another. How do I know that delight in life is not delusion? How do I know that aversion to death is not like a youth who has lost his way and does not know his return? Li Ji was the daughter of the border warden of Ai. When the state of Jin first obtained her, she wept until her tears soaked her collar; yet once she reached the king’s palace, shared his bed, and ate fine meats, she regretted her tears. How do I know that the dead do not regret their former clinging to life? Those who dream of drinking wake to weep; those who dream of weeping wake to hunt. While dreaming, they do not know they dream; within the dream, they may even interpret it. Only after waking do they know it was a dream. And only after a great awakening do they know this was all a great dream. Yet fools believe themselves awake, arrogantly claiming to know—lords, herdsmen, how rigid! Confucius and you are both dreaming. When I say you are dreaming, I too am dreaming. Such words are called ‘uncanny paradoxes.’ Even if a great sage were to appear ten thousand generations hence to explain them, it would be like encountering him morning and night.\n\n\"Suppose you and I debate: if you defeat me, and I do not defeat you, does that mean you are truly right and I am truly wrong? If I defeat you, and you do not defeat me, am I truly right and you truly wrong? Is one of us right and the other wrong? Are we both right or both wrong? You and I cannot know, and others are likewise shrouded in darkness. Whom shall we ask to decide? If we ask someone who agrees with you, since they already agree, how can they decide? If we ask someone who agrees with me, since they already agree, how can they decide? If we ask someone who differs from both of us, since they differ, how can they decide? If we ask someone who agrees with both of us, since they agree, how can they decide? Thus, you, I, and others cannot know—must we wait for another?\n\n\"What is meant by harmonizing with the Heavenly Pivot? It is to say: ‘Is it so? Is it not so? If it is truly so, then its difference from not-so need not be debated. If it is truly so, then its difference from not-so need not be debated.’ The mutual dependence of affirmations and negations is like their non-dependence. Harmonize them with the Heavenly Pivot, follow them with boundless transformation, and thus live out your years. Forget years, forget righteousness, be stirred by the boundless, and so lodge in the boundless.\"\n\nThe Shadow of a Shadow asked the Shadow: \"Earlier you were walking, now you are still. Earlier you were sitting, now you are standing. Why are you so without constancy?\"\nThe Shadow said: \"Do I depend on something to be thus? Does what I depend on also depend on something to be thus? Do I depend on the scales of a snake or the wings of a cicada? How do I know why it is so? How do I know why it is not so?\"\n\nOnce, Zhuang Zhou dreamed he was a butterfly—fluttering and joyous, a true butterfly, delighting in the fulfillment of his intent, unaware of Zhou. Suddenly he awoke, and there he was, palpably Zhou. Yet he did not know: was it Zhou dreaming he was a butterfly, or a butterfly dreaming it was Zhou? Between Zhou and the butterfly, there must be a distinction. This is called the transformation of things.\n\n**Chapter Four: The Nurturing of Life**\n\nOur lives are bounded, but knowledge is boundless. To pursue the boundless with the bounded is perilous. Those who persist in such pursuit court peril alone.\n\nIn doing good, avoid proximity to fame; in doing ill, avoid proximity to punishment. Follow the Heavenly Pivot as your guiding principle, and you may preserve your body, fulfill your life, nurture your kin, and live out your years.\n\nCook Ding carved an ox for Lord Wenhui. Where his hand touched, his shoulder leaned, his foot pressed, his knee braced—each movement released a crisp *hua* sound, each stroke of the blade a resonant *huo*. Every motion aligned with the rhythm, harmonizing with the dance of *Sanglin* and the cadence of *Jingshou*.\n\nLord Wenhui exclaimed: \"Ah! How excellent! Has skill truly reached such heights?\"\n\nCook Ding laid down his blade and replied: \"Your servant’s devotion lies in the Dao, which transcends mere skill. When I first began to carve oxen, all I saw was the ox entire. After three years, I no longer saw the ox as a whole. Now, I encounter it with spirit rather than sight; my senses halt while my spirit moves. I follow the Heavenly Principle, cleaving great gaps, guiding through great hollows, proceeding along its inherent patterns. I have never touched a ligament or tendon, much less a major bone. A good cook changes his blade yearly, for he cuts; an ordinary cook changes his monthly, for he hacks. My blade has endured nineteen years, carving thousands of oxen, yet its edge remains as if newly whetted. For where the joints have spaces, and the blade has no thickness—when what has no thickness enters where there is space, how vast the room for the blade to move! Thus, after nineteen years, my blade remains as if newly whetted. Yet whenever I encounter a complex joint, I perceive the difficulty, grow wary, focus my gaze, slow my movements, and wield the knife with utmost care—until, with a sudden *die* sound, the ox falls apart like earth crumbling to the ground. Then I stand, blade in hand, look around in satisfaction, wipe the blade clean, and put it away.\"\n\nLord Wenhui said: \"Excellent! From Cook Ding’s words, I have learned how to nurture life.\"\n\n**Chapter One ends here.**\n\nGongwen Xuan saw the Right Master and was startled, asking: \"What manner of man is this? Why is he one-legged? Was this given by Heaven, or by man?\"\n\"It was Heaven, not man. Heaven’s creation made him thus; man’s form merely reflects it. This is how we know it was Heaven, not man.\"\nA marsh pheasant takes ten steps to peck, a hundred steps to drink, yet it does not seek to be kept in a cage. Though its spirit may soar, it would not fare well.\n\n**Chapter Two ends here.**\n\nWhen Lao Dan died, Qin Shi went to mourn him, crying three times before leaving. A disciple asked: \"Was he not your master’s friend?\" \"Yes,\" he replied. \"Then is such a brief mourning proper?\" \"Yes. At first, I thought him an ordinary man, but now I see he was not. When I entered to offer condolences, I found elders weeping for him as if for their own sons, and youths weeping as if for their own mothers. Those who gathered there must have been moved to speak without intending words, to weep without intending tears. This is fleeing from Heaven and betraying one’s nature, forgetting what one has received—what the ancients called ‘the punishment of fleeing from Heaven.’ When he came, it was his time; when he departed, he followed the natural course. At peace with the time and in harmony with the course, sorrow could not enter. The ancients called this ‘the Great Release.’ A finger pointing at what is sought will wear out, but the flame is passed on—who knows when it will end?\"\n\n**Chapter Three ends here.**\n\n**Human World**\n\nYan Hui sought an audience with Confucius, asking to depart. \"Where to?\" asked Confucius. \"To Wei,\" he replied. \"What will you do there?\" \"I have heard that the lord of Wei is young in years but firm in conduct. He rules his state lightly yet does not see his own faults; he treats the lives of his people as if they were nothing. The dead are measured by the land as if it were a marsh burned dry, and the people have nowhere to turn. I once heard you say, Master: ‘Leave a well-governed state, go to a disordered one—where there are many illnesses, a physician’s gate is busy.’ I wish to ponder what I have heard and seek a principle, hoping perhaps to bring some relief to that state.\"\n\nConfucius said: \"Alas! You will likely go only to be punished. The Way does not tolerate杂乱;杂乱 leads to excess, excess to disturbance, disturbance to anxiety, and anxiety to ruin. The perfected of old first established themselves before establishing others. If what is established in yourself is not secure, how can you attend to the conduct of a violent man? Moreover, do you know where virtue’s dissipation comes from, and from what knowledge arises? Virtue dissipates into fame, knowledge arises from contention. Fame is a tool for mutual conflict; knowledge is an instrument of strife. Both are ill-omened tools, not things to be fully enacted.\n\nFurthermore, though your virtue may be deep and your trust solid, you have not yet grasped the people’s *qi*; though your fame may be known and free of contention, you have not yet reached their hearts. To forcefully present the language of benevolence and righteousness, the carpenter’s line and ink, before a violent man is to make him resent what he would otherwise admire—this is called ‘bringing calamity upon oneself.’ One who brings calamity will surely reap retaliation. Are you not likely to become a target for others?\n\nMoreover, if you merely delight in the worthy and despise the unworthy, why seek to be different? If you remain silent, the lords and princes will surely exploit your presence to vie for advantage. Your eyes will be dazzled, your expression will grow placid, your words will become calculated, your demeanor will take shape, and your heart will be molded by it. This is like quenching fire with fire, or flooding water with water—it is called ‘increasing the excess.’ Following such a beginning without end, if you persist in offering earnest words without trust, you will surely die before that violent man.\n\nIn the past, Jie killed Guan Longfeng, and Zhou killed Prince Bigan—both were men who cultivated themselves to serve the people below, yet their conduct clashed with their superiors. Thus, their lords used their cultivation to cast them out. They were lovers of fame. In ancient times, Yao attacked Congzhi and Xufang, and Yu attacked Youhu. Their states became wastelands of the dead, and they themselves were executed. Their use of arms did not cease, their pursuit of substance knew no end—they were all seekers of fame and substance. Have you not heard of this? Fame and substance are things even the sage cannot overcome—how much less can you? Nevertheless, if you must have a way, come and tell me what you have in mind.\"\n\nYan Hui said: \"If I am upright yet empty, diligent yet single-minded, will that suffice?\" \"No,\" said Confucius. \"How could it?\"\n\nHe who takes yang as his fullness, his brilliance overflowing, his colors ever-shifting—this is what the common man never resists. Following the impulses of others to seek harmony with their hearts, he is called one whose daily-accumulating virtue never ripens—how much less can great virtue? Clinging rigidly without transformation, outwardly conforming while inwardly unexamined—how could this ever suffice?\n\nYet if I am inwardly straight but outwardly bent, achieving while aligning above: To be inwardly straight is to follow Heaven as one’s companion. Following Heaven, one knows that the Son of Heaven and oneself are both children of Heaven. Would one then seek praise for one’s words, or hope others deem them good or bad? Such a one is called a childlike innocent—this is what it means to follow Heaven as one’s companion.\n\nTo be outwardly bent is to follow others as one’s companion. Kneeling with hands clasped, bowing in submission—these are the rites of a minister. If all men do this, how dare I not? Doing what others do, one incurs no blame—this is what it means to follow others as one’s companion.\n\nTo achieve while aligning above is to follow the ancients as one’s companion. Though one’s words may instruct, they are but borrowed truth; what the ancients possessed is not mine. Such a one, though forthright, is not faulted—this is what it means to follow the ancients as one’s companion.\n\nWould this suffice?\nConfucius said: \"No. How could it? Too many rules and laws, yet no penetration. Though firmly held, it remains blameless—but this is all. How can it reach transformation? It is still to follow one’s own mind.\"\n\nYan Hui said: \"I have no further way forward. May I ask the method?\"\nConfucius said: \"Fast. I will tell you. To act while possessing—is this easy? Those who find it easy are not favored by Highest Heaven.\"\n\nYan Hui said: \"My family is poor. For months now, I have neither drunk wine nor eaten meat. Might this be considered fasting?\"\n\nConfucius replied: \"This is the fast of sacrificial rites, not the fasting of the mind.\"\n\nYan Hui asked: \"May I inquire about the fasting of the mind?\"\n\nConfucius said: \"Unify your will. Do not listen with the ears but listen with the mind; do not listen with the mind but listen with qi. Hearing stops at the ears, the mind stops at signs. Qi is that which is empty and awaits things. Only the Dao abides in emptiness. Emptiness is the fasting of the mind.\"\n\nYan Hui said: \"Before I received your instruction, I was truly myself. Having received it, I am as though I have never been myself. May this be called emptiness?\"\n\nConfucius said: \"You have attained it. Let me tell you: If you can enter and wander within its bounds without being moved by fame, respond when it enters, and cease when it does not—without gate, without artifice, dwelling in a single abode and lodging in inevitability—then you are close indeed. To leave no trace is easy; to walk without touching the ground is difficult. To be employed by man is easy to feign; to be employed by Heaven is difficult to feign. You have heard of flying with wings, but never of flying without wings. You have heard of knowing with knowledge, but never of knowing without knowledge. Look upon that emptiness—an empty chamber generates brightness, and auspiciousness comes to rest there. If it does not come to rest, this is called sitting while galloping. If you follow the ears and eyes to communicate inwardly while the mind’s knowledge remains external, even spirits and gods will come to dwell—how much more so men! This is the transformation of the ten thousand things, the pivot of Shun and Yu, the ultimate course of Fuxi and Jie—how much more so those who are scattered and fragmented!\"\n\nYan Hui said: \"I have made progress.\"\n\nConfucius asked: \"What do you mean?\"\n\nYan Hui replied: \"I have forgotten benevolence and righteousness.\"\n\nConfucius said: \"Good, but not yet sufficient.\"\n\nAnother day, they met again.\n\nYan Hui said: \"I have made further progress.\"\n\nConfucius asked: \"What do you mean?\"\n\nYan Hui replied: \"I have forgotten rites and music.\"\n\nConfucius said: \"Good, but not yet sufficient.\"\n\nAnother day, they met again.\n\nYan Hui said: \"I have made progress.\"\n\nConfucius asked: \"What do you mean?\"\n\nYan Hui replied: \"I sit in forgetfulness.\"\n\nConfucius started and said: \"What is sitting in forgetfulness?\"\n\nYan Hui said: \"I cast off my limbs and body, dismiss my hearing and sight, leave my form and abandon knowledge, and merge with the Great Thoroughfare. This is called sitting in forgetfulness.\"\n\nConfucius said: \"To merge is to have no preferences; to transform is to have no constancy. And have you truly become worthy? I would follow after you.\"\n\nChapter One.\n\nLord Zigao of Ye was about to be sent as an envoy to Qi. He asked Confucius, saying: \"The king’s charge to me, Zhu Liang, is most weighty. The reception of envoys in Qi is likely to be respectful yet unhurried. Even a common man cannot be swayed lightly—how much less a feudal lord! I tremble at the thought. You once told me: ‘In all matters, great or small, few are not brought to completion through apprehension. If the matter fails, one must face the calamity of human judgment; if it succeeds, one must endure the affliction of yin and yang. Only those of virtue can ensure that, whether it succeeds or fails, no harm befalls them.’ I eat coarse food without complaint and tend the stove without craving coolness. Yet now, upon receiving my morning orders, I drink ice by evening—surely my inner heat is to blame. I have not yet reached the truth of the matter, yet I already suffer the affliction of yin and yang. If the matter fails, I must face the calamity of human judgment. These are two perils. As a minister, I am unworthy of such a task. Pray, instruct me further.\"\n\nConfucius said: \"Under heaven, there are two great precepts: the first is fate, the second is duty. Your love for your parents is fate—it cannot be untied from the heart. A minister’s service to his lord is duty—there is no place in heaven or earth where he may escape it. These are called the great precepts. Thus, in serving one’s parents, to find peace without choosing the place is the height of filial piety. In serving one’s lord, to find peace without choosing the task is the fullness of loyalty. In mastering one’s own heart, to return to joy and not alter it before one’s eyes, to know what cannot be helped and accept it as fate—this is the perfection of virtue. As a minister and son, one is fundamentally bound by what cannot be avoided. Proceeding with the truth of the matter and forgetting oneself—how could one have leisure to delight in life or fear death? You may go forth.\n\nLet me also share what I have heard: In close dealings, trust must be cultivated through intimacy; in distant relations, loyalty must be conveyed through words. Words must often be transmitted. Yet transmitting words that please or anger both sides is the most difficult task under heaven. Where both are pleased, there will be much exaggerated praise; where both are angered, there will be much exaggerated blame. All exaggeration is falsehood; falsehood erodes trust, and where trust is lacking, the transmitter incurs misfortune. Thus, the standard teaching says: Transmit the constant truth, do not transmit exaggerated words—then you will be nearly whole.\n\nMoreover, those who contend with skill and strength begin in openness but often end in secrecy; when excess prevails, there is much cunning. Those who drink wine with ritual begin in order but often end in disorder; when excess prevails, there is much reckless revelry. All things are thus: they begin in sincerity but often end in vulgarity. Their inception is simple, but their conclusion is inevitably grand. Words are like wind and waves; actions are like gain and loss. Wind and waves are easily stirred; gain and loss are easily imperiled. Thus, anger arises without cause, and artful speech leans toward partiality. When beasts die, they do not choose their cries; their breath falters, and in that moment, a vicious heart arises. When scrutiny becomes excessive, an unworthy heart responds unknowingly. If one does not know why this is so, who can foresee the outcome? Thus, the standard teaching says: Do not alter orders, do not urge completion. Excessive change is harmful. Altering orders and urging completion endanger the matter. Success built over time endures; failure, once formed, cannot be amended—can one not be cautious?\n\nMoreover, to ride the world’s currents and roam the heart, to entrust oneself to necessity and nurture the center—this is perfection. What need is there for contrivance or repayment? It is best to deliver the charge faithfully. This is the difficulty.\"\n\nYan He was about to instruct the crown prince of Duke Ling of Wei when he questioned Qu Boyu, saying: \"There is a man here whose virtue is as harsh as Heaven’s execution. If I deal with him without method, it endangers our state; if I deal with him with method, it endangers myself. His knowledge is just enough to perceive others’ faults but not to understand why they err. In such a case, what should I do?\"\n\nQu Boyu replied: \"An excellent question! Be vigilant, be cautious, and rectify yourself. In form, nothing surpasses compliance; in heart, nothing surpasses harmony. Yet even these two have their perils. Compliance must not become submission, nor harmony projection. If in form you submit, you risk collapse, destruction, ruin, or downfall. If in heart you project harmony, you risk becoming a voice, a reputation, an omen, or a scourge. If he acts like an infant, respond as an infant; if he abandons boundaries, abandon boundaries with him; if he knows no limits, match his boundlessness. Master this, and you enter flawlessness.\n\nDo you not know the mantis? Enraged, it raises its arms to block a chariot wheel, unaware of its incapacity—such is the beauty of its talent. Beware, be cautious. To accumulate praise and beauty while provoking him is perilously close.\n\nDo you not know those who raise tigers? They dare not feed it living prey, lest its killing fury be aroused; nor whole prey, lest its tearing fury be provoked. They time its hunger and satiety, understanding its angry heart. Though tigers and humans are of different kinds, the tiger fawns on its keeper—this is compliance. Thus, those it kills are those who resist.\n\nThose who love horses use baskets to collect their dung and conch shells for their urine. Yet when a mosquito or horsefly alights and they swat it untimely, the horse may bite through the bit, break its bridle, or smash its chest. Love may reach a point where it loses what it cherishes—can one not be cautious?\"\n\n---\n\nIn the third chapter, Carpenter Shi traveled to Qi and reached Qu Yuan, where he saw a community altar tree. Its girth could shade an ox, its trunk measured a hundred spans, and its height towered ten *ren* above the mountain before branching. A dozen of its side growths could serve as boats. Onlookers thronged like a marketplace, yet the master carpenter did not glance at it and continued on his way without pause.\n\nThe disciple, eager to examine it, ran to catch up with Carpenter Shi and said: \"Since I took up the axe and followed you, Master, I have never seen timber so magnificent as this. Yet you would not deign to look at it, walking on without pause—why?\"\n\n\"Enough,\" he replied. \"Say no more. It is a useless tree. Were one to make a boat of it, it would sink; a coffin or outer coffin, it would rot swiftly; vessels, they would break at once; doors or windows, it would ooze sap; pillars, it would be eaten by worms. It is a tree of no use—precisely why it has lived so long.\"\n\nCarpenter Shi returned home, and in a dream the altar tree of Qu appeared to him, saying: \"To what would you compare me? Would you liken me to the so-called 'fine timber'? Look at the hawthorn, pear, orange, pomelo, and other fruit-bearing trees: when their fruit ripens, they are stripped and humiliated. Their great branches break, their small branches are torn—all because their usefulness makes their lives bitter. Thus they do not live out their natural span but perish halfway, struck down by the world’s demands. All things are like this. As for me, I have sought to be of no use for a long time. Nearly dead, I have only now attained it—this is my great usefulness. Had I been of use, would I have grown so vast? Moreover, you and I are both things—how could one thing judge another? And you, a nearly dead man of no consequence—what could you know of a useless tree?\"\n\nCarpenter Shi awoke and pondered his dream. His disciple asked:\n\n\"To seek the useless—then what is it to the sacred tree?\nSilent.\nAs if speechless.\nIt merely lodges there, enduring the scorn of those who know it not.\nHad it not been for the sacred tree, would it have nearly reached ten thousand?\nMoreover, what it preserves differs from the multitude—yet to explain it by righteousness, is that not far off?\n\n**Chapter Four**\nNanbo Zicai roamed the hills of Shang, where he saw a great tree unlike any other. A thousand chariots could shelter beneath its shade, and its rustling leaves seemed to sing. Ziqi said: \"What tree is this? It must possess extraordinary timber.\"\nLooking up at its slender branches, they were gnarled and unfit for beams or rafters; gazing down at its massive roots, they were split and useless for coffins or outer caskets. Chewing its leaves, the mouth festered and bled; inhaling its scent, one fell into a frenzy, waking only after three days.\nZilai said: \"Truly, this is a tree of no use—yet it has grown so vast! Ah! The spirit-like person takes this as non-utility.\"\n\n**Chapter Five**\n\nIn the state of Song there was a region called Jing, where catalpa, cypress, and mulberry flourished. Those trees whose trunks measured but a hand’s span were felled for monkey perches; those of three or four arm-spans, for the beams of grand mansions; those of seven or eight arm-spans, for the sideboards of wealthy merchants. Thus they never lived out their natural years but perished midway beneath the axe. Such is the calamity of usefulness.\n\nHence, an ox with a white forehead, a pig with an upturned snout, or a man with hemorrhoids—none may cross the river. The shamans and priests know this well, for they deem such things inauspicious. Yet to the spirit-like person, these are precisely what make for great auspiciousness.\n\n**Chapter Six**\n\nThere was one named Zhili Shu, whose chin nestled in his navel, shoulders towered above his crown, topknot pointed to the sky, the five organs sat atop his frame, and his thighbones served as ribs. Mending needles and washing clothes earned him enough to feed himself; sifting chaff and winnowing grain sufficed to feed ten. When the authorities conscripted soldiers, Zhili waved his arms among the ranks; when great labor was demanded, Zhili, citing his chronic ailment, was excused from service. Yet when the state distributed grain to the infirm, he received three bushels and ten bundles of firewood. If one so deformed in body could still nourish himself and live out his natural years, how much more might one whose virtue is likewise deformed?\n\nConfucius traveled to Chu, where the madman Jie Yu wandered past his gate, singing:\n*\"Phoenix! Phoenix!\nHow virtue has declined!\nThe future cannot be awaited,\nThe past cannot be retrieved.\nWhen the world possesses the Way,\nThe sage achieves;\nWhen the world lacks the Way,\nThe sage survives.\nIn this present age,\nOne barely escapes punishment.\nFortune lighter than a feather—\nNone know how to bear it;\nDisaster heavier than the earth—\nNone know how to avoid it.\nEnough! Enough!\nApproach others with virtue.\nDangerous! Dangerous!\nMarking the ground to follow.\nWandering, wandering—\nLet nothing harm my path.\nMy path winds and bends—\nLet nothing harm my feet.\"*\n\nThe mountain tree invites its own felling;\nThe lamp’s oil hastens its own burning.\nCinnamon is edible—thus it is cut down;\nLacquer is useful—thus it is slashed.\nAll know the usefulness of the useful,\nYet none know the usefulness of the useless.\n\n*End of the First Scroll of the Inner Chapters of the Zhuangzi, Revised and Corrected*\n\n**Revised and Corrected Inner Chapters of the Zhuangzi, Scroll the Lower**\n\n**Virtue That Completes the Form**\n\nIn Lu there was a man without feet named Wang Tai. Those who followed him were as numerous as those who followed Confucius.\n\nChang Ji asked Confucius, “Wang Tai is a man without feet, yet those who follow him divide Lu equally with you. He stands without teaching, sits without discussing. The empty go to him, the full return. Is there truly a teaching without words, a formless shaping of the heart? What manner of man is he?”\n\nConfucius said, “This man is a sage. I am merely one who lags behind and has yet to visit him. I would take him as my teacher—how much more should those who are not my equal! Why limit it to Lu? I would lead all under heaven to follow him.”\n\nChang Ji said, “He is a man without feet, yet he surpasses you, Master. If so, how does he employ his heart so singularly?”\n\nConfucius said, “Life and death are great indeed, yet they cannot alter him. Though heaven and earth collapse, he would not be lost with them. He examines what is without reliance and does not shift with things, guiding the transformations of beings while guarding their root.”\n\nChang Ji said, “What does this mean?”\n\nConfucius said, “Viewed from their differences, liver and gall are as distant as Chu and Yue. Viewed from their sameness, the ten thousand things are all one. One who is thus does not know what the ears and eyes deem fitting but roams the heart in the harmony of virtue. He sees what is one in things and does not lose it; he sees the loss of his foot as the shedding of earth.”\n\nChang Ji said, “He cultivates himself, using his knowledge to attain his heart, and his heart to attain the constant heart. Why do things flock to him most of all?”\n\nConfucius said, “Men do not mirror themselves in flowing water but in still water—only stillness can still the many. Those who receive their mandate from earth, like the pine and cypress alone, remain verdant through winter and summer. Those who receive their mandate from heaven, like Shun alone, are upright. Fortunate is one who can make life upright and thereby make all lives upright. The proof of preserving the beginning is the substance of fearlessness. A single brave warrior strides into the nine armies. One who seeks fame and can bind himself is still thus—how much more one who governs heaven and earth, stores the ten thousand things, lodges in the six limbs, takes the ears and eyes as mere images, unifies the knowledge of knowledge, and whose heart has never died? He will choose a day to ascend on high, and men will follow him. How would he deign to make things his concern?”\n\n---\n\n**Chapter One**\n\nShentu Jia, a man without feet, studied under Bo Hun Wu Ren alongside Zichan of Zheng.\n\nZichan said to Shentu Jia, “If I go out first, you stay; if you go out first, I stay.” The next day, they again sat together in the same hall. Zichan said to Shentu Jia, “If I go out first, you stay; if you go out first, I stay. Now I am about to go out—can you stay? Or is this not so? Moreover, you see the one in power and do not avoid him. Do you consider yourself equal to the one in power?”\n\nShentu Jia said, “In the Master’s gate, is there truly one in power like this? Are you pleased with your own power and look down on others? I have heard that when a mirror is bright, dust does not settle; when it settles, it is no longer bright. To dwell long with the worthy is to be without fault. Now, what you take as greatest is the Master, yet you still speak thus—is this not a fault?”\n\nZichan said, “You are already thus, yet you still vie with Yao in goodness. By your virtue, are you not sufficient to reflect upon yourself?”\n\nShentu Jia said, “Those who justify their faults, claiming they should not have lost what they lost, are many. Those who do not justify their faults, claiming they should not have kept what they kept, are few. To know there is nothing to be done and to accept it as fate—only one with virtue can do this. I wander within Yi’s bow’s range. The center is the center of the target, yet to not hit the center is fate. Men bark at my incomplete feet as if I were whole, and I bristle with anger. But when I reach the Master’s place, I return composed. Do I not know the Master washes me with goodness? I have followed you, Master, for nineteen years and have never known I was a man without feet. Now you follow me within the form, yet seek me outside the form—is this not a fault?”\n\nZichan, startled, changed his expression and said, “You need not speak further.”\n\n---\n\n**Chapter Two**\n\nIn Lu there was a man without toes named Shushan Wuzhi. He came to see Confucius on his heels.\n\nConfucius said, “You were not careful, and already suffered such misfortune. Though you come now, what can be done?”\n\nWuzhi said, “I only did not know my duty and lightly used my body, which is why I lost my foot. Now I come because what is worthy of my foot still remains, and I strive to preserve it. Heaven covers all without exception; earth bears all without exception. I took you, Master, to be like heaven and earth—how could I have known you would be thus?”\n\nConfucius said, “I am but a man of a hill—how crude! Why not enter and let me expound what I have heard?”\n\nWuzhi departed. Confucius said, “Disciples, exert yourselves! Wuzhi is a man without toes, yet he strives to learn to remedy his past misdeeds—how much more should one of complete virtue!”\n\nWuzhi said to Lao Dan, “Is Confucius not yet a perfected man? Why does he so assiduously take you as his teacher?”\n\nHe flaunts such bizarre and fantastical renown, yet does he not know that the perfected man sees these as his own shackles?\n\nLao Dan said, “Why not simply lead him to regard life and death as a single thread, the permissible and the impermissible as one continuum, and thus free him from his bonds? Would that be possible?”\n\nWuzhi replied, “Heaven has punished him—how could it be undone?”\n\n---\n\n**Chapter Three**\n\nDuke Ai of Lu asked Confucius, “In Wei there is an ugly man named Aitai Tuo. When men dwell with him, they grow so attached they cannot bear to leave. When women see him, they plead with their parents, saying, ‘Better to be this man’s concubine than another’s wife’—and this has happened more than ten times. He never initiates speech, only ever harmonizing with others. He holds no lordly rank to deliver men from death, nor amasses wealth to fill their bellies. Moreover, his ugliness startles all under heaven, yet he harmonizes without leading, and his wisdom does not extend beyond his immediate sphere. Yet before him, male and female alike gather—there must be something extraordinary about him. I summoned him to observe, and indeed, his ugliness startled all under heaven. When he dwelt with me, in less than a month I took interest in his character; before a year had passed, I trusted him completely. As the state had no steward, I offered him the governance. He responded with hesitation, as if reluctant, and when he did speak, it was as though he declined. I felt ashamed, yet in the end I entrusted him with the state. Before long, he left me and departed. I grieved as though I had lost something, as though no one remained to share the joy of ruling this state. What manner of man is he?”\n\nConfucius said, “I once traveled to Chu and happened to see a young pig nursing from its dead mother. After a moment, the piglets shrank back in fear, all abandoning her and fleeing. They no longer saw her as their own, nor recognized her as one of their kind. What they had loved was their mother, not her form, but that which gave her form. When warriors die in battle, their burials are not adorned with military trappings; when a man’s feet are severed, no one cherishes his shoes. In both cases, the root is gone.”\n\nThe attendants of the Son of Heaven do not pare their nails nor pierce their ears; those who take wives remain outside the court and are no longer employed in service. If one whose form is whole may yet be deemed fit for display, how much more so the man of perfect virtue!\n\nNow, Ai Taituo spoke not a word yet was trusted, had no merit yet was cherished, was offered a state yet feared only that he might refuse—this must be a man of complete talent whose virtue remains unmanifest.\n\nDuke Ai said, “What is meant by *complete talent*?”\nConfucius replied, “Life and death, survival and ruin, failure and success, poverty and wealth, worthiness and unworthiness, slander and praise, hunger and thirst, cold and heat—these are the changes of affairs, the workings of fate. They alternate before us day and night, yet knowledge cannot fathom their beginnings. Therefore, they must not be allowed to disturb harmony or enter the sacred chamber of the mind. Let them flow smoothly without losing joy; let the days pass without discord, ever bringing spring to all things—this is to meet them with a heart that gives life to the seasons. This is what is called *complete talent*.”\n\n“What is meant by *virtue unmanifest*?”\n“Stillness is the fullness of water at rest. It may serve as a model, for inwardly it preserves itself while outwardly it remains undisturbed. Virtue is the cultivation of perfect harmony. When virtue is unmanifest, nothing can depart from it.”\n\nAnother day, Duke Ai told Minzi, “At first, I faced south as lord of the world, wielding the people’s guiding principles and fearing their deaths—I thought myself supremely enlightened. Now, having heard the words of a perfected man, I fear I lack true substance, that I have recklessly spent myself and lost my state. I and Kong Qiu are not ruler and subject—we are friends in virtue.”\n\n---\n\nChapter Four\n\nThe hunchbacked, limbless man without lips spoke to Duke Ling of Wei, and the duke was delighted with him, yet when he looked upon whole men, their necks seemed too slender. The man with a great goiter spoke to Duke Huan of Qi, and the duke was delighted with him, yet when he looked upon whole men, their necks seemed too slender. Thus, when virtue excels, form is forgotten. If men do not forget what ought to be forgotten but forget what ought not to be forgotten, this is called *true forgetting*.\n\nTherefore, the sage wanders freely, and knowledge becomes a snare, covenants become glue, virtue becomes a bond, skill becomes commerce. The sage does not scheme—why employ knowledge? He does not carve—why employ glue? He suffers no loss—why employ virtue? He does not trade—why employ commerce? These four are the fasting of the heavens. The fasting of the heavens is the sustenance of heaven. Having received sustenance from heaven, why employ man?\n\n---\n\nChapter Five\n\nOne may have the form of a man yet lack the passions of a man. Having the form of a man, he mingles with others; lacking the passions of a man, right and wrong do not cling to him. Insignificant and small, he belongs to mankind; vast and great, he completes his heaven alone.\n\nHuizi said to Zhuangzi, “Can a man truly be without passion?”\nZhuangzi replied, “Yes.”\nHuizi said, “If a man has no passion, how can he be called a man?”\nZhuangzi said, “The Dao gives him his appearance, heaven gives him his form—how can he not be called a man?”\nHuizi said, “If he is called a man, how can he be without passion?”\nZhuangzi said, “This is not what I mean by passion. What I call passion is when a man does not allow likes and dislikes to inwardly harm his person, but constantly follows nature without augmenting life.”\nHuizi said, “If he does not augment life, how does he preserve his person?”\nZhuangzi said, “The Dao gives him his appearance, heaven gives him his form—he does not allow likes and dislikes to inwardly harm his person. Now, you exhaust your spirit outwardly, weary your essence, lean against a tree and chant, rest your head on a withered catalpa and doze. Heaven chose your form, yet you prattle on about ‘hard’ and ‘white.’”\n\n---\n\nChapter Six: *The Great and Venerable Teacher*\n\nThose who know what Heaven does and what man does have reached the utmost. To know what Heaven does is to be born of Heaven; to know what man does is to use what one’s knowledge knows to nourish what one’s knowledge does not know, thus fulfilling one’s Heaven-appointed years without perishing midway—this is the fullness of knowledge.\n\nYet there is a peril. For knowledge must await something before it is fitting, and what it awaits is never certain. How can we know that what I call Heaven is not man? That what I call man is not Heaven? Only when there is a true man is there true knowledge.\n\nWhat is a true man? The true men of old did not oppose the few, did not presume upon success, did not scheme. Such men, though they erred, felt no regret; though they succeeded, felt no self-satisfaction. Such men, when they climbed heights, did not tremble; when they entered water, did not get wet; when they entered fire, did not feel heat. Their knowledge could ascend to the Dao in this way.\n\nThe true men of old slept without dreaming, woke without care; ate without relishing, breathed deeply. The true man breathes from his heels; the common man breathes from his throat. Those who are bent and submissive croak their words as if retching. The deeper one’s desires, the shallower one’s Heavenly mechanism.\n\nThe true men of old did not rejoice in life, did not hate death. They emerged without delight, entered without resistance—lightly they came, calmly they went. They did not forget their beginning, did not seek their end. They received and rejoiced in it, forgot and returned to it—this is what is meant by not using the mind to cast aside the Dao, not using man to aid Heaven. This is what is called the true man.\n\nSuch men had minds at ease, countenances serene, brows relaxed. Cold as autumn, warm as spring, their joy and anger flowed with the four seasons, harmonizing with things yet without limit. Thus, when the sage employs arms, he may destroy a state yet not lose the people’s hearts. His beneficence extends to ten thousand generations, yet he does not do it out of love for men.\n\nTherefore, one who delights in harmonizing with things is no sage; one who has partiality is not benevolent; one who relies on Heaven’s timing is not worthy; one who does not comprehend advantage and harm is no gentleman; one who pursues fame at the cost of self is no scholar; one who loses himself yet is not true is no servant of men. Men like Hu Buxie, Wu Guang, Boyi, Shuqi, Jizi, Xuyu, Ji Ta, and Shentu Di—these are servants of men’s service, followers of others’ paths, not seekers of their own fulfillment.\n\nThe true men of old had a bearing of righteousness yet were not partisan; seemed insufficient yet did not defer. They were substantial in form yet not rigid, expansive in emptiness yet not ostentatious. Cheerful as if pleased, solemn as if compelled. Their demeanor invited trust, their virtue brought stillness. Stern as if worldly, alert as if beyond control. Connected as if fond of leisure, joyful as if forgetting words.\n\nThey took punishment as their body, ritual as their wings, knowledge as their timing, virtue as their guide. Taking punishment as their body, they were lenient in execution. Taking ritual as their wings, they moved through the world. Taking knowledge as their timing, they acted only when compelled. Taking virtue as their guide, they spoke as if arriving at the hills with those who have feet—yet men truly believed them to be diligent in conduct.\n\nThus, their liking was one, their disliking was one; their oneness was one, their not-oneness was one. Their oneness joined them to Heaven as companions. Their not-oneness did not contend with man—this is what is called the true man.\n\nWhen the spring dries up, fish find themselves together on land, moistening one another with breath, wetting one another with foam—better to forget one another in rivers and lakes. Rather than praising Yao and condemning Jie, better to forget both and be transformed by the Dao.\n\nThe great clod burdens me with form, labors me with life, eases me with old age, rests me with death. Thus, to make my life good is to make my death good. Life and death are fate, as constant as night and day—this is Heaven. What man cannot partake in is the nature of things.\n\nHe who takes Heaven as his father yet still loves his body—how much more should he love what transcends it? He who takes a lord as superior to himself yet still dies for his body—how much more should he die for what is true?\n\nHiding a boat in a ravine, hiding a mountain in a marsh—this seems secure. Yet in the dead of night, a strong man may carry them away, and the unaware do not know. Hiding the small and large appropriately still leaves room for displacement. But to hide the world within the world is to find no place of delay—this is the great constancy of things.\n\nEven one who cherishes his human form should rejoice in it. How much more should one rejoice in the myriad transformations of this form, which have no end? Can the joy of it be measured? Thus, the sage wanders where things cannot return yet all endure.\n\nTo be good at early death, good at old age, good at beginning, good at ending—men still emulate this. How much more should they emulate what binds the ten thousand things and awaits the one transformation?\n\nThe Dao has essence and trustworthiness, yet is without action or form. It can be transmitted but not received, attained but not seen. It is self-originating, self-so—before Heaven and Earth existed, it was already firmly established. It spiritually animates ghosts and spirits, gives birth to Heaven and Earth. It is before the Supreme Polarity yet not high; below the Six Directions yet not deep. It preceded Heaven and Earth yet is not ancient; it is older than the oldest yet not aged.\n\nXiwei obtained it and thereby lifted Heaven and Earth. Fuxi obtained it and thereby embraced the mother of qi. The Northern Dipper obtained it and has never faltered since ancient times. The sun and moon obtained it and have never ceased since ancient times. Kanpi obtained it and thereby embraced Kunlun. Feng Yi obtained it and thereby roamed the great rivers. Jian Wu obtained it and thereby dwelled on the great mountains. The Yellow Emperor obtained it and thereby ascended to the cloudy heavens.\n\nZhuanxu obtained it and thereby dwelled in the Dark Palace. Yuqiang obtained it and stood at the Northern Culmen. The Queen Mother of the West obtained it and sat in the Lesser Expanse—none knew her beginning, none knew her end. Pengzu obtained it, reaching upward to the age of Yu and downward to the Five Hegemons. Fu Yue obtained it and thereby assisted Wu Ding, encompassing all under Heaven, riding the Eastern Rope and mounting the Tail of the Winnowing Basket to rank among the arrayed stars.\n\n---\n\n**Chapter One**\nNanbo Zikui asked of Nü’ou: “Your years are advanced, yet your complexion is like that of a child—how is this?”\nHe replied: “I have heard the Dao.”\nNanbo Zikui said: “Can the Dao be learned?”\nHe replied: “No. How could it be? You are not the right person. Now, Pulian Yi possesses the talent of a sage but not the Dao of a sage, while I possess the Dao of a sage but not the talent of a sage. I wished to teach him, hoping he might indeed become a sage. If not, to impart the Dao of a sage to one with the talent of a sage would be easy. Yet I still guarded it and instructed him: after three days, he could put the world outside himself. Having put the world outside, I guarded it further, and after seven days, he could put things outside himself. Having put things outside, I guarded it further, and after nine days, he could put life outside himself. Having put life outside, he could then attain morning clarity. With morning clarity, he could then perceive the solitary. Perceiving the solitary, he could then transcend past and present. Transcending past and present, he could then enter the realm of neither death nor life. That which kills life does not die; that which gives life to life does not live. As a thing, it sends nothing off, welcomes nothing, destroys nothing, completes nothing. Its name is *yingning* (serene disturbance). *Yingning*—it is that which is completed only after disturbance.”\nNanbo Zikui said: “From whom did you alone hear this?”\nHe replied: “I heard it from the son of Fu Mo. The son of Fu Mo heard it from the grandson of Luo Song. The grandson of Luo Song heard it from Zhan Ming. Zhan Ming heard it from Nie Xu. Nie Xu heard it from Xu Yi. Xu Yi heard it from Wu Ou. Wu Ou heard it from Xuan Ming. Xuan Ming heard it from Can Liao. Can Liao heard it from Yi Shi.”\n\n---\n\n**Chapter Two**\nZi Si, Zi Yu, Zi Li, and Zi Lai spoke among themselves: “Who can take nonbeing as the head, life as the spine, and death as the tail? Who knows that death and life, existence and nonexistence, are of one body? We would befriend him.”\nThe four looked at one another and smiled, their hearts in accord, and so became friends.\n\nSoon after, Zi Yu fell ill. Zi Si went to inquire of him.\nHe said: “How wondrous! The Creator is about to make me thus crooked and bent.”\n\nThe crooked hump rose from his back, five tubes protruding above, his chin sinking to his navel, his shoulders towering above his crown, the growth at his nape pointing to the sky—his yin and yang qi disordered. Yet his heart remained unperturbed, and he strolled to the well to gaze at his reflection.\n\nHe said: “Alas! The Creator is about to make me thus crooked and bent.”\n\nZi Si said: “Do you resent it?”\n\nHe replied: “No, why should I resent it? If by degrees my left arm were transformed into a cock, I would use it to seek the dawn; if by degrees my right arm were transformed into a crossbow, I would use it to hunt an owl for roasting; if by degrees my buttocks were transformed into wheels, and my spirit into a horse, I would ride them—why ever change mounts?\n\nMoreover, to gain is a matter of timing; to lose is a matter of compliance. Abiding in timely accord and dwelling in compliance, neither joy nor sorrow can enter. This is what the ancients called ‘suspended release.’ Yet those who cannot release themselves are bound by things. Furthermore, things have never triumphed over Heaven for long—why should I resent it?”\n\nSoon after, Zi Lai fell ill, gasping as if near death. His wife and children gathered around weeping. Zi Li went to inquire of him and shouted: “Away! Begone! Do not disturb his transformation.”\n\nLeaning against the doorframe, he spoke to him: “How wondrous is the Creator! What will it make of you next? Where will it send you?”\n\n“Shall it make you into a rat’s liver? Or the arm of an insect?”\n\nZi Lai replied: “To a child, father and mother may bid east or west, and the child obeys without question. Yet the workings of yin and yang upon a person are no less than father and mother. If they draw near to my death and I refuse to heed them, I would be obstinate—what fault would lie with them? The Great Clod bears me with form, labors me with life, eases me with age, and rests me with death. Thus to treat my life well is to treat my death well.\n\nNow, if a great smelter were casting metal, and the molten metal leapt up crying, ‘I must become a Moye sword!’ the smelter would surely deem it ill-omened metal. Likewise, if one who has assumed human form were to say, ‘I am human! I am human!’ the Creator would surely deem it an ill-omened person. Now, if we regard Heaven and Earth as a great furnace and the Creator as a great smelter, where could we go and not be acceptable?”\n\nThen he fell into a deep sleep and awoke refreshed.\n\n---\n\n**Chapter Three**\n\nZi Sanghu, Meng Zifan, and Zi Qinzhang became friends and said to one another: “Who can join together in non-joining, act for one another in non-acting? Who can ascend to heaven and wander in the mists, roaming without bound, forgetting life and having no end?”\n\nThe three looked at one another and laughed, their hearts in perfect accord. Thus they became friends.\n\nAfter some time, Zi Sanghu died, his body yet unburied. When Confucius heard of this, he sent Zigong to assist with the funeral rites. One of the friends strummed a zither, another plucked a lute, and together they sang in harmony: *\"Alas, Sanghu! Alas, Sanghu! You have returned to your true nature, while we remain here, still clinging to human form.\"*\n\nZigong hurried forward and said, *\"May I ask—is it proper to sing before the dead?\"* The two looked at each other and laughed, saying, *\"What does he know of the meaning of ritual?\"*\n\nZigong returned and reported to Confucius: *\"What manner of men are they? They cultivate conduct without regard for outward form, sing before the dead without change of countenance—there is no name for them. What manner of men are they?\"*\n\nConfucius said, *\"They wander beyond the bounds of the world, while I wander within them. Beyond and within do not meet, and yet I sent you to offer condolences—how shallow of me! They are now companions of the Creator, roaming in the single qi of Heaven and Earth. To them, life is but an excrescence, a hanging tumor; death is but the bursting of the tumor, the draining of the abscess. How could such men know where life and death, before and after, truly lie? Borrowing from different things, they lodge in the same body; forgetting liver and gall, they abandon ears and eyes. They cycle through beginnings and ends, unaware of origin or end. Vast and unbound, they wander beyond the dust and grime, carefree in the work of non-action. How could they trouble themselves with the rituals of the vulgar world, seeking only to impress the eyes and ears of the crowd?\"*\n\nZigong said, *\"Then what path do you follow, Master?\"*\n\nConfucius replied, *\"I am one whom Heaven has punished. Yet even so, I share this with you.\"*\n\nZigong asked, *\"May I inquire as to the method?\"*\n\nConfucius said, *\"Fish are made for water, as humans are made for the Dao. Those made for water dig ponds to sustain themselves; those made for the Dao find tranquility without effort. Thus it is said: Fish forget one another in rivers and lakes, just as humans forget one another in the safeguarding of the Dao.\"*\n\nZigong said, *\"May I ask about the *qi*-person?\"*\n\nConfucius replied, *\"The *qi*-person is one who is odd among men but aligned with Heaven. Thus it is said: What is a petty man to Heaven is a noble man to men; what is a noble man to men is a petty man to Heaven.\"*\n\n---\n\nYan Hui asked Confucius, *\"Mengsun Cai’s mother died. He wept without tears, his heart untroubled, and showed no grief in mourning. Lacking these three, he was still praised throughout Lu for his mastery of mourning rites. How can one gain such a reputation without substance?\"* Yan Hui found this strange.\n\nConfucius said, *\"Mengsun Cai has exhausted the limits of understanding—he has advanced beyond knowledge. He could not simplify further, for he had already simplified all he could. He does not know why he lives or why he dies, does not know what comes first or what follows. If he is transformed into another thing, he awaits the transformation he does not yet know. Even now, as he is about to change, how could he know he will not change? Even now, as he is not changing, how could he know he has not already changed? You and I are but dreamers who have not yet awakened. Moreover, he may be startled by his form but his heart remains unharmed; his dwelling may change, but his essence does not die. Mengsun Cai is simply awake—when others weep, he weeps, for that is his nature. And yet, we speak of ‘my’ ears and ‘my’ understanding—how can we be certain what we call ‘mine’ is truly ours? You may dream of becoming a bird and soaring to the heavens, or a fish and diving into the depths. But who can say whether the speaker now is awake or still dreaming? When one reaches perfect harmony, laughter does not follow; when one offers a jest, applause does not come. Accepting fate and departing from change, one enters the vast oneness of Heaven.\"*\n\n---\n\nYi Zhi sought an audience with Xu You. Xu You said:\n\nYi Zhi sought an audience with Xu You. Xu You asked:\n“Why did Yao endow you with such things?”\n\nYi Zhi replied: “Yao told me, ‘You must personally practice benevolence and righteousness and clearly distinguish right from wrong.’”\n\nXu You said: “Then why have you come to court? Since Yao has already branded you with benevolence and righteousness and mutilated you with right and wrong, how will you wander the path of carefree ease, unconstrained freedom, and ceaseless transformation?”\n\nYi Zhi said: “Even so, I wish to wander within its bounds.”\n\nXu You said: “Not so. The blind cannot partake in the beauty of brows and eyes, nor can the deaf appreciate the spectacle of blue and yellow hues. How could they?”\n\nYi Zhi said: “Yet Wu Zhuang lost her beauty, Ju Liang lost his strength, and the Yellow Emperor lost his wisdom—all within the forge and hammer’s reach. How can we be certain the Creator will not heal my brand and mend my mutilation, allowing me to attain completion and follow you, Master?”\n\nXu You said: “Alas, it cannot be known. Let me speak to you of the great outline: My Master! My Master! He orders the myriad things yet claims no righteousness, bestows blessings upon ten thousand generations yet claims no benevolence, predates high antiquity yet claims no age, encompasses heaven and earth, carves and shapes all forms yet claims no skill. This is the realm in which one wanders.”\n\n---Chapter Six---\n\nZiyu and Zisang were friends. When continuous rain fell for ten days, Ziyu said: “Zisang must be in dire straits.” Wrapping rice, he went to feed him. Arriving at Zisang’s gate, he heard sounds like singing, like weeping—plucking the zither, Zisang cried: “Father! Mother! Heaven! Man!” His voice could not bear the strain, yet he hastened to recite his verse.\n\nZiyu entered and asked: “Why do you sing this poem in such a way?”\n\nZisang replied: “I pondered who brought me to this extremity, yet I cannot find the answer. Would my parents wish me to be poor? Heaven covers without partiality, earth bears without partiality—would heaven and earth single me out for poverty? I sought the one who caused this, yet I cannot find him. And yet, to reach this extremity—it is fate, is it not?”\n\n---Chapter Seven---\n\n\"Responding to Emperors\"\n\nNie Que questioned Wang Ni four times, and four times Wang Ni professed ignorance. Nie Que leapt up in great joy and went to tell Pu Yi Zi.\n\nPu Yi Zi said: “Only now do you understand? The Lord of Yu did not match the Lord of Tai. The Lord of Yu concealed his benevolence to entice men—he gained men, yet never transcended the realm of the unenlightened. The Lord of Tai lay at ease, awoke unhurried. At times he took himself for a horse, at times for an ox. His knowledge was true to his nature, his virtue most genuine, and he never entered the realm of the unenlightened.”\n\n---Chapter One---\n\nJian Wu met the madman Jie Yu.\n\nJie Yu asked: “What did Zhong Shi of Noon tell you?”\nJian Wu replied: “He instructed me that a ruler must issue laws, models, principles, and measures from his own person—who would dare disobey and fail to be transformed?”\n\nJie Yu said: “This is deceptive virtue. To govern the world thus is like crossing the sea by digging a river or making a mosquito carry a mountain. Does the sage’s governance concern externals? He simply rectifies himself and then acts, ensuring his actions align with his true capacity. The cormorant flies high to evade the fowler’s snare, the field mouse burrows deep beneath the sacred mound to escape the digger’s harm—yet you deem these creatures lacking in knowledge?”\n\n---\n\nChapter Three\n\nTian Gen wandered to Yin Yang and arrived at the banks of the Liao River, where he encountered the Nameless Man and asked: “I beg to inquire how to govern the world.”\n\nThe Nameless Man said: “Begone! You are a vulgar man—why ask questions so ill-timed? I am about to become human with the Creator of Things. When weary, I ride the boundless bird beyond the six directions, roaming the land of Nothing Whatever, dwelling in the vast wilds. How could your questions about governing the world disturb my heart?”\n\nHe asked again.\n\nThe Nameless Man said: “Let your mind wander in stillness, merge your qi with emptiness, follow things as they are without imposing private concerns—thus the world is governed.”\n\n---\n\nChapter Four\n\nYang Ziju visited Lao Dan and said: “Suppose there is a man swift, strong, and resolute, with keen perception and clear understanding, who studies the Dao tirelessly. Could such a one be compared to an enlightened king?”\n\nLao Dan replied: “To the sage, such a man is like a petty clerk bound by skills, exhausting his body and straining his mind. Moreover, the tiger and leopard’s patterned hides invite hunters, the monkey’s agility and the hound’s tracking prowess bring them to the leash. Could such a one be compared to an enlightened king?”\n\nYang Ziju, startled, said: “May I ask how an enlightened king governs?”\n\nLao Dan said: “The governance of an enlightened king: his achievements cover the world yet seem not his own; he transforms and bestows upon the ten thousand things, yet the people do not rely on him. He remains nameless, allowing things to rejoice of themselves. He stands in the unfathomable and roams where there is nothing.”\n\n---\n\nChapter Five\n\nIn Zheng there was a divine diviner named Ji Xian, who knew men’s deaths and lives, survival and ruin, fortune and misfortune, long life and early death, predicting them by year, month, and day as if by spirit. The people of Zheng, upon seeing him, all fled in haste.\n\nLiezi met him and was enchanted. Returning home, he told Huzi: “I once thought your Dao was supreme, but now I see there is something even greater.”\n\nHuzi said: “I have shown you only its outward form, not its reality—how could you have truly attained the Dao? A flock of hens without a rooster—how could they lay eggs? You present the Dao to the world in opposition, so you are seen through. Come with him tomorrow, and let me show myself to him.”\n\nThe next day, Liezi brought Ji Xian to meet Huzi. Before standing firmly, Ji Xian lost himself and fled.\n\nHuzi said: “Pursue him.”\n\nLiezi chased him but could not catch up. Returning, he reported to Huzi: “He has vanished, he is lost—I could not reach him.”\n\nHuzi said: “Just now I showed him something not yet emerged from my source. I met him with emptiness and compliance, so he knew not who or what I was. He took me for drifting grass, for flowing waves—hence his flight.”\n\nThereafter, Liezi considered himself as one who had never begun to learn. For three years he did not go out, cooked for his wife, fed pigs as he would feed people, and took no special interest in affairs. He cast off carving and returned to simplicity, standing alone like an unhewn block. Amidst confusion, he remained sealed off, thus ending his days.\n\n---\n\nDo not be a vessel for fame, do not be a repository for schemes, do not take on tasks as your responsibility, do not be a master of knowledge. Embody the boundless and wander without trace; exhaust what you receive from Heaven without showing attainment.\n\nLiezi said to Huzi: “At first I thought your Dao was supreme, but now there is something even greater.”\n\nHuzi said: “I have shown you only its pattern, not its reality—how could you have truly attained the Dao? A flock of hens without a rooster—how could they lay eggs? You oppose the world with the Dao, so you are seen through. Bring him again tomorrow, and let me show myself to him.”\n\nThe next day, Liezi brought Ji Xian to meet Huzi. Upon leaving, Ji Xian said to Liezi: “Alas! Your master is dead—he will not live. It will not be ten days. I saw something strange—like damp ashes.”\n\nLiezi entered and wept, his tears soaking his lapels, as he told Huzi.\n\nHuzi said: “Just now I showed him the pattern of earth, sprouting yet neither stirring nor upright. He likely saw my blocked virtue’s mechanism. Bring him again tomorrow.”\n\nThe next day, Liezi again brought Ji Xian to meet Huzi. Upon leaving, Ji Xian said to Liezi: “Fortunate that your master met me! He is restored—fully alive. I see his blocked power.”\n\nLiezi entered and told Huzi.\n\nHuzi said: “Just now I showed him Heaven and Earth, where names and realities do not enter, and the mechanism arises from the heels. He likely saw my virtuous mechanism. Bring him again tomorrow.”\n\nThe next day, Liezi again brought Ji Xian to meet Huzi. Upon leaving, Ji Xian said to Liezi: “Your master is unsettled—I can read nothing from him. Try to settle him, and I will observe him again.”\n\nLiezi entered and told Huzi.\n\nHuzi remained empty as before.\n\nThe perfected one’s use of the mind is like a mirror: it does not send forth nor welcome, responds yet does not store—thus it can master things without harm.\n\n---\n\nChapter Six\n\nThe Lord of the Southern Sea was Shu, the Lord of the Northern Sea was Hu, and the Lord of the Center was Hundun. Shu and Hu often met in Hundun’s land, and Hundun treated them very well. Shu and Hu plotted to repay Hundun’s kindness, saying: “All men have seven openings for seeing, hearing, eating, and breathing—only he has none. Let us try to bore them for him.” Each day they bored one opening, and on the seventh day, Hundun died.\n\n---\n\n*End of the Inner Chapters of Zhuangzi, Revised Scroll Two*\n\n1. According to the received editions, *\"Only the pine and cypress alone\"* should read *\"Only the pine and cypress alone are upright.\"*\n\n2. According to the received editions, *\"Only Shun alone is upright\"* should read *\"Only Yao and Shun alone are upright.\"*\n\n3. According to the received editions, *\"By skill in mourning, he overshadowed the state of Lu\"* should read *\"By skill in conducting mourning, he overshadowed the state of Lu.\"*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "庄子内篇订正 经名：庄子内篇订正。 元人吴澄撰。 二卷。 底本出处：《正统道藏》洞神部玉诀类。 庄子内篇订正卷上 临川吴澄述 逍遥游 北瞑有鱼，其名为馄。 馄之大，不知其几千里也。 化而为乌、其名为鹏。 鹏之背、不知其几千里也。 怒而飞，其翼若垂天之云。 是乌也，海运则将徙於南瞑。 南溟者，天池也。 《齐谐》者，志怪者也。 《谐》之言曰：鹏之徙於南溟也，水击三千里，搏扶摇而上者九万里，去以六月息者也。 野马也，尘埃也，生物之以息相吹也。 天之苍苍，其正色邪？ 其远而无所至极邪？ 其视下也。 亦若是则已矣。",
      "translated_text": "**Corrected Inner Chapters of the *Zhuangzi***\n*Title:* Corrected Inner Chapters of the *Zhuangzi*\n*Author:* Wu Cheng of the Yuan dynasty\n*Two fascicles*\n*Source text:* *Daoist Canon of the Zhengtong Era*, Cavern Spirit Division, Jade Instructions Category\n\n**Corrected Inner Chapters of the *Zhuangzi*, Fascicle One**\n*Composed by Wu Cheng of Linchuan*\n\n**Free and Easy Wandering**\n\nIn the northern darkness there is a fish, and its name is *Kun*.\nThe greatness of *Kun*—who knows how many thousand *li* it spans?\nIt transforms into a bird, and its name is *Peng*.\nThe back of *Peng*—who knows how many thousand *li* it spans?\nWhen it rises in fury and takes flight, its wings are like clouds hanging from the sky.\nThis bird, when the seas shift, will journey to the southern darkness.\nThe southern darkness is the Celestial Pond.\n\nThe *Qi Xie* is a record of marvels.\nIts words say: When *Peng* journeys to the southern darkness,\nit strikes the water for three thousand *li*,\nbeats against the whirlwind to ascend ninety thousand *li*,\nand departs on the six-month breath.\n\nThe wild horses, the dust motes—all living things blow upon one another with their breaths.\nIs the deep blue of heaven its true color?\nOr is it so distant that it has no limit?\nWhen *Peng* looks down, it is just like this.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 249,
      "start_sentence": 0,
      "end_sentence": 21,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.992363929748535,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\庄子内篇订正.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "且夫水之积也不厚，则负大舟也无力。 覆杯水於坳堂之上，则芥为之舟，置杯焉则胶，水浅而舟大也。 风之积也不厚，则其负大翼也无力。 故九万里则风斯在下矣，而后乃今培风。 背负青天而莫之夭阏者，而后乃今将图南。 蜩与觉鸠笑之曰：我决起而飞，枪榆枋，时则不至，而控於地而已矣。 奚以之九万里而南为。 适莽苍者，三妆而反，腹犹果然。 适百里者，宿春根。 适千里者，三月聚粮。 之二虫又何知？ 小知不及大知，小年不及大年。 奚以知其然也？ 朝菌不知晦朔，蟪蛄不知春秋，此小年也物楚之南有冥灵者，以五百岁为春，五百岁为秋。 上古有大桩者，以八千岁为春，八千岁为秋。 而彭祖乃今以久特闻，众人匹之，不亦悲乎？ 汤之问棘也是已：穷发之北，有冥海者，天池也。 有鱼焉，其广数千里，未有知其修者，其名为馄。 有乌焉，其名为鹏，背若泰山，翼若垂天之云，搏扶摇羊角而上者九万里，绝云气，负青天，然后图南，且适南溟也。 斥鴳笑之曰：彼且奚适也？ 我腾跃而上，不过数仞而下，翱翔蓬蒿之间，此亦飞之至也。 而彼且奚适也？ 此大小之辩也。 故夫知效一官，行比一乡，德合一君，而征一国者，其自视也，亦若此矣。 而宋荣子犹然笑之。 且举世而誉之而不加劝，举世而非之而不加沮； 定乎内外之分，辩乎荣辱之竟#1； 斯已矣。 彼其於世，未数数然也。",
      "translated_text": "Moreover, when water does not accumulate in great depth, it lacks the strength to bear a great vessel. Pour a cup of water into a hollow in the hall, and a mustard seed becomes a boat for it; place the cup there, and it sticks fast, for the water is shallow and the vessel large. When wind does not accumulate in great depth, it lacks the strength to bear great wings. Thus, only when the wind lies beneath at ninety thousand *li* can it then be borne aloft. Only when one rides the back of the azure sky without obstruction can one then set one’s course for the south.\n\nThe cicada and the fledgling dove laugh at it, saying: “We burst forth and fly, darting between the elm and the sandalwood; sometimes we do not reach them and simply land on the ground. Why go ninety thousand *li* to the south?” One who travels to the nearby wilderness returns after a day’s provisions, with a belly still full. One who journeys a hundred *li* must grind grain the night before. One who travels a thousand *li* must gather three months’ provisions. What do these two creatures know?\n\nSmall knowledge does not reach great knowledge; short years do not reach long years. How do we know this is so? The morning mushroom knows not the alternation of dusk and dawn; the summer cicada knows not spring and autumn—these are short-lived things. South of the land of Chu there is the *Mingling* tree, for which five hundred years make a spring, and five hundred years an autumn. In high antiquity there was the *Dazhuang* tree, for which eight thousand years made a spring, and eight thousand years an autumn. Yet Pengzu alone is renowned for his longevity—how sad that the multitude compares itself to him!\n\nTang’s inquiry of Ji is thus: In the farthest northern reaches, beyond the lands of sparse vegetation, there is a dark sea—the Celestial Pond. There is a fish there, several thousand *li* in breadth, though none know its length; its name is *Kun*. There is a bird there, its name *Peng*, its back like Mount Tai, its wings like clouds hanging from the sky. It beats against the whirlwind, ascending ninety thousand *li*, piercing the clouds and qi, bearing the azure sky, then setting its course for the south, bound for the southern darkness.\n\nThe minnow scoffs: “Where is it going? I leap and soar, rising no more than a few *ren* before descending, wheeling among the mugwort and wormwood—this is the utmost of flight! Where is it going?” This is the distinction between great and small.\n\nThus, those whose knowledge suffices for one office, whose conduct matches one village, whose virtue pleases one lord, or whose merit wins one state—when they regard themselves, it is just like this. Yet Song Rongzi would still laugh at them. Moreover, though the whole world should praise him, he would not be encouraged; though the whole world should condemn him, he would not be disheartened. He has settled the division between inner and outer, discerned the boundary between honor and disgrace—this is all. In his relation to the world, he is not hasty.",
      "overlap_context": "n darkness is the Celestial Pond.\n\nThe *Qi Xie* is a record of marvels.\nIts words say: When *Peng* journeys to the southern darkness,\nit strikes the water for three thousand *li*,\nbeats against the whirlwind to ascend ninety thousand *li*,\nand departs on the six-month breath.\n\nThe wild horses, the dust motes—all living things blow upon one another with their breaths.\nIs the deep blue of heaven its true color?\nOr is it so distant that it has no limit?\nWhen *Peng* looks down, it is just like this.",
      "start_char": 249,
      "end_char": 773,
      "start_sentence": 22,
      "end_sentence": 50,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.05460000038147,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\庄子内篇订正.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "虽然，犹有未树也。 夫列子御风而行，冷然善也，旬有五日而后反。 彼於致福者，未数数然也。 此虽免乎行，犹有所待者也。 若夫乘天地之正，而御六气之辩，以游无穷者，彼且恶乎待哉。 故曰：至人无已，神人无功，圣人无名。 右第一章尧让天下於许由，曰：日月出矣，而爝火不息； 其於光也，不亦难乎？ 时雨降矣，而犹浸灌； 其於泽也，不亦劳乎？ 夫子立而天下治，而我犹尸之，吾自视缺然。 请致天下。 许由曰：子治天下，天下既已治也，而我犹代子，吾将为名乎？ 名者，实之宾也。 吾将为宾乎？",
      "translated_text": "Though this may be so, there remains that which has not yet been established. Liezi could ride the wind and travel, moving with chilling grace, yet after fifteen days he would return. In his pursuit of fortune, he was not hasty. Though he thus avoided walking, he still depended on something. As for one who rides the constancy of Heaven and Earth, who harnesses the transformations of the six qi, and roams the boundless—what does he depend upon? Therefore it is said: the Perfect One is without self, the Spirit Man is without achievement, the Sage is without fame.\n\n**Chapter One**\nWhen Yao offered the world to Xu You, he said: “The sun and moon have risen, yet the torch still burns—is it not difficult for its light to compare? The timely rain has fallen, yet still you irrigate—is it not laborious for its moisture to suffice? You stand and the world is ordered, yet I remain in your place—how lacking I feel in myself. I beg to yield the world to you.”\nXu You replied: “You govern the world, and the world is already well-governed. Yet I would still take your place—would I do so for fame? Fame is but the guest of reality. Would I become a guest?”",
      "overlap_context": " conduct matches one village, whose virtue pleases one lord, or whose merit wins one state—when they regard themselves, it is just like this. Yet Song Rongzi would still laugh at them. Moreover, though the whole world should praise him, he would not be encouraged; though the whole world should condemn him, he would not be disheartened. He has settled the division between inner and outer, discerned the boundary between honor and disgrace—this is all. In his relation to the world, he is not hasty.",
      "start_char": 773,
      "end_char": 996,
      "start_sentence": 51,
      "end_sentence": 65,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.796477556228638,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\庄子内篇订正.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "鹪鹩巢於深林，不过一枝； 偃鼠饮河，不过满腹。 归休乎君。 予无所用天下为。 庖人虽不治庖，尸祝不越樽俎而代之矣。 右第二章 肩吾问於连叔曰：吾闻言於接舆，大而无当，往而不反。 吾惊怖其言，犹河汉而无极也，大有径庭不近人情焉。 连叔日曰：其言谓何哉？ 曰：藐姑射之山，有神人居焉。 肌肤若冰雪，绰约若处子； 不食五谷，吸风饮露； 乘云气，御飞龙，而游乎四海之外。 其神凝，使物不疵疠，而年谷熟。 吾以是狌而不信也。 连叔曰：然。 瞽者无以与乎文章之观，聋者无以与乎钟鼓之声。 岂唯形骸有聋盲哉？ 夫知亦有之。 是其言也，犹时女也。 之人也，之德也，将磅砖万物以为一。 世蕲乎乱，孰弊焉以天下为事。 之人也，物莫之伤，大浸稽天而不溺； 大早金石流，土山焦而不热。 是其尘垢秕糠，将犹陶铸尧，舜者也，孰肯以物为事。 宋人资章甫而适诸越，越人断发文身，无所用之。 尧治天下之民，平海内之政，往见四子藐姑射之山，汾水之阳，官然丧其天下焉。 右第三章 惠子谓庄子曰：魏王贻我大瓠之种，我树之成而实五石，以盛水浆，其坚不能自举也； 剖之以为瓢，则瓠落无所容。 非不呺然大也？ 吾为其无用而掊之。 庄子曰：夫子固拙於用大矣。 宋人有善为不龟手之药者，世世以洴澼絖为事。 客闻之，请买其方百金，聚族而谋曰：我世世为洴澼絖，不过数金； 今一朝而鬻技百金，请与之。 客得之，以说昊王。 越有难，昊王使之将。 冬与越人水战，大败越人，裂地而封之。 能不龟手，一也或以封，或不免於洴澼絖，则所用之异也。 今子以五石之瓠，何不虑以为大樽而浮乎江湖，而忧其瓠落无所容，则夫子犹有蓬之心也夫。 右第四章 惠子谓庄子曰：吾有大树，人谓之榕。 其大本拥肿而不中绳墨，其小枝卷曲而不中规矩。 立之涂，匠者不顾。 今子之言，大而无用，众所同去也。 庄子曰：子独不见狸狌乎？ 卑身而伏，以候敖者。 束西跳梁，不避高下，中於机辟，死於网罟。 今夫牦牛，其大若垂天之云，此能为大矣，而不能执鼠。 今子有大树，患其无用，何不树之於无何有之乡，广莫之野，彷徨乎无为其侧，逍遥乎寝外其下。 不夭斤斧，物无害者。 无所可用，安所困苦哉。 右第五章 齐物论",
      "translated_text": "The wren nests in the deep forest, yet needs no more than a single branch; the mole drinks from the river, yet takes no more than its fill. Return and rest, my lord. What use have I for the world? Though the cook neglects his kitchen, the priest would not step beyond the altar to take his place.\n\n**Chapter Two**\nJian Wu asked Lian Shu: “I heard words from Jie Yu—grand yet without measure, sweeping yet never returning. I was startled and terrified by his speech, as if the Milky Way stretched endlessly, vast and distant, far from human sensibilities.”\nLian Shu said: “What did he say?”\nJian Wu replied: “On the distant Mount Guye dwells a spirit-man. His skin is like ice and snow, his bearing as graceful as a maiden. He eats no grain, but drinks the wind and sips the dew. He rides the clouds and qi, harnesses flying dragons, and roams beyond the four seas. His spirit is so concentrated that it keeps things free from blight, and the harvests ripen. Yet I find this wild and hard to believe.”\nLian Shu said: “Indeed. The blind cannot partake in the splendor of patterns, nor the deaf in the sound of bells and drums. Is it only the body that may be deaf and blind? The mind, too, may suffer such afflictions. His words are like yours in this moment. That man, that power—he would unify the myriad things into one. The world clamors for order, but who would exhaust himself taking the world as his task? That man—nothing harms him. Though the great floods rise to the heavens, he does not drown; though drought melts metal and stone and scorches the mountains, he does not burn. From his dust and chaff, one could mold even a Yao or Shun—who would trouble himself with worldly affairs? The people of Song carried ceremonial caps to Yue, but the Yue, with shorn hair and tattooed bodies, had no use for them. Yao governed the people of the world and brought peace to the realm, yet when he went to see the Four Masters on Mount Guye north of the Fen River, he returned empty, having lost his grasp on the world.”\n\n**Chapter Three**\nHui Shi said to Zhuangzi: “The King of Wei gave me seeds of a great gourd. I planted them, and they grew to hold five *dan*. When I used it to hold water, its strength was not enough to lift itself. When I split it to make a ladle, its size was so vast it had no place to fit. Was it not hollow and large? Yet I deemed it useless and smashed it.”\nZhuangzi said: “You are truly inept at putting great things to use. There was a man of Song skilled in making a salve that prevented chapped hands. For generations, his family made their living by washing silk. A traveler heard of it and offered a hundred gold pieces for the formula. The family gathered and deliberated: ‘For generations, we have washed silk and earned no more than a few coins. Now, in a single morning, we could sell this skill for a hundred gold pieces—let us give it to him.’ The traveler obtained it and presented it to the King of Wu. When Yue raised a rebellion, the King of Wu sent him to lead the troops. In winter, they fought on the water, and he utterly defeated Yue, winning lands and a fief. The same salve that prevented chapped hands—one man used it to gain a fief, while another remained washing silk. The difference lay in how it was used. Now, with your five-*dan* gourd, why not consider making it into a great float and drifting upon the rivers and lakes? Instead, you fret that it is too large to hold anything—your mind is still as tangled as mugwort.”\n\n**Chapter Four**\nHui Shi said to Zhuangzi: “I have a great tree, called a *rong*. Its trunk is gnarled and swollen, unfit for the carpenter’s line; its branches are twisted and bent, unfit for the compass and square. It stands by the road, yet no craftsman glances at it. Now, your words are grand but useless—just as the crowd rejects them.”\nZhuangzi said: “Have you never seen a wildcat or weasel? It crouches low to lie in wait, then leaps east and west, heedless of high or low, only to be caught in a trap or snare. Now consider the yak—its size is like a cloud hanging from the sky. It is great indeed, yet it cannot catch a mouse. You have a great tree and worry it is useless—why not plant it in the land of Nothingness, the vast wilds, where you may wander carefree at its side, or lie at ease beneath its shade? No axe will fell it, and nothing will harm it. If it has no use, how can it come to grief?”",
      "overlap_context": "isen, yet the torch still burns—is it not difficult for its light to compare? The timely rain has fallen, yet still you irrigate—is it not laborious for its moisture to suffice? You stand and the world is ordered, yet I remain in your place—how lacking I feel in myself. I beg to yield the world to you.”\nXu You replied: “You govern the world, and the world is already well-governed. Yet I would still take your place—would I do so for fame? Fame is but the guest of reality. Would I become a guest?”",
      "start_char": 996,
      "end_char": 1868,
      "start_sentence": 66,
      "end_sentence": 120,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.97302532196045,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\庄子内篇订正.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "南郭子綦隐几而坐，仰天而嘘，咯焉似丧其耦。 颜成子游立侍乎前，曰：何居乎？ 形固可使如槁木，而心固可使如死灰乎？ 今之隐几者，非昔之隐几者也。 子綦曰：偃，不亦善乎，而问之也。 今者吾丧我，汝知之乎？ 女闻人籁而未闻地籁； 女闻地籁而未闻天籁夫？ 子游曰：敢间其方。 子綦曰：夫大块噫气，其名为风。 是唯无作，作则万窍怒呺。 而独不闻之参参乎？ 山林之畏佳，大木百围之窍穴，似鼻，似口，似耳，似枅，似圈，似臼，似洼，似污者； 激者，謞者，叱者，吸者，叫者，号者，突者，咬者。 前者唱于而随者唱隅。 泠风则小和，飘风则大和，厉风济则众窍为虚。 而独不见之调调之刁刁乎？ 子游曰：地籁则众窍是已，人籁则比竹是已。 敢间天籁。 子綦曰：夫吹万不同，而使其自己也。 咸其自取，怒者其谁邪？ 右第一章 大知闲闲，小知间间； 大言炎炎，小言詹詹。 其寐也魂交，其觉也形开，与接为构，日以心斗。 缦者，窖者，密者，小恐惴惴，大恐缦缦。 其发若机栝，其司是非之谓也； 其留如诅盟，其守胜之谓也； 其杀如秋冬，以言其日消也； 其溺之所为之，不可使复之也； 其厌也如缄，以言其老洫也； 近死之心，莫使复阳也。 喜怒哀乐，虑叹变愁，姚佚启态。 乐出虚，蒸成菌。 日夜相代乎前，而莫知其所萌。 已乎，已乎。 旦暮得此，其所由以生乎？ 非彼无我，非我无所取。 是亦近矣，而不知其所为使。 若有真宰，而特不得其眹。 可行已信； 而不见其形； 有情而无形。",
      "translated_text": "Nan Guo Ziqi leaned against his armrest and sat, gazing upward to exhale, his breath coming in gasps as though he had lost his counterpart. Yan Cheng Ziyou stood in attendance before him and asked: “What is this? Can the body truly be made like withered wood, and the heart like dead ashes? Yet the one who now leans on the armrest is not the same as the one who did so before.”\n\nZiqi said: “Yan, is it not well that you ask this? Today I have lost myself—do you understand? You have heard the *lai* of man but not the *lai* of earth; you have heard the *lai* of earth but not the *lai* of heaven.”\n\nZiyou said: “I venture to ask the method.”\n\nZiqi said: “The great clod breathes forth *qi*, and its name is wind. It does nothing, yet when it stirs, the myriad hollows roar in fury. Have you alone not heard its ceaseless murmur? The towering peaks of mountains and forests, the hollows of great trees a hundred spans around—some resemble noses, some mouths, some ears, some beams, some rings, some mortars, some pools, some puddles. Some rush forth, some wail, some scold, some inhale, some shriek, some howl, some moan, some bite. The first sings *yu*, and the followers sing *yu*. A gentle breeze elicits a faint harmony; a whirlwind, a great harmony. When the fierce gale subsides, all the hollows fall silent. Have you alone not seen their trembling and quivering?”\n\nZiyou said: “The *lai* of earth is simply the harmony of the myriad hollows; the *lai* of man is the harmony of bamboo pipes. I venture to ask about the *lai* of heaven.”\n\nZiqi said: “The wind blows in ten thousand different ways, yet each finds its own nature. All take of themselves—who then stirs them to anger?”\n\n---\n\nGreat knowledge is broad and unhurried; petty knowledge is narrow and restless. Grand words blaze forth; petty words chatter on. In sleep, their spirits intertwine; awake, their forms stir. They engage in constant strife, battling daily with their hearts. Some are slow, some cunning, some secretive. Small fears leave them trembling; great fears leave them dazed. Their words fly forth like arrows from a crossbow, ever ready to judge right and wrong. They cling like those bound by oaths, ever guarding their victories. They wither like autumn and winter, their days dwindling away. They drown in their own doings, never to return. They grow weary like a sealed vessel, aging and stagnant. The heart near death cannot be revived. Joy and anger, sorrow and delight, care and lament, fickleness and ease, exuberance and languor—like music from the void, like mushrooms born of steam. Day and night they replace one another before us, yet none know whence they sprout. Enough, enough! Morning and evening, this is how they come to be. Without that, there is no self; without the self, nothing is grasped. This is near indeed, yet we know not what moves it. As if there were a true master, yet no trace of it can be found. It acts and is trusted, yet its form is unseen. It has reality but no form.”\n\n---\n\n**Right, Chapter One**",
      "overlap_context": "ow to lie in wait, then leaps east and west, heedless of high or low, only to be caught in a trap or snare. Now consider the yak—its size is like a cloud hanging from the sky. It is great indeed, yet it cannot catch a mouse. You have a great tree and worry it is useless—why not plant it in the land of Nothingness, the vast wilds, where you may wander carefree at its side, or lie at ease beneath its shade? No axe will fell it, and nothing will harm it. If it has no use, how can it come to grief?”",
      "start_char": 1868,
      "end_char": 2447,
      "start_sentence": 121,
      "end_sentence": 163,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.617677927017212,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\庄子内篇订正.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "百骸、九窍、六藏，赅而存焉，吾谁与为亲？ 汝皆说之乎？ 其有私焉？ 如是皆有为臣妾乎？ 其臣妾不足以相治乎？ 其递相为君臣乎？ 其有真君存焉？ 如求得其情与不得，元益损乎其真。 一受其成形，不亡以待尽。 与物相刃相靡，其行尽如驰，而莫之能止，不亦悲乎。 终身役役而不见其成功； 然疲役而不知其所归，可不哀耶。 人谓之不死，奚益。 其形化，其心与之然，可不谓大哀乎？ 人之生也，固若是芒乎？ 其我独芒，而人亦有不芒者乎？ 夫随其诚心而师之，谁独且无师乎？ 奚必知代而心自取者有之？ 愚者与有焉。 未成乎心而有是非，是今日适越而昔至也。 是以元有为有。 尤有为有，虽有神禹，且不能知，吾独且奈何哉。 夫言非吹也，言者有言，其所言者特未定也。 果有言邪？ 其未尝有言邪？ 其以为异於鷇音，亦有辩乎？ 其无辩乎？ 道恶乎隐而有真伪？ 言恶乎隐而有是非？ 道恶乎往而不存？ 言恶乎存而不可？ 道隐於小成，言隐於荣华。 故有儒墨之是非，以是其所非而非其所是。 欲是其所非而非其所是，则莫若以明。 物元非彼，物无非是。 自彼则不见，自知#3则知之。 故曰彼出於是，是亦因彼。 彼是方生之说也，虽然，方生方死，方死方生； 方可方不可，方不可方可。 因是因非，因非因是。 是以圣人不由，而照之于天，亦因是也。 是亦彼也，彼亦是也。 彼亦一是非，此亦一是非。",
      "translated_text": "The hundred bones, nine orifices, and six viscera—all are complete within me, yet with whom should I feel closest? Do you delight in all of them equally? Or do some hold a private claim? Are they all like servants and concubines? If so, are these servants and concubines incapable of governing one another? Do they take turns as lord and subject? Or is there a true lord residing within? Whether one seeks to know its nature or not, does it diminish or harm the truth?\n\nOnce receiving this completed form, it does not perish until its end. It grinds and wears against things, its course racing like a galloping steed, yet nothing can halt it—is this not sorrowful? A lifetime of toil without seeing success, wearily laboring without knowing where it leads—can this not be pitied? People call it \"not dying,\" but what does it avail? The body transforms, the heart follows suit—can this not be called great sorrow?\n\nIs human life inherently so deluded? Am I alone in my confusion, or are there others who are not? If one follows the sincerity of the heart and takes it as teacher, who is without a teacher? Why must one possess knowledge of succession to have a heart that chooses for itself? Even fools share in this. To form judgments before the heart is fully formed—this is like setting out for Yue today and arriving yesterday. Thus, to assert that something *is* is to assert that something *is not*. To insist that something *is not* is still to assert that something *is*. Even if one were as spiritually attuned as Yu the Great, one could not know—what then can I do?\n\nWords are not like the wind’s breath. Speakers have their say, yet what they speak remains unsettled. Is there truly speech? Or has there never been speech? Do words differ from the chirping of fledglings, or is there a distinction? Or is there no distinction?\n\nWhere does the Dao conceal itself to produce truth and falsehood? Where do words conceal themselves to produce right and wrong? Where does the Dao go that it ceases to exist? Where do words remain that they become untenable? The Dao is obscured by partial attainment; words are obscured by florid ornament. Thus arise the Confucians and Mohists, each affirming what the other denies and denying what the other affirms. To affirm what they deny and deny what they affirm, nothing surpasses clarity.\n\nThings are not inherently \"that,\" nor are they inherently \"this.\" From \"that,\" one does not see; from self-knowledge, one knows. Thus it is said: \"That\" emerges from \"this,\" and \"this\" likewise depends on \"that.\" This is the theory of the mutual arising of \"that\" and \"this.\" Yet even as \"this\" arises, \"that\" dies; as \"that\" dies, \"this\" arises. Even as \"this\" is affirmed, \"that\" is denied; as \"that\" is denied, \"this\" is affirmed. Therefore, the sage does not proceed by such distinctions but illuminates all by the light of Heaven—this too is a reliance on \"this.\"\n\n\"This\" is also \"that,\" and \"that\" is also \"this.\" \"That\" has its own right and wrong, and \"this\" has its own right and wrong. Is there truly a distinction between \"that\" and \"this\"? Or is there no distinction?",
      "overlap_context": "r—like music from the void, like mushrooms born of steam. Day and night they replace one another before us, yet none know whence they sprout. Enough, enough! Morning and evening, this is how they come to be. Without that, there is no self; without the self, nothing is grasped. This is near indeed, yet we know not what moves it. As if there were a true master, yet no trace of it can be found. It acts and is trusted, yet its form is unseen. It has reality but no form.”\n\n---\n\n**Right, Chapter One**",
      "start_char": 2447,
      "end_char": 2975,
      "start_sentence": 164,
      "end_sentence": 206,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.600083351135254,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\庄子内篇订正.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "果且有彼是乎哉？ 果且无彼是乎哉？ 彼是莫得其偶，谓之道枢。 枢始得其环中，以应无穷。 是亦一无穷，非亦一无穷也。 故曰：莫若以明。 以指喻指之非指，不若以非指喻指之非指也； 以马喻马之非马，不若以非马喻马之非马也。 天地一指也，万物一马也。 可乎可，不可而入，且为颠为灭，为崩为蹶； 心和而出，且为声为名，为妖为孽，彼且为婴儿，亦与之为婴儿； 彼且为无町畦，亦与之为无町畦； 彼且为无崖，亦与之为无崖。 达之，入於无疵。 汝不知夫螳螂乎？ 怒其臂以当车辙，不知其不胜任也，是其才之美者也。 戒之，慎之。 积伐而美者以犯之，几矣。 汝不知夫养虎者乎？ 不敢以生物与之，为其杀之之怒也； 不敢以全物与之，为其决之之怒也。 时其饥饱，达其怒心。 虎之与人异类，而媚养己者，顺也； 故其杀者，逆也。 夫爱马者，以筐盛矢，以蜃盛溺。 适有蚊虻仆缘，而批之不时，财缺街毁首碎胸。 意有所至而爱有所亡，可不慎邪。 右第三章 匠石之齐，至乎曲辕，见砾社树。 其大蔽牛#4； 絮之百围，其高临山十仞而后有枝，其可以为舟者旁十数。 观者如市。 匠伯不顾，遂行不辍。",
      "translated_text": "Does \"that\" and \"this\" truly exist? Or do they truly not exist? Where \"that\" and \"this\" find no counterpart, there lies the pivot of the Dao. Once the pivot finds the center of the ring, it responds to the boundless. \"This\" too is boundless, and \"not-this\" too is boundless. Thus it is said: nothing surpasses clarity.\n\nTo illustrate the non-finger-ness of a finger by means of a finger is not as good as illustrating the non-finger-ness of a finger by means of a non-finger. To illustrate the non-horse-ness of a horse by means of a horse is not as good as illustrating the non-horse-ness of a horse by means of a non-horse. Heaven and earth are one finger; the myriad things are one horse.\n\nWhat can be affirmed, affirm; what cannot be affirmed, enter into it—yet this is to invite collapse and ruin, disintegration and downfall. When the heart emerges in harmony, it becomes sound and name, omen and calamity. If he becomes an infant, join him in infancy; if he becomes boundless as a field, join him in boundlessness; if he becomes without limit, join him in limitlessness. Penetrate this, and enter into flawlessness.\n\nDo you not know the mantis? Enraged, it thrusts its arms to block the chariot wheel, unaware of its incapacity—such is the beauty of its talent. Beware, be cautious. To accumulate praise and beauty and then offend is perilous indeed.\n\nDo you not know those who raise tigers? They dare not feed them living creatures, for fear of provoking their killing rage; they dare not feed them whole creatures, for fear of provoking their tearing rage. They time their hunger and satiety, understanding the heart of their anger. Though tigers and humans are of different kinds, tigers fawn upon those who feed them—this is compliance. Thus, those they kill act in opposition.\n\nThose who love horses use baskets to collect their dung and clamshells to collect their urine. Yet when flies and gnats alight upon them and they are struck untimely, the horse may bite through the bit, break its bridle, and smash its head and chest. Though the intention is care, the love brings loss—can one not be cautious?\n\n---\n\nIn the third chapter, when Carpenter Shi reached Qi and arrived at Qu Yuan, he saw a community shrine tree. Its girth could shade an ox, its trunk measured a hundred spans, and its height towered above the mountain by ten *ren* before branches appeared. A dozen or so of its side growths could be made into boats. Spectators gathered like a marketplace. The master carpenter did not glance at it but continued on his way without pause.",
      "overlap_context": " even as \"this\" arises, \"that\" dies; as \"that\" dies, \"this\" arises. Even as \"this\" is affirmed, \"that\" is denied; as \"that\" is denied, \"this\" is affirmed. Therefore, the sage does not proceed by such distinctions but illuminates all by the light of Heaven—this too is a reliance on \"this.\"\n\n\"This\" is also \"that,\" and \"that\" is also \"this.\" \"That\" has its own right and wrong, and \"this\" has its own right and wrong. Is there truly a distinction between \"that\" and \"this\"? Or is there no distinction?",
      "start_char": 2975,
      "end_char": 3422,
      "start_sentence": 207,
      "end_sentence": 239,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.811506032943726,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\庄子内篇订正.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "弟子厌观之，走及匠石，曰：自吾执斧斤以随夫子，未尝见材如此其美也。 先生不肯视，行不辍，何邪？ 曰：已矣，勿言迄矣。 散木也。 以为舟则沈，以为棺椁则速腐，以为器则速毁，以为门户则掖樠，以为柱则蠹，是不材之木也。 无所可用，故能若是之寿。 匠石归，砾杜见梦曰：女将恶乎比予哉？ 若将比予於文木耶？ 夫祖梨橘柚，果蕨之属，溃熟则剥则辱。 大枝折，小枝泄一此以其能苦其生者也。 故不终其天年而中道夭，自舍击於世俗者也。 物莫不若是。 且予求无所可用久矣。 几死，乃今得之，为予大用。 使予也而有用，且得有此大也邪？ 且也若与予也皆物也，奈何哉其相物也。 而几死之散人，又恶知散木。 匠石觉而诊其梦。 弟子曰；",
      "translated_text": "The disciple, eager to examine it, ran to catch up with Carpenter Shi and said: \"Since I took up the axe and followed you, Master, I have never seen timber so magnificent as this. Yet you would not deign to look at it and walked on without pause—why?\"\n\nCarpenter Shi replied: \"Enough! Say no more. It is but a worthless tree. If made into a boat, it would sink; if made into a coffin or outer casket, it would rot swiftly; if made into vessels, they would break quickly; if used for doors or gates, it would ooze sap; if used for pillars, it would be eaten by worms. It is a tree of no use whatsoever, and thus it has attained such longevity.\"\n\nUpon returning home, Carpenter Shi dreamed that the tree of the community shrine appeared to him and said: \"To what would you compare me? Would you liken me to the so-called 'fine timber'? Consider the hawthorn, pear, orange, pomelo, and other fruit-bearing trees: when their fruits ripen, they are stripped and humiliated. Their great branches break, their small branches are torn—this is because their abilities bring suffering to their lives. Thus they do not fulfill their natural span but perish midway, self-destructing through their collision with the common world. All things are like this. As for me, I have sought to be of no use for a long time. Nearly dead, I have at last attained it—this is my great usefulness. Had I been of use, would I have grown so vast? Moreover, you and I are both things—how could you judge me thus? And you, a nearly dead worthless man, what could you know of a worthless tree?\"\n\nCarpenter Shi awoke and pondered his dream. His disciple then said:",
      "overlap_context": "ion is care, the love brings loss—can one not be cautious?\n\n---\n\nIn the third chapter, when Carpenter Shi reached Qi and arrived at Qu Yuan, he saw a community shrine tree. Its girth could shade an ox, its trunk measured a hundred spans, and its height towered above the mountain by ten *ren* before branches appeared. A dozen or so of its side growths could be made into boats. Spectators gathered like a marketplace. The master carpenter did not glance at it but continued on his way without pause.",
      "start_char": 3422,
      "end_char": 3706,
      "start_sentence": 240,
      "end_sentence": 258,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.027613401412964,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\庄子内篇订正.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "趣取无用，则为社何邪？ 曰：密。 若无言。 彼亦直寄焉。 以为不知己者诟厉也。 不为社者，且几有万乎。 且也彼其所保与众异，而以义喻之，不亦远乎。 右第四章 南伯子蔡游乎商之丘，见大木焉有异，结驷千乘，隐将花其所籁。 子綦曰：此何木也哉？ 此必有异材夫。 仰而视其细枝，则拳曲而不可以为栋梁； 俯而视其大根，则轴解而不可以为棺椁； 姑其叶，则口烂而为伤； 嗅之，则使人狂醒，三#5日而不已。 子莱曰：此果不材之木也，以至於此其大也。 嗟乎神人以此不材。",
      "translated_text": "\"To seek usefulness through uselessness—then why serve as the sacred tree?\"\n\n\"Hush. Say no more. It merely lodges there, enduring the scorn of those who know it not. Were it not the sacred tree, would it have grown so vast? Moreover, what it preserves differs from the common—yet you compare it by human standards. Is this not far off?\"\n\n**Chapter Four**\n\nNanbo Zicai wandered in Shangqiu and saw a great tree unlike any other. A thousand chariots could shelter beneath it, its canopy shading all within its rustling leaves.\n\nZiqi said: \"What tree is this? It must possess extraordinary qualities.\"\n\nLooking up at its slender branches, he saw they were gnarled and unfit for beams or rafters. Looking down at its massive roots, he saw they were split and useless for coffins or outer caskets. Licking its leaves, he found they blistered the mouth. Smelling them, he was struck with a madness that lasted three days without cease.\n\nZilai said: \"This is truly a worthless tree—yet it has grown so vast! Ah! The spirit-like person takes this as worthlessness.\"",
      "overlap_context": "pan but perish midway, self-destructing through their collision with the common world. All things are like this. As for me, I have sought to be of no use for a long time. Nearly dead, I have at last attained it—this is my great usefulness. Had I been of use, would I have grown so vast? Moreover, you and I are both things—how could you judge me thus? And you, a nearly dead worthless man, what could you know of a worthless tree?\"\n\nCarpenter Shi awoke and pondered his dream. His disciple then said:",
      "start_char": 3706,
      "end_char": 3922,
      "start_sentence": 259,
      "end_sentence": 275,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.9638965129852295,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\庄子内篇订正.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "宋有荆氏者，宜楸栢桑。 其栱把而上者，求狙猴之找者斩之； 三围四围，求高名之丽者斩之； 七围八围，贵人富商之家求禅傍者斩之。 故未终其天年而中道之天於斧斤。 此材之患也。 故解之以牛之白颡者，与豚之亢鼻者，与人有痔病者，不可以适河。 此皆巫祝以知之矣，所以为不祥也。 此乃神人之所以为大祥也。 右第五章 支离疏者，颐隐於齐，肩高於顶，会撮指天，五管在上，两髁为胁，挫针治繲，足以蝴口； 鼓荚播精，足以食十人。 上征武士，则支离攘臂於其间#6。 上有大役，则支离以有常疾不受功。 上与病者粟，则受三锺与十束薪。 夫乎不可。 道行之而成，物谓之而然。",
      "translated_text": "**Chapter Five**\n\nIn the state of Song there was a region called Jing, where catalpa, cypress, and mulberry thrived. Those trees whose trunks were slender enough to encircle with one’s arms were felled by those seeking wood for monkey perches; those three or four spans in girth were felled by those seeking timber for grand and ornate halls; those seven or eight spans in girth were felled by the households of nobles and wealthy merchants seeking beams and pillars. Thus, none lived out their natural years but were cut down midway by axes. Such is the calamity of usefulness.\n\nNow, the ox with a white forehead, the pig with an upturned snout, or the man with hemorrhoids—none may be offered to the river. The shamans and priests all know this, for these are deemed inauspicious. Yet to the spirit-like person, these are precisely what make for great auspiciousness.\n\nThere was one called Zhili Shu, whose chin nestled into his navel, whose shoulders towered above his crown, whose topknot pointed to the heavens, whose five organs were inverted above, whose thighs framed his ribs. Mending needles and washing clothes, he earned enough to feed himself; sifting chaff and winnowing grain, he earned enough to feed ten. When the ruler conscripted soldiers, Zhili waved his arms among them; when the ruler launched great labor projects, Zhili, citing his chronic ailment, was exempted from service. When the ruler distributed grain to the infirm, he received three bushels and ten bundles of firewood. Ah! Though his body was broken, the Way moved through him and was fulfilled—things called it so, and so it was.",
      "overlap_context": "It must possess extraordinary qualities.\"\n\nLooking up at its slender branches, he saw they were gnarled and unfit for beams or rafters. Looking down at its massive roots, he saw they were split and useless for coffins or outer caskets. Licking its leaves, he found they blistered the mouth. Smelling them, he was struck with a madness that lasted three days without cease.\n\nZilai said: \"This is truly a worthless tree—yet it has grown so vast! Ah! The spirit-like person takes this as worthlessness.\"",
      "start_char": 3922,
      "end_char": 4185,
      "start_sentence": 276,
      "end_sentence": 292,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.306552171707153,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\庄子内篇订正.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "恶乎然？ 然於然。 恶乎不然？ 不然於不然。 物固有所然，物固有所可。 无物不然，无物不可。 故为是举筳与楹； 厉与西施，忮恑橘怪，道通为一。 其分也，成也； 其成也，毁也。 凡物无成与毁，复通为一。 唯达者知通为一，为是不用而寓诸庸。 庸也者，用也； 用也者，通也； 通也者，得也。 适得而几矣。 因是已，已而不知其然谓之道。 劳神明为一，而不知其同也，谓之朝三。 何谓朝三？ 曰：狙公赋芋曰：朝三而暮四。 众狙皆怒。 曰：然则朝四而暮三。 众祖皆悦。 名实未亏而喜怒为用，亦因是也。 提以圣人和之以是非而休乎天钧，是之谓两行。 古之人，其知有所至矣。 恶乎至？",
      "translated_text": "How does this come to be? It is so because it is so. How does this not come to be? It is not so because it is not so. Things inherently have their \"so-ness,\" things inherently have their \"rightness.\" There is nothing that is not so, nothing that is not right. Thus, whether it be a bamboo mat or a pillar, a leper or Xi Shi, the perverse and the uncanny, the twisted and the monstrous—all are united in the Dao as one.\n\nTheir division is their completion; their completion is their destruction. Yet for all things, there is neither completion nor destruction, for they return to unity in the Dao. Only the enlightened understand this unity, and so they do not employ it but rest in the ordinary. The ordinary is function; function is penetration; penetration is attainment. Attaining this, one is near the mark.\n\nFollowing this, ceasing to act while unaware of why it is so—this is the Dao. To exhaust one’s spirit in striving for unity while failing to recognize their sameness—this is called \"morning three.\" What is \"morning three\"? It is said: A monkey keeper distributed chestnuts, saying, \"Three in the morning and four at dusk.\" The monkeys were all enraged. He then said, \"Then four in the morning and three at dusk.\" The monkeys were all pleased. Yet the substance remained unchanged, and their joy and anger were put to use—this too follows the same principle.\n\nThus, the sage harmonizes with right and wrong, resting in the balance of heaven, which is called \"walking two paths.\" The ancients, in their knowledge, attained a certain limit. Where did they attain it?",
      "overlap_context": "clothes, he earned enough to feed himself; sifting chaff and winnowing grain, he earned enough to feed ten. When the ruler conscripted soldiers, Zhili waved his arms among them; when the ruler launched great labor projects, Zhili, citing his chronic ailment, was exempted from service. When the ruler distributed grain to the infirm, he received three bushels and ten bundles of firewood. Ah! Though his body was broken, the Way moved through him and was fulfilled—things called it so, and so it was.",
      "start_char": 4185,
      "end_char": 4441,
      "start_sentence": 293,
      "end_sentence": 319,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.977069139480591,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\庄子内篇订正.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "有以为未始有物者，至矣，尽矣，不可以加矣。 其次，以为有物矣，而未始有封也。 其次，以为有封焉，而未始有是非也。 是非之彰也，道之所以亏也。 道之所以亏，爱之所以成。 果且有成与亏乎哉？ 果且无成与亏乎哉？ 有成与亏，故昭氏之鼓琴也。 无成与亏，故昭氏之不鼓琴也。 昭文之鼓琴也，师旷之枝策也，惠子之据梧也。 三子之知，几乎皆其盛者也，故载之末年。 唯其好之也，以异於彼； 其好之也，欲以明之。 彼非所明而明之，故以坚白之昧终。 而其子又以文之纶终，终身无成。 若是而可谓成乎？ 虽然亦成也；",
      "translated_text": "One holds that things have never yet begun to exist—this is the ultimate, the utmost, beyond which nothing can be added. Next, one holds that things exist, yet boundaries have never yet arisen. Next, one holds that boundaries exist, yet right and wrong have never yet appeared. The manifestation of right and wrong is the diminishment of the Dao. The diminishment of the Dao is the formation of partiality. Can there truly be formation and diminishment? Can there truly be neither formation nor diminishment? Where there is formation and diminishment, there is Master Zhao’s zither-playing. Where there is neither formation nor diminishment, there is Master Zhao’s not playing the zither. Master Zhao’s zither-playing, Music Master Kuang’s wielding of the baton, and Master Hui’s leaning against the catalpa tree—these three men’s knowledge nearly reached its fullest, and so their deeds are recorded at life’s end. Yet because they were fond of it, they differed from others; because they were fond of it, they sought to illuminate it. What they sought to illuminate was not what could be illuminated, and so they ended in the obscurity of \"hard and white.\" And their sons, in turn, spent their lives weaving the threads of their fathers’ arts, yet achieved nothing. Could this be called achievement? Even so, it is also achievement.",
      "overlap_context": "chestnuts, saying, \"Three in the morning and four at dusk.\" The monkeys were all enraged. He then said, \"Then four in the morning and three at dusk.\" The monkeys were all pleased. Yet the substance remained unchanged, and their joy and anger were put to use—this too follows the same principle.\n\nThus, the sage harmonizes with right and wrong, resting in the balance of heaven, which is called \"walking two paths.\" The ancients, in their knowledge, attained a certain limit. Where did they attain it?",
      "start_char": 4441,
      "end_char": 4671,
      "start_sentence": 320,
      "end_sentence": 336,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.084904909133911,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\庄子内篇订正.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "若是而不可谓成乎？ 物与我无成也。 是故滑疑之耀，圣人之所图也。 为是不用而寓诸庸，此之谓以明。 今且有言於此，不知其与是类乎？ 其与是不类乎？ 类与不类，相与为类，则与彼无以异矣。 虽然，请尝言之。 有始也者，有未始有始也者，有未始有夫未始有始也者。 有有也者，有无也者，有未始有无也者，有未始有夫未始有无也者。 俄而有无矣，而未知有无之果孰有孰无也。 今我则已有谓矣，而未知吾所谓之其果有谓乎，其果无谓乎？ 天下莫大於秋毫之末，而太山为小； 莫寿乎殇子，而彭祖为夭。 天地与我并生，而万物与我为一。 既已为一矣，且得有言乎？ 既已谓之一矣，且得无言乎？ 一与言为二，二与一为三。 自此以往，巧历不能得，而况其凡乎？ 故自无适有以至於三，而况自有适有乎？ 无适焉，因是已。",
      "translated_text": "Could this, then, not be called achievement? Yet things and I have no achievement.\n\nThus, the dazzling confusion of the slippery doubt—this is what the sage contemplates. To act without employing it and lodge it in the commonplace: this is called \"illuminating through obscurity.\"\n\nNow, suppose there were a saying here—would it be of the same kind as this? Or not of the same kind? Whether of the same kind or not, if they are taken together as a kind, then they differ in no way from that. Even so, let me try to speak of it.\n\nThere is a beginning; there is a time before that beginning; there is a time before the time before that beginning. There is being; there is non-being; there is a time before that non-being; there is a time before the time before that non-being. Suddenly there is being and non-being, yet we do not know which of the two—being or non-being—is truly being or truly non-being.\n\nNow, I have already spoken, yet I do not know whether what I have spoken is truly speaking or truly not speaking. Nothing in the world is greater than the tip of an autumn hair, yet Mount Tai is small; nothing is longer-lived than a child who dies young, yet Pengzu died prematurely. Heaven and earth were born together with me, and the myriad things and I are one.\n\nSince we are already one, can there be speech? Since we have already called it \"one,\" can there be no speech? The one and speech make two; two and the one make three. From this point onward, even the most skillful reckoner cannot arrive at a number—how much less can the ordinary person? Thus, from non-being to being, we reach three—how much more so from being to being? Let there be no going toward anything; follow this and be done.",
      "overlap_context": "wledge nearly reached its fullest, and so their deeds are recorded at life’s end. Yet because they were fond of it, they differed from others; because they were fond of it, they sought to illuminate it. What they sought to illuminate was not what could be illuminated, and so they ended in the obscurity of \"hard and white.\" And their sons, in turn, spent their lives weaving the threads of their fathers’ arts, yet achieved nothing. Could this be called achievement? Even so, it is also achievement.",
      "start_char": 4671,
      "end_char": 4988,
      "start_sentence": 337,
      "end_sentence": 357,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.203670024871826,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\庄子内篇订正.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "夫道未始有封，言未始有常，为是而有吵也，请言其吵：有左，有右，有伦，有义，有分，有辩，有竞，有争，此之谓八德。 六合之外，圣人存而不论； 六合之内，圣人论而不议。 春秋经世先王之志，圣人议而不辩。 故分也者，有不分也； 辩也者，有不辩也。 曰：何也？ 圣人怀之，众人辩之以相示也。 故曰辩也者，有不见也。 夫大道不称，大辩不言，大仁不仁，大廉不嗛，大勇不忮。 道昭而不道，言辩而不及，仁常而不成，廉清而不信，勇忮而不成。 五者园而几向方矣。 故知止其所不知，至矣。 孰知不言之辩，不道之道？ 若有能知，此之谓天府。 注焉而不满，酌焉而不竭，而不知其所由来，此之谓保光。 故昔者尧问於舜曰：我欲伐宗、脍、胥敖，南面而不释然。 其故何也。",
      "translated_text": "The Dao has never had boundaries, and speech has never had constancy. Yet because of this, there arises contention. Let me speak of this contention: there is left, there is right; there are hierarchies, there are principles; there are divisions, there are distinctions; there is competition, there is strife—these are called the eight virtues.\n\nBeyond the six directions, the sage preserves but does not discourse; within the six directions, the sage discourses but does not debate. The *Spring and Autumn Annals* and the records of former kings’ aspirations—the sage debates but does not argue.\n\nThus, division implies what is undivided; distinction implies what is undistinguished. One asks: why? The sage holds it within, while the multitude debates it to display to one another. Therefore, it is said: distinction implies what is unseen.\n\nThe great Dao is not named; great disputation speaks not; great benevolence is not benevolent; great integrity is not modest; great courage does not harm. When the Dao is made manifest, it is no longer the Dao; when speech is disputatious, it does not reach; when benevolence is constant, it does not succeed; when integrity is pure, it is not trusted; when courage is harmful, it does not succeed. These five, when rounded, nearly approach squareness.\n\nThus, to know where to stop in what one does not know—this is perfection. Who knows the disputation of no speech, the Dao of no Dao? If one can know this, it is called the Heavenly Storehouse. Pour into it and it is never full; draw from it and it never runs dry, yet one does not know whence it comes—this is called preserving the light.\n\nTherefore, in ancient times, Yao asked Shun: \"I wish to attack Zong, Kuai, and Xu’ao, yet when I sit facing south, I feel unsettled. What is the reason?\"",
      "overlap_context": "ere born together with me, and the myriad things and I are one.\n\nSince we are already one, can there be speech? Since we have already called it \"one,\" can there be no speech? The one and speech make two; two and the one make three. From this point onward, even the most skillful reckoner cannot arrive at a number—how much less can the ordinary person? Thus, from non-being to being, we reach three—how much more so from being to being? Let there be no going toward anything; follow this and be done.",
      "start_char": 4988,
      "end_char": 5288,
      "start_sentence": 358,
      "end_sentence": 375,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.249381303787231,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\庄子内篇订正.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "舜曰：夫三子者，犹存乎蓬艾之间。 若不释然。 何哉？ 昔者十日并出，万物皆照，而况德之进乎日者乎？ 右第二章 啮缺问乎王倪曰：子知物之所同是乎？ 曰：吾恶乎知之。 子知予之所不知邪？ 曰：吾恶乎知之。 然则物无知邪？ 曰：吾恶乎知之？ 虽然尝试言之。 庸讵知吾所谓知之非不知邪？ 庸讵知吾所谓不知之非知邪？ 且吾尝试问乎女，民湿寝则腰疾偏死，□然乎哉？ 木处则惴栗恂惧，猨猴然乎哉？ 三者孰知正处？ 民食刍豢，麋鹿食荐，卿且甘带，鹧鸦耆鼠，四者孰知正味。 猨编狙以为雌，麋与鹿交，□与鱼游。 毛嫱、丽姬，人之所美也。 鱼见之深入，乌见之高飞，麋鹿见之决骤。 四者孰知天下之正色哉？ 自我观之，仁义之端，是非之涂，樊然淆乱，吾恶能知其辩。 啮缺曰：子不知利害，则至人固不知利害乎？ 王倪曰：至人神矣。 大泽焚而不能热，河汉冱而不能寒，疾雷破山风振海而不能惊。 若然者，乘云气，骑日月，而游乎四海之外，死生无变於已，而况利害之端乎。 右第三章瞿鹊子问乎长梧子曰：吾闻诸夫子：圣人不从事於务，不就利，不违害，不喜求，不绿道； 无谓有谓，有谓无谓，而游乎尘埃之外。 夫子以为孟浪之言，而我以为妙道之行也。 吾子以为奚若？ 长梧子曰：是黄帝之所听荧也，而丘也何足以知之。 且女亦大早计，见卵而求时夜，见弹而求鸮炙。 予尝为女妄言之，女以妄听之奚？ 旁日月，挟宇宙，为其吻合，置其滑愍，以隶相尊。 众人役役，圣人愚庵，参万岁而一成纯。 万物尽然，而以是相蕴。 予恶乎知说生之非惑邪？ 予恶乎知恶死之非弱丧而不知归者邪？ 丽之姬，艾封人之也。 晋国之始得之也，涕泣沾襟； 及其至於王所，与王同筐床，食刍豢，而后悔其泣也。 予恶乎知夫死者不悔其始之薪生乎？ 梦饮酒者，旦而哭泣。 梦哭泣者，旦而田猎。 方其梦也，不知其梦也。 梦之中又占其梦焉，觉而后知其梦也。 且有大觉而后知此其大梦也。 而愚者自以为觉，窃窃然知之。 君乎，牧乎，固哉。 丘也与女，皆梦也。 予谓女梦，亦梦也。 是其言也，其名为吊诡。 万世之后而一遇大圣，知其解者，是旦暮遇之也。 既使我与若辩矣，若胜我，我不若胜，若果是也，我果非也邪？ 我胜若，若不吾胜，我果是也，而果非也邪。 其或是也，其或非也邪。 其俱是也，其俱非也邪？ 我与若不能相知也，则人固受其黮暗，吾谁使正之？ 使同乎若者正之，既与若同矣，恶能正之？ 使同乎我者正之，既同乎我矣，恶能正之？ 使异乎我与若者正之，既异乎我与若者，恶能正之？ 使同乎我与若者正之，既同乎我与若矣，恶能正之？ 然则我与若与人俱不能相知也，而待彼也邪？ 何谓和之以天倪？ 曰：是不是，然不然。 是若果是也，则是之异乎不是也，亦无辩。 然若果然也，则然之异乎不然也亦无辩。 化声之相待，若其不相待。 和之以天倪，因之以曼衍，所以穷年也。 忘年忘义，振於无竟，故寓诸无竟。 罔两问景曰：曩子行，今子止。 曩子坐，今子起。 何其无特操与？ 景曰：吾有待而然者邪？ 吾所待又有待而然者邪？ 吾待蛇蚹蜩翼邪？ 恶识所以然？ 恶识所以不然？",
      "translated_text": "Shun replied: \"Those three rulers remain among the brambles and weeds. How could you feel at ease? In ancient times, ten suns appeared together, and all things were illuminated—how much more so for one whose virtue surpasses the sun?\"\n\n**Chapter Two**\nNie Que asked Wang Ni: \"Do you know what all things agree upon as right?\"\nWang Ni said: \"How would I know?\"\n\"Do you know what you do not know?\"\n\"How would I know?\"\n\"Then do things have no knowledge?\"\n\"How would I know? Nevertheless, let me try to speak of it. How do I know that what I call knowing is not not-knowing? How do I know that what I call not-knowing is not knowing? Now, let me ask you this: If people sleep in dampness, their waists ache and they become half-paralyzed—is that so for the loach? If they dwell in trees, they tremble with fear—is that so for the monkey? Of these three, which knows the proper dwelling? People eat the flesh of livestock; deer eat grass; centipedes relish snakes; owls and crows feast on mice. Of these four, which knows the proper taste? Monkeys mate with monkeys; deer consort with deer; loaches swim with fish. Mao Qiang and Li Ji are considered beauties by men, yet when fish see them, they dive deep; when birds see them, they fly high; when deer see them, they flee swiftly. Of these four, which knows the true beauty of the world? From my perspective, the distinctions of benevolence and righteousness, the paths of right and wrong, are tangled and confused—how could I know their distinctions?\"\nNie Que said: \"If you do not know benefit and harm, does the Perfect Man also not know benefit and harm?\"\nWang Ni said: \"The Perfect Man is divine. Though great marshes burn, he is not hot; though rivers and lakes freeze, he is not cold; though thunder splits mountains and winds shake the sea, he is not startled. One like this rides the clouds and qi, mounts the sun and moon, and roams beyond the four seas. Life and death do not alter him—how much less the distinctions of benefit and harm?\"\n\n**Chapter Three**\nQu Quezi asked Changwuzi: \"I have heard from the Master that the sage does not engage in affairs, does not pursue profit, does not avoid harm, does not seek joy, does not follow the Way; speaks as if silent, is silent as if speaking, and roams beyond the dust of the world. The Master dismissed this as reckless words, but I consider it the practice of the wondrous Way. What do you think?\"\nChangwuzi said: \"These are words that even the Yellow Emperor found perplexing—how could Confucius understand them? Moreover, you are too hasty in your calculations, like seeing an egg and demanding a rooster at dawn, or seeing a slingshot and craving roast owl. Let me speak to you recklessly—why not listen recklessly? He roams alongside the sun and moon, embraces the cosmos, joins their union, and sets aside their confusion, treating all as equal. The multitude toil ceaselessly; the sage appears foolish and dull, blending the myriad ages into one pure whole. All things are thus, mutually enfolding one another. How do I know that delight in life is not delusion? How do I know that aversion to death is not like a youth who has lost his way and does not know his return? Li Ji was the daughter of the border warden of Ai. When the state of Jin first obtained her, she wept until her tears soaked her collar; yet once she reached the king’s palace, shared his bed, and ate fine meats, she regretted her tears. How do I know that the dead do not regret their former clinging to life? Those who dream of drinking wake to weep; those who dream of weeping wake to hunt. While dreaming, they do not know they dream; within the dream, they may even interpret it. Only after waking do they know it was a dream. And only after a great awakening do they know this was all a great dream. Yet fools believe themselves awake, arrogantly claiming to know—lords, herdsmen, how rigid! Confucius and you are both dreaming. When I say you are dreaming, I too am dreaming. Such words are called ‘uncanny paradoxes.’ Even if a great sage were to appear ten thousand generations hence to explain them, it would be like encountering him morning and night.\n\n\"Suppose you and I debate: if you defeat me, and I do not defeat you, does that mean you are truly right and I am truly wrong? If I defeat you, and you do not defeat me, am I truly right and you truly wrong? Is one of us right and the other wrong? Are we both right or both wrong? You and I cannot know, and others are likewise shrouded in darkness. Whom shall we ask to decide? If we ask someone who agrees with you, since they already agree, how can they decide? If we ask someone who agrees with me, since they already agree, how can they decide? If we ask someone who differs from both of us, since they differ, how can they decide? If we ask someone who agrees with both of us, since they agree, how can they decide? Thus, you, I, and others cannot know—must we wait for another?\n\n\"What is meant by harmonizing with the Heavenly Pivot? It is to say: ‘Is it so? Is it not so? If it is truly so, then its difference from not-so need not be debated. If it is truly so, then its difference from not-so need not be debated.’ The mutual dependence of affirmations and negations is like their non-dependence. Harmonize them with the Heavenly Pivot, follow them with boundless transformation, and thus live out your years. Forget years, forget righteousness, be stirred by the boundless, and so lodge in the boundless.\"\n\nThe Shadow of a Shadow asked the Shadow: \"Earlier you were walking, now you are still. Earlier you were sitting, now you are standing. Why are you so without constancy?\"\nThe Shadow said: \"Do I depend on something to be thus? Does what I depend on also depend on something to be thus? Do I depend on the scales of a snake or the wings of a cicada? How do I know why it is so? How do I know why it is not so?\"",
      "overlap_context": "ness.\n\nThus, to know where to stop in what one does not know—this is perfection. Who knows the disputation of no speech, the Dao of no Dao? If one can know this, it is called the Heavenly Storehouse. Pour into it and it is never full; draw from it and it never runs dry, yet one does not know whence it comes—this is called preserving the light.\n\nTherefore, in ancient times, Yao asked Shun: \"I wish to attack Zong, Kuai, and Xu’ao, yet when I sit facing south, I feel unsettled. What is the reason?\"",
      "start_char": 5288,
      "end_char": 6477,
      "start_sentence": 376,
      "end_sentence": 454,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.339431047439575,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\庄子内篇订正.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "昔者庄周梦为蝴蝶，栩栩然胡蝶也，自喻适志与，不知周也。 俄然觉，则蘧蘧然周也。 不知周之梦为胡蝶与，胡蝶之梦为周与？ 周与胡蝶，则必有分矣。 此之谓物化。 右第四章 养生主 吾生也有涯，而知也无涯。 以有涯随无涯，殆已。 已而为知者，殆而已矣。 为善无近名，为恶无近刑。 缘督以为经，可以保身，可以全生，可以养亲，可以尽年。 庖丁为文惠君解牛，手之所触，肩之所倚，足之所履，膝之所踦，砉然向然，奏刀騞然，莫不中音； 合於桑林之舞，乃中经首之会。 文惠君曰：嘻，善哉。 技盖至此乎？",
      "translated_text": "Once, Zhuang Zhou dreamed he was a butterfly—fluttering and joyous, a true butterfly, delighting in the fulfillment of his intent, unaware of Zhou. Suddenly he awoke, and there he was, palpably Zhou. Yet he did not know: was it Zhou dreaming he was a butterfly, or a butterfly dreaming it was Zhou? Between Zhou and the butterfly, there must be a distinction. This is called the transformation of things.\n\n**Chapter Four: The Nurturing of Life**\n\nOur lives are bounded, but knowledge is boundless. To pursue the boundless with the bounded is perilous. Those who persist in such pursuit court peril alone.\n\nIn doing good, avoid proximity to fame; in doing ill, avoid proximity to punishment. Follow the Heavenly Pivot as your guiding principle, and you may preserve your body, fulfill your life, nurture your kin, and live out your years.\n\nCook Ding carved an ox for Lord Wenhui. Where his hand touched, his shoulder leaned, his foot pressed, his knee braced—each movement released a crisp *hua* sound, each stroke of the blade a resonant *huo*. Every motion aligned with the rhythm, harmonizing with the dance of *Sanglin* and the cadence of *Jingshou*.\n\nLord Wenhui exclaimed: \"Ah! How excellent! Has skill truly reached such heights?\"",
      "overlap_context": "t years, forget righteousness, be stirred by the boundless, and so lodge in the boundless.\"\n\nThe Shadow of a Shadow asked the Shadow: \"Earlier you were walking, now you are still. Earlier you were sitting, now you are standing. Why are you so without constancy?\"\nThe Shadow said: \"Do I depend on something to be thus? Does what I depend on also depend on something to be thus? Do I depend on the scales of a snake or the wings of a cicada? How do I know why it is so? How do I know why it is not so?\"",
      "start_char": 6477,
      "end_char": 6711,
      "start_sentence": 455,
      "end_sentence": 470,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.930243968963623,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\庄子内篇订正.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "庖丁释刀对曰：臣之所好者道也，进乎技矣。 始臣之解牛之时，所见无非牛者。 三年之后，未尝见全牛也。 方今之时，臣以神遇而不以目视，官知止而神欲行。 依乎天理，批大却，导大窍，因其故然。 技经肯萦之未尝，而况大軱乎。 良庖岁更刀，割也； 族庖月更刀，折也。 今臣之刀十九年矣，所解数千牛矣，而刀刃若新发於硎。 彼节者有问而刀刃者无厚。 以无厚入有间，恢恢乎其於游刃必有余地矣。 是以十九年而刀刃若新发於硎。 虽然，每至於族，吾见其难为，怵然为戒，视为止，行为迟，动刀甚微，谍然已解，如土委地。 提刀而立，为之四顾，为之踌躇满志，善刀而藏之。 文惠君曰：善哉。 吾闻庖丁之言，得养生焉。 右第一章 公文轩见右师而惊日：是何人也？ 恶乎介也？ 天与，其人与？ 曰：天也，非人也。 天之生是使独也，人之貌有与也。 以是知其天也，非人也。 泽雉十步一啄，百步一饮，不蕲畜乎樊中。 神虽王，不善也。 右第二章",
      "translated_text": "Cook Ding laid down his blade and replied: \"Your servant’s devotion lies in the Dao, which transcends mere skill. When I first began to carve oxen, all I saw was the ox entire. After three years, I no longer saw the ox as a whole. Now, I encounter it with spirit rather than sight; my senses halt while my spirit moves. I follow the Heavenly Principle, cleaving great gaps, guiding through great hollows, proceeding along its inherent patterns. I have never touched a ligament or tendon, much less a major bone. A good cook changes his blade yearly, for he cuts; an ordinary cook changes his monthly, for he hacks. My blade has endured nineteen years, carving thousands of oxen, yet its edge remains as if newly whetted. For where the joints have spaces, and the blade has no thickness—when what has no thickness enters where there is space, how vast the room for the blade to move! Thus, after nineteen years, my blade remains as if newly whetted. Yet whenever I encounter a complex joint, I perceive the difficulty, grow wary, focus my gaze, slow my movements, and wield the knife with utmost care—until, with a sudden *die* sound, the ox falls apart like earth crumbling to the ground. Then I stand, blade in hand, look around in satisfaction, wipe the blade clean, and put it away.\"\n\nLord Wenhui said: \"Excellent! From Cook Ding’s words, I have learned how to nurture life.\"\n\n**Chapter One ends here.**\n\nGongwen Xuan saw the Right Master and was startled, asking: \"What manner of man is this? Why is he one-legged? Was this given by Heaven, or by man?\"\n\"It was Heaven, not man. Heaven’s creation made him thus; man’s form merely reflects it. This is how we know it was Heaven, not man.\"\nA marsh pheasant takes ten steps to peck, a hundred steps to drink, yet it does not seek to be kept in a cage. Though its spirit may soar, it would not fare well.\n\n**Chapter Two ends here.**",
      "overlap_context": "nciple, and you may preserve your body, fulfill your life, nurture your kin, and live out your years.\n\nCook Ding carved an ox for Lord Wenhui. Where his hand touched, his shoulder leaned, his foot pressed, his knee braced—each movement released a crisp *hua* sound, each stroke of the blade a resonant *huo*. Every motion aligned with the rhythm, harmonizing with the dance of *Sanglin* and the cadence of *Jingshou*.\n\nLord Wenhui exclaimed: \"Ah! How excellent! Has skill truly reached such heights?\"",
      "start_char": 6711,
      "end_char": 7094,
      "start_sentence": 471,
      "end_sentence": 496,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.221840858459473,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\庄子内篇订正.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 17,
      "original_text": "老聃死，秦失吊之，三号而出。 弟子曰：非夫子之友邪？ 曰：然。 然则吊焉若此，可乎？ 曰：然。 始也吾以为其人也，而今非也。 向吾入而吊焉，有老者哭之，如哭其子； 少者哭之，如哭其母。 彼其所以会之，必有不蕲言而言，不蕲哭而哭者。 是遁天倍情，忘其所受，古者谓之遁天之刑。 适来，夫子时也； 适去，夫子顺也。 安时而处顺，一辰乐不能入也，古者谓是帝之县解。 指穷於为蕲，火传也，不知其尽也。 右第三章 人间世 颜回见仲尼，请行。 曰：奚之？ 曰：将之卫。 曰：奚为焉？ 曰：回闻卫君，其年壮，其行独。 轻用其国，而不见其过； 轻用民死，死者以国量乎泽若焦，民其无如矣，回尝闻之夫子曰：治国去之，乱国就之，医门多疾。 愿以所闻思其则，庶几其国有廖乎？ 仲尼曰：嘻。 若殆往而刑耳。 夫道不欲杂，杂则多，多则扰，扰则忧，忧而不救。 古之至人，先存诸己而后存诸人。 所存於己者未定，何暇至於暴人之所行。 且若亦知夫德之所荡而知之所为出乎哉？ 德荡乎名，知出乎争。 名也者，相轧也； 知也者，争之器也。 二者凶器，非所以尽行也。 且德厚信矼，未达人气，名闻不争，未达人心。 而强以仁义绳墨之言卫暴人之前者，是以人恶有其美也，命之日菑人。 菑人者，人必反苗之。 若殆为人苗夫？ 且苟为悦贤而恶不肖，恶用而求有以异。 若唯无诏，王公必将乘人而斗其捷。 而目将荧之，而色将平之，口将营之，容将形之，心且成之。 是以火救火，以水救水，名之曰益多。 顺始无穷，若殆以不信厚言，必死於暴人之前矣。 且昔者桀杀关龙逢，纣杀王子比干，是皆修其身以下偃批人之民，以下拂其上者也，故其君因其修以挤之。 是好名者也。 昔者尧攻丛枝、胥放，禹攻有扈。 国为虚厉，身为刑戮。 其用兵不止，其求实无已，是皆求名实者也。 而独不闻之乎？ 名实者，圣人之所不能胜也，而况若乎。 虽然，若必有以也，尝以语我来。 颜回曰：端而虚，勉而一，则可乎？ 曰：恶。 恶可。",
      "translated_text": "When Lao Dan died, Qin Shi went to mourn him, crying three times before leaving. A disciple asked: \"Was he not your master’s friend?\" \"Yes,\" he replied. \"Then is such a brief mourning proper?\" \"Yes. At first, I thought him an ordinary man, but now I see he was not. When I entered to offer condolences, I found elders weeping for him as if for their own sons, and youths weeping as if for their own mothers. Those who gathered there must have been moved to speak without intending words, to weep without intending tears. This is fleeing from Heaven and betraying one’s nature, forgetting what one has received—what the ancients called ‘the punishment of fleeing from Heaven.’ When he came, it was his time; when he departed, he followed the natural course. At peace with the time and in harmony with the course, sorrow could not enter. The ancients called this ‘the Great Release.’ A finger pointing at what is sought will wear out, but the flame is passed on—who knows when it will end?\"\n\n**Chapter Three ends here.**\n\n**Human World**\n\nYan Hui sought an audience with Confucius, asking to depart. \"Where to?\" asked Confucius. \"To Wei,\" he replied. \"What will you do there?\" \"I have heard that the lord of Wei is young in years but firm in conduct. He rules his state lightly yet does not see his own faults; he treats the lives of his people as if they were nothing. The dead are measured by the land as if it were a marsh burned dry, and the people have nowhere to turn. I once heard you say, Master: ‘Leave a well-governed state, go to a disordered one—where there are many illnesses, a physician’s gate is busy.’ I wish to ponder what I have heard and seek a principle, hoping perhaps to bring some relief to that state.\"\n\nConfucius said: \"Alas! You will likely go only to be punished. The Way does not tolerate杂乱;杂乱 leads to excess, excess to disturbance, disturbance to anxiety, and anxiety to ruin. The perfected of old first established themselves before establishing others. If what is established in yourself is not secure, how can you attend to the conduct of a violent man? Moreover, do you know where virtue’s dissipation comes from, and from what knowledge arises? Virtue dissipates into fame, knowledge arises from contention. Fame is a tool for mutual conflict; knowledge is an instrument of strife. Both are ill-omened tools, not things to be fully enacted.\n\nFurthermore, though your virtue may be deep and your trust solid, you have not yet grasped the people’s *qi*; though your fame may be known and free of contention, you have not yet reached their hearts. To forcefully present the language of benevolence and righteousness, the carpenter’s line and ink, before a violent man is to make him resent what he would otherwise admire—this is called ‘bringing calamity upon oneself.’ One who brings calamity will surely reap retaliation. Are you not likely to become a target for others?\n\nMoreover, if you merely delight in the worthy and despise the unworthy, why seek to be different? If you remain silent, the lords and princes will surely exploit your presence to vie for advantage. Your eyes will be dazzled, your expression will grow placid, your words will become calculated, your demeanor will take shape, and your heart will be molded by it. This is like quenching fire with fire, or flooding water with water—it is called ‘increasing the excess.’ Following such a beginning without end, if you persist in offering earnest words without trust, you will surely die before that violent man.\n\nIn the past, Jie killed Guan Longfeng, and Zhou killed Prince Bigan—both were men who cultivated themselves to serve the people below, yet their conduct clashed with their superiors. Thus, their lords used their cultivation to cast them out. They were lovers of fame. In ancient times, Yao attacked Congzhi and Xufang, and Yu attacked Youhu. Their states became wastelands of the dead, and they themselves were executed. Their use of arms did not cease, their pursuit of substance knew no end—they were all seekers of fame and substance. Have you not heard of this? Fame and substance are things even the sage cannot overcome—how much less can you? Nevertheless, if you must have a way, come and tell me what you have in mind.\"\n\nYan Hui said: \"If I am upright yet empty, diligent yet single-minded, will that suffice?\" \"No,\" said Confucius. \"How could it?\"",
      "overlap_context": "*Chapter One ends here.**\n\nGongwen Xuan saw the Right Master and was startled, asking: \"What manner of man is this? Why is he one-legged? Was this given by Heaven, or by man?\"\n\"It was Heaven, not man. Heaven’s creation made him thus; man’s form merely reflects it. This is how we know it was Heaven, not man.\"\nA marsh pheasant takes ten steps to peck, a hundred steps to drink, yet it does not seek to be kept in a cage. Though its spirit may soar, it would not fare well.\n\n**Chapter Two ends here.**",
      "start_char": 7094,
      "end_char": 7862,
      "start_sentence": 497,
      "end_sentence": 550,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.374587535858154,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\庄子内篇订正.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 18,
      "original_text": "夫以阳为充孔扬，采色不定，常人之所不违，因案人之所感，以求容与其心，名之曰日渐之德不成，而况大德乎。 将执而不化，外合而内不訾，其庸讵可乎。 然则我内直而外曲，成而上比。 内直者，与天为徒。 与天为徒者，知天子之与已，皆天之所子，而独以已言蕲乎而人善之，蕲乎而人不善之邪？ 若然者，人谓之童子，是之谓与天为徒。 外曲者，与人之为徒也。 擎跽曲拳，人臣之礼也。 人皆为之，吾敢不为邪？ 为人之所为者，人亦无疵焉，是之谓与人为徒。 成而上比者，与古为徒。 其言虽教，谪之实也； 古之有也，非吾有也。 若然者，虽直不为病，是之谓与古为徒。 若是则可乎？ 仲尼曰：恶。 恶可。 大多政法而不谍。 虽固亦无罪。 虽然，止是耳矣，夫胡可以及化。 犹师心者也。 颜回曰：吾无以进矣，敢问其方。 仲尼曰：斋，吾将语若。 有而为之，其易邪？ 易之者，嗥天不宜。",
      "translated_text": "He who takes yang as his fullness, his brilliance overflowing, his colors ever-shifting—this is what the common man never resists. Following the impulses of others to seek harmony with their hearts, he is called one whose daily-accumulating virtue never ripens—how much less can great virtue? Clinging rigidly without transformation, outwardly conforming while inwardly unexamined—how could this ever suffice?\n\nYet if I am inwardly straight but outwardly bent, achieving while aligning above: To be inwardly straight is to follow Heaven as one’s companion. Following Heaven, one knows that the Son of Heaven and oneself are both children of Heaven. Would one then seek praise for one’s words, or hope others deem them good or bad? Such a one is called a childlike innocent—this is what it means to follow Heaven as one’s companion.\n\nTo be outwardly bent is to follow others as one’s companion. Kneeling with hands clasped, bowing in submission—these are the rites of a minister. If all men do this, how dare I not? Doing what others do, one incurs no blame—this is what it means to follow others as one’s companion.\n\nTo achieve while aligning above is to follow the ancients as one’s companion. Though one’s words may instruct, they are but borrowed truth; what the ancients possessed is not mine. Such a one, though forthright, is not faulted—this is what it means to follow the ancients as one’s companion.\n\nWould this suffice?\nConfucius said: \"No. How could it? Too many rules and laws, yet no penetration. Though firmly held, it remains blameless—but this is all. How can it reach transformation? It is still to follow one’s own mind.\"\n\nYan Hui said: \"I have no further way forward. May I ask the method?\"\nConfucius said: \"Fast. I will tell you. To act while possessing—is this easy? Those who find it easy are not favored by Highest Heaven.\"",
      "overlap_context": "ecame wastelands of the dead, and they themselves were executed. Their use of arms did not cease, their pursuit of substance knew no end—they were all seekers of fame and substance. Have you not heard of this? Fame and substance are things even the sage cannot overcome—how much less can you? Nevertheless, if you must have a way, come and tell me what you have in mind.\"\n\nYan Hui said: \"If I am upright yet empty, diligent yet single-minded, will that suffice?\" \"No,\" said Confucius. \"How could it?\"",
      "start_char": 7862,
      "end_char": 8209,
      "start_sentence": 551,
      "end_sentence": 575,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.31528091430664,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\庄子内篇订正.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 19,
      "original_text": "颜回曰：回之家贫，唯不饮酒不茹荤者数月矣。 若此则可以为斋乎？ 曰：是祭杞之斋，非心斋也。 回曰：敢问心斋。 仲尼曰：若一志，无听之以耳而听之以心，无听之以心而听之以气。 听止於耳，心止於符。 气也者，虚而待物者也。 唯道集虚。 虚者，心斋也。 颜回曰：回之未始得使，实自回也； 得使之也，未始有回也。 可谓虚乎？ 夫子曰：尽矣。 吾语若。 若能入游其樊而无感其名，入则呜，不入则止。 无门无毒，一宅而寓於不得已，则几矣。 绝迹易，无行地难。 为人使易以伪，为天使难以伪。 闻以有翼飞者矣，未闻以无翼飞者也。 闻以有知知者矣，未闻以无知知者也。 瞻彼阕者，虚室生白，吉祥止止。 夫且不止，是之谓坐驰。 夫徇耳目内通而外於心知，鬼神将来舍，而况人乎。 是万物之化也，舜禹之所纽也，伏戏几遽之所行终，而况散焉者乎。 而况散焉者乎。 颜回曰：回益矣。 仲尼曰：何谓也？ 曰：回忘仁义矣。 曰：可矣，犹未也。 他日复见。 曰：回益矣。 曰：何谓也？ 曰：回忘礼乐矣。 曰：可矣，犹未也。 他日复见。 曰：回益矣。 曰：何谓也？ 曰：回坐忘矣。 仲尼蹴然曰：何谓坐忘？ 颜回曰：堕肢体黜聪明，离形去智，同於大通。 此谓坐忘。 仲尼曰：同则无好也，化则无常也，而果其贤乎？ 丘也请从而后也。 右第一章",
      "translated_text": "Yan Hui said: \"My family is poor. For months now, I have neither drunk wine nor eaten meat. Might this be considered fasting?\"\n\nConfucius replied: \"This is the fast of sacrificial rites, not the fasting of the mind.\"\n\nYan Hui asked: \"May I inquire about the fasting of the mind?\"\n\nConfucius said: \"Unify your will. Do not listen with the ears but listen with the mind; do not listen with the mind but listen with qi. Hearing stops at the ears, the mind stops at signs. Qi is that which is empty and awaits things. Only the Dao abides in emptiness. Emptiness is the fasting of the mind.\"\n\nYan Hui said: \"Before I received your instruction, I was truly myself. Having received it, I am as though I have never been myself. May this be called emptiness?\"\n\nConfucius said: \"You have attained it. Let me tell you: If you can enter and wander within its bounds without being moved by fame, respond when it enters, and cease when it does not—without gate, without artifice, dwelling in a single abode and lodging in inevitability—then you are close indeed. To leave no trace is easy; to walk without touching the ground is difficult. To be employed by man is easy to feign; to be employed by Heaven is difficult to feign. You have heard of flying with wings, but never of flying without wings. You have heard of knowing with knowledge, but never of knowing without knowledge. Look upon that emptiness—an empty chamber generates brightness, and auspiciousness comes to rest there. If it does not come to rest, this is called sitting while galloping. If you follow the ears and eyes to communicate inwardly while the mind’s knowledge remains external, even spirits and gods will come to dwell—how much more so men! This is the transformation of the ten thousand things, the pivot of Shun and Yu, the ultimate course of Fuxi and Jie—how much more so those who are scattered and fragmented!\"\n\nYan Hui said: \"I have made progress.\"\n\nConfucius asked: \"What do you mean?\"\n\nYan Hui replied: \"I have forgotten benevolence and righteousness.\"\n\nConfucius said: \"Good, but not yet sufficient.\"\n\nAnother day, they met again.\n\nYan Hui said: \"I have made further progress.\"\n\nConfucius asked: \"What do you mean?\"\n\nYan Hui replied: \"I have forgotten rites and music.\"\n\nConfucius said: \"Good, but not yet sufficient.\"\n\nAnother day, they met again.\n\nYan Hui said: \"I have made progress.\"\n\nConfucius asked: \"What do you mean?\"\n\nYan Hui replied: \"I sit in forgetfulness.\"\n\nConfucius started and said: \"What is sitting in forgetfulness?\"\n\nYan Hui said: \"I cast off my limbs and body, dismiss my hearing and sight, leave my form and abandon knowledge, and merge with the Great Thoroughfare. This is called sitting in forgetfulness.\"\n\nConfucius said: \"To merge is to have no preferences; to transform is to have no constancy. And have you truly become worthy? I would follow after you.\"\n\nChapter One.",
      "overlap_context": "is is what it means to follow the ancients as one’s companion.\n\nWould this suffice?\nConfucius said: \"No. How could it? Too many rules and laws, yet no penetration. Though firmly held, it remains blameless—but this is all. How can it reach transformation? It is still to follow one’s own mind.\"\n\nYan Hui said: \"I have no further way forward. May I ask the method?\"\nConfucius said: \"Fast. I will tell you. To act while possessing—is this easy? Those who find it easy are not favored by Highest Heaven.\"",
      "start_char": 8209,
      "end_char": 8714,
      "start_sentence": 576,
      "end_sentence": 619,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.493554592132568,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\庄子内篇订正.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 20,
      "original_text": "叶公子高将使於齐，问於仲尼曰：王使诸梁也甚重。 齐之待使者，盖将甚敬而不急。 匹夫犹未可动也，而况诸侯乎。 吾甚栗之。 子尝语诸梁也曰：凡事若小若大，寡不道以惧成。 事若不成，则必有人道之患； 事若成，则必有阴阳之患。 若成若不成而后无患者，唯有德者能之。 吾食也执粗而不臧，爨无欲清之人。 今吾朝受命而夕饮冰，我其内热与。 吾未至乎事之情，而既有阴阳之患矣。 事若不成，必有人道之患。 是两也。 为人臣者不足以任之，子其有以语我来。 仲尼曰：天下有大戒二：其一命也，其一义也。 子之爱亲，命也，不可解於心。 臣之事君，义也，无适而非君也，无所逃於天地之间。 是之谓大戒。 是以夫事其亲也，不择地而安之，孝之至也。 夫事其君者，不择事而安之，忠之盛也。 自事其心者，一反乐不易施乎前，知其不可柰何而安之若命，德之至也。 为人臣子者，固有所不得已。 行事之情而忘其身，何暇至於悦生而恶死。 夫子其行可矣。 丘请复以所闻：凡交近则必相靡以信，远则必忠之以言。 言必或传之。 夫传两喜两怒之言，天下之难者也。 夫两喜必多溢美之言，两怒必多溢恶之言。 凡溢之类也妄，妄则其信之也莫，莫则传言者殃。 故法言曰：传其常情，无传其溢言，则几乎全。 且以巧斗力者，始乎阳，常卒乎阴，泰至则多奇巧。 以礼饮酒者，始乎治，常卒乎乱，泰至则多奇乐。 凡事亦然：始乎谅，常卒乎鄙。 其作始也简，其将毕也必巨。 言者，风波也； 行者，实丧也。 夫风波易以动，实丧易以危。 故忿设无由，巧言偏辞。 兽死不择音，气息弗然，於是并生心厉。 克核泰至，则必有不肖之心应之而不知其然也。 苟为不知其然也，孰知其所终。 故法言曰：无迁令，无劝成。 过度益也。 迁令劝成殆事美成在久，恶成不及改，可不慎与。 且夫乘物以游心，托不得已以养中，至矣。 何作为报也。 莫若为致命。 此其难者。 右第二章",
      "translated_text": "Lord Zigao of Ye was about to be sent as an envoy to Qi. He asked Confucius, saying: \"The king’s charge to me, Zhu Liang, is most weighty. The reception of envoys in Qi is likely to be respectful yet unhurried. Even a common man cannot be swayed lightly—how much less a feudal lord! I tremble at the thought. You once told me: ‘In all matters, great or small, few are not brought to completion through apprehension. If the matter fails, one must face the calamity of human judgment; if it succeeds, one must endure the affliction of yin and yang. Only those of virtue can ensure that, whether it succeeds or fails, no harm befalls them.’ I eat coarse food without complaint and tend the stove without craving coolness. Yet now, upon receiving my morning orders, I drink ice by evening—surely my inner heat is to blame. I have not yet reached the truth of the matter, yet I already suffer the affliction of yin and yang. If the matter fails, I must face the calamity of human judgment. These are two perils. As a minister, I am unworthy of such a task. Pray, instruct me further.\"\n\nConfucius said: \"Under heaven, there are two great precepts: the first is fate, the second is duty. Your love for your parents is fate—it cannot be untied from the heart. A minister’s service to his lord is duty—there is no place in heaven or earth where he may escape it. These are called the great precepts. Thus, in serving one’s parents, to find peace without choosing the place is the height of filial piety. In serving one’s lord, to find peace without choosing the task is the fullness of loyalty. In mastering one’s own heart, to return to joy and not alter it before one’s eyes, to know what cannot be helped and accept it as fate—this is the perfection of virtue. As a minister and son, one is fundamentally bound by what cannot be avoided. Proceeding with the truth of the matter and forgetting oneself—how could one have leisure to delight in life or fear death? You may go forth.\n\nLet me also share what I have heard: In close dealings, trust must be cultivated through intimacy; in distant relations, loyalty must be conveyed through words. Words must often be transmitted. Yet transmitting words that please or anger both sides is the most difficult task under heaven. Where both are pleased, there will be much exaggerated praise; where both are angered, there will be much exaggerated blame. All exaggeration is falsehood; falsehood erodes trust, and where trust is lacking, the transmitter incurs misfortune. Thus, the standard teaching says: Transmit the constant truth, do not transmit exaggerated words—then you will be nearly whole.\n\nMoreover, those who contend with skill and strength begin in openness but often end in secrecy; when excess prevails, there is much cunning. Those who drink wine with ritual begin in order but often end in disorder; when excess prevails, there is much reckless revelry. All things are thus: they begin in sincerity but often end in vulgarity. Their inception is simple, but their conclusion is inevitably grand. Words are like wind and waves; actions are like gain and loss. Wind and waves are easily stirred; gain and loss are easily imperiled. Thus, anger arises without cause, and artful speech leans toward partiality. When beasts die, they do not choose their cries; their breath falters, and in that moment, a vicious heart arises. When scrutiny becomes excessive, an unworthy heart responds unknowingly. If one does not know why this is so, who can foresee the outcome? Thus, the standard teaching says: Do not alter orders, do not urge completion. Excessive change is harmful. Altering orders and urging completion endanger the matter. Success built over time endures; failure, once formed, cannot be amended—can one not be cautious?\n\nMoreover, to ride the world’s currents and roam the heart, to entrust oneself to necessity and nurture the center—this is perfection. What need is there for contrivance or repayment? It is best to deliver the charge faithfully. This is the difficulty.\"",
      "overlap_context": "ius asked: \"What do you mean?\"\n\nYan Hui replied: \"I sit in forgetfulness.\"\n\nConfucius started and said: \"What is sitting in forgetfulness?\"\n\nYan Hui said: \"I cast off my limbs and body, dismiss my hearing and sight, leave my form and abandon knowledge, and merge with the Great Thoroughfare. This is called sitting in forgetfulness.\"\n\nConfucius said: \"To merge is to have no preferences; to transform is to have no constancy. And have you truly become worthy? I would follow after you.\"\n\nChapter One.",
      "start_char": 8714,
      "end_char": 9450,
      "start_sentence": 620,
      "end_sentence": 668,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.755589962005615,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\庄子内篇订正.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 21,
      "original_text": "颜阖将传卫灵公太子，而问於蘧伯玉曰：有人於此，其德天杀。 与之为无方则危吾国； 与之为有方则危吾身。 其知适足以知人之过，而不知其所以过。 若然者，吾奈之何？ 连伯玉曰：善哉问乎？ 戒之，慎之，正女身哉。 形莫若就，心莫若和。 虽然，之二者有患。 就不欲入，和不欲出。 形就而入，且为颠为灭，为崩为蹶； 心和而出，且为声为名，为妖为孽，彼且为婴儿，亦与之为婴儿； 彼且为无町畦，亦与之为无町畦； 彼且为无崖，亦与之为无崖。 达之，入於无疵。 汝不知夫螳螂乎？ 怒其臂以当车辙，不知其不胜任也，是其才之美者也。 戒之，慎之。 积伐而美者以犯之，几矣。 汝不知夫养虎者乎？ 不敢以生物与之，为其杀之之怒也； 不敢以全物与之，为其决之之怒也。 时其饥饱，达其怒心。 虎之与人异类，而媚养己者，顺也； 故其杀者，逆也。 夫爱马者，以筐盛矢，以蜃盛溺。 适有蚊虻仆缘，而批之不时，财缺街毁首碎胸。 意有所至而爱有所亡，可不慎邪。 右第三章 匠石之齐，至乎曲辕，见砾社树。 其大蔽牛#4； 絮之百围，其高临山十仞而后有枝，其可以为舟者旁十数。 观者如市。 匠伯不顾，遂行不辍。",
      "translated_text": "Yan He was about to instruct the crown prince of Duke Ling of Wei when he questioned Qu Boyu, saying: \"There is a man here whose virtue is as harsh as Heaven’s execution. If I deal with him without method, it endangers our state; if I deal with him with method, it endangers myself. His knowledge is just enough to perceive others’ faults but not to understand why they err. In such a case, what should I do?\"\n\nQu Boyu replied: \"An excellent question! Be vigilant, be cautious, and rectify yourself. In form, nothing surpasses compliance; in heart, nothing surpasses harmony. Yet even these two have their perils. Compliance must not become submission, nor harmony projection. If in form you submit, you risk collapse, destruction, ruin, or downfall. If in heart you project harmony, you risk becoming a voice, a reputation, an omen, or a scourge. If he acts like an infant, respond as an infant; if he abandons boundaries, abandon boundaries with him; if he knows no limits, match his boundlessness. Master this, and you enter flawlessness.\n\nDo you not know the mantis? Enraged, it raises its arms to block a chariot wheel, unaware of its incapacity—such is the beauty of its talent. Beware, be cautious. To accumulate praise and beauty while provoking him is perilously close.\n\nDo you not know those who raise tigers? They dare not feed it living prey, lest its killing fury be aroused; nor whole prey, lest its tearing fury be provoked. They time its hunger and satiety, understanding its angry heart. Though tigers and humans are of different kinds, the tiger fawns on its keeper—this is compliance. Thus, those it kills are those who resist.\n\nThose who love horses use baskets to collect their dung and conch shells for their urine. Yet when a mosquito or horsefly alights and they swat it untimely, the horse may bite through the bit, break its bridle, or smash its chest. Love may reach a point where it loses what it cherishes—can one not be cautious?\"\n\n---\n\nIn the third chapter, Carpenter Shi traveled to Qi and reached Qu Yuan, where he saw a community altar tree. Its girth could shade an ox, its trunk measured a hundred spans, and its height towered ten *ren* above the mountain before branching. A dozen of its side growths could serve as boats. Onlookers thronged like a marketplace, yet the master carpenter did not glance at it and continued on his way without pause.",
      "overlap_context": " teaching says: Do not alter orders, do not urge completion. Excessive change is harmful. Altering orders and urging completion endanger the matter. Success built over time endures; failure, once formed, cannot be amended—can one not be cautious?\n\nMoreover, to ride the world’s currents and roam the heart, to entrust oneself to necessity and nurture the center—this is perfection. What need is there for contrivance or repayment? It is best to deliver the charge faithfully. This is the difficulty.\"",
      "start_char": 9450,
      "end_char": 9907,
      "start_sentence": 669,
      "end_sentence": 702,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.453943967819214,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\庄子内篇订正.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 22,
      "original_text": "弟子厌观之，走及匠石，曰：自吾执斧斤以随夫子，未尝见材如此其美也。 先生不肯视，行不辍，何邪？ 曰：已矣，勿言迄矣。 散木也。 以为舟则沈，以为棺椁则速腐，以为器则速毁，以为门户则掖樠，以为柱则蠹，是不材之木也。 无所可用，故能若是之寿。 匠石归，砾杜见梦曰：女将恶乎比予哉？ 若将比予於文木耶？ 夫祖梨橘柚，果蕨之属，溃熟则剥则辱。 大枝折，小枝泄一此以其能苦其生者也。 故不终其天年而中道夭，自舍击於世俗者也。 物莫不若是。 且予求无所可用久矣。 几死，乃今得之，为予大用。 使予也而有用，且得有此大也邪？ 且也若与予也皆物也，奈何哉其相物也。 而几死之散人，又恶知散木。 匠石觉而诊其梦。 弟子曰；",
      "translated_text": "The disciple, eager to examine it, ran to catch up with Carpenter Shi and said: \"Since I took up the axe and followed you, Master, I have never seen timber so magnificent as this. Yet you would not deign to look at it, walking on without pause—why?\"\n\n\"Enough,\" he replied. \"Say no more. It is a useless tree. Were one to make a boat of it, it would sink; a coffin or outer coffin, it would rot swiftly; vessels, they would break at once; doors or windows, it would ooze sap; pillars, it would be eaten by worms. It is a tree of no use—precisely why it has lived so long.\"\n\nCarpenter Shi returned home, and in a dream the altar tree of Qu appeared to him, saying: \"To what would you compare me? Would you liken me to the so-called 'fine timber'? Look at the hawthorn, pear, orange, pomelo, and other fruit-bearing trees: when their fruit ripens, they are stripped and humiliated. Their great branches break, their small branches are torn—all because their usefulness makes their lives bitter. Thus they do not live out their natural span but perish halfway, struck down by the world’s demands. All things are like this. As for me, I have sought to be of no use for a long time. Nearly dead, I have only now attained it—this is my great usefulness. Had I been of use, would I have grown so vast? Moreover, you and I are both things—how could one thing judge another? And you, a nearly dead man of no consequence—what could you know of a useless tree?\"\n\nCarpenter Shi awoke and pondered his dream. His disciple asked:",
      "overlap_context": "ay reach a point where it loses what it cherishes—can one not be cautious?\"\n\n---\n\nIn the third chapter, Carpenter Shi traveled to Qi and reached Qu Yuan, where he saw a community altar tree. Its girth could shade an ox, its trunk measured a hundred spans, and its height towered ten *ren* above the mountain before branching. A dozen of its side growths could serve as boats. Onlookers thronged like a marketplace, yet the master carpenter did not glance at it and continued on his way without pause.",
      "start_char": 9907,
      "end_char": 10191,
      "start_sentence": 703,
      "end_sentence": 721,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.318849086761475,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\庄子内篇订正.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 23,
      "original_text": "趣取无用，则为社何邪？ 曰：密。 若无言。 彼亦直寄焉。 以为不知己者诟厉也。 不为社者，且几有万乎。 且也彼其所保与众异，而以义喻之，不亦远乎。 右第四章 南伯子蔡游乎商之丘，见大木焉有异，结驷千乘，隐将花其所籁。 子綦曰：此何木也哉？ 此必有异材夫。 仰而视其细枝，则拳曲而不可以为栋梁； 俯而视其大根，则轴解而不可以为棺椁； 姑其叶，则口烂而为伤； 嗅之，则使人狂醒，三#5日而不已。 子莱曰：此果不材之木也，以至於此其大也。 嗟乎神人以此不材。",
      "translated_text": "\"To seek the useless—then what is it to the sacred tree?\nSilent.\nAs if speechless.\nIt merely lodges there, enduring the scorn of those who know it not.\nHad it not been for the sacred tree, would it have nearly reached ten thousand?\nMoreover, what it preserves differs from the multitude—yet to explain it by righteousness, is that not far off?\n\n**Chapter Four**\nNanbo Zicai roamed the hills of Shang, where he saw a great tree unlike any other. A thousand chariots could shelter beneath its shade, and its rustling leaves seemed to sing. Ziqi said: \"What tree is this? It must possess extraordinary timber.\"\nLooking up at its slender branches, they were gnarled and unfit for beams or rafters; gazing down at its massive roots, they were split and useless for coffins or outer caskets. Chewing its leaves, the mouth festered and bled; inhaling its scent, one fell into a frenzy, waking only after three days.\nZilai said: \"Truly, this is a tree of no use—yet it has grown so vast! Ah! The spirit-like person takes this as non-utility.\"",
      "overlap_context": "out their natural span but perish halfway, struck down by the world’s demands. All things are like this. As for me, I have sought to be of no use for a long time. Nearly dead, I have only now attained it—this is my great usefulness. Had I been of use, would I have grown so vast? Moreover, you and I are both things—how could one thing judge another? And you, a nearly dead man of no consequence—what could you know of a useless tree?\"\n\nCarpenter Shi awoke and pondered his dream. His disciple asked:",
      "start_char": 10191,
      "end_char": 10407,
      "start_sentence": 722,
      "end_sentence": 738,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.629287958145142,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\庄子内篇订正.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 24,
      "original_text": "宋有荆氏者，宜楸栢桑。 其栱把而上者，求狙猴之找者斩之； 三围四围，求高名之丽者斩之； 七围八围，贵人富商之家求禅傍者斩之。 故未终其天年而中道之天於斧斤。 此材之患也。 故解之以牛之白颡者，与豚之亢鼻者，与人有痔病者，不可以适河。 此皆巫祝以知之矣，所以为不祥也。 此乃神人之所以为大祥也。 右第五章 支离疏者，颐隐於齐，肩高於顶，会撮指天，五管在上，两髁为胁，挫针治繲，足以蝴口； 鼓荚播精，足以食十人。 上征武士，则支离攘臂於其间#6。 上有大役，则支离以有常疾不受功。 上与病者粟，则受三锺与十束薪。 夫支离其形者，犹足以养其身，终其天年，又瓦支离其德者乎。 孔子适楚，楚狂接舆游其门曰：凤子凤子，何如德之衰也。 来世不可待，往世不可追也。 天下有道，圣人成焉； 天下无道，圣人生焉。 方今之时，仅免刑焉。 福轻乎羽，莫之知载； 祸重乎地，莫之知避。 已乎，已乎。 临人以德。 殆乎，殆乎。 画地而趋。 述阳述阳，无伤吾行。 吾行却曲，无伤吾足。 山木了自寇也； 膏火，自煎也。 桂可食，故伐之； 漆可用，故割之。 人皆知有用之用，而莫知无用之用也。 右第六章 庄子内篇订正卷上竟",
      "translated_text": "**Chapter Five**\n\nIn the state of Song there was a region called Jing, where catalpa, cypress, and mulberry flourished. Those trees whose trunks measured but a hand’s span were felled for monkey perches; those of three or four arm-spans, for the beams of grand mansions; those of seven or eight arm-spans, for the sideboards of wealthy merchants. Thus they never lived out their natural years but perished midway beneath the axe. Such is the calamity of usefulness.\n\nHence, an ox with a white forehead, a pig with an upturned snout, or a man with hemorrhoids—none may cross the river. The shamans and priests know this well, for they deem such things inauspicious. Yet to the spirit-like person, these are precisely what make for great auspiciousness.\n\n**Chapter Six**\n\nThere was one named Zhili Shu, whose chin nestled in his navel, shoulders towered above his crown, topknot pointed to the sky, the five organs sat atop his frame, and his thighbones served as ribs. Mending needles and washing clothes earned him enough to feed himself; sifting chaff and winnowing grain sufficed to feed ten. When the authorities conscripted soldiers, Zhili waved his arms among the ranks; when great labor was demanded, Zhili, citing his chronic ailment, was excused from service. Yet when the state distributed grain to the infirm, he received three bushels and ten bundles of firewood. If one so deformed in body could still nourish himself and live out his natural years, how much more might one whose virtue is likewise deformed?\n\nConfucius traveled to Chu, where the madman Jie Yu wandered past his gate, singing:\n*\"Phoenix! Phoenix!\nHow virtue has declined!\nThe future cannot be awaited,\nThe past cannot be retrieved.\nWhen the world possesses the Way,\nThe sage achieves;\nWhen the world lacks the Way,\nThe sage survives.\nIn this present age,\nOne barely escapes punishment.\nFortune lighter than a feather—\nNone know how to bear it;\nDisaster heavier than the earth—\nNone know how to avoid it.\nEnough! Enough!\nApproach others with virtue.\nDangerous! Dangerous!\nMarking the ground to follow.\nWandering, wandering—\nLet nothing harm my path.\nMy path winds and bends—\nLet nothing harm my feet.\"*\n\nThe mountain tree invites its own felling;\nThe lamp’s oil hastens its own burning.\nCinnamon is edible—thus it is cut down;\nLacquer is useful—thus it is slashed.\nAll know the usefulness of the useful,\nYet none know the usefulness of the useless.\n\n*End of the First Scroll of the Inner Chapters of the Zhuangzi, Revised and Corrected*",
      "overlap_context": "ng. Ziqi said: \"What tree is this? It must possess extraordinary timber.\"\nLooking up at its slender branches, they were gnarled and unfit for beams or rafters; gazing down at its massive roots, they were split and useless for coffins or outer caskets. Chewing its leaves, the mouth festered and bled; inhaling its scent, one fell into a frenzy, waking only after three days.\nZilai said: \"Truly, this is a tree of no use—yet it has grown so vast! Ah! The spirit-like person takes this as non-utility.\"",
      "start_char": 10407,
      "end_char": 10879,
      "start_sentence": 739,
      "end_sentence": 774,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.726526737213135,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\庄子内篇订正.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 25,
      "original_text": "＃１『竟』据通行本应为『境』。 ＃２『』据通行本应为『苶』。 ＃３『知』据通行本应为『是』。 ＃４『牛』据通行本应为『数千牛』。 ＃５原本为『二』据通行本改为『三』。 ＃６原本为『支离攘臂於其间』据通行本应为『支离攘臂游於其问』。 庄子内篇订正卷下 临川吴澄述 德充符 鲁有兀者王驸，从之游者与仲尼相若。 常季问於仲尼曰：王驸，兀者也，从之游者与夫子中分鲁。 立不教，坐不议。 虚而往，实而归。 固有不言之教，无形而心成者邪？ 是何人也？ 仲尼曰：夫子，圣人也，丘也直后而未往耳。 丘将以为师，而况不若丘者乎。 奚假鲁国，丘将引天下而与从之。 常季曰：彼兀者也，而王先生，其与庸亦远矣。 若然者，其用心也独若之何？ 仲尼曰：死生亦大矣，而不得与之变。 虽天地覆坠，亦将不与之遗。 审乎无假而不与物迁，命物之化而守其宗也。 常季曰：何谓也？ 仲尼曰：自其异者视之，肝瞻楚越也。 自其同者视之，万物皆一也。 夫若然者，且不知耳目之所宜，而游心乎德之和。 物视其所一而不，一其所丧，视丧其足犹遗土也。 常季曰：彼为己，以其知得其心，以其心得其常心。 物何为最之哉？ 仲尼日：人莫鉴於流水而鉴於止水，唯止能止众止。 受命於地，唯松相独也#1，在冬夏青青。 受命於天，唯舜独也正#2，幸能正生，以正众生。 夫保始之征，不惧之实，勇士一人，雄入於九军。 将求名而能自要者而犹若是，而况官天地，府万物，直寓六骸，象耳目、一知之所知而心未尝死者乎？ 彼且择日而登假，人则从是也。 彼且何肯以物为事乎？ 右第一章 申徒嘉，兀者也，而与郑子产同师於伯昏无人。 子产谓申徒嘉曰：我先出则子止，子先出则我止。 其明日，又与合堂同席而坐。 子产谓申徒嘉曰：我先出则子止，子先出则我止，今我将出，子可以止乎？ 其未邪？ 且子见执政而不违，子齐执政乎？ 申徒嘉曰； 先生之门固有执政焉如此哉？ 子而说子之执政而后人者也？ 闻之曰：鉴明则尘垢不止，止则不明也。 久与贤人处则无过。 今子之所取大者，先生也，而犹出言若是，不亦过乎。 子产曰：子既若是矣，犹与尧争善。 计子之德，不足以自反邪？ 申徒嘉曰：自状其过，以不当亡者众，不状其过，以不当存者寡，知不可奈何而安之若命，唯有德者能之。 游於羿之壳中。 中央者，中地也。 然而不中者，命也。 人以其全足吠吾不全足者众矣，我怫然而怒，而适先生之所，则废然而反。 不知先生之洗我以善邪？ 吾与夫子游十九年，而未尝知吾兀者也。 今子与我游於形骸之内，而子索我於形骸之外，不亦过乎。 子产蹴然改容更貌曰：子无乃称。 右第二章 鲁有兀者叔山无趾，踵见仲尼。 仲尼曰：子不谨，前既犯患若是矣。 虽今来，何及矣。 无趾曰：吾唯不知务而轻用吾身，吾是以亡足。 今吾来也，犹有尊足者存，吾是以务全之也。 夫天无不覆，地无不载。 吾以夫子为天地，安知夫子之犹若是也。 孔子曰一丘则陋矣。 夫子胡不入乎，请讲以所闻。 无趾出。 孔子曰：弟子勉之。 夫无趾，兀者也。 犹务学以复补前行之恶，而况全德之人乎。 无趾语老聃曰：孔丘之於至人，其未邪？ 彼何宾宾以学子为。",
      "translated_text": "**Revised and Corrected Inner Chapters of the Zhuangzi, Scroll the Lower**\n\n**Virtue That Completes the Form**\n\nIn Lu there was a man without feet named Wang Tai. Those who followed him were as numerous as those who followed Confucius.\n\nChang Ji asked Confucius, “Wang Tai is a man without feet, yet those who follow him divide Lu equally with you. He stands without teaching, sits without discussing. The empty go to him, the full return. Is there truly a teaching without words, a formless shaping of the heart? What manner of man is he?”\n\nConfucius said, “This man is a sage. I am merely one who lags behind and has yet to visit him. I would take him as my teacher—how much more should those who are not my equal! Why limit it to Lu? I would lead all under heaven to follow him.”\n\nChang Ji said, “He is a man without feet, yet he surpasses you, Master. If so, how does he employ his heart so singularly?”\n\nConfucius said, “Life and death are great indeed, yet they cannot alter him. Though heaven and earth collapse, he would not be lost with them. He examines what is without reliance and does not shift with things, guiding the transformations of beings while guarding their root.”\n\nChang Ji said, “What does this mean?”\n\nConfucius said, “Viewed from their differences, liver and gall are as distant as Chu and Yue. Viewed from their sameness, the ten thousand things are all one. One who is thus does not know what the ears and eyes deem fitting but roams the heart in the harmony of virtue. He sees what is one in things and does not lose it; he sees the loss of his foot as the shedding of earth.”\n\nChang Ji said, “He cultivates himself, using his knowledge to attain his heart, and his heart to attain the constant heart. Why do things flock to him most of all?”\n\nConfucius said, “Men do not mirror themselves in flowing water but in still water—only stillness can still the many. Those who receive their mandate from earth, like the pine and cypress alone, remain verdant through winter and summer. Those who receive their mandate from heaven, like Shun alone, are upright. Fortunate is one who can make life upright and thereby make all lives upright. The proof of preserving the beginning is the substance of fearlessness. A single brave warrior strides into the nine armies. One who seeks fame and can bind himself is still thus—how much more one who governs heaven and earth, stores the ten thousand things, lodges in the six limbs, takes the ears and eyes as mere images, unifies the knowledge of knowledge, and whose heart has never died? He will choose a day to ascend on high, and men will follow him. How would he deign to make things his concern?”\n\n---\n\n**Chapter One**\n\nShentu Jia, a man without feet, studied under Bo Hun Wu Ren alongside Zichan of Zheng.\n\nZichan said to Shentu Jia, “If I go out first, you stay; if you go out first, I stay.” The next day, they again sat together in the same hall. Zichan said to Shentu Jia, “If I go out first, you stay; if you go out first, I stay. Now I am about to go out—can you stay? Or is this not so? Moreover, you see the one in power and do not avoid him. Do you consider yourself equal to the one in power?”\n\nShentu Jia said, “In the Master’s gate, is there truly one in power like this? Are you pleased with your own power and look down on others? I have heard that when a mirror is bright, dust does not settle; when it settles, it is no longer bright. To dwell long with the worthy is to be without fault. Now, what you take as greatest is the Master, yet you still speak thus—is this not a fault?”\n\nZichan said, “You are already thus, yet you still vie with Yao in goodness. By your virtue, are you not sufficient to reflect upon yourself?”\n\nShentu Jia said, “Those who justify their faults, claiming they should not have lost what they lost, are many. Those who do not justify their faults, claiming they should not have kept what they kept, are few. To know there is nothing to be done and to accept it as fate—only one with virtue can do this. I wander within Yi’s bow’s range. The center is the center of the target, yet to not hit the center is fate. Men bark at my incomplete feet as if I were whole, and I bristle with anger. But when I reach the Master’s place, I return composed. Do I not know the Master washes me with goodness? I have followed you, Master, for nineteen years and have never known I was a man without feet. Now you follow me within the form, yet seek me outside the form—is this not a fault?”\n\nZichan, startled, changed his expression and said, “You need not speak further.”\n\n---\n\n**Chapter Two**\n\nIn Lu there was a man without toes named Shushan Wuzhi. He came to see Confucius on his heels.\n\nConfucius said, “You were not careful, and already suffered such misfortune. Though you come now, what can be done?”\n\nWuzhi said, “I only did not know my duty and lightly used my body, which is why I lost my foot. Now I come because what is worthy of my foot still remains, and I strive to preserve it. Heaven covers all without exception; earth bears all without exception. I took you, Master, to be like heaven and earth—how could I have known you would be thus?”\n\nConfucius said, “I am but a man of a hill—how crude! Why not enter and let me expound what I have heard?”\n\nWuzhi departed. Confucius said, “Disciples, exert yourselves! Wuzhi is a man without toes, yet he strives to learn to remedy his past misdeeds—how much more should one of complete virtue!”\n\nWuzhi said to Lao Dan, “Is Confucius not yet a perfected man? Why does he so assiduously take you as his teacher?”",
      "overlap_context": " with virtue.\nDangerous! Dangerous!\nMarking the ground to follow.\nWandering, wandering—\nLet nothing harm my path.\nMy path winds and bends—\nLet nothing harm my feet.\"*\n\nThe mountain tree invites its own felling;\nThe lamp’s oil hastens its own burning.\nCinnamon is edible—thus it is cut down;\nLacquer is useful—thus it is slashed.\nAll know the usefulness of the useful,\nYet none know the usefulness of the useless.\n\n*End of the First Scroll of the Inner Chapters of the Zhuangzi, Revised and Corrected*",
      "start_char": 10879,
      "end_char": 12124,
      "start_sentence": 775,
      "end_sentence": 851,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.95403552055359,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\庄子内篇订正.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 26,
      "original_text": "彼且薪以諔诡幻怪之名闻，不知至人之以是为己桎梏邪？ 老聃曰：胡不直使彼以死生为一条，以可不可为一贯者，解其桎梏，其可乎？ 无趾曰：天刑之，安可解。 右第三章 鲁哀公问於仲尼曰：卫有恶人焉，曰哀驸它。 丈夫与之处者，思而不能去也。 妇人见之，请於父母曰，与为人妻，宁为夫子妾者，十数而未止也。 未尝有闻其唱者也，常和人而已矣。 无君人之位以济乎人之死，无聚禄以望人之腹。 又以恶骇天下，和而不唱，知不出乎四域，且而雌雄合乎前。 是必有异乎人者也。 寡人召而观之，果以恶骇天下，与寡人处，不至以月数，而寡人有意乎其为人也； 不至乎期年，而寡人信之。 国无宰，寡人传国焉。 闷然而后应，泛而若辞。 寡人丑乎，卒授之国。 无几何也，去寡人而行。 寡人恤焉若有亡也，若无与乐是国也。 是何人者也？ 仲尼曰：丘也尝使於楚矣，适见纯子食於其死母者。 少焉胸若，皆弃之而走。 不见己焉，亦不得类焉。 亦所爱其母也，非爱其形也，爱使其形者也。 战而死者，其人之葬也，不以霎资； 刖者之履，无为爱之。 皆无其本矣。",
      "translated_text": "He flaunts such bizarre and fantastical renown, yet does he not know that the perfected man sees these as his own shackles?\n\nLao Dan said, “Why not simply lead him to regard life and death as a single thread, the permissible and the impermissible as one continuum, and thus free him from his bonds? Would that be possible?”\n\nWuzhi replied, “Heaven has punished him—how could it be undone?”\n\n---\n\n**Chapter Three**\n\nDuke Ai of Lu asked Confucius, “In Wei there is an ugly man named Aitai Tuo. When men dwell with him, they grow so attached they cannot bear to leave. When women see him, they plead with their parents, saying, ‘Better to be this man’s concubine than another’s wife’—and this has happened more than ten times. He never initiates speech, only ever harmonizing with others. He holds no lordly rank to deliver men from death, nor amasses wealth to fill their bellies. Moreover, his ugliness startles all under heaven, yet he harmonizes without leading, and his wisdom does not extend beyond his immediate sphere. Yet before him, male and female alike gather—there must be something extraordinary about him. I summoned him to observe, and indeed, his ugliness startled all under heaven. When he dwelt with me, in less than a month I took interest in his character; before a year had passed, I trusted him completely. As the state had no steward, I offered him the governance. He responded with hesitation, as if reluctant, and when he did speak, it was as though he declined. I felt ashamed, yet in the end I entrusted him with the state. Before long, he left me and departed. I grieved as though I had lost something, as though no one remained to share the joy of ruling this state. What manner of man is he?”\n\nConfucius said, “I once traveled to Chu and happened to see a young pig nursing from its dead mother. After a moment, the piglets shrank back in fear, all abandoning her and fleeing. They no longer saw her as their own, nor recognized her as one of their kind. What they had loved was their mother, not her form, but that which gave her form. When warriors die in battle, their burials are not adorned with military trappings; when a man’s feet are severed, no one cherishes his shoes. In both cases, the root is gone.”",
      "overlap_context": "ook you, Master, to be like heaven and earth—how could I have known you would be thus?”\n\nConfucius said, “I am but a man of a hill—how crude! Why not enter and let me expound what I have heard?”\n\nWuzhi departed. Confucius said, “Disciples, exert yourselves! Wuzhi is a man without toes, yet he strives to learn to remedy his past misdeeds—how much more should one of complete virtue!”\n\nWuzhi said to Lao Dan, “Is Confucius not yet a perfected man? Why does he so assiduously take you as his teacher?”",
      "start_char": 12124,
      "end_char": 12552,
      "start_sentence": 852,
      "end_sentence": 877,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.573687076568604,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\庄子内篇订正.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 27,
      "original_text": "为天子之诸御，不爪前，不穿耳； 取妻者止於外，不得复使。 形全犹足以为示，而况全德之人乎。 今哀胎它未言而信，无功而亲，使人授己国，唯恐其不受也，是必才全而德不形者也。 一辰公曰：何谓才全？ 仲尼曰：死生、存亡、穷达、贫富、贤与不肖、毁誉、饥渴、寒暑、是事之变、命之行也。 日夜相代乎前，而知不能规乎其始者也。 故不足以滑和，不可入於灵府。 使之和豫通而不失於兑。 使日无郄而与物为春，是接而生时乎心者也。 是之谓才全。 何谓德不形？ 曰：平者，水停之盛也。 其可以为法也，内保之而外不荡也。 德者，成和之修也。 德不形者，物不能离也。 一及公异日以告闵子曰：始也吾以南面而君天下，执民之纪而忧其死，吾自以为至通矣。 今吾闻至人之言，恐吾无其实，轻用吾身而亡吾国。 吾与孔丘，非君臣也，德友而已矣。 右第四章 闽跂支离无脤说卫灵公，灵公说之，而视全人； 其脰肩肩。 瓮瓮大瘿说齐桓公，桓公说之，而视全人； 其脰肩肩。 故德有所长而形有所忘。 人不忘其所忘，而忘其所不忘，此谓诚忘。 故圣人有所游，而知为孽，约为胶，德为接，工为商。 圣人不谋，恶用知？ 不斲，恶用胶？ 无丧，恶用德？ 不货，恶用商？ 四者，天斋也。 天斋也者，天食也。 既受食於天，又恶用人。 右第五章 有人之形，无人之情。 有人之形，故群於人； 无人之情，故是非不得於身。 眇乎小哉，所以属於人也； 警乎大哉，独成其天。 惠子谓庄子日：人故无情乎？ 庄子曰：然。 惠子曰：人而无情，何以谓之人？ 庄子曰：道与、之貌，天与之形，恶得不谓之人？ 惠子曰：既谓之人，恶得无情？ 庄子曰：是非吾所谓情也。 吾所谓吾情者，言人之不以好恶内伤其身，常因自然而不益生也。 惠子曰：不益生，何以有其身？ 庄子曰：道与之貌，天与之形，无以好恶内伤其身。 今子外乎子之神，劳乎子之精，倚树而吟，据槁梧而暝。 天选子之形，子以坚白呜。 右第六章 大宗师",
      "translated_text": "The attendants of the Son of Heaven do not pare their nails nor pierce their ears; those who take wives remain outside the court and are no longer employed in service. If one whose form is whole may yet be deemed fit for display, how much more so the man of perfect virtue!\n\nNow, Ai Taituo spoke not a word yet was trusted, had no merit yet was cherished, was offered a state yet feared only that he might refuse—this must be a man of complete talent whose virtue remains unmanifest.\n\nDuke Ai said, “What is meant by *complete talent*?”\nConfucius replied, “Life and death, survival and ruin, failure and success, poverty and wealth, worthiness and unworthiness, slander and praise, hunger and thirst, cold and heat—these are the changes of affairs, the workings of fate. They alternate before us day and night, yet knowledge cannot fathom their beginnings. Therefore, they must not be allowed to disturb harmony or enter the sacred chamber of the mind. Let them flow smoothly without losing joy; let the days pass without discord, ever bringing spring to all things—this is to meet them with a heart that gives life to the seasons. This is what is called *complete talent*.”\n\n“What is meant by *virtue unmanifest*?”\n“Stillness is the fullness of water at rest. It may serve as a model, for inwardly it preserves itself while outwardly it remains undisturbed. Virtue is the cultivation of perfect harmony. When virtue is unmanifest, nothing can depart from it.”\n\nAnother day, Duke Ai told Minzi, “At first, I faced south as lord of the world, wielding the people’s guiding principles and fearing their deaths—I thought myself supremely enlightened. Now, having heard the words of a perfected man, I fear I lack true substance, that I have recklessly spent myself and lost my state. I and Kong Qiu are not ruler and subject—we are friends in virtue.”\n\n---\n\nChapter Four\n\nThe hunchbacked, limbless man without lips spoke to Duke Ling of Wei, and the duke was delighted with him, yet when he looked upon whole men, their necks seemed too slender. The man with a great goiter spoke to Duke Huan of Qi, and the duke was delighted with him, yet when he looked upon whole men, their necks seemed too slender. Thus, when virtue excels, form is forgotten. If men do not forget what ought to be forgotten but forget what ought not to be forgotten, this is called *true forgetting*.\n\nTherefore, the sage wanders freely, and knowledge becomes a snare, covenants become glue, virtue becomes a bond, skill becomes commerce. The sage does not scheme—why employ knowledge? He does not carve—why employ glue? He suffers no loss—why employ virtue? He does not trade—why employ commerce? These four are the fasting of the heavens. The fasting of the heavens is the sustenance of heaven. Having received sustenance from heaven, why employ man?\n\n---\n\nChapter Five\n\nOne may have the form of a man yet lack the passions of a man. Having the form of a man, he mingles with others; lacking the passions of a man, right and wrong do not cling to him. Insignificant and small, he belongs to mankind; vast and great, he completes his heaven alone.\n\nHuizi said to Zhuangzi, “Can a man truly be without passion?”\nZhuangzi replied, “Yes.”\nHuizi said, “If a man has no passion, how can he be called a man?”\nZhuangzi said, “The Dao gives him his appearance, heaven gives him his form—how can he not be called a man?”\nHuizi said, “If he is called a man, how can he be without passion?”\nZhuangzi said, “This is not what I mean by passion. What I call passion is when a man does not allow likes and dislikes to inwardly harm his person, but constantly follows nature without augmenting life.”\nHuizi said, “If he does not augment life, how does he preserve his person?”\nZhuangzi said, “The Dao gives him his appearance, heaven gives him his form—he does not allow likes and dislikes to inwardly harm his person. Now, you exhaust your spirit outwardly, weary your essence, lean against a tree and chant, rest your head on a withered catalpa and doze. Heaven chose your form, yet you prattle on about ‘hard’ and ‘white.’”\n\n---\n\nChapter Six: *The Great and Venerable Teacher*",
      "overlap_context": "once traveled to Chu and happened to see a young pig nursing from its dead mother. After a moment, the piglets shrank back in fear, all abandoning her and fleeing. They no longer saw her as their own, nor recognized her as one of their kind. What they had loved was their mother, not her form, but that which gave her form. When warriors die in battle, their burials are not adorned with military trappings; when a man’s feet are severed, no one cherishes his shoes. In both cases, the root is gone.”",
      "start_char": 12552,
      "end_char": 13318,
      "start_sentence": 878,
      "end_sentence": 930,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.682374715805054,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\庄子内篇订正.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 28,
      "original_text": "知天之所为，知人之所为者，至矣。 知天之所为者，天而生也； 知人之所为者，以其知之所知，以养其知之所不知，终其天年而不中道夭者，是知之盛也。 虽然，有患。 夫知有所待而后当，其所待者特未定也。 庸诅知吾所谓天之非人乎？ 所谓人之非天乎？ 且有真人而后有真知。 何谓真人？ 古之真人，不逆寡，不雄成，不谟士。 若然者，过而弗悔，当而不自得也； 若然者，登高不栗，入水不濡，入火不热。 是知之能登假於道也若此。 古之真人，其寝不梦，其觉无忧，其食不甘，其息探深。 真人之息以踵，众人之息以喉。 屈服者，其哑言若哇。 其耆欲深者，其天机浅。 古之真人，不知说生，不知恶死； 其出不欣，其入不距； 鲦然而往，修然而来而已矣。 不忘其所始，不求其所终； 受而喜之，忘而复之，是之谓不以心捐道，不以人助天。 是之谓真人。 若然者，其心志，其容寂，其颗俯。 凄然似秋，暖然似春，喜怒通四时，与物有宜而莫知其极。 故圣人之用兵也，亡国而不失人心。 利泽施乎万世，不为爱人。 故乐通物，非圣人也； 有亲，非仁也； 天时，非贤也； 利害不通，非君子也； 行名失己，非士也； 亡身不真，非役人也。 若狐不偕、务光、伯夷、叔齐、箕子、胥余、纪他、申徒狄，是役人之役，适人之适，而不自适其适者也。 古之真人，其状义而不朋，若不足而不承； 与乎其肌而不坚也，张乎其虚而不华也； 邴邴乎其似喜乎，崔乎其不得已乎。 滀乎进我色也，与乎止我德也； 厉乎其似世乎，警乎其未可制也； 连乎其似好闲也，悦乎忘其言也。 以刑为体，以礼为翼，以知为时，以德为循。 以刑为体者，绰乎其杀也； 以礼为翼者，所以行於世也； 以知为时者，不得已於事也； 以德为循者，言其与有足者至於丘也，而人真以为勤行者也。 故其好之也一。 其弗好之也一，其一也一，其不一也一。 其一与天为徒。 其不一天与人不相胜也，是之谓真人。 泉涸，鱼相与处於陆，相呴以湿，相濡以沬，不如相忘於江湖。 与其誉尧而非桀也，不如两忘而化其道。 夫大块载我以形，劳我以生，佚我以老，息我以死，故善吾生者，乃所以善吾死也。 死生，命也，其有夜旦之常，天也。 人之有所不得与，皆物之情也。 彼特以天为父，而身犹爱之，而况其卓乎？ 人特以有君为愈乎己，而身犹死之，而况其真乎？ 夫藏舟於壑，藏山於泽，谓之固矣。 然而夜半有力者负之而走，昧者不知也。 藏小大有宜，犹有所逛。 若夫藏天下於天下而不得所迟，是恒物之大情也。 特犯人之形而犹喜之。 若人之形者，万化而未始有极也，其为乐可胜计邪？ 故圣人将游於物之所不得返而皆存。 善夭善老，善怒善终，人犹效之，又况万物之所系而一化之所待乎？ 夫道，有情有信，无为无形； 可传而不可受，可得而不可见； 自本自，未有天地，自古以固存； 神鬼神，生天生地； 在太极之先而不为高，在六极之下而不为深，先天地生而不为久，长於上古而不为老。 稀韦氏得之，以挈天地； 伏羲氏得之，以袭气母； 维斗得之，终古不武； 日月得之，终古不息； 堪坏得之，以袭昆仑； 冯夷得之，以游大川； 肩吾得之，以处大山； 黄帝得之，以登云天；",
      "translated_text": "Those who know what Heaven does and what man does have reached the utmost. To know what Heaven does is to be born of Heaven; to know what man does is to use what one’s knowledge knows to nourish what one’s knowledge does not know, thus fulfilling one’s Heaven-appointed years without perishing midway—this is the fullness of knowledge.\n\nYet there is a peril. For knowledge must await something before it is fitting, and what it awaits is never certain. How can we know that what I call Heaven is not man? That what I call man is not Heaven? Only when there is a true man is there true knowledge.\n\nWhat is a true man? The true men of old did not oppose the few, did not presume upon success, did not scheme. Such men, though they erred, felt no regret; though they succeeded, felt no self-satisfaction. Such men, when they climbed heights, did not tremble; when they entered water, did not get wet; when they entered fire, did not feel heat. Their knowledge could ascend to the Dao in this way.\n\nThe true men of old slept without dreaming, woke without care; ate without relishing, breathed deeply. The true man breathes from his heels; the common man breathes from his throat. Those who are bent and submissive croak their words as if retching. The deeper one’s desires, the shallower one’s Heavenly mechanism.\n\nThe true men of old did not rejoice in life, did not hate death. They emerged without delight, entered without resistance—lightly they came, calmly they went. They did not forget their beginning, did not seek their end. They received and rejoiced in it, forgot and returned to it—this is what is meant by not using the mind to cast aside the Dao, not using man to aid Heaven. This is what is called the true man.\n\nSuch men had minds at ease, countenances serene, brows relaxed. Cold as autumn, warm as spring, their joy and anger flowed with the four seasons, harmonizing with things yet without limit. Thus, when the sage employs arms, he may destroy a state yet not lose the people’s hearts. His beneficence extends to ten thousand generations, yet he does not do it out of love for men.\n\nTherefore, one who delights in harmonizing with things is no sage; one who has partiality is not benevolent; one who relies on Heaven’s timing is not worthy; one who does not comprehend advantage and harm is no gentleman; one who pursues fame at the cost of self is no scholar; one who loses himself yet is not true is no servant of men. Men like Hu Buxie, Wu Guang, Boyi, Shuqi, Jizi, Xuyu, Ji Ta, and Shentu Di—these are servants of men’s service, followers of others’ paths, not seekers of their own fulfillment.\n\nThe true men of old had a bearing of righteousness yet were not partisan; seemed insufficient yet did not defer. They were substantial in form yet not rigid, expansive in emptiness yet not ostentatious. Cheerful as if pleased, solemn as if compelled. Their demeanor invited trust, their virtue brought stillness. Stern as if worldly, alert as if beyond control. Connected as if fond of leisure, joyful as if forgetting words.\n\nThey took punishment as their body, ritual as their wings, knowledge as their timing, virtue as their guide. Taking punishment as their body, they were lenient in execution. Taking ritual as their wings, they moved through the world. Taking knowledge as their timing, they acted only when compelled. Taking virtue as their guide, they spoke as if arriving at the hills with those who have feet—yet men truly believed them to be diligent in conduct.\n\nThus, their liking was one, their disliking was one; their oneness was one, their not-oneness was one. Their oneness joined them to Heaven as companions. Their not-oneness did not contend with man—this is what is called the true man.\n\nWhen the spring dries up, fish find themselves together on land, moistening one another with breath, wetting one another with foam—better to forget one another in rivers and lakes. Rather than praising Yao and condemning Jie, better to forget both and be transformed by the Dao.\n\nThe great clod burdens me with form, labors me with life, eases me with old age, rests me with death. Thus, to make my life good is to make my death good. Life and death are fate, as constant as night and day—this is Heaven. What man cannot partake in is the nature of things.\n\nHe who takes Heaven as his father yet still loves his body—how much more should he love what transcends it? He who takes a lord as superior to himself yet still dies for his body—how much more should he die for what is true?\n\nHiding a boat in a ravine, hiding a mountain in a marsh—this seems secure. Yet in the dead of night, a strong man may carry them away, and the unaware do not know. Hiding the small and large appropriately still leaves room for displacement. But to hide the world within the world is to find no place of delay—this is the great constancy of things.\n\nEven one who cherishes his human form should rejoice in it. How much more should one rejoice in the myriad transformations of this form, which have no end? Can the joy of it be measured? Thus, the sage wanders where things cannot return yet all endure.\n\nTo be good at early death, good at old age, good at beginning, good at ending—men still emulate this. How much more should they emulate what binds the ten thousand things and awaits the one transformation?\n\nThe Dao has essence and trustworthiness, yet is without action or form. It can be transmitted but not received, attained but not seen. It is self-originating, self-so—before Heaven and Earth existed, it was already firmly established. It spiritually animates ghosts and spirits, gives birth to Heaven and Earth. It is before the Supreme Polarity yet not high; below the Six Directions yet not deep. It preceded Heaven and Earth yet is not ancient; it is older than the oldest yet not aged.\n\nXiwei obtained it and thereby lifted Heaven and Earth. Fuxi obtained it and thereby embraced the mother of qi. The Northern Dipper obtained it and has never faltered since ancient times. The sun and moon obtained it and have never ceased since ancient times. Kanpi obtained it and thereby embraced Kunlun. Feng Yi obtained it and thereby roamed the great rivers. Jian Wu obtained it and thereby dwelled on the great mountains. The Yellow Emperor obtained it and thereby ascended to the cloudy heavens.",
      "overlap_context": "out augmenting life.”\nHuizi said, “If he does not augment life, how does he preserve his person?”\nZhuangzi said, “The Dao gives him his appearance, heaven gives him his form—he does not allow likes and dislikes to inwardly harm his person. Now, you exhaust your spirit outwardly, weary your essence, lean against a tree and chant, rest your head on a withered catalpa and doze. Heaven chose your form, yet you prattle on about ‘hard’ and ‘white.’”\n\n---\n\nChapter Six: *The Great and Venerable Teacher*",
      "start_char": 13318,
      "end_char": 14524,
      "start_sentence": 931,
      "end_sentence": 1007,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.270235538482666,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\庄子内篇订正.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 29,
      "original_text": "颛项得之，以处玄宫； 禺强得之，立乎北极； 西王母得之，坐乎少广，莫知其始，莫知其终； 彭祖得之，上及有虞，下及五伯； 传说得之，以相武丁，奄有天下，乘束维、骑箕尾而比於列星。 右第一章 南伯子葵问乎女偶曰：子之年长矣，而色若孺子，何也？ 曰：吾闻道矣。 南伯子葵曰：道可得学邪？ 曰：恶。 恶可。 子非其人也。 夫卜梁倚有圣人之才而无圣人之道，我有圣人之道而无圣人之才。 吾欲以教之，庶几其果为圣人乎。 不然，以圣人之道告圣人之才，亦易矣。 吾犹守而告之，参日而后能外天下； 已外天下矣，吾又守之，七日而后能外物； 已外物矣，吾又守之，九日而后能外生； 已外生矣，而后能朝彻，朝彻而后能见独； 见独而后能无古今； 无古今而后能入於不死不生。 杀生者不死，生生者不生。 其为物无不将也，无不迎也，无不毁也，无不成也。 其名为撄宁。 撄宁也者，撄而后成者也。 南伯子葵曰：子独恶乎闻之？ 曰：闻诸副墨之子。 副墨之子闻诸洛诵之孙，洛诵之孙闻之瞻明，瞻明闻之聂许，聂许闻之需役，需役闻之於讴，於讴闻之玄冥，玄冥闻之参寥，参寥闻之疑始。 右第二章 子祀、子与、子犁、子来四人相与语曰：孰能以无为首，以生为脊，以死为尸； 孰知死生存亡之一体者，吾与之友矣。 四人相视而笑，莫逆於心，遂相与为友。 俄而子与有病，子祀往问之。 曰：伟哉，夫造物者将以予为此拘拘也。",
      "translated_text": "Zhuanxu obtained it and thereby dwelled in the Dark Palace. Yuqiang obtained it and stood at the Northern Culmen. The Queen Mother of the West obtained it and sat in the Lesser Expanse—none knew her beginning, none knew her end. Pengzu obtained it, reaching upward to the age of Yu and downward to the Five Hegemons. Fu Yue obtained it and thereby assisted Wu Ding, encompassing all under Heaven, riding the Eastern Rope and mounting the Tail of the Winnowing Basket to rank among the arrayed stars.\n\n---\n\n**Chapter One**\nNanbo Zikui asked of Nü’ou: “Your years are advanced, yet your complexion is like that of a child—how is this?”\nHe replied: “I have heard the Dao.”\nNanbo Zikui said: “Can the Dao be learned?”\nHe replied: “No. How could it be? You are not the right person. Now, Pulian Yi possesses the talent of a sage but not the Dao of a sage, while I possess the Dao of a sage but not the talent of a sage. I wished to teach him, hoping he might indeed become a sage. If not, to impart the Dao of a sage to one with the talent of a sage would be easy. Yet I still guarded it and instructed him: after three days, he could put the world outside himself. Having put the world outside, I guarded it further, and after seven days, he could put things outside himself. Having put things outside, I guarded it further, and after nine days, he could put life outside himself. Having put life outside, he could then attain morning clarity. With morning clarity, he could then perceive the solitary. Perceiving the solitary, he could then transcend past and present. Transcending past and present, he could then enter the realm of neither death nor life. That which kills life does not die; that which gives life to life does not live. As a thing, it sends nothing off, welcomes nothing, destroys nothing, completes nothing. Its name is *yingning* (serene disturbance). *Yingning*—it is that which is completed only after disturbance.”\nNanbo Zikui said: “From whom did you alone hear this?”\nHe replied: “I heard it from the son of Fu Mo. The son of Fu Mo heard it from the grandson of Luo Song. The grandson of Luo Song heard it from Zhan Ming. Zhan Ming heard it from Nie Xu. Nie Xu heard it from Xu Yi. Xu Yi heard it from Wu Ou. Wu Ou heard it from Xuan Ming. Xuan Ming heard it from Can Liao. Can Liao heard it from Yi Shi.”\n\n---\n\n**Chapter Two**\nZi Si, Zi Yu, Zi Li, and Zi Lai spoke among themselves: “Who can take nonbeing as the head, life as the spine, and death as the tail? Who knows that death and life, existence and nonexistence, are of one body? We would befriend him.”\nThe four looked at one another and smiled, their hearts in accord, and so became friends.\n\nSoon after, Zi Yu fell ill. Zi Si went to inquire of him.\nHe said: “How wondrous! The Creator is about to make me thus crooked and bent.”",
      "overlap_context": "iwei obtained it and thereby lifted Heaven and Earth. Fuxi obtained it and thereby embraced the mother of qi. The Northern Dipper obtained it and has never faltered since ancient times. The sun and moon obtained it and have never ceased since ancient times. Kanpi obtained it and thereby embraced Kunlun. Feng Yi obtained it and thereby roamed the great rivers. Jian Wu obtained it and thereby dwelled on the great mountains. The Yellow Emperor obtained it and thereby ascended to the cloudy heavens.",
      "start_char": 14524,
      "end_char": 15079,
      "start_sentence": 1008,
      "end_sentence": 1041,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.835771799087524,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\庄子内篇订正.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 30,
      "original_text": "曲楼发背，上有五管，颐隐於齐，肩高於顶，句赘指天，阴阳之气有沙，其心问而无事，鉼踪而鉴于井。 曰：嗟乎。 夫造物者又将以予为此拘拘也。 子杞曰：女恶之乎？ 曰：亡，予何恶。 浸假而化予之左臂以为鹦，予因以求时夜； 浸假而化予之右臂以为弹，予因以求鸮炙； 浸假而化予之尻以为输，以神为马，予因而乘之，岂更驾哉。 且夫得者，时也； 失者，顺也。 安时而处顺，一及乐不能入也，此古之所谓县解也，而不能自解者，物有结之。 且夫物不胜天久矣，吾又何恶焉。 俄而子来有病，喘喘然将死。 其妻子环而泣之。 犁往问之，日：叱。 避。 无怛化。 倚其户与之语曰：伟哉造化。 又将奚以汝为？ 将奚以汝适？",
      "translated_text": "The crooked hump rose from his back, five tubes protruding above, his chin sinking to his navel, his shoulders towering above his crown, the growth at his nape pointing to the sky—his yin and yang qi disordered. Yet his heart remained unperturbed, and he strolled to the well to gaze at his reflection.\n\nHe said: “Alas! The Creator is about to make me thus crooked and bent.”\n\nZi Si said: “Do you resent it?”\n\nHe replied: “No, why should I resent it? If by degrees my left arm were transformed into a cock, I would use it to seek the dawn; if by degrees my right arm were transformed into a crossbow, I would use it to hunt an owl for roasting; if by degrees my buttocks were transformed into wheels, and my spirit into a horse, I would ride them—why ever change mounts?\n\nMoreover, to gain is a matter of timing; to lose is a matter of compliance. Abiding in timely accord and dwelling in compliance, neither joy nor sorrow can enter. This is what the ancients called ‘suspended release.’ Yet those who cannot release themselves are bound by things. Furthermore, things have never triumphed over Heaven for long—why should I resent it?”\n\nSoon after, Zi Lai fell ill, gasping as if near death. His wife and children gathered around weeping. Zi Li went to inquire of him and shouted: “Away! Begone! Do not disturb his transformation.”\n\nLeaning against the doorframe, he spoke to him: “How wondrous is the Creator! What will it make of you next? Where will it send you?”",
      "overlap_context": "t from Yi Shi.”\n\n---\n\n**Chapter Two**\nZi Si, Zi Yu, Zi Li, and Zi Lai spoke among themselves: “Who can take nonbeing as the head, life as the spine, and death as the tail? Who knows that death and life, existence and nonexistence, are of one body? We would befriend him.”\nThe four looked at one another and smiled, their hearts in accord, and so became friends.\n\nSoon after, Zi Yu fell ill. Zi Si went to inquire of him.\nHe said: “How wondrous! The Creator is about to make me thus crooked and bent.”",
      "start_char": 15079,
      "end_char": 15352,
      "start_sentence": 1042,
      "end_sentence": 1061,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.608110427856445,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\庄子内篇订正.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 31,
      "original_text": "以汝为鼠肝乎？ 以汝为虫臂乎？ 子来曰：父母於子，东西南北，唯命之从。 阴阳於人，不翅於父母。 彼近吾死而我不听，我则悍矣，彼何罪焉？ 夫大块载我以形，劳我以生，佚我以老，息我以死。 故善吾生者，乃所以善吾死也。 今大冷铸金，金踊跃曰：我且必为锁邹。 大冷必以为不祥之金。 今一犯人之形而曰：人耳，人耳，夫造化者必以为不祥之人。 今一以天地为大炉，以造化为大冷，恶乎往而不可哉。 成然寐，莲然觉。 右第三章 子桑户、孟子反、子琴张三人相与友，曰：孰能相与於无相与，相为於无相为？ 孰能登天游雾，挠挑无极，相忘以生，无所终穷？ 三人相视而哄，莫逆於心。 遂相与友。",
      "translated_text": "“Shall it make you into a rat’s liver? Or the arm of an insect?”\n\nZi Lai replied: “To a child, father and mother may bid east or west, and the child obeys without question. Yet the workings of yin and yang upon a person are no less than father and mother. If they draw near to my death and I refuse to heed them, I would be obstinate—what fault would lie with them? The Great Clod bears me with form, labors me with life, eases me with age, and rests me with death. Thus to treat my life well is to treat my death well.\n\nNow, if a great smelter were casting metal, and the molten metal leapt up crying, ‘I must become a Moye sword!’ the smelter would surely deem it ill-omened metal. Likewise, if one who has assumed human form were to say, ‘I am human! I am human!’ the Creator would surely deem it an ill-omened person. Now, if we regard Heaven and Earth as a great furnace and the Creator as a great smelter, where could we go and not be acceptable?”\n\nThen he fell into a deep sleep and awoke refreshed.\n\n---\n\n**Chapter Three**\n\nZi Sanghu, Meng Zifan, and Zi Qinzhang became friends and said to one another: “Who can join together in non-joining, act for one another in non-acting? Who can ascend to heaven and wander in the mists, roaming without bound, forgetting life and having no end?”\n\nThe three looked at one another and laughed, their hearts in perfect accord. Thus they became friends.",
      "overlap_context": " ‘suspended release.’ Yet those who cannot release themselves are bound by things. Furthermore, things have never triumphed over Heaven for long—why should I resent it?”\n\nSoon after, Zi Lai fell ill, gasping as if near death. His wife and children gathered around weeping. Zi Li went to inquire of him and shouted: “Away! Begone! Do not disturb his transformation.”\n\nLeaning against the doorframe, he spoke to him: “How wondrous is the Creator! What will it make of you next? Where will it send you?”",
      "start_char": 15352,
      "end_char": 15623,
      "start_sentence": 1062,
      "end_sentence": 1078,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.274577856063843,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\庄子内篇订正.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 32,
      "original_text": "莫然有间而子桑户死，未葬。 孔子闻之，使子贡往待事焉。 或编曲，或鼓琴，相和而歌曰：嗟来桑户乎。 嗟来桑户乎。 而已反其真，而我犹为人倚。 子贡趋而进曰：敢问临尸而歌，礼乎？ 二人相视而吠日：是恶知礼意。 子贡反，以告孔子曰：彼何人者邪？ 修行无有而外其形骸，临尸而歌，颜色不变，无以命之。 彼何人者邪？ 孔子曰：彼游方之外者也，而丘游方之内者也。 外内不相及，而丘使女往吊之，丘则陋矣。 彼方且与造物者为人，而游乎天地之一气。 彼以生为附赘县疣，以死为决疣溃瘫。 夫若然者，又恶知死生先后之所在。 假於异物，托於同体； 忘其肝胆，遗其耳目； 反覆终始，不知端倪； 茫然彷徨乎尘垢之外，逍遥乎无为之业。 彼又恶能愤愤然为世俗之礼，以观众人之耳目哉。 子贡曰：然则夫子何方之依？ 曰：丘，天之戮民也。 虽然，吾与汝共之。 子贡曰：敢问其方？ 孔子曰：鱼相造乎水，人相造乎道。 相造乎水者，穿池而养给； 相造乎道者，无事而生定。 故曰：鱼相忘乎江湖，人相忘乎道卫。 子贡曰：敢问畸人。 曰：畸人者，畸於人而俾於天。 故曰：天之小人，人之君子； 人之君子，天之小人也。 右第四章 颜回问仲尼曰：孟孙才，其母死，哭泣无涕，中心不戚，居丧不哀。 无是三者，以善丧盖鲁国#3 。 固有无其实而得其名者乎？ 回一怪之。 仲尼曰：夫孟孙氏尽之矣，进於知矣，唯简之而不得，夫已有所简矣。 孟孙氏不知所以生，不知所以死。 不知就先，不知就后。 若化为物，以待其所不知之化已乎。 且方将化，恶知不化哉？ 方将不化，恶知已化哉？ 吾特与汝，其梦未始觉者邪。 且彼有骇形而无损心，有旦宅而无情死。 孟孙氏特觉，人哭亦哭，是自其所以乃。 且也相与吾之耳矣，庸诅知吾所谓吾之乎？ 且汝梦为乌而厉乎夫，梦为鱼而没於渊。 不识今之言者，其觉者乎？ 其梦者乎？ 造适不及吠，献哄不及排，安排而去化，乃入於寥天一。 右第五章 意而子见许由，许由日；",
      "translated_text": "After some time, Zi Sanghu died, his body yet unburied. When Confucius heard of this, he sent Zigong to assist with the funeral rites. One of the friends strummed a zither, another plucked a lute, and together they sang in harmony: *\"Alas, Sanghu! Alas, Sanghu! You have returned to your true nature, while we remain here, still clinging to human form.\"*\n\nZigong hurried forward and said, *\"May I ask—is it proper to sing before the dead?\"* The two looked at each other and laughed, saying, *\"What does he know of the meaning of ritual?\"*\n\nZigong returned and reported to Confucius: *\"What manner of men are they? They cultivate conduct without regard for outward form, sing before the dead without change of countenance—there is no name for them. What manner of men are they?\"*\n\nConfucius said, *\"They wander beyond the bounds of the world, while I wander within them. Beyond and within do not meet, and yet I sent you to offer condolences—how shallow of me! They are now companions of the Creator, roaming in the single qi of Heaven and Earth. To them, life is but an excrescence, a hanging tumor; death is but the bursting of the tumor, the draining of the abscess. How could such men know where life and death, before and after, truly lie? Borrowing from different things, they lodge in the same body; forgetting liver and gall, they abandon ears and eyes. They cycle through beginnings and ends, unaware of origin or end. Vast and unbound, they wander beyond the dust and grime, carefree in the work of non-action. How could they trouble themselves with the rituals of the vulgar world, seeking only to impress the eyes and ears of the crowd?\"*\n\nZigong said, *\"Then what path do you follow, Master?\"*\n\nConfucius replied, *\"I am one whom Heaven has punished. Yet even so, I share this with you.\"*\n\nZigong asked, *\"May I inquire as to the method?\"*\n\nConfucius said, *\"Fish are made for water, as humans are made for the Dao. Those made for water dig ponds to sustain themselves; those made for the Dao find tranquility without effort. Thus it is said: Fish forget one another in rivers and lakes, just as humans forget one another in the safeguarding of the Dao.\"*\n\nZigong said, *\"May I ask about the *qi*-person?\"*\n\nConfucius replied, *\"The *qi*-person is one who is odd among men but aligned with Heaven. Thus it is said: What is a petty man to Heaven is a noble man to men; what is a noble man to men is a petty man to Heaven.\"*\n\n---\n\nYan Hui asked Confucius, *\"Mengsun Cai’s mother died. He wept without tears, his heart untroubled, and showed no grief in mourning. Lacking these three, he was still praised throughout Lu for his mastery of mourning rites. How can one gain such a reputation without substance?\"* Yan Hui found this strange.\n\nConfucius said, *\"Mengsun Cai has exhausted the limits of understanding—he has advanced beyond knowledge. He could not simplify further, for he had already simplified all he could. He does not know why he lives or why he dies, does not know what comes first or what follows. If he is transformed into another thing, he awaits the transformation he does not yet know. Even now, as he is about to change, how could he know he will not change? Even now, as he is not changing, how could he know he has not already changed? You and I are but dreamers who have not yet awakened. Moreover, he may be startled by his form but his heart remains unharmed; his dwelling may change, but his essence does not die. Mengsun Cai is simply awake—when others weep, he weeps, for that is his nature. And yet, we speak of ‘my’ ears and ‘my’ understanding—how can we be certain what we call ‘mine’ is truly ours? You may dream of becoming a bird and soaring to the heavens, or a fish and diving into the depths. But who can say whether the speaker now is awake or still dreaming? When one reaches perfect harmony, laughter does not follow; when one offers a jest, applause does not come. Accepting fate and departing from change, one enters the vast oneness of Heaven.\"*\n\n---\n\nYi Zhi sought an audience with Xu You. Xu You said:",
      "overlap_context": "great smelter, where could we go and not be acceptable?”\n\nThen he fell into a deep sleep and awoke refreshed.\n\n---\n\n**Chapter Three**\n\nZi Sanghu, Meng Zifan, and Zi Qinzhang became friends and said to one another: “Who can join together in non-joining, act for one another in non-acting? Who can ascend to heaven and wander in the mists, roaming without bound, forgetting life and having no end?”\n\nThe three looked at one another and laughed, their hearts in perfect accord. Thus they became friends.",
      "start_char": 15623,
      "end_char": 16391,
      "start_sentence": 1079,
      "end_sentence": 1131,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.470214128494263,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\庄子内篇订正.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 33,
      "original_text": "尧何以资汝？ 意而子曰：尧谓我：汝必躬服仁义而明言是非。 许由日：而奚来为朝？ 夫尧既已鲸汝以仁义，而劓汝以是非矣。 汝将何以游夫遥荡恣睢转徙之涂乎？ 意而子曰：虽然，吾愿游於其藩。 许由曰：不然。 夫盲者无以与乎眉目颜色之好，瞽者无以与乎青黄之馆戏之观。 意而子曰：夫无庄之失其美，据梁之失其力，黄帝之亡其知，皆在炉捶之间耳。 庸诅知夫造物者之不息我鲸而补我劓，使我乘成以随先生邪？ 许由曰：噫。 未可知也。 我为汝言其大略：吾师乎。 吾师乎。 整万物而不为义，泽及万世而不为仁，长於 上古而不为老，覆载天地，刻雕众形而不为巧。 此所游已。 右第六章",
      "translated_text": "Yi Zhi sought an audience with Xu You. Xu You asked:\n“Why did Yao endow you with such things?”\n\nYi Zhi replied: “Yao told me, ‘You must personally practice benevolence and righteousness and clearly distinguish right from wrong.’”\n\nXu You said: “Then why have you come to court? Since Yao has already branded you with benevolence and righteousness and mutilated you with right and wrong, how will you wander the path of carefree ease, unconstrained freedom, and ceaseless transformation?”\n\nYi Zhi said: “Even so, I wish to wander within its bounds.”\n\nXu You said: “Not so. The blind cannot partake in the beauty of brows and eyes, nor can the deaf appreciate the spectacle of blue and yellow hues. How could they?”\n\nYi Zhi said: “Yet Wu Zhuang lost her beauty, Ju Liang lost his strength, and the Yellow Emperor lost his wisdom—all within the forge and hammer’s reach. How can we be certain the Creator will not heal my brand and mend my mutilation, allowing me to attain completion and follow you, Master?”\n\nXu You said: “Alas, it cannot be known. Let me speak to you of the great outline: My Master! My Master! He orders the myriad things yet claims no righteousness, bestows blessings upon ten thousand generations yet claims no benevolence, predates high antiquity yet claims no age, encompasses heaven and earth, carves and shapes all forms yet claims no skill. This is the realm in which one wanders.”\n\n---Chapter Six---",
      "overlap_context": "ears and ‘my’ understanding—how can we be certain what we call ‘mine’ is truly ours? You may dream of becoming a bird and soaring to the heavens, or a fish and diving into the depths. But who can say whether the speaker now is awake or still dreaming? When one reaches perfect harmony, laughter does not follow; when one offers a jest, applause does not come. Accepting fate and departing from change, one enters the vast oneness of Heaven.\"*\n\n---\n\nYi Zhi sought an audience with Xu You. Xu You said:",
      "start_char": 16391,
      "end_char": 16657,
      "start_sentence": 1132,
      "end_sentence": 1149,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.658831596374512,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\庄子内篇订正.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 34,
      "original_text": "子舆与子桑友。 而霖雨十日。 子舆曰：子桑殆病矣。 裹饭而往食之。 至子桑之门，则若歌若哭，鼓琴曰：父邪。 母邪。 天乎。 人乎。 有不任其声而趋举其诗焉。 子舆入，曰：子之歌诗，何故若是？ 曰：吾思夫使我至此极者而弗得也。 父母岂欲吾贫哉？ 天无私覆，地无私载，天地岂私贫我哉？ 求其为之者而不得也。 然而至此极者，命也夫。 右第七章 应帝王 啮缺问於王倪，四问而四不知。 啮缺因跃而大喜，行以告蒲衣子。 蒲衣子曰：而乃今知之乎？ 有虞氏不及泰氏。 有虞氏其犹藏仁以要人，亦得人矣，而未始出於非人。 泰氏其卧徐徐，其觉于于。 一以己为马，一以己为牛。 其知情信，其德甚真，而未始入於非人。 右第一章 肩吾见狂接舆。",
      "translated_text": "Ziyu and Zisang were friends. When continuous rain fell for ten days, Ziyu said: “Zisang must be in dire straits.” Wrapping rice, he went to feed him. Arriving at Zisang’s gate, he heard sounds like singing, like weeping—plucking the zither, Zisang cried: “Father! Mother! Heaven! Man!” His voice could not bear the strain, yet he hastened to recite his verse.\n\nZiyu entered and asked: “Why do you sing this poem in such a way?”\n\nZisang replied: “I pondered who brought me to this extremity, yet I cannot find the answer. Would my parents wish me to be poor? Heaven covers without partiality, earth bears without partiality—would heaven and earth single me out for poverty? I sought the one who caused this, yet I cannot find him. And yet, to reach this extremity—it is fate, is it not?”\n\n---Chapter Seven---\n\n\"Responding to Emperors\"\n\nNie Que questioned Wang Ni four times, and four times Wang Ni professed ignorance. Nie Que leapt up in great joy and went to tell Pu Yi Zi.\n\nPu Yi Zi said: “Only now do you understand? The Lord of Yu did not match the Lord of Tai. The Lord of Yu concealed his benevolence to entice men—he gained men, yet never transcended the realm of the unenlightened. The Lord of Tai lay at ease, awoke unhurried. At times he took himself for a horse, at times for an ox. His knowledge was true to his nature, his virtue most genuine, and he never entered the realm of the unenlightened.”\n\n---Chapter One---\n\nJian Wu met the madman Jie Yu.",
      "overlap_context": "and mend my mutilation, allowing me to attain completion and follow you, Master?”\n\nXu You said: “Alas, it cannot be known. Let me speak to you of the great outline: My Master! My Master! He orders the myriad things yet claims no righteousness, bestows blessings upon ten thousand generations yet claims no benevolence, predates high antiquity yet claims no age, encompasses heaven and earth, carves and shapes all forms yet claims no skill. This is the realm in which one wanders.”\n\n---Chapter Six---",
      "start_char": 16657,
      "end_char": 16956,
      "start_sentence": 1150,
      "end_sentence": 1176,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.385302543640137,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\庄子内篇订正.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 35,
      "original_text": "狂接舆曰：日中始何以语女？ 肩吾曰：告我君人者以己出经式义度，人孰敢不听而化诸？ 接舆曰：是欺德也。 其於治天下也，犹涉海凿河而使蚊负山也。 圣人之治也，治外乎？ 正而后行，确乎能其事者而已矣。 且乌高飞以避增弋之害，殿鼠深穴乎神丘之下以避黑凿之患，而曾二虫之无知。 右第二章 天根游於殷阳．’至寥水之上，适遭无名人而问焉，曰； 请问为天下。 无名人曰：去。 汝鄙人也，何问之不预也。 予方将与造物者为人； 厌则又乘夫莽眇之乌，以出六极之外，而游无何有之乡，以处圹垠之野。 汝又何升以治天下感予之心为？ 又复问。 无名人曰：汝游心於淡，合气於漠，顺物自然而无容私焉，而天下治矣。 右第三章 阳子居见老聃，曰：有人於此，向疾强梁，物彻疏明，学道不倦。 如是者，可比明王乎？ 老聘日：是於圣人也，胥易技系，劳形休心者也。 且也虎豹之文未田，猥狙之便执厘之狗未籍。 如是，可比明王乎？ 阳子居蹴然曰：敢问明王之治。 老聪日：明王之治，功盖天下而似不自己，化贷万物而民弗恃。 有莫举名，使物自喜。 立乎不测，而游於无有者也。 右第四章郑有神巫日季咸，知人之死生、存亡、祸福、寿夭，期以岁月旬日，若神。 郑人见之，皆弃而走。 列子见之而心醉，归，以告壶子，曰：吾乡示之以大冲莫胜，是殆见吾衡气机也。 统桓之审为渊，止水之审为渊，流水之审为渊。 渊有九名，此处三焉。 尝又与未。 明日，又与之见壶子。 立未定，自失而走。 壶子曰：追之。 列子追之不及。 反，以报壶子曰：已灭矣，已失矣，吾弗及已。 壶子曰：局吾示之以未始出吾宗。 吾与之虚而委蛇，不知其谁何，因以为弟靡，因以为波流，故逃也。 然后列子自以为未始学而归。 三年不出，为其妻爨，食豕如食人，於事无与亲。 雕琢复朴，块然独以其形立。 纷而封哉，一以是终。 右第五章 无为名尸，无为谋府，无为事任，无为知主。 体尽无穷，而游无朕； 尽其所受乎天，而无见得。 告壶子曰：始吾以夫子之道为至矣，则又有至焉者矣。 壶子曰：吾与汝既其文，未既其实，而固得道与？ 众雌而无雄，而又奚卵焉。 而以道与世亢，必信，夫故使人得而相汝，尝试与来，以予示之。 明日，列子与之见壶子。 出而谓列子曰：嘻。 子之先生死矣，弗活矣，不以旬数矣。 吾见怪焉，见湿灰焉。 列子入，泣涕沾襟以告壶子。 壶子曰：乡吾示之以地文，萌乎不震不正。 是殆见吾杜德机也。 尝又与来。 明日，又与之见壶子。 出而谓列子曰：幸矣，子之先生遇我也。 有廖矣，全然有生矣。 吾见其杜权矣。 列子入，以告壶子。 壶子曰：乡吾示之以天壤，名实不入，而机发於踵。 是殆见吾善者机也。 尝又与来。 明日，又与之见壶子。 出而谓列子曰：子之先生不齐，吾无得而相焉。 试齐，且复相之。 列子入，以告壶子。 壶子亦虚而已。 至人之用心若镜，不将不迎，应而不藏，故能胜物而不伤。 南海之帝为鲦，北海之帝为忽，中央之帝为浑沌。 鲦与忽时相与遇於浑沌之地，浑沌待之甚善。 鲦与忽谋报浑沌之德，曰：人皆有七窍以视听食息，此独无有，尝试凿之。 日凿七窍，七日而浑沌死。 右第六章 庄子内篇订正卷下竟",
      "translated_text": "Jie Yu asked: “What did Zhong Shi of Noon tell you?”\nJian Wu replied: “He instructed me that a ruler must issue laws, models, principles, and measures from his own person—who would dare disobey and fail to be transformed?”\n\nJie Yu said: “This is deceptive virtue. To govern the world thus is like crossing the sea by digging a river or making a mosquito carry a mountain. Does the sage’s governance concern externals? He simply rectifies himself and then acts, ensuring his actions align with his true capacity. The cormorant flies high to evade the fowler’s snare, the field mouse burrows deep beneath the sacred mound to escape the digger’s harm—yet you deem these creatures lacking in knowledge?”\n\n---\n\nChapter Three\n\nTian Gen wandered to Yin Yang and arrived at the banks of the Liao River, where he encountered the Nameless Man and asked: “I beg to inquire how to govern the world.”\n\nThe Nameless Man said: “Begone! You are a vulgar man—why ask questions so ill-timed? I am about to become human with the Creator of Things. When weary, I ride the boundless bird beyond the six directions, roaming the land of Nothing Whatever, dwelling in the vast wilds. How could your questions about governing the world disturb my heart?”\n\nHe asked again.\n\nThe Nameless Man said: “Let your mind wander in stillness, merge your qi with emptiness, follow things as they are without imposing private concerns—thus the world is governed.”\n\n---\n\nChapter Four\n\nYang Ziju visited Lao Dan and said: “Suppose there is a man swift, strong, and resolute, with keen perception and clear understanding, who studies the Dao tirelessly. Could such a one be compared to an enlightened king?”\n\nLao Dan replied: “To the sage, such a man is like a petty clerk bound by skills, exhausting his body and straining his mind. Moreover, the tiger and leopard’s patterned hides invite hunters, the monkey’s agility and the hound’s tracking prowess bring them to the leash. Could such a one be compared to an enlightened king?”\n\nYang Ziju, startled, said: “May I ask how an enlightened king governs?”\n\nLao Dan said: “The governance of an enlightened king: his achievements cover the world yet seem not his own; he transforms and bestows upon the ten thousand things, yet the people do not rely on him. He remains nameless, allowing things to rejoice of themselves. He stands in the unfathomable and roams where there is nothing.”\n\n---\n\nChapter Five\n\nIn Zheng there was a divine diviner named Ji Xian, who knew men’s deaths and lives, survival and ruin, fortune and misfortune, long life and early death, predicting them by year, month, and day as if by spirit. The people of Zheng, upon seeing him, all fled in haste.\n\nLiezi met him and was enchanted. Returning home, he told Huzi: “I once thought your Dao was supreme, but now I see there is something even greater.”\n\nHuzi said: “I have shown you only its outward form, not its reality—how could you have truly attained the Dao? A flock of hens without a rooster—how could they lay eggs? You present the Dao to the world in opposition, so you are seen through. Come with him tomorrow, and let me show myself to him.”\n\nThe next day, Liezi brought Ji Xian to meet Huzi. Before standing firmly, Ji Xian lost himself and fled.\n\nHuzi said: “Pursue him.”\n\nLiezi chased him but could not catch up. Returning, he reported to Huzi: “He has vanished, he is lost—I could not reach him.”\n\nHuzi said: “Just now I showed him something not yet emerged from my source. I met him with emptiness and compliance, so he knew not who or what I was. He took me for drifting grass, for flowing waves—hence his flight.”\n\nThereafter, Liezi considered himself as one who had never begun to learn. For three years he did not go out, cooked for his wife, fed pigs as he would feed people, and took no special interest in affairs. He cast off carving and returned to simplicity, standing alone like an unhewn block. Amidst confusion, he remained sealed off, thus ending his days.\n\n---\n\nDo not be a vessel for fame, do not be a repository for schemes, do not take on tasks as your responsibility, do not be a master of knowledge. Embody the boundless and wander without trace; exhaust what you receive from Heaven without showing attainment.\n\nLiezi said to Huzi: “At first I thought your Dao was supreme, but now there is something even greater.”\n\nHuzi said: “I have shown you only its pattern, not its reality—how could you have truly attained the Dao? A flock of hens without a rooster—how could they lay eggs? You oppose the world with the Dao, so you are seen through. Bring him again tomorrow, and let me show myself to him.”\n\nThe next day, Liezi brought Ji Xian to meet Huzi. Upon leaving, Ji Xian said to Liezi: “Alas! Your master is dead—he will not live. It will not be ten days. I saw something strange—like damp ashes.”\n\nLiezi entered and wept, his tears soaking his lapels, as he told Huzi.\n\nHuzi said: “Just now I showed him the pattern of earth, sprouting yet neither stirring nor upright. He likely saw my blocked virtue’s mechanism. Bring him again tomorrow.”\n\nThe next day, Liezi again brought Ji Xian to meet Huzi. Upon leaving, Ji Xian said to Liezi: “Fortunate that your master met me! He is restored—fully alive. I see his blocked power.”\n\nLiezi entered and told Huzi.\n\nHuzi said: “Just now I showed him Heaven and Earth, where names and realities do not enter, and the mechanism arises from the heels. He likely saw my virtuous mechanism. Bring him again tomorrow.”\n\nThe next day, Liezi again brought Ji Xian to meet Huzi. Upon leaving, Ji Xian said to Liezi: “Your master is unsettled—I can read nothing from him. Try to settle him, and I will observe him again.”\n\nLiezi entered and told Huzi.\n\nHuzi remained empty as before.\n\nThe perfected one’s use of the mind is like a mirror: it does not send forth nor welcome, responds yet does not store—thus it can master things without harm.\n\n---\n\nChapter Six\n\nThe Lord of the Southern Sea was Shu, the Lord of the Northern Sea was Hu, and the Lord of the Center was Hundun. Shu and Hu often met in Hundun’s land, and Hundun treated them very well. Shu and Hu plotted to repay Hundun’s kindness, saying: “All men have seven openings for seeing, hearing, eating, and breathing—only he has none. Let us try to bore them for him.” Each day they bored one opening, and on the seventh day, Hundun died.\n\n---\n\n*End of the Inner Chapters of Zhuangzi, Revised Scroll Two*",
      "overlap_context": "ell Pu Yi Zi.\n\nPu Yi Zi said: “Only now do you understand? The Lord of Yu did not match the Lord of Tai. The Lord of Yu concealed his benevolence to entice men—he gained men, yet never transcended the realm of the unenlightened. The Lord of Tai lay at ease, awoke unhurried. At times he took himself for a horse, at times for an ox. His knowledge was true to his nature, his virtue most genuine, and he never entered the realm of the unenlightened.”\n\n---Chapter One---\n\nJian Wu met the madman Jie Yu.",
      "start_char": 16956,
      "end_char": 18187,
      "start_sentence": 1177,
      "end_sentence": 1256,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.050477027893066,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\庄子内篇订正.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 36,
      "original_text": "＃１『唯松柏独也』据通行本应为『唯松柏独也正』。 ＃2『唯舜独也正』据通行本应为『唯尧舜独也正』。 ＃３『以善丧盖鲁国』据通行本应为『以善处丧盖鲁国』。",
      "translated_text": "1. According to the received editions, *\"Only the pine and cypress alone\"* should read *\"Only the pine and cypress alone are upright.\"*\n\n2. According to the received editions, *\"Only Shun alone is upright\"* should read *\"Only Yao and Shun alone are upright.\"*\n\n3. According to the received editions, *\"By skill in mourning, he overshadowed the state of Lu\"* should read *\"By skill in conducting mourning, he overshadowed the state of Lu.\"*",
      "overlap_context": "e Lord of the Southern Sea was Shu, the Lord of the Northern Sea was Hu, and the Lord of the Center was Hundun. Shu and Hu often met in Hundun’s land, and Hundun treated them very well. Shu and Hu plotted to repay Hundun’s kindness, saying: “All men have seven openings for seeing, hearing, eating, and breathing—only he has none. Let us try to bore them for him.” Each day they bored one opening, and on the seventh day, Hundun died.\n\n---\n\n*End of the Inner Chapters of Zhuangzi, Revised Scroll Two*",
      "start_char": 18187,
      "end_char": 18269,
      "start_sentence": 1257,
      "end_sentence": 1259,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 2.450317859649658,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\庄子内篇订正.txt",
        "category": "玉诀类"
      }
    }
  ]
}