{
  "source_id": "御制周颠仙人传",
  "source_file": "chunked_daozang\\御制周颠仙人传.json",
  "total_chunks": 7,
  "total_original_chars": 4421,
  "total_translated_chars": 16970,
  "total_translation_time": 89.48828768730164,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\藏外\\御制周颠仙人传.txt",
    "category": "藏外"
  },
  "full_translation": "The Imperial Composition *Biography of the Immortal Zhou the Mad*\n*(Composed by Zhu Yuanzhang of the Ming Dynasty)*\n\nThere was a man of madness surnamed Zhou, who claimed to be from Jianchang, a subordinate prefecture of Nanchang. At the age of fourteen, he suffered from a maddening illness, and his parents, having no leisure to care for him, often kept him confined. Zhou entered Nanchang, begging for food in the marketplace, year after year as usual. He continued in this manner without going elsewhere.\n\nDuring the Zhizheng era of the Yuan dynasty, in a year no longer recorded, he suddenly went to Fuzhou once, but before long, he returned to Nanchang. At times, he lent his strength to households in the marketplace, mingling with the common folk by day and lodging beneath the eaves of the lanes by night. As he approached his thirties (the original text read \"twenties,\" but this has been emended to \"thirties\" according to the *Ming Dynasty Historical Records* by Zhu Dangmian and the *Collected Ming Records*), he suddenly began to speak in strange words. Whenever a new official arrived to take office, he would invariably pay homage and present his grievances to them.\n\nHis words were: *\"Announcing great peace.\"* These were his strange utterances. How so? At that time, the Yuan realm enjoyed superficial tranquility, though turmoil loomed near. This madman, for his part, uttered these words—hence called \"strange speech.\" Before many years had passed, the Yuan realm descended into chaos, and heroes everywhere seized strategic strongholds, leaving no day without bloodshed. When the false Han usurper Chen Youliang led his rabble into Nanchang, the madman had no one to speak to.\n\nSoon after, We personally led a naval force to retake Nanchang, and the city surrendered. Having pacified the people, We returned to Jianye. By the eastern gate of Nanchang, along the roadside, We saw a man kneeling in obeisance. We asked Our attendants, *\"Who is this?\"* They all replied, *\"A madman.\"* In the third month, We returned to Jianye, and the madman arrived in the sixth. When We personally oversaw construction work, the madman came to pay homage. We asked him, *\"Why have you come?\"* He replied, *\"To announce great peace.\"* Such was his greeting whenever We encountered him at dawn—his words ever the same. Whether to the left or right, before or behind, he always made this his first utterance. At times, from a distance, he would reach into his robe as if searching for something, then place his hand to his mouth. When asked the reason, he would say, *\"Lice.\"* We then asked, *\"How many?\"* He answered, *\"Two or three *dou*.\"* Such were the general tenor of his strange words.\n\nAware of Our unease, at our first meeting he declared, *\"The women are rebelling.\"* In his local dialect, he often sang:\n*\"What in this world stirs the human heart?\nOnly rouge and powder stir the womenfolk.\"*\n\nWhen villagers asked him the meaning, he would reply, *\"You’re just like this—just like this.\"* He repeated this endlessly, along with *\"Announcing great peace.\"*\n\nWeary of this madman’s incessant vexations, We specially plied him with strong liquor to intoxicate him. Though he drank deeply, he remained sober. The next day, he returned, still prattling about his lice in great numbers. Thereupon We had new robes made to replace his old garments. When the new clothes arrived, We noticed a three-inch stalk of *changpu* concealed in the waistband of his old skirt. We asked him, *\"What is this for?\"* He replied, *\"Chew it finely, swallow with water, and your belly will know no pain.\"* We chewed it finely and washed it down with water.\n\nThereafter, the madman’s ravings grew daily more unrelenting. We ordered him steamed. First, a great vat was inverted over him, and he was made to sit inside while reeds five *chi* in girth were piled around the vat and set alight. When the fuel was spent and the fire died down, the vat was lifted—he remained entirely unchanged. We steamed him again, this time with a bundle and a half of reeds five *chi* in girth, covering him with the vat and kindling a fire all around. After the smoke cleared and the flames subsided, the vat was lifted—he was still unchanged. Not long after, We had him steamed once more, this time with two and a half bundles of reeds five *chi* in girth, covering him with the vat and firing it. When the fuel was exhausted and the fire extinguished, the vat was lifted to reveal smoke congealed at the bottom like stretched silk. The madman stirred slightly, tilting his head, and a trickle of water seeped out—then he awoke, unharmed.\n\nWe ordered him lodged at Jiangshan Temple, where the abbot took him in. A month later, the abbot came to report that the madman had behaved strangely: he had quarreled with a novice over rice, then flown into a rage and refused to eat—this had now lasted half a month. Intrigued, We ordered the carriage prepared and went the next day to question and observe him in person. As We approached the temple, We saw the madman coming to greet Us, walking swiftly without difficulty, his face showing no sign of hunger—this was his peculiarity.\n\nWe had a lavish feast prepared and shared it with him at Cuiwei Pavilion. After the meal, We secretly instructed the abbot, *\"Have the madman observe a pure fast for a month to see what becomes of him.\"* The abbot followed Our command, confining him to a chamber. Every two days, We inquired after him. On the twenty-third day, he indeed took no food or drink—this marked him as no ordinary man. We went in person to open the chamber. When the generals and officers heard of this, they vied to bring him wine and delicacies. He ate his fill but kept nothing down, vomiting all he had consumed. After some time, We summoned him again and shared a meal as before—this time, he retained the food. As the wine flowed and his spirits rose, he left ahead of Us and waited by the roadside to the right of the path. When We arrived, he drew a circle in the dirt and pointed to Us, saying, *\"You break one barrel—then make another.\"* With these strange words, he departed.\n\nAt that time, villagers of Jinling vied to invite and offer him sustenance. One day, he encountered a young man and suddenly uttered strange words: *\"Hah! If I tell you to enlist, you enlist.\"* Another time, when he saw Us in private, he often sang: *\"Shandong is fit for but one province.\"* Soon after, as We prepared to march west to Jiujiang, We specially asked the madman, *\"Is this journey feasible?\"* He answered at once, *\"It is.\"* We then said to him, *\"He has already declared himself emperor—will it not be difficult to fight him?\"* The madman feigned madness, tilting his head back to gaze at the roof. After a long while, he straightened his posture, composed his expression, and brushed his hand through the air, saying, *\"There is nothing of his up there.\"* We asked, *\"May We take you along on this journey?\"* He replied, *\"You may.\"* After the inquiry, We returned. The madman then took up his usual staff, rushed to Our horse’s side, and brandished it with the vigor of a warrior wielding a halberd—this revealed an omen of certain victory. He was thus taken along with the army.\n\nUpon reaching Wan City, there was no wind, and the naval forces struggled to advance. We sent someone to ask him, and the madman said, *\"Just keep going—there will be wind. If you lack courage, there will be none.\"* Thereupon, the troops hauled the boats along the shore, rowing upstream. Before they had gone two or three *li*, a gentle breeze arose; before ten *li*, a strong wind howled, swelling the sails and propelling them swiftly to Xiao Gu.\n\nWe once remarked to Our attendants, *\"This madman never speaks plainly—keep watch over him. He may yet report some absurdity.\"* Midway on the Yangtze, a pig played in the water, and the madman said, *\"A water monster appears ahead—many will be harmed.\"* The attendants reported this, but We dismissed his words. The madman, indeed witless, was cast into the river and drowned. At Hukou, We lost track of some seventeen or eighteen men. The madman was taken to a small riverbank near Hukou, intending to drown him. After a long absence, he returned unharmed. We asked those sent to dispatch him, *\"Why did you not put him to death, and why has he returned alive?\"* They replied, *\"It was difficult to kill him.\"* Before they finished speaking, the madman suddenly appeared, asking for food. We gave him some. After eating, he gathered his wits and straightened his clothes as if preparing for a long journey. Approaching Us, he bowed deeply, stretched his neck, and said, *\"You kill me.\"* We replied, *\"You have caused much trouble—We dare not kill you yet. Go your way.\"* He then took some parched grain and departed. His whereabouts thereafter were unknown.\n\nAfter the great battle on Lake Poyang, We returned to the Yangtze, arraying the naval forces in formation to secure the river. In leisure, We sent men to inquire among the locals beneath Mount Lu, in the direction the madman had gone, to ascertain his fate. The land was desolate, with no people—only a single dwelling near the Taiping Palace amid the overgrowth. Describing the madman, We asked the resident, *\"Have you seen him?\"* He replied, *\"Recently, a gaunt, tall figure arrived here, saying, ‘Good! I have come to announce the advent of Great Peace. You, as a commoner, should tend your fields with care.’ After speaking, he took no food in my home for half a month.\"* Searching deep into Mount Lu yielded no trace of him.\n\nAfter the war, We returned. In the *guimao* year, We besieged Wuchang. In the *jiachen* year, We pacified Jing and Chu. In the *yisi* year, We entered the Two Zhe. In the *wushen* year, We subdued Wu and Yue, then conquered the Central Plains, the Two Guang, and Fujian, unifying the realm.\n\nIn the eighth month of the *guihai* year of the Hongwu era, a barefoot monk named Juexian arrived. He claimed to have seen an old man in the deep mountains and ravines of Mount Lu, who sent him to speak to the Emperor of Great Ming. Asked what he was to say, he replied, *\"Of the imperial destiny.\"* The Court of Ceremonial Ritual reported this. We reflected that deceivers were many in those days. As ruler of the realm, supreme above the common people, governing both heaven and earth, We feared that credulity might invite ridicule, and so neither received nor answered him. The monk waited four years before returning to Mount Lu. Though he wished to see Us, We did not grant an audience, but sent him two poems instead. Two years later, through a messenger, We inquired whether he had seen the old man again. The barefoot monk said, *\"I have not seen him again.\"*\n\nFour more years passed, and We fell gravely ill with a fever, nearly passing from this world. Suddenly, the barefoot monk arrived, saying that the Venerable Tianyan and the Immortal Zhou the Mad had sent him with medicine.\n\nAt first, We again did not wish to see him. After brief reflection, however, We thought: since We were ill and he had come with medicine—even if it were counterfeit—it was fitting to receive him. We went out to meet him, and he bestowed medicine upon Us. The names of the medicines were: one called two pieces of *Wenliang* medicine, and the other called one piece of *Wenliang* stone. The method of use was to place them in a golden box, rub them against the back, and then consume one cupful from a golden vessel—whereupon recovery would follow. We then took the medicine.\n\nAt first, there was no marked change. The medicine was taken at the *wei* hour, and by the time the lamps were lit, the flesh throughout Our entire body began to twitch and convulse—this was the medicine’s effect. That very night, the illness was cured, and Our spirit grew stronger with each passing day.\n\nAfter taking it twice, We then detected the fragrance of *changpu* in the vessel, and at its bottom lay cinnabar sand, heavy and settled—vibrant red, unlike anything in the world. The barefoot monk said: “I reside at Tianchi Temple, over five *li* from the cliffs. Suddenly, a Daoist named Xu arrived, saying that Bamboo Grove Temple had sent for me. I went with him and saw the Venerable Tianyan seated in the temple. After a short while, one clad in grass garments entered. I asked Tianyan, ‘Who is this?’ He replied, ‘This is Zhou Dian. The present ruler seeks precisely this man. Now that the ruler suffers from heat, you must deliver medicine for him to take.’ Tianyan further said, ‘Zhou Dian and I shall compose poems for the ruler.’ I asked, ‘May I see the poems?’ He answered, ‘They are already written on the right.’ I looked upon the stone and indeed found two poems.”\n\nWe said to the barefoot monk, “Can you still recall them?” He replied, “I can.” We then ordered him to transcribe them. At first glance, the poems seemed coarse and unrefined, lacking rhythm or coherence, as if they were not poems at all. Yet when We later dispatched envoys to Mount Lu to summon Zhou Dian, the messengers arrived only to find him gone without a trace. Upon rereading the poems, We saw that both their words and characters were extraordinary, unconcerned with artful carving—simply stating matters. The Way of the state’s fortune or misfortune, survival or ruin, was already decided. Thus, We record them here to show later generations.\n\nThe poem of the Venerable Tianyan reads:\n*“The sagely ruler’s auspicious omens align with heaven’s foundation,\nLike shadow following form—all is delusion.\nAt the Gate of Heavenly Mandate, great fortune abounds,\nYet when the people face hardship, he refuses to heed.\nOnly in non-duality does true liberation arise,\nAs the golden wheel accumulates its dominion over the four seas.\nThe enlightened lord’s Dao expands heaven and earth,\nAnd with a single thought, his voice resounds like thunder.”*\n\nThe poem of Immortal Zhou Dian reads:\n*“At first sight of the sagely ruler, he fulfills heaven’s foundation,\nHis bearing one moment majestic, the next foolish.\nAll fragments converge to bind the realm as one,\nThe vastness of heaven and earth is now at hand.\nFrom this time forth, the lord secures the state,\nWith boundless fortune, he races to repay grace.\nOur king, moved, wears a joyful countenance,\nAnd Buddhism shall flourish in this very age.”*\n\nThe ancient poem of the immortals reads:\n*“Atop Mount Lu’s peaks lies a deep valley,\nWhere the disciples of the Golden Immortal dwell in cliffside huts.\nFor how many years have they refined elixirs to aid the world?\nPlowing clouds at dawn, planting bamboo at dusk.”*\n\nOur eulogy for the barefoot monk reads:\n*“Barefoot and diligent, your deeds bear fruit,\nWho among the suffering and deluded can compare?\nTransgressions of past lives dissolved, karmic bonds severed,\nIllusions of the moment shed, the sorrows of the sea of deeds dispelled.\nLong have I heard of the traces left at Vast Expanse,\nNow at Tianchi I witness the Buddha’s advent.\nThe gods, pitying the common folk, extend Our life,\nAnd the elixir’s arrival cures Our long affliction.”*\n\nOur composition for the sacrificial offering to the Venerable Tianyan, Immortal Zhou Dian, Daoist Xu, and the barefoot monk:\n*“Of old, their forms were empty, transcending the myriad things in emptiness.\nBeyond the ten thousand dharmas, forms were difficult to grasp, yet a single spirit endured.\nThus it was—through countless kalpas of suffering.\nNow, their numinous and wondrous workings,\nHidden in the mysteries of Mount Lu,\nWere known only to Us, aiding Us in Our distress.\nYet We shall never forget their benevolent aid; We must repay them with due rites.\nThough their divinity is unfathomable,\nUnobstructed in their ascent and descent,\nRoaming freely between heaven and earth, traversing the eight directions,\nObserving the ways of mortals—\nWhen rites suddenly arrive, they vanish without response,\nWould they not be mocked by the world?\nThus, in advance, We informed the altars of the capital,\nAnd dispatched envoys to the foot of Mount Lu,\nTo pray to the mountain’s spirits,\nAnd present offerings with propriety.\nThe rites are but a token of gratitude.\nFew in this world understand the principles of the unseen and the manifest.\nWe dare to ask: may they appear in an instant, then vanish in the next,\nSo that the virtuous may admire them yet never attain,\nAnd the wicked may see them yet never draw near?”*\n\nWould this not contribute to the Dao of the world?”*\n\nCarefully considering the matter: As the saying goes, “Whether immortals exist is utterly obscure—how could there be immortals in the world? They are all delusions.” Yet examining the events of Zhou the Mad Immortal in the early years of Our dynasty, we find them all verifiably true, leaving no room for wholesale dismissal as fabrication. In essence, between heaven and earth there naturally exists a kind of immortal’s bearing and Daoist bone; yet the paths of immortals and mortals diverge, and one cannot forcibly attain them through effort.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "御制周颠仙人传　　（明）朱元璋撰 颠人周姓者，自言南昌属郡建昌人也。 年一十四岁，因患颠疾，父母无暇，常拘于是。 颠入南昌，乞食于市，岁如常。 颠如是更无他往。 元至正间，失记何年，忽入抚州一次，未几，仍归南昌。 有时施力于市户之家，日与俦人相杂，暮宿闾阎之下。 岁将三十余，（「岁将三十余」，「三十」原作「二十」，据明朱当■〈氵眄〉（以下简称朱氏）国朝典故本、明纪录汇编本改。 ）俄有异词。 凡新官到任，必谒见而诉之。",
      "translated_text": "The Imperial Composition *Biography of the Immortal Zhou the Mad*\n*(Composed by Zhu Yuanzhang of the Ming Dynasty)*\n\nThere was a man of madness surnamed Zhou, who claimed to be from Jianchang, a subordinate prefecture of Nanchang. At the age of fourteen, he suffered from a maddening illness, and his parents, having no leisure to care for him, often kept him confined. Zhou entered Nanchang, begging for food in the marketplace, year after year as usual. He continued in this manner without going elsewhere.\n\nDuring the Zhizheng era of the Yuan dynasty, in a year no longer recorded, he suddenly went to Fuzhou once, but before long, he returned to Nanchang. At times, he lent his strength to households in the marketplace, mingling with the common folk by day and lodging beneath the eaves of the lanes by night. As he approached his thirties (the original text read \"twenties,\" but this has been emended to \"thirties\" according to the *Ming Dynasty Historical Records* by Zhu Dangmian and the *Collected Ming Records*), he suddenly began to speak in strange words. Whenever a new official arrived to take office, he would invariably pay homage and present his grievances to them.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 205,
      "start_sentence": 0,
      "end_sentence": 9,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.5856101512908936,
      "metadata": {
        "source_file": "dao\\藏外\\御制周颠仙人传.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "其词曰：「告太平。 」此异言也。 何以见？ 当是时，元天下承平，将乱在迩，其颠者故发此言，乃曰「异词。 」 不数年，元天下乱，所在英雄据险，杀无宁日。 其称伪汉陈友谅者，帅乌合之众以入南昌，其颠者无与语也。 （「其颠者无与语也」，「也」原作「者」，据明朱氏国朝典故本，明纪录汇编本改。 ）未几，朕亲帅舟师复取南昌，城降。 朕抚民既定，归建业，于南昌东华门道左见男子一人拜于道旁。 （「城降朕抚民既定归建业于南昌东华门道左见男子一人拜于道旁」，原脱「城降朕抚民既定归建业于南昌」，据明朱氏国朝典故本、明纪录汇编本补。 ）朕谓左右曰：「此何人也？ 」左右皆曰：「颠人。 」朕三月归建业，颠者六月至。 朕亲出督工，逢颠者来谒，谓颠曰：「此来为何？ 」对曰：「告太平。 」如此者朝出则逢之，所告如前。 或左或右，或前或后，务以此言为先。 有时遥见以手入胸襟中，似乎讨物，以手置口中。 问其故，乃曰：「虱子」。 复谓曰：「几何？ 」对曰：「二三斗。 」此等异言大概。 知朕之不宁，当首见时，即言：「婆娘反。 」又乡谈中常歌云：「世上甚么动得人心，只有胭脂胚粉动得婆娘嫂。 」里人及问其故，对曰：「你只这般，（「你只道般」，「只」原作「知」，据明朱氏国朝典故本、明纪录汇编本改。 ）只这般。 」每每如此，及「告太平。",
      "translated_text": "His words were: *\"Announcing great peace.\"* These were his strange utterances. How so? At that time, the Yuan realm enjoyed superficial tranquility, though turmoil loomed near. This madman, for his part, uttered these words—hence called \"strange speech.\" Before many years had passed, the Yuan realm descended into chaos, and heroes everywhere seized strategic strongholds, leaving no day without bloodshed. When the false Han usurper Chen Youliang led his rabble into Nanchang, the madman had no one to speak to.\n\nSoon after, We personally led a naval force to retake Nanchang, and the city surrendered. Having pacified the people, We returned to Jianye. By the eastern gate of Nanchang, along the roadside, We saw a man kneeling in obeisance. We asked Our attendants, *\"Who is this?\"* They all replied, *\"A madman.\"* In the third month, We returned to Jianye, and the madman arrived in the sixth. When We personally oversaw construction work, the madman came to pay homage. We asked him, *\"Why have you come?\"* He replied, *\"To announce great peace.\"* Such was his greeting whenever We encountered him at dawn—his words ever the same. Whether to the left or right, before or behind, he always made this his first utterance. At times, from a distance, he would reach into his robe as if searching for something, then place his hand to his mouth. When asked the reason, he would say, *\"Lice.\"* We then asked, *\"How many?\"* He answered, *\"Two or three *dou*.\"* Such were the general tenor of his strange words.\n\nAware of Our unease, at our first meeting he declared, *\"The women are rebelling.\"* In his local dialect, he often sang:\n*\"What in this world stirs the human heart?\nOnly rouge and powder stir the womenfolk.\"*\n\nWhen villagers asked him the meaning, he would reply, *\"You’re just like this—just like this.\"* He repeated this endlessly, along with *\"Announcing great peace.\"*",
      "overlap_context": "strength to households in the marketplace, mingling with the common folk by day and lodging beneath the eaves of the lanes by night. As he approached his thirties (the original text read \"twenties,\" but this has been emended to \"thirties\" according to the *Ming Dynasty Historical Records* by Zhu Dangmian and the *Collected Ming Records*), he suddenly began to speak in strange words. Whenever a new official arrived to take office, he would invariably pay homage and present his grievances to them.",
      "start_char": 205,
      "end_char": 733,
      "start_sentence": 10,
      "end_sentence": 37,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.238314628601074,
      "metadata": {
        "source_file": "dao\\藏外\\御制周颠仙人传.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "」 终日被此颠者所烦，特以烧酒醉之。 畅饮弗醉，明日又来，仍以虱多为说。 于是制新衣易彼之旧衣。 新衣至，朕视颠者旧裙腰间藏三寸许菖蒲一茎，谓颠者曰：「此物何用？ 」对曰：「细嚼，饮水，腹无痛。 」朕细嚼，水吞之。 是后颠者日颠不已，（「是后颠者日颠不已」，「是后」原作「是谓」，据明朱氏国朝典故本、明纪录汇编本改。 ）命蒸之。 初以巨缸覆之，令颠者居其内，以五尺围芦薪缘缸煅之。 （「以五尺围芦薪缘缸煅之」，「薪」原作「新」，「缘」原作「绿」，据明朱氏国朝典故本、明纪录汇编本改。 ）薪尽火消，揭缸而视之，俨然如故。 是后复蒸之，以五尺围芦薪一束半，以缸覆颠者于内，周遭以火煅之。 烟消火灭之后，揭缸而视之，俨然如故。 又未几特以五尺围芦薪两束半，以缸覆颠者于内煅炼之。 薪尽火消之后，揭缸视之，其烟凝于缸底若张绵状，颠者微以首撼撼，小水微出，即醒无恙。 命寄食于蒋山寺，主僧领之。 月余，主僧来告，颠者有异状，与沙弥争饭，遂怒不食，今半月矣。 朕奇之。 明日，命驾亲往询视之。 至寺，遥见颠者来迓，步趋无艰，容无饥色，是其异也。 因盛殽羞，同享于翠微亭。 膳后，密谓主僧曰：「令颠者清斋一月，以视其能否。 」主僧如朕命，防颠者于一室。 朕每二日一问，问至二十三日，果不饮膳，是出凡人也。 朕亲往以开之。 诸军将士闻是，争取酒殽以供之。 大饱弗纳，所饮食者尽出之。 良久，召至，朕与共享食如前，纳之弗出。 酒过且酣，先于朕归道旁侧道右边待朕至。 及朕至，（「及朕至」，「至」原作「出」，据明朱氏国朝典故本、明纪录汇编本改。 ）颠者以手画地成圈，指谓朕曰，「你打破一桶，再做一桶。 」发此异言。 （「发此异言」，「言」字原缺，据明朱氏国朝典故本、明纪录汇编本补。",
      "translated_text": "Weary of this madman’s incessant vexations, We specially plied him with strong liquor to intoxicate him. Though he drank deeply, he remained sober. The next day, he returned, still prattling about his lice in great numbers. Thereupon We had new robes made to replace his old garments. When the new clothes arrived, We noticed a three-inch stalk of *changpu* concealed in the waistband of his old skirt. We asked him, *\"What is this for?\"* He replied, *\"Chew it finely, swallow with water, and your belly will know no pain.\"* We chewed it finely and washed it down with water.\n\nThereafter, the madman’s ravings grew daily more unrelenting. We ordered him steamed. First, a great vat was inverted over him, and he was made to sit inside while reeds five *chi* in girth were piled around the vat and set alight. When the fuel was spent and the fire died down, the vat was lifted—he remained entirely unchanged. We steamed him again, this time with a bundle and a half of reeds five *chi* in girth, covering him with the vat and kindling a fire all around. After the smoke cleared and the flames subsided, the vat was lifted—he was still unchanged. Not long after, We had him steamed once more, this time with two and a half bundles of reeds five *chi* in girth, covering him with the vat and firing it. When the fuel was exhausted and the fire extinguished, the vat was lifted to reveal smoke congealed at the bottom like stretched silk. The madman stirred slightly, tilting his head, and a trickle of water seeped out—then he awoke, unharmed.\n\nWe ordered him lodged at Jiangshan Temple, where the abbot took him in. A month later, the abbot came to report that the madman had behaved strangely: he had quarreled with a novice over rice, then flown into a rage and refused to eat—this had now lasted half a month. Intrigued, We ordered the carriage prepared and went the next day to question and observe him in person. As We approached the temple, We saw the madman coming to greet Us, walking swiftly without difficulty, his face showing no sign of hunger—this was his peculiarity.\n\nWe had a lavish feast prepared and shared it with him at Cuiwei Pavilion. After the meal, We secretly instructed the abbot, *\"Have the madman observe a pure fast for a month to see what becomes of him.\"* The abbot followed Our command, confining him to a chamber. Every two days, We inquired after him. On the twenty-third day, he indeed took no food or drink—this marked him as no ordinary man. We went in person to open the chamber. When the generals and officers heard of this, they vied to bring him wine and delicacies. He ate his fill but kept nothing down, vomiting all he had consumed. After some time, We summoned him again and shared a meal as before—this time, he retained the food. As the wine flowed and his spirits rose, he left ahead of Us and waited by the roadside to the right of the path. When We arrived, he drew a circle in the dirt and pointed to Us, saying, *\"You break one barrel—then make another.\"* With these strange words, he departed.",
      "overlap_context": " *\"Lice.\"* We then asked, *\"How many?\"* He answered, *\"Two or three *dou*.\"* Such were the general tenor of his strange words.\n\nAware of Our unease, at our first meeting he declared, *\"The women are rebelling.\"* In his local dialect, he often sang:\n*\"What in this world stirs the human heart?\nOnly rouge and powder stir the womenfolk.\"*\n\nWhen villagers asked him the meaning, he would reply, *\"You’re just like this—just like this.\"* He repeated this endlessly, along with *\"Announcing great peace.\"*",
      "start_char": 733,
      "end_char": 1437,
      "start_sentence": 38,
      "end_sentence": 71,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.543212890625,
      "metadata": {
        "source_file": "dao\\藏外\\御制周颠仙人传.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "）当是时，金陵村民闻之，争邀供养。 一日逢后生者，（「逢后生者」，「者」字原无，据明朱氏国朝典故本、明纪录汇编本补。 ）俄出异词：「噫！ 教你充军便充军。 」（「噫教你充军便充军」，「噫」原作「意」，「充」原作「克」，据明朱氏国朝典故本、明纪录汇编本改。 ）又闲中见朕，常歌曰：「山东只好立一个省。 」 未几，朕将西征九江，特问颠者曰，「此行可乎？ 」应声曰：「可。 」朕谓颠者曰：「彼已称帝，今与彼战，岂不难乎？ 」颠者故作颠态，仰面视屋上。 久之，端首正容，以手拂之曰：「上面无他的。 」朕谓曰：「此行偕往可乎？ 」曰：「可。 」询毕，朕归。 其颠者以平日所持之拐擎之，急趋朕之马前，摇舞之状若壮士挥戈之势，此露必胜之兆。 后兵行带往。 至皖城，无风，舟师艰行，遣人问之，颠乃曰：「只管行，只管有风。 无胆不行，便无风。 」于是诸军上牵以舟薄岸，泝流而上，不二三里，微风渐起； 又不十里，大风猛作，扬帆长驱，遂达小孤。 朕曾谓相伴者曰：「其颠人无正语，防闲之。 尚有谬词来报焉。 」当中江，豚戏水，颠者曰：「水怪见前，损人多。 」伴者来报，朕不然其说。 颠果无知，（「颠果无知」，「果」字原无，据明朱氏国朝典故本、明纪录汇编本补。 ）弃溺于江中。 至湖口，失记人数约有十七八人。 将颠者领去湖口小江边，意在溺死，去久而归，颠者同来。 问命往者：「何不置之死地，又复生来？ 」对曰：「难置之于死。 」语未既，颠者猝至，谓朕欲食。 朕与之。 食既，颠者整顿精神、衣服之类，若远行之状。 至朕前，鞠躬舒项，谓朕曰：「你杀之。 」朕谓曰：「被你烦多，杀且未敢，且纵你行。 」遂茹糗粮而往。 去后莫知所之。 朕于彭蠡之中大战之后回江上，星列水师以据江势。 暇中试令人往匡庐之下、颠者所向之方询土居之民，（「暇中试令人往匡庐之下颠者所向之方询土居之民」，「土居之民」原作「士居之民」，据明朱氏国朝典故本、明纪录汇编本改。 ）要知颠者之有无。 地荒人无，惟太平宫侧草莽间一民居之。 以颠者状云之，谓民人曰：「是曾见否？ 」对曰：「前者，俄有一瘦长人物初至我处，声言『好了，我告太平来了。 你为民者用心种田。 』语后，于我宅内不食半月矣。 」深入匡庐，无知所之。 朕战后归来。 癸卯，围武昌。 甲辰，平荆楚。 乙巳，入两浙。 戊申，平吴越，下中原、两广、福建，天下混一。 洪武癸亥八月，俄有赤脚僧名觉显者至。 自言于匡庐深山岩壑中见一老人，使我来谓大明天子有说。 问其说，（「问其说」，「问」原作「故」，据明朱氏国朝典故本、纪录汇编本改。 ）乃云：「国祚。 」殿廷仪礼司以此奏。 朕思方今虚诳者多，（「朕思方今虚诳者多」，「多」字原无，据明朱氏国朝典故本、明纪录汇编本补。 ）朕驭宇内，至尊于黔黎之上，奉上下于两间，善听善见恐贻民笑，故不见不答。 是僧伺候四年，仍往匡庐。 意在欲见，朕不与见，但以诗二首寄之。 去后二年，以便人询之果曾再见否，其赤脚者云：「不复再见。 」又四年，朕患热症，几将去世。 俄，赤脚者至，言天眼尊者及周颠仙人遣某送药至。",
      "translated_text": "At that time, villagers of Jinling vied to invite and offer him sustenance. One day, he encountered a young man and suddenly uttered strange words: *\"Hah! If I tell you to enlist, you enlist.\"* Another time, when he saw Us in private, he often sang: *\"Shandong is fit for but one province.\"* Soon after, as We prepared to march west to Jiujiang, We specially asked the madman, *\"Is this journey feasible?\"* He answered at once, *\"It is.\"* We then said to him, *\"He has already declared himself emperor—will it not be difficult to fight him?\"* The madman feigned madness, tilting his head back to gaze at the roof. After a long while, he straightened his posture, composed his expression, and brushed his hand through the air, saying, *\"There is nothing of his up there.\"* We asked, *\"May We take you along on this journey?\"* He replied, *\"You may.\"* After the inquiry, We returned. The madman then took up his usual staff, rushed to Our horse’s side, and brandished it with the vigor of a warrior wielding a halberd—this revealed an omen of certain victory. He was thus taken along with the army.\n\nUpon reaching Wan City, there was no wind, and the naval forces struggled to advance. We sent someone to ask him, and the madman said, *\"Just keep going—there will be wind. If you lack courage, there will be none.\"* Thereupon, the troops hauled the boats along the shore, rowing upstream. Before they had gone two or three *li*, a gentle breeze arose; before ten *li*, a strong wind howled, swelling the sails and propelling them swiftly to Xiao Gu.\n\nWe once remarked to Our attendants, *\"This madman never speaks plainly—keep watch over him. He may yet report some absurdity.\"* Midway on the Yangtze, a pig played in the water, and the madman said, *\"A water monster appears ahead—many will be harmed.\"* The attendants reported this, but We dismissed his words. The madman, indeed witless, was cast into the river and drowned. At Hukou, We lost track of some seventeen or eighteen men. The madman was taken to a small riverbank near Hukou, intending to drown him. After a long absence, he returned unharmed. We asked those sent to dispatch him, *\"Why did you not put him to death, and why has he returned alive?\"* They replied, *\"It was difficult to kill him.\"* Before they finished speaking, the madman suddenly appeared, asking for food. We gave him some. After eating, he gathered his wits and straightened his clothes as if preparing for a long journey. Approaching Us, he bowed deeply, stretched his neck, and said, *\"You kill me.\"* We replied, *\"You have caused much trouble—We dare not kill you yet. Go your way.\"* He then took some parched grain and departed. His whereabouts thereafter were unknown.\n\nAfter the great battle on Lake Poyang, We returned to the Yangtze, arraying the naval forces in formation to secure the river. In leisure, We sent men to inquire among the locals beneath Mount Lu, in the direction the madman had gone, to ascertain his fate. The land was desolate, with no people—only a single dwelling near the Taiping Palace amid the overgrowth. Describing the madman, We asked the resident, *\"Have you seen him?\"* He replied, *\"Recently, a gaunt, tall figure arrived here, saying, ‘Good! I have come to announce the advent of Great Peace. You, as a commoner, should tend your fields with care.’ After speaking, he took no food in my home for half a month.\"* Searching deep into Mount Lu yielded no trace of him.\n\nAfter the war, We returned. In the *guimao* year, We besieged Wuchang. In the *jiachen* year, We pacified Jing and Chu. In the *yisi* year, We entered the Two Zhe. In the *wushen* year, We subdued Wu and Yue, then conquered the Central Plains, the Two Guang, and Fujian, unifying the realm.\n\nIn the eighth month of the *guihai* year of the Hongwu era, a barefoot monk named Juexian arrived. He claimed to have seen an old man in the deep mountains and ravines of Mount Lu, who sent him to speak to the Emperor of Great Ming. Asked what he was to say, he replied, *\"Of the imperial destiny.\"* The Court of Ceremonial Ritual reported this. We reflected that deceivers were many in those days. As ruler of the realm, supreme above the common people, governing both heaven and earth, We feared that credulity might invite ridicule, and so neither received nor answered him. The monk waited four years before returning to Mount Lu. Though he wished to see Us, We did not grant an audience, but sent him two poems instead. Two years later, through a messenger, We inquired whether he had seen the old man again. The barefoot monk said, *\"I have not seen him again.\"*\n\nFour more years passed, and We fell gravely ill with a fever, nearly passing from this world. Suddenly, the barefoot monk arrived, saying that the Venerable Tianyan and the Immortal Zhou the Mad had sent him with medicine.",
      "overlap_context": "rs heard of this, they vied to bring him wine and delicacies. He ate his fill but kept nothing down, vomiting all he had consumed. After some time, We summoned him again and shared a meal as before—this time, he retained the food. As the wine flowed and his spirits rose, he left ahead of Us and waited by the roadside to the right of the path. When We arrived, he drew a circle in the dirt and pointed to Us, saying, *\"You break one barrel—then make another.\"* With these strange words, he departed.",
      "start_char": 1437,
      "end_char": 2651,
      "start_sentence": 72,
      "end_sentence": 135,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.443979024887085,
      "metadata": {
        "source_file": "dao\\藏外\\御制周颠仙人传.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "（「言天眼尊者及周颠仙人遣某送药至」，「仙人」原作「仙者」，「送」字原缺，据明朱氏国朝典故本、明纪录汇编本改补。 ）朕初又不欲见，少思之：既病，人以药来，虽其假，合见之。 出与见，惠朕以药。 （「惠朕以药」，「惠」原作「会」，据明朱氏国朝典故本、明纪录汇编本改。 ）药之名，其一曰温良药两片，（「温良药两片」，「温」原作「浪」，据明朱氏国朝典故本、明纪录汇编本改。 ）其一曰温良石一块。 其用之方，金盒子盛着，背上磨着，金醆子内吃一醆便好。 朕遂服之。",
      "translated_text": "At first, We again did not wish to see him. After brief reflection, however, We thought: since We were ill and he had come with medicine—even if it were counterfeit—it was fitting to receive him. We went out to meet him, and he bestowed medicine upon Us. The names of the medicines were: one called two pieces of *Wenliang* medicine, and the other called one piece of *Wenliang* stone. The method of use was to place them in a golden box, rub them against the back, and then consume one cupful from a golden vessel—whereupon recovery would follow. We then took the medicine.",
      "overlap_context": "d four years before returning to Mount Lu. Though he wished to see Us, We did not grant an audience, but sent him two poems instead. Two years later, through a messenger, We inquired whether he had seen the old man again. The barefoot monk said, *\"I have not seen him again.\"*\n\nFour more years passed, and We fell gravely ill with a fever, nearly passing from this world. Suddenly, the barefoot monk arrived, saying that the Venerable Tianyan and the Immortal Zhou the Mad had sent him with medicine.",
      "start_char": 2651,
      "end_char": 2870,
      "start_sentence": 136,
      "end_sentence": 143,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 3.0209171772003174,
      "metadata": {
        "source_file": "dao\\藏外\\御制周颠仙人传.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "初无甚异，初服在未时，间至点灯时，周身肉内搐掣，（「周身肉内搐掣」，「掣」原作「制」，据明朱氏国朝典故本、明纪录汇编本改。 ）此药之应也。 当夜病愈，精神日强一日。 服过二番，乃闻有菖蒲香醆，底有砂丹沉坠，（「底有砂丹沉坠」，「砂丹」原作「沙丹」，据明朱氏国朝典故本、明纪录汇编本改。 ）鲜红异世有者。 其赤脚僧云：「某住天池寺，去岩有五里余。 俄，有徐道人来言竹林寺见请，往视之。 某与同往，见天眼尊者坐竹林寺中。 少顷，一披草衣者入。 某谓天眼曰：『此何人也？ 』对曰：『此周颠是也。 方今人主所询者，此人也。 即今人主作热，尔当送药与服之。 』天眼更云：『我与颠者和人主诗。 』某问曰：『诗将视看？ 』对曰：『已写于右上。 』某于石上观之，果有诗二首。 」朕谓赤脚曰：「还能记乎？ 」曰：（「曰能」，「曰」字原缺，据明宋氏国朝典故本、明纪录汇编本补。 ）「能。 」即命录之。 初见其诗粗俗，无韵无联，似乎非诗也。 及遣人诣匡庐召致之，使者至，杳然矣。 朕复以是诗再观，其词其字皆异寻常，不在镌巧，但说事耳。 国之休咎存亡之道已决矣，（「国之休咎存亡之道已决矣」，「道」原作「置」，「决」原作「久」，据明朱氏国朝典故本、明纪录汇编本改。 ）故纪之以示后人。 天眼尊者诗曰：「圣主祥瑞合天基，如影随形总是痴。 奉天门下洪福大，生灵有难不肯依。 非非相处方出定，金轮积位四海居。 明君有道乾坤广，等闲一智声如雷。 」 周颠仙人诗曰：「初见圣主应天基，一时风采一时痴。 逐片俱来箍一统，浩大乾坤正此时。 人君自此安邦定，齐天洪福谢恩驰。 （「齐天洪福谢恩驰」，「谢恩」原作「谢天」，据明朱氏国朝典故本、明纪录汇编本改。 ）我王感得龙颜喜，大兴佛法当此时。 」 群仙古诗：「匡庐之巅有深谷，金仙弟子岩为屋。 炼丹利济几何年，朝耕白云暮种竹。 」 御赞赤脚僧诗曰：「跣足殷懃事有秋，苦空颠际孰为俦。 （「苦空颠际孰为俦」，「苦」原作「若」，「际」字原作「祭」，据明朱氏国朝典故本、明纪录汇编本改。 ）愆消累世冤魂断，幻脱当时业海愁。 方广昔闻仙委迹，天池今见佛来由。 神怜黔首增吾寿，（「神怜黔首增吾寿」，「黔首」原作「点首」，据明朱氏国朝典故本、明纪录汇编本改。 ）丹饵来临久疾瘳。 」（「丹饵来临久疾瘳」，「丹饵」原作「丹耳」，据明朱氏国朝典故本、明纪录汇编本改。 ） 御制祭天眼尊者周颠仙人徐道人赤脚僧文：「昔者其色相空万物而空。 万法外，色相而难之，以存一灵。 斯若是，历苦劫于无量。 （「历苦劫于无量」，「历」原作「沥」，据明朱氏国朝典故本、明纪录汇编本改。 ）今者神神妙用，幽隐于庐岳，独为朕知而济朕难。 然朕终不忘于利济之恩，当以礼谢。 虽然，神已灵妙不测矣，寻常无碍于上下，逍遥乎两间，周游乎八极。 玩阅人情，猝然礼至，杳然弗应，（「杳然弗应」，「杳」原作「者」，据明朱氏国朝典故本、明纪录汇编本改。 ）岂不为世所嗤！ 故先期京师，已告诸祠，又遣使至庐岳之下，祷于庐岳之神，方以礼进，礼不过谢而已矣。 今世之人知幽明之理者鲜矣，敢请倐然而显，倐然而隐，使善者慕而不得，恶者身而难亲，（「恶者见而难亲」，「恶者」原作「难者」，据明朱氏国朝典故本、明纪录汇编本改。",
      "translated_text": "At first, there was no marked change. The medicine was taken at the *wei* hour, and by the time the lamps were lit, the flesh throughout Our entire body began to twitch and convulse—this was the medicine’s effect. That very night, the illness was cured, and Our spirit grew stronger with each passing day.\n\nAfter taking it twice, We then detected the fragrance of *changpu* in the vessel, and at its bottom lay cinnabar sand, heavy and settled—vibrant red, unlike anything in the world. The barefoot monk said: “I reside at Tianchi Temple, over five *li* from the cliffs. Suddenly, a Daoist named Xu arrived, saying that Bamboo Grove Temple had sent for me. I went with him and saw the Venerable Tianyan seated in the temple. After a short while, one clad in grass garments entered. I asked Tianyan, ‘Who is this?’ He replied, ‘This is Zhou Dian. The present ruler seeks precisely this man. Now that the ruler suffers from heat, you must deliver medicine for him to take.’ Tianyan further said, ‘Zhou Dian and I shall compose poems for the ruler.’ I asked, ‘May I see the poems?’ He answered, ‘They are already written on the right.’ I looked upon the stone and indeed found two poems.”\n\nWe said to the barefoot monk, “Can you still recall them?” He replied, “I can.” We then ordered him to transcribe them. At first glance, the poems seemed coarse and unrefined, lacking rhythm or coherence, as if they were not poems at all. Yet when We later dispatched envoys to Mount Lu to summon Zhou Dian, the messengers arrived only to find him gone without a trace. Upon rereading the poems, We saw that both their words and characters were extraordinary, unconcerned with artful carving—simply stating matters. The Way of the state’s fortune or misfortune, survival or ruin, was already decided. Thus, We record them here to show later generations.\n\nThe poem of the Venerable Tianyan reads:\n*“The sagely ruler’s auspicious omens align with heaven’s foundation,\nLike shadow following form—all is delusion.\nAt the Gate of Heavenly Mandate, great fortune abounds,\nYet when the people face hardship, he refuses to heed.\nOnly in non-duality does true liberation arise,\nAs the golden wheel accumulates its dominion over the four seas.\nThe enlightened lord’s Dao expands heaven and earth,\nAnd with a single thought, his voice resounds like thunder.”*\n\nThe poem of Immortal Zhou Dian reads:\n*“At first sight of the sagely ruler, he fulfills heaven’s foundation,\nHis bearing one moment majestic, the next foolish.\nAll fragments converge to bind the realm as one,\nThe vastness of heaven and earth is now at hand.\nFrom this time forth, the lord secures the state,\nWith boundless fortune, he races to repay grace.\nOur king, moved, wears a joyful countenance,\nAnd Buddhism shall flourish in this very age.”*\n\nThe ancient poem of the immortals reads:\n*“Atop Mount Lu’s peaks lies a deep valley,\nWhere the disciples of the Golden Immortal dwell in cliffside huts.\nFor how many years have they refined elixirs to aid the world?\nPlowing clouds at dawn, planting bamboo at dusk.”*\n\nOur eulogy for the barefoot monk reads:\n*“Barefoot and diligent, your deeds bear fruit,\nWho among the suffering and deluded can compare?\nTransgressions of past lives dissolved, karmic bonds severed,\nIllusions of the moment shed, the sorrows of the sea of deeds dispelled.\nLong have I heard of the traces left at Vast Expanse,\nNow at Tianchi I witness the Buddha’s advent.\nThe gods, pitying the common folk, extend Our life,\nAnd the elixir’s arrival cures Our long affliction.”*\n\nOur composition for the sacrificial offering to the Venerable Tianyan, Immortal Zhou Dian, Daoist Xu, and the barefoot monk:\n*“Of old, their forms were empty, transcending the myriad things in emptiness.\nBeyond the ten thousand dharmas, forms were difficult to grasp, yet a single spirit endured.\nThus it was—through countless kalpas of suffering.\nNow, their numinous and wondrous workings,\nHidden in the mysteries of Mount Lu,\nWere known only to Us, aiding Us in Our distress.\nYet We shall never forget their benevolent aid; We must repay them with due rites.\nThough their divinity is unfathomable,\nUnobstructed in their ascent and descent,\nRoaming freely between heaven and earth, traversing the eight directions,\nObserving the ways of mortals—\nWhen rites suddenly arrive, they vanish without response,\nWould they not be mocked by the world?\nThus, in advance, We informed the altars of the capital,\nAnd dispatched envoys to the foot of Mount Lu,\nTo pray to the mountain’s spirits,\nAnd present offerings with propriety.\nThe rites are but a token of gratitude.\nFew in this world understand the principles of the unseen and the manifest.\nWe dare to ask: may they appear in an instant, then vanish in the next,\nSo that the virtuous may admire them yet never attain,\nAnd the wicked may see them yet never draw near?”*",
      "overlap_context": "r, We thought: since We were ill and he had come with medicine—even if it were counterfeit—it was fitting to receive him. We went out to meet him, and he bestowed medicine upon Us. The names of the medicines were: one called two pieces of *Wenliang* medicine, and the other called one piece of *Wenliang* stone. The method of use was to place them in a golden box, rub them against the back, and then consume one cupful from a golden vessel—whereupon recovery would follow. We then took the medicine.",
      "start_char": 2870,
      "end_char": 4162,
      "start_sentence": 144,
      "end_sentence": 202,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.391641855239868,
      "metadata": {
        "source_file": "dao\\藏外\\御制周颠仙人传.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "）岂不有补于世道者欤！ 」 谨按：语云：「神仙有无何杳茫，天下岂有神仙，尽妖妄耳。 」今观国初周颠仙之事，则又历历皆实，有不可尽以为诬者。 要之天地间自有一种仙风道骨，但仙凡隔路，不可力致而强为也。",
      "translated_text": "Would this not contribute to the Dao of the world?”*\n\nCarefully considering the matter: As the saying goes, “Whether immortals exist is utterly obscure—how could there be immortals in the world? They are all delusions.” Yet examining the events of Zhou the Mad Immortal in the early years of Our dynasty, we find them all verifiably true, leaving no room for wholesale dismissal as fabrication. In essence, between heaven and earth there naturally exists a kind of immortal’s bearing and Daoist bone; yet the paths of immortals and mortals diverge, and one cannot forcibly attain them through effort.",
      "overlap_context": "y not be mocked by the world?\nThus, in advance, We informed the altars of the capital,\nAnd dispatched envoys to the foot of Mount Lu,\nTo pray to the mountain’s spirits,\nAnd present offerings with propriety.\nThe rites are but a token of gratitude.\nFew in this world understand the principles of the unseen and the manifest.\nWe dare to ask: may they appear in an instant, then vanish in the next,\nSo that the virtuous may admire them yet never attain,\nAnd the wicked may see them yet never draw near?”*",
      "start_char": 4162,
      "end_char": 4260,
      "start_sentence": 203,
      "end_sentence": 207,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 3.2646119594573975,
      "metadata": {
        "source_file": "dao\\藏外\\御制周颠仙人传.txt",
        "category": "藏外"
      }
    }
  ]
}