{
  "source_id": "指归集",
  "source_file": "chunked_daozang\\指归集.json",
  "total_chunks": 4,
  "total_original_chars": 4649,
  "total_translated_chars": 26709,
  "total_translation_time": 136.21158146858215,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\众术类\\指归集.txt",
    "category": "众术类"
  },
  "full_translation": "**The *Zhigui Ji* (Pointers to the Return)**\n**Scripture Title:** *Zhigui Ji* (Pointers to the Return). Compiled by Wu Wu of the Song Dynasty. One fascicle.\n**Source of Base Text:** *Daoist Canon of the Zhengtong Era*, *Dongshen* Section, *Zhongshu* Category.\n\n**General Preface to the *Zhigui Ji***\nBy Wu Wu, the Hermit of Gaogai Mountain\n\nThe preface states: The world possesses the natural Dao; the myriad things possess their natural principles. If one fails to grasp these principles, things cannot be understood—how much less can one avoid perishing in the Dao? The Way of divine transcendents is most profound and wondrous, achieved through the accumulation of deeds and the amassing of merit. Human life spans a hundred years, yet those who reach seventy are few. Even with diligent cultivation and accumulated merit, how much can one truly amass? Thus, those who seek transcendence must pursue longevity, and through the accumulation of merit and deeds, the teachings of *waidan* (external elixir) transmutation arose. Yet when illness strikes, the practices of talismanic invocation and firing the furnace are disrupted, giving rise to the arts of *neidan* (internal elixir) and tranquil cultivation.\n\nFrom antiquity to the present, though many have cultivated *neidan*, none have ascended without first refining *waidan*. The doctrines of *neidan* involve nothing more than the union of heart and kidney, the circulation of essence and *qi*, the preservation of spirit and breath retention, and the exchange of old and new breath. Some specialize in the arts of the bedchamber, others absorb the essences of the sun and moon, still others ingest herbs or practice grain avoidance and spousal abstention—all in pursuit of tranquility. Among these, only the preservation of spirit and breath retention, when practiced with utter detachment from worldly concerns, often resemble *dhyāna* meditation. Even if successful, such practices rely on the *yin* dwelling (the body), and their effects are not enduring; they may suffice for a time but cannot sustain one through change.\n\nYet these teachings also speak of *yin-yang*, the Eight Trigrams, the Four Symbols, the Five Phases, and the mercury-lead, dragon-tiger (metaphors)—for the sages did not wish to recklessly divulge celestial secrets and thus veiled them in the language of *waidan*. Hence the ancient song declares: *\"The inner medicine is none other than the outer medicine.\"* Its meaning runs deep. Alas, later generations, failing to fathom the intent of the ancients or comprehend the principles of nature, seize upon some minor peripheral method and claim that *neidan* alone can achieve transcendence, that immortality can be attained. Little do they realize that since antiquity, no transcendent has ever relied solely on *neidan* without also refining *waidan*.\n\nToday, the grotto-heavens and blessed lands across the world all bear traces of elixir refinement and ascension, with furnaces, wells, and cinnabar cauldrons still extant. If it were true that one must first perfect *neidan* before employing *waidan* for transmutation, then how is it that the servants, parrots, and dogs of ancient transcendents ascended alongside them? Were they, too, first perfected in *neidan*? Others obsessively seek rare herbs or smelt metals and minerals, unaware that herbs, though potent, rot when soaked in water and char when burned by fire—how can they endure? All these are those who fail to grasp principle.\n\nFrom youth, I have yearned for the Dao, and for twenty years now, I have frequently encountered perfected beings who imparted to me divine secrets. Their teachings trace back to the Divine Farmer, who tasted the hundred herbs and instructed the people in their use, declaring: \"This is cold in nature, that is hot; this is warm and balanced, that is deadly.\" Only cinnabar (*dansha*) could preserve both spirit and form. Thus, when the human heart and spirit are agitated, cinnabar is used; when the corpse wishes not to decay, mercury is employed. Mercury, responsive to the *qi* of *yin* and *yang*, crystallizes into cinnabar after eight hundred years, into silver after three thousand, and into gold after eighty thousand—growing ever more durable with time, undergoing myriad transformations. The sages harnessed water and fire, modeled the *qi* of *yin* and *yang*, and brought their work to completion—this is what is meant by \"seizing the mechanism of creation.\"\n\nFrom cinnabar to silver, from silver to gold, the *jinyi huandan* (golden liquid returning elixir) is extracted and ingested—herein lies the principle of longevity. Master Xiahou the Celestial Master said: \"The ancient sages nourished spirit with superior medicines, temperament with middling medicines, and dispelled illness with inferior medicines.\" The term *dan* (elixir) derives from its color. The *Bencao* (Materia Medica) refers only to *dansha* (cinnabar). The term *huan* (return) signifies the water of Heavenly One descending to the earth of Earthly Ten, restoring its original hue. This is what Master Lü meant by \"the returns of the five directions,\" all bearing the name *dan*.\n\nNaturally formed elixirs are rare in the world. The cinnabar found today contains only mercury, which cannot be consumed raw and must be refined—hence the term *liandan* (refined elixir). The *jiuzhuan* (nine cyclings) refer to the daily progression of two hexagrams, with twelve lines corresponding to the twelve months of the year. Beginning at *zi* (the first), it concludes at nine, symbolizing the cycle—all secrets passed down from the Divine Farmer. The text is called the *Jinbi Longhu Jing* (Scripture of the Golden and Azure Dragon-Tiger). The Yellow Emperor refined the Nine Cauldrons Elixir, achieved perfection, and ascended—later generations mistakenly attributed this text to him.\n\nWei Boyang’s *Cantong Qi* (Token for the Agreement of the Three), Master Cui’s *Ruyao Jing* (Mirror for Entering the Medicine), Qingxiazi’s *Huandan Jue* (Secrets of the Returning Elixir), and Master Peng’s *Jinyaoshi Lun* (Discourse on the Golden Key)—their origins are ancient, and the hundred schools trace their source to these works. Generally, the words of the sages are profound, like the records of celestial patterns, their principles subtle and obscure. Only when transmitted orally by those who have attained the Dao can success be assured—such is the nature of principle.\n\nZhang Pingshu said: *\"Waidan* is difficult to encounter but easy to accomplish.\" This is true attainment of the Dao. I deeply lament the difficulty later learners face in encountering (true teachings) and grieve the loss of transmission of the great Dao. Thus, I have compiled the words of the ancient sages and directly pointed to their essentials, calling this work *Zhigui* (Pointers to the Return), offering it to those of shared aspiration.\n\n---\n\n**The *Zhigui Ji***\n**The Returning Elixir Requires No Medicines**\n\nThe *Aozhi Zhenjue* (Profound Pointers to the True Secrets) states: The ancient transcendents spoke only of lead and mercury, never of the Four Yellows or Eight Stones. If even a single miscellaneous ingredient is added, it becomes a poison, harming the intestines and stomach upon ingestion. Fools take these杂药 to subdue mercury, forcing it to withstand fire, and feed it to others, calling it \"dead mercury\" that can preserve life—how grievously they mislead and harm people! Moreover, alum can slay tigers, and saltpeter can corrode copper; if such substances enter mercury and flow into the human abdomen, death is certain—ten thousand will die, ten thousand will perish.\n\nQingxiazi said: \"The Eight Stones, when exposed to fire, all turn to ashes; cinnabar, when immersed in water, transforms into silver.\"\n\nThe Venerable Master Ge* says:\nGreen Dragon and White Tiger share the same root,\nYet it is the two qi that shape the immortal’s form.\nTrue lead is the elixir of long life—\nDo not believe the common claim that \"medicines bring merit.\"\n\nLord Lao* once said: □ The sage refines the elixir without medicines,\nOnly the divine chamber is wrought of gold.\nThe *Scripture of Gold and Azure* states: \"South and north alone form the warp.\"\nHuang’s commentary says: In refining the Great Elixir, no miscellaneous medicines are added,\nOnly Kan and Li* are employed.\nGuangchengzi* says: \"Purely refine the marrow of Heaven and Earth’s yin and yang.\"\nMonk Ruoqing* says: \"Yellow Sprout is no external thing—\nWithin the image, extract the essence.\"\n(External thing: also rendered as \"worldly medicine.\")\nThe scriptures say: The numinous elixir is formed from a single ingredient,\nWith no external medicines added.\nIt is like the clam absorbing the moon’s radiance,\nForming a pearl within its belly—\nHow could it rely on strange substances to achieve this?\n\nLead is not worldly lead; mercury does not reside [in the ordinary].\nIf lead is misapplied, the qi will die.\nThe cinnabar within stone is the essence of father and mother,\nThus the body itself contains true lead.\nAmong the twenty-four grades of the Great Elixir,\nTwo hundred in number, the Yellow Sprout is foremost.\nLead is yang within yin; mercury is yin within yang.\n\nMaster Cen* says: \"If one refines the various Eight Stones,\nA thousand attempts yield not a single success.\"\nMaster Cao* says: \"The world does not know the source—\nThe many stones lead only to error.\"\nLord Yin* says: \"The good has no head; the cauldron has no ears.\nWithout medicines, one should proceed with restraint.\"\n\nHan Yunzhong*, a recluse of Mount Taibai’s northern slopes, says:\n\"From ancient times to the present, those fond of such arts number like hemp,\nYet deviating from the master, they obscure the true teaching.\nMercury is yin; lead is yin’s stubborn counterpart.\nPlucking blossoms to form the eleventh sprout—\nThis is called Dragon and Tiger.\nWorldly gold and silver, paired as mother and child,\nWhen gathered for elixir refinement, bring only untimely death.\nSuch errors abound, grossly misguided.\"\n\nZhang Pingshu* says: \"Do not refine the Three Yellows or Four Spirits.\nIf you seek among the many herbs, it is not the true Way.\nFor Heaven and Earth’s transformations never employ medicines.\nToday, many use poisonous substances to subdue cinnabar,\nFeeding it to others—\nHow many are thus misled!\nThese are the harms of toxic medicines,\nNot the fault of cinnabar—\nCan one not discern this?\"\n\nThe Returned Elixir consists solely of lead and mercury.\nZheng Siyuan* says: \"The Tiger is silver—\nThis is the Golden Duke, belonging to water and metal.\nThe Dragon is mercury—\nThis is the Alchemical Maiden, belonging to wood and fire.\nMetal generates water; water generates wood;\nWood generates fire; fire generates earth—\nThe Dao resides in this earth.\"\n\nMaster Wei* says: \"Swallows do not hatch phoenixes;\nFoxes and hares do not nurse horses.\nWithout true father and mother,\nAll offspring are false.\"\n\nGuangchengzi says: \"To leave the Li Palace is but a trifling matter—\nSeek within the Kan Chamber and refine the essence.\"\nMaster Yang* says: \"Within yin there is yang; within yang there is yin.\nHaving recognized mercury within cinnabar,\nOne must seek gold within lead.\"\n\nYin Changsheng* says: \"Gold forms the bones, mercury the body—\nYin and yang unite, naturally drawn together.\"\nMaster Tao Zhi* says: \"If you wish to still mercury,\nRely on the power of Kan and Li.\"\nMonk Ruoqing says: \"If the sprout is lead, depart from lead by ten thousand miles.\nIf the sprout is not lead, begin with lead.\"\n\nMaster Zhang Hua* says: \"When the Tiger is subdued, the Dragon hides;\nWhen the Dragon lies low, the Tiger is first subdued.\"\nLord Lao’s *Records of the Pass of Hangu* says:\n\"Red lead and black mercury are the head of the Great Elixir—\nMercury alone, in its singular mystery, is profoundly subtle.\"\n\nThe *Scripture of the Sacred Stone* says: \"Gold transforms into gold; silver transforms into silver.\"\nMaster Zhang the Celestial Master* says: \"Lead draws out the marrow; mercury draws out the essence.\nWhen essence and marrow unite, the elixir is surely formed.\"\n\nMaster Taiyi* says: \"The art of inverting the Five Phases—\nThe Dragon emerges from within fire.\nThe Five Phases do not proceed in order—\nThe Tiger is born within water.\"\n\nFor among all things under Heaven,\nOnly the subdued can restrain the soaring;\nThe Tiger is subdued, and the Dragon takes flight.\nOnly the still can restrain the moving—\nYin is still, and yang moves.\nThus, with lead to subdue mercury,\nThe principle lies herein.\n\nLead and mercury must be truly of the Three*\nThe *Profound Pointers to the True Secrets* states:\n\"Only fear that the lead is not true—\nWhen the elixir is formed, the medicine is naturally efficacious.\nOnly fear that the mercury is not correct—\nWhen the elixir is formed, the medicine is naturally sacred.\"\n\nMaster Tao* says: \"If the lead is true, it does not lose its household minister.\nIf the lead is not true, its mercury will be difficult to unite.\"\nThe *Can Tong Qi* says: \"When lead and mercury attain their truth,\nThey naturally follow one another from beginning to end.\"\nLead is not silver; mercury is not wood.\n\nThe Most High says: \"One thing divides into two—\nHalf resembles lead, half resembles mercury.\"\nAn ancient poem says: \"Temporarily borrow lead’s root—\nIf lead is not fully removed, how can it become the supreme medicine?\"\n\nThe *Resolving Doubts on the True Secrets* says:\n\"Decisively employ the two substances, lead and mercury—\nIf they are not worldly lead and mercury, they become the supreme medicine.\nOne should select and apply their most refined methods.\"\n\nQingxiazi says: \"Lead is the mother of the sprout.\"\nThe commentary says: \"Metal can generate water; water can generate metal—\nThus, the sprout is born within lead, which is the proof.\nHence, the secret says: Lead can restrain mercury; mercury can subdue lead.\nWhen lead and mercury take form, it is called restraint and subjugation.\nWood can generate fire; fire can also generate wood—\nThus, mercury is born within cinnabar, which is the proof.\nTherefore, mercury is called wood because it receives the qi of the Great Yang,\nTransforming into flowing pearls.\nThe Great Yang is the sun; the sun rises in the east, and the east belongs to wood.\nThe Great Yin is the moon; the moon is born in the west, and the west belongs to metal.\nThus, in the Returned Elixir, establishing the image is the standard.\nRecognizing true lead requires knowing true mercury.\nGold within water—metal generates water, thus silver is the mother of lead.\nMercury within cinnabar is the Dark Pearl.\nYellow earth restrains water, preventing its flow—\nMetal and water generate one another.\nYet metal overcomes wood; water conquers fire.\nEarth flourishes in all four seasons—\nThe mutual generation from beginning to end,\nThe mutual conquest of the Five Phases,\nThe Three and Five unite to form the supreme medicine.\"\n\nThe Five Phases: water generates wood—this is mercury. Wood generates fire—this is cinnabar. Fire generates earth—this is the true earth transformed by spirit and qi. Earth generates metal—this is white metal. Metal generates water—this is black water. None of these are the silver, cinnabar, or earth of the mundane world.\n\nThe sprout is the child of lead; once the golden flower is seen, gather the lead yet do not employ it. The *Danjian* states: \"Lead is lead, mercury is mercury—people of the world all misuse them.\" Yang Yuanyi said: \"To seek immortality and find the yellow lead, one must obtain the true essence of lead.\" Huangzi said: \"People of the world all study to seek the medicine, yet none truly find it.\"\n\nThe Dao employs lead yet does not employ lead; when it comes to employing lead, to employ lead is still mistaken. *Wangjiangnan* says: \"In the beginning of learning the Dao, one must obtain true lead.\" Only by clarifying the essence of the Five Phases can transformations be boundless—how wondrous, how wondrous!\n\n**The Mutual Generation and Conquest of the Five Phases**\nThe *Yinfu Jing* states: \"Observe the Dao of Heaven, grasp the workings of Heaven—this is perfection. Heaven has five thieves; those who see them prosper.\" Thus, Qingxiazi said: \"Mercury is the Green Dragon, governed by the *Zhen* trigram, stored in the liver, belonging to the east and the *jia-yi* wood. Wood generates fire; fire governs the heart, the south and the *bing-ding* fire, governed by the *Li* trigram. Its form is originally green, but when it meets fire, it turns red—thus it transforms into cinnabar, becoming the Vermilion Bird, belonging to yang. When yang reaches its extreme, yin arises—within cinnabar lies vermilion mercury, which also resembles the two lines within the *Li* trigram. Just as within the sun lies the Golden Crow, and the crow, being female, belongs to yin, it is the Dark Warrior, governed by the *Kan* trigram, stored in the kidneys, belonging to the north and the *ren-gui* water. Lead resembles the *Kan* trigram’s water, being yin; when yin reaches its extreme, yang arises—within black lead lies white metal, like the single line within *Kan*, or like the rabbit within the moon. The rabbit, being male, belongs to yang. Metal is the White Tiger, governed by the *Dui* trigram, stored in the lungs, belonging to the west and the *geng-xin* metal. When metal returns to its nature, water and fire naturally dissolve and melt. Its color turns to yellow, which governs the spleen, the spleen being the central *wu-ji* earth. The liver, green, is the father of wood; the lungs, white, are the mother of metal; the kidneys, black, are the child of water; the spleen, yellow, is the sovereign of earth. The Five Phases mutually propel one another, all residing within them.\n\nIn general, the Five Phases generate one another in return and restrain one another in turn. Thus, metal generates water, water generates wood, wood generates fire, fire generates earth, and earth generates metal. Yet in their restraint: metal conquers wood, wood conquers earth, earth conquers water, water conquers fire, and fire conquers metal. Therefore, mercury is metal. With metal, one fells wood; cinnabar is fire. With fire, one melts metal; lead is water. With water, one extinguishes fire. When water becomes abundant, earth is used to restrain it. Responding to their kind, restraining with their qi—the great elixir is accomplished.\n\nThe *Jinbi Jing* states: \"Evolving the lines and verifying the trigrams, the Five Phases are the pivot. *Kan* is the male essence of metal; *Li* is the female radiance of fire. Metal and fire contend; water and earth conquer. When earth flourishes in the domain of metal, the three substances all perish. Their convergence brings about great peace.\"\n\nChunyu Shutong said: \"The nature of wood is to be upright, yet it is harmed by metal. The nature of water is to be yielding, yet it is conquered by earth. Though earth is thickly heaped, it is harmed by wood. Though metal is firm, it is melted by fire. This mutual conquest of the Five Phases is the constant principle of the great Dao.\"\n\nMaster Cao said: \"Seize the eastern Dragon and pair it with the western Tiger. Then take the southern Vermilion Bird to meet the northern Dark Warrior. Among them, the most essential is the central earth.\"\n\nYan Junping said: \"One, two, three, four, five—metal, wood, water, fire, earth. If one can understand this secret, it is the path to longevity.\"\n\nZhang Pingshu said: \"When the two substances meet, their natures harmonize; where the Five Phases are complete, the Tiger and Dragon coil. For it is clear that without earth, the Five Phases do not generate, and without earth, the golden elixir does not form.\"\n\n**Fire Timing Lies in the Precise Examination of the Five**\nQingxiazi said: \"From the first month to the seventh month in *shen*, it is the Seven Returns. From the eleventh month to the seventh month, it is the Nine Revolutions. The fire begins with the first yang.\" The commentary states: \"Without the Seven Returns and Nine Revolutions of lead and mercury, they will not form; even if formed, they will not be efficacious. This is the *fu* of the eleventh month, the *lin* of the twelfth month, the *tai* of the first month, the *dazhuang* of the second month, the *guai* of the third month, the *qian* of the fourth month, the *gou* of the fifth month, the *dun* of the sixth month, the *pi* of the seventh month, the *guan* of the eighth month, the *bo* of the ninth month, and the *kun* of the tenth month. Refining the medicine into the elixir completes one cycle, encompassing the twenty-four qi. The returned elixir is purple-red, with the two qi fulfilled—radiant, weighty, without loss of its original weight, all transformed into true earth, with boundless transformations.\"\n\nHe also said: \"The *zi*, *chou*, and *yin* months are spring; the *mao*, *chen*, and *si* months are summer—these six months are purely yang in action, with yin seeking yang, and water soaking in color. The *wu*, *wei*, and *shen* months are autumn; the *you*, *xu*, and *hai* months are winter—these six months are purely yin in action, with yang seeking yin, and water congealing and solidifying. Metal disperses and enters water; the qi of water and fire contend, their forms merging and struggling, moving without fixed direction, rising and falling without constancy. Water ascends when it meets fire; metal submits when it meets fire. Mutually requiring transformation, they congeal within the vessel—the body of the returned elixir, wondrous and unfathomable.\"\n\nThe *Jinbi Jing* states: \"When *kun* first transforms into *zhen*, on the third day the moon appears in *geng*. The Dragon and Tiger seek one another; when *kun* transforms again into *dui*, on the eighth day the moon is in *ding*—the upper crescent, half a catty of metal. When the *kun* body transforms into *qian*, it shines round in *jia* of the east. Metal and water warm the Great Yang; red water flows as mercury. Mercury plays in the golden crucible; the moon waxes through union and wanes. At sixteen transformations, life begins; the *qian* body wanes into *xun*. At dawn, the moon appears in *xin*; *qian* is further diminished into *gen*.\"\n\nAt the twenty-third appearance, *gen* is seen—half a catty of water in the lower crescent. The moon emerges in the south of *bing*; *qian* transforms thrice into *kun*. On the thirtieth day, *kun* and *yi* lose their companions in the northeast. The moon sets in the land of *yi*; earth, wood, and metal are about to transform, and the succeeding body gives birth to the *zhen* Dragon.\n\nThe *Cantong Qi* states: \"The fire record is six hundred, making sixty days. Within day and night, the four qi’s nodes—such is the Dao of transformation, exhausted.\" Time accumulates into days, days into months, months into years. Within a single day of twelve hours, it is divided in two: six hours for yang, six for yin. The central yang and the four qi—fire follows the same pattern.\n\nThe *Taigu Huolong Jing* says: \"The Bright Dragon, endowed with the true yang qi’s color, returns to green, nurturing the Fire Palace. It receives the true qi of four thousand three hundred and thirty years—hence called the Fire Dragon.\" Sima Wei’s commentary notes: \"According to the *Jinjing Taisu Jing*, cinnabar is endowed with the true yang’s qi and contains the utmost yin’s essence. From its gestational qi, after four thousand three hundred and twenty years, it forms the elixir body thus. Therefore, in the *fu* hexagram, fire requires four thousand three hundred and twenty years to complete the Great Elixir.\"\n\nMaster Ge the Perfected says: \"The fire-timing of bathing is not recorded in texts; one must encounter a realized master to receive the oral transmission. For the fire-timing is the greatest essential in the elixir—though former and later sages have detailed it in writing, it is not that they did not transmit it. As for its subtleties, they cannot be fully grasped, so all depends on the moment. Only those of the Dao’s path examine it with careful intent.\"\n\nThe mechanism of ancient heaven and earth, the principles of yin and yang, the workings of creation—sages have recorded them in books, with every detail complete, transmitting them to later ages to let all under heaven know the return of the supreme Dao. Yet foolish and deluded fools, perverse and obstinate, disbelieve the sages, claiming that the world’s mechanism cannot be revealed. Thus they turn their backs on the supreme Dao, dying without awakening. This is no other reason than that their conduct does not accord with principle, so their minds do not penetrate principle and do not enter the Dao.\n\nThe sages’ minds—do they lie outside principle? That which the *Yinfu Jing* calls \"revealing heaven’s mechanism, sinking it for three kalpas\"—it speaks of deluded fools who toy with the Great Dao, treating it as unreasonable, not that they wish the Dao to have no transmission. Now, the Dao of Yao, Shun, Wen, and Wu, and the teachings of the Zhou and Confucius, lie in the Six Classics. Earnestly they instruct, wishing all under heaven to become scholar-gentlemen, and all scholar-gentlemen indeed emerge from them. As for the return of petty men, though they read them, they do not understand. The books of the Buddha fill the world, with teachings of every kind, wishing all under heaven to become Buddhas, and all Buddhas indeed emerge from them. As for those who delight in creating evil karma, though they recite them, they do not comprehend.\n\nMoreover, the books of Fuxi and Shennong have long been transmitted in the world—how could they still harbor concealment? Only those whose minds are attuned to the Dao and whose conduct accords with principle, upon seeing them, naturally awaken to principle and attain the Dao. I have pored over alchemical classics, over a hundred and ten schools. Though their words differ, their principles are truly one. Thus I have selected the most accessible and compiled them above. The cited scriptures, songs, and poems—some begin with Master Jia, while transmitters attribute them to Yi; or a single essential word appears across various schools.\n\nFor instance, among the hundreds of methods of the golden elixir, the essential lies in the divine water and the Flowery Pond, originally from Li Quan’s *Yinfu Jing* method, yet various schools cite it as scripture. Such cases rely only on what I have heard, without leisure to investigate their origins and beginnings. I record them to transmit their principles, forgetting their fishing weirs and rabbit snares. Where inconsistencies arise, many are books forged by magicians since the Qin and Han. Scholars, by applying principle, will naturally see through them.\n\nThe *Collected Pointers to the Return* is now complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "指归集 经名：指归集。 宋吴悟撰。 一卷。 底本出处：《正统道藏》洞神部众术类。 指归集总叙 高盖山人吴悟撰 叙曰：天下有自然之道，万物有自然之理。 不得於理，物且不通，而死於道乎。 神仙之道，至矣妙矣，由积行累功所致也。 人生百岁，七十者少。 纵勤功行，积累几何。 是以欲学仙者，必求长生，以积功累行，故有外丹点化之说。 然一遇疾病，则行符运火之功度，故又有内丹安乐之术。 自古至今，虽修内丹，未有不炼外丹而飞升者也。 内丹之说，不过心肾交会，精气般运，存神闭息，吐故纳新。 或专房中之术，或采日月精华，或服饵草木，或辟谷休妻，皆所以求安乐也。 其中惟存神闭息，如能忘机绝虑，往往与禅定颇同。 纵使成功，亦由阴宅，不兔长用，迁徙则可矣。 然亦说阴阳八卦，四象五行，汞铅龙虎者，圣人不欲轻泄天机，托之以寓外丹耳。 故古歌云：内药还同外药。 厥旨深远。 奈何后世不探古人之意，不达自然之理，得一旁门小法，便谓内丹可成，神仙可致。 殊不知自古神仙，何不只修内丹，又不必炼外丹乎。 今天下洞天福地，皆因炼丹飞升，有炉井丹鳌存焉。 若日先修内丹必功成，然后得用外丹点化，则古神仙奴婢鹦犬，随之飞升，又安有先成内丹者乎。 ．复有褊寻灵草，缎炼金石殊不知草纵有灵，水浸则腐，火焚即焦，又岂能长久乎。 皆不通理者也。 予幼知慕道，今二十年，常遇至人授以神诀。 其说盖自神农氏尝百药，教民服饵，日某性寒，某性热，某性温平，某性杀人。 唯丹砂一味，能存神与形。 是以世人心神惕乱则砂，尸欲不朽则用水银。 水银感阴阳之气，八百岁而成砂，三千岁而成银，八万岁而成金，愈久愈坚，千燮万化。 圣人运水火，法阴阳之气，而毕其功，所谓夺得造化机者也。 由砂以至银，由银以至金，金液还丹，取而服饵，长生之理，端在乎此。 夏侯天师云：古圣以上药养神，中药养性，下药遣病。 名曰丹者，以其色也。 《本草》只日丹砂。 日还者，曰天一之水，以至地十之土，而还其元色。 吕真人所谓五方还，尽得丹名者是也。 天生成丹，世罕得之。 今砂中之丹，止是水银，生不可食，必炼熟，故日炼丹。 曰九转者，一日行二卦，有十二爻，以应一年十二月。 初起子一，终於九，而转象也，此皆神农氏之诀。 其书谓之《金碧龙虎经》。 黄帝因修九鼎丹，成而飞升，后世遂指为黄帝之书，误矣。 魏伯阳《参同契》崔真人《入药镜》、青霞子《还丹诀》、彭真人《金钥匙论》，其源始且，百家之源出．於此也。 大抵圣人之言其远，如天文藉所载，理或幽微，唯得道之人口口相授，为无不成，盖理之所在也。 张平叔云：外丹难遇而易成。 真达道也。 愚切闵后学之难遇，痛大道之无传，辄述先圣之言，而直指其要目，曰《指归》，用贻同志云耳。 指归集 还丹不用药－ 《奥旨真诀》云：古仙唯论铅汞二字，不云四黄八石。 若有一味杂药入之，皆是毒药，服即伤人肠胃。 愚者将杂药制伏水银，令伏火，与人服食，便呼为死水银，能固济生人，误伤人甚矣。 且矾石有杀虎之能，炮砂有坏铜之毒，水银中被此药，流入人腹必死，万即万有矣。 青霞子曰：八石见火悉为灰烬，丹砂入水化为白银。",
      "translated_text": "**The *Zhigui Ji* (Pointers to the Return)**\n**Scripture Title:** *Zhigui Ji* (Pointers to the Return). Compiled by Wu Wu of the Song Dynasty. One fascicle.\n**Source of Base Text:** *Daoist Canon of the Zhengtong Era*, *Dongshen* Section, *Zhongshu* Category.\n\n**General Preface to the *Zhigui Ji***\nBy Wu Wu, the Hermit of Gaogai Mountain\n\nThe preface states: The world possesses the natural Dao; the myriad things possess their natural principles. If one fails to grasp these principles, things cannot be understood—how much less can one avoid perishing in the Dao? The Way of divine transcendents is most profound and wondrous, achieved through the accumulation of deeds and the amassing of merit. Human life spans a hundred years, yet those who reach seventy are few. Even with diligent cultivation and accumulated merit, how much can one truly amass? Thus, those who seek transcendence must pursue longevity, and through the accumulation of merit and deeds, the teachings of *waidan* (external elixir) transmutation arose. Yet when illness strikes, the practices of talismanic invocation and firing the furnace are disrupted, giving rise to the arts of *neidan* (internal elixir) and tranquil cultivation.\n\nFrom antiquity to the present, though many have cultivated *neidan*, none have ascended without first refining *waidan*. The doctrines of *neidan* involve nothing more than the union of heart and kidney, the circulation of essence and *qi*, the preservation of spirit and breath retention, and the exchange of old and new breath. Some specialize in the arts of the bedchamber, others absorb the essences of the sun and moon, still others ingest herbs or practice grain avoidance and spousal abstention—all in pursuit of tranquility. Among these, only the preservation of spirit and breath retention, when practiced with utter detachment from worldly concerns, often resemble *dhyāna* meditation. Even if successful, such practices rely on the *yin* dwelling (the body), and their effects are not enduring; they may suffice for a time but cannot sustain one through change.\n\nYet these teachings also speak of *yin-yang*, the Eight Trigrams, the Four Symbols, the Five Phases, and the mercury-lead, dragon-tiger (metaphors)—for the sages did not wish to recklessly divulge celestial secrets and thus veiled them in the language of *waidan*. Hence the ancient song declares: *\"The inner medicine is none other than the outer medicine.\"* Its meaning runs deep. Alas, later generations, failing to fathom the intent of the ancients or comprehend the principles of nature, seize upon some minor peripheral method and claim that *neidan* alone can achieve transcendence, that immortality can be attained. Little do they realize that since antiquity, no transcendent has ever relied solely on *neidan* without also refining *waidan*.\n\nToday, the grotto-heavens and blessed lands across the world all bear traces of elixir refinement and ascension, with furnaces, wells, and cinnabar cauldrons still extant. If it were true that one must first perfect *neidan* before employing *waidan* for transmutation, then how is it that the servants, parrots, and dogs of ancient transcendents ascended alongside them? Were they, too, first perfected in *neidan*? Others obsessively seek rare herbs or smelt metals and minerals, unaware that herbs, though potent, rot when soaked in water and char when burned by fire—how can they endure? All these are those who fail to grasp principle.\n\nFrom youth, I have yearned for the Dao, and for twenty years now, I have frequently encountered perfected beings who imparted to me divine secrets. Their teachings trace back to the Divine Farmer, who tasted the hundred herbs and instructed the people in their use, declaring: \"This is cold in nature, that is hot; this is warm and balanced, that is deadly.\" Only cinnabar (*dansha*) could preserve both spirit and form. Thus, when the human heart and spirit are agitated, cinnabar is used; when the corpse wishes not to decay, mercury is employed. Mercury, responsive to the *qi* of *yin* and *yang*, crystallizes into cinnabar after eight hundred years, into silver after three thousand, and into gold after eighty thousand—growing ever more durable with time, undergoing myriad transformations. The sages harnessed water and fire, modeled the *qi* of *yin* and *yang*, and brought their work to completion—this is what is meant by \"seizing the mechanism of creation.\"\n\nFrom cinnabar to silver, from silver to gold, the *jinyi huandan* (golden liquid returning elixir) is extracted and ingested—herein lies the principle of longevity. Master Xiahou the Celestial Master said: \"The ancient sages nourished spirit with superior medicines, temperament with middling medicines, and dispelled illness with inferior medicines.\" The term *dan* (elixir) derives from its color. The *Bencao* (Materia Medica) refers only to *dansha* (cinnabar). The term *huan* (return) signifies the water of Heavenly One descending to the earth of Earthly Ten, restoring its original hue. This is what Master Lü meant by \"the returns of the five directions,\" all bearing the name *dan*.\n\nNaturally formed elixirs are rare in the world. The cinnabar found today contains only mercury, which cannot be consumed raw and must be refined—hence the term *liandan* (refined elixir). The *jiuzhuan* (nine cyclings) refer to the daily progression of two hexagrams, with twelve lines corresponding to the twelve months of the year. Beginning at *zi* (the first), it concludes at nine, symbolizing the cycle—all secrets passed down from the Divine Farmer. The text is called the *Jinbi Longhu Jing* (Scripture of the Golden and Azure Dragon-Tiger). The Yellow Emperor refined the Nine Cauldrons Elixir, achieved perfection, and ascended—later generations mistakenly attributed this text to him.\n\nWei Boyang’s *Cantong Qi* (Token for the Agreement of the Three), Master Cui’s *Ruyao Jing* (Mirror for Entering the Medicine), Qingxiazi’s *Huandan Jue* (Secrets of the Returning Elixir), and Master Peng’s *Jinyaoshi Lun* (Discourse on the Golden Key)—their origins are ancient, and the hundred schools trace their source to these works. Generally, the words of the sages are profound, like the records of celestial patterns, their principles subtle and obscure. Only when transmitted orally by those who have attained the Dao can success be assured—such is the nature of principle.\n\nZhang Pingshu said: *\"Waidan* is difficult to encounter but easy to accomplish.\" This is true attainment of the Dao. I deeply lament the difficulty later learners face in encountering (true teachings) and grieve the loss of transmission of the great Dao. Thus, I have compiled the words of the ancient sages and directly pointed to their essentials, calling this work *Zhigui* (Pointers to the Return), offering it to those of shared aspiration.\n\n---\n\n**The *Zhigui Ji***\n**The Returning Elixir Requires No Medicines**\n\nThe *Aozhi Zhenjue* (Profound Pointers to the True Secrets) states: The ancient transcendents spoke only of lead and mercury, never of the Four Yellows or Eight Stones. If even a single miscellaneous ingredient is added, it becomes a poison, harming the intestines and stomach upon ingestion. Fools take these杂药 to subdue mercury, forcing it to withstand fire, and feed it to others, calling it \"dead mercury\" that can preserve life—how grievously they mislead and harm people! Moreover, alum can slay tigers, and saltpeter can corrode copper; if such substances enter mercury and flow into the human abdomen, death is certain—ten thousand will die, ten thousand will perish.\n\nQingxiazi said: \"The Eight Stones, when exposed to fire, all turn to ashes; cinnabar, when immersed in water, transforms into silver.\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1251,
      "start_sentence": 0,
      "end_sentence": 57,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.543543338775635,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\指归集.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "葛仙爷曰：青龙白虎休本同，只凭二气作仙容。 真铅便是长生药，莫信‘凡言有药功。 老君日．□圣人炼丹不用药，唯有神室是金作。 《金碧经》云：南北独为经。 黄氏注云：修大丹不入杂药，唯用坎离也。 广成子曰：纯烧天地阴阳髓。 僧若请日：黄芽非外物，内象取精华。 外物，一作世药。 经云：灵丹本一味而成，无外药入。 譬如蚌吸月华之气，成珠在腹，岂藉异物而成之乎。 铅铅非世铅，汞不居，解移铅裹，气叉死。 石中朱铅，本父母之精气，故身中自有真铅。 大丹二十四品，二百个，黄芽为第一。 铅是阴中阳，汞是阳中之阴。 岑真人日：若修诸八石，千万无一成。 曹真人日：世人不知源，众石多错误。 阴真君日：良无头，釜无耳，不用药，宜下制。 太白山阴士韩蕴中日－'．古今好者计数如麻，乖师不明宗旨，水银为阴。 黄为阴顽铅相投，探花为十一芽木立，号为龙为虎。 凡世金银，配在子母，收丹服炼，自取无常，满目如斯，乖讹太甚。 张平叔日：休炼三黄及四神，若寻众草更非真。 盖天地造化，何尝用药。 今人多以毒药制伏丹砂，与人服饵，反误者多矣。 皆难药毒，非丹砂之罪，可不察哉。 还丹只铅汞二 郑思远曰：虎者银也，金公是也，属水也，金也。 龙者汞也，诧女是也，属木也，火也。 金生水，水生木，木生火，火生土，道在其土矣。 魏公日：燕雀不生凤，狐兔不乳马。 若无真父母，所生俱是假。 广成子日：要休离宫亦等闲，搜求坎户取精研。 杨真人曰：阴中有阳，阳中有阴。 既识砂中汞，须求铅裹金。 阴长生日：金作骨兮汞作身，阴阳配合自相亲。 陶植真人日：若要死水银，须凭坎离力。 僧若讷曰：芽若是铅，去铅万里。 芽若非铅，从铅为始。 张华真人日：虎伏龙亦藏，龙潜虎先伏。 老君《函谷关记》日：红铅黑汞大丹头，水银一味独玄幽。 《圣石经》日：金化金兮银化银。 张天师日：铅抽髓，汞抽精。 精髓相合丹必成。 太一真人曰：五行颠倒术，龙从火裹出。 五行不顺行，虎向水中生。 盖天下之物，惟伏可以制飞，虎伏而龙飞。 惟静可以制动，阴静而阳动。 故以铅伏汞，理在此矣。 铅汞须得真三 《奥旨真诀》云：只恐铅不真，丹成药自灵。 只恐汞不正，丹成药自圣。 陶真人云：铅若是真，不失家臣。 铅若不真，其汞难亲。 《参同契》云：铅汞得其真，终始自相因。 铅不是银，汞非是木。 太上日：一物分二休，半象铅半象汞。 古诗云：暂借铅根本，若去铅不尽，岂堪为至药。 《辨真诀疑》日：决定用铅汞二物，即非世上铅汞，便为至药，当拣拾其精妙法门而用之。 青霞子日：铅为芽之母。 注云：金能生水，水能生金，则铅中生其芽，是其证也。 故诀云：铅能制汞，汞能伏铅，铅汞成形，故名制伏。 木能生火，火亦能生木，则丹砂中生汞，是其证也。 所以谓汞为木者，以汞受太阳之气，化为流珠。 太阳日也，日出於束，束属木。 太阴月也，月生於西，西属金。 故还丹以立象为准。 认得真铅，必识真汞。 水中金，金生水，故银为铅母。 汞在砂中为玄珠，黄土制水，则不能流，金水相生。 然金伐木，水克火，土旺四季，始终之相因，五行之相克，三五一共成至药。",
      "translated_text": "The Venerable Master Ge* says:\nGreen Dragon and White Tiger share the same root,\nYet it is the two qi that shape the immortal’s form.\nTrue lead is the elixir of long life—\nDo not believe the common claim that \"medicines bring merit.\"\n\nLord Lao* once said: □ The sage refines the elixir without medicines,\nOnly the divine chamber is wrought of gold.\nThe *Scripture of Gold and Azure* states: \"South and north alone form the warp.\"\nHuang’s commentary says: In refining the Great Elixir, no miscellaneous medicines are added,\nOnly Kan and Li* are employed.\nGuangchengzi* says: \"Purely refine the marrow of Heaven and Earth’s yin and yang.\"\nMonk Ruoqing* says: \"Yellow Sprout is no external thing—\nWithin the image, extract the essence.\"\n(External thing: also rendered as \"worldly medicine.\")\nThe scriptures say: The numinous elixir is formed from a single ingredient,\nWith no external medicines added.\nIt is like the clam absorbing the moon’s radiance,\nForming a pearl within its belly—\nHow could it rely on strange substances to achieve this?\n\nLead is not worldly lead; mercury does not reside [in the ordinary].\nIf lead is misapplied, the qi will die.\nThe cinnabar within stone is the essence of father and mother,\nThus the body itself contains true lead.\nAmong the twenty-four grades of the Great Elixir,\nTwo hundred in number, the Yellow Sprout is foremost.\nLead is yang within yin; mercury is yin within yang.\n\nMaster Cen* says: \"If one refines the various Eight Stones,\nA thousand attempts yield not a single success.\"\nMaster Cao* says: \"The world does not know the source—\nThe many stones lead only to error.\"\nLord Yin* says: \"The good has no head; the cauldron has no ears.\nWithout medicines, one should proceed with restraint.\"\n\nHan Yunzhong*, a recluse of Mount Taibai’s northern slopes, says:\n\"From ancient times to the present, those fond of such arts number like hemp,\nYet deviating from the master, they obscure the true teaching.\nMercury is yin; lead is yin’s stubborn counterpart.\nPlucking blossoms to form the eleventh sprout—\nThis is called Dragon and Tiger.\nWorldly gold and silver, paired as mother and child,\nWhen gathered for elixir refinement, bring only untimely death.\nSuch errors abound, grossly misguided.\"\n\nZhang Pingshu* says: \"Do not refine the Three Yellows or Four Spirits.\nIf you seek among the many herbs, it is not the true Way.\nFor Heaven and Earth’s transformations never employ medicines.\nToday, many use poisonous substances to subdue cinnabar,\nFeeding it to others—\nHow many are thus misled!\nThese are the harms of toxic medicines,\nNot the fault of cinnabar—\nCan one not discern this?\"\n\nThe Returned Elixir consists solely of lead and mercury.\nZheng Siyuan* says: \"The Tiger is silver—\nThis is the Golden Duke, belonging to water and metal.\nThe Dragon is mercury—\nThis is the Alchemical Maiden, belonging to wood and fire.\nMetal generates water; water generates wood;\nWood generates fire; fire generates earth—\nThe Dao resides in this earth.\"\n\nMaster Wei* says: \"Swallows do not hatch phoenixes;\nFoxes and hares do not nurse horses.\nWithout true father and mother,\nAll offspring are false.\"\n\nGuangchengzi says: \"To leave the Li Palace is but a trifling matter—\nSeek within the Kan Chamber and refine the essence.\"\nMaster Yang* says: \"Within yin there is yang; within yang there is yin.\nHaving recognized mercury within cinnabar,\nOne must seek gold within lead.\"\n\nYin Changsheng* says: \"Gold forms the bones, mercury the body—\nYin and yang unite, naturally drawn together.\"\nMaster Tao Zhi* says: \"If you wish to still mercury,\nRely on the power of Kan and Li.\"\nMonk Ruoqing says: \"If the sprout is lead, depart from lead by ten thousand miles.\nIf the sprout is not lead, begin with lead.\"\n\nMaster Zhang Hua* says: \"When the Tiger is subdued, the Dragon hides;\nWhen the Dragon lies low, the Tiger is first subdued.\"\nLord Lao’s *Records of the Pass of Hangu* says:\n\"Red lead and black mercury are the head of the Great Elixir—\nMercury alone, in its singular mystery, is profoundly subtle.\"\n\nThe *Scripture of the Sacred Stone* says: \"Gold transforms into gold; silver transforms into silver.\"\nMaster Zhang the Celestial Master* says: \"Lead draws out the marrow; mercury draws out the essence.\nWhen essence and marrow unite, the elixir is surely formed.\"\n\nMaster Taiyi* says: \"The art of inverting the Five Phases—\nThe Dragon emerges from within fire.\nThe Five Phases do not proceed in order—\nThe Tiger is born within water.\"\n\nFor among all things under Heaven,\nOnly the subdued can restrain the soaring;\nThe Tiger is subdued, and the Dragon takes flight.\nOnly the still can restrain the moving—\nYin is still, and yang moves.\nThus, with lead to subdue mercury,\nThe principle lies herein.\n\nLead and mercury must be truly of the Three*\nThe *Profound Pointers to the True Secrets* states:\n\"Only fear that the lead is not true—\nWhen the elixir is formed, the medicine is naturally efficacious.\nOnly fear that the mercury is not correct—\nWhen the elixir is formed, the medicine is naturally sacred.\"\n\nMaster Tao* says: \"If the lead is true, it does not lose its household minister.\nIf the lead is not true, its mercury will be difficult to unite.\"\nThe *Can Tong Qi* says: \"When lead and mercury attain their truth,\nThey naturally follow one another from beginning to end.\"\nLead is not silver; mercury is not wood.\n\nThe Most High says: \"One thing divides into two—\nHalf resembles lead, half resembles mercury.\"\nAn ancient poem says: \"Temporarily borrow lead’s root—\nIf lead is not fully removed, how can it become the supreme medicine?\"\n\nThe *Resolving Doubts on the True Secrets* says:\n\"Decisively employ the two substances, lead and mercury—\nIf they are not worldly lead and mercury, they become the supreme medicine.\nOne should select and apply their most refined methods.\"\n\nQingxiazi says: \"Lead is the mother of the sprout.\"\nThe commentary says: \"Metal can generate water; water can generate metal—\nThus, the sprout is born within lead, which is the proof.\nHence, the secret says: Lead can restrain mercury; mercury can subdue lead.\nWhen lead and mercury take form, it is called restraint and subjugation.\nWood can generate fire; fire can also generate wood—\nThus, mercury is born within cinnabar, which is the proof.\nTherefore, mercury is called wood because it receives the qi of the Great Yang,\nTransforming into flowing pearls.\nThe Great Yang is the sun; the sun rises in the east, and the east belongs to wood.\nThe Great Yin is the moon; the moon is born in the west, and the west belongs to metal.\nThus, in the Returned Elixir, establishing the image is the standard.\nRecognizing true lead requires knowing true mercury.\nGold within water—metal generates water, thus silver is the mother of lead.\nMercury within cinnabar is the Dark Pearl.\nYellow earth restrains water, preventing its flow—\nMetal and water generate one another.\nYet metal overcomes wood; water conquers fire.\nEarth flourishes in all four seasons—\nThe mutual generation from beginning to end,\nThe mutual conquest of the Five Phases,\nThe Three and Five unite to form the supreme medicine.\"",
      "overlap_context": " to subdue mercury, forcing it to withstand fire, and feed it to others, calling it \"dead mercury\" that can preserve life—how grievously they mislead and harm people! Moreover, alum can slay tigers, and saltpeter can corrode copper; if such substances enter mercury and flow into the human abdomen, death is certain—ten thousand will die, ten thousand will perish.\n\nQingxiazi said: \"The Eight Stones, when exposed to fire, all turn to ashes; cinnabar, when immersed in water, transforms into silver.\"",
      "start_char": 1251,
      "end_char": 2476,
      "start_sentence": 58,
      "end_sentence": 126,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.21048378944397,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\指归集.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "五行，水生木，水银也。 木生火，朱砂也。 火生土，神气化生真土也。 土生金，白金也。 金生水，黑水也。 皆非世上银砂土。 芽是铅之子，既得见金华，拾铅还不使。 《丹鉴》日：铅是铅，汞是汞，世上之人总错用。 杨元一曰：求仙觅黄铅，须得真铅华。 黄子日：世上人人学求药，个个元来寻不着也。 道用铅，不用铅，及至用铅时，用铅还是错。 望江南曰：初学道，须是得真铅。 盖明五行之精，然后可以变化无穷，神哉神哉。 五行相生克四 《阴符经》云：观天之道，执天之行，尽矣。 天有五贼，见之者昌。 故青霞子云：汞为青龙，卦主震，藏主肝，束方甲乙木，木生火，火主心，南方丙丁火，卦主离，其形本青，遇火乃赤，故化为朱砂，乃为朱雀，属阳。 阳极则阴生，朱砂中朱汞也。 亦象离卦中二画也。 如日中有金乌，乌者雌也，属阴，为玄武，卦主坎，藏主肾，北方壬癸水。 铅象水坎为阴，阴极则阳生，黑铅中有白金，如坎中一画，亦如月中有兔，兔者雄也，属阳。 金为白虎，卦主兑，藏主肺，西方庚辛金。 金来归性初J水火自销铄也。 色转为黄，黄主脾，脾为中央戊己土。 肝青为木父也，肺白为金母也，肾黑为水子也，脾黄为土君也，五行相推，在乎其中。 凡五行相生，还返相制。 是以金生水，水生木，木生火，火生土，土生金。 而其相制，金克木，木克土，土克水，水克火，火克金。 故汞为金也。 以金伐木，砂为火也。 以火销金，铅为水也。 以水灭火，水既盛，以土镇之。 感以其类，制以其气，大丹成矣。 《金碧经》日：演爻征卦，五行为枢。 坎雄金精，离雌火光。 金火相伐，水土相克。 土旺金乡，三物俱亡。 辐辏以致太平。 淳于叔通日：木性能直，而被金之所伤。 水性能柔，被土之所克。 土壅虽厚，被木之所害。 金性虽坚，被火之所熔。 此五行相克，大道之常也。 曹真人曰：捉得束方龙，配与西方虎。 更将南朱雀，会遇北玄武。 就中最者，须得中央土。 严君平日：一二三四五，金木水火土。 若能明此诀，便是长生路。 张平叔日：二物会时情性合，五行全处虎龙蟠。 盖明五行非土不生，金丹非土不成也。 火候在精详五 青霞子曰：正月至七月申，为七返，十一月至七月，为九还，火初起一阳。 注云：铅汞非七返九还，则不成，纵成亦不灵。 是十一月复，十二月临，正月泰，二月大壮，三月夫，四月乾，五月垢，六月遁，七月否，八月观，九月剥，十月坤，炼药成丹一周，毕二十四气，还丹紫色赤，二气足也，光明，休重不失元斤两，俱为真土，变化无穷。 又日：子、丑、寅为春，卯、辰、巳为夏，此六月纯阳用事，阴求於阳，水浸色也。 牛、未、申为秋，酉、戌、亥为冬，此六月纯阴用事，阳求於阴，水乃凝而结。 金消散而入水，水火之气相煎，合形相搏，往而不定，上下无常，水得火而升，金得火而伏，相须变化，凝结器中，还丹之体，神哉莫测。 《金碧经》日：坤初变成震，三日月出庚。 龙虎自相寻，坤再变化兑。 八日月在丁，上弦金半斤。 坤体变成乾，圆照甲束方。 金水温太阳，赤水流为汞。 汞者弄金铛，月盈因合亏。 十六转将生，乾体缺成巽。 平明月见辛，乾再损成艮。",
      "translated_text": "The Five Phases: water generates wood—this is mercury. Wood generates fire—this is cinnabar. Fire generates earth—this is the true earth transformed by spirit and qi. Earth generates metal—this is white metal. Metal generates water—this is black water. None of these are the silver, cinnabar, or earth of the mundane world.\n\nThe sprout is the child of lead; once the golden flower is seen, gather the lead yet do not employ it. The *Danjian* states: \"Lead is lead, mercury is mercury—people of the world all misuse them.\" Yang Yuanyi said: \"To seek immortality and find the yellow lead, one must obtain the true essence of lead.\" Huangzi said: \"People of the world all study to seek the medicine, yet none truly find it.\"\n\nThe Dao employs lead yet does not employ lead; when it comes to employing lead, to employ lead is still mistaken. *Wangjiangnan* says: \"In the beginning of learning the Dao, one must obtain true lead.\" Only by clarifying the essence of the Five Phases can transformations be boundless—how wondrous, how wondrous!\n\n**The Mutual Generation and Conquest of the Five Phases**\nThe *Yinfu Jing* states: \"Observe the Dao of Heaven, grasp the workings of Heaven—this is perfection. Heaven has five thieves; those who see them prosper.\" Thus, Qingxiazi said: \"Mercury is the Green Dragon, governed by the *Zhen* trigram, stored in the liver, belonging to the east and the *jia-yi* wood. Wood generates fire; fire governs the heart, the south and the *bing-ding* fire, governed by the *Li* trigram. Its form is originally green, but when it meets fire, it turns red—thus it transforms into cinnabar, becoming the Vermilion Bird, belonging to yang. When yang reaches its extreme, yin arises—within cinnabar lies vermilion mercury, which also resembles the two lines within the *Li* trigram. Just as within the sun lies the Golden Crow, and the crow, being female, belongs to yin, it is the Dark Warrior, governed by the *Kan* trigram, stored in the kidneys, belonging to the north and the *ren-gui* water. Lead resembles the *Kan* trigram’s water, being yin; when yin reaches its extreme, yang arises—within black lead lies white metal, like the single line within *Kan*, or like the rabbit within the moon. The rabbit, being male, belongs to yang. Metal is the White Tiger, governed by the *Dui* trigram, stored in the lungs, belonging to the west and the *geng-xin* metal. When metal returns to its nature, water and fire naturally dissolve and melt. Its color turns to yellow, which governs the spleen, the spleen being the central *wu-ji* earth. The liver, green, is the father of wood; the lungs, white, are the mother of metal; the kidneys, black, are the child of water; the spleen, yellow, is the sovereign of earth. The Five Phases mutually propel one another, all residing within them.\n\nIn general, the Five Phases generate one another in return and restrain one another in turn. Thus, metal generates water, water generates wood, wood generates fire, fire generates earth, and earth generates metal. Yet in their restraint: metal conquers wood, wood conquers earth, earth conquers water, water conquers fire, and fire conquers metal. Therefore, mercury is metal. With metal, one fells wood; cinnabar is fire. With fire, one melts metal; lead is water. With water, one extinguishes fire. When water becomes abundant, earth is used to restrain it. Responding to their kind, restraining with their qi—the great elixir is accomplished.\n\nThe *Jinbi Jing* states: \"Evolving the lines and verifying the trigrams, the Five Phases are the pivot. *Kan* is the male essence of metal; *Li* is the female radiance of fire. Metal and fire contend; water and earth conquer. When earth flourishes in the domain of metal, the three substances all perish. Their convergence brings about great peace.\"\n\nChunyu Shutong said: \"The nature of wood is to be upright, yet it is harmed by metal. The nature of water is to be yielding, yet it is conquered by earth. Though earth is thickly heaped, it is harmed by wood. Though metal is firm, it is melted by fire. This mutual conquest of the Five Phases is the constant principle of the great Dao.\"\n\nMaster Cao said: \"Seize the eastern Dragon and pair it with the western Tiger. Then take the southern Vermilion Bird to meet the northern Dark Warrior. Among them, the most essential is the central earth.\"\n\nYan Junping said: \"One, two, three, four, five—metal, wood, water, fire, earth. If one can understand this secret, it is the path to longevity.\"\n\nZhang Pingshu said: \"When the two substances meet, their natures harmonize; where the Five Phases are complete, the Tiger and Dragon coil. For it is clear that without earth, the Five Phases do not generate, and without earth, the golden elixir does not form.\"\n\n**Fire Timing Lies in the Precise Examination of the Five**\nQingxiazi said: \"From the first month to the seventh month in *shen*, it is the Seven Returns. From the eleventh month to the seventh month, it is the Nine Revolutions. The fire begins with the first yang.\" The commentary states: \"Without the Seven Returns and Nine Revolutions of lead and mercury, they will not form; even if formed, they will not be efficacious. This is the *fu* of the eleventh month, the *lin* of the twelfth month, the *tai* of the first month, the *dazhuang* of the second month, the *guai* of the third month, the *qian* of the fourth month, the *gou* of the fifth month, the *dun* of the sixth month, the *pi* of the seventh month, the *guan* of the eighth month, the *bo* of the ninth month, and the *kun* of the tenth month. Refining the medicine into the elixir completes one cycle, encompassing the twenty-four qi. The returned elixir is purple-red, with the two qi fulfilled—radiant, weighty, without loss of its original weight, all transformed into true earth, with boundless transformations.\"\n\nHe also said: \"The *zi*, *chou*, and *yin* months are spring; the *mao*, *chen*, and *si* months are summer—these six months are purely yang in action, with yin seeking yang, and water soaking in color. The *wu*, *wei*, and *shen* months are autumn; the *you*, *xu*, and *hai* months are winter—these six months are purely yin in action, with yang seeking yin, and water congealing and solidifying. Metal disperses and enters water; the qi of water and fire contend, their forms merging and struggling, moving without fixed direction, rising and falling without constancy. Water ascends when it meets fire; metal submits when it meets fire. Mutually requiring transformation, they congeal within the vessel—the body of the returned elixir, wondrous and unfathomable.\"\n\nThe *Jinbi Jing* states: \"When *kun* first transforms into *zhen*, on the third day the moon appears in *geng*. The Dragon and Tiger seek one another; when *kun* transforms again into *dui*, on the eighth day the moon is in *ding*—the upper crescent, half a catty of metal. When the *kun* body transforms into *qian*, it shines round in *jia* of the east. Metal and water warm the Great Yang; red water flows as mercury. Mercury plays in the golden crucible; the moon waxes through union and wanes. At sixteen transformations, life begins; the *qian* body wanes into *xun*. At dawn, the moon appears in *xin*; *qian* is further diminished into *gen*.\"",
      "overlap_context": "the standard.\nRecognizing true lead requires knowing true mercury.\nGold within water—metal generates water, thus silver is the mother of lead.\nMercury within cinnabar is the Dark Pearl.\nYellow earth restrains water, preventing its flow—\nMetal and water generate one another.\nYet metal overcomes wood; water conquers fire.\nEarth flourishes in all four seasons—\nThe mutual generation from beginning to end,\nThe mutual conquest of the Five Phases,\nThe Three and Five unite to form the supreme medicine.\"",
      "start_char": 2477,
      "end_char": 3708,
      "start_sentence": 127,
      "end_sentence": 191,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.136189222335815,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\指归集.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "艮见二十三，下弦水半斤。 月出於丙南，乾三变成坤。 坤乙三十日，束北丧其朋。 月没於乙地，土木金将化，继体生震龙。 《参同契》日：火记六百，为六十日，昼夜之中，四气之节，变化之道，穷矣。 积时成日，积日成月，积月成年，一日十二时中，分之为二。 六时为阳，六时为阴。 中阳四气，火亦如之。 《太古火龙经》曰：明龙者，禀正阳气色，归乎青，孕育火宫，受四千三百三十年真气，故日火龙。 司马微注云：按《金精太素经》云：丹砂禀正阳之气，含至阴之精，自娠化之气，凡四千三百二十年，方成丹体如此。 故复卦火，四千三百二十年，方成大丹。 葛真人云：沐浴火候不注文，须遇至人方口诀。 盖火候丹中最为大要，前后圣人详载文字，非不传也。 至於微妙，不可得而及，故皆在临时。 唯有道之士细意详之耳。 古天地之机，阴阳之理，造化之用，圣人载之於书，纤悉备具，传之后世，将使天下之人皆知至道之归。 而愚迷之徒，颠倒妄执，不信圣人，而谓天下机不容泄漏，遂与至道背驰，虽死不悟。 、此无他，行不合理，故心不通理，不入於道也。 圣人之心，岂外理邪，彼《阴符经》所谓泄漏天机，沉之三劫。 言愚迷之人，窃弄大道，以为非理，非欲道之无传耳。 今夫尧舜文武，周孔之道在六经，谆谆训诲，将使天下之人皆为士君子，而天下之士君子者皆出於是。 至於小人之归，虽读之不晓。 释氏之书褊满天下，种种教化，将使天下之人皆为佛，而天下之佛咸出於是。 至於喜造恶业者，虽诵之不达也。 又况伏羲、神农之书，既传於世，岂固复有隐乎，唯心契於道，行合於理者，见之自然悟理，而得道。 予当披寻丹经，至百十家，言虽不同，而理实一贯。 因取其易见者，编集于前矣。 其引经证歌诵诗，日咸始由甲氏，而传者以为乙，或一言之要，诸家互见者。 且如金丹之术数百，其要在神水华池，本李荃《阴符经》法，而诸家引为经文。 如此之类，只据所闻，未暇推究本末，始载之所，以传其理，而忘其荃蹄耳，其有不合者，多秦汉以来方士伪为之书，学者以理推之，自可见矣。 指归集竟",
      "translated_text": "At the twenty-third appearance, *gen* is seen—half a catty of water in the lower crescent. The moon emerges in the south of *bing*; *qian* transforms thrice into *kun*. On the thirtieth day, *kun* and *yi* lose their companions in the northeast. The moon sets in the land of *yi*; earth, wood, and metal are about to transform, and the succeeding body gives birth to the *zhen* Dragon.\n\nThe *Cantong Qi* states: \"The fire record is six hundred, making sixty days. Within day and night, the four qi’s nodes—such is the Dao of transformation, exhausted.\" Time accumulates into days, days into months, months into years. Within a single day of twelve hours, it is divided in two: six hours for yang, six for yin. The central yang and the four qi—fire follows the same pattern.\n\nThe *Taigu Huolong Jing* says: \"The Bright Dragon, endowed with the true yang qi’s color, returns to green, nurturing the Fire Palace. It receives the true qi of four thousand three hundred and thirty years—hence called the Fire Dragon.\" Sima Wei’s commentary notes: \"According to the *Jinjing Taisu Jing*, cinnabar is endowed with the true yang’s qi and contains the utmost yin’s essence. From its gestational qi, after four thousand three hundred and twenty years, it forms the elixir body thus. Therefore, in the *fu* hexagram, fire requires four thousand three hundred and twenty years to complete the Great Elixir.\"\n\nMaster Ge the Perfected says: \"The fire-timing of bathing is not recorded in texts; one must encounter a realized master to receive the oral transmission. For the fire-timing is the greatest essential in the elixir—though former and later sages have detailed it in writing, it is not that they did not transmit it. As for its subtleties, they cannot be fully grasped, so all depends on the moment. Only those of the Dao’s path examine it with careful intent.\"\n\nThe mechanism of ancient heaven and earth, the principles of yin and yang, the workings of creation—sages have recorded them in books, with every detail complete, transmitting them to later ages to let all under heaven know the return of the supreme Dao. Yet foolish and deluded fools, perverse and obstinate, disbelieve the sages, claiming that the world’s mechanism cannot be revealed. Thus they turn their backs on the supreme Dao, dying without awakening. This is no other reason than that their conduct does not accord with principle, so their minds do not penetrate principle and do not enter the Dao.\n\nThe sages’ minds—do they lie outside principle? That which the *Yinfu Jing* calls \"revealing heaven’s mechanism, sinking it for three kalpas\"—it speaks of deluded fools who toy with the Great Dao, treating it as unreasonable, not that they wish the Dao to have no transmission. Now, the Dao of Yao, Shun, Wen, and Wu, and the teachings of the Zhou and Confucius, lie in the Six Classics. Earnestly they instruct, wishing all under heaven to become scholar-gentlemen, and all scholar-gentlemen indeed emerge from them. As for the return of petty men, though they read them, they do not understand. The books of the Buddha fill the world, with teachings of every kind, wishing all under heaven to become Buddhas, and all Buddhas indeed emerge from them. As for those who delight in creating evil karma, though they recite them, they do not comprehend.\n\nMoreover, the books of Fuxi and Shennong have long been transmitted in the world—how could they still harbor concealment? Only those whose minds are attuned to the Dao and whose conduct accords with principle, upon seeing them, naturally awaken to principle and attain the Dao. I have pored over alchemical classics, over a hundred and ten schools. Though their words differ, their principles are truly one. Thus I have selected the most accessible and compiled them above. The cited scriptures, songs, and poems—some begin with Master Jia, while transmitters attribute them to Yi; or a single essential word appears across various schools.\n\nFor instance, among the hundreds of methods of the golden elixir, the essential lies in the divine water and the Flowery Pond, originally from Li Quan’s *Yinfu Jing* method, yet various schools cite it as scripture. Such cases rely only on what I have heard, without leisure to investigate their origins and beginnings. I record them to transmit their principles, forgetting their fishing weirs and rabbit snares. Where inconsistencies arise, many are books forged by magicians since the Qin and Han. Scholars, by applying principle, will naturally see through them.\n\nThe *Collected Pointers to the Return* is now complete.",
      "overlap_context": "when *kun* transforms again into *dui*, on the eighth day the moon is in *ding*—the upper crescent, half a catty of metal. When the *kun* body transforms into *qian*, it shines round in *jia* of the east. Metal and water warm the Great Yang; red water flows as mercury. Mercury plays in the golden crucible; the moon waxes through union and wanes. At sixteen transformations, life begins; the *qian* body wanes into *xun*. At dawn, the moon appears in *xin*; *qian* is further diminished into *gen*.\"",
      "start_char": 3708,
      "end_char": 4521,
      "start_sentence": 192,
      "end_sentence": 222,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.321365118026733,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\指归集.txt",
        "category": "众术类"
      }
    }
  ]
}