{
  "source_id": "方壶外史",
  "source_file": "chunked_daozang\\方壶外史.json",
  "total_chunks": 34,
  "total_original_chars": 18013,
  "total_translated_chars": 95574,
  "total_translation_time": 485.6995425224304,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\藏外\\方壶外史.txt",
    "category": "藏外"
  },
  "full_translation": "**Preface to *Xuanfu Lun* by Lu Xixing**\n\n*Xuanfu Lun* is a work composed by this student, Lu. Having received the teachings of the nature and destiny from a sagely master, I suddenly found deep resonance within my heart. Thus, I recorded what was transmitted, compiling twenty essays totaling over seven thousand words, entitled *Xuanfu*. \"Xuanfu\" signifies that the profound principles herein are but superficial—far from true mastery.\n\nAs the ages grow distant from the sages, the Great Dao has been lost in transmission. Blind and reckless teachers each peddle their own interpretations, often pilfering semblances of truth to embellish their deceptions. Some, like mendicant chan monks, vie in verbal sparring; others, like monopolistic charlatans, boast of alchemical gold and silver. In the realm of human destiny, they mislead with inner alchemy; in the pursuit of elixirs, they ravage lives with minerals and metals. With learning obscured, the calamities spread endlessly—how pitiable this is!\n\nIn my early years, I, as a scholar, devoted myself to the studies of the Two Teachings (Confucianism and Daoism) for nearly twenty years, yet wandered through forests of thorns and thickets of idle chatter. Though I stumbled repeatedly, I never abandoned my original sincerity, and thus attained this fortunate encounter.\n\nNature is realized through self-awakening, while destiny relies on a master’s transmission. These two sayings, however, still leave room for further discussion. Why? Even those of superior roots and keen faculties must grasp the truth in an instant of instruction. Without receiving the esoteric teachings directly, one who relies solely on personal judgment is like the blind groping without a staff—where can they go? There are three reasons why the Dao remains unheard:\n\nFirst, those who indulge in worldly pleasures, mistaking delusion for the norm, or who cling to emptiness while scorning practicality—these harbor a heart of disbelief.\n\nSecond, those with fleeting admiration, entangled in worldly nets, delaying liberation while making half-hearted efforts—these possess a heart of incomprehension.\n\nThird, those who claim sagely wisdom yet reject good counsel, engaging in grand but hollow discourse, thereby discouraging others—these hold a heart of arrogance.\n\nIf any of these three afflictions exist, the sagely master will not turn their gaze, nor will true friends draw near. Habitual procrastination buries one’s life in ignorance, ending only in death—how lamentable!\n\nFearing this fate, I have labored day and night, never daring to abandon myself. Thus, I cast aside delusive thoughts and immersed myself in the utmost Dao. In moments of quiet cultivation, reflecting on the master’s teachings, I have ventured to record them in these essays, undeterred by taboos or prohibitions. My aim is to reveal the true essence, circulate the correct lineage, and guide people toward the Dao.\n\nSome may say that the ancients wrote books only after attaining the Dao—does your haste to speak not betray impatience? I have heard that the highest path is to establish virtue, and the next is to establish words. When words cannot be withheld, one must speak. I am but the latter. If the Dao advances virtue, then silence may suffice. Yet if virtue remains unfulfilled, how can words be restrained?\n\nWritten on the Double Ninth Festival in the *dingmao* year of the Longqing reign (1567).\n\n**Three Origins Discourse**\nI have heard from my master thus:\n\n“There are three Origins of the elixir, each capable of completing destiny.”\n\nThe Three Origins refer to the Celestial Origin, the Terrestrial Origin, and the Human Origin. The Celestial Origin is called the Divine Elixir. The Divine Elixir is refined with water above and fire below within the chamber of spirit, transforming the formless into form. After nine cycles are complete, it becomes white snow. Refined for three more years, it transforms into a divine talisman. Consuming it, one becomes weightless and ascends—such is the wondrous work of medicinal transformation and spiritual efficacy, a marvel of sages and immortals. Its method is expounded in the Dragon and Tiger of the Yellow Emperor and the Stone Casket of Master Jingyang.\n\nThe Terrestrial Origin is called the Numinous Elixir. The Numinous Elixir transmutes metals and minerals into supreme treasures. This elixir, composed of tangible substances like silver, lead, cinnabar, and mercury, can benefit the world but cannot lighten the body. After nine cycles are complete, its most wondrous essence is used to forge the chamber of spirit, thereby connecting upward to the Celestial Origin. It serves as the vessel and provision for cultivating the Dao, the resource for learners. From ancient times to the present, the highest sages and perfected beings have called this the sacred endeavor. Its method is exceedingly simple: one need only gather precelestial lead, subdue postcelestial mercury, recognize ascent and descent, and discern maturity and tenderness. Yet today’s blind masters, ignorant of this, repeatedly fail, achieving nothing. They do not realize that the way of the Terrestrial Origin is no different from that of the Human Origin. Only those who thoroughly understand yin and yang and deeply grasp the workings of creation may speak of it.\n\nThe Human Origin is called the Great Elixir. The Great Elixir is forged in an external crucible while the medicine is refined within, taking from Kan to fill Li, stealing the mechanism and reversing its use. All the highest immortals and sages of antiquity followed this path. Thus, among the studies of destiny-completion, none is more immediate and essential than the Human Origin.\n\nOf the three Origins of the elixir, the Celestial Origin depends on heaven, earth, and spirits and cannot be assured; the Terrestrial Origin, when its methods are clear and both fortune and intention are aligned, is as easy to grasp as reaching for something at hand; the Human Origin, however, holds the cosmos in one’s palm, gives birth to the myriad transformations within the body, and its mechanism is unfathomable to ghosts and spirits, its calculations beyond the reach of yin and yang.\n\nYet is there a distinction of great and small among them? My master said: “Heaven encompasses earth, and earth bears humanity—thus the distinction of great and small is evident, and this is the hierarchy of the Three Origins.”\n\n**On Inner and Outer Medicines**\nIn the study of the Human Origin, the crucible is forged externally while the medicine is refined internally, giving rise to the distinction between inner and outer medicines. Yet those who discuss outer medicine today often miss its essence, leading the blind with blindness—how lamentable!\n\nThe Dao resides within the body; inner refinement is the true path. Why then forge a crucible externally? Forging the crucible is something the sage does out of necessity. The Old Sage compared it to the use of arms, saying: “Weapons are inauspicious tools; the sage uses them only when unavoidable.”\n\nMoreover, the three supreme medicines—spirit, qi, and essence—are all possessed by us in the precelestial state, undifferentiated and uncarved. Why would one need to refine them? Thus, the uncorrupted child is already a sacred embryo. But once the passions awaken, the undifferentiated body is broken! Once broken, what the body contains daily transforms, and all movement falls into the postcelestial. Postcelestial things belong to yin and cannot endure long; one must borrow precelestial substances of the same kind to replenish them. The precelestial of the same kind is the yang of Qian metal. Refining yin with yang, the form endures. As the *Cantong Qi* says: “To become an immortal through ingestion, seek substances of the same kind. A broken fence is mended with bamboo; a lost chicken is replaced with an egg.” This analogy is most clear.\n\nYet one must also know that the qi of self and other are both divided from the same Supreme Ultimate. Within them, the essence of yin and yang mutually reside in each other’s abodes, and one cannot cultivate alone. The *Book of Changes* says: “The Dao consists of one yin and one yang.” “Like sounds resonate; like qi seek each other.” The *Cantong Qi* says: “Marriage ties the qi together; in the first year, the sprout grows.” The principle of creation is this: following the natural order, it becomes human; reversing it, it becomes elixir. The divine subtlety is spontaneous and cannot be falsified.\n\nRefining the medicine within while forging the crucible without—does this merely mend the body’s deficiencies? Far from it.\n\n**On the Mutual Concealment of Yin and Yang**\nThe *Cantong Qi* says: “Heaven and earth establish their positions, and the *Changes* operate within them.” The *Changes* refer to Li and Kan. The poem *Wuqiong* says: “First take heaven and earth as the crucible; next gather the crow and hare to cook the medicine.” Heaven and earth are the images of yin and yang; the crow and hare are the essence of yin and yang. Li is the sun, which holds yang essence, yet the central line of Li is yin—thus yin is concealed within yang’s abode. Kan is the moon, which holds yin essence, yet the central line of Kan is yang—thus yang is concealed within yin’s abode. The *Cantong Qi* says: “Kan male is the sun; Li female is the moon.” This is what it means.\n\nThus, Qian and Kun are the purity of yin and yang; Kan and Li are the union of yin and yang. In humans, before the passions awaken, one embodies the pure yang of Qian and pure yin of Kun. After they awaken, the bodies of yin and yang unite, and their mutually concealed essences are put to use. The number of lesser yin is eight; men attain it, so at sixteen their essence flows. The number of lesser yang is seven; women attain it, so at fourteen their celestial water arrives. Is this not the meaning of yang possessing yin’s number and yin possessing yang’s number, revealing the principle of mutual concealment?\n\nSome may ask: “At sixteen, a man’s essence flows—his unbroken body is ruptured, but this surely arises from some stimulus. At fourteen, a woman’s celestial water arrives—what stimulus does she receive?”\n\nI reply: Before discussing whether there is stimulus or not, once the qi has arrived, the undifferentiated body is already ruptured. Moreover, beneath the heavy yin of earth’s configuration, a single yang suddenly returns—this is the hexagram of the eleventh month. At this time, what does the heart of Heaven and Earth reveal? Yet the Master sighed over it, was it not because the qi of creative interaction, though not yet suffused, has already set its mechanism in motion?\n\nWhen it is poised between non-movement and movement, movement and non-movement, this is called the *true yi* qi of the precelestial, which serves as the root of creation and the pivot of all things, truly residing therein. Only when signs have coalesced and forms and colors become manifest does it fall into gross substance and belong to the postcelestial.\n\nThus, what I call “rupture” refers to the activation of the qi’s mechanism, not that it must await the suffusion of interaction to be called rupture. Furthermore, when a man’s essence first flows, it does not necessarily begin with gross substance. The qi must arrive first, then transform into water, and then further transform into essence. The qi that arrives first is the precelestial; the qi transforming into water is the water born from the *Heavenly One*. Once the precelestial body is ruptured, the postcelestial function proceeds; once the postcelestial function proceeds, the precelestial true qi becomes ever more concealed.\n\nThe marvel of creation unfolds to this point—who would say otherwise? I invite you to consult your teacher on this matter. *On the Precelestial and Postcelestial*\n\n“Why does the postcelestial function’s activation cause the precelestial true to grow ever more concealed?”\n\nIt is said: “The precelestial true cannot be seen. Whatever is visible belongs to the postcelestial. Now, when we speak of tears, saliva, fluids, essence, qi, blood, and humors—all these are tangible, gross substances, all postcelestial and thus unusable. Even when essence, qi, and spirit are invoked, one fails to recognize that once the postcelestial function is activated, essence, qi, and spirit all manifest in accordance with its operation, thereby falling into the postcelestial. Why? Once the aperture is pierced, whatever is spoken or employed becomes postcelestial, while the precelestial true sinks into concealment, weak and subtle, daily withering until it can no longer govern the body. When old age, sickness, suffering, and death arrive, it is because the postcelestial function is exhausted and the precelestial no longer exists. Thus, if one wishes to preserve the body’s permanence, what recourse remains but the precelestial?”\n\n*On Lead and Mercury*\n\nSomeone asks: “The precelestial qi is called true lead—what is the meaning of this?”\n\nIt is said: “‘True’ is spoken in contrast to the ordinary. The true is formless, while the ordinary has form. If you insist on pursuing this matter, let us speak of its root. When Qian and Kun unite, the bodies of Li and Kan are formed. Once Qian and Kun unite, the undifferentiated body is ruptured. Thus, in the postcelestial trigrams, Qian and Kun are relegated to the most exalted yet useless positions, and Li and Kan take their place. For south and north are the two poles of Heaven and Earth. In the precelestial trigrams, Qian and Kun originally resided there. Now, displaced and unused, they are replaced by Li and Kan, and the postcelestial function proceeds. Li is the sun, shining in the south; Kan is the moon, illuminating the north. Sun and moon exchange their radiance, and the myriad things are born. Though called the postcelestial function, it is in truth the precelestial body that enacts it. Thus, Kan’s true qi transforms into lead—this is the water born from the *Heavenly One*. Li’s true essence transforms into mercury—this is the fire born from *Earthly Two*. Lead and mercury, water and fire, are all named and formed substances in the human realm. To call them *true* lead and mercury is to say they are nameless and formless. Thus, we are compelled to borrow these named and formed substances as metaphors, adding the word *true* to indicate nothing more than yin essence and yang qi. The *Book of Changes* says: ‘Essence and qi become things; essence unites with qi.’ When a person first comes into being, it is entirely the operation of the precelestial. Because they interpenetrate, the male receives essence and, employing essence, transforms; the female receives qi and, employing qi, flourishes. Employing essence, one transforms and thus follows the course to become human; employing qi, one flourishes and thus reverses the course to form the elixir. That the precelestial qi is called true lead carries profound meaning. Using the precelestial’s unperturbed true lead to restrain the postcelestial’s long-accumulated true mercury, their mutual attraction and devotion become like that of husband and wife, mother and child—unwilling to part. All this occurs naturally. Those who do not understand how it comes to be, unless they thoroughly comprehend yin and yang and deeply penetrate the workings of creation, how could they speak of this?”\n\n**On Original Essence, Original Qi, and Original Spirit**\n\n“Original qi is lead, original essence is mercury—what then is original spirit?”\nIt is said: “Original spirit is nature, the master of essence and qi. As it dwells in duality yet remains unfathomable, spiritually pervading yet without fixed form, it is called *shen* (spirit). Thus, when spirit abides, essence congeals; when essence congeals, qi returns; when qi returns, the elixir coalesces. All are functions of the precelestial.\n\nWhat is called *original essence* is not the essence of sexual congress. Essence is stored in *Li* (☲), the true fluid within the heart. What is called *original qi* is not the breath of mouth and nose. Qi is stored in *Kan* (☵), the true qi within the void. What is called *original spirit* is not the spirit of thought and deliberation. Spirit pervades the *Wuji* (Ultimateless), the numinous reality prior to one’s birth from father and mother.\n\nMan is a single *Taiji* (Supreme Polarity). Essence and qi are the yin and yang of the *Taiji*, while spirit is the *Wuji* of the *Taiji*—these are the *original essence*, *original qi*, and *original spirit*.\n\nHow apt is the verse of *Cuixu*:\n*‘This essence is not the dregs of lustful arousal,*\n*But the Jade Emperor’s saliva from his mouth.’*\nThe Jade Emperor is the lord of the heart; the saliva from his mouth is the numinous fluid within the heart.\n\n*‘This qi is not the breath of inhalation and exhalation,*\n*But the mist of primordial simplicity, true and undifferentiated.’*\nThe mist of primordial simplicity is the precelestial true *yi* qi.\n\n*‘This spirit is not the spirit of thought and worry,*\n*But one that stands shoulder to shoulder with the Primordial Sovereign.’*\nThe Primordial Sovereign is the *Yuanshi* (Original Beginning). This is the true of the *Wuji*, penetrating heaven and earth, pervading the cosmos, majestically and uniquely exalted, transcendent and uniquely operative.”\n\n**On the Governance of Spirit**\n\n“How does one know that spirit governs essence and qi?”\n\n“Consider the postnatal aspect of the body. When the spirit is excessively startled, essence scatters and palpitations arise; when the spirit is overly lustful, qi dissipates and impotence follows. Thus, when spirit abides in essence, it is called *jing-shen* (essence-spirit); when spirit abides in qi, it is called *shen-qi* (spirit-qi). Essence and qi, when ruled by spirit, are like ministers who gain honor through their lord. Therefore, for those who cultivate the truth, nothing is more essential than nurturing the spirit. Spirit is nature; when nature is settled, spirit naturally rests; when spirit rests, essence naturally abides; when essence abides, qi naturally arises. Why is this so? When nature is settled, the heart-fire does not flare upward; when fire does not flare, water does not dry up, and thus the essence within the body abides. All the essence in the five viscera and six bowels is water. When the essence within the body abides, the essence in the kidneys may be known. The kidneys are the palace of essence; when essence flourishes in the kidneys, accumulated water generates tides, billowing upward like clouds and mist, steaming the four great elements and irrigating above and below. When I employ the primordial spirit to revolve within it, ascent and descent, advance and retreat, are as if turned in the palm—this is called the *water-fire intermingling to achieve completion*, this is called *postnatal qi attained as if in drunkenness*. Yet this speaks only of the postnatal aspect of our body.\n\nAs for the function of the prenatal, its gathering and union, its shedding of the womb and transformation of spirit, are of the primordial One and not what spirit accomplishes. Therefore, for those who cultivate the truth, nothing is more essential than refining the spirit. Refining the spirit is called *jade-fluid refinement of the self*, the means by which the Great Dao achieves both beginning and end.”\n\n**On Golden Fluid and Jade Fluid**\n\n“The alchemical methods speak of *golden-fluid refinement of form* and *jade-fluid refinement of the self*—what is their purport?”\n\n“Dao is the concurrent cultivation of nature and life, the wondrous union of form and spirit. *Golden-fluid refinement of form* is the completion of life; *jade-fluid refinement of the self* is the completion of nature. What is *jade fluid*? Jade is an analogy for warmth, moistness, integrity, and purity; gold is a term for unyielding hardness and indestructibility. Refining nature means diminishing again and again, eradicating self-interest, striving to be warm, moist, integral, and pure, matching virtue with jade—then the inner refinement of the self is perfected. Once inner refinement is perfected, one may approach the furnace to gather the medicine and perform the work of a moment. When the time arrives and the mechanism stirs, one *takes from Kan to fill Li*, gathers lead to subdue mercury. The single yang line within Kan is the prenatal Qian metal—this is called *golden fluid*. Refining form with it transforms the body into pure yang, rendering the physical frame eternally firm, just as gold is unyielding and indestructible. Thus it is said: *gold refines jade*. This is the concurrent cultivation of nature and life, the wondrous union of form and spirit.\n\nJade refinement is the Way of non-action; gold refinement is the technique of action. From non-action to action, and after action, returning again to non-action—then the principle of nature and life is attained, and the task of sagely cultivation is complete.”\n\n**On Nature and Life**\n\n“What is *xing* (nature)? What is *ming* (life)?”\nIt is said: “*Xing* is the single source of the myriad things; *ming* is what one establishes for oneself. Without *ming*, *xing* cannot manifest; without *xing*, *ming* lacks numinosity. *Xing* governs *ming*, while *ming* carries *xing*. Those who discourse today typically divide *xing* and *ming* into separate schools, unaware that Dao and vessel interpenetrate, being and non-being mutually arise, and emptiness and fullness give birth to one another—these cannot be split into two.\n\nThus, *xing* is spirit, while *ming* is essence and *qi*; *xing* is *Wuji* (Non-Ultimate), while *ming* is *Taiji* (Great Ultimate). Can they be separated? Some claim that Buddhists comprehend *xing*, while Daoists comprehend *ming*. This is not a comprehensive view. The Buddha’s teaching of ‘no-self’ shatters the view of clinging and attachment; the Dao’s discourse on ‘guarding the mother’ venerates the nameless origin. If one does not know *xing*, how can one know *ming*? Once *ming* is known, can *xing* be abandoned?\n\nThus, to discourse on *xing* without sinking into emptiness is to have *ming* within it; to guard the mother and return to simplicity is to have *xing* within it. This is called ‘comprehending *ming* through the ground of *xing*’—it is the wondrous union of form and spirit, the true merging with the Dao.”\n\nSomeone asked: “Your discourse on *xing* and *ming* is already clear and exhaustive. May I ask: what is *xing* in a person? What is its substance? Can it be seen?”\nIt was said: “*Xing* cannot be seen. What enables seeing is *xing* itself. To seek what enables seeing in what cannot be seen is to distance oneself further from *xing*. Why? *Xing* as a thing can be seen without intent, but cannot be sought with intent. Of old, the Old Sage called the Great Simplicity ‘nameless,’ and the Yellow Emperor sought the Dark Pearl in the formless—these metaphors of the ancients carry profound meaning.\n\nLet me speak of what gives rise to a person’s life! The true *Wuji*, the essence of the Two and Five, wondrously conjoin and coalesce. What is called *xing* is the *Wuji*; what is called *ming* is the essence of the Two and Five. When these two wondrously conjoin, a person begins to live. Before their birth, what is called *Wuji* is a primal chaos, a vast undifferentiation—what form, what name? What sound, what thread? What scent, what voice?”\n\nWhen the Two and Five have coalesced and attained the One to become numinous—what thought, what action? What concern, what scheming? This is the original substance of *xing*. Yet once the passions and perceptions arise, the original substance is chiseled away.\n\nMaster Zhang said: “Only after form does there arise the *xing* of *qi* and material disposition. Returning to goodness preserves the *xing* of Heaven and Earth.” What is called passions and perceptions is the *xing* of *qi* and material disposition; what is relinquished of the original substance is the *xing* of Heaven and Earth. Laozi said: “Return to the Unhewn, return to the infant, return to the *Wuji*—” this is the “returning to goodness.” Thus the essential task of cultivating the Dao is nothing prior to refining *xing*. When *xing* is settled and the *qi*-disposition cannot burden it, the original substance appears.\n\nMy teacher’s poem says:\n*“Not deluded, *xing* abides of itself;\nAbiding *xing*, *qi* returns of itself.\nReturning *qi*, the elixir congeals of itself—\nWithin the crucible, Kan and Li are paired.”*\nThis is the postnatal attaining the prenatal and wondrously activating its function—what is called “comprehending *ming* depends on *xing*.”\n\n**On the Disposition of *Xing***\n*“There is only one *xing*—why then the distinction between original *xing* and material *xing*?”*\nIt is said: “Original *xing* is spoken of from the prenatal perspective: pure, tranquil, perfectly luminous, complete in itself. The sage does not add to it, nor does the fool diminish it. Material *xing* is spoken of from the postnatal perspective: born of the self-interest of form and *qi*, it begins to have distinctions of clarity and turbidity, thickness and thinness.\n\nMoreover, the transformations and conjoinings of the Two and Five give rise to the ten thousand differences among beings. Their uneven admixtures originate in the moment of receiving *qi* in the womb. Why? From beginninglessness until today, we have all used passions and desires to distort the original root of *ming*. Chasing circumstances, we generate thoughts; encountering things, we produce emotions—long habituated. In the meantime, the *qi* received may be pure or impure, so the depth of cravings varies, yet all borrow the original *xing* to enact their self-interested agendas.\n\nMaterial *xing* in a person cannot act on its own; what enables its action is always the borrowing of numinosity from the original *xing*—like a haughty servant or a bastard son who borrows the master’s authority to issue commands. Thus it is often compared: *Xing* is like water; falling into the *qi*-disposition, it is like water entering mud and mire. If you cut a channel and let it flow, you see only mud and mire, not the water. Can mud and mire move on their own? It is the water that moves them—but the water is mixed with mud and mire and thus unseen.\n\nIf you settle it for a long time, the clear rises to the top and the turbid sinks to the bottom. Cut a channel and let it flow—nothing but water. This is the power of settling and returning to goodness.”\n\n**On the Chamber of the Spirit**\n\n“Is the original *xing* distinct from the original spirit?”\n“Original *xing* is the original spirit—there is no distinction. Because it is numinously penetrating and unfathomable, wondrously responsive yet without fixed form, it is called *shen* (spirit). That it is called *original* serves to distinguish it from postnatal thoughts and deliberations.”\n\n“Does the spirit in a person also have a dwelling?”\n“As I have heard from the Perfected Master of Purple Clarity, a person has three valleys, which are the hollows of the original spirit and the abode of the numinous *xing*. These hollows are like valleys, hence also called *valley spirit*. When the spirit abides, there is life; when it departs, there is death. By day it engages with things; by night it engages with dreams. The spirit cannot rest in its dwelling.\n\n*The Spiritual Pivot of the Inner Canon* states: ‘The celestial valley holds the original spirit; guard it to preserve your authenticity.’ Within the human body, the upper is called the *Celestial Valley*—this is the *Mud Pill*; the middle is called the *Responsive Valley*—this is the *Crimson Palace*; the lower is called the *Numinous Valley*—this is the *Pass of Origin*. These three valleys are where the spirit resides, and they are called the *Three Fields*.\n\nI have composed a discourse on them:\nThe *Mud Pill* is the original palace where the spirit dwells;\nThe *Crimson Palace* is the bright hall where governance is enacted;\nThe *Numinous Valley* is the secluded chamber for cultivation and refinement.\n\nThus, when the original spirit resides in the *Crimson Palace*, the ears hear, the eyes see, the five senses perform their functions, and the hundred limbs follow its commands. When the original spirit resides in the *Numinous Valley*, vision turns inward, hearing withdraws, spirit and *qi* guard one another, and the *hun* and *po* souls embrace unity.\n\nMaster Yang said: ‘Conceal the heart in the abyss to beautify its numinous root.’ The abyss is the deep, obscure, unfathomable place—this is the *Numinous Valley*, where the spirit is concealed.”\n\n**Discourse on the River Chariot**\n\nWhen the spirit is thus concealed, this is called \"returning to the root.\" Returning to the root is called quiescence; quiescence is called the restoration of life. Then one sees spirit and *qi* guarding one another, embracing unity without separation. When quiescence reaches its utmost and movement arises, this is the spirit. It then rides the mechanism of *qi* and ascends to the *Mud Pill*, at which point the path of the River Chariot begins to open.\n\nIt is essential to know that the route of the River Chariot is none other than the Conception and Governor Vessels before and behind the body. When *qi* first ascends, it wells up gently and steamily, steeping between the two kidneys, vast as the rising tide, fluid as melting ice. Overflowing above the five transport points, it courses like water spilling beyond its channels. I swiftly guide the spirit to revolve and return to the *Weilü*, causing it to ascend along the *Weilü*, pass through the *Jiaji* Double Pass, rise to the *Fengfu*, and reach straight to the *Mud Pill*. When spirit and *qi* meet here, their free flow and fusion are self-evident.\n\nAfter a while, it descends as fresh and sweet fluid, flowing down from the *Double Towers* to the *Crimson Palace*, entering the *Purple Court*, and returning to its concealed abode to rest. Through such circulation and infusion, over time and with mastery, *qi* fills the Three Fields, above and below interpenetrate, and it is said: *\"Always let qi surge through the joints, and naturally essence will be full and the Valley Spirit preserved.\"* At this stage of creation, the signs of internal refinement appear. Yet without profound attainment and true realization, how could one know the savor of my words?\n\n---\n\n**Discourse on Clarifying the Spirit**\n\n\"You have spoken of the dwelling where the spirit is concealed, and I have received your instruction. May I ask about the essence of concealing the spirit?\"\n\n\"It is said: Concealing the spirit is congealing the spirit. The essence of congealing the spirit lies first in clarifying the spirit; the essence of clarifying the spirit lies first in dispelling desires. The *Sutra of Purity* states: *'Dispel desires, and the heart becomes still; clarify the heart, and the spirit becomes clear.'* The *Book of Changes* says: *'The sage uses this to wash the heart and withdraw it into secrecy.'* This 'washing the heart' is precisely what is meant by clarifying the spirit. Master Zhou said: *'Without desires, there is quiescence.'* This 'without desires' is the thorough dispelling of desires.\n\nThe human spirit delights in clarity, yet the heart disturbs it; the human heart delights in stillness, yet desires pull it. Here, 'heart' has two aspects: the heart that disturbs the spirit is the deluded heart; the heart that delights in stillness is the true heart. If there is a deluded heart, it startles the spirit—how can the spirit remain clear? Once the spirit is startled, it clings to the myriad things; once it clings to the myriad things, craving arises; once craving arises, vexation follows; vexation and delusion bring sorrow and suffering to body and mind—how can the heart remain still?\n\nThus, the essence of clarifying the spirit lies first in dispelling desires. To dispel them: inwardly observe the heart, and the heart is no-heart—know that the three hearts cannot be grasped. Outwardly observe the form, and the form is no-form; observe things from afar, and things are no-things—know that the four marks are all forgotten. When these three are awakened to, only emptiness is seen, and the person is empty. When emptiness is empty of emptiness, and that emptiness is also empty, then profound stillness abides—this is the emptiness of dharmas. Thus, the roots and dust are forever stilled, the six desires do not arise, and the heart is still. When the heart is still, the spirit becomes clear, like water without waves, vast and limpid.\n\nMaster Xu Zhenjun’s *Song of the Great Dao* says: *'To keep the spirit within the body from departing, do not leave a single thing in the numinous terrace. When things remain in the heart, the spirit is not clear, dissipating true essence and harming sinews and bones.'* The teaching of dispelling desires and clarifying the spirit awaits the sage of a hundred generations—my words will not change.\"\n\n---\n\n**Discourse on Nurturing the Spirit**\n\n\"Since the spirit is already clarified, what more can be added?\"\n\n\"Nurture it. Nurturing means veiling the spirit’s radiance to prevent its exposure. As a thing, the spirit grows clearer the more it is clarified, and brighter the clearer it becomes. For stillness generates wisdom, and thus numinous light shines forth, illuminating all without obstruction. *Zhuangzi* says: *'In perfect quiescence, there is emanation of heavenly light.'* Yet if it is used without cease, it becomes too exposed and harms one’s original nature. *Zhuangzi* also says: *'The ancients who cultivated the Dao used wisdom to nurture tranquility.'* Wisdom arises, yet it is used to nurture tranquility—this is called using tranquility to nurture wisdom.\n\nThe *Pivot of Sitting in Forgetfulness* states: *'Wisdom unused is true wisdom, appearing foolish; this enriches both stillness and wisdom, a dual beauty without limit.'* The *Dao De Jing* says: *'Profound, it seems uncarved; turbid, it seems murky.'* And again: *'The multitude are bright; I alone seem dull. The common folk are sharp; I alone seem muddled.'* These are all essential principles of nurturing the spirit.\"\n\n---\n\n**Discourse on Congealing the Spirit**\n\n\"Since the spirit is already nurtured, why concern oneself with congealing it?\"\n\n\"It is said: Congealing the spirit is the use within non-use, the study of fulfilling life. The *Cantong Qi* states: *'Manage and nurture the root and stem, congealing the spirit to form the body.'* Moreover, cultivating concentration in the *Li Palace* is the essence of meditation; seeking the mysterious in the *Water Mansion* is the aim of alchemy. Clarifying the spirit is vital, but congealing the spirit is urgent.\n\nThe *Cui Xu Yin* says: *'Long ago, I met my teacher and received the oral transmission: simply congeal the spirit and enter the qi cave.'* This 'qi cave' is none other than the root and stem within us. In my earlier *Discourse on the Spirit Chamber*, this was already made clear and exhaustive. I fear that scholars may know only how to clarify the spirit but not where to congeal it, leaving them without a destination and unable to meet the origin of returning to the root and restoring life. Or they may know how to nurture the spirit but not the method of congealing it, leaving them without a starting point and unable to fathom the subtleties of creation’s ebb and flow. Thus, I set forth what I have heard and compose this discourse.\"\n\nThe congealing of spirit is the essential principle of entering the profound and the foremost tenet of the alchemical tradition. By \"congealing,\" we do not mean a stagnant immobility; rather, it is the spirit entering the qi cave and abiding with it without separation. Laozi said: *\"Carrying your soul and embracing the One, can you never depart from it?\"* The qi cave is that which we receive at the inception of our embryonic qi, formed from the essence and qi of our parents—it is the Supreme Ultimate inherent in each of us. Its names vary: qi sea, Pass of Origin, Spirit Valley, lower field, Heavenly Root, Stem of Life, Returning-Root Aperture, or Gate of Restored Life—yet it is one and the same place.\n\nWhen we dwell in the womb, our breath and qi communicate with our mother. Once the umbilical cord is severed at birth, we establish our own furnace and cauldron, setting up a separate heaven and earth, and with every inhalation and exhalation, the qi invariably returns to its original cavity. Breath is the foundation of our life: if in a single moment the breath fails to come and go, the qi ceases and death ensues. Exhalation is the expansion of qi, the unfolding of yang; inhalation is the contraction of qi, the gathering of yin. One exhalation and one inhalation together are called a single breath. Physicians use this to assess the qi, and rightly so.\n\nZhuangzi said: *\"The breath of the common people is at the throat, while the breath of the perfected person is at the heels.\"* \"At the heels\" means deeply entering the cavity. The common people do not fail to breathe from the heels, but their spirit is not present; though their breath moves in and out, they are unaware of it, as if it were merely at the throat. The perfected person, however, aligns the spirit with the breath, deeply entering the original cavity, continuously abiding without the slightest interruption. Thus, they concentrate the qi to attain suppleness, embrace the One without separation, and in utter emptiness and profound stillness, observe the return.\n\nBy \"alignment,\" we do not mean chasing after the breath but rather abiding with it in a manner of neither forgetting nor forcing. When the spirit aligns with the breath, it congeals; when the spirit congeals, the qi also congeals. When the spirit aligns with the breath, it harmonizes; when the spirit harmonizes, the qi also harmonizes—this is the principle of mutual dependence. The method of congealing the spirit begins with regulating the breath. Regulating the breath means aligning with it.\n\n*Discourse on True Breath*\nBreath is of two kinds: ordinary breath and true breath. Ordinary breath is the qi that enters and exits through the mouth and nose; true breath is embryonic breath, circulating within the original cavity. This is what Master Huiweng described as *\"breathing softly and gently, like a fish in a spring pond.\"* When ordinary breath ceases, true breath moves of its own accord. The cessation of ordinary breath does not come from forcibly suppressing it; rather, in utter emptiness and profound stillness, the heart becomes ever more refined, and the qi ever more subtle.\n\nThose who discuss this today know only how to regulate the breath but fail to recognize the pitfall of chasing the qi with the heart. This is because the restless, competitive heart of the ordinary person has not been trained in regulation. If one suddenly attempts to align with the breath, how can the heart willingly comply? Inevitably, one becomes deliberate. With deliberation, the qi is not yet settled, and the heart is already stirred—is this not the spirit being enslaved by the qi? Therefore, I say: *\"Regulating the breath means naturally aligning with it, not chasing after it.\"* Regulating the breath begins with regulating the heart.\n\nRegulating the heart means gathering the thoughts to return to stillness, maintaining this whether moving, resting, sitting, or lying down, always abiding within the cavity. With long practice, the habit becomes second nature, and one naturally becomes purified and pliable, harmonizing with the breath. In harmony, there is alignment; aligned but not chasing, ordinary breath ceases of itself, and true breath moves spontaneously. The bellows are set in motion, refining essence into qi, which rises and pervades, irrigating the three palaces. This is the true bellows, the true cauldron and furnace, the true firing times.\n\n*Discourse on the Fire Talisman*\n\n“Is there an explanation for taking true breath as fire?”\n\n“There is. The ancient immortals’ words abound, such as:\n*‘Do not idly watch the medicine furnace for firing times—*\n*Simply settle the spirit and breath, letting nature take its course.*\n*Cease your toil at the elixir hearth and river chariot;*\n*The crane’s embryo and tortoise’s breath will flow on of themselves.’*\nYet these do not mean taking breath as fire. Fire is the fire of spirit; breath is but the bellows of that fire.\n\nWhen spirit and qi guard one another, the spirit remains in non-doing, while the qi mechanism cannot but move. Thus, with each closing and opening, it circulates up and down through the meridians. What perceives this movement? The spirit. As the qi flows unimpeded, the primordial spirit alone awakens. Spirit and qi merge, tension and ease harmonizing—this is the evenness of fire’s power, and only then is the elixir completed and the medicine achieved.\n\nI have likened the bellows to true breath, and there is reason in this. When a smith casts metal, he must first pump the bellows, and only then does the fire ignite and the metal begin to melt. If one merely blows with a gusting wind, the fire scatters, and the metal will never transform. Why? The gusting wind comes and goes unpredictably—this is the breath of ordinary men through the throat. The bellows’ wind flows ceaselessly—this is the true person’s breath through the heels. Spirit rests in breath and fuses with it, just as fire is kindled by wind; qi is transformed by spirit, just as metal is refined by fire. Such is the clarity of this analogy!”\n\nOne might ask: “The fire-tally advances and retreats, ‘morning in *tun*, evening in *meng*’—are their principles the same or different?”\n\nI reply: “In the past, before receiving my teacher’s guidance, I privately considered the firing times difficult to discern. I once tried to measure them by the celestial revolution, align them with the hexagrams’ qi, and divide them by watches and clepsydra drops—all to no avail. Only afterward did I suddenly awaken in great clarity. Then I understood that the ten thousand volumes of elixir classics and the six hundred firing records could all be discarded at a single word. The saying that ‘true fire has no timing’ and ‘the great medicine has no fixed weight’ is indeed true—it did not deceive me.\n\nRefining the medicine involves both inner and outer aspects, so the firing times vary in complexity. As for inner refinement, one phrase suffices: ‘Gently, subtly, as if present, yet not.’ The ‘outer medicine’ here does not refer to the outer medicine discussed earlier, but rather to the celestial and terrestrial origins. The ‘tally’ means alignment with the Dao of Heaven. In elixir methods, the cyclical stems of the moon—*geng* and *jia*—symbolize the maturity or tenderness of the medicinal material, while the solar terms of the day—*zi* and *wu*—mark the waxing and waning of the firing times. The phrase ‘morning in *tun*, evening in *meng*’ merely describes the principle of advance and retreat—nothing more. Once the meaning is grasped, the images may be forgotten.\n\nThe *Wuzhen Pian* states:\n‘The inner medicine is like the outer medicine,\nInner and outer must both be penetrated.\nThe elixir head blends in harmonious accord,\nNurtured by twofold workings in warmth.\nWithin, there is the natural true fire,\nThe furnace ever glowing crimson.\nThe outer furnace’s increase and decrease demand diligent effort—\nNothing surpasses the wondrous true seed.’\n\nThe ‘true seed’ is the human origin—this is the final verdict on the fire-tally.”\n\n“Are medicine and fire the same or different?”\n\nIt is said: “Medicine and fire may be distinguished, yet they may also unite. When separated, they differ; when conjoined, they are one. Why? Speaking of them as distinct: medicine is the primordial qi, while fire is the primordial spirit. Speaking of them as united: medicine is fire, and fire is medicine. He who knows only unity and not distinction will fail in gathering and refinement; he who knows only distinction and not unity will lack the method for nurturing and warming. Why? At the time of gathering, medicine resides without while fire abides within—fire draws in medicine, so medicine and fire may be distinguished. During the phase of nurturing, medicine, though initially without, returns within, and with medicine present, fire is set in motion—thus medicine and fire may unite.\n\nIn essence, fire is the master: if fire is too fierce, the elixir is harmed; if fire is too cool, the elixir scatters. When fire alone is mentioned without reference to medicine, it refers to the work of the ten months; when medicine alone is mentioned without reference to fire, it refers to the effort of a brief moment. As the Purple Clarity Immortal Master said: ‘Refining medicine with fire to form the elixir’—this is precisely ‘guiding qi with spirit to attain the Dao,’ a statement of utmost clarity.”\n\n**On Withdrawal and Addition**\n\nSomeone asked: “May I hear the essential meaning of ‘withdrawing lead and adding mercury’?”\n\nIt was said: “I have heard that after Master Liyang obtained the medicine and returned it to the crucible, he nurtured it with the natural true fire, continuous and unceasing as though present. Within it, the transformations of withdrawal and addition all arise naturally, allowing no trace of human artifice or force to intervene.”\n\nFor the Dao is non-action, yet spirit and qi naturally act—such is the marvel of creation. The analogy of cooking rice with grain contains profound meaning, far beyond merely illustrating its simplicity. When lead is added to mercury, it is like water poured into rice. The water must not be excessive, nor the rice too scant, just as the two and the eight must be in perfect balance. When the fire’s intensity is evenly regulated, the water gradually dries while the rice expands—thus rice is made. The gradual drying of water is what is meant by \"withdrawing lead\"; the expansion of rice is what is meant by \"adding mercury.\" Withdrawal is not a reduction from within: spirit enters qi as heaven’s qi moves through earth, its hidden mechanism unseen. Addition is not an increase from without: qi enfolds spirit as earth’s qi receives heaven, gradually nurturing growth. Through this, the embryo is perfected, spirit transforms, and a body arises beyond the body. The marvel of creation reaches this point—all unfolding of itself, with no one knowing how it comes to be. If one seeks to grasp the *how* of withdrawal and addition, one falls into intentionality and loses the natural. This \"natural\" itself holds profound meaning. My master told me: *\"Follow the natural, do not merely heed it.\"* How profound! These words!\n\n\"Legacy Discourse\"\n\nSomeone asked: *\"The various alchemical classics speak of red lead, black mercury, green dragon, white tiger, white snow, yellow sprout, Wood Elder, Metal Mother, infant maiden, and yellow matron—so many names and terms, their number beyond easy enumeration. Yet in your writings, you set all these aside and say nothing of them. Do you intend some unspoken teaching?\"*\n\nI replied: *\"No. Listen quietly, and I shall try to explain. Formerly, I was a scholar of chapters and verses, my learning a mere glimpse into the mystic garden, lacking any prior insight. By chance and karmic encounter, I received the true transmission and came to know the direct and simple path. All the names and terms you mentioned, I once studied thoroughly and savored in detail. Yet grasping one meant losing another, and they only served as obstacles. Only later did I realize that the great Dao is not cumbersome—it can be summed up in a single word.*\n\n*The Dao is nothing beyond the interplay of one yin and one yang. Yin is essence, yang is qi, and spirit governs both. Thus spirit, qi, and essence are the three grades of the supreme medicine. All the terms—dragon and tiger, lead and mercury, and the myriad other names—are based on this. The ancient immortals left such teachings not out of a desire to lightly disclose, but to obscure the gates with tangled words, multiplying paths so that earnest students might penetrate meaning through text and distill the vast into the essential. Only when innate truth has accumulated over time and suddenly becomes clear does one cast off the snares of language and directly perceive the root.\"*\n\nSomeone asked: *\"In your *Mystic Skin*, you discuss the outer medicine extensively, yet say little of gathering, refinement, and union. How are students to proceed?\"*\n\nI replied: *\"Gathering, refinement, and union are the most recondite mysteries of the Supreme, the essential heart-mind transmitted by a thousand sages. I do not refuse to point them out, but my master’s command was strict, and so as I write, I tremble with awe. Yet in what I have already discussed, the key seems already revealed—only veiled in subtle words, unnoticed. As the *Canticle* says: ‘After a thousand cycles, brilliance shines forth; after ten thousand repetitions, it may be seen.’ If earnest students can persist through a thousand cycles and ten thousand repetitions, they will refine their understanding and perceive the wondrous meaning. But without the frustration of seeking without attainment, who would know how rare it is to hear of the Dao? And without the joy of mutual delight in its unfolding, who would find savor in my words? Enough, enough—I shall now fall silent.\"*\n\n**Preface**\n\nThe ancient immortals’ methods of elixir-crafting fill the alchemical canons, numbering no fewer than a thousand scrolls. To read them is to grow ever more entangled and perplexed; to grasp them is to find them utterly simple and effortless. The great essential lies in observing the Dao of Heaven and holding fast to Heaven’s movements—these two suffice to encompass all. The alternation of yin and yang, their pairing as two, is the Dao of Heaven; the revolutions of sun and moon, their radiance intermingling day and night, are Heaven’s movements. As the *Canticle* says: *“Heaven and Earth establish their positions, and the Changes course between them.”* The Changes here refer to *li* and *kan*. The sages, knowing this to be so, modeled their elixir methods accordingly. Thus they took Qian and Kun as the crucible and furnace, the Crow and Hare as the medicinal ingredients. The waxing and waning cycles within—these they took as the fire-phases and the tally of yin.\n\nThe *Scripture* states: *“Sun and moon have their measures, great and small their fixed spans; sagely work arises therein, and numinous clarity emerges.”* To summarize: the entire art lies in stealing the mechanism and reversing its course. This Dao, though near at hand, cannot be exhausted in words nor attained through mere study. Yet if one meets a master and receives the oral transmission, with the affinity of needle and lodestone, then understanding may dawn in an instant. The greatest hindrance is that people lack the nature of wisdom, unable to penetrate and fathom deeply, and so their seeking strays ever farther. Or else they are swayed by specious arguments or ensnared by preconceived notions, such that poison fumes the heart and ink-black delusion seeps into the bones—what can I do for such as these?\n\nI, an empty and humble man, was fortunate to encounter a sagely teacher, who guided me for many years. Relying on a sliver of heaven’s grace that did not obstruct, I suddenly beheld the hall and chamber—realizing that such an encounter in this age is rarer than a thousand ages past. Seekers of the Dao from the four directions, deeming me teachable, have each brought their masters’ transmissions to compare and verify, but what I have heard differs widely, like tenon and mortise ill-fitted. Not that the Dao itself varies, but that each school’s gate and window are distinct. As Laozi said: *“The great Dao is utterly level, yet the people prefer byways.”*\n\nThe Dao of the Golden Elixir is supremely easy, supremely simple. Any contrivance or arrangement strays into falsity and departs from the natural. Thus what I have illustrated here traces the roots to their ultimate origins, directly pointing to the art of destiny, lifting the warp to expound the essentials—its great meaning shining forth. The aim is to remain true to my teacher’s intent, offering critical refutations to expose heterodox schools. If those who love the Dao ponder and attain insight, perhaps they may fulfill their nature and destiny, unconfused by the errors of many divergent paths!\n\nWritten in the last third of the twelfth lunar month of the *gengwu* year, by Qianxuzi at the Western Meditation Hut of Nansha.\n\n**The Diagram of the Primordial Limitless**\nLaozi said:\n\n“There is a thing formlessly formed, born before heaven and earth.\nI know not its name, and so forcefully call it the Dao.”\n\nIt also says:\n“Nameless, it is the beginning of heaven and earth.”\n\nAnd further:\n“The world has a beginning, which serves as the mother of all under heaven.”\n\nThis is the primordial, undifferentiated True Unity qi—the root-source from which heaven and earth, humans and all things are born. Before any impulse of movement arises, it is dark and formless, silent and scentless, called the Limitless. In humans, it corresponds to the state of utter stillness without response, absolute quiescence. The Buddhist notion of *true emptiness*, the Confucian idea of *the state before arousal*—these are none other than what Laozi describes as “constantly without desire to observe its mystery,” what the *Appended Judgments* of the *Book of Changes* calls “the sage thereby cleanses the mind and retreats to concealment in secrecy,” and what the *Sutra of Perfect Enlightenment* terms “taking only the utmost stillness, relying on the power of stillness.” Thus, to permanently sever afflictions and fully realize accomplishment, one need not rise from seated meditation to enter nirvana. The sages of the Three Teachings share a single aim; only their methods differ, hence the distinctions among the three.\n\n**Diagram of the Undivided Supreme Polarity**\nAs the *Wuzhen pian* states:\n“The Dao, from emptiness, gives birth to the One qi,\nAnd from the One qi, yin and yang emerge.”\n\n“Supreme” denotes the state in which yin and yang are embodied yet undivided. Laozi says, “The Dao gives birth to the One.” The One is the Supreme Polarity. In us, it is called the Mysterious Female. The Mysterious Female is the natural union of true essence and wondrous harmony—what is termed “generating being from non-being” and “creating reality within emptiness.” It is the root of spirit and qi, the aperture of nature and destiny. Laozi says, “Ever having desire, one observes its manifestations.” The study of observing manifestations has served as the foundation for the sages and perfected ones of all ages to establish destiny, and from it the sagely work arises, the numinous emerges.\n\n**Diagram of the Supreme Polarity Dividing into Yin and Yang**\nLaozi says, “The Dao gives birth to the One, the One gives birth to the Two.” This is the Supreme Polarity dividing into the Two Modes. Once the Two Modes separate, heaven envelops earth externally while earth resides within heaven, and the wondrous interplay of yin within yang and yang within yin is contained therein. How so? From emptiness, the One qi is born—this is the movement arising from extreme stillness, the yang within yin. The Two Modes divide, heaven enveloping earth externally while earth resides within heaven—this is the stillness contained within movement, the yin within yang. As Master Shao says, “The essence of yin and yang mutually abide in each other’s dwelling.” Thus, in the elixir method, one employs yang within yin and yin within yang, always taking stillness as the foundation. Laozi says, “Heaviness is the root of lightness; stillness is the ruler of restlessness.” For one who can be still, this is called embracing the Origin and guarding the One, thereby returning to the Limitless.\n\n**Diagram of Yin and Yang Mutually Abiding**\nOnce heaven and earth are separated, the sun and moon revolve, their radiance intersecting to generate transformation. The sun and moon are the essence of heaven and earth’s yin and yang. In the hexagrams, they correspond to *Li* and *Kan*. The yin within *Li* is called the Raven’s Essence; the yang within *Kan* is called the Hare’s Marrow. In the elixir method, the Raven and Hare serve as medicinal substances, hence employing yang within yin and yin within yang. This is what is meant by “the east enters the western neighbor, the west returns to the eastern abode”—merely recognizing the essence of mutual abiding, stealing its mechanism, and reversing its use.\n\n**Diagram of Kan and Li in Conjunction**\nThe ancient immortals’ creation of the elixir hinged on gathering the medicine. The medicine has its weights and measures, its gathering has its seasons, and its inversion has its methods. The essentials lie in the moon’s emergence at the first *geng* day, lead’s birth after *gui*, with *zi* south and *wu* north serving as the guiding principles. There are oral instructions not committed to writing.\n\n**Diagram of the Elixir’s Formation**\nAs the *Wuzhen pian* states:\n“Tiger leaps, dragon soars—waves surge roughly,\nAt the central true position, the Mysterious Pearl is born.”\n\nAnd further:\n“Only when the medicine meets its kind does it manifest form;\nThe Dao lies in the subtle and formless, harmonizing with nature.”\n\nKnow that this single point is called neither lead nor mercury but the Elixir—naturally formed from the intersection of sun and moon’s radiance, the harmony of yin and yang qi. The character for “elixir” (*dan*) resembles the sun and moon. The *Xinyin jing* says: “The Elixir is within the body, neither white nor green.” For while the Green Dragon and White Tiger still belong to two families, once they return to the body, they merge into one. Hence it is said to be neither white nor green.\n\nSomeone may ask: “What is the Golden Liquor Returned Elixir?”\nIt is called “returned” because what was lost is regained. It is called “golden liquor” because it is formed by gathering the gold within water, uniting it with one’s own mercury.\n\n**Diagram of the Circulating Fire of the Celestial Cycle**\n\nHere the meaning must be grasped while the image is forgotten;\nTo exhaust the hexagrams is but to labor the mind in vain.\n\n*Diagram of Returning to the Origin*\n\nAt this stage of practice, not a single phrase can be spoken,\nNot a single word can be employed.\n\n*Preface to \"The Orthodox Chapter on the Accomplished Golden Elixir\" by Lu Xixing*\n\nI have surveyed the ten thousand volumes of elixir scriptures, and all speak of the great medicine of longevity as necessarily formed from the primordial True One’s qi. When asked whence this qi arises, they invariably point to \"that place.\" Yet within our own bodies, is there truly no such qi, that we must seek it elsewhere? Those who believe are few, while those who doubt are legion.\n\nFrom my early years, I, Xixing, have been devoted to this Dao, yet my dull roots and foolish nature prevented me from penetrating its essence. At times, I would take up the *Cantong qi* or *Wuzhen pian*, opening their pages to read—only to find the path overgrown with brambles, the way rough and impassable. Later, I studied under the commentator Yu Yan, who pointed me toward the Dao of purity and non-action. All practices involving cultivation outside the body were dismissed as heterodox paths; the golden crucible and fire talismans were all deemed mere metallurgy. Thus, I clung to my first impressions, unshakably fixed. Alas!\n\nIndeed, if it were truly pure and still, why would lesser scholars erupt in laughter, and why would slander arise so readily? Reading these words, I could not help but doubt.\n\nIn the dingwei year of the Jiajing era, by some karmic convergence, I chanced upon the Dharma Patriarch Lü in a thatched hall by the Northern Sea. Our stay together was long and our exchange warm; he offered me the dark elixir and consoled me with kind words. Such a meeting across three lifetimes is a rarity of a thousand years. He then urged me forward with the supreme Dao, beginning with the principle that the union of yin and yang constitutes the Way.\n\nAt the time, I foolishly raised the theories of the Three Peaks to question him, only to be rebuked. Yet he once taught me the songs of embryo formation and the essentials of chamber entry. His subtle words and profound discourses filled volumes, which I recorded and preserved. Though I pondered his teachings, I could not yet grasp them fully. Thus, twenty years passed in hesitation, nearly betraying my teacher’s kindness.\n\nIn the jiazi year, during the twelfth lunar month, I retreated to the wilderness. Gazing into a mirror, I lamented the passage of time—my temples streaked with gray—realizing my aspirations remained unfulfilled and that days were slipping away. Then, moved by a dream in which my late teacher appeared, I cast off old attachments and embraced the present. Suddenly, I awakened, recalling eight or nine out of ten of his past instructions. Cross-referencing them with the *Cantong qi*, the *Wuzhen pian*, and other scriptures, I pored over them again and again. In moments of quiet reflection, my nature and spirit became clear, as if I had gained true insight. Thus, I composed this work.\n\nConfucius said, “Reviewing the old, one gains new understanding.” What I have reviewed is the old, yet what I now understand is new. Though these are but my own tentative interpretations, not yet refined by those of the Dao, they may at least not stray from my teacher’s intent.\n\nWritten on the waning moon of the twelfth lunar month in the jiazi year of the Jiajing era by Qianxuzi.\n\n**Postscript**\nIn the Dao of the Golden Elixir, refining the self comes first.\n\nWhen the self is refined, the spirit settles; when the spirit settles, qi abides; when qi abides, essence congeals. The people find peace, the state grows prosperous, and with a single battle, the world is pacified.\n\nLong ago, my teacher instructed me: *\"If one can cultivate purity for a hundred days, all may become womb immortals.\"* A hundred days of disciplined practice, a moment to obtain the medicine. Ten months of firing, shedding the womb to transform the spirit, altering form to become immortal—how could this not be effortless? Yet in this world, such people are rare. Why is this so?\n\nThose with shallow roots hear the Dao but do not believe; those with scant learning verify the Dao but not truly. Blind teachers mislead, pointing east while calling it west, unable to distinguish Yue from Yan, or blue from white. When occasionally questioned with the *Cantong qi* or *Wuzhen pian*, they fail to analyze them clearly, instead claiming that old words are easily found, but oral secrets are rare—hinting at hidden methods of \"opening the passes and unfolding the apertures,\" or the principles of \"detaching from form to merge with qi.\" Eager students, upon hearing such words, crave swift success and hope for luck. They burn incense, swear oaths to heaven, offer gold to secure their requests. A single phrase enters their ears, lodging deep in their hearts, while the *Cantong qi* and *Wuzhen pian* are left gathering dust on high shelves.\n\nYet the Dao of yin and yang—of resonance between like kinds—when followed, makes one human; when reversed, makes one immortal. All occurs naturally, without artifice. Have you not read the verse in the *Wuzhen pian*: *\"Cease expending cunning and deceit as effort\"*? Or the *Cantong qi*: *\"What is naturally so, not some deviant or false path\"*? The ancient immortals left these words to guide others—when did they ever conceal secrets? Yet they never spoke of \"opening the passes,\" \"unfolding the apertures,\" \"detaching from form,\" or \"merging with qi.\" Now such claims exist—knowing this, one realizes that adding a snake’s legs devalues even a steed’s bones. The peril of the Great Dao lies in such people.\n\nAlas! Fish eyes passed off as pearls, swallow stones as treasures. The world favors petty arts, failing to discern the depth of the Dao. What can be done?\n\nMy teacher once told me: *\"The *Cantong qi* and *Wuzhen pian* are the stairway to entering the Dao.\"* Yet their words are subtle, their meanings profound, not easily dissected. Only after twenty years of deep immersion did I begin to grasp them clearly. And even then, I did not achieve sudden enlightenment through intuition alone—it was through long study and the confirmation of my teacher’s words.\n\nHaving gained some small insight, I dare not keep it to myself. Thus, I compose this work to seek correction from those of the Dao. Yet this is but a broad outline. As for the subtle principles of inner chamber practice, the details of internal and external firing—these are already contained in those two books. How could I presume to add to them? How could I presume to add to them?\n\nWritten again by Qianxuzi. End of the first chapter.\n\nOne asked Master Qianxu: \"The alchemical classics speak of the primordial unity of *qi*, which must be sought among those of the same kind. What does this mean?\"\n\nHe replied: \"I have heard from my teacher that the Way of the Golden Elixir necessarily relies on the union of *yin* and *yang* to take form. *Yin* and *yang*—one male, one female; one *li*, one *kan*; one lead, one mercury—these are the ingredients of the Great Elixir. The true *qi* of *kan* is called lead; the true essence of *li* is called mercury. The primordial essence is stored within me, while the primordial *qi* is drawn from the other. Why is this so? The other is *kan*—externally *yin* yet internally *yang*; in imagery, it is water and the moon, and in humanity, it is woman. I am *li*—externally *yang* yet internally *yin*; in imagery, it is fire and the sun, and in humanity, it is man. Thus, the Way of *yin* and *yang* between man and woman, when followed, gives birth to human life; when reversed, it produces the Elixir. The principle is one and the same.\"\n\nThe questioner said: \"*Kan* is the middle son, and *li* is the middle daughter—this the *Book of Changes* has already made clear. Yet why do you now say that I am instead *li*?\"\n\nHe replied: \"This refers to the arrangement of the *xiantian* (precelestial) diagram.\"\n\nShaozi said: \"The essence of *yin* and *yang* mutually dwell within their abodes.\"\n\nMoreover, the Supreme Ultimate divides into the Two Modes, the Two Modes into the Four Images, and the Four Images into the Eight Trigrams—thus *li* pertains to *qian*, and *kan* pertains to *kun*. *Li* and *kan* are the trigrams formed by the union of *qian* and *kun*; man and woman are the physical forms produced by the union of *yin* and *yang*. Therefore, when *qian* and *kun* unite, *qian* cannot but become hollow and form *li*, while *kun* cannot but become replete and form *kan*. When man and woman unite, *yin* cannot but contain *yang*, and *yang* cannot but root itself in *yin*. Such is the distinction between *kan* and *li* as self and other.\n\nThe questioner said: \"If the center of *li* is *yin*-essence and the center of *kan* is *yang*-*qi*, then within my own body, how can there be no essence and *qi* that I must instead seek from the other?\"\n\nHe replied: \"Indeed, this is so, but the explanation is incomplete. I once drowned in the teachings of the Old Man of Jade Chamber, and only now have I awakened. Pray listen in silence, and I shall attempt to explain.\n\nI have heard from my master: '*Yin* and *yang*, the two fives, wondrously unite and congeal'—thus is a person born. In the beginning, the Great Simplicity remains uncarved, the undifferentiated whole of the Supreme Ultimate. Laozi said: 'One whose virtue is profoundly replete is like a newborn babe.' Unaware of the union of male and female, yet the genitals stir—such is the perfection of essence. Though it cries all day, its throat does not grow hoarse—such is the perfection of harmony. This is the purity of *yin* and *yang*. At this time, the precelestial body remains whole and complete—what need is there to seek, what purpose to replenish? If one attains and cultivates this, what more can be added to the supreme virtue of non-action?\n\nYet when the aperture of desire opens and *yin* and *yang* interact, the precelestial *qi* flees and scatters into *kun*. Thus, the three unbroken lines of pure *qian* break their form and become *li*. *Li* is the sun; when the sun declines, one sighs at advanced age—how can it endure for long? Therefore, the elixir method takes from *kan*. To take from *kan* is to mend the already broken *qian*, to fill its hollowed line, and to restore the body of pure *yang*. This is the teaching of the immortals' returning elixir.\"\n\nHe asked, \"As *li*, I am what is attained only after the scattering and fleeing. Before that scattering, it was originally *kun*—why then is it called *kan*?\"\n\nHe replied, \"Excellent question! In the primordial state of undifferentiated wholeness, that which was originally the body of *kun* experienced the stirring of *yang* at the two-sevens' appointed time. When *yang* suddenly moves within pure *kun*, is this not *kan*? Thus, *kan* is the *yang* within *yin*—the stillness of the Supreme Ultimate reaching its extreme and giving rise to movement, arising spontaneously and naturally. This is called the precelestial. 'Heaven engenders water in the first,' and the true *yi* qi is concealed within *kan*. The mother hides the child in her womb; within water lies metal. To forge the golden elixir, one must draw from *kan*. This is the source of the medicine's river and the ladder for ascending to true realization.\n\nMoreover, the *yang* within *yin* takes movement as its essence, so when drawing from *kan*, one must await its stirring. The *yin* within *yang* takes stillness as its essence, so after filling *li*, one must nurture it through stillness. Those who know movement and stillness and do not miss their proper times—are they not sages? Sages observe the Dao of Heaven and grasp the workings of Heaven. Thus, the waxing and waning of the moon mirror the maturity or tenderness of the medicinal ingredients, while the early and late hours of the sun correspond to the ebb and flow of the firing times. When medicine and fire are harmoniously aligned, the elixir is completed. Once the elixir is complete, one sheds the womb and undergoes spiritual transformation.\"\n\nAnother then asked, \"All that you have discussed pertains to the postcelestial.\"\n\nAs for the prenatal—might there yet be something worth discussing?\"\n\nHe replied, \"I have sought its principles within the *Book of Changes*. The *Changes* states: ‘Essence and qi become things; the wandering soul brings transformation.’ Within *yin*, that which is *yang* is called *qi*; within *yang*, that which is *yin* is called *essence*. These two depend upon each other, and thus things are born. Observing the course of sequential generation, if essence arrives first and *qi* follows after, then *yin* envelops *yang* and a female is formed; if *qi* leads and essence follows, then *yang* envelops *yin* and a male is born. Thus, the distinction between *li* as male and *kan* as female is not determined only after form is complete, but is already predetermined at the moment of receiving *qi*.\n\nMoreover, the Dao of the Golden Elixir is formed through the union of *yin* and *yang*. The human path follows the natural order, while the immortal path reverses the process—extracting the medicine from *kan* and refining the elixir within *li*. What doubt could remain?\"\n\n---\n\nIn the middle section, someone asked, \"Our four great elements and this body are all of *yin*—yet when they move, do they not belong to *yang*?\"\n\nHe replied, \"*Li* is fire, the sun; though its movement belongs to *yang*, it is in truth rooted in *yin*. Thus it is said: fire is *yang* rooted in *yin*. Observe how the radiant light flashes uncontrollably—so too is the *yang* within our bodies. Hence, it is ever prone to reckless dissipation. The sage, knowing this, draws the true *yi* water from *kan* to restrain it. When passions blaze within and essence flees without, it is like fire raging below and water boiling in the cauldron. Drawing that prenatal true *yi* qi to subdue one’s reckless, wayward essence is like ladling spring water into a jar to quell the boiling in the cauldron—nothing is left unaccomplished.\"\n\n\"Then might the method of extracting from *kan* also be discussed?\"\n\nHe said, \"The celestial mechanism is most profound; without the master’s guidance, who would dare speak recklessly? Let me but open the gate—may you come to understand.\n\nIn the *Book of Changes*, thunder lies within the earth, forming the hexagram *Fu* (Return). Within the heavy *yin* of earth, *yang* suddenly stirs—this is the root of creation and the pivot of all things. Confucius, pondering the *Changes* to this point, could not help but sigh: ‘In *Fu*, do we not see the heart of Heaven and Earth?’ The *Cantong Qi* also speaks of this, saying: ‘The *Changes* governs the heart of Heaven; the hexagram *Fu* establishes the beginning.’ It further states: ‘Issue commands in accord with the seasons; do not miss the moment when the lines move.’ This is what it means.\n\nThus, knowing that thunder within the earth forms *Fu*, one knows that *yang* is born from *yin* and that the true *yi* qi is concealed therein. What need is there to say more?\"\n\nOne might further ask: “In the growth of the elixir medicine, the alchemical classics often compare it to the ‘third day emerging from *geng*’—may I hear of this?” I reply: “*Kan* is the moon, and the moon is the Great *Yin*, which receives the sun’s light to generate brightness. On the third day emerging from *geng*, *yang* first sprouts—this is like the hexagram *Fu*. On the eighth day, the first quarter moon arrives, with two *yang* lines ascending; the eastern direction is full and abundant, and the three *yang* lines open into prosperity. The last quarter moon marks the decline of *yang*; the new moon marks its exhaustion. *Bo* (Splitting Apart) and *Fu* (Return) follow one another in endless succession, for an end is always a beginning. Thus, after three days, revival occurs. The workings of creation are just like this. The method of the elixir takes this as its model, using it to gauge the maturity or tenderness of the medicinal ingredients. My teacher instructed me, saying: ‘On the evening of the new moon, the medicine is in the crucible.’ He also said: ‘When snow gleams on the icy pool, and the plum branches bear the new moon in perfect clarity—only then may the medicine begin to grow.’ The celestial mechanism is profoundly subtle, and here it is fully revealed. In the past, I grasped the meaning of his words but could not fully comprehend them. Now, I suddenly understand, and I realize the depth of my teacher’s grace—luminous as the sun and moon held forth to grant me sight.”\n\nOne asks: “As for the maturity or tenderness of the medicinal ingredients, how are they to be used?”\n\n“Gold elixir’s transformation is formed from the primordial True Unity’s qi. This primordial qi is light and pure, formless—yang within yang. Its inception is most subtle, its wonder unfathomable. Thus, one must swiftly gather it at the first stirrings of *gui*-born vitality, using it within the span of a single vigil. Even a slight delay allows dross to arise and shifts it into the postnatal, where yang reverts to yin. The *Wuzhen* poem says, ‘Seen yet unusable’—this speaks of overmaturity; ‘In a flash of fire and smoke, the True Person appears’—this speaks of speed. Alas! The wonder of transformation—who but a sage could know it? Who but a sage could wield it?”\n\nIn the following section, one asks: “The wonder of transformation is such that none but a sage can wield it. We are no sages—if one wishes to employ it, where lies the essential key?”\n\nThe master replies: “Did not your teacher say, ‘True earth seizes true lead; true lead governs true mercury’? What is true earth? It is the self’s earth. Those who gather the medicine yet do not refine their self’s earth will easily lose the numinous mercury, and their efforts will come to naught, bringing only hardship and humiliation. The *Classic* says, ‘Lay the foundation, refine the self’—this is what it means. The self, as a thing, is in man the will, also called the self-nature. Because it roams through the four images without fixed position, it is named ‘earth.’ The gold elixir’s entire process depends upon this. Thus, when refining the medicine to seek lead, one meets it with the self; when drawing fire into the crucible, one escorts it with the self; when simmering and bathing, one guards it with the self; when nurturing and delivering the embryo, one perfects it with the self. Rectify the heart and sincerely align the will, and the body is cultivated, the state governed, and all under heaven made peaceful. This is the pivot of elixir refinement. The *Canticle* says, ‘Turn the grain at the true axle.’ It also says, ‘The pole star abides in correctness.’”\n\n“Ancient immortals left their teachings, earnest and repeated without end.\n\nMoreover, parents give birth to me through passion and desire, thus the nature of temperament ever meets things and generates emotion. If refining the self proves ineffectual, the six roots remain unsettled; at the moment of entering the chamber, when great function appears before one, nature stirs and passion blazes, the maiden of mercury flees—how then can one seize the black dragon’s pearl from beneath its chin in the span of a single talisman?\n\nThe *Tradition* states: ‘To probe the tiger’s den, to pluck the tiger’s whiskers—how could one nearly escape the tiger’s jaws?’ Dangerous! Dangerous indeed! Without great wisdom, this cannot be broken; without great power, this cannot be attained.’\n\nMy master instructed me: ‘The mirror at the entrance lies within your heart. When the heart is not empty, the realm is not true.’\n\nAlas! Is the principle of emptying the heart not the essential point of refining the self?\n\nThe *Sutra of Purity* says:\n‘Look within at the heart—there is no heart;\nLook without at the form—there is no form;\nLook afar at things—there are no things.\nWhen these three are awakened to, only emptiness is seen.\nWhen the emptied is itself empty, even emptiness is no more.’\n\nThis is what emptying the heart means—the great liberation, the great repose of refining the self. Thus the following text continues: ‘Ever still, ever responsive.’\n\nAh! Ever still—this is the verification of refining the self; ever responsive—this is the function of seeking lead!\n\nMy master instructed me: ‘The medicine in the crucible on a moonlit night.’ I was commanded to respond, yet I was at a loss, unable to answer. Then I replied of my own accord: ‘Ashes on the seat of wind and flowers.’”\n\n“Those who linger amid fleeting scenes often prize the four splendors of wind, flowers, snow, and moon. Confronted by circumstances, they give rise to emotions, endlessly occupied in response. Yet my master likens all such things to ashes upon the seat—is this not the state of forgetting the self, forgetting things, and even forgetting the act of forgetting?\n\nThe tally for gathering the medicine and the essentials of refining the self—what my master revealed to me is most profound. I once dimly grasped his words, and now I fully comprehend them.”\n\nUpon hearing this, someone leapt up and exclaimed: “Without your words, I would never have heard the essentials of the great Dao. I beg to stop my ears to you; I shall withdraw to refine myself.”\n\n*Seven Refutations* by Lu Xixing\n*Refutation of the Critique of Non-Refutation*\n\nAfter Lu received the teaching of *xingming* from his sagely master, scholars from all directions came to him to inquire into the Dao. When he sat and spoke with them, if they did not resonate, he would engage in repeated debate.\n\nSome criticized him, saying: “The ancient sages declared: ‘Those who know do not speak; those who speak do not know. Those who are good do not debate; those who debate are not good.’ Now, sir, as you discourse on the Dao with others, your mouth cannot rest—is this not wasteful of words and harmful to virtue?”\n\nLu replied: “I am at fault. Allow me to explain. In former times, Yang and Mo filled the world with their doctrines, obscuring benevolence and righteousness, and Mencius refuted them with words. Gongsun Chou asked: ‘Others all say you delight in debate—may I ask why?’ Mencius replied: ‘How could I delight in debate? I have no choice!’\n\nMoreover, in an age when the great Dao prevails, people do not hold divergent views, and scholars do not pursue divergent teachings. Thus, the sage blends with the world in wordless harmony. Yet if the world cannot fully align with the sage’s intent, the sage grows concerned and is compelled to speak. Texts such as the *Yinfu*, *Daode*, *Cantong*, and *Wuzhen* are all the sage’s authenticated vouchers of the Dao—means to bring boundless benevolence to the world for all generations.\n\nYet there are blind and reckless teachers who, unable to follow the sacred scriptures or comprehend their texts, rely on their own whims to concoct teachings that bewilder the world. Their corruption of human hearts and confusion of the true Dao—what could be more disastrous? It is like a place untouched by the great light, where mountain goblins and wild foxes lure people into valleys. If one witnesses this, one must cry out and drive them away with all one’s strength, lest others fall into delusion and perish unawares. How could one conceal the truth and spare oneself from speaking?\n\nIf, however, you accuse me of self-regard, obstinacy, competitiveness, or delight in debate, then I have long since failed to clear my name before others.”\n\n*Refutation of Falsehoods*\n\nPeople of the world favor petty arts without discerning the depth of the Dao, allowing reckless and deceitful individuals to practice their unscrupulous techniques. Since the profound principles of the mysterious are difficult to fathom, and their hearts lack grounding, they are easily swayed and deceived. Let me briefly outline some of these false arts:\n\nSome roast the fetus of a pregnant woman to practice grain avoidance; some ingest arsenic or sulfur to ward off cold; some wield lead swords to open the passes; some cultivate the “spirit turtle” to extend and retract; some shake their shoulders and spine to produce a rustling sound; some strike their skulls to produce a resonant echo; some sit motionless as stone; some drum their bellies like thunder; some hang upside-down like apes; some curl up like dragons; some spin lightly like the wind while holding their breath; some run swiftly as monkeys, leaving no one able to keep pace. Such practices are too numerous to list, yet they bear no relation to the ultimate Dao. They are merely displays of stubborn skill to embellish cunning—what Master Sima called “cleverly harboring schemes to seek worldly gain.”\n\nAmong these, the false arts of external alchemy and furnace fire are the most egregious. While silver essence can adhere to the body and be exchanged for minerals, methods of summoning and absorption abound in the world. Unaware learners mistake these for transmutation. How mistaken they are!”\n\nAlas, how mistaken! Next are those who engage in acrobatic leaps and dodges, stealing openly before one’s eyes—calling a deer a horse while the master remains unaware, substituting a sheep for an ox without others noticing. Still worse are the blindly burning and reckless refining, squandering fire and wasting wealth, idling away days and months in vain expectation, yet never achieving success. It is not the Way that misleads people, but people who fail to examine the Way.\n\nAlas! Without discerning the depth of the Dao, they claim to love it; without recognizing the authenticity of a teacher, they claim to have met one. Thus, madmen and charlatans boldly take the lead, while earnest seekers prostrate themselves in reverence—what greater shame could there be? For this reason, I have written this discourse. To all my fellow aspirants who cherish the Dao: take heed, take heed! Cease your deluded pursuits early, seek the true essence early—for my whip is not to be had.\n\n**On Shattering Attachments**\n\nConsider the nature of things: fruits and melons, or foods and wines sealed in jars—once their forms are broken or their coverings opened, all decay and cannot endure. The human body, once broken, is no different. The sages, understanding this, sought what is called the *precelestial true unity* to restore it.\n\nYet those who now discourse on the precelestial merely attempt to seal and secure their already broken bodies, to gather and harmonize their fragmented selves, hoping to generate the *true unity* and thereby attain the Way of longevity and enduring vision. They do not realize that once the true form is broken, the essence, qi, and spirit within the body all transform day by day, month by month, descending into the postcelestial. How can the qi of *true unity* remain whole? It is like storing spoiled fruits or wine whose seal has been opened, yet expecting them not to decay—how could this not be difficult?\n\nThis principle is perfectly clear, easily understood by all. Whether drawing from the body near at hand or things far away, few analogies are needed to make it plain.\n\nThe Way of Returning the Elixir is recorded in the alchemical classics, yet scholars fail to read them thoroughly and ponder their meaning deeply. Instead, they grasp at a word or half a phrase, passing it from mouth to ear, and claim it as true transmission and genuine attainment. To the end of their lives, they cling to delusion, practicing with a single substance without ever awakening—how pitiful this is! Moved by compassion for such disciples, I have written this discourse.\n\nThe ancient immortals said: *\"Form is preserved through the Dao, life is prolonged through technique.\"* Nowadays, those who discourse on the Dao are many, but where are the techniques? Let them reflect on this.\n\n**Refuting Heresies**\nThose who expound on similar doctrines today offer divergent theories, all of which I shall address. The \"Nine-One\" method is nothing but heresy and need not be discussed. Then there are the theories of the \"precelestial plum,\" which resemble mere echoes and shadows, or mimic form without substance. Some may sound plausible, yet they all involve tangible dregs and material substances—no different in essence from the worldly \"red lead,\" only varying in name. To regard these as the Dao is, I fear, mistaken.\n\nAs for the doctrines of \"detached-form qi exchange,\" \"dual apertures of the navel and field,\" \"opening the passes and forging the sword,\" \"ascending and descending progressions,\" or those that invert the classics to speak of \"coiled peaches,\" \"holding jujubes to drink sweet dew,\" \"crushing porcelain and smelting iron into wine,\" \"collecting the impure fluids of men and women to brew with yeast,\" or \"blending autumn stone and calling it the primordial human element\"—such practices are manifold. They are all the teachings of heretical masters and crooked scholars, the blind leading the blind. Though they toil from youth to hoary age, they never achieve success, only ruining their virtue, harming their bodies, and becoming objects of ridicule in the world—how lamentable!\n\nMoreover, the qi of the precelestial arises from emptiness and nothingness. It cannot be seen, cannot be heard, cannot be grasped. Those who grope and probe, seeking it through myriad methods, only distance themselves further from it. What then of the \"floating and sinking grains and ounces\"? Where are they now?\n\nFrom what I have heard, truth and falsehood are as distinct as fragrant herbs and foul weeds—they cannot be stored in the same vessel. Laozi said: *\"Only because of their ignorance do they fail to know me.\"* If there were those in the world who truly understood these words, my Dao would not be solitary.\n\n**Refuting Doubts**\nSome may object: *\"The ancients said, ‘A word or half a phrase can penetrate the mysteries—what need is there for the myriad volumes of alchemical classics?’ These words suggest that verbose explanations are of little value. Yet you urge people to read the classics extensively, to thoroughly comprehend yin and yang, and deeply fathom the workings of creation. Is this not a waste of time, using knowledge and perception to obstruct the mind? If I grasp the teacher’s essential instruction, a single phrase can guide me in—why read so much?\"*\n\nI reply: *\"Your words sound reasonable, but you do not know that the Dao has orthodoxy and heterodoxy, and teachers have truth and falsehood. You lack the Dharma-eye—how then will you discern them?\"* To test gold, one must use a touchstone. The alchemical classics are the touchstone of contemporary masters. Without diligent study and deep reflection, merely relying on a word or half a phrase from a teacher to seek the Dao—how few will avoid falling into heretical sects and being misled by strange doctrines!\n\nThere was once a man who wished to travel to the capital. He asked for directions along the way, but each person gave different answers. Fearful, he dared not proceed. One day, in the marketplace, he found a road atlas. Clutching it, he set off, and every detail—where to lodge, where to trade, the order of passes and inns—matched perfectly. Only then did he realize the difference between written records and oral transmission—how vast, like heaven and earth!\n\nThe alchemical classics are the road atlas for entering the Dao. Today, people discard the classics and seek mere phrases from contemporary masters. Is this not like abandoning the atlas and asking passersby for directions, hoping to reach the capital without error?\n\nMoreover, a word or half a phrase as a secret transmission depends on a true teacher. Where do you intend to find such a teacher?\n\n**Refuting Ignorance**\n\nThose who pursue the Dao today mostly invite alchemists to set up furnaces and fires, hoping for transmutation and elixirs to ingest—this they call \"external alchemy.\" Yet they do not realize that such pursuits arise from deluded intentions. Once delusion takes root, deluded companions gather. Thus, cunning impostors seize every gap and flaw, swapping horses for oxen, robbing you face-to-face, yet you remain oblivious. Even if you tried to enumerate their deceits, you could not exhaust them. In my early days, before receiving a true teacher’s guidance, I nearly fell prey to such men. By heaven’s grace, I avoided ruin, and so I write this treatise to leave for later generations.\n\nAs for furnace and fire, do not claim they do not exist—they serve as verification for the golden elixir. The *Cantong Qi* states: \"The work of furnace and fire has true basis. Only when one thoroughly understands yin and yang, deeply penetrates the workings of creation, can the marvelous application be seen.\" For furnace-fire refines qi just as it refines the self. The methods of matching, gathering, warming, and birthing the embryo are all the same. The key lies in recognizing ascent and descent, knowing maturity and tenderness—then the Dao of the elixir may nearly be grasped.\n\nYet those who discuss furnace-fire today know not what lead and mercury truly are, where their weights lie, or where true earth resides. They recklessly combine common cinnabar and mercury, mix in the eight minerals, boil them with various herbs. Some take lead bloom as \"water gold,\" others extract cinnabar’s spirit as \"yellow sulfur,\" still others strip cinnabar’s husk to make \"heavenly sulfur,\" or take *tiangui* to embrace mercury. Some mine tin or ore, toy with the sun’s movements, and call it true lead, true mercury, true earth—claiming the world rarely knows such secrets. A thousand threads, ten thousand strands, all no more than this method. Each follows their own mind, hoards their \"treasure,\" and cunningly sells it, while the world remains unaware. Those who heed them suffer ruinous losses beyond words.\n\nMoreover, the Dao of the golden elixir is treasured by heaven itself. To seek it, one must have external protection and both method and resources in harmony—this is acceptable. But to peddle it to others for gifts and gratitude—what justification is there? To trust a man without detecting his deceit, to employ his methods without examining their principles—is this not folly? To repeat the same mistakes after prior missteps—is this not folly? To neglect cultivating virtue while chasing undeserved fortune—is this not folly?\n\nSuch men exhaust their wealth, leaving wives and children destitute. Even if their schemes fail, they still hope for success. Alas! Those who fall into the immortal elders’ predictions number nine out of ten. How perilous!\n\nThe Way of external elixirs depends on man for its practice, but on heaven for its completion; wisdom for its understanding, and fortune for its coagulation. The secrets lie with the master, clarity with the eye—there is not a hair’s breadth or a moment’s leeway to borrow from another. If one can cultivate virtue in seclusion, bind hearts in silent accord, so that virtue moves heaven and earth and sincerity stirs ghosts and spirits, then when approaching the furnace, one may be assured of no mishaps. Otherwise, even with correct methods and keen insight, how can one withstand demonic trials?\n\nI have personally tested and verified this, and now dare not conceal it. I fear that those who act recklessly out of ignorance will meet with failure and grow disheartened. It is not that the Way betrays man, but that man does not understand the Way. Yet if one can know it without acting, act without employing it, or employ it without selfishness—how much better still!\n\n**Breaking the Spell of Delusion**\nThe Way of the golden elixir prizes true understanding and early cultivation. Thus, the Pure Yang Master said: *\"To begin swift practice is already too late.\"* Yet worldly people, clinging to the saying that *\"one hundred and twenty years may still be reclaimed,\"* in their prime and wealth remain mired in the river of love, entangled in the dusty net of the world, failing to break free. Day and night, they squander nearly all. Only when the sun sets on their path, when all is spent, do they turn to the Way as a last resort. Unaware that time waits for no one, that the hexagram’s count is fulfilled, that medicinal ingredients dwindle, and the foundation of support is gone—even if they meet a master who knows the medicine, the moment of opportunity has already slipped by. With white hair, they achieve nothing, and all that remains is a sigh of emptiness. How pitiable!\n\nThus, Master Purple Yang’s *Awakening to Reality* opens by likening time to a spark struck from stone and life to a floating bubble—his warning is both profound and urgent. Some ask about the *\"one hundred and twenty years\"* in the *Yellow Court*. I say: *\"In the ancient world, people were simple and affairs few; marriages came late.\"*\n\n\"Consider fertile fields whose strength is not yet exhausted—even late planting still yields a harvest. But now the soil is barren and depleted, and cultivation comes too late, so the sprouts fail to flower, and the flowers bear no fruit. No wonder this is so. Moreover, people of ancient and modern times cannot be compared, for the prevailing *qi* of the age makes it so. How then can one judge the people of antiquity by the standards of today?\"",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "玄肤论 陆西星 自序 《玄肤论》者，陆生所述也。 陆生既闻性命之学于圣师，豁然有契于其衷，乃述所传，为论二十篇，总七干余言，名曰《玄肤》。 玄肤者，言玄理肤浅，非精诣也。 去圣愈远，大道失传，狂瞽之师，各售所见。 类皆窃近似以文神奸，故有口禅之衲，兢斗机锋，垄断之夫，纵谈黄白，人元则以闺丹首乱，服食则以金石戕生，学术不明，流祸无极，仁者悯焉！ 始生以文儒究心二氏，垂二十年，错足无虞之林，置身不理之口，屡踬屡奋，独以初诚不退，获兹遭遇也。 夫性由自悟，命假师传。 兹二语者，尚有遗论。 何则？ 自性自度者．虽上根利器，亦须领悟于言下，藉非密旨亲承，徒师心以自用。 犹之瞽不任杖，伥伥何之乎？ 道之不得闻者，其故有三，朵二朵颐世味，以妄为常，虞有耽空，害有之侮者，名曰不信之心； 少知向慕，（上四中口下月）挂俗网，不即解脱，姑置而少持者，名曰不了之心； 具曰子圣，不售善言，高谈雄论，千人自废者，名曰不虚之心。 三者有一焉，圣师不顾也，良友不亲也。 因循积习，没齿无闻，毙而后已，殊可哀也！ 生为此惧，早夜遑遑，不敢自弃。 是以摒去妄心，沉潜至道也。 静养之暇，仰思圣师诲谕之旨，聊复述之篇章，冒犯忌讳，所不敢辞。 要在开示真宗，流通正脉，使人知乡道而已。 或谓古人着书，多道成之后，子急于有言，无乃躁乎？ 吾闻太上立德，其次立言，言之不可已也。 吾为其次者，夫道则进于德矣。 进于德，不言可也。 夫德窃有志焉，而未之逮也。 隆庆元年岁在丁卯重九日。 三元论 愚闻之师曰；",
      "translated_text": "**Preface to *Xuanfu Lun* by Lu Xixing**\n\n*Xuanfu Lun* is a work composed by this student, Lu. Having received the teachings of the nature and destiny from a sagely master, I suddenly found deep resonance within my heart. Thus, I recorded what was transmitted, compiling twenty essays totaling over seven thousand words, entitled *Xuanfu*. \"Xuanfu\" signifies that the profound principles herein are but superficial—far from true mastery.\n\nAs the ages grow distant from the sages, the Great Dao has been lost in transmission. Blind and reckless teachers each peddle their own interpretations, often pilfering semblances of truth to embellish their deceptions. Some, like mendicant chan monks, vie in verbal sparring; others, like monopolistic charlatans, boast of alchemical gold and silver. In the realm of human destiny, they mislead with inner alchemy; in the pursuit of elixirs, they ravage lives with minerals and metals. With learning obscured, the calamities spread endlessly—how pitiable this is!\n\nIn my early years, I, as a scholar, devoted myself to the studies of the Two Teachings (Confucianism and Daoism) for nearly twenty years, yet wandered through forests of thorns and thickets of idle chatter. Though I stumbled repeatedly, I never abandoned my original sincerity, and thus attained this fortunate encounter.\n\nNature is realized through self-awakening, while destiny relies on a master’s transmission. These two sayings, however, still leave room for further discussion. Why? Even those of superior roots and keen faculties must grasp the truth in an instant of instruction. Without receiving the esoteric teachings directly, one who relies solely on personal judgment is like the blind groping without a staff—where can they go? There are three reasons why the Dao remains unheard:\n\nFirst, those who indulge in worldly pleasures, mistaking delusion for the norm, or who cling to emptiness while scorning practicality—these harbor a heart of disbelief.\n\nSecond, those with fleeting admiration, entangled in worldly nets, delaying liberation while making half-hearted efforts—these possess a heart of incomprehension.\n\nThird, those who claim sagely wisdom yet reject good counsel, engaging in grand but hollow discourse, thereby discouraging others—these hold a heart of arrogance.\n\nIf any of these three afflictions exist, the sagely master will not turn their gaze, nor will true friends draw near. Habitual procrastination buries one’s life in ignorance, ending only in death—how lamentable!\n\nFearing this fate, I have labored day and night, never daring to abandon myself. Thus, I cast aside delusive thoughts and immersed myself in the utmost Dao. In moments of quiet cultivation, reflecting on the master’s teachings, I have ventured to record them in these essays, undeterred by taboos or prohibitions. My aim is to reveal the true essence, circulate the correct lineage, and guide people toward the Dao.\n\nSome may say that the ancients wrote books only after attaining the Dao—does your haste to speak not betray impatience? I have heard that the highest path is to establish virtue, and the next is to establish words. When words cannot be withheld, one must speak. I am but the latter. If the Dao advances virtue, then silence may suffice. Yet if virtue remains unfulfilled, how can words be restrained?\n\nWritten on the Double Ninth Festival in the *dingmao* year of the Longqing reign (1567).\n\n**Three Origins Discourse**\nI have heard from my master thus:",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 627,
      "start_sentence": 0,
      "end_sentence": 29,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.307711839675903,
      "metadata": {
        "source_file": "dao\\藏外\\方壶外史.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "“丹有三元，皆可了命。 ”三元者，天元、地无、人元之谓也。 天元谓之神丹。 神丹者，上水下火，炼于神室之中，无质生质，九转数足，而成白雪。 三年加炼，化为神符。 得而饵之，飘然轻举。 乃药化功灵，圣神之奇事也。 其道则轩辕之龙虎，旌阳之石函，言之备矣。 地元谓之灵丹。 灵丹者，点化金石，而成至宝。 其丹乃银铅砂汞有形之物，但可济世，而不可以轻身。 九转数足，用其药之至灵妙者，铸这神室，而以上接乎天元。 乃修道之舟航，学人之资斧也。 古今上圣高真，名为圣事，其法至易至简，不过采先天之铅，伏后天之汞，识浮沉，知老嫩而已。 今之盲师，率多昧此，故千举万败，迄以无成。 不知地元之道，与人元不殊。 必洞晓阴阳，深达造化者，而后可以语此。 人元者，谓之大丹。 大丹者，创鼎于外，炼药于内，取坎填离，盗机逆用之谓也。 古者高仙上圣，莫不由之。 故了命之学，其切近而精实者，莫要于人元。 故丹有三元，系于天地鬼神而不可以必得者，天元也； 法度修明，福意双美，举之而如取如携者，地元也； 宇宙在手，万化生身，鬼神不能测其机，阴阳不能逃其算者，人元也。 然则亦有大小乎？ 曰：“愚闻之师，天包乎地，地载乎人，大小见矣，是三元之品也。 ” 内外药论 夫人元之学，创鼎于外，而炼药于内，于是始有内药外药之分。 而世之言外药考，率多不得其旨，以盲引盲，殊可悼痛！ 夫道在我身，内炼城是矣，而何以创鼎于外？ 创鼎者，圣人不得已焉而为之之事也。 老圣比之用兵。 其言曰：“夫兵者，不祥之器，圣人不得已而用之。 ”且夫上药三品，神与气、精，凡吾所具于先天者，浑沦未凿，何假修炼？ 故童初之子，皆圣胎也。 自夫情窦一开，而浑沦之体破矣！ 浑伦之体既破，则丹吾身之所有者，日改月化，动皆落于后天。 后天之物皆属于阴，其法不能以久存，不得不假夫同类之先天者以补之。 而同类之先天则太阳乾金也。 以阳炼阴，形乃长存。 《契》有之曰：“欲作服食仙，须求同类者。 篱破竹补，覆鸡用卵。 ”如斯而喻，甚明切也。 然又须知彼我之气，同一太极之所分。 其中阴阳之精，互藏其宅，有不可以独修者。 《易》曰：“一阴一阳之谓道。 ”“同声相应，同气相求，”《契》曰：“冠婚气相纽，元年乃芽滋。 ”造化之理，顺则成人，逆则成丹。 神妙自然，不可诬也。 炼药于内，而创鼎于外，岂直补吾身之缺而已哉？ 阴阳互藏论 “《契》曰：‘天地设位，而易行乎其中矣。 ’《易》谓离坎。 《悟其》之诗曰：‘先把乾坤为鼎器，次搏乌免药来烹。 ’乾坤，则阴阳之象也； 乌兔，则阴阳之精也。 离为日，日秉阳精，而离之中画却是阴，是阴藏于阳之宅也； 坎为月，月秉阴精； 而坎之中画却是阳，是阳藏于阴之宅也。 《契》曰； ‘坎男为日，离女为月。 ’盖言此也。 是知乾坤者，阴阳之纯也； 坎离者，阴阳之交也。 其在人也，情窦未凿之先，一乾坤纯阴纯阳之象也； 既凿之后，阴阳之体交，而互藏之精用矣。 少阴之数八，男子得之，故二八而精通； 少阳之数七，女子得之，故二七而天癸至。 岂非阳得阴数，阴得阳数，而互藏之义，斯以见乎”",
      "translated_text": "“There are three Origins of the elixir, each capable of completing destiny.”\n\nThe Three Origins refer to the Celestial Origin, the Terrestrial Origin, and the Human Origin. The Celestial Origin is called the Divine Elixir. The Divine Elixir is refined with water above and fire below within the chamber of spirit, transforming the formless into form. After nine cycles are complete, it becomes white snow. Refined for three more years, it transforms into a divine talisman. Consuming it, one becomes weightless and ascends—such is the wondrous work of medicinal transformation and spiritual efficacy, a marvel of sages and immortals. Its method is expounded in the Dragon and Tiger of the Yellow Emperor and the Stone Casket of Master Jingyang.\n\nThe Terrestrial Origin is called the Numinous Elixir. The Numinous Elixir transmutes metals and minerals into supreme treasures. This elixir, composed of tangible substances like silver, lead, cinnabar, and mercury, can benefit the world but cannot lighten the body. After nine cycles are complete, its most wondrous essence is used to forge the chamber of spirit, thereby connecting upward to the Celestial Origin. It serves as the vessel and provision for cultivating the Dao, the resource for learners. From ancient times to the present, the highest sages and perfected beings have called this the sacred endeavor. Its method is exceedingly simple: one need only gather precelestial lead, subdue postcelestial mercury, recognize ascent and descent, and discern maturity and tenderness. Yet today’s blind masters, ignorant of this, repeatedly fail, achieving nothing. They do not realize that the way of the Terrestrial Origin is no different from that of the Human Origin. Only those who thoroughly understand yin and yang and deeply grasp the workings of creation may speak of it.\n\nThe Human Origin is called the Great Elixir. The Great Elixir is forged in an external crucible while the medicine is refined within, taking from Kan to fill Li, stealing the mechanism and reversing its use. All the highest immortals and sages of antiquity followed this path. Thus, among the studies of destiny-completion, none is more immediate and essential than the Human Origin.\n\nOf the three Origins of the elixir, the Celestial Origin depends on heaven, earth, and spirits and cannot be assured; the Terrestrial Origin, when its methods are clear and both fortune and intention are aligned, is as easy to grasp as reaching for something at hand; the Human Origin, however, holds the cosmos in one’s palm, gives birth to the myriad transformations within the body, and its mechanism is unfathomable to ghosts and spirits, its calculations beyond the reach of yin and yang.\n\nYet is there a distinction of great and small among them? My master said: “Heaven encompasses earth, and earth bears humanity—thus the distinction of great and small is evident, and this is the hierarchy of the Three Origins.”\n\n**On Inner and Outer Medicines**\nIn the study of the Human Origin, the crucible is forged externally while the medicine is refined internally, giving rise to the distinction between inner and outer medicines. Yet those who discuss outer medicine today often miss its essence, leading the blind with blindness—how lamentable!\n\nThe Dao resides within the body; inner refinement is the true path. Why then forge a crucible externally? Forging the crucible is something the sage does out of necessity. The Old Sage compared it to the use of arms, saying: “Weapons are inauspicious tools; the sage uses them only when unavoidable.”\n\nMoreover, the three supreme medicines—spirit, qi, and essence—are all possessed by us in the precelestial state, undifferentiated and uncarved. Why would one need to refine them? Thus, the uncorrupted child is already a sacred embryo. But once the passions awaken, the undifferentiated body is broken! Once broken, what the body contains daily transforms, and all movement falls into the postcelestial. Postcelestial things belong to yin and cannot endure long; one must borrow precelestial substances of the same kind to replenish them. The precelestial of the same kind is the yang of Qian metal. Refining yin with yang, the form endures. As the *Cantong Qi* says: “To become an immortal through ingestion, seek substances of the same kind. A broken fence is mended with bamboo; a lost chicken is replaced with an egg.” This analogy is most clear.\n\nYet one must also know that the qi of self and other are both divided from the same Supreme Ultimate. Within them, the essence of yin and yang mutually reside in each other’s abodes, and one cannot cultivate alone. The *Book of Changes* says: “The Dao consists of one yin and one yang.” “Like sounds resonate; like qi seek each other.” The *Cantong Qi* says: “Marriage ties the qi together; in the first year, the sprout grows.” The principle of creation is this: following the natural order, it becomes human; reversing it, it becomes elixir. The divine subtlety is spontaneous and cannot be falsified.\n\nRefining the medicine within while forging the crucible without—does this merely mend the body’s deficiencies? Far from it.\n\n**On the Mutual Concealment of Yin and Yang**\nThe *Cantong Qi* says: “Heaven and earth establish their positions, and the *Changes* operate within them.” The *Changes* refer to Li and Kan. The poem *Wuqiong* says: “First take heaven and earth as the crucible; next gather the crow and hare to cook the medicine.” Heaven and earth are the images of yin and yang; the crow and hare are the essence of yin and yang. Li is the sun, which holds yang essence, yet the central line of Li is yin—thus yin is concealed within yang’s abode. Kan is the moon, which holds yin essence, yet the central line of Kan is yang—thus yang is concealed within yin’s abode. The *Cantong Qi* says: “Kan male is the sun; Li female is the moon.” This is what it means.\n\nThus, Qian and Kun are the purity of yin and yang; Kan and Li are the union of yin and yang. In humans, before the passions awaken, one embodies the pure yang of Qian and pure yin of Kun. After they awaken, the bodies of yin and yang unite, and their mutually concealed essences are put to use. The number of lesser yin is eight; men attain it, so at sixteen their essence flows. The number of lesser yang is seven; women attain it, so at fourteen their celestial water arrives. Is this not the meaning of yang possessing yin’s number and yin possessing yang’s number, revealing the principle of mutual concealment?",
      "overlap_context": " attaining the Dao—does your haste to speak not betray impatience? I have heard that the highest path is to establish virtue, and the next is to establish words. When words cannot be withheld, one must speak. I am but the latter. If the Dao advances virtue, then silence may suffice. Yet if virtue remains unfulfilled, how can words be restrained?\n\nWritten on the Double Ninth Festival in the *dingmao* year of the Longqing reign (1567).\n\n**Three Origins Discourse**\nI have heard from my master thus:",
      "start_char": 627,
      "end_char": 1842,
      "start_sentence": 30,
      "end_sentence": 99,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.48727321624756,
      "metadata": {
        "source_file": "dao\\藏外\\方壶外史.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "或曰； “男子二八而精通，彼之破体，夫固有所感也。 女子二七而天癸至，何所感耶” 曰； “未论有感无感，但其气既至，则浑沦之体，斯已破矣。 且夫地势重阴之下，而忽有一阳来复，乃十有一月之卦也。 斯时也，天地之心果何所见？ 而夫子叹之，无亦以造化交感之气虽未氤氲，而其机斯已动乎？ 方其不动而动，动而不动之时，是谓先天真乙之气，所以为造化之根底，品汇之枢纽者，实在于是。 迨夫联兆已彰，形色已见，斯则落于滓质，而属之后天。 故吾所谓破者，乃自气机之动者而言之，非谓必待于交感氤氲而后谓之破也。 且男子之精始通也，其始未必先有滓质，必待其气先至，既乃化而为水，又既乃化而为精。 所谓先至之气，即先天也； 气化为水，叩天一所生之水也。 先天之体既破，后天之用遂行； 后天之用既行，先天之真愈隐矣。 造化之妙，发泄至此，谁曰不然，请问之师焉。 ” 先天后天论",
      "translated_text": "Some may ask: “At sixteen, a man’s essence flows—his unbroken body is ruptured, but this surely arises from some stimulus. At fourteen, a woman’s celestial water arrives—what stimulus does she receive?”\n\nI reply: Before discussing whether there is stimulus or not, once the qi has arrived, the undifferentiated body is already ruptured. Moreover, beneath the heavy yin of earth’s configuration, a single yang suddenly returns—this is the hexagram of the eleventh month. At this time, what does the heart of Heaven and Earth reveal? Yet the Master sighed over it, was it not because the qi of creative interaction, though not yet suffused, has already set its mechanism in motion?\n\nWhen it is poised between non-movement and movement, movement and non-movement, this is called the *true yi* qi of the precelestial, which serves as the root of creation and the pivot of all things, truly residing therein. Only when signs have coalesced and forms and colors become manifest does it fall into gross substance and belong to the postcelestial.\n\nThus, what I call “rupture” refers to the activation of the qi’s mechanism, not that it must await the suffusion of interaction to be called rupture. Furthermore, when a man’s essence first flows, it does not necessarily begin with gross substance. The qi must arrive first, then transform into water, and then further transform into essence. The qi that arrives first is the precelestial; the qi transforming into water is the water born from the *Heavenly One*. Once the precelestial body is ruptured, the postcelestial function proceeds; once the postcelestial function proceeds, the precelestial true qi becomes ever more concealed.\n\nThe marvel of creation unfolds to this point—who would say otherwise? I invite you to consult your teacher on this matter. *On the Precelestial and Postcelestial*",
      "overlap_context": "passions awaken, one embodies the pure yang of Qian and pure yin of Kun. After they awaken, the bodies of yin and yang unite, and their mutually concealed essences are put to use. The number of lesser yin is eight; men attain it, so at sixteen their essence flows. The number of lesser yang is seven; women attain it, so at fourteen their celestial water arrives. Is this not the meaning of yang possessing yin’s number and yin possessing yang’s number, revealing the principle of mutual concealment?",
      "start_char": 1843,
      "end_char": 2209,
      "start_sentence": 100,
      "end_sentence": 118,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.020050287246704,
      "metadata": {
        "source_file": "dao\\藏外\\方壶外史.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "“何以后天之用行而先天之真愈隐？ “ 曰：“先天之真不可见。 凡可见者，皆后天也。 今之言涕、唾、津、精、气、血、液者，皆有形滓质之物，俱属后天而不可用，则又以精气神当之。 不知后天之用既行，则精、气与神又皆随用显发，而落于后天。 何者？ 已凿之后，说着用着皆落后天，而先天之真，沉潜沦匿，孱弱微细，日就萧索，而不足以为一身之主，至于老病死苦者，后天之用竭，而先天不存也。 然则欲吾形之永固者，舍先天奚以哉” 铅汞论 或问：“先天之气为真铅，其旨安在？ ” 曰：“真者，对凡而言。 真则无形，而凡则有象也。 必欲竞其说，请言其本。 夫自乾坤交而离坎之体成矣。 乾坤交，则浑沦之体己破。 故后天卦位，退乾坤于至尊无用之地，而以离坎代之。 盖南北者，天地之两极也。 先天卦位，本乾坤所居。 今退而不用，以离坎代之，则后天之用行矣。 离为日，照耀于南； 坎为月，照临于北，日月交光，而万物生焉。 虽曰后天之用，其实则先天之体为之。 故坎之真气，化而为铅，即天一所生之水也：离之真精，化而为汞，即地二所生之火也。 铅汞水火，皆人间有名有相之物，谓之真铅真汞，则不可名不可相也。 故不得已而假有名有相之物以拟之，而加之曰真实，则阴精阳气而已。 《易》曰：‘精气为物，精与气合。 ’而人始生，皆先天之用也。 以其互藏也，故男得其精，而用精者化； 女得其气，而用气者昌。 用精者化，故顺而成人：用气者昌，故逆而成丹。 先天之气为真铅，厥有旨也。 以先天未扰之真铅，制后天久积之真汞，则其相爱相恋，如夫妇子母之不忍离，是皆自然而然。 有不知其所以然者，自非洞晓阴阳，深达造化，乌足以语此哉！ ”",
      "translated_text": "“Why does the postcelestial function’s activation cause the precelestial true to grow ever more concealed?”\n\nIt is said: “The precelestial true cannot be seen. Whatever is visible belongs to the postcelestial. Now, when we speak of tears, saliva, fluids, essence, qi, blood, and humors—all these are tangible, gross substances, all postcelestial and thus unusable. Even when essence, qi, and spirit are invoked, one fails to recognize that once the postcelestial function is activated, essence, qi, and spirit all manifest in accordance with its operation, thereby falling into the postcelestial. Why? Once the aperture is pierced, whatever is spoken or employed becomes postcelestial, while the precelestial true sinks into concealment, weak and subtle, daily withering until it can no longer govern the body. When old age, sickness, suffering, and death arrive, it is because the postcelestial function is exhausted and the precelestial no longer exists. Thus, if one wishes to preserve the body’s permanence, what recourse remains but the precelestial?”\n\n*On Lead and Mercury*\n\nSomeone asks: “The precelestial qi is called true lead—what is the meaning of this?”\n\nIt is said: “‘True’ is spoken in contrast to the ordinary. The true is formless, while the ordinary has form. If you insist on pursuing this matter, let us speak of its root. When Qian and Kun unite, the bodies of Li and Kan are formed. Once Qian and Kun unite, the undifferentiated body is ruptured. Thus, in the postcelestial trigrams, Qian and Kun are relegated to the most exalted yet useless positions, and Li and Kan take their place. For south and north are the two poles of Heaven and Earth. In the precelestial trigrams, Qian and Kun originally resided there. Now, displaced and unused, they are replaced by Li and Kan, and the postcelestial function proceeds. Li is the sun, shining in the south; Kan is the moon, illuminating the north. Sun and moon exchange their radiance, and the myriad things are born. Though called the postcelestial function, it is in truth the precelestial body that enacts it. Thus, Kan’s true qi transforms into lead—this is the water born from the *Heavenly One*. Li’s true essence transforms into mercury—this is the fire born from *Earthly Two*. Lead and mercury, water and fire, are all named and formed substances in the human realm. To call them *true* lead and mercury is to say they are nameless and formless. Thus, we are compelled to borrow these named and formed substances as metaphors, adding the word *true* to indicate nothing more than yin essence and yang qi. The *Book of Changes* says: ‘Essence and qi become things; essence unites with qi.’ When a person first comes into being, it is entirely the operation of the precelestial. Because they interpenetrate, the male receives essence and, employing essence, transforms; the female receives qi and, employing qi, flourishes. Employing essence, one transforms and thus follows the course to become human; employing qi, one flourishes and thus reverses the course to form the elixir. That the precelestial qi is called true lead carries profound meaning. Using the precelestial’s unperturbed true lead to restrain the postcelestial’s long-accumulated true mercury, their mutual attraction and devotion become like that of husband and wife, mother and child—unwilling to part. All this occurs naturally. Those who do not understand how it comes to be, unless they thoroughly comprehend yin and yang and deeply penetrate the workings of creation, how could they speak of this?”",
      "overlap_context": ", and then further transform into essence. The qi that arrives first is the precelestial; the qi transforming into water is the water born from the *Heavenly One*. Once the precelestial body is ruptured, the postcelestial function proceeds; once the postcelestial function proceeds, the precelestial true qi becomes ever more concealed.\n\nThe marvel of creation unfolds to this point—who would say otherwise? I invite you to consult your teacher on this matter. *On the Precelestial and Postcelestial*",
      "start_char": 2210,
      "end_char": 2881,
      "start_sentence": 119,
      "end_sentence": 154,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.430063247680664,
      "metadata": {
        "source_file": "dao\\藏外\\方壶外史.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "元精元气元神论 “元气为铅，元精为汞，元神果何物乎？ ” 曰：“元神为性，精气之主也。 以其两在而不测，灵通而无方，故命之曰神。 故神住则精凝，精凝则气归，气归则丹结。 皆先天之用也。 所谓元精，非交感之精之谓也。 精藏于离，心中之真液也。 所谓元气，非口鼻呼吸之谓也。 气藏于坎，虚无中之真气也。 所谓元神，非思虑之神之谓也。 神通于无极，父母末生以前之灵真也。 夫人，一太极也，精气即太极之阴阳也，神即太极之无极也，是谓元精、元气、元神。 善乎，翠虚之吟曰：‘此精不是文感糟，乃是玉皇口中涎。 ’玉皇，心君也。 口中涎，心中之灵液也。 ‘此气不是呼吸气，乃知却是太素烟。 ’太素烟，先天真乙之气也。 ‘此神不是思虑神．可与元皇相比肩。 ’元皇即元始也。 是谓无极之真，通天地，贯宇宙，巍然而独尊，超然而独运者也。 ” 神统论",
      "translated_text": "**On Original Essence, Original Qi, and Original Spirit**\n\n“Original qi is lead, original essence is mercury—what then is original spirit?”\nIt is said: “Original spirit is nature, the master of essence and qi. As it dwells in duality yet remains unfathomable, spiritually pervading yet without fixed form, it is called *shen* (spirit). Thus, when spirit abides, essence congeals; when essence congeals, qi returns; when qi returns, the elixir coalesces. All are functions of the precelestial.\n\nWhat is called *original essence* is not the essence of sexual congress. Essence is stored in *Li* (☲), the true fluid within the heart. What is called *original qi* is not the breath of mouth and nose. Qi is stored in *Kan* (☵), the true qi within the void. What is called *original spirit* is not the spirit of thought and deliberation. Spirit pervades the *Wuji* (Ultimateless), the numinous reality prior to one’s birth from father and mother.\n\nMan is a single *Taiji* (Supreme Polarity). Essence and qi are the yin and yang of the *Taiji*, while spirit is the *Wuji* of the *Taiji*—these are the *original essence*, *original qi*, and *original spirit*.\n\nHow apt is the verse of *Cuixu*:\n*‘This essence is not the dregs of lustful arousal,*\n*But the Jade Emperor’s saliva from his mouth.’*\nThe Jade Emperor is the lord of the heart; the saliva from his mouth is the numinous fluid within the heart.\n\n*‘This qi is not the breath of inhalation and exhalation,*\n*But the mist of primordial simplicity, true and undifferentiated.’*\nThe mist of primordial simplicity is the precelestial true *yi* qi.\n\n*‘This spirit is not the spirit of thought and worry,*\n*But one that stands shoulder to shoulder with the Primordial Sovereign.’*\nThe Primordial Sovereign is the *Yuanshi* (Original Beginning). This is the true of the *Wuji*, penetrating heaven and earth, pervading the cosmos, majestically and uniquely exalted, transcendent and uniquely operative.”\n\n**On the Governance of Spirit**",
      "overlap_context": " elixir. That the precelestial qi is called true lead carries profound meaning. Using the precelestial’s unperturbed true lead to restrain the postcelestial’s long-accumulated true mercury, their mutual attraction and devotion become like that of husband and wife, mother and child—unwilling to part. All this occurs naturally. Those who do not understand how it comes to be, unless they thoroughly comprehend yin and yang and deeply penetrate the workings of creation, how could they speak of this?”",
      "start_char": 2882,
      "end_char": 3234,
      "start_sentence": 155,
      "end_sentence": 178,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.729896783828735,
      "metadata": {
        "source_file": "dao\\藏外\\方壶外史.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "“何以知神之统精气乎？ ” “即举一身之后天者言之。 神太惊即精散而怔忡，神太淫则气脱而痿缩。 故神藏于精，则谓之曰精神； 神藏于气，则谓之曰神气。 精气之得神而王，犹臣之得君而尊也。 故修真之士，莫要于养神。 神即性也，性定则神自安，神安则精自住，精住则气自生。 何以故？ 性定则心火不至上炎，火不炎则水不干，故身中之精亦住。 凡身中五脏六腑之精皆水也。 身中之精既住，则肾中之精可知。 肾为精府，精盛于肾者，积水生潮，滃然上腾，如云雾然，熏蒸四大，灌注上下。 吾以元神斡运乎其间，则升降进止，如运诸掌，是谓水火交而成既济也，是谓后天之气而得之似醉也。 然此特自吾身之后天者言之耳。 若夫先天之用，其采取交媾，脱胎神化，元一而非神之所为。 故修真之士莫要于炼神。 炼神者，玉液炼已之谓也，大道之所以成始而成终者也。 ” 金液玉液论 “丹法有金液炼形，玉液炼己之说，其旨安在？ ” 曰：“夫道者，性命兼修，形神惧妙者也。 金液炼形者，了命之谓也。 玉液炼己者，了性之谓也。 何谓玉液？ 玉者，温润贞纯之喻。 金者，坚刚不坏之称。 夫炼性者，损之又损，克去己私，务使温润贞纯，与玉比德，则己之内炼熟矣。 内炼既熟．然后可以临炉采药，而行一时半刻之功。 及夫时至机动，则取坎填离，采铅伏汞。 而坎中一画之阳，乃先天乾金也，谓之金液。 以之炼形，则体化纯阳，而形骸为之永固，一如金之坚刚而不坏矣。 故曰金炼玉炼。 性命兼修，而形神俱妙者也。 玉炼，则无为之道也； 金炼，则有为之术也。 自无为而有为，有为之后，而复返于无为，则性命之理得，而圣修之能事毕矣。 ” 性命论",
      "translated_text": "“How does one know that spirit governs essence and qi?”\n\n“Consider the postnatal aspect of the body. When the spirit is excessively startled, essence scatters and palpitations arise; when the spirit is overly lustful, qi dissipates and impotence follows. Thus, when spirit abides in essence, it is called *jing-shen* (essence-spirit); when spirit abides in qi, it is called *shen-qi* (spirit-qi). Essence and qi, when ruled by spirit, are like ministers who gain honor through their lord. Therefore, for those who cultivate the truth, nothing is more essential than nurturing the spirit. Spirit is nature; when nature is settled, spirit naturally rests; when spirit rests, essence naturally abides; when essence abides, qi naturally arises. Why is this so? When nature is settled, the heart-fire does not flare upward; when fire does not flare, water does not dry up, and thus the essence within the body abides. All the essence in the five viscera and six bowels is water. When the essence within the body abides, the essence in the kidneys may be known. The kidneys are the palace of essence; when essence flourishes in the kidneys, accumulated water generates tides, billowing upward like clouds and mist, steaming the four great elements and irrigating above and below. When I employ the primordial spirit to revolve within it, ascent and descent, advance and retreat, are as if turned in the palm—this is called the *water-fire intermingling to achieve completion*, this is called *postnatal qi attained as if in drunkenness*. Yet this speaks only of the postnatal aspect of our body.\n\nAs for the function of the prenatal, its gathering and union, its shedding of the womb and transformation of spirit, are of the primordial One and not what spirit accomplishes. Therefore, for those who cultivate the truth, nothing is more essential than refining the spirit. Refining the spirit is called *jade-fluid refinement of the self*, the means by which the Great Dao achieves both beginning and end.”\n\n**On Golden Fluid and Jade Fluid**\n\n“The alchemical methods speak of *golden-fluid refinement of form* and *jade-fluid refinement of the self*—what is their purport?”\n\n“Dao is the concurrent cultivation of nature and life, the wondrous union of form and spirit. *Golden-fluid refinement of form* is the completion of life; *jade-fluid refinement of the self* is the completion of nature. What is *jade fluid*? Jade is an analogy for warmth, moistness, integrity, and purity; gold is a term for unyielding hardness and indestructibility. Refining nature means diminishing again and again, eradicating self-interest, striving to be warm, moist, integral, and pure, matching virtue with jade—then the inner refinement of the self is perfected. Once inner refinement is perfected, one may approach the furnace to gather the medicine and perform the work of a moment. When the time arrives and the mechanism stirs, one *takes from Kan to fill Li*, gathers lead to subdue mercury. The single yang line within Kan is the prenatal Qian metal—this is called *golden fluid*. Refining form with it transforms the body into pure yang, rendering the physical frame eternally firm, just as gold is unyielding and indestructible. Thus it is said: *gold refines jade*. This is the concurrent cultivation of nature and life, the wondrous union of form and spirit.\n\nJade refinement is the Way of non-action; gold refinement is the technique of action. From non-action to action, and after action, returning again to non-action—then the principle of nature and life is attained, and the task of sagely cultivation is complete.”\n\n**On Nature and Life**",
      "overlap_context": "ordial simplicity, true and undifferentiated.’*\nThe mist of primordial simplicity is the precelestial true *yi* qi.\n\n*‘This spirit is not the spirit of thought and worry,*\n*But one that stands shoulder to shoulder with the Primordial Sovereign.’*\nThe Primordial Sovereign is the *Yuanshi* (Original Beginning). This is the true of the *Wuji*, penetrating heaven and earth, pervading the cosmos, majestically and uniquely exalted, transcendent and uniquely operative.”\n\n**On the Governance of Spirit**",
      "start_char": 3235,
      "end_char": 3895,
      "start_sentence": 179,
      "end_sentence": 219,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.440574884414673,
      "metadata": {
        "source_file": "dao\\藏外\\方壶外史.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "“何谓性？ 何谓命？ ” 曰：“性者，万物一源； 命者，己所自立。 性非命弗彰，命非性弗灵。 性命所主也，命性所乘也。 今之论者，类以性命分宗，而不知道器相乘，有无相因，虚实相生，有不可歧而二者。 故性则神也，命则精与气也； 性则无极也，命则太极也。 可相离乎？ 或言释氏了性，道家了命。 非通论也。 夫佛无我相，破贪着之见也； 道言守母，贵无名之始也。 不知性安知命耶？ 既知命矣，性可遗耶？ 故论性而不沦于空，命在其中矣； 守母而复归于朴，性在其中矣。 是谓了命关于性地，是谓形神俱妙与道合真也”。 或问：“子之论性命则既明且尽矣。 敢问性之在人，果何物也？ 可得而见乎？ ” 曰：“性不可见，所以见则性也，于不可见而欲求其所以见，则性愈远矣。 何耶？ 性之为物也，可以无心见，而不可以有心求。 昔者老圣称太朴以无名，黄帝索玄珠于罔象，古人之喻厥有深旨。 请言人之所以生也！ 无极之真，二五之精，妙合而凝。 所谓性即无极也，所谓命即二五之精也。 二者妙合，而人始生焉。 方其末生之前，则所谓无极者，混沌鸿蒙，何相何名？ 何音何绪？ 何臭何声？",
      "translated_text": "“What is *xing* (nature)? What is *ming* (life)?”\nIt is said: “*Xing* is the single source of the myriad things; *ming* is what one establishes for oneself. Without *ming*, *xing* cannot manifest; without *xing*, *ming* lacks numinosity. *Xing* governs *ming*, while *ming* carries *xing*. Those who discourse today typically divide *xing* and *ming* into separate schools, unaware that Dao and vessel interpenetrate, being and non-being mutually arise, and emptiness and fullness give birth to one another—these cannot be split into two.\n\nThus, *xing* is spirit, while *ming* is essence and *qi*; *xing* is *Wuji* (Non-Ultimate), while *ming* is *Taiji* (Great Ultimate). Can they be separated? Some claim that Buddhists comprehend *xing*, while Daoists comprehend *ming*. This is not a comprehensive view. The Buddha’s teaching of ‘no-self’ shatters the view of clinging and attachment; the Dao’s discourse on ‘guarding the mother’ venerates the nameless origin. If one does not know *xing*, how can one know *ming*? Once *ming* is known, can *xing* be abandoned?\n\nThus, to discourse on *xing* without sinking into emptiness is to have *ming* within it; to guard the mother and return to simplicity is to have *xing* within it. This is called ‘comprehending *ming* through the ground of *xing*’—it is the wondrous union of form and spirit, the true merging with the Dao.”\n\nSomeone asked: “Your discourse on *xing* and *ming* is already clear and exhaustive. May I ask: what is *xing* in a person? What is its substance? Can it be seen?”\nIt was said: “*Xing* cannot be seen. What enables seeing is *xing* itself. To seek what enables seeing in what cannot be seen is to distance oneself further from *xing*. Why? *Xing* as a thing can be seen without intent, but cannot be sought with intent. Of old, the Old Sage called the Great Simplicity ‘nameless,’ and the Yellow Emperor sought the Dark Pearl in the formless—these metaphors of the ancients carry profound meaning.\n\nLet me speak of what gives rise to a person’s life! The true *Wuji*, the essence of the Two and Five, wondrously conjoin and coalesce. What is called *xing* is the *Wuji*; what is called *ming* is the essence of the Two and Five. When these two wondrously conjoin, a person begins to live. Before their birth, what is called *Wuji* is a primal chaos, a vast undifferentiation—what form, what name? What sound, what thread? What scent, what voice?”",
      "overlap_context": " the physical frame eternally firm, just as gold is unyielding and indestructible. Thus it is said: *gold refines jade*. This is the concurrent cultivation of nature and life, the wondrous union of form and spirit.\n\nJade refinement is the Way of non-action; gold refinement is the technique of action. From non-action to action, and after action, returning again to non-action—then the principle of nature and life is attained, and the task of sagely cultivation is complete.”\n\n**On Nature and Life**",
      "start_char": 3896,
      "end_char": 4349,
      "start_sentence": 220,
      "end_sentence": 254,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.31446647644043,
      "metadata": {
        "source_file": "dao\\藏外\\方壶外史.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "及乎二五既凝，得一以灵，何思何为？ 何虑何营？ 是性之本体也，夫自情识开而本体凿矣。 张子曰：‘形而后有气质之性。 善反之则天地之性存焉。 ’所谓情识，即气质之性也。 所捐本体，即天地之性也。 者子曰：‘复归于朴，复归于婴儿，复归于无极。 ’即善反也。 故修道之要，莫先于炼性。 性定而气质安不足以累之，则本体见矣。 吾师之诗曰：‘不迷性自住，性住气自回。 气回丹自结，壶中配坎离。 ’是后天得先天而妙其用也。 是之谓了命关于性也。 ” 质性论 “夫性一而已。 何以有本性质性之异？ ” 曰：“本性者，自先天而言之。 清净圆明，混成具足。 圣不加丰，愚不少啬者也。 质性者，自后天而言之。 生于形气之私，于是始有清浊厚薄之异。 且夫二五变合，生人物之万殊，其问揉杂不齐，本于胎元受气之始。 何者？ 吾自无始以来至于今日，皆以情欲而正命本。 逐境起念，遇物生情，熏习久矣。 中间得气有纯驳，故嗜欲有浅深，莫不各借本然之性，以行其有我之私。 盖质性在人，非能自用。 所以用者，皆借灵于本性。 如豪奴孽子，借主人以号令也。 故常喻之。 性则水也，落于气质，犹水之入于泥淖中也。 决而行之，但见泥淖而不见其水。 泥淖岂能自行？ 水行之也。 但水混于泥淖而不见耳。 澄之之久，则清者在上，浊者在下。 决而行之，无非水矣。 此澄湛之功，善反之力也。 ” 神室论",
      "translated_text": "When the Two and Five have coalesced and attained the One to become numinous—what thought, what action? What concern, what scheming? This is the original substance of *xing*. Yet once the passions and perceptions arise, the original substance is chiseled away.\n\nMaster Zhang said: “Only after form does there arise the *xing* of *qi* and material disposition. Returning to goodness preserves the *xing* of Heaven and Earth.” What is called passions and perceptions is the *xing* of *qi* and material disposition; what is relinquished of the original substance is the *xing* of Heaven and Earth. Laozi said: “Return to the Unhewn, return to the infant, return to the *Wuji*—” this is the “returning to goodness.” Thus the essential task of cultivating the Dao is nothing prior to refining *xing*. When *xing* is settled and the *qi*-disposition cannot burden it, the original substance appears.\n\nMy teacher’s poem says:\n*“Not deluded, *xing* abides of itself;\nAbiding *xing*, *qi* returns of itself.\nReturning *qi*, the elixir congeals of itself—\nWithin the crucible, Kan and Li are paired.”*\nThis is the postnatal attaining the prenatal and wondrously activating its function—what is called “comprehending *ming* depends on *xing*.”\n\n**On the Disposition of *Xing***\n*“There is only one *xing*—why then the distinction between original *xing* and material *xing*?”*\nIt is said: “Original *xing* is spoken of from the prenatal perspective: pure, tranquil, perfectly luminous, complete in itself. The sage does not add to it, nor does the fool diminish it. Material *xing* is spoken of from the postnatal perspective: born of the self-interest of form and *qi*, it begins to have distinctions of clarity and turbidity, thickness and thinness.\n\nMoreover, the transformations and conjoinings of the Two and Five give rise to the ten thousand differences among beings. Their uneven admixtures originate in the moment of receiving *qi* in the womb. Why? From beginninglessness until today, we have all used passions and desires to distort the original root of *ming*. Chasing circumstances, we generate thoughts; encountering things, we produce emotions—long habituated. In the meantime, the *qi* received may be pure or impure, so the depth of cravings varies, yet all borrow the original *xing* to enact their self-interested agendas.\n\nMaterial *xing* in a person cannot act on its own; what enables its action is always the borrowing of numinosity from the original *xing*—like a haughty servant or a bastard son who borrows the master’s authority to issue commands. Thus it is often compared: *Xing* is like water; falling into the *qi*-disposition, it is like water entering mud and mire. If you cut a channel and let it flow, you see only mud and mire, not the water. Can mud and mire move on their own? It is the water that moves them—but the water is mixed with mud and mire and thus unseen.\n\nIf you settle it for a long time, the clear rises to the top and the turbid sinks to the bottom. Cut a channel and let it flow—nothing but water. This is the power of settling and returning to goodness.”\n\n**On the Chamber of the Spirit**",
      "overlap_context": "e metaphors of the ancients carry profound meaning.\n\nLet me speak of what gives rise to a person’s life! The true *Wuji*, the essence of the Two and Five, wondrously conjoin and coalesce. What is called *xing* is the *Wuji*; what is called *ming* is the essence of the Two and Five. When these two wondrously conjoin, a person begins to live. Before their birth, what is called *Wuji* is a primal chaos, a vast undifferentiation—what form, what name? What sound, what thread? What scent, what voice?”",
      "start_char": 4349,
      "end_char": 4893,
      "start_sentence": 255,
      "end_sentence": 298,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.678879022598267,
      "metadata": {
        "source_file": "dao\\藏外\\方壶外史.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "“元性元神，有以异乎？ ” 曰：“元性即元神，无以异也。 以其灵通而莫测，妙应而无方，故名之曰神。 谓之元者，所以别于后天之思虑也。 ” “神之在人，亦有宅乎” 曰：“吾闻之紫清仙师，人有三谷，乃元神之空，灵性之所存也。 其空如谷，又名谷神。 神存则生，神去则死。 日则接于物，夜则接于梦。 神不能安其居也。 《灵枢内经》曰：‘天谷元神，守之自真。 ’人身之中，上曰天谷，泥丸是也； 中曰应谷，绛宫是也； 下曰灵谷，关元是也。 此三谷者，神皆居之，谓之三田。 尝为之论，泥丸者，栖神之本宫也； 绛宫者，布政之明堂也； 灵谷者，藏修之密室也。 故夫元神居于绛官，则耳有闻，目有见，五官效职而百体为之从今矣； 元神居于灵谷，则视者返，听者收，神气相守，而营魄为之抱一矣。 杨子有言：‘藏心于渊，美厥灵根。 ’渊者，深昧不测之所，灵谷是也。 是神所藏也。 ”",
      "translated_text": "“Is the original *xing* distinct from the original spirit?”\n“Original *xing* is the original spirit—there is no distinction. Because it is numinously penetrating and unfathomable, wondrously responsive yet without fixed form, it is called *shen* (spirit). That it is called *original* serves to distinguish it from postnatal thoughts and deliberations.”\n\n“Does the spirit in a person also have a dwelling?”\n“As I have heard from the Perfected Master of Purple Clarity, a person has three valleys, which are the hollows of the original spirit and the abode of the numinous *xing*. These hollows are like valleys, hence also called *valley spirit*. When the spirit abides, there is life; when it departs, there is death. By day it engages with things; by night it engages with dreams. The spirit cannot rest in its dwelling.\n\n*The Spiritual Pivot of the Inner Canon* states: ‘The celestial valley holds the original spirit; guard it to preserve your authenticity.’ Within the human body, the upper is called the *Celestial Valley*—this is the *Mud Pill*; the middle is called the *Responsive Valley*—this is the *Crimson Palace*; the lower is called the *Numinous Valley*—this is the *Pass of Origin*. These three valleys are where the spirit resides, and they are called the *Three Fields*.\n\nI have composed a discourse on them:\nThe *Mud Pill* is the original palace where the spirit dwells;\nThe *Crimson Palace* is the bright hall where governance is enacted;\nThe *Numinous Valley* is the secluded chamber for cultivation and refinement.\n\nThus, when the original spirit resides in the *Crimson Palace*, the ears hear, the eyes see, the five senses perform their functions, and the hundred limbs follow its commands. When the original spirit resides in the *Numinous Valley*, vision turns inward, hearing withdraws, spirit and *qi* guard one another, and the *hun* and *po* souls embrace unity.\n\nMaster Yang said: ‘Conceal the heart in the abyss to beautify its numinous root.’ The abyss is the deep, obscure, unfathomable place—this is the *Numinous Valley*, where the spirit is concealed.”",
      "overlap_context": "i*-disposition, it is like water entering mud and mire. If you cut a channel and let it flow, you see only mud and mire, not the water. Can mud and mire move on their own? It is the water that moves them—but the water is mixed with mud and mire and thus unseen.\n\nIf you settle it for a long time, the clear rises to the top and the turbid sinks to the bottom. Cut a channel and let it flow—nothing but water. This is the power of settling and returning to goodness.”\n\n**On the Chamber of the Spirit**",
      "start_char": 4894,
      "end_char": 5260,
      "start_sentence": 299,
      "end_sentence": 324,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.043341636657715,
      "metadata": {
        "source_file": "dao\\藏外\\方壶外史.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "河车论 神既藏矣，是谓归根。 归根曰静，静曰复命。 将见神气相守，抱一无离。 迨夫静极而动，则是神也。 复乘气机而上升于泥九，于是河车之路始通。 要知河车之赂，乃吾身前后任督二脉也。 夫气之始升也，油然滃然，郁蒸于两肾之间，浩浩如潮生，溶溶如水泮，泛溢于五腧之上者，乃水经滥行，不由沟洫也。 吾急以神斡归尾闾，使之循尾闾而上，至于夹脊双关，上风府而直至于泥丸。 神与气交会于此，则其疏畅融液，不言可知。 少焉，降为新美之津，则自重楼而下游绛宫，入紫庭，复归其所藏之处而休焉。 如此循环灌注，久久纯熟，气满三田，上下交泰，所谓“常使气冲关节透，自然精满谷神存”也。 造化至此，内炼之征见矣。 然非深造而实诣，又乌知予言之有味哉！ 澄神论 “吾子所言藏神之宅，则吾既得闻命矣。 敢问藏神之旨。 ” 曰：“藏神者，凝神也。 凝神之要，莫先于澄神； 澄神之要，莫先于遣欲。 《清净经》云； ‘遣其欲而心自静，澄其心而神自清。 ’《易》曰：‘圣人以此洗心，退藏于密。 ’所谓洗心，即澄神之谓也。 周子曰：‘无欲故静。 ’所谓无欲，即遣欲之尽也。 夫人神好清，而心扰之； 人心好静，而欲牵之。 所谓心者有二焉。 扰神之心，乃妄心也； 好静之心，乃真心也。 既有妄心，即惊其神，其神可得清乎？ 既惊其神，即着万物； 既着万物，即生贪求； 既生贪求，即是烦恼； 烦恼妄想，忧苦身心，心可得而静乎？ 故澄神之要，莫先于遣欲。 能遣之者，内观其心，心无其心，知三心之不可得也。 外观其形，形无其形，远观于物，物无其物，知四相之俱忘也，三者既悟，惟见于空，则人空矣。 空无所空，所空既无，无无亦无，无无既无，湛然常寂，则法空矣。 如是则根尘永静，六欲不生，而心静矣。 心静则神自清，如水之无波，而万顷澄澈也。 虚靖天师《大道歌》云：‘欲得身中神不出，莫向灵台留一物。 物在心中神不清，耗散真精损筋骨。 ’遣欲澄神之说，百世以俟圣人，不易吾言矣！ ” 养神论 “神既澄矣，又何以加焉” 曰：“养之。 养之者，所以韬神之光使勿露也。 神之为物也，愈澄则愈清，愈清则愈明。 盖定能生慧，故灵光焕发，旁烛洞达，莫可盖藏。 《庄子》云：‘宁泰定者，发乎天光。 ’若用之不已，则太露而反伤于本性。 《庄子》云：‘古之治道者，以智养恬。 ’智生而以智为也，谓之以恬养知。 《坐忘枢冀论》云：‘慧而不用，实智若愚； 益资定慧，双美无极。 ’《道德经》云：‘敦兮其若朴，浑兮其若浊。 ’又曰：‘众人昭昭，我独若愚。 俗人察察，我独若闷。 ’皆养神之要义也。 ” 凝神论 “神既养矣，安所事凝耶？ ” 曰：“凝神云者。 无用用中之用，了命之学也。 《参同契》曰：‘经营养鄞鄂，凝神以成躯。 ’且夫离宫修定，禅之宗也； 水府求玄，丹之旨也。 澄神要矣，凝神急焉。 《翠虚吟》云：‘昔日逢师传口诀，只要凝神入气穴。 ’所谓气穴，乃吾人之鄞鄂也。 予前所着《神室论》中，则既明且尽矣。 虑夫学者徒知澄神，而不知凝神之处，则漫无归宿，而无以会夫归根复命之原，徒知养神而不知有凝神之方，则茫无下手，而不能侦夫造化消息之妙，故述所闻，复着此论。",
      "translated_text": "**Discourse on the River Chariot**\n\nWhen the spirit is thus concealed, this is called \"returning to the root.\" Returning to the root is called quiescence; quiescence is called the restoration of life. Then one sees spirit and *qi* guarding one another, embracing unity without separation. When quiescence reaches its utmost and movement arises, this is the spirit. It then rides the mechanism of *qi* and ascends to the *Mud Pill*, at which point the path of the River Chariot begins to open.\n\nIt is essential to know that the route of the River Chariot is none other than the Conception and Governor Vessels before and behind the body. When *qi* first ascends, it wells up gently and steamily, steeping between the two kidneys, vast as the rising tide, fluid as melting ice. Overflowing above the five transport points, it courses like water spilling beyond its channels. I swiftly guide the spirit to revolve and return to the *Weilü*, causing it to ascend along the *Weilü*, pass through the *Jiaji* Double Pass, rise to the *Fengfu*, and reach straight to the *Mud Pill*. When spirit and *qi* meet here, their free flow and fusion are self-evident.\n\nAfter a while, it descends as fresh and sweet fluid, flowing down from the *Double Towers* to the *Crimson Palace*, entering the *Purple Court*, and returning to its concealed abode to rest. Through such circulation and infusion, over time and with mastery, *qi* fills the Three Fields, above and below interpenetrate, and it is said: *\"Always let qi surge through the joints, and naturally essence will be full and the Valley Spirit preserved.\"* At this stage of creation, the signs of internal refinement appear. Yet without profound attainment and true realization, how could one know the savor of my words?\n\n---\n\n**Discourse on Clarifying the Spirit**\n\n\"You have spoken of the dwelling where the spirit is concealed, and I have received your instruction. May I ask about the essence of concealing the spirit?\"\n\n\"It is said: Concealing the spirit is congealing the spirit. The essence of congealing the spirit lies first in clarifying the spirit; the essence of clarifying the spirit lies first in dispelling desires. The *Sutra of Purity* states: *'Dispel desires, and the heart becomes still; clarify the heart, and the spirit becomes clear.'* The *Book of Changes* says: *'The sage uses this to wash the heart and withdraw it into secrecy.'* This 'washing the heart' is precisely what is meant by clarifying the spirit. Master Zhou said: *'Without desires, there is quiescence.'* This 'without desires' is the thorough dispelling of desires.\n\nThe human spirit delights in clarity, yet the heart disturbs it; the human heart delights in stillness, yet desires pull it. Here, 'heart' has two aspects: the heart that disturbs the spirit is the deluded heart; the heart that delights in stillness is the true heart. If there is a deluded heart, it startles the spirit—how can the spirit remain clear? Once the spirit is startled, it clings to the myriad things; once it clings to the myriad things, craving arises; once craving arises, vexation follows; vexation and delusion bring sorrow and suffering to body and mind—how can the heart remain still?\n\nThus, the essence of clarifying the spirit lies first in dispelling desires. To dispel them: inwardly observe the heart, and the heart is no-heart—know that the three hearts cannot be grasped. Outwardly observe the form, and the form is no-form; observe things from afar, and things are no-things—know that the four marks are all forgotten. When these three are awakened to, only emptiness is seen, and the person is empty. When emptiness is empty of emptiness, and that emptiness is also empty, then profound stillness abides—this is the emptiness of dharmas. Thus, the roots and dust are forever stilled, the six desires do not arise, and the heart is still. When the heart is still, the spirit becomes clear, like water without waves, vast and limpid.\n\nMaster Xu Zhenjun’s *Song of the Great Dao* says: *'To keep the spirit within the body from departing, do not leave a single thing in the numinous terrace. When things remain in the heart, the spirit is not clear, dissipating true essence and harming sinews and bones.'* The teaching of dispelling desires and clarifying the spirit awaits the sage of a hundred generations—my words will not change.\"\n\n---\n\n**Discourse on Nurturing the Spirit**\n\n\"Since the spirit is already clarified, what more can be added?\"\n\n\"Nurture it. Nurturing means veiling the spirit’s radiance to prevent its exposure. As a thing, the spirit grows clearer the more it is clarified, and brighter the clearer it becomes. For stillness generates wisdom, and thus numinous light shines forth, illuminating all without obstruction. *Zhuangzi* says: *'In perfect quiescence, there is emanation of heavenly light.'* Yet if it is used without cease, it becomes too exposed and harms one’s original nature. *Zhuangzi* also says: *'The ancients who cultivated the Dao used wisdom to nurture tranquility.'* Wisdom arises, yet it is used to nurture tranquility—this is called using tranquility to nurture wisdom.\n\nThe *Pivot of Sitting in Forgetfulness* states: *'Wisdom unused is true wisdom, appearing foolish; this enriches both stillness and wisdom, a dual beauty without limit.'* The *Dao De Jing* says: *'Profound, it seems uncarved; turbid, it seems murky.'* And again: *'The multitude are bright; I alone seem dull. The common folk are sharp; I alone seem muddled.'* These are all essential principles of nurturing the spirit.\"\n\n---\n\n**Discourse on Congealing the Spirit**\n\n\"Since the spirit is already nurtured, why concern oneself with congealing it?\"\n\n\"It is said: Congealing the spirit is the use within non-use, the study of fulfilling life. The *Cantong Qi* states: *'Manage and nurture the root and stem, congealing the spirit to form the body.'* Moreover, cultivating concentration in the *Li Palace* is the essence of meditation; seeking the mysterious in the *Water Mansion* is the aim of alchemy. Clarifying the spirit is vital, but congealing the spirit is urgent.\n\nThe *Cui Xu Yin* says: *'Long ago, I met my teacher and received the oral transmission: simply congeal the spirit and enter the qi cave.'* This 'qi cave' is none other than the root and stem within us. In my earlier *Discourse on the Spirit Chamber*, this was already made clear and exhaustive. I fear that scholars may know only how to clarify the spirit but not where to congeal it, leaving them without a destination and unable to meet the origin of returning to the root and restoring life. Or they may know how to nurture the spirit but not the method of congealing it, leaving them without a starting point and unable to fathom the subtleties of creation’s ebb and flow. Thus, I set forth what I have heard and compose this discourse.\"",
      "overlap_context": "son Palace*, the ears hear, the eyes see, the five senses perform their functions, and the hundred limbs follow its commands. When the original spirit resides in the *Numinous Valley*, vision turns inward, hearing withdraws, spirit and *qi* guard one another, and the *hun* and *po* souls embrace unity.\n\nMaster Yang said: ‘Conceal the heart in the abyss to beautify its numinous root.’ The abyss is the deep, obscure, unfathomable place—this is the *Numinous Valley*, where the spirit is concealed.”",
      "start_char": 5261,
      "end_char": 6514,
      "start_sentence": 325,
      "end_sentence": 401,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.37620782852173,
      "metadata": {
        "source_file": "dao\\藏外\\方壶外史.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "盖凝神者，入玄之要旨，丹家之第一义也。 所谓凝者，非块然不动之谓也。 乃以神入于气穴之中，与之相守而不离也。 老子曰：‘载营魄抱一，能无离乎’夫气穴者，乃吾人胎元受气之初，所禀父母精气而成者，即吾人各具之太极也。 其名不一，曰气海，曰关元，曰灵谷，曰下田，曰天根，曰命蒂，曰归根窍、复命关，即一处也。 方其处胎之时，呼吸之气，与母相通。 及夫子母分胎，剪落脐带，则自安炉鼎，别立乾坤，而一呼—吸，常归于本穴之中。 盖呼吸者，吾人立命之本也。 一息之间，呼吸不至，则气绝而死矣。 呼则气辟，阳之舒也； 吸则气阖，阴之敛也。 一呼一吸，名曰一息。 诊家以之候气，良有旨也。 《庄子》曰：‘众人之息以喉，真人之息以踵。 ’以踵者，谓深入于穴也。 众人之息，非不以踵也，但神有不存，纵其出入焉，而不自觉，若以喉耳。 真人则神依于息，而深入于本穴之中，绵绵若存，无少间断，故得专气致柔，抱—无离，虚极静笃，而能观其复也。 所谓依者，又非逐于息而依之也，有勿忘勿助之义焉。 故神依于息则凝，神凝则气亦凝； 神依于息则和，神和则气亦和，相须之道也。 凝神之法，自调息始。 调息者，依息之谓也。 ” 真息论 所谓息者有二焉，曰凡息，曰真息。 凡息者，口鼻出入之气也； 真息考，胎息也，上下乎本穴之中。 晦翁先生所谓“翕然而嘘，如春沼鱼”者是也。 凡息既停，则真息自动。 而凡息之所以停者，非有心以屏之也。 虚极静笃，故心愈细，而气愈微耳。 今之论者但知调息，而忽不自知其落于以心逐气之病，盖以凡夫躁竞之心，未闲调习，一旦使之依息，心岂肯自依？ 未免着意。 着意则气未平，而心先动矣。 岂非复以气而役神乎？ 予故曰：“调息者，自然依息之谓，非逐于息之谓也。 ”调息又自调心始。 调心者，摄念归静，行住坐卧，常在腔子。 久久纯熟，积习生常，自然澡雪柔埏，与息相和也。 和则相依，依而勿逐。 凡息自停，真息自动。 橐钥一鼓，炼精化气，熏而上腾，灌注三宫。 是谓真橐钥、真鼎炉、真火候也。 ” 火符论",
      "translated_text": "The congealing of spirit is the essential principle of entering the profound and the foremost tenet of the alchemical tradition. By \"congealing,\" we do not mean a stagnant immobility; rather, it is the spirit entering the qi cave and abiding with it without separation. Laozi said: *\"Carrying your soul and embracing the One, can you never depart from it?\"* The qi cave is that which we receive at the inception of our embryonic qi, formed from the essence and qi of our parents—it is the Supreme Ultimate inherent in each of us. Its names vary: qi sea, Pass of Origin, Spirit Valley, lower field, Heavenly Root, Stem of Life, Returning-Root Aperture, or Gate of Restored Life—yet it is one and the same place.\n\nWhen we dwell in the womb, our breath and qi communicate with our mother. Once the umbilical cord is severed at birth, we establish our own furnace and cauldron, setting up a separate heaven and earth, and with every inhalation and exhalation, the qi invariably returns to its original cavity. Breath is the foundation of our life: if in a single moment the breath fails to come and go, the qi ceases and death ensues. Exhalation is the expansion of qi, the unfolding of yang; inhalation is the contraction of qi, the gathering of yin. One exhalation and one inhalation together are called a single breath. Physicians use this to assess the qi, and rightly so.\n\nZhuangzi said: *\"The breath of the common people is at the throat, while the breath of the perfected person is at the heels.\"* \"At the heels\" means deeply entering the cavity. The common people do not fail to breathe from the heels, but their spirit is not present; though their breath moves in and out, they are unaware of it, as if it were merely at the throat. The perfected person, however, aligns the spirit with the breath, deeply entering the original cavity, continuously abiding without the slightest interruption. Thus, they concentrate the qi to attain suppleness, embrace the One without separation, and in utter emptiness and profound stillness, observe the return.\n\nBy \"alignment,\" we do not mean chasing after the breath but rather abiding with it in a manner of neither forgetting nor forcing. When the spirit aligns with the breath, it congeals; when the spirit congeals, the qi also congeals. When the spirit aligns with the breath, it harmonizes; when the spirit harmonizes, the qi also harmonizes—this is the principle of mutual dependence. The method of congealing the spirit begins with regulating the breath. Regulating the breath means aligning with it.\n\n*Discourse on True Breath*\nBreath is of two kinds: ordinary breath and true breath. Ordinary breath is the qi that enters and exits through the mouth and nose; true breath is embryonic breath, circulating within the original cavity. This is what Master Huiweng described as *\"breathing softly and gently, like a fish in a spring pond.\"* When ordinary breath ceases, true breath moves of its own accord. The cessation of ordinary breath does not come from forcibly suppressing it; rather, in utter emptiness and profound stillness, the heart becomes ever more refined, and the qi ever more subtle.\n\nThose who discuss this today know only how to regulate the breath but fail to recognize the pitfall of chasing the qi with the heart. This is because the restless, competitive heart of the ordinary person has not been trained in regulation. If one suddenly attempts to align with the breath, how can the heart willingly comply? Inevitably, one becomes deliberate. With deliberation, the qi is not yet settled, and the heart is already stirred—is this not the spirit being enslaved by the qi? Therefore, I say: *\"Regulating the breath means naturally aligning with it, not chasing after it.\"* Regulating the breath begins with regulating the heart.\n\nRegulating the heart means gathering the thoughts to return to stillness, maintaining this whether moving, resting, sitting, or lying down, always abiding within the cavity. With long practice, the habit becomes second nature, and one naturally becomes purified and pliable, harmonizing with the breath. In harmony, there is alignment; aligned but not chasing, ordinary breath ceases of itself, and true breath moves spontaneously. The bellows are set in motion, refining essence into qi, which rises and pervades, irrigating the three palaces. This is the true bellows, the true cauldron and furnace, the true firing times.\n\n*Discourse on the Fire Talisman*",
      "overlap_context": "Chamber*, this was already made clear and exhaustive. I fear that scholars may know only how to clarify the spirit but not where to congeal it, leaving them without a destination and unable to meet the origin of returning to the root and restoring life. Or they may know how to nurture the spirit but not the method of congealing it, leaving them without a starting point and unable to fathom the subtleties of creation’s ebb and flow. Thus, I set forth what I have heard and compose this discourse.\"",
      "start_char": 6514,
      "end_char": 7317,
      "start_sentence": 402,
      "end_sentence": 446,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.44910430908203,
      "metadata": {
        "source_file": "dao\\藏外\\方壶外史.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "“以真息为火，其亦有说乎？ ” 曰：“有之。 ‘谩守药炉看火候，但安神息任天然。 丹灶河车休矻矻，鹤胎龟息自绵绵。 ’古仙之言，不一而足。 然非以息为火也。 火，神火也，息则火之橐钥也。 今夫神气相守之时，神则无为，而气机则不能以不动，故一阖一辟，与经脉上下相为流通。 所以觉其动者，谁也？ 神也。 一气流通，元神独觉，神与气融，宽急相得，是火力调匀，然后丹成而药就也。 予尝以橐钥喻真息，盖亦有理。 今夫冶人之铸金也，必先鼓之以橐钥，然后火发而金始溶。 若徒以浩荡之风吹之，则火气散漫，而金终不可化矣。 何者？ 浩荡之风，往来不常，即众人以喉之息也，橐钥之风，绵绵不绝，即真人以踵之息也。 神依息而互融，即火之得乎风也； 气得神而自化，即金之化于火也。 如斯而喻，昭乎明矣！ ”",
      "translated_text": "“Is there an explanation for taking true breath as fire?”\n\n“There is. The ancient immortals’ words abound, such as:\n*‘Do not idly watch the medicine furnace for firing times—*\n*Simply settle the spirit and breath, letting nature take its course.*\n*Cease your toil at the elixir hearth and river chariot;*\n*The crane’s embryo and tortoise’s breath will flow on of themselves.’*\nYet these do not mean taking breath as fire. Fire is the fire of spirit; breath is but the bellows of that fire.\n\nWhen spirit and qi guard one another, the spirit remains in non-doing, while the qi mechanism cannot but move. Thus, with each closing and opening, it circulates up and down through the meridians. What perceives this movement? The spirit. As the qi flows unimpeded, the primordial spirit alone awakens. Spirit and qi merge, tension and ease harmonizing—this is the evenness of fire’s power, and only then is the elixir completed and the medicine achieved.\n\nI have likened the bellows to true breath, and there is reason in this. When a smith casts metal, he must first pump the bellows, and only then does the fire ignite and the metal begin to melt. If one merely blows with a gusting wind, the fire scatters, and the metal will never transform. Why? The gusting wind comes and goes unpredictably—this is the breath of ordinary men through the throat. The bellows’ wind flows ceaselessly—this is the true person’s breath through the heels. Spirit rests in breath and fuses with it, just as fire is kindled by wind; qi is transformed by spirit, just as metal is refined by fire. Such is the clarity of this analogy!”",
      "overlap_context": "hin the cavity. With long practice, the habit becomes second nature, and one naturally becomes purified and pliable, harmonizing with the breath. In harmony, there is alignment; aligned but not chasing, ordinary breath ceases of itself, and true breath moves spontaneously. The bellows are set in motion, refining essence into qi, which rises and pervades, irrigating the three palaces. This is the true bellows, the true cauldron and furnace, the true firing times.\n\n*Discourse on the Fire Talisman*",
      "start_char": 7318,
      "end_char": 7645,
      "start_sentence": 447,
      "end_sentence": 467,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.815268993377686,
      "metadata": {
        "source_file": "dao\\藏外\\方壶外史.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "或问：“火符进退，朝屯暮蒙，其旨同异？ ” 曰：“予昔未得师指，窃以火候难明。 亦尝按之周天，准之卦0气，分更分漏，徒费讲求。 而后乃今，豁然大悟。 乃知丹经万卷，火记六百，皆可言下而废。 所谓真火无候，大药元斤，诚哉是言！ 不我欺也。 夫炼药有内外，故火候有繁简。 所谓内炼，一言以蔽之曰：‘锦绵若存而已矣。 ’外药者，非前所论之外药也，盖指天元地元而言。 符者，谓与天道相符合也。 丹法以月之庚甲，象药材之老嫩； 日之子午，为火候之消息。 所谓朝屯暮蒙，不过言其进退之则，有如是耳。 得其意忘象可也。 《悟真篇》云：‘内药还同外药．内通外亦须通。 丹头和合类相同，温养两般作用。 内有天然真火，炉中赫赫常红。 外炉加减要勤功，绝妙无过真种。 ’真种者，人元也。 是火符之断案也。 ” 药火论",
      "translated_text": "One might ask: “The fire-tally advances and retreats, ‘morning in *tun*, evening in *meng*’—are their principles the same or different?”\n\nI reply: “In the past, before receiving my teacher’s guidance, I privately considered the firing times difficult to discern. I once tried to measure them by the celestial revolution, align them with the hexagrams’ qi, and divide them by watches and clepsydra drops—all to no avail. Only afterward did I suddenly awaken in great clarity. Then I understood that the ten thousand volumes of elixir classics and the six hundred firing records could all be discarded at a single word. The saying that ‘true fire has no timing’ and ‘the great medicine has no fixed weight’ is indeed true—it did not deceive me.\n\nRefining the medicine involves both inner and outer aspects, so the firing times vary in complexity. As for inner refinement, one phrase suffices: ‘Gently, subtly, as if present, yet not.’ The ‘outer medicine’ here does not refer to the outer medicine discussed earlier, but rather to the celestial and terrestrial origins. The ‘tally’ means alignment with the Dao of Heaven. In elixir methods, the cyclical stems of the moon—*geng* and *jia*—symbolize the maturity or tenderness of the medicinal material, while the solar terms of the day—*zi* and *wu*—mark the waxing and waning of the firing times. The phrase ‘morning in *tun*, evening in *meng*’ merely describes the principle of advance and retreat—nothing more. Once the meaning is grasped, the images may be forgotten.\n\nThe *Wuzhen Pian* states:\n‘The inner medicine is like the outer medicine,\nInner and outer must both be penetrated.\nThe elixir head blends in harmonious accord,\nNurtured by twofold workings in warmth.\nWithin, there is the natural true fire,\nThe furnace ever glowing crimson.\nThe outer furnace’s increase and decrease demand diligent effort—\nNothing surpasses the wondrous true seed.’\n\nThe ‘true seed’ is the human origin—this is the final verdict on the fire-tally.”",
      "overlap_context": "gnite and the metal begin to melt. If one merely blows with a gusting wind, the fire scatters, and the metal will never transform. Why? The gusting wind comes and goes unpredictably—this is the breath of ordinary men through the throat. The bellows’ wind flows ceaselessly—this is the true person’s breath through the heels. Spirit rests in breath and fuses with it, just as fire is kindled by wind; qi is transformed by spirit, just as metal is refined by fire. Such is the clarity of this analogy!”",
      "start_char": 7646,
      "end_char": 7979,
      "start_sentence": 468,
      "end_sentence": 491,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.366260528564453,
      "metadata": {
        "source_file": "dao\\藏外\\方壶外史.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "“药与火同乎？ 异乎？ ” 曰：“药与火，可分也，亦可台也。 分则可异，合则可同。 何者？ 分而言之，则药者，先天之气也； 火者，先天之神也。 合而言之，则药即火也，火即药也。 知合而不知分，则采取不明； 知分而不知合，则温养无法。 何者？ 采取之时，药在外，火在内。 以火而致药，故药火可分； 温养之目，药在外，归于内，得药而行火，故药火可合。 要之，火其主也，故火急则丹伤，火冷则丹散。 几言火而不言药者，十月之事也； 言药而不言火者，一时半刻之功也。 至于紫清仙师之言曰：‘以火炼药而成丹。 ’即以神驭气而成道也，更明切矣”。 抽添论 或问：“抽铅添汞之旨，可得闻欤？ ” 曰：“予闻之立阳先生得药归鼎之后，养以天然真火，绵绵若存。 其中抽添变化，皆出自然。 有不容以丝毫智力与乎其间。",
      "translated_text": "“Are medicine and fire the same or different?”\n\nIt is said: “Medicine and fire may be distinguished, yet they may also unite. When separated, they differ; when conjoined, they are one. Why? Speaking of them as distinct: medicine is the primordial qi, while fire is the primordial spirit. Speaking of them as united: medicine is fire, and fire is medicine. He who knows only unity and not distinction will fail in gathering and refinement; he who knows only distinction and not unity will lack the method for nurturing and warming. Why? At the time of gathering, medicine resides without while fire abides within—fire draws in medicine, so medicine and fire may be distinguished. During the phase of nurturing, medicine, though initially without, returns within, and with medicine present, fire is set in motion—thus medicine and fire may unite.\n\nIn essence, fire is the master: if fire is too fierce, the elixir is harmed; if fire is too cool, the elixir scatters. When fire alone is mentioned without reference to medicine, it refers to the work of the ten months; when medicine alone is mentioned without reference to fire, it refers to the effort of a brief moment. As the Purple Clarity Immortal Master said: ‘Refining medicine with fire to form the elixir’—this is precisely ‘guiding qi with spirit to attain the Dao,’ a statement of utmost clarity.”\n\n**On Withdrawal and Addition**\n\nSomeone asked: “May I hear the essential meaning of ‘withdrawing lead and adding mercury’?”\n\nIt was said: “I have heard that after Master Liyang obtained the medicine and returned it to the crucible, he nurtured it with the natural true fire, continuous and unceasing as though present. Within it, the transformations of withdrawal and addition all arise naturally, allowing no trace of human artifice or force to intervene.”",
      "overlap_context": "ped, the images may be forgotten.\n\nThe *Wuzhen Pian* states:\n‘The inner medicine is like the outer medicine,\nInner and outer must both be penetrated.\nThe elixir head blends in harmonious accord,\nNurtured by twofold workings in warmth.\nWithin, there is the natural true fire,\nThe furnace ever glowing crimson.\nThe outer furnace’s increase and decrease demand diligent effort—\nNothing surpasses the wondrous true seed.’\n\nThe ‘true seed’ is the human origin—this is the final verdict on the fire-tally.”",
      "start_char": 7980,
      "end_char": 8317,
      "start_sentence": 492,
      "end_sentence": 517,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.479807376861572,
      "metadata": {
        "source_file": "dao\\藏外\\方壶外史.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "盖道则无为，而神气自然有所为，乃造化之妙也。 所谓如米炊饭，厥有深旨，非止特喻其易易而已。 夫铅之投汞，譬则水之投于米中也。 水不可以过多，米不可以过少，犹之二八相当也。 火力调匀，其水渐干而米渐长，斯成饭矣。 水渐干则抽铅之谓也，米斯长则添汞之谓也。 抽非内减也，神入气中，如天之气行于地，而潜机不露也； 添非外益也，气包神外，如地之气承乎天，而渐以滋长也。 由是而胎圆神化，身外有身。 造化之妙，一至于此。 要皆自然而然，有莫知其所以然者。 若于此而欲求其所以抽所以添，则涉于有心而非自然矣。 所谓自然，亦有深旨。 师语我曰：‘顺自然，非听自然也。 ’旨哉！ 言乎！",
      "translated_text": "For the Dao is non-action, yet spirit and qi naturally act—such is the marvel of creation. The analogy of cooking rice with grain contains profound meaning, far beyond merely illustrating its simplicity. When lead is added to mercury, it is like water poured into rice. The water must not be excessive, nor the rice too scant, just as the two and the eight must be in perfect balance. When the fire’s intensity is evenly regulated, the water gradually dries while the rice expands—thus rice is made. The gradual drying of water is what is meant by \"withdrawing lead\"; the expansion of rice is what is meant by \"adding mercury.\" Withdrawal is not a reduction from within: spirit enters qi as heaven’s qi moves through earth, its hidden mechanism unseen. Addition is not an increase from without: qi enfolds spirit as earth’s qi receives heaven, gradually nurturing growth. Through this, the embryo is perfected, spirit transforms, and a body arises beyond the body. The marvel of creation reaches this point—all unfolding of itself, with no one knowing how it comes to be. If one seeks to grasp the *how* of withdrawal and addition, one falls into intentionality and loses the natural. This \"natural\" itself holds profound meaning. My master told me: *\"Follow the natural, do not merely heed it.\"* How profound! These words!",
      "overlap_context": "the Dao,’ a statement of utmost clarity.”\n\n**On Withdrawal and Addition**\n\nSomeone asked: “May I hear the essential meaning of ‘withdrawing lead and adding mercury’?”\n\nIt was said: “I have heard that after Master Liyang obtained the medicine and returned it to the crucible, he nurtured it with the natural true fire, continuous and unceasing as though present. Within it, the transformations of withdrawal and addition all arise naturally, allowing no trace of human artifice or force to intervene.”",
      "start_char": 8317,
      "end_char": 8587,
      "start_sentence": 518,
      "end_sentence": 533,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.250365495681763,
      "metadata": {
        "source_file": "dao\\藏外\\方壶外史.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "” 遗言论 或问：“诸丹经所言红铅、黑汞、青龙、白虎、白雪、黄芽、木公、金母、婴姹、黄婆，异名殊字，数更仆未易尽也。 今子所着一切置而不言，意者将有遗论乎” 曰：“否。 子静听，吾试语之。 昔者吾以章句儒生，学窥玄圃，索无前识之资。 偶以因缘遭际，得授真宗，颇知径约。 凡前所举名义，昔皆熟读而详味之。 但识此遗彼，适资捍格，而后乃今知大道之不烦，可一言而尽也。 夫道不外乎一阴一阳而已。 阴则为精，阳则为气，而神则统乎二者，故神与气精，乃上药之三品也。 凡言龙虎、铅汞，种种异名，皆依此立。 古仙垂语，不欲轻泄，故乱辞孔窍，纷尔多门，使志学之士，因文以见义，出博以之约。 迨天真积力久，豁然贯通，则刊落言筌，直见根本矣。 ” 或问：“《玄肤》所着，多言外药。 至于采取交媾，略而不言，学人何述焉” 曰：“采取交媾，乃太上閟密之玄机，千圣传心之要旨。 吾非不欲指而言之，但师命甚严，是以临书而惴惴其栗也。 然吾于前所论中，似已诀破，但混于微言而不觉耳。 《契》有之曰：‘千周灿彬彬兮，万遍将可睹。 ’志学之士，苟能千周万遍，则研精而妙义见矣。 然非有求而未得之愤，则孰知期道之难闻？ 非有相悦以解之妙，则孰知予言之有味哉？ 已乎已乎，吾兹将结舌矣。 ” 金丹大旨图·陆西星",
      "translated_text": "\"Legacy Discourse\"\n\nSomeone asked: *\"The various alchemical classics speak of red lead, black mercury, green dragon, white tiger, white snow, yellow sprout, Wood Elder, Metal Mother, infant maiden, and yellow matron—so many names and terms, their number beyond easy enumeration. Yet in your writings, you set all these aside and say nothing of them. Do you intend some unspoken teaching?\"*\n\nI replied: *\"No. Listen quietly, and I shall try to explain. Formerly, I was a scholar of chapters and verses, my learning a mere glimpse into the mystic garden, lacking any prior insight. By chance and karmic encounter, I received the true transmission and came to know the direct and simple path. All the names and terms you mentioned, I once studied thoroughly and savored in detail. Yet grasping one meant losing another, and they only served as obstacles. Only later did I realize that the great Dao is not cumbersome—it can be summed up in a single word.*\n\n*The Dao is nothing beyond the interplay of one yin and one yang. Yin is essence, yang is qi, and spirit governs both. Thus spirit, qi, and essence are the three grades of the supreme medicine. All the terms—dragon and tiger, lead and mercury, and the myriad other names—are based on this. The ancient immortals left such teachings not out of a desire to lightly disclose, but to obscure the gates with tangled words, multiplying paths so that earnest students might penetrate meaning through text and distill the vast into the essential. Only when innate truth has accumulated over time and suddenly becomes clear does one cast off the snares of language and directly perceive the root.\"*\n\nSomeone asked: *\"In your *Mystic Skin*, you discuss the outer medicine extensively, yet say little of gathering, refinement, and union. How are students to proceed?\"*\n\nI replied: *\"Gathering, refinement, and union are the most recondite mysteries of the Supreme, the essential heart-mind transmitted by a thousand sages. I do not refuse to point them out, but my master’s command was strict, and so as I write, I tremble with awe. Yet in what I have already discussed, the key seems already revealed—only veiled in subtle words, unnoticed. As the *Canticle* says: ‘After a thousand cycles, brilliance shines forth; after ten thousand repetitions, it may be seen.’ If earnest students can persist through a thousand cycles and ten thousand repetitions, they will refine their understanding and perceive the wondrous meaning. But without the frustration of seeking without attainment, who would know how rare it is to hear of the Dao? And without the joy of mutual delight in its unfolding, who would find savor in my words? Enough, enough—I shall now fall silent.\"*",
      "overlap_context": " qi receives heaven, gradually nurturing growth. Through this, the embryo is perfected, spirit transforms, and a body arises beyond the body. The marvel of creation reaches this point—all unfolding of itself, with no one knowing how it comes to be. If one seeks to grasp the *how* of withdrawal and addition, one falls into intentionality and loses the natural. This \"natural\" itself holds profound meaning. My master told me: *\"Follow the natural, do not merely heed it.\"* How profound! These words!",
      "start_char": 8587,
      "end_char": 9117,
      "start_sentence": 534,
      "end_sentence": 561,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.795212984085083,
      "metadata": {
        "source_file": "dao\\藏外\\方壶外史.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "序 古仙丹法，载之丹经，无下千帙。 读之则愈烦愈难，悟之则惟简惟易。 大要观天之道，执天之行，则二者其尽之矣。 一阴一阳，配合以两者，天之道也； 日月运行，昼夜交光者，天之行也。 《契》曰：“天地设位，而易行乎其中矣。 ”易谓离坎是也。 圣人知其如此，故尝准之以作丹法。 是故以乾坤为鼎器，以乌免为药材。 而其中消息盈虚之数，则又准之以为火候阴符。 《经》云：‘日月有数，大小有定，圣功生焉，神明出焉。 ’又总而言之，则曰盗机逆用尽之矣。 是道边，言之不能尽，佰之不可得。 若也逢师得诀，针芥相投，则可言下而领。 大患人无慧性，不能洞晓深达，以故求之愈远。 又或摇以似是之非，主以先入之说，则毒药熏心，鲸墨入骨，吾未如之何也已。 予生幸以空空鄙夫，遭际圣师，提挈年久，赖寸天不障，忽睹堂室，乃知今世之遇，干古希觏也。 四方闻道之士，谓某可教，各以师授参互考订，比予所闻，率多枘凿。 匪道有异同，户牖自别故也。 老子云：“大道甚夷，而民好径。 ”金丹之道，至易至简，有所安排布置，则涉邪伪而非自然。 故某所图述，根极化原，直指命术，举纲说约，大义昭然。 要在不背于师旨，别为破论，以辟邪宗。 若乃好道之伦，玩索而有得焉，或可尽性命而不惑于多歧之谬乎！ 岁在庚午嘉平月，下浣潜虚子书于南沙之西禅精舍。 先天无极之图 老子云；",
      "translated_text": "**Preface**\n\nThe ancient immortals’ methods of elixir-crafting fill the alchemical canons, numbering no fewer than a thousand scrolls. To read them is to grow ever more entangled and perplexed; to grasp them is to find them utterly simple and effortless. The great essential lies in observing the Dao of Heaven and holding fast to Heaven’s movements—these two suffice to encompass all. The alternation of yin and yang, their pairing as two, is the Dao of Heaven; the revolutions of sun and moon, their radiance intermingling day and night, are Heaven’s movements. As the *Canticle* says: *“Heaven and Earth establish their positions, and the Changes course between them.”* The Changes here refer to *li* and *kan*. The sages, knowing this to be so, modeled their elixir methods accordingly. Thus they took Qian and Kun as the crucible and furnace, the Crow and Hare as the medicinal ingredients. The waxing and waning cycles within—these they took as the fire-phases and the tally of yin.\n\nThe *Scripture* states: *“Sun and moon have their measures, great and small their fixed spans; sagely work arises therein, and numinous clarity emerges.”* To summarize: the entire art lies in stealing the mechanism and reversing its course. This Dao, though near at hand, cannot be exhausted in words nor attained through mere study. Yet if one meets a master and receives the oral transmission, with the affinity of needle and lodestone, then understanding may dawn in an instant. The greatest hindrance is that people lack the nature of wisdom, unable to penetrate and fathom deeply, and so their seeking strays ever farther. Or else they are swayed by specious arguments or ensnared by preconceived notions, such that poison fumes the heart and ink-black delusion seeps into the bones—what can I do for such as these?\n\nI, an empty and humble man, was fortunate to encounter a sagely teacher, who guided me for many years. Relying on a sliver of heaven’s grace that did not obstruct, I suddenly beheld the hall and chamber—realizing that such an encounter in this age is rarer than a thousand ages past. Seekers of the Dao from the four directions, deeming me teachable, have each brought their masters’ transmissions to compare and verify, but what I have heard differs widely, like tenon and mortise ill-fitted. Not that the Dao itself varies, but that each school’s gate and window are distinct. As Laozi said: *“The great Dao is utterly level, yet the people prefer byways.”*\n\nThe Dao of the Golden Elixir is supremely easy, supremely simple. Any contrivance or arrangement strays into falsity and departs from the natural. Thus what I have illustrated here traces the roots to their ultimate origins, directly pointing to the art of destiny, lifting the warp to expound the essentials—its great meaning shining forth. The aim is to remain true to my teacher’s intent, offering critical refutations to expose heterodox schools. If those who love the Dao ponder and attain insight, perhaps they may fulfill their nature and destiny, unconfused by the errors of many divergent paths!\n\nWritten in the last third of the twelfth lunar month of the *gengwu* year, by Qianxuzi at the Western Meditation Hut of Nansha.\n\n**The Diagram of the Primordial Limitless**\nLaozi said:",
      "overlap_context": "‘After a thousand cycles, brilliance shines forth; after ten thousand repetitions, it may be seen.’ If earnest students can persist through a thousand cycles and ten thousand repetitions, they will refine their understanding and perceive the wondrous meaning. But without the frustration of seeking without attainment, who would know how rare it is to hear of the Dao? And without the joy of mutual delight in its unfolding, who would find savor in my words? Enough, enough—I shall now fall silent.\"*",
      "start_char": 9118,
      "end_char": 9663,
      "start_sentence": 562,
      "end_sentence": 589,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.88924288749695,
      "metadata": {
        "source_file": "dao\\藏外\\方壶外史.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 17,
      "original_text": "“有物混成，先天地生。 吾不知其名，强名曰道。 ”又曰：“无名，天地之始。 ”又曰：“天下有始，以为天下母。 ”盖先天混元真乙之气，为生天生地、生人生物之根方。 其未有动机，故溟滓无光，声奥俱泯，谓之无极。 在人则至静无感，寂然不动者当之。 而佛氏所谓真空，儒者所谓末发，亦不外是老子云“常无欲以观其妙”，《易·系辞》云“圣人以此洗心退藏于密”，《圆觉经》云“惟取极静由静力”。 故永断烦恼，竞究成就，不起于坐，便入涅盘。 三教圣人同一宗旨，但作用不同，故有三者之别耳。 太极未分之图 《悟真篇》云：“道自虚无生一气，便从一气产阴阳。 ”极者，阴阳体具末分之象也。 老子云：“道生一。 ”一即太极也，其在吾人，是谓玄牝。 盖玄牝者，乃真精妙合自然而成。 所谓无中生有，虚里造实，乃神气之根，而性命之窍也。 老子云：“尝有欲以观其徼。 ”观徼之学，遂为千古圣真立命之基，而圣功于是乎生，神明于是乎出矣。 太极分阴阳之图 老子云：“道生一，一生二。 ”是太极分两仪也。 两仪分，则天包地外，地处天中，而阴中有阳、阳中有阴之妙寓于其中矣。 何者？ 自虚无而生一气，是静极而动，阴中之阳也； 两仪分而天包地外，地处天中，是动以涵静，阳中之阴也。 邵子云：“阴阳之精，互藏其宅。 ”故丹法阴中用阳，阳中用阴，而尝以静为主焉。 老子云：“重为轻根，静为躁君。 ”盖能静，是谓抱元守一而可以复归于无极矣。 阴阳互藏之图 天地既判，日月运行，照耀交光，而造化生焉。 日月者，天地阴阳之精也。 于卦则为离坎。 离中之阴，是谓乌精； 坎中之阳，是谓兔髓。 丹法以乌兔为药物，故阴中用阳，阳中用阴。 所谓东入西邻，西归东舍，不过识互藏之精，盗其机而逆用之耳。 坎离交媾之图 古仙造丹，莫要于采药。 而药物有铢两，采取有时节，颠倒有法度。 其要在于月出初庚，铅生癸后，而子南午北，互为纲纪，别有口诀，不着于文。 成丹之图 《悟真篇》云：“虎跃龙腾风浪粗，中央正位产玄珠。 ”又云：“药逢气类方呈象，道在希夷合自然。 ”要知此中一点，不谓之铅，不谓之汞，而谓之丹者，乃日月交光，阴阳和气，自然而成。 故丹之为字，象日象月。 《心印经》云：“丹在身中，非白非青。 ”盖以为青龙白虎，则尚属之两家，既归身中，则混合为一矣。 故云非白非育也。 或问：“何谓金液还丹？ ”曰：“以其既失而复得，谓之曰还。 以其采取水中之金，合经己汞而成，故曰金液。 ” 周天符火图",
      "translated_text": "“There is a thing formlessly formed, born before heaven and earth.\nI know not its name, and so forcefully call it the Dao.”\n\nIt also says:\n“Nameless, it is the beginning of heaven and earth.”\n\nAnd further:\n“The world has a beginning, which serves as the mother of all under heaven.”\n\nThis is the primordial, undifferentiated True Unity qi—the root-source from which heaven and earth, humans and all things are born. Before any impulse of movement arises, it is dark and formless, silent and scentless, called the Limitless. In humans, it corresponds to the state of utter stillness without response, absolute quiescence. The Buddhist notion of *true emptiness*, the Confucian idea of *the state before arousal*—these are none other than what Laozi describes as “constantly without desire to observe its mystery,” what the *Appended Judgments* of the *Book of Changes* calls “the sage thereby cleanses the mind and retreats to concealment in secrecy,” and what the *Sutra of Perfect Enlightenment* terms “taking only the utmost stillness, relying on the power of stillness.” Thus, to permanently sever afflictions and fully realize accomplishment, one need not rise from seated meditation to enter nirvana. The sages of the Three Teachings share a single aim; only their methods differ, hence the distinctions among the three.\n\n**Diagram of the Undivided Supreme Polarity**\nAs the *Wuzhen pian* states:\n“The Dao, from emptiness, gives birth to the One qi,\nAnd from the One qi, yin and yang emerge.”\n\n“Supreme” denotes the state in which yin and yang are embodied yet undivided. Laozi says, “The Dao gives birth to the One.” The One is the Supreme Polarity. In us, it is called the Mysterious Female. The Mysterious Female is the natural union of true essence and wondrous harmony—what is termed “generating being from non-being” and “creating reality within emptiness.” It is the root of spirit and qi, the aperture of nature and destiny. Laozi says, “Ever having desire, one observes its manifestations.” The study of observing manifestations has served as the foundation for the sages and perfected ones of all ages to establish destiny, and from it the sagely work arises, the numinous emerges.\n\n**Diagram of the Supreme Polarity Dividing into Yin and Yang**\nLaozi says, “The Dao gives birth to the One, the One gives birth to the Two.” This is the Supreme Polarity dividing into the Two Modes. Once the Two Modes separate, heaven envelops earth externally while earth resides within heaven, and the wondrous interplay of yin within yang and yang within yin is contained therein. How so? From emptiness, the One qi is born—this is the movement arising from extreme stillness, the yang within yin. The Two Modes divide, heaven enveloping earth externally while earth resides within heaven—this is the stillness contained within movement, the yin within yang. As Master Shao says, “The essence of yin and yang mutually abide in each other’s dwelling.” Thus, in the elixir method, one employs yang within yin and yin within yang, always taking stillness as the foundation. Laozi says, “Heaviness is the root of lightness; stillness is the ruler of restlessness.” For one who can be still, this is called embracing the Origin and guarding the One, thereby returning to the Limitless.\n\n**Diagram of Yin and Yang Mutually Abiding**\nOnce heaven and earth are separated, the sun and moon revolve, their radiance intersecting to generate transformation. The sun and moon are the essence of heaven and earth’s yin and yang. In the hexagrams, they correspond to *Li* and *Kan*. The yin within *Li* is called the Raven’s Essence; the yang within *Kan* is called the Hare’s Marrow. In the elixir method, the Raven and Hare serve as medicinal substances, hence employing yang within yin and yin within yang. This is what is meant by “the east enters the western neighbor, the west returns to the eastern abode”—merely recognizing the essence of mutual abiding, stealing its mechanism, and reversing its use.\n\n**Diagram of Kan and Li in Conjunction**\nThe ancient immortals’ creation of the elixir hinged on gathering the medicine. The medicine has its weights and measures, its gathering has its seasons, and its inversion has its methods. The essentials lie in the moon’s emergence at the first *geng* day, lead’s birth after *gui*, with *zi* south and *wu* north serving as the guiding principles. There are oral instructions not committed to writing.\n\n**Diagram of the Elixir’s Formation**\nAs the *Wuzhen pian* states:\n“Tiger leaps, dragon soars—waves surge roughly,\nAt the central true position, the Mysterious Pearl is born.”\n\nAnd further:\n“Only when the medicine meets its kind does it manifest form;\nThe Dao lies in the subtle and formless, harmonizing with nature.”\n\nKnow that this single point is called neither lead nor mercury but the Elixir—naturally formed from the intersection of sun and moon’s radiance, the harmony of yin and yang qi. The character for “elixir” (*dan*) resembles the sun and moon. The *Xinyin jing* says: “The Elixir is within the body, neither white nor green.” For while the Green Dragon and White Tiger still belong to two families, once they return to the body, they merge into one. Hence it is said to be neither white nor green.\n\nSomeone may ask: “What is the Golden Liquor Returned Elixir?”\nIt is called “returned” because what was lost is regained. It is called “golden liquor” because it is formed by gathering the gold within water, uniting it with one’s own mercury.\n\n**Diagram of the Circulating Fire of the Celestial Cycle**",
      "overlap_context": "und the essentials—its great meaning shining forth. The aim is to remain true to my teacher’s intent, offering critical refutations to expose heterodox schools. If those who love the Dao ponder and attain insight, perhaps they may fulfill their nature and destiny, unconfused by the errors of many divergent paths!\n\nWritten in the last third of the twelfth lunar month of the *gengwu* year, by Qianxuzi at the Western Meditation Hut of Nansha.\n\n**The Diagram of the Primordial Limitless**\nLaozi said:",
      "start_char": 9663,
      "end_char": 10671,
      "start_sentence": 590,
      "end_sentence": 644,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.690402030944824,
      "metadata": {
        "source_file": "dao\\藏外\\方壶外史.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 18,
      "original_text": "此中得意须忘象，若究群爻漫役情。 还元图 功夫到此，一句说不得，一字用不着。 金丹就正篇·陆西星 序 予观丹经万卷，其言长生大药，必得先天真乙之气而成。 问气所从来，必曰彼处。 求之夫吾人一身，独无是气，而顾于彼处求之哉？ 信之者未一二，而疑之者已千百矣。 星自早岁即雅志斯道，顾以根钝质愚，未能洞其旨越。 间取《参同》、《悟真》，开卷读之。 荆榛载除，缩涩莫前。 始为注师俞琰，指以清净无为之道。 凡言身外之修，一切斥为旁门； 金鼎火符，悉皆认为炉火。 固守先入，坚不可破。 噫！",
      "translated_text": "Here the meaning must be grasped while the image is forgotten;\nTo exhaust the hexagrams is but to labor the mind in vain.\n\n*Diagram of Returning to the Origin*\n\nAt this stage of practice, not a single phrase can be spoken,\nNot a single word can be employed.\n\n*Preface to \"The Orthodox Chapter on the Accomplished Golden Elixir\" by Lu Xixing*\n\nI have surveyed the ten thousand volumes of elixir scriptures, and all speak of the great medicine of longevity as necessarily formed from the primordial True One’s qi. When asked whence this qi arises, they invariably point to \"that place.\" Yet within our own bodies, is there truly no such qi, that we must seek it elsewhere? Those who believe are few, while those who doubt are legion.\n\nFrom my early years, I, Xixing, have been devoted to this Dao, yet my dull roots and foolish nature prevented me from penetrating its essence. At times, I would take up the *Cantong qi* or *Wuzhen pian*, opening their pages to read—only to find the path overgrown with brambles, the way rough and impassable. Later, I studied under the commentator Yu Yan, who pointed me toward the Dao of purity and non-action. All practices involving cultivation outside the body were dismissed as heterodox paths; the golden crucible and fire talismans were all deemed mere metallurgy. Thus, I clung to my first impressions, unshakably fixed. Alas!",
      "overlap_context": "neither white nor green.” For while the Green Dragon and White Tiger still belong to two families, once they return to the body, they merge into one. Hence it is said to be neither white nor green.\n\nSomeone may ask: “What is the Golden Liquor Returned Elixir?”\nIt is called “returned” because what was lost is regained. It is called “golden liquor” because it is formed by gathering the gold within water, uniting it with one’s own mercury.\n\n**Diagram of the Circulating Fire of the Celestial Cycle**",
      "start_char": 10674,
      "end_char": 10918,
      "start_sentence": 645,
      "end_sentence": 661,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.51253867149353,
      "metadata": {
        "source_file": "dao\\藏外\\方壶外史.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 19,
      "original_text": "果清净，不知下士何以大笑，而谤毁何以易生也。 予读书至此，不能无疑。 嘉靖丁未，偶以因缘遭际，得遇法祖吕公于北海之草堂，弥留款洽，赐以玄醴，慰以甘言。 三生之遇，干载希觌。 既以上乘之道，勉进我人．首言阴阳合而成道。 时则谬举三峰之说，以质于师。 师乃斥之。 问尝授以结胎之歌，入室之旨。 微言奥论，动盈卷帙，笔而藏之。 顾旨其言，而未能畅也。 因循廿载，几负师思。 甲子嘉平，予乃遁于荒野，览镜悲生，二毛侵鬓，慨勋业之无成，知时日之不待。 复感恩师示梦，去彼挂此，遂大感悟，追忆囊所授语，十得八九。 参以契论经歌，反复（左幺右由）绎，寐寐之间，性灵豁畅，恍若有得，乃作是篇。 孔子曰：“温故而知新。 ”今予所温者故也，而所知则新也。 虽一时臆度之言，未敢就正有道，然亦庶几不背吾师之旨乎！ 是岁甲子嘉平月下弦日潜虚子序。 后序 金丹之道，炼己为先。",
      "translated_text": "Indeed, if it were truly pure and still, why would lesser scholars erupt in laughter, and why would slander arise so readily? Reading these words, I could not help but doubt.\n\nIn the dingwei year of the Jiajing era, by some karmic convergence, I chanced upon the Dharma Patriarch Lü in a thatched hall by the Northern Sea. Our stay together was long and our exchange warm; he offered me the dark elixir and consoled me with kind words. Such a meeting across three lifetimes is a rarity of a thousand years. He then urged me forward with the supreme Dao, beginning with the principle that the union of yin and yang constitutes the Way.\n\nAt the time, I foolishly raised the theories of the Three Peaks to question him, only to be rebuked. Yet he once taught me the songs of embryo formation and the essentials of chamber entry. His subtle words and profound discourses filled volumes, which I recorded and preserved. Though I pondered his teachings, I could not yet grasp them fully. Thus, twenty years passed in hesitation, nearly betraying my teacher’s kindness.\n\nIn the jiazi year, during the twelfth lunar month, I retreated to the wilderness. Gazing into a mirror, I lamented the passage of time—my temples streaked with gray—realizing my aspirations remained unfulfilled and that days were slipping away. Then, moved by a dream in which my late teacher appeared, I cast off old attachments and embraced the present. Suddenly, I awakened, recalling eight or nine out of ten of his past instructions. Cross-referencing them with the *Cantong qi*, the *Wuzhen pian*, and other scriptures, I pored over them again and again. In moments of quiet reflection, my nature and spirit became clear, as if I had gained true insight. Thus, I composed this work.\n\nConfucius said, “Reviewing the old, one gains new understanding.” What I have reviewed is the old, yet what I now understand is new. Though these are but my own tentative interpretations, not yet refined by those of the Dao, they may at least not stray from my teacher’s intent.\n\nWritten on the waning moon of the twelfth lunar month in the jiazi year of the Jiajing era by Qianxuzi.\n\n**Postscript**\nIn the Dao of the Golden Elixir, refining the self comes first.",
      "overlap_context": "essence. At times, I would take up the *Cantong qi* or *Wuzhen pian*, opening their pages to read—only to find the path overgrown with brambles, the way rough and impassable. Later, I studied under the commentator Yu Yan, who pointed me toward the Dao of purity and non-action. All practices involving cultivation outside the body were dismissed as heterodox paths; the golden crucible and fire talismans were all deemed mere metallurgy. Thus, I clung to my first impressions, unshakably fixed. Alas!",
      "start_char": 10918,
      "end_char": 11284,
      "start_sentence": 662,
      "end_sentence": 681,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.8224196434021,
      "metadata": {
        "source_file": "dao\\藏外\\方壶外史.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 20,
      "original_text": "己炼则神定，神定则气住，气住则精凝，民安国富，一战而天下定矣。 昔师示我曰； “人能清修百日，皆可以作胎仙。 ”夫百日而情修，片饷而得药。 十月而行火，脱胎神化，改形而仙，顾不易易哉！ 而世卒难其人，此何说也？ 根浅者闻道而不信，学疏者证道而不真。 盲师妄引，指东作西，不辨越燕，焉分苍素？ 间或质以《参同》、《悟真》，未即条析，辄云陈言易得，口诀难逢，别有开关展窍之秘，离形交气之旨。 韧学之士，一聆其言，意在速成，心希侥幸，焚香誓天，赍金固请，片言入耳，肺腑深藏，而《参同》、《悟真》束之高阁矣！ 且夫阴阳同类感应相与之道，顺之则人，逆之则仙。 是皆自然而然，非有巧伪。 岂不闻《悟真》之诗云； ‘休施巧伪为心力。 ”《参同契》云：“自然之所为兮，非有邪伪道。 ”古仙垂语示人，曷尝隐秘？ 然皆绝口不言开关展窍离形交气之说。 而今乃有之，是知蛇足不添，则骏骨无价。 大道之厄，斯人为之也。 磋乎？ 鱼目为珠，燕石为宝。 世人好小术，不审道浅深，独奈何哉？ 昔师示我云：“《参同》、《悟真＞乃入道之阶梯。 ”顾言微旨远，未易剖析，沉潜廿载，始觉豁然。 且夫仆非能心领神悟也，赖玩索之功深，而师言之可证耳。 予既微有所见，不敢自私，辄成是篇，以就正于有道。 虽然此其大略云耳，若夫入室细微之旨，内外火候之详，自有二书者在，予则安敢赘哉！ 予则安敢赘哉！ 潜虚生再述。 上篇",
      "translated_text": "When the self is refined, the spirit settles; when the spirit settles, qi abides; when qi abides, essence congeals. The people find peace, the state grows prosperous, and with a single battle, the world is pacified.\n\nLong ago, my teacher instructed me: *\"If one can cultivate purity for a hundred days, all may become womb immortals.\"* A hundred days of disciplined practice, a moment to obtain the medicine. Ten months of firing, shedding the womb to transform the spirit, altering form to become immortal—how could this not be effortless? Yet in this world, such people are rare. Why is this so?\n\nThose with shallow roots hear the Dao but do not believe; those with scant learning verify the Dao but not truly. Blind teachers mislead, pointing east while calling it west, unable to distinguish Yue from Yan, or blue from white. When occasionally questioned with the *Cantong qi* or *Wuzhen pian*, they fail to analyze them clearly, instead claiming that old words are easily found, but oral secrets are rare—hinting at hidden methods of \"opening the passes and unfolding the apertures,\" or the principles of \"detaching from form to merge with qi.\" Eager students, upon hearing such words, crave swift success and hope for luck. They burn incense, swear oaths to heaven, offer gold to secure their requests. A single phrase enters their ears, lodging deep in their hearts, while the *Cantong qi* and *Wuzhen pian* are left gathering dust on high shelves.\n\nYet the Dao of yin and yang—of resonance between like kinds—when followed, makes one human; when reversed, makes one immortal. All occurs naturally, without artifice. Have you not read the verse in the *Wuzhen pian*: *\"Cease expending cunning and deceit as effort\"*? Or the *Cantong qi*: *\"What is naturally so, not some deviant or false path\"*? The ancient immortals left these words to guide others—when did they ever conceal secrets? Yet they never spoke of \"opening the passes,\" \"unfolding the apertures,\" \"detaching from form,\" or \"merging with qi.\" Now such claims exist—knowing this, one realizes that adding a snake’s legs devalues even a steed’s bones. The peril of the Great Dao lies in such people.\n\nAlas! Fish eyes passed off as pearls, swallow stones as treasures. The world favors petty arts, failing to discern the depth of the Dao. What can be done?\n\nMy teacher once told me: *\"The *Cantong qi* and *Wuzhen pian* are the stairway to entering the Dao.\"* Yet their words are subtle, their meanings profound, not easily dissected. Only after twenty years of deep immersion did I begin to grasp them clearly. And even then, I did not achieve sudden enlightenment through intuition alone—it was through long study and the confirmation of my teacher’s words.\n\nHaving gained some small insight, I dare not keep it to myself. Thus, I compose this work to seek correction from those of the Dao. Yet this is but a broad outline. As for the subtle principles of inner chamber practice, the details of internal and external firing—these are already contained in those two books. How could I presume to add to them? How could I presume to add to them?\n\nWritten again by Qianxuzi. End of the first chapter.",
      "overlap_context": "nsight. Thus, I composed this work.\n\nConfucius said, “Reviewing the old, one gains new understanding.” What I have reviewed is the old, yet what I now understand is new. Though these are but my own tentative interpretations, not yet refined by those of the Dao, they may at least not stray from my teacher’s intent.\n\nWritten on the waning moon of the twelfth lunar month in the jiazi year of the Jiajing era by Qianxuzi.\n\n**Postscript**\nIn the Dao of the Golden Elixir, refining the self comes first.",
      "start_char": 11284,
      "end_char": 11848,
      "start_sentence": 682,
      "end_sentence": 711,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.336103200912476,
      "metadata": {
        "source_file": "dao\\藏外\\方壶外史.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 21,
      "original_text": "或有问于潜虚子曰：“丹经之言先天一气，必于同类求之。 为说者何？ ” 曰：“予闻之师，金丹之道，必资阴阳相合而成。 阴阳者，一男一女也，一离一坎也，一铅一汞也，此大丹之药物也。 夫坎之真气谓之铅，离之真精谓之汞。 先天之精积于我，先天之气取于彼。 何以故？ 彼，坎也，外阴而内阳，于象为水为月，其于人也为女； 我，离也，外阳而内阴，于象为火为日，其于人也为男，故夫男女阴阳之道，顺之而生人，逆之而成丹，其理一焉者也。 ” 曰：“坎为中男，离为中女，《易》固言之矣。 而此谓我反为离又何也？ ” 曰：“此先天图位之说也。",
      "translated_text": "One asked Master Qianxu: \"The alchemical classics speak of the primordial unity of *qi*, which must be sought among those of the same kind. What does this mean?\"\n\nHe replied: \"I have heard from my teacher that the Way of the Golden Elixir necessarily relies on the union of *yin* and *yang* to take form. *Yin* and *yang*—one male, one female; one *li*, one *kan*; one lead, one mercury—these are the ingredients of the Great Elixir. The true *qi* of *kan* is called lead; the true essence of *li* is called mercury. The primordial essence is stored within me, while the primordial *qi* is drawn from the other. Why is this so? The other is *kan*—externally *yin* yet internally *yang*; in imagery, it is water and the moon, and in humanity, it is woman. I am *li*—externally *yang* yet internally *yin*; in imagery, it is fire and the sun, and in humanity, it is man. Thus, the Way of *yin* and *yang* between man and woman, when followed, gives birth to human life; when reversed, it produces the Elixir. The principle is one and the same.\"\n\nThe questioner said: \"*Kan* is the middle son, and *li* is the middle daughter—this the *Book of Changes* has already made clear. Yet why do you now say that I am instead *li*?\"\n\nHe replied: \"This refers to the arrangement of the *xiantian* (precelestial) diagram.\"",
      "overlap_context": "rough long study and the confirmation of my teacher’s words.\n\nHaving gained some small insight, I dare not keep it to myself. Thus, I compose this work to seek correction from those of the Dao. Yet this is but a broad outline. As for the subtle principles of inner chamber practice, the details of internal and external firing—these are already contained in those two books. How could I presume to add to them? How could I presume to add to them?\n\nWritten again by Qianxuzi. End of the first chapter.",
      "start_char": 11849,
      "end_char": 12108,
      "start_sentence": 712,
      "end_sentence": 726,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.286509990692139,
      "metadata": {
        "source_file": "dao\\藏外\\方壶外史.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 22,
      "original_text": "邵子曰：‘阴阳之精，互藏其宅。 ’且夫太极分而两仪，两仪而四象，四象而八卦，则离属之乾，而坎属之坤矣。 离坎者，乾坤之交而成卦者也，男女者，阴阳之交而成质者也。 故乾坤交，则乾不得不虚而成离，坤不得不实而成坎矣； 男女交则阴不得不含夫阳，而阳不得不根夫阴矣。 此坎离彼我之别也。 ” 曰：“然则离之中为阴精，坎之中为阳气，吾之一身，岂无精气而顾取之于彼乎？ ” 曰：“诚有之，未竟其说也。 吾尝没溺于玉吾老叟之论，而今始悟。 子请静听，吾试言之。 闻之师曰：‘阴阳二五，妙合而凝。 ’而人生焉，其始也，太朴未雕，浑然太极之全体。 老子曰：‘含德之厚，比于赤子。 ’未知牝牡之合而（左血右峻去山）作，精之至也； 终日号而嗌不嘎，和之至也。 是阴阳之纯也。 斯时也，先天之体浑沦完固，何假于取，何事于填？ 得而修之，则无为之上德又何加焉？ 及夫情窦一开，阴阳交感，则先天之气，乃奔蹶而逸于坤中。 故三画纯乾乃破其体而为离。 离为日，日昃之离，大耋之嗟矣，能久视乎？ 故丹法取坎。 取坎者，补其既破之乾也，填其既虚之画也，复其纯阳之体也。 此神仙还丹之说也。 ”",
      "translated_text": "Shaozi said: \"The essence of *yin* and *yang* mutually dwell within their abodes.\"\n\nMoreover, the Supreme Ultimate divides into the Two Modes, the Two Modes into the Four Images, and the Four Images into the Eight Trigrams—thus *li* pertains to *qian*, and *kan* pertains to *kun*. *Li* and *kan* are the trigrams formed by the union of *qian* and *kun*; man and woman are the physical forms produced by the union of *yin* and *yang*. Therefore, when *qian* and *kun* unite, *qian* cannot but become hollow and form *li*, while *kun* cannot but become replete and form *kan*. When man and woman unite, *yin* cannot but contain *yang*, and *yang* cannot but root itself in *yin*. Such is the distinction between *kan* and *li* as self and other.\n\nThe questioner said: \"If the center of *li* is *yin*-essence and the center of *kan* is *yang*-*qi*, then within my own body, how can there be no essence and *qi* that I must instead seek from the other?\"\n\nHe replied: \"Indeed, this is so, but the explanation is incomplete. I once drowned in the teachings of the Old Man of Jade Chamber, and only now have I awakened. Pray listen in silence, and I shall attempt to explain.\n\nI have heard from my master: '*Yin* and *yang*, the two fives, wondrously unite and congeal'—thus is a person born. In the beginning, the Great Simplicity remains uncarved, the undifferentiated whole of the Supreme Ultimate. Laozi said: 'One whose virtue is profoundly replete is like a newborn babe.' Unaware of the union of male and female, yet the genitals stir—such is the perfection of essence. Though it cries all day, its throat does not grow hoarse—such is the perfection of harmony. This is the purity of *yin* and *yang*. At this time, the precelestial body remains whole and complete—what need is there to seek, what purpose to replenish? If one attains and cultivates this, what more can be added to the supreme virtue of non-action?\n\nYet when the aperture of desire opens and *yin* and *yang* interact, the precelestial *qi* flees and scatters into *kun*. Thus, the three unbroken lines of pure *qian* break their form and become *li*. *Li* is the sun; when the sun declines, one sighs at advanced age—how can it endure for long? Therefore, the elixir method takes from *kan*. To take from *kan* is to mend the already broken *qian*, to fill its hollowed line, and to restore the body of pure *yang*. This is the teaching of the immortals' returning elixir.\"",
      "overlap_context": "magery, it is fire and the sun, and in humanity, it is man. Thus, the Way of *yin* and *yang* between man and woman, when followed, gives birth to human life; when reversed, it produces the Elixir. The principle is one and the same.\"\n\nThe questioner said: \"*Kan* is the middle son, and *li* is the middle daughter—this the *Book of Changes* has already made clear. Yet why do you now say that I am instead *li*?\"\n\nHe replied: \"This refers to the arrangement of the *xiantian* (precelestial) diagram.\"",
      "start_char": 12108,
      "end_char": 12569,
      "start_sentence": 727,
      "end_sentence": 753,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.49943208694458,
      "metadata": {
        "source_file": "dao\\藏外\\方壶外史.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 23,
      "original_text": "曰：“我之为离也，乃自奔蹶之后而得之。 彼未奔蹶则固坤也，其以为坎，又何也” 曰：“善哉问！ 浑沦之初，彼固坤体二七之期有阳动焉。 纯坤之中忽有阳动，非坎乎？ 故坎者，阴中之阳，乃太极之静极而动，自然而然，谓之先天。 天一生水，真乙之气藏于坎中。 母隐子胎，水中有金。 欲造金丹，法当取坎。 此产药之川源，而登真之梯筏也。 且夫阴中之阳，以动为主，故取坎之期，惟侦其动； 阳中之阴，以静为主，故填离之后，致养于静。 知动知静而不失其时者，其惟圣人乎？ 圣人者，观天之道，而执天之行者也。 是故，月盈亏象药材之老嫩，日早晚为火候之消息。 药火相得而丹成。 丹成斯脱胎而神化也。 ” 或又曰：“子之所论皆后天也。",
      "translated_text": "He asked, \"As *li*, I am what is attained only after the scattering and fleeing. Before that scattering, it was originally *kun*—why then is it called *kan*?\"\n\nHe replied, \"Excellent question! In the primordial state of undifferentiated wholeness, that which was originally the body of *kun* experienced the stirring of *yang* at the two-sevens' appointed time. When *yang* suddenly moves within pure *kun*, is this not *kan*? Thus, *kan* is the *yang* within *yin*—the stillness of the Supreme Ultimate reaching its extreme and giving rise to movement, arising spontaneously and naturally. This is called the precelestial. 'Heaven engenders water in the first,' and the true *yi* qi is concealed within *kan*. The mother hides the child in her womb; within water lies metal. To forge the golden elixir, one must draw from *kan*. This is the source of the medicine's river and the ladder for ascending to true realization.\n\nMoreover, the *yang* within *yin* takes movement as its essence, so when drawing from *kan*, one must await its stirring. The *yin* within *yang* takes stillness as its essence, so after filling *li*, one must nurture it through stillness. Those who know movement and stillness and do not miss their proper times—are they not sages? Sages observe the Dao of Heaven and grasp the workings of Heaven. Thus, the waxing and waning of the moon mirror the maturity or tenderness of the medicinal ingredients, while the early and late hours of the sun correspond to the ebb and flow of the firing times. When medicine and fire are harmoniously aligned, the elixir is completed. Once the elixir is complete, one sheds the womb and undergoes spiritual transformation.\"\n\nAnother then asked, \"All that you have discussed pertains to the postcelestial.\"",
      "overlap_context": " desire opens and *yin* and *yang* interact, the precelestial *qi* flees and scatters into *kun*. Thus, the three unbroken lines of pure *qian* break their form and become *li*. *Li* is the sun; when the sun declines, one sighs at advanced age—how can it endure for long? Therefore, the elixir method takes from *kan*. To take from *kan* is to mend the already broken *qian*, to fill its hollowed line, and to restore the body of pure *yang*. This is the teaching of the immortals' returning elixir.\"",
      "start_char": 12570,
      "end_char": 12866,
      "start_sentence": 754,
      "end_sentence": 772,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.712910413742065,
      "metadata": {
        "source_file": "dao\\藏外\\方壶外史.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 24,
      "original_text": "其在先天，抑有可言者乎？ ” 曰：“吾尝因是而求之《易》矣。 《易》曰：‘精气为物，游魂为变。 ’夫阴中之阳，其名曰气； 阳中之阴，其名曰精。 二者相须。 而物生焉。 尝观顺行之道矣，精先至而气后随，则阴包乎阳而成女； 气先倡而精后随，则阳包乎阴而为男。 然则离男坎女之辩，又不待于成质之后，而已预定于受气之初矣。 且夫金丹之道，阴阳相合而成者也。 人道顺施，仙道逆取，取药于坎，而造丹于离也。 又何疑乎？ ” 中篇 或问：“吾人四大一身，皆属阴也。 有时而动，将不属之阳乎？ ” 曰：“离为火为日，动虽属阳，而实根于阴也。 故曰火阳根阴。 观夫灵光闪烁莫可控制，吾身之阳，亦复如是。 是以常有奔蹶之患。 圣人知其如此，故取坎中真乙之水，以克制之。 故夫情炽于中，精逸于外，犹火炎于下，而水沸于釜也。 取彼先天真乙之气，伏我奔蹶易逸之精，犹之酌泉于瓮，而救沸于釜也，靡不济矣。 ”“然则取坎之法，亦有可言者乎？ ” 曰：“天机至閟，非得师旨，孰敢妄言？ 请启其端，俟吾子悟焉。 在《易》，雷在地中，于卦为复。 夫地势重阴之中，而忽有阳动，此造化之根柢，而品汇之枢纽也。 孔子玩《易》至此，不觉叹曰：‘复其见天地之心乎！ ’《契》亦有之，故易统天心，复卦建始初。 又曰； ‘发号顺节令，勿失爻动时。 ’盖言此也。 故夫知雷在地中而成复，则知阳生于阴而真乙之气之藏于彼也。 可不言而喻矣！ ”",
      "translated_text": "As for the prenatal—might there yet be something worth discussing?\"\n\nHe replied, \"I have sought its principles within the *Book of Changes*. The *Changes* states: ‘Essence and qi become things; the wandering soul brings transformation.’ Within *yin*, that which is *yang* is called *qi*; within *yang*, that which is *yin* is called *essence*. These two depend upon each other, and thus things are born. Observing the course of sequential generation, if essence arrives first and *qi* follows after, then *yin* envelops *yang* and a female is formed; if *qi* leads and essence follows, then *yang* envelops *yin* and a male is born. Thus, the distinction between *li* as male and *kan* as female is not determined only after form is complete, but is already predetermined at the moment of receiving *qi*.\n\nMoreover, the Dao of the Golden Elixir is formed through the union of *yin* and *yang*. The human path follows the natural order, while the immortal path reverses the process—extracting the medicine from *kan* and refining the elixir within *li*. What doubt could remain?\"\n\n---\n\nIn the middle section, someone asked, \"Our four great elements and this body are all of *yin*—yet when they move, do they not belong to *yang*?\"\n\nHe replied, \"*Li* is fire, the sun; though its movement belongs to *yang*, it is in truth rooted in *yin*. Thus it is said: fire is *yang* rooted in *yin*. Observe how the radiant light flashes uncontrollably—so too is the *yang* within our bodies. Hence, it is ever prone to reckless dissipation. The sage, knowing this, draws the true *yi* water from *kan* to restrain it. When passions blaze within and essence flees without, it is like fire raging below and water boiling in the cauldron. Drawing that prenatal true *yi* qi to subdue one’s reckless, wayward essence is like ladling spring water into a jar to quell the boiling in the cauldron—nothing is left unaccomplished.\"\n\n\"Then might the method of extracting from *kan* also be discussed?\"\n\nHe said, \"The celestial mechanism is most profound; without the master’s guidance, who would dare speak recklessly? Let me but open the gate—may you come to understand.\n\nIn the *Book of Changes*, thunder lies within the earth, forming the hexagram *Fu* (Return). Within the heavy *yin* of earth, *yang* suddenly stirs—this is the root of creation and the pivot of all things. Confucius, pondering the *Changes* to this point, could not help but sigh: ‘In *Fu*, do we not see the heart of Heaven and Earth?’ The *Cantong Qi* also speaks of this, saying: ‘The *Changes* governs the heart of Heaven; the hexagram *Fu* establishes the beginning.’ It further states: ‘Issue commands in accord with the seasons; do not miss the moment when the lines move.’ This is what it means.\n\nThus, knowing that thunder within the earth forms *Fu*, one knows that *yang* is born from *yin* and that the true *yi* qi is concealed therein. What need is there to say more?\"",
      "overlap_context": "serve the Dao of Heaven and grasp the workings of Heaven. Thus, the waxing and waning of the moon mirror the maturity or tenderness of the medicinal ingredients, while the early and late hours of the sun correspond to the ebb and flow of the firing times. When medicine and fire are harmoniously aligned, the elixir is completed. Once the elixir is complete, one sheds the womb and undergoes spiritual transformation.\"\n\nAnother then asked, \"All that you have discussed pertains to the postcelestial.\"",
      "start_char": 12866,
      "end_char": 13440,
      "start_sentence": 773,
      "end_sentence": 812,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.833709239959717,
      "metadata": {
        "source_file": "dao\\藏外\\方壶外史.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 25,
      "original_text": "或又曰：“药之生也，丹经每以三日出庚为喻，可得闻乎？ ” 曰：“坎为月，月为太阴，受日之光以生明。 三日出庚，阳始萌也。 亦如复卦。 八日上弦，遍临二阳，东方盛满，三阳开泰。 下弦，则阳之衰也； 月晦，则阳之尽也。 剥复相寻，终则有始。 故三日而复苏。 彼之造化，亦复如是。 丹法象此，以侦药材之老嫩。 师示我曰：‘月夕炉中药。 ’又曰：‘雪映冰潭，了净梅梢新月，始可药生。 天机玄妙，尽泄于此。 ’吾昔旨其言而不能畅也。 今则恍然以悟，乃知师恩深重，昭昭乎若揭日月而赐之视也。 ” 曰：“药材老嫩，其用之也奈何”",
      "translated_text": "One might further ask: “In the growth of the elixir medicine, the alchemical classics often compare it to the ‘third day emerging from *geng*’—may I hear of this?” I reply: “*Kan* is the moon, and the moon is the Great *Yin*, which receives the sun’s light to generate brightness. On the third day emerging from *geng*, *yang* first sprouts—this is like the hexagram *Fu*. On the eighth day, the first quarter moon arrives, with two *yang* lines ascending; the eastern direction is full and abundant, and the three *yang* lines open into prosperity. The last quarter moon marks the decline of *yang*; the new moon marks its exhaustion. *Bo* (Splitting Apart) and *Fu* (Return) follow one another in endless succession, for an end is always a beginning. Thus, after three days, revival occurs. The workings of creation are just like this. The method of the elixir takes this as its model, using it to gauge the maturity or tenderness of the medicinal ingredients. My teacher instructed me, saying: ‘On the evening of the new moon, the medicine is in the crucible.’ He also said: ‘When snow gleams on the icy pool, and the plum branches bear the new moon in perfect clarity—only then may the medicine begin to grow.’ The celestial mechanism is profoundly subtle, and here it is fully revealed. In the past, I grasped the meaning of his words but could not fully comprehend them. Now, I suddenly understand, and I realize the depth of my teacher’s grace—luminous as the sun and moon held forth to grant me sight.”\n\nOne asks: “As for the maturity or tenderness of the medicinal ingredients, how are they to be used?”",
      "overlap_context": "In *Fu*, do we not see the heart of Heaven and Earth?’ The *Cantong Qi* also speaks of this, saying: ‘The *Changes* governs the heart of Heaven; the hexagram *Fu* establishes the beginning.’ It further states: ‘Issue commands in accord with the seasons; do not miss the moment when the lines move.’ This is what it means.\n\nThus, knowing that thunder within the earth forms *Fu*, one knows that *yang* is born from *yin* and that the true *yi* qi is concealed therein. What need is there to say more?\"",
      "start_char": 13441,
      "end_char": 13691,
      "start_sentence": 813,
      "end_sentence": 831,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.96282696723938,
      "metadata": {
        "source_file": "dao\\藏外\\方壶外史.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 26,
      "original_text": "曰：“金丹造化，乃先天真乙之气而成。 先天之气，轻清未形，乃阳中之阳也。 其端甚微，而其妙莫测。 故急采于癸生之韧，而用之以一守之顷。 稍迟则生滓而度于后天，是又阳而反变为阴矣。 《悟真》之诗曰‘见之不可用’，盖言老也； ‘一霎火烟飞，真人自出现’，盖言速也。 噫！ 造化之妙，非圣人孰能知之哉？ ！ 亦非圣人孰能用之哉？ ！ ” 下篇 或问：“造化之妙，自非圣人莫能用。 吾辈非圣人也，伊欲用之，其要安在” 曰：“师不云乎：‘真土擒真铅，真铅制真汞。 ’真土者何？ 己土是也。 采药之士，不炼己土，则灵汞易失，而所作无功，反遭困辱矣。 《经》曰‘筑基炼己’，盖言此也。 己之为物，于人为意，亦曰己性。 以其周游于四象之中而无定位，故名之曰土。 金丹始终，皆籍于此。 故炼药求铅，以己迎之； 收火入鼎，以己送之； 烹炼沐浴，以己守之； 温养脱胎，以己成之。 正心诚意，则身修国治而天下平矣。 此炼丹之枢要也。 《契》曰； ‘运谷正轴。 ’又曰； ‘辰极处正。",
      "translated_text": "“Gold elixir’s transformation is formed from the primordial True Unity’s qi. This primordial qi is light and pure, formless—yang within yang. Its inception is most subtle, its wonder unfathomable. Thus, one must swiftly gather it at the first stirrings of *gui*-born vitality, using it within the span of a single vigil. Even a slight delay allows dross to arise and shifts it into the postnatal, where yang reverts to yin. The *Wuzhen* poem says, ‘Seen yet unusable’—this speaks of overmaturity; ‘In a flash of fire and smoke, the True Person appears’—this speaks of speed. Alas! The wonder of transformation—who but a sage could know it? Who but a sage could wield it?”\n\nIn the following section, one asks: “The wonder of transformation is such that none but a sage can wield it. We are no sages—if one wishes to employ it, where lies the essential key?”\n\nThe master replies: “Did not your teacher say, ‘True earth seizes true lead; true lead governs true mercury’? What is true earth? It is the self’s earth. Those who gather the medicine yet do not refine their self’s earth will easily lose the numinous mercury, and their efforts will come to naught, bringing only hardship and humiliation. The *Classic* says, ‘Lay the foundation, refine the self’—this is what it means. The self, as a thing, is in man the will, also called the self-nature. Because it roams through the four images without fixed position, it is named ‘earth.’ The gold elixir’s entire process depends upon this. Thus, when refining the medicine to seek lead, one meets it with the self; when drawing fire into the crucible, one escorts it with the self; when simmering and bathing, one guards it with the self; when nurturing and delivering the embryo, one perfects it with the self. Rectify the heart and sincerely align the will, and the body is cultivated, the state governed, and all under heaven made peaceful. This is the pivot of elixir refinement. The *Canticle* says, ‘Turn the grain at the true axle.’ It also says, ‘The pole star abides in correctness.’”",
      "overlap_context": " and the plum branches bear the new moon in perfect clarity—only then may the medicine begin to grow.’ The celestial mechanism is profoundly subtle, and here it is fully revealed. In the past, I grasped the meaning of his words but could not fully comprehend them. Now, I suddenly understand, and I realize the depth of my teacher’s grace—luminous as the sun and moon held forth to grant me sight.”\n\nOne asks: “As for the maturity or tenderness of the medicinal ingredients, how are they to be used?”",
      "start_char": 13692,
      "end_char": 14100,
      "start_sentence": 832,
      "end_sentence": 865,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.13347601890564,
      "metadata": {
        "source_file": "dao\\藏外\\方壶外史.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 27,
      "original_text": "’古仙垂语，叮咛告城，不一而足。 “且夫父母以情欲而生我，故气质之性每遇物而生情焉。 苟炼己无功，六根未定，人室之顷，大用现前，性动情炽，姹女逃亡，又安能以一符之顷而夺骊龙之珠于颔下哉？ 《传》有之曰：‘探虎穴，捋虎须，几不免虎口哉？ 危乎！ 危乎！ 非大智慧不足以破此，非大力量不足以得此。 ’师示我曰：‘入头镜，在汝心，心不虚兮境不真。 ’噫嘻！ 虚心之旨，其炼己之要乎？ 《清净经》云：‘内观其心，心无其心； 外观其形，形无其形； 远观于物，物无其物。 三者既悟，惟见于空。 所空既无，无无亦无。 ’此虚心之谓。 炼己之大解脱、大休歇也。 故下文继之曰：‘常静常应。 ’呜呼！ 常静者，其炼己之验； 而常应者，其求铅之用乎！ 师示我云：‘月夕炉中药。 ’命对之，子茫然未有以应也。 复自对云：‘风花座上灰。",
      "translated_text": "“Ancient immortals left their teachings, earnest and repeated without end.\n\nMoreover, parents give birth to me through passion and desire, thus the nature of temperament ever meets things and generates emotion. If refining the self proves ineffectual, the six roots remain unsettled; at the moment of entering the chamber, when great function appears before one, nature stirs and passion blazes, the maiden of mercury flees—how then can one seize the black dragon’s pearl from beneath its chin in the span of a single talisman?\n\nThe *Tradition* states: ‘To probe the tiger’s den, to pluck the tiger’s whiskers—how could one nearly escape the tiger’s jaws?’ Dangerous! Dangerous indeed! Without great wisdom, this cannot be broken; without great power, this cannot be attained.’\n\nMy master instructed me: ‘The mirror at the entrance lies within your heart. When the heart is not empty, the realm is not true.’\n\nAlas! Is the principle of emptying the heart not the essential point of refining the self?\n\nThe *Sutra of Purity* says:\n‘Look within at the heart—there is no heart;\nLook without at the form—there is no form;\nLook afar at things—there are no things.\nWhen these three are awakened to, only emptiness is seen.\nWhen the emptied is itself empty, even emptiness is no more.’\n\nThis is what emptying the heart means—the great liberation, the great repose of refining the self. Thus the following text continues: ‘Ever still, ever responsive.’\n\nAh! Ever still—this is the verification of refining the self; ever responsive—this is the function of seeking lead!\n\nMy master instructed me: ‘The medicine in the crucible on a moonlit night.’ I was commanded to respond, yet I was at a loss, unable to answer. Then I replied of my own accord: ‘Ashes on the seat of wind and flowers.’”",
      "overlap_context": "ets it with the self; when drawing fire into the crucible, one escorts it with the self; when simmering and bathing, one guards it with the self; when nurturing and delivering the embryo, one perfects it with the self. Rectify the heart and sincerely align the will, and the body is cultivated, the state governed, and all under heaven made peaceful. This is the pivot of elixir refinement. The *Canticle* says, ‘Turn the grain at the true axle.’ It also says, ‘The pole star abides in correctness.’”",
      "start_char": 14100,
      "end_char": 14437,
      "start_sentence": 866,
      "end_sentence": 889,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.040788412094116,
      "metadata": {
        "source_file": "dao\\藏外\\方壶外史.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 28,
      "original_text": "’夫留连光景者，每以风花雪月为四胜。 对境生情，应接不暇。 而师一切拟之为座上之灰，非忘己忘物面忘忘者乎？ 采药之符，炼己之要，师示我者至矣。 予昔旨其言而今畅之也。 ”或闻之跃然起曰：“微子之言，吾终不闻大道之要，请塞子兑，吾退而炼已。 ” 七破论·陆西星 破非论 陆子既闻性命之学于圣师，四方之士，有就陆子而参道者。 坐而与之言，不契，往复与之辩。 或有非之者，曰：“老圣有言：‘知者不言，言者不知。 善者不辩，辩者不善。 ’今吾子之与人论道也，口喋喋焉不能置，无乃费于辞而伤于德乎？ ”曰：“某有罪。 请为子解之。 昔者杨、墨充塞仁义，孟子辞而辟之。 公孙丑曰：‘外人皆称夫子好辩，敢问何也？ ’孟子曰：‘予岂好辩哉？ 予不得已也！ ’且夫大道之世，人无异言，士无异学，故圣人者，与天下相忘于无言。 天下未必能尽如圣人之意，则圣人有忧之，故不得已而立之言。 若乃《阴符》、《道德》、《参同》、《悟真》，皆圣人证道之左券。 所以仁天下万世于无穷者也。 乃有狂师瞽人，不能祖述圣经，理会文字，师心任臆，而以其说蛊惑于天下，则其败坏人心，淆乱正道，为祸孰甚焉？ 譬则大明不照之地，山魈野狐牵人于山谷之中，苟有见焉，必将狂呼尽力而逐之，恐入之迷惑以死而莫之觉也，又焉能隐情惜已缄结而不言乎？ 若乃以自见自是好胜好辩而罪予，则予之不白于人也久矣！ ” 破伪论 世人好小术，不审道浅深，是以狂夫伪人，得以行其无所忌惮之术。 盖以玄理幽深，不能洞究，心无所主，是以轻信而易惑。 即以世之伪术，略举其概。 或炮孕妇之胎以辟谷，或服砒硫之药以御寒，或用铅剑以开关，或养灵龟而展缩，或摇肩脊而淅沥有声，或击头颅而铿訇相应，或垒坐如石，或鼓腹如雷，或倒挂如猿，或曲睡如龙，或轻旋如风，而屏气不息，或疾行如猱而健步莫追。 如此之类，难以枚举，求诸至道，了不相关。 类皆逞其顽技以文神奸，止司马真人所谓“巧蕴机心，以干时利”。 而外丹炉火，为伪尤甚。 盖银精附体，亦可交易金石，而追摄之法，世多有之。 学人不知，信为点化。 误矣！",
      "translated_text": "“Those who linger amid fleeting scenes often prize the four splendors of wind, flowers, snow, and moon. Confronted by circumstances, they give rise to emotions, endlessly occupied in response. Yet my master likens all such things to ashes upon the seat—is this not the state of forgetting the self, forgetting things, and even forgetting the act of forgetting?\n\nThe tally for gathering the medicine and the essentials of refining the self—what my master revealed to me is most profound. I once dimly grasped his words, and now I fully comprehend them.”\n\nUpon hearing this, someone leapt up and exclaimed: “Without your words, I would never have heard the essentials of the great Dao. I beg to stop my ears to you; I shall withdraw to refine myself.”\n\n*Seven Refutations* by Lu Xixing\n*Refutation of the Critique of Non-Refutation*\n\nAfter Lu received the teaching of *xingming* from his sagely master, scholars from all directions came to him to inquire into the Dao. When he sat and spoke with them, if they did not resonate, he would engage in repeated debate.\n\nSome criticized him, saying: “The ancient sages declared: ‘Those who know do not speak; those who speak do not know. Those who are good do not debate; those who debate are not good.’ Now, sir, as you discourse on the Dao with others, your mouth cannot rest—is this not wasteful of words and harmful to virtue?”\n\nLu replied: “I am at fault. Allow me to explain. In former times, Yang and Mo filled the world with their doctrines, obscuring benevolence and righteousness, and Mencius refuted them with words. Gongsun Chou asked: ‘Others all say you delight in debate—may I ask why?’ Mencius replied: ‘How could I delight in debate? I have no choice!’\n\nMoreover, in an age when the great Dao prevails, people do not hold divergent views, and scholars do not pursue divergent teachings. Thus, the sage blends with the world in wordless harmony. Yet if the world cannot fully align with the sage’s intent, the sage grows concerned and is compelled to speak. Texts such as the *Yinfu*, *Daode*, *Cantong*, and *Wuzhen* are all the sage’s authenticated vouchers of the Dao—means to bring boundless benevolence to the world for all generations.\n\nYet there are blind and reckless teachers who, unable to follow the sacred scriptures or comprehend their texts, rely on their own whims to concoct teachings that bewilder the world. Their corruption of human hearts and confusion of the true Dao—what could be more disastrous? It is like a place untouched by the great light, where mountain goblins and wild foxes lure people into valleys. If one witnesses this, one must cry out and drive them away with all one’s strength, lest others fall into delusion and perish unawares. How could one conceal the truth and spare oneself from speaking?\n\nIf, however, you accuse me of self-regard, obstinacy, competitiveness, or delight in debate, then I have long since failed to clear my name before others.”\n\n*Refutation of Falsehoods*\n\nPeople of the world favor petty arts without discerning the depth of the Dao, allowing reckless and deceitful individuals to practice their unscrupulous techniques. Since the profound principles of the mysterious are difficult to fathom, and their hearts lack grounding, they are easily swayed and deceived. Let me briefly outline some of these false arts:\n\nSome roast the fetus of a pregnant woman to practice grain avoidance; some ingest arsenic or sulfur to ward off cold; some wield lead swords to open the passes; some cultivate the “spirit turtle” to extend and retract; some shake their shoulders and spine to produce a rustling sound; some strike their skulls to produce a resonant echo; some sit motionless as stone; some drum their bellies like thunder; some hang upside-down like apes; some curl up like dragons; some spin lightly like the wind while holding their breath; some run swiftly as monkeys, leaving no one able to keep pace. Such practices are too numerous to list, yet they bear no relation to the ultimate Dao. They are merely displays of stubborn skill to embellish cunning—what Master Sima called “cleverly harboring schemes to seek worldly gain.”\n\nAmong these, the false arts of external alchemy and furnace fire are the most egregious. While silver essence can adhere to the body and be exchanged for minerals, methods of summoning and absorption abound in the world. Unaware learners mistake these for transmutation. How mistaken they are!”",
      "overlap_context": "This is what emptying the heart means—the great liberation, the great repose of refining the self. Thus the following text continues: ‘Ever still, ever responsive.’\n\nAh! Ever still—this is the verification of refining the self; ever responsive—this is the function of seeking lead!\n\nMy master instructed me: ‘The medicine in the crucible on a moonlit night.’ I was commanded to respond, yet I was at a loss, unable to answer. Then I replied of my own accord: ‘Ashes on the seat of wind and flowers.’”",
      "start_char": 14437,
      "end_char": 15268,
      "start_sentence": 890,
      "end_sentence": 928,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.707021474838257,
      "metadata": {
        "source_file": "dao\\藏外\\方壶外史.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 29,
      "original_text": "误矣！ 其次则丁打腾挪，对面为盗，呼鹿作马而主不知，以羊易牛而人不觉。 又其次者，盲烧瞎炼，耗火亡财，玩日惕时，阁有成效。 匪道误人，人不审道故也。 呜呼！ 不审道之浅深而称好道，不识师之真伪而称遇师，遂使狂夫伪人，抗颜居先，挺身纳拜，为愧孰甚焉？ 予故着为此论，凡我同志好道之伦，珍重珍重，早息妄心，早求真谛，吾鞭不可得也。 破执论 夫物之瓜果，与食之酰酒之类，凡破其体启其幂者，皆变坏而不能久。 破体之人，亦犹是也。 圣人知其如此，故求其所谓先天真乙者以补之。 而今之论先天者，不过自吾已破之身，关键而固密之，攒簇而和合之，以求真乙之生，以为长生久视之道。 不知真体既破，则吾身中所有精、气与神，皆日改月化而入于后天。 真乙之气，其能全乎？ 是犹藏已坏之瓜果，幂已启之酒酰，求其无坏，岂不难矣！ 此理甚明，人所易晓。 近取诸身，远取诸物，罕譬而喻者也。",
      "translated_text": "Alas, how mistaken! Next are those who engage in acrobatic leaps and dodges, stealing openly before one’s eyes—calling a deer a horse while the master remains unaware, substituting a sheep for an ox without others noticing. Still worse are the blindly burning and reckless refining, squandering fire and wasting wealth, idling away days and months in vain expectation, yet never achieving success. It is not the Way that misleads people, but people who fail to examine the Way.\n\nAlas! Without discerning the depth of the Dao, they claim to love it; without recognizing the authenticity of a teacher, they claim to have met one. Thus, madmen and charlatans boldly take the lead, while earnest seekers prostrate themselves in reverence—what greater shame could there be? For this reason, I have written this discourse. To all my fellow aspirants who cherish the Dao: take heed, take heed! Cease your deluded pursuits early, seek the true essence early—for my whip is not to be had.\n\n**On Shattering Attachments**\n\nConsider the nature of things: fruits and melons, or foods and wines sealed in jars—once their forms are broken or their coverings opened, all decay and cannot endure. The human body, once broken, is no different. The sages, understanding this, sought what is called the *precelestial true unity* to restore it.\n\nYet those who now discourse on the precelestial merely attempt to seal and secure their already broken bodies, to gather and harmonize their fragmented selves, hoping to generate the *true unity* and thereby attain the Way of longevity and enduring vision. They do not realize that once the true form is broken, the essence, qi, and spirit within the body all transform day by day, month by month, descending into the postcelestial. How can the qi of *true unity* remain whole? It is like storing spoiled fruits or wine whose seal has been opened, yet expecting them not to decay—how could this not be difficult?\n\nThis principle is perfectly clear, easily understood by all. Whether drawing from the body near at hand or things far away, few analogies are needed to make it plain.",
      "overlap_context": " numerous to list, yet they bear no relation to the ultimate Dao. They are merely displays of stubborn skill to embellish cunning—what Master Sima called “cleverly harboring schemes to seek worldly gain.”\n\nAmong these, the false arts of external alchemy and furnace fire are the most egregious. While silver essence can adhere to the body and be exchanged for minerals, methods of summoning and absorption abound in the world. Unaware learners mistake these for transmutation. How mistaken they are!”",
      "start_char": 15268,
      "end_char": 15636,
      "start_sentence": 929,
      "end_sentence": 945,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.465876817703247,
      "metadata": {
        "source_file": "dao\\藏外\\方壶外史.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 30,
      "original_text": "还丹之道，载诸丹经，学者不能熟读而详味之，独以一言半句，出口入耳，自谓真传实诣，至于终身执迷，独修一物而莫之悟，可哀甚也！ 予悯此徒，故着是论。 古仙有云：“形以道全，命以术延。 ”今论道者比比，术在何处？ 请试思之。 破邪论 今之论同类者，其说不一，予皆举之。 九一之术，邪勿论矣。 其有先天梅子之说，影响形似。 或有可听，然皆有形渣质之物，实与世之红铅异名而同事。 以之为道，恐或未然。 至于离形交气之说．须田两窍之说，开关铸剑之说，上进下进之说，或反经而为蟠桃，或含枣而饮甘露，或碎磁酿铁而为酒浆，或取男女淫液而和曲蘖，或配秋石而称人元。 如是之为．种种不一，类皆邪师曲学，以盲引盲，穷年皓首，迄无成功，以至败德祸身，为世嗤笑，大可怜也！ 且夫先天之气，来自虚无，视之不可见，听之不可闻，博之不可得。 如上揣摩钩致，多方索取，则去之愈远矣！ 所谓浮沉铢两，今复何在？ 以予所闻，真若熏莸异味，不可同器而藏。 老子云：“夫惟无知，是以莫我知。 ”使天下有知言之人，则吾道不孤矣。 破疑论 或疑：“占语有云：‘一言半句便通玄，何用丹经千万篇？ ’言陈言之不足贵也。 而夫子教人多读丹经，使之洞晓阴阳，深达造化，得无玩日（左忄右曷）时，而以闻见自障其心？ 吾得师旨，则一言半句，可以循之而入，奚以多读为哉？ ”曰：“子之言谈是矣。 不知道有邪正，师有真伪。 吾子素非法眼，将何自而辨之？ ”譬之欲试金者必以石。 丹经者，时师之试石也。 不能精思熟读，而徒以一言半句，师人以求道，其不入于邪宗而惑于异说者无几矣！ 昔人有欲之京师者，问道于途，途之人口口不一也。 其人惧不敢往。 一日之坊间见途籍焉，于是执籍以往，所言栖泊之处，鬻贩之所，关津栈间之次第，毫发不差。 然后知书记之与口传，何啻天壤！ 丹经者，入道之途籍也。 今也废阁丹经，而求语句于时师，是犹废途籍而问路人，欲之京师能无谬乎？ 且夫一言半句，诀在真师。 汝欲觅师，师在何处？ ” 破愚论",
      "translated_text": "The Way of Returning the Elixir is recorded in the alchemical classics, yet scholars fail to read them thoroughly and ponder their meaning deeply. Instead, they grasp at a word or half a phrase, passing it from mouth to ear, and claim it as true transmission and genuine attainment. To the end of their lives, they cling to delusion, practicing with a single substance without ever awakening—how pitiful this is! Moved by compassion for such disciples, I have written this discourse.\n\nThe ancient immortals said: *\"Form is preserved through the Dao, life is prolonged through technique.\"* Nowadays, those who discourse on the Dao are many, but where are the techniques? Let them reflect on this.\n\n**Refuting Heresies**\nThose who expound on similar doctrines today offer divergent theories, all of which I shall address. The \"Nine-One\" method is nothing but heresy and need not be discussed. Then there are the theories of the \"precelestial plum,\" which resemble mere echoes and shadows, or mimic form without substance. Some may sound plausible, yet they all involve tangible dregs and material substances—no different in essence from the worldly \"red lead,\" only varying in name. To regard these as the Dao is, I fear, mistaken.\n\nAs for the doctrines of \"detached-form qi exchange,\" \"dual apertures of the navel and field,\" \"opening the passes and forging the sword,\" \"ascending and descending progressions,\" or those that invert the classics to speak of \"coiled peaches,\" \"holding jujubes to drink sweet dew,\" \"crushing porcelain and smelting iron into wine,\" \"collecting the impure fluids of men and women to brew with yeast,\" or \"blending autumn stone and calling it the primordial human element\"—such practices are manifold. They are all the teachings of heretical masters and crooked scholars, the blind leading the blind. Though they toil from youth to hoary age, they never achieve success, only ruining their virtue, harming their bodies, and becoming objects of ridicule in the world—how lamentable!\n\nMoreover, the qi of the precelestial arises from emptiness and nothingness. It cannot be seen, cannot be heard, cannot be grasped. Those who grope and probe, seeking it through myriad methods, only distance themselves further from it. What then of the \"floating and sinking grains and ounces\"? Where are they now?\n\nFrom what I have heard, truth and falsehood are as distinct as fragrant herbs and foul weeds—they cannot be stored in the same vessel. Laozi said: *\"Only because of their ignorance do they fail to know me.\"* If there were those in the world who truly understood these words, my Dao would not be solitary.\n\n**Refuting Doubts**\nSome may object: *\"The ancients said, ‘A word or half a phrase can penetrate the mysteries—what need is there for the myriad volumes of alchemical classics?’ These words suggest that verbose explanations are of little value. Yet you urge people to read the classics extensively, to thoroughly comprehend yin and yang, and deeply fathom the workings of creation. Is this not a waste of time, using knowledge and perception to obstruct the mind? If I grasp the teacher’s essential instruction, a single phrase can guide me in—why read so much?\"*\n\nI reply: *\"Your words sound reasonable, but you do not know that the Dao has orthodoxy and heterodoxy, and teachers have truth and falsehood. You lack the Dharma-eye—how then will you discern them?\"* To test gold, one must use a touchstone. The alchemical classics are the touchstone of contemporary masters. Without diligent study and deep reflection, merely relying on a word or half a phrase from a teacher to seek the Dao—how few will avoid falling into heretical sects and being misled by strange doctrines!\n\nThere was once a man who wished to travel to the capital. He asked for directions along the way, but each person gave different answers. Fearful, he dared not proceed. One day, in the marketplace, he found a road atlas. Clutching it, he set off, and every detail—where to lodge, where to trade, the order of passes and inns—matched perfectly. Only then did he realize the difference between written records and oral transmission—how vast, like heaven and earth!\n\nThe alchemical classics are the road atlas for entering the Dao. Today, people discard the classics and seek mere phrases from contemporary masters. Is this not like abandoning the atlas and asking passersby for directions, hoping to reach the capital without error?\n\nMoreover, a word or half a phrase as a secret transmission depends on a true teacher. Where do you intend to find such a teacher?\n\n**Refuting Ignorance**",
      "overlap_context": "t once the true form is broken, the essence, qi, and spirit within the body all transform day by day, month by month, descending into the postcelestial. How can the qi of *true unity* remain whole? It is like storing spoiled fruits or wine whose seal has been opened, yet expecting them not to decay—how could this not be difficult?\n\nThis principle is perfectly clear, easily understood by all. Whether drawing from the body near at hand or things far away, few analogies are needed to make it plain.",
      "start_char": 15636,
      "end_char": 16435,
      "start_sentence": 946,
      "end_sentence": 985,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.840602159500122,
      "metadata": {
        "source_file": "dao\\藏外\\方壶外史.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 31,
      "original_text": "今之好道者，类皆延致方士，烧炼炉火，以冀点化，以求服食，谓之外丹。 不知此等之事起于妄心。 既有妄心，即招妄侣。 以故巧伪之徒，投间抵隙，以马易牛，对面为贼，曾莫之悟。 即欲举之，更仆未易数也。 予首未得师旨，几惑此辈。 赖天之灵，不致败缺，故着此论，以遗后人。 凡炉火之事，勿谓无有，乃金丹之印证也。 《参同契》云：“炉火之事，真有所据。 在人洞晓阴阳，深达造化，然后妙用可见。 ”盖炉火炼气，比之炼己。 配合一道，采取一机，温养脱胎，无不皆同。 大要识其浮沉，知其老嫩，则丹道其庶几矣。 今之论炉火者，不知铅汞何物，铢两何在，真土何归，动以凡砂水银，妄意配合，匮以八石，煮以众草。 或取铅华而为水金，或取砂魂而为黄硫，或脱砂壳而为天琉，或取天癸而抱砂汞； 又或采锡取矿，玩日（左忄右曷）时，自谓真铅真汞真土，举世罕知，千绪万端，无过此法。 师心用智，各私其宝，深藏巧售，世人不知。 误而听之，则亡耗之祸，大不可言矣。 且夫金丹之道，上天所宝。 求得外护，法财两济，斯亦可矣。 举而售人，以征礼谢，此复何说？ 不识其诈而信其人，不究其理而用其术，非愚而何？ 误之于前，而复踵之于后，非愚而何？ 不务修德，而求非望之福，非愚而何？ 所谓竭殚财产，妻子饥贫。 迄不谐遇，希能有成，不幸而中仙翁之料者，十人而九。 呜呼！ 殆哉！",
      "translated_text": "Those who pursue the Dao today mostly invite alchemists to set up furnaces and fires, hoping for transmutation and elixirs to ingest—this they call \"external alchemy.\" Yet they do not realize that such pursuits arise from deluded intentions. Once delusion takes root, deluded companions gather. Thus, cunning impostors seize every gap and flaw, swapping horses for oxen, robbing you face-to-face, yet you remain oblivious. Even if you tried to enumerate their deceits, you could not exhaust them. In my early days, before receiving a true teacher’s guidance, I nearly fell prey to such men. By heaven’s grace, I avoided ruin, and so I write this treatise to leave for later generations.\n\nAs for furnace and fire, do not claim they do not exist—they serve as verification for the golden elixir. The *Cantong Qi* states: \"The work of furnace and fire has true basis. Only when one thoroughly understands yin and yang, deeply penetrates the workings of creation, can the marvelous application be seen.\" For furnace-fire refines qi just as it refines the self. The methods of matching, gathering, warming, and birthing the embryo are all the same. The key lies in recognizing ascent and descent, knowing maturity and tenderness—then the Dao of the elixir may nearly be grasped.\n\nYet those who discuss furnace-fire today know not what lead and mercury truly are, where their weights lie, or where true earth resides. They recklessly combine common cinnabar and mercury, mix in the eight minerals, boil them with various herbs. Some take lead bloom as \"water gold,\" others extract cinnabar’s spirit as \"yellow sulfur,\" still others strip cinnabar’s husk to make \"heavenly sulfur,\" or take *tiangui* to embrace mercury. Some mine tin or ore, toy with the sun’s movements, and call it true lead, true mercury, true earth—claiming the world rarely knows such secrets. A thousand threads, ten thousand strands, all no more than this method. Each follows their own mind, hoards their \"treasure,\" and cunningly sells it, while the world remains unaware. Those who heed them suffer ruinous losses beyond words.\n\nMoreover, the Dao of the golden elixir is treasured by heaven itself. To seek it, one must have external protection and both method and resources in harmony—this is acceptable. But to peddle it to others for gifts and gratitude—what justification is there? To trust a man without detecting his deceit, to employ his methods without examining their principles—is this not folly? To repeat the same mistakes after prior missteps—is this not folly? To neglect cultivating virtue while chasing undeserved fortune—is this not folly?\n\nSuch men exhaust their wealth, leaving wives and children destitute. Even if their schemes fail, they still hope for success. Alas! Those who fall into the immortal elders’ predictions number nine out of ten. How perilous!",
      "overlap_context": "etween written records and oral transmission—how vast, like heaven and earth!\n\nThe alchemical classics are the road atlas for entering the Dao. Today, people discard the classics and seek mere phrases from contemporary masters. Is this not like abandoning the atlas and asking passersby for directions, hoping to reach the capital without error?\n\nMoreover, a word or half a phrase as a secret transmission depends on a true teacher. Where do you intend to find such a teacher?\n\n**Refuting Ignorance**",
      "start_char": 16436,
      "end_char": 16973,
      "start_sentence": 986,
      "end_sentence": 1013,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.319178819656372,
      "metadata": {
        "source_file": "dao\\藏外\\方壶外史.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 32,
      "original_text": "外丹之道，为之在人，成之在天； 知之在慧，凝之在福； 诀之在师，明之在眼，有不可丝厘毫忽假借于人者。 苟能潜修德行，密结同心，德动天地，诚感鬼神，自尔临炉之时，保无虞失。 否则学术虽正，心眼虽明，如魔试何？ 余盖亲试历验，今则不敢自隐。 恐人不知，妄意轻举，迄以无成，反生懈退。 非道负人，人不知道故也。 若也能知之而能不为，能为之而能不用，能用之而能不私则更善矣！ 破痴论 金丹之道，知之贵真，修之贵早。 所以纯阳老师有云：“下手速修犹太迟。 ”世人不知，执着太上一百二十皆可还之说，当其强富之年，沉溺爱河，（上四中口下月）挂尘纲，不即解脱，日作夜为，亡耗几尽。 迨至日暮途穷，方始就道，以为归考之计。 不知时日不待，卦数既满，药材亏少，承藉无基，纵使遇师知药，而时节因缘忽已蹉过，皓首无成，反起虚无之叹而已！ 可胜惜哉！ 所以紫阳先生《悟真》首篇喻光阴于石火，等身世于浮泡，警悟之意，盖亦深且切矣。 或问《黄庭》一百二十之说，曰； “上古之世，民淳事简，婚配甚迟。",
      "translated_text": "The Way of external elixirs depends on man for its practice, but on heaven for its completion; wisdom for its understanding, and fortune for its coagulation. The secrets lie with the master, clarity with the eye—there is not a hair’s breadth or a moment’s leeway to borrow from another. If one can cultivate virtue in seclusion, bind hearts in silent accord, so that virtue moves heaven and earth and sincerity stirs ghosts and spirits, then when approaching the furnace, one may be assured of no mishaps. Otherwise, even with correct methods and keen insight, how can one withstand demonic trials?\n\nI have personally tested and verified this, and now dare not conceal it. I fear that those who act recklessly out of ignorance will meet with failure and grow disheartened. It is not that the Way betrays man, but that man does not understand the Way. Yet if one can know it without acting, act without employing it, or employ it without selfishness—how much better still!\n\n**Breaking the Spell of Delusion**\nThe Way of the golden elixir prizes true understanding and early cultivation. Thus, the Pure Yang Master said: *\"To begin swift practice is already too late.\"* Yet worldly people, clinging to the saying that *\"one hundred and twenty years may still be reclaimed,\"* in their prime and wealth remain mired in the river of love, entangled in the dusty net of the world, failing to break free. Day and night, they squander nearly all. Only when the sun sets on their path, when all is spent, do they turn to the Way as a last resort. Unaware that time waits for no one, that the hexagram’s count is fulfilled, that medicinal ingredients dwindle, and the foundation of support is gone—even if they meet a master who knows the medicine, the moment of opportunity has already slipped by. With white hair, they achieve nothing, and all that remains is a sigh of emptiness. How pitiable!\n\nThus, Master Purple Yang’s *Awakening to Reality* opens by likening time to a spark struck from stone and life to a floating bubble—his warning is both profound and urgent. Some ask about the *\"one hundred and twenty years\"* in the *Yellow Court*. I say: *\"In the ancient world, people were simple and affairs few; marriages came late.\"*",
      "overlap_context": "here? To trust a man without detecting his deceit, to employ his methods without examining their principles—is this not folly? To repeat the same mistakes after prior missteps—is this not folly? To neglect cultivating virtue while chasing undeserved fortune—is this not folly?\n\nSuch men exhaust their wealth, leaving wives and children destitute. Even if their schemes fail, they still hope for success. Alas! Those who fall into the immortal elders’ predictions number nine out of ten. How perilous!",
      "start_char": 16973,
      "end_char": 17395,
      "start_sentence": 1014,
      "end_sentence": 1032,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.147883415222168,
      "metadata": {
        "source_file": "dao\\藏外\\方壶外史.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 33,
      "original_text": "譬之良田，其力未乏，是以晚植而犹获。 今则硗瘠既甚，树艺复晚，则苗而不秀，秀而不实，无怪其然。 且古今人之不相及，风气使然也。 又乌得以今之人，而论古之世哉？ ”",
      "translated_text": "\"Consider fertile fields whose strength is not yet exhausted—even late planting still yields a harvest. But now the soil is barren and depleted, and cultivation comes too late, so the sprouts fail to flower, and the flowers bear no fruit. No wonder this is so. Moreover, people of ancient and modern times cannot be compared, for the prevailing *qi* of the age makes it so. How then can one judge the people of antiquity by the standards of today?\"",
      "overlap_context": "the medicine, the moment of opportunity has already slipped by. With white hair, they achieve nothing, and all that remains is a sigh of emptiness. How pitiable!\n\nThus, Master Purple Yang’s *Awakening to Reality* opens by likening time to a spark struck from stone and life to a floating bubble—his warning is both profound and urgent. Some ask about the *\"one hundred and twenty years\"* in the *Yellow Court*. I say: *\"In the ancient world, people were simple and affairs few; marriages came late.\"*",
      "start_char": 17395,
      "end_char": 17473,
      "start_sentence": 1033,
      "end_sentence": 1037,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 2.5141353607177734,
      "metadata": {
        "source_file": "dao\\藏外\\方壶外史.txt",
        "category": "藏外"
      }
    }
  ]
}