{
  "source_id": "无上三天玉堂正宗高奕内景玉书",
  "source_file": "chunked_daozang\\无上三天玉堂正宗高奕内景玉书.json",
  "total_chunks": 9,
  "total_original_chars": 8386,
  "total_translated_chars": 50667,
  "total_translation_time": 244.30544710159302,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\方法类\\无上三天玉堂正宗高奕内景玉书.txt",
    "category": "方法类"
  },
  "full_translation": "**The Supreme Three Heavens Jade Hall Orthodox High Ascent Inner Radiance Jade Scripture**\n\n**Title:** *The Supreme Three Heavens Jade Hall Orthodox High Ascent Inner Radiance Jade Scripture*\nAuthor unknown. Two scrolls. Based on the *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, Methods Category.\n\n---\n\n### *The Supreme Three Heavens Jade Hall Orthodox High Ascent Inner Radiance Jade Scripture, Scroll One*\n\nThe Master said: Those who study the supreme Dao and aspire to immortality must refine themselves through the essence of the sun and the radiance of the moon, for only thus can they achieve the immortal Dao. Without the mysterious workings of the Dao, none can unite with the True. The so-called \"essence and radiance\" are not sought externally but are the innate truth of one’s own body.\n\nThe Dao’s methods number in the thousands, its paths in the tens of thousands—twisting trails and side routes, cluttered with miscellaneous teachings. Thus, scholars often abandon the true for the false, forsake the internal for the external. The longer they practice, the harder it becomes to succeed.\n\nThe *High Ascent of the Sun and Moon* is the esoteric transmission of the Most High and the ancestral masters, passed down orally from mouth to mouth without reliance on written words. Now, it is recorded in writing so that those of later generations with karmic affinity may more easily seek and investigate it.\n\nMoreover, heaven’s spirit resides in the sun and moon, and the human body mirrors this. Thus, those who embody heaven and cultivate their bodies may reverse yang, transform their bones, and ascend in broad daylight—truly, this is the path to efficacy.\n\nAs the *Yellow Court Scripture* states:\n*\"High ascent of sun and moon, my supreme Dao,\nYu Yi and Jie Lin, well-preserved in harmony.\"*\nAnd again:\n*\"The radiance of sun and moon rescues the aged and infirm.\"*\nThese are no empty words.\n\nFor those of superior learning, once their minds open and their understanding deepens, they will grasp the essence of all things and transcend effortful practice to reach the realm of effortlessness. However, those of lesser capacity, with shallow and narrow roots, cannot enter the Dao without deliberate effort—they cannot grasp and perfect the True.\n\nThus, the Teaching Master deemed the Dao difficult to express in words and necessarily relied on written discourse. Here, the profound and wondrous is fully expounded. If later scholars diligently practice and steadfastly uphold it, they may ride the clouds of qi, tread upon radiant light, attain longevity, and commune with immortals and sages. How could this method compare to mere verbal instruction?\n\nThe Master said: The supreme Dao of immortals fundamentally requires no laborious visualization or circulation. To enter the true path of cultivation, one must employ talismans and scriptures. For five hundred years, a sage is born; for seven hundred years, a true adept is transmitted this Dao. Such methods are indeed rare to find worthy recipients.\n\nObserving those who uphold the Dao today, many are young and frivolous, neglecting precepts and conduct. They disrespect the law and belittle their masters, deceiving heaven and earth. Thus, the foolish seek profit without discerning worthiness, casually transmitting texts for wealth like peddlers.\n\nWhen disciples seek a master, they offer gold and treasures as ritual gifts. Yet when masters transmit and transform, they should choose those of loyalty and integrity. If disciples rely on wealth to disdain their masters, and masters pursue profit out of favoritism, slander and fault will inevitably arise, bringing misfortune upon themselves.\n\nThis *High Ascent Scripture* is a text forbidden by the heavens. It must be transmitted only to those carefully selected; it should not be indiscriminately shown to the unworthy. If one cannot find those who wholeheartedly follow the path, they are surely those who deceive the law and their own hearts. Be strictly warned: do not violate this.\n\n---\n\n### *Initial Yang’s Crimson Radiance Transforming Inner Radiance*\n**Incantation:**\n*\"Yang arises from the Primordial Sea, ascending from below.\nChaotic yet ordered, it scatters the host of yin.\nWithin dwells the great spirit, Lord Yu Yi.\nMay true qi descend to bathe my true form.\"*\n\nThe Master said: On the first day of the lunar month at the *yin* hour (3–5 AM), purify yourself, sit in stillness, and knock your teeth thirty-six times. Ingest the talisman. Visualize your body as Kunlun Mountain, with a great sea below. The sun emerges from the sea’s depths, its light illuminating your body as you sit atop the peak. Hold your breath, recite the incantation nine times, swallow saliva nine times, and remain seated for a long while before retiring.\n\n---\n\n### *True Yang Ascending Jade Void Inner Radiance*\n**Incantation:**\n*\"True radiance ascends, illuminating my Celestial Gate.\nThe blazing wheel’s brilliance dispels darkness and disperses gloom.\nYang spirit merges, flying forth from Kunlun.\nRiding the void, I urge the radiance onward to pay homage to the High Ascent.\"*\n\nThe Master said: On the third day of the lunar month at the *mao* hour (5–7 AM), purify yourself, sit in stillness, and knock your teeth thirty-six times. Visualize your body as the spirit of Kunlun Mountain, ascending to its summit. Hold your breath, recite the incantation nine times, and ingest the talisman. Visualize the sun rising, illuminating your body. Ingest qi, remain for a long while, then retire.\n\n---\n\n### *Luminous Yang’s Radiant Brilliance Illuminating True Inner Radiance*\n**Incantation:**\n*\"Golden wheels manifest auspiciousness, resplendent with yang’s brilliance.\nFlaming light soars, streaming crystal across ten thousand leagues.\nDemonic obscurity extinguishes its flames; dust and grime dissolve.\nSoaring through the void, I ride qi to ascend on high.\"*\n\nThe Master said: On the first day of the lunar month, purify yourself, sit in stillness, and knock your teeth thirty-six times. Visualize your body atop Kunlun’s summit, gazing upon the sun’s dazzling radiance, its golden light piercing you. Hold your breath, recite the incantation nine times, swallow saliva, and ingest the talisman as before.\n\n---\n\n### *Primordial Yang’s Fiery Clouds Crimson Inner Radiance*\n**Incantation:**\n\n**Incantation:**\n*\"Divine spirits surge through cloud-lit thoroughfares, charioting the numinous crow.\nUnobstructed, soaring and merging, ascending into the void’s origin.\nTrue yang’s sacred qi naturally aligns with the talisman.\nInner refinement complete, I ascend to pay homage at Jade Capital.\"*\n\nThe Master said: On the ninth day of the lunar month, purify yourself, sit in stillness, and knock your teeth thirty-six times. Visualize fire clouds descending to form a bridge, your body atop Kunlun’s summit riding the fire clouds toward the Solar Palace. Before ascending, ingest its qi until warmth is felt, then hold your breath and recite the incantation as before.\n\n---\n\n**Fiery Yang’s Soaring Fire Dragon Inner Radiance**\n**Incantation:**\n*\"Fire dragons lead the way, piercing the crown with flying light.\nSpirits enter the boundless, paying homage to Yu Yi.\nIn a blink, I ascend and merge, blending with numinous brilliance.\nUnwavering, I pursue the root, burning away Peng’s corpse.\"*\n\nThe Master said: On the twelfth day of the lunar month, purify yourself, sit in stillness, and knock your teeth twenty-six times. Visualize yourself as before, from the summit riding a golden dragon across the fire bridge, soaring toward the Solar Palace. Then, the auspicious qi below the mountain harmonizes and warms. Hold your breath, recite the incantation nine times, swallow saliva nine times, ingest the fire qi, and feel your entire body suffused with spring’s warmth.\n\n---\n\n**True Yang’s Homage to Numinous Brilliance Inner Radiance**\n**Incantation:**\n\n**Riding the True Yang’s Radiance, I leap into the Golden Gate.**\n**Yin’s filth burns to ash, as I pay homage to the Lofty Honored One.**\n**Numinous qi returns to me, illuminating every aperture with light.**\n**Spirit merges with inner refinement, transforming to birth the immortal soul.**\n\nThe Master said: On the fifteenth day of the lunar month, recite the incantation, ingest the talisman, knock the teeth, and swallow saliva as before in number. Visualize yourself entering the sun to pay homage to the Imperial Lord, presenting your aspiration to study the Dao of immortality. After a long while, withdraw.\n\n**True Yang’s Numinous Radiance Illuminating the Inner Landscape**\n**Incantation:**\n*Radiance of the Solar Palace blazes bright, as I don the numinous light.*\n*Eight windows shine clear, nine portals glow resplendent.*\n*Form and spirit return to the source, qi refines into radiance.*\n*Washed and refined, without leakage, the Valley Spirit soars.*\n\nThe Master said: When the adept reaches this stage, having entered pure Yang, recite the incantation eighty-one times, ingest the talisman, absorb the qi, knock the teeth, and swallow saliva. Visualize yourself entering the Solar Palace, sitting upright to absorb the light and draw in qi. The numinous crow emits light, entering your mouth, suffusing your entire body with brilliance. This practice is to be performed at the noon hour on the seventeenth day of each lunar month.\n\n**Pure Yang’s Golden Radiance Resplendent Inner Landscape**\n**Incantation:**\n*Heaven’s radiance merges with form, spirit and qi unite with the sky.*\n*The true fire of Li’s clarity becomes my Three Fields.*\n*Coming and going freely, soaring naturally.*\n*Pure Yang completes the body, attaining the rank of divine immortal.*\n\nThe Master said: On the twentieth day of the lunar month, perform the practice as before. Then visualize your body within the sun, inner and outer merging as one, warmth arising naturally. Nine rays scatter their brilliance, suffusing the heavens in great crimson. Recite the incantation eighty-one times, knock the teeth, swallow saliva, ingest the talisman, and after a long while, withdraw.\n\n**Nine Yang’s Li-Clarity True Qi Yu Yi’s Inner Landscape**\n**Incantation:**\n*Cavernous Yang’s qi crimson, blazing and crystalline.*\n*Yin scatters, Yang gathers, nurturing my true form.*\n*Form and spirit both transform, merging with Li’s clarity.*\n*Refinement arises naturally, cycling through countless flights.*\n\nThe Master said: On the twentieth and twenty-fifth (dark moon) days of the lunar month, recite the incantation, ingest the talisman, knock the teeth, and swallow saliva as before. Visualize your body merging with the sun as one, your form no longer visible—only the blended radiance remains. Practicing this for one year banishes illness; for two years, spirit strengthens and the body lightens; for three years, the corpse’s poisons dissolve; for five years, one may ride qi and mount light. With unwavering diligence, the Imperial Lord will gaze upon you, true immortals become your companions, and you will ascend at dawn. Take heed.\n\n**Primordial Simplicity’s Inception of the Mysterious Origin Inner Landscape**\n**Incantation:**\n*Vast and boundless, the empty profound, the chaotic true source.*\n*Flourishing radiance yet concealed, the mysterious wheel self-completes.*\n*Converging at the inception, symbolizing the Emperor’s precedence.*\n*Following the time to refine and ingest, qi enters the profound mystery.*\n\nThe Master said: On the night of each new moon, recite the incantation nine times as before. Visualize yourself as Kunlun, its base as a vast sea stretching boundlessly. From the water’s depths, the lunar wheel rises black, devoid of light. Ingest its primordial qi, and after a long while, swallow saliva and knock the teeth according to the number of incantations recited.\n\n**Luminous Clarity of the Great Inception’s Radiance Inner Landscape**\n**Incantation:**\n*True radiance first arises, utmost Yang within Yin.*\n*Water overflows the mysterious pivot, golden dew’s faint gleam.*\n*The source of fluids flows freely, illuminating the jade chamber.*\n*Qi’s light grows abundant, ingesting and soaring in flight.*\n\nThe Master said: On the night of the second day of each lunar month, sit in stillness and purify yourself. Visualize yourself as Kunlun Mountain, seated at its summit, gazing at the moon rising like a hook over the sea, its water-wheel full above. Knock the teeth and swallow saliva, each twenty-seven times. Recite the incantation, ingest the talisman, absorb the qi, and after a long while, withdraw.\n\n**Crystal Radiance’s Luminous Flourishing Inner Landscape**\n**Incantation:**\n*Radiance scatters in the celestial pond, gold and water half-formed.*\n*Light pierces the dark night, illuminating my mysterious pearl.*\n*Drinking the crystalline nectar, fragrance permeates the numinous body.*\n*Through true convergence of numbers, ride the radiance in soaring flight.*\n\nThe Master said: On the seventh day of each lunar month, purify yourself and sit in stillness. Visualize yourself ascending Kunlun’s summit, gazing at the moon’s light like a half-formed wheel. Recite the incantation twenty-four times, ingest the talisman, and swallow saliva according to the number of incantations. Absorb the qi, and after a long while, withdraw.\n\n**Jade Radiance’s Limpid Brilliance Illuminating the Inner Landscape**\n**Incantation:**\n*The Dharma Wheel soars in the heavens, profound within the profound.*\n*Clear waves shimmer, golden blossoms trickle.*\n*Washing away the corpse’s filth, nourishing the Cinnabar Field.*\n*Soaring high into the inner landscape, condensing the radiant orb’s perfection.*\n\nThe Master said: On the night of the thirteenth day of each lunar month, purify yourself and sit in stillness. Visualize yourself ascending Kunlun’s summit, gazing at the moon’s radiance. Recite the incantation thirty-six times, knock the teeth, and swallow saliva, each thirty-six times. Ingest the talisman, absorb the qi, and after a long while, withdraw.\n\n**Full Radiance’s Numinous Clarity Pervading Illumination Inner Landscape**\n**Incantation:**\n*The jade pivot’s radiance, full and unwaning.*\n*The mysterious radiance limpid and clear, the spirit’s gate opens its doors.*\n*Within stands the Lofty Honored One, crowned in jade, robed in feathers.*\n*May the numinous qi descend, hastening my return’s appointed time.*\n\nThe Master said: On the night of each full moon, purify yourself and sit in stillness. Visualize yourself standing atop Kunlun’s summit, the moon full and brimming with light. From the moon, water and clouds form a bridge, gleaming like silver. Ingest its qi without ascending. Recite the incantation thirty-six times, knock the teeth, and swallow saliva likewise. Ingest the talisman, absorb the qi, and after a long while, withdraw.\n\n**Incantation:**\n*The celestial source flows in cycles, light piercing the layered towers.*\n*Dawn’s glow illumines the ten directions, the five fluids dispel the obscure.*\n*Soaring emptiness captures the radiance, the true body floats in flight.*\n*With one true ascent to pay homage, the nine Yangs hold no peril.*\n\nThe Master said: Proceeding as before, on the sixteenth day, visualize the moon’s true water forming a bridge, descending to connect with Kunlun. Your body rides a multicolored phoenix into the moon. Recite the incantation eighty-one times, knock the teeth, and swallow saliva likewise. Ingest the talisman, absorb the qi, and after a long while, withdraw.\n\n**Golden Radiance’s Pure Emptiness Embracing the True Inner Landscape**\n\n**Incantation:**\n*Divine radiance veils in mist, the body ascends to the Mystic Palace.*\n*Pay homage to form the luminous essence—vows are instantly fulfilled.*\n*Chew the Mystic Flower, ingest the numinous wind.*\n*The corpse-soul scatters, the spirit transforms into immortal visage.*\n\nThe Master said: Once more, the adept visualizes entering the Moon Palace to pay homage to the August Sovereign, offering prayers for the pursuit of immortality. Ingest the talisman, recite the incantation, knock the teeth, and swallow saliva—each forty-nine times—on the night of the seventeenth day.\n\nThe Master said: The journey to the moon spans but two ten-day periods; beyond this, its light wanes. Thus, these practices must be performed in succession.\n\n**Unsurpassed Divine Radiance of Void Clarity and Inner Landscape**\n\n**Incantation:**\n*The moon is my spirit, the spirit follows the moon as one.*\n*Inner talisman and outer form unite, transmuting into true shape.*\n*Elegance gathers in the Flower Chamber, above blooms the Golden Blossom.*\n*Merit perfected, without leakage, ascending to Jade Capital.*\n\nThe Master said: On the eighteenth day, the adept visualizes the body within the moon, inwardly and outwardly luminous and clear. Ingest the talisman, recite the incantation sixty times, swallow saliva nine times, and knock the teeth nine times. Perceive golden radiance scattering in all directions, illuminating the heavens with light. Then absorb the *qi*, and after a long while, withdraw.\n\n**Fixed Radiance of Pure Cold Jade and Luminous Essence Inner Landscape**\n\n**Incantation:**\n*The round wheel’s essence revolves, the hidden paths of night unfold.*\n*Jade Void merges with radiance, golden light lingers in cycles.*\n*The source of fluids flows unimpeded, illuminating the Spirit Terrace.*\n*Fragrant sweet dew floats, transmuting my immortal embryo.*\n\nThe Master said: By this stage, the adept merges as one with the moon. Visualize the body uniting with the Supreme August One, no longer perceiving one’s form—only clarity remains. Practicing this for ten days, the merit surpasses even that of the solar practices. Yet if the adept’s precepts are unrefined and resolve unsteady, though one may grasp and release in fleeting moments, persistence still extends life and transcends the world—how much more so for the devoted?\n\n**Morning Radiance Transforming the Landscape**\n\nThe Master said: The adept again visualizes this scene in the latter ten-day period, awaiting the cloud chariot’s ascent into the Void.\n\n**Hymn of Primal Unity**\n*The spirit’s carriage soars from the Flower Chamber,*\n*The Jade Flask’s auspicious *qi* ascends with true radiance.*\n*Supreme Harmony’s fortune binds the realms of Water and Fire.*\n*Within dwells the True One, girded with jade pendants,*\n*Loftily ascending, wafting celestial fragrance,*\n*Emerging from the Void, entering the Origin—Yin transforms into Yang.*\n*Vast and boundless, the golden elixir’s nectar*\n*Irrigates the hundred bones, ensuring longevity.*\n*Bow to the Primal Jade Void Sovereign above.*\n\nThe Master said: Lesser adepts, of shallow capacity, know not the Way of natural longevity through clarity, stillness, and perfect penetration. They must rely on visualization and circulation. Yet with devoted and prolonged practice, they merge with the Dao and attain immortality. This method is most esoteric, rarely known. Even those who know may not practice; those who practice may not persist. Thus, immortal masters and Daoist preceptors carefully select disciples for transmission.\n\nThe practitioner, when entering seclusion, must not make a sound, cough, or spit, nor speak to others. With precision and persistence, the spirit soars through the void, coming and going without hindrance, uniting with the immortal perfected. Know then that this text holds the Celestial Master’s secret of soaring through the heavens—treasure it.\n\n**The Supreme Three Heavens Jade Hall Orthodox Lineage’s High Ascent Inner Landscape Jade Scripture, Volume One Concludes**\n**The Supreme Three Heavens Jade Hall Orthodox Lineage’s High Ascent Inner Landscape Jade Scripture, Volume Two**\n\nThe Master said: For protecting the body and prolonging life, nothing surpasses the true Dipper’s restraint of the soul and refinement of the Nine Yangs’ radiance within the *qi* of the *Gang*. Thus, the sages declared: *\"Entering and exiting the Dipper, the body grows strong, the *qi* flourishes, life extends, and destiny increases—all evil flees.\"* They also said: *\"All methods emerge from the Dipper; all spirits are commanded by the Dipper.\"* Thus, every method and practice depends on the Dipper for efficacy. Therefore, the sagely masters invariably employ the Dipper’s ascent to transmit the Dao, guiding adepts toward immortality and truth. By preserving the Void and embracing the Real, one sits to command the Three Realms, governs the Six Heavens—this method is indeed one of the Three Ascents’ secrets, the ladder to transcendence. How could one not revere it?\n\n**First: The Great Star Essence**\nNamed the *Mysterious Pivot Spirit*, the *Four Yang Bright Souls*, called the *Celestial Pivot Soul*.\nThe spirit of the Dipper Heaven’s Grand Commandant, overseeing governance and transgressions.\nAbove, it reaches the Nine Heavens; in the middle, it supervises the Five Peaks’ flying immortals; below, it commands those who study the truth. All celestial and terrestrial spirits submit to it.\n\n**Second: The Primordial Star Essence**\nNamed the *Northern Terrace Spirit*, the *Yin Essence Soul*, called the *Celestial Rotator Soul*.\nThe spirit of the Dipper Heaven’s Chief Minister, overseeing emoluments.\nAbove, it governs the celestial lodges; below, it commands the myriad spirits. Those who study immortality submit to it.\n\n**Third: The True Star Essence**\nNamed the *Utmost Ultimate Supreme True Spirit*, the *True Person Soul*, called the *Celestial Mechanism Soul*.\nThe spirit of the Dipper Heaven’s Minister of Works, overseeing immortals.\nAbove, it governs the Nine Heavens’ lofty perfected; in the middle, it supervises the Five Peaks’ numinous immortals; below, it commands those who seek the Dao and immortality. All submit to it.\n\n**Fourth: The Pivot Star Essence**\nNamed the *Wandering Root Spirit*, the *Mysterious Dark Soul*, called the *Celestial Pivot Vital Breath*.\nThe spirit of the Dipper Heaven’s Mobile Striker, overseeing the punishment of rebels.\nAbove, it governs the Nine Heavens’ ghosts and spirits; in the middle, it commands the Northern Emperor’s Three Offices; below, it oversees the myriad multitudes, punishing rebels and the disloyal. All submit to it.\n\n**Fifth: The Network Star Essence**\nNamed the *Great Peace Spirit*, the *Cinnabar Origin Vital Breath*, called the *Jade Guard Vital Breath*.\nThe spirit of the Dipper Heaven’s Dipper Lord, overseeing life records.\nAbove, it governs the Nine Heavens’ registers; in the middle, it administers the ghosts and spirits’ ledgers; below, it commands the records of those who study the truth and the common people. All submit to it.\n\n**Sixth: The Chronicle Star Essence**\nNamed the *Life Mechanism Spirit*, the *Northern Culmen Vital Breath*, called the *Yin-Scanning Soul*.\nThe spirit of the Dipper Heaven’s Grand Master of Ceremonies, overseeing advancement.\nAbove, it governs the Nine Heavens’ lofty perfected; in the middle, it commands the Five Peaks’ flying immortals; below, it oversees the bodies of Dao students. All who accumulate merit ascend through the ranks.\n\n**Seventh: The Barrier Star Essence**\nNamed the *Prosperous Yang Spirit*, the *Celestial Barrier Soul*, called the *Shaking Radiance*.\nThe Great Brilliance of the Dipper Heaven’s Emperor, ruling the severance and continuity of Heaven and Earth, such as the length of the four seasons, the prosperity or decline of Heaven and Earth, and the shifts of kalpas. All submit to it.\n\n**Eighth: The Sovereign Star**\nNamed the *Exalted Jade Emperor Spirit*, the *Lord of Eightfold Radiance and Primal Void*.\n\n**Ninth: The Venerable Star**\nNamed the *Grand Tenuity Jade Emperor Spirit*, the *Lord of Seven Mornings and Seven Essences*.\n\nThese two stars are the supreme spirits of the Sovereign Stars. Those who behold them gain longevity; those who cultivate them attain immortality. In former times, a servant of Chancellor Huo Guang of the Han, named Huanche, suddenly saw the two stars within the Dipper, shining with extraordinary brilliance. He bowed and departed, and thereafter lived six hundred years.\n\nThe Master said: On the twenty-first night of the month, at midnight, enter your chamber. Press your hands to settle the qi, close your eyes, and inwardly visualize your body rising gently upward, ascending into the *Kui* of the Northern Dipper, where you sit with your back to the Perfected Star. With prolonged practice, you will feel as though your form truly dwells within the Dipper. Focus your intent to the utmost, and you will sense warmth within your body—this is the true qi harmonizing with virtue. Visualize the stars of the Dipper, their light descending upon your body, illuminating you within and without. Then visualize the Three Great Spirits of the Nine Stars.\n\nFirst, the **Great Spirit of the Upper Prime**:\nNamed *Qi Jian*, styled *Ling Gang*, clad in a purple auroral robe of phoenix plumes, a tiger-patterned cinnabar skirt, with a pendant at his left and a jade ring at his right, both hands grasping fiery golden bells.\n\nNext, the **Great Spirit of the Middle Prime**:\nNamed *Xuan Du*, styled *Su Kang*, his neck bearing a halo of radiance, crowned with a *Fu Chen* coronet, draped in a crimson feathered mantle, girded with a dragon belt and tiger-patterned robe.\n\nLast, the **Great Spirit of the Lower Prime**:\nNamed *Kang Meng*, styled *Liu Yu*, wearing a *Fu Hua* coronet of green jade, a yellow phoenix-feathered mantle, a dragon robe and tiger belt, bearing fiery golden bells at his waist, and holding the rays of the sun in his hands.\n\nThe Three Spirits sit facing you, bidding you sit with your back to the Primal Star. With reverent heart, bow to them. In deep concentration, as if in a trance, visualize the Three Great Spirits asking: *Why do you not hasten to prostrate yourself?* You reply: *I fear the myriad demons of the Six Heavens and Three Officials.* The Three Spirits grow wrathful together, shaking their bells and exhaling qi, their radiance flashing across the eight directions.\n\nSuddenly, you see a maiden, her form like an infant, seated before the Three Spirits facing you. She exhales purple mist, which enters your heart, and calls out: *I am the Ninefold Essence of the Dipper’s Yin Spirit, the Jade Clarity Sovereign Consort of the Upper Realm, named Mihua, styled Linqian.* Then swallow your saliva nine times, click your teeth nine times, and press your left hand to your heart. Recite the incantation:\n\nThe Supreme Elixir of Cinnabar, its numinous radiance flashing like a whirlwind. The nine wefts unfurl in revolution, their luminous qi diffusing and dispersing. The Purple Palace’s hidden torch, the Seven Luminaries flourish and scatter. The Two Effulgences present their brilliance, yin and yang now divided. The Four Measures turn in prosperity, cloudy ford-waters swirl and irrigate. Auspicious moments awaken qi, ascending to the Nine Origins. Grasping the Dipper, clambering the Celestial Stem, I present myself to the Three Lords. They ask why I tarry: *Why do you not ascend as an immortal?* I bow my head in reverence, saying: *I fear the ghosts and dare not advance.* The Emperor then blazes in majesty, his mouth holding the root of the sun. To the left, he shatters the Six Heavens; to the right, he tramples Mount Deng. His streaming bells blaze above, the demon chiefs shatter and disperse. He expels my seven *po*, strengthens my three *hun*. Concealed within the Dipper’s sway, the Nine Essences reside in my heart. Purple auroras glow in cavernous reflection, flying radiance spans ten thousand fathoms. Harmonizing *hun* and restraining *po*, the Six Embryos refine and temper. Through essence’s resonance, the stars transform—suddenly the Jade Consort appears. Seated upon my heart, she gazes down and looks up. Her name is Mihua, her style Linqian. She exhales and inhales crimson mist, pacifying the hundred passages. She wears a brocade mantle, phoenix-light and simurgh-skirt. Her waistband is tiger-script, her robe dragon-patterned with jade inscriptions. In her hand she holds Moon’s Splendor, her head crowned with a purple coronet. She soars into the Great Empyrean, riding a canopy of light and clouds. Inscribed as *The Great Simplicity*, I attain flight as an immortal. Rising and floating through the Hollow Cavern, I suspend jade in the Supreme Origin. Ascending to the Vermilion Chamber, I command the myriad spirits. The registers divide into two measures, returning to an infant’s visage. The Northern Emperor unleashes thunder, the Southern Emperor arrays fire. The Eastern Granary kindles its torch, resplendent with thunderous roars. The Western Flow doubles its blows, chiming tones in harmonious accord. Four times I rise and leap, presenting myself to the Jade Perfected. Then I mount the Eight Effulgences, roaming through purple mists.\n\nWhen finished, raise the hands as before, swallow saliva thirty times, and click the teeth nine times. Upon completing the incantation, rise and bow twice to the northwest, closing the eyes to visualize Mihua above, now suffused with primordial qi.\n\nThe Master says: On the first, third, and fifth days, visualize the Mud-Pill Palace, swallow saliva fifty times, click the teeth nine times, and with the left hand pinch the center between the brows while softly reciting the incantation:\n\n*Supreme Purple Radiance, spirit of the Nine Conduits. Canopy of seven descents, illuminating the myriad spirits. In motion, you command the lofty numina; in stillness, you harmonize with luminous qi. Yin and yang flow and irrigate, the Three Qi divide at the center. Roaming and crossing beyond all bounds, you illumine the host of heavens. This month, at dawn’s first light, ascend to the Mud-Pill Palace. Without essence’s congealed resonance, transform into a great spirit. Named Wondrous Sword, styled Numinous Might. Seated upright within the Dipper, roaming my Hall of Light. Phoenix-plumed purple mantle, tiger-brocade cinnabar robe. Left side girded with jade pendants, right waist adorned with golden bells. Hand grasping streaming bells, head crowned with dawn’s radiance. Exhaling qi to irrigate and bathe, the Mud-Pill Palace is made whole. Harmonizing *hun* and *po*, planting the flowering pillars and beams. Enabling my flight as an immortal, transcending the void to tread the empty. Ascending to the Supreme Clarity, driving tigers and commanding dragons. Facing north to the Jade Emperor, in the Jasper Forest’s Upper Palace. Journeying west to the Great Simplicity, bowing to the Three Origins.*\n\nWhen finished, press the hands again, swallow saliva nine times, and click the teeth nine times. Upon completing the incantation, rise and bow twice to the north, then twice to the northwest.\n\nThe Master says: On the seventh, ninth, and thirteenth days, visualize the Crimson Palace, swallow saliva fifty times, click the teeth nine times, and with the right index finger gently press while softly reciting the incantation, pinching the heart and softly intoning:\n\n*Supreme Purple Perfection, numinous spirit of the Nine Qi’s center. Encompassing the myriad measures, the revolving mechanism shines resplendent. Flying auroras stream with radiance, their brilliance illuminating the Jade Clarity. Mystic canopy of the host of spirits, come to respond in the heart’s courtyard. Flying light descends in effulgence, the Middle Origin fills to abundance. The Six Palaces open and unfold, flowering liquid levels and smooths. Refining *hun* and *po*, attaining the essence of the Perfected. Through resonance and transformative touch, a hundred thousand changes arise in an instant. Suddenly a great spirit appears, seated upright in the Chamber of Tranquility. Solemnly facing the Perfected, a hundred joints open and align. Grasping the Dipper and clinging to the Ladle, gazing at the sun in a hundred directions. Named Xuan Du, styled Su Kang. Crimson-feathered flowering mantle, dragon-sash and tiger-robe. Body suffused with precious radiance, neck bearing a halo of light. Head crowned with flying dawn, lotus coronet soaring aloft. Enabling my flight as an immortal, transcending and floating through the Great Void. Ascending to the Purple Gates, facing north to the Jade Emperor. Commanding the myriad spirits, the host of numina welcome and receive. Flowers bloom upon the heart, auspicious clouds flourish eternally. Phoenix flutes ring clear, simurgh pipes chime in harmony.*\n\nWhen finished, press the hands again, swallow saliva nine times, and click the teeth nine times. Upon completing the incantation, bow twice as before.\n\nThe Master says: On the fifteenth, nineteenth, and twenty-second days, visualize the Cinnabar Field Palace, swallow saliva sixty times, click the teeth nine times, and with the left hand’s second finger pinch the philtrum while softly reciting the incantation:\n\n*Supreme Purple Emperor, resplendent and bright at the central pivot. The Nine Wefts glow in misty radiance, light penetrating the Supreme Subtlety. The myriad spirits gaze in reverence, a thousand spirits plant their roots. Seven times pinch the philtrum, softly reciting: Dividing the petals to restrain yang, manifesting compliance to grasp yin. Harmonizing their radiance, awakening the array of the Mystic Root. Things arrayed in... the moon’s inception is most auspicious. Observing the response within the navel, purple qi issues forth in auroras. Flying light plunges and descends, refining my *hun* and *po*. Flowering essence gleams and flourishes—suddenly a great spirit appears. Numinous and noble of the Upper Palace, named Kang Meng, styled Liu Yu. Seated upright within the navel, riding the Dipper’s Nine Qi, exhaling and inhaling cloudy liquid. Balancing blood and ordering the stomach, yellow phoenix-feathered mantle. Dragon robe and tiger sash... kindling the sun’s root. Head crowned with green lotus, waist streaming with fire bells. Lightning flashes in boundless reflection, enabling my flight as an immortal. Transcending the void to tread the floating, ascending to the Jade Chamber. Bearing the Empyrean’s emptiness, commanding the myriad spirits, heaven and earth share in repose.*\n\nPress the hands again, swallow saliva twenty times, and click the teeth nine times. Upon completing the incantation, rise and bow twice toward your natal constellation.\n\nThe Master says: The above is called *Ascending the Dipper and Rushing the Celestial Stem*, able to restrain *hun* and control *po*, augment qi and extend years. Summoning the Perfected and attracting the numinous all begin from this. *Reclining with the Dipper.*\n\nThe Master says: For all morning and evening repose, first visualize the Nine August Stars upon your sleeping mat. Stand at the foot of the bed facing north, both hands clasping the heart, close the qi and shut the eyes. Visualize the Northern Dipper in the heavens along with the Imperial Nine Stars, each in their proper seasonal positions, descending gently to the mat in ordered array as depicted. Let the Celestial Pass form the shape of the monthly Stem-Dipper, nine feet in length and six feet in breadth, encircling the true stars beyond. On the evening of the new moon, also visualize the Morning Canopy Star descending together with them, likewise arrayed as in the diagram.\n\nFrom the *Kui* down to the Dipper’s mouth, enter the *Kui* from beyond the honored stars. Lie supine, close the eyes, and visualize the stars as orbs of radiant light—purple in hue, their edges crimson—encircling them as if pacing the diagram. Let my head align with the Nine Poles, drawing true qi into the Mud-Pill Palace. Let the true stars rest directly above the crown, visualizing the true qi’s purple radiance following the body into the Mud-Pill, overflowing to suffuse the head and brain, its light illuminating and penetrating all. Tread upon the honored stars, and with the heart’s intent, ascend as an immortal, commanding the Grand Tenuity to govern my three *hun*.\n\nSlightly bend the left foot, pressing the toes upon the Emperor Star, and with the heart’s intent, ascend as an immortal, commanding the Most High to restrain my seven *po*. Extend the right foot to tread upon it, the left hand grasping the Northern Terrace. The Northern Terrace is the essence of the Origin Star. Raise the left hand slightly, embracing the nether cord of the Origin Star, its form resting in the tiger’s mouth. The right hand holds the Pivot Root. The Pivot Root is the essence of the Pivot Star. Invert the right hand, grasping the cord of the Pivot Star, its form resting above the tiger’s mouth.\n\nNext, arrange the body as prescribed, close the eyes, and visualize the Nine Star Lords:\n1. The essence of the Great Star, named *Mysterious Pivot Supreme Perfected*. May I ascend as an immortal, riding the void and steering the floating. Visualize the star before the left little finger.\n2. The essence of the Origin Star, named *Northern Terrace Supreme Perfected*. May I ascend as an immortal, wandering the Terrace of Flowing Sands. Visualize the left hand grasping it.\n3. The essence of the True Star, named *Nine Poles Supreme Perfected*. May I ascend as an immortal, governing the Three Mysteries. Visualize the star above the head.\n4. The essence of the Pivot Star, named *Pivot Root Supreme Perfected*. May I ascend as an immortal, my jade name inscribed among the flying immortals. Visualize the right hand holding it.\n5. The essence of the Net Star, named *Grand Peace Supreme Perfected*. May I ascend as an immortal, ascending to the Highest Clarity. Visualize the star to the right of the Pivot Star.\n6. The essence of the Mechanism Star, named *Life’s Mechanism Supreme Perfected*. May I ascend as an immortal, my name recorded in the Grand Tenuity. Visualize the star to the right of the Net Star.\n7. The essence of the Pass Star, named *Mysterious Mechanism Supreme Perfected*. May I ascend as an immortal, commanding jade lads. Visualize the star beside the Mechanism Star Lord.\n8. The essence of the Emperor Star, named *Most High Jade Sovereign Lord*. May I ascend as an immortal, ascending to the Hall of the Latter Sage. Visualize the star within the *Kui* Star, its net linked to the Pivot Star, aligned with the center of the right foot.\n9. The essence of the Honored Star, named *Grand Tenuity Jade Sovereign Lord*. May I ascend as an immortal, entering the cinnabar chamber and jade house. Visualize the star linked to the net of the Great Star, aligned before the left foot.\n\nNext, visualize all nine stars together, click the teeth twenty-one times, and swallow saliva twenty-one times. Recite the incantation:\n*Nine Stars, Great Essences, True Lords of the Northern Culmen.\nAugment my fetal essence, strengthen my three hun.\nTo the left, draw the sun’s splendor; to the right, restrain the moon’s crystal.\nWithin the stems, the Yellow Radiance; above the Primordial Void, the Supreme Perfected.\nLet me ascend as an immortal, ascending to the Purple Palace.\nDivine Tiger and Jade Talisman guard the Gate of Life.\nMyriad evils submit to the law, refined by the Dipper Lords.*\n\nAfter gazing for a long while, visualize the essence of the Dipper stars suddenly entering the Grotto Chamber. Visualize the nine stars upon the mat along with their net, all dividing their essence into minute forms, then retreating through the qi gate into the Grotto Chamber. Lie supine with the *Kui*’s mouth facing [the mat], so that both the mat and the cheeks possess them. Within the Grotto Chamber and the *Kui*, to the left sits the Yellow Elder Lord, clad in yellow embroidered robes; to the right, my spirit sits opposite the Yellow Elder Lord. Within the mouth resides the Mud-Pill Crimson Child Sovereign Lord, seated facing outward, his light illuminating the entire body, inside and out, penetrating all. The Three Passes and hundred joints all glow crimson. Recite the incantation:\n*Grotto Chamber’s Primordial Essence, Crimson Child Supreme Sovereign.\nDipper’s radiant canopy descends to illuminate the Mud-Pill.\nRefine and guard bones and blood, restrain and govern po and hun.\nLet me ascend as an immortal, riding clouds to ascend the dawn.\nAscend to the Jade Emperor’s court, to the Primordial Sovereign of Grand Unity.*\n\nAfter the incantation, close the eyes, still the thoughts, forget the form, and rest in serenity.\n\nThe Master says: The yin essence of the external Northern Dipper governs immortality, enabling the numinous Grotto Chamber. The yang essence of the Northern Dipper causes the five viscera to generate spontaneously, thus attaining the immortal’s vision and ascending to the Highest Clarity. On the new moon, visualize the Purple Canopy of the Flowery Court; only on the first day of the month visualize the stars above and below the mat dividing their essence to enter the Grotto Chamber. First visualize the Nine August Stars, then the Morning Canopy, next invoke the names of the Nine Stars, and proceed to completion.\n\nAt dawn when rising, silently click the teeth fourteen times and swallow saliva fourteen times. Recite the incantation:\n*Celestial Origin’s High Dipper, within dwell seven lads.\nHighest Clarity’s purple essence resides within my body.\nFlowery Dawn’s Purple Canopy, Primordial Palace of Grand Simplicity.\nBestow the sacred numinous qi, descending into the Grotto Chamber.\nLet me ascend as an immortal, ascending to the Jade Hall of the Grand Ultimate.*\n\nAfter the incantation, visualize the nine stars vanishing abruptly. The Morning Canopy of the evening and stems likewise vanish. The \"rising at dawn\" refers to those who practice this method exclusively. If other tasks are undertaken during the night, one should also recite the incantation before rising.\n\n**Returning to the Origin Formula**\nThe Master says: Though *Rushing the Celestial Stem and Reclining with the Dipper* have been practiced, those of lesser learning who have accumulated merit and unclean sins yet unable to dissolve them must perform this method to repent and wash away transgressions before ascending as perfected. On every *ding-mao* day at midnight, sit upright on the bed facing north, press the hands, close the eyes, click the teeth seven times, and visualize the Seven Stars shining brilliantly in the heavens.\n\nThe incantation states: Visualize the radiant star descending from the Dipper and flying into your mouth, its light dispersing like the sun before settling in your heart, illuminating both within and without. Then visualize one yang-bright star missing from the Dipper, the rest remaining as before. For the first, the Great Star—*Xuan Shu Yang Ming*, Celestial Pivot, *Hun* Spirit, Supreme Lord of the Upper Mystery—recite seven times. May the yang transgressions and yin sins of my seven generations, down to my own person, all be dissolved. May all I aspire to come to pass, and ten thousand affairs align with my heart. May I tread the Seven Stars, inclining toward heaven. May my name be inscribed among the Dipper and Celestial Stems, extending my years by countless eons.\n\nOn the *ding-chou* day at midnight, sit upright on the bed facing north, press the hands, close the eyes, click the teeth seven times, and visualize the Seven Stars shining brilliantly in the heavens. The incantation states: Visualize the yin-essence star descending from the Dipper and flying into your mouth, settling in your lungs, the rest as before. For the second, the Origin Star—*Bei Tai Yin Jing*, Northern Terrace, *Hun* Spirit, Supreme Lord of the Upper Mystery—recite seven times. May the yang transgressions and yin sins of my seven generations, down to my own person, all be dissolved. May all I aspire to come to pass, and ten thousand affairs align with my heart. May I tread the Seven Stars, filling the Four Spirits. May I soar through the Seven Origins, my name inscribed in the Jade Void, ascending to the Purple Clarity. May my dark chariot be absent, my comings and goings auspicious and upright, in harmony with heaven.\n\nOn the *ding-hai* night at midnight, sit upright on the bed facing north, press the hands, close the eyes, click the teeth seven times, and visualize the Seven Stars shining brilliantly in the northern sky for a long while. The incantation states: Visualize the Perfected Person Star flying into your mouth and settling in your lungs. After visualization, bow twice with the heart, swallow saliva, and click the teeth, the rest as before. For the third, the True August—*Jiu Ji Shang Zhen*, Supreme Perfected of the Nine Poles, *Po* Essence, Supreme Lord of the Plain Mystery—recite seven times. May the living sins, dead transgressions, accumulated evils, hidden faults, and offenses against the Three Officials of Heaven, Earth, and Water of my seven ancestors, down to my own person, all be eradicated. May my eyes see clearly, penetrating the hidden and obscure. May I soar through the Seven Origins, my name inscribed in the Upper Clarity. May I command the myriad spirits, ascending to the Jade Court. May I ride the luminous chariot through the void, inclining toward heaven.\n\nOn the *ding-you* night at midnight, sit upright on the bed facing north, press the hands, close the eyes, click the teeth seven times, and visualize the Seven Stars shining brilliantly in the northern sky for a long while. The incantation states: For the fourth, the Pivot Star—*Xuan Gen Xuan Ming*, Mystic Root, *Po* Essence, Supreme Lord of the Void—recite seven times. May the countless sins of ingratitude, lack of virtue, unkindness, and unfiliality, along with yin evils of my seven ancestors, down to my own person, all be diminished. May I ingest essence and absorb qi, daily advancing. May I ascend the Seven Origins, my name inscribed in the Great Mystery. May I be ranked among the Jade Emperor, riding the whirlwind through the Nine Heavens. May I command the spirit-spirits, renewing with the sun and moon.\n\nOn the *ding-wei* night at midnight, sit upright on the bed facing north, press the hands, close the eyes, click the teeth seven times, and visualize the Seven Stars shining brilliantly in the northern sky for a long while. The incantation states: Visualize the Cinnabar Origin Star flying into your mouth and settling in your stomach. Swallow saliva twenty-seven times, the rest as before. For the fifth, the Network Star—*Tai Ping Dan Yuan*, Great Peace, Cinnabar Origin, *Po* Spirit, Supreme Star Lord of the Upper Mystery—recite seven times. May the deep and profound inner and outer defilements and sins, numbering in the thousands of millions and billions, recorded in the hidden passes of my seven ancestors, down to my own person, all be eradicated. May the Jade Maiden attend on the right and the Jade Youth on the left in the Purple Palace of the Great Mystery’s Plain Luminance, their radiance matching the sun and moon, and may I be enthroned as a Perfected King.\n\nOn the *ding-si* day at midnight, sit upright on the bed facing north, press the hands, close the eyes, click the teeth seven times, and visualize the Seven Stars shining brilliantly in the northern sky for a long while. The incantation states: Visualize the Northern Culmen Star Lord entering your mouth and settling in your kidneys, on the left on yang days and the right on yin days. Swallow saliva fourteen times, the rest as before. For the sixth, the Chronicle Star—*Ming Ji Bei Ji*, Life Mechanism, Northern Culmen, *Hun* Spirit, Sevenfold Cinnabar August Lord of the Void—recite seven times. May the sins of treachery, evil, rebellion, and deceit recorded before the Emperor Lord of my seven ancestors, down to my own person, all be eradicated. May the hundred ailments be cured, and my body’s qi be upright and auspicious. May my name be inscribed on the Immortal Terrace, ranked in the Upper Clarity, commanding the myriad spirits.\n\nOn the night of the last day of the lunar month after midnight, before the cock crows, sit upright outside the bed facing east, press the hands, click the teeth, and visualize the Seven Stars shining brilliantly in the northern sky for a long while. The incantation states: Visualize the Celestial Pass Star flying into your pupils, on the left on yang days and the right on yin days, illuminating both eyes within and without. For the seventh, the Pass Star—*Xuan Yang Yao Guang*, Mystic Yang, Celestial Pass, Great Brilliance, Supreme August Lord of the Dao—recite seven times. May the sins of ignorance, rebellion, the Five Punishments, and the Five Crimes, along with the countless spirits within my body recorded in the Ghost Palace of the Northern Emperor of my seven ancestors, down to my own person, all be eradicated. May my spirit and essence permeate in eight directions, enabling me to sit and vanish at will. May my ears hear the subtlest sounds, and may I share in the purple light. May my name be inscribed on the Jade Plain, penetrating the forms of ghosts. May my name be recorded in the Imperial Carriage, my life equal to the Two Luminaries. May I soar through the Seven Origins, reposing in the Purple Clarity.\n\nOn the *liu-jia* day at midnight, sit on the bed facing any direction, clench the fists, close the qi, and harmonize the breath for a long while. Click the teeth nine times, and visualize the Nine August Lords of the Northern Dipper shining brilliantly above your crown, their radiance intermingling. The incantation states: Visualize the two Imperial Honored Stars descending and flying into the *Ni Wan* Palace, illuminating within and without, generating purple light. Swallow saliva twenty-seven times. If the day coincides with *liu-jia*, *liu-ding*, or the last day of the month, repeat the practice. For the eighth, the Imperial Star—*Gao Shang Yu Huang*, Lofty Supreme Jade Emperor, Eightfold Numinous Origin Lord—and the ninth, the Honored Star—*Tai Wei Yu Di*, Supreme August Jade Emperor, Sevenfold Origin Lord of the Plain Mystery—recite nine times. May the sins of my nine generations of parents, down to my own person—whether great or small, recorded in the death registers, hidden yin evils, concealed treacheries, deceits, and the countless offenses listed in the statutes of the Ghost Emperor Deng Shan, inscribed in the Black Register of the Nine Origins of the Supreme Perfected of the Northern Culmen—be beseeched before the Nine Heavens’ Primordial Supreme Honored Emperor King and the Primordial Lord, that all sins be dissolved.\n\nAscend the Seven Paths of Flight to reach the Jade Purity. Roam the Great Primordium, riding the radiance as dawn arises. Feast in the Northern Eight Simplicities, inclining toward the sun. Gather to pay homage to the Perfected Consorts, commanding and governing the myriad spirits. Here ends the *High Ascent Inner Radiance Jade Scripture* of the Supreme Three Heavens’ Jade Hall, the True Capital.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "无上三天玉堂正宗高奔内景玉书 书名：元上三天玉堂正宗高奔内景玉书。 撰人不详。 二卷。 底本出处《正统道藏》洞真部方法类。 无上三天玉堂正宗高奔内景玉书卷上 师曰：夫学上道，希慕神仙，惟日精月华，乃能炼成仙道，非假玄功，则莫能合真。 所谓晶华者，夫岂求之於外，乃吾身自得之真也。 道法千门万户，曲径傍蹊，杂说纷冗，故学者多舍真入伪，弃内就外，行之愈久，功必难成。 今高奔日月之道，即是太上传祖师之秘旨，古惟口口相授，不假文辞。 今特纪之笔端盖使后世有缘者，易以寻究也。 且天以日月为精神，人身象之，故能体天而修其身，则回阳换骨，白日登晨，信即此而取效。 故《黄庭经》云：高奔日月吾上道，郁仪结璘善相保。 又云：日月光华救老残。 枯非虚语。 若夫上学之士，心开悟解，触类而长将舍有为而造无为之地。 然下士根器浅狭，非自有为而入道，则不能把握成真。 故教主以为道难言论，必在文辞。 故以玄妙，尽成于此。 若后学勤而行之，坚而守之，则可以乘云炁，履光华，入长生，通仙圣。 此法岂口耳区区之比哉。 师曰：上乘神仙之道，本不劳於存运，入修真之正路，须假符章。 且五百年而圣人生，七百年而方传有道，此道法，盖艰於得人也。 观今奉法之士，多以少年浮好，戒行不修，侮法凌师，欺天罔地，故愚辈希利，不择贤愚，因财常书，如同负贩。 夫弟子投师，既许斋金宝之礼。 而度师传化，尤宜择忠信之人。 傥弟子恃多赀而傲师，而师乃循情而求利，则致生谤讪，必自招愆。 今此高奔之书，实上天所禁之典，须在择人付度，不宜泛示非人。 苟不能倾心肘步之人，是必罔法欺心之士。 切宜谨戒，毋得有违。 初阳赤辉化生内景 咒曰： 阳生元海，自下而升。 混混阳阳，逐散群阴。 中有大神，郁仪之君。 愿降真炁，濯我真形。 师曰：学士於月旦日寅时，清斋静坐，叩齿三十六，服符。 存自身为昆仑山，下为大海，日从海底透出，光射我身，坐于峰顶。 闭息诵咒九遍，咽津九遍而坐，良久而退。 真阳初升玉虚内景 咒曰： 真景上腾，照我天门。 炎轮赫辉，开冥散昏。 阳神混合，飞出昆仑。 乘空策景，拜谒高奔。 师曰：於每月三日卯时，清齐静坐，叩齿三十六通。 存自身为昆仑山神，升其顶上。 闭息，诵咒九遍，服符。 存日升，照我己身。 服炁，一良久而退。 明阳耀光赫真内景 咒曰： 金输呈瑞，洞焕阳明。 炎光奔飞，万里流晶。 魔爽灭焰，尘垢荡消。 冲虚飞步，驭气高升。 师曰：学士於每月一日，清斋静坐，叩齿三十六通。 。 存自己身从昆仑顶上，望见日光晃耀，日中金光射我。 闭息，诵咒九遍，咽津、服符如前。 元阳火云赫赤内景 咒曰：",
      "translated_text": "**The Supreme Three Heavens Jade Hall Orthodox High Ascent Inner Radiance Jade Scripture**\n\n**Title:** *The Supreme Three Heavens Jade Hall Orthodox High Ascent Inner Radiance Jade Scripture*\nAuthor unknown. Two scrolls. Based on the *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, Methods Category.\n\n---\n\n### *The Supreme Three Heavens Jade Hall Orthodox High Ascent Inner Radiance Jade Scripture, Scroll One*\n\nThe Master said: Those who study the supreme Dao and aspire to immortality must refine themselves through the essence of the sun and the radiance of the moon, for only thus can they achieve the immortal Dao. Without the mysterious workings of the Dao, none can unite with the True. The so-called \"essence and radiance\" are not sought externally but are the innate truth of one’s own body.\n\nThe Dao’s methods number in the thousands, its paths in the tens of thousands—twisting trails and side routes, cluttered with miscellaneous teachings. Thus, scholars often abandon the true for the false, forsake the internal for the external. The longer they practice, the harder it becomes to succeed.\n\nThe *High Ascent of the Sun and Moon* is the esoteric transmission of the Most High and the ancestral masters, passed down orally from mouth to mouth without reliance on written words. Now, it is recorded in writing so that those of later generations with karmic affinity may more easily seek and investigate it.\n\nMoreover, heaven’s spirit resides in the sun and moon, and the human body mirrors this. Thus, those who embody heaven and cultivate their bodies may reverse yang, transform their bones, and ascend in broad daylight—truly, this is the path to efficacy.\n\nAs the *Yellow Court Scripture* states:\n*\"High ascent of sun and moon, my supreme Dao,\nYu Yi and Jie Lin, well-preserved in harmony.\"*\nAnd again:\n*\"The radiance of sun and moon rescues the aged and infirm.\"*\nThese are no empty words.\n\nFor those of superior learning, once their minds open and their understanding deepens, they will grasp the essence of all things and transcend effortful practice to reach the realm of effortlessness. However, those of lesser capacity, with shallow and narrow roots, cannot enter the Dao without deliberate effort—they cannot grasp and perfect the True.\n\nThus, the Teaching Master deemed the Dao difficult to express in words and necessarily relied on written discourse. Here, the profound and wondrous is fully expounded. If later scholars diligently practice and steadfastly uphold it, they may ride the clouds of qi, tread upon radiant light, attain longevity, and commune with immortals and sages. How could this method compare to mere verbal instruction?\n\nThe Master said: The supreme Dao of immortals fundamentally requires no laborious visualization or circulation. To enter the true path of cultivation, one must employ talismans and scriptures. For five hundred years, a sage is born; for seven hundred years, a true adept is transmitted this Dao. Such methods are indeed rare to find worthy recipients.\n\nObserving those who uphold the Dao today, many are young and frivolous, neglecting precepts and conduct. They disrespect the law and belittle their masters, deceiving heaven and earth. Thus, the foolish seek profit without discerning worthiness, casually transmitting texts for wealth like peddlers.\n\nWhen disciples seek a master, they offer gold and treasures as ritual gifts. Yet when masters transmit and transform, they should choose those of loyalty and integrity. If disciples rely on wealth to disdain their masters, and masters pursue profit out of favoritism, slander and fault will inevitably arise, bringing misfortune upon themselves.\n\nThis *High Ascent Scripture* is a text forbidden by the heavens. It must be transmitted only to those carefully selected; it should not be indiscriminately shown to the unworthy. If one cannot find those who wholeheartedly follow the path, they are surely those who deceive the law and their own hearts. Be strictly warned: do not violate this.\n\n---\n\n### *Initial Yang’s Crimson Radiance Transforming Inner Radiance*\n**Incantation:**\n*\"Yang arises from the Primordial Sea, ascending from below.\nChaotic yet ordered, it scatters the host of yin.\nWithin dwells the great spirit, Lord Yu Yi.\nMay true qi descend to bathe my true form.\"*\n\nThe Master said: On the first day of the lunar month at the *yin* hour (3–5 AM), purify yourself, sit in stillness, and knock your teeth thirty-six times. Ingest the talisman. Visualize your body as Kunlun Mountain, with a great sea below. The sun emerges from the sea’s depths, its light illuminating your body as you sit atop the peak. Hold your breath, recite the incantation nine times, swallow saliva nine times, and remain seated for a long while before retiring.\n\n---\n\n### *True Yang Ascending Jade Void Inner Radiance*\n**Incantation:**\n*\"True radiance ascends, illuminating my Celestial Gate.\nThe blazing wheel’s brilliance dispels darkness and disperses gloom.\nYang spirit merges, flying forth from Kunlun.\nRiding the void, I urge the radiance onward to pay homage to the High Ascent.\"*\n\nThe Master said: On the third day of the lunar month at the *mao* hour (5–7 AM), purify yourself, sit in stillness, and knock your teeth thirty-six times. Visualize your body as the spirit of Kunlun Mountain, ascending to its summit. Hold your breath, recite the incantation nine times, and ingest the talisman. Visualize the sun rising, illuminating your body. Ingest qi, remain for a long while, then retire.\n\n---\n\n### *Luminous Yang’s Radiant Brilliance Illuminating True Inner Radiance*\n**Incantation:**\n*\"Golden wheels manifest auspiciousness, resplendent with yang’s brilliance.\nFlaming light soars, streaming crystal across ten thousand leagues.\nDemonic obscurity extinguishes its flames; dust and grime dissolve.\nSoaring through the void, I ride qi to ascend on high.\"*\n\nThe Master said: On the first day of the lunar month, purify yourself, sit in stillness, and knock your teeth thirty-six times. Visualize your body atop Kunlun’s summit, gazing upon the sun’s dazzling radiance, its golden light piercing you. Hold your breath, recite the incantation nine times, swallow saliva, and ingest the talisman as before.\n\n---\n\n### *Primordial Yang’s Fiery Clouds Crimson Inner Radiance*\n**Incantation:**",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1072,
      "start_sentence": 0,
      "end_sentence": 61,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.22144913673401,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\无上三天玉堂正宗高奕内景玉书.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "神迸云衢，运驾灵乌。 冲融无碍，升入虚元。 真阳梵炁，自然合符。 内炼成功，上朝玉都。 师曰：学士於每月九日，清斋静坐，叩齿三十六通。 存日降火云成桥，我身从昆仑峰顶，骑火云上奔日宫。 未升且服其炁，觉暖，方闭息、诵咒如前。 洞阳火龙奔飞内景 咒曰： 火龙前驱，透顶光飞。 神入无何，朝拜郁仪。 瞬目上御，混合灵辉。 一直逐本，烧灭彭尸。 师曰：学士於每月十二日，清斋静坐，叩齿二十六通。 存自己如前，从峰顶，乘金龙驾火桥，上奔日宫。 次山下瑞炁和暖。 闭息，诵咒九过，咽津九过，服火炁，觉通身如春色也。 正阳朝拜灵辉内景 咒曰：",
      "translated_text": "**Incantation:**\n*\"Divine spirits surge through cloud-lit thoroughfares, charioting the numinous crow.\nUnobstructed, soaring and merging, ascending into the void’s origin.\nTrue yang’s sacred qi naturally aligns with the talisman.\nInner refinement complete, I ascend to pay homage at Jade Capital.\"*\n\nThe Master said: On the ninth day of the lunar month, purify yourself, sit in stillness, and knock your teeth thirty-six times. Visualize fire clouds descending to form a bridge, your body atop Kunlun’s summit riding the fire clouds toward the Solar Palace. Before ascending, ingest its qi until warmth is felt, then hold your breath and recite the incantation as before.\n\n---\n\n**Fiery Yang’s Soaring Fire Dragon Inner Radiance**\n**Incantation:**\n*\"Fire dragons lead the way, piercing the crown with flying light.\nSpirits enter the boundless, paying homage to Yu Yi.\nIn a blink, I ascend and merge, blending with numinous brilliance.\nUnwavering, I pursue the root, burning away Peng’s corpse.\"*\n\nThe Master said: On the twelfth day of the lunar month, purify yourself, sit in stillness, and knock your teeth twenty-six times. Visualize yourself as before, from the summit riding a golden dragon across the fire bridge, soaring toward the Solar Palace. Then, the auspicious qi below the mountain harmonizes and warms. Hold your breath, recite the incantation nine times, swallow saliva nine times, ingest the fire qi, and feel your entire body suffused with spring’s warmth.\n\n---\n\n**True Yang’s Homage to Numinous Brilliance Inner Radiance**\n**Incantation:**",
      "overlap_context": "ime dissolve.\nSoaring through the void, I ride qi to ascend on high.\"*\n\nThe Master said: On the first day of the lunar month, purify yourself, sit in stillness, and knock your teeth thirty-six times. Visualize your body atop Kunlun’s summit, gazing upon the sun’s dazzling radiance, its golden light piercing you. Hold your breath, recite the incantation nine times, swallow saliva, and ingest the talisman as before.\n\n---\n\n### *Primordial Yang’s Fiery Clouds Crimson Inner Radiance*\n**Incantation:**",
      "start_char": 1072,
      "end_char": 1343,
      "start_sentence": 62,
      "end_sentence": 80,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.499755859375,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\无上三天玉堂正宗高奕内景玉书.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "乘阳真光，跃入金门。 阴秽烧烬，朝拜高尊。 灵炁归我，窍窍光明。 神冥内炼，变出仙魂。 师曰：学士於每月十五日，如前诵咒、服符、叩齿、咽津按数。 存身入日，朝拜帝君，奏所愿学仙之事，良久而退。 正阳灵光通明内景 咒曰： 旸宫炳焰，服御灵光。 八窗通明，九户辉煌。 形神归源，炁炼光芒。 濯炼无漏，谷神飞翔。 师曰：学士行之至此，身入纯阳，当诵咒八十一遍，服符御炁，叩齿咽津。 存身入日官，正坐，服光取炁，灵乌吐光，入兆口中，遍身光明。 系每月十七日午时，行持此法。 纯阳金耀焕明内景 咒曰： 天景混形，神炁合天。 离明真火，即我三田。 去来自如，飞腾自然。 纯阳备体，位得神仙。 师曰：学士於每月二十日，如前行持。 次存身在日中，内外混同，和暖自然，九芒散辉，普天大赤。 诵咒八十一遍，叩齿，咽津，服符，良久而退。 九阳离明真炁郁仪内景 咒曰： 洞阳炁赤，赫赫洗晶。 阴散阳会，育我真形。 形神俱化，混合离明。 冶炼自然，数周飞腾。 师曰：学士於每月二十日、二十五日晦日，诵咒、服符、叩齿、咽津如前。 存身与太阳混而为一，不见我形，但混光而已。 行之一年无病，二年神壮体轻，三年尸魄消荡，五年可以御炁乘光。 久久不怠，帝君下盻，真仙为友，白日登晨。 戒之。 素华始玄初元内景 呎曰： 溟涬虚玄，混混真源。 华景未露，玄轮自圆。 会合初基，象帝之先。 依时服炼，炁入玄玄。 师曰：每遇月朔夜，如前法诵咒九遍。 存自己为昆仑，山下为大海，渺渺无际，水底透起月轮黑色，未有光彩。 我服其始玄之炁，良久，咽津、叩齿，如诵咒之数。 清光太初生辉内景 咒曰： 真景初生，阴中至阳。 水泛玄输，金露微芒。 津源畅通，辉映琼房。 炁增光盛，服御飞翔。 师曰：学士於每月初二日夜，静坐清斋。 存自己如昆仑山，身坐山顶，望海边月出如钧，水轮上圆。 叩齿、咽津，各三九遍。 诵咒，服符，御炁，良久而退。 晶光清明耀华内景 咒曰： 景散天池，金水半规。 光开幽夜，照我玄珠。 饮泛晶浆，香透灵躯。 数用真会，乘景冲飞。 师曰： 学士每遇初七日，清齐静坐。 存自己登昆仑之顶，仰望月光如半规。 诵咒二十四遍，服符、咽津，各如诵咒之数。 御炁，良久而退。 玉光澄辉高明内景 咒曰：法轮飞天，玄之又玄。 清波湛湛，黄华涓涓。 荡涤尸垢，滋养丹田。 高奔内景，结璘光圆。 师曰：学士每遇十三日夜，清斋静坐。 存自己升昆仑之顶，望月光芒。 诵咒三十六遍，叩齿、咽津，亦各三十六。 服符，御炁，良久而退。 圆光灵明洞照内景 咒曰： 琼输光辉，全盈不亏。 玄景澄彻，神扃启扉。 中有高尊，琼冠羽衣。 愿降灵炁，赴我归期。 师曰：学士每遇月望日，清斋静坐。 存身立昆仑顶上，月圆光满，月中降水云成桥，光烂如银。 我服其炁，未升。 诵咒三十六遍，叩齿、咽津、亦如之。 服符，御炁，良久而退。 咒曰： 天源周流，光透重楼。 霄映十方，五液荡幽。 冲虚摄景，真身飞浮。 一真上朝，阳九无忧。 师曰：既如前行，再於十六日，存月中真水成桥，下接昆仑，我身乘彩凤入月中。 诵咒八十一遍，叩齿、咽津，亦如之。 服符，御炁，良久而退。 金光清虚含真内景",
      "translated_text": "**Riding the True Yang’s Radiance, I leap into the Golden Gate.**\n**Yin’s filth burns to ash, as I pay homage to the Lofty Honored One.**\n**Numinous qi returns to me, illuminating every aperture with light.**\n**Spirit merges with inner refinement, transforming to birth the immortal soul.**\n\nThe Master said: On the fifteenth day of the lunar month, recite the incantation, ingest the talisman, knock the teeth, and swallow saliva as before in number. Visualize yourself entering the sun to pay homage to the Imperial Lord, presenting your aspiration to study the Dao of immortality. After a long while, withdraw.\n\n**True Yang’s Numinous Radiance Illuminating the Inner Landscape**\n**Incantation:**\n*Radiance of the Solar Palace blazes bright, as I don the numinous light.*\n*Eight windows shine clear, nine portals glow resplendent.*\n*Form and spirit return to the source, qi refines into radiance.*\n*Washed and refined, without leakage, the Valley Spirit soars.*\n\nThe Master said: When the adept reaches this stage, having entered pure Yang, recite the incantation eighty-one times, ingest the talisman, absorb the qi, knock the teeth, and swallow saliva. Visualize yourself entering the Solar Palace, sitting upright to absorb the light and draw in qi. The numinous crow emits light, entering your mouth, suffusing your entire body with brilliance. This practice is to be performed at the noon hour on the seventeenth day of each lunar month.\n\n**Pure Yang’s Golden Radiance Resplendent Inner Landscape**\n**Incantation:**\n*Heaven’s radiance merges with form, spirit and qi unite with the sky.*\n*The true fire of Li’s clarity becomes my Three Fields.*\n*Coming and going freely, soaring naturally.*\n*Pure Yang completes the body, attaining the rank of divine immortal.*\n\nThe Master said: On the twentieth day of the lunar month, perform the practice as before. Then visualize your body within the sun, inner and outer merging as one, warmth arising naturally. Nine rays scatter their brilliance, suffusing the heavens in great crimson. Recite the incantation eighty-one times, knock the teeth, swallow saliva, ingest the talisman, and after a long while, withdraw.\n\n**Nine Yang’s Li-Clarity True Qi Yu Yi’s Inner Landscape**\n**Incantation:**\n*Cavernous Yang’s qi crimson, blazing and crystalline.*\n*Yin scatters, Yang gathers, nurturing my true form.*\n*Form and spirit both transform, merging with Li’s clarity.*\n*Refinement arises naturally, cycling through countless flights.*\n\nThe Master said: On the twentieth and twenty-fifth (dark moon) days of the lunar month, recite the incantation, ingest the talisman, knock the teeth, and swallow saliva as before. Visualize your body merging with the sun as one, your form no longer visible—only the blended radiance remains. Practicing this for one year banishes illness; for two years, spirit strengthens and the body lightens; for three years, the corpse’s poisons dissolve; for five years, one may ride qi and mount light. With unwavering diligence, the Imperial Lord will gaze upon you, true immortals become your companions, and you will ascend at dawn. Take heed.\n\n**Primordial Simplicity’s Inception of the Mysterious Origin Inner Landscape**\n**Incantation:**\n*Vast and boundless, the empty profound, the chaotic true source.*\n*Flourishing radiance yet concealed, the mysterious wheel self-completes.*\n*Converging at the inception, symbolizing the Emperor’s precedence.*\n*Following the time to refine and ingest, qi enters the profound mystery.*\n\nThe Master said: On the night of each new moon, recite the incantation nine times as before. Visualize yourself as Kunlun, its base as a vast sea stretching boundlessly. From the water’s depths, the lunar wheel rises black, devoid of light. Ingest its primordial qi, and after a long while, swallow saliva and knock the teeth according to the number of incantations recited.\n\n**Luminous Clarity of the Great Inception’s Radiance Inner Landscape**\n**Incantation:**\n*True radiance first arises, utmost Yang within Yin.*\n*Water overflows the mysterious pivot, golden dew’s faint gleam.*\n*The source of fluids flows freely, illuminating the jade chamber.*\n*Qi’s light grows abundant, ingesting and soaring in flight.*\n\nThe Master said: On the night of the second day of each lunar month, sit in stillness and purify yourself. Visualize yourself as Kunlun Mountain, seated at its summit, gazing at the moon rising like a hook over the sea, its water-wheel full above. Knock the teeth and swallow saliva, each twenty-seven times. Recite the incantation, ingest the talisman, absorb the qi, and after a long while, withdraw.\n\n**Crystal Radiance’s Luminous Flourishing Inner Landscape**\n**Incantation:**\n*Radiance scatters in the celestial pond, gold and water half-formed.*\n*Light pierces the dark night, illuminating my mysterious pearl.*\n*Drinking the crystalline nectar, fragrance permeates the numinous body.*\n*Through true convergence of numbers, ride the radiance in soaring flight.*\n\nThe Master said: On the seventh day of each lunar month, purify yourself and sit in stillness. Visualize yourself ascending Kunlun’s summit, gazing at the moon’s light like a half-formed wheel. Recite the incantation twenty-four times, ingest the talisman, and swallow saliva according to the number of incantations. Absorb the qi, and after a long while, withdraw.\n\n**Jade Radiance’s Limpid Brilliance Illuminating the Inner Landscape**\n**Incantation:**\n*The Dharma Wheel soars in the heavens, profound within the profound.*\n*Clear waves shimmer, golden blossoms trickle.*\n*Washing away the corpse’s filth, nourishing the Cinnabar Field.*\n*Soaring high into the inner landscape, condensing the radiant orb’s perfection.*\n\nThe Master said: On the night of the thirteenth day of each lunar month, purify yourself and sit in stillness. Visualize yourself ascending Kunlun’s summit, gazing at the moon’s radiance. Recite the incantation thirty-six times, knock the teeth, and swallow saliva, each thirty-six times. Ingest the talisman, absorb the qi, and after a long while, withdraw.\n\n**Full Radiance’s Numinous Clarity Pervading Illumination Inner Landscape**\n**Incantation:**\n*The jade pivot’s radiance, full and unwaning.*\n*The mysterious radiance limpid and clear, the spirit’s gate opens its doors.*\n*Within stands the Lofty Honored One, crowned in jade, robed in feathers.*\n*May the numinous qi descend, hastening my return’s appointed time.*\n\nThe Master said: On the night of each full moon, purify yourself and sit in stillness. Visualize yourself standing atop Kunlun’s summit, the moon full and brimming with light. From the moon, water and clouds form a bridge, gleaming like silver. Ingest its qi without ascending. Recite the incantation thirty-six times, knock the teeth, and swallow saliva likewise. Ingest the talisman, absorb the qi, and after a long while, withdraw.\n\n**Incantation:**\n*The celestial source flows in cycles, light piercing the layered towers.*\n*Dawn’s glow illumines the ten directions, the five fluids dispel the obscure.*\n*Soaring emptiness captures the radiance, the true body floats in flight.*\n*With one true ascent to pay homage, the nine Yangs hold no peril.*\n\nThe Master said: Proceeding as before, on the sixteenth day, visualize the moon’s true water forming a bridge, descending to connect with Kunlun. Your body rides a multicolored phoenix into the moon. Recite the incantation eighty-one times, knock the teeth, and swallow saliva likewise. Ingest the talisman, absorb the qi, and after a long while, withdraw.\n\n**Golden Radiance’s Pure Emptiness Embracing the True Inner Landscape**",
      "overlap_context": "y yourself, sit in stillness, and knock your teeth twenty-six times. Visualize yourself as before, from the summit riding a golden dragon across the fire bridge, soaring toward the Solar Palace. Then, the auspicious qi below the mountain harmonizes and warms. Hold your breath, recite the incantation nine times, swallow saliva nine times, ingest the fire qi, and feel your entire body suffused with spring’s warmth.\n\n---\n\n**True Yang’s Homage to Numinous Brilliance Inner Radiance**\n**Incantation:**",
      "start_char": 1343,
      "end_char": 2660,
      "start_sentence": 81,
      "end_sentence": 173,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.291266202926636,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\无上三天玉堂正宗高奕内景玉书.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "咒曰： 灵辉膛朦，身造玄宫。 朝拜结璘，有愿立从。 咀嚼玄华，服御灵风。 尸魄荡散，神变仙容。 师曰：学士再思入月官，朝拜皇君，所愿学仙之事。 服符、诵咒、叩齿、咽津，各四十九度，乃十七日夜也。 师曰：奔月者，止有两旬，过此，则亏光矣，故此迭日行之。 神光无上虚澄内景 咒曰： 月是我神，神随月并。 内符外合，变化真形。 秀结华房，上开金英。 功成无漏，上升玉京。 师曰：学士於十八日，存身在月中，内外洞明。 服符，诵咒六十遍，咽津九口，叩齿九通。 觉金光四散，普天光明。 然后御炁，良久而退。 定光清泠玉光结璘内景 咒曰： 圆轮魄回，幽衢夜开。 玉虚混景，金光徘徊。 津源畅通，照彻灵台。 香浮甘露，变我仙胎。 师曰：学士至此，与月混一。 当存身与太皇混一而同，不见我形，但清明而已。 行之十日，则其功尤倍於太阳矣。 但学者戒行未修，立志未专耳，虽然拈起放下时一，存之尤可延生度世，况专修者乎。 朝光化景 师曰：学士复於下旬存此景，以俟云驭生虚无也。 混真颂 飞扬灵驾出华房，玉壶瑞气腾真光，太和瑞结水火乡。 中有真人佩琼珰，高奔冉冉散天香，出虚入元阴变阳。 混混溶溶金醴浆，灌溉百骸自长生，稽首元上玉虚皇。 师曰：下士根器浅陋，未知澄寂圆通长生自然之道，须假存运行之。 然行之既专久，则与道通仙。 但此法甚秘，人鲜能知此。 苟有知者，未必能行，行者未必能久，所以仙人道师，谨於择人付度也。 行持之人，入靖不许作声、咳唾，忌与人语。 行之精久，飞神驭空，去来无碍，同得仙真。 则知此文，乃天师飞腾太空之秘，学者宝之。 无上三天玉堂正宗高奔内景玉书卷上竟 无上三天玉堂正宗高奔内景玉书卷下 师曰：护身延生者，莫大於斗真拘魂炼阳九光於罡炁。 故圣人云：出入斗中，身强炁盛，延寿益算，万邪皆避者是已。 又云：万法皆从斗出，万神皆从斗役，是知一切法、一切行持，非斗莫能通应。 故圣师必以升斗度人者，以异学士通仙致真，存无守有，坐役三界，制御六天，则此法实三奔之一秘，登真之阶梯也，可不敬之。 第一太星精，名玄枢神，四阳明魂，曰天枢魂。 神斗天之太尉，司政，主非。 上极九天，中监五岳飞仙，下领学真之人，天地神灵，莫不隶焉。 第二元星精，名北台神，名阴精魂，曰天璇魂。 神斗天之上宰、主禄。 上总天宿，下领万灵，学仙之人莫不隶焉。 第三真星精，名允极上真神，曰真人魂，曰天机魂。 神斗天之司空，主神仙。 上总九天高真，中监五岳灵仙，下领学道求仙之人，莫不隶焉。 第四纽星精，名游根神，曰玄冥魂，曰天枢魄。 灵斗天之游击，主伐逆。 上总九天鬼神，中领北帝三官，下监万兆，伐逆不臣，悉隶焉。 第五纲星精，名太平神，曰丹元魄，曰玉卫魄。 灵斗天之斗君，主命录籍。 上总九天谱录，中统鬼神簿目，下领学真兆民合籍，悉隶焉。 第六纪星精，名命机神，曰北极魄，曰阅阳魂。 灵斗天之太常，主升进。 上总九天上真，中总五岳飞仙，下领学道之身。 凡有功勤，得转轮阶级。 第七关星精，名亢阳神，曰天关魂，曰摇光。 大明斗天之上帝，王天地截运，如四时长短，天地否泰，劫会推迁，莫不隶焉。",
      "translated_text": "**Incantation:**\n*Divine radiance veils in mist, the body ascends to the Mystic Palace.*\n*Pay homage to form the luminous essence—vows are instantly fulfilled.*\n*Chew the Mystic Flower, ingest the numinous wind.*\n*The corpse-soul scatters, the spirit transforms into immortal visage.*\n\nThe Master said: Once more, the adept visualizes entering the Moon Palace to pay homage to the August Sovereign, offering prayers for the pursuit of immortality. Ingest the talisman, recite the incantation, knock the teeth, and swallow saliva—each forty-nine times—on the night of the seventeenth day.\n\nThe Master said: The journey to the moon spans but two ten-day periods; beyond this, its light wanes. Thus, these practices must be performed in succession.\n\n**Unsurpassed Divine Radiance of Void Clarity and Inner Landscape**\n\n**Incantation:**\n*The moon is my spirit, the spirit follows the moon as one.*\n*Inner talisman and outer form unite, transmuting into true shape.*\n*Elegance gathers in the Flower Chamber, above blooms the Golden Blossom.*\n*Merit perfected, without leakage, ascending to Jade Capital.*\n\nThe Master said: On the eighteenth day, the adept visualizes the body within the moon, inwardly and outwardly luminous and clear. Ingest the talisman, recite the incantation sixty times, swallow saliva nine times, and knock the teeth nine times. Perceive golden radiance scattering in all directions, illuminating the heavens with light. Then absorb the *qi*, and after a long while, withdraw.\n\n**Fixed Radiance of Pure Cold Jade and Luminous Essence Inner Landscape**\n\n**Incantation:**\n*The round wheel’s essence revolves, the hidden paths of night unfold.*\n*Jade Void merges with radiance, golden light lingers in cycles.*\n*The source of fluids flows unimpeded, illuminating the Spirit Terrace.*\n*Fragrant sweet dew floats, transmuting my immortal embryo.*\n\nThe Master said: By this stage, the adept merges as one with the moon. Visualize the body uniting with the Supreme August One, no longer perceiving one’s form—only clarity remains. Practicing this for ten days, the merit surpasses even that of the solar practices. Yet if the adept’s precepts are unrefined and resolve unsteady, though one may grasp and release in fleeting moments, persistence still extends life and transcends the world—how much more so for the devoted?\n\n**Morning Radiance Transforming the Landscape**\n\nThe Master said: The adept again visualizes this scene in the latter ten-day period, awaiting the cloud chariot’s ascent into the Void.\n\n**Hymn of Primal Unity**\n*The spirit’s carriage soars from the Flower Chamber,*\n*The Jade Flask’s auspicious *qi* ascends with true radiance.*\n*Supreme Harmony’s fortune binds the realms of Water and Fire.*\n*Within dwells the True One, girded with jade pendants,*\n*Loftily ascending, wafting celestial fragrance,*\n*Emerging from the Void, entering the Origin—Yin transforms into Yang.*\n*Vast and boundless, the golden elixir’s nectar*\n*Irrigates the hundred bones, ensuring longevity.*\n*Bow to the Primal Jade Void Sovereign above.*\n\nThe Master said: Lesser adepts, of shallow capacity, know not the Way of natural longevity through clarity, stillness, and perfect penetration. They must rely on visualization and circulation. Yet with devoted and prolonged practice, they merge with the Dao and attain immortality. This method is most esoteric, rarely known. Even those who know may not practice; those who practice may not persist. Thus, immortal masters and Daoist preceptors carefully select disciples for transmission.\n\nThe practitioner, when entering seclusion, must not make a sound, cough, or spit, nor speak to others. With precision and persistence, the spirit soars through the void, coming and going without hindrance, uniting with the immortal perfected. Know then that this text holds the Celestial Master’s secret of soaring through the heavens—treasure it.\n\n**The Supreme Three Heavens Jade Hall Orthodox Lineage’s High Ascent Inner Landscape Jade Scripture, Volume One Concludes**\n**The Supreme Three Heavens Jade Hall Orthodox Lineage’s High Ascent Inner Landscape Jade Scripture, Volume Two**\n\nThe Master said: For protecting the body and prolonging life, nothing surpasses the true Dipper’s restraint of the soul and refinement of the Nine Yangs’ radiance within the *qi* of the *Gang*. Thus, the sages declared: *\"Entering and exiting the Dipper, the body grows strong, the *qi* flourishes, life extends, and destiny increases—all evil flees.\"* They also said: *\"All methods emerge from the Dipper; all spirits are commanded by the Dipper.\"* Thus, every method and practice depends on the Dipper for efficacy. Therefore, the sagely masters invariably employ the Dipper’s ascent to transmit the Dao, guiding adepts toward immortality and truth. By preserving the Void and embracing the Real, one sits to command the Three Realms, governs the Six Heavens—this method is indeed one of the Three Ascents’ secrets, the ladder to transcendence. How could one not revere it?\n\n**First: The Great Star Essence**\nNamed the *Mysterious Pivot Spirit*, the *Four Yang Bright Souls*, called the *Celestial Pivot Soul*.\nThe spirit of the Dipper Heaven’s Grand Commandant, overseeing governance and transgressions.\nAbove, it reaches the Nine Heavens; in the middle, it supervises the Five Peaks’ flying immortals; below, it commands those who study the truth. All celestial and terrestrial spirits submit to it.\n\n**Second: The Primordial Star Essence**\nNamed the *Northern Terrace Spirit*, the *Yin Essence Soul*, called the *Celestial Rotator Soul*.\nThe spirit of the Dipper Heaven’s Chief Minister, overseeing emoluments.\nAbove, it governs the celestial lodges; below, it commands the myriad spirits. Those who study immortality submit to it.\n\n**Third: The True Star Essence**\nNamed the *Utmost Ultimate Supreme True Spirit*, the *True Person Soul*, called the *Celestial Mechanism Soul*.\nThe spirit of the Dipper Heaven’s Minister of Works, overseeing immortals.\nAbove, it governs the Nine Heavens’ lofty perfected; in the middle, it supervises the Five Peaks’ numinous immortals; below, it commands those who seek the Dao and immortality. All submit to it.\n\n**Fourth: The Pivot Star Essence**\nNamed the *Wandering Root Spirit*, the *Mysterious Dark Soul*, called the *Celestial Pivot Vital Breath*.\nThe spirit of the Dipper Heaven’s Mobile Striker, overseeing the punishment of rebels.\nAbove, it governs the Nine Heavens’ ghosts and spirits; in the middle, it commands the Northern Emperor’s Three Offices; below, it oversees the myriad multitudes, punishing rebels and the disloyal. All submit to it.\n\n**Fifth: The Network Star Essence**\nNamed the *Great Peace Spirit*, the *Cinnabar Origin Vital Breath*, called the *Jade Guard Vital Breath*.\nThe spirit of the Dipper Heaven’s Dipper Lord, overseeing life records.\nAbove, it governs the Nine Heavens’ registers; in the middle, it administers the ghosts and spirits’ ledgers; below, it commands the records of those who study the truth and the common people. All submit to it.\n\n**Sixth: The Chronicle Star Essence**\nNamed the *Life Mechanism Spirit*, the *Northern Culmen Vital Breath*, called the *Yin-Scanning Soul*.\nThe spirit of the Dipper Heaven’s Grand Master of Ceremonies, overseeing advancement.\nAbove, it governs the Nine Heavens’ lofty perfected; in the middle, it commands the Five Peaks’ flying immortals; below, it oversees the bodies of Dao students. All who accumulate merit ascend through the ranks.\n\n**Seventh: The Barrier Star Essence**\nNamed the *Prosperous Yang Spirit*, the *Celestial Barrier Soul*, called the *Shaking Radiance*.\nThe Great Brilliance of the Dipper Heaven’s Emperor, ruling the severance and continuity of Heaven and Earth, such as the length of the four seasons, the prosperity or decline of Heaven and Earth, and the shifts of kalpas. All submit to it.",
      "overlap_context": "*\n*With one true ascent to pay homage, the nine Yangs hold no peril.*\n\nThe Master said: Proceeding as before, on the sixteenth day, visualize the moon’s true water forming a bridge, descending to connect with Kunlun. Your body rides a multicolored phoenix into the moon. Recite the incantation eighty-one times, knock the teeth, and swallow saliva likewise. Ingest the talisman, absorb the qi, and after a long while, withdraw.\n\n**Golden Radiance’s Pure Emptiness Embracing the True Inner Landscape**",
      "start_char": 2660,
      "end_char": 3953,
      "start_sentence": 174,
      "end_sentence": 241,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.473122358322144,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\无上三天玉堂正宗高奕内景玉书.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "第八帝星，名曰高上玉皇神，曰八景虚元君。 第九尊星，名日太微玉帝神，曰七晨七素君。 二星是帝星大尊精神也，见之者寿，修之者仙。 昔汉相霍光家奴名还车，忽见二星在斗中，明非常，乃拜而还，遂年六百岁。 师曰：常以月三七日夜半入室，按手定炁，闭目内视，乃一身冉冉起上，飞升北斗魁中，背真人星坐。 良久为之，觉我形如在斗中也。 极念为之，常觉体中热，是真炁合德。 存斗中星辰，光下注我身，照映内外。 又存九星三大神。 次存三元大神。 上元大神，名奇剑，字灵刚，着紫宸凤羽紫帔，虎锦丹裳，左佩，右珰，两手握流金火铃。 中元大神，名旋度，字素康，项负圆光，扶晨冠，绛羽帔，龙带虎裳。 下元大神，名抗萌，字流郁，着扶华绿冠，黄凤羽帔，龙衣虎带，佩流金火铃，手把日芒。 三神与我对坐，令背元辰坐。 我心拜之，精思恍惚，存三大神问：何不速来稽首？ 答曰：畏六天三官众魔。 三神共怒，振铃吐气，焕激八方。 又忽见一女子，状如婴儿，在三神前向我坐，吐紫烟，直入心中，呼日：斗中九精阴灵玉清上妃，名密华，字邻倩。 仍咽液九过，叩齿九通，左手抚心。 咒曰：",
      "translated_text": "**Eighth: The Sovereign Star**\nNamed the *Exalted Jade Emperor Spirit*, the *Lord of Eightfold Radiance and Primal Void*.\n\n**Ninth: The Venerable Star**\nNamed the *Grand Tenuity Jade Emperor Spirit*, the *Lord of Seven Mornings and Seven Essences*.\n\nThese two stars are the supreme spirits of the Sovereign Stars. Those who behold them gain longevity; those who cultivate them attain immortality. In former times, a servant of Chancellor Huo Guang of the Han, named Huanche, suddenly saw the two stars within the Dipper, shining with extraordinary brilliance. He bowed and departed, and thereafter lived six hundred years.\n\nThe Master said: On the twenty-first night of the month, at midnight, enter your chamber. Press your hands to settle the qi, close your eyes, and inwardly visualize your body rising gently upward, ascending into the *Kui* of the Northern Dipper, where you sit with your back to the Perfected Star. With prolonged practice, you will feel as though your form truly dwells within the Dipper. Focus your intent to the utmost, and you will sense warmth within your body—this is the true qi harmonizing with virtue. Visualize the stars of the Dipper, their light descending upon your body, illuminating you within and without. Then visualize the Three Great Spirits of the Nine Stars.\n\nFirst, the **Great Spirit of the Upper Prime**:\nNamed *Qi Jian*, styled *Ling Gang*, clad in a purple auroral robe of phoenix plumes, a tiger-patterned cinnabar skirt, with a pendant at his left and a jade ring at his right, both hands grasping fiery golden bells.\n\nNext, the **Great Spirit of the Middle Prime**:\nNamed *Xuan Du*, styled *Su Kang*, his neck bearing a halo of radiance, crowned with a *Fu Chen* coronet, draped in a crimson feathered mantle, girded with a dragon belt and tiger-patterned robe.\n\nLast, the **Great Spirit of the Lower Prime**:\nNamed *Kang Meng*, styled *Liu Yu*, wearing a *Fu Hua* coronet of green jade, a yellow phoenix-feathered mantle, a dragon robe and tiger belt, bearing fiery golden bells at his waist, and holding the rays of the sun in his hands.\n\nThe Three Spirits sit facing you, bidding you sit with your back to the Primal Star. With reverent heart, bow to them. In deep concentration, as if in a trance, visualize the Three Great Spirits asking: *Why do you not hasten to prostrate yourself?* You reply: *I fear the myriad demons of the Six Heavens and Three Officials.* The Three Spirits grow wrathful together, shaking their bells and exhaling qi, their radiance flashing across the eight directions.\n\nSuddenly, you see a maiden, her form like an infant, seated before the Three Spirits facing you. She exhales purple mist, which enters your heart, and calls out: *I am the Ninefold Essence of the Dipper’s Yin Spirit, the Jade Clarity Sovereign Consort of the Upper Realm, named Mihua, styled Linqian.* Then swallow your saliva nine times, click your teeth nine times, and press your left hand to your heart. Recite the incantation:",
      "overlap_context": " Peaks’ flying immortals; below, it oversees the bodies of Dao students. All who accumulate merit ascend through the ranks.\n\n**Seventh: The Barrier Star Essence**\nNamed the *Prosperous Yang Spirit*, the *Celestial Barrier Soul*, called the *Shaking Radiance*.\nThe Great Brilliance of the Dipper Heaven’s Emperor, ruling the severance and continuity of Heaven and Earth, such as the length of the four seasons, the prosperity or decline of Heaven and Earth, and the shifts of kalpas. All submit to it.",
      "start_char": 3954,
      "end_char": 4424,
      "start_sentence": 242,
      "end_sentence": 261,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.667325973510742,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\无上三天玉堂正宗高奕内景玉书.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "太上丹灵，玄光飙焕。 九纬启旋，晖炁澄散。 紫宸幽烛，七曜蔚散。 二景奏明，阴阳以判。 四度运昌，云津回灌。 吉辰启气，上升九元。 据斗攀罡，奉见三君。 问我稽留，何不升仙。 我则稽首，畏鬼莫前。 帝乃赫庄，口衔日根。 左破六天，右蹙邓山。 流铃上焕，魔首碎分。 逐我七魄，强我三魂。 藏斗内挥，九精在心。 紫霞洞映，飞光万寻。 和魂制魄，六胎修炼。 精感变曜，玉妃忽见。 坐当我心，俯视仰盻。 其名密华，厥字璘倩。 吐纳朱氛，和平百关。 自服锦帔，凤光鸾裙。 腰带虎录，龙章玉文。 手执月华，头巾紫冠。 腾跃太霄，驾景盖云。 书名太素，我得飞仙。 起浮空洞，垂琼太元。 上造朱房，役使万神。 纪分二度，还返婴颜。 北帝激雷，南帝火陈。 东仓启烛，赫赫雷震。 西流双扑，鸣音倡钧。 四举起跃，荐我玉真。 遂乘八景，遨游紫烟。 毕，提手如初，咽液三十过，叩齿九通。 祝毕起，向西北再拜，闭目存密华上，已上素炁。 师曰：凡一日、三日、五日，存泥丸宫，咽液五十过，叩齿九通，左手捻两眉中心，微咒曰： 太上紫晖，九通之神。 华盖七落，回耀万神。 动御高灵，静和景炁。 阴阳流灌，三炁中分。 游济无外，焕明众天。 今月启晨，来登泥丸。 无精结感，化为大神。 名曰奇剑，厥宇灵刚。 正坐斗中，游我明堂。 凤羽紫帔，虎锦丹裳。 左带玉佩，右腰金珰。 手把流铃，头巾晨光。 吐炁溉灌，泥丸以康。 魂魄和同，植华柱梁。 使我飞仙，超虚蹑空。 上造上清，策虎命龙。 北朝玉帝，琼琳上宫。 西谒太素，稽首三元。 毕，更按手， 咽液九过，叩齿九通。 又祝毕起，北向再拜。 次西北再拜。 师曰：常於七日、九日、十三日，存绛宫，咽液五十过，叩齿九通，以右第一指微搯念咒，捻心微咒曰： 太上紫真，九炁中灵。 包括万度，璇玑焕明。 飞霞流曜，晖烛玉清。 玄盖众神，来应心庭。 飞光落景，中元充盈。 六府启开，华液泯平。 魂魄制炼，得真之精。 感至触变，亿化立成。 忽见大神，正坐安房。 整然朝真，百节开通。 攀斗据魁，盻日百方。 其名璇度，厥字素康。 绛羽华帔，龙带虎裳。 身充宝曜，项负圆光。 首巾飞晨，芙冠飞昂。 使我飞仙，超浮太空。 上造紫阙，北朝玉皇。 役使万神，众灵奉迎。 心上生华，庆云永昌。 凤箫泠泠，鸾吹锵锵。 毕，更按手，咽液九过，叩齿九通。 又呎毕，再拜如前。 师曰：常於十五日、十九日、二十二日，存丹田宫，咽液六十过，叩齿九遍，以左手第二指捻人中，微咒曰： 太上紫皇，焕朗中枢。 九纬炳霭，光透太微。 万神仰镇，千神植牙。 七度捻人中。 微祝曰：分葩制阳，表顺执阴。 以和其晖，启阵玄根。 物罗□ □ ，肇月惟吉。 观应脐内，紫炁发霄。 飞光纵坠，炼我魂魄。 华精莹蔚，忽见大神。 上宫灵贵，名曰抗萌。 厥字流郁，正坐脐中。 乘斗九炁，吐纳云液。 平血理胃，黄凤羽帔。 龙衣虎带，□ 启日根。 头巾绿芙，腰流火铃。 焕电映无，使我飞仙。 超空蹑浮，上造玉房。 携带霄虚，役使万神，天地同休。 更按手，咽液二十遍，叩齿九通。 又祝乃起，向本命再拜。 师曰：已上谓之升斗奔辰，能拘魂制魄，益炁延年。 招真致灵，皆从此起。 卧斗",
      "translated_text": "The Supreme Elixir of Cinnabar, its numinous radiance flashing like a whirlwind. The nine wefts unfurl in revolution, their luminous qi diffusing and dispersing. The Purple Palace’s hidden torch, the Seven Luminaries flourish and scatter. The Two Effulgences present their brilliance, yin and yang now divided. The Four Measures turn in prosperity, cloudy ford-waters swirl and irrigate. Auspicious moments awaken qi, ascending to the Nine Origins. Grasping the Dipper, clambering the Celestial Stem, I present myself to the Three Lords. They ask why I tarry: *Why do you not ascend as an immortal?* I bow my head in reverence, saying: *I fear the ghosts and dare not advance.* The Emperor then blazes in majesty, his mouth holding the root of the sun. To the left, he shatters the Six Heavens; to the right, he tramples Mount Deng. His streaming bells blaze above, the demon chiefs shatter and disperse. He expels my seven *po*, strengthens my three *hun*. Concealed within the Dipper’s sway, the Nine Essences reside in my heart. Purple auroras glow in cavernous reflection, flying radiance spans ten thousand fathoms. Harmonizing *hun* and restraining *po*, the Six Embryos refine and temper. Through essence’s resonance, the stars transform—suddenly the Jade Consort appears. Seated upon my heart, she gazes down and looks up. Her name is Mihua, her style Linqian. She exhales and inhales crimson mist, pacifying the hundred passages. She wears a brocade mantle, phoenix-light and simurgh-skirt. Her waistband is tiger-script, her robe dragon-patterned with jade inscriptions. In her hand she holds Moon’s Splendor, her head crowned with a purple coronet. She soars into the Great Empyrean, riding a canopy of light and clouds. Inscribed as *The Great Simplicity*, I attain flight as an immortal. Rising and floating through the Hollow Cavern, I suspend jade in the Supreme Origin. Ascending to the Vermilion Chamber, I command the myriad spirits. The registers divide into two measures, returning to an infant’s visage. The Northern Emperor unleashes thunder, the Southern Emperor arrays fire. The Eastern Granary kindles its torch, resplendent with thunderous roars. The Western Flow doubles its blows, chiming tones in harmonious accord. Four times I rise and leap, presenting myself to the Jade Perfected. Then I mount the Eight Effulgences, roaming through purple mists.\n\nWhen finished, raise the hands as before, swallow saliva thirty times, and click the teeth nine times. Upon completing the incantation, rise and bow twice to the northwest, closing the eyes to visualize Mihua above, now suffused with primordial qi.\n\nThe Master says: On the first, third, and fifth days, visualize the Mud-Pill Palace, swallow saliva fifty times, click the teeth nine times, and with the left hand pinch the center between the brows while softly reciting the incantation:\n\n*Supreme Purple Radiance, spirit of the Nine Conduits. Canopy of seven descents, illuminating the myriad spirits. In motion, you command the lofty numina; in stillness, you harmonize with luminous qi. Yin and yang flow and irrigate, the Three Qi divide at the center. Roaming and crossing beyond all bounds, you illumine the host of heavens. This month, at dawn’s first light, ascend to the Mud-Pill Palace. Without essence’s congealed resonance, transform into a great spirit. Named Wondrous Sword, styled Numinous Might. Seated upright within the Dipper, roaming my Hall of Light. Phoenix-plumed purple mantle, tiger-brocade cinnabar robe. Left side girded with jade pendants, right waist adorned with golden bells. Hand grasping streaming bells, head crowned with dawn’s radiance. Exhaling qi to irrigate and bathe, the Mud-Pill Palace is made whole. Harmonizing *hun* and *po*, planting the flowering pillars and beams. Enabling my flight as an immortal, transcending the void to tread the empty. Ascending to the Supreme Clarity, driving tigers and commanding dragons. Facing north to the Jade Emperor, in the Jasper Forest’s Upper Palace. Journeying west to the Great Simplicity, bowing to the Three Origins.*\n\nWhen finished, press the hands again, swallow saliva nine times, and click the teeth nine times. Upon completing the incantation, rise and bow twice to the north, then twice to the northwest.\n\nThe Master says: On the seventh, ninth, and thirteenth days, visualize the Crimson Palace, swallow saliva fifty times, click the teeth nine times, and with the right index finger gently press while softly reciting the incantation, pinching the heart and softly intoning:\n\n*Supreme Purple Perfection, numinous spirit of the Nine Qi’s center. Encompassing the myriad measures, the revolving mechanism shines resplendent. Flying auroras stream with radiance, their brilliance illuminating the Jade Clarity. Mystic canopy of the host of spirits, come to respond in the heart’s courtyard. Flying light descends in effulgence, the Middle Origin fills to abundance. The Six Palaces open and unfold, flowering liquid levels and smooths. Refining *hun* and *po*, attaining the essence of the Perfected. Through resonance and transformative touch, a hundred thousand changes arise in an instant. Suddenly a great spirit appears, seated upright in the Chamber of Tranquility. Solemnly facing the Perfected, a hundred joints open and align. Grasping the Dipper and clinging to the Ladle, gazing at the sun in a hundred directions. Named Xuan Du, styled Su Kang. Crimson-feathered flowering mantle, dragon-sash and tiger-robe. Body suffused with precious radiance, neck bearing a halo of light. Head crowned with flying dawn, lotus coronet soaring aloft. Enabling my flight as an immortal, transcending and floating through the Great Void. Ascending to the Purple Gates, facing north to the Jade Emperor. Commanding the myriad spirits, the host of numina welcome and receive. Flowers bloom upon the heart, auspicious clouds flourish eternally. Phoenix flutes ring clear, simurgh pipes chime in harmony.*\n\nWhen finished, press the hands again, swallow saliva nine times, and click the teeth nine times. Upon completing the incantation, bow twice as before.\n\nThe Master says: On the fifteenth, nineteenth, and twenty-second days, visualize the Cinnabar Field Palace, swallow saliva sixty times, click the teeth nine times, and with the left hand’s second finger pinch the philtrum while softly reciting the incantation:\n\n*Supreme Purple Emperor, resplendent and bright at the central pivot. The Nine Wefts glow in misty radiance, light penetrating the Supreme Subtlety. The myriad spirits gaze in reverence, a thousand spirits plant their roots. Seven times pinch the philtrum, softly reciting: Dividing the petals to restrain yang, manifesting compliance to grasp yin. Harmonizing their radiance, awakening the array of the Mystic Root. Things arrayed in... the moon’s inception is most auspicious. Observing the response within the navel, purple qi issues forth in auroras. Flying light plunges and descends, refining my *hun* and *po*. Flowering essence gleams and flourishes—suddenly a great spirit appears. Numinous and noble of the Upper Palace, named Kang Meng, styled Liu Yu. Seated upright within the navel, riding the Dipper’s Nine Qi, exhaling and inhaling cloudy liquid. Balancing blood and ordering the stomach, yellow phoenix-feathered mantle. Dragon robe and tiger sash... kindling the sun’s root. Head crowned with green lotus, waist streaming with fire bells. Lightning flashes in boundless reflection, enabling my flight as an immortal. Transcending the void to tread the floating, ascending to the Jade Chamber. Bearing the Empyrean’s emptiness, commanding the myriad spirits, heaven and earth share in repose.*\n\nPress the hands again, swallow saliva twenty times, and click the teeth nine times. Upon completing the incantation, rise and bow twice toward your natal constellation.\n\nThe Master says: The above is called *Ascending the Dipper and Rushing the Celestial Stem*, able to restrain *hun* and control *po*, augment qi and extend years. Summoning the Perfected and attracting the numinous all begin from this. *Reclining with the Dipper.*",
      "overlap_context": "d exhaling qi, their radiance flashing across the eight directions.\n\nSuddenly, you see a maiden, her form like an infant, seated before the Three Spirits facing you. She exhales purple mist, which enters your heart, and calls out: *I am the Ninefold Essence of the Dipper’s Yin Spirit, the Jade Clarity Sovereign Consort of the Upper Realm, named Mihua, styled Linqian.* Then swallow your saliva nine times, click your teeth nine times, and press your left hand to your heart. Recite the incantation:",
      "start_char": 4424,
      "end_char": 5655,
      "start_sentence": 262,
      "end_sentence": 367,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.427897214889526,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\无上三天玉堂正宗高奕内景玉书.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "师曰：凡旦暮卧，先存九皇星在卧席上。 身於床前立北向，两手捧心，闭炁暝目，存天上北斗并帝尊九星，依当时所皆之位，乃见冉冉来下至席，列如图。 令天关作月建斗形，长九尺，广六尺，乃绕於真星之外。 若时朔日之夕，即并存晨盖之星俱下，亦列如图。 乃从魁下至斗口，於尊星外入魁中，正偃卧，闭目存思其星作圆光之象，星紫色，刚赤色，连绕其星，如步图者。 今我头首九极，使真炁入於泥丸，令真星正当顶上，存真炁紫光随身入泥丸，并溢出混头脑之地，光映洞彻，足蹑尊星，心念飞仙，令太微制我三魂。 小屈左足，以镊之足蹑帝星，心念飞仙，令高上拘我七魄。 伸右足以蹑之，左手把北台。 北台，元星之精也。 仰左手小举之，抱元星下纲，使星形在虎口。 右手执璇根。 璇根，纽星之精也。 覆右手，执纽星纲，使星在虎口上。 次安身如法讫，闭目存有九星君。 第一太星精，名玄枢上真。 愿臣飞仙，乘虚驾浮。 存星在左手小指前。 第二元星精，名北台上真。 愿臣飞仙，游行洞台。 存左手把之。 第三真星精，名九极上真。 愿臣飞仙，得治三玄。 存星在头上。 第四纽星精，名璇根上真。 愿臣飞仙，玉名列为飞仙。 存星右手执之。 第五纲星精，名太平上真。 愿臣飞仙，登行上清。 存星在纽星右？ 第六纪星精，名命机上真。 愿臣飞仙，名书太微。 存星在纲星右。 第七关星精，名玄机上真。 愿臣飞仙，得使玉童。 存星次纪星君。 第八帝星精，名高上玉皇君。 愿臣飞仙，得登后圣之堂。 存星在魁星中，纲连纽星，令对右足心。 第九尊星精，名太微玉帝君。 愿臣飞仙，得入丹阙玉房。 存星连太星纲，今对左足前。 次都存见九星，叩齿三七遍，咽液三七遍。 咒曰： 九星太精，北极真君。 益我胎精，强我三魂。 左引日华，右拘月晶。 辰中黄景，元虚上真。 使我飞仙，上登紫宸。 神虎玉符，备守生门。 万邪伏法，受炼斗君。 视毕良久，乃存斗星之精，忽然入洞房，存席上九星并纲，一时分精，作促小之形，后炁户却入洞房中，偃魁口口口口口前，即是席上颐中两处具有也。 洞房魁中，左有黄老君，王色黄绣衣，右是我神与黄老君对坐； 口有泥丸赤子帝君，向外坐，光照一身，内外洞彻，三闾百节，皆令赤色。 咒曰： 洞房元精，赤子太尊。 斗光华盖，来照泥丸。 保炼骨血，拘制魄魂。 使臣飞仙，乘云登晨。 上朝玉帝，太乙元君。 祝毕闭目，息念忘形安眠。 师曰：外北斗阴精政仙，使灵洞房。 致北斗阳精，使五脏自生，遂得成仙景，进行上清。 月朔存华庭紫盖，唯月旦一存席上下分，精入洞房也。 先存九皇毕，即存晨盖，次祝九星名，以至于毕也。 平旦欲起，密叩齿二七通，咽液二七过。 咒曰： 天元上斗，中有七童。 上清紫精，在兆身中。 华晨紫盖，太素元宫。 投圣灵炁，下入洞房。 使我飞仙，得升太极玉堂。 祝毕，存九星歉然不见。 翔夕辰盖亦然。 所云平旦起者，谓专行此法耳。 若夜中别行他务，亦宜祝而后起。 回元诀 师曰：奔辰卧斗巳行，然下学之士，积功秽罪，未能消荡，须行此法，忏洗愆非，方可登真矣。 每丁卯日夜半，於寝床平坐，北向，按手暝目，叩齿七通，仰存七星焕明在天。",
      "translated_text": "The Master says: For all morning and evening repose, first visualize the Nine August Stars upon your sleeping mat. Stand at the foot of the bed facing north, both hands clasping the heart, close the qi and shut the eyes. Visualize the Northern Dipper in the heavens along with the Imperial Nine Stars, each in their proper seasonal positions, descending gently to the mat in ordered array as depicted. Let the Celestial Pass form the shape of the monthly Stem-Dipper, nine feet in length and six feet in breadth, encircling the true stars beyond. On the evening of the new moon, also visualize the Morning Canopy Star descending together with them, likewise arrayed as in the diagram.\n\nFrom the *Kui* down to the Dipper’s mouth, enter the *Kui* from beyond the honored stars. Lie supine, close the eyes, and visualize the stars as orbs of radiant light—purple in hue, their edges crimson—encircling them as if pacing the diagram. Let my head align with the Nine Poles, drawing true qi into the Mud-Pill Palace. Let the true stars rest directly above the crown, visualizing the true qi’s purple radiance following the body into the Mud-Pill, overflowing to suffuse the head and brain, its light illuminating and penetrating all. Tread upon the honored stars, and with the heart’s intent, ascend as an immortal, commanding the Grand Tenuity to govern my three *hun*.\n\nSlightly bend the left foot, pressing the toes upon the Emperor Star, and with the heart’s intent, ascend as an immortal, commanding the Most High to restrain my seven *po*. Extend the right foot to tread upon it, the left hand grasping the Northern Terrace. The Northern Terrace is the essence of the Origin Star. Raise the left hand slightly, embracing the nether cord of the Origin Star, its form resting in the tiger’s mouth. The right hand holds the Pivot Root. The Pivot Root is the essence of the Pivot Star. Invert the right hand, grasping the cord of the Pivot Star, its form resting above the tiger’s mouth.\n\nNext, arrange the body as prescribed, close the eyes, and visualize the Nine Star Lords:\n1. The essence of the Great Star, named *Mysterious Pivot Supreme Perfected*. May I ascend as an immortal, riding the void and steering the floating. Visualize the star before the left little finger.\n2. The essence of the Origin Star, named *Northern Terrace Supreme Perfected*. May I ascend as an immortal, wandering the Terrace of Flowing Sands. Visualize the left hand grasping it.\n3. The essence of the True Star, named *Nine Poles Supreme Perfected*. May I ascend as an immortal, governing the Three Mysteries. Visualize the star above the head.\n4. The essence of the Pivot Star, named *Pivot Root Supreme Perfected*. May I ascend as an immortal, my jade name inscribed among the flying immortals. Visualize the right hand holding it.\n5. The essence of the Net Star, named *Grand Peace Supreme Perfected*. May I ascend as an immortal, ascending to the Highest Clarity. Visualize the star to the right of the Pivot Star.\n6. The essence of the Mechanism Star, named *Life’s Mechanism Supreme Perfected*. May I ascend as an immortal, my name recorded in the Grand Tenuity. Visualize the star to the right of the Net Star.\n7. The essence of the Pass Star, named *Mysterious Mechanism Supreme Perfected*. May I ascend as an immortal, commanding jade lads. Visualize the star beside the Mechanism Star Lord.\n8. The essence of the Emperor Star, named *Most High Jade Sovereign Lord*. May I ascend as an immortal, ascending to the Hall of the Latter Sage. Visualize the star within the *Kui* Star, its net linked to the Pivot Star, aligned with the center of the right foot.\n9. The essence of the Honored Star, named *Grand Tenuity Jade Sovereign Lord*. May I ascend as an immortal, entering the cinnabar chamber and jade house. Visualize the star linked to the net of the Great Star, aligned before the left foot.\n\nNext, visualize all nine stars together, click the teeth twenty-one times, and swallow saliva twenty-one times. Recite the incantation:\n*Nine Stars, Great Essences, True Lords of the Northern Culmen.\nAugment my fetal essence, strengthen my three hun.\nTo the left, draw the sun’s splendor; to the right, restrain the moon’s crystal.\nWithin the stems, the Yellow Radiance; above the Primordial Void, the Supreme Perfected.\nLet me ascend as an immortal, ascending to the Purple Palace.\nDivine Tiger and Jade Talisman guard the Gate of Life.\nMyriad evils submit to the law, refined by the Dipper Lords.*\n\nAfter gazing for a long while, visualize the essence of the Dipper stars suddenly entering the Grotto Chamber. Visualize the nine stars upon the mat along with their net, all dividing their essence into minute forms, then retreating through the qi gate into the Grotto Chamber. Lie supine with the *Kui*’s mouth facing [the mat], so that both the mat and the cheeks possess them. Within the Grotto Chamber and the *Kui*, to the left sits the Yellow Elder Lord, clad in yellow embroidered robes; to the right, my spirit sits opposite the Yellow Elder Lord. Within the mouth resides the Mud-Pill Crimson Child Sovereign Lord, seated facing outward, his light illuminating the entire body, inside and out, penetrating all. The Three Passes and hundred joints all glow crimson. Recite the incantation:\n*Grotto Chamber’s Primordial Essence, Crimson Child Supreme Sovereign.\nDipper’s radiant canopy descends to illuminate the Mud-Pill.\nRefine and guard bones and blood, restrain and govern po and hun.\nLet me ascend as an immortal, riding clouds to ascend the dawn.\nAscend to the Jade Emperor’s court, to the Primordial Sovereign of Grand Unity.*\n\nAfter the incantation, close the eyes, still the thoughts, forget the form, and rest in serenity.\n\nThe Master says: The yin essence of the external Northern Dipper governs immortality, enabling the numinous Grotto Chamber. The yang essence of the Northern Dipper causes the five viscera to generate spontaneously, thus attaining the immortal’s vision and ascending to the Highest Clarity. On the new moon, visualize the Purple Canopy of the Flowery Court; only on the first day of the month visualize the stars above and below the mat dividing their essence to enter the Grotto Chamber. First visualize the Nine August Stars, then the Morning Canopy, next invoke the names of the Nine Stars, and proceed to completion.\n\nAt dawn when rising, silently click the teeth fourteen times and swallow saliva fourteen times. Recite the incantation:\n*Celestial Origin’s High Dipper, within dwell seven lads.\nHighest Clarity’s purple essence resides within my body.\nFlowery Dawn’s Purple Canopy, Primordial Palace of Grand Simplicity.\nBestow the sacred numinous qi, descending into the Grotto Chamber.\nLet me ascend as an immortal, ascending to the Jade Hall of the Grand Ultimate.*\n\nAfter the incantation, visualize the nine stars vanishing abruptly. The Morning Canopy of the evening and stems likewise vanish. The \"rising at dawn\" refers to those who practice this method exclusively. If other tasks are undertaken during the night, one should also recite the incantation before rising.\n\n**Returning to the Origin Formula**\nThe Master says: Though *Rushing the Celestial Stem and Reclining with the Dipper* have been practiced, those of lesser learning who have accumulated merit and unclean sins yet unable to dissolve them must perform this method to repent and wash away transgressions before ascending as perfected. On every *ding-mao* day at midnight, sit upright on the bed facing north, press the hands, close the eyes, click the teeth seven times, and visualize the Seven Stars shining brilliantly in the heavens.",
      "overlap_context": "commanding the myriad spirits, heaven and earth share in repose.*\n\nPress the hands again, swallow saliva twenty times, and click the teeth nine times. Upon completing the incantation, rise and bow twice toward your natal constellation.\n\nThe Master says: The above is called *Ascending the Dipper and Rushing the Celestial Stem*, able to restrain *hun* and control *po*, augment qi and extend years. Summoning the Perfected and attracting the numinous all begin from this. *Reclining with the Dipper.*",
      "start_char": 5655,
      "end_char": 6919,
      "start_sentence": 368,
      "end_sentence": 445,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.74951481819153,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\无上三天玉堂正宗高奕内景玉书.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "祝曰： 存赐明星从斗飞入兆口中，光芒日散，竟在心中，内外光彻。 当存斗中缺一阳明星，余如故。 第一太星，玄枢阳明天枢魂神上玄君，七过。 愿得臣七世以来，下逮臣身，阳罪阴愆，皆令消除。 所向如愿，万事合心。 飞步七星，与天相倾。 名刊斗辰，延纪亿年。 丁丑日夜半，於寝床平坐，北向，按手暝目，叩齿七遍，仰存七－星焕明在天。 祝曰： 存阴精星从斗飞入口，竟在肺中，余如前。 第二元星，北台阴精天璇魂神上玄君，七过。 愿得臣七世以来，下逮臣身，阳罪阴愆，皆令消除。 所向如愿，万事合心。 飞步七星，盈满四神。 虚飞行七元，名刊玉虚，上登紫清。 玄驾无，出入利贞，与天同符。 丁亥夜半，於寝床平坐，北向，按手暝目，叩齿七通，仰存七星焕明北方，良久。 祝曰： 存真人星飞入口，径在肺中。 存讫，心再拜，咽液、叩齿，余如前。 第三真皇，九极上真天机魄精上素君，七过。 愿得除臣七祖以来，下逮臣身，生罪、死过、积恶、私匿、违犯天地水三官者，皆得消灭。 目明彻视，鉴洞幽无。 飞行七元，名书上清。 役使万灵，上登玉庭。 驾景乘空，与天相倾。 丁酉夜半，於寝床平坐，北向，按手暝目，叩齿七通，仰存七星焕明北方，良久。 祝曰 第四纽星，璇根玄冥天权魄精上虚君，七过。 愿得除臣七祖以来，下逮臣身，无恩无德、不仁不孝阴恶之罪数千万计，皆令消减。 服食纳精，日以进益。 飞登七元，录刊太玄。 上列玉皇，乘飙九天。 役使神灵，日月同新。 丁未夜半，於寝床平坐，向北，按手暝目，叩齿七通，仰存七星焕明北方，良久。 祝曰： 存丹元星飞入口中，觉在胃内。 咽液三九遍，余如前。 第五纲星，太平丹元玉衡魄灵上玄星君，七遍。 愿得除臣七祖以来，下逮臣身，内外秽罪深沈，过数千万亿，记在幽关者，皆令消灭。 当令太玄素景紫宫右侍玉女、左侍玉童，日月同辉，位为真王。 丁巳日夜半，於寝床平坐，北向，按手暝目，叩齿七通，仰存七星焕明北方，良久。 祝曰： 存北极星君入口，竟在肾中，阳日左，阴日右。 咽液二七遍，余如前。 第六纪星，命机北极阅阳魂灵七丹皇虚君，七遍。 愿得除臣七祖以来，下逮臣身，所犯所存贼恶罪过、奸逆辞妄列在帝君，皆令消灭。 百疠康愈，体炁利贞。 名书仙台，列位上清，役使万灵。 月晦日夜半后，鸡未鸣时，於寝床外束向，平坐，按手，叩齿，仰存七星焕明北方，良久。 祝曰： 存天关星飞入目瞳，阳日左，阴日右，通映两目，内外洞然。 第七关星，玄阳天关瑶光太明上皇道君，七遍。 愿得除臣七祖以来，下逮臣身，间昧逆罪、五罪五刑、身中之神数千万亿，记在北帝鬼宫者，皆令消灭。 当令神精八达，坐在立亡。 耳听绝音，同生紫光。 刊玉太素，洞览鬼形。 名书帝轩，命均二明。 飞行七元，寝宴紫清。 六甲日夜半，於寝床坐，任意首向，握固闭炁凝和，良久。 叩齿九通，存北斗九皇焕明於顶上，令光芒相映。 祝曰： 存帝尊二星来J 飞入泥丸中； 洞照内外，通生紫光。 咽液三九过，若六甲六丁日且晦日同者，重行之。 第八帝星高上玉皇八景灵元君、第九尊星太微玉帝神素七辰元君，九遍。 愿得除臣九世父母以来，下逮臣身，诸丘山水源大小罪过、名上死籍、阴匿阴贼、恶伏、奸藏、欺事有亿万计，列在鬼帝邓山上，死罪条例之愆，记北上九元太极真人黑簿者，乞九天元太上尊帝王元君，皆令罪事消除。",
      "translated_text": "The incantation states: Visualize the radiant star descending from the Dipper and flying into your mouth, its light dispersing like the sun before settling in your heart, illuminating both within and without. Then visualize one yang-bright star missing from the Dipper, the rest remaining as before. For the first, the Great Star—*Xuan Shu Yang Ming*, Celestial Pivot, *Hun* Spirit, Supreme Lord of the Upper Mystery—recite seven times. May the yang transgressions and yin sins of my seven generations, down to my own person, all be dissolved. May all I aspire to come to pass, and ten thousand affairs align with my heart. May I tread the Seven Stars, inclining toward heaven. May my name be inscribed among the Dipper and Celestial Stems, extending my years by countless eons.\n\nOn the *ding-chou* day at midnight, sit upright on the bed facing north, press the hands, close the eyes, click the teeth seven times, and visualize the Seven Stars shining brilliantly in the heavens. The incantation states: Visualize the yin-essence star descending from the Dipper and flying into your mouth, settling in your lungs, the rest as before. For the second, the Origin Star—*Bei Tai Yin Jing*, Northern Terrace, *Hun* Spirit, Supreme Lord of the Upper Mystery—recite seven times. May the yang transgressions and yin sins of my seven generations, down to my own person, all be dissolved. May all I aspire to come to pass, and ten thousand affairs align with my heart. May I tread the Seven Stars, filling the Four Spirits. May I soar through the Seven Origins, my name inscribed in the Jade Void, ascending to the Purple Clarity. May my dark chariot be absent, my comings and goings auspicious and upright, in harmony with heaven.\n\nOn the *ding-hai* night at midnight, sit upright on the bed facing north, press the hands, close the eyes, click the teeth seven times, and visualize the Seven Stars shining brilliantly in the northern sky for a long while. The incantation states: Visualize the Perfected Person Star flying into your mouth and settling in your lungs. After visualization, bow twice with the heart, swallow saliva, and click the teeth, the rest as before. For the third, the True August—*Jiu Ji Shang Zhen*, Supreme Perfected of the Nine Poles, *Po* Essence, Supreme Lord of the Plain Mystery—recite seven times. May the living sins, dead transgressions, accumulated evils, hidden faults, and offenses against the Three Officials of Heaven, Earth, and Water of my seven ancestors, down to my own person, all be eradicated. May my eyes see clearly, penetrating the hidden and obscure. May I soar through the Seven Origins, my name inscribed in the Upper Clarity. May I command the myriad spirits, ascending to the Jade Court. May I ride the luminous chariot through the void, inclining toward heaven.\n\nOn the *ding-you* night at midnight, sit upright on the bed facing north, press the hands, close the eyes, click the teeth seven times, and visualize the Seven Stars shining brilliantly in the northern sky for a long while. The incantation states: For the fourth, the Pivot Star—*Xuan Gen Xuan Ming*, Mystic Root, *Po* Essence, Supreme Lord of the Void—recite seven times. May the countless sins of ingratitude, lack of virtue, unkindness, and unfiliality, along with yin evils of my seven ancestors, down to my own person, all be diminished. May I ingest essence and absorb qi, daily advancing. May I ascend the Seven Origins, my name inscribed in the Great Mystery. May I be ranked among the Jade Emperor, riding the whirlwind through the Nine Heavens. May I command the spirit-spirits, renewing with the sun and moon.\n\nOn the *ding-wei* night at midnight, sit upright on the bed facing north, press the hands, close the eyes, click the teeth seven times, and visualize the Seven Stars shining brilliantly in the northern sky for a long while. The incantation states: Visualize the Cinnabar Origin Star flying into your mouth and settling in your stomach. Swallow saliva twenty-seven times, the rest as before. For the fifth, the Network Star—*Tai Ping Dan Yuan*, Great Peace, Cinnabar Origin, *Po* Spirit, Supreme Star Lord of the Upper Mystery—recite seven times. May the deep and profound inner and outer defilements and sins, numbering in the thousands of millions and billions, recorded in the hidden passes of my seven ancestors, down to my own person, all be eradicated. May the Jade Maiden attend on the right and the Jade Youth on the left in the Purple Palace of the Great Mystery’s Plain Luminance, their radiance matching the sun and moon, and may I be enthroned as a Perfected King.\n\nOn the *ding-si* day at midnight, sit upright on the bed facing north, press the hands, close the eyes, click the teeth seven times, and visualize the Seven Stars shining brilliantly in the northern sky for a long while. The incantation states: Visualize the Northern Culmen Star Lord entering your mouth and settling in your kidneys, on the left on yang days and the right on yin days. Swallow saliva fourteen times, the rest as before. For the sixth, the Chronicle Star—*Ming Ji Bei Ji*, Life Mechanism, Northern Culmen, *Hun* Spirit, Sevenfold Cinnabar August Lord of the Void—recite seven times. May the sins of treachery, evil, rebellion, and deceit recorded before the Emperor Lord of my seven ancestors, down to my own person, all be eradicated. May the hundred ailments be cured, and my body’s qi be upright and auspicious. May my name be inscribed on the Immortal Terrace, ranked in the Upper Clarity, commanding the myriad spirits.\n\nOn the night of the last day of the lunar month after midnight, before the cock crows, sit upright outside the bed facing east, press the hands, click the teeth, and visualize the Seven Stars shining brilliantly in the northern sky for a long while. The incantation states: Visualize the Celestial Pass Star flying into your pupils, on the left on yang days and the right on yin days, illuminating both eyes within and without. For the seventh, the Pass Star—*Xuan Yang Yao Guang*, Mystic Yang, Celestial Pass, Great Brilliance, Supreme August Lord of the Dao—recite seven times. May the sins of ignorance, rebellion, the Five Punishments, and the Five Crimes, along with the countless spirits within my body recorded in the Ghost Palace of the Northern Emperor of my seven ancestors, down to my own person, all be eradicated. May my spirit and essence permeate in eight directions, enabling me to sit and vanish at will. May my ears hear the subtlest sounds, and may I share in the purple light. May my name be inscribed on the Jade Plain, penetrating the forms of ghosts. May my name be recorded in the Imperial Carriage, my life equal to the Two Luminaries. May I soar through the Seven Origins, reposing in the Purple Clarity.\n\nOn the *liu-jia* day at midnight, sit on the bed facing any direction, clench the fists, close the qi, and harmonize the breath for a long while. Click the teeth nine times, and visualize the Nine August Lords of the Northern Dipper shining brilliantly above your crown, their radiance intermingling. The incantation states: Visualize the two Imperial Honored Stars descending and flying into the *Ni Wan* Palace, illuminating within and without, generating purple light. Swallow saliva twenty-seven times. If the day coincides with *liu-jia*, *liu-ding*, or the last day of the month, repeat the practice. For the eighth, the Imperial Star—*Gao Shang Yu Huang*, Lofty Supreme Jade Emperor, Eightfold Numinous Origin Lord—and the ninth, the Honored Star—*Tai Wei Yu Di*, Supreme August Jade Emperor, Sevenfold Origin Lord of the Plain Mystery—recite nine times. May the sins of my nine generations of parents, down to my own person—whether great or small, recorded in the death registers, hidden yin evils, concealed treacheries, deceits, and the countless offenses listed in the statutes of the Ghost Emperor Deng Shan, inscribed in the Black Register of the Nine Origins of the Supreme Perfected of the Northern Culmen—be beseeched before the Nine Heavens’ Primordial Supreme Honored Emperor King and the Primordial Lord, that all sins be dissolved.",
      "overlap_context": "**\nThe Master says: Though *Rushing the Celestial Stem and Reclining with the Dipper* have been practiced, those of lesser learning who have accumulated merit and unclean sins yet unable to dissolve them must perform this method to repent and wash away transgressions before ascending as perfected. On every *ding-mao* day at midnight, sit upright on the bed facing north, press the hands, close the eyes, click the teeth seven times, and visualize the Seven Stars shining brilliantly in the heavens.",
      "start_char": 6920,
      "end_char": 8299,
      "start_sentence": 446,
      "end_sentence": 513,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.00432085990906,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\无上三天玉堂正宗高奕内景玉书.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "飞行七道，上登玉清。 洞游太元，乘景晨生。 北宴八素，与日相倾。 总朝真妃，摄御万灵。 无上三天玉堂正京高奔内景玉书卷下竟",
      "translated_text": "Ascend the Seven Paths of Flight to reach the Jade Purity. Roam the Great Primordium, riding the radiance as dawn arises. Feast in the Northern Eight Simplicities, inclining toward the sun. Gather to pay homage to the Perfected Consorts, commanding and governing the myriad spirits. Here ends the *High Ascent Inner Radiance Jade Scripture* of the Supreme Three Heavens’ Jade Hall, the True Capital.",
      "overlap_context": "ine times. May the sins of my nine generations of parents, down to my own person—whether great or small, recorded in the death registers, hidden yin evils, concealed treacheries, deceits, and the countless offenses listed in the statutes of the Ghost Emperor Deng Shan, inscribed in the Black Register of the Nine Origins of the Supreme Perfected of the Northern Culmen—be beseeched before the Nine Heavens’ Primordial Supreme Honored Emperor King and the Primordial Lord, that all sins be dissolved.",
      "start_char": 8299,
      "end_char": 8360,
      "start_sentence": 514,
      "end_sentence": 518,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 2.970794677734375,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\无上三天玉堂正宗高奕内景玉书.txt",
        "category": "方法类"
      }
    }
  ]
}