{
  "source_id": "无为清静长生真人至真语录",
  "source_file": "chunked_daozang\\无为清静长生真人至真语录.json",
  "total_chunks": 12,
  "total_original_chars": 13919,
  "total_translated_chars": 71584,
  "total_translation_time": 317.9311013221741,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏太玄部\\无为清静长生真人至真语录.txt",
    "category": "正统道藏太玄部"
  },
  "full_translation": "**The Perfected Sayings of the Perfected One of Non-Action, Purity, and Longevity**\n\n**Scripture Title:** *The Perfected Sayings of the Perfected One of Non-Action, Purity, and Longevity*\nRecorded by Liu Chuxuan of the Jin, compiled by his disciples. One scroll.\nSource text: *Daoist Canon of the Zhengtong Era*, *Tai Xuan* Section.\n\n---\n\n**Preface to *The Perfected Sayings of the Perfected One of Non-Action, Purity, and Longevity***\n\nI have heard that the Dao abides within the world, and what is fitting may be gradually attained; the immortals dwell beyond form, and their realm cannot be sought carelessly. Thus, the poet Bai Letian wrote:\n*\"Were it not for the golden bones of destiny,\nOne’s name would not be inscribed on the cinnabar terrace.\"*\nWithout the roots of a hundred thousand kalpas of goodness, how could one obtain the primal qi of the Three, Five, and One, and reach such a state?\n\nNow, Master Liu, the Longevity Master, possesses this destiny and bears this name. Formerly, he encountered the Perfected Wang Chongyang, who delivered and transformed him, guiding him from the secular to the Dao. His wisdom and nature became luminous, his understanding thorough and penetrating. Recently summoned by imperial decree, he composed a poem:\n*\"In years past, the former emperor’s decree came from Shaanxi;\nToday, the sagely emperor’s summons arrives from Donglai.\"*\nAfter two years, he requested to return home. The officials sought his verses, to which he replied:\n*\"Drifting like clouds and water, I turn back to Donglai,\nA star-crowned immortal among companions in the Great Tenuity.\"*\nThis resembles Chen Tuan of old, who, favored by the Song court, retired to Mount Hua. The imperial response read:\n*\"The Jade Hall and Golden Gates rejoice briefly in your audience;\nThe cloud-draped cliffs and misty carriage hasten your return to reclusion.\"*\nThese two great adepts, unbound by convention, each brought glory to their dynasties—yet their pursuit of the Dao was the same, differing only in circumstance.\n\nSince Master Liu returned to his homeland and dwelled in the Great Tenuity, he has annotated the scriptures, tracing the teachings of the Three Sages. With literary grace and calligraphic playfulness, he composed works to propagate the Dharma, heeding the Buddhist admonition against attachment to the trivial. He entered the Gate of Myriad Wonders of the Mysterious Sovereign, embodied the Five Constants of Confucius, cultivated fields and estates, and published his writings on pearwood and jujube. Ever composed, he ensured all his works were carved and disseminated, renewing the perceptions of the common folk, recited by all, and refining the customs of the people. Those with understanding turned to him in devotion; the stubborn and coarse were transformed into the refined.\n\nOne day, the Master’s disciples, Xu and Li, traveled from afar to visit. Crossing the creek lodge and entering the humble studio, they rested from their journey, partaking of vegetarian and aquatic delicacies. After some time, they presented a volume of the Master’s *Perfected Sayings*, earnestly requesting a preface. Unable to refuse in good conscience, I cleansed my mind and perused it thoroughly. The text awakens and warns, inspiring one to sever worldly ties and transcend karmic obstructions.\n\nFrom beginning to end, it comprises eighty questions, answered in ten thousand words of jade-like discourse. It encompasses principles and narratives, citations and critiques, tracing the transformations of Heaven and Earth, the functions of yin and yang, elucidating the doctrines of life and death, clarifying the retributions of fortune and misfortune, expounding the forms of true emptiness, and restraining the desires of greed and anger. It addresses the origins of suffering and joy, the manifestations of sincerity and deceit, the sources of purity and turbidity, and the foundations of the exalted and the base—such topics are myriad, yet none are left unexplored. All are adjudicated by the profound principles of the Yellow Emperor and Laozi, encompassing the affairs of the world.\n\nIt enables sentient beings to resolve doubts and return to correctness, melting away delusions like ice. It serves as a dike to dispel great ignorance, opening the door to spiritual illumination, and in one stroke, liberates all. Thus, one may transcend the sea of suffering, ascend the shore of awakening, cast off the filth of the Three Realms and Five Turbidities, realize the cause of samādhi and singular emptiness, shed the defilements of the twelve kinds of beings, and receive the joy of rebirth across the three thousand worlds. Truly, these are the words of the Perfected, guiding and transforming through the Dharma’s karmic connections—how magnificent!\n\nOn the Shangyuan Festival of the *renxu* year of the Taihe era, respectfully inscribed by Han Shiqian, the Empty Stream Daoist of Bianxi in Huoze, Duanzhou.\nYan Guang.\n\n---\n\n**The Perfected Sayings of the Perfected One of Non-Action, Purity, and Longevity**\n\n**Scripture Title:** *The Perfected Sayings of the Perfected One of Non-Action, Purity, and Longevity*\nRecorded by Liu Chuxuan of the Jin, compiled by his disciples. One scroll.\nSource text: *Daoist Canon of the Zhengtong Era*, *Tai Xuan* Section.\n\n**The Perfected Sayings of the Perfected One of Non-Action, Purity, and Longevity**\nEighty Questions\n\n**First Question: On the Dharma**\n\n**First Question: On the Dharma**\nOne asked: \"What is the Dharma?\"\nThe Master of Longevity answered: \"To penetrate the Dao and attain true emptiness—this is called the Dharma. To penetrate the teachings of Śākya and attain non-arising—this is called the precepts. Those who receive the Dharma cannot exhaust their myriad transgressions, nor can they penetrate the myriad principles. Those who receive the precepts cannot fulfill their myriad virtues, nor can they penetrate the myriad wisdoms. When the Dao and Dharma are penetrated, one attains the natural, pure, and unadulterated state of non-action. When the teachings of Śākya and precepts are penetrated, one encompasses the self, others, sentient beings, and the long-lived. As the scripture says: 'The Dharma of the Dao is natural.' The Dharma of the Dao is not empty, yet it is empty.\"\n\n**Second Question: On Emptiness**\nOne asked again: \"What is emptiness?\"\nThe answer: \"The Dao abides—not in emptiness. The foolish cling to rigid emptiness; the worthy cling to true emptiness. The worldly contemplate the emptiness of form; the Daoist forgets the emptiness of the world. People cherish the emptiness of all things, yet the transgressions they contemplate are not empty. The enlightened understand the emptiness of the Dao; the penetrating comprehend the emptiness of nature. The turbid, in death, sink into emptiness; the pure, in life, ascend into emptiness. As the scripture says: 'Emerging into life, entering into death—those who live are thirteen, those who die are thirteen.' To awaken to emptiness is to know.\"\n\n**Third Question: On Knowledge**\nOne asked again: \"What is knowledge?\"\nThe answer: \"Knowledge is this: to know human kindness and favor, expecting repayment in the heart; to know the Dao of Heaven, then to diminish excess and aid the destitute; to know the Dao of humanity, then to diminish insufficiency and serve the wealthy. To know the existence of the Dao is to follow Heaven; to know the absence of the Dao is to follow humanity. Following Heaven, one lives; following humanity, one dies. Following Heaven preserves one’s purity and goodness; following humanity indulges one’s turbidity and evil. As the scripture says: 'Observe the Dao of Heaven, grasp the conduct of Heaven—this is perfection.' To know the radiance of wisdom is to see beyond what ordinary people perceive.\"\n\n**Fourth Question: On Perception**\nOne asked again: \"What is perception?\"\nThe answer: \"Perception is not what the fleshly eye sees. Perception is this: to perceive the primordial void, to perceive the radiance of wisdom, to perceive the boundless countenance, to perceive the indistinct and subtle, to perceive the precious pearl, to perceive the rosy clouds, to perceive the profound and subtle, to perceive the serene and luminous, to perceive the purity of the hun-soul, to perceive the stillness of the po-soul. As the scripture says: 'The Dao as a thing is only indistinct and subtle.' To perceive the form of no-thing is to respond externally with constant goodness.\"\n\n**Fifth Question: On Goodness**\nOne asked again: \"What is goodness?\"\nThe answer: \"Goodness is to respond to things with square or round, crooked or straight, and comply with others. To not generate myriad evils—this is called true goodness. To not cling to the myriad things—this is called pure goodness. To penetrate principles without reciting the myriad scriptures—this is called penetrating goodness. To penetrate the wondrous without exhausting the myriad transformations—this is called luminous goodness. To not harm the myriad forms—this is called compassionate goodness. To not reject the myriad turbidities—this is called responsive goodness. To not oppose the myriad people—this is called virtuous goodness. To not seek the myriad existences—this is called Daoist goodness. To not arise in myriad selfishnesses—this is called impartial goodness. To not forget the myriad wisdoms—this is called constant goodness. As the scripture says: 'Good, I treat as good; not good, I also treat as good—this is virtuous goodness.' The highest goodness is not evil.\"\n\n**Sixth Question: On Evil**\nOne asked again: \"What is evil?\"\nThe answer: \"Evil is the unworthiness of humanity. If people do not follow Heaven, then Heaven does not follow them. If people squander and scatter, then Heaven sends famine and scarcity. If people do not cultivate good fortune, then Heaven does not grant abundance. If the human heart indulges in malice and poison, then Heaven’s will descends with wind and hail. If one does not cease evil killing until death, then in the next life, one is surely born among the asuras. If people create evil, then Heaven repays with evil. If people do not harm things with evil, then things do not injure people with evil. As the scripture says: 'Poisonous insects do not sting, fierce beasts do not seize, birds of prey do not strike.' To not reject evil is true penetration—this clarifies one’s worthiness.\"\n\n**Seventh Question: On Worthiness**\nOne asked again: \"What is worthiness?\"\nThe answer: \"The worthy are those of great penetration. The greatly wise seem as if they lack penetration; the greatly wise seem as if they lack knowledge; the greatly perceptive seem as if they lack clarity; the greatly eloquent seem as if they lack speech. Responding with wisdom, they truly possess the myriad penetrations; responding with wisdom, they truly possess the myriad understandings; responding with perception, they truly possess the myriad clarities; responding with eloquence, they truly possess the myriad discourses. Wisdom that penetrates is worldly penetration; wisdom that penetrates is Daoist penetration; perception that penetrates is the clarity of principles; eloquence that penetrates is the purity of speech. As the scripture says: 'Do not esteem the worthy, lest the people contend.' The worthy of the world conceal themselves like jade hidden in stone; the worthy of the Dao conceal themselves as the reality of no-thing. The worthy are not the foolish.\"\n\n**Eighth Question: On Foolishness**\nOne asked again: \"What is foolishness?\"\nThe answer: \"The foolish are the ancient ones of great penetration who distanced themselves from the world’s illusions, their outward appearance like that of fools. The Confucian Yan Hui lived in poverty with a single bamboo bowl and gourd ladle; the Śākya Śākyamuni begged for food, receiving a meal from seven households; the Daoist Pure Yang practiced non-action, dwelling in a humble abode and eating coarse fare. Returning to simplicity, the high descend to the low, the existent to the non-existent. The bright seem dim; the anciently silent seem inarticulate. As the scripture says: 'I alone seem forgotten—is this the heart of a foolish person?' Outwardly foolish, inwardly they embrace the Dao—this is true life.\"\n\n**Ninth Question: On Life**\nOne asked again: \"What is life?\"\n\nThe answer: \"Life is embracing the Dao to achieve true life, preserving destiny to attain blessed life, nurturing qi to attain spiritual life, penetrating the subtle to attain wondrous life, being without delusion to attain wise life, responding to things to attain virtuous life, constantly practicing goodness to attain salvific life. At the summer solstice, the yang energy ascends; at the winter solstice, the yang energy revives; through interaction, the myriad things come to life.\n\nTrue life is at ease; blessed life is luminous; spiritual life is numinous; wondrous life is pure; wise life is penetrating; virtuous life is level; salvific life is compassionate. Yin life ascends; yang life descends; the life of things achieves completion. As the scripture says: 'The Dao gives birth to the One, the One gives birth to the Two, the Two give birth to the Three, and the Three give birth to the myriad things.' Heaven and Earth give life to the myriad things through harmonious qi, thus they live; through metallic qi, they perish—thus they die.\n\n**Tenth Question: On Death**\nOne asked again: \"What is death?\"\nThe answer: \"Death is the form of things. When the myriad things reach deep autumn, their forms die, but their roots do not. When the myriad forms reach a hundred years, their bodies die, but their natures do not. For the insentient myriad things, one may deepen their roots. For the sentient myriad forms, one may nurture their natures. If the root lacks water, the sprout dies. If the nature lacks destiny, the body dies. The root is the nature; the nature is the root. The spirit is the nature; the nature is the spirit. When the numbers of the Five Phases are exhausted, the form declines and dies. Beyond yin and yang, the spirit does not perish. As the scripture says: 'Deep roots and a firm stem are the Way of long life and enduring vision.' Death without true death is the precious constancy.\n\n**Eleventh Question: On Nobility**\nOne asked again: \"What is nobility?\"\nThe answer: \"Nobility is the nobility of virtue. Heaven bestows grace without letting those below know—this is the nobility of virtue. Heaven bestows grace without choosing whom to love—this is the nobility of virtue. Heaven bestows grace in creation without being the master—this is the nobility of virtue. Heaven bestows grace to aid others without expecting repayment—this is the nobility of virtue. One must align with Heaven’s intent: bestowing relief, only the self knows. One must align with Heaven’s intent: bestowing kindness, whether public or private. One must align with Heaven’s intent: bestowing wealth as if discarding mud. One must align with Heaven’s intent: bestowing food without remembering who. As the scripture says: 'The myriad things all revere the Dao and prize virtue.' The virtue of the noble overflows in kindness to the lowly.\n\n**Twelfth Question: On Lowliness**\nOne asked again: \"What is lowliness?\"\nThe answer: \"Lowliness is the thinness of the external. Truly prizing virtue makes the body externally lowly. If virtue is like fine jade, the body seems like crude stone. If virtue ascends to communicate with Heaven, the body humbly descends to the sea. If one’s words are thus humble, one’s body dwells above. If one internally debases the true, one externally prizes the false. Prizing virtue makes one esteemed in the world; debasing the body ensures tranquil existence. Seeing treasure, one becomes a great vessel; when the uncarved block scatters, the true form appears. Communing with Heaven reveals profound subtlety; communing with the sea gathers all goodness. Humble words earn respect and praise; an elevated body increases self and others. Debasing the true scatters the hun and po; prizing the false obscures the true. As the scripture says: 'Thus nobility must take lowliness as its root, and height must take lowness as its foundation.' By abiding in lowliness, one attains loftiness.\n\n**Thirteenth Question: On Height**\nOne asked again: \"What is height?\"\nThe answer: \"The Way of Heaven represses height. The way of humans elevates height. The greatly enlightened conceal their height. The honored and glorious parade their height. The Way of Heaven represses height to bestow grace upon the needy. The way of humans elevates height to harm the needy. The greatly enlightened conceal their height to transform the worthy. The honored and glorious parade their height to delude the foolish. As the scripture says: 'The high are repressed; the low are elevated.' What Heaven deems high covers what is below.\n\n**Fourteenth Question: On Lowness**\nOne asked again: \"What is lowness?\"\nThe answer: \"Lowness is the sea’s descent, where clarity and compliance gather; the heart’s descent, where purity and goodness gather. Clarity and compliance make depth and breadth; goodness and compliance make virtue broad. It is like erecting a house: when the ridgepoles and beams descend, the rafters and purlins gather to them. It is like receiving guests: when the host descends, the visitors gather. When rafters and purlins gather, success is achieved. When visitors gather, virtue is accomplished. As the scripture says: 'The rivers and seas can be kings of all valleys because they excel in lowness.' Abiding in lowness with clarity and compliance brings ultimate joy.\n\n**Fifteenth Question: On Joy**\nOne asked again: \"What is joy?\"\nThe answer: \"Joy is finding joy in the Dao by dwelling in pure lowness, or delighting in customs by clinging to song and wine. Joy in pure lowness arises from having no happiness or sorrow. Joy in song and wine brings both mirth and melancholy. Joy in the Dao of non-action entails no cultivation or attainment. Joy in the appearances of action entails cultivation and downfall. Joy in the true nature has no form or end. Joy in the false body has birth and death. As the scripture says: 'Thus the world delights in pushing forward without tiring.' Joy in the Dao brings no contention. Losing the joy of the Dao brings sorrow born of suffering.\n\n**Sixteenth Question: On Suffering**\nOne asked again: \"What is suffering?\"\nThe answer: \"Suffering is the affliction of body and mind. The deluded of the world suffer in their greed for life, thus entering the path of death. Those who suffer in scheming with the mind sink their natures into the realm of sin. The awakened to the Dao suffer in refining their forms, like crushing stone to retrieve jade. Those who suffer in forgetting schemes elevate their natures to the nine heavens.\"\n\nThe virtuous find joy within suffering, while the foolish find suffering within joy. The virtuous endure suffering until sweetness arrives, whereas the foolish reach the extremity of joy only to meet sorrow. As the scripture says: \"Favor arises from harm, and harm arises from favor.\" When one delights in the Dao and suffering is exhausted, one attains its purity.\n\n**Seventeenth Question: On Purity**\nOne asked again: \"What is purity?\"\nThe answer: \"Purity is when heaven is clear, revealing all phenomena; when the mind is clear, revealing its boundless spirit; when the abyss is clear, illuminating its dual essence. Penetrating celestial phenomena brings descending qi and harmonious balance. Penetrating boundless spirit unites one with the Dao in body. Penetrating the clarity of the abyss brings a spirit-spring without leakage. Attaining harmonious balance, qi and spirit intertwine. Attaining unity in body, the true form becomes imperishable. Attaining no leakage, the bright moon shines in fullness. As the scripture says: 'Profound, it seems the ancestor of the myriad things.' Exploring and penetrating purity leaves no room for turbidity.\"\n\n**Eighteenth Question: On Turbidity**\nOne asked again: \"What is turbidity?\"\nThe answer: \"Turbidity is when the deluded of the world indulge their intentions, becoming morally turbid; indulge their bodies, becoming licentiously turbid; indulge in evil, clouding their nature; indulge in licentiousness, forfeiting their lives. The awakened to the Dao remain celestial in clarity yet blend with earthly turbidity, bodily pure yet blend with worldly turbidity. Clarity blending with turbidity transforms yin into yang; clarity blending with the world appears outwardly foolish. As the scripture says: 'Who can make the turbid clear by settling it gently?' When turbidity is exhausted, radiance manifests.\"\n\n**Nineteenth Question: On Manifestation**\nOne asked again: \"What is manifestation?\"\nThe answer: \"Manifestation is when celestial phenomena do not display their brightness themselves—all eyes under heaven see their brightness. The principles of the Dao do not self-proclaim their clarity—all virtues under heaven recognize their attainment. When all eyes see its brightness, reverence arises. When all virtues recognize its attainment, trust is born. The world’s reverence for heaven and earth generates fortune. The Dao’s trust in non-action generates truth. As the scripture says: 'Not displaying oneself, thus one is bright; not asserting oneself, thus one is distinguished.' Inner radiance manifests while the outer self remains concealed.\"\n\n**Twentieth Question: On Concealment**\nOne asked again: \"What is concealment?\"\nThe answer: \"Concealment is inwardly practicing compassion to save lives while outwardly fearing others’ awareness; inwardly possessing true clarity yet outwardly appearing as a fool; inwardly free from entanglements yet outwardly seeming to blend with the dust; inwardly radiant in responding to things yet outwardly refraining from action; inwardly expanding virtue yet outwardly distant from others’ admiration; inwardly embracing the Dao yet outwardly free from delusion. Supreme clarity dissolves thoughts, and the body dwells in the mortal world. As the scripture says: 'The Dao is concealed and nameless—this is called its greatness.'\"\n\n**Twenty-First Question: On Greatness**\nOne asked again: \"What is greatness?\"\nThe answer: \"Greatness is the Dao. It cannot be encompassed by yin and yang—this is called the greatness of the Dao. Greatness is nature. It embraces all deviations with correctness—this is called the greatness of nature. The greatness of the Dao is the mother of the myriad things. The greatness of nature is the teacher of all deviations. Penetrating its mother, the myriad things receive their creation. Penetrating its teacher, all deviations return to correctness. Through creation, each attains its form. Through correctness, each penetrates the Dao. As the scripture says: 'The Dao that can be spoken is not the eternal Dao.' Greatness accommodates the small.\"\n\n**Twenty-Second Question: On Smallness**\nOne asked again: \"What is smallness?\"\nThe answer: \"Smallness is penetrating the subtle. When the Dao penetrates the small, it does not discriminate in its love or favor. When nature penetrates the small, it does not discriminate in its love or teaching. Without discriminating in love or favor, even the smallest beings receive the Dao’s qi. Without discriminating in love or teaching, even the smallest beings receive heaven’s light. Insentient small beings, receiving the Dao’s qi, gain form. Sentient small beings, receiving heaven’s light, gain nature. As the scripture says: 'Governing a great state is like cooking a small fish.' It does not favor the beloved nor abandon the weak. The subtlety of the small is not empty.\"\n\n**Twenty-Third Question: On Emptiness**\nOne asked again: \"What is emptiness?\"\nThe answer: \"Emptiness is the essence of the Dao. When yin and yang clarify its emptiness, the myriad things are born. When supreme nature clarifies its emptiness, the indistinct arises. The birth of the myriad things benefits the world. The arising of the indistinct transcends the world. Things benefiting people bring worldly joy. The Dao penetrating truth brings joy to nature. Worldly joy follows the numerology of yin and yang. Joy in nature reaches the extremity of emptiness without end. As the scripture says: 'Attain the extremity of emptiness, guard the sincerity of stillness—all things arise together.' Emptiness is the reality of the Dao.\"\n\n**Twenty-Fourth Question: On Reality**\nOne asked again: \"What is reality?\"\nThe answer: \"Reality is the Dao. The Dao’s birth precedes heaven and earth, enduring to this day without perishing—this is called reality. Reality is nature. Nature’s birth lies beyond the myriad things, enduring to this day without perishing—this is called reality. When the Dao clarifies its reality, it grasps yin and yang, giving birth to the myriad things. When nature clarifies its reality, it masterfully penetrates the pivot of transformation. The birth of the myriad things reveals the reality of the Dao. The transformation of the myriad things reveals the reality of nature. The Dao is empty yet its qi is real; nature is empty yet its life is real. As the scripture says: 'Empty the heart, fill the belly.' Clarifying its reality, the Dao and nature attain true tranquility.\"\n\n**Twenty-Fifth Question: On Tranquility**\nOne asked again: \"What is tranquility?\"\nThe answer: \"Tranquility is the Dao.\"\n\nThe Supreme Dao in tranquility tranquilly moves yin and yang, giving birth to the myriad things. The Supreme Nature in tranquility tranquilly refines lead and mercury, tempering its form. When yin and yang transform, they preserve the myriad things. When lead and mercury congeal, they preserve its nature. Preserving the myriad things is humanity’s abundance. Preserving its nature is the spirit’s numinosity. Human abundance desires its splendor; the spirit’s numinosity embraces the Dao. Desiring splendor brings flourishing and withering; embracing the Dao brings formlessness and endlessness. As the scripture says: *\"Seen, it is not enough to be seen; heard, it is not enough to be heard.\"* When nature delights in true tranquility, it responds to busyness.\n\n**Twenty-Sixth Question: On Busyness**\nOne asked again: \"What is busyness?\"\nThe answer: \"Busyness is the Dao’s tranquility—its two qi are ever busy. Busyness is nature’s tranquility—its four illusions are ever busy. The two qi are busy, dividing the four seasons into above and below. The four illusions are busy, as day and night greedily contend in coming and going. The two qi are busy: spring transforms into warmth, summer into heat, autumn into coolness, winter into cold. The four illusions are busy: greed for wealth, attachment to beauty, infatuation with wine, competition in qi. The two qi are busy, creating and transforming the myriad things—this is yin and yang following heaven and earth’s virtue. The four illusions are busy, creating the myriad affairs—this is sentient beings violating heaven and earth’s virtue. As the scripture says: *'Sounds harmonize with one another; front and back follow in succession.'* Those who awaken amid busyness attain true non-departure.\"\n\n**Twenty-Seventh Question: On Departure**\nOne asked again: \"What is departure?\"\nThe answer: \"Departure is the Dao’s eternal abiding without end—the Dao’s image departs nowhere. Departure is the myriad things taking form and reaching their limit—qi departs somewhere. The Dao unites yin and yang. Qi unites the myriad things. When numbers are exhausted, yin and yang scatter and depart. When form ends, the myriad things decay and depart. Yin and yang scatter, yet the Dao remains. The myriad things decay, yet nature endures. As the scripture says: *'From ancient times to the present, its name does not depart.'* When things perish, qi departs; when yang harmonizes, qi comes.\"\n\n**Twenty-Eighth Question: On Coming**\nOne asked again: \"What is coming?\"\nThe answer: \"Coming is movement without form. Heaven and earth await their time to intermingle—then the two qi come. The myriad forms await their time to receive qi—then yin and yang come. The Dao is heaven and earth’s position; form is yin and yang’s position. Heaven and earth abide in the Dao—this is enduring position. Yin and yang abide in the myriad things—this is provisional position. Enduring position brings the four seasons’ transformation and communication. Provisional position brings the three powers’ gathering. Transformation and communication create and transform. Gathering creates true form. Withering is the death of things; softness is the birth of form. As the scripture says: *'In human life, one is supple and weak; in death, one is stiff and strong.'* Softness comes, uniting heaven’s clarity and peace.\"\n\n**Twenty-Ninth Question: On Peace**\nOne asked again: \"What is peace?\"\nThe answer: \"Peace is the Dao. The Dao nurtures the myriad things without choosing favorites or bestowing grace—it distributes qi in peace. Peace is reality. Reality unites the myriad transformations without choosing favorites or bestowing marvels—it distributes virtue in peace. When qi is peaceful, things grow in harmony. When virtue is peaceful, people attain goodness in harmony. Things growing in harmony all preserve their creation and transformation. People attaining goodness in harmony all preserve their Dao and virtue. As the scripture says: *'Heaven and earth unite, descending sweet dew—no one commands it, yet it naturally spreads in marvelous equality.'* This clarifies its constancy.\"\n\n**Thirtieth Question: On Constancy**\nOne asked again: \"What is constancy?\"\nThe answer: \"Constancy is the Dao. Constantly following the Dao saves human numinosity. Constantly following qi saves the forms of things. People constantly following the Dao are like fish in water. Things constantly following qi are like lamps receiving oil. Fish separated from water die. Lamps without oil go out. Constantly following the Dao brings human life. Constantly following qi brings the life of things. People are spirit; things are form. When form and spirit unite in marvel, they merge with the Dao’s reality. As the scripture says: *'Constantly excelling in saving people, thus there are no abandoned people.'* Delighting in the Dao’s constancy is true joy.\"\n\n**Thirty-First Question: On Joy**\nOne asked again: \"What is joy?\"\nThe answer: \"Joy is the Dao’s delight. Clarity without turbidity is the Dao’s delight. Joy without sorrow is the Dao’s delight. Joy is virtue’s delight. Encouraging evil to follow goodness is virtue’s delight. Seeing kindness and repaying its grace is virtue’s delight. Joy is lost delight. Turning from goodness to delight in evil is lost delight. Forgetting grace and repaying kindness is lost delight. Delighting in the Dao perfects its merit. Delighting in virtue perfects its conduct. Delighting in loss brings regression and decline. As the scripture says: *'Those of the Dao unite with the Dao; those of virtue unite with virtue; those of loss unite with loss.'* Joyful delight forgets sorrow.\"\n\n**Thirty-Second Question: On Sorrow**\nOne asked again: \"What is sorrow?\"\nThe answer: \"Those with sorrow do not comprehend the Dao’s true principle. Many affairs bring much sorrow. Those without sorrow truly unite with the Dao’s true wisdom. No affairs bring no sorrow. Many affairs with sorrow cloud the spirit and muddy qi. No affairs without sorrow clarify the spirit and refresh qi. Muddy qi brings thoughts of debauchery and evil, losing one’s hun and po. Clear qi brings no anxieties, only purity and goodness, gathering lead and mercury.\"\n\nThe hun and po scatter and one’s nature sinks downward. Lead and mercury congeal and one’s nature ascends upward. As the scripture says: *\"Abandon learning and there is no sorrow.\"* Without sorrow, contemplating the Dao yields true and substantial attainment.\n\n**Thirty-Third Question: On Attainment**\nOne asked again: \"What is attainment?\"\nThe answer: \"True attainment gains the nameless purity of celestial favor; false attainment gains the named impurity of worldly disgrace. Those who attain celestial favor harbor no greed or contention. Those who attain worldly disgrace indulge in greed and contention. Without greed or contention, one truly penetrates the virtuous Dao. With greed and contention, one falsely strays into vulgar evil. Preserving the myriad practices in truth brings celestial favor. Fabricating the myriad affairs in falsity brings worldly disgrace. Awakening brings no birth; delusion brings downfall. As the scripture says: *'Favor and disgrace are like startling things.'* Clinging to false names and forms loses the true Dao.\"\n\n**Thirty-Fourth Question: On Loss**\nOne asked again: \"What is loss?\"\nThe answer: \"Loss is the loss of the non-action Dao. Loss is attachment to the action-bound Dao. Loss is the loss of the non-action virtue; loss is attachment to the action-bound virtue. Penetrating the non-action Dao brings true inexhaustibility. Clinging to the action-bound Dao brings false finitude. Penetrating the non-action virtue brings constant equilibrium of nature. Clinging to the action-bound virtue brings partiality and resentment in the heart. The non-action Dao is inexhaustible, truly indestructible. The action-bound Dao is finite, falsely subject to decay. The non-action virtue is truly equanimous, connecting to Heaven. The action-bound virtue is falsely partial, and thus one falls. As the scripture says: *'Thus, lose the Dao and then virtue; lose virtue and then benevolence.'* Penetrating non-action brings no loss, only the clarity of celestial blessing.\"\n\n**Thirty-Fifth Question: On Blessing**\nOne asked again: \"What is blessing?\"\nThe answer: \"Blessing—true blessing is the Dao, the mandate of humanity. Worldly blessing is dust, the treasure of things. The blessing of the non-action Dao is like the full moon, ever waxing. The worldly blessing of action is like the waning moon, gradually diminishing. The full moon waxes and is the mandate of humanity; the waning moon diminishes and is the treasure of the world. The mandate is the inexhaustible blessing of the Dao; the treasure is the finite emptiness of the world. Awakening to the Dao generates blessing. Delusion in the world sinks one into karmic bondage. As the scripture says: *'Blessing, oh!—wherein misfortune lies concealed. Who knows its limits?'* Penetrating the Dao’s blessing brings no misfortune.\"\n\n**Thirty-Sixth Question: On Misfortune**\nOne asked again: \"What is misfortune?\"\nThe answer: \"Misfortune is human desire, premeditated transgression. If one’s karma bears a single part, Heaven inflicts tenfold misfortune. If one’s goodness bears a single part, Heaven bestows tenfold blessing. As the scripture says: *'Cut off profit at its source, and tenfold strength is employed.'* If one does not generate myriad evils, one surpasses the cultivation of myriad virtues. If one does not cling to myriad things, one surpasses the bestowal of myriad kindnesses. As the scripture says: *'Three returns by day and night employ ten-thousandfold strength.'* Penetrating non-action brings the ten-thousandfold clarity of celestial blessing. Delusion in action conceals false blessing within misfortune. As the scripture says: *'Misfortune, oh!—wherein blessing leans.'* The true does not dwell externally.\"\n\n**Thirty-Seventh Question: On Abandonment**\nOne asked again: \"What is abandonment?\"\nThe answer: \"Abandonment—abandoning wealth in the world seeks blessing. Abandonment in the Dao does not abandon the existent to grasp the nonexistent. Abandoning wealth to seek blessing fails to penetrate true blessing. Abandoning the existent to cling to the nonexistent fails to penetrate true nothingness. True blessing is boundless compassion. True nothingness is boundless penetration. Compassion saves beings; penetration illuminates principle. Broad compassion gathers virtue; illuminating principle clarifies the Dao. As the scripture says: *'Now, abandon compassion and be brave; abandon frugality and be expansive.'* Advancing the Dao is not a matter of grasping.\"\n\n**Thirty-Eighth Question: On Grasping**\nOne asked again: \"What is grasping?\"\nThe answer: \"Grasping is delusion, not correctness. The utmost real is the Dao; penetrating clarity is virtue. Exhausting things to penetrate returns the Dao. Dwelling below in profundity returns virtue. The true does not cling to the existent, and things return to it. The sea does not reside above, and clarity returns to it. Things returning completes their transformation. Clarity returning completes their utmost virtue. If one awakens to worldly falsity, one penetrates emptiness and nothingness to achieve merit. If one awakens to exhausting the self, one penetrates humility to achieve conduct. As the scripture says: *'Dwell in its substance, not its flower—thus, abandon that and grasp this.'* True nothingness grasps nothing and illuminates its center.\"\n\n**Thirty-Ninth Question: On the Center**\nOne asked again: \"What is the center?\"\nThe answer: \"The center is Heaven’s equilibrium. Heaven bestows grace to generate the myriad things without discrimination—this is called illuminating its center. Human equilibrium truly spreads virtue to penetrate the myriad transformations without partiality or favor—this is called illuminating its center. Heaven’s equilibrium brings the generation and completion of the myriad things, and Heaven has its merit. Human equilibrium brings the true penetration of the myriad transformations, and humanity has its conduct. If Heaven favors with grace, it lacks great merit. If humanity favors with kindness, it lacks great conduct. As the scripture says: *'The level Dao is like a gully.'* Illuminating the level Dao brings boundless celestial blessing.\"\n\n**Fortieth Question: On Extremes**\nOne asked again: \"What are extremes?\"\nThe answer: \"Extremes fail to penetrate principle. Seeing the existent and failing to penetrate the nonexistent, or seeing the nonexistent and failing to penetrate the existent—this is called extreme views.\"\n\nWithout clinging to extreme views, one penetrates principle. Seeing the existent and penetrating the nonexistent, seeing the nonexistent and penetrating the existent—this is called comprehension. Penetrating the existent, one embraces the Dao and withdraws into the grotto-heavens. Reaching the nonexistent, one embraces the Dao and conceals oneself in the capital’s splendor. As the scripture says: *\"Act without acting, engage in affairs without affairs.\"* Not standing on either extreme is true non-attachment.\n\n**Forty-First Question: On Attachment**\nOne asked again: \"What is attachment?\"\nThe answer: \"Non-attachment to attachment means blending with the dust and merging one’s body with the myriad things. Truly unattached to the mind of the myriad existents—this is called great comprehension. Attachment to non-attachment means transcending the dust and distancing one’s body from the myriad things. Truly attached to the thoughts of the myriad things—this is called incomprehension. Non-attachment to attachment makes the body like the lotus root. Attachment to non-attachment makes the body like the lotus flower. The body in the dust while the nature is free of dust—this is true awakening. The body distant from the dust while the mind clings to dust—this is unawakened. As the scripture says: *'The worn-out becomes new.'* True awakening means the body responds to things—neither attached nor detached.\n\n**Forty-Second Question: On Detachment**\nOne asked again: \"What is detachment?\"\nThe answer: \"Detachment means the body withdraws from desire, the mind forgets the dust, and one serenely guards their aspiration. Detachment means the body retreats into famous mountains, truly harmonizing with zither and books, serenely delighting in the communion of aspiration. Guarding one’s aspiration is simplicity. Delighting in the communion of aspiration is refinement. The body simple and the mind refined—this is called the false form and spirit both wondrous. The form simple and dispersed while the true nature refined—this alone is called the true form and spirit both wondrous. As the scripture says: *'Do not show what may be desired, and the heart will not be disturbed.'* Pure liberation from the shell of things is the communion of the adept.\n\n**Forty-Third Question: On Humanity**\nOne asked again: \"What is humanity?\"\nThe answer: \"Humanity means that if one indulges in evil during life, one sinks into evil destinies after death, endlessly transmigrating—this is called Heaven’s governance over humanity. If one does not cultivate blessings in life, one sinks into poverty and lowliness after death, endlessly transmigrating—this is called Heaven’s governance over humanity. If one possesses goodness, one is born in the Central Lands to cultivate the Dao. If one accumulates great felicity, one is born in the Middle Kingdom to amass virtue. If one has evil, Heaven metes out evil retribution. If one has goodness, Heaven metes out good retribution. As the scripture says: *'In governing people and serving Heaven, nothing surpasses frugality.'* Humanity’s failure to comprehend Heaven’s intent arises from clinging to the self.\n\n**Forty-Fourth Question: On the Self**\nOne asked again: \"What is the self?\"\nThe answer: \"The self—the true self—is humanity’s nature. The self’s Dao is the formless Dao; the self’s goodness is the effortless goodness, which all call unworthy. The false self is humanity’s evil. The false Dao is the Dao of nurturing the body; the false goodness is the goodness of effort—all call this worthy. The true self—the formless Dao is true; the effortless goodness is constant. The false self—the Dao of nurturing the body is false; the goodness of effort is detestable. As the scripture says: *'The world all says my Dao is great and seems unworthy; if it were worthy, it would have long since become small.'* Illuminating the true self requires no contention.\n\n**Forty-Fifth Question: On Contention**\nOne asked again: \"What is contention?\"\nThe answer: \"Contention means that worldly contention arises from myriad evils; Heaven’s silence arises from myriad virtues. Worldly contention involves right and wrong; the Dao’s contention involves pure goodness. The world’s mouth contends while the heart lacks comprehension; the Dao’s mouth is silent while the truth is truly communicated. Lacking comprehension leads to vast erudition without knowing its wonder. True communication means cutting off learning yet knowing its wonder. Both are called delusion and awakening. As the scripture says: *'The good do not contend; the contentious are not good.'* Comprehending Heaven’s intent, one appears outwardly inarticulate.\n\n**Forty-Sixth Question: On Inarticulateness**\nOne asked again: \"What is inarticulateness?\"\nThe answer: \"Inarticulateness seems like inability to speak. Comprehending the Dao and dispersing into simplicity, the inarticulate seem eloquent. Embracing the Dao and returning to simplicity, the eloquent seem inarticulate. Dispersing simplicity harms qi and constrains the body. Returning to simplicity preserves qi and frees the body. To the foolish, the eloquent seem inarticulate. To the wise, the inarticulate seem eloquent. As the scripture says: *'Great skill seems clumsy; great eloquence seems inarticulate.'* Benefiting the true requires outwardly diminishing.\n\n**Forty-Seventh Question: On Diminishing**\nOne asked again: \"What is diminishing?\"\nThe answer: \"Diminishing means that the person of the Dao, when taking action, diminishes the self and does not diminish others. Placing oneself after others is possessing virtue. The person without the Dao, when taking action, diminishes others and does not diminish the self. Placing others before oneself is lacking virtue. Possessing virtue is non-action. Lacking virtue is action. Non-action that diminishes things is having the Dao; action that exhausts things is lacking the Dao. As the scripture says: *'In pursuing the Dao, daily diminish.'* Outwardly diminishing to the utmost in things is where the Dao’s benefit lies.\n\n**Forty-Eighth Question: On Benefit**\nOne asked again: \"What is benefit?\"\nThe answer: \"Benefit means benefiting the true is the principle of the Dao. Awakening to the Dao, one studies the correct teaching—those who comprehend benefit the true. Deluded by the world, one studies heterodox methods—those who lack comprehension benefit the self. Benefiting the true clarifies the Dao; benefiting the self exhausts things. Clarifying the Dao is pure goodness; exhausting things is greed and strife.\"\n\nPurity and goodness accumulate virtue; greed and strife accumulate karma. Cultivating the ten thousand practices elevates the true. Accumulating the ten thousand karmas causes the self to fall. As the scripture says: *'In learning, daily increase.'* What one learns that increases the true of the Dao endures long.\n\n**Forty-Ninth Question: On Endurance**\nOne asked again: \"What is endurance?\"\nThe answer: \"Endurance is the enduring of humanity—following the Dao, the true endures. Forgetting emotions, life endures. Illuminating the wondrous, heaven endures. Penetrating wisdom, principle endures.\nThe true enduring is attaining the formless body.\nLife enduring is treasuring the radiant perfection.\nHeaven enduring is the auspicious mist curling.\nPrinciple enduring is the spontaneous penetration.\nIlluminating the formless, the Dao is complete.\nIlluminating radiant perfection, life is complete.\nIlluminating auspicious mist, spirit is complete.\nIlluminating the spontaneous, virtue is complete.\nAs the scripture says: *'Heaven is enduring, earth is lasting.'*\nFollowing heaven’s endurance, there is no shortness.\"\n\n**Fiftieth Question: On Shortness**\nOne asked again: \"What is shortness?\"\nThe answer: \"Shortness is failing to uphold the Dao to the end—will is short. Seeing goodness without compassion, conduct is short. Disrespecting the two venerables, filial piety is short.\nShort will yields no merit. Without compassion, there is no conduct. Without filial piety, gratitude is forgotten.\nHaving will completes the Dao. Having compassion completes virtue. Repaying gratitude completes filial piety.\nWithout Dao, without virtue, without filial piety, there is shortness. With Dao, with virtue, with filial piety, there is no shortness.\nAs the scripture says: *'This is not goodness.'*\nShort wisdom arises from false craft.\"\n\n**Fifty-First Question: On Craft**\nOne asked again: \"What is craft?\"\nThe answer: \"Craft is exhausting the ten thousand cunning actions—clarifying the ten thousand gains, where gains are many, harms the self. Cutting off the ten thousand cunning non-actions—clarifying the ten thousand purities, where purity is abundant, preserves the self.\nWorldly gains multiply, giving rise to misfortune. Daoist purity multiplies, giving rise to blessing.\nFalse craft gives rise to misfortune; true purity gives rise to blessing.\nDeluded by existence, it is false. Awakened to non-existence, it is true.\nFalse existence is harmed by evil; true non-existence is pervaded by goodness.\nAs the scripture says: *'Abandon craft, discard gain—thieves and robbers will not exist.'*\nThe enlightened forget false craft and uphold true clumsiness.\"\n\n**Fifty-Second Question: On Clumsiness**\nOne asked again: \"What is clumsiness?\"\nThe answer: \"Clumsiness is innate nature penetrating worthiness—outwardly appearing foolish and clumsy, called returning to simplicity. True wisdom penetrating culture—false form appearing dull and clumsy, called hidden concealment.\nFacing false delusion, clumsiness is clarity. Facing true awakening, clumsiness is attainment.\nPenetrating the world, things are attained. Penetrating the Dao, the true is attained.\nEncountering worldly scholars, one responds to the ten thousand existences, and the mechanism naturally penetrates existence. Encountering kindred spirits, one responds to the ten thousand non-existences, and the mechanism naturally penetrates non-existence.\nOutward clumsiness is not true foolishness.\nAs the scripture says: *'Nature has craft and clumsiness—it can be hidden.'*\nUtmost craft appearing clumsy is praised by the enlightened.\"\n\n**Fifty-Third Question: On Praise**\nOne asked again: \"What is praise?\"\nThe answer: \"Praise is the noble extolling others’ virtues and concealing their flaws. The petty conceal others’ virtues and extol their flaws.\nConcealing others’ flaws and evil, extolling their virtues and goodness, is called virtue. Extolling others’ flaws and evil, concealing their virtues and goodness, is called transgression.\nHaving virtue, one is again honored by others. Having transgression, one is again despised by others.\nThose esteemed in this life are esteemed by others in the next. Those belittled in this life are belittled by others in the next.\nVirtue completing the Dao ascends. Transgression deluded by the world falls.\nAs the scripture says: *'The wise do not speak; those who speak are not wise.'*\nGood praise has no slander.\"\n\n**Fifty-Fourth Question: On Slander**\nOne asked again: \"What is slander?\"\nThe answer: \"Slander is the foolish slandering, not knowing the worthy. The worthy do not slander, knowing the foolish.\nThe foolish promote evil and suppress goodness. The worthy encourage evil to return to goodness.\nThe foolish generate transgressions, manifesting their appearances to seek blessing. The worthy erase transgressions, forgetting their appearances to uphold the Dao.\nThe deluded have evil and goodness. The awakened have no evil and no goodness.\nHaving goodness is inconstant. Having no evil is constant.\nConstancy is called the Dao.\nAs the scripture says: *'The foolish take heaven and earth’s patterns as sagely; I take the patterns of time and things as wise.'*\nWithout slander, impure thoughts are forgotten.\"\n\n**Fifty-Fifth Question: On Forgetting**\nOne asked again: \"What is forgetting?\"\nThe answer: \"Forgetting is contemplating the Dao and forgetting the world, contemplating the correct and forgetting the heterodox—called delusion and awakening.\nContemplating the Dao cultivates the true. Contemplating the world nurtures the self.\nContemplating the correct penetrates the ultimate principle. Contemplating the heterodox cultivates the physical form.\nContemplating the true yields merit without transgression. Nurturing the self yields no merit with transgression.\nContemplating the correct has conduct without attachment. Contemplating the heterodox has attachment without conduct.\nAs the scripture says: *'The mind arises from things and dies by things.'*\nPenetrating principle and illuminating the pivot, true forgetting of thoughts—externally without greed.\"\n\n**Fifty-Sixth Question: On Greed**\nOne asked again: \"What is greed?\"\nThe answer: \"Greed is coveting desires and losing life, coveting wealth and losing the self. The deluded first taste sweetness, then bitterness.\nEradicating desires preserves life. Cutting off wealth preserves the self. The awakened first taste bitterness, then sweetness.\"\n\nLosing life and losing the self is folly; preserving life and preserving the self is wisdom. The turbid covet the world and violate the Dao; the pure forget the world and attain the Dao. As the scripture says: *\"No sin is greater than yielding to desire; no disaster is greater than discontent.\"* Not coveting worldly falsity is to truly embrace the Dao.\n\n**Fifty-Seventh Question: On the Dao**\nOne asked again: \"What is the Dao?\"\nThe answer: \"The Dao is that which penetrates things yet is no-thing—this is the Dao. Knowing emptiness yet not empty, this is constancy, called the constancy of the Dao. When the constancy of the Dao is attained, non-action flows freely. *Non-* reveals the subtlety of the indistinct; *action* reveals the principle of adaptability. *Non-* lies beyond yin and yang; *action* illumines the transformations of the myriad things. Penetrating *non-* and illuminating *being*, comprehending *action* and illuminating *non-*—this is not clinging to form or doing. As the scripture says: *'The Dao constantly takes no action, yet there is nothing it does not do.'* The Dao’s doing is not petty goodness that transforms the vulgar.\n\n**Fifty-Eighth Question: On the Vulgar**\nOne asked again: \"What is the vulgar?\"\nThe answer: \"The vulgar is the common body of man. The true is the utmost spirit. It is called *having-thing*. Beyond *having*, the Dao precedes heaven and earth. Beyond things, nature lies outside yin and yang. Illuminating *having* is like seeing jade within stone. Illuminating *thing* is like seeing a pearl within a clam. *Having* is man’s form; *thing* is the true nature. When form ends, nature remains constant. When things are exhausted, qi remains ever-present. Deluded by *having* and *thing*, the hun and po scatter. Awakened to the Dao-nature, creation is accomplished. As the scripture says: *'There was a thing, chaotic yet complete, born before heaven and earth.'* Externally responsive to the vulgar, yet without falsity.\n\n**Fifty-Ninth Question: On Falsity**\nOne asked again: \"What is falsity?\"\nThe answer: \"Falsity is this: the superior person subtly practices myriad purities and myriad virtues, achieving great penetration; the inferior person openly indulges in myriad impurities and myriad evils, inviting great ridicule. The pure follow the Dao and endure; the turbid oppose the Dao and perish. The wise appear unwise; the foolish appear not foolish. Purity and turbidity, wisdom and folly—over time, the world knows them. The brightness of the sun and moon does not see its own light; the eyes of the world see their brightness. As the scripture says: *'When the inferior person hears the Dao, they laugh greatly.'* This is not *is*.\n\n**Sixtieth Question: On *Is***\nOne asked again: \"What is *is*?\"\nThe answer: \"*Is* is following the Dao, thus it is true. *Not-is* is following things, thus it is false. Illuminating the true prevents attachment to the false; illuminating *is* prevents speech of *not-is*. Illuminating the true subtly penetrates the Dao; illuminating *is* subtly penetrates heaven. Illuminating the Dao yields merit; illuminating heaven yields conduct. Merit is the yang Dao; conduct is the yin virtue. Privately aiding the myriad forms is called yang merit. Stealthily rescuing the myriad sufferings is called yin virtue. As the scripture says: *'Those who see themselves are not bright; those who assert themselves are not illustrious.'* Asserting oneself, contemplating the Dao, and responding to things—this is having thought.\n\n**Sixty-First Question: On Thought**\nOne asked again: \"What is thought?\"\nThe answer: \"Awakened thought—knowing the myriad purities and acting—yields myriad virtues; knowing the myriad attachments and acting—yields myriad evils. Myriad purities and myriad virtues lead to true ascent; myriad attachments and myriad evils lead to false descent. Living without transgression, dying without suffering. Living with transgression, dying with suffering. As the scripture says: *'My words are very easy to know, very easy to practice, yet none in the world can know, none can practice.'* Thinking and knowing the subtlety of principle, forgetting the world.\n\n**Sixty-Second Question: On the World**\nOne asked again: \"What is the world?\"\nThe answer: \"The world is this: penetrating the world and knowing man, one forgets the world and turns toward the Dao; deluded by the world and ignorant of man, one clings to the world and turns from the Dao. Truly penetrating the myriad things, one emerges from the shell of the myriad things. Falsely deluded by the myriad things, one remains within the shell of the myriad things. Truly emerging from the shell of things is the Dao; falsely remaining within the shell of things is dust. Truly abiding in the Dao, there is no life and death; falsely abiding in dust, there is life and death. Awakened, wisdom penetrates; deluded, it does not. As the scripture says: *'Knowing others is wisdom.'* When things reach their limit and transcend the world, the profound mystery is illuminated.\n\n**Sixty-Third Question: On the Subtle**\nOne asked again: \"What is the subtle?\"\nThe answer: \"The subtle is this: true non-desire—nature is like the full moon, observing its subtlety; false desire—delusion is like firefly glow, seeing its traces. The full moon illumines the ten directions; firefly glow illumines a single point. Illuminating the ten directions penetrates the myriad transformations; illuminating a single point clings to one dharma. Penetrating transformations accommodates the heterodox; clinging to dharma slanders the correct. Without high or low, penetrating—this is correctness. With love and hate, clinging—this is heterodoxy. As the scripture says: *'Constantly without desire, observe its subtlety; constantly with desire, observe its manifestations.'* Penetrating the subtle illuminates the minute.\n\n**Sixty-Fourth Question: On the Minute**\nOne asked again: \"What is the minute?\"\nThe answer: \"The minute is this: seeing its profound subtlety illuminates the Dao; illuminating its profound consideration penetrates the world. Penetrating the Dao foresees penetrating the world; penetrating the world does not penetrate the Dao. Illuminating the Dao is elevation; penetrating the world—penetrating the world [forgetting the world]—is reverence. Penetrating the Dao, practicing the Dao, is attainment. Penetrating the world, forgetting the world, is wisdom.\"\n\nThe enlightened transform the world’s worthy. The worthy transform the world’s foolish. When the foolish attain clarity, they become worthy; when the worthy attain clarity, they become enlightened. As the scripture says: *\"Subtle, wondrous, and profoundly interconnected—deep beyond comprehension.\"* Awakening to the hidden and minute illuminates boundless clarity.\n\n**Sixty-Fifth Question: On the Square**\nOne asked again: \"What is the square?\"\nThe answer: \"The square is this: heaven is square, earth is round—these arise within the myriad things. They do not bestow life through favor, nor do they bring destruction through hatred. The Supreme spreads virtue to save the ten thousand spirits, not clinging to the noble with attachment, nor cutting off the lowly. Heaven and earth give life to the myriad things, spreading *qi* with impartiality. The Supreme saves the ten thousand spirits, spreading virtue with impartiality. When the myriad things connect through *qi*, they partake in heaven and earth’s great benevolence. When the ten thousand spirits connect through virtue, they partake in the Supreme’s great meritorious conduct. This is called the sages of heaven and earth—yet if they act with partiality, even their greatest deeds and conduct become flawed. As the scripture says: *'Thus the sage is square but does not cut.'* Truly illuminating the square inch of the heart-mind radiates a perfect mandate.\"\n\n**Sixty-Sixth Question: On the Round**\nOne asked again: \"What is the round?\"\nThe answer: \"The round is this: heaven’s round light—when gazing at the sun, the moon is full; on the darkest night, its light is exhausted. A person’s mandate-light: at fifteen, it begins to receive the embryo; at sixteen, the mandate is complete. At sixty-four (eight times eight), the hexagrams are exhausted. When light is exhausted, heaven has no illumination; when hexagrams are exhausted, a person has no mandate. Few desires extend the mandate; many desires shorten the lifespan. This is called the waxing and waning of heaven and humanity. Without attachment, the mandate abides; without things, the nature flows. When the mandate flows through nature, it is like water encountering earth. When nature flows through the mandate, it is like earth encountering water. Constantly practicing the good and flowing through it, true fire descends; after nine transformations, the form becomes indestructible. As the scripture says: *'Seeing the small is called clarity.'* When the round light manifests, it responds.\"\n\n**Sixty-Seventh Question: On Response**\nOne asked again: \"What is response?\"\nThe answer: \"The formless Dao does not respond to the embodied form; the formless nature does not respond to the rituals of attachment. Those who value substance follow the immortal Dao, and the Dao responds to their nature. Those who value ornamentation follow the human Dao, and their form responds to ritual. Responding to nature is truth; responding to ritual is falsehood. Heaven’s Dao suppresses the high and uplifts the low; humanity’s Dao diminishes the poor and serves the rich. Following heaven’s Dao is contrary to humanity’s Dao; following humanity’s Dao is contrary to heaven’s Dao. As the scripture says: *'When highest ritual is enacted, none respond.'* When the Dao responds to non-action, true transformation flows.\"\n\n**Sixty-Eighth Question: On Transformation**\nOne asked again: \"What is transformation?\"\nThe answer: \"Transformation is this: true transformation through non-action is like seeing the moon reflected in water; false transformation through action is like seeing one’s form in a mirror. Knowing the transformation of non-action, true nature flows. Seeing the transformation of action, false form exerts force. Flowing is the truth of non-attachment, forgetting the falsehood of attachment. Force is the falsehood of attachment, obscuring the truth of non-attachment. True transformation flows through nature and Dao; false transformation clings to the body and profit. When the Dao flows, nature is preserved; when profit is grasped, the body is harmed. As the scripture says: *'Act through non-action, and nothing is left ungoverned.'* Responding to true transformation, the Dao is without attachment.\"\n\n**Sixty-Ninth Question: On Attachment**\nOne asked again: \"What is attachment?\"\nThe answer: \"Attachment is this: when bent, the Dao-nature is without attachment, yet the body seems to possess it; when rigid, the Dao-nature has attachment, yet the body appears without it. A bent nature without attachment is without leakage; a rigid nature with attachment is with leakage. Bent is worthy; rigid is foolish. Without leakage and with worthiness, there is Dao and virtue. With leakage and without worthiness, there is no Dao and no virtue. The truth of having Dao preserves the hun and po; the clarity of having virtue flows through the ten thousand transformations. As the scripture says: *'I have no desires, and the people become naturally simple; I have no attachments, and the people become naturally pure.'* The Dao without attachment is true, unentangled by worldly things.\"\n\n**Seventieth Question: On Things**\nOne asked again: \"What are things?\"\nThe answer: \"Things are this: a person within the shell of things is like a fish in a net; a person beyond the shell of things is like truth within the Dao. A fish in a net, separated from water, dies. Truth within the Dao, separated from things, lives. If a fish does not covet bait, it remains in water; if a person does not covet things, they remain in the Dao. A fish in water lives; a person in the Dao thrives. A fish obtaining the pearl’s light transforms; a person obtaining the surge of *qi* flows through. Both, when deluded, die; when awakened, live. As the scripture says: *'Heaven’s net is vast, loose yet never failing.'* Beyond things, one forgets the mechanism.\"\n\n**Seventy-First Question: On Mechanism**\nOne asked again: \"What is mechanism?\"\nThe answer: \"Mechanism is this: cunning. Those without Dao use cunning to harm others, securing themselves—this is called thievery. Those with Dao use cunning to diminish themselves, securing others—this is called blessing. Petty cunning is foolish and evil; great cunning is worthy and good. The foolish defy heaven; the worthy follow heaven. Defying heaven, the body falls; following heaven, truth ascends. The fallen follow the murky path of yin; the ascended follow the clear path of yang. As the scripture says: *'The people are difficult to govern because of their many schemes.'* The wisdom of spontaneity illuminates the Dao, leaving no concerns.\"\n\n**Seventy-Second Question: On Thought**\nOne asked again: \"What is thought?\"\nThe answer: \"In delusion, the world gives rise to the heart-mind; in awakening to the Dao, there is no thought. Those who covet and contend spin myriad thoughts; those who are pure and good sever myriad thoughts. Obscurity brings boundless transgression; clarity brings boundless blessing. Without goodness, one remains ever evil; without evil, one remains ever good. Ever evil accumulates faults; ever good accumulates virtue. Faults bring the suffering of yin; virtue brings the joy of yang. The world knows gain but not harm; the Dao knows blessing but not greed. As the scripture says: *'To know yet to seem not to know is best; not to know yet to claim to know is a flaw.'* Sever thought and exhaust all things, and the supreme Dao draws near.\"\n\n**Seventy-Third Question: On Intimacy**\nOne asked again: \"What is intimacy?\"\nThe answer: \"Intimacy is this: in the world, what people hold close are fame and profit, false treasures. Beyond things, what they hold close are the Dao and virtue, true treasures. False intimacy brings fame and profit, yet with them come favor and disgrace; false treasures invite harm from evil men. True intimacy brings the Dao and virtue, and with them clarity and peace; true treasures invite encroachment from good men. The false benefits the body but harms its truth; the true benefits the body but harms the false. As the scripture says: *'Which is closer, fame or the self? Which is greater, the self or wealth?'* When the Dao is intimate, things grow distant.\"\n\n**Seventy-Fourth Question: On Distance**\nOne asked again: \"What is distance?\"\nThe answer: \"Distance is this: to loathe the world is to find the Dao without distance; to loathe profit is to find the body without harm; to loathe nobility is to find the body without baseness. The Dao without distance connects to the world; the body without harm connects to profit; the body without baseness connects to nobility. Connection to the world brings the return of goodness; connection to profit brings the return of blessing; connection to nobility brings the return of virtue. Ever good, one connects to the numinous; truly blessed, one connects to destiny; supremely virtuous, one connects to heaven. As the scripture says: *'Thus it cannot be made intimate, nor can it be made distant.'* Not distancing oneself from the truth of the Dao, one illuminates its eternity.\"\n\n**Seventy-Fifth Question: On Remoteness**\nOne asked again: \"What is remoteness?\"\nThe answer: \"Remoteness is this: the Dao encompasses eternity; heaven’s height covers all; earth’s bearing sustains all things; the king’s greatness brings clarity to all. The Dao illumines the ages; heaven illumines the myriad forms; earth gives life to the myriad things; the king brings peace to the myriad people. The Dao embraces all; heaven covers all; earth bears all; the king contains all. The Dao’s embrace is vast; heaven’s covering is vast; earth’s bearing is vast; the king’s containment is vast. As the scripture says: *'Greatness means departure; departure means remoteness.'* The Dao is not remote in truth—harmonizing with the Dao brings nearness.\"\n\n**Seventy-Sixth Question: On Nearness**\nOne asked again: \"What is nearness?\"\nThe answer: \"Nearness is this: near the body of one with Dao, observe the body of one without Dao; near the household of one with Dao, observe the household of one without Dao; near the village of one with Dao, observe the village of one without Dao; near the state of one with Dao, observe the state of one without Dao; near the world of one with Dao, observe the world of one without Dao. A filial body repays the kindness of father and mother; a good household is like that of Xu Jun and Pang Shi; a virtuous village pities the poor and cherishes the aged; a clear state brings abundance to the myriad people; when the world possesses the Dao, the world ripens. As the scripture says: *'Thus observe the self through the self.'* Illuminating the Dao, one truly practices it.\"\n\n**Seventy-Seventh Question: On Practice**\nOne asked again: \"What is practice?\"\nThe answer: \"Practice is this: the highest practice is the Dao of heaven. Heaven and earth do not speak, yet silently bestow their grace, giving life to the myriad things. The highest does not speak, yet silently bestows its virtue, practicing the myriad goods. Heaven and earth do not speak, yet their grace and goodness respond. The highest does not speak, yet its teaching of goodness pervades. The myriad things fulfilled, the people prosper; the myriad transformations illuminated, truth pervades. The people prosper, and the state knows great peace; truth pervades, and joy abides in effortlessness. The people prosper, and each attends to scholar, farmer, artisan, merchant; truth pervades, and the highest’s non-action is revealed. As the scripture says: *'Practice the teaching without words.'* The Dao is not practiced anywhere; virtue does not abide anywhere.\"\n\n**Seventy-Eighth Question: On Abiding**\nOne asked again: \"What is abiding?\"\nThe answer: \"Abiding is dwelling. The true has no emotion, yet its form resides in the Dao; the false has emotion, yet its body lodges in the world. The true form interacts with the Dao; the false body interacts with things. Forgetting the true form is the Dao; the body responding to the world is virtue. The heart-mind with emotion is delusion; the body distant from the world is attachment. With the Dao and virtue, there is no delusion or attachment; without the Dao and virtue, there is delusion and attachment. Truly possessing the Dao and virtue, one is worthy and good; falsely lacking the Dao and virtue, one is foolish and evil. As the scripture says: *'At peace in one’s dwelling, content in one’s customs.'* Abiding forever in the great void, one is thus.\"\n\n**Seventy-Ninth Question: On Thusness**\nOne asked again: \"What is thusness?\"\nThe answer: \"Thusness is this: thus in the three realms, the Dao manifests without constraint; drifting through the four seas, the true conceals without companion. The Dao without constraint lies beyond yin and yang; the true without companion dwells in the azure heavens. The body of the Dao is neither empty nor form; the light of the true neither wanes nor waxes. Attaining non-being, one emerges from the shell of the myriad things; penetrating action, one reveals the brightness of the myriad wisdoms. Heaven’s great grace seems without grace; accumulating great virtue seems without virtue—this is called illuminating the Dao of heaven. As the scripture says: *'Only because it does not abide, it is not abandoned.'* Thus delighting in the Dao and responding to mechanism, one pities the multitude.\"\n\n**Eightieth Question: On the Multitude**\nOne asked again: \"What is the multitude?\"\n\nThe Master replied: \"The multitude is that which the multitude clarifies—cherishing fame, cherishing gain, cherishing right, cherishing wrong. What I obscure is the forgetting of fame, the forgetting of gain, the forgetting of right, the forgetting of wrong. The multitude cherishes fame and thus incurs disgrace; I forget fame and thus know no disgrace. The multitude cherishes gain and thus invites harm; I forget gain and thus suffer no harm. The multitude cherishes right and thus invites wrong; I forget right and thus know no wrong. The multitude cherishes wrong and thus incurs fault; I forget wrong and thus bear no fault. As the scripture says: *'The multitude is bright and clear; I alone seem obscured.'* The Record of the Perfected One of Non-Action, Purity, and Everlasting Life is here concluded.\"",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "无为清静长生真人至真语录 经名：无为清静长生真人至真语录。 金刘处玄述，弟子辑录。 一卷。 底本出处：《正统道藏》太玄部。 无为清静长生真人至真语录序 我闻道在域中，所宜驯致，仙居象外，不可苟求。 故乐天诗云：若非金骨相，不列丹台名。 非种百千劫善根，得三五一真之气，安能至此境哉。 今长生子刘先生，赋是相，藉是名。 昔遇重阳王真人，济度点化，出俗入道，明识慧性，了达疏通。 昨被宣诏见，有诗曰：昔年陕右先皇诏，今日东莱圣帝宣。 再岁告归，官僚索词，云：飘飘云水却东莱，太微仙伴星冠士。 正似陈希夷，昔承宋眷，辞返华山，诏答云：玉堂金阙，暂喜於来朝； 岫幌云軿，遽求於归隐。 此，二大士之不羁，各一明朝之擅美，盖营道同耳，易地则然。 自先生躬还故里，观住太微，笺注诸经，祖述三圣。 以文章疏放，以翰墨嬉游，着编籍演教之法，遵释氏重轻之戒，造玄皇众妙之门，服宣父五常之行，缉田宅，发梨枣，申申如也。 凡有述作，竞雕镂以流传，新视听於众庶，讽诵於人口，熏陶乎民风，知见者归依，顽鄙者俊改。 一日，先生门人徐、李二师，远来垂访。 过溪馆，入愚斋，息杖履之劳，馈水陆之味。 良久，出示先生《至真语录》一帙，恳求序引。 义不复辞，余乃洗心徧览。 令人警诚觉悟，顿欲割俗缘，出业障邪。 始终列八十款问，答瑜一万言。 包罗揆叙，引证论评，根天地之化，迹阴阳之用，示死生之说，明祸福之报，谈真空之相，惩贪瞋之欲。 以至苦乐之由，情伪之作，清浊之源，高下之本，若此者甚众，无不究竟。 皆引用黄老奥义断之，天下之事毕矣。 可使众生判疑归正，涣然冰释，为凿大昏之塘，辟灵照之户，一驱解脱矣。 於是得超苦海，登觉岸，除三有五浊之秽，证三昧一空之因，去十二类旧染之污，受三千界更生之乐。 信出自真语，启迪导化，法缘所致也，岂不伟欤。 青泰和壬戌岁上元日，濩泽端城变溪虚白道人韩士倩颜广谨序。 无为清静长生真人至真语录 经名：无为清静长生真人至真语录。 金刘处玄述，弟子辑录。 一卷。 底本出处：《正统道藏》太玄部。 无为清静长生真人至真语录 八十问 第一　问法",
      "translated_text": "**The Perfected Sayings of the Perfected One of Non-Action, Purity, and Longevity**\n\n**Scripture Title:** *The Perfected Sayings of the Perfected One of Non-Action, Purity, and Longevity*\nRecorded by Liu Chuxuan of the Jin, compiled by his disciples. One scroll.\nSource text: *Daoist Canon of the Zhengtong Era*, *Tai Xuan* Section.\n\n---\n\n**Preface to *The Perfected Sayings of the Perfected One of Non-Action, Purity, and Longevity***\n\nI have heard that the Dao abides within the world, and what is fitting may be gradually attained; the immortals dwell beyond form, and their realm cannot be sought carelessly. Thus, the poet Bai Letian wrote:\n*\"Were it not for the golden bones of destiny,\nOne’s name would not be inscribed on the cinnabar terrace.\"*\nWithout the roots of a hundred thousand kalpas of goodness, how could one obtain the primal qi of the Three, Five, and One, and reach such a state?\n\nNow, Master Liu, the Longevity Master, possesses this destiny and bears this name. Formerly, he encountered the Perfected Wang Chongyang, who delivered and transformed him, guiding him from the secular to the Dao. His wisdom and nature became luminous, his understanding thorough and penetrating. Recently summoned by imperial decree, he composed a poem:\n*\"In years past, the former emperor’s decree came from Shaanxi;\nToday, the sagely emperor’s summons arrives from Donglai.\"*\nAfter two years, he requested to return home. The officials sought his verses, to which he replied:\n*\"Drifting like clouds and water, I turn back to Donglai,\nA star-crowned immortal among companions in the Great Tenuity.\"*\nThis resembles Chen Tuan of old, who, favored by the Song court, retired to Mount Hua. The imperial response read:\n*\"The Jade Hall and Golden Gates rejoice briefly in your audience;\nThe cloud-draped cliffs and misty carriage hasten your return to reclusion.\"*\nThese two great adepts, unbound by convention, each brought glory to their dynasties—yet their pursuit of the Dao was the same, differing only in circumstance.\n\nSince Master Liu returned to his homeland and dwelled in the Great Tenuity, he has annotated the scriptures, tracing the teachings of the Three Sages. With literary grace and calligraphic playfulness, he composed works to propagate the Dharma, heeding the Buddhist admonition against attachment to the trivial. He entered the Gate of Myriad Wonders of the Mysterious Sovereign, embodied the Five Constants of Confucius, cultivated fields and estates, and published his writings on pearwood and jujube. Ever composed, he ensured all his works were carved and disseminated, renewing the perceptions of the common folk, recited by all, and refining the customs of the people. Those with understanding turned to him in devotion; the stubborn and coarse were transformed into the refined.\n\nOne day, the Master’s disciples, Xu and Li, traveled from afar to visit. Crossing the creek lodge and entering the humble studio, they rested from their journey, partaking of vegetarian and aquatic delicacies. After some time, they presented a volume of the Master’s *Perfected Sayings*, earnestly requesting a preface. Unable to refuse in good conscience, I cleansed my mind and perused it thoroughly. The text awakens and warns, inspiring one to sever worldly ties and transcend karmic obstructions.\n\nFrom beginning to end, it comprises eighty questions, answered in ten thousand words of jade-like discourse. It encompasses principles and narratives, citations and critiques, tracing the transformations of Heaven and Earth, the functions of yin and yang, elucidating the doctrines of life and death, clarifying the retributions of fortune and misfortune, expounding the forms of true emptiness, and restraining the desires of greed and anger. It addresses the origins of suffering and joy, the manifestations of sincerity and deceit, the sources of purity and turbidity, and the foundations of the exalted and the base—such topics are myriad, yet none are left unexplored. All are adjudicated by the profound principles of the Yellow Emperor and Laozi, encompassing the affairs of the world.\n\nIt enables sentient beings to resolve doubts and return to correctness, melting away delusions like ice. It serves as a dike to dispel great ignorance, opening the door to spiritual illumination, and in one stroke, liberates all. Thus, one may transcend the sea of suffering, ascend the shore of awakening, cast off the filth of the Three Realms and Five Turbidities, realize the cause of samādhi and singular emptiness, shed the defilements of the twelve kinds of beings, and receive the joy of rebirth across the three thousand worlds. Truly, these are the words of the Perfected, guiding and transforming through the Dharma’s karmic connections—how magnificent!\n\nOn the Shangyuan Festival of the *renxu* year of the Taihe era, respectfully inscribed by Han Shiqian, the Empty Stream Daoist of Bianxi in Huoze, Duanzhou.\nYan Guang.\n\n---\n\n**The Perfected Sayings of the Perfected One of Non-Action, Purity, and Longevity**\n\n**Scripture Title:** *The Perfected Sayings of the Perfected One of Non-Action, Purity, and Longevity*\nRecorded by Liu Chuxuan of the Jin, compiled by his disciples. One scroll.\nSource text: *Daoist Canon of the Zhengtong Era*, *Tai Xuan* Section.\n\n**The Perfected Sayings of the Perfected One of Non-Action, Purity, and Longevity**\nEighty Questions\n\n**First Question: On the Dharma**",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 853,
      "start_sentence": 0,
      "end_sentence": 39,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.7132248878479,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\无为清静长生真人至真语录.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "来人询：其法者何也？ 长生子答曰：通其道而达真空，则谓之法。 通其释而达无生，则谓之戒。 授於法者，不能尽其万愆也，不能通其万理也。 授於戒者，不能尽其万善也，不能通其万慧也。 道法通，则达自然清诤无为也。 释戒通，则尽我人众生寿者也。 经云：道法自然。 道法非空而空也。 第二　问空 复询：空者何也？ 答曰：道住非空也。 愚者守其顽空也，贤者守其真空也。 世之思其色空也，道者忘其世空也。 人之爱其皆空也，思之罪者非空也。 达者明其道空也，通者了其性空也。 浊者死则沉空也，清者生则升空也。 经云：出生入死，生之徒十有三，死之徒十有三。 悟其空则知也。 第三　问知 复询：知者何也？ 答曰：知者，知其人恩惠可见，心望其报也； 知其天之道，则损有余而惠窘也； 知其人之道，则损不足而奉富也。 知其有道者，顺天也； 知其无道者，顺人也。 顺其天则人之生也，顺其人则人之死也。 顺天则全其清善也，顺人则纵其浊恶也。 经云：观天之道，执天之行，尽矣。 知其慧之光，异於常人所见也。 第四　问见 复询：见者何也？ 答曰：见者，非肉眼所见也。 见者，见其虚元也，见其慧光也，见其亘容也，见其恍惚也，见其宝珠也，见其霞彩也，见其玄微也，见其冲明也，见其魂清也，见其魄静也。 经云：道之为物，唯恍唯惚。 见其无物之象，外应其常善也。 第五　问善 复询：善者何也？ 答曰：善者，方圆曲直应物而顺於人也。 不生万恶，则谓之真善也。 不着万物，则谓之清善也。 达理则不读万经，则谓之通善也。 达妙则不穷万化，则谓之明善也。 不害万形，则谓之慈善也。 不厌万浊，则谓之应善也。 不非万人，则谓之德善也。 不求万有，则谓之道善也。 不起万私，则谓之公善也。 不忘万慧，则谓之常善也。 经云：善者吾善之，不善者吾亦善之，德善。 至善者非恶也。 第六　问恶 复询：恶者何也？ 答曰：恶者，人之不肖也。 人不顺其天，则天不顺於人也。 人若抛撒，则天教饥歉也。 人不修其善福，则天不教丰熟也。 人心纵於恶毒，则天意降其风雹也。 人至死不戒於恶杀，则再世定生於修罗也。 人造恶，则天恶报也。 人无恶所害於物，则物无恶所伤於人也。 经云：毒虫不螫，猛兽不据，搜乌不搏。 弗恶真通，则明其贤也。 第七　问贤 复询：贤者何也？ 答曰：贤者，大达之人也。 大智者，如无其通也。 大慧者，如无其知也。 大聪者，如无其明也。 大辩者，如无其说也。 应其智，则真有其万通也。 应其慧，则真有其万解也。 应其聪，则真有其万明也。 应其辩，则真有其万说也。 智通者，世通也。 慧通者，道通也。 聪通者，理明也。 辩通者，言清也。 经云：不尚贤，使民不争。 世之贤隐者，石藏其玉也。 道之贤隐者，无物之真也。 贤者，非其愚也。 第八　问死 复询：愚者何也？ 答曰：愚者，古之达人要远其世之梦幻，外貌若愚也。 儒者颜回清贫，而一箪一瓢。 释者释迦乞食，而一饭七家。 道者纯阳无为，而鹑居毂食。 返其朴，则高者就於下也，有者就於无也。 明者似於暗也，古闷者若其讷也。 经云：我独若遗，我愚人之心也哉。 外愚则内抱其道，真生也。 第九　问生 复询：生者何也？",
      "translated_text": "**First Question: On the Dharma**\nOne asked: \"What is the Dharma?\"\nThe Master of Longevity answered: \"To penetrate the Dao and attain true emptiness—this is called the Dharma. To penetrate the teachings of Śākya and attain non-arising—this is called the precepts. Those who receive the Dharma cannot exhaust their myriad transgressions, nor can they penetrate the myriad principles. Those who receive the precepts cannot fulfill their myriad virtues, nor can they penetrate the myriad wisdoms. When the Dao and Dharma are penetrated, one attains the natural, pure, and unadulterated state of non-action. When the teachings of Śākya and precepts are penetrated, one encompasses the self, others, sentient beings, and the long-lived. As the scripture says: 'The Dharma of the Dao is natural.' The Dharma of the Dao is not empty, yet it is empty.\"\n\n**Second Question: On Emptiness**\nOne asked again: \"What is emptiness?\"\nThe answer: \"The Dao abides—not in emptiness. The foolish cling to rigid emptiness; the worthy cling to true emptiness. The worldly contemplate the emptiness of form; the Daoist forgets the emptiness of the world. People cherish the emptiness of all things, yet the transgressions they contemplate are not empty. The enlightened understand the emptiness of the Dao; the penetrating comprehend the emptiness of nature. The turbid, in death, sink into emptiness; the pure, in life, ascend into emptiness. As the scripture says: 'Emerging into life, entering into death—those who live are thirteen, those who die are thirteen.' To awaken to emptiness is to know.\"\n\n**Third Question: On Knowledge**\nOne asked again: \"What is knowledge?\"\nThe answer: \"Knowledge is this: to know human kindness and favor, expecting repayment in the heart; to know the Dao of Heaven, then to diminish excess and aid the destitute; to know the Dao of humanity, then to diminish insufficiency and serve the wealthy. To know the existence of the Dao is to follow Heaven; to know the absence of the Dao is to follow humanity. Following Heaven, one lives; following humanity, one dies. Following Heaven preserves one’s purity and goodness; following humanity indulges one’s turbidity and evil. As the scripture says: 'Observe the Dao of Heaven, grasp the conduct of Heaven—this is perfection.' To know the radiance of wisdom is to see beyond what ordinary people perceive.\"\n\n**Fourth Question: On Perception**\nOne asked again: \"What is perception?\"\nThe answer: \"Perception is not what the fleshly eye sees. Perception is this: to perceive the primordial void, to perceive the radiance of wisdom, to perceive the boundless countenance, to perceive the indistinct and subtle, to perceive the precious pearl, to perceive the rosy clouds, to perceive the profound and subtle, to perceive the serene and luminous, to perceive the purity of the hun-soul, to perceive the stillness of the po-soul. As the scripture says: 'The Dao as a thing is only indistinct and subtle.' To perceive the form of no-thing is to respond externally with constant goodness.\"\n\n**Fifth Question: On Goodness**\nOne asked again: \"What is goodness?\"\nThe answer: \"Goodness is to respond to things with square or round, crooked or straight, and comply with others. To not generate myriad evils—this is called true goodness. To not cling to the myriad things—this is called pure goodness. To penetrate principles without reciting the myriad scriptures—this is called penetrating goodness. To penetrate the wondrous without exhausting the myriad transformations—this is called luminous goodness. To not harm the myriad forms—this is called compassionate goodness. To not reject the myriad turbidities—this is called responsive goodness. To not oppose the myriad people—this is called virtuous goodness. To not seek the myriad existences—this is called Daoist goodness. To not arise in myriad selfishnesses—this is called impartial goodness. To not forget the myriad wisdoms—this is called constant goodness. As the scripture says: 'Good, I treat as good; not good, I also treat as good—this is virtuous goodness.' The highest goodness is not evil.\"\n\n**Sixth Question: On Evil**\nOne asked again: \"What is evil?\"\nThe answer: \"Evil is the unworthiness of humanity. If people do not follow Heaven, then Heaven does not follow them. If people squander and scatter, then Heaven sends famine and scarcity. If people do not cultivate good fortune, then Heaven does not grant abundance. If the human heart indulges in malice and poison, then Heaven’s will descends with wind and hail. If one does not cease evil killing until death, then in the next life, one is surely born among the asuras. If people create evil, then Heaven repays with evil. If people do not harm things with evil, then things do not injure people with evil. As the scripture says: 'Poisonous insects do not sting, fierce beasts do not seize, birds of prey do not strike.' To not reject evil is true penetration—this clarifies one’s worthiness.\"\n\n**Seventh Question: On Worthiness**\nOne asked again: \"What is worthiness?\"\nThe answer: \"The worthy are those of great penetration. The greatly wise seem as if they lack penetration; the greatly wise seem as if they lack knowledge; the greatly perceptive seem as if they lack clarity; the greatly eloquent seem as if they lack speech. Responding with wisdom, they truly possess the myriad penetrations; responding with wisdom, they truly possess the myriad understandings; responding with perception, they truly possess the myriad clarities; responding with eloquence, they truly possess the myriad discourses. Wisdom that penetrates is worldly penetration; wisdom that penetrates is Daoist penetration; perception that penetrates is the clarity of principles; eloquence that penetrates is the purity of speech. As the scripture says: 'Do not esteem the worthy, lest the people contend.' The worthy of the world conceal themselves like jade hidden in stone; the worthy of the Dao conceal themselves as the reality of no-thing. The worthy are not the foolish.\"\n\n**Eighth Question: On Foolishness**\nOne asked again: \"What is foolishness?\"\nThe answer: \"The foolish are the ancient ones of great penetration who distanced themselves from the world’s illusions, their outward appearance like that of fools. The Confucian Yan Hui lived in poverty with a single bamboo bowl and gourd ladle; the Śākya Śākyamuni begged for food, receiving a meal from seven households; the Daoist Pure Yang practiced non-action, dwelling in a humble abode and eating coarse fare. Returning to simplicity, the high descend to the low, the existent to the non-existent. The bright seem dim; the anciently silent seem inarticulate. As the scripture says: 'I alone seem forgotten—is this the heart of a foolish person?' Outwardly foolish, inwardly they embrace the Dao—this is true life.\"\n\n**Ninth Question: On Life**\nOne asked again: \"What is life?\"",
      "overlap_context": "ze, Duanzhou.\nYan Guang.\n\n---\n\n**The Perfected Sayings of the Perfected One of Non-Action, Purity, and Longevity**\n\n**Scripture Title:** *The Perfected Sayings of the Perfected One of Non-Action, Purity, and Longevity*\nRecorded by Liu Chuxuan of the Jin, compiled by his disciples. One scroll.\nSource text: *Daoist Canon of the Zhengtong Era*, *Tai Xuan* Section.\n\n**The Perfected Sayings of the Perfected One of Non-Action, Purity, and Longevity**\nEighty Questions\n\n**First Question: On the Dharma**",
      "start_char": 853,
      "end_char": 2109,
      "start_sentence": 40,
      "end_sentence": 133,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.978712558746338,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\无为清静长生真人至真语录.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "答曰：生者，抱道则真生也，保命则福生也，养气则神生也，通微则妙生也，无妄则慧生也，应物则德生也，常善则救生也，夏至则楼生也； 冬至则阳生也，交通则物生也。 真生则闲也，福生则明也，神生则灵也，妙生则清也，慧生则通也，德生则夷也，救生则慈也，阴生则升也，阳生则降也，物生则成也。 经云：道生一，一生二，二生三，三生万物。 天地生万物，以和气而成，则生也； 以金气而杀，则死也。 第十　问死 复询：死者何也？ 答曰：死者，物之形也。 万物至其深秋则形死，其根不死也。 万形至其百年则身死，其性不死也。 无情万物，可以深其根也。 有情万形，可以养其性也。 根无其水，则苗死也。 性无其命，则身死也。 根者，性也。 性者，根也。 神者，性也。 性者，神也。 五行之数尽，则其形衰死。 阴阳之外，则其神无死也。 经云：深根固蒂，长生久视之道。 死而无其死者，真常贵也。 第十一　问贵 复询：贵者何也？ 答曰：贵者，贵其德也。 天施恩不令下知，谓之贵德也。 天施恩不择爱者与，谓之贵德也。 天施恩生成不为主，谓之贵德也。 天施恩济人不望报，谓之贵德也。 人要同天意，惠窘唯自知。 人要同天意，惠心公若私。 人要同天意，惠财如弃泥。 人要同天意，惠食不记谁。 经云：万物莫不尊道而贵德。 贵者之德，有余惠於贱也。 第十二　问贱 复询：贱者何也？ 答曰：贱者，薄其外也。 真贵其德，则外贱於身也。 德如美玉，则身似顽石也。 德上通其天，身下谦於海。 其言然下，则其身处上也。 内贱其真，则外贵其伪也。 贵德则世之重，贱身则安然存。 见宝则成大器，朴散则现真形。 通天则明夷妙，通海则众善归。 言下则敬信赞，身上则物我增。 贱真则魂魄散，贵伪则味其真。 经云：故贵必以贱为本，高必以下为基。 就於贱下，则举其高也。 第十三　问高 复询：高者何也？ 答曰：天之道，则抑其高也。 人之道，则举其高也。 大达之士，则隐其高也。 荣耀之人，则街其高也。 天之道抑高，则惠於窘也。 人之道举高，则损於窘也。 大达者隐高，则化其贤也。 荣耀者街高，则惑其愚也。 经云：高者抑之，下者举之。 天之所高，覆於下也。 第十四　问下 复询：下者何也？ 答曰：下者，海下则清通归顺也，心下则清善归顺也。 清顺则深广也，善顺则德广也。 喻如所立屋者，梁栋就其下，则椽擦归之。 喻如所待宾者，主人就其下，则外客归之。 椽檩归之，则成功也。 外客归之，则成德也。 经云：江海所以能为百谷王者，以其善下之。 处下清顺，则极乐也。 第十五　问乐 复询：乐者何也？ 答曰：乐者，乐道则处清下为乐也，乐俗则恋歌酒以为乐也。 乐清下，由无喜无忧也。 乐歌酒，则有欢有愁也。 乐无为之道，则无修无证也。 乐有为之相，则有修有堕也。 乐真性，则无形无尽也。 乐伪身，则有生有死也。 经云：是以天下乐推而不厌。 乐道则无其争也。 失其道之乐，则忧生於苦也。 第十六　问苦 复询：苦者何也？ 答曰：苦者，苦於身心也。 世之迷者，苦己贪生，则入於死路也； 苦心用机，则性沉於罪地也。 道之悟者，苦己炼形，则如碎石取玉也； 苦志忘机，则性升於九霄也。",
      "translated_text": "The answer: \"Life is embracing the Dao to achieve true life, preserving destiny to attain blessed life, nurturing qi to attain spiritual life, penetrating the subtle to attain wondrous life, being without delusion to attain wise life, responding to things to attain virtuous life, constantly practicing goodness to attain salvific life. At the summer solstice, the yang energy ascends; at the winter solstice, the yang energy revives; through interaction, the myriad things come to life.\n\nTrue life is at ease; blessed life is luminous; spiritual life is numinous; wondrous life is pure; wise life is penetrating; virtuous life is level; salvific life is compassionate. Yin life ascends; yang life descends; the life of things achieves completion. As the scripture says: 'The Dao gives birth to the One, the One gives birth to the Two, the Two give birth to the Three, and the Three give birth to the myriad things.' Heaven and Earth give life to the myriad things through harmonious qi, thus they live; through metallic qi, they perish—thus they die.\n\n**Tenth Question: On Death**\nOne asked again: \"What is death?\"\nThe answer: \"Death is the form of things. When the myriad things reach deep autumn, their forms die, but their roots do not. When the myriad forms reach a hundred years, their bodies die, but their natures do not. For the insentient myriad things, one may deepen their roots. For the sentient myriad forms, one may nurture their natures. If the root lacks water, the sprout dies. If the nature lacks destiny, the body dies. The root is the nature; the nature is the root. The spirit is the nature; the nature is the spirit. When the numbers of the Five Phases are exhausted, the form declines and dies. Beyond yin and yang, the spirit does not perish. As the scripture says: 'Deep roots and a firm stem are the Way of long life and enduring vision.' Death without true death is the precious constancy.\n\n**Eleventh Question: On Nobility**\nOne asked again: \"What is nobility?\"\nThe answer: \"Nobility is the nobility of virtue. Heaven bestows grace without letting those below know—this is the nobility of virtue. Heaven bestows grace without choosing whom to love—this is the nobility of virtue. Heaven bestows grace in creation without being the master—this is the nobility of virtue. Heaven bestows grace to aid others without expecting repayment—this is the nobility of virtue. One must align with Heaven’s intent: bestowing relief, only the self knows. One must align with Heaven’s intent: bestowing kindness, whether public or private. One must align with Heaven’s intent: bestowing wealth as if discarding mud. One must align with Heaven’s intent: bestowing food without remembering who. As the scripture says: 'The myriad things all revere the Dao and prize virtue.' The virtue of the noble overflows in kindness to the lowly.\n\n**Twelfth Question: On Lowliness**\nOne asked again: \"What is lowliness?\"\nThe answer: \"Lowliness is the thinness of the external. Truly prizing virtue makes the body externally lowly. If virtue is like fine jade, the body seems like crude stone. If virtue ascends to communicate with Heaven, the body humbly descends to the sea. If one’s words are thus humble, one’s body dwells above. If one internally debases the true, one externally prizes the false. Prizing virtue makes one esteemed in the world; debasing the body ensures tranquil existence. Seeing treasure, one becomes a great vessel; when the uncarved block scatters, the true form appears. Communing with Heaven reveals profound subtlety; communing with the sea gathers all goodness. Humble words earn respect and praise; an elevated body increases self and others. Debasing the true scatters the hun and po; prizing the false obscures the true. As the scripture says: 'Thus nobility must take lowliness as its root, and height must take lowness as its foundation.' By abiding in lowliness, one attains loftiness.\n\n**Thirteenth Question: On Height**\nOne asked again: \"What is height?\"\nThe answer: \"The Way of Heaven represses height. The way of humans elevates height. The greatly enlightened conceal their height. The honored and glorious parade their height. The Way of Heaven represses height to bestow grace upon the needy. The way of humans elevates height to harm the needy. The greatly enlightened conceal their height to transform the worthy. The honored and glorious parade their height to delude the foolish. As the scripture says: 'The high are repressed; the low are elevated.' What Heaven deems high covers what is below.\n\n**Fourteenth Question: On Lowness**\nOne asked again: \"What is lowness?\"\nThe answer: \"Lowness is the sea’s descent, where clarity and compliance gather; the heart’s descent, where purity and goodness gather. Clarity and compliance make depth and breadth; goodness and compliance make virtue broad. It is like erecting a house: when the ridgepoles and beams descend, the rafters and purlins gather to them. It is like receiving guests: when the host descends, the visitors gather. When rafters and purlins gather, success is achieved. When visitors gather, virtue is accomplished. As the scripture says: 'The rivers and seas can be kings of all valleys because they excel in lowness.' Abiding in lowness with clarity and compliance brings ultimate joy.\n\n**Fifteenth Question: On Joy**\nOne asked again: \"What is joy?\"\nThe answer: \"Joy is finding joy in the Dao by dwelling in pure lowness, or delighting in customs by clinging to song and wine. Joy in pure lowness arises from having no happiness or sorrow. Joy in song and wine brings both mirth and melancholy. Joy in the Dao of non-action entails no cultivation or attainment. Joy in the appearances of action entails cultivation and downfall. Joy in the true nature has no form or end. Joy in the false body has birth and death. As the scripture says: 'Thus the world delights in pushing forward without tiring.' Joy in the Dao brings no contention. Losing the joy of the Dao brings sorrow born of suffering.\n\n**Sixteenth Question: On Suffering**\nOne asked again: \"What is suffering?\"\nThe answer: \"Suffering is the affliction of body and mind. The deluded of the world suffer in their greed for life, thus entering the path of death. Those who suffer in scheming with the mind sink their natures into the realm of sin. The awakened to the Dao suffer in refining their forms, like crushing stone to retrieve jade. Those who suffer in forgetting schemes elevate their natures to the nine heavens.\"",
      "overlap_context": "receiving a meal from seven households; the Daoist Pure Yang practiced non-action, dwelling in a humble abode and eating coarse fare. Returning to simplicity, the high descend to the low, the existent to the non-existent. The bright seem dim; the anciently silent seem inarticulate. As the scripture says: 'I alone seem forgotten—is this the heart of a foolish person?' Outwardly foolish, inwardly they embrace the Dao—this is true life.\"\n\n**Ninth Question: On Life**\nOne asked again: \"What is life?\"",
      "start_char": 2109,
      "end_char": 3351,
      "start_sentence": 134,
      "end_sentence": 225,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.97338318824768,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\无为清静长生真人至真语录.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "贤者苦中乐也，愚者乐中苦也。 贤者苦尽而甘来，愚者则乐极而哀也。 经云：恩生於害，害生於恩。 乐道而苦尽，则通其清也。 第十七　问清 复询：清者何也？ 答曰：清者，天清则显其万象也。 心清则显其亘灵也，渊清则明其二八也。 通其天象，则降气冲和也。 通其亘灵，则与道同体也。 通其渊清，则灵泉无漏也。 得其冲和，则气神相结也。 得其同体，则真形不朽也。 得其无漏，则皓月光圆也。 经云：渊兮似万物之宗。 探通其清，则无於浊也。 第十八　问浊 复询：浊者何也？ 答曰：浊者，世之迷者，纵於意则恶浊也，纵於身则淫浊也，纵於恶则昏其性也，纵於淫则丧其命也。 道之悟者，天清而混於地浊，身清而混於世浊。 清混浊则阴变阳，清混世则外若愚也。 经云：孰能浊以澄，净之徐清。 浊尽则光显也。 第十九　问显 复询：显者何也？ 答曰：显者，天之象非自见其明也，天下众目见其明也。 道之理非自是显彰也，天下众善知其达也。 众目见其明，则敬也。 众善知其达，则信也。 世之敬其天地，则福生也。 道之信其无为，则真生也。 经云：不自见故明，不自是故彰。 内光显则外身而隐也。 第二十　问隐 复询：隐者何也？ 答曰：隐者，内慈救生，外恐其人知也； 内真明达，外貌若愚夫也； 内无挂碍，外形似混尘也； 内光应物，外无所施为也； 内性阐德，外远於人钦也； 内灵抱道，外无所着迷也。 至明泯虑，身寄於尘寰也。 经云：道隐无名者，名其大也。 第二十一　问大 复询：大者何也？ 答曰：大者，道也。 阴阳而不能包，谓之道大也。 大者，性也。 万邪而正能容，则谓之性大也。 道之大者，乃万物之母也。 性之大者，乃万邪之师也。 通其母，则万物得其造化也。 通其师，则万邪归其正达也。 造化，则各成其形也。 正达，则各通其道也。 经云：道可道，非常道。 大者容其小也。 第二十二　问小 复询：小者何也？ 答曰：小者，通其微也。 道通其小，则不择其爱者与恩也。 性通其小，则不择其爱者与教也。 不择其爱者与恩，则小物皆受其道之气也。 不择其爱者与教，则小物皆受其天之光也。 无情之小物，得其道之气，则形生也。 有情之小物，得其天之光，则性生也。 经云：治大国若烹小鲜。 不拣其爱者要，不择其弱者弃也。 小者之妙非虚也。 第二十三　问虚 复询：虚者何也？ 答曰：虚者，道之体也。 阴阳明其虚，则万物生也。 至性明其虚，则恍惚生也。 万物生成，则济於世也。 恍惚生成，则出於世也。 物济於人，则世之乐也。 道通其真，则性之乐也。 世乐，则阴阳之有其数也。 性乐，则虚极之无其穷也。 经云：致虚极，守静笃，万物并作。 虚者道之实也。 第二十四　问实 复询：实者何也？ 答曰：实者，道也。 道生在於天地之先，至今常存不朽者，谓之实也。 实者，性也。 性生在於万物之外，至今常存不朽者，谓之实也。 道明其实，则掌握阴阳，生於万物也。 性明其实，则大达枢要，通於万化也。 万物生，则显其道之实也。 万化生，则显其性之实也。 道虚而气实也，性虚而命实也。 经云：虚其心，实其复。 明其实，则道性真闲也。 第二十五　问闲 复询：闲者何也？ 答曰：闲者，道也。",
      "translated_text": "The virtuous find joy within suffering, while the foolish find suffering within joy. The virtuous endure suffering until sweetness arrives, whereas the foolish reach the extremity of joy only to meet sorrow. As the scripture says: \"Favor arises from harm, and harm arises from favor.\" When one delights in the Dao and suffering is exhausted, one attains its purity.\n\n**Seventeenth Question: On Purity**\nOne asked again: \"What is purity?\"\nThe answer: \"Purity is when heaven is clear, revealing all phenomena; when the mind is clear, revealing its boundless spirit; when the abyss is clear, illuminating its dual essence. Penetrating celestial phenomena brings descending qi and harmonious balance. Penetrating boundless spirit unites one with the Dao in body. Penetrating the clarity of the abyss brings a spirit-spring without leakage. Attaining harmonious balance, qi and spirit intertwine. Attaining unity in body, the true form becomes imperishable. Attaining no leakage, the bright moon shines in fullness. As the scripture says: 'Profound, it seems the ancestor of the myriad things.' Exploring and penetrating purity leaves no room for turbidity.\"\n\n**Eighteenth Question: On Turbidity**\nOne asked again: \"What is turbidity?\"\nThe answer: \"Turbidity is when the deluded of the world indulge their intentions, becoming morally turbid; indulge their bodies, becoming licentiously turbid; indulge in evil, clouding their nature; indulge in licentiousness, forfeiting their lives. The awakened to the Dao remain celestial in clarity yet blend with earthly turbidity, bodily pure yet blend with worldly turbidity. Clarity blending with turbidity transforms yin into yang; clarity blending with the world appears outwardly foolish. As the scripture says: 'Who can make the turbid clear by settling it gently?' When turbidity is exhausted, radiance manifests.\"\n\n**Nineteenth Question: On Manifestation**\nOne asked again: \"What is manifestation?\"\nThe answer: \"Manifestation is when celestial phenomena do not display their brightness themselves—all eyes under heaven see their brightness. The principles of the Dao do not self-proclaim their clarity—all virtues under heaven recognize their attainment. When all eyes see its brightness, reverence arises. When all virtues recognize its attainment, trust is born. The world’s reverence for heaven and earth generates fortune. The Dao’s trust in non-action generates truth. As the scripture says: 'Not displaying oneself, thus one is bright; not asserting oneself, thus one is distinguished.' Inner radiance manifests while the outer self remains concealed.\"\n\n**Twentieth Question: On Concealment**\nOne asked again: \"What is concealment?\"\nThe answer: \"Concealment is inwardly practicing compassion to save lives while outwardly fearing others’ awareness; inwardly possessing true clarity yet outwardly appearing as a fool; inwardly free from entanglements yet outwardly seeming to blend with the dust; inwardly radiant in responding to things yet outwardly refraining from action; inwardly expanding virtue yet outwardly distant from others’ admiration; inwardly embracing the Dao yet outwardly free from delusion. Supreme clarity dissolves thoughts, and the body dwells in the mortal world. As the scripture says: 'The Dao is concealed and nameless—this is called its greatness.'\"\n\n**Twenty-First Question: On Greatness**\nOne asked again: \"What is greatness?\"\nThe answer: \"Greatness is the Dao. It cannot be encompassed by yin and yang—this is called the greatness of the Dao. Greatness is nature. It embraces all deviations with correctness—this is called the greatness of nature. The greatness of the Dao is the mother of the myriad things. The greatness of nature is the teacher of all deviations. Penetrating its mother, the myriad things receive their creation. Penetrating its teacher, all deviations return to correctness. Through creation, each attains its form. Through correctness, each penetrates the Dao. As the scripture says: 'The Dao that can be spoken is not the eternal Dao.' Greatness accommodates the small.\"\n\n**Twenty-Second Question: On Smallness**\nOne asked again: \"What is smallness?\"\nThe answer: \"Smallness is penetrating the subtle. When the Dao penetrates the small, it does not discriminate in its love or favor. When nature penetrates the small, it does not discriminate in its love or teaching. Without discriminating in love or favor, even the smallest beings receive the Dao’s qi. Without discriminating in love or teaching, even the smallest beings receive heaven’s light. Insentient small beings, receiving the Dao’s qi, gain form. Sentient small beings, receiving heaven’s light, gain nature. As the scripture says: 'Governing a great state is like cooking a small fish.' It does not favor the beloved nor abandon the weak. The subtlety of the small is not empty.\"\n\n**Twenty-Third Question: On Emptiness**\nOne asked again: \"What is emptiness?\"\nThe answer: \"Emptiness is the essence of the Dao. When yin and yang clarify its emptiness, the myriad things are born. When supreme nature clarifies its emptiness, the indistinct arises. The birth of the myriad things benefits the world. The arising of the indistinct transcends the world. Things benefiting people bring worldly joy. The Dao penetrating truth brings joy to nature. Worldly joy follows the numerology of yin and yang. Joy in nature reaches the extremity of emptiness without end. As the scripture says: 'Attain the extremity of emptiness, guard the sincerity of stillness—all things arise together.' Emptiness is the reality of the Dao.\"\n\n**Twenty-Fourth Question: On Reality**\nOne asked again: \"What is reality?\"\nThe answer: \"Reality is the Dao. The Dao’s birth precedes heaven and earth, enduring to this day without perishing—this is called reality. Reality is nature. Nature’s birth lies beyond the myriad things, enduring to this day without perishing—this is called reality. When the Dao clarifies its reality, it grasps yin and yang, giving birth to the myriad things. When nature clarifies its reality, it masterfully penetrates the pivot of transformation. The birth of the myriad things reveals the reality of the Dao. The transformation of the myriad things reveals the reality of nature. The Dao is empty yet its qi is real; nature is empty yet its life is real. As the scripture says: 'Empty the heart, fill the belly.' Clarifying its reality, the Dao and nature attain true tranquility.\"\n\n**Twenty-Fifth Question: On Tranquility**\nOne asked again: \"What is tranquility?\"\nThe answer: \"Tranquility is the Dao.\"",
      "overlap_context": "of suffering.\n\n**Sixteenth Question: On Suffering**\nOne asked again: \"What is suffering?\"\nThe answer: \"Suffering is the affliction of body and mind. The deluded of the world suffer in their greed for life, thus entering the path of death. Those who suffer in scheming with the mind sink their natures into the realm of sin. The awakened to the Dao suffer in refining their forms, like crushing stone to retrieve jade. Those who suffer in forgetting schemes elevate their natures to the nine heavens.\"",
      "start_char": 3351,
      "end_char": 4605,
      "start_sentence": 226,
      "end_sentence": 323,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.09717059135437,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\无为清静长生真人至真语录.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "至道闲，则闲运阴阳，而生於物也。 至性闲，则闲烹铅汞，而炼其形也。 阴阳变，则全其物也。 铅汞成，则全其性也。 全其物，则人之富也。 全其性，则神之灵也。 人富则欲其华也，神灵则抱其道也。 欲华则有荣有枯也，抱道则无形无尽也。 经云：视之不足见，听之不足闻。 性乐真闲，则应其忙也。 第二十六　问忙 复询：忙者何也？ 答曰：忙者，道乃闲也，二气而常忙也； 性乃闲也，四假而常忙也。 二气忙，则四时而分为上下也。 四假忙，则昼夜而贪争往来也。 二气忙，则春变温，夏变暑，秋变凉，冬变寒也。 四假忙，则贪於财，恋於色，迷於酒，竞於气也。 二气忙则造化万物，乃阴阳顺其天地之德也。 四假忙则造於万业，乃众生违其天地之德也。 经云：音声之相和，前后之相随。 形忙悟者，真无去也。 第二十七　问去 复询：去者何也？ 答曰：去者，道乃常存而无其尽也，道象无所去也。 去者，物乃成形而有其尽也，气有所去也。 道者，通其阴阳也。 气者，通其万物也。 数尽则阴阳而散去也，形终则万物而朽去也。 阴阳散而道常在也，万物朽而性常存也。 经云：自古及今，其名不去。 物尽而气去也，阳和而气来也。 第二十八　问来 复询：来者何也？ 答曰：来者，非其形而动也。 天地待其时而交通，则二气来也。 万形待其时而受气，则阴阳来也。 道乃天地之位也，形乃阴阳之位也。 天地在其道，久位也。 阴阳在其物，寄位也。 久位而四时变通也，寄位而三才聚会也。 变通，则成造化也。 聚会，则成真形也。 枯则物死也，柔则形生也。 经云：人之生也柔弱，其死也坚强。 柔来则通其天之清平也。 第二十九　问平 复询：平者何也？ 答曰：平者，道也。 道养其万物，则不择其爱者与恩，布气而平也。 平者，真也。 真通其万化，财不择其爱者与妙，布德而平也。 气平，则物齐生也。 德平，则人齐善也。 物齐生，则皆全其造化也。 人齐善，则皆全其道德也。 经云：天地相合，以降甘露，人莫之令而自均妙。 明其常也。 第三十　问常 复询：常者何也？ 答曰：常者，道也。 常顺其道，则救於人灵也。 常顺其气，则救於物形也。 人常顺其道，则如鱼在水也。 物常顺其气，则如灯添油也。 鱼离其水，则死也。 灯尽其油，则灭也。 常顺其道，则人生也。 常顺其气，则物生也。 人者，神也。 物者，形也。 形神俱妙，则与道合其真也。 经云：常善救人，故无弃人。 乐其道之常，则真喜也。 第三十一　问喜 复询：喜者何也？ 答曰：喜者，道乐也。 清而无浊，则道乐也。 喜而无忧，则道乐也。 喜者，德乐也。 劝恶从其善，则德乐也。 见条而酬其恩，则德乐也。 喜者，失乐也。 远善而喜於恶，则失乐也。 忘恩而报於条，则失乐也。 乐其道，则全其功也。 乐其德，则全其行也。 乐於失，则输回堕也。 经云：道者同於道，德者同於德，失者同於失。 乐喜则忘於忧也。 第三十二　问忧 复询：忧者何也？ 答曰：有忧者，不达其道之正理也。 多事则多忧也。 无忧者，真通其道之真慧也。 无事则无忧也。 多事有於忧，则神昏气浊也。 无事无於忧，则神清气爽也。 气浊则有思淫恶也，丧其魂魄也。 气清则无虑清善，聚其铅汞也。",
      "translated_text": "The Supreme Dao in tranquility tranquilly moves yin and yang, giving birth to the myriad things. The Supreme Nature in tranquility tranquilly refines lead and mercury, tempering its form. When yin and yang transform, they preserve the myriad things. When lead and mercury congeal, they preserve its nature. Preserving the myriad things is humanity’s abundance. Preserving its nature is the spirit’s numinosity. Human abundance desires its splendor; the spirit’s numinosity embraces the Dao. Desiring splendor brings flourishing and withering; embracing the Dao brings formlessness and endlessness. As the scripture says: *\"Seen, it is not enough to be seen; heard, it is not enough to be heard.\"* When nature delights in true tranquility, it responds to busyness.\n\n**Twenty-Sixth Question: On Busyness**\nOne asked again: \"What is busyness?\"\nThe answer: \"Busyness is the Dao’s tranquility—its two qi are ever busy. Busyness is nature’s tranquility—its four illusions are ever busy. The two qi are busy, dividing the four seasons into above and below. The four illusions are busy, as day and night greedily contend in coming and going. The two qi are busy: spring transforms into warmth, summer into heat, autumn into coolness, winter into cold. The four illusions are busy: greed for wealth, attachment to beauty, infatuation with wine, competition in qi. The two qi are busy, creating and transforming the myriad things—this is yin and yang following heaven and earth’s virtue. The four illusions are busy, creating the myriad affairs—this is sentient beings violating heaven and earth’s virtue. As the scripture says: *'Sounds harmonize with one another; front and back follow in succession.'* Those who awaken amid busyness attain true non-departure.\"\n\n**Twenty-Seventh Question: On Departure**\nOne asked again: \"What is departure?\"\nThe answer: \"Departure is the Dao’s eternal abiding without end—the Dao’s image departs nowhere. Departure is the myriad things taking form and reaching their limit—qi departs somewhere. The Dao unites yin and yang. Qi unites the myriad things. When numbers are exhausted, yin and yang scatter and depart. When form ends, the myriad things decay and depart. Yin and yang scatter, yet the Dao remains. The myriad things decay, yet nature endures. As the scripture says: *'From ancient times to the present, its name does not depart.'* When things perish, qi departs; when yang harmonizes, qi comes.\"\n\n**Twenty-Eighth Question: On Coming**\nOne asked again: \"What is coming?\"\nThe answer: \"Coming is movement without form. Heaven and earth await their time to intermingle—then the two qi come. The myriad forms await their time to receive qi—then yin and yang come. The Dao is heaven and earth’s position; form is yin and yang’s position. Heaven and earth abide in the Dao—this is enduring position. Yin and yang abide in the myriad things—this is provisional position. Enduring position brings the four seasons’ transformation and communication. Provisional position brings the three powers’ gathering. Transformation and communication create and transform. Gathering creates true form. Withering is the death of things; softness is the birth of form. As the scripture says: *'In human life, one is supple and weak; in death, one is stiff and strong.'* Softness comes, uniting heaven’s clarity and peace.\"\n\n**Twenty-Ninth Question: On Peace**\nOne asked again: \"What is peace?\"\nThe answer: \"Peace is the Dao. The Dao nurtures the myriad things without choosing favorites or bestowing grace—it distributes qi in peace. Peace is reality. Reality unites the myriad transformations without choosing favorites or bestowing marvels—it distributes virtue in peace. When qi is peaceful, things grow in harmony. When virtue is peaceful, people attain goodness in harmony. Things growing in harmony all preserve their creation and transformation. People attaining goodness in harmony all preserve their Dao and virtue. As the scripture says: *'Heaven and earth unite, descending sweet dew—no one commands it, yet it naturally spreads in marvelous equality.'* This clarifies its constancy.\"\n\n**Thirtieth Question: On Constancy**\nOne asked again: \"What is constancy?\"\nThe answer: \"Constancy is the Dao. Constantly following the Dao saves human numinosity. Constantly following qi saves the forms of things. People constantly following the Dao are like fish in water. Things constantly following qi are like lamps receiving oil. Fish separated from water die. Lamps without oil go out. Constantly following the Dao brings human life. Constantly following qi brings the life of things. People are spirit; things are form. When form and spirit unite in marvel, they merge with the Dao’s reality. As the scripture says: *'Constantly excelling in saving people, thus there are no abandoned people.'* Delighting in the Dao’s constancy is true joy.\"\n\n**Thirty-First Question: On Joy**\nOne asked again: \"What is joy?\"\nThe answer: \"Joy is the Dao’s delight. Clarity without turbidity is the Dao’s delight. Joy without sorrow is the Dao’s delight. Joy is virtue’s delight. Encouraging evil to follow goodness is virtue’s delight. Seeing kindness and repaying its grace is virtue’s delight. Joy is lost delight. Turning from goodness to delight in evil is lost delight. Forgetting grace and repaying kindness is lost delight. Delighting in the Dao perfects its merit. Delighting in virtue perfects its conduct. Delighting in loss brings regression and decline. As the scripture says: *'Those of the Dao unite with the Dao; those of virtue unite with virtue; those of loss unite with loss.'* Joyful delight forgets sorrow.\"\n\n**Thirty-Second Question: On Sorrow**\nOne asked again: \"What is sorrow?\"\nThe answer: \"Those with sorrow do not comprehend the Dao’s true principle. Many affairs bring much sorrow. Those without sorrow truly unite with the Dao’s true wisdom. No affairs bring no sorrow. Many affairs with sorrow cloud the spirit and muddy qi. No affairs without sorrow clarify the spirit and refresh qi. Muddy qi brings thoughts of debauchery and evil, losing one’s hun and po. Clear qi brings no anxieties, only purity and goodness, gathering lead and mercury.\"",
      "overlap_context": "lly penetrates the pivot of transformation. The birth of the myriad things reveals the reality of the Dao. The transformation of the myriad things reveals the reality of nature. The Dao is empty yet its qi is real; nature is empty yet its life is real. As the scripture says: 'Empty the heart, fill the belly.' Clarifying its reality, the Dao and nature attain true tranquility.\"\n\n**Twenty-Fifth Question: On Tranquility**\nOne asked again: \"What is tranquility?\"\nThe answer: \"Tranquility is the Dao.\"",
      "start_char": 4605,
      "end_char": 5849,
      "start_sentence": 324,
      "end_sentence": 423,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 27.132180213928223,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\无为清静长生真人至真语录.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "魂魄散而性下沉也，铅汞成而性上升也。 经云：绝学无忧。 无於忧，念其道，则真有实得也。 第三十三　问得 复询：得者何也？ 答曰：得者，真得则得其无名之清宠，伪得则得其有名之浊辱也。 得清宠者，无贪争也。 得浊辱者，有贪争也。 无贪争，则真通其善道也。 有贪争，则伪迷其恶俗也。 真全其万行，则上宠也。 伪造其万业，则下辱也。 悟则无生也，迷则有堕也。 经云：宠辱若惊。 得其伪名着则真道失也。 第三十四　问失 复询：失者何也？ 答曰：失者，失其无为之道也。 失者，着於有为之道也。 失者，失其无为之德也，失者，着於有为之德也。 达其无为之道，则真无尽也。 着其有为之道，则伪有尽也。 达其无为之德，则性常平也。 着於有为之德，则心有憎也。 无为之道无尽，则真无坏也。 有为之道有尽，则伪有壤也。 无为之德真平，则通天也。 有为之德伪憎，财即堕也。 经云：故失道而后德，失德而后仁。 达无为则无失，通其清福也。 第三十五　问福 复询：福者何也？ 答曰：福者，真福乃道也，人之命也； 世福乃尘也，物之宝也。 无为之道福者，如皓月常盈也。 有为之世福者，如缺月渐亏也。 皓月盈而人之命也，缺月亏而世之宝也。 命者无尽之道福也，宝者有尽之世空也。 悟其道，则福生也。 迷於世，则业沉也。 经云：福兮祸所伏，孰知其极。 达其道之福，则无於祸也。 第三十六　问祸 复询：祸者何也？ 答曰：祸者，人之欲也，预造於愆也。 人若业有一分，天降於十分祸也。 人若善有一分，则天赐於十分福也。 经云：绝利一源，用师十倍。 人若不生於万恶，则胜修於万善也。 人若不着於万物，则胜施其万惠也。 经云：三返昼夜，用师万倍。 达其无为，则清福有其万倍也。 迷其有为，则伪福匿於祸也。 经云：祸兮福所倚。 真者非外舍也。 第三十七　问舍 复询：舍者何也？ 答曰：舍者，世之舍於财，则望其福也。 舍者，道非舍於有，而取其无也。 舍财取其福，则不通其真福也。 舍有着於无，则不通其真无也。 真福者，万慈也。 真无者，万达也。 慈则救於物也，达则明其理也。 慈广则德褊也，理阐则道明也。 经云：今舍其慈且勇，舍其俭且广。 进其道非取也。 第三十八　问取 复询：取者何也？ 答曰：取者，妄而非正也。 至真者道也，通清者德也。 尽於物而达，则道归之。 处其下而深，则德归之。 真不着於有，则物归之。 海不处於上，则清归之。 物归之，全其造化也。 清归之，全其至德也。 人若悟於世伪，则达其虚无而有功也。 人若悟於尽我，则通其谦下而有行也。 经云：居其实，不居其华，故去彼取此。 真无所取则明其中也。 第三十九　问中 复询：中者何也？ 答曰：中者，天之平也。 天施恩而生万物者，不拣择，则谓之明其中也。 人之平者，真布德而通万化者，不憎爱，则谓之明其中也。 天平而万物生成，则天有其功也。 人平而万化真通，则人有其行也。 天若爱者与恩，则无其大功也。 人若爱者施惠，则无其大行也。 经云：夷道若类。 明其夷道，则清福无边也。 第四十　问边 复询：边者何也？ 答曰：边者，不通其理也。 见於有而不通其无也，见其无而不通於有也，谓之边见。",
      "translated_text": "The hun and po scatter and one’s nature sinks downward. Lead and mercury congeal and one’s nature ascends upward. As the scripture says: *\"Abandon learning and there is no sorrow.\"* Without sorrow, contemplating the Dao yields true and substantial attainment.\n\n**Thirty-Third Question: On Attainment**\nOne asked again: \"What is attainment?\"\nThe answer: \"True attainment gains the nameless purity of celestial favor; false attainment gains the named impurity of worldly disgrace. Those who attain celestial favor harbor no greed or contention. Those who attain worldly disgrace indulge in greed and contention. Without greed or contention, one truly penetrates the virtuous Dao. With greed and contention, one falsely strays into vulgar evil. Preserving the myriad practices in truth brings celestial favor. Fabricating the myriad affairs in falsity brings worldly disgrace. Awakening brings no birth; delusion brings downfall. As the scripture says: *'Favor and disgrace are like startling things.'* Clinging to false names and forms loses the true Dao.\"\n\n**Thirty-Fourth Question: On Loss**\nOne asked again: \"What is loss?\"\nThe answer: \"Loss is the loss of the non-action Dao. Loss is attachment to the action-bound Dao. Loss is the loss of the non-action virtue; loss is attachment to the action-bound virtue. Penetrating the non-action Dao brings true inexhaustibility. Clinging to the action-bound Dao brings false finitude. Penetrating the non-action virtue brings constant equilibrium of nature. Clinging to the action-bound virtue brings partiality and resentment in the heart. The non-action Dao is inexhaustible, truly indestructible. The action-bound Dao is finite, falsely subject to decay. The non-action virtue is truly equanimous, connecting to Heaven. The action-bound virtue is falsely partial, and thus one falls. As the scripture says: *'Thus, lose the Dao and then virtue; lose virtue and then benevolence.'* Penetrating non-action brings no loss, only the clarity of celestial blessing.\"\n\n**Thirty-Fifth Question: On Blessing**\nOne asked again: \"What is blessing?\"\nThe answer: \"Blessing—true blessing is the Dao, the mandate of humanity. Worldly blessing is dust, the treasure of things. The blessing of the non-action Dao is like the full moon, ever waxing. The worldly blessing of action is like the waning moon, gradually diminishing. The full moon waxes and is the mandate of humanity; the waning moon diminishes and is the treasure of the world. The mandate is the inexhaustible blessing of the Dao; the treasure is the finite emptiness of the world. Awakening to the Dao generates blessing. Delusion in the world sinks one into karmic bondage. As the scripture says: *'Blessing, oh!—wherein misfortune lies concealed. Who knows its limits?'* Penetrating the Dao’s blessing brings no misfortune.\"\n\n**Thirty-Sixth Question: On Misfortune**\nOne asked again: \"What is misfortune?\"\nThe answer: \"Misfortune is human desire, premeditated transgression. If one’s karma bears a single part, Heaven inflicts tenfold misfortune. If one’s goodness bears a single part, Heaven bestows tenfold blessing. As the scripture says: *'Cut off profit at its source, and tenfold strength is employed.'* If one does not generate myriad evils, one surpasses the cultivation of myriad virtues. If one does not cling to myriad things, one surpasses the bestowal of myriad kindnesses. As the scripture says: *'Three returns by day and night employ ten-thousandfold strength.'* Penetrating non-action brings the ten-thousandfold clarity of celestial blessing. Delusion in action conceals false blessing within misfortune. As the scripture says: *'Misfortune, oh!—wherein blessing leans.'* The true does not dwell externally.\"\n\n**Thirty-Seventh Question: On Abandonment**\nOne asked again: \"What is abandonment?\"\nThe answer: \"Abandonment—abandoning wealth in the world seeks blessing. Abandonment in the Dao does not abandon the existent to grasp the nonexistent. Abandoning wealth to seek blessing fails to penetrate true blessing. Abandoning the existent to cling to the nonexistent fails to penetrate true nothingness. True blessing is boundless compassion. True nothingness is boundless penetration. Compassion saves beings; penetration illuminates principle. Broad compassion gathers virtue; illuminating principle clarifies the Dao. As the scripture says: *'Now, abandon compassion and be brave; abandon frugality and be expansive.'* Advancing the Dao is not a matter of grasping.\"\n\n**Thirty-Eighth Question: On Grasping**\nOne asked again: \"What is grasping?\"\nThe answer: \"Grasping is delusion, not correctness. The utmost real is the Dao; penetrating clarity is virtue. Exhausting things to penetrate returns the Dao. Dwelling below in profundity returns virtue. The true does not cling to the existent, and things return to it. The sea does not reside above, and clarity returns to it. Things returning completes their transformation. Clarity returning completes their utmost virtue. If one awakens to worldly falsity, one penetrates emptiness and nothingness to achieve merit. If one awakens to exhausting the self, one penetrates humility to achieve conduct. As the scripture says: *'Dwell in its substance, not its flower—thus, abandon that and grasp this.'* True nothingness grasps nothing and illuminates its center.\"\n\n**Thirty-Ninth Question: On the Center**\nOne asked again: \"What is the center?\"\nThe answer: \"The center is Heaven’s equilibrium. Heaven bestows grace to generate the myriad things without discrimination—this is called illuminating its center. Human equilibrium truly spreads virtue to penetrate the myriad transformations without partiality or favor—this is called illuminating its center. Heaven’s equilibrium brings the generation and completion of the myriad things, and Heaven has its merit. Human equilibrium brings the true penetration of the myriad transformations, and humanity has its conduct. If Heaven favors with grace, it lacks great merit. If humanity favors with kindness, it lacks great conduct. As the scripture says: *'The level Dao is like a gully.'* Illuminating the level Dao brings boundless celestial blessing.\"\n\n**Fortieth Question: On Extremes**\nOne asked again: \"What are extremes?\"\nThe answer: \"Extremes fail to penetrate principle. Seeing the existent and failing to penetrate the nonexistent, or seeing the nonexistent and failing to penetrate the existent—this is called extreme views.\"",
      "overlap_context": "ked again: \"What is sorrow?\"\nThe answer: \"Those with sorrow do not comprehend the Dao’s true principle. Many affairs bring much sorrow. Those without sorrow truly unite with the Dao’s true wisdom. No affairs bring no sorrow. Many affairs with sorrow cloud the spirit and muddy qi. No affairs without sorrow clarify the spirit and refresh qi. Muddy qi brings thoughts of debauchery and evil, losing one’s hun and po. Clear qi brings no anxieties, only purity and goodness, gathering lead and mercury.\"",
      "start_char": 5849,
      "end_char": 7097,
      "start_sentence": 424,
      "end_sentence": 519,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 27.53777813911438,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\无为清静长生真人至真语录.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "不着於边见，则通其理也。 见其有而通於无也，见其无而通於有也。 通於有则抱道而隐於洞天也，达於无则抱道而隐其京华也。 经云：为无为，事无事。 不立於二边，则真无着也。 第四十一　问着 复询：着者何也？ 答曰：着不着，则同尘而身混於万物之有也。 真无着其万有之心，则谓之大达也。 不着着，则出尘而身远於万物之有也。 真有着其万物之念，则谓之未达也。 着不着，则身似於藕也。 不着着，则身若莲也。 身在於尘，性无於尘，则了真也。 身远於尘，心有於尘，则未了也。 经云：弊则新。 真了则身应於物，非着非离也。 第四十二　问离 复询：离者何也？ 答曰：离者，身离於欲，心忘其尘，则寂然守其志也。 离者，身隐於名山，真应其琴书，寂然乐通志也。 守其志，则淳朴也。 乐通志，则华达也。 身淳朴而心华达，谓之伪形神而俱妙也。 形朴散而真华达，财谓之真形神俱妙也。 经云：不见可欲，使心不乱。 清脱离於物壳，则通人也。 第四十三　问人 复询：人者何也？ 答曰：人者，人之生纵其恶，则死沉於恶道输转也，谓之天所治於人也。 人之生不修其福，则死沉贫贱输转也，谓之天所治於人也。 人之有所善，则生在於中华，修其道也。 人之有其洪禧，则生在於中国，积其德也。 人有於恶，则天乃恶报也。 人有其善，则天乃善报也。 经云：治人事天，莫若啬。 人之不通其天意，所执於我也。 第四十四　问我 复询：我者何也？ 答曰：我者，真我者，人之性也。 我道无形之道也，我善无为之善也，人皆谓不肖也。 伪我者，人之恶也。 伪道养身之道也，伪善有为之善也，人皆谓见肖也。 真我者，无形之道则真也，无为之善则常也。 伪我，则养身之道则假也，有为之善则憎也。 经云：天下皆谓我道大似不肖，若肖久矣。 明其真我不辩也。 第四十五　问辩 复询：辩者何也？ 答曰：辩者，世之有辩者，有於万恶也； 天之不言者，有其万善也。 世之辩则有於是非也，道之辩则有其清善也。 世之口有辩而心无达也，道乃口无说而真有通也。 无达则广博，而无知其妙也。 有通则绝学，而有知其妙也。 两者谓之迷悟也。 经云：善者不辩，辩者不善。 通其天意，则外若讷也。 第四十六　问讷 复询：讷者何也？ 答曰：讷者似於讷者，似其不能言也。 达其道而散於朴，则讷者如辩也。 抱其道而返於朴，则辩者如讷也。 散其朴则损气，而身有於拘也。 返其朴则惜气，而身无於拘也。 见其愚者，辩如讷也。 见其贤者，讷如辩也。 经云：大巧若拙，大辩若讷。 益真则外损之。 第四十七　问损 复询：损者何也？ 答曰：损者，有道之人用事则损於己，不损其他人也。 若处先己而后人，则有其德也。 无道之者，用事则损其他人，不损於己。 若处先人而后己，则无其德也。 有其德者，无为也。 无其德者，有为也。 无其为损於物，则有道也，有其为殢於物，则无道也。 经云：为道日损。 外损尽於物，则道所益也。 第四十八　问益 复询：益者何也？ 答曰：益者，有益其真者，道之理也。 悟道则所学其正教，有达者益真也。 迷世则所学於邪法，无达者益身也。 益真则明其道也，益身则殢於物也。 明道则清善也，殢物则贪争也。",
      "translated_text": "Without clinging to extreme views, one penetrates principle. Seeing the existent and penetrating the nonexistent, seeing the nonexistent and penetrating the existent—this is called comprehension. Penetrating the existent, one embraces the Dao and withdraws into the grotto-heavens. Reaching the nonexistent, one embraces the Dao and conceals oneself in the capital’s splendor. As the scripture says: *\"Act without acting, engage in affairs without affairs.\"* Not standing on either extreme is true non-attachment.\n\n**Forty-First Question: On Attachment**\nOne asked again: \"What is attachment?\"\nThe answer: \"Non-attachment to attachment means blending with the dust and merging one’s body with the myriad things. Truly unattached to the mind of the myriad existents—this is called great comprehension. Attachment to non-attachment means transcending the dust and distancing one’s body from the myriad things. Truly attached to the thoughts of the myriad things—this is called incomprehension. Non-attachment to attachment makes the body like the lotus root. Attachment to non-attachment makes the body like the lotus flower. The body in the dust while the nature is free of dust—this is true awakening. The body distant from the dust while the mind clings to dust—this is unawakened. As the scripture says: *'The worn-out becomes new.'* True awakening means the body responds to things—neither attached nor detached.\n\n**Forty-Second Question: On Detachment**\nOne asked again: \"What is detachment?\"\nThe answer: \"Detachment means the body withdraws from desire, the mind forgets the dust, and one serenely guards their aspiration. Detachment means the body retreats into famous mountains, truly harmonizing with zither and books, serenely delighting in the communion of aspiration. Guarding one’s aspiration is simplicity. Delighting in the communion of aspiration is refinement. The body simple and the mind refined—this is called the false form and spirit both wondrous. The form simple and dispersed while the true nature refined—this alone is called the true form and spirit both wondrous. As the scripture says: *'Do not show what may be desired, and the heart will not be disturbed.'* Pure liberation from the shell of things is the communion of the adept.\n\n**Forty-Third Question: On Humanity**\nOne asked again: \"What is humanity?\"\nThe answer: \"Humanity means that if one indulges in evil during life, one sinks into evil destinies after death, endlessly transmigrating—this is called Heaven’s governance over humanity. If one does not cultivate blessings in life, one sinks into poverty and lowliness after death, endlessly transmigrating—this is called Heaven’s governance over humanity. If one possesses goodness, one is born in the Central Lands to cultivate the Dao. If one accumulates great felicity, one is born in the Middle Kingdom to amass virtue. If one has evil, Heaven metes out evil retribution. If one has goodness, Heaven metes out good retribution. As the scripture says: *'In governing people and serving Heaven, nothing surpasses frugality.'* Humanity’s failure to comprehend Heaven’s intent arises from clinging to the self.\n\n**Forty-Fourth Question: On the Self**\nOne asked again: \"What is the self?\"\nThe answer: \"The self—the true self—is humanity’s nature. The self’s Dao is the formless Dao; the self’s goodness is the effortless goodness, which all call unworthy. The false self is humanity’s evil. The false Dao is the Dao of nurturing the body; the false goodness is the goodness of effort—all call this worthy. The true self—the formless Dao is true; the effortless goodness is constant. The false self—the Dao of nurturing the body is false; the goodness of effort is detestable. As the scripture says: *'The world all says my Dao is great and seems unworthy; if it were worthy, it would have long since become small.'* Illuminating the true self requires no contention.\n\n**Forty-Fifth Question: On Contention**\nOne asked again: \"What is contention?\"\nThe answer: \"Contention means that worldly contention arises from myriad evils; Heaven’s silence arises from myriad virtues. Worldly contention involves right and wrong; the Dao’s contention involves pure goodness. The world’s mouth contends while the heart lacks comprehension; the Dao’s mouth is silent while the truth is truly communicated. Lacking comprehension leads to vast erudition without knowing its wonder. True communication means cutting off learning yet knowing its wonder. Both are called delusion and awakening. As the scripture says: *'The good do not contend; the contentious are not good.'* Comprehending Heaven’s intent, one appears outwardly inarticulate.\n\n**Forty-Sixth Question: On Inarticulateness**\nOne asked again: \"What is inarticulateness?\"\nThe answer: \"Inarticulateness seems like inability to speak. Comprehending the Dao and dispersing into simplicity, the inarticulate seem eloquent. Embracing the Dao and returning to simplicity, the eloquent seem inarticulate. Dispersing simplicity harms qi and constrains the body. Returning to simplicity preserves qi and frees the body. To the foolish, the eloquent seem inarticulate. To the wise, the inarticulate seem eloquent. As the scripture says: *'Great skill seems clumsy; great eloquence seems inarticulate.'* Benefiting the true requires outwardly diminishing.\n\n**Forty-Seventh Question: On Diminishing**\nOne asked again: \"What is diminishing?\"\nThe answer: \"Diminishing means that the person of the Dao, when taking action, diminishes the self and does not diminish others. Placing oneself after others is possessing virtue. The person without the Dao, when taking action, diminishes others and does not diminish the self. Placing others before oneself is lacking virtue. Possessing virtue is non-action. Lacking virtue is action. Non-action that diminishes things is having the Dao; action that exhausts things is lacking the Dao. As the scripture says: *'In pursuing the Dao, daily diminish.'* Outwardly diminishing to the utmost in things is where the Dao’s benefit lies.\n\n**Forty-Eighth Question: On Benefit**\nOne asked again: \"What is benefit?\"\nThe answer: \"Benefit means benefiting the true is the principle of the Dao. Awakening to the Dao, one studies the correct teaching—those who comprehend benefit the true. Deluded by the world, one studies heterodox methods—those who lack comprehension benefit the self. Benefiting the true clarifies the Dao; benefiting the self exhausts things. Clarifying the Dao is pure goodness; exhausting things is greed and strife.\"",
      "overlap_context": "ors with grace, it lacks great merit. If humanity favors with kindness, it lacks great conduct. As the scripture says: *'The level Dao is like a gully.'* Illuminating the level Dao brings boundless celestial blessing.\"\n\n**Fortieth Question: On Extremes**\nOne asked again: \"What are extremes?\"\nThe answer: \"Extremes fail to penetrate principle. Seeing the existent and failing to penetrate the nonexistent, or seeing the nonexistent and failing to penetrate the existent—this is called extreme views.\"",
      "start_char": 7097,
      "end_char": 8348,
      "start_sentence": 520,
      "end_sentence": 606,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.582993268966675,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\无为清静长生真人至真语录.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "清善则积其德也，贪争则积於业也。 有其万行，则真升也。 有其万业，则身堕也。 经云：为学日益。 所学益其道之真，则久长也。 第四十九　问长 复询：长者何也？ 答曰：长者人之长，则顺其道而真长也，忘於情则命长也，善明妙则天长也，通其慧则理长也。 真长，则达虚无体也。 命长，则宝光圆也。 天长，则祥烟袅也。 理长，则自然通也。 明虚无，则道全也。 明光圆，则命全也。 明祥烟，则神全也。 明自然，则德全也。 经云？ 天长地久。 顺其天之长，则无於短也。 第五十　问短 复询：短者何也？ 答曰：短者，守道无终，则志短也； 见善无慈，则行短也； 二尊不敬，则孝短也。 志短则无功也，无慈则无行也，无孝则忘恩也。 有志则全道也，有慈则全德也，酬恩则全孝也。 无道无德无孝，则有短也。 有道有德有孝，则无短也。 经云：斯不善已。 智短则生於伪巧也。 第五十一　问巧 复询：巧者何也？ 答曰：巧者，殢其万巧有为，明万利而利多，则害身也； 绝其万巧无为，明万清而清多，则全身也。 世利多，则生於祸也； 道清多，则生於福也。 伪巧则生於祸也，真清则生於福也。 迷於有则伪也，悟其无则真也。 伪有则恶所害也，真无则善所侵也。 经云：绝巧弃利，盗贼无有。 明者忘於伪巧，而守其真拙也。 第五十二　问拙 复询：拙者何也？ 答曰：拙者，至性而通贤，外貌似其愚拙，则谓之返朴也； 真慧而通文，伪形而憨拙，则谓之伏藏也。 对其伪迷隐，则拙明也； 对其真悟显，则拙达也。 通於世则物达也，通於道则真达也。 见其俗士则应於万有，而机变自然通有也。 见其知音则应於万无，而机变自然通无也。 外拙而真非愚也。 经云：性有巧拙，可以伏藏。 至巧而若拙，则明者赞也。 第五十三　问赞 复询：赞者何也？ 答曰：赞者，君子则扬人美而掩人丑也。 小人则掩人美而扬人丑也。 掩人之丑恶，扬人之美善，则谓之德也。 扬人之丑恶，掩人之美善，则谓之愆也。 有其德则再为人贵也，有於愆则再为人贱也。 今世重人者，来世人却重也。 今世轻人者，来世人却轻也。 德全其道则升也。 愆迷於世，则堕也。 经云：知者不言，言者不知。 善赞则无於恶毁也。 第五十四　问毁 复询：毁者何也？ 答曰：毁者，有毁者愚，不知贤也； 无毁者贤，知其愚也。 愚者举恶而抑其善也，贤者劝恶而归其善也。 愚者生愆而着其相，求福也。 贤者泯愆而忘其相，守道也。 迷者有恶而有善也，悟者无恶而无善也。 有善者无常也，无恶者有常也。 有常则谓之道也。 经云：愚人以天地文理圣，我以时物文理哲。 无於毁则浊念忘也。 第五十五　问忘 复询：忘者何也？ 答曰：忘者，念其道则忘於世也，念其正则忘於邪也，谓之迷悟也。 念道则修其真也，念世则养於身也。 念正则通至理也，念邪则修色身也。 念真则有其功无愆也，养身则无其功有愆也。 念其正则有行也，无着也。 念其邪则有着也，无行也。 经云：心生於物，死於物。 达理明其枢机，则真忘念也，外无贪也。 第五十六　问贪 复询：贪者何也？ 答曰：贪者，贪於欲则丧其命也，贪於财则丧其身也，迷者先甘而后苦也。 泯於欲则全其命也，绝於财则全其身也，悟者先苦而后甘也。",
      "translated_text": "Purity and goodness accumulate virtue; greed and strife accumulate karma. Cultivating the ten thousand practices elevates the true. Accumulating the ten thousand karmas causes the self to fall. As the scripture says: *'In learning, daily increase.'* What one learns that increases the true of the Dao endures long.\n\n**Forty-Ninth Question: On Endurance**\nOne asked again: \"What is endurance?\"\nThe answer: \"Endurance is the enduring of humanity—following the Dao, the true endures. Forgetting emotions, life endures. Illuminating the wondrous, heaven endures. Penetrating wisdom, principle endures.\nThe true enduring is attaining the formless body.\nLife enduring is treasuring the radiant perfection.\nHeaven enduring is the auspicious mist curling.\nPrinciple enduring is the spontaneous penetration.\nIlluminating the formless, the Dao is complete.\nIlluminating radiant perfection, life is complete.\nIlluminating auspicious mist, spirit is complete.\nIlluminating the spontaneous, virtue is complete.\nAs the scripture says: *'Heaven is enduring, earth is lasting.'*\nFollowing heaven’s endurance, there is no shortness.\"\n\n**Fiftieth Question: On Shortness**\nOne asked again: \"What is shortness?\"\nThe answer: \"Shortness is failing to uphold the Dao to the end—will is short. Seeing goodness without compassion, conduct is short. Disrespecting the two venerables, filial piety is short.\nShort will yields no merit. Without compassion, there is no conduct. Without filial piety, gratitude is forgotten.\nHaving will completes the Dao. Having compassion completes virtue. Repaying gratitude completes filial piety.\nWithout Dao, without virtue, without filial piety, there is shortness. With Dao, with virtue, with filial piety, there is no shortness.\nAs the scripture says: *'This is not goodness.'*\nShort wisdom arises from false craft.\"\n\n**Fifty-First Question: On Craft**\nOne asked again: \"What is craft?\"\nThe answer: \"Craft is exhausting the ten thousand cunning actions—clarifying the ten thousand gains, where gains are many, harms the self. Cutting off the ten thousand cunning non-actions—clarifying the ten thousand purities, where purity is abundant, preserves the self.\nWorldly gains multiply, giving rise to misfortune. Daoist purity multiplies, giving rise to blessing.\nFalse craft gives rise to misfortune; true purity gives rise to blessing.\nDeluded by existence, it is false. Awakened to non-existence, it is true.\nFalse existence is harmed by evil; true non-existence is pervaded by goodness.\nAs the scripture says: *'Abandon craft, discard gain—thieves and robbers will not exist.'*\nThe enlightened forget false craft and uphold true clumsiness.\"\n\n**Fifty-Second Question: On Clumsiness**\nOne asked again: \"What is clumsiness?\"\nThe answer: \"Clumsiness is innate nature penetrating worthiness—outwardly appearing foolish and clumsy, called returning to simplicity. True wisdom penetrating culture—false form appearing dull and clumsy, called hidden concealment.\nFacing false delusion, clumsiness is clarity. Facing true awakening, clumsiness is attainment.\nPenetrating the world, things are attained. Penetrating the Dao, the true is attained.\nEncountering worldly scholars, one responds to the ten thousand existences, and the mechanism naturally penetrates existence. Encountering kindred spirits, one responds to the ten thousand non-existences, and the mechanism naturally penetrates non-existence.\nOutward clumsiness is not true foolishness.\nAs the scripture says: *'Nature has craft and clumsiness—it can be hidden.'*\nUtmost craft appearing clumsy is praised by the enlightened.\"\n\n**Fifty-Third Question: On Praise**\nOne asked again: \"What is praise?\"\nThe answer: \"Praise is the noble extolling others’ virtues and concealing their flaws. The petty conceal others’ virtues and extol their flaws.\nConcealing others’ flaws and evil, extolling their virtues and goodness, is called virtue. Extolling others’ flaws and evil, concealing their virtues and goodness, is called transgression.\nHaving virtue, one is again honored by others. Having transgression, one is again despised by others.\nThose esteemed in this life are esteemed by others in the next. Those belittled in this life are belittled by others in the next.\nVirtue completing the Dao ascends. Transgression deluded by the world falls.\nAs the scripture says: *'The wise do not speak; those who speak are not wise.'*\nGood praise has no slander.\"\n\n**Fifty-Fourth Question: On Slander**\nOne asked again: \"What is slander?\"\nThe answer: \"Slander is the foolish slandering, not knowing the worthy. The worthy do not slander, knowing the foolish.\nThe foolish promote evil and suppress goodness. The worthy encourage evil to return to goodness.\nThe foolish generate transgressions, manifesting their appearances to seek blessing. The worthy erase transgressions, forgetting their appearances to uphold the Dao.\nThe deluded have evil and goodness. The awakened have no evil and no goodness.\nHaving goodness is inconstant. Having no evil is constant.\nConstancy is called the Dao.\nAs the scripture says: *'The foolish take heaven and earth’s patterns as sagely; I take the patterns of time and things as wise.'*\nWithout slander, impure thoughts are forgotten.\"\n\n**Fifty-Fifth Question: On Forgetting**\nOne asked again: \"What is forgetting?\"\nThe answer: \"Forgetting is contemplating the Dao and forgetting the world, contemplating the correct and forgetting the heterodox—called delusion and awakening.\nContemplating the Dao cultivates the true. Contemplating the world nurtures the self.\nContemplating the correct penetrates the ultimate principle. Contemplating the heterodox cultivates the physical form.\nContemplating the true yields merit without transgression. Nurturing the self yields no merit with transgression.\nContemplating the correct has conduct without attachment. Contemplating the heterodox has attachment without conduct.\nAs the scripture says: *'The mind arises from things and dies by things.'*\nPenetrating principle and illuminating the pivot, true forgetting of thoughts—externally without greed.\"\n\n**Fifty-Sixth Question: On Greed**\nOne asked again: \"What is greed?\"\nThe answer: \"Greed is coveting desires and losing life, coveting wealth and losing the self. The deluded first taste sweetness, then bitterness.\nEradicating desires preserves life. Cutting off wealth preserves the self. The awakened first taste bitterness, then sweetness.\"",
      "overlap_context": "es.\n\n**Forty-Eighth Question: On Benefit**\nOne asked again: \"What is benefit?\"\nThe answer: \"Benefit means benefiting the true is the principle of the Dao. Awakening to the Dao, one studies the correct teaching—those who comprehend benefit the true. Deluded by the world, one studies heterodox methods—those who lack comprehension benefit the self. Benefiting the true clarifies the Dao; benefiting the self exhausts things. Clarifying the Dao is pure goodness; exhausting things is greed and strife.\"",
      "start_char": 8348,
      "end_char": 9605,
      "start_sentence": 607,
      "end_sentence": 698,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.326906442642212,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\无为清静长生真人至真语录.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "丧命丧身则愚也，全命全身则贤也。 浊者贪世违其道也，清者忘世达其道也。 经云：罪莫大於可欲，祸莫大於不知足。 不贪世伪，则真抱道也。 第五十七　问道 复询：道者何也？ 答曰：道者，通物者无物，则道也； 知空而不空，则常也，谓之道常也。 道常达，则无为通也。 无者明恍惚之妙也，为者明变通之理也。 无则阴阳之外也，为则万化之明也。 达无而明其有也，通为而明其无也。 非殢於有相为也。 经云：道常无为，而无不为。 道之为，非小善化於俗也。 第五十八　问俗 复询：俗者何也？ 答曰：俗者，人之俗躯也。 真者，至神也。 谓之有物也。 有之外，道乃天地之先也。 物之表，性乃阴阳之外也。 有而明，则如石中见其玉也。 物而明，则似蚌中见其珠也。 有者，人之形也。 物者，真之性也。 形终，则性常在也。 物尽，则气常存也。 迷有物，则魂魄散也。 悟道性，则造化成也。 经云：有物混成，先天地生。 外应俗而无於非也。 第五十九　问非 复询：非者何也？ 答曰：非者，上士之人，暗行其万清万善，而大通也； 下士之人，明纵於万浊万恶，而大笑也。 清者，顺道而存也。 浊者，逆道而亡也。 贤者，外不贤也。 愚者，外不愚也。 清浊贤愚，久而世知之矣。 日月之明，非自见其明也，天下众目见其明也。 经云：下士闻道，大笑之。 非其是也。 第六十　问是 复询：是者何也？ 答曰：是者从其道，则真是也。 非者从於物，则伪非也。 明真则不着於伪也，明是则不言於非也。 明於真，则妙通其道也。 明於是，则妙通其天也。 明道则有其功也，明天则有其行也。 功者，阳道也。 行者，阴德也。 若私救於万形，谓之阳功也。 若偷救於万苦，谓之阴德也。 经云：自见者不明，自是者不彰。 自是念道而应物，则有其思也。 第六十一　问思 复询：思者何也？ 答曰：悟思者，有知其万清而行，则有万善也； 知於万爱而行，则有万恶也。 有万清万善，则真升也。 有万爱万恶，则伪堕也。 生无愆，则死无苦也。 生有愆，则死有苦也。 经云：吾言甚易知，甚易行，天下莫能知，莫能行。 思而知其理之妙，忘於世也。 第六十二问世 复询：世者何也？ 答曰：世者，通世有知於人，则忘世而向道也； 迷世无知其人，则恋世而背道也。 真通其万物，则出於万物之壳也。 伪迷其万物，则在於万物之壳也。 真出於物壳，则道也。 伪在於物壳，则尘也。 真在其道，则无生死也。 伪在於尘，则有生死也。 悟则智通，迷则不明也。 经云：知人者智。 物极而世外，则明其奥妙也。 第六十三　问妙 复询：妙者何也？ 答曰：妙者真无欲，则性如皓月圆，而观其妙也； 伪有欲，则妄似萤耀明，而见於徽也。 皓月则十方明也，萤耀则一点明也。 十方明，则通万化也。 一点明，则执一法也。 通化容於邪也，执法谤其正也。 无高下通，则正也。 有憎爱执，则邪也。 经云：常无欲以观其妙，常有欲以观其彻。 达妙则明其微也。 第六十四　问微 复询：微者何也？ 答曰：微者，见其深微则明道也，明其深虑则通世也。 通道者，预通世也。 通世者，不通道也。 明道则提，通世者，通世〔忘世〕则敬也。 通道者，通道行道则达也。 通世忘世，则贤也。",
      "translated_text": "Losing life and losing the self is folly; preserving life and preserving the self is wisdom. The turbid covet the world and violate the Dao; the pure forget the world and attain the Dao. As the scripture says: *\"No sin is greater than yielding to desire; no disaster is greater than discontent.\"* Not coveting worldly falsity is to truly embrace the Dao.\n\n**Fifty-Seventh Question: On the Dao**\nOne asked again: \"What is the Dao?\"\nThe answer: \"The Dao is that which penetrates things yet is no-thing—this is the Dao. Knowing emptiness yet not empty, this is constancy, called the constancy of the Dao. When the constancy of the Dao is attained, non-action flows freely. *Non-* reveals the subtlety of the indistinct; *action* reveals the principle of adaptability. *Non-* lies beyond yin and yang; *action* illumines the transformations of the myriad things. Penetrating *non-* and illuminating *being*, comprehending *action* and illuminating *non-*—this is not clinging to form or doing. As the scripture says: *'The Dao constantly takes no action, yet there is nothing it does not do.'* The Dao’s doing is not petty goodness that transforms the vulgar.\n\n**Fifty-Eighth Question: On the Vulgar**\nOne asked again: \"What is the vulgar?\"\nThe answer: \"The vulgar is the common body of man. The true is the utmost spirit. It is called *having-thing*. Beyond *having*, the Dao precedes heaven and earth. Beyond things, nature lies outside yin and yang. Illuminating *having* is like seeing jade within stone. Illuminating *thing* is like seeing a pearl within a clam. *Having* is man’s form; *thing* is the true nature. When form ends, nature remains constant. When things are exhausted, qi remains ever-present. Deluded by *having* and *thing*, the hun and po scatter. Awakened to the Dao-nature, creation is accomplished. As the scripture says: *'There was a thing, chaotic yet complete, born before heaven and earth.'* Externally responsive to the vulgar, yet without falsity.\n\n**Fifty-Ninth Question: On Falsity**\nOne asked again: \"What is falsity?\"\nThe answer: \"Falsity is this: the superior person subtly practices myriad purities and myriad virtues, achieving great penetration; the inferior person openly indulges in myriad impurities and myriad evils, inviting great ridicule. The pure follow the Dao and endure; the turbid oppose the Dao and perish. The wise appear unwise; the foolish appear not foolish. Purity and turbidity, wisdom and folly—over time, the world knows them. The brightness of the sun and moon does not see its own light; the eyes of the world see their brightness. As the scripture says: *'When the inferior person hears the Dao, they laugh greatly.'* This is not *is*.\n\n**Sixtieth Question: On *Is***\nOne asked again: \"What is *is*?\"\nThe answer: \"*Is* is following the Dao, thus it is true. *Not-is* is following things, thus it is false. Illuminating the true prevents attachment to the false; illuminating *is* prevents speech of *not-is*. Illuminating the true subtly penetrates the Dao; illuminating *is* subtly penetrates heaven. Illuminating the Dao yields merit; illuminating heaven yields conduct. Merit is the yang Dao; conduct is the yin virtue. Privately aiding the myriad forms is called yang merit. Stealthily rescuing the myriad sufferings is called yin virtue. As the scripture says: *'Those who see themselves are not bright; those who assert themselves are not illustrious.'* Asserting oneself, contemplating the Dao, and responding to things—this is having thought.\n\n**Sixty-First Question: On Thought**\nOne asked again: \"What is thought?\"\nThe answer: \"Awakened thought—knowing the myriad purities and acting—yields myriad virtues; knowing the myriad attachments and acting—yields myriad evils. Myriad purities and myriad virtues lead to true ascent; myriad attachments and myriad evils lead to false descent. Living without transgression, dying without suffering. Living with transgression, dying with suffering. As the scripture says: *'My words are very easy to know, very easy to practice, yet none in the world can know, none can practice.'* Thinking and knowing the subtlety of principle, forgetting the world.\n\n**Sixty-Second Question: On the World**\nOne asked again: \"What is the world?\"\nThe answer: \"The world is this: penetrating the world and knowing man, one forgets the world and turns toward the Dao; deluded by the world and ignorant of man, one clings to the world and turns from the Dao. Truly penetrating the myriad things, one emerges from the shell of the myriad things. Falsely deluded by the myriad things, one remains within the shell of the myriad things. Truly emerging from the shell of things is the Dao; falsely remaining within the shell of things is dust. Truly abiding in the Dao, there is no life and death; falsely abiding in dust, there is life and death. Awakened, wisdom penetrates; deluded, it does not. As the scripture says: *'Knowing others is wisdom.'* When things reach their limit and transcend the world, the profound mystery is illuminated.\n\n**Sixty-Third Question: On the Subtle**\nOne asked again: \"What is the subtle?\"\nThe answer: \"The subtle is this: true non-desire—nature is like the full moon, observing its subtlety; false desire—delusion is like firefly glow, seeing its traces. The full moon illumines the ten directions; firefly glow illumines a single point. Illuminating the ten directions penetrates the myriad transformations; illuminating a single point clings to one dharma. Penetrating transformations accommodates the heterodox; clinging to dharma slanders the correct. Without high or low, penetrating—this is correctness. With love and hate, clinging—this is heterodoxy. As the scripture says: *'Constantly without desire, observe its subtlety; constantly with desire, observe its manifestations.'* Penetrating the subtle illuminates the minute.\n\n**Sixty-Fourth Question: On the Minute**\nOne asked again: \"What is the minute?\"\nThe answer: \"The minute is this: seeing its profound subtlety illuminates the Dao; illuminating its profound consideration penetrates the world. Penetrating the Dao foresees penetrating the world; penetrating the world does not penetrate the Dao. Illuminating the Dao is elevation; penetrating the world—penetrating the world [forgetting the world]—is reverence. Penetrating the Dao, practicing the Dao, is attainment. Penetrating the world, forgetting the world, is wisdom.\"",
      "overlap_context": "*'The mind arises from things and dies by things.'*\nPenetrating principle and illuminating the pivot, true forgetting of thoughts—externally without greed.\"\n\n**Fifty-Sixth Question: On Greed**\nOne asked again: \"What is greed?\"\nThe answer: \"Greed is coveting desires and losing life, coveting wealth and losing the self. The deluded first taste sweetness, then bitterness.\nEradicating desires preserves life. Cutting off wealth preserves the self. The awakened first taste bitterness, then sweetness.\"",
      "start_char": 9605,
      "end_char": 10854,
      "start_sentence": 699,
      "end_sentence": 799,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 27.869646072387695,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\无为清静长生真人至真语录.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "达者，化世之贤也。 贤者，化世之愚也。 愚者明，则贤也。 贤者明，则达也。 经云：微妙玄通，深不可识。 悟幽微则明无方也。 第六十五　问方 复询：方者何也？ 答曰：方者，天地方圆，生於万物，不以爱者恩生也，不以憎者害灭也。 太上布德，救於万灵，不以贵者爱恋也，不以贱者断绝也。 天地生於万物，布气而平也。 太上救於万灵，布德而平也。 万物气通，则通天地之大恩功也。 万灵德通，则通太上之大恩行也。 谓之天地圣人，若私至功至行也。 经云：是以圣人方而不割。 真明其方寸，则命光圆也。 第六十六　问圆 复询：圆者何也？ 答曰：圆者，天之圆光，望日则月圆也。 晦日则光尽也。 人之命光，十五则连受胎十六岁命圆也，八八而卦尽也。 光尽则天无明也，卦尽则人无命也。 少欲则命延也，多欲则寿夭也。 谓之天之人之盈亏也。 无情则命住也，无物则性通也。 命通性，则如水见土也。 性通命，则如土见水也。 常善通则真火降也，九转成则形不朽也。 经云：见小日明。 圆光显则应也。 第六十七　问应 复询：应者何也？ 答曰：无形之道不应有形之身也，无形之性不应有情之礼也。 贵实者仙道，则道应其性也。 贵华者人道，则形应於礼也。 应其性则真也，应於礼则伪也。 天之道抑高而举下也，人之道损贫而奉富也。 顺其天道则逆於人道也，顺於人道则逆其天道也。 经云：上礼为之，而莫之应。 道应其无为，则真通变也。 第六十八　问变 复询：变者何也？ 答曰：变者，无为真变，则如水中鉴月也； 有为伪变，则似镜裹观形也。 知无为之变，则真性通也。 见有为之变，则伪形力也。 通则无情之真，忘有情之伪也。 力则有情之伪，昧无情之真也。 真变则性通道也，伪变则身贪利也。 道通则全其性也，利贪则害於身也。 经云：为无为，则无不治矣。 应其真变，则道无情也。 第六十九　问情 复询：情者何也？ 答曰：情者，曲则道性无情，而身似有其情也； 执则道性有情，而身如无情也。 曲性无於情，则无漏也。 执性有於情，则有漏也。 曲则贤也，执则愚也。 无漏而有贤，则有道有德也。 有漏而无贤，则无道无德也。 有道之真，则魂魄全也。 有德之明，则万化通也。 经云：我无欲而民自朴，我无情而民自清。 道无情则真，不着於世物也。 第七十　问物 复询：物者何也？ 答曰：物者，人在於物壳，则似鱼在网也； 人出其物壳，则如真在道也。 鱼在网，离水则死也。 真在道，离物则生也。 鱼不贪饵，则鱼常在水也。 人不贪物，则人常在道也。 鱼在水则活也，人在道则生也。 鱼得珠光则变也，人得气冲则通也。 此两者迷则死也，悟则生也。 经云：天网恢恢，疏而不失。 物外则忘於机也。 第七十一　问机 复询：机者何也？ 答曰：机者，智也。 无道之人用智财损於人，安其自己，谓之贼也。 有道之人用智则损其自己，安於人，谓之福也。 小智则愚恶也，大智则贤善也。 愚者违天也，贤者顺天也。 违天则身堕也，顺天则真升也。 堕者阴道浊也，升者阳道清也。 经云：民之难治，以其智多。 自然之智明道，则无虑也。",
      "translated_text": "The enlightened transform the world’s worthy. The worthy transform the world’s foolish. When the foolish attain clarity, they become worthy; when the worthy attain clarity, they become enlightened. As the scripture says: *\"Subtle, wondrous, and profoundly interconnected—deep beyond comprehension.\"* Awakening to the hidden and minute illuminates boundless clarity.\n\n**Sixty-Fifth Question: On the Square**\nOne asked again: \"What is the square?\"\nThe answer: \"The square is this: heaven is square, earth is round—these arise within the myriad things. They do not bestow life through favor, nor do they bring destruction through hatred. The Supreme spreads virtue to save the ten thousand spirits, not clinging to the noble with attachment, nor cutting off the lowly. Heaven and earth give life to the myriad things, spreading *qi* with impartiality. The Supreme saves the ten thousand spirits, spreading virtue with impartiality. When the myriad things connect through *qi*, they partake in heaven and earth’s great benevolence. When the ten thousand spirits connect through virtue, they partake in the Supreme’s great meritorious conduct. This is called the sages of heaven and earth—yet if they act with partiality, even their greatest deeds and conduct become flawed. As the scripture says: *'Thus the sage is square but does not cut.'* Truly illuminating the square inch of the heart-mind radiates a perfect mandate.\"\n\n**Sixty-Sixth Question: On the Round**\nOne asked again: \"What is the round?\"\nThe answer: \"The round is this: heaven’s round light—when gazing at the sun, the moon is full; on the darkest night, its light is exhausted. A person’s mandate-light: at fifteen, it begins to receive the embryo; at sixteen, the mandate is complete. At sixty-four (eight times eight), the hexagrams are exhausted. When light is exhausted, heaven has no illumination; when hexagrams are exhausted, a person has no mandate. Few desires extend the mandate; many desires shorten the lifespan. This is called the waxing and waning of heaven and humanity. Without attachment, the mandate abides; without things, the nature flows. When the mandate flows through nature, it is like water encountering earth. When nature flows through the mandate, it is like earth encountering water. Constantly practicing the good and flowing through it, true fire descends; after nine transformations, the form becomes indestructible. As the scripture says: *'Seeing the small is called clarity.'* When the round light manifests, it responds.\"\n\n**Sixty-Seventh Question: On Response**\nOne asked again: \"What is response?\"\nThe answer: \"The formless Dao does not respond to the embodied form; the formless nature does not respond to the rituals of attachment. Those who value substance follow the immortal Dao, and the Dao responds to their nature. Those who value ornamentation follow the human Dao, and their form responds to ritual. Responding to nature is truth; responding to ritual is falsehood. Heaven’s Dao suppresses the high and uplifts the low; humanity’s Dao diminishes the poor and serves the rich. Following heaven’s Dao is contrary to humanity’s Dao; following humanity’s Dao is contrary to heaven’s Dao. As the scripture says: *'When highest ritual is enacted, none respond.'* When the Dao responds to non-action, true transformation flows.\"\n\n**Sixty-Eighth Question: On Transformation**\nOne asked again: \"What is transformation?\"\nThe answer: \"Transformation is this: true transformation through non-action is like seeing the moon reflected in water; false transformation through action is like seeing one’s form in a mirror. Knowing the transformation of non-action, true nature flows. Seeing the transformation of action, false form exerts force. Flowing is the truth of non-attachment, forgetting the falsehood of attachment. Force is the falsehood of attachment, obscuring the truth of non-attachment. True transformation flows through nature and Dao; false transformation clings to the body and profit. When the Dao flows, nature is preserved; when profit is grasped, the body is harmed. As the scripture says: *'Act through non-action, and nothing is left ungoverned.'* Responding to true transformation, the Dao is without attachment.\"\n\n**Sixty-Ninth Question: On Attachment**\nOne asked again: \"What is attachment?\"\nThe answer: \"Attachment is this: when bent, the Dao-nature is without attachment, yet the body seems to possess it; when rigid, the Dao-nature has attachment, yet the body appears without it. A bent nature without attachment is without leakage; a rigid nature with attachment is with leakage. Bent is worthy; rigid is foolish. Without leakage and with worthiness, there is Dao and virtue. With leakage and without worthiness, there is no Dao and no virtue. The truth of having Dao preserves the hun and po; the clarity of having virtue flows through the ten thousand transformations. As the scripture says: *'I have no desires, and the people become naturally simple; I have no attachments, and the people become naturally pure.'* The Dao without attachment is true, unentangled by worldly things.\"\n\n**Seventieth Question: On Things**\nOne asked again: \"What are things?\"\nThe answer: \"Things are this: a person within the shell of things is like a fish in a net; a person beyond the shell of things is like truth within the Dao. A fish in a net, separated from water, dies. Truth within the Dao, separated from things, lives. If a fish does not covet bait, it remains in water; if a person does not covet things, they remain in the Dao. A fish in water lives; a person in the Dao thrives. A fish obtaining the pearl’s light transforms; a person obtaining the surge of *qi* flows through. Both, when deluded, die; when awakened, live. As the scripture says: *'Heaven’s net is vast, loose yet never failing.'* Beyond things, one forgets the mechanism.\"\n\n**Seventy-First Question: On Mechanism**\nOne asked again: \"What is mechanism?\"\nThe answer: \"Mechanism is this: cunning. Those without Dao use cunning to harm others, securing themselves—this is called thievery. Those with Dao use cunning to diminish themselves, securing others—this is called blessing. Petty cunning is foolish and evil; great cunning is worthy and good. The foolish defy heaven; the worthy follow heaven. Defying heaven, the body falls; following heaven, truth ascends. The fallen follow the murky path of yin; the ascended follow the clear path of yang. As the scripture says: *'The people are difficult to govern because of their many schemes.'* The wisdom of spontaneity illuminates the Dao, leaving no concerns.\"",
      "overlap_context": "n: \"What is the minute?\"\nThe answer: \"The minute is this: seeing its profound subtlety illuminates the Dao; illuminating its profound consideration penetrates the world. Penetrating the Dao foresees penetrating the world; penetrating the world does not penetrate the Dao. Illuminating the Dao is elevation; penetrating the world—penetrating the world [forgetting the world]—is reverence. Penetrating the Dao, practicing the Dao, is attainment. Penetrating the world, forgetting the world, is wisdom.\"",
      "start_char": 10854,
      "end_char": 12059,
      "start_sentence": 800,
      "end_sentence": 889,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.418842792510986,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\无为清静长生真人至真语录.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "第七十二　问虑 复询：虑者何也？ 答曰：迷世则有心也，悟道则无虑也。 贪争者运万虑也，清善则绝万虑也。 昧则罪无边也，明则福无边也。 无善则常恶也，无恶则常善也。 常恶者积愆也，常善者积德也。 有愆则阴苦也，有德则阳乐也。 世之知利而不知害也，道乃知福而不知贪也。 经云：知不知上，不知知病。 绝虑而尽於物，则至道亲也。 第七十三　问亲 复询：亲者何也？ 答曰：亲者，人问所亲者，名利亲也，伪宝亲也； 物外所亲者，道德亲也，真宝亲也。 伪亲者有名利，财有宠辱也； 有伪宝，则有恶人所妨也。 真亲者有道德，则清平也； 有真宝，则有善人所侵也。 伪益於身，则损其真也。 真益其身，则损於伪也。 经云：名与身孰亲，身与货孰多。 道亲则物疏也。 第七十四　问疏 复询：疏者何也？ 答曰：疏者，厌世则道无疏也，厌利则身无害也，厌贵则身无贱也。 道无疏则通世也，身无害则通利也，身无贱则通贵也。 通世则善归也，通利则福归也。 通贵则德归也。 常善则通灵也，真福则通命也，至德则通天也。 经云：故不可得而亲，不可得而疏。 不疏其道之真，则明其久远也。 第七十五　问远 复询：远者何也？ 答曰：远者，道包久远，天高覆远，地载物远，王大清远。 道则明万古也，天则明万象也，地则生万物也，王则安万民也。 道无所不包也，天无所不盖也，地无所不载也，王无所不容也。 道包则大也，天盖则大也，地载则大也，王容则大也。 《经》云：大曰逝，逝曰远。 道非远真，洽道则近也。 第七十六　问近 复询：近者何也？ 答曰：近者，近有道之身，观无道之身； 近有道之家，观无道之家； 近有道之乡，观无道之乡； 近有道之国，观无道之国； 近有道之天下，观无道之天下。 身孝则报父母之恩也，家善则如许君庞士也，乡行则怜贫爱老也，国清则万民丰足也，天下有道，则天下成熟也。 经云：故以身观身。 明道则真能行也。 第七十七　问行 复询：行者何也？ 答曰：行者，太上所行，天之道也。 天地不言，而暗施其恩，生於万物也。 太上不言，而暗施其德，行於万善也。 天地不言，而恩善应也。 太上不言，而教善通也。 万物成则民富也，万化明则真通也。 民富则国太平也，真通则乐无事也。 民富则各士农工商也，真通则阐太上无为也。 经云：行不言之教。 道无所行，德无所住也。 第七十八　问住 复询：住者何也？ 答曰：住者，居也。 真无情，而形在道也； 伪有情，而身寄世也。 真形则与道交也，伪身则应物交也。 真忘形则道也，身应世则德也。 心有情则迷也，身远世则执也。 有道德则无迷执也，无道德则有迷执也。 真有道有德，则有贤有善也； 伪无道无德，则有愚有恶也。 经云：安其居，乐其俗。 永住太无，则唯然也。 第七十九　问唯 复询：唯者何也？ 答曰：唯者，唯然三界，道显无拘也； 飘然四海，真隐无侣也。 道无拘则阴阳外也，真无侣则碧霄中也。 道体非空非色也，真光不亏不盈也。 达无则出於万物之壳也，通为则阐其万慧之明也。 天大恩若无恩也，积大德若无德，谓之明其天之道也。 经云：夫唯不居，是以不去。 唯乐道而应机，则哀众也。 第八十　问众 复询：众者何也？",
      "translated_text": "**Seventy-Second Question: On Thought**\nOne asked again: \"What is thought?\"\nThe answer: \"In delusion, the world gives rise to the heart-mind; in awakening to the Dao, there is no thought. Those who covet and contend spin myriad thoughts; those who are pure and good sever myriad thoughts. Obscurity brings boundless transgression; clarity brings boundless blessing. Without goodness, one remains ever evil; without evil, one remains ever good. Ever evil accumulates faults; ever good accumulates virtue. Faults bring the suffering of yin; virtue brings the joy of yang. The world knows gain but not harm; the Dao knows blessing but not greed. As the scripture says: *'To know yet to seem not to know is best; not to know yet to claim to know is a flaw.'* Sever thought and exhaust all things, and the supreme Dao draws near.\"\n\n**Seventy-Third Question: On Intimacy**\nOne asked again: \"What is intimacy?\"\nThe answer: \"Intimacy is this: in the world, what people hold close are fame and profit, false treasures. Beyond things, what they hold close are the Dao and virtue, true treasures. False intimacy brings fame and profit, yet with them come favor and disgrace; false treasures invite harm from evil men. True intimacy brings the Dao and virtue, and with them clarity and peace; true treasures invite encroachment from good men. The false benefits the body but harms its truth; the true benefits the body but harms the false. As the scripture says: *'Which is closer, fame or the self? Which is greater, the self or wealth?'* When the Dao is intimate, things grow distant.\"\n\n**Seventy-Fourth Question: On Distance**\nOne asked again: \"What is distance?\"\nThe answer: \"Distance is this: to loathe the world is to find the Dao without distance; to loathe profit is to find the body without harm; to loathe nobility is to find the body without baseness. The Dao without distance connects to the world; the body without harm connects to profit; the body without baseness connects to nobility. Connection to the world brings the return of goodness; connection to profit brings the return of blessing; connection to nobility brings the return of virtue. Ever good, one connects to the numinous; truly blessed, one connects to destiny; supremely virtuous, one connects to heaven. As the scripture says: *'Thus it cannot be made intimate, nor can it be made distant.'* Not distancing oneself from the truth of the Dao, one illuminates its eternity.\"\n\n**Seventy-Fifth Question: On Remoteness**\nOne asked again: \"What is remoteness?\"\nThe answer: \"Remoteness is this: the Dao encompasses eternity; heaven’s height covers all; earth’s bearing sustains all things; the king’s greatness brings clarity to all. The Dao illumines the ages; heaven illumines the myriad forms; earth gives life to the myriad things; the king brings peace to the myriad people. The Dao embraces all; heaven covers all; earth bears all; the king contains all. The Dao’s embrace is vast; heaven’s covering is vast; earth’s bearing is vast; the king’s containment is vast. As the scripture says: *'Greatness means departure; departure means remoteness.'* The Dao is not remote in truth—harmonizing with the Dao brings nearness.\"\n\n**Seventy-Sixth Question: On Nearness**\nOne asked again: \"What is nearness?\"\nThe answer: \"Nearness is this: near the body of one with Dao, observe the body of one without Dao; near the household of one with Dao, observe the household of one without Dao; near the village of one with Dao, observe the village of one without Dao; near the state of one with Dao, observe the state of one without Dao; near the world of one with Dao, observe the world of one without Dao. A filial body repays the kindness of father and mother; a good household is like that of Xu Jun and Pang Shi; a virtuous village pities the poor and cherishes the aged; a clear state brings abundance to the myriad people; when the world possesses the Dao, the world ripens. As the scripture says: *'Thus observe the self through the self.'* Illuminating the Dao, one truly practices it.\"\n\n**Seventy-Seventh Question: On Practice**\nOne asked again: \"What is practice?\"\nThe answer: \"Practice is this: the highest practice is the Dao of heaven. Heaven and earth do not speak, yet silently bestow their grace, giving life to the myriad things. The highest does not speak, yet silently bestows its virtue, practicing the myriad goods. Heaven and earth do not speak, yet their grace and goodness respond. The highest does not speak, yet its teaching of goodness pervades. The myriad things fulfilled, the people prosper; the myriad transformations illuminated, truth pervades. The people prosper, and the state knows great peace; truth pervades, and joy abides in effortlessness. The people prosper, and each attends to scholar, farmer, artisan, merchant; truth pervades, and the highest’s non-action is revealed. As the scripture says: *'Practice the teaching without words.'* The Dao is not practiced anywhere; virtue does not abide anywhere.\"\n\n**Seventy-Eighth Question: On Abiding**\nOne asked again: \"What is abiding?\"\nThe answer: \"Abiding is dwelling. The true has no emotion, yet its form resides in the Dao; the false has emotion, yet its body lodges in the world. The true form interacts with the Dao; the false body interacts with things. Forgetting the true form is the Dao; the body responding to the world is virtue. The heart-mind with emotion is delusion; the body distant from the world is attachment. With the Dao and virtue, there is no delusion or attachment; without the Dao and virtue, there is delusion and attachment. Truly possessing the Dao and virtue, one is worthy and good; falsely lacking the Dao and virtue, one is foolish and evil. As the scripture says: *'At peace in one’s dwelling, content in one’s customs.'* Abiding forever in the great void, one is thus.\"\n\n**Seventy-Ninth Question: On Thusness**\nOne asked again: \"What is thusness?\"\nThe answer: \"Thusness is this: thus in the three realms, the Dao manifests without constraint; drifting through the four seas, the true conceals without companion. The Dao without constraint lies beyond yin and yang; the true without companion dwells in the azure heavens. The body of the Dao is neither empty nor form; the light of the true neither wanes nor waxes. Attaining non-being, one emerges from the shell of the myriad things; penetrating action, one reveals the brightness of the myriad wisdoms. Heaven’s great grace seems without grace; accumulating great virtue seems without virtue—this is called illuminating the Dao of heaven. As the scripture says: *'Only because it does not abide, it is not abandoned.'* Thus delighting in the Dao and responding to mechanism, one pities the multitude.\"\n\n**Eightieth Question: On the Multitude**\nOne asked again: \"What is the multitude?\"",
      "overlap_context": "ing to diminish themselves, securing others—this is called blessing. Petty cunning is foolish and evil; great cunning is worthy and good. The foolish defy heaven; the worthy follow heaven. Defying heaven, the body falls; following heaven, truth ascends. The fallen follow the murky path of yin; the ascended follow the clear path of yang. As the scripture says: *'The people are difficult to govern because of their many schemes.'* The wisdom of spontaneity illuminates the Dao, leaving no concerns.\"",
      "start_char": 12060,
      "end_char": 13319,
      "start_sentence": 890,
      "end_sentence": 976,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.164583444595337,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\无为清静长生真人至真语录.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "答曰：众者，众所明者，爱名爱利，爱是爱非也； 我所昏者，忘名忘利，忘是忘非也。 众爱名则有辱也，我忘名则无辱也。 众爱利则有害也，我忘利则无害也。 众爱是则有非也，我忘是则无非也。 众爱非则有愆也，我忘非则无愆也。 经云：众人昭昭，我独若昏。 无为清静长生真人至真语录竟",
      "translated_text": "The Master replied: \"The multitude is that which the multitude clarifies—cherishing fame, cherishing gain, cherishing right, cherishing wrong. What I obscure is the forgetting of fame, the forgetting of gain, the forgetting of right, the forgetting of wrong. The multitude cherishes fame and thus incurs disgrace; I forget fame and thus know no disgrace. The multitude cherishes gain and thus invites harm; I forget gain and thus suffer no harm. The multitude cherishes right and thus invites wrong; I forget right and thus know no wrong. The multitude cherishes wrong and thus incurs fault; I forget wrong and thus bear no fault. As the scripture says: *'The multitude is bright and clear; I alone seem obscured.'* The Record of the Perfected One of Non-Action, Purity, and Everlasting Life is here concluded.\"",
      "overlap_context": "ne emerges from the shell of the myriad things; penetrating action, one reveals the brightness of the myriad wisdoms. Heaven’s great grace seems without grace; accumulating great virtue seems without virtue—this is called illuminating the Dao of heaven. As the scripture says: *'Only because it does not abide, it is not abandoned.'* Thus delighting in the Dao and responding to mechanism, one pities the multitude.\"\n\n**Eightieth Question: On the Multitude**\nOne asked again: \"What is the multitude?\"",
      "start_char": 13319,
      "end_char": 13451,
      "start_sentence": 977,
      "end_sentence": 984,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 4.135679721832275,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\无为清静长生真人至真语录.txt",
        "category": "正统道藏太玄部"
      }
    }
  ]
}