{
  "source_id": "无能子",
  "source_file": "chunked_daozang\\无能子.json",
  "total_chunks": 17,
  "total_original_chars": 10026,
  "total_translated_chars": 63973,
  "total_translation_time": 328.7324824333191,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\藏外\\无能子.txt",
    "category": "藏外"
  },
  "full_translation": "Preface to the *Wunengzi* by an Anonymous Author\n\nThe Master of Non-ability was a friend of mine who forgot all distinctions of form. In his youth, he was broadly learned yet sparing of desires; in maturity, he delved into the principles of things, exhausting their natures to the utmost of their destinies. During the disorders of Huang Chao, he fled and wandered without fixed abode, enduring cold and hunger with equanimity. In the third year of Guangqi, when the Son of Heaven resided in Baoji and the realm was still beset by warfare, the Master lodged in a cottage of the Jing family in the Left Assistant’s district, concealing his true self. Though the dwelling was humble and he dwelt among the common folk, he remained composed and unperturbed. By day, he often lay abed without sleeping; when he did, he would take up brush and paper to jot down one or two slips of thought. Upon rising, he would tuck them away, never showing them to me.\n\nFrom the mid-spring day of *renshen* to the late-spring day of *jihai*, he filled several dozen scrolls, which he bundled as if they were some work in progress. I secretly obtained them and found them to be mostly records of what he had transmitted or witnessed, or dialogues with his brothers and friends. Their purport was to elucidate the principles of spontaneity, to trace the origins of nature and destiny. Spontaneity is without contrivance; nature and destiny are without desire. Thus, he lightly regarded ritual teachings and set worldly affairs aside.\n\nThose who understand will believe without needing explanation; those who do not—can they be faulted? I have therefore arranged the text into thirty-four sections, compiling them into three fascicles: upper, middle, and lower. This I share only with those who understand. As for the Master’s conduct and whereabouts, they remain hidden within, so I shall not record his name or official rank.\n\n*Wunengzi*, First Fascicle\n*Complete Library of the Four Treasuries*\n\n**The Faults of the Sages, First**\n\nBefore Heaven and Earth divided, there was but a single undifferentiated qi, vast and overflowing. This qi then split into the Two Modes: there was purity and turbidity, lightness and heaviness. The light and pure rose to become yang and Heaven; the heavy and turbid sank to become yin and Earth. Thus, Heaven is firm, strong, and ever in motion; Earth is soft, yielding, and ever at rest—such is the spontaneity of qi.\n\nOnce Heaven and Earth took their places, the qi of yin and yang intermingled, and from this arose the naked creatures, scaled creatures, furred creatures, feathered creatures, and shelled creatures. Man is a naked creature, no different from the scaled, furred, feathered, or shelled—all alike born of the intermingling qi of Heaven and Earth. What difference is there? Yet some claim there is a difference. Is it not man who declares himself distinct from the scaled, feathered, furred, and shelled creatures? Is it not because he can employ thought and speech?\n\nYet from birds and beasts down to the lowliest wriggling things, all love life and shun death, all build nests and dens, all seek food and drink, all bear and rear their young, all guard their kin—just as man loves life and shuns death, builds palaces and houses, seeks clothing and food, bears and rears his sons and daughters, and keeps them for himself. Where is the difference? How can one say they lack thought? And as for speech—from birds and beasts down to the lowliest wriggling things, their cries and calls all have their own sounds. How can one know that among their kind they do not speak? Man, not understanding their sounds, claims they cannot speak. But how can one know that birds and beasts, not understanding human speech, do not likewise claim that man cannot speak? Their cries and calls must be speech. How then can one say they lack language? Thought and speech—man and creatures are one. The only difference lies in form and substance. Yet even among the scaled, furred, feathered, and shelled, forms and substances differ. Is the difference between them and man so singular? Even among men, forms and substances may be alike yet different, different yet alike. How is this different from the varying forms of the four kinds of creatures?\n\nAlas! Heaven and Earth are but the greatest things within the qi of yin and yang. The five kinds of creatures—naked, scaled, furred, feathered, and shelled—are but things born of the qi that harmonizes within these great things, just as rivers and seas contain fish and turtles, and mountains and hills enclose grasses and trees. Thus, in high antiquity, the naked creatures dwelled alongside the scaled, furred, feathered, and shelled, male and female naturally coupling without distinction of husband and wife, father and son, elder and younger brother. They nested in summer and burrowed in winter, without palaces or houses; they ate raw flesh and drank blood, without the food of the hundred grains. They lived as they roamed, died as they fell, without desire to seize or harm, without rites of burial. They followed their nature, fulfilled their Heaven-given truth, without governance or restraint. How simple and pure was their principle! This state endured for long ages.\n\nThen, among the naked creatures, some multiplied their thought and called themselves *man*. They set boundaries to separate themselves from the scaled, furred, feathered, and shelled creatures, and taught one another to sow seeds and eat the hundred grains. Thus arose the use of the plow and hoe. They hewed wood and molded earth to build palaces and houses, thus arose the work of axes and adzes. They established marriage to divide male and female, thus arose the distinctions of husband and wife, father and son, elder and younger brother. They made coffins, shrouds, and grave clothes to bury their dead, thus arose the rites of mourning. They wove nets and snares to catch the scaled, furred, feathered, and shelled creatures, thus arose the taste for meat on the cutting board. Yet though simplicity was lost and emotions stirred, they still contended only in strength and weakness, without restraint.\n\nThen those who multiplied their thought chose one among them to rule the many, calling the one *lord* and the many *subjects*. The one could command the many, but the many could not overstep the one. Thus arose the divisions of lord and subject, the ranks of high and low. The exalted were raised up, the many brought low. Later, they established ranks and emoluments to elevate and demote the many, thus arose the grades of noble and base, the disparities of rich and poor. When desires were fulfilled, those who multiplied their thought were called *sages*. Then the base envied the noble, the poor envied the rich, and the contentious heart of man was born.\n\nThose called sages grew anxious and conferred among themselves: \"At first, they were simple and pure—who called them *man*? We forced the name upon them. Man and creatures were once undivided—who called them *lord* and *subject*? We forced the division. They once took nothing, desired nothing—what were ranks and emoluments? We forced the distinctions of honor and disgrace. Now their truth and purity are lost, their desires and contentious hearts have grown.\" Where contention arises, there is seizure; where there is seizure, there is chaos. What was to be done? Those who multiplied their thought further said, \"We have a method.\" Thus they established the teachings of benevolence, righteousness, loyalty, and trust, and the patterns of ritual and music to restrain them.\n\nThe lord found his subjects oppressive and called it tyranny; subjects encroached upon their lord and called it rebellion. A father who did not love his son was called unkind; a son who did not honor his father was called unfilial. Brothers who did not harmonize were called unfriendly and unbrotherly. Husband and wife who did not unite were called unchaste and disharmonious. Those who acted thus were deemed wrong; those who did not were deemed right. Thus arose the mind that delights in right and shames wrong, and the contentious heart was curbed.\n\nIn later ages, desires grew ever more fervent. Thus they turned their backs on benevolence, righteousness, loyalty, and trust, transgressed ritual and music, and contended all the more. Those called sages, filled with regret, had no choice but to establish punishments and armies to control them. For minor offenses, they applied punishments; for major ones, they waged war. Thus the crimes of fetters, cangues, whips, and floggings, exile and banishment filled the land; the weapons of spears, swords, bows, and arrows filled the world. The disasters of ruined families and lost states stretched on without end; the sufferings of the people—poverty, hardship, and untimely death—spread without cease.\n\nAlas! The creatures of spontaneity did not act thus; it was man who forced the building of palaces and houses, the refinement of food and drink to entice desire, the division of noble and base, high and low to unify contention, the imposition of benevolence, righteousness, ritual, and music to overturn truth, the enactment of punishments and campaigns to destroy life. Thus they pursued the branches and forgot the root, scattered their emotions and harmed their lives, lost in mutual destruction from ancient times to the present. This is the fault of those called sages.\n\n**Illuminating the Root, Second**\n\nWhat is called the *root* is the mind of non-action. The bodily form depends on it to stand. It is constant and never fails—like fire, which can be used to burn but whose heat cannot be taken away; like water, which can be used to moisten but whose wetness cannot be removed. When drawn upon, it is not exhausted; when stored, it does not vanish. When set in motion, it discerns the form of an autumn hair, hears the sound of a mosquito’s wings. When at rest, it does not see mountains, does not hear thunder. Vast, it can embrace Heaven and Earth; minute, it can enter the space between eyebrows. Elusive and indistinct, it comes not, goes not. Subtle and rarefied, it is neither full nor empty. The reclusion of Chao Fu and Xu You, the retreat of Yuan Xian and Zisang—all focused on this root and preserved their integrity alone.\n\nYao passed the throne to Shun, Shun to Yu, Yu to Qi; Tang overthrew Jie, King Wu overthrew Zhou—all set their mechanisms in motion to bring universal salvation. Those who understand this may withdraw when it is time to withdraw, act when it is time to act, responding to things and establishing affairs with boundless impartiality. Those who are benighted chase after desires, follow the ears and eyes, and spend their days in reckless use, unaware and unknowing. Who can illuminate with the light of unimpeded clarity, entrust to the harmony of spontaneity? Then the primal of the nameless appears within the unseen.\n\n**Dispelling Delusion, III**\nThat which is called *xing* is spirit; that which is called *ming* is *qi*. They depend on emptiness and nothingness, arise from spontaneity—like the mutual resonance of ocarina and flute, the harmony of yin and yang. The bodily form is the vessel of *xing* and *ming*, just as fire resides in firewood: without firewood, fire does not burn; without fire, firewood does not glow. Without *xing* and *ming*, the bodily form does not stand; *xing* and *ming* rely on the bodily form to manifest. Thus *xing* and *ming* arise naturally, empty and alive; the bodily form naturally stagnates and dies. That which is naturally alive, though quiescent, is ever alive; that which is naturally dead, though unmoved, is ever dead. Now, people all love life and hate death, yet do not understand the principle of natural life and death. Seeing one who lies unmoved, they grieve, exhausting their natural vitality in striving to preserve what is naturally alive, clinging ever more tightly to what is naturally dead. This is like wishing to sink a feather and float a stone—what delusion could be greater?\n\n**Freedom from Care, IV**\nWhat people most greatly abhor is death—the bodily form lying unmoved. The bodily form, blood, flesh, ears, and eyes cannot be empty and numinous; they are not the instruments of life. Thus, even before it lies unmoved, it is called death. When it moves and hastens, it relies on what is fundamentally undying; it cannot move and hasten on its own. The bodily form is fundamentally dead, so it is not death now. If it is not death now, there is no death. Death is what people most greatly abhor; if there is nothing to fear in the absence of death, why trouble the perfect harmony beyond the bodily form?\n\n**Examining Delusion, V** *(Two Chapters)*\nWhat all under Heaven pursue without cease are wealth and honor, and a fine reputation. By \"wealth and honor,\" they mean sufficiency in things. The extreme of wealth and honor is, at most, to be emperor or king, at least, duke or marquis. Is it not because they wear dragon robes and crowns, dwell in palaces, erect feathered canopies, and have guards clear the way that they are called emperors and kings? Is it not because they don crowns and tassels, ride in carriages with bells and banners, and bear axes and halberds that they are called dukes and marquises? Without the adornments of dragon robes, crowns, palaces, feathered canopies, guards, tassels, carriages, axes, and halberds—what would be left of emperors, kings, dukes, and marquises? Dragon robes, feathered canopies, tassels, axes, banners, and carriages are all things. When things suffice, there is wealth and honor; with wealth and honor, there are emperors, kings, dukes, and marquises. Thus it is said: wealth and honor mean sufficiency in things. Things are what people can create. To create them oneself, then be enslaved by them—this is delusion. They take those who have enough things as wealthy and honorable, those without things as poor and base. Thus they delight in wealth and honor, shame poverty and lowliness. Those who cannot attain their delight will stop at nothing. From ancient times to now, they remain drunk and unawakened—how mighty is the power of things!\n\nAs for a fine reputation, is it not because one is filial at home, loyal in serving superiors, trustworthy with friends, incorruptible with wealth, and capable in affairs? Or because one’s talents and arts are sufficient? These are what the so-called sages esteem to restrain the foolish. Why, then, is one who bears a fine reputation merely a human form? Without form, it is vast as the great void—how could praise or blame touch it? The bodily form is but a sack of blood, a vessel of flesh.\n\nDregs they are—gathered at dawn, dissolved by dusk—what have they to do with a fine reputation? Yet people today, without exception, lose their natural true nature and rush toward it, even resorting to deceit and pretense. Why? The so-called sages have led them astray.\n\nFrom ancient times to now, people have called their kin \"blood relations,\" and thus their affections become fixed. When together, they rejoice; when parted, they long; in sickness, they grieve; in death, they weep. Yet all people under heaven share the same hands, feet, belly, back, ears, eyes, mouth, nose, head, neck, brows, and hair as I do. Why, then, make distinctions? Why speak of \"they\" and \"I\"? The division into \"they\" and \"I\" arises solely from names. What makes others distant is unfamiliarity; what makes kin close is familiarity.\n\nAlas! Hands, feet, belly, back, ears, eyes, mouth, nose, head, neck, brows, and hair—all are complete in every person. Yet when torn apart, each seeks what it calls \"the body,\" and none attains it. Who, then, are the so-called kin? Who are the people of the world? These are but forced distinctions made by names. If one names others with the same name used for kin, then all under heaven become kin. If one treats others with the same familiarity as kin, then all under heaven become kin. Why, then, speak of fixed affections?\n\nThose who lack filial piety and kindness extend them to all under heaven; those who possess them confine them to one family. Before such filial piety and kindness decay, they become a burden of emotion, and kindness itself turns into a fetter. Once decayed, pretense arises, and fathers, sons, and brothers may grow resentful. Zhuangzi said: \"Fish stranded on land moisten each other with their spit—better to forget each other in rivers and lakes.\" How true! Fish forget each other in rivers and lakes; people forget each other in their natural state—each finds its proper place. Thus, those whose affections are fixed do not act as the wise do.\n\n---\n\nThe steelyard and mirror are things shaped by human hands. Yet people, having made them, turn to seek weight from the steelyard and beauty or ugliness from the mirror. Why? The steelyard is impartial because it has no mind; the mirror is clear because it has no mind. If mindless things can be impartial and clear, then those with minds should refine themselves with non-action, settle themselves in emptiness, and embrace the profound and subtle, drifting without direction. I see them enduring with heaven and earth, limitless, merging with the vast qi, untiring—none under heaven can rival them.\n\nWater’s nature is such that when dammed, it clarms; when released, it flows. Rising as clouds, it becomes rain; sinking into earth, it moistens. As rivers and seas, it does not boast of its greatness; in tiny crevices, it feels no shame at its smallness. Dividing into a hundred streams, it does not tire; benefiting the myriad things, it does not refuse. It is the softest of all. Thus Laozi said: \"The soft and weak overcome the hard and strong.\" Those who embody the spirit, embrace emptiness, focus their qi, and attain softness have grasped the primordial of the natural.\n\nWater flows toward the damp; fire moves toward the dry. Clouds follow the dragon; wind follows the tiger—this is the principle of natural resonance. Thus, spirit summons qi, and qi follows spirit, just as this. Knowing the mutual response of the natural and concentrating on the mysterious female to return to the root—one is nearly liberated. Birds fly in the sky; fish swim in the deep—not by technique, but by nature. Birds and fish do not know their ability to fly or swim; if they did and set their minds to it, they would surely fall or drown. It is like a person’s feet running, hands grasping, ears listening, and eyes seeing—these require no practice. When running, grasping, listening, or seeing, responses arise naturally, without thought. If one must think before acting, one becomes exhausted.\n\nThus, those who follow the natural endure and attain constancy; those who cross the vast and empty reach fulfillment. The heart’s natural state is vast emptiness. Today, people allow their hands, feet, ears, and eyes to follow their natural functions in running, grasping, seeing, and hearing, yet when it comes to the heart, they do not let it follow its nature and disturb it. How difficult, then, to attain perfect harmony and empty penetration!\n\n*Wunengzi, Scroll One*\n*From the Imperial Four Treasuries*\n\n**Wunengzi, Scroll Two**\n**King Wen’s Persuasion, Part One**\n\nJiang Ziya was fishing by the Wei River when King Wen of Zhou, preparing for a hunt, divined by milfoil. The oracle declared: *“Neither bear nor brown bear—Heaven sends you a teacher.”* During the hunt, he found Jiang Ziya, and King Wen bowed twice. Yet Jiang Ziya continued fishing, unmoved, while King Wen’s bows persisted. Finally, Jiang Ziya sat cross-legged, his fishing rod slanted, and asked: *“Why have you come?”*\n\nKing Wen replied: *“The Yin government is in chaos, and the people suffer bitterly. I wish to save them and seek a worthy man.”*\n\nJiang Ziya said: *“The Yin government is chaotic of itself; the people suffer of themselves. What has this to do with you? Why do you trouble me, calling me the Lord of the West?”*\n\nKing Wen answered: *“The sage does not hoard his power to cultivate himself alone but exhausts his wisdom to universally aid all things. Is this not so?”*\n\nJiang Ziya said: *“Man, birds, beasts, and crawling insects all float within Heaven and Earth—nothing more than a single qi. The cities, walls, and houses of the world all stand in empty space. If all cities, walls, and houses were destroyed, the emptiness would remain empty. If all men, birds, beasts, and crawling insects were killed, the qi would remain qi. How could the Yin government be in chaos? What do you mean by the people’s suffering? Nevertheless, though cities, walls, and houses need not be destroyed, and the people’s forms need not be killed, I will save them.”* He then agreed to ride with King Wen and return.\n\nTaidian and Hongtian, privately addressing King Wen, said: *“The accumulated virtue and accumulated merit of Gong Liu and Hou Ji have reached you. Your virtue has filled the ancestral line. Now, with two-thirds of the world under your rule, this may be called prosperity. Jiang Ziya is but a fisherman—why do you so humbly defer to him?”*\n\nKing Wen replied: *“The virtue of non-action embraces Heaven and Earth; the virtue of action opens things and accomplishes affairs. When the Yellow Emperor and Yao and Tang were emperors, they sought the virtue of action: the Yellow Emperor visited Guangchengzi on Mount Kongtong, and Yao inquired of Xu You on Mount Ji, yet neither gained so much as a glance. How much less does my virtue compare to that of the Yellow Emperor and Yao, that I should disdain the virtue of non-action?”*\n\nTaidian and Hongtian said: *“By your account, Jiang Ziya truly possesses the virtue of non-action. Why, then, does he follow your actions?”*\n\nKing Wen said: *“Heaven and Earth act through non-action. The sun, moon, and stars move by day and night; rain, dew, frost, and snow fall in autumn and winter; rivers and streams flow without ceasing; grasses and trees grow without end. Thus, non-action allows no obstruction. If obstructed by action, one cannot act without action.”*\n\nJiang Ziya, hearing this, knew that King Wen’s concern for the people was genuine and that he did not seek the Yin throne for gain. Therefore, he ultimately aided him in establishing the Zhou.\n\n**Shouyangzi, Second Discourse**\n\nWhen King Wen passed away and King Wu rose to punish Zhou and overthrow him, Boyi and Shuqi grasped the reins of his horse and remonstrated: *“A father’s death is not yet mourned, yet you raise great affairs and mobilize the masses—this is not filial. As a minister, to slay one’s lord—this is not loyal.”* His attendants sought to strike them down, but King Wu, deeming them righteous, released them.\n\nBoyi and Shuqi then retreated to Mount Shouyang and styled themselves the Shouyangzi. *“In the natural order of the world,”* they said, *“is there any distinction between ruler and subject? Those who fabricate such distinctions to enforce hierarchy call themselves sages, yet they use wisdom to deceive the foolish. To use wisdom to deceive the foolish is delusion. You and I have spoken of this before: within the delusion of ruler and subject, there was the delusion of Yin; within the delusion of Yin, there was the delusion of Xin; within the delusion of Xin, there was the delusion of tyranny and cruelty, all to sate deluded desires. Ji Fa’s actions are likewise driven by desire—desire is delusion. Thus, he seeks delusion through delusion.*\n\n*“In non-action, purity and uprightness align with Heaven’s principle—what place is there for father and son, ruler and subject? In action, craving and desire disorder human nature—what difference is there between filial and unfilial, loyal and disloyal? Now you distort our constant teaching and brandish delusion to justify your deluded weapons, all to chase the hollow name of righteousness. To welcome empty renown with bones destined to rot is like grasping at wind to seize flame. That Ji Fa did not strike you down is your fortune. Had he struck you and gained the name of righteousness, what would your rotting bones have mattered?*\n\n*“When the dragon bares its scales and the phoenix spreads its wings, they must watch for the fisherman and the fowler—how lamentable! They are no friends of mine.”* Thereupon, Boyi and Shuqi fled into Mount Shouyang, and none knew their end. Later generations claimed they starved to death.\n\n---\n\n**Laozi, Third Discourse**\n\nConfucius codified rites and music, clarified ancient institutions, edited the *Book of Songs* and *Book of Documents*, and composed the *Spring and Autumn Annals*, intending to rectify the order of human relations and deter the hearts of rebellious ministers and traitorous sons. He went to inform Lao Dan of this.\n\nLao Dan said: *“To govern a great state is like frying small fish—trample them under the knife, and they fall apart. Since ancient times, sages have created things and established affairs, enticing and stirring human emotions. When human emotions lose their natural state, they prematurely cut short their nature and destiny, leading to endless chaos. Now you further embellish and complicate them, burdening human emotions. When emotions are burdened, they grow weary; when weary, they become deceitful; when deceitful, chaos worsens. This is what is called severing Heaven’s truth to vaunt oneself. Heaven’s calamity will surely befall you.”*\n\nConfucius, alarmed, could not bring himself to stop. Later, he was driven from Wei, his tree felled in Song, starved in Chen and Cai, and besieged in Kuang, wandering in distress, nearly meeting his end.\n\nConfucius turned to Yan Hui and said: *“Did Lao Dan’s words foretell this?”*\n\n---\n\n**Confucius, Fourth Discourse (Two Chapters)**\n\nConfucius was besieged in Kuang for seven days, yet his singing never ceased. Zilu said: *“I have heard that the noble man builds defenses to guard his person, avoiding even a day’s misfortune. Yet you, Master, are a sage, yet you starve in Chen and are besieged in Kuang—why? Yet you sing without pause, showing no sign of worry. Do you have some method?”*\n\nConfucius said: *“Zilu, come and let me tell you. Right and wrong, truth and falsehood—these arise from human judgment. Favor and disfavor, openness and obstruction—these depend on the times. The sun and moon cannot avoid the misfortune of eclipses; sages and men of supreme wisdom cannot alter the patterns of favor and disfavor, openness and obstruction. The noble man can be humane toward others but cannot make others humane toward him; he can be righteous toward others but cannot make others righteous toward him. The siege at Kuang is not Qiu’s fault—Qiu cannot prevent it. Yet what can be besieged is Qiu’s physical form. Qiu, in his essence, is formless in the vast emptiness, emotionless in the boundless void. I do not know why I should worry, so I happen to harmonize with singing.”*\n\nBefore long, the people of Kuang lifted the siege.\n\n---\n\nYuan Xian lived in a humble alley, while Zigong, serving as an envoy to Wei, paraded with a team of four horses, their bridles linked, to visit him. Yuan Xian, clad in tattered robes, said: *“The Master is ill, is he not?”*\n\nZigong said: *“I have heard that to fail in cultivating virtue and righteousness is illness; to lack wealth is poverty. Yuan is poor, not ill.”*\n\nZigong was ashamed of his words and never dared to see Yuan Xian again.\n\nWhen Confucius heard of this, he said: *“Ci has spoken amiss. One constrained by form does not dwell in emptiness; one who does not dwell in emptiness does not think clearly. One whose heart is not pure does not hold fast to integrity. Ci inclines toward arrogance and desire; Yuan inclines toward firmness and clarity. Compared to purity and turbidity, how far apart are they?”*\n\n---\n\n**Fifth (Missing)**\n\n**Fan Li, Sixth Discourse**\n\nFan Li, having aided King Goujian of Yue in destroying Wu and killing Fuchai, conferred with Minister Zhong, saying: *“I have heard that those who scheme in secret will surely suffer calamity in return. The fall of Gusu and the death of Fuchai were brought about by our secret schemes. Moreover, the king’s nature is such that he may share hardship but not joy. Furthermore, to retire once merit is achieved, fame attained, and the body preserved—this is the principle of Heaven. I shall withdraw; will you join me?”*\n\nMinister Zhong replied: *“Heaven and Earth, in their relation to the myriad things, give life in spring and kill in winter. Do the myriad things, slain in winter, bring calamity back upon Heaven and Earth? I have heard that the sage does not prize self-cultivation alone but values the removal of harm and the completion of things. If harm is removed and things are completed, it is acceptable. Thus, the Yellow Emperor slew Chiyou, and Shun banished the Four Villains. Now, I have removed the disorder of Wu and established Yue’s hegemony—this, too, is completing things and removing harm. What calamity could return to me? Moreover, the king, having just destroyed Wu, regards you and me with favor; he will surely treat us from beginning to end. Do not hasten to withdraw.”*\n\nFan Li said: *“Not so. Heaven and Earth have no intent and do not govern themselves—how much less can they govern things? Heaven and Earth are simply Heaven and Earth; the myriad things are simply the myriad things. Spring, in its harmony, gives life of itself; winter, in its cold, kills of itself. It is not that Heaven and Earth cause them to be so. Though the sage has intent, in his application, he embodies [the spontaneity of Heaven and Earth].”*\n\nThe Dao of Heaven and Earth, though without intent, responds when events arise and follows when pressed—yet when events pass, it resists. To remove harm and complete things is without partiality or favor; thus, harm removed brings no misfortune, and things completed bring no blessing. Now, the king, moved by his grudge against Wu, rewards you and me to employ our schemes. You and I, lured by his rewards, scheme against Wu, making the destruction of others our merit and the repayment of his bounty our duty—this is the treachery of men. To claim this as Heaven and Earth’s life and death, the sage’s removal of harm and completion of things—is this not deception?\n\nMinister Zhong did not understand and wavered in doubt, but Fan Li ultimately resigned from Goujian and drifted in a small boat upon the Five Lakes. Soon after, Yue executed Minister Zhong.\n\n---\n\n**Song Yu’s Persuasion, Seventh Chapter**\n\nQu Yuan served Chu as Minister of the Three Clans. King Xiang of Chu lacked virtue, and the sycophant Jin Shang enjoyed favor, leaving the state in disorder. Qu Yuan, grieved, remonstrated with the king, urging him to dismiss Jin Shang. The king refused. Qu Yuan pressed his admonitions to the extreme, but Song Yu stopped him, saying: *“The heart of the noble man is cultivated within himself, not troubled by others. His brilliance is obscured, and his efficacy does not shine before the crowd. When the time comes, he responds to things; when things come, he aids them. He responds to the times without scheming, aids things without claiming merit—thus, his uprightness has no place to return, and resentment has no place to gather. Now, the king indulges in flattery and delights in disorderly governance. The people of Chu all covet Jin Shang’s eminence and follow him like an echo. Yet you, Minister, stand alone, clutching your loyalty and trust, clamoring amidst them. Your words go unheeded, the state remains in chaos—all you do is display their wrong and your right, inviting enmity and angling for disaster.”*\n\nQu Yuan replied: *“I have heard that the noble man, in his dwelling, must practice filial piety and fraternal duty; in office, he must uphold loyalty and trust. If he attains his will, though he die, he lives; if he does not attain his will, though he lives, he is dead. My admonitions will not cease.”* Jin Shang, resenting him, slandered him to the king, who banished him. Qu Yuan wandered the banks of the Xiang, singing and lamenting in sorrow. Song Yu again admonished him: *“From the start, Minister, you stood alone, clutching loyalty and trust, clamoring amidst a throng of sycophants. I, as your minister, have long warned you of the danger in this. You could not heed me—why now this grief? Do you covet rank and emolument, or yearn for the land of the state?”*\n\nQu Yuan said: *“No. I grieve that loyalty and trust go unused, and the state of Chu remains in disorder.”*\n\nSong Yu replied: *“From the start, Minister, you held death as filial piety, fraternal duty, loyalty, and trust—why then this grief? Moreover, the noble man regards his bearing and form as no more his own than borrowed vessels.”*\n\nBeauty cannot make the ugly beautiful, nor can ugliness make beauty ugly. The long cannot be made short, nor the short long. The strong and robust cannot be made weak and frail, nor can the weak and frail be made strong and robust. Illness cannot be dispelled, nor can death be detained. The body seems to be mine, yet I cannot claim it as my own. If even this single form is thus, how can you expect the state of Chu to be governed by you alone? Minister, your delusion is profound indeed.\n\nThe noble man lodges his form in the world, empties his heart to respond to things—without perversity or uprightness, without right or wrong, without good or evil, without merit or guilt. With an empty heart, even Jie, Zhou, Zhi, or Robber Zhi are not guilty; with a full heart, even Yao, Shun, Hou Ji, or Xie are not meritorious. Then how can one distinguish between your loyalty and trust and Jin Shang’s perversity and flattery? If there is no distinction, then loyalty and perversity are one. If there is distinction, then the distinction itself is delusion. Yet you, Minister, have abandoned the real to cling to delusion, relied on yourself to guard against others—before the king banished you, you had already cast yourself aside.\n\nNow you seek loyalty and trust, attain them, yet grieve and cannot cease—this is what is called losing both the real and the delusory heart. I have heard that the superior man either transcends norms, upholds them, or loses them. To empty the heart and distance oneself from action is to transcend norms; to preserve the heart and distinguish right from wrong is to uphold them; to fail in distinction and yet grieve is to lose them. Yuan, failing to transcend, ultimately drowned himself in the Miluo.\n\n**Discourse the Eighth: Han Gaozu and Consort Qi**\nEmperor Gao of Han favored Consort Qi and wished to replace Crown Prince Ying with Prince Ruyi of Zhao. The great ministers could not dissuade him, and Empress Lü grew anxious, seeking counsel from the Marquis of Liu, Zhang Liang. Liang said: “Only extraordinary men can accomplish extraordinary deeds. I have heard that four recluses dwell in the Shangluo Mountains—Xia Huangong, Master Luli, Dongyuangong, and Qili Ji. The late emperor summoned them but could not obtain their service. If the crown prince humbles himself to seek them, they may come and serve as his guests—this would be a great aid.”\n\nEmpress Lü followed Liang’s plan and sent Lü Ze to welcome them. At first, the four were ashamed, but then they said to one another: “Liu Ji is magnanimous and knows how to honor us. Had he sought us in vain, we would have been shamed. Empress Lü is a woman, cruel and ruthless—if her son Ying is not enthroned, she will be pressed to peril. Pressed to peril, she seeks us; if she cannot obtain us, she will bring disaster upon us. Let us assent for now.”\n\nThey came, and one day, accompanied the crown prince to see the emperor. When Gaozu saw them, he asked their names, and all introduced themselves. The emperor was astonished: “I sought you before, and you refused. Why now follow the crown prince?” The four replied: “Your Majesty treats men with disdain, and we, by principle, refuse humiliation. The crown prince honors men, so we come as his guests.” The emperor apologized and, pointing to Consort Qi, said: “The crown prince’s wings are fully grown—he cannot be shaken.”\n\nEmpress Lü was grateful and wished to ennoble them. The four conferred: “Our coming was to avoid disaster, not out of desire. If Ying is enthroned, Ruyi will be demoted; if Lü Zhi prevails, Consort Qi will die. Now we fear disaster for Ying and rejoice in Ruyi’s failure, delight Lü Zhi and grieve Consort Qi—this is to harm others to preserve ourselves, hardly the act of one who would die to fulfill virtue. How can we endure the shame of accepting titles from a woman’s hand to stand in court? Is this not like a thief who sneaks into a house at night, steals gold, and boasts of his wealth?” They returned to Mount Shang, and Empress Lü could not detain them. Zhang Liang also awakened to this and, holding his breath and abstaining from grain, retired.\n\n**Discourse the Ninth: Guangwu and Yan Ling**\nWhen Emperor Guangwu was still obscure, he and Yan Ling were friends as commoners. After ascending the throne, Ling was fishing at Fuchun Shoals. Guangwu, remembering their old friendship and admiring his virtue, personally went to invite him. Ling refused. Guangwu said: “I was once your friend—now I am honored as Son of Heaven, yet you remain a fisherman. I am ashamed for you. I have offices and ranks to ennoble you, gold and jade to enrich you. You could stand above millions, your actions move mountains and rivers, your shouts summon clouds and rain. Your clan would flourish, your descendants inherit marquisates, your palaces be adorned with cinnabar and ochre, your carriages and horses resplendent, your robes and food exquisite. You would feast amid bells and drums, songs and dances, delighting in this life, your name enduring for ten thousand generations. How does this compare to dangling bait all day, sunk in obscurity? Judge the rise and fall, honor and disgrace—can you not follow me?”\n\nLing smiled and said: “When we first befriended each other, you cultivated your will, delighted in poverty and lowliness—there seemed something worthy in you. Now you boast and bewilder, deluding the foolish. The world within the four seas has always been vast—of its ten parts, mountains, rivers, and seas occupy half, barbarians and tribes another three, and the Central States but one or two. Yet rebellion, invasion, conquest, and war never cease. The Son of Heaven’s nobility lies within this one or two parts, amid conquest and war—this is self-aggrandizement. What is called noble and exalted is but indulging joy and anger, monopolizing life and death within this one or two parts; selecting timber to expand palaces, amassing silks and treasures to adorn carriages and robes; slaughtering cattle and sheep, planting grains to refine food and drink; gathering beauties, striking metal and stone to please the eyes and ears. Desires unfulfilled, old age arrives, and death—plump flesh feeds ants, rotten bones sink into the earth. Commoner or empress, all are the same. What nobility is there in being Son of Heaven?\n\nWhat you call ennobling me with offices and ranks—I understand. Since ancient times, the titles of emperor, king, duke, minister, and grandee have all been forced names invented by sages to rank high and low, deluding the foolish. Moreover, your present self as Son of Heaven is no different from your former self as a commoner. Though others now see you as an emperor’s son, how do you see yourself differently from before? This is but using forced names to delude me, making you rejoice and boast. Now you wish to delude me further with the forced names of duke, minister, and grandee—are you not making a fool of me? If I delight in these, I could force names myself and call myself duke, minister, or grandee—why need your forced names?\n\nYou must say offices and ranks enrich and ennoble the self. But offices and ranks are forced names—if they come from me, I have the reality of wealth and nobility; if not from me, what wealth and nobility are there? What is called wealth, nobility, office, and rank is but wearing a tall hat and jade pendants, standing before the hall and sitting behind it, dwelling in grand mansions, donning fine robes—nothing more.”\n\nThe weariness of strings and flutes, the surfeit of rich meats and fine delicacies—these are but your enticements to delude me, nothing more than objects to sate desire. Chariots and horses spare one’s labor, yet a fine steed or a borrowed nag serve the same end. Houses and halls shelter from wind and rain, yet vermilion halls or thatched huts differ not in purpose. Garments cover the body, whether silk brocade or coarse cloth. Food fills the belly, whether rich fare or wild greens. Moreover, I drift in the Great Void, savoring the Supreme Harmony, where movement and stillness arise not, and yin and yang flow as one. Now, having forgotten my own name and surrendered my conduct, I cast my pole and cast my line, adrift as one sojourning—why then should I shackle my limbs, vex my spirit, covet forced names, or glut myself with vain desires?\n\nAnd how does Wang Mang’s usurpation of the realm differ from yours? Both seek only to be revered by the Middle Kingdom—can this be called care for the world? Now you wage war without end, slaughter without limit, exhausting the lives of men to satisfy your desires—even a man of benevolence could not bear to speak of it. Yet you feel no shame, and instead shame me for my fishing? Emperor Guangwu awakened to this and dared not treat me as a subject.\n\n*Saying the Tenth of Sun Deng*\n\nMaster Sun Deng dwelled on Su Gate Mountain. Xi Kang, admiring him, went to visit and said: “I have heard that the mayfly cannot match the tortoise’s longevity, nor the sparrow vie with the swan’s flight. My heart is truly unworthy to receive true instruction, yet the illumination of sun and moon knows no bounds, and the nourishment of rain and dew makes no distinction between smooth and rugged paths. Though orchid and mugwort grow side by side, I wish, Master, that in your governance of body and fate, you might extend your grace to me, that I may transcend the bounded and roam the boundless.”\n\nSun Deng remained silent for a long while before answering: “That which is dim and distant, yet possesses essence—is it truly essence? That which is vast and pure, yet possesses spirit—is it truly spirit? Essence and spirit are most real; separate them, and they vanish; retain them, and they do not abide. Who speaks of governing fate? Who speaks of cultivating the body? Who speaks of the bounded? Who speaks of the boundless? Yet within the formless and traceless, the continuous unfolds, emerging and entering without trace, becoming the root of heaven and earth. He who knows this is enlightened; he who attains it is revered. But all you have spoken has not glimpsed its gate. I have heard from the old masters: ‘The skilled merchant conceals his treasure as if empty; the gentleman of great virtue appears foolish.’ Moreover, the clam is split for its pearl, the elephant for its tusks, the orchid is burned for its fragrance, and the kingfisher is slain for its plumage—these are things even the common man knows.\n\nYou possess a talent for ornate speech but lack the subtlety to conceal it, wielding your bright torch to dazzle the vast heavens—this is what is detested. I once read your *Letter Breaking Off Relations with Shan Tao*, in which the two great impossibilities and seven unbearable burdens were all but boasts of your own worth and criticisms of others—precisely what the age despises. He who is empty within is not disturbed by the marketplace; he who is full of desire finds no peace in the mountains. Service cannot wrest your passions from you, nor can reclusion perfect your harmony. To serve is to be burdened; not to serve is to be done. Yet you further sever ties with others and amplify your boasts and criticisms, clamoring in the dust of the world while seeking to fathom eternal life—this is like fleeing one’s shadow while running toward the sun. How could you be worthy to hear my instruction?”\n\nKang, awakened as if from a dream, was later executed by the law. *Wunengzi*, Scroll the Middle. *The Complete Library of the Four Treasuries*, *Wunengzi*, Scroll the Lower. \"First Reply to Tong’s Inquiry.\"\n\nWunengzi was poor, and his nephews—his elder brother’s sons—were cold and hungry, their sighs and lamentations following him always. One day, his nephew Tong said to Wunengzi: “For years now, we have sighed from cold and lamented hunger. At night, we often dream of official salaries and abundance—of carriages and horses, gold and silk. In dreams, we are joyful; upon waking, we are sorrowful. How can we secure what is so easily attained in dreams?”\n\nWunengzi said: “Daytime sorrow and nighttime joy are equal—why must you exchange one for the other?”\n\nTong said: “Nighttime joy is but a dream.”\n\nWunengzi said: “In dreams, one dwells in houses, rides carriages and horses, wears robes and sashes, takes food and drink, delights in wives and children, loathes enemies, and experiences sorrow, joy, pleasure, and anger—is this truly different from what one desires, possesses, and does while awake?”\n\nTong said: “There is no difference.”\n\nWunengzi said: “If there is no difference, then how do you know that what you do in dreams is dreaming, and what you do while awake is not dreaming? Moreover, a human life spans a hundred years, of which half is day and half is night—half sorrow, half joy. Why then should you complain? Guard the emptiness within, and focus your spirit.”\n\nThe constant is such that kings and marquises cannot make it noble, servants and attendants cannot make it base; jade and silk, sons and daughters cannot make it wealthy, coarse gruel and tattered garments cannot make it poor—thus sorrow and joy have no place within it. That which moves through emotion and attaches to form is merely responding to things. Things are what we call the instruments of wealth and honor. Form and things are the root of decay and ruin. Emotion responds to them, and sorrow and joy become impermanent. With impermanent emotion entangling the root of decay and ruin, waking is still dreaming, a hundred years is but a single night. Can you guard the emptiness within and focus your spirit? If you do not know the constant, how can you understand hunger and cold, wealth and honor? If you move through emotion and attach to form, then day and night, waking and dreaming are all dreams. Ponder this well.\n\n*Answer to Huayangzi’s Question, Second Chapter*\n\nWunengzi’s friend Huayangzi, pressed by his acquaintances to take office, was beset by doubt and asked Wunengzi: “I have long wished to study the mind of no-mind. To serve would violate this mind, yet not to serve would offend those who know me—what can be done?”\n\nWunengzi said: “The mind of no-mind cannot be studied. If you are not at ease with serving or not serving, your doubts run deep—this is like leading a blind man to the edge of a pit and instructing him to go forward. The man of non-action does nothing he ought not do; the man of action refrains from what he ought not do.”\n\nThus, utmost substance aligns with *knowing the constant*; utmost impartiality approaches *non-action*—for at its root, it is desireless and selfless. To desire within is to be a fisherman, woodcutter, farmer, or herdsman—this is having a mind. To be desireless within is to wear the imperial chariot’s robes and the marquis’ garments—this is having no mind. Therefore, the sage dwells where it is fitting to dwell, acts where it is fitting to act. When principle rests in solitary refinement, Xu You and Shan Juan think nothing of being common men. When circumstances favor universal salvation, Yao and Shun do not refuse to be emperors. Their *no-mind* is one and the same.\n\nYao and Shun, while on the throne, did not value their own persons with the nobility of the Son of Heaven—thus they governed the world with ease, merely draping their robes. When Zhu and Jun proved unworthy, they passed the throne to Shun, and Shun to Yu, casting off their sons like warts or tumors, discarding the world like spittle. For ten thousand generations, the world has cherished the memory of the Duke of Zhou, son of King Wen and brother of King Wu—how deeply his virtue was known! Yet when King Cheng was alive, the circumstances did not favor his own rule, so he did not become emperor. When the situation called for a regency, he did not dare refuse—thus preserving the Zhou’s sacrifices and saving its people. His towering achievements and virtue were no less than theirs. All these acted without desire within yet accomplished all things.\n\nIf you can grasp this, even if you chase chickens and dogs in the butcher’s market or seize banners and slay generals between the battle lines, it is permissible—how much more so, then, serving in office?\n\n*Answer to Yuzhongzi’s Question, Third Chapter*\n\n*The Fish’s Discourse, Fourth Chapter*\n\nWunengzi’s heart befriended Yuzhongzi, who suffered from heartache and sought medicine from him. Wunengzi asked, “What ails you?”\n“Pain,” he replied.\n“Where is the pain?”\n“In the heart.”\n“Where is the heart?”\nYuzhongzi’s illness then abated. Wunengzi said, “This man may be called one who has grasped the true essence of Heaven, whose spirit-light remains undimmed.”\n\nThe Yellow River has a Dragon Gate, carved by Yu in ancient Jin. The cascading waters plunge dozens of ren, their roar like thunder. Within a single day’s journey, the river’s great fish gather in spring, thronging below. Those that strain upward and ascend the gate transform into dragons, then ride the clouds and drag the rain.\n\nThe small fish of the river shallows, seeing them, said to one another, “They too are fish—yet how surpassing their transformation! How can they compare to us, who drift listlessly in the shallows or hide timidly in our holes?”\nOne among them said, “You are deluded by your own thoughts. Of the ten thousand things within Heaven and Earth that receive form, each is apportioned size and measure in accord with its kind. As their forms suffice, so do their allotments—each finds its proper place. Those who transform do so with the river’s timing: when waves surge, they rise with them; when waters calm, they rest in peace. Their wills align, their strength merges, and they move or settle without conflict. Yet when they conceive the desire to change, they throng in envy, struggle against the torrent, and rage in exhaustion—then come clouds, then comes rain. But clouds and rain arise from the mutual resonance of steaming, moistening qi—what has that to do with them? If they harbored intent amid clouds and rain, they would sometimes fail. Without intent, they respond naturally—what merit is there in that? Their horns crown their heads, their legs support their bellies, just as my fins and scales do. My fins and scales guard me, while their horns and legs propel them upward—have I not also followed the Way? Should I resent my shallows for lacking contention, my holes for lacking peril, or the fact that men do not know me and no harm befalls me, and thus abandon the ease of my fins and scales for the toil of horns, legs, and clouds and rain?”\n\n*The Quail’s Discourse, Fifth Chapter*\n\nA quail encountered a snake and pecked at it. The snake said, “All in the world call you poisonous. Poison is an evil name—you bear this evil name because you eat me. If you did not eat me, you would be without poison, and the evil name would vanish.”\nThe quail laughed and said, “Are you not poisonous to the world? To call me poison is deceit. You poison the world by deliberately biting people. I resent your biting, so I eat you as punishment. The world knows I can punish you, so they keep me to guard against you. They also know your poison clings to my feathers, limbs, and body, so they use me to kill. My poison is your poison. I detest evil and thus bear its name—yet it is men who kill. It is like a man wielding a weapon to kill: is the weapon at fault, or the man?”\n\nThen it is clearly not my poison. It is also clear why the world keeps me and not you. I have no intention to poison people, yet I am named for detesting evil and thus am used by men—this is how I preserve my life. To preserve life and willingly bear an evil name is no evil name at all. You, with your deliberate poison, lurk in the grasses and thickets, lying in wait to satisfy yourself at others’ expense. Now that you have met me, it is Heaven’s will—yet you still seek sophistry to escape? The snake could not reply, and the quail ate it.\n\nHow can insects possess intention—let alone men?\n\n**Sixth Chapter: Answering Lu’s Questions** *(Two Sections)*\n\nWu Nengzi’s nephew Lu came to study under him. Wu Nengzi said, “What do you seek to learn?”\nLu replied, “I wish to learn conduct and learning.”\nWu Nengzi said, “I do not know how to teach conduct or learning. Yet in the former records, there is mention of the sage—I have occasionally observed it. His words say: *Conduct is action—acting upon what the heart deems good. Learning is ornament—adorning the goodness of one’s actions.*\n\nMourning is rooted in sorrow—sincere grief is conduct; the hempen garments and sacrificial vessels are ornament. Ritual is rooted in reverence—reverent action is conduct; the bowing, rising, yielding, and deferring are ornament. Music is rooted in harmony—harmonious action is conduct; the clay flutes, silk strings, and bamboo pipes are ornament.\n\nOrnament arises from conduct, conduct from the heart, and the heart from nature. If not natural, the heart stirs; when the heart stirs, conduct weakens; when conduct weakens, ornament becomes excessive; when ornament is excessive, falsehood arises; when falsehood arises, chaos follows—and this is why the sage cannot save it.\n\nOne who grasps the root does not seek the branches; one who focuses on the source does not chase the stream. If you can realize the absence of intention and return to nature, then before there were sages and above there was no Mysterious Heaven, conduct and ornament already existed within the unlearned.”\n\nAnother day, Lu asked again, “I often brood over what I have not attained and grieve, or lament what has already passed. When I drink wine and become drunk, I am blissfully unaware. Now, however, I cannot forget the wine.”\n\nWu Nengzi said, “Your grief and sorrow—do they take shape externally or arise from the heart?”\nLu said, “From the heart. Can they be seen?”\nWu Nengzi said, “What cannot be seen is where grief and sorrow are born. If even the source of grief and sorrow cannot be seen, where do they reside? If grief and sorrow have no residence, then who would you entrust with what you have not attained or what has already passed? Now, you follow and indulge in grief and sorrow—this is like trying to bind the wind or seize a shadow.\n\nYou have no residence for grief and sorrow, yet you savor the bliss of wine and cannot find contentment within, instead becoming steeped in fermentation like a brewing vessel.”\n\n**Seventh Chapter** *(Missing)*\n\n**Eighth Chapter: Ji’s Observations** *(Three Sections)*\n\nIn the marketplace of Qin, there was a conjurer who could plunge his hands and feet into boiling oil and searing cauldrons without harm. The cauldrons could not damage him, and the conjurer smiled. Wu Nengzi summoned him and asked how this was possible. The conjurer replied, “I learned this art from my master. The technique can repel the heat of fire, but the key lies in this: when gazing upon the searing cauldron, one must first forget the body—hands and feet are but withered branches. Only after forgetting the withered branches of the body does the technique follow. Fear disrupts the technique; this is how I mastered it.”\n\nWu Nengzi turned to his disciples and said, “Take heed, my students: when the body is forgotten, even a conjurer can withstand the searing cauldron. How much more so for one of supreme virtue?”\n\nWu Nengzi lodged at the home of a villager named Jing in Qin. One night, an owl hooted in a tree on the property. Jing’s face darkened with worry, and he prepared to shoot it down. Wu Nengzi stopped him. Jing said, “The owl is an ominous bird. When misfortune is about to befall a household, the owl comes to cry out. If we kill it, perhaps we can avert disaster.”\n\nWu Nengzi replied, “If a household meets misfortune because of the owl’s cry, then the owl is to blame. But if the owl is ominous, killing it will not undo the misfortune that has already begun. If it cries before misfortune strikes, is it not a loyal warning to man? Misfortune does not originate with the owl; to kill it would be to harm loyalty. Moreover, we who call ourselves human, along with the furred and feathered creatures, all arise from the impartial qi of Heaven and Earth. Some have horizontal eyes and square feet, some soar in emptiness, some tread upon the solid—these differences arise by chance, following the purity or turbidity, the thickness or thinness of qi, taking form naturally. They are not governed by love or hate. Who appointed the owl to preside over misfortune? Who bestowed the name ‘ominous’ upon it? Did Heaven and Earth declare it so? Did the owl declare itself so? Heaven and Earth do not speak, nor does the owl. Why must it be ominous? If the owl’s ominous reputation has no clear origin, then the five-colored bird called the phoenix is not necessarily auspicious, and the owl is not necessarily ominous. Your household will not meet misfortune.”\n\nAmong the Fan clan, there was a handsome man of thirty. Sometimes he let his hair loose and ran wildly; other times he sat motionless all day, saying nothing. When he did speak, he called sheep horses and mountains rivers. Whatever he named, he misnamed. His family and neighbors called him mad but did not blame him. Wu Nengzi also called him mad. One day, they met in a thicket. Wu Nengzi approached and sighed, “A fine man in his prime, so robust—what a pity his affliction is so severe.”\n\nThe madman slowly replied, “I am not afflicted.”\nWu Nengzi was startled. “You disregard proper attire, your conduct is erratic, you misname all things, and you forget the rites of home and village—this is madness. How can you say you are not afflicted?”\n\nThe madman said, “Wearing proper attire, conducting oneself with decorum, loving one’s family, and respecting one’s village—are these natural to me? Long ago, there were those who fabricated texts and called them rites, compelling people to practice them until they became ingrained. Now, thin wine is mistaken for rich brew. Those who recognize this and revert are deemed ignorant and called mad. Moreover, the names of all things—are they naturally fixed? That which is clear and above is called ‘Heaven’; that which is yellow and below is called ‘Earth.’ That which illuminates the day is called ‘sun’; that which illuminates the night is called ‘moon.’ Wind, clouds, rain, dew, mist, frost, snow; mountains, rivers, seas, grasses, trees, birds, beasts; Hua and Xia, the frontiers, emperors, kings, dukes, and marquises; scholars, farmers, artisans, merchants, servants, and slaves; right and wrong, good and evil, deviance and uprightness, honor and disgrace—all these are forced names fabricated by those who came before. People have grown accustomed to them and no longer see their arbitrariness, so they guard them and dare not alter them. If the ancients had called that which is clear and above ‘Earth’ and that which is yellow and below ‘Heaven,’ or if they had named the illuminator of day ‘moon’ and the illuminator of night ‘sun,’ we would now guard those names just as rigidly. Names are imposed by man. I, too, am a man.”\n\nThose people imposed names upon us—why then can we not do the same? Thus, in hats and robes, in rising and resting, I may choose as I please; in the myriad forms of things, I may name them as I will. Whether I am mad or not, I myself do not even know—how much less do they, who do not know me, deserve to call me mad? Chapters Nine and Ten [missing].\n\n**Rooting the Foundation, Chapter Eleven** [Four chapters in total]\n\nThe five weapons are for killing men; nets and snares are for capturing birds, beasts, insects, and fish. The sages created them, and thereafter men could kill one another and also take birds, beasts, fish, and insects. Once they knew what could be killed and what could be taken, punishments for killing men and prohibitions for mountains and marshes were established.\n\nIn later, degenerate ages, men could no longer protect father and son, elder and younger brother; birds, beasts, fish, and insects had no leisure to breed; fawns and leviathans vanished. Laws and decrees multiplied yet could not be enforced—all because the five weapons and nets had taught them [how to kill and take].\n\nCan those who created these things then restrain their own power?\n\nCoffins and outer coffins serve the dead to an extreme degree, yet the craftsman’s heart takes no joy in aiding the dead—he is compelled by profit. Hoping for daily sales, he rejoices in death; his joy in death is not hatred for the dead—he is compelled by profit.\n\nPhysicians delight in illness, hoping for certain cures; they take no joy in saving the sick, nor do they feel gratitude toward them—they are driven by profit. Coffins and physicians both harbor the hope of aiding the dead or curing the sick, rejoicing in death or recovery, yet they harbor no love or hate; each merely fulfills its own desire. Thus, the benevolence of non-action extends throughout the world. The profit of coffins and physicians lies solely in the interval between aiding the dead and curing the sick.\n\nHorns that gore, hooves that trample, snake heads, scorpion tails—all employ their strengths. Discern their use, and one may guard against and control them. Thus, those who employ their strengths are not as good as those who have no use.\n\nThe worm that eats mulberry leaves spins silk from its gut—this is called the silkworm. When it spins silk to encase itself, it is called a cocoon. The cocoon lies dormant and transforms, then emerges as a moth. Its endowment is such by nature, just as the fetus of a beast or the egg of a bird—neither is of my doing.\n\nThe wise know that its silk can be reeled and woven. Thus, they boil it, reel the silk, work the loom and shuttle to weave it, stretch it into cloth, and make it into garments. The silkworm was to become a moth, not to provide clothing for man, nor did it delight in being boiled. What boils it is the burden of its silk; those who boil it do not hate the silkworm—they are bound by profit.\n\nThe fetus of a beast, the egg of a bird, the cocoon of a silkworm—all are their natural endowments. Yet the silkworm’s endowment is silk alone, and silk must be boiled—this seems unfortunate. Unfortunate, yet it seems fated. Thus, the man of non-action harbors no fortune, no misfortune—what fate is there?\n\nGood actions do not necessarily bring blessing; evil does not necessarily bring calamity. Some are constrained by fate. Therefore, the sage values non-action.\n\nShow an anthill or a well-frog a mountain of tigers and leopards or a sea of whales and leviathans, and it will surely doubt, so familiar is it with what it sees. Tell a man entangled in desires and worldly affairs of the principle of non-action, and he will surely be confused, so deeply has he lodged in habit.\n\nThus, a father cannot pass it to his son, an elder brother cannot pass it to his younger brother. Sunk in desires, they proceed to death, returning to their origin without having truly lived—throughout the world, not a single one.\n\nAlas! Non-action lies within me; desires lie within me. Non-action brings stillness; desires bring activity. Stillness brings joy; activity brings sorrow.\n\nThat ordinary men are confused and can never be made to understand is because habit has become their malady. The enlightened turn away from habit.\n\nChapters Twelve, Thirteen, and Fourteen [missing].\n\n*Wu Neng Zi, Scroll the Lower*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "无能子原序 无能子余忘形友也 少博学寡欲长于穷理尽性以至于命黄巢乱避地流转不常所处冻馁淡如也 光启三年天子在褒四方犹兵旡能子寓于左辅景氏民舍自晦也 民舍之陋杂处其间循循如也 昼好卧不寐卧则笔札一二兴则懐之而不余示自仲春壬申至季春己亥盈数十卷而囊之似有所着者余窃得之多记所传所见或尝与昆弟朋友问答之言其防归于明自然之理极性命之端自然旡作性命旡欲是以略礼教而外世务焉 知之者不待喻而信不知者能旡罪乎 余因析为品目凡三十四篇编上中下三卷自与知之者共之尔余盖具审旡能子行止中藏故不述其姓名防宦焉 钦定四库全书 无能子卷上",
      "translated_text": "Preface to the *Wunengzi* by an Anonymous Author\n\nThe Master of Non-ability was a friend of mine who forgot all distinctions of form. In his youth, he was broadly learned yet sparing of desires; in maturity, he delved into the principles of things, exhausting their natures to the utmost of their destinies. During the disorders of Huang Chao, he fled and wandered without fixed abode, enduring cold and hunger with equanimity. In the third year of Guangqi, when the Son of Heaven resided in Baoji and the realm was still beset by warfare, the Master lodged in a cottage of the Jing family in the Left Assistant’s district, concealing his true self. Though the dwelling was humble and he dwelt among the common folk, he remained composed and unperturbed. By day, he often lay abed without sleeping; when he did, he would take up brush and paper to jot down one or two slips of thought. Upon rising, he would tuck them away, never showing them to me.\n\nFrom the mid-spring day of *renshen* to the late-spring day of *jihai*, he filled several dozen scrolls, which he bundled as if they were some work in progress. I secretly obtained them and found them to be mostly records of what he had transmitted or witnessed, or dialogues with his brothers and friends. Their purport was to elucidate the principles of spontaneity, to trace the origins of nature and destiny. Spontaneity is without contrivance; nature and destiny are without desire. Thus, he lightly regarded ritual teachings and set worldly affairs aside.\n\nThose who understand will believe without needing explanation; those who do not—can they be faulted? I have therefore arranged the text into thirty-four sections, compiling them into three fascicles: upper, middle, and lower. This I share only with those who understand. As for the Master’s conduct and whereabouts, they remain hidden within, so I shall not record his name or official rank.\n\n*Wunengzi*, First Fascicle\n*Complete Library of the Four Treasuries*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 264,
      "start_sentence": 0,
      "end_sentence": 9,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.069793701171875,
      "metadata": {
        "source_file": "dao\\藏外\\无能子.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "圣过第一 天地未分混沌一炁一炁充溢分为二仪有清浊焉 有轻重焉 轻清者上为阳为天重浊者下为阴为地矣 天则刚健而动地则柔顺而静炁之自然也 天地既位阴阳炁交于是祼虫鳞虫毛虫羽虫甲虫生焉 人者祼虫也 与夫鳞毛羽甲虫俱焉 同生天地交炁而已无所异也 或谓有所异者岂非乎 人自谓异于鳞羽毛甲诸虫者岂非乎 能用智虑邪言语邪夫自鸟兽迨乎 蠢蠕皆好生避死营其巢穴谋其饮啄生育乳养其而防之与人之好生避死营其宫室谋其衣食生育乳养其男女而私之无所异也 何可谓之无智虑也 邪夫自鸟兽迨乎 蠢蠕者号鸣啅噪皆有其音安知其族之中非语言邪人以不喻其音而谓其不能言又安知乎 鸟兽不喻人言亦谓人不能语言邪则其号鸣啅噪之音必语言尔又何可谓之不能语言邪智虑语言人与虫一也 所以异者形质尔夫鳞毛羽甲中形质亦有不同者岂特止与人不同邪人之中形质亦有同而异者异而同者岂特止与四虫之形质异也 嗟乎 天与地阴阳气中之巨物尔祼鳞羽毛甲五灵因巨物合和之炁又物于巨物之内亦犹江海之含鱼鳖山陵之包草木尔所以太古时祼虫与鳞毛羽甲杂处雌雄牝牡自然相合无男女夫妇之别父子兄弟之序夏巢冬穴无宫室之制茹毛饮血旡百谷之食生自驰死自仆旡夺害之心无瘗藏之事任其自然遂其天真无所司牧蒙蒙淳淳其理也 居且久矣 无何祼虫中繁其智虑者其名曰人以法限鳞毛羽甲诸虫又相教播种以食百谷于是有耒耜之用构木合土以建宫室于是有斤斧之功设婚嫁以析雌雄牝牡于是有夫妇之别父子兄弟之序为棺椁衣衾以瘗藏其死于是有防之仪结罝罘网罗以取鳞毛羽甲诸虫于是有刀俎之味蒙淳以之散情意以之作然犹自强自弱无所制焉 繁其智虑者又于其中择一以统众名一为君名众为臣一可役众众不得凌一于是有君臣之分尊卑之节尊者隆众者同降及后世又设爵禄以升降其众于是有贵贱之等用其物贫富之差得其欲乃谓繁智虑者为圣人既而贱慕贵贫慕富而人之争心生焉 谓之圣人者忧之相与谋曰彼始蒙蒙淳淳孰谓之人吾强名之曰人人虫乃分彼始无卑无尊孰谓之君臣吾强分之乃君乃臣彼始无取无欲何谓爵禄吾强品之乃荣乃辱今则醨真淳厚嗜欲而包争心矣 争则夺夺则乱将如之何智虑愈繁者曰吾有术焉 于是立仁义忠信之教礼乐之章以拘之君苦其臣曰苛臣侵其君曰叛父不爱子曰不慈子不尊父曰不孝兄弟不相顺为不友不悌夫妇不相一为不贞不和为之者为非不为之者为是是则荣非则辱于是乐是耻非之心生焉 而争心抑焉 降及后代嗜欲愈炽于是背仁义忠信逾礼乐而争之谓之圣人者悔之不得已乃设刑法与兵以制之小则刑之大则兵之于是缧绁桎梏鞭笞流窜之罪充于国戈鋋弓矢之伐充于天下覆家亡国之祸绵绵不绝生民困穷夭折之苦漫漫不止嗟乎 自然而虫之不自然而人之强立宫室饮食以诱其欲强分贵贱尊卑以一其争强为仁义礼乐以倾其真强行刑法征伐以残其生俾逐其末而忘其本纷其情而伐其命迷迷相死古今不复谓之圣人者之过也 明本第二 夫所谓本者无为之为心也 形骸依之以立也 其为常而不殆也 如火之可用以焚不可夺其炎也 如水之可用以润不可夺其湿也 取之不有藏之不无动之则察秋毫之形审蚊蚋之音静之则不见丘山不闻雷霆大之可以包天壤细之可以入眉惚惚恍恍不来不徃希夷希夷不盈不巢由之园绮之遁专其根而独善也",
      "translated_text": "**The Faults of the Sages, First**\n\nBefore Heaven and Earth divided, there was but a single undifferentiated qi, vast and overflowing. This qi then split into the Two Modes: there was purity and turbidity, lightness and heaviness. The light and pure rose to become yang and Heaven; the heavy and turbid sank to become yin and Earth. Thus, Heaven is firm, strong, and ever in motion; Earth is soft, yielding, and ever at rest—such is the spontaneity of qi.\n\nOnce Heaven and Earth took their places, the qi of yin and yang intermingled, and from this arose the naked creatures, scaled creatures, furred creatures, feathered creatures, and shelled creatures. Man is a naked creature, no different from the scaled, furred, feathered, or shelled—all alike born of the intermingling qi of Heaven and Earth. What difference is there? Yet some claim there is a difference. Is it not man who declares himself distinct from the scaled, feathered, furred, and shelled creatures? Is it not because he can employ thought and speech?\n\nYet from birds and beasts down to the lowliest wriggling things, all love life and shun death, all build nests and dens, all seek food and drink, all bear and rear their young, all guard their kin—just as man loves life and shuns death, builds palaces and houses, seeks clothing and food, bears and rears his sons and daughters, and keeps them for himself. Where is the difference? How can one say they lack thought? And as for speech—from birds and beasts down to the lowliest wriggling things, their cries and calls all have their own sounds. How can one know that among their kind they do not speak? Man, not understanding their sounds, claims they cannot speak. But how can one know that birds and beasts, not understanding human speech, do not likewise claim that man cannot speak? Their cries and calls must be speech. How then can one say they lack language? Thought and speech—man and creatures are one. The only difference lies in form and substance. Yet even among the scaled, furred, feathered, and shelled, forms and substances differ. Is the difference between them and man so singular? Even among men, forms and substances may be alike yet different, different yet alike. How is this different from the varying forms of the four kinds of creatures?\n\nAlas! Heaven and Earth are but the greatest things within the qi of yin and yang. The five kinds of creatures—naked, scaled, furred, feathered, and shelled—are but things born of the qi that harmonizes within these great things, just as rivers and seas contain fish and turtles, and mountains and hills enclose grasses and trees. Thus, in high antiquity, the naked creatures dwelled alongside the scaled, furred, feathered, and shelled, male and female naturally coupling without distinction of husband and wife, father and son, elder and younger brother. They nested in summer and burrowed in winter, without palaces or houses; they ate raw flesh and drank blood, without the food of the hundred grains. They lived as they roamed, died as they fell, without desire to seize or harm, without rites of burial. They followed their nature, fulfilled their Heaven-given truth, without governance or restraint. How simple and pure was their principle! This state endured for long ages.\n\nThen, among the naked creatures, some multiplied their thought and called themselves *man*. They set boundaries to separate themselves from the scaled, furred, feathered, and shelled creatures, and taught one another to sow seeds and eat the hundred grains. Thus arose the use of the plow and hoe. They hewed wood and molded earth to build palaces and houses, thus arose the work of axes and adzes. They established marriage to divide male and female, thus arose the distinctions of husband and wife, father and son, elder and younger brother. They made coffins, shrouds, and grave clothes to bury their dead, thus arose the rites of mourning. They wove nets and snares to catch the scaled, furred, feathered, and shelled creatures, thus arose the taste for meat on the cutting board. Yet though simplicity was lost and emotions stirred, they still contended only in strength and weakness, without restraint.\n\nThen those who multiplied their thought chose one among them to rule the many, calling the one *lord* and the many *subjects*. The one could command the many, but the many could not overstep the one. Thus arose the divisions of lord and subject, the ranks of high and low. The exalted were raised up, the many brought low. Later, they established ranks and emoluments to elevate and demote the many, thus arose the grades of noble and base, the disparities of rich and poor. When desires were fulfilled, those who multiplied their thought were called *sages*. Then the base envied the noble, the poor envied the rich, and the contentious heart of man was born.\n\nThose called sages grew anxious and conferred among themselves: \"At first, they were simple and pure—who called them *man*? We forced the name upon them. Man and creatures were once undivided—who called them *lord* and *subject*? We forced the division. They once took nothing, desired nothing—what were ranks and emoluments? We forced the distinctions of honor and disgrace. Now their truth and purity are lost, their desires and contentious hearts have grown.\" Where contention arises, there is seizure; where there is seizure, there is chaos. What was to be done? Those who multiplied their thought further said, \"We have a method.\" Thus they established the teachings of benevolence, righteousness, loyalty, and trust, and the patterns of ritual and music to restrain them.\n\nThe lord found his subjects oppressive and called it tyranny; subjects encroached upon their lord and called it rebellion. A father who did not love his son was called unkind; a son who did not honor his father was called unfilial. Brothers who did not harmonize were called unfriendly and unbrotherly. Husband and wife who did not unite were called unchaste and disharmonious. Those who acted thus were deemed wrong; those who did not were deemed right. Thus arose the mind that delights in right and shames wrong, and the contentious heart was curbed.\n\nIn later ages, desires grew ever more fervent. Thus they turned their backs on benevolence, righteousness, loyalty, and trust, transgressed ritual and music, and contended all the more. Those called sages, filled with regret, had no choice but to establish punishments and armies to control them. For minor offenses, they applied punishments; for major ones, they waged war. Thus the crimes of fetters, cangues, whips, and floggings, exile and banishment filled the land; the weapons of spears, swords, bows, and arrows filled the world. The disasters of ruined families and lost states stretched on without end; the sufferings of the people—poverty, hardship, and untimely death—spread without cease.\n\nAlas! The creatures of spontaneity did not act thus; it was man who forced the building of palaces and houses, the refinement of food and drink to entice desire, the division of noble and base, high and low to unify contention, the imposition of benevolence, righteousness, ritual, and music to overturn truth, the enactment of punishments and campaigns to destroy life. Thus they pursued the branches and forgot the root, scattered their emotions and harmed their lives, lost in mutual destruction from ancient times to the present. This is the fault of those called sages.\n\n**Illuminating the Root, Second**\n\nWhat is called the *root* is the mind of non-action. The bodily form depends on it to stand. It is constant and never fails—like fire, which can be used to burn but whose heat cannot be taken away; like water, which can be used to moisten but whose wetness cannot be removed. When drawn upon, it is not exhausted; when stored, it does not vanish. When set in motion, it discerns the form of an autumn hair, hears the sound of a mosquito’s wings. When at rest, it does not see mountains, does not hear thunder. Vast, it can embrace Heaven and Earth; minute, it can enter the space between eyebrows. Elusive and indistinct, it comes not, goes not. Subtle and rarefied, it is neither full nor empty. The reclusion of Chao Fu and Xu You, the retreat of Yuan Xian and Zisang—all focused on this root and preserved their integrity alone.",
      "overlap_context": "chings and set worldly affairs aside.\n\nThose who understand will believe without needing explanation; those who do not—can they be faulted? I have therefore arranged the text into thirty-four sections, compiling them into three fascicles: upper, middle, and lower. This I share only with those who understand. As for the Master’s conduct and whereabouts, they remain hidden within, so I shall not record his name or official rank.\n\n*Wunengzi*, First Fascicle\n*Complete Library of the Four Treasuries*",
      "start_char": 264,
      "end_char": 1510,
      "start_sentence": 10,
      "end_sentence": 45,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.80526804924011,
      "metadata": {
        "source_file": "dao\\藏外\\无能子.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "尧授舜舜授禹禹授启汤伐桀武王伐纣张其机而兼济也 明之者可藏则藏可行则行应物立事旷乎 无情昧之者嗜欲是驰耳 目是随终日妄用不识不知孰能照以无滞之光委以自然之和则无名之元见乎 无见之中矣 析惑第三 夫性者神也命者气也相须于虚旡相生于自然犹乎埙箎之相感也阴阳之相和也形骸者性命之器也犹乎火之在薪薪非火不焚火非薪不光形骸非性命不立性命假形骸以显则性命自然冲而生者也形骸自然滞而死者也自然生者虽寂而常生自然死者不揺而常死今人莫不好生恶死而不知自然生死之理睹乎不揺而偃者则忧之役其自然生者务存其自然死者存之愈切生之愈疎是欲沉羽而浮石者也何惑之甚欤 无忧第四 夫人大恶者死也形骸不揺而偃者也夫形骸血肉耳目不能虚而灵则非生之具也故不待不揺而偃则曰死方揺而趋本死矣所以揺而趋者凭于本不死者耳非能自揺而趋者形骸本死则非今死非今死无死矣死者人之大恶也旡死可畏则形骸之外何足汨吾之至和哉 质妄第五【凡二篇】 天下之人所共趋之而不知止者富贵与美名尔所谓富贵者足于物耳 夫富贵之亢极者大则帝王小则公侯而已岂不以被衮冕处宫阙建羽葆警跸故谓之帝王邪岂不以戴簮缨喧车马仗旌旃鈇故谓之公侯邪不饰之以衮冕宫阙羽葆警跸簮缨车马鈇又何有乎 帝王公侯哉 夫衮冕羽葆簮缨鈇旌旃车马皆物也 物足则富贵富贵则帝王公侯故曰富贵者足物尔夫物者人之所能为者也 自为之反为不为者惑之乃以足物者为富贵无物者为贫贱于是乐富贵耻贫贱不得其乐者无所不至自古及今醒而不悟壮哉 物之力也 夫所谓美名者岂不以居家孝事上忠朋友信临财廉充乎 才足乎 艺之邪此皆所谓圣人者尚之以拘愚人也 夫何以被之美名者人之形质尔无形质廓乎 太空故非毁誉所能加也 形质者囊乎 血舆乎",
      "translated_text": "Yao passed the throne to Shun, Shun to Yu, Yu to Qi; Tang overthrew Jie, King Wu overthrew Zhou—all set their mechanisms in motion to bring universal salvation. Those who understand this may withdraw when it is time to withdraw, act when it is time to act, responding to things and establishing affairs with boundless impartiality. Those who are benighted chase after desires, follow the ears and eyes, and spend their days in reckless use, unaware and unknowing. Who can illuminate with the light of unimpeded clarity, entrust to the harmony of spontaneity? Then the primal of the nameless appears within the unseen.\n\n**Dispelling Delusion, III**\nThat which is called *xing* is spirit; that which is called *ming* is *qi*. They depend on emptiness and nothingness, arise from spontaneity—like the mutual resonance of ocarina and flute, the harmony of yin and yang. The bodily form is the vessel of *xing* and *ming*, just as fire resides in firewood: without firewood, fire does not burn; without fire, firewood does not glow. Without *xing* and *ming*, the bodily form does not stand; *xing* and *ming* rely on the bodily form to manifest. Thus *xing* and *ming* arise naturally, empty and alive; the bodily form naturally stagnates and dies. That which is naturally alive, though quiescent, is ever alive; that which is naturally dead, though unmoved, is ever dead. Now, people all love life and hate death, yet do not understand the principle of natural life and death. Seeing one who lies unmoved, they grieve, exhausting their natural vitality in striving to preserve what is naturally alive, clinging ever more tightly to what is naturally dead. This is like wishing to sink a feather and float a stone—what delusion could be greater?\n\n**Freedom from Care, IV**\nWhat people most greatly abhor is death—the bodily form lying unmoved. The bodily form, blood, flesh, ears, and eyes cannot be empty and numinous; they are not the instruments of life. Thus, even before it lies unmoved, it is called death. When it moves and hastens, it relies on what is fundamentally undying; it cannot move and hasten on its own. The bodily form is fundamentally dead, so it is not death now. If it is not death now, there is no death. Death is what people most greatly abhor; if there is nothing to fear in the absence of death, why trouble the perfect harmony beyond the bodily form?\n\n**Examining Delusion, V** *(Two Chapters)*\nWhat all under Heaven pursue without cease are wealth and honor, and a fine reputation. By \"wealth and honor,\" they mean sufficiency in things. The extreme of wealth and honor is, at most, to be emperor or king, at least, duke or marquis. Is it not because they wear dragon robes and crowns, dwell in palaces, erect feathered canopies, and have guards clear the way that they are called emperors and kings? Is it not because they don crowns and tassels, ride in carriages with bells and banners, and bear axes and halberds that they are called dukes and marquises? Without the adornments of dragon robes, crowns, palaces, feathered canopies, guards, tassels, carriages, axes, and halberds—what would be left of emperors, kings, dukes, and marquises? Dragon robes, feathered canopies, tassels, axes, banners, and carriages are all things. When things suffice, there is wealth and honor; with wealth and honor, there are emperors, kings, dukes, and marquises. Thus it is said: wealth and honor mean sufficiency in things. Things are what people can create. To create them oneself, then be enslaved by them—this is delusion. They take those who have enough things as wealthy and honorable, those without things as poor and base. Thus they delight in wealth and honor, shame poverty and lowliness. Those who cannot attain their delight will stop at nothing. From ancient times to now, they remain drunk and unawakened—how mighty is the power of things!\n\nAs for a fine reputation, is it not because one is filial at home, loyal in serving superiors, trustworthy with friends, incorruptible with wealth, and capable in affairs? Or because one’s talents and arts are sufficient? These are what the so-called sages esteem to restrain the foolish. Why, then, is one who bears a fine reputation merely a human form? Without form, it is vast as the great void—how could praise or blame touch it? The bodily form is but a sack of blood, a vessel of flesh.",
      "overlap_context": "oes not vanish. When set in motion, it discerns the form of an autumn hair, hears the sound of a mosquito’s wings. When at rest, it does not see mountains, does not hear thunder. Vast, it can embrace Heaven and Earth; minute, it can enter the space between eyebrows. Elusive and indistinct, it comes not, goes not. Subtle and rarefied, it is neither full nor empty. The reclusion of Chao Fu and Xu You, the retreat of Yuan Xian and Zisang—all focused on this root and preserved their integrity alone.",
      "start_char": 1510,
      "end_char": 2203,
      "start_sentence": 46,
      "end_sentence": 69,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.82828974723816,
      "metadata": {
        "source_file": "dao\\藏外\\无能子.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "滓者也 朝合而暮坏何有于美名哉 今人莫不失自然正性而趋之以至于诈伪激者何也 所谓圣人者误之也 古今之人谓其所亲者血属于是情有所专焉 聚则相欢离则相思病则相忧死则相哭夫天下之人与我所亲手足腹背耳 目口鼻头颈眉发一也 何以分别乎 彼我哉 所以彼我者必名字尔所以疎于天下之人者不相熟尔所以亲于所亲者相熟尔嗟乎 手足腹背耳 目口鼻头颈眉发备乎 人人离析之各求其谓之身体者且旡所得谁谓所亲邪谁谓天下之人邪取于名字强为者也 若以名所亲之名名天下之人则天下之人皆所亲矣 若以熟所亲之熟熟天下之人则天下之人皆所亲矣 胡谓情所专邪夫无所孝慈者孝慈天下有所孝慈者孝慈一家一家之孝慈未弊则以情相苦而孝慈反为累矣 弊则伪伪则父子兄弟将有嫌怨者矣 庄子曰鱼相处于陆相喣以沫不如相忘于江湖至哉 是言也 夫鱼相忘于江湖人相忘于自然各适矣 故情有所专者明者不为 第六【阙】 真修第七【凡四篇】 夫衡镜物也成于人者也人自成之而反求其轻重于衡妍丑于镜者何也衡无心而平镜无心而明也夫无心之物且平且明则夫民之有心者研之以无澄之以虚涵澈希夷不知所如吾见其偕天壤以无疆沦颢炁而不疲而天下莫能与之争矣 夫水之性壅之则澄决之则流升之云则雨沉之土则润为江海而不务其大在坎穴而不耻其小分百川而不疲利万物而不辞至柔者也故老曰柔弱胜刚强则含神体虚专气致柔者得乎自然之元者也 夫水流湿火就燥云从龙风从虎自然感应之理也故神之召气气之从神犹此也知自然之相应专牝之归根则几乎悬解矣 夫鸟飞于空鱼游于渊非术也自然而然也故为鸟为鱼者亦不自知其能飞能游苟知之立心以为之则必堕必溺矣亦犹人之足驰手捉耳听目视不待习而能之也当其驰捉听视之际应机自至又不待思而施之也苟须思之而后可施之则疲矣是以任自然者久得其常者济夫浩然而虚者心之自然也今人手足耳目则任其自然而驰捉视听焉至于心则不任其自然而挠焉欲其至和而虚通也难矣 无能子卷上 钦定四库全书",
      "translated_text": "Dregs they are—gathered at dawn, dissolved by dusk—what have they to do with a fine reputation? Yet people today, without exception, lose their natural true nature and rush toward it, even resorting to deceit and pretense. Why? The so-called sages have led them astray.\n\nFrom ancient times to now, people have called their kin \"blood relations,\" and thus their affections become fixed. When together, they rejoice; when parted, they long; in sickness, they grieve; in death, they weep. Yet all people under heaven share the same hands, feet, belly, back, ears, eyes, mouth, nose, head, neck, brows, and hair as I do. Why, then, make distinctions? Why speak of \"they\" and \"I\"? The division into \"they\" and \"I\" arises solely from names. What makes others distant is unfamiliarity; what makes kin close is familiarity.\n\nAlas! Hands, feet, belly, back, ears, eyes, mouth, nose, head, neck, brows, and hair—all are complete in every person. Yet when torn apart, each seeks what it calls \"the body,\" and none attains it. Who, then, are the so-called kin? Who are the people of the world? These are but forced distinctions made by names. If one names others with the same name used for kin, then all under heaven become kin. If one treats others with the same familiarity as kin, then all under heaven become kin. Why, then, speak of fixed affections?\n\nThose who lack filial piety and kindness extend them to all under heaven; those who possess them confine them to one family. Before such filial piety and kindness decay, they become a burden of emotion, and kindness itself turns into a fetter. Once decayed, pretense arises, and fathers, sons, and brothers may grow resentful. Zhuangzi said: \"Fish stranded on land moisten each other with their spit—better to forget each other in rivers and lakes.\" How true! Fish forget each other in rivers and lakes; people forget each other in their natural state—each finds its proper place. Thus, those whose affections are fixed do not act as the wise do.\n\n---\n\nThe steelyard and mirror are things shaped by human hands. Yet people, having made them, turn to seek weight from the steelyard and beauty or ugliness from the mirror. Why? The steelyard is impartial because it has no mind; the mirror is clear because it has no mind. If mindless things can be impartial and clear, then those with minds should refine themselves with non-action, settle themselves in emptiness, and embrace the profound and subtle, drifting without direction. I see them enduring with heaven and earth, limitless, merging with the vast qi, untiring—none under heaven can rival them.\n\nWater’s nature is such that when dammed, it clarms; when released, it flows. Rising as clouds, it becomes rain; sinking into earth, it moistens. As rivers and seas, it does not boast of its greatness; in tiny crevices, it feels no shame at its smallness. Dividing into a hundred streams, it does not tire; benefiting the myriad things, it does not refuse. It is the softest of all. Thus Laozi said: \"The soft and weak overcome the hard and strong.\" Those who embody the spirit, embrace emptiness, focus their qi, and attain softness have grasped the primordial of the natural.\n\nWater flows toward the damp; fire moves toward the dry. Clouds follow the dragon; wind follows the tiger—this is the principle of natural resonance. Thus, spirit summons qi, and qi follows spirit, just as this. Knowing the mutual response of the natural and concentrating on the mysterious female to return to the root—one is nearly liberated. Birds fly in the sky; fish swim in the deep—not by technique, but by nature. Birds and fish do not know their ability to fly or swim; if they did and set their minds to it, they would surely fall or drown. It is like a person’s feet running, hands grasping, ears listening, and eyes seeing—these require no practice. When running, grasping, listening, or seeing, responses arise naturally, without thought. If one must think before acting, one becomes exhausted.\n\nThus, those who follow the natural endure and attain constancy; those who cross the vast and empty reach fulfillment. The heart’s natural state is vast emptiness. Today, people allow their hands, feet, ears, and eyes to follow their natural functions in running, grasping, seeing, and hearing, yet when it comes to the heart, they do not let it follow its nature and disturb it. How difficult, then, to attain perfect harmony and empty penetration!\n\n*Wunengzi, Scroll One*\n*From the Imperial Four Treasuries*",
      "overlap_context": "ings!\n\nAs for a fine reputation, is it not because one is filial at home, loyal in serving superiors, trustworthy with friends, incorruptible with wealth, and capable in affairs? Or because one’s talents and arts are sufficient? These are what the so-called sages esteem to restrain the foolish. Why, then, is one who bears a fine reputation merely a human form? Without form, it is vast as the great void—how could praise or blame touch it? The bodily form is but a sack of blood, a vessel of flesh.",
      "start_char": 2203,
      "end_char": 2987,
      "start_sentence": 70,
      "end_sentence": 98,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.566967487335205,
      "metadata": {
        "source_file": "dao\\藏外\\无能子.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "无能子卷中 文王说第一 吕望钓于渭滨西伯将畋筮之其繇曰非熊非罴天遗尔师及畋得望西伯再拜望钓不辍西伯拜不止望箕踞曰汝何为来哉 西伯曰殷政荒矣 生民荼矣 愚将拯之思得贤士望曰殷政自荒生民自荼胡与于汝汝胡垢予为西伯曰夫圣人不藏用以独善于己必尽智以兼济万物岂无是邪望曰夫人与鸟兽昆虫共浮于天地中一炁而已犹乎 天下城郭屋舍皆峙于空虚者也 尽坏城郭屋舍其空常空若尽杀人及鸟兽昆虫其炁常炁殷政何能荒邪生民何谓荼邪虽然城郭屋舍不必坏生民已形不必杀予将拯之矣 乃许西伯同载而归太颠闳天私于西伯曰公刘后稷之积德累功以及于王王之德充乎 祖宗矣 今三分天下王有其二亦可谓隆矣 吕望渔者尔王何为下之甚邪西伯曰夫无为之德包裹天地有为之德开物成事轩辕陶唐之为天子也 以有为之德谒广成子于崆峒叩许由于箕山而不获其一顾矧吾之德未进乎 轩尧而卑无为之德乎 太颠闳天曰如王之说望固旡为之德也 何为从王之有为邪西伯曰天地旡为也 日月星辰运于昼夜雨露霜雪陨于秋冬江河流而不息草木生而不止故旡为则能无滞若滞于有为则不能无为矣 吕望闻之知西伯实于忧民不利于得殷天下于是乎 卒与之兴周焉",
      "translated_text": "**Wunengzi, Scroll Two**\n**King Wen’s Persuasion, Part One**\n\nJiang Ziya was fishing by the Wei River when King Wen of Zhou, preparing for a hunt, divined by milfoil. The oracle declared: *“Neither bear nor brown bear—Heaven sends you a teacher.”* During the hunt, he found Jiang Ziya, and King Wen bowed twice. Yet Jiang Ziya continued fishing, unmoved, while King Wen’s bows persisted. Finally, Jiang Ziya sat cross-legged, his fishing rod slanted, and asked: *“Why have you come?”*\n\nKing Wen replied: *“The Yin government is in chaos, and the people suffer bitterly. I wish to save them and seek a worthy man.”*\n\nJiang Ziya said: *“The Yin government is chaotic of itself; the people suffer of themselves. What has this to do with you? Why do you trouble me, calling me the Lord of the West?”*\n\nKing Wen answered: *“The sage does not hoard his power to cultivate himself alone but exhausts his wisdom to universally aid all things. Is this not so?”*\n\nJiang Ziya said: *“Man, birds, beasts, and crawling insects all float within Heaven and Earth—nothing more than a single qi. The cities, walls, and houses of the world all stand in empty space. If all cities, walls, and houses were destroyed, the emptiness would remain empty. If all men, birds, beasts, and crawling insects were killed, the qi would remain qi. How could the Yin government be in chaos? What do you mean by the people’s suffering? Nevertheless, though cities, walls, and houses need not be destroyed, and the people’s forms need not be killed, I will save them.”* He then agreed to ride with King Wen and return.\n\nTaidian and Hongtian, privately addressing King Wen, said: *“The accumulated virtue and accumulated merit of Gong Liu and Hou Ji have reached you. Your virtue has filled the ancestral line. Now, with two-thirds of the world under your rule, this may be called prosperity. Jiang Ziya is but a fisherman—why do you so humbly defer to him?”*\n\nKing Wen replied: *“The virtue of non-action embraces Heaven and Earth; the virtue of action opens things and accomplishes affairs. When the Yellow Emperor and Yao and Tang were emperors, they sought the virtue of action: the Yellow Emperor visited Guangchengzi on Mount Kongtong, and Yao inquired of Xu You on Mount Ji, yet neither gained so much as a glance. How much less does my virtue compare to that of the Yellow Emperor and Yao, that I should disdain the virtue of non-action?”*\n\nTaidian and Hongtian said: *“By your account, Jiang Ziya truly possesses the virtue of non-action. Why, then, does he follow your actions?”*\n\nKing Wen said: *“Heaven and Earth act through non-action. The sun, moon, and stars move by day and night; rain, dew, frost, and snow fall in autumn and winter; rivers and streams flow without ceasing; grasses and trees grow without end. Thus, non-action allows no obstruction. If obstructed by action, one cannot act without action.”*\n\nJiang Ziya, hearing this, knew that King Wen’s concern for the people was genuine and that he did not seek the Yin throne for gain. Therefore, he ultimately aided him in establishing the Zhou.",
      "overlap_context": "ose who follow the natural endure and attain constancy; those who cross the vast and empty reach fulfillment. The heart’s natural state is vast emptiness. Today, people allow their hands, feet, ears, and eyes to follow their natural functions in running, grasping, seeing, and hearing, yet when it comes to the heart, they do not let it follow its nature and disturb it. How difficult, then, to attain perfect harmony and empty penetration!\n\n*Wunengzi, Scroll One*\n*From the Imperial Four Treasuries*",
      "start_char": 2987,
      "end_char": 3448,
      "start_sentence": 99,
      "end_sentence": 117,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.307344198226929,
      "metadata": {
        "source_file": "dao\\藏外\\无能子.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "首阳子说第二 文王殁武王伐纣灭之伯夷叔齐叩马谏曰父死不而起大事动大众非孝也 为臣弑君非忠也 左右欲兵之武王义而释之伯夷叔齐乃反首阳山号首阳子夫天下自然之时君臣无分乎 其间为之君臣以别尊卑谓之圣人者以智欺愚也 以智欺愚妄也 予与汝尝言之矣 妄为君臣之中妄殷有称妄殷之中妄辛有称妄辛之中妄肆妄虐以充妄欲姬发之动亦欲也 欲则妄所谓以妄取妄者也 夫无为则淳正而当天理父子君臣何有哉 有为则嗜欲而乱人性孝不孝忠不忠何异哉 今汝妄吾之常言又以妄说突其妄兵是求义声也 以必朽之骨而迎虚声是以风掇焰也 姬发不兵汝幸也 兵之而得义声朽骨何有哉 夫龙暴其鳞凤舒其翼必伺于渔者弋者悲乎 殆非吾之友也 夷齐于是逃入首阳山罔知所终后人以为饿死 老君说第三 孔子定礼乐明旧章删诗书修春秋将以正人伦之序杜乱臣贼子之心徃告于老老曰夫治大国者若烹小鲜蹂于刀几则烂矣自昔圣人创物立事诱动人情人情失于自然而夭其性命者纷然矣今汝又文而缛之以繁人情人情繁则怠怠则诈诈则益乱所谓伐天真而矜己者也天祸必及孔子惧然亦不能遂已既而削迹于卫伐树于宋饥于陈蔡围于匡皇皇汲汲几于不免孔子顾谓颜回曰老之言岂谓是乎 孔子说第四【凡二篇】 孔子围于匡七日歌不辍子路曰由闻君子包周身之防无一朝之患夫子圣人也 而饥于陈围于匡何也 然而夫子歌不辍罔有忧色岂有术乎 孔子曰由来语汝夫是非邪正由乎 人厚薄通塞存乎 时日月之照不能免薄蚀之患圣贤上智不能移厚薄通塞之数君子能仁于人不能使人仁于我能义于人不能使人义于我匡之围非邱之罪也 邱亦不能使之不围焉 然而可围者邱之形骸也 邱方惚旡形于冲漠沦旡情于杳防不知所以忧故偶谐于歌尔言未几匡人解去原宪居陋巷子贡方相于卫结驷联镳访宪焉 宪摄弊衣子贡曰夫子病邪宪曰宪闻德义不修谓之病无财谓之贫宪贫也 非病也 子贡耻其言终身不敢复见宪仲尼闻之曰赐也 言失之也 夫拘于形者不虚存于心者不淳不虚则思之不清不淳则其心不贞赐也 近于骄欲宪近于坚白比之清浊将去几何 第五【阙】 范蠡说第六",
      "translated_text": "**Shouyangzi, Second Discourse**\n\nWhen King Wen passed away and King Wu rose to punish Zhou and overthrow him, Boyi and Shuqi grasped the reins of his horse and remonstrated: *“A father’s death is not yet mourned, yet you raise great affairs and mobilize the masses—this is not filial. As a minister, to slay one’s lord—this is not loyal.”* His attendants sought to strike them down, but King Wu, deeming them righteous, released them.\n\nBoyi and Shuqi then retreated to Mount Shouyang and styled themselves the Shouyangzi. *“In the natural order of the world,”* they said, *“is there any distinction between ruler and subject? Those who fabricate such distinctions to enforce hierarchy call themselves sages, yet they use wisdom to deceive the foolish. To use wisdom to deceive the foolish is delusion. You and I have spoken of this before: within the delusion of ruler and subject, there was the delusion of Yin; within the delusion of Yin, there was the delusion of Xin; within the delusion of Xin, there was the delusion of tyranny and cruelty, all to sate deluded desires. Ji Fa’s actions are likewise driven by desire—desire is delusion. Thus, he seeks delusion through delusion.*\n\n*“In non-action, purity and uprightness align with Heaven’s principle—what place is there for father and son, ruler and subject? In action, craving and desire disorder human nature—what difference is there between filial and unfilial, loyal and disloyal? Now you distort our constant teaching and brandish delusion to justify your deluded weapons, all to chase the hollow name of righteousness. To welcome empty renown with bones destined to rot is like grasping at wind to seize flame. That Ji Fa did not strike you down is your fortune. Had he struck you and gained the name of righteousness, what would your rotting bones have mattered?*\n\n*“When the dragon bares its scales and the phoenix spreads its wings, they must watch for the fisherman and the fowler—how lamentable! They are no friends of mine.”* Thereupon, Boyi and Shuqi fled into Mount Shouyang, and none knew their end. Later generations claimed they starved to death.\n\n---\n\n**Laozi, Third Discourse**\n\nConfucius codified rites and music, clarified ancient institutions, edited the *Book of Songs* and *Book of Documents*, and composed the *Spring and Autumn Annals*, intending to rectify the order of human relations and deter the hearts of rebellious ministers and traitorous sons. He went to inform Lao Dan of this.\n\nLao Dan said: *“To govern a great state is like frying small fish—trample them under the knife, and they fall apart. Since ancient times, sages have created things and established affairs, enticing and stirring human emotions. When human emotions lose their natural state, they prematurely cut short their nature and destiny, leading to endless chaos. Now you further embellish and complicate them, burdening human emotions. When emotions are burdened, they grow weary; when weary, they become deceitful; when deceitful, chaos worsens. This is what is called severing Heaven’s truth to vaunt oneself. Heaven’s calamity will surely befall you.”*\n\nConfucius, alarmed, could not bring himself to stop. Later, he was driven from Wei, his tree felled in Song, starved in Chen and Cai, and besieged in Kuang, wandering in distress, nearly meeting his end.\n\nConfucius turned to Yan Hui and said: *“Did Lao Dan’s words foretell this?”*\n\n---\n\n**Confucius, Fourth Discourse (Two Chapters)**\n\nConfucius was besieged in Kuang for seven days, yet his singing never ceased. Zilu said: *“I have heard that the noble man builds defenses to guard his person, avoiding even a day’s misfortune. Yet you, Master, are a sage, yet you starve in Chen and are besieged in Kuang—why? Yet you sing without pause, showing no sign of worry. Do you have some method?”*\n\nConfucius said: *“Zilu, come and let me tell you. Right and wrong, truth and falsehood—these arise from human judgment. Favor and disfavor, openness and obstruction—these depend on the times. The sun and moon cannot avoid the misfortune of eclipses; sages and men of supreme wisdom cannot alter the patterns of favor and disfavor, openness and obstruction. The noble man can be humane toward others but cannot make others humane toward him; he can be righteous toward others but cannot make others righteous toward him. The siege at Kuang is not Qiu’s fault—Qiu cannot prevent it. Yet what can be besieged is Qiu’s physical form. Qiu, in his essence, is formless in the vast emptiness, emotionless in the boundless void. I do not know why I should worry, so I happen to harmonize with singing.”*\n\nBefore long, the people of Kuang lifted the siege.\n\n---\n\nYuan Xian lived in a humble alley, while Zigong, serving as an envoy to Wei, paraded with a team of four horses, their bridles linked, to visit him. Yuan Xian, clad in tattered robes, said: *“The Master is ill, is he not?”*\n\nZigong said: *“I have heard that to fail in cultivating virtue and righteousness is illness; to lack wealth is poverty. Yuan is poor, not ill.”*\n\nZigong was ashamed of his words and never dared to see Yuan Xian again.\n\nWhen Confucius heard of this, he said: *“Ci has spoken amiss. One constrained by form does not dwell in emptiness; one who does not dwell in emptiness does not think clearly. One whose heart is not pure does not hold fast to integrity. Ci inclines toward arrogance and desire; Yuan inclines toward firmness and clarity. Compared to purity and turbidity, how far apart are they?”*\n\n---\n\n**Fifth (Missing)**\n\n**Fan Li, Sixth Discourse**",
      "overlap_context": "Earth act through non-action. The sun, moon, and stars move by day and night; rain, dew, frost, and snow fall in autumn and winter; rivers and streams flow without ceasing; grasses and trees grow without end. Thus, non-action allows no obstruction. If obstructed by action, one cannot act without action.”*\n\nJiang Ziya, hearing this, knew that King Wen’s concern for the people was genuine and that he did not seek the Yin throne for gain. Therefore, he ultimately aided him in establishing the Zhou.",
      "start_char": 3448,
      "end_char": 4263,
      "start_sentence": 118,
      "end_sentence": 155,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.766374826431274,
      "metadata": {
        "source_file": "dao\\藏外\\无能子.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "范蠡佐越王句践灭吴杀夫差与大夫种谋曰吾闻阴谋人者其祸必复夫姑苏之灭夫差之死由吾与子阴谋也 况王之为人也 可与共患不可共乐且功成名遂身退天之理也 吾将退子其偕乎 大夫种曰夫天地之于万物也 春生冬杀万物岂于冬杀而反祸天地乎 吾闻圣人不贵乎 独善而贵乎 除害成物苟成于物除害可也 是以黄帝杀蚩尤舜去四凶我今除吴之乱成越之霸亦成物除害尔何祸之复我哉 况王方以灭吴德子与我必相始终子无遽于退也 范蠡曰不然夫天地无心且不自宰况宰物乎 天地自天地万物自万物春以和自生冬以寒自杀非天地使之然也 圣人虽有心其用也 体乎",
      "translated_text": "Fan Li, having aided King Goujian of Yue in destroying Wu and killing Fuchai, conferred with Minister Zhong, saying: *“I have heard that those who scheme in secret will surely suffer calamity in return. The fall of Gusu and the death of Fuchai were brought about by our secret schemes. Moreover, the king’s nature is such that he may share hardship but not joy. Furthermore, to retire once merit is achieved, fame attained, and the body preserved—this is the principle of Heaven. I shall withdraw; will you join me?”*\n\nMinister Zhong replied: *“Heaven and Earth, in their relation to the myriad things, give life in spring and kill in winter. Do the myriad things, slain in winter, bring calamity back upon Heaven and Earth? I have heard that the sage does not prize self-cultivation alone but values the removal of harm and the completion of things. If harm is removed and things are completed, it is acceptable. Thus, the Yellow Emperor slew Chiyou, and Shun banished the Four Villains. Now, I have removed the disorder of Wu and established Yue’s hegemony—this, too, is completing things and removing harm. What calamity could return to me? Moreover, the king, having just destroyed Wu, regards you and me with favor; he will surely treat us from beginning to end. Do not hasten to withdraw.”*\n\nFan Li said: *“Not so. Heaven and Earth have no intent and do not govern themselves—how much less can they govern things? Heaven and Earth are simply Heaven and Earth; the myriad things are simply the myriad things. Spring, in its harmony, gives life of itself; winter, in its cold, kills of itself. It is not that Heaven and Earth cause them to be so. Though the sage has intent, in his application, he embodies [the spontaneity of Heaven and Earth].”*",
      "overlap_context": "was ashamed of his words and never dared to see Yuan Xian again.\n\nWhen Confucius heard of this, he said: *“Ci has spoken amiss. One constrained by form does not dwell in emptiness; one who does not dwell in emptiness does not think clearly. One whose heart is not pure does not hold fast to integrity. Ci inclines toward arrogance and desire; Yuan inclines toward firmness and clarity. Compared to purity and turbidity, how far apart are they?”*\n\n---\n\n**Fifth (Missing)**\n\n**Fan Li, Sixth Discourse**",
      "start_char": 4263,
      "end_char": 4501,
      "start_sentence": 156,
      "end_sentence": 170,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.692728757858276,
      "metadata": {
        "source_file": "dao\\藏外\\无能子.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "天地天地虽无心机动则应事廹则顺事过则逆除害成物无所憎爱故害除而无祸物成而无福今王以怨吴之心禄我与子以取其谋我与子利其禄而谋吴以灭人为功以报禄我者人之奸也 自谓天地之生杀圣人之除害成物不其欺邪大夫种不说疑之不决范蠡竟辞句践泛扁舟于五湖俄而越杀大夫种 宋玉说第七 屈原仕楚为三闾大夫楚襄王无德佞臣靳尚有宠楚国不治屈原忧之谏襄王请斥靳尚王不听原极谏其非宋玉止之曰夫君子之心也 修乎 已不病乎 人晦其用不曜于众时来则应物来则济应时而不谋已济物而不立功是以直无所归怨无所集今王方于佞口酣于乱政楚国之人皆贪靳尚之贵而响随之大夫乃孑孑然挈其忠信而叫噪其中言不从国不治徒彰乎 彼非我是此贾仇而钓祸也 原曰吾闻君子处必孝弟仕必忠信得其志虽死犹生不得其志虽生犹死谏不止靳尚怨之谗于王而逐之原彷徨湘滨歌吟悲伤宋玉复喻之曰始大夫孑孑然挈忠信而叫噪于群佞之中玉为大夫危之而言之旧矣 大夫不能从今胡悲邪岂爵禄是思国壤是念邪原曰非也 悲夫忠信不用楚国不治也 玉曰始大夫以为死孝弟忠信也 又何悲乎 且大夫猊容形骸非大夫之有也",
      "translated_text": "The Dao of Heaven and Earth, though without intent, responds when events arise and follows when pressed—yet when events pass, it resists. To remove harm and complete things is without partiality or favor; thus, harm removed brings no misfortune, and things completed bring no blessing. Now, the king, moved by his grudge against Wu, rewards you and me to employ our schemes. You and I, lured by his rewards, scheme against Wu, making the destruction of others our merit and the repayment of his bounty our duty—this is the treachery of men. To claim this as Heaven and Earth’s life and death, the sage’s removal of harm and completion of things—is this not deception?\n\nMinister Zhong did not understand and wavered in doubt, but Fan Li ultimately resigned from Goujian and drifted in a small boat upon the Five Lakes. Soon after, Yue executed Minister Zhong.\n\n---\n\n**Song Yu’s Persuasion, Seventh Chapter**\n\nQu Yuan served Chu as Minister of the Three Clans. King Xiang of Chu lacked virtue, and the sycophant Jin Shang enjoyed favor, leaving the state in disorder. Qu Yuan, grieved, remonstrated with the king, urging him to dismiss Jin Shang. The king refused. Qu Yuan pressed his admonitions to the extreme, but Song Yu stopped him, saying: *“The heart of the noble man is cultivated within himself, not troubled by others. His brilliance is obscured, and his efficacy does not shine before the crowd. When the time comes, he responds to things; when things come, he aids them. He responds to the times without scheming, aids things without claiming merit—thus, his uprightness has no place to return, and resentment has no place to gather. Now, the king indulges in flattery and delights in disorderly governance. The people of Chu all covet Jin Shang’s eminence and follow him like an echo. Yet you, Minister, stand alone, clutching your loyalty and trust, clamoring amidst them. Your words go unheeded, the state remains in chaos—all you do is display their wrong and your right, inviting enmity and angling for disaster.”*\n\nQu Yuan replied: *“I have heard that the noble man, in his dwelling, must practice filial piety and fraternal duty; in office, he must uphold loyalty and trust. If he attains his will, though he die, he lives; if he does not attain his will, though he lives, he is dead. My admonitions will not cease.”* Jin Shang, resenting him, slandered him to the king, who banished him. Qu Yuan wandered the banks of the Xiang, singing and lamenting in sorrow. Song Yu again admonished him: *“From the start, Minister, you stood alone, clutching loyalty and trust, clamoring amidst a throng of sycophants. I, as your minister, have long warned you of the danger in this. You could not heed me—why now this grief? Do you covet rank and emolument, or yearn for the land of the state?”*\n\nQu Yuan said: *“No. I grieve that loyalty and trust go unused, and the state of Chu remains in disorder.”*\n\nSong Yu replied: *“From the start, Minister, you held death as filial piety, fraternal duty, loyalty, and trust—why then this grief? Moreover, the noble man regards his bearing and form as no more his own than borrowed vessels.”*",
      "overlap_context": "eginning to end. Do not hasten to withdraw.”*\n\nFan Li said: *“Not so. Heaven and Earth have no intent and do not govern themselves—how much less can they govern things? Heaven and Earth are simply Heaven and Earth; the myriad things are simply the myriad things. Spring, in its harmony, gives life of itself; winter, in its cold, kills of itself. It is not that Heaven and Earth cause them to be so. Though the sage has intent, in his application, he embodies [the spontaneity of Heaven and Earth].”*",
      "start_char": 4501,
      "end_char": 4941,
      "start_sentence": 171,
      "end_sentence": 184,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.196695566177368,
      "metadata": {
        "source_file": "dao\\藏外\\无能子.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "美不能丑之丑不能美之长不能短短不能长强壮不能尪弱之尪弱不能强壮之病不能排死不能留形骸似乎 我者也 而我非可专一一身尚若此乃欲使楚人之国由我理大夫之惑亦甚矣 夫君子寄形以处世虚心以应物无邪无正无是无非无善无恶无功无罪虚乎 心虽桀纣蹻跖非罪也 存乎 心虽尧舜契非功也 则大夫之忠信靳尚之邪佞孰分其是非邪无所分别则忠信邪佞一也 有所分则分者自妄也 而大夫离真以袭妄恃已以防人不待王之弃逐而大夫自弃矣 今求乎 忠信而得乎 忠信而又悲之而不能自止所谓兼失其妄心者也 玉闻上达节中守节下失节夫虚其心而远于有为者达节也 存其心而分是非者守节也 不得其所分又悲之者失节也 原不达竟沉汨罗而死 商隐说第八 汉高帝嬖于戚姬欲以赵王如意易太子盈大臣不能争吕后危之谋于留侯张良良曰夫有非常之人然后能成非常之事良闻商洛山遁者四人曰夏黄公甪里先生东园公绮里季上尝召不能致今太子实能自卑以求之四人且来来而宾太子此善助也 吕后如良计遣吕泽迎之四人始耻之既而相谓曰刘季大度又知所以高我求我不得惭己而已矣 吕雉女子性复惨忍其子盈不立必廹于危危而求我安危卜于我也 求我不得必加祸于我姑俞之可也 乃来一日偕太子进高祖见而问之四人咸自名帝愕然曰吾尝求之而不从吾何为从太子四人曰陛下慢人我义不受辱太子尊人我即以宾游帝谢之指谓戚姬曰太子羽翼成矣 不可揺也 吕后德之将尊爵之四人相谓曰我之来远祸也 非欲于心也 盈立则如意黜吕雉得志则戚姬死今我惧祸成盈而败如意欢吕后而愁戚姬所谓废人而全已殆非杀身成仁者也 复将忍耻爵于女子之手以立于廷何异贼人夕入人室得金而矜富者邪乃复商山吕后不能留张良亦悟于是屏气绝谷而退居尔 严陵说第九 光武微时与严陵为布衣之交及即位而陵方钓于富春渚光武思其旧慕其贤躬徃聘之陵不从光武曰吾与子交也 今吾贵为天子而子犹渔吾为子耻之吾有官爵可以贵子金玉可以富子使可在千万人上举动可以移山岳叱咤可以兴云雨荣宗华族联公继侯丹雘宫室杂防车马美衣服珍饮食击钟鼓合歌舞身乐于一世名传于万祀岂与垂饵终日汨没无闻校其升沉荣辱哉 可为从于我也 陵曰始吾交子之日而子修志意乐贫贱似有可取者今乃夸咤惑妄人也 夫四海之内自古以为至广大也 十分之中山岳江海有其半蛮夷戎狄有其三中国所有一二而已背叛侵凌征伐战争未尝帖息夫中国天子之贵在十分天下一二分中征伐战争之内自尊者尔夫所谓贵且尊者不过于一二分中狥喜怒专生杀而已不过一二分中择土木以广宫室集缯帛珍宝以繁车服杀牛羊种百谷以美饮食列姝丽敲金石以悦视听而已嗜欲未厌老至而死丰肌委于蝼蚁腐骨沦于土壤匹夫匹妇一也 天子之贵何有哉 所谓贵我以官爵者吾知之矣 自古帝王与公侯卿大夫之号皆圣人强名以等差贵贱而诱愚人尔且子今之帝王之身昔之布衣之身也 今人虽帝子而子自视之何异于昔盖以诱我于强名而使子悦而夸咤也 今又欲以强名公侯卿大夫诱我非愚我邪夫强名者众人皆能为之我苟悦此当自强名曰公侯卿大夫可矣 何须子之强名哉 子必曰官爵者以其富贵其身也 官爵实强名也 自我则有富贵之实不自我则富贵何有哉 夫所谓富贵官爵者亦不过于峨冠鸣玉簇前殿后坐大厦被鲜服耳",
      "translated_text": "Beauty cannot make the ugly beautiful, nor can ugliness make beauty ugly. The long cannot be made short, nor the short long. The strong and robust cannot be made weak and frail, nor can the weak and frail be made strong and robust. Illness cannot be dispelled, nor can death be detained. The body seems to be mine, yet I cannot claim it as my own. If even this single form is thus, how can you expect the state of Chu to be governed by you alone? Minister, your delusion is profound indeed.\n\nThe noble man lodges his form in the world, empties his heart to respond to things—without perversity or uprightness, without right or wrong, without good or evil, without merit or guilt. With an empty heart, even Jie, Zhou, Zhi, or Robber Zhi are not guilty; with a full heart, even Yao, Shun, Hou Ji, or Xie are not meritorious. Then how can one distinguish between your loyalty and trust and Jin Shang’s perversity and flattery? If there is no distinction, then loyalty and perversity are one. If there is distinction, then the distinction itself is delusion. Yet you, Minister, have abandoned the real to cling to delusion, relied on yourself to guard against others—before the king banished you, you had already cast yourself aside.\n\nNow you seek loyalty and trust, attain them, yet grieve and cannot cease—this is what is called losing both the real and the delusory heart. I have heard that the superior man either transcends norms, upholds them, or loses them. To empty the heart and distance oneself from action is to transcend norms; to preserve the heart and distinguish right from wrong is to uphold them; to fail in distinction and yet grieve is to lose them. Yuan, failing to transcend, ultimately drowned himself in the Miluo.\n\n**Discourse the Eighth: Han Gaozu and Consort Qi**\nEmperor Gao of Han favored Consort Qi and wished to replace Crown Prince Ying with Prince Ruyi of Zhao. The great ministers could not dissuade him, and Empress Lü grew anxious, seeking counsel from the Marquis of Liu, Zhang Liang. Liang said: “Only extraordinary men can accomplish extraordinary deeds. I have heard that four recluses dwell in the Shangluo Mountains—Xia Huangong, Master Luli, Dongyuangong, and Qili Ji. The late emperor summoned them but could not obtain their service. If the crown prince humbles himself to seek them, they may come and serve as his guests—this would be a great aid.”\n\nEmpress Lü followed Liang’s plan and sent Lü Ze to welcome them. At first, the four were ashamed, but then they said to one another: “Liu Ji is magnanimous and knows how to honor us. Had he sought us in vain, we would have been shamed. Empress Lü is a woman, cruel and ruthless—if her son Ying is not enthroned, she will be pressed to peril. Pressed to peril, she seeks us; if she cannot obtain us, she will bring disaster upon us. Let us assent for now.”\n\nThey came, and one day, accompanied the crown prince to see the emperor. When Gaozu saw them, he asked their names, and all introduced themselves. The emperor was astonished: “I sought you before, and you refused. Why now follow the crown prince?” The four replied: “Your Majesty treats men with disdain, and we, by principle, refuse humiliation. The crown prince honors men, so we come as his guests.” The emperor apologized and, pointing to Consort Qi, said: “The crown prince’s wings are fully grown—he cannot be shaken.”\n\nEmpress Lü was grateful and wished to ennoble them. The four conferred: “Our coming was to avoid disaster, not out of desire. If Ying is enthroned, Ruyi will be demoted; if Lü Zhi prevails, Consort Qi will die. Now we fear disaster for Ying and rejoice in Ruyi’s failure, delight Lü Zhi and grieve Consort Qi—this is to harm others to preserve ourselves, hardly the act of one who would die to fulfill virtue. How can we endure the shame of accepting titles from a woman’s hand to stand in court? Is this not like a thief who sneaks into a house at night, steals gold, and boasts of his wealth?” They returned to Mount Shang, and Empress Lü could not detain them. Zhang Liang also awakened to this and, holding his breath and abstaining from grain, retired.\n\n**Discourse the Ninth: Guangwu and Yan Ling**\nWhen Emperor Guangwu was still obscure, he and Yan Ling were friends as commoners. After ascending the throne, Ling was fishing at Fuchun Shoals. Guangwu, remembering their old friendship and admiring his virtue, personally went to invite him. Ling refused. Guangwu said: “I was once your friend—now I am honored as Son of Heaven, yet you remain a fisherman. I am ashamed for you. I have offices and ranks to ennoble you, gold and jade to enrich you. You could stand above millions, your actions move mountains and rivers, your shouts summon clouds and rain. Your clan would flourish, your descendants inherit marquisates, your palaces be adorned with cinnabar and ochre, your carriages and horses resplendent, your robes and food exquisite. You would feast amid bells and drums, songs and dances, delighting in this life, your name enduring for ten thousand generations. How does this compare to dangling bait all day, sunk in obscurity? Judge the rise and fall, honor and disgrace—can you not follow me?”\n\nLing smiled and said: “When we first befriended each other, you cultivated your will, delighted in poverty and lowliness—there seemed something worthy in you. Now you boast and bewilder, deluding the foolish. The world within the four seas has always been vast—of its ten parts, mountains, rivers, and seas occupy half, barbarians and tribes another three, and the Central States but one or two. Yet rebellion, invasion, conquest, and war never cease. The Son of Heaven’s nobility lies within this one or two parts, amid conquest and war—this is self-aggrandizement. What is called noble and exalted is but indulging joy and anger, monopolizing life and death within this one or two parts; selecting timber to expand palaces, amassing silks and treasures to adorn carriages and robes; slaughtering cattle and sheep, planting grains to refine food and drink; gathering beauties, striking metal and stone to please the eyes and ears. Desires unfulfilled, old age arrives, and death—plump flesh feeds ants, rotten bones sink into the earth. Commoner or empress, all are the same. What nobility is there in being Son of Heaven?\n\nWhat you call ennobling me with offices and ranks—I understand. Since ancient times, the titles of emperor, king, duke, minister, and grandee have all been forced names invented by sages to rank high and low, deluding the foolish. Moreover, your present self as Son of Heaven is no different from your former self as a commoner. Though others now see you as an emperor’s son, how do you see yourself differently from before? This is but using forced names to delude me, making you rejoice and boast. Now you wish to delude me further with the forced names of duke, minister, and grandee—are you not making a fool of me? If I delight in these, I could force names myself and call myself duke, minister, or grandee—why need your forced names?\n\nYou must say offices and ranks enrich and ennoble the self. But offices and ranks are forced names—if they come from me, I have the reality of wealth and nobility; if not from me, what wealth and nobility are there? What is called wealth, nobility, office, and rank is but wearing a tall hat and jade pendants, standing before the hall and sitting behind it, dwelling in grand mansions, donning fine robes—nothing more.”",
      "overlap_context": "ter, have long warned you of the danger in this. You could not heed me—why now this grief? Do you covet rank and emolument, or yearn for the land of the state?”*\n\nQu Yuan said: *“No. I grieve that loyalty and trust go unused, and the state of Chu remains in disorder.”*\n\nSong Yu replied: *“From the start, Minister, you held death as filial piety, fraternal duty, loyalty, and trust—why then this grief? Moreover, the noble man regards his bearing and form as no more his own than borrowed vessels.”*",
      "start_char": 4941,
      "end_char": 6172,
      "start_sentence": 185,
      "end_sentence": 229,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.55444931983948,
      "metadata": {
        "source_file": "dao\\藏外\\无能子.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "倦丝竹口饫膏鲜皆子所诱我之说而已子所诱我者不过充欲之物而已夫车马代劳也 骐骥欵假一也 屋宇庇风雨也 丹雘蓬茅一也 衣服蔽形也 绮纨韦布一也 食粒却饥也 膏鲜藜藿一也 况吾汨乎 太虚咀乎 太和动静不作阴阳同波今方自忘其姓氏自委其行止操竿投缕泛然如寄又何暇梏其肢体愁其精神贪乎 强名而充乎 妄欲哉 且王莽更始之有天下与子之有天下何异哉 同乎 求为中国所尊者尔岂忧天下者邪今子战争杀戮不知纪极尽人之性命得已之所欲仁者不忍言也 而子不耻反以我渔为耻邪光武悟于是不敢臣陵焉 孙登说第十 孙登先生苏门山嵇康慕而徃见之曰康闻蜉□不能如龟龄燕雀不能与鸿期康之心实不足以纳真诲然而日月之照何限乎 康庄硗埆雨露之润罔择乎 兰荪萧艾先生理身固命之余愿以及康俾康超乎 有涯遨乎 无垠登久而应之曰夫杳杳防防有精非精浑浑淳淳有神非神精神甚真离之不分留之不存孰谓固命孰谓理身孰为有涯孰为无垠然而虚旡之中绵绵相循出入无迹为天地之根知之者明得之者尊凡汝所论未窥其门吾闻诸老曰良贾深藏若虚君子盛德容貌若愚且夫蚌以珠剖象以齿焚兰煎以膏翠防以文常人所知也 汝有藻饰之才亡防蒙之机如执明烛煌煌光辉穹苍所恶也 吾尝得汝贻山巨源绝交书其间二大不可七不堪皆矜已疵物之说时之所憎也 夫虚其中者朝市不喧欲其中者岩谷不幽仕不能夺汝之情处不能济汝之和仕则累不仕则已而又绝人之交増以矜己疵物之说啅噪于尘世之中而欲探乎 永生可谓恶影而走于日中者也 何足闻吾之诲哉",
      "translated_text": "The weariness of strings and flutes, the surfeit of rich meats and fine delicacies—these are but your enticements to delude me, nothing more than objects to sate desire. Chariots and horses spare one’s labor, yet a fine steed or a borrowed nag serve the same end. Houses and halls shelter from wind and rain, yet vermilion halls or thatched huts differ not in purpose. Garments cover the body, whether silk brocade or coarse cloth. Food fills the belly, whether rich fare or wild greens. Moreover, I drift in the Great Void, savoring the Supreme Harmony, where movement and stillness arise not, and yin and yang flow as one. Now, having forgotten my own name and surrendered my conduct, I cast my pole and cast my line, adrift as one sojourning—why then should I shackle my limbs, vex my spirit, covet forced names, or glut myself with vain desires?\n\nAnd how does Wang Mang’s usurpation of the realm differ from yours? Both seek only to be revered by the Middle Kingdom—can this be called care for the world? Now you wage war without end, slaughter without limit, exhausting the lives of men to satisfy your desires—even a man of benevolence could not bear to speak of it. Yet you feel no shame, and instead shame me for my fishing? Emperor Guangwu awakened to this and dared not treat me as a subject.\n\n*Saying the Tenth of Sun Deng*\n\nMaster Sun Deng dwelled on Su Gate Mountain. Xi Kang, admiring him, went to visit and said: “I have heard that the mayfly cannot match the tortoise’s longevity, nor the sparrow vie with the swan’s flight. My heart is truly unworthy to receive true instruction, yet the illumination of sun and moon knows no bounds, and the nourishment of rain and dew makes no distinction between smooth and rugged paths. Though orchid and mugwort grow side by side, I wish, Master, that in your governance of body and fate, you might extend your grace to me, that I may transcend the bounded and roam the boundless.”\n\nSun Deng remained silent for a long while before answering: “That which is dim and distant, yet possesses essence—is it truly essence? That which is vast and pure, yet possesses spirit—is it truly spirit? Essence and spirit are most real; separate them, and they vanish; retain them, and they do not abide. Who speaks of governing fate? Who speaks of cultivating the body? Who speaks of the bounded? Who speaks of the boundless? Yet within the formless and traceless, the continuous unfolds, emerging and entering without trace, becoming the root of heaven and earth. He who knows this is enlightened; he who attains it is revered. But all you have spoken has not glimpsed its gate. I have heard from the old masters: ‘The skilled merchant conceals his treasure as if empty; the gentleman of great virtue appears foolish.’ Moreover, the clam is split for its pearl, the elephant for its tusks, the orchid is burned for its fragrance, and the kingfisher is slain for its plumage—these are things even the common man knows.\n\nYou possess a talent for ornate speech but lack the subtlety to conceal it, wielding your bright torch to dazzle the vast heavens—this is what is detested. I once read your *Letter Breaking Off Relations with Shan Tao*, in which the two great impossibilities and seven unbearable burdens were all but boasts of your own worth and criticisms of others—precisely what the age despises. He who is empty within is not disturbed by the marketplace; he who is full of desire finds no peace in the mountains. Service cannot wrest your passions from you, nor can reclusion perfect your harmony. To serve is to be burdened; not to serve is to be done. Yet you further sever ties with others and amplify your boasts and criticisms, clamoring in the dust of the world while seeking to fathom eternal life—this is like fleeing one’s shadow while running toward the sun. How could you be worthy to hear my instruction?”",
      "overlap_context": " myself and call myself duke, minister, or grandee—why need your forced names?\n\nYou must say offices and ranks enrich and ennoble the self. But offices and ranks are forced names—if they come from me, I have the reality of wealth and nobility; if not from me, what wealth and nobility are there? What is called wealth, nobility, office, and rank is but wearing a tall hat and jade pendants, standing before the hall and sitting behind it, dwelling in grand mansions, donning fine robes—nothing more.”",
      "start_char": 6172,
      "end_char": 6754,
      "start_sentence": 230,
      "end_sentence": 257,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.34540343284607,
      "metadata": {
        "source_file": "dao\\藏外\\无能子.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "康然如醒后果以刑死 旡能子卷中 钦定四库全书 旡能子卷下 答通问第一 旡能子贫其昆弟之子且寒而饥嗟吟者相从焉 一日兄之子通谓旡能子曰嗟寒吟饥有年矣 夕则多梦禄仕而丰乎 车马金帛梦则乐寤则忧何可获置其易哉 旡能子曰昼忧夕乐均矣 何必易哉 通曰夕乐梦尔旡能子曰夫梦之居屋室乘车马被衣服进饮食悦妻子憎仇雠忧乐喜怒与夫寤而所欲所有为者有所异邪曰无所异无所异则安知而为之者梦邪寤而为之者梦邪且人生百岁其间昼夕相半半忧半乐又何怨乎 夫防乎 虚而专乎",
      "translated_text": "Kang, awakened as if from a dream, was later executed by the law. *Wunengzi*, Scroll the Middle. *The Complete Library of the Four Treasuries*, *Wunengzi*, Scroll the Lower. \"First Reply to Tong’s Inquiry.\"\n\nWunengzi was poor, and his nephews—his elder brother’s sons—were cold and hungry, their sighs and lamentations following him always. One day, his nephew Tong said to Wunengzi: “For years now, we have sighed from cold and lamented hunger. At night, we often dream of official salaries and abundance—of carriages and horses, gold and silk. In dreams, we are joyful; upon waking, we are sorrowful. How can we secure what is so easily attained in dreams?”\n\nWunengzi said: “Daytime sorrow and nighttime joy are equal—why must you exchange one for the other?”\n\nTong said: “Nighttime joy is but a dream.”\n\nWunengzi said: “In dreams, one dwells in houses, rides carriages and horses, wears robes and sashes, takes food and drink, delights in wives and children, loathes enemies, and experiences sorrow, joy, pleasure, and anger—is this truly different from what one desires, possesses, and does while awake?”\n\nTong said: “There is no difference.”\n\nWunengzi said: “If there is no difference, then how do you know that what you do in dreams is dreaming, and what you do while awake is not dreaming? Moreover, a human life spans a hundred years, of which half is day and half is night—half sorrow, half joy. Why then should you complain? Guard the emptiness within, and focus your spirit.”",
      "overlap_context": " is not disturbed by the marketplace; he who is full of desire finds no peace in the mountains. Service cannot wrest your passions from you, nor can reclusion perfect your harmony. To serve is to be burdened; not to serve is to be done. Yet you further sever ties with others and amplify your boasts and criticisms, clamoring in the dust of the world while seeking to fathom eternal life—this is like fleeing one’s shadow while running toward the sun. How could you be worthy to hear my instruction?”",
      "start_char": 6754,
      "end_char": 6977,
      "start_sentence": 258,
      "end_sentence": 271,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.360076189041138,
      "metadata": {
        "source_file": "dao\\藏外\\无能子.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "常者王侯不能为之贵厮养不能为之贱玉帛子女不能为之富藜羹防缕不能为之贫则忧乐无所容乎 其间矣 动乎 情而属乎 形者感物而已矣 物者所谓富贵之具也 形与物朽败之本也 情感之而忧乐之无常也 以无常之情萦朽败之本寤犹梦也 百年犹一夕也 汝能防乎 虚而专乎 常不知所以饥寒富贵矣 动乎 情而属乎 形则昼夕寤寐俱梦矣 汝其思之 答华阳子问第二 无能子形骸之友华阳子为其所知迫以仕华阳子疑问无能子曰吾将学无心久矣 仕则违心矣 不仕则忿所知如何其可也 无能子曰无心不可学无心非仕不仕心疑念深所谓见瞽者临阱而教之前也 夫无为者旡所不为也 有为者有所不为也",
      "translated_text": "The constant is such that kings and marquises cannot make it noble, servants and attendants cannot make it base; jade and silk, sons and daughters cannot make it wealthy, coarse gruel and tattered garments cannot make it poor—thus sorrow and joy have no place within it. That which moves through emotion and attaches to form is merely responding to things. Things are what we call the instruments of wealth and honor. Form and things are the root of decay and ruin. Emotion responds to them, and sorrow and joy become impermanent. With impermanent emotion entangling the root of decay and ruin, waking is still dreaming, a hundred years is but a single night. Can you guard the emptiness within and focus your spirit? If you do not know the constant, how can you understand hunger and cold, wealth and honor? If you move through emotion and attach to form, then day and night, waking and dreaming are all dreams. Ponder this well.\n\n*Answer to Huayangzi’s Question, Second Chapter*\n\nWunengzi’s friend Huayangzi, pressed by his acquaintances to take office, was beset by doubt and asked Wunengzi: “I have long wished to study the mind of no-mind. To serve would violate this mind, yet not to serve would offend those who know me—what can be done?”\n\nWunengzi said: “The mind of no-mind cannot be studied. If you are not at ease with serving or not serving, your doubts run deep—this is like leading a blind man to the edge of a pit and instructing him to go forward. The man of non-action does nothing he ought not do; the man of action refrains from what he ought not do.”",
      "overlap_context": "eriences sorrow, joy, pleasure, and anger—is this truly different from what one desires, possesses, and does while awake?”\n\nTong said: “There is no difference.”\n\nWunengzi said: “If there is no difference, then how do you know that what you do in dreams is dreaming, and what you do while awake is not dreaming? Moreover, a human life spans a hundred years, of which half is day and half is night—half sorrow, half joy. Why then should you complain? Guard the emptiness within, and focus your spirit.”",
      "start_char": 6977,
      "end_char": 7228,
      "start_sentence": 272,
      "end_sentence": 295,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.207308292388916,
      "metadata": {
        "source_file": "dao\\藏外\\无能子.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "故至实合乎 知常至公近乎 旡为以其本旡欲而无私也 欲于中渔樵耕牧有心也 不欲于中帝车侯服无心也 故圣人宜处则处宜行则行理安于独善则许由善卷不耻为匹夫势便于兼济则尧舜不辞为天子其为旡心一也 尧舜在位不以天子之贵贵乎 身是以垂衣裳而天下治及朱均不肖则以之授舜舜授禹舍其子如疣赘去天下如涕唾是以历万祀而天下思周公文王之子武王之弟天下熟其德矣 以成王在其势不便于己故不为天子以成王防其势宜于居摄故不敢辞是以全周之祀活周之民巍巍成功其德不此皆不欲于中而无所不为也 子能达此虽斗鸡走狗于屠肆之中搴旗斩将于兵阵之间可矣 况仕乎 答愚中子问第三",
      "translated_text": "Thus, utmost substance aligns with *knowing the constant*; utmost impartiality approaches *non-action*—for at its root, it is desireless and selfless. To desire within is to be a fisherman, woodcutter, farmer, or herdsman—this is having a mind. To be desireless within is to wear the imperial chariot’s robes and the marquis’ garments—this is having no mind. Therefore, the sage dwells where it is fitting to dwell, acts where it is fitting to act. When principle rests in solitary refinement, Xu You and Shan Juan think nothing of being common men. When circumstances favor universal salvation, Yao and Shun do not refuse to be emperors. Their *no-mind* is one and the same.\n\nYao and Shun, while on the throne, did not value their own persons with the nobility of the Son of Heaven—thus they governed the world with ease, merely draping their robes. When Zhu and Jun proved unworthy, they passed the throne to Shun, and Shun to Yu, casting off their sons like warts or tumors, discarding the world like spittle. For ten thousand generations, the world has cherished the memory of the Duke of Zhou, son of King Wen and brother of King Wu—how deeply his virtue was known! Yet when King Cheng was alive, the circumstances did not favor his own rule, so he did not become emperor. When the situation called for a regency, he did not dare refuse—thus preserving the Zhou’s sacrifices and saving its people. His towering achievements and virtue were no less than theirs. All these acted without desire within yet accomplished all things.\n\nIf you can grasp this, even if you chase chickens and dogs in the butcher’s market or seize banners and slay generals between the battle lines, it is permissible—how much more so, then, serving in office?\n\n*Answer to Yuzhongzi’s Question, Third Chapter*",
      "overlap_context": "oubt and asked Wunengzi: “I have long wished to study the mind of no-mind. To serve would violate this mind, yet not to serve would offend those who know me—what can be done?”\n\nWunengzi said: “The mind of no-mind cannot be studied. If you are not at ease with serving or not serving, your doubts run deep—this is like leading a blind man to the edge of a pit and instructing him to go forward. The man of non-action does nothing he ought not do; the man of action refrains from what he ought not do.”",
      "start_char": 7228,
      "end_char": 7486,
      "start_sentence": 296,
      "end_sentence": 307,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.619450569152832,
      "metadata": {
        "source_file": "dao\\藏外\\无能子.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "旡能子心友愚中子病心祈药于旡能子旡能子曰病何曰痛曰痛在何曰在心曰心在何愚中子告病已间矣旡能子曰此人可谓得天之真而神光不昧者也 鱼说第四 河有龙门古晋地禹所凿也 悬水数十仞淙其声雷然一舍之间河之巨鱼春则连群集其下力而上泝越其门者则化为龙于是拏云拽雨焉 河堧纤鳞望之相谓曰彼亦鱼也 而超变如此岂与我拨拨然堧而游戢戢然穴而藏哉 其一曰惑矣 汝之思也 夫天地之内物之颁形者千万焉 形之巨细分之大小相副焉 随其形足其分各适矣 彼超变者河之时波则与之惊澄则与之平意顺力浑沉浮安定及其思变也 连群而妬泝瀑而怒意疲力困乃云乃雨夫云雨来随蒸润之气自相感尔于彼何有哉 彼若有心于云雨之间有时而堕矣 无心自感又何功乎 角其上足其下与吾鬐鬣一也 吾鬐鬣而防彼角足而腾未尝不顺也 岂以吾堧防之无争穴藏之无虞人不知而害不加之乐易其角足云雨之劳乎 鸩说第五 鸩与蛇相遇鸩前而啄之蛇谓曰世人皆毒子矣 毒者恶名也 子所以有恶名者以食我也 子不食我则旡毒不毒则恶名亡矣 鸩笑曰汝岂不毒于世人哉 指我为毒是欺也 夫汝毒于世人者有心啮人也 吾怨汝之啮人所以食汝示刑也 世人审吾之能刑汝故畜吾以防汝又审汝之毒染吾毛羽肢体故用杀人吾之毒汝之毒也 吾疾恶而其名尔然杀人者人也 犹人持兵而杀人也 兵罪乎 人罪乎",
      "translated_text": "*The Fish’s Discourse, Fourth Chapter*\n\nWunengzi’s heart befriended Yuzhongzi, who suffered from heartache and sought medicine from him. Wunengzi asked, “What ails you?”\n“Pain,” he replied.\n“Where is the pain?”\n“In the heart.”\n“Where is the heart?”\nYuzhongzi’s illness then abated. Wunengzi said, “This man may be called one who has grasped the true essence of Heaven, whose spirit-light remains undimmed.”\n\nThe Yellow River has a Dragon Gate, carved by Yu in ancient Jin. The cascading waters plunge dozens of ren, their roar like thunder. Within a single day’s journey, the river’s great fish gather in spring, thronging below. Those that strain upward and ascend the gate transform into dragons, then ride the clouds and drag the rain.\n\nThe small fish of the river shallows, seeing them, said to one another, “They too are fish—yet how surpassing their transformation! How can they compare to us, who drift listlessly in the shallows or hide timidly in our holes?”\nOne among them said, “You are deluded by your own thoughts. Of the ten thousand things within Heaven and Earth that receive form, each is apportioned size and measure in accord with its kind. As their forms suffice, so do their allotments—each finds its proper place. Those who transform do so with the river’s timing: when waves surge, they rise with them; when waters calm, they rest in peace. Their wills align, their strength merges, and they move or settle without conflict. Yet when they conceive the desire to change, they throng in envy, struggle against the torrent, and rage in exhaustion—then come clouds, then comes rain. But clouds and rain arise from the mutual resonance of steaming, moistening qi—what has that to do with them? If they harbored intent amid clouds and rain, they would sometimes fail. Without intent, they respond naturally—what merit is there in that? Their horns crown their heads, their legs support their bellies, just as my fins and scales do. My fins and scales guard me, while their horns and legs propel them upward—have I not also followed the Way? Should I resent my shallows for lacking contention, my holes for lacking peril, or the fact that men do not know me and no harm befalls me, and thus abandon the ease of my fins and scales for the toil of horns, legs, and clouds and rain?”\n\n*The Quail’s Discourse, Fifth Chapter*\n\nA quail encountered a snake and pecked at it. The snake said, “All in the world call you poisonous. Poison is an evil name—you bear this evil name because you eat me. If you did not eat me, you would be without poison, and the evil name would vanish.”\nThe quail laughed and said, “Are you not poisonous to the world? To call me poison is deceit. You poison the world by deliberately biting people. I resent your biting, so I eat you as punishment. The world knows I can punish you, so they keep me to guard against you. They also know your poison clings to my feathers, limbs, and body, so they use me to kill. My poison is your poison. I detest evil and thus bear its name—yet it is men who kill. It is like a man wielding a weapon to kill: is the weapon at fault, or the man?”",
      "overlap_context": "situation called for a regency, he did not dare refuse—thus preserving the Zhou’s sacrifices and saving its people. His towering achievements and virtue were no less than theirs. All these acted without desire within yet accomplished all things.\n\nIf you can grasp this, even if you chase chickens and dogs in the butcher’s market or seize banners and slay generals between the battle lines, it is permissible—how much more so, then, serving in office?\n\n*Answer to Yuzhongzi’s Question, Third Chapter*",
      "start_char": 7486,
      "end_char": 8002,
      "start_sentence": 308,
      "end_sentence": 339,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.637171268463135,
      "metadata": {
        "source_file": "dao\\藏外\\无能子.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "则非吾之毒也 明矣 世人所以畜吾而不畜汝又明矣 吾无心毒人而疾恶得名为人所用吾所为能全其身也 全身而甘恶名非恶名矣 汝以有心之毒盱睢于草莽之间伺人以自快今遇我天也 而欲诡辩苟免邪蛇不能答鸩食之夫昆虫不可以有心况人乎 答鲁问第六【凡二篇】 旡能子从父之弟鲁求学于旡能子旡能子曰何学曰学行学文旡能子曰吾不知所以行所以文然前志中所谓圣人者吾尝偶观之其言曰行行也 行其心之所善也 文仪也 饰其所行之善也 防者本乎 哀哀行也 齐衰之服祭祀之具文也 礼者本乎 敬敬行也 升降揖让文也 乐者本乎 和和行也 陶匏丝竹文也 文出于行行出于心心出于自然不自然则心生心生则行薄行薄则文缛文缛则伪伪则乱乱则圣人所以不能救也 夫总其根者不求其末专其源者不寻其流汝能证以无心还其自然前无圣人上无天行与文在乎 无学之中矣 鲁他日又问曰鲁尝念未得而忧追已徃而悲得酒酣醉陶然不知今则不能忘乎酒矣旡能子曰汝之忧汝之悲自形乎自心乎曰自心可睹乎曰不可睹旡能子曰不可睹者忧悲之所生也求忧悲之所生且不可睹忧悲何寄哉忧悲无寄则使汝遂其未得还其已徃又将谁付邪今汝随而悲忧之是欲系风擒影也汝无忧悲之所寄而有味酒之陶然不能自得反浸渍于曲蘖岂酿器乎 第七【阙】 纪见第八【凡三篇】",
      "translated_text": "Then it is clearly not my poison. It is also clear why the world keeps me and not you. I have no intention to poison people, yet I am named for detesting evil and thus am used by men—this is how I preserve my life. To preserve life and willingly bear an evil name is no evil name at all. You, with your deliberate poison, lurk in the grasses and thickets, lying in wait to satisfy yourself at others’ expense. Now that you have met me, it is Heaven’s will—yet you still seek sophistry to escape? The snake could not reply, and the quail ate it.\n\nHow can insects possess intention—let alone men?\n\n**Sixth Chapter: Answering Lu’s Questions** *(Two Sections)*\n\nWu Nengzi’s nephew Lu came to study under him. Wu Nengzi said, “What do you seek to learn?”\nLu replied, “I wish to learn conduct and learning.”\nWu Nengzi said, “I do not know how to teach conduct or learning. Yet in the former records, there is mention of the sage—I have occasionally observed it. His words say: *Conduct is action—acting upon what the heart deems good. Learning is ornament—adorning the goodness of one’s actions.*\n\nMourning is rooted in sorrow—sincere grief is conduct; the hempen garments and sacrificial vessels are ornament. Ritual is rooted in reverence—reverent action is conduct; the bowing, rising, yielding, and deferring are ornament. Music is rooted in harmony—harmonious action is conduct; the clay flutes, silk strings, and bamboo pipes are ornament.\n\nOrnament arises from conduct, conduct from the heart, and the heart from nature. If not natural, the heart stirs; when the heart stirs, conduct weakens; when conduct weakens, ornament becomes excessive; when ornament is excessive, falsehood arises; when falsehood arises, chaos follows—and this is why the sage cannot save it.\n\nOne who grasps the root does not seek the branches; one who focuses on the source does not chase the stream. If you can realize the absence of intention and return to nature, then before there were sages and above there was no Mysterious Heaven, conduct and ornament already existed within the unlearned.”\n\nAnother day, Lu asked again, “I often brood over what I have not attained and grieve, or lament what has already passed. When I drink wine and become drunk, I am blissfully unaware. Now, however, I cannot forget the wine.”\n\nWu Nengzi said, “Your grief and sorrow—do they take shape externally or arise from the heart?”\nLu said, “From the heart. Can they be seen?”\nWu Nengzi said, “What cannot be seen is where grief and sorrow are born. If even the source of grief and sorrow cannot be seen, where do they reside? If grief and sorrow have no residence, then who would you entrust with what you have not attained or what has already passed? Now, you follow and indulge in grief and sorrow—this is like trying to bind the wind or seize a shadow.\n\nYou have no residence for grief and sorrow, yet you savor the bliss of wine and cannot find contentment within, instead becoming steeped in fermentation like a brewing vessel.”\n\n**Seventh Chapter** *(Missing)*\n\n**Eighth Chapter: Ji’s Observations** *(Three Sections)*",
      "overlap_context": ", “Are you not poisonous to the world? To call me poison is deceit. You poison the world by deliberately biting people. I resent your biting, so I eat you as punishment. The world knows I can punish you, so they keep me to guard against you. They also know your poison clings to my feathers, limbs, and body, so they use me to kill. My poison is your poison. I detest evil and thus bear its name—yet it is men who kill. It is like a man wielding a weapon to kill: is the weapon at fault, or the man?”",
      "start_char": 8002,
      "end_char": 8506,
      "start_sentence": 340,
      "end_sentence": 366,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.143526554107666,
      "metadata": {
        "source_file": "dao\\藏外\\无能子.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "秦市幻人有能烈镬膏而溺其手足者烈镬不能坏而幻人笑容焉旡能子召而问之幻人曰受术于师术能却火之热然而诀曰视镬之烈其心先忘其身手足枯蘖也既忘枯蘖手足然后术从之悸则术败此吾所以得之旡能子顾谓其徒曰小子志之无心于身幻人可以寒烈镬况上德乎 旡能子寓于秦村景氏民舍一夕枭鸣其树景氏色忧将弹之旡能子止之景氏曰枭凶鸟也 人家将凶则枭来鸣杀之则庶几无凶旡能子曰人之家因其鸣而凶枭罪也 枭可凶人杀之亦不能弭其已凶将凶而鸣非枭忠而先示于人邪凶不自枭杀之害忠也 矧自谓人者与夫毛群羽族俱生于天地无私之气横目方足虚飞实走有所异者偶随气之清浊厚薄自然而形也 非宰于爱憎者也 谁令枭司其凶邪谥枭之凶谁所自邪天地言之邪枭自言之邪天地不言枭自不言何为必其凶邪谥枭之凶不知所自则羽仪五色谓之凤者未必祥枭未必凶景氏止家亦不凶 樊氏之族有羙男子年三十或被发疾走或终日端居不言言则以羊为马以山为水凡名一物多失其常名其家及乡人狂之而不之罪焉 旡能子亦狂之或一日遇于丛翳间就而叹曰壮男子也 且复丰硕惜哉 病如是狂者徐曰吾无病旡能子愕然曰冠带不守起居旡常失万物之名忘家乡之礼此狂也 何谓无病乎 狂者曰被冠带善起居爱家人敬乡里岂我自然哉 盖昔有妄作者文之以为礼使人习之至于今而薄醪因醇酎也 知之而反之者则反以为不知又名之曰狂且万物之名亦岂自然着哉 清而上者曰天黄而下者曰地烛昼者曰日烛夜者曰月以至风云雨露烟雾霜雪以至山岳江海草木鸟兽以至华夏边陲帝王公侯以至士农工商皂臧获以至是非善恶邪正荣辱皆妄作者强名之也 人久习之不见其强名之初故防之而不敢移焉 昔妄作者或谓清上者曰地黄下者曰天烛昼者月烛夜者日今亦防之矣 强名自人也 我亦人也",
      "translated_text": "In the marketplace of Qin, there was a conjurer who could plunge his hands and feet into boiling oil and searing cauldrons without harm. The cauldrons could not damage him, and the conjurer smiled. Wu Nengzi summoned him and asked how this was possible. The conjurer replied, “I learned this art from my master. The technique can repel the heat of fire, but the key lies in this: when gazing upon the searing cauldron, one must first forget the body—hands and feet are but withered branches. Only after forgetting the withered branches of the body does the technique follow. Fear disrupts the technique; this is how I mastered it.”\n\nWu Nengzi turned to his disciples and said, “Take heed, my students: when the body is forgotten, even a conjurer can withstand the searing cauldron. How much more so for one of supreme virtue?”\n\nWu Nengzi lodged at the home of a villager named Jing in Qin. One night, an owl hooted in a tree on the property. Jing’s face darkened with worry, and he prepared to shoot it down. Wu Nengzi stopped him. Jing said, “The owl is an ominous bird. When misfortune is about to befall a household, the owl comes to cry out. If we kill it, perhaps we can avert disaster.”\n\nWu Nengzi replied, “If a household meets misfortune because of the owl’s cry, then the owl is to blame. But if the owl is ominous, killing it will not undo the misfortune that has already begun. If it cries before misfortune strikes, is it not a loyal warning to man? Misfortune does not originate with the owl; to kill it would be to harm loyalty. Moreover, we who call ourselves human, along with the furred and feathered creatures, all arise from the impartial qi of Heaven and Earth. Some have horizontal eyes and square feet, some soar in emptiness, some tread upon the solid—these differences arise by chance, following the purity or turbidity, the thickness or thinness of qi, taking form naturally. They are not governed by love or hate. Who appointed the owl to preside over misfortune? Who bestowed the name ‘ominous’ upon it? Did Heaven and Earth declare it so? Did the owl declare itself so? Heaven and Earth do not speak, nor does the owl. Why must it be ominous? If the owl’s ominous reputation has no clear origin, then the five-colored bird called the phoenix is not necessarily auspicious, and the owl is not necessarily ominous. Your household will not meet misfortune.”\n\nAmong the Fan clan, there was a handsome man of thirty. Sometimes he let his hair loose and ran wildly; other times he sat motionless all day, saying nothing. When he did speak, he called sheep horses and mountains rivers. Whatever he named, he misnamed. His family and neighbors called him mad but did not blame him. Wu Nengzi also called him mad. One day, they met in a thicket. Wu Nengzi approached and sighed, “A fine man in his prime, so robust—what a pity his affliction is so severe.”\n\nThe madman slowly replied, “I am not afflicted.”\nWu Nengzi was startled. “You disregard proper attire, your conduct is erratic, you misname all things, and you forget the rites of home and village—this is madness. How can you say you are not afflicted?”\n\nThe madman said, “Wearing proper attire, conducting oneself with decorum, loving one’s family, and respecting one’s village—are these natural to me? Long ago, there were those who fabricated texts and called them rites, compelling people to practice them until they became ingrained. Now, thin wine is mistaken for rich brew. Those who recognize this and revert are deemed ignorant and called mad. Moreover, the names of all things—are they naturally fixed? That which is clear and above is called ‘Heaven’; that which is yellow and below is called ‘Earth.’ That which illuminates the day is called ‘sun’; that which illuminates the night is called ‘moon.’ Wind, clouds, rain, dew, mist, frost, snow; mountains, rivers, seas, grasses, trees, birds, beasts; Hua and Xia, the frontiers, emperors, kings, dukes, and marquises; scholars, farmers, artisans, merchants, servants, and slaves; right and wrong, good and evil, deviance and uprightness, honor and disgrace—all these are forced names fabricated by those who came before. People have grown accustomed to them and no longer see their arbitrariness, so they guard them and dare not alter them. If the ancients had called that which is clear and above ‘Earth’ and that which is yellow and below ‘Heaven,’ or if they had named the illuminator of day ‘moon’ and the illuminator of night ‘sun,’ we would now guard those names just as rigidly. Names are imposed by man. I, too, am a man.”",
      "overlap_context": "? If grief and sorrow have no residence, then who would you entrust with what you have not attained or what has already passed? Now, you follow and indulge in grief and sorrow—this is like trying to bind the wind or seize a shadow.\n\nYou have no residence for grief and sorrow, yet you savor the bliss of wine and cannot find contentment within, instead becoming steeped in fermentation like a brewing vessel.”\n\n**Seventh Chapter** *(Missing)*\n\n**Eighth Chapter: Ji’s Observations** *(Three Sections)*",
      "start_char": 8506,
      "end_char": 9184,
      "start_sentence": 367,
      "end_sentence": 386,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.67962074279785,
      "metadata": {
        "source_file": "dao\\藏外\\无能子.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "彼人何以强名我人胡为不可哉 则冠带起居吾得以随意取舍万状之物吾得以随意自名狂不狂吾且不自知彼不知者狂之亦宜矣 第九第十【阙】 固本第十一【凡四篇】 五兵者杀人者也 罗网者获鸟兽虫鱼者也 圣人造之然后人能相杀而又能取鸟兽鱼虫焉 使之知可杀知可取然后制杀人之罪设山泽之禁焉 及其衰世人不能保父子兄弟鸟兽鱼虫不暇育麛鹿鲲法令滋彰而不可禁五兵罗教之也 造之者复出其能自已乎 棺椁者济死甚矣 然其工之心非乐于济彼也 廹于利也 欲其日售则幸死幸死非怨于彼也 廹于利也 医者乐病幸其必瘳非乐于救彼而又德彼也 迫于利也 棺椁与医皆有济救幸死幸生之心非有憎爱各谐其所欲尔故无为之仁天下也 无棺椁与医之利在其济死瘳病之间而已 角触蹄蛇首蝎尾皆用其所长也审其所用故得防其所用而制之是以所用长者不如无用食桑之虫丝其肠者曰以丝自舍曰茧茧伏而化于是羽而蛾焉其禀也宜如此犹兽之胎鸟之卵俱非我由也智者知其丝可缕缕可织于是烹而缕之机杼以织之幅而缯之缯而衣之夫自将为蛾也非为乎人谋其衣而甘乎烹也所以烹者丝所累尔烹之者又非疾其也利所系尔夫兽之胎鸟之卵之茧俱其所禀也所禀独乎丝丝必烹似乎不幸也不幸似乎分也故无为者无幸无不幸何分乎 有为善不必福恶不必祸或制于分焉故圣人贵乎无为垤蚁井蛙示以虎豹之山鲸鲵之海必疑熟其所见也嗜欲世务之人语以无为之理必惑宿于所习也于是父不能传其子兄不能传其弟沈迷嗜欲以至于死还其元而无所生者举世无一人焉嗟乎无为在我也嗜欲在我也无为则静嗜欲则作静则乐作则忧常人惑而终不可使之达者所习症之也明者背习焉 第十二第十三第十四【阙】 旡能子卷下",
      "translated_text": "Those people imposed names upon us—why then can we not do the same? Thus, in hats and robes, in rising and resting, I may choose as I please; in the myriad forms of things, I may name them as I will. Whether I am mad or not, I myself do not even know—how much less do they, who do not know me, deserve to call me mad? Chapters Nine and Ten [missing].\n\n**Rooting the Foundation, Chapter Eleven** [Four chapters in total]\n\nThe five weapons are for killing men; nets and snares are for capturing birds, beasts, insects, and fish. The sages created them, and thereafter men could kill one another and also take birds, beasts, fish, and insects. Once they knew what could be killed and what could be taken, punishments for killing men and prohibitions for mountains and marshes were established.\n\nIn later, degenerate ages, men could no longer protect father and son, elder and younger brother; birds, beasts, fish, and insects had no leisure to breed; fawns and leviathans vanished. Laws and decrees multiplied yet could not be enforced—all because the five weapons and nets had taught them [how to kill and take].\n\nCan those who created these things then restrain their own power?\n\nCoffins and outer coffins serve the dead to an extreme degree, yet the craftsman’s heart takes no joy in aiding the dead—he is compelled by profit. Hoping for daily sales, he rejoices in death; his joy in death is not hatred for the dead—he is compelled by profit.\n\nPhysicians delight in illness, hoping for certain cures; they take no joy in saving the sick, nor do they feel gratitude toward them—they are driven by profit. Coffins and physicians both harbor the hope of aiding the dead or curing the sick, rejoicing in death or recovery, yet they harbor no love or hate; each merely fulfills its own desire. Thus, the benevolence of non-action extends throughout the world. The profit of coffins and physicians lies solely in the interval between aiding the dead and curing the sick.\n\nHorns that gore, hooves that trample, snake heads, scorpion tails—all employ their strengths. Discern their use, and one may guard against and control them. Thus, those who employ their strengths are not as good as those who have no use.\n\nThe worm that eats mulberry leaves spins silk from its gut—this is called the silkworm. When it spins silk to encase itself, it is called a cocoon. The cocoon lies dormant and transforms, then emerges as a moth. Its endowment is such by nature, just as the fetus of a beast or the egg of a bird—neither is of my doing.\n\nThe wise know that its silk can be reeled and woven. Thus, they boil it, reel the silk, work the loom and shuttle to weave it, stretch it into cloth, and make it into garments. The silkworm was to become a moth, not to provide clothing for man, nor did it delight in being boiled. What boils it is the burden of its silk; those who boil it do not hate the silkworm—they are bound by profit.\n\nThe fetus of a beast, the egg of a bird, the cocoon of a silkworm—all are their natural endowments. Yet the silkworm’s endowment is silk alone, and silk must be boiled—this seems unfortunate. Unfortunate, yet it seems fated. Thus, the man of non-action harbors no fortune, no misfortune—what fate is there?\n\nGood actions do not necessarily bring blessing; evil does not necessarily bring calamity. Some are constrained by fate. Therefore, the sage values non-action.\n\nShow an anthill or a well-frog a mountain of tigers and leopards or a sea of whales and leviathans, and it will surely doubt, so familiar is it with what it sees. Tell a man entangled in desires and worldly affairs of the principle of non-action, and he will surely be confused, so deeply has he lodged in habit.\n\nThus, a father cannot pass it to his son, an elder brother cannot pass it to his younger brother. Sunk in desires, they proceed to death, returning to their origin without having truly lived—throughout the world, not a single one.\n\nAlas! Non-action lies within me; desires lie within me. Non-action brings stillness; desires bring activity. Stillness brings joy; activity brings sorrow.\n\nThat ordinary men are confused and can never be made to understand is because habit has become their malady. The enlightened turn away from habit.\n\nChapters Twelve, Thirteen, and Fourteen [missing].\n\n*Wu Neng Zi, Scroll the Lower*",
      "overlap_context": "htness, honor and disgrace—all these are forced names fabricated by those who came before. People have grown accustomed to them and no longer see their arbitrariness, so they guard them and dare not alter them. If the ancients had called that which is clear and above ‘Earth’ and that which is yellow and below ‘Heaven,’ or if they had named the illuminator of day ‘moon’ and the illuminator of night ‘sun,’ we would now guard those names just as rigidly. Names are imposed by man. I, too, am a man.”",
      "start_char": 9184,
      "end_char": 9851,
      "start_sentence": 387,
      "end_sentence": 409,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.952013731002808,
      "metadata": {
        "source_file": "dao\\藏外\\无能子.txt",
        "category": "藏外"
      }
    }
  ]
}