{
  "source_id": "明道篇",
  "source_file": "chunked_daozang\\明道篇.json",
  "total_chunks": 6,
  "total_original_chars": 6650,
  "total_translated_chars": 36389,
  "total_translation_time": 191.38040137290955,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\众术类\\明道篇.txt",
    "category": "众术类"
  },
  "full_translation": "**Illuminating the Dao: A Treatise**\n\n**Title:** *Illuminating the Dao* (*Mingdao Pian*). Composed by Wang Weiyi of the Yuan dynasty. One fascicle. Based on the text from the *Zhengtong Daoist Canon*, *Dongzhen* section, *Zhongshu* category.\n\n**Preface to *Illuminating the Dao***\n\nThe Dao is inherently luminous, yet without humanity, it cannot be fully illuminated. When humanity illuminates the Dao, without the Dao, humanity cannot be perfected. Thus, the wise and discerning invariably establish teachings to reveal the Dao, preserving their true nature through it.\n\nIn my youth, I studied Confucianism and gained a rough understanding of the Six Classics, comprehending the Dao of benevolence, righteousness, ritual, music, and moral transformation, as well as the principles of heaven, earth, and the myriad things. I privately wondered: since the Three Powers (heaven, earth, and humanity) are founded upon the same Dao, why does the movement of heaven and earth endure so long, while the span of human life is so brief?\n\nUpon reading the words of *Laozi*, I was struck with realization: \"That by which heaven and earth endure so long is their non-self-cultivation, and thus they attain long life. That by which humans perish so swiftly is their insistence on self-preservation, and thus they invite early death.\" Observing the myriad creatures, I saw that beasts, birds, insects, and plants all undergo transformation—dung beetles become cicadas, rotting grass turns into fireflies, sparrows enter water and become clams, pheasants enter the sea and become giant clams, field mice transform into mandarin ducks, and fish scales become dragons. If even these beings can change, how much more so humanity, the most spiritually endowed of all creatures? Surely we can preserve our inherent nature and become immortals of eternal life.\n\nYet the six desires and seven emotions plunder our vitality, while the snares of fame and the shackles of profit deeply corrupt us. With such constant depletion, premature death becomes inevitable. We cherish life but lack the art of prolonging it; we dread death but possess no means to transcend it.\n\nHaving been born into this world and dwelling in the Central Kingdom, how could I not contemplate the great matter of life and death, seeking the method to transmit the Dao across ten thousand kalpas? Thus, I wandered beyond the mundane, pursuing the study of the Golden Elixir and the supreme Dao. Though I examined the scriptures of the Three Teachings, practiced thunder rites, supplications, medicine, divination, and astrology—mastering all without discrimination—and consulted both wise and foolish teachers and friends, I could not attain it in a single step. The Dao is most profound; only through diligent devotion day and night, accumulating sincerity until it moves heaven, did I finally encounter a perfected being who personally transmitted the supreme, most wondrous Dao. With a single word, the true essence was directly revealed.\n\nUpon reflection, I realized the Dao is not at all strange or esoteric; the key lies in utmost sincerity and the investigation of things to extend knowledge. Abandoning the selfishness of human desires and preserving the impartiality of heavenly principle, one naturally discovers boundless medicinal ingredients within the heart and infinite fire symbols within the body. The more the medicine is refined, the more inexhaustible it becomes; the more the fire is cultivated, the more ceaseless it grows.\n\nHaving attained this Dao, I dared not keep it for myself. Thus, I reverently composed eighty-one poems, adhering to the pure yang number of nine nines. Among them are sixteen heptasyllabic quatrains, corresponding to the number two eights; sixty-four jueju, corresponding to the sixty-four hexagrams; one pentasyllabic verse, symbolizing the singularity of the Great One; and twelve *Xijiangyue* lyrics, aligning with the twelve pitch standards. I titled this work *Illuminating the Dao*. Within it, the weights and measures of medicinal ingredients, fire times, and alchemical methods—details left incomplete in other elixir classics—are all fully expounded, serving as a guide.\n\nThe sages of old established teachings to reveal the Dao and preserve the true nature, yet the will of heaven is secret. How could one not fear the transgression of careless disclosure? Nevertheless, I vow that all under heaven who study this may attain the supreme Dao. If the intent is sincere, what need is there to chase after fortune and misfortune, stumbling along the way?\n\nTo those of like mind: if you can delve into the text, grasp its meaning, forget the images to follow the real, and attain even a single insight to hold it forever—this is my deepest wish.\n\nRespectfully inscribed in the mid-autumn of the *jiachen* year of the Dade era by Wang Weiyi, a later student from Songjiang, styled Jingyangzi.\n\n**Illuminating the Dao**\nComposed by Wang Jingyang, a later student from Songjiang.\n\n**Sixteen Regulated Poems Arranged by the Gate of Two and Eight**\n\nLife drifts like a dream through fleeting time,\nVainly hoarding wealth and amassing gold.\nSensual pleasures ravage heaven-and-earth’s nature,\nThe spirit chases after profit and fame.\nLove’s river tosses waves from which none escape,\nThe burning house sears deeper with each karmic deed.\nThus a whole life is idly spent—\nEven rebirth cannot compare to the present.\n\nTo study the Dao, first clarify essence, qi, and spirit;\nOnly by perfecting these three does the Dao draw near.\nTo speak of \"non-being\" or \"being\" is all delusion—\nTrace back to the source to grasp the real.\nHold to the central, unbiased thought,\nLuminous and free, unstained by dust.\nIf you fathom this mystery within the profound,\nThe Three Teachings all return to this single self.\n\nThe Dao of nature is fundamentally non-action,\nYet clinging to non-action becomes action.\nForget words once meaning is grasped—only then is it complete;\nClinging to form and image leads to confusion.\nWhen body and mind are still, they embrace heaven and earth,\nSpirit and qi harmonize, uniting Kan and Li.\nWho among men truly comprehends these wondrous secrets?\nHow many know them, how many perceive?\n\nThe Mysterious Pass is the hardest to illuminate—\nWithout mind-to-mind transmission, do not act rashly.\nIf you recognize where thoughts arise,\nYou will know the Dao is born within.\nBefore yin and yang divided, there was no form;\nWhen sun and moon conjoin, where is there emotion?\nIf you seek the true meaning,\nMidday is the third watch of the night.\n\nAll things arise within creation’s womb,\nYet once self and other divide, the Dao grows distant.\nWhen spring returns to the valley, every home warms,\nWhen the moon reaches the sky’s heart, every household shares its light.\nFish leaping and kites soaring follow this principle,\nCranes calling and children responding come from the depths.\nMy Dao, vast, embraces heaven and earth—\nYet to call it \"mindless\" is but emptiness.\n\nKan and Li together form one household,\nThe iron ox plows the river chariot day and night.\nNature returns to the primal sea, birthing golden nectar,\nLife reverts to emptiness, yielding jade blossoms.\nThe four images harmonize into one earth,\nThe five phases cluster to forge the three flowers.\nSilently circulating the fire of the celestial cycle,\nGolden flowers burst forth in ninefold radiance.\n\nYin and yang, movement and stillness cannot be forced—\nWasting spirit in vain striving is folly.\nThe Dao lies before you, yet most fail to perceive it;\nThe pearl hidden in the belly is known by few.\nYan lived in a humble lane yet his heart was ever joyful,\nShun dwelled in deep mountains yet his resolve never wavered.\nThe principle is the same throughout the world—\nTo rigidly divide teachings is but fragmentation.\n\nThe Dao’s sprouts lie within the body—\nWhy seek herbs or burn thatch?\nHeaven and earth, sun and moon turn with the heart,\nSoul and spirit unite as the will commands.\nKnow fate by observing Qian’s unbroken line,\nRejoice in heaven by contemplating Fu’s first hexagram.\nFortune and misfortune, regret and shame arise from action—\nAbide in stillness like a fool, delighting in the sage’s womb.\n\nThe supreme Dao has never been easily transmitted;\nThe true meaning lies in the center of creation.\nSplit open chaos to part heaven and earth,\nCleave the primordial mist to gather mercury and lead.\nIf desire is not extinguished, studying the Dao is futile;\nIf greed is not severed, seeking immortality is vain.\nTo know the place of returning to the source,\nThe fleeing hare and flying crow never leave the sky.\n\nI earnestly urge you to forget words once meaning is grasped—\nYet students cling to them, carving thorns.\nThe clear sky and bright moon of mid-autumn,\nThe green willows and red blossoms of second-month spring—\nWhy seek Buddha on Putuo,\nOr search for truth in grotto heavens?\nIf you know *this* true message,\nYou are a carefree being beyond the world.\n\nNo need to fixate on capturing the earthly soul,\nNor strive to restrain the celestial spirit.\nWithout the heart’s false thoughts, the Dao is hard to attain;\nCutting off intent and forgetting scheming is the return to the source.\nWhat need is there to divine hexagrams or cast lots?\nEven if you gain one, you have only met the origin.\n\nLet me reveal the immortal’s principle to you—\nIt does not lie in the three thousand six hundred gates.\nAll the myriad forms reside within Kun,\nBefore your eyes, yet no words can discuss it.\nCalm the mind, dispel desire—then spirit lives;\nNurture nature, forget form—then the Dao abides.\nAlways let the golden crow return to the moon’s cave,\nNever let the jade hare leave the sky’s root.\nWith but a moment’s effort,\nA grain of golden elixir enters the mouth and is swallowed.\n\nThe primordial One divides into two,\nFormless and imageless, yet following thought it arises.\nThe common folk know not its daily use,\nBut the sage investigates and moves with the times.\nNeither increasing nor diminishing, it dwells in the central Dao;\nNeither coming nor going, it guards single sincerity.\nAll phenomena before you\n\nDrool, spittle, essence, saliva, qi, blood, and fluids—\nDisciple, do not grasp these as the foundation of the elixir.\nWithin the heart lies the natural medicine,\nIn daily use and constant practice, you must know it.\n\nTo refine the elixir, use only gold within water,\nSeek it in the root of the primordial.\nWhen the first yang stirs,\nAct swiftly—do not hesitate.\n\nIf you do not recognize the yin essence, do not recklessly cultivate,\nVainly exhausting spirit and thought in futile pursuit.\nSimply preserve Heaven’s principle, free from selfish bias—\nNo need to ride the ox in search of the ox.\n\nTo refine the returning elixir, first employ lead,\nWithdraw and add fire with precise focus.\nHare and rooster bathe—beware danger,\nWithout movement, how can it accord with nature?\n\nTo study the Dao, first understand the moment of receiving qi,\nWhen in the womb, a single breath dwells in chaos.\nFollowing Kun’s body, return to Qian’s seed—\nA single spark of spirit pierces the Great Void.\n\nThe golden crow in the sky, the crimson in the sea,\nYin demons vanish—now is the time to work.\nDo not let qi grow turbid or spirit scatter,\nLest mercury flee, lead fly, and the elixir crucible empty.\n\nGather spirit, sit in stillness within the crystal palace,\nBone-chilling coolness, the heart’s earth empty.\nWater, fire, wood, and metal return to one place,\nNo more south or north, west or east.\n\nAt leisure, scoop the bright moon from the pool’s depths,\nWhen the hour comes, bind the clouds atop the peak.\nIn stillness, suddenly grasp the key to heaven and earth,\nThe myriad phenomena all fade into silence.\n\nTo refine cinnabar into living mercury,\nKnow that mercury is the spirit of cinnabar.\nIn truth, they are one—doubt not their duality,\nThe host sinks, the guest floats.\n\nThe generation of the Three Powers lies solely in this truth,\nForcibly named the Dao, the heart, the spirit.\nSitting or walking, they ever guard one another,\nYet foolish mortals, lost in delusion, refuse their kinship.\n\nTo refine the elixir, recognize the great returning heart,\nDo not seek it in side doors or minor arts.\nIn thirty thousand moments, without interruption,\nTurn tiles and stones into gold.\n\nThe medicine gathers the primordial true unity of qi,\nThe fire seeks the Supreme One’s chaos crystal.\nTo know where medicine and fire work,\nQi must be full, spirit complete—then the elixir forms.\n\nWithin the moon is the hare, the yang body,\nWithin the sun hides the rooster, the yin.\nIf you grasp hare and rooster returning to wu and ji,\nWhy enter the mountains to cultivate the Dao?\n\nThe Dao is formless, yet we force it a name,\nSeen not, heard not, soundless and scentless.\nIt embraces heaven and earth in boundless wonder,\nYet those of shallow fortune find it hard to achieve.\n\nSpirit loves life, yet people harm spirit,\nLaboring the heart, wasting qi, ruining the body.\nAlas! The world is thus—\nHow many attain the Dao and commune with spirit?\n\nLife and death both arise from the thirteen,\nWho awakens to delight in purity and leisure?\nOriginally empty, ever still,\nWhen thought ceases and the heart is void, one transcends the world.\n\nCherish essence, treasure qi, nurture the primordial spirit,\nBut toil and strain the body—keep them apart.\nIn solitude, non-action, without attachment,\nThe true person appears, leaving the mortal form.\n\nThe Dao generates heaven and earth, dividing into Kan and Li,\nKan and Li give birth to the myriad beings.\nOver years and ages, all return to dust,\nForget form—only then see the original truth.\n\nIn the world, humans are the spirit of the ten thousand things,\nYet all follow transformation without pause.\nIf you know where the ten thousand things return to their root,\nYou see how cold congeals water into ice.\n\nTo seek fish and hare, you must use traps and snares,\nWithout them, success is uncertain.\nYet do not cling to traps and snares as the true use—\nOnly then understand the state before chaos divided.\n\nThe medicine arises in the southwest, the path impassable,\nThe path opens—you must ask the master.\nBy the green willow embankment, ride the wind away,\nEverywhere, yellow sprouts—endless to gather.\n\nThe great medicine is none other than heaven and earth’s essence,\nGather it with secret intent, refine it to completion.\nFor the work of return is no shallow task—\nA moment’s error brings calamity.\n\nGather the medicine when gui is born,\nDo not mistake heavenly gui for rouge.\nIf you say breath is cultivation,\nHow can other things serve as the medicine’s king?\n\nThe method of beginning is rarely known,\nOnce grasped, seal your lips lest others stray.\nNow the celestial mechanism is revealed,\nExamine closely the Kun and Fu hexagrams.\n\nTo form the embryo, bind the original truth,\nNot apart from the body’s essence, qi, and spirit.\nGradually bind, gradually congeal—do not break the thread,\nTen months of work—then the true person is born.\n\nOnce true lead is used, discard it,\nLike a hen brooding eggs, qi unbroken.\nThe jade crucible’s warmth nurtures for three full years—\nWho says the mortal body cannot become immortal?\n\nBegin with Fu, end with Qian—yang fire completes its cycle,\nYin tally flourishes, seeking Kun.\nThe boundless intent of ten thousand ages—\nYou must ever begin within.\n\nIn the twelve hours, only one hour,\nWithin that hour, few know.\nWhen chaos first stirs at Qian’s inception,\nThe work of advancing fire cannot delay.\n\nCount a hundred moments as one,\nMedicine and fire must not part.\nUtterly pure, without a speck of impurity,\nOnly then trust the child nurtured in nothingness.\n\nEven if you know the body’s mercury and lead,\nWithout true earth, it is in vain.\nIf you say the yellow chamber is the earthen crucible,\nHow can you ascend to the ninth heaven?\n\nKnowing true earth, receiving the correct transmission,\nYet without understanding fire timing, it is still futile.\nClinging to hexagrams, moving through lines,\nWasting spirit, never becoming immortal.\n\nFire timing is non-action, harmonizing with nature,\nBeyond nature, there is no immortality.\nAlways preserve a single thought, dwelling in the central Dao,\nAsk not of prior or posterior heaven.\n\nDo not regard the embryo’s release as trivial,\nThis work demands precision.\nWhen the season arrives, grasp it firmly,\nReturn to the root, restore life—ascend the celestial altar.\n\nCompleting life is not as good as first completing nature,\nOnly when nature is bright does life become free of demons.\nTo know where nature and life reside,\nWhen intent has not yet arisen, unite with supreme harmony.\n\nLife may be transmitted, but nature is hard to pass on,\nThe foolish, blindly cultivating, are truly pitiable.\nWithout the true person’s oral instructions,\nExhausting spirit and soul only invites transgression.\n\nThe subtlety of my Dao lies in sincerity,\nWithout sincerity, nothing exists—the Dao is hard to approach.\nStill and unmoving, soundless and scentless,\nIn the midst of the indistinct, see the original truth.\n\nThe sage, without desire, is only pure unity,\nStill—empty and bright; moving—impartial.\nThe slightest interruption,\nAnd yin evil obscures, blocking the way.\n\nDo not depart for even a moment—this is the Dao,\nIs it not so in the twelve hours?\n\nGuard the center and harmony without admixture,\nAssisting heaven and aiding transformation—its wonder cannot be preempted.\nBefore human desire arises, heavenly principle abides;\nThe moment a thought stirs, spirits and gods already know.\n\nDo not deceive in the slightest or conceal—hold reverent awe,\nIn daily conduct and constant practice, never transgress.\nGood and evil both arise within a single thought;\nA single misstep in thought separates one by a thousand barriers.\n\nIf you know there is no good and no evil,\nYou will stand serene and immovable as Mount Tai.\nHuman nature is born inherently natural,\nOnly swayed by objects and led astray by emotion.\n\nIf you comprehend the principle within the hexagrams of *Qian*,\nYou will ever resemble a hidden dragon seen in the fields.\nThe human heart is perilous, the Dao-heart subtle—\nThe noble one, at all times, aligns with the sage’s mechanism.\n\nIn darkness, do not deceive as if in broad daylight;\nAlways practice vigilant solitude, never stray.\nWhen one curbs desire, one rests in peace;\nA single thought, clarified and empty, turns inward in observation.\n\nNeither impropriety nor unkindness—restrain reckless action,\nAnd naturally, regrets and misfortunes will not concern you.\nThe Dao resides in daily conduct and constant practice,\nNot in lofty discourse or emptiness.\n\nSimply follow the human Dao with an unashamed heart,\nAnd when you fully realize your nature, you will know heaven and earth as one.\nObserve *Qian* before a single line is drawn—what form does it take?\nWith the first stroke, the myriad images arise.\n\nRegrets, misfortunes, fortune, and calamity all stem from movement,\nYet *Qian* persists all day without departing from sincerity.\nAll affairs in the world arise from the heart,\nBut the heart, being formless, where can it be sought?\n\nIf you grasp it before a single thought arises,\nOnly then do you truly see the original heart.\nTo study the Dao, one must fathom the heart of heaven and earth,\nYet rarely does one hear of a kindred spirit in the world.\n\nThis principle is too profound to lightly disclose,\nSo most seek it along crooked byways and winding paths.\nBetween *Kun* and *Fu*, the principle is most subtle—\nEven spirits and gods, though wondrous, cannot fathom it.\n\nTo know this true message,\nStudy thoroughly Shao Yong’s *Winter Solstice* poem.\nWhen heaven and earth unite, the myriad things are born;\nOnly after spirit and thought arise does the Dao flourish.\n\nConstantly observe the wondrous flow of the Supreme Polarity—\nNothing exists without sincerity, and nothing fails to reach completion.\nThe central One receives the heart’s transmission of creation;\nThirsty, drink; hungry, eat; weary, sleep.\n\nWherever you encounter circumstances, all are wondrous applications—\nOnce you understand the mandate of sincerity, it is not left to heaven.\nThe moment a thought turns deluded, affliction arises;\nOnly when the heart is empty does the realm become empty.\n\nEmpty yet not empty—it can illuminate all,\nPerceiving without obstruction in the vastness of the Great Void.\nBefore you recognize true emptiness, do not speak of emptiness,\nFor clinging to emptiness easily loses the master.\n\nIf you wish to know the true message within emptiness,\nIt lies entirely in the undivided state of primordial chaos.\nAll things are empty, yet nature is not void—\nWithin emptiness, apply your effort.\n\nWhen emptiness reaches the point where not even a speck of dust can stand,\nA golden light fills the room, and the mysterious pearl appears.\nTo study the Dao, one must know the matter of life and death;\nWithout knowing life and death, one vainly seeks immortality.\n\nOnly by knowing life can one know death;\nComing and going without constraint, follow nature.\nOriginally, there is neither death nor life—\nA single errant thought gives rise to the myriad forms.\n\nIf you recognize where thoughts arise and cease,\nA bright moon shines in the central courtyard.\nBefore your eyes, no dharma can be sought—\nMountains remain green, waters flow on their own.\n\nWithin the twelve hours, maintain a single thought;\nWithin thought, no thought—this is true cultivation.\nTo shatter emptiness, no fists are needed;\nA dead heart sitting in vain is futile.\n\nThe master’s wondrous art requires few words—\nIt only teaches one to refine mercury and lead.\nIn cultivation, one must recognize the master within;\nWithout recognition, all cultivation is in vain.\n\nOnly by awakening to the true and constant can one attain the Dao,\nExiting the Three Realms and manifesting spiritual powers.\nAll dharmas are empty, not even one remains—\nLike a flake of snow melting in a red-hot furnace.\n\n*Qian* and *Kun*, *Li* and *Kan*—all are of no use;\nThe Great Dao was ever a level path.\n\n---\n\n**Regulated Verse**\n\nWondrously merging with the true and constant,\nUtterly without a trace of yin.\nIn profound obscurity, the supreme treasure is preserved;\nIn the indistinct, true gold is born.\n\nTo speak of the Dao is no longer the Dao;\nOnly when the heart is stilled is the heart seen.\nThe true creation of the primordial,\nIs sought solely within the One.\n\n---\n\n**Twelve *Xijiangyue***\n\nBefore the Supreme Polarity divided, chaos reigned;\nOnce the Two Modes emerged, it was no longer within.\nThe moment the first yang stirred, primordial chaos was broken—\nCreation began its workings from then on.\n\nWater and fire rise and sink, north and south;\nWood and metal are separated, east and west.\nSlightly shift the Dipper’s handle to point at *Kun*—\nAll five phases are interwoven.\n\nSun and moon conjoin at new and full moons,\nTortoise and snake are born in the void of *Xu* and *Wei*.\nThe *Xun* wind ever blows toward *Kan*—\nFire’s dryness must rely on the spirit-water.\n\nMovement and stillness both arise from the heart’s intent,\nHarmonizing with heaven’s virtue without transgression.\nThe wondrous principle is utterly clear—what doubt remains?\nWhy speak of the short and long, life and death?\n\nA single speck of true yang resides in *Kan*;\nMove it to transform the yin of *Li*.\nThis creation’s meaning is profound—\nOne must first clarify the heart and see nature.\n\nThe wonder lies in not being stained by a single speck of dust,\nNaturally, one remains unmoved by circumstances.\nPitiable are those in the world who lack kindred spirits—\nThose who grasp it transcend the ordinary and enter sagehood.\n\nThe Great Dao flows as one through ancient and modern,\nTransmitted mouth to mouth by sages.\nAlas, the common people do not know—\nThey are all lost in the pursuit of form and sound.\n\nNear at hand, no need to seek afar;\nWhy wait to encounter immortals?\nIt is clearly before your very eyes,\nIn daily conduct and constant practice—yet unseen.\n\nMy Dao is most noble and precious;\nWithout the innate capacity, it is hard to know.\nOne must subdue the self to reach non-action,\nOnly then is the original heavenly principle seen.\n\nThe myriad transformations all arise from within;\nFrom ancient times to now, nothing is lacking or in excess.\nIf one can ensure movement and stillness do not transgress,\nHow is one different from the immortals?\n\nTo study the Dao, one must be fierce and resolute,\nSteadfastly guarding the original heart to the end.\nNot even the slightest desire should intrude—\nOnly then can spirit congeal and qi settle.\n\nMovement and stillness never depart from the center;\nYang arises, and all yin is exhausted.\nDragon descends, tiger submits—spirits and gods revere;\nWhen the path is complete, one ascends to the immortal realm.\n\nOnce the golden elixir is attained, the task is done—\nNo need to seek the White Tiger or Green Dragon.\nClinging to written words and fixed images, the principle is hard to grasp;\nThe wonder lies in neither lead nor mercury.\n\nTemper and nurture the body and heart without movement,\nFilled with the harmonious qi of spring’s breeze.\nSuddenly, deluded thoughts vanish, and effort is gone—\nYet one still relies on the Yellow Dame to guide.\n\nThough you read a myriad alchemical classics,\nIf you do not understand true mercury and true lead,\nAnd if the fire times have not been transmitted,\nAll is blind cultivation and reckless refinement.\n\nA single phrase of true revelation is wondrously manifest—\nOnce grasped, the heart-ground becomes luminous.\nSpirit returns, qi submits—no deviation;\nMoment by moment, all is forged into one.\n\nThe Great Elixir has no weight or measure,\nWho knows its endless abundance when gathered?\nThe southwest’s secluded path is hard to traverse—\nYet with intent, no need to strain mind or force.\n\nKun’s *gui* congeals into the true seed,\nTransplanted to Qian’s palace to grow.\nThough mountain rains lash and winds rage,\nThe deep roots stand firm, unshaken below.\n\nTrue fire originally has no season,\nDo not bind it to days, months, or years.\nPonder the time before chaos was riven—\nWhat proof of years could then appear?\n\nLeap beyond the Five Phases’ domain,\nNot a thread of dust clings to your frame.\nOnly then is the wonder within wonders known—\nA single pearl of treasure will brightly shine.\n\nBathing is not in *mao* or *you*,\nNor is the solstice sought at midnight’s hour.\nSimply walk the central Way, no cultivation needed—\nThen trust that being arises from non-being’s power.\n\nThe cosmos rests within my grasp,\nI ride an iron horse at leisure’s pace.\nUnfettered, unbound, I wander free,\nDay and night, flowers in my hair, wine I embrace.\n\n*Li* and *Kan* know no south or north,\nWood and Metal do not divide east from west.\nHold sincerely to the one thought at the center,\nLet neither heart nor spirit stray or rest.\n\nTo recognize the true seed of past lives,\nSee through all things—self and other—empty, clear.\nAbide in stillness, return to primordial chaos,\nWhere Four Images and Five Phases disappear.\n\n**On the Subtleties of the Golden Elixir**\n\nThe Dao originally dwells in silence, beyond scent or sound,\nYet manifests in daily acts and constant motion.\nHeaven and Earth, vast as they are, cannot exist beyond this Dao,\nAnd the human heart, though subtle, holds it without exception.\n\nThe Dao resides in the human heart, unchanging through the ages,\nForgotten in the realm beyond words.\nYet when simplicity scattered and purity dissolved,\nThe human heart lost sight of the Dao.\nThe sages fell silent, and later generations had nothing to transmit.\nThus, the sages of Confucianism, Buddhism, and Daoism arose in their time,\nAdapting their teachings to the era,\nAll guiding the world back to the Dao.\n\nAlas, with the division of teachings,\nScholars clung to their own doctrines,\nEach exalting their views, private biases flourishing,\nAnd the common truth gradually faded.\nDid they not consider that the ancient sages established teachings to save their age,\nFollowing different paths to the same goal,\nShaping change like the square and circle—\nNot like the fixed vessels of which Zigong spoke?\n\nThus, when people fail to grasp the intent of our Master’s \"no intent, no necessity, no rigidity, no self,\"\nThe Buddha’s teaching of the Nature School cannot be realized—\nFor these are the very principles of the Master’s four \"no’s.\"\nThe Nature School is not something the careless can attain,\nYet Laozi’s Way of the Golden Elixir flourished.\nAll these teachings arose to remedy the ills of their time.\n\nAlas, the Way of the Golden Elixir thrives in a declining age.\nLater cultivators of the Golden Elixir,\nNot only fail to fathom its profound meaning,\nBut even in the *Wuzhen Pian* of Master Ziyang,\nThey misconstrue the fire times as \"not bound to seasons,\"\nThe solstice as \"not at midnight,\"\nAnd the bathing method as \"not in *mao* or *you*\"—\nAll empty comparisons.\n\nMaster Bai of Hainan gathered medicinal substances in stillness,\nAnd conducted fire times within non-action.\nThough his words can be recited,\nI have yet to see one who truly understands their meaning.\n\nMany cling to lead and mercury as medicinal materials,\nUsing years, months, days, and hours to regulate *zi*, *wu*, *mao*, and *you*,\nDrawing and adding according to seasonal nodes—\nSuch practices have not reached the true Way.\n\nSome recognize that lead and mercury are alternate names for medicinal substances,\nAnd that civil and martial forces govern the fire times,\nWhile years, months, days, hours, *zi*, *wu*, *mao*, and *you*\nAre but remnants of primordial chaos—\nThis is rare indeed.\n\nYet those who take the generation of medicinal substances as fire times—\nHow is this different from asking where the body was before parents were born,\nOr where qi existed before heaven and earth?\nSome remain ignorant and fail to comprehend,\nHow can they fully grasp the Dao?\nHave they not observed the workings of creation?\n\nThe sun and moon adorn the heavens,\nGrasses and trees cling to the earth,\nWind and thunder take form,\nRain and dew bring moisture—\nThese are not random occurrences.\nWhat force makes them so?\n\nThere must be something—\nSomething that is not a thing, yet governs things,\nThat takes form yet is not confined by form.\nAh! Is it not the true earth?\nIs it not the handle of the Dipper?\n\nThe true earth is the master of medicinal substances,\nThe handle of the Dipper is the pivot of fire times.\nProfound indeed!\nThe Master’s *Xici* says: \"Essence and qi become things, wandering souls bring change.\"\nMaster Pingshu’s *Dan Jing* states: \"True earth captures true lead, true lead restrains true mercury,\nThe Dipper’s handle revolves through the celestial cycle—\nOne must understand the culmination of gathering.\"\n\nMaster Haiqiong’s *Shang Wuzhen Shu* says:\n\"Within form, spirit is sovereign, for spirit is the life of form.\nWithin spirit, nature is supreme, for nature is the life of spirit.\nFrom the spirit within form, enter the nature within spirit—\nThis is called returning to the root and restoring life.\"\nScholars should seek beyond the words.\n\nThose who cannot look beyond the words,\nAnd merely say, \"Medicinal substances are fire times,\"\nWhat makes the Way of the Golden Elixir different\nFrom seeking a steed by following a picture,\nOr tuning a zither by gluing its pegs?\n\nIn essence, the key to the Golden Elixir lies in:\nDistancing oneself from sensual pleasures,\nConquering selfish desires,\nSetting aside self and others,\nFulfilling loyalty and filial piety,\nRectifying the heart and making intentions sincere,\nLike Yan’s simplicity, like Shen’s dullness.\n\nTake the Great Void as the crucible,\nThe sun and moon as medicinal materials,\nNon-action and spontaneity as fire times,\nPurity, stillness, and harmonious emptiness as nurturing,\nHaving a body beyond the body as rebirth,\nShattering the void as completion—\nOnly then can one merge with the Dao.\n\nAs Master Hainan said:\n\"Unite the myriad transformations into the One Dao,\nThen the world transforms itself, and all things follow naturally.\nGather all actions into the One Heart,\nThen the sage acts without acting, and all things arise without attachment.\"\n\nFrom this, we know that \"from Non-Ultimate comes the Supreme Ultimate,\nAnd the Supreme Ultimate is originally Non-Ultimate\"—\nThis is Master Lianxi’s Dao.\n\"The wondrous, singular spirit pervades the Dharma Realm\"—\nThis is the supreme vehicle of Master Ziyang.\n\nAt this point, what were once called the \"true soil\" and the \"Big Dipper’s handle\" are but fishing baskets and rabbit snares. My aim in awakening others to this Dao is not to indulge in florid words and distort the truth. Should I lead even a single person astray, Heaven above bears witness.\n\nAs for those heterodox paths that mislead with cunning defenses, let the earnest seeker know well how to choose.\n\nFellow aspirants of like mind, diligently practice this Way. With sincere accumulation and enduring effort, how could one’s attainment be limited to self-cultivation alone? Some may yet extend their virtue to benefit all under Heaven, partaking in the workings of Heaven and Earth, aiding transformation and nurturing life—how could this be a separate path?\n\n**Song of Attaining the Dao**\nThe Dao is hard to enter, hard to find,\nSpoken of with ease, yet who truly walks its path?\nHeterodox ways bewilder the world in myriad forms,\nAmong ten thousand seekers, scarcely one attains the truth.\n\nThere are those who study the Dao today,\nYet refuse to humble themselves—how pitiful!\nDeceiving Heaven, deceiving Earth, deceiving others,\nClaiming tenfold mastery before even grasping one.\n\nTo become an immortal is not so difficult,\nBut one must possess the essence of an immortal.\nThose without it should not act recklessly,\nFor every move invites karmic shadows and enmity.\n\nThis matter is no trifling art;\nIt rests entirely on virtue and hidden good deeds.\nSever deluded thoughts, still the greedy heart,\nStep by step, act by act, with steadfast roots and sincere mind.\nOnly when you awaken to your original nature and align it with the heart\nMay I dare speak to you of its true essence.\n\nStudying the Golden Elixir is easy to begin,\nBut first savor the *Zhongyong* and the *Book of Changes*.\nAll contrived effort and forced action are false,\nSpeaking of dragons and tigers brings no benefit—\nFor the body arises from the stirring of emotion.\n\nShould one persist in deluded practice, the path becomes thorny.\nInstead, contemplate the state before Heaven and Earth divided,\nWhere wondrous principle is ineffable, yet the heart knows naturally.\nThe body, above and below, is all yin,\nWhile the one yang essence eludes recognition.\nRound and complete, it abides ever near,\nNeither empty nor form, yet pervading all things under Heaven.\nWithin each thing lies a Supreme Ultimate,\nWithdrawn in secrecy, hidden within one’s nature,\nInvisible to sight, untraceable in search.\n\nMy elixir method is distinct:\nIt requires no days, hours, months, or years,\nNo fire times, no withdrawal or addition,\nNo division of self and other, no judgment of beauty or clumsiness.\nNeither born nor destroyed,\nNeither cultivated nor spoken of,\nHungry—eat; tired—sleep;\nIdle—sit in meditation; weary—rest.\nEncounter things and adapt; meet wine and drink,\nWithout strict fasting, yet the heart remains ever pure.\nWealth and glory hold no concern,\nFame, profit, right, and wrong are all severed.\nSerene and still, nurture the primordial spirit,\nWith not a single thought arising—this is the true realm.\n\nThe true realm is joyous,\nDay and night, beholding the mid-autumn moon within,\nNeither coming nor going, centered and upright,\nAll eight directions radiant and bright.\nNeither full nor lacking,\nLike a red furnace covered in snow.\nThough this skill is attained,\nOnly by shattering the void is completion achieved.\nCarefree and joyful, wandering at ease,\nThe troubles of the world no longer touch you.\n\nSeekers of the Dao, seize the moment!\nA hundred years of life pass like lightning.\nTo encounter this and not refine it is utter folly—\nDo not wait until old age, when spirit and qi are exhausted.\n\nTurn back swiftly, act with fierce resolve,\nSever the ties with a single stroke, draw blood.\nTo shed the mortal body and don the Dharma-body,\nCultivate the single thought with iron resolve.\n\nThese words are urgent,\nFor I have revealed the celestial mechanism in full.\nIf learners treat them as trivial,\nThey may come to regret it too late when their end draws near.\n\n**The Exposition on Illuminating the Dao concludes.**",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "明道篇 经名：明道篇。 元王惟一撰。 一卷。 底本出处：《正统道藏》洞真部众街类。 明道篇序 原夫道本常明，非人不足以明乎道。 人能明道，非道不足以成乎人。 是故，明哲之士，莫不立言以着道，以道而全身也。 余少业儒，粗通六经，而知仁义礼乐教化之道，天地人物变化之理。 窃怪夫三才既同此道而立，何天地之运如是其久，而人之数如是其短耶。 及观《老子》之言，怃然曰：天地之所以能长且久者，以其不自生，故能长生。 人之所以夭且速者，以其厚於求生，是以轻死。 远观诸物，则走飞动植皆能变化，粪虫变蝉，腐草化萤，雀入水而化蛤，雉入海而化蜃，田鼠化为驾锦，鳞化为龙。 况人为万物之灵，岂不能全其所固有，而为长生不死之仙乎。 盖其六欲七情所盗者众，名缰利锁所贼者深。 断丧既多，夭亡不免。 是徒自好生，而无延生之术。 莫不恶死，而无远死之方。 惟一既生人世，获处中华，可不念生死大事，以求万劫一传之方。 於是徧游方外，求金丹之学、上乘之道。 虽三教经书，行雷、祈祷、医卜、星数，无不备玫，贤愚师友，莫不参求，卒不能一蹴。 是道之至，旦暮勤奉，积忧成疾，诚达于天，得遇至人亲授无上至真妙道，一言之下，直指真诠。 退而阅之易之，道初无怪异，要在至心诚意，格物致知。 去人欲之私，存天理之公，自然见心中无限药材、身中无限火符，药愈探而不穷，火愈炼而不息矣。 惟一既得此道，不敢自私，谨以所学，着诗八十一首，以按纯阳九九之数。 内七言四韵一十六首，以按二八之数，内绝句六十四首，以按六十四卦。 五言一首，以象太一之奇。 西江月一十二阕，以周十二律吕。 名之曰：《明道篇》。 所谓药物火候斤两法度，诸丹经所未尽者，莫不敷露，所以率循。 先哲立言着道，以道全真之事，然天意秘密，宁无轻泄漏慢之愆但。 惟一誓愿天下学者，皆臻乎。 至道用心，既溥矣。 奚暇为祸福，而踵跋哉。 同志之士，苟能寻文解意，忘象从真，一得永得，惟一之愿也。 时大德甲辰岁中秋，淞江后学景阳子王惟一谨序。 明道篇 淞江后学王景阳撰",
      "translated_text": "**Illuminating the Dao: A Treatise**\n\n**Title:** *Illuminating the Dao* (*Mingdao Pian*). Composed by Wang Weiyi of the Yuan dynasty. One fascicle. Based on the text from the *Zhengtong Daoist Canon*, *Dongzhen* section, *Zhongshu* category.\n\n**Preface to *Illuminating the Dao***\n\nThe Dao is inherently luminous, yet without humanity, it cannot be fully illuminated. When humanity illuminates the Dao, without the Dao, humanity cannot be perfected. Thus, the wise and discerning invariably establish teachings to reveal the Dao, preserving their true nature through it.\n\nIn my youth, I studied Confucianism and gained a rough understanding of the Six Classics, comprehending the Dao of benevolence, righteousness, ritual, music, and moral transformation, as well as the principles of heaven, earth, and the myriad things. I privately wondered: since the Three Powers (heaven, earth, and humanity) are founded upon the same Dao, why does the movement of heaven and earth endure so long, while the span of human life is so brief?\n\nUpon reading the words of *Laozi*, I was struck with realization: \"That by which heaven and earth endure so long is their non-self-cultivation, and thus they attain long life. That by which humans perish so swiftly is their insistence on self-preservation, and thus they invite early death.\" Observing the myriad creatures, I saw that beasts, birds, insects, and plants all undergo transformation—dung beetles become cicadas, rotting grass turns into fireflies, sparrows enter water and become clams, pheasants enter the sea and become giant clams, field mice transform into mandarin ducks, and fish scales become dragons. If even these beings can change, how much more so humanity, the most spiritually endowed of all creatures? Surely we can preserve our inherent nature and become immortals of eternal life.\n\nYet the six desires and seven emotions plunder our vitality, while the snares of fame and the shackles of profit deeply corrupt us. With such constant depletion, premature death becomes inevitable. We cherish life but lack the art of prolonging it; we dread death but possess no means to transcend it.\n\nHaving been born into this world and dwelling in the Central Kingdom, how could I not contemplate the great matter of life and death, seeking the method to transmit the Dao across ten thousand kalpas? Thus, I wandered beyond the mundane, pursuing the study of the Golden Elixir and the supreme Dao. Though I examined the scriptures of the Three Teachings, practiced thunder rites, supplications, medicine, divination, and astrology—mastering all without discrimination—and consulted both wise and foolish teachers and friends, I could not attain it in a single step. The Dao is most profound; only through diligent devotion day and night, accumulating sincerity until it moves heaven, did I finally encounter a perfected being who personally transmitted the supreme, most wondrous Dao. With a single word, the true essence was directly revealed.\n\nUpon reflection, I realized the Dao is not at all strange or esoteric; the key lies in utmost sincerity and the investigation of things to extend knowledge. Abandoning the selfishness of human desires and preserving the impartiality of heavenly principle, one naturally discovers boundless medicinal ingredients within the heart and infinite fire symbols within the body. The more the medicine is refined, the more inexhaustible it becomes; the more the fire is cultivated, the more ceaseless it grows.\n\nHaving attained this Dao, I dared not keep it for myself. Thus, I reverently composed eighty-one poems, adhering to the pure yang number of nine nines. Among them are sixteen heptasyllabic quatrains, corresponding to the number two eights; sixty-four jueju, corresponding to the sixty-four hexagrams; one pentasyllabic verse, symbolizing the singularity of the Great One; and twelve *Xijiangyue* lyrics, aligning with the twelve pitch standards. I titled this work *Illuminating the Dao*. Within it, the weights and measures of medicinal ingredients, fire times, and alchemical methods—details left incomplete in other elixir classics—are all fully expounded, serving as a guide.\n\nThe sages of old established teachings to reveal the Dao and preserve the true nature, yet the will of heaven is secret. How could one not fear the transgression of careless disclosure? Nevertheless, I vow that all under heaven who study this may attain the supreme Dao. If the intent is sincere, what need is there to chase after fortune and misfortune, stumbling along the way?\n\nTo those of like mind: if you can delve into the text, grasp its meaning, forget the images to follow the real, and attain even a single insight to hold it forever—this is my deepest wish.\n\nRespectfully inscribed in the mid-autumn of the *jiachen* year of the Dade era by Wang Weiyi, a later student from Songjiang, styled Jingyangzi.\n\n**Illuminating the Dao**\nComposed by Wang Jingyang, a later student from Songjiang.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 814,
      "start_sentence": 0,
      "end_sentence": 38,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.97452211380005,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\众术类\\明道篇.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "律诗一十六首按二八人之门 人生如梦度光阴，枉自培财与积金。 声色既戕天地性，精神又逐利名心。 爱河飘浪头难出，火宅煎熬业渐深。 只恁一生虚过了，改头换面不如今。 学道先明精气神，成全三物道方亲。 说无话有皆为妄，究本穷源始得真。 中正不偏存一念，圆明自在绝纤尘。 君还达此玄中妙，三教都归我一身。 自然之道本无为，若执无为便有为。 得意忘言方了彻，泥形执象转昏迷。 身心静定包天地，神气冲和会坎离。 料想这些真妙诀，几人会得几人知。 玄关一窍最难明，不得心传莫妄行。 若识念从何处起，方知道在个中生。 阴阳未判元无象，日月相交岂有情。 君更要知端的意，中天日午正三更。 万物同生造化中，才分彼我道难通。 春回谷口家家暖，月到天心户户同。 鱼跃鸢飞皆此理，鹤呜子和本由衷。 浩然吾道包天地，若说无心又是空。 离坎包藏共一家，铁牛昼夜运河车。 性归元海生金液，命复虚无产玉葩。 四象合和归一土，五行钻簇结三花。 如如默运周天火，迸出金花满九华。 阴阳动静不能推，枉费精神去妄为。 道在目前多自达，珠藏腹内少人知。 颜居陋巷心常乐，舜处深山志不移。 天下律然无二理，强分宗教转支离。 道在身中自有苗，何须寻草及烧茅。 乾坤日月随心转，魂魄精神遂意交。 知命常观乾未画，乐天时玩复初爻。 吉凶悔吝生乎动，终日如愚乐圣胞。 至道从来不易传，一中造化达真诠。 凿开混沌分天地，擘破洪蒙采汞铅。 欲念未除空学道，贪心不断谩求仙。 要知返本还源处，兔走乌飞不离天。 得意忘言诲尔谆，学人执着转刻榛。 天清气朗中秋月，柳绿花红二月春。 何必补陀求见佛，不须洞府去寻真。 若知○这个真消息，便是逍遥物外人。 不必留心擒地魄，如何着意制天魂。 非心妄念难成道，绝意忘机是返源。 岂在推爻兼布卦，直饶得一始逢元。 与君说破神仙理，不在三千六百门。 万象森罗总在坤，目前无法可谈论。 澄心遣欲神方活，养性忘形道自存。 常使金乌归月窟，莫交玉兔离天根。 大都片饷工夫到，一粒金丹入口吞。 先天一物 分为二，无象无形逐念生。 百姓不知为日用，圣人能究与时行。 不增不臧居中道，无去无来守一诚。 万境目前皆幻化，从教红紫乱纵横。 橐钥吹嘘藉巽风，一阳才动用神功。 黄婆骑虎归金阙，赤子乘龙下玉宫。 日会月交明 晦朔，水升火降应屯 蒙。 璇玑运转全三五，立见灵丹满鼎红。 不穷父母未生身，却去迷修受苦辛。 闭目存思皆是妄，死心枯坐尽非真。 要知动静参天地，须识浮沉定主宾。 性命混然成一片，此时无我亦无人。 学人谩说几千般，不遇真仙只自瞒。 沙裹淘金非易得，水中捉月转艰难。 断除六贼心方静，消尽三尸神始安。 体性湛然无一物，了知生死不相干。 绝句六十四首按六＋四卦 先天妙理本无言，举口才开属后天。 学者纷然成异见，不穷父母未生前。 本来一物甚幽微，无死无生谁得知。 动念举头常见面，起居坐卧镇相随。 天气分灵降气生，至玄至妙绝思量。 要降六贼常清静，须是掀天煅一场。 炼丹先要炼元精，炼得元精气便真。 气若聚时神必住，保全无漏作真人。 神哉至道在人心，亘古长存直至今。 尘俗昏迷浑不识，达观须向谷中寻。",
      "translated_text": "**Sixteen Regulated Poems Arranged by the Gate of Two and Eight**\n\nLife drifts like a dream through fleeting time,\nVainly hoarding wealth and amassing gold.\nSensual pleasures ravage heaven-and-earth’s nature,\nThe spirit chases after profit and fame.\nLove’s river tosses waves from which none escape,\nThe burning house sears deeper with each karmic deed.\nThus a whole life is idly spent—\nEven rebirth cannot compare to the present.\n\nTo study the Dao, first clarify essence, qi, and spirit;\nOnly by perfecting these three does the Dao draw near.\nTo speak of \"non-being\" or \"being\" is all delusion—\nTrace back to the source to grasp the real.\nHold to the central, unbiased thought,\nLuminous and free, unstained by dust.\nIf you fathom this mystery within the profound,\nThe Three Teachings all return to this single self.\n\nThe Dao of nature is fundamentally non-action,\nYet clinging to non-action becomes action.\nForget words once meaning is grasped—only then is it complete;\nClinging to form and image leads to confusion.\nWhen body and mind are still, they embrace heaven and earth,\nSpirit and qi harmonize, uniting Kan and Li.\nWho among men truly comprehends these wondrous secrets?\nHow many know them, how many perceive?\n\nThe Mysterious Pass is the hardest to illuminate—\nWithout mind-to-mind transmission, do not act rashly.\nIf you recognize where thoughts arise,\nYou will know the Dao is born within.\nBefore yin and yang divided, there was no form;\nWhen sun and moon conjoin, where is there emotion?\nIf you seek the true meaning,\nMidday is the third watch of the night.\n\nAll things arise within creation’s womb,\nYet once self and other divide, the Dao grows distant.\nWhen spring returns to the valley, every home warms,\nWhen the moon reaches the sky’s heart, every household shares its light.\nFish leaping and kites soaring follow this principle,\nCranes calling and children responding come from the depths.\nMy Dao, vast, embraces heaven and earth—\nYet to call it \"mindless\" is but emptiness.\n\nKan and Li together form one household,\nThe iron ox plows the river chariot day and night.\nNature returns to the primal sea, birthing golden nectar,\nLife reverts to emptiness, yielding jade blossoms.\nThe four images harmonize into one earth,\nThe five phases cluster to forge the three flowers.\nSilently circulating the fire of the celestial cycle,\nGolden flowers burst forth in ninefold radiance.\n\nYin and yang, movement and stillness cannot be forced—\nWasting spirit in vain striving is folly.\nThe Dao lies before you, yet most fail to perceive it;\nThe pearl hidden in the belly is known by few.\nYan lived in a humble lane yet his heart was ever joyful,\nShun dwelled in deep mountains yet his resolve never wavered.\nThe principle is the same throughout the world—\nTo rigidly divide teachings is but fragmentation.\n\nThe Dao’s sprouts lie within the body—\nWhy seek herbs or burn thatch?\nHeaven and earth, sun and moon turn with the heart,\nSoul and spirit unite as the will commands.\nKnow fate by observing Qian’s unbroken line,\nRejoice in heaven by contemplating Fu’s first hexagram.\nFortune and misfortune, regret and shame arise from action—\nAbide in stillness like a fool, delighting in the sage’s womb.\n\nThe supreme Dao has never been easily transmitted;\nThe true meaning lies in the center of creation.\nSplit open chaos to part heaven and earth,\nCleave the primordial mist to gather mercury and lead.\nIf desire is not extinguished, studying the Dao is futile;\nIf greed is not severed, seeking immortality is vain.\nTo know the place of returning to the source,\nThe fleeing hare and flying crow never leave the sky.\n\nI earnestly urge you to forget words once meaning is grasped—\nYet students cling to them, carving thorns.\nThe clear sky and bright moon of mid-autumn,\nThe green willows and red blossoms of second-month spring—\nWhy seek Buddha on Putuo,\nOr search for truth in grotto heavens?\nIf you know *this* true message,\nYou are a carefree being beyond the world.\n\nNo need to fixate on capturing the earthly soul,\nNor strive to restrain the celestial spirit.\nWithout the heart’s false thoughts, the Dao is hard to attain;\nCutting off intent and forgetting scheming is the return to the source.\nWhat need is there to divine hexagrams or cast lots?\nEven if you gain one, you have only met the origin.\n\nLet me reveal the immortal’s principle to you—\nIt does not lie in the three thousand six hundred gates.\nAll the myriad forms reside within Kun,\nBefore your eyes, yet no words can discuss it.\nCalm the mind, dispel desire—then spirit lives;\nNurture nature, forget form—then the Dao abides.\nAlways let the golden crow return to the moon’s cave,\nNever let the jade hare leave the sky’s root.\nWith but a moment’s effort,\nA grain of golden elixir enters the mouth and is swallowed.\n\nThe primordial One divides into two,\nFormless and imageless, yet following thought it arises.\nThe common folk know not its daily use,\nBut the sage investigates and moves with the times.\nNeither increasing nor diminishing, it dwells in the central Dao;\nNeither coming nor going, it guards single sincerity.\nAll phenomena before you",
      "overlap_context": "t need is there to chase after fortune and misfortune, stumbling along the way?\n\nTo those of like mind: if you can delve into the text, grasp its meaning, forget the images to follow the real, and attain even a single insight to hold it forever—this is my deepest wish.\n\nRespectfully inscribed in the mid-autumn of the *jiachen* year of the Dade era by Wang Weiyi, a later student from Songjiang, styled Jingyangzi.\n\n**Illuminating the Dao**\nComposed by Wang Jingyang, a later student from Songjiang.",
      "start_char": 814,
      "end_char": 2141,
      "start_sentence": 39,
      "end_sentence": 114,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 27.232173204421997,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\众术类\\明道篇.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "涕唾精津气血液，学人莫执作丹基。 心中自有天然药，日用常行要得知。 炼丹只用水中金，须向先天根蒂寻。 待得一阳初动处，急须下手莫沉吟。 不识阴晶莫妄修，徒劳神思谩推求。 但存天理无私曲，不必骑牛更觅牛。 欲炼还丹先用铅，抽添火候要精专。 兔鸡沐浴须防险，不动如何合自然。 学道当明受气初，混然一息母胎居。 依坤生体归乾种，一点灵光彻太虚。 天上金乌海底红，阴魔遁迹好施功。 莫教气浊神昏散，汞走铅飞丹鼎空。 凝神静坐水晶宫，彻骨清凉心地空。 水火木金归一处，更无南北与西东。 闲来潭底捞明月，时到高峰缚住云。 静定顿开天地钥，森罗万象总无闻。 欲炼朱砂活水银，须知银即是砂神。 大都一物休疑二，主是沉兮浮是宾。 生育三才只此真，强名曰道曰心神。 同行同坐长相守，可惜愚迷不肯亲。 炼丹须识大还心，休向旁门小术寻。 三万刻中无间断，尽教瓦砾变成金。 药采先天真一炁，火寻太一混元晶。 要知药火工夫处，炁足神全丹始成。 月中有兔为阳体，日裹藏鸡却是阴。 会得兔鸡归戊己，何须修道入山林。 道本无形强立名，视之不见听无声。 包罗天地无穷妙，福薄绿微岂易成。 神爱生人人损神，劳心费气丧其身。 痛哉世上皆如此，达道通神有几人。 生死皆因有十三，谁能觉悟乐清闲。 本无一物常虚寂，念灭心空出世间。 惜精惜气养元神，苦志劳形使不亲。 寂寞无为无所着，真人出现离凡身。 道生天地分离坎，离坎生成万类身。 岁久年深俱化土，忘形方见本来真。 处世人为万物灵，尽随物化不曾停。 能知万物归根处，方见寒凝水结冰。 欲求鱼兔必蹄荃，不假蹄荃恐未然。 莫执蹄荃为实用，始明混沌未分前。 药产西南路不通，路通须问主人公。 绿杨堤畔乘风去，满地黄芽采不穷。 大药无过天地精，采来密意炼方成。 只缘还返功非浅，顷刻差违祸便生。 采药应须待癸生，休将天癸论红妆。 若言呼吸为修炼，他物如何做药王。 下手功夫罕得知，得之钳口恐人迷。 如今漏泄天机兴，坤复爻中子细推。 结胎须结本来真，不离身中精气神。 渐结渐凝休断续，工夫十月产真人。 用了真铅便弃损，如鸡覆卵气绵绵。 玉炉温养三年足，谁道凡身不化仙。 始复终乾阳火周，阴符遘旺到坤求。 寥寥万古无穷意，须向其中常起头。 十二时中只一时，一时辰内罕人知。 鸿蒙才肇乾初画，进火工夫岂在迟。 百刻常如一刻推，要须药火不相违。 纯清绝点浑无染，方信无中养就儿。 纵识身中汞与铅，不知真土也徒然。 若言土釜黄房是，安得飞升上九天。 真土知时得正传，不明火候亦徒然。 执为卦象行爻象，枉费精神不作仙。 火候无为合自然，自然之外别无仙。 常存一念居中道，莫问先天与后天。 脱胎莫作等闲看，此段工夫要的端。 时节到来牢把捉，归根复命上天坛。 了命不如先了性，性明了命始无魔。 要知性命安身处，意未萌时合太和。 命虽可授性难传，愚暗盲修实可怜。 不得至人亲口诀，精魂弄尽反招愆。 吾道精微在一诚，不诚无物道难亲。 寂然不动无声臭，恍惚之中见本真。 圣人无欲惟精一，静则虚明动则公。 才有丝毫相间断，阴邪昏蔽不能通。 须臾不离方为道，十二时中岂不然。",
      "translated_text": "Drool, spittle, essence, saliva, qi, blood, and fluids—\nDisciple, do not grasp these as the foundation of the elixir.\nWithin the heart lies the natural medicine,\nIn daily use and constant practice, you must know it.\n\nTo refine the elixir, use only gold within water,\nSeek it in the root of the primordial.\nWhen the first yang stirs,\nAct swiftly—do not hesitate.\n\nIf you do not recognize the yin essence, do not recklessly cultivate,\nVainly exhausting spirit and thought in futile pursuit.\nSimply preserve Heaven’s principle, free from selfish bias—\nNo need to ride the ox in search of the ox.\n\nTo refine the returning elixir, first employ lead,\nWithdraw and add fire with precise focus.\nHare and rooster bathe—beware danger,\nWithout movement, how can it accord with nature?\n\nTo study the Dao, first understand the moment of receiving qi,\nWhen in the womb, a single breath dwells in chaos.\nFollowing Kun’s body, return to Qian’s seed—\nA single spark of spirit pierces the Great Void.\n\nThe golden crow in the sky, the crimson in the sea,\nYin demons vanish—now is the time to work.\nDo not let qi grow turbid or spirit scatter,\nLest mercury flee, lead fly, and the elixir crucible empty.\n\nGather spirit, sit in stillness within the crystal palace,\nBone-chilling coolness, the heart’s earth empty.\nWater, fire, wood, and metal return to one place,\nNo more south or north, west or east.\n\nAt leisure, scoop the bright moon from the pool’s depths,\nWhen the hour comes, bind the clouds atop the peak.\nIn stillness, suddenly grasp the key to heaven and earth,\nThe myriad phenomena all fade into silence.\n\nTo refine cinnabar into living mercury,\nKnow that mercury is the spirit of cinnabar.\nIn truth, they are one—doubt not their duality,\nThe host sinks, the guest floats.\n\nThe generation of the Three Powers lies solely in this truth,\nForcibly named the Dao, the heart, the spirit.\nSitting or walking, they ever guard one another,\nYet foolish mortals, lost in delusion, refuse their kinship.\n\nTo refine the elixir, recognize the great returning heart,\nDo not seek it in side doors or minor arts.\nIn thirty thousand moments, without interruption,\nTurn tiles and stones into gold.\n\nThe medicine gathers the primordial true unity of qi,\nThe fire seeks the Supreme One’s chaos crystal.\nTo know where medicine and fire work,\nQi must be full, spirit complete—then the elixir forms.\n\nWithin the moon is the hare, the yang body,\nWithin the sun hides the rooster, the yin.\nIf you grasp hare and rooster returning to wu and ji,\nWhy enter the mountains to cultivate the Dao?\n\nThe Dao is formless, yet we force it a name,\nSeen not, heard not, soundless and scentless.\nIt embraces heaven and earth in boundless wonder,\nYet those of shallow fortune find it hard to achieve.\n\nSpirit loves life, yet people harm spirit,\nLaboring the heart, wasting qi, ruining the body.\nAlas! The world is thus—\nHow many attain the Dao and commune with spirit?\n\nLife and death both arise from the thirteen,\nWho awakens to delight in purity and leisure?\nOriginally empty, ever still,\nWhen thought ceases and the heart is void, one transcends the world.\n\nCherish essence, treasure qi, nurture the primordial spirit,\nBut toil and strain the body—keep them apart.\nIn solitude, non-action, without attachment,\nThe true person appears, leaving the mortal form.\n\nThe Dao generates heaven and earth, dividing into Kan and Li,\nKan and Li give birth to the myriad beings.\nOver years and ages, all return to dust,\nForget form—only then see the original truth.\n\nIn the world, humans are the spirit of the ten thousand things,\nYet all follow transformation without pause.\nIf you know where the ten thousand things return to their root,\nYou see how cold congeals water into ice.\n\nTo seek fish and hare, you must use traps and snares,\nWithout them, success is uncertain.\nYet do not cling to traps and snares as the true use—\nOnly then understand the state before chaos divided.\n\nThe medicine arises in the southwest, the path impassable,\nThe path opens—you must ask the master.\nBy the green willow embankment, ride the wind away,\nEverywhere, yellow sprouts—endless to gather.\n\nThe great medicine is none other than heaven and earth’s essence,\nGather it with secret intent, refine it to completion.\nFor the work of return is no shallow task—\nA moment’s error brings calamity.\n\nGather the medicine when gui is born,\nDo not mistake heavenly gui for rouge.\nIf you say breath is cultivation,\nHow can other things serve as the medicine’s king?\n\nThe method of beginning is rarely known,\nOnce grasped, seal your lips lest others stray.\nNow the celestial mechanism is revealed,\nExamine closely the Kun and Fu hexagrams.\n\nTo form the embryo, bind the original truth,\nNot apart from the body’s essence, qi, and spirit.\nGradually bind, gradually congeal—do not break the thread,\nTen months of work—then the true person is born.\n\nOnce true lead is used, discard it,\nLike a hen brooding eggs, qi unbroken.\nThe jade crucible’s warmth nurtures for three full years—\nWho says the mortal body cannot become immortal?\n\nBegin with Fu, end with Qian—yang fire completes its cycle,\nYin tally flourishes, seeking Kun.\nThe boundless intent of ten thousand ages—\nYou must ever begin within.\n\nIn the twelve hours, only one hour,\nWithin that hour, few know.\nWhen chaos first stirs at Qian’s inception,\nThe work of advancing fire cannot delay.\n\nCount a hundred moments as one,\nMedicine and fire must not part.\nUtterly pure, without a speck of impurity,\nOnly then trust the child nurtured in nothingness.\n\nEven if you know the body’s mercury and lead,\nWithout true earth, it is in vain.\nIf you say the yellow chamber is the earthen crucible,\nHow can you ascend to the ninth heaven?\n\nKnowing true earth, receiving the correct transmission,\nYet without understanding fire timing, it is still futile.\nClinging to hexagrams, moving through lines,\nWasting spirit, never becoming immortal.\n\nFire timing is non-action, harmonizing with nature,\nBeyond nature, there is no immortality.\nAlways preserve a single thought, dwelling in the central Dao,\nAsk not of prior or posterior heaven.\n\nDo not regard the embryo’s release as trivial,\nThis work demands precision.\nWhen the season arrives, grasp it firmly,\nReturn to the root, restore life—ascend the celestial altar.\n\nCompleting life is not as good as first completing nature,\nOnly when nature is bright does life become free of demons.\nTo know where nature and life reside,\nWhen intent has not yet arisen, unite with supreme harmony.\n\nLife may be transmitted, but nature is hard to pass on,\nThe foolish, blindly cultivating, are truly pitiable.\nWithout the true person’s oral instructions,\nExhausting spirit and soul only invites transgression.\n\nThe subtlety of my Dao lies in sincerity,\nWithout sincerity, nothing exists—the Dao is hard to approach.\nStill and unmoving, soundless and scentless,\nIn the midst of the indistinct, see the original truth.\n\nThe sage, without desire, is only pure unity,\nStill—empty and bright; moving—impartial.\nThe slightest interruption,\nAnd yin evil obscures, blocking the way.\n\nDo not depart for even a moment—this is the Dao,\nIs it not so in the twelve hours?",
      "overlap_context": "en crow return to the moon’s cave,\nNever let the jade hare leave the sky’s root.\nWith but a moment’s effort,\nA grain of golden elixir enters the mouth and is swallowed.\n\nThe primordial One divides into two,\nFormless and imageless, yet following thought it arises.\nThe common folk know not its daily use,\nBut the sage investigates and moves with the times.\nNeither increasing nor diminishing, it dwells in the central Dao;\nNeither coming nor going, it guards single sincerity.\nAll phenomena before you",
      "start_char": 2142,
      "end_char": 3455,
      "start_sentence": 115,
      "end_sentence": 189,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.81499123573303,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\众术类\\明道篇.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "保守中和无间杂，参天赞化妙难先。 人欲未萌天理在，念头才动鬼神知。 勿欺微隐严加畏，日用常行不可违。 善恶皆生一念间，苟差一念隔千关。 若知无善还无恶，安静巍然若太山。 天性生来本自然，只因物诱被情牵。 若明乾卦爻中理，常似港龙见在田。 人心危兮道心微，君子时时合圣机。 暗室勿欺如白日，常当谨独莫相违。 人能寡欲止於安，一念澄虚在内观。 非礼非仁休妄动，自然悔吝不相干。 道在常行日用中，休谈高妙与虚空。 但行人道心无愧，尽性方知天地同。 观乾未画是何形，一画才成万象生。 悔吝吉凶皆主动，乾乾终日不离诚。 人间万事从心出，心本无形何处寻。 一念未生前会得，那时方始见真心。 学道须穷天地心，罕闻世上有知音。 都绿此理难轻泄，尽向旁蹊曲径寻。 坤复之间理极微，鬼神虽妙也难窥。 要知这个真消息，熟读尧夫冬至诗。 天地相交万物生，精神念后道方亨。 常观太极流行妙，无物无诚不至成。 一中造化得心传，渴饮饥餐困便眠。 触处遇绿皆妙用，了知诚命不由天。 念头才妄成烦恼，直到心空境自空。 空不空兮能照了，洞观无碍太虚中。 未识真空莫说空，执空易失主人翁。 欲知空裹真消息，尽在鸿蒙未判中。 万物皆空性不虚，虚空裹面下工夫。 空到一尘无立处，金光满室见玄珠。 学道要知生死事，不知生死谩求仙。 能知生处方知死，去住无拘任自然。 本来无死亦无生，一念才差见万形。 若识念头生灭处，一轮明月照中庭。 目前无法可参求，山自青兮水自流。 十二时中存一念，念中无念是真修。 打破虚空不用拳，死心空坐谩徒然。 师传妙术无多语，只是教人炼汞铅。 修行要识主人公，不识修行尽落空。 能悟真常方得道，出离三界显神通。 万法皆空一也无，犹如片雪点红炉。 乾坤离坎皆无用，大道元来是坦途。 律诗一首 妙合真常体，浑无一点阴。 杳冥存至宝，恍惚产真金。 言道已非道，澄心始见心。 先天真造化，只向一中寻。 西江月一十二阕 太极未分混沌，两仪已非其中。 一阳才动破鸿蒙，造化从兹运用。 水火升沉南北，木金问隔西东。 略移斗柄指坤宫，尽把五行错综。 日月相交晦朔，龟蛇产在虚危。 巽风长向坎中吹，火燥必资神水。 动静皆由心意，与天合德无违。 洞然妙理更何疑，说甚短长生死。 一点真阳在坎，移来点化离阴。 这些造化义幽深，须是明心见性。 妙在一尘不染，自然对境无心。 可怜世上少知音，会得超凡入圣。 大道古今一脉，圣人口口相传。 奈何百姓不知焉，尽逐色声迷恋。 在迩不须求远，何消更遇神仙。 分明只在眼睛前，日用常行不见。 吾道至尊至贵，若非宿骨难知。 直须克己至无为，方见本然天理。 万化皆从中起，古今无剩无亏。 若能动静不相违，可与神仙何异。 学道须当猛烈，始终确守初心。 纤毫物欲不相侵，方得神凝气定。 动静不离中正，阳生剥尽群阴。 龙降虎伏鬼神钦，行满便登仙境。 得一金丹事毕，休寻白虎青龙。 泥文执象理难通，妙处非铅非汞。 温养身心不动，满怀和气春风。 顿然罔念又无功，还藉黄婆提董。 看尽丹经万卷，不明真汞真铅。 那堪火候不曾传，都是盲修瞎炼。 一句真诠妙显，得知心地昭然。 神归气伏不欹偏，刻刻打成一片。",
      "translated_text": "Guard the center and harmony without admixture,\nAssisting heaven and aiding transformation—its wonder cannot be preempted.\nBefore human desire arises, heavenly principle abides;\nThe moment a thought stirs, spirits and gods already know.\n\nDo not deceive in the slightest or conceal—hold reverent awe,\nIn daily conduct and constant practice, never transgress.\nGood and evil both arise within a single thought;\nA single misstep in thought separates one by a thousand barriers.\n\nIf you know there is no good and no evil,\nYou will stand serene and immovable as Mount Tai.\nHuman nature is born inherently natural,\nOnly swayed by objects and led astray by emotion.\n\nIf you comprehend the principle within the hexagrams of *Qian*,\nYou will ever resemble a hidden dragon seen in the fields.\nThe human heart is perilous, the Dao-heart subtle—\nThe noble one, at all times, aligns with the sage’s mechanism.\n\nIn darkness, do not deceive as if in broad daylight;\nAlways practice vigilant solitude, never stray.\nWhen one curbs desire, one rests in peace;\nA single thought, clarified and empty, turns inward in observation.\n\nNeither impropriety nor unkindness—restrain reckless action,\nAnd naturally, regrets and misfortunes will not concern you.\nThe Dao resides in daily conduct and constant practice,\nNot in lofty discourse or emptiness.\n\nSimply follow the human Dao with an unashamed heart,\nAnd when you fully realize your nature, you will know heaven and earth as one.\nObserve *Qian* before a single line is drawn—what form does it take?\nWith the first stroke, the myriad images arise.\n\nRegrets, misfortunes, fortune, and calamity all stem from movement,\nYet *Qian* persists all day without departing from sincerity.\nAll affairs in the world arise from the heart,\nBut the heart, being formless, where can it be sought?\n\nIf you grasp it before a single thought arises,\nOnly then do you truly see the original heart.\nTo study the Dao, one must fathom the heart of heaven and earth,\nYet rarely does one hear of a kindred spirit in the world.\n\nThis principle is too profound to lightly disclose,\nSo most seek it along crooked byways and winding paths.\nBetween *Kun* and *Fu*, the principle is most subtle—\nEven spirits and gods, though wondrous, cannot fathom it.\n\nTo know this true message,\nStudy thoroughly Shao Yong’s *Winter Solstice* poem.\nWhen heaven and earth unite, the myriad things are born;\nOnly after spirit and thought arise does the Dao flourish.\n\nConstantly observe the wondrous flow of the Supreme Polarity—\nNothing exists without sincerity, and nothing fails to reach completion.\nThe central One receives the heart’s transmission of creation;\nThirsty, drink; hungry, eat; weary, sleep.\n\nWherever you encounter circumstances, all are wondrous applications—\nOnce you understand the mandate of sincerity, it is not left to heaven.\nThe moment a thought turns deluded, affliction arises;\nOnly when the heart is empty does the realm become empty.\n\nEmpty yet not empty—it can illuminate all,\nPerceiving without obstruction in the vastness of the Great Void.\nBefore you recognize true emptiness, do not speak of emptiness,\nFor clinging to emptiness easily loses the master.\n\nIf you wish to know the true message within emptiness,\nIt lies entirely in the undivided state of primordial chaos.\nAll things are empty, yet nature is not void—\nWithin emptiness, apply your effort.\n\nWhen emptiness reaches the point where not even a speck of dust can stand,\nA golden light fills the room, and the mysterious pearl appears.\nTo study the Dao, one must know the matter of life and death;\nWithout knowing life and death, one vainly seeks immortality.\n\nOnly by knowing life can one know death;\nComing and going without constraint, follow nature.\nOriginally, there is neither death nor life—\nA single errant thought gives rise to the myriad forms.\n\nIf you recognize where thoughts arise and cease,\nA bright moon shines in the central courtyard.\nBefore your eyes, no dharma can be sought—\nMountains remain green, waters flow on their own.\n\nWithin the twelve hours, maintain a single thought;\nWithin thought, no thought—this is true cultivation.\nTo shatter emptiness, no fists are needed;\nA dead heart sitting in vain is futile.\n\nThe master’s wondrous art requires few words—\nIt only teaches one to refine mercury and lead.\nIn cultivation, one must recognize the master within;\nWithout recognition, all cultivation is in vain.\n\nOnly by awakening to the true and constant can one attain the Dao,\nExiting the Three Realms and manifesting spiritual powers.\nAll dharmas are empty, not even one remains—\nLike a flake of snow melting in a red-hot furnace.\n\n*Qian* and *Kun*, *Li* and *Kan*—all are of no use;\nThe Great Dao was ever a level path.\n\n---\n\n**Regulated Verse**\n\nWondrously merging with the true and constant,\nUtterly without a trace of yin.\nIn profound obscurity, the supreme treasure is preserved;\nIn the indistinct, true gold is born.\n\nTo speak of the Dao is no longer the Dao;\nOnly when the heart is stilled is the heart seen.\nThe true creation of the primordial,\nIs sought solely within the One.\n\n---\n\n**Twelve *Xijiangyue***\n\nBefore the Supreme Polarity divided, chaos reigned;\nOnce the Two Modes emerged, it was no longer within.\nThe moment the first yang stirred, primordial chaos was broken—\nCreation began its workings from then on.\n\nWater and fire rise and sink, north and south;\nWood and metal are separated, east and west.\nSlightly shift the Dipper’s handle to point at *Kun*—\nAll five phases are interwoven.\n\nSun and moon conjoin at new and full moons,\nTortoise and snake are born in the void of *Xu* and *Wei*.\nThe *Xun* wind ever blows toward *Kan*—\nFire’s dryness must rely on the spirit-water.\n\nMovement and stillness both arise from the heart’s intent,\nHarmonizing with heaven’s virtue without transgression.\nThe wondrous principle is utterly clear—what doubt remains?\nWhy speak of the short and long, life and death?\n\nA single speck of true yang resides in *Kan*;\nMove it to transform the yin of *Li*.\nThis creation’s meaning is profound—\nOne must first clarify the heart and see nature.\n\nThe wonder lies in not being stained by a single speck of dust,\nNaturally, one remains unmoved by circumstances.\nPitiable are those in the world who lack kindred spirits—\nThose who grasp it transcend the ordinary and enter sagehood.\n\nThe Great Dao flows as one through ancient and modern,\nTransmitted mouth to mouth by sages.\nAlas, the common people do not know—\nThey are all lost in the pursuit of form and sound.\n\nNear at hand, no need to seek afar;\nWhy wait to encounter immortals?\nIt is clearly before your very eyes,\nIn daily conduct and constant practice—yet unseen.\n\nMy Dao is most noble and precious;\nWithout the innate capacity, it is hard to know.\nOne must subdue the self to reach non-action,\nOnly then is the original heavenly principle seen.\n\nThe myriad transformations all arise from within;\nFrom ancient times to now, nothing is lacking or in excess.\nIf one can ensure movement and stillness do not transgress,\nHow is one different from the immortals?\n\nTo study the Dao, one must be fierce and resolute,\nSteadfastly guarding the original heart to the end.\nNot even the slightest desire should intrude—\nOnly then can spirit congeal and qi settle.\n\nMovement and stillness never depart from the center;\nYang arises, and all yin is exhausted.\nDragon descends, tiger submits—spirits and gods revere;\nWhen the path is complete, one ascends to the immortal realm.\n\nOnce the golden elixir is attained, the task is done—\nNo need to seek the White Tiger or Green Dragon.\nClinging to written words and fixed images, the principle is hard to grasp;\nThe wonder lies in neither lead nor mercury.\n\nTemper and nurture the body and heart without movement,\nFilled with the harmonious qi of spring’s breeze.\nSuddenly, deluded thoughts vanish, and effort is gone—\nYet one still relies on the Yellow Dame to guide.\n\nThough you read a myriad alchemical classics,\nIf you do not understand true mercury and true lead,\nAnd if the fire times have not been transmitted,\nAll is blind cultivation and reckless refinement.\n\nA single phrase of true revelation is wondrously manifest—\nOnce grasped, the heart-ground becomes luminous.\nSpirit returns, qi submits—no deviation;\nMoment by moment, all is forged into one.",
      "overlap_context": "austing spirit and soul only invites transgression.\n\nThe subtlety of my Dao lies in sincerity,\nWithout sincerity, nothing exists—the Dao is hard to approach.\nStill and unmoving, soundless and scentless,\nIn the midst of the indistinct, see the original truth.\n\nThe sage, without desire, is only pure unity,\nStill—empty and bright; moving—impartial.\nThe slightest interruption,\nAnd yin evil obscures, blocking the way.\n\nDo not depart for even a moment—this is the Dao,\nIs it not so in the twelve hours?",
      "start_char": 3455,
      "end_char": 4789,
      "start_sentence": 190,
      "end_sentence": 270,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.4597225189209,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\众术类\\明道篇.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "大药元无斤两，谁知愈采无穷。 西南幽远路难通，意到不劳神用。 坤癸结成真种，移来栽在乾宫。 山头雨打任狂风，吹撼根探不动。 真火本来无候，休拘日月时年。 试思混沌未分前，招甚时年证验。 跳出五行外面，丝毫不染尘缘。 方知这个妙中玄，一粒宝珠出现。 沐浴即非卯酉，子时冬至休求。 但行中道本无修，方信无中生有。 宇宙在乎吾手，常骑铁马闲游。 无拘无束且优游，日夜簪花酌酒。 离坎不分南北，木金岂间西东。 但诚一念守其中，勿使心神恣纵。 要识前身真种，洞观物我皆空。 寂然安静到鸿蒙，四象五行无用。 金丹造微论 夫道也者。 本於无声无臭之中，着於日用常行之际。 天地至大不能外此道，人心至微莫不具此道。 道在人心，千古一日，相忘於无言之表可也。 自夫朴散淳漓，人心昧道，圣人不言，后世何述。 於是儒释道之圣人，因时而出，随时设教，其智皆率天下而归於道也。 奈何教门一分，学者各执其说，互相高尚，私意横生，公道浸失。 抑不思先圣立教济时，殊途同轨，变化方圆，非若子贡之所谓器也。 故自世人，不明吾夫子母意、母必、母固、母我之道，而释氏性宗之教不得、不行，即夫子四母之旨也。 性宗，又非放心鸡犬者所能造，而老子金丹之道行焉。 莫不相与救时之弊也。 呜呼，金丹之道行，其世之衰乎。 后之修金丹者，非惟不能穷究厥旨，其於紫阳悟真之书，火候不用时，冬至不在子，及其沐浴法卯酉，诚虚比之语与。 夫海南白先生，采药物於不动之中，行火候於无为之内，之言能诵，言而晓其义者，吾未见其人矣。 往往执铅汞为药材，年月日时而运用子午卯酉，而抽添行节气为火候者，是故未至其道也。 或者知铅汞为药物之异名，文武为火候之依，约年月日时子午卯酉，又皆混沌之余事，是亦可谓绝无而仅有矣。 至於生药物为火候者，果何异父母未生以前，此身果何在一炁之先，天地果何有或乃昧而不通焉。 亦岂足以尽道哉，是未之思也，是不观之造化乎。 日月丽乎天，草木丽乎土，风霆之流形，雨露之润泽，固非适然，抑何使之而然耶。 盖必有物，物而不物於物、形形而不形於形者，存嗟乎。 其真土乎，其斗柄乎。 真土者，药物之主。 斗柄者，火候之枢。 至哉。 夫子《击辞》曰：精气为物，游魂为变，仁哉。 《平叔丹经》曰：真土擒真铅，真铅制真汞，斗柄运周天，要人解攒簇尽矣哉。 海琼先生《上悟真书》曰：形中以神为君，神乃形之命，神中以性为极，性乃神之命，自形中之神，以入神中之性，此谓归根复命。 学者当於言外求之可也，未能於言外求之而徒，尔曰药物者，火候也。 金丹之道是何，异於按图而索骥、胶柱而调瑟者乎。 大抵金丹之要，必也远声色，克己私，屏人我，全忠孝，正心诚意，如颜之愚，如参之鲁。 以太虚为鼎器，以乌兔为药材，以无为自然为火候，以清静冲和为温养，以身外有身为脱胎，以打破虚空为了当，而后可以合。 海南先生所谓，会万化而归一道，则天下皆自化，而万化皆自如。 会百为於一心，则圣人自无为而百为，自无着之奥矣。 由是知无极而太极、太极本无极者，濂溪先生之道也。 一灵妙有法界圆通者，紫阳最上一乘之妙也。",
      "translated_text": "The Great Elixir has no weight or measure,\nWho knows its endless abundance when gathered?\nThe southwest’s secluded path is hard to traverse—\nYet with intent, no need to strain mind or force.\n\nKun’s *gui* congeals into the true seed,\nTransplanted to Qian’s palace to grow.\nThough mountain rains lash and winds rage,\nThe deep roots stand firm, unshaken below.\n\nTrue fire originally has no season,\nDo not bind it to days, months, or years.\nPonder the time before chaos was riven—\nWhat proof of years could then appear?\n\nLeap beyond the Five Phases’ domain,\nNot a thread of dust clings to your frame.\nOnly then is the wonder within wonders known—\nA single pearl of treasure will brightly shine.\n\nBathing is not in *mao* or *you*,\nNor is the solstice sought at midnight’s hour.\nSimply walk the central Way, no cultivation needed—\nThen trust that being arises from non-being’s power.\n\nThe cosmos rests within my grasp,\nI ride an iron horse at leisure’s pace.\nUnfettered, unbound, I wander free,\nDay and night, flowers in my hair, wine I embrace.\n\n*Li* and *Kan* know no south or north,\nWood and Metal do not divide east from west.\nHold sincerely to the one thought at the center,\nLet neither heart nor spirit stray or rest.\n\nTo recognize the true seed of past lives,\nSee through all things—self and other—empty, clear.\nAbide in stillness, return to primordial chaos,\nWhere Four Images and Five Phases disappear.\n\n**On the Subtleties of the Golden Elixir**\n\nThe Dao originally dwells in silence, beyond scent or sound,\nYet manifests in daily acts and constant motion.\nHeaven and Earth, vast as they are, cannot exist beyond this Dao,\nAnd the human heart, though subtle, holds it without exception.\n\nThe Dao resides in the human heart, unchanging through the ages,\nForgotten in the realm beyond words.\nYet when simplicity scattered and purity dissolved,\nThe human heart lost sight of the Dao.\nThe sages fell silent, and later generations had nothing to transmit.\nThus, the sages of Confucianism, Buddhism, and Daoism arose in their time,\nAdapting their teachings to the era,\nAll guiding the world back to the Dao.\n\nAlas, with the division of teachings,\nScholars clung to their own doctrines,\nEach exalting their views, private biases flourishing,\nAnd the common truth gradually faded.\nDid they not consider that the ancient sages established teachings to save their age,\nFollowing different paths to the same goal,\nShaping change like the square and circle—\nNot like the fixed vessels of which Zigong spoke?\n\nThus, when people fail to grasp the intent of our Master’s \"no intent, no necessity, no rigidity, no self,\"\nThe Buddha’s teaching of the Nature School cannot be realized—\nFor these are the very principles of the Master’s four \"no’s.\"\nThe Nature School is not something the careless can attain,\nYet Laozi’s Way of the Golden Elixir flourished.\nAll these teachings arose to remedy the ills of their time.\n\nAlas, the Way of the Golden Elixir thrives in a declining age.\nLater cultivators of the Golden Elixir,\nNot only fail to fathom its profound meaning,\nBut even in the *Wuzhen Pian* of Master Ziyang,\nThey misconstrue the fire times as \"not bound to seasons,\"\nThe solstice as \"not at midnight,\"\nAnd the bathing method as \"not in *mao* or *you*\"—\nAll empty comparisons.\n\nMaster Bai of Hainan gathered medicinal substances in stillness,\nAnd conducted fire times within non-action.\nThough his words can be recited,\nI have yet to see one who truly understands their meaning.\n\nMany cling to lead and mercury as medicinal materials,\nUsing years, months, days, and hours to regulate *zi*, *wu*, *mao*, and *you*,\nDrawing and adding according to seasonal nodes—\nSuch practices have not reached the true Way.\n\nSome recognize that lead and mercury are alternate names for medicinal substances,\nAnd that civil and martial forces govern the fire times,\nWhile years, months, days, hours, *zi*, *wu*, *mao*, and *you*\nAre but remnants of primordial chaos—\nThis is rare indeed.\n\nYet those who take the generation of medicinal substances as fire times—\nHow is this different from asking where the body was before parents were born,\nOr where qi existed before heaven and earth?\nSome remain ignorant and fail to comprehend,\nHow can they fully grasp the Dao?\nHave they not observed the workings of creation?\n\nThe sun and moon adorn the heavens,\nGrasses and trees cling to the earth,\nWind and thunder take form,\nRain and dew bring moisture—\nThese are not random occurrences.\nWhat force makes them so?\n\nThere must be something—\nSomething that is not a thing, yet governs things,\nThat takes form yet is not confined by form.\nAh! Is it not the true earth?\nIs it not the handle of the Dipper?\n\nThe true earth is the master of medicinal substances,\nThe handle of the Dipper is the pivot of fire times.\nProfound indeed!\nThe Master’s *Xici* says: \"Essence and qi become things, wandering souls bring change.\"\nMaster Pingshu’s *Dan Jing* states: \"True earth captures true lead, true lead restrains true mercury,\nThe Dipper’s handle revolves through the celestial cycle—\nOne must understand the culmination of gathering.\"\n\nMaster Haiqiong’s *Shang Wuzhen Shu* says:\n\"Within form, spirit is sovereign, for spirit is the life of form.\nWithin spirit, nature is supreme, for nature is the life of spirit.\nFrom the spirit within form, enter the nature within spirit—\nThis is called returning to the root and restoring life.\"\nScholars should seek beyond the words.\n\nThose who cannot look beyond the words,\nAnd merely say, \"Medicinal substances are fire times,\"\nWhat makes the Way of the Golden Elixir different\nFrom seeking a steed by following a picture,\nOr tuning a zither by gluing its pegs?\n\nIn essence, the key to the Golden Elixir lies in:\nDistancing oneself from sensual pleasures,\nConquering selfish desires,\nSetting aside self and others,\nFulfilling loyalty and filial piety,\nRectifying the heart and making intentions sincere,\nLike Yan’s simplicity, like Shen’s dullness.\n\nTake the Great Void as the crucible,\nThe sun and moon as medicinal materials,\nNon-action and spontaneity as fire times,\nPurity, stillness, and harmonious emptiness as nurturing,\nHaving a body beyond the body as rebirth,\nShattering the void as completion—\nOnly then can one merge with the Dao.\n\nAs Master Hainan said:\n\"Unite the myriad transformations into the One Dao,\nThen the world transforms itself, and all things follow naturally.\nGather all actions into the One Heart,\nThen the sage acts without acting, and all things arise without attachment.\"\n\nFrom this, we know that \"from Non-Ultimate comes the Supreme Ultimate,\nAnd the Supreme Ultimate is originally Non-Ultimate\"—\nThis is Master Lianxi’s Dao.\n\"The wondrous, singular spirit pervades the Dharma Realm\"—\nThis is the supreme vehicle of Master Ziyang.",
      "overlap_context": "eze.\nSuddenly, deluded thoughts vanish, and effort is gone—\nYet one still relies on the Yellow Dame to guide.\n\nThough you read a myriad alchemical classics,\nIf you do not understand true mercury and true lead,\nAnd if the fire times have not been transmitted,\nAll is blind cultivation and reckless refinement.\n\nA single phrase of true revelation is wondrously manifest—\nOnce grasped, the heart-ground becomes luminous.\nSpirit returns, qi submits—no deviation;\nMoment by moment, all is forged into one.",
      "start_char": 4790,
      "end_char": 6030,
      "start_sentence": 271,
      "end_sentence": 322,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.73127508163452,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\众术类\\明道篇.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "至此则所谓真土斗柄，又皆荃蹄尔。 吾将以斯道觉斯人也，非敢舞文而乱正也。 一毫悮人，皇天在上。 若夫旁门诡卫而惑人者，又在学者当知所择．焉。 同志之士，勤而行之，真积力久，岂惟独善一身。 或将兼善天下，参天地，赞化育，夫岂二道哉。 得道歌 道难入，道难觅，说之容易谁行得，旁门惑世几千般，得道万中难选一。 近有一等学道者，不肯低头真可惜，瞒天瞒地又瞒人，未得一而夸更十。 要做神仙固不难，神仙须是神仙质，不是神仙莫乱为，动有阴魔做冤隙。 这个事，非小术，全凭德行施阴德，断除妄念息贪心，步步行行脚根心实，若明本性与心同，方敢与君说端的。 学金丹，容易入，熟味《中庸》与《周易》，有为有作总皆非，说龙话虎终无益，元从情动有其身。 若更迷修转荆棘，常思混沌未分前，妙理难言心自然，一身上下皆属阴，一物阳精人不识，圆陀陀地镇相随，空不空兮色非色，散为万物遍乾坤，一物之中一太极，退藏於密一性中，视之不见寻不得。 我丹诀，自各别，不用日时与年月，也无火候与抽添，亦无人我分妍拙。 亦无生，亦不灭，亦无所修无所说，饥来吃饭困来眠，闲时打坐懒来歇，逢物便准逢酒饮，不持斋戒心常澈，荣华富贵不关心，名利是非皆杜绝，凝然静定养元神，一念不生真境别。 真境别，自欢悦，昼夜见个中秋，不来不往正当中，洞然八荒皆皎洁。 也无盈，也不缺，犹如红垆一片雪，虽然得到个工夫，打破虚空方了彻，逍遥快乐且优游，人间烦恼不相涉。 学道人，趁时节，百岁光阴如电掣，遇之不炼大愚痴，莫待老来神气竭。 急回头，当猛烈，一刀两段须见血，欲脱凡身换法身，精修一念当如铁。 说此言，太心切，尽把天机都漏泄，学人若作等闲看，柢恐临终悔不迭。 明道篇竟",
      "translated_text": "At this point, what were once called the \"true soil\" and the \"Big Dipper’s handle\" are but fishing baskets and rabbit snares. My aim in awakening others to this Dao is not to indulge in florid words and distort the truth. Should I lead even a single person astray, Heaven above bears witness.\n\nAs for those heterodox paths that mislead with cunning defenses, let the earnest seeker know well how to choose.\n\nFellow aspirants of like mind, diligently practice this Way. With sincere accumulation and enduring effort, how could one’s attainment be limited to self-cultivation alone? Some may yet extend their virtue to benefit all under Heaven, partaking in the workings of Heaven and Earth, aiding transformation and nurturing life—how could this be a separate path?\n\n**Song of Attaining the Dao**\nThe Dao is hard to enter, hard to find,\nSpoken of with ease, yet who truly walks its path?\nHeterodox ways bewilder the world in myriad forms,\nAmong ten thousand seekers, scarcely one attains the truth.\n\nThere are those who study the Dao today,\nYet refuse to humble themselves—how pitiful!\nDeceiving Heaven, deceiving Earth, deceiving others,\nClaiming tenfold mastery before even grasping one.\n\nTo become an immortal is not so difficult,\nBut one must possess the essence of an immortal.\nThose without it should not act recklessly,\nFor every move invites karmic shadows and enmity.\n\nThis matter is no trifling art;\nIt rests entirely on virtue and hidden good deeds.\nSever deluded thoughts, still the greedy heart,\nStep by step, act by act, with steadfast roots and sincere mind.\nOnly when you awaken to your original nature and align it with the heart\nMay I dare speak to you of its true essence.\n\nStudying the Golden Elixir is easy to begin,\nBut first savor the *Zhongyong* and the *Book of Changes*.\nAll contrived effort and forced action are false,\nSpeaking of dragons and tigers brings no benefit—\nFor the body arises from the stirring of emotion.\n\nShould one persist in deluded practice, the path becomes thorny.\nInstead, contemplate the state before Heaven and Earth divided,\nWhere wondrous principle is ineffable, yet the heart knows naturally.\nThe body, above and below, is all yin,\nWhile the one yang essence eludes recognition.\nRound and complete, it abides ever near,\nNeither empty nor form, yet pervading all things under Heaven.\nWithin each thing lies a Supreme Ultimate,\nWithdrawn in secrecy, hidden within one’s nature,\nInvisible to sight, untraceable in search.\n\nMy elixir method is distinct:\nIt requires no days, hours, months, or years,\nNo fire times, no withdrawal or addition,\nNo division of self and other, no judgment of beauty or clumsiness.\nNeither born nor destroyed,\nNeither cultivated nor spoken of,\nHungry—eat; tired—sleep;\nIdle—sit in meditation; weary—rest.\nEncounter things and adapt; meet wine and drink,\nWithout strict fasting, yet the heart remains ever pure.\nWealth and glory hold no concern,\nFame, profit, right, and wrong are all severed.\nSerene and still, nurture the primordial spirit,\nWith not a single thought arising—this is the true realm.\n\nThe true realm is joyous,\nDay and night, beholding the mid-autumn moon within,\nNeither coming nor going, centered and upright,\nAll eight directions radiant and bright.\nNeither full nor lacking,\nLike a red furnace covered in snow.\nThough this skill is attained,\nOnly by shattering the void is completion achieved.\nCarefree and joyful, wandering at ease,\nThe troubles of the world no longer touch you.\n\nSeekers of the Dao, seize the moment!\nA hundred years of life pass like lightning.\nTo encounter this and not refine it is utter folly—\nDo not wait until old age, when spirit and qi are exhausted.\n\nTurn back swiftly, act with fierce resolve,\nSever the ties with a single stroke, draw blood.\nTo shed the mortal body and don the Dharma-body,\nCultivate the single thought with iron resolve.\n\nThese words are urgent,\nFor I have revealed the celestial mechanism in full.\nIf learners treat them as trivial,\nThey may come to regret it too late when their end draws near.\n\n**The Exposition on Illuminating the Dao concludes.**",
      "overlap_context": "said:\n\"Unite the myriad transformations into the One Dao,\nThen the world transforms itself, and all things follow naturally.\nGather all actions into the One Heart,\nThen the sage acts without acting, and all things arise without attachment.\"\n\nFrom this, we know that \"from Non-Ultimate comes the Supreme Ultimate,\nAnd the Supreme Ultimate is originally Non-Ultimate\"—\nThis is Master Lianxi’s Dao.\n\"The wondrous, singular spirit pervades the Dharma Realm\"—\nThis is the supreme vehicle of Master Ziyang.",
      "start_char": 6030,
      "end_char": 6721,
      "start_sentence": 323,
      "end_sentence": 343,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.167717218399048,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\众术类\\明道篇.txt",
        "category": "众术类"
      }
    }
  ]
}