{
  "source_id": "易图通变",
  "source_file": "chunked_daozang\\易图通变.json",
  "total_chunks": 20,
  "total_original_chars": 22058,
  "total_translated_chars": 113892,
  "total_translation_time": 538.2603237628937,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏太玄部\\易图通变.txt",
    "category": "正统道藏太玄部"
  },
  "full_translation": "**The Comprehensive Transformations of the Yi Diagrams**\n\n*Scripture Title:* *The Comprehensive Transformations of the Yi Diagrams*\n*Original Author:* Daoist Lei Siqi of Linchuan\n*Five fascicles*\n*Source Text:* *Daoist Canon of the Zhengtong Era*, *Tai Xuan* Section\n*Collated Edition:* *Complete Library in Four Treasuries*, Wenyuan Pavilion edition, Classics Division, *Yi* Category (hereafter *Siku* edition)\n\n**Preface to *The Comprehensive Transformations of the Yi Diagrams* by Master Kongshan**\n\nThe *Daode* [*jing*], though but a few thousand words, is the sole scripture revered by our teaching—has there ever been an age that could dispense with it? Yet its commentaries and annotations proliferate endlessly, leaving one lost amid a tangle of obscurities, with no clear path to follow, only the ceaseless clamor of divergent branches.\n\nLei Siqi, devoted to learning with discernment, has delved deeply into this text, plumbing its hidden principles and original intent. He has composed an exegesis that harmonizes the shared ground of the Confucians and the Daoists, systematically refuting their divergences, organizing its threads with precision, and weaving them into a seamless whole. His work is no less than entering the very chamber of the Old Master, taking his seat to transmit its teachings.\n\nFor those who study this text to the end, thoroughly grasping its doctrines, the profound mystery within the mystery will become clear, and they will not lose sight of its direction. Passed down to future generations, this work may yet render no small benefit to our teaching.\n\n*Preface by Zhang Zongyan, the Succession Celestial Master of Jianzhai, in the bingxu year of the Zhiyuan era.*\n\nMaster Lei Siqi, styled Qixian, was a lofty scholar of Linchuan. After the fall of the Song, he lived in seclusion in the Empty Mountains, where he composed *The Comprehensive Transformations of the Yi Diagrams in Divination*, *The Original Meaning of the Laozi*, *The Essential Meaning of the Zhuangzi*—in all, several dozen fascicles—as well as *Three Fascicles of Poems in Harmony with Tao [Yuanming]*. He abandoned Confucian robes, styling himself a Daoist master in the yellow cap, and befriended Zeng Zigong, the former magistrate of Chun’an, and Wu Cheng, now a Hanlin Academician. Scholars and gentlemen from all quarters, drawn to his reputation, often initiated correspondence with him, and those who heard him lecture invariably felt their own limitations.\n\nYuan Tong, Hanlin Academician and Lecturer-in-Waiting—a man of vast learning and refined character—praised his writings, noting their precise and compelling citations, their power to stir the spirit and exhaust transformations, and their capacity to fully embrace change in service of the Dao. He declared: *\"To know Qixian is not to know Qixian’s intent.\"* In the present age, none are more esteemed as pillars of culture than Academician Wu; none are more celebrated for their writings than Academician Wu. Yet he also remarked: *\"In discussing the *Laozi*, [Lei] is most profoundly attuned.\"* He further commended Lei’s poetry as profound, meticulous, vigorous, and extraordinary, bearing the spirit of Du [Fu] and Han [Yu]. Truly, these are words of insight.\n\nAlas! Of old it was said that Yu Qing could not have written his works without poverty and sorrow, and that had the Grand Historian not suffered misfortune, the *Records of the Grand Historian* would never have been composed. How then could the aspirations of Master Lei, or the books he wrote, be measured by the standards of the common world? How could they be measured by the standards of the common world?\n\nFor nearly fifty years, I have read his writings and pondered the man behind them. Now, his disciples and grand-disciples—Fu Xingzhen and Zhou Weihe—have brought twenty scrolls of his poetry and prose to the capital, prompting me to inscribe these words in remembrance.\n\nIn the time of the late Emperor Shizu, after pacifying the lands south of the Yangtze, the court first summoned the thirty-sixth Heavenly Master to audience. Soon after, the Heavenly Master was entrusted with overseeing the Daoist teachings. Upon returning to his mountain, he respectfully invited Master Lei to serve as Lecturer in the Mysteries, instructing later generations in the profound learning. Though I was young at the time, I was already devoted to study and became his student. The Master often instructed me: *\"Literature is but one branch of the Dao. The purpose of learning is to illuminate this Dao. Without illuminating the Dao, one cannot attain the learning of the sages and worthies.\"* From then on, I grew daily in self-awareness and resolve. By the time I came of age, I entered the service of my late teacher at court, and thus could not remain with Master Lei to complete my studies.\n\nThe Master had annotated *The Comprehensive Meaning of Changes in the Yi Diagrams and Divination*, *The Original Meaning of the Laozi*, and *The Essential Meaning of the Zhuangzi*, amounting to several dozen scrolls, along with twenty scrolls of poetry and prose. In the autumn of the second year of Zhishun, his disciple Fu Xingzhen dispatched his grand-disciple Zhou Weihe to present the annotated works in the capital, saying: *\"Though Master’s annotations have been prefaced by Huang Gongzhen, Zeng Gong Ziliang, and Academician Wu Cheng, they lack a word from you to elucidate their significance. We humbly request your contribution.\"* I replied: *\"Alas! The Master has been gone for thirty years. Though I cannot see him again, to see his annotated works is enough. Yet how could his learning be fully encompassed by these annotations? Those who come after and examine these works will know that the Master’s learning was far greater than what is contained here.\"*\n\nNow in my old age, long settled at court, I have often wished to compile and preface the Master’s writings, but have not yet done so. Now that these works are finally assembled, how could I remain silent and fail to offer a word to illuminate the Master’s learning? Thus, I continue this preface.\n\nThe Master’s name was Siqi, styled Qixian. Scholars revered him as Master Kongshan. He was a native of Linchuan in Fuzhou.\n\nOn the first day of the sixth month of the third year of Zhishun, in the ren-shen year, Wu Quanjie wrote this preface.\n\n---\n\nThe *Hetu* is none other than the Eight Trigrams. When the Diagram emerged, the sages took it as their model. Fu Xi observed the heavens above and the patterns below, drew from his own body and distant things, to connect with the virtue of the numinous and categorize the conditions of the myriad things. Thus, he first drew the Eight Trigrams and composed the *Yi*. Confucius affirmed that he took the Diagram as his model—how could he have deceived us?\n\nThe numbers of the Diagram are arranged in the Eight Trigrams, interacting and interweaving, blending heaven and earth, varying in threes and fives, all naturally so. Later generations, failing to grasp its numbers—truly only forty—with fifteen converging at the center, arbitrarily calculated the numbers of heaven and earth as fifty-five, adding to the forty by conjecture to seek harmony. Thus, their explanations grew ever more confused, and the confusion persists to this day.\n\nAfter years of deep reflection and exhaustive study of various theories, I alone discerned the intent of the ancient sages. Thus, I composed *Comprehensive Changes* to transmit to scholars of the *Yi* across the ages, that together we might explore its true essence.\n\nThe methods of divination have also strayed from their original principles. These are appended in later chapters, and those who share this ancient commitment will surely recognize that I do not dare to mislead.\n\nIn the ninth month of the geng-zi year of the Dade era of the Great Yuan, Lei Siqi of Linchuan, styled Qixian, wrote this preface.\n\n---\n\n**The *Hetu***\n\nThe original numbers of the *Hetu* encompass the four cardinal directions and four corners, totaling forty, arranged in a circular formation. The five of heaven and ten of earth are left empty to activate the forty, thus combining the numbers of heaven and earth to make fifty-five.\n\n**Diagram of the Forty Errors in the *Hetu***\n\nThe old diagram was altered into a square form, with the five of heaven placed solidly at the center, rendering it unusable for deduction. Here, I first present the circular form to demonstrate the original errors. Those who examine the subsequent diagrams will see the truth for themselves.\n\n**Diagram of the *Hetu* Blending Heaven and Earth in Dependent Numbers**\n\n**Diagram of Variations in Threes and Fives, Interwoven Numbers**\n\n**Comprehensive Diagram of Interwoven Dualities and Variations**\n\n**Volume One of *Comprehensive Changes in the Yi Diagrams***\n*By Lei Siqi, Daoist of Linchuan*\n\n---\n\n**Transmission on the *Hetu*, Part One**\n\nWas it not from the *Hetu* that the *Yi* was composed, and from its numbers that the *Yi* arose? The origin of these numbers lies in nothing more than the Dao of one yin and one yang. The Dao of the *Yi* consists in nothing more than the odd and even numbers alternately dividing and uniting, generating and completing. Yang is odd, yin is even; when transformed and made fluid, their continuity is intricate yet never disordered. This is nothing more than what the *Great Commentary* calls \"heaven one, earth two,\" extending to \"heaven five and earth ten.\"\n\nThe *Yi* has the Supreme Ultimate. *Ji* means center, meaning one; the center is one. Thus, the Two Modes are generated. *Yi* means pair, meaning two; paired, they are two. The Two Modes generate the Four Images: one and one, not three, divided into four generating numbers. The Four Images generate the Eight Trigrams: combining six, seven, eight, and nine to form the four completing numbers. Four odds make yang; though yang has distinctions of generation and completion, each is aligned with the cardinal directions. Four evens make yin; though yin also has distinctions of generation and completion, they are evenly distributed among the four corners. Thus, from the cardinal directions, the corners are generated, and from the corners, the cardinal directions are completed.\n\nOne and three are odd numbers, the generative numbers of yang, yet they necessarily await the yin numbers six and eight to reach completion. Two and four are even numbers, the generative numbers of yin, yet they likewise depend on the yang numbers seven and nine to reach completion.\n\nFrom north to east, one advances to three—this is the progressive sequence of yang’s generation. Yet within it is also contained the regressive sequence of yin’s completion, from eight to six, from east to north. From west to south, two advances to four—this is the progressive sequence of yin’s generation. Yet within it is also contained the regressive sequence of yang’s completion, from nine to seven, from south to west.\n\nThe four cardinal directions each position their yang odd numbers at the center; the four corners each attach their yin even numbers to the periphery. Yet why do the celestial number five and the terrestrial number ten—both harmonizing with the odd and even of yin and yang, both termed \"generative\" and \"completive\"—remain unseen in the positions of the four directions? It is because the Four Images originally lack five, and the Eight Trigrams originally lack ten.\n\nYet the *Yi*’s capacity to encompass all without excess and to achieve all without omission arises precisely from employing these virtual numbers—celestial five and terrestrial ten—to enact their practical function. In the *Hetu* formed from the Four Images and Eight Trigrams, one should not follow vulgar practice by placing five virtual points at the diagram’s center and appending ten points, falsely calling it fifty, unaware of its true application.\n\n*Kan* begins with one at due north, and one with five becomes *Qian* six at the northwest. *Kun* divides with two at the southwest, and two with five becomes *Dui* seven at the west. *Zhen* emerges with three at the east, and three with five becomes *Gen* eight at the northeast. *Xun* attaches with four at the southeast, and four with five becomes *Li* nine at due south. Thus, yang gains five and becomes even; even gains five and becomes odd; yin gains five and becomes yang; odd gains five and becomes even—this is how generative numbers reach completion and how completive numbers arise.\n\nGenerative numbers are fewer than five, originally awaiting the regulation of the center. Thus, the yang numbers one and three establish their center beyond the completive numbers *Qian* six and *Gen* eight. Yin is multitudinous while yang is solitary—hence *Kan* is called \"the Abyss.\" Completive numbers exceed five and cannot independently attain the center. Thus, the yin numbers two and four borrow five from within the yang of the completive numbers *Li* nine and *Dui* seven. Yang is central while yin is peripheral—hence *Li* is called \"Clinging.\"\n\nThe Abyss must halt and seek movement—thus the Lord emerges in *Zhen*. Movement serves to unite, proceeding from division. Clinging must yield and delight—thus joy is spoken of in *Dui*. Joy serves to divide, proceeding from union.\n\nThe progressive sequence of yang, *Kan*, alone begins with the generative number, proceeding clockwise from north to meet *Xun* four in the east. The progressive sequence of yin, *Kun*, likewise follows as the next generative number, moving counterclockwise from the southwest to join *Zhen* three in the east—thus the generative numbers of yin and yang, three and four, both advance and unite. Examining the seasons, the fourth month is the *Qian* month, when the hexagram’s six yang lines intersect; the *Kun* month, when the hexagram’s six yin lines submit—hence *Xun* originally lacks *Qian*, and the Lord emerges in *Zhen* to align with *Xun*.\n\nThe regressive sequence of yang, *Li*, alone attains the center of completive numbers, proceeding clockwise from south to conclude in *Dui* seven. The regressive sequence of yin, *Gen*, truly begins by moving counterclockwise from the northeast, then north and west, culminating in *Qian* six—thus the completive numbers of yin and yang, six and seven, both recede and divide. Examining the seasons, the tenth month is the *Kun* month, when the hexagram’s six yin lines end; the *Qian* month, when the hexagram’s six yang lines bear the beginning—hence *Qian* originally lacks *Xun*, joy is spoken of in *Dui*, and conflict arises in *Qian*.\n\nThe celestial number begins with one—this is the entirety of the Supreme Ultimate, the correctness of yang. One splits into two—this is the division of the Supreme Ultimate, the peripherality of yin. One and two intermingle to form three—thus yang has already intoned and become odd. One and three transform to form four—thus yin subsequently follows and becomes even. From one and four intoning at the fore, their intersection and opposition form five; from two and three following behind, their intersection and opposition likewise form five—this is the doubling of five. Two fives interweave to form ten. Interlacing with celestial five—this is the interweaving. The ancient character for five was 久; the ancient and modern characters for ten were both 十—these are their images.\n\nTransforming and penetrating them, this is how generative numbers reach completion and how completive numbers arise. *Kan* one and *Xun* four form five—thus *Qian* six and *Li* nine form fifteen, their sum being twenty. *Kun* two and *Zhen* three form five—thus *Dui* seven and *Gen* eight form fifteen, their sum likewise being twenty. Thus, the ten of one, two, three, and four complete the thirty of six, seven, eight, and nine—hence the *Hetu*’s numbers conclude at forty, virtually employing celestial five and terrestrial ten to constitute the fifty-five numbers of heaven and earth.\n\nThe generative numbers’ two fives form ten, though divided into yin and yang, both employ the yang of generative numbers to bear the yin of completive numbers, sustaining the northeast and east, thereby establishing the center. Doubling the fifteen to form thirty, they then alternate yin and yang, further employing the yin of completive numbers to serve the yang of generative numbers, sustaining the south and west, thereby enacting the center.\n\nEstablishment lodges in the virtual to embody the actual; enactment distributes the actual to employ the virtual. One, two, three, and four interweave the Four Images, their four virtual fives forming ten to constitute the essence of generative numbers. Six, seven, eight, and nine encompass the Eight Trigrams, their four actual fives dividing into twenty to constitute the function of completive numbers. The union of two fives to form ten has already, through orthogonality and intersection, divided into the twenty of the partial and the whole.\n\nThe division of twenty into fives thereby separates and unites to govern the full function of the celestial five. Ten intersects with five bodies, five cycles through ten functions.\n\nKan’s one and Li’s nine make ten; Kun’s one and Gen’s eight make ten; Zhen’s three and Dui’s seven make ten; Xun’s four and Qian’s six make ten—each pairing one generative with one completive. That one must pair with nine, and three with seven, constitutes the ten yang of the four cardinal directions and four odd positions. That two must pair with eight, and four with six, constitutes the ten yin of the four even positions and four corners. Thus, four fives originally form twenty, but now they become forty-four. Grouping by fives into tens serves to distribute the center among the actual tens of completive numbers; grouping by tens into fives serves to unite the center with the virtual five of generative numbers. Is it not that five fives make ten, ten tens make five, interweaving in crisscross patterns—whether vertically, horizontally, diagonally, inverted, or reversed—none fail to resolve into fifteen?\n\nGrouping by fives to make ten ensures uniformity. The ten of one and nine resides in Kan and Li. Kan’s one dwells in the northern yin, where yang first arises—yang within yin, yin at its extreme generating yang. Yang’s one stands alone at the center’s inception. Li’s nine dwells in the southern yang, where yang reaches its ultimate—yang within yang, yang at its extreme generating yin, conjoined with Xun’s four and Kun’s two, the yin of generative numbers. Yin does not stand alone but arises at the zenith of nine yangs, where yang and yin merge to regulate the center. The *Shuo Gua* speaks of water and fire reaching one another without repelling, for they mark the solstices. The winter solstice emerges from Kan’s center; the summer solstice, yang at its extreme, harbors yin within.\n\nThe ten of two and eight resides in Kun and Gen; the ten of three and seven resides in Zhen and Dui. Yang ascends from below, rising from north and east to culminate in the south; yin descends from above, falling from south and west to culminate in the north. Their alternating advance and retreat to attain the center weave the warp of yin and yang, east and west, the path of opening and closing, the cycle of obstruction and passage. From Zhen’s emergence to Kun’s culmination, from joyful words to fulfilled speech, mountains and marshes exchange qi to mark the division of spring and autumn—thus bending to flourish, branching to connect.\n\nAs for the ten of four and six, residing in Xun and Qian, this further marks the beginning and end of yin and yang. Beginning and end, the ultimate transformations of heaven and earth, all changes and communications proceed from this regulation. How to clarify this? Yang originates in Qian and Kan, then Gen and Zhen advance from behind to unite in Xun of the southeast. Yin originates in Xun and Li, then Kun and Dui advance from ahead to divide in Qian of the northwest. Yang’s generative numbers—one and three—sum to four, which Xun encompasses; yin’s generative numbers—two and four—sum to six, which Qian encompasses. Doubling four yields the eight nodes, aligning with the sequence of the primary trigrams; doubling six yields six yins and six yangs, twelve months, extending the arrangement of the hexagrams.\n\nMoreover, though Qian’s six arises from the union of two and four, it also forms by combining one and five. From five’s external intersection with one emerges six—five remains generative, while six becomes completive. Yet this follows the Dao of generation and completion. Moreover, when united with Kan’s one at the center, Qian uniquely transforms its old yin into nine. As for Xun, constrained by the generative numbers one and three to a limit of four, yang qi lacks numerical sufficiency to reach the center independently, thus borrowing the central five from Li’s nine to attain the center and oppose Kan. Only by combining four with five does it reach yang’s extreme position; at the extreme, it must revert. Thus, Xun and Li’s shared numbers explain why nine, as old yang, transforms into six.\n\nThis specifically addresses the pairing of Qian and Xun in tens and the transformation of nine and six. Yet Qian and Xun’s mutual division and union, their beginning and end, extend beyond this. Zhen’s three and Xun’s four unite as thunder and wind pressing against one another, as seen in the *Da* hexagram. Xun governs the fourth month, as previously explained. Dui’s seven and Qian’s six divide in the northwest, with Qian governing the tenth month—thus the pairing of Qian and Xun in tens does not suffice as an explanation. Qian is yang, yet its number is yin six, positioned before Kan; Dui is yin, yet its number is yang seven, positioned after Kun. Thus, within Qian and Dui’s six and seven, each borrows five for multiplication and division: transforming Qian’s six through the permutations of three and five, a Qian emerges before Kan—Qian’s one thus becomes Kan’s one; transforming Dui’s seven through the permutations of three and five, two Duis emerge after Kun—Kun’s two thus enters Dui’s two.\n\nThough Qian and Dui divide through the completive numbers six and seven, Kan and Kun arise through the generative numbers one and two within the center. Yet Dui is not named two, while Kun is named two; Kan is named one, while Qian is not named one. That Qian does not name its one arises from its embodiment of non-entry into numbers, encompassing the five and ten of generative and completive functions across the eight trigrams as the totality of the Great Ultimate. Speaking in terms of numbers: heaven as one, earth as two, heaven and earth establish their positions. Speaking in terms of qi: dividing yin and dividing yang, yin and yang press against one another. The *Yi*’s operation within them begins here—thus yang’s advancing generative numbers serve as yin’s retreating completive numbers, and yin’s advancing generative numbers serve as yang’s retreating completive numbers. Alternately advancing and retreating, alternately generating and completing, this ceaseless generation of the *Yi*, the Dao of one yin and one yang, knows no end.\n\nIs this not the most refined, most mutable, and most numinous? Moreover, the *Yi* unifies its three lines to thereby generate the eight trigrams; doubling its three lines, it thereby interweaves them to form the sixty-four hexagrams. As for the formation of hexagram lines, they are limited to six. Yet in *Qian* alone, its three lines culminate in what is called nine—why is this? Generally, in the configuration of hexagram lines as illustrated, five serves as the center; only with nine does the center emerge, for the center resides beyond the five that is already centered. The sixth line as the uppermost line is but the surplus of the hexagram’s qi. The generative numbers having reached their end, the completive numbers begin their course—this is how the nine and six lodge their emptiness and fullness. *Kun* arises from the completive number six and is full; *Qian* culminates in the completive number nine and is empty. Six marks the beginning of *Kun*’s completive numbers, appended to its position in the diagram, thereby lodging *Qian*’s nine. Nine marks the end of *Qian*’s completive numbers, appended to its position in the hexagram, thereby aligning with *Kun*’s six. The six, residing at the extreme of the retreating numbers, advances to occupy the position before the center of *Kan*; the nine, residing at the extreme of the advancing numbers, retreats to attach itself behind the radiance of *Li*. Thus, the six in the hexagram still has a position, while the nine in the hexagram has no position and instead lodges its position within the six. Their alternation as nine and six—nine being empty and six being full—thereby jointly manifests their substance and function.\n\nFurthermore, *Qian* is old yang, *Kun* is old yin—they are called father and mother. Lesser yin and lesser yang are called the six sons and daughters. The numbers of lesser yin and lesser yang are seven and eight. *Qian*’s primal power employs nine; *Kun*’s primal power employs six. Together, the sixty-four hexagrams originally possess seven and eight, yet only nine and six are present. The sons and daughters are likewise transformed by their parents and thereby undergo transformation themselves. All things are born of the mother, yet none can name the virtue or power of the father within them—thus *Kun* is still seen in the form of six lines, while *Qian*’s nine possesses its ninefold function yet none can fathom the origin of its form. This is why the *Yi* is numinous without fixed direction and without fixed form.\n\nHeaven’s one combines with heaven’s five to make six; earth’s two combines with earth’s four to make six. Five and six occupy the position of mutual generation and completion within the ten numbers. In the system of *na jia*, *wu* and *ji* serve as the center; *wu* is lodged in the center of *Kan*, and *ji* is lodged in the center of *Li*. *Wu* and *ji* are precisely five and six, placed within the centers of *Kan* and *Li* to reveal their mutual centrality. Six combines two and four as the beginning of earth’s completive numbers, appearing in the hexagram *Kun* as: “Dragons battle in the wild,” which is to battle *Qian*. Suspected of being yang yet resented as excessive yang, it reveals yin’s dependence on yang—thus its Dao is exhausted. *Kun*’s use of six does not exceed: “Favorable to perpetually uphold correctness.” Heaven’s numbers—one, five, and nine—are what is called the beginning, middle, and end; nine is the completion of heaven’s numbers, appearing in the hexagram *Qian* as: “The exalted dragon has regret.” Fullness cannot endure and cannot serve as the beginning; yet *Qian*’s use of nine governs all under heaven and reveals the celestial principle—this is its ceaseless vigor, which depends on nothing from yin. One and nine combine to form *Qian*, making their number ten, yet ten is lodged beyond heaven’s nine, where its function is inexhaustible.\n\nThe Dao of earth has no completion, yet succession has an end—this, too, lies herein. This is a general discussion of the nine and six, which may be pondered in the mind. The arrangement of the *River Chart* was originally established for the trigrams; now it extends to the substance and function of the hexagrams as well. The trigrams and hexagrams, without exception, consist of one yin and one yang, generated through the division and combination of odd and even numbers to produce beginnings and completions. One, two, three, and four, with five, are all generative numbers—one through four are their actual substance, while five is their empty function. Six, seven, eight, and nine, with ten, are all completive numbers—six through nine are their actual substance, while ten is their empty function. The four images lack five, the eight trigrams lack ten—this is perfectly clear. Each of the four directions possesses ten numbers, totaling forty; each of the four corners contains five numbers, totaling twenty. Twenty is four times five, with the empty function occupying half; forty is eight times five, with the actual substance encompassing the whole. Thus, the four images combine with the eight trigrams, totaling forty.\n\nFive is the substance of establishing the center and generating; ten is the function of enacting the center and completing. Moreover, five is divided among the completive numbers six, seven, eight, and nine, where yin numbers are few and yang numbers are many—yin is inherently partial, while yang is inherently correct. Five, unable to attain the center, is lodged in the partiality of the four corners; ten combines beyond the generative numbers one, two, three, and four, where yang numbers are few and yin numbers are many—yin is also partial, while yang is also correct. Ten completes the center and resides in the correctness of the four directions—thus correctness is the center, and the center is correctness. Five, as the beginning, establishes correctness within the empty function’s center; ten, as the middle, establishes the center beyond the actual function—both serve as the central Dao of one yin and one yang. Since within yin and yang there is again yin and yang, within substance and function there is again substance and function, emptiness and fullness, beginning and end—end and beginning transform, generation and completion mutually sustain one another, inexhaustibly.\n\nMoreover, five times five makes twenty-five, which is also a heavenly number. Six times five and five times six, three times ten and ten times three make thirty, which is also an earthly number. One with nine, two with eight, three with seven, and four with six—each making ten—and the ten of the original numbers’ empty function, when arranged in fives and tens, make the fifty of the *Great Expansion*.\n\nYet that initial omen of the One, lodged in the central Five, conceals its function within the primordial form of Heaven—thus it emerges beyond the fifty of the *Great Expansion* and the fifteen, beyond what the *Great Expansion* can employ. How then could one know that the function of the unused is precisely what enables the *Great Expansion* to function? From this, we perceive that what is called the Dao of one yin and one yang, interwoven through threes and fives, encompasses the fifty-five numbers of Heaven and Earth—through which transformations are accomplished and the spirits set in motion. Here lies the means to observe the traces of all under Heaven, to witness its movements, and to comprehend the workings of the divine. This is how Fuxi followed the *River Diagram* to compose the *Book of Changes*.\n\nConfucius, in his commentary on the *Changes*, spoke of its utmost refinement, utmost mutability, and utmost spirituality. Ah! This is its utmost spirituality indeed.\n\n*First Scroll of the* *Diagrams of the Changes: Penetrating Mutations* **concludes**\n\n---\n**Note on variants:**\n- *\"者終\"* originally rendered as *\"終者\"*—corrected per the *Siku* edition.\n- *\"至元丙戌\"* in the *Siku* edition reads *\"至元丙辰\"*—both appear erroneous; the *Handbook of Chinese Chronology* records no *\"丙戌\"* or *\"丙辰\"* in the *Zhiyuan* era, though *\"丙戌\"* appears in *Zhizheng*.\n- *\"切至\"* in the *Siku* edition reads *\"精切\"*—likely intended as *\"精切至\"*.\n- *\"斯文宗\"* in the *Siku* edition reads *\"斯文宗主\"*.\n- *\"但\"* in the *Siku* edition reads *\"特\"*.\n- *\"祇\"* originally rendered as *\"祇\"*—corrected per the *Siku* edition.\n\n*Second Scroll of the* *Diagrams of the Changes: Penetrating Mutations*\n*By Lei Siqi, Daoist of Linchuan*\n\nWithin the *River Chart* transmission lies the principle of Heaven and Earth, wherein numbers invariably operate. Yet sometimes numbers exceed, sometimes they fall short. Precisely through this excess and deficiency, a central regulation is established. Thus, though the numbers of yin and yang, odd and even, may divide or unite, be empty or full, advance or retreat, there exists within them a central Dao of natural mutual generation. That which is called \"the Dao of one yin and one yang\" divides one into Heaven and Earth, unites above and below into Qian and Kun, separates Heaven and Earth above and below into the four directions, and converges at the central origin. Qian and Kun, yin and yang, unite to form the four seasons, yet within them lies the potential for division—all is one and the same Dao.\n\nWhen speaking of Heaven and Earth in terms of form, north and south serve as the warp, with Heaven above and Earth below. The forms of water, fire, wood, and metal may be diagrammed and divided, hence it is said: \"No images surpass those of Heaven and Earth,\" for their vastness matches Heaven and Earth. When discussing yin and yang in terms of qi, east and west serve as the weft, with Qian as yang and Kun as yin. The qi of winter, summer, spring, and autumn may likewise be ordered and united, hence it is said: \"No transformations surpass those of the four seasons,\" for their mutability matches the four seasons. In these two aspects, the origin differs.\n\nThe four directions possess a center; the central origin establishes the body, upon which the Four Images and Eight Trigrams are founded. The four seasons possess the fifth; the fifth origin establishes the essence, upon which the four seasons and eight solar terms proceed. When Confucius composed the *Great Commentary*, he did not preserve the *River Chart* but specifically retained the numbers of Heaven and Earth, demonstrating that if one grasps the numbers, the Chart resides within them.\n\nThe numbers of the Chart arise with Heavenly One and are completed by Earthly Six; they arise with Earthly Two and are completed by Heavenly Seven; they arise with Heavenly Three and are completed by Earthly Eight; they arise with Earthly Four and are completed by Heavenly Nine. As for the generation and completion of Heavenly Five and Earthly Ten, from whence are they sought? It is like searching for a steed by following its tracks. Thus, structuring the five within the void of the Eight Trigrams still allows room for their numbers, but structuring the ten within it leaves no space for their numbers.\n\nTo know the generation and completion of numbers yet not comprehend their underlying principles is merely to grasp their outward appearance. Without attaining the ancient sages' intent in \"establishing the heart of Heaven and Earth\" and \"setting the ultimate standard for the people,\" one may sigh for a thousand years—such is the past as it is the present.\n\nOdd numbers all belong to Heaven; even numbers all belong to Earth. That which arises from Heaven is completed by Earth; that which arises from Earth is completed by Heaven. Their nature as Heaven and Earth lies solely in the advance and retreat of yin and yang, the function and substance of odd and even, and their division and union. The *Shuogua* states: \"Three for Heaven, two for Earth, relying on numbers; observing changes in yin and yang to establish the trigrams; expressing through firmness and softness to generate the lines.\" The *Great Commentary* says: \"Intermingling through threes and fives, interweaving their numbers; penetrating their changes, thus forming the patterns of Heaven and Earth; exhausting their numbers, thus determining the images of the world.\" If not for the supreme mutability of the world, who could partake in this? Its subtlety in fully realizing the most wondrous function lies in the method of the *River Chart*.\n\nNumbers begin with one, center on five, and conclude with ten. Centering on five divides the bias of the four; concluding with ten unites the correctness of the eight. At the beginning of one, its entire body is without excess or deficiency, and thus cannot be employed—only the center is attainable. Having entrusted its one to arise within five, it then entrusts its one to be completed within ten to conclude. Thus, the Four Images possess five, the Eight Trigrams possess ten, all having numbers yet no fixed positions. The five generates their bias; the ten completes their correctness. As for the one, it becomes untraceable, appearing only in the five and ten that serve as the center, aligning above.\n\nThus, though one may seek its underlying reason, it remains unattainable. I recall in childhood observing a herdboy playing what was called the \"eight-pattern game,\" its board nothing more than a grid with the character for ten inscribed within. At the time, I deeply despised it as utterly vulgar and base, never giving it a second thought. Who would have known that at seventy, I would come to understand its truth? That which the common people use daily yet do not comprehend, that which they follow throughout their lives yet do not recognize as the Dao—did the ancients ever deceive us?\n\nFor what is now called \"○\" was anciently \"○\"; what is now \"five\" was anciently \" \"; what is now \"ten\" was anciently \"十,\" drawn as a cross within \"○.\" From this, the method of fifteen becomes apparent. Moreover, with a single stroke beneath the ten, the centrality of Earth's pattern becomes evident—hence it is called the Central Soil. The vertical stroke of \" \" reveals north and south as the warp, Heaven's honor and Earth's humility, the positions of Heaven and Earth. The horizontal stroke of \"－\" reveals east and west as the weft, the division of yin and yang, the alignment of yin and yang. Over time, the biases of the four corners each attain balance; the correctness of the four directions likewise stabilizes their qi in mutual advance and retreat, reciprocal generation and completion, \"following the five and ten to establish the central Dao.\"\n\nThus, the fifteen of the *River Chart* and the fifty of the *Great Expansion* both possess the numbers ten and five in emptiness, employing them while their actual positions remain formless. To understand the Dao of ten and five as the center—beginning with one, centering on five, and concluding with ten—ten is one. Seeking one through ten, that one is here, visible to the eye and attainable in the heart. After extensive investigation, I have tentatively composed *Since the Yi*, wherein the convergence of ten as the center and Soil is best captured by Sima's *Hidden Depths*. Yet *Hidden Depths* takes the nine as its foundation and the ten as its apex, arranging them into fifty-five numbers as names—thus, its center is already substantiated, not employed in emptiness.\n\nThe principle of the *River Chart*’s empty five and lodged ten does not align with this. Though the *River Chart*’s numbers total fifty-five, its actual substantive count is precisely forty, with the remaining fifteen existing in emptiness to operate within the forty—merely serving as a general tally, not possessing any substantive position. The terms \"three,\" \"two,\" and \"three-five\" refer to the application of their numerical transformations. \"Three\" arises from the variation of one and two. From one, one divides itself to become two, initiating mutual opposition, so that two is seen while one is not. That one then emerges from within two as three. In the method of three, this constitutes a minor completion, where the three lines stand as humanity’s participation between heaven and earth to generate life. Accumulating three minor completions, tripling the three to unite with Qian’s \"nine in use,\" marks the inception of three—precisely what the yang odd numbers of heaven originally signify.\n\n\"Two\" arises from one generating two, rising in opposition to stand in parallel, thus symbolizing the Two Modes. From this, two is doubled to represent the Four Images. If one originally becomes two and then three, with one forming three, how could two—itself an opposition of one—not double its three to form a counter-opposition? Thus, refining it by tripling its two yields six, uniting with Kun’s \"six in use.\" This is the inception of two, doubling the Three Powers, so that six lines form a hexagram, six positions compose a pattern—just as the yin pairs of earth originally signify.\n\nFrom this, tripling the two twos and intersecting the nine to unite them forms five. Doubling the two fives yields ten. Ten appears beyond the three and nine, serving as the lodging place of one. How is this clarified? The tripling, doubling, quintupling, and decupling are all human constructs, yet what naturally harmonizes with heaven and earth lies in the blood-grain of the three lines and the rain-tilt of the two lines. Even in the \"five-maintained\" and \"ten-maintained,\" humanity stands at the center or beside the weft—here, one may silently recognize the ancient establishment of mind and pole, which resides in this.\n\nOne must triple the three threes and double the three twos—this is the minor completion of three and two. Thus, tripling the three threes forms the three of heaven, and doubling the three twos forms the two of earth. The numbers of heaven and earth are thereby refined, united, and divided. Yet that initial number not entering into use is lodged in ten to operate at its center, dividing and uniting to complete its central system—this is one. Seeking it in the chart’s numbers, like a ring without end, that one remains unseen, while only ten is visible. Tripling the three threes and doubling the three twos, united in grandeur, reveals how heaven and earth merge into a single beginning and end.\n\nAs for the so-called \"three-five interweaving,\" it remains unexplored. \"Three-five interweaving\" refers to numbers before five being fewer than five, thus using five as the base; numbers after five being greater than five, thus tripling with five. Within this, five is interwoven and interlaced to enact the method of central regulation. Yet the *Great Commentary* states that only by \"permeating their transformations through three and five, interweaving their numbers,\" can one \"complete the patterns of heaven and earth\" and \"determine the images of the world.\" This is not easily understood. Since it instructs with \"three-five interweaving,\" how can one not investigate its underlying principle?\n\nAfter examining works since the *Changes* was first devised—nearly two thousand years—scholars have scarcely probed this. Even the *Dragon Chart*’s continuation offers no elucidation, which is deeply perplexing. Through painstaking effort and profound inquiry, I suddenly awakened to the realization that it concerns nothing else. The *Great Commentary* says: \"The heavenly numbers are five, the earthly numbers are five; the five positions interact and each has its union.\" This is the chart’s numbers. Heaven-one begins at Kan, earth-six attaches to Kun—the union of one and six, summed, is seven. Tripling the heavenly five and interweaving five within, aligning them for examination, their heads and tails are each one. Thus, Kan’s one is yang, establishing the pole at the northern inception; Qian’s six is yin, attaching to the northwest weft.\n\nHeaven-three emerges from Zhen, earth-eight attaches to Gen—the union of three and eight, summed, is eleven. Tripling the heavenly five and interweaving five within, aligning them for examination, their heads and tails are each three. Thus, Zhen’s three is yang, standing at the eastern center; Gen’s eight is yin, attaching to the northeast weft. These two proceed from yang to yin. Earth-two divides in the southwest as Kun; heaven-seven aligns in the west as Dui—the union of two and seven, summed, is nine. Tripling the heavenly five and interweaving five within, aligning them for examination, their heads and tails are each two. Kun’s two is yin, first residing at the southwest weft; Dui’s seven is yang, newly standing at the western center.\n\nEarth-four spreads to Xun, heaven-nine centers at Li—the union of four and nine, summed, is thirteen. Tripling the heavenly five and interweaving five within, aligning them for examination, their heads and tails are each four. Xun’s four is yin, retreating to guard the southeast weft; Li’s nine is yang, facing south to stand at the polar position. These two proceed from yin to yang.\n\nThus we understand why Qian, Dui, Gen, and Li correspond to six, seven, eight, and nine—precisely the one, two-not-three, and four of Kan, Kun, Zhen, and Xun. Therefore, yang attains five and becomes yin; yin attains five and becomes yang. Even numbers attain five and become odd; odd numbers attain five and become even. Qian’s six is one-five-and-six; Dui’s seven is two-five-and-seven; Gen’s eight is three-five-and-eight; Li’s nine is four-five-and-nine.\n\nFrom this we further understand the transformations of tripling and quintupling: tripling Qian and Kan, tripling Gen and Zhen, from north to east; tripling Dui and Kun, tripling Li and Xun, from west to south. Tripling to divide, quintupling to unite—this is called \"tripling and quintupling to transform.\" Interlacing to divide reveals their tripling; summing to unite reveals their positions—this is called \"interlacing and summing their numbers.\" And what is interlaced and summed is precisely the tripling and quintupling. Scattered and interlaced, they resemble the doubling of one, two, three, four; divided and gathered to sum them, they return to the recombination of six, seven, eight, nine. This is called \"the five positions mutually attaining and each having its union\"—how could it ever be like later generations arbitrarily placing five empty points at the center of the diagram and claiming this to be the heavenly five? Thus we understand that the numbers of the River Diagram, whether vertical or horizontal, forward or reverse, are none other than the natural unfolding of the five, not requiring artificial contrivance or forced interpretation to make them so.\n\nThe ascending progression of advancing numbers begins at the northern and eastern extremes and reaches the south; the descending regression of retreating numbers begins at the southern and western termini and returns to the north—all follow the movement of yang numbers, with yin naturally following. As for the progression of yin numbers, it moves from Kun’s two to Xun’s four; its regression moves from Gen’s eight to Qian’s six. Yet yin does no more than serve yang—though myriad transformations occur, it is merely the alternation of one yin and one yang.\n\nThus, quintupling Kan’s one produces Qian’s six in the north; quintupling Kun’s two produces Dui’s seven in the west; quintupling Zhen’s three produces Gen’s eight in the east; quintupling Xun’s four produces Li’s nine in the south—here we see the origin of numerical regulation in tripling and quintupling. Then, reducing Zhen’s latter one to regress, augmenting Gen’s full eight to nine, and tripling the three, we have the initial regulation of tripling. Dividing Zhen’s middle two to unite with Xun’s full four, splitting into six, we have the continuation of the two. Only Li’s full number naturally attains nine, standing at the center of beginning and end, tripling the three—this is the central regulation of tripling. Combining Kun’s full two with the four at Dui’s middle to unite as six, we have the alternation of the two at the end. Severing Dui’s latter three to supplement Qian’s full six, tripling the three—this is the final regulation of tripling. Herein lie the essential principles of \"tripling heaven and doubling earth.\"\n\nWhether interlaced to divide or summed to unite, whether tripling or doubling, the regulation of tripling and doubling must also involve quintupling. This is the great universal transformation and the supreme numerical principle of tripling and quintupling. Confucius spoke of \"penetrating its transformations to complete the patterns of heaven and earth; exhausting its numbers to determine the images of the world.\" Who but one of utmost precision, utmost transformation, and utmost spirit could partake in this? Truly his words are so.\n\nThus, \"tripling heaven\" completes the image, referring to Qian. Here, the three threes of yang numbers govern Qian’s primal use of nine, wherein tripling contains doubling, and yang reveals yin. \"Doubling earth\" emulates the model, referring to Kun. Here, the two twos of yin numbers emulate Qian, thus tripling its two to six, uniting Kun’s primal use of six, wherein doubling employs tripling, and yin reveals yang. From this we see how one yin and one yang, transformed and penetrated throughout heaven and earth, necessarily involve tripling and doubling. Tripling and doubling necessarily involve nine and six.\n\nMoreover, from the Supreme Ultimate come the Two Modes; from the Two Modes come the Four Images; from the Four Images come the Eight Trigrams—nothing more than the generating numbers one, two, three, four and the completing numbers six, seven, eight, nine. As for five and ten, though they exist as numbers, they serve only as virtual functions and are never listed among the substantial forms of the trigrams. For from one divided comes two; from one and two comes three; from one and three comes four—thus the Four Images are established. The Four Images originate from five; the heavenly five is merely the virtual center without substance. Yet one and four make five; two and three also make five—thus two quintuplets. Combined with the original heavenly five, they are further tripled and quintupled. Moreover, one, two, three, four naturally sum to ten, with the heavenly five at the center—tripled and quintupled to fifteen.\n\nThe heavenly numbers one, three, five sum to nine; the earthly numbers two and four sum to six, and one and five also make six. One and six make seven; two and five also make seven. One and seven make eight; three and five also make eight. One and eight make nine; four and five also make nine—thus the Eight Trigrams are arrayed. One and nine make ten; one, two, three, four naturally also make ten. The Eight Trigrams inherently lack ten, for ten has no place to contain its form. Using one, two, three, four, its ten is merely nine. Ten as nine is the return to one—thus ten is one.\n\nThe numbers of the River Diagram, ten in each of the four directions, show Kan’s one and Li’s nine opposing to make ten, with the virtual function of the central heavenly five making fifteen; Kun’s two and Gen’s eight opposing to make ten, with the virtual function of the central heavenly five making fifteen; Zhen’s three and Dui’s seven opposing to make ten, with the virtual function of the central heavenly five making fifteen; Xun’s four and Qian’s six opposing to make ten, with the virtual function of the central heavenly five making fifteen. From this we know that the heavenly five and earthly ten, though lacking substantial form and position, virtually employ their numbers to perpetually interweave and quintuple.\n\nThus is the method of interweaving and quintupling. Interweaving and quintupling serve to interlace the two—hence the numbers of the River Diagram are precisely forty in substance, yet through the virtual numbers of heavenly five and earthly ten they are universally applied in calculation, totaling fifty-five for all the numbers of heaven and earth.\n\nSeven is young yang, eight is young yin; their union indeed makes fifteen, yet their generative numbers are incomplete and incapable of transformation. Nine is old yang, six is old yin; their union likewise makes only fifteen, yet the generative numbers—one, three, five forming nine, and two, four forming six—allow six to transform into nine, and nine into six. This is why the hexagrams of the *Zhouyi* exclude seven and eight, fundamentally relying on nine and six. Through interweaving and quintupling, through the three of heaven and the two of earth, all transformations arise from this.\n\nThe numbers of the four directions each total ten; combining their nines yields twenty-seven, doubling their sixes yields twelve, and summing these gives thirty-nine—yet one is deliberately omitted. Where then is this one employed? Thus, by preserving this one within the ten, forty is achieved.\n\nTherefore, Kan establishes its axis at one, gathering its ten to return to itself, thereby erecting the Great Center and initiating the generative numbers while completing the fulfilled numbers. Withdrawn and concealed in secrecy, its ultimate depth remains unfathomed. Manifest in the one of the three of heaven and the two of earth, which is reckoned as ten, this is what is called the Center. The Center is where the union of numbers cannot attain their mean, yet causes them to intersect at the center—thus centering what is not centered.\n\nFrom Kan’s northern one, the center is first established; the second emulates this by dividing Dui’s western seven to form a center; the third emulates it by dividing Zhen’s eastern three to form a center; the fourth emulates it by dividing Li’s southern nine to form a center. Every center is established at ten, all through the union of numbers at ten and their bisection—this is merely to lodge the one within. Only Kan’s one, uniquely without employable function, is singularly established at the center, its function being the function of non-function. The function of having function is the function of the Center—is this not supremely great?\n\nThus, though Kan’s one does not participate in the functions of the three, the two, or the five, it is employed to regulate the system of the three of heaven, the two of earth, and the interweaving and quintupling. Therefore, the three of heaven does not begin with Kan but with Gen.\n\nThe three is nothing other than the transformation of one and two previously described. When one divides itself to become one, arising in opposition, two appears while one is no longer seen. This one further interweaves from within the two—hence it is called the three. This is the minor completion of the threefold regulation. Yet all interlacing of the two, the three, and the five originates here—thus is demonstrated the general principle of the three.\n\n*Yitu Tongbian*, Scroll Two, concludes.\n\n*Yitu Tongbian*, Scroll Three\nBy Linchuan Daoist Lei Siqi\n\nThe *Hetu* was transmitted downward. Daoists take the sun and moon as the Changes, initially treading the well-worn path of convention—yet not entirely so. Upon thorough investigation of the *Great Commentary*, however, it proves not entirely otherwise.\n\nIt is said: Qian and Kun—are they the hidden essence of the *Changes*? When Qian and Kun take their places, the *Changes* is established between them. If Qian and Kun were destroyed, the primordial would reveal the *Changes*. If the *Changes* were not visible, Qian and Kun would nearly cease to be. Yet this still does not clarify what the visible *Changes* truly is.\n\nThus it is further said: Qian and Kun—are they the gates of the *Changes*? Qian is the yang entity; Kun, the yin entity. Yin and yang unite their powers, and hardness and softness take form, □ thereby embodying the compositions of heaven and earth and penetrating the virtue/power of the numinous. Here, the *Changes* as a thing has a form that can be seen.\n\nIt is further said: Opening the door is called Qian; closing the door, Kun. One closing and one opening is called change; ceaseless coming and going, penetration. What is seen is called image; what takes shape is called vessel. To regulate and employ it is called method; its beneficial use in ingress and egress, universally employed by the people, is called the numinous. Here, the *Changes* as form is seen to have its use.\n\nTherefore it is said: Heaven and earth take their positions, and the *Changes* operates between them. It is said: No image is greater than heaven and earth; no transformation is greater than the four seasons; no suspended image is more luminous than the sun and moon. It is said: Vastness matches heaven and earth; transformation matches the four seasons; the principles of yin and yang match the sun and moon. In all these instances, the sun and moon are invoked as proof—thus the *Changes* is confirmed as complete.\n\nThe *Changes* aligns with heaven and earth, capable of encompassing the Dao/Way of heaven and earth. Gazing upward to observe the images in heaven and downward to observe the patterns on earth, the image-forming is called Qian, which is the sun; the pattern-imitating is called Kun, which is the moon. The sun’s image corresponds to the number of Li, culminating in nine; the moon’s image corresponds to the number of Kan, beginning with one. Every nine must pair with six, but here it speaks of one—one combines with heaven’s five to make six, Kan’s one and Qian’s six form the generation and completion of water, which is the moon’s essence. Moreover, heaven and earth are the forms of Qian and Kun, while Qian and Kun are the functions of heaven and earth. Only when heaven and earth are fixed in position do the qi and shapes of above and below have their unchanging divisions. Thus, when Qian and Kun take their places, the numbers of yin-yang form and function undergo transformation. Heaven and earth have constant forms yet do not reveal their functions; yin and yang have constant functions yet do not exhaust their forms. Only the sun and moon fully manifest both form and function—hence their principles are particularly highlighted to pair with yin and yang.\n\nMoreover, the teachings that model heaven and earth without transgression and complete the myriad things without omission specifically penetrate the Dao/Way of day and night. Is the Dao/Way of day and night difficult to know? The common people use it daily yet remain unaware. Let us briefly outline its general principles:\n\nQian, the yang entity, has the sun as its kind; Kun, the yin entity, has the moon as its kind. When yin and yang take their places and unite their powers, the four seasons align in order, the sun and moon unite in brightness—these too are kinds. Opening the door as Qian: proximately, the sun’s dawn and the moon’s first quarter; distantly, the spring equinox when day and night divide, called \"opening.\" Closing the door as Kun: proximately, the sun’s dusk and the moon’s last quarter; distantly, the autumn equinox when day and night divide, called \"closing.\" Gazing upward to observe their formed images: the sun’s day, the moon’s fullness, summer’s long daylight. Looking downward to examine their imitated patterns: night’s division, the moon’s new moon, winter’s short daylight.\n\nThus, when the sun departs, the moon arrives; when the moon departs, the sun arrives—the sun and moon mutually advance, and brightness is born. When cold departs, heat arrives; when heat departs, cold arrives—cold and heat mutually advance, and the year is completed. Change is the image of advance and retreat; hardness and softness are the images of day and night. The sun and moon’s movements, one cold and one hot—thus it is said: The Dao/Way of heaven and earth is steadfast in observation; the Dao/Way of the sun and moon is steadfast in brightness. The movements of all under heaven are steadfast in the One.\n\nSteadfast in the One: the centers of the solstices and equinoxes are all One. Yet this specifically refers to the movements of all under heaven being steadfast in the One, which precisely arises from Kan’s one. The yang qi first stirs at the midnight division—this is truly steadfast in the One. The yang qi of the year revives at the winter solstice’s beginning—here its steadfastness in the One is even more evident. Kan’s number is one; Li’s number is nine. Kan and Li take one and nine as Qian. Li is the sun; Kan is the moon. The sun and moon must unite at the moon’s first day, the new moon. Yet the sun is not called \"new moon\"; only the moon is called \"new moon.\" The south is not called \"new moon\"; only the north is called \"new moon.\" The new moon moves in reverse; reversing to meet the sun, it is called \"new moon.\" Observing the new moon’s pattern reveals the moon’s reverse movement. The *Shuogua* says: The *Changes* is reckoned in reverse. The *Book [of Documents]* also says: Level at the new moon. The principles of the *Changes* are indeed the same.\n\nProceeding from this to the *Changes* as the sun and moon—could their suspended images not be called luminously manifest? Thus, the moon waxes to fullness in three and five, the lesser yin and yang of seven and eight; it wanes in three and five, the elder yin and yang of nine and six. In sum, the earth number thirty completes the month—another method of the *Hetu*. The celestial circuit is 365¼ degrees; the sun moves one degree daily. The winter south and summer north mark the central extremes of cold and heat. The moon moves slightly more than thirteen degrees daily, meeting the sun twelve times in conjunctions—thus the year regularly comprises six yin and six yang months, twelve in total. Heaven and earth are regulated, and the four seasons are completed. The moon’s movements are indeed laborious.\n\nThat which names *Kan* as the \"Hexagram of Labor\" does not refer merely to water. This singular yang of *Kan* does not enter the system of *san-liang* (three-two) or *san-wu* (three-five), but rather stands out as the inception of movement, the beginning of the center. In synthesis, heaven and earth are the *ti* (substance/body), while yin and yang are the *yong* (function/activation). *Ti* is form, by which qi is activated; *yong* is qi, by which form is embodied. Heaven embodies its form through qi, thus its form envelops earth below; earth activates its qi through form, thus its qi ascends to heaven above. Here, heaven’s qi wholly embodies earth’s form, while earth’s form wholly activates heaven’s qi—this further clarifies the *san-liang* system.\n\nThe beginning of one’s triad and the end of three’s triad both belong to heaven, yet they are positioned below the level earth. For example: *Qian*, the elder yang, is appended to the completed number of six yin, stationed in the yin region of the northwest, at the extreme of the retiring sequence’s end. *Gen*, the lesser yang, is appended to the completed number of eight yin, stationed in the yang region of the northeast, standing at the inception of the advancing sequence. Yet the singular yang at the center of *Kan*, not employed in the *san-liang* system, arises from the primal one of spontaneous generation, standing distinct amid the yin-yang cycle of beginning and end. It initiates the year’s first month, the moon’s first phase, embodying the *Yi*’s meaning of ceaseless generation—thus fully demonstrating that earth’s *ti* wholly activates heaven.\n\nThe beginning of two’s pair and the end of two’s pair both belong to earth, yet they are arrayed above the level earth. For example: *Xun*, the lesser yin, though attached to earth’s generative number of four yin, is positioned in the southeast, where yang qi has already advanced past the midpoint. *Kun*, the elder yin, though attached to earth’s generative number of two yin, remains in the southwest, where yang qi has not yet descended to the midpoint. Moreover, both earthly pairs jointly uphold the center, aligning with the polar extremes of heaven’s triads—corresponding to heaven’s highest point and the sun’s zenith. This fully demonstrates that heaven’s *yong* wholly embodies earth.\n\nFrom this, we know that without the *san-liang* system—without the sun to determine the length of day and night, without the moon to alternate its waxing and waning—how could the qi, form, *ti*, and *yong* of heaven and earth, the transformations and creations of yin and yang, their ascending and descending, advancing and retreating, their permutations of separation and union, their comings and goings, their destinations—how could one discern their true nature amid the chaotic winds? Thus, it is through this *san* system that the origin of numbers is established.\n\nHeaven’s one begins in the north, moves to the center, and divides earth’s two in the southwest. This cannot be called \"heaven and earth in their proper positions,\" for yang is upright and descends, while yin is partial and ascends. That two is named *Kun* while one is not named *Qian* arises because one originates from *Kan*. From one’s triad with two to form three, proceeding eastward, we see humanity’s triad within heaven and earth to generate life, moving in *Zhen*. Then, doubling two to make four, appending *Xun* to follow and interpenetrate, an image is born—yet this image is not the true substance. The image of heaven, earth, and humanity merely represents the initial pairing of male and female.\n\nThe yang of one and three naturally each occupies its center, but the uncentered two and four—how can they be left uncorrected? Thus, they await the application of completed numbers’ intersections to achieve correctness. Though five occupies the central void, its number governs its function. One intersects five, pairing its one to complete six in *Qian*; two intersects five, pairing its two to complete seven in *Dui*; three intersects five, pairing its three to complete eight in *Gen*; four intersects five, pairing its four to complete nine in *Li*—only then is it called a \"completed image.\" The completed image is called *Qian*, and its imitative pattern is called *Kun*—only then can it be said that \"heaven and earth are in their proper positions.\"\n\nIn reality, one naturally pairs with one, two with two, three with three, four with four—it is only through intersecting five that transformation occurs. Thus, the singular yang of *Kan* combines to form the six yin of *Qian*; the two yin of *Kun* combine to form the seven yang of *Dui*; the three yang of *Zhen* combine to form the eight yin of *Gen*; the four yin of *Xun* combine to form the nine yang of *Li*. What was initially correct is paired to assist the partial; what was initially partial is paired to return to correctness. Thus, the eight trigrams are arrayed, and their images reside within.\n\nOnly the one at the center of *Kan* remains self-contained, not entering the numerical system. Through the *Hetu*’s \"three heavens, two earths\" and the *san-wu*’s intricate permutations, its transformations unfold. Therefore, from heaven’s *san* system, all employing nine, we know nine is *Qian*’s function; from earth’s *liang* system, all employing six, we know six is *Kun*’s function.\n\n*Qian*’s inception triads with *Gen*’s eight, yet falls short in number—thus it takes *Zhen*’s one to complete nine’s central triad, embodying yang’s extremity and the fullness of numerical form. When the primordial surplus is insufficient, it takes the final triad of nine, then draws *Dui*’s surplus three beyond the center to serve *Qian*’s six at its end. Nine’s paired inception begins with *Zhen*’s central two, combining with *Xun*’s four to compensate its lack. Six’s paired conclusion begins with *Kun*’s original two, combining with *Dui*’s surplus four to complete its six—thus clarifying the interplay of *san-liang*’s nine and six.\n\nSome claim that *Kun*’s two and *Dui*’s seven make nine, and *Qian*’s position naturally yields six, also forming nine and six—yet they fail to recognize that the *liang* system concludes above earth, while the *san* system concludes below earth. How could these be interchangeable? Moreover, *Qian* is originally nine, yet its number is now reduced to six.\n\nKun was originally six, yet its number is now augmented to nine—this further clarifies how the old yin’s six transforms into nine, and the old yang’s nine transforms into six, thereby establishing the nine and six of the hexagrams and lines. From this, we see that the *san*-Heaven’s function must be nine, while the *liang*-Earth’s form must be six. The opening of the *Xiaoxi* states: “The eight trigrams are arrayed, and their images are therein.” By doubling them, “their lines are therein.” Yet later generations claim that the doubling of the *Yi*’s lines did not originate with Fuxi—this I cannot believe. Moreover, the *Shuogua* says: “Joy is expressed in *Dui*, completion is spoken of in *Gen*.” Whenever it speaks twice of the communication of qi between mountain and marsh, it refers to the hexagram *Xian*. The *Xiang* of *Xian* says: “The two qi stimulate and respond to one another, uniting in stillness and joy. Heaven and Earth stimulate each other, and the myriad things are transformed and born; the sage stimulates the human heart, and the world attains peace.” Observing what they stimulate, the nature of Heaven, Earth, and the myriad things becomes visible. Where thunder and wind press upon one another, it refers to the hexagram *Heng*. The *Xiang* of *Heng* says: “Thunder and wind unite, advancing and moving. The Dao of Heaven and Earth is everlasting and unceasing. The sun and moon attain Heaven and thus endure in their illumination; the four seasons transform and thus endure in their completion. The sage endures in the Dao, and the world is transformed and completed.” Observing what they press upon, the nature of Heaven, Earth, and the myriad things becomes visible. Tracing the beginning of human Dao in the *Lower Canon*, the intent of the *Shuogua* in doubling the hexagrams is not the slightest bit contradictory. Thus, I maintain that the doubling of the *Yi* decisively began with Fuxi. Otherwise, the *Rites* speaks of the three *Yi*, all of whose primary hexagrams are eight, and whose variations are all sixty-four—would this deceive me? In seeking the Dao of the *Yi*, let this be the starting point.\n\nThe *Shuogua* says: “Of old, the sages made the *Yi*, measuring Heaven by *san* and Earth by *liang*, observing the changes in yin and yang to establish the hexagrams, and expressing them through hardness and softness to generate the lines.” Investigating the principles behind their *san* and *liang*, their derivation from the *Hetu*’s primordial inquiry is evident. Moreover, the chapter beginning “The sovereign emerges from *Zhen*” is a grand elucidation of the *Hetu*. It specifically begins with *Zhen* at the center of spring, circling around to conclude at *Gen*, embodying the annual renewal of the Xia calendar. Thus it is said: “In ending the myriad things and beginning the myriad things, none is more flourishing than *Gen*.” It says: “*Gen* is the hexagram of the northeast, where the myriad things complete their endings and begin their beginnings.” The implied meaning is that it begins anew with the emergence from *Zhen*. This is indeed Confucius’s unique way of expressing the cyclical transformation of the four seasons, yet regarding the Dao that permeates day and night, his knowledge did not fully extend to it.\n\nThe *liang* system, arising together from level ground to serve the central *san*, divides from spring to autumn and must culminate at the solstice of summer—this is also the image of day. The *san* system, beginning and ending entirely within the earth, divides from autumn to spring and must culminate at the solstice of winter—this is also the image of night. Let us apply this to the constant transformations of daily life: emerging from *Zhen* is the beginning of human activity at sunrise—this is what the ancients called *Zhen* as the verification of the first day. Aligning with *Xun* is the interaction of movement and union. Appearing in *Li* is the culmination of interaction. Laboring in *Kun* is the extreme of movement gradually settling into stillness. Joyfully speaking in *Dui* is rest and reclusion. From *Zhen* to *Dui*, this is the function and form of day, commonly observed by all. As for contending in *Qian*, it ultimately adopts the *san* system’s conclusion. Its number nine preserves *Dui*’s surplus three, entering at dusk to rest within *Qian*’s six and thus concluding. This is the time when yin and yang press upon one another, closed and unused. Yet an ending contains a beginning, and when it reaches toiling in *Kan*, the qi of the night’s division stirs again, corresponding to the return of the seven-day cycle. Completing speech in *Gen* is the distant connection to *Dui*’s surplus three, joyfully speaking in *Dui*. The communication of qi between mountain and marsh, stimulating and uniting, though still in its place, moves when the time is right—this is the renewed beginning of human affairs.\n\nTransformation and change are the images of advance and retreat; hardness and softness are the images of day and night. From Fuxi and King Wen onward, I see that the *Hetu*’s single yin and single yang, advancing and retreating, ascending and descending, circulate endlessly. From antiquity to the present, whether in the distant cycle of a year’s winter and summer or the near cycle of a day’s day and night, nothing does not proceed by this Dao. In our daily lives and constant conduct, there is no need for other inquiries—the Dao of *san*-Heaven that begins in *Gen* is present herein. Regarding *Tai Xuan*’s use of seven hundred twenty-nine to emulate the *Yi*, or *Huangji*’s use of *yuan*, *hui*, *yun*, and *shi* to establish correspondences with the cycles of years, months, days, and hours, observing their transformations and exhausting their numbers in the *Hetu* reveals the visible workings of the Dao. Is this not simple and principle-attaining? Is this not the utmost in subtle transformation and the numinous?\n\nThe *Yitu Tongbian* concludes its third section.\n\n---\nThe Linchuan Daoist Lei Siqi studies\n*Hetu Bianzheng*\nThe *Hetu*’s existence as a diagram led Fuxi to draw the eight trigrams based on it; King Wen subsequently appended the hexagram statements, and it has been treasured and transmitted through the ages.\n\nFrom its first appearance in the *Book of Documents*’ *Counsels of Yu* as the \"arrangement of the *shu*\" to its present designation as the \"primordial,\" who would dare question it? Yet when we trace its origins through the records and reflect on antiquity, we find that earlier accounts lamented its loss of authentic expression, while later interpretations claim that even the *Counsels* failed to capture its true meaning—thus obscuring its original vision. After the Qin burning of the books, it survived solely in the *Book of Documents* commentary of Kong Anguo. The *Han Annals* merely noted its role in \"weaving together the warp and weft of the *Book of Changes*,\" while the *Apocrypha of the Changes* spun ever more convoluted theories, straying further from the original intent. By the Tang and Five Dynasties, its true form and semblance had become so obscure that none could fathom its primordial essence.\n\nAt the beginning of the Song, Chen Tuan of Chuan first revived the ancient study of images and numbers. Distressed by its debasement in the divination practices of yin-yang theorists and its entanglement in the *Qian Zaodu*’s *Taiyi* numerology for the nine-palace method, he composed the *Dragon Diagram* to disseminate his teachings. Though I was fortunate to examine his complete work and observe how its principles of separation and union, emergence and withdrawal, were expounded through numerical systems—seemingly as if he had laid bare the very hearts of Fuxi and King Wen—there remained aspects where he failed to grasp their intent. His initial error lay in extracting the number fifty-five from the original diagram to create a separate figure, which he arbitrarily labeled as the \"embodied *Luoshu*.\" While the original diagram already contained all the meanings of vertical and horizontal alignment, interweaving, division and unity, substance and function, the separation of the fifty-five numbers led later generations to abandon the root for the branch, fostering doubts about whether the *Hetu* and *Luoshu* emerged together. Though some affirmed and others denied, none pursued the matter to its ultimate conclusion, only fueling endless debate. When his disciple Liu Mu of Changmin further proliferated fifty-five diagrams under the title *Gouyin*, the distortions multiplied. At the time, Li Guan of Taibo refuted these errors, yet even he claimed to preserve three diagrams. Upon inspection, the first was the *Hetu* as commonly transmitted today; the second was the separate fifty-five-number figure arbitrarily labeled as the \"embodied *Luoshu*\"; and the third merely depicted the directional positions of the eight trigrams. Changmin, failing to discern the root, was indeed mistaken, but Taibo likewise failed to recognize that these three were fundamentally one, arbitrarily dividing them into three.\n\nFrom that time onward, the more it was transmitted, the more it was lost; the more it was expounded, the more forced the interpretations became. Some, citing the *Great Commentary*’s account of the *Hetu* emerging from the river and the *Luoshu* from the Luo, even doubted whether the *Great Commentary* was truly the work of Confucius. They did not understand that the *Hetu* was not the *Luoshu*, nor the *Luoshu* the *Hetu*. In the most extreme cases, the fifty-five-number diagram was falsely called the *Hetu*, while Chen Tuan’s transmitted *Hetu* was mislabeled as the *Luoshu*—a complete inversion, leading to endless confusion. They failed to see that the *Hetu*’s eight trigrams clearly display the fifty-five numbers, explicitly denoting the heavenly numbers (five) and earthly numbers (five). From heaven-one and earth-two to heaven-five and earth-ten, their sum is fifty-five, embodying substance and function, emptiness and fullness, origin and end—all fully expressed in a single diagram. When did it ever seek correspondence with the *Luoshu*? And when did the *Luoshu* ever claim to represent the fifty-five numbers?\n\nChen Tuan’s error began when he arbitrarily separated the fifty-five numbers from the *Hetu* to create a distinct diagram labeled as the *Luoshu*, thereby initiating the transmission of doubt. His initial intent likely stemmed from Han scholars’ transmission of the *Hongfan*’s first five phases, where the second is fire and the fourth is metal. The *Tai Xuan* modeled itself on the *Changes*, also designating two as fire (south) and four as metal (west). Yet in the *Hetu*, two is placed in the southwest and four in the southeast, reversing the positions of fire and metal. Unwilling to directly alter the *Hetu*, Chen Tuan instead extracted the fifty-five numbers to form the *Luoshu*, placing fire (two) in the south and metal (four) in the west according to the *Hongfan*, and appending seven to two and nine to four, thereby rearranging their positions in the south and west. Changmin, unaware of this reasoning, went so far as to claim that fire and metal had swapped places. Yet the number nine of *Li* (fire) resides in the due south, while the number seven of *Dui* (metal) resides in the due west—these are the natural transformations of heaven and earth through the interplay of five, and there is no justification for altering them. How could one arbitrarily compare them to the *Hongfan*’s fire (two) and metal (four) and presume to rearrange them? Moreover, the *Hongfan* only lists the numbers of the five phases, whereas Chen Tuan added seven and nine, attaching seven to two and nine to four—on what basis? If we follow the *Hetu*’s example, where seven is appended to two and nine to four, then the seven *yous* of doubt should correspond to the two of the five affairs, and the nine *fus* of fortune should correspond to the four of the five constants—what kind of coherence would this create? Two, seven, four, and nine are merely numbers, devoid of form, image, or fixed direction; they could be arbitrarily rearranged. But *Li* and *Dui* have their proper places, and fire and metal have their substance and function—would the creative transformations of heaven and earth willingly submit to human contrivance and alter themselves accordingly?\n\nChen Tuan did not recognize that the numbers of the *Hetu* and *Luoshu* are fundamentally distinct and cannot be made identical. By forcing an illogical comparison, he drew rigid boundaries where none existed, grasping the finger and losing sight of the shoulder and back. Moreover, the emergence of the *Hetu* was not merely about the textual forms of the four images and eight trigrams—it embodied the very substance and function of heaven and earth.\n\nLi in the south symbolizes heaven, yet its center harbors yin—yin by which descent is effected. Kan in the north symbolizes earth, yet its center holds yang—yang by which ascent is achieved. Zhen, with yang at its inception, thus mirrors the eastern rise of the Wood of the Bowels. Dui, with yin at its apex, therefore reflects the western descent of the Metal of the Yin. Qian and Kun embody the very substance of heaven and earth, while yin and yang enact the creative transformations—yet these two trigrams are relegated to the southwest and northwest corners. Habituated to common perception, one might suppose heaven and earth have exchanged places. Nor is this all.\n\nDivinatory methods further assign Zhen and Xun to Wood, Qian and Dui to Metal, Kun and Gen to Earth, while Kan alone represents Water and Li alone Fire. Thus Kan and Li monopolize Water and Fire, just as Qian and Kun are denied exclusive claim to Heaven and Earth—much like Fire and Metal, which cannot be rigidly fixed to a single direction. Kun, occupying the second position in the southwest, is where Earth’s second power generates Fire. Xun, in the fourth position in the southeast, is where Earth’s fourth power generates Metal—both yin. Yet Dui in the seventh position in the west and Li in the ninth position in the south are both yang. Thus the generating numbers are all yin, requiring the completion of yang numbers. Earth’s generating numbers proceed from west to south, hence Kun precedes Xun; its completing numbers proceed from south to west, hence Li precedes Dui.\n\nObserve how fire, once ablaze, reduces to ash and vanishes—fire transformed and spiritually transmuted. Though metal may melt, its essence endures—metal transformed yet its essence unchanged. This mutual transformation of Fire and Metal, alike yet not alike, explains why the numbers one, seven, four, and nine are not fixed but interweave in intricate variation, defying rigid directional analysis.\n\nThe diagram of fifty-five numbers places one, two, three, and four within the four directions, while six, seven, eight, and nine are arranged externally. Counting by direction may proceed, but how is one to trace a cyclical sequence that enables their circulation? Moreover, the numbers five and ten are merely assigned to the four directions as virtual functions. Though five and ten are termed Earth numbers, cosmologists distribute Earth’s dominion among the four directions—Chen, Xu, Chou, and Wei. Physicians, speaking of Earth as the Spleen, follow the five-phase cycle, each phase lasting seventy-two days, totaling three hundred sixty days. They further divide Earth’s seventy-two days, apportioning eighteen days to the end of each season, designating this as the Spleen’s period of governance. Medicine, so intimately concerned with human well-being, empirically confirms this division of Earth’s days—yet nowhere does it isolate five as a distinct entity outside the four directions, establishing a separate \"central five.\"\n\nFurthermore, the divinatory method of four operations completes the *Yi*, and eighteen changes form a hexagram. Each change involves four operations, so the total operations per hexagram number seventy-two—aligning with medical theory. Yet this diagram separates five, establishing an anomalous central five. If this center is designated as such, to what practical use shall it be put?\n\nThus, I contend that Chen Tuan’s invention of the fifty-five-number diagram, distinctively labeled the \"form of the *Luoshu*,\" was fundamentally misguided from its inception. The *Book of Documents*’ Nine Categories each possess their own completed numbers: the first pertains to the Five Phases, the second to the Five Affairs—here, one might still derive numerical coherence. Yet when forcibly extended to the fifth, the \"August Standard,\" it becomes impossible to specify what object or affair it represents. Even more egregiously, the ninefold \"Five Blessings\" are appended to the \"Six Extremities\"—should one count the nine, or the five blessings alongside the six extremities? The \"August Standard\" denotes the Great Mean, yet the \"Six Extremities\" represent extremes—can extremes be called \"mean\"? The August Standard is neither object nor affair, hence it may be designated as \"central.\" Yet to concretize it as five dots—do these dots thereby constitute the center?\n\nEach category, from one to nine, retains its inherent numerical integrity. How can they be arbitrarily combined into fifty-five? To insist on such a synthesis is mere delusion. Those who later equate the *Luoshu* with diagrams, and diagrams with the *Luoshu*, are delusional among the deluded.\n\nI maintain that while diagrams may possess coherent numerical structures, and the *Luoshu* may enumerate categorical types, it cannot be spatially arranged as a diagram. My adherence to the *Hetu* is not a claim to have personally witnessed the foundational principles by which Fu Xi and King Wen composed the *Yi*. Yet its numbers—five and ten—interweave horizontally, diagonally, laterally, and orthogonally, generating and completing through advance and retreat, surplus and deficit. The alternation of yin and yang in odd and even, division and union, the eight trigrams’ substantive and functional transformations—these embody the unfathomable subtleties of creation’s numinous workings, beyond human contrivance. They seem to emerge from the natural mechanisms of heaven itself, rightfully serving as the primordial source for Fu Xi and King Wen’s composition of the *Yi*.\n\nI have privately immersed myself in its study, extending its principles by analogy, adapting and penetrating its depths, entering its gate to grasp its profound essence. Presuming to have attained a comprehensive understanding of its substance and function, I have ventured to expound my interpretation. Yet unlike the Han scholars who dogmatically imposed the Five Phases to reconcile with the *Spring and Autumn*’s portents, or who forcibly harmonized the fifty-five numbers into the *Luoshu*, I dare not affirm such approaches, nor align myself with them.\n\nThe world may not yet fully comprehend this: the *Hetu* is sometimes said to derive from the *Apocryphon of the Yi*, *Qian Zao Du*, where the Great One deploys its numbers to traverse the Nine Palaces, with the four cardinal and four intercardinal directions each summing to fifteen.\n\nZheng Kangcheng, in his annotations, further cites the rationale for traversing the Nine Palaces, arriving at the vacant position at the center of the circuit—though this is not to be taken as the number five, but rather as the \"August One\" occupying the central palace of the five. Yet both his *Apocryphon* and *Commentary* are baseless fabrications, for they fail to recognize that the numbers five and ten are but empty designations employed to regulate the generation of odd and even, their numerical values existing in form alone while their positions remain fundamentally vacant. Moreover, what he terms the \"Grand Unity\" (*Taiyi*) differs fundamentally from the Supreme Ultimate (*Taiji*). If one does not grasp this distinction, consider the *Record*: \"Rites must be rooted in the Grand Unity, which divides to become Heaven and Earth, revolves to become yin and yang, transforms to become the four seasons, and arrays to become ghosts and spirits.\" Its principle is inherently distinct from that of the Supreme Ultimate, yet it may be laterally comprehended without contradiction. As this belongs to the *Record*’s class of texts, it is appended to the *Commentaries* as evidence.\n\n*Yitu Tongbian*, Scroll Four, concludes.\n\n---\n\n*Yitu Tongbian*, Scroll Five\nBy Daoist Lei Siqi of Linchuan\n\nWhen the ancient sages ruled all under Heaven, establishing the foundational principles of governance to enlighten myriad generations, was this achieved lightly, by arbitrarily imposing their own views to arrogate the power of creation? Clearly, such wisdom was bestowed by Heaven—this much is undeniable. Thus, when the Yellow River yielded the *Hetu*, Fuxi took it as a model to draw the Eight Trigrams; when the Luo River yielded the *Luoshu*, Yu the Great took it as a model to arrange the Nine Categories. In the *Great Commentary*, Confucius spoke of Heaven producing numinous artifacts, which sages took as models, and he included both *Hetu* and *Luoshu* in this, affirming their dual authority. Confucius did not speak of anomalies, force, disorder, or spirits—how could he have seen nothing of substance and yet delighted in fabricating falsehoods to deceive later generations? When Fuxi ruled all under Heaven, he looked up to observe the patterns of Heaven, looked down to observe the laws of Earth, examined the markings of birds and beasts and the suitability of the land, drew near to take from his own body, and drew far to take from external things, thereby creating the Eight Trigrams to communicate the virtue/power of the numinous and luminous and to categorize the conditions of the myriad things. Could the former and later sages have each imposed their own shallow understanding upon these matters? The *Yi*’s vastness matches Heaven and Earth, its adaptability matches the four seasons, and the principles of yin and yang match the sun and moon. As a text, it is vast and all-encompassing, perpetually renewing itself in tandem with Qian and Kun without decay. Without Heaven’s bestowal, could such a work exist? Here, Confucius, having witnessed the emergence of the *Hetu* and *Luoshu*, merely stated that sages took them as models—no other explanation was needed.\n\nMoreover, the *Hetu*’s appearance during the reigns of Cheng and Kang is recorded in the *Gu Ming*, where it was displayed behind the array of ritual vessels—no further accounts exist. Confucius already lamented its absence, sighing, \"It is over for me!\" At the dawn of the Han dynasty, Kong Anguo, in his *Book of Documents Commentary*, appended to the *Hetu* under the *Shu Xu* that when Fuxi ruled all under Heaven, a dragon-horse bore the *Hetu* from the Yellow River, and he took its patterns as a model, calling it the *River Chart*. Regarding the Heavenly bestowal of the *Hongfan*’s Nine Categories upon Yu, he stated that Heaven granted Yu the *Luoshu*, where a divine turtle bore the patterns on its back, arranged in numbers from one to nine, and Yu ordered them into nine types—these types being the *chou* (categories). These two accounts were originally recorded separately under the original passages of the *Hongfan* and *Gu Ming*, without additional elaboration.\n\nLater, Zheng Kangcheng began to cite the *Spring and Autumn Apocryphon* to jointly annotate the *Great Commentary*’s *Hetu* and *Luoshu*, stating: \"The Yellow River flows to connect Qian, issuing Heaven’s treasures; the Luo River circulates to link Kun, disgorging Earth’s tokens. The *Hetu* emerges with the dragon’s manifestation; the *Luoshu* arises with the turtle’s inspiration.\" He claimed the *Hetu* comprised nine scrolls and the *Luoshu* six, marking the onset of fantastical theories. Yet he still cited Kong Anguo’s annotations, affirming that the *Hetu* corresponded to the Eight Trigrams and the *Luoshu* to the Nine Categories. Subsequently, Wang Fusi and Han Kangbo offered no commentary on this matter. Although Kong Yingda’s *Yi Shu* transcribed Zheng’s annotations in full, he remarked that Wang Fusi’s interpretation followed an unknown tradition, clearly indicating his refusal to endorse Zheng’s views. In his commentary on the *Hongfan* in the *Book of Documents*, he again cited the *Appended Judgments*: \"The Yellow River yielded the *Hetu*; the Luo River yielded the *Luoshu*; sages took them as models.\" He noted that the nine categories each bore written characters, identifying them as the *Luoshu*, and that the \"Heaven\" which bestowed it upon Yu was none other than the *Luoshu* itself. He further cited Liu Xiang’s *Han Shu·Wuxing Zhi*, which stated: \"When Fuxi ruled by Heaven’s mandate, the Yellow River yielded the *Hetu*, and he took it as a model to draw the Eight Trigrams; when Yu governed the floodwaters, he was granted the *Luoshu*, and he took it as a model to arrange the *Hongfan*. The *Hetu* and *Luoshu* serve as warp and weft; the Eight Trigrams and Nine Categories serve as outer and inner.\"\n\n(Appendix) The foregoing is the shared account of earlier scholars.\n\nThe claim that \"a tortoise bore the *Luoshu* on its back\" finds no basis in the Classics. The *Zhonghou* and various *Wei* texts recount that the Yellow Emperor, Yao, Shun, Yu, Tang, Wen, and Wu all received *tushu* (chart-and-script), invariably describing dragons bearing charts and tortoises bearing scripts. The authorship of these *Wei* and *Hou* works remains unknown; scholars investigating their origins trace their forgeries to the reigns of Emperors Ai and Ping of the Han. Yet even before these texts appeared in the late Western Han, earlier scholars must have transmitted such accounts, which is why Confucius, in describing the nine categories, spoke of a divine tortoise bearing written patterns on its back—numbers from one to nine arranged in sequence—so that Yu, upon seeing them, ordered them to form the nine-category system. The assertion that \"Yu ordered them\" stems from the belief that divine beings’ speech must be concise; they would not meticulously arrange such sequences, hence the attribution to Yu.\n\n(Full Text) His commentary on the *Hetu* in the \"Guming\" chapter and on the \"Chuma Tu\" in the *Records* differs only slightly in detail, but their essential meaning aligns as follows: the so-called *Hetu* corresponds to the Eight Trigrams, and the so-called *Luoshu* corresponds to the Nine Categories—no dissenting views exist on this. From the Han through the Tang, as the *Yijing* circulated, no texts beyond the Classics, commentaries, or exegeses ever prefaced the *Hetu* and *Luoshu* to the canon. Only in the early Song did Chen Tuan (Tunan) first innovate to elucidate symbolic numbers, claiming to have grasped the profound intent of Confucius’ \"three presentations of the nine trigrams\" through deep study. He produced new writings, notably the *Longtu* (Dragon Chart), which, through recombination and transformation, yielded over twenty diagrams. These fully employed the *Dazhuan*’s numbers—\"Heaven one, Earth two... Heaven five, Earth ten, fifty-five in total\"—interwoven with the *Na Jia* system to unify *Yi* principles. One diagram, labeled \"Forming the Nine Palaces,\" and another, \"Forming the *Luoshu*,\" entirely omitted the five generating numbers, retaining only Earth’s numbers from six to ten. His explanation that \"ten is for application, ten is for completion\" merely reiterates the *Hongfan*’s enumeration of the five phases’ operational numbers. By the end of his work, he reintroduced two diagrams: the first, \"Forming the Nine Palaces,\" remained unchanged and was relabeled the *Hetu*; the second, merely rearranging the *Dazhuan*’s fifty-five numbers across the four directions and center, was arbitrarily renamed the *Luoshu*, devoid of any explanatory tradition or discourse. He arbitrarily relocated two and seven to the south, four and nine to the west—no one knows on what authority he based this—yet labeled it thus, likely following earlier interpretations of the *Hongfan*’s five phases (two as fire, four as metal) or the *Tai Xuan*’s alignment with the *Yi* (two as south, four as west). However, his theories did not spread widely, and few understood them.\n\nWhen Chen Tuan’s teachings passed through five generations to Liu Mu (Changmin), the latter expanded them to fifty-five diagrams, titling the work *Gouyin*. Teachers and disciples mutually praised and propagated these ideas, producing various *Yi* commentaries—*Discourse on Hexagram Virtues*, *Chamber Dialogues*, *Record of the Master’s Teachings*, *Essential Return*, *Subtleties*, and *Communing with the Divine*—collectively called *New Annotations on the Zhouyi*. Liu sought to mystify his work and legacy, yet upon scrutiny, no true marvels emerged. At the time, Li Guan (Taibo) authored *Six Discourses* to refute his errors, condemning them as misleading students and corrupting世教. He retained only three of Liu’s diagrams: the *Hetu*, the *Luoshu*, and the Eight Trigrams. While Liu’s proliferation of diagrams was indeed questionable, Li’s failure to recognize that these three diagrams shared a common origin was equally flawed. The *Hetu* originally arranged the Eight Trigrams with the fifty-five numbers. Liu and his followers later overturned the ancient interpretation of the *Luoshu*, arguing it was not merely the *Hongfan* but another script predating Fuxi, which Fuxi then used alongside the *Hetu* to create the *Yi*. Li’s view aligned with theirs—this perplexity defies understanding.\n\nUpon careful examination of this chapter in the *Dazhuan*, it presents models of Heaven and Earth, adaptations to the four seasons, and suspended images of the sun and moon, while also mentioning divination tortoises. Thus, it speaks of \"Heaven producing divine things for sages to model,\" referring specifically to divination. The *Yi* relies solely on divination, where the tortoise’s virtue is round and spirit-like, subtly aiding the divine to generate omens—how could the *Yi* involve tortoises? The mention of tortoises arises merely because both tortoises and milfoil can be used for divination. The preceding lines, \"modeling Heaven and Earth, adapting to the four seasons,\" are elaborated as: \"Heaven and Earth transform; sages emulate them.\" The earlier \"suspended images of the sun and moon\" are expanded to: \"Heaven hangs images; sages imitate them.\" As for \"Heaven producing divine things,\" this is further explained as: \"Like the Yellow River yielding the *Hetu* and the Luo River yielding the *Luoshu*, sages also model them.\" Since Fuxi, before Yu, modeled the *Hetu* to draw the trigrams, it naturally extended to Yu modeling the *Luoshu* to arrange the nine categories. How does this harm their analogous and interchangeable use? Did it ever intend to equate the numbers, meanings, or structural coherence of *tushu*? Did it ever claim *tushu* emerged simultaneously? Moreover, not only did Han scholars cite the *Hongfan* as the *Luoshu*, but even Chen Tuan’s initial \"Forming the *Luoshu*\" merely stated that \"ten is for application, ten is for completion,\" referring to the *Hongfan*’s enumeration of the five phases’ operational numbers—clearly identifying the *Luoshu* with the *Hongfan*. Unaware of his original intent, Liu and his followers betrayed their teacher’s transmission, asserting the *Luoshu* did not originate in Yu’s time, further confusing later scholars and depriving them of reliable foundations. Why?\n\nMoreover, it does not acknowledge that Confucius regarded the sage’s model as such. Not only was Fuxi’s time distant by generations and years, but even from Yu’s era, it had already been over a thousand years. To claim the *shu* emerged from the Luo, comparing it to Fuxi’s *tu* emerging from the River—how does this defy reason? Yet Changmin deliberately advanced this argument, thereby even casting doubt on Confucius’ *Great Commentary*. Though Tunan’s *Dragon Diagram* professed to derive from Confucius’ threefold exposition of the nine hexagrams, its preface states: “The *Dragon Diagram* was scattered by Heaven to be revealed; Fuxi assembled and applied it; Confucius silently embodied it.” It explicitly notes that the initial diagram remained unassembled, consisting solely of the fifty-five numbers. Thus, when the *Great Commentary* speaks of the twenty-five celestial numbers and thirty terrestrial numbers combined, how could it later arbitrarily relabel them as the *Luoshu*? This was surely an initial error. Changmin and his followers, however, perpetuated and compounded the mistake, taking it as the true *Luoshu* and substantiating the error with a fifty-five-number diagram. From Taibo onward, all regarded Tunan’s distinct fifty-five numbers as the authentic *Luoshu*. Yet they failed to consider: Tunan initially designated the *Luoshu* as “applying ten”—but where in the *Luoshu*’s nine categories does the number ten arise? Did they perhaps assume that since the *Great Commentary*’s *Hetu* could be revealed to the world, the *Luoshu* might likewise be revealed alongside it, thus appropriating the *Great Commentary*’s fifty-five numbers to fabricate the *Book of Documents*’ nine categories? Yet the nine categories speak of aligning and unifying the fifty-five numbers—where lies their application? This is the gravest of inconsistencies.\n\nI once traced the origins of Changmin’s claims. After Tunan, scholars like Zhong Fang, Xu Jian, and Li Gai left no further writings. As for his direct disciples, Fan Kuachang’s *Origins and Flow of the Great Simplicity* states: “The dragon-horse bore the *tu* from the River; Fuxi exhausted the interplay of Heaven and humanity, redefined the generative and completed numbers of the five phases, and established the forms of the eight trigrams on earth. Thus, Laozi transmitted to Confucius the origins of the *Yijing* from the Western Zhou: Heaven One at due north, Earth Two at due south, Heaven Three at due east, Earth Four at due west, Heaven Five at the center, Earth Six paired with *zi*, Heaven Seven with *wu*, Earth Eight with *mao*, Heaven Nine with *you*, and Earth Ten with the center—lodged at the end—constituting the fifty-five numbers of Heaven and Earth.” Yet why, after placing the first five numbers at the cardinal directions and center, did he then pair the latter five with *zi*, *wu*, *mao*, *you*, and the center? Are not *zi*, *wu*, *mao*, and *you* the cardinal directions? And to say Earth Ten is “lodged at the end”—does the center have an end? A close examination of the assigned numbers reveals that the diagram now transmitted lacks the four corner numbers—proving Kuachang utterly failed to grasp Tunan’s distinctive arrangement. Instead, he arbitrarily followed the *Tai Xuan Jing*’s alignment with the *Yijing*, adopting the *Hongfan*’s sequence of one Water, two Fire, three Wood, four Metal, and five Earth, then fabricated a baseless origin from Laozi, concocting bizarre theories to justify Tunan’s unconventional placement of two, seven, four, and nine. Yet he still did not assign the nine categories to the nine palaces.\n\nKuachang’s innovations merely extended the remnants of the *Na Jia* system and the divergent *Five Sons Return to Geng* method. He further claimed that the eight trigrams of the celestial realm—*kan* and *li* facing the center—were shifted outward, placing *qian*, *dui*, and *kun* in the east, and *gen*, *zhen*, and *xun* in the west. He did not acknowledge that the five phases largely originated from the *Yijing*; later, he reversed course and cited the five phases as the foundation for determining the hexagrams—this was another major instance of his audacious innovations. Thus, Changmin not only added the fifty-five-number diagram but also, following Kuachang’s exclusion of *kan*, *li*, *zhen*, and *dui* from the four cardinals, equated the four completion numbers with the four directions. He argued: *kan*’s six subtracts its trigram’s three numbers, leaving three numbers to form three lines as *qian*; *li*’s seven subtracts its trigram’s three numbers, leaving four numbers to form four lines as *xun*; *zhen*’s eight subtracts its trigram’s three numbers, leaving five numbers to form five lines as *gen*; *dui*’s nine subtracts its trigram’s three numbers, leaving six numbers to form six lines as *kun*—all deriving lines from numbers and labeling this the *Hetu*. This is to ignore the root and force the branches into alignment. Each of the eight trigrams consists of three lines, generating *yin* and *yang* through their interplay—never has it been heard that a trigram uses only three lines while its surplus lines are redistributed to form other hexagrams. The assigned numbers are arbitrarily paired, and to treat *kan*, *li*, *zhen*, and *dui* as the four images is even more erroneous. The images precede the formation of hexagrams, hence the saying: “The four images generate the eight trigrams.”\n\nHe further claimed that the *Luoshu*’s nine categories were the *Hetu*’s natural numbers, with the Supreme Ultimate at the center and the eight categories distributed across the four cardinals and four corners. The five phases were placed at *kan* one, the five affairs at *kun* two, the five regulations at *xun* four, and the five blessings at *li* nine—arranging the nine categories in sequence within the *Hetu*’s hexagram order. Yet the nine categories refer to Yu’s sequential enumeration, proceeding directly from the first one, the second one, without skipping three or four, and applying them in order. Now, aligning them with the *Hetu*’s fifteen vertical and horizontal numbers disrupts the sequence. Without addressing each discrepancy, let us examine the first category, the five phases. If they are indeed the five phases, they should be distributed across the five directions—how can all five be confined to a single direction?\n\nHow can they be called the five phases if they are not distributed accordingly? Moreover, the claim that fire and metal swap positions, differing from the *Hetu*, reveals such inversion and confusion as to defy comprehension. Later, Yang Cigong composed the *Dongji Jing* under the pseudonym Guan Ziming, wherein this text attributes to the Master the words: \"The original *Hetu* places seven in front and six behind, eight to the left and nine to the right. The sage observed this to draw the eight trigrams. Thus, the whole of seven’s three lines forms *Li*, while its odd line forms *Xun*; the whole of eight’s three lines forms *Zhen*, while its odd line forms *Gen*; the whole of six’s three lines forms *Kan*, while its odd line forms *Qian*; the whole of nine’s three lines forms *Dui*, while its odd line forms *Kun*. The even numbers exhaust their positions, the odd numbers complete their lines—this is said to be how the four images generate the eight trigrams, yet this is the most egregious of errors. *Qian* and *Kun* intertwine to produce the six children; how can what are now called male and female trigrams instead generate the trigrams of their parents? Moreover, to loosely claim that one and seven represent fire, or four and nine represent metal, might still deceive the uninitiated. But to explicitly state that *Li* nine is seven and *Dui* seven is nine is to suggest that the *Hetu*’s numbers can be arbitrarily rearranged—how can this be permissible?\n\nIt further asserts that the *Luoshu*’s pattern places five at its center, with nine in front and one behind, three to the left and seven to the right, four at the front-left and two at the front-right, eight at the back-left and six at the back-right. Later generations examined this and took it as the three images, then expanded it through nine transformations into twenty-seven images. Upon scrutiny, only the phrase \"five at its center\" does not contradict the *Luoshu*; the rest are merely the numbers of the *Hetu*, which, by adopting the *Luoshu*’s \"five at the center,\" entirely loses the principle underlying the five. The *Book of Documents*’ nine categories place the five of the royal standard at the center, fundamentally distinct in function—this can establish their positions. As for the *Hetu*’s \"heavenly five,\" it combines with the \"earthly ten\" to make fifteen, with the five being a quarter of the completed number and merging with the ten. How could there ever have been five empty points actually placed at the center of the diagram? The transmission of the diagram has been misled precisely by this five.\n\nCigong’s fabrication of these baseless examples merely serves to obscure his debt to Yang Xiong’s *Three Regions, Nine Provinces, and Twenty-Seven Departments*, which he privately adopted as his own work. In these two cases, the true *Hetu* and *Luoshu* have already been arbitrarily rearranged. Yet Zhu Xi and Cai Jitong instead revered them, believing them to be Guan Ziming’s work. Without considering that Ziming’s *Commentary on the Changes* is a work of profound insight—how could it compare to such imitations?—they followed these superficial conjectures, bolstering the claims by repeating that the *Hetu* places seven in front and six behind, eight to the left and nine to the right, and that the *Luoshu*’s pattern has nine in front and one behind, three to the left and seven to the right, four at the front-left, two at the front-right, eight at the back-left, and six at the back-right.\n\nThey argued that the *Great Commentary* presents the fifty-five numbers, while the *Hongfan* states that Heaven bestowed upon Yu the nine categories of the *Hongfan*, and that the numbers of the nine palaces—with nine worn on the head and one underfoot, three to the left and seven to the right, two and four as the shoulders, six and eight as the feet—match the pattern of a tortoise’s back. Liu Mu’s opinion, taking nine as the *Hetu* and ten as the *Luoshu*, falsely attributed this to Chen Tuan, contradicting the traditional views of the Confucians. He further cited the *Great Commentary* to claim that both originated in the time of Fuxi, thereby arbitrarily rearranging the *Hetu* and *Luoshu* without verification. Zhu and Cai’s criticisms were thus directed, yet they directly took Tu Nan’s initially mislabeled *Luoshu* as the *Hetu*, while reversing the original correct *Hetu* into the *Luoshu*. In doing so, Zhu and Cai themselves erred and then blamed the earlier mistakes of Zhang Changmin. Insisting on their own correctness and amplifying their arguments, they failed to reflect and reached this extreme.\n\nOnly Cheng Tai’s *Origins of the Changes* occasionally approached clarity. Yet those like Zheng Shuqing, following blindly, further embellished these fantastical claims with additional diagrams, none of which pointed to reality. They merely led later scholars to lose sight of the truth, believing what they should not and doubting what they should not, entangling and confounding the original principles, condemning what is correct and affirming what is not. Tracing the origins of this confusion, it all stems from Tu Nan’s use of the phrase \"one of ten\" to establish a misguided diagram, leading to this proliferation of errors. Initially, they borrowed the *Hetu* to support the *Luoshu*’s theories, but over time, they abandoned the diagram in favor of the book, and eventually, they took the book as the diagram. Thus, the *Hetu* became an indistinct concept—what purpose does the diagram serve, and what does its depiction of the fifty-five numbers represent? They do not realize that the fifty-five numbers initially arose from a misinterpretation of the *Luoshu*; now, clinging to them as the *Hetu* renders the diagram meaningless. As for those who take the *Luoshu* as the *Hetu*, the *Luoshu* is even less what it claims to be.\n\nSuch self-referential arguments have led scholars astray, like sheep lost on branching paths or horses sought in a chaotic market, their disputes as tangled as a clamor of voices—whom should one follow? This has persisted for nearly three hundred years. Thus, by tracing the origins of these errors and exposing the absurdities of these doubts, and by directly correcting them with the original numbers of the *Hetu*, it is hoped that scholars may see clearly, reach their own understanding, and recognize that Tu Nan’s claim of deriving the three arrays and nine trigrams from them is akin to deception. The methods of the diviners who follow the *Yiwei* in using one, six, and eight as white numbers to establish their starting examples are mere trivialities. Even the *Qianzao Du*’s assertion that the Great One takes these numbers to traverse the four cardinals and four corners, all summing to fifteen, is not entirely accurate. Yet from ancient times, scholars have firmly maintained that these were not fabrications by later hands. From my own perspective, there is no need to seek elsewhere: simply examine the chapter in the *Shuogua* that begins, \"The Supreme Deity emerges from *Zhen*,\" and repeatedly investigate its cyclical center. By seeking the true essence from heaven one to earth four and earth six to heaven nine, and clarifying the virtual function of heaven five and earth ten, then through the interplay of threes and fives, the alternation of heaven’s three and earth’s two, and the intricate arrangement of numbers, everything aligns seamlessly with the original intent of Confucius’ *Appended Remarks to the Changes*.\n\nThis is called the \"Triple Interplay.\" Confusion arises. Yet when the thunderous discourse is clarified, and the River Chart emerges—its transmission through antiquity unerring—it is sufficient to reveal the *Changes*. Thereby, one thoroughly comprehends the emergence of the Luo Book as one.\n\nBeyond the Nine Divisions, how could there still exist spurious fabrications of charts and numbers? This is truly one of the greatest joys of past and present.\n\n*Comprehensive Transformations of the Charts of the Changes*, Scroll Five, concludes.\n\n[Textual Notes:\n1. \"平\" originally written as \"乎\"; emended according to the *Siku* edition.\n2. \"禹\" in the *Siku* edition written as \"语.\"\n3. \"祇\" originally written as \"祇\"; emended according to the *Siku* edition.\n4. The *Siku* edition mistakenly transposes the passage beginning \"The Eight Divisions are distributed among the four cardinals and four corners\" through \"this is how positions are determined\" to follow this section; here clarified.\n5. \"太易\" in the *Siku* edition written as \"大易.\"\n6. \"谬\" originally written as \"缪\"; emended according to the *Siku* edition.\n7. \"不啻\" originally written as \"不趋\"; emended according to the *Siku* edition.]",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "易图通变 经名：易图通变。 原题临川道士雷思齐学。 五卷。 底本出处：《正统道藏》太玄部。 参校版本：文渊阁四库全书本经部易类（简称四库本）。 空山先生易图通变序 《道德》数千言，吾教之所独尊，古今未有能废之者？ 然传注层出，渺茫丛惑，莫适指归，徒见多岐之纷纷也。 雷思齐嗜学有要，精研是书，探窍本旨，为之传释，合儒、老之所同，历诋其所异，条分绪别，终始一贯，不翅入老氏之室，避之席以相授受也。 其将学是者，终#1究其说，知其玄之玄，而不昧其所向，传之将来，庶几於吾教非小补也。 至元丙戌#2嗣天师简斋张宗演序。 雷先生思齐，字齐贤者，临川之高士也。 遭宋亡，独居空山之中，着《易图筮通变义》、《老子本义》、《庄子旨义V凡数十卷，《和陶诗》三卷。 去儒服，称黄冠师，与故淳安令曾公子良、今翰林学士昊公澄相友善。 四方名士、大夫慕其人，往往以书、疏自通，或闻其讲学，莫不爽然自失。 故翰林侍讲学士袁公桶，博雅君子也，称其所着书，援据切至#3感厉，奋发合神以穷变，尽变以翼道。 且日：知齐贤不如是齐贤之意。 不明方今天下称为斯文宗#4莫先昊公； 天下称善着书，莫先昊公。 亦曰：与谈《老子》甚契。 又称其诗精深工致，豪健奇杰，有杜、韩风。 盖皆以为知言。",
      "translated_text": "**The Comprehensive Transformations of the Yi Diagrams**\n\n*Scripture Title:* *The Comprehensive Transformations of the Yi Diagrams*\n*Original Author:* Daoist Lei Siqi of Linchuan\n*Five fascicles*\n*Source Text:* *Daoist Canon of the Zhengtong Era*, *Tai Xuan* Section\n*Collated Edition:* *Complete Library in Four Treasuries*, Wenyuan Pavilion edition, Classics Division, *Yi* Category (hereafter *Siku* edition)\n\n**Preface to *The Comprehensive Transformations of the Yi Diagrams* by Master Kongshan**\n\nThe *Daode* [*jing*], though but a few thousand words, is the sole scripture revered by our teaching—has there ever been an age that could dispense with it? Yet its commentaries and annotations proliferate endlessly, leaving one lost amid a tangle of obscurities, with no clear path to follow, only the ceaseless clamor of divergent branches.\n\nLei Siqi, devoted to learning with discernment, has delved deeply into this text, plumbing its hidden principles and original intent. He has composed an exegesis that harmonizes the shared ground of the Confucians and the Daoists, systematically refuting their divergences, organizing its threads with precision, and weaving them into a seamless whole. His work is no less than entering the very chamber of the Old Master, taking his seat to transmit its teachings.\n\nFor those who study this text to the end, thoroughly grasping its doctrines, the profound mystery within the mystery will become clear, and they will not lose sight of its direction. Passed down to future generations, this work may yet render no small benefit to our teaching.\n\n*Preface by Zhang Zongyan, the Succession Celestial Master of Jianzhai, in the bingxu year of the Zhiyuan era.*\n\nMaster Lei Siqi, styled Qixian, was a lofty scholar of Linchuan. After the fall of the Song, he lived in seclusion in the Empty Mountains, where he composed *The Comprehensive Transformations of the Yi Diagrams in Divination*, *The Original Meaning of the Laozi*, *The Essential Meaning of the Zhuangzi*—in all, several dozen fascicles—as well as *Three Fascicles of Poems in Harmony with Tao [Yuanming]*. He abandoned Confucian robes, styling himself a Daoist master in the yellow cap, and befriended Zeng Zigong, the former magistrate of Chun’an, and Wu Cheng, now a Hanlin Academician. Scholars and gentlemen from all quarters, drawn to his reputation, often initiated correspondence with him, and those who heard him lecture invariably felt their own limitations.\n\nYuan Tong, Hanlin Academician and Lecturer-in-Waiting—a man of vast learning and refined character—praised his writings, noting their precise and compelling citations, their power to stir the spirit and exhaust transformations, and their capacity to fully embrace change in service of the Dao. He declared: *\"To know Qixian is not to know Qixian’s intent.\"* In the present age, none are more esteemed as pillars of culture than Academician Wu; none are more celebrated for their writings than Academician Wu. Yet he also remarked: *\"In discussing the *Laozi*, [Lei] is most profoundly attuned.\"* He further commended Lei’s poetry as profound, meticulous, vigorous, and extraordinary, bearing the spirit of Du [Fu] and Han [Yu]. Truly, these are words of insight.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 515,
      "start_sentence": 0,
      "end_sentence": 22,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.766507387161255,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\易图通变.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "呜呼，古称虞卿非穷愁不能着书，太史公世掌天官，使不遇祸，《史记》不作。 夫求雷先生之志，读雷先生之书，遑与世俗道哉。 遑与世俗道哉。 余读其所着之书，想其为人几五十年。 今又得其诗文二十卷，於其徒孙傅性真与周惟和传入京师来，因识以辞。 至顺三年三月揭俱斯书。 昔世祖皇帝既定江南，首召三十六代天师入朝。 未几，天师奉旨掌道教。 还山，遂礼请先生为玄学讲师，以训迪后人。 余时虽幼，而有志於学，遂受学於先生。 先生尝诲余曰：文章於道一技耳。 人之为学，将以明斯道也。 不明斯道，不足以为圣贤之学矣。 余由是日知所省，益自奋发。 及弱冠，入侍先师。 开府公於朝，遂不得事先生以终学焉。 先．生尝注《易图筮通变义》、《老子本义》、《庄子旨义》凡数十卷，诗文二十卷。 至顺二年秋，先生之徒弟傅性真，遣徒孙周惟和持所注诸书，来京师示余，且日：先生所注之书，虽有黄公震、曾公子良、昊公澄为之序，而未得公一言以发明之，敢以为请。 余日：嗟夫，先生之殁，迨三十年矣。 今不可得见，得见所注之书斯可矣。 然先生之学，岂所注之书可能尽．哉？ 后之观者，考诸书则知先生之学，诚不止若是也。 余今且老，久留於朝，常欲集先生诸文而序之，未果也。 今诸文既已成编，又岂敢嘿嘿无一言以发明先生之学哉？ 故续为之序。 先生讳思齐，字齐贤，学者尊之日空山先生，抚之临川人也。 至顺三年，岁在壬申六月旦日，昊全节序。 河图，八卦是也。 图之出，圣人则之。 包牺氏仰观象，俯观法，近取身，远取物，以通神明之德，类万物之情，始因之画八卦以作《易》者也。 孔子谓其则之，岂欺我哉？ 图之数以八卦成列，相荡相错，参天两地，参伍以变，皆自然而然。 后世不本其数，实惟四十，而以其十五会通于中，乃妄计天地之数五十有五，以意增制於四十之外，以求其合幸其中，故愈说愈迷，纷纷迄今。 余因潜心有年，备讨众说，独识先圣之指归，遂作《通变》，传以与四方千载学《易》者，同究於真是焉。 兼筮法亦乖素旨，附见后篇，求古同志宜能明其非敢诬也。 大元大德庚子九月，临川道士雷思齐齐贤序。 河图 河图本数兼四方四维，共四十，员布为体，以天五地十虚用以行其四十，故合天地之数五十有五。 河图四十征误之图 旧图改作方体，且实以天五於中，故不可推用。 今首出圆体，先征元误，览者详审后图，则自可见也。 河图参天两地倚数之图 参伍以变错综数图 参两错综会变总图 易图通变卷之一 临川道士雷思齐学 河图传上 则河图以作《易》，其数之所由起乎？ 数之起，不过一阴一阳之道而已。 《易》道之所以一阴．一阳者，不过以奇耦之数互为分且合，以生且成而已。 阳奇阴耦，变而通之，绳绳兮杂而不乱者，不过《大传》所谓天一、地二，以至天五且地十而已。 《易》有太极； 极，中也，一也； 中自一也。 是生两仪； 仪，匹也，二也； 匹而二也。 两仪生四象，一、一不三、四分之以为四生数； 四象生八卦，则六、七、八、九合之以为四成数也。 四奇为阳，阳虽有生成之异，而各列於四方之正； 四耦为阴，阴亦有生成之异，而同均於四维之偏，由正生偏，由偏成正也。",
      "translated_text": "Alas! Of old it was said that Yu Qing could not have written his works without poverty and sorrow, and that had the Grand Historian not suffered misfortune, the *Records of the Grand Historian* would never have been composed. How then could the aspirations of Master Lei, or the books he wrote, be measured by the standards of the common world? How could they be measured by the standards of the common world?\n\nFor nearly fifty years, I have read his writings and pondered the man behind them. Now, his disciples and grand-disciples—Fu Xingzhen and Zhou Weihe—have brought twenty scrolls of his poetry and prose to the capital, prompting me to inscribe these words in remembrance.\n\nIn the time of the late Emperor Shizu, after pacifying the lands south of the Yangtze, the court first summoned the thirty-sixth Heavenly Master to audience. Soon after, the Heavenly Master was entrusted with overseeing the Daoist teachings. Upon returning to his mountain, he respectfully invited Master Lei to serve as Lecturer in the Mysteries, instructing later generations in the profound learning. Though I was young at the time, I was already devoted to study and became his student. The Master often instructed me: *\"Literature is but one branch of the Dao. The purpose of learning is to illuminate this Dao. Without illuminating the Dao, one cannot attain the learning of the sages and worthies.\"* From then on, I grew daily in self-awareness and resolve. By the time I came of age, I entered the service of my late teacher at court, and thus could not remain with Master Lei to complete my studies.\n\nThe Master had annotated *The Comprehensive Meaning of Changes in the Yi Diagrams and Divination*, *The Original Meaning of the Laozi*, and *The Essential Meaning of the Zhuangzi*, amounting to several dozen scrolls, along with twenty scrolls of poetry and prose. In the autumn of the second year of Zhishun, his disciple Fu Xingzhen dispatched his grand-disciple Zhou Weihe to present the annotated works in the capital, saying: *\"Though Master’s annotations have been prefaced by Huang Gongzhen, Zeng Gong Ziliang, and Academician Wu Cheng, they lack a word from you to elucidate their significance. We humbly request your contribution.\"* I replied: *\"Alas! The Master has been gone for thirty years. Though I cannot see him again, to see his annotated works is enough. Yet how could his learning be fully encompassed by these annotations? Those who come after and examine these works will know that the Master’s learning was far greater than what is contained here.\"*\n\nNow in my old age, long settled at court, I have often wished to compile and preface the Master’s writings, but have not yet done so. Now that these works are finally assembled, how could I remain silent and fail to offer a word to illuminate the Master’s learning? Thus, I continue this preface.\n\nThe Master’s name was Siqi, styled Qixian. Scholars revered him as Master Kongshan. He was a native of Linchuan in Fuzhou.\n\nOn the first day of the sixth month of the third year of Zhishun, in the ren-shen year, Wu Quanjie wrote this preface.\n\n---\n\nThe *Hetu* is none other than the Eight Trigrams. When the Diagram emerged, the sages took it as their model. Fu Xi observed the heavens above and the patterns below, drew from his own body and distant things, to connect with the virtue of the numinous and categorize the conditions of the myriad things. Thus, he first drew the Eight Trigrams and composed the *Yi*. Confucius affirmed that he took the Diagram as his model—how could he have deceived us?\n\nThe numbers of the Diagram are arranged in the Eight Trigrams, interacting and interweaving, blending heaven and earth, varying in threes and fives, all naturally so. Later generations, failing to grasp its numbers—truly only forty—with fifteen converging at the center, arbitrarily calculated the numbers of heaven and earth as fifty-five, adding to the forty by conjecture to seek harmony. Thus, their explanations grew ever more confused, and the confusion persists to this day.\n\nAfter years of deep reflection and exhaustive study of various theories, I alone discerned the intent of the ancient sages. Thus, I composed *Comprehensive Changes* to transmit to scholars of the *Yi* across the ages, that together we might explore its true essence.\n\nThe methods of divination have also strayed from their original principles. These are appended in later chapters, and those who share this ancient commitment will surely recognize that I do not dare to mislead.\n\nIn the ninth month of the geng-zi year of the Dade era of the Great Yuan, Lei Siqi of Linchuan, styled Qixian, wrote this preface.\n\n---\n\n**The *Hetu***\n\nThe original numbers of the *Hetu* encompass the four cardinal directions and four corners, totaling forty, arranged in a circular formation. The five of heaven and ten of earth are left empty to activate the forty, thus combining the numbers of heaven and earth to make fifty-five.\n\n**Diagram of the Forty Errors in the *Hetu***\n\nThe old diagram was altered into a square form, with the five of heaven placed solidly at the center, rendering it unusable for deduction. Here, I first present the circular form to demonstrate the original errors. Those who examine the subsequent diagrams will see the truth for themselves.\n\n**Diagram of the *Hetu* Blending Heaven and Earth in Dependent Numbers**\n\n**Diagram of Variations in Threes and Fives, Interwoven Numbers**\n\n**Comprehensive Diagram of Interwoven Dualities and Variations**\n\n**Volume One of *Comprehensive Changes in the Yi Diagrams***\n*By Lei Siqi, Daoist of Linchuan*\n\n---\n\n**Transmission on the *Hetu*, Part One**\n\nWas it not from the *Hetu* that the *Yi* was composed, and from its numbers that the *Yi* arose? The origin of these numbers lies in nothing more than the Dao of one yin and one yang. The Dao of the *Yi* consists in nothing more than the odd and even numbers alternately dividing and uniting, generating and completing. Yang is odd, yin is even; when transformed and made fluid, their continuity is intricate yet never disordered. This is nothing more than what the *Great Commentary* calls \"heaven one, earth two,\" extending to \"heaven five and earth ten.\"\n\nThe *Yi* has the Supreme Ultimate. *Ji* means center, meaning one; the center is one. Thus, the Two Modes are generated. *Yi* means pair, meaning two; paired, they are two. The Two Modes generate the Four Images: one and one, not three, divided into four generating numbers. The Four Images generate the Eight Trigrams: combining six, seven, eight, and nine to form the four completing numbers. Four odds make yang; though yang has distinctions of generation and completion, each is aligned with the cardinal directions. Four evens make yin; though yin also has distinctions of generation and completion, they are evenly distributed among the four corners. Thus, from the cardinal directions, the corners are generated, and from the corners, the cardinal directions are completed.",
      "overlap_context": "e change in service of the Dao. He declared: *\"To know Qixian is not to know Qixian’s intent.\"* In the present age, none are more esteemed as pillars of culture than Academician Wu; none are more celebrated for their writings than Academician Wu. Yet he also remarked: *\"In discussing the *Laozi*, [Lei] is most profoundly attuned.\"* He further commended Lei’s poetry as profound, meticulous, vigorous, and extraordinary, bearing the spirit of Du [Fu] and Han [Yu]. Truly, these are words of insight.",
      "start_char": 515,
      "end_char": 1771,
      "start_sentence": 23,
      "end_sentence": 83,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.38308835029602,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\易图通变.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "一与三为奇，为阳之生数，而必待於六与八之阴数以为成。 二与四为耦，为阴之生数，亦必赖於七与九之阳数以为成也。 自北而东，一而三，乃阳生之进数； 而其自八而六，东而北，阴成之退数者，固已寓乎其中。 自西而南，二而四，乃阴生之进数； 而其自九而七，南而西，阳成之退数者，亦兼具乎其中矣。 四方者，各以其阳奇居于正； 四维者，各以其阴耦附于偏。 然天数之有五，地数之有十，均合於阴阳之奇耦，而同谓之生成，乃独无所见於四方之位，何也？ 四象元五，八卦元十故也。 然《易》之所以范围不过，曲成不遗者，正由假此天五与地十之虚数，以行其实用； 於四象、八卦而成河图者，特不当效世习置五虚点於图中心，而附以十点，谬云五十，而不知其用也。 坎以一始於正北，而一五为乾六於西北； 坤以二分于西南，而二五为兑七於西； 震以三出於东，而三五为艮八於东北； 巽以四附於东南，而四五为离九于正南。 故阳得五而阴，耦得五而奇，阴得五而阳，奇得五而耦，是生数之所以成，成数之所以生者也。 生数少於五，元所待以制中也，故阳数之一与三，自为中於乾六艮八成数之外。 阴众而阳孤，坎故谓陷也。 成数多於五，不能自适於中也，故阴数之二与四，取五於离九兑七成数之阳之内。 阳正而阴偏，离故谓丽也。 陷必止而求动，故帝出乎震。 动所以取合，由分而。 也。 丽必顺而相说，故说言乎兑。 说所以致分，由合而分也。 阳之进数坎，独为生数之始，由北顺行，东交於巽四； 阴之进数坤，亦为生数之次，由西南逆行，东合於震三，．是阴阳之生数三、四俱前而合。 考於时，今四月为乾月，卦六阳之交； 坤月，卦六阴之承，故有巽元乾，帝出震而齐乎巽也。 阳之退数离，独得成数之中，由南顺行，西终于兑七； 阴之退数艮，实始之由东北逆行，既北而西，究於乾六，是阴阳之成数六、七俱后而分。 考於时，今十月为坤月，卦六阴之终； 乾月，卦六阳载始，故有乾而元巽，说言、乎兑，战乎乾也。 天数始於一，则太极之全也，阳之正也； 一析而二，则太极之分也，阴之偏也。 一二参而三，则阳既唱而奇； 一三转而四，则阴遂随而耦。 由一与四唱於前，交对而为五，而其二与三随於后，亦交对而为五，是两其五。 两五相伍，则十也。 参以天五，是参伍也。 古文之五久，古今文之十皆十，是其象也。 变而通之，生数之所以成，成数之所以生也。 坎一、巽四而五，故乾六、离九而十五也，合之而二十。 坤二、震三而五，故兑七艮八而十五也，合之亦二十。 是一、二、三、四之十成六、七、八、九之三十，故河图之数止於四十，而虚用天五与地十，而为天地之数五十有五也。 生数之二五而十，虽分阴分阳，而俱以生数之阳载成数之阴，以维北若东，而中由以立。 两其十五而三十，遂互阴＇互阳，而又以成数之阴奉生数之阳，以维南若西，而中所以行也。 立者，寄於虚以体其实； 行者，布其实以用其虚也。 一、二、三、四，交罗四象，而四互其虚五以为十，而为生数之体； 六、七、八、九并包八卦，而四分其实五以为二十，而为成数之用； 两五之合十，固已旁正而交为二十之分体。",
      "translated_text": "One and three are odd numbers, the generative numbers of yang, yet they necessarily await the yin numbers six and eight to reach completion. Two and four are even numbers, the generative numbers of yin, yet they likewise depend on the yang numbers seven and nine to reach completion.\n\nFrom north to east, one advances to three—this is the progressive sequence of yang’s generation. Yet within it is also contained the regressive sequence of yin’s completion, from eight to six, from east to north. From west to south, two advances to four—this is the progressive sequence of yin’s generation. Yet within it is also contained the regressive sequence of yang’s completion, from nine to seven, from south to west.\n\nThe four cardinal directions each position their yang odd numbers at the center; the four corners each attach their yin even numbers to the periphery. Yet why do the celestial number five and the terrestrial number ten—both harmonizing with the odd and even of yin and yang, both termed \"generative\" and \"completive\"—remain unseen in the positions of the four directions? It is because the Four Images originally lack five, and the Eight Trigrams originally lack ten.\n\nYet the *Yi*’s capacity to encompass all without excess and to achieve all without omission arises precisely from employing these virtual numbers—celestial five and terrestrial ten—to enact their practical function. In the *Hetu* formed from the Four Images and Eight Trigrams, one should not follow vulgar practice by placing five virtual points at the diagram’s center and appending ten points, falsely calling it fifty, unaware of its true application.\n\n*Kan* begins with one at due north, and one with five becomes *Qian* six at the northwest. *Kun* divides with two at the southwest, and two with five becomes *Dui* seven at the west. *Zhen* emerges with three at the east, and three with five becomes *Gen* eight at the northeast. *Xun* attaches with four at the southeast, and four with five becomes *Li* nine at due south. Thus, yang gains five and becomes even; even gains five and becomes odd; yin gains five and becomes yang; odd gains five and becomes even—this is how generative numbers reach completion and how completive numbers arise.\n\nGenerative numbers are fewer than five, originally awaiting the regulation of the center. Thus, the yang numbers one and three establish their center beyond the completive numbers *Qian* six and *Gen* eight. Yin is multitudinous while yang is solitary—hence *Kan* is called \"the Abyss.\" Completive numbers exceed five and cannot independently attain the center. Thus, the yin numbers two and four borrow five from within the yang of the completive numbers *Li* nine and *Dui* seven. Yang is central while yin is peripheral—hence *Li* is called \"Clinging.\"\n\nThe Abyss must halt and seek movement—thus the Lord emerges in *Zhen*. Movement serves to unite, proceeding from division. Clinging must yield and delight—thus joy is spoken of in *Dui*. Joy serves to divide, proceeding from union.\n\nThe progressive sequence of yang, *Kan*, alone begins with the generative number, proceeding clockwise from north to meet *Xun* four in the east. The progressive sequence of yin, *Kun*, likewise follows as the next generative number, moving counterclockwise from the southwest to join *Zhen* three in the east—thus the generative numbers of yin and yang, three and four, both advance and unite. Examining the seasons, the fourth month is the *Qian* month, when the hexagram’s six yang lines intersect; the *Kun* month, when the hexagram’s six yin lines submit—hence *Xun* originally lacks *Qian*, and the Lord emerges in *Zhen* to align with *Xun*.\n\nThe regressive sequence of yang, *Li*, alone attains the center of completive numbers, proceeding clockwise from south to conclude in *Dui* seven. The regressive sequence of yin, *Gen*, truly begins by moving counterclockwise from the northeast, then north and west, culminating in *Qian* six—thus the completive numbers of yin and yang, six and seven, both recede and divide. Examining the seasons, the tenth month is the *Kun* month, when the hexagram’s six yin lines end; the *Qian* month, when the hexagram’s six yang lines bear the beginning—hence *Qian* originally lacks *Xun*, joy is spoken of in *Dui*, and conflict arises in *Qian*.\n\nThe celestial number begins with one—this is the entirety of the Supreme Ultimate, the correctness of yang. One splits into two—this is the division of the Supreme Ultimate, the peripherality of yin. One and two intermingle to form three—thus yang has already intoned and become odd. One and three transform to form four—thus yin subsequently follows and becomes even. From one and four intoning at the fore, their intersection and opposition form five; from two and three following behind, their intersection and opposition likewise form five—this is the doubling of five. Two fives interweave to form ten. Interlacing with celestial five—this is the interweaving. The ancient character for five was 久; the ancient and modern characters for ten were both 十—these are their images.\n\nTransforming and penetrating them, this is how generative numbers reach completion and how completive numbers arise. *Kan* one and *Xun* four form five—thus *Qian* six and *Li* nine form fifteen, their sum being twenty. *Kun* two and *Zhen* three form five—thus *Dui* seven and *Gen* eight form fifteen, their sum likewise being twenty. Thus, the ten of one, two, three, and four complete the thirty of six, seven, eight, and nine—hence the *Hetu*’s numbers conclude at forty, virtually employing celestial five and terrestrial ten to constitute the fifty-five numbers of heaven and earth.\n\nThe generative numbers’ two fives form ten, though divided into yin and yang, both employ the yang of generative numbers to bear the yin of completive numbers, sustaining the northeast and east, thereby establishing the center. Doubling the fifteen to form thirty, they then alternate yin and yang, further employing the yin of completive numbers to serve the yang of generative numbers, sustaining the south and west, thereby enacting the center.\n\nEstablishment lodges in the virtual to embody the actual; enactment distributes the actual to employ the virtual. One, two, three, and four interweave the Four Images, their four virtual fives forming ten to constitute the essence of generative numbers. Six, seven, eight, and nine encompass the Eight Trigrams, their four actual fives dividing into twenty to constitute the function of completive numbers. The union of two fives to form ten has already, through orthogonality and intersection, divided into the twenty of the partial and the whole.",
      "overlap_context": "our Images generate the Eight Trigrams: combining six, seven, eight, and nine to form the four completing numbers. Four odds make yang; though yang has distinctions of generation and completion, each is aligned with the cardinal directions. Four evens make yin; though yin also has distinctions of generation and completion, they are evenly distributed among the four corners. Thus, from the cardinal directions, the corners are generated, and from the corners, the cardinal directions are completed.",
      "start_char": 1771,
      "end_char": 2998,
      "start_sentence": 84,
      "end_sentence": 136,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.128984689712524,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\易图通变.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "二十之分五，乃离合而统为天五之全用； 十交五体，五周十用也。 坎一、离九而十，坤一不艮八而十，震三一兑七而十，巽四、乾六而十，皆一生一成也。 一必九，三必七者，四方四奇之十阳十也。 二必八，四必六者，四耦四维之十阴十也。 是四五本二十，今则四十四。 伍而什，皆所以分中於成数之实十四； 什而伍，又所以合中於生数之虚五也。 是五五而十，十什而五，参伍错综，其数从横斜正，倒之颠之，元不十五者也？ 伍之而十，均十也。 一与九之十，维坎维离。 坎一居阴北，阳之始生，阴中之阳，阴极而生阳也。 阳之一初而独立於中。 离九居阳南，阳之终极，阳、中之阳，阳极生阴，丽於巽四、坤二生数之阴。 阴不专立，而当九阳之盛际，阳旱合而制中者也。 《说卦》谓水火相逮而不相射者，冬、夏之至也。 冬至坎之自中，夏至阳极而阴中也。 二与八之十，维坤维艮； 三与七之十，维震维兑。 阳自下而升，由北东而极于南； 阴自上而降，由南、西而极于北。 此其交进交退以适于中者，阴阳东西之所纬，往复启闭之所涂，否泰通塞之期，而出震致坤，说言成言，而山泽通气以为春秋之分，所以曲而畅、旁而通之也。 至於四与六之十，维巽维乾，此又阴阳之始终。 终始，天地之穷变，变通莫不由此制用。 何以明之？ 阳自乾、坎，而艮、震自后而前，以合於东南之巽。 阴自巽、离，而坤、兑自前而后，而分於西北之乾。 阳之生数一而三，总而四，而巽兼之； 阴之生数二而四，总而六，而乾兼之。 四而倍分之，则八节，与经卦所以序者，类而长之也。 六而倍分之，则六阴六阳，十有二月，与重卦之所以列者，引而伸之也。 、况乾之六虽二与四合而成，然以一合五亦成也。 由五外交乎一而六，五犹生数，六已成数矣。 乃自有生成之道焉。 况合乎坎之一即中，故乾特以老阴而变九也。 若巽但#5以一与三之生数而限之以四，阳气不足於数，元以自达於中，故借数於离九之中五，乃始得中而与坎对。 中以四合五，乃至於阳之极位，极而必反，是巽、离兼数，所以九为老阳而变六也。 是特以乾、巽对十，而九六之变为然。 至於乾、巽之互为分合、始终，则有不止此。 震三、巽四合而雷风相薄，见於《怛》卦。 巽当四月，则己如前说。 若兑七乾六分而西北，乾当十月，则又未易以乾、巽对十为说而止者。 乾阳也，数乃阴六，而位於坎前； 兑阴也，数乃阳七，而位於坤后。 故於乾、兑六、七之中，各借五为之乘除，而变乾之六而於参伍之前，有一乾在坎前，是乾之一出而为坎之一； 兑之七而於参伍之后，有二兑在坤后，是坤之二入为兑之二也。 乾、兑虽以成数之六、七互分，而坎、坤乃以生数之一、二互起於中矣。 然而兑不名二，而坤名二； 坎名一，而乾不名一。 乾之所以不自名其一者，盖以寓其不入於数，而并包八卦之五与十生成之用，而为太极之全也。 此以数言，则天一、地二，天地设位。 以气言，则分阴分阳，阴阳相薄。 而《易》所以行乎其中者，始由於是，则阳生之进数所以为阴成之退数，阴生之进数所以为阳成之退数，乃互进互退，迭生迭成，此其生生之易，一阴一阳之道，元所终穷也。",
      "translated_text": "The division of twenty into fives thereby separates and unites to govern the full function of the celestial five. Ten intersects with five bodies, five cycles through ten functions.\n\nKan’s one and Li’s nine make ten; Kun’s one and Gen’s eight make ten; Zhen’s three and Dui’s seven make ten; Xun’s four and Qian’s six make ten—each pairing one generative with one completive. That one must pair with nine, and three with seven, constitutes the ten yang of the four cardinal directions and four odd positions. That two must pair with eight, and four with six, constitutes the ten yin of the four even positions and four corners. Thus, four fives originally form twenty, but now they become forty-four. Grouping by fives into tens serves to distribute the center among the actual tens of completive numbers; grouping by tens into fives serves to unite the center with the virtual five of generative numbers. Is it not that five fives make ten, ten tens make five, interweaving in crisscross patterns—whether vertically, horizontally, diagonally, inverted, or reversed—none fail to resolve into fifteen?\n\nGrouping by fives to make ten ensures uniformity. The ten of one and nine resides in Kan and Li. Kan’s one dwells in the northern yin, where yang first arises—yang within yin, yin at its extreme generating yang. Yang’s one stands alone at the center’s inception. Li’s nine dwells in the southern yang, where yang reaches its ultimate—yang within yang, yang at its extreme generating yin, conjoined with Xun’s four and Kun’s two, the yin of generative numbers. Yin does not stand alone but arises at the zenith of nine yangs, where yang and yin merge to regulate the center. The *Shuo Gua* speaks of water and fire reaching one another without repelling, for they mark the solstices. The winter solstice emerges from Kan’s center; the summer solstice, yang at its extreme, harbors yin within.\n\nThe ten of two and eight resides in Kun and Gen; the ten of three and seven resides in Zhen and Dui. Yang ascends from below, rising from north and east to culminate in the south; yin descends from above, falling from south and west to culminate in the north. Their alternating advance and retreat to attain the center weave the warp of yin and yang, east and west, the path of opening and closing, the cycle of obstruction and passage. From Zhen’s emergence to Kun’s culmination, from joyful words to fulfilled speech, mountains and marshes exchange qi to mark the division of spring and autumn—thus bending to flourish, branching to connect.\n\nAs for the ten of four and six, residing in Xun and Qian, this further marks the beginning and end of yin and yang. Beginning and end, the ultimate transformations of heaven and earth, all changes and communications proceed from this regulation. How to clarify this? Yang originates in Qian and Kan, then Gen and Zhen advance from behind to unite in Xun of the southeast. Yin originates in Xun and Li, then Kun and Dui advance from ahead to divide in Qian of the northwest. Yang’s generative numbers—one and three—sum to four, which Xun encompasses; yin’s generative numbers—two and four—sum to six, which Qian encompasses. Doubling four yields the eight nodes, aligning with the sequence of the primary trigrams; doubling six yields six yins and six yangs, twelve months, extending the arrangement of the hexagrams.\n\nMoreover, though Qian’s six arises from the union of two and four, it also forms by combining one and five. From five’s external intersection with one emerges six—five remains generative, while six becomes completive. Yet this follows the Dao of generation and completion. Moreover, when united with Kan’s one at the center, Qian uniquely transforms its old yin into nine. As for Xun, constrained by the generative numbers one and three to a limit of four, yang qi lacks numerical sufficiency to reach the center independently, thus borrowing the central five from Li’s nine to attain the center and oppose Kan. Only by combining four with five does it reach yang’s extreme position; at the extreme, it must revert. Thus, Xun and Li’s shared numbers explain why nine, as old yang, transforms into six.\n\nThis specifically addresses the pairing of Qian and Xun in tens and the transformation of nine and six. Yet Qian and Xun’s mutual division and union, their beginning and end, extend beyond this. Zhen’s three and Xun’s four unite as thunder and wind pressing against one another, as seen in the *Da* hexagram. Xun governs the fourth month, as previously explained. Dui’s seven and Qian’s six divide in the northwest, with Qian governing the tenth month—thus the pairing of Qian and Xun in tens does not suffice as an explanation. Qian is yang, yet its number is yin six, positioned before Kan; Dui is yin, yet its number is yang seven, positioned after Kun. Thus, within Qian and Dui’s six and seven, each borrows five for multiplication and division: transforming Qian’s six through the permutations of three and five, a Qian emerges before Kan—Qian’s one thus becomes Kan’s one; transforming Dui’s seven through the permutations of three and five, two Duis emerge after Kun—Kun’s two thus enters Dui’s two.\n\nThough Qian and Dui divide through the completive numbers six and seven, Kan and Kun arise through the generative numbers one and two within the center. Yet Dui is not named two, while Kun is named two; Kan is named one, while Qian is not named one. That Qian does not name its one arises from its embodiment of non-entry into numbers, encompassing the five and ten of generative and completive functions across the eight trigrams as the totality of the Great Ultimate. Speaking in terms of numbers: heaven as one, earth as two, heaven and earth establish their positions. Speaking in terms of qi: dividing yin and dividing yang, yin and yang press against one another. The *Yi*’s operation within them begins here—thus yang’s advancing generative numbers serve as yin’s retreating completive numbers, and yin’s advancing generative numbers serve as yang’s retreating completive numbers. Alternately advancing and retreating, alternately generating and completing, this ceaseless generation of the *Yi*, the Dao of one yin and one yang, knows no end.",
      "overlap_context": "e actual; enactment distributes the actual to employ the virtual. One, two, three, and four interweave the Four Images, their four virtual fives forming ten to constitute the essence of generative numbers. Six, seven, eight, and nine encompass the Eight Trigrams, their four actual fives dividing into twenty to constitute the function of completive numbers. The union of two fives to form ten has already, through orthogonality and intersection, divided into the twenty of the partial and the whole.",
      "start_char": 2998,
      "end_char": 4221,
      "start_sentence": 137,
      "end_sentence": 189,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.574620962142944,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\易图通变.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "岂不至精至变而至神者与？ 又况《易》以一其三画，因得析而生八卦； 二其三画，遂得错而成八八之卦。 若其卦之成画，则止於六矣。 乃复於乾独三，其三以至谓之九，何也？ 凡卦画如图，以五为中，必有九而后中，乃在五既中五之后。 六为上爻者，盖其卦气之余也。 生数既终，成数攸始，此九、六虚实之所以寄也。 坤起於成数之六而实，乾极於成数之九．而虚。 六乃坤数成始，附於图位，则以寄其乾九。 九乃乾数成终，附於卦位，则以同於坤六。 其六居退数之极，而进居乎坎中之前； 九居进数之极，而退附乎离丽之后，故六於卦犹有位，九於卦已无位，而并寄位於六。 而迭为九六者，九虚六实，因兼着其体用也。 且乾老阳也，坤老阴也，父母之谓也。 少阴、少阳，则六子男女之谓也。 少阴、少阳之数，则七、八也。 乾元用九，坤元用六，合六十四卦，元有七、八，而唯有九、六。 是男女者，亦由父母之所变，而随以变者也。 凡物之产，莫不由於母，而莫名其父之德之在，故《坤》犹见於六画之体。 而《乾》之九有其九用，而莫究其体之由，是所以神元方而《易》元体者也。 天一兼天五而六，地二合地四而六，五与六当十数生成互中之地，纳甲以戊己为中，纳戊以中乎坎，纳己以中乎离。 戊己，即五六也，置於坎、离之中，所以见其互中也。 六合二四，为地数之成始，见於卦之《坤》曰：龙战于野。 即战乎乾。 疑於阳而嫌於元阳，见阴之有待於阳也，故其道穷。 而《坤》之用六不过，日：利永贞。 天数之一、五、九，是所谓始中终九为天数之成终，见於卦之《乾》日：亢龙有悔。 盈不可久，而不可为首； 而《乾》之用九，则天下治，而见天则是见其行健，元所待於阴也。 一与九合为乾，则其数十，而十乃寄於天九之外，元所致其用矣。 地道元成，而代有终，又有在於是，是筑论九、六之大凡，可以意讨也。 河图之列，只．为经卦设，今而并及於重卦之体用也。 经卦、重卦元往而不一阴．一阳，由奇耦之分合，以生始成终者也。 一、二、三、四而五同为生数，一至四，其实体； 五，其虚用也。 六、七、八、九而十同为成数，六至九，其实体； 十，其虚用也。 四象元五，八卦元十，坦然明白矣。 四方各具十数，总而四十，四隅各包五数，共为二十。 二十则四其五，而虚用者各居其半； 四十者八其五，而实体者兼会其全，故四象合八卦，而总之则四十也。 五为立中之体而生，十为行中之用而成也； 且五分於成数六、七、八、九之内，皆阴数少而阳数多。 阴固偏，阳固正。 五不得中而寄於四隅之偏，十合於生数一、二、三、四之外，皆阳数少而阴数多。 阴亦偏，而阳亦正。 十各成中而居四方之正，然则正则中，中则正也。 五始既所以正位於虚用之中，十中又所以中立於实用之外，皆所以为一阴一阳之中道也。 由阴阳中既复有阴阳，此体用中所以复有体用虚实，实虚始终，终始变化，生成相与为元所终穷者也。 又况五其五，而二十有五，亦天数也。 六其五，五其六，三其十，而十其三，而三十，亦地数也。 一且九，二且八，三且七，而四且六之各十，与本数虚用之十，以之伍其什，什其五，斯则大衍之数五十矣。",
      "translated_text": "Is this not the most refined, most mutable, and most numinous? Moreover, the *Yi* unifies its three lines to thereby generate the eight trigrams; doubling its three lines, it thereby interweaves them to form the sixty-four hexagrams. As for the formation of hexagram lines, they are limited to six. Yet in *Qian* alone, its three lines culminate in what is called nine—why is this? Generally, in the configuration of hexagram lines as illustrated, five serves as the center; only with nine does the center emerge, for the center resides beyond the five that is already centered. The sixth line as the uppermost line is but the surplus of the hexagram’s qi. The generative numbers having reached their end, the completive numbers begin their course—this is how the nine and six lodge their emptiness and fullness. *Kun* arises from the completive number six and is full; *Qian* culminates in the completive number nine and is empty. Six marks the beginning of *Kun*’s completive numbers, appended to its position in the diagram, thereby lodging *Qian*’s nine. Nine marks the end of *Qian*’s completive numbers, appended to its position in the hexagram, thereby aligning with *Kun*’s six. The six, residing at the extreme of the retreating numbers, advances to occupy the position before the center of *Kan*; the nine, residing at the extreme of the advancing numbers, retreats to attach itself behind the radiance of *Li*. Thus, the six in the hexagram still has a position, while the nine in the hexagram has no position and instead lodges its position within the six. Their alternation as nine and six—nine being empty and six being full—thereby jointly manifests their substance and function.\n\nFurthermore, *Qian* is old yang, *Kun* is old yin—they are called father and mother. Lesser yin and lesser yang are called the six sons and daughters. The numbers of lesser yin and lesser yang are seven and eight. *Qian*’s primal power employs nine; *Kun*’s primal power employs six. Together, the sixty-four hexagrams originally possess seven and eight, yet only nine and six are present. The sons and daughters are likewise transformed by their parents and thereby undergo transformation themselves. All things are born of the mother, yet none can name the virtue or power of the father within them—thus *Kun* is still seen in the form of six lines, while *Qian*’s nine possesses its ninefold function yet none can fathom the origin of its form. This is why the *Yi* is numinous without fixed direction and without fixed form.\n\nHeaven’s one combines with heaven’s five to make six; earth’s two combines with earth’s four to make six. Five and six occupy the position of mutual generation and completion within the ten numbers. In the system of *na jia*, *wu* and *ji* serve as the center; *wu* is lodged in the center of *Kan*, and *ji* is lodged in the center of *Li*. *Wu* and *ji* are precisely five and six, placed within the centers of *Kan* and *Li* to reveal their mutual centrality. Six combines two and four as the beginning of earth’s completive numbers, appearing in the hexagram *Kun* as: “Dragons battle in the wild,” which is to battle *Qian*. Suspected of being yang yet resented as excessive yang, it reveals yin’s dependence on yang—thus its Dao is exhausted. *Kun*’s use of six does not exceed: “Favorable to perpetually uphold correctness.” Heaven’s numbers—one, five, and nine—are what is called the beginning, middle, and end; nine is the completion of heaven’s numbers, appearing in the hexagram *Qian* as: “The exalted dragon has regret.” Fullness cannot endure and cannot serve as the beginning; yet *Qian*’s use of nine governs all under heaven and reveals the celestial principle—this is its ceaseless vigor, which depends on nothing from yin. One and nine combine to form *Qian*, making their number ten, yet ten is lodged beyond heaven’s nine, where its function is inexhaustible.\n\nThe Dao of earth has no completion, yet succession has an end—this, too, lies herein. This is a general discussion of the nine and six, which may be pondered in the mind. The arrangement of the *River Chart* was originally established for the trigrams; now it extends to the substance and function of the hexagrams as well. The trigrams and hexagrams, without exception, consist of one yin and one yang, generated through the division and combination of odd and even numbers to produce beginnings and completions. One, two, three, and four, with five, are all generative numbers—one through four are their actual substance, while five is their empty function. Six, seven, eight, and nine, with ten, are all completive numbers—six through nine are their actual substance, while ten is their empty function. The four images lack five, the eight trigrams lack ten—this is perfectly clear. Each of the four directions possesses ten numbers, totaling forty; each of the four corners contains five numbers, totaling twenty. Twenty is four times five, with the empty function occupying half; forty is eight times five, with the actual substance encompassing the whole. Thus, the four images combine with the eight trigrams, totaling forty.\n\nFive is the substance of establishing the center and generating; ten is the function of enacting the center and completing. Moreover, five is divided among the completive numbers six, seven, eight, and nine, where yin numbers are few and yang numbers are many—yin is inherently partial, while yang is inherently correct. Five, unable to attain the center, is lodged in the partiality of the four corners; ten combines beyond the generative numbers one, two, three, and four, where yang numbers are few and yin numbers are many—yin is also partial, while yang is also correct. Ten completes the center and resides in the correctness of the four directions—thus correctness is the center, and the center is correctness. Five, as the beginning, establishes correctness within the empty function’s center; ten, as the middle, establishes the center beyond the actual function—both serve as the central Dao of one yin and one yang. Since within yin and yang there is again yin and yang, within substance and function there is again substance and function, emptiness and fullness, beginning and end—end and beginning transform, generation and completion mutually sustain one another, inexhaustibly.\n\nMoreover, five times five makes twenty-five, which is also a heavenly number. Six times five and five times six, three times ten and ten times three make thirty, which is also an earthly number. One with nine, two with eight, three with seven, and four with six—each making ten—and the ten of the original numbers’ empty function, when arranged in fives and tens, make the fifty of the *Great Expansion*.",
      "overlap_context": "blish their positions. Speaking in terms of qi: dividing yin and dividing yang, yin and yang press against one another. The *Yi*’s operation within them begins here—thus yang’s advancing generative numbers serve as yin’s retreating completive numbers, and yin’s advancing generative numbers serve as yang’s retreating completive numbers. Alternately advancing and retreating, alternately generating and completing, this ceaseless generation of the *Yi*, the Dao of one yin and one yang, knows no end.",
      "start_char": 4221,
      "end_char": 5455,
      "start_sentence": 190,
      "end_sentence": 242,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.68066954612732,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\易图通变.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "而其兆始之一，寄中之五，藏其用於元形之天，则又出乎五十、十五之外，大衍所不得而用也。 又恶知不用之用，乃所以用大衍者，以是见一阴一阳之谓道，参伍而错综之凡天地之数五十有五，所以成变化而行鬼神，有以见天下之迹，见天下之动，而知神之所为者，斯羲皇所以则河图而作《易》者也。 孔子赞《易》，谓其至精至变以至於至神。 吁，斯其至神者矣。 易图通变卷之一竟 ＃1『者终』，原作『终者』，据四库本乙正。 ＃2『至元丙戌』，四库本作『至元丙辰』，疑两说皆误。 查《中国历代纪年手册》，元顺帝至元年问，无『丙戌』和『丙辰』年，唯至正年问有『丙戌』年。 ＃3『切至』，四库本作『精切』，疑当作『精切至』为宜。 ＃4『斯文宗』，四库本作『斯文宗主』。 ＃5『但』，四库本作『特』。 ＃6『祇』，原作『祇』，据四库本改。 易图通变卷之二 临川道士雷思齐学",
      "translated_text": "Yet that initial omen of the One, lodged in the central Five, conceals its function within the primordial form of Heaven—thus it emerges beyond the fifty of the *Great Expansion* and the fifteen, beyond what the *Great Expansion* can employ. How then could one know that the function of the unused is precisely what enables the *Great Expansion* to function? From this, we perceive that what is called the Dao of one yin and one yang, interwoven through threes and fives, encompasses the fifty-five numbers of Heaven and Earth—through which transformations are accomplished and the spirits set in motion. Here lies the means to observe the traces of all under Heaven, to witness its movements, and to comprehend the workings of the divine. This is how Fuxi followed the *River Diagram* to compose the *Book of Changes*.\n\nConfucius, in his commentary on the *Changes*, spoke of its utmost refinement, utmost mutability, and utmost spirituality. Ah! This is its utmost spirituality indeed.\n\n*First Scroll of the* *Diagrams of the Changes: Penetrating Mutations* **concludes**\n\n---\n**Note on variants:**\n- *\"者終\"* originally rendered as *\"終者\"*—corrected per the *Siku* edition.\n- *\"至元丙戌\"* in the *Siku* edition reads *\"至元丙辰\"*—both appear erroneous; the *Handbook of Chinese Chronology* records no *\"丙戌\"* or *\"丙辰\"* in the *Zhiyuan* era, though *\"丙戌\"* appears in *Zhizheng*.\n- *\"切至\"* in the *Siku* edition reads *\"精切\"*—likely intended as *\"精切至\"*.\n- *\"斯文宗\"* in the *Siku* edition reads *\"斯文宗主\"*.\n- *\"但\"* in the *Siku* edition reads *\"特\"*.\n- *\"祇\"* originally rendered as *\"祇\"*—corrected per the *Siku* edition.\n\n*Second Scroll of the* *Diagrams of the Changes: Penetrating Mutations*\n*By Lei Siqi, Daoist of Linchuan*",
      "overlap_context": "nd beginning transform, generation and completion mutually sustain one another, inexhaustibly.\n\nMoreover, five times five makes twenty-five, which is also a heavenly number. Six times five and five times six, three times ten and ten times three make thirty, which is also an earthly number. One with nine, two with eight, three with seven, and four with six—each making ten—and the ten of the original numbers’ empty function, when arranged in fives and tens, make the fifty of the *Great Expansion*.",
      "start_char": 5455,
      "end_char": 5836,
      "start_sentence": 243,
      "end_sentence": 256,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.136073589324951,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\易图通变.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "河图传中天地之理，未始不有数行乎其中。 然或有余於数，不足於数。 唯其余、不足而为之中制，故虽阴阳奇耦之数，有分有合，有虚有实，有进有退，有自然互相生成之中道焉。 一阴一阳之谓道者，阴阳分一以为天地，上下合一以为乾坤，天地上下分为四方，而中元以合，乾坤阴阳合为四时，而中有可分，是同一道也。 天地以形言，则南北为经，上天下地； 而水、火、木、金之为形者，既可以图而分，故日法象莫大乎天地，广大配天地也#1。 阴阳以气论，则东西为纬，乾阳坤阴； 而冬、夏、春、秋之为气者，亦可以理而合，故日变通莫大乎四时，变通配四时也。 於斯二者，元以异也。 四方有中，中元定体，而四象八卦以之立； 四时有五，五元定着，而四时八节以之行。 孔子着《大传》，不存河图，而特存天地之数者，示其有得於数，则图在其中矣。 图之数生以天一者，成以地六； 生以地二者，成以天七； 生以天三者，成以地八； 生以地四者，成以天九，至谓天五地十之生成，则何自而求哉？ 按图索骏也。 故制五於八卦之虚中，犹可容其数； 而制十於其中，则元所容其数矣。 是知数之有生有成，而不知其所以生且成者，徒得其貌，而元以得古圣人之所以为天地立心，为生民立极者，千载可为之长太息，则古犹今也。 夫奇数皆天，耦数皆地，生以天者成以地，生以地者成以天，其为天若地，特阴阳之进退、出入，奇耦之体用，分合而已。 《说卦》曰：参天两地而倚数，观变於阴阳而立卦，发挥於刚柔而生爻。 《大传》日：参伍以变，错综其数：通其变，遂成天地之文； 极其数，遂定天下之象。 非天下之至变，孰能与於此？ 其曲尽乎至妙之用者，河图法也。 数始於一，而中於五，而终於十。 中於五者，分其四之偏； 终於十者，合其八之正。 盖一之始，其全体元余不足，不可得而用，而独得於中。 既以其一寄生於五，遂以其一寄成於十以终之，故四象有五，八卦有十，皆有数而元所定其位，以五生其偏，以十成其正，而所谓一者，遂莫知所寻，独见於五，见於十之为中者以上齐焉耳。 故尝求其所以然而莫之得，适记儿时於牧坚问见所谓八格戏者，其局不过口中加十 之文而已。 时极厌薄之，以为至鄙、至贱，未尝加之意也。 不谓年瑜七十，乃知其然。 所谓百姓日用而不知，终身由之而不知其道者，古之人岂欺我哉？ 盖今谓#2 即古之○，今之五即古文之 ，今之十犹古文之十，而画为十。 於 中，此十五之法由之以有所见矣。 况又十下画一，则土文之为中者，汰可知已，故云中土也。 其中直笔之 ，即可见南北为经，天尊地卑，天地设位； 横笔之－，则可见东西为纬，分阴分阳，阴阳成列。 从而久之则四维之偏，各得其均； 四方之正，亦随以定其气之互进互退，交相生成，‘率由五与十以立中道也。 故河图之十五，大衍之五十，皆虚有其十与五之数，以为之用，而实元其位之体也。 欲知十、五之道，所以为中，始於一，而中於五，而终於十者，十即一也，以十求一，则其一於此固亦可以目存而心得於中矣。 因参稽自拟《易》以来，其会十久之为中为土者，惟司马氏《潜虚》似为得之，然《港虚》乃以久着为基，十着为冢，而分列为五十五数以为名，则是其中者已先实之矣，非虚用也。",
      "translated_text": "Within the *River Chart* transmission lies the principle of Heaven and Earth, wherein numbers invariably operate. Yet sometimes numbers exceed, sometimes they fall short. Precisely through this excess and deficiency, a central regulation is established. Thus, though the numbers of yin and yang, odd and even, may divide or unite, be empty or full, advance or retreat, there exists within them a central Dao of natural mutual generation. That which is called \"the Dao of one yin and one yang\" divides one into Heaven and Earth, unites above and below into Qian and Kun, separates Heaven and Earth above and below into the four directions, and converges at the central origin. Qian and Kun, yin and yang, unite to form the four seasons, yet within them lies the potential for division—all is one and the same Dao.\n\nWhen speaking of Heaven and Earth in terms of form, north and south serve as the warp, with Heaven above and Earth below. The forms of water, fire, wood, and metal may be diagrammed and divided, hence it is said: \"No images surpass those of Heaven and Earth,\" for their vastness matches Heaven and Earth. When discussing yin and yang in terms of qi, east and west serve as the weft, with Qian as yang and Kun as yin. The qi of winter, summer, spring, and autumn may likewise be ordered and united, hence it is said: \"No transformations surpass those of the four seasons,\" for their mutability matches the four seasons. In these two aspects, the origin differs.\n\nThe four directions possess a center; the central origin establishes the body, upon which the Four Images and Eight Trigrams are founded. The four seasons possess the fifth; the fifth origin establishes the essence, upon which the four seasons and eight solar terms proceed. When Confucius composed the *Great Commentary*, he did not preserve the *River Chart* but specifically retained the numbers of Heaven and Earth, demonstrating that if one grasps the numbers, the Chart resides within them.\n\nThe numbers of the Chart arise with Heavenly One and are completed by Earthly Six; they arise with Earthly Two and are completed by Heavenly Seven; they arise with Heavenly Three and are completed by Earthly Eight; they arise with Earthly Four and are completed by Heavenly Nine. As for the generation and completion of Heavenly Five and Earthly Ten, from whence are they sought? It is like searching for a steed by following its tracks. Thus, structuring the five within the void of the Eight Trigrams still allows room for their numbers, but structuring the ten within it leaves no space for their numbers.\n\nTo know the generation and completion of numbers yet not comprehend their underlying principles is merely to grasp their outward appearance. Without attaining the ancient sages' intent in \"establishing the heart of Heaven and Earth\" and \"setting the ultimate standard for the people,\" one may sigh for a thousand years—such is the past as it is the present.\n\nOdd numbers all belong to Heaven; even numbers all belong to Earth. That which arises from Heaven is completed by Earth; that which arises from Earth is completed by Heaven. Their nature as Heaven and Earth lies solely in the advance and retreat of yin and yang, the function and substance of odd and even, and their division and union. The *Shuogua* states: \"Three for Heaven, two for Earth, relying on numbers; observing changes in yin and yang to establish the trigrams; expressing through firmness and softness to generate the lines.\" The *Great Commentary* says: \"Intermingling through threes and fives, interweaving their numbers; penetrating their changes, thus forming the patterns of Heaven and Earth; exhausting their numbers, thus determining the images of the world.\" If not for the supreme mutability of the world, who could partake in this? Its subtlety in fully realizing the most wondrous function lies in the method of the *River Chart*.\n\nNumbers begin with one, center on five, and conclude with ten. Centering on five divides the bias of the four; concluding with ten unites the correctness of the eight. At the beginning of one, its entire body is without excess or deficiency, and thus cannot be employed—only the center is attainable. Having entrusted its one to arise within five, it then entrusts its one to be completed within ten to conclude. Thus, the Four Images possess five, the Eight Trigrams possess ten, all having numbers yet no fixed positions. The five generates their bias; the ten completes their correctness. As for the one, it becomes untraceable, appearing only in the five and ten that serve as the center, aligning above.\n\nThus, though one may seek its underlying reason, it remains unattainable. I recall in childhood observing a herdboy playing what was called the \"eight-pattern game,\" its board nothing more than a grid with the character for ten inscribed within. At the time, I deeply despised it as utterly vulgar and base, never giving it a second thought. Who would have known that at seventy, I would come to understand its truth? That which the common people use daily yet do not comprehend, that which they follow throughout their lives yet do not recognize as the Dao—did the ancients ever deceive us?\n\nFor what is now called \"○\" was anciently \"○\"; what is now \"five\" was anciently \" \"; what is now \"ten\" was anciently \"十,\" drawn as a cross within \"○.\" From this, the method of fifteen becomes apparent. Moreover, with a single stroke beneath the ten, the centrality of Earth's pattern becomes evident—hence it is called the Central Soil. The vertical stroke of \" \" reveals north and south as the warp, Heaven's honor and Earth's humility, the positions of Heaven and Earth. The horizontal stroke of \"－\" reveals east and west as the weft, the division of yin and yang, the alignment of yin and yang. Over time, the biases of the four corners each attain balance; the correctness of the four directions likewise stabilizes their qi in mutual advance and retreat, reciprocal generation and completion, \"following the five and ten to establish the central Dao.\"\n\nThus, the fifteen of the *River Chart* and the fifty of the *Great Expansion* both possess the numbers ten and five in emptiness, employing them while their actual positions remain formless. To understand the Dao of ten and five as the center—beginning with one, centering on five, and concluding with ten—ten is one. Seeking one through ten, that one is here, visible to the eye and attainable in the heart. After extensive investigation, I have tentatively composed *Since the Yi*, wherein the convergence of ten as the center and Soil is best captured by Sima's *Hidden Depths*. Yet *Hidden Depths* takes the nine as its foundation and the ten as its apex, arranging them into fifty-five numbers as names—thus, its center is already substantiated, not employed in emptiness.",
      "overlap_context": "ads *\"至元丙辰\"*—both appear erroneous; the *Handbook of Chinese Chronology* records no *\"丙戌\"* or *\"丙辰\"* in the *Zhiyuan* era, though *\"丙戌\"* appears in *Zhizheng*.\n- *\"切至\"* in the *Siku* edition reads *\"精切\"*—likely intended as *\"精切至\"*.\n- *\"斯文宗\"* in the *Siku* edition reads *\"斯文宗主\"*.\n- *\"但\"* in the *Siku* edition reads *\"特\"*.\n- *\"祇\"* originally rendered as *\"祇\"*—corrected per the *Siku* edition.\n\n*Second Scroll of the* *Diagrams of the Changes: Penetrating Mutations*\n*By Lei Siqi, Daoist of Linchuan*",
      "start_char": 5836,
      "end_char": 7103,
      "start_sentence": 257,
      "end_sentence": 301,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.534955739974976,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\易图通变.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "与河图虚五寄十之理，自不相入也。 河图之数，虽五十有五，而其实体之数正只四十，所余十有五，特虚以用於四十之中，不过通为之数，而实非有体位者也。 ＇ 其曰参、日两、日参五者，通其数之所变以用也。 参也者，一二之所以变也。 由一自分其一以为二，起自为之对，则见其二而不见其一矣。 其一又自参出於二之中，故三也。 於参之法是即为一小成，是三画之立见人参於天地之中以生也。 积三小成，参其三而合於乾元用九，是参之始制，即阳奇之所谓天者所由然也。 两也者，由一生二，起而对，并以立，既以象两仪，因之两其二以象四象。 夫一本自一而二，而参，其一以为三，况二本一之对，岂不得二其三#3而反对之乎？ 故汰而三其二以成六，即合於坤元用六，是又两之始制，兼三才而两之，故六因之六画成卦，六位成章，即阴耦之所#4谓地者亦由以然也。 由是参其两二，而交久以合之，是伍也。 两其二伍，则又什矣。 十特见於参、九之外，则又一之所由以寄者也。 何以明之？ 参之，两之，而伍而什之，皆人文之为。 而自然与天地合者，参文之血斗，两文之雨仄，至维伍维什，皆立人於维中维旁者，斯可默识古人立心立极之制，有在於是矣。 必参其三三，两其三二，是参两之一小成矣。 故必又参其三三，而参之为参天； 两其三二，而两之为两地，是天地之数元汰而合且分矣。 乃以其初不入於用之一数，寄於十以行其中，而为之分且合，以成其中制者，是一也。 而求於图之数，如环元端，其一莫见何在，而所见惟十尔。 夫参其三三，与两其三二，合而为大。 参两，斯有以见天地浑成一始终者所以然矣。 至所谓参伍错综，则未究也。 其谓之参伍错综者，五以前之数少於五，元所用伍； 五以后之数多於五，故参以五。 伍於其中，错且综之，而行其制中之法也。 然《大传》於参伍以变，错综其数，亦必谓通其变，然后能成天地之文； 极其数，然后能定天下之象，则知其未易知也。 然既教以参五错综，则安得不研求其所以然哉。 因参稽自击《易》以来，已几二千年矣，学者元探索及之者，至於龙图续始亦元发明，深切异之。 心港力索，极深研几，适然省悟，元元它事也。 《大传》日：天数五，地数五，五位相得而各有合。 即图之数矣。 天一起於坎，地六附於坤，是一六之合，综之则七也。 参以天五错伍於中，并列而求之，其首尾各一也。 故坎之一数为阳，立极於北方之始； 而乾之六数为阴，附於西北之维也。 天三出於震，地八附於艮，是三八之合，综之则十有一也。 参以天五错伍於中，并列而求之，其首尾各三也。 故震之三数为阳，立於束方之正； 而艮之八数为阴，而附束北之维也。 是二者，先阳后阴。 地二分於西南，为坤； 天七列於西，为兑，是二七之合，综之则九也。 参以天五错伍於中，并列而求之，其首尾各二也。 坤之二数为阴，先处於西南之维； 而兑之七数为阳，始立於西方之正也。 地四偏於巽，天九正於离，是四九之。 ，综之而十有三也。 参以天五错伍於中，并列而求之，其首尾各四也。 巽之四数为阴，退守束南之维； 离之九数为阳，正南面而立於极位也。 是二者，先阴后阳。",
      "translated_text": "The principle of the *River Chart*’s empty five and lodged ten does not align with this. Though the *River Chart*’s numbers total fifty-five, its actual substantive count is precisely forty, with the remaining fifteen existing in emptiness to operate within the forty—merely serving as a general tally, not possessing any substantive position. The terms \"three,\" \"two,\" and \"three-five\" refer to the application of their numerical transformations. \"Three\" arises from the variation of one and two. From one, one divides itself to become two, initiating mutual opposition, so that two is seen while one is not. That one then emerges from within two as three. In the method of three, this constitutes a minor completion, where the three lines stand as humanity’s participation between heaven and earth to generate life. Accumulating three minor completions, tripling the three to unite with Qian’s \"nine in use,\" marks the inception of three—precisely what the yang odd numbers of heaven originally signify.\n\n\"Two\" arises from one generating two, rising in opposition to stand in parallel, thus symbolizing the Two Modes. From this, two is doubled to represent the Four Images. If one originally becomes two and then three, with one forming three, how could two—itself an opposition of one—not double its three to form a counter-opposition? Thus, refining it by tripling its two yields six, uniting with Kun’s \"six in use.\" This is the inception of two, doubling the Three Powers, so that six lines form a hexagram, six positions compose a pattern—just as the yin pairs of earth originally signify.\n\nFrom this, tripling the two twos and intersecting the nine to unite them forms five. Doubling the two fives yields ten. Ten appears beyond the three and nine, serving as the lodging place of one. How is this clarified? The tripling, doubling, quintupling, and decupling are all human constructs, yet what naturally harmonizes with heaven and earth lies in the blood-grain of the three lines and the rain-tilt of the two lines. Even in the \"five-maintained\" and \"ten-maintained,\" humanity stands at the center or beside the weft—here, one may silently recognize the ancient establishment of mind and pole, which resides in this.\n\nOne must triple the three threes and double the three twos—this is the minor completion of three and two. Thus, tripling the three threes forms the three of heaven, and doubling the three twos forms the two of earth. The numbers of heaven and earth are thereby refined, united, and divided. Yet that initial number not entering into use is lodged in ten to operate at its center, dividing and uniting to complete its central system—this is one. Seeking it in the chart’s numbers, like a ring without end, that one remains unseen, while only ten is visible. Tripling the three threes and doubling the three twos, united in grandeur, reveals how heaven and earth merge into a single beginning and end.\n\nAs for the so-called \"three-five interweaving,\" it remains unexplored. \"Three-five interweaving\" refers to numbers before five being fewer than five, thus using five as the base; numbers after five being greater than five, thus tripling with five. Within this, five is interwoven and interlaced to enact the method of central regulation. Yet the *Great Commentary* states that only by \"permeating their transformations through three and five, interweaving their numbers,\" can one \"complete the patterns of heaven and earth\" and \"determine the images of the world.\" This is not easily understood. Since it instructs with \"three-five interweaving,\" how can one not investigate its underlying principle?\n\nAfter examining works since the *Changes* was first devised—nearly two thousand years—scholars have scarcely probed this. Even the *Dragon Chart*’s continuation offers no elucidation, which is deeply perplexing. Through painstaking effort and profound inquiry, I suddenly awakened to the realization that it concerns nothing else. The *Great Commentary* says: \"The heavenly numbers are five, the earthly numbers are five; the five positions interact and each has its union.\" This is the chart’s numbers. Heaven-one begins at Kan, earth-six attaches to Kun—the union of one and six, summed, is seven. Tripling the heavenly five and interweaving five within, aligning them for examination, their heads and tails are each one. Thus, Kan’s one is yang, establishing the pole at the northern inception; Qian’s six is yin, attaching to the northwest weft.\n\nHeaven-three emerges from Zhen, earth-eight attaches to Gen—the union of three and eight, summed, is eleven. Tripling the heavenly five and interweaving five within, aligning them for examination, their heads and tails are each three. Thus, Zhen’s three is yang, standing at the eastern center; Gen’s eight is yin, attaching to the northeast weft. These two proceed from yang to yin. Earth-two divides in the southwest as Kun; heaven-seven aligns in the west as Dui—the union of two and seven, summed, is nine. Tripling the heavenly five and interweaving five within, aligning them for examination, their heads and tails are each two. Kun’s two is yin, first residing at the southwest weft; Dui’s seven is yang, newly standing at the western center.\n\nEarth-four spreads to Xun, heaven-nine centers at Li—the union of four and nine, summed, is thirteen. Tripling the heavenly five and interweaving five within, aligning them for examination, their heads and tails are each four. Xun’s four is yin, retreating to guard the southeast weft; Li’s nine is yang, facing south to stand at the polar position. These two proceed from yin to yang.",
      "overlap_context": "ive, and concluding with ten—ten is one. Seeking one through ten, that one is here, visible to the eye and attainable in the heart. After extensive investigation, I have tentatively composed *Since the Yi*, wherein the convergence of ten as the center and Soil is best captured by Sima's *Hidden Depths*. Yet *Hidden Depths* takes the nine as its foundation and the ten as its apex, arranging them into fifty-five numbers as names—thus, its center is already substantiated, not employed in emptiness.",
      "start_char": 7103,
      "end_char": 8328,
      "start_sentence": 302,
      "end_sentence": 357,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.913840532302856,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\易图通变.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "由是知乾、兑、艮、离之所以六、七、八、九，即坎、坤、震、巽之一、一不三、四也。 故阳得五而阴，阴得五而阳； 耦得五而奇，奇得五而耦。 乾之六，乃一五而六也； 兑之七，乃二五而七也； 艮之八，乃三五而八也； 离之九，乃四五而九也。 又由是知参伍以变，参乾、坎，参艮、震，自北而束； 参兑、坤，参离、巽，自西而南。 参而分，伍而合，是谓参伍以变。 错而分之，见其参； 综而合之，见其位，是谓错综其数。 而错综者，即参伍也。 散而错之，如一、二、三、四之重； 分敛而综之，乃六、七、八、九之复合也，是谓五位相得而各有合，岂尝如后世别置五虚点於图心，而实谓天五哉？ 故由是知河图之数纵横顺逆，莫匪#5自然而然，不待人为牵合傅会以使然也。 其进数之升，自北束极乎南； 退数之降，自南西终极乎北，皆阳数行而阴自随之。 若阴数之进，则自坤二而巽四，退则自艮八而乾六，然阴不过奉阳而已，虽万变亦一阴一阳而已尔。 是故伍坎一以为乾六於北，伍坤二以为兑七於西，伍震三以为艮八於束，伍巽四以为离九於南，则见制数之元自参伍矣。 於是又损震后之一以退，益艮之全八而九，三而三之，始参之制也。 析震中前之二以合巽之全，四分而六，则两之继始也。 惟离之全数自得於九，且当始终之中，三而三之，中参之制也。 兼坤之全二，以贯兑中前之四合而六，则两之代终也。 绝兑后之三，以补乾之全六，三而．三之，终参之制也。 是则参天两地之纲领，於此亦可见。 或错而分，综而合，参之两之，参两之制，亦必伍也。 是则参伍之大通变、大极#6数者也。 孔子之谓通其变，成天地之文； 极其数，定天下之象。 非天下之至精之至变之至神，孰能与於此。 诚哉言也。 故夫参天者成象谓乾，於是参阳数之三三，以统乾元用九，而参中有两，阳中见阴； 两地者效法谓坤，於是两阴数之二二，效法於乾，遂参其二而六之，以会坤元用六，而两中用参，阴中见阳，以是见一阴一阳，变而通之於天地之问，所以必参两也。 参之，两之，所以必九六也。 且太极而两仪，所以四象而八卦，不过生数之一、二、三、四，成数之六、七、八、九而已。 至於五与十，虽有其数，特存虚用，未尝列於卦象之实体者也。 盖自一分一而二，一二而三，一三而四，是四象立矣。 四象元五也，天五特虚中而元体，然一四而五，二三亦五，是两伍矣。 具以本数之天五，又参伍矣。 况一、二、三、四自然总而十数，中以天五，参伍而十五也。 天数之一、三、五则九，地数之一不四则六，而一五亦六也。 一六而七，二五亦七也。 一七而八，三五亦八也。 一八而九，四五亦九也。 则八卦成列矣。 一九则十，一、二、三、四自然亦十也。 八卦则元自而十也，十故元所容其体，以一用其一不三、四，则其十亦特九也。 十之为九，乃所以复归于一，是十即一也。 河图之数，四方各十，故坎一与离九相对而十，中虚天五之用而十五； 坤二与艮八相对而十，中虚天五之用而十五； 震三与兑七相对而十，中虚天五之用而十五； 巽四与乾六相对而十，中虚天五之用而十五，以是知天五与地十皆元其体与位之正，特虚用其数，以相久十而什伍也。",
      "translated_text": "Thus we understand why Qian, Dui, Gen, and Li correspond to six, seven, eight, and nine—precisely the one, two-not-three, and four of Kan, Kun, Zhen, and Xun. Therefore, yang attains five and becomes yin; yin attains five and becomes yang. Even numbers attain five and become odd; odd numbers attain five and become even. Qian’s six is one-five-and-six; Dui’s seven is two-five-and-seven; Gen’s eight is three-five-and-eight; Li’s nine is four-five-and-nine.\n\nFrom this we further understand the transformations of tripling and quintupling: tripling Qian and Kan, tripling Gen and Zhen, from north to east; tripling Dui and Kun, tripling Li and Xun, from west to south. Tripling to divide, quintupling to unite—this is called \"tripling and quintupling to transform.\" Interlacing to divide reveals their tripling; summing to unite reveals their positions—this is called \"interlacing and summing their numbers.\" And what is interlaced and summed is precisely the tripling and quintupling. Scattered and interlaced, they resemble the doubling of one, two, three, four; divided and gathered to sum them, they return to the recombination of six, seven, eight, nine. This is called \"the five positions mutually attaining and each having its union\"—how could it ever be like later generations arbitrarily placing five empty points at the center of the diagram and claiming this to be the heavenly five? Thus we understand that the numbers of the River Diagram, whether vertical or horizontal, forward or reverse, are none other than the natural unfolding of the five, not requiring artificial contrivance or forced interpretation to make them so.\n\nThe ascending progression of advancing numbers begins at the northern and eastern extremes and reaches the south; the descending regression of retreating numbers begins at the southern and western termini and returns to the north—all follow the movement of yang numbers, with yin naturally following. As for the progression of yin numbers, it moves from Kun’s two to Xun’s four; its regression moves from Gen’s eight to Qian’s six. Yet yin does no more than serve yang—though myriad transformations occur, it is merely the alternation of one yin and one yang.\n\nThus, quintupling Kan’s one produces Qian’s six in the north; quintupling Kun’s two produces Dui’s seven in the west; quintupling Zhen’s three produces Gen’s eight in the east; quintupling Xun’s four produces Li’s nine in the south—here we see the origin of numerical regulation in tripling and quintupling. Then, reducing Zhen’s latter one to regress, augmenting Gen’s full eight to nine, and tripling the three, we have the initial regulation of tripling. Dividing Zhen’s middle two to unite with Xun’s full four, splitting into six, we have the continuation of the two. Only Li’s full number naturally attains nine, standing at the center of beginning and end, tripling the three—this is the central regulation of tripling. Combining Kun’s full two with the four at Dui’s middle to unite as six, we have the alternation of the two at the end. Severing Dui’s latter three to supplement Qian’s full six, tripling the three—this is the final regulation of tripling. Herein lie the essential principles of \"tripling heaven and doubling earth.\"\n\nWhether interlaced to divide or summed to unite, whether tripling or doubling, the regulation of tripling and doubling must also involve quintupling. This is the great universal transformation and the supreme numerical principle of tripling and quintupling. Confucius spoke of \"penetrating its transformations to complete the patterns of heaven and earth; exhausting its numbers to determine the images of the world.\" Who but one of utmost precision, utmost transformation, and utmost spirit could partake in this? Truly his words are so.\n\nThus, \"tripling heaven\" completes the image, referring to Qian. Here, the three threes of yang numbers govern Qian’s primal use of nine, wherein tripling contains doubling, and yang reveals yin. \"Doubling earth\" emulates the model, referring to Kun. Here, the two twos of yin numbers emulate Qian, thus tripling its two to six, uniting Kun’s primal use of six, wherein doubling employs tripling, and yin reveals yang. From this we see how one yin and one yang, transformed and penetrated throughout heaven and earth, necessarily involve tripling and doubling. Tripling and doubling necessarily involve nine and six.\n\nMoreover, from the Supreme Ultimate come the Two Modes; from the Two Modes come the Four Images; from the Four Images come the Eight Trigrams—nothing more than the generating numbers one, two, three, four and the completing numbers six, seven, eight, nine. As for five and ten, though they exist as numbers, they serve only as virtual functions and are never listed among the substantial forms of the trigrams. For from one divided comes two; from one and two comes three; from one and three comes four—thus the Four Images are established. The Four Images originate from five; the heavenly five is merely the virtual center without substance. Yet one and four make five; two and three also make five—thus two quintuplets. Combined with the original heavenly five, they are further tripled and quintupled. Moreover, one, two, three, four naturally sum to ten, with the heavenly five at the center—tripled and quintupled to fifteen.\n\nThe heavenly numbers one, three, five sum to nine; the earthly numbers two and four sum to six, and one and five also make six. One and six make seven; two and five also make seven. One and seven make eight; three and five also make eight. One and eight make nine; four and five also make nine—thus the Eight Trigrams are arrayed. One and nine make ten; one, two, three, four naturally also make ten. The Eight Trigrams inherently lack ten, for ten has no place to contain its form. Using one, two, three, four, its ten is merely nine. Ten as nine is the return to one—thus ten is one.\n\nThe numbers of the River Diagram, ten in each of the four directions, show Kan’s one and Li’s nine opposing to make ten, with the virtual function of the central heavenly five making fifteen; Kun’s two and Gen’s eight opposing to make ten, with the virtual function of the central heavenly five making fifteen; Zhen’s three and Dui’s seven opposing to make ten, with the virtual function of the central heavenly five making fifteen; Xun’s four and Qian’s six opposing to make ten, with the virtual function of the central heavenly five making fifteen. From this we know that the heavenly five and earthly ten, though lacking substantial form and position, virtually employ their numbers to perpetually interweave and quintuple.",
      "overlap_context": "un’s two is yin, first residing at the southwest weft; Dui’s seven is yang, newly standing at the western center.\n\nEarth-four spreads to Xun, heaven-nine centers at Li—the union of four and nine, summed, is thirteen. Tripling the heavenly five and interweaving five within, aligning them for examination, their heads and tails are each four. Xun’s four is yin, retreating to guard the southeast weft; Li’s nine is yang, facing south to stand at the polar position. These two proceed from yin to yang.",
      "start_char": 8328,
      "end_char": 9548,
      "start_sentence": 358,
      "end_sentence": 410,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.731001377105713,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\易图通变.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "斯所以参伍也，参伍所以参两也，故河图之数正实四十，而以天五地十之虚数通用之以计，凡天地之数五十有五者也。 七为少阳，八为少阴，其合固成十五，然其生数不备，不能变。 九为老阳，六为老阴，其合亦虽只十五，而生数之一、三、五而九，二、四而六，故六之变则九，九之变则六，此通重《易》之爻不见七八，而元非九六，而参伍以变，参天两地，莫非是也。 四方之数各十，合参其九而二十有七，两其六而十有二，总之则三十有九，而特遗其一，则其一将何所用乎？ 故以其一存诸十，则四十矣。 故坎之立极於一，敛其十以自归，以建大中，以生生数之始，以成成数之终。 退藏於密，而莫之究极，见於参天两地倚数之一以为十，则所谓中也。 中也者，合数之所不得其中者，而使之交合于中，所以中其不中者也。 由坎北之一始制于中，二效之而分兑西之七以为中，三效之而分震束之三以为中，四效之而分离南之九以为中，凡中皆立於十，皆以数合於十而中分之者，盖以寄其一云尔。 惟坎之一，独元所可用，特立於中而以元用之用而用，有用之用则中之用，不既大矣哉。 故坎之一，虽不在参两参五之用，而用之以制参天两地参伍之制焉。 故参天不自坎而自艮始也。 参亦非它，即前所谓一二之变也。 一自分其一以为一，起而相对，则见其二，而不见一； 其一又自参出於二之中，故曰参也。 此参制之一小成，然参两参伍，莫不於是焉起，斯故示其参之凡也。 易图通变卷之二竟 #1『也』，原脱，据四库本补。 #2『谓』，四库本作『之』。 #3『二其三』，四库本作『三其二』。 #4『所』，据其上文义例补。 #5『莫匪』，四库本作『莫非』。 #6『大极』，四库本作『太极』。 易图通变卷之三 临川道士雷思齐学",
      "translated_text": "Thus is the method of interweaving and quintupling. Interweaving and quintupling serve to interlace the two—hence the numbers of the River Diagram are precisely forty in substance, yet through the virtual numbers of heavenly five and earthly ten they are universally applied in calculation, totaling fifty-five for all the numbers of heaven and earth.\n\nSeven is young yang, eight is young yin; their union indeed makes fifteen, yet their generative numbers are incomplete and incapable of transformation. Nine is old yang, six is old yin; their union likewise makes only fifteen, yet the generative numbers—one, three, five forming nine, and two, four forming six—allow six to transform into nine, and nine into six. This is why the hexagrams of the *Zhouyi* exclude seven and eight, fundamentally relying on nine and six. Through interweaving and quintupling, through the three of heaven and the two of earth, all transformations arise from this.\n\nThe numbers of the four directions each total ten; combining their nines yields twenty-seven, doubling their sixes yields twelve, and summing these gives thirty-nine—yet one is deliberately omitted. Where then is this one employed? Thus, by preserving this one within the ten, forty is achieved.\n\nTherefore, Kan establishes its axis at one, gathering its ten to return to itself, thereby erecting the Great Center and initiating the generative numbers while completing the fulfilled numbers. Withdrawn and concealed in secrecy, its ultimate depth remains unfathomed. Manifest in the one of the three of heaven and the two of earth, which is reckoned as ten, this is what is called the Center. The Center is where the union of numbers cannot attain their mean, yet causes them to intersect at the center—thus centering what is not centered.\n\nFrom Kan’s northern one, the center is first established; the second emulates this by dividing Dui’s western seven to form a center; the third emulates it by dividing Zhen’s eastern three to form a center; the fourth emulates it by dividing Li’s southern nine to form a center. Every center is established at ten, all through the union of numbers at ten and their bisection—this is merely to lodge the one within. Only Kan’s one, uniquely without employable function, is singularly established at the center, its function being the function of non-function. The function of having function is the function of the Center—is this not supremely great?\n\nThus, though Kan’s one does not participate in the functions of the three, the two, or the five, it is employed to regulate the system of the three of heaven, the two of earth, and the interweaving and quintupling. Therefore, the three of heaven does not begin with Kan but with Gen.\n\nThe three is nothing other than the transformation of one and two previously described. When one divides itself to become one, arising in opposition, two appears while one is no longer seen. This one further interweaves from within the two—hence it is called the three. This is the minor completion of the threefold regulation. Yet all interlacing of the two, the three, and the five originates here—thus is demonstrated the general principle of the three.\n\n*Yitu Tongbian*, Scroll Two, concludes.\n\n*Yitu Tongbian*, Scroll Three\nBy Linchuan Daoist Lei Siqi",
      "overlap_context": "to make ten, with the virtual function of the central heavenly five making fifteen; Zhen’s three and Dui’s seven opposing to make ten, with the virtual function of the central heavenly five making fifteen; Xun’s four and Qian’s six opposing to make ten, with the virtual function of the central heavenly five making fifteen. From this we know that the heavenly five and earthly ten, though lacking substantial form and position, virtually employ their numbers to perpetually interweave and quintuple.",
      "start_char": 9548,
      "end_char": 10261,
      "start_sentence": 411,
      "end_sentence": 435,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.002118587493896,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\易图通变.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "河图传下 道家以日月为易，始蹈常袭故，未始谓然，卒究於《大传》则未始不然。 日：乾、坤，其《易》之蕴邪？ 乾、坤成列，而《易》立乎其中矣。 乾、坤毁，则元以见《易》。 《易》不可见，则乾、坤或几乎息矣。 是犹未识所见之《易》为何物也。 则又日：乾、坤，其《易》之门邪？ 乾，阳物也； 坤，阴物也。 阴阳合德，而刚柔有体，□以体天地之撰，以通神明之德。 是《易》之为物有体可以见矣。 则又日：辟户谓之乾，阖户谓之坤，一阖一辟谓之变，往来不穷谓之通。 见乃谓之象，形乃谓之器，制而用之谓之法，利用出入、民咸用之谓之神。 是《易》之谓体者，又见其有用矣。 故曰：天地设位，而《易》行乎其中矣。 日：法象莫大乎天地，变通莫大乎四时，县象着明莫大乎日月。 曰：广大配天地，变通配四时，阴阳之义配日月。 凡是数端，莫不举日月以征，则信其为易也完矣。 夫《易》与天地准，能弥纶天地之道，仰观象於天，俯观法於地，则成象谓乾者日也，效法谓坤者月也。 日象离数，极乎九； 月象坎数，始乎一。 凡九必对六，今云一者，一合天五为六，坎一乾六为水生成，所以为月者也。 且天地乃乾坤之体，乾坤乃天地之用，惟天地定位，而上下气形有不易之分，故乾坤成列，而阴阳体用有变易之数。 天地有常体，而莫见其用； 阴阳有常用，而莫究其体，惟日月之体用兼着，故特着其义以配阴阳云尔。 且明教以范围天地而不过，曲成万物而不遗者，特通乎昼夜之道而知也。 夫昼夜之道，岂难知哉？ 百姓日甩而不知尔。 请略举其凡：乾，阳物者，日其类也； 坤，阴物者，月其类也。 阴阳成列而合德者，四时合序，日月合明，亦类也．。 辟户谓乾，近则日之出旦，月之上弦； 远则春之日夜分而谓启也。 阖户谓坤，近则日之入夕，月之下弦； 远则秋之日夜分而谓闭也。 仰观其成象，则日之昼，月之望．’夏之景长； 而至俯察其效法，则夜之分，月之朔，冬之景短而至也。 是以日往则月来，月往则日来，日月相推而明生焉。 寒往则暑来，暑往则寒来，寒暑相推而成岁焉。 变化者，进退之象也； 刚柔者，昼夜之象也。 日月运行，一寒一暑故日：天地之道，贞观者也； 日月之道，贞明者也； 、天下之动，贞夫一者也。 贞夫一也者，四时分至之中皆一也。 而此特谓天下之动贞夫一，则正由坎之一也。 一日之阳气初动於夜分之际，固谓贞夫一也。 一年之阳，气复动於冬朔之始，尤见其贞夫一者也。 坎之数一，离之数九，坎、离以一、九为乾。 离为日，坎为月，日月必合於月之初一为朔。 而日不云朔，月乃云朔； 南不云朔，北乃云朔。 夫朔逆度也，逆与日会，故谓之朔。 ．以朔文观之，明着月之逆度者也。 《说卦》日：《易》，逆数也。 《书》亦日：平在朔。 《易》理实同也。 由是以进乎日月之为易，其县象得不谓着明矣乎？ 故月之三五而盈，少阴、阳之七、八； 三五而阙，老阴阳之九、六。 总之，以地数三十而月尽，又河图法也。 周天三百六十五度四分度之一，日每行一度，冬南、夏北为寒暑之中极，月行每十有三度而奇，与日之合者十有二朔，而岁常以备六阴六阳十有二月，天地节而四时成，是月之运行劳亦甚矣。",
      "translated_text": "The *Hetu* was transmitted downward. Daoists take the sun and moon as the Changes, initially treading the well-worn path of convention—yet not entirely so. Upon thorough investigation of the *Great Commentary*, however, it proves not entirely otherwise.\n\nIt is said: Qian and Kun—are they the hidden essence of the *Changes*? When Qian and Kun take their places, the *Changes* is established between them. If Qian and Kun were destroyed, the primordial would reveal the *Changes*. If the *Changes* were not visible, Qian and Kun would nearly cease to be. Yet this still does not clarify what the visible *Changes* truly is.\n\nThus it is further said: Qian and Kun—are they the gates of the *Changes*? Qian is the yang entity; Kun, the yin entity. Yin and yang unite their powers, and hardness and softness take form, □ thereby embodying the compositions of heaven and earth and penetrating the virtue/power of the numinous. Here, the *Changes* as a thing has a form that can be seen.\n\nIt is further said: Opening the door is called Qian; closing the door, Kun. One closing and one opening is called change; ceaseless coming and going, penetration. What is seen is called image; what takes shape is called vessel. To regulate and employ it is called method; its beneficial use in ingress and egress, universally employed by the people, is called the numinous. Here, the *Changes* as form is seen to have its use.\n\nTherefore it is said: Heaven and earth take their positions, and the *Changes* operates between them. It is said: No image is greater than heaven and earth; no transformation is greater than the four seasons; no suspended image is more luminous than the sun and moon. It is said: Vastness matches heaven and earth; transformation matches the four seasons; the principles of yin and yang match the sun and moon. In all these instances, the sun and moon are invoked as proof—thus the *Changes* is confirmed as complete.\n\nThe *Changes* aligns with heaven and earth, capable of encompassing the Dao/Way of heaven and earth. Gazing upward to observe the images in heaven and downward to observe the patterns on earth, the image-forming is called Qian, which is the sun; the pattern-imitating is called Kun, which is the moon. The sun’s image corresponds to the number of Li, culminating in nine; the moon’s image corresponds to the number of Kan, beginning with one. Every nine must pair with six, but here it speaks of one—one combines with heaven’s five to make six, Kan’s one and Qian’s six form the generation and completion of water, which is the moon’s essence. Moreover, heaven and earth are the forms of Qian and Kun, while Qian and Kun are the functions of heaven and earth. Only when heaven and earth are fixed in position do the qi and shapes of above and below have their unchanging divisions. Thus, when Qian and Kun take their places, the numbers of yin-yang form and function undergo transformation. Heaven and earth have constant forms yet do not reveal their functions; yin and yang have constant functions yet do not exhaust their forms. Only the sun and moon fully manifest both form and function—hence their principles are particularly highlighted to pair with yin and yang.\n\nMoreover, the teachings that model heaven and earth without transgression and complete the myriad things without omission specifically penetrate the Dao/Way of day and night. Is the Dao/Way of day and night difficult to know? The common people use it daily yet remain unaware. Let us briefly outline its general principles:\n\nQian, the yang entity, has the sun as its kind; Kun, the yin entity, has the moon as its kind. When yin and yang take their places and unite their powers, the four seasons align in order, the sun and moon unite in brightness—these too are kinds. Opening the door as Qian: proximately, the sun’s dawn and the moon’s first quarter; distantly, the spring equinox when day and night divide, called \"opening.\" Closing the door as Kun: proximately, the sun’s dusk and the moon’s last quarter; distantly, the autumn equinox when day and night divide, called \"closing.\" Gazing upward to observe their formed images: the sun’s day, the moon’s fullness, summer’s long daylight. Looking downward to examine their imitated patterns: night’s division, the moon’s new moon, winter’s short daylight.\n\nThus, when the sun departs, the moon arrives; when the moon departs, the sun arrives—the sun and moon mutually advance, and brightness is born. When cold departs, heat arrives; when heat departs, cold arrives—cold and heat mutually advance, and the year is completed. Change is the image of advance and retreat; hardness and softness are the images of day and night. The sun and moon’s movements, one cold and one hot—thus it is said: The Dao/Way of heaven and earth is steadfast in observation; the Dao/Way of the sun and moon is steadfast in brightness. The movements of all under heaven are steadfast in the One.\n\nSteadfast in the One: the centers of the solstices and equinoxes are all One. Yet this specifically refers to the movements of all under heaven being steadfast in the One, which precisely arises from Kan’s one. The yang qi first stirs at the midnight division—this is truly steadfast in the One. The yang qi of the year revives at the winter solstice’s beginning—here its steadfastness in the One is even more evident. Kan’s number is one; Li’s number is nine. Kan and Li take one and nine as Qian. Li is the sun; Kan is the moon. The sun and moon must unite at the moon’s first day, the new moon. Yet the sun is not called \"new moon\"; only the moon is called \"new moon.\" The south is not called \"new moon\"; only the north is called \"new moon.\" The new moon moves in reverse; reversing to meet the sun, it is called \"new moon.\" Observing the new moon’s pattern reveals the moon’s reverse movement. The *Shuogua* says: The *Changes* is reckoned in reverse. The *Book [of Documents]* also says: Level at the new moon. The principles of the *Changes* are indeed the same.\n\nProceeding from this to the *Changes* as the sun and moon—could their suspended images not be called luminously manifest? Thus, the moon waxes to fullness in three and five, the lesser yin and yang of seven and eight; it wanes in three and five, the elder yin and yang of nine and six. In sum, the earth number thirty completes the month—another method of the *Hetu*. The celestial circuit is 365¼ degrees; the sun moves one degree daily. The winter south and summer north mark the central extremes of cold and heat. The moon moves slightly more than thirteen degrees daily, meeting the sun twelve times in conjunctions—thus the year regularly comprises six yin and six yang months, twelve in total. Heaven and earth are regulated, and the four seasons are completed. The moon’s movements are indeed laborious.",
      "overlap_context": "e and two previously described. When one divides itself to become one, arising in opposition, two appears while one is no longer seen. This one further interweaves from within the two—hence it is called the three. This is the minor completion of the threefold regulation. Yet all interlacing of the two, the three, and the five originates here—thus is demonstrated the general principle of the three.\n\n*Yitu Tongbian*, Scroll Two, concludes.\n\n*Yitu Tongbian*, Scroll Three\nBy Linchuan Daoist Lei Siqi",
      "start_char": 10261,
      "end_char": 11484,
      "start_sentence": 436,
      "end_sentence": 498,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.482729196548462,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\易图通变.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "其称坎为劳卦者，不徒谓水也，此坎之一数不入於参两、参伍之制，而特着其动之始也，中之始也。 合而言之，天地者体也，阴阳者用也。 体者形，所以用其气； 用者气，所以体其形。 天以气体其形，故其形下包乎地； 地以形用其气，故其气上行乎天。 是天之气，全体乎地之形； 而地之形，全用乎天之气，此又参两之制得以明之也。 一之始参，三之终参，皆天也，而并位乎平地之下。 如：乾者，老阳也，乃附於成数之六阴，位乎阴地西北，偏极乎退数之终。 艮者，少阳也，乃附於成数之八阴，位乎阳地东北，偏立乎进数之始。 而特以坎中之一阳，不在参两之用者，因其始生自然之一，介然特立於阴阳终始之际，起岁之朔，月之朔，以体生生之谓易，斯足以明地之体全用乎天矣。 一始之两，二终之两，皆地也，而兼列于平地之上。 如：巽，少阴也，虽以附地生数之四阴，位乃在东南，偏阳气升已过中之进数。 坤，老阴也，虽以附地生数之二阴，位犹在西南，偏阳气降未及中之退数。 且兼两地并以奉中，参天位之极，当天之极高，日之极中，斯足以明天之用，全体乎地矣。 以是知参两之制，非有日以定其昼夜长短，有月以更其朔望赢缩，则天地之气形体用，阴阳之变化生成，其升降进退之变通分合，出入之归宿，则恶风而讨其真是哉。 故尝由是以参之制，数之元矣。 天一之始，自北而中，而分地二于西南，不得谓天地定位者，阳正而下，阴偏而上也。 二得名坤，一不得名乾者，一起於坎也。 由一参二以为三，以前而东，盖所以见人参於天地之中以生，而动於震，因两其二而四，附以顺而相入之巽，虚生其象以为四。 然象非实体也，象天地与人，极男女之相配以始者尔。 ·一与三之阳，自然已各据其中，而二与四之未中，未有以正之可遂已乎？ 故有待取用於成数之交合，以成其正也。 五虽虚位於中，而有其数可制其用。 一交五，而以其一相配而成六於乾； 二交五，而以其二相配而成七於兑； 三交五，而以其三相配而成八於艮； 四交五，而以其四相配而成九於离，然后始谓之成象。 成象则谓之乾，而效法则谓之坤矣，乃得谓之天地定位也。 其实一自合一，二自合二，三自合三，四自合四，特以交五而变尔。 於是坎一之阳合而成乾六之阴，坤二之阴合而成兑七之阳，震三之阳合而成艮八之阴，巽四之阴合而成离九之阳，其始正者合而辅於偏，始偏者合而归之正，於是八卦成列，而象在其中矣。 亦惟一之自中，坎独自若而不入於数，而河图参天两地，参伍错综之变，得以行乎其中也。 故由参天之制皆用九，而知九为《乾》之用，由两地之制皆用六，而知六为《坤》之用。 盖乾之始参於艮八，而不足於数，则取震之一而九之中参，当阳极而体数之全； 元余不足，则自九之终参，则取兑过中有余之三，以奉乾六之终。 而九之两之始起数於震中之二，以合巽四之不足。 而六之两之终起数於坤之本二，以合兑中有余之四而六之，是明参两九六所用之盘也。 或有谓坤二与兑七而九，乾位自得六数亦自成九、六也，曾不识两之制皆终地上，参之制皆终地下，又焉得而易之哉？ 况乾本九也，今数乃损而六；",
      "translated_text": "That which names *Kan* as the \"Hexagram of Labor\" does not refer merely to water. This singular yang of *Kan* does not enter the system of *san-liang* (three-two) or *san-wu* (three-five), but rather stands out as the inception of movement, the beginning of the center. In synthesis, heaven and earth are the *ti* (substance/body), while yin and yang are the *yong* (function/activation). *Ti* is form, by which qi is activated; *yong* is qi, by which form is embodied. Heaven embodies its form through qi, thus its form envelops earth below; earth activates its qi through form, thus its qi ascends to heaven above. Here, heaven’s qi wholly embodies earth’s form, while earth’s form wholly activates heaven’s qi—this further clarifies the *san-liang* system.\n\nThe beginning of one’s triad and the end of three’s triad both belong to heaven, yet they are positioned below the level earth. For example: *Qian*, the elder yang, is appended to the completed number of six yin, stationed in the yin region of the northwest, at the extreme of the retiring sequence’s end. *Gen*, the lesser yang, is appended to the completed number of eight yin, stationed in the yang region of the northeast, standing at the inception of the advancing sequence. Yet the singular yang at the center of *Kan*, not employed in the *san-liang* system, arises from the primal one of spontaneous generation, standing distinct amid the yin-yang cycle of beginning and end. It initiates the year’s first month, the moon’s first phase, embodying the *Yi*’s meaning of ceaseless generation—thus fully demonstrating that earth’s *ti* wholly activates heaven.\n\nThe beginning of two’s pair and the end of two’s pair both belong to earth, yet they are arrayed above the level earth. For example: *Xun*, the lesser yin, though attached to earth’s generative number of four yin, is positioned in the southeast, where yang qi has already advanced past the midpoint. *Kun*, the elder yin, though attached to earth’s generative number of two yin, remains in the southwest, where yang qi has not yet descended to the midpoint. Moreover, both earthly pairs jointly uphold the center, aligning with the polar extremes of heaven’s triads—corresponding to heaven’s highest point and the sun’s zenith. This fully demonstrates that heaven’s *yong* wholly embodies earth.\n\nFrom this, we know that without the *san-liang* system—without the sun to determine the length of day and night, without the moon to alternate its waxing and waning—how could the qi, form, *ti*, and *yong* of heaven and earth, the transformations and creations of yin and yang, their ascending and descending, advancing and retreating, their permutations of separation and union, their comings and goings, their destinations—how could one discern their true nature amid the chaotic winds? Thus, it is through this *san* system that the origin of numbers is established.\n\nHeaven’s one begins in the north, moves to the center, and divides earth’s two in the southwest. This cannot be called \"heaven and earth in their proper positions,\" for yang is upright and descends, while yin is partial and ascends. That two is named *Kun* while one is not named *Qian* arises because one originates from *Kan*. From one’s triad with two to form three, proceeding eastward, we see humanity’s triad within heaven and earth to generate life, moving in *Zhen*. Then, doubling two to make four, appending *Xun* to follow and interpenetrate, an image is born—yet this image is not the true substance. The image of heaven, earth, and humanity merely represents the initial pairing of male and female.\n\nThe yang of one and three naturally each occupies its center, but the uncentered two and four—how can they be left uncorrected? Thus, they await the application of completed numbers’ intersections to achieve correctness. Though five occupies the central void, its number governs its function. One intersects five, pairing its one to complete six in *Qian*; two intersects five, pairing its two to complete seven in *Dui*; three intersects five, pairing its three to complete eight in *Gen*; four intersects five, pairing its four to complete nine in *Li*—only then is it called a \"completed image.\" The completed image is called *Qian*, and its imitative pattern is called *Kun*—only then can it be said that \"heaven and earth are in their proper positions.\"\n\nIn reality, one naturally pairs with one, two with two, three with three, four with four—it is only through intersecting five that transformation occurs. Thus, the singular yang of *Kan* combines to form the six yin of *Qian*; the two yin of *Kun* combine to form the seven yang of *Dui*; the three yang of *Zhen* combine to form the eight yin of *Gen*; the four yin of *Xun* combine to form the nine yang of *Li*. What was initially correct is paired to assist the partial; what was initially partial is paired to return to correctness. Thus, the eight trigrams are arrayed, and their images reside within.\n\nOnly the one at the center of *Kan* remains self-contained, not entering the numerical system. Through the *Hetu*’s \"three heavens, two earths\" and the *san-wu*’s intricate permutations, its transformations unfold. Therefore, from heaven’s *san* system, all employing nine, we know nine is *Qian*’s function; from earth’s *liang* system, all employing six, we know six is *Kun*’s function.\n\n*Qian*’s inception triads with *Gen*’s eight, yet falls short in number—thus it takes *Zhen*’s one to complete nine’s central triad, embodying yang’s extremity and the fullness of numerical form. When the primordial surplus is insufficient, it takes the final triad of nine, then draws *Dui*’s surplus three beyond the center to serve *Qian*’s six at its end. Nine’s paired inception begins with *Zhen*’s central two, combining with *Xun*’s four to compensate its lack. Six’s paired conclusion begins with *Kun*’s original two, combining with *Dui*’s surplus four to complete its six—thus clarifying the interplay of *san-liang*’s nine and six.\n\nSome claim that *Kun*’s two and *Dui*’s seven make nine, and *Qian*’s position naturally yields six, also forming nine and six—yet they fail to recognize that the *liang* system concludes above earth, while the *san* system concludes below earth. How could these be interchangeable? Moreover, *Qian* is originally nine, yet its number is now reduced to six.",
      "overlap_context": " thirty completes the month—another method of the *Hetu*. The celestial circuit is 365¼ degrees; the sun moves one degree daily. The winter south and summer north mark the central extremes of cold and heat. The moon moves slightly more than thirteen degrees daily, meeting the sun twelve times in conjunctions—thus the year regularly comprises six yin and six yang months, twelve in total. Heaven and earth are regulated, and the four seasons are completed. The moon’s movements are indeed laborious.",
      "start_char": 11484,
      "end_char": 12695,
      "start_sentence": 499,
      "end_sentence": 538,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.862412214279175,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\易图通变.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "坤本六也，今数乃增之而九者，尤足以明老阴之六变而之九，老阳之九变而之六，而卦爻．之所以成九、六也。 由参天之用必九，两地之体必六，《下系》之首日：八卦成列，象在其中矣。 因而重之，爻在其中矣。 而后世乃谓《易》画之重，非由羲始，吾不信也。 且《说卦》谓说言乎兑，成言乎艮。 凡再言其山泽通气者，即《咸》卦也。 《咸》之《象》日：二气感应以相与。 止而说。 天地感而万物化生，圣人感人心而天下和平：观其所感，而天地万物之情可见矣。 其雷风相薄者，即《怛》卦也。 《怛》之《象》日：雷风相与，巽而动。 天地之道，恒久而不已也。 日月得天而能久照，四时变化而能久成，圣人久於其道而天下化成：观其所怛，而天地万物之情可见矣。 迦求於下经之人道攸始，则《说卦》重卦其旨一毫#3不悖也。 故愚谓重《易》断自羲始。 不然，《礼》谓三《易》其经卦皆八，其别皆六十四，其欺我哉？ 求《易》之道，试以是进之。 《说卦》日：昔者圣人之作《易》也，参天两地而倚数，观变於阴阳而立卦，发挥於刚柔而生爻。 因参稽其所以参两者，其得於河图元问然矣。 且帝出乎震一章，尤河图之大讲明也。 特截自震起於春中#4，环周而讫于艮，寓夏正之岁更尔。 故曰：终万物，始万物者，莫盛乎艮。 日：艮，东北之卦，万物之所成终而所成始。 意盖谓又始於出乎震者也。 此实孔子特以变通四时言也，而於通乎昼夜之道，而知则未及悉也。 夫两之制，并起於平地，以奉中参者，自春而秋以分，必极於夏之至者，亦昼之象也。 始终之参，皆在地中者，自秋而春以分，必极於冬之至者，亦夜之象也。 请以日用常行变而通之，则出乎震者，人之始作於日一也。 古谓震日一所以验也。 齐乎巽者，动而相与之交也。 相见乎离，则交际之极也。 致役乎坤，则动极徐静也。 说言乎兑，休且入也。 自震至兑，此昼之体用，人所同见。 至於战乎乾，卒取终参之制。 其数之九，则存兑余之三，向晦入息於乾六以终也。 阴阳相薄，闭塞不用之时也。 然终则有始，至於劳乎坎，则夜分之气复动，准於七日之复则同也。 成言乎艮，则远接兑余之三，说言乎兑也。 山泽通气，感而相与，虽止於其所而时行则行，斯人事之又兴始者也。 变化者，进退之象也； 刚柔者，昼夜之象也。 吾见自羲、文以来，河图之一阴一阳，进退升降，往复循环，周流不息； 开古迄今，远之一岁之冬夏，迩之一日之昼夜，莫不由斯道也。 吾日用常行，不在他求#5，参天之道自艮始者，於是乎在其视《太玄》以七百二十九，赞之准《易》，《皇极》以元、会、运、世之旁通，各以一期之岁、月、日、时为数例，视今通其变、极其数於河图，日可见之行也。 岂不易简而理得哉？ 斯非至精变而神者与？ 易图通变竟之三竟 #1『亦类也』，此三字四库本缺。 #2『爻』，原作『××』，据四库本改。 #3『毫』，原作『豪』，据四库本改。 #4『春中』，四库本作『泰中』。 #5『他求』，四库本作『它求』。 易图通变卷之四 临川道士雷思齐学 河图辨征河之有图，处牺则之以画八卦，文王因之以系#1卦辞，历代宝而传之。",
      "translated_text": "Kun was originally six, yet its number is now augmented to nine—this further clarifies how the old yin’s six transforms into nine, and the old yang’s nine transforms into six, thereby establishing the nine and six of the hexagrams and lines. From this, we see that the *san*-Heaven’s function must be nine, while the *liang*-Earth’s form must be six. The opening of the *Xiaoxi* states: “The eight trigrams are arrayed, and their images are therein.” By doubling them, “their lines are therein.” Yet later generations claim that the doubling of the *Yi*’s lines did not originate with Fuxi—this I cannot believe. Moreover, the *Shuogua* says: “Joy is expressed in *Dui*, completion is spoken of in *Gen*.” Whenever it speaks twice of the communication of qi between mountain and marsh, it refers to the hexagram *Xian*. The *Xiang* of *Xian* says: “The two qi stimulate and respond to one another, uniting in stillness and joy. Heaven and Earth stimulate each other, and the myriad things are transformed and born; the sage stimulates the human heart, and the world attains peace.” Observing what they stimulate, the nature of Heaven, Earth, and the myriad things becomes visible. Where thunder and wind press upon one another, it refers to the hexagram *Heng*. The *Xiang* of *Heng* says: “Thunder and wind unite, advancing and moving. The Dao of Heaven and Earth is everlasting and unceasing. The sun and moon attain Heaven and thus endure in their illumination; the four seasons transform and thus endure in their completion. The sage endures in the Dao, and the world is transformed and completed.” Observing what they press upon, the nature of Heaven, Earth, and the myriad things becomes visible. Tracing the beginning of human Dao in the *Lower Canon*, the intent of the *Shuogua* in doubling the hexagrams is not the slightest bit contradictory. Thus, I maintain that the doubling of the *Yi* decisively began with Fuxi. Otherwise, the *Rites* speaks of the three *Yi*, all of whose primary hexagrams are eight, and whose variations are all sixty-four—would this deceive me? In seeking the Dao of the *Yi*, let this be the starting point.\n\nThe *Shuogua* says: “Of old, the sages made the *Yi*, measuring Heaven by *san* and Earth by *liang*, observing the changes in yin and yang to establish the hexagrams, and expressing them through hardness and softness to generate the lines.” Investigating the principles behind their *san* and *liang*, their derivation from the *Hetu*’s primordial inquiry is evident. Moreover, the chapter beginning “The sovereign emerges from *Zhen*” is a grand elucidation of the *Hetu*. It specifically begins with *Zhen* at the center of spring, circling around to conclude at *Gen*, embodying the annual renewal of the Xia calendar. Thus it is said: “In ending the myriad things and beginning the myriad things, none is more flourishing than *Gen*.” It says: “*Gen* is the hexagram of the northeast, where the myriad things complete their endings and begin their beginnings.” The implied meaning is that it begins anew with the emergence from *Zhen*. This is indeed Confucius’s unique way of expressing the cyclical transformation of the four seasons, yet regarding the Dao that permeates day and night, his knowledge did not fully extend to it.\n\nThe *liang* system, arising together from level ground to serve the central *san*, divides from spring to autumn and must culminate at the solstice of summer—this is also the image of day. The *san* system, beginning and ending entirely within the earth, divides from autumn to spring and must culminate at the solstice of winter—this is also the image of night. Let us apply this to the constant transformations of daily life: emerging from *Zhen* is the beginning of human activity at sunrise—this is what the ancients called *Zhen* as the verification of the first day. Aligning with *Xun* is the interaction of movement and union. Appearing in *Li* is the culmination of interaction. Laboring in *Kun* is the extreme of movement gradually settling into stillness. Joyfully speaking in *Dui* is rest and reclusion. From *Zhen* to *Dui*, this is the function and form of day, commonly observed by all. As for contending in *Qian*, it ultimately adopts the *san* system’s conclusion. Its number nine preserves *Dui*’s surplus three, entering at dusk to rest within *Qian*’s six and thus concluding. This is the time when yin and yang press upon one another, closed and unused. Yet an ending contains a beginning, and when it reaches toiling in *Kan*, the qi of the night’s division stirs again, corresponding to the return of the seven-day cycle. Completing speech in *Gen* is the distant connection to *Dui*’s surplus three, joyfully speaking in *Dui*. The communication of qi between mountain and marsh, stimulating and uniting, though still in its place, moves when the time is right—this is the renewed beginning of human affairs.\n\nTransformation and change are the images of advance and retreat; hardness and softness are the images of day and night. From Fuxi and King Wen onward, I see that the *Hetu*’s single yin and single yang, advancing and retreating, ascending and descending, circulate endlessly. From antiquity to the present, whether in the distant cycle of a year’s winter and summer or the near cycle of a day’s day and night, nothing does not proceed by this Dao. In our daily lives and constant conduct, there is no need for other inquiries—the Dao of *san*-Heaven that begins in *Gen* is present herein. Regarding *Tai Xuan*’s use of seven hundred twenty-nine to emulate the *Yi*, or *Huangji*’s use of *yuan*, *hui*, *yun*, and *shi* to establish correspondences with the cycles of years, months, days, and hours, observing their transformations and exhausting their numbers in the *Hetu* reveals the visible workings of the Dao. Is this not simple and principle-attaining? Is this not the utmost in subtle transformation and the numinous?\n\nThe *Yitu Tongbian* concludes its third section.\n\n---\nThe Linchuan Daoist Lei Siqi studies\n*Hetu Bianzheng*\nThe *Hetu*’s existence as a diagram led Fuxi to draw the eight trigrams based on it; King Wen subsequently appended the hexagram statements, and it has been treasured and transmitted through the ages.",
      "overlap_context": "th *Kun*’s original two, combining with *Dui*’s surplus four to complete its six—thus clarifying the interplay of *san-liang*’s nine and six.\n\nSome claim that *Kun*’s two and *Dui*’s seven make nine, and *Qian*’s position naturally yields six, also forming nine and six—yet they fail to recognize that the *liang* system concludes above earth, while the *san* system concludes below earth. How could these be interchangeable? Moreover, *Qian* is originally nine, yet its number is now reduced to six.",
      "start_char": 12695,
      "end_char": 13927,
      "start_sentence": 539,
      "end_sentence": 594,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.896185398101807,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\易图通变.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "自见於《书》之《顾命》陈之束序者，而今乃谓其元，谁敢哉？ 然自《记》以思古，则云其出语之伤，今则云其不出《顾》已皆意之，而非其真见矣。 秦火之后，独见於《书传》孔安国之云而已。 《汉志》杂以图书，而徒谓其与《书》经纬表裹，《易纬》则徒又枝辞蔓引，愈违本旨，以至芒#2乎莫之究其有元形似之真为何如者，讫于唐五季也。 及宋之初，陈传图南始创古推明象数，闵其贱用於阴阳家之起例，而芜没於《乾凿度》大一#3取其数以行九宫之法，起而着为龙图，以行于世。 愚幸及其全书，观其离合出入具於制数之说，诚若剖心而有以求羲、文之心者也，然皇有不得於羲、文之心者。 於本图之外，就以五十有五之数别出一图，自标之以为形洛书者已，是其初之失也。 虽其纵横、错综、分合、体用之意，皆在本图，而五十有五之数，既离而别出，世遂舍本逐末，因疑图书并出，虽#4是若非，元以究其诣极，而徒长纷纷之论。 至其传及刘牧长民，因之泛出五十五图，名以《钩隐#5》，则又以增异。 而时则李观泰伯即驳其非是，然又自谓存其三图#6。 及见此三图，则其首即所传今谓河图者，其二即所别出五十五数、漫标谓形洛书者，其三又止於八卦方位而已。 是长民不揣其本，其事固非，而泰伯亦元不识此之三本之则一，而妄析以为三尔。 自时已后，愈传愈失，愈说#7愈凿，至有因河出图、洛出书见於《大传》，而并致疑《大传》非孔子所作者。 不知图本非书，书本非图。 至其甚者，以五十五数之图，乃妄谓之河图，而以图南所传之河图反谓之洛书，颠倒迷缪，靡所底止，殊不明河图八卦明着五十五数，实指以天数五、地数五； 而其数自天一、地二以至天五、地十，合而五十有五，有体有用，有虚有实，原始要终，而尽发於一图，岂尝别求合於洛书哉？ 洛书亦岂尝谓五十五数哉？ 今图南既别元义例辞说，误以图之五十五数，别标一图以为洛书，是其传疑之始也。 原其初意，盖由汉儒袭传《洪范》初一之五行，其二曰火，四日金。 《太玄》准《易》实本之，亦以二为火，为南； 四为金，为西。 今河图乃置二於西南，置四於束南，是火、金改次矣。 既不敢遂改河图，乃别以其五十五数析为洛书，而以《洪范》二火次于南，四金次于西，且以七随二，九随四，而易置其南西焉。 以故长民不识其由，至谓火、金易位也。 夫离之数九，居正南，为火； 兑之数七，居正西，为金，乃天地自然参五以变之数，断断元以易之，岂容以汉儒任意比校《洪范》火、金之二、四，得而移易之乎？ 况《洪范》只有五行之数，今增以七、九，又以七随二，九随四，又何所本哉？ 若校以河图之例，七附二，九附四，是七稽疑当随二五事，九五福当随四五纪，则成何义类也？ 二、七、四、九，徒论其数，元形象，元方位可定指，空移易之则可； 离、兑之有方所，火、金之有体用，岂天地之造化，亦遂肯依附人之作为，亦为之变移乎？ 今图南不谓图书之数，校然#8不可相同，而欲以背理之人为比而同之，截截自分界限，是得指失肩背矣。 且河图之出，非徒谓四象、八卦之具文也，天地之体用固犹是也。",
      "translated_text": "From its first appearance in the *Book of Documents*’ *Counsels of Yu* as the \"arrangement of the *shu*\" to its present designation as the \"primordial,\" who would dare question it? Yet when we trace its origins through the records and reflect on antiquity, we find that earlier accounts lamented its loss of authentic expression, while later interpretations claim that even the *Counsels* failed to capture its true meaning—thus obscuring its original vision. After the Qin burning of the books, it survived solely in the *Book of Documents* commentary of Kong Anguo. The *Han Annals* merely noted its role in \"weaving together the warp and weft of the *Book of Changes*,\" while the *Apocrypha of the Changes* spun ever more convoluted theories, straying further from the original intent. By the Tang and Five Dynasties, its true form and semblance had become so obscure that none could fathom its primordial essence.\n\nAt the beginning of the Song, Chen Tuan of Chuan first revived the ancient study of images and numbers. Distressed by its debasement in the divination practices of yin-yang theorists and its entanglement in the *Qian Zaodu*’s *Taiyi* numerology for the nine-palace method, he composed the *Dragon Diagram* to disseminate his teachings. Though I was fortunate to examine his complete work and observe how its principles of separation and union, emergence and withdrawal, were expounded through numerical systems—seemingly as if he had laid bare the very hearts of Fuxi and King Wen—there remained aspects where he failed to grasp their intent. His initial error lay in extracting the number fifty-five from the original diagram to create a separate figure, which he arbitrarily labeled as the \"embodied *Luoshu*.\" While the original diagram already contained all the meanings of vertical and horizontal alignment, interweaving, division and unity, substance and function, the separation of the fifty-five numbers led later generations to abandon the root for the branch, fostering doubts about whether the *Hetu* and *Luoshu* emerged together. Though some affirmed and others denied, none pursued the matter to its ultimate conclusion, only fueling endless debate. When his disciple Liu Mu of Changmin further proliferated fifty-five diagrams under the title *Gouyin*, the distortions multiplied. At the time, Li Guan of Taibo refuted these errors, yet even he claimed to preserve three diagrams. Upon inspection, the first was the *Hetu* as commonly transmitted today; the second was the separate fifty-five-number figure arbitrarily labeled as the \"embodied *Luoshu*\"; and the third merely depicted the directional positions of the eight trigrams. Changmin, failing to discern the root, was indeed mistaken, but Taibo likewise failed to recognize that these three were fundamentally one, arbitrarily dividing them into three.\n\nFrom that time onward, the more it was transmitted, the more it was lost; the more it was expounded, the more forced the interpretations became. Some, citing the *Great Commentary*’s account of the *Hetu* emerging from the river and the *Luoshu* from the Luo, even doubted whether the *Great Commentary* was truly the work of Confucius. They did not understand that the *Hetu* was not the *Luoshu*, nor the *Luoshu* the *Hetu*. In the most extreme cases, the fifty-five-number diagram was falsely called the *Hetu*, while Chen Tuan’s transmitted *Hetu* was mislabeled as the *Luoshu*—a complete inversion, leading to endless confusion. They failed to see that the *Hetu*’s eight trigrams clearly display the fifty-five numbers, explicitly denoting the heavenly numbers (five) and earthly numbers (five). From heaven-one and earth-two to heaven-five and earth-ten, their sum is fifty-five, embodying substance and function, emptiness and fullness, origin and end—all fully expressed in a single diagram. When did it ever seek correspondence with the *Luoshu*? And when did the *Luoshu* ever claim to represent the fifty-five numbers?\n\nChen Tuan’s error began when he arbitrarily separated the fifty-five numbers from the *Hetu* to create a distinct diagram labeled as the *Luoshu*, thereby initiating the transmission of doubt. His initial intent likely stemmed from Han scholars’ transmission of the *Hongfan*’s first five phases, where the second is fire and the fourth is metal. The *Tai Xuan* modeled itself on the *Changes*, also designating two as fire (south) and four as metal (west). Yet in the *Hetu*, two is placed in the southwest and four in the southeast, reversing the positions of fire and metal. Unwilling to directly alter the *Hetu*, Chen Tuan instead extracted the fifty-five numbers to form the *Luoshu*, placing fire (two) in the south and metal (four) in the west according to the *Hongfan*, and appending seven to two and nine to four, thereby rearranging their positions in the south and west. Changmin, unaware of this reasoning, went so far as to claim that fire and metal had swapped places. Yet the number nine of *Li* (fire) resides in the due south, while the number seven of *Dui* (metal) resides in the due west—these are the natural transformations of heaven and earth through the interplay of five, and there is no justification for altering them. How could one arbitrarily compare them to the *Hongfan*’s fire (two) and metal (four) and presume to rearrange them? Moreover, the *Hongfan* only lists the numbers of the five phases, whereas Chen Tuan added seven and nine, attaching seven to two and nine to four—on what basis? If we follow the *Hetu*’s example, where seven is appended to two and nine to four, then the seven *yous* of doubt should correspond to the two of the five affairs, and the nine *fus* of fortune should correspond to the four of the five constants—what kind of coherence would this create? Two, seven, four, and nine are merely numbers, devoid of form, image, or fixed direction; they could be arbitrarily rearranged. But *Li* and *Dui* have their proper places, and fire and metal have their substance and function—would the creative transformations of heaven and earth willingly submit to human contrivance and alter themselves accordingly?\n\nChen Tuan did not recognize that the numbers of the *Hetu* and *Luoshu* are fundamentally distinct and cannot be made identical. By forcing an illogical comparison, he drew rigid boundaries where none existed, grasping the finger and losing sight of the shoulder and back. Moreover, the emergence of the *Hetu* was not merely about the textual forms of the four images and eight trigrams—it embodied the very substance and function of heaven and earth.",
      "overlap_context": " exhausting their numbers in the *Hetu* reveals the visible workings of the Dao. Is this not simple and principle-attaining? Is this not the utmost in subtle transformation and the numinous?\n\nThe *Yitu Tongbian* concludes its third section.\n\n---\nThe Linchuan Daoist Lei Siqi studies\n*Hetu Bianzheng*\nThe *Hetu*’s existence as a diagram led Fuxi to draw the eight trigrams based on it; King Wen subsequently appended the hexagram statements, and it has been treasured and transmitted through the ages.",
      "start_char": 13927,
      "end_char": 15132,
      "start_sentence": 595,
      "end_sentence": 626,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.49841809272766,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\易图通变.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "离南象天，离中乃阴，阴所以降； 坎北象地，坎中有阳，阳所以升。 震阳在初，所以象肠木之束升； 兑阴在上，故以象阴金之西降。 乾、坤所以体天地，阴、阳所以用造化，而二卦乃寄於西南、西北之维，习於常见，是天地易位矣，不惟是也。 筮法又以震、巽为木，乾、兑为金，坤、艮为土，而坎．独为水，离独为火，则坎、离得专水、火，而乾、坤乃不得专天、地，亦犹火、金之不可以执方求定也。 坤二位於西南，乃地二生火； 巽四位於束南，乃地四生金，皆阴也。 ．而兑七位於西，离九位於南，皆阳也。 是生数皆阴，必待阳数以成之也。 地之生数自西而南，故坤而后巽； 成数自南而西，故离而后兑。 观於火既炽而灰灭，是火既变而神化； 金虽销而质存，是金既化而精犹未变#9也。 此火、金之所以互变化者，同而不同，故一不七、四、九之数，自是参伍错综之变，不可以执方究其竟也。 今五十五数之图，以一、二、三、四置于四方之内，而以六、七、八、九随置其外者，按其方而数之则可也。 不知将何以循序回环，以运行之乎？ 况不知五与十者，特有数寄於四方之位而虚用之也。 且五与十虽谓土数，五行家於土，必以分王於四方辰、戌、丑、未之位； 医家谓土为脾，以五气之运，每运七十二日，总三百六十为期之例，特以土之七十二日，四分之各十八日於四时之附末，谓为脾之主事。 医於人至为切已，以土之日四分而试之以为常验，亦岂尝专以土之五总之，而特设五於四方之外，与四方分位，而别立之五以为中五哉？ 况筮法四营而成《易》，以十有八变而成卦； 每变四营，总卦之成，凡七十有二营，亦与医说胳合。 今图乃分五离立，而特设异五於中位，指以为中，则为此中者，又将孰适於用乎？ 故余以为图南之别出五十五数，标异谓之形洛书者，是其初作已自失之矣。 《书》之九畴，各畴自有成数，如一五行，二五事，犹或得以五行、五用之数； 从而强推引之，至於五皇极，则已不可指实之为何物、何事，而甚则九五福而附以六极，则将计九乎？ 计五福而兼计六极乎？ 皇极谓大中，而六极者，其极又可谓中乎，皇极本非物非事，故可指之为中。 今徒实以五点，而五点者，乃遂得为中乎？ 畴自一至九，界界然各存本有之数，不知何自而可以合於五十有五之数？ 强谓其合者，盖其人之妄也心若其后而至於以书谓图，以图谓书者，又妄人#10中之妄人也。 此余特谓图则有数可通，而书则有畴类可数，而不可布之以为图也。 凡余所以专守河图者，非敢自谓亲见羲、文所以本之而作《易》者，而其五且十之数，横、斜、旁、正相生相成之进、退、赢、缩，一阴一阳之奇、耦、分、合，八体二用之虚、实、变、通，殆有造化神明莫穷之蕙，非人之所能为； 而殆乎天机之自然者，宜其为羲、文所以作《易》之本原也。 窃尝心潜力索，触类引伸，变而通之，由门入蕴，谓独得一全之体用，僭着其说。 然与汉诸儒事事必强推五行，以求合於《春秋》灾异，傅会五十五数以为洛书者，实不敢谓然，不敢同也。 世恐未悉，况此河图或谓由《易纬·乾凿度》谓太一取其数以行九宫，四正四维皆合十五。",
      "translated_text": "Li in the south symbolizes heaven, yet its center harbors yin—yin by which descent is effected. Kan in the north symbolizes earth, yet its center holds yang—yang by which ascent is achieved. Zhen, with yang at its inception, thus mirrors the eastern rise of the Wood of the Bowels. Dui, with yin at its apex, therefore reflects the western descent of the Metal of the Yin. Qian and Kun embody the very substance of heaven and earth, while yin and yang enact the creative transformations—yet these two trigrams are relegated to the southwest and northwest corners. Habituated to common perception, one might suppose heaven and earth have exchanged places. Nor is this all.\n\nDivinatory methods further assign Zhen and Xun to Wood, Qian and Dui to Metal, Kun and Gen to Earth, while Kan alone represents Water and Li alone Fire. Thus Kan and Li monopolize Water and Fire, just as Qian and Kun are denied exclusive claim to Heaven and Earth—much like Fire and Metal, which cannot be rigidly fixed to a single direction. Kun, occupying the second position in the southwest, is where Earth’s second power generates Fire. Xun, in the fourth position in the southeast, is where Earth’s fourth power generates Metal—both yin. Yet Dui in the seventh position in the west and Li in the ninth position in the south are both yang. Thus the generating numbers are all yin, requiring the completion of yang numbers. Earth’s generating numbers proceed from west to south, hence Kun precedes Xun; its completing numbers proceed from south to west, hence Li precedes Dui.\n\nObserve how fire, once ablaze, reduces to ash and vanishes—fire transformed and spiritually transmuted. Though metal may melt, its essence endures—metal transformed yet its essence unchanged. This mutual transformation of Fire and Metal, alike yet not alike, explains why the numbers one, seven, four, and nine are not fixed but interweave in intricate variation, defying rigid directional analysis.\n\nThe diagram of fifty-five numbers places one, two, three, and four within the four directions, while six, seven, eight, and nine are arranged externally. Counting by direction may proceed, but how is one to trace a cyclical sequence that enables their circulation? Moreover, the numbers five and ten are merely assigned to the four directions as virtual functions. Though five and ten are termed Earth numbers, cosmologists distribute Earth’s dominion among the four directions—Chen, Xu, Chou, and Wei. Physicians, speaking of Earth as the Spleen, follow the five-phase cycle, each phase lasting seventy-two days, totaling three hundred sixty days. They further divide Earth’s seventy-two days, apportioning eighteen days to the end of each season, designating this as the Spleen’s period of governance. Medicine, so intimately concerned with human well-being, empirically confirms this division of Earth’s days—yet nowhere does it isolate five as a distinct entity outside the four directions, establishing a separate \"central five.\"\n\nFurthermore, the divinatory method of four operations completes the *Yi*, and eighteen changes form a hexagram. Each change involves four operations, so the total operations per hexagram number seventy-two—aligning with medical theory. Yet this diagram separates five, establishing an anomalous central five. If this center is designated as such, to what practical use shall it be put?\n\nThus, I contend that Chen Tuan’s invention of the fifty-five-number diagram, distinctively labeled the \"form of the *Luoshu*,\" was fundamentally misguided from its inception. The *Book of Documents*’ Nine Categories each possess their own completed numbers: the first pertains to the Five Phases, the second to the Five Affairs—here, one might still derive numerical coherence. Yet when forcibly extended to the fifth, the \"August Standard,\" it becomes impossible to specify what object or affair it represents. Even more egregiously, the ninefold \"Five Blessings\" are appended to the \"Six Extremities\"—should one count the nine, or the five blessings alongside the six extremities? The \"August Standard\" denotes the Great Mean, yet the \"Six Extremities\" represent extremes—can extremes be called \"mean\"? The August Standard is neither object nor affair, hence it may be designated as \"central.\" Yet to concretize it as five dots—do these dots thereby constitute the center?\n\nEach category, from one to nine, retains its inherent numerical integrity. How can they be arbitrarily combined into fifty-five? To insist on such a synthesis is mere delusion. Those who later equate the *Luoshu* with diagrams, and diagrams with the *Luoshu*, are delusional among the deluded.\n\nI maintain that while diagrams may possess coherent numerical structures, and the *Luoshu* may enumerate categorical types, it cannot be spatially arranged as a diagram. My adherence to the *Hetu* is not a claim to have personally witnessed the foundational principles by which Fu Xi and King Wen composed the *Yi*. Yet its numbers—five and ten—interweave horizontally, diagonally, laterally, and orthogonally, generating and completing through advance and retreat, surplus and deficit. The alternation of yin and yang in odd and even, division and union, the eight trigrams’ substantive and functional transformations—these embody the unfathomable subtleties of creation’s numinous workings, beyond human contrivance. They seem to emerge from the natural mechanisms of heaven itself, rightfully serving as the primordial source for Fu Xi and King Wen’s composition of the *Yi*.\n\nI have privately immersed myself in its study, extending its principles by analogy, adapting and penetrating its depths, entering its gate to grasp its profound essence. Presuming to have attained a comprehensive understanding of its substance and function, I have ventured to expound my interpretation. Yet unlike the Han scholars who dogmatically imposed the Five Phases to reconcile with the *Spring and Autumn*’s portents, or who forcibly harmonized the fifty-five numbers into the *Luoshu*, I dare not affirm such approaches, nor align myself with them.\n\nThe world may not yet fully comprehend this: the *Hetu* is sometimes said to derive from the *Apocryphon of the Yi*, *Qian Zao Du*, where the Great One deploys its numbers to traverse the Nine Palaces, with the four cardinal and four intercardinal directions each summing to fifteen.",
      "overlap_context": " contrivance and alter themselves accordingly?\n\nChen Tuan did not recognize that the numbers of the *Hetu* and *Luoshu* are fundamentally distinct and cannot be made identical. By forcing an illogical comparison, he drew rigid boundaries where none existed, grasping the finger and losing sight of the shoulder and back. Moreover, the emergence of the *Hetu* was not merely about the textual forms of the four images and eight trigrams—it embodied the very substance and function of heaven and earth.",
      "start_char": 15132,
      "end_char": 16336,
      "start_sentence": 627,
      "end_sentence": 664,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.342108964920044,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\易图通变.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "郑康成又注引其所以行九宫者，至於环中之虚位，本非谓五，而乃谓皇为五之中宫。 固其《纬》、《注》俱妄，又不知其为五若十，皆虚用以制其奇耦生成，虽有其数，皇元其位也。 然其所谓之太乙者，与太极则元以异也。 苟未识其然，《记》日：夫礼必本於太一，分而为天地，转而为阴阳，变而为#11四时，列而为#12鬼神。 其理固与太极元以异也，自可旁通而元问然者； 《记》经之属也，因附诸《传》后以征。 易图通变卷之四竟 #1『击』，原作『县』，据四库本改。 #2『芒』，四库本作『茫』。 #3『大一』四库本作『太一』。 #4『虽』，原作『维』，据四库本改。 #5『钩隐』，原作『勾隐』，据四库本改。 #6『其三图』，四库本空缺此三字。 #7『说』，四库本作『失』。 #8『校然』，四库本作『较然』。 #9『未变』，原作『存变』，据四库本改。 #10『妄人』，原作『妄之』，据四库本改。 #11『为』，原脱，据四库本补。 #12『为』，原脱，据四库本补。 易图通变卷之五 临川道士雷思齐学 河图遗论古圣人之王天下，创始公至理，以惠启千万世者，岂易易然率己见以自擅制作哉？ 此有天授，断可识矣。 故河之出图，伏羲因之以则而画八卦； 洛之出书，大禹因之以则而叔九畴。 孔子於《大传》叔天生神物，圣人则之，而并及图书，而谓其兼则之也。 子不语怪、力、乱、神，岂元所见於真实，而自乐为虚诞，以愚欺天下后世哉？ 自称庖羲氏之王天下，仰则观象於天，俯则观法於地，观乌兽之文，与地之宜，近取诸身，远取诸物，始作八卦，以通神明之德，以类万物之情。 是岂先圣、后圣各以私意浅识得措乎其间哉？ 《易》之广大配天地，变通配四时，阴阳之义配日月，其为书广大悉备，与乾坤相为终始而元弊，非有天授，能为是乎？ 此孔子有见於图书之出，特谓则之而已，元它说也。 况图之自见於成、康，《顾命》陈之束序之后，元所复闻。 孔子固已自悲其不出，而有已夫之叹。 汉儒之始，孔安国乃由《书传》於河图束序之下，谓伏羲王天下，龙马负图出河，遂则其文，谓之河图； 於天乃锡禹《洪范》九畴之下，谓天锡禹洛书，神龟负文而出，列於背，有数汰一至九，禹因而第之以成九类，类即畴也。 是二说自分载於《洪范》、《顾命》各篇本语之下，亦未之有它说也。 至郑康成始引《春秋纬》合注《大传》之图书云：河以通乾出天苞，洛以流坤吐地符。 河图龙发，洛书龟感。 《河图》有九篇，《洛书》有六篇，已是诡说之开端； 然仍引安国之注，以为河图八卦是也，洛书九畴是也。 其后王辅嗣、韩康伯於此并元所注释，惟孔颖达《易疏》虽全篇写郑注，亦谓辅嗣之义未知何风，是必未以郑注为然也。 及其疏《书》之《洪范》，乃又引《系辞》云：河出图，洛出书，圣人则之。 九类各有文字，即是书也。 而云天乃锡禹，知此天与禹者，即洛书。 就引《汉书·五行志》刘饮以为伏羲击天而王，河出图，则而画之，八卦是也； 禹治洪水，锡洛书，法而陈之，《洪范》是也。 河图、洛书，相为经纬； 八卦、九章，相为表裹。 （附说）先达共为此说。",
      "translated_text": "Zheng Kangcheng, in his annotations, further cites the rationale for traversing the Nine Palaces, arriving at the vacant position at the center of the circuit—though this is not to be taken as the number five, but rather as the \"August One\" occupying the central palace of the five. Yet both his *Apocryphon* and *Commentary* are baseless fabrications, for they fail to recognize that the numbers five and ten are but empty designations employed to regulate the generation of odd and even, their numerical values existing in form alone while their positions remain fundamentally vacant. Moreover, what he terms the \"Grand Unity\" (*Taiyi*) differs fundamentally from the Supreme Ultimate (*Taiji*). If one does not grasp this distinction, consider the *Record*: \"Rites must be rooted in the Grand Unity, which divides to become Heaven and Earth, revolves to become yin and yang, transforms to become the four seasons, and arrays to become ghosts and spirits.\" Its principle is inherently distinct from that of the Supreme Ultimate, yet it may be laterally comprehended without contradiction. As this belongs to the *Record*’s class of texts, it is appended to the *Commentaries* as evidence.\n\n*Yitu Tongbian*, Scroll Four, concludes.\n\n---\n\n*Yitu Tongbian*, Scroll Five\nBy Daoist Lei Siqi of Linchuan\n\nWhen the ancient sages ruled all under Heaven, establishing the foundational principles of governance to enlighten myriad generations, was this achieved lightly, by arbitrarily imposing their own views to arrogate the power of creation? Clearly, such wisdom was bestowed by Heaven—this much is undeniable. Thus, when the Yellow River yielded the *Hetu*, Fuxi took it as a model to draw the Eight Trigrams; when the Luo River yielded the *Luoshu*, Yu the Great took it as a model to arrange the Nine Categories. In the *Great Commentary*, Confucius spoke of Heaven producing numinous artifacts, which sages took as models, and he included both *Hetu* and *Luoshu* in this, affirming their dual authority. Confucius did not speak of anomalies, force, disorder, or spirits—how could he have seen nothing of substance and yet delighted in fabricating falsehoods to deceive later generations? When Fuxi ruled all under Heaven, he looked up to observe the patterns of Heaven, looked down to observe the laws of Earth, examined the markings of birds and beasts and the suitability of the land, drew near to take from his own body, and drew far to take from external things, thereby creating the Eight Trigrams to communicate the virtue/power of the numinous and luminous and to categorize the conditions of the myriad things. Could the former and later sages have each imposed their own shallow understanding upon these matters? The *Yi*’s vastness matches Heaven and Earth, its adaptability matches the four seasons, and the principles of yin and yang match the sun and moon. As a text, it is vast and all-encompassing, perpetually renewing itself in tandem with Qian and Kun without decay. Without Heaven’s bestowal, could such a work exist? Here, Confucius, having witnessed the emergence of the *Hetu* and *Luoshu*, merely stated that sages took them as models—no other explanation was needed.\n\nMoreover, the *Hetu*’s appearance during the reigns of Cheng and Kang is recorded in the *Gu Ming*, where it was displayed behind the array of ritual vessels—no further accounts exist. Confucius already lamented its absence, sighing, \"It is over for me!\" At the dawn of the Han dynasty, Kong Anguo, in his *Book of Documents Commentary*, appended to the *Hetu* under the *Shu Xu* that when Fuxi ruled all under Heaven, a dragon-horse bore the *Hetu* from the Yellow River, and he took its patterns as a model, calling it the *River Chart*. Regarding the Heavenly bestowal of the *Hongfan*’s Nine Categories upon Yu, he stated that Heaven granted Yu the *Luoshu*, where a divine turtle bore the patterns on its back, arranged in numbers from one to nine, and Yu ordered them into nine types—these types being the *chou* (categories). These two accounts were originally recorded separately under the original passages of the *Hongfan* and *Gu Ming*, without additional elaboration.\n\nLater, Zheng Kangcheng began to cite the *Spring and Autumn Apocryphon* to jointly annotate the *Great Commentary*’s *Hetu* and *Luoshu*, stating: \"The Yellow River flows to connect Qian, issuing Heaven’s treasures; the Luo River circulates to link Kun, disgorging Earth’s tokens. The *Hetu* emerges with the dragon’s manifestation; the *Luoshu* arises with the turtle’s inspiration.\" He claimed the *Hetu* comprised nine scrolls and the *Luoshu* six, marking the onset of fantastical theories. Yet he still cited Kong Anguo’s annotations, affirming that the *Hetu* corresponded to the Eight Trigrams and the *Luoshu* to the Nine Categories. Subsequently, Wang Fusi and Han Kangbo offered no commentary on this matter. Although Kong Yingda’s *Yi Shu* transcribed Zheng’s annotations in full, he remarked that Wang Fusi’s interpretation followed an unknown tradition, clearly indicating his refusal to endorse Zheng’s views. In his commentary on the *Hongfan* in the *Book of Documents*, he again cited the *Appended Judgments*: \"The Yellow River yielded the *Hetu*; the Luo River yielded the *Luoshu*; sages took them as models.\" He noted that the nine categories each bore written characters, identifying them as the *Luoshu*, and that the \"Heaven\" which bestowed it upon Yu was none other than the *Luoshu* itself. He further cited Liu Xiang’s *Han Shu·Wuxing Zhi*, which stated: \"When Fuxi ruled by Heaven’s mandate, the Yellow River yielded the *Hetu*, and he took it as a model to draw the Eight Trigrams; when Yu governed the floodwaters, he was granted the *Luoshu*, and he took it as a model to arrange the *Hongfan*. The *Hetu* and *Luoshu* serve as warp and weft; the Eight Trigrams and Nine Categories serve as outer and inner.\"\n\n(Appendix) The foregoing is the shared account of earlier scholars.",
      "overlap_context": "cally imposed the Five Phases to reconcile with the *Spring and Autumn*’s portents, or who forcibly harmonized the fifty-five numbers into the *Luoshu*, I dare not affirm such approaches, nor align myself with them.\n\nThe world may not yet fully comprehend this: the *Hetu* is sometimes said to derive from the *Apocryphon of the Yi*, *Qian Zao Du*, where the Great One deploys its numbers to traverse the Nine Palaces, with the four cardinal and four intercardinal directions each summing to fifteen.",
      "start_char": 16336,
      "end_char": 17587,
      "start_sentence": 665,
      "end_sentence": 713,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.077630281448364,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\易图通变.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "龟负洛书’经无是事。 《中候》及诸《纬》多说黄帝、尧、舜、禹、汤、文、武受图书之事，皆云龙负图，龟负书。 纬候之书，不知谁作，通人讨窍，谓伪起哀、平#1，虽复前汉之末始有此书，已前学者必相传此说，故孔以为九类是神龟负文而出，列於其背，有数仄一至九，禹见其文，因而第之以成九类法也。 言禹第之者，以天神言语必当简要，不应曲有次第，丁宁如此，故以为禹#2第之也。 （全文）其疏《顾命》之河图束序，及疏《记》之出马图，详略虽小有殊同，指意大校若此，是则所谓河图为八卦，所谓洛书为九畴，并无改议也。 由汉而唐，《易经》行世，凡经、传、疏、释之外，未有及於图、书之文刊列经首者。 迨故宋之初，陈搏图南始创意推明象数，自谓因玩索孔子三陈九卦之义，得其远旨，新有书述，特称龙图，离合变通，图余二十，是全用《大传》天一地二至天五地十、五十有五之数，杂以纳甲，贯穿《易》理。 内一图谓形九宫，附一图谓形洛书者，则尽去其五生数，祇#3起地六至地十。 自释十为用，十为成形，故《洪范》陈五行之用数语而已。 及终其书，再出两图，其一形九宫者，元无改异，标为河图； 其一不过尽置列《大传》五十有五之数於四方及中，而自标异谓为洛书，并无传例言说。 特移二、七於南，四、九於西，莫可知其何所祖法而作，而标以此名，大抵因如前说《洪范》五行之二火、四金，《太玄》准《易》因之为二南、四西而然。 然其流传未远，知者亦鲜。 自图南五传而至刘牧长民，乃增至五十五图，名以《钩隐》。 师友自相推许，更为唱述，各於《易》问有注释，日卦德论，日室中语，日记师说，日指归，曰精微，曰通神，亦总谓《周易新注》。 每欲自神其事及迹，而究之未见其真能有所神奇也。 时则有李观泰伯，着《六论》以驳其非，是至谓恩其志误学子，坏爨世教，而删其图之复重存之者三焉：河图也，洛书也，八卦也。 夫长民之多为图画，固未知其是，而泰伯亦无未识此图之三本之则一尔。 河图本列八卦，而数五十有五也。 及长民辈始破洛书古说，谓非只是《洪范》，必别有书出於羲之上世，羲乃得而并则之以作《易》也。 泰伯之见，则又与之同，此愚又莫能知何为其然也。 盖尝夷考《大传》此章，自有法象天地，变通四时，县象日月，而又有及於蓄龟，故因谓之天生神物，圣人则之者，正谓曹也。 《易》惟曹是用，所谓曹之德员而神，幽赞於神明而生曹，《易》岂有龟事哉？ 因其均可以占，故牵联及龟尔。 以上文谓法象天地，变通四时，故申之曰：天地变化，圣人效之。 上文谓县象日月，故申之日：天垂象，圣人象之。 至於天生神物，乃申谓之如河出图，洛出书，圣人亦得以则之也。 盖由河之出图，羲前既得以则而画卦，因及於洛之出书，禹后复得以则而叔畴尔。 又岂害於比类而互言之哉？ 岂尝直欲以图书之数、之义、之条贯比而同之哉？ 岂尝直谓图书并出於一时哉？ 且不惟汉儒引《洪范》以为洛书，虽图南之初谓形洛书者，亦不过谓十为用，十为成形，故《洪范》陈五行之用也者，是明指洛书为《洪范》矣。 不知长民辈不本其初，故倍其师传，而谓洛书非出於禹之时，益使后之人迷乱而失所据依，何也？",
      "translated_text": "The claim that \"a tortoise bore the *Luoshu* on its back\" finds no basis in the Classics. The *Zhonghou* and various *Wei* texts recount that the Yellow Emperor, Yao, Shun, Yu, Tang, Wen, and Wu all received *tushu* (chart-and-script), invariably describing dragons bearing charts and tortoises bearing scripts. The authorship of these *Wei* and *Hou* works remains unknown; scholars investigating their origins trace their forgeries to the reigns of Emperors Ai and Ping of the Han. Yet even before these texts appeared in the late Western Han, earlier scholars must have transmitted such accounts, which is why Confucius, in describing the nine categories, spoke of a divine tortoise bearing written patterns on its back—numbers from one to nine arranged in sequence—so that Yu, upon seeing them, ordered them to form the nine-category system. The assertion that \"Yu ordered them\" stems from the belief that divine beings’ speech must be concise; they would not meticulously arrange such sequences, hence the attribution to Yu.\n\n(Full Text) His commentary on the *Hetu* in the \"Guming\" chapter and on the \"Chuma Tu\" in the *Records* differs only slightly in detail, but their essential meaning aligns as follows: the so-called *Hetu* corresponds to the Eight Trigrams, and the so-called *Luoshu* corresponds to the Nine Categories—no dissenting views exist on this. From the Han through the Tang, as the *Yijing* circulated, no texts beyond the Classics, commentaries, or exegeses ever prefaced the *Hetu* and *Luoshu* to the canon. Only in the early Song did Chen Tuan (Tunan) first innovate to elucidate symbolic numbers, claiming to have grasped the profound intent of Confucius’ \"three presentations of the nine trigrams\" through deep study. He produced new writings, notably the *Longtu* (Dragon Chart), which, through recombination and transformation, yielded over twenty diagrams. These fully employed the *Dazhuan*’s numbers—\"Heaven one, Earth two... Heaven five, Earth ten, fifty-five in total\"—interwoven with the *Na Jia* system to unify *Yi* principles. One diagram, labeled \"Forming the Nine Palaces,\" and another, \"Forming the *Luoshu*,\" entirely omitted the five generating numbers, retaining only Earth’s numbers from six to ten. His explanation that \"ten is for application, ten is for completion\" merely reiterates the *Hongfan*’s enumeration of the five phases’ operational numbers. By the end of his work, he reintroduced two diagrams: the first, \"Forming the Nine Palaces,\" remained unchanged and was relabeled the *Hetu*; the second, merely rearranging the *Dazhuan*’s fifty-five numbers across the four directions and center, was arbitrarily renamed the *Luoshu*, devoid of any explanatory tradition or discourse. He arbitrarily relocated two and seven to the south, four and nine to the west—no one knows on what authority he based this—yet labeled it thus, likely following earlier interpretations of the *Hongfan*’s five phases (two as fire, four as metal) or the *Tai Xuan*’s alignment with the *Yi* (two as south, four as west). However, his theories did not spread widely, and few understood them.\n\nWhen Chen Tuan’s teachings passed through five generations to Liu Mu (Changmin), the latter expanded them to fifty-five diagrams, titling the work *Gouyin*. Teachers and disciples mutually praised and propagated these ideas, producing various *Yi* commentaries—*Discourse on Hexagram Virtues*, *Chamber Dialogues*, *Record of the Master’s Teachings*, *Essential Return*, *Subtleties*, and *Communing with the Divine*—collectively called *New Annotations on the Zhouyi*. Liu sought to mystify his work and legacy, yet upon scrutiny, no true marvels emerged. At the time, Li Guan (Taibo) authored *Six Discourses* to refute his errors, condemning them as misleading students and corrupting世教. He retained only three of Liu’s diagrams: the *Hetu*, the *Luoshu*, and the Eight Trigrams. While Liu’s proliferation of diagrams was indeed questionable, Li’s failure to recognize that these three diagrams shared a common origin was equally flawed. The *Hetu* originally arranged the Eight Trigrams with the fifty-five numbers. Liu and his followers later overturned the ancient interpretation of the *Luoshu*, arguing it was not merely the *Hongfan* but another script predating Fuxi, which Fuxi then used alongside the *Hetu* to create the *Yi*. Li’s view aligned with theirs—this perplexity defies understanding.\n\nUpon careful examination of this chapter in the *Dazhuan*, it presents models of Heaven and Earth, adaptations to the four seasons, and suspended images of the sun and moon, while also mentioning divination tortoises. Thus, it speaks of \"Heaven producing divine things for sages to model,\" referring specifically to divination. The *Yi* relies solely on divination, where the tortoise’s virtue is round and spirit-like, subtly aiding the divine to generate omens—how could the *Yi* involve tortoises? The mention of tortoises arises merely because both tortoises and milfoil can be used for divination. The preceding lines, \"modeling Heaven and Earth, adapting to the four seasons,\" are elaborated as: \"Heaven and Earth transform; sages emulate them.\" The earlier \"suspended images of the sun and moon\" are expanded to: \"Heaven hangs images; sages imitate them.\" As for \"Heaven producing divine things,\" this is further explained as: \"Like the Yellow River yielding the *Hetu* and the Luo River yielding the *Luoshu*, sages also model them.\" Since Fuxi, before Yu, modeled the *Hetu* to draw the trigrams, it naturally extended to Yu modeling the *Luoshu* to arrange the nine categories. How does this harm their analogous and interchangeable use? Did it ever intend to equate the numbers, meanings, or structural coherence of *tushu*? Did it ever claim *tushu* emerged simultaneously? Moreover, not only did Han scholars cite the *Hongfan* as the *Luoshu*, but even Chen Tuan’s initial \"Forming the *Luoshu*\" merely stated that \"ten is for application, ten is for completion,\" referring to the *Hongfan*’s enumeration of the five phases’ operational numbers—clearly identifying the *Luoshu* with the *Hongfan*. Unaware of his original intent, Liu and his followers betrayed their teacher’s transmission, asserting the *Luoshu* did not originate in Yu’s time, further confusing later scholars and depriving them of reliable foundations. Why?",
      "overlap_context": " itself. He further cited Liu Xiang’s *Han Shu·Wuxing Zhi*, which stated: \"When Fuxi ruled by Heaven’s mandate, the Yellow River yielded the *Hetu*, and he took it as a model to draw the Eight Trigrams; when Yu governed the floodwaters, he was granted the *Luoshu*, and he took it as a model to arrange the *Hongfan*. The *Hetu* and *Luoshu* serve as warp and weft; the Eight Trigrams and Nine Categories serve as outer and inner.\"\n\n(Appendix) The foregoing is the shared account of earlier scholars.",
      "start_char": 17587,
      "end_char": 18827,
      "start_sentence": 714,
      "end_sentence": 746,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.217280864715576,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\易图通变.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 17,
      "original_text": "又不谓孔子之谓圣人之则之也。 非特#4去羲之时将几世、几年，虽祇#5去禹之世固已千数百年矣。 其称书之出洛，以比羲之图之出河，於理恶乎而不可？ 长民故为此说，是且、并孔子之《大传》不之信邪。 考图南之为龙图，虽自谓得於孔子三＇陈九卦之旨而作，然其序日：龙图者，天散而示之，羲合而用之，孔默而形之。 且明称始图之未合，惟五十五数，则是谓《大传》天数二十有五，地数三十，合而言之，不知何以於其末改标之以为洛书，殆其始误也。 长民辈乃承误而益增其误，遂真以为洛书，而有五十五图以实其误； 以至泰伯已后，悉以图南标异之五十五数为真洛书也。 不思图南标洛书之始偶谓用十，夫洛书所叔九畴，其十数当何汰而起哉？ 意岂谓《大传》之河、图既可出而示世，则洛书亦可以并出示之，因假《大传》五十五数，托为《书》之九畴乎？ 九畴所言皆用纵比而同之谓五十五数，其用又安在哉？ 此不可之大者也。 故尝因长民之事讨其原，图南之后，种放、许坚、李溉，未及见其他有着述。 若其所亲授之师，如范夸昌所着《太易#6源流》，其称龙马负图出河，羲皇穷天人之际，重定五行生成之数，定地上八卦之体，故老子自西周传授孔子造《易》之原，天一正北，地二正南，天三正束，地四正西，天五中央，地六配子，天七配午，地八配卯，天九配酉，地十配中，寄於末，乃天地之数五十有五矣。 因考其既以图之前五数置於北、南、束、西之正及中，复以后五数配子、午、卯、酉及中，何也？ 夫子、午、卯、酉，非四方之正邪？ 地十配中云寄於末，夫中抑有末邪？ 谛详所置之数，正今图所传有四方而元四维之数者，是夸昌已元不识图南所以标异，特因《太玄》准《易》取於《洪范》一水、二火、三木、四金、五土，而然凿空元故，造端老子，增立怪论，以实图南易置二、七、四、九之位尔，然犹未尝以九畴分配九宫也。 究窍夸昌之取用，不过循纳甲之绪余，及五子归庚之殊向，又谓天上八卦坎、离对中之外移，置乾、兑、坤於束，艮、震、巽於西，不谓五行之说，多起於《易》； 后而反引五行以为定卦之原，此又其敢於创异之大端也。 是宜长民不独增以五十五图，又因夸昌坎、离、震、兑四正之外，而以四成数同於四方，谓坎六退本卦三数，以余三数三画为乾； 离七退本卦三数，以余四数四画为巽； 震八数退本卦三数，以余五数五画为艮； 兑九数退本卦三数，以余六数六画为坤，皆以数为画，标为河图，是不揣本而齐末。 夫八卦各三画，以刚柔生爻，未闻本卦只用三画，而以其余画之多，反分为别卦也。 所陈之数抑配偶然，且以坎、离、震、兑为四象，则尤非也。 象本在未成卦之先，故曰：四象生八卦也。 又云：洛书之九畴，本河图自然之数，虚皇极於中，而以八畴分布四正、四维，五行置於坎一，五事置於坤二，五纪置於巽四，五福置於离九，一以九畴之次叔，陈列於河图之卦次。 夫九畴谓禹次第之者，直自初一、次一不次三、四而以次用之也。 今随河图十五纵横而置之，则成乱次矣。 未暇一一辩诂，且以初一之口五行言之。 既谓五行，自当分配五方，何得以五者限萃一方？",
      "translated_text": "Moreover, it does not acknowledge that Confucius regarded the sage’s model as such. Not only was Fuxi’s time distant by generations and years, but even from Yu’s era, it had already been over a thousand years. To claim the *shu* emerged from the Luo, comparing it to Fuxi’s *tu* emerging from the River—how does this defy reason? Yet Changmin deliberately advanced this argument, thereby even casting doubt on Confucius’ *Great Commentary*. Though Tunan’s *Dragon Diagram* professed to derive from Confucius’ threefold exposition of the nine hexagrams, its preface states: “The *Dragon Diagram* was scattered by Heaven to be revealed; Fuxi assembled and applied it; Confucius silently embodied it.” It explicitly notes that the initial diagram remained unassembled, consisting solely of the fifty-five numbers. Thus, when the *Great Commentary* speaks of the twenty-five celestial numbers and thirty terrestrial numbers combined, how could it later arbitrarily relabel them as the *Luoshu*? This was surely an initial error. Changmin and his followers, however, perpetuated and compounded the mistake, taking it as the true *Luoshu* and substantiating the error with a fifty-five-number diagram. From Taibo onward, all regarded Tunan’s distinct fifty-five numbers as the authentic *Luoshu*. Yet they failed to consider: Tunan initially designated the *Luoshu* as “applying ten”—but where in the *Luoshu*’s nine categories does the number ten arise? Did they perhaps assume that since the *Great Commentary*’s *Hetu* could be revealed to the world, the *Luoshu* might likewise be revealed alongside it, thus appropriating the *Great Commentary*’s fifty-five numbers to fabricate the *Book of Documents*’ nine categories? Yet the nine categories speak of aligning and unifying the fifty-five numbers—where lies their application? This is the gravest of inconsistencies.\n\nI once traced the origins of Changmin’s claims. After Tunan, scholars like Zhong Fang, Xu Jian, and Li Gai left no further writings. As for his direct disciples, Fan Kuachang’s *Origins and Flow of the Great Simplicity* states: “The dragon-horse bore the *tu* from the River; Fuxi exhausted the interplay of Heaven and humanity, redefined the generative and completed numbers of the five phases, and established the forms of the eight trigrams on earth. Thus, Laozi transmitted to Confucius the origins of the *Yijing* from the Western Zhou: Heaven One at due north, Earth Two at due south, Heaven Three at due east, Earth Four at due west, Heaven Five at the center, Earth Six paired with *zi*, Heaven Seven with *wu*, Earth Eight with *mao*, Heaven Nine with *you*, and Earth Ten with the center—lodged at the end—constituting the fifty-five numbers of Heaven and Earth.” Yet why, after placing the first five numbers at the cardinal directions and center, did he then pair the latter five with *zi*, *wu*, *mao*, *you*, and the center? Are not *zi*, *wu*, *mao*, and *you* the cardinal directions? And to say Earth Ten is “lodged at the end”—does the center have an end? A close examination of the assigned numbers reveals that the diagram now transmitted lacks the four corner numbers—proving Kuachang utterly failed to grasp Tunan’s distinctive arrangement. Instead, he arbitrarily followed the *Tai Xuan Jing*’s alignment with the *Yijing*, adopting the *Hongfan*’s sequence of one Water, two Fire, three Wood, four Metal, and five Earth, then fabricated a baseless origin from Laozi, concocting bizarre theories to justify Tunan’s unconventional placement of two, seven, four, and nine. Yet he still did not assign the nine categories to the nine palaces.\n\nKuachang’s innovations merely extended the remnants of the *Na Jia* system and the divergent *Five Sons Return to Geng* method. He further claimed that the eight trigrams of the celestial realm—*kan* and *li* facing the center—were shifted outward, placing *qian*, *dui*, and *kun* in the east, and *gen*, *zhen*, and *xun* in the west. He did not acknowledge that the five phases largely originated from the *Yijing*; later, he reversed course and cited the five phases as the foundation for determining the hexagrams—this was another major instance of his audacious innovations. Thus, Changmin not only added the fifty-five-number diagram but also, following Kuachang’s exclusion of *kan*, *li*, *zhen*, and *dui* from the four cardinals, equated the four completion numbers with the four directions. He argued: *kan*’s six subtracts its trigram’s three numbers, leaving three numbers to form three lines as *qian*; *li*’s seven subtracts its trigram’s three numbers, leaving four numbers to form four lines as *xun*; *zhen*’s eight subtracts its trigram’s three numbers, leaving five numbers to form five lines as *gen*; *dui*’s nine subtracts its trigram’s three numbers, leaving six numbers to form six lines as *kun*—all deriving lines from numbers and labeling this the *Hetu*. This is to ignore the root and force the branches into alignment. Each of the eight trigrams consists of three lines, generating *yin* and *yang* through their interplay—never has it been heard that a trigram uses only three lines while its surplus lines are redistributed to form other hexagrams. The assigned numbers are arbitrarily paired, and to treat *kan*, *li*, *zhen*, and *dui* as the four images is even more erroneous. The images precede the formation of hexagrams, hence the saying: “The four images generate the eight trigrams.”\n\nHe further claimed that the *Luoshu*’s nine categories were the *Hetu*’s natural numbers, with the Supreme Ultimate at the center and the eight categories distributed across the four cardinals and four corners. The five phases were placed at *kan* one, the five affairs at *kun* two, the five regulations at *xun* four, and the five blessings at *li* nine—arranging the nine categories in sequence within the *Hetu*’s hexagram order. Yet the nine categories refer to Yu’s sequential enumeration, proceeding directly from the first one, the second one, without skipping three or four, and applying them in order. Now, aligning them with the *Hetu*’s fifteen vertical and horizontal numbers disrupts the sequence. Without addressing each discrepancy, let us examine the first category, the five phases. If they are indeed the five phases, they should be distributed across the five directions—how can all five be confined to a single direction?",
      "overlap_context": "as the *Luoshu*, but even Chen Tuan’s initial \"Forming the *Luoshu*\" merely stated that \"ten is for application, ten is for completion,\" referring to the *Hongfan*’s enumeration of the five phases’ operational numbers—clearly identifying the *Luoshu* with the *Hongfan*. Unaware of his original intent, Liu and his followers betrayed their teacher’s transmission, asserting the *Luoshu* did not originate in Yu’s time, further confusing later scholars and depriving them of reliable foundations. Why?",
      "start_char": 18827,
      "end_char": 20038,
      "start_sentence": 747,
      "end_sentence": 778,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.641383409500122,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\易图通变.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 18,
      "original_text": "不以推行，恶得谓五行哉？ 以至谓火、金易位j与河图不同，其颠倒迷缪不．可训知若此。 其后杨次公自着《洞极经》，托名於关子明，其叔本篇称子曰：河图之本，七前六后，八左九右，圣人观之以画八卦，是故全七一之三以为离，奇以为巽； 全八之三以为震，奇以为艮； 全六之三以为坎，奇以为乾； 全九之三以为兑，奇以为坤。 正者全其位，偶者尽其画，而谓四象生八卦，此谬#7之尤者。 乾、坤相索而生六子，今为男女者，反能生父母之卦邪？ 况泛言一不七为火，四、九为金，犹可馒所未识者。 今至明言离九为七，兑七为九，是河图一可变置矣而可乎？ 又谓洛书之文，五处其中，九前一后，三左七右，四前左二，前右八后，左六后右，后世稽之以为三象，因而九变之以二十七象。 今按其说，惟五处其中一语，於洛书不悖，余悉河图之数，而河图之数乃因洛书以五处中，而尽失其所以为五之理尔。 《书》之九畴，以皇极之五处中，固元别用，是可以定位也。 至河图之有天五，乃兼地十以为十五，其五乃四分於成数之内而合於十，岂尝有五虚点而实置於图之中位哉？ 图之传误正由此五。 次公之假设此妄例，特以盖其所祖者，乃杨子云三方、九州而二十七部，私以为书耳。 於斯二者，固已真易置图、书矣。 而朱元晦、蔡季通反祖之，信以为关子明作也。 不计子明之《易传》精诣，岂此摹拟者比，乃循此肤臆之见，因扶其说，亦谓河图七前六后，八左九右； 洛书之文，九前一后，三左七右，四前左，二前右，八后左，六后右。 谓《大传》既陈五十有五数，《洪范》又谓天乃锡禹《洪范》九畴，而九宫之数戴九履一，左三右七，二、四为肩，六、八为足，正龟背之象。 刘牧意见以九为河图，十为洛书，托言出於希夷，与诸儒旧说不合； 又引《大传》以为二者皆出於伏羲之世，其易置图、书并元明验。 其朱、蔡之指斥又如此，而直以图南始标误之洛书为河图，而以其初正指河图，反以为洛书，则朱、蔡实自误而反罪长民之先误。 专己自是，张其辩说，不克自反，一至於此。 惟程泰之《易原》时能理到，至郑束卿辈寻迩依傍，一意诞馒，广增图说，皆非实指，徒使后之人失其真是，信其所不当信，疑其所不当疑，并与本来宗旨樊然扰乱，是其所非，而非其所是。 迹究其始，不过由图南用十之一语立一图之误，至於为此纷纷，始犹借河图以相因依，而为洛书之说，久则舍图取书，又久乃遂以书为图，荒然莫知河图为何物，所以有图者，写为何事执其五十五数以为图，不知其五十五数其始特以误及洛书，今及执之为图，是图既非兴； 其谓．书以为图者，书益非其书者矣。 徒自言人人，殊使学者亡羊多歧，求马唐肆，纷如聚讼，吾谁适仄？ 不啻#8三百年於此，故推原致误之由，疏列莘疑之妄，直以河图本数讨正之，庶几学者见之瞭焉，会心自断，知图南之谓其由三陈九卦而得者，类於馒； 阴肠家袭於以一、六、八白取以为起例者，流於末，若《乾凿度》谓太一取其数以行‘四正四维皆合十五者。 《凿》於《纬》之拘赘，亦不尽然。 然从昔儒先莫不断断然谓非人所能伪作者，今以余自本观之，直谓不必它求，特以《说卦》帝出乎震一·一章，环中往复参究之，以天一至地四，地六至天九求其实体，天五与地十明其虚用，则参伍以变，参天两地，错综倚数，莫不左右逢原，一皆胳合乎孔子系《易》之初旨。",
      "translated_text": "How can they be called the five phases if they are not distributed accordingly? Moreover, the claim that fire and metal swap positions, differing from the *Hetu*, reveals such inversion and confusion as to defy comprehension. Later, Yang Cigong composed the *Dongji Jing* under the pseudonym Guan Ziming, wherein this text attributes to the Master the words: \"The original *Hetu* places seven in front and six behind, eight to the left and nine to the right. The sage observed this to draw the eight trigrams. Thus, the whole of seven’s three lines forms *Li*, while its odd line forms *Xun*; the whole of eight’s three lines forms *Zhen*, while its odd line forms *Gen*; the whole of six’s three lines forms *Kan*, while its odd line forms *Qian*; the whole of nine’s three lines forms *Dui*, while its odd line forms *Kun*. The even numbers exhaust their positions, the odd numbers complete their lines—this is said to be how the four images generate the eight trigrams, yet this is the most egregious of errors. *Qian* and *Kun* intertwine to produce the six children; how can what are now called male and female trigrams instead generate the trigrams of their parents? Moreover, to loosely claim that one and seven represent fire, or four and nine represent metal, might still deceive the uninitiated. But to explicitly state that *Li* nine is seven and *Dui* seven is nine is to suggest that the *Hetu*’s numbers can be arbitrarily rearranged—how can this be permissible?\n\nIt further asserts that the *Luoshu*’s pattern places five at its center, with nine in front and one behind, three to the left and seven to the right, four at the front-left and two at the front-right, eight at the back-left and six at the back-right. Later generations examined this and took it as the three images, then expanded it through nine transformations into twenty-seven images. Upon scrutiny, only the phrase \"five at its center\" does not contradict the *Luoshu*; the rest are merely the numbers of the *Hetu*, which, by adopting the *Luoshu*’s \"five at the center,\" entirely loses the principle underlying the five. The *Book of Documents*’ nine categories place the five of the royal standard at the center, fundamentally distinct in function—this can establish their positions. As for the *Hetu*’s \"heavenly five,\" it combines with the \"earthly ten\" to make fifteen, with the five being a quarter of the completed number and merging with the ten. How could there ever have been five empty points actually placed at the center of the diagram? The transmission of the diagram has been misled precisely by this five.\n\nCigong’s fabrication of these baseless examples merely serves to obscure his debt to Yang Xiong’s *Three Regions, Nine Provinces, and Twenty-Seven Departments*, which he privately adopted as his own work. In these two cases, the true *Hetu* and *Luoshu* have already been arbitrarily rearranged. Yet Zhu Xi and Cai Jitong instead revered them, believing them to be Guan Ziming’s work. Without considering that Ziming’s *Commentary on the Changes* is a work of profound insight—how could it compare to such imitations?—they followed these superficial conjectures, bolstering the claims by repeating that the *Hetu* places seven in front and six behind, eight to the left and nine to the right, and that the *Luoshu*’s pattern has nine in front and one behind, three to the left and seven to the right, four at the front-left, two at the front-right, eight at the back-left, and six at the back-right.\n\nThey argued that the *Great Commentary* presents the fifty-five numbers, while the *Hongfan* states that Heaven bestowed upon Yu the nine categories of the *Hongfan*, and that the numbers of the nine palaces—with nine worn on the head and one underfoot, three to the left and seven to the right, two and four as the shoulders, six and eight as the feet—match the pattern of a tortoise’s back. Liu Mu’s opinion, taking nine as the *Hetu* and ten as the *Luoshu*, falsely attributed this to Chen Tuan, contradicting the traditional views of the Confucians. He further cited the *Great Commentary* to claim that both originated in the time of Fuxi, thereby arbitrarily rearranging the *Hetu* and *Luoshu* without verification. Zhu and Cai’s criticisms were thus directed, yet they directly took Tu Nan’s initially mislabeled *Luoshu* as the *Hetu*, while reversing the original correct *Hetu* into the *Luoshu*. In doing so, Zhu and Cai themselves erred and then blamed the earlier mistakes of Zhang Changmin. Insisting on their own correctness and amplifying their arguments, they failed to reflect and reached this extreme.\n\nOnly Cheng Tai’s *Origins of the Changes* occasionally approached clarity. Yet those like Zheng Shuqing, following blindly, further embellished these fantastical claims with additional diagrams, none of which pointed to reality. They merely led later scholars to lose sight of the truth, believing what they should not and doubting what they should not, entangling and confounding the original principles, condemning what is correct and affirming what is not. Tracing the origins of this confusion, it all stems from Tu Nan’s use of the phrase \"one of ten\" to establish a misguided diagram, leading to this proliferation of errors. Initially, they borrowed the *Hetu* to support the *Luoshu*’s theories, but over time, they abandoned the diagram in favor of the book, and eventually, they took the book as the diagram. Thus, the *Hetu* became an indistinct concept—what purpose does the diagram serve, and what does its depiction of the fifty-five numbers represent? They do not realize that the fifty-five numbers initially arose from a misinterpretation of the *Luoshu*; now, clinging to them as the *Hetu* renders the diagram meaningless. As for those who take the *Luoshu* as the *Hetu*, the *Luoshu* is even less what it claims to be.\n\nSuch self-referential arguments have led scholars astray, like sheep lost on branching paths or horses sought in a chaotic market, their disputes as tangled as a clamor of voices—whom should one follow? This has persisted for nearly three hundred years. Thus, by tracing the origins of these errors and exposing the absurdities of these doubts, and by directly correcting them with the original numbers of the *Hetu*, it is hoped that scholars may see clearly, reach their own understanding, and recognize that Tu Nan’s claim of deriving the three arrays and nine trigrams from them is akin to deception. The methods of the diviners who follow the *Yiwei* in using one, six, and eight as white numbers to establish their starting examples are mere trivialities. Even the *Qianzao Du*’s assertion that the Great One takes these numbers to traverse the four cardinals and four corners, all summing to fifteen, is not entirely accurate. Yet from ancient times, scholars have firmly maintained that these were not fabrications by later hands. From my own perspective, there is no need to seek elsewhere: simply examine the chapter in the *Shuogua* that begins, \"The Supreme Deity emerges from *Zhen*,\" and repeatedly investigate its cyclical center. By seeking the true essence from heaven one to earth four and earth six to heaven nine, and clarifying the virtual function of heaven five and earth ten, then through the interplay of threes and fives, the alternation of heaven’s three and earth’s two, and the intricate arrangement of numbers, everything aligns seamlessly with the original intent of Confucius’ *Appended Remarks to the Changes*.",
      "overlap_context": "nine categories refer to Yu’s sequential enumeration, proceeding directly from the first one, the second one, without skipping three or four, and applying them in order. Now, aligning them with the *Hetu*’s fifteen vertical and horizontal numbers disrupts the sequence. Without addressing each discrepancy, let us examine the first category, the five phases. If they are indeed the five phases, they should be distributed across the five directions—how can all five be confined to a single direction?",
      "start_char": 20038,
      "end_char": 21335,
      "start_sentence": 779,
      "end_sentence": 811,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.54989504814148,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\易图通变.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 19,
      "original_text": "是之谓参。 淆乱。 抓论轰明，河之出图，通古不妄，足以见《易》矣。 因洞悉洛之出书一。 汍畴之外，岂复有图有数之妄作者，诚古今之一大快事也。 易图通变卷之五竟 #1『平』，原作一乎』，据四库本改。 #2『禹』，四库本作『语』。 ． #3『祇』，原作一祇J，据四库本改。 #4『非特』，仰库本误把后文自『八畴分布四正、四维』至『是可以定位也』一段倒置於此处之后。 特此说明。 #5『太易』，四库本作『大易』。 #6『谬』，、原作『缪』，据四库本改。 #7『不啻骗原作『不趋』，据四库本改。",
      "translated_text": "This is called the \"Triple Interplay.\" Confusion arises. Yet when the thunderous discourse is clarified, and the River Chart emerges—its transmission through antiquity unerring—it is sufficient to reveal the *Changes*. Thereby, one thoroughly comprehends the emergence of the Luo Book as one.\n\nBeyond the Nine Divisions, how could there still exist spurious fabrications of charts and numbers? This is truly one of the greatest joys of past and present.\n\n*Comprehensive Transformations of the Charts of the Changes*, Scroll Five, concludes.\n\n[Textual Notes:\n1. \"平\" originally written as \"乎\"; emended according to the *Siku* edition.\n2. \"禹\" in the *Siku* edition written as \"语.\"\n3. \"祇\" originally written as \"祇\"; emended according to the *Siku* edition.\n4. The *Siku* edition mistakenly transposes the passage beginning \"The Eight Divisions are distributed among the four cardinals and four corners\" through \"this is how positions are determined\" to follow this section; here clarified.\n5. \"太易\" in the *Siku* edition written as \"大易.\"\n6. \"谬\" originally written as \"缪\"; emended according to the *Siku* edition.\n7. \"不啻\" originally written as \"不趋\"; emended according to the *Siku* edition.]",
      "overlap_context": " that begins, \"The Supreme Deity emerges from *Zhen*,\" and repeatedly investigate its cyclical center. By seeking the true essence from heaven one to earth four and earth six to heaven nine, and clarifying the virtual function of heaven five and earth ten, then through the interplay of threes and fives, the alternation of heaven’s three and earth’s two, and the intricate arrangement of numbers, everything aligns seamlessly with the original intent of Confucius’ *Appended Remarks to the Changes*.",
      "start_char": 21335,
      "end_char": 21588,
      "start_sentence": 812,
      "end_sentence": 826,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.84041953086853,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\易图通变.txt",
        "category": "正统道藏太玄部"
      }
    }
  ]
}