{
  "source_id": "易筮通变",
  "source_file": "chunked_daozang\\易筮通变.json",
  "total_chunks": 15,
  "total_original_chars": 16828,
  "total_translated_chars": 83761,
  "total_translation_time": 409.6422965526581,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏太玄部\\易筮通变.txt",
    "category": "正统道藏太玄部"
  },
  "full_translation": "**The *Yi Shi Tong Bian* (Comprehensive Understanding of Divination through the Changes)**\n\n**Original Author:** Learned Daoist Lei Siqi of Linchuan\n**Three Scrolls**\n*Source Edition:* *Zhengtong Daozang* (Daoist Canon of the Zhengtong Era), *Taixuan* Section\n*Collated with:* *Wenyuan Ge Siku Quanshu* edition, Classics Division, *Yi* Category (hereafter *Siku* edition)\n\n---\n\n### *Yi Shi Tong Bian*, Scroll One\n**Learned Daoist Lei Siqi of Linchuan**\n\n#### On Divination\n\nThe *Hong Fan*’s *\"Ji Yi\"* states: \"Select and appoint diviners, then command them to divine.\" The *Odes* says: \"You divine with milfoil, you divine with turtle—may the omens be without fault.\" And again: \"When divination with turtle and milfoil concur, their words meet in agreement.\" The *\"Monthly Ordinances\"* in the *Records* further states: \"In the first month of winter, the Grand Scribe anoints the turtle and milfoil to divine the auspices of good and ill.\" Thus, turtle and milfoil seem to be mutually indispensable in their use.\n\nThe *Great Commentary* of the *Changes* says: \"To probe the obscure and seek the hidden, to draw forth the profound and reach the distant, thereby resolving the perplexities of the world—nothing surpasses the turtle and milfoil.\" It also states: \"Those who divine with turtle and milfoil esteem their interpretations.\" Therefore, the *Changes* ought to encompass the uses of both turtle and milfoil.\n\nThe *Da Gao* says: \"King Wen bequeathed to me the great treasure-turtle, continuing the luminous mandate of Heaven, and I acted accordingly.\" The *Jin Teng* records: \"He divined with three turtles, and one was repeatedly auspicious.\" Yet in these instances, no mention is made of milfoil divination.\n\nThe *Records* further states: \"The Son of Heaven does not use milfoil divination; the feudal lords have their official diviners.\" And again: \"The Son of Heaven’s Way relies on milfoil divination.\" Here, too, no mention is made of turtle divination. However, the *\"Shuo Gua\"* declares: \"Of old, the sages composed the *Changes*, subtly aiding the numinous and engendering milfoil, measuring Heaven and Earth to establish numbers, observing the transformations of yin and yang to set forth the hexagrams, unfolding the interplay of firm and yielding to generate the lines, harmonizing with the Dao/Way and virtue/power to order righteousness, exhausting principle and fulfilling nature to reach destiny.\" Here, the text exclusively attributes the method to milfoil divination, without ever mentioning turtle divination.\n\nFrom the milfoil, the stalks are commanded, and the use of milfoil divination is expounded in the *Great Expansion*’s numbers with utmost clarity and completeness. Yet turtle divination is not so much as alluded to in a single phrase. Though elsewhere one may find the distinction that \"turtle is for divination, milfoil for casting,\" and though I, from my youth, have often witnessed common divination by tossing coins to draw hexagrams and lines—a practice said to have begun with Jing Fang—and though Jia Gongyan also speaks of using coins for the single, broken, doubled, and intersecting lines of hexagram-casting, and though there are even those who borrow the turtle’s plastron to arrange their coins, and though miscellaneous records speak of \"divining such-and-such a hexagram\" in general terms, and though people commonly refer to \"divining hexagrams\" (卜卦), thereby conflating turtle and milfoil divination as one, I have never given it much thought.\n\nYet I have observed that among the offices of the *Zhou Rituals*’ *\"Spring Offices,\"* the Grand Diviner oversees the three methods of omen-reading: the first is the jade omen, the second the tile omen, and the third the plain omen. The configurations of their omens each number one hundred and twenty, and their incantations total one thousand two hundred. Below him, the Diviner-Masters preside over the opening of turtle omens, while the Turtle-Keepers manage the six turtles, distinguishing them by their directions and colors, as well as by their forms. The Grand Diviner also oversees the three *Yi* systems: the first is the *Lian Shan*, the second the *Gui Cang*, and the third the *Zhou Changes*. Their primary hexagrams each number eight, and their derived hexagrams each number sixty-four. Below him, the Milfoil Diviners preside over the nine milfoil divinations of the three *Yi*, distinguishing good and ill. For all great matters of state, milfoil divination precedes turtle divination. In the first month of spring, they divine for the harvest, and for all state affairs, they perform milfoil divination. Only afterward do they know to use the turtle, inscribing its omens. The configurations and incantations of the omens reach as many as one hundred twenty and one thousand two hundred, whereas the *Changes*’ milfoil divination fundamentally does not exceed the sixty-four hexagrams. Thus, turtle divination is turtle divination, and milfoil divination is milfoil divination—they have never been used interchangeably.\n\nMoreover, the *Hong Fan* clearly distinguishes between \"turtle follows, milfoil follows,\" \"turtle follows, milfoil opposes,\" and \"both turtle and milfoil contradict the person,\" demonstrating that the division between turtle and milfoil divination is stark, their black and white distinct. Yet later explanations of divination have become so confused and chaotic as to reach this extreme, which I find deeply perplexing. Therefore, I have examined cases in the *Zuozhuan* and the like to verify their outcomes, thereby clearly discerning the principles of turtle and milfoil divination.\n\nTurtle divination never invokes the milfoil divination of the *Changes*, nor does milfoil divination ever invoke turtle divination. Here, I set forth the evidence in detail.\n\n#### Cases of Exclusive Turtle Divination Without Milfoil Divination\n\nWhen Duke Hui of Jin was in Liang, the Lord of Liang married him to his daughter. Lady Liang of Liang was pregnant past her term, and they divined with turtle, consulting Zhao Fu and his son. The son said: \"She will bear one boy and one girl.\" Zhao Fu said: \"So it shall be. The boy will be a servant to others, and the girl will be a concubine.\" They named the boy Yu and the girl Qie. Later, when Yu was a hostage in Qin, Qie became a palace woman.\n\nDuke Wen of Zhu divined about moving to Yi. The diviner said: \"It will benefit the people but not the ruler.\" Duke Zhu said: \"If it benefits the people, then let us move. Heaven gave birth to the people and set up a ruler for them to benefit them. If the people are benefited, I will surely share in it.\" After the move, Duke Zhu died.\n\nThe Marquis of Qi set a date for his army’s campaign, intending to attack Lu, but he fell ill. The physician said: \"He will not live to autumn; he will die.\" When Duke Wen of Lu heard this, he divined with turtle, and the omen said: \"He will not live to the appointed time.\" Shu Zhong Huibo commanded the turtle, and the diviner of Chuqiu interpreted it, saying: \"The Marquis of Qi will not live to the appointed time—it is not illness. You, my lord, will also not hear of it, but now the turtle bears fault.\" Later, Duke Yi of Qi was assassinated, Duke Wen of Lu died first, and Huibo also perished.\n\nThe King of Chu and the Duke of She divined with turtle to appoint Ziliang as Prime Minister. Shen Yin Zhu said: \"Auspicious, but it exceeds his aspirations.\" The Duke of She said: \"A royal son serving as Prime Minister—what could exceed that?\" Later, they divined again to appoint Ziguo as Prime Minister.\n\nIn these four cases, turtle divination was never accompanied by milfoil hexagram divination.\n\nThere were also cases of milfoil divination without turtle divination. Bi Wan divined his service in Jin and encountered *Tun* (屯) transforming into *Bi* (比). Xin Liao interpreted it, saying: \"Auspicious. *Tun* firmly enters *Bi*—what greater fortune could there be? He will surely flourish and prosper. Thunder brings earth, the chariot follows the horse, feet settle upon it, the elder brother leads, the mother covers, the masses return—none of the six lines change, uniting to form stability. Secure yet capable of decisive action, this is the hexagram of dukes and marquises. The descendants of dukes and marquises will surely restore their ancestral beginnings.\" Later, when King Tai of Zhou attacked Jin, Tu Fu divined with milfoil and said: \"Auspicious. Crossing the river, the marquis’s chariot will be defeated.\" When asked to explain, he replied: \"This is most auspicious. Three defeats will surely capture the Lord of Jin.\" The hexagram encountered was *Gu* (蠱), and its *xuan* (縣) said: \"A thousand chariots depart thrice; from the remnants of these three departures, the mighty fox is captured.\" The fox in *Gu* must be their lord. *Gu*’s primary trigram is wind, its changing trigram is mountain. The year has reached autumn; we strip its fruit and take its timber. With fruit fallen and timber gone, what awaits but defeat?\" Three defeats later, they reached Han. The Lord of Jin intercepted the Qin army and fought at Hanyuan, where Qin captured the Lord of Jin and returned. When the Lord of Jin attacked Zheng and the Viscount of Chu came to Zheng’s aid, they met at Bi Ling. The Duke divined with milfoil, and the scribe said: \"The warrior is stifled.\" The hexagram encountered was *Fu* (復), and he said: \"The southern state is corrupt; shooting its kingless one, the arrow strikes his eye. The state stumbles, the king is wounded—what awaits but defeat?\" In battle, Lü Qi shot King Gong of Chu in the eye. The king said: \"Heaven has defeated Chu; I cannot remain.\" He then fled under cover of night. When Duke Xian of Jin divined the marriage of Bo Ji to Qin, he encountered *Guimei* (歸妹) transforming into *Kui* (睽). Historian Su interpreted it, saying: \"Inauspicious.\" Its *xuan* said: \"The warrior butchers the sheep, yet there is no blood; the woman carries the basket, yet there is no harvest. The western neighbor demands recompense—it cannot be repaid. *Guimei* transforming into *Kui* still lacks mutual support. Thunder and fire, fire and thunder—this is thunder, this is flame, this is the ruin of Bo Ji. The chariot sheds its shaft, fire burns its banner; it is inauspicious to march, defeat will come at Zongqiu. *Guimei* transforming into *Kui* is the drawn bow of bandits. The niece follows her aunt, six years will pass before reunion; she will flee back to her state and abandon her home.\" The next year, she died at the ruins of Gaoliang.\n\nIn these four cases, milfoil divination produced hexagrams, but there were no further turtle omen texts. Moreover, the *xuan* of the earlier three hexagrams—*Tun*, *Fu*, and *Gu*—were clearly not the words of the *Zhouyi*. The later *Guimei* transforming into *Kui* hexagram’s text was close to the *Zhouyi* but still not identical. From this, one may infer that the *Lianshan*, *Guicang*, and *Zhouyi* shared the same divination method but differed in their *xuan* texts.\n\nThere were also cases where both turtle and milfoil divination were used, each yielding its own text. When Cheng Ji of Lu was about to be born, Duke Huan sent the father of Chuqiu to divine with turtle. He said: \"A son, his name will be You. He will stand at the Duke’s right, mediating between the two altars, and serve as the Duke’s assistant. If the Ji clan perishes, Lu will not prosper.\" They also divined with milfoil, encountering *Dayou* (大有) transforming into *Qian* (乾), and the text said: \"Reuniting with the father, reverence as if before the lord.\" At birth, there was a mark on his hand reading *you* (友), so they named him accordingly. In such cases, both turtle and milfoil divination had their own texts, and the hexagram texts were not those of the *Zhouyi*.\n\nThere were also cases of first turtle divination, then milfoil divination. When Duke Xian of Jin wished to make Li Ji his lady, he divined with turtle, which was inauspicious; then with milfoil, which was auspicious. The Duke said: \"Follow the milfoil.\" The turtle diviner said: \"Milfoil is short, turtle is long—better to follow the long. Moreover, its *xuan* says: 'Devotion turns to betrayal, seizing the Duke’s robe. One whiff of fragrance, one of stench—ten years later, the stench still lingers.' It must not be done.\" He did not listen and established her.\n\nShe gave birth to Xi Qi. Then she secretly plotted against Crown Prince Shen Sheng until he hanged himself, and Xi Qi was established as heir. In the end, Jin fell into chaos.\n\nThere were also cases of first milfoil divination, then turtle divination. The Lord of Wei dreamed at the Northern Palace of a man ascending the tower of Kunwu, his hair disheveled as he cried out: *\"I climb this ruined mound of Kunwu, where melons grow in endless vines. I am Hun Liangfu—how I have deceived Heaven and wronged the innocent!\"* The Lord personally performed milfoil divination, and Xu Mi She interpreted it, saying: \"It will bring no harm.\" The Lord then performed a proper turtle divination, and the *xuan* said: *\"Like a fish peeking at its tail, drifting sideways in the current. A great state from the distant borders will destroy it—annihilation approaches. Seal the gates, block the holes, and perish from behind.\"* In the winter of the tenth month, Jin attacked Wei again, breaching its outer walls. Wei expelled Duke Zhuang and made peace with Jin, whereupon Jin installed Ban Shi, grandson of Duke Xiang, and withdrew.\n\nIn these two cases—whether first turtle then milfoil, or first milfoil then turtle—the milfoil divination had no hexagram texts, while the turtle divination had *xuan*. Yet whether by turtle or milfoil, the outcomes were not aligned but proved the same.\n\nAnother instance: When Duke Xian of Jin divined about attacking the Lirong, Historian Su interpreted the omens, saying: \"Victory, but not auspicious.\" The Duke asked: \"What do you mean?\" He replied: \"The omen reads: *'Clutching a bone in its jaws, fangs turned to treachery. Rong and Xia clash in strife—each claims victory.'* Hence my words. Moreover, I fear there will be mouths to feed, as private ambition swells within the state.\"\n\nThe Duke asked: \"What mouths could there be? The mouths are mine to command—I shall not heed them. Who would dare rise against me?\"\nHe replied: \"If one can sway the people’s allegiance, they will gladly embrace deceit, unaware of how it may be stemmed. Once unleashed, how can it be dammed?\"\nThe Duke did not listen. He attacked the Lirong, conquered them, and brought back Lady Li, ultimately plunging the state into chaos.\n\nIn such cases, divination relied solely on turtle *xuan* without milfoil hexagrams, as recorded in *Discourses of the States*, where the wording still closely aligns with *Zuo’s Commentary*. Yet in *The School Sayings of Confucius*, it is said that Confucius once cast milfoil and obtained the hexagram *Bi* (*Adornment*), his expression turning grim with discontent. Zizhang stepped forward and asked: \"The diviner obtained *Bi*—a auspicious hexagram. Why then does the Master appear displeased?\"\nConfucius replied: \"Because of its *li* (clinging fire). In the *Zhou Changes*, fire beneath the mountain forms *Bi*—a hexagram not of true colors. For substance, black and white should be pure. This *Bi* is not my omen. I have heard that cinnabar and lacquer need no embellishment, nor white jade carving. Why? Because their essence is already full—they require no adornment.\"\n\nLooking at this account, doubts arise. If it claims Confucius himself cast the milfoil, why does Zizhang refer to it as divination? Moreover, the wording does not resemble the *Changes*. The *Image* of *Bi* states: \"*Bi*: The yielding comes to adorn the firm. Dividing the firm above to adorn the yielding below—thus there is slight advantage in proceeding. The patterns of heaven; the civilizing of humanity. Observe the patterns of heaven to discern the changes of the times; observe the civilizing of humanity to transform and perfect the world.\" Why would the Master, who draws on the *Image* for its cultural refinement, reject adornment in milfoil divination alone? Such contradictions are glaring. Thus, I dare not trust *The School Sayings*.\n\nAs for Zuo Qiuming’s inclusion of milfoil divination without turtle in his *Commentary*, such instances are too numerous to list, all interpreted through the *Zhou Changes*. The *Zhou Changes* has endured to this day, its texts universally known. Beyond this single case in *The School Sayings*, turtle divination relied on *gui* omens, while milfoil used hexagrams—never were they confused.\n\nMoreover, the *Rites* confirms that the *Lian Shan*, *Gui Cang*, and *Zhou Changes* form the Three Changes, each with eight primary hexagrams and sixty-four derived ones. Though the *Lian Shan* and *Gui Cang* are now lost, traces remain. How could they resemble later vulgar practices that conflate milfoil divination with turtle divination?\n\nSome argue that the *Book of Changes* survived Qin’s burning of the books because it was entangled with divination and omens. Yet if the Grand Diviner’s *gui* omens numbered one hundred twenty, with a thousand two hundred *song* chants—none of which survive—how could divination texts alone escape the flames?\n\nWhen Emperor Wen of Han journeyed from Dai, he divined and obtained the *Great Horizontal* omen. The *xuan* read: \"*Great Horizontal*, *genggeng*—I shall be Heaven’s king, as Xia Qi brought glory.\" Interpreters said the *Great Horizontal* was the primary horizontal line of the turtle’s pattern, symbolizing the ruler’s earthly mandate. Thus, Han’s early divinations seemed to persist, though later ages lost them. Only when Gao Yang of Northern Qi sought to usurp Eastern Wei did he consult Li Mi, who also cited the *Great Horizontal*, calling it \"the omen of Emperor Wen of Han.\" In my view, Li Mi merely flattered Gao Yang to aid his usurpation. How could such claims be fully trusted?\n\nThe later ages saw no trace of divination texts—why so? Alas! Their structure comprised three hundred sixty lines, and their *song* chants numbered three thousand six hundred in abundance; no wonder they did not survive. Had they endured, who could have mastered them?\n\nHow to demonstrate this? The *Lianshan* and *Guizang* have long vanished from the world, leaving only the *Zhouyi* (*Book of Changes*), whose hexagrams number a mere sixty-four, and whose lines total no more than three hundred eighty-four. Yet through the works and transmissions of the Three Eras and Four Sages, it remains unparalleled in its precision, adaptability, and near-divine application. As for the trigrams and their variations, they are defined solely by their words—hence the profusion of commentaries. But when asked about the specific changes in divination and where they lead, one is met with bewilderment: truly, no one knows what they signify. How then can one speak of the *Yi* with such certainty? It is difficult indeed.\n\nThus, in discussing the impossibility of conflating divination methods, I cannot but sigh deeply over these matters.\n\nThe hexagrams: The sage perceived the traces of the world and modeled them in form, symbolizing their proper correspondences—hence they are called *images*. The sage observed the movements of the world and contemplated their convergence and flow, enacting rituals accordingly. By appending words, he determined fortune and misfortune—hence they are called *lines*.\n\nThe utmost of the world’s traces resides in the hexagrams;\nThe impetus of the world’s movements resides in the words;\nTransformation and裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁 reside in change;\nAdvancing and enacting them resides in penetration.\n\nThus, change and penetration serve to exhaust all advantages; penetrating change serves to complete the pattern.\n\nThe eight trigrams form their array, and the images lie within;\nBy doubling them, the lines lie within;\nHard and soft interact, and change lies within;\nAppending words to them, movement lies within.\n\nThe eight trigrams convey through images;\nThe lines and images speak through circumstance;\nChange and penetration speak through advantage;\nFortune and misfortune shift with circumstance.\n\nIt is also said: The lines and images move within, while fortune and misfortune appear without; achievements manifest through change, and the sage’s intent is revealed in the words.\n\nSince it is said that the impetus of the world’s movements resides in the words, and that appending words to command them places movement within, it follows that appending words determines fortune and misfortune. To discern fortune and misfortune is to rely on the words—thus, words are indispensable to the Dao of the *Yi*.\n\nTherefore, the *Yi* as a book embodies a Dao that shifts repeatedly, never fixed, flowing through the six positions, rising and falling without constancy. Hard and soft alternate, defying rigid principles—only change dictates its course.\n\nHexagrams vary in scale, and words vary in peril or ease. The words, then, each point to their destination.\n\nYet that single character \"之\" (*zhi*, \"to go\") specifically indicates the direction of change and movement. *Yi* means \"change,\" and it is through this that the world’s movements are observed and impelled. Nothing escapes this scrutiny.\n\nThus, the divination of the *Yi* refers to the lines changing and moving, each finding its proper place, becoming such-and-such a hexagram within such-and-such a hexagram. Today, what is called \"the words pointing to their destination\" is termed the \"hexagram’s manifestation.\"\n\nHan Kangbo provided no annotation for this \"pointing to its destination.\" Kong Yingda’s subcommentary states: \"Each points to its destination,\" meaning the words of the lines and hexagrams each specify where their respective line or hexagram is headed. If it heads toward good, the words are good; if toward evil, the words are evil—nothing more.\n\nTo gloss *zhi* as \"to go\" is not incorrect, but to say that the hexagram’s change or the line’s movement is sufficient to clarify where the words lead is inadequate. Let us also illustrate this with the *Zuozhuan*:\n\nIn Chen Jingzhong’s youth, a Zhou historian visited Chen Hou with the *Zhouyi* and divined for him, obtaining *Guan* (Observation) changing to *Pi* (Stagnation)—specifically, the fourth line of *Guan* changing to the fourth line of *Pi*. Thus, the historian pointed to the words of *Guan*’s fourth line: *\"Observe the state’s glory; it is advantageous to be a guest of the king.\"* From this, he knew Jingzhong would replace Chen as ruler.\n\nWhen Duke Wen of Jin welcomed the king, he divined and obtained *Dayou* (Great Possession) changing to *Kui* (Dispersion)—specifically, the third line of *Dayou* changing to the third line of *Kui*. Thus, Bu Yan pointed to the words of *Dayou*’s third line: *\"Auspicious—this is the hexagram of the duke offering sacrifice to the Son of Heaven. Victory in battle followed by the king’s feast—what greater fortune could there be?\"* In *Dayou*’s nine in the third place, the *Yi* uses *xiang* (享, \"offering\") for *heng* (亨, \"smooth\"), though *heng* originally meant *ken* (垦, \"to cultivate\") and later *xiang* (\"offering\").\n\nWhen Cui Zhu of Qi sought to marry Dongguo Jiang, the widow of Tang Gong, he divined and obtained *Kun* (Distress) changing to *Daguo* (Great Exceeding)—specifically, the third line of *Kun* changing to the third line of *Daguo*. The historians all declared it auspicious. When shown to Chen Wenzi, he pointed to the words of *Kun*’s third line: *\"Following the wind, the wind topples the wife—she cannot be taken.\"* Moreover, its *xuan* text states: *\"Distressed by stone, resting on thorns, entering his palace, not seeing his wife—misfortune.\"* He further explained: *\"Distressed by stone\"—to go is not to succeed. \"Resting on thorns\"—what one relies on is harmed. \"Entering his palace, not seeing his wife\"—misfortune, for there is nowhere to return.* Cui Zhu nevertheless married Tang Jiang, and his family was ultimately destroyed by chaos.\n\nWhen Shusun Muzi was born, Zhuang Shu divined for him with the *Zhouyi* and obtained *Mingyi* (Bright Obscured) changing to *Qian* (Modesty)—specifically, the initial line of *Mingyi* changing to the initial line of *Qian*. Shown to Bu Chuqiu, he said: *\"Bright but not yet radiant—it must be dawn.\"* The change to *Qian* corresponds to the crow, hence: *\"Mingyi takes flight.\"* *\"Bright but not yet radiant\"*—hence: *\"Drooping its wings.\"* The image of stirring in the waters—hence: *\"The noble one goes on his way.\"*\n\nWhen the three resides at dawn, hence: *\"Three days without eating.\"* *Li* is fire; fire scorches the mountain and brings ruin. In man, it is speech; speech that brings ruin is slander—hence: *\"There is somewhere to go; the host has words,\"* and those words must be slander. This is the line statement of the initial line of *Mingyi*. In the end, he perished in the chaos of Jian Niu. Not a single divination failed to prove true.\n\nLady Xiang of Wei had no son. When the concubine Chou gave birth to Meng Zhi, Kong Chengzi dreamed that Kang Shu said to him: *\"Establish Wu; I will send Ji’s grandson Yu to assist him, along with the scribe Gou.\"* Scribe Chao also dreamed that Kang Shu said to him: *\"I command your son Gou and Kong Xu Niu’s great-grandson Yu to assist Wu.\"* Scribe Chao met Chengzi and told him. The dreams matched.\n\nWhen Han Xuanzi was in office and making his rounds among the feudal lords, Chou gave birth to a son, whom he named Wu. Meng Zhi’s feet were not sound, and he could not walk well. Chengzi divined for him with the *Zhouyi* and said: *\"Wu will still enjoy the state of Wei and preside over its altars.\"* He encountered *Zhun* changing to *Bi*. He also said: *\"I will still establish Zhi, and he will surely be worthy.\"* He encountered *Zhun*. He showed it to Scribe Chao, who said: *\"Supremely favorable—what limit could there be?\"* Chengzi said: *\"I do not mean he will be the eldest.\"* Chao said: *\"Kang Shu commanded it—can that not be called eldest?\"* Thus *Xian* says: *\"Favorable to establish a lord.\"* *\"Inheritance is auspicious\"*—why establish? Establishment is not inheritance. Both hexagrams say *\"the son shall establish him,\"* and Kang Shu commanded it; both hexagrams informed him. Divination aligned with the dream—this was the method used by King Wu.\n\nHe twice encountered the hexagram statement of *Zhun*, both saying: *\"Supremely favorable.\"* And *Zhun* changed at the initial line, hence to *Bi*. The line statement of the initial line of *Zhun* says: *\"Wavering; favorable to dwell in constancy; favorable to establish a lord.\"* Thereupon they established Wu.\n\nWhen Nan Kuai was about to rebel, he secretly divined and encountered *Kun* changing to *Bi*, which said: *\"Yellow skirts—supremely auspicious.\"* He took it as highly favorable and showed it to Zifu Huibo, saying: *\"If I were to take action, how would it be?\"* Huibo said: *\"I have studied this: if it is a matter of loyalty and good faith, it may succeed; otherwise, it will surely fail. Yellow is the color of the center; skirts are the adornment of the lower; none is the chief of good. If the center is not centered, it does not obtain its color; if the lower is not submissive, it does not obtain its adornment; if the matter is not good, it does not reach its utmost. Without these three, it is not fitting. Moreover, the *Yi* cannot be used to divine peril.\"*\n\nThis was because the fifth line of *Kun* changed to the fifth line of *Bi*, so he interpreted it with the line statement of the fifth line of *Kun*. Nan Kuai ultimately rebelled and perished. Thus, when examining these several cases and investigating the *Commentaries*, one finds many more instances, all explained by the hexagram to which they moved and the line that was activated.\n\nThe hexagram one encounters is the matter of divining change. The *Yi* contains the Dao of the sage—thus, in action, one values its changes; in divination, one values its prognostications. Hence, *\"understanding change is called affairs,\"* and *\"exhausting numbers to know the future is called divination.\"* When divining affairs, there is the hexagram one encounters.\n\nYet the ancients who studied the *Yi* did not do so solely for divination. What the noble one dwells in and finds peace in is the sequence of the *Yi*; what he delights in and plays with are the line statements. At rest, he observes its images and plays with its words; in action, he observes its changes and plays with its prognostications. It is not only in divination that there is the hexagram one encounters. In all matters of the heart, in refining one’s thoughts, in the circumstances one meets, in the intentions one expresses, in extension and analogy—one has never failed to employ its hexagrams.\n\nThe Viscount of Chu besieged Zheng and conquered it. The Jin army came to rescue Zheng. Xun Huanzhi, hearing that Zheng had made peace with Chu, wished to return, saying: *\"If we do not reach Zheng and exhaust the people, what use is it?\"* Sui Wuzi said: *\"Well said.\"* Ying Ji opposed it, and the deputy commander of the central army crossed the river. Zhi Zhuangzi said: *\"This army is in peril.\"* The *Zhouyi* has this in *Shi* changing to *Lin*: *\"The army goes forth with discipline; if not good, it is ominous.\"* This refers to the initial line of *Shi* changing to the initial line of *Lin*.\n\nZheng Youji returned from Chu and told Zizhan: *\"The Viscount of Chu will die. He does not cultivate political virtue but greedily deludes the feudal lords to satisfy his desires—can he long endure?\"* In *Fu* changing to *Yi*, it says: *\"Deluded return—ominous.\"* Does this not refer to the Viscount of Chu? This refers to the top line of *Fu* changing to the top line of *Yi*.\n\nZheng Duke’s son Manman spoke with Prince Boliao, wishing to become minister. Boliao told others: *\"Without virtue yet greedy—this is in the *Zhouyi* in *Feng* changing to *Li*. He will not pass beyond it.\"* This refers to the top line of *Feng* changing to the top line of *Li*. Its line statement says: *\"Abundant is his house, secluded is his family, peering through his door, desolate and without people—three years without seeing them—ominous.\"* Within a year, the people of Zheng indeed killed him.\n\nIn these three cases, they did not go beyond citing the line of the hexagram to which it moved as the reason. As for Cai Mo’s response to Wei Xianzi’s question about the dragon appearing in the suburbs of Jiang, he simply said: *\"The *Zhouyi* has this in *Qian* changing to *Gou*: *'The hidden dragon—do not act.'* In *Tongren*, it says: *'The dragon appears in the fields.'* In *Dayou*, it says: *'The flying dragon is in the heavens.'* In *Guai*, it says: *'The dragon at its zenith has regret.'* In *Kun*, it says: *'Seeing a grass dragon without a head—auspicious.'* In *Kun* changing to *Bo*, it says: *'Dragons battle in the wild.'\"* Though in the images of dragons and the matter of real dragons, there may be inconsistencies in rational inquiry, the six lines he cited from *Qian* and *Kun* were all mutually compared with the line statements of *Qian* and *Kun* in reverse, clarifying the hexagram to which they moved. This is to say that of the sixty-four hexagrams of the *Yi* and their three hundred eighty-four lines, the changes to which they move generally follow this method.\n\nThis suffices to elucidate the words of the *Great Commentary* on the *Yi*: each points to its specific destination, not being established for other purposes, but for the hexagrams themselves. This is precisely how one observes the movements of the world beneath Heaven, contemplates their convergence and interpenetration, and thereby conducts its rituals and decrees, determining fortune and misfortune. Transforming and裁ing it, extending and enacting it—only the direction of change matters. The direction of change refers to the hexagram to which it moves. Thus it is said: \"The movement of line-images arises within; fortune and misfortune manifest without. Achievement and enterprise are revealed through change; the sentiments of the sage are seen in the words.\" Hexagrams have great and small; words have peril and ease. The words, then, each point to their specific destination. Scholars rely on this to carefully observe change and establish hexagrams, leaning on numbers to generate lines. They delve into the profound to reach the utmost refinement, investigate the subtle to grasp the utmost change, and so attain the utmost spirit, harmonizing with the Dao/virtue and ordering through righteousness. They exhaust principle and fulfill nature to reach destiny, their minds encompassing the entire *Yi* in both substance and function—this is the ultimate attainment.\n\n*Yi Divination and the Pervasion of Change, Scroll the First* concludes.\n\n---\n\nThe *Yi* begins with the strokes of yin and yang, where yang’s stroke becomes odd and yin’s stroke becomes even. From the strokes of *Qian*, they divide to form the odd hexagrams *Zhen*, *Kan*, and *Gen*; from *Kun*, they divide to form the even hexagrams *Xun*, *Li*, and *Dui*. Thus it is said: yang hexagrams are odd, yin hexagrams are even; yang hexagrams contain more yin, yin hexagrams contain more yang. Though the odd and even, the few and the many, may seem calculable, they were never originally called nine or six.\n\nWhen the sages created the *Yi*, observing change in yin and yang to establish hexagrams, the Dao/Way of Heaven was called yin and yang; unfolding through hardness and softness to generate lines, the Dao/Way of Earth was called softness and hardness. Thus the *Yi* forms hexagrams with six strokes, dividing yin and yang, alternately employing softness and hardness, with six positions forming a pattern. What is called \"stroke\" and \"position\" refers to the hexagrams and lines. How could there ever have been a division into nine and six?\n\nYet when the strokes and positions of the doubled *Qian* hexagram are all yang-odd lines, the line statements invariably attach \"nine,\" and there is even the precedent of \"using nine.\" When the strokes and positions of the doubled *Kun* hexagram are all yin-even lines, the line statements invariably attach \"six,\" and there is even the precedent of \"using six.\" Moreover, the lines of every hexagram invariably attach \"nine\" or \"six.\" Scholars, habituated to what they have seen and heard, take this as truly being nine and six. From this, the origin of nine and six is no longer questioned—I privately find this strange.\n\nNine and six are numbers. The *Great Commentary* says: \"Exhausting numbers to know the future is called divination; pervading change is called affairs.\" Now, nine and six pertain to the affairs of divination and change. It begins with the alternation of threes and fives, interweaving their numbers. The numbers of Heaven are five; the numbers of Earth are five. The numbers of Heaven sum to twenty-five; the numbers of Earth sum to thirty. Altogether, the numbers of Heaven and Earth are fifty-five, through which transformations are accomplished and the spirits are set in motion—yet they were never originally called nine or six.\n\nFrom the numbers of Heaven—one, three, five, seven, nine—we know their sum is twenty-five. From the numbers of Earth—two, four, six, eight, ten—we know their sum is thirty. When the five positions mutually correspond, each having its pair, the numbers before five are called generating numbers, and those after five are called completing numbers. Thus one pairs with six to signify water; two pairs with seven to signify metal; three pairs with eight to signify wood; four pairs with nine to signify fire; five pairs with the void ten to signify earth. Here, nine and six emerge in their midst, though their use has not yet been made manifest.\n\nThe numbers before the five positions are their generative aspects; the numbers after the five positions are their functional aspects. The generative aspect of the body: Heaven-one, Heaven-three, and Heaven-five are combined to make nine; Earth-two and Earth-four are doubled to make six. Leaning on the numbers of three Heavens and two Earths, three threes make nine, and three twos make six—thus nine and six uniquely initiate their function.\n\nTherefore, one and four are arrayed in fives; two and three are arrayed in fives. Five, when combined, makes five—this is the beginning of the alternation of threes and fives. Then one arrays with five to make six; two arrays with five to make seven; three arrays with five to make eight; four arrays with five to make nine; the void five arrays to make ten. Thus five combines with ten to make fifteen; seven combines with eight to make fifteen; nine combines with six to make fifteen—this is what is meant by \"alternating threes and fives, interweaving their numbers.\"\n\nAll the numbers nine, six, seven, and eight equally attain completion through the completing numbers of Earth, thereby generating the generative numbers of Heaven—this is what is called \"forming images.\" Thus one with five makes six as old yin; two with five makes seven as young yang; three with five makes eight as young yin; four with five makes nine as old yang. Nine, six, seven, and eight are mutually transformed in their use. Though the world knows that the young of yin and yang do not change, while the old do change...\n\nYet what is commonly observed in the diagrams throughout the *Book of Changes*—where the lines of the hexagrams, the odd as yang, are appended below with \"nine,\" and the even as yin, are appended below with \"six\"—obscures the fact that the yang line is fundamentally seven, and the yin line fundamentally eight.\n\nHow is this made clear? The *Changes* means \"transformation\"; \"exhausting numbers to know the future\" is called divination, and \"penetrating transformation\" is called affairs. It is said that the affairs of divination and transformation follow the method of the milfoil stalks: four operations complete the *Changes*, and eighteen changes complete a hexagram. Every three changes accumulate into one line, with four and eight serving as the odd and even. When each set of three changes yields one, four, two, and eight, they form the image of *Zhen* (☳), *Kan* (☵), and *Gen* (☶), all drawn as the odd line (⚊). When each set of three changes yields one, eight, two, and four, they form the image of *Xun* (☴), *Li* (☲), and *Dui* (☱), all drawn as the even line (⚋). This embodies the idea of yin and yang seeking each other to generate the six children. When three changes all yield four, the line is drawn as ⚊ to image *Qian* (☰); when three changes all yield eight, the line is drawn as ⚋ to image *Kun* (☷). The accumulation of one, four, two, and eight into a fixed line is called seven; the accumulation of one, eight, two, and four into a fixed line is called eight—these two are the unchanging ones. Only when three changes yield pure four is it called the extreme of yang odd, the moving line of ⚊, called nine; when three changes yield pure eight, it is called the extreme of yin even, the moving line of ⚋, called six—these two are the changing ones.\n\nAll the fixed lines of odd and even, which are exhaustively listed at the beginning of each hexagram, do not take their movement but specifically mark the body of hardness and softness, remaining unchanged to form the fixed hexagram. As for the changing lines of nine and six, which are intermingled within each hexagram, they are not listed in the diagram but specifically lodge the function of yin and yang, adapting to change and movement to form the hexagram—this is what is meant by \"using nine\" and \"using six.\" The *Qianzao Du* states: \"Yang moves and advances; yin moves and retreats.\" Thus yang takes seven and yin takes eight as their images; yang transforms seven into nine, and yin transforms eight into six.\n\nChao Yuezhi expounded in terms of the Dao: \"In ancient times, the odd and even of hexagram lines represented yin and yang, and the hexagram lines had only six positions without the names seven and eight. Following the milfoil divination of the *Changes*, the old yang changes to nine, the old yin changes to six, the young yang changes to seven, and the young yin changes to eight. The seven and eight of the *Zhou Changes* are the ancient odd and even. When the nine and six of the *Changes*’ divination appear in the hexagram text, they transform accordingly. If all six positions are nine, it becomes *Kun* from *Qian*; if all six positions are six, it becomes *Qian* from *Kun*. This is the example of 'using nine' and 'using six,' which suffices to clarify the matter. What I have seen is universally the same.\n\nNow, what is recorded in the *Zuozhuan* can further elucidate this, and there are instances where one cannot but examine the errors in its annotations. When Lady Mu Jiang of Lu was about to die in the Eastern Palace, she first went and divined, encountering *Gen* changing to eight. The scribe said: \"This is called *Gen* changing to *Sui*.\" \"Following it, the lord will swiftly depart.\" Jiang said: \"Perish. As for the *Zhou Changes*, it says: '*Sui*: origin, prosperity, benefit, and perseverance—no blame.' Origin is the leader of the body; prosperity is the gathering of excellence; benefit and perseverance are the backbone of affairs. Embracing benevolence suffices to lead others; gathering excellence suffices to accord with ritual; benefiting things suffices to harmonize righteousness; being steadfast suffices to manage affairs. Yet this cannot be deceived, which is why even *Sui* has no blame. Now I, a woman, have partaken in disorder—this cannot be called 'no blame.' Not pacifying the state—this cannot be called 'prosperity.' Acting to harm myself—this cannot be called 'benefit.' Abandoning my position and being licentious—this cannot be called 'perseverance.' One who possesses these four virtues may follow *Sui* without blame. I possess none of them—how can this be *Sui*? I will incur misfortune; if I act and bring harm, how can there be no blame? I will surely die in this palace and not depart.\"\n\nThus, this divination of *Gen* changing to eight further confirms that seven and eight are the fixed lines, not the moving lines of nine and six, and the annotation is mistaken. The *Rites of Zhou* states that the Grand Diviner oversees the three *Changes* to perform the nine divinations, namely *Lianshan*, *Guicang*, and *Zhouyi*, saying that their primary hexagrams are all eight, and their derivations are all sixty-four. Though the *Changes* have three names, the divination follows a single method. Taking seven and eight as the body of the hexagram lines and nine and six as the function of the hexagram lines is why it is called *Gen* changing to eight. The changes of *Gen* are: the first line to *Bi* (☷→☲), the third line to *Bo* (☷→☷), the fourth line to *Lü* (☷→☴), the fifth line to *Jian* (☷→☴), and the top line to *Qian* (☷→☶). This clarifies that the divination pertains to the single hexagram *Gen*, where all six lines have already changed except one. The five hexagrams to which it changes are also five. The scribe viewed them indiscriminately, unable to decide on the judgment. Only the second line, being an unchanging yin even, had nowhere to transform, so he reversed the judgment to *Gen* changing to *Sui*.\n\nMoreover, examining the divination, he said: \"*Sui*—following it, the lord will swiftly depart.\" Jiang then self-examined and found nothing to match the virtues of this hexagram. Thus, she said: \"As for the *Zhou Changes*, it says: '*Sui*: origin, prosperity, benefit, and perseverance—no blame.'\"\n\nIn elaborating this interpretation, as stated above—when did he ever cite the *Lian Shan* or *Gui Zang* versions of the *Changes*, let alone perform another divination? Du [You] failed to comprehend the divination method of the *Zhou Changes*. The fundamental lines of yin pairs are but eight, yet he rashly pointed to the two *Changes* [i.e., *Lian Shan* and *Gui Zang*] as using seven and eight for prognostication. Moreover, he claimed that when the scribe hesitated over an *Changes* divination encountering eight, it was deemed inauspicious, and thus resorted to the *Zhou Changes* to assess the changing lines—how grievously mistaken! From today’s perspective, it is abundantly clear that seven and eight constitute the completed lines of a hexagram, not yet named nine or six.\n\nThe *Guo Yu* records that Duke Chong’er of Jin divined whether he would ascend to the rulership of Jin. He obtained the primary hexagram *Zhun* (☳) and the secondary *Yu* (☳→☷), both with eight. Wei Zhao’s commentary explains: In *Zhun*, *Zhen* (☳) is the inner trigram, and its two yin lines remain unchanging; in *Yu*, *Zhen* is the outer trigram, and its two yin lines likewise remain unchanging—hence both are called eight. This serves as evidence. Later, Dong Yin divined again and obtained *Tai* (☰→☷) with eight. Zhao’s commentary notes: *Tai* has no moving lines, and its yin lines remain unchanging, their number being eight—thus all unchanging yin pairs are counted as eight. This further confirms the principle. If unchanging yin pairs are eight, then unchanging yang lines must be seven—this is self-evidently clear.\n\nYet in the entire corpus of the *Changes*, seven and eight are nowhere to be found; only nine and six appear. Scholars blindly follow the usage of \"nine\" and \"six\" in the text, failing to grasp the rationale behind their application. The confusion persists, as previously discussed, because the lines are established for the hexagrams. All instances in the *Zuozhuan* where it states \"hexagram X changes to hexagram Y\" refer to the movement of lines and their transformations, indicating the direction of change. This is what is meant by \"only transformation determines the outcome.\" For the diviner, the prognostication hinges on the reading; for the moving line, the transformation is paramount. The term \"line\" (*yao*) speaks to its mutability. The sage perceived the movements of the world and observed their convergence and flow, thereby instituting rituals. He appended judgments to determine fortune or misfortune—hence the term \"line.\" It signifies the world’s movements, which must not be disordered. Thus it is said: \"The meaning of the six lines is easily proclaimed.\"\n\nUpon close examination, the fixed lines are inherently seven and eight. When they move, seven advances to nine, embodying yang within yin, while eight recedes to six, embodying yin within yang. The *Commentary* on divination and the changing lines of hexagrams consistently adheres to this principle, as clearly demonstrated in Cai Mo’s response to Wei Xianzi’s inquiry about the dragon. It states: \"The *Zhou Changes* contains this in *Qian* changing to *Gou* (☰→☱): 'The hidden dragon—do not act.' In *Tong Ren* (☰→☲), it says: 'The dragon appears in the field.' In *Da You* (☰→☲), it says: 'The dragon soars in the heavens.' In *Guai* (☰→☱), it says: 'The dragon exalts itself—there will be regret.' In *Kun* (☷), it says: 'See the crawling dragon without a head—auspicious.' In *Kun* changing to *Bo* (☷→☶), it says: 'Dragons battle in the wild.'\" This suffices to show that only when seven and eight move and transform do they become nine and six. Otherwise, the lines of *Qian* would uniformly be called nine, with their judgments distributed as \"hidden dragon—do not act,\" and so forth, while the top line of *Kun* would simply state \"dragons battle in the wild.\" Why then enumerate *Qian* changing to *Gou* or *Kun* changing to *Bo* before citing the judgments beneath the original lines of nine and six to illustrate the pattern? Moreover, beneath the \"use of nine\" in the *Qian* hexagram, it states: \"See the group of dragons without a head—auspicious.\" Yet Cai Mo specifically refers to it as *Kun* before interpreting it as such. This demonstrates that the \"use of nine\" as a changing line universally applies without exception, so evident that it requires no further elaboration.\n\nThe reason each line first cites the original hexagram before invoking its judgment is to show that seven’s transformation advances to nine, while eight’s transformation recedes to six. Scrutinizing the *Commentary*, every judgment cited for a hexagram reveals that a line is called nine or six only after seven or eight moves and transforms. Hence the conventions of \"using nine\" and \"using six\"—this is the application of nine and six. From the first to the top line of *Qian*, all must await the movement of yang’s seven before becoming nine; from the first to the top line of *Kun*, all must await the movement of yin’s eight before becoming six. As Chao [Yuezhi] stated: When nine and six appear in the lines of a hexagram, all six positions changing to nine becomes *Qian* changing to *Kun*, while all six positions changing to six becomes *Kun* changing to *Qian*. The *Qian Zaodu* reiterates this: \"Yang moves and advances, transforming seven into nine, symbolizing the growth of qi; yin moves and recedes, transforming eight into six, symbolizing the waning of qi.\" It further states: \"*Qian* wanes through thirty-two generations, *Kun* waxes through thirty-two generations.\" Thus the *Great Commentary* of the *Changes* says: \"Are *Qian* and *Kun* not the gateway of the *Changes*?\" All vessels (*min*) arise from the gateway of *Qian* and *Kun*. Every hexagram follows this pattern to achieve coherence, and only through transformation do lines acquire the names nine and six. Therefore, the \"use of nine\" and \"use of six\" appear exclusively in *Qian* and *Kun*, not in other hexagrams. The vessels are not established solely for *Qian* and *Kun*; the emperor applies their principles universally to all hexagrams.\n\nThus, in divination practice, when none of the six lines change, the judgment is made according to the *Image* statement of the original hexagram. When five lines change and only one remains unchanged, the judgment is made according to the *Image* statement of the unchanging line in the resultant hexagram, rather than its line statement, for since the line does not move, it cannot be named nine or six.\n\nOuyang Yongshu asked: \"*Qian* says 'use nine,' and *Kun* says 'use six'—what does this mean?\" The answer: \"It explains why seven and eight are not used.\" In *Qian*, the lines are seven and nine, and nine transforms; in *Kun*, the lines are eight and six, and six transforms. The *Changes* employs transformation for divination, hence naming the lines accordingly.\n\nZhu Yuanhui greatly praised this explanation, adding: \"*Qian* and *Kun* use nine and six—what does this mean?\" The answer: \"In *Qian*, the lines are seven and nine; in *Kun*, they are six and eight. Nine and six transform, while seven and eight remain unchanging. The Dao of the *Changes* divines by transformation, thus naming the lines for the diviner, not because all six lines are nine or six. In divination, sevens and eights are commonly numerous, while nines and sixes are few. When no nine or six appears, it must still be explained. This holds true for all sixty-four hexagrams, though it is only explicitly stated in *Qian* and *Kun*—the rest may be inferred. Moreover, this explanation clarifies what earlier scholars had not reached, making it most valuable.\"\n\nThe observation that sevens and eights are many while nines and sixes are few also reflects the divination method of his time, where three changes determined the hexagram, as described by Yixing. Yet in my humble view, Zhu’s account only echoes the explanations of Ouyang and Chao, which Zhu himself may not have seen. As for works like the *Qianzao Du*, scholars dismiss them as *Apocrypha of the Changes*, not only ignoring them but even refusing to read them, unaware of their value for reference. Comparing ancient and modern views, one finds that while some insights align without seeking agreement, all fall short of explaining the *reason* for nine and six.\n\nTake the *Zuozhuan*, which records hexagrams and their verifications, treating the *Changes* as lacking concrete affairs and thus preserving detailed accounts. Yet when Chao examined the hexagrams and saw nine and six but not seven and eight, he merely raised doubts, not truly understanding nine and six.\n\nCarefully considering the *Shuogua*: \"In ancient times, the sages created the *Changes*, assisting the numinous and bright to generate the milfoil stalks\"—this clearly establishes the method of divination. \"They reckoned by thrice heaven and twice earth, relying on numbers\": multiplying three thrice yields nine, corresponding to heaven (*Qian*’s \"use nine\"), and multiplying two thrice yields six, corresponding to earth (*Kun*’s \"use six\"). Thus begins the use of nine and six.\n\n\"Observing changes in yin and yang to establish hexagrams\" refers to what is called: \"The Dao of heaven is yin and yang; the Dao of earth is soft and hard; the Dao of humanity is benevolence and righteousness.\" Combining the Three Powers and doubling them, the *Changes* forms hexagrams with six lines, clearly marking the odd and even at the hexagram’s head. The unchanging lines are fixed as seven and eight.\n\n\"Expressing through hardness and softness to generate lines\": lines differ from positions. Before changing, a moving line is called a position; once moved and transformed, it becomes a line. Thus, the *Changes* forms patterns with six positions. These six positions in a hexagram, from bottom to top, divide yin and yang, alternately employing hardness and softness. They do not remain fixed but circulate through the six voids, with no constant above or below. Hard and soft replace each other, following only where change leads. Some reckon by heaven and become nine; some reckon by earth and become six. \"Use nine\" and \"use six\" are how nine and six transform within each line, thereby generating the resultant hexagram. What doubt can there be about nine and six?\n\nThe sages perceived the traces of the world and its movements, modeled them in form, observed their convergence and communication, and struck forth words to determine fortune or misfortune. Thus, they formed patterns. Their words in the *Changes* are simple yet principle-laden, illuminating for all under heaven and later generations. Yet scholars grasp only the names, not the reality, following them all their lives without understanding. Doubts give rise to explanations, each claiming unique insight and setting forth their own theories—how lamentable!\n\nTherefore, I have here particularly expounded upon this.\n\n*Yi Shi Tong Bian*, Volume Two, concludes.\n\n**Emendations:**\n1. \"进\" (originally \"确\")—corrected per the *Siku Quanshu* edition.\n2. \"卦文\" (*Siku Quanshu* reads \"卦爻\").\n3. \"门焉\" (originally \"为\")—corrected per the *Siku Quanshu* edition.\n4. \"穆姜\" (originally \"穆华\")—corrected per the *Siku Quanshu* edition.\n\n---\n\n**Yi Shi Tong Bian, Volume Three**\n*Studied and Expanded by Daoist Lei Siqi of Linchuan*\n\n**Derivation of Numbers**\n\nThe numbers of heaven and earth total fifty-five: the heavenly numbers—one, three, five, seven, nine—sum to twenty-five, while the earthly numbers—two, four, six, eight, ten—sum to thirty. Ought this not be so? Yet it is emphatically impossible to add or subtract from them, yet the *Great Expansion*’s number abruptly reduces by five, calling it specifically fifty. Thus, seeking its principle yields no answer, verifying its sum brings no accord, and none can grasp its origin. People all offer explanations, each claiming semblance of reason, yet none ever attain its true essence—such was the case in antiquity as it is today.\n\nThe *Liezi* is a text Confucians dismiss through rote transmission, refusing to accept or even examine it. Yet its opening chapter states: \"The sages governed heaven and earth through yin and yang.\" If form arises from the formless, whence do heaven and earth originate? Thus it says: There is *Taiyi* (Grand Simplicity), *Taichu* (Grand Beginning), *Taishi* (Grand Commencement), and *Taisu* (Grand Simplicity of Substance). *Taiyi* is that which has not yet manifested qi; *Taichu* is the beginning of qi; *Taishi* is the beginning of form; *Taisu* is the beginning of substance. When qi, form, and substance are complete yet undifferentiated, it is called *hunlun* (chaotic wholeness). *Hunlun* signifies the myriad things intermingled and undivided—hence it is called *yi* (change). *Yi* transforms into *One*, and *One* is the beginning of form’s transformation.\n\nThis doctrine reappears in the *Qian Zaodu* of the *Yi Wei*, which likewise affirms it. From this perspective, the *Yi*’s *Taiji* (Supreme Polarity) is but a borrowed term for *hunlun*. Above *hunlun*, there are four designations—*yi*, *chu*, *shi*, and *su*—and with *hunlun* itself, five in total. Thus, *hunlun* is called *Taiji*, forming the \"Five Ultimates.\" Here, *Taiji* already contains these five within it. Therefore, while the numbers of heaven and earth total fifty-five, the *Great Expansion*’s number is fifty, having voided the five above *Taiji* to employ the marvel of fifty.\n\nThe *Great Commentary* states: \"Generation upon generation is called *yi*; forming images is called *Qian*; modeling patterns is called *Kun*; exhausting numbers to know the future is called divination; penetrating change is called affairs; the unfathomable of yin and yang is called the numinous.\" This is precisely its meaning. From this, we know the *Yi*’s *Taiji* as *One*, and *One* as the beginning of form’s transformation.\n\nYet while the *Yi* is said to have *Taiji*, it is also called \"generation upon generation is *yi*,\" immediately followed by \"forming images is *Qian*\"—without mention of *Taiji*. Why? This is because those who fail to comprehend the *Yi* do not grasp that it fundamentally unites yin and yang, while *Taiji* is merely the convergence of their transformations. Thus it is said: \"*Yi* transforms into *One*, and *One* is the beginning of form’s transformation.\" The *Yi* establishes *One* through *Taiji* to signify \"forming images is *Qian*,\" which is the beginning of form’s transformation—hence it is called *One*.\n\nFrom *Qian*, *One* divides into *Two*, thereby initiating *Kun*. The unused one in the *Great Expansion*’s fifty symbolizes the *Yi*’s *Taiji*. Its division into *Two* represents the Two Modes. That *Two* is not called \"two\" but \"symbolizing the Two Modes\" precisely reflects *One*’s division. Thus, in the *Great Expansion*’s fifty, the unused *Taiji* is first revered as the root of generation. The use of forty-nine arises from *One*’s division into *Two*: one generates the Two Modes, splitting into two to symbolize them. Then, one is further apportioned to embody the Way of the Three Powers, suspending one to symbolize the Three. One is again divided into the Four Images, establishing the distinctions of north, south, east, and west; the sequence of winter, summer, spring, and autumn; and the positions of water, fire, wood, and metal—all manifesting through this. Thus, the fourfold division to symbolize the four seasons corresponds to the *Hetu*’s number of forty.\n\nYet the numbers of heaven and earth total fifty-five, while the *Great Expansion*’s number is fifty. Heaven’s five has no position among the Four Images, and earth’s ten has no place in the Eight Trigrams—why such stark discrepancy? Heaven’s five, though numbered, lacks a position: the ancient form of \"five\" (五) resembles intersecting lines (×), while its modern form (五) reveals yin-yang’s alternation within *Two* to constitute five, with ten’s form also prefigured here. Five is inherently earth, and earth’s character (土) is ten and one—beginning with one, centering on five, culminating in ten, and returning to one. Earth also lacks a fixed position, hence the Four Images exclude five, and the Eight Trigrams exclude ten.\n\nI have long pondered the origin of heaven and earth’s fifty-five. The Four Images’ one, two, three, and four generate the Eight Trigrams by reapplying one, two, three, and four, each augmented by five to become six, seven, eight, and nine—totaling forty-eight. The trigrams’ one and nine, two and eight, three and seven, four and six intersect, and their sums likewise total forty, never assigning fixed positions to heaven’s five or earth’s ten. Precisely because heaven’s five and earth’s ten multiply to form the *Great Expansion*’s fifty.\n\nHow to elucidate this? The marvelous function of five and ten: pairing the one of Kan in the north with five to form six, yielding Qian in the northwest; pairing the three of Zhen in the east with five to form eight, yielding Gen in the northeast—here, the cardinal directions take precedence, the oblique positions follow. Pairing the two of Kun in the southwest with five to form seven, yielding Dui in the west; pairing the four of Xun in the southeast with five to form nine, yielding Li in the due south—here, the oblique positions take precedence, the cardinal directions follow. Thus, yang’s odd numbers gain five to become yin’s even numbers, and yin’s even numbers gain five to become yang’s odd numbers, by which yin and yang are divided and the Eight Trigrams arrayed.\n\nAs for the function of ten: multiplying the nine of Li in the south to pair with and exchange ten for the one of Kan in the north—yang numbers self-exchange within yang, each establishing its cardinal direction. Multiplying the seven of Dui in the west to pair with and exchange ten for the three of Zhen in the east—yin numbers self-exchange within yin, each settling into its oblique position. Leaving five vacant at the center, all become variations of fifteen. Thus, hardness and softness grind against each other, the Eight Trigrams surge and interlock, transforming and flowing, extending and enacting—revealing the singular function of heaven’s five and earth’s ten.\n\nTherefore, in divination with milfoil stalks, four must be used to symbolize the four seasons. The function of five and ten lies precisely here. The reason for manipulating them with four is this: five unites the one, two, three, and four above, while ten unites the six, seven, eight, and nine below. This clarifies how five, combined with heaven’s one, forms six—four times six makes twenty-four, the count for old yin Kun; five combined with earth’s two forms seven—four times seven makes twenty-eight, the count for young yang Zhen, Kan, and Gen; five combined with heaven’s three forms eight—four times eight makes thirty-two, the count for young yin Xun, Li, and Dui; five combined with earth’s four forms nine—four times nine makes thirty-six, the count for old yang Qian. Thus, the unchanging seven and eight of young yin and yang combine to make fifteen, forming the lines of the hexagrams; the changing nine and six of old yin and yang also combine to make fifteen, forming the moving lines of the hexagrams. The *Changes*’ transformations correspond to the four seasons, hence four times four stalks are used to symbolize them. The four operations complete the *Changes*—none do not proceed from this.\n\nThe *River Diagram*’s solid numbers total forty, omitting heaven’s five and two fives, yet using earth’s ten to derive fifty. Now, the four operations complete the *Changes*, and four times four stalks are counted. For each line, the stalks are counted three times, and the milfoil is combined with the left and right remainders—sometimes one and three make four, sometimes three and one make four, sometimes two and two make four. If the left remainder first reaches four, the right remainder must also subsequently reach four. Doubling the four pairs to make eight records the count, for odd numbers must have even counterparts. Odd numbers make four, even numbers make eight—this also shows how the count of forty increases by eight, for the *River Diagram*’s forty completes the Eight Trigrams.\n\nYet among the counted fours, five and nine never appear. Now, those who manipulate milfoil stalks insist that the first count must be either five or nine, originating from the *Yi Shu*, which states: the first change’s remainder must be either five or nine; the second and third counts’ remainders must be either four or eight. The error in the first count arises from including the \"hanging one\" stalk—still uncounted—within the total, thereby disrupting the four. For the counted remainders, adding one to four makes five, and adding one to eight makes nine—this is how it appears. Yet they fail to recognize that this added one, whether five or nine, fundamentally disrupts the counted four, causing nothing but confusion.\n\nMoreover, \"hanging one\" is itself one of the four operations, occurring after the division symbolizing the Two and before the counting by fours—it has not yet been included in the counts. Were it not for the error of misplacing the \"hanging one\" within the counts, how could they claim that the second and third counts must be either four or eight? Each alternation of left and right counts of four constitutes one change. The *Commentary* states that eighteen changes complete a hexagram, so all counts in the changes must not differ—how can the first count in every three counts be either five or nine? If so, then among the eighteen changes, six would be distinct. If six changes alone differ, how can they still be called eighteen changes?\n\nThis error originated with Kong’s *Subcommentary*, and later scholars, failing to examine it closely, transmitted belief and doubt alike, growing ever more entangled, until none could correct the mistake—truly a lamentable oversight across a thousand years. If they claim that the \"hanging one\" is included in the odd numbers to serve as a count, then what of the \"hanging one\" performed after the operation? Tracing the source of the error, they clung to the derived number fifty, whose use is forty-nine, insisting that the \"hanging one\" is included within the forty-nine stalks used, unaware that the \"hanging one\" marks the use of forty-eight stalks in each change and calculates the total of eighteen changes—this is its true function. How could the one disrupt the many counts of forty-eight?\n\nThus, the yarrow stalks manipulated in each change number forty-eight, and the \"hanging one\" serves to record the eighteen changes—this is precisely how the forty-nine stalks are employed, combining with the one unused at the inception of the Great Ultimate to form the fifty of the *Dayan*. The reason fifty is called such lies in the virtue of the yarrow, which is round and spirit-like: its roundness is expressed in sevens, and seven sevens make forty-nine. The virtue of the hexagrams is square and knowing: their squareness is expressed in eights, and eight eights make sixty-four. Thus, the union of seven and eight—fifteen—is already manifest in the numerical interplay of yarrow and hexagrams.\n\nThe meaning of the six lines, which alternate to offer tribute, disperses and appears separately in the *Xian* hexagram’s \"nine in use\" and the *Kun* hexagram’s \"six in use,\" where the sum of nine and six—fifteen—is employed, while the numbers five and below, along with seven, eight, nine, and six, remain unused. Therefore, multiplying ten by five yields the *Dayan*’s fifty. In this way, from heaven and earth, from one to ten, the number fifty-five reveals its true manifestation, and the *Dayan*’s fifty, along with its use of forty-nine, are likewise thoroughly examined in their essence.\n\nHere, the ceaseless generation of the *Yi*, the formation of images in *Qian*, the emulation of *Kun*, the divination that exhausts numbers to foresee the future, and the affairs of universal transformation—all become perfectly clear. As for the unfathomable interplay of yin and yang, called the spirit-like, \"only the spiritually enlightened can preserve its clarity\"—this depends on the individual.\n\nThe *Shuo Gua* states: \"In ancient times, the sages created the *Yi*, subtly aiding the spirit-like to generate the yarrow, measuring by three heavens and two earths to establish numbers, observing changes in yin and yang to erect hexagrams, and unfolding through hardness and softness to produce lines.\" If so, how could the yarrow arise idly? How could numbers be established in vain? How could hexagrams be erected casually? And how could lines be formed without purpose? Through lines, hexagrams are drawn; through hexagrams, numbers are divined; through numbers, yarrow is employed—to exhaust the traces of the world and to stimulate the world’s movements, this is their sequence.\n\nThe *Great Commentary* says: \"The virtue of the yarrow is round and spirit-like; the virtue of the hexagrams is square and knowing; the meaning of the six lines is to alternate and offer tribute.\" This is how the *Dayan*’s numbers are manifested in the yarrow. The *Dayan*’s number reaches fifty stalks, yet only forty-nine are used—this is because one is revered as unused, embodying the complete form of the Great Ultimate, which is what is meant by \"the *Yi* possesses the Great Ultimate.\"\n\nThen, the forty-nine stalks are divided, arranged left and right into two to symbolize the Two Modes—this is \"the Great Ultimate generates the Two Modes.\" The Two Modes are yin and yang; when yin and yang mutually model each other with elder and younger, the Two Modes already contain the Four Images. Next, one stalk is taken from the left and \"hung\" to symbolize the Three—the trigrams are formed by three strokes, embodying the Dao of the Three Powers. Adding the unused one from the original fifty, combined with the two from the divided pair, completes this Three. Thus, in dividing the two, one is set aside and \"hung\" between them, symbolizing the establishment of the human pole between the Two Modes.\n\nHere, \"measuring by three heavens and two earths\" is subtly embedded: the unused one symbolizes the two, and the \"hanging one\" makes three—this is \"measuring by three heavens.\" Dividing to symbolize the two is indeed \"measuring by two earths.\" From this, changes in yin and yang are observed to erect hexagrams. The unused one of the Great Ultimate, though not employed, marks the inception of *Qian*’s yang with the first one, so its use ultimately arises from this.\n\nTherefore, *Qian*’s one is divided to form *Kun*’s two—this is \"symbolizing the Two to become the Two Modes.\" With the Two Modes, one yin and one yang, elder and younger occupy their positions, so the Two Modes already contain the Four Images. Following this, the \"hanging one\" symbolizes the Three, dividing yin and yang, alternating softness and hardness in use, and drawing with the Three—thus the Four Images generate the eight trigrams, and the eight trigrams are fully arrayed. Each of the eight trigrams has three positions, and with eight trigrams, a minor completion is achieved—the Dao of the Three Extremes is thereby revealed.\n\nTaken together, this is: \"The *Yi* possesses the Great Ultimate, which generates the Two Modes; the Two Modes generate the Four Images; the Four Images generate the eight trigrams\"—this is manifest in use and complete in form. However, the application of the *Dayan*’s numbers, though briefly seen in the initial division of two and \"hanging one,\" is not yet fully realized.\n\nMoreover, the unused one of the Great Ultimate, the two symbolizing the Two Modes, and the three of the \"hanging one,\" though arrayed in three positions, in actual use, only the unused one and the \"hanging one\" are employed—thus, the true count is merely two. Since fifty stalks begin with the use of two, the unused stalks remain forty-eight, corresponding to the *Hetu*’s number forty, which operates the eight trigrams. Each of the eight trigrams has six positions; with eight trigrams, each having six positions, is this not forty-eight? Though the eight trigrams multiply to sixty-four, the sixteen \"wandering\" and \"returning\" hexagrams are not listed among the six positions of the eight primary trigrams, so their number is limited to forty-eight.\n\nFrom forty-eight, the sixteen hexagrams are abstracted above as four sets of four for the purpose of manipulation, thereby completing the sixty-four. Thus, observing changes in yin and yang to erect hexagrams, one then unfolds through hardness and softness to generate lines. Lines are what imitate the world’s movements. The Dao of heaven is established as yin and yang; the Dao of earth as softness and hardness; the Dao of humanity as benevolence and righteousness. Combining the Three Powers and doubling them, the *Yi* forms hexagrams with six lines.\n\nPreviously, the unused one, the two of images, and the three of \"hanging one\" were each multiplied by three, and from three to four, thus first dividing the left stalks. These were counted by fours to symbolize the four seasons, for just as the four seasons yield the eight solar terms, so too do the four images generate the eight trigrams. Therefore, by proceeding from four to eight, one sufficiently perceives the four-by-four of the sixteen hexagrams and the eight-by-eight of the sixty-four hexagrams in their imperial use. The odd numbers of the four-by-four serve to lodge the odd numbers of Qian’s eight-by-eight, while the odd numbers of Kun’s eight-by-eight, though termed even, are also odd. The four are harmonized in their pairing, hence they are collectively called \"returning odd.\" The odd numbers from the counting may be one or two, three or four, and their return is thus termed \"returning odd to achievement\" to symbolize intercalary months. Intercalary months are where surplus numbers return, hence the odd symbolizes the odd as surplus. Then, dividing the right stalks, counting by fours, the odd numbers from this counting may be four or eight. If one is obtained, the prior odd from the left must be combined with three to make four; if three is obtained, the prior odd from the left must be combined with one to make four. If two is obtained, the prior odd from the left must likewise be combined with two to make four; if four is obtained, the prior odd from the left must be combined alone with four to make eight. For whether the left is first one and the right three, or the left first three and the right one, they invariably combine to make four as odd. Yet when the left is first two and the right two, though they also combine to make four, in principle this doubles four to form the even eight. If the left odd is already four and the right odd is also four, their combination makes eight as even. Though termed eight, this even is formed by the distribution of odd fours. Just as Kun’s one is derived from Qian’s one, they are collectively termed odd. Then, after combining the odd from the right and the odd stalks, they are again applied to the left, and the odd from both left and right are \"hung\" to await the second and third changes—this is called \"repeated manipulation before hanging.\" However, the initial \"hanging one\" refers to taking one stalk from the forty-nine to hang separately during this manipulation, whereas the later \"hanging\" specifically means hanging the odd stalks. Then, summing the previously divided two, the already \"hung\" one, and the stalks already counted, all are recombined to return to the initial *dayan* number—this is called \"four operations to complete the *Yi*,\" thereby forming the first line. The so-called four operations are: dividing into two, the first; hanging one, the second; counting by fours, the third; and concluding the return of the odd, the fourth. Once these operations are complete and the odd stalks are hung, the first change is concluded. After one change, excluding the previously odd stalks, the stalks combined from the prior *dayan* counting are again subjected to the operations of dividing into two, hanging one, counting by fours, and returning the odd. Then the odd stalks are hung to combine with the odd from the prior change, awaiting the third change. The third change follows the same operations of dividing into two, hanging one, counting by fours, and returning the odd as the first and second changes. Combining the odd stalks from these three changes and counting them, four is considered few and eight many. If all three changes yield few, the odd stalks total twelve, leaving thirty-six from the counted stalks, which is Qian’s number. If all three changes yield many, the odd stalks total twenty-four, leaving twenty-four from the counted stalks, which is Kun’s number. If two are many and one few, the odd stalks total twenty, leaving twenty-eight from the counted stalks, which are the numbers of Zhen, Kan, and Gen. If two are few and one many, the odd stalks total sixteen, leaving thirty-two from the counted stalks, which are the numbers of Xun, Li, and Dui. Only after three changes are thus completed is one line formed. The odd numbers must be recorded from beginning to end, from bottom to top, layer by layer, like the three lines of a trigram. Here, four is yang and eight is yin, modeled after the eight trigrams. For those with two many and one few: if the sequence is first four, middle eight, last eight, the initial yang is obtained, symbolizing the lesser yang seven of Zhen; if first eight, middle four, last eight, the middle yang is obtained, symbolizing the lesser yang seven of Kan; if first eight, middle eight, last four, the upper yang is obtained, symbolizing the lesser yang seven of Gen. For those with two few and one many: if the sequence is first eight, middle four, last four, the initial yin is obtained, symbolizing the lesser yin eight of Xun; if first four, middle eight, last four, the middle yin is obtained, symbolizing the lesser yin eight of Li; if first four, middle four, last eight, the upper yin is obtained, symbolizing the lesser yin eight of Dui. Whenever Zhen, Kan, or Gen are encountered, a yang line is drawn; whenever Xun, Li, or Dui are encountered, a yin line is drawn. These are all termed \"lesser\" because the lesser has not yet transformed. Only when the three changes collectively yield four, and four-by-four, is this specifically termed the pure yang, symbolizing the old yang nine of Qian, and drawn as a solid line—commonly called \"double,\" representing the old yang nine. When the three changes collectively yield eight, and eight-by-eight, this is specifically termed the pure yin, symbolizing the old yin six of Kun, and drawn as a broken line—commonly called \"intersecting,\" representing the old yin six. Qian as old yang originally possesses nine odd numbers yet transforms to contain the even six of yin. Kun as old yin originally possesses six even numbers yet transforms to contain the odd nine of yang.\n\nThe drawings of Qian and Kun are collectively termed \"old\" because it is by virtue of their age that they transform. That three changes must occur to complete a single line embodies the deliberation of yin-yang transformation to determine it. Among the counting rods left after three changes, the interplay of four and eight embodies the intent of Qian and Kun mutually seeking to generate the six children. Thus, through division, suspension, and manipulation—first accumulating the odd counts and then combining the surplus from repeated manipulations—three such operations are called \"three changes,\" which complete one line. Another three changes complete a second line, and yet another three changes complete three lines—this is called \"nine changes.\" When nine changes are complete and three lines are fully formed, these may correspond to the eight trigrams, which consist of only three lines. Tripling these three lines yields the eight trigrams in array. This is called the inner trigram, the lower trigram, the three subtle signs, or the inner constancy—here, the eight trigrams are said to be \"minor completion,\" as the three *Yi* texts all refer to the eight primary trigrams.\n\nThen, again through division, suspension, and manipulation—first accumulating the odd counts—three times three operations make nine changes, completing another three lines to form the outer trigram, the upper trigram, the three milfoil stalks, or the outer regret. Combined with the previous three lines from nine changes, this yields six lines to form a hexagram, which the three *Yi* texts refer to as the sixty-four distinct hexagrams. Only when all eighteen changes are complete is the hexagram fully formed, with its six positions fully expressed. The reason there must be eighteen changes is that Zhen, Kan, and Gen each require five lines, totaling fifteen, plus three from Qian, making eighteen. Alternatively, the first, third, and fifth lines of the two Qian hexagrams also total eighteen. Xun, Li, and Dui each require four lines, totaling twelve, plus six from Kun, making eighteen. Alternatively, the first, second, and fourth lines of the three Kun hexagrams also total eighteen. Combining these two eighteens yields Qian’s count of four nines—thirty-six. In the first nine changes, each line involves four manipulations, so nine changes accumulate thirty-six manipulations. Doubling this gives seventy-two, the count of tortoise-shell divination. The earth phase of the Five Agents governs the four seasons, each with eighteen days; four times eighteen also makes seventy-two days. Dividing each ninety-day season to include the earth’s eighteen-day reign also yields seventy-two. Thus, eighteen changes, with four manipulations per change, total seventy-two manipulations. Five times seventy-two makes three hundred sixty, corresponding to a full year’s days. Hence, the significance of eighteen changes and seventy-two manipulations in using the forty-nine milfoil stalks.\n\nThe first nine changes divide the three lines into yin and yang, merely arranging the eight trigrams in order with their images at the center. The latter nine changes interweave the three lines with softness and hardness, thereby doubling them to place the lines at the center. Through these eighteen changes, the lines alternate between softness and hardness. Using this interplay of soft and hard to mutually grind, agitate, push, and transform, their changes are made manifest. Extending this to the sixty-four hexagrams, wherever change leads, it is said that \"change resides within.\" From the sixty-four hexagrams, extending by analogy to the three hundred eighty-four lines beyond, the capabilities of the world may truly be exhausted. Can the virtue of the milfoil stalks not be called round and spirit-like in their constant use? Can the virtue of the hexagrams not be called square and knowing in their constant form? Can the meaning of the six lines not be called responsive in offering their mandate, like an echo’s transformations? Can they not be said to be quiescent yet unmovable, yet when stimulated, thoroughly penetrate all under heaven’s patterns?\n\nThus, they are used to penetrate the world’s aspirations, accomplish its tasks, establish its enterprises, and resolve its doubts. In their subtle assistance to the divine luminosity to generate the milfoil stalks, they participate in heaven and pair with earth to rely on numbers; they observe changes in yin and yang to establish hexagrams, and unfold through hardness and softness to generate lines—how could these be idly produced? How could numbers be vainly relied upon? How could hexagrams be carelessly established? How could lines be casually formed? Truly, by mastering this Dao to spiritually illuminate one’s virtue, one can manifest the Dao, spiritually empower conduct, and repay the divine with offerings. The Great Expansion’s number is fifty, of which forty-nine are used. Such is the reason. *Yi Divination and the Permeation of Change*, Scroll the Lower, concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "易筮通变 经名：易筮通变。 原题临川道士雷思齐学。 三卷。 底本出处：《正统道藏》太玄部。 参校版本：文渊阁四库全书本经部易类（简称四库本） 易筮通变卷上 临川道士雷思齐学 卜筮 《洪范》之《稽疑》曰：择建立卜筮人，乃命卜筮。 《诗》曰：尔卜尔筮，体无咎言。 曰：卜筮偕止，会言近止。 《记》之《月令》则曰：孟冬之月，命大史衅龟筮，占兆吉凶。 宜若龟筮相须为用也。 《易·大传》 曰：探迹索隐，钩深致远，成天下之赛赛者，莫大乎曹龟。 又曰：以卜筮者尚其占。 则夫《易》宜兼卜筮之用者也。 《大诰》曰：宁王遗我大宝龟，绍天明，即命。 《金朦》 曰：乃卜三龟，一习吉。 於是莫见夫筮。 《记》又曰：天子无筮，诸侯有守筮。 天子道以筮。 於是又莫见夫卜。 而《说卦》则曰：昔者圣人之作《易》，幽赞於神明而生曹，参天两地而倚数，观变於阴阳而立卦，发挥於刚柔而生爻，以至和顺於道德而理於义，穷理尽性以至於命。 乃独归夫筮，而未始及夫卜也。 由筮命曹，而曹筮之用着於大衍之数皇详且备，而龟之卜则莫之一语及也。 虽亦#1问见谓龟为卜，曹为筮之说於别出，而愚自童卯习见世之常占掷钱以画卦爻，云自京房始矣，且贾公彦亦以画卦之单拆重交之爻谓以钱，复见有假於龟之剖中以布其钱者； 又杂於传记谓卜得某卦之某卦之大凡，且人有常言皇称卜卦，故亦随之等视曹龟卜筮为一盘，未尝以为意也。 盖尝见《周礼·春官》之属：大卜掌三兆之法，一日玉兆，二日瓦兆，三日原兆，其经兆之体皆百有二十，其颂皆千有二百，其下有卜师掌开龟兆，龟人掌六龟，以其方色，与体辨之； 大卜又掌《三易》之法，一日《连山》，二日《归藏》，三日《周易》，其经卦皆八，其别皆六十有四，其下有筮人掌《三易》之九筮，以辨吉凶。 凡国之大事，先筮而后卜，上春相筮，凡国事共筮，然后知卜之用龟，则以兆其书，兆之体、颂至百有二十、千有二百之多，而《易》之筮用曹，固未始出於六十四卦之外，则卜自卜，筮自筮，未始相为用也。 况《洪范》固有龟从、筮从，龟从、筮逆、龟筮共违于人之别，则其卜筮之分校然，其辨白黑未始。 若后世说卜筮者，樊然般乱，至若是之甚，心甚异之。 由是於《左传》之类究其成验，乃判然识卜筮之道。 卜者未尝引《易》之筮，筮者未尝引龟之卜也。 今疏列为征。 有专卜而不筮者。 晋惠公之在梁，梁伯妻之。 梁赢孕过期，卜招父与其子卜之。 子曰：将生一男一女。 招曰：然。 男为人臣，女为人妾。 名男日圉，女日妾。 及圉西质于秦，妾为宦女焉。 邻文公卜迁于绎，史 曰：利於民而不利於君。 ．邻子曰：苟利於民，迁也。 天生民而树之君，以利之也。 民既利矣，孤必与焉。 既迁，而邻子卒。 齐侯戒师期，将以伐鲁，而有疾，医 曰：不及秋，将死。 鲁文公闻之，卜曰：尚无及期。 叔仲惠伯令龟，卜楚丘占之，曰：齐侯不及期，非疾也。 君亦不闻，今龟有咎。 既而，齐懿公弒，文公先薨，惠伯亦卒。 楚王与叶公枚卜子良以为令尹，沈尹朱曰：吉，过於其志。 叶公 曰：王子而相国，过将何为？ 它日改卜子国以为令尹。 若是四者，见卜之未尝及於筮卦也。",
      "translated_text": "**The *Yi Shi Tong Bian* (Comprehensive Understanding of Divination through the Changes)**\n\n**Original Author:** Learned Daoist Lei Siqi of Linchuan\n**Three Scrolls**\n*Source Edition:* *Zhengtong Daozang* (Daoist Canon of the Zhengtong Era), *Taixuan* Section\n*Collated with:* *Wenyuan Ge Siku Quanshu* edition, Classics Division, *Yi* Category (hereafter *Siku* edition)\n\n---\n\n### *Yi Shi Tong Bian*, Scroll One\n**Learned Daoist Lei Siqi of Linchuan**\n\n#### On Divination\n\nThe *Hong Fan*’s *\"Ji Yi\"* states: \"Select and appoint diviners, then command them to divine.\" The *Odes* says: \"You divine with milfoil, you divine with turtle—may the omens be without fault.\" And again: \"When divination with turtle and milfoil concur, their words meet in agreement.\" The *\"Monthly Ordinances\"* in the *Records* further states: \"In the first month of winter, the Grand Scribe anoints the turtle and milfoil to divine the auspices of good and ill.\" Thus, turtle and milfoil seem to be mutually indispensable in their use.\n\nThe *Great Commentary* of the *Changes* says: \"To probe the obscure and seek the hidden, to draw forth the profound and reach the distant, thereby resolving the perplexities of the world—nothing surpasses the turtle and milfoil.\" It also states: \"Those who divine with turtle and milfoil esteem their interpretations.\" Therefore, the *Changes* ought to encompass the uses of both turtle and milfoil.\n\nThe *Da Gao* says: \"King Wen bequeathed to me the great treasure-turtle, continuing the luminous mandate of Heaven, and I acted accordingly.\" The *Jin Teng* records: \"He divined with three turtles, and one was repeatedly auspicious.\" Yet in these instances, no mention is made of milfoil divination.\n\nThe *Records* further states: \"The Son of Heaven does not use milfoil divination; the feudal lords have their official diviners.\" And again: \"The Son of Heaven’s Way relies on milfoil divination.\" Here, too, no mention is made of turtle divination. However, the *\"Shuo Gua\"* declares: \"Of old, the sages composed the *Changes*, subtly aiding the numinous and engendering milfoil, measuring Heaven and Earth to establish numbers, observing the transformations of yin and yang to set forth the hexagrams, unfolding the interplay of firm and yielding to generate the lines, harmonizing with the Dao/Way and virtue/power to order righteousness, exhausting principle and fulfilling nature to reach destiny.\" Here, the text exclusively attributes the method to milfoil divination, without ever mentioning turtle divination.\n\nFrom the milfoil, the stalks are commanded, and the use of milfoil divination is expounded in the *Great Expansion*’s numbers with utmost clarity and completeness. Yet turtle divination is not so much as alluded to in a single phrase. Though elsewhere one may find the distinction that \"turtle is for divination, milfoil for casting,\" and though I, from my youth, have often witnessed common divination by tossing coins to draw hexagrams and lines—a practice said to have begun with Jing Fang—and though Jia Gongyan also speaks of using coins for the single, broken, doubled, and intersecting lines of hexagram-casting, and though there are even those who borrow the turtle’s plastron to arrange their coins, and though miscellaneous records speak of \"divining such-and-such a hexagram\" in general terms, and though people commonly refer to \"divining hexagrams\" (卜卦), thereby conflating turtle and milfoil divination as one, I have never given it much thought.\n\nYet I have observed that among the offices of the *Zhou Rituals*’ *\"Spring Offices,\"* the Grand Diviner oversees the three methods of omen-reading: the first is the jade omen, the second the tile omen, and the third the plain omen. The configurations of their omens each number one hundred and twenty, and their incantations total one thousand two hundred. Below him, the Diviner-Masters preside over the opening of turtle omens, while the Turtle-Keepers manage the six turtles, distinguishing them by their directions and colors, as well as by their forms. The Grand Diviner also oversees the three *Yi* systems: the first is the *Lian Shan*, the second the *Gui Cang*, and the third the *Zhou Changes*. Their primary hexagrams each number eight, and their derived hexagrams each number sixty-four. Below him, the Milfoil Diviners preside over the nine milfoil divinations of the three *Yi*, distinguishing good and ill. For all great matters of state, milfoil divination precedes turtle divination. In the first month of spring, they divine for the harvest, and for all state affairs, they perform milfoil divination. Only afterward do they know to use the turtle, inscribing its omens. The configurations and incantations of the omens reach as many as one hundred twenty and one thousand two hundred, whereas the *Changes*’ milfoil divination fundamentally does not exceed the sixty-four hexagrams. Thus, turtle divination is turtle divination, and milfoil divination is milfoil divination—they have never been used interchangeably.\n\nMoreover, the *Hong Fan* clearly distinguishes between \"turtle follows, milfoil follows,\" \"turtle follows, milfoil opposes,\" and \"both turtle and milfoil contradict the person,\" demonstrating that the division between turtle and milfoil divination is stark, their black and white distinct. Yet later explanations of divination have become so confused and chaotic as to reach this extreme, which I find deeply perplexing. Therefore, I have examined cases in the *Zuozhuan* and the like to verify their outcomes, thereby clearly discerning the principles of turtle and milfoil divination.\n\nTurtle divination never invokes the milfoil divination of the *Changes*, nor does milfoil divination ever invoke turtle divination. Here, I set forth the evidence in detail.\n\n#### Cases of Exclusive Turtle Divination Without Milfoil Divination\n\nWhen Duke Hui of Jin was in Liang, the Lord of Liang married him to his daughter. Lady Liang of Liang was pregnant past her term, and they divined with turtle, consulting Zhao Fu and his son. The son said: \"She will bear one boy and one girl.\" Zhao Fu said: \"So it shall be. The boy will be a servant to others, and the girl will be a concubine.\" They named the boy Yu and the girl Qie. Later, when Yu was a hostage in Qin, Qie became a palace woman.\n\nDuke Wen of Zhu divined about moving to Yi. The diviner said: \"It will benefit the people but not the ruler.\" Duke Zhu said: \"If it benefits the people, then let us move. Heaven gave birth to the people and set up a ruler for them to benefit them. If the people are benefited, I will surely share in it.\" After the move, Duke Zhu died.\n\nThe Marquis of Qi set a date for his army’s campaign, intending to attack Lu, but he fell ill. The physician said: \"He will not live to autumn; he will die.\" When Duke Wen of Lu heard this, he divined with turtle, and the omen said: \"He will not live to the appointed time.\" Shu Zhong Huibo commanded the turtle, and the diviner of Chuqiu interpreted it, saying: \"The Marquis of Qi will not live to the appointed time—it is not illness. You, my lord, will also not hear of it, but now the turtle bears fault.\" Later, Duke Yi of Qi was assassinated, Duke Wen of Lu died first, and Huibo also perished.\n\nThe King of Chu and the Duke of She divined with turtle to appoint Ziliang as Prime Minister. Shen Yin Zhu said: \"Auspicious, but it exceeds his aspirations.\" The Duke of She said: \"A royal son serving as Prime Minister—what could exceed that?\" Later, they divined again to appoint Ziguo as Prime Minister.\n\nIn these four cases, turtle divination was never accompanied by milfoil hexagram divination.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1233,
      "start_sentence": 0,
      "end_sentence": 57,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.14219260215759,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\易筮通变.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "有筮而不卜者。 毕万筮仕於晋，遇《屯》之《比》 。 辛廖占之，曰：吉。 《屯》固《比》入，吉孰大焉，其必蕃昌。 震为土#2车从马，足居之，兄长之，母覆之，众归之，六体不易，合而能固，安而能杀，公侯之卦也。 公侯之子孙，必复其始。 泰伯伐晋，卜徒父筮之，曰：吉，涉河，侯车败#3。 诂之，对曰：乃大吉也，三败必获晋君。 其卦遇《蛊》 ，其《县》曰：千乘三去，三去之余，获其雄狐。 夫狐蛊，必其君也。 《蛊》之贞，风也； 其悔，山也。 岁云秋矣，我落其实而取其材，实落材亡，不败何待？ 三败及韩。 晋侯逆秦师，战于韩原，秦获晋侯以归。 晋侯伐郑，楚子救郑，相遇於鄙陵。 公筮之，史曰：士闷。 卦遇《复》 ， 曰：南国赃，射其无王，中厥目，国蹴王伤，不败何待？ 及战，吕锜射共王，中目。 王曰：天败楚也，吾不可待。 乃宵迟。 晋献公筮嫁伯姬于秦，遇《归妹》之《睽》 。 史苏占之， 曰：不吉。 其《县》曰：士到羊，亦无血也； 女承筐，亦无既也。 西邻责言，不可偿也。 《归妹》之《睽》，犹无相也。 震之离，亦离之震，为雷，为火，为赢败姬。 车说其辕，火焚其旗，不利行师，败于宗丘。 《归妹》之《睽》，寇张之弧#4。 侄其从姑，六年其通，逃归其国，而弃其家。 明年，其死於高梁之虚。 若是四者，筮则有卦，而无复卜兆辞也。 且前之《屯》、《复》、《蛊》三卦，其县固皆非《周易》之辞。 后之《归妹》之《睽》卦，辞近《周易》，而亦非也。 盘可想见，《连山》、《归藏》之《易》，其筮法同，而县辞异也。 有兼用卜、筮，而卜有辞，筮亦有辞者。 鲁成季之将生也，桓公使卜楚丘之父卜之。 曰：男也，其名日友，在公之右； 闲于两社，为公室辅。 季氏亡，则鲁不昌。 又筮之，遇《大有》之《乾》 ， 曰：同复于父，敬如君所。 及生，有文在其手日友，遂以命之。 若是者，卜与筮各有辞，筮之卦辞亦非《周易》辞也。 有先卜后筮者。 晋献公欲以骊姬为夫人，卜之，不吉； 筮之，吉。 公曰：从筮。 卜人曰：筮短龟长，不如从长。 且其《县》曰：专之渝，攘公之褕。 一熏一蓿，十年尚犹有臭。 必不可。 弗听，立之。",
      "translated_text": "There were also cases of milfoil divination without turtle divination. Bi Wan divined his service in Jin and encountered *Tun* (屯) transforming into *Bi* (比). Xin Liao interpreted it, saying: \"Auspicious. *Tun* firmly enters *Bi*—what greater fortune could there be? He will surely flourish and prosper. Thunder brings earth, the chariot follows the horse, feet settle upon it, the elder brother leads, the mother covers, the masses return—none of the six lines change, uniting to form stability. Secure yet capable of decisive action, this is the hexagram of dukes and marquises. The descendants of dukes and marquises will surely restore their ancestral beginnings.\" Later, when King Tai of Zhou attacked Jin, Tu Fu divined with milfoil and said: \"Auspicious. Crossing the river, the marquis’s chariot will be defeated.\" When asked to explain, he replied: \"This is most auspicious. Three defeats will surely capture the Lord of Jin.\" The hexagram encountered was *Gu* (蠱), and its *xuan* (縣) said: \"A thousand chariots depart thrice; from the remnants of these three departures, the mighty fox is captured.\" The fox in *Gu* must be their lord. *Gu*’s primary trigram is wind, its changing trigram is mountain. The year has reached autumn; we strip its fruit and take its timber. With fruit fallen and timber gone, what awaits but defeat?\" Three defeats later, they reached Han. The Lord of Jin intercepted the Qin army and fought at Hanyuan, where Qin captured the Lord of Jin and returned. When the Lord of Jin attacked Zheng and the Viscount of Chu came to Zheng’s aid, they met at Bi Ling. The Duke divined with milfoil, and the scribe said: \"The warrior is stifled.\" The hexagram encountered was *Fu* (復), and he said: \"The southern state is corrupt; shooting its kingless one, the arrow strikes his eye. The state stumbles, the king is wounded—what awaits but defeat?\" In battle, Lü Qi shot King Gong of Chu in the eye. The king said: \"Heaven has defeated Chu; I cannot remain.\" He then fled under cover of night. When Duke Xian of Jin divined the marriage of Bo Ji to Qin, he encountered *Guimei* (歸妹) transforming into *Kui* (睽). Historian Su interpreted it, saying: \"Inauspicious.\" Its *xuan* said: \"The warrior butchers the sheep, yet there is no blood; the woman carries the basket, yet there is no harvest. The western neighbor demands recompense—it cannot be repaid. *Guimei* transforming into *Kui* still lacks mutual support. Thunder and fire, fire and thunder—this is thunder, this is flame, this is the ruin of Bo Ji. The chariot sheds its shaft, fire burns its banner; it is inauspicious to march, defeat will come at Zongqiu. *Guimei* transforming into *Kui* is the drawn bow of bandits. The niece follows her aunt, six years will pass before reunion; she will flee back to her state and abandon her home.\" The next year, she died at the ruins of Gaoliang.\n\nIn these four cases, milfoil divination produced hexagrams, but there were no further turtle omen texts. Moreover, the *xuan* of the earlier three hexagrams—*Tun*, *Fu*, and *Gu*—were clearly not the words of the *Zhouyi*. The later *Guimei* transforming into *Kui* hexagram’s text was close to the *Zhouyi* but still not identical. From this, one may infer that the *Lianshan*, *Guicang*, and *Zhouyi* shared the same divination method but differed in their *xuan* texts.\n\nThere were also cases where both turtle and milfoil divination were used, each yielding its own text. When Cheng Ji of Lu was about to be born, Duke Huan sent the father of Chuqiu to divine with turtle. He said: \"A son, his name will be You. He will stand at the Duke’s right, mediating between the two altars, and serve as the Duke’s assistant. If the Ji clan perishes, Lu will not prosper.\" They also divined with milfoil, encountering *Dayou* (大有) transforming into *Qian* (乾), and the text said: \"Reuniting with the father, reverence as if before the lord.\" At birth, there was a mark on his hand reading *you* (友), so they named him accordingly. In such cases, both turtle and milfoil divination had their own texts, and the hexagram texts were not those of the *Zhouyi*.\n\nThere were also cases of first turtle divination, then milfoil divination. When Duke Xian of Jin wished to make Li Ji his lady, he divined with turtle, which was inauspicious; then with milfoil, which was auspicious. The Duke said: \"Follow the milfoil.\" The turtle diviner said: \"Milfoil is short, turtle is long—better to follow the long. Moreover, its *xuan* says: 'Devotion turns to betrayal, seizing the Duke’s robe. One whiff of fragrance, one of stench—ten years later, the stench still lingers.' It must not be done.\" He did not listen and established her.",
      "overlap_context": "fault.\" Later, Duke Yi of Qi was assassinated, Duke Wen of Lu died first, and Huibo also perished.\n\nThe King of Chu and the Duke of She divined with turtle to appoint Ziliang as Prime Minister. Shen Yin Zhu said: \"Auspicious, but it exceeds his aspirations.\" The Duke of She said: \"A royal son serving as Prime Minister—what could exceed that?\" Later, they divined again to appoint Ziguo as Prime Minister.\n\nIn these four cases, turtle divination was never accompanied by milfoil hexagram divination.",
      "start_char": 1233,
      "end_char": 2072,
      "start_sentence": 58,
      "end_sentence": 110,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.411312580108643,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\易筮通变.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "生奚齐。 乃潜太子申生至於缢死，遂立奚齐。 卒乱晋。 有先筮而后卜者。 卫侯梦于北官，见人登昆吾之观，被发而噪曰：登此昆吾之虚，绵绵生之瓜。 余为浑良夫，哄天无辜。 公亲筮之，胥弥赦占之，曰：不害。 卫侯贞卜，《县》 曰：如鱼窥尾，衡流而方羊。 裔焉大国，灭之，将亡。 阖门塞窦，乃自后瑜。 冬十月，晋复伐卫，入其邪。 卫出庄公而与晋平，晋立襄公之孙般师而还。 若是二者，虽先卜后筮，先筮后卜，则殊筮无卦辞，卜乃有县，然为卜为筮不比而同也。 其若晋献公卜伐骊戎，史苏占之， 曰：胜而不吉。 公曰：何谓也？ 对曰：遇兆曰：挟以衔骨，齿牙为猾，戎夏交拌，是交胜也。 臣故云。 且惧有口，拥民国私心焉。",
      "translated_text": "She gave birth to Xi Qi. Then she secretly plotted against Crown Prince Shen Sheng until he hanged himself, and Xi Qi was established as heir. In the end, Jin fell into chaos.\n\nThere were also cases of first milfoil divination, then turtle divination. The Lord of Wei dreamed at the Northern Palace of a man ascending the tower of Kunwu, his hair disheveled as he cried out: *\"I climb this ruined mound of Kunwu, where melons grow in endless vines. I am Hun Liangfu—how I have deceived Heaven and wronged the innocent!\"* The Lord personally performed milfoil divination, and Xu Mi She interpreted it, saying: \"It will bring no harm.\" The Lord then performed a proper turtle divination, and the *xuan* said: *\"Like a fish peeking at its tail, drifting sideways in the current. A great state from the distant borders will destroy it—annihilation approaches. Seal the gates, block the holes, and perish from behind.\"* In the winter of the tenth month, Jin attacked Wei again, breaching its outer walls. Wei expelled Duke Zhuang and made peace with Jin, whereupon Jin installed Ban Shi, grandson of Duke Xiang, and withdrew.\n\nIn these two cases—whether first turtle then milfoil, or first milfoil then turtle—the milfoil divination had no hexagram texts, while the turtle divination had *xuan*. Yet whether by turtle or milfoil, the outcomes were not aligned but proved the same.\n\nAnother instance: When Duke Xian of Jin divined about attacking the Lirong, Historian Su interpreted the omens, saying: \"Victory, but not auspicious.\" The Duke asked: \"What do you mean?\" He replied: \"The omen reads: *'Clutching a bone in its jaws, fangs turned to treachery. Rong and Xia clash in strife—each claims victory.'* Hence my words. Moreover, I fear there will be mouths to feed, as private ambition swells within the state.\"",
      "overlap_context": "divination. When Duke Xian of Jin wished to make Li Ji his lady, he divined with turtle, which was inauspicious; then with milfoil, which was auspicious. The Duke said: \"Follow the milfoil.\" The turtle diviner said: \"Milfoil is short, turtle is long—better to follow the long. Moreover, its *xuan* says: 'Devotion turns to betrayal, seizing the Duke’s robe. One whiff of fragrance, one of stench—ten years later, the stench still lingers.' It must not be done.\" He did not listen and established her.",
      "start_char": 2072,
      "end_char": 2356,
      "start_sentence": 111,
      "end_sentence": 128,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.69565486907959,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\易筮通变.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "公曰：何口之有？ 口在寡人，寡人弗受。 谁其兴之？ 对日； 苟可以携其入也，必甘受逞，而不知胡可壅也。 公弗听，遂伐骊戎，克之，获骊姬以归，卒以乱国。 若是者，卜独有县辞，而不及筮，则《国语》犹然也，辞与《左传》尚未相远也。 若《家语》谓孔子尝自筮得《贲》卦 ，愀然有不平之色。 子张进 曰：卜者得《贲》卦，吉也； 而夫子之不平，何也？ 子曰：以其离邪。 在《周易》，山下有火，贲； 非正色之卦也。 夫质也者，黑白宜正焉。 今得《贲》，非吾兆也。 吾闻丹漆不文，白玉不雕，何也？ 质有余，不受饰也。 由今观之，是可疑者。 且既谓孔子自筮，何子张乃谓之卜？ 况其辞与《易》不类？ 《贲》之《象》 曰：贲，柔来而文刚。 分刚上而文柔，故小利有攸往。 天文也； 文明以止，人文也。 观乎天文，以察时变； 观乎人文，以化成天下。 何夫子於《象》取其文，於筮独尚其质？ 自相抵悟，遽至於此，愚故不敢以《家语》为信。 至皿左氏於专筮而不卜，列於《传》者尚多有之，不克枚举，悉以《周易》之辞推之。 《周易》独行至今，人莫不审悉。 自《家语》一事之外，卜之用龟兆，筮之用曹卦，断断乎未尝自为纷札也。 抑亦见《连山》、《归藏》之与《周易》而为三，其经卦皆八，其别皆六十有四者，於《礼#5》为不诬。 《连山》、《归藏》，今莫之见，例此迦求犹彷佛一二，曷尝如后之俗诱#6，然同谧习称曹筮为卜卦哉？ 说者谓《易经》由混於卜筮、占兆得兔秦火，固亦或者，然其谓太卜所掌经兆之体皆百二十，其颂皆千二百，乃无得见者，岂所谓占兆可脱於火者亦不免邪？ 昔汉文自代来，卜得大横，《县》曰：大横庚庚，余为天王，夏启以光。 释者谓大横，龟之正横是其体也。 文帝有土之象，则卜兆汉初似尚存，而后世不传，唯北齐高洋欲篡东魏，卜於李密，亦谓大横， 曰：汉文之兆也。 愚意：密特谄洋以成其篡耳。 焉可尽信哉？",
      "translated_text": "The Duke asked: \"What mouths could there be? The mouths are mine to command—I shall not heed them. Who would dare rise against me?\"\nHe replied: \"If one can sway the people’s allegiance, they will gladly embrace deceit, unaware of how it may be stemmed. Once unleashed, how can it be dammed?\"\nThe Duke did not listen. He attacked the Lirong, conquered them, and brought back Lady Li, ultimately plunging the state into chaos.\n\nIn such cases, divination relied solely on turtle *xuan* without milfoil hexagrams, as recorded in *Discourses of the States*, where the wording still closely aligns with *Zuo’s Commentary*. Yet in *The School Sayings of Confucius*, it is said that Confucius once cast milfoil and obtained the hexagram *Bi* (*Adornment*), his expression turning grim with discontent. Zizhang stepped forward and asked: \"The diviner obtained *Bi*—a auspicious hexagram. Why then does the Master appear displeased?\"\nConfucius replied: \"Because of its *li* (clinging fire). In the *Zhou Changes*, fire beneath the mountain forms *Bi*—a hexagram not of true colors. For substance, black and white should be pure. This *Bi* is not my omen. I have heard that cinnabar and lacquer need no embellishment, nor white jade carving. Why? Because their essence is already full—they require no adornment.\"\n\nLooking at this account, doubts arise. If it claims Confucius himself cast the milfoil, why does Zizhang refer to it as divination? Moreover, the wording does not resemble the *Changes*. The *Image* of *Bi* states: \"*Bi*: The yielding comes to adorn the firm. Dividing the firm above to adorn the yielding below—thus there is slight advantage in proceeding. The patterns of heaven; the civilizing of humanity. Observe the patterns of heaven to discern the changes of the times; observe the civilizing of humanity to transform and perfect the world.\" Why would the Master, who draws on the *Image* for its cultural refinement, reject adornment in milfoil divination alone? Such contradictions are glaring. Thus, I dare not trust *The School Sayings*.\n\nAs for Zuo Qiuming’s inclusion of milfoil divination without turtle in his *Commentary*, such instances are too numerous to list, all interpreted through the *Zhou Changes*. The *Zhou Changes* has endured to this day, its texts universally known. Beyond this single case in *The School Sayings*, turtle divination relied on *gui* omens, while milfoil used hexagrams—never were they confused.\n\nMoreover, the *Rites* confirms that the *Lian Shan*, *Gui Cang*, and *Zhou Changes* form the Three Changes, each with eight primary hexagrams and sixty-four derived ones. Though the *Lian Shan* and *Gui Cang* are now lost, traces remain. How could they resemble later vulgar practices that conflate milfoil divination with turtle divination?\n\nSome argue that the *Book of Changes* survived Qin’s burning of the books because it was entangled with divination and omens. Yet if the Grand Diviner’s *gui* omens numbered one hundred twenty, with a thousand two hundred *song* chants—none of which survive—how could divination texts alone escape the flames?\n\nWhen Emperor Wen of Han journeyed from Dai, he divined and obtained the *Great Horizontal* omen. The *xuan* read: \"*Great Horizontal*, *genggeng*—I shall be Heaven’s king, as Xia Qi brought glory.\" Interpreters said the *Great Horizontal* was the primary horizontal line of the turtle’s pattern, symbolizing the ruler’s earthly mandate. Thus, Han’s early divinations seemed to persist, though later ages lost them. Only when Gao Yang of Northern Qi sought to usurp Eastern Wei did he consult Li Mi, who also cited the *Great Horizontal*, calling it \"the omen of Emperor Wen of Han.\" In my view, Li Mi merely flattered Gao Yang to aid his usurpation. How could such claims be fully trusted?",
      "overlap_context": " or milfoil, the outcomes were not aligned but proved the same.\n\nAnother instance: When Duke Xian of Jin divined about attacking the Lirong, Historian Su interpreted the omens, saying: \"Victory, but not auspicious.\" The Duke asked: \"What do you mean?\" He replied: \"The omen reads: *'Clutching a bone in its jaws, fangs turned to treachery. Rong and Xia clash in strife—each claims victory.'* Hence my words. Moreover, I fear there will be mouths to feed, as private ambition swells within the state.\"",
      "start_char": 2356,
      "end_char": 3097,
      "start_sentence": 129,
      "end_sentence": 167,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.610486268997192,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\易筮通变.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "后世卜兆之书，没没不闻，多中何哉？ 嗟乎，合其体既三百六十，分其颂乃三千六百之富，宜乎其不存也。 诚使其存，谁其及之哉？ 何以明之？ 《连山》、《归藏》世固罔然，唯《周易》一书，卦之少唯六十有四，爻之多止於三百八十有四，更三古四圣之所作述，今未云至精至变至於至神之用，至若经卦与其别者，以辞而已，杂然注释者皆是也。 及问其着筮之唯变所适者，则茫乎，实莫知其为何事。 若是者尚欲与之语《易》，不亦难矣哉？ 愚因论卜筮之不可盘同，尚#7浩叹及之。 之卦 圣人有以见天下之迹，而拟诸形容，象其物宜，是故谓之象。 圣人有以见天下之动，而观其会通，以行其典礼，击辞焉以断其吉凶，是故谓之爻。 极天下之迹者存乎卦； 鼓天下之动者存乎辞； 化而裁之存乎变； ·推而行之存乎通。 然则变而通所以尽利，通其变所以成文。 八卦成列，而象在中； 因而重之，而爻在中； 刚柔相推，而变在中； 系辞命之，而动在中矣。 八卦以象告，爻象以情言，变通以利言，吉凶以情迁。 又 曰：爻象动乎内，吉凶见乎外，功业见乎变，圣人之情见乎辞。 既曰：鼓天下之动者存乎辞； 系辞而命之，动在其中。 则又日系辞焉以断其吉凶，曰辨吉凶者存乎辞，则辞也者，《易》道之所必不得已也。 是故《易》之为书，其道屡迁，变动不居，周流六虚，上下无常，刚柔相易，不可为典要，唯变所适。 卦有小大，辞有险易； 辞也者，各指其所之。 然则指其所之之之一字，特指其变动之所之适也； 易，变易也，所以见天下之动，而鼓天下之动者，莫不於是乎观。 故《易》之筮，谓其爻变而动，而有所之适者，为某卦之某卦。 今之谓辞指所之者，为之卦发也。 韩康伯於此指所之之下无注。 孔颖达疏曰：各指所之，谓爻卦之辞，各斥其爻卦之之适也。 若之适於善，则其辞善； 之适於恶，则其辞恶而已。 夫以之之一字以训适，非不然也。 谓卦之变，爻之动，则未足以明其辞之所之也。 请亦以《左传》明之。 陈敬仲之少也，周史有以《周易》见陈侯，陈侯使筮之，遇《观》之《否》 ，乃《观》之四爻，之《否》之四爻也。 故史指《观》之四爻之辞 曰：观国之光，利用宾于王。 因以知其代陈有国也。 晋文公之纳王也，筮之，遇《大有》之《睽》 ，乃《大有》之三，之《睽》之三也。 故卜偃指《大有》之三爻曰：吉，公用享于天子之卦也。 战克而王享，吉孰大焉？ 《大有》九三，《易》以享为亨，然亨本垦曰为享。 齐崔杼欲取棠公之螫东郭姜，筮之，遇《困》之《大过》 ，乃《困》之三，之《大过》之三也。 史皆曰：吉。 以示陈文子，故文子指《困》之三爻 曰：夫从风，风陨妻，不可取也。 且其《县》曰：困于石，据于羡华，入于其宫，不见其妻，凶。 且释之曰：困于石，往不济也。 据于羡华，所恃伤也？ 入于其宫，不见其妻，凶； 无所归也。 崔杼必取棠姜，终以乱而家遂灭。 叔孙穆子之生，庄叔以《周易》筮之，，遇《明夷》之《谦》 ，乃《明夷》之初，之《谦》之初也。 以示卜楚丘， 曰：明而未融，其当旦乎。 之谦当乌，故曰明夷于飞； 明而未融，故日垂其翼； 象汨之动，故日君子攸行；",
      "translated_text": "The later ages saw no trace of divination texts—why so? Alas! Their structure comprised three hundred sixty lines, and their *song* chants numbered three thousand six hundred in abundance; no wonder they did not survive. Had they endured, who could have mastered them?\n\nHow to demonstrate this? The *Lianshan* and *Guizang* have long vanished from the world, leaving only the *Zhouyi* (*Book of Changes*), whose hexagrams number a mere sixty-four, and whose lines total no more than three hundred eighty-four. Yet through the works and transmissions of the Three Eras and Four Sages, it remains unparalleled in its precision, adaptability, and near-divine application. As for the trigrams and their variations, they are defined solely by their words—hence the profusion of commentaries. But when asked about the specific changes in divination and where they lead, one is met with bewilderment: truly, no one knows what they signify. How then can one speak of the *Yi* with such certainty? It is difficult indeed.\n\nThus, in discussing the impossibility of conflating divination methods, I cannot but sigh deeply over these matters.\n\nThe hexagrams: The sage perceived the traces of the world and modeled them in form, symbolizing their proper correspondences—hence they are called *images*. The sage observed the movements of the world and contemplated their convergence and flow, enacting rituals accordingly. By appending words, he determined fortune and misfortune—hence they are called *lines*.\n\nThe utmost of the world’s traces resides in the hexagrams;\nThe impetus of the world’s movements resides in the words;\nTransformation and裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁裁 reside in change;\nAdvancing and enacting them resides in penetration.\n\nThus, change and penetration serve to exhaust all advantages; penetrating change serves to complete the pattern.\n\nThe eight trigrams form their array, and the images lie within;\nBy doubling them, the lines lie within;\nHard and soft interact, and change lies within;\nAppending words to them, movement lies within.\n\nThe eight trigrams convey through images;\nThe lines and images speak through circumstance;\nChange and penetration speak through advantage;\nFortune and misfortune shift with circumstance.\n\nIt is also said: The lines and images move within, while fortune and misfortune appear without; achievements manifest through change, and the sage’s intent is revealed in the words.\n\nSince it is said that the impetus of the world’s movements resides in the words, and that appending words to command them places movement within, it follows that appending words determines fortune and misfortune. To discern fortune and misfortune is to rely on the words—thus, words are indispensable to the Dao of the *Yi*.\n\nTherefore, the *Yi* as a book embodies a Dao that shifts repeatedly, never fixed, flowing through the six positions, rising and falling without constancy. Hard and soft alternate, defying rigid principles—only change dictates its course.\n\nHexagrams vary in scale, and words vary in peril or ease. The words, then, each point to their destination.\n\nYet that single character \"之\" (*zhi*, \"to go\") specifically indicates the direction of change and movement. *Yi* means \"change,\" and it is through this that the world’s movements are observed and impelled. Nothing escapes this scrutiny.\n\nThus, the divination of the *Yi* refers to the lines changing and moving, each finding its proper place, becoming such-and-such a hexagram within such-and-such a hexagram. Today, what is called \"the words pointing to their destination\" is termed the \"hexagram’s manifestation.\"\n\nHan Kangbo provided no annotation for this \"pointing to its destination.\" Kong Yingda’s subcommentary states: \"Each points to its destination,\" meaning the words of the lines and hexagrams each specify where their respective line or hexagram is headed. If it heads toward good, the words are good; if toward evil, the words are evil—nothing more.\n\nTo gloss *zhi* as \"to go\" is not incorrect, but to say that the hexagram’s change or the line’s movement is sufficient to clarify where the words lead is inadequate. Let us also illustrate this with the *Zuozhuan*:\n\nIn Chen Jingzhong’s youth, a Zhou historian visited Chen Hou with the *Zhouyi* and divined for him, obtaining *Guan* (Observation) changing to *Pi* (Stagnation)—specifically, the fourth line of *Guan* changing to the fourth line of *Pi*. Thus, the historian pointed to the words of *Guan*’s fourth line: *\"Observe the state’s glory; it is advantageous to be a guest of the king.\"* From this, he knew Jingzhong would replace Chen as ruler.\n\nWhen Duke Wen of Jin welcomed the king, he divined and obtained *Dayou* (Great Possession) changing to *Kui* (Dispersion)—specifically, the third line of *Dayou* changing to the third line of *Kui*. Thus, Bu Yan pointed to the words of *Dayou*’s third line: *\"Auspicious—this is the hexagram of the duke offering sacrifice to the Son of Heaven. Victory in battle followed by the king’s feast—what greater fortune could there be?\"* In *Dayou*’s nine in the third place, the *Yi* uses *xiang* (享, \"offering\") for *heng* (亨, \"smooth\"), though *heng* originally meant *ken* (垦, \"to cultivate\") and later *xiang* (\"offering\").\n\nWhen Cui Zhu of Qi sought to marry Dongguo Jiang, the widow of Tang Gong, he divined and obtained *Kun* (Distress) changing to *Daguo* (Great Exceeding)—specifically, the third line of *Kun* changing to the third line of *Daguo*. The historians all declared it auspicious. When shown to Chen Wenzi, he pointed to the words of *Kun*’s third line: *\"Following the wind, the wind topples the wife—she cannot be taken.\"* Moreover, its *xuan* text states: *\"Distressed by stone, resting on thorns, entering his palace, not seeing his wife—misfortune.\"* He further explained: *\"Distressed by stone\"—to go is not to succeed. \"Resting on thorns\"—what one relies on is harmed. \"Entering his palace, not seeing his wife\"—misfortune, for there is nowhere to return.* Cui Zhu nevertheless married Tang Jiang, and his family was ultimately destroyed by chaos.\n\nWhen Shusun Muzi was born, Zhuang Shu divined for him with the *Zhouyi* and obtained *Mingyi* (Bright Obscured) changing to *Qian* (Modesty)—specifically, the initial line of *Mingyi* changing to the initial line of *Qian*. Shown to Bu Chuqiu, he said: *\"Bright but not yet radiant—it must be dawn.\"* The change to *Qian* corresponds to the crow, hence: *\"Mingyi takes flight.\"* *\"Bright but not yet radiant\"*—hence: *\"Drooping its wings.\"* The image of stirring in the waters—hence: *\"The noble one goes on his way.\"*",
      "overlap_context": " glory.\" Interpreters said the *Great Horizontal* was the primary horizontal line of the turtle’s pattern, symbolizing the ruler’s earthly mandate. Thus, Han’s early divinations seemed to persist, though later ages lost them. Only when Gao Yang of Northern Qi sought to usurp Eastern Wei did he consult Li Mi, who also cited the *Great Horizontal*, calling it \"the omen of Emperor Wen of Han.\" In my view, Li Mi merely flattered Gao Yang to aid his usurpation. How could such claims be fully trusted?",
      "start_char": 3097,
      "end_char": 4311,
      "start_sentence": 168,
      "end_sentence": 227,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.29953360557556,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\易筮通变.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "当三在旦，故曰三日不食。 离为火，火焚山败； 於人为言，言败为谗，故曰有攸往，主人有言，言必谗也。 盖《明夷》初爻辞也。 其卒以坚牛之乱。 筮占无一不验者。 卫襄夫人无子，璧人惆始生孟挚，孔成子梦康叔谓己：立无，余使羁之孙圉，与史苟相之。 史朝亦梦康叔谓己：余命而子苟与孔需钮之曾孙圉相无。 史朝见成子，而告之。 梦协。 韩宣子为政，聘於诸侯之岁，惆始生子，名之日无。 孟挚之足不良能行。 成子以《周易》筮之， 曰：无尚享卫国，主其社稷。 遇《屯》之《比》 。 又曰：余尚立#8挚，尚克嘉之。 遇《屯》 ，以示史朝。 朝 曰：元亨，又何极焉？ 成子曰：非长之谓也。 曰：康叔命之，可谓长矣。 是以《县》曰：利建侯。 嗣吉，何建？ 建非嗣也。 二卦皆云子其建之，康叔命之，二卦告之。 筮袭於梦，武王所用也。 盖再遇《屯》卦辞，皆 曰：元亨。 而《屯》变于初，故之《比》。 《屯》之初爻辞曰：盘桓，利居贞，利建侯。 於是立无。 南蒯之将叛也，枚筮之，遇《坤》之《比》 ， 曰：黄裳，元吉。 以为大吉。 示子服惠伯曰：即欲有事，何如？ 惠伯曰：吾尝学此矣，忠信之事则可，不然必败。 黄，中之色也； 裳，下之饰也； 无，善之长也。 中不中，不得其色； 下不共，不得其饰； 事不善，不得其极。 非此三者，不当。 且夫《易》不可以占险。 盖由《坤》之五，之《比》之五也，故释以《坤》五之辞也。 南剧卒以叛至於亡。 故尝例乎是数者，而夷考之《传》，至皿尚多有之，皆以所之之卦、所动之爻言之。 夫之卦也者，占变之事也。 《易》有圣人之道，则谓以动者尚其变，以筮者尚其占，故通变之谓事，极数知来之谓占，占事则有之卦也。 抑古之学《易》者，不惟占也。 君子所居而安者，《易》之序也； 所乐而玩者，爻之辞也。 居则观其象而玩其辞，动则观其变而玩其占，不惟占则有之卦也。 凡说诸心，研诸虑，事会所适，言意所致，引伸触类，亦未始不用之卦也。 楚子围郑，克之。 晋师救郑，荀桓子闻郑，及楚平欲还， 曰：无及於郑而剿民，焉用之#9？ 随武子曰：善。 赢季不可，以中军佐济。 知庄子曰：此师殆哉。 《周易》有之，在《师》之《临》 网，曰：师出以律； 否臧，凶。 指《师》之初，之《临》之初也。 郑游吉至自楚，告子展曰：楚子将死矣。 不修政德，而贪昧於诸侯，以逞其愿，欲久得乎？ 在《复》之颐 ，曰：迷复，凶。 其楚子之谓乎？ 指《复》之上，之《颐》之上也。 郑公子曼满与王子伯廖语，欲为卿。 伯廖告人曰：无德而贪，其在《周易》《丰》之《离》 ，弗过之矣。 至皿指《丰》之上，之《离》之上也。 其辞 曰：丰其屋，部其家，阀其户，板其无人，三岁不觊，凶也。 闲一岁，郑人果杀之。 若是三者，尚不过举其卦之一爻之所之之为然也。 至於蔡墨对魏献子之问龙见绛郊，则直曰：《周易》有之，在《乾》之《姤 ，曰：潜龙勿用。 其《同人》 ，曰：见龙在田。 其《大有》 ，曰：飞龙在天。 其《夬》 ，曰：亢龙有悔。 其《坤》 ，曰：见草龙无首，吉。 《坤》之《剥》 曰：龙战于野。 此虽於象龙、真龙之事，有不容於理讨，然其所举《乾》、《坤》之爻凡六，必皆互以《乾》、《坤》反复相之爻辞，以相校而明其所之者，谓全《易》之卦六十有四，其爻三百八十有四，变之所之，率由是道也。",
      "translated_text": "When the three resides at dawn, hence: *\"Three days without eating.\"* *Li* is fire; fire scorches the mountain and brings ruin. In man, it is speech; speech that brings ruin is slander—hence: *\"There is somewhere to go; the host has words,\"* and those words must be slander. This is the line statement of the initial line of *Mingyi*. In the end, he perished in the chaos of Jian Niu. Not a single divination failed to prove true.\n\nLady Xiang of Wei had no son. When the concubine Chou gave birth to Meng Zhi, Kong Chengzi dreamed that Kang Shu said to him: *\"Establish Wu; I will send Ji’s grandson Yu to assist him, along with the scribe Gou.\"* Scribe Chao also dreamed that Kang Shu said to him: *\"I command your son Gou and Kong Xu Niu’s great-grandson Yu to assist Wu.\"* Scribe Chao met Chengzi and told him. The dreams matched.\n\nWhen Han Xuanzi was in office and making his rounds among the feudal lords, Chou gave birth to a son, whom he named Wu. Meng Zhi’s feet were not sound, and he could not walk well. Chengzi divined for him with the *Zhouyi* and said: *\"Wu will still enjoy the state of Wei and preside over its altars.\"* He encountered *Zhun* changing to *Bi*. He also said: *\"I will still establish Zhi, and he will surely be worthy.\"* He encountered *Zhun*. He showed it to Scribe Chao, who said: *\"Supremely favorable—what limit could there be?\"* Chengzi said: *\"I do not mean he will be the eldest.\"* Chao said: *\"Kang Shu commanded it—can that not be called eldest?\"* Thus *Xian* says: *\"Favorable to establish a lord.\"* *\"Inheritance is auspicious\"*—why establish? Establishment is not inheritance. Both hexagrams say *\"the son shall establish him,\"* and Kang Shu commanded it; both hexagrams informed him. Divination aligned with the dream—this was the method used by King Wu.\n\nHe twice encountered the hexagram statement of *Zhun*, both saying: *\"Supremely favorable.\"* And *Zhun* changed at the initial line, hence to *Bi*. The line statement of the initial line of *Zhun* says: *\"Wavering; favorable to dwell in constancy; favorable to establish a lord.\"* Thereupon they established Wu.\n\nWhen Nan Kuai was about to rebel, he secretly divined and encountered *Kun* changing to *Bi*, which said: *\"Yellow skirts—supremely auspicious.\"* He took it as highly favorable and showed it to Zifu Huibo, saying: *\"If I were to take action, how would it be?\"* Huibo said: *\"I have studied this: if it is a matter of loyalty and good faith, it may succeed; otherwise, it will surely fail. Yellow is the color of the center; skirts are the adornment of the lower; none is the chief of good. If the center is not centered, it does not obtain its color; if the lower is not submissive, it does not obtain its adornment; if the matter is not good, it does not reach its utmost. Without these three, it is not fitting. Moreover, the *Yi* cannot be used to divine peril.\"*\n\nThis was because the fifth line of *Kun* changed to the fifth line of *Bi*, so he interpreted it with the line statement of the fifth line of *Kun*. Nan Kuai ultimately rebelled and perished. Thus, when examining these several cases and investigating the *Commentaries*, one finds many more instances, all explained by the hexagram to which they moved and the line that was activated.\n\nThe hexagram one encounters is the matter of divining change. The *Yi* contains the Dao of the sage—thus, in action, one values its changes; in divination, one values its prognostications. Hence, *\"understanding change is called affairs,\"* and *\"exhausting numbers to know the future is called divination.\"* When divining affairs, there is the hexagram one encounters.\n\nYet the ancients who studied the *Yi* did not do so solely for divination. What the noble one dwells in and finds peace in is the sequence of the *Yi*; what he delights in and plays with are the line statements. At rest, he observes its images and plays with its words; in action, he observes its changes and plays with its prognostications. It is not only in divination that there is the hexagram one encounters. In all matters of the heart, in refining one’s thoughts, in the circumstances one meets, in the intentions one expresses, in extension and analogy—one has never failed to employ its hexagrams.\n\nThe Viscount of Chu besieged Zheng and conquered it. The Jin army came to rescue Zheng. Xun Huanzhi, hearing that Zheng had made peace with Chu, wished to return, saying: *\"If we do not reach Zheng and exhaust the people, what use is it?\"* Sui Wuzi said: *\"Well said.\"* Ying Ji opposed it, and the deputy commander of the central army crossed the river. Zhi Zhuangzi said: *\"This army is in peril.\"* The *Zhouyi* has this in *Shi* changing to *Lin*: *\"The army goes forth with discipline; if not good, it is ominous.\"* This refers to the initial line of *Shi* changing to the initial line of *Lin*.\n\nZheng Youji returned from Chu and told Zizhan: *\"The Viscount of Chu will die. He does not cultivate political virtue but greedily deludes the feudal lords to satisfy his desires—can he long endure?\"* In *Fu* changing to *Yi*, it says: *\"Deluded return—ominous.\"* Does this not refer to the Viscount of Chu? This refers to the top line of *Fu* changing to the top line of *Yi*.\n\nZheng Duke’s son Manman spoke with Prince Boliao, wishing to become minister. Boliao told others: *\"Without virtue yet greedy—this is in the *Zhouyi* in *Feng* changing to *Li*. He will not pass beyond it.\"* This refers to the top line of *Feng* changing to the top line of *Li*. Its line statement says: *\"Abundant is his house, secluded is his family, peering through his door, desolate and without people—three years without seeing them—ominous.\"* Within a year, the people of Zheng indeed killed him.\n\nIn these three cases, they did not go beyond citing the line of the hexagram to which it moved as the reason. As for Cai Mo’s response to Wei Xianzi’s question about the dragon appearing in the suburbs of Jiang, he simply said: *\"The *Zhouyi* has this in *Qian* changing to *Gou*: *'The hidden dragon—do not act.'* In *Tongren*, it says: *'The dragon appears in the fields.'* In *Dayou*, it says: *'The flying dragon is in the heavens.'* In *Guai*, it says: *'The dragon at its zenith has regret.'* In *Kun*, it says: *'Seeing a grass dragon without a head—auspicious.'* In *Kun* changing to *Bo*, it says: *'Dragons battle in the wild.'\"* Though in the images of dragons and the matter of real dragons, there may be inconsistencies in rational inquiry, the six lines he cited from *Qian* and *Kun* were all mutually compared with the line statements of *Qian* and *Kun* in reverse, clarifying the hexagram to which they moved. This is to say that of the sixty-four hexagrams of the *Yi* and their three hundred eighty-four lines, the changes to which they move generally follow this method.",
      "overlap_context": "as born, Zhuang Shu divined for him with the *Zhouyi* and obtained *Mingyi* (Bright Obscured) changing to *Qian* (Modesty)—specifically, the initial line of *Mingyi* changing to the initial line of *Qian*. Shown to Bu Chuqiu, he said: *\"Bright but not yet radiant—it must be dawn.\"* The change to *Qian* corresponds to the crow, hence: *\"Mingyi takes flight.\"* *\"Bright but not yet radiant\"*—hence: *\"Drooping its wings.\"* The image of stirring in the waters—hence: *\"The noble one goes on his way.\"*",
      "start_char": 4311,
      "end_char": 5596,
      "start_sentence": 228,
      "end_sentence": 303,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.96982741355896,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\易筮通变.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "是足以迦明《易·大传》之辞也者，各指其所之者，非为它设也，为之卦设也。 是固所以见天下之动，而观其会通，以行其典礼，断其吉凶； 化而裁之，推而行之，唯变所适也。 变之所适，之卦之谓也。 故 曰：爻象动乎内，吉凶见乎外，功业见乎变，圣人之情见乎辞。 卦有小大，辞有险易； 辞也者，各指其所之。 学者因之，以是审於观变以立卦，倚数以生爻，极深乎至精，研几乎至变，以至於至神，和顺於道德而理於义，穷理尽性以至於命，胸中包有全《易》之体用，其斯至矣。 易筮通变卷上竟 #1『亦』，四库本作『一』。 #2『土』，四库本误作『主』。 #3『车败』，四库本作『军败』。 #4『弧』，原作『张』，据四库本改。 #5『礼』，四库本作『体】。 #6『俗诱』，四库本作『俗群』。 #7『尚』，四库本作『尝』。 #8『立』，原作『玄』，据四库本改。 #9『之』，据其文义例补。 易筮通变卷中 临川道士雷思齐学 九六 《易》始於阴阳之画，而阳之画 而为奇，阴之画 而为耦。 由乾之画 ，分而为震 、为坎 、为艮 卦之奇； 坤之 ，分而为巽 、为离 、为兑 三卦之耦，故曰：阳卦奇，阴卦耦； 阳卦多阴，阴卦多阳。 虽奇耦少多若可数计，而未始谓 为九， 为六也。 圣人之作《易》，观变於阴阳而立卦，则天之道曰阴与阳； 发挥於刚柔而生爻，则地之道日柔与刚，故《易》六画而成卦，分阴分阳，迭用柔刚，六位而成章。 其日画日位者，是所谓卦爻也。 岂尝有九、六之分哉？ 由重乾卦之画之位，皆阳奇之爻，而爻辞上必系以九，且有用九之例； 重坤卦之画之位，皆阴耦之爻，而爻辞上必系以六，且有用六之例。 而凡卦之爻，莫不各系以九且六，学者积於所见所闻之成习，以此诚为九、六也。 从而九、六之无复讨其所以然者，窃自异之。 夫九、六，数也。 《大传》曰：极数知来之谓占，通变之谓事。 盖九‘、六也者，占变之事也。 始乎参伍以变，错综其数。 天数五，地数五，天数二十有五，地数三十，凡天地之数五十有五，所以成变化而行鬼神者，未尝即谓其九、六也。 由天数谓一、三、五、七、九，而后知其积为二十有五； 地数谓二、四、六、八、十，而后知其积为三十。 由五位相得而各有合，乃以五已前为生数，五已后为成数，而一合六谓水，二合七谓金，三合八谓木，四合九谓火，五合十虚谓土，是九、六盘见其问，而未着所以用也。 五位已前，其体数； 五位已后，其用数也。 体之生数，以天一、天三、天五参之而九，地二、地四两之而六，参天两地而倚数，参参而九，参两而六，於是九、六特启其用也。 故以一四而伍，二三而五。 五因兼而五，是参伍之始变； 而以一伍五而六，二伍五而七，三伍五而八，四伍五而九，五虚伍而十，因以五兼十而十五，七兼八而十五，九兼六而十五，是所谓参伍以变，错综其数者也。 凡九、六、七、八之数，均得以地数之成，而成其天数之生也者，是所谓成象也。 是一五而六为老阴，二五而七为少阳，三五而八为少阴，四五而九为老阳，是九、六、七、八皇相变为用也。 世虽知阴阳之少者不变，老者则变。",
      "translated_text": "This suffices to elucidate the words of the *Great Commentary* on the *Yi*: each points to its specific destination, not being established for other purposes, but for the hexagrams themselves. This is precisely how one observes the movements of the world beneath Heaven, contemplates their convergence and interpenetration, and thereby conducts its rituals and decrees, determining fortune and misfortune. Transforming and裁ing it, extending and enacting it—only the direction of change matters. The direction of change refers to the hexagram to which it moves. Thus it is said: \"The movement of line-images arises within; fortune and misfortune manifest without. Achievement and enterprise are revealed through change; the sentiments of the sage are seen in the words.\" Hexagrams have great and small; words have peril and ease. The words, then, each point to their specific destination. Scholars rely on this to carefully observe change and establish hexagrams, leaning on numbers to generate lines. They delve into the profound to reach the utmost refinement, investigate the subtle to grasp the utmost change, and so attain the utmost spirit, harmonizing with the Dao/virtue and ordering through righteousness. They exhaust principle and fulfill nature to reach destiny, their minds encompassing the entire *Yi* in both substance and function—this is the ultimate attainment.\n\n*Yi Divination and the Pervasion of Change, Scroll the First* concludes.\n\n---\n\nThe *Yi* begins with the strokes of yin and yang, where yang’s stroke becomes odd and yin’s stroke becomes even. From the strokes of *Qian*, they divide to form the odd hexagrams *Zhen*, *Kan*, and *Gen*; from *Kun*, they divide to form the even hexagrams *Xun*, *Li*, and *Dui*. Thus it is said: yang hexagrams are odd, yin hexagrams are even; yang hexagrams contain more yin, yin hexagrams contain more yang. Though the odd and even, the few and the many, may seem calculable, they were never originally called nine or six.\n\nWhen the sages created the *Yi*, observing change in yin and yang to establish hexagrams, the Dao/Way of Heaven was called yin and yang; unfolding through hardness and softness to generate lines, the Dao/Way of Earth was called softness and hardness. Thus the *Yi* forms hexagrams with six strokes, dividing yin and yang, alternately employing softness and hardness, with six positions forming a pattern. What is called \"stroke\" and \"position\" refers to the hexagrams and lines. How could there ever have been a division into nine and six?\n\nYet when the strokes and positions of the doubled *Qian* hexagram are all yang-odd lines, the line statements invariably attach \"nine,\" and there is even the precedent of \"using nine.\" When the strokes and positions of the doubled *Kun* hexagram are all yin-even lines, the line statements invariably attach \"six,\" and there is even the precedent of \"using six.\" Moreover, the lines of every hexagram invariably attach \"nine\" or \"six.\" Scholars, habituated to what they have seen and heard, take this as truly being nine and six. From this, the origin of nine and six is no longer questioned—I privately find this strange.\n\nNine and six are numbers. The *Great Commentary* says: \"Exhausting numbers to know the future is called divination; pervading change is called affairs.\" Now, nine and six pertain to the affairs of divination and change. It begins with the alternation of threes and fives, interweaving their numbers. The numbers of Heaven are five; the numbers of Earth are five. The numbers of Heaven sum to twenty-five; the numbers of Earth sum to thirty. Altogether, the numbers of Heaven and Earth are fifty-five, through which transformations are accomplished and the spirits are set in motion—yet they were never originally called nine or six.\n\nFrom the numbers of Heaven—one, three, five, seven, nine—we know their sum is twenty-five. From the numbers of Earth—two, four, six, eight, ten—we know their sum is thirty. When the five positions mutually correspond, each having its pair, the numbers before five are called generating numbers, and those after five are called completing numbers. Thus one pairs with six to signify water; two pairs with seven to signify metal; three pairs with eight to signify wood; four pairs with nine to signify fire; five pairs with the void ten to signify earth. Here, nine and six emerge in their midst, though their use has not yet been made manifest.\n\nThe numbers before the five positions are their generative aspects; the numbers after the five positions are their functional aspects. The generative aspect of the body: Heaven-one, Heaven-three, and Heaven-five are combined to make nine; Earth-two and Earth-four are doubled to make six. Leaning on the numbers of three Heavens and two Earths, three threes make nine, and three twos make six—thus nine and six uniquely initiate their function.\n\nTherefore, one and four are arrayed in fives; two and three are arrayed in fives. Five, when combined, makes five—this is the beginning of the alternation of threes and fives. Then one arrays with five to make six; two arrays with five to make seven; three arrays with five to make eight; four arrays with five to make nine; the void five arrays to make ten. Thus five combines with ten to make fifteen; seven combines with eight to make fifteen; nine combines with six to make fifteen—this is what is meant by \"alternating threes and fives, interweaving their numbers.\"\n\nAll the numbers nine, six, seven, and eight equally attain completion through the completing numbers of Earth, thereby generating the generative numbers of Heaven—this is what is called \"forming images.\" Thus one with five makes six as old yin; two with five makes seven as young yang; three with five makes eight as young yin; four with five makes nine as old yang. Nine, six, seven, and eight are mutually transformed in their use. Though the world knows that the young of yin and yang do not change, while the old do change...",
      "overlap_context": " *Bo*, it says: *'Dragons battle in the wild.'\"* Though in the images of dragons and the matter of real dragons, there may be inconsistencies in rational inquiry, the six lines he cited from *Qian* and *Kun* were all mutually compared with the line statements of *Qian* and *Kun* in reverse, clarifying the hexagram to which they moved. This is to say that of the sixty-four hexagrams of the *Yi* and their three hundred eighty-four lines, the changes to which they move generally follow this method.",
      "start_char": 5596,
      "end_char": 6839,
      "start_sentence": 304,
      "end_sentence": 354,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.455201625823975,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\易筮通变.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "而习见於《易》全书之画，凡卦之爻， 奇之阳，其下分系以九； 耦之阴，其下分系以六，而不知 之画寔七， 之画寔皇八也。 何以明之？ 《易》，变易也； 极数知来之谓占，通变之谓事。 谓其占变之事，具蝶曹法，四营而成《易》，十有八变而成卦。 每三变而积为一爻，以四与八为奇耦。 而每三变各得一、四、二、八，则象震 ，象坎 ，象艮 ，则皆画为 之奇。 每三变各得一、八、二、四，则象巽 ，象离 ，象兑 ，则皆画为 之耦。 盖寓阴阳相索为六子之意，以三变皆得四，始画为 ，以象乾； 三变皆得八，始画为 ，以象坤。 凡一、四、二、八之积为一之定画，是谓七； 一、八、二、四之积为 之定画，是谓八，此两者其不变者也。 惟三变纯四，谓阳奇之极，为 之动爻，是谓九； 三变纯八，谓阴耦之极，为 之动爻，是谓六； 此两者皆其变者也。 凡 奇 耦之定画，所以悉列於各卦之首者，不取其动，而专以标刚柔之体，不变而画为定卦。 至一九 六之变爻，杂然交寓於各卦之内者，不列於画，而专以寄阴阳之用，适变以动而为之卦，而乃所以着其用九、用六者也。 《乾凿度》曰：阳动而进#1，阴动而退。 故阳以七，阴以八为象； 阳变七之九，阴变八之六也。 晁说之以道曰：古者画卦之奇耦为阴阳，而卦爻但有六位，而未有七、八之名，因搽曹衍《易》，以老阳之变九、老阴之变六、少阳之变七、少阴之变八。 《周易》之七、八，即古之奇耦也。 《易》筮之九、六见於卦文#2则变焉#3如六位皆九，即《乾》之《坤》； 六位皆六，即《坤》之《乾》也。 此则用九用六之例，足以明与。 今我所见，皇同然也。 今之《左传》之所纪，复有可以相明，而且有不得不究其所注之失者。 鲁穆姜。 薨于东宫。 始往而筮之，遇《艮》之八 。 也史曰：是谓《艮》之《随》 。 随其出君必速出。 姜曰：亡。 是於《周易》曰：《随》，元、亨、利、贞，无咎。 元，体之长也； 亨，嘉之会也； 利，义贞，事之干也。 体仁足以长人，嘉会足以合礼，利物足以和义，固足以干事。 然固不可诬也，是以虽《随》无咎。 今我妇人而与於乱，不可谓无； 不靖国家，不可谓亨； 作为害身，不可谓利； 弃位而姣，不可谓贞。 有四德者，《随》而无咎。 我皆无之，岂《随》也哉？ 我则取恶，不可作而害，，能无咎乎？ 必死是宫，不得出矣。 故尝因是《艮》之八之筮，尤有以审七、八之定画，不为九、六之动爻，而注则误矣。 《周礼》大卜掌三《易》以行九筮，则日《连山》、《归藏》、《周易》，谓其经卦皆八，其别皆六十有四。 是《易》虽三名，筮则同一法也。 其以七、八为卦画之体，以九六为卦爻之用，是以谓《艮》之八也。 《艮》之变其初之《贲》 三之《剥》 四之《旅》 ，五之《渐》 ，上则之《谦》 ，趋明其筮是《艮》之一卦，凡六爻而爻之变者已。 凡五卦之之者，亦五矣。 史杂而视之，无所适从於断也。 惟二爻之 阴耦无所变，无所之尔，故覆而断之以《艮》之《随》 也。 且即稽其筮而曰：《随》其出也，君必速出。 姜则自审，无以当此卦之德也。 因谓是於《周易》曰：《随》，元、亨、利、贞，无咎。",
      "translated_text": "Yet what is commonly observed in the diagrams throughout the *Book of Changes*—where the lines of the hexagrams, the odd as yang, are appended below with \"nine,\" and the even as yin, are appended below with \"six\"—obscures the fact that the yang line is fundamentally seven, and the yin line fundamentally eight.\n\nHow is this made clear? The *Changes* means \"transformation\"; \"exhausting numbers to know the future\" is called divination, and \"penetrating transformation\" is called affairs. It is said that the affairs of divination and transformation follow the method of the milfoil stalks: four operations complete the *Changes*, and eighteen changes complete a hexagram. Every three changes accumulate into one line, with four and eight serving as the odd and even. When each set of three changes yields one, four, two, and eight, they form the image of *Zhen* (☳), *Kan* (☵), and *Gen* (☶), all drawn as the odd line (⚊). When each set of three changes yields one, eight, two, and four, they form the image of *Xun* (☴), *Li* (☲), and *Dui* (☱), all drawn as the even line (⚋). This embodies the idea of yin and yang seeking each other to generate the six children. When three changes all yield four, the line is drawn as ⚊ to image *Qian* (☰); when three changes all yield eight, the line is drawn as ⚋ to image *Kun* (☷). The accumulation of one, four, two, and eight into a fixed line is called seven; the accumulation of one, eight, two, and four into a fixed line is called eight—these two are the unchanging ones. Only when three changes yield pure four is it called the extreme of yang odd, the moving line of ⚊, called nine; when three changes yield pure eight, it is called the extreme of yin even, the moving line of ⚋, called six—these two are the changing ones.\n\nAll the fixed lines of odd and even, which are exhaustively listed at the beginning of each hexagram, do not take their movement but specifically mark the body of hardness and softness, remaining unchanged to form the fixed hexagram. As for the changing lines of nine and six, which are intermingled within each hexagram, they are not listed in the diagram but specifically lodge the function of yin and yang, adapting to change and movement to form the hexagram—this is what is meant by \"using nine\" and \"using six.\" The *Qianzao Du* states: \"Yang moves and advances; yin moves and retreats.\" Thus yang takes seven and yin takes eight as their images; yang transforms seven into nine, and yin transforms eight into six.\n\nChao Yuezhi expounded in terms of the Dao: \"In ancient times, the odd and even of hexagram lines represented yin and yang, and the hexagram lines had only six positions without the names seven and eight. Following the milfoil divination of the *Changes*, the old yang changes to nine, the old yin changes to six, the young yang changes to seven, and the young yin changes to eight. The seven and eight of the *Zhou Changes* are the ancient odd and even. When the nine and six of the *Changes*’ divination appear in the hexagram text, they transform accordingly. If all six positions are nine, it becomes *Kun* from *Qian*; if all six positions are six, it becomes *Qian* from *Kun*. This is the example of 'using nine' and 'using six,' which suffices to clarify the matter. What I have seen is universally the same.\n\nNow, what is recorded in the *Zuozhuan* can further elucidate this, and there are instances where one cannot but examine the errors in its annotations. When Lady Mu Jiang of Lu was about to die in the Eastern Palace, she first went and divined, encountering *Gen* changing to eight. The scribe said: \"This is called *Gen* changing to *Sui*.\" \"Following it, the lord will swiftly depart.\" Jiang said: \"Perish. As for the *Zhou Changes*, it says: '*Sui*: origin, prosperity, benefit, and perseverance—no blame.' Origin is the leader of the body; prosperity is the gathering of excellence; benefit and perseverance are the backbone of affairs. Embracing benevolence suffices to lead others; gathering excellence suffices to accord with ritual; benefiting things suffices to harmonize righteousness; being steadfast suffices to manage affairs. Yet this cannot be deceived, which is why even *Sui* has no blame. Now I, a woman, have partaken in disorder—this cannot be called 'no blame.' Not pacifying the state—this cannot be called 'prosperity.' Acting to harm myself—this cannot be called 'benefit.' Abandoning my position and being licentious—this cannot be called 'perseverance.' One who possesses these four virtues may follow *Sui* without blame. I possess none of them—how can this be *Sui*? I will incur misfortune; if I act and bring harm, how can there be no blame? I will surely die in this palace and not depart.\"\n\nThus, this divination of *Gen* changing to eight further confirms that seven and eight are the fixed lines, not the moving lines of nine and six, and the annotation is mistaken. The *Rites of Zhou* states that the Grand Diviner oversees the three *Changes* to perform the nine divinations, namely *Lianshan*, *Guicang*, and *Zhouyi*, saying that their primary hexagrams are all eight, and their derivations are all sixty-four. Though the *Changes* have three names, the divination follows a single method. Taking seven and eight as the body of the hexagram lines and nine and six as the function of the hexagram lines is why it is called *Gen* changing to eight. The changes of *Gen* are: the first line to *Bi* (☷→☲), the third line to *Bo* (☷→☷), the fourth line to *Lü* (☷→☴), the fifth line to *Jian* (☷→☴), and the top line to *Qian* (☷→☶). This clarifies that the divination pertains to the single hexagram *Gen*, where all six lines have already changed except one. The five hexagrams to which it changes are also five. The scribe viewed them indiscriminately, unable to decide on the judgment. Only the second line, being an unchanging yin even, had nowhere to transform, so he reversed the judgment to *Gen* changing to *Sui*.\n\nMoreover, examining the divination, he said: \"*Sui*—following it, the lord will swiftly depart.\" Jiang then self-examined and found nothing to match the virtues of this hexagram. Thus, she said: \"As for the *Zhou Changes*, it says: '*Sui*: origin, prosperity, benefit, and perseverance—no blame.'\"",
      "overlap_context": "ven, and eight equally attain completion through the completing numbers of Earth, thereby generating the generative numbers of Heaven—this is what is called \"forming images.\" Thus one with five makes six as old yin; two with five makes seven as young yang; three with five makes eight as young yin; four with five makes nine as old yang. Nine, six, seven, and eight are mutually transformed in their use. Though the world knows that the young of yin and yang do not change, while the old do change...",
      "start_char": 6839,
      "end_char": 8056,
      "start_sentence": 355,
      "end_sentence": 413,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.14651846885681,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\易筮通变.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "就申其释之者，如上云耳。 曷尝引《连山》、《归藏》二《易》，而且有所更筮哉？ 杜氏不明《周易》之筮， 耦之画本只谓八，乃妄指二《易》以七、八为占，且又谓史疑占《易》遇八为不利，更以《周易》占变爻而论之，何其误也。 由今窍之，则七、八之为卦体之成画，而不名九、六，不亦明矣哉？ 《国语》晋公子重耳筮尚有晋国。 得贞《屯》 悔《豫》 ，皆八。 韦昭注：震在《屯》之内卦，两阴爻不动； 震在《豫》之外卦，两阴爻亦不动，故曰皆八。 是其征也。 董因又筮之，得《泰》之八 ，昭又注：《泰》，无动爻，阴爻不动，其数皆八，则 为耦画之不动者皆为八。 又其征也。 由 耦之画不动者皆为八，则 奇之画不动者皆为七，校然明甚矣。 今《易》之全书，不见七、八，而唯见九、六，学者冥视其用九、用六之文承误於九、六之分，而未明九、六之例所以用者，其盘如前所论为之卦设也。 合《左传》凡云某卦之某卦者，皆以爻之动，而变者指其所之云尔。 所谓唯变所适也，以筮者尚其占，以动者尚其变； 爻也者，言乎其变者也。 圣人有以见天下之动，而观其会通，以行其典礼，系辞焉以断其吉凶，是故谓之爻。 言天下之动而不可乱，故曰：六爻之义易以贡也。 以是研之，定爻之 ，固自七、八。 而於其动，则七乃进为九， 而含阴； 八乃退而六， 而含阳也。 《传》於占之变卦之爻，固悉如前之卦之说，而於蔡墨之答魏献子之问龙，尤晓然着白也。 曰：《周易》有之，在《乾》之《姤》 ，曰：潜龙勿用。 其《同人》 曰； 见龙在田。 其《大有》 曰：飞龙在天。 其《夬》 曰：亢龙有悔。 其《坤》 曰：见覃龙无首，吉。 《坤》之《剥》 曰：龙战于野。 则足以见 七 八之动而变，始得谓九且六也。 不然，则《乾》之诸爻谓九者，其辞分配固如潜龙勿用等云； 而《坤》之上六，其辞固云龙战于野。 又何必枚举《乾》之《姤》、《坤》之《剥》等卦，然后始称其本爻九、六之下文以为所之之辞，而申见其例也哉？ 况《乾》卦於用九之下文曰：见旱龙无首，吉。 而墨乃特谓之《坤》，然后释之方如所云。 则凡用九为爻之变画，例此不约而合，尤未深切着明，可以不言而信矣。 其所以每爻先引之卦，而始征以其辞者，以见七之变，进而始为九、八之变，退而始为六也。 由是以夷考於《传》，凡所举之卦之辞，则见每爻之为九为六者，必待七、八之动，而变乃然也。 故有用九用六之例，是九、六之用。 如《乾》之初至上，皆必待阳 奇之七动而变，始谓九； 《坤》之初至上，皆必待阴 耦之八动而变，始谓六。 如晁氏云、九、六见於卦爻，则变六位皆九，即《乾》之《坤》； 六位皆六，即《坤》之《乾》也。 《乾凿度》重见其说：阳动而进，变七之九，象其气之息； 阴动而退，变八之六，象其气之消也。 又谓《乾》三十二世消，《坤》三十二世息也。 故《易·大传》曰：乾、坤，其《易》之门邪？ 生皿由乾、坤之门以入，则凡诸卦必仿此以通，每卦之变而始名九、六也，故用九、用六不见於它卦，而特见於《乾》、《坤》者。 生皿不止为《乾》、《坤》设，皇并它卦例以用之也。",
      "translated_text": "In elaborating this interpretation, as stated above—when did he ever cite the *Lian Shan* or *Gui Zang* versions of the *Changes*, let alone perform another divination? Du [You] failed to comprehend the divination method of the *Zhou Changes*. The fundamental lines of yin pairs are but eight, yet he rashly pointed to the two *Changes* [i.e., *Lian Shan* and *Gui Zang*] as using seven and eight for prognostication. Moreover, he claimed that when the scribe hesitated over an *Changes* divination encountering eight, it was deemed inauspicious, and thus resorted to the *Zhou Changes* to assess the changing lines—how grievously mistaken! From today’s perspective, it is abundantly clear that seven and eight constitute the completed lines of a hexagram, not yet named nine or six.\n\nThe *Guo Yu* records that Duke Chong’er of Jin divined whether he would ascend to the rulership of Jin. He obtained the primary hexagram *Zhun* (☳) and the secondary *Yu* (☳→☷), both with eight. Wei Zhao’s commentary explains: In *Zhun*, *Zhen* (☳) is the inner trigram, and its two yin lines remain unchanging; in *Yu*, *Zhen* is the outer trigram, and its two yin lines likewise remain unchanging—hence both are called eight. This serves as evidence. Later, Dong Yin divined again and obtained *Tai* (☰→☷) with eight. Zhao’s commentary notes: *Tai* has no moving lines, and its yin lines remain unchanging, their number being eight—thus all unchanging yin pairs are counted as eight. This further confirms the principle. If unchanging yin pairs are eight, then unchanging yang lines must be seven—this is self-evidently clear.\n\nYet in the entire corpus of the *Changes*, seven and eight are nowhere to be found; only nine and six appear. Scholars blindly follow the usage of \"nine\" and \"six\" in the text, failing to grasp the rationale behind their application. The confusion persists, as previously discussed, because the lines are established for the hexagrams. All instances in the *Zuozhuan* where it states \"hexagram X changes to hexagram Y\" refer to the movement of lines and their transformations, indicating the direction of change. This is what is meant by \"only transformation determines the outcome.\" For the diviner, the prognostication hinges on the reading; for the moving line, the transformation is paramount. The term \"line\" (*yao*) speaks to its mutability. The sage perceived the movements of the world and observed their convergence and flow, thereby instituting rituals. He appended judgments to determine fortune or misfortune—hence the term \"line.\" It signifies the world’s movements, which must not be disordered. Thus it is said: \"The meaning of the six lines is easily proclaimed.\"\n\nUpon close examination, the fixed lines are inherently seven and eight. When they move, seven advances to nine, embodying yang within yin, while eight recedes to six, embodying yin within yang. The *Commentary* on divination and the changing lines of hexagrams consistently adheres to this principle, as clearly demonstrated in Cai Mo’s response to Wei Xianzi’s inquiry about the dragon. It states: \"The *Zhou Changes* contains this in *Qian* changing to *Gou* (☰→☱): 'The hidden dragon—do not act.' In *Tong Ren* (☰→☲), it says: 'The dragon appears in the field.' In *Da You* (☰→☲), it says: 'The dragon soars in the heavens.' In *Guai* (☰→☱), it says: 'The dragon exalts itself—there will be regret.' In *Kun* (☷), it says: 'See the crawling dragon without a head—auspicious.' In *Kun* changing to *Bo* (☷→☶), it says: 'Dragons battle in the wild.'\" This suffices to show that only when seven and eight move and transform do they become nine and six. Otherwise, the lines of *Qian* would uniformly be called nine, with their judgments distributed as \"hidden dragon—do not act,\" and so forth, while the top line of *Kun* would simply state \"dragons battle in the wild.\" Why then enumerate *Qian* changing to *Gou* or *Kun* changing to *Bo* before citing the judgments beneath the original lines of nine and six to illustrate the pattern? Moreover, beneath the \"use of nine\" in the *Qian* hexagram, it states: \"See the group of dragons without a head—auspicious.\" Yet Cai Mo specifically refers to it as *Kun* before interpreting it as such. This demonstrates that the \"use of nine\" as a changing line universally applies without exception, so evident that it requires no further elaboration.\n\nThe reason each line first cites the original hexagram before invoking its judgment is to show that seven’s transformation advances to nine, while eight’s transformation recedes to six. Scrutinizing the *Commentary*, every judgment cited for a hexagram reveals that a line is called nine or six only after seven or eight moves and transforms. Hence the conventions of \"using nine\" and \"using six\"—this is the application of nine and six. From the first to the top line of *Qian*, all must await the movement of yang’s seven before becoming nine; from the first to the top line of *Kun*, all must await the movement of yin’s eight before becoming six. As Chao [Yuezhi] stated: When nine and six appear in the lines of a hexagram, all six positions changing to nine becomes *Qian* changing to *Kun*, while all six positions changing to six becomes *Kun* changing to *Qian*. The *Qian Zaodu* reiterates this: \"Yang moves and advances, transforming seven into nine, symbolizing the growth of qi; yin moves and recedes, transforming eight into six, symbolizing the waning of qi.\" It further states: \"*Qian* wanes through thirty-two generations, *Kun* waxes through thirty-two generations.\" Thus the *Great Commentary* of the *Changes* says: \"Are *Qian* and *Kun* not the gateway of the *Changes*?\" All vessels (*min*) arise from the gateway of *Qian* and *Kun*. Every hexagram follows this pattern to achieve coherence, and only through transformation do lines acquire the names nine and six. Therefore, the \"use of nine\" and \"use of six\" appear exclusively in *Qian* and *Kun*, not in other hexagrams. The vessels are not established solely for *Qian* and *Kun*; the emperor applies their principles universally to all hexagrams.",
      "overlap_context": "ibe viewed them indiscriminately, unable to decide on the judgment. Only the second line, being an unchanging yin even, had nowhere to transform, so he reversed the judgment to *Gen* changing to *Sui*.\n\nMoreover, examining the divination, he said: \"*Sui*—following it, the lord will swiftly depart.\" Jiang then self-examined and found nothing to match the virtues of this hexagram. Thus, she said: \"As for the *Zhou Changes*, it says: '*Sui*: origin, prosperity, benefit, and perseverance—no blame.'\"",
      "start_char": 8056,
      "end_char": 9268,
      "start_sentence": 414,
      "end_sentence": 462,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.238908529281616,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\易筮通变.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "故占法谓六爻皆不变者，则断以本卦之《象》辞； 五爻皆变，一爻独不变者，则断以之卦爻之不动者之《象》辞，而不用爻辞者，是其爻不动，不得以名九、六故也。 欧阳永叔曰：《乾》曰用九，《坤》日用六，何谓也？ 曰：释七、八不用也。 《乾》爻七、九，九则变； 《坤》爻八、六，六则变； 《易》用变为占，故以名其爻也。 朱元晦甚称其说，则又曰：《乾》、《坤》之用九、用六，何谓也？ 曰：《乾》爻七、九，《坤》爻六、八，九、六变而七、八元为，《易》道占其变，故以占者为爻，不谓六爻皆九、六也。 及其筮也，七、八常多，而九、六常少，有元九、六者焉，不可不释也。 六十四卦皆然，特於《乾》、《坤》见之，则余可知尔。 且谓其按此说发明先儒所未到，最为有功。 论七、八多，而九、六少，又见当时占法三变皆卦，如一行说。 今愚又以是观之朱之所说，惟见欧说若晁说，朱盖所未见也。 至若《乾凿度》等书，儒者又鄙之，以为《易纬》，不惟不取，至有不观，有不见者，而不知其有可参考也。 自今校之，古今所见，固有不求同而同，不期然而然者，然皆未及於九、六之所以然。 如《左传》之卦之征验，以为《易》道欠事，故得兼载其详。 然余复审晁氏谓卦爻见九、六，不见七、八，特其致疑，而然非真有见於九、六者也。 谨按《说卦》昔者圣人之作《易》，幽赞於神明而生曹者，是已明着用筮之法矣。 其谓参天两地而倚数者，生皿参其三三而九为参天，已见乾元用九； 两其三二而六为两地，已见坤元用六，是九、六之用所由始也。 观变於阴阳而立卦者，是所谓立天之道日阴与阳，立地之道日柔与刚，立人之道日仁与义，兼三才而两之，故《易》六画而成卦，足以见标奇耦二於卦首，不动为定画，乃寄其七、八也。 至於发挥於刚柔而生爻者，爻与画异，爻之未变而动名画，画之既动而变为爻，故《易》六位而成章。 此卦画六位，自初至上，分阴阳定位，而以刚柔迭用於其中，变动不居，周流六虚，上下元常，刚柔相易，唯变所适。 或参天而九，或两地而六，用九用六，九、六所以变动於各爻，因以生之卦者也。 九之与六，何疑之有？ 圣人有以见天下之迹，见天下之动，拟诸形容，观其会通，击辞焉以断其吉凶，故谓其成章也。 其立言《易》简而理得，所以示天下后世者，至昭昭也。 学者既其名，未既其实，终身由之，而不知因疑生解，乃以为独有所见，自着其说，益可悲已。 故为之特发挥於是。 易筮通变卷中竟",
      "translated_text": "Thus, in divination practice, when none of the six lines change, the judgment is made according to the *Image* statement of the original hexagram. When five lines change and only one remains unchanged, the judgment is made according to the *Image* statement of the unchanging line in the resultant hexagram, rather than its line statement, for since the line does not move, it cannot be named nine or six.\n\nOuyang Yongshu asked: \"*Qian* says 'use nine,' and *Kun* says 'use six'—what does this mean?\" The answer: \"It explains why seven and eight are not used.\" In *Qian*, the lines are seven and nine, and nine transforms; in *Kun*, the lines are eight and six, and six transforms. The *Changes* employs transformation for divination, hence naming the lines accordingly.\n\nZhu Yuanhui greatly praised this explanation, adding: \"*Qian* and *Kun* use nine and six—what does this mean?\" The answer: \"In *Qian*, the lines are seven and nine; in *Kun*, they are six and eight. Nine and six transform, while seven and eight remain unchanging. The Dao of the *Changes* divines by transformation, thus naming the lines for the diviner, not because all six lines are nine or six. In divination, sevens and eights are commonly numerous, while nines and sixes are few. When no nine or six appears, it must still be explained. This holds true for all sixty-four hexagrams, though it is only explicitly stated in *Qian* and *Kun*—the rest may be inferred. Moreover, this explanation clarifies what earlier scholars had not reached, making it most valuable.\"\n\nThe observation that sevens and eights are many while nines and sixes are few also reflects the divination method of his time, where three changes determined the hexagram, as described by Yixing. Yet in my humble view, Zhu’s account only echoes the explanations of Ouyang and Chao, which Zhu himself may not have seen. As for works like the *Qianzao Du*, scholars dismiss them as *Apocrypha of the Changes*, not only ignoring them but even refusing to read them, unaware of their value for reference. Comparing ancient and modern views, one finds that while some insights align without seeking agreement, all fall short of explaining the *reason* for nine and six.\n\nTake the *Zuozhuan*, which records hexagrams and their verifications, treating the *Changes* as lacking concrete affairs and thus preserving detailed accounts. Yet when Chao examined the hexagrams and saw nine and six but not seven and eight, he merely raised doubts, not truly understanding nine and six.\n\nCarefully considering the *Shuogua*: \"In ancient times, the sages created the *Changes*, assisting the numinous and bright to generate the milfoil stalks\"—this clearly establishes the method of divination. \"They reckoned by thrice heaven and twice earth, relying on numbers\": multiplying three thrice yields nine, corresponding to heaven (*Qian*’s \"use nine\"), and multiplying two thrice yields six, corresponding to earth (*Kun*’s \"use six\"). Thus begins the use of nine and six.\n\n\"Observing changes in yin and yang to establish hexagrams\" refers to what is called: \"The Dao of heaven is yin and yang; the Dao of earth is soft and hard; the Dao of humanity is benevolence and righteousness.\" Combining the Three Powers and doubling them, the *Changes* forms hexagrams with six lines, clearly marking the odd and even at the hexagram’s head. The unchanging lines are fixed as seven and eight.\n\n\"Expressing through hardness and softness to generate lines\": lines differ from positions. Before changing, a moving line is called a position; once moved and transformed, it becomes a line. Thus, the *Changes* forms patterns with six positions. These six positions in a hexagram, from bottom to top, divide yin and yang, alternately employing hardness and softness. They do not remain fixed but circulate through the six voids, with no constant above or below. Hard and soft replace each other, following only where change leads. Some reckon by heaven and become nine; some reckon by earth and become six. \"Use nine\" and \"use six\" are how nine and six transform within each line, thereby generating the resultant hexagram. What doubt can there be about nine and six?\n\nThe sages perceived the traces of the world and its movements, modeled them in form, observed their convergence and communication, and struck forth words to determine fortune or misfortune. Thus, they formed patterns. Their words in the *Changes* are simple yet principle-laden, illuminating for all under heaven and later generations. Yet scholars grasp only the names, not the reality, following them all their lives without understanding. Doubts give rise to explanations, each claiming unique insight and setting forth their own theories—how lamentable!\n\nTherefore, I have here particularly expounded upon this.\n\n*Yi Shi Tong Bian*, Volume Two, concludes.",
      "overlap_context": "ges* says: \"Are *Qian* and *Kun* not the gateway of the *Changes*?\" All vessels (*min*) arise from the gateway of *Qian* and *Kun*. Every hexagram follows this pattern to achieve coherence, and only through transformation do lines acquire the names nine and six. Therefore, the \"use of nine\" and \"use of six\" appear exclusively in *Qian* and *Kun*, not in other hexagrams. The vessels are not established solely for *Qian* and *Kun*; the emperor applies their principles universally to all hexagrams.",
      "start_char": 9268,
      "end_char": 10231,
      "start_sentence": 463,
      "end_sentence": 493,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.94205379486084,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\易筮通变.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "#1『进』，原作『确』，据四库本改。 #2『卦文』，四库本作『卦爻』。 #3门焉』，原作〔为』，据四库本改。 #4『穆姜』原作『穆华』，据四库本改。 易筮通变卷下 临川道士雷思齐学 衍数 天地之数五十有五，以天数之一、三、五、七、九而二十有五，地数之二、四、六、八、十而三十。 宜乎？ 断断乎不#1得有所损益，而大衍之数遽损其五，而特谓之五十，是以求其理而不得，稽其数而不合，卒莫之要其宿； 人莫不有说，说莫不有其理之似，而卒未有会其真是者，古犹今也。 《列子》之书，儒者桔於传习，盖所不取，所不观，殊不察。 其首篇谓：圣人因阴阳以统天地。 夫有形生於元形，则天地安从生，故日：有太易，有太初，有太始，有太素。 太易者，未见气者也； 太初者，气之始也； 太始者，形之始也； 太素者，质之始也。 气、形、质具而未相离，故日浑沦。 浑沦者，言万物相浑沦而未相离，故曰易也。 易变而为一，一者形变之始也。 是说也，重见於《易纬》之《乾凿度》，亦固谓然也。 由是而观，则《易》之有太极，而太极也者，特浑沦之寄称尔。 浑沦而上，既有谓易，谓初，谓始，谓素，凡四其称，而至於浑沦而五，故以浑沦为太极，是之谓五太也。 是则太极也者，既先含其五於中矣，故天地之数五十有五，而大衍之数乃五十者，既虚其太极己上之五，而取用於五十之妙也。 《大传》日：生生之谓易，成象之谓乾，效法之谓坤，极数知来之谓占，通变之谓事，阴阳不测之谓神。 盖谓是也。 由是知《易》有太极之为一，而一所以为形变之始矣。 既谓《易》有太极，而又谓为#2生生之谓易，而遂继以成象之谓乾，而不及太极，何也？ 是未识夫《易》者，至皿阴阳之总； 而太极者，特阴阳变化之宗会焉尔。 故曰：易变而为一，一者形变之始也。 《易》由太极以标其一，所以为成象之谓乾，即所谓形变之始，而乃所以为一也。 由乾分其一 以为二 ，而始谓之坤，是大衍五十不用之一，象之为《易》有太极之 。 而 之分为 ，所以象两。 夫两不谓二，而谓之象两，正以一之分也。 故大衍之五十，先尊其太极不用之一，以为生生之本。 而谓其用四十有九者，盖由一之二，其一以生两仪， 是分而为二以象两， 又参其一以为三才之道， 是挂一以象三，一复 其一为四象，则北、南、束、西之判，冬、夏、春、秋之序，水、火、木、金之位，莫不由是以着，则所以揲之以四以象四时者也。 而河图之数，所以四十者也。 然天地之数五十有五，大衍之数#3则五十。 天五既无位於四象，地十又元位於八卦，何其不合若是之甚也。 天五之有数而元位者，五之文，古之体为 ，象 交午以为五，今之体为 ，见阴阳之 交变於二之中以为五，而十之体亦兆见於此。 五固为土，而土之文为 ，为十为一，其始於一，而中於五，而终於十，而复归於一乎。 土亦元正位，故四象无五，八卦元十也。 盖尝探索於天地之数五十有五之元矣。 四象之一、二、三、四所以为八卦者，不过再用一、二、三、四，而各以五参之为六、七、八《九尔。 其数止四十八。 卦之一九而二八，三七而四六相交，而×十之其数，亦止此四十，未尝有天五地十之定位者，正以天五与地十以五乘十而为此大衍之五十也。",
      "translated_text": "**Emendations:**\n1. \"进\" (originally \"确\")—corrected per the *Siku Quanshu* edition.\n2. \"卦文\" (*Siku Quanshu* reads \"卦爻\").\n3. \"门焉\" (originally \"为\")—corrected per the *Siku Quanshu* edition.\n4. \"穆姜\" (originally \"穆华\")—corrected per the *Siku Quanshu* edition.\n\n---\n\n**Yi Shi Tong Bian, Volume Three**\n*Studied and Expanded by Daoist Lei Siqi of Linchuan*\n\n**Derivation of Numbers**\n\nThe numbers of heaven and earth total fifty-five: the heavenly numbers—one, three, five, seven, nine—sum to twenty-five, while the earthly numbers—two, four, six, eight, ten—sum to thirty. Ought this not be so? Yet it is emphatically impossible to add or subtract from them, yet the *Great Expansion*’s number abruptly reduces by five, calling it specifically fifty. Thus, seeking its principle yields no answer, verifying its sum brings no accord, and none can grasp its origin. People all offer explanations, each claiming semblance of reason, yet none ever attain its true essence—such was the case in antiquity as it is today.\n\nThe *Liezi* is a text Confucians dismiss through rote transmission, refusing to accept or even examine it. Yet its opening chapter states: \"The sages governed heaven and earth through yin and yang.\" If form arises from the formless, whence do heaven and earth originate? Thus it says: There is *Taiyi* (Grand Simplicity), *Taichu* (Grand Beginning), *Taishi* (Grand Commencement), and *Taisu* (Grand Simplicity of Substance). *Taiyi* is that which has not yet manifested qi; *Taichu* is the beginning of qi; *Taishi* is the beginning of form; *Taisu* is the beginning of substance. When qi, form, and substance are complete yet undifferentiated, it is called *hunlun* (chaotic wholeness). *Hunlun* signifies the myriad things intermingled and undivided—hence it is called *yi* (change). *Yi* transforms into *One*, and *One* is the beginning of form’s transformation.\n\nThis doctrine reappears in the *Qian Zaodu* of the *Yi Wei*, which likewise affirms it. From this perspective, the *Yi*’s *Taiji* (Supreme Polarity) is but a borrowed term for *hunlun*. Above *hunlun*, there are four designations—*yi*, *chu*, *shi*, and *su*—and with *hunlun* itself, five in total. Thus, *hunlun* is called *Taiji*, forming the \"Five Ultimates.\" Here, *Taiji* already contains these five within it. Therefore, while the numbers of heaven and earth total fifty-five, the *Great Expansion*’s number is fifty, having voided the five above *Taiji* to employ the marvel of fifty.\n\nThe *Great Commentary* states: \"Generation upon generation is called *yi*; forming images is called *Qian*; modeling patterns is called *Kun*; exhausting numbers to know the future is called divination; penetrating change is called affairs; the unfathomable of yin and yang is called the numinous.\" This is precisely its meaning. From this, we know the *Yi*’s *Taiji* as *One*, and *One* as the beginning of form’s transformation.\n\nYet while the *Yi* is said to have *Taiji*, it is also called \"generation upon generation is *yi*,\" immediately followed by \"forming images is *Qian*\"—without mention of *Taiji*. Why? This is because those who fail to comprehend the *Yi* do not grasp that it fundamentally unites yin and yang, while *Taiji* is merely the convergence of their transformations. Thus it is said: \"*Yi* transforms into *One*, and *One* is the beginning of form’s transformation.\" The *Yi* establishes *One* through *Taiji* to signify \"forming images is *Qian*,\" which is the beginning of form’s transformation—hence it is called *One*.\n\nFrom *Qian*, *One* divides into *Two*, thereby initiating *Kun*. The unused one in the *Great Expansion*’s fifty symbolizes the *Yi*’s *Taiji*. Its division into *Two* represents the Two Modes. That *Two* is not called \"two\" but \"symbolizing the Two Modes\" precisely reflects *One*’s division. Thus, in the *Great Expansion*’s fifty, the unused *Taiji* is first revered as the root of generation. The use of forty-nine arises from *One*’s division into *Two*: one generates the Two Modes, splitting into two to symbolize them. Then, one is further apportioned to embody the Way of the Three Powers, suspending one to symbolize the Three. One is again divided into the Four Images, establishing the distinctions of north, south, east, and west; the sequence of winter, summer, spring, and autumn; and the positions of water, fire, wood, and metal—all manifesting through this. Thus, the fourfold division to symbolize the four seasons corresponds to the *Hetu*’s number of forty.\n\nYet the numbers of heaven and earth total fifty-five, while the *Great Expansion*’s number is fifty. Heaven’s five has no position among the Four Images, and earth’s ten has no place in the Eight Trigrams—why such stark discrepancy? Heaven’s five, though numbered, lacks a position: the ancient form of \"five\" (五) resembles intersecting lines (×), while its modern form (五) reveals yin-yang’s alternation within *Two* to constitute five, with ten’s form also prefigured here. Five is inherently earth, and earth’s character (土) is ten and one—beginning with one, centering on five, culminating in ten, and returning to one. Earth also lacks a fixed position, hence the Four Images exclude five, and the Eight Trigrams exclude ten.\n\nI have long pondered the origin of heaven and earth’s fifty-five. The Four Images’ one, two, three, and four generate the Eight Trigrams by reapplying one, two, three, and four, each augmented by five to become six, seven, eight, and nine—totaling forty-eight. The trigrams’ one and nine, two and eight, three and seven, four and six intersect, and their sums likewise total forty, never assigning fixed positions to heaven’s five or earth’s ten. Precisely because heaven’s five and earth’s ten multiply to form the *Great Expansion*’s fifty.",
      "overlap_context": "termine fortune or misfortune. Thus, they formed patterns. Their words in the *Changes* are simple yet principle-laden, illuminating for all under heaven and later generations. Yet scholars grasp only the names, not the reality, following them all their lives without understanding. Doubts give rise to explanations, each claiming unique insight and setting forth their own theories—how lamentable!\n\nTherefore, I have here particularly expounded upon this.\n\n*Yi Shi Tong Bian*, Volume Two, concludes.",
      "start_char": 10231,
      "end_char": 11504,
      "start_sentence": 494,
      "end_sentence": 541,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.553821086883545,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\易筮通变.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "何以明之？ 、五之妙用，伍北坎之一．以五而合六为西北之乾，伍束震之三以五而合八为束北之艮者，先其方之正，后其维之偏； 伍西南坤之二以五而合七於西方之兑，伍束南巽#4之四以五而合九於正南面之离者，先其维之偏，后其方之正。 故阳奇得五而为阴耦，阴耦得五而为阳奇，所以分阴分阳，八卦以之成列。 至於十之用，则什离南之九以相对，而交十於坎北之一； 什兑西之七相对，而交十於震束之三，是阳数自交於阳，－而各立其方之正。 什艮束北之八以相对，而交十於坤西南之二； 什乾西北之六相对，而交十於巽束南之四，是阴数自交於阴，而均就其维之偏。 因而各虚五於中，则又皆十五之变。 所以刚柔相摩，八卦相荡相错，变而通之，推而行之者，见天五、地十独专五、十之用也。 故衍之於碟，必以四以象四时。 五、十之用，正在於．是。 其搽之以四者，盖由五其一、二、三、四於上，而十其六、七、八、九於下，足以明之五与天一合而成六，则四其六而二十有四，为老阴坤之策； 五与地二合而成七，则四其七而二十有八，为少阳震、坎、艮之策； 五与天三合而成八，则四其八而三十有二，为少阴巽、离、兑之策； 五与地四合而成九，则四其九而三十有六，为老阳乾之策。 故少阴、阳之七、八不变，合之而十五，以为重卦之成画#5； 老阴、阳之九、六所以变者，合之而亦十五，以为重卦之动爻。 《易》之变通配四时，故四四而碟以象之。 其四营成《易》，莫不由此。 河图之实数四十，虚天五之二五，而以地十衍之而五十也。 夫#6四营成《易》，四四而揲，每爻之揲凡三，每碟其蓍以合左右之奇，或一三而四，或三一而四，或二二而四。 其或左奇既先四，则右奇后亦必四。 因二其四耦之成八，以纪其数者，奇必有耦也。 奇四而耦八，亦见数之四十增八者，河图四十而成八卦也＇。 然其所碟之四，未尝五与九也。 今碟蓍者，必谓初搽不五则九，始由《易疏》谓：第一变之奇，不五则九； 第二揲、第三搽之奇，始皆不四则八。 原其第．一搽，误以未揲之先，所谓挂一之蓍同在数中以自乱其四而然也。 盖所揲之奇，四之上加一则五，八之上加一则九，所以见也。 殊不识此一之加为五为九，元成亏於所碟之四，而徒为扰扰耳。 且夫挂一，自当四营之一营，在分而象两之后、碟之以四之先，元未以#7之与於搽也。 ·若非以挂一之一误於自乱，则安得谓第二揲、第三搽而不四则八也？ 夫每更左右两揲四，始为一变，《传》谓十有八变而成卦，则凡碟之变固不容有所异也，安得每三搽之中，第一揲为不五则九也？ 如是，则十有八变中独六变。 若是之异，若於中六变独异，则又安得总谓十有八变也哉？ 此孔《疏》始为此误，而后之来者既不加察，而传信传疑，愈说愈纷，卒未能有以正其误者，千载良一既也。 若谓挂一者，合置於奇数中之用以为数，则至於功而后挂者，又当何以哉？ 载原其误者，盖泥於衍数五十，其用四十有九，谓挂一之一实在四十有九所用之中，而不识夫挂一者，所以标#8每变四十有八之用，而计其＋t有八变之数，则乃所以为用也。 岂以夫一而自乱於四十有八所搽之众#9哉？",
      "translated_text": "How to elucidate this? The marvelous function of five and ten: pairing the one of Kan in the north with five to form six, yielding Qian in the northwest; pairing the three of Zhen in the east with five to form eight, yielding Gen in the northeast—here, the cardinal directions take precedence, the oblique positions follow. Pairing the two of Kun in the southwest with five to form seven, yielding Dui in the west; pairing the four of Xun in the southeast with five to form nine, yielding Li in the due south—here, the oblique positions take precedence, the cardinal directions follow. Thus, yang’s odd numbers gain five to become yin’s even numbers, and yin’s even numbers gain five to become yang’s odd numbers, by which yin and yang are divided and the Eight Trigrams arrayed.\n\nAs for the function of ten: multiplying the nine of Li in the south to pair with and exchange ten for the one of Kan in the north—yang numbers self-exchange within yang, each establishing its cardinal direction. Multiplying the seven of Dui in the west to pair with and exchange ten for the three of Zhen in the east—yin numbers self-exchange within yin, each settling into its oblique position. Leaving five vacant at the center, all become variations of fifteen. Thus, hardness and softness grind against each other, the Eight Trigrams surge and interlock, transforming and flowing, extending and enacting—revealing the singular function of heaven’s five and earth’s ten.\n\nTherefore, in divination with milfoil stalks, four must be used to symbolize the four seasons. The function of five and ten lies precisely here. The reason for manipulating them with four is this: five unites the one, two, three, and four above, while ten unites the six, seven, eight, and nine below. This clarifies how five, combined with heaven’s one, forms six—four times six makes twenty-four, the count for old yin Kun; five combined with earth’s two forms seven—four times seven makes twenty-eight, the count for young yang Zhen, Kan, and Gen; five combined with heaven’s three forms eight—four times eight makes thirty-two, the count for young yin Xun, Li, and Dui; five combined with earth’s four forms nine—four times nine makes thirty-six, the count for old yang Qian. Thus, the unchanging seven and eight of young yin and yang combine to make fifteen, forming the lines of the hexagrams; the changing nine and six of old yin and yang also combine to make fifteen, forming the moving lines of the hexagrams. The *Changes*’ transformations correspond to the four seasons, hence four times four stalks are used to symbolize them. The four operations complete the *Changes*—none do not proceed from this.\n\nThe *River Diagram*’s solid numbers total forty, omitting heaven’s five and two fives, yet using earth’s ten to derive fifty. Now, the four operations complete the *Changes*, and four times four stalks are counted. For each line, the stalks are counted three times, and the milfoil is combined with the left and right remainders—sometimes one and three make four, sometimes three and one make four, sometimes two and two make four. If the left remainder first reaches four, the right remainder must also subsequently reach four. Doubling the four pairs to make eight records the count, for odd numbers must have even counterparts. Odd numbers make four, even numbers make eight—this also shows how the count of forty increases by eight, for the *River Diagram*’s forty completes the Eight Trigrams.\n\nYet among the counted fours, five and nine never appear. Now, those who manipulate milfoil stalks insist that the first count must be either five or nine, originating from the *Yi Shu*, which states: the first change’s remainder must be either five or nine; the second and third counts’ remainders must be either four or eight. The error in the first count arises from including the \"hanging one\" stalk—still uncounted—within the total, thereby disrupting the four. For the counted remainders, adding one to four makes five, and adding one to eight makes nine—this is how it appears. Yet they fail to recognize that this added one, whether five or nine, fundamentally disrupts the counted four, causing nothing but confusion.\n\nMoreover, \"hanging one\" is itself one of the four operations, occurring after the division symbolizing the Two and before the counting by fours—it has not yet been included in the counts. Were it not for the error of misplacing the \"hanging one\" within the counts, how could they claim that the second and third counts must be either four or eight? Each alternation of left and right counts of four constitutes one change. The *Commentary* states that eighteen changes complete a hexagram, so all counts in the changes must not differ—how can the first count in every three counts be either five or nine? If so, then among the eighteen changes, six would be distinct. If six changes alone differ, how can they still be called eighteen changes?\n\nThis error originated with Kong’s *Subcommentary*, and later scholars, failing to examine it closely, transmitted belief and doubt alike, growing ever more entangled, until none could correct the mistake—truly a lamentable oversight across a thousand years. If they claim that the \"hanging one\" is included in the odd numbers to serve as a count, then what of the \"hanging one\" performed after the operation? Tracing the source of the error, they clung to the derived number fifty, whose use is forty-nine, insisting that the \"hanging one\" is included within the forty-nine stalks used, unaware that the \"hanging one\" marks the use of forty-eight stalks in each change and calculates the total of eighteen changes—this is its true function. How could the one disrupt the many counts of forty-eight?",
      "overlap_context": "and earth’s fifty-five. The Four Images’ one, two, three, and four generate the Eight Trigrams by reapplying one, two, three, and four, each augmented by five to become six, seven, eight, and nine—totaling forty-eight. The trigrams’ one and nine, two and eight, three and seven, four and six intersect, and their sums likewise total forty, never assigning fixed positions to heaven’s five or earth’s ten. Precisely because heaven’s five and earth’s ten multiply to form the *Great Expansion*’s fifty.",
      "start_char": 11504,
      "end_char": 12716,
      "start_sentence": 542,
      "end_sentence": 581,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.25042986869812,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\易筮通变.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "故所搽之蓍，皇行其变者四十有八标#10、夫挂一者以纪其变之十有八，固所以为四十有九之用，并与其始太极所不用之一通为大衍之五十也。 所以谓夫五十者，蓄之德员而神者，其员以七，七七而四十有九； 卦之德方以知者，其方以八，八八而六十有四。 是以七合八之十五，既合而见於蓍卦之数矣。 六爻之义易以贡者，乃散而分见於《戏」之用九、《坤》之用六，以九合六之十五之甩，而由五以下七、八、九、六元有不着於用者焉。 故以五乘十，而所以谓为大衍五十也。 若是，则由天之与地，自一而至十，五十有五之数，莫不真见其着落，□而大衍之五十与其用四十有九者，亦莫不悉究其诣实。 其谓生生之易，成象之乾，效法之坤，极数知来之占，通变之事，於此瞭然可尽，至於阴阳不测之谓神，神而明之存乎其人哉。 命蓄 《说卦》曰：昔者圣人之作《易》也，幽赞於神明而生蓍，参天两地而倚数，观变於阴阳而立卦，发挥於刚柔而生爻。 若是，则蓍岂徒生？ 数岂虚倚？ 卦岂苟立？ 而爻岂馒为哉？ 因爻画卦，因卦兆数，因数用蓍，以极天下之迹，以鼓天下之动，由此其选也。 《大传》曰：蓍之德员而神，卦之德方以知，六爻之义易以贡。 此大衍之数之蓍所由着也。 大衍之数，至皿五十其蓍，而其用乃四十有九者，盖已尊其一於不用，以为太极之全体，是所谓《易》有太极者也。 乃分其四十有九之蓍，列左右，为二以象两，是所谓太极生两仪也。 两仪者阴阳，阴阳相仪匹而有老少，则两仪已含四象矣。 乃左取蓍而挂其一以象三，八卦之画以三而成，则三才之道也。 益以元五十不用之一，与分两之二兼之而成此三也，是於分两之二，推其一以挂於两之际，所以象人极之立位乎两问也。 是则参天两地而倚数，特寓於此，不用之一，象两之二，挂一之三，参天也。 分而象两，固所以两地者也。 於是观变於阴阳而立卦矣。 所谓太极不用之一，虽不以为用，而乾阳之始一，皇兆乎此，则其用未始不由此以出也。 因此，乾用之一以分而为坤体之二，则所谓象两而为两仪，以两仪而一阴一阳以老、少於其位，是两仪已含四象矣。 是以继之以象三之一，而分阴分阳，迭柔刚而用之，而象三以画，则四象遂生八卦，而八卦者已成列矣。 八卦各三位，八卦而小成，三极之道於是乎见矣。 合而言之，是《易》有太极，是生两仪，两仪生四象，四象生八卦，已着於用而成於体矣。 然而大衍之数之用，虽略见於分两挂一之始，而未大成也。 且太极不用之一，象两之二，挂一之三，虽等列而三位，而其正用之蓍特不用之一，与挂一之一，其实数特二尔。 且以五十而始用其二，则未用之蓍正存四十有八，是用河图之数四十以行八卦也。 且八卦各六位，以八卦而其位各六而八之，非四十有八者乎？ 八卦虽八八而六十四，而其为游魂、归魂者凡十有六，不列於正八卦之六位，故其数止於四十有八也。 由四十有八，而上虚此十六卦为四四以揲之用，乃所以成六十有四也。 於是乎观变於阴阳而立卦，则遂发挥於刚柔而生爻。 爻也者，效天下之动者也。 立天之道日阴与阳，立地之道日柔与刚，立人之道曰仁与义，兼三才而两之，故《易》六画而成卦也。",
      "translated_text": "Thus, the yarrow stalks manipulated in each change number forty-eight, and the \"hanging one\" serves to record the eighteen changes—this is precisely how the forty-nine stalks are employed, combining with the one unused at the inception of the Great Ultimate to form the fifty of the *Dayan*. The reason fifty is called such lies in the virtue of the yarrow, which is round and spirit-like: its roundness is expressed in sevens, and seven sevens make forty-nine. The virtue of the hexagrams is square and knowing: their squareness is expressed in eights, and eight eights make sixty-four. Thus, the union of seven and eight—fifteen—is already manifest in the numerical interplay of yarrow and hexagrams.\n\nThe meaning of the six lines, which alternate to offer tribute, disperses and appears separately in the *Xian* hexagram’s \"nine in use\" and the *Kun* hexagram’s \"six in use,\" where the sum of nine and six—fifteen—is employed, while the numbers five and below, along with seven, eight, nine, and six, remain unused. Therefore, multiplying ten by five yields the *Dayan*’s fifty. In this way, from heaven and earth, from one to ten, the number fifty-five reveals its true manifestation, and the *Dayan*’s fifty, along with its use of forty-nine, are likewise thoroughly examined in their essence.\n\nHere, the ceaseless generation of the *Yi*, the formation of images in *Qian*, the emulation of *Kun*, the divination that exhausts numbers to foresee the future, and the affairs of universal transformation—all become perfectly clear. As for the unfathomable interplay of yin and yang, called the spirit-like, \"only the spiritually enlightened can preserve its clarity\"—this depends on the individual.\n\nThe *Shuo Gua* states: \"In ancient times, the sages created the *Yi*, subtly aiding the spirit-like to generate the yarrow, measuring by three heavens and two earths to establish numbers, observing changes in yin and yang to erect hexagrams, and unfolding through hardness and softness to produce lines.\" If so, how could the yarrow arise idly? How could numbers be established in vain? How could hexagrams be erected casually? And how could lines be formed without purpose? Through lines, hexagrams are drawn; through hexagrams, numbers are divined; through numbers, yarrow is employed—to exhaust the traces of the world and to stimulate the world’s movements, this is their sequence.\n\nThe *Great Commentary* says: \"The virtue of the yarrow is round and spirit-like; the virtue of the hexagrams is square and knowing; the meaning of the six lines is to alternate and offer tribute.\" This is how the *Dayan*’s numbers are manifested in the yarrow. The *Dayan*’s number reaches fifty stalks, yet only forty-nine are used—this is because one is revered as unused, embodying the complete form of the Great Ultimate, which is what is meant by \"the *Yi* possesses the Great Ultimate.\"\n\nThen, the forty-nine stalks are divided, arranged left and right into two to symbolize the Two Modes—this is \"the Great Ultimate generates the Two Modes.\" The Two Modes are yin and yang; when yin and yang mutually model each other with elder and younger, the Two Modes already contain the Four Images. Next, one stalk is taken from the left and \"hung\" to symbolize the Three—the trigrams are formed by three strokes, embodying the Dao of the Three Powers. Adding the unused one from the original fifty, combined with the two from the divided pair, completes this Three. Thus, in dividing the two, one is set aside and \"hung\" between them, symbolizing the establishment of the human pole between the Two Modes.\n\nHere, \"measuring by three heavens and two earths\" is subtly embedded: the unused one symbolizes the two, and the \"hanging one\" makes three—this is \"measuring by three heavens.\" Dividing to symbolize the two is indeed \"measuring by two earths.\" From this, changes in yin and yang are observed to erect hexagrams. The unused one of the Great Ultimate, though not employed, marks the inception of *Qian*’s yang with the first one, so its use ultimately arises from this.\n\nTherefore, *Qian*’s one is divided to form *Kun*’s two—this is \"symbolizing the Two to become the Two Modes.\" With the Two Modes, one yin and one yang, elder and younger occupy their positions, so the Two Modes already contain the Four Images. Following this, the \"hanging one\" symbolizes the Three, dividing yin and yang, alternating softness and hardness in use, and drawing with the Three—thus the Four Images generate the eight trigrams, and the eight trigrams are fully arrayed. Each of the eight trigrams has three positions, and with eight trigrams, a minor completion is achieved—the Dao of the Three Extremes is thereby revealed.\n\nTaken together, this is: \"The *Yi* possesses the Great Ultimate, which generates the Two Modes; the Two Modes generate the Four Images; the Four Images generate the eight trigrams\"—this is manifest in use and complete in form. However, the application of the *Dayan*’s numbers, though briefly seen in the initial division of two and \"hanging one,\" is not yet fully realized.\n\nMoreover, the unused one of the Great Ultimate, the two symbolizing the Two Modes, and the three of the \"hanging one,\" though arrayed in three positions, in actual use, only the unused one and the \"hanging one\" are employed—thus, the true count is merely two. Since fifty stalks begin with the use of two, the unused stalks remain forty-eight, corresponding to the *Hetu*’s number forty, which operates the eight trigrams. Each of the eight trigrams has six positions; with eight trigrams, each having six positions, is this not forty-eight? Though the eight trigrams multiply to sixty-four, the sixteen \"wandering\" and \"returning\" hexagrams are not listed among the six positions of the eight primary trigrams, so their number is limited to forty-eight.\n\nFrom forty-eight, the sixteen hexagrams are abstracted above as four sets of four for the purpose of manipulation, thereby completing the sixty-four. Thus, observing changes in yin and yang to erect hexagrams, one then unfolds through hardness and softness to generate lines. Lines are what imitate the world’s movements. The Dao of heaven is established as yin and yang; the Dao of earth as softness and hardness; the Dao of humanity as benevolence and righteousness. Combining the Three Powers and doubling them, the *Yi* forms hexagrams with six lines.",
      "overlap_context": "included in the odd numbers to serve as a count, then what of the \"hanging one\" performed after the operation? Tracing the source of the error, they clung to the derived number fifty, whose use is forty-nine, insisting that the \"hanging one\" is included within the forty-nine stalks used, unaware that the \"hanging one\" marks the use of forty-eight stalks in each change and calculates the total of eighteen changes—this is its true function. How could the one disrupt the many counts of forty-eight?",
      "start_char": 12716,
      "end_char": 13942,
      "start_sentence": 582,
      "end_sentence": 620,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.607309818267822,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\易筮通变.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "前既以不用之一、象两之二、挂一之三等而三之，由三而四，故先以分左之蓍，揲之以四以象四时，四时而八节犹四象生八卦也。 故以四行八，足以见十六卦之四四，皇用六十四卦之八八也。 四四之奇，所以寄乾八八之奇，所以寄坤八八之奇，虽谓之耦，然亦奇。 四所协以配，故兼谓之归奇也。 所揲之奇，不一则二，不三则＇四，则归之功於是谓之归奇於功以象闰。 闰乃余数之所归，故以奇象之奇亦余也。 然后以分右之蓍，四四而揲，所揲之奇四且八之，其得一则先左之奇必三合之而四，得三则其先左之奇必一合之而四。 得二则其先左之奇亦必二通合之为四，得四则其先左之奇亦必四特合之为八，盖左先一而后右三，与左先三而后右一，固皆合四以为奇，而其左先二而后右二，虽亦合之为四，而理乃倍四而耦八也。 若左奇既四，右奇亦四，因合而八以为耦。 耦虽谓八，亦奇四之分配以成之也。 犹坤之－，乃乾一之所分，故统谓之奇。 乃随后右所合之奇、所奇之蓍，再功于左，而兼取左右所奇者，挂之以待第二、第三变，是谓再劫而后挂也。 然而前挂一之挂，则谓於四十有九中，先取一蓍以独挂此劫，而后挂之挂，则特谓挂其所奇之蓍也。 乃又总前已分二，已挂一，与所已过揲之蓍，悉合之以还於大衍之初，是之谓四营而成《易》，而通为第一爻也。 所谓四营者，分二者，其一也； 挂一者，其二也； 揲四，其三也； 归奇终营，之四也。 其营既毕，所奇既挂，是为第一变之周也。 一变之后，存其前所奇之外，以所合前衍过搽之蓍，如第一变之分二之挂一之揲四之归奇再功。 而后挂其所奇，以合前变之奇，以待第三变也。 其第三变则又如第一、第二变之分二挂一、搽四归奇再功。 而合此三变所奇之蓍以数之，以四为少，八为多。 三变皆少，则所奇者十二，则其过搽之所存总四九三十有六，为乾之策； 三变皆多，则所奇者二十四，则其过揲之所存四六亦二十有四，为坤之策； 两多而一少，则所奇者二十，则其过揲之所存总四七二十有八，是为震，为坎，为艮之策； 两少而一多，则所奇者十六，则其过揲之所存总四八三十有二，是为巽，为离，为兑之策。 凡如是三变竟始得为一爻之成昼，亦必以所奇之策，由初以终，自下而上，层积而纪之，如画卦之三爻。 然其奇之四为阳，八为阴，效八卦以取之。 两多而一少者，其先四、中八、后八为得阳之初，象少阳七之震 ； 先八、中四、后八为得阳之中，象少阳七之坎 ； 先八、中八、后四为得阳之上，象少阳七之艮 。 两少而一多，其先八、中四、后四为得阴之初，象少阴八之巽 ； 先四、中八、后四为得阴之中，象少阴八之离 ； 先四、中四、后八为得阴之上，象少阴八之兑 。 凡遇震、坎、艮，则皆画为 阳爻也； 遇巽、离、兑，则皆画为 阴爻也。 者皆谓之少者，象少者未遽变也。 独其三变通得四，四四者特谓为阳之纯，象老阳九之乾 ，乃画为 今俗谓重，为老阳九之爻。 其三变通得八，八八者特谓为阴之纯，象老阴六之坤 ，乃画为 今俗谓交，为老阴六之爻。 乾为老阳 者，本九奇而变含六耦之阴。 坤为老阴 者，本六耦而变含九奇之阳。",
      "translated_text": "Previously, the unused one, the two of images, and the three of \"hanging one\" were each multiplied by three, and from three to four, thus first dividing the left stalks. These were counted by fours to symbolize the four seasons, for just as the four seasons yield the eight solar terms, so too do the four images generate the eight trigrams. Therefore, by proceeding from four to eight, one sufficiently perceives the four-by-four of the sixteen hexagrams and the eight-by-eight of the sixty-four hexagrams in their imperial use. The odd numbers of the four-by-four serve to lodge the odd numbers of Qian’s eight-by-eight, while the odd numbers of Kun’s eight-by-eight, though termed even, are also odd. The four are harmonized in their pairing, hence they are collectively called \"returning odd.\" The odd numbers from the counting may be one or two, three or four, and their return is thus termed \"returning odd to achievement\" to symbolize intercalary months. Intercalary months are where surplus numbers return, hence the odd symbolizes the odd as surplus. Then, dividing the right stalks, counting by fours, the odd numbers from this counting may be four or eight. If one is obtained, the prior odd from the left must be combined with three to make four; if three is obtained, the prior odd from the left must be combined with one to make four. If two is obtained, the prior odd from the left must likewise be combined with two to make four; if four is obtained, the prior odd from the left must be combined alone with four to make eight. For whether the left is first one and the right three, or the left first three and the right one, they invariably combine to make four as odd. Yet when the left is first two and the right two, though they also combine to make four, in principle this doubles four to form the even eight. If the left odd is already four and the right odd is also four, their combination makes eight as even. Though termed eight, this even is formed by the distribution of odd fours. Just as Kun’s one is derived from Qian’s one, they are collectively termed odd. Then, after combining the odd from the right and the odd stalks, they are again applied to the left, and the odd from both left and right are \"hung\" to await the second and third changes—this is called \"repeated manipulation before hanging.\" However, the initial \"hanging one\" refers to taking one stalk from the forty-nine to hang separately during this manipulation, whereas the later \"hanging\" specifically means hanging the odd stalks. Then, summing the previously divided two, the already \"hung\" one, and the stalks already counted, all are recombined to return to the initial *dayan* number—this is called \"four operations to complete the *Yi*,\" thereby forming the first line. The so-called four operations are: dividing into two, the first; hanging one, the second; counting by fours, the third; and concluding the return of the odd, the fourth. Once these operations are complete and the odd stalks are hung, the first change is concluded. After one change, excluding the previously odd stalks, the stalks combined from the prior *dayan* counting are again subjected to the operations of dividing into two, hanging one, counting by fours, and returning the odd. Then the odd stalks are hung to combine with the odd from the prior change, awaiting the third change. The third change follows the same operations of dividing into two, hanging one, counting by fours, and returning the odd as the first and second changes. Combining the odd stalks from these three changes and counting them, four is considered few and eight many. If all three changes yield few, the odd stalks total twelve, leaving thirty-six from the counted stalks, which is Qian’s number. If all three changes yield many, the odd stalks total twenty-four, leaving twenty-four from the counted stalks, which is Kun’s number. If two are many and one few, the odd stalks total twenty, leaving twenty-eight from the counted stalks, which are the numbers of Zhen, Kan, and Gen. If two are few and one many, the odd stalks total sixteen, leaving thirty-two from the counted stalks, which are the numbers of Xun, Li, and Dui. Only after three changes are thus completed is one line formed. The odd numbers must be recorded from beginning to end, from bottom to top, layer by layer, like the three lines of a trigram. Here, four is yang and eight is yin, modeled after the eight trigrams. For those with two many and one few: if the sequence is first four, middle eight, last eight, the initial yang is obtained, symbolizing the lesser yang seven of Zhen; if first eight, middle four, last eight, the middle yang is obtained, symbolizing the lesser yang seven of Kan; if first eight, middle eight, last four, the upper yang is obtained, symbolizing the lesser yang seven of Gen. For those with two few and one many: if the sequence is first eight, middle four, last four, the initial yin is obtained, symbolizing the lesser yin eight of Xun; if first four, middle eight, last four, the middle yin is obtained, symbolizing the lesser yin eight of Li; if first four, middle four, last eight, the upper yin is obtained, symbolizing the lesser yin eight of Dui. Whenever Zhen, Kan, or Gen are encountered, a yang line is drawn; whenever Xun, Li, or Dui are encountered, a yin line is drawn. These are all termed \"lesser\" because the lesser has not yet transformed. Only when the three changes collectively yield four, and four-by-four, is this specifically termed the pure yang, symbolizing the old yang nine of Qian, and drawn as a solid line—commonly called \"double,\" representing the old yang nine. When the three changes collectively yield eight, and eight-by-eight, this is specifically termed the pure yin, symbolizing the old yin six of Kun, and drawn as a broken line—commonly called \"intersecting,\" representing the old yin six. Qian as old yang originally possesses nine odd numbers yet transforms to contain the even six of yin. Kun as old yin originally possesses six even numbers yet transforms to contain the odd nine of yang.",
      "overlap_context": "above as four sets of four for the purpose of manipulation, thereby completing the sixty-four. Thus, observing changes in yin and yang to erect hexagrams, one then unfolds through hardness and softness to generate lines. Lines are what imitate the world’s movements. The Dao of heaven is established as yin and yang; the Dao of earth as softness and hardness; the Dao of humanity as benevolence and righteousness. Combining the Three Powers and doubling them, the *Yi* forms hexagrams with six lines.",
      "start_char": 13942,
      "end_char": 15149,
      "start_sentence": 621,
      "end_sentence": 662,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.348349571228027,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\易筮通变.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "乾、坤之画兼谓老者，以老故变也。 其必三变始成一画者，寓阴阳变化拟议以定之也。 於三变所奇之策，第其四与八之互者，寓乾坤相索生六子意也。 凡如是而分而挂而搽，且初积其奇而合过搽之蓄者，三谓之三变，始谓一爻之成。 又如是而三变，则谓二爻之成。 又如是而三变，乃通谓三爻之成。 是谓九变。 九变备，三爻具，始可当为卦之八者，止三画，三其画而八之，则为八卦成列。 谓内卦，谓下卦，谓三微，谓内贞，是谓八卦而小成，是三《易》所谓经卦皆八也。 盖必又如是以营以分，以挂以揲，以初以计其所奇之积。 三而三之，以为九变； 再成三画，以为外卦，为上卦，为三蓍#11为外悔； 合前九变之三画，是谓六画而成卦，是三《易》所谓其别皆六十有四，始全其十有八变而成卦，以备六位成章也。 其所以变必十有八者，震、坎、艮各五画，得十五，用乾之三，为十八。 而二乾之一、三、五，固十八也。 巽、离、兑各四画得十二，用坤之六为十八。 而三坤之一不四，亦十八也。 合两十八，则为《乾》之策四九三十六，是前九变每爻四营，积九变之营，固三十六也。 倍之，则龟之策七十二。 五行之土，分王四时，各十八日，四其十八，亦七十二日。 各九十日，分土王之十八日，亦各七十二，故积十有八变，每变四营，通十八变，计其营之数亦七十二。 五其七十二，则三百有六十，当期之日。 故有取於十八变、七十二营，以用四十有九曹也。 盖前九变，三画分阴阳而列之，不过八卦成列而象在中； 后九变，三画迭柔刚而用之，乃因而重之而爻在中，因其十八变，而爻之迭柔刚也。 用此柔刚以相摩相荡，相推相易，而通其变； 引而伸之於六十四卦，唯变所适，是所谓变在其中。 由六十四卦触类长之於三百八十四爻之外，则天下之能事诚可毕矣。 曹之德可不谓员而神於其常用，卦之德可不谓方以知於其常体，而六爻之义可不谓易以贡於受命，如响之变化者乎？ 又可不谓寂然不动，感而遂通天下之故者乎？ 故以之通天下之志，成天下之务，定天下之业，而断天下之疑，其於幽赞於神明而生曹，参天两地而倚数，观变於阴阳而立卦，发挥於刚柔而生爻者，着岂徒生？ 数岂虚倚？ 卦岂苟立？ 而爻岂馒为哉？ 果能此道以神明其德，诚可以显道神德行，而酬醉佑神矣。 大衍之数五十，其用四十有九，其以是夫。 易筮通变卷下竟 #1『不』，原作『无』，据四库本改。 #2『为』，原作『朱』，据四库本改。 #3『数』，原作『五』，据四库本改。 #4『巽』，原作『其』，据四库本改。 #5『画』，原作『书』，据四库本改。 #6『夫』，原作『天』，据四库本改。 #7『以』，据四库本补。 #8『标』，四库本作『碟』。 #9『所碟之众』，原作『所搽者之众』，据四库本删『者』字。 #10『标』，四库本作『标』。 #11『曹』，原作『着』，据四库本改。",
      "translated_text": "The drawings of Qian and Kun are collectively termed \"old\" because it is by virtue of their age that they transform. That three changes must occur to complete a single line embodies the deliberation of yin-yang transformation to determine it. Among the counting rods left after three changes, the interplay of four and eight embodies the intent of Qian and Kun mutually seeking to generate the six children. Thus, through division, suspension, and manipulation—first accumulating the odd counts and then combining the surplus from repeated manipulations—three such operations are called \"three changes,\" which complete one line. Another three changes complete a second line, and yet another three changes complete three lines—this is called \"nine changes.\" When nine changes are complete and three lines are fully formed, these may correspond to the eight trigrams, which consist of only three lines. Tripling these three lines yields the eight trigrams in array. This is called the inner trigram, the lower trigram, the three subtle signs, or the inner constancy—here, the eight trigrams are said to be \"minor completion,\" as the three *Yi* texts all refer to the eight primary trigrams.\n\nThen, again through division, suspension, and manipulation—first accumulating the odd counts—three times three operations make nine changes, completing another three lines to form the outer trigram, the upper trigram, the three milfoil stalks, or the outer regret. Combined with the previous three lines from nine changes, this yields six lines to form a hexagram, which the three *Yi* texts refer to as the sixty-four distinct hexagrams. Only when all eighteen changes are complete is the hexagram fully formed, with its six positions fully expressed. The reason there must be eighteen changes is that Zhen, Kan, and Gen each require five lines, totaling fifteen, plus three from Qian, making eighteen. Alternatively, the first, third, and fifth lines of the two Qian hexagrams also total eighteen. Xun, Li, and Dui each require four lines, totaling twelve, plus six from Kun, making eighteen. Alternatively, the first, second, and fourth lines of the three Kun hexagrams also total eighteen. Combining these two eighteens yields Qian’s count of four nines—thirty-six. In the first nine changes, each line involves four manipulations, so nine changes accumulate thirty-six manipulations. Doubling this gives seventy-two, the count of tortoise-shell divination. The earth phase of the Five Agents governs the four seasons, each with eighteen days; four times eighteen also makes seventy-two days. Dividing each ninety-day season to include the earth’s eighteen-day reign also yields seventy-two. Thus, eighteen changes, with four manipulations per change, total seventy-two manipulations. Five times seventy-two makes three hundred sixty, corresponding to a full year’s days. Hence, the significance of eighteen changes and seventy-two manipulations in using the forty-nine milfoil stalks.\n\nThe first nine changes divide the three lines into yin and yang, merely arranging the eight trigrams in order with their images at the center. The latter nine changes interweave the three lines with softness and hardness, thereby doubling them to place the lines at the center. Through these eighteen changes, the lines alternate between softness and hardness. Using this interplay of soft and hard to mutually grind, agitate, push, and transform, their changes are made manifest. Extending this to the sixty-four hexagrams, wherever change leads, it is said that \"change resides within.\" From the sixty-four hexagrams, extending by analogy to the three hundred eighty-four lines beyond, the capabilities of the world may truly be exhausted. Can the virtue of the milfoil stalks not be called round and spirit-like in their constant use? Can the virtue of the hexagrams not be called square and knowing in their constant form? Can the meaning of the six lines not be called responsive in offering their mandate, like an echo’s transformations? Can they not be said to be quiescent yet unmovable, yet when stimulated, thoroughly penetrate all under heaven’s patterns?\n\nThus, they are used to penetrate the world’s aspirations, accomplish its tasks, establish its enterprises, and resolve its doubts. In their subtle assistance to the divine luminosity to generate the milfoil stalks, they participate in heaven and pair with earth to rely on numbers; they observe changes in yin and yang to establish hexagrams, and unfold through hardness and softness to generate lines—how could these be idly produced? How could numbers be vainly relied upon? How could hexagrams be carelessly established? How could lines be casually formed? Truly, by mastering this Dao to spiritually illuminate one’s virtue, one can manifest the Dao, spiritually empower conduct, and repay the divine with offerings. The Great Expansion’s number is fifty, of which forty-nine are used. Such is the reason. *Yi Divination and the Permeation of Change*, Scroll the Lower, concludes.",
      "overlap_context": "ine—commonly called \"double,\" representing the old yang nine. When the three changes collectively yield eight, and eight-by-eight, this is specifically termed the pure yin, symbolizing the old yin six of Kun, and drawn as a broken line—commonly called \"intersecting,\" representing the old yin six. Qian as old yang originally possesses nine odd numbers yet transforms to contain the even six of yin. Kun as old yin originally possesses six even numbers yet transforms to contain the odd nine of yang.",
      "start_char": 15149,
      "end_char": 16287,
      "start_sentence": 663,
      "end_sentence": 710,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.970696449279785,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\易筮通变.txt",
        "category": "正统道藏太玄部"
      }
    }
  ]
}