{
  "source_id": "显道经",
  "source_file": "chunked_daozang\\显道经.json",
  "total_chunks": 5,
  "total_original_chars": 5111,
  "total_translated_chars": 28587,
  "total_translation_time": 137.36343502998352,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\方法类\\显道经.txt",
    "category": "方法类"
  },
  "full_translation": "**The Scripture of Revealing the Dao**\n\n**Title:** *Scripture of Revealing the Dao*. Author unknown. One scroll. Source: *Daoist Canon of the Zhengtong Era*, *Dongshen* Section, Methods Category.\n\n---\n\n**The Scripture of Revealing the Dao**\n\nLaozi said: Man has five minds, and the face has five colors. When strength is robust and qi abundant, the flesh and skin are full. When bones surge, the face is white; when blood surges, the face is red; when marrow surges, the face is yellow; when flesh surges, the face is black; when essence surges, the face is radiant; when qi surges, the face is lustrous. Though their natures differ, hardness and softness are difficult to perfect. Some are wise, some are deluded; some are sincere and trustworthy, grasping the secrets of the Dao; others are violent and perverse, turning white to black, obscuring the Dao. Be cautious—do not transmit it to them.\n\nLaozi said: Man has prosperity and decline, foretold in the body. At fifteen, the spirit resides in the cinnabar field. At twenty, essence and qi grow stronger. At thirty, vigor prevails. At forty, the spirit of the head wanes, and white hair appears. At fifty, the spirit of the eyes wanes, and their luster fades. At sixty, the spirit of the viscera wanes, and the five throats are harmed. At seventy, the spirit of the feet wanes, and movement becomes labored. At eighty, the yin spirit wanes, and the stem loses strength. A lifespan of one hundred and twenty is the heavenly span—those with the Dao transcend; those without meet misfortune. No need for distant worries that deplete the spirit. Calm the mind, guard tranquility, embrace emptiness and simplicity, and you become a true person.\n\nLaozi said: The method of attaining the Dao is not singular in its transformations. Only the five viscera are where the Dao passes. The mysterious Dao has its root, standing in the Great Void. Taking non-action as its foundation, it cannot be lost or forsaken. The Dao has male and female, following one another without distinction. Its spirit is the hun-soul, uniting with the po-soul to transform into the red child. It nourishes the body’s bones, floating up and down, unobstructing the blood vessels. In decline, it finds no refuge; the spirit is not deluded. This is the Dao of essence—named \"simplicity.\"\n\nLaozi said: The Dao generates three divisions, each with its own name. Divided into the six bowels, they converge in the cinnabar field. They govern the hundred vessels, regulating yin and yang. With each inhalation and exhalation, there is death and life. Do not squander essence, lest the tally be lost. When the Dao is perfected in transformation, one ascends to the Great Mystery. The three unite as virtue, merging with heaven. Refining and returning the elixir is called \"naturalness.\"\n\nLaozi said: When first entering the chamber of the Dao, guard the Mysterious Origin. Within the mysterious lies the mysterious—this is my life. Within life lies life—this is my form. Within form lies form—this is my essence. Within essence lies essence—this is my qi. Within qi lies qi—this is my spirit. Within spirit lies spirit—this is my natural transformation into the Great Void. If one can preserve this, lifespan extends of itself.\n\nLaozi said: Virtue uses form as its chariot; the Dao uses qi as its horse. The hun-soul takes essence as its root; the po-soul takes the eyes as its gate. When form moves, virtue scatters; when qi strays, the Dao rebels. When essence dissipates, the hun-soul is harmed; when the eyes move, the po-soul scatters. Thus, the sage stills the form, seals the breath, accumulates essence, and cherishes vision. Virtue and the Dao congeal, hun and po are firmly guarded. Form unites, spirit multiplies, the Dao is perfected in transformation, and one faces peril without fear. This is the great essential of your cultivation in attaining the Dao.\n\nLaozi said: Those who unite with the Dao do not speak. Attaining the true without ornament, their hair flourishes. Grasping the root of the Dao, their hands and feet brim with qi, which does not leak day or night. The sun and moon merge their light; they neither hunger nor thirst. Like the tortoise and dragon, they practice embryonic breathing. In winter, they are warm; in summer, cool. The Daoist consumes the elixir of the mysterious, ascends to the Great Clarity, and returns to youth without aging. The Dao’s naturalness is not distant—it lies near, within one’s own body. In indistinctness, existence and non-existence intermingle; one conceals their form and hides their shadow. Permeating ten thousand miles, they observe the nine heavens. Holding the mind like water, life endures.\n\nLaozi said: The method of transmitting the Dao must select the gentle and benevolent, those without violence or impatience, whose practice swiftly succeeds. Without talent or skill, through accumulated practice, they enter the spirit. Those who attain it transcend; those who lose it are harmed. At the slightest beginning, the mysterious Dao is profound and obscure. Driving a horse ten thousand miles without encountering a viewer, within the bones, none are alike. Simply cultivate the body and guard the Dao—the Dao will naturally return to you.\n\n---\n\n**Explanation of the Plain Dao**\n\nLaozi said: When first entering the chamber of the Dao, on the day of breaking and removing, resolve the five transgressions and seven impurities. Bathe in flowing water, fast, and purify the body, so the five viscera are at peace, the mind and will are harmonious and content. Eliminate harm, abandon all affairs, embrace non-action and simplicity—then one may cultivate the Dao and clearly receive the master’s teachings.\n\nSomeone asked: When first entering the chamber of the Dao, should it be high, dry, and pure?\nLaozi said: First place live charcoal in the chamber to dispel dampness. Ensure there are no insects or rats. Shake out the curtains, bedding, and mats to remove dust and grime. Burn incense day and night so the interior is fragrant. Do not allow vessels or objects, for their presence distracts the mind.\n\nSomeone asked: When first entering the Dao, should one fast?\nLaozi said: First bathe for five days in orchid-scented water. When the body is dry and the hair is parched, with hunger and fullness balanced and essence and qi harmonious and joyful, then one may enter the chamber.\n\nSomeone asked: Does the Dao wish to hear the sounds of a hundred birds?\nLaozi said: Always have people drive away flying birds and crows, and keep dogs at a distance. Let the neighbors be free of clamor, taking clarity and stillness as the foundation.\n\nSomeone asked: In practicing the Dao, do the hands and feet have fixed measurements?\nLaozi said: Follow one’s intention to adjust them. Each has its own measure, not interfering with one another—this is called \"simplicity.\"\n\nSomeone asked: Does the Dao’s pillow and mat have methods for height and lowness?\nLaozi said: A high pillow contracts the liver; a low pillow sags the lungs. A four-inch pillow is level. The mat should be soft so the breath is long.\n\nSomeone asked: When practicing the Dao externally, should one lie supine? Some cannot lie perfectly supine—what then?\nLaozi said: Lying supine brings bodily ease, and the qi flows smoothly. Do not tilt or lean, bend or crouch.\n\nSupine posture is the great method of the Dao.\n\nSomeone asked: When first practicing the Dao, the breath is untrained—one wishes to lengthen it, yet it shortens; wishes to disperse it, yet it quickens; wishes to retain it, yet it returns. What is to be done?\nLaozi said: In the beginning, focus on clarity and stillness; do not force or prolong.\n\nSomeone asked: How does one verify when the breath arrives at the proper time?\nLaozi said: When the qi first arrives, the intestines rumble, the pulse stirs, and the hands and feet ache—this is the effect of qi.\n\nSomeone asked: What occurs when the qi reaches the body?\nLaozi said: As the qi reaches the body, the body gradually grows cold. If startled, calm the mind and steady the will; do not allow alarm, but let the qi act as it will.\n\nSomeone asked: From where does the Dao’s qi customarily exit and enter?\nLaozi said: The qi emerges from the cinnabar field (dantian), which is the life gate of humans, the root of original qi. The five viscera receive it, and from it issue the radiance and essence of qi’s ingress and egress.\n\nSomeone asked: The Dao’s qi is born in the dantian—through which viscera does it exit and enter?\nLaozi said: Exhalation enters the lungs and heart; inhalation enters the kidneys and liver. Exhalation and inhalation meet, converging at the great granary (taicang). The triple burner harmonizes and guides, restraining the hun and po souls. This is the natural qi, the life-prolonging Dao. Examine and practice it, and you will surely become a perfected person.\n\nSomeone asked: Does the practice of Dao and qi differ between day and night?\nLaozi said: By day, store it in the qi府 (qi repository), by night, store it in the spirit palace. The qi repository is called the dantian; the spirit palace is called the Hall of Light. If by day one does not store it in the qi repository, the original qi will not circulate; if by night one does not store it in the spirit palace, the eyes will not perceive the spirit.\n\nSomeone asked: When the Dao’s qi has not yet arrived, if one feels the need to rise, move about, or grows weary, is this permissible?\nLaozi said: If weary, one may rise and lie down at will. When the qi has not yet arrived, do not practice excessively.\n\nSomeone asked: Some can practice the Dao’s qi, while others cannot—why?\nLaozi said: It depends on one’s constitution. Those with essence find the Dao easy; those without essence find it difficult. The key lies in focused concentration, and there is also an element of destiny.\n\nSomeone asked: Do men and women follow the same method in practicing the Dao’s qi?\nLaozi said: A man with essence may attain qi in two or three days; a woman with essence may feel its circulation in four or five days, at which point she will perceive sights and sounds. These are the proofs of the Dao, the great effects of essence and qi.\n\nSomeone asked: Does the Dao differ between old and young?\nLaozi said: The young find qi easy to circulate; the old find it difficult, requiring more time. Those with scant qi should rest.\n\nSomeone asked: Why does the Dao use a three-inch tally to prop the dantian?\nLaozi said: When first practicing qi, one fears misdirecting the dantian, causing the qi to fail to flow. Thus, a tally is used to prop the dantian; lifting the tally allows the qi to reach that place.\n\nSomeone asked: When the dantian remains bright for a long time during practice, can one rely on this brightness without further effort?\nLaozi said: With frequent brightness, the field will not wither or sever. Over time, the field will naturally become visible, shining like daylight, and the qi will arrive like surging clouds.\n\nSomeone asked: When practicing the Dao, may one wear light clothing?\nLaozi said: At first, remove all clothing and lie unadorned, hands and feet at ease. If the coverlet is drawn away and the body does not grow cold, one need not fear later harm. Wearing light clothing is best.\n\nSomeone asked: After undressing for the Dao, may one rise?\nLaozi said: When the hands and feet are settled and the qi is gathered like a drum, call an attendant to bring clothing, then rise. Walk and stretch, lifting the gathered qi—this is to cherish the qi and prevent its escape.\n\nSomeone asked: May one practice the Dao several times a day?\nLaozi said: Practice the Dao three or four times a day. After a hundred days, the Dao will be accomplished, and one need not practice excessively, lest it steal one’s breath.\n\nSomeone asked: If one discontinues the Dao for a long time and then resumes, may one drink wine?\nLaozi said: One may, though those who indulge excessively and neglect the Dao for long, then resume, will find the qi flows as before.\n\nSomeone asked: If one has no chamber, may one practice outdoors?\nLaozi said: At first, practice in a chamber. After a hundred days, one may act freely, though nothing surpasses a secluded, pristine chamber.\n\nSomeone asked: What is the \"light ascent\" in the Dao? Does the body rise of its own accord in dreams?\nLaozi said: With long practice of the Dao, the spirit is invigorated, and the body rises of itself—this is the Dao nearing completion.\n\nSomeone asked: If one seeks transcendence through the Dao, must one cease interaction with the world?\nLaozi said: The world is full of desires, which scatter the mind. Enter the mountains and dwell in seclusion, guarding the will naturally. When merit is fulfilled and the form transforms, one attains longevity.\n\nSomeone asked: After the Dao is accomplished, may one enter the bedchamber?\nLaozi said: Those who wish to become flying immortals and transcend the world must not enter the bedchamber. Those who do not seek transcendence may act freely after a hundred days.\n\nSomeone asked: May one practice the Dao in the dead of night?\nLaozi said: It is forbidden. Night is the time of dead qi, when malevolent spirits roam. Day is the time of living qi; practice at cockcrow or dawn, when the sun rises, so the qi flows easily.\n\nSomeone asked: The Dao customarily begins at cockcrow—what of autumn and winter?\nLaozi said: In spring and summer, begin at cockcrow or dawn; in autumn and winter, at sunrise or mealtime. The key is a secluded chamber and gentle warmth—timing matters little.\n\nSomeone asked: What strange things appear in the Dao?\nLaozi said: After practicing the Dao for several tens of days, a white-haired old woman and a young girl may attend at one’s side, then suddenly vanish without a trace—these are the strange things.\n\nSomeone asked: If strange things appear during the Dao, should one move the hands and feet, speak recklessly, or close the eyes and contemplate the field?\nLaozi said: Focus the mind single-mindedly, close the eyes and contemplate the field, and circulate the qi as usual. Do not fear or doubt. Over time, the strange things will cease of themselves.\n\nSomeone asked: When practicing the Dao, one constantly closes the eyes and contemplates the field—how can one see strange things?\nLaozi said: If the mind is not focused and the will not settled, strange things appear. Do not consider them real, do not fear them, do not rise to attend to other matters, and do not speak to them. If you speak to them, they will take you away with them.\n\nSomeone asked: Before the Dao is attained, when the hands and feet stir and the mouth speaks recklessly, is this done deliberately or does it arise naturally?\nLaozi said: This is the natural work of qi, not taught by evil forces.\n\nSomeone asked: When practicing the Dao, if the hands and feet stir and the mouth speaks recklessly without cease, what should one do?\nLaozi said: For some, it lasts two periods; for others, one period. When the qi settles and the mind becomes single-minded, it will cease of itself.\n\nSomeone asked: If one sees strange things while practicing the Dao, should one tell others?\nLaozi said: If you tell others, the spirits will no longer return. Strange things are the couriers of the true person—do not scold or curse them; doing good is best.\n\nSomeone asked: After the Dao is understood, may one discuss inauspicious and evil things?\nLaozi said: Discussing inauspicious things invites misfortune and harm. Nightmares, confusion, and a host of evils will gather, making it difficult for the upright qi to arrive while the evil qi follows.\n\nSomeone asked: After the Dao is understood, when should one eat?\nLaozi said: Once the Dao begins its steps, eat after completing the steps. If you do not step, the qi will merge and digest food on its own.\n\nSomeone asked: What should one eat when practicing the Dao?\nLaozi said: Eat dry, light foods—grains, parched wheat, dried meat, dates, and chestnuts—to lengthen the breath and nurture life.\n\nSomeone asked: After practicing the Dao, how many days must pass before one may eat heavy foods or pungent vegetables?\nLaozi said: One hundred days after the Dao is accomplished, if you wish to eat, moderation and restraint should be the foundation.\n\nSomeone asked: When practicing the Dao, if one eats little and feels hungry, what should one do?\nLaozi said: Though hungry, keep the breath calm and composed. Eating to fullness causes the five viscera to clash, making it difficult for the qi to flow.\n\nSomeone asked: When practicing the Dao, may one abstain from grains?\nLaozi said: If you wish to transcend the world and leave the mundane, you must swiftly cut off grains and rely on the breath. Over time, you will neither hunger nor thirst—this is the great essential of the Dao.\n\nSomeone asked: When cultivating essence and thought in the Dao, may one avoid abstaining from grains?\nLaozi said: A belly full of grains is filled with rot and filth; the spirit does not dwell in the body. But if you practice the Dao without cease, over time you will naturally cease to hunger.\n\nSomeone asked: From birth to adulthood, people grow by eating grains—why abstain from them?\nLaozi said: Grains only help people grow to adulthood; they are not meant to be eaten until old age. Aging and death are all due to grains.\n\nSomeone asked: If one abstains from grains, can one transcend the world?\nLaozi said: Those who align with the formless will know this naturally. Simply preserve the qi and refine the body—why worry about not enduring long?\n\nSomeone asked: When practicing the Dao and abstaining from grains, if the five viscera develop minor illnesses, what should one do?\nLaozi said: Do not yet abstain from grains; practice moderation in eating. After another hundred days, cut off grains and rice porridge, and consume only pure foods.\n\nSomeone asked: After the Dao is accomplished, may one drink wine?\nLaozi said: Wine causes confusion, knots the qi and vessels, blocks the hundred channels, and generates internal heat. It is better not to drink—purity is best.\n\nSomeone asked: Can one practice the Dao while abstaining from wine?\nLaozi said: Do not harm the blood and vessels. If you wish to practice the Dao, first inhale deeply, fill the belly, and exhale dozens of times—then you may proceed.\n\nSomeone asked: Can hunger or fullness harm the Dao?\nLaozi said: Extreme hunger scatters the qi, extreme drunkenness disperses it, great anger exhausts it, great joy makes it soar, and great fright harms the spirit.\n\nSomeone asked: Are there prohibitions in the Dao regarding movement and stillness?\nLaozi said: Prolonged gazing harms vision, prolonged listening harms hearing, prolonged lying harms the qi, prolonged labor harms essence, prolonged standing harms the bones, and prolonged walking harms the sinews.\n\nSomeone asked: Can the five flavors harm the Dao?\nLaozi said: Salt harms the blood, sourness harms the marrow, sweetness harms the lungs, acridity harms the heart, and bitterness harms essence. Each of the five flavors has its harm—when taken into the mouth, harmonious flavor is best.\n\nSomeone asked: Can one practice the Dao in wind, cold, rain, or dampness?\nLaozi said: Avoid them. Do not close the eyes; anticipate and evade them. When the Dao’s qi is abundant, evil qi will have no way to harm you.\n\nSomeone asked: If one has moxibustion, acupuncture, wounds, or takes medicine, can one still practice the Dao?\nLaozi said: Avoid them. Moxibustion, acupuncture, and wounds cause the qi to leak. Medicine harms the five viscera.\n\nSomeone asked: Are there rules for sitting and rising in the Dao?\nLaozi said: When sitting, keep the knees level, relax the groin, straighten the spine, lift the head, inwardly gaze, contain the breath, and rest calmly. When the form is full and the qi abundant, the spirit will not scatter.\n\nSomeone asked: When practicing the Dao, if the mind is often unhappy, melancholy, or restless, what should one focus on?\nLaozi said: Constantly think of good, and good qi will come. If you often dwell on evil, evil will come and harm you. Simply focus the mind on guarding the Dao, and evil will have no way to intrude.\n\nSomeone asked: When practicing the Dao, should one invoke anything?\nLaozi said: First call the names of the five spirits: the heart spirit is named Taowen, the liver spirit is named Jianjian, the lung spirit is named Yanyan, the spleen spirit is named Beibei, and the kidney spirit is named Fufu. Call them in order, and the qi will arrive at the cinnabar field.\n\nSomeone asked: When entering the chamber in the Dao, where does the yang qi arise, and to what is the life’s destiny attached?\nLaozi said: The qi arises from the gallbladder, and destiny is attached to the eyes. Knowing these two, one may enter the chamber; without knowing them, the Dao will surely lead to confusion.\n\nSomeone asked: After years of accumulating the Dao’s qi, what is the proof?\nLaozi said: After years of accumulating the Dao, one’s vision penetrates ten thousand miles. The sun, moon, stars, bright mirrors, torches, and radiant sunlight will come to illuminate the signs. The various spirits will guard and protect, coming without being summoned—this is the proof of the Dao. Beware of reckless speech.\n\nSomeone asked: Is there a time limit for the Dao’s accomplishment?\nLaozi said: Sixty days is the middle measure, one hundred days the great measure. Once the Dao is accomplished, the body will no longer age. Over time, the qi will move like wind and rain.\n\nSomeone asked: Where does the Dao-body reside in its rules and measures?\nLaozi said: Within the chamber of rules and measures lies its discipline. Roundness becomes the compass, squareness the carpenter’s square—who knows where the compass rests and the square strikes? Only father and son, passing it between them, know.\n\nLaozi said: Do not sell my Dao to seek money; do not peddle my Dao to force it upon the powerful and honored; do not diminish my Dao to curry favor with the cunning and flattering. My Dao is secret and weighty, not to be transmitted for ten thousand gold. When sages appear, it emerges; when none exist, it remains hidden. Transmit it to the right person, and the Dao will become clear and bright; transmit it to the wrong person, and calamity will return upon you. Conceal it in a golden chamber, seal it with jade gates, hold fast with sealed lips and bound tongue—never reveal my writings. Swear an oath in blood, and ascend to pay homage to the Primordial Ancestors.\n\nLaozi said: When ordinary worldly people seek the Dao and virtue, they must first preserve their spirit. Its true essence is white as a luminous pearl: at dawn, it resides in the philtrum below the nose; at mealtime, it rests within the hairline; at midday, it dwells in the head.\n\nAt the morning meal, it resides between the two points on the nape of the neck; at the evening meal, it rests in the waist. At sunset, it dwells in the *guimin*; at midnight, in the *yuying*; when the head passes, in the stomach’s gate; toward dawn, it supports the spleen; at cockcrow, it enters the lungs, passing through the throat into the center; at dawn, it returns to the philtrum below the nose. In drinking, eating, walking, and all activities, one must constantly bear this in mind. This is called \"preserving the spirit to attain longevity\" and \"planting the root of Dao and virtue.\"\n\n**Method for Fasting and Absorbing Qi**\nFor those who wish to fast and ascend to emptiness in pursuit of immortality, first settle in a quiet chamber. Invoke the names of the Three Spirits, then absorb qi:\n\n1. **Primordial Ancestor Imperial Minister**, guardian of the Upper Cinnabar Field, enable me to attain what I seek, send forth the traveling kitchen, and fill me with abundant qi.\n2. **Radiant Child Cinnabar**, guardian of the Middle Cinnabar Field, enable me to attain what I seek, send forth the traveling kitchen, and fill me with abundant qi.\n3. **Primordial Yang Valley Mystery**, guardian of the Lower Cinnabar Field, enable me to attain what I seek, send forth the traveling kitchen, and fill me with abundant qi.\n\nAfter invoking the Three Spirits, at dawn on an empty stomach, face east, hands and feet held five inches from the body, fists curled like an infant’s grasp. Lower the head to rest on a pillow, close the mouth and eyes, hold a peppercorn in the mouth, and draw its essence. Inhale qi through the nose, swallow the numinous spring once, then gently exhale the breath from the mouth. Repeat this absorption of qi 360 times, called \"one session.\" Ninety inhalations require one breath; regulate strength and resume, completing another ninety. Four such breaths complete one session. At noon and sunset, perform the absorption likewise.\n\nAfter ten days, the medicinal power is prepared. Between sessions, practice the Six Methods to dispel the Six Ailments:\n1. **Xu** expels bodily exhaustion.\n2. **He** expels heat.\n3. **Chui** expels wind.\n4. **Xiao** expels cold.\n5. **Ke** expels stagnant qi.\n6. **Xi** expels vexation.\n\nAvoid prolonged gazing, excessive walking, excessive speech, prolonged standing, or excessive sleep. Do not ride or mount beasts. When absorbing qi, if thirsty, drink water or honeyed nectar. Before beginning, resolve to fast, and the medicine will readily take effect. If unable to continue, after the session, avoid cold or hot foods, excessive flavors, or sudden fullness, which harm the body. Initially, eat only a little porridge, gradually increasing qi absorption over days before eating rice, still avoiding fullness. As qi absorption decreases, food intake may increase, and after a full day, one may eat to satiety, then cease qi absorption. This is the path of safety.\n\nAfter three days of fasting, slight fatigue arises; after fourteen days, it recurs. Dizziness may occur—do not be alarmed. After ten days, essence, qi, and strength wane slightly, and the complexion becomes sallow. After twenty days, movement causes dizziness, limbs feel heavy, bowel movements become slightly difficult, urine turns reddish-yellow, or one may experience diarrhea, with the front weak and the back stiff. After thirty days, the body grows emaciated, and walking becomes laborious. After forty days, the complexion brightens, and the mind and body find peace. After fifty days, the Five Viscera harmonize, and essence and qi nurture the interior. After sixty days, flesh and form return to normal, and joints move smoothly. After seventy days, the heart dislikes noise, and aspirations soar. After eighty days, one becomes indifferent and serene, faith and clarity guarding the Way. After ninety days, the countenance becomes lustrous and smooth, and the voice resonant and clear. After a hundred days, essence and qi fully arrive, and efficacy grows daily. If cultivation persists without cease, lifespan naturally lengthens.\n\nAfter three years, the *jiupan* vanishes, and the complexion radiates. After six years, marrow fills the bones, and one foresees life and death. After nine years, one commands ghosts and spirits, jade maidens attend at one’s side, the brain solidifies, and the ribs join—no harm can befall one. This is called a \"Perfected Person,\" who assists the Supreme Emperor, shares the lifespan of Heaven, and merges light with the sun and moon. Transmitting this to the wrong person brings disaster upon oneself.\n\n**The Chart of Divine Immortality** states:\nIf you constantly bear the Dao in mind, the Dao will bear you in mind. In sorrow and adversity, think of the Dao; in illness, think of the Dao; in poverty and lowliness, think of the Dao; in hardship, think of the Dao; in wealth and honor, think of the Dao; in eating and drinking, think of the Dao; entering mountains and marshes, think of the Dao; crossing rivers and seas, think of the Dao; when rising, think of the Dao; in all actions, think of the Dao—the Dao accompanies you.\n\nWhere the Dao emerges, the myriad things are born, and the myriad spirits are perfected. There is nothing it does not protect, nothing it does not ennoble. If you forget the Dao even for a moment, the Dao enters the Eight Darknesses. Bearing the Dao in mind and absorbing qi, you will attain longevity.\n\nThe Dao is I, and I am with you. If you wish to guard the path of longevity, preserve it. In movement and stillness, eating and drinking, sitting and rising, and even in breathing, always bear it in mind, never forgetting it day or night. Thus, you will be preserved, essence, qi, and spirit never leaving the body—then you will attain longevity.\n\n**The Scripture of Manifest Dao concludes.**",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "显道经 经名：显道经。 不着撰人。 一卷，底本出处：《正统道藏》洞神部方法类。 显道经 老子曰：人有五心，面有五色。 力壮气盛，肌肤充溢。 骨涌面白，血涌面赤，髓涌面黄，肌涌面黑，精涌面光，气涌面泽。 体性各异，刚柔难成。 或有聪明，或有迷塞，或有诚信，得道诀法，或有强梁，反白为黑，令道不明，慎勿授与。 老子曰：人有盛衰，自在兆身。 年立十五，神驻丹田。 年立二十，精气益强。 年立三十，势力横行。 年立四十，头神损，白发生。 年立五十，目神损，无光精。 年立六十，藏神损，五喉伤。 年立七十，足神损，行梁张。 年立八十，阴神损，茎不强。 年寿百二十为天年有道者度，无道者凶。 不须远虑损精神，安心守靖，虚无淡泊，自为真人。 老子曰：道成之法，其变非一，唯有五藏，道之所历。 玄道有根，太虚中立。 以无为本，不可止失。 道有雄雌，相随不别。 其神是魂，与魄并合，变成赤子，养人体骨，上下浮游，通利血脉，衰无所容，神不迷惑，精之道之，名日淡泊。 老子曰：道生三部，各自有名。 分为六腑，交会丹田。 总揽百脉，制御阴阳。 一吸一呼，有死有生。 不得奢精，泄去符信。 道成变化，登乎太玄。 三合成德，与天交并。 审而还丹，名日自然。 老子曰：初入道室守玄元，玄中有玄是我命，命中有命是我形，形中有形是我精，精中有精是我气，气中有气是我神，神中有神是我自然变化太虚。 审能存之，寿命自延。 老子曰：德以形为车，道以气为马，魂以精为根，魄以目为户。 形动德散，气越道叛，精消魂损，目动魄散。 是以圣人静形闭气，畜精爱视，道德凝滞，魂魄固守，形一神万，道成变化，临危不惧。 子之修而得道大要。 老子曰：合道不言。 得无文之真，头发茂盛。 得道之根，手足汗气充盈，昼夜不外，日月合光，不饥不渴，龟龙胎息，冬温夏冻。 道士之服饮食玄丹，登於太清，还年不老，道之自然至道不远，近在己身。 恍惚存亡，匿影藏形。 洞浸万里，观於九天。 持意如水，命乃久存。 老子曰：授道之法，必择柔仁，无暴无躁，行之立成。 非有才巧，积习入神。 得之者度，失之者伤。 毫厘之初，玄道幽深。 驱马万里而不遇观，骸骨之中，无不异者。 但修身守道，道自归子。 素道解 老子曰：初入道室，法先以破除之日，解五过七污，束流水上沐浴，斋戒，令身鲜洁，五脏平安，志意和适，除损万事无为，淡泊，则可治道，明受师法。 或问：初入道室，高燥鲜洁不？ 老子曰：先以生炭着於室中，令逐湿气。 无令有虫鼠。 振帏帐林席，无令有尘垢。 昼夜烧香，令内中皆香。 无令有器物，有器物则意不专一。 或问：初入道，先斋戒不？ 老子曰：先五日沐浴兰汤，身乾发燥，饥饱适意，精气和悦，乃可入室也。 或问：道欲闻百乌音不？ 老子曰：常使人远逐飞乌及鹦犬，四邻无喧哗，以清静为本。 或问：道时手足问有尺寸度数不？ 老子曰：以意适之，各有尺寸，不相干错，名为之淡泊矣。 或问：道枕席有高下法不？ 老子曰：枕高肝缩，枕下肺骞，以四寸为平枕，席令柔软，其息乃长。 或问：道外当偃，或有数者不得正偃，云何？ 老子曰：正偃身安，其气易行，无倾无侧，无屈无伏。",
      "translated_text": "**The Scripture of Revealing the Dao**\n\n**Title:** *Scripture of Revealing the Dao*. Author unknown. One scroll. Source: *Daoist Canon of the Zhengtong Era*, *Dongshen* Section, Methods Category.\n\n---\n\n**The Scripture of Revealing the Dao**\n\nLaozi said: Man has five minds, and the face has five colors. When strength is robust and qi abundant, the flesh and skin are full. When bones surge, the face is white; when blood surges, the face is red; when marrow surges, the face is yellow; when flesh surges, the face is black; when essence surges, the face is radiant; when qi surges, the face is lustrous. Though their natures differ, hardness and softness are difficult to perfect. Some are wise, some are deluded; some are sincere and trustworthy, grasping the secrets of the Dao; others are violent and perverse, turning white to black, obscuring the Dao. Be cautious—do not transmit it to them.\n\nLaozi said: Man has prosperity and decline, foretold in the body. At fifteen, the spirit resides in the cinnabar field. At twenty, essence and qi grow stronger. At thirty, vigor prevails. At forty, the spirit of the head wanes, and white hair appears. At fifty, the spirit of the eyes wanes, and their luster fades. At sixty, the spirit of the viscera wanes, and the five throats are harmed. At seventy, the spirit of the feet wanes, and movement becomes labored. At eighty, the yin spirit wanes, and the stem loses strength. A lifespan of one hundred and twenty is the heavenly span—those with the Dao transcend; those without meet misfortune. No need for distant worries that deplete the spirit. Calm the mind, guard tranquility, embrace emptiness and simplicity, and you become a true person.\n\nLaozi said: The method of attaining the Dao is not singular in its transformations. Only the five viscera are where the Dao passes. The mysterious Dao has its root, standing in the Great Void. Taking non-action as its foundation, it cannot be lost or forsaken. The Dao has male and female, following one another without distinction. Its spirit is the hun-soul, uniting with the po-soul to transform into the red child. It nourishes the body’s bones, floating up and down, unobstructing the blood vessels. In decline, it finds no refuge; the spirit is not deluded. This is the Dao of essence—named \"simplicity.\"\n\nLaozi said: The Dao generates three divisions, each with its own name. Divided into the six bowels, they converge in the cinnabar field. They govern the hundred vessels, regulating yin and yang. With each inhalation and exhalation, there is death and life. Do not squander essence, lest the tally be lost. When the Dao is perfected in transformation, one ascends to the Great Mystery. The three unite as virtue, merging with heaven. Refining and returning the elixir is called \"naturalness.\"\n\nLaozi said: When first entering the chamber of the Dao, guard the Mysterious Origin. Within the mysterious lies the mysterious—this is my life. Within life lies life—this is my form. Within form lies form—this is my essence. Within essence lies essence—this is my qi. Within qi lies qi—this is my spirit. Within spirit lies spirit—this is my natural transformation into the Great Void. If one can preserve this, lifespan extends of itself.\n\nLaozi said: Virtue uses form as its chariot; the Dao uses qi as its horse. The hun-soul takes essence as its root; the po-soul takes the eyes as its gate. When form moves, virtue scatters; when qi strays, the Dao rebels. When essence dissipates, the hun-soul is harmed; when the eyes move, the po-soul scatters. Thus, the sage stills the form, seals the breath, accumulates essence, and cherishes vision. Virtue and the Dao congeal, hun and po are firmly guarded. Form unites, spirit multiplies, the Dao is perfected in transformation, and one faces peril without fear. This is the great essential of your cultivation in attaining the Dao.\n\nLaozi said: Those who unite with the Dao do not speak. Attaining the true without ornament, their hair flourishes. Grasping the root of the Dao, their hands and feet brim with qi, which does not leak day or night. The sun and moon merge their light; they neither hunger nor thirst. Like the tortoise and dragon, they practice embryonic breathing. In winter, they are warm; in summer, cool. The Daoist consumes the elixir of the mysterious, ascends to the Great Clarity, and returns to youth without aging. The Dao’s naturalness is not distant—it lies near, within one’s own body. In indistinctness, existence and non-existence intermingle; one conceals their form and hides their shadow. Permeating ten thousand miles, they observe the nine heavens. Holding the mind like water, life endures.\n\nLaozi said: The method of transmitting the Dao must select the gentle and benevolent, those without violence or impatience, whose practice swiftly succeeds. Without talent or skill, through accumulated practice, they enter the spirit. Those who attain it transcend; those who lose it are harmed. At the slightest beginning, the mysterious Dao is profound and obscure. Driving a horse ten thousand miles without encountering a viewer, within the bones, none are alike. Simply cultivate the body and guard the Dao—the Dao will naturally return to you.\n\n---\n\n**Explanation of the Plain Dao**\n\nLaozi said: When first entering the chamber of the Dao, on the day of breaking and removing, resolve the five transgressions and seven impurities. Bathe in flowing water, fast, and purify the body, so the five viscera are at peace, the mind and will are harmonious and content. Eliminate harm, abandon all affairs, embrace non-action and simplicity—then one may cultivate the Dao and clearly receive the master’s teachings.\n\nSomeone asked: When first entering the chamber of the Dao, should it be high, dry, and pure?\nLaozi said: First place live charcoal in the chamber to dispel dampness. Ensure there are no insects or rats. Shake out the curtains, bedding, and mats to remove dust and grime. Burn incense day and night so the interior is fragrant. Do not allow vessels or objects, for their presence distracts the mind.\n\nSomeone asked: When first entering the Dao, should one fast?\nLaozi said: First bathe for five days in orchid-scented water. When the body is dry and the hair is parched, with hunger and fullness balanced and essence and qi harmonious and joyful, then one may enter the chamber.\n\nSomeone asked: Does the Dao wish to hear the sounds of a hundred birds?\nLaozi said: Always have people drive away flying birds and crows, and keep dogs at a distance. Let the neighbors be free of clamor, taking clarity and stillness as the foundation.\n\nSomeone asked: In practicing the Dao, do the hands and feet have fixed measurements?\nLaozi said: Follow one’s intention to adjust them. Each has its own measure, not interfering with one another—this is called \"simplicity.\"\n\nSomeone asked: Does the Dao’s pillow and mat have methods for height and lowness?\nLaozi said: A high pillow contracts the liver; a low pillow sags the lungs. A four-inch pillow is level. The mat should be soft so the breath is long.\n\nSomeone asked: When practicing the Dao externally, should one lie supine? Some cannot lie perfectly supine—what then?\nLaozi said: Lying supine brings bodily ease, and the qi flows smoothly. Do not tilt or lean, bend or crouch.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1265,
      "start_sentence": 0,
      "end_sentence": 70,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.92067313194275,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\显道经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "正偃者，道之大法。 或问：初道气息未习，欲长反短，欲散反疾，欲留反还，云何？ 老子曰：初道务清务静，无强无长。 或问：息得时何以为验？ 老子曰：气初至时，肠呜脉动手足痛，气之故也。 或问：气至身何如？ 老子曰：气至身，身渐寒，欲惊安心定志，无使之惊，听气之所为也。 或问：道气出入常从何来？ 老子曰：气出丹田者，人之命门，元气之本根，五脏得之，以鲜明精气之所出入也。 或问：道气生丹田，出入何脏？ 老子曰：吁入肺心，吸入肾肝，吁吸相逢，交会太仓，三焦和引，拘制魂魄，自然之气，道之命长，审而行之，必为真人。 或问：道行气有昼夜不？ 老子曰：昼存气府，夜存神宫。 气府者，名曰丹田。 神宫者，名曰明堂。 昼不存气府，元气不行； 夜不存神宫，目不睹神。 或问：道气未至当如何，须起欲外及倦得动摇，可不？ 老子曰：倦须复起欲卧自恣，气未至时，为之无数。 或问：道气或有能者，或有不能者？ 老子曰：要在体性，有精者道之易，无精者道之难。 要当心专，亦有相禄。 或问：道气男女同法不？ 老子曰：丈夫精者，二三日得气； 妇人精者，四五日气通则有所闻见。 道之证验，精气之大效。 或问：道有老少不？ 老子曰：年少者气易行，年老者气难行，用日为迟，要少气休矣。 或问：道自以筹长三寸柱丹田者，何？ 老子曰：初道气时，教恐妄其丹田，气不流行，故乃以筹柱丹田，举其柱，令气到其处。 或问：道时丹田久昼明，日可因之，不将更久乎？ 老子曰：数明久，田无发绝，久久自见其田，明如日光，气到如涌云。 或问：道时可衣小衣不？ 老子曰：初道尽解衣去之而淡卧手足，扰被去身不寒，恐后伤人，衣小衣为善。 或问：道已解可得起不？ 老子曰：手足定系盘鼓，呼侍者取衣，则起，步引以举盘鼓者，重爱其气，不欲令气得越泄矣。 或问：一日可数道不？ 老子曰：道时一日三四为之，百日后道成且为之不数道，夺人气息。 或问：道绝久复为之，可得饮酒不？ 老子曰：可，或有自恣，贪酒者而不常道，后复为之，气行如故。 或问：道无室可於外不？ 老子答之曰：初於室成，百日后自恣，要不如密室鲜洁为善。 或问：道有轻举，何等轻举？ 意将梦之其形自举乎？ 老子曰：道气久精神振之，其形自举，此道将欲成之。 或问：道求度世，欲止民问成可不？ 老子曰：民问多欲，令意不专，入山潜处，守志自然，功满形变，则得长生。 或问：道成后，可得入房室不？ 老子曰：欲得飞仙度世，勿入房室，不欲度世者，百日之后可自恣矣。 或问：冥夜可道不？ 老子曰：禁之。 夜为死气，邪鬼并行。 昼为生气，以用鹦呜、平旦日出，令气易行。 或问：道常以鹦呜为始，秋冬云何？ 老子曰：春夏以难呜或至平旦，秋冬以日出或至食时，要取密室和温，早晏无所在。 或问：道所见怪，何物乎？ 老子曰：道数十日，有白头老妪从一女子常侍左右，有顷去，忽不知所在，是其怪也。 或问：道见怪手足扰，．口妄言，瞑目顾念田不？ 老子曰：专心一意，瞑目念田，行气如故，勿薛勿疑，久久怪自休。 或问：道常暝目，念田何容见怪？ 老子曰：意未专，志未定，则见怪，无自是，无恐起为他事，无与之语，与之语则将人俱去矣。",
      "translated_text": "Supine posture is the great method of the Dao.\n\nSomeone asked: When first practicing the Dao, the breath is untrained—one wishes to lengthen it, yet it shortens; wishes to disperse it, yet it quickens; wishes to retain it, yet it returns. What is to be done?\nLaozi said: In the beginning, focus on clarity and stillness; do not force or prolong.\n\nSomeone asked: How does one verify when the breath arrives at the proper time?\nLaozi said: When the qi first arrives, the intestines rumble, the pulse stirs, and the hands and feet ache—this is the effect of qi.\n\nSomeone asked: What occurs when the qi reaches the body?\nLaozi said: As the qi reaches the body, the body gradually grows cold. If startled, calm the mind and steady the will; do not allow alarm, but let the qi act as it will.\n\nSomeone asked: From where does the Dao’s qi customarily exit and enter?\nLaozi said: The qi emerges from the cinnabar field (dantian), which is the life gate of humans, the root of original qi. The five viscera receive it, and from it issue the radiance and essence of qi’s ingress and egress.\n\nSomeone asked: The Dao’s qi is born in the dantian—through which viscera does it exit and enter?\nLaozi said: Exhalation enters the lungs and heart; inhalation enters the kidneys and liver. Exhalation and inhalation meet, converging at the great granary (taicang). The triple burner harmonizes and guides, restraining the hun and po souls. This is the natural qi, the life-prolonging Dao. Examine and practice it, and you will surely become a perfected person.\n\nSomeone asked: Does the practice of Dao and qi differ between day and night?\nLaozi said: By day, store it in the qi府 (qi repository), by night, store it in the spirit palace. The qi repository is called the dantian; the spirit palace is called the Hall of Light. If by day one does not store it in the qi repository, the original qi will not circulate; if by night one does not store it in the spirit palace, the eyes will not perceive the spirit.\n\nSomeone asked: When the Dao’s qi has not yet arrived, if one feels the need to rise, move about, or grows weary, is this permissible?\nLaozi said: If weary, one may rise and lie down at will. When the qi has not yet arrived, do not practice excessively.\n\nSomeone asked: Some can practice the Dao’s qi, while others cannot—why?\nLaozi said: It depends on one’s constitution. Those with essence find the Dao easy; those without essence find it difficult. The key lies in focused concentration, and there is also an element of destiny.\n\nSomeone asked: Do men and women follow the same method in practicing the Dao’s qi?\nLaozi said: A man with essence may attain qi in two or three days; a woman with essence may feel its circulation in four or five days, at which point she will perceive sights and sounds. These are the proofs of the Dao, the great effects of essence and qi.\n\nSomeone asked: Does the Dao differ between old and young?\nLaozi said: The young find qi easy to circulate; the old find it difficult, requiring more time. Those with scant qi should rest.\n\nSomeone asked: Why does the Dao use a three-inch tally to prop the dantian?\nLaozi said: When first practicing qi, one fears misdirecting the dantian, causing the qi to fail to flow. Thus, a tally is used to prop the dantian; lifting the tally allows the qi to reach that place.\n\nSomeone asked: When the dantian remains bright for a long time during practice, can one rely on this brightness without further effort?\nLaozi said: With frequent brightness, the field will not wither or sever. Over time, the field will naturally become visible, shining like daylight, and the qi will arrive like surging clouds.\n\nSomeone asked: When practicing the Dao, may one wear light clothing?\nLaozi said: At first, remove all clothing and lie unadorned, hands and feet at ease. If the coverlet is drawn away and the body does not grow cold, one need not fear later harm. Wearing light clothing is best.\n\nSomeone asked: After undressing for the Dao, may one rise?\nLaozi said: When the hands and feet are settled and the qi is gathered like a drum, call an attendant to bring clothing, then rise. Walk and stretch, lifting the gathered qi—this is to cherish the qi and prevent its escape.\n\nSomeone asked: May one practice the Dao several times a day?\nLaozi said: Practice the Dao three or four times a day. After a hundred days, the Dao will be accomplished, and one need not practice excessively, lest it steal one’s breath.\n\nSomeone asked: If one discontinues the Dao for a long time and then resumes, may one drink wine?\nLaozi said: One may, though those who indulge excessively and neglect the Dao for long, then resume, will find the qi flows as before.\n\nSomeone asked: If one has no chamber, may one practice outdoors?\nLaozi said: At first, practice in a chamber. After a hundred days, one may act freely, though nothing surpasses a secluded, pristine chamber.\n\nSomeone asked: What is the \"light ascent\" in the Dao? Does the body rise of its own accord in dreams?\nLaozi said: With long practice of the Dao, the spirit is invigorated, and the body rises of itself—this is the Dao nearing completion.\n\nSomeone asked: If one seeks transcendence through the Dao, must one cease interaction with the world?\nLaozi said: The world is full of desires, which scatter the mind. Enter the mountains and dwell in seclusion, guarding the will naturally. When merit is fulfilled and the form transforms, one attains longevity.\n\nSomeone asked: After the Dao is accomplished, may one enter the bedchamber?\nLaozi said: Those who wish to become flying immortals and transcend the world must not enter the bedchamber. Those who do not seek transcendence may act freely after a hundred days.\n\nSomeone asked: May one practice the Dao in the dead of night?\nLaozi said: It is forbidden. Night is the time of dead qi, when malevolent spirits roam. Day is the time of living qi; practice at cockcrow or dawn, when the sun rises, so the qi flows easily.\n\nSomeone asked: The Dao customarily begins at cockcrow—what of autumn and winter?\nLaozi said: In spring and summer, begin at cockcrow or dawn; in autumn and winter, at sunrise or mealtime. The key is a secluded chamber and gentle warmth—timing matters little.\n\nSomeone asked: What strange things appear in the Dao?\nLaozi said: After practicing the Dao for several tens of days, a white-haired old woman and a young girl may attend at one’s side, then suddenly vanish without a trace—these are the strange things.\n\nSomeone asked: If strange things appear during the Dao, should one move the hands and feet, speak recklessly, or close the eyes and contemplate the field?\nLaozi said: Focus the mind single-mindedly, close the eyes and contemplate the field, and circulate the qi as usual. Do not fear or doubt. Over time, the strange things will cease of themselves.\n\nSomeone asked: When practicing the Dao, one constantly closes the eyes and contemplates the field—how can one see strange things?\nLaozi said: If the mind is not focused and the will not settled, strange things appear. Do not consider them real, do not fear them, do not rise to attend to other matters, and do not speak to them. If you speak to them, they will take you away with them.",
      "overlap_context": "e another—this is called \"simplicity.\"\n\nSomeone asked: Does the Dao’s pillow and mat have methods for height and lowness?\nLaozi said: A high pillow contracts the liver; a low pillow sags the lungs. A four-inch pillow is level. The mat should be soft so the breath is long.\n\nSomeone asked: When practicing the Dao externally, should one lie supine? Some cannot lie perfectly supine—what then?\nLaozi said: Lying supine brings bodily ease, and the qi flows smoothly. Do not tilt or lean, bend or crouch.",
      "start_char": 1265,
      "end_char": 2560,
      "start_sentence": 71,
      "end_sentence": 131,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.48671197891235,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\显道经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "或问：道未至时，手足扰，口妄言，岂故为之，将自然乎？ 老子曰：是自然气之所为，非邪所教。 或问：道手足扰，口妄言不止，云何？ 老子曰：远者二时，近者一时，气定意专则自休矣。 或问：道见怪者，告人已不？ 老子曰：告人者，神后不复来，怪者真人之媒驿，勿骂呵堂为善。 或问：道已解，得讲诸缪恶不？ 老子曰：讲诸不祥则致凶伤，恶梦恍惚，众邪合同，正气难致，邪气往从。 或问：道已解，何时饮食乎？ 老子曰：道已起步，步已则食。 不步，气合含饮食则消矣。 或问：道欲何食乎？ 老子曰：食之乾轻之物，梗粮、麦钞、脯誊、枣栗，令息条长，养生之道。 或问：道已· 后几日可得食重物熏菜不？ 老子曰：道成后百日，欲得为食，以要节少为本。 或问：道欲少食饥云何？ 老子曰：虽饥气息安靖，食饱者五脏交格，令气难行。 或问：道常道气可绝谷不？ 老子曰：将欲度世离俗，急当绝之以气息，久久不饥不渴，道之大要。 或问：道欲习精思，不欲绝谷可不？ 老子曰：食谷满腹，腐污盛粪神不居形，但道不止，久久自不饥。 或问：道人生从小至大，以谷自长，何为绝谷乎？ 老子曰：谷唯生人长大，不欲使人食之至老，老死皆由於谷矣。 或问：道绝谷可得度世不？ 老子曰：合无者自知，自然不食，但存气炼形，何忧不长存。 或问：道欲绝谷，五藏有微病云何？ 老子曰：且勿绝谷，节食为之。 又百日之后，断谷稻米粥及饵清物。 或问：道成后可饮酒不？ 老子曰：酒令人迷惑，气脉烦结，百脉不通，留生热，不如不饮，可为清洁。 或问：绝酒可以道不？ 老子曰：不可伤人血脉，欲道先吸气，满腹吐之数十，则可以道。 或问：道饥饱有所伤不？ 老子曰：大饥气不藏，大醉气越，大怒气竭，大乐气飞扬，大惊还伤神。 或问：道动止有法禁不？ 老子曰：久视伤明，久听伤聪，久卧伤气，久劳伤精，久住伤骨，久行伤筋。 或问：道五味有所伤不？ 老子曰：咸伤血，酸伤髓，甜伤肺，辛伤心，苦伤精。 夫五味，各有所伤，要取入口，味和为甘。 或问：风寒雨湿，可以道不？ 老子曰：禁之。 无以闭目，豫而避之，积道气盛，邪气无所从伤之。 或问：灸刺若创，服药可以道不？ 老子曰：禁之。 灸刺及创，令气越泄。 服药伤五藏。 或问：道坐起有法度不？ 老子曰：坐常平膝，垂阴曳腰，直膂昂头，内视含气安息，形充气盛，精神不越。 或问：道意常不乐，惆怅不安，何所存思？ 老子曰：常念善则善，气来，若尝思念恶，邪来伤人。 但专心守道，邪无以干。 或问：道时有所存呼？ 老子曰：先呼五神名，心神名陶吻，肝神名监监，肺神名严严，脾神名卑卑，肾神名抚抚。 从次呼之，以处丹田，气则至矣。 或问：道入室，阳气所从生，本命何所系属？ 老子曰：气所生者生於胆，命所属者属於目，知此二者则可入室，不知此二者，道必迷惑。 或问：道气成积年，以何为证？ 老子曰：积年道日久，洞浸万里，日月星辰、明镜炬火、辉辉日光来照形兆，诸神营卫，不召自来，是道之证，慎勿妄语。 或问：道成时有限度不？ 老子曰：六十日为中度，百日为大度，其已道成，身不复老，数有日久气行如风雨。",
      "translated_text": "Someone asked: Before the Dao is attained, when the hands and feet stir and the mouth speaks recklessly, is this done deliberately or does it arise naturally?\nLaozi said: This is the natural work of qi, not taught by evil forces.\n\nSomeone asked: When practicing the Dao, if the hands and feet stir and the mouth speaks recklessly without cease, what should one do?\nLaozi said: For some, it lasts two periods; for others, one period. When the qi settles and the mind becomes single-minded, it will cease of itself.\n\nSomeone asked: If one sees strange things while practicing the Dao, should one tell others?\nLaozi said: If you tell others, the spirits will no longer return. Strange things are the couriers of the true person—do not scold or curse them; doing good is best.\n\nSomeone asked: After the Dao is understood, may one discuss inauspicious and evil things?\nLaozi said: Discussing inauspicious things invites misfortune and harm. Nightmares, confusion, and a host of evils will gather, making it difficult for the upright qi to arrive while the evil qi follows.\n\nSomeone asked: After the Dao is understood, when should one eat?\nLaozi said: Once the Dao begins its steps, eat after completing the steps. If you do not step, the qi will merge and digest food on its own.\n\nSomeone asked: What should one eat when practicing the Dao?\nLaozi said: Eat dry, light foods—grains, parched wheat, dried meat, dates, and chestnuts—to lengthen the breath and nurture life.\n\nSomeone asked: After practicing the Dao, how many days must pass before one may eat heavy foods or pungent vegetables?\nLaozi said: One hundred days after the Dao is accomplished, if you wish to eat, moderation and restraint should be the foundation.\n\nSomeone asked: When practicing the Dao, if one eats little and feels hungry, what should one do?\nLaozi said: Though hungry, keep the breath calm and composed. Eating to fullness causes the five viscera to clash, making it difficult for the qi to flow.\n\nSomeone asked: When practicing the Dao, may one abstain from grains?\nLaozi said: If you wish to transcend the world and leave the mundane, you must swiftly cut off grains and rely on the breath. Over time, you will neither hunger nor thirst—this is the great essential of the Dao.\n\nSomeone asked: When cultivating essence and thought in the Dao, may one avoid abstaining from grains?\nLaozi said: A belly full of grains is filled with rot and filth; the spirit does not dwell in the body. But if you practice the Dao without cease, over time you will naturally cease to hunger.\n\nSomeone asked: From birth to adulthood, people grow by eating grains—why abstain from them?\nLaozi said: Grains only help people grow to adulthood; they are not meant to be eaten until old age. Aging and death are all due to grains.\n\nSomeone asked: If one abstains from grains, can one transcend the world?\nLaozi said: Those who align with the formless will know this naturally. Simply preserve the qi and refine the body—why worry about not enduring long?\n\nSomeone asked: When practicing the Dao and abstaining from grains, if the five viscera develop minor illnesses, what should one do?\nLaozi said: Do not yet abstain from grains; practice moderation in eating. After another hundred days, cut off grains and rice porridge, and consume only pure foods.\n\nSomeone asked: After the Dao is accomplished, may one drink wine?\nLaozi said: Wine causes confusion, knots the qi and vessels, blocks the hundred channels, and generates internal heat. It is better not to drink—purity is best.\n\nSomeone asked: Can one practice the Dao while abstaining from wine?\nLaozi said: Do not harm the blood and vessels. If you wish to practice the Dao, first inhale deeply, fill the belly, and exhale dozens of times—then you may proceed.\n\nSomeone asked: Can hunger or fullness harm the Dao?\nLaozi said: Extreme hunger scatters the qi, extreme drunkenness disperses it, great anger exhausts it, great joy makes it soar, and great fright harms the spirit.\n\nSomeone asked: Are there prohibitions in the Dao regarding movement and stillness?\nLaozi said: Prolonged gazing harms vision, prolonged listening harms hearing, prolonged lying harms the qi, prolonged labor harms essence, prolonged standing harms the bones, and prolonged walking harms the sinews.\n\nSomeone asked: Can the five flavors harm the Dao?\nLaozi said: Salt harms the blood, sourness harms the marrow, sweetness harms the lungs, acridity harms the heart, and bitterness harms essence. Each of the five flavors has its harm—when taken into the mouth, harmonious flavor is best.\n\nSomeone asked: Can one practice the Dao in wind, cold, rain, or dampness?\nLaozi said: Avoid them. Do not close the eyes; anticipate and evade them. When the Dao’s qi is abundant, evil qi will have no way to harm you.\n\nSomeone asked: If one has moxibustion, acupuncture, wounds, or takes medicine, can one still practice the Dao?\nLaozi said: Avoid them. Moxibustion, acupuncture, and wounds cause the qi to leak. Medicine harms the five viscera.\n\nSomeone asked: Are there rules for sitting and rising in the Dao?\nLaozi said: When sitting, keep the knees level, relax the groin, straighten the spine, lift the head, inwardly gaze, contain the breath, and rest calmly. When the form is full and the qi abundant, the spirit will not scatter.\n\nSomeone asked: When practicing the Dao, if the mind is often unhappy, melancholy, or restless, what should one focus on?\nLaozi said: Constantly think of good, and good qi will come. If you often dwell on evil, evil will come and harm you. Simply focus the mind on guarding the Dao, and evil will have no way to intrude.\n\nSomeone asked: When practicing the Dao, should one invoke anything?\nLaozi said: First call the names of the five spirits: the heart spirit is named Taowen, the liver spirit is named Jianjian, the lung spirit is named Yanyan, the spleen spirit is named Beibei, and the kidney spirit is named Fufu. Call them in order, and the qi will arrive at the cinnabar field.\n\nSomeone asked: When entering the chamber in the Dao, where does the yang qi arise, and to what is the life’s destiny attached?\nLaozi said: The qi arises from the gallbladder, and destiny is attached to the eyes. Knowing these two, one may enter the chamber; without knowing them, the Dao will surely lead to confusion.\n\nSomeone asked: After years of accumulating the Dao’s qi, what is the proof?\nLaozi said: After years of accumulating the Dao, one’s vision penetrates ten thousand miles. The sun, moon, stars, bright mirrors, torches, and radiant sunlight will come to illuminate the signs. The various spirits will guard and protect, coming without being summoned—this is the proof of the Dao. Beware of reckless speech.\n\nSomeone asked: Is there a time limit for the Dao’s accomplishment?\nLaozi said: Sixty days is the middle measure, one hundred days the great measure. Once the Dao is accomplished, the body will no longer age. Over time, the qi will move like wind and rain.",
      "overlap_context": "eld, and circulate the qi as usual. Do not fear or doubt. Over time, the strange things will cease of themselves.\n\nSomeone asked: When practicing the Dao, one constantly closes the eyes and contemplates the field—how can one see strange things?\nLaozi said: If the mind is not focused and the will not settled, strange things appear. Do not consider them real, do not fear them, do not rise to attend to other matters, and do not speak to them. If you speak to them, they will take you away with them.",
      "start_char": 2561,
      "end_char": 3830,
      "start_sentence": 132,
      "end_sentence": 191,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.651553869247437,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\显道经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "或问：道身有规矩，为何处所？ 老子曰：规矩之房中有纪纲，圆则为规，方则为矩，安规击矩谁知之者？ 而知规矩父子相与耳。 老子曰：无卖吾道，以行求钱； 无街吾道，强授豪荣； 无损吾道，以与诡佞。 吾道秘重，万金不传。 有圣则出，无圣则藏。 传得其人，令道清明； 传非其人，还受其殃。 藏之金室，闭以玉阙，含口结舌，无泄吾文，以血为盟，上谒元先。 老子曰：凡世俗人求道德，先存其神，其正白如明珠，平旦存在鼻下人中； 食时在发际中； 日中在头；",
      "translated_text": "Someone asked: Where does the Dao-body reside in its rules and measures?\nLaozi said: Within the chamber of rules and measures lies its discipline. Roundness becomes the compass, squareness the carpenter’s square—who knows where the compass rests and the square strikes? Only father and son, passing it between them, know.\n\nLaozi said: Do not sell my Dao to seek money; do not peddle my Dao to force it upon the powerful and honored; do not diminish my Dao to curry favor with the cunning and flattering. My Dao is secret and weighty, not to be transmitted for ten thousand gold. When sages appear, it emerges; when none exist, it remains hidden. Transmit it to the right person, and the Dao will become clear and bright; transmit it to the wrong person, and calamity will return upon you. Conceal it in a golden chamber, seal it with jade gates, hold fast with sealed lips and bound tongue—never reveal my writings. Swear an oath in blood, and ascend to pay homage to the Primordial Ancestors.\n\nLaozi said: When ordinary worldly people seek the Dao and virtue, they must first preserve their spirit. Its true essence is white as a luminous pearl: at dawn, it resides in the philtrum below the nose; at mealtime, it rests within the hairline; at midday, it dwells in the head.",
      "overlap_context": "nd miles. The sun, moon, stars, bright mirrors, torches, and radiant sunlight will come to illuminate the signs. The various spirits will guard and protect, coming without being summoned—this is the proof of the Dao. Beware of reckless speech.\n\nSomeone asked: Is there a time limit for the Dao’s accomplishment?\nLaozi said: Sixty days is the middle measure, one hundred days the great measure. Once the Dao is accomplished, the body will no longer age. Over time, the qi will move like wind and rain.",
      "start_char": 3831,
      "end_char": 4047,
      "start_sentence": 192,
      "end_sentence": 205,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.841761827468872,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\显道经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "上哺时在颈项上二者中，下哺在腰； 日入在龟民； 夜半在玉英； 头过在胃问； 向晨柱脾； 鹦呜在肺，过喉入中； 平旦复在鼻下人中。 饮食行步出入，意当常念之。 是谓存神长寿，种道德之根。 绝毅食气法 凡欲绝食、升虚求仙之道，当安处静室，先呼三神之名，然后服气。 一、元先帝卿，守上丹田，使我求得所从，送给行厨，令气充足。 二、子丹光坚，守中丹田，使我求得所从，送给行厨，令气充足。 三、元阳谷玄，守下丹田，使我求得所从，送给行厨，令气充足。 呼三神已，晨朝空腹正外，东度，手脚离身相去五寸，卷两手如婴儿握，头下却枕，合口闭目，口含一椒，取其津液，鼻饮气，一咽灵泉已，口中微去其气。 如是饮气三百六十，名为一顿。 九十饮，事须一息，调定气力，更从一始，复满九十咽。 如此四息，得成一顿。 日中、日入，饮服亦如前。 日满十旬，药力始备，当息之问，具行六法，除却六病矣。 一嘘去身极，二呵去热气，三吹去风，四啸去玲，五咳去气，六吹去烦。 禁目不得久视，行不得过远，语不多，立不久，眠须少，又不得骑乘。 当服气时，若渴饮水及蜜浆，欲服前先绝食想药必易成。 若不堪，服过时不得食玲热食，五味不得过分，不得顿食饱，必损人。 初过时，先食少粥，渐喊气数，经数日方食饭，亦不得饱。 服气转少，食渐转多，至复日然后乃饱，服气方止。 此是安全之道。 绝谷三日小极，十四日复小极，头眩慎勿怪怖也。 休根一旬，精气力初微，颜色痿黄。 二旬之时，动作眩普，支节梁张，大便微难，小便赤黄而已，或时下利，前唐后强。 三旬之时，身体消瘦，重难以行。 四旬之时，泊色转悦，心志安康。 五旬之时，五脏调和，精气内养。 六旬之时，肌体如故，机关调畅。 七旬之时，心恶喧哗，志愿高翔。 八旬之时，淡泊寂寞，信明卫方。 九旬之时，荣华滑泽，音声洪章。 十旬之时，精气皆至，其效日昌，修之不止，年命自长。 三年之后，灸盘除灭，颜色有光。 修至六年，髓填肠韧，预知存亡。 经历九年之后，役使鬼神，玉女侍傍，脑实胁并，不可复伤，号日真人，上佐上皇，与天同寿，日月合光。 传非其人，身受灾殃。 神仙图曰：子常念道，道亦念子。 忧患思道，疾病思道，贫贱思道，穷困思道，富贵思道，饮食思道，入山泽思道，涉河海思道，外起思道，常行思道，道与子并。 道之所出，万物皆生，万神皆成，无所不护，无所不荣。 忘道须臾，道入八冥。 念道行气，子则长生。 道者，吾也。 吾与子并，欲为长生之卫前，当存之。 行止、饮食、坐起、外息，便皆思念之，昼夜不忘，然乃保全，精气神不离身，则长生矣。 显道经竟",
      "translated_text": "At the morning meal, it resides between the two points on the nape of the neck; at the evening meal, it rests in the waist. At sunset, it dwells in the *guimin*; at midnight, in the *yuying*; when the head passes, in the stomach’s gate; toward dawn, it supports the spleen; at cockcrow, it enters the lungs, passing through the throat into the center; at dawn, it returns to the philtrum below the nose. In drinking, eating, walking, and all activities, one must constantly bear this in mind. This is called \"preserving the spirit to attain longevity\" and \"planting the root of Dao and virtue.\"\n\n**Method for Fasting and Absorbing Qi**\nFor those who wish to fast and ascend to emptiness in pursuit of immortality, first settle in a quiet chamber. Invoke the names of the Three Spirits, then absorb qi:\n\n1. **Primordial Ancestor Imperial Minister**, guardian of the Upper Cinnabar Field, enable me to attain what I seek, send forth the traveling kitchen, and fill me with abundant qi.\n2. **Radiant Child Cinnabar**, guardian of the Middle Cinnabar Field, enable me to attain what I seek, send forth the traveling kitchen, and fill me with abundant qi.\n3. **Primordial Yang Valley Mystery**, guardian of the Lower Cinnabar Field, enable me to attain what I seek, send forth the traveling kitchen, and fill me with abundant qi.\n\nAfter invoking the Three Spirits, at dawn on an empty stomach, face east, hands and feet held five inches from the body, fists curled like an infant’s grasp. Lower the head to rest on a pillow, close the mouth and eyes, hold a peppercorn in the mouth, and draw its essence. Inhale qi through the nose, swallow the numinous spring once, then gently exhale the breath from the mouth. Repeat this absorption of qi 360 times, called \"one session.\" Ninety inhalations require one breath; regulate strength and resume, completing another ninety. Four such breaths complete one session. At noon and sunset, perform the absorption likewise.\n\nAfter ten days, the medicinal power is prepared. Between sessions, practice the Six Methods to dispel the Six Ailments:\n1. **Xu** expels bodily exhaustion.\n2. **He** expels heat.\n3. **Chui** expels wind.\n4. **Xiao** expels cold.\n5. **Ke** expels stagnant qi.\n6. **Xi** expels vexation.\n\nAvoid prolonged gazing, excessive walking, excessive speech, prolonged standing, or excessive sleep. Do not ride or mount beasts. When absorbing qi, if thirsty, drink water or honeyed nectar. Before beginning, resolve to fast, and the medicine will readily take effect. If unable to continue, after the session, avoid cold or hot foods, excessive flavors, or sudden fullness, which harm the body. Initially, eat only a little porridge, gradually increasing qi absorption over days before eating rice, still avoiding fullness. As qi absorption decreases, food intake may increase, and after a full day, one may eat to satiety, then cease qi absorption. This is the path of safety.\n\nAfter three days of fasting, slight fatigue arises; after fourteen days, it recurs. Dizziness may occur—do not be alarmed. After ten days, essence, qi, and strength wane slightly, and the complexion becomes sallow. After twenty days, movement causes dizziness, limbs feel heavy, bowel movements become slightly difficult, urine turns reddish-yellow, or one may experience diarrhea, with the front weak and the back stiff. After thirty days, the body grows emaciated, and walking becomes laborious. After forty days, the complexion brightens, and the mind and body find peace. After fifty days, the Five Viscera harmonize, and essence and qi nurture the interior. After sixty days, flesh and form return to normal, and joints move smoothly. After seventy days, the heart dislikes noise, and aspirations soar. After eighty days, one becomes indifferent and serene, faith and clarity guarding the Way. After ninety days, the countenance becomes lustrous and smooth, and the voice resonant and clear. After a hundred days, essence and qi fully arrive, and efficacy grows daily. If cultivation persists without cease, lifespan naturally lengthens.\n\nAfter three years, the *jiupan* vanishes, and the complexion radiates. After six years, marrow fills the bones, and one foresees life and death. After nine years, one commands ghosts and spirits, jade maidens attend at one’s side, the brain solidifies, and the ribs join—no harm can befall one. This is called a \"Perfected Person,\" who assists the Supreme Emperor, shares the lifespan of Heaven, and merges light with the sun and moon. Transmitting this to the wrong person brings disaster upon oneself.\n\n**The Chart of Divine Immortality** states:\nIf you constantly bear the Dao in mind, the Dao will bear you in mind. In sorrow and adversity, think of the Dao; in illness, think of the Dao; in poverty and lowliness, think of the Dao; in hardship, think of the Dao; in wealth and honor, think of the Dao; in eating and drinking, think of the Dao; entering mountains and marshes, think of the Dao; crossing rivers and seas, think of the Dao; when rising, think of the Dao; in all actions, think of the Dao—the Dao accompanies you.\n\nWhere the Dao emerges, the myriad things are born, and the myriad spirits are perfected. There is nothing it does not protect, nothing it does not ennoble. If you forget the Dao even for a moment, the Dao enters the Eight Darknesses. Bearing the Dao in mind and absorbing qi, you will attain longevity.\n\nThe Dao is I, and I am with you. If you wish to guard the path of longevity, preserve it. In movement and stillness, eating and drinking, sitting and rising, and even in breathing, always bear it in mind, never forgetting it day or night. Thus, you will be preserved, essence, qi, and spirit never leaving the body—then you will attain longevity.\n\n**The Scripture of Manifest Dao concludes.**",
      "overlap_context": "urn upon you. Conceal it in a golden chamber, seal it with jade gates, hold fast with sealed lips and bound tongue—never reveal my writings. Swear an oath in blood, and ascend to pay homage to the Primordial Ancestors.\n\nLaozi said: When ordinary worldly people seek the Dao and virtue, they must first preserve their spirit. Its true essence is white as a luminous pearl: at dawn, it resides in the philtrum below the nose; at mealtime, it rests within the hairline; at midday, it dwells in the head.",
      "start_char": 4047,
      "end_char": 5091,
      "start_sentence": 206,
      "end_sentence": 256,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.46273422241211,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\显道经.txt",
        "category": "方法类"
      }
    }
  ]
}