{
  "source_id": "晋真人语录",
  "source_file": "chunked_daozang\\晋真人语录.json",
  "total_chunks": 6,
  "total_original_chars": 4816,
  "total_translated_chars": 28002,
  "total_translation_time": 139.2307071685791,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏太玄部\\晋真人语录.txt",
    "category": "正统道藏太玄部"
  },
  "full_translation": "**The Recorded Sayings of Perfected Jin**\n\n**Title:** *The Recorded Sayings of Perfected Jin*\n**Volume:** One\n**Compiled by:** Quanzhen Daoists of the Jin Dynasty\n**Source:** *Daoist Canon of the Zhengtong Era*, Supreme Mystery Section\n\n---\n\nThe Master said:\nSince the beginning of creation until this day, humanity has sunk into suffering without end. Now is the time when immortals descend and the Great Dao rises. Though all are children of heaven, the wise and the foolish differ. The wise turn toward the Dao, while the foolish turn away. Those who turn toward the Dao live; those who turn away die.\n\nA pure heart and tranquil intent are the path to heaven. A scattered mind and chaotic thoughts are the gates of hell. I ask you all: is it better to ascend to heaven or descend to hell?\n\nThough the Dao is revered and virtue is noble, how could they be expounded to the deluded and foolish? Were it not for the flourishing of the Dao in this age, how could the pure and wondrous celestial mechanism be revealed to the world, drawing forth the wise and enlightened?\n\nThe Master said:\nIn cultivating the Dao, one must first recognize the root of one’s nature and life. Only then can one refine the truth to preserve life. The beginning of cultivation lies in *storing the Three*, *embracing the Origin*, and *guarding the One*.\n\n*Storing the Three* refers to essence, qi, and spirit—the Three Treasures.\n*Embracing the Origin* means holding fast to the original yang true qi.\n*Guarding the One* means preserving the singular numinous spirit.\n\nThe spirit resides originally in the heart, which belongs to the southern fire of bing and ding. Within the heart lies nature, which is yang. The kidneys generate the original yang true qi, which belongs to the northern water of ren and gui. Water is life, and life is yin. Thus, the above explains nature and life, clarifying their origins. From ancient times to now, most people have not understood nature and life, but today they are revealed to the world.\n\nThe Master said:\nThe study of the Dao originally has three stages.\nFirst, focus the mind within the lower elixir field, the immortal’s grotto, and do not allow the heart and intent to scatter. Embrace the original yang true qi—this is the foundation of longevity and the true essence of the Dao. It is the path from death to life, the alchemical furnace of yin and yang. Within this elixir field, settle the heart and stabilize the intent, abiding in profound stillness, continuous and unbroken. After diligently guarding this for three to five years, naturally, within the cauldron, the two qi will merge, warming into a single darkness. Through transformation, it becomes emptiness, and the numinous embryo forms into an immortal vessel. The spirit within the heart becomes numinous, leaping with joy, singing and dancing of its own accord. Generally, when the spirit attains the numinosity of qi, and qi attains the clarity of the spirit—*The Scripture of Yin Convergence* says: \"Sagely work arises therein, and numinous clarity emerges.\" Qi is the mother of the spirit, and the spirit is the child of qi. If mother and child constantly guard each other without separation, naturally, over time, the spirit stabilizes, and the immortal Dao is achieved.\n\nSecond, having attained *spirit stabilized and qi harmonized*, then release the four great elements—do not cling to them. Cultivate with ease, and the Dao’s qi will naturally arise in pure stillness. The spirit will ascend to the numinous palace, forever present before you, never turning back.\n\nThird, having attained *spirit stabilized and black qi harmonized*, one surpasses the natural lifespan. Release the heart to be open and carefree, at ease and free, untroubled and serene—this is the achievement of the Limitless Great Dao. When purity is perfected, and one day merit is complete and conduct fulfilled, you will receive the Jade Emperor’s summons to the celestial assembly, becoming a person of unimpeded freedom, enjoying eternal joy and bliss.\n\nThe Master said:\nIn studying the Dao and cultivating practice, if the living spirit is unstable, it is only because the work is not yet complete. Do not count the years; simply hold fast. As Perfected Lü said: \"Do not say the Great Dao is hard to attain—it is only that the work is not yet complete.\"\n\nThe Master said:\nIf one cultivates with carelessness, effort is not diligent, and the spirit is not clear. Persevere without betraying true practice; the heart is not wearied, the will is not reckless, essence is not depleted, and the spirit does not flee.\n\nThe Master said:\nAlas! I see people in the world seeking masters and inquiring about the Dao, yet unwilling to be humble and obedient. They claim to surpass others in ability. When it comes to cultivation, they are neither diligent nor cautious, nor patient. They rely only on empty words, lacking true skill. They do not cultivate with urgency, and upon seeing the poor, they lack any heart to relieve them. Such failures in merit and conduct cause deficiencies in hidden virtue and transgressions against the Dao. For such people, the attainment of immortality and the verification of the Dao are far indeed.\n\nNow, let me briefly speak of the causes of the Dao’s fruition. Heaven only aids those with true merit and true conduct. Those of great goodness and virtue naturally move heaven and earth. As the scripture says: \"Heaven is impartial; it aids only those with virtue.\" If one seeks true merit, one must settle the heart and stabilize the intent, gather the spirit, remain unmoved and uncontrived, truly pure and truly still, embrace the Origin and guard the One, store the spirit and secure the qi—this is true merit. If one seeks true conduct, one must cultivate practice and accumulate virtue, relieve the poor and rescue the suffering. Upon seeing others in distress, one should always harbor a heart to save them. Or, one may guide and instruct good people to enter the Dao and cultivate practice. In all actions, put others before oneself, and be selfless toward all things—this is true conduct.\n\nThe Master said:\nIf one cultivates practice to nurture life, one must first accumulate merit and amass work. With merit but no conduct, the Dao’s fruition is difficult to achieve. Only with both merit and conduct complete is one called a Perfected Person.\n\nThe Master said:\nWe speak to those within the teaching: you must greatly awaken to the principles of nature and deeply explore the wondrous Dao, with your will set on cultivating practice and studying immortality. *The Scripture of Western Ascension* says: \"Eliminate defilements, cease thoughts, purify the heart, and guard the One.\" When all defilements are removed, all affairs are complete—this is the essential teaching of my Dao, the peerless within the wondrous.\n\nIn all exchanges of Daoist discourse, attend to the treasure within the body, exhort others to turn toward heaven’s Dao, and follow heaven’s principles. Do not slander heaven or revile earth. As for Zhang Yuanzi, who spoke madly with his back turned, discoursing on matters of the spirit—he was indeed a person who had attained the Dao.\n\nHere is the translation:\n\n---\n\nYet one must be tolerant and not seek others’ faults.\n\nThe Master said: Those who study the Dao must keep their entire being pure and undefiled. They must not kill living things, consume alcohol, eat meat, break precepts, or violate the rules of sexual conduct. In all matters, they should be forbearing, endure hardship themselves, and yield to others. They must abandon anger, resentment, greed, and extravagance, and always practice patience, humility, and frugality. When they see others in distress, they should feel compassion and relieve their suffering; when they see others in poverty, they must aid them in their urgent needs. In doing good, they should put others before themselves. In their dealings with others, they should be humble toward superiors and harmonious with inferiors. They should repay enmity with kindness. They must not notice others’ faults or speak of others’ wrongs. They should silently accumulate hidden virtue, seeking no recognition from others, only hoping that Heaven will take notice—such a person is truly one who walks the Dao.\n\nThe Master said: The Great Dao has no fixed form; its subtlety is beyond measure. The sage embodies it in daily life, while the common people use it daily yet remain unaware. Turning away from the Dao, one loses one’s true nature and moves toward the realm of death, never realizing that a person exists within the Dao as a fish exists within water. A fish dies when it leaves the water; a person perishes when they lose the Dao.\n\nThe Master said: The meaning of the scriptures is often profound and obscure, difficult to comprehend at once. Now, I will use the language of the world to dispel delusion and point the way to awakening. If there is still anything unclear, seek further instruction from later generations. If one can grasp the meaning and cultivate practice, they may be permitted to transmit it as a disciple, preserving life and refining the true nature, accumulating blessings to the ends of the earth, and healing others’ illnesses as a great practice. Whoever receives this text will erase the sins of nine generations of ancestors and bring fortune to their parents. My heart’s wish is to universally relieve suffering, sickness, and the perils of life and death. If anyone deceives others with these words, they will be condemned to the Dark Mountains for ten thousand kalpas.\n\n**Verse:**\nTo study the Dao, one must be as steadfast as iron,\nSevering body and mind without hesitation.\nBite through ignorance in a single stroke,\nNever wavering in thought before or after.\n\n**The Secret of Cultivating Nature in the Perfected Immortal Tradition of Ancestor Chongyang**\n\nThe Complete Realization (Quanzhen) is the pure emptiness of the Great Dao, the gate of effortless and carefree spontaneity, the pure and upright family tradition, the living practice of Chongyang. Those who cultivate immortality and study the Dao must not recklessly wander in search of Chan or waste effort in questioning the Dao. In group settings, guard your speech to accumulate true merit; in solitude, guard your mind to amass genuine conduct. Do not overlook even minor transgressions, nor neglect the accumulation of small virtues. Tightly restrain the monkey-mind, firmly capture the horse-intent. Dispel the Three Rebels to calm the spirit; exterminate the Six Bandits to stabilize the mind. Gently regulate the fire and water, subtly adjust the breath to refine true merit. In purity and stillness, lower yourself; in humility and gentleness, temper the heart. Be reverent toward others, and it will benefit you.\n\nExamine every aspect to break through this walking corpse; in every thing, cease the wandering of the bones. Yet how is it that people take clever speech as ability, each one clinging to strength as victory? The fire of ignorance burns fiercely, claiming supremacy; the mountain of self and others looms high, asserting sole correctness. In crowds, they do not humble themselves; in bustling places, they do not seek stillness. In desire, the spirit scatters; in motion, the mind scatters. There is another type who rely entirely on begging for sustenance, claiming it is true cultivation. Such are the lazy and indulgent ghosts, the dull and unenlightened. These foolish and aimless fools would do better to hear early and temper their stubborn minds, casting off falsity to cultivate the true and complete their nature.\n\nIf one clings to cleverness, the nature becomes obscured; if one fixates on the mind-lamp, it suddenly dims. Stinginess makes the Great Dao difficult to achieve; cruelty makes the mysterious truth hard to awaken to. Jealousy of the worthy and envy of the capable invite transgression; fear of death and clinging to life create sin. Selling talismans and peddling arts to deceive others, seeking pleasure and treating illness for profit—these are thieves within the Dao and harm to the multitude. Failing to awaken to the wondrous secret, they wander aimlessly, their minds and intentions lost in madness. Having received offerings from the faithful in all directions, they can hardly repay them. If one cultivates diligently and completes the true heart, even a moment of laziness will plunge them into hell. If one encounters a true teacher and earnestly seeks the wondrous secret, do not let the foolish know of it. There is no need for the laborious work of shaking sinews and marrow, nor the deceptive arts of dual cultivation. Simply master the initial stage of non-action, and naturally feel the harmony of spirit and qi, the joyful completion of the elixir furnace. The numinous cinnabar shines brightly, the radiance of the spirit-light gleams, revealing the ancestral origin of the Dao and virtue. Recognize this as the source of purity and tranquility, the wondrous gate of nature and life, the mold of liberated immortals. If everyone awakens to this mystery, they will attain longevity and eternal vision. This is not deceptive speech to mislead others, nor is it heretical arts to entice you.\n\nI earnestly admonish the lofty scholars of the Complete Realization and exhort the deluded followers of the world. Let each awaken to these harmful winds and together ascend to the true teaching. Now, I have explained the essentials of cultivation, capable of dispelling the doubts of those lost in the desert of delusion. I hope that all will leave the mundane to ascend to the true, each severing the dust to attain the Dao. Thus, may all sentient beings ascend to the realm of immortals.\n\n**Answers to Master Ma’s Fourteen Questions**\n\n**First Question:** What is the unfathomable place where thought and spirit meet, where dragon and tiger converge in stillness?\n**Answer:** That is the realm of utter emptiness and quiescence.\n\n**Second Question:** What is the Gate of the Mysterious Female, said to be the root of heaven and earth?\n**Answer:** The *xuan* is the father’s essence; the *pin* is the mother’s blood. Originally, each was eight ounces, combining to make one catty. A single point of primordial yang true qi is the original root.\n\n**Third Question:** What is the day of returning to life and reverting to the root, called stillness?\n**Answer:** Simply ensure the mind does not chase after things, remains unstained and unattached. When the mind is settled and the intent undispersed, the spirit unobscured—this is reverting to the root. Without this, one cannot return to the root.\n\n**Fourth Question:** How does one see the nature?\n**Answer:** Simply have no mind, no thoughts, and do not cling to anything. Be clear and serene, with nothing arising within or without—this is seeing the nature.\n\n**Fifth Question:** What is responding to things without obscuration?\n**Answer:** Though the ears hear, the eyes see, and the mouth speaks, simply ensure the mind does not cling. This is it.\n\n**Sixth Question:** What are the Heavenly Gate and Earthly Pivot, and how does one keep them in mutual embrace?\n**Answer:** The Heavenly Gate and Earthly Pivot are nothing other than the two words *spirit* and *qi*. Simply remain unattached and unstained, with the mind settled—this is the dark stabilization. If the mind stirs, the *qi* scatters. If the mind does not move, mother and child embrace one another.\n\n**Seventh Question:** What is the three-foot sword of emerging from being and entering non-being, and the life-bestowing, death-defying elixir pellet?\n**Answer:** Emerging from being and entering non-being is simply the one darkness. The three-foot sword is wisdom. The life-bestowing, death-defying is the single numinous true nature. The elixir pellet is destiny. Just employ clarity and purity, be without mind, and seek a quiet place to sit—there is nothing more to it.\n\n**Eighth Question:** What is regulating the breath?\n**Answer:** It is not something done. If the mind is free of affairs, the *qi*-breath naturally regulates itself. But to be aware of regulating the breath is already clinging. In regulating the breath, one must not perceive it, nor fixate upon the mouth and nose. Today I tell you, fellow practitioners, there is nothing else to it. Simply ensure the mind is free of affairs, and seek a quiet place to sit. It is only because my mind was free of affairs that I entered the Great Dao. Follow this path.\n\n**Ninth Question:** What does the Great Master Bodhidharma mean by \"lifting empty space and turning to observe one’s face\"?\n**Answer:** Empty space is the one nature. Turning the head to observe is to be without obscuration.\n\n**Tenth Question:** How may a disciple who has left the household late in life, with sinews and blood in decline, be instructed?\n**Answer:** Replenish them.\n\n**Further Question:** What does \"replenish\" mean?\n**Answer:** Simply ensure that in every situation the mind is free of affairs, all entanglements are released, and the six senses do not engage with the external. Use only the one master—speak little, do not cling to things, remain unwavering throughout the twelve hours, reduce sleep, and set everything aside at once. This is replenishment.\n\n**Eleventh Question:** What are lead and mercury?\n**Answer:** Lead is the father’s essence; mercury is the mother’s blood. They are also the two words *nature and life*, *dragon and tiger*.\n\n**Twelfth Question:** When in stillness, all manner of thoughts arise, or one becomes excessively drowsy. How can thoughts be stilled and drowsiness reduced?\n**Answer:** It is only because the inner core lacks substance. When the spirit is faint and subtle, if the inner core is truly substantial, thoughts will naturally cease, and drowsiness will not arise.\n\n**Thirteenth Question:** What is meant by \"the place beyond heaven and earth’s reckoning, where even ghosts and spirits do not know\"?\n**Answer:** What else could it be?\n\n**Fourteenth Question:** What does it mean for the twelve hours to seem like one?\n**Answer:** Not only should the twelve hours seem like one, but even if it were a thousand or ten thousand days, the slightest deviation from this unity would already be premature extinction.\n\n*Eighteen Questions and Answers on Miscellaneous Treasures of the Daoist Gate*\n*Quanzhen School*\n\nTo be a Perfect Realized One is to align with the Dao of Heaven’s heart. The spirit does not stray, qi does not scatter, essence does not leak—when these three are complete, the Five Phases gather in full, the Four Symbols rest in harmony, and this is called *Perfect Realization*.\n\n**Verse:**\nEver follow the ancestral master’s teachings,\nIn daily practice, hold the heart of the Old Lord.\nRefine the true nature of Suchness—\nIs this not *Perfect Realization*?\n\n**Reverent Salutation:**\nPrecious and weighty—\nNo outward form, no inner substance, true emptiness within and without.\nFrom the Ultimateless to the Great Beginning,\nCommuning with the divine to receive blessings.\nThe tradition of the Most High—\nEternal life, undying.\nNo thought, no attachment,\nTransforming the Dharma-realm.\nWithin the forest of the Seven Treasures,\nLayer upon layer, light upon light,\nUnshaken, unmoved—\nThis is the reverent salutation, precious and weighty.\n\n**The Master:**\nNo dharma existed before the self,\nRadiant yet formless.\nUnchanged through ancient and modern—\nIs this not *the Master*?\n\n**The Daoist Novice:**\nThe novice was originally one with the Great Dao,\nOnly by thinking of the world did they enter the cage of the mundane.\nNow their mind dwells beyond the azure heavens,\nAll dharmas unbound, in communion with the Dao.\n\n**Unkempt Hair:**\nThis is the ancient tradition of the Most High—\nMaster one dharma, and all dharmas are mastered.\nLay down even the slightest defilement,\nAnd the single nature naturally aligns with Heaven.\n\n**Topknot:**\nThe topknot was left behind by Zhongli,\nAtop Kunlun’s peak, the sun is placed.\nNo one disturbs it to wash at Changshan,\nAnd on the earth, the white ox roams freely.\n\n**Crown:**\nA pair of starry eyes survey front and back,\nAll dharmas gathered and stored within.\nInside and out, exquisitely wrought, no trace revealed—\nRadiant and solitary, the path is bright and clear.\n\n**Robes:**\nOnce fallen and careless, reckoning not the seasons,\nThe robe is vast and wide, enveloping heaven and earth.\nCut off from the red dust, the body remains unstained,\nNeither cold nor heat can intrude.\n\n**Four Towers:**\nSpring, summer, autumn, winter—arrayed in four robes,\nEncompassing the ten thousand images, who knows this?\nWine, sex, wealth, and anger—mundane affairs,\nAll four cast aside, all strife extinguished.\n\n**Bamboo Hat:**\nAlone it hangs atop Kunlun’s peak,\nA single round light illumines boundlessly.\nLet wind, rain, frost, and snow come as they may—\nThis single pagoda serves as an unyielding sky.\n\n**Sash:**\nHow many times does it circle in coming and going?\nThe wayward monkey and stubborn horse are tightly bound.\nA thousand strands, ten thousand threads—all laid down,\nAnd the wheel of birth and death loses its escape.\n\n**Pouch:**\nA cloth three feet square,\nWho knows the work of creation?\nWithin it transcends the Dharma-realm,\nEnveloping the Great Void.\n\n**Staff:**\nUpright, it stands between heaven and earth,\nHorizontally, it bears the sun, moon, mountains, and rivers.\nTurning the marrow of heaven and earth,\nIt moves the ten thousand images of the forest of phenomena.\n\n**Bowl:**\nOne bowl holds the rice of a thousand homes,\nA solitary body roams ten thousand miles.\nTo escape the path of birth and death,\nBegging sustains the passing seasons.\n\n**Shoes:**\nStep by step, following me without counting the years,\nComing and going, treading the old mountains and rivers.\nFrom now on, no more mud or water—\nLet them fly in pairs across the azure sky.\n\n**Coming and Going:**\nComing from the Great Dao,\nGoing by the original Dao.\nComing and going without clinging to dust,\nDwelling in purity and stillness.\n\n**Leaving Home to Cultivate the Dao:**\nOnce parted from the dust, this is leaving home,\nNon-action, non-creation—my livelihood.\nIf one asks for the secret of my cultivation,\nClouds scatter, the blue sky, the moon shines alone.\n\n**Daily Practice:**\nNurturing nature, forgetting emotions—this is daily practice,\nBegging door to door—this is my livelihood.\nComing and going freely, without hindrance,\nThe clear wind and bright moon are my neighbors.\n\n**Verse:**\nImmortals are what worldly people seek,\nBut who is willing to let all matters in the heart rest?\nIf you awaken to your own true nature and life,\nYou will roam with the clear wind and bright moon.\n\n**Two *Shuilong Yin* Poems:**\n\n**I**\nOriginally left the world to leave home,\nNo longer coveting worldly glory or profit.\nUnkempt hair, a soiled face,\nSitting alone all day, cultivating inner livelihood.\nIn an ancient temple’s niche,\nLet the red sun set in the west.\nFrom nothingness recognize being,\nKnow the white, guard the black,\nCeaselessly and silently regulating the breath.\n\nThe mind holds no entanglements,\nA pouch at the side, a staff in hand.\nStraw sandals broken, hempen cords frayed,\nBare legs, a sheep’s hide covering the body.\nAfter hunger, wandering door to door,\nWhen full, returning—singing *li lan luo li*.\nLet others laugh and call me\nA dull, lazy fellow—\nWho among them understands?\n\n**II**\nThe heart of one who studies the Dao is hard as iron,\nEntirely self-reliant, fiercely resolute.\n\n**Breaking Free**\n\nShattering the shackles of profit, severing the bonds of fame,\nAll loves and passions wholly cast aside.\nNothing left to cling to—\nNo entanglements, no lingering ties—\nDwelling in a thatched hut of reeds.\nEven amid the bustling marketplace,\nUpright and steadfast in guarding the Dao,\nRelying on this practice to pass the days and months.\nAs a poor Daoist mendicant,\nContent with coarse fare, heedless of cold or heat.\n\nUnkempt hair, a soiled face,\nSitting alone all day, cultivating inner work.\nHaving met a radiant teacher’s instructions,\nThe world calls him mad, a wind-driven fool.\nYet there are profound and subtle moments—\nHow to speak of the seven songs’ mysteries?\n\n**Eulogy:**\nAlone I ascend the high mountain, gazing toward the eight directions,\nBlack clouds disperse, leaving the moon solitary.\nIn this boundless cosmos, countless are the people—\nWhich man among them is a true husband?\n\nWithin the depths of the Crimson Cavern Grotto,\nThe Dao is not distant—yet people, though near, fail to awaken.\nThe floating and sinking of inner landscapes\nRequire the master’s craftsmanship.\nAwaiting dawn’s arrival,\nA single yang stirs, opening the path to the mysterious.\nAll is concealed within the azure waves,\nIn their profound depths, the master of affairs.\nThe earth’s thunder resounds,\nShaking the mountaintop with rain.\nGradually it nourishes the yellow sprout, newly risen from the soil.\nThe infant is gathered and carried away in a basket,\nToward the true radiance of the six yangs,\nSimmered within the crucible.\nCirculating and turning,\nEast and west, south and north.\nLaying out the eight trigrams,\nThe nine palaces must know their ancestral source.\nWithin the reckoning of the ten celestial stems,\nDivided left and right,\nThe dragon and tiger must be made manifest.\nThe Dark Warrior follows the Vermilion Bird,\nAuspicious clouds spread forth in the vanguard.\nAt the Winding River’s edge,\nAll spirits gather to meet the master.\nReturning to the mother of *gui*,\nRiding the crimson dragon back to the grotto.\nSeek out Master Ding to inquire of his abode,\nWhere yin and yang unite in three thousand measures.\nPointing to heaven and earth, seas and mountains,\nAll endure as one, firm and unyielding.\n\n**Poem:**\nThe Yellow River’s waters turn at the Lü family’s home,\nA single gourd holds heaven and earth, aged in mist and haze.\nThe heartless white deer tames the vermilion phoenix,\nA black tortoise coils around the crimson serpent.\nIn the sixth month, white snow flies on the mountain’s peak,\nIn the third winter, the yellow sprout grows beneath the waters.\nIf one grasps these principles,\nImmortals on earth swarm like hemp.\n\n**Green-Headed Duck**\nIn speech, ever constant—\nAwakening from the southern branch’s dream of yellow roots.\nShattering the splendor of the world,\nIn a cloud niche clad in plain cloth,\nRecognizing one’s lineage,\nTurning the light inward to reflect.\nWielding the sword of wisdom to sever the net of love,\nBrandishing the staff of transcendence to shatter the dusty realm.\nWherever we meet,\nAt Mount Emei, at will,\nSwiftly concealing our brilliance, we hasten to Mount Hua.\nHidden in forests and springs,\nSouth Star and Northern Dipper,\nSun and moon concealed within the sleeve.\nThe crimson countenance endures,\nThough heaven collapses and earth crumbles,\nThe true nature remains unchanged.\nDancing in the sleeves of the robe,\nThe cosmos seems too narrow—\nYet with a sweep of the hand,\nHeaven and earth are measured as level ground.\nDrunken and carefree,\nA sack holds the four seas,\nLaughing and joyful,\nThe belly drinks three cups.\nSeveral times at the Jasper Pool,\nAt the Dragon Flower Assembly,\nAmong the immortals’ precious feast,\nInebriated by the rosy goblet.\nAt the Jade Emperor’s imperial banquet,\nThe gathering is incomplete without me.\nAt the Double Yang Festival,\nSeven golden lotuses bloom,\nRadiating divine light.\n\n**Eulogy:**\nPure and luminous, the bright and solitary moon,\nClear and resplendent, polished like a water-ground mirror.\nDeep and verdant, the jade-green pool reflects its image,\nMelodious and serene, a celestial immortal beyond the world.\nDripping and round, plucked from nothingness,\nVivid and free, set down in perfection.\nSpinning and sparkling in the crystal dish,\nA crimson glow—\nA single expanse of blue heaven.\n\n**Eulogy:**\nAtop the Jade Capital Mountain, a pool of water,\nIts depths unreachable from any of the four sides or eight directions.\nIf one recognizes the boatman,\nNaturally, one sails into the celestial palace.\n\n*Record of the Perfected Master Jin* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "晋真人语录 经名：晋真人语录。 一卷。 当系金朝全真道士编撰。 底本出处：《正统道藏》太玄部。 晋真人语录 先生曰：开辟已来，至於今日，这人沉沦，无有休期。 此时正遇神仙出世，大道将兴。 虽一盘天民，争奈贤愚不等。 贤者向道，愚者背道，向道而生，背道而死。 心清意静，天堂之路。 心荒意乱，地狱之门。 试问诸公：上天堂好，入地狱好？ 虽然道之尊，德之贵，岂为迷愚说哉。 若非今世道教兴，安得使清净天机漏於世问，取聪明上士。 先生曰：人之修行，先须识取性命宗祖，然后〔修〕真以保命。 修行须存三、抱元、守一为初。 存三者，乃是精、炁、神，真三宝也。 抱元者，抱守元阳真炁。 守一者，守其一灵神也。 神者，元本在心，心属南方丙丁火。 心中有性，性属阳。 肾者，能生元阳真炁。 炁属北方壬癸水。 水为命，命属阴。 已上说性命，明知下落。 自古及今，人多不识性命，今日显扬於世。 先生曰：学道本来有三。 一者一心在想，秖在下丹田仙洞之内，莫放心意散乱，抱元阳真炁，便是长生，真道本也。 是出死入生之道，是阴阳造化仙炉也。 这丹田内，澄心定意，昏昏默默，绵绵不断，谨守三五年之问，自然丹炉鼎内，二炁相交，温成一黑，造化成虚无，灵胎仙成器，心中神自灵，踊跃欢喜，自歌自舞。 大抵神得炁灵，炁得神清。 《阴符经》云：圣功生焉，神明出焉。 炁是神之母，神是炁之子，常使子母相守不离，自然日久神定，仙道成矣。 二者既得〔神定炁和〕，然后放四大，莫把捉，坦然修养，道炁自然，清清净净之中，神即上灵宫，永作目前，更不回顾也。 三者既得神定黑炁和，应过天年也。 放心坦荡，自在逍遥，无事清闲，乃是无极大道成也。 清争到头，异日功成行满，玉皇诏上会，作个无碍人，长生快乐也。 先生曰：学道修行，或活神不定，柢是功夫未成，不计年限，且须抱守。 吕真人云：莫言大道人难得，自是功夫不到头。 先生曰：夫修行施以不谨，功不勤而神不清。 持久不负真行，心不劳而志不狂，精不亏而神不飞。 先生曰：嗟见世问人寻师访道，不肯恭顺於人，只说俱能己胜。 至於修行，又不肯勤谨慎忍，只凭口说，全无真功。 亦不真紧修行，以见贫者又无拯救之心。 种种亏功失行，到使阴德有亏，於道有违。 似此之徒，欲要成仙证道，甚远矣哉。 如今略说道果之因，上天只柢佑真功真行，如大善德之人，自可感动天地。 经云：皇天无亲，惟德是辅。 若要真功者，须是澄心定意，打迭精神，无动无作，真清真净，抱元守一，存神固炁，乃真功也。 若要真行，须要修行蕴德，济贫拔苦，见人患难，常怀拯救之心，或化诱善人入道修行，所为之事先人后己，与万物无私，乃真行也。 先生曰：若人修行养命，先须积行累功。 有功无行，道果难成，功行两全，是谓真人。 先生曰：吾辈说与教门中人，须是大悟性理，深穷妙道，志在修行学仙。 《西升经》云：除垢止念，净心守一。 众垢除，万事毕，吾道之要也。 此乃妙中无比也。 凡有道话往来，且照顾润身中之宝，劝人向天之道，顺天之理，不得毁天谤地。 若张渊子，背口发狂言，归谈神中事，此乃得道之人也。",
      "translated_text": "**The Recorded Sayings of Perfected Jin**\n\n**Title:** *The Recorded Sayings of Perfected Jin*\n**Volume:** One\n**Compiled by:** Quanzhen Daoists of the Jin Dynasty\n**Source:** *Daoist Canon of the Zhengtong Era*, Supreme Mystery Section\n\n---\n\nThe Master said:\nSince the beginning of creation until this day, humanity has sunk into suffering without end. Now is the time when immortals descend and the Great Dao rises. Though all are children of heaven, the wise and the foolish differ. The wise turn toward the Dao, while the foolish turn away. Those who turn toward the Dao live; those who turn away die.\n\nA pure heart and tranquil intent are the path to heaven. A scattered mind and chaotic thoughts are the gates of hell. I ask you all: is it better to ascend to heaven or descend to hell?\n\nThough the Dao is revered and virtue is noble, how could they be expounded to the deluded and foolish? Were it not for the flourishing of the Dao in this age, how could the pure and wondrous celestial mechanism be revealed to the world, drawing forth the wise and enlightened?\n\nThe Master said:\nIn cultivating the Dao, one must first recognize the root of one’s nature and life. Only then can one refine the truth to preserve life. The beginning of cultivation lies in *storing the Three*, *embracing the Origin*, and *guarding the One*.\n\n*Storing the Three* refers to essence, qi, and spirit—the Three Treasures.\n*Embracing the Origin* means holding fast to the original yang true qi.\n*Guarding the One* means preserving the singular numinous spirit.\n\nThe spirit resides originally in the heart, which belongs to the southern fire of bing and ding. Within the heart lies nature, which is yang. The kidneys generate the original yang true qi, which belongs to the northern water of ren and gui. Water is life, and life is yin. Thus, the above explains nature and life, clarifying their origins. From ancient times to now, most people have not understood nature and life, but today they are revealed to the world.\n\nThe Master said:\nThe study of the Dao originally has three stages.\nFirst, focus the mind within the lower elixir field, the immortal’s grotto, and do not allow the heart and intent to scatter. Embrace the original yang true qi—this is the foundation of longevity and the true essence of the Dao. It is the path from death to life, the alchemical furnace of yin and yang. Within this elixir field, settle the heart and stabilize the intent, abiding in profound stillness, continuous and unbroken. After diligently guarding this for three to five years, naturally, within the cauldron, the two qi will merge, warming into a single darkness. Through transformation, it becomes emptiness, and the numinous embryo forms into an immortal vessel. The spirit within the heart becomes numinous, leaping with joy, singing and dancing of its own accord. Generally, when the spirit attains the numinosity of qi, and qi attains the clarity of the spirit—*The Scripture of Yin Convergence* says: \"Sagely work arises therein, and numinous clarity emerges.\" Qi is the mother of the spirit, and the spirit is the child of qi. If mother and child constantly guard each other without separation, naturally, over time, the spirit stabilizes, and the immortal Dao is achieved.\n\nSecond, having attained *spirit stabilized and qi harmonized*, then release the four great elements—do not cling to them. Cultivate with ease, and the Dao’s qi will naturally arise in pure stillness. The spirit will ascend to the numinous palace, forever present before you, never turning back.\n\nThird, having attained *spirit stabilized and black qi harmonized*, one surpasses the natural lifespan. Release the heart to be open and carefree, at ease and free, untroubled and serene—this is the achievement of the Limitless Great Dao. When purity is perfected, and one day merit is complete and conduct fulfilled, you will receive the Jade Emperor’s summons to the celestial assembly, becoming a person of unimpeded freedom, enjoying eternal joy and bliss.\n\nThe Master said:\nIn studying the Dao and cultivating practice, if the living spirit is unstable, it is only because the work is not yet complete. Do not count the years; simply hold fast. As Perfected Lü said: \"Do not say the Great Dao is hard to attain—it is only that the work is not yet complete.\"\n\nThe Master said:\nIf one cultivates with carelessness, effort is not diligent, and the spirit is not clear. Persevere without betraying true practice; the heart is not wearied, the will is not reckless, essence is not depleted, and the spirit does not flee.\n\nThe Master said:\nAlas! I see people in the world seeking masters and inquiring about the Dao, yet unwilling to be humble and obedient. They claim to surpass others in ability. When it comes to cultivation, they are neither diligent nor cautious, nor patient. They rely only on empty words, lacking true skill. They do not cultivate with urgency, and upon seeing the poor, they lack any heart to relieve them. Such failures in merit and conduct cause deficiencies in hidden virtue and transgressions against the Dao. For such people, the attainment of immortality and the verification of the Dao are far indeed.\n\nNow, let me briefly speak of the causes of the Dao’s fruition. Heaven only aids those with true merit and true conduct. Those of great goodness and virtue naturally move heaven and earth. As the scripture says: \"Heaven is impartial; it aids only those with virtue.\" If one seeks true merit, one must settle the heart and stabilize the intent, gather the spirit, remain unmoved and uncontrived, truly pure and truly still, embrace the Origin and guard the One, store the spirit and secure the qi—this is true merit. If one seeks true conduct, one must cultivate practice and accumulate virtue, relieve the poor and rescue the suffering. Upon seeing others in distress, one should always harbor a heart to save them. Or, one may guide and instruct good people to enter the Dao and cultivate practice. In all actions, put others before oneself, and be selfless toward all things—this is true conduct.\n\nThe Master said:\nIf one cultivates practice to nurture life, one must first accumulate merit and amass work. With merit but no conduct, the Dao’s fruition is difficult to achieve. Only with both merit and conduct complete is one called a Perfected Person.\n\nThe Master said:\nWe speak to those within the teaching: you must greatly awaken to the principles of nature and deeply explore the wondrous Dao, with your will set on cultivating practice and studying immortality. *The Scripture of Western Ascension* says: \"Eliminate defilements, cease thoughts, purify the heart, and guard the One.\" When all defilements are removed, all affairs are complete—this is the essential teaching of my Dao, the peerless within the wondrous.\n\nIn all exchanges of Daoist discourse, attend to the treasure within the body, exhort others to turn toward heaven’s Dao, and follow heaven’s principles. Do not slander heaven or revile earth. As for Zhang Yuanzi, who spoke madly with his back turned, discoursing on matters of the spirit—he was indeed a person who had attained the Dao.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1236,
      "start_sentence": 0,
      "end_sentence": 58,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.90498399734497,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\晋真人语录.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "但且包容，不得其过。 先生曰：学道之人，切须清净一身，不得杀生、饮酒、食肉、破戒、犯色。 每欲包容万事，苦己饶人，弃绝慎怒怪贪，常行忍辱俭约。 见人患难，行拯苦之心，见人贫乏，必周急之。 好事先人后己，待人谦上和下，以恩复雠。 勿见人之过，勿语人之非，暗积阴德，不求人知，惟望天察，乃即其道人也。 先生曰：大道无方，微妙莫测，圣人体之为日用，百姓日用而不知。 背道而丧真，动感死地，殊不知人在道中，如鱼在水中。 鱼失水则死，人失道则亡。 先生曰：且见经典中言意隐奥，卒难晓解。 今秖以世俗之语，开迷指悟。 或有未明，更於后代之子孙处求教。 傥能解意修行，即许再传弟子，保命修真，积庆天涯，救人疾痾为大行。 若受斯文，则九祖灭罪，父母获福。 吾之愿心，普救病厄及生死之难。 如将此语诳诸人，永入阴山万劫。 颂曰 学道须凭铁汉，便把身心割判。 一口咬断无明，更不前思后等。 重阳祖师修仙了性秘诀 夫全真者，是大道之清虚，无为潇洒之门户，乃纯正之家风，是重阳之活计。 修仙之士，学道之流，慎勿狂游而参禅，且莫徒劳而问道。 群居慎口，累真功，独坐防心，积实行。 莫为小过而不除，休言微行而不积。 心猿紧锁，意马牢擒。 三逆散而神宁，六贼剿而意定。 缓缓而抽添水火，微微而调息真功。 清净寂寥而低下，谦和柔弱而炼心，恭敬於人而有益。 般般勘破这行尸，物物休停除走骨。 争奈人人舌辨以为能，个个刚强而为胜。 无明火大而为尊，人我山高而独是。 处众不取其下，闹处不取其静。 欲处而神荒，动处而意乱。 更有一等，专持乞食度日，却言便是真修。 如此是慵饶下鬼，愚顽不省之人。 迷迷无端之蠢，切不如闻早炼顽心，去假修真而了性。 若执慧性而皆昏，精着心灯而忽暗。 悭吝而难成大道，狠毒而怎悟玄真。 妬贤嫉能而招愆，贪生怕死而造罪。 书符货术而馒人，行乐治病而图贿。 狂怪道中之贼，喧呼众人之害。 不悟妙诀而胡游，心意迷迷而狂走。 受了十方善信供养，而难消〔受〕。 若谨修而了真心，稍怠堕而沉地狱，得遇真师，强寻妙诀，不许愚人得知，只要人人自悟。 不用摇筋摆髓之功，亦没惑人采战之卫，但会无为之初始，自觉神炁而冲和，自然丹炉而乐就。 显现灵砂而照昭一，明辙神光而灿灿，自见道德之祖宗，认是清闲之源本，乃性命之妙门，是脱神仙之模子。 人人悟透此玄机，乃得长生而久视。 不是惑言而说人，亦非邪术而诱你。 酷告全真之高士，奉劝世上之迷徒。 各各悟取害风言，人人同登於正教。 如今说下修行之端的，能绝旱迷之疑虑。 伏望人人离俗以登真，一一断尘而得道。 然愿一切众生，皆登仙阙者矣。 答马师父十四问 第一问：如何是思神不测处，龙虎定相逢？ 答曰：那一切虚寂便是。 第二问：如何玄牝之门，是谓天地根？ 答曰：玄者父精，牝者母血也。 元初各八两，合为一斤，一点元阳真炁，便是元本也。 第三问：如何是复命归根日静？ 答曰：只要心不逐物去，不染不着，心定意不散，神不昧，便是归根。 若不此者，不得归根。 第四问：如何见性？ 答曰：只要无心无念，不着一切物，澄澄湛湛，内外无事，乃是见性。",
      "translated_text": "Here is the translation:\n\n---\n\nYet one must be tolerant and not seek others’ faults.\n\nThe Master said: Those who study the Dao must keep their entire being pure and undefiled. They must not kill living things, consume alcohol, eat meat, break precepts, or violate the rules of sexual conduct. In all matters, they should be forbearing, endure hardship themselves, and yield to others. They must abandon anger, resentment, greed, and extravagance, and always practice patience, humility, and frugality. When they see others in distress, they should feel compassion and relieve their suffering; when they see others in poverty, they must aid them in their urgent needs. In doing good, they should put others before themselves. In their dealings with others, they should be humble toward superiors and harmonious with inferiors. They should repay enmity with kindness. They must not notice others’ faults or speak of others’ wrongs. They should silently accumulate hidden virtue, seeking no recognition from others, only hoping that Heaven will take notice—such a person is truly one who walks the Dao.\n\nThe Master said: The Great Dao has no fixed form; its subtlety is beyond measure. The sage embodies it in daily life, while the common people use it daily yet remain unaware. Turning away from the Dao, one loses one’s true nature and moves toward the realm of death, never realizing that a person exists within the Dao as a fish exists within water. A fish dies when it leaves the water; a person perishes when they lose the Dao.\n\nThe Master said: The meaning of the scriptures is often profound and obscure, difficult to comprehend at once. Now, I will use the language of the world to dispel delusion and point the way to awakening. If there is still anything unclear, seek further instruction from later generations. If one can grasp the meaning and cultivate practice, they may be permitted to transmit it as a disciple, preserving life and refining the true nature, accumulating blessings to the ends of the earth, and healing others’ illnesses as a great practice. Whoever receives this text will erase the sins of nine generations of ancestors and bring fortune to their parents. My heart’s wish is to universally relieve suffering, sickness, and the perils of life and death. If anyone deceives others with these words, they will be condemned to the Dark Mountains for ten thousand kalpas.\n\n**Verse:**\nTo study the Dao, one must be as steadfast as iron,\nSevering body and mind without hesitation.\nBite through ignorance in a single stroke,\nNever wavering in thought before or after.\n\n**The Secret of Cultivating Nature in the Perfected Immortal Tradition of Ancestor Chongyang**\n\nThe Complete Realization (Quanzhen) is the pure emptiness of the Great Dao, the gate of effortless and carefree spontaneity, the pure and upright family tradition, the living practice of Chongyang. Those who cultivate immortality and study the Dao must not recklessly wander in search of Chan or waste effort in questioning the Dao. In group settings, guard your speech to accumulate true merit; in solitude, guard your mind to amass genuine conduct. Do not overlook even minor transgressions, nor neglect the accumulation of small virtues. Tightly restrain the monkey-mind, firmly capture the horse-intent. Dispel the Three Rebels to calm the spirit; exterminate the Six Bandits to stabilize the mind. Gently regulate the fire and water, subtly adjust the breath to refine true merit. In purity and stillness, lower yourself; in humility and gentleness, temper the heart. Be reverent toward others, and it will benefit you.\n\nExamine every aspect to break through this walking corpse; in every thing, cease the wandering of the bones. Yet how is it that people take clever speech as ability, each one clinging to strength as victory? The fire of ignorance burns fiercely, claiming supremacy; the mountain of self and others looms high, asserting sole correctness. In crowds, they do not humble themselves; in bustling places, they do not seek stillness. In desire, the spirit scatters; in motion, the mind scatters. There is another type who rely entirely on begging for sustenance, claiming it is true cultivation. Such are the lazy and indulgent ghosts, the dull and unenlightened. These foolish and aimless fools would do better to hear early and temper their stubborn minds, casting off falsity to cultivate the true and complete their nature.\n\nIf one clings to cleverness, the nature becomes obscured; if one fixates on the mind-lamp, it suddenly dims. Stinginess makes the Great Dao difficult to achieve; cruelty makes the mysterious truth hard to awaken to. Jealousy of the worthy and envy of the capable invite transgression; fear of death and clinging to life create sin. Selling talismans and peddling arts to deceive others, seeking pleasure and treating illness for profit—these are thieves within the Dao and harm to the multitude. Failing to awaken to the wondrous secret, they wander aimlessly, their minds and intentions lost in madness. Having received offerings from the faithful in all directions, they can hardly repay them. If one cultivates diligently and completes the true heart, even a moment of laziness will plunge them into hell. If one encounters a true teacher and earnestly seeks the wondrous secret, do not let the foolish know of it. There is no need for the laborious work of shaking sinews and marrow, nor the deceptive arts of dual cultivation. Simply master the initial stage of non-action, and naturally feel the harmony of spirit and qi, the joyful completion of the elixir furnace. The numinous cinnabar shines brightly, the radiance of the spirit-light gleams, revealing the ancestral origin of the Dao and virtue. Recognize this as the source of purity and tranquility, the wondrous gate of nature and life, the mold of liberated immortals. If everyone awakens to this mystery, they will attain longevity and eternal vision. This is not deceptive speech to mislead others, nor is it heretical arts to entice you.\n\nI earnestly admonish the lofty scholars of the Complete Realization and exhort the deluded followers of the world. Let each awaken to these harmful winds and together ascend to the true teaching. Now, I have explained the essentials of cultivation, capable of dispelling the doubts of those lost in the desert of delusion. I hope that all will leave the mundane to ascend to the true, each severing the dust to attain the Dao. Thus, may all sentient beings ascend to the realm of immortals.\n\n**Answers to Master Ma’s Fourteen Questions**\n\n**First Question:** What is the unfathomable place where thought and spirit meet, where dragon and tiger converge in stillness?\n**Answer:** That is the realm of utter emptiness and quiescence.\n\n**Second Question:** What is the Gate of the Mysterious Female, said to be the root of heaven and earth?\n**Answer:** The *xuan* is the father’s essence; the *pin* is the mother’s blood. Originally, each was eight ounces, combining to make one catty. A single point of primordial yang true qi is the original root.\n\n**Third Question:** What is the day of returning to life and reverting to the root, called stillness?\n**Answer:** Simply ensure the mind does not chase after things, remains unstained and unattached. When the mind is settled and the intent undispersed, the spirit unobscured—this is reverting to the root. Without this, one cannot return to the root.\n\n**Fourth Question:** How does one see the nature?\n**Answer:** Simply have no mind, no thoughts, and do not cling to anything. Be clear and serene, with nothing arising within or without—this is seeing the nature.",
      "overlap_context": " heart, and guard the One.\" When all defilements are removed, all affairs are complete—this is the essential teaching of my Dao, the peerless within the wondrous.\n\nIn all exchanges of Daoist discourse, attend to the treasure within the body, exhort others to turn toward heaven’s Dao, and follow heaven’s principles. Do not slander heaven or revile earth. As for Zhang Yuanzi, who spoke madly with his back turned, discoursing on matters of the spirit—he was indeed a person who had attained the Dao.",
      "start_char": 1236,
      "end_char": 2484,
      "start_sentence": 59,
      "end_sentence": 122,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.35093951225281,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\晋真人语录.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "第五问：如何是应物不昧？ 答曰：耳虽听，目虽视，口虽说，只要心不着也。 第六问：如何是天关地轴，如何得相守？ 答曰：天关地轴亦是神炁二字，只要不着不染，心定乃黑定，心动则炁散，若心不动，则子母相守。 第七问：如何是出有入无三尺剑，长生不死一丸丹？ 答曰：出有入无，只是一黑。 三尺剑，慧也。 长生不死者，一灵真性也。 一丸丹者，命也。 只用清诤无心，寻个诤处坐去，更无甚么。 第八问：如何是调息？ 答曰：非有作也。 若得心中无事，炁息自调，但知调息，便是有着。 调息者，只可不知见，不可着於口鼻。 今日说与众师兄，别无甚么。 只要心无事，寻个静处坐去。 弟子只因心中无事，得入於大道，依此行去。 第九问：如何是达摩大师云，提得虚空回面观？ 答曰：虚空是一性，回头观不昧也。 第十问：如何弟子晚年出家，筋血衰败？ 愿师指教。 答曰：补去。",
      "translated_text": "**Fifth Question:** What is responding to things without obscuration?\n**Answer:** Though the ears hear, the eyes see, and the mouth speaks, simply ensure the mind does not cling. This is it.\n\n**Sixth Question:** What are the Heavenly Gate and Earthly Pivot, and how does one keep them in mutual embrace?\n**Answer:** The Heavenly Gate and Earthly Pivot are nothing other than the two words *spirit* and *qi*. Simply remain unattached and unstained, with the mind settled—this is the dark stabilization. If the mind stirs, the *qi* scatters. If the mind does not move, mother and child embrace one another.\n\n**Seventh Question:** What is the three-foot sword of emerging from being and entering non-being, and the life-bestowing, death-defying elixir pellet?\n**Answer:** Emerging from being and entering non-being is simply the one darkness. The three-foot sword is wisdom. The life-bestowing, death-defying is the single numinous true nature. The elixir pellet is destiny. Just employ clarity and purity, be without mind, and seek a quiet place to sit—there is nothing more to it.\n\n**Eighth Question:** What is regulating the breath?\n**Answer:** It is not something done. If the mind is free of affairs, the *qi*-breath naturally regulates itself. But to be aware of regulating the breath is already clinging. In regulating the breath, one must not perceive it, nor fixate upon the mouth and nose. Today I tell you, fellow practitioners, there is nothing else to it. Simply ensure the mind is free of affairs, and seek a quiet place to sit. It is only because my mind was free of affairs that I entered the Great Dao. Follow this path.\n\n**Ninth Question:** What does the Great Master Bodhidharma mean by \"lifting empty space and turning to observe one’s face\"?\n**Answer:** Empty space is the one nature. Turning the head to observe is to be without obscuration.\n\n**Tenth Question:** How may a disciple who has left the household late in life, with sinews and blood in decline, be instructed?\n**Answer:** Replenish them.",
      "overlap_context": "erting to the root, called stillness?\n**Answer:** Simply ensure the mind does not chase after things, remains unstained and unattached. When the mind is settled and the intent undispersed, the spirit unobscured—this is reverting to the root. Without this, one cannot return to the root.\n\n**Fourth Question:** How does one see the nature?\n**Answer:** Simply have no mind, no thoughts, and do not cling to anything. Be clear and serene, with nothing arising within or without—this is seeing the nature.",
      "start_char": 2485,
      "end_char": 2849,
      "start_sentence": 123,
      "end_sentence": 144,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.701150178909302,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\晋真人语录.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "又问：如何是补？ 答曰：只要头头无事，万缘都放下，六门不交行。 只用一个主人，常少语，不着物，十二时中常不昧，臧省睡眠，一时放下，便是补也。 第十一问：如何是铅汞？ 答曰：铅是父精，汞是母血，亦是性命、龙虎二字。 第十二问：处静之间，有一切念起，或更昏睡多。 如何得念不起，昏睡少？ 答曰：只是裹头无物料，神黑微细，裹头实有物，自然无念不昏睡也。 第十三问：如何是天地不测处，鬼神不知处？ 答曰：那更有甚么。 第十四问：如何是十二时中似一时？ 答曰：不只十二时中似一时，乃至千万日，稍有不似一时，早是早断灭也。 玄门杂宝十八问答 全真",
      "translated_text": "**Further Question:** What does \"replenish\" mean?\n**Answer:** Simply ensure that in every situation the mind is free of affairs, all entanglements are released, and the six senses do not engage with the external. Use only the one master—speak little, do not cling to things, remain unwavering throughout the twelve hours, reduce sleep, and set everything aside at once. This is replenishment.\n\n**Eleventh Question:** What are lead and mercury?\n**Answer:** Lead is the father’s essence; mercury is the mother’s blood. They are also the two words *nature and life*, *dragon and tiger*.\n\n**Twelfth Question:** When in stillness, all manner of thoughts arise, or one becomes excessively drowsy. How can thoughts be stilled and drowsiness reduced?\n**Answer:** It is only because the inner core lacks substance. When the spirit is faint and subtle, if the inner core is truly substantial, thoughts will naturally cease, and drowsiness will not arise.\n\n**Thirteenth Question:** What is meant by \"the place beyond heaven and earth’s reckoning, where even ghosts and spirits do not know\"?\n**Answer:** What else could it be?\n\n**Fourteenth Question:** What does it mean for the twelve hours to seem like one?\n**Answer:** Not only should the twelve hours seem like one, but even if it were a thousand or ten thousand days, the slightest deviation from this unity would already be premature extinction.\n\n*Eighteen Questions and Answers on Miscellaneous Treasures of the Daoist Gate*\n*Quanzhen School*",
      "overlap_context": "a quiet place to sit. It is only because my mind was free of affairs that I entered the Great Dao. Follow this path.\n\n**Ninth Question:** What does the Great Master Bodhidharma mean by \"lifting empty space and turning to observe one’s face\"?\n**Answer:** Empty space is the one nature. Turning the head to observe is to be without obscuration.\n\n**Tenth Question:** How may a disciple who has left the household late in life, with sinews and blood in decline, be instructed?\n**Answer:** Replenish them.",
      "start_char": 2849,
      "end_char": 3122,
      "start_sentence": 145,
      "end_sentence": 158,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.452242374420166,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\晋真人语录.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "夫全真者，合天心之道也。 神不走，炁不散，精不漏，三者俱备，五行都聚，四象安和，为之全真也。 诗曰：常行祖师教，日用老君心。 炼就真如性，岂不是全真。 稽首珍重 无表无裹，内外真空。 无极太始，通神获佑。 太上家风，长生不朽。 无想无存，变化法界。 七宝林中，重重轻轻，不摇不动，为之稽首珍重。 先生 无法先有我，辉辉不露形。 古今无改变，岂不是先生。 道童 道童元与大道同，只因思世入凡笼。 如今意在青霄外，万法无拘与道通。 髼头 本是太上古家风，一法才通万法通。 放下丝毫无垢染，自然一性合天公。 发髻 髻髻元是锺离留，昆仑顶上安日头。 没人搞洗常山去，陆地从来放白牛。 冠 一对星眼观前后，万法收来复内藏。 内外玲珑无显迹，辉辉独显路堂堂。 袍 落魄元初不计春，衣宽广大裹乾坤。 隔断红尘不染体，任他寒暑不能侵。 四楼 春夏秋冬按四袄，包罗万象有谁知。 酒色财气尘俗事，四件皆除绝是非。 笠 独占昆仑顶上悬，圆光一道照无边。 任他风雨并霜雪，一塔权为不漏天。 绦 来往循环得几遭，颠猿劣马紧拴牢。 万缕千丝俱放下，生死轮回失要逃。 遮袋 纵横三尺布，谁知造化工。 此中超法界，包裹太虚空。 拐 竖起顶天立地，横担日月山河。 斡转乾坤骨髓，转动万象森罗。 钵 一钵千家饭，孤身万里游。 为逃生死路，乞化度春秋。 鞋 步步随吾不记年，往来踏遍旧山川。 从今不踏泥共水，一任双飞过碧天。 来去 来从大道来，去从本道去。 来去不沾尘，当居清静处。 出家修行 一自离尘是出家，无为无作我生涯。 若人问我修行诀，云散青天月自华。 日用 养性忘情为日用，沿门乞化是生涯。 来去自由无挂碍，清风明月作邻家。 颂曰 神仙本是世人求，谁肯心头万事休。 若悟自家真性命，清风明月共同游。 水龙吟二首 本自出家离尘世，更不贪人问华利。 髦头垢面，终朝独坐，内修活计。 古庙窖龛裹，任教他、红输西坠。 向无中认有，知白守黑，绵绵的，默调息。 心上别无萦击。 有腋袋、拄杖相随。 草鞋断菱，精肷赤腿，羊皮遮体。 饥后巡门，乞饱来时，唱哩嗹啰哩。 任傍人笑道，呆痴懒汉，有谁人识。 又 学道心刚似铁，全然在自家猛烈。",
      "translated_text": "To be a Perfect Realized One is to align with the Dao of Heaven’s heart. The spirit does not stray, qi does not scatter, essence does not leak—when these three are complete, the Five Phases gather in full, the Four Symbols rest in harmony, and this is called *Perfect Realization*.\n\n**Verse:**\nEver follow the ancestral master’s teachings,\nIn daily practice, hold the heart of the Old Lord.\nRefine the true nature of Suchness—\nIs this not *Perfect Realization*?\n\n**Reverent Salutation:**\nPrecious and weighty—\nNo outward form, no inner substance, true emptiness within and without.\nFrom the Ultimateless to the Great Beginning,\nCommuning with the divine to receive blessings.\nThe tradition of the Most High—\nEternal life, undying.\nNo thought, no attachment,\nTransforming the Dharma-realm.\nWithin the forest of the Seven Treasures,\nLayer upon layer, light upon light,\nUnshaken, unmoved—\nThis is the reverent salutation, precious and weighty.\n\n**The Master:**\nNo dharma existed before the self,\nRadiant yet formless.\nUnchanged through ancient and modern—\nIs this not *the Master*?\n\n**The Daoist Novice:**\nThe novice was originally one with the Great Dao,\nOnly by thinking of the world did they enter the cage of the mundane.\nNow their mind dwells beyond the azure heavens,\nAll dharmas unbound, in communion with the Dao.\n\n**Unkempt Hair:**\nThis is the ancient tradition of the Most High—\nMaster one dharma, and all dharmas are mastered.\nLay down even the slightest defilement,\nAnd the single nature naturally aligns with Heaven.\n\n**Topknot:**\nThe topknot was left behind by Zhongli,\nAtop Kunlun’s peak, the sun is placed.\nNo one disturbs it to wash at Changshan,\nAnd on the earth, the white ox roams freely.\n\n**Crown:**\nA pair of starry eyes survey front and back,\nAll dharmas gathered and stored within.\nInside and out, exquisitely wrought, no trace revealed—\nRadiant and solitary, the path is bright and clear.\n\n**Robes:**\nOnce fallen and careless, reckoning not the seasons,\nThe robe is vast and wide, enveloping heaven and earth.\nCut off from the red dust, the body remains unstained,\nNeither cold nor heat can intrude.\n\n**Four Towers:**\nSpring, summer, autumn, winter—arrayed in four robes,\nEncompassing the ten thousand images, who knows this?\nWine, sex, wealth, and anger—mundane affairs,\nAll four cast aside, all strife extinguished.\n\n**Bamboo Hat:**\nAlone it hangs atop Kunlun’s peak,\nA single round light illumines boundlessly.\nLet wind, rain, frost, and snow come as they may—\nThis single pagoda serves as an unyielding sky.\n\n**Sash:**\nHow many times does it circle in coming and going?\nThe wayward monkey and stubborn horse are tightly bound.\nA thousand strands, ten thousand threads—all laid down,\nAnd the wheel of birth and death loses its escape.\n\n**Pouch:**\nA cloth three feet square,\nWho knows the work of creation?\nWithin it transcends the Dharma-realm,\nEnveloping the Great Void.\n\n**Staff:**\nUpright, it stands between heaven and earth,\nHorizontally, it bears the sun, moon, mountains, and rivers.\nTurning the marrow of heaven and earth,\nIt moves the ten thousand images of the forest of phenomena.\n\n**Bowl:**\nOne bowl holds the rice of a thousand homes,\nA solitary body roams ten thousand miles.\nTo escape the path of birth and death,\nBegging sustains the passing seasons.\n\n**Shoes:**\nStep by step, following me without counting the years,\nComing and going, treading the old mountains and rivers.\nFrom now on, no more mud or water—\nLet them fly in pairs across the azure sky.\n\n**Coming and Going:**\nComing from the Great Dao,\nGoing by the original Dao.\nComing and going without clinging to dust,\nDwelling in purity and stillness.\n\n**Leaving Home to Cultivate the Dao:**\nOnce parted from the dust, this is leaving home,\nNon-action, non-creation—my livelihood.\nIf one asks for the secret of my cultivation,\nClouds scatter, the blue sky, the moon shines alone.\n\n**Daily Practice:**\nNurturing nature, forgetting emotions—this is daily practice,\nBegging door to door—this is my livelihood.\nComing and going freely, without hindrance,\nThe clear wind and bright moon are my neighbors.\n\n**Verse:**\nImmortals are what worldly people seek,\nBut who is willing to let all matters in the heart rest?\nIf you awaken to your own true nature and life,\nYou will roam with the clear wind and bright moon.\n\n**Two *Shuilong Yin* Poems:**\n\n**I**\nOriginally left the world to leave home,\nNo longer coveting worldly glory or profit.\nUnkempt hair, a soiled face,\nSitting alone all day, cultivating inner livelihood.\nIn an ancient temple’s niche,\nLet the red sun set in the west.\nFrom nothingness recognize being,\nKnow the white, guard the black,\nCeaselessly and silently regulating the breath.\n\nThe mind holds no entanglements,\nA pouch at the side, a staff in hand.\nStraw sandals broken, hempen cords frayed,\nBare legs, a sheep’s hide covering the body.\nAfter hunger, wandering door to door,\nWhen full, returning—singing *li lan luo li*.\nLet others laugh and call me\nA dull, lazy fellow—\nWho among them understands?\n\n**II**\nThe heart of one who studies the Dao is hard as iron,\nEntirely self-reliant, fiercely resolute.",
      "overlap_context": " \"the place beyond heaven and earth’s reckoning, where even ghosts and spirits do not know\"?\n**Answer:** What else could it be?\n\n**Fourteenth Question:** What does it mean for the twelve hours to seem like one?\n**Answer:** Not only should the twelve hours seem like one, but even if it were a thousand or ten thousand days, the slightest deviation from this unity would already be premature extinction.\n\n*Eighteen Questions and Answers on Miscellaneous Treasures of the Daoist Gate*\n*Quanzhen School*",
      "start_char": 3122,
      "end_char": 4068,
      "start_sentence": 159,
      "end_sentence": 231,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.95274043083191,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\晋真人语录.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "顿开利锁，名缰割断，爱情尽舍。 万事无挂，惹也不住，茅庵草舍。 向市鏖中居止，端然守道，凭此用，过时月。 作个贫穷道者，任粗食、不顾寒热。 髦头垢面，终朝独坐，内修活业。 得遇明 师诀，世人道、风狂来也。 有些深远，幽微时节，教七歌，怎生说。 颂曰 独上高山望八都，黑云散尽月轮孤。 茫茫宇宙人无数，那个男儿是丈夫。 解红 洞天深处。 道非远，咫尺人难悟。 浮沉内景，须凭匠手功夫。 专候晓来，一点阳生通玄路。 尽藏在碧波，深深处，任事主。 地雷响，震动山头雨。 渐浇灌黄芽乍离土。 婴儿采得携篮去。 向真霞六阳，鼎内烹煮。 搬运转，东西与南北。 铺八卦，九宫要知宗祖。 十干数内，分左右，要显龙虎。 玄武后随朱雀，当先祥云布。 曲江上，万神都来聚夫与。 归癸母，跨赤龙，归洞府。 要寻觅丁公问凭居，阴阳会合三千数。 指天地海山，同寿坚固。 诗曰 黄河水转吕氏家，一壶天地老烟霞。 无情白鹿调朱凤，有个乌龟缠赤蛇。 六月山头飞白雪，三冬水底长黄芽。 这些道理人还会，陆地神仙乱似麻。 绿头鸭 话中常。 悟南柯一梦黄根。 破繁华、云龛布素，认宗派、返照回光。 凭慧剑、劈开爱网，横华杖、击碎尘寰。 那里相逢，峨眉时任，韬光速奔华山忙。 林泉隐、南辰於北斗，日月袖中藏。 朱颜久，天崩地塌，真性如常。 舞袍袖、乾坤恨窄，但展手、天地平量。 醉陶陶、囊盛四海，笑忻忻、腹饮三钟。 几度瑶池，龙华会上，诸仙珍席，醉倒霞觞。 玉皇御宴，无我不成班行。 重阳会，金莲七朵，齐放神光。 颂曰 净皎皎圆明皓月，明朗朗水磨孤圆。 绿湛湛碧潭现影，韵悠悠物外天仙。 滴溜溜拈出无有，活泼泼放下周全。 转洒洒水晶盘中，赤洒洒一片青天。 颂曰 玉京山上一池水，四面八方不得底。 若还认得把舟人，自然运入天宫裹。 晋真人语录竟",
      "translated_text": "**Breaking Free**\n\nShattering the shackles of profit, severing the bonds of fame,\nAll loves and passions wholly cast aside.\nNothing left to cling to—\nNo entanglements, no lingering ties—\nDwelling in a thatched hut of reeds.\nEven amid the bustling marketplace,\nUpright and steadfast in guarding the Dao,\nRelying on this practice to pass the days and months.\nAs a poor Daoist mendicant,\nContent with coarse fare, heedless of cold or heat.\n\nUnkempt hair, a soiled face,\nSitting alone all day, cultivating inner work.\nHaving met a radiant teacher’s instructions,\nThe world calls him mad, a wind-driven fool.\nYet there are profound and subtle moments—\nHow to speak of the seven songs’ mysteries?\n\n**Eulogy:**\nAlone I ascend the high mountain, gazing toward the eight directions,\nBlack clouds disperse, leaving the moon solitary.\nIn this boundless cosmos, countless are the people—\nWhich man among them is a true husband?\n\nWithin the depths of the Crimson Cavern Grotto,\nThe Dao is not distant—yet people, though near, fail to awaken.\nThe floating and sinking of inner landscapes\nRequire the master’s craftsmanship.\nAwaiting dawn’s arrival,\nA single yang stirs, opening the path to the mysterious.\nAll is concealed within the azure waves,\nIn their profound depths, the master of affairs.\nThe earth’s thunder resounds,\nShaking the mountaintop with rain.\nGradually it nourishes the yellow sprout, newly risen from the soil.\nThe infant is gathered and carried away in a basket,\nToward the true radiance of the six yangs,\nSimmered within the crucible.\nCirculating and turning,\nEast and west, south and north.\nLaying out the eight trigrams,\nThe nine palaces must know their ancestral source.\nWithin the reckoning of the ten celestial stems,\nDivided left and right,\nThe dragon and tiger must be made manifest.\nThe Dark Warrior follows the Vermilion Bird,\nAuspicious clouds spread forth in the vanguard.\nAt the Winding River’s edge,\nAll spirits gather to meet the master.\nReturning to the mother of *gui*,\nRiding the crimson dragon back to the grotto.\nSeek out Master Ding to inquire of his abode,\nWhere yin and yang unite in three thousand measures.\nPointing to heaven and earth, seas and mountains,\nAll endure as one, firm and unyielding.\n\n**Poem:**\nThe Yellow River’s waters turn at the Lü family’s home,\nA single gourd holds heaven and earth, aged in mist and haze.\nThe heartless white deer tames the vermilion phoenix,\nA black tortoise coils around the crimson serpent.\nIn the sixth month, white snow flies on the mountain’s peak,\nIn the third winter, the yellow sprout grows beneath the waters.\nIf one grasps these principles,\nImmortals on earth swarm like hemp.\n\n**Green-Headed Duck**\nIn speech, ever constant—\nAwakening from the southern branch’s dream of yellow roots.\nShattering the splendor of the world,\nIn a cloud niche clad in plain cloth,\nRecognizing one’s lineage,\nTurning the light inward to reflect.\nWielding the sword of wisdom to sever the net of love,\nBrandishing the staff of transcendence to shatter the dusty realm.\nWherever we meet,\nAt Mount Emei, at will,\nSwiftly concealing our brilliance, we hasten to Mount Hua.\nHidden in forests and springs,\nSouth Star and Northern Dipper,\nSun and moon concealed within the sleeve.\nThe crimson countenance endures,\nThough heaven collapses and earth crumbles,\nThe true nature remains unchanged.\nDancing in the sleeves of the robe,\nThe cosmos seems too narrow—\nYet with a sweep of the hand,\nHeaven and earth are measured as level ground.\nDrunken and carefree,\nA sack holds the four seas,\nLaughing and joyful,\nThe belly drinks three cups.\nSeveral times at the Jasper Pool,\nAt the Dragon Flower Assembly,\nAmong the immortals’ precious feast,\nInebriated by the rosy goblet.\nAt the Jade Emperor’s imperial banquet,\nThe gathering is incomplete without me.\nAt the Double Yang Festival,\nSeven golden lotuses bloom,\nRadiating divine light.\n\n**Eulogy:**\nPure and luminous, the bright and solitary moon,\nClear and resplendent, polished like a water-ground mirror.\nDeep and verdant, the jade-green pool reflects its image,\nMelodious and serene, a celestial immortal beyond the world.\nDripping and round, plucked from nothingness,\nVivid and free, set down in perfection.\nSpinning and sparkling in the crystal dish,\nA crimson glow—\nA single expanse of blue heaven.\n\n**Eulogy:**\nAtop the Jade Capital Mountain, a pool of water,\nIts depths unreachable from any of the four sides or eight directions.\nIf one recognizes the boatman,\nNaturally, one sails into the celestial palace.\n\n*Record of the Perfected Master Jin* concludes.",
      "overlap_context": "he white, guard the black,\nCeaselessly and silently regulating the breath.\n\nThe mind holds no entanglements,\nA pouch at the side, a staff in hand.\nStraw sandals broken, hempen cords frayed,\nBare legs, a sheep’s hide covering the body.\nAfter hunger, wandering door to door,\nWhen full, returning—singing *li lan luo li*.\nLet others laugh and call me\nA dull, lazy fellow—\nWho among them understands?\n\n**II**\nThe heart of one who studies the Dao is hard as iron,\nEntirely self-reliant, fiercely resolute.",
      "start_char": 4068,
      "end_char": 4806,
      "start_sentence": 232,
      "end_sentence": 287,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.868650674819946,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\晋真人语录.txt",
        "category": "正统道藏太玄部"
      }
    }
  ]
}