{
  "source_id": "服气精义论",
  "source_file": "chunked_daozang\\服气精义论.json",
  "total_chunks": 4,
  "total_original_chars": 4592,
  "total_translated_chars": 22027,
  "total_translation_time": 102.42995738983154,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\方法类\\服气精义论.txt",
    "category": "方法类"
  },
  "full_translation": "**The Essentials of Qi Absorption**\n\n*Scripture Title:* *The Essentials of Qi Absorption*\n*Author:* Sima Chengzhen of the Tang Dynasty\n*Volume:* One\n*Source:* *Daoist Canon of the Zhengtong Era*, *Dongshen Section*, Methods Category\n*Collated Edition:* *Seven Lots from the Cloudy Satchel*, included in Volume 57\n\n---\n\n**The Essentials of Qi Absorption**\n*Recorded by the White Cloud Master of Tiantai*\n\nQi is the subtle and minute manifestation of the Dao. When the subtle stirs and the minute is activated, the One arises—thus the Primordial Unity is complete within the Supreme Simplicity.\n\nThe One is the tranquil and congealed essence of the Dao. When tranquility transforms and congealment creates, the Two emerge—thus Heaven and Earth divide within the Supreme Ultimate. Thereby, form and body are established; the myriad things share in their endowment, and spirit becomes manifest. All phenomena receive this in equal measure. Among the forms of things, only humans are upright; among the essences of phenomena, only humans are numinous. They unite Heaven and Earth, occupying the position of the Three Powers; they harmonize yin and yang, embodying the finest of the Five Phases. Thus, they can communicate with the mysterious and descend the sagely, refine their substance to ascend as immortals, conceal their radiance to enter the void, and attain the wondrous through the mind of non-being—this is the method of immortal ascension.\n\nThe methods of immortal ascension are manifold, yet the subtlest principle converges in one path. Some refine elixirs and consume potions, their efficacy ascending and soaring; others observe precepts and cultivate inwardly, their merit perfected in transcendence. However, mineral medicines are costly and difficult to obtain, while the labor of practice spans years and easily strays. If one seeks swift efficacy and dedicated accomplishment, aligning with the Dao through emptiness and harmonizing virtue with the divine, none surpasses the wondrousness of qi!\n\nThe Yellow Emperor said: \"Those who eat grain are clever but short-lived; those who consume qi are spiritually attuned and long-lived; those who eat nothing do not die.\" The Perfected One said: \"What endures in the Dao is nurturing life; what allows one to wander eternally is absorbing qi. When qi is whole, life persists, and only then can one cultivate the will. Cultivating the will aligns with the real, and only then can one dwell long in the realm of vital qi. How can one not diligently pursue this?\"\n\nThus, one draws in the morning mist and rinses with the frost’s essence, nourishing the radiance of the five viscera and guiding the constructive and defensive qi through the hundred\n\nThe north direction is black in color, entering and connecting with the kidneys, opening at the two yin orifices, and manifesting in the body as bones.\n\nMoreover, the lungs serve as the first floral canopy among the five viscera. The lungs reside above the heart, facing the chest, with six lobes, their color like white silk suffused with red. The lung channel emerges from the Shaoyang. It begins at the inner side of the tip of the thumb, approximately two *fen* from the corner of the nail, in the depression there.\n\nThe heart lies below the lungs and above the liver, opposite the point one *cun* below the xiphoid process. Its color is like white silk suffused with crimson. The heart channel emerges from the *Zhongchong* point, located at the tip of the middle finger, approximately two *fen* from the corner of the nail, in the depression there.\n\nThe liver is situated slightly behind and below the heart. It has four lobes on the right and three on the left, its color like white silk suffused with dark red. The liver channel emerges from the *Dadun* point, at the tip of the big toe, in the midst of the three hairs.\n\nThe spleen directly covers the area above the navel, lying transversely over the stomach in front. Its color is like white silk suffused with purple. The spleen channel emerges from the *Yinbai* point, at the side of the tip of the big toe, the width of a leek leaf from the corner of the nail.\n\nThe left and right kidneys face the front opposite the navel, broadly attached to the lumbar spine. Their color is like white silk suffused with purple. The left is the true kidney, corresponding to the five viscera. The right is the *Mingmen* (Gate of Life), where men store essence and women bind the womb. The kidney channel emerges at the *Yongquan* point, in the depression at the center of the sole of the foot.\n\nFor those who ingest the qi of the Five Sprouts, it is fitting to visualize the qi entering their respective viscera, ensuring the fluids flow smoothly, each according to its governance. This not only allows the qi to circulate throughout the body but also enables the treatment of illnesses.\n\nWhen ingesting the green sprout, visualize the qi entering the liver, seeing the green qi billowing and the green fluid merging distinctly. After a while, perceive the qi at the *Dadun* point of the foot. With continued practice, the qi will ascend, converging within the channels, dispersing through all the vessels, and rising to connect with the eyes.\n\nWhen ingesting the qi of the other directions, it is still advisable to bathe, rinse the mouth, don proper attire, and enter a separate chamber after the hour of *chou* (1–3 a.m.). There, burn incense, sit facing the respective direction, calm the mind, and focus the intention to proceed.\n\n**On Ingesting Qi**\n\nQi is the origin of the embryo and the root of form. Once the embryo is born, the original essence scatters; once the form moves, its fundamental substance gradually deteriorates. Therefore, one must draw in qi to congeal essence and preserve qi to refine the form. When essence is full, spirit is whole; when the form is at rest, life is prolonged. When the original root is replete, one can firmly endure.\n\nObserve all things: there is nothing that has qi yet lacks form, nor anything that has form yet lacks qi. O seeker of life preservation, how can you not focus on qi to attain suppleness?\n\nThe **Taiqing Qi-Conducting Talisman** is to be written facing the king and swallowed when intending to ingest qi and abstain from grains. Swallow one talisman every seven days, ceasing after twenty-one days. Prepare three talismans in total, burning incense on both sides.\n\nBefore ingesting qi, one should first treat any bodily ailments, ensuring the viscera and bowels are unobstructed and the limbs are at ease. Even without prior illnesses, one must take medicine to eliminate phlegm and fluids. Assess the body’s cold and heat, take one or two doses to purge and cleanse the intestines and stomach, removing accumulated stagnation. The formulas for vomiting and purging follow later. After convalescing and recovering, then observe a hundred-day purification, cultivating purity of conduct. During this period, gradually reduce sour and salty flavors, strictly avoiding rich tastes. It is best to take *fuling* (poria), steamed and dried sesame, and other medicines to prepare for grain abstention.\n\nAt the beginning of ingesting qi, do not abruptly cease all medicines and foods. Instead, daily reduce medicines and foods while gradually increasing qi and fluids. Once the qi’s flow is smooth and the body and viscera are stable, one may then cease all medicines and foods. Still, one should continue with ointments and supplements, avoiding hard, astringent, stagnating, cold, or slippery foods.\n\nIn winter, when the intestines and stomach feel entirely empty, without hunger or thirst, adjust the regimen as one sees fit—this cannot be fully described here.\n\nIt is advisable to begin during the spring or autumn, between the third and eighth day of the lunar month. Choose an auspicious day to start, first ingesting the **Taiqing Qi-Conducting Talisman**. By the appointed day, swallow three talismans, then enter a secluded chamber. The eastern side of the chamber should not be obstructed, and it is best if the morning light shines directly. Open a window on the eastern wall so that the midday sunlight shines directly onto the face.\n\nAfter midnight (*zi* hour, 11 p.m.–1 a.m.), first untie the hair and comb it several hundred times, then let it hang loose behind. This is necessary at the beginning; later, it is no longer required to leave the hair loose.\n\nBurn incense, but do not use frankincense. Sit facing east, calm the mind, focus the thoughts, and perform the knocking of teeth and guiding exercises. The method is detailed in the following section.\n\nThen, sit quietly and regulate the breath before lying down with the head to the west. The original text states to lie with the head to the east, but facing west is more convenient for visualization and absorption. The bedding should be thick and warm, adjusted to a comfortable temperature, slightly warm being best. The lower back and feet should be especially warm. The pillow should be low, level with the back, so that the head and neck align straight with the body.\n\nLoosen the clothing and belt, allowing space. Extend the hands about three *cun* from the body, make fists, and spread the feet about five or six *cun* apart. Slowly exhale to regulate the breath.\n\nThen visualize the qi of the rising sun in the east, merging with the sunlight into a cinnabar-purple radiance. Draw this light to the front of the face. First, pinch the hairs in the nostrils with the thumb and index finger, then press and move the nose up and down on both sides ten times to ensure smoothness. Gently inhale and swallow.\n\nWith prolonged practice, one need not consciously inhale; simply visualize the qi and swallow, and the qi will enter naturally—this is the subtlety. After swallowing three times, the qi enters the lungs. Part the lips slightly and exhale slowly.\n\nEach person’s breath has its own rhythm; adjust naturally. Do not forcefully draw the breath to its extreme, as this will cause qi to rush and lead to harm.\n\nAfter three inhalations and swallows, if the breath is long, increase to five or six, or even seven, which is especially good.\n\nWhen this practice brings a sensation of the lungs expanding and filling to their fullest, cease swallowing and hold the breath, visualizing the qi within the lungs. Let it flow with the shoulders into the arms, reaching the hands; clasp the hands and hold the visualization as the qi descends into the stomach, then to the kidneys, and follows the viscera down to the soles of the feet—until the skin and flesh tingle as if traversed by insects. Once this is complete, allow a gentle panting, then wait briefly until the breath settles. Resume the method of drawing and swallowing, guiding the qi until the hands and feet feel warm, harmonious, and unobstructed.\n\nMost qi-absorption methods direct the qi straight into the abdomen without first circulating it through the limbs, which can cause coldness in the extremities and stagnation in the five viscera. Thus, one must first guide the qi into the four limbs before allowing it to enter the abdomen, so that it flows naturally and spreads freely. After this, there is no need to retain the qi in the lungs; simply draw it directly into the large and small intestines, swirling and circulating it until it reaches below the navel. Continue until the intestines feel full, then stop.\n\nNext, press the knees firmly together, clench the fists tightly, and hold the breath to distend the abdomen nine times. During each distension, visualize the qi dispersing throughout the body. When the urge to exhale becomes intense, release the breath slowly. Take care not to strain or force the breath; instead, exhale gradually in measured intervals. If the abdomen feels slightly expanded, cease at once. If it remains tense and full, hold the breath and distend it again. Once finished, stretch the legs and rub the face with the hands, then stroke downward from the chest, repeating this several dozen times. Also, massage the abdomen around the navel several dozen times. Extend the toes upward, arch the back several times, then relax the hands and limbs, forgetting the mind and relinquishing the form. After a long while, wait until the breath and joints settle into harmony. Then rise. If perspiration appears, dust the head, face, and neck with powder, sit upright, and gently move the joints until the body feels at ease and normal before standing.\n\nIn this practice, one may adapt flexibly to circumstances, applying various methods as needed. Since it is impossible to enumerate every detail, one should skillfully adjust with intention. Why must the qi first pause in the lungs, enter the stomach, and reach the kidneys? The lungs are the root of qi. All qi belongs to the lungs, and the qi of heaven communicates with them. Moreover, the lungs govern the viscera, serving as their canopy, the source of breath, and the regulator of transmission and governance. The *po* gate acts as the messenger of the five viscera and the master of the four, connecting to the twelve meridians in an endless cycle—hence its role as the messenger of the five viscera. Thus, the qi must first pause in the lungs before flowing onward.\n\nThe stomach is the sea of the five viscera and six bowels, where all water and grain enter. It is the great master of the six bowels, and the five viscera and six bowels all depend on it. The five flavors enter the stomach and each returns to its respective organ to nourish the five qi. Therefore, the qi of the five viscera and six bowels all originate from the stomach and manifest in the *qi* mouth. The kidneys are the source of generative qi, the root of the five viscera and six bowels, and the foundation of the twelve meridians. The left is the true kidney, and the right is the *mingmen*. Thus, guiding the qi to the kidneys replenishes their essence and fluids.\n\nHeaven nourishes humans with the five qi, and earth nourishes them with the five flavors. The five qi enter through the nose and are stored in the heart and lungs, while the five flavors enter through the mouth and are stored in the intestines and stomach. Once the flavors are stored, they harmonize with the five qi to generate life. When fluids and qi interact, spirit arises naturally. The five flavors are not solely derived from grains, for the five qi themselves contain their own flavors. When supplemented with medicinal herbs—whose five flavors surpass those of grains—this becomes even more potent. Though this discussion focuses on the lungs and kidneys, the qi naturally circulates through all the viscera. Thus it is said: exhalation issues from the heart and lungs, inhalation draws in the kidneys and liver, and between exhalation and inhalation, the spleen receives its nourishment. This is the principle of breath and the essence of spirit and qi.\n\nThe *Most High* once asked: \"Upon what does human life depend?\" Someone replied: \"Upon the space between exhalation and inhalation.\" The *Most High* said: \"Excellent! This may truly be called the Dao.\"\n\nIn all qi-absorption practices, one should select the period from the hour of *chou* (1–3 a.m.) to before noon. From the cock’s crow to dawn is the *yin* of Heaven, the *yang* within *yin*; from dawn to midday is the *yang* of Heaven, the *yang* within *yang*; from midday to dusk is the *yang* of Heaven, the *yin* within *yang*; from dusk to the cock’s crow is the *yin* of Heaven, the *yin* within *yin*. The human body follows the same pattern.\n\nMoreover, in spring, *qi* flows through the channels and collaterals; in summer, it flows through the muscles; in autumn, it flows through the skin; and in winter, it flows through the bones and marrow.\n\nIn the first and second months, Heaven’s *qi* is aligned, Earth’s *qi* begins to rise, and the human *qi* resides in the liver. In the third and fourth months, Heaven’s *qi* is aligned, Earth’s *qi* is fully risen, and the human *qi* resides in the spleen. In the fifth and sixth months, Heaven’s *qi* is abundant, Earth’s *qi* is high, and the human *qi* resides in the head. In the seventh and eighth months, *yin* *qi* begins to wane, and the human *qi* resides in the lungs. In the ninth and tenth months, *yin* *qi* begins to freeze, Earth’s *qi* begins to close, and the human *qi* resides in the heart. In the eleventh and twelfth months, the *qi* of ice returns, Earth’s *qi* converges, and the human *qi* resides in the kidneys.\n\nFor each season’s months, one should follow the *qi*’s flow and harmonize with it. In all qi-absorption practices, the best time is when the sky is clear and bright. If it is windy, rainy, overcast, or foggy, one must not inhale external *qi*; instead, enter a secluded chamber, close the doors, and absorb *qi*, supplementing with various medicinal herbs.\n\nFor those who practice qi-absorption and abstain from grains: after ten days, essence and *qi* weaken, and the complexion becomes sallow. After twenty days, movement causes dizziness, limbs ache, bowel movements are difficult, urine is dark yellow, and sometimes there is diarrhea with hard stool followed by loose stool. After thirty days, the body becomes emaciated, and walking feels heavy and labored. The preceding signs of weakness are caused by the initial practice of concentrating *qi*; if medicinal herbs are used, these symptoms will not occur.\n\nAfter forty days, the complexion gradually brightens, and the mind and spirit are at peace. After fifty days, the five viscera harmonize, and essence and *qi* are internally nourished. After sixty days, the body returns to its former state, and the joints move smoothly. After seventy days, the mind dislikes noise and disturbance, and aspirations soar. After eighty days, one becomes serene and tranquil, and faith in the method grows clearer. After ninety days, one’s complexion becomes lustrous, and the voice becomes strong and resonant. After a hundred days, all the proper and black *qi* arrive, and the effects reach their peak. If practice continues without cease, lifespan will be extended.\n\nAfter three years, scars disappear, and the complexion gains radiance. After six years, the marrow fills, the intestines transform into sinews, and one can foresee life and death. After nine years, one can command ghosts and spirits, jade maidens attend by one’s side, the brain is full, the face is plump, and one cannot be harmed—this is called a *zhenren* (Perfected Person).\n\n**Method of Absorbing the Six *Wu* Qi**\nAt dawn, begin with the *jiazi* ten-day cycle, face the direction of *chen* (SE), touch the tongue to the upper and lower teeth, gather saliva, swirl it three times, and swallow once. Then face *yin* (NE), then *zi* (N), then *xu* (NW), then *shen* (W), and finally *wu* (S).\n\nAnother method: on the *jiazi* day, complete a ten-day cycle, always facing *wuchen* (SE) to swallow *qi*. On the *jiaxu* day, face *wuyin* (NE), and proceed similarly for the remaining cycles. This is the method of the six *wu*, a school’s teaching, as *wu* *qi* enters the spleen, which is the foundation of food and nourishment. This method alone can prevent hunger; if one seeks to benefit the entire body, it is not as effective as other methods.\n\n**Method of Absorbing the Three, Five, Seven, and Nine Qi**\nSlowly inhale *qi* through the nose, drawing in three breaths, then exhale dead *qi* once through the mouth. With prolonged practice, one can absorb three *qi*. Next, inhale five *qi* and exhale dead *qi* once; with prolonged practice, one can absorb five *qi*. Then inhale seven *qi* and exhale dead *qi* once; with prolonged practice, one can absorb seven *qi*. Then inhale nine *qi* and exhale dead *qi* once; with prolonged practice, one can absorb nine *qi*. Then combine the three, five, seven, and nine, inhaling twenty-four *qi* through the nose and exhaling dead *qi* once through the mouth; with prolonged practice, one can absorb twenty-four *qi*.\n\nThe method of reversing the count: begin from nine and descend to three, then ascend again, swallowing *qi* eighty-one times and exhaling once as a cycle. This method is most effective when the inhaled *qi* is abundant and the exhaled *qi* is minimal. If one does not follow this numerical limit and gradually increases the intake, it will deviate from the standard count.\n\n*Dead qi* refers to the *qi* of the four seasons and five phases that are in decline or exhaustion. Visualize and exhale it; the rest of the procedure follows the usual method.\n\n**Method of Nourishing the Five Viscera with the Five Phases’ Qi**\nOn the six *bing* days, at the hour of *si* (9–11 a.m.), ingest *qi* 120 times to assist the heart, enabling the heart to overcome the lungs and preventing the lungs from harming the liver—this is the principle of nourishing the liver.\n\nOn the six *wu* days, at the hour of *wei* (1–3 p.m.), ingest *qi* 120 times to assist the spleen, enabling the spleen to overcome the kidneys and preventing harm to the heart.\n\nIn late summer, on the six *geng* days, at the hour of *shen* (3–5 p.m.), ingest *qi* 120 times to assist the lungs, enabling the lungs to overcome the liver and preventing harm to the spleen.\n\nIn autumn, on the six *ren* days, at the hour of *hai* (9–11 p.m.), ingest *qi* 120 times to assist the kidneys, enabling the kidneys to overcome the heart and preventing harm to the lungs.\n\nIn winter, on the six *jia* days, at the hour of *yin* (3–5 a.m.), ingest *qi* 120 times to assist the liver, enabling the liver to overcome the spleen and preventing harm to the kidneys.\n\nThis method is the essential teaching of ingesting *qi* according to the five phases. Each season has nine such occasions, totaling 1,080 ingestions of *qi*, each nourishing its corresponding viscus. Cycle through them repeatedly without mutual overcoming, and practice with focused intention. This is the school’s teaching. The details regarding the five viscera are fully explained in the *Treatise on the Five Teeth*.\n\n*Discourse on the Essential Principles of Qi-Absorption* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "服气精义论 经名：服气鲭义论。 唐·司马承祯撰。 一卷。 底本出处：《正统道藏》洞神部方法类。 参校版本：《云笈七签》，收入该书卷五十七。 服气精义论 天台白云子述 夫气者，道之几微也。 几而动之，微而用之，乃生一焉，故混元全乎太易。 夫一者，道之冲凝也。 冲而化之，凝而造之，乃生二焉。 故天地分乎太极，是以形体立焉； 万物与之同禀，精神着焉； 万象与之齐受。 在物之形，唯人为贞； 在象之精，唯人为灵。 并乾坤，居三才之位，合阴阳，当五行之秀。 故能通玄降圣，练质登仙，隐景入虚，无之心至妙，入登仙之法。 登仙之法，所学多途，至妙之旨，其归一揆。 或飞消丹液，药效升腾，或斋戒存修，功成羽化。 然金石之药，实虚费而难求，习学之功，弥岁年而易远。 若乃为之速效，专之克成，虚无合其道，与神灵合其德者，其唯气妙乎！ 黄帝曰：食谷者智而夭，食气者神而寿，不食者不死。 真人曰：夫可久於其道者，养生也； 常可与久游者，纳气也。 气全则生存，然后能养志； 养志则合真，然后能久登生气之域。 可不勤之哉！ 是知吸引晨霞，餐漱风霜，养精光於五藏，导营卫於百关，既桔疾以安形，复延和而享寿。 闭视听以胎息，返衰朽於童颜，远取於天，近取於己。 心闲自适，体逸无为欣。 邈矣！ 於百年全浩然於一室，就轻举之诸卫，真清虚之雅致欤！ 若兼修真之业炼化之功，则伫云辖而促期，驰羽驾而增远矣。 服气之经，颇览多本，或散在诸部，或未畅其宗。 观之者以不广致疑，习之者以不究无效。 今故纂类篇目，详精源流，庶使蟪蛄之兼济，岂龟龙之独善耳。 五牙论 夫形之所全者，本於藏府也。 神之所安者，质於精气也。 虽禀形於五神，已具其象，而体衰气耗，乃致凋败。 故须纳云牙而溉液，吸霞景以孕灵。 荣卫保其贞和，容貌驻其朽谢，加以久习成妙，积感通神，与五老而齐升，并九真而列位。 经文所载，以示津途，修学所导，自宜详（核）。 服真五牙法 每以清日一密咒曰： 经文不言面向，当宜各向其方，平坐握固闭目，叩齿三通，而咒中央向四维。 束方青牙，服食青牙，饮以朝华。 祝讫，舌料上齿表，舐唇漱口，满而咽之三。 南方朱丹，服食朱丹，饮以丹池。 祝讫，舌料下齿表，舐唇漱口，满而咽之三。 中央戊己昂，昂，太山服食精气，饮以醴泉。 祝讫，舌料上玄膺，取玉水舐唇漱口，满而咽之三。 西方明石，服食明石，饮以灵液。 祝讫，舌料上齿内，舐唇漱口，满而咽之三。 北方玄滋，服食玄滋，饮以玉饴。 祝讫，舌料齿下内，舐唇漱口，满而咽之三。 都数已毕，纳气极而徐徐放之，令五过，以上真道毕矣。 意调诸方，亦宜纳气各依其数，即束方九，南方三，中央十二，西方七，北方五。 又先师益中央醴泉，祝曰： 白石岩岩次，行源涌洞，以玉浆饮之，长生寿命益长。 此是《灵宝五符经》中法，《上清经》中别有四极云牙之法。 其道密秘，不可轻言。 凡服气皆先行五牙以通五藏，然后依常法又佳。 束方青色，入通於肝，开窍於目，在形为脉。 南方赤色，入通於心，开窍於舌，在形为血。 中央黄色，入通於脾，开窍於口，在形为肉。 西方白色，入通於肺，开窍於鼻，在形为皮。",
      "translated_text": "**The Essentials of Qi Absorption**\n\n*Scripture Title:* *The Essentials of Qi Absorption*\n*Author:* Sima Chengzhen of the Tang Dynasty\n*Volume:* One\n*Source:* *Daoist Canon of the Zhengtong Era*, *Dongshen Section*, Methods Category\n*Collated Edition:* *Seven Lots from the Cloudy Satchel*, included in Volume 57\n\n---\n\n**The Essentials of Qi Absorption**\n*Recorded by the White Cloud Master of Tiantai*\n\nQi is the subtle and minute manifestation of the Dao. When the subtle stirs and the minute is activated, the One arises—thus the Primordial Unity is complete within the Supreme Simplicity.\n\nThe One is the tranquil and congealed essence of the Dao. When tranquility transforms and congealment creates, the Two emerge—thus Heaven and Earth divide within the Supreme Ultimate. Thereby, form and body are established; the myriad things share in their endowment, and spirit becomes manifest. All phenomena receive this in equal measure. Among the forms of things, only humans are upright; among the essences of phenomena, only humans are numinous. They unite Heaven and Earth, occupying the position of the Three Powers; they harmonize yin and yang, embodying the finest of the Five Phases. Thus, they can communicate with the mysterious and descend the sagely, refine their substance to ascend as immortals, conceal their radiance to enter the void, and attain the wondrous through the mind of non-being—this is the method of immortal ascension.\n\nThe methods of immortal ascension are manifold, yet the subtlest principle converges in one path. Some refine elixirs and consume potions, their efficacy ascending and soaring; others observe precepts and cultivate inwardly, their merit perfected in transcendence. However, mineral medicines are costly and difficult to obtain, while the labor of practice spans years and easily strays. If one seeks swift efficacy and dedicated accomplishment, aligning with the Dao through emptiness and harmonizing virtue with the divine, none surpasses the wondrousness of qi!\n\nThe Yellow Emperor said: \"Those who eat grain are clever but short-lived; those who consume qi are spiritually attuned and long-lived; those who eat nothing do not die.\" The Perfected One said: \"What endures in the Dao is nurturing life; what allows one to wander eternally is absorbing qi. When qi is whole, life persists, and only then can one cultivate the will. Cultivating the will aligns with the real, and only then can one dwell long in the realm of vital qi. How can one not diligently pursue this?\"\n\nThus, one draws in the morning mist and rinses with the frost’s essence, nourishing the radiance of the five viscera and guiding the constructive and defensive qi through the hundred",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1267,
      "start_sentence": 0,
      "end_sentence": 68,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.717369079589844,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\服气精义论.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "北方黑色，入通於肾，开窍於二阴，在形为骨。 又肺为五城之华盖第一，肺居心上，对胸，有六叶，色如缟映红，肺脉出於少阳。 在手大指之端内侧，去爪甲二分许，陷者之中。 心居肺下肝上，对鸠尾下一寸。 色如缟映绛，心脉出於中冲。 在手中指之端，去爪甲二分许，陷者之中。 肝在心下小近后。 右四叶，左三叶，色如缟映钳，肝脉出於大敦。 在足大指端，乃三毛之中。 脾正掩脐上，近前横覆胃，色如缟映紫，脾脉出於隐白。 在足大指端侧，去爪甲角如韭叶。 左肾右肾前对脐，博着腰脊。 色如缟映紫，左为正肾，以配五藏。 右为命门，男以藏精，女以系胞。 肾脉出为涌泉。 在足心陷者之中。 凡服五牙之气者，皆宜思入其藏，使其液宣通，各依所主，既可以周流形体，亦可以攻疗疾病。 令服青牙者，思气入肝中，见青气氲氲，青液融融分明，良久乃见足大敦之气，修服而至，会於脉中，流散诸脉，上通於目然。 次服诸方，仍宜以丑后澡漱冠服，入别室焚香，坐向其方，静虑澄心，注想而为之。 服气论 夫气者，胎之元也，形之本也。 胎既诞矣，而元精已散，形既动矣，而本质渐弊。 是故须纳气以凝精，保气以炼形。 精满而神全，形休而命延。 元本充实，可以固存耳。 观夫万物，未有有气而无形者，未有有形而无气者。 摄生之子，可不专气而致柔乎！ 右太清行气符，欲服气断谷先书向王吞之。 七日吞一，三七日止。 合符三枚，皆烧香左右。 凡欲服气者，皆宜先疗身疹疾，使藏府宣通，肢体安和，纵无旧疹，亦须服药去痰饮。 量体玲热，服一两剂泻荡，以通泄肠胃，去其积滞。 吐泻方在后，将息平复，讫，乃清斋百日，敦洁操志，其间所食，渐去酸咸，喊绝滋味。 得服狭苓，蒸暴胡麻等药，预断谷尤佳。 服气之始，亦不得顿绝其药食，宜日日臧药食，渐渐加气液。 知气候流通，体藏安稳，乃可绝诸药食。 仍须兼膏饵，勿食坚涩、滓滞、玲滑之物。 冬自觉肠胃虚全，无复饥渴。 消息进退，皆以意自量，不可具於此述。 宜於春秋二时，月初三日后八日前，其取一吉日为始，先服太清行气符，计至其日，令吞三符讫，静密之室，室束得早朝景为佳。 於束壁开一窗，令日中光正对卧面。 此室之东二勿令他障隔。 以子时之后，先解发梳头数百下，便散发於后矣。 初服须如此，久后亦不项散发也。 烧香，勿用熏陆香也。 束向正坐，澄心定思，叩齿导引。 其法具后篇。 又安坐定息，乃西首而卧。 本经皆云东首，然面则向西，於存思吸引殊为不便。 林须厚暖，所覆适寒温自得，稍暖为佳。 腰脚已下尤宜暖，其枕宜令低下与背高下平，使头颈顺身平直。 解身中衣带，令阔，展两手，离身三寸，仍握固展两脚，相去五六寸。 且徐吐气息，令调。 然后想之，束方初曜之气，共日光合丹紫流晖，引此景而来至於面前，乃以鼻先扳鼻孔中毛，每初以两手大指下掌按鼻左右上下； 动之十数过，令通畅。 微引吸而咽之。 久久乃不须引吸，但存气而咽之，其气自入此便为妙。 咽之三，乃入肺中，小开唇，徐徐吐气。 人气有缓急，宜自任性调息，必不得顿引至极，则气厅厅，则致损。 又引咽之三，若气息长，加至五六，咽得七尤佳。",
      "translated_text": "The north direction is black in color, entering and connecting with the kidneys, opening at the two yin orifices, and manifesting in the body as bones.\n\nMoreover, the lungs serve as the first floral canopy among the five viscera. The lungs reside above the heart, facing the chest, with six lobes, their color like white silk suffused with red. The lung channel emerges from the Shaoyang. It begins at the inner side of the tip of the thumb, approximately two *fen* from the corner of the nail, in the depression there.\n\nThe heart lies below the lungs and above the liver, opposite the point one *cun* below the xiphoid process. Its color is like white silk suffused with crimson. The heart channel emerges from the *Zhongchong* point, located at the tip of the middle finger, approximately two *fen* from the corner of the nail, in the depression there.\n\nThe liver is situated slightly behind and below the heart. It has four lobes on the right and three on the left, its color like white silk suffused with dark red. The liver channel emerges from the *Dadun* point, at the tip of the big toe, in the midst of the three hairs.\n\nThe spleen directly covers the area above the navel, lying transversely over the stomach in front. Its color is like white silk suffused with purple. The spleen channel emerges from the *Yinbai* point, at the side of the tip of the big toe, the width of a leek leaf from the corner of the nail.\n\nThe left and right kidneys face the front opposite the navel, broadly attached to the lumbar spine. Their color is like white silk suffused with purple. The left is the true kidney, corresponding to the five viscera. The right is the *Mingmen* (Gate of Life), where men store essence and women bind the womb. The kidney channel emerges at the *Yongquan* point, in the depression at the center of the sole of the foot.\n\nFor those who ingest the qi of the Five Sprouts, it is fitting to visualize the qi entering their respective viscera, ensuring the fluids flow smoothly, each according to its governance. This not only allows the qi to circulate throughout the body but also enables the treatment of illnesses.\n\nWhen ingesting the green sprout, visualize the qi entering the liver, seeing the green qi billowing and the green fluid merging distinctly. After a while, perceive the qi at the *Dadun* point of the foot. With continued practice, the qi will ascend, converging within the channels, dispersing through all the vessels, and rising to connect with the eyes.\n\nWhen ingesting the qi of the other directions, it is still advisable to bathe, rinse the mouth, don proper attire, and enter a separate chamber after the hour of *chou* (1–3 a.m.). There, burn incense, sit facing the respective direction, calm the mind, and focus the intention to proceed.\n\n**On Ingesting Qi**\n\nQi is the origin of the embryo and the root of form. Once the embryo is born, the original essence scatters; once the form moves, its fundamental substance gradually deteriorates. Therefore, one must draw in qi to congeal essence and preserve qi to refine the form. When essence is full, spirit is whole; when the form is at rest, life is prolonged. When the original root is replete, one can firmly endure.\n\nObserve all things: there is nothing that has qi yet lacks form, nor anything that has form yet lacks qi. O seeker of life preservation, how can you not focus on qi to attain suppleness?\n\nThe **Taiqing Qi-Conducting Talisman** is to be written facing the king and swallowed when intending to ingest qi and abstain from grains. Swallow one talisman every seven days, ceasing after twenty-one days. Prepare three talismans in total, burning incense on both sides.\n\nBefore ingesting qi, one should first treat any bodily ailments, ensuring the viscera and bowels are unobstructed and the limbs are at ease. Even without prior illnesses, one must take medicine to eliminate phlegm and fluids. Assess the body’s cold and heat, take one or two doses to purge and cleanse the intestines and stomach, removing accumulated stagnation. The formulas for vomiting and purging follow later. After convalescing and recovering, then observe a hundred-day purification, cultivating purity of conduct. During this period, gradually reduce sour and salty flavors, strictly avoiding rich tastes. It is best to take *fuling* (poria), steamed and dried sesame, and other medicines to prepare for grain abstention.\n\nAt the beginning of ingesting qi, do not abruptly cease all medicines and foods. Instead, daily reduce medicines and foods while gradually increasing qi and fluids. Once the qi’s flow is smooth and the body and viscera are stable, one may then cease all medicines and foods. Still, one should continue with ointments and supplements, avoiding hard, astringent, stagnating, cold, or slippery foods.\n\nIn winter, when the intestines and stomach feel entirely empty, without hunger or thirst, adjust the regimen as one sees fit—this cannot be fully described here.\n\nIt is advisable to begin during the spring or autumn, between the third and eighth day of the lunar month. Choose an auspicious day to start, first ingesting the **Taiqing Qi-Conducting Talisman**. By the appointed day, swallow three talismans, then enter a secluded chamber. The eastern side of the chamber should not be obstructed, and it is best if the morning light shines directly. Open a window on the eastern wall so that the midday sunlight shines directly onto the face.\n\nAfter midnight (*zi* hour, 11 p.m.–1 a.m.), first untie the hair and comb it several hundred times, then let it hang loose behind. This is necessary at the beginning; later, it is no longer required to leave the hair loose.\n\nBurn incense, but do not use frankincense. Sit facing east, calm the mind, focus the thoughts, and perform the knocking of teeth and guiding exercises. The method is detailed in the following section.\n\nThen, sit quietly and regulate the breath before lying down with the head to the west. The original text states to lie with the head to the east, but facing west is more convenient for visualization and absorption. The bedding should be thick and warm, adjusted to a comfortable temperature, slightly warm being best. The lower back and feet should be especially warm. The pillow should be low, level with the back, so that the head and neck align straight with the body.\n\nLoosen the clothing and belt, allowing space. Extend the hands about three *cun* from the body, make fists, and spread the feet about five or six *cun* apart. Slowly exhale to regulate the breath.\n\nThen visualize the qi of the rising sun in the east, merging with the sunlight into a cinnabar-purple radiance. Draw this light to the front of the face. First, pinch the hairs in the nostrils with the thumb and index finger, then press and move the nose up and down on both sides ten times to ensure smoothness. Gently inhale and swallow.\n\nWith prolonged practice, one need not consciously inhale; simply visualize the qi and swallow, and the qi will enter naturally—this is the subtlety. After swallowing three times, the qi enters the lungs. Part the lips slightly and exhale slowly.\n\nEach person’s breath has its own rhythm; adjust naturally. Do not forcefully draw the breath to its extreme, as this will cause qi to rush and lead to harm.\n\nAfter three inhalations and swallows, if the breath is long, increase to five or six, or even seven, which is especially good.",
      "overlap_context": ": \"What endures in the Dao is nurturing life; what allows one to wander eternally is absorbing qi. When qi is whole, life persists, and only then can one cultivate the will. Cultivating the will aligns with the real, and only then can one dwell long in the realm of vital qi. How can one not diligently pursue this?\"\n\nThus, one draws in the morning mist and rinses with the frost’s essence, nourishing the radiance of the five viscera and guiding the constructive and defensive qi through the hundred",
      "start_char": 1267,
      "end_char": 2486,
      "start_sentence": 69,
      "end_sentence": 128,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.841994285583496,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\服气精义论.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "如此以觉肺开大满为度，且停咽，乃闭气，存肺中之气。 随两肩入臂至手，握中入存，下入於胃，至两肾中，随脏至两脚心中，觉皮肉问习习如虫行为度。 讫，任微喘息，少时待喘息调，依法引咽，导送之，觉手足温和调畅为度。 诸服气方，直存入腹，不先向四肢，故致四肢逆玲，五藏壅滞，是以必须先入四肢，然后入腹，其气自然流宣。 此后不复须存在肺，直引气入大肠小肠中，呜转通流脐下为度。 应如此，以肠中饱满乃止。 则坚两膝，急握固，闭气鼓腹九度，就鼓中仍存其气，散入诸体，闭欲极，徐徐吐之。 慎勿长苦气急，稍稍并计而吐之，若觉腹中阔些，极则止，如腹犹满急，更闭气鼓之，讫，舒脚以手摩面，将胸心而下，数十度，并摩腹绕脐手数十度，展脚趾向上，反偃数度，乃放手纵体，忘心遗形。 良久，待气息关节调平。 讫，乃起，若有汗，以粉摩拭头面颈项，平坐，稍动摇关节，体和如常，可起动。 其中随时消息，触类多方，既不云去烦述，善宜以意调适之。 凡服气所以必令停於肺上，入於胃，至於肾者何？ 肺藏，气之本也。 诸气属於肺，天气通於肺。 又肺者，藏之长也，为诸藏之华盖，呼吸之津源，为传送之官治节出焉。 又魄门为五藏使，为四藏之主，通於十二经脉。 周而复始，故为五藏使也。 故令气停於肺，而后流行焉。 胃者，五藏六府之海，水谷皆入於胃，六府之大主也； 五藏六府皆禀於胃，五味入胃，各赴其家，以养五气。 是以五藏六府之气，皆出於胃，变见於气口故也。 肾者，生气之源，五藏六府之本，十二经脉之根。 左为正肾，右为命门。 故令气致於肾，以益其精液。 天食人以五气，地食人以五味，五气入於鼻，藏於心肺，五味入於口，藏於肠胃。 味有所藏，以五气和而生。 津液气液相感，神乃自生。 五味岂独其谷，而五气中自有其味，又兼之以药，药之五味，尤胜其谷也。 此虽只论肺肾，其气亦自然流通诸藏，故曰呼出心与肺，吸入肾与肝，呼吸之问，脾受其味也。 呼吸之理及神气之要。 故太上问曰：人命在几关？ 或对曰：在呼吸之问。 太上曰：善哉！ 可谓为道矣。",
      "translated_text": "When this practice brings a sensation of the lungs expanding and filling to their fullest, cease swallowing and hold the breath, visualizing the qi within the lungs. Let it flow with the shoulders into the arms, reaching the hands; clasp the hands and hold the visualization as the qi descends into the stomach, then to the kidneys, and follows the viscera down to the soles of the feet—until the skin and flesh tingle as if traversed by insects. Once this is complete, allow a gentle panting, then wait briefly until the breath settles. Resume the method of drawing and swallowing, guiding the qi until the hands and feet feel warm, harmonious, and unobstructed.\n\nMost qi-absorption methods direct the qi straight into the abdomen without first circulating it through the limbs, which can cause coldness in the extremities and stagnation in the five viscera. Thus, one must first guide the qi into the four limbs before allowing it to enter the abdomen, so that it flows naturally and spreads freely. After this, there is no need to retain the qi in the lungs; simply draw it directly into the large and small intestines, swirling and circulating it until it reaches below the navel. Continue until the intestines feel full, then stop.\n\nNext, press the knees firmly together, clench the fists tightly, and hold the breath to distend the abdomen nine times. During each distension, visualize the qi dispersing throughout the body. When the urge to exhale becomes intense, release the breath slowly. Take care not to strain or force the breath; instead, exhale gradually in measured intervals. If the abdomen feels slightly expanded, cease at once. If it remains tense and full, hold the breath and distend it again. Once finished, stretch the legs and rub the face with the hands, then stroke downward from the chest, repeating this several dozen times. Also, massage the abdomen around the navel several dozen times. Extend the toes upward, arch the back several times, then relax the hands and limbs, forgetting the mind and relinquishing the form. After a long while, wait until the breath and joints settle into harmony. Then rise. If perspiration appears, dust the head, face, and neck with powder, sit upright, and gently move the joints until the body feels at ease and normal before standing.\n\nIn this practice, one may adapt flexibly to circumstances, applying various methods as needed. Since it is impossible to enumerate every detail, one should skillfully adjust with intention. Why must the qi first pause in the lungs, enter the stomach, and reach the kidneys? The lungs are the root of qi. All qi belongs to the lungs, and the qi of heaven communicates with them. Moreover, the lungs govern the viscera, serving as their canopy, the source of breath, and the regulator of transmission and governance. The *po* gate acts as the messenger of the five viscera and the master of the four, connecting to the twelve meridians in an endless cycle—hence its role as the messenger of the five viscera. Thus, the qi must first pause in the lungs before flowing onward.\n\nThe stomach is the sea of the five viscera and six bowels, where all water and grain enter. It is the great master of the six bowels, and the five viscera and six bowels all depend on it. The five flavors enter the stomach and each returns to its respective organ to nourish the five qi. Therefore, the qi of the five viscera and six bowels all originate from the stomach and manifest in the *qi* mouth. The kidneys are the source of generative qi, the root of the five viscera and six bowels, and the foundation of the twelve meridians. The left is the true kidney, and the right is the *mingmen*. Thus, guiding the qi to the kidneys replenishes their essence and fluids.\n\nHeaven nourishes humans with the five qi, and earth nourishes them with the five flavors. The five qi enter through the nose and are stored in the heart and lungs, while the five flavors enter through the mouth and are stored in the intestines and stomach. Once the flavors are stored, they harmonize with the five qi to generate life. When fluids and qi interact, spirit arises naturally. The five flavors are not solely derived from grains, for the five qi themselves contain their own flavors. When supplemented with medicinal herbs—whose five flavors surpass those of grains—this becomes even more potent. Though this discussion focuses on the lungs and kidneys, the qi naturally circulates through all the viscera. Thus it is said: exhalation issues from the heart and lungs, inhalation draws in the kidneys and liver, and between exhalation and inhalation, the spleen receives its nourishment. This is the principle of breath and the essence of spirit and qi.\n\nThe *Most High* once asked: \"Upon what does human life depend?\" Someone replied: \"Upon the space between exhalation and inhalation.\" The *Most High* said: \"Excellent! This may truly be called the Dao.\"",
      "overlap_context": "ed not consciously inhale; simply visualize the qi and swallow, and the qi will enter naturally—this is the subtlety. After swallowing three times, the qi enters the lungs. Part the lips slightly and exhale slowly.\n\nEach person’s breath has its own rhythm; adjust naturally. Do not forcefully draw the breath to its extreme, as this will cause qi to rush and lead to harm.\n\nAfter three inhalations and swallows, if the breath is long, increase to five or six, or even seven, which is especially good.",
      "start_char": 2486,
      "end_char": 3298,
      "start_sentence": 129,
      "end_sentence": 162,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.286177158355713,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\服气精义论.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "凡服气皆取丑后午前者，鹦呜至平旦，天之阴，阴中之阳也； 平旦至日中，天之阳，阳中阳也； 日中至黄昏，天之阳，阳中阴也，黄昏至鹦呜，天之阴，阴中之阴也。 人亦如是。 又春气行於经络，夏气行於肌肉，秋气行於皮肤，冬气行於骨髓。 又正月二月，天气正方，地气始发，人气在肝。 三月四月，天气正方，地气定发，人气在脾。 五月六月，天气盛，地气高，人气在头。 七月八月，阴气始煞，人气在肺。 九月十月，阴气始冰，地气始闭，人气在心。 十一月十二月，冰气复，地气合，人气在肾。 至四时之月，宜各依气之所行，兼存而为之。 凡服气，皆取天景明澄之时为佳，若当风雨晦雾之时，皆不可引吸外气，但入密室闭服纳气，加以诸药也。 凡服气断谷者，一旬之时，精气弱微，颜色萎黄。 二旬之时，动作暝眩，肢节酸疼，大便苦难，小便赤黄，或时下痢，前刚后搪。 三旬之时，身体消瘦，重难以行。 已前赢弱之候，是专气初服所致，若以诸药则不至於此也。 四旬之时，颜色渐悦，心志安康。 五旬之时，五藏调和，精气内养。 六旬之时，体复如故，机关调畅。 七旬之时，心恶喧烦，志愿高翔。 八旬之时，恬淡寂寞，信明术方。 九旬之时，荣华润泽，声音洪彰。 十旬之时，正黑皆至，其效极昌。 修之不止，年命延长。 三年之后，瘢痕灭除，颜色有光。 六年髓填，肠化为筋，预知存亡。 经历九年，役鬼使神，玉女侍傍，脑实脸胼，不可复伤，号曰真人也。 服六戊气法 气旦先从甲子旬，起向辰地，舌料上下齿，取津液，周旋三至而一咽，止。 次向寅，次向子，次向戌，次向申，次向午。 又法起甲子日，竟一旬，常向戊辰咽气，甲戌日则向戊寅余旬依此为之，此六戊法亦是一家之义，以戊气入於脾，为食禀之本固也。 此直不饥，若通益诸体，则不逮余法矣。 服三五七九气法 徐徐以鼻微引气，纳之三，以口一吐死气，久久便三气。 次后引五气，以口一吐死气，久久便五气。 次引七气，以口一吐死气，久久便七气。 次引九气，以口一吐死气，久久便九气。 因三五七九而并引之以鼻，二十四气纳之，以口一吐死气，久久便二十四气咽逆报之报之法，因从九数下到三，复顺引之咽可九九八十一咽气，而一吐之以为节也。 此法以入气多吐气少为妙。 若不作此限数，渐增入则阙於常数耳。 死气者，是四时五行休死之气，存而吐之，自余节度，仍依常法。 养五藏五行气法 春以六丙之日，时加巳，食气百二十助於心，令心胜肺，无令肺伤肝，此养肝之义也。 夏以六戊之日，时加未，食气百二十以助脾，令脾胜肾，不伤於心也。 季夏以六庚之日，时加申，食气百二十以助肺，令肺胜肝，不伤於脾也。 秋以六壬之日，时加亥，食气百二十以助肾，令肾胜心，不伤於肺也。 冬以六甲之日，时加寅，食气百二十以助肝，令肝胜脾，不伤於肾也。 右此法是五行食气之要，明时各有九。 凡一千八十食气，各以养藏，周而复始，不相克，精心为之。 此法是家之义。 所在五藏，事事具在五牙论中。 服气精义论竟",
      "translated_text": "In all qi-absorption practices, one should select the period from the hour of *chou* (1–3 a.m.) to before noon. From the cock’s crow to dawn is the *yin* of Heaven, the *yang* within *yin*; from dawn to midday is the *yang* of Heaven, the *yang* within *yang*; from midday to dusk is the *yang* of Heaven, the *yin* within *yang*; from dusk to the cock’s crow is the *yin* of Heaven, the *yin* within *yin*. The human body follows the same pattern.\n\nMoreover, in spring, *qi* flows through the channels and collaterals; in summer, it flows through the muscles; in autumn, it flows through the skin; and in winter, it flows through the bones and marrow.\n\nIn the first and second months, Heaven’s *qi* is aligned, Earth’s *qi* begins to rise, and the human *qi* resides in the liver. In the third and fourth months, Heaven’s *qi* is aligned, Earth’s *qi* is fully risen, and the human *qi* resides in the spleen. In the fifth and sixth months, Heaven’s *qi* is abundant, Earth’s *qi* is high, and the human *qi* resides in the head. In the seventh and eighth months, *yin* *qi* begins to wane, and the human *qi* resides in the lungs. In the ninth and tenth months, *yin* *qi* begins to freeze, Earth’s *qi* begins to close, and the human *qi* resides in the heart. In the eleventh and twelfth months, the *qi* of ice returns, Earth’s *qi* converges, and the human *qi* resides in the kidneys.\n\nFor each season’s months, one should follow the *qi*’s flow and harmonize with it. In all qi-absorption practices, the best time is when the sky is clear and bright. If it is windy, rainy, overcast, or foggy, one must not inhale external *qi*; instead, enter a secluded chamber, close the doors, and absorb *qi*, supplementing with various medicinal herbs.\n\nFor those who practice qi-absorption and abstain from grains: after ten days, essence and *qi* weaken, and the complexion becomes sallow. After twenty days, movement causes dizziness, limbs ache, bowel movements are difficult, urine is dark yellow, and sometimes there is diarrhea with hard stool followed by loose stool. After thirty days, the body becomes emaciated, and walking feels heavy and labored. The preceding signs of weakness are caused by the initial practice of concentrating *qi*; if medicinal herbs are used, these symptoms will not occur.\n\nAfter forty days, the complexion gradually brightens, and the mind and spirit are at peace. After fifty days, the five viscera harmonize, and essence and *qi* are internally nourished. After sixty days, the body returns to its former state, and the joints move smoothly. After seventy days, the mind dislikes noise and disturbance, and aspirations soar. After eighty days, one becomes serene and tranquil, and faith in the method grows clearer. After ninety days, one’s complexion becomes lustrous, and the voice becomes strong and resonant. After a hundred days, all the proper and black *qi* arrive, and the effects reach their peak. If practice continues without cease, lifespan will be extended.\n\nAfter three years, scars disappear, and the complexion gains radiance. After six years, the marrow fills, the intestines transform into sinews, and one can foresee life and death. After nine years, one can command ghosts and spirits, jade maidens attend by one’s side, the brain is full, the face is plump, and one cannot be harmed—this is called a *zhenren* (Perfected Person).\n\n**Method of Absorbing the Six *Wu* Qi**\nAt dawn, begin with the *jiazi* ten-day cycle, face the direction of *chen* (SE), touch the tongue to the upper and lower teeth, gather saliva, swirl it three times, and swallow once. Then face *yin* (NE), then *zi* (N), then *xu* (NW), then *shen* (W), and finally *wu* (S).\n\nAnother method: on the *jiazi* day, complete a ten-day cycle, always facing *wuchen* (SE) to swallow *qi*. On the *jiaxu* day, face *wuyin* (NE), and proceed similarly for the remaining cycles. This is the method of the six *wu*, a school’s teaching, as *wu* *qi* enters the spleen, which is the foundation of food and nourishment. This method alone can prevent hunger; if one seeks to benefit the entire body, it is not as effective as other methods.\n\n**Method of Absorbing the Three, Five, Seven, and Nine Qi**\nSlowly inhale *qi* through the nose, drawing in three breaths, then exhale dead *qi* once through the mouth. With prolonged practice, one can absorb three *qi*. Next, inhale five *qi* and exhale dead *qi* once; with prolonged practice, one can absorb five *qi*. Then inhale seven *qi* and exhale dead *qi* once; with prolonged practice, one can absorb seven *qi*. Then inhale nine *qi* and exhale dead *qi* once; with prolonged practice, one can absorb nine *qi*. Then combine the three, five, seven, and nine, inhaling twenty-four *qi* through the nose and exhaling dead *qi* once through the mouth; with prolonged practice, one can absorb twenty-four *qi*.\n\nThe method of reversing the count: begin from nine and descend to three, then ascend again, swallowing *qi* eighty-one times and exhaling once as a cycle. This method is most effective when the inhaled *qi* is abundant and the exhaled *qi* is minimal. If one does not follow this numerical limit and gradually increases the intake, it will deviate from the standard count.\n\n*Dead qi* refers to the *qi* of the four seasons and five phases that are in decline or exhaustion. Visualize and exhale it; the rest of the procedure follows the usual method.\n\n**Method of Nourishing the Five Viscera with the Five Phases’ Qi**\nOn the six *bing* days, at the hour of *si* (9–11 a.m.), ingest *qi* 120 times to assist the heart, enabling the heart to overcome the lungs and preventing the lungs from harming the liver—this is the principle of nourishing the liver.\n\nOn the six *wu* days, at the hour of *wei* (1–3 p.m.), ingest *qi* 120 times to assist the spleen, enabling the spleen to overcome the kidneys and preventing harm to the heart.\n\nIn late summer, on the six *geng* days, at the hour of *shen* (3–5 p.m.), ingest *qi* 120 times to assist the lungs, enabling the lungs to overcome the liver and preventing harm to the spleen.\n\nIn autumn, on the six *ren* days, at the hour of *hai* (9–11 p.m.), ingest *qi* 120 times to assist the kidneys, enabling the kidneys to overcome the heart and preventing harm to the lungs.\n\nIn winter, on the six *jia* days, at the hour of *yin* (3–5 a.m.), ingest *qi* 120 times to assist the liver, enabling the liver to overcome the spleen and preventing harm to the kidneys.\n\nThis method is the essential teaching of ingesting *qi* according to the five phases. Each season has nine such occasions, totaling 1,080 ingestions of *qi*, each nourishing its corresponding viscus. Cycle through them repeatedly without mutual overcoming, and practice with focused intention. This is the school’s teaching. The details regarding the five viscera are fully explained in the *Treatise on the Five Teeth*.\n\n*Discourse on the Essential Principles of Qi-Absorption* concludes.",
      "overlap_context": "he qi naturally circulates through all the viscera. Thus it is said: exhalation issues from the heart and lungs, inhalation draws in the kidneys and liver, and between exhalation and inhalation, the spleen receives its nourishment. This is the principle of breath and the essence of spirit and qi.\n\nThe *Most High* once asked: \"Upon what does human life depend?\" Someone replied: \"Upon the space between exhalation and inhalation.\" The *Most High* said: \"Excellent! This may truly be called the Dao.\"",
      "start_char": 3299,
      "end_char": 4501,
      "start_sentence": 163,
      "end_sentence": 215,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.58441686630249,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\服气精义论.txt",
        "category": "方法类"
      }
    }
  ]
}