{
  "source_id": "栖云真人王志谨盘山语录",
  "source_file": "chunked_daozang\\栖云真人王志谨盘山语录.json",
  "total_chunks": 16,
  "total_original_chars": 17295,
  "total_translated_chars": 92729,
  "total_translation_time": 450.4826066493988,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\藏外\\栖云真人王志谨盘山语录.txt",
    "category": "藏外"
  },
  "full_translation": "**Preface to *Recorded Sayings of Perfected One Qiyun, Wang Zhijin, at Mount Pan***\n\nThe blind cannot partake of the colors green and yellow, nor can the deaf share in the sounds of pipes and chimes. Is this affliction confined to the body alone? Nay, the mind and intellect suffer likewise. Though the original, Heaven-endowed truth is complete in all, it is obscured by accumulated dust, leaving the true eye unseeing. Chasing after forms and sounds, tracing footprints and tracks, one sinks into evil destinies, passing through a thousand kalpas of rebirth. Mistaking bamboo flutes for sunlight, striking bronze basins for the sun’s reflection—without encountering a true master, how can black and white be distinguished? Clinging to phrases and grasping at texts only deepens confusion. Thus, Master Qiyun, unable to bear this, administered medicine for the affliction, clearing ears and prying open deafness, polishing eyes and scraping away cataracts, hoping that all might see clearly and each awaken to understanding. In seeing and hearing, may they be free and unburdened, all returning to the true Way, no longer chasing the lost sheep.\n\nMaster Liu, a disciple of long standing, secretly recorded the master’s every word and sigh, compiling them into a collection of over a hundred entries—truly a guide for beginners on the path of the Dao. He commissioned craftsmen to carve the woodblocks, that its transmission might be broadened. This humble Daoist of Gufeng Peak, though but a latecomer among his disciples, upon seeing this work, rejoiced. With reverence, he purified himself and composed this preface.\n\n**Recorded at Mount Pan on the First Day of the First Month, Dingwei Year**\n*Disciple Lun Zhihuan respectfully inscribes*\n\n---\n\nAt that time, the master expounded at Mount Pan:\n\nFor beginners on the path of the Dao, if one immediately seeks what lies beyond words, understanding will find no foothold, no reliance, and doubt will surely arise. With no effort in the heart, faith will falter; without faith, there can be no practice; without practice, one strays into reckless learning, and over time, grows weary and retreats. Now, I shall speak to you of what lies before your eyes, what fills your ears—what you can believe and practice. Proceeding from the coarse to the subtle will not lead you astray. Though these are but sounds and forms, they are the very functioning of the Dao.\n\nWhat, then, is something you can believe? Do you not see the vast emptiness, the heavens and earth, the sun and moon, mountains and rivers, wind and clouds? Are these not clearly before your eyes? They are the models for cultivation, the gates to entering the Dao.\n\nConsider the clouds emerging from the mountains: they come and go without intent, drifting freely. Nothing in the realm of objects can cling to them—so too should the heart of the Dao-practitioner be. Or the wind stirring all things: it blows now here, now there, utterly without stagnation, leaving no trace. Neither grasses nor forests can obstruct it; it passes through with a single sweep—so too should the heart of the Dao-practitioner be. Or the great mountains: towering and majestic, steadfast and unshaken. No thing can touch them—so too should the heart of the Dao-practitioner be. Or water: by nature soft and flowing downward, benefiting all beings without contention, conforming to square or round, its essence clear and tranquil. When it gathers into rivers and seas, it embraces the hundred streams without distinction, containing fish, turtles, shrimp, and crabs alike—so too should the heart of the Dao-practitioner be. Or the sun and moon: their radiance shines without partiality, illuminating all four directions, bright day and night, boundless in clarity—so too should the heart of the Dao-practitioner be. Or the heavens above: their substance is ever pure, pure yet all-embracing, covering all without exception. Toward the ten thousand existences, they bring benefit without harm—so too should the heart of the Dao-practitioner be. Or the earth below: its substance is ever still, motionless and silent, bearing the weight of all things without favor or bias—so too should the heart of the Dao-practitioner be. Or the vastness of empty space: boundless, containing all, embracing all, whether sentient or insentient, covering heaven and supporting earth. It encompasses without discrimination, neither moving nor still, neither being nor non-being, neither identical to nor separate from the ten thousand things. It possesses the clarity of heaven, the stillness of earth, the brightness of sun and moon, and the transformations of the ten thousand things—yet empty space remains one and the same. So too should the heart of the Dao-practitioner be.\n\nThe Dao is one with heaven and earth; its functioning is thus. Its essence lies within. When effort is perfected, understanding arises naturally. In activity and repose, it accords with the Dao, and there is always one who presides. If one seeks only the place where words and thoughts cease, one has already missed it. Having entered the mysterious gate, each must strive diligently.\n\n---\n\nSomeone asked: How does a beginner cultivate the heart-ground and enter the gate?\n\nThe master replied: Sever with a single stroke all the hearts of affection and attachment, scheming and calculation, forethought and afterthought, deception and entrapment. Abandon entirely the attachments to wine, lust, wealth, and temper; to right and wrong, self and others; to clinging and craving, private and perverse thoughts, desire for gain and sensual pleasure. Externally unburdened, the body becomes light and free; internally unstained, the heart becomes light and free. With long and thorough practice, deluded thoughts will naturally cease. Ever vigilant, guard and attend to it: be cautious in speech, moderate in eating and drinking, reduce sleep. Inner and outer assist one another. When the dust and grime are entirely cleansed, leaving not a single thing behind, in time your original life-spirit will naturally manifest, and you will enjoy freedom—this is the supreme Dao-practitioner.\n\nSomeone asked: How does one attain purity and stillness in cultivation?\n\nThe master replied: The heart not chasing after things is called a settled heart; the heart not receiving things is called an empty heart. A heart that is settled and empty is pure and still—purity and stillness are the Dao itself.\n\nSomeone asked: Cultivators often speak of eliminating emotions and desires. What lies beyond these?\n\nThe master replied: Eliminate emotions, and you arrive at non-emotion; eliminate desires, and you arrive at non-desire. Beyond non-emotion and non-desire—what, then, is *this*?\n\nSomeone asked: A cultivator must remain unwavering in every moment—how can one achieve this unwavering state?\n\nThe master replied: In the beginning, when the heart is untrained, one drifts in and out without awareness, unable to gather or release. When encountering circumstances or things, one clings to them entirely, muddled and confused, only ceasing when utterly exhausted. Failing to recognize oneself is to be in darkness—no different from those reborn in ignorance, slipping unknowingly into another shell, only to return when their karma is exhausted. This is the result of being in darkness. Yet if one relies solely on knowledge and awareness, one is obscured by that very knowledge and awareness. If a cultivator examines themselves in every moment of the day and night, untarnished by worldly dust and emotions, gliding lightly past circumstances and things, this is the unwavering state.\n\nSomeone asked: How does one safeguard the matters of nature and life?\n\nThe master replied: Even when moving through the myriad dusty realms, though one may harmonize with them, one must remain the master, not blindly following their course. Let affairs not obstruct the heart, nor the heart obstruct affairs. Guard it like the eye—if even the finest speck of dust appears, close the eye and refuse it. Protect it thus, and over time, results will manifest. But if the heart receives anything, it is led away by external things, and one can no longer be the master.\n\nSomeone asked: My thoughts follow one after another, and I cannot sweep them away—what should I do?\n\nThe master replied:\n*Day after day, sweeping the heart’s ground,*\n*Sweeping only stirs more unrest.*\n*If you wish the heart’s ground to be still,*\n*Lay down the broom’s handle.*\n\nThe questioner bowed in gratitude.\n\nSomeone asked: Those who cultivate must first establish resolve—how does one establish resolve?\n\nThe master replied: In every moment, whether in movement or stillness, amid all circumstances, in walking, standing, sitting, or lying down, let your thoughts rest in the Dao. Unshaken by demons, unmoved by harm, whether in ease or peril, remain thus. Devote this body without hesitation, advancing with unyielding diligence, unafraid of life or death—this is a person of resolve. Thus the sutra says: *\"The strong in practice have resolve.\"*\n\nThe master arrived at Nangong and, sitting one night at Changzhen Abbey, addressed the assembly: Those who leave home in the beginning, unable to stand alone, must rely on the monastic community or form bonds with fellow cultivators, supporting one another to avoid bias. Yet there are three kinds of companions: cloud friends and mist companions, good friends and wise friends, and wild friends and strange friends.\n\nThose of noble character, who refine their hearts, investigate karma, sever worldly attachments, and roam beyond the mundane, seeking like-minded companions—these are called cloud friends and mist companions, for their hearts resemble clouds and mist, untouched by worldly affairs. Others study scriptures, play the qin, recite poetry, engage in lofty discussions, and debate right and wrong—these are called good friends and wise friends, for though they do not refine their hearts, they also do no evil. Then there are those who neither cultivate their hearts nor study the classics, heedless of karma. Their words are perverse, their actions reckless. At the slightest provocation, they start quarrels, boast of their strength, flaunt their cunning, bully the good, and form cliques—these are called wild friends and strange friends.\n\nAfter these three kinds of people pass away, each is placed according to their deeds and receives their due retribution: The cloud friends and mist companions ascend into the formless, roaming the Jade Capital, becoming immortals or celestial officials. The good friends and wise friends, their worldly hearts not yet exhausted, remain within the human realm, cycling through rebirths. The wild friends and strange friends, having received offerings from all directions yet lacking merit, must repay their debts—some fall into Fengdu, others into the realm of beasts, trapped in the suffering of samsara. When it comes to this, what use is regret? Those of wisdom and discernment should ponder this carefully and seek the most advantageous path.\n\nSomeone asked: What is the awakened nature?\n\nThe master replied: Pointing east and drawing west—set aside such empty gestures. Better to apply real effort. For example, whatever lingers in the heart, whatever appears before the eyes—emotional desires, afflictions, the illusion of self and others—is like a vast, slick well of glass before you. If you do not guard against it in the slightest, you will fall in and remain trapped for ten thousand kalpas. But if you see it clearly and recognize its nature, then as you are about to step forward, swiftly retreat—this very act of swift retreat and vigilance is your awakened nature. If you have clearly fallen into the pit of self and others yet still point to the empty sky and speak of transcendent matters, what has this to do with awakened nature?\n\nSomeone asked: What is the stabilized nature?\n\nThe master shifted his seat forward, sat upright in silence, and after a long while said: What stabilized nature are you asking about?\n\nThe questioner did not understand. Another master present rose, bowed, and expressed gratitude. The master said: *Zhang drinks the wine, but Li gets drunk.* The questioner laughed heartily.\n\nSomeone asked: I cultivate primarily for the great matter of life and death, yet my seeking remains unclear, leading to recklessness—what is the meaning of this?\n\nThe master replied: A single thought of non-arising is non-dying. Those who cannot achieve this do so because their hearts are entangled in emotions and their natures are stained with dust. As emotions and dust play their games, life and death never cease. To seek liberation, let go of whatever arises, letting go again and again until not a trace remains. The original source is pure—unmoved by sounds, unmoved by forms, at ease wherever you are, empty and carefree, enduring as heaven and earth, the true master naturally revealed.\n\nFor when the heart is upright, all affairs are upright; when the heart is crooked, all affairs are crooked. With mastery within, what others love, you do not love; what others dislike, you do not dislike. Every old habit is gradually turned around. The six senses emptied, the true master abides in stillness—what fear of life and death remains?\n\nWhen one reaches such a state, yet fails to gather and stabilize, unable to contain or conceal, drifting outward like one possessed by spirits or demons—racing wildly, unbridled and reckless—this is the scattering of spirit and qi, losing mastery over oneself. Taking this as true joy, true delight, one mimics the ancients by singing and dancing in the streets, unaware that the ancients, too, once untangled their bonds and found liberation elsewhere, delighting in that alone. How could they have indulged their minds in frantic folly to deceive the world?\n\nYet they did not know that joy without joy is true joy, delight without delight is true delight, and knowing without knowing is true knowing. Now, swept away by the discriminating mind, with perverse qi invading the heart, one falls into madness and dissipation—no remedy remains.\n\nSomeone asked: With eyes open, there are dusty realms; with eyes closed, dream realms; in crowds, realms of adversity and favor—how can one find stability?\n\nThe master replied: For the practitioner, gathering the heart is fundamental. When adversity arises, pass through it with joy; when favor arises, pass through it without attachment. What do these dusty realms have to do with you? Among others, even a three-year-old child should not be opposed or offended—always yield to them. When others oppose or offend you, always endure it. Enduring and yielding, the work is naturally accomplished. When all people show respect, when all difficulties are borne by oneself, over time, as the heart and circumstances become pure and familiar, one finds stability everywhere. All realms pass by as ordinary, with no stirring of the heart. Amidst the ten thousand conditions, the heart rests in peace, untouched by even a speck of dust—pure and free, unwavering day and night. This accords with the hearts of sages and worthies.\n\nSomeone asked: \"To know the One is to complete all things,\" and yet it is also said: \"Embrace the primordial and guard the One.\" What is this One?\n\nThe master said: It is the undifferentiated nature, the state without discrimination. Once you know of its existence, you fall into enumeration and can no longer be one. One gives rise to two, two to three, and three to the ten thousand things—how can it be guarded? It is better to be without even the One. Thus, the ancestral master said: \"Embracing the primordial and guarding the One is effort—yet in the enduring vastness, there is not even a One.\" From this place of not even a One, one illuminates one’s own fundamental nature—how could it be nothing?\n\nThus, the sutra says: \"To know emptiness as not empty, to know form as not form—this is called illumination.\"\n\nSomeone asked: Among those who leave the household life, some study the ancients’ cases, some study scriptures, and some say that the ancient teachings illuminate the heart—is this correct?\n\nThe master said: The practitioner’s work is to refine the heart, to ascend from the ordinary to the sacred. Yet since leaving the household, they have not made this their task, instead searching through the words of the ancients, making a livelihood from ink and paper, counting lines and tallying characters, entangling themselves in vines of discourse. They exhaust all effort—what good does it do? When King Yama comes to call, not a single phrase, not a single word will serve. They would have been better off passing their days in ignorance. Take the effort now spent in such pursuits and direct it toward one’s own fundamental work—then time will not be wasted in vain.\n\nWhat is one’s own fundamental work? It is this single point of luminous clarity that governs the body, received from the Dao, pristine and constant from ancient times to the present—what more could one desire? When one clarifies and understands this principle, it becomes the warrant for transcending the ordinary and entering the sacred. If you trust this, begin at once to work on it. You, too, have such a case—why count others’ treasures? Quickly make use of it yourself, and from now on, you will not be deceived by others.\n\nOnce, while the master was engaged in labor, he gave a general discourse: Long ago, beneath the Eastern Hall, there was a man named Zhang Xian who was skilled in carpentry. He never opposed others, was humble and yielding, and never showed anger in his expression. The assembly all approved and constantly praised him, and word reached the Perfected One. The Perfected One said: Not yet. Let us test him first—like gold that has not been refined, its authenticity is unknown.\n\nOne day, he was ordered to make a meditation bench. The man assented and began the work. Before it was finished, he was ordered to make doors and windows, and he provisionally complied. Already, a hint of impatience arose. Before half the work was done, he was ordered to make several boxes. The man refused and argued before the Perfected One, insisting on completing one task before starting another.\n\nThe Perfected One then said: Previously, everyone praised you for being able to respond to others without opposition, never losing your composure. Today, the test has revealed the truth. For the practitioner, refining the heart in response to circumstances is paramount. With inner mastery, one is at ease and harmonious; outwardly, one responds to affairs with perfect accuracy. What is urgent, what can wait—one acts from what is most pressing, even if it means grinding one’s bones to dust, yet the heart remains unmoved. What difference does it make whether this task or that is done first?\n\nAll are but transient things—what fixed essence do they possess? The heart must die, the mechanism must live; simply respond to what is most pressing in the moment, calmly and steadily, unmoved and unobscured. This is what is meant by \"constantly responding, constantly still.\"\n\nSomeone asked: \"There are those who say that karmic retribution spans three lifetimes—is this true?\"\nThe answer: \"Have you not heard the ancient saying: *'When enlightened, karmic obstacles are fundamentally empty; when unenlightened, one must repay past debts.'* Once, a man bore malignant sores so agonizing that pus and blood flowed unceasingly. Unable to endure, he sought a secluded place and hanged himself. Such a person, neither having understood his own nature nor willing to bear the debt of pus and blood from a past life, though he brought about his own death, would still have to repay it in his next existence. How do we know this was past karma? There was once a high official—whose name need not be mentioned, for the law of cause and effect suffices—whose nature was cruel and tyrannical. Whenever displeased, he would beat his attendants and servants. One day, he suddenly felt an itching pain on his buttocks; scratching it only tore the skin, and gradually, flesh split open as if freshly flogged, the pain unbearable until he died. Thus, we know that debts of pus and blood must inevitably be repaid. Not only this, but even minor matters—joy and anger, slander and praise, blows and scoldings, right and wrong, aversion upon meeting—all are old karmic entanglements from past causes, now demanding repayment in this life. One must accept them gladly, without protest, enduring with patience; only then is the debt repaid. If one contests, it is like refusing to settle a debt, deepening the accumulation, binding the karmic knot ever tighter, with no end in sight. Moreover, Heaven favors repayment; even the grievances and injuries between people are nothing but karmic debts.\n\nOnce, when the Perfected One Changchun resided at Changchun Abbey, a great army suddenly returned from the north. He hid in the distance to avoid them but encountered a nobleman he knew well, whose family had long practiced the Dao. The nobleman said his wife had been captured and that he wished to exhaust his family’s wealth to ransom her and let her leave the world. He sought the Perfected One’s counsel, but Changchun flatly refused. By the time the matter was discussed, the army had already moved far away. Later, the nobleman asked why he had refused. The Perfected One said: 'Your wife and her captor share a three-year karmic debt. Now that they have met, it is their past affinity. In three years, she will return here to leave the world.' Indeed, three years later, she was released, took up the hairpin and robe, and came to Changchun Abbey to pay respects to the Perfected One. Through her lifelong practice of goodness, she was able to enter the Dao. Only then did the nobleman believe and bow in gratitude without end.\n\nThe Master, seeing a Daoist practitioner ill, expounded: 'For those who cultivate the Way, eating and drinking are measured, movement and stillness are regular, the heart and spirit are at peace, and there is no reckless action. If illness arises by chance, it is Heaven’s decree—how could one dare refuse it? It is also the unfolding of one’s own fate, or perhaps a karmic affliction from past causes. First, one must see through the four great elements as illusory. If sick, let it be sick; if dying, let it be dying. The heart remains patient and enduring, allowing transformations to take their course. If the mind is not fixed on illness, severe illness lightens, and mild illness heals on its own. With the inherent nature at peace, turbid and noxious qi disperse. This is repaying the debt of illness, passing through another barrier. If one does not understand this, the heart will be unsettled. At the slightest ailment, the mind becomes frantic, wailing ceaselessly, crying out in pain, cursing Heaven and Earth, resenting others for not supporting, blaming them for not seeking a physician, scolding them for not preparing medicine, reproaching them for not inquiring after one’s health. All the while, the dark karma of ignorance arises, leaving no rightful path. One forgets that life and death are already determined—what use is panic? The heart grows even more disturbed, unable to find peace. Moreover, one does not realize that the heart is the master of the body. If the master is not at ease, the whole body falls into chaos. Have you not heard the ancient saying: *'A flustered heart and scattered mind are the gates to hell'*? Such a state invites transgressions. In this way, mild illness turns severe, and severe illness leads to death, for one’s nature is clouded by turbidity. If one’s actions lack restraint and illness arises from excess, it is self-inflicted—who else can one blame? Those who cultivate the heart-ground would never act thus. Let each reflect on this.\"\n\nA master, seeing a patient at the brink of death unable to depart, addressed all present: \"Those who cultivate the Way must first see through the illusory nature of all worldly conditions, and next recognize this bodily form as but a heap of dust. In daily affairs, remain detached; at the hour of departure, one will naturally attain freedom.\n\nOnce in Shandong, an abbot lay dying, lingering without release. Someone was sent to inquire of Master Changchun. The master replied: 'In life, he clung to external conditions and objects, neglecting inner cultivation—thus he remains entangled, unable to break free.' He sent these words: *'This body is not yours; your nature is fundamentally empty. When not a single thought arises, lay down the whole body.'* Upon hearing this, the abbot seemed to awaken. He instructed his fellow practitioners: 'I was deluded by external conditions, neglecting the work of the heart-ground. Now, at the threshold of death, I falter. I urge you all: devote yourselves to cultivating body and mind, and resolve this great matter of life and death.' With that, he passed away.\n\nAnother Daoist, nearing death, could not depart. He asked those around him: 'How can I go?' One said: 'Meditate on truth.' He meditated for days but still could not go. Another said: 'Meditate on emptiness.' Again, he could not go. An old immortal heard of this and came to see him. The man recounted his previous attempts, yet still could not depart. The old immortal rebuked him: 'What did you bring when you came? What do you seek to take when you go? Rest in equanimity and await your time—when it comes, you will depart.' The sick man bowed in gratitude and died.\n\nGenerally, those who cultivate the Way regard all external conditions as provisional tools for the present moment, while their true nature requires steadfast effort. If one moves through worldly affairs with detachment, how could one fail to be detached at the hour of death? If one clings to things and affairs, how could one be detached then? Cultivate diligently—life and death are unpredictable. When the day comes, what use are external conditions? Let each reflect on this.\"\n\nThe master also said: \"Those who cultivate the Way must first establish resolve. Yet once resolve is set, many become rigid. Rigidity prevents adaptability in worldly affairs. Even if one becomes adaptable, one may grow complacent, letting days slip by. Thus, learners are as numerous as ox hairs, while those who attain are as rare as unicorn horns.\n\nThose with resolve often lack understanding; those with understanding often fail to act; those who act often do not persevere. In cultivating the Dao, one must first return to the ancestral source, then establish resolve. One must discern adaptability, remain single-minded, and practice diligently without cease—then success is assured.\"\n\nSomeone asked: \"What is the ever-constant Dao?\"\nThe master replied: \"Set aside the ever-constant for now. In the twelve hours of day and night, examine your own heart-ground. Observe: what is it before thoughts arise? When thoughts arise, discern whether they are deluded or upright. Eradicate deluded thoughts; employ upright ones.\n\nWhat is a deluded thought? When idle, all anticipatory musings are false and errant. What is an upright thought? When faced with affairs—serving others, benefiting beings, honoring superiors, pacifying the multitude—all good intentions not for oneself are upright thoughts. In stillness, embody tranquility; in activity, act with rectitude. Neither indulgent nor restrained, neither day nor night obscured, moment by moment unclouded—constantly responsive, constantly still, steady and serene—this is the ever-constant Dao.\"\n\nThe master also said: \"Those who cultivate the Way struggle with this obstinate heart, which since beginningless time has cycled through rebirth, piling bones like mountains, dying and being born ten thousand times. Only now do they awaken to past errors and seek liberation. Thus, they dare not eat by day nor sleep by night, refining this obstinate heart, inverting every convention to make it serviceable. Without refining the heart, even if one mimics others—staying awake, suppressing thoughts—when touched, anger flares like smoke and fire. What use is a hundred years of sleeplessness? If the obstinate heart remains, one still cycles through rebirth.\n\nTo transform this heart, day and night, in movement and stillness, shatter this obstinate heart to pieces—only then can it be of use. The original true spirit resembles heaven and earth. Then, stillness is the Dao, activity is the Dao, speaking is the Dao, silence is the Dao—what more is there to seek? One becomes a Daoist free and unburdened.\"\n\nThe master often said: \"Those who cultivate the Way must apply effort to refine and relinquish the deeply ingrained habits of their minds. Even this body, when its time comes, must be abandoned—how much more so the illusions of the heart? Remove them all, and no afflictions or obstacles remain. External affairs and things need not occupy the mind; the comings and goings of the present are like mosquitoes—brushed away, one feels at ease. Yet the thoughts hard to dispel from the heart—these are the seeds of rebirth.\n\nWhen Master Changchun dwelled at Pan Ravine, tigers and leopards came and went at night, appearing morning and evening. Initially fearful, he considered building a fence. Then he reflected: 'In such a place, with this fear, I seek to shield myself—can I truly evade life and death?' He let it be, remaining unshaken, accepting life and death as they came. Fear vanished, and amid the trials of life and death, he stood firm and unmoved. All bonds dissolved at once—this is practicing the difficult.\n\nThe master also said: \"Those who cultivate the Way must thoroughly investigate the great matter of life and death. Apply effort to yourself, day and night, with an undisturbed mind and purified senses.\"\n\nWhen encountering realms of sound and form, see as if not seeing, hear as if not hearing—let nothing take root within the heart. Others may stir and clamor, but these are not one’s own affairs, like wind passing before the eyes.\n\nThe master also said: \"Those who cultivate the Way should only observe the good in others’ actions and emulate it themselves. Do not fixate on others’ faults, lest you lose yourself. Do not engage in mutual fault-finding. To harbor right and wrong is to have an unaligned mind; progress will be long delayed. The upright can suppress the crooked, while the crooked constantly slander the upright. Those who cling to the notion of self and habitually slander others fail to understand themselves—they belong to heterodox and perverse traditions. If one possesses true knowledge and right view, one must examine one’s own mind for bias and error, searching out one’s own faults. To meddle in others’ wrongs is not the way of the upright.\"\n\nSomeone asked: \"What are *gong* and *xing*?\"\nHe replied: \"Closing the mouth is *gong*; opening the mouth is *xing*.\"\n\n\"What does it mean to close the mouth as *gong*?\"\n\"To attain through silence, without thought or worry, sealing the mouth and forgetting speech, seeking no recognition, concealing one’s light and obscuring one’s traces—this is closing the mouth as *gong*.\"\n\n\"What does it mean to open the mouth as *xing*?\"\n\"To offer expedient means, teach others to practice, benefit all beings, and point the way to the true Dao—this is opening the mouth as *xing*.\"\n\nSomeone asked: \"Are seeing, hearing, eating, breathing, grasping, walking, and thinking the nature?\"\nHe replied: \"The nature of the Dao is neither identical to nor separate from these. Movement and stillness, speech and silence—these are the functions of nature, not its essence. The essence of nature is neither moving nor still, neither speaking nor silent. An ancient said: *'To know the ancestral source of the great Dao, do not depart from movement and stillness, speech and silence.'* Yet if you take movement and stillness, speech and silence as the nature, you mistake the servant for the master. The master commands the servant—how could the servant be the master? All lifting of hands and moving of feet, all speech, seeing, and hearing, all myriad forms and postures, even long periods of stillness—these are all servants, not the master. The master in the hall never reveals itself outwardly, yet those who receive its use and command naturally take themselves as the master.\"\n\nSomeone asked: \"If I devote three years to rigorous practice, can I escape rebirth?\"\nHe replied: \"Those who cultivate the Way must establish resolute determination, refining the mind with unceasing diligence, moment by moment. Do not presume upon the future or harbor conceit, hoping for liberation. Once, a Daoist novice left the household life and boasted: *'Rebirth is a trifle—I need only apply some effort to be free of it.'* Though he began with resolve, an unexpected grave illness befell him, lingering for years and gradually eroding his will. How could this be achieved with arrogance?\"\n\nSomeone asked: \"When I walk or sit alone in the mountains, I personally witness mountain spirits foretelling future events—is this real?\"\nHe replied: \"The minds of ordinary people cling to the dust of the ten thousand phenomena, dull and unclear. When beginners leave the household life, they grind away at the dust of the mind. If they happen to attain stillness, they may suddenly perceive a tranquil realm, giving rise to strange visions—phantasmal apparitions they mistake for the mind-ground. Overjoyed, they sing and dance without cease. Some may see future events, or hear voices in the void foretelling things that later come to pass, or even witness past masters, true spirits, or divine beings appearing before them to entrust matters of the mind-ground. If one clings to these experiences, one falls into delusion. If not dispelled, they become a sickness of the mind, incurable by any method. Have you not heard the ancient saying: *'Seeing, hearing, awareness, and knowing are also afflictions'*? How much more so for what the eyes see, the ears hear, and the mind thinks—all belong to the realm of sound and form. Have you not heard the sutra: *'It cannot be seen by sight, cannot be heard by hearing, cannot be spoken of in words, cannot be reached by thought'*? To take what appears in the realm of sound and form as real is to fall into heterodox paths.\n\nOnce, a Daoist in meditation suddenly tasted wine in his mouth and dreamed of someone offering him wine. The next day, someone indeed brought him wine. This is the mind’s emptiness resonating with spirits—nothing extraordinary. To cling to it is to fall into heterodoxy. Another Daoist, while sitting, suddenly felt his spirit leave his body and wander hundreds of steps away before returning, seeing his original form still seated upright. Though this happened several times, it was nothing extraordinary—merely the usual wandering of thoughts, only slightly more distinct. To regard it as an achievement is to fall into delusion. A folk saying goes: *'A thousand auspicious signs are not as good as none; ordinary peace and stability accord with the Dao.'*\n\nWhen the assembly discussed the opening of *Zhizang* (Treasury of Wisdom), with words flowing like a spring, the master said: \"Those who cultivate the Way, in their initial resolve, depart from the dust, like a mirror newly polished. When the Treasury of Wisdom suddenly opens, thoughts become verses—do not cling to them. If the mind becomes fixed, functioning without stimulus, it turns into wild wisdom, devoid of merit. This is merely the functioning of spirit, not the essence of the Dao. Do not parade it as a skill; only through nurturing and refinement does merit arise.\"\n\nWhen the assembly discussed dwelling in the mountains, the master said: \"Those who cultivate the Way must see through people when they come and respond to circumstances as they arise. Each response is like a single act—once past, it is past. Once, a Daoist dwelled in the mountains, wearing clothes of grass and eating wild plants, vowing never to descend, believing he had cast off all worldly entanglements. One day, two men bearing weapons came demanding food. The master quickly cooked mountain fruits for them, but before they softened, one of the men reached into the pot, tasted them, and angrily said: *'Such things are not fit for human consumption!'* He was about to smash the pot. The master said nothing. Seeing the men’s anger and hearing their harsh words, he secretly devised a plan. On the pretext of leaving, he found the staff he had hidden, grasped it firmly, and shouted: *'You two, come out! You may not be able to get near me!'* \"\n\nThe two men stepped outside and laughed, saying: *\"Master, dwelling in the mountains has nurtured such a triumphant heart in you—better to descend and become an ordinary man.\"* With that, they departed, and as he watched, they suddenly vanished. The master then suspected they were sages testing him and regretted deeply. This was a trial he had failed at the threshold of circumstance.\n\nThe master, undisturbed by the opinions of others, once said: *\"Long ago in Shandong, a Daoist boasted to his teacher that he had refined away the fire of ignorance.\"* The master replied: *\"If the fire of ignorance is extinguished, the heart remains unmoved—then you are a good man.\"* Later, the master secretly sent someone to test him.\n\nAt dusk, the man arrived at the hermitage, but the gate was already shut. He raised his voice and struck the door violently with his staff. The Daoist inside responded, his tone already unsettled. With reluctance, he opened the door, and seeing the visitor’s fierce demeanor, his expression shifted. When they entered the hall, the man did not remove his shoes but leapt onto the seat, utterly lacking in courtesy. The Daoist grew furious and severely rebuked him. The man clasped his hands and smiled: *\"I dared not act so—your teacher sent me to test whether your heart remains unmoved. Now, before the trial even began, it was already evident. No further testing is needed.\"* The Daoist was deeply ashamed, left with no words to reply.\n\nGenerally, even those who cultivate the Way, though they may have skill, dare not boast of it. Unawares, they are exposed in the trial. Only when one truly reaches the state of a withered heart and emaciated form does the thought of self-praise vanish. Once self-praise arises, the trial is already failed. Even if one attains the state of immovability, there is still more beyond.\n\nThe master, discussing the practice of dwelling in seclusion and guarding stillness, said: *\"Once, a Daoist had sat in a walled enclosure for years. One day, the community asked him to come out, and he moved about freely. An old friend saw him and asked: ‘Brother, what you gained in stillness—can it be applied amid clamor? I wonder if you have truly reached the point of immovability.’* The man grew haughty and remained silent for a long while. The friend pressed on: *\"I have a touchstone to distinguish truth from falsehood. Brother, try speaking of the heart you attained in years of stillness—let us see how it fares.\"* The man replied: *\"What is there to say of stillness?\"* The friend said: *\"If it is like this, then you will repay your debt with fur and horns.\"* The man flew into a rage, hurling insults. The friend laughed: *\"This is what you gained in your enclosure—truly tested now.\"* The man grew resentful and cut off the friendship for life.\n\nThis man had never tempered his heart amid circumstances. Though he sat in stillness for a hundred years, it was all in vain. He was like a horse tethered in place—once the rope is untied, it bolts as before. *(A walled enclosure: a single room built within a circular wall, sealed except for a small window to receive food, allowing the practitioner to focus solely on cultivation. To sever ties with friends: to devote oneself entirely to practice.)*\n\nThe master once said: *\"A cultivator is like a master carpenter hewing wood—first, one must align the heart’s inked line, then gradually apply axe and adze to the crooked and wayward parts, shaping it into proper timber for use as needed. One must not disturb the heart’s inked line; if it is lost, there will be no standard to follow. When the crooked and wayward are fully pared away and the heart’s inked line stands true, it will naturally resonate with others, and all implements may be fashioned.\"*\n\nThe master also said: *\"A cultivator should always keep the heart free of affairs, upright and proper, moment by moment, hour by hour, examining the true abode of one’s original life and primordial spirit, clear and unobscured, merging with the vast emptiness—only then is this the heart of one who walks the Way. Through accumulated days and piled-up effort, spiritual verification will naturally arise. Thus, all manifold activities are not as good as ceasing and examining oneself. If one constantly directs the mind toward external things, drifting through days in habitual routine, it differs not at all from the mundane heart.\"*\n\nWhen the assembly discussed taking up the abbot’s seat, the master said: *\"A cultivator who assumes the abbot’s role must measure his own strength, move with simplicity and ease, and pass the days lightly. He must not vie with the worldly for fame and profit, thereby losing his original heart and forgetting the great cause of life and destiny—this is the true principle. If one can temper the mind in this way, turning reluctance into willingness, facing hardship with resolve, and attaining a heart that is stable and unshaken, then in receiving guests from all directions, one benefits both self and others, settles the mind, and accumulates practice—merit and conduct will both be complete. If one does not temper the heart but mistakes things for the self, one will remain bound by stingy and greedy habits, narrow and constricted, chasing after transgressions and worldly concerns, thus ruining one’s future path.\"*\n\nThe master, urging the assembly to dwell in the monastic community, said: *\"Master Danyang’s lyric states: ‘To learn the Dao, dwell in the monastic community, assess depth and shallowness, and choose the good as your intimate friends.’ If one has not yet grasped the ultimate principle, holding fast to the essentials, then in the monastic community, all instruct one another, lifting the guiding threads and holding the key points, together cultivating the supreme Dharma-gate of the mind-ground—this is no small matter. There are those without insight or aspiration who neither seek wise companions nor dwell in the monastic community, idly speaking of wandering, yet without discussing the mind-ground. They go south and north, across a thousand mountains and ten thousand rivers, wasting straw sandals in vain, only seeking places of convenience and ease. At the slightest touch or bump, they flee at once. When it comes to finding a good place for themselves or seeking favorable conditions, such monastics know not what is most urgent for themselves, nor how to pass the days. They merely seek ease—this is all. Yet they do not realize that ahead lies the decisive arrival of birth and death. What will you rely on to cope? How can one drift through days, squandering time? What did you originally leave the household to pursue? Clear-minded gentlemen, ponder this carefully.\"*\n\nWhen those engaged in labor grew restless, the master said: *\"Though external conditions for cultivators are provisional, one cannot fail to respond. Respond without self, the substance of the heart empty and vast. When matters arise, there is no obstruction—thus, emptiness does not obstruct the ten thousand affairs, nor do the ten thousand affairs obstruct emptiness. Like the myriad forms and beings in heaven and earth, all move of themselves, without hindrance. If the mind harbors the notion of self, matters will provoke opposition, leading to friction. One cannot pass through swiftly, and upon encountering obstacles, the self’s heart is stirred. Once the self’s heart is stirred, there is no peace. Though one toils all day, the labor is in vain. Dwelling in the great assembly and engaging in work, one must vigilantly guard the self’s heart, not allowing it to be easily moved. Constantly search for one’s own faults, never mind the faults of others—this is merit and conduct. When matters arise, one must take them on. Amidst the ten thousand conditions and dusts, do not follow them. With a heart that is bright and clear, do not discriminate—passing days thus, the beginner’s mind does not retreat, and great merit is naturally attained.\"*\n\nThe master said: *\"A cultivator with one part effort generates one part of a superior mind; with ten parts effort, ten parts of a superior mind arise. Once there is a superior mind, there is the notion of self. The notion of self and the superior mind create great obstructions—how can one attain the state where the heart is empty and conditions cease? One must resolutely add determination, placing one’s own body and mind beneath the ten thousand things, always staying behind others, thinking oneself a thousand, ten thousand times inferior to others—only then can the mind of pride and superiority be dispelled. When the heart is like the great void, there is no self; without self, one resonates with the Dao.\"*\n\nThe master said: *\"The states encountered by cultivators in stillness are manifold, all transformations of one’s own consciousness arising from stillness to entice the sovereign heart. Have you not heard the ancient saying: ‘All conditioned things are like a dream, an illusion, a bubble, a shadow’? If one wishes to dispel consciousness, yet consciousness remains, it will transform into forms and images—demonic heads and ghostly faces—confusing the master of the heart. If the master remains unmoved, seeing as if not seeing, the body like empty space, with no place to abide, they will naturally dissipate. There will be no conditions to demonize, no things to corrupt.\"*\n\n*\"Once there was a Daoist who had attained rest for the heart. One day, as he sat, he suddenly saw countless evil spirits descending from the sky. The man stabilized his heart, his body like empty space, darkly undiscriminating. He staked his life, willing to live or die. The demons dispersed of themselves, for there was a master within, serene and unmoving—how could there be demonic illusions? The deluded mind not yet exhausted manifests such forms. When the nature is profoundly still, they vanish of themselves.\"*\n\nSomeone asked: *\"What of the merit of one who practices in a walled enclosure?\"*\nThe master replied: *\"When Master Changchun was in Shandong, he came to a temple where there was one sitting in a walled enclosure. As the assembly prepared the vegetarian feast, someone informed the master: ‘The gentleman in the enclosure wishes to speak with you.’ The master instructed that they meet after the feast. Unexpectedly, the master went out and came to the enclosure. He struck the door loudly with his staff several times. The gentleman inside, thinking it an ordinary person, responded in anger. The master then turned away.\"*\n\nAfter the feast, the assembly again requested that they meet. The master said: *\"I have already tested him. This man still harbors the mind of ‘I’—he is not yet fit for discourse.\"* And so he departed.\n\nGenerally speaking, dwelling in stillness is fundamentally for the great matter of nature and life, to gather and secure, to nurture as one’s work. Unmoved by circumstances—this is the proof. Now, the sound of the knocking at the door was a circumstance; the response was the mind. If the mind had forgotten the self, it would be like cold ashes extinguished, stirred yet without flame. Unmoved by circumstances, calmly passing through—this is the sign of work upon the mind. Now, hearing a trifling empty sound, he was already moved in heart. How could he ever pass through all adverse circumstances? Though he sits in a walled enclosure, what use is it? Accepting others’ offerings, how can he repay such a debt of the mouth? Far better to turn toward the realm of activity, toward affairs and things, and single-mindedly temper this heart—such a one is a person of true insight.\n\nSomeone asked: *\"Those who cultivate the Way speak of knowing and awakening, yet also call them illness. What is the meaning?\"*\nThe master replied: *\"True knowing is the knowing of not-knowing; true awakening is the awakening of no-awakening. The original true spirit, obscured for ten thousand kalpas, has only now awakened—this is called awakening. All knowing and seeing arise from this. If one speaks of having knowing and having awakening, and insists on constant knowing and constant awakening, this is self-entanglement, self-imposed moxibustion upon a body without illness. If one is utterly without knowing and without awakening, one will simply penetrate into another shell. Having awakened to the original source, knowing and awakening are but tools for use. Use them when needed, but do not make them constant.\"*\n\nThe master said: *\"When one who cultivates the Way suddenly stills the dusty mind and extinguishes worldly cares, the original true source of the self stands revealed alone—this is the primordial master who has always been. Once one takes up this burden, one is carefree and at ease, and all dharmadhātus are penetrated at once. If one reaches this state, one must conceal one’s light and hide one’s traces, protect and nurture it—more yields more merit. If one raises the intention to display it, one will unknowingly dim one’s radiance.\"*\n\nThe master said: *\"Those who cultivate the Way differ in the sharpness of their nature. Those of dull nature should not cling rigidly. They ought to dwell in the assembly, humble their minds, and form affinities with those who understand principle and illuminate the mind. When the affinity ripens, they will naturally be guided into the Dao and gradually awaken. If one’s nature is dull and stagnant, and one has no insight, yet daily keeps company with those of the same kind, associating with worldly dust, the dusty circumstances will ripen, and one will surely retreat from the Dao. One may encounter demonic realms, perceive hellish visions, with no one to save them, sinking forever—how deeply lamentable!\"*\n\nThe master said: *\"Once, a man dwelling in a walled enclosure heard others speak of the ‘ground of realization.’ After entering the enclosure, he wished to see this ground. As this thought arose, it manifested in response. Not knowing it was false—what the ears heard belonged to sound, what the eyes saw belonged to form, what the mind imagined belonged to delusion—he saw golden youths and jade maidens, true immortals and sages appearing in form, seen clearly in broad daylight. Yet this was but an illusory realm, created by deluded thought. Taking it for the ground of realization, he could not break free, muddling through his life, ensnared by demons and spirits. He did not know that the ‘ground of realization’ is where the ancients’ minds and actions reached a state of stability and rest—hence the name. Like a place where one dwells, clearing brambles, sweeping away rubble, the ground is leveled so one may reside—this is called the ‘ground of realization.’ For one who cultivates the Way, when the mind-ground is stable and unmoved by contact with affairs, this is the ‘unmoving ground of realization.’ When the ten thousand dusts cannot stain it, this is the ‘pure ground of realization.’ When one’s original dharmakāya is revealed, bright and clear in every part, and one can take it up—this is the ‘luminously complete ground of realization.’ All such ‘grounds of realization’ have boundaries and limits. If one reaches the state of no ground, no direction, beyond names and words—this is what is called ‘mysterious and again mysterious.’ How could one claim that what is seen by the eyes, heard by the ears, or imagined by the mind is the ultimate?\"*\n\nThe master said: *\"Non-action is the Way of Heaven; action is the way of man. Non-action is one with Heaven; action is one with man. Like a man carrying a burden—if both ends are balanced, it rests steadily. If one end is dropped, it becomes lopsided. If both ends are let go, even the carrying pole is gone, and one returns to the original state.\"*\n\nThe master said: *\"Once, during rain at the Eastern Hall, the manager called for general labor, regardless of age, to move bricks. All competed to respond, except for one old immortal who sat unmoving. When the task was done, the assembly gathered. Someone spoke of this to Master Changchun, who rebuked them: ‘Bricks all broken—what are they worth? One person tempering the mind, truly reaching the place of rest, is like a priceless jewel.’ Consider each person’s mind-ground and how it is applied! In the teaching, obtaining the right person is most precious.\"*\n\nThe master said: *\"Once, beneath Master Changchun’s hall, there was one who served in the kitchen. All praised his gentleness and humility, saying he was never moved in heart. The master, knowing this, secretly had someone test him. In the morning, they moved the miscellaneous items in the kitchen to another place. When the man went to prepare congee, soaking the rice and filling the pot, he urgently sought the ladle and scoop but could not find them. The congee overflowed, and he was greatly disturbed in heart. Seeing this, the master taught: ‘Even if it all spilled, it is but an external thing. Why let it harm the mind?’ The man then awakened and bowed in gratitude without end.\"*\n\nA physician asked: *\"I practice medicine and have revived over a hundred people from death. What is the karmic result?\"*\nThe master replied: *\"Even if you saved all the people in the world, it would not compare to saving yourself from the cycle of birth and death. Worldly blessings have limits, but if you cultivate to the state beyond birth and death, this blessing is boundless.\"*\n\nA craftsman asked: *\"I built a great hall without asking for wages. With such sincerity, what karmic result will there be?\"*\n\nThe master replied: *\"It is not as good as a person of purity sitting in stillness for a single hour. For the blessings of action may decay, but the blessings of non-action never decay.\"*\n\nThe master addressed the assembly: *\"In this world, all that one does and all that one makes will inevitably bring retribution. Thus, those who embody the Dao attain the Dao; those who perform blessings receive blessings; those who commit evil receive evil. Those who love others are loved in return; those who hate others are hated in return. Those who respect others are respected; those who slight others are slighted. Those who humble themselves are elevated; those who trust others are trusted. Those who benefit others are benefited; those who harm others are harmed. Those who exalt themselves are suppressed; those who seek precedence are contested. Those who are self-assertive are opposed. As the saying goes: ‘Plant orchids and you reap fragrance; plant millet and you reap grain.’ Such is the principle of retribution. If one acts with a mind for profit, dissembling and deceiving to win the hearts of others, one loses authenticity.\"*\n\nThe master said: *\"For those who cultivate the Way, the greatest taboo is speaking of others’ strengths and weaknesses, right and wrong, or the rise and fall of worldly affairs—matters unrelated to oneself. Such things must not be discussed with the mouth nor pondered in the heart. To speak of right and wrong is to obscure one’s own clarity. If one focuses on refining the heart and constantly examines one’s own faults, how can there be time to meddle in the affairs of others? In all people, there is some good worth emulating; the faults of others should be avoided, not dwelt upon. Gradually, one attains stillness.\"*\n\nThe master addressed the assembly: *\"For those who cultivate the Way: if you wish to attain the Dao in your hometown, do not stay; if you wish to ascend to immortality after eating meat and drinking wine, do not indulge; if you wish your family to become immortals, do not cling to them. Do not love what others love; do not condemn what others do not. Do not mistake your own delusions for truth. Do not seek the Dao in sleep—awake! Do not associate with unwholesome companions; do not speak useless words. When things go well, do not rejoice; when they go ill, do not grieve. Learn from those better than yourself; teach those who are not. When others wrong you, it is your fortune; when you wrong others, it is your misfortune. Words beyond deeds are empty; deeds beyond words are solid. Desire and emotion belong to the world of men; a heart free of dust belongs to the immortal’s path. To willingly humble oneself is to be exalted; to willingly embrace poverty is to be enriched. Returning to the constant and aligning with the Dao, following principle and harmonizing with others—this is the upright path to walk. Do not enter deviant gates. Penetrate the Dao, illuminate virtue, and embody both substance and function in perfect completion—this is called the Perfected Whole.\"*\n\nThe master said: *\"In ancient times, those who studied the Dao, if their hearts were not yet enlightened, would travel a thousand miles to seek a teacher and inquire. If their affinity was true and their hearts were clear, free of doubt, they might then dwell in a humble hut, or lodge in forests and springs, or beg in the marketplace, or establish a temple. They would settle their hearts, guard the Dao, and remain unchanged—such were the superior cultivators of truth. There are those who leave the household life, yet their nature remains unclear. Lazy in inquiry, proud and competitive, they cling to their own views, feigning the appearance of a high adept. They neglect their practice and lose their conduct, falling short in both worlds. They accept offerings from others without considering whether their own virtue is sufficient to receive them. Such people are unfit for seclusion, unfit for begging—when the hour of life and death arrives, they will be of no use. For they refuse to apply effort to the root, and even after a hundred years, they will have achieved nothing.\"*\n\nThe master said: *\"Those who cultivate the Way should gather their hearts like a wooden statue of a sage seated in the hall. Whether no one is present all day or whether banners and canopies surround it, whether incense and flowers are offered or whether slander and praise come and go—it remains thus. The difference is that the wooden statue does not come alive, while the cultivator’s heart is spiritually awakened, vibrant and clear, illuminating the Dao and virtue. Yet in all matters and all things, it does not cling.\"*\n\nThe master said: *\"The Daoist refines the heart like forging gold into a rooster. Though its form resembles a rooster, its heart remains unmoved. It stands alone among the flock, and though roosters are combative, none dare approach. The one who embodies the Dao has a heart like cold ashes and a form like withered wood. Though the world may be full of those who love to contend, none can contend with such a one. Thus the scripture says: ‘Only because they do not contend does the world not contend with them.’\"*\n\nThe master said: *\"This true heart—embodying substance and function, free of self and other, upright and proper—has been received since before the primordial chaos, before heaven and earth existed. It cannot be called existent, nor can it be called nonexistent. All sages and worthies of ancient and present times, all Daoists under heaven, have received this and then put it to use. The thousands of scriptures and ten thousand treatises, even the entire canon, speak only of this. Heaven is guided by it, earth is guided by it—even the ten thousand things of heaven and earth, the boundless expanse of emptiness, are governed by this subtle principle. Those who comprehend it are not led astray by external things, not manipulated by thoughts and concerns, not deceived by the six senses. This is the daily practice of immortals, the conduct of sages, the path of those who advance in the Dao.\"*\n\nThe master said: *\"When dwelling in a monastery, people gather from all directions—how could they all be the same, each one identical? It is like a great mountain, where all manner of plants grow: some are useless, some become timber, some stand alone, some cling to others. There are rare and auspicious sprouts, and there are wild brambles and thorns—all different, each following its nature and growing freely, each in its own order. The mountain stands majestically, making no distinctions, yet embracing all. Flowing water and piled stones, lush forests and abundant grasses, beasts running and birds singing—all manifest wondrous spiritual workings, each supporting the other. Like hemp supporting the mallow, they grow straight without need of support. Over time, each attains its fulfillment. If one sought to cut the long to patch the short, or change green to yellow, not only would none find peace, but their original nature would be lost.\"*\n\nThe Master said: In former days when I dwelt as abbot in Shandong, I shut my door all day and received no visitors, passing over a decade thus. My heart was set on stillness, yet I performed no meritorious deeds. Sitting alone where none came near, untouched by others—without encountering circumstances or things—how could this heart reveal either completion or ruin? It was but time idly spent. If heaven did not benefit things, the four seasons would not turn; if earth did not benefit things, the myriad beings would not grow. Failing to benefit oneself and others, what virtue is there? Thus the Perfected One of Everlasting Spring said: *\"In movement, bring peace to people and benefit to things\"*—for this accords with the Dao of heaven and earth.\n\nThe Master said: If a cultivator’s Mysterious Pass remains blocked and their mind-ground unclear, their karmic consciousness cannot abide in non-action—this is due to lack of merit and power. They should instead apply effort within the realm of action, following the teachings according to their capacity. Receive those who come with humility, keep the mind lowly, revere teachers and companions, constantly practice kindness, and cast aside selfishness and deceit. Over time, as conditions ripen, daily progress will bring breakthroughs. Is this not far better than carrying an empty burden at both ends? Unable to abide in non-action, yet unable to act—drifting through days without merit or practice, settling into comfort, indulging the palate, meddling in worldly affairs, seeking prominence in bustling places, indulging body and mind without fear of the divine, calculating gains and losses—have you not heard the words of the Perfected One of Everlasting Spring: *\"To cultivate the mind-ground, wholly cast aside worldly affairs; to labor in the teachings, stir up great dust and toil\"*? Yet if one lacks the work of the mind-ground *and* fails to labor in the teachings, drifting through days—ask yourself: what manner of person is this?\n\nThe Master said: Conditions and causes are fated, not subject to human effort. One must follow nature and await destiny with equanimity. Inner cultivation and outer conduct depend entirely on the self. If one applies effort, one gains merit; whether one acts or not, each reaps their own reward. If the teachings remain closed, one should withdraw and lie low, harmonizing the mind with heaven. When the teachings open, outer conduct must also respond, aligning with heaven and serving others. Merit is not嫌多, nor conduct嫌广—only when the mind is firm and steadfast can accomplishment be achieved.\n\nThe Master said: The Dao is present everywhere, manifest in all things. Every form is true; it depends solely on one’s timely application—what else is there? Alas, the human mind is burdened by worldly dust and karmic obstructions, failing to grasp the root. They pluck leaves and seek branches, drift with the waves, and few turn back. Even those who delve deeply do not seek truth, fabricating illusions, seeing spirits and ghosts, piling heads upon heads, turning back and forth in confusion. They do not awaken to the impermanence of the illusory body, the fleeting nature of time. When a single breath does not return—what then?\n\nThe Master said: In daily life, let the mind be free of杂念, the intent not wander outward. Release without dissipation, restrain without constraint. Illuminate the mind and recognize the dharma, abandoning cunning and departing from emptiness. In all twelve hours, let each thought arise in the present. If one clings to the present, this is not the principle; if one departs from the present, there is no such place. Harmonizing movement and stillness, knowing going and coming, letting go of all things without entanglement or obstruction—this is a person of carefree ease. Yet words all fall short; one must discern for oneself.\n\nThe Master said: Heaven and earth are the parents of the myriad things. Heaven covers all without exception; earth bears all without distinction. How could they favor one thing as good and another as bad? They cover and bear, illuminate and nourish equally. Thus, those in high positions are placed there by the mandate of heaven and should emulate heaven’s all-covering care, nurturing and cherishing all those below, making no distinctions of high and low. Those below are likewise ordained by heaven’s mandate and should emulate earth’s bearing of heaven, respecting and obeying those above without the slightest negligence. Dwelling between heaven and earth, one must accord with their Dao—otherwise, acting beyond one’s station invites misfortune, calamity, and punishment.\n\nThe Master said: The cultivator who remains unblemished in their original lineage, applies intention to conduct, swiftly passes through external phenomena, does not cling to human affairs, does not entertain wayward thoughts, establishes not even the slightest trace, and remains unstained by the tiniest speck—radiant, empty, and luminous, neither clinging to emptiness nor existence, neither grasping dharma-appearances nor self-views—who gathers the light of all beings and, over time, mutually sustains and harmonizes inner and outer, attains the station of the sages and worthies. What doubt remains?\n\nThe Master said: The cultivator should act or withdraw according to their lot, take or discard as fitting, keep the mind lowly, and take impartiality as their rule. Examine the source of movement and stillness, moderate the use of seeing and hearing, sever all karmic ties, and single-mindedly abide in the true and constant. Thus, through endless kalpas, they remain unchanging and indestructible.\n\nThe Master said: The Daoist in daily life embodies heaven and follows earth, ever pure and ever still, luminous yet not obscured. Benefiting beings and aiding life, though mingling amid the dust of the ten thousand phenomena, the true source remains profoundly tranquil, unbroken. Naturally, one escapes the bonds of birth and death—this is the great matter of karmic causes. Alas, the unawakened, lacking inner mastery, are assailed within by desire and tempted without by the senses. Unable to be free, the four kinds of birth revolve, the six paths turn—exchanging their very skin, never to be as they are today.\n\nThe Master said: Those who pursue the Dao embrace simplicity and contain purity, subtly penetrating and silently moving. They eliminate passion and abandon desire, diminishing and preserving, acting without selfishness, conducting affairs with clarity, yielding to others, cultivating benevolence and accumulating virtue. The slightest fault they remove; the most minute merit they accumulate. Right and wrong both dissolve; mind and dharma both forgotten. The mechanism of the highest truth naturally becomes clear.\n\nThe Master said: When one first leaves the household life to cultivate the Way, it is fundamentally for this great matter of nature and destiny. Yet as the years pass unnoticed, one is swayed by external things, learning instead mere verbal tricks and a hundred kinds of skills—nothing more than the work of servants and maids. How can this be known? For all such arts and crafts must be displayed before others. Is this not being enslaved by others? How can it be the work of one who abides in pure non-action? Thus it is said: “The wise are not used by their wisdom, but the foolish use it; the skillful are not employed by their skill, but the clumsy employ it.” For example, the eloquent speak while the silent listen. Examine this carefully: which is hurried, and which is at ease? Those who wish to cultivate the Way must first clarify their mind-ground and then guard simplicity and clumsiness. Then all the wise and skillful under heaven will be at their service.\n\nThe Master said: The essential subtleties transmitted by the true teachers of the highest Way accord secretly with the will of Heaven in all their actions. How can one cling to a single aspect and call it the Dao? Observing their traces, the ancient ones each applied themselves differently, yet the wondrous source of their spiritual origin was never at variance. It is like the functioning of the human mind: in the eyes it sees, in the ears it hears, in the mouth it speaks, in the mind it thinks, in the hands it grasps, in the feet it walks. Though its functions differ, the essence of the mind remains unchanged. Moreover, the secret instructions of the true teachers—what is called “a special transmission outside the teachings”—transcend words and thoughts. Those who awaken attain it for themselves; this is the wondrous subtlety of the true teacher’s secret transmission.\n\nThe Master said: My Dao is secretly transmitted. It cannot be sought with intention, nor attained without intention. It is known through not-knowing, attained through not-attaining. The deluded of this world seek the Dao through attire, through speech, through demeanor, through dharma-forms—none grasp its great completeness. They do not realize that the Dao leaves no traces; to seek it through traces is not the Dao. Further, investigate: from whence do these traces arise? Knowing their origin, one finds that what abides within is beyond sound and form, beyond fabrication, beyond demeanor, beyond dharma-forms. It cannot be known by knowing, nor recognized by recognition. It is simply this: the original perfection, truly real, uniting with Heaven and Earth, with sages and worthies, with spirits and ghosts, with the myriad things. How could the dusty traces of voice-hearers ever perceive it? As the Perfected One of Danyang said: “True joy, true leisure—beyond all discussion. Most subtle, most wondrous—beyond all deliberation.” Where there is no deliberation, one draws near.\n\nThe Master said: Those who leave the household life and dwell long in the monastic community, receiving instruction and discipline morning and evening, may still grow negligent, procrastinate, and fail to advance. Their resolve for the Dao weakens day by day, while worldly affairs increase. Reckless and unrestrained, they cannot abide in emptiness and stillness. How much more so for those who remain in the world, solitary and independent, their worldly passions lingering, entangled in objects of desire? Obstacles to the Dao arise at every turn, yet they remain unaware. Even if they encounter sages and worthies, they cannot be transformed. With a hundred deceptions, they delude the marketplace, gradually sinking into perdition. Their blessings diminish while their karma grows, their transgressions deepening day by day. If they would but turn their heads, they might still be saved. But if they cling to the dust and turn from the Dao, there is nothing to be done—hell is not far off.\n\nThe Master said: Those who study the Dao should never weary of inquiry and questioning. It is like one traveling a road: by asking diligently, one does not go astray. Even in worldly skills, without a teacher one cannot succeed. How much more so with this great Dao, which cannot be seen or heard? Without encountering a teacher at the outset, by what means could one awaken? Of all sufferings, none is greater than birth and death. Without drawing near to a perfected one, how can one escape? Thus it is said: “The ancients did not study the Dao lightly; they served true teachers until old age.” If one does not know where to begin, nor draws near to those who have attained, then even with resolve and practice, a thousand errors and ten thousand mistakes will arise.\n\nThe Master said: Those who study the Dao from the beginning must discipline themselves for the benefit of others, silently accumulating merit and conduct. If one indulges the mind and acts without principle, not only does one disgrace the teaching, but one also brings misfortune upon oneself. To serve the body and mouth without purity or frugality, no different from the worldly—such a one consumes the sweat and blood of the ten directions, and this is no small matter. What is enjoyed in ease must be repaid in suffering. When birth and death arrive at last, there will be no escape. Since you dwell within this gate, why not refine the mind?\n\nSomeone asked: What is the meaning of a cultivator of the Way remaining sleepless through the night?\nThe Master replied: The cultivator does not sleep in order to refine the mind. If the mind is not gathered in, what is accomplished? Consider those who gamble, play chess, weave, spin, or grind—those who stay awake all night—are they all people who have attained the Dao? Such people, in all twelve hours of the day, are lured by the mind of profit. They are merely greedy for wealth, their minds agitated like mosquitoes biting the skin, and so they cannot sleep. The cultivator of the Way is not like this. Sleep is one of the desires. If it is not transformed, it nourishes delusion and ignorance, belonging to the yin realm. It is like one guarding against thieves, sitting upright and waiting—then the thieves retreat of themselves. In refining the mind, one must be vigilant lest it drift away. For this mind has no fixed substance: in yang it is bright, in yin it is dark. When familiar states do not arise, there is non-action and purity. The luminous pearl of nature shines clearly—this is why one remains sleepless day and night.\n\nSomeone asked: What is the principle behind cultivators of the Way willingly enduring poverty and cold?\nThe Master replied: If one merely takes poverty, suffering, hunger, and cold to be correct, then all the destitute and struggling people on the streets would be immortals. The cultivator of the Way takes virtue and the Dao as the mind, purity as the thought, cutting away deceit and falsehood, greed and reckless action—all dispatched in an instant. Forgetting form and self, one does not fix the mind on things outside the body. Thus it is said: “This skin covering the flesh—what better or worse is there to choose?”\n\nFilling the belly with food—what need to choose between fine and coarse?” One investigates birth and death and takes the refinement of the heart as one’s task, thus paying no heed to the suffering of the body.\n\nSomeone asked: Are there still future retributions of sin and blessing?\nThe Master replied: Let us not speak of the future; consider only the present. When you set your mind to it and wish to burn incense and bow before the sacred, taking the incense in hand, your heart forms a vow: “May my family be safe, may fortune and longevity increase.” This is not the mind that performs good, yet you expect to receive blessing—even if you do receive it, you will not know. For those who cultivate goodness, the cultivation is clear but the recompense is hidden, and thus there is never one who knows. If you conceive an evil thought and take up a knife to kill, the moment this mind arises, you must repay with your life. This cannot be done openly in a place of perfect justice; one waits for the obscure and unfathomable moment to commit the deed, yet before long it is exposed, and you must repay with your life. This is not hoping for sin and receiving sin—this sin is clearly known. For those who do evil, the act is hidden but the retribution is manifest. These are the evident matters of human action; how much more does Heaven observe what people do not know? Where can one flee? One cannot but be cautious.\n\nSomeone asked: Heaven and hell have long been spoken of—are they real?\nThe Master replied: Heaven is the yang realm, governing goodness and blessing; hell is the yin realm, governing evil and misfortune. The ancients established teachings: heaven and hell arise from the human heart. The conduct of the heart responds obscurely. If one is constantly pure and still, benefiting all, practicing all goodness with clarity and without delusion, one belongs to the yang realm. If one commits all manner of evil, scheming and entrapping, following perverse paths, one belongs to the yin realm—ignorance and darkness grow in turn, and filth and defilement all enter the black register. Neither humans nor spirits tolerate it; the sovereign of the heart is vexed, myriad sufferings press in, and no one comes to the rescue—this is hell. As the ancients said: “A clear heart and tranquil mind are the path to heaven; a confused heart and disordered mind are the gate to hell.” It is like a mountain path where one hears rumors of bandits lying in wait to rob and kill travelers. If you believe it and retreat, you will avoid harm; if you do not believe it and proceed drunkenly, should there be no trouble, all is well—but if bandits truly lie in wait, you fall into their trap, and repentance comes too late. The teaching of hell is of this same principle. Generally, doing evil is not like doing good. Even if good brings no reward, what fault is there? Forcing one’s way in evil paths brings calamity. If one does not repent even when the truth is clear before one’s eyes, how can one foresee the hidden and obscure?\n\nSomeone asked: It is said that the supreme matter is complete in every person—why refine it further?\nThe Master replied: The ordinary mind, unrefined, is like white gold within ore—before smelting, it is but a stubborn stone. Placed in the great furnace, impurities are burned away, and the true substance is separated. Once it becomes gold, it is no longer ore. The cultivator is likewise: taking the mind, long obscured and stained, as crude ore, using resolve as the great furnace and wisdom as the smith, diligently refining it until not a trace remains, one smelts forth one’s own originally unimpeded true heart. Once it is true, it is no longer false. One must protect it, guard it firmly, and store it away, thus enjoying its use—this is the priceless, eternally luminous pearl of antiquity.\n\nSomeone asked: When one reaches the state of purity and non-action, has one penetrated through?\nThe Master replied: Speaking in terms of substance, this seems so but is not. As for the true matter, it cannot be spoken, cannot be thought, cannot be known by knowing, cannot be recognized by recognizing. Only when subtlety transcends names and words does it begin to correspond. It neither adheres to movement nor stillness nor departs from them—how can it be fixed as non-action and purity?\n\nSomeone asked: I once heard that Master Danyang attained the Dao swiftly by awakening to death—what is the meaning of this?\nThe Master replied: The cultivator should regard this body as a condemned prisoner being dragged to the execution ground, each step bringing one closer to death. Taking death as one’s thought, one abandons all things. Though sounds, sights, and splendid surroundings encircle one, the eyes see nothing, the ears hear nothing, every thought is forgotten, and even this body is relinquished—how much more all else? Refining the heart in this way, one sees swift attainment, gaining life within death, neither born nor dying. Those newly entering the Dao, seeking to escape birth and death, should hold this thought. Human life is but a moment; if a single breath does not come, one is in the realm of death. Apply the mind urgently, cultivate diligently, dispel the ordinary mind, benefit oneself and others, and rescue one another in turn. One cannot be negligent.\n\nSomeone asked: If the heart is without defilement and one roams freely, following conditions, does this accord with the Dao?\nThe Master replied: To set the mind on being without attachment is to be attached; to have a mind without defilement is to be attached to non-defilement. The moment one desires stillness and concentration, one has already fallen into the root of intention. Following conditions and relying on others still becomes a perverse view. Being without defilement and without attachment are both medicine. When there is no illness, the medicine is removed; if the illness departs but the medicine remains, it ultimately becomes a medicinal illness. Only when the paths of speech and thought are cut off does one arrive home. There is no longer any need to ask about the journey.\n\nThe Master said: The Dao cannot be spoken of; one can only point to good and evil. Goodness completes the supreme, world-transcending cause—there is heaven and no hell. Evil leads to falling into boundless suffering—there is hell and no heaven. These two paths arise from delusion and awakening. In awakening, one becomes a sage in an instant; in delusion, one sinks for endless kalpas. Having fortunately obtained a human body, how can one not reflect?\n\nThe Master said: The paths of the ordinary and the sage are the same; it is only a matter of clarity and obscurity. In clarity, one is a sage; in obscurity, one is ordinary. The heart of the ordinary person is unwilling to carve away emotions and relinquish attachments, to abandon falsity and remove perversity. Drifting with circumstances, turning with passions, seeking momentary pleasure, one accumulates eons of calamity—unaware, unthinking, unenlightened, unawakened.\n\nThe Master said: Those who cultivate the Way must first clarify their own fundamental teaching, then thoroughly understand transformative instruction. If the fundamental teaching is not understood, it is like a person without eyes—unable to distinguish the path, each step erring and faltering. If transformative instruction is not clear, it is like a person with eyes sitting in darkness, then falling into partiality and self-view. One must master both to respond with perfect completeness. If neither is mastered, it is like sitting in great darkness while also being eyeless—when will one ever emerge?\n\nSomeone asked: Daoists often speak of the Golden Elixir—what does this mean?\nThe Master replied: The original true nature is precisely this. As it is swift, sharp, firm, and luminous, transforming and melting all, it is called \"gold.\" Having undergone refinement and tempering, perfectly complete and indestructible for ten thousand kalpas, it is named \"elixir.\" Its substance is like empty space, inwardly and outwardly radiant and translucent, not clinging to the slightest thread, unstained by a single speck of dust, shining brilliantly, illuminating and responding without limit. Thus, the ancestral master said:\n*\"The original true nature is called the Golden Elixir,\nThe four temporal conditions are the furnace that refines it into a sphere.\nUnstained and thought-free, delusions dispelled,\nNaturally it rolls forth to ascend the immortal’s altar.\"*\n\nPeople of the world who speak of the Golden Elixir as something fabricated in form, tied to passions and desires, hold views of hell—these are the deeds of the lewd and deviant. Such views deviate from the human Dao and lead one into the realm of beasts.\n\nThe Master said: Those who study the Dao, in the place where they are untouched by the myriad affairs, unstained by the dust of the senses, and in communion with heaven and earth—here they must thoroughly investigate and penetrate. Then, *\"Before heaven, heaven does not oppose it; after heaven, it follows heaven’s timing. If even heaven does not oppose it, how much less do humans? How much less do ghosts and spirits?\"*\n\nSomeone asked, *\"What is the mysterious and wondrous?\"*\nThe answer came: *\"Who taught you to ask this?\"*\nThe questioner clasped his hands and said, *\"This disciple conceived it himself.\"*\nThe answer came: *\"If so, then you already understand.\"*\nThe questioner laughed and bowed in reverence.\n\nSomeone asked, *\"The past is not to be pursued, the future not to be anticipated—what of the present?\"*\nThe answer came: *\"Extinguish movement but not illumination. Yet you must further comprehend: who is it that extinguishes movement? Once attained, the power rests in your hands—whether to extinguish or not is yours to decide.\"*\n\nSomeone asked, *\"I do not ask of the past or future mind—what is the present mind?\"*\nThe Master looked straight ahead and said, *\"This is not the present.\"*\nThen he lowered his head and said, *\"This is not the present.\"*\nTurning back, he asked, *\"Do you understand?\"*\nThe questioner laughed and said, *\"I do not.\"*\nThe Master replied, *\"With eyes wide open, you fail to grasp even the present—how then speak of past or future?\"*\n\nSomeone asked, *\"What are fortune and misfortune?\"*\nThe answer came: *\"Piling wood makes a forest; piling stones makes a mountain; piling water makes a sea. Piling goodness makes fortune; piling evil makes misfortune. The source of fortune and misfortune lies in the mind alone—only through accumulation do they take form. Can one not be cautious?\"*\n\nSomeone asked, *\"What are good and evil?\"*\nThe answer came: *\"Every kind thought is good; every unbalanced thought is evil. The goodness unknown to others is the greatest good; the evil unknown to others is the greatest evil. Yet where neither good nor evil is contemplated, there lies something beyond.\"*\n\nSomeone asked, *\"Ordinary people fall ill, and Daoists fall ill—what is the difference?\"*\nThe answer came: *\"Long ago, Master Danyang fell ill, yet physicians could not read his pulse. Master Huqiu sat in stillness, yet diviners could not discern his truth. Why? When the mind is not bound to things, creation cannot alter it; when nature does not stray from its source, even ghosts and spirits cannot fathom it—how much less the common arts of medicine or divination? This is how it differs from ordinary people.\"*\n\nThe Master said: *\"Those who cultivate the Dao yet fail to open their true eye or awaken their perfect mechanism merely chase after others’ footprints, measuring words and phrases—all in vain. It is like a blind man hearing others speak of the sun and moon’s light yet never seeing it himself, only imagining. This is because he has not worked upon his own mind.\"*\n\nSomeone asked, *\"In the midst of movement and stillness, how can one be thus?\"*\nThe answer came: *\"When the mind is pure and still, even amid bustling crowds and clamorous markets, if it concerns not oneself, let the world clamor—it is no different from an empty chamber where nothing exists. Yet if in a secluded cell, far from others, one stands as if in a crossroads marketplace, facing the sacred and true without daring to entertain the slightest delusion—then neither movement nor stillness hinders. What further confusion could arise?\"*\n\nSomeone asked, *\"If one harmonizes with the world yet remains unattached to things, how is this so?\"*\nThe answer came: *\"Heaven is heaven, earth is earth, mountains are mountains, waters are waters, things are things, and I am I. Though mingling with all, how can they truly attach?\"*\n\nSomeone asked, *\"All forms and shapes differ—how can they be seen as one?\"*\nThe answer came: *\"Heaven is the Dao, earth is the Dao, the myriad things are the Dao. That is the Dao, this is the Dao. Though forms vary, the Dao is everywhere present—how can they not be one?\"*\n\nSomeone asked, *\"People seek joy, yet Daoists embrace hardship—why?\"*\nThe answer came: *\"Worldly people know not true joy. They take what pleases the heart as joy, yet desire leads them into suffering, mistaking it for joy. Daily, they scheme and calculate, seeking worldly pleasures. When unfulfilled, they are beset by sorrow and disturbance, their spirits never at ease—this is the greatest suffering. Those who study the Dao do not seek worldly joy. Their minds abide in the great Dao, encountering hardship without suffering. Without suffering, there is constant joy, and the heart attains freedom. Where there is joy, there is suffering; without joy, there is no suffering. A mind free of both joy and suffering—this is true joy.\"*\n\nSomeone asked, *\"How can one transcend the causes of sin and fortune?\"*\nThe answer came: *\"Sin and fortune belong to the shell of yin and yang. If you step beyond this shell, then there is no sin or fortune. What is the shell of yin and yang? Whenever the slightest selfish, perverse, covetous, or malevolent thought arises in the mind, it belongs to the yin shell. Even the slightest good thought belongs to the yang shell. Within yin, there is retribution for evil; within yang, there is reward for good. But if one has refined the mind until it is like empty space—neither good nor evil, without the slightest entanglement, and master of oneself—then fortune and misfortune cannot touch them, and cause and effect cannot sway them. This is one who has stepped beyond the shell of yin and yang. Laypeople, never harboring a single good thought, spend their days scheming for wealth and profit, living at others’ expense, deceiving and entrapping—all is a single mass of dark, ignorant karma. They remain trapped within the shell of yin and yang, unable even to tread the yang path—how then could they step beyond it? If you seek to be free of sin and fortune, free of cause and effect, is it not difficult? You have forged this yourself—how can you escape?\"*\n\nThus, bow your head and close your eyes—let Old Yan* attend to it.\n\nSomeone asked: What truly becomes of the matter of future rebirth?\nThe answer: A human life, shaped by its own passions, forges the mold for its next existence. Those who do good create a mold of goodness; those who do evil create a mold of evil. When this karmic body is spent and the one nature departs this shell, it is like iron smelted into molten gold—poured by the Creator into the self-made mold, becoming human or beast, each reaping what it has sown. Does the Creator intend for you to become a beast? Does it intend for you to enter the Six Paths? No—it is the shell you have forged in this life that traps you, inescapably. Where this nature goes, so follows its form: the cruel become serpents, the miserly become dogs, the lustful and murderous become swine, the greedy and violent become wolves—all generally follow this pattern. Between heaven and earth, the myriad forms and shapes are beyond enumeration, each self-made and self-endured. Thus the ancients said: *\"Associate with metal and stone, and you become metal and stone; associate with water and fire, and you become water and fire.\"* Their words are true. In an instant, one loses the human form, and for ten thousand kalpas it is not regained. Why not reflect on this?\n\nSomeone asked: I am now old and cannot study much—pray, Master, speak a word of the utmost mystery and wonder.\nThe answer: Cast aside your search for the utmost mystery and wonder, and that is it.\n\nSomeone asked: The teachings of the world each claim their own truth, distinguishing right from wrong, orthodoxy from heterodoxy—how can one know which is true?\nThe answer: There are two paths: one of cultivation, and one of worldly engagement. Those who cultivate make this mind as clear and still as heaven and earth, as bright as the sun and moon, as ceaselessly transforming as the four seasons. They respond to affairs yet return to their root—ask not what lies beyond, for this is the very functioning of the true Dao. Only those who cultivate can achieve this. As for those who recite scriptures with their lips, adorn the Dharma-body with fine trappings, and present themselves as pleasing figures to win others’ admiration—these are but the branches, flowers, and leaves of the teaching, used for worldly engagement. What do they have to do with cultivation? What do they have to do with the true Dao? They are but temporary expedients. Moreover, if their hearts are filled with strife—over self and others, wealth and profit—no different from the common folk, how can they claim to represent the true teaching? Let those with clear eyes see this.\n\n---\n*[Note: \"Old Yan\" (阎老) refers to Yanluo Wang (閻羅王), the judge of the underworld in Chinese mythology.] (Omitted in final output as per guidelines.)",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "栖云真人王志谨盘山语录 序 夫瞽者无以与乎青黄之色，聋者无以与乎管钥之音，岂惟形骸有如此哉？ 而心智亦有之。 若夫本分天真，人皆具足，奈以积尘所昧，正眼不明，逐色随声，寻踪觅迹，沉沦恶道，浩劫千生，摸竹管为阳光，击铜盘为日影，不逢宗匠，皂白奚分？ 殢句执文，转增迷惑，是以栖云老师不得已应病施药，剔耳挑聋，摩晴刮翳，冀得人人彻视，各各开聪，见见闻闻，洒洒落落，咸归正道，不逐亡羊也。 门下刘公先生从师有年，密记老师之謦欬，裒以成集，约百余则，诚为初机学道者之指南也。 命工锓榇，以广其传。 孤峰道人亦得与其徒末。 行者见而喜之，乃斋沐而敬，为之题辞。 时丁未正月元日门人论志焕谨序 时师在盘山普说云：大凡初机学道之人，若便向言不得处，理会无着落、没依倚，必生疑惑，为心上没工夫便信不及，信不及则必不能行，行不得则胡学乱学，久而退怠。 今且说与汝等眼前见得底、耳里听得底、信得及处行去，从粗入妙，亦不误汝，虽是声色，便是道之用也。 如何是信得及处？ 汝岂不见许大虚空及天地日月山水风云，此不是眼前分明见得底？ 便是修行底榜样，便是入道底门户也。 且如云之出山，无心往来，飘飘自在，境上物上挂他不住，道人之心亦当如此。 又如风之鼓动，吹嘘万物，忽往忽来，略无凝滞，不留影迹，草木丛林碍他不住，划然过去，道人之心亦当如此。 又如大山，巍巍峨峨，稳稳当当，不摇不动，一切物来触他不得，道人之心亦当如此。 又如水之为物，性柔就下，利益群品，不与物竞，随方就圆，本性澄淡，至于积成江海，容纳百川，不分彼此，鱼鳖虾蟹尽数包容，道人之心亦当如此。 又如日月，容光必照，公而无私，明白四达，昼夜不昧，晃朗无边，道人之心亦当如此。 又如天之在上，其体常清，清而能容，无所不覆，于彼万有，利而不害，道人之心亦当如此。 又如地之在下，其体常静，寂然不动，负荷万物，无党无偏，道人之心亦当如此。 又如虚空广大，无有边际，无所不容，无所不包，有识无情，天盖地载，包而不辨，非动非静，不有不无，不即万事，不离万事，有天之清，有地之静，有日月之明，有万物之变化，虚空一如也，道人之心亦当如此。 道同天地，其用若此，体在其中，工夫到日，自然会得，动用合道，自有主者。 若便觅言思路绝处，则失之矣。 既入玄门，各宜勉之。 或问曰：初学人修炼心地，如何入门？ 答云：把从来恩爱眷恋、图谋计较、前思后算、坑人陷人底心，一刀两断去，又把所着底酒色财气、是非人我、攀缘爱念、私心邪心、利心欲心，一一罢尽，外无所累则身轻快，内无染着则心轻快，久久纯熟，自无妄念，更时时刻刻护持照顾，慎言语，节饮食，省睡眠，表里相助，尘垢净尽，一物不留，他时自然显露自己本命元神，受用自在，便是个无上道人也。 或问曰：修行之人如何得清静？ 答云：心不逐物谓之安心，心不受物谓之虚心，心安而虚便是清静，清静便是道也。 或问曰：修行人多说除情去欲，此以上更有甚么？ 答云：除了情，到无情，除了欲，到无欲； 无情无欲底，则汝道这个是甚么？",
      "translated_text": "**Preface to *Recorded Sayings of Perfected One Qiyun, Wang Zhijin, at Mount Pan***\n\nThe blind cannot partake of the colors green and yellow, nor can the deaf share in the sounds of pipes and chimes. Is this affliction confined to the body alone? Nay, the mind and intellect suffer likewise. Though the original, Heaven-endowed truth is complete in all, it is obscured by accumulated dust, leaving the true eye unseeing. Chasing after forms and sounds, tracing footprints and tracks, one sinks into evil destinies, passing through a thousand kalpas of rebirth. Mistaking bamboo flutes for sunlight, striking bronze basins for the sun’s reflection—without encountering a true master, how can black and white be distinguished? Clinging to phrases and grasping at texts only deepens confusion. Thus, Master Qiyun, unable to bear this, administered medicine for the affliction, clearing ears and prying open deafness, polishing eyes and scraping away cataracts, hoping that all might see clearly and each awaken to understanding. In seeing and hearing, may they be free and unburdened, all returning to the true Way, no longer chasing the lost sheep.\n\nMaster Liu, a disciple of long standing, secretly recorded the master’s every word and sigh, compiling them into a collection of over a hundred entries—truly a guide for beginners on the path of the Dao. He commissioned craftsmen to carve the woodblocks, that its transmission might be broadened. This humble Daoist of Gufeng Peak, though but a latecomer among his disciples, upon seeing this work, rejoiced. With reverence, he purified himself and composed this preface.\n\n**Recorded at Mount Pan on the First Day of the First Month, Dingwei Year**\n*Disciple Lun Zhihuan respectfully inscribes*\n\n---\n\nAt that time, the master expounded at Mount Pan:\n\nFor beginners on the path of the Dao, if one immediately seeks what lies beyond words, understanding will find no foothold, no reliance, and doubt will surely arise. With no effort in the heart, faith will falter; without faith, there can be no practice; without practice, one strays into reckless learning, and over time, grows weary and retreats. Now, I shall speak to you of what lies before your eyes, what fills your ears—what you can believe and practice. Proceeding from the coarse to the subtle will not lead you astray. Though these are but sounds and forms, they are the very functioning of the Dao.\n\nWhat, then, is something you can believe? Do you not see the vast emptiness, the heavens and earth, the sun and moon, mountains and rivers, wind and clouds? Are these not clearly before your eyes? They are the models for cultivation, the gates to entering the Dao.\n\nConsider the clouds emerging from the mountains: they come and go without intent, drifting freely. Nothing in the realm of objects can cling to them—so too should the heart of the Dao-practitioner be. Or the wind stirring all things: it blows now here, now there, utterly without stagnation, leaving no trace. Neither grasses nor forests can obstruct it; it passes through with a single sweep—so too should the heart of the Dao-practitioner be. Or the great mountains: towering and majestic, steadfast and unshaken. No thing can touch them—so too should the heart of the Dao-practitioner be. Or water: by nature soft and flowing downward, benefiting all beings without contention, conforming to square or round, its essence clear and tranquil. When it gathers into rivers and seas, it embraces the hundred streams without distinction, containing fish, turtles, shrimp, and crabs alike—so too should the heart of the Dao-practitioner be. Or the sun and moon: their radiance shines without partiality, illuminating all four directions, bright day and night, boundless in clarity—so too should the heart of the Dao-practitioner be. Or the heavens above: their substance is ever pure, pure yet all-embracing, covering all without exception. Toward the ten thousand existences, they bring benefit without harm—so too should the heart of the Dao-practitioner be. Or the earth below: its substance is ever still, motionless and silent, bearing the weight of all things without favor or bias—so too should the heart of the Dao-practitioner be. Or the vastness of empty space: boundless, containing all, embracing all, whether sentient or insentient, covering heaven and supporting earth. It encompasses without discrimination, neither moving nor still, neither being nor non-being, neither identical to nor separate from the ten thousand things. It possesses the clarity of heaven, the stillness of earth, the brightness of sun and moon, and the transformations of the ten thousand things—yet empty space remains one and the same. So too should the heart of the Dao-practitioner be.\n\nThe Dao is one with heaven and earth; its functioning is thus. Its essence lies within. When effort is perfected, understanding arises naturally. In activity and repose, it accords with the Dao, and there is always one who presides. If one seeks only the place where words and thoughts cease, one has already missed it. Having entered the mysterious gate, each must strive diligently.\n\n---\n\nSomeone asked: How does a beginner cultivate the heart-ground and enter the gate?\n\nThe master replied: Sever with a single stroke all the hearts of affection and attachment, scheming and calculation, forethought and afterthought, deception and entrapment. Abandon entirely the attachments to wine, lust, wealth, and temper; to right and wrong, self and others; to clinging and craving, private and perverse thoughts, desire for gain and sensual pleasure. Externally unburdened, the body becomes light and free; internally unstained, the heart becomes light and free. With long and thorough practice, deluded thoughts will naturally cease. Ever vigilant, guard and attend to it: be cautious in speech, moderate in eating and drinking, reduce sleep. Inner and outer assist one another. When the dust and grime are entirely cleansed, leaving not a single thing behind, in time your original life-spirit will naturally manifest, and you will enjoy freedom—this is the supreme Dao-practitioner.\n\nSomeone asked: How does one attain purity and stillness in cultivation?\n\nThe master replied: The heart not chasing after things is called a settled heart; the heart not receiving things is called an empty heart. A heart that is settled and empty is pure and still—purity and stillness are the Dao itself.\n\nSomeone asked: Cultivators often speak of eliminating emotions and desires. What lies beyond these?\n\nThe master replied: Eliminate emotions, and you arrive at non-emotion; eliminate desires, and you arrive at non-desire. Beyond non-emotion and non-desire—what, then, is *this*?",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1228,
      "start_sentence": 0,
      "end_sentence": 33,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.54952645301819,
      "metadata": {
        "source_file": "dao\\藏外\\栖云真人王志谨盘山语录.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "或问曰：修行人头头要不昧，如何得不昧？ 答云：初心未炼，出入不知，不会收纵，遇境遇物，一向着将去，颟顸模糊，只待困了方休。 不明自己，便是昧了也，便与托生底一般，不知不觉透在别个壳子内，只待报尽方回，此为昧了故也。 若专用知用觉，又被知觉昧了也。 修行人若于二六时中点检自己，不被一切尘情玷污，境上物上轻快过去，便是不昧也。 或问曰：性命之事如何护持？ 答云：若在万尘境界内来去滚缠，虽相应和，要自作得主，不一向逐他去，事不碍心，心不碍事，如护眼睛，但有纤尘，合眼不受，如此保护，久久见功。 但心有受，即被他物引将去也，便作主不得。 或问曰：某念念相续，扫除不尽，如何即是？ 答云：朝日扫心地，扫着越不静，欲要心地静，撇下苕帚柄。 其人拜谢。 或问曰：自来修行之人必先立志，如何立志？ 答云：每在动处静处，一切境界里，行住坐卧，念念在道，逢魔不变，遇害不迁，安稳处亦如此，巇崄处亦如此，拼此一身，更无回顾，精进直前，生死不惧，便是个有志底人，故经云：“强行者有志。 ” 师到南宫，于长真观夜坐，对众普说云：初心出家，未能独立，须仗丛林，或结道伴，递相扶持，不至偏颇。 然有三等，有云朋霞友，有良朋知友，有狂朋怪友。 凡有志节，炼心地，究罪福，绝尘情，逍遥方外，同志相求，遂为笃友，此等谓之云朋霞友也，以其心与云霞相似，尘事碍他不住故也； 又有习学经教，琴书吟咏，高谈阔论，褒贬是非，此等谓之良朋知友，以其虽不炼心，亦不作恶故也； 又有一等，不治心地，不看经典，不顾罪福，出语乖讹，作事狂荡，触着一毛，便起争斗，夸强逞俊，恃力持胜，欺压良善，相率成党，此等谓之狂朋怪友。 此三等人身谢之后，各有安置去处，随其功业，各得受报：其云朋霞友，升入无形，游宴玉京，或为神仙，或为天官； 其良朋知友，尘心未尽，不出人伦，往复受报； 其狂朋怪友，受了十方供养，全无功德，填还口债，或堕酆都，或堕旁生，轮回苦趣，若到如斯，悔之何及？ 聪明达人，细细思之，各寻长便。 或问曰：学人如何是觉性？ 答云：指东画西，这般虚头且休，不如下些实工夫去，谓如心上有底、眼前见底、情欲烦恼、人我无明等，喻似面前有一眼大琉璃滑井，若丝毫不照顾，便堕在里面，万劫不得出； 若先见又识破，方欲下脚，急须退步，则这个急退步照顾底，便是汝觉性也。 若分明堕在人我阱里，犹自指空画空，说向上事如何，干甚觉性事？ 或问曰：如何是定性？ 师乃移位近前，正身默坐，良久云：汝问甚么定性？ 其人不省，旁有先生起而稽首谢之。 师云：张公吃酒李公醉。 其人大笑不已。 或问曰：学人本为生死事大，求之不明，以至狂荡，其意如何？ 答云：一念无生即无死也。 不能如此者，盖为心上有情，性上有尘，情尘般弄，生死不停。 欲求解脱，随遇即遣，遣之又遣，以至丝毫不存，本源清净，不逐声，不逐色，随处自在，虚静潇洒，天长地久，自明真宰。 盖心正则事事正，心邪则事事邪，内既有主，则人爱底不爱，人嫌底不嫌，从来旧习般般勒转，六识既空，真宰常静，更有何生死可惧？",
      "translated_text": "Someone asked: A cultivator must remain unwavering in every moment—how can one achieve this unwavering state?\n\nThe master replied: In the beginning, when the heart is untrained, one drifts in and out without awareness, unable to gather or release. When encountering circumstances or things, one clings to them entirely, muddled and confused, only ceasing when utterly exhausted. Failing to recognize oneself is to be in darkness—no different from those reborn in ignorance, slipping unknowingly into another shell, only to return when their karma is exhausted. This is the result of being in darkness. Yet if one relies solely on knowledge and awareness, one is obscured by that very knowledge and awareness. If a cultivator examines themselves in every moment of the day and night, untarnished by worldly dust and emotions, gliding lightly past circumstances and things, this is the unwavering state.\n\nSomeone asked: How does one safeguard the matters of nature and life?\n\nThe master replied: Even when moving through the myriad dusty realms, though one may harmonize with them, one must remain the master, not blindly following their course. Let affairs not obstruct the heart, nor the heart obstruct affairs. Guard it like the eye—if even the finest speck of dust appears, close the eye and refuse it. Protect it thus, and over time, results will manifest. But if the heart receives anything, it is led away by external things, and one can no longer be the master.\n\nSomeone asked: My thoughts follow one after another, and I cannot sweep them away—what should I do?\n\nThe master replied:\n*Day after day, sweeping the heart’s ground,*\n*Sweeping only stirs more unrest.*\n*If you wish the heart’s ground to be still,*\n*Lay down the broom’s handle.*\n\nThe questioner bowed in gratitude.\n\nSomeone asked: Those who cultivate must first establish resolve—how does one establish resolve?\n\nThe master replied: In every moment, whether in movement or stillness, amid all circumstances, in walking, standing, sitting, or lying down, let your thoughts rest in the Dao. Unshaken by demons, unmoved by harm, whether in ease or peril, remain thus. Devote this body without hesitation, advancing with unyielding diligence, unafraid of life or death—this is a person of resolve. Thus the sutra says: *\"The strong in practice have resolve.\"*\n\nThe master arrived at Nangong and, sitting one night at Changzhen Abbey, addressed the assembly: Those who leave home in the beginning, unable to stand alone, must rely on the monastic community or form bonds with fellow cultivators, supporting one another to avoid bias. Yet there are three kinds of companions: cloud friends and mist companions, good friends and wise friends, and wild friends and strange friends.\n\nThose of noble character, who refine their hearts, investigate karma, sever worldly attachments, and roam beyond the mundane, seeking like-minded companions—these are called cloud friends and mist companions, for their hearts resemble clouds and mist, untouched by worldly affairs. Others study scriptures, play the qin, recite poetry, engage in lofty discussions, and debate right and wrong—these are called good friends and wise friends, for though they do not refine their hearts, they also do no evil. Then there are those who neither cultivate their hearts nor study the classics, heedless of karma. Their words are perverse, their actions reckless. At the slightest provocation, they start quarrels, boast of their strength, flaunt their cunning, bully the good, and form cliques—these are called wild friends and strange friends.\n\nAfter these three kinds of people pass away, each is placed according to their deeds and receives their due retribution: The cloud friends and mist companions ascend into the formless, roaming the Jade Capital, becoming immortals or celestial officials. The good friends and wise friends, their worldly hearts not yet exhausted, remain within the human realm, cycling through rebirths. The wild friends and strange friends, having received offerings from all directions yet lacking merit, must repay their debts—some fall into Fengdu, others into the realm of beasts, trapped in the suffering of samsara. When it comes to this, what use is regret? Those of wisdom and discernment should ponder this carefully and seek the most advantageous path.\n\nSomeone asked: What is the awakened nature?\n\nThe master replied: Pointing east and drawing west—set aside such empty gestures. Better to apply real effort. For example, whatever lingers in the heart, whatever appears before the eyes—emotional desires, afflictions, the illusion of self and others—is like a vast, slick well of glass before you. If you do not guard against it in the slightest, you will fall in and remain trapped for ten thousand kalpas. But if you see it clearly and recognize its nature, then as you are about to step forward, swiftly retreat—this very act of swift retreat and vigilance is your awakened nature. If you have clearly fallen into the pit of self and others yet still point to the empty sky and speak of transcendent matters, what has this to do with awakened nature?\n\nSomeone asked: What is the stabilized nature?\n\nThe master shifted his seat forward, sat upright in silence, and after a long while said: What stabilized nature are you asking about?\n\nThe questioner did not understand. Another master present rose, bowed, and expressed gratitude. The master said: *Zhang drinks the wine, but Li gets drunk.* The questioner laughed heartily.\n\nSomeone asked: I cultivate primarily for the great matter of life and death, yet my seeking remains unclear, leading to recklessness—what is the meaning of this?\n\nThe master replied: A single thought of non-arising is non-dying. Those who cannot achieve this do so because their hearts are entangled in emotions and their natures are stained with dust. As emotions and dust play their games, life and death never cease. To seek liberation, let go of whatever arises, letting go again and again until not a trace remains. The original source is pure—unmoved by sounds, unmoved by forms, at ease wherever you are, empty and carefree, enduring as heaven and earth, the true master naturally revealed.\n\nFor when the heart is upright, all affairs are upright; when the heart is crooked, all affairs are crooked. With mastery within, what others love, you do not love; what others dislike, you do not dislike. Every old habit is gradually turned around. The six senses emptied, the true master abides in stillness—what fear of life and death remains?",
      "overlap_context": " replied: The heart not chasing after things is called a settled heart; the heart not receiving things is called an empty heart. A heart that is settled and empty is pure and still—purity and stillness are the Dao itself.\n\nSomeone asked: Cultivators often speak of eliminating emotions and desires. What lies beyond these?\n\nThe master replied: Eliminate emotions, and you arrive at non-emotion; eliminate desires, and you arrive at non-desire. Beyond non-emotion and non-desire—what, then, is *this*?",
      "start_char": 1230,
      "end_char": 2467,
      "start_sentence": 34,
      "end_sentence": 70,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.378166675567627,
      "metadata": {
        "source_file": "dao\\藏外\\栖云真人王志谨盘山语录.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "若到如此田地，却又一向没收没拾，藏伏不住，似着邪着祟底一般，向外驰骋，狂狂荡荡，便是神气散乱，作主不得，便认作真欢真乐，学古人行歌立舞，殊不知古人当时亦是解粘释缚，别有得处，以此自乐，岂肯纵心颠蹶以诳惑世人哉？ 却不知无欢之欢乃真欢也，无乐之乐乃真乐也，无知之知乃真知也； 今为识神所搬，邪气入心，以至狂荡，无药可疗也。 或问曰：开眼有尘境，合眼有梦境，众中有逆顺境，如何得安稳去？ 答曰：修行人收心为本，逢着逆境，欢喜过去； 遇着顺境，无心过去； 一切尘境，干己甚事？ 凡在众中，虽三岁小童，不敢逆着，不敢触犯着，常时饶着； 一切人逆着自己，触犯自己，常是忍着； 忍过饶过，自有功课。 一切人皆敬者，一切难处自承当者，久久应过，心境纯熟，在处安稳，一切境界里平常过去，更无动心处，向诸境万缘里，心得安稳，更不沾一尘，净洒洒地，昼夜不昧，便合圣贤心也。 或问曰：识得一，万事毕，又有云：抱元守一，一者是甚么？ 师云：乃是混成之性，无分别之时也。 既知有此，即堕于数，则不能一矣。 一便生二，二便生三，三生万物，如何守得？ 不若和一也无。 故祖师云：“抱元守一是功夫，地久天长一也无。 ”向这个一也无处明出自己本分来，却不无也。 故经云：“知空不空，知色不色，名为照了。 ” 或问曰：出家人有学古人公案者，有学经书者，有云古教中照心，是否？ 师云：修行人本炼自心，从凡入圣，出家以来，却不肯以此为事，只向他古人言句里搜寻，纸上文字里作活计，寻行数墨，葛藤自缠，费尽工夫，济甚么事？ 及至阎老来唤，一句也使不得，一字也使不得，却不如百事不知、懵懂过日底却有些似。 把如今着恁寻趁底工夫，向自己本分事上寻趁，则不到得虚度时光。 如何是自己本分事？ 只这主张形骸底一点灵明，从道里禀受得来，自古及今，清净常然，更嫌少甚？ 自澄理得明白，便是超凡入圣底凭据。 若信得及，便截日下功理会去，自家亦有如此公案，便数他人珍宝作甚么？ 快便自受用去，管取今以后不被人瞒也。 师因有作务，普说云：昔东堂下有张仙者，善能木工，不曾逆人，谦卑柔顺，未尝见怒形于色。 众皆许可而常赞叹，遂闻于真人。 真人曰：未也，试过则可，喻如黄金，未曾炼过，不见真伪。 一日令造坐榻，其人应声而作，工未毕，又令作门窗，亦姑随之，已有慢意，工未及半，又令作匣子数个，其人便不肯，遂于真人前辩证，欲了却一事更作一事。 真人乃云：前因众人许汝能应人不逆，未曾动心，今日却试脱也。 修行之人，至如炼心应事，内先有主，自在安和，外应于事，百发百中，何者为先，何者为后，从紧处应，粉骨碎身，惟心莫动。 至如先作这一件又如何？ 先作那一件又如何？",
      "translated_text": "When one reaches such a state, yet fails to gather and stabilize, unable to contain or conceal, drifting outward like one possessed by spirits or demons—racing wildly, unbridled and reckless—this is the scattering of spirit and qi, losing mastery over oneself. Taking this as true joy, true delight, one mimics the ancients by singing and dancing in the streets, unaware that the ancients, too, once untangled their bonds and found liberation elsewhere, delighting in that alone. How could they have indulged their minds in frantic folly to deceive the world?\n\nYet they did not know that joy without joy is true joy, delight without delight is true delight, and knowing without knowing is true knowing. Now, swept away by the discriminating mind, with perverse qi invading the heart, one falls into madness and dissipation—no remedy remains.\n\nSomeone asked: With eyes open, there are dusty realms; with eyes closed, dream realms; in crowds, realms of adversity and favor—how can one find stability?\n\nThe master replied: For the practitioner, gathering the heart is fundamental. When adversity arises, pass through it with joy; when favor arises, pass through it without attachment. What do these dusty realms have to do with you? Among others, even a three-year-old child should not be opposed or offended—always yield to them. When others oppose or offend you, always endure it. Enduring and yielding, the work is naturally accomplished. When all people show respect, when all difficulties are borne by oneself, over time, as the heart and circumstances become pure and familiar, one finds stability everywhere. All realms pass by as ordinary, with no stirring of the heart. Amidst the ten thousand conditions, the heart rests in peace, untouched by even a speck of dust—pure and free, unwavering day and night. This accords with the hearts of sages and worthies.\n\nSomeone asked: \"To know the One is to complete all things,\" and yet it is also said: \"Embrace the primordial and guard the One.\" What is this One?\n\nThe master said: It is the undifferentiated nature, the state without discrimination. Once you know of its existence, you fall into enumeration and can no longer be one. One gives rise to two, two to three, and three to the ten thousand things—how can it be guarded? It is better to be without even the One. Thus, the ancestral master said: \"Embracing the primordial and guarding the One is effort—yet in the enduring vastness, there is not even a One.\" From this place of not even a One, one illuminates one’s own fundamental nature—how could it be nothing?\n\nThus, the sutra says: \"To know emptiness as not empty, to know form as not form—this is called illumination.\"\n\nSomeone asked: Among those who leave the household life, some study the ancients’ cases, some study scriptures, and some say that the ancient teachings illuminate the heart—is this correct?\n\nThe master said: The practitioner’s work is to refine the heart, to ascend from the ordinary to the sacred. Yet since leaving the household, they have not made this their task, instead searching through the words of the ancients, making a livelihood from ink and paper, counting lines and tallying characters, entangling themselves in vines of discourse. They exhaust all effort—what good does it do? When King Yama comes to call, not a single phrase, not a single word will serve. They would have been better off passing their days in ignorance. Take the effort now spent in such pursuits and direct it toward one’s own fundamental work—then time will not be wasted in vain.\n\nWhat is one’s own fundamental work? It is this single point of luminous clarity that governs the body, received from the Dao, pristine and constant from ancient times to the present—what more could one desire? When one clarifies and understands this principle, it becomes the warrant for transcending the ordinary and entering the sacred. If you trust this, begin at once to work on it. You, too, have such a case—why count others’ treasures? Quickly make use of it yourself, and from now on, you will not be deceived by others.\n\nOnce, while the master was engaged in labor, he gave a general discourse: Long ago, beneath the Eastern Hall, there was a man named Zhang Xian who was skilled in carpentry. He never opposed others, was humble and yielding, and never showed anger in his expression. The assembly all approved and constantly praised him, and word reached the Perfected One. The Perfected One said: Not yet. Let us test him first—like gold that has not been refined, its authenticity is unknown.\n\nOne day, he was ordered to make a meditation bench. The man assented and began the work. Before it was finished, he was ordered to make doors and windows, and he provisionally complied. Already, a hint of impatience arose. Before half the work was done, he was ordered to make several boxes. The man refused and argued before the Perfected One, insisting on completing one task before starting another.\n\nThe Perfected One then said: Previously, everyone praised you for being able to respond to others without opposition, never losing your composure. Today, the test has revealed the truth. For the practitioner, refining the heart in response to circumstances is paramount. With inner mastery, one is at ease and harmonious; outwardly, one responds to affairs with perfect accuracy. What is urgent, what can wait—one acts from what is most pressing, even if it means grinding one’s bones to dust, yet the heart remains unmoved. What difference does it make whether this task or that is done first?",
      "overlap_context": "pure—unmoved by sounds, unmoved by forms, at ease wherever you are, empty and carefree, enduring as heaven and earth, the true master naturally revealed.\n\nFor when the heart is upright, all affairs are upright; when the heart is crooked, all affairs are crooked. With mastery within, what others love, you do not love; what others dislike, you do not dislike. Every old habit is gradually turned around. The six senses emptied, the true master abides in stillness—what fear of life and death remains?",
      "start_char": 2467,
      "end_char": 3543,
      "start_sentence": 71,
      "end_sentence": 107,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 27.026943683624268,
      "metadata": {
        "source_file": "dao\\藏外\\栖云真人王志谨盘山语录.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "俱是假物，有甚定体？ 心要死，机要活，只据目前紧处应将去，平平稳稳，不动不昧，此所谓“常应常静”也。 或问曰：有人云：业通三世果，有否？ 答云：岂不闻古人有言：“了即业障本来空，未了应须还宿债。 ”昔有人背生恶疮，痛不可忍，脓血交流，寻无人处自缢而死。 似此之人，自己性分又不了，又不肯承当宿世脓血债负，虽自致死，再出头来亦要偿他。 何以知此为宿业耶？ 昔有一显官，不欲言其姓名，但道因果足矣，其性酷虐，但心不喜，即捶挞随从奴仆。 一日坐尻上忽生痒痛，搔之则去皮，渐次血肉分裂，如新拷掠者，痛不可加，以致命终，以是知脓血债负必然还报。 岂止此事，乃至大小喜怒毁谤打骂是非、见面相嫌，皆是前因所结旧冤现世要还，须当欢喜承受，不敢辩证，承当忍耐，便是还讫； 但有争竞，便是抵债不还，积累更深，冤冤重结，永无了期。 况复天意好还，乃至人间恩怨相伤，无非冤债。 昔长春真人住长春观日，忽值大兵北还，远藏匿以避，逢一贵宦，与真人素相识者，家世奉道，自言夫人被虏，欲罄家资赎令出家，拜问真人，真人侻然不可。 其事议间，兵去已远。 他日贵宦且询不可之意，真人曰：夫人与昨虏之人有三年宿债，今既相对，乃前缘也，三年后却还来此出家。 后果三年放还，得簪裳出家，来诣长春观参见真人，以从来奉善，却得入道。 贵宦方信，拜谢不已。 师因一道人有病，普说云：修行之人，饮食有节，动静有常，心神安泰，别无妄作，偶然得病，便是天命，岂敢不受？ 亦是自己运数之行，或因宿缘有此病魔。 先要识破这个四大一一是假，病则教他病，死则教他死，心意宁耐，从他变化，心不在病，重病即轻，轻病自愈，自性安和，浊恶气散，亦是还了病债，亦是冲过一重关节。 若不解此，心必不安，但有病患，心即狂乱，声唤不止，叫疼叫痛，怨天恨地，又怨人不扶持，恨人不求医，嗔人不合药，责人不问候，一向专起无明黑暗业心，见底无有是处，不知自己生死已有定数，假饶慞惶，还免得么？ 分外心乱，不自安稳。 又不知心是身之主人，主人不宁，遍身皆乱，岂不闻古人云：“心慌意乱，地狱之门”，分外招愆。 如此处心，轻病即重，重病即死，为浊乱其性故也。 若事事不节，过分成病，是病因自作，自作自受，更怨他谁？ 心地下功者，必不如此。 各请思之。",
      "translated_text": "All are but transient things—what fixed essence do they possess? The heart must die, the mechanism must live; simply respond to what is most pressing in the moment, calmly and steadily, unmoved and unobscured. This is what is meant by \"constantly responding, constantly still.\"\n\nSomeone asked: \"There are those who say that karmic retribution spans three lifetimes—is this true?\"\nThe answer: \"Have you not heard the ancient saying: *'When enlightened, karmic obstacles are fundamentally empty; when unenlightened, one must repay past debts.'* Once, a man bore malignant sores so agonizing that pus and blood flowed unceasingly. Unable to endure, he sought a secluded place and hanged himself. Such a person, neither having understood his own nature nor willing to bear the debt of pus and blood from a past life, though he brought about his own death, would still have to repay it in his next existence. How do we know this was past karma? There was once a high official—whose name need not be mentioned, for the law of cause and effect suffices—whose nature was cruel and tyrannical. Whenever displeased, he would beat his attendants and servants. One day, he suddenly felt an itching pain on his buttocks; scratching it only tore the skin, and gradually, flesh split open as if freshly flogged, the pain unbearable until he died. Thus, we know that debts of pus and blood must inevitably be repaid. Not only this, but even minor matters—joy and anger, slander and praise, blows and scoldings, right and wrong, aversion upon meeting—all are old karmic entanglements from past causes, now demanding repayment in this life. One must accept them gladly, without protest, enduring with patience; only then is the debt repaid. If one contests, it is like refusing to settle a debt, deepening the accumulation, binding the karmic knot ever tighter, with no end in sight. Moreover, Heaven favors repayment; even the grievances and injuries between people are nothing but karmic debts.\n\nOnce, when the Perfected One Changchun resided at Changchun Abbey, a great army suddenly returned from the north. He hid in the distance to avoid them but encountered a nobleman he knew well, whose family had long practiced the Dao. The nobleman said his wife had been captured and that he wished to exhaust his family’s wealth to ransom her and let her leave the world. He sought the Perfected One’s counsel, but Changchun flatly refused. By the time the matter was discussed, the army had already moved far away. Later, the nobleman asked why he had refused. The Perfected One said: 'Your wife and her captor share a three-year karmic debt. Now that they have met, it is their past affinity. In three years, she will return here to leave the world.' Indeed, three years later, she was released, took up the hairpin and robe, and came to Changchun Abbey to pay respects to the Perfected One. Through her lifelong practice of goodness, she was able to enter the Dao. Only then did the nobleman believe and bow in gratitude without end.\n\nThe Master, seeing a Daoist practitioner ill, expounded: 'For those who cultivate the Way, eating and drinking are measured, movement and stillness are regular, the heart and spirit are at peace, and there is no reckless action. If illness arises by chance, it is Heaven’s decree—how could one dare refuse it? It is also the unfolding of one’s own fate, or perhaps a karmic affliction from past causes. First, one must see through the four great elements as illusory. If sick, let it be sick; if dying, let it be dying. The heart remains patient and enduring, allowing transformations to take their course. If the mind is not fixed on illness, severe illness lightens, and mild illness heals on its own. With the inherent nature at peace, turbid and noxious qi disperse. This is repaying the debt of illness, passing through another barrier. If one does not understand this, the heart will be unsettled. At the slightest ailment, the mind becomes frantic, wailing ceaselessly, crying out in pain, cursing Heaven and Earth, resenting others for not supporting, blaming them for not seeking a physician, scolding them for not preparing medicine, reproaching them for not inquiring after one’s health. All the while, the dark karma of ignorance arises, leaving no rightful path. One forgets that life and death are already determined—what use is panic? The heart grows even more disturbed, unable to find peace. Moreover, one does not realize that the heart is the master of the body. If the master is not at ease, the whole body falls into chaos. Have you not heard the ancient saying: *'A flustered heart and scattered mind are the gates to hell'*? Such a state invites transgressions. In this way, mild illness turns severe, and severe illness leads to death, for one’s nature is clouded by turbidity. If one’s actions lack restraint and illness arises from excess, it is self-inflicted—who else can one blame? Those who cultivate the heart-ground would never act thus. Let each reflect on this.\"",
      "overlap_context": "ers without opposition, never losing your composure. Today, the test has revealed the truth. For the practitioner, refining the heart in response to circumstances is paramount. With inner mastery, one is at ease and harmonious; outwardly, one responds to affairs with perfect accuracy. What is urgent, what can wait—one acts from what is most pressing, even if it means grinding one’s bones to dust, yet the heart remains unmoved. What difference does it make whether this task or that is done first?",
      "start_char": 3543,
      "end_char": 4453,
      "start_sentence": 108,
      "end_sentence": 134,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.24331045150757,
      "metadata": {
        "source_file": "dao\\藏外\\栖云真人王志谨盘山语录.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "师因有病者至极不能去得，乃普说云：修行之人，先须识破万缘虚幻，次要识破此个形骸一堆尘土，平日事上洒脱，临行必得自在。 昔山东有一庵主，临终迁化，淹延不得脱离，使人问长春真人。 真人云：往日但着于外缘物境上，未曾修炼，以此缠绵，不得解脱。 乃寄与语云：身非我有，性本虚空，一念不生，全身放下。 庵主闻此语，心若有省，乃嘱众兄弟云：我为外缘所昧，以此心地无功，临行不决，今劝汝等，各各下功修炼身心，救此生死大事去。 言讫遂终。 又有一道人，临死不决，询问众人曰：我如何去得？ 或曰：想师真者。 其人想数日，又去不得。 或曰：想虚空者。 其人又去不得。 有一老仙闻而视之，其人举以前想里事，今亦去不得。 老仙呵曰：来时有个甚？ 去后想个甚？ 安以待命，时至则行矣。 病人闻语，稽首谢之而卒。 大抵修行之人，一切外缘，目前权用，自己本真，要实下功，物里事里过得洒脱，临行怎得不洒脱？ 物上事上滞着染着，临行怎得洒脱？ 急当修炼，生死难防，有日到来，外缘何济？ 各请思之。 师有云：修行之人须要立志节，及至有志节，却多执固，执固则事物上不通变，及至事物上通变得，却便因循过日也，以此学者如牛毛，达者如麟角。 有志立者却知不得底，有知者却行不得底，虽行者却久不得底。 大抵学道之人，先要归宗祖，次要有志节，须要识通变，专一勤行，久久不已，无不成就也。 或问曰：如何是真常之道？ 答云：真常且置一边，汝向二六时中理会自己心地，看念虑未生时是个甚么？ 念虑既生时，看是邪是正？ 邪念则便泯灭着，正念则当用着。 如何是邪念？ 凡无事时，一切预先思虑，皆是邪妄。 如何是正念？ 目前有事，合接物利生，敬上安众，种种善心，不为己事，皆是正念也。 其静则体安，其动则用正，不纵不拘，无昼无夜，丝毫不昧，常应常静，平平稳稳，便是真常之道也。 师有云：修行之人为此顽心，自从无始以来轮回，贩骨如山之积，万生万死，以至今日方省前非，欲求解脱，是以昼不敢食，夜不敢眠，炼此顽心，要般般与俗颠倒，方可中用。 若不炼心，见人不睡，也如此做造，心念如毛，及至触着便发烟火，至如百年不睡，济甚么事？ 顽心不尽，依旧轮回。 欲要换过此心，不论昼夜，时时刻刻，动里静里，把这一片顽心裂教粉碎去，方可受用； 元本真灵与天地相似，然后静也是道，动也是道，开口也是道，合口也是道，更别求甚么？ 便是个洒脱底道人也。 师常有云：修行之人把自己从来心上染习得偏重底念虑，着功夫用气力煅炼了，难舍着舍去了，乃至此身限到也要舍，况在心上底，但是虚妄，一一除尽，便无烦恼障碍也。 若身外底一切事一切物不足留心，眼前来往与蚊虻相似，拂去则快，便自心上难遣底遣去者，那里便是轮回种子耶？ 昔长春真人在磻溪时，常有虎豹夤夜往来，晨夕出入，或生怖惧，清旦欲做藩篱，复自思惟：如此境界，有此怖心，便欲遮护，毕竟生死回避得么？ 却便休去，兀兀腾腾，任生任死，怖心自无，以至生死境中巍然不动，种种结缚一时解脱，此是难行处行也。 师有云：修行人穷究生死大事，须索自己下工夫，不分昼夜，一心澄澈，六根清净；",
      "translated_text": "A master, seeing a patient at the brink of death unable to depart, addressed all present: \"Those who cultivate the Way must first see through the illusory nature of all worldly conditions, and next recognize this bodily form as but a heap of dust. In daily affairs, remain detached; at the hour of departure, one will naturally attain freedom.\n\nOnce in Shandong, an abbot lay dying, lingering without release. Someone was sent to inquire of Master Changchun. The master replied: 'In life, he clung to external conditions and objects, neglecting inner cultivation—thus he remains entangled, unable to break free.' He sent these words: *'This body is not yours; your nature is fundamentally empty. When not a single thought arises, lay down the whole body.'* Upon hearing this, the abbot seemed to awaken. He instructed his fellow practitioners: 'I was deluded by external conditions, neglecting the work of the heart-ground. Now, at the threshold of death, I falter. I urge you all: devote yourselves to cultivating body and mind, and resolve this great matter of life and death.' With that, he passed away.\n\nAnother Daoist, nearing death, could not depart. He asked those around him: 'How can I go?' One said: 'Meditate on truth.' He meditated for days but still could not go. Another said: 'Meditate on emptiness.' Again, he could not go. An old immortal heard of this and came to see him. The man recounted his previous attempts, yet still could not depart. The old immortal rebuked him: 'What did you bring when you came? What do you seek to take when you go? Rest in equanimity and await your time—when it comes, you will depart.' The sick man bowed in gratitude and died.\n\nGenerally, those who cultivate the Way regard all external conditions as provisional tools for the present moment, while their true nature requires steadfast effort. If one moves through worldly affairs with detachment, how could one fail to be detached at the hour of death? If one clings to things and affairs, how could one be detached then? Cultivate diligently—life and death are unpredictable. When the day comes, what use are external conditions? Let each reflect on this.\"\n\nThe master also said: \"Those who cultivate the Way must first establish resolve. Yet once resolve is set, many become rigid. Rigidity prevents adaptability in worldly affairs. Even if one becomes adaptable, one may grow complacent, letting days slip by. Thus, learners are as numerous as ox hairs, while those who attain are as rare as unicorn horns.\n\nThose with resolve often lack understanding; those with understanding often fail to act; those who act often do not persevere. In cultivating the Dao, one must first return to the ancestral source, then establish resolve. One must discern adaptability, remain single-minded, and practice diligently without cease—then success is assured.\"\n\nSomeone asked: \"What is the ever-constant Dao?\"\nThe master replied: \"Set aside the ever-constant for now. In the twelve hours of day and night, examine your own heart-ground. Observe: what is it before thoughts arise? When thoughts arise, discern whether they are deluded or upright. Eradicate deluded thoughts; employ upright ones.\n\nWhat is a deluded thought? When idle, all anticipatory musings are false and errant. What is an upright thought? When faced with affairs—serving others, benefiting beings, honoring superiors, pacifying the multitude—all good intentions not for oneself are upright thoughts. In stillness, embody tranquility; in activity, act with rectitude. Neither indulgent nor restrained, neither day nor night obscured, moment by moment unclouded—constantly responsive, constantly still, steady and serene—this is the ever-constant Dao.\"\n\nThe master also said: \"Those who cultivate the Way struggle with this obstinate heart, which since beginningless time has cycled through rebirth, piling bones like mountains, dying and being born ten thousand times. Only now do they awaken to past errors and seek liberation. Thus, they dare not eat by day nor sleep by night, refining this obstinate heart, inverting every convention to make it serviceable. Without refining the heart, even if one mimics others—staying awake, suppressing thoughts—when touched, anger flares like smoke and fire. What use is a hundred years of sleeplessness? If the obstinate heart remains, one still cycles through rebirth.\n\nTo transform this heart, day and night, in movement and stillness, shatter this obstinate heart to pieces—only then can it be of use. The original true spirit resembles heaven and earth. Then, stillness is the Dao, activity is the Dao, speaking is the Dao, silence is the Dao—what more is there to seek? One becomes a Daoist free and unburdened.\"\n\nThe master often said: \"Those who cultivate the Way must apply effort to refine and relinquish the deeply ingrained habits of their minds. Even this body, when its time comes, must be abandoned—how much more so the illusions of the heart? Remove them all, and no afflictions or obstacles remain. External affairs and things need not occupy the mind; the comings and goings of the present are like mosquitoes—brushed away, one feels at ease. Yet the thoughts hard to dispel from the heart—these are the seeds of rebirth.\n\nWhen Master Changchun dwelled at Pan Ravine, tigers and leopards came and went at night, appearing morning and evening. Initially fearful, he considered building a fence. Then he reflected: 'In such a place, with this fear, I seek to shield myself—can I truly evade life and death?' He let it be, remaining unshaken, accepting life and death as they came. Fear vanished, and amid the trials of life and death, he stood firm and unmoved. All bonds dissolved at once—this is practicing the difficult.\n\nThe master also said: \"Those who cultivate the Way must thoroughly investigate the great matter of life and death. Apply effort to yourself, day and night, with an undisturbed mind and purified senses.\"",
      "overlap_context": "is not at ease, the whole body falls into chaos. Have you not heard the ancient saying: *'A flustered heart and scattered mind are the gates to hell'*? Such a state invites transgressions. In this way, mild illness turns severe, and severe illness leads to death, for one’s nature is clouded by turbidity. If one’s actions lack restraint and illness arises from excess, it is self-inflicted—who else can one blame? Those who cultivate the heart-ground would never act thus. Let each reflect on this.\"",
      "start_char": 4455,
      "end_char": 5699,
      "start_sentence": 135,
      "end_sentence": 177,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.01082754135132,
      "metadata": {
        "source_file": "dao\\藏外\\栖云真人王志谨盘山语录.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "遇声色境界，见如不见，闻如不闻，内心不受，他家扰扰，非干己事，如目前风过一般，； 师有云：修行之人，但见人用事好处，自己仿效去，不可见他人过，却失了自己也。 不得递相是非。 但存是非，自心不正，久进不得，正能掩邪，邪常谤正。 凡存我相，常谤人者，不明自己，乃是外道邪宗也。 若有正知正见，必于自己心上体究偏邪，搜求过失，若管他非，非正人也。 或问曰：如何是功行？ 答云：合口为功，开口为行。 如何合口为功？ 默而得之，无思无虑，缄口忘言，不求人知，韬光晦迹，此是合口为功也。 如何开口为行？ 施诸方便，教人行持，利益群生，指引正道，是开口为行也。 或问曰：视听食息手拈足行心思，此是性否？ 答云：道性不即此是，不离此是。 动静语默，是性之用，非性之体也。 性之体，则非动非静，非语非默。 古人有言：“大道要知宗祖，不离动静语默。 ”若认动静语默，便是认奴作主。 主能使奴，奴岂是主哉？ 一切抬手动足，言语视听，千状万态，及良久不动，皆是奴仆，非主人也，主人堂上终不得明示于外，然得其用使者则自承当作主人矣。 或问曰：某下三年死功夫，可以脱得轮回么？ 答云：修行之人当立决定志，时时刻刻精进炼心，不预未来，岂敢内存胜心，便望超脱？ 昔有道人初出家来，乃大言曰：某觑轮回小可，着些功夫便是免了。 有志下功，不测笃疾缠身，数年不愈，渐消其志。 此岂可以胜心为之哉？ 或问曰：某于山中独行独坐，亲见山神报未来事，是真么？ 答云：常人之心依着万尘，蒙昧不明，初机出家，磨炼尘心，偶然得静，乍见静境，便生别个景象，神头鬼面，认是心地，乃自欢喜，歌舞不休，或有自见知未来事者，或空中闻人预报前事及有应验者，或有亲见过去师真神人来到目前付嘱心地事者，若有心承认，便是着邪，如不除去，养成心病，无法可疗。 岂不闻古人云：“见闻觉知亦是病患”，况是眼见耳闻心思底，皆属声色境界？ 岂不闻经云：“视之不可见，听之不可闻，言之不可及，思之不可至”耶？ 今已于声色上认为真，便是落邪道也。 昔有道人静坐中，或觉口中有酒味，又梦见人送酒，明日果有人送酒来，此是心空神应，不为奇特，认之则为着邪宗也。 又有道人，坐中忽然神出外游，数百步复回，乃见本形依然端坐，如是数次，亦不为奇特，乃与平常念头出外一般，只争些子分明，若认为功，便是着邪也。 俚语有云：“万般祥瑞不如无，平常安稳却合道。 ” 师因众论智藏开时辞源涌出，乃云：修行之人，初心离境，如镜乍明，智藏忽开，举意成章，不可住着。 若心印定，不感而用，变成狂慧，则了无功； 只是神用，非道体也，不可驰骋以为伎能，但涵养则有功也。 师因人议住山，乃云：修行之人物来要识破，境来要应过，应过一番便同应过一举。 昔有道人住山，草衣木食，誓不下山，以为屏尽尘俗之累。 一日，忽有二人各持兵仗来索饮食，先生旋煮山果以待之，未及软，其一人就釜中手取而尝，怒而言曰：此等物与人食！ 便欲捣去釜底。 先生初不言，见此二人怒色兼以恶言激切，先生密谋，乃因事出外，探得所藏之棒，手按大呼云：二人出来，尔等未必近得我！",
      "translated_text": "When encountering realms of sound and form, see as if not seeing, hear as if not hearing—let nothing take root within the heart. Others may stir and clamor, but these are not one’s own affairs, like wind passing before the eyes.\n\nThe master also said: \"Those who cultivate the Way should only observe the good in others’ actions and emulate it themselves. Do not fixate on others’ faults, lest you lose yourself. Do not engage in mutual fault-finding. To harbor right and wrong is to have an unaligned mind; progress will be long delayed. The upright can suppress the crooked, while the crooked constantly slander the upright. Those who cling to the notion of self and habitually slander others fail to understand themselves—they belong to heterodox and perverse traditions. If one possesses true knowledge and right view, one must examine one’s own mind for bias and error, searching out one’s own faults. To meddle in others’ wrongs is not the way of the upright.\"\n\nSomeone asked: \"What are *gong* and *xing*?\"\nHe replied: \"Closing the mouth is *gong*; opening the mouth is *xing*.\"\n\n\"What does it mean to close the mouth as *gong*?\"\n\"To attain through silence, without thought or worry, sealing the mouth and forgetting speech, seeking no recognition, concealing one’s light and obscuring one’s traces—this is closing the mouth as *gong*.\"\n\n\"What does it mean to open the mouth as *xing*?\"\n\"To offer expedient means, teach others to practice, benefit all beings, and point the way to the true Dao—this is opening the mouth as *xing*.\"\n\nSomeone asked: \"Are seeing, hearing, eating, breathing, grasping, walking, and thinking the nature?\"\nHe replied: \"The nature of the Dao is neither identical to nor separate from these. Movement and stillness, speech and silence—these are the functions of nature, not its essence. The essence of nature is neither moving nor still, neither speaking nor silent. An ancient said: *'To know the ancestral source of the great Dao, do not depart from movement and stillness, speech and silence.'* Yet if you take movement and stillness, speech and silence as the nature, you mistake the servant for the master. The master commands the servant—how could the servant be the master? All lifting of hands and moving of feet, all speech, seeing, and hearing, all myriad forms and postures, even long periods of stillness—these are all servants, not the master. The master in the hall never reveals itself outwardly, yet those who receive its use and command naturally take themselves as the master.\"\n\nSomeone asked: \"If I devote three years to rigorous practice, can I escape rebirth?\"\nHe replied: \"Those who cultivate the Way must establish resolute determination, refining the mind with unceasing diligence, moment by moment. Do not presume upon the future or harbor conceit, hoping for liberation. Once, a Daoist novice left the household life and boasted: *'Rebirth is a trifle—I need only apply some effort to be free of it.'* Though he began with resolve, an unexpected grave illness befell him, lingering for years and gradually eroding his will. How could this be achieved with arrogance?\"\n\nSomeone asked: \"When I walk or sit alone in the mountains, I personally witness mountain spirits foretelling future events—is this real?\"\nHe replied: \"The minds of ordinary people cling to the dust of the ten thousand phenomena, dull and unclear. When beginners leave the household life, they grind away at the dust of the mind. If they happen to attain stillness, they may suddenly perceive a tranquil realm, giving rise to strange visions—phantasmal apparitions they mistake for the mind-ground. Overjoyed, they sing and dance without cease. Some may see future events, or hear voices in the void foretelling things that later come to pass, or even witness past masters, true spirits, or divine beings appearing before them to entrust matters of the mind-ground. If one clings to these experiences, one falls into delusion. If not dispelled, they become a sickness of the mind, incurable by any method. Have you not heard the ancient saying: *'Seeing, hearing, awareness, and knowing are also afflictions'*? How much more so for what the eyes see, the ears hear, and the mind thinks—all belong to the realm of sound and form. Have you not heard the sutra: *'It cannot be seen by sight, cannot be heard by hearing, cannot be spoken of in words, cannot be reached by thought'*? To take what appears in the realm of sound and form as real is to fall into heterodox paths.\n\nOnce, a Daoist in meditation suddenly tasted wine in his mouth and dreamed of someone offering him wine. The next day, someone indeed brought him wine. This is the mind’s emptiness resonating with spirits—nothing extraordinary. To cling to it is to fall into heterodoxy. Another Daoist, while sitting, suddenly felt his spirit leave his body and wander hundreds of steps away before returning, seeing his original form still seated upright. Though this happened several times, it was nothing extraordinary—merely the usual wandering of thoughts, only slightly more distinct. To regard it as an achievement is to fall into delusion. A folk saying goes: *'A thousand auspicious signs are not as good as none; ordinary peace and stability accord with the Dao.'*\n\nWhen the assembly discussed the opening of *Zhizang* (Treasury of Wisdom), with words flowing like a spring, the master said: \"Those who cultivate the Way, in their initial resolve, depart from the dust, like a mirror newly polished. When the Treasury of Wisdom suddenly opens, thoughts become verses—do not cling to them. If the mind becomes fixed, functioning without stimulus, it turns into wild wisdom, devoid of merit. This is merely the functioning of spirit, not the essence of the Dao. Do not parade it as a skill; only through nurturing and refinement does merit arise.\"\n\nWhen the assembly discussed dwelling in the mountains, the master said: \"Those who cultivate the Way must see through people when they come and respond to circumstances as they arise. Each response is like a single act—once past, it is past. Once, a Daoist dwelled in the mountains, wearing clothes of grass and eating wild plants, vowing never to descend, believing he had cast off all worldly entanglements. One day, two men bearing weapons came demanding food. The master quickly cooked mountain fruits for them, but before they softened, one of the men reached into the pot, tasted them, and angrily said: *'Such things are not fit for human consumption!'* He was about to smash the pot. The master said nothing. Seeing the men’s anger and hearing their harsh words, he secretly devised a plan. On the pretext of leaving, he found the staff he had hidden, grasped it firmly, and shouted: *'You two, come out! You may not be able to get near me!'* \"",
      "overlap_context": "lace, with this fear, I seek to shield myself—can I truly evade life and death?' He let it be, remaining unshaken, accepting life and death as they came. Fear vanished, and amid the trials of life and death, he stood firm and unmoved. All bonds dissolved at once—this is practicing the difficult.\n\nThe master also said: \"Those who cultivate the Way must thoroughly investigate the great matter of life and death. Apply effort to yourself, day and night, with an undisturbed mind and purified senses.\"",
      "start_char": 5699,
      "end_char": 6946,
      "start_sentence": 178,
      "end_sentence": 219,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.307758331298828,
      "metadata": {
        "source_file": "dao\\藏外\\栖云真人王志谨盘山语录.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "二人出门笑曰：先生住山养成如此胜心，不如下山为俗人去。 二人遂行，望之忽不见。 先生方疑是圣贤校勘，悔之不已。 此是境上试不过也。 师因众议不动心，乃云：昔山东有道人于师傅处自言炼尽无明火。 师云：无明火尽则心不动，便是好人。 他日师密遣人试之。 日暮造门，庵门已闭，其人厉声，以杖大击其门，先生内应，声已不顺，勉强开门，来人形状暴躁，先生见之颜色已动，又至堂上，其人不解履便跳上座，殊无礼貌，先生大怒，深责其人。 其人拱手笑云：某非敢如此，师令某来校勘先生不动底心来，今未及试已见矣，不须再勘。 其人大惭，无言可对。 大抵修行人虽有功夫，岂敢自矜？ 不觉时便勘脱。 其时实到灰心槁形，则无自夸之念； 既自矜夸，便勘脱矣。 便直饶到得不动处，向上更有事在。 师因人论居圜守静事，乃云：昔有道人坐圜有年，一日众人请出，随意行止，旧友见而问之曰：师兄向静处得来底于闹处可用，未知师兄得到端的不动处也未？ 其人傲然，良久不言。 友人进云：某有试金石，可辨真伪。 师兄试说汝数年静处得来底心，看如何也？ 其人云：静处有甚么可说？ 友人曰：似恁么，则披毛戴角还他口债去也。 其人忿然大怒，以至出骂。 友人笑曰：此是汝圜中得来底也，果试出矣。 其人遂怨，终身绝交。 此人不曾于境上炼心，虽静坐百年，终无是处，但似系马而止者，解其绳，则奔驰如旧矣。 （圜，环堵也，中起一屋，筑圜墙闭之，别开小牗以通饮食，便人送也。 绝交友，专意修行也。 ）",
      "translated_text": "The two men stepped outside and laughed, saying: *\"Master, dwelling in the mountains has nurtured such a triumphant heart in you—better to descend and become an ordinary man.\"* With that, they departed, and as he watched, they suddenly vanished. The master then suspected they were sages testing him and regretted deeply. This was a trial he had failed at the threshold of circumstance.\n\nThe master, undisturbed by the opinions of others, once said: *\"Long ago in Shandong, a Daoist boasted to his teacher that he had refined away the fire of ignorance.\"* The master replied: *\"If the fire of ignorance is extinguished, the heart remains unmoved—then you are a good man.\"* Later, the master secretly sent someone to test him.\n\nAt dusk, the man arrived at the hermitage, but the gate was already shut. He raised his voice and struck the door violently with his staff. The Daoist inside responded, his tone already unsettled. With reluctance, he opened the door, and seeing the visitor’s fierce demeanor, his expression shifted. When they entered the hall, the man did not remove his shoes but leapt onto the seat, utterly lacking in courtesy. The Daoist grew furious and severely rebuked him. The man clasped his hands and smiled: *\"I dared not act so—your teacher sent me to test whether your heart remains unmoved. Now, before the trial even began, it was already evident. No further testing is needed.\"* The Daoist was deeply ashamed, left with no words to reply.\n\nGenerally, even those who cultivate the Way, though they may have skill, dare not boast of it. Unawares, they are exposed in the trial. Only when one truly reaches the state of a withered heart and emaciated form does the thought of self-praise vanish. Once self-praise arises, the trial is already failed. Even if one attains the state of immovability, there is still more beyond.\n\nThe master, discussing the practice of dwelling in seclusion and guarding stillness, said: *\"Once, a Daoist had sat in a walled enclosure for years. One day, the community asked him to come out, and he moved about freely. An old friend saw him and asked: ‘Brother, what you gained in stillness—can it be applied amid clamor? I wonder if you have truly reached the point of immovability.’* The man grew haughty and remained silent for a long while. The friend pressed on: *\"I have a touchstone to distinguish truth from falsehood. Brother, try speaking of the heart you attained in years of stillness—let us see how it fares.\"* The man replied: *\"What is there to say of stillness?\"* The friend said: *\"If it is like this, then you will repay your debt with fur and horns.\"* The man flew into a rage, hurling insults. The friend laughed: *\"This is what you gained in your enclosure—truly tested now.\"* The man grew resentful and cut off the friendship for life.\n\nThis man had never tempered his heart amid circumstances. Though he sat in stillness for a hundred years, it was all in vain. He was like a horse tethered in place—once the rope is untied, it bolts as before. *(A walled enclosure: a single room built within a circular wall, sealed except for a small window to receive food, allowing the practitioner to focus solely on cultivation. To sever ties with friends: to devote oneself entirely to practice.)*",
      "overlap_context": "nding food. The master quickly cooked mountain fruits for them, but before they softened, one of the men reached into the pot, tasted them, and angrily said: *'Such things are not fit for human consumption!'* He was about to smash the pot. The master said nothing. Seeing the men’s anger and hearing their harsh words, he secretly devised a plan. On the pretext of leaving, he found the staff he had hidden, grasped it firmly, and shouted: *'You two, come out! You may not be able to get near me!'* \"",
      "start_char": 6946,
      "end_char": 7541,
      "start_sentence": 220,
      "end_sentence": 247,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.592129468917847,
      "metadata": {
        "source_file": "dao\\藏外\\栖云真人王志谨盘山语录.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "师尝云：修行之人，如大匠斫木，先正心墨，然后于偏邪分外处渐加斤斧，就正成材，随宜使用，不得动着心墨； 若失了心墨，则无所取法矣。 偏邪削尽，心墨端然，自与他相应，可以成就一切器用也。 师有云：修行人常常心上无事，正正当当，每日时时刻刻体究自己本命元神端的处，明白不昧，与虚空打作一团，如此才是道人底心也。 积日累功，自有灵验。 所以见种种作为不如休歇体究自己去。 若一向物上用心，因循过日，却与俗心无异也。 师因众议住持院门，乃云：修行人住院，须量气力，运动简省，轻快过日，不可与世俗一般争名竞利，却失了当初本心，却忘了性命大事因缘，此是正理也。 若能于此炼磨心地，不肯处肯去，苦处当去，得心安稳不动，接待十方，自利利他，安心积行，功行两全矣。 若不炼心，认物为我，则一向悭贪习性，窄隘罪过寻俗，误却前程矣。 师因劝众住丛林，乃云：丹阳真人有词云：“学道住丛林，校浅量深，择其善者作知音”。 若是未能明至理、挈领提衿，凡在丛林，递相指教，提纲挈领，共修无上心地大法门，非小可事。 有等无见趣底，不寻知友，不住丛林，漫说云游，又不论心地，南去北来，千山万水，空费草鞋，只寻便宜自在处，触着磕着又早走也，及要快着自己寻好住处，兼觅因缘，如此出家，不知甚么是自己紧切处，不知怎生过日？ 只图自在便是了也，殊不知前面有底生死决定到来，看汝着甚支吾？ 岂可因循过日，虚度时光？ 当初出家图个甚么？ 惺惺君子，细细思之。 师因作务人有动心者，乃云：修行人外缘虽假，不可不应，应而无我，心体虚空，事来无碍，则虚空不碍万事，万事不碍虚空，如天地间万象万物皆自动作，俱无障碍。 若心存我相，事来必对，便有触拨，急过不得，撞着磕着，便动自心，自心既动，平稳不得，虽作苦终日，劳而无功也。 居大众中，及有作务，专防自心，不可易动，常搜己过，莫管他非，乃是功行。 事临头上，便要承当，诸境万尘，不逐他去，自心明了，一切莫辨，如此过日，初心不退，自获大功也。 师云：修行人有一分功夫，便生一分胜心，有十分功夫，便生十分胜心，既有胜心，则有我相，我相胜心作大障碍，如何得到心空境灭也？ 却要重添决烈，把自己身心厝在万物之下，常居人后，自念千万不如人，然后可以遣却矜胜之心。 心同太虚则无我也，无我则与道相应矣。 师云：修行之人静中境界甚有多般，皆由自己识神所化，因静而现，诱引心君。 岂不闻古人云：“凡所有相，皆是虚妄。 ”心欲遣识，识神尚在，便化形象，神头鬼面，惑乱心主； 若主不动，见如不见，体同虚空，无处住着，自然消散，无境可魔，无物可坏也。 昔有道人，心得休歇，一日坐间，忽见恶鬼无数，乘空而来，其人安定此心，体若虚空，冥然不辨，拼此一身，任生任死，其魔自散，为有主在，寂然不动，岂有魔魅？ 妄心未尽，故显此相，体性湛然，则自泯矣。 或问曰：守圜之人，其功如何？ 答云：昔长春真人在山东时，行至一观，后有坐圜者。 其众修斋次，有人覆真人言：圜中先生欲与真人语。 真人令斋毕相见去。 不意间，真人因出外，寻及圜所，以杖大击其门数声，圜中先生以为常人，怒而应之，真人便回。",
      "translated_text": "The master once said: *\"A cultivator is like a master carpenter hewing wood—first, one must align the heart’s inked line, then gradually apply axe and adze to the crooked and wayward parts, shaping it into proper timber for use as needed. One must not disturb the heart’s inked line; if it is lost, there will be no standard to follow. When the crooked and wayward are fully pared away and the heart’s inked line stands true, it will naturally resonate with others, and all implements may be fashioned.\"*\n\nThe master also said: *\"A cultivator should always keep the heart free of affairs, upright and proper, moment by moment, hour by hour, examining the true abode of one’s original life and primordial spirit, clear and unobscured, merging with the vast emptiness—only then is this the heart of one who walks the Way. Through accumulated days and piled-up effort, spiritual verification will naturally arise. Thus, all manifold activities are not as good as ceasing and examining oneself. If one constantly directs the mind toward external things, drifting through days in habitual routine, it differs not at all from the mundane heart.\"*\n\nWhen the assembly discussed taking up the abbot’s seat, the master said: *\"A cultivator who assumes the abbot’s role must measure his own strength, move with simplicity and ease, and pass the days lightly. He must not vie with the worldly for fame and profit, thereby losing his original heart and forgetting the great cause of life and destiny—this is the true principle. If one can temper the mind in this way, turning reluctance into willingness, facing hardship with resolve, and attaining a heart that is stable and unshaken, then in receiving guests from all directions, one benefits both self and others, settles the mind, and accumulates practice—merit and conduct will both be complete. If one does not temper the heart but mistakes things for the self, one will remain bound by stingy and greedy habits, narrow and constricted, chasing after transgressions and worldly concerns, thus ruining one’s future path.\"*\n\nThe master, urging the assembly to dwell in the monastic community, said: *\"Master Danyang’s lyric states: ‘To learn the Dao, dwell in the monastic community, assess depth and shallowness, and choose the good as your intimate friends.’ If one has not yet grasped the ultimate principle, holding fast to the essentials, then in the monastic community, all instruct one another, lifting the guiding threads and holding the key points, together cultivating the supreme Dharma-gate of the mind-ground—this is no small matter. There are those without insight or aspiration who neither seek wise companions nor dwell in the monastic community, idly speaking of wandering, yet without discussing the mind-ground. They go south and north, across a thousand mountains and ten thousand rivers, wasting straw sandals in vain, only seeking places of convenience and ease. At the slightest touch or bump, they flee at once. When it comes to finding a good place for themselves or seeking favorable conditions, such monastics know not what is most urgent for themselves, nor how to pass the days. They merely seek ease—this is all. Yet they do not realize that ahead lies the decisive arrival of birth and death. What will you rely on to cope? How can one drift through days, squandering time? What did you originally leave the household to pursue? Clear-minded gentlemen, ponder this carefully.\"*\n\nWhen those engaged in labor grew restless, the master said: *\"Though external conditions for cultivators are provisional, one cannot fail to respond. Respond without self, the substance of the heart empty and vast. When matters arise, there is no obstruction—thus, emptiness does not obstruct the ten thousand affairs, nor do the ten thousand affairs obstruct emptiness. Like the myriad forms and beings in heaven and earth, all move of themselves, without hindrance. If the mind harbors the notion of self, matters will provoke opposition, leading to friction. One cannot pass through swiftly, and upon encountering obstacles, the self’s heart is stirred. Once the self’s heart is stirred, there is no peace. Though one toils all day, the labor is in vain. Dwelling in the great assembly and engaging in work, one must vigilantly guard the self’s heart, not allowing it to be easily moved. Constantly search for one’s own faults, never mind the faults of others—this is merit and conduct. When matters arise, one must take them on. Amidst the ten thousand conditions and dusts, do not follow them. With a heart that is bright and clear, do not discriminate—passing days thus, the beginner’s mind does not retreat, and great merit is naturally attained.\"*\n\nThe master said: *\"A cultivator with one part effort generates one part of a superior mind; with ten parts effort, ten parts of a superior mind arise. Once there is a superior mind, there is the notion of self. The notion of self and the superior mind create great obstructions—how can one attain the state where the heart is empty and conditions cease? One must resolutely add determination, placing one’s own body and mind beneath the ten thousand things, always staying behind others, thinking oneself a thousand, ten thousand times inferior to others—only then can the mind of pride and superiority be dispelled. When the heart is like the great void, there is no self; without self, one resonates with the Dao.\"*\n\nThe master said: *\"The states encountered by cultivators in stillness are manifold, all transformations of one’s own consciousness arising from stillness to entice the sovereign heart. Have you not heard the ancient saying: ‘All conditioned things are like a dream, an illusion, a bubble, a shadow’? If one wishes to dispel consciousness, yet consciousness remains, it will transform into forms and images—demonic heads and ghostly faces—confusing the master of the heart. If the master remains unmoved, seeing as if not seeing, the body like empty space, with no place to abide, they will naturally dissipate. There will be no conditions to demonize, no things to corrupt.\"*\n\n*\"Once there was a Daoist who had attained rest for the heart. One day, as he sat, he suddenly saw countless evil spirits descending from the sky. The man stabilized his heart, his body like empty space, darkly undiscriminating. He staked his life, willing to live or die. The demons dispersed of themselves, for there was a master within, serene and unmoving—how could there be demonic illusions? The deluded mind not yet exhausted manifests such forms. When the nature is profoundly still, they vanish of themselves.\"*\n\nSomeone asked: *\"What of the merit of one who practices in a walled enclosure?\"*\nThe master replied: *\"When Master Changchun was in Shandong, he came to a temple where there was one sitting in a walled enclosure. As the assembly prepared the vegetarian feast, someone informed the master: ‘The gentleman in the enclosure wishes to speak with you.’ The master instructed that they meet after the feast. Unexpectedly, the master went out and came to the enclosure. He struck the door loudly with his staff several times. The gentleman inside, thinking it an ordinary person, responded in anger. The master then turned away.\"*",
      "overlap_context": "resentful and cut off the friendship for life.\n\nThis man had never tempered his heart amid circumstances. Though he sat in stillness for a hundred years, it was all in vain. He was like a horse tethered in place—once the rope is untied, it bolts as before. *(A walled enclosure: a single room built within a circular wall, sealed except for a small window to receive food, allowing the practitioner to focus solely on cultivation. To sever ties with friends: to devote oneself entirely to practice.)*",
      "start_char": 7542,
      "end_char": 8812,
      "start_sentence": 248,
      "end_sentence": 282,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.44476389884949,
      "metadata": {
        "source_file": "dao\\藏外\\栖云真人王志谨盘山语录.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "斋毕，众人复请以相见，真人曰：已试过也，此人人我心尚在，未可与语。 遂去之。 大抵居静，本为性命事大，收拾固济，涵养为功，遇境不动，乃是验也； 今此击门之声是境，应者是心，心若忘我，如同灰灭，拨之有明，亦无火焰，遇境不动，安详应过，便是心上有工夫也； 今闻些子虚声便早动心，一切恶境怎生过得？ 虽居圜中，济甚么事？ 受人供养口债，怎生还得？ 却不如向动用境中、物上事上，专一磨炼此心去，却是个有见趣底人也。 www.taoismcn.com 或问曰：修行人有言知觉，又云是病，其旨如何？ 答云：真知以不知之知，真觉以无觉之觉，元本真灵蒙昧万劫，今方省悟，乃名为觉，一切知见皆从此生。 若言有知有觉，又专欲常知常觉，乃是自缠自缚，无病自灸也。 若一向不知不觉，却一向透入别壳也。 既悟本宗，知觉皆是用处，当用即用，不可为常也。 师云：修行之人尘心顿歇，俗虑消亡，孤然显出自己元本真宗，便是从来先天底主人。 自承当得，逍遥自在，种种法界一时透彻。 若到此地，才要韬光晦迹，保护涵养，多则功多。 若举意显扬，则不觉暗损光明矣。 师云：修行之人性有利钝，性钝者不可坚执，宜住丛林，低下存心，与达理明心底人结缘，缘熟自然引领入道，渐次开悟。 若自性钝滞，又无见趣，每日常与同类相从，交结尘俗，尘境缘熟，久必退道，或遭魔境，作地狱见，无人救援，一向沉堕，深可痛哉！ 师云：昔有住圜者闻人说地面，既入圜中，要见地面，心存此念，随念应现，不知是假，耳里闻底属声，眼前见底属色，心上想底属妄，便见金童玉女真仙圣贤现形，白日亲见，亦是虚妄境界，妄念所作，便认是地面，更不可破除，模糊一世，着邪着祟。 殊不知地面是古人心行到平稳休歇处，故有此名，如人住处，治平荆棘，扫除瓦砾，其地平整，可以居止，名为地面。 修行之人，心地平稳，事触不动，便是个不动地面； 万尘染他不得，便是个清净地面； 露出自己亘初法身，分分朗朗，承当得底，便是个圆明地面。 凡言地面，亦有边际去处，若到无地位、无方所、绝名言处，乃所谓玄之又玄也，如此岂可以眼见耳闻心想底便谓是了哉？ 师云：无为者天道也，有为者人道也。 无为同天，有为同人，如人担物，两头俱在则停稳，脱却一头即偏也。 若两头俱脱去，和担子也无，却到本来处。 师云：昔东堂下遇雨，知事人普请不择老幼搬坯，众皆竞应，唯一老仙安坐不出。 事毕，大众团坐，有言于长春真人者，真人呵之云：坯尽坏，值几何？ 一人炼心，端的到休歇处，如宝珠无价。 且量各人心地用事去！ 大抵教门中以得人为贵也。 师云：昔长春真人堂下有当厨者，众皆许其柔和低下，未尝动心。 真人知之，密令人试，早晨于厨中所用杂物移之他处。 其人造粥渍米及釜，急求匕杓不得，以至溢出，乃大动心。 真人见之，教云：直饶溢尽，只是外物，何消坏心？ 其人方省，礼谢不已。 或有医者问云：某行医道，死者救活百余人，其果如何？ 答云：直饶救尽天下人，亦不如救自己生死去。 世间福报有尽限，自己修炼到无生死处，此福无限量。 或有匠人问云：某修大殿，不征工价，如此诚心，合有何果？",
      "translated_text": "After the feast, the assembly again requested that they meet. The master said: *\"I have already tested him. This man still harbors the mind of ‘I’—he is not yet fit for discourse.\"* And so he departed.\n\nGenerally speaking, dwelling in stillness is fundamentally for the great matter of nature and life, to gather and secure, to nurture as one’s work. Unmoved by circumstances—this is the proof. Now, the sound of the knocking at the door was a circumstance; the response was the mind. If the mind had forgotten the self, it would be like cold ashes extinguished, stirred yet without flame. Unmoved by circumstances, calmly passing through—this is the sign of work upon the mind. Now, hearing a trifling empty sound, he was already moved in heart. How could he ever pass through all adverse circumstances? Though he sits in a walled enclosure, what use is it? Accepting others’ offerings, how can he repay such a debt of the mouth? Far better to turn toward the realm of activity, toward affairs and things, and single-mindedly temper this heart—such a one is a person of true insight.\n\nSomeone asked: *\"Those who cultivate the Way speak of knowing and awakening, yet also call them illness. What is the meaning?\"*\nThe master replied: *\"True knowing is the knowing of not-knowing; true awakening is the awakening of no-awakening. The original true spirit, obscured for ten thousand kalpas, has only now awakened—this is called awakening. All knowing and seeing arise from this. If one speaks of having knowing and having awakening, and insists on constant knowing and constant awakening, this is self-entanglement, self-imposed moxibustion upon a body without illness. If one is utterly without knowing and without awakening, one will simply penetrate into another shell. Having awakened to the original source, knowing and awakening are but tools for use. Use them when needed, but do not make them constant.\"*\n\nThe master said: *\"When one who cultivates the Way suddenly stills the dusty mind and extinguishes worldly cares, the original true source of the self stands revealed alone—this is the primordial master who has always been. Once one takes up this burden, one is carefree and at ease, and all dharmadhātus are penetrated at once. If one reaches this state, one must conceal one’s light and hide one’s traces, protect and nurture it—more yields more merit. If one raises the intention to display it, one will unknowingly dim one’s radiance.\"*\n\nThe master said: *\"Those who cultivate the Way differ in the sharpness of their nature. Those of dull nature should not cling rigidly. They ought to dwell in the assembly, humble their minds, and form affinities with those who understand principle and illuminate the mind. When the affinity ripens, they will naturally be guided into the Dao and gradually awaken. If one’s nature is dull and stagnant, and one has no insight, yet daily keeps company with those of the same kind, associating with worldly dust, the dusty circumstances will ripen, and one will surely retreat from the Dao. One may encounter demonic realms, perceive hellish visions, with no one to save them, sinking forever—how deeply lamentable!\"*\n\nThe master said: *\"Once, a man dwelling in a walled enclosure heard others speak of the ‘ground of realization.’ After entering the enclosure, he wished to see this ground. As this thought arose, it manifested in response. Not knowing it was false—what the ears heard belonged to sound, what the eyes saw belonged to form, what the mind imagined belonged to delusion—he saw golden youths and jade maidens, true immortals and sages appearing in form, seen clearly in broad daylight. Yet this was but an illusory realm, created by deluded thought. Taking it for the ground of realization, he could not break free, muddling through his life, ensnared by demons and spirits. He did not know that the ‘ground of realization’ is where the ancients’ minds and actions reached a state of stability and rest—hence the name. Like a place where one dwells, clearing brambles, sweeping away rubble, the ground is leveled so one may reside—this is called the ‘ground of realization.’ For one who cultivates the Way, when the mind-ground is stable and unmoved by contact with affairs, this is the ‘unmoving ground of realization.’ When the ten thousand dusts cannot stain it, this is the ‘pure ground of realization.’ When one’s original dharmakāya is revealed, bright and clear in every part, and one can take it up—this is the ‘luminously complete ground of realization.’ All such ‘grounds of realization’ have boundaries and limits. If one reaches the state of no ground, no direction, beyond names and words—this is what is called ‘mysterious and again mysterious.’ How could one claim that what is seen by the eyes, heard by the ears, or imagined by the mind is the ultimate?\"*\n\nThe master said: *\"Non-action is the Way of Heaven; action is the way of man. Non-action is one with Heaven; action is one with man. Like a man carrying a burden—if both ends are balanced, it rests steadily. If one end is dropped, it becomes lopsided. If both ends are let go, even the carrying pole is gone, and one returns to the original state.\"*\n\nThe master said: *\"Once, during rain at the Eastern Hall, the manager called for general labor, regardless of age, to move bricks. All competed to respond, except for one old immortal who sat unmoving. When the task was done, the assembly gathered. Someone spoke of this to Master Changchun, who rebuked them: ‘Bricks all broken—what are they worth? One person tempering the mind, truly reaching the place of rest, is like a priceless jewel.’ Consider each person’s mind-ground and how it is applied! In the teaching, obtaining the right person is most precious.\"*\n\nThe master said: *\"Once, beneath Master Changchun’s hall, there was one who served in the kitchen. All praised his gentleness and humility, saying he was never moved in heart. The master, knowing this, secretly had someone test him. In the morning, they moved the miscellaneous items in the kitchen to another place. When the man went to prepare congee, soaking the rice and filling the pot, he urgently sought the ladle and scoop but could not find them. The congee overflowed, and he was greatly disturbed in heart. Seeing this, the master taught: ‘Even if it all spilled, it is but an external thing. Why let it harm the mind?’ The man then awakened and bowed in gratitude without end.\"*\n\nA physician asked: *\"I practice medicine and have revived over a hundred people from death. What is the karmic result?\"*\nThe master replied: *\"Even if you saved all the people in the world, it would not compare to saving yourself from the cycle of birth and death. Worldly blessings have limits, but if you cultivate to the state beyond birth and death, this blessing is boundless.\"*\n\nA craftsman asked: *\"I built a great hall without asking for wages. With such sincerity, what karmic result will there be?\"*",
      "overlap_context": "n was in Shandong, he came to a temple where there was one sitting in a walled enclosure. As the assembly prepared the vegetarian feast, someone informed the master: ‘The gentleman in the enclosure wishes to speak with you.’ The master instructed that they meet after the feast. Unexpectedly, the master went out and came to the enclosure. He struck the door loudly with his staff several times. The gentleman inside, thinking it an ordinary person, responded in anger. The master then turned away.\"*",
      "start_char": 8812,
      "end_char": 10071,
      "start_sentence": 283,
      "end_sentence": 325,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.67240643501282,
      "metadata": {
        "source_file": "dao\\藏外\\栖云真人王志谨盘山语录.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "答云：不如清静人默坐一时辰，盖有为之福有坏，无为之福无坏。 师示众云：人生于世，所为所作，无不报应，谓如体道者得道，作福者得福，作孽者得孽，爱人者人爱之，恶人者人恶之，敬人者人敬之，慢人者人慢之，低下者人下之，信人者人信之，利人者人利之，害人者人害之，自高者人抑之，欲先则人争之，自强则人敌之，故云：“种兰得香，种粟得粮”，皆报应之理也。 若存利心，矫诈为之，以取人心，则失真矣。 师云：修行之人，大忌说人长短是非及人间兴废，一切世事，非干己者，口不可论，心不可思，但说是非，便昧了自己。 若专炼心，常搜己过，那得工夫管他家屋底事？ 但凡为人，总有好处，宜相仿效，他人恶处，自当回避，更莫关心，渐到休歇也。 师示众云：修行之人，乡中便了道也 休住，酒肉食了飞升也 休用，眷属便是神仙也 休恋，众人爱底休爱，人都非底莫非，自己浑是莫认，睡里得道也 休睡，不是好伴休合，无益之言休说，遇事成时莫喜，遇事坏时莫忧，胜如己者学之，不如己者教之，人亏己者福也 ，己亏人者祸也 ，言过行者虚也 ，行胜言者实也 ，有欲情者人事也 ，无尘心者仙道也 ，肯低下者高也 ，肯贫穷者富也 ，返常合道，顺理合人，正道宜行，邪门莫入，通道明德，体用圆成，是谓全真也 。 师云：古人学道，心若未通，不远千里求师参问，倘若针芥相投，心地明白，更无疑虑，然后或居圜堵，或寄林泉，或乞市中，或立宫观，安心守道，更无变坏，此修真之上士也。 有一等出家，性又不明，更懒参问，心高好胜，自执己是，诈装高道，亏功失行，两下落空，骇人供养，不思己德如何消受？ 如此之人，住圜也不是，乞食也不是，生死到来，都不中用，盖不肯于根蒂上下工夫也，直至百年，无有是处。 师云：修行之人收拾自心如一尊木雕圣像坐于堂中，虽终日无人亦如此，幡盖簇拥亦如此，香花供养亦如此，往来毁谤亦如此，惟比木像通灵通神，活泼泼地，明道明德，一切事上物上却不住着也。 师云：道人炼心如铸金作鸡，形象虽与鸡一般，而心常不动，独立于鸡群，鸡虽好斗，无有敢近傍者。 体道之人心若寒灰，形如槁木，天下之人虽有好争者，则不能与争矣。 故经云：“夫惟不争，故天下莫能与之争。 ” 师云：这个有体用、没尔我、正正当当底真心，自从亘古未有天地以前禀受得来，不可道有，不可道无； 古今圣贤，天下老道，人皆得此，然后受用； 千经万论乃至一大藏经，只是说这些子； 上天也由这个，入地也由这个，乃至天地万物、虚空无尽际，亦是这个消息主宰。 会得底，不被一切物境引将去，不被一切念虑搬弄，不被六根瞒过，这个便是神仙底日用，便是圣贤底行踪，便是前程道子也。 师云：凡住丛林，云集方来，岂得人人一等，个个同条？ 喻如大山，草木毕备，有不材者，有成材者，有特立者，有依附者，也有灵苗瑞草，也有荒榛荆棘，种种不同，随性任运，自有次第，山体巍然，原无拣择，一一含摄； 流水积石，茂林丰草，兽走禽鸣，尽是神通妙用，彼各相资，如蓬在麻，不扶自直，天长地久，各得成就。 若欲截长续短，变青作黄，岂惟各不得安，抑亦失其本性也。",
      "translated_text": "The master replied: *\"It is not as good as a person of purity sitting in stillness for a single hour. For the blessings of action may decay, but the blessings of non-action never decay.\"*\n\nThe master addressed the assembly: *\"In this world, all that one does and all that one makes will inevitably bring retribution. Thus, those who embody the Dao attain the Dao; those who perform blessings receive blessings; those who commit evil receive evil. Those who love others are loved in return; those who hate others are hated in return. Those who respect others are respected; those who slight others are slighted. Those who humble themselves are elevated; those who trust others are trusted. Those who benefit others are benefited; those who harm others are harmed. Those who exalt themselves are suppressed; those who seek precedence are contested. Those who are self-assertive are opposed. As the saying goes: ‘Plant orchids and you reap fragrance; plant millet and you reap grain.’ Such is the principle of retribution. If one acts with a mind for profit, dissembling and deceiving to win the hearts of others, one loses authenticity.\"*\n\nThe master said: *\"For those who cultivate the Way, the greatest taboo is speaking of others’ strengths and weaknesses, right and wrong, or the rise and fall of worldly affairs—matters unrelated to oneself. Such things must not be discussed with the mouth nor pondered in the heart. To speak of right and wrong is to obscure one’s own clarity. If one focuses on refining the heart and constantly examines one’s own faults, how can there be time to meddle in the affairs of others? In all people, there is some good worth emulating; the faults of others should be avoided, not dwelt upon. Gradually, one attains stillness.\"*\n\nThe master addressed the assembly: *\"For those who cultivate the Way: if you wish to attain the Dao in your hometown, do not stay; if you wish to ascend to immortality after eating meat and drinking wine, do not indulge; if you wish your family to become immortals, do not cling to them. Do not love what others love; do not condemn what others do not. Do not mistake your own delusions for truth. Do not seek the Dao in sleep—awake! Do not associate with unwholesome companions; do not speak useless words. When things go well, do not rejoice; when they go ill, do not grieve. Learn from those better than yourself; teach those who are not. When others wrong you, it is your fortune; when you wrong others, it is your misfortune. Words beyond deeds are empty; deeds beyond words are solid. Desire and emotion belong to the world of men; a heart free of dust belongs to the immortal’s path. To willingly humble oneself is to be exalted; to willingly embrace poverty is to be enriched. Returning to the constant and aligning with the Dao, following principle and harmonizing with others—this is the upright path to walk. Do not enter deviant gates. Penetrate the Dao, illuminate virtue, and embody both substance and function in perfect completion—this is called the Perfected Whole.\"*\n\nThe master said: *\"In ancient times, those who studied the Dao, if their hearts were not yet enlightened, would travel a thousand miles to seek a teacher and inquire. If their affinity was true and their hearts were clear, free of doubt, they might then dwell in a humble hut, or lodge in forests and springs, or beg in the marketplace, or establish a temple. They would settle their hearts, guard the Dao, and remain unchanged—such were the superior cultivators of truth. There are those who leave the household life, yet their nature remains unclear. Lazy in inquiry, proud and competitive, they cling to their own views, feigning the appearance of a high adept. They neglect their practice and lose their conduct, falling short in both worlds. They accept offerings from others without considering whether their own virtue is sufficient to receive them. Such people are unfit for seclusion, unfit for begging—when the hour of life and death arrives, they will be of no use. For they refuse to apply effort to the root, and even after a hundred years, they will have achieved nothing.\"*\n\nThe master said: *\"Those who cultivate the Way should gather their hearts like a wooden statue of a sage seated in the hall. Whether no one is present all day or whether banners and canopies surround it, whether incense and flowers are offered or whether slander and praise come and go—it remains thus. The difference is that the wooden statue does not come alive, while the cultivator’s heart is spiritually awakened, vibrant and clear, illuminating the Dao and virtue. Yet in all matters and all things, it does not cling.\"*\n\nThe master said: *\"The Daoist refines the heart like forging gold into a rooster. Though its form resembles a rooster, its heart remains unmoved. It stands alone among the flock, and though roosters are combative, none dare approach. The one who embodies the Dao has a heart like cold ashes and a form like withered wood. Though the world may be full of those who love to contend, none can contend with such a one. Thus the scripture says: ‘Only because they do not contend does the world not contend with them.’\"*\n\nThe master said: *\"This true heart—embodying substance and function, free of self and other, upright and proper—has been received since before the primordial chaos, before heaven and earth existed. It cannot be called existent, nor can it be called nonexistent. All sages and worthies of ancient and present times, all Daoists under heaven, have received this and then put it to use. The thousands of scriptures and ten thousand treatises, even the entire canon, speak only of this. Heaven is guided by it, earth is guided by it—even the ten thousand things of heaven and earth, the boundless expanse of emptiness, are governed by this subtle principle. Those who comprehend it are not led astray by external things, not manipulated by thoughts and concerns, not deceived by the six senses. This is the daily practice of immortals, the conduct of sages, the path of those who advance in the Dao.\"*\n\nThe master said: *\"When dwelling in a monastery, people gather from all directions—how could they all be the same, each one identical? It is like a great mountain, where all manner of plants grow: some are useless, some become timber, some stand alone, some cling to others. There are rare and auspicious sprouts, and there are wild brambles and thorns—all different, each following its nature and growing freely, each in its own order. The mountain stands majestically, making no distinctions, yet embracing all. Flowing water and piled stones, lush forests and abundant grasses, beasts running and birds singing—all manifest wondrous spiritual workings, each supporting the other. Like hemp supporting the mallow, they grow straight without need of support. Over time, each attains its fulfillment. If one sought to cut the long to patch the short, or change green to yellow, not only would none find peace, but their original nature would be lost.\"*",
      "overlap_context": "an asked: *\"I practice medicine and have revived over a hundred people from death. What is the karmic result?\"*\nThe master replied: *\"Even if you saved all the people in the world, it would not compare to saving yourself from the cycle of birth and death. Worldly blessings have limits, but if you cultivate to the state beyond birth and death, this blessing is boundless.\"*\n\nA craftsman asked: *\"I built a great hall without asking for wages. With such sincerity, what karmic result will there be?\"*",
      "start_char": 10071,
      "end_char": 11320,
      "start_sentence": 326,
      "end_sentence": 362,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.568394899368286,
      "metadata": {
        "source_file": "dao\\藏外\\栖云真人王志谨盘山语录.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "师云：往昔在山东住持时，终日杜门，不接人事，十有余年，以静为心，全无功行，向没人处独坐，无人触着。 不遇境，不遇物，此心如何见得成坏？ 便是空过时光，若天不利物则四时不行，地不利物则万物不生，不能自利利他，有何功德？ 故长春真人云：“动则安人利物”，盖与天地之道相合也。 师云：修行之人若玄关不通，心地不明，则其业识不能无为者，盖为无福德故也，乃当于有为处、教门中随分用功，接待方来，低下存心，恭敬师友，常行方便，屏去私邪，久久缘熟，日进一日，自有透得处，不胜如两头空担？ 不能无为，不能有为，因循度日，无功无行，稳处着脚，甜处着口，闲管世事，闹处出头，恣纵身心，不惧神明，打算有日，岂不闻长春真人云：“心地下功，全抛世事，教门用力，大起尘劳。 ”又无心地工夫，又不教门用力，因循过日，请自思之，是何人也？ 师云：因缘有数，非由人力，必顺自然，安以待命。 内功外行，全在自心，自能着力，自己有功，行与不行，各各自得。 教门不开，须当隐伏，心与天通； 教门既开，外功亦应，合天应人。 功不厌多，行不厌广，但在此心坚固，乃可成就耳。 师云：道无不在，头头皆是，色色俱真，惟在自己临时驱用，更别有甚么事？ 奈人心尘缘障重，不解根源，摘叶寻枝，随波逐浪，回机者少，迷执者多。 纵有钻研，不求真实，纽捏做造，见神见鬼，头上安头，颠回到顾，不悟幻身有限，光景难留，一息不来，如之何也？ 师云：凡日用者，心无杂念，意不外游，放而不逸，制而不拘，明心识法，去智离空，十二时中，念念现前。 若滞现前，亦非其理，若离现前，无有是处。 会动静，知去来，般般放下，无挂无碍，便是个逍遥自在底人也。 但说皆非，自当消息。 师云：天地者，万物之父母也。 天无不盖，地无不载，岂分别这个好、那个恶？ 一般盖载，一般临照。 故凡在上者，乃是天命教在上，当似天一般盖覆，安养存恤一切在下底人，不可分我尊尔卑； 凡在人之下者，亦是天命分定在下，当似地一般承奉于天，敬仰听从在上之人，不可丝毫怠慢。 既在天地之间，必须合天地之道也，不然则分外妄作，有凶祸刑罚也。 师云：修行人本宗上无亏，行业上用意，物境上速过去，人事里不住着，邪念不起，纤毫不立，微尘不染，晃朗虚明，不着空，不着有，不执法相，不执我见，兼众人之光明，久久相资，融通表里，便是圣贤地位，更有甚可疑也？ 师云：修行之人，行藏任分，取舍随宜，低下为心，中正为则，审动静之源，节视听之用，万缘齐断，一志真常，永劫绵绵，乃无变坏也。 师云：道人日用，体天法地，常清常静，明而不昧，济物利生，虽混于万尘诸境之间，真源湛寂，无有间断，自得出离生死结缚，此是一段大事因缘。 奈何不悟之人，中无主宰，欲情攻于内，根尘诱于外，不得自由，四生从此而轮回，六道因兹而走作，换却头皮，难同今日也。 师云：夫为道者，抱朴含淳，潜通默运，除情去欲，损损存存，于物无私，作事明白，曲己从人，修仁蕴德，丝毫之过必除，细微之功必积，是非俱泯，心法两忘，向上之机自然达矣。",
      "translated_text": "The Master said: In former days when I dwelt as abbot in Shandong, I shut my door all day and received no visitors, passing over a decade thus. My heart was set on stillness, yet I performed no meritorious deeds. Sitting alone where none came near, untouched by others—without encountering circumstances or things—how could this heart reveal either completion or ruin? It was but time idly spent. If heaven did not benefit things, the four seasons would not turn; if earth did not benefit things, the myriad beings would not grow. Failing to benefit oneself and others, what virtue is there? Thus the Perfected One of Everlasting Spring said: *\"In movement, bring peace to people and benefit to things\"*—for this accords with the Dao of heaven and earth.\n\nThe Master said: If a cultivator’s Mysterious Pass remains blocked and their mind-ground unclear, their karmic consciousness cannot abide in non-action—this is due to lack of merit and power. They should instead apply effort within the realm of action, following the teachings according to their capacity. Receive those who come with humility, keep the mind lowly, revere teachers and companions, constantly practice kindness, and cast aside selfishness and deceit. Over time, as conditions ripen, daily progress will bring breakthroughs. Is this not far better than carrying an empty burden at both ends? Unable to abide in non-action, yet unable to act—drifting through days without merit or practice, settling into comfort, indulging the palate, meddling in worldly affairs, seeking prominence in bustling places, indulging body and mind without fear of the divine, calculating gains and losses—have you not heard the words of the Perfected One of Everlasting Spring: *\"To cultivate the mind-ground, wholly cast aside worldly affairs; to labor in the teachings, stir up great dust and toil\"*? Yet if one lacks the work of the mind-ground *and* fails to labor in the teachings, drifting through days—ask yourself: what manner of person is this?\n\nThe Master said: Conditions and causes are fated, not subject to human effort. One must follow nature and await destiny with equanimity. Inner cultivation and outer conduct depend entirely on the self. If one applies effort, one gains merit; whether one acts or not, each reaps their own reward. If the teachings remain closed, one should withdraw and lie low, harmonizing the mind with heaven. When the teachings open, outer conduct must also respond, aligning with heaven and serving others. Merit is not嫌多, nor conduct嫌广—only when the mind is firm and steadfast can accomplishment be achieved.\n\nThe Master said: The Dao is present everywhere, manifest in all things. Every form is true; it depends solely on one’s timely application—what else is there? Alas, the human mind is burdened by worldly dust and karmic obstructions, failing to grasp the root. They pluck leaves and seek branches, drift with the waves, and few turn back. Even those who delve deeply do not seek truth, fabricating illusions, seeing spirits and ghosts, piling heads upon heads, turning back and forth in confusion. They do not awaken to the impermanence of the illusory body, the fleeting nature of time. When a single breath does not return—what then?\n\nThe Master said: In daily life, let the mind be free of杂念, the intent not wander outward. Release without dissipation, restrain without constraint. Illuminate the mind and recognize the dharma, abandoning cunning and departing from emptiness. In all twelve hours, let each thought arise in the present. If one clings to the present, this is not the principle; if one departs from the present, there is no such place. Harmonizing movement and stillness, knowing going and coming, letting go of all things without entanglement or obstruction—this is a person of carefree ease. Yet words all fall short; one must discern for oneself.\n\nThe Master said: Heaven and earth are the parents of the myriad things. Heaven covers all without exception; earth bears all without distinction. How could they favor one thing as good and another as bad? They cover and bear, illuminate and nourish equally. Thus, those in high positions are placed there by the mandate of heaven and should emulate heaven’s all-covering care, nurturing and cherishing all those below, making no distinctions of high and low. Those below are likewise ordained by heaven’s mandate and should emulate earth’s bearing of heaven, respecting and obeying those above without the slightest negligence. Dwelling between heaven and earth, one must accord with their Dao—otherwise, acting beyond one’s station invites misfortune, calamity, and punishment.\n\nThe Master said: The cultivator who remains unblemished in their original lineage, applies intention to conduct, swiftly passes through external phenomena, does not cling to human affairs, does not entertain wayward thoughts, establishes not even the slightest trace, and remains unstained by the tiniest speck—radiant, empty, and luminous, neither clinging to emptiness nor existence, neither grasping dharma-appearances nor self-views—who gathers the light of all beings and, over time, mutually sustains and harmonizes inner and outer, attains the station of the sages and worthies. What doubt remains?\n\nThe Master said: The cultivator should act or withdraw according to their lot, take or discard as fitting, keep the mind lowly, and take impartiality as their rule. Examine the source of movement and stillness, moderate the use of seeing and hearing, sever all karmic ties, and single-mindedly abide in the true and constant. Thus, through endless kalpas, they remain unchanging and indestructible.\n\nThe Master said: The Daoist in daily life embodies heaven and follows earth, ever pure and ever still, luminous yet not obscured. Benefiting beings and aiding life, though mingling amid the dust of the ten thousand phenomena, the true source remains profoundly tranquil, unbroken. Naturally, one escapes the bonds of birth and death—this is the great matter of karmic causes. Alas, the unawakened, lacking inner mastery, are assailed within by desire and tempted without by the senses. Unable to be free, the four kinds of birth revolve, the six paths turn—exchanging their very skin, never to be as they are today.\n\nThe Master said: Those who pursue the Dao embrace simplicity and contain purity, subtly penetrating and silently moving. They eliminate passion and abandon desire, diminishing and preserving, acting without selfishness, conducting affairs with clarity, yielding to others, cultivating benevolence and accumulating virtue. The slightest fault they remove; the most minute merit they accumulate. Right and wrong both dissolve; mind and dharma both forgotten. The mechanism of the highest truth naturally becomes clear.",
      "overlap_context": "ands majestically, making no distinctions, yet embracing all. Flowing water and piled stones, lush forests and abundant grasses, beasts running and birds singing—all manifest wondrous spiritual workings, each supporting the other. Like hemp supporting the mallow, they grow straight without need of support. Over time, each attains its fulfillment. If one sought to cut the long to patch the short, or change green to yellow, not only would none find peace, but their original nature would be lost.\"*",
      "start_char": 11322,
      "end_char": 12563,
      "start_sentence": 363,
      "end_sentence": 392,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.715888738632202,
      "metadata": {
        "source_file": "dao\\藏外\\栖云真人王志谨盘山语录.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "师云：修行之人当初出家，本为此性命事大，岁久不觉，为物所移，却学口头伎俩，百种所能，只是为奴作婢之事。 何以知之？ 但凡伎艺，必欲人前呈，似此不是为人所役也，岂是清净无为主人之事？ 所以道：“智者不为智者所用，而愚者用之； 巧者不为巧者所使，而拙者使之。 ”谓如辩者说之，默者听之，仔细详之，孰忙孰闲？ 凡欲修行，心地明白，而守愚拙，则天下之智巧者皆为之使用矣。 师云：向上师真所传要妙，行事之际密符天意，岂可执一端便为道哉？ 以迹观之，古人用处各各不同，妙本灵源未尝有异，喻如人心之用，在目为见，在耳为闻，在口为言，在心为思，在手为拈，在足为行，所用不同，心体无别。 况今师真密旨，所谓教外别传，言思路绝，悟者自得，乃是真师密传之妙也。 师云：吾道密传，不可以有心求，不可以无心得，以不知而知，以无得而得。 世之惑者，以服色求道，以言说求道，以威仪求道，以法相求道，俱不得其大全。 殊不知道无踪迹，以迹求之非道也。 复究此迹自何而来？ 知其所从来，则有非声色、非做造、非威仪、非法相者存于中，盖不可以知知、以识识也。 只是这个本分圆成、真真实实、合天地、合圣贤、合鬼神、合万物、如此一大事因缘，岂容尘垢声闻踪迹而能见之哉？ 丹阳真人云：“真乐真闲无议论，至微至妙绝商量。 ”没商量处却近也。 师云：出家人久居丛林，朝夕训诲，朝夕磨炼，尚且乖疏，因循不进，道心渐减，尘事日增，放荡猖狂，不能虚静，况在俗中孤行独立，尘情荏苒，爱境牵缠，障道因缘头头皆是，不自知觉，虽遇圣贤，不能劝化，百端纽捏，诳惑闾阎，迤逦沉沦，福消业长，渐渍深重； 若肯回头，犹能救得； 合尘背道，无可奈何，地狱不远矣。 师云：学道之人不厌参问，如人行路，勤问则不迷。 人间小伎无师则不得，况兹大道视之不见、听之不闻？ 初机不遇，凭何了悟？ 苦中之大，莫过生死，不亲近至人，如何免得？ 故云：“古人学道非草草，侍奉真师直到老。 ”若不知下手去处，又不亲近达人，虽有志行持，千差万错。 师云：自来学道之人，必须苦己利他，暗积功行。 若复纵心，非理行事，不惟有辱教门，抑亦自招殃咎。 为身为口，不清不俭，与俗无异，如此受用十方汗血之物，未是便宜，乐中受了，苦里还他，生死到头，更无支吾。 既居门下，何不炼心？ 或问曰：学道之人终夜不寐，其旨如何？ 答云：学人不寐，本以炼心为事。 若不收心，济甚么事？ 至如赌博弈棋、织纺罗磨之人夜夜不睡，则尽是得道底人耶？ 此等之人，十二时中，利心诱引，只是贪财，搅扰心灵，如蚊虻咂肤，故不得眠。 修行之人不同于此，睡是一欲，若不换过，滋长邪妄，暗昧不通，盖属阴界，如人防盗，端然坐待，其盗自退； 专以炼心，恐致流荡，谓此一心本无定体，在阳则明，在阴则暗，熟境不存，无为清静，性珠明了，此所以昼夜不寐也。 或问曰：学道之人甘受贫寒，其理安在？ 答云：若但认贫苦饥寒为是，则街头贫子艰难之人尽是神仙也。 盖修行之人以道德为心，以清净为念，削除诈伪，贪求妄作一时遣尽，忘形忘我，身外之物未尝用心，故有云：“遮皮盖肉衣，更选甚好弱？",
      "translated_text": "The Master said: When one first leaves the household life to cultivate the Way, it is fundamentally for this great matter of nature and destiny. Yet as the years pass unnoticed, one is swayed by external things, learning instead mere verbal tricks and a hundred kinds of skills—nothing more than the work of servants and maids. How can this be known? For all such arts and crafts must be displayed before others. Is this not being enslaved by others? How can it be the work of one who abides in pure non-action? Thus it is said: “The wise are not used by their wisdom, but the foolish use it; the skillful are not employed by their skill, but the clumsy employ it.” For example, the eloquent speak while the silent listen. Examine this carefully: which is hurried, and which is at ease? Those who wish to cultivate the Way must first clarify their mind-ground and then guard simplicity and clumsiness. Then all the wise and skillful under heaven will be at their service.\n\nThe Master said: The essential subtleties transmitted by the true teachers of the highest Way accord secretly with the will of Heaven in all their actions. How can one cling to a single aspect and call it the Dao? Observing their traces, the ancient ones each applied themselves differently, yet the wondrous source of their spiritual origin was never at variance. It is like the functioning of the human mind: in the eyes it sees, in the ears it hears, in the mouth it speaks, in the mind it thinks, in the hands it grasps, in the feet it walks. Though its functions differ, the essence of the mind remains unchanged. Moreover, the secret instructions of the true teachers—what is called “a special transmission outside the teachings”—transcend words and thoughts. Those who awaken attain it for themselves; this is the wondrous subtlety of the true teacher’s secret transmission.\n\nThe Master said: My Dao is secretly transmitted. It cannot be sought with intention, nor attained without intention. It is known through not-knowing, attained through not-attaining. The deluded of this world seek the Dao through attire, through speech, through demeanor, through dharma-forms—none grasp its great completeness. They do not realize that the Dao leaves no traces; to seek it through traces is not the Dao. Further, investigate: from whence do these traces arise? Knowing their origin, one finds that what abides within is beyond sound and form, beyond fabrication, beyond demeanor, beyond dharma-forms. It cannot be known by knowing, nor recognized by recognition. It is simply this: the original perfection, truly real, uniting with Heaven and Earth, with sages and worthies, with spirits and ghosts, with the myriad things. How could the dusty traces of voice-hearers ever perceive it? As the Perfected One of Danyang said: “True joy, true leisure—beyond all discussion. Most subtle, most wondrous—beyond all deliberation.” Where there is no deliberation, one draws near.\n\nThe Master said: Those who leave the household life and dwell long in the monastic community, receiving instruction and discipline morning and evening, may still grow negligent, procrastinate, and fail to advance. Their resolve for the Dao weakens day by day, while worldly affairs increase. Reckless and unrestrained, they cannot abide in emptiness and stillness. How much more so for those who remain in the world, solitary and independent, their worldly passions lingering, entangled in objects of desire? Obstacles to the Dao arise at every turn, yet they remain unaware. Even if they encounter sages and worthies, they cannot be transformed. With a hundred deceptions, they delude the marketplace, gradually sinking into perdition. Their blessings diminish while their karma grows, their transgressions deepening day by day. If they would but turn their heads, they might still be saved. But if they cling to the dust and turn from the Dao, there is nothing to be done—hell is not far off.\n\nThe Master said: Those who study the Dao should never weary of inquiry and questioning. It is like one traveling a road: by asking diligently, one does not go astray. Even in worldly skills, without a teacher one cannot succeed. How much more so with this great Dao, which cannot be seen or heard? Without encountering a teacher at the outset, by what means could one awaken? Of all sufferings, none is greater than birth and death. Without drawing near to a perfected one, how can one escape? Thus it is said: “The ancients did not study the Dao lightly; they served true teachers until old age.” If one does not know where to begin, nor draws near to those who have attained, then even with resolve and practice, a thousand errors and ten thousand mistakes will arise.\n\nThe Master said: Those who study the Dao from the beginning must discipline themselves for the benefit of others, silently accumulating merit and conduct. If one indulges the mind and acts without principle, not only does one disgrace the teaching, but one also brings misfortune upon oneself. To serve the body and mouth without purity or frugality, no different from the worldly—such a one consumes the sweat and blood of the ten directions, and this is no small matter. What is enjoyed in ease must be repaid in suffering. When birth and death arrive at last, there will be no escape. Since you dwell within this gate, why not refine the mind?\n\nSomeone asked: What is the meaning of a cultivator of the Way remaining sleepless through the night?\nThe Master replied: The cultivator does not sleep in order to refine the mind. If the mind is not gathered in, what is accomplished? Consider those who gamble, play chess, weave, spin, or grind—those who stay awake all night—are they all people who have attained the Dao? Such people, in all twelve hours of the day, are lured by the mind of profit. They are merely greedy for wealth, their minds agitated like mosquitoes biting the skin, and so they cannot sleep. The cultivator of the Way is not like this. Sleep is one of the desires. If it is not transformed, it nourishes delusion and ignorance, belonging to the yin realm. It is like one guarding against thieves, sitting upright and waiting—then the thieves retreat of themselves. In refining the mind, one must be vigilant lest it drift away. For this mind has no fixed substance: in yang it is bright, in yin it is dark. When familiar states do not arise, there is non-action and purity. The luminous pearl of nature shines clearly—this is why one remains sleepless day and night.\n\nSomeone asked: What is the principle behind cultivators of the Way willingly enduring poverty and cold?\nThe Master replied: If one merely takes poverty, suffering, hunger, and cold to be correct, then all the destitute and struggling people on the streets would be immortals. The cultivator of the Way takes virtue and the Dao as the mind, purity as the thought, cutting away deceit and falsehood, greed and reckless action—all dispatched in an instant. Forgetting form and self, one does not fix the mind on things outside the body. Thus it is said: “This skin covering the flesh—what better or worse is there to choose?”",
      "overlap_context": " Those who pursue the Dao embrace simplicity and contain purity, subtly penetrating and silently moving. They eliminate passion and abandon desire, diminishing and preserving, acting without selfishness, conducting affairs with clarity, yielding to others, cultivating benevolence and accumulating virtue. The slightest fault they remove; the most minute merit they accumulate. Right and wrong both dissolve; mind and dharma both forgotten. The mechanism of the highest truth naturally becomes clear.",
      "start_char": 12565,
      "end_char": 13821,
      "start_sentence": 393,
      "end_sentence": 433,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.34688401222229,
      "metadata": {
        "source_file": "dao\\藏外\\栖云真人王志谨盘山语录.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "填肠塞肚饭，更择甚精粗？ ”唯究生死，炼心为事，故不念形骸之苦也。 或问曰：未来罪福还有也无？ 答云：未来且莫论，据现在言之。 汝发一心，欲于圣前焚香礼拜，以手拈香，其心发愿云：愿家眷平安，增福添寿。 此不是作善底心，便望得福，虽得福亦不知。 盖修善者明修而暗报，故未尝有知者。 若汝发一恶念，持刀杀人，才举此心，便承当偿命，此必不可于分明至公处作得，伺其暗昧不测中造下，不久败露，便当偿命。 此不是望罪得罪，此罪明知，盖作恶者暗作而明报。 此则现在人为，必然分明之事，况天伺察人所不知者，何方逃之？ 不可不戒。 或问曰：天堂地狱，从来有说，还真实否？ 答云：天堂者阳界，主善主福，地狱者阴界，主恶主祸。 古人立教，天堂地狱出自人心，心行所为，冥然相应，谓如常清常静，利益一切，诸善奉行，明白不昧，便属阳界； 种种诸恶，坑陷不平，旁生邪道，便属阴界，无明黑暗，逐旋增长，滓秽尘垢皆属黑簿，人神不容，心君懊恼，众苦交煎，无人救援，便是地狱。 古人云：“心清意静天堂之路，心慌意乱地狱之门。 ”喻如有一山路，闻人传说有杀人贼，邀截行路，往往害人； 若心信从，退步不行，后必无害，若心不信，酩酊前行，及至山中，无事则已，若实有贼，即落奸徒之便，悔之何及？ 地狱之说，亦如此义。 大抵为恶不如作善，善纵无报，有何罪过？ 恶道强行，凶祸及矣。 目前明白，尚无改悔，何况幽冥岂得预知？ 或问曰：有云向上一事人人俱足，更煅炼作甚么？ 答云：凡心未炼，喻如石矿中有白金，未经煅炼，只是顽石。 置之大冶洪炉，炼去滓秽，分出真物，既已成金，不复为矿。 修行之人亦复如此，将从来蒙昧染着之心，便同顽矿，以志节为大治，以慧照为工匠，殷勤煅炼，一毫不存，炼出自己本初无碍底真心。 既已成真，不复为假，当自保护，坚固收藏，自得受用，此便是亘古圆明底无价宝珠也。 或问曰：若到清净无为处，是彻也未？ 答云：此以体言，似是而非也。 至于端的处，则不可言，不可思，不可以知知，不可以识识，妙绝名言，方始相应，不即动静，不离动静，岂可以无为清静而定之哉？ 或问曰：昔闻丹阳师父以悟死而了道速，其旨如何？ 答云：修行人当观此身如一死囚，牵挽入市，步步近死，以死为念，事事割弃，虽有声色境物纷华周匝围绕，目无所见，耳无所闻，念念尽忘，此身亦舍，何况其它？ 以此炼心，故见功疾，死中得活，不生不死。 学道初机，救护生死，当作是念。 人生顷刻，一息不来，便是死地。 紧切用心，勤修精进，遣尽凡心，自利利他，递相救拔，不可因循也。 或问曰：心无染着，放旷任缘，合道也未？ 答云：起心无着，便是有着，有心无染，亦着无染，才欲静定，已堕意根，纵任依他，亦成邪见。 无染无着，等是医药，无病药除，病去药存，终成药病。 言思路绝，方始到家，罢问程途矣。 师云：道无言说，惟指善恶，善则成就无上出世因缘，有天堂无地狱，恶则堕落无边苦趣，有地狱无天堂。 分此二途，盖因迷悟，悟则剎那成圣，迷则永劫沉沦。 幸得人身，宁不思之？ 师云：凡圣同途，只因明昧，明之则为圣，昧之则为凡，凡人之心，不肯刳情去执，弃妄除邪，逐境迁流，随情宛转，取一时之乐，积万劫之殃，不省不思，莫悟莫觉。",
      "translated_text": "Filling the belly with food—what need to choose between fine and coarse?” One investigates birth and death and takes the refinement of the heart as one’s task, thus paying no heed to the suffering of the body.\n\nSomeone asked: Are there still future retributions of sin and blessing?\nThe Master replied: Let us not speak of the future; consider only the present. When you set your mind to it and wish to burn incense and bow before the sacred, taking the incense in hand, your heart forms a vow: “May my family be safe, may fortune and longevity increase.” This is not the mind that performs good, yet you expect to receive blessing—even if you do receive it, you will not know. For those who cultivate goodness, the cultivation is clear but the recompense is hidden, and thus there is never one who knows. If you conceive an evil thought and take up a knife to kill, the moment this mind arises, you must repay with your life. This cannot be done openly in a place of perfect justice; one waits for the obscure and unfathomable moment to commit the deed, yet before long it is exposed, and you must repay with your life. This is not hoping for sin and receiving sin—this sin is clearly known. For those who do evil, the act is hidden but the retribution is manifest. These are the evident matters of human action; how much more does Heaven observe what people do not know? Where can one flee? One cannot but be cautious.\n\nSomeone asked: Heaven and hell have long been spoken of—are they real?\nThe Master replied: Heaven is the yang realm, governing goodness and blessing; hell is the yin realm, governing evil and misfortune. The ancients established teachings: heaven and hell arise from the human heart. The conduct of the heart responds obscurely. If one is constantly pure and still, benefiting all, practicing all goodness with clarity and without delusion, one belongs to the yang realm. If one commits all manner of evil, scheming and entrapping, following perverse paths, one belongs to the yin realm—ignorance and darkness grow in turn, and filth and defilement all enter the black register. Neither humans nor spirits tolerate it; the sovereign of the heart is vexed, myriad sufferings press in, and no one comes to the rescue—this is hell. As the ancients said: “A clear heart and tranquil mind are the path to heaven; a confused heart and disordered mind are the gate to hell.” It is like a mountain path where one hears rumors of bandits lying in wait to rob and kill travelers. If you believe it and retreat, you will avoid harm; if you do not believe it and proceed drunkenly, should there be no trouble, all is well—but if bandits truly lie in wait, you fall into their trap, and repentance comes too late. The teaching of hell is of this same principle. Generally, doing evil is not like doing good. Even if good brings no reward, what fault is there? Forcing one’s way in evil paths brings calamity. If one does not repent even when the truth is clear before one’s eyes, how can one foresee the hidden and obscure?\n\nSomeone asked: It is said that the supreme matter is complete in every person—why refine it further?\nThe Master replied: The ordinary mind, unrefined, is like white gold within ore—before smelting, it is but a stubborn stone. Placed in the great furnace, impurities are burned away, and the true substance is separated. Once it becomes gold, it is no longer ore. The cultivator is likewise: taking the mind, long obscured and stained, as crude ore, using resolve as the great furnace and wisdom as the smith, diligently refining it until not a trace remains, one smelts forth one’s own originally unimpeded true heart. Once it is true, it is no longer false. One must protect it, guard it firmly, and store it away, thus enjoying its use—this is the priceless, eternally luminous pearl of antiquity.\n\nSomeone asked: When one reaches the state of purity and non-action, has one penetrated through?\nThe Master replied: Speaking in terms of substance, this seems so but is not. As for the true matter, it cannot be spoken, cannot be thought, cannot be known by knowing, cannot be recognized by recognizing. Only when subtlety transcends names and words does it begin to correspond. It neither adheres to movement nor stillness nor departs from them—how can it be fixed as non-action and purity?\n\nSomeone asked: I once heard that Master Danyang attained the Dao swiftly by awakening to death—what is the meaning of this?\nThe Master replied: The cultivator should regard this body as a condemned prisoner being dragged to the execution ground, each step bringing one closer to death. Taking death as one’s thought, one abandons all things. Though sounds, sights, and splendid surroundings encircle one, the eyes see nothing, the ears hear nothing, every thought is forgotten, and even this body is relinquished—how much more all else? Refining the heart in this way, one sees swift attainment, gaining life within death, neither born nor dying. Those newly entering the Dao, seeking to escape birth and death, should hold this thought. Human life is but a moment; if a single breath does not come, one is in the realm of death. Apply the mind urgently, cultivate diligently, dispel the ordinary mind, benefit oneself and others, and rescue one another in turn. One cannot be negligent.\n\nSomeone asked: If the heart is without defilement and one roams freely, following conditions, does this accord with the Dao?\nThe Master replied: To set the mind on being without attachment is to be attached; to have a mind without defilement is to be attached to non-defilement. The moment one desires stillness and concentration, one has already fallen into the root of intention. Following conditions and relying on others still becomes a perverse view. Being without defilement and without attachment are both medicine. When there is no illness, the medicine is removed; if the illness departs but the medicine remains, it ultimately becomes a medicinal illness. Only when the paths of speech and thought are cut off does one arrive home. There is no longer any need to ask about the journey.\n\nThe Master said: The Dao cannot be spoken of; one can only point to good and evil. Goodness completes the supreme, world-transcending cause—there is heaven and no hell. Evil leads to falling into boundless suffering—there is hell and no heaven. These two paths arise from delusion and awakening. In awakening, one becomes a sage in an instant; in delusion, one sinks for endless kalpas. Having fortunately obtained a human body, how can one not reflect?\n\nThe Master said: The paths of the ordinary and the sage are the same; it is only a matter of clarity and obscurity. In clarity, one is a sage; in obscurity, one is ordinary. The heart of the ordinary person is unwilling to carve away emotions and relinquish attachments, to abandon falsity and remove perversity. Drifting with circumstances, turning with passions, seeking momentary pleasure, one accumulates eons of calamity—unaware, unthinking, unenlightened, unawakened.",
      "overlap_context": ": If one merely takes poverty, suffering, hunger, and cold to be correct, then all the destitute and struggling people on the streets would be immortals. The cultivator of the Way takes virtue and the Dao as the mind, purity as the thought, cutting away deceit and falsehood, greed and reckless action—all dispatched in an instant. Forgetting form and self, one does not fix the mind on things outside the body. Thus it is said: “This skin covering the flesh—what better or worse is there to choose?”",
      "start_char": 13821,
      "end_char": 15118,
      "start_sentence": 434,
      "end_sentence": 477,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.76161241531372,
      "metadata": {
        "source_file": "dao\\藏外\\栖云真人王志谨盘山语录.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "师云：修行人先要明自己本宗，次要通教化。 若本宗不通，如人无目，不分道路，举足差讹； 若教化不明，如人有目而坐黑暗中，则有偏执我见。 须要俱通，方得圆应； 若俱不通，如大暗中坐而又无目，何时得出也？ 或问曰：道家常论金丹，如何即是？ 答云：本来真性即是也，以其快利刚明，变化融液，故曰金； 曾经煅炼，圆成具足，万劫不坏，故名丹。 体若虚空，表里莹彻，一毫不挂，一尘不染，辉辉晃晃，照应无方。 故师祖云：“本来真性号金丹，四假为炉炼作团，不染不思除妄想，自然滚出赴仙坛。 ”世之人有言金丹于有形象处作造，及关情欲，此地狱之见，乃淫邪之所为，见乖人道，入旁生之趣矣。 师云：学道之人，于万事不干处，诸尘不染处，与天地相通处，向这里体究彻，则“先天而天弗违，后天而奉天时，天且弗违，而况于人乎？ 况于鬼神乎？ ”",
      "translated_text": "The Master said: Those who cultivate the Way must first clarify their own fundamental teaching, then thoroughly understand transformative instruction. If the fundamental teaching is not understood, it is like a person without eyes—unable to distinguish the path, each step erring and faltering. If transformative instruction is not clear, it is like a person with eyes sitting in darkness, then falling into partiality and self-view. One must master both to respond with perfect completeness. If neither is mastered, it is like sitting in great darkness while also being eyeless—when will one ever emerge?\n\nSomeone asked: Daoists often speak of the Golden Elixir—what does this mean?\nThe Master replied: The original true nature is precisely this. As it is swift, sharp, firm, and luminous, transforming and melting all, it is called \"gold.\" Having undergone refinement and tempering, perfectly complete and indestructible for ten thousand kalpas, it is named \"elixir.\" Its substance is like empty space, inwardly and outwardly radiant and translucent, not clinging to the slightest thread, unstained by a single speck of dust, shining brilliantly, illuminating and responding without limit. Thus, the ancestral master said:\n*\"The original true nature is called the Golden Elixir,\nThe four temporal conditions are the furnace that refines it into a sphere.\nUnstained and thought-free, delusions dispelled,\nNaturally it rolls forth to ascend the immortal’s altar.\"*\n\nPeople of the world who speak of the Golden Elixir as something fabricated in form, tied to passions and desires, hold views of hell—these are the deeds of the lewd and deviant. Such views deviate from the human Dao and lead one into the realm of beasts.\n\nThe Master said: Those who study the Dao, in the place where they are untouched by the myriad affairs, unstained by the dust of the senses, and in communion with heaven and earth—here they must thoroughly investigate and penetrate. Then, *\"Before heaven, heaven does not oppose it; after heaven, it follows heaven’s timing. If even heaven does not oppose it, how much less do humans? How much less do ghosts and spirits?\"*",
      "overlap_context": " how can one not reflect?\n\nThe Master said: The paths of the ordinary and the sage are the same; it is only a matter of clarity and obscurity. In clarity, one is a sage; in obscurity, one is ordinary. The heart of the ordinary person is unwilling to carve away emotions and relinquish attachments, to abandon falsity and remove perversity. Drifting with circumstances, turning with passions, seeking momentary pleasure, one accumulates eons of calamity—unaware, unthinking, unenlightened, unawakened.",
      "start_char": 15120,
      "end_char": 15471,
      "start_sentence": 478,
      "end_sentence": 491,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.388890743255615,
      "metadata": {
        "source_file": "dao\\藏外\\栖云真人王志谨盘山语录.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "或问曰：如何是玄妙？ 答云：谁教汝作此问？ 其人拱手云：弟子自出意来。 答云：恁么，则汝自会也。 其人笑而稽首。 或问曰：既往者不追，未来者不预，现在当如何？ 答云：灭动不灭照，更要会得这个灭动底是谁？ 得则权柄在手，灭也由汝，不灭也由汝。 或问曰：未来过去心则不问，如何是现在心？ 师正视云：此不是现在。 复低头云：此不是现在。 反问云：汝会得也未？ 其人笑云：会不得。 师复云：大开着眼，一个现在也不会，更说甚过去未来？ 或问曰：如何是祸福？ 答云：积木成林，积石成山，积水成海，积善成福，积恶成祸，祸福之源，本自一心，积之方成。 可不慎之？ 或问曰：如何是善恶？ 答云：一切好心皆为善，一切不平心皆为恶，人不知之善为大善，人不知之恶为大恶，善恶都不思处，别有向上事在。 或问曰：常人亦有病，道人亦有病，如何是别处？ 答云：昔者丹阳师有疾而医者不能诊其脉，壶丘子端坐而相者不能得其真，何也？ 心不在物则造化不能移，性不离宗（着空）则鬼神莫能测，况医卜之凡乎？ 此与常人异也。 师云：修行之人正眼不开，圆机不发，但向别人踪迹上寻觅，言句上裁度，终无是处，喻如无眼人，虽闻人说日月之光，终不自见，只是想象，盖不曾向自己心上下工夫也。 或问曰：动静境中，如何即是？ 答曰：自心清静，虽有稠人闹市冗攘之间，不干己事，从他扰扰，却同静室中，百无所有。 若在圜堵静室，无人乡里，一似十字街头，对圣对真，不敢起丝毫妄念，如此则在动境里也不碍，静境内也不碍，更有甚分外惑人之事？ 或问曰：既言和光同尘，却道不着事，如何？ 答云：天是天，地是地，山是山，水是水，物是物，我是我，虽与混同，如何相着得？ 或问曰：万形万状，各各不同，怎生一体同观得？ 答云：天是道，地是道，万物皆是道，彼亦是道，此亦是道，形象虽殊，道无不在，如何不同得？ 或问曰：人皆取乐，道人就苦，何也？ 答云：世人不知真乐，以心肯处为乐，被欲心引在苦处，便认苦为乐，每日用心计度，专求世乐，不得则忧苦搅扰，心灵永无自在，是谓大苦。 学道之人不求世乐，心存大道，遇苦不苦，无苦则常乐，心得自在。 凡有乐则有苦，无乐则无苦。 心无苦乐，乃所谓真乐也。 或问曰：如何出得罪福因果？ 答云：罪福因果属阴阳之壳，若汝出得阴阳之壳，则无罪福因果也。 如何是阴阳壳？ 但凡心上起一毫头许私邪利欲恶念，便属阴壳，有一毫头许善念，便属阳壳，在阴则有恶报，在阳则有善报。 若曾炼心，体如虚空，亦无善亦无恶，无丝毫挂碍处，作主得，则祸福着他不得，因果挽他不着，便是个出阴阳壳底人也。 在家之人，未曾有一善念在心，十二时中只是图财图利，汝死我活，坑人陷人，一片无明黑暗业心，则堕在阴阳壳内，阳道上也去不得，怎生出得阴阳壳？ 便待要无罪福，无因果，不亦难乎？ 汝自造下，怎生避得？",
      "translated_text": "Someone asked, *\"What is the mysterious and wondrous?\"*\nThe answer came: *\"Who taught you to ask this?\"*\nThe questioner clasped his hands and said, *\"This disciple conceived it himself.\"*\nThe answer came: *\"If so, then you already understand.\"*\nThe questioner laughed and bowed in reverence.\n\nSomeone asked, *\"The past is not to be pursued, the future not to be anticipated—what of the present?\"*\nThe answer came: *\"Extinguish movement but not illumination. Yet you must further comprehend: who is it that extinguishes movement? Once attained, the power rests in your hands—whether to extinguish or not is yours to decide.\"*\n\nSomeone asked, *\"I do not ask of the past or future mind—what is the present mind?\"*\nThe Master looked straight ahead and said, *\"This is not the present.\"*\nThen he lowered his head and said, *\"This is not the present.\"*\nTurning back, he asked, *\"Do you understand?\"*\nThe questioner laughed and said, *\"I do not.\"*\nThe Master replied, *\"With eyes wide open, you fail to grasp even the present—how then speak of past or future?\"*\n\nSomeone asked, *\"What are fortune and misfortune?\"*\nThe answer came: *\"Piling wood makes a forest; piling stones makes a mountain; piling water makes a sea. Piling goodness makes fortune; piling evil makes misfortune. The source of fortune and misfortune lies in the mind alone—only through accumulation do they take form. Can one not be cautious?\"*\n\nSomeone asked, *\"What are good and evil?\"*\nThe answer came: *\"Every kind thought is good; every unbalanced thought is evil. The goodness unknown to others is the greatest good; the evil unknown to others is the greatest evil. Yet where neither good nor evil is contemplated, there lies something beyond.\"*\n\nSomeone asked, *\"Ordinary people fall ill, and Daoists fall ill—what is the difference?\"*\nThe answer came: *\"Long ago, Master Danyang fell ill, yet physicians could not read his pulse. Master Huqiu sat in stillness, yet diviners could not discern his truth. Why? When the mind is not bound to things, creation cannot alter it; when nature does not stray from its source, even ghosts and spirits cannot fathom it—how much less the common arts of medicine or divination? This is how it differs from ordinary people.\"*\n\nThe Master said: *\"Those who cultivate the Dao yet fail to open their true eye or awaken their perfect mechanism merely chase after others’ footprints, measuring words and phrases—all in vain. It is like a blind man hearing others speak of the sun and moon’s light yet never seeing it himself, only imagining. This is because he has not worked upon his own mind.\"*\n\nSomeone asked, *\"In the midst of movement and stillness, how can one be thus?\"*\nThe answer came: *\"When the mind is pure and still, even amid bustling crowds and clamorous markets, if it concerns not oneself, let the world clamor—it is no different from an empty chamber where nothing exists. Yet if in a secluded cell, far from others, one stands as if in a crossroads marketplace, facing the sacred and true without daring to entertain the slightest delusion—then neither movement nor stillness hinders. What further confusion could arise?\"*\n\nSomeone asked, *\"If one harmonizes with the world yet remains unattached to things, how is this so?\"*\nThe answer came: *\"Heaven is heaven, earth is earth, mountains are mountains, waters are waters, things are things, and I am I. Though mingling with all, how can they truly attach?\"*\n\nSomeone asked, *\"All forms and shapes differ—how can they be seen as one?\"*\nThe answer came: *\"Heaven is the Dao, earth is the Dao, the myriad things are the Dao. That is the Dao, this is the Dao. Though forms vary, the Dao is everywhere present—how can they not be one?\"*\n\nSomeone asked, *\"People seek joy, yet Daoists embrace hardship—why?\"*\nThe answer came: *\"Worldly people know not true joy. They take what pleases the heart as joy, yet desire leads them into suffering, mistaking it for joy. Daily, they scheme and calculate, seeking worldly pleasures. When unfulfilled, they are beset by sorrow and disturbance, their spirits never at ease—this is the greatest suffering. Those who study the Dao do not seek worldly joy. Their minds abide in the great Dao, encountering hardship without suffering. Without suffering, there is constant joy, and the heart attains freedom. Where there is joy, there is suffering; without joy, there is no suffering. A mind free of both joy and suffering—this is true joy.\"*\n\nSomeone asked, *\"How can one transcend the causes of sin and fortune?\"*\nThe answer came: *\"Sin and fortune belong to the shell of yin and yang. If you step beyond this shell, then there is no sin or fortune. What is the shell of yin and yang? Whenever the slightest selfish, perverse, covetous, or malevolent thought arises in the mind, it belongs to the yin shell. Even the slightest good thought belongs to the yang shell. Within yin, there is retribution for evil; within yang, there is reward for good. But if one has refined the mind until it is like empty space—neither good nor evil, without the slightest entanglement, and master of oneself—then fortune and misfortune cannot touch them, and cause and effect cannot sway them. This is one who has stepped beyond the shell of yin and yang. Laypeople, never harboring a single good thought, spend their days scheming for wealth and profit, living at others’ expense, deceiving and entrapping—all is a single mass of dark, ignorant karma. They remain trapped within the shell of yin and yang, unable even to tread the yang path—how then could they step beyond it? If you seek to be free of sin and fortune, free of cause and effect, is it not difficult? You have forged this yourself—how can you escape?\"*",
      "overlap_context": "Such views deviate from the human Dao and lead one into the realm of beasts.\n\nThe Master said: Those who study the Dao, in the place where they are untouched by the myriad affairs, unstained by the dust of the senses, and in communion with heaven and earth—here they must thoroughly investigate and penetrate. Then, *\"Before heaven, heaven does not oppose it; after heaven, it follows heaven’s timing. If even heaven does not oppose it, how much less do humans? How much less do ghosts and spirits?\"*",
      "start_char": 15472,
      "end_char": 16629,
      "start_sentence": 492,
      "end_sentence": 535,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 27.584376573562622,
      "metadata": {
        "source_file": "dao\\藏外\\栖云真人王志谨盘山语录.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "所以低头合眼，教他阎老理会去也。 或问曰：未来托生之事，端的如何？ 答云：人生一世，随情自造，成个来世底模子，作善底造下个善模子，作恶底造下个恶模子，以至尽此报身，一性离却这个壳子，如故铁镕成金汁，被造物者倾在自造底模子内，或为人，或为旁生，自作自受去也。 造物者岂有心教汝为旁生，岂有心教汝为六道？ 是汝一生自造底壳子落在其中，逃避不得。 先有此性，便有此物，谓如狠毒者为蛇，悭吝者为犬，淫杀者为豕，贪暴者为狼，大概皆类此。 天地之间，万形万状，不可言尽，皆自作自受。 故古人云：“同于金石，化为金石，同于水火，化为水火。 ”其言信也。 瞬息之间，一失人身，万劫不复。 何不思之？ 或问曰：某今老迈，不能多学，乞师向无上极玄极妙处说一句。 答云：把汝这个求无上极玄极妙底去了，则便是也。 或问曰：天下立教，各说异端，自是非他邪正，未知谁是？ 答云：此有两端，有修炼者，有应世者。 修炼此心如天地一般清静，日月一般明白，四时一般运化，能应其事，能归其根，更莫问向上如何，只此便是正道之作用也，惟修炼者能之。 若口头念诵得，如法身上装束得，作相一个个堪看，使人人见喜，此是教门中应世底枝梢花叶，干甚修炼事？ 干甚正道事？ 此是权时使用。 况兼心上争人争我，争财争利，心与俗人一般，怎生道得我是正教也？ 明目者识之。",
      "translated_text": "Thus, bow your head and close your eyes—let Old Yan* attend to it.\n\nSomeone asked: What truly becomes of the matter of future rebirth?\nThe answer: A human life, shaped by its own passions, forges the mold for its next existence. Those who do good create a mold of goodness; those who do evil create a mold of evil. When this karmic body is spent and the one nature departs this shell, it is like iron smelted into molten gold—poured by the Creator into the self-made mold, becoming human or beast, each reaping what it has sown. Does the Creator intend for you to become a beast? Does it intend for you to enter the Six Paths? No—it is the shell you have forged in this life that traps you, inescapably. Where this nature goes, so follows its form: the cruel become serpents, the miserly become dogs, the lustful and murderous become swine, the greedy and violent become wolves—all generally follow this pattern. Between heaven and earth, the myriad forms and shapes are beyond enumeration, each self-made and self-endured. Thus the ancients said: *\"Associate with metal and stone, and you become metal and stone; associate with water and fire, and you become water and fire.\"* Their words are true. In an instant, one loses the human form, and for ten thousand kalpas it is not regained. Why not reflect on this?\n\nSomeone asked: I am now old and cannot study much—pray, Master, speak a word of the utmost mystery and wonder.\nThe answer: Cast aside your search for the utmost mystery and wonder, and that is it.\n\nSomeone asked: The teachings of the world each claim their own truth, distinguishing right from wrong, orthodoxy from heterodoxy—how can one know which is true?\nThe answer: There are two paths: one of cultivation, and one of worldly engagement. Those who cultivate make this mind as clear and still as heaven and earth, as bright as the sun and moon, as ceaselessly transforming as the four seasons. They respond to affairs yet return to their root—ask not what lies beyond, for this is the very functioning of the true Dao. Only those who cultivate can achieve this. As for those who recite scriptures with their lips, adorn the Dharma-body with fine trappings, and present themselves as pleasing figures to win others’ admiration—these are but the branches, flowers, and leaves of the teaching, used for worldly engagement. What do they have to do with cultivation? What do they have to do with the true Dao? They are but temporary expedients. Moreover, if their hearts are filled with strife—over self and others, wealth and profit—no different from the common folk, how can they claim to represent the true teaching? Let those with clear eyes see this.\n\n---\n*[Note: \"Old Yan\" (阎老) refers to Yanluo Wang (閻羅王), the judge of the underworld in Chinese mythology.] (Omitted in final output as per guidelines.)",
      "overlap_context": "ed beyond the shell of yin and yang. Laypeople, never harboring a single good thought, spend their days scheming for wealth and profit, living at others’ expense, deceiving and entrapping—all is a single mass of dark, ignorant karma. They remain trapped within the shell of yin and yang, unable even to tread the yang path—how then could they step beyond it? If you seek to be free of sin and fortune, free of cause and effect, is it not difficult? You have forged this yourself—how can you escape?\"*",
      "start_char": 16629,
      "end_char": 17177,
      "start_sentence": 536,
      "end_sentence": 556,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.890726327896118,
      "metadata": {
        "source_file": "dao\\藏外\\栖云真人王志谨盘山语录.txt",
        "category": "藏外"
      }
    }
  ]
}