{
  "source_id": "桓真人升仙记",
  "source_file": "chunked_daozang\\桓真人升仙记.json",
  "total_chunks": 6,
  "total_original_chars": 5681,
  "total_translated_chars": 33997,
  "total_translation_time": 173.343177318573,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\记传类\\桓真人升仙记.txt",
    "category": "记传类"
  },
  "full_translation": "**The Record of Perfected Huan’s Ascension to Immortality**\n\n*Scripture Title:* *The Record of Perfected Huan’s Ascension to Immortality*. One scroll. Base text from *Daoist Canon of the Zhengtong Era*, *Dongzhen* section, *Records and Biographies* category.\n\nThe Perfected Immortal Lord Li Huan of Huagai Mountain in Western Shu transmitted the Dao to Perfected Huan Kai. The Immortal Lord bestowed his name upon his disciple as a surname, hence he was called Huan, though this was not his original family name.\n\nOne day, the Immortal Lord said to his disciple Huan Kai: \"You have already obtained the great elixir of golden cinnabar, and you comprehend all the secrets of flying steps and concealment. Yet you have not yet heard of the Great Dao.\"\n\nKai replied: \"Your disciple has followed you for thirty years, Master. I have long known that you possess three wondrous treasures: the *True Talismans of the Three Luminaries*, the *Essentials of the Five Spirits*, the *Net of the Eight Poles*, and the *Silent Audience with the Supreme Emperor*. None of your disciples have dared to inquire about these. I humbly beseech you, Immortal Lord, to instruct me in the supreme Dao, that I may cultivate and realize non-action and swiftly attain the profound principle.\"\n\nThe Immortal Lord said: \"The *True Talismans of the Three Luminaries* are techniques for ingesting and wearing to prolong life. The *Essentials of the Five Spirits* and the *Net of the Eight Poles* are sacred texts of the heavens. The *Silent Audience with the Supreme Emperor* is the wondrous gate of ascension and the true essence of cloud-riding—these are not yet for you to hear.\"\n\nKai purified his heart and strengthened his resolve, his incense and devotion growing ever more focused. For five years, he toiled diligently without daring to ask again.\n\nOne day, the Immortal Lord sighed deeply and said: \"When heaven and earth harmonize, the sun and moon bring auspicious responses, and the wondrous principle is complete. When mountains and rivers flourish, bright pearls are born, and gold and jade glisten. When grasses and trees thrive in lush abundance, fragrant herbs vie in beauty, and sacred mushrooms emerge. When phoenixes and simurghs gather in flocks, and auspicious clouds stretch across the sky, sages and worthies reside therein. When the stars align in order, the sun has its double wheels, and propitious stars appear, blessings respond to the nation’s destiny. Heaven and earth, grasses and trees, mountains and rivers, birds and beasts—all receive the pure, harmonious qi of the primordial void and manifest auspicious signs. Yet humans, born between heaven and earth, merely await death and nothing more.\n\nThe transformations of the Supreme Mysterious Perfected and the primordial purity of the Celestial Venerable—true immortals leave behind the arts of deathlessness in the world. Yet among the millions over countless years, some study these arts, exhausting their spirits and toiling their minds, clinging to suffering and vexation, deludedly pursuing karmic deeds, willingly enduring hardship. They do not know that beyond the mist and clouds lies a realm of transcendence, a land of undying light; that within the dark sea grows the medicine of returning souls, the elixir of immortality. How could they know of riding the six dragons to ascend the eight poles, or driving the nine phoenixes to roam Kunlun? The jade trees remain ever-spring for a thousand years; the golden peaches bear fruit but once in ten thousand moments. In the Palace of Vast Cold, the heat of summer brings no guests fanning themselves; in the courtyards of the Purple Palace, the depths of winter see few who burn firewood. As for jade towers and orchid pavilions, jeweled halls and layered towers, phoenix gates and silver bridges, resplendent cities and radiant gardens—where pearl light dazzles and joy knows no bounds, where emerald canopies and musk incense fill the air, and bliss reigns in a land without sorrow—common men, base in conduct, know of these yet do not cultivate them, ensnared by the six senses and lost in the passions, never to return.\"\n\nAfter the Immortal Lord finished his lament, Kai stepped forward, bowed deeply, and said: \"I have heard that in the Jasper Pool and Crimson Towers, the Penglai and Fangzhang Isles, the Purple Palace and Jade Palace, and the immortal grottoes of Kunlun and Square Zhang, there are lands of eternal youth where the sun and moon never set, where jeweled canopies and layered terraces shine with everlasting spring, where golden flasks hold the wine of immortality and crystal vials store the elixir of longevity. The peach trees bloom fragrantly, shedding their blossoms but once in a thousand years; the cloud herbs form precious clusters, ripening only after ten thousand years. I have also heard that snow-white cranes dance upon the steps, immortal maidens sing and play, simurghs soar with kingfisher plumes, and celestial maidens blow upon flutes. The Jasper Pool wells with sweet dew, and jade trees bear heavenly fragrant grains. In the delicate pavilions and radiant halls, light shimmers brilliantly; in the carefree chambers and mist-woven towers, rosy clouds embroider the sky. In these places of feasting and revelry, heavenly music resounds—phoenix flutes and dragon pipes, immortal melodies and celestial rhythms. The golden crow and jade hare wander upon crystal plates; jasper steeds and azure oxen leap forth from the gardens of sacred mushrooms. Is this the unchanging land of the Land of Eternal Joy? I humbly beseech you, Immortal Lord, to guide me: by what method may I cultivate to attain this fruit?\"\n\nThe Immortal Lord said: \"The Jade Spring flows from the Kunlun Mountains. To the east, upon the Eastern Sea, stand the Three Mountain Cities, where seventeen thousand celestial immortals drink from the Elixir Pool, having ascended by consuming the Jade Spring. Yet the Weak Waters block the way—only flying immortals may reach it; mortals cannot.\"\n\nKai asked: \"In which land does the Jade Spring arise? From which mountain does the Elixir Pool emerge? By what method may one gather and consume them?\"\n\nThe Immortal Lord replied: \"The Jade Spring flows from the Kunlun Mountains, and the Elixir Pool lies in the Land of the Sun and Moon. The mountain there is no taller than a foot, no wider than a liter, and within dwell the Three Divine Sons of the Emperor and the Nine Elder Immortal Sages. Heavenly incense crowns its peak, where lush grasses grow; celestial music resounds of itself. Within blooms the Seven-Treasured Red Lotus, drawing the waters of the Elixir Pool—the Fountain of Deathlessness, which stirs the sounds of the Dharma. Its tones are harmonious and refined, bright day and night, its light illuminating the Three Heavens. All phenomena, vast and myriad, are fully revealed. Cloud chariots and wind dragons, dancing phoenixes and flying simurghs—all karmic deeds, good and evil, are complete in every thing. If one can fathom this realm and awaken to this gate, one may gather a thousand or ten thousand each day. By paying homage to the true immortals ten thousand times, when merit is fulfilled and conduct perfected, one may fly to the Purple Palace.\"\n\nKai asked: \"How far is this place? Can one reach it?\"\n\nThe Immortal Lord said: \"It is not far—it lies between the square inch of your two brows, at the gate of the spirit’s light, between the Jade Gate and Golden Pillar, though they do not connect. Only by obtaining the secret and wondrous numinous scripture may one arrive.\"\n\nKai bowed deeply again, his heart leaping with longing, and begged to hear the essential teaching.\n\nThe Immortal Lord said: \"Eight thousand *li* to the southeast lies the ancient site of Mao Peak, where the two immortals Yang and Xu once dwelled. In the mountains resides an extraordinary man surnamed Tao, styled Hermit, known in the Liang dynasty as Master Tao Hongjing of Zhenbai.\"\n\nHe had over seventeen hundred disciples, with three hundred admitted to his inner chamber, yet only seven attained his Dao. \"Count them—Xie, Qian, and Ru—you are also among this gentleman’s disciples. I shall now transmit to you the most wondrous teaching. You must let your hair loose, bare your feet, take up the hoe as a farmer, and seek to become a gardener for twelve full years. Cultivate hidden merits, never reveal the Dao, guard the secret formulas, and appear no different from the common folk, so none suspect. In time, I shall recommend you, and the Celestial Emperor will surely summon you to ascend the cloudy heavens.\"\n\nAt this, Kai bowed again, vowed his oath, and mounted the altar. With hair unbound and feet bared, he received the Dao.\n\nThe Immortal Lord said: \"Tao Hongjing was surpassingly intelligent, refining his literary skills and exhausting his spirit in the study of texts. He probed the essential meaning of the scriptures, delighted in recording strange matters, and passionately loved mountains and rivers. He planted pines and bamboos, his heart set on lofty heights, yearning to ascend the cloudy heavens. Though the Celestial Emperor took note, his true merit was slight, and his hidden efforts, though laborious, fell short of the seven disciples who truly learned the Dao.\n\n\"Moreover, Tao sought the truth in many ways, dividing his spirit between two paths. He took pleasure in Chan meditation and Buddhist teachings, speaking of bodhi conduct, compiling records of the Western Heaven, and composing texts on rebirth. Practicing both Daoist and Buddhist ways, he has yet to gain the Celestial Emperor’s favor.\n\n\"He has three virtues and four faults, for which Heaven holds him accountable. First, he devoted himself to the Great Dao and presided over the Mysterious Gate. Yet when the Liang dynasty faced collapse, he turned to Buddhism, praying for the emperor’s longevity, displaying a filial heart. Second, he broadly aided the orphaned and poor, performed many filial deeds, and carried forward the true teachings of the Three Mao and Yang and Xu, not betraying the legacy of the Most High. Third, he toiled tirelessly, forgetting food, maintaining purity in his cultivation, refining medicines, and exhaustively studying the classics, never forgetting the grace of the Supreme Perfected.\n\n\"For these three virtues, he may yet be appointed to an office. But his four faults are too grave. First, he compiled medical formulas requiring the killing of birds, fish, insects, and beasts to cure suffering. Though his intent was to save lives, he incurred the sin of slaughter. Second, he was fond of astrological calculations, probing heavenly secrets, secretly controlling spirits, and divining fortunes. Third, he planted flowers and trees, dug pits in the mountains, loved divining obscure omens, felled trees to build houses, flaunted his reputation, and drew close to the court. Fourth, his aspirations were too lofty, fixated on ascending as an immortal. He built pavilions awaiting transcendence and halls for descending perfected beings. Though his disciples were many, he has yet to earn the right to ascend the heavens.\n\n\"Now that you have received my secret teachings, you must serve Master Tao faithfully, and you shall surely ascend to the Great Ultimate. His followers are all cultivators of the truth, yet if their worldly merits fall short, they may not compare to those who establish merit in the realm of Daoist practice, where blessings come swiftly.\"\n\nThat evening, the Immortal Lord transmitted secret instructions to Huan Kai, concluding the ritual of oath and alliance. Then he said: \"The scriptures and secret formulas, the charts and books, are boundless and vast, but the essential teachings that return to the root amount to only one or two matters. I once spoke of the realm of Jade Capital, the mountains of the sun and moon, and the domain of Kunlun—do you yet understand their meaning?\"\n\nKai replied: \"I do not understand.\"\n\nThe Immortal Lord said: \"Within the human body dwell thirty-six thousand spirits of radiant essence and twelve thousand spirits of the hun and po. In the Mud Pill Palace resides the Great Lord of Undying Life. The Two Modes and Four Images, the Eight Trigrams and Nine Palaces, Kunlun and Fanghu, and all the heavenly palaces are perfectly complete, neither more nor less, merging with Heaven and Earth. Even wind and clouds, thunder and rain, frost and fog, snow and hail, mist and rosy clouds, grasses and trees, mountains and rivers, numinous steles, longevity stems, fish and dragons, humans and beasts, transformations and rebirths, heavenly realms and dark underworlds—all are fully contained within.\n\n\"Yet the common folk, stirred by the six emotions and entangled by the three poisons, suffer deep harm to their bones, lacking knowledge and awareness. Their spirits are dull, their consciousness dim, their hun and po lost in confusion. Seduced by sounds, forms, and desires, bound by deep love and attachment, they cannot break free, becoming other kinds of beings. Unable to transcend, their confusion deepens, suffering the four hundred and four illnesses, the eight evils and four births, the three disasters and nine calamities, the punishments of kings and the judgments of Heaven. Thus, the Most High expounded the Three Caverns and opened the Four Auxiliaries, guiding all living beings to return together to the sacred realm—how could this not be arduous?\n\n\"Now you have received the Most High’s true and mysterious secret teachings. Do not reveal them to the common folk, nor let frivolous thoughts arise, lest you incur sin and punishment.\"\n\nKai knelt in awe, bowed deeply, and received the Immortal Lord’s secret instructions.\n\nThe Immortal Lord said: \"The sun and moon are the wondrous extremes within Heaven and Earth, the radiant essence within Qian and Kun, the solitary brilliance within yin and yang. In the heavens, they are the eyes; in the sea, they are the luminous essence; in all things, they are the vital essence; in the human body, they are the hun and po.\n\n\"Now, the secret treasures within your body: the head is called Kunlun, the crown is called the Mud Pill, and the center is called the Brain Gate. The Brain Gate is where the spirit roams, where the Celestial Emperor resides. Below the sun and moon and Kunlun, radiant light flows into the Golden Pool, connecting with the liver and lungs. The lungs are the cauldron within metal, externally corresponding to the nose. The liver is the flower within wood, externally corresponding to the eyes. The eyes follow the five colors in desire, the nose follows the five fragrances in congestion. Metal and wood are separated, the radiant light at the gate scatters, the spirit pearl is lost, and thus one reaches the realm of death.\n\n\"Now I transmit to you the Way of Undying and the Celestial Emperor’s method for ascending the clouds—this is no trivial matter. Long ago, on the Azure Flower Mountain of the Eastern Marchmount, the Purple Mystery Immortal Earl taught me this method, and seven hundred years have passed since then. You must first cultivate the union of water and fire, the Kan and Li gates, to attain longevity. If the heart does not connect with the numinous, if the spirit does not transform, ascending the cloudy heavens will be difficult. Long ago, the Perfected Lord Xu received this supreme teaching from the Elder of the Western Mountain and ascended to the Azure Vault that very day—how joyous was that!\n\n\"When the bones of the crown are closed and sealed, leaking evil qi, ghostly winds blow and gather. The spirit of Kunlun attaches to the heart, scorching it night and day. The liver and kidneys discharge essence and expend yang, damaging the Golden Cauldron. The spirit cannot restrain them, true immortals do not dwell there, and the Celestial Emperor does not descend. Thus, one willingly accepts the realm of death.\"\n\nNow you return the radiance of the sun and moon, illuminating the Kunlun of the Great Ultimate. The left eye and right eye are the sun and moon within heaven, shining as one through the twelve hours.\n\nThe Immortal Lord then sang:\n*\"The Golden Cauldron’s Celestial Gate opens,\nReverting to youth, restoring the infant’s grace.\nSun and moon illuminate Kunlun,\nThe Perfected Lord arrives naturally.\nThree years knit the yellow clouds,\nA thousand days form the sacred embryo.\nNine years ascend the Golden Portal,\nTwelve years rise to the Three Terraces.\nDragon and tiger naturally unite,\nThe Celestial Emperor secures the Golden Terrace.\nAll spirits gaze heavenward in reverence,\nListening in awe, their hearts adrift.\nNow you receive the numinous scripture,\nFocus your mind like dead ashes.\nAccumulate merit for twelve years,\nAnd when complete, ascend the cloud ladder.\nWhite light arises in perfect form,\nPurple qi surges through the clouds.\nAlign with emptiness, contemplate the Great One,\nThrough vast kalpas, heaven and earth stand as one.\"*\n\nAt this, Huan Kai felt as though his heart and eyes had been lost. He sighed deeply and said: *\"For countless kalpas, I wandered in life and death, unaware of the numinous root. I merely pointed to the heart’s sovereign, believing it to be the true Dao. How I regret not recognizing the beyond of the great void—the realm of ‘what is and is not’—or the inquiry of Kunlun, where the scene of longevity abides. Beneath the sun and moon, countless souls die in vain. Now I understand: the primordial essence is neither born nor destroyed; it is the root of water and fire. The heart and kidneys are its foundation, the gate of the Dao’s mystery—truly atop Kunlun.\"*\n\nKai bowed deeply and asked again: *\"How does the radiance of the sun and moon illuminate the Celestial Gate and open the crown of Kunlun?\"*\n\nThe Immortal Lord replied: *\"Focus the heart on the eyes and visualize the cinnabar field for a moment, then reverse the light upward to reflect directly upon the Celestial Gate—the Celestial Gate is the gate of the brain. At any time, whether early or late, engage in affairs while containing the light in silence, never departing from the crown. This is called the ‘Method of Silent Audience with the Celestial Emperor.’ Guard this well, guard this well.\n\nOrdinary people’s hearts and eyes wander outward, never turning their minds inward to themselves.\"*\n\nHe sang again:\n*\"Inward illumination returns the numinous light,\nThe Great One embraces true fragrance.\nAroma scatters like blossoming countenance,\nLush and flourishing, purple chambers arise.\nThe Celestial Gate opens to the azure heavens,\nSilently paying homage to the Jade Emperor.\"*\n\nThe Immortal Lord spoke again: \"When a person enters the womb, the eyes form first, like water bubbles, while the other four limbs and appearance are yet absent. Next, the two kidneys emerge, corresponding internally to the essence-conduits. The birth of Heaven and Earth follows the same pattern. Before Heaven and Earth divided, before the sun and moon shone, there lay the root of primordial chaos, the inception of the Great Yang. The Confucians and Buddhists do not speak of this principle; they merely say the heart is the lord of all things, prior even to the Supreme Emperor—yet this offers no place to begin. They can only perform diligent rituals, burn incense, eat bland food, and abstain from meat. Some swallow talismans, ingest medicines, worship the moon and gaze at the stars, exhale the old and inhale the new—all measures taken out of necessity. As for corpse-liberation, escaping form, spirit-exit, embryonic breathing, cutting off love and forgetting emotion, attaining carefree ease, sitting in liberation or standing in transformation, borrowing wombs or entering them, seizing destiny or evading fate, concealing the body or hiding the form, swallowing the essence of the sun and moon, riding the stars or controlling fire, refining essence and swallowing saliva, consuming lingzhi and herbs, practicing the Buddhist cicada-shedding of empty radiance, relinquishing form to cultivate the body, giving alms and enduring humiliation—these myriad beneficial practices, each pursued according to one’s capacity, have yet to grasp the profound principle. There are hundreds of thousands of methods. Only in the supreme vehicle of cultivation, the great Dao, must one illuminate the spirit-light within, making the inner realm luminously clear. Nowadays, paintings often depict a white light emanating from the crown, revealing a dignified countenance seated majestically upon a lotus—this imagery approaches the truth. Yet the ancients concealed their subtlety within it, for there exists wondrous true emptiness, free from thought and desire. The dharmakāya is fundamentally beyond birth and death, but lacking the power of great samādhi, one becomes subject to transmigration, mistakenly entering other wombs, dying in vain and living futilely, bound for kalpas without end. Even when encountering a perfected being, they are unwilling to immediately transmit the supreme, wondrous meaning or the great wisdom of perfect interpenetration. Instead, they may be born into blissful families, reaping the rewards of merit, becoming kings, great ministers, or men of profound intelligence. Though their minds are sagely and wise, illuminating the scriptures, they may unwittingly turn wisdom into poison. Through wisdom, thoughts arise; through thoughts, sentient beings flow and turn, entangled by love and emotion, generating perverse views and slander, falling into demonic realms, ensnared by demonic attachments. Thus, for hundreds of thousands of kalpas, they fail to awaken to the true principle. Therefore, the Most High, moved by compassion, saves and delivers living beings, expounding scriptures and treatises to reveal the true meaning, liberating all sentient beings and guiding them to the gate of purity.\n\n\"Only by inwardly generating silent illumination, cultivating both samādhi and wisdom in tandem, and perfecting the true body with radiant clarity can one escape birth and death.\"\n\nThe Immortal Lord continued: \"Now you shall go to the ancient site of Huayang Cave Heaven on Mount Sanmao, where you will serve the Tao family, guarding the true and silently preserving the flawless mystery. Accumulate merit and practice the ‘Method of Silent Audience with the Celestial Emperor.’ After twelve years of cultivation, you must ascend to the heavens.\"\n\nKai asked: \"The path is distant, waters divide us, and without boats or oars across rivers and lakes, how can I reach it?\"\n\nThe Immortal Lord replied: \"I possess the talisman of the Earth’s Veins and the Spirit Spring. Tonight, bathe and purify your body, stand in the Hall of Flourishing Primordiality, and enter silent contemplation—then you may arrive.\"\n\nFrom here to Huayang, the distance spans eight thousand *li*. There lies the Water Palace of the Great River, the Yangzi River, the Valley of Numinous Streams, the Caves of Purple Gold and White Jade, with a retinue of three thousand six hundred, commanding an army of ten thousand divine soldiers, five divine dragons, the Duke of Thunder and Earl of Wind, five hundred thunder spirit messengers, and the Lower Prime Water Palace’s Commander-in-Chief, Wu Yue of Ou Min’s Immortal Source. It stores ninety million *hu* of water, with thirty-six *qing* of tides, eighty thousand fierce warriors, nine hundred thunder drums, and a lifespan of one hundred thousand years—equal in rank to the Penglai Water Palace’s Commander. The Lower Prime, Middle, and Upper Water Palaces all govern the tides, the world’s floods and droughts, and human affairs.\n\nKai asked: \"What are the duties of the Three Lords of Sanmao at Huayang?\"\n\nThe Immortal Lord replied: \"They oversee the registers of immortals, administer the blessings and misfortunes of Wu Yue, and manage the imperial domains and the affairs of the Nine Provinces. The Three Immortal Lords command reporting spirit-warriors and ten thousand immortals, together governing the Nine Provinces and overseeing the merits, transgressions, and cultivation of those who seek immortality.\"\n\nHe added: \"The Eighth Cave Heaven of Huayang connects with the Ten Great Cave Heavens, the Thirty-Six Lesser Cave Heavens, the Four Seas, the Yangzi and its tributaries, Penglai, the Ten Isles, the peaks of Kunlun, and even the Dark Capital and the Nether Peaks—all are accessible. Yet ordinary people, stained by defilement, desire, and delusion, remain obstructed. If perverse views do not arise, the paths of sages and mortals become open, and one may wander freely within the six directions of Heaven and Earth, both inner and outer.\"\n\nThereupon, the Immortal Lord employed the art of the Spirit Mirror and the Vein-Spring, a method Kai could not comprehend. Kai closed his eyes and, without moving, arrived; without haste, he departed. In an instant, as if hearing voices questioning him, he had already crossed the rivers and lakes. At times, he caught the scent of palaces and rare fragrances; at others, he heard singing or celestial music. Suddenly, he heard the Immortal Lord say: \"Open your eyes.\" As if in a dream, he stepped ashore. Green mountains rose solitary, the azure sea lapped at the shore, and boats came and went—none of it familiar. Asking a passerby, he was told: \"This is Danyang.\" He then inquired about the distance to Mao Peak. The traveler replied: \"Two hundred *li* remain.\" Kai asked if there were any temples. The traveler said: \"There is a grand shrine built by Master Tao the Recluse of Great Liang, who gathers worthies and welcomes scholars.\"\n\nKai hurried along the path. That night, Tao dreamed of his chamber filled with divine light and clouds of radiant hues ascending to the heavens. A golden-armored spirit pointed at Tao and said: \"Tomorrow, an extraordinary person will arrive.\"\n\nTao asked: \"Morning or evening?\"\n\nThe spirit replied: \"At noon.\"\n\nThe Master awoke and said to his disciples: \"You shall sweep the gate with me. At noon, an esteemed guest will arrive—take care not to bar his way, and hasten to inform me.\" As the sun reached its zenith, Kai washed his feet and chanted:\n\n*\"A guest indeed has come—\nUnbound hair, golden blossoms, purple clouds arise;\nThe sun and moon wheel through the heavens,\nVast and boundless, the Great Void,\nNot as the grasses of the multitude.\nThe twelve peaks of Kunlun,\nWhere the Emperor makes his ten thousand circuits.\nWhen a single day’s merit is complete,\nOne ascends to the heavens to pay homage to the Primordial Sovereign.\"*\n\nThe disciples, not understanding his words, hurried to report to Master Tao. Delighted, Tao invited Kai in, only to see him with unbound hair, bare feet, and an appearance most wild and strange.\n\nTao asked: \"What brings you here?\"\n\nKai replied: \"I have heard of your lofty Dao and come to cultivate vegetables with you.\"\n\nTao said: \"Your song just now was most unusual—what did it mean?\"\n\nKai answered: \"I heard others speak, learned their song—how could I understand it?\"\n\nTao let the matter rest. He asked again: \"What is your surname?\"\n\nKai said: \"My surname is Huan, given name Kai, a man of Shu.\"\n\nTao asked: \"How many days have you been away from home?\"\n\nKai replied: \"I left last night.\"\n\nTao laughed: \"A madman, a madman indeed!\"\n\nThen he said to Kai: \"Those who tend gardens—are they not all of lowly station?\"\n\nKai said: \"I wish only to hear the Dao.\"\n\nTao said: \"I have three ranks of disciples.\"\n\nKai asked: \"What of the highest rank?\"\n\nTao replied: \"They wear silks and brocades, consume lingzhi and pine, compile texts and annotate scriptures, manage records, concoct elixirs, attend the immortals and accompany the noble. They enter my chambers.\"\n\nKai asked: \"And the middle rank?\"\n\nTao said: \"They manage correspondence, compose questions and answers, prepare decoctions, wear silk and hemp, eat millet and pine-needle wine, dwell to the left and right of my courtyard. I teach them arts and techniques, and they accompany those of the Dao.\"\n\nKai asked: \"And the lowest rank?\"\n\nTao said: \"They wear silk and hemp, eat the five grains, dispense medicines, dwell in my lodgings, sweep rooms and burn incense, pay homage to the stars and moon. I teach them to refine qi, and they may associate with learned men, receive guests, and cultivate vegetables and herbs.\"\n\nTao continued: \"Each rank numbers in the hundreds.\"\n\nKai said: \"I do not belong among these three ranks. May I tend the garden, draw water, chop firewood, burn incense, clean privies, and dredge wells?\"\n\nTao said: \"I only fear you will not consent to such tasks.\"\n\nKai bowed twice and vowed to be the one who burns incense and draws water. Tao kept him.\n\nDuring his stay with Tao, Kai paid no heed to cold or heat, rank or humility, hunger or satiety, toil or hardship. The disciples mocked him, but he remained unmoved; he was never lazy in his duties. He rose before others awoke and retired only after they slept. He did not burn incense, bow in worship, recite scriptures, or abstain from meat. Without hatred or resentment, neither vain nor ostentatious, he spoke little, showed neither joy nor anger. In leisure, he swept the ground; in busyness, he chopped firewood. In motion, he tended the fire; in stillness, he washed clothes. Thus he remained in Tao’s household for twelve years, yet Tao did not recognize his worth. Though ever before his eyes, Tao paid him no mind, nor did Kai disturb him.\n\nTao’s residence had a three-story tower, the highest floor brushing the tips of the pines. There he listened to the wind in the pines, while his disciples dwelled on the lower floors. He annotated over a thousand volumes of texts. When Emperor Wu of Liang sought divination, he often dispatched envoys to inquire, and the Master would sometimes draw an ox in reply. When asked about the fate of the dynasty, he interpreted the signs and knew the Liang’s reign would not last long. By the years *gengzi* and *xinchou*, he marked the time in red. Emperor Wu did not understand.\n\nThe court officials called Tao the \"Prime Minister of the Mountains.\" His Dao was lofty, his virtue transcendent, and from all four seas, over a thousand disciples came to follow him, with three hundred entering his inner chambers. He built the Vermilion Sun Lodge, constructed the Awaiting Immortals Tower and the Gazing at Edicts Pavilion, and meticulously maintained the incense and offerings. Often, he would shield his face with a fan, fearing that dark qi might shroud his divine radiance. He once said: \"If the Emperor were to summon me, I would turn this mountain into a palace of jade and towers of crystal.\"\n\nAt eighty-four, the Master’s strength remained abundant, his energy unflagging. He never ceased annotating scriptures, and he loved planting bamboo and cultivating herbs. He refined elixirs atop the peaks of Mount Taoshan in Yongjia’s Great Weakness Grotto and Wooden Drip Isle.\n\nFrom birth, the Master was extraordinary—his countenance radiant, his beard long, his features handsome. He stood seven feet tall, with fine eyes and slender brows, his qi pure and his bearing serene. Well-versed in ancient and modern learning, he was accomplished in the arts, astronomy, calendrics, divination, medicine, and pharmacology. Every discipline he mastered with profound clarity.\n\nOn the fifteenth day of the eighth month in the first year of *Tianjian* of the Great Liang, atop Great Maoshan, several streaks of white light suddenly appeared. In an instant, clouds gathered thickly, the forests and springs grew clear, and celestial music rang out. The crowd saw red and multicolored clouds, a single crane, and a youth in blue holding an edict in the sky. Within the five-colored radiance appeared rainbow banners and feathered regalia, with over a hundred immortal youths and spirit officials attending an empty chariot, its form like a dragon’s carriage.\n\nThe youth and the crane descended to the courtyard. Tao believed the Emperor of Heaven was summoning him, but the immortal youth said: \"Do not trouble yourself. Quickly have Huan Kai change his robes, drink the elixir, and receive the edict.\"\n\nThe youth continued: \"The Emperor and the Early Perfected await in the Luminous Golden Gate Palace’s Liao Yang Hall—Huan Kai is to arrive.\"\n\nThereupon, Kai bathed, donned the elixir, and received the edict:\n\n*\"For your silent merit, ceaseless hidden virtue,\nAnd the wondrous teachings of your enlightened master,\nSwiftly you shall attain the immortal’s home,\nEmbody the wondrous void, roam the Golden Gate.\nDebts of enmity from many lives melt like spring ice,\nPast transgressions vanish like wind snuffing a candle.\nBy golden elixir and crane’s edict,\nWe dispatch you to Maoshan’s peak.\nThe immortals of the Purple Palace,\nFor kalpas have awaited your arrival at the immortal’s abode.\nYour toil and hardship, never shirked,\nYour will steadfast as the pine—\nNow ascend to the immortal’s rank!\"*\n\nUpon the edict’s arrival, he ascended to the cloudy heavens.\n\n*Right: Dispatched to Mao Peak, the Controller of Destiny and his attendants shall ensure its execution.*\n\nThe proclamation complete, he mounted a crane and rose upon the clouds, phoenix bells chiming as the staff stirred, drifting away on the wind.\n\nWhen he first changed his robes, Tao admonished Kai: \"When we search the celestial archives for your immortal register, how much longer must your merit accumulate? What deeds remain unfinished? How many transgressions yet require redress?\" Kai received his master’s instruction and took leave. Tao bore a lingering reluctance, as if intoxicated through the night.\n\nAs Huan Kai ascended to heaven, he left behind this hymn:\n\n*\"Preserve the spirit, nurture the qi’s essence,\nIn clarity and stillness, the heart’s light shines.\nVain thoughts do not arise in emptiness,\nSeeking truth, the Dao naturally forms.\nSun and moon illumine Kunlun,\nDay and night pierce the mud-pill palace.\nThe numinous perfected descend of themselves—\nWhen merit is complete, ascend the Heavenly Gate.\"*\n\n*The Record of Perfected Huan’s Ascension as an Immortal concludes.*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "桓真人升仙记 经名：袒真人升仙记。 一卷。 底本出处：《正统道藏》 洞真部记传类。 西蜀华盖山李桓仙君授道桓凯真人，仙君以名授弟子为姓，故曰桓，元非其姓也。 仙君一日谓弟子桓凯曰：金丹大药，子得之矣，飞步隐身诸诀，汝皆晓了，但汝未闻大道耳。 凯日：弟子从先生三十年矣，素知先生妙处有三景真符、五神总要、八极罗图、默朝上帝，诸弟子未敢请问，伏望仙君指示弟子至道，修证无为，早达玄理。 仙君日：三景真符乃吞带延年之术，五神总要、八极罗图乃天中之灵典，默朝上帝乃升举之妙门，登云之真旨，非子所可而闻於是。 凯洗心坚志，香火愈专，勤苦五年，不敢请问。 一日仙君喟然叹日天地交泰，日月祥应，妙理备焉。 山川秀发，明珠生焉，金玉露焉。 草木郁茂，芳草争妍，芝英出焉。 鸾凤群集，瑞云亘天，贤圣理焉。 星文顺序，日有重输，景星出现，瑞应国祚，天地草木，山用禽兽，禀受冲粹淳和之气，发祥现瑞。 人生天地之问，但待死而后已。 五口太上玄真之化、元始清静之问，真仙留不死之术在乎人问。 百千万年或有学之者，劳神役虑，爱惜苦恼，妄想绿业，甘心而受。 不知烟霞之外，有超真不夜之乡； 瞑海之中，有返魂不死之药。 又岂知乘六龙而升八极，驾九凤而游昆仑。 玉树千年如春，金桃万刻一结。 广寒宫玲，朱夏无摇扇之宾； 紫府庭温，穷冬少烧薪之士。 至於琼台兰阁，宝宇层楼，凤阙银桥，彩城烂苑，珠光相射，快乐无何之乡，翠盖幢磨，悦泽无忧之国，凡夫行劣，知而不修，声色六情迷而不返。 先君#1如是叹毕，时凯进前稽首再拜，告仙君日：切闻瑶池绛阙、阅苑蓬丘、紫府琼官，昆仑方丈、草仙洞府自有长年之光景，日月不夜之山川，宝盖层台，骗四时明媚，金壶盛不死之酒，琉璃藏延寿之丹，桃树花芳，千年一谢； 云英珍结，万载圆成。 又闻雪鹤舞阶，灵仙歌舞，鸾翔翠羽，彩女吹萧，瑶池涌甘露之泉，玉树缀天香之粟，玲珑台榭，辉光晃曜，潇洒轩堂，烟霞缬绣，游宴之处，鼓乐天音，凤笛龙箫，飞仙吹拍，金乌玉兔，水晶盘上游行，瑶马青牛，灵芝圃中跃出。 长乐国土无变之乡，得如是乎？ 伏愿仙君指引，修何法门，而登此果？ 仙君日：玉#2泉出昆仑之山，束俱海上有三山之城，城中一万七千天仙皆饮丹池，由服玉泉而得升此。 但弱水阻隔，飞仙可至，凡人无能到者。 凯日：玉泉生於何国，丹池出於· 甚山，以何术得而采服？ 仙君曰：玉泉出於昆仑之山，丹池出於日月之国。 其山高不满尺，大不盈升，内有三帝子神共居，九老草仙咸处。 天香□顶，上生郁草，天乐自呜，中有七宝赤莲，引□池之水，不死之泉，能动法音。 其音和雅，昼夜皎洁，光映三天，万象森罗，悉皆照彻。 云驭风龙、舞凤飞鸾，善恶众绿，物物具足。 若能究此之域，悟此之门，可日采千万。 朝真万褊，功满行备，飞行紫府。 凯曰：此去远近，可能至焉？ 仙君曰：此去不远，在方寸两眉之问，神光之户，玉门金柱相问而不通。 得秘妙灵文，方可至矣。 凯稽首再拜，跃然听慕，愿闻其旨。 仙君曰：此去束南八千里有茅峰古迹，杨许二仙，山中有异人姓陶号隐居，梁朝贞白先生陶弘景也。",
      "translated_text": "**The Record of Perfected Huan’s Ascension to Immortality**\n\n*Scripture Title:* *The Record of Perfected Huan’s Ascension to Immortality*. One scroll. Base text from *Daoist Canon of the Zhengtong Era*, *Dongzhen* section, *Records and Biographies* category.\n\nThe Perfected Immortal Lord Li Huan of Huagai Mountain in Western Shu transmitted the Dao to Perfected Huan Kai. The Immortal Lord bestowed his name upon his disciple as a surname, hence he was called Huan, though this was not his original family name.\n\nOne day, the Immortal Lord said to his disciple Huan Kai: \"You have already obtained the great elixir of golden cinnabar, and you comprehend all the secrets of flying steps and concealment. Yet you have not yet heard of the Great Dao.\"\n\nKai replied: \"Your disciple has followed you for thirty years, Master. I have long known that you possess three wondrous treasures: the *True Talismans of the Three Luminaries*, the *Essentials of the Five Spirits*, the *Net of the Eight Poles*, and the *Silent Audience with the Supreme Emperor*. None of your disciples have dared to inquire about these. I humbly beseech you, Immortal Lord, to instruct me in the supreme Dao, that I may cultivate and realize non-action and swiftly attain the profound principle.\"\n\nThe Immortal Lord said: \"The *True Talismans of the Three Luminaries* are techniques for ingesting and wearing to prolong life. The *Essentials of the Five Spirits* and the *Net of the Eight Poles* are sacred texts of the heavens. The *Silent Audience with the Supreme Emperor* is the wondrous gate of ascension and the true essence of cloud-riding—these are not yet for you to hear.\"\n\nKai purified his heart and strengthened his resolve, his incense and devotion growing ever more focused. For five years, he toiled diligently without daring to ask again.\n\nOne day, the Immortal Lord sighed deeply and said: \"When heaven and earth harmonize, the sun and moon bring auspicious responses, and the wondrous principle is complete. When mountains and rivers flourish, bright pearls are born, and gold and jade glisten. When grasses and trees thrive in lush abundance, fragrant herbs vie in beauty, and sacred mushrooms emerge. When phoenixes and simurghs gather in flocks, and auspicious clouds stretch across the sky, sages and worthies reside therein. When the stars align in order, the sun has its double wheels, and propitious stars appear, blessings respond to the nation’s destiny. Heaven and earth, grasses and trees, mountains and rivers, birds and beasts—all receive the pure, harmonious qi of the primordial void and manifest auspicious signs. Yet humans, born between heaven and earth, merely await death and nothing more.\n\nThe transformations of the Supreme Mysterious Perfected and the primordial purity of the Celestial Venerable—true immortals leave behind the arts of deathlessness in the world. Yet among the millions over countless years, some study these arts, exhausting their spirits and toiling their minds, clinging to suffering and vexation, deludedly pursuing karmic deeds, willingly enduring hardship. They do not know that beyond the mist and clouds lies a realm of transcendence, a land of undying light; that within the dark sea grows the medicine of returning souls, the elixir of immortality. How could they know of riding the six dragons to ascend the eight poles, or driving the nine phoenixes to roam Kunlun? The jade trees remain ever-spring for a thousand years; the golden peaches bear fruit but once in ten thousand moments. In the Palace of Vast Cold, the heat of summer brings no guests fanning themselves; in the courtyards of the Purple Palace, the depths of winter see few who burn firewood. As for jade towers and orchid pavilions, jeweled halls and layered towers, phoenix gates and silver bridges, resplendent cities and radiant gardens—where pearl light dazzles and joy knows no bounds, where emerald canopies and musk incense fill the air, and bliss reigns in a land without sorrow—common men, base in conduct, know of these yet do not cultivate them, ensnared by the six senses and lost in the passions, never to return.\"\n\nAfter the Immortal Lord finished his lament, Kai stepped forward, bowed deeply, and said: \"I have heard that in the Jasper Pool and Crimson Towers, the Penglai and Fangzhang Isles, the Purple Palace and Jade Palace, and the immortal grottoes of Kunlun and Square Zhang, there are lands of eternal youth where the sun and moon never set, where jeweled canopies and layered terraces shine with everlasting spring, where golden flasks hold the wine of immortality and crystal vials store the elixir of longevity. The peach trees bloom fragrantly, shedding their blossoms but once in a thousand years; the cloud herbs form precious clusters, ripening only after ten thousand years. I have also heard that snow-white cranes dance upon the steps, immortal maidens sing and play, simurghs soar with kingfisher plumes, and celestial maidens blow upon flutes. The Jasper Pool wells with sweet dew, and jade trees bear heavenly fragrant grains. In the delicate pavilions and radiant halls, light shimmers brilliantly; in the carefree chambers and mist-woven towers, rosy clouds embroider the sky. In these places of feasting and revelry, heavenly music resounds—phoenix flutes and dragon pipes, immortal melodies and celestial rhythms. The golden crow and jade hare wander upon crystal plates; jasper steeds and azure oxen leap forth from the gardens of sacred mushrooms. Is this the unchanging land of the Land of Eternal Joy? I humbly beseech you, Immortal Lord, to guide me: by what method may I cultivate to attain this fruit?\"\n\nThe Immortal Lord said: \"The Jade Spring flows from the Kunlun Mountains. To the east, upon the Eastern Sea, stand the Three Mountain Cities, where seventeen thousand celestial immortals drink from the Elixir Pool, having ascended by consuming the Jade Spring. Yet the Weak Waters block the way—only flying immortals may reach it; mortals cannot.\"\n\nKai asked: \"In which land does the Jade Spring arise? From which mountain does the Elixir Pool emerge? By what method may one gather and consume them?\"\n\nThe Immortal Lord replied: \"The Jade Spring flows from the Kunlun Mountains, and the Elixir Pool lies in the Land of the Sun and Moon. The mountain there is no taller than a foot, no wider than a liter, and within dwell the Three Divine Sons of the Emperor and the Nine Elder Immortal Sages. Heavenly incense crowns its peak, where lush grasses grow; celestial music resounds of itself. Within blooms the Seven-Treasured Red Lotus, drawing the waters of the Elixir Pool—the Fountain of Deathlessness, which stirs the sounds of the Dharma. Its tones are harmonious and refined, bright day and night, its light illuminating the Three Heavens. All phenomena, vast and myriad, are fully revealed. Cloud chariots and wind dragons, dancing phoenixes and flying simurghs—all karmic deeds, good and evil, are complete in every thing. If one can fathom this realm and awaken to this gate, one may gather a thousand or ten thousand each day. By paying homage to the true immortals ten thousand times, when merit is fulfilled and conduct perfected, one may fly to the Purple Palace.\"\n\nKai asked: \"How far is this place? Can one reach it?\"\n\nThe Immortal Lord said: \"It is not far—it lies between the square inch of your two brows, at the gate of the spirit’s light, between the Jade Gate and Golden Pillar, though they do not connect. Only by obtaining the secret and wondrous numinous scripture may one arrive.\"\n\nKai bowed deeply again, his heart leaping with longing, and begged to hear the essential teaching.\n\nThe Immortal Lord said: \"Eight thousand *li* to the southeast lies the ancient site of Mao Peak, where the two immortals Yang and Xu once dwelled. In the mountains resides an extraordinary man surnamed Tao, styled Hermit, known in the Liang dynasty as Master Tao Hongjing of Zhenbai.\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1223,
      "start_sentence": 0,
      "end_sentence": 43,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.232950925827026,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\桓真人升仙记.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "有门弟子一千七百余人，入室者三百人，得吾道者七人。 谢钱汝其数也，子亦此君之弟子。 吾当受汝至妙，汝当披发胱足，执锄为耕夫，求为圃者满一十二年，修积阴功，勿示其道，保藏秘诀，每如常流，无使知觉。 异日吾当保举，上帝必诏子升云天。 是时凯再拜立誓登坛，散发跌足受道。 仙君曰：陶隐居聪明过人，雕琢文词，劳神典籍，穷究经旨，好述异事，酷爱山水，栽种松筠，心念太高，望登云天。 上帝虽念，皇少真功，徒劳阴力，皆不及七弟子之学道耳。 又日：陶求真不一，潜神二门，好禅悦佛，言菩提行，修西天记，作往生文，道释并修，则上帝未见用也。 又曰：陶有三是四非，天之罪也。 一日潜心大道，主教玄门。 梁国将倾，为陶奉佛，尝祝帝祚，有孝道心。 二日博济孤贫，多行孝行，绍述三茅、杨许真风，不负太上遗教。 三曰苦心忘食，洁白精修，采炼药饵，研穷典教，不忘上真覆载之恩。 有此三是，将补之职，绿有四非，禁忌太甚。 四非者，一曰注药饵方书，杀禽鱼虫兽救治病苦。 ．虽有救人之心，实负杀禽之罪。 二曰好筹星度，穷究天机，潜厌鬼神，言人休咎。 三曰种植花木，阱锄山林，好卜幽奇，伐木匠屋，自持声势，亲近朝廷。 四曰望想太重，便望升仙，创待仙楼，造降真馆。 虽有门人弟子之广，皇未有上天之绿。 汝今受吾秘言， 当服事陶君，必登太极。 其陶徒众皆修真之人，若尘世积功未及此。 盖学道之士立功成果之地，其福甚速焉。 是夕，仙君乃传秘语，分付桓凯，立盟誓竟、仙君乃告之曰：经录秘诀，图书汗漫无穷，指要归根之论，只一二事而已。 吾昔言玉京之境、日月之山、昆仑之域，子还解斯义否？ 凯曰：未知是义。 仙君曰：人身中有三万六千精光神，一万二千魂魄神。 泥丸之中有长生不死大君，二仪四象、八卦九宫、昆仑方壶、诸天宫阙，并悉圆满，无多无少，与天地混同。 以至风云、雷雨、霜雾、雪雹、烟霞、草木、山川、灵桩、寿干、鱼龙、人畜、物化、胎变、天堂、幽冥，无不具足。 盖俗人六情妄起，三毒缠愈，入骨侵伤，无知无识，神昏识暗，魂魄沉迷，声想色情，恩深爱染，未能脱洒，乃成异类，不得超生，转增迷闷，四百四病，八邪四生，三灾九横，王法天慎。 是故太上阐三洞之典，开四辅之门，引论含生，同归圣域，岂不劳乎？ 今子受吾太上真玄秘语，勿泄常流，生轻薄心，枉遭罪责。 凯跪悚稽首再拜，受仙君．秘语。 仙君日：夫日月者，天地中妙极，乾坤中精光，阴阳中独曜。 在天为眼目j 在海为精光，在万物为精华，在人身为魂魄。 今汝身中秘宝，头曰昆仑，顶日泥丸，中日脑门。 脑门乃神游之地，天帝居焉。 自日月昆仑之下，流光散於金池，与肝肺相通。 肺乃金中之鼎，外应鼻。 肝乃木中之华，外应眼。 眼随五色而欲，鼻随五香而塞。 金与木隔，流光於门，神珠散失，遂至死地。 今吾授子不死之道，太上登云之方，实非小浅。 昔束华青堂山紫玄仙伯教吾此法，今七百年矣。 须先修水火交接坎离二门，乃得长生。 心不通灵，神不变化，难升云天。 昔许真君得西山丈人授此上道，即日乃登碧落，岂不乐乎？ 夫人顶骨闭塞，漏泄邪气，鬼风吹合，昆仑神附心中，夜煎旦煮，肝肾注精施阳，败损金鼎，神不能禁，真仙不居，上帝不降，甘受死地。",
      "translated_text": "He had over seventeen hundred disciples, with three hundred admitted to his inner chamber, yet only seven attained his Dao. \"Count them—Xie, Qian, and Ru—you are also among this gentleman’s disciples. I shall now transmit to you the most wondrous teaching. You must let your hair loose, bare your feet, take up the hoe as a farmer, and seek to become a gardener for twelve full years. Cultivate hidden merits, never reveal the Dao, guard the secret formulas, and appear no different from the common folk, so none suspect. In time, I shall recommend you, and the Celestial Emperor will surely summon you to ascend the cloudy heavens.\"\n\nAt this, Kai bowed again, vowed his oath, and mounted the altar. With hair unbound and feet bared, he received the Dao.\n\nThe Immortal Lord said: \"Tao Hongjing was surpassingly intelligent, refining his literary skills and exhausting his spirit in the study of texts. He probed the essential meaning of the scriptures, delighted in recording strange matters, and passionately loved mountains and rivers. He planted pines and bamboos, his heart set on lofty heights, yearning to ascend the cloudy heavens. Though the Celestial Emperor took note, his true merit was slight, and his hidden efforts, though laborious, fell short of the seven disciples who truly learned the Dao.\n\n\"Moreover, Tao sought the truth in many ways, dividing his spirit between two paths. He took pleasure in Chan meditation and Buddhist teachings, speaking of bodhi conduct, compiling records of the Western Heaven, and composing texts on rebirth. Practicing both Daoist and Buddhist ways, he has yet to gain the Celestial Emperor’s favor.\n\n\"He has three virtues and four faults, for which Heaven holds him accountable. First, he devoted himself to the Great Dao and presided over the Mysterious Gate. Yet when the Liang dynasty faced collapse, he turned to Buddhism, praying for the emperor’s longevity, displaying a filial heart. Second, he broadly aided the orphaned and poor, performed many filial deeds, and carried forward the true teachings of the Three Mao and Yang and Xu, not betraying the legacy of the Most High. Third, he toiled tirelessly, forgetting food, maintaining purity in his cultivation, refining medicines, and exhaustively studying the classics, never forgetting the grace of the Supreme Perfected.\n\n\"For these three virtues, he may yet be appointed to an office. But his four faults are too grave. First, he compiled medical formulas requiring the killing of birds, fish, insects, and beasts to cure suffering. Though his intent was to save lives, he incurred the sin of slaughter. Second, he was fond of astrological calculations, probing heavenly secrets, secretly controlling spirits, and divining fortunes. Third, he planted flowers and trees, dug pits in the mountains, loved divining obscure omens, felled trees to build houses, flaunted his reputation, and drew close to the court. Fourth, his aspirations were too lofty, fixated on ascending as an immortal. He built pavilions awaiting transcendence and halls for descending perfected beings. Though his disciples were many, he has yet to earn the right to ascend the heavens.\n\n\"Now that you have received my secret teachings, you must serve Master Tao faithfully, and you shall surely ascend to the Great Ultimate. His followers are all cultivators of the truth, yet if their worldly merits fall short, they may not compare to those who establish merit in the realm of Daoist practice, where blessings come swiftly.\"\n\nThat evening, the Immortal Lord transmitted secret instructions to Huan Kai, concluding the ritual of oath and alliance. Then he said: \"The scriptures and secret formulas, the charts and books, are boundless and vast, but the essential teachings that return to the root amount to only one or two matters. I once spoke of the realm of Jade Capital, the mountains of the sun and moon, and the domain of Kunlun—do you yet understand their meaning?\"\n\nKai replied: \"I do not understand.\"\n\nThe Immortal Lord said: \"Within the human body dwell thirty-six thousand spirits of radiant essence and twelve thousand spirits of the hun and po. In the Mud Pill Palace resides the Great Lord of Undying Life. The Two Modes and Four Images, the Eight Trigrams and Nine Palaces, Kunlun and Fanghu, and all the heavenly palaces are perfectly complete, neither more nor less, merging with Heaven and Earth. Even wind and clouds, thunder and rain, frost and fog, snow and hail, mist and rosy clouds, grasses and trees, mountains and rivers, numinous steles, longevity stems, fish and dragons, humans and beasts, transformations and rebirths, heavenly realms and dark underworlds—all are fully contained within.\n\n\"Yet the common folk, stirred by the six emotions and entangled by the three poisons, suffer deep harm to their bones, lacking knowledge and awareness. Their spirits are dull, their consciousness dim, their hun and po lost in confusion. Seduced by sounds, forms, and desires, bound by deep love and attachment, they cannot break free, becoming other kinds of beings. Unable to transcend, their confusion deepens, suffering the four hundred and four illnesses, the eight evils and four births, the three disasters and nine calamities, the punishments of kings and the judgments of Heaven. Thus, the Most High expounded the Three Caverns and opened the Four Auxiliaries, guiding all living beings to return together to the sacred realm—how could this not be arduous?\n\n\"Now you have received the Most High’s true and mysterious secret teachings. Do not reveal them to the common folk, nor let frivolous thoughts arise, lest you incur sin and punishment.\"\n\nKai knelt in awe, bowed deeply, and received the Immortal Lord’s secret instructions.\n\nThe Immortal Lord said: \"The sun and moon are the wondrous extremes within Heaven and Earth, the radiant essence within Qian and Kun, the solitary brilliance within yin and yang. In the heavens, they are the eyes; in the sea, they are the luminous essence; in all things, they are the vital essence; in the human body, they are the hun and po.\n\n\"Now, the secret treasures within your body: the head is called Kunlun, the crown is called the Mud Pill, and the center is called the Brain Gate. The Brain Gate is where the spirit roams, where the Celestial Emperor resides. Below the sun and moon and Kunlun, radiant light flows into the Golden Pool, connecting with the liver and lungs. The lungs are the cauldron within metal, externally corresponding to the nose. The liver is the flower within wood, externally corresponding to the eyes. The eyes follow the five colors in desire, the nose follows the five fragrances in congestion. Metal and wood are separated, the radiant light at the gate scatters, the spirit pearl is lost, and thus one reaches the realm of death.\n\n\"Now I transmit to you the Way of Undying and the Celestial Emperor’s method for ascending the clouds—this is no trivial matter. Long ago, on the Azure Flower Mountain of the Eastern Marchmount, the Purple Mystery Immortal Earl taught me this method, and seven hundred years have passed since then. You must first cultivate the union of water and fire, the Kan and Li gates, to attain longevity. If the heart does not connect with the numinous, if the spirit does not transform, ascending the cloudy heavens will be difficult. Long ago, the Perfected Lord Xu received this supreme teaching from the Elder of the Western Mountain and ascended to the Azure Vault that very day—how joyous was that!\n\n\"When the bones of the crown are closed and sealed, leaking evil qi, ghostly winds blow and gather. The spirit of Kunlun attaches to the heart, scorching it night and day. The liver and kidneys discharge essence and expend yang, damaging the Golden Cauldron. The spirit cannot restrain them, true immortals do not dwell there, and the Celestial Emperor does not descend. Thus, one willingly accepts the realm of death.\"",
      "overlap_context": " Pillar, though they do not connect. Only by obtaining the secret and wondrous numinous scripture may one arrive.\"\n\nKai bowed deeply again, his heart leaping with longing, and begged to hear the essential teaching.\n\nThe Immortal Lord said: \"Eight thousand *li* to the southeast lies the ancient site of Mao Peak, where the two immortals Yang and Xu once dwelled. In the mountains resides an extraordinary man surnamed Tao, styled Hermit, known in the Liang dynasty as Master Tao Hongjing of Zhenbai.\"",
      "start_char": 1223,
      "end_char": 2481,
      "start_sentence": 44,
      "end_sentence": 91,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.68306517601013,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\桓真人升仙记.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "今子回日月之华景，昭一太极之昆仑，左目右眼，乃天中之日月，昭一於十二时中。 仙君遂歌日：金鼎天门开，反童复婴孩。 日月照昆仑，真君自然来。 三年结黄云，千日成圣胎。 九年登金阙，一纪升三台。 龙虎自然交，上帝安金台。 众神仰天表，听慕心徘徊。 子今受灵文，专心如死灰。 积功十二年，功毕登云梯。 白光生圆象，紫气冲云霓。 端虚念太乙，浩劫天地齐。 是时桓凯心目如失，喟然自叹：多劫生死，不悟灵根，但指心王，便是真道。 恨不识太空之表，有无何有之乡，昆仑之问，有长生之景，日月之下，枉死无穷。 今识元精不生不灭，是水火之根本，以心肾为宗，道妙之门，实昆仑之上。 凯稽首再拜，复进：日月之精光，如何照其天门，开昆仑之顶？ 仙君日：以心注目想丹田片时，便回光直上返照天门，天门乃脑门也。 但於时中，不问早晚，干事含光默默，不离顶中，谓之默朝上帝法。 秘之秘之。 凡人心目驰鸶於外，未尝游心於自己之内。 又歌日：内照返灵光，太乙含真芳。 馨香散华容，郁郁生紫房。 天门开上苍，默然朝玉皇。",
      "translated_text": "Now you return the radiance of the sun and moon, illuminating the Kunlun of the Great Ultimate. The left eye and right eye are the sun and moon within heaven, shining as one through the twelve hours.\n\nThe Immortal Lord then sang:\n*\"The Golden Cauldron’s Celestial Gate opens,\nReverting to youth, restoring the infant’s grace.\nSun and moon illuminate Kunlun,\nThe Perfected Lord arrives naturally.\nThree years knit the yellow clouds,\nA thousand days form the sacred embryo.\nNine years ascend the Golden Portal,\nTwelve years rise to the Three Terraces.\nDragon and tiger naturally unite,\nThe Celestial Emperor secures the Golden Terrace.\nAll spirits gaze heavenward in reverence,\nListening in awe, their hearts adrift.\nNow you receive the numinous scripture,\nFocus your mind like dead ashes.\nAccumulate merit for twelve years,\nAnd when complete, ascend the cloud ladder.\nWhite light arises in perfect form,\nPurple qi surges through the clouds.\nAlign with emptiness, contemplate the Great One,\nThrough vast kalpas, heaven and earth stand as one.\"*\n\nAt this, Huan Kai felt as though his heart and eyes had been lost. He sighed deeply and said: *\"For countless kalpas, I wandered in life and death, unaware of the numinous root. I merely pointed to the heart’s sovereign, believing it to be the true Dao. How I regret not recognizing the beyond of the great void—the realm of ‘what is and is not’—or the inquiry of Kunlun, where the scene of longevity abides. Beneath the sun and moon, countless souls die in vain. Now I understand: the primordial essence is neither born nor destroyed; it is the root of water and fire. The heart and kidneys are its foundation, the gate of the Dao’s mystery—truly atop Kunlun.\"*\n\nKai bowed deeply and asked again: *\"How does the radiance of the sun and moon illuminate the Celestial Gate and open the crown of Kunlun?\"*\n\nThe Immortal Lord replied: *\"Focus the heart on the eyes and visualize the cinnabar field for a moment, then reverse the light upward to reflect directly upon the Celestial Gate—the Celestial Gate is the gate of the brain. At any time, whether early or late, engage in affairs while containing the light in silence, never departing from the crown. This is called the ‘Method of Silent Audience with the Celestial Emperor.’ Guard this well, guard this well.\n\nOrdinary people’s hearts and eyes wander outward, never turning their minds inward to themselves.\"*\n\nHe sang again:\n*\"Inward illumination returns the numinous light,\nThe Great One embraces true fragrance.\nAroma scatters like blossoming countenance,\nLush and flourishing, purple chambers arise.\nThe Celestial Gate opens to the azure heavens,\nSilently paying homage to the Jade Emperor.\"*",
      "overlap_context": "ern Mountain and ascended to the Azure Vault that very day—how joyous was that!\n\n\"When the bones of the crown are closed and sealed, leaking evil qi, ghostly winds blow and gather. The spirit of Kunlun attaches to the heart, scorching it night and day. The liver and kidneys discharge essence and expend yang, damaging the Golden Cauldron. The spirit cannot restrain them, true immortals do not dwell there, and the Celestial Emperor does not descend. Thus, one willingly accepts the realm of death.\"",
      "start_char": 2481,
      "end_char": 2900,
      "start_sentence": 92,
      "end_sentence": 113,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.474621772766113,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\桓真人升仙记.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "仙君又日：夫人入胎之时，先生两目如水泡，余四肢并无，亦无相貌。 次生两肾，内应精输。 而生天地亦然。 天地未分之时，日月未照之日，混混之根， 太阳之始，儒家、佛氏不言此理，但云心为万物之宗主，象帝之先直是无下手处，只得功勤香火，淡食去荤而已。 中有吞符服药，礼月瞻星，吐故纳新，皆不得已而为之。 至於尸解逃形，出神胎息，绝爱忘情，逍遥自在，坐脱立化，托胎投胎，夺荫逃数，藏身隐形，吞日月精华，星驰火侯，炼精啖液，食饵芝木，修释氏蝉蜕空景，舍色行身，布施忍辱，种种利益草生，各得而修之，未证玄理，百千万门。 惟向上乘修行大道，须是灵光自照，内境精明，今画像多於顶门出白光，中现端严相，巍巍而坐莲花，此理亦近乎此义。 但古人童祸其间，且妙有真空，无想无爱，法体本无生死，但不能修大定力，遂致输转，错入别胎，浪死虚生，亿劫不了。 虽遇至人，未肯遽然传授无上妙义、大智圆通。 乃至生安乐家，受报福田，为国王大臣、大聪明人，心地慧圣，发明经典，不兔翻成毒药，因慧生想，流转含识，情爱牵缠，邪见生谤，随落魔境，为魔着爱。 所以百千万劫，不悟真理。 是故太上以慈悲之旨，救度生灵，发明经论，令解真谛，度脱有情之众，悉皈清净之门。 如是默契玄宗，大明心目。 若不内发寂照，定慧双修，真体圆明，未兔生死。 仙君又曰：今子往三茅山古迹华阳洞天，与陶氏家为使用，藏真默守，无漏玄机，积行施功，默朝上帝，一纪功毕，须登云天。 凯日：路遥水隔，江湖非舟楫安能得到？ 仙君日：吾有通泉地脉灵符，子於今夜沐浴净身，立华元馆中，闭自静思，令子可到。 此去华阳八千里，有大江水府帝君、杨子江、灵川谷、紫金白玉洞、眷属三千六百人、部领神兵一万、神龙五条、雷公风伯、雷神使者共五百人，下元水府都统昊越瓯闽仙源，蓄水九千万斛，潮三十六顷，雄师八万人，雷鼓九百面，寿命十万岁，与蓬莱都水使者同职。 下元与中上水府皆主管江潮、天下水旱、人间之事。 凯日：华阳三茅之职何如？ 仙君日：掌仙籍，统昊越之罪福，帝畿列土，分九州帝业事。 三仙君有主报力士仙众各万人，并职九州，管天下学仙之士功行过愆。 又曰； 华阳第八洞天与十大洞天、三十六小洞天皆通穿四海、江渍、蓬莱、十洲、昆仑之峰，下至邓都幽岳，皆可往来。 但凡夫染秽，色欲妄想闭障。 若邪见不生，圣凡路通，乾坤六合内外皆可游也。 於是仙君用神镜通泉之术，凯不可得而知之。 凯遂闭目，不行而至，不速而往，钦然之问，如闻有人相问之声，已渡江湖。 或闻宫室异香，或闻歌声，或闻仙乐，忽闻仙君曰：开目。 如梦寐中，遂乃登岸。 青山孤耸，碧海侵人，舟楫往来，皆非旧所。 乃询行人，日：此问之丹阳也。 遂问茅峰相去多少。 行者曰：尚有二百里。 凯问有官宇乎？ 曰：有大梁陶隐居先生兴建宫祠，招贤纳士。 凯亟寻路而往。 陶夜梦神光满室，彩云连霄，有金甲神人指陶日：明日有异人至。 陶日：早晚？ 曰：午时。",
      "translated_text": "The Immortal Lord spoke again: \"When a person enters the womb, the eyes form first, like water bubbles, while the other four limbs and appearance are yet absent. Next, the two kidneys emerge, corresponding internally to the essence-conduits. The birth of Heaven and Earth follows the same pattern. Before Heaven and Earth divided, before the sun and moon shone, there lay the root of primordial chaos, the inception of the Great Yang. The Confucians and Buddhists do not speak of this principle; they merely say the heart is the lord of all things, prior even to the Supreme Emperor—yet this offers no place to begin. They can only perform diligent rituals, burn incense, eat bland food, and abstain from meat. Some swallow talismans, ingest medicines, worship the moon and gaze at the stars, exhale the old and inhale the new—all measures taken out of necessity. As for corpse-liberation, escaping form, spirit-exit, embryonic breathing, cutting off love and forgetting emotion, attaining carefree ease, sitting in liberation or standing in transformation, borrowing wombs or entering them, seizing destiny or evading fate, concealing the body or hiding the form, swallowing the essence of the sun and moon, riding the stars or controlling fire, refining essence and swallowing saliva, consuming lingzhi and herbs, practicing the Buddhist cicada-shedding of empty radiance, relinquishing form to cultivate the body, giving alms and enduring humiliation—these myriad beneficial practices, each pursued according to one’s capacity, have yet to grasp the profound principle. There are hundreds of thousands of methods. Only in the supreme vehicle of cultivation, the great Dao, must one illuminate the spirit-light within, making the inner realm luminously clear. Nowadays, paintings often depict a white light emanating from the crown, revealing a dignified countenance seated majestically upon a lotus—this imagery approaches the truth. Yet the ancients concealed their subtlety within it, for there exists wondrous true emptiness, free from thought and desire. The dharmakāya is fundamentally beyond birth and death, but lacking the power of great samādhi, one becomes subject to transmigration, mistakenly entering other wombs, dying in vain and living futilely, bound for kalpas without end. Even when encountering a perfected being, they are unwilling to immediately transmit the supreme, wondrous meaning or the great wisdom of perfect interpenetration. Instead, they may be born into blissful families, reaping the rewards of merit, becoming kings, great ministers, or men of profound intelligence. Though their minds are sagely and wise, illuminating the scriptures, they may unwittingly turn wisdom into poison. Through wisdom, thoughts arise; through thoughts, sentient beings flow and turn, entangled by love and emotion, generating perverse views and slander, falling into demonic realms, ensnared by demonic attachments. Thus, for hundreds of thousands of kalpas, they fail to awaken to the true principle. Therefore, the Most High, moved by compassion, saves and delivers living beings, expounding scriptures and treatises to reveal the true meaning, liberating all sentient beings and guiding them to the gate of purity.\n\n\"Only by inwardly generating silent illumination, cultivating both samādhi and wisdom in tandem, and perfecting the true body with radiant clarity can one escape birth and death.\"\n\nThe Immortal Lord continued: \"Now you shall go to the ancient site of Huayang Cave Heaven on Mount Sanmao, where you will serve the Tao family, guarding the true and silently preserving the flawless mystery. Accumulate merit and practice the ‘Method of Silent Audience with the Celestial Emperor.’ After twelve years of cultivation, you must ascend to the heavens.\"\n\nKai asked: \"The path is distant, waters divide us, and without boats or oars across rivers and lakes, how can I reach it?\"\n\nThe Immortal Lord replied: \"I possess the talisman of the Earth’s Veins and the Spirit Spring. Tonight, bathe and purify your body, stand in the Hall of Flourishing Primordiality, and enter silent contemplation—then you may arrive.\"\n\nFrom here to Huayang, the distance spans eight thousand *li*. There lies the Water Palace of the Great River, the Yangzi River, the Valley of Numinous Streams, the Caves of Purple Gold and White Jade, with a retinue of three thousand six hundred, commanding an army of ten thousand divine soldiers, five divine dragons, the Duke of Thunder and Earl of Wind, five hundred thunder spirit messengers, and the Lower Prime Water Palace’s Commander-in-Chief, Wu Yue of Ou Min’s Immortal Source. It stores ninety million *hu* of water, with thirty-six *qing* of tides, eighty thousand fierce warriors, nine hundred thunder drums, and a lifespan of one hundred thousand years—equal in rank to the Penglai Water Palace’s Commander. The Lower Prime, Middle, and Upper Water Palaces all govern the tides, the world’s floods and droughts, and human affairs.\n\nKai asked: \"What are the duties of the Three Lords of Sanmao at Huayang?\"\n\nThe Immortal Lord replied: \"They oversee the registers of immortals, administer the blessings and misfortunes of Wu Yue, and manage the imperial domains and the affairs of the Nine Provinces. The Three Immortal Lords command reporting spirit-warriors and ten thousand immortals, together governing the Nine Provinces and overseeing the merits, transgressions, and cultivation of those who seek immortality.\"\n\nHe added: \"The Eighth Cave Heaven of Huayang connects with the Ten Great Cave Heavens, the Thirty-Six Lesser Cave Heavens, the Four Seas, the Yangzi and its tributaries, Penglai, the Ten Isles, the peaks of Kunlun, and even the Dark Capital and the Nether Peaks—all are accessible. Yet ordinary people, stained by defilement, desire, and delusion, remain obstructed. If perverse views do not arise, the paths of sages and mortals become open, and one may wander freely within the six directions of Heaven and Earth, both inner and outer.\"\n\nThereupon, the Immortal Lord employed the art of the Spirit Mirror and the Vein-Spring, a method Kai could not comprehend. Kai closed his eyes and, without moving, arrived; without haste, he departed. In an instant, as if hearing voices questioning him, he had already crossed the rivers and lakes. At times, he caught the scent of palaces and rare fragrances; at others, he heard singing or celestial music. Suddenly, he heard the Immortal Lord say: \"Open your eyes.\" As if in a dream, he stepped ashore. Green mountains rose solitary, the azure sea lapped at the shore, and boats came and went—none of it familiar. Asking a passerby, he was told: \"This is Danyang.\" He then inquired about the distance to Mao Peak. The traveler replied: \"Two hundred *li* remain.\" Kai asked if there were any temples. The traveler said: \"There is a grand shrine built by Master Tao the Recluse of Great Liang, who gathers worthies and welcomes scholars.\"\n\nKai hurried along the path. That night, Tao dreamed of his chamber filled with divine light and clouds of radiant hues ascending to the heavens. A golden-armored spirit pointed at Tao and said: \"Tomorrow, an extraordinary person will arrive.\"\n\nTao asked: \"Morning or evening?\"\n\nThe spirit replied: \"At noon.\"",
      "overlap_context": "wn. This is called the ‘Method of Silent Audience with the Celestial Emperor.’ Guard this well, guard this well.\n\nOrdinary people’s hearts and eyes wander outward, never turning their minds inward to themselves.\"*\n\nHe sang again:\n*\"Inward illumination returns the numinous light,\nThe Great One embraces true fragrance.\nAroma scatters like blossoming countenance,\nLush and flourishing, purple chambers arise.\nThe Celestial Gate opens to the azure heavens,\nSilently paying homage to the Jade Emperor.\"*",
      "start_char": 2900,
      "end_char": 4058,
      "start_sentence": 114,
      "end_sentence": 153,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.150240898132324,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\桓真人升仙记.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "先生觉，告弟子曰：子当与吾扫门，至午时有好客至，慎勿阻，急来报我。 日当亭午胱足，唱诗曰：果有客至，披发黄花生紫云； 日月周天轮，混混太虚中，不与众生草。 昆仑十二峰，上帝朝万巡。 一日功行满，升空谒元君。 弟子莫识其语，急走报陶公。 公喜，请入，乃见散发胱足，狂怪异常。 陶日：子来有何意？ 凯曰：闻先生高道，来与先生种蔬。 陶日：适来歌声甚异，言何事也？ 凯曰：闻人之言，学人之歌，岂得识之。 陶乃止。 再问曰：子姓何？ 凯日：姓恒名凯，川人也。 陶曰：几日离家？ 凯曰：昨夜离家。 陶笑曰：狂生狂生。 又谓凯曰：愿为圃者，莫不贱乎？ 凯曰：愿闻道耳。 陶曰：吾上中下三等弟子。 凯日：上等弟子如何？ 陶曰：衣绫罗，服芝木，撰文注经，掌书记，合丹药，朝真陪贵，出入朱门，入吾室也。 凯日：中等弟子何如？ 陶曰：掌书状，修问答，合汤药，衣绢帛，服青锤饭，饮松酵酒，住吾庭之左右：授以法术，陪有道之士。 凯曰：下等弟子如何？ 陶曰：衣绢帛，食五谷，合施药，住吾舍，扫室焚香，礼星月，教以服气，或与知识人往还，接宾客，种蔬菜草药。 陶曰：三等弟子，各有数百。 凯日：弟子非三等弟子之列，种圃汲泉，伐薪烧香，直厕淘井，可乎？ 陶日：但恐子不肯为此耳。 再拜愿为烧香汲泉之人，陶留之。 凯凡住陶家，寒温不问，贵贱不分，饥饱不瞋，劳苦不叹。 弟子嘲弄不动，役使不懒。 人未起先起，人已睡未睡。 不烧香，不礼拜，不诵经，不忌荤。 无憎无拓，不华不艳，少言少语，不喜不怒。 闲则扫地，忙则斫薪。 J 动则烧火，静则洗衣。 由是在陶家一十二年，陶亦不识。 虽在目前，陶亦不顾。 亦不挠陶。 陶之宅有三层高楼，最上层近松之梢，每听松韵，以弟子居二层之下，凡注书千余卷。 梁武帝有休咎，每遣中使来问，先生或画牛答诏。 又问社稷年祚，先生解注，知梁武社稷不远，至庚子辛丑之年以朱笔晕之。 武帝亦不晓。 朝士呼陶为山中宰相。 先生道高德迈，四海皈依，弟子千余人，入室者三百人。 修朱阳馆，创待仙楼、望诏阁，精修香火，每尝以扇遮面，恐黑气笼罩神光。 尝曰：上帝若来诏我，当令此山为琼楼玉阁。 先生时年八十四岁矣，筋力有余，动作不倦，注解经书，日未尝忘。 好种竹栽药，炼丹於永嘉大弱岩木溜屿陶山之巅。 先生生而有异，面目光彩，长髭须，美容貌，身长七尺，秀目细眉，而气清可掬，言语恬静。 博通古今，精於艺术、天文历、象、医药，诸家所为，靡不洞晓。 至大梁天监元年八月十五日早，大茅山上忽白光数条，俄顷云蓊郁，林泉清明，天乐嘹亮。 众见红霞五彩，仙鹤一只，青衣童子执诏空中，五色霞内现霓旌羽节，仙童灵官百余人侍一空车，状若龙驾。 童子与鹤俱至庭下，陶意谓上帝召己，仙童日：无烦劳神，速令桓凯更衣、饮丹、宣诏。 仙童日：上帝与旱真正在通明金阙宫寥阳殿等凯至矣。 於是凯澡沐、服丹，宣诏曰：念子默运有功，阴德不息，明师妙旨，速证仙家，体妙太虚，神游金阙，多生怨债，消若春冰，夙世过愆，如风灭烛。 金丹鹤诏，遣至茅峰，紫府众真，劫来仙馆。 辛勤劳苦，早晚不侨，志若乔松，宜登仙位。",
      "translated_text": "The Master awoke and said to his disciples: \"You shall sweep the gate with me. At noon, an esteemed guest will arrive—take care not to bar his way, and hasten to inform me.\" As the sun reached its zenith, Kai washed his feet and chanted:\n\n*\"A guest indeed has come—\nUnbound hair, golden blossoms, purple clouds arise;\nThe sun and moon wheel through the heavens,\nVast and boundless, the Great Void,\nNot as the grasses of the multitude.\nThe twelve peaks of Kunlun,\nWhere the Emperor makes his ten thousand circuits.\nWhen a single day’s merit is complete,\nOne ascends to the heavens to pay homage to the Primordial Sovereign.\"*\n\nThe disciples, not understanding his words, hurried to report to Master Tao. Delighted, Tao invited Kai in, only to see him with unbound hair, bare feet, and an appearance most wild and strange.\n\nTao asked: \"What brings you here?\"\n\nKai replied: \"I have heard of your lofty Dao and come to cultivate vegetables with you.\"\n\nTao said: \"Your song just now was most unusual—what did it mean?\"\n\nKai answered: \"I heard others speak, learned their song—how could I understand it?\"\n\nTao let the matter rest. He asked again: \"What is your surname?\"\n\nKai said: \"My surname is Huan, given name Kai, a man of Shu.\"\n\nTao asked: \"How many days have you been away from home?\"\n\nKai replied: \"I left last night.\"\n\nTao laughed: \"A madman, a madman indeed!\"\n\nThen he said to Kai: \"Those who tend gardens—are they not all of lowly station?\"\n\nKai said: \"I wish only to hear the Dao.\"\n\nTao said: \"I have three ranks of disciples.\"\n\nKai asked: \"What of the highest rank?\"\n\nTao replied: \"They wear silks and brocades, consume lingzhi and pine, compile texts and annotate scriptures, manage records, concoct elixirs, attend the immortals and accompany the noble. They enter my chambers.\"\n\nKai asked: \"And the middle rank?\"\n\nTao said: \"They manage correspondence, compose questions and answers, prepare decoctions, wear silk and hemp, eat millet and pine-needle wine, dwell to the left and right of my courtyard. I teach them arts and techniques, and they accompany those of the Dao.\"\n\nKai asked: \"And the lowest rank?\"\n\nTao said: \"They wear silk and hemp, eat the five grains, dispense medicines, dwell in my lodgings, sweep rooms and burn incense, pay homage to the stars and moon. I teach them to refine qi, and they may associate with learned men, receive guests, and cultivate vegetables and herbs.\"\n\nTao continued: \"Each rank numbers in the hundreds.\"\n\nKai said: \"I do not belong among these three ranks. May I tend the garden, draw water, chop firewood, burn incense, clean privies, and dredge wells?\"\n\nTao said: \"I only fear you will not consent to such tasks.\"\n\nKai bowed twice and vowed to be the one who burns incense and draws water. Tao kept him.\n\nDuring his stay with Tao, Kai paid no heed to cold or heat, rank or humility, hunger or satiety, toil or hardship. The disciples mocked him, but he remained unmoved; he was never lazy in his duties. He rose before others awoke and retired only after they slept. He did not burn incense, bow in worship, recite scriptures, or abstain from meat. Without hatred or resentment, neither vain nor ostentatious, he spoke little, showed neither joy nor anger. In leisure, he swept the ground; in busyness, he chopped firewood. In motion, he tended the fire; in stillness, he washed clothes. Thus he remained in Tao’s household for twelve years, yet Tao did not recognize his worth. Though ever before his eyes, Tao paid him no mind, nor did Kai disturb him.\n\nTao’s residence had a three-story tower, the highest floor brushing the tips of the pines. There he listened to the wind in the pines, while his disciples dwelled on the lower floors. He annotated over a thousand volumes of texts. When Emperor Wu of Liang sought divination, he often dispatched envoys to inquire, and the Master would sometimes draw an ox in reply. When asked about the fate of the dynasty, he interpreted the signs and knew the Liang’s reign would not last long. By the years *gengzi* and *xinchou*, he marked the time in red. Emperor Wu did not understand.\n\nThe court officials called Tao the \"Prime Minister of the Mountains.\" His Dao was lofty, his virtue transcendent, and from all four seas, over a thousand disciples came to follow him, with three hundred entering his inner chambers. He built the Vermilion Sun Lodge, constructed the Awaiting Immortals Tower and the Gazing at Edicts Pavilion, and meticulously maintained the incense and offerings. Often, he would shield his face with a fan, fearing that dark qi might shroud his divine radiance. He once said: \"If the Emperor were to summon me, I would turn this mountain into a palace of jade and towers of crystal.\"\n\nAt eighty-four, the Master’s strength remained abundant, his energy unflagging. He never ceased annotating scriptures, and he loved planting bamboo and cultivating herbs. He refined elixirs atop the peaks of Mount Taoshan in Yongjia’s Great Weakness Grotto and Wooden Drip Isle.\n\nFrom birth, the Master was extraordinary—his countenance radiant, his beard long, his features handsome. He stood seven feet tall, with fine eyes and slender brows, his qi pure and his bearing serene. Well-versed in ancient and modern learning, he was accomplished in the arts, astronomy, calendrics, divination, medicine, and pharmacology. Every discipline he mastered with profound clarity.\n\nOn the fifteenth day of the eighth month in the first year of *Tianjian* of the Great Liang, atop Great Maoshan, several streaks of white light suddenly appeared. In an instant, clouds gathered thickly, the forests and springs grew clear, and celestial music rang out. The crowd saw red and multicolored clouds, a single crane, and a youth in blue holding an edict in the sky. Within the five-colored radiance appeared rainbow banners and feathered regalia, with over a hundred immortal youths and spirit officials attending an empty chariot, its form like a dragon’s carriage.\n\nThe youth and the crane descended to the courtyard. Tao believed the Emperor of Heaven was summoning him, but the immortal youth said: \"Do not trouble yourself. Quickly have Huan Kai change his robes, drink the elixir, and receive the edict.\"\n\nThe youth continued: \"The Emperor and the Early Perfected await in the Luminous Golden Gate Palace’s Liao Yang Hall—Huan Kai is to arrive.\"\n\nThereupon, Kai bathed, donned the elixir, and received the edict:\n\n*\"For your silent merit, ceaseless hidden virtue,\nAnd the wondrous teachings of your enlightened master,\nSwiftly you shall attain the immortal’s home,\nEmbody the wondrous void, roam the Golden Gate.\nDebts of enmity from many lives melt like spring ice,\nPast transgressions vanish like wind snuffing a candle.\nBy golden elixir and crane’s edict,\nWe dispatch you to Maoshan’s peak.\nThe immortals of the Purple Palace,\nFor kalpas have awaited your arrival at the immortal’s abode.\nYour toil and hardship, never shirked,\nYour will steadfast as the pine—\nNow ascend to the immortal’s rank!\"*",
      "overlap_context": "ed *li* remain.\" Kai asked if there were any temples. The traveler said: \"There is a grand shrine built by Master Tao the Recluse of Great Liang, who gathers worthies and welcomes scholars.\"\n\nKai hurried along the path. That night, Tao dreamed of his chamber filled with divine light and clouds of radiant hues ascending to the heavens. A golden-armored spirit pointed at Tao and said: \"Tomorrow, an extraordinary person will arrive.\"\n\nTao asked: \"Morning or evening?\"\n\nThe spirit replied: \"At noon.\"",
      "start_char": 4058,
      "end_char": 5272,
      "start_sentence": 154,
      "end_sentence": 212,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.30720090866089,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\桓真人升仙记.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "诏书到．日，即登云天。 右遣茅峰司命主者保举奉行。 宣毕，乘鹤登云，鸾呜节动，飘讽而去。 初更衣之时，陶祝凯日：与吾於天禁中检寻仙籍，几时功毕，尚少何功，行过愆有若干。 凯领师旨相别，陶有依恋之色，通夕如醉。 桓凯升天，复留颂曰： 存神养气精，清静心光明。 妄想不虚起，求真道自成。 日月照昆仑，昼夜透泥丸。 灵真自然降，功毕登天门。 桓真人升仙记竟 #1『先君』疑应作『仙君』。 #2『玉』原作『王』，据文义改。",
      "translated_text": "Upon the edict’s arrival, he ascended to the cloudy heavens.\n\n*Right: Dispatched to Mao Peak, the Controller of Destiny and his attendants shall ensure its execution.*\n\nThe proclamation complete, he mounted a crane and rose upon the clouds, phoenix bells chiming as the staff stirred, drifting away on the wind.\n\nWhen he first changed his robes, Tao admonished Kai: \"When we search the celestial archives for your immortal register, how much longer must your merit accumulate? What deeds remain unfinished? How many transgressions yet require redress?\" Kai received his master’s instruction and took leave. Tao bore a lingering reluctance, as if intoxicated through the night.\n\nAs Huan Kai ascended to heaven, he left behind this hymn:\n\n*\"Preserve the spirit, nurture the qi’s essence,\nIn clarity and stillness, the heart’s light shines.\nVain thoughts do not arise in emptiness,\nSeeking truth, the Dao naturally forms.\nSun and moon illumine Kunlun,\nDay and night pierce the mud-pill palace.\nThe numinous perfected descend of themselves—\nWhen merit is complete, ascend the Heavenly Gate.\"*\n\n*The Record of Perfected Huan’s Ascension as an Immortal concludes.*",
      "overlap_context": "nlightened master,\nSwiftly you shall attain the immortal’s home,\nEmbody the wondrous void, roam the Golden Gate.\nDebts of enmity from many lives melt like spring ice,\nPast transgressions vanish like wind snuffing a candle.\nBy golden elixir and crane’s edict,\nWe dispatch you to Maoshan’s peak.\nThe immortals of the Purple Palace,\nFor kalpas have awaited your arrival at the immortal’s abode.\nYour toil and hardship, never shirked,\nYour will steadfast as the pine—\nNow ascend to the immortal’s rank!\"*",
      "start_char": 5272,
      "end_char": 5482,
      "start_sentence": 213,
      "end_sentence": 225,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.495097637176514,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\桓真人升仙记.txt",
        "category": "记传类"
      }
    }
  ]
}