{
  "source_id": "橐钥子",
  "source_file": "chunked_daozang\\橐钥子.json",
  "total_chunks": 3,
  "total_original_chars": 2581,
  "total_translated_chars": 14239,
  "total_translation_time": 71.50662469863892,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏太清部\\橐钥子.txt",
    "category": "正统道藏太清部"
  },
  "full_translation": "**The Tuoyuezi**\n\n**Scroll Title: The Tuoyuezi**\n*Volume One. Author unknown, likely composed during the Song dynasty.*\n*Source text: Orthodox Daoist Canon, Taiqing Section.*\n\n---\n\n**The Tuoyuezi: The Three Ways Illuminate the True and Return to the Root (Chapter One)**\n\nThe Tuoyuezi said: Heaven possesses its essence, Earth possesses its numen. Should a person obtain them, they may attain longevity. In heaven, they form images; on earth, they take shape. Shape and image receive qi, and from qi arise essence and numen. One cannot abandon shape to seize image, nor abandon image to seize shape. To seize shape is to lose image; to lose image is to have no shape.\n\nSomeone asked: What is the essence of heaven? What is the numen of earth? And how can they determine a person’s life and death?\n\nHe replied: The essence of heaven is treasure; the numen of earth is treasure.\n\nAsked: What is treasure?\n\nGold and jade. In ancient times, the Dark Emperor refined gold within the Grotto-Heavens, and the Azure Youth buried jade in the Hidden Palace. Thus we know: without treasure, heaven’s sun and moon would not shine so brightly; without treasure, earth’s mountains and peaks would not remain eternally still; without treasure, a person’s form and spirit would not endure in wholeness.\n\nAsked: From whence does treasure arise, that it is thus?\n\nHe replied: Yin and yang congeal qi. Heaven and earth cover and bear all. Spring warms with benevolence; summer heats with propriety; autumn chills with righteousness; winter freezes with wisdom. Through such transformations, treasure is accomplished. When yin prevails, it becomes gold; when yang abounds, it crystallizes as jade. This is how I know it to be so.\n\nAsked: Can other medicines be used to produce it?\n\nHe replied: All medicines that are wrought do so by revolving yin to activate yang, turning softness into hardness. They are nourished by the qi of the Five Phases and invigorated by the qi of the four seasons. Thus their transformations likewise accord with nature.\n\nAsked: Heaven and earth endure forever—can they be without treasure?\n\nHe said: Indeed.\n\nAsked: Are humans the same as heaven and earth?\n\nHe said: The same.\n\nAsked: Why then do humans not equal heaven and earth in longevity, but perish in an instant?\n\nHe replied: Heaven and earth are without desire, so their treasure remains ever-present, and thus they endure. The human heart harbors desire, and so its treasure is lost—hence the fleeting moment.\n\nAsked: I now recognize the treasure of heaven and earth. But the treasure within humans remains unclear. I wish to hear its principle.\n\nHe replied: The treasure of humans lies in taking bone as gold, marrow as jade, spirit as essence, and numen as consciousness. Once a person is stained by desire, marrow is exhausted and bones wither. When marrow is exhausted, essence loses its spirit; when bones wither, numen loses its consciousness. When numen loses consciousness, spirit scatters; when essence loses its spirit, qi perishes. Thus the heart grows senile, the face wrinkles, the brain shrinks, and the hair turns white—all because the body’s treasure gradually departs. When it is entirely gone, death follows.\n\nAsked: My face is already wrinkled, my hair already white—am I to die?\n\nHe replied: Yes.\n\nAsked: If I rid myself of desire, can my treasure be restored?\n\nHe said: It cannot be restored.\n\nAsked: Earlier you said heaven and earth are without desire and thus endure forever. Since humans are no different from heaven and earth, if I emulate their lack of desire, why can my treasure not be restored?\n\nHe replied: Treasure is difficult to obtain but easy to lose. You have already lost it—it is difficult to recover.\n\nAsked: Are you deceiving me? You claim that with treasure one lives, without it one dies. Yet I see that I have not died, so my treasure must still remain. If treasure remains, then without desire I should endure forever. Why do you now say that without desire my treasure cannot be restored? In matters of life and fate, one should not jest.\n\nHe said: I do not jest with you.\n\nAsked: What other method can restore my treasure?\n\nHe said: You are not a spirit-inspector—you confuse others with such questions.\n\nThereupon, for three days and nights, he neither slept nor rested, pondering without cease until his bones stood stark. Yet the principle of spirit-inspection remained utterly obscure. He reflected on the master’s words and entreated him to impart the hidden secret.\n\nHe replied: Spirit-inspection means inspecting things and inspecting oneself—hence the name.\n\nAsked: I see only inspection of things—where is the inspection of oneself?\n\nHe said: Without self-inspection, how can it be called spirit-inspection? Since you do not understand, I shall explain further.\n\nNow, heaven and earth are without desire, so their treasure remains ever-present. Yet even they are steamed by the four seasons, and their treasure threatens to wither; they are turned by the Five Phases, and their treasure threatens to be exhausted. Thus the Dark Emperor and the Azure Youth buried gold and filled with jade—to replenish the withering and exhaustion of heaven and earth. This is why brightness does not cease and stillness does not move. But you, with desire in your heart, have nearly exhausted your treasure, yet you do not comprehend the principle of replenishment. Instead, you vainly cling to withered bones and depleted marrow—how can you compare to heaven and earth?\n\nHe said: I understand! The dull and the wise are divided; dawn and dusk obscure themselves. Now that I have heard these words, I truly know that a withered face can be rejuvenated and white hair can turn black again.\n\nHe said: It is not that gold cannot rejuvenate the face, nor that jade cannot darken the hair. If you but diligently seek, you shall obtain it.\n\nI revere the master’s teaching. You are teachable, and I shall follow you devotedly. I will surely transmit it to you.\n\n---\n\n**The Five Phases Establish Positions; Springs and Stones (Chapter Two)**\n\nThe Tuoyuezi said: Heaven generates the Five Materials—none can be lacking. How much more so for the Way of the Golden Elixir—how can it be forgotten? Seeing your accumulated diligence and unwavering reverence for secrets, I now wish to expound. Calm your heart and still your form.\n\nThe Five Materials extend upward to heaven, where the Five Luminaries are established; they accumulate downward on earth, where the Five Peaks stand firm; they take form within humans, where the Five Viscera arise. They circulate through the myriad things yet never fail in their true origin.\n\nAsked: What is the true origin?\n\nHe replied: The primordial qi.\n\nAsked: Are the primordial qi and the Five Materials the same?\n\nHe said: The primordial qi—vast, it envelops the eight directions; minute, it hides within a single hair. It exhales Kun and inhales Qian, emerging from existence and entering non-existence. The Five Materials receive its governance and thus become the forerunners of all things.\n\nThus, the Five Materials do not depart from primordial qi, nor does primordial qi depart from the Five Materials. When their names are blended, they are one; when their functions are distinguished, they are distinct. Therefore, primordial qi is the lord of the Five Materials, and the Five Materials are the ministers of primordial qi. Thus, lord and ministers stand in mutual attendance, and neither can be set aside.\n\nAsked: Does the Golden Elixir employ primordial qi and the Five Materials?\nHe replied: It does employ them.\nAsked: Do primordial qi and the Five Materials possess form?\nHe said: Primordial qi is originally formless. Through essence it generates form, and those who ingest it neither die nor live.\n\nPrimordial qi departs from the Five Materials and becomes invisible; the Five Materials lose primordial qi and cease to function.\nAsked: From my youth, I have explored the mysterious arts for over a decade. What I have heard from you, Master, are profound teachings that astonish both ear and eye, stirring the spirit and moving the true. I wish to be shown the forms of primordial qi and the Five Materials within the Golden Elixir.\nHe said: How could I have obtained this apart from the supreme art? The distinctions in names and terms are merely apparent.\n\nNow, primordial qi is quicksilver; the Five Materials are the Five Metals.\nAsked: The meaning of quicksilver as primordial qi is clear, but the Five Metals remain obscure to my dull mind.\nHe said: The Five Metals are black lead.\nAsked: Lead is of a single color—are there others besides it?\nHe replied: Since you do not yet understand this, you must be deeply perplexed. Truly, listen to my discourse!\n\nThe reason quicksilver is called primordial qi is that quicksilver is chaotic and undifferentiated, beyond description by form or image. When it flies upward, it becomes cinnabar—this is Lesser Yang. When cinnabar reverts to quicksilver, this is Lesser Yin. As for black bismuth, when it transforms into yellow lead, this is Greater Yang; when yellow lead changes into black lead, this is Greater Yin. These two substances are beyond the reckoning of gods and the knowledge of sages. One Yin, one Yang, they govern the four directions, undergo a thousand transformations and ten thousand changes, subdue all minerals, serve as the root of the Dao, and are the source of the Elixir.\n\nMoreover, lead is black externally, and its number is one; cinnabar is white internally, and its number is four. When one is paired with four, the principle of five is established.\nAsked: The Dao is nearing its culmination in the Divine Elixir! Now that I have received your explanation, sorrow and gratitude intertwine. Should these two substances be used directly, or are there branches and leaves? Are these two the root, and the eight minerals the stem?\nHe said: I have heard you say before, Master, that gold and jade fill and mend heaven and earth—how much more so for humans! I wish to hear it all, to open my heart and eyes.\nHe replied: Since you follow me, why fear you will not attain it? The Dao cannot be obtained in haste, nor can the true be sought and gained suddenly. Let us wait for another day, when I will discourse for you in full.\n\n**Chapter Three: The Eight Trigrams Illuminate Images and Indications**\nCui Yaizi said: The essence of the Eight Trigrams strikes its image in the moon. This Dao is supremely great and cannot be conveyed by mere speech. I will draw a diagram for you, so you may distinguish them.\n\nOn the evening of the third day, the moon emerges at *geng*; its image is *chen*, its essence is wood, its flavor is sour, and its name is green.\nOn the evening of the eighth day, the moon emerges at *ding*; its image is *dui*, its essence is metal, its flavor is acrid, and its name is white.\nOn the evening of the thirteenth day, the moon emerges at *jia*; its essence is metal, its flavor is acrid, and its name is white.\nAt dawn on the sixteenth day, the moon appears at *xin*; its image is *xun*, its essence is wood, its flavor is sour, and its name is green.\nAt dawn on the twenty-third day, the moon appears at *bing*; its image is *gen*, its essence is earth, its flavor is sweet, and its name is male.\nAt dawn on the twenty-ninth day, the moon sets at *yi*; its image is *kun*, its essence is earth, its flavor is sweet, and its name is female.\n\nCui Yaizi said: If you wish to ponder this, you must concentrate your spirit and mind on the Dao, and you will naturally connect with the celestial tally.\nAsked: I have heard you say, Master, that the Eight Trigrams correspond to the eight minerals. Now I see only six—may I hear the remaining two?\nHe replied: These two images are still hidden by heaven and earth. How dare I reveal the heavenly Dao? In truth, I have not received transmission from a teacher; it is through the communion of refined essence that I have gained understanding. When I sought to speak of it, my heart turned inward to the formless. For seven days and six nights, I came to realize it. It was as if I had met the Immortal Lords of the Five Metals, who expounded the Dao of Three Transformations and Five Revolutions. I knew not how it came to be!\n\nWalking along the path, I drummed my belly and sang, then came to your gate and said: \"Little one, I have understood!\" I said to him: \"Excellent! You have attained the Dao of long life!\"\n\n**Chapter Four: The Four Seasons’ Hard and Soft Complete the Year**\nTuo Yaizi said: Heaven completes the myriad things through the four seasons; humans nourish their forms through the four qi. How much more should the wondrous Dao of the furnace and fire emulate this?\nAsked: What is the wondrous Dao of the furnace and fire?\nHe replied: The Dao of heaven: Yang moves at *zi* and ascends at *si*—this is spring and summer. Yin germinates at *wu* and descends at *hai*—this is autumn and winter. When the qi of the four seasons flow in order, a year is completed. On the ninth day, when the heat is at its peak, the Five Metals take flight.\nAsked: What I have heard from you, Master, is like emerging from a ravine to cross the vast sea!\n\n**Chapter Five: The Ninefold Dao Attains Non-Action**\nTuo Yaizi said: The Dao is called the unity of one Yin and one Yang. The Dao begins with one and ends with nine. Thus, the Golden Elixir undergoes nine revolutions and must embody the Five Constants. The August One arises from Yin and Yang, and thus all under heaven serve it. When the myriad images are penetrated and the spirit is numinous, even if one aspect is lacking, how is it different from mere tiles and stones?\n\nTherefore, it can transform bones and flesh, refine the body into light qi, and attain boundless freedom. It roams the Great Veil in carefree abandon. Thus, life and death melt like ice, the dust and filth vanish like smoke. One bows before the Jade Emperor in the radiant scenery, pays homage in the Palace of Pure Life, may receive a mandate from the Eastern Flower, or hold a decree in the celestial clouds. It also clarifies the blessings of seven generations. Accumulating goodness through non-action, it achieves greatness without striving.\n\nThe Master of Abandoning the Key states: \"#1 '柔' should be rendered as '弃'.\"",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "橐钥子 经名：橐钥子。 一卷。 不着撰人，当出于宋代。 底本出处：《正统道藏》太清部。 橐钥子 三道明真反本第一 橐钥子曰：天有其精，地有其灵、若人得之，可以长生。 在天成象，在地成形，形象禀气，气生精灵。 不可去形取象，不可去象取形，取形即失象，失象即无形。 问曰：天精者何也，地灵者何也，而能死生人乎？ 答曰：天精者宝也，地灵者宝也。 曰：宝者何也？ 金也，玉也。 昔玄帝运金於洞天，青童埋玉於阴宫，故知天无宝而日月不大明，地无宝而山岳不恒静，人无宝而形神不常全。 问曰：宝者从何而生，然若是乎？ ，答曰：阴阳结气，天地覆载，春以暄之仁之，夏以暑之礼之，秋以冻之义之，冬以寒之智之，变化若此而遂成焉！ 阴多则为金，阳多射为玉，吾亦然知而然矣！ 问曰：有他药作之乎？ 答曰：凡药作之者，以阴运阳，转柔成刚，以五行之气而滋之，四时之气而鼓之，是以变化亦同自然矣！ 问曰：天地长久，可不为有宝乎？ 曰：然。 问：人天地同乎！ 曰：同。 问：人何不齐天地长久，而人俄顷哉？ 答曰：天地为无欲，其宝常存，故能长久； 人心有欲，其宝丧焉！ 所以俄顷耳。 曰：天地之宝，今已识矣！ 在人之宝所未晓，愿闻其义。 对曰：人之宝者，以骨为金，以髓为玉，以神为精，以灵为识，人既染欲即髓竭而骨枯，髓竭即精不神，骨枯即灵不识，灵不识即神散，精不神即气亡。 是故心为之耄，面为之皱，脑为之臧，发为之素，皆由身宝渐去，去尽即死也。 曰：吾面已皱，发已素，其死乎？ 对曰：然。 问曰：吾以无欲，其宝可复乎？ 曰：不可复也。 问：向言天地无欲，故能长久，人既与天地不殊，吾欲法天地无欲，其宝不可复，何也？ 对曰：宝者难得而易失，子已失矣，难可复之。 曰：君欺我耶！ 谓我有宝即生，无宝即死，我见未死，即应宝在，既是宝在，无欲即合长存，反言无欲不得复宝，性命之重，无相戏耶？ 曰：吾不戏子。 问：更设何法而复宝焉？ 曰：子非神监，於是惑人。 遂三日三夜，不寝不寐，思之不逮，至於骨立，日神监之理，茫然莫解，思惟先生，赐垂乙密。 对曰：神监者，监物复自监，故名神监 。 曰：我只见监在於物，不闻有自监之监耶！ 曰：不能自监，何名神监？ 子既不明，为子重述之矣！ 且天地无欲，其宝常存，尚被四时之所蒸，宝欲枯焉！ 五行之所转，宝欲竭焉！ 是故玄帝青童，埋金填玉者，用补天地之枯竭也。 所以明不息焉，静不动焉，今子心有欲，其宝将尽，不知有填补之理，空拟守枯骨竭髓，子之固也，何如天地乎？ 曰：悟矣！ 愚智有隔，晦爽自昧，今闻是言，信知颓颜之可婴，素发之可黑。 曰：非金颓颜之不婴，非玉素发之不黑，子但勤求，当获之矣！ . 我奉师言，子以可教，相随竭奉，吾必授君矣！ 五行建位泉石第二 橐钥子曰：天生五才，去一不可，况金丹之道，其可忘之乎！ 见子积勤，不恼所秘，今欲演说，夷心静形。 夫五才者，上绪乎天而五曜立焉！ 下积乎地而五岳镇焉！ 中成乎人而五脏生焉！ 周行乎万物，终不殆於真元。 问曰：真元者何？ 答曰：元气也。 曰：元气与五才同乎？ 曰：元气者，其大也则笼罩八隅，其小也则潜藏一毫，呕坤吐乾，出有入无，五才受统，遂成物先。",
      "translated_text": "**The Tuoyuezi**\n\n**Scroll Title: The Tuoyuezi**\n*Volume One. Author unknown, likely composed during the Song dynasty.*\n*Source text: Orthodox Daoist Canon, Taiqing Section.*\n\n---\n\n**The Tuoyuezi: The Three Ways Illuminate the True and Return to the Root (Chapter One)**\n\nThe Tuoyuezi said: Heaven possesses its essence, Earth possesses its numen. Should a person obtain them, they may attain longevity. In heaven, they form images; on earth, they take shape. Shape and image receive qi, and from qi arise essence and numen. One cannot abandon shape to seize image, nor abandon image to seize shape. To seize shape is to lose image; to lose image is to have no shape.\n\nSomeone asked: What is the essence of heaven? What is the numen of earth? And how can they determine a person’s life and death?\n\nHe replied: The essence of heaven is treasure; the numen of earth is treasure.\n\nAsked: What is treasure?\n\nGold and jade. In ancient times, the Dark Emperor refined gold within the Grotto-Heavens, and the Azure Youth buried jade in the Hidden Palace. Thus we know: without treasure, heaven’s sun and moon would not shine so brightly; without treasure, earth’s mountains and peaks would not remain eternally still; without treasure, a person’s form and spirit would not endure in wholeness.\n\nAsked: From whence does treasure arise, that it is thus?\n\nHe replied: Yin and yang congeal qi. Heaven and earth cover and bear all. Spring warms with benevolence; summer heats with propriety; autumn chills with righteousness; winter freezes with wisdom. Through such transformations, treasure is accomplished. When yin prevails, it becomes gold; when yang abounds, it crystallizes as jade. This is how I know it to be so.\n\nAsked: Can other medicines be used to produce it?\n\nHe replied: All medicines that are wrought do so by revolving yin to activate yang, turning softness into hardness. They are nourished by the qi of the Five Phases and invigorated by the qi of the four seasons. Thus their transformations likewise accord with nature.\n\nAsked: Heaven and earth endure forever—can they be without treasure?\n\nHe said: Indeed.\n\nAsked: Are humans the same as heaven and earth?\n\nHe said: The same.\n\nAsked: Why then do humans not equal heaven and earth in longevity, but perish in an instant?\n\nHe replied: Heaven and earth are without desire, so their treasure remains ever-present, and thus they endure. The human heart harbors desire, and so its treasure is lost—hence the fleeting moment.\n\nAsked: I now recognize the treasure of heaven and earth. But the treasure within humans remains unclear. I wish to hear its principle.\n\nHe replied: The treasure of humans lies in taking bone as gold, marrow as jade, spirit as essence, and numen as consciousness. Once a person is stained by desire, marrow is exhausted and bones wither. When marrow is exhausted, essence loses its spirit; when bones wither, numen loses its consciousness. When numen loses consciousness, spirit scatters; when essence loses its spirit, qi perishes. Thus the heart grows senile, the face wrinkles, the brain shrinks, and the hair turns white—all because the body’s treasure gradually departs. When it is entirely gone, death follows.\n\nAsked: My face is already wrinkled, my hair already white—am I to die?\n\nHe replied: Yes.\n\nAsked: If I rid myself of desire, can my treasure be restored?\n\nHe said: It cannot be restored.\n\nAsked: Earlier you said heaven and earth are without desire and thus endure forever. Since humans are no different from heaven and earth, if I emulate their lack of desire, why can my treasure not be restored?\n\nHe replied: Treasure is difficult to obtain but easy to lose. You have already lost it—it is difficult to recover.\n\nAsked: Are you deceiving me? You claim that with treasure one lives, without it one dies. Yet I see that I have not died, so my treasure must still remain. If treasure remains, then without desire I should endure forever. Why do you now say that without desire my treasure cannot be restored? In matters of life and fate, one should not jest.\n\nHe said: I do not jest with you.\n\nAsked: What other method can restore my treasure?\n\nHe said: You are not a spirit-inspector—you confuse others with such questions.\n\nThereupon, for three days and nights, he neither slept nor rested, pondering without cease until his bones stood stark. Yet the principle of spirit-inspection remained utterly obscure. He reflected on the master’s words and entreated him to impart the hidden secret.\n\nHe replied: Spirit-inspection means inspecting things and inspecting oneself—hence the name.\n\nAsked: I see only inspection of things—where is the inspection of oneself?\n\nHe said: Without self-inspection, how can it be called spirit-inspection? Since you do not understand, I shall explain further.\n\nNow, heaven and earth are without desire, so their treasure remains ever-present. Yet even they are steamed by the four seasons, and their treasure threatens to wither; they are turned by the Five Phases, and their treasure threatens to be exhausted. Thus the Dark Emperor and the Azure Youth buried gold and filled with jade—to replenish the withering and exhaustion of heaven and earth. This is why brightness does not cease and stillness does not move. But you, with desire in your heart, have nearly exhausted your treasure, yet you do not comprehend the principle of replenishment. Instead, you vainly cling to withered bones and depleted marrow—how can you compare to heaven and earth?\n\nHe said: I understand! The dull and the wise are divided; dawn and dusk obscure themselves. Now that I have heard these words, I truly know that a withered face can be rejuvenated and white hair can turn black again.\n\nHe said: It is not that gold cannot rejuvenate the face, nor that jade cannot darken the hair. If you but diligently seek, you shall obtain it.\n\nI revere the master’s teaching. You are teachable, and I shall follow you devotedly. I will surely transmit it to you.\n\n---\n\n**The Five Phases Establish Positions; Springs and Stones (Chapter Two)**\n\nThe Tuoyuezi said: Heaven generates the Five Materials—none can be lacking. How much more so for the Way of the Golden Elixir—how can it be forgotten? Seeing your accumulated diligence and unwavering reverence for secrets, I now wish to expound. Calm your heart and still your form.\n\nThe Five Materials extend upward to heaven, where the Five Luminaries are established; they accumulate downward on earth, where the Five Peaks stand firm; they take form within humans, where the Five Viscera arise. They circulate through the myriad things yet never fail in their true origin.\n\nAsked: What is the true origin?\n\nHe replied: The primordial qi.\n\nAsked: Are the primordial qi and the Five Materials the same?\n\nHe said: The primordial qi—vast, it envelops the eight directions; minute, it hides within a single hair. It exhales Kun and inhales Qian, emerging from existence and entering non-existence. The Five Materials receive its governance and thus become the forerunners of all things.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1249,
      "start_sentence": 0,
      "end_sentence": 66,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.561246156692505,
      "metadata": {
        "source_file": "dao\\正统道藏太清部\\橐钥子.txt",
        "category": "正统道藏太清部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "故五才不离元气，元气不离五才，混其名即一，辨其功即殊，故元气为五才之君，五才为元气之臣。 是故君臣相临，而不可去。 曰：金丹用其元气五才乎？ 曰：用之耳。 元气五才，其有形乎？ 曰：元气本无形，因精而生有，得服者不死不生。 元气去五才而不见，五才失元气而不行。 曰：吾幼探玄业而十数年，所闻先生至言，皆义弃钥子惊耳目，理动神真，愿示金丹中元气五才之形。 曰：吾岂於上业外而得耶？ 名目之似分明耳。 且元气者，水银也； 五才者，五金也。 曰：水银元气，意尽忌言，五金即愚心莫晓。 曰：五金者，黑铅也。 问曰：为铅一色，别更有之？ 答日．〕 ．子未知此，应甚疑惑，诚一听吾论之矣！ 所以水银为元气者，谓水银混沌，混沌不可以形象说，飞之即为朱砂，则少阳也； 反朱砂为水银，即少阴也。 其黑铋者，化之为黄丹，即太阳也； 变黄丹为黑铅，即太阴也。 此之二物，神不能测，圣不能知，一阴一阳，分理四方，千变万化，制伏众石，作道之本，为丹之源。 且铅也外黑，水数一也； 砂色内白，金数四也。 以一配四，五义立焉。 曰：道之将极矣！ 在乎神丹。 今奉解释，悲感交契，为当二物，便用为复，别有枝叶，二物为根，八石为茎。 曰：往闻先生云：金王填补天地，况其人乎！ 愿尽闻之，开发心目。 曰：子既随吾，何虑不得。 夫道不可仓卒而得之，求真不可卒尔而得之，更待他日，为子一论。 八卦系象指明第三 祟钥子曰：八卦之精，击象於月，此道至大，非口谈说，为子写图，令子分别。 初三日夕，月出庚，其象宸，其精木，其味酸，其名青。 初八日夕，月出丁，其象兑，其精金，其味辛，其名白。 十三日夕，月出甲，金，其味辛，其名白。 十六日平明，月见辛，其象巽，其精木，其味酸，其名青。 二十三日平明，月见丙，其象艮，其精土，其味甘，其名雄。 二十九日平明，月没乙，其象坤，其精土，其味甘，其名雌。 柔#1钥子曰：子欲思此，务精心神道，自通天符。 问曰：曾闻先生之言八卦者，八石也，今见其六，不见其二，可尽闻之乎！ 答曰：此之二象，天地尚隐，吾何敢泄天道耶？ 吾实不经师诀，为精感所通耳。 乃诣为言，遂反心入无，七日六夕，乃悟耳。 神会似见五金仙君，为说三化五转之道，不知所以然矣！ 行于陌上，鼓腹而歌，诣吾门曰：小子已明矣！ 吾谓之曰：嘉乎长生之道，子之得矣！ 四序刚柔成岁第四 橐钥子曰：天以四时，成乎万物； 人以四气，养其形骸。 况炉火妙道，而不法之乎？ 问曰：炉火妙道，何也？ 对曰：天之道阳动於子，而升於巳，春夏也，阴萌於午，而降於亥，秋冬也。 四时气顺，而一岁成焉．九日炎盛，五金飞焉。 曰：向闻先生之言，若出演垮而涉沧海者矣！ 九一道备无为第五 橐钥子曰：一阴一阳之谓道。 夫道始一而终九，是故金丹九转，必备五常，皇由阴阳之所生，乃悉天地以奉之。 万象通，精神灵，合启一象不足，即瓦砾何殊！ 故能变化骨肉，轻气真身，获广莫之逍遥，遂大罗之放逸。 於是生死冰浮，尘浊烟收，拜倒景，之玉皇，礼生清之宫阙，或受命於束华，奉册於霄汉，亦明七代之福，积善哉无为，不弘而自成也。",
      "translated_text": "Thus, the Five Materials do not depart from primordial qi, nor does primordial qi depart from the Five Materials. When their names are blended, they are one; when their functions are distinguished, they are distinct. Therefore, primordial qi is the lord of the Five Materials, and the Five Materials are the ministers of primordial qi. Thus, lord and ministers stand in mutual attendance, and neither can be set aside.\n\nAsked: Does the Golden Elixir employ primordial qi and the Five Materials?\nHe replied: It does employ them.\nAsked: Do primordial qi and the Five Materials possess form?\nHe said: Primordial qi is originally formless. Through essence it generates form, and those who ingest it neither die nor live.\n\nPrimordial qi departs from the Five Materials and becomes invisible; the Five Materials lose primordial qi and cease to function.\nAsked: From my youth, I have explored the mysterious arts for over a decade. What I have heard from you, Master, are profound teachings that astonish both ear and eye, stirring the spirit and moving the true. I wish to be shown the forms of primordial qi and the Five Materials within the Golden Elixir.\nHe said: How could I have obtained this apart from the supreme art? The distinctions in names and terms are merely apparent.\n\nNow, primordial qi is quicksilver; the Five Materials are the Five Metals.\nAsked: The meaning of quicksilver as primordial qi is clear, but the Five Metals remain obscure to my dull mind.\nHe said: The Five Metals are black lead.\nAsked: Lead is of a single color—are there others besides it?\nHe replied: Since you do not yet understand this, you must be deeply perplexed. Truly, listen to my discourse!\n\nThe reason quicksilver is called primordial qi is that quicksilver is chaotic and undifferentiated, beyond description by form or image. When it flies upward, it becomes cinnabar—this is Lesser Yang. When cinnabar reverts to quicksilver, this is Lesser Yin. As for black bismuth, when it transforms into yellow lead, this is Greater Yang; when yellow lead changes into black lead, this is Greater Yin. These two substances are beyond the reckoning of gods and the knowledge of sages. One Yin, one Yang, they govern the four directions, undergo a thousand transformations and ten thousand changes, subdue all minerals, serve as the root of the Dao, and are the source of the Elixir.\n\nMoreover, lead is black externally, and its number is one; cinnabar is white internally, and its number is four. When one is paired with four, the principle of five is established.\nAsked: The Dao is nearing its culmination in the Divine Elixir! Now that I have received your explanation, sorrow and gratitude intertwine. Should these two substances be used directly, or are there branches and leaves? Are these two the root, and the eight minerals the stem?\nHe said: I have heard you say before, Master, that gold and jade fill and mend heaven and earth—how much more so for humans! I wish to hear it all, to open my heart and eyes.\nHe replied: Since you follow me, why fear you will not attain it? The Dao cannot be obtained in haste, nor can the true be sought and gained suddenly. Let us wait for another day, when I will discourse for you in full.\n\n**Chapter Three: The Eight Trigrams Illuminate Images and Indications**\nCui Yaizi said: The essence of the Eight Trigrams strikes its image in the moon. This Dao is supremely great and cannot be conveyed by mere speech. I will draw a diagram for you, so you may distinguish them.\n\nOn the evening of the third day, the moon emerges at *geng*; its image is *chen*, its essence is wood, its flavor is sour, and its name is green.\nOn the evening of the eighth day, the moon emerges at *ding*; its image is *dui*, its essence is metal, its flavor is acrid, and its name is white.\nOn the evening of the thirteenth day, the moon emerges at *jia*; its essence is metal, its flavor is acrid, and its name is white.\nAt dawn on the sixteenth day, the moon appears at *xin*; its image is *xun*, its essence is wood, its flavor is sour, and its name is green.\nAt dawn on the twenty-third day, the moon appears at *bing*; its image is *gen*, its essence is earth, its flavor is sweet, and its name is male.\nAt dawn on the twenty-ninth day, the moon sets at *yi*; its image is *kun*, its essence is earth, its flavor is sweet, and its name is female.\n\nCui Yaizi said: If you wish to ponder this, you must concentrate your spirit and mind on the Dao, and you will naturally connect with the celestial tally.\nAsked: I have heard you say, Master, that the Eight Trigrams correspond to the eight minerals. Now I see only six—may I hear the remaining two?\nHe replied: These two images are still hidden by heaven and earth. How dare I reveal the heavenly Dao? In truth, I have not received transmission from a teacher; it is through the communion of refined essence that I have gained understanding. When I sought to speak of it, my heart turned inward to the formless. For seven days and six nights, I came to realize it. It was as if I had met the Immortal Lords of the Five Metals, who expounded the Dao of Three Transformations and Five Revolutions. I knew not how it came to be!\n\nWalking along the path, I drummed my belly and sang, then came to your gate and said: \"Little one, I have understood!\" I said to him: \"Excellent! You have attained the Dao of long life!\"\n\n**Chapter Four: The Four Seasons’ Hard and Soft Complete the Year**\nTuo Yaizi said: Heaven completes the myriad things through the four seasons; humans nourish their forms through the four qi. How much more should the wondrous Dao of the furnace and fire emulate this?\nAsked: What is the wondrous Dao of the furnace and fire?\nHe replied: The Dao of heaven: Yang moves at *zi* and ascends at *si*—this is spring and summer. Yin germinates at *wu* and descends at *hai*—this is autumn and winter. When the qi of the four seasons flow in order, a year is completed. On the ninth day, when the heat is at its peak, the Five Metals take flight.\nAsked: What I have heard from you, Master, is like emerging from a ravine to cross the vast sea!\n\n**Chapter Five: The Ninefold Dao Attains Non-Action**\nTuo Yaizi said: The Dao is called the unity of one Yin and one Yang. The Dao begins with one and ends with nine. Thus, the Golden Elixir undergoes nine revolutions and must embody the Five Constants. The August One arises from Yin and Yang, and thus all under heaven serve it. When the myriad images are penetrated and the spirit is numinous, even if one aspect is lacking, how is it different from mere tiles and stones?\n\nTherefore, it can transform bones and flesh, refine the body into light qi, and attain boundless freedom. It roams the Great Veil in carefree abandon. Thus, life and death melt like ice, the dust and filth vanish like smoke. One bows before the Jade Emperor in the radiant scenery, pays homage in the Palace of Pure Life, may receive a mandate from the Eastern Flower, or hold a decree in the celestial clouds. It also clarifies the blessings of seven generations. Accumulating goodness through non-action, it achieves greatness without striving.",
      "overlap_context": "iscera arise. They circulate through the myriad things yet never fail in their true origin.\n\nAsked: What is the true origin?\n\nHe replied: The primordial qi.\n\nAsked: Are the primordial qi and the Five Materials the same?\n\nHe said: The primordial qi—vast, it envelops the eight directions; minute, it hides within a single hair. It exhales Kun and inhales Qian, emerging from existence and entering non-existence. The Five Materials receive its governance and thus become the forerunners of all things.",
      "start_char": 1249,
      "end_char": 2495,
      "start_sentence": 67,
      "end_sentence": 127,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.89821791648865,
      "metadata": {
        "source_file": "dao\\正统道藏太清部\\橐钥子.txt",
        "category": "正统道藏太清部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "弃钥子竟 #1 『柔』当作『弃』 。",
      "translated_text": "The Master of Abandoning the Key states: \"#1 '柔' should be rendered as '弃'.\"",
      "overlap_context": "efine the body into light qi, and attain boundless freedom. It roams the Great Veil in carefree abandon. Thus, life and death melt like ice, the dust and filth vanish like smoke. One bows before the Jade Emperor in the radiant scenery, pays homage in the Palace of Pure Life, may receive a mandate from the Eastern Flower, or hold a decree in the celestial clouds. It also clarifies the blessings of seven generations. Accumulating goodness through non-action, it achieves greatness without striving.",
      "start_char": 2496,
      "end_char": 2518,
      "start_sentence": 128,
      "end_sentence": 129,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 1.0471606254577637,
      "metadata": {
        "source_file": "dao\\正统道藏太清部\\橐钥子.txt",
        "category": "正统道藏太清部"
      }
    }
  ]
}