{
  "source_id": "正一指教斋清旦行道仪",
  "source_file": "chunked_daozang\\正一指教斋清旦行道仪.json",
  "total_chunks": 3,
  "total_original_chars": 2004,
  "total_translated_chars": 12809,
  "total_translation_time": 67.15584397315979,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\威仪类\\正一指教斋清旦行道仪.txt",
    "category": "威仪类"
  },
  "full_translation": "**Rite of the Zhengyi Zhi Teaching Fast: Morning Dao Procession**\n\n**Scripture Title:** *Rite of the Zhengyi Zhi Teaching Fast: Morning Dao Procession*. Author unknown, approximately composed during the Northern and Southern Dynasties. An early liturgical text of the Heavenly Master Daoist fast. One fascicle. Base text from *Daoist Canon of the Zhengtong Era*, *Dongshen* Section, *Weiyi* Category.\n\n---\n\n**Rite of the Zhengyi Zhi Teaching Fast: Morning Dao Procession**\n\n**First, the Incense Burner is Opened**\nThe Most High Mysterious Origin, the Five Numinous Venerable Lords, are summoned. The Divine Envoys of Merit and Service, the Left and Right Dragon-Tiger Lords, the Incense-Bearing Envoys, and the Three Qi Orthodox Spirits are urgently commanded to ascend and report to the Three Heavens’ Most High Mysterious Origin, the Great Dao Lord: \"Your servants now kindle incense and perform the morning fast. May the Orthodox Qi of the Eight Directions enter our bodies, that our petition swiftly reach the presence of the Perfected and Boundless Dao.\"\n\n**Next, the Incense is Circled, and One Turns East to Bow Twice Again**\nThen, kneeling lengthily, one knocks the teeth twenty-four times to dispatch the officials.\n\n**Respectfully Dispatched from Our Bodies:**\nThe True Officials of the Five Agents within our bodies, the Merit and Service Envoys; the Governing Lords and Scribes within our bodies; the Great Generals of the Banner-Monitoring Merit; the Vanguard of Merit-Validation, the Rear Guard of Execution; the Post Station Commandant, the Post Station Deputy; the Four Division Merit-Inspecting Heralds; and the Divine Immortal Direct Envoys of the Two Offices, the Orthodox Unity Merit and Service Envoys, whom we bear—\nThe Healing Merit and Service Envoys, the Left and Right Official Envoys, the Yin-Yang Divine Judgment Scribes, the Scarlet Talisman Chariot Scribes, the Gale-Riding Post Horse Memorial Scribes—each dispatched in pairs.\nThose dispatched don their solemn attire, caps, and pendent tassels, array their majestic bearing, and stand before, behind, to the left, and right of us, all receiving the words from our mouths to separately report to the monitoring fast lords and scribes of the Grand Clarity’s court, the various lords, generals, and scribes of the Twenty-Four Dioceses established by the Heavenly Master, the lords of the Dao’s Two Mysteries, Three Origins, Four Beginnings, and Jia-Zi, the lords of the Seventy-Two Offices and the Three Officials’ Summons, the Day and Talisman Attendants, the Five Peaks and Four Waterways, the gods of mounds, marshes, and temples, the elders of mountains and forests, the spirits of mountains, rivers, streams, and valleys, the true officials of this region’s prefectures, counties, townships, and villages, the Qi-Recording Inspectors, the summoned landlords, the village and hamlet lords—all at once donning solemn attire, accompanying the Merit and Service Envoys within our bodies and the Flying Dragon Post Scribes to ascend and report to the Most High Great Dao, the Most High Venerable Lord, the Most High Elder, the Perfected of the Four Directions, the Honorable Lords of Virtue and the Dao, the Heavenly Master, the Lineage Masters, the Female Masters, the Three Masters’ Court Scribes, the Grand Clarity’s Numinous Spirits, and the various lords of Orthodox Unity: \"Your servants, though unworthy, partake in the Dharma teachings, charged with expounding and transmitting. Now, at this time of return and report, we humbly proclaim and elevate [the petition] as follows.\"\n\n**Next, the Petition is Read**\nThe words are earnest and reverent. Respectfully presented is the request, in accordance with the ancient statutes of Hanzhong, to establish the fast of the Zhi Teaching, performing the Dao procession thrice daily, day and night, with utmost sincerity. May profound grace be specially bestowed, and may [the deities] deign to descend and illuminate. We beseech the monitoring fast immortals, divine officials, and heavenly troops of the Three Heavens to descend in accordance with the rites, arraying their spirits and deploying their qi to assist and guard the Dao altar, purifying body and mind. May our prayers be felt and answered, bringing blessings and dispelling calamities. May our requests be granted as stated. The Merit and Service Envoys shall separately hear and report, transmitting them in due time. Once the matters are presented, each shall return to our bodies and their palaces, ready to arrive again when summoned, as before.\"\n\nThereupon, prostrating, one knocks the head thrice and swallows thrice, then rises to bow twice again.\n\n**Next, the Four Directions are Saluted**\n\nIf the hour falls at midnight, first open the incense burner here, then proceed to salute the Four Directions.\n\nThe Most High Mysterious Origin Five Numinous Elder Lord shall summon the Merit and Service Envoys, the Left and Right Dragon-Tiger Lords, the Incense-Bearing Envoys, and the Three Qi Correct Spirits, urgently to report to the Three Heavens’ Most High Mysterious Origin Great Dao Lord: “We now burn incense at this dawn purification rite, praying that the Eight Directions’ true qi enter our bodies, and that our petitions swiftly ascend, directly reaching the presence of the Perfected and Boundless Dao.”\n\nNext, the Dharma Master returns to face east, then turns west to kneel in reverence, offering incense in a full circuit before resuming position.\n\nThen, facing west, each declares their office and title, bows twice, and sits upright to read:\n\n“Respectfully we report to the Heavenly Master, the Lineage Masters, the Female Master, and the Three Masters’ Ladies and Attending Officials.\n\nNext, facing north:\nRespectfully we report to the Supreme August Most High Northern Great Dao Lord.\n\nNext, facing east:\nRespectfully we report to the Great Clarity Mysterious Origin Most High Three Heavens Boundless Great Dao Most High Elder Lord, the Most High Venerable One, the Heavenly Thearch, the Heavenly Thearch Venerable One, the Nine Elders of the Immortal Metropolis, the Nine Qi Venerable One, and the myriad layers of Dao qi—one thousand two hundred officials of the Great Clarity Jade Palace.\n\nNext, facing south:\nRespectfully we report to the Southern Great Dao Lord, the Controller of Destinies, the Host of Officials, and the Three Heavens’ Lord of Myriad Blessings: ‘By past-life karmic causes, we have received the true teaching, fortunately encountered this opportunity, and been undeservedly elevated across the dark ford. Ashamed of our impure emptiness, remorseful for our lack of forbearance, we constantly aspire to establish merit to redress faults, prolong blessings, and dispel transgressions. We wish to accumulate superior conditions, rescue the distressed, and relieve suffering and hardship. Today, with sincere devotion, we present this purification rite and declare our prayers.’\n\nReading the Petition:\nAs fully set forth in the written text, may it be fittingly conveyed. Together we undertake this for the sponsor, so-and-so, to establish the Heavenly Master’s Instruction Purification Rite, lasting one day and night, with Dao practices performed at three intervals. May this merit be dedicated to the seven generations of the sponsor’s family—parents, ancestors, the departed, and all spirits—dissolving karmic retribution, reconciling ancestral punishments, delivering souls from eternal night, redeeming sins of endless kalpas, severing hell’s bonds, and establishing heavenly karma. Thus we return body to the Great Dao, return spirit to the Great Dao, return life to the Great Dao.\n\nFirst Incense Offering:\nMay this merit extend upward to the seven generations of past parents and ancestors, freeing them from calamity, suffering, and hardship, wholly releasing them from afflictions and evil roots. May they undergo refinement in Vermilion Mound, transform in the Southern Culmen, forever escape the Three Wretched Paths, no longer cycle through the Five Realms, nor traverse the Six Destinies. May the Eight Gates’ blessings overflow, and future descendants receive flowing fortune. Now, burning incense, we personally take refuge in the Master Lords, ascending into formlessness, harmonizing and uniting with the true Dao.\n\nSecond Incense Offering:\nMay this merit be dedicated to the Emperor, the King, the lords, ministers, officials, and people, safeguarding the imperial foundation, flourishing the state, securing the altars of soil and grain, and prolonging blessings and prosperity. Thus we return body to the Great Dao, return spirit to the Great Dao, return life to the Great Dao. May this merit extend upward to the Emperor, the King, the lords, ministers, officials, and people, freeing them from calamity, suffering, and hardship, wholly releasing them from afflictions and evil roots. May their lives endure as heaven and earth, their years surpass the mountains, the nation be governed and the people at peace, achievements accomplished and the Dao at peace. May superiors be compassionate and inferiors filial, lords courteous and ministers loyal. May the Six Harmonies be tranquil and the Nine Provinces at peace. Now, burning incense, we personally take refuge in the Master Lords, ascending into formlessness, harmonizing and uniting with the true Dao.\n\nThird Incense Offering:\nMay this merit be dedicated to the sponsor’s own self, household, and kin—high and low—rescuing from disaster, delivering from hardship, preserving life, prolonging years, extinguishing misfortune, dispelling calamity, averting harm, and eliminating suffering. May blessings be sought and granted, sins redeemed, and transgressions absolved. May it extend to all officials of shared qi, those governed, and the people of the world, universally sharing in fortune and blessings, broadly receiving vast grace. Thus we return body to the Great Dao, return spirit to the Great Dao, return life to the Great Dao. May this merit return to ourselves, our households, kin—high and low, young and old—shared qi officials, those governed, and the people of the world, freeing them from calamity, suffering, and hardship, wholly releasing them from afflictions, evil roots, the Five Punishments, and Six Harms. May all be dissolved, a thousand calamities and ten thousand sufferings turned and subdued. May the Four Passes and Nine Orifices exhale the old and inhale the new. May the Three Ones and Five Spirits guard the palaces and bureaus, the heart open and the mind bright, ears and eyes keen. May all aspirations and desires attain fruition, all undertakings and endeavors succeed. May seeking the Dao summon the Perfected, seeking wealth obtain treasure. May the Southern Prosperity Register record names under the Controller of Destinies, ensuring long life and enduring vision. May virtue align with heaven and earth. May livestock and creatures—winged, crawling, born, and unborn—all receive fulfillment. Now, burning incense, we personally take refuge in the Master Lords, ascending into formlessness, harmonizing and uniting with the true Dao.”\n\nBow twice again.\n\nNext, recite three hymns:\n\nStriving intent binds the five viscera,\nRestraining passions to uphold the purification rite.\nAncestors receive its blessings,\nDescendants gain its fortune.\nThe body stands firm as adamantine,\nLifespan knows no end.\nThe heart shines like lapis lazuli,\nRadiance illuminating beyond the self.\nThis is called the Supreme Dao,\nForemost among all paths.\nAll arise from the purification rite,\nAttained through offering incense.\nThis is the seat of the Great Dao—\nLet the wise each strive.\n\nOffering incense ascends to emptiness,\nSincerity moving all things.\nSingle-minded, without dual intent,\nWishes follow the smoke’s ascent.\nIncense smoke rises to Great Clarity,\nWishes follow the smoke’s path.\nSmoke reaches the Great Dao’s presence—\nThe Most High deems it swift.\nCircling thrice each,\nMerit surpasses kin.\nThe Three Officials dissolve transgressions,\nThe Left Spirit inscribes life’s record.\nThe Immortal Metropolis fixes the jade register,\nNames inscribed on the left contract.\nThe Heavenly Elder carves the jade record,\nHidden virtue stored in the golden coffer.\n\nPurification restrains passions,\nBurning incense toward emptiness.\nCircling, presenting utmost sincerity,\nSeeking knowledge from the Dao.\nMay sins of a hundred million kalpas be absolved,\nPardoning the bodies of past generations.\nAncestors’ transgressions all dissolved,\nFortune and virtue shall return.\nWithin, receive auspicious blessings,\nFuture generations all shall know.\nAll attained through burning incense—\nKnow this by the Heavenly Master.\nOverwhelmed with joy,\nWe bow to the Heavenly Master Lord.\n\nUpon the completion of the Zhengyi Finger-Pointing Teachings’ dawn purification and Dao-procession rites.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "正一指教斋清旦行道仪 经名：正一指教斋清旦行道仪。 撰人不详，约出於南北朝。 系早期天师道斋仪。 一卷。 底本出处：《正统道藏》洞神部威仪类。 正一指教斋清旦行道仪 先发炉 太上玄元五灵老君当召功曹使者，左右龙虎君，捧香使者，三炁正神急上关启三天太上玄元大道君，臣等正尔烧香清旦斋事，愿得八方正炁来入臣等身中，所启速达，径御至真无极道前。 次上香周回，还东向再拜。 次长跪叩齿二十四通出官。 谨出臣等身中五体真官功曹吏，出臣等身中治职君吏，建节监功大将军，前部效功，后部效杀，驿亭令，驿亭丞，四部监功谒者，及臣等所佩仙灵二官直使正一功曹。 治病功曹，左右官使者，阴阳神决吏，科车赤符吏，刚风骑置驿马上章吏官，各二人出。 出者严装显服，冠带垂缨。 整其威仪，住立臣等前后左右，咸受臣口中辞语，分别关启泰清官属监斋君吏，天师所布下二十四治诸官君将吏，道上二玄三元四始甲子诸官君，七十二官三官考召，直日直符，五岳四渎，丘沼庙神，山林孟长，山川溪谷，及此间州县乡里，里域真官，注炁监察，考召土地之主，社里邑君，一时严装，与臣等身中功曹使者及飞龙驿吏，上启太上大道太上老君，太上丈人，四方众真，道德尊君，天师嗣师系师女师三师君门下典者君吏，泰清灵神，正一诸官君，臣等谬参法教，职在披述，爰值归告，辄为宣腾，谨有云云。 次读辞 辞言恳倒，谨具陈请，为依汉中旧典，建指教斋直，一日一夜，三时行道，日夜只诚，特赐玄泽，俯垂临照，请三天监斋仙官天兵骑乘，各依仪法，一合来下，行神布炁，辅卫道场，澄洁身心，祈愿感达，降福消祸，乞如所陈，功曹使者分别闻奏，以时上达，列启事竟，各还臣等身中，复於宫室，须召又到，一如故事。 因伏地，三叩三咽，起再拜。 次便四方朝",
      "translated_text": "**Rite of the Zhengyi Zhi Teaching Fast: Morning Dao Procession**\n\n**Scripture Title:** *Rite of the Zhengyi Zhi Teaching Fast: Morning Dao Procession*. Author unknown, approximately composed during the Northern and Southern Dynasties. An early liturgical text of the Heavenly Master Daoist fast. One fascicle. Base text from *Daoist Canon of the Zhengtong Era*, *Dongshen* Section, *Weiyi* Category.\n\n---\n\n**Rite of the Zhengyi Zhi Teaching Fast: Morning Dao Procession**\n\n**First, the Incense Burner is Opened**\nThe Most High Mysterious Origin, the Five Numinous Venerable Lords, are summoned. The Divine Envoys of Merit and Service, the Left and Right Dragon-Tiger Lords, the Incense-Bearing Envoys, and the Three Qi Orthodox Spirits are urgently commanded to ascend and report to the Three Heavens’ Most High Mysterious Origin, the Great Dao Lord: \"Your servants now kindle incense and perform the morning fast. May the Orthodox Qi of the Eight Directions enter our bodies, that our petition swiftly reach the presence of the Perfected and Boundless Dao.\"\n\n**Next, the Incense is Circled, and One Turns East to Bow Twice Again**\nThen, kneeling lengthily, one knocks the teeth twenty-four times to dispatch the officials.\n\n**Respectfully Dispatched from Our Bodies:**\nThe True Officials of the Five Agents within our bodies, the Merit and Service Envoys; the Governing Lords and Scribes within our bodies; the Great Generals of the Banner-Monitoring Merit; the Vanguard of Merit-Validation, the Rear Guard of Execution; the Post Station Commandant, the Post Station Deputy; the Four Division Merit-Inspecting Heralds; and the Divine Immortal Direct Envoys of the Two Offices, the Orthodox Unity Merit and Service Envoys, whom we bear—\nThe Healing Merit and Service Envoys, the Left and Right Official Envoys, the Yin-Yang Divine Judgment Scribes, the Scarlet Talisman Chariot Scribes, the Gale-Riding Post Horse Memorial Scribes—each dispatched in pairs.\nThose dispatched don their solemn attire, caps, and pendent tassels, array their majestic bearing, and stand before, behind, to the left, and right of us, all receiving the words from our mouths to separately report to the monitoring fast lords and scribes of the Grand Clarity’s court, the various lords, generals, and scribes of the Twenty-Four Dioceses established by the Heavenly Master, the lords of the Dao’s Two Mysteries, Three Origins, Four Beginnings, and Jia-Zi, the lords of the Seventy-Two Offices and the Three Officials’ Summons, the Day and Talisman Attendants, the Five Peaks and Four Waterways, the gods of mounds, marshes, and temples, the elders of mountains and forests, the spirits of mountains, rivers, streams, and valleys, the true officials of this region’s prefectures, counties, townships, and villages, the Qi-Recording Inspectors, the summoned landlords, the village and hamlet lords—all at once donning solemn attire, accompanying the Merit and Service Envoys within our bodies and the Flying Dragon Post Scribes to ascend and report to the Most High Great Dao, the Most High Venerable Lord, the Most High Elder, the Perfected of the Four Directions, the Honorable Lords of Virtue and the Dao, the Heavenly Master, the Lineage Masters, the Female Masters, the Three Masters’ Court Scribes, the Grand Clarity’s Numinous Spirits, and the various lords of Orthodox Unity: \"Your servants, though unworthy, partake in the Dharma teachings, charged with expounding and transmitting. Now, at this time of return and report, we humbly proclaim and elevate [the petition] as follows.\"\n\n**Next, the Petition is Read**\nThe words are earnest and reverent. Respectfully presented is the request, in accordance with the ancient statutes of Hanzhong, to establish the fast of the Zhi Teaching, performing the Dao procession thrice daily, day and night, with utmost sincerity. May profound grace be specially bestowed, and may [the deities] deign to descend and illuminate. We beseech the monitoring fast immortals, divine officials, and heavenly troops of the Three Heavens to descend in accordance with the rites, arraying their spirits and deploying their qi to assist and guard the Dao altar, purifying body and mind. May our prayers be felt and answered, bringing blessings and dispelling calamities. May our requests be granted as stated. The Merit and Service Envoys shall separately hear and report, transmitting them in due time. Once the matters are presented, each shall return to our bodies and their palaces, ready to arrive again when summoned, as before.\"\n\nThereupon, prostrating, one knocks the head thrice and swallows thrice, then rises to bow twice again.\n\n**Next, the Four Directions are Saluted**",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 732,
      "start_sentence": 0,
      "end_sentence": 18,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.13088321685791,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\正一指教斋清旦行道仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "若中亥，即於此先发炉，然后行四方朝。 太上玄元五灵老君当召功曹使者，左右龙虎君，捧香使者，三炁正神，急上关启三天太上玄元大道君，臣等正尔烧香，清旦斋事，愿得八方正炁来入臣等身中，所启速达，径御至真无极道前。 次法师还东面，西向长跪，上香周竟还。 次西向，各称治职，再拜，平坐，读： 谨关启天师嗣师系师女师三师君夫人门下典者君吏。 次北向 谨关启上皇太上北上大道君。 次东向 谨关启太清玄元上三天无极大道太上老君，太上丈人，天帝君天帝丈人，九老仙都君，九炁丈人等，百千万重道炁千二百官君太清玉陛下。 次南向 谨关启南上大道君司命众官三天万福君，臣等宿世因果，禀承正教，运逢侥幸，叨擢冥津，业愧清虚，行惭忍辱，恒愿立功补过，延福拔咎消遣，累欲增长胜缘，拯接忧危，祈济苦难，今谨有斋忱用伸宣读。 读辞 具如翰墨所陈，宜可腾奏，辄相携率，为施主某乙建立天师指教斋，直一日一夜，三时行道，愿以是功德为斋主家七世父母先过后亡，一切神爽，消释殃对，和解基罚，拔长夜魂，赎永劫罪，断地狱绿，结天堂业故，归身大道，归神大道，归命大道。 第一上香愿，以是功德上延七世父母过去神识，当令免离灾厄苦难，咸得解脱烦恼恶根，受炼朱陵，轮化南极，永出三涂长远，五道不更，六趣不涉，八门泽被，后徒福流见，在今故烧香自归依师君，升入无形，和与道合真。 第二上香愿，以是功德奉为帝主国王君臣吏民保镇皇基兴隆，计稷安邦，利壤延福享祚，故归身大道，归神大道，归命大道，持是功德，上延帝主国王君臣吏民，当令兔离灾厄苦难，咸得解脱烦恼恶根，使寿永乾坤，年逾桩岳，国治民安，功成道泰，上慈下孝，君礼臣忠，六合宁静，九有清平，今故烧香自归依师君，升入无形，和与道合真。 第三上香愿，以是功德为供主自身及家门眷属尊卑，善庆救灾度厄，保命延年，灭祸消凶，除殃却患，祈恩请福，拔罪解愆，并及同炁左右众官治所领民，天下吏民等，普同福庆，褊受洪润，故归身大道，归神大道，归命大道，持是功德归某等身及家门眷属尊卑大小同炁左右众官治所领民，天下吏民，当令免离灾厄苦难，咸得解脱烦恼恶根五刑六害，一切消弭，千殃万患并皆回伏，四关九窍，吐故纳新，三一五神镇卫宫府，心开意朗，耳 目聪明，所向所欲必获从果，所营所作万事谐克，求道降真，求财得宝，南昌领籍司命记名，长存久视，德合天地，畜牧之属，螳飞蠢动，已生未生，咸蒙成就，今故烧香自归依师君，升入无形，和与道合真。 再拜 次诵咏三首 争意结五内，摄情修斋直，先人获其庆，子孙得其福，身固殊金刚，寿命无终极，心如瑠璃珠，光明照身外，是谓无上道，众道中之最，皆从斋直生，捻香之所得，是为大道座，贤者各努力。 捻香上虚无，精诚感一切，一心无二意，愿念随烟寻，香烟升太清，愿念寻烟至，烟御大道前，太上称为快，旋行各三周，功德因族迈，三官除罪契，左神着生录，仙都定玉历，记名着左契，天老刻玉箓，冥德於金匮。 斋戒摄情念，烧香向空无，旋行奏至诚，从道求所知，愿除亿会罪，赦贯代兆躯，基考一切解，福德当归流，明内受吉庆，后世悉皆知，是皆烧香得，知此由天师，不胜情喜跃，礼拜天师君。",
      "translated_text": "If the hour falls at midnight, first open the incense burner here, then proceed to salute the Four Directions.\n\nThe Most High Mysterious Origin Five Numinous Elder Lord shall summon the Merit and Service Envoys, the Left and Right Dragon-Tiger Lords, the Incense-Bearing Envoys, and the Three Qi Correct Spirits, urgently to report to the Three Heavens’ Most High Mysterious Origin Great Dao Lord: “We now burn incense at this dawn purification rite, praying that the Eight Directions’ true qi enter our bodies, and that our petitions swiftly ascend, directly reaching the presence of the Perfected and Boundless Dao.”\n\nNext, the Dharma Master returns to face east, then turns west to kneel in reverence, offering incense in a full circuit before resuming position.\n\nThen, facing west, each declares their office and title, bows twice, and sits upright to read:\n\n“Respectfully we report to the Heavenly Master, the Lineage Masters, the Female Master, and the Three Masters’ Ladies and Attending Officials.\n\nNext, facing north:\nRespectfully we report to the Supreme August Most High Northern Great Dao Lord.\n\nNext, facing east:\nRespectfully we report to the Great Clarity Mysterious Origin Most High Three Heavens Boundless Great Dao Most High Elder Lord, the Most High Venerable One, the Heavenly Thearch, the Heavenly Thearch Venerable One, the Nine Elders of the Immortal Metropolis, the Nine Qi Venerable One, and the myriad layers of Dao qi—one thousand two hundred officials of the Great Clarity Jade Palace.\n\nNext, facing south:\nRespectfully we report to the Southern Great Dao Lord, the Controller of Destinies, the Host of Officials, and the Three Heavens’ Lord of Myriad Blessings: ‘By past-life karmic causes, we have received the true teaching, fortunately encountered this opportunity, and been undeservedly elevated across the dark ford. Ashamed of our impure emptiness, remorseful for our lack of forbearance, we constantly aspire to establish merit to redress faults, prolong blessings, and dispel transgressions. We wish to accumulate superior conditions, rescue the distressed, and relieve suffering and hardship. Today, with sincere devotion, we present this purification rite and declare our prayers.’\n\nReading the Petition:\nAs fully set forth in the written text, may it be fittingly conveyed. Together we undertake this for the sponsor, so-and-so, to establish the Heavenly Master’s Instruction Purification Rite, lasting one day and night, with Dao practices performed at three intervals. May this merit be dedicated to the seven generations of the sponsor’s family—parents, ancestors, the departed, and all spirits—dissolving karmic retribution, reconciling ancestral punishments, delivering souls from eternal night, redeeming sins of endless kalpas, severing hell’s bonds, and establishing heavenly karma. Thus we return body to the Great Dao, return spirit to the Great Dao, return life to the Great Dao.\n\nFirst Incense Offering:\nMay this merit extend upward to the seven generations of past parents and ancestors, freeing them from calamity, suffering, and hardship, wholly releasing them from afflictions and evil roots. May they undergo refinement in Vermilion Mound, transform in the Southern Culmen, forever escape the Three Wretched Paths, no longer cycle through the Five Realms, nor traverse the Six Destinies. May the Eight Gates’ blessings overflow, and future descendants receive flowing fortune. Now, burning incense, we personally take refuge in the Master Lords, ascending into formlessness, harmonizing and uniting with the true Dao.\n\nSecond Incense Offering:\nMay this merit be dedicated to the Emperor, the King, the lords, ministers, officials, and people, safeguarding the imperial foundation, flourishing the state, securing the altars of soil and grain, and prolonging blessings and prosperity. Thus we return body to the Great Dao, return spirit to the Great Dao, return life to the Great Dao. May this merit extend upward to the Emperor, the King, the lords, ministers, officials, and people, freeing them from calamity, suffering, and hardship, wholly releasing them from afflictions and evil roots. May their lives endure as heaven and earth, their years surpass the mountains, the nation be governed and the people at peace, achievements accomplished and the Dao at peace. May superiors be compassionate and inferiors filial, lords courteous and ministers loyal. May the Six Harmonies be tranquil and the Nine Provinces at peace. Now, burning incense, we personally take refuge in the Master Lords, ascending into formlessness, harmonizing and uniting with the true Dao.\n\nThird Incense Offering:\nMay this merit be dedicated to the sponsor’s own self, household, and kin—high and low—rescuing from disaster, delivering from hardship, preserving life, prolonging years, extinguishing misfortune, dispelling calamity, averting harm, and eliminating suffering. May blessings be sought and granted, sins redeemed, and transgressions absolved. May it extend to all officials of shared qi, those governed, and the people of the world, universally sharing in fortune and blessings, broadly receiving vast grace. Thus we return body to the Great Dao, return spirit to the Great Dao, return life to the Great Dao. May this merit return to ourselves, our households, kin—high and low, young and old—shared qi officials, those governed, and the people of the world, freeing them from calamity, suffering, and hardship, wholly releasing them from afflictions, evil roots, the Five Punishments, and Six Harms. May all be dissolved, a thousand calamities and ten thousand sufferings turned and subdued. May the Four Passes and Nine Orifices exhale the old and inhale the new. May the Three Ones and Five Spirits guard the palaces and bureaus, the heart open and the mind bright, ears and eyes keen. May all aspirations and desires attain fruition, all undertakings and endeavors succeed. May seeking the Dao summon the Perfected, seeking wealth obtain treasure. May the Southern Prosperity Register record names under the Controller of Destinies, ensuring long life and enduring vision. May virtue align with heaven and earth. May livestock and creatures—winged, crawling, born, and unborn—all receive fulfillment. Now, burning incense, we personally take refuge in the Master Lords, ascending into formlessness, harmonizing and uniting with the true Dao.”\n\nBow twice again.\n\nNext, recite three hymns:\n\nStriving intent binds the five viscera,\nRestraining passions to uphold the purification rite.\nAncestors receive its blessings,\nDescendants gain its fortune.\nThe body stands firm as adamantine,\nLifespan knows no end.\nThe heart shines like lapis lazuli,\nRadiance illuminating beyond the self.\nThis is called the Supreme Dao,\nForemost among all paths.\nAll arise from the purification rite,\nAttained through offering incense.\nThis is the seat of the Great Dao—\nLet the wise each strive.\n\nOffering incense ascends to emptiness,\nSincerity moving all things.\nSingle-minded, without dual intent,\nWishes follow the smoke’s ascent.\nIncense smoke rises to Great Clarity,\nWishes follow the smoke’s path.\nSmoke reaches the Great Dao’s presence—\nThe Most High deems it swift.\nCircling thrice each,\nMerit surpasses kin.\nThe Three Officials dissolve transgressions,\nThe Left Spirit inscribes life’s record.\nThe Immortal Metropolis fixes the jade register,\nNames inscribed on the left contract.\nThe Heavenly Elder carves the jade record,\nHidden virtue stored in the golden coffer.\n\nPurification restrains passions,\nBurning incense toward emptiness.\nCircling, presenting utmost sincerity,\nSeeking knowledge from the Dao.\nMay sins of a hundred million kalpas be absolved,\nPardoning the bodies of past generations.\nAncestors’ transgressions all dissolved,\nFortune and virtue shall return.\nWithin, receive auspicious blessings,\nFuture generations all shall know.\nAll attained through burning incense—\nKnow this by the Heavenly Master.\nOverwhelmed with joy,\nWe bow to the Heavenly Master Lord.",
      "overlap_context": "ind. May our prayers be felt and answered, bringing blessings and dispelling calamities. May our requests be granted as stated. The Merit and Service Envoys shall separately hear and report, transmitting them in due time. Once the matters are presented, each shall return to our bodies and their palaces, ready to arrive again when summoned, as before.\"\n\nThereupon, prostrating, one knocks the head thrice and swallows thrice, then rises to bow twice again.\n\n**Next, the Four Directions are Saluted**",
      "start_char": 732,
      "end_char": 2044,
      "start_sentence": 19,
      "end_sentence": 40,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.86667037010193,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\正一指教斋清旦行道仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "正一指教斋清旦行道仪竟",
      "translated_text": "Upon the completion of the Zhengyi Finger-Pointing Teachings’ dawn purification and Dao-procession rites.",
      "overlap_context": "cation restrains passions,\nBurning incense toward emptiness.\nCircling, presenting utmost sincerity,\nSeeking knowledge from the Dao.\nMay sins of a hundred million kalpas be absolved,\nPardoning the bodies of past generations.\nAncestors’ transgressions all dissolved,\nFortune and virtue shall return.\nWithin, receive auspicious blessings,\nFuture generations all shall know.\nAll attained through burning incense—\nKnow this by the Heavenly Master.\nOverwhelmed with joy,\nWe bow to the Heavenly Master Lord.",
      "start_char": 2045,
      "end_char": 2059,
      "start_sentence": 41,
      "end_sentence": 41,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 1.1582903861999512,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\正一指教斋清旦行道仪.txt",
        "category": "威仪类"
      }
    }
  ]
}