{
  "source_id": "正一醮宅仪",
  "source_file": "chunked_daozang\\正一醮宅仪.json",
  "total_chunks": 2,
  "total_original_chars": 2107,
  "total_translated_chars": 13462,
  "total_translation_time": 63.11815333366394,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\威仪类\\正一醮宅仪.txt",
    "category": "威仪类"
  },
  "full_translation": "**Zhengyi Ritual for Offerings to the Household Spirits**\n\n*Scripture Title:* *Zhengyi Ritual for Offerings to the Household Spirits*. Author unknown, likely composed during the Northern and Southern Dynasties or the Sui-Tang period. One fascicle. Base text from the *Daoist Canon of the Zhengtong Era*, *Dongshen* section, *Weiyi* (Ritual Propriety) category.\n\n**Zhengyi Ritual for Offerings to the Household Spirits**\n\nWhen a household suffers from depletion and loss, when cattle and horses perish or go missing, when fields and silkworms fail to yield, when family members fall ill, or when the Five Pestilences and seasonal epidemics strike yearly, or when dogs, rats, insects, or ants cause disturbances—if this is due to offenses against the earthly deities of the five directions and twelve temporal spirits, leading to the dispersal of wealth and fortune, such that one’s aspirations remain unfulfilled—then it is auspicious to perform the offering ritual on a day when the Four Seasons are in their waxing phase.\n\n**Ritual Implements:**\n- Six clean mats,\n- Twelve reed arrows,\n- Twenty-four *zhang* of hempen cords: six *zhang* each of blue, red, white, and black.\n- Nine lamps, with nine bamboo lampstands, each two *chi* and five *cun* in length (lamps not used during daylight).\n- One large table, five small tables (or five incense burners if tables are unavailable),\n- One *liang* of incense.\n- Five bolts of colored silk: eight *chi* of blue, seven *chi* of red, nine *chi* of white, six *chi* of black, and five *chi* of yellow.\n- Three hundred and fifty *wen* of coins,\n- A five-*chi* hand towel,\n- Thirty-five lacquered trays.\n- Seventy dried jujubes,\n- One *sheng* of chestnuts,\n- Seventy walnuts,\n- Three *dou* of glutinous millet rice,\n- Three *dou* of mixed grains,\n- Seventy twisted pastries,\n- Thirty-five thin pancakes,\n- One *dou* of wheat rice,\n- One *dou* of fermented soybeans,\n- One *dou* of millet rice,\n- One *dou* of polished rice,\n- Five *dou* of rice.\n- Four mirrors, with four bamboo stands, each three *chi* in length.\n- One large platter,\n- Thirty-two sheets of paper,\n- One *jin* each of five-colored mineral pigments.\n\nThe above items may be adjusted according to abundance or scarcity. Food offerings are arranged on the trays.\n\n**Ritual Method:**\nIn the courtyard of the house, mark out a square altar two *zhang* and four *chi* on each side. Open the Heavenly Gate, Earthly Door, Human Gate, and Ghost Gate at the four cardinal directions, each marked with arrows. Enclose the altar with three layers of cords corresponding to the colors of the directions. Place two lamps at each gate, one lamp before the officiant’s table, and arrange seats for the deities of the five directions at the center of the altar. Place colored silk and coins on the blue seat (east). The following seats are arranged:\n- North: Stove Lord’s seat (black),\n- South: Southern Deity’s seat (red),\n- East: Eastern Deity’s seat (blue),\n- West: Western Earth Deity’s seat (white),\n- South: Merit Officer and Registrar’s seat (red),\n- North: Direct Attendant’s seat (black),\n- West: Elder of Auspicious Stability’s seat (white),\n- East: Attending Official’s seat (blue).\n\nEach of the twelve earthly branches in the four corners has its own seat with a fine mat. The five directional deity seats and the Direct Attendant’s seat each have a food tray, while the remaining seats have one tray each. Arrange five incense burners, five-colored silk, and coins according to the generative numbers of the Five Phases:\n- East: eight items of blue,\n- South: seven items of red,\n- West: nine items of white,\n- North: six items of black,\n- Center: five items of yellow.\n\nFor nobles of marquis rank and above, use five-colored precious jades; for ministers and officials, use stones (measured in *jin* or *liang*). For nobles, silk is measured in bolts; for high officials, in *zhang*; for scholars and commoners, in *chi*. Coins: nobles use a thousand, high officials a hundred, scholars and commoners ten. Alternatively, place five metal dragons in the five directions: wheat in the east, millet in the south, rice in the west, beans in the north, and millet in the center.\n\nFive *chi* south of the altar, set one mat and one table for the officiant, with a towel covering the table. Enter and exit through the Earthly Door in the southeast.\n\nFirst present the ritual silk, then the food offerings. Burn incense, bow twice, and sit briefly.\n\n**Invocation (the ordained ritual master sits without bowing):**\n\"On this day, month, and year, in the such-and-such prefecture, county, village, and hamlet, [Name and Title] respectfully selects this auspicious day, observes purification and reverence, cleanses the inner and outer spaces, purifies the altar, and prepares the offerings. With fragrant incense, ritual silk, and fresh offerings now complete,\n\nWe reverently invite the Eastern Household Deity, the Blue Earth General, and all attendants of the east—*jia-yi* and *yin-mao*—clad in blue, to descend upon this eastern seat.\n\nWe reverently invite the Southern Household Deity, the Red Earth General, and all attendants of the south—*bing-ding* and *si-wu*—clad in red, to descend upon this southern seat.\n\nWe reverently invite the Western Household Deity, the White Earth General, and all attendants of the west—*geng-xin* and *shen-you*—clad in white, to descend upon this western seat.\n\nWe reverently invite the Northern Household Deity, the Black Earth General, and all attendants of the north—*ren-gui* and *hai-zi*—clad in black, to descend upon this northern seat.\n\nWe reverently invite the Central Household Deity, the Yellow Earth General, and all attendants of the center—*wu-ji*, *chen-xu*, *chou-wei*—clad in yellow, to descend upon this central seat.\n\nWe reverently invite the deities of *Qian* and *Kun*, *Zhen* and *Xun*, *Kan* and *Li*, *Gen* and *Dui*; the Four Cardinal, Four Intermediate, and Four Seasonal Months; the spirits of the year, month, day, and hour; the Punitive and Virtuous Stars; the Conjoined and Opposed Forces; the Grand Year, Grand Yin, and Great Generals; the Gate Guardians and Door Wardens; the Well and Stove Spirits; the Hidden Dragons; the Courtyard and Hall Officers; the Seven Household Deities; and all yin-yang officials and attendants—to take their places, receive our sincere devotion, and partake in joy and celebration. Your disciple bows twice and respectfully petitions.\"\n\nNext, present the incense, tea, and wine.\n\n\"Respectfully addressing the Five Directional Household Deities, the Five Earth Generals, and all officials within the household: Your disciple, [Name], has long dwelled in this residence, sheltered by the blessings of Heaven and Earth, existing as an ordinary mortal. We rely on water and fire for sustenance and depend on grains for life. Since residing here, time has passed, and years have accumulated. We have enjoyed peace and prosperity, ever grateful for your protection. Yet in recent years, misfortune and depletion have struck. Young and old among us have fallen ill, men and women have suffered inexplicable afflictions, and the Five Pestilences and Six Deathly Spirits have gathered within this house, refusing to depart.\n\nToday, in accordance with the sacred methods of the ancient sages, on this auspicious and propitious day, with a pure heart and mind, we have swept the courtyard, burned incense, and prepared the ritual space. We humbly invite the divine spirits, confess our transgressions, and seek your forgiveness. We pray for your blessings and protection. We now present these cakes and fruits, all fragrant and pure, as offerings to the Five Directional Household Deities, the Five Earth Generals, and all officials within this household. May you all deign to descend and partake in these offerings. Your disciple bows twice and respectfully petitions.\"\n\nNext, we offer incense and present wine. We humbly address all the divine spirits:\n\nThis disciple’s household may have, from its very foundation—when first the pillars were raised and beams set in place—through renovations and alterations over time, or through relocation and reorientation, offended the royal deities. Or perhaps through marriages, burials, or other rites, we have acted against the household’s proper alignment or convenience. Within these walls, there may have been killings that defiled the dwelling’s form, or curses and imprecations that incurred transgressions. All these have led to offenses against the prohibitions of the four directions, eight quarters, heaven and earth, yin and yang, and the myriad officials; against the qi of the Five Earths and the spirits of punishment and depletion. They may have violated the lives of men and women, young and old, or the lives of cattle, horses, and the six livestock. Wherever we have dwelt, we have borne worry and fear.\n\nToday, we present these modest offerings to confess our transgressions and present these various items to pacify all the spirits. We pray that you bestow upon us your finest blessings and grant us your boundless grace. May all offenses be absolved and dispersed, our household’s people enjoy health, and pestilential toxins be kept at bay. May we receive harmony from heaven above and favor from the earth below. May the Azure Dragon guard the left, the White Tiger reside on the right, the Vermilion Bird shield the front, and the Dark Warrior defend the rear. May the Five Phases find their proper places, the Four Kings secure their directions, and the dragon spirits stand guard. May malevolent qi vanish, thieves and bandits be repelled, and disasters and calamities be averted. After this rite of absolution, may ten thousand blessings descend in auspicious abundance.\n\nThis disciple bows twice and respectfully petitions.\n\nWe offer incense and present wine once more. We earnestly address the divine lords:\n\nToday, this disciple offers these rites with a sincere heart. We pray that the divine officials universally bestow their grace and protection. We humbly request the Five Directional Attendants to drive away from this household the Five Depletions, Six Exhaustions, flying corpses, malevolent spirits, seasonal pestilential qi, internal and external afflictions, wandering ghosts of travelers, and all forms of hostile or fatal influences—banishing them a thousand li away. If the earth’s royal harms or black-haired spirits within this dwelling have stirred, may they be subdued and extinguished.\n\nWe invite the Azure Dragon to descend and guard the east of this dwelling, dispelling all green-colored disasters of the east.\nWe open the Wood Gate to summon the five grains, gold, silver, and treasures to enter.\n\nWe invite the Crimson Dragon to descend and guard the south of this dwelling, dispelling all red-colored disasters of the south.\nWe open the Fire Gate to summon silks, brocades, and treasures to enter.\n\nWe invite the White Dragon to descend and guard the west of this dwelling, dispelling all white-colored disasters of the west.\nWe open the Metal Gate to summon gold, jade, rare treasures, and wealth to enter.\n\nWe invite the Black Dragon to descend and guard the north of this dwelling, dispelling all black-colored disasters of the north.\nWe open the Water Gate to summon fish, salt, cattle, horses, and treasures to enter.\n\nWe invite the Yellow Dragon to descend and guard the center of this dwelling, dispelling all yellow-colored disasters of the central palace.\nWe open the Earth Gate to summon money, fabrics, and treasures from the four quarters to enter.\n\nMay the Five-Colored Divine Dragons suppress the Five Directions. After this rite of offering and absolution, may the household deities be pacified, the Gate Marshal and Door Warden safeguard the household’s entrance, and all malevolent spirits be restrained, prevented from approaching. May misfortunes be dispersed, blessings and prosperity be summoned, and this disciple’s dwelling be secured for a hundred years. May men and women be wise and virtuous, the old and young fundamentally auspicious. May slanderous and malicious speech sink into the Nine Yin. May all members of this household, high and low, constantly partake in the Five Fortunes. May we be safeguarded by heaven’s emoluments and enjoy long life. May the six livestock flourish, the five grains ripen abundantly, wealth and resources converge, granaries and storehouses overflow. May official ranks ascend, silkworms and mulberries thrive, descendants prosper, and the household flourish. May the entire family receive your protective grace, and for generations to come, bear the virtue of the divine spirits. May our wishes be fulfilled and your vast grace be bestowed upon us.\n\nThis disciple bows twice and respectfully petitions.\n\nNext, we scatter food offerings outside the altar to the four directions.\n\nWe earnestly address and express gratitude thrice, and the feast is abundant. O luminous deities, may you each return to your original abodes. May the household deities each settle in their proper places. We pray that you leave your grace and bestow blessings, just as we have petitioned.\n\nWe bow twice.\n\nThe rites concluded, we gather the offerings from the Five Directions and bury them at the five quarters of the dwelling. The food from the gate and door positions is buried beside the main gate’s pivot. The remaining dishes are scattered as food offerings.\n\nThe Orthodox Unity Rite for the Household Pacification is now complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "正一醮宅仪 经名：正一醮宅仪。 撰人不详，似出於南北朝或隋唐。 一卷。 底本出处：《正统道藏》洞神部威仪类。 正一醮宅仪 凡人居宅虚耗，牛马死失，田蚕不熟，人口婴害，或每年有五瘟时气，及狗鼠虫蚁作怪，或犯五方十二时土财，利散亡举，向不称者，以四时王相日醮之吉。 净席六，领箭十二只，麻綖二十四丈，青赤白黑各六丈。 灯九盏，并竹灯柱九枚，枚长二尺五寸，白日不用灯。 大案一面，小案五枚，无者可香炉五枚，香一两。 色彩五段，青八尺，赤七尺，白九尺，皂六尺，黄五尺。 钱三百五十文，手巾五尺，漆盘三十五面。 乾枣七十颗，栗子一升，胡桃七十颗，黍米饭三斗，米拌三斗，捻头七十枚，薄饼三十五枚，麦米饭一斗，豆豉一斗，栗米饭一斗，粳米饭一斗，米五斗。 镜四面，并竹柱四枚，长三尺。 大盘一面，纸三十二张，五色石色别一斤。 右件随丰俭量之食物奠盘中。 醮法於宅中庭方二丈四尺，画地为坛，四季上开天门地户，人门鬼门，皆以箭为之，当方色綖，三重栏之，门安两灯，师案前一灯，坛中五方设五方神座，随方色着彩及钱於青座，北设灶君座黑座，南方神座赤座，束方神座青座，西土神座白座，南功曹主簿座赤座，北直符座黑座，西宜安丈人座白座，东从官座青座，四维十二辰上各一座别细席一，其五方神座及直符座，座列食盘，二余座，座列食盘，一五方安香火五彩钱帛，依五行成数，东方八色青，南方七色赤，西方九色白，北方六色黑，内方五色黄，诸侯已上用五色宝壁，卿士已下用石无斤用两，诸侯已上彩用匹，卿大夫用丈，士庶用尺，钱诸侯已上用千，卿大夫用百，士庶用十，亦可五方安五金龙东麦南黍西稻北豆内粟，坛南五尺师座一席一案，巾覆案上，东南上从地户出入。 先币，次进食，烧香再拜，少坐 祝曰：出家法师但坐不拜。 维某年岁月朔日某辰，某州县乡里，官位姓名，谨择吉日斋戒，肃敬内外，至诚净宇，清坛庶羞，香案信币，新华品物咸具。 谨请东方宅神青土将军各领东方甲乙寅卯，直符仪服，皆青，降兹东座。 谨请南方宅神赤土将军各领南方丙丁巳午，直符仪服皆赤，降兹南座。 谨请西方宅神白土将军各领西方庚辛申酉，直符仪服皆白，降慈西座。 谨请北方宅神黑土将军各领北方壬癸亥子，直符仪服皆黑，降兹北座。 谨请内方宅神黄土将军各领内方戊己辰戌丑未，直符仪服皆黄，降兹内座。 谨请乾坤震巽坎离艮兑，四孟四仲四季，岁月日时，刑杀德合，建厌冲对，太岁太阴大将军，门丞户尉，井灶伏龙，庭堂屋吏，宅内七神，阴阳官属，并依位就座，领纳丹诚，欢侑庆乐，弟子再拜谨启。 次上香　　　上荼　　　上酒 谨启五方宅神，五土将军，宅内众官等，弟子某生代有绿，依居宅宇，乾坤荫覆，得在凡流，资水火而求安，假稻梁以为命，自於此宅居住以来，日月推移，动淹年载，被蒙宁吉，戴荷诚探，或云而比年以来，轗轲虚耗，人口大小，更互不健，男□女□，妄为祟害，招引五瘟，六夭之鬼，屯结宅中，不肯退散，今谨依先圣科法，谨以今日吉庆良辰，静念至心，洒扫庭宇，烧香设位，谒请灵神，首罪谢愆，祈乞福佑，谨上饼果，并悉芳馨，敬荐宅中，五方宅神，五土将军，宅内众官，伏愿一切降临，赐为饮飨，弟子再拜谨启。",
      "translated_text": "**Zhengyi Ritual for Offerings to the Household Spirits**\n\n*Scripture Title:* *Zhengyi Ritual for Offerings to the Household Spirits*. Author unknown, likely composed during the Northern and Southern Dynasties or the Sui-Tang period. One fascicle. Base text from the *Daoist Canon of the Zhengtong Era*, *Dongshen* section, *Weiyi* (Ritual Propriety) category.\n\n**Zhengyi Ritual for Offerings to the Household Spirits**\n\nWhen a household suffers from depletion and loss, when cattle and horses perish or go missing, when fields and silkworms fail to yield, when family members fall ill, or when the Five Pestilences and seasonal epidemics strike yearly, or when dogs, rats, insects, or ants cause disturbances—if this is due to offenses against the earthly deities of the five directions and twelve temporal spirits, leading to the dispersal of wealth and fortune, such that one’s aspirations remain unfulfilled—then it is auspicious to perform the offering ritual on a day when the Four Seasons are in their waxing phase.\n\n**Ritual Implements:**\n- Six clean mats,\n- Twelve reed arrows,\n- Twenty-four *zhang* of hempen cords: six *zhang* each of blue, red, white, and black.\n- Nine lamps, with nine bamboo lampstands, each two *chi* and five *cun* in length (lamps not used during daylight).\n- One large table, five small tables (or five incense burners if tables are unavailable),\n- One *liang* of incense.\n- Five bolts of colored silk: eight *chi* of blue, seven *chi* of red, nine *chi* of white, six *chi* of black, and five *chi* of yellow.\n- Three hundred and fifty *wen* of coins,\n- A five-*chi* hand towel,\n- Thirty-five lacquered trays.\n- Seventy dried jujubes,\n- One *sheng* of chestnuts,\n- Seventy walnuts,\n- Three *dou* of glutinous millet rice,\n- Three *dou* of mixed grains,\n- Seventy twisted pastries,\n- Thirty-five thin pancakes,\n- One *dou* of wheat rice,\n- One *dou* of fermented soybeans,\n- One *dou* of millet rice,\n- One *dou* of polished rice,\n- Five *dou* of rice.\n- Four mirrors, with four bamboo stands, each three *chi* in length.\n- One large platter,\n- Thirty-two sheets of paper,\n- One *jin* each of five-colored mineral pigments.\n\nThe above items may be adjusted according to abundance or scarcity. Food offerings are arranged on the trays.\n\n**Ritual Method:**\nIn the courtyard of the house, mark out a square altar two *zhang* and four *chi* on each side. Open the Heavenly Gate, Earthly Door, Human Gate, and Ghost Gate at the four cardinal directions, each marked with arrows. Enclose the altar with three layers of cords corresponding to the colors of the directions. Place two lamps at each gate, one lamp before the officiant’s table, and arrange seats for the deities of the five directions at the center of the altar. Place colored silk and coins on the blue seat (east). The following seats are arranged:\n- North: Stove Lord’s seat (black),\n- South: Southern Deity’s seat (red),\n- East: Eastern Deity’s seat (blue),\n- West: Western Earth Deity’s seat (white),\n- South: Merit Officer and Registrar’s seat (red),\n- North: Direct Attendant’s seat (black),\n- West: Elder of Auspicious Stability’s seat (white),\n- East: Attending Official’s seat (blue).\n\nEach of the twelve earthly branches in the four corners has its own seat with a fine mat. The five directional deity seats and the Direct Attendant’s seat each have a food tray, while the remaining seats have one tray each. Arrange five incense burners, five-colored silk, and coins according to the generative numbers of the Five Phases:\n- East: eight items of blue,\n- South: seven items of red,\n- West: nine items of white,\n- North: six items of black,\n- Center: five items of yellow.\n\nFor nobles of marquis rank and above, use five-colored precious jades; for ministers and officials, use stones (measured in *jin* or *liang*). For nobles, silk is measured in bolts; for high officials, in *zhang*; for scholars and commoners, in *chi*. Coins: nobles use a thousand, high officials a hundred, scholars and commoners ten. Alternatively, place five metal dragons in the five directions: wheat in the east, millet in the south, rice in the west, beans in the north, and millet in the center.\n\nFive *chi* south of the altar, set one mat and one table for the officiant, with a towel covering the table. Enter and exit through the Earthly Door in the southeast.\n\nFirst present the ritual silk, then the food offerings. Burn incense, bow twice, and sit briefly.\n\n**Invocation (the ordained ritual master sits without bowing):**\n\"On this day, month, and year, in the such-and-such prefecture, county, village, and hamlet, [Name and Title] respectfully selects this auspicious day, observes purification and reverence, cleanses the inner and outer spaces, purifies the altar, and prepares the offerings. With fragrant incense, ritual silk, and fresh offerings now complete,\n\nWe reverently invite the Eastern Household Deity, the Blue Earth General, and all attendants of the east—*jia-yi* and *yin-mao*—clad in blue, to descend upon this eastern seat.\n\nWe reverently invite the Southern Household Deity, the Red Earth General, and all attendants of the south—*bing-ding* and *si-wu*—clad in red, to descend upon this southern seat.\n\nWe reverently invite the Western Household Deity, the White Earth General, and all attendants of the west—*geng-xin* and *shen-you*—clad in white, to descend upon this western seat.\n\nWe reverently invite the Northern Household Deity, the Black Earth General, and all attendants of the north—*ren-gui* and *hai-zi*—clad in black, to descend upon this northern seat.\n\nWe reverently invite the Central Household Deity, the Yellow Earth General, and all attendants of the center—*wu-ji*, *chen-xu*, *chou-wei*—clad in yellow, to descend upon this central seat.\n\nWe reverently invite the deities of *Qian* and *Kun*, *Zhen* and *Xun*, *Kan* and *Li*, *Gen* and *Dui*; the Four Cardinal, Four Intermediate, and Four Seasonal Months; the spirits of the year, month, day, and hour; the Punitive and Virtuous Stars; the Conjoined and Opposed Forces; the Grand Year, Grand Yin, and Great Generals; the Gate Guardians and Door Wardens; the Well and Stove Spirits; the Hidden Dragons; the Courtyard and Hall Officers; the Seven Household Deities; and all yin-yang officials and attendants—to take their places, receive our sincere devotion, and partake in joy and celebration. Your disciple bows twice and respectfully petitions.\"\n\nNext, present the incense, tea, and wine.\n\n\"Respectfully addressing the Five Directional Household Deities, the Five Earth Generals, and all officials within the household: Your disciple, [Name], has long dwelled in this residence, sheltered by the blessings of Heaven and Earth, existing as an ordinary mortal. We rely on water and fire for sustenance and depend on grains for life. Since residing here, time has passed, and years have accumulated. We have enjoyed peace and prosperity, ever grateful for your protection. Yet in recent years, misfortune and depletion have struck. Young and old among us have fallen ill, men and women have suffered inexplicable afflictions, and the Five Pestilences and Six Deathly Spirits have gathered within this house, refusing to depart.\n\nToday, in accordance with the sacred methods of the ancient sages, on this auspicious and propitious day, with a pure heart and mind, we have swept the courtyard, burned incense, and prepared the ritual space. We humbly invite the divine spirits, confess our transgressions, and seek your forgiveness. We pray for your blessings and protection. We now present these cakes and fruits, all fragrant and pure, as offerings to the Five Directional Household Deities, the Five Earth Generals, and all officials within this household. May you all deign to descend and partake in these offerings. Your disciple bows twice and respectfully petitions.\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1306,
      "start_sentence": 0,
      "end_sentence": 27,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.479846239089966,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\正一醮宅仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "次上香　　　上酒 谨启诸神等，弟子此宅，或是初时起立坚柱架梁，或从居住已来修理改换，或移徙抵向，犯触王神，或嫁娶葬埋，非家姓便利，或於中杀害，污秽宅形，或骂晋咒诅，动成愆咎，致有触犯四面八方天地阴阳百官禁忌，五土之炁，刑耗之神，或犯男女大小之命，及犯牛马六畜之命，爰居爰处，载忧载惧，今设薄礼，仰谢愆失，并献杂物，安定众神，伏愿降以嘉福，惠以厚恩，所有犯触，一切释散，人口康健，瘟毒不干，上得天和，下得地利，青龙镇左，白虎居右，朱雀捍前，玄武卫后，五行得所，四王安方，龙神镇守，邪炁消亡，辟除盗贼，禳却灾殃，解谢之后，万福来祥，弟子再拜谨启。 上香　　　上酒 重启神君等，弟子今日诚心致礼，伏愿神官普垂恩佑，请勤五方直符，为某驱遣宅内五虚六耗，蜚尸邪魅，及以时瘟疫炁，中外强□，行客寄鬼，雄雌注杀，远去千里，若宅中地王害黑发动，悉自伏灭，愿请青龙来，下镇宅东，消却东方青色灾祸。 开木门招集东方五谷，金银财宝来入，愿请赤龙来，下镇宅南，消却南方赤色灾祸。 开火门招集南方丝绵彩帛财宝来入，愿请白龙来，下镇宅西，消却西方白色灾祸。 开金门招集西方金玉珍奇财宝来入，愿请黑龙来，下镇宅北，消却北方黑色灾祸。 开水门招集北方鱼盐牛马财宝来入，愿请黄龙来，下镇宅中央，消却中宫黄色灾祸。 开土门招集四维钱财匹帛珍宝来入，五色神龙镇遏五方，祭谢以后，宅神安定，门丞户尉，备卫家门，禁制百鬼，无使来前，散灭凶殃，招集福禄，令弟子所居所住，安镇百年，男女贤明，老少元吉，恶口赤舌，没入九阴，家口尊卑，常沾五福，保宜天禄，永迮遐龄，六畜滋繁，五谷丰熟，钱财运合，仓库充盈，仕宦高迁，蚕桑蕃息，子孙昌炽，门户兴荣，举家承拥护之恩，毕代荷神明之德，蒙如所愿，被受洪恩，弟子再拜谨启。 次散食於坛外四方 重启礼谢三周，合座丰足，惟诸明只，各还本府，宅内诸神各安其部，伏愿留恩降福，一如所启，再拜。 行事毕收五方饮食埋宅五方，门位饭食埋大门枢侧，余盘回以散食。 正一醮宅仪竟",
      "translated_text": "Next, we offer incense and present wine. We humbly address all the divine spirits:\n\nThis disciple’s household may have, from its very foundation—when first the pillars were raised and beams set in place—through renovations and alterations over time, or through relocation and reorientation, offended the royal deities. Or perhaps through marriages, burials, or other rites, we have acted against the household’s proper alignment or convenience. Within these walls, there may have been killings that defiled the dwelling’s form, or curses and imprecations that incurred transgressions. All these have led to offenses against the prohibitions of the four directions, eight quarters, heaven and earth, yin and yang, and the myriad officials; against the qi of the Five Earths and the spirits of punishment and depletion. They may have violated the lives of men and women, young and old, or the lives of cattle, horses, and the six livestock. Wherever we have dwelt, we have borne worry and fear.\n\nToday, we present these modest offerings to confess our transgressions and present these various items to pacify all the spirits. We pray that you bestow upon us your finest blessings and grant us your boundless grace. May all offenses be absolved and dispersed, our household’s people enjoy health, and pestilential toxins be kept at bay. May we receive harmony from heaven above and favor from the earth below. May the Azure Dragon guard the left, the White Tiger reside on the right, the Vermilion Bird shield the front, and the Dark Warrior defend the rear. May the Five Phases find their proper places, the Four Kings secure their directions, and the dragon spirits stand guard. May malevolent qi vanish, thieves and bandits be repelled, and disasters and calamities be averted. After this rite of absolution, may ten thousand blessings descend in auspicious abundance.\n\nThis disciple bows twice and respectfully petitions.\n\nWe offer incense and present wine once more. We earnestly address the divine lords:\n\nToday, this disciple offers these rites with a sincere heart. We pray that the divine officials universally bestow their grace and protection. We humbly request the Five Directional Attendants to drive away from this household the Five Depletions, Six Exhaustions, flying corpses, malevolent spirits, seasonal pestilential qi, internal and external afflictions, wandering ghosts of travelers, and all forms of hostile or fatal influences—banishing them a thousand li away. If the earth’s royal harms or black-haired spirits within this dwelling have stirred, may they be subdued and extinguished.\n\nWe invite the Azure Dragon to descend and guard the east of this dwelling, dispelling all green-colored disasters of the east.\nWe open the Wood Gate to summon the five grains, gold, silver, and treasures to enter.\n\nWe invite the Crimson Dragon to descend and guard the south of this dwelling, dispelling all red-colored disasters of the south.\nWe open the Fire Gate to summon silks, brocades, and treasures to enter.\n\nWe invite the White Dragon to descend and guard the west of this dwelling, dispelling all white-colored disasters of the west.\nWe open the Metal Gate to summon gold, jade, rare treasures, and wealth to enter.\n\nWe invite the Black Dragon to descend and guard the north of this dwelling, dispelling all black-colored disasters of the north.\nWe open the Water Gate to summon fish, salt, cattle, horses, and treasures to enter.\n\nWe invite the Yellow Dragon to descend and guard the center of this dwelling, dispelling all yellow-colored disasters of the central palace.\nWe open the Earth Gate to summon money, fabrics, and treasures from the four quarters to enter.\n\nMay the Five-Colored Divine Dragons suppress the Five Directions. After this rite of offering and absolution, may the household deities be pacified, the Gate Marshal and Door Warden safeguard the household’s entrance, and all malevolent spirits be restrained, prevented from approaching. May misfortunes be dispersed, blessings and prosperity be summoned, and this disciple’s dwelling be secured for a hundred years. May men and women be wise and virtuous, the old and young fundamentally auspicious. May slanderous and malicious speech sink into the Nine Yin. May all members of this household, high and low, constantly partake in the Five Fortunes. May we be safeguarded by heaven’s emoluments and enjoy long life. May the six livestock flourish, the five grains ripen abundantly, wealth and resources converge, granaries and storehouses overflow. May official ranks ascend, silkworms and mulberries thrive, descendants prosper, and the household flourish. May the entire family receive your protective grace, and for generations to come, bear the virtue of the divine spirits. May our wishes be fulfilled and your vast grace be bestowed upon us.\n\nThis disciple bows twice and respectfully petitions.\n\nNext, we scatter food offerings outside the altar to the four directions.\n\nWe earnestly address and express gratitude thrice, and the feast is abundant. O luminous deities, may you each return to your original abodes. May the household deities each settle in their proper places. We pray that you leave your grace and bestow blessings, just as we have petitioned.\n\nWe bow twice.\n\nThe rites concluded, we gather the offerings from the Five Directions and bury them at the five quarters of the dwelling. The food from the gate and door positions is buried beside the main gate’s pivot. The remaining dishes are scattered as food offerings.\n\nThe Orthodox Unity Rite for the Household Pacification is now complete.",
      "overlap_context": "wept the courtyard, burned incense, and prepared the ritual space. We humbly invite the divine spirits, confess our transgressions, and seek your forgiveness. We pray for your blessings and protection. We now present these cakes and fruits, all fragrant and pure, as offerings to the Five Directional Household Deities, the Five Earth Generals, and all officials within this household. May you all deign to descend and partake in these offerings. Your disciple bows twice and respectfully petitions.\"",
      "start_char": 1307,
      "end_char": 2144,
      "start_sentence": 28,
      "end_sentence": 40,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.638307094573975,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\正一醮宅仪.txt",
        "category": "威仪类"
      }
    }
  ]
}