{
  "source_id": "正一法服天师教戒科经",
  "source_file": "chunked_daozang\\正一法服天师教戒科经.json",
  "total_chunks": 8,
  "total_original_chars": 9197,
  "total_translated_chars": 54690,
  "total_translation_time": 268.07546758651733,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\戒律类\\正一法服天师教戒科经.txt",
    "category": "戒律类"
  },
  "full_translation": "**The Orthodox Unity Ritual Vestments Scripture of Celestial Master’s Teachings and Precepts**\n\n**Scripture Title:** *The Scripture of Orthodox Unity Ritual Vestments, Celestial Master’s Teachings, and Compassionate Precepts*. Author unknown, approximately dated to the Northern and Southern Dynasties. One of the surviving fragments of the early Celestial Master Daoist classic *Orthodox Unity Ritual Texts*. One scroll. Source text: *Daoist Canon of the Zhengtong Era*, *Dongshen* Section, Precepts Category.\n\n---\n\nThe Dao takes harmony and equilibrium as its virtue, and its nature is to resolve conflict without opposition. Thus, when Heaven and Earth unite in harmony, the myriad things sprout and flourish, blossoms and fruits ripen. When the state is harmonious, the realm enjoys great peace, and all families live in tranquility. When the household is harmonious, fathers are kind and children filial, and Heaven bestows blessings and felicity.\n\nThe wise deeply reflect upon this—how could one not seek harmony?\n\nWhen Heaven and Earth fall out of harmony, yin and yang lose their balance: winter thunders, summer frosts, floods and droughts disrupt the seasons, the myriad things wither, and blossoms and leaves scorch and perish. When the state is disharmonious, ruler and minister deceive one another, the strong oppress the weak, barbarians invade the borders, weapons clash, the realm is thrown into chaos, and the people cannot live in peace. When the household is disharmonious, fathers lack kindness, children lack filial piety, elders and juniors quarrel, resentment festers, grudges turn venomous, spirits and gods grow disordered, and the family falls into ruin.\n\nThe suffering in these two cases all stems from disharmony.\n\nWhen Heaven and Earth are disharmonious, yin and yang fall into disorder, and calamities befall the myriad things. When the state is disharmonious, the powerful contend for power, prohibitions go unenforced, and harm befalls the people. When the household is disharmonious, disaster arises from greed for wealth and profit, anger and resentment escalate, and misfortune ensues.\n\nThus, the wise repeatedly explain these truths, fearing that people, long accustomed to unwholesome ways, will personally commit transgressions, incur guilt, fail to awaken, or harbor resentment—thereby deepening their faults. For this reason, they earnestly exhort all to take heed, encourage one another, abandon past evils, and cultivate present goodness.\n\nWhen goodness accumulates in accord with the Dao, the spirit settles and the body is at ease. Anger does not fester in the heart, harsh words do not pass the lips, foul sounds do not enter the ears, depraved sights do not meet the eyes, and greed and desire do not dominate the mind. By cultivating upright conduct, true *qi* draws near, all evil departs, past transgressions are wholly erased, and new goodness naturally manifests.\n\nThose who wish to uphold the Dao must not be remiss.\nIn serving the master, one must not be disrespectful.\nIn serving parents, one must not be unfilial.\nIn serving the ruler, one must not be disloyal.\nIn caring for oneself, one must not be negligent.\nIn heeding teachings and precepts, one must not be disobedient.\nToward like-minded companions, one must not be distant.\nIn outward conduct, one must not be cunning.\nIn inner truth, one must not be obscure.\nIn speech, one must not be careless.\nIn guarding against misfortune, one must not be unprepared.\nThe wise must not fail to seek counsel; the foolish must not go untaught.\nBenevolence and righteousness must not be neglected.\nKindness and generosity must not be withheld.\nThe orphaned and weak must not be abandoned.\nThe poor and lowly must not be left unaided.\nThose in distress must not be left undelivered.\nLiving beings must not be killed or harmed.\nEvil deeds must not be committed.\nSensual desires must not be indulged.\nGreed for profit must not be pursued.\nWine and meat must not be consumed to excess.\nThe good must not be disrespected.\nThe wicked must not go unadmonished.\n\nThe wise should deeply ponder these matters.\n\nIf one cannot align with the Dharma and precepts, and neither body nor mind possess merit and virtue, then seeking heavenly blessings will be difficult. Cultivating goodness brings fortune; committing evil incurs guilt. When punishment arrives, if one does not reflect upon past transgressions but instead laments that upholding the Dao is futile, blames Heaven, wavers in resolve, turns the mind elsewhere, follows the crowd, succumbs to myriad deceptions, forms cliques, pursues falsehoods, and falls into wickedness—such a person, ignorant and foolish, strays far from the Dao.\n\nThe Dao is vast and boundless, without limit. The celestial net is vast and all-encompassing; people dwell within it like fish swimming in a great net, unaware of its presence. When the net is drawn, they are caught; when it is released, they escape. People, unaware of the great spirit of the true Dao, are like fish unaware of the net. Yet some fools abandon truth for falsehood. Though falsehood may yield immediate gains, such gains are short-lived.\n\nThose who betray the Dao are not immediately punished because the great Dao is all-embracing, cherishing human life. It allows people to follow their desires, but though they may initially find satisfaction, they will later regret it deeply—something the foolish cannot comprehend.\n\nThe Dao regards people as people regard insects and ants; the Dao can kill as people can kill insects. Yet the Dao loves life and hates killing, and thus does not kill. If the wicked persist in evil, the recording spirits note their transgressions. When sins accumulate and guilt is complete, the executioners will punish them—the Dao itself does not kill.\n\nThose who wish to eliminate harm and halt evil must diligently uphold the teachings and precepts; the precepts must not be violated.\n\nThe Dao takes non-action (*wuwei*) as supreme. Human transgressions arise from action, from endless greed for profit. The Dao, being non-active, endures forever. Heaven and Earth follow the Dao’s non-action and merge with it. The perfected emulate Heaven’s non-action and thus attain immortality. Though the Dao is capable of all things, those who cultivate and uphold its teachings and precepts, accumulating goodness, will find their merit and virtue naturally supported. Their bodies will commune with Heaven, and blessings will flow to their descendants.\n\nWhat the wise delight in, the foolish do not comprehend. Scholars, exert yourselves diligently!\n\nThe Celestial Master established teachings and bestowed precepts, upholding the Dao and illuminating its mysteries. Those of superior virtue attain immortality; those of middling virtue double their lifespan; those of lesser virtue extend their years and avoid untimely death.\n\nAccording to the precepts: those who do evil do not live out their allotted years but die prematurely.\n\nWoe to the wicked!\nWhy do the wise not cultivate goodness and seek long life and enduring vision?\n\nThough one may not attain middling virtue, by cultivating lesser virtue—governing body and worldly affairs, severing attachments and desires, and reversing the ways of the common world—one may still align with the Dao.\n\nFirst, one must not indulge in unceasing lust, harbor wayward thoughts, or exhaust the spirit and deplete essence, lest the hun and po souls scatter. Such transgressions bring grievous harm to the self.\n\nSecond, one must not succumb to violent rage, venting anger through harsh words, loud curses, or reckless oaths that shake heaven and earth, startling gods and terrifying ghosts. Repeated offenses accumulate resentment within, injuring the five viscera. Once the five viscera are damaged, illness becomes incurable. Moreover, those who uphold the Dao have celestial officials and soldiers within their bodies. Frequent outbursts of wrath cause these spirits to abandon their posts, and the officials ascend to the celestial courts to report one’s transgressions. As offenses accumulate and sins take form, the left tally erases life, while the right tally inscribes death. Minor misdeeds bring calamity upon the self; grave sins extend misfortune to descendants.\n\nThird, one must not harbor malice or deceit, feigning kindness while concealing ill intent. The heart-spirit governs the five viscera; to dwell solely on evil is to unsettle this chief spirit, provoking the wrath of all others. Such anger shortens one’s lifespan—this is the most unforgivable transgression. If unchecked, its disasters will manifest.\n\nFourth, one must not defile the body with filth and dissipation, nor indulge in wine to the point of madness, altering one’s true nature, acting recklessly without restraint, ignoring prohibitions and taboos, disrespecting rulers and fathers, spewing curses and slander, invoking self-destruction, exposing private misdeeds, rebelling against order, committing incest, cursing heaven and earth, acting without limit or propriety, or brandishing blades in self-defense. Heaven will then unleash its wrath, and one will suffer the consequences alone.\n\nFifth, one must not covet wealth and possessions. Wealth and goods are but dung and dust, to be given and taken with the times. In this degenerate age, people treasure wealth, obsessing over profit, buying low and selling high, seizing every advantage, and deceiving the common folk. Those who obtain what they desire rejoice, while those who fail seethe with resentment and malice. Some even resort to violence over disputes, violating heavenly prohibitions, defying teachings and precepts, and clinging to greed and love of wealth. Yet wealth is the carving knife that harms the self—when the body perishes and the name is erased, what use is wealth? Those who hear these precepts nod in agreement, praising their wisdom and declaring them inviolable. Yet those who turn from the precepts toward profit, unable to restrain themselves, will suddenly face peril, walking into blades and inviting disaster. Their great destiny will be overturned. When ruin looms and they seek to repent, or when their sins are already sealed and they claim virtue, it is too late—their affairs are lost, and the Dao of Heaven offers no salvation.\n\nWealth, treasures, and sensual desires are the awls that pierce the eyes and the disasters that harm the body. The wise keep their distance, while fools delight in them. The wise, in all their movements—sitting, rising, sleeping, waking—exercise constant vigilance. Through self-discipline, their bodies remain unharmed, and their blessings become manifest.\n\nYet among those who now uphold the Dao with devotion, not one in ten thousand truly abides. How can this be said?\n\nIn this degenerate age of later generations, the customs of the time dictate such ways. People vie to outdo one another, coveting glory, wealth, and rank. Benevolence and righteousness are abandoned, while cunning and deceit are deemed wisdom. Fathers and sons deceive each other; rulers and ministers betray one another. They turn to mutual reliance and bribery to buy office, demoting the loyal and upright while appointing the flattering and wicked. They form factions with the treacherous, curry favor with their kin, and pursue wealth and status, casting aside the poor and lowly. In attire, carriages, and horses, they follow vain and worldly trends. The noble and the base alike share these ways—how, then, can they delight in the world and yet think of the Dao?\n\nSuch foolish people, though they may briefly prosper, are not to be envied. Why? The foolish, being shallow and base, when they attain glory and prominence, become arrogant, extravagant, and self-indulgent. Their conduct exceeds all bounds; they follow their desires without restraint, heedless of discipline and moderation. The Dao, being pure and empty, does not accept such people. The divine shuns them, while evil spirits assail them. Some resort to falsehood, turning from truth, and pray to ghosts for favors. Yet the net of Heaven is vast—its punishment has only not yet come. It is like cooking rice: when the fire beneath is extinguished, the steam within the pot lingers but briefly—how can it last? Though evil people may not yet face calamity, they are like that lingering steam.\n\nAll wise ones regard life as most precious and death as most base—is this not so? The Dao of Heaven is impartial and just: it rewards the good with life and punishes the wicked with death. Fortune and misfortune, blessings and disasters, arise from the unseen. Disasters are not averted by the rich and noble through prayers, nor are the poor and lowly punished simply for their poverty. Those who cultivate goodness receive blessings; those who do evil invite calamity. Even if a ruler possessed boundless treasures, when peril strikes and he clings to life, offering cities and measuring gold to beg for survival, how could it be granted?\n\nThe wise, though poor and lowly, need not forcibly seek wealth and rank, exhausting their essence and thought, neglecting what sustains them, growing arrogant and disordering their minds—such ways shorten life. Yet people, seeing the wealthy and noble, desire them in their hearts, striving to attain them, wearing themselves out in body and mind. Even if they gain such things, they are not vast. If one wishes to seek what one desires, one should cultivate the self and contemplate the Dao, harmonizing the household, young and old, in one mind. Sweep clean, burn incense, purify the space, and with reverence, openly express one’s wishes. The Dao, when subdued, dissolves all obstacles. If one’s desires are sincere, there is no need for gold, silk, or bribes; no need to seek through human affairs; no need for wine, meat, or sacrifices. Simply turn the heart to the Dao, and one will naturally attain it. Once attained, it fulfills all wishes—yet this is merely the Dao establishing merit through spirits and fragile things, and it need not be excessive.\n\nThose who imitate worldly people, turning from the Dao to seek favors, act in vain. To obtain blessings, one must diligently cultivate the self with devotion, purifying the space and burning incense morning and night. In sitting and rising, one must contemplate one’s wishes without neglect. Then blessings will surely respond. Those who delight in this receive boundless fortune; those who do not follow their own hearts. The Dao is vast and magnanimous, allowing people to follow their inclinations. Only the wise understand this, striving with every thought, fearing they may not keep pace. The foolish, careless and retreating, distance themselves, fearing they may not flee far enough. Such is the difference between the wise and the foolish. Learners, exert yourselves and diligently seek.\n\nIn households that uphold the Dao, some encounter disasters, illnesses, deaths, official summons, or slander, leading to misfortune. Why is this? It is all due to human folly. Though they revere the Dao and wish to uphold it, their conduct and nature differ little from the worldly. They do not cast aside deceit and falsehood, yet seek to use such ways to disturb the true and upright—this can never succeed. Deceit and truth are like thieves and villains before a vigilant officer: they hide and flee, finding no place to stand. How can they offend the honorable? Their qi naturally does not flow. How, then, can one seek to commune with deceit?\n\nSuch people, though nominally upholding the Dao and hoping for its protection, are not accepted by the Dao. They claim allegiance to it, yet when disaster or peril strikes, when illness and pain afflict them, though they look to the Dao for shelter, it does not save them. Malevolent spirits and sudden evil assail them, and the Dao does not shield them. These foolish people, utterly ignorant, cannot restrain their hearts to repent and return sincerely to the Dao. Instead, they grow more perverse, calling the Dao unspiritual. Though they may not speak it aloud, their hearts harbor resentment.\n\nSuch people do not conduct themselves with reverence, their hearts and minds shifting and changing. They pass days and months in cowardice, hoping to escape disaster and harm—yet not one in ten thousand succeeds. Stubborn and perverse, their hearts unchanged, when their lives end, what use is regret? Foolish people—how pitiful!\n\nThe wise rectify their hearts and guard the Dao, never growing lax. They must admonish the foolish with diligence. Through self-discipline and reverence, they diligently cultivate the Great Dao. The Dao is most exalted, supreme, and without peer; it encompasses Heaven and Earth, governs the myriad spirits, gives life to all things—birds, beasts, creeping and crawling creatures, all that bears qi—all are formed and born by the Dao. The majesty and spirit of the Dao—what does it not gather? What does it not dissolve? What does it not subdue? It holds the pivot of the mechanism, commands the hundred ghosts, exists before Heaven, and endures eternally.\n\nYet humans dwell within it, their lives fleeting, like the blink of an eye. The Great Dao, vast and all-embracing, pities the brevity of human life and thus teaches people to cultivate goodness. Those who perfect themselves above become immortals; those in the middle become earthbound immortals; those below gain extended years. The Dao is lofty and majestic—what does it seek from people? Yet people do not respond with gratitude, diligently cultivating goodness. Though they may not attain the conduct of the middle virtue, they should at least fulfill the lesser virtue. Yet even this they fail to achieve, turning from truth, disobeying teachings and precepts. They think only of desires, wealth, glory, sensual pleasures, profit, treasures, wine, and meat, indulging their hearts without restraint, growing arrogant and extravagant—how can they think of the Dao? If people do not think of the Dao, the Dao does not think of them.\n\nPeople are like fish, and the Dao is like water. Fish live when they have water, and die when they lose it; when the Dao departs, a person becomes empty—how can they hope for long life? The key lies in diligent progress and constant mindfulness.\n\nAll worthy ones who wish to preserve their bodies, cultivate conduct, keep their households safe and whole, must first abandon past transgressions and faults, then advance in later goodness. If you see others committing errors or faults, turn to admonish and exhort one another, teaching them to repent and reform. The merit and reward of such acts will bring boundless blessings. Do not say the Dao is formless and thus cannot be seen or served—this is merely arrogance and carelessness. Yet if you seek grace and fortune, you must serve with diligence, maintaining purity day and night.\n\nWhen those of shared commitment encounter hardship, or when illness strikes, aid one another; in times of urgency, relieve one another’s distress. Do not use cunning to deceive the simple, nor exploit power to make false claims, nor invoke ghosts and spirits to frighten and coerce others. Do not, merely possessing slight wit, boast of your name and exalt yourself, belittling the foolish, slandering one another, speaking recklessly, or pointing out the faults of the worthy.\n\nDo not harbor private greed and cruelty, honoring the noble while shaming the lowly, favoring the rich while abandoning the poor, relying on arrogance, or serving two masters with divided loyalty, seeking blessings as you please, thinking it charity. The Dao will never comply, ghosts will not serve you, and you will only destroy the true Dharma, bringing misfortune upon yourself instead.\n\nThose of shared aspiration should seek one another; those of shared Dharma should befriend one another. If men and women are illiterate, yet wholeheartedly devoted to the Dao, they may invite those who are learned to recite scriptures and precepts for them. Gather in a quiet dwelling, or in a hall swept clean, where incense is burned, and all have bathed and purified themselves. Men and women should sit separately, their bodies composed, their spirits settled, their minds focused and attentive. Do not speak frivolously, nor lean toward depravity, nor let your thoughts wander, nor doze or sleep, nor exhaust your body in vain suffering, for it will bring no benefit.\n\nIf you can follow the precepts with diligence and unwavering effort, your household will receive blessings. The celestial officials and guardian soldiers will come to protect you, and in the end, you will be free from disasters, misfortunes, illnesses, and pains.\n\nAmong all things, humans are the most noble. Living between heaven and earth, all know the day of their birth but none know the day of their death. Whether good or evil, rich or poor, noble or lowly, each believes their lifespan will endure to its full term—who would wish to be the first to perish? Yet no one takes joy in this. Still, the wicked accumulate transgressions, and when their sins are complete, illness arises, leading to death, all without self-awareness. Only those who cultivate goodness receive blessings.\n\nHuman life receives its mandate from heaven, and its regulation lies with heaven. Heaven does not speak, so it falls to the sages. The sages, moved by compassion for the world, do not remain constant, and thus leave behind teachings and precepts. These teachings and precepts urge people to advance, to attain long life, preserve their bodies, and secure their lives without end. If all people could uphold the Dharma without weariness, how could they merely preserve their lives? They would gain the boundless blessing of extended years.\n\nThis is not something the wealthy and noble can obtain through bribes or requests, nor can it be summoned by offering wine and meat to ghosts and spirits. Those who follow the Dao—worthy ones—revere and uphold the teachings and precepts, devoting themselves with diligence. Though they may endure hardship first, their reward will follow. The response of blessings is certain. Whether wise or foolish, noble or lowly, all share the same wish. Yet only those who follow the Dao hold fast to their resolve, and thus can use the precepts to restrain themselves. In their conduct and movements, amid love and desire, they keep the precepts without violation, their hearts free from deviance.\n\nWhen they see beauty or profit, they cover their eyes with the precepts; when they hear words of praise or blame, they block their ears with the precepts; when they taste sweet and fragrant delicacies, they seal their mouths with the precepts; when they crave wealth and treasures, indulging in love and desire, they subdue their hearts with the precepts; when they incline toward wickedness, intending evil deeds, they halt their steps with the precepts. If they uphold these without fail, they may be called enlightened. They should urge the ignorant and benighted to advance. Though the benighted cannot accept and apply these teachings, there is nothing to be done. Yet those who follow the Dao always wish to have good hearts and bestow kindness, for the Way of Heaven grants blessings.\n\nThose who follow the Dao with diligence must exert themselves, uphold it for long, cultivate their resolve with firmness, and advance with single-minded devotion. There is none who does not first labor and later receive reward, crossing over to become an immortal of body and spirit. Thus, Master Yang followed the Dao for fifteen years without reward, cultivating himself without weariness. By the age of eighty, his merit was complete, his conduct renowned, and his blessings boundless.\n\nAll worthy ones who follow the Dao, serving with reverence and diligence, should be like one who is starving or thirsty, longing for food and drink; like one who encounters cold or heat, desiring a change of place; like one who has labored to exhaustion, longing for rest; like one who is weary, longing for sleep; like one who has a wish, longing for its fulfillment. When you think of the Dao and revere the True, desiring to transcend the mortal body, think of these longings. Exert yourself according to the Dharma without weariness, and you will obtain freedom from disasters, misfortunes, illnesses, pains, and sorrows. What wish will not be fulfilled? What blessing will not respond?\n\nThe Dao emerges from spontaneity, born before heaven and earth, named the Most High, Mysterious, and Venerable Supreme. The Three Blacks merge into One, becoming the Most High and Perfectly True Dao. The Dao is vast and great, encompassing heaven and earth, transforming the myriad spirits, subtly spreading beyond the eight directions, inwardly hidden within the finest hair. It gives life to the myriad things, governs the Three Heavens, and commands the thirty-six thousand spirits. It covers all that is great and enters all that is small. Serene and without action, it endures forever. Though it embraces the turbid, it is not defiled, and thus is the mother of the myriad things.\n\nThe Way of Heaven is impartial, yet it favors the good. The good preserve it and thereby attain immortality. This is not something the rich and noble can obtain by seeking, nor can the poor and lowly be excluded by disdain. If one can wholeheartedly delight in it, with sincere devotion and mindfulness, cultivating the body and practicing goodness, then one will unite with the Dao.\n\nYet most people in the world are foolish, prizing superficiality and falsehood. They indulge their bodies and desires amid the common crowd, seeking fleeting pleasures to gratify their bellies and eyes, yet they cannot endure hardship or diligently think of and follow the Dao. Those who follow the Dao must only accumulate merit and virtue, practice humility and yielding, act with benevolence and righteousness, cultivate gentleness and all goodness, and maintain purity and non-action. Though they may endure hardship at first, they will ultimately receive blessings, unlike those who follow the common way.\n\nThose who merely covet fleeting gains will, after their lives end, become dung and dust, their souls and spirits rotting away. How vastly different are Daoists from the common folk! Why say so? Daoists are pure and upright, their names ascending to belong to Heaven; the vulgar are filthy and turbid, their deaths belonging to the earthly officials—how distant the difference! Fools cling to worldly ways and do not think of following the Dao; this is truly great delusion.\n\nEvery person has eyes, ears, a nose, a mouth, a mind, and two feet, yet the conduct of the wise and the foolish differs: the eyes fixate on profit and beauty, the ears heed pleasing or hateful words, the nose delights in sweet fragrances, the mouth craves the finest flavors, the mind indulges every desire, and the feet follow wherever whim leads, even toward wickedness and wrongdoing. The wise are not so—their eyes do not gaze upon what they desire, their ears do not heed evil or corrupt speech, their noses do not seek foul or fragrant scents, their mouths do not delight in rich flavors, their minds do not dwell on gratifying desires, and their feet do not rush toward evil deeds or wrongdoing. Such is the conduct of Daoists. Though Daoists know the pleasures of desire, they restrain their passions with precepts and thus do not commit evil. Their accumulated goodness becomes manifest, aligning with the laws of the Dao, and they receive boundless blessings. Fools know that evil brings swift misfortune, yet they cannot steadfastly uphold the precepts; opposing the Dao, how can they hope for blessings? If one desires blessings, why not emulate the Daoist?\n\nTo follow the Dao is to be pure, upright, and free from contrivance; one must only be diligent, cultivate conduct, and accumulate goodness. There is no fixed limit to this, nor is it hindered by water or fire, nor obstructed by poverty or low status, nor seized by the powerful, nor contested by the wealthy, nor burdened by labor or toil. Why not resolutely devote oneself to the Dao with wholehearted diligence?\n\nA Daoist’s hundred deeds must be complete, their thousand virtues manifest. Though they may have nine hundred and ninety-nine virtues, if one remains unfulfilled and they are swayed by profit, all prior merit is discarded. Only by guarding the mind, upholding the precepts without fail, can one attain liberation from the world. Let the wise Daoist be diligent in practice.\n\n**Precepts of the Great Daoist School**\nThe Great Dao encompasses Heaven and Earth, nurturing all living beings and governing the myriad affairs. It is formless and imageless, vast and undifferentiated, yet it gives rise to the hundred thousand myriad things, beyond what mortals can name. From Heaven and Earth downward, all are born and perish by the Dao. The Dao bestows upon them a subtle qi, which manifests in three colors: the Mysterious, the Primordial, and the Originating qi. The Mysterious is blue and becomes Heaven; the Originating is yellow and becomes Earth; the Primordial is white and is the Dao itself. Within these three qi, the upper and lower are regulated, becoming the parents of the myriad things. Thus, they are most revered and divine; from Heaven and Earth downward, nothing is born that does not receive this qi.\n\nAll long-enduring things guard the Dao and contain qi, possessing spirit, and thus can inhale and exhale yin and yang. The Dao gives birth to Heaven, Heaven gives birth to Earth, and Earth gives birth to humanity—all arise from these three qi. As two times three makes nine, humans have nine orifices and nine qi. When the nine qi flow freely, the five viscera are at peace; when the five viscera are at peace, the six bowels are settled; when the six bowels are settled, the spirit is luminous; and when the spirit is luminous, it draws near to the Dao. Therefore, those who practice goodness and uphold the Dao must carefully preserve the Way of life, and the Way of life must not lose its power. These three—Heaven, Earth, and humanity—do not depart from one another, and thus can transform along with Heaven and Earth.\n\nThe *Book of Changes* states: \"With Heaven and Earth, there come the myriad things; with the myriad things, there come male and female; with male and female, there come husband and wife; with husband and wife, there come father and son.\" The bond of father and son is meant to extend through a hundred generations, ensuring the lineage does not perish. Yet in later ages, the world grew shallow, and people became foolish, delighting only in sensual pleasures, indulging in depravity and falsehood, gratifying their ears and eyes, wallowing in lust and beauty, their spirits in turmoil, coveting wealth and bribes, their qi rising in fury, and thus bringing forth a hundred illnesses.\n\nFrom the time of the Yellow Emperor onward, people grew increasingly cunning, harnessing oxen and riding horses, using wealth to gain office, their desires gradually thinning until, by the Five Emperors, they were utterly dissipated. The Three Dynasties of Xia, Shang, and Zhou saw the world turn toward profit. The Qin began the Five Streams of decline, each harming the next. Those who died by violence numbered in the tens of thousands, beyond counting—all because they did not believe in the Dao. The Dao has been the teacher of emperors and kings through the ages, yet rulers failed to revere and uphold it, leading to the calamities of collapse and ruin. In times of peril, when all seemed lost, not one in ten thousand was saved.\n\nThe Dao values human life, and thus, at the end of the Zhou dynasty, it emerged in Langye, bestowing its teachings upon Gan Ji. The Way of Great Peace arose in the East, beginning to deliver the people from suffering. Many wished to believe in the Dao, but its transforming influence was still faint, and only those who listened were granted food and drink. The transformations of yin and yang grew more lenient, extending even to the spirits of parents, brothers, and ancestral sacrifices. Later, the qi of the Dao was to spread across the Four Seas, shifting to the Western Pass. Yet the Great Peace was not yet complete, and all required the oral instructions of a wise teacher, with omens and signs serving as mandates.\n\nThe Dao then composed the *Five Thousand Character Text*, containing the essentials of immortality. Its prohibitions grew stricter, its instructions more forceful for cultivating the body and nurturing life. The teachings on immortality were entrusted to the Pass Keeper Yin Xi, but the world was filled with fools, their hearts hesitant and doubtful. The dead piled up like landslides, and not one in ten thousand was preserved.\n\nEntering the Western lands, the Dao’s teachings were bestowed upon the Hu people, its prohibitions most severe: no yin-yang union, no killing of living beings for food. The Hu could not believe in the Dao, and so it transformed into the teachings of the Perfected Immortals. The immortals communed with the heavenly beings, soaring amidst the azure clouds, dwelling by the shores of the Weak Waters. The Hu people kowtowed tens of thousands of times, their true mirrors reflecting the heavens. They shaved their heads and plucked their beards, vowing to believe in the Perfected Ones, and thus the True Dao flourished. Not only did the Hu fail to become like the Qin, but the Qin people themselves could not attain the True Dao.\n\nAs the Five Hegemons’ era declined, the Red Han inherited the Mandate of Heaven. The Dao aided in overcoming chaos, bestowing the *Yellow Stone Text* upon Zhang Liang. The Dao also took on forms and changes—who could recognize the true? After the Han dynasty was established, its later heirs acted recklessly, the people pursuing profit, the strong and weak clashing in anger. The Dao grieved for human life, and once departed, it was difficult to return. Thus, Heaven bestowed its qi to govern the people, and the newly emerged Lord Lao was born.\n\nWhat is the \"Ancient Muddled Ghost\"? People fear ghosts but do not believe in the Dao, so Lord Lao bestowed upon Zhang Daoling the title of Celestial Master, most revered and divine, to serve as the teacher of humanity. You all should understand this—his honor surpasses that of heaven and earth—yet you remain obstinately confused, day after day, month after month, year after year, indulging in gluttony, yielding to the desires of ear and eye, disbelieving in the Dao. The dead number in the tens of thousands—how can this not be grievous?\n\nIn the fifth month of the first year of *Han’an*, in the city of Chishi within the Linju County of Shu Commandery, the Dao of *Zhengyi Mengwei* was revealed, forging a covenant with heaven and earth. Twenty-four *zhi* were established, distributing the primordial *qi* of the Mysterious Origin to govern the people. Yet you still fail to grasp the root of the Dao, the source of truth and falsehood, competing only for worldly prestige, distinguishing between noble and base, defying the Dao and betraying virtue, seeking only to follow human whims. Human desires delight in chaos, and thus Zhang Jiao and the Yellow Turbans rose in rebellion. Do you know who Zhang Jiao was? Since then, how many tens of millions have died?\n\nThe Dao caused later heirs to divide *qi* to govern the people. For over forty years in the region of Han, the Dao’s prohibitions preserved the true origin of the numinous immortals. Yet what of the *Xianger*, the *Miaozhen*, the *Three Spirits and Seven Words*—were these not true and upright? To call the Dao deceitful is a reversal most lamentable. When the state of Yi collapsed, those displaced and dead numbered in the tens of thousands, wounding the hearts and wills of the people. Since the time of exile and dispersal across the land, the Dao has repeatedly saved your lives. Some resolved disputes through the exchange of *qi*; others, through the commands of former ministers, sought to rectify themselves. Yet you still do not believe—how pitiful!\n\nIf you desire dawn, you must first endure dusk; if you seek great peace, you must first endure chaos. If human evil cannot be eradicated, then war, plague, flood, and drought will bring death. You, with your meager fate, are destined to encounter these trials. Nevertheless, the virtuous shall suffer no harm. The Dao was cultivated in former times precisely to prepare for this day. Those who die before the advent of great peace shall have their descendants receive heaven’s grace.\n\nIn this degenerate age, with hearts unsteady, whether old or new households, if you perceive the changes of the world and reform your hearts to do good, practicing benevolence and righteousness, then goodness shall prevail. You may yet witness great peace, escape the throes of calamity, and become the seed-people of future generations. Even amid the disasters of war, plague, and flood, you shall remain unharmed at the brink of peril—for this is the Dao.\n\nIf you think of the Dao, the Dao will think of you; if you do not think of the Dao, the Dao will not think of you. Therefore, all people—men and women alike—you must solemnly cultivate yourselves, purify your conduct, honor your teachers, and uphold the Dao. In this shallow age, if families—husbands and wives, parents and children—remain steadfast together, they may endure. Yet how can you not inherit the practices of purity, integrity, filial piety, obedience to the Dao, reverence for teachers, veneration of ghosts, and devotion to the gods?\n\nNow the world’s turmoil has departed like scattered sheep. War, plague, and malign *qi* spread across the four directions. Reflect upon the goodness of this day: honor heaven, revere the gods, cherish life, and practice the Dao. Strive to be true and upright, and the Dao will cherish you. If you do not think of the Dao, the Dao will distance itself from you, and calamity will swiftly draw near. Beware—do not regret later, for regret will bring suffering in future lives.\n\nI traverse the four seas by day and night, journeying beyond the eight directions, desiring that rulers be benevolent, ministers loyal, fathers kind, children filial, husbands faithful, wives chaste, elder brothers respectful, and younger brothers obedient—so that the world may be at peace. Yet the people have long been mired in turbidity. Though they hear the words of immortals and the teachings of longevity, their hearts are deluded, their minds confused, and they persist in disbelief. Some practice goodness without knowing true uprightness; the foolish instruct the foolish, the wicked transmit wickedness. They do not reject evil but instead slander one another. Rulers and ministers vie for power, fathers and sons grow estranged, husbands and wives quarrel, brothers become divided. They exploit public office for private gain, men and women indulge in licentiousness, transgressing heaven and earth, disrupting the Five Constants. Outwardly correct but inwardly corrupt, they disorder the principles of the Dao. Thus, the Three Heavens grow indignant, murderous *qi* rages unchecked, the Five Planets lose their courses, Venus shines fiercely, winter winds howl with thunder, and comets rise and fall. Heaven hangs omens to warn humanity, yet people do not believe in the Dao. Those who die with Daoist aspirations shall have their *qi* linger in dark valleys.\n\nThe *Miaozhen* was composed by me, and the *Huangting*, the *Three Spirits and Seven Words*, are all instructive scriptures, the radiance of the *Daode*. The Dao does not wish to be named by form; the wise, seeing one, understand ten—like those who recognize sound. The Dao resides within your own body; how could it be found in another?\n\nYet you, in learning goodness, fail to grasp the root of the scriptures. The wicked instruct the wicked, embracing falsehood and discarding truth. I once recorded miscellaneous writings on short scrolls, filled with heterodox texts, and ordered them all destroyed. The *Jijiu* were unworthy, so I had them conceal these deeply, preserving them to this day. Now, the scholars of this degenerate age favor superficial doctrines, mistaking falsehood for truth. All such acts violate heaven’s prohibitions and will surely bring harm, never blessing. It is better to follow your heart’s desires than to labor in vain.\n\nYou need not trouble yourselves with heavenly judgment or lightly transgress the laws of the state. To bring about great peace, people must assist heaven in its work. Heaven is enlightened, and so too are the people enlightened. When the Five Constants are rectified, the Two Principles shall be settled—this depends on human effort.\n\nAll households, old and new—men and women, young and old—from the seventh day of the first month of the second year of *Zhengyuan* onward, if you can vigorously uphold goodness, adhere to these essential teachings, serve as loyal ministers and filial children, maintain faithful husbands and chaste wives, respectful elder brothers and obedient younger brothers, and harbor no duplicity within, then you may become good people and be counted among the seed-people. Even in times of hardship, you must aid them with your strength. If you delight in life and the Dao, regardless of age, with steadfast hearts and upright intentions, assist the state and sustain destiny, then the gods of good and evil shall know your deeds. Do not indulge in vain imaginings or heed the words of deceitful men who claim to know the Dao and teach it to others.\n\nAll male and female officials who received appointments in the past and remain in office without bereavement—since the fifth year of *Taihe*, each has established their own positions, no longer governed by my *qi* or guided by the true *qi* that directs the spirits in selection. Some have heeded *qi*-based decisions, trusted the visions of inner attendants, or acted under compulsion, unable to follow old protocols, yielding to persuasive claims. Some hold multiple offices simultaneously, while others occupy positions in name only. Those who accept such appointments recklessly defy the *qi* of Heaven and Earth, mismanage the documents of the Three Offices, and indulge in lavish feasting.\n\nAs for those in honorary or idle positions without documentary duties, they must rise and sit in accordance with the seasons, bearing the title of Heaven’s officials and abiding in the presence of the divine, to counter the errors of the secular world. Yet they remain ignorant of the Way of loyal ministers and filial children. When they hear of disasters and reprimands, they react as if personally afflicted, even resenting and falsely claiming that devotion to the Dao brings no benefit. Such actions incur the three thousandfold transgressions, which rebound upon themselves as if self-inflicted.\n\nI once labored diligently to preserve your lives, hoping you would witness the Great Peace—yet now you seek it anew? In the late Han dynasty, when the imperial line waned, heroes ran rampant, the strong oppressed the weak, and the people grew cunning and deceitful. Men and women indulged in wantonness, governance failed, households could not restrain themselves, bandits plundered cities, and the resentful oppressed turned upon one another in servitude, devouring the common folk. The people’s grievances stirred rebellion, and perverse *qi* offended Heaven. Thus, the five planets lost their courses, comets swept the skies, Mars abandoned its station, powerful ministers vied for dominance, and traitors conspired for over a hundred years.\n\nThe Wei house, entrusted by Heaven to purge these ills, acted as destiny decreed. Recorded in the Yellow River and Luo River diagrams, celestial signs hung in the heavens—I, in obedience to Heaven and the times, commanded Emperor Wu as the state preceptor to traverse the land, filling pits with the dead. Once my state’s radiance was secured, the people suffered no harm, amassing gold and purple honors, and attaining long life. The seven sons and five marquises became the state’s glory, with generals, ministers, and kinsmen enfeoffed in abundance, their silver and bronze counted in the thousands. Fathers died and sons succeeded, younger brothers perished and elder brothers prospered, all bathed in sagely grace. Yet do you truly understand whence virtue and truth arise?\n\nIn the past, I opened the gates to teach goodness, but you refused to heed. From now on, I withdraw from the world, entrusting you to the Wei. With pure governance and Daoist rule, one may walk a thousand *li* alone, tigers and wolves cower in hiding, and doors need not be barred. Yet petty officials, ignorant of Heaven’s mandate and the order of fate, persist in perverse delusions. Those who instigate such things meet misfortune, even extending to their descendants. Do you not grasp the root of this?\n\nIn recent years, plagues have swept the land, eradicating the wicked—only the evil are slain. Those who uphold the Dao and delight in goodness are protected by Heaven, like an infant rescued from peril or the tongue avoiding the teeth. Do you not yet understand?\n\nFrom this day forward, no official may presumptuously appoint themselves to office. Should you defy me again, do not complain of harm. When a *jijiu* treats an illness and the patient recovers, only to fall ill again, such a person is wicked—do not treat them further.\n\nInstead, let every household transform itself through loyalty and filial piety: fathers kind, children filial; husbands faithful, wives chaste; elder brothers respectful, younger brothers obedient. Morning and night, purify yourselves, sever greed, abandon profit and desire, reform your wicked hearts, pity the poor and cherish the elderly, practice generosity and yielding, cast aside licentiousness and recklessness, temper joy and anger, and maintain harmony in thought and gaze. Assist the state and strengthen destiny, forsake past evils, and embrace present goodness. Thus, disasters will vanish, illness will cease, and you may become the seed-people of future generations.\n\nDo not resent poverty or hardship, nor covet wealth and honor. What your ears and eyes have witnessed since ancient times—has wealth and nobility ever endured? Wealth is abandoned to the earth, bodies perish in the marketplace. Hence the saying: \"The dead are no better than living rats.\" Attainment lies in destiny, and destiny is sought through the Dao. The Dao is hidden and nameless; names are the axes that hew the self. Good deeds leave no tracks, desiring to remain unseen. To practice the Dao is to cultivate the self, nurture life, and seek blessings—not to indulge oneself while teaching others. Indulgence makes one’s faults visible, sharpening the axe that hews the self. When the axe is sharp, blessings depart and calamities arrive. Can one not be cautious? Can one not stand in awe?\n\nHeaven and Earth endure because they act without contrivance. To act without contrivance is to achieve all things, yet let none perceive your traces—only then can wonders arise. You, the common folk, are laughable indeed. At the slightest good deed, you seek recognition; at the slightest distinction, you crave praise. These bring no benefit to the Dao and violate its prohibitions.\n\nNow I transmit my teachings so that all, new and old, may understand my heart. Do not betray this trust.\n\nThe Celestial Master’s Teaching\nNow, therefore, I issue this instruction in seven-character verse, to thank all *jijiu* and the male and female people:\n\nHeaven and Earth blend their *qi* like mist,\nThe four seasons and five phases turn in mutual dependence.\nWere Heaven and Earth to unite without people,\nStars and constellations would fall into chaos, preceding mankind.\nThe twenty-eight lodges complete their cycles,\nMars and Venus emerge in their midst.\nShould signs change and portents appear,\nThe foundation of Great Peace cannot rest.\nThus the axle creaks, unspeakable,\nWords and decrees weigh heavy on the heart.\nThe *qi* courses to the eight extremes and returns,\nSurveying the people of the Yi, Hu, and Qin.\nNo true people are seen—only corpse-people,\nWho follow their hearts’ desires, wasting their spirits.\nTheir five viscera hollow, they become corpse-people,\nTheir lives irredeemable, claimed by the Earth Office.\nTheir bodies join the ghostly ranks in the Yellow Springs.\nYet if they reflect, repent, and follow my words,\nThey may ascend and transcend, becoming immortals,\nCautiously guarding yin and yang, preserving their spirits.\nThe five viscera and six bowels have their rulers and ministers,\nAccumulating subtly to become true people.\nIf the spirit is sorrowful and sleepless,\nRoaming among the people, inquiring of the five viscera,\nIt returns to speak with the true person—\nThe true person within the heart ascends to Heaven.\n\nIn crimson-yellow unlined robes and triple-seamed caps,\nBearing Heavenly Jade Tallies, they kneel before me.\nThey expound on the myriad people and the Dao of all folk—\nRewards and transgressions, promotions and demotions, all set forth in clear scripture.\n\nYangping governs the teachings. I acknowledge the Twenty-Four Districts, the Five Qi and Central Qi, the Four Divisions of Spirit-Conducting Qi, the Left and Right Supervising Spirits, the Libationers of the Districts, the Overseers of Separate Districts, and the scattered folk—men and women, old and young—of the various districts. In the first year of Han’an, on the first day of the fifth month, I received the Dao from the Divine Qi of the Han’s First August Emperor, Wang, pledging five pecks of rice as token, that all who might attain immortality could ascend and transcend.\n\nYet you, this generation, are even harder to instruct. How can I speak with you? You reverse right and wrong, twist crooked into straight. At this millennial convergence, what is to be done with you?\n\nI, following the Most High Lord Lao, have traversed the Eight Extremes, inspecting and inquiring among the people, seeking the seed-people, yet none could be found. You, the common folk, bear no resemblance to the seed-people. You but covet glory and wealth, money, grain, silks, brocades, and fine cotton, making the sustenance of wives and children your sole concern. You seize the households of others to exact their taxes, extort their goods, and press the people into service, monopolizing their labor to till private fields and feed your wives and slaves. You care for none but yourselves, seeking merit and fame, enriching your bodies and selves, recklessly grasping for wealth. Your households know no harmony; quarrels and slander take precedence. Men and women, old and young, speak ill of one another, their words filling the roads with discord. Their speech diverges, their words clash, and they spread slander without end. They disregard the spirits and gods, distressing the Dao of Heaven, causing the qi to fall into chaos. Upon whom does the blame rest?\n\nEach claims secret teachings, debating old affairs. I can no longer endure you. Do you even grasp the written decrees I hold for you? Libationers, overseers, men and women, old and young—each of you is muddled, no different from the vulgar. Your words belie your hearts; you are but human-headed worms. Your chambers know no restraint; you indulge in wanton lust. Men and women, old and young, fail to admonish one another. In your confusion, your conduct is turbid. Entrusted with the Master’s Dao and the Most High Lord Lao’s teachings, you debate old affairs, yet when I seek to enforce discipline, to cast the net and draw it tight, and to investigate and govern, among every ten of you—those who hold office, the district libationers—I shall execute three or four. Your names shall be returned to the Heavenly Bureau, where you will be interrogated, punished, and sentenced. Beware!\n\nThe qi grows urgent. Within no more than one, two, or three years, I shall ensure you hear and see for yourselves. Take heed!\n\nAmong the libationers and overseers, are there any of the old guard left? From the first year of Jian’an and Huangchu onward, each libationer and overseer has claimed to teach, each establishing their own district, no longer adhering to the old Daoist laws as they ought. I do not command you to follow the teachings of Yangping, Lutang, or Heming. Do your actions align with the old ways? If not, what urgency do I have? My urgency lies in turning you toward governing the people, in transmitting the teachings of the descending qi, and in exhorting you, this generation. The Most High Lord Lao oversees you all, desiring that each of you apply your minds, devote yourselves earnestly, and once more exhort yourselves to fulfill the Dao with utmost devotion, converting and guiding the common folk.\n\nThe Celestial Master’s Five-Word Linked Three Poems:\n\nLinked Three, then Linked One,\nParting clouds to brighten the white sun.\nThe Three Calamities sweep away defilement’s weight,\nAs if emerging from beneath the covers’ state.\n\nLinked Three, then Linked Two,\nGlory and splendor are not worth the due.\nShould you seek to pass the Five Trials’ test,\nYour sincerity must be pure, your earnestness the best.\n\nLinked Three, then Linked Three,\nWine and meat are not worth savoring.\nWash and refine the raw silk’s essence,\nFrom bitterness to crimson, its transformation.\n\nLinked Three, then Linked Four,\nThe wondrous Dharma is hidden in mystery’s core.\nYearn and aspire for the divine to descend,\nWith single-minded focus, let no duality offend.\n\nLinked Three, then Linked Five,\nThe Daoist emerges from the thatched door’s hive.\nShedding the form’s confines,\nWho can perceive the abyss profound?\n\nLinked Three, then Linked Six,\nThe years depart, beyond pursuit’s tricks.\nThough no bone-questioning fate is decreed,\nAdmonition still urges you to heed.\n\nLinked Three, then Linked Seven,\nYearn and aspire to enter the Nine Chambers’ heaven.\nGrasp and follow the sacred teachings’ thread,\nAnd all ten thousand affairs shall be swiftly sped.\n\nThe wondrous Dao is not far,\nIts flourishing depends on man’s part.\nLoyalty and faith merge into one qi,\nAnd you may transcend the mortal frame, set free.\n\nThe Three Calamities’ cycle hastens near,\nAbandon profit and desire—best act with fear.\nThe central vision gradually firms,\nAnd calamities and hardships will disperse like worms.\n\nExamine and purge the heart’s transgressions,\nStrive with might to set the standard’s lessons.\nPass the Five Trials, and all wishes may be won,\nYet lament the lack of natural affinity’s sun.\n\nEntangled in the mundane’s flowing tide,\nSeek long life, and among the worthy abide.\n\nThe Scripture of Precepts and Ordinances of the Orthodox Unity Teachings of the Celestial Master is now complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "正一法服天师教戒科经 经名：正一法服天师教戒矜经。 撰人不详，约出朴南北期。 系早期天师道经典《正一法文》残本之一。 一卷。 底本出处：《正统道藏》洞神部戒律类。 正一法服天师教戒科经 道以冲和为德，以不知相克。 是以天地合和，万物萌生，华英熟成。 国家合和，天下太平，万姓安宁。 室家合和，父慈子孝，天垂福庆。 贤者深思念焉，岂可不和！ 天地不和，阴阳失度，冬雷夏霜，水旱不调，万物乾陆，华叶燃枯。 国家不和，君臣相诈，强弱相陵，夷狄侵境，兵锋交错，天下扰禳，民不安居。 室家不和，父不慈爱，子无孝心，大小忿错，更相怨望，积怨含毒，鬼乱神错，家致败伤。 些二事之怨，皆由不和。 天地不和，阴阳错谬，灾害万物。 国家不和，豪杰争权，禁令不行，害及万民。 室家不和，祸起贪欲财利者，忿怒相加，以致灾殃。 诸，贤者所以反覆相解，恐人说习非法来久，躬行犯恶，然后得罪，不能发悟，或怀怨望，其过益深，故重丁宁，皆宜用心，转相劝进，除去已往之恶，修今来之善。 善积合道，神定体安，喜怒不忿於心，恶言不发於口，丑声不闻於耳，邪色不视於目，贪欲不专於意。 修行正身，真气来附，邪恶皆去，故过悉除，新善自着。 诸欲奉道，不可不勤； 事师，不可不敬； 事亲，不可不孝； 事君，不可不忠； 己身，不可不宝； 教戒，不可不从； 同志，不可不亲； 外行，不可不愚； 内实，不可不明； 语言，不可不慎； 祸患，不可不防； 明者，不可不请，愚者，不可不教； 仁义，不可不行； 施惠，不可不作； 孤弱，不可不恤； 贫贱，不可不济； 厄人，不可不度； 生物，不可杀伐； 恶事，不可不避； 色欲，不可不绝； 贪利，不可不远； 酒肉，不可不节； 善人，不可不敬； 恶人，｀不可不劝也。 贤者深念之焉。 为人若不能与法戒相应，身心又无功德，欲求天福，难矣。 修善得福，为恶得罪。 罪至，不自责先日过，反呼奉道无益，怨咎皇天，犹豫前却，移心他念，群辈翕习，妖惑万端，结党连群，导趣邪伪，陷入奸非，愚人无知，为行如此，去道远矣。 道之弘大，方圆无外。 天网恢罗，人处其中，如大网捕鱼，鱼为游行网中，岂知表有网也。 牵网便得，放网乃脱。 人不知真道大神，如鱼之不知网也。 而愚人或欲舍真就伪，伪住卒效，登时或能有利，利不久也。 叛道者，所以不即受罚，大道含弘，爱惜人命，听恣其意，随其所欲，虽初快心，后自当悔之深远，非愚俗所能明知。 道之视人，如人之视虫蚁； 道能杀人，如人能杀虫也。 道之好生恶杀，终不杀也。 恶人为恶不止，自有司神记其恶事，过积罪满，执杀者自罚之，道终不杀也。 诸贤者欲除害止恶，当勤奉教戒，戒不可违。 道以无为为上，人过积，但坐有为，贪利百端。 道然无为，故能长存。 天地法道无为，与道相混。 真人法天无为，故致神仙。 道之无所不为，人能修行执守教戒，善积行者，功德自辅，身与天通，福流子孙。 贤者所乐，愚者所不闻，学者勉自殷勤。 天师设教施戒，奉道明诀，上德者神仙，中德者倍寿，下德者增年，不横夭也。 按戒：为恶者，乃不尽寿而横夭也。 恶人痛哉！ 贤者何不修善，久视长生乎！",
      "translated_text": "**The Orthodox Unity Ritual Vestments Scripture of Celestial Master’s Teachings and Precepts**\n\n**Scripture Title:** *The Scripture of Orthodox Unity Ritual Vestments, Celestial Master’s Teachings, and Compassionate Precepts*. Author unknown, approximately dated to the Northern and Southern Dynasties. One of the surviving fragments of the early Celestial Master Daoist classic *Orthodox Unity Ritual Texts*. One scroll. Source text: *Daoist Canon of the Zhengtong Era*, *Dongshen* Section, Precepts Category.\n\n---\n\nThe Dao takes harmony and equilibrium as its virtue, and its nature is to resolve conflict without opposition. Thus, when Heaven and Earth unite in harmony, the myriad things sprout and flourish, blossoms and fruits ripen. When the state is harmonious, the realm enjoys great peace, and all families live in tranquility. When the household is harmonious, fathers are kind and children filial, and Heaven bestows blessings and felicity.\n\nThe wise deeply reflect upon this—how could one not seek harmony?\n\nWhen Heaven and Earth fall out of harmony, yin and yang lose their balance: winter thunders, summer frosts, floods and droughts disrupt the seasons, the myriad things wither, and blossoms and leaves scorch and perish. When the state is disharmonious, ruler and minister deceive one another, the strong oppress the weak, barbarians invade the borders, weapons clash, the realm is thrown into chaos, and the people cannot live in peace. When the household is disharmonious, fathers lack kindness, children lack filial piety, elders and juniors quarrel, resentment festers, grudges turn venomous, spirits and gods grow disordered, and the family falls into ruin.\n\nThe suffering in these two cases all stems from disharmony.\n\nWhen Heaven and Earth are disharmonious, yin and yang fall into disorder, and calamities befall the myriad things. When the state is disharmonious, the powerful contend for power, prohibitions go unenforced, and harm befalls the people. When the household is disharmonious, disaster arises from greed for wealth and profit, anger and resentment escalate, and misfortune ensues.\n\nThus, the wise repeatedly explain these truths, fearing that people, long accustomed to unwholesome ways, will personally commit transgressions, incur guilt, fail to awaken, or harbor resentment—thereby deepening their faults. For this reason, they earnestly exhort all to take heed, encourage one another, abandon past evils, and cultivate present goodness.\n\nWhen goodness accumulates in accord with the Dao, the spirit settles and the body is at ease. Anger does not fester in the heart, harsh words do not pass the lips, foul sounds do not enter the ears, depraved sights do not meet the eyes, and greed and desire do not dominate the mind. By cultivating upright conduct, true *qi* draws near, all evil departs, past transgressions are wholly erased, and new goodness naturally manifests.\n\nThose who wish to uphold the Dao must not be remiss.\nIn serving the master, one must not be disrespectful.\nIn serving parents, one must not be unfilial.\nIn serving the ruler, one must not be disloyal.\nIn caring for oneself, one must not be negligent.\nIn heeding teachings and precepts, one must not be disobedient.\nToward like-minded companions, one must not be distant.\nIn outward conduct, one must not be cunning.\nIn inner truth, one must not be obscure.\nIn speech, one must not be careless.\nIn guarding against misfortune, one must not be unprepared.\nThe wise must not fail to seek counsel; the foolish must not go untaught.\nBenevolence and righteousness must not be neglected.\nKindness and generosity must not be withheld.\nThe orphaned and weak must not be abandoned.\nThe poor and lowly must not be left unaided.\nThose in distress must not be left undelivered.\nLiving beings must not be killed or harmed.\nEvil deeds must not be committed.\nSensual desires must not be indulged.\nGreed for profit must not be pursued.\nWine and meat must not be consumed to excess.\nThe good must not be disrespected.\nThe wicked must not go unadmonished.\n\nThe wise should deeply ponder these matters.\n\nIf one cannot align with the Dharma and precepts, and neither body nor mind possess merit and virtue, then seeking heavenly blessings will be difficult. Cultivating goodness brings fortune; committing evil incurs guilt. When punishment arrives, if one does not reflect upon past transgressions but instead laments that upholding the Dao is futile, blames Heaven, wavers in resolve, turns the mind elsewhere, follows the crowd, succumbs to myriad deceptions, forms cliques, pursues falsehoods, and falls into wickedness—such a person, ignorant and foolish, strays far from the Dao.\n\nThe Dao is vast and boundless, without limit. The celestial net is vast and all-encompassing; people dwell within it like fish swimming in a great net, unaware of its presence. When the net is drawn, they are caught; when it is released, they escape. People, unaware of the great spirit of the true Dao, are like fish unaware of the net. Yet some fools abandon truth for falsehood. Though falsehood may yield immediate gains, such gains are short-lived.\n\nThose who betray the Dao are not immediately punished because the great Dao is all-embracing, cherishing human life. It allows people to follow their desires, but though they may initially find satisfaction, they will later regret it deeply—something the foolish cannot comprehend.\n\nThe Dao regards people as people regard insects and ants; the Dao can kill as people can kill insects. Yet the Dao loves life and hates killing, and thus does not kill. If the wicked persist in evil, the recording spirits note their transgressions. When sins accumulate and guilt is complete, the executioners will punish them—the Dao itself does not kill.\n\nThose who wish to eliminate harm and halt evil must diligently uphold the teachings and precepts; the precepts must not be violated.\n\nThe Dao takes non-action (*wuwei*) as supreme. Human transgressions arise from action, from endless greed for profit. The Dao, being non-active, endures forever. Heaven and Earth follow the Dao’s non-action and merge with it. The perfected emulate Heaven’s non-action and thus attain immortality. Though the Dao is capable of all things, those who cultivate and uphold its teachings and precepts, accumulating goodness, will find their merit and virtue naturally supported. Their bodies will commune with Heaven, and blessings will flow to their descendants.\n\nWhat the wise delight in, the foolish do not comprehend. Scholars, exert yourselves diligently!\n\nThe Celestial Master established teachings and bestowed precepts, upholding the Dao and illuminating its mysteries. Those of superior virtue attain immortality; those of middling virtue double their lifespan; those of lesser virtue extend their years and avoid untimely death.\n\nAccording to the precepts: those who do evil do not live out their allotted years but die prematurely.\n\nWoe to the wicked!\nWhy do the wise not cultivate goodness and seek long life and enduring vision?",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1216,
      "start_sentence": 0,
      "end_sentence": 70,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.978527307510376,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\正一法服天师教戒科经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "．虽不能及中德，修下德，治身世问，断绝爱欲，反俗所为，则与道合。 一不得淫泱不止，志意邪念，劳神损精，魂魄不守，则痛害人。 二不得情性暴怒，心忿口泄，扬声骂晋，誓盟呎诅，呼天震地，惊神骇鬼，数犯不改，积怨在内，伤损五藏。 五藏以伤，病不可治。 又奉道者身中有天曹吏兵，数犯瞋志，其神不守，吏兵上诣天曹，白人罪过，过积罪成，左契除生，右契着死，祸小者罪身，罪多者殃及子孙。 三不得佞毒含害，始赖於人，专怀恶心。 心神，五藏之主，而专念恶事，此一神不安，诸神皆怒，怒则刻寿，最不可犯之。 不止，其灾害已。 四不得秽身荒浊，饮酒迷乱，变易常性，狂悖无防，不知官禁为忌，不知君父为尊，骂誉溢口，自诅索死，发露阴私，反迷不顺，淫于骨肉，骂天晋地，无底无对，举刃自守，故天遂其殃，自受其患。 五不得贪利财货。 财货粪壤，随时而与。 下古世薄，以财为宝，专念求利，买贱卖贵，伺候便宜，欺诬百姓。 得所欲者，心怀喜悦，不得所欲者，怨恨毒心。 或忿争多少，刀兵相贼，违犯天禁，不从教戒，贪欲爱财，财者害身之雕，身没名灭，何用财为？ 闻戒者翕然称之言善，谓不可犯。 背戒向利不自专者，忽然复动，辄有履险导刃之厄，大命倾矣。 临败而欲悔，罪定而称善，事失以过，天道不救。 财宝色欲，陷目之锥，害身之灾，贤者远之，愚者乐之。 贤者坐起寐卧，举动行止，深用自戒。 自戒，身无变动，其福明矣。 观今奉道精专者，万无一人。 何以言之？",
      "translated_text": "Though one may not attain middling virtue, by cultivating lesser virtue—governing body and worldly affairs, severing attachments and desires, and reversing the ways of the common world—one may still align with the Dao.\n\nFirst, one must not indulge in unceasing lust, harbor wayward thoughts, or exhaust the spirit and deplete essence, lest the hun and po souls scatter. Such transgressions bring grievous harm to the self.\n\nSecond, one must not succumb to violent rage, venting anger through harsh words, loud curses, or reckless oaths that shake heaven and earth, startling gods and terrifying ghosts. Repeated offenses accumulate resentment within, injuring the five viscera. Once the five viscera are damaged, illness becomes incurable. Moreover, those who uphold the Dao have celestial officials and soldiers within their bodies. Frequent outbursts of wrath cause these spirits to abandon their posts, and the officials ascend to the celestial courts to report one’s transgressions. As offenses accumulate and sins take form, the left tally erases life, while the right tally inscribes death. Minor misdeeds bring calamity upon the self; grave sins extend misfortune to descendants.\n\nThird, one must not harbor malice or deceit, feigning kindness while concealing ill intent. The heart-spirit governs the five viscera; to dwell solely on evil is to unsettle this chief spirit, provoking the wrath of all others. Such anger shortens one’s lifespan—this is the most unforgivable transgression. If unchecked, its disasters will manifest.\n\nFourth, one must not defile the body with filth and dissipation, nor indulge in wine to the point of madness, altering one’s true nature, acting recklessly without restraint, ignoring prohibitions and taboos, disrespecting rulers and fathers, spewing curses and slander, invoking self-destruction, exposing private misdeeds, rebelling against order, committing incest, cursing heaven and earth, acting without limit or propriety, or brandishing blades in self-defense. Heaven will then unleash its wrath, and one will suffer the consequences alone.\n\nFifth, one must not covet wealth and possessions. Wealth and goods are but dung and dust, to be given and taken with the times. In this degenerate age, people treasure wealth, obsessing over profit, buying low and selling high, seizing every advantage, and deceiving the common folk. Those who obtain what they desire rejoice, while those who fail seethe with resentment and malice. Some even resort to violence over disputes, violating heavenly prohibitions, defying teachings and precepts, and clinging to greed and love of wealth. Yet wealth is the carving knife that harms the self—when the body perishes and the name is erased, what use is wealth? Those who hear these precepts nod in agreement, praising their wisdom and declaring them inviolable. Yet those who turn from the precepts toward profit, unable to restrain themselves, will suddenly face peril, walking into blades and inviting disaster. Their great destiny will be overturned. When ruin looms and they seek to repent, or when their sins are already sealed and they claim virtue, it is too late—their affairs are lost, and the Dao of Heaven offers no salvation.\n\nWealth, treasures, and sensual desires are the awls that pierce the eyes and the disasters that harm the body. The wise keep their distance, while fools delight in them. The wise, in all their movements—sitting, rising, sleeping, waking—exercise constant vigilance. Through self-discipline, their bodies remain unharmed, and their blessings become manifest.\n\nYet among those who now uphold the Dao with devotion, not one in ten thousand truly abides. How can this be said?",
      "overlap_context": "rselves diligently!\n\nThe Celestial Master established teachings and bestowed precepts, upholding the Dao and illuminating its mysteries. Those of superior virtue attain immortality; those of middling virtue double their lifespan; those of lesser virtue extend their years and avoid untimely death.\n\nAccording to the precepts: those who do evil do not live out their allotted years but die prematurely.\n\nWoe to the wicked!\nWhy do the wise not cultivate goodness and seek long life and enduring vision?",
      "start_char": 1216,
      "end_char": 1815,
      "start_sentence": 71,
      "end_sentence": 92,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.595584869384766,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\正一法服天师教戒科经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "下古世薄，时俗使然，竞相高上，贪荣富贵，仁义不行，权诈为智，父子相欺，君臣相给，转相属托，货赂卖官，黜退忠直，任用佞邪，厚奸结党，阿谀所亲，富贵相追，贫贱弃损，服饰车马，浮华顺俗，君子小人，皆共同然，所以欣欣世问，岂念道乎。 此辈愚人，虽先休休，不足愿也。 所以者何？ 愚人浅薄，适有荣显，便骄奢盈溢，施行过度，恣心快意，不慎法节，道之清虚，不受此辈，神明远之，邪鬼侵之。 或有协伪背真，祷鬼求请，天网恢恢，其罚未行耳。 譬如炊熟，火下以灭，饭中余气未尽，势安得久。 恶人虽未遇祸，譬如余气耳。 诸贤者，人之所大愿，以生年为贵； 人之所大恶，以死终为贱，岂不然乎！ 天道平正，以生赏善，以死罚恶。 此吉凶祸福，从窈冥中来，祸灾，非富贵者求请而可避，非贫贱者守穷而故罚。 修善者福至，为恶者祸来。 国君虽有无极之宝，临危惜命，倾城量金，求生乞活，岂复可得！ 贤者贫贱，不须强求富贵，劳人精思，废人所存，傲慢乱志，使人不寿。 而人见富贵者，心欲愿之，志欲存之，劳心苦志，得之不弘。 若欲所求乞，修身念道，室家大小，和同心意，扫除烧香，清诤严洁，然具白开启，说其所欲，道之降伏，何所不消。 若愿欲者，实不用金帛货赂，不用人事求请，不用酒肉祭祷，直归心於道，无为而自得。 得之随意，则信为鬼立功脆物而已，亦不用多。 而欲习效俗人，背道求请，事事反矣。 欲得福愿，要当勤身精进，晨暮清诤烧香，坐起念之，不废所愿，福无不应。 好乐者得福无量，不乐者自随本心。 道至宽弘，恣随人耳。 唯贤者明焉，念念精进，追之恐不及。 愚者忽忽退然，去之恐不远。 此贤愚不同也。 学者勉自勤请。 奉道之家，或遇灾异、疾病、死丧、官符、口舌，以致不利，何以然也？ 皆由人愚，奉法不勤，虽知道尊而欲奉之，其情性施行，与俗不别，邪伪不除，欲以邪伪干乱真正，终不可也。 邪与正，如贼盗恶人见监伺吏，藏窜无住立处，岂可犯尊，其气自然不通。 如何欲与邪相通也！ 诸此人辈，虽系名奉道，冀道当佑，道不受也。 而自谓属道，遇灾急厄，病痛着身，虽望道拥护，道不救也。 精邪恶鬼卒所侵害，道不为摄却。 而恶人憧愚，殊不能克心改悔，归诚於道，方更背戾，呼道不神。 虽不口言，心内怨望。 此辈不庄事，变易心肠，巽濡日月，冀脱灾免害，万不一脱。 执性了戾，心肠不改，没命之后，悔复何及。 愚人痛哉！ 贤者正心守道，不可懈惰，当以勤确愚者。 自戒庄事，勤修大道，至尊高而无上，周圆无表裹，囊括天地，制御众神，生育万物，娟飞蠕动含气之类，皆道所成所生。 道之威神，何所不集，何所不消，何所不伏。 把持枢机，驱使百鬼，先天而生，长守无穷。 人处其问，年命奄忽，如眼目视瞬问耳。 而大道含弘，乃愍人命短促，故教人修善。 上备者神仙，中备者地仙，下备者增年。 道尊巍巍，何求於人。 人不能感存道恩，精勤修善，虽不能及中德之行，下德当备也。 而复不及下德，违背真正，不从教戒，但念爱欲、富贵荣禄、色利财宝、饮酒食肉，恣心快意，骄奢盈溢，岂复念道乎。 人不念道，道不念人。",
      "translated_text": "In this degenerate age of later generations, the customs of the time dictate such ways. People vie to outdo one another, coveting glory, wealth, and rank. Benevolence and righteousness are abandoned, while cunning and deceit are deemed wisdom. Fathers and sons deceive each other; rulers and ministers betray one another. They turn to mutual reliance and bribery to buy office, demoting the loyal and upright while appointing the flattering and wicked. They form factions with the treacherous, curry favor with their kin, and pursue wealth and status, casting aside the poor and lowly. In attire, carriages, and horses, they follow vain and worldly trends. The noble and the base alike share these ways—how, then, can they delight in the world and yet think of the Dao?\n\nSuch foolish people, though they may briefly prosper, are not to be envied. Why? The foolish, being shallow and base, when they attain glory and prominence, become arrogant, extravagant, and self-indulgent. Their conduct exceeds all bounds; they follow their desires without restraint, heedless of discipline and moderation. The Dao, being pure and empty, does not accept such people. The divine shuns them, while evil spirits assail them. Some resort to falsehood, turning from truth, and pray to ghosts for favors. Yet the net of Heaven is vast—its punishment has only not yet come. It is like cooking rice: when the fire beneath is extinguished, the steam within the pot lingers but briefly—how can it last? Though evil people may not yet face calamity, they are like that lingering steam.\n\nAll wise ones regard life as most precious and death as most base—is this not so? The Dao of Heaven is impartial and just: it rewards the good with life and punishes the wicked with death. Fortune and misfortune, blessings and disasters, arise from the unseen. Disasters are not averted by the rich and noble through prayers, nor are the poor and lowly punished simply for their poverty. Those who cultivate goodness receive blessings; those who do evil invite calamity. Even if a ruler possessed boundless treasures, when peril strikes and he clings to life, offering cities and measuring gold to beg for survival, how could it be granted?\n\nThe wise, though poor and lowly, need not forcibly seek wealth and rank, exhausting their essence and thought, neglecting what sustains them, growing arrogant and disordering their minds—such ways shorten life. Yet people, seeing the wealthy and noble, desire them in their hearts, striving to attain them, wearing themselves out in body and mind. Even if they gain such things, they are not vast. If one wishes to seek what one desires, one should cultivate the self and contemplate the Dao, harmonizing the household, young and old, in one mind. Sweep clean, burn incense, purify the space, and with reverence, openly express one’s wishes. The Dao, when subdued, dissolves all obstacles. If one’s desires are sincere, there is no need for gold, silk, or bribes; no need to seek through human affairs; no need for wine, meat, or sacrifices. Simply turn the heart to the Dao, and one will naturally attain it. Once attained, it fulfills all wishes—yet this is merely the Dao establishing merit through spirits and fragile things, and it need not be excessive.\n\nThose who imitate worldly people, turning from the Dao to seek favors, act in vain. To obtain blessings, one must diligently cultivate the self with devotion, purifying the space and burning incense morning and night. In sitting and rising, one must contemplate one’s wishes without neglect. Then blessings will surely respond. Those who delight in this receive boundless fortune; those who do not follow their own hearts. The Dao is vast and magnanimous, allowing people to follow their inclinations. Only the wise understand this, striving with every thought, fearing they may not keep pace. The foolish, careless and retreating, distance themselves, fearing they may not flee far enough. Such is the difference between the wise and the foolish. Learners, exert yourselves and diligently seek.\n\nIn households that uphold the Dao, some encounter disasters, illnesses, deaths, official summons, or slander, leading to misfortune. Why is this? It is all due to human folly. Though they revere the Dao and wish to uphold it, their conduct and nature differ little from the worldly. They do not cast aside deceit and falsehood, yet seek to use such ways to disturb the true and upright—this can never succeed. Deceit and truth are like thieves and villains before a vigilant officer: they hide and flee, finding no place to stand. How can they offend the honorable? Their qi naturally does not flow. How, then, can one seek to commune with deceit?\n\nSuch people, though nominally upholding the Dao and hoping for its protection, are not accepted by the Dao. They claim allegiance to it, yet when disaster or peril strikes, when illness and pain afflict them, though they look to the Dao for shelter, it does not save them. Malevolent spirits and sudden evil assail them, and the Dao does not shield them. These foolish people, utterly ignorant, cannot restrain their hearts to repent and return sincerely to the Dao. Instead, they grow more perverse, calling the Dao unspiritual. Though they may not speak it aloud, their hearts harbor resentment.\n\nSuch people do not conduct themselves with reverence, their hearts and minds shifting and changing. They pass days and months in cowardice, hoping to escape disaster and harm—yet not one in ten thousand succeeds. Stubborn and perverse, their hearts unchanged, when their lives end, what use is regret? Foolish people—how pitiful!\n\nThe wise rectify their hearts and guard the Dao, never growing lax. They must admonish the foolish with diligence. Through self-discipline and reverence, they diligently cultivate the Great Dao. The Dao is most exalted, supreme, and without peer; it encompasses Heaven and Earth, governs the myriad spirits, gives life to all things—birds, beasts, creeping and crawling creatures, all that bears qi—all are formed and born by the Dao. The majesty and spirit of the Dao—what does it not gather? What does it not dissolve? What does it not subdue? It holds the pivot of the mechanism, commands the hundred ghosts, exists before Heaven, and endures eternally.\n\nYet humans dwell within it, their lives fleeting, like the blink of an eye. The Great Dao, vast and all-embracing, pities the brevity of human life and thus teaches people to cultivate goodness. Those who perfect themselves above become immortals; those in the middle become earthbound immortals; those below gain extended years. The Dao is lofty and majestic—what does it seek from people? Yet people do not respond with gratitude, diligently cultivating goodness. Though they may not attain the conduct of the middle virtue, they should at least fulfill the lesser virtue. Yet even this they fail to achieve, turning from truth, disobeying teachings and precepts. They think only of desires, wealth, glory, sensual pleasures, profit, treasures, wine, and meat, indulging their hearts without restraint, growing arrogant and extravagant—how can they think of the Dao? If people do not think of the Dao, the Dao does not think of them.",
      "overlap_context": "eaven offers no salvation.\n\nWealth, treasures, and sensual desires are the awls that pierce the eyes and the disasters that harm the body. The wise keep their distance, while fools delight in them. The wise, in all their movements—sitting, rising, sleeping, waking—exercise constant vigilance. Through self-discipline, their bodies remain unharmed, and their blessings become manifest.\n\nYet among those who now uphold the Dao with devotion, not one in ten thousand truly abides. How can this be said?",
      "start_char": 1815,
      "end_char": 3021,
      "start_sentence": 93,
      "end_sentence": 141,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.49484658241272,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\正一法服天师教戒科经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "人之若鱼、道之若水。 鱼得水而生，失水而死，道去人虚，何望久生也。 要在精进存念。 诸贤者欲得保身念行，家居安完，皆去先日所犯过恶，进修后善。 若见人有违失之行，转相劝戒，相教改悔，其功报效，应受福无量。 勿谓道之无形，不可见为，欲傲慢轻易耳。 然欲得恩福，当事精勤，晨夜清静。 若有同义遇难，疾病相救，缓急相恤，不得以智欺愚，乘威诈称，假托鬼神，恐吓厄人。 不得才有小智，称名自大，轻忽愚人，更相毁告，背向妄论，指摘贤者。 不得私情贪狠，敬贵耻贱，乐富弃贫，托望侨气，爱僧二心，欲随情请福，以为惠施，道终不从，鬼不为使，毁败正法耳，反受咎。 当同志相求，同法相好。 若男女不晓书疏者，专心好道，可请明者，听诵经戒，会在静舍，若堂上扫除，烧香，澡洗洁清，男女别坐，俨然正体安神，精思明听，勿妄华言，倾邪不端，游心他念，玩堕睡寐，劳体自疲，虚苦无益。 若能如戒精进不倦，室家受福，天曹吏兵，自来护人，终已无有灾患病痛也。 万物之中以人为贵。 人处天地间，皆知生之日而不知死来之日。 善人恶人，富贵贫贱，各自谓寿命终年，谁欲先穷者，人人所不乐也。 然恶人过积结罪，罪满作病，病成至死，不自知。 唯修善者得福。 人生受命，制之在天。 天实不言，故在圣人。 圣人随世恻隐，不以常存，故遗教戒。 教戒者，欲令人劝进，长生全身，保命无穷。 人皆能奉法不倦，何但保命，乃有延年无穷之福。 此非富贵者货赂求请所能得通也，亦非酒肉祭梼鬼神所降致也。 道人贤者，奉敬教戒，精专勤身，先苦后报，其福应也。 贤愚贵贱皆同，亦愿其所欲耳。 唯道人执志，故能以戒自检，行止举动，爱欲之问，守戒不违，心无邪倾。 若见色利，以戒掩目； 若闻好恶之言，以戒塞耳； 若食甘香之美，以戒杜口； 若愿想财宝，放情爱欲，以戒挫心； 若趣向奸非，意欲恶事，以戒折足。 守之不废，可谓明矣。 当劝进愚冥者。 愚冥者不能承用，无如之何。 以道人常欲有好心，善施惠故也，天道授福。 奉道精进，要当勤身，守之当久，治志当坚，精进专念，莫有不先劳后报，度身神仙。 故有杨公十五奉道，六十未报，修身不倦，至年八十，功满行着，福报无量。 诸贤者奉道，庄事勤身，当如饥渴，欲得饮食； 如遇寒暑，欲得易处； 如作极，欲得休息； 如疲劳，欲眠寐； 如愿想，欲有所得。 念道奉真，欲得度身，如念此诸所欲，勉身如法不倦，获无灾殃、祸害、病痛、忧患，何愿不得，何福不应也。 道出自然，先天地生，号无上玄老太上。 三黑混一，为无上正真之道也。 道弘大，包含天地，变化万神，微布散在八极之外，内潜毫毛之中，成生万物，制御三天，统三万六千神，大无不覆，小无不入，清虚无为，故能长存，含浊而不秽，故为万物母。 天道无亲，惟与善人。 善人保之，以致神仙。 非富贵者求而能得，贫贱者鄙而无与。 能专心好乐，精诚思念，修身行善，则与道合。 然世人多愚，好尚浮伪，游身恣欲於群俗之问，须臾之乐，以快腹目，终不能苦身勤念奉道。 奉道但当积修功德，谦让行仁义，柔弱行诸善，清正无为，初虽勤苦，终以受福，不与俗同。",
      "translated_text": "People are like fish, and the Dao is like water. Fish live when they have water, and die when they lose it; when the Dao departs, a person becomes empty—how can they hope for long life? The key lies in diligent progress and constant mindfulness.\n\nAll worthy ones who wish to preserve their bodies, cultivate conduct, keep their households safe and whole, must first abandon past transgressions and faults, then advance in later goodness. If you see others committing errors or faults, turn to admonish and exhort one another, teaching them to repent and reform. The merit and reward of such acts will bring boundless blessings. Do not say the Dao is formless and thus cannot be seen or served—this is merely arrogance and carelessness. Yet if you seek grace and fortune, you must serve with diligence, maintaining purity day and night.\n\nWhen those of shared commitment encounter hardship, or when illness strikes, aid one another; in times of urgency, relieve one another’s distress. Do not use cunning to deceive the simple, nor exploit power to make false claims, nor invoke ghosts and spirits to frighten and coerce others. Do not, merely possessing slight wit, boast of your name and exalt yourself, belittling the foolish, slandering one another, speaking recklessly, or pointing out the faults of the worthy.\n\nDo not harbor private greed and cruelty, honoring the noble while shaming the lowly, favoring the rich while abandoning the poor, relying on arrogance, or serving two masters with divided loyalty, seeking blessings as you please, thinking it charity. The Dao will never comply, ghosts will not serve you, and you will only destroy the true Dharma, bringing misfortune upon yourself instead.\n\nThose of shared aspiration should seek one another; those of shared Dharma should befriend one another. If men and women are illiterate, yet wholeheartedly devoted to the Dao, they may invite those who are learned to recite scriptures and precepts for them. Gather in a quiet dwelling, or in a hall swept clean, where incense is burned, and all have bathed and purified themselves. Men and women should sit separately, their bodies composed, their spirits settled, their minds focused and attentive. Do not speak frivolously, nor lean toward depravity, nor let your thoughts wander, nor doze or sleep, nor exhaust your body in vain suffering, for it will bring no benefit.\n\nIf you can follow the precepts with diligence and unwavering effort, your household will receive blessings. The celestial officials and guardian soldiers will come to protect you, and in the end, you will be free from disasters, misfortunes, illnesses, and pains.\n\nAmong all things, humans are the most noble. Living between heaven and earth, all know the day of their birth but none know the day of their death. Whether good or evil, rich or poor, noble or lowly, each believes their lifespan will endure to its full term—who would wish to be the first to perish? Yet no one takes joy in this. Still, the wicked accumulate transgressions, and when their sins are complete, illness arises, leading to death, all without self-awareness. Only those who cultivate goodness receive blessings.\n\nHuman life receives its mandate from heaven, and its regulation lies with heaven. Heaven does not speak, so it falls to the sages. The sages, moved by compassion for the world, do not remain constant, and thus leave behind teachings and precepts. These teachings and precepts urge people to advance, to attain long life, preserve their bodies, and secure their lives without end. If all people could uphold the Dharma without weariness, how could they merely preserve their lives? They would gain the boundless blessing of extended years.\n\nThis is not something the wealthy and noble can obtain through bribes or requests, nor can it be summoned by offering wine and meat to ghosts and spirits. Those who follow the Dao—worthy ones—revere and uphold the teachings and precepts, devoting themselves with diligence. Though they may endure hardship first, their reward will follow. The response of blessings is certain. Whether wise or foolish, noble or lowly, all share the same wish. Yet only those who follow the Dao hold fast to their resolve, and thus can use the precepts to restrain themselves. In their conduct and movements, amid love and desire, they keep the precepts without violation, their hearts free from deviance.\n\nWhen they see beauty or profit, they cover their eyes with the precepts; when they hear words of praise or blame, they block their ears with the precepts; when they taste sweet and fragrant delicacies, they seal their mouths with the precepts; when they crave wealth and treasures, indulging in love and desire, they subdue their hearts with the precepts; when they incline toward wickedness, intending evil deeds, they halt their steps with the precepts. If they uphold these without fail, they may be called enlightened. They should urge the ignorant and benighted to advance. Though the benighted cannot accept and apply these teachings, there is nothing to be done. Yet those who follow the Dao always wish to have good hearts and bestow kindness, for the Way of Heaven grants blessings.\n\nThose who follow the Dao with diligence must exert themselves, uphold it for long, cultivate their resolve with firmness, and advance with single-minded devotion. There is none who does not first labor and later receive reward, crossing over to become an immortal of body and spirit. Thus, Master Yang followed the Dao for fifteen years without reward, cultivating himself without weariness. By the age of eighty, his merit was complete, his conduct renowned, and his blessings boundless.\n\nAll worthy ones who follow the Dao, serving with reverence and diligence, should be like one who is starving or thirsty, longing for food and drink; like one who encounters cold or heat, desiring a change of place; like one who has labored to exhaustion, longing for rest; like one who is weary, longing for sleep; like one who has a wish, longing for its fulfillment. When you think of the Dao and revere the True, desiring to transcend the mortal body, think of these longings. Exert yourself according to the Dharma without weariness, and you will obtain freedom from disasters, misfortunes, illnesses, pains, and sorrows. What wish will not be fulfilled? What blessing will not respond?\n\nThe Dao emerges from spontaneity, born before heaven and earth, named the Most High, Mysterious, and Venerable Supreme. The Three Blacks merge into One, becoming the Most High and Perfectly True Dao. The Dao is vast and great, encompassing heaven and earth, transforming the myriad spirits, subtly spreading beyond the eight directions, inwardly hidden within the finest hair. It gives life to the myriad things, governs the Three Heavens, and commands the thirty-six thousand spirits. It covers all that is great and enters all that is small. Serene and without action, it endures forever. Though it embraces the turbid, it is not defiled, and thus is the mother of the myriad things.\n\nThe Way of Heaven is impartial, yet it favors the good. The good preserve it and thereby attain immortality. This is not something the rich and noble can obtain by seeking, nor can the poor and lowly be excluded by disdain. If one can wholeheartedly delight in it, with sincere devotion and mindfulness, cultivating the body and practicing goodness, then one will unite with the Dao.\n\nYet most people in the world are foolish, prizing superficiality and falsehood. They indulge their bodies and desires amid the common crowd, seeking fleeting pleasures to gratify their bellies and eyes, yet they cannot endure hardship or diligently think of and follow the Dao. Those who follow the Dao must only accumulate merit and virtue, practice humility and yielding, act with benevolence and righteousness, cultivate gentleness and all goodness, and maintain purity and non-action. Though they may endure hardship at first, they will ultimately receive blessings, unlike those who follow the common way.",
      "overlap_context": "ligently cultivating goodness. Though they may not attain the conduct of the middle virtue, they should at least fulfill the lesser virtue. Yet even this they fail to achieve, turning from truth, disobeying teachings and precepts. They think only of desires, wealth, glory, sensual pleasures, profit, treasures, wine, and meat, indulging their hearts without restraint, growing arrogant and extravagant—how can they think of the Dao? If people do not think of the Dao, the Dao does not think of them.",
      "start_char": 3021,
      "end_char": 4236,
      "start_sentence": 142,
      "end_sentence": 194,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.57555079460144,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\正一法服天师教戒科经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "如人但贪须臾之利，命没之后，身为粪土，魂神同朽。 道人与俗相去远矣。 何以言之？ 道人清正，名上属天； 俗人秽浊，死属地官，岂不远乎。 愚人守俗，不念奉道，可谓大迷也。 夫人各有眼目鼻口心意两足，其贤愚之行各异者，目专视利色，耳听言之好恶，鼻悦於甘香之气，口贪五味之美，心专纵恣所欲，两足随意导身趣向奸非。 贤者不然，目不视所好，耳不外听邪恶之言，鼻不通臭香之气，口不乐滋味之美，心不想可欲之快，足不趋恶事为非，此道人所行。 道人亦知诸所欲为快，以戒制情，故不犯恶。 善积行着，与道法相应，受福无极。 愚人所知恶速祸，不能专戒，与道相反，何望得福。 若欲得福，何不效道人乎！ 奉道清正无为，惟当精进，修行积善耳。 亦无问为限，亦无水火为难，亦无贫贱见逆，亦无豪强相夺，亦无富贵争进，亦无作役负檐之苦，何不壮事专精，奉道勤身乎！ 道人百行当备，千善当着，虽有九百九十九善，一善未满，中为利动，皆弃前功。 治身关念，守戒不废，乃得度世。 道人贤者，可勤行焉。 大道家令戒 大道者，包囊天地，系养群生，御万机者也。 无形无像，混混沌沌，然生百千万种，非人所能名。 自天地以下，皆道所生杀也。 道授以微气，其色有三，玄元始气是也。 玄青为天，始黄为地，元白为道也。 三气之中，制上下，为万物父母，故为至尊至神，自天地以下，无不受此气而生者也。 诸长久之物，皆能守道含气，有精神，乃能呼吸阴阳。 道生天，天生地，地生人，皆三气而生。 吕二如九，故人有九孔九气。 九气通则五藏安，五藏安则六府定，六府定则神明，神明则亲道。 是故人行善守道，慎无失生道，生道无失德。 三三者不离，故能与天地变易。 《易》称，有天地，然后有万物； 有万物，然后有男女； 有男女，然后有夫妇； 有夫妇，然后有父子。 父子者，欲系百世，使种姓不绝耳。 下古世薄，多愚浅，但爱色之乐，淫於邪伪，以成耳目，淫溢女色，精神勃乱，贪惜货赂，沙气发上，自生百病。 至於黄帝以来，民多机巧，服牛乘马，货赂为官，稍稍欲薄，尽于五帝。 夏商周三代，转见世利。 秦始五溜，更相克害。 有贼死者，万亿不可胜数。 皆由不信其道。 道乃世世为帝王师，而王者不能尊奉，至倾移颠陨之患，临危济厄，万无一存。 道重人命，以周之末世始出，奉道於琅琊，以授干吉。 太平之道起於东方，东方始欲济民於涂炭，民往往欲信道。 初化气微，听得饮食。 阴阳化宽，至於父母兄弟酌祭之神。 后道气当布四海，转生西关，由以太平不备，悉当须明师口诀，指谪为符命。 道复作《五千文》，由神仙之要，其禁转切急，指劲治身养生之要，神仙之说，付关令尹喜略至，而世多愚，心复问问，死者如崩，万无有全。 西入胡授以道法，其禁至重，无阴阳之施，不杀生饮食。 胡人不能信道，遂乃变为真仙，仙人交与天人，浮游青云之问，故翔弱水之滨。 胡人叩头数万，真镜照天，髡头剔须，愿信真人，於是真道兴焉。 非但为胡不为秦，秦人不得真道。 五霸世衰，赤汉承天，道佐代乱，出黄石之书以授张良。 道亦形变，谁能识真。 汉世既定，末嗣纵横，民人趣利，强弱忿争，道伤民命，一去难还，故使天授气治民，曰新出老君。",
      "translated_text": "Those who merely covet fleeting gains will, after their lives end, become dung and dust, their souls and spirits rotting away. How vastly different are Daoists from the common folk! Why say so? Daoists are pure and upright, their names ascending to belong to Heaven; the vulgar are filthy and turbid, their deaths belonging to the earthly officials—how distant the difference! Fools cling to worldly ways and do not think of following the Dao; this is truly great delusion.\n\nEvery person has eyes, ears, a nose, a mouth, a mind, and two feet, yet the conduct of the wise and the foolish differs: the eyes fixate on profit and beauty, the ears heed pleasing or hateful words, the nose delights in sweet fragrances, the mouth craves the finest flavors, the mind indulges every desire, and the feet follow wherever whim leads, even toward wickedness and wrongdoing. The wise are not so—their eyes do not gaze upon what they desire, their ears do not heed evil or corrupt speech, their noses do not seek foul or fragrant scents, their mouths do not delight in rich flavors, their minds do not dwell on gratifying desires, and their feet do not rush toward evil deeds or wrongdoing. Such is the conduct of Daoists. Though Daoists know the pleasures of desire, they restrain their passions with precepts and thus do not commit evil. Their accumulated goodness becomes manifest, aligning with the laws of the Dao, and they receive boundless blessings. Fools know that evil brings swift misfortune, yet they cannot steadfastly uphold the precepts; opposing the Dao, how can they hope for blessings? If one desires blessings, why not emulate the Daoist?\n\nTo follow the Dao is to be pure, upright, and free from contrivance; one must only be diligent, cultivate conduct, and accumulate goodness. There is no fixed limit to this, nor is it hindered by water or fire, nor obstructed by poverty or low status, nor seized by the powerful, nor contested by the wealthy, nor burdened by labor or toil. Why not resolutely devote oneself to the Dao with wholehearted diligence?\n\nA Daoist’s hundred deeds must be complete, their thousand virtues manifest. Though they may have nine hundred and ninety-nine virtues, if one remains unfulfilled and they are swayed by profit, all prior merit is discarded. Only by guarding the mind, upholding the precepts without fail, can one attain liberation from the world. Let the wise Daoist be diligent in practice.\n\n**Precepts of the Great Daoist School**\nThe Great Dao encompasses Heaven and Earth, nurturing all living beings and governing the myriad affairs. It is formless and imageless, vast and undifferentiated, yet it gives rise to the hundred thousand myriad things, beyond what mortals can name. From Heaven and Earth downward, all are born and perish by the Dao. The Dao bestows upon them a subtle qi, which manifests in three colors: the Mysterious, the Primordial, and the Originating qi. The Mysterious is blue and becomes Heaven; the Originating is yellow and becomes Earth; the Primordial is white and is the Dao itself. Within these three qi, the upper and lower are regulated, becoming the parents of the myriad things. Thus, they are most revered and divine; from Heaven and Earth downward, nothing is born that does not receive this qi.\n\nAll long-enduring things guard the Dao and contain qi, possessing spirit, and thus can inhale and exhale yin and yang. The Dao gives birth to Heaven, Heaven gives birth to Earth, and Earth gives birth to humanity—all arise from these three qi. As two times three makes nine, humans have nine orifices and nine qi. When the nine qi flow freely, the five viscera are at peace; when the five viscera are at peace, the six bowels are settled; when the six bowels are settled, the spirit is luminous; and when the spirit is luminous, it draws near to the Dao. Therefore, those who practice goodness and uphold the Dao must carefully preserve the Way of life, and the Way of life must not lose its power. These three—Heaven, Earth, and humanity—do not depart from one another, and thus can transform along with Heaven and Earth.\n\nThe *Book of Changes* states: \"With Heaven and Earth, there come the myriad things; with the myriad things, there come male and female; with male and female, there come husband and wife; with husband and wife, there come father and son.\" The bond of father and son is meant to extend through a hundred generations, ensuring the lineage does not perish. Yet in later ages, the world grew shallow, and people became foolish, delighting only in sensual pleasures, indulging in depravity and falsehood, gratifying their ears and eyes, wallowing in lust and beauty, their spirits in turmoil, coveting wealth and bribes, their qi rising in fury, and thus bringing forth a hundred illnesses.\n\nFrom the time of the Yellow Emperor onward, people grew increasingly cunning, harnessing oxen and riding horses, using wealth to gain office, their desires gradually thinning until, by the Five Emperors, they were utterly dissipated. The Three Dynasties of Xia, Shang, and Zhou saw the world turn toward profit. The Qin began the Five Streams of decline, each harming the next. Those who died by violence numbered in the tens of thousands, beyond counting—all because they did not believe in the Dao. The Dao has been the teacher of emperors and kings through the ages, yet rulers failed to revere and uphold it, leading to the calamities of collapse and ruin. In times of peril, when all seemed lost, not one in ten thousand was saved.\n\nThe Dao values human life, and thus, at the end of the Zhou dynasty, it emerged in Langye, bestowing its teachings upon Gan Ji. The Way of Great Peace arose in the East, beginning to deliver the people from suffering. Many wished to believe in the Dao, but its transforming influence was still faint, and only those who listened were granted food and drink. The transformations of yin and yang grew more lenient, extending even to the spirits of parents, brothers, and ancestral sacrifices. Later, the qi of the Dao was to spread across the Four Seas, shifting to the Western Pass. Yet the Great Peace was not yet complete, and all required the oral instructions of a wise teacher, with omens and signs serving as mandates.\n\nThe Dao then composed the *Five Thousand Character Text*, containing the essentials of immortality. Its prohibitions grew stricter, its instructions more forceful for cultivating the body and nurturing life. The teachings on immortality were entrusted to the Pass Keeper Yin Xi, but the world was filled with fools, their hearts hesitant and doubtful. The dead piled up like landslides, and not one in ten thousand was preserved.\n\nEntering the Western lands, the Dao’s teachings were bestowed upon the Hu people, its prohibitions most severe: no yin-yang union, no killing of living beings for food. The Hu could not believe in the Dao, and so it transformed into the teachings of the Perfected Immortals. The immortals communed with the heavenly beings, soaring amidst the azure clouds, dwelling by the shores of the Weak Waters. The Hu people kowtowed tens of thousands of times, their true mirrors reflecting the heavens. They shaved their heads and plucked their beards, vowing to believe in the Perfected Ones, and thus the True Dao flourished. Not only did the Hu fail to become like the Qin, but the Qin people themselves could not attain the True Dao.\n\nAs the Five Hegemons’ era declined, the Red Han inherited the Mandate of Heaven. The Dao aided in overcoming chaos, bestowing the *Yellow Stone Text* upon Zhang Liang. The Dao also took on forms and changes—who could recognize the true? After the Han dynasty was established, its later heirs acted recklessly, the people pursuing profit, the strong and weak clashing in anger. The Dao grieved for human life, and once departed, it was difficult to return. Thus, Heaven bestowed its qi to govern the people, and the newly emerged Lord Lao was born.",
      "overlap_context": "desires amid the common crowd, seeking fleeting pleasures to gratify their bellies and eyes, yet they cannot endure hardship or diligently think of and follow the Dao. Those who follow the Dao must only accumulate merit and virtue, practice humility and yielding, act with benevolence and righteousness, cultivate gentleness and all goodness, and maintain purity and non-action. Though they may endure hardship at first, they will ultimately receive blessings, unlike those who follow the common way.",
      "start_char": 4236,
      "end_char": 5478,
      "start_sentence": 195,
      "end_sentence": 249,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.20427656173706,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\正一法服天师教戒科经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "古闷鬼者何？ 人但畏鬼不信道，故老君授与张道陵为天师，至尊至神，而乃为人之师。 汝曹辈足可知之，为尊於天地也，而故闷闷，日一日，月一月，岁一岁，贪纵口腹，放恣耳目，不信道，死者万数，可不痛哉！ 道以汉安元年五月一日，於蜀郡临叩县渠停赤石城造出正一盟威之道，与天地券要，立二十四治，分布玄元始气治民。 汝曹辈复不知道之根本，真伪所出，但竞贪高世，更相贵贱，违道叛德，欲随人意。 人意乐乱，使张角黄巾作乱。 汝曹知角何人？ 自是以来，死者为几千万人邪。 道使末嗣分气治民，汉中四十余年，道禁真正之元，神仙之说，道所施行，何以《想尔》、《妙真》，三灵七言，复不真正，而故谓道欺人，一反哉可伤。 至义国损颠，流移死者以万为数，伤人心志。 自从流徙以来，分布天下，道乃往往救汝曹之命。 或决气相语，或有故臣令相端正，而复不信，甚可哀哉。 欲朝当先暮，欲太平当先乱。 人恶不能除，当先兵病水旱死。 汝曹薄命，正当与此相遇。 虽然，吉人无咎。 昔时为道，以备今来耳。 未至太平而死，子孙当蒙天恩。 下世浮薄，持心不坚，新故民户，见世知变，便能改心为善，行仁义，则善矣。 可见太平，度脱厄难之中，为后世种民。 虽有兵病水害之灾，临危无咎，故曰道也。 子念道，道念子； 子不念道，道不念子也。 故民诸职男女，汝曹辈庄事修身洁己，念师奉道，世薄乃尔，夫妇父子室家相守，当能久。 而不能相承事清、贞孝、顺道、敬师、礼鬼、从神乎！ 今已去天下之扰扰如羊，四方兵病恶气流行，念今日之善，尊天敬神，爱生行道，念为真正，道即爱子，子不念道，道即远子，卒近灾害，慎无复悔，悔当苦在后身。 吾晨夜周流四海之内，行於八极之外，欲令君仁、臣忠、父慈、子孝、夫信、妇贞、兄敬、弟顺，天下安静。 故民浑浊日久，虽闻神仙之语、长生之言，心迷意惑，更怀不信。 或行善未知真正，愚愚相教，邪邪相传，不自屏恶，更相谤讪，君臣争势，父子不亲，夫妇相咱，兄弟生分，因公行私，男女轻淫，违失天地，败乱五常，外是内非，乱道纪纲，至今三天患怒，杀气纵横，五星失度，太白扬光，变风冬雷，彗孛低昂。 天垂悬像以示人，人不信道，道志，死者当气在幽谷。 《妙真》自吾所作，《黄庭》三灵七言，皆训喻本经，为《道德》之光华。 道不欲指形而名之，贤者见一知万，譬如识音者。 道在一身之中，岂在他人乎。 汝曹学善，夫根本不承经言，邪邪相教，就伪弃真。 吾昔皆录短纸，杂说邪文，悉令消之。 祭酒无状，故俾挟深藏，于今常存，使今世末学之人，好尚浮说，指伪名真，此皆犯天禁，必当中伤，终不致福也，但劳汝耳。 无事自勤苦，不如任心恣意以快。 汝不须为天考，不须轻易官法也。 化以太平，人当助天为太平之行。 天聪明，自我民聪明。 中五正则二五定，亦从人为向应耳。 诸新故民户，男女老壮，自今正元二年正月七日已去，其能壮事守善，能如要言，臣忠子孝，夫信妇贞，兄敬弟顺，内无二心，便可为善，得种民矣。 种民难中亦当助其力，若好生乐道，无老壮端心正意，助国扶命，善恶神明具自知之，不可复为妄想，或以邪伪之人言，言我知道，以道教人。",
      "translated_text": "What is the \"Ancient Muddled Ghost\"? People fear ghosts but do not believe in the Dao, so Lord Lao bestowed upon Zhang Daoling the title of Celestial Master, most revered and divine, to serve as the teacher of humanity. You all should understand this—his honor surpasses that of heaven and earth—yet you remain obstinately confused, day after day, month after month, year after year, indulging in gluttony, yielding to the desires of ear and eye, disbelieving in the Dao. The dead number in the tens of thousands—how can this not be grievous?\n\nIn the fifth month of the first year of *Han’an*, in the city of Chishi within the Linju County of Shu Commandery, the Dao of *Zhengyi Mengwei* was revealed, forging a covenant with heaven and earth. Twenty-four *zhi* were established, distributing the primordial *qi* of the Mysterious Origin to govern the people. Yet you still fail to grasp the root of the Dao, the source of truth and falsehood, competing only for worldly prestige, distinguishing between noble and base, defying the Dao and betraying virtue, seeking only to follow human whims. Human desires delight in chaos, and thus Zhang Jiao and the Yellow Turbans rose in rebellion. Do you know who Zhang Jiao was? Since then, how many tens of millions have died?\n\nThe Dao caused later heirs to divide *qi* to govern the people. For over forty years in the region of Han, the Dao’s prohibitions preserved the true origin of the numinous immortals. Yet what of the *Xianger*, the *Miaozhen*, the *Three Spirits and Seven Words*—were these not true and upright? To call the Dao deceitful is a reversal most lamentable. When the state of Yi collapsed, those displaced and dead numbered in the tens of thousands, wounding the hearts and wills of the people. Since the time of exile and dispersal across the land, the Dao has repeatedly saved your lives. Some resolved disputes through the exchange of *qi*; others, through the commands of former ministers, sought to rectify themselves. Yet you still do not believe—how pitiful!\n\nIf you desire dawn, you must first endure dusk; if you seek great peace, you must first endure chaos. If human evil cannot be eradicated, then war, plague, flood, and drought will bring death. You, with your meager fate, are destined to encounter these trials. Nevertheless, the virtuous shall suffer no harm. The Dao was cultivated in former times precisely to prepare for this day. Those who die before the advent of great peace shall have their descendants receive heaven’s grace.\n\nIn this degenerate age, with hearts unsteady, whether old or new households, if you perceive the changes of the world and reform your hearts to do good, practicing benevolence and righteousness, then goodness shall prevail. You may yet witness great peace, escape the throes of calamity, and become the seed-people of future generations. Even amid the disasters of war, plague, and flood, you shall remain unharmed at the brink of peril—for this is the Dao.\n\nIf you think of the Dao, the Dao will think of you; if you do not think of the Dao, the Dao will not think of you. Therefore, all people—men and women alike—you must solemnly cultivate yourselves, purify your conduct, honor your teachers, and uphold the Dao. In this shallow age, if families—husbands and wives, parents and children—remain steadfast together, they may endure. Yet how can you not inherit the practices of purity, integrity, filial piety, obedience to the Dao, reverence for teachers, veneration of ghosts, and devotion to the gods?\n\nNow the world’s turmoil has departed like scattered sheep. War, plague, and malign *qi* spread across the four directions. Reflect upon the goodness of this day: honor heaven, revere the gods, cherish life, and practice the Dao. Strive to be true and upright, and the Dao will cherish you. If you do not think of the Dao, the Dao will distance itself from you, and calamity will swiftly draw near. Beware—do not regret later, for regret will bring suffering in future lives.\n\nI traverse the four seas by day and night, journeying beyond the eight directions, desiring that rulers be benevolent, ministers loyal, fathers kind, children filial, husbands faithful, wives chaste, elder brothers respectful, and younger brothers obedient—so that the world may be at peace. Yet the people have long been mired in turbidity. Though they hear the words of immortals and the teachings of longevity, their hearts are deluded, their minds confused, and they persist in disbelief. Some practice goodness without knowing true uprightness; the foolish instruct the foolish, the wicked transmit wickedness. They do not reject evil but instead slander one another. Rulers and ministers vie for power, fathers and sons grow estranged, husbands and wives quarrel, brothers become divided. They exploit public office for private gain, men and women indulge in licentiousness, transgressing heaven and earth, disrupting the Five Constants. Outwardly correct but inwardly corrupt, they disorder the principles of the Dao. Thus, the Three Heavens grow indignant, murderous *qi* rages unchecked, the Five Planets lose their courses, Venus shines fiercely, winter winds howl with thunder, and comets rise and fall. Heaven hangs omens to warn humanity, yet people do not believe in the Dao. Those who die with Daoist aspirations shall have their *qi* linger in dark valleys.\n\nThe *Miaozhen* was composed by me, and the *Huangting*, the *Three Spirits and Seven Words*, are all instructive scriptures, the radiance of the *Daode*. The Dao does not wish to be named by form; the wise, seeing one, understand ten—like those who recognize sound. The Dao resides within your own body; how could it be found in another?\n\nYet you, in learning goodness, fail to grasp the root of the scriptures. The wicked instruct the wicked, embracing falsehood and discarding truth. I once recorded miscellaneous writings on short scrolls, filled with heterodox texts, and ordered them all destroyed. The *Jijiu* were unworthy, so I had them conceal these deeply, preserving them to this day. Now, the scholars of this degenerate age favor superficial doctrines, mistaking falsehood for truth. All such acts violate heaven’s prohibitions and will surely bring harm, never blessing. It is better to follow your heart’s desires than to labor in vain.\n\nYou need not trouble yourselves with heavenly judgment or lightly transgress the laws of the state. To bring about great peace, people must assist heaven in its work. Heaven is enlightened, and so too are the people enlightened. When the Five Constants are rectified, the Two Principles shall be settled—this depends on human effort.\n\nAll households, old and new—men and women, young and old—from the seventh day of the first month of the second year of *Zhengyuan* onward, if you can vigorously uphold goodness, adhere to these essential teachings, serve as loyal ministers and filial children, maintain faithful husbands and chaste wives, respectful elder brothers and obedient younger brothers, and harbor no duplicity within, then you may become good people and be counted among the seed-people. Even in times of hardship, you must aid them with your strength. If you delight in life and the Dao, regardless of age, with steadfast hearts and upright intentions, assist the state and sustain destiny, then the gods of good and evil shall know your deeds. Do not indulge in vain imaginings or heed the words of deceitful men who claim to know the Dao and teach it to others.",
      "overlap_context": " inherited the Mandate of Heaven. The Dao aided in overcoming chaos, bestowing the *Yellow Stone Text* upon Zhang Liang. The Dao also took on forms and changes—who could recognize the true? After the Han dynasty was established, its later heirs acted recklessly, the people pursuing profit, the strong and weak clashing in anger. The Dao grieved for human life, and once departed, it was difficult to return. Thus, Heaven bestowed its qi to govern the people, and the newly emerged Lord Lao was born.",
      "start_char": 5478,
      "end_char": 6705,
      "start_sentence": 250,
      "end_sentence": 292,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.032302141189575,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\正一法服天师教戒科经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "诸职男女官，昔所拜署，今在无丧。 自从太和五年以来，诸职各各自置，置不复由吾气，真气领神选举。 或听决气，信内人影梦，或以所奏，或迫不得已，不按旧仪，承信特说。 或一治重官，或职治空决。 受职者皆滥对天地气候，理三官文书，事身厚食。 ○ 奉及诸闲官无文书之职，皆当随时坐起，名荷天官，常处神明之坐，以侨世俗非。 忠臣孝子之道，曾不知悉，语闻灾责，已如逢灾遇害，如反怨，妄言奉道无益，此乃有罪三千，从尔如己也。 吾昔勤勤忧济汝曹之命，欲令见太平耳，而复求太平耶？ 昔汉嗣末世，豪杰纵横，强弱相陵，人民诡点，男女轻淫，政不能济，家不相禁，抄盗城市，怨枉小人，更相仆役，蚕食万民，民怨思乱，逆气干天，故令五星失度，彗孛上扫，火星失辅，强臣分争，群奸相将，百有余年。 魏氏承天驱除，历使其然，载在河雒，悬象垂天，是吾顺天奉时，以国师命武帝行天下，死者填坑。 既得吾国之光，赤子不伤身，重金累紫，得寿遐亡。 七子五侯为国之光，将相缘属，侯封不少，银铜数千，父死子系，弟亡兄荣，沐浴圣恩。 汝辈岂志德知真所从来乎？ 昔日开门教之为善，而反不相听，从今吾避世，以汝付魏，清政道治，千里独行，虎狼伏匿，外不闭门。 奸臣小坚，不知天命逆顺，强为妖妄，造者辄凶，及于子孙。 汝辈岂知其原耶？ 从比年以来，四方疾病，扫除群凶，但杀恶人耳。 其守道乐善，天自护之。 如赤子临危度脱，如舌之避齿，汝曹岂复知之耶？ 诸职自今以后，不得妄自署置为职也。 复违吾，中伤勿怨。 祭酒治病，病来复差，既差复病，此为恶人，勿复医治之。 但当户户自相化以忠孝，父慈子孝，夫信妇贞，兄敬弟顺，朝暮清挣，断绝贪心，弃利去欲，改更恶肠，怜贫爱老，好施出让，除去淫拓，喜怒情念，常和同腹目，助国壮命，弃往日之恶，从今日之善行，灾消无病，得为后世种民。 民勿怨贫苦，贪富乐尊贵。 汝耳目闻见，从古以来，富贵者久乎？ 财弃於地，身死於市。 以此观之，故谚言：死人不如生鼠。 得之在命，求之以道。 道隐无名，名者伐身之斧。 善行无辙边，欲令人不见其踪迩。 为道当治身养生求福耳，而教人以纵己，纵己则人见其迩，伐身之斧利矣。 伐身之斧利，则福去而祸来，可不慎欤。 可不畏欤。 天地所以长久者，以其无为。 无为者，无不为也，但使人不见其有迩，乃能为奇耳。 俗人辈，汝曹状可笑也。 才有小善，欲使人知之； 才有粉米之异，欲使人贤之。 此皆非道之益，已皆犯禁矣。 今传吾教令，新故民皆明吾心，勿相负也。 天师教 今故下教作七言，谢诸祭酒男女民。 天地混籍气如姻，四时五行转相因。 天地合会无人民，星辰倒错为人先。 二十八宿毕参辰，荧惑太白出其问。 若有改变垂象先，太平之基不能眠。 是令轴轲不可言，发言出教心意烦。 走气八极周复还，观视百姓夷胡秦。 不见人种但尸民，从心恣意劳精神。 五藏虚空为尸人，命不可赎属地官。 身为鬼伍入黄泉，思而改悔从吾言。 可得升度为仙人，节慎阴阳保爱神。 五藏六府有君臣，积在微微为真人。 神思愁惨不能眠，游戏百姓五藏问。 还与真人共语言，心中真人来上天。",
      "translated_text": "All male and female officials who received appointments in the past and remain in office without bereavement—since the fifth year of *Taihe*, each has established their own positions, no longer governed by my *qi* or guided by the true *qi* that directs the spirits in selection. Some have heeded *qi*-based decisions, trusted the visions of inner attendants, or acted under compulsion, unable to follow old protocols, yielding to persuasive claims. Some hold multiple offices simultaneously, while others occupy positions in name only. Those who accept such appointments recklessly defy the *qi* of Heaven and Earth, mismanage the documents of the Three Offices, and indulge in lavish feasting.\n\nAs for those in honorary or idle positions without documentary duties, they must rise and sit in accordance with the seasons, bearing the title of Heaven’s officials and abiding in the presence of the divine, to counter the errors of the secular world. Yet they remain ignorant of the Way of loyal ministers and filial children. When they hear of disasters and reprimands, they react as if personally afflicted, even resenting and falsely claiming that devotion to the Dao brings no benefit. Such actions incur the three thousandfold transgressions, which rebound upon themselves as if self-inflicted.\n\nI once labored diligently to preserve your lives, hoping you would witness the Great Peace—yet now you seek it anew? In the late Han dynasty, when the imperial line waned, heroes ran rampant, the strong oppressed the weak, and the people grew cunning and deceitful. Men and women indulged in wantonness, governance failed, households could not restrain themselves, bandits plundered cities, and the resentful oppressed turned upon one another in servitude, devouring the common folk. The people’s grievances stirred rebellion, and perverse *qi* offended Heaven. Thus, the five planets lost their courses, comets swept the skies, Mars abandoned its station, powerful ministers vied for dominance, and traitors conspired for over a hundred years.\n\nThe Wei house, entrusted by Heaven to purge these ills, acted as destiny decreed. Recorded in the Yellow River and Luo River diagrams, celestial signs hung in the heavens—I, in obedience to Heaven and the times, commanded Emperor Wu as the state preceptor to traverse the land, filling pits with the dead. Once my state’s radiance was secured, the people suffered no harm, amassing gold and purple honors, and attaining long life. The seven sons and five marquises became the state’s glory, with generals, ministers, and kinsmen enfeoffed in abundance, their silver and bronze counted in the thousands. Fathers died and sons succeeded, younger brothers perished and elder brothers prospered, all bathed in sagely grace. Yet do you truly understand whence virtue and truth arise?\n\nIn the past, I opened the gates to teach goodness, but you refused to heed. From now on, I withdraw from the world, entrusting you to the Wei. With pure governance and Daoist rule, one may walk a thousand *li* alone, tigers and wolves cower in hiding, and doors need not be barred. Yet petty officials, ignorant of Heaven’s mandate and the order of fate, persist in perverse delusions. Those who instigate such things meet misfortune, even extending to their descendants. Do you not grasp the root of this?\n\nIn recent years, plagues have swept the land, eradicating the wicked—only the evil are slain. Those who uphold the Dao and delight in goodness are protected by Heaven, like an infant rescued from peril or the tongue avoiding the teeth. Do you not yet understand?\n\nFrom this day forward, no official may presumptuously appoint themselves to office. Should you defy me again, do not complain of harm. When a *jijiu* treats an illness and the patient recovers, only to fall ill again, such a person is wicked—do not treat them further.\n\nInstead, let every household transform itself through loyalty and filial piety: fathers kind, children filial; husbands faithful, wives chaste; elder brothers respectful, younger brothers obedient. Morning and night, purify yourselves, sever greed, abandon profit and desire, reform your wicked hearts, pity the poor and cherish the elderly, practice generosity and yielding, cast aside licentiousness and recklessness, temper joy and anger, and maintain harmony in thought and gaze. Assist the state and strengthen destiny, forsake past evils, and embrace present goodness. Thus, disasters will vanish, illness will cease, and you may become the seed-people of future generations.\n\nDo not resent poverty or hardship, nor covet wealth and honor. What your ears and eyes have witnessed since ancient times—has wealth and nobility ever endured? Wealth is abandoned to the earth, bodies perish in the marketplace. Hence the saying: \"The dead are no better than living rats.\" Attainment lies in destiny, and destiny is sought through the Dao. The Dao is hidden and nameless; names are the axes that hew the self. Good deeds leave no tracks, desiring to remain unseen. To practice the Dao is to cultivate the self, nurture life, and seek blessings—not to indulge oneself while teaching others. Indulgence makes one’s faults visible, sharpening the axe that hews the self. When the axe is sharp, blessings depart and calamities arrive. Can one not be cautious? Can one not stand in awe?\n\nHeaven and Earth endure because they act without contrivance. To act without contrivance is to achieve all things, yet let none perceive your traces—only then can wonders arise. You, the common folk, are laughable indeed. At the slightest good deed, you seek recognition; at the slightest distinction, you crave praise. These bring no benefit to the Dao and violate its prohibitions.\n\nNow I transmit my teachings so that all, new and old, may understand my heart. Do not betray this trust.\n\nThe Celestial Master’s Teaching\nNow, therefore, I issue this instruction in seven-character verse, to thank all *jijiu* and the male and female people:\n\nHeaven and Earth blend their *qi* like mist,\nThe four seasons and five phases turn in mutual dependence.\nWere Heaven and Earth to unite without people,\nStars and constellations would fall into chaos, preceding mankind.\nThe twenty-eight lodges complete their cycles,\nMars and Venus emerge in their midst.\nShould signs change and portents appear,\nThe foundation of Great Peace cannot rest.\nThus the axle creaks, unspeakable,\nWords and decrees weigh heavy on the heart.\nThe *qi* courses to the eight extremes and returns,\nSurveying the people of the Yi, Hu, and Qin.\nNo true people are seen—only corpse-people,\nWho follow their hearts’ desires, wasting their spirits.\nTheir five viscera hollow, they become corpse-people,\nTheir lives irredeemable, claimed by the Earth Office.\nTheir bodies join the ghostly ranks in the Yellow Springs.\nYet if they reflect, repent, and follow my words,\nThey may ascend and transcend, becoming immortals,\nCautiously guarding yin and yang, preserving their spirits.\nThe five viscera and six bowels have their rulers and ministers,\nAccumulating subtly to become true people.\nIf the spirit is sorrowful and sleepless,\nRoaming among the people, inquiring of the five viscera,\nIt returns to speak with the true person—\nThe true person within the heart ascends to Heaven.",
      "overlap_context": "ent younger brothers, and harbor no duplicity within, then you may become good people and be counted among the seed-people. Even in times of hardship, you must aid them with your strength. If you delight in life and the Dao, regardless of age, with steadfast hearts and upright intentions, assist the state and sustain destiny, then the gods of good and evil shall know your deeds. Do not indulge in vain imaginings or heed the words of deceitful men who claim to know the Dao and teach it to others.",
      "start_char": 6706,
      "end_char": 7940,
      "start_sentence": 293,
      "end_sentence": 347,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.305482149124146,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\正一法服天师教戒科经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "绛黄单衣三缝冠，佩天玉符跪吾前。 陈说百姓道万民，功过进退有明文。 阳平治 教谢二十四治、五气中气、领神四部行气、左右监神、治头祭酒、别治主者、男女老壮散治民：吾以汉安元年五月一日，从汉始皇帝王神气受道，以五斗米为信，欲令可仙之士皆得升度。 汝曹辈乃至尔难教，叵与共语，反是为非，以曲为直，千载之会，当奈汝曹何。 吾从太上老君周行八极，按行民问，选索种民，了不可得。 百姓，汝曹无有应人种者也。 但贪荣富、钱财、谷帛、锦绮、丝绵，以养妻子为务。 掠取他民户赋，敛索其钱物，掠使百姓，专作民户，修农锻私，以养妻奴，自是非他，欲得功名，荣身富己，苟贪钱财，室家不和，娠咱为先、男女老壮更相说道，转相诽谤，溢口盈路，背向异辞，言语不同，转相说咱，不恤鬼神，以忧天道，令气错乱，罪坐在阿谁？ 各言秘教，推论旧事，吾不能复忍汝辈也。 欲持汝辈应文书，颇知与不？ 祭酒主者、男女老壮，各尔愤愤，与俗无别，口是心非，人头虫心，房室不节，纵恣淫情，男女老壮不相呵整。 为尔愤愤，群行混浊，委托师道，老君太上，推论旧事，摄纲举网，前欲推治，诸受任主者、职治祭酒，十人之中诛其三四，名还天曹，考掠治罪，汝辈慎之。 气将欲急，远不过一年、二年、三年之中，当令汝曹闻知，当令汝辈眼见，可不慎之。 诸祭酒主者中，颇有旧人以不？ 从建安、黄初元年以来，诸主者祭酒，人人称教，各作一治，不复按旧道法为得尔。 不令汝辈按吾阳平、鹿堂、鹤呜教行之。 汝辈所行，举旧事相应与？ 不吉，吾有何急？ 急转着治民，次气下教，语汝曹辈，老君太上转相督，欲令汝曹人人用意，勤心努力，复自一劝，为道尽节，劝化百姓。 天师五言牵三诗 牵三复牵一，披云朗白日。 三灾荡秽累，约当被中出。 牵三复牵二，荣华不足利。 若欲入五难，必令精诚至。 牵三复牵三，酒肉不足甘。 洗濯素丝质，界苦就朱蓝。 牵三复牵四，妙法冥中秘。 希仰神灵降，一心莫有二。 牵三复牵五，道士出蓬户。 脱落形骸中，渊玄谁能睹。 牵三复牵六，年往不可逐。 虽无骨问分，训之故宜勖。 牵三复牵七，希仰入九室。 披拎就灵训，谊然万事毕。 大道妙不远，弘之当由人。 忠信成一气，可得脱度身。 三灾运已促，宜早去利欲。 中睛渐坚固，灾厄便得度。 心罪宜详除，勉力可为则。 过五难，众愿咸可得。 恨无自然分，缠绵流俗问。 归长生，庶得厕群贤。 正一法文天师教戒科经竟",
      "translated_text": "In crimson-yellow unlined robes and triple-seamed caps,\nBearing Heavenly Jade Tallies, they kneel before me.\nThey expound on the myriad people and the Dao of all folk—\nRewards and transgressions, promotions and demotions, all set forth in clear scripture.\n\nYangping governs the teachings. I acknowledge the Twenty-Four Districts, the Five Qi and Central Qi, the Four Divisions of Spirit-Conducting Qi, the Left and Right Supervising Spirits, the Libationers of the Districts, the Overseers of Separate Districts, and the scattered folk—men and women, old and young—of the various districts. In the first year of Han’an, on the first day of the fifth month, I received the Dao from the Divine Qi of the Han’s First August Emperor, Wang, pledging five pecks of rice as token, that all who might attain immortality could ascend and transcend.\n\nYet you, this generation, are even harder to instruct. How can I speak with you? You reverse right and wrong, twist crooked into straight. At this millennial convergence, what is to be done with you?\n\nI, following the Most High Lord Lao, have traversed the Eight Extremes, inspecting and inquiring among the people, seeking the seed-people, yet none could be found. You, the common folk, bear no resemblance to the seed-people. You but covet glory and wealth, money, grain, silks, brocades, and fine cotton, making the sustenance of wives and children your sole concern. You seize the households of others to exact their taxes, extort their goods, and press the people into service, monopolizing their labor to till private fields and feed your wives and slaves. You care for none but yourselves, seeking merit and fame, enriching your bodies and selves, recklessly grasping for wealth. Your households know no harmony; quarrels and slander take precedence. Men and women, old and young, speak ill of one another, their words filling the roads with discord. Their speech diverges, their words clash, and they spread slander without end. They disregard the spirits and gods, distressing the Dao of Heaven, causing the qi to fall into chaos. Upon whom does the blame rest?\n\nEach claims secret teachings, debating old affairs. I can no longer endure you. Do you even grasp the written decrees I hold for you? Libationers, overseers, men and women, old and young—each of you is muddled, no different from the vulgar. Your words belie your hearts; you are but human-headed worms. Your chambers know no restraint; you indulge in wanton lust. Men and women, old and young, fail to admonish one another. In your confusion, your conduct is turbid. Entrusted with the Master’s Dao and the Most High Lord Lao’s teachings, you debate old affairs, yet when I seek to enforce discipline, to cast the net and draw it tight, and to investigate and govern, among every ten of you—those who hold office, the district libationers—I shall execute three or four. Your names shall be returned to the Heavenly Bureau, where you will be interrogated, punished, and sentenced. Beware!\n\nThe qi grows urgent. Within no more than one, two, or three years, I shall ensure you hear and see for yourselves. Take heed!\n\nAmong the libationers and overseers, are there any of the old guard left? From the first year of Jian’an and Huangchu onward, each libationer and overseer has claimed to teach, each establishing their own district, no longer adhering to the old Daoist laws as they ought. I do not command you to follow the teachings of Yangping, Lutang, or Heming. Do your actions align with the old ways? If not, what urgency do I have? My urgency lies in turning you toward governing the people, in transmitting the teachings of the descending qi, and in exhorting you, this generation. The Most High Lord Lao oversees you all, desiring that each of you apply your minds, devote yourselves earnestly, and once more exhort yourselves to fulfill the Dao with utmost devotion, converting and guiding the common folk.\n\nThe Celestial Master’s Five-Word Linked Three Poems:\n\nLinked Three, then Linked One,\nParting clouds to brighten the white sun.\nThe Three Calamities sweep away defilement’s weight,\nAs if emerging from beneath the covers’ state.\n\nLinked Three, then Linked Two,\nGlory and splendor are not worth the due.\nShould you seek to pass the Five Trials’ test,\nYour sincerity must be pure, your earnestness the best.\n\nLinked Three, then Linked Three,\nWine and meat are not worth savoring.\nWash and refine the raw silk’s essence,\nFrom bitterness to crimson, its transformation.\n\nLinked Three, then Linked Four,\nThe wondrous Dharma is hidden in mystery’s core.\nYearn and aspire for the divine to descend,\nWith single-minded focus, let no duality offend.\n\nLinked Three, then Linked Five,\nThe Daoist emerges from the thatched door’s hive.\nShedding the form’s confines,\nWho can perceive the abyss profound?\n\nLinked Three, then Linked Six,\nThe years depart, beyond pursuit’s tricks.\nThough no bone-questioning fate is decreed,\nAdmonition still urges you to heed.\n\nLinked Three, then Linked Seven,\nYearn and aspire to enter the Nine Chambers’ heaven.\nGrasp and follow the sacred teachings’ thread,\nAnd all ten thousand affairs shall be swiftly sped.\n\nThe wondrous Dao is not far,\nIts flourishing depends on man’s part.\nLoyalty and faith merge into one qi,\nAnd you may transcend the mortal frame, set free.\n\nThe Three Calamities’ cycle hastens near,\nAbandon profit and desire—best act with fear.\nThe central vision gradually firms,\nAnd calamities and hardships will disperse like worms.\n\nExamine and purge the heart’s transgressions,\nStrive with might to set the standard’s lessons.\nPass the Five Trials, and all wishes may be won,\nYet lament the lack of natural affinity’s sun.\n\nEntangled in the mundane’s flowing tide,\nSeek long life, and among the worthy abide.\n\nThe Scripture of Precepts and Ordinances of the Orthodox Unity Teachings of the Celestial Master is now complete.",
      "overlap_context": "e ghostly ranks in the Yellow Springs.\nYet if they reflect, repent, and follow my words,\nThey may ascend and transcend, becoming immortals,\nCautiously guarding yin and yang, preserving their spirits.\nThe five viscera and six bowels have their rulers and ministers,\nAccumulating subtly to become true people.\nIf the spirit is sorrowful and sleepless,\nRoaming among the people, inquiring of the five viscera,\nIt returns to speak with the true person—\nThe true person within the heart ascends to Heaven.",
      "start_char": 7941,
      "end_char": 8931,
      "start_sentence": 348,
      "end_sentence": 391,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.88889718055725,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\正一法服天师教戒科经.txt",
        "category": "戒律类"
      }
    }
  ]
}