{
  "source_id": "正一威仪经",
  "source_file": "chunked_daozang\\正一威仪经.json",
  "total_chunks": 6,
  "total_original_chars": 6992,
  "total_translated_chars": 44007,
  "total_translation_time": 196.00936269760132,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\威仪类\\正一威仪经.txt",
    "category": "威仪类"
  },
  "full_translation": "**The Scripture of Orthodox Unity’s Ritual Dignity**\n\n**Scripture Title:** *The Scripture of Orthodox Unity’s Ritual Dignity*. One scroll. Base text from *The Orthodox Daoist Canon*, *Section of Numinous Writings on Ritual Dignity*, *Category of Ritual Dignity*.\n\nThe Supreme Lord says: The ritual dignity for receiving the Orthodox Unity Dao:\n\nFirst, upon entering the Dao’s gate, one must approach the master to receive the covenant contract. Without receiving the covenant contract, the true officials guarding the boundaries of lands, mountains, and rivers will not record one’s Daoist name, and the administrative officials will obstruct and delay, making it difficult to attain the Dao. Upon receiving this covenant contract, the gates of Heaven and Earth dare not delay.\n\nThe ritual dignity for receiving the Orthodox Unity Dao: Next, one must approach the master to receive the register of governance and the Three Refuges and Five Precepts. Those who do not receive these will not be recorded by the governing offices, the local earth gods will remain unenlightened, the five *qi* will not be gathered, and the four administrative bureaus will not be connected. Upon receiving this register of governance, demon kings will bow in submission, calling themselves subordinate officials.\n\nThe ritual dignity for receiving the Orthodox Unity Dao: Next, one must approach the master to receive the talismans of immortals and spirits. Those who do not receive these will find that summoned spirits do not descend, gods do not provide protection, and petitions do not reach their destination. In all matters of reverent observance, spirits will not flow freely, and the Five Emperors of the Three Realms will not respect one’s form. Upon receiving these talismans, one may perform purification rites and petitions, subdue ghosts and expel demons, commanding them first.\n\nThe ritual dignity for receiving the Orthodox Unity Dao: Next, one must approach the master to receive the commands of the Nine Provinces’ earth altars and the governors of the Nine Provinces. Those who do not receive these will, when traveling through the Nine Provinces, be delayed by the spirits of mountains, rivers, and lands wherever they go, and their paths will not be clear. Upon receiving these talismans, ghosts and spirits will show reverence, and one will not be subject to the jurisdiction of earthly officials or demon kings, who will instead protect one’s form.\n\nThe ritual dignity for receiving the Orthodox Unity Dao: Next, one must approach the master to receive the talismans for slaying evil and the registers of the Dharma for slaying evil. Those who do not receive these will be encroached upon by demonic spirits and malevolent ghosts, suffering invasions of weapons and illness. Upon receiving these, one may execute evil and subdue misfortune, causing myriad spirits to conceal themselves, while the spirits of lands, mountains, and rivers will escort and welcome.\n\nThe ritual dignity for receiving the Orthodox Unity Dao: Next, one must approach the master to receive the talismans for warding off the Nine Palaces’ calamities and the Six Harmful Spirits. Those who do not receive these will suffer repeated afflictions of the Nine Calamities and Six Harms, and the malevolent ghosts of the Six Heavens will unleash their power. Upon receiving these, myriad disasters will not encroach, all evil will avoid one, and the Five Emperors of the Three Realms will serve one’s form.\n\nThe ritual dignity for receiving the Orthodox Unity Dao: Next, one must approach the master to receive the talismans of the Nine Heavens’ soldiers and the true talismans of the Nine Heavens. Those who do not receive these will find that the divine soldiers of the Three and Five will not follow one east or west, nor come to attend and protect when one enters and exits the human realm. Upon receiving these, the divine soldiers of the Three and Five will follow one east and west, attending and protecting upon entry and exit, so that myriad evils will not encroach. When summoning and commanding spirits, they dare not disobey, and all ghosts and spirits will dread one’s power.\n\nThe ritual dignity for receiving the Orthodox Unity Dao: Next, one must approach the master to receive the talismans of the Heavenly Numinous Red Officials and the Primordial Destiny. Those who do not receive these will find that heavenly spirits and earthly deities do not descend upon one’s body, true officials scatter in disarray, and the spirits within the body take flight. Upon receiving these, the soldiers and horses of Heaven and Earth will follow one’s needs, the officials and soldiers within the body will encircle one’s form, and one will rest and sleep in peace, undisturbed by dreams.\n\nThe ritual dignity for receiving the Orthodox Unity Dao: Next, one must approach the master to receive the talismans of the Twenty-Eight Constellations and the Seven Stars. Those who do not receive these will find that the stellar officials of the various heavens do not descend upon one’s body, the heavenly officials will not support one’s longevity and life preservation, and petitions and summons will not be answered. Upon receiving these, one’s name will ascend to the heavenly officials, life will be preserved and years extended, and when praying to the stellar officials, they will immediately comply with one’s words, attaining the Dao and ascending as an immortal, with the gates of Heaven opening of their own accord.\n\nThe ritual dignity for receiving the Orthodox Unity Dao: Next, one must approach the master to receive the General Seal of the Complete Chapters and the Fourfold Prohibitive *Qi*. Those who do not receive these will find that when submitting memorials, deploying talismans, or performing prohibitions and methods, the spirit *qi* will not comply, and petitions will not be heard. Upon receiving these, talismans, memorials, prohibitions, and invocations will all proceed as commanded.\n\nThe ritual dignity for receiving the Orthodox Unity Dao: Next, one must approach the master to receive the Three Hundred Great Chapters and the Twelve Hundred Officials. Those who do not receive these will find that the officials and soldiers within the chapters will not heed one’s words, and despite reverent observance, one will instead incur transgressions. Upon receiving and practicing these, one’s words will be as those of the gods, and this is of utmost importance. Guard against careless transmission; follow the regulations in cultivation to avoid all disasters and misfortunes.\n\nThe ritual dignity for receiving the Orthodox Unity Dao: Next, one must approach the master to receive the Great Register of the Purple Palace. Those who do not receive this will be unable to eliminate disasters for the state, rectify the divisions of Heaven, or gain the compliance of heavenly officials. Upon receiving and diligently practicing this, Heaven will respond to one’s heart, and all prayers and wishes will be followed by the various heavens. One will attain the Dao and ascend to Heaven, where stellar officials will descend to welcome, the gates of Heaven will open, and demon kings will protect one’s name.\n\nThe ritual dignity for receiving the Orthodox Unity Dao: Next, one must approach the master to receive the Register for Dispelling Nightmares. Those who do not receive this will find that spirit *qi* does not flow, impure *qi* does not dissipate, and when deploying talismans, consecrating water, summoning ghosts, or binding spirits, true spirits will advance and scatter, while malevolent spirits will encroach upon one’s form. Upon receiving this, impurities will be swept away, and humans and ghosts will be clear and bright.\n\nThe ritual dignity for receiving the Orthodox Unity Dao: Next, one must approach the master to receive the Seventy-Two Precepts and the One Hundred Eighty Precepts. Those who do not receive these will be examined and punished by the Four Administrative Bureaus of the Three Realms, their names erased from the records of good deeds, their offenses listed in the registers of transgressions, and even their parents in life and death will not escape the Three Wretched Realms. Upon receiving and practicing these, the various heavens will rejoice, ghosts and spirits will honor one, the seven generations of ancestors will ascend to Heaven, and one’s body will ascend to the Cloud Palace.\n\nThe ritual dignity for receiving the Orthodox Unity Dao: If one does not approach the master to receive the scriptures, precepts, talismans, and registers, practicing them will lack numinosity and instead incur the sin of theft. One must approach the master to receive them and cultivate according to the Dharma. The above outlines the essentials; all should proceed accordingly.\n\nThe ritual dignity for receiving the Orthodox Unity Dao: Whenever one wishes to receive the Dao, one must first approach the master’s gate, sincerely pray, and prostrate in reverence. Once the master permits and accepts the petition, one may request the scriptures, precepts, talismans, and registers, copying them according to the Dharma. One must prepare ritual provisions, pledges, ritual robes, and ritual implements in full. Only then may one ascend the altar, make declarations, sever former covenants, and list one’s vows and personal circumstances. All should be done on selected days, spaced apart by months, and not done frequently or with tacit permission or ease.\n\nThe Ritual Dignity for Receiving the Orthodox Unity Dao: To receive the Dao, one must approach a master who possesses the scriptures, precepts, talismans, and registers. One must not falsely transmit reputation or recklessly receive the true scriptures—this is a major prohibition of the Dao, and violation shall condemn the soul to the Nine Dark Realms.\n\nThe Ritual Dignity for Receiving the Orthodox Unity Dao: A master without the Dharma must not recklessly transmit it. If a disciple makes a petition and falsely transmits covenants and vows, ten thousand kalpas of wind and blade shall befall them, and their seven generations of ancestors shall share the guilt—this must be strictly heeded.\n\nThe Ritual Dignity for Receiving the Orthodox Unity Dao: Those of the same surname, from nine generations of kinship, may not transmit the teachings to one another as master and disciple. Why is this? If master and disciple violate the covenant, the nine generations of ancestors shall share the punishment.\n\nThe Ritual Dignity for Receiving the Orthodox Unity Dao: One with the Dharma is a master, regardless of whether they are a servant or subordinate. If one lacks the precepts and registers, even if they are a celestial exalted being, they may not presume to act as a master due to the Dharma.\n\nThe Ritual Dignity for Receiving the Orthodox Unity Dao: When ascending the altar, one must establish the Three Masters and Five Guarantors to oversee the transmission, inspecting gains and losses, and addressing the offices of the Three Heavens and Five Emperors.\n\nThe Ritual Dignity for Receiving the Orthodox Unity Dao: After ascending the altar and completing the transmission, the disciple shall be dressed in ritual robes and bestowed with their rank and title. The disciple shall then recite their rank and title, paying homage to their original master and the Most High of the Ten Directions.\n\nThe Ritual Dignity for Receiving the Orthodox Unity Dao: Upon completion of receiving the Dao, the names, appearances, and ages of the Three Masters shall be recorded on yellow silk, along with those of the Three Masters, Five Guarantors, and the disciple who ascended the altar.\n\nThe Ritual Dignity for Receiving the Orthodox Unity Dao: When receiving the Dao, each shall adhere to their proper rank and dignity. One must not presume or err: laypersons may not sit with the devout disciples, devout disciples may not sit with the devout Daoists, devout Daoists may not sit with Orthodox Unity Daoists, Orthodox Unity Daoists may not sit with High Mystery Dharma Masters, High Mystery Dharma Masters may not sit with Cavern Spirit Dharma Masters, Cavern Spirit Dharma Masters may not sit with Cavern Mystery Dharma Masters, Cavern Mystery Dharma Masters may not sit with Cavern Perfection Dharma Masters, and Cavern Perfection Dharma Masters may not sit with Great Cavern Dharma Masters. When ascending the altar to perform the Dao, during fasts, lectures, or in private chambers, whether walking, standing, sitting, or reclining, these ranks shall determine their dignity. For the upper, middle, and lower seats, one should consult and seek guidance, always remaining humble and reverent toward the Dharma teachings, never impairing ritual dignity.\n\nThe Ritual Dignity for Orthodox Unity Ritual Robes: Before receiving the Dao, one must prepare the ritual robes: a dark cap, crimson-brown robe, yellow skirt and sash, straw sandals, and a ritual tablet. After transmission, one shall then don the cap and sash.\n\nThe Ritual Dignity for Orthodox Unity Ritual Robes: Ritual robes must not be made of five-colored silks, brocades, or fine fabrics. They shall be made of plain silk or cloth, following proper regulations, and kept pure, not exceeding three layers.\n\nThe Ritual Dignity for Orthodox Unity Ritual Robes: Ritual robes must not be casually removed. When washing or replacing them, one must not allow laypersons to touch or mix them with common garments. All robes are constantly guarded by divine men and women.\n\nThe Ritual Dignity for Orthodox Unity Ritual Robes: Ritual robes must not be lent to others; one must prepare their own. If damaged, they may be purified by fire. If residing in mountain forests or secluded places, they may be buried.\n\nThe Ritual Dignity for Orthodox Unity Ritual Robes: When removing or donning ritual robes, place them in a pure location. When visiting the privy or handling objects, one must first wash hands and feet before touching them.\n\nThe Ritual Dignity for Entering the Oratory: First, adjust the ritual robes, perform ablutions, recite invocations, and circumambulate while chanting praises—all must be done according to the Dharma, not casually. One must not utter vulgar or punitive words.\n\nThe Ritual Dignity for Entering the Oratory: When ascending the altar or entering the chamber, one must not scold others or converse with outsiders, glance around, or allow the mind to wander.\n\nThe Ritual Dignity for Entering the Oratory: All necessities within the oratory must be prepared in advance; one must not lack anything at the last moment and call for outsiders to seek supplies.\n\nThe Ritual Dignity for Entering the Oratory: When entering the oratory, remove or don sandals while facing the scriptures and images, never turning one’s back. When lifting the feet, follow the left and right in accordance with yin and yang.\n\nThe Ritual Dignity for Memorial Presentations: Stand facing west, hold the tablet with a slight bow, regulate the voice and qi, speak plainly and softly, with simple and unadorned words—one must not raise the voice or use excessive embellishment.\n\nThe Ritual Dignity for Memorial Presentations: Sincerely pray with earnest devotion, expressing one’s pleas with sincerity. Be concise in matters, never losing ritual dignity. Whether for oneself or others, one must remain single-minded, never negligent or careless.\n\nThe Ritual Dignity for Memorial Presentations: For all petitions, first repent one’s transgressions, then make the request. Speak with elevated and restrained words, ensuring the sentiment and reason are appropriate. Do not over-embellish and lose sincerity.\n\nThe Ritual Dignity for Memorial Presentations: From beginning to end, remain single-minded, with consistent words and intent. Do not present different matters morning and evening, or begin with reverence and end with carelessness.\n\nThe Ritual Dignity for Scripture Recitation: Don the cap and sash, perform ablutions, hold incense, and focus the mind. Follow the original text, sit upright with reverence, regulate the voice and qi, and recite with utmost sincerity from beginning to end without pause.\n\nThe Ritual Dignity for Scripture Recitation: When reciting scriptures, maintain unbroken concentration, thought after thought, without omission or forgetfulness. If a word or phrase is mispronounced, after five hundred words, pause to acknowledge the error and reflect on one’s heart.\n\nThe Ritual Dignity for Scripture Recitation: After five hundred or one thousand words, or at the end of a chapter, one may swallow saliva or drink pure water to benefit the voice and qi, without violating the Dharma.\n\nThe Ritual Dignity for Scripture Recitation: Upon completing a scroll, if interrupted by matters, place the scripture in its case, offer incense three times, and bow. When resuming, do the same.\n\nThe Ritual Dignity for Scripture Recitation: First wash the hands, fumigate the hands and scripture, then recite. After finishing, again wash the hands cleanly; do not proceed immediately.\n\nThe Ritual Dignity for Scripture Recitation: Before reciting scriptures, first approach the master to receive the proper pronunciation, phrasing, and recognition of characters. Do not create confusion in the scripture hall or disrupt others.\n\n**The Ritual Dignity for Scripture Recitation:** While reciting scriptures, one must not entertain others’ requests to explain the meaning of passages, nor engage in clarifying doubts, handling miscellaneous affairs, or disrupting the true and numinous.\n\n**The Ritual Dignity for Scripture Recitation:** If there are unclear points in the scripture requiring consultation or questions about characters, phrasing, or pronunciation, one should do so at another time, approaching the master with reverence to seek instruction. One must not casually inquire as the need arises.\n\n**The Ritual Dignity for Scripture Exposition:** Disciples must first consult and inform the Dharma master, stating: “For so-and-so—whether men or women—or for such-and-such a matter, we request at such-and-such a place the exposition of such-and-such a scripture, wishing to receive enlightenment.”\n\n**The Ritual Dignity for Scripture Exposition:** Once the Dharma master grants permission, prepare and adorn a high seat in the lecture hall. Whether for a hundred or a thousand listeners, all must be arranged according to ritual, with dignity befitting the occasion.\n\n**The Ritual Dignity for Scripture Exposition:** When setting up the high seat, orient it east, west, south, or north as appropriate. Place the scripture to the left and the master to the right. Men should be seated to the east, women to the west. Do not allow mingling, lest the dignity be lost.\n\n**The Ritual Dignity for Scripture Exposition:** The ritual fan, whisk, incense burner, scripture case, lectern cloth, banners, flowers, canopy, and seating mats must all be arranged according to proper form. Nothing should be done casually.\n\n**The Ritual Dignity for Scripture Exposition:** Disciples and listeners, each bearing incense and flowers, along with banners, pennants, and music, should chant praises and lead the procession, burning incense and bowing to welcome the Dharma master. They must come and go in accordance with the occasion, without negligence.\n\n**The Ritual Dignity for Scripture Exposition:** The Dharma master, in accordance with the circumstances, should guide both Daoists and laypeople in repentance, vows, precepts, and fasting, frequently exhorting them to awaken to the true Dao. Spreading the Dao and benefiting beings takes precedence in this.\n\n**The Ritual Dignity for Scripture Exposition:** The Dharma master dedicates the merit of scripture exposition to adorn the lord of the realm, high ministers, local officials, all people and creatures, those in the five sufferings and three evil destinies, and all sentient beings, that they may awaken to the Dao and attain perfection.\n\n**The Ritual Dignity for Scripture Exposition:** Upon concluding the exposition, disciples and all listeners, each according to their capacity, should resolve to establish a grand treasure fast, that boundless blessings may spread.\n\n**The Ritual Dignity for Serving the Master:** Morning and evening, one must properly don the ritual attire and, holding a tablet, pay homage to one’s primary master and the Three Masters, as one would to one’s parents. If residing together, one should inquire after them morning and night, with a kind and joyful countenance.\n\n**The Ritual Dignity for Serving the Master:** If the master is a hundred *li* away, visit once a month; if two hundred *li*, once every three months; if five hundred *li* or more, once a year. If the master is ill, aged, or otherwise indisposed, these limits do not apply, and written correspondence is unrestricted.\n\n**The Ritual Dignity for Serving the Master:** When visiting the master, one must personally bring provisions—food, incense, oil, and the like—without causing any loss or expense to the master.\n\n**The Ritual Dignity for Serving the Master:** Disciples should provide for the master in a timely manner: clothing, medicine, ritual implements, staffs, towels, whisks, shoes, vessels, rice, wheat, fruits, and vegetables. Supply all necessities without allowing any deficiency.\n\n**The Ritual Dignity for Serving the Master:** If the master falls ill or encounters misfortune, attend to them closely, perform meritorious deeds, burn incense, repent, release living beings, and redeem lives. Establish fasts and practice the Dao to extend their years and avert calamity.\n\n**The Ritual Dignity for Serving the Master:** Upon the master’s passing, observe mourning for a hundred days and maintain a heart of mourning for three years. Bury them in the mountains, using a simple coffin or cloth shroud, merely to contain the body. Create fields of merit and reflect upon their bearing.\n\n**The Ritual Dignity for Observing Fasts:** Whether for oneself or others, when establishing fasts and blessings, one must do so with utmost sincerity. All rice and wheat must be pure, without substitution, theft, or improper acquisition.\n\n**The Ritual Dignity for Observing Fasts:** For all auspicious or inauspicious occasions, matters of life and death, or meritorious deeds, one should first perform a fast and undertake all virtuous acts. On the day of completion, a fast must be held to celebrate.\n\n**The Ritual Dignity for Observing Fasts:** All fasts are overseen by the Three Realms, the Five Emperors, and the Four Divine Officials, who inspect the offerings. Nothing may be defiled or stolen.\n\n**The Ritual Dignity for Observing Fasts:** When ascending to the fast and making offerings, whether noble or humble, old or young, all must be treated equally. One must not harbor dual intentions or generate thoughts of attachment or aversion.\n\n**The Ritual Dignity for Observing Fasts:** The officiants of the fast should distribute offerings according to their portion, thereby purchasing blessings. One must not verbally agree while harboring regret, nor generate dissatisfaction or negligence.\n\n**The Ritual Dignity for Observing Fasts:** When the officiants present offerings, they must proceed in order, announcing their names and positions. No intermingling is permitted; one must follow the sequence and announce clearly, without bias or imbalance.\n\n**The Ritual Dignity for Observing Fasts:** The host should present a formal address, clearly stating the purpose, and proceed to invite the Dharma master. The Dharma master, upon receiving the petition, should respond according to the names and not delay or accept nearby household offerings out of convenience.\n\n**The Ritual Dignity for Observing Fasts:** After the officiants have eaten their portion, the remainder should be returned to the host. It must not be taken home, nor should the communal food be contested or consumed. All should exercise caution.\n\n**The Ritual Dignity for Observing Fasts:** On the Eight Liberations, Ten Upright Days, Jiazi, Gengshen, one’s own life-day, and the eight auspicious solar terms, one should observe fasts. The Three Realms, Five Emperors, Four Heavens, and Ten Divisions all come to oversee.\n\n**The Ritual Dignity for Receiving Precepts:** The Three Precepts, Five Precepts, Six Precepts, Nine Precepts, Twelve Permissible Precepts, Twenty-Seven Precepts, Forty-Six Precepts, Seventy-Two Precepts, Eighty Precepts, One Hundred Twenty Precepts, and Three Hundred Precepts—each should be received and upheld according to their proper form.\n\n**The Ritual Dignity for Receiving Precepts:** Whether for the lord of the realm, high ministers, local officials, men and women of the people, or even spirits and all sentient beings, precepts should be conferred according to their capacity. Command the guardian deities of the precepts to protect them, that no calamities may befall.\n\n**The Ritual Dignity for Receiving Precepts:** Those who uphold the precepts must not share a bed or seat with those who do not. In walking, standing, sitting, lying, eating, dwelling, clothing, footwear, vehicles, staffs, and ritual implements, all should be kept distinct.\n\n**The Ritual Dignity for Repentance:** At dawn and dusk, one faces the true and ascends the altar to enter the oratory, reciting scriptures and performing prostrations. First, repent for the lord of the realm, high ministers, local officials, parents, teachers, those in the Three Wretched Realms and Five Sufferings, and all sentient beings; then, for oneself.\n\n**The Ritual Dignity for Repentance:** In walking, standing, sitting, and lying down, with every thought and intention, the three karmas and six senses may inadvertently commit transgressions—like grains of sand and specks of dust. Focus the mind in repentance, ensuring no further wrongdoing arises, that all may be purified and myriad transgressions dissolved.\n\n**The Ritual Dignity for Prostration:** Upon entering the oratory to face the true, in walking, standing, sitting, and lying down, whether in mind or form, prostrate to the Five Hundred Million Devas of the Ten Directions, the boundless true, responsive, and transformed manifestations of the Heavenly Worthies, and the host of immortals and sages.\n\n**The Ritual Dignity for Prostration:** With every thought and movement, take refuge in the empty vastness, as numerous as motes of dust and grains of sand—past, future, and present—bowing to the limitless Dao, the great and small bodies, the infinite equal bodies, in reverence to all.\n\n**The Ritual Dignity for Prostration:** From the Great Lofty Heaven above to the boundless depths below, across the Ten Directions and Three Realms, the Dao manifests in response, expounding the teachings. In the Thirty-Six Divisions, the true and transformed Dharma, the outer and inner treasuries, talismans, charts, and sacred scriptures—all are venerated with devotion.\n\n**The Ritual Dignity for Burning Incense:** First, cleanse the incense box, censer, tongs, spoon, tray, ashes, and charcoal, then arrange them properly, ensuring all is level, polished, and pure. The fire should not show red embers, and the ritual form should be observed.\n\n**The Ritual Dignity for Burning Incense:** All ashes, charcoal, and fire must be stored separately. Do not use hearth embers, leftover fires, or impure fuels—such as tainted wood or foul substances—nor discard ashes in improper places.\n\n**The Ritual Dignity for Burning Incense:** When shaping incense, use three fingers, hold the body upright, and maintain a focused mind, whether sitting or standing. Take the incense conveniently with three fingers.\n\n**The Ritual Dignity for Burning Incense:** With each of the three offerings, ensure the smoke rises continuously, without interruption.\n\n**The Ritual Dignity for Burning Incense:** In prayers, invocations, entering the oratory, and ascending the altar, let the incense burn day and night without cease, for the divine beings, though formless, communicate through the fragrance.\n\n**The Ritual Dignity for Burning Incense:** Before reciting scriptures, performing the Dao, observing fasts, chanting, lecturing, or praying, first circumambulate with incense three times, then present the words.\n\n**The Ritual Dignity for Burning Incense:** The incense of the celestial realms has a thousand names and myriad forms, perfuming all without burning, carried by wind and clouds to fill the Ten Directions. In the mortal world, among all things, only this is indispensable.\n\n**The Ritual Dignity for Lighting Lamps:** Lamps, shaped like stars, aid the light of heaven, prolong life, avert misfortune, and dispel calamities. Whether one lamp, ten lamps, a hundred, a thousand, ten thousand, or a hundred million—let it be according to one’s capacity.\n\n**The Ritual Dignity for Lighting Lamps:** In performing the Dao, reciting scriptures, prostrating, lecturing, or circumambulating the altar, arrange the lamps like stars in a ring—twelve thousand in number, corresponding to the essence of heaven. They shine by night and fade by day, aligning with qi in cultivation.\n\n**The Ritual Dignity for Lighting Lamps:** When lighting lamps, place them three feet above the ground, covering them with a canopy to prevent insects from entering and to shield them from wind and dust.\n\n**The Ritual Dignity for Ringing the Bell:** The bell is a precious instrument of ritual dignity, heard by the four assemblies, an urgent task in the six periods—it must not be omitted. Place the bell to the left and scriptures to the right, both on raised platforms.\n\n**The Ritual Dignity for Ringing the Bell:** At the second, third, sixth, ninth, and twelfth hours, one must adjust one’s attire, wash hands, rinse the mouth, compose body and mind, first knock the teeth and recite the incantation, then strike the bell.\n\n**The Ritual Dignity for Ringing the Bell:** The method of striking the bell: first, strike densely then sparsely, slowly sounding three strokes—this is called the \"three initial strikes.\" Then, strike densely then sparsely, slowly sounding twenty-four strokes to conclude—this is called the \"long strike.\" Return to the initial density, slowly sounding twelve strokes—this is called the \"end.\" In total, thirty-nine strokes, corresponding to the thirty-nine households.\n\n**The Ritual Dignity for Ringing the Bell:** After the three initial strikes, arrange lamps and fires, prepare seats, wash, rinse, and don proper attire. Wait for the long strike, then proceed slowly. The assembly should align in proper order, with incense, flowers, and hymns all arranged with dignity. When the final bell sounds, begin the chanting and guiding, ensuring no haste disrupts the ritual decorum.\n\n**The Ritual Dignity for Ringing the Bell:** Do not miss the proper time or strike the bell improperly. For unscheduled gatherings, use a smaller bell.\n\n**The Ritual Dignity for Striking the Chime Stone:** It marks the rhythm when ascending the altar or entering the chamber, as required by ritual dignity. Strike it at the beginning and end of prostrations, when praising, in guiding movements, during bows and rises, and in fasts and lectures.\n\n**The Ritual Dignity for Memorials:** The art of memorials is most difficult—do not treat it lightly. Ensure the paper and ink are clean, the wording upright and proper, aligned with true qi, without falsehood or error, as the divine officials will deliberate.\n\n**The Ritual Dignity for Memorials:** When bowing to present a memorial, face the direction of submission. Set up a separate seat and table, arrange the cloth and case properly, sit humbly, and read in an even voice—do not act arrogantly or irreverently.\n\n**The Ritual Dignity for Memorials:** Without receiving the Register of Governance, the Twelve Hundred Official Lords, the Three Hundred Sixty Great Memorials, or the Complete Seal of Memorials, one may not submit memorials to the celestial bureaus. Each must manifest their own immortal officials—do not falsely claim oversight.\n\n**The Ritual Dignity for Offering Sacrifices:** Sacrifices are offerings to the gods of heaven and earth. There are many kinds, and all cakes and fruits must be pure—do not use meat, dried flesh, or foul substances, lest the celestial officials not grant protection.\n\n**The Ritual Dignity for Offering Sacrifices:** All pledged offerings must not be borrowed. If insufficient, do not deceive the enlightened spirits.\n\nWhen the rites are complete, distribute offerings to mountain-dwelling Daoists, the hungry and cold, the elderly and infirm, prisoners, and laborers.\n\n**The Ritual Dignity for Offering Sacrifices:** When the rites are complete, bury all remaining cakes and fruits after the food has been set out.\n\n**The Ritual Dignity for Offering Sacrifices:** The proper time is after midnight and before midday, when the qi of life is ascendant.\n\n**The Ritual Dignity for Offering Sacrifices:** All cakes and fruits used must be fresh and fragrant; do not use those left overnight, nor those tainted by birth impurity, corpses, or remnants gnawed by domestic fowl or rats, lest the spirits refuse to partake and your efforts be in vain.\n\n**The Ritual Dignity for Daoist Ritual Implements:** A Daoist’s ritual implements—incense burners, washing vessels, small tables, dusters, ruyi scepters, pendants, swords, and staffs—must always be kept in good order, arranged and offered according to their use.\n\n**The Ritual Dignity for Eating Utensils:** A Daoist’s eating utensils—three-tiered spoons, chopsticks, napkins, and cloths—must all be proper; do not use gold, silver, precious jades, ivory, or carved horn, nor mix them with ordinary vessels. They must always be kept pure.\n\n**The Ritual Dignity for Utensils:** A Daoist’s utensils—rinsing trays, communal food plates, water basins, pestles and mortars for grinding incense, and cauldrons and steamers for compounding medicines—must be suited to their purpose and not borrowed.\n\n**The Ritual Dignity for Dwellings:** A Daoist’s dwelling should be simple, unadorned, and serene, with open space inside and out; do not hang curtains, screens, or drapes that obstruct the surroundings.\n\n**The Ritual Dignity for Dwellings:** A Daoist’s dwelling should be a humble room, just large enough to accommodate the body; do not reside in grand halls or spacious chambers adorned with carvings, red ochre, or whitewash, nor in lavish or ostentatious quarters.\n\n**The Ritual Dignity for Dwellings:** A Daoist’s dwelling should have a bed placed against the wall; do not arrange beds to face one another. Sit and sleep alone; do not share quarters with ordinary people.\n\n**The Ritual Dignity for Dwellings:** A Daoist’s dwelling should have a bed of chaste tree wood, a cloth cover, a mat of woven grass, a lacquered frame, a wooden tray, and earthenware vessels; do not use bronze, iron, gold, or silver.\n\n**The Ritual Dignity for Bedding:** Use cloth sheets, cloth covers, a stone or wooden pillow, straw sandals, skirts, jackets, shirts, and trousers—all made of hempen cloth dyed with indigo, gardenia, bamboo leaves, or turmeric to a muted yellow hue.\n\n**The Ritual Dignity for Footwear:** Craft sandals in the shape of mountains and the Two Modes, adorned with plain leather or cloth; do not embellish them with five-colored brocade or fine silk. If using straw sandals or wooden clogs, they must differ from those of the common world.\n\n**The Ritual Dignity for Springs and Wells:** Where a Daoist resides, a well or spring must first be established, kept pure and free from contamination by the six livestock or filth. Separate wells should be designated for washing, drinking, and watering cattle, horses, and other animals.\n\n**The Ritual Dignity for Wells and Springs:** All wells and springs must be frequently dredged; do not allow grass, flowers, leaves, frogs, or flies to fall into them. Each household and guest courtyard should have its own well, not shared with those used for sacrificial offerings.\n\n**The Ritual Dignity for Water Use:** For all cooking, boiling medicines, washing clothes, and bathing, the water used must be passed through a fine filter before use.\n\n**The Ritual Dignity for Eating and Drinking:** A Daoist’s food should fill the stomach and no more; do not seek refinement. Always observe fasting; do not eat at improper times or in improper ways.\n\n**The Ritual Dignity for Eating and Drinking:** A Daoist should always recite the food incantation before eating, offering various foods in separate vessels. Visualize the Three Ones, eating in unison with one’s form, and strike the vessel three times with the chopsticks. Serve food in separate dishes and distribute it to living beings.\n\n**The Ritual Dignity for Eating and Drinking:** Each Daoist should have their own set of eating utensils, kept clean with napkins and chopsticks. Provide daily necessities; do not share utensils with others, nor use them for other purposes, lest impure qi intermingle.\n\n**The Ritual Dignity for Eating and Drinking:** Do not allow others to touch the food with impurity, nor eat facing upward, lest breath or clothing contaminate it. Distribute leftovers; do not hoard or take them away.\n\n**The Ritual Dignity for Eating and Drinking:** After eating, a Daoist should seek repentance before distributing food; do not beg from others mid-meal or allow servants, attendants, chickens, or dogs to partake. The supervising immortal officials will record transgressions and report them to the Three Bureaus.\n\n**The Ritual Dignity for Conduct:** In all actions—walking, standing, sitting, or lying down—a Daoist must align with the Dao, maintain a composed demeanor, keep the body upright, and avoid slouching, lest their dignity be lost. The head leads in ritual dignity; one cannot be too careful.\n\n**The Ritual Dignity for Travel:** When a Daoist visits government offices, attends to their master, teaches among the people, or enters secular households for rituals, groups of five or three must proceed in orderly fashion, maintaining proper bearing. Do not intermingle or deviate from the rules.\n\n**The Ritual Dignity for Travel:** When a Daoist travels among the people or attends ritual lectures, each should carry their own seat cushion, using it wherever they go. This both avoids impure qi and distinguishes ranks—high, middle, and low seats—all following the same system.\n\n**The Ritual Dignity for Residing in Abbeys:** Once a Daoist has entered the Dao, they must reside in an abbey, uphold the Dharma, burn incense morning and evening, pay homage to the perfected, perform repentance rites, serve their master, observe precepts, seek guidance from virtuous elders, and study the methods of the Dao.\n\n**The Ritual Dignity for Residing in Abbeys:** Daoists should instruct one another, cherish their Dharma bodies, cultivate goodness, cease evil, contemplate the Three Treasures, and embody kindness, gentleness, and harmony. In all matters, be reverent and compliant, perfect the Daoist sanctuary, and if outsiders offend, respond with patience.\n\n**The Ritual Dignity for Residing in Abbeys:** Daoists should live in harmony, with seniors and juniors trusting and obeying one another, like the movement of hands and feet. Maintain the abbey’s permanence, sharing in the procurement of incense, oil, rice, wheat, firewood, and vegetables as if for oneself, without waste.\n\n**The Ritual Dignity for Residing in Abbeys:** Fields, mills, and grinding stones, as well as servants, the five domestic animals, tools, livestock implements, fruits, herbs, and all necessities, must be cherished and offered to the ten directions as future blessings.\n\n**The Ritual Dignity for Residing in Abbeys:** Sacred images, scriptures, and ritual instruments—banners, flowers, canopies, and altars—along with halls, pavilions, towers, mats, carpets, bells, chimes, tables, and whisk brooms—must all be established together, kept in refined splendor, and never allowed to fall into deficiency or lack.\n\n**The Ritual Dignity for Residing in Abbeys:** All property belonging to the abbey and the wealth of the Three Treasures, from blades of grass and leaves to flowers and fruits, even the smallest particles, must not be privately used or given away to others. The transgression is grave: upon death, one falls into the Three Wretched Realms, and across past, future, and present lives, one’s own parents, siblings, sisters, children, and descendants will suffer poverty, low status, deafness, blindness, muteness, paralysis, leprosy, stupidity, madness, convulsions, or harm by water, fire, or weapons.\n\n**The Ritual Dignity for Death:** When a master, preceptor, or fellow disciple dies, strike the bell three hundred and sixty times to announce the end. All disciples shall gather, weep three times, burn incense, and recite scriptures. For the encoffining, follow the proper ritual forms.\n\n**The Ritual Dignity for Death:** Use a cloth stretcher to carry the body, convey it to the mountains, forests, marshes, or wetlands, and inter it in the earth without raising a mound, sealing the grave, or planting trees over it.\n\n**The Ritual Dignity for Death:** The Zhengyi talismans, contracts, rings, and swords shall be placed in a cloth bag and buried with the body.\n\n**The Ritual Dignity for Death:** Inscribe seventy-two talismans and affix them to the body as prescribed; perform the obeisance to the *Wuhuizhang* (Petition to Earth Deities) and the *Guanlianzhang* (Coffining Petition), with ritual vestments accompanying the deceased.\n\n**The Ritual Dignity for Death:** All clothing, bedding, and belongings of the deceased master, after providing for the funeral, shall be recorded by name and donated to the abbey’s permanent endowment. Whether kin or stranger, insider or outsider, none may violate this rule.\n\n**The Ritual Dignity for Death:** If the master leaves no property for the funeral, the abbey’s permanent endowment shall be used, along with offerings from vegetarian feasts and fields of merit, all drawn from communal resources. Thus, in life and death, all depend on the abbey, for the master is the Heavenly Worthy.\n\nThe Most High said to Heavenly Master Zhang Daoling: \"These one hundred thirty-two articles of Zhengyi ritual dignity were received by me from the Original Celestial Worthy in the Jade Clarity Triple-Flower Convening Hall at the end of the Dragon Han kalpa. At that time, the Original Celestial Worthy, in the presence of the Most High Dao Lord, the Nine Heavens’ Perfected Masters, the Primordial Venerable, the Thirty-Two Heavenly Emperors, the Five Elders of the Upper Realms, and the Boundless Divine Kings, commanded the Five Thearchs’ Jade Lads to unfold the ninefold-clouded casket and produce this ritual dignity, entrusting it to me with these words: ‘You shall disseminate it throughout the Three Realms, the Ten Directions, and the boundless worlds, transmitting it to all men and women of virtuous intent.’ Since receiving it, I have passed through five kalpas, teaching and transforming wherever I go, filling the realms of humans and gods. The lofty sages and perfected immortals have all received and upheld it, inscribing it on golden tablets and concealing it among the celestial bureaus. Now it is fitting to transmit it to you—observe it with reverence. Devotion brings blessing; disclosure invites calamity.’ The Original Celestial Worthy’s solemn admonition must be heeded with care.\"\n\nZhang Daoling bowed his head in homage and gave thanks, saying: \"Your disciple has not long entered the ranks of the perfected, yet has repeatedly received your compassionate grace, your earnest instruction, and the bestowal of scriptures and methods beyond measure. Now you further reveal these precepts and disciplines, subtle and wondrous beyond thought. How dare I not devote my whole heart to following them according to the regulations?\"\n\nThereupon, the assembly of celestial sages and hosts all voiced their approval and together ascended into the great void. **The Scripture of Zhengyi Ritual Dignity ends here.**",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "正一威仪经 经名：正一威仪经。 一卷。 底本出处：《正统道藏》洞神部威仪类。 正一威仪经 太上曰，正一受道威仪：初入道门，诣师奉受券契。 不受券契，土地山川守界真官，不上道名，治官障碍稽留，难为成道。 受此券契，天地门户，不敢稽留。 正一受道威仪：次当诣师奉受治箓、三归五戒。 不受之者，则治司不书，土地不明，不摄五炁，不关四司。 受此治箓，则魔王拜伏，自称下官。 正一受道威仪：次当诣师奉受仙灵符箓。 不受之者，摄召不降，神不营卫，宣奏不达。 有所谨按，神不流行，三界五帝不敬其形。 受此符箓，斋戒启奏，伏鬼除魔，先当使之。 正一受道威仪：次当诣师奉受九州社令、九州都统。 不受之者，游行九州，所在山川土地神灵，辄见稽留，道路不通。 受此符箓，鬼神敬奉，不属地司魔王卫形。 正一受道威仪：次当诣师奉受斩邪符箓、斩邪法箓。 不受之者，魔精鬼祆，横见干犯，兵病所侵。 受之者，诛邪伏凶，万神潜藏，土地山川侍卫送迎。 正一受道威仪：次当诣师奉受九宫捍厄、六害神符。 不受之者，九厄六害，复犯子形，六天凶鬼，得肆其威。 受之者，万灾不干，百邪避之，三界五帝，奉子身形。 正一受道威仪：次当诣师奉受九天兵符、九天真符。 不受之者，三五神兵，不随子东西，出入人间，不来侍卫。 受之者，三五神兵，随子束西，出入侍卫，万邪不干，役召神灵，敢不敬从，一切鬼神，皆惮其威。 正一受道威仪：次当诣师奉受天灵赤官元命符箓。 不受之者，天神地祇，不降尔身，真官散乱，身神飞扬。 受之者，天地兵马，随尔所须，身中吏兵，缠绕其形，坐卧安和，梦想不惊。 正一受道威仪：次当诣师奉受二十八宿七星符箓。 不受之者，诸天星官，不降尔身，延年保命，天官不依，请召不降。 受之者，名上天官，保命延年，祈请星官，立依所言，得道升仙，天门自开。 正一受道威仪：次当诣师奉受都章毕印、四部禁炁。 不受之者，奏章行符，禁制方术，神炁不从，关启不闻。 受之者，符章禁祝，莫不如言。 正一受道威仪：次当诣师奉受三百大章、千二百官。 不受之者，章中吏兵，不受尔言，徒为谨按，身反招愆。 受之奉行，如神心，言此至要，慎勿轻传，依科修行，无诸灾患。 正一受道威仪：次当诣师受紫宫大箓。 不受之者，为国消灾，正天分度，天官不从。 受之勤行，天应尔心，所求所愿，诸天顺从，得道升天，星官下迎，天门开通，魔王保名。 正一受道威仪：次当诣师奉受破魇箓。 不受之者，神炁不行，秽炁不消，行符敕水，召鬼束灵，真神进散，祆邪干形。 受之荡秽，人鬼清明。 正一受道威仪：次当诣师奉受七十二戒、百八十戒。 不受之者，三界四司，考罚尔身，名削善簿，字列罪科，生死父母，不免三涂。 受之奉行，诸天称庆，鬼神所宗，七祖生天，身登云宫。 正一受道威仪：经戒符箓，不诣师受，行之不神，反得偷盗之罪，须诣师受，依法修行，略举要领，诸宜如之。 正一受道威仪：凡欲受道，先诣师门，丹梼拜伏。 师许投辞，请经戒符箓，书写如法，斋粮质信，法衣法物，并备具已。 然后登坛启告，裂券断盟，列辞自状，皆当拣日隔月，不得频繁，及默许易从。",
      "translated_text": "**The Scripture of Orthodox Unity’s Ritual Dignity**\n\n**Scripture Title:** *The Scripture of Orthodox Unity’s Ritual Dignity*. One scroll. Base text from *The Orthodox Daoist Canon*, *Section of Numinous Writings on Ritual Dignity*, *Category of Ritual Dignity*.\n\nThe Supreme Lord says: The ritual dignity for receiving the Orthodox Unity Dao:\n\nFirst, upon entering the Dao’s gate, one must approach the master to receive the covenant contract. Without receiving the covenant contract, the true officials guarding the boundaries of lands, mountains, and rivers will not record one’s Daoist name, and the administrative officials will obstruct and delay, making it difficult to attain the Dao. Upon receiving this covenant contract, the gates of Heaven and Earth dare not delay.\n\nThe ritual dignity for receiving the Orthodox Unity Dao: Next, one must approach the master to receive the register of governance and the Three Refuges and Five Precepts. Those who do not receive these will not be recorded by the governing offices, the local earth gods will remain unenlightened, the five *qi* will not be gathered, and the four administrative bureaus will not be connected. Upon receiving this register of governance, demon kings will bow in submission, calling themselves subordinate officials.\n\nThe ritual dignity for receiving the Orthodox Unity Dao: Next, one must approach the master to receive the talismans of immortals and spirits. Those who do not receive these will find that summoned spirits do not descend, gods do not provide protection, and petitions do not reach their destination. In all matters of reverent observance, spirits will not flow freely, and the Five Emperors of the Three Realms will not respect one’s form. Upon receiving these talismans, one may perform purification rites and petitions, subdue ghosts and expel demons, commanding them first.\n\nThe ritual dignity for receiving the Orthodox Unity Dao: Next, one must approach the master to receive the commands of the Nine Provinces’ earth altars and the governors of the Nine Provinces. Those who do not receive these will, when traveling through the Nine Provinces, be delayed by the spirits of mountains, rivers, and lands wherever they go, and their paths will not be clear. Upon receiving these talismans, ghosts and spirits will show reverence, and one will not be subject to the jurisdiction of earthly officials or demon kings, who will instead protect one’s form.\n\nThe ritual dignity for receiving the Orthodox Unity Dao: Next, one must approach the master to receive the talismans for slaying evil and the registers of the Dharma for slaying evil. Those who do not receive these will be encroached upon by demonic spirits and malevolent ghosts, suffering invasions of weapons and illness. Upon receiving these, one may execute evil and subdue misfortune, causing myriad spirits to conceal themselves, while the spirits of lands, mountains, and rivers will escort and welcome.\n\nThe ritual dignity for receiving the Orthodox Unity Dao: Next, one must approach the master to receive the talismans for warding off the Nine Palaces’ calamities and the Six Harmful Spirits. Those who do not receive these will suffer repeated afflictions of the Nine Calamities and Six Harms, and the malevolent ghosts of the Six Heavens will unleash their power. Upon receiving these, myriad disasters will not encroach, all evil will avoid one, and the Five Emperors of the Three Realms will serve one’s form.\n\nThe ritual dignity for receiving the Orthodox Unity Dao: Next, one must approach the master to receive the talismans of the Nine Heavens’ soldiers and the true talismans of the Nine Heavens. Those who do not receive these will find that the divine soldiers of the Three and Five will not follow one east or west, nor come to attend and protect when one enters and exits the human realm. Upon receiving these, the divine soldiers of the Three and Five will follow one east and west, attending and protecting upon entry and exit, so that myriad evils will not encroach. When summoning and commanding spirits, they dare not disobey, and all ghosts and spirits will dread one’s power.\n\nThe ritual dignity for receiving the Orthodox Unity Dao: Next, one must approach the master to receive the talismans of the Heavenly Numinous Red Officials and the Primordial Destiny. Those who do not receive these will find that heavenly spirits and earthly deities do not descend upon one’s body, true officials scatter in disarray, and the spirits within the body take flight. Upon receiving these, the soldiers and horses of Heaven and Earth will follow one’s needs, the officials and soldiers within the body will encircle one’s form, and one will rest and sleep in peace, undisturbed by dreams.\n\nThe ritual dignity for receiving the Orthodox Unity Dao: Next, one must approach the master to receive the talismans of the Twenty-Eight Constellations and the Seven Stars. Those who do not receive these will find that the stellar officials of the various heavens do not descend upon one’s body, the heavenly officials will not support one’s longevity and life preservation, and petitions and summons will not be answered. Upon receiving these, one’s name will ascend to the heavenly officials, life will be preserved and years extended, and when praying to the stellar officials, they will immediately comply with one’s words, attaining the Dao and ascending as an immortal, with the gates of Heaven opening of their own accord.\n\nThe ritual dignity for receiving the Orthodox Unity Dao: Next, one must approach the master to receive the General Seal of the Complete Chapters and the Fourfold Prohibitive *Qi*. Those who do not receive these will find that when submitting memorials, deploying talismans, or performing prohibitions and methods, the spirit *qi* will not comply, and petitions will not be heard. Upon receiving these, talismans, memorials, prohibitions, and invocations will all proceed as commanded.\n\nThe ritual dignity for receiving the Orthodox Unity Dao: Next, one must approach the master to receive the Three Hundred Great Chapters and the Twelve Hundred Officials. Those who do not receive these will find that the officials and soldiers within the chapters will not heed one’s words, and despite reverent observance, one will instead incur transgressions. Upon receiving and practicing these, one’s words will be as those of the gods, and this is of utmost importance. Guard against careless transmission; follow the regulations in cultivation to avoid all disasters and misfortunes.\n\nThe ritual dignity for receiving the Orthodox Unity Dao: Next, one must approach the master to receive the Great Register of the Purple Palace. Those who do not receive this will be unable to eliminate disasters for the state, rectify the divisions of Heaven, or gain the compliance of heavenly officials. Upon receiving and diligently practicing this, Heaven will respond to one’s heart, and all prayers and wishes will be followed by the various heavens. One will attain the Dao and ascend to Heaven, where stellar officials will descend to welcome, the gates of Heaven will open, and demon kings will protect one’s name.\n\nThe ritual dignity for receiving the Orthodox Unity Dao: Next, one must approach the master to receive the Register for Dispelling Nightmares. Those who do not receive this will find that spirit *qi* does not flow, impure *qi* does not dissipate, and when deploying talismans, consecrating water, summoning ghosts, or binding spirits, true spirits will advance and scatter, while malevolent spirits will encroach upon one’s form. Upon receiving this, impurities will be swept away, and humans and ghosts will be clear and bright.\n\nThe ritual dignity for receiving the Orthodox Unity Dao: Next, one must approach the master to receive the Seventy-Two Precepts and the One Hundred Eighty Precepts. Those who do not receive these will be examined and punished by the Four Administrative Bureaus of the Three Realms, their names erased from the records of good deeds, their offenses listed in the registers of transgressions, and even their parents in life and death will not escape the Three Wretched Realms. Upon receiving and practicing these, the various heavens will rejoice, ghosts and spirits will honor one, the seven generations of ancestors will ascend to Heaven, and one’s body will ascend to the Cloud Palace.\n\nThe ritual dignity for receiving the Orthodox Unity Dao: If one does not approach the master to receive the scriptures, precepts, talismans, and registers, practicing them will lack numinosity and instead incur the sin of theft. One must approach the master to receive them and cultivate according to the Dharma. The above outlines the essentials; all should proceed accordingly.\n\nThe ritual dignity for receiving the Orthodox Unity Dao: Whenever one wishes to receive the Dao, one must first approach the master’s gate, sincerely pray, and prostrate in reverence. Once the master permits and accepts the petition, one may request the scriptures, precepts, talismans, and registers, copying them according to the Dharma. One must prepare ritual provisions, pledges, ritual robes, and ritual implements in full. Only then may one ascend the altar, make declarations, sever former covenants, and list one’s vows and personal circumstances. All should be done on selected days, spaced apart by months, and not done frequently or with tacit permission or ease.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1270,
      "start_sentence": 0,
      "end_sentence": 51,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.397791147232056,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\正一威仪经.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "正一受道威仪：夫受道，须诣有经戒符箓之师，不得虚传声誉，妄受真经，此道大禁，魂考九幽。 正一受道威仪：师无法不得妄授。 弟子拜请，虚传盟誓，风刀万劫，七祖同辜，切慎之焉。 正一受道威仪：同姓九祖，服从已来，不得传授，以为师资。 所以者何，师资犯约，九祖同考。 正一受道威仪：有法即师，勿论奴仆下隶。 若身无戒箓，天之上尊，亦不得师尊法故也。 正一受道威仪：登坛，皆须立三师、五保，监临授度，检察得失，用对三天、五帝之司。 正一受道威仪：登坛付授已，便令弟子冠带法服，传其位号。 弟子称位号，朝本师、及太上十方也。 正一受道威仪：受道毕，以黄素书三师名讳、形状、年几，及登坛三师五保与弟子。 正一受道威仪：受道，各依法位尊卑，不得叨谬，即俗人不得与清信弟子同坐，清信弟子不得与清信道士同坐，清信道士不得与正一道士同坐，正一道士不得与高玄法师同坐，高玄法师不得与洞神法师同坐，洞神法师不得与洞玄法师同坐，洞玄法师不得与洞真法师同坐，洞真法师不得与大洞法师同坐。 登坛行道，斋戒讲说，私房别室，行住坐卧，以此位号，为其尊卑。 上、中、下座，宜相咨白请益，决当自谦下，敬重法教，勿损威仪。 正一法服威仪：受道先具法服，玄冠绛褐，黄裙帔欘，草履执质。 传授既已，便当冠带。 正一法服威仪：法服不得用五色绫锦罗绮，当以缯布，制度如法，常须清净，勿过三通。 正一法服威仪：法服不得辄去身。 若洗濯替代，勿令俗人犯触混杂。 凡衣，常有神男、神女守护。 正一法服威仪：法服不得假借，当须自备。 若破坏，任以火净化之。 若住山林静处，或埋瘗之。 正一法服威仪：法服脱着，置清净之处。 如诣厕溷，把诸物，皆先洗濯手足，然后取之。 正一入靖威仪：先整顿法服，澡漱祝诵，旋行唱赞，并须如法，不得随宜，吏兵谪言。 正一入靖威仪：登坛入室，临事不得责骂於人，及与外人交言，左右回顾，执心不专。 正一入靖威仪：靖中所须，皆当预备，不得临时阙少，呼外人求索。 正一入靖威仪：入靖，脱着履屦，皆须面向经像，不得回背出入。 举足，随其左右，顺其阴阳。 正一启奏威仪：西面平立，执简曲躬，调声正气，直词小语，朴略曲素，勿得厉响繁饰。 正一启奏威仪：至心丹祷，情诉恳恻，随事简要，勿失威仪。 为己及人，皆当一意，不得惰慢。 正一启奏威仪：凡诸所请，先自悔过，然后请事，一高辞撙正，情理须中，勿多绮饰，失其诚恳。 正一启奏威仪：初中后心，皆当专一，言辞准定，事意齐同，不得旦夕异陈，初恭终慢。 正一读经威仪：冠带祝漱，捻香存念，须依本文，端身恭坐，调柔声气，至心诵读，从标至轴，不得中停。 正一读经威仪：读经，须心心相继，念念不绝，无中漏忘。 若误言句，却五百言毕，启谢自叹厥怀。 正一读经威仪：五百言，若千言，及章末，辄许咽液，饮诸清水，以利声 气，於法不亏。 正一读经威仪：毕卷，若有事中起时，收经入函韫，三捻香礼拜，还亦如之。 正一读经威仪：先当洗手、熏手及经，然后读之。 竟，复敛净洗手，不得正尔便行。 正一读经威仪：读经，皆先就师，受其音旨句度，谙识文字，不得经堂之中，临事交错，谊乱众人。",
      "translated_text": "The Ritual Dignity for Receiving the Orthodox Unity Dao: To receive the Dao, one must approach a master who possesses the scriptures, precepts, talismans, and registers. One must not falsely transmit reputation or recklessly receive the true scriptures—this is a major prohibition of the Dao, and violation shall condemn the soul to the Nine Dark Realms.\n\nThe Ritual Dignity for Receiving the Orthodox Unity Dao: A master without the Dharma must not recklessly transmit it. If a disciple makes a petition and falsely transmits covenants and vows, ten thousand kalpas of wind and blade shall befall them, and their seven generations of ancestors shall share the guilt—this must be strictly heeded.\n\nThe Ritual Dignity for Receiving the Orthodox Unity Dao: Those of the same surname, from nine generations of kinship, may not transmit the teachings to one another as master and disciple. Why is this? If master and disciple violate the covenant, the nine generations of ancestors shall share the punishment.\n\nThe Ritual Dignity for Receiving the Orthodox Unity Dao: One with the Dharma is a master, regardless of whether they are a servant or subordinate. If one lacks the precepts and registers, even if they are a celestial exalted being, they may not presume to act as a master due to the Dharma.\n\nThe Ritual Dignity for Receiving the Orthodox Unity Dao: When ascending the altar, one must establish the Three Masters and Five Guarantors to oversee the transmission, inspecting gains and losses, and addressing the offices of the Three Heavens and Five Emperors.\n\nThe Ritual Dignity for Receiving the Orthodox Unity Dao: After ascending the altar and completing the transmission, the disciple shall be dressed in ritual robes and bestowed with their rank and title. The disciple shall then recite their rank and title, paying homage to their original master and the Most High of the Ten Directions.\n\nThe Ritual Dignity for Receiving the Orthodox Unity Dao: Upon completion of receiving the Dao, the names, appearances, and ages of the Three Masters shall be recorded on yellow silk, along with those of the Three Masters, Five Guarantors, and the disciple who ascended the altar.\n\nThe Ritual Dignity for Receiving the Orthodox Unity Dao: When receiving the Dao, each shall adhere to their proper rank and dignity. One must not presume or err: laypersons may not sit with the devout disciples, devout disciples may not sit with the devout Daoists, devout Daoists may not sit with Orthodox Unity Daoists, Orthodox Unity Daoists may not sit with High Mystery Dharma Masters, High Mystery Dharma Masters may not sit with Cavern Spirit Dharma Masters, Cavern Spirit Dharma Masters may not sit with Cavern Mystery Dharma Masters, Cavern Mystery Dharma Masters may not sit with Cavern Perfection Dharma Masters, and Cavern Perfection Dharma Masters may not sit with Great Cavern Dharma Masters. When ascending the altar to perform the Dao, during fasts, lectures, or in private chambers, whether walking, standing, sitting, or reclining, these ranks shall determine their dignity. For the upper, middle, and lower seats, one should consult and seek guidance, always remaining humble and reverent toward the Dharma teachings, never impairing ritual dignity.\n\nThe Ritual Dignity for Orthodox Unity Ritual Robes: Before receiving the Dao, one must prepare the ritual robes: a dark cap, crimson-brown robe, yellow skirt and sash, straw sandals, and a ritual tablet. After transmission, one shall then don the cap and sash.\n\nThe Ritual Dignity for Orthodox Unity Ritual Robes: Ritual robes must not be made of five-colored silks, brocades, or fine fabrics. They shall be made of plain silk or cloth, following proper regulations, and kept pure, not exceeding three layers.\n\nThe Ritual Dignity for Orthodox Unity Ritual Robes: Ritual robes must not be casually removed. When washing or replacing them, one must not allow laypersons to touch or mix them with common garments. All robes are constantly guarded by divine men and women.\n\nThe Ritual Dignity for Orthodox Unity Ritual Robes: Ritual robes must not be lent to others; one must prepare their own. If damaged, they may be purified by fire. If residing in mountain forests or secluded places, they may be buried.\n\nThe Ritual Dignity for Orthodox Unity Ritual Robes: When removing or donning ritual robes, place them in a pure location. When visiting the privy or handling objects, one must first wash hands and feet before touching them.\n\nThe Ritual Dignity for Entering the Oratory: First, adjust the ritual robes, perform ablutions, recite invocations, and circumambulate while chanting praises—all must be done according to the Dharma, not casually. One must not utter vulgar or punitive words.\n\nThe Ritual Dignity for Entering the Oratory: When ascending the altar or entering the chamber, one must not scold others or converse with outsiders, glance around, or allow the mind to wander.\n\nThe Ritual Dignity for Entering the Oratory: All necessities within the oratory must be prepared in advance; one must not lack anything at the last moment and call for outsiders to seek supplies.\n\nThe Ritual Dignity for Entering the Oratory: When entering the oratory, remove or don sandals while facing the scriptures and images, never turning one’s back. When lifting the feet, follow the left and right in accordance with yin and yang.\n\nThe Ritual Dignity for Memorial Presentations: Stand facing west, hold the tablet with a slight bow, regulate the voice and qi, speak plainly and softly, with simple and unadorned words—one must not raise the voice or use excessive embellishment.\n\nThe Ritual Dignity for Memorial Presentations: Sincerely pray with earnest devotion, expressing one’s pleas with sincerity. Be concise in matters, never losing ritual dignity. Whether for oneself or others, one must remain single-minded, never negligent or careless.\n\nThe Ritual Dignity for Memorial Presentations: For all petitions, first repent one’s transgressions, then make the request. Speak with elevated and restrained words, ensuring the sentiment and reason are appropriate. Do not over-embellish and lose sincerity.\n\nThe Ritual Dignity for Memorial Presentations: From beginning to end, remain single-minded, with consistent words and intent. Do not present different matters morning and evening, or begin with reverence and end with carelessness.\n\nThe Ritual Dignity for Scripture Recitation: Don the cap and sash, perform ablutions, hold incense, and focus the mind. Follow the original text, sit upright with reverence, regulate the voice and qi, and recite with utmost sincerity from beginning to end without pause.\n\nThe Ritual Dignity for Scripture Recitation: When reciting scriptures, maintain unbroken concentration, thought after thought, without omission or forgetfulness. If a word or phrase is mispronounced, after five hundred words, pause to acknowledge the error and reflect on one’s heart.\n\nThe Ritual Dignity for Scripture Recitation: After five hundred or one thousand words, or at the end of a chapter, one may swallow saliva or drink pure water to benefit the voice and qi, without violating the Dharma.\n\nThe Ritual Dignity for Scripture Recitation: Upon completing a scroll, if interrupted by matters, place the scripture in its case, offer incense three times, and bow. When resuming, do the same.\n\nThe Ritual Dignity for Scripture Recitation: First wash the hands, fumigate the hands and scripture, then recite. After finishing, again wash the hands cleanly; do not proceed immediately.\n\nThe Ritual Dignity for Scripture Recitation: Before reciting scriptures, first approach the master to receive the proper pronunciation, phrasing, and recognition of characters. Do not create confusion in the scripture hall or disrupt others.",
      "overlap_context": "verence. Once the master permits and accepts the petition, one may request the scriptures, precepts, talismans, and registers, copying them according to the Dharma. One must prepare ritual provisions, pledges, ritual robes, and ritual implements in full. Only then may one ascend the altar, make declarations, sever former covenants, and list one’s vows and personal circumstances. All should be done on selected days, spaced apart by months, and not done frequently or with tacit permission or ease.",
      "start_char": 1271,
      "end_char": 2586,
      "start_sentence": 52,
      "end_sentence": 95,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.58039569854736,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\正一威仪经.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "正一读经威仪：读经之时，不得受人借问文句意义，及为人解说问难，处分他事，杂乱真灵。 正一读经威仪：经中不了，须有谘诀，及问文字句度，皆当别时，就师拜请，勿得随宜，辄则谘求。 正一讲经威仪：弟子先当谘白法师，为某等、若男女、若某事、请於某处、讲说某经，愿见开悟。 正一讲经威仪：法师许已，装严高座於讲堂中，百座、千座，皆当如法，威仪可观。 正一讲经威仪：安置高座，东西南北，随其所宜，左经右师，男东女西，勿令混杂，失其威仪。 正一讲经威仪：如意几拂、香炉函韣、经案巾帕、旛华帐盖、敷张床席，悉须如法，不得随宜。 正一讲经威仪：弟子听众，各持香华，旛幢音乐，唱赞导引，烧香礼拜，迎请法师，随时来往，不得阙怠。 正一讲经威仪：法师随事，为诸道俗，忏悔礼愿，受戒持斋，时时劝化，使悟道真，弘道利物，於此为先。 正一讲经威仪：法师以讲经功德，装严国主人王、大臣宰辅、土地官长、人民品物、五苦三涂、一切众生，悟道成真。 正一讲经威仪：讲经毕，弟子及诸听众，一切有心，随分发意，建大宝斋，福被无边。 正一事师威仪：旦夕，正其法服，执简朝本师、三师，如父母礼。 若同居住，晨昏省觐，和颜悦色。 正一事师威仪：远师百里，一月一省； 二百里，三月； 五百里已上，一年。 若师有疾病、老劣、他故，不依此限，书疏无限。 正一事师威仪：省师，皆自赍，粮食所须、香油之属，悉不得损耗於师。 正一事师威仪：弟子以时赏师。 衣服药物、几杖巾拂、履屦瓶器、米麦果菜，供其所须，勿使乏少。 正一事师威仪：师有疾病、灾厄，供侍左右，为建功德，烧香礼忏，放生赎命，延年度厄，设斋行道。 正一事师威仪：师亡，持服百日，心丧三年，殡诸山林，几棺布囊，举尸而已。 造众福田，思念容止。 正一奉斋威仪：为已及人，建诸斋福、皆须精志，所有米麦，并须清净，不得假换，私窃非义等物。 正一奉斋威仪：凡为吉凶、生死福业，先当修斋，造一切功德。 成就日，皆须设斋庆喜。 正一奉斋威仪：凡斋，皆有三界五帝、四司灵官，监察其所供斋用，不得污秽偷窃。 正一奉斋威仪：登斋供施，若贵若贱，若老若少，皆当平等，不得生诸二心，起爱憎念。 正一奉斋威仪：所请斋官，随分施散，名为买福，不得口许心悔，生不均意，起怠慢想。 正一奉斋威仪：斋官起供，依位行列，启告陈请，各称名位，不得交互，须依次第告知，勿使偏并不平。 正一奉斋威仪：主人列辞，具陈事意，诣请投辞。 法师受疏，依名告赴，不得违越失时，更受便近家供。 正一奉斋威仪：斋官随分食已，余便折还主人，不得将归，清诤众食，亦不得啖，各宜慎之。 正一奉斋威仪：八解、十直、甲子、庚申、本命、八节吉辰，皆宜持斋，三界五帝、四天十部，悉来监临。 正一受诫威仪：三戒、五戒、六戒、九戒、十二可从戒、二十七戒、四十六戒、七十二戒、八十戒、百二十戒、三百戒，各依法受持。 正一受戒威仪：若国主人王、大臣宰辅、人民男女，及以鬼神，一切众生，各随分授与，敕护戒神官，使其营卫，万灾不干。 正一受戒威仪：持戒之人，不得与非持戒人同床共席，行住坐卧，饮食居止，衣服履屦，车舆几杖，皆宜异之。",
      "translated_text": "**The Ritual Dignity for Scripture Recitation:** While reciting scriptures, one must not entertain others’ requests to explain the meaning of passages, nor engage in clarifying doubts, handling miscellaneous affairs, or disrupting the true and numinous.\n\n**The Ritual Dignity for Scripture Recitation:** If there are unclear points in the scripture requiring consultation or questions about characters, phrasing, or pronunciation, one should do so at another time, approaching the master with reverence to seek instruction. One must not casually inquire as the need arises.\n\n**The Ritual Dignity for Scripture Exposition:** Disciples must first consult and inform the Dharma master, stating: “For so-and-so—whether men or women—or for such-and-such a matter, we request at such-and-such a place the exposition of such-and-such a scripture, wishing to receive enlightenment.”\n\n**The Ritual Dignity for Scripture Exposition:** Once the Dharma master grants permission, prepare and adorn a high seat in the lecture hall. Whether for a hundred or a thousand listeners, all must be arranged according to ritual, with dignity befitting the occasion.\n\n**The Ritual Dignity for Scripture Exposition:** When setting up the high seat, orient it east, west, south, or north as appropriate. Place the scripture to the left and the master to the right. Men should be seated to the east, women to the west. Do not allow mingling, lest the dignity be lost.\n\n**The Ritual Dignity for Scripture Exposition:** The ritual fan, whisk, incense burner, scripture case, lectern cloth, banners, flowers, canopy, and seating mats must all be arranged according to proper form. Nothing should be done casually.\n\n**The Ritual Dignity for Scripture Exposition:** Disciples and listeners, each bearing incense and flowers, along with banners, pennants, and music, should chant praises and lead the procession, burning incense and bowing to welcome the Dharma master. They must come and go in accordance with the occasion, without negligence.\n\n**The Ritual Dignity for Scripture Exposition:** The Dharma master, in accordance with the circumstances, should guide both Daoists and laypeople in repentance, vows, precepts, and fasting, frequently exhorting them to awaken to the true Dao. Spreading the Dao and benefiting beings takes precedence in this.\n\n**The Ritual Dignity for Scripture Exposition:** The Dharma master dedicates the merit of scripture exposition to adorn the lord of the realm, high ministers, local officials, all people and creatures, those in the five sufferings and three evil destinies, and all sentient beings, that they may awaken to the Dao and attain perfection.\n\n**The Ritual Dignity for Scripture Exposition:** Upon concluding the exposition, disciples and all listeners, each according to their capacity, should resolve to establish a grand treasure fast, that boundless blessings may spread.\n\n**The Ritual Dignity for Serving the Master:** Morning and evening, one must properly don the ritual attire and, holding a tablet, pay homage to one’s primary master and the Three Masters, as one would to one’s parents. If residing together, one should inquire after them morning and night, with a kind and joyful countenance.\n\n**The Ritual Dignity for Serving the Master:** If the master is a hundred *li* away, visit once a month; if two hundred *li*, once every three months; if five hundred *li* or more, once a year. If the master is ill, aged, or otherwise indisposed, these limits do not apply, and written correspondence is unrestricted.\n\n**The Ritual Dignity for Serving the Master:** When visiting the master, one must personally bring provisions—food, incense, oil, and the like—without causing any loss or expense to the master.\n\n**The Ritual Dignity for Serving the Master:** Disciples should provide for the master in a timely manner: clothing, medicine, ritual implements, staffs, towels, whisks, shoes, vessels, rice, wheat, fruits, and vegetables. Supply all necessities without allowing any deficiency.\n\n**The Ritual Dignity for Serving the Master:** If the master falls ill or encounters misfortune, attend to them closely, perform meritorious deeds, burn incense, repent, release living beings, and redeem lives. Establish fasts and practice the Dao to extend their years and avert calamity.\n\n**The Ritual Dignity for Serving the Master:** Upon the master’s passing, observe mourning for a hundred days and maintain a heart of mourning for three years. Bury them in the mountains, using a simple coffin or cloth shroud, merely to contain the body. Create fields of merit and reflect upon their bearing.\n\n**The Ritual Dignity for Observing Fasts:** Whether for oneself or others, when establishing fasts and blessings, one must do so with utmost sincerity. All rice and wheat must be pure, without substitution, theft, or improper acquisition.\n\n**The Ritual Dignity for Observing Fasts:** For all auspicious or inauspicious occasions, matters of life and death, or meritorious deeds, one should first perform a fast and undertake all virtuous acts. On the day of completion, a fast must be held to celebrate.\n\n**The Ritual Dignity for Observing Fasts:** All fasts are overseen by the Three Realms, the Five Emperors, and the Four Divine Officials, who inspect the offerings. Nothing may be defiled or stolen.\n\n**The Ritual Dignity for Observing Fasts:** When ascending to the fast and making offerings, whether noble or humble, old or young, all must be treated equally. One must not harbor dual intentions or generate thoughts of attachment or aversion.\n\n**The Ritual Dignity for Observing Fasts:** The officiants of the fast should distribute offerings according to their portion, thereby purchasing blessings. One must not verbally agree while harboring regret, nor generate dissatisfaction or negligence.\n\n**The Ritual Dignity for Observing Fasts:** When the officiants present offerings, they must proceed in order, announcing their names and positions. No intermingling is permitted; one must follow the sequence and announce clearly, without bias or imbalance.\n\n**The Ritual Dignity for Observing Fasts:** The host should present a formal address, clearly stating the purpose, and proceed to invite the Dharma master. The Dharma master, upon receiving the petition, should respond according to the names and not delay or accept nearby household offerings out of convenience.\n\n**The Ritual Dignity for Observing Fasts:** After the officiants have eaten their portion, the remainder should be returned to the host. It must not be taken home, nor should the communal food be contested or consumed. All should exercise caution.\n\n**The Ritual Dignity for Observing Fasts:** On the Eight Liberations, Ten Upright Days, Jiazi, Gengshen, one’s own life-day, and the eight auspicious solar terms, one should observe fasts. The Three Realms, Five Emperors, Four Heavens, and Ten Divisions all come to oversee.\n\n**The Ritual Dignity for Receiving Precepts:** The Three Precepts, Five Precepts, Six Precepts, Nine Precepts, Twelve Permissible Precepts, Twenty-Seven Precepts, Forty-Six Precepts, Seventy-Two Precepts, Eighty Precepts, One Hundred Twenty Precepts, and Three Hundred Precepts—each should be received and upheld according to their proper form.\n\n**The Ritual Dignity for Receiving Precepts:** Whether for the lord of the realm, high ministers, local officials, men and women of the people, or even spirits and all sentient beings, precepts should be conferred according to their capacity. Command the guardian deities of the precepts to protect them, that no calamities may befall.\n\n**The Ritual Dignity for Receiving Precepts:** Those who uphold the precepts must not share a bed or seat with those who do not. In walking, standing, sitting, lying, eating, dwelling, clothing, footwear, vehicles, staffs, and ritual implements, all should be kept distinct.",
      "overlap_context": "se, offer incense three times, and bow. When resuming, do the same.\n\nThe Ritual Dignity for Scripture Recitation: First wash the hands, fumigate the hands and scripture, then recite. After finishing, again wash the hands cleanly; do not proceed immediately.\n\nThe Ritual Dignity for Scripture Recitation: Before reciting scriptures, first approach the master to receive the proper pronunciation, phrasing, and recognition of characters. Do not create confusion in the scripture hall or disrupt others.",
      "start_char": 2587,
      "end_char": 3909,
      "start_sentence": 96,
      "end_sentence": 131,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.71970248222351,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\正一威仪经.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "正一忏悔威仪：旦夕朝真，登坛入靖，读经礼拜，先当忏悔国主人王、大臣宰辅、土地官长、父母师尊、三涂五苦、一切众生，后及己身。 正一忏悔威仪：行住坐卧，举心运意，三业六根，故误成罪，犹如沙尘，注心忏悔，后心不生，一切清净，万罪消除。 正一礼拜威仪：入靖朝真，行住坐卧，若心及形，礼拜五亿诸天、十方世界，真应化法无量天尊、仙真圣众。 正一礼拜威仪：动心运形，归依虚空，微尘沙数，过去、未来、见在三世，无极大道，大身小身，无量等身，一切敬礼。 正一礼拜威仪：上自大罗，下穷无际，十方三界，大道应化，说法演教，三十六部，真法化法，外藏内藏，符图宝经，普起归依。 正一烧香威仪：先当洗拭香奁、炉挟、匙盘、灰炭等具，然后装治，平正莹净，火不见赤，法则可观。 正一烧香威仪：所有灰炭火等，皆当别贮，不得以灶下爨，余及不净，柴薪荤秽，非法处灰火。 正一烧香威仪：凡是捻香，皆须三指端身，正意坐立，宜就取便三指捻之。 每当三献，使烟气相续，不得中停。 正一烧香威仪：祈告启请，入靖登坛，使昼夜相续，勿令断绝，而神道无形，寄香气宣通。 正一烧香威仪：凡诸读经行道，斋戒礼诵，讲说祈告，皆先行香三周，然后列辞。 正一烧香威仪：上界天香，千名万号，不焚自熏，迎风随云，周徧十方。 下界凡境，任世有无，众事之中，唯此难阙。 正一然灯威仪：灯象星形，助天光明，延年续命，却祸消灾，一灯十灯，百灯千灯，万万亿灯，在时所能。 正一然灯威仪：行道读经，礼拜讲说，周绕坛座，如环列星，一万二千，应天之精，昼没夜明，顺炁修行。 正一然灯威仪：然灯，去地三尺，作笼盖之，勿使飞虫得入，及绝风尘飘污。 正一鸣钟威仪：钟者，威仪宝器，四众所听，六时急务，不可阙也。 左钟右经，皆置台阁举之。 正一鸣钟威仪：若二时、三时、六时、九时、十二时，皆须整顿衣服，洗手漱口，调正身心，先叩齿诵咒，然后打之。 正一鸣钟威仪：打钟法，先须穊渐疏，徐打三槌，上谓之三下后，先穊渐疏，徐打二十四槌概之，谓之长打。 复初渐穊，徐打十二槌，谓之终。 合三十九槌，以应三十九户。 正一鸣钟威仪：三下钟，安致灯火，整饰席座，澡漱冠带，悉须如法，候打长钟，徐徐举出之，众会所依位行列，香华赞引，并宜齐整。 待后起钟，唱导举声，行不得临时迫注，失其威仪。 正一鸣钟威仪：不得失时，及非法打击。 若非时集众，别立小钟。 正一鸣磬威仪：以止节，登坛入室，威仪所须，每礼拜称善，初终导引，俯仰节度，斋讲坐起，皆当击之。 正一章奏威仪：章法最难，慎不得轻，纸墨令净，辞状正直，须合真气，勿使谬妄，吏兵陈论。 正一章奏威仪：拜章面向，随其所申，皆当别立席座，巾案如法，低身小坐，平声读之，勿得高傲不恭。 正一章奏威仪：不受治箓、千二百官君、三百六十大章、都章毕印，皆不合奏章出官，各出身中仙官，不得谬监。 正一醮请威仪：醮者，祈天地神灵之享也。 亦有多种，所有饼果，并须清洁，不得肉脯荤秽，天官不佑。 正一醮请威仪：所信物，不得假借，阙少不充，欺诳明灵。",
      "translated_text": "**The Ritual Dignity for Repentance:** At dawn and dusk, one faces the true and ascends the altar to enter the oratory, reciting scriptures and performing prostrations. First, repent for the lord of the realm, high ministers, local officials, parents, teachers, those in the Three Wretched Realms and Five Sufferings, and all sentient beings; then, for oneself.\n\n**The Ritual Dignity for Repentance:** In walking, standing, sitting, and lying down, with every thought and intention, the three karmas and six senses may inadvertently commit transgressions—like grains of sand and specks of dust. Focus the mind in repentance, ensuring no further wrongdoing arises, that all may be purified and myriad transgressions dissolved.\n\n**The Ritual Dignity for Prostration:** Upon entering the oratory to face the true, in walking, standing, sitting, and lying down, whether in mind or form, prostrate to the Five Hundred Million Devas of the Ten Directions, the boundless true, responsive, and transformed manifestations of the Heavenly Worthies, and the host of immortals and sages.\n\n**The Ritual Dignity for Prostration:** With every thought and movement, take refuge in the empty vastness, as numerous as motes of dust and grains of sand—past, future, and present—bowing to the limitless Dao, the great and small bodies, the infinite equal bodies, in reverence to all.\n\n**The Ritual Dignity for Prostration:** From the Great Lofty Heaven above to the boundless depths below, across the Ten Directions and Three Realms, the Dao manifests in response, expounding the teachings. In the Thirty-Six Divisions, the true and transformed Dharma, the outer and inner treasuries, talismans, charts, and sacred scriptures—all are venerated with devotion.\n\n**The Ritual Dignity for Burning Incense:** First, cleanse the incense box, censer, tongs, spoon, tray, ashes, and charcoal, then arrange them properly, ensuring all is level, polished, and pure. The fire should not show red embers, and the ritual form should be observed.\n\n**The Ritual Dignity for Burning Incense:** All ashes, charcoal, and fire must be stored separately. Do not use hearth embers, leftover fires, or impure fuels—such as tainted wood or foul substances—nor discard ashes in improper places.\n\n**The Ritual Dignity for Burning Incense:** When shaping incense, use three fingers, hold the body upright, and maintain a focused mind, whether sitting or standing. Take the incense conveniently with three fingers.\n\n**The Ritual Dignity for Burning Incense:** With each of the three offerings, ensure the smoke rises continuously, without interruption.\n\n**The Ritual Dignity for Burning Incense:** In prayers, invocations, entering the oratory, and ascending the altar, let the incense burn day and night without cease, for the divine beings, though formless, communicate through the fragrance.\n\n**The Ritual Dignity for Burning Incense:** Before reciting scriptures, performing the Dao, observing fasts, chanting, lecturing, or praying, first circumambulate with incense three times, then present the words.\n\n**The Ritual Dignity for Burning Incense:** The incense of the celestial realms has a thousand names and myriad forms, perfuming all without burning, carried by wind and clouds to fill the Ten Directions. In the mortal world, among all things, only this is indispensable.\n\n**The Ritual Dignity for Lighting Lamps:** Lamps, shaped like stars, aid the light of heaven, prolong life, avert misfortune, and dispel calamities. Whether one lamp, ten lamps, a hundred, a thousand, ten thousand, or a hundred million—let it be according to one’s capacity.\n\n**The Ritual Dignity for Lighting Lamps:** In performing the Dao, reciting scriptures, prostrating, lecturing, or circumambulating the altar, arrange the lamps like stars in a ring—twelve thousand in number, corresponding to the essence of heaven. They shine by night and fade by day, aligning with qi in cultivation.\n\n**The Ritual Dignity for Lighting Lamps:** When lighting lamps, place them three feet above the ground, covering them with a canopy to prevent insects from entering and to shield them from wind and dust.\n\n**The Ritual Dignity for Ringing the Bell:** The bell is a precious instrument of ritual dignity, heard by the four assemblies, an urgent task in the six periods—it must not be omitted. Place the bell to the left and scriptures to the right, both on raised platforms.\n\n**The Ritual Dignity for Ringing the Bell:** At the second, third, sixth, ninth, and twelfth hours, one must adjust one’s attire, wash hands, rinse the mouth, compose body and mind, first knock the teeth and recite the incantation, then strike the bell.\n\n**The Ritual Dignity for Ringing the Bell:** The method of striking the bell: first, strike densely then sparsely, slowly sounding three strokes—this is called the \"three initial strikes.\" Then, strike densely then sparsely, slowly sounding twenty-four strokes to conclude—this is called the \"long strike.\" Return to the initial density, slowly sounding twelve strokes—this is called the \"end.\" In total, thirty-nine strokes, corresponding to the thirty-nine households.\n\n**The Ritual Dignity for Ringing the Bell:** After the three initial strikes, arrange lamps and fires, prepare seats, wash, rinse, and don proper attire. Wait for the long strike, then proceed slowly. The assembly should align in proper order, with incense, flowers, and hymns all arranged with dignity. When the final bell sounds, begin the chanting and guiding, ensuring no haste disrupts the ritual decorum.\n\n**The Ritual Dignity for Ringing the Bell:** Do not miss the proper time or strike the bell improperly. For unscheduled gatherings, use a smaller bell.\n\n**The Ritual Dignity for Striking the Chime Stone:** It marks the rhythm when ascending the altar or entering the chamber, as required by ritual dignity. Strike it at the beginning and end of prostrations, when praising, in guiding movements, during bows and rises, and in fasts and lectures.\n\n**The Ritual Dignity for Memorials:** The art of memorials is most difficult—do not treat it lightly. Ensure the paper and ink are clean, the wording upright and proper, aligned with true qi, without falsehood or error, as the divine officials will deliberate.\n\n**The Ritual Dignity for Memorials:** When bowing to present a memorial, face the direction of submission. Set up a separate seat and table, arrange the cloth and case properly, sit humbly, and read in an even voice—do not act arrogantly or irreverently.\n\n**The Ritual Dignity for Memorials:** Without receiving the Register of Governance, the Twelve Hundred Official Lords, the Three Hundred Sixty Great Memorials, or the Complete Seal of Memorials, one may not submit memorials to the celestial bureaus. Each must manifest their own immortal officials—do not falsely claim oversight.\n\n**The Ritual Dignity for Offering Sacrifices:** Sacrifices are offerings to the gods of heaven and earth. There are many kinds, and all cakes and fruits must be pure—do not use meat, dried flesh, or foul substances, lest the celestial officials not grant protection.\n\n**The Ritual Dignity for Offering Sacrifices:** All pledged offerings must not be borrowed. If insufficient, do not deceive the enlightened spirits.",
      "overlap_context": "ls, men and women of the people, or even spirits and all sentient beings, precepts should be conferred according to their capacity. Command the guardian deities of the precepts to protect them, that no calamities may befall.\n\n**The Ritual Dignity for Receiving Precepts:** Those who uphold the precepts must not share a bed or seat with those who do not. In walking, standing, sitting, lying, eating, dwelling, clothing, footwear, vehicles, staffs, and ritual implements, all should be kept distinct.",
      "start_char": 3910,
      "end_char": 5187,
      "start_sentence": 132,
      "end_sentence": 164,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.92855215072632,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\正一威仪经.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "事毕，施散山栖道士、饥寒老病、囚徒役人。 正一醮请威仪：事毕，所设饼果食讫，余皆埋之。 正一醮请威仪：当夜半已后，日中之前，生气之时。 正一醮请威仪：所用饼果，并须芳新，不得经宿，及生产尸秽、家鸟鼠食余，则神灵不饮，徒失尔功。 正一法具威仪：道士法具，香炉澡灌、几拂如意、环佩剑杖，当常整饰，安置供养，随事所须。 正一食器威仪：道士食器，三重匙挟巾帕，并须如法，不得用金银宝玉、牙角雕镂，混杂凡器，常须清净。 正一器用威仪：道士器用漱盘，众生食盘，注留澡盆，捣香臼杵，合药釜甑，随事所宜，不可假借。 正一居处威仪：道士居处，朴素虚净，内外开通，勿张帐幔帘幌屏障之属，遮拥左右。 正一居处威仪：道士居处，卑房小室，容身而已，不得高堂广屋，雕画赭垩，华丽显敞。 正一居处威仪：道士居处，依壁敷床，不得前后合铺，坐卧独居，勿同诸凡人。 正一居处威仪：道士居处，藜床布被，奠席蒲盖，绳床夹漆，木盘瓦器，不得用铜铁金银。 正一卧具威仪：布单布被，枕石木屦，及裙襦衫袴，皆当缯布，染作荆黄，栀子竹叶，黄屑坏色。 正一屦履威仪：作山形二仪，皮布缦饰，不得五色锦绮装褫。 若草屦、木履，皆须异俗，勿杂世凡。 正一泉井威仪：道士居住，先须井泉，常使清净，勿令六畜杂物污秽，皆别立泉井，浣濯饮食牛马畜产。 正一井泉威仪：凡诸泉井，须数淘泄，勿使草木华叶蛙蝇落中。 人家客院各立井泉，无杂供斋所用。 正一用水威仪：凡诸造食，煎炊药物，洗院衣服，沐浴澡洁，所须用水，皆立滤器，令甚细密，先当滤之。 正一饮食威仪：道士饮食，满腹而已，勿求精细，常当奉斋，非时非法，悉不得食。 正一饮食威仪：道士常当受食咒，施出种种食，别安器中，存见三一，与形俱食，以挟三击器。 就食别器，布散众生。 正一饮食威仪：道士各立斋器，巾挟当清净，日供所须，不得与人同器共食，及给他用，秽炁混杂。 正一饮食威仪：道士饮食，不得使人秽触所食之物，不得临上，令口气衣服污秽。 余便施散，不得积聚将归。 正一饮食威仪：道士食讫乞忏，然后施散，不得中举乞人，及使仆侍从鸡狗之流。 监斋真官，皆见谪罚，名书三官。 正一动止威仪：道士行住坐卧，皆当合道，正容敛色，端直其身，不得倾斜，失其仪相，威仪先首，可不慎之。 正一游行威仪：道士游诣府署、省侍师尊、教化人间、斋请入俗，五人、三人，皆当依法庠序，正其容仪，不得交杂，轨则有失。 正一游行威仪：道士游诣人间，及赴斋讲，各持座褥，随处自居，既限秽气，又别尊卑，上、中、下座，大小同制。 正一住观威仪：道士既入道讫，即须住观，持护法相，旦夕烧香，朝真礼忏，奉侍师尊，受持禁戒，谘问大德，学道方法。 正一住观威仪：更相教诲，自惜法身，修善止恶，存念三宝，慈惠和柔，每事恭顺，成就道场，外人干犯，皆当念忍。 正一住观威仪：上下和睦，尊卑信顺，如运手足，存立常住，香油米麦、樵菜等物，相共营求，皆同一己，不得费用。 正一住观威仪：庄田碾硙，家人使役，五行什物、六畜器具，果木叶药一切所须，皆共爱惜，供养十方，当来福田。",
      "translated_text": "When the rites are complete, distribute offerings to mountain-dwelling Daoists, the hungry and cold, the elderly and infirm, prisoners, and laborers.\n\n**The Ritual Dignity for Offering Sacrifices:** When the rites are complete, bury all remaining cakes and fruits after the food has been set out.\n\n**The Ritual Dignity for Offering Sacrifices:** The proper time is after midnight and before midday, when the qi of life is ascendant.\n\n**The Ritual Dignity for Offering Sacrifices:** All cakes and fruits used must be fresh and fragrant; do not use those left overnight, nor those tainted by birth impurity, corpses, or remnants gnawed by domestic fowl or rats, lest the spirits refuse to partake and your efforts be in vain.\n\n**The Ritual Dignity for Daoist Ritual Implements:** A Daoist’s ritual implements—incense burners, washing vessels, small tables, dusters, ruyi scepters, pendants, swords, and staffs—must always be kept in good order, arranged and offered according to their use.\n\n**The Ritual Dignity for Eating Utensils:** A Daoist’s eating utensils—three-tiered spoons, chopsticks, napkins, and cloths—must all be proper; do not use gold, silver, precious jades, ivory, or carved horn, nor mix them with ordinary vessels. They must always be kept pure.\n\n**The Ritual Dignity for Utensils:** A Daoist’s utensils—rinsing trays, communal food plates, water basins, pestles and mortars for grinding incense, and cauldrons and steamers for compounding medicines—must be suited to their purpose and not borrowed.\n\n**The Ritual Dignity for Dwellings:** A Daoist’s dwelling should be simple, unadorned, and serene, with open space inside and out; do not hang curtains, screens, or drapes that obstruct the surroundings.\n\n**The Ritual Dignity for Dwellings:** A Daoist’s dwelling should be a humble room, just large enough to accommodate the body; do not reside in grand halls or spacious chambers adorned with carvings, red ochre, or whitewash, nor in lavish or ostentatious quarters.\n\n**The Ritual Dignity for Dwellings:** A Daoist’s dwelling should have a bed placed against the wall; do not arrange beds to face one another. Sit and sleep alone; do not share quarters with ordinary people.\n\n**The Ritual Dignity for Dwellings:** A Daoist’s dwelling should have a bed of chaste tree wood, a cloth cover, a mat of woven grass, a lacquered frame, a wooden tray, and earthenware vessels; do not use bronze, iron, gold, or silver.\n\n**The Ritual Dignity for Bedding:** Use cloth sheets, cloth covers, a stone or wooden pillow, straw sandals, skirts, jackets, shirts, and trousers—all made of hempen cloth dyed with indigo, gardenia, bamboo leaves, or turmeric to a muted yellow hue.\n\n**The Ritual Dignity for Footwear:** Craft sandals in the shape of mountains and the Two Modes, adorned with plain leather or cloth; do not embellish them with five-colored brocade or fine silk. If using straw sandals or wooden clogs, they must differ from those of the common world.\n\n**The Ritual Dignity for Springs and Wells:** Where a Daoist resides, a well or spring must first be established, kept pure and free from contamination by the six livestock or filth. Separate wells should be designated for washing, drinking, and watering cattle, horses, and other animals.\n\n**The Ritual Dignity for Wells and Springs:** All wells and springs must be frequently dredged; do not allow grass, flowers, leaves, frogs, or flies to fall into them. Each household and guest courtyard should have its own well, not shared with those used for sacrificial offerings.\n\n**The Ritual Dignity for Water Use:** For all cooking, boiling medicines, washing clothes, and bathing, the water used must be passed through a fine filter before use.\n\n**The Ritual Dignity for Eating and Drinking:** A Daoist’s food should fill the stomach and no more; do not seek refinement. Always observe fasting; do not eat at improper times or in improper ways.\n\n**The Ritual Dignity for Eating and Drinking:** A Daoist should always recite the food incantation before eating, offering various foods in separate vessels. Visualize the Three Ones, eating in unison with one’s form, and strike the vessel three times with the chopsticks. Serve food in separate dishes and distribute it to living beings.\n\n**The Ritual Dignity for Eating and Drinking:** Each Daoist should have their own set of eating utensils, kept clean with napkins and chopsticks. Provide daily necessities; do not share utensils with others, nor use them for other purposes, lest impure qi intermingle.\n\n**The Ritual Dignity for Eating and Drinking:** Do not allow others to touch the food with impurity, nor eat facing upward, lest breath or clothing contaminate it. Distribute leftovers; do not hoard or take them away.\n\n**The Ritual Dignity for Eating and Drinking:** After eating, a Daoist should seek repentance before distributing food; do not beg from others mid-meal or allow servants, attendants, chickens, or dogs to partake. The supervising immortal officials will record transgressions and report them to the Three Bureaus.\n\n**The Ritual Dignity for Conduct:** In all actions—walking, standing, sitting, or lying down—a Daoist must align with the Dao, maintain a composed demeanor, keep the body upright, and avoid slouching, lest their dignity be lost. The head leads in ritual dignity; one cannot be too careful.\n\n**The Ritual Dignity for Travel:** When a Daoist visits government offices, attends to their master, teaches among the people, or enters secular households for rituals, groups of five or three must proceed in orderly fashion, maintaining proper bearing. Do not intermingle or deviate from the rules.\n\n**The Ritual Dignity for Travel:** When a Daoist travels among the people or attends ritual lectures, each should carry their own seat cushion, using it wherever they go. This both avoids impure qi and distinguishes ranks—high, middle, and low seats—all following the same system.\n\n**The Ritual Dignity for Residing in Abbeys:** Once a Daoist has entered the Dao, they must reside in an abbey, uphold the Dharma, burn incense morning and evening, pay homage to the perfected, perform repentance rites, serve their master, observe precepts, seek guidance from virtuous elders, and study the methods of the Dao.\n\n**The Ritual Dignity for Residing in Abbeys:** Daoists should instruct one another, cherish their Dharma bodies, cultivate goodness, cease evil, contemplate the Three Treasures, and embody kindness, gentleness, and harmony. In all matters, be reverent and compliant, perfect the Daoist sanctuary, and if outsiders offend, respond with patience.\n\n**The Ritual Dignity for Residing in Abbeys:** Daoists should live in harmony, with seniors and juniors trusting and obeying one another, like the movement of hands and feet. Maintain the abbey’s permanence, sharing in the procurement of incense, oil, rice, wheat, firewood, and vegetables as if for oneself, without waste.\n\n**The Ritual Dignity for Residing in Abbeys:** Fields, mills, and grinding stones, as well as servants, the five domestic animals, tools, livestock implements, fruits, herbs, and all necessities, must be cherished and offered to the ten directions as future blessings.",
      "overlap_context": "s. Each must manifest their own immortal officials—do not falsely claim oversight.\n\n**The Ritual Dignity for Offering Sacrifices:** Sacrifices are offerings to the gods of heaven and earth. There are many kinds, and all cakes and fruits must be pure—do not use meat, dried flesh, or foul substances, lest the celestial officials not grant protection.\n\n**The Ritual Dignity for Offering Sacrifices:** All pledged offerings must not be borrowed. If insufficient, do not deceive the enlightened spirits.",
      "start_char": 5187,
      "end_char": 6485,
      "start_sentence": 165,
      "end_sentence": 197,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.26333546638489,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\正一威仪经.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "正一住观威仪：尊像经法，旛华帐座，堂殿楼阁，林席毡褥，锺磬几拂，常共建立，悉使精华，无令阙少。 正一住观威仪：常住众物，及三宝财，草叶华果，毫芥已上，不得辄自费用，及以乞人。 其罪至重，死入三涂，过去、未来、见在三世，己身父母、兄弟、姊妹，及其子孙，贫穷下贱，聋盲喑痖，风癞愚痴，瘨狂挛，水火兵伤。 正一死亡威仪：若师尊、同学亡，打钟三百六十槌告终。 法徒毕集，哭泣三声，烧香读经。 暨其藏殓，依用法式。 正一死亡威仪：几棺布囊举尸，送山林薮泽，入土而已，不得立坟，封树丘垄。 正一死亡威仪：正一符箓、券契、环剑，布囊盛之，随身入土。 正一死亡威仪：书七十二符，安佩尸形如法，拜戊己章、棺殓章，法服随身。 正一死亡威仪：亡师所有衣物、床卧等具，资送之余，修牒名目，施入常住，若亲若疏，若内若外，皆不得犯。 正一死亡威仪：师若无财物资送，当用常住，及斋供福田，并以众物。 所以生死同依常住，师天尊也。 太上谓天师道陵曰：凡一百三十二条正一威仪，昔在龙汉劫终，於玉清三华便殿，诣师元始天尊奉受。 是时，元始天尊对太上道君、九天真师、元始丈人、三十二天帝、五老上真、无极神王，命五帝玉童，披九云之韫，出此威仪，分付与我日：子当流布三界十方，无极世界，一切男女有善心者，皆传与之。 吾得已来，经今五劫，随处教化，徧满人天，上圣真仙，悉皆奉受，书之金简，秘诸天官。 今应授子，汝其遵崇，敬则福至，泄则祸臻。 元始明戒，宜慎之焉。 道陵稽首礼谢曰：臣入证未久，屡遭慈霈，教诲殷懃，赐授经法，不测深浅，更示科戒，微妙难思，敢不尽心，依科奉行。 於是诸天圣众同声称善，俱入太空。 正一威仪经竟",
      "translated_text": "**The Ritual Dignity for Residing in Abbeys:** Sacred images, scriptures, and ritual instruments—banners, flowers, canopies, and altars—along with halls, pavilions, towers, mats, carpets, bells, chimes, tables, and whisk brooms—must all be established together, kept in refined splendor, and never allowed to fall into deficiency or lack.\n\n**The Ritual Dignity for Residing in Abbeys:** All property belonging to the abbey and the wealth of the Three Treasures, from blades of grass and leaves to flowers and fruits, even the smallest particles, must not be privately used or given away to others. The transgression is grave: upon death, one falls into the Three Wretched Realms, and across past, future, and present lives, one’s own parents, siblings, sisters, children, and descendants will suffer poverty, low status, deafness, blindness, muteness, paralysis, leprosy, stupidity, madness, convulsions, or harm by water, fire, or weapons.\n\n**The Ritual Dignity for Death:** When a master, preceptor, or fellow disciple dies, strike the bell three hundred and sixty times to announce the end. All disciples shall gather, weep three times, burn incense, and recite scriptures. For the encoffining, follow the proper ritual forms.\n\n**The Ritual Dignity for Death:** Use a cloth stretcher to carry the body, convey it to the mountains, forests, marshes, or wetlands, and inter it in the earth without raising a mound, sealing the grave, or planting trees over it.\n\n**The Ritual Dignity for Death:** The Zhengyi talismans, contracts, rings, and swords shall be placed in a cloth bag and buried with the body.\n\n**The Ritual Dignity for Death:** Inscribe seventy-two talismans and affix them to the body as prescribed; perform the obeisance to the *Wuhuizhang* (Petition to Earth Deities) and the *Guanlianzhang* (Coffining Petition), with ritual vestments accompanying the deceased.\n\n**The Ritual Dignity for Death:** All clothing, bedding, and belongings of the deceased master, after providing for the funeral, shall be recorded by name and donated to the abbey’s permanent endowment. Whether kin or stranger, insider or outsider, none may violate this rule.\n\n**The Ritual Dignity for Death:** If the master leaves no property for the funeral, the abbey’s permanent endowment shall be used, along with offerings from vegetarian feasts and fields of merit, all drawn from communal resources. Thus, in life and death, all depend on the abbey, for the master is the Heavenly Worthy.\n\nThe Most High said to Heavenly Master Zhang Daoling: \"These one hundred thirty-two articles of Zhengyi ritual dignity were received by me from the Original Celestial Worthy in the Jade Clarity Triple-Flower Convening Hall at the end of the Dragon Han kalpa. At that time, the Original Celestial Worthy, in the presence of the Most High Dao Lord, the Nine Heavens’ Perfected Masters, the Primordial Venerable, the Thirty-Two Heavenly Emperors, the Five Elders of the Upper Realms, and the Boundless Divine Kings, commanded the Five Thearchs’ Jade Lads to unfold the ninefold-clouded casket and produce this ritual dignity, entrusting it to me with these words: ‘You shall disseminate it throughout the Three Realms, the Ten Directions, and the boundless worlds, transmitting it to all men and women of virtuous intent.’ Since receiving it, I have passed through five kalpas, teaching and transforming wherever I go, filling the realms of humans and gods. The lofty sages and perfected immortals have all received and upheld it, inscribing it on golden tablets and concealing it among the celestial bureaus. Now it is fitting to transmit it to you—observe it with reverence. Devotion brings blessing; disclosure invites calamity.’ The Original Celestial Worthy’s solemn admonition must be heeded with care.\"\n\nZhang Daoling bowed his head in homage and gave thanks, saying: \"Your disciple has not long entered the ranks of the perfected, yet has repeatedly received your compassionate grace, your earnest instruction, and the bestowal of scriptures and methods beyond measure. Now you further reveal these precepts and disciplines, subtle and wondrous beyond thought. How dare I not devote my whole heart to following them according to the regulations?\"\n\nThereupon, the assembly of celestial sages and hosts all voiced their approval and together ascended into the great void. **The Scripture of Zhengyi Ritual Dignity ends here.**",
      "overlap_context": "nd juniors trusting and obeying one another, like the movement of hands and feet. Maintain the abbey’s permanence, sharing in the procurement of incense, oil, rice, wheat, firewood, and vegetables as if for oneself, without waste.\n\n**The Ritual Dignity for Residing in Abbeys:** Fields, mills, and grinding stones, as well as servants, the five domestic animals, tools, livestock implements, fruits, herbs, and all necessities, must be cherished and offered to the ten directions as future blessings.",
      "start_char": 6486,
      "end_char": 7186,
      "start_sentence": 198,
      "end_sentence": 217,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.119585752487183,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\正一威仪经.txt",
        "category": "威仪类"
      }
    }
  ]
}