{
  "source_id": "正一出官章仪",
  "source_file": "chunked_daozang\\正一出官章仪.json",
  "total_chunks": 8,
  "total_original_chars": 7146,
  "total_translated_chars": 40647,
  "total_translation_time": 213.81868743896484,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\威仪类\\正一出官章仪.txt",
    "category": "威仪类"
  },
  "full_translation": "**Zhengyi Official Departure Rites**\n*Sutra Title:* Zhengyi Official Departure Rites. Author unknown, likely composed during the Northern and Southern Dynasties. A ritual text for early Heavenly Master Daoist petitions (zhang) and offerings (jiao) upon an official’s departure. One scroll.\n\n**Source Text:** *Zhengtong Daoist Canon*, Dongshen Section, Wei Yi (Ritual Dignity) Category.\n\n---\n\n**Zhengyi Official Departure Rites: Petition for the Return of Goodness**\n\nWith reverence, I dispatch the Five Body True Officials and Merit Officers from within my person, ascending through the Three-Five Pure Subtlety Heaven, Yu Yu Heaven, and Great Red Heaven. I summon the Five Qi Merit Officers, the Supreme August Perfected, the Twelve True Officials, the Divine Origin Red Qi Red Chariot Envoys, the Yin-Yang True Qi Yellow Script Contract Spirit-Eye Lords and Officers, the Yin-Yang Generative Qi Dao-Transmitting Transformation Lords and Officers, the Nine Qi Elders and Summoning Officers, the Disaster-Dispelling Calamity-Resolving Deliverance Lords and Officers, the Spirit-Returning Lords and Officers, and the Twelve Officers each of the Crimson and White Surge Pool Generals.\n\nI dispatch the Two Upper Immortals and Two Upper Spirits from within my person, along with their Direct Merit Officers; the Two Direct Merit Officers each from the Three-Five Heavens; the Two Zhengyi Merit Officers to collect inauspicious records; the Two Upper Section Merit Officers to collect malevolent officers; the Two Middle Section Merit Officers to record rebellious officers; the Two Lower Section Merit Officers to collect harmful officers; the Two Urgent Qi Merit Officers to gather Yin-Yang officers; the Two Upper Section Envoys to collect and record souls; the Two Middle Section Envoys to collect and record po; the Two Lower Section Envoys to bind and reverse-restrain; the Two Urgent Qi Envoys to monitor time and strike; the Two Left Official Envoys to strike, verify, lock, and imprison; the Two Right Official Envoys to open shackles and seal prisons; the Two High Chariot Envoys to sharpen heads and sever ears; the Twelve Crimson Chariot Envoys to monitor roads and headscarf officers; the Twelve High-Handed Officers to sever necks; the Twelve Direct Execution Officers; the Twelve Adjutant Execution Officers; the Twelve Merit Officer Execution Officers; the Twelve True Talisman Execution Officers; the Twelve Urgent Battle Execution Officers; the Twelve Banner Execution Officers; the Twelve Drawn-Sword Execution Officers; the Twelve Drum-Beating Execution Officers; the Twelve Long Saber Beheading Officers; and the Twelve Officers of the Rushing Wind Cavalry, stationed at post-horses to seize and suppress rebellious battles.\n\nAll dispatched officers shall be clad in solemn attire, adorned with caps and hanging tassels, standing before and behind me, bearing their full titles. I, having received [the mandate], now present a certain oral petition and written memorial, beseeching the return of transformative grace to suppress and invert [evil], to capture and expel malevolent schemers.\n\nI humbly invoke the statutes of Heaven and Earth, which cherish life and abhor killing, rewarding good and punishing evil. Charged with the duty of talismanic registers, I, bound by my office, am sworn to propagate the true transformation and eradicate the wicked. Today, in a certain prefecture, county, village, and hamlet, on a certain day and month, [a victim] suffered a certain affliction. Kneeling in supplication, I confess my ignorance of the matter, for the distress is grave.\n\nIn accordance with the Heavenly Master’s statutes, I reverently present a Crimson Petition. I invoke the local Earth God and the True Qi-Residing Lords, Officers, and Soldiers of this domain to investigate, summon, and gather the malevolent one, [named] so-and-so, to be seized by the punitive officers and brought forth.\n\nMy swift envoys to the left and right shall apprehend and bind the malefactor, so-and-so, wherever he may be, his head suspended and sharpened, allowing no respite. Once the matter is concluded, the execution shall be swift. The Heavenly Officers, Generals, Soldiers, and Officers I have invoked shall stand before and behind me, listening to the reading of this petition, each proceeding in order to suppress the malefactor, so-and-so, further restraining his three hun and seven po, sealing them in the Heavenly Courts.\n\nI interrogate the malefactor for his transgressions, compelling his submission and punishment. Within three or four days, he shall be forced to death. *Hastily, as per the Statutes and Ordinances of the Supreme Venerable Sovereign!*\n\nToday, I invoke the Crimson Heaven General to seize the malefactor, with ten thousand officers and soldiers arrayed to bind and destroy him at his home. I invoke ten thousand Generals, Officers, and Soldiers to behead the malefactor, so-and-so, for his deceitful and bewildering words. I invoke three hundred thousand Generals, Officers, and Soldiers to descend and interrogate the malefactor, so-and-so, for his delusions and wanderings. I invoke Generals and Soldiers to apprehend him, to weigh his conduct against the Dao and its virtue. Three hundred thousand soldiers shall descend to bind the malefactor, so-and-so, his head reversed and restrained, his community punished and censured, his mouth silenced.\n\nFor slandering his master as unvirtuous and disrespectful, three hundred thousand soldiers shall descend to seize and reverse-bind him, to be annihilated without limit—boiled in cauldrons, burned by fire, his sinews and bones scorched, his body consigned to the Eighteen Hells. I beseech the Heavenly Officers, Generals, Soldiers, and Officers to promptly proceed to the malefactor’s home, collect his hun and po, and deliver them to the Earth God for suspension, interrogation, and punishment. *Hastily, as per the Golden Mouth Statutes and Ordinances of the Supreme Venerable Sovereign!*\n\nI request to open and recite the petition before the altar. With solemnity, I further charge the Five Body Direct Officials, Merit Officers, Envoys, Scribes, and Lesser Officers of the Vermilion Yang within my person.\n\nUpon completing the petition, tread thirteen steps to suppress [the malefactor]. Inscribe the malefactor’s name upon the talisman, grasp the knife in the left hand to sever qi within the pit, and press with the left big toe, repeating thrice. Then recite the incantation:\n\n*\"Hark! How the Heavenly Net interlaces! How the Earthly Principles perish! Seize the malefactor, so-and-so’s hun and po, and consign them to the cauldron’s boiling waters. Enter swiftly beneath the Heavenly Net’s dense suppression, deeply concealed. Should you escape, your body shall be harmed; should you enter above, you shall lose your homeland. As I decree the execution of Zhang, hasten! Hastily, as per the Statutes and Ordinances of the Supreme Venerable Sovereign!\"*\n\nCircling leftward, restore the qi of life and place the virtuous person by the northern wall, elevated three feet. Reverently invoke the Twelve Hundred Generals of the Inverted Net and Overturned Earth, the One Hundred Twenty Lords of Wide-Eyed Vision, and the Twelve Hundred Great Forehead Spirit Lords of the Five Directions to seize and record the three hun and seven po of the malefactor, to examine and punish their crimes, and to drag forth all who unjustly strike or entangle this person. Reverently invoke the Lord of Venus to transform the malefactor’s heart, earnestly beseeching their concealment, annihilation, and subjugation. Hasten! As per the Statutes and Ordinances.\n\nAnother method: at a designated place, construct an altar and inscribe the malefactor’s name. Place it within a bamboo tube along the five directions, and strike it upon the monthly suppression. Tread the Seven Star Steps, advancing from the monthly establishment to the suppression’s position, aligning suppression with establishment, and suppression with the flourishing of life. Recite the incantation:\n\n*\"Departing at dawn from the Great Numinous Terrace,\nReturning to the talismanic officials and spirits,\nThe Heavenly Bureaus execute and slay the malefactor.\nHasten! As per the Statutes and Ordinances of the Supreme Venerable Sovereign.\"*\n\nRecite the incantation:\n\n*\"Talismans traverse Heaven and Earth,\nSeizing and recording ghosts and spirits.\nTalismans traverse the Great Dao,\nSeizing and recording the true spirits.\nThe Three Masters’ talismans—\nThe Heavenly Dao is spontaneous.\nShould you know yourself not true,\nDo not oppose our spirits.\nThose we treat are healed,\nThose we save are freed,\nThose we suppress are subdued,\nThose we protect live.\nTo protect the divine spirits,\nHasten! As per the Statutes and Ordinances of the Supreme Mystic Capital Venerable Sovereign.\"*\n\nUse one *dou* and two *sheng* of salt, one *dan* and two *dou* of clear water, one large blade, three *jin* of charcoal, and one *dou* and two *sheng* of oil. Recite the incantation:\n\n*\"The Five Phases propel one another,\nThe Net upholds its might.\nThe Six Disciplines assist me,\nThe Three Honored Ones dispel transgression.\nHeaven revolves, Earth turns,\nThe Three and Five pivot as jade orbs.\nLong life and enduring vision,\nSun and Moon shine together.\nThose who oppose me perish,\nThose who turn from the Dao decline.\nThe Three Bonds and Six Disciplines\nSink before the Net.\nAll mouths are silenced,\nPunishments and prisons dissolve.\nHasten! As per the Statutes and Ordinances.\"*\n\nPresent the auspicious petition to the officials.\nReverently dispatch the true officials and functionaries of the Five Bodily Viscera within my person: two functionaries each from the Great Sage True Spirit Register and the Numinous Official Envoys, two functionaries each from the Direct Envoys of the Two Offices of Supreme Mystery, two functionaries each from the Capital Bureau, the Upper Bureau, the Middle Bureau, the Lower Bureau, the Left and Right Official Envoys, the Crimson Chariot Envoys, the Yin-Yang Divine Decision Clerks, the Scarlet Talismanic Chariot Clerks, eighteen each of the Just Wind Couriers and Post-Horse Petition Clerks, eighteen each of the Flying Dragon Cavalry Clerks, and eighteen each of the Functionary Soldiers. All who emerge shall be clad in solemn attire, caps, and sashes, standing in formation before and behind me, all receiving my commands. The words from my mouth shall be distinctly transmitted and reported. Here, the true officials of the prefectures, counties, townships, and villages, the qi-monitoring overseers, and the local summoning lords and generals—now, I reverently present on behalf of so-and-so a petition of threefold auspicious return, placed upon the plain table before me.\n\n**Petition Text**\n\nTo the Supreme Mystery Capital, the Orthodox Unity, the Balanced Qi, the Celestial Master of the Crane’s Call Retreat, the Supreme Middle Qi, the Primordial Destiny True Person, overseer of the fifteen ranks—your servant so-and-so bows his head and prostrates himself twice to memorialize:\n\nReverently following the records of my native prefecture, county, township, and village, your servant so-and-so humbly addresses the Supreme Boundless Dao, the Supreme Venerable Sovereign, the Celestial Master, the Female Master, the Lineage Master, the System Master, the Lady of the Gate, and the Lords of the Five Qi. At this time, in such-and-such prefecture, county, township, and village, a household of a thousand years and a thousand mouths, now residing in such-and-such village, today kowtows as a plain, flesh-born mortal, a descendant of the myriad officials, fortunate for a thousand ages, governed by the Dao-qi of the Supreme Lords, the Elders, and the Three Masters, preserving purity of heart. From the beginning, I have received grace, truly rejoicing and consoled. Yet I, a dull and coarse being, have encountered the turning of fate, not daring to squander my humble body in attachment to numinous blessings, washing away dust and filth, bathing in the pure wind, and embodying transformation. Having received the registers of the Dao and the arts of long life, I bear great favor and am constantly protected. Moreover, my ignorance is profound; I cannot retreat to the cliffs and valleys. In upholding the Dao, I violate its regulations; in every action, I provoke conflict. Suddenly, on such-and-such year, month, and day, I was unjustly afflicted by such-and-such matter, or by the poisonous intent of a malefactor seeking to harm me. Due to such-and-such circumstances, the bureaucratic offices may perceive my transgressions and seek to secretly harm me, or I may be envied. Though I have unworthily received the grace of the Great Dao, the secret talismans, and the Dao’s teachings, from the day I accepted the Dao, I was bound to dispel calamities. Yet this malefactor, harboring rebellious intent, schemes to injure me, secretly striking me beyond endurance. Beset by this malefactor so-and-so on all sides with false accusations, ever more oppressive, their schemes relentless, my liver and gall spill upon the earth. Now, entrusting myself to the darkness, I rely upon the utmost truth, hoping for the Dao’s qi to protect and assist me in dispelling the malefactor’s slander, transforming their rebellious heart. May they regard me with joy; may I prevail, and may so-and-so be punished. If they persist in malice and scheming to harm me, I beseech that the malefactor and their rebellious kin be shattered and destroyed, their clans annihilated, and their misfortunes returned upon them, unable to act. Should any harbor ill intent and falsely accuse or strike me, may they be broken, destroyed, and perish prostrate, unable to move or act.\n\nI invoke the Azure Emperor of the East, the Vermilion Emperor of the South, the White Emperor of the West, the Black Emperor of the North, and the Yellow Emperor of the Center, each with eight thousand soldiers, to suppress the malefactor’s officials, people, and slander on all sides. May the malefactor so-and-so be utterly subdued, and those who would cause calamity be annihilated. I invoke the Bright Star Lords of the Five Directions and the Lords of the Eight Extremities of the Celestial Sphere, one hundred twenty officials and generals, to transform the Heavenly Net and turn the Earthly Principles, silencing all slander and causing it to vanish. I invoke the Lord of the Northern Dipper’s Net to transform the malefactors on all sides, compelling them to surrender and be destroyed at the mere sight of me. Should the malefactor’s malice persist, may the Net cover their mouths, rendering them speechless. I invoke one hundred thousand soldiers of Consuming Qi to dispel all calamities and harmful qi from the four directions that would assail me, crushing and annihilating them. I invoke the Lord of Official Statutes with one thousand two hundred generals, and reverently invoke one hundred thousand Mystic Soldiers and one hundred thousand Star Lords with one hundred twenty generals to govern the Earthly Officials, suppress primordial qi, and seize and strike the malefactors, causing them to vanish. I invoke the Lords of the Oath’s Might with one hundred twenty generals, the Lords of the High Granary with one hundred twenty generals, and the Heavenly Official Protector General, the Lord of Ten Thousand Blessings, with one hundred twenty generals, all to descend and dispel the malefactors’ gatherings and slanderous strikes against me, confounding their hearts and causing their self-destruction. I invoke the Harmonizing Generals with one hundred twenty men to consign the malefactor so-and-so to the Great Yin. I invoke the Lords of the Four Seasons and Five Punishments’ Circulating Qi with one hundred twenty generals to subdue the malefactor so-and-so, compelling their surrender. I invoke the Great Forehead Lords of the East, South, West, North, and Center, each with one thousand two hundred generals, to dispel the slander of the yang officials and all who seek to harm or falsely accuse me, causing their annihilation, hearts confounded and minds bewildered, returning their misfortunes upon them. I invoke the Supreme Mystic Lords with one hundred twenty soldiers, the Southern Guardian Five Star Generals and clerks with one hundred twenty each, and thirty myriad billion soldiers of the Yue Maiden, all to descend at once and capture the malefactor so-and-so, suppressing their slanderous and secret strikes on all sides beneath the Net, unable to act or speak, hearts confounded and minds bewildered, causing their self-subjugation and annihilation. May I, abiding within the qi of life, traverse calamities and hardships. Now, I purify my heart and liberate myself, offering water, incense, and flame to dispel the malefactor’s unjust misfortunes, official and private slander, bureaucrats, people, thieves, and bandits, causing them to collapse like sand, unraveling and dispersing at once. Though I, unworthy and stained, unworthily bear the talismans and registers, my form is humble and my endowment slight. I cannot endure the malefactor so-and-so’s false accusations and slander, their extreme rebelliousness. May they be released and pacified, free from harm. On the day my wishes are fulfilled, I shall offer repayment and return all to their proper places. Thus, the officials I have invoked shall all report their merits, be promoted, and enter the Central Palace to receive honors, placed in hidden offices with increased ranks. The one thousand two hundred generals and five hundred thousand soldiers shall, according to the Heavenly Bureaus’ regulations, not be neglected. I humbly implore...\n\nThe Most High distinguishes the handles of governance; I, your servant, reverently submit this petition on behalf of so-and-so for such-and-such matter. Prostrate upon the earth, I present this memorial of restored harmony and this single vermilion memorial of condemnation, to be delivered upward to the Three Heavenly Bureaus of the Most High, awaiting your report. I, so-and-so, with trembling awe and utmost reverence, bow my head twice in obeisance to make this known.\n\nI, your servant, of the such-and-such clan, affiliated with the such-and-such prefecture, county, abbey, or temple, diligently cultivate the flames of devotion to the Great Clarity, Primordial Origin, Most High, Three Heavens, Boundless, Supreme Dao, the Most High Lord Lao, the Venerable Celestial Elder, the Heavenly Thearch, the Nine Elder Perfected Lords of the Grotto-Heaven, the Venerable Lords of the Nine Qi, the myriad layers of the Dao and qi, and the One Thousand Two Hundred Official Lords under the Jade Throne of the Great Clarity.\n\nMemorial for Opening Prisons and the Chapter of the Supreme Mystery of the Orthodox Unity, Balanced Qi, of the Celestial Master of the Yangping Abbey, Left Balanced Qi.\n\nI, your servant so-and-so, bow my head twice in obeisance and declare: According to the documents of such-and-such prefecture and county, in such-and-such village, there resides a person of such-and-such age, who today kowtows and takes leave. Born of flesh and blood, descendant of the hundred officials, I have been fortunate for a thousand generations to serve...\n\nBy the boundless grace of the Great Dao, I have long received favor, yet suddenly afflicted by misfortune and illness, beset by confused dreams and unreal visions, demonic disturbances arise in succession, while public and private disputes erupt without cause. Moreover, in my former life, I incurred the entanglements of prison, punishment, and grievous karmic retribution; in this life, on such-and-such a day of such-and-such a month, I was implicated in such-and-such a case. Now, upon investigation, I am to be seized, shackled, and imprisoned, subject to the legal proceedings of the earthly prison. The charges are manifold, the penalties severe, and as a mortal, I am filled with dread. Turning to your servant, I plead for redress, as is duly recorded.\n\nIn the administration of justice, humans and ghosts each have their proper jurisdiction: ghostly punishments proceed to the right, entering the prison; human punishments proceed to the left, entering the prison. Yet the distinctions are obscured, and the penalties for both are conflated. I beseech you to examine my case under the dual laws of yin and yang, lest I, in former or present life, have transgressed against either, thereby falling under the jurisdiction of the Left Bureau, or having died in violation of the law, now proceed to prison. Presently, I am secretly detained in the dungeon, my body subjected to the lash, the rod, and torture, confined and interrogated, my pleas suppressed. The severity of my plight remains uncertain.\n\nIn this age of the Yang-Nine, humans and ghosts alike are perverse and rebellious. Some suffer at the hands of corrupt officials, while others are ensnared by old enmities, scheming to inflict harm and exact vengeance, unjustly imprisoning and tormenting their victims, stopping at nothing to extort confessions. Moved by principle, I seek to deliver those in peril from the calamity of punishment, for this is the weighty concern of Heaven’s compassion.\n\nNow, as the storm of prison and punishment presses urgently upon me, and matters may yet take a turn for the worse, delay is inadvisable. Thus, I dare to brave scalding waters and flames, emerging beneath the open sky of the central courtyard, prostrating myself to present this urgent memorial for the swift opening of my case. I humbly pray that Heaven’s compassion will surely grant deliverance.\n\nI respectfully petition the flying celestial officials of the ten directions, mounted and ready, to open the Southern Gate thrice, that the yin offenses and yang transgressions of my former life’s karmic retribution may be swiftly dissolved. I further petition the Lords of Transgression, dispatching one hundred and twenty attendants into the Yang Talismans of the Left Bureau, to follow the penalties now imposed upon me. Should corrupt officials or old grudges pursue and entangle me, I pray to the Lords of Reversal and Transformation to dispatch one hundred and twenty attendants, compelling the obstinate clerks and oppressive officials to relent, their enmity dissolved.\n\nIf I persist in following the wicked, my soul obstinate and unrepentant, I pray that the Lords of Reversal and Transformation will compel the obstinate clerks and oppressive officials to submit, their malice turned to compliance. Should I continue to pursue the perverse, I beseech the Great Banner Lords of the Five Directions, with their legions of ten thousand soldiers, and their talismans, to seize the gods of the prison bars and the examiners of the rebellious officials. Let all who would act with violence be struck with terror, their souls subdued, their six senses confounded, their reckonings disrupted, their tongues tied, their hearts aligned with mine. Thus may the prison be dissolved, the calamities of punishment eradicated, and my body freed from pain and suffering, as a sign of your merciful efficacy.\n\nIn gratitude, I shall report the merits of the celestial officials who heed my plea, ensuring their labors are duly rewarded, and my vow of faithfulness upheld. I implore the Most High to discern my plea and grant mercy. With reverence, your servant petitions the primordial officials, clerks, and soldiers to disperse these afflictions. I humbly inquire after the dead and beseech your grace, presenting this vermilion memorial to the Three Heavenly Bureaus of the Most High. Awaiting your decree, I, your servant, bow my head twice in awe and trepidation, prostrating myself to make this known.\n\nYour servant [Name],\nBefore the Jade Throne of the Great Clarity, the Celestial Elder of the Boundless Dao of the Three Heavens, the Heavenly Thearch, the Nine Elder Perfected Lords of the Grotto-Heaven, the Venerable Lords of the Nine Qi, the myriad layers of the Dao and qi, and the One Thousand Two Hundred Official Lords.\n\nIn the Year of [Tai Sui],\n\nAnother method: Upon leaving the patient’s home, step over the threshold while imprinting the seal of the Prison Overseer, and recite the incantation:\n\nHark! I possess the power to seize ghosts and subdue demons. I declare: the ghost that harms and afflicts so-and-so—tear out your belly, extract your liver! My master returns the illness to so-and-so, subduing the cold. Swiftly, swiftly, as decreed by law and command—do not look back! Strike the teeth and depart, O officials.\n\nI reverently dispatch from within my body the Two Officers of the Supreme Immortals and Supreme Spirits, the Direct Envoys of the Orthodox Unity and Merit Officers, two each; the Envoys of the Central Department, two each; the Envoys of the Five Thearchs, two each; the Seasonal Merit Officers, two each; the Seasonal Envoys, two each; the Yin-Yang Spirit Officials of the Granary, two each; the Scarlet Talisman Officers of the Chariot of Punishments, two each; the Couriers of the Rushing Wind and Relay Horses bearing memorials, two each. They stand before me, holding white tablets, all receiving my words. Let the words from my mouth be distinctly heard and swiftly conveyed on high. Reverently executed.\n\nThe servant [Name], of the Orthodox Unity and Balanced Qi of the Great Mysterious Capital, of the Yangping Abbey, bows twice. I humbly look up to the Most August Father and Holy Mother of the Primordial Radiance, beseeching your grace to examine and discern truth from falsehood, that the hearts of all may be instructed. In such-and-such a prefecture, county, township, and village, wicked men give free rein to their stubborn deceit—not merely one or two. I have privately learned that the descendant of the Master of the Most High has repeatedly suffered harm, enduring added abuse, insults, and disrespect, with countless unjust beatings, slanders, and false accusations. Though the Dao of Heaven is profound and distant, I dare not keep this hidden. Such persons deserve to be seized and interrogated. I reverently petition the Three Heavenly Bureaus of the Most High to issue a special decree to the Three Officials, to apprehend and record the nine generations of ancestors and seven generations of parents of so-and-so’s family, and consign them to the Northern Prison and Earthly Dungeon, to the darkest recesses. In proportion to their indulgence and the contempt shown for the Dao of Heaven, I command the local earth gods, the true officials of the neighborhood altars, and the deities of the community temples to seize the three hun and seven po of so-and-so, in accordance with the statutes on disrespect for the master and the Dao, and to examine and question them without delay. I reverently summon the Generals of the Celestial Net, three thousand six hundred in number, to follow the words of my petition, proceed to so-and-so’s home, and seize and sever his three hun and seven po, delivering them to the Celestial Prison to be beaten to death with iron rods. I further summon the twelve hundred Examiners each from the Heaven of Pure Tenuity, the Heaven of Great Surplus, and the Heaven of Great Red, to descend as one and point into so-and-so’s body, interrogating and punishing him for his contempt of the Dao and its laws. The descendant of the Master—his name is invoked—bears no light guilt; the scriptures and laws do not permit it. He ought to be thoroughly investigated and punished.\n\nI further petition the Three Officials of Heaven, Earth, and Water to interrogate and punish so-and-so for his cruel enmity toward the Dao of Heaven, his disdain for the master, his contempt for the law, his failure to follow the teachings of the Dao, and his reckless indulgence of his own will—cursing, abusing, or beating and striking, or using official power to oppress and coerce the person of the Master’s descendant. In accordance with the statutes of the Three Officials, I pray that the celestial generals and officers apply their minds and intent to this matter, that the efficacy may be swiftly verified. On the day results are achieved, merits shall be reported and promotions sought, without betraying the trust in this petition. I humbly beseech the Most High to discern and heed my plea. I, your servant, present this memorial to seize, interrogate, and sever the wicked man who has given free rein to his heart in cursing and abuse. Ashamed and mortified, I submit this memorial to the Three Heavenly Bureaus of the Most High, awaiting your decree. I, your servant, bow my head twice in awe and trepidation, prostrating myself to make this known.\n\nYour servant [Name],\nBefore the Jade Throne of the Great Clarity, the Celestial Elder of the Boundless Dao of the Three Heavens, the Heavenly Thearch, the Nine Elder Perfected Lords of the Grotto-Heaven, the Venerable Lords of the Nine Qi, the myriad layers of the Dao and qi, and the One Thousand Two Hundred Official Lords.\n\nIn the Year of [Tai Sui],\n\nMemorial of Transformation and Return.\n\nTo the Orthodox Unity of the Great Mystery Capital, the Left Rectifying Qi of the Celestial Master’s Yangping Administration:\n\nYour servant bows his head twice and respectfully addresses this memorial. In accordance with the documents, the male disciple of [State], [County], [Township], and [Village], aged [X] years, now presents this oral petition. Born of flesh as a mortal, descendant of the hundred officials, I have been blessed across a thousand generations to serve the Great Dao. Yet, being but a dull and foolish mortal, unworthy and insignificant, I dare to submit this plea to the Heavenly Bureaus.\n\nRecently, my household slave, named [Name], aged [X] years, suddenly absconded. On the [X] day of the [X] month, he stole my property—clothing, bedding, and miscellaneous goods—and fled, hiding in the east, west, south, or north to evade his master. He repays my nurture with betrayal. On the [X] day of the [X] month, I recaptured this slave and brought him back to my residence, binding him to prevent further escape. Yet, at [X] hour on [X] night, he broke his bonds, his wicked heart unrelenting, and fled once more, rebelling against his master. This has occurred repeatedly over the years, his escapes and betrayals too numerous to count. He steals my resources, harbors malice, and his evil intent grows ever more severe.\n\nDay after day, my entire household—men and women, bond and free, young and old—has searched for him in vain. We have scoured the nearby and distant mountains and wilds in all directions, yet his whereabouts remain unknown. He hides his tracks, evades his master, and refuses to be seen. Now, my fortune wanes while misfortune grows; my household suffers loss, and the slave’s stolen wealth scatters, no longer mine. With wholehearted devotion, I rely upon the Great Dao to protect me.\n\nToday, I present [X] feet of white silk, [X] measures of rice, and offerings from bond and free, bringing them before the Three Treasures in [Name] Abbey. I beseech you to perform the Rite of Transformation and Subjugation, that this slave, [Name], may be confounded and bewildered, his heart filled with turmoil, unable to flee. Let him return to my home, raving and mad, crying out in the streets until he is seen by me. Let him no longer evade or flee, but be compelled to return at once. I await the swift manifestation of your grace, that your merit may be proclaimed and your oath fulfilled.\n\nAs a humble servant charged with this duty, how could I fail to submit this memorial? I respectfully invoke the mighty soldiers of the Five Emperors, the Qin-Hu Generals, the Five Roads, the Crossroads, and all the prison wardens and stalwart warriors. I implore you to strictly capture and transform this slave, [Name], preventing his further escape or evasion from his master’s household. Seize his three *hun* and seven *po* and deliver them to the local earth god, commanding the spirits of my household’s deceased ancestors, the Stove God, the Three Generals guarding my home, and the twenty-four divine officers to join in capturing this slave. Let him no longer rebel, but return to his master at once.\n\nLet the talismanic writ be posted at the gates of the local earth god, the Stove God, and the suspended corpse, to be examined thrice daily. Compel him to transform his rebellious heart and confused mind, forcing him to return to my home without further escape. Pursue him relentlessly. When this matter is graciously resolved, I shall duly report your merit and reward your labor in accordance with the law.\n\nYour servant, [Name], prostrates himself and submits this memorial at the risk of death.\n\nRespectfully submitted.\n\nI humbly invoke the Twenty-Four Stellar Generals to transform and subdue this rebel, compelling him to return to my home. Let him not hide in the east, west, south, or north, nor in the nearby or distant wilds. Seize him swiftly, that he may appear before his master at once. When this matter is resolved, I shall promptly report your efficacy and repay your grace.\n\nHasten! As the statute commands!\n\n☲☲☲☲☲☲☲☲☲☲☲☲\nThe Twelve Fire Chariot Envoys of the Most High, acting for me, transform the *hun* and *po* of the rebellious slave [Name].\n☲☲☲☲☲☲☲☲☲☲☲☲\nLet him not flee east or west. Hasten as previously commanded!\n\n☵☵☵☵☵☵☵☵☵☵☵☵\nThe Twelve Water Chariot Envoys of the Most High, acting for me, transform the rebellious slave [Name].\n☵☵☵☵☵☵☵☵☵☵☵☵\nLet him not flee east or west. Hasten to return him as previously agreed!\n\n☰☰☰☰☰☰☰☰☰☰☰☰\nThe Twelve Metal Chariot Envoys of the Most High, acting for me, transform the rebellious slave [Name].\n☰☰☰☰☰☰☰☰☰☰☰☰\nLet him return at once, unable to flee east or west. Hasten as the statute commands!\n\n☴☴☴☴☴☴☴☴☴☴☴☴\nThe Twelve Wood Chariot Envoys of the Most High, acting for me, transform the rebellious slave [Name].\n☴☴☴☴☴☴☴☴☴☴☴☴\nLet him not rebel, but return swiftly as previously agreed!\n\n☷☷☷☷☷☷☷☷☷☷☷☷\nThe Twelve Earth Chariot Envoys of the Most High, acting for me, transform the rebellious slave [Name].\n☷☷☷☷☷☷☷☷☷☷☷☷\nLet him not rebel, but return home at once!\n\n⚐⚐⚐⚐⚐⚐⚐⚐⚐⚐⚐⚐\nThe Twelve Iron Chariot Envoys of the Most High, acting for me, seize and transform the rebellious slave [Name].\n⚐⚐⚐⚐⚐⚐⚐⚐⚐⚐⚐⚐\nLet him not escape, but return as previously agreed!\n\n⚔⚔⚔⚔⚔⚔⚔⚔⚔⚔⚔⚔\nThe Twelve Blade Chariot Envoys of the Most High, seize the rebellious slave [Name].\n⚔⚔⚔⚔⚔⚔⚔⚔⚔⚔⚔⚔\nLet him not flee, but return swiftly as agreed!\n\n⏃⏃⏃⏃⏃⏃⏃⏃⏃⏃⏃⏃\nThe Twelve Bow Chariot Envoys of the Most High, acting for me, subdue the rebellious slave [Name].\n⏃⏃⏃⏃⏃⏃⏃⏃⏃⏃⏃⏃\nLet him be transformed and return at once, as previously agreed!\n\n⏚⏚⏚⏚⏚⏚⏚⏚⏚⏚⏚⏚\nThe Twelve Crossbow Chariot Envoys of the Most High, acting for me, seize the rebellious slave [Name].\n⏚⏚⏚⏚⏚⏚⏚⏚⏚⏚⏚⏚\nLet him not flee, but return swiftly as previously agreed!\n\n☼☼☼☼☼☼☼☼☼☼☼☼\nThe Twelve Sun Chariot Envoys of the Most High, acting for me, subdue the rebellious slave [Name].\n☼☼☼☼☼☼☼☼☼☼☼☼\nLet him be transformed and return home at once, as previously agreed!\n\n☽☽☽☽☽☽☽☽☽☽☽☽\nThe Twelve Moon Chariot Envoys of the Most High, acting for me, turn back the rebellious slave [Name].\n☽☽☽☽☽☽☽☽☽☽☽☽\nLet him not flee, but return swiftly!\n\n☾☾☾☾☾☾☾☾☾☾☾☾\nThe Twelve Kerchief Chariot Envoys of the Most High, acting for me, seize the rebellious slave [Name].\n☾☾☾☾☾☾☾☾☾☾☾☾\nLet him turn his heart and return of his own accord, unwavering in any direction, as previously agreed!\n\nUpon this talisman’s arrival, let the Celestial Bureau seize the three *hun* and seven *po* souls of the slave [Name] and deliver them to the City God’s Grand Temple for arrest. Let him be swiftly transformed and awakened from delusion, that he may not rebel or flee, nor evade his master. Should he attempt to hide in any direction—near or far—let his *hun* and *po* be seized again and delivered to the County Magistrate, the Merit Officer, and the Registrar. Let a direct talisman summon the ghosts to hang his corpse at the community gate, where he shall be examined thrice daily and nightly, swiftly compelled to abandon his delusion, and prevented from fleeing afar. Let him return to his dwelling and submit to his master’s care. Should he rebel and flee again, let him be struck with madness, heart-suspension, cholera, and qi-dysentery, unable to rise. On the day of verification, let swift messengers report the merit and reward the labor, that trust may not be betrayed.\n\nFrom [Name], a male disciple of [State], [County], [Village], [Age] years, this petition is made to transform the household slave [Name], that he may swiftly return home and submit to his master, without rebellion or deviation, as previously agreed.\n\nRespectfully submitted as above, with wholehearted devotion.\n\nTo the Great Dao, this humble servant petitions for the return and transformation of the slave [Name], all as previously stated. On this day, I reverently present a token of sincerity: a silk kerchief, one *shi* and two *dou* of rice, one hundred sheets of white paper, a brush, and an inkstick, to establish my earnest plea. I beseech you to compel the return and subjugation of the slave [Name], who has fled from his master [Name B], and whose whereabouts remain unknown. Let him be swiftly led astray, his desires thwarted, and let him be sternly seized and made to return to [Name B].\n\nThis humble servant, dull and unworthy, has failed to atone for his faults through merit. I, [Name], prostrate in awe and dread, kowtow and submit this vermilion petition, a solemn memorial, to the Celestial Bureaus. I implore the Heavenly Officials, the Generals, the Most High Lords and Venerable Ones, the Lady of the Heavenly Master’s Gate, and the Lords of the Five Qi: may you deign to examine my plea with compassion. Let the matter be conveyed to the Lords of the Constellations and the Lords of the Hosts of Qi, and to the millions of soldiers and all beings, that they may capture and return the fugitive slave [Name]. Let him be swiftly disabused of his delusion and made to return to his master, prevented from fleeing afar or losing his way. Should he persist in rebellion, return home, or betray his master with unrepentant malice, I invoke the Lord of the Net of Heaven with his million soldiers to block and encircle all roads, bind and restrain him, and allow no escape, that he may be compelled to return to his master.\n\nI further invoke the City God Zhang Yuanfan of the local shrine to hang his corpse at the community gate, as previously described.\n\nI reverently summon:\n- The Azure Emperor of the East, with his 810,000 soldiers;\n- The Vermilion Emperor of the South, with his 640,000 soldiers;\n- The White Emperor of the West, with his 360,000 soldiers;\n- The Black Emperor of the North, with his 250,000 soldiers;\n- The Yellow Emperor of the Center, with his 12,000 soldiers.\n\nLet them unite in purpose and strength to compel the return of the household slave [Name], who has fled his master with unrelenting malice. Let him lose his way, be unable to flee, and be swiftly seized and returned to his master, without loss or escape, as previously agreed. Upon the fulfillment of this vow and the safe return of the slave, let merit be reported and labor rewarded, and let the celestial soldiers and prison wardens be duly honored, that trust may not be betrayed.\n\nRelying upon the Two Officials, the Direct Envoys, the Merit Officers of the Orthodox Unity, the Left and Right Attendants, the Spirits of the Dark Intestines, the Judgment Chariot Officers of the Vermilion Talismans, and the Courier Officials of the Rushing Winds—each dispatched in pairs—I humbly petition the Heavenly Officials on behalf of [Name] for the return of the household slave [Name], who has fled his master. Let him not be lost or allowed to wander east, west, south, or north, but let him lose his way and emerge of his own accord to return home. I submit this vermilion petition and linked memorial to you, my lord.\n\nThis humble servant, [Name], unworthy and insignificant, dares not refuse or delay. I kowtow in dread and prostrate myself in submission, beseeching the Heavenly Officials to deign to examine my plea. Let it ascend to the Three Celestial Bureaus, and may I await your decree.\n\nI, your servant [Surname], invoke the Most High Lord Lao, the Supreme Venerable of the Three Heavens and the Boundless Great Dao; the Heavenly Emperor and Venerable Lord; the Nine Elders of the Immortal Capital; the Venerable Lords of the Nine Qi and the myriad hosts of the Dao; the Twelve Hundred Officials of the Great Clarity; and the Jade Court of the Great Clarity.\n\nThe ritual of the Orthodox Unity’s petition is now complete for the year [Year].",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "正一出官章仪 经名：正一出官章仪。 撰人不详，约出於南北朝。 系早期天师道出官上章醮仪。 一卷。 底本出处：《正统道藏》洞神部威仪类。 正一出官章仪 回善章出官 谨出臣身中五体真官功曹吏，出三五清微天、禹余天、大赤天，五炁功曹，上皇真人，十二真官，神元赤炁赤车使者，阴阳真炁黄书契令腹目君将吏，阴阳生气度道开化君将吏，九炁丈人逮召将吏，消灾散祸解厄君将吏，还神君将吏，胎生赤白涌池将军吏官各十二人，出臣身中上仙上灵二官，直使功曹官各二人，出三五直使功曹官各二人，出正一功曹收凶录吏官各二人，出上部功曹收恶吏官各二人，出中部功曹收录逆吏官各二人，出下部功曹收害吏官各二人，出促炁功曹收阴阳吏官各二人，出上部使者收魂录魂吏官各二人，出中部使者收魄录魄吏官各二人，出下部使者连头反缚吏官各二人，出促炁使者监时守击吏官各二人，出左官使者打核锁槛吏官各二人，出右官使者开枷闭狱吏官各二人，出高车使者锐其头截其耳 吏官各二人，出赤车使者监路巾官吏各十二人，出高手截项吏官各十二人，出监杀直兵吏官各十二人，出监杀参军吏官各十二人，出监杀功曹吏官各十二人，出监杀真符吏官各十二人，出监杀促战吏官各十二人，出监杀信旛吏官各十二人，出监杀拔剑吏官各十二人，出监杀呜鼓吏官各十二人，出监杀长刀截头吏官各十二人，出刚风骑置驿马捉法逆战吏等官各十二人出，出者严装显服，冠带垂缨，住立，臣前后，具衔，臣所受今有某口辞列素，求乞章书回化厌倒，捕逐恶人凶害谋图之人，臣伏按天地科法，好生恶杀，赏善罚恶，忝佩符箓，职任在身，受约之日法当宣扬正化，诛灭恶人，今有某州县某乡里月日某被某事，即日叩头，告臣元无所见，苦切非轻，为某谨按天师科法，拜上赤章一通，臣启此问土地里域真官正炁所在君将吏兵士等，监察考召里社庙主，共收取恶人某，被害伐吏兵钩出都住，臣左右走使擒缚恶人，某身住某，前后皆为悬头锐截，不得宽延严装，事讫错锌，刺杀恶人，某身章上所请天官将吏兵士立臣前后，听读章文，各依次第，厌伐恶人，某弥加摄录三魂七魄，封着天曹，问恶人作横使伏诺考召之刺取，三日四日即令伏死，急急如 太上老君律令，今日上请赤天将军收执恶人，吏兵士万人来列恶人某家收缚灭之，上请官将吏兵万人斩截恶人，某诳言惑语，上请官将吏兵士三十万人来下考恶人，某迷惑游走，上请将军吏兵收取，平论道德，吏兵士三十万人来下缚取恶人，某劳头返缚，捍社考劾，口不得语，上谤师无道不敬，吏兵三十万人来下收取返缚，以得为限，即为灭之，汤煮火烧，筋骨焦然，身没十八地狱之中，请天官将吏兵士及时诣某家收魂魄送付社令，悬头考问治罪，急急如 太上金口律令，臣请乞开伏读章文於案，谨重敕臣身中五体直官功曹使者书佐小吏朱阳之帻。 拜章了月厌十三步，书恶人名着符上，左手捻刀作穴中绝炁，以左脚大指踏之，三过止咒曰： 咄，天纲何相相，地理何亡亡，收恶人某魂魄付镬汤，急入天纲之下密厌深藏，若汝出破伤身，入上失故乡，如吾敕诛张，急急如太上老君律令。",
      "translated_text": "**Zhengyi Official Departure Rites**\n*Sutra Title:* Zhengyi Official Departure Rites. Author unknown, likely composed during the Northern and Southern Dynasties. A ritual text for early Heavenly Master Daoist petitions (zhang) and offerings (jiao) upon an official’s departure. One scroll.\n\n**Source Text:** *Zhengtong Daoist Canon*, Dongshen Section, Wei Yi (Ritual Dignity) Category.\n\n---\n\n**Zhengyi Official Departure Rites: Petition for the Return of Goodness**\n\nWith reverence, I dispatch the Five Body True Officials and Merit Officers from within my person, ascending through the Three-Five Pure Subtlety Heaven, Yu Yu Heaven, and Great Red Heaven. I summon the Five Qi Merit Officers, the Supreme August Perfected, the Twelve True Officials, the Divine Origin Red Qi Red Chariot Envoys, the Yin-Yang True Qi Yellow Script Contract Spirit-Eye Lords and Officers, the Yin-Yang Generative Qi Dao-Transmitting Transformation Lords and Officers, the Nine Qi Elders and Summoning Officers, the Disaster-Dispelling Calamity-Resolving Deliverance Lords and Officers, the Spirit-Returning Lords and Officers, and the Twelve Officers each of the Crimson and White Surge Pool Generals.\n\nI dispatch the Two Upper Immortals and Two Upper Spirits from within my person, along with their Direct Merit Officers; the Two Direct Merit Officers each from the Three-Five Heavens; the Two Zhengyi Merit Officers to collect inauspicious records; the Two Upper Section Merit Officers to collect malevolent officers; the Two Middle Section Merit Officers to record rebellious officers; the Two Lower Section Merit Officers to collect harmful officers; the Two Urgent Qi Merit Officers to gather Yin-Yang officers; the Two Upper Section Envoys to collect and record souls; the Two Middle Section Envoys to collect and record po; the Two Lower Section Envoys to bind and reverse-restrain; the Two Urgent Qi Envoys to monitor time and strike; the Two Left Official Envoys to strike, verify, lock, and imprison; the Two Right Official Envoys to open shackles and seal prisons; the Two High Chariot Envoys to sharpen heads and sever ears; the Twelve Crimson Chariot Envoys to monitor roads and headscarf officers; the Twelve High-Handed Officers to sever necks; the Twelve Direct Execution Officers; the Twelve Adjutant Execution Officers; the Twelve Merit Officer Execution Officers; the Twelve True Talisman Execution Officers; the Twelve Urgent Battle Execution Officers; the Twelve Banner Execution Officers; the Twelve Drawn-Sword Execution Officers; the Twelve Drum-Beating Execution Officers; the Twelve Long Saber Beheading Officers; and the Twelve Officers of the Rushing Wind Cavalry, stationed at post-horses to seize and suppress rebellious battles.\n\nAll dispatched officers shall be clad in solemn attire, adorned with caps and hanging tassels, standing before and behind me, bearing their full titles. I, having received [the mandate], now present a certain oral petition and written memorial, beseeching the return of transformative grace to suppress and invert [evil], to capture and expel malevolent schemers.\n\nI humbly invoke the statutes of Heaven and Earth, which cherish life and abhor killing, rewarding good and punishing evil. Charged with the duty of talismanic registers, I, bound by my office, am sworn to propagate the true transformation and eradicate the wicked. Today, in a certain prefecture, county, village, and hamlet, on a certain day and month, [a victim] suffered a certain affliction. Kneeling in supplication, I confess my ignorance of the matter, for the distress is grave.\n\nIn accordance with the Heavenly Master’s statutes, I reverently present a Crimson Petition. I invoke the local Earth God and the True Qi-Residing Lords, Officers, and Soldiers of this domain to investigate, summon, and gather the malevolent one, [named] so-and-so, to be seized by the punitive officers and brought forth.\n\nMy swift envoys to the left and right shall apprehend and bind the malefactor, so-and-so, wherever he may be, his head suspended and sharpened, allowing no respite. Once the matter is concluded, the execution shall be swift. The Heavenly Officers, Generals, Soldiers, and Officers I have invoked shall stand before and behind me, listening to the reading of this petition, each proceeding in order to suppress the malefactor, so-and-so, further restraining his three hun and seven po, sealing them in the Heavenly Courts.\n\nI interrogate the malefactor for his transgressions, compelling his submission and punishment. Within three or four days, he shall be forced to death. *Hastily, as per the Statutes and Ordinances of the Supreme Venerable Sovereign!*\n\nToday, I invoke the Crimson Heaven General to seize the malefactor, with ten thousand officers and soldiers arrayed to bind and destroy him at his home. I invoke ten thousand Generals, Officers, and Soldiers to behead the malefactor, so-and-so, for his deceitful and bewildering words. I invoke three hundred thousand Generals, Officers, and Soldiers to descend and interrogate the malefactor, so-and-so, for his delusions and wanderings. I invoke Generals and Soldiers to apprehend him, to weigh his conduct against the Dao and its virtue. Three hundred thousand soldiers shall descend to bind the malefactor, so-and-so, his head reversed and restrained, his community punished and censured, his mouth silenced.\n\nFor slandering his master as unvirtuous and disrespectful, three hundred thousand soldiers shall descend to seize and reverse-bind him, to be annihilated without limit—boiled in cauldrons, burned by fire, his sinews and bones scorched, his body consigned to the Eighteen Hells. I beseech the Heavenly Officers, Generals, Soldiers, and Officers to promptly proceed to the malefactor’s home, collect his hun and po, and deliver them to the Earth God for suspension, interrogation, and punishment. *Hastily, as per the Golden Mouth Statutes and Ordinances of the Supreme Venerable Sovereign!*\n\nI request to open and recite the petition before the altar. With solemnity, I further charge the Five Body Direct Officials, Merit Officers, Envoys, Scribes, and Lesser Officers of the Vermilion Yang within my person.\n\nUpon completing the petition, tread thirteen steps to suppress [the malefactor]. Inscribe the malefactor’s name upon the talisman, grasp the knife in the left hand to sever qi within the pit, and press with the left big toe, repeating thrice. Then recite the incantation:\n\n*\"Hark! How the Heavenly Net interlaces! How the Earthly Principles perish! Seize the malefactor, so-and-so’s hun and po, and consign them to the cauldron’s boiling waters. Enter swiftly beneath the Heavenly Net’s dense suppression, deeply concealed. Should you escape, your body shall be harmed; should you enter above, you shall lose your homeland. As I decree the execution of Zhang, hasten! Hastily, as per the Statutes and Ordinances of the Supreme Venerable Sovereign!\"*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1233,
      "start_sentence": 0,
      "end_sentence": 13,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.09723138809204,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\正一出官章仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "左回还生炁上善人着北壁边高三尺讫。 谨请翻纲倒地大将军千二百人，张眼廓目君百二十人，又请五方大额神君各千二百人，收录恶人三魂七魄，考究治罪，枉击某身牵引，谨请太白君回化恶人之心，愿切伏匿消灭摧伏，急急如律令。 又一法，某处筑坛书恶人名，以竹筒盛之五路，及月厌上安打令，没蹑七星步，从月建上来就厌建与厌同，从生熙来厌，咒曰： 朝发大灵台，回向符官神到，天曹诛杀恶人，急急如太上老君律令。 咒曰 天地行符，摄录鬼神，大道行符，摄录真神，三师行符，天道自然，自知非真，勿当吾神，所治者愈，所救者脱，所厌者伏，所护者活，为护神真，急急如太上玄都老君律令。 用盬一斗二升，清水一石二斗，大刀一口，炭三斤，油一斗二升，咒曰： 五行相推，纲最持威，六纪辅我，三尊辟非， 天回地转，三五璇玑，长生久视，日月同辉， 逆我者灭，背道者衰，三纲六纪，沈在纲前， 众口皆灭，刑狱释然，急急如律令。 回好章出官 谨出臣身中五体真官功曹吏，出大圣真神录仙灵官使者功曹各二人，出泰玄二官直使功曹二人，出都部功曹二人，出上部功曹二人，出中部功曹二人，出下部功曹二人，出左右官使者二人，出赤车使者二人，出阴阳神决吏二人，出科车赤符吏二人，出刚风骑置驿马上章吏各十八人，出飞龙骑吏等各十八人，出功曹吏兵各十八人出，出者严装显服冠带住立，臣前后咸受，臣口中辞语，分别关启，此间州县乡里真官注炁监察，里域考召君将吏等，今谨有某所陈某事，臣谨为某拜上三五回好章一通，在臣前素案之上。 章文 泰玄都正一平炁系天师鹤呜治太上中炁元命真人统领十五阶，臣某稽首再拜上言，谨按文书本贯某州县乡里，臣某谨上启 太上无极大道太上老君，天师女师嗣师系师君夫人门下五炁君等，今时谨有某州县乡里，某年如千岁户一家口如千人，今居某村住止，即日叩头，列素胎生肉人，百官子孙，千载有幸，制属 太上诸君丈人三师道炁，以自保持，得在清心，从来蒙恩，诚自欢慰，而某顽肉奖绿，会遇值运，不以微躯耗附灵泽，洗尘涤垢，沐浴清风，染身行化，得佩法箓长生之术，仰衔大恩，常蒙佑护，且臣暗昧有余，不能隐栖岩谷，奉法违科，举动施为，触事成衅，某忽於某年月日，横被某事或恶人毒心所欲侵害，绿某事情，吏曹或视罪过欲潜害某，或所妬，臣忝蒙大道之恩，身符秘法，受道之日，法当为禳灾害，而某恶逆生心规图，谋相中伤，潜击於某不胜为，被此恶人某等四面非横，更相凌易，上穷下连，复情计切，肝胆涂地，今者托身幽冥，仰凭至真，一希道炁，保助某禳却恶人口舌，回化恶人恶逆之心，见某必令欢悦，某得理，某甲受罪，若故行恶逆，谋图欲见中伤某，请乞当令恶人恶逆自破碎死亡，悉令灭族，返受其殃，不得动作，若有不良之者，又欲於中故相谗击，某者破死摧灭，伏地而死，无动无作，上请东方青帝，南方赤帝，西方白帝，北帝黑帝，中央黄帝等，各一人吏兵八千人，主为厌伏恶人吏民四面口舌，某恶人某等皆令消伏不成，欲作灾害者，即令绝灭，上请五方明星君，周天八极君，官将百二十人，主为回化天纲转地纪，某口舌即息，并自消灭，又请北斗魁纲君，主为回化，四面恶人望风皆执伏破坏，若恶人恶心事不止，即令魁纲掩其口，使不得语，上请消炁兵士十万人，主为某恶心事不止，即消除四面众灾害气，欲令来侵犯某者，皆令摧灭，又请官律君一人，官将千二百人，重请玄兵十万人，又请主星君十万人，官将百二十人，治地官主摧元炁，捉击恶人，皆令消亡，又请盟威君官将百二十人，又请高仓君官将百二十人，又请天官佑护将军万福丈人官将百二十人，一合下主，为消灭恶人，聚会口舌，谗击某身者，以时迷惑其心，皆令自灭，又请和合官将百二十人，主为某消恶人某没入太阴之中，又请四时五刑运炁君将百二十人，主消恶人某，皆令执伏，又请东方大额君，南方大额君，西方大额君，北方大额君，中央大额君，官将千二百人，为某消伏阳官口舌，并求中伤谗击某者，皆令灭亡，心迷意惑，返自受殃，又请无上诸玄君兵士百二十人，又请南镇五星将吏兵各百二十人，又请越女兵三十万亿人，一时下收捕恶人某，四面非谤潜击之心，乞皆伏死魁纲之下，不得动作言语，心迷意惑，使自伏灭，某在生炁之中过度灾厄，今某洗心解脱，酌水香火，并总以消恶人横祸官私口舌，吏民盗贼，皆令沙崩，开解，一时释散，然臣不以罪秽忝佩符箓，人末形微，不任某被恶人某非谤诬损，元逆之甚，令释散安隐无他，如愿之日，输送付还所在讫，然臣所请事众官，一时言功举迁，进入中宫加宠，置与便曹隐职，各加其状，将吏千二百人等兵士五十万人等，如天曹科比无令失意，恩惟",
      "translated_text": "Circling leftward, restore the qi of life and place the virtuous person by the northern wall, elevated three feet. Reverently invoke the Twelve Hundred Generals of the Inverted Net and Overturned Earth, the One Hundred Twenty Lords of Wide-Eyed Vision, and the Twelve Hundred Great Forehead Spirit Lords of the Five Directions to seize and record the three hun and seven po of the malefactor, to examine and punish their crimes, and to drag forth all who unjustly strike or entangle this person. Reverently invoke the Lord of Venus to transform the malefactor’s heart, earnestly beseeching their concealment, annihilation, and subjugation. Hasten! As per the Statutes and Ordinances.\n\nAnother method: at a designated place, construct an altar and inscribe the malefactor’s name. Place it within a bamboo tube along the five directions, and strike it upon the monthly suppression. Tread the Seven Star Steps, advancing from the monthly establishment to the suppression’s position, aligning suppression with establishment, and suppression with the flourishing of life. Recite the incantation:\n\n*\"Departing at dawn from the Great Numinous Terrace,\nReturning to the talismanic officials and spirits,\nThe Heavenly Bureaus execute and slay the malefactor.\nHasten! As per the Statutes and Ordinances of the Supreme Venerable Sovereign.\"*\n\nRecite the incantation:\n\n*\"Talismans traverse Heaven and Earth,\nSeizing and recording ghosts and spirits.\nTalismans traverse the Great Dao,\nSeizing and recording the true spirits.\nThe Three Masters’ talismans—\nThe Heavenly Dao is spontaneous.\nShould you know yourself not true,\nDo not oppose our spirits.\nThose we treat are healed,\nThose we save are freed,\nThose we suppress are subdued,\nThose we protect live.\nTo protect the divine spirits,\nHasten! As per the Statutes and Ordinances of the Supreme Mystic Capital Venerable Sovereign.\"*\n\nUse one *dou* and two *sheng* of salt, one *dan* and two *dou* of clear water, one large blade, three *jin* of charcoal, and one *dou* and two *sheng* of oil. Recite the incantation:\n\n*\"The Five Phases propel one another,\nThe Net upholds its might.\nThe Six Disciplines assist me,\nThe Three Honored Ones dispel transgression.\nHeaven revolves, Earth turns,\nThe Three and Five pivot as jade orbs.\nLong life and enduring vision,\nSun and Moon shine together.\nThose who oppose me perish,\nThose who turn from the Dao decline.\nThe Three Bonds and Six Disciplines\nSink before the Net.\nAll mouths are silenced,\nPunishments and prisons dissolve.\nHasten! As per the Statutes and Ordinances.\"*\n\nPresent the auspicious petition to the officials.\nReverently dispatch the true officials and functionaries of the Five Bodily Viscera within my person: two functionaries each from the Great Sage True Spirit Register and the Numinous Official Envoys, two functionaries each from the Direct Envoys of the Two Offices of Supreme Mystery, two functionaries each from the Capital Bureau, the Upper Bureau, the Middle Bureau, the Lower Bureau, the Left and Right Official Envoys, the Crimson Chariot Envoys, the Yin-Yang Divine Decision Clerks, the Scarlet Talismanic Chariot Clerks, eighteen each of the Just Wind Couriers and Post-Horse Petition Clerks, eighteen each of the Flying Dragon Cavalry Clerks, and eighteen each of the Functionary Soldiers. All who emerge shall be clad in solemn attire, caps, and sashes, standing in formation before and behind me, all receiving my commands. The words from my mouth shall be distinctly transmitted and reported. Here, the true officials of the prefectures, counties, townships, and villages, the qi-monitoring overseers, and the local summoning lords and generals—now, I reverently present on behalf of so-and-so a petition of threefold auspicious return, placed upon the plain table before me.\n\n**Petition Text**\n\nTo the Supreme Mystery Capital, the Orthodox Unity, the Balanced Qi, the Celestial Master of the Crane’s Call Retreat, the Supreme Middle Qi, the Primordial Destiny True Person, overseer of the fifteen ranks—your servant so-and-so bows his head and prostrates himself twice to memorialize:\n\nReverently following the records of my native prefecture, county, township, and village, your servant so-and-so humbly addresses the Supreme Boundless Dao, the Supreme Venerable Sovereign, the Celestial Master, the Female Master, the Lineage Master, the System Master, the Lady of the Gate, and the Lords of the Five Qi. At this time, in such-and-such prefecture, county, township, and village, a household of a thousand years and a thousand mouths, now residing in such-and-such village, today kowtows as a plain, flesh-born mortal, a descendant of the myriad officials, fortunate for a thousand ages, governed by the Dao-qi of the Supreme Lords, the Elders, and the Three Masters, preserving purity of heart. From the beginning, I have received grace, truly rejoicing and consoled. Yet I, a dull and coarse being, have encountered the turning of fate, not daring to squander my humble body in attachment to numinous blessings, washing away dust and filth, bathing in the pure wind, and embodying transformation. Having received the registers of the Dao and the arts of long life, I bear great favor and am constantly protected. Moreover, my ignorance is profound; I cannot retreat to the cliffs and valleys. In upholding the Dao, I violate its regulations; in every action, I provoke conflict. Suddenly, on such-and-such year, month, and day, I was unjustly afflicted by such-and-such matter, or by the poisonous intent of a malefactor seeking to harm me. Due to such-and-such circumstances, the bureaucratic offices may perceive my transgressions and seek to secretly harm me, or I may be envied. Though I have unworthily received the grace of the Great Dao, the secret talismans, and the Dao’s teachings, from the day I accepted the Dao, I was bound to dispel calamities. Yet this malefactor, harboring rebellious intent, schemes to injure me, secretly striking me beyond endurance. Beset by this malefactor so-and-so on all sides with false accusations, ever more oppressive, their schemes relentless, my liver and gall spill upon the earth. Now, entrusting myself to the darkness, I rely upon the utmost truth, hoping for the Dao’s qi to protect and assist me in dispelling the malefactor’s slander, transforming their rebellious heart. May they regard me with joy; may I prevail, and may so-and-so be punished. If they persist in malice and scheming to harm me, I beseech that the malefactor and their rebellious kin be shattered and destroyed, their clans annihilated, and their misfortunes returned upon them, unable to act. Should any harbor ill intent and falsely accuse or strike me, may they be broken, destroyed, and perish prostrate, unable to move or act.\n\nI invoke the Azure Emperor of the East, the Vermilion Emperor of the South, the White Emperor of the West, the Black Emperor of the North, and the Yellow Emperor of the Center, each with eight thousand soldiers, to suppress the malefactor’s officials, people, and slander on all sides. May the malefactor so-and-so be utterly subdued, and those who would cause calamity be annihilated. I invoke the Bright Star Lords of the Five Directions and the Lords of the Eight Extremities of the Celestial Sphere, one hundred twenty officials and generals, to transform the Heavenly Net and turn the Earthly Principles, silencing all slander and causing it to vanish. I invoke the Lord of the Northern Dipper’s Net to transform the malefactors on all sides, compelling them to surrender and be destroyed at the mere sight of me. Should the malefactor’s malice persist, may the Net cover their mouths, rendering them speechless. I invoke one hundred thousand soldiers of Consuming Qi to dispel all calamities and harmful qi from the four directions that would assail me, crushing and annihilating them. I invoke the Lord of Official Statutes with one thousand two hundred generals, and reverently invoke one hundred thousand Mystic Soldiers and one hundred thousand Star Lords with one hundred twenty generals to govern the Earthly Officials, suppress primordial qi, and seize and strike the malefactors, causing them to vanish. I invoke the Lords of the Oath’s Might with one hundred twenty generals, the Lords of the High Granary with one hundred twenty generals, and the Heavenly Official Protector General, the Lord of Ten Thousand Blessings, with one hundred twenty generals, all to descend and dispel the malefactors’ gatherings and slanderous strikes against me, confounding their hearts and causing their self-destruction. I invoke the Harmonizing Generals with one hundred twenty men to consign the malefactor so-and-so to the Great Yin. I invoke the Lords of the Four Seasons and Five Punishments’ Circulating Qi with one hundred twenty generals to subdue the malefactor so-and-so, compelling their surrender. I invoke the Great Forehead Lords of the East, South, West, North, and Center, each with one thousand two hundred generals, to dispel the slander of the yang officials and all who seek to harm or falsely accuse me, causing their annihilation, hearts confounded and minds bewildered, returning their misfortunes upon them. I invoke the Supreme Mystic Lords with one hundred twenty soldiers, the Southern Guardian Five Star Generals and clerks with one hundred twenty each, and thirty myriad billion soldiers of the Yue Maiden, all to descend at once and capture the malefactor so-and-so, suppressing their slanderous and secret strikes on all sides beneath the Net, unable to act or speak, hearts confounded and minds bewildered, causing their self-subjugation and annihilation. May I, abiding within the qi of life, traverse calamities and hardships. Now, I purify my heart and liberate myself, offering water, incense, and flame to dispel the malefactor’s unjust misfortunes, official and private slander, bureaucrats, people, thieves, and bandits, causing them to collapse like sand, unraveling and dispersing at once. Though I, unworthy and stained, unworthily bear the talismans and registers, my form is humble and my endowment slight. I cannot endure the malefactor so-and-so’s false accusations and slander, their extreme rebelliousness. May they be released and pacified, free from harm. On the day my wishes are fulfilled, I shall offer repayment and return all to their proper places. Thus, the officials I have invoked shall all report their merits, be promoted, and enter the Central Palace to receive honors, placed in hidden offices with increased ranks. The one thousand two hundred generals and five hundred thousand soldiers shall, according to the Heavenly Bureaus’ regulations, not be neglected. I humbly implore...",
      "overlap_context": "ecite the incantation:\n\n*\"Hark! How the Heavenly Net interlaces! How the Earthly Principles perish! Seize the malefactor, so-and-so’s hun and po, and consign them to the cauldron’s boiling waters. Enter swiftly beneath the Heavenly Net’s dense suppression, deeply concealed. Should you escape, your body shall be harmed; should you enter above, you shall lose your homeland. As I decree the execution of Zhang, hasten! Hastily, as per the Statutes and Ordinances of the Supreme Venerable Sovereign!\"*",
      "start_char": 1234,
      "end_char": 3109,
      "start_sentence": 14,
      "end_sentence": 30,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 52.83233189582825,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\正一出官章仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "太上分别操，臣谨为某为某事告臣，伏地拜上回好章，伏恶人赤章一通，上诣 太上三天曹伏须告报，臣某甲诚惶诚恐稽首再拜以闻。 臣姓某系某州县宫观焚修 太清玄元无上三天无极大道太上老君，太上丈人，天帝君，九老仙都君，九炁丈人百千万重道炁，千二百官君太清玉陛下。 太岁 开牢狱章 泰玄都正一平炁系天师阳平治左平炁 臣某稽首再拜 上言，谨按文书某州县，某乡里，某年若干岁若干人，某处住止，即日叩头辞，素以胎生肉人，百官子孙，千载有幸，得奉",
      "translated_text": "The Most High distinguishes the handles of governance; I, your servant, reverently submit this petition on behalf of so-and-so for such-and-such matter. Prostrate upon the earth, I present this memorial of restored harmony and this single vermilion memorial of condemnation, to be delivered upward to the Three Heavenly Bureaus of the Most High, awaiting your report. I, so-and-so, with trembling awe and utmost reverence, bow my head twice in obeisance to make this known.\n\nI, your servant, of the such-and-such clan, affiliated with the such-and-such prefecture, county, abbey, or temple, diligently cultivate the flames of devotion to the Great Clarity, Primordial Origin, Most High, Three Heavens, Boundless, Supreme Dao, the Most High Lord Lao, the Venerable Celestial Elder, the Heavenly Thearch, the Nine Elder Perfected Lords of the Grotto-Heaven, the Venerable Lords of the Nine Qi, the myriad layers of the Dao and qi, and the One Thousand Two Hundred Official Lords under the Jade Throne of the Great Clarity.\n\nMemorial for Opening Prisons and the Chapter of the Supreme Mystery of the Orthodox Unity, Balanced Qi, of the Celestial Master of the Yangping Abbey, Left Balanced Qi.\n\nI, your servant so-and-so, bow my head twice in obeisance and declare: According to the documents of such-and-such prefecture and county, in such-and-such village, there resides a person of such-and-such age, who today kowtows and takes leave. Born of flesh and blood, descendant of the hundred officials, I have been fortunate for a thousand generations to serve...",
      "overlap_context": "liousness. May they be released and pacified, free from harm. On the day my wishes are fulfilled, I shall offer repayment and return all to their proper places. Thus, the officials I have invoked shall all report their merits, be promoted, and enter the Central Palace to receive honors, placed in hidden offices with increased ranks. The one thousand two hundred generals and five hundred thousand soldiers shall, according to the Heavenly Bureaus’ regulations, not be neglected. I humbly implore...",
      "start_char": 3109,
      "end_char": 3341,
      "start_sentence": 31,
      "end_sentence": 39,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.823187112808228,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\正一出官章仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "大道，从来蒙恩，忽值轗轲疾病，更互梦想不真，祆怪竞兴，公私口舌，横生无端，而某先身量染狱刑冤对，某身某事月日被某事文案，今勘当收执枷禁刑，自属於法狱文案，纷纭即罪罚犹极，肉人惶怖，向臣告诉，求乞料理，具如所列，自己人鬼治罪各有所属，鬼刑绕右诣狱，人刑绕左诣狱，难出显异，一统刑罪参同，请为某推案阴阳二律，恐某前身今身犯阴阳过，考属左官，死犯行诣狱，某身今幽执囹圄，身被鞭杖考掠，禁对求请枉抑，某身轻重未测，当令阳九之世，人鬼恶逆，或为奸吏所苦，或协以先雠，图相刑憾，枉理於禁系之下，害人乞掠求情，无所不至，臣以理救度刑厄，天慈所重，某今被刑狱飙急，事留生变，不宜稽停，辄为冒汤火，露出中庭太阳之下，拜单章急开，伏愿 天慈必垂救拔，谨为某上请十方飞天仙官骑乘三开南门主者，某前身宿对所犯阴罪阳过，愿为飞疾解脱，又请司过君解将各百二十人急左官阳符之中，随某今罚所在为，若有奸吏宿怨追见执累者，愿请回化逆化君官将百二十人，与迥迷吏官宽人对简令回伏，若某逐奸逆豫魂恶性不解化，愿与回迷吏官宽人对简令过伏，若某逐奸逆，请五方大额君兵士千万人符，摄狱槛神考额逆吏官，诸欲强梁者，惊魂制刑，迷其六情，落算结舌，与心同心，然愿刑狱解散，罪殃绝灭，身无痛楚，以为恩效，当为所请天官，言功报劳，不负效信，恩惟 太上，分别求哀，操臣谨为某事拜请元官吏兵士解散，请问死灭乞恩，朱章一通，上诣太上三天曹，伏须告报，臣某诚惶诚恐，稽首再拜以闻。 臣姓 太清玄元无上三天无极大道太上老君，太上丈人天帝君，九老仙都君，九炁丈人百千万重道炁千二百官君太清玉陛下 太岁 又一法，出病家人门，故脚踏门限都监印，咒曰：",
      "translated_text": "By the boundless grace of the Great Dao, I have long received favor, yet suddenly afflicted by misfortune and illness, beset by confused dreams and unreal visions, demonic disturbances arise in succession, while public and private disputes erupt without cause. Moreover, in my former life, I incurred the entanglements of prison, punishment, and grievous karmic retribution; in this life, on such-and-such a day of such-and-such a month, I was implicated in such-and-such a case. Now, upon investigation, I am to be seized, shackled, and imprisoned, subject to the legal proceedings of the earthly prison. The charges are manifold, the penalties severe, and as a mortal, I am filled with dread. Turning to your servant, I plead for redress, as is duly recorded.\n\nIn the administration of justice, humans and ghosts each have their proper jurisdiction: ghostly punishments proceed to the right, entering the prison; human punishments proceed to the left, entering the prison. Yet the distinctions are obscured, and the penalties for both are conflated. I beseech you to examine my case under the dual laws of yin and yang, lest I, in former or present life, have transgressed against either, thereby falling under the jurisdiction of the Left Bureau, or having died in violation of the law, now proceed to prison. Presently, I am secretly detained in the dungeon, my body subjected to the lash, the rod, and torture, confined and interrogated, my pleas suppressed. The severity of my plight remains uncertain.\n\nIn this age of the Yang-Nine, humans and ghosts alike are perverse and rebellious. Some suffer at the hands of corrupt officials, while others are ensnared by old enmities, scheming to inflict harm and exact vengeance, unjustly imprisoning and tormenting their victims, stopping at nothing to extort confessions. Moved by principle, I seek to deliver those in peril from the calamity of punishment, for this is the weighty concern of Heaven’s compassion.\n\nNow, as the storm of prison and punishment presses urgently upon me, and matters may yet take a turn for the worse, delay is inadvisable. Thus, I dare to brave scalding waters and flames, emerging beneath the open sky of the central courtyard, prostrating myself to present this urgent memorial for the swift opening of my case. I humbly pray that Heaven’s compassion will surely grant deliverance.\n\nI respectfully petition the flying celestial officials of the ten directions, mounted and ready, to open the Southern Gate thrice, that the yin offenses and yang transgressions of my former life’s karmic retribution may be swiftly dissolved. I further petition the Lords of Transgression, dispatching one hundred and twenty attendants into the Yang Talismans of the Left Bureau, to follow the penalties now imposed upon me. Should corrupt officials or old grudges pursue and entangle me, I pray to the Lords of Reversal and Transformation to dispatch one hundred and twenty attendants, compelling the obstinate clerks and oppressive officials to relent, their enmity dissolved.\n\nIf I persist in following the wicked, my soul obstinate and unrepentant, I pray that the Lords of Reversal and Transformation will compel the obstinate clerks and oppressive officials to submit, their malice turned to compliance. Should I continue to pursue the perverse, I beseech the Great Banner Lords of the Five Directions, with their legions of ten thousand soldiers, and their talismans, to seize the gods of the prison bars and the examiners of the rebellious officials. Let all who would act with violence be struck with terror, their souls subdued, their six senses confounded, their reckonings disrupted, their tongues tied, their hearts aligned with mine. Thus may the prison be dissolved, the calamities of punishment eradicated, and my body freed from pain and suffering, as a sign of your merciful efficacy.\n\nIn gratitude, I shall report the merits of the celestial officials who heed my plea, ensuring their labors are duly rewarded, and my vow of faithfulness upheld. I implore the Most High to discern my plea and grant mercy. With reverence, your servant petitions the primordial officials, clerks, and soldiers to disperse these afflictions. I humbly inquire after the dead and beseech your grace, presenting this vermilion memorial to the Three Heavenly Bureaus of the Most High. Awaiting your decree, I, your servant, bow my head twice in awe and trepidation, prostrating myself to make this known.\n\nYour servant [Name],\nBefore the Jade Throne of the Great Clarity, the Celestial Elder of the Boundless Dao of the Three Heavens, the Heavenly Thearch, the Nine Elder Perfected Lords of the Grotto-Heaven, the Venerable Lords of the Nine Qi, the myriad layers of the Dao and qi, and the One Thousand Two Hundred Official Lords.\n\nIn the Year of [Tai Sui],\n\nAnother method: Upon leaving the patient’s home, step over the threshold while imprinting the seal of the Prison Overseer, and recite the incantation:",
      "overlap_context": " Chapter of the Supreme Mystery of the Orthodox Unity, Balanced Qi, of the Celestial Master of the Yangping Abbey, Left Balanced Qi.\n\nI, your servant so-and-so, bow my head twice in obeisance and declare: According to the documents of such-and-such prefecture and county, in such-and-such village, there resides a person of such-and-such age, who today kowtows and takes leave. Born of flesh and blood, descendant of the hundred officials, I have been fortunate for a thousand generations to serve...",
      "start_char": 3341,
      "end_char": 4045,
      "start_sentence": 40,
      "end_sentence": 46,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.953150749206543,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\正一出官章仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "咄，吾能收鬼伏邪，为言迁害病某之鬼抽腹出肝，吾师返病某乙伏寒，急急如律令，勿回顾也，叩齿出官。 谨出臣某身中所佩上仙上灵二官，直使正一功曹各二人，出中部功曹使者各二人，出五帝使者各二人，出四时功曹各二人，出四时使者各二人，出阴阳神庾吏各二人，出科车赤符吏各二人，出刚风骑置驿马上章吏各二人，出擎持素案对立，臣前咸受，臣口中辞语，分别听臣所启，速达上闻，谨按。 泰玄都正一平炁系天师阳平治臣某再拜，臣仰希元景至尊慈父圣母垂恩照察，分别真伪，以语众心，某州县乡里恶人恣行顽伪，非但一二，臣窃闻太上主者后胤之子，屡见中伤，加克骂詈不敬，打拍枉谤无辜不可记数，天道幽远，未敢上闻，如此之人，合应擒鞫，谨请 太上三天曹特为告下三官，收录某家九祖七世父母已来，送付北狱地牢之中，侧暗之所，量由放纵某人，轻慢天道，敕恶人所居土地真官里社等庙神祇敕，某人三魂七魄，依不敬师道之律，如时考问，谨请魁纲将军三千六百人，随臣口启，到诣某家，收翦某人三魂七魄付天狱，以铁杖打杀之，又请清微天禹余天大赤天考吏各千二百人，一合下指某人身中，考劾所轻慢道法，臣主者之子呼引名字，罪在不轻，经法不许，宜加推鞫。 又请天地水三官考劾某人酷怨天道，轻师慢法，不遵道教，而恣意纵心，骂詈咒诅或打拍，承官势监逼於神主者之身，依三官律论，愿所启请天中将吏，一时加心用意，而今克验，有效之日，言功举迁，不负效信，恩惟 太上分别求哀，操臣所启，擒鞫收翦恶人，纵心骂詈，臣羞耻上章，上诣太上三天曹伏须告报，臣某诚惶诚恐，稽首再拜以闻。 臣姓 太清玄元无上三天无极大道太上老君，太上丈人天帝君，九老仙都君，九炁丈人百千万重道炁千二百官君太清玉陛下。 太岁 回化章",
      "translated_text": "Hark! I possess the power to seize ghosts and subdue demons. I declare: the ghost that harms and afflicts so-and-so—tear out your belly, extract your liver! My master returns the illness to so-and-so, subduing the cold. Swiftly, swiftly, as decreed by law and command—do not look back! Strike the teeth and depart, O officials.\n\nI reverently dispatch from within my body the Two Officers of the Supreme Immortals and Supreme Spirits, the Direct Envoys of the Orthodox Unity and Merit Officers, two each; the Envoys of the Central Department, two each; the Envoys of the Five Thearchs, two each; the Seasonal Merit Officers, two each; the Seasonal Envoys, two each; the Yin-Yang Spirit Officials of the Granary, two each; the Scarlet Talisman Officers of the Chariot of Punishments, two each; the Couriers of the Rushing Wind and Relay Horses bearing memorials, two each. They stand before me, holding white tablets, all receiving my words. Let the words from my mouth be distinctly heard and swiftly conveyed on high. Reverently executed.\n\nThe servant [Name], of the Orthodox Unity and Balanced Qi of the Great Mysterious Capital, of the Yangping Abbey, bows twice. I humbly look up to the Most August Father and Holy Mother of the Primordial Radiance, beseeching your grace to examine and discern truth from falsehood, that the hearts of all may be instructed. In such-and-such a prefecture, county, township, and village, wicked men give free rein to their stubborn deceit—not merely one or two. I have privately learned that the descendant of the Master of the Most High has repeatedly suffered harm, enduring added abuse, insults, and disrespect, with countless unjust beatings, slanders, and false accusations. Though the Dao of Heaven is profound and distant, I dare not keep this hidden. Such persons deserve to be seized and interrogated. I reverently petition the Three Heavenly Bureaus of the Most High to issue a special decree to the Three Officials, to apprehend and record the nine generations of ancestors and seven generations of parents of so-and-so’s family, and consign them to the Northern Prison and Earthly Dungeon, to the darkest recesses. In proportion to their indulgence and the contempt shown for the Dao of Heaven, I command the local earth gods, the true officials of the neighborhood altars, and the deities of the community temples to seize the three hun and seven po of so-and-so, in accordance with the statutes on disrespect for the master and the Dao, and to examine and question them without delay. I reverently summon the Generals of the Celestial Net, three thousand six hundred in number, to follow the words of my petition, proceed to so-and-so’s home, and seize and sever his three hun and seven po, delivering them to the Celestial Prison to be beaten to death with iron rods. I further summon the twelve hundred Examiners each from the Heaven of Pure Tenuity, the Heaven of Great Surplus, and the Heaven of Great Red, to descend as one and point into so-and-so’s body, interrogating and punishing him for his contempt of the Dao and its laws. The descendant of the Master—his name is invoked—bears no light guilt; the scriptures and laws do not permit it. He ought to be thoroughly investigated and punished.\n\nI further petition the Three Officials of Heaven, Earth, and Water to interrogate and punish so-and-so for his cruel enmity toward the Dao of Heaven, his disdain for the master, his contempt for the law, his failure to follow the teachings of the Dao, and his reckless indulgence of his own will—cursing, abusing, or beating and striking, or using official power to oppress and coerce the person of the Master’s descendant. In accordance with the statutes of the Three Officials, I pray that the celestial generals and officers apply their minds and intent to this matter, that the efficacy may be swiftly verified. On the day results are achieved, merits shall be reported and promotions sought, without betraying the trust in this petition. I humbly beseech the Most High to discern and heed my plea. I, your servant, present this memorial to seize, interrogate, and sever the wicked man who has given free rein to his heart in cursing and abuse. Ashamed and mortified, I submit this memorial to the Three Heavenly Bureaus of the Most High, awaiting your decree. I, your servant, bow my head twice in awe and trepidation, prostrating myself to make this known.\n\nYour servant [Name],\nBefore the Jade Throne of the Great Clarity, the Celestial Elder of the Boundless Dao of the Three Heavens, the Heavenly Thearch, the Nine Elder Perfected Lords of the Grotto-Heaven, the Venerable Lords of the Nine Qi, the myriad layers of the Dao and qi, and the One Thousand Two Hundred Official Lords.\n\nIn the Year of [Tai Sui],\n\nMemorial of Transformation and Return.",
      "overlap_context": " servant [Name],\nBefore the Jade Throne of the Great Clarity, the Celestial Elder of the Boundless Dao of the Three Heavens, the Heavenly Thearch, the Nine Elder Perfected Lords of the Grotto-Heaven, the Venerable Lords of the Nine Qi, the myriad layers of the Dao and qi, and the One Thousand Two Hundred Official Lords.\n\nIn the Year of [Tai Sui],\n\nAnother method: Upon leaving the patient’s home, step over the threshold while imprinting the seal of the Prison Overseer, and recite the incantation:",
      "start_char": 4045,
      "end_char": 4769,
      "start_sentence": 47,
      "end_sentence": 56,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.74213933944702,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\正一出官章仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "泰玄都正一平炁系天师阳平治左平炁 臣稽首再拜 上言，谨按文书某州县乡里男弟子某年若干岁，即日口辞，素以胎生肉人，百官子孙，千载有幸，得奉 大道，但由肉人顽愚，不揆轻微，敢有列诉天曹，今有家生奴某名年若干岁忽去，某月日内该某生资衣被杂物逃叛，东西南北藏隐匿避曹主，悔背生养，但某忽於某月日重捉得其奴，将归住宅击缚，不使逃走背主，到某夜某时拽断缚绳，恶心不止，重更逃走，背叛曹主，前后经于若干度，累年逃叛，事非一回，偷该资财妬害，恶心尤甚，但某日倾家男女良贱大小伺候擒捉不获，东西南北搜逐近远山野，并不知所在住止，隐匿踪迹背叛，不与曹主知见，但某即日僭多福少，宅人耗漏，奴财散走，不附某身背叛，唯主一心，上凭 大道保护某身，今赍白素若干尺，米若干斗升，良贱等物，诣某观三宝御前，诣臣求乞回化厌伏，此奴某自迷自惑，心中烦闷，欲叛不得，使令回归本宅，自颠自狂，叫唤出道路之中与某相见，不得束西叛避，急令自归自回，立待恩效，络绎言功，不负信誓，臣小子职任所司，岂不腾表，谨请五帝秦互大兵五道横道诸大将军兵众典狱健儿，乞为严加收捕，回化奴某，勿使背叛逃走，离避宅舍曹主，奴取三魂七魄付里社，令及敕某家先亡人灶神守宅三将军二十四吏兵等，同与捕捉擒获奴某，勿令背叛，忽回就主，直符点鬼功曹悬尸社灶之门，一日三考，要令回化叛心惑意，急归宅舍，不得束西逃走，牢加捕逐，事蒙恩效之日，依法言功报劳，臣某顿首死罪奏闻。 谨状。 谨请都星将军使者二十四人为某回化厌叛，回归宅舍，不得东西南北近远四野藏叛，急加收捉，即今自出与主相见，事立效之日，络驿一回报效信恩，急急如律令。 火火火火火火火火火火火　太上火车使者十二人主 火火火火火火火火火火火　为某迥化叛奴某魂魄 火火火火火火火火火火火　县付社门急急如律令 水水水水水水水水水水水　太上水车使者十二人主为某 水水水水水水水水水水水　迥化叛奴某不得束西背叛 水水水水水水水水水水水　急迥其如前约急急如律令 金金金金金金金金金金金　太上金车使者十二人主 金金金金金金金金金金金　为某回化奴某背叛悉令自 金金金金金金金金金金金　归不得束西急急如律令 木木木木木木木木木木木　太上木车使者十二人主为 木木木木木木木木木木木　某回化奴某勿使背叛，令急 木木木木木木木木木木木　自迥归如前约，急急如律令。 土土土土土土土土土土土　太上土车使者十二人主为 土土土土土土土土土土土　某迥化奴某勿使背叛，今急 土土土土土土土土土土土　回归家，急急如律令。 铁铁铁铁铁铁铁铁铁铁铁　太上铁车使者十二人主 铁铁铁铁铁铁铁铁铁铁铁　为某收迥叛奴某，不得逃 铁铁铁铁铁铁铁铁铁铁铁　走，一如前约，急急如律令。 刀刀刀刀刀刀刀刀刀刀刀　太上刀车使者十二人主 刀刀刀刀刀刀刀刀刀刀刀　为收奴某背叛，不得走去， 刀刀刀刀刀刀刀刀刀刀刀　急回如约，急急如律令。 弓弓弓弓弓弓弓弓弓弓弓　太上弓车使者十二人主 弓弓弓弓弓弓弓弓弓弓弓　为某迥厌奴某逃叛，急迥 弓弓弓弓弓弓弓弓弓弓弓　化归来，具如前约，急急如律令。",
      "translated_text": "To the Orthodox Unity of the Great Mystery Capital, the Left Rectifying Qi of the Celestial Master’s Yangping Administration:\n\nYour servant bows his head twice and respectfully addresses this memorial. In accordance with the documents, the male disciple of [State], [County], [Township], and [Village], aged [X] years, now presents this oral petition. Born of flesh as a mortal, descendant of the hundred officials, I have been blessed across a thousand generations to serve the Great Dao. Yet, being but a dull and foolish mortal, unworthy and insignificant, I dare to submit this plea to the Heavenly Bureaus.\n\nRecently, my household slave, named [Name], aged [X] years, suddenly absconded. On the [X] day of the [X] month, he stole my property—clothing, bedding, and miscellaneous goods—and fled, hiding in the east, west, south, or north to evade his master. He repays my nurture with betrayal. On the [X] day of the [X] month, I recaptured this slave and brought him back to my residence, binding him to prevent further escape. Yet, at [X] hour on [X] night, he broke his bonds, his wicked heart unrelenting, and fled once more, rebelling against his master. This has occurred repeatedly over the years, his escapes and betrayals too numerous to count. He steals my resources, harbors malice, and his evil intent grows ever more severe.\n\nDay after day, my entire household—men and women, bond and free, young and old—has searched for him in vain. We have scoured the nearby and distant mountains and wilds in all directions, yet his whereabouts remain unknown. He hides his tracks, evades his master, and refuses to be seen. Now, my fortune wanes while misfortune grows; my household suffers loss, and the slave’s stolen wealth scatters, no longer mine. With wholehearted devotion, I rely upon the Great Dao to protect me.\n\nToday, I present [X] feet of white silk, [X] measures of rice, and offerings from bond and free, bringing them before the Three Treasures in [Name] Abbey. I beseech you to perform the Rite of Transformation and Subjugation, that this slave, [Name], may be confounded and bewildered, his heart filled with turmoil, unable to flee. Let him return to my home, raving and mad, crying out in the streets until he is seen by me. Let him no longer evade or flee, but be compelled to return at once. I await the swift manifestation of your grace, that your merit may be proclaimed and your oath fulfilled.\n\nAs a humble servant charged with this duty, how could I fail to submit this memorial? I respectfully invoke the mighty soldiers of the Five Emperors, the Qin-Hu Generals, the Five Roads, the Crossroads, and all the prison wardens and stalwart warriors. I implore you to strictly capture and transform this slave, [Name], preventing his further escape or evasion from his master’s household. Seize his three *hun* and seven *po* and deliver them to the local earth god, commanding the spirits of my household’s deceased ancestors, the Stove God, the Three Generals guarding my home, and the twenty-four divine officers to join in capturing this slave. Let him no longer rebel, but return to his master at once.\n\nLet the talismanic writ be posted at the gates of the local earth god, the Stove God, and the suspended corpse, to be examined thrice daily. Compel him to transform his rebellious heart and confused mind, forcing him to return to my home without further escape. Pursue him relentlessly. When this matter is graciously resolved, I shall duly report your merit and reward your labor in accordance with the law.\n\nYour servant, [Name], prostrates himself and submits this memorial at the risk of death.\n\nRespectfully submitted.\n\nI humbly invoke the Twenty-Four Stellar Generals to transform and subdue this rebel, compelling him to return to my home. Let him not hide in the east, west, south, or north, nor in the nearby or distant wilds. Seize him swiftly, that he may appear before his master at once. When this matter is resolved, I shall promptly report your efficacy and repay your grace.\n\nHasten! As the statute commands!\n\n☲☲☲☲☲☲☲☲☲☲☲☲\nThe Twelve Fire Chariot Envoys of the Most High, acting for me, transform the *hun* and *po* of the rebellious slave [Name].\n☲☲☲☲☲☲☲☲☲☲☲☲\nLet him not flee east or west. Hasten as previously commanded!\n\n☵☵☵☵☵☵☵☵☵☵☵☵\nThe Twelve Water Chariot Envoys of the Most High, acting for me, transform the rebellious slave [Name].\n☵☵☵☵☵☵☵☵☵☵☵☵\nLet him not flee east or west. Hasten to return him as previously agreed!\n\n☰☰☰☰☰☰☰☰☰☰☰☰\nThe Twelve Metal Chariot Envoys of the Most High, acting for me, transform the rebellious slave [Name].\n☰☰☰☰☰☰☰☰☰☰☰☰\nLet him return at once, unable to flee east or west. Hasten as the statute commands!\n\n☴☴☴☴☴☴☴☴☴☴☴☴\nThe Twelve Wood Chariot Envoys of the Most High, acting for me, transform the rebellious slave [Name].\n☴☴☴☴☴☴☴☴☴☴☴☴\nLet him not rebel, but return swiftly as previously agreed!\n\n☷☷☷☷☷☷☷☷☷☷☷☷\nThe Twelve Earth Chariot Envoys of the Most High, acting for me, transform the rebellious slave [Name].\n☷☷☷☷☷☷☷☷☷☷☷☷\nLet him not rebel, but return home at once!\n\n⚐⚐⚐⚐⚐⚐⚐⚐⚐⚐⚐⚐\nThe Twelve Iron Chariot Envoys of the Most High, acting for me, seize and transform the rebellious slave [Name].\n⚐⚐⚐⚐⚐⚐⚐⚐⚐⚐⚐⚐\nLet him not escape, but return as previously agreed!\n\n⚔⚔⚔⚔⚔⚔⚔⚔⚔⚔⚔⚔\nThe Twelve Blade Chariot Envoys of the Most High, seize the rebellious slave [Name].\n⚔⚔⚔⚔⚔⚔⚔⚔⚔⚔⚔⚔\nLet him not flee, but return swiftly as agreed!\n\n⏃⏃⏃⏃⏃⏃⏃⏃⏃⏃⏃⏃\nThe Twelve Bow Chariot Envoys of the Most High, acting for me, subdue the rebellious slave [Name].\n⏃⏃⏃⏃⏃⏃⏃⏃⏃⏃⏃⏃\nLet him be transformed and return at once, as previously agreed!",
      "overlap_context": " decree. I, your servant, bow my head twice in awe and trepidation, prostrating myself to make this known.\n\nYour servant [Name],\nBefore the Jade Throne of the Great Clarity, the Celestial Elder of the Boundless Dao of the Three Heavens, the Heavenly Thearch, the Nine Elder Perfected Lords of the Grotto-Heaven, the Venerable Lords of the Nine Qi, the myriad layers of the Dao and qi, and the One Thousand Two Hundred Official Lords.\n\nIn the Year of [Tai Sui],\n\nMemorial of Transformation and Return.",
      "start_char": 4769,
      "end_char": 6079,
      "start_sentence": 57,
      "end_sentence": 87,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.157291412353516,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\正一出官章仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "弩弩弩弩弩弩弩弩弩弩弩　太上弩车使者十二人为 弩弩弩弩弩弩弩弩弩弩弩　收奴某背叛不得走去，急 弩弩弩弩弩弩弩弩弩弩弩　回如约，急急如律令。 日日日日日日日日日日日　太上日车使者十二人主 日日日日日日日日日日日　为臣厌奴某逃叛，急回归 日日日日日日日日日日日　宅含约，急急如律令。 月月月月月月月月月月月　太上月车使者十二人主 月月月月月月月月月月月　为某回厌叛奴某，背走 月月月月月月月月月月月　急迥，急急如律令。 巾巾巾巾巾巾巾巾巾巾巾　太上巾车使者十二人主 巾巾巾巾巾巾巾巾巾巾巾　收奴某背叛，回心自归，不东 巾巾巾巾巾巾巾巾巾巾巾　西一心如前约，急急如律令。 符到天曹收取奴某三魂七魄，付城隍太守大庙执捉，急令回化厌迷，勿得背叛逃走，背避曹主，如更有东西南北近远藏匿，欲去者重收魂魄，付县令功曹主簿，直符点鬼，悬尸社门，日夜三考，急令迷道，不得远去，回归宅舍，就主收养，如更远走背叛者，令其颠狂悬心霍乱气痢，不能起动，效验之日，络驿言功报劳，不负效信，急急如律令。 某州县乡里男人弟子某年岁，请为回化家生奴某，使急回归家舍就主，不得背叛束西，一如前约，急急如律令。 谨 上言如前一心委命，上凭",
      "translated_text": "⏚⏚⏚⏚⏚⏚⏚⏚⏚⏚⏚⏚\nThe Twelve Crossbow Chariot Envoys of the Most High, acting for me, seize the rebellious slave [Name].\n⏚⏚⏚⏚⏚⏚⏚⏚⏚⏚⏚⏚\nLet him not flee, but return swiftly as previously agreed!\n\n☼☼☼☼☼☼☼☼☼☼☼☼\nThe Twelve Sun Chariot Envoys of the Most High, acting for me, subdue the rebellious slave [Name].\n☼☼☼☼☼☼☼☼☼☼☼☼\nLet him be transformed and return home at once, as previously agreed!\n\n☽☽☽☽☽☽☽☽☽☽☽☽\nThe Twelve Moon Chariot Envoys of the Most High, acting for me, turn back the rebellious slave [Name].\n☽☽☽☽☽☽☽☽☽☽☽☽\nLet him not flee, but return swiftly!\n\n☾☾☾☾☾☾☾☾☾☾☾☾\nThe Twelve Kerchief Chariot Envoys of the Most High, acting for me, seize the rebellious slave [Name].\n☾☾☾☾☾☾☾☾☾☾☾☾\nLet him turn his heart and return of his own accord, unwavering in any direction, as previously agreed!\n\nUpon this talisman’s arrival, let the Celestial Bureau seize the three *hun* and seven *po* souls of the slave [Name] and deliver them to the City God’s Grand Temple for arrest. Let him be swiftly transformed and awakened from delusion, that he may not rebel or flee, nor evade his master. Should he attempt to hide in any direction—near or far—let his *hun* and *po* be seized again and delivered to the County Magistrate, the Merit Officer, and the Registrar. Let a direct talisman summon the ghosts to hang his corpse at the community gate, where he shall be examined thrice daily and nightly, swiftly compelled to abandon his delusion, and prevented from fleeing afar. Let him return to his dwelling and submit to his master’s care. Should he rebel and flee again, let him be struck with madness, heart-suspension, cholera, and qi-dysentery, unable to rise. On the day of verification, let swift messengers report the merit and reward the labor, that trust may not be betrayed.\n\nFrom [Name], a male disciple of [State], [County], [Village], [Age] years, this petition is made to transform the household slave [Name], that he may swiftly return home and submit to his master, without rebellion or deviation, as previously agreed.\n\nRespectfully submitted as above, with wholehearted devotion.",
      "overlap_context": "s of the Most High, acting for me, seize and transform the rebellious slave [Name].\n⚐⚐⚐⚐⚐⚐⚐⚐⚐⚐⚐⚐\nLet him not escape, but return as previously agreed!\n\n⚔⚔⚔⚔⚔⚔⚔⚔⚔⚔⚔⚔\nThe Twelve Blade Chariot Envoys of the Most High, seize the rebellious slave [Name].\n⚔⚔⚔⚔⚔⚔⚔⚔⚔⚔⚔⚔\nLet him not flee, but return swiftly as agreed!\n\n⏃⏃⏃⏃⏃⏃⏃⏃⏃⏃⏃⏃\nThe Twelve Bow Chariot Envoys of the Most High, acting for me, subdue the rebellious slave [Name].\n⏃⏃⏃⏃⏃⏃⏃⏃⏃⏃⏃⏃\nLet him be transformed and return at once, as previously agreed!",
      "start_char": 6080,
      "end_char": 6609,
      "start_sentence": 88,
      "end_sentence": 103,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.064128398895264,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\正一出官章仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "大道，诣臣乞回化奴某，一一如前，即日谨赍命信巾素，米一石二斗，白纸百张，笔一管，墨一丸等物，以立心信告诉，向臣求乞回化厌伏奴某，背某乙逃叛，即日寻访，不知所在，急使迷道，所欲不得，严加擒捉，令自回归就某乙，臣小子顽愚，立功不充补过，臣某诚惶诚恐顿首，死罪伏地，拜上丹赤表大章一通，上闻天曹，请天官吏兵太上诸君丈人，天师君夫人门下，典者五炁君，伏愿垂慈省察，所陈事告下都星君都炁君兵士百万，众生为回化收捕逃奴某，急令回惑自归就主，不得远去，失道迷途，如辄远叛归宅，悔背曹主，恶心不改者，上请罗网君百万人断截围绕道路，缚录杻劾，勿使东西，令自归就主。 又请社庙城隍张元范，即悬尸付社门，一如前状，谨上请东方青帝君一人兵士九九八十一万人，上请南方赤帝君一人兵士八八六十四万人，上请西方白帝君一人兵士六六三十六万人，上请北方黑帝君一人兵士五五二十五万人，上请中央黄帝君一人兵士万二千人，一合来下，同心并力，下为某回化家生奴某背主逃叛，恶心不止，令使迷途失路，欲去不得，急来就主收捉，不得遗失，一如前约，令得为限，如愿恩效，平安得奴之日，言功报劳，迁赏天兵典狱健儿不负效信，恩惟 太上门下，典者分别求哀，臣愚谨因二官直使，正一功曹左右官使者，阴肠神决吏，科车赤符吏，刚风骑置驿马上章吏官，各二人出操，臣谨为某上请天官为回化家生奴某背主逃走不归，乞为厌回就主，不得遗失，东西南北远去，迷途失道，令自出归家宅，诣臣拜上丹章赤表连狱一通，臣某庸微，不敢抑绝顿首死罪，上请天官乞垂省察，上诣 三天曹伏须告报，臣某诚惶诚恐，稽首再拜以闻。 臣姓 太清玄元无上三天无极大道太上老君，太上丈人天帝君，九老仙都君，九炁丈人百千万重道炁千二百官君太清玉陛下。 太岁 正一出官章仪竟",
      "translated_text": "To the Great Dao, this humble servant petitions for the return and transformation of the slave [Name], all as previously stated. On this day, I reverently present a token of sincerity: a silk kerchief, one *shi* and two *dou* of rice, one hundred sheets of white paper, a brush, and an inkstick, to establish my earnest plea. I beseech you to compel the return and subjugation of the slave [Name], who has fled from his master [Name B], and whose whereabouts remain unknown. Let him be swiftly led astray, his desires thwarted, and let him be sternly seized and made to return to [Name B].\n\nThis humble servant, dull and unworthy, has failed to atone for his faults through merit. I, [Name], prostrate in awe and dread, kowtow and submit this vermilion petition, a solemn memorial, to the Celestial Bureaus. I implore the Heavenly Officials, the Generals, the Most High Lords and Venerable Ones, the Lady of the Heavenly Master’s Gate, and the Lords of the Five Qi: may you deign to examine my plea with compassion. Let the matter be conveyed to the Lords of the Constellations and the Lords of the Hosts of Qi, and to the millions of soldiers and all beings, that they may capture and return the fugitive slave [Name]. Let him be swiftly disabused of his delusion and made to return to his master, prevented from fleeing afar or losing his way. Should he persist in rebellion, return home, or betray his master with unrepentant malice, I invoke the Lord of the Net of Heaven with his million soldiers to block and encircle all roads, bind and restrain him, and allow no escape, that he may be compelled to return to his master.\n\nI further invoke the City God Zhang Yuanfan of the local shrine to hang his corpse at the community gate, as previously described.\n\nI reverently summon:\n- The Azure Emperor of the East, with his 810,000 soldiers;\n- The Vermilion Emperor of the South, with his 640,000 soldiers;\n- The White Emperor of the West, with his 360,000 soldiers;\n- The Black Emperor of the North, with his 250,000 soldiers;\n- The Yellow Emperor of the Center, with his 12,000 soldiers.\n\nLet them unite in purpose and strength to compel the return of the household slave [Name], who has fled his master with unrelenting malice. Let him lose his way, be unable to flee, and be swiftly seized and returned to his master, without loss or escape, as previously agreed. Upon the fulfillment of this vow and the safe return of the slave, let merit be reported and labor rewarded, and let the celestial soldiers and prison wardens be duly honored, that trust may not be betrayed.\n\nRelying upon the Two Officials, the Direct Envoys, the Merit Officers of the Orthodox Unity, the Left and Right Attendants, the Spirits of the Dark Intestines, the Judgment Chariot Officers of the Vermilion Talismans, and the Courier Officials of the Rushing Winds—each dispatched in pairs—I humbly petition the Heavenly Officials on behalf of [Name] for the return of the household slave [Name], who has fled his master. Let him not be lost or allowed to wander east, west, south, or north, but let him lose his way and emerge of his own accord to return home. I submit this vermilion petition and linked memorial to you, my lord.\n\nThis humble servant, [Name], unworthy and insignificant, dares not refuse or delay. I kowtow in dread and prostrate myself in submission, beseeching the Heavenly Officials to deign to examine my plea. Let it ascend to the Three Celestial Bureaus, and may I await your decree.\n\nI, your servant [Surname], invoke the Most High Lord Lao, the Supreme Venerable of the Three Heavens and the Boundless Great Dao; the Heavenly Emperor and Venerable Lord; the Nine Elders of the Immortal Capital; the Venerable Lords of the Nine Qi and the myriad hosts of the Dao; the Twelve Hundred Officials of the Great Clarity; and the Jade Court of the Great Clarity.\n\nThe ritual of the Orthodox Unity’s petition is now complete for the year [Year].",
      "overlap_context": "dness, heart-suspension, cholera, and qi-dysentery, unable to rise. On the day of verification, let swift messengers report the merit and reward the labor, that trust may not be betrayed.\n\nFrom [Name], a male disciple of [State], [County], [Village], [Age] years, this petition is made to transform the household slave [Name], that he may swiftly return home and submit to his master, without rebellion or deviation, as previously agreed.\n\nRespectfully submitted as above, with wholehearted devotion.",
      "start_char": 6609,
      "end_char": 7349,
      "start_sentence": 104,
      "end_sentence": 111,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.149227142333984,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\正一出官章仪.txt",
        "category": "威仪类"
      }
    }
  ]
}