{
  "source_id": "武当纪胜集",
  "source_file": "chunked_daozang\\武当纪胜集.json",
  "total_chunks": 7,
  "total_original_chars": 8141,
  "total_translated_chars": 46030,
  "total_translation_time": 262.9519393444061,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\记传类\\武当纪胜集.txt",
    "category": "记传类"
  },
  "full_translation": "**Wudang Record of Marvels**\n\n**Title:** *Wudang Record of Marvels*\n*Composed by Luo Tingzhen of the Yuan Dynasty. One fascicle.*\n*Source text: \"Daoist Canon of the Zhengtong Era,\" Dongshen Section, Records and Biographies Category.*\n\n**Wudang Record of Marvels**\n*By Luo Tingzhen, the Cloudy Peak Woodcutter of Longxing Prefecture*\n\n**First Stanza of the Woodcutter’s Song**\nGathering firewood, I journey afar to Mount Taihe,\nWhere mountains dwell as immortal grotto-palaces.\nWind and dew of the nine heavens brush the cinnabar gates,\nHeaven and earth endure through ages—white clouds ask.\nMoonlit crags dissolve the heart’s cares,\nSteps tread the celestial heart in comings and goings.\nA land of joy, vaster than the heavens,\nUnknowing of the dusty world beyond.\n\n**Second Stanza**\nGrotto-heavens and blessed lands fill the mortal realm,\nThe Northern Emperor’s abode receives homage from the north.\nResplendent Wudang links with Mount Gen,\nIts towering summit presses upon the earth’s expanse.\nBoundless sacred transformation—golden palaces,\nThe supreme divine realm mirrors Jade Clarity.\nAuspicious gatherings of wind and cloud align with sun and moon,\nIncense ranks in homage arrayed like rosy clouds.\n\n**Jieshan**\nWhere celestial beings tread, steps diverge,\nAt Junyang’s border, one enters the clouded thoroughfare.\nLightly drifting, imbued with the qi of immortals,\nLeaping in the eastern wind, chanting the *Dance of Yu*.\n\n**Lang River**\nTrickling drops swell into an ocean’s vastness,\nAfter rain, ten thousand ravines surge with whale waves.\nThe staff of blossoms steadies the journey like Shangchuan’s cane,\nBlessed by clear skies, one crosses perilous slopes.\n\n**Mei Creek**\nRen and Gui store essence, nurturing sages and spirits,\nYang within Kan reveals the sprouting of benevolence.\nBenevolence’s roots warm the southern branches,\nThe Emperor’s work brings spring to all under heaven.\n\n**Guanzhuang**\nFeasting on celestial blossoms, immortals of the heavens,\nThey store the sky’s chill, enriching the celestial fields.\nBeyond mountain fire-jujubes and exchanged pears,\nGranaries of decay and hardship extend longevity.\n\n**Chengzili**\nGreen piled upon red, brocade encircles all,\nA natural painting—this mountain stream.\nA single altar’s circuit opens the path,\nBefore pine and bamboo crags, peach and apricot trails.\n\n**Haokou**\nOne side mugwort, the other orchid,\nAt the gate of profit and desire stands the gate of Dao and righteousness.\nMortals and sages diverge—where to turn one’s steps?\nWhere five-colored clouds gather lies Penglai Mountain.\n\n**The World’s Wudang**\nThe foremost pass to transcendence and the sacred,\nJunyang’s blessed land excels all in the mortal realm.\nWhere heaven’s canopy meets the pole star,\nFor ten thousand ages, heaven and earth share this mountain.\n\n**Jiedai Hermitage**\nFrom distant seas, incense is raised in offering,\nWho can fast and embrace flying immortals?\nAt the post station, one feasts on azure essence-rice,\nExerting strength to ascend the mountain—reaching the nine heavens.\n\n**Land of Maoshan’s Earth God**\nOffering wine from Gongyan, fragrant and rich,\nExternally guarding the sacred mountain, fulfilling duties with diligence.\nIf merit is achieved, it shall be rewarded,\nAlso enfeoffed with land, granted as a meritorious minister.\n\n**Mountain Spirit Hall**\nNo need for pigments—its numen manifests,\nThe temple’s vigor draws from the earth’s essence.\nWhen the heart of Dao merges with the human heart,\nEven silent thunder strikes with awe.\n\n**Outer Audience Peak**\nGrass and trees, imbued with spirit, sense the sage’s grace,\nEvery mountain follows the multitude to pay homage at the golden gate.\nFrom distant peaks, one turns to summon immortal companions,\nJoining the ranks to behold the Supreme.\n\n**Black Tiger Shrine**\nA leopard’s transformation begins, patterns yet unformed,\nIts refinement concealed, it already surpasses the crowd.\nThe Dark Heaven’s discipline patrols the corridors complete,\nClaws and talons hidden deep in iron-hued clouds.\n\n**House of the Kalpa**\nFrom the era of Ao’s rise to the present,\nHow deep have the years stretched in this household?\nFrom the age of Fuxi and Nong onward, people endure,\nChild and grandchild—hearts of primordial antiquity.\n\n**Sword Mound**\nWho emerges from the peaks, a lone cloud?\nFlowers and moon bewitch halfway along the path.\nA thunder-axe concealed in yellow earth’s wine,\nEvil spirits stripped of souls die in Dengdu.\n\n**Grindstone Gorge**\nThrough tempering, the coarse becomes refined,\nThe sagely master summons one to the celestial capital.\nMy heart is not stone—firmer than stone,\nWhen the small vessel is complete, the great Dao is achieved.\n\n**Yang River**\nThe land does not belong to Su Wu’s exile,\nNor is the water first named from paper and milk.\nIts source is the vein of a sacred spring,\nFlowing clear even at the sea’s gate.\n\n**Sword-Grinding Gorge**\nThe imperial perfected one is truly the guardian of Dark Heaven,\nForging metal through the kalpa in cold purple mist.\nThree feet unfurled, spanning seas and mountains,\nPurifying the cosmos—a single dragon spring.\n\n**Hidden Immortal Crag**\nCrucible and cauldron refine through countless days and months,\nAmid the mountains, embroidered robes yield to a green straw cloak.\nEven white clouds know not the immortal’s traces,\nNow in which heaven does the jade flute resound?\n\n**Mountain Gate**\nThe grotto-heaven’s deep eaves, ten thousand peaks green,\nThe Qian gate swings wide, never closing at night.\nStep by step, this pass is thoroughly fathomed,\nA single immortal’s path ascends the azure void.\n\n**Audience Peak**\nThe supreme sage descends, halting the morning chariot,\nDragons soar, phoenixes dance—ten thousand mountains coil.\nThe front peak’s ministers wear caps and robes,\nGazing toward the palace, they hail longevity and peace.\n\n**Sutra-Recitation Terrace**\nImmortal chants resound, moving ten thousand spirits,\nThe sacred altar’s words echo in the celestial court.\nOnce, the Dragon Lord’s seat listened to lectures,\nStill arrayed like pearls in the five stars’ order.\n\n**Pavilion of Gazing at Immortals**\nThe great summit is now the birthplace of the sage,\nThe ten continents and three isles lie in Junyang.\nAll perfected ones, in thought, return to the banner’s truth,\nMorning riding azure dragons, evening on rainbow phoenixes.\n\n**Gathering Immortals Slope**\nFourteen celestial sages of Penglai,\nGather on Mount Taihe to pay homage to the imperial perfected.\nBeyond subtle peril and the essence of oneness,\nLike the hearts of Yao, Shun, and Yu.\n\n**Gathering Immortals Bridge**\nIsland springs vast, spanning the starry river,\nUniversally aiding all heavens to pay homage to Great Harmony.\nHow many nights of fine wind and bright moon,\nJade phoenixes and ringing luan-bells resound?\n\n**Sun-Moon Pool**\nHeaven’s virtue shines radiant before the emperor,\nEarth without two luminaries is no earth, no heaven.\nThe mountain’s light and shadow—heaven becomes one,\nDay and night, thunder roars from twin grotto springs.\n\n**Five Dragons Palace**\nGolden palaces resplendent, pressing upon the Purple Tenuity,\nPure yang’s qi and destiny emit radiance.\nThree peaks manifest true prominence,\nEscorting the ascent, flying beside the sun.\n\n**Gathering Immortals Crag**\nNear the Five Dragons Palace, poised for audience,\nThe imperial house’s jade and silk—ten thousand lords.\nAtop the mountain, ranks stand in solemn order,\nResembling the twelve towers of the five cities.\n\n**Birthday Celebration and Homage**\nTen thousand sincere hearts for ten thousand sagely perfected,\nWhere is there a place incense is not offered in person?\nYear after year, spring months like a bustling market,\nFrom the sea’s edge to the sky’s end—people come.\n\n**Celestial Palace**\nA treasure mountain suspended, far from worldly clamor,\nHigh in the ninefold heavens, and ninefold again.\nPavilions and towers newly adorned with five-colored clouds,\nThe Three Clarities, three realms—all in carefree ease.\n\n**Ascent and Homage**\nWu Dang fills the cosmos like a vast expanse,\nAll who ascend witness the August Lord in person.\nThe Great Summit’s root stands first in height,\nClimbing high, they bow in thunderous reverence to Heaven’s Gate.\n\n**Hall of the Three Clarities**\nThe Celestial Court of the Supreme Lord is naturally so,\nJade skies and boundless darkness stretch without end.\nRadiance descends to the Three True Realms,\nA realm apart—where mortals ask of the heavens above heavens.\n\n**Hall of the Jade Emperor**\nDouble brightness, resplendent and upright, stands the solemn gate,\nGolden towers where gods and men share dual supremacy.\nLord of all directions, vassal of the six harmonies,\nManifest or hidden, he governs the cosmos alike.\n\n**Hall of the Dark Emperor**\nPalaces stern and solemn, the cavern-heaven stands,\nPeaks encircle the verdant ranks of immortals.\nMajestic the throne, aligned with the Pole Star,\nCountless spirits and men bow before the imperial presence.\n\n**Hall of Illuminated Perfection**\nFrom the Primordial Beginning, how many incarnations have come?\nTwice born of parents to shape the cosmos.\nWithin the celestial palace, familial rites unfold,\nThe divine parents of the upper realms—Emperor and Empress—revered.\n\n**Hall of Peng’s Perfection**\nThree Heavens, fourteen sages arrayed in ranks,\nMerits and virtues resplendent, the universe inquires.\nGolden towers manifest incarnations to open the imperial seat,\nA celebration of wind and clouds on Wu Dang Mountain.\n\n**Pavilion of the Seven Emperors**\nOne by one, they emerged from the primordial chaos,\nFrom Jade Clarity to Dark Heaven in succession.\nIn heaven, Yao and Shun, Tang, Wen, and Wu,\nAll authors like the sages of old.\n\n**Hall of the Osmanthus Register**\nOffices linked to the prime minister, overseeing Wen Chang,\nAccumulated deeds of the worthy shine with imperial favor.\nHere, one ascends into the lunar palace,\nHigh branches sway, stirring incense through the nine heavens.\n\n**Hall of the Primordial Emperor**\nThe Three Clarities’ aides govern the Mysterious Origin,\nBonded in golden orchid virtue, two sages.\nSevenfold emanations share in the unfolding transformation,\nEven the Heaven of Móyí is a Heaven of Great Harmony.\n\n**Hall of the Three Mao Perfected Lords**\nFrom Red City’s games, riding dragons they came,\nBrothers united, descending from the imperial terrace.\nTheir glory outshines the western ranks,\nMasters of the golden towers, leaning against the sky.\n\n**Pavilion of the Five Dragons**\nFlanking the sun, they welcome the imperial ascent,\nRewarded for merit, they know to soar.\nAdorned in resplendent hues of golden scales,\nThey rise to the highest tier of the Lingyan Pavilion.\n\n**Hall of Thunder**\nThe cavern-abyss, abode of the Thunder Marshal,\nHis thunderous roar subdues ten thousand demons.\nGathering his divine might into his grasp,\nMajestic yet not fierce, he commands solemn ranks.\n\n**Hall of Marshal Zhao of the Thunder Bureau**\nFormerly Deng Yue, king among ghosts,\nHe subdued the capital’s west, guarding ancient Xiang.\nWind and rain he brought under the Dark Emperor’s command,\nNow he oversees all as Heaven’s gatekeeper.\n\n**Hall of Marshal Meng of the Thunder Bureau**\nOnce his ambition lay in the Central Plains,\nCrushing Cai, vanquishing Jin for the Yuan.\nHeaven feared thunder’s wrath would lack oversight,\nSo the Three Heavens entrusted him with universal grace.\n\n**Well of the Five Dragons**\nIn the first year of Han’s rise, they gathered as stars,\nA gushing spring formed a pool around the shrine’s courtyard.\nOne by one, they soared into the heavens,\nThe earth’s veins fragrant and sweet, eternally sacred.\n\n**Shrine of the Five Hundred Divine Officials**\nCountless spirits and men revere Dark Heaven,\nFive hundred hold offices, each with their duties.\nIn two ranks, they pivot like the wind,\nLike Gao, Kui, Ji, and Qi—Yao’s worthy ministers.\n\n**Bell Tower**\nA pillar upholding the sky, beams like a rainbow,\nIts whale-like resonance vast and resonant.\nStruck in proper measure, it harmonizes all,\nGolden tones and jade vibrations resound through the nine heavens.\n\n**Cloud-Stepping Tower**\nNeither mist nor smoke at its loftiest height,\nNinefold rosy clouds envelop its joyous glow.\nThe first tier of the \"Morning to the Origin\" ascent,\nJade bamboo ranks arrayed in the azure heavens.\n\n**Office of Merit and Virtue**\nThe Heavenly Official of Recorded Goodness holds his post,\nLowly officers tend incense and fire as extraordinary merit.\nThose who fulfill the three thousand deeds,\nEach scroll inscribed in golden script on jade tablets.\n\n**Hall of Sea and Mountain**\nWithin the grotto-palace, another grotto-palace unfolds,\nAll under heaven becomes a single Penglai.\nMist drifts, rain hats, wind and clouds gather,\nNone but immortals may come here.\n\n**Position of the Director**\nA model of the upper realms, governing all immortals,\nA small replica of the balance, leading the multitude of worthies.\nSeated, the Venerable Lord presides over the Jade Bureau,\nOverseeing the world’s cavern-heavens.\n\n**Position of the Deputy Palace Master**\nTo protect and to teach, the Dao’s essence is one,\nSages and perfected alike rely on Heaven’s work.\nHeart to heart, they aid like the Duke of Zhou,\nThis is the sacred altar’s Shao Gong.\n\n**Hall of the Perfected Officials**\nAiding the upright, expelling evil, banning misfortune,\nTheir duties stern, they govern and guard the shrine.\nEnticing our pines and cassias to mock the clouded ravines,\nIn their sleeves, memorials to present beside the Emperor.\n\n**Refectory**\nFlavors sate the cloud kitchens, nurturing the qi’s origin,\nIncense ladles and dew bowls stir coiled dragons.\nWithin the cinnabar field, golden millet grains,\nEach a grain of the immortal’s elixir of agelessness.\n\n**Realm of Purple Clouds**\nIncarnations manifest to transform the mortal realm,\nOriginally celestial perfected ones from the heavens above.\nRecreating Wu Dang’s three grotto-palaces,\nLike Penglai and Yingzhou, arrayed among the sea’s three mountains.\n\n**Ancestral Hall**\nThe Dao’s lineage transmitted, generations radiant,\nMany immortal souls dwell in the land of white clouds.\nFilial piety drifts, incense curling,\nA single wisp of fragrance connects earth and heaven.\n\n**Shrine of the Pacification Commissioner**\nDescendant of Mount Tai’s later generations, a neighbor to old ministers,\nA man of the immortal mountains’ assemblies.\nWith an iron spine, master of merit and virtue,\nHis heart, aged in the Dao, abides among the lofty perfected.\n\n**Hall of the Venerable Elders**\nSated by Tang’s sun and moon, the old man of Fragrant Mountain,\nProud through Han’s cosmos, the immortal of Lingzhi Ridge.\nAuspicious gatherings of wind and cloud encircle the seats,\nCarefree through past and present, in the stillness of heaven.\n\n**Official Hall**\nBrilliant as the morning sun, phoenix banners alight,\nDirecting ranks in precise order, they offer birthday blessings.\nAt the northern gate of heaven’s opening,\nA thunderous \"Long live!\" resounds, robes and crowns solemn.\n\n**Hall of Pure Heart**\nSteady as a moored empty boat, a nest of peace,\nHow could mountain forests know of wind and waves?\nA pool of still water clarifies the heart,\nEmbracing cloudless vastness, the universe at ease.\n\n**Daoist Chant of Worldly Toil**\nWild horses and dust disturb the vulgar green,\nYet among the lowly, noble immortals remain.\nFragrant springs by the thousands, clouds by the mile,\nBy day they plow clouds, by night they draw from the spring.\n\n**Eternal Legacy of Perfection**\nClearing thorny brambles to open the sacred altar,\nWith empty hands, they built a house of gold.\nA thousand years of blazing incense,\nA heart of iron and stone, steadfast in revival.\n\n**Responding to Immortal Journeys**\nSeveral handfuls of celestial script, fragrant with rain and dew,\nWind and thunder held in the palm’s center.\nThe sword’s sheath shed, the immortal soul departs,\nStill dreaming of riding the simurgh into the imperial realm.\n\n**Hermitage of Soaring Emptiness**\nMelted warmth, serene and gentle,\nA cavern vast as Zhuangzi’s chamber of great emptiness.\nThe Mysterious Teaching and Confucianism span heaven and earth,\nBoundless wind and moon grace the courtyard’s grass.\n\n**Moon Hermitage**\nEight windows alike in jadelike clarity,\nRadiant light expands within this nature.\nBright as ten thousand mountains beneath an endless night,\nThe whole family dwells in the Osmanthus Palace.\n\n**White Snow Hermitage**\nA realm of eternal splendor, home to jade blossoms,\nWhere crane-feather robes gleam with six-petaled snowflakes.\nOn clear nights, fragrance fills the house anew,\nAs moonlit hoes till plum blossoms round its walls.\n\n**Cloud Mountain’s Reclusive Scholar**\nGreat merit of governance, vast as the cosmos,\nResiding in the luminous virtue of one’s nature.\nEmerging from the peaks with but a touch of use,\nSated with timely rains, awaiting the binding wind.\n\n**Lecturer’s Study**\nAgain the locks are drawn to enlighten the unlearned,\nStudying like Zhuangzi of the marshes or the Old Master by the river.\nHidden within the grotto realm, unseen by men,\nYet the heart’s treasury lies deeper still in the Six Classics.\n\n**Five Dragons Summit**\nA jeweled canopy casts into the sky, link by link,\nFloating towers and palaces stir the azure clouds.\nAmid mist and haze, their forms stand clear—\nA single shake of the starry peaks stirs Qian’s first line.\n\n**Heavenly Pool**\nThe summit’s height ascends ten thousand fathoms,\nSilver streams pour forth, blessing the deep source.\nEarly on, it serves the world’s teeming multitudes,\nWhen the sun burns like fire, it becomes the saving rain.\n\n**Upper Dragon Pool**\nThe first spring rises to touch the azure vault,\nWithin it, a divine being nurtures its majestic might.\nWhen the time comes, by imperial decree, it brings timely rains,\nFirst descending beyond the heavens to the Sea God’s palace.\n\n**Black Dragon Pond**\nIn the abyss, the hidden scales lie concealed,\nThe Kan palace’s pure waters nourish its divine power.\nGrace flows to fill the highest peaks,\nWhere the winds and clouds of the four seas converge.\n\n**Elixir-Refining Pool**\nThe primal ancestral qi has long gestated in chaos,\nFurnace and cauldron, yin and yang intertwined at the root.\nDrop by drop, golden nectar forges immortal transformation—\nHalf a pool’s spring holds the gate of heaven.\n\n**Golden Tripod Peak**\nIts form shaped like an ear-ringed tripod,\nMajestic as the Nine Provinces’ first casting.\nThe imperial house’s treasured vessel, passed through ages,\nPillar of earth and heaven, anchoring the eight directions.\n\n**Golden Lock Peak**\nDemons and fiends imprisoned in iron Dengdu,\nRefined further into unyielding essence to restrain rebels.\nMist and haze swirl, sealing the gates,\nTwo realms purified—no trace of evil remains.\n\n**Dragon Temple**\nA single body holds the workings of wind and thunder,\nReceiving the alchemy of furnace smoke and ethereal form.\nAwaiting the nine heavens’ decree to arrive,\nIt rolls back the mists of the eight wilds in a deluge of rain.\n\n**Six Jia Peak**\nHeaven’s crumpled folds gather a hundred million mighty spirits,\nServing the kalpas, divided in ranks before the imperial court.\nManifesting in the east, the yang wood position,\nGenerals in armor stand revealed in their true forms.\n\n**Six Ding Peak**\nFiery yin flames blaze with true essence,\nHexagrams arrayed in the clouds, gleaming in the sun.\nSummoned by a few decrees, the grasses and trees of Bagong Mountain,\nRoaring winds and thunder shake the heavens.\n\n**Stacked Characters Peak**\nCang Jie’s divine craft, the magic of creation,\nCloud-script and phoenix-seal carve out existence.\nLayer upon layer, like cliffside eulogies,\nInscribed in midair, bright as sun and moon.\n\n**Three Dukes’ Crag**\nA first-rank cloud crowns the lofty ridge,\nIts majestic aura befits the temple hall.\nOpening and closing like wind and thunder, divine transformations,\nGoverning the realm, discoursing on the Dao of yin and yang.\n\n**Nine Ministers’ Crag**\nThe dual forces of fortune sway between clear and stormy,\nSpacious cloud chambers, their doors adorned with azure.\nAll peaks, great and small, stand like bamboo shoots,\nAs if arrayed in court, facing the royal throne.\n\n**Central Pillar Peak**\nA model of the Huan jade tablet, standing in proper rank,\nMountains in rosy sashes encircle it in formation.\nClearly, one stands in the Hall of Facing the Origin,\nEmbracing heaven’s light, near the sacred countenance.\n\n**Great Brush Peak**\nPillar of heaven, prop of earth, Lord of Yan City,\nIts tip freed from its sheath amid five-colored clouds.\nA single sheet of azure sky for calligraphy,\nWhere stars, sun, and moon illuminate Qian’s script.\n\n**Central Brush Peak**\nThe second of the Zhongshan clan, bearing the Mao surname,\nIts descendants gather, all heroes.\nInscribing virtue in grand strokes with a silver brush,\nRaised high in the clouds, first in rank.\n\n**Reading Rock**\nThe Six Classics existed before their use,\nYet the Mysterious Teaching still enters through this gate.\nWithin lies the position of the Jade Void’s master,\nAssisting the Heavenly Emperor, honoring the king.\n\n**Thousand-Fathom Peak**\nFive times loftier than Zhuge Liang’s towering height,\nAncient pines and cypresses roar in the howling wind.\nPropping up the cosmos as the southwest’s canopy,\nA single pillar, towering, anchors the turtle’s peak.\n\n**Five Summits Mountain**\nCelestial pearls arrayed as stellar essences,\nIn the human realm, they form the court’s positions.\nEver true, manifesting the divine tortoise’s image,\nAmid the cosmos, they govern the qi’s form.\n\n**Small Brush Peak**\nWho wields the fine brush to pierce the azure clouds?\nThe royal house has no use for cursive scribes.\nThe immortal boat prepares to write memorials to heaven,\nInk tinged with floating fragrance, reaching the purple palace.\n\n**Lion Peak**\nAtop the crag, cliffs soar, commanding all gazes,\nKing of beasts in bearing, majestic and stern.\nWhen autumn winds stir the grasses and trees, golden hairs bristle,\nTen thousand monsters howl and cower in submission.\n\n**Central Nose Peak**\nSurveying all mountains, their faces fair,\nAt its heart, the great noble’s nose stands proud.\nTwo holes at the summit pierce the heavens,\nWafting incense before the jade steps.\n\n**Incense Burner Peak**\nAt the ridge’s crest, the sun warms, auspicious smoke rises,\nGolden beasts thickly perfume the years of longevity.\nThe Emperor’s creation knows no partiality, serving the four seas,\nBlessing the household, the nation, and all under heaven.\n\n**Bamboo Shoot Peak**\nSlender shoots push forth from the grassy tufts,\nTowering ridges, clustered low, dipped in dense mist.\nChang Fang chose them for immortal staffs,\nCast into Ge’s pond, they too became dragons.\n\n**Peach Brook’s Daoist Realm**\nThe fisherman now seeks the clouded pass,\nWhere the immortal’s spring lies coiled in mist.\nPeople ascend to the Jade Capital above,\nLeaving behind only the empty sheath of the sword’s inscription.\n\n**Peach Blossom Spring**\nHeavenly fragrance drifts like Wuling’s spring,\nThe mountain abounds with immortals—why blame Qin?\nIn this sagely age, descendants all enjoy long life,\nNo need for robes and caps to be those of Qin’s folk.\n\n**Purple Canopy Peak**\nMountain light flickers as evening mist congeals,\nCrowning the highest tier of palace eaves.\nThe imperial carriage lingers in the heavens, its regalia idle,\nSoaring above, one recalls its former flight.\n\n**Great Lotus Peak**\nA gentleman’s upright form, peerless,\nIts roots spread wide, entwining ten thousand peaks.\nWhen the flower blooms, ten yards wide like a boat’s oar,\nEven Mount Tai and Hua seem small by comparison.\n\n**Small Lotus Peak**\nTransplanted from the Jade Well, lotus descendants,\nNurtured by rain and dew to bring forth spring.\nOne day, it will be lent to the bodhi seat,\nTo adorn the Western Quarter’s sacred one.\n\n**Seeded Slope**\nThe earth yields its finest essence, the soil rich with fragrance,\nMountain spirits gather to form treasures among fruits.\nWhen autumn winds come, golden elixir ripens,\nAwaiting to join the peaches in blessing the Lord Emperor.\n\n**Falling Hat Peak**\nDiscarding the dusty cap to dwell among ridge clouds,\nA single change restores the old spirit.\n\n**Heavenly Wind Peak**\nThe heavenly wind sweeps away the black gauze cap—\nDonning court robes, he hastens to the purple court to pay homage.\n\n**Purple Mustard Cloud Peak**\nThe immortals’ dharma-rain rises from Penglai,\nSpreading inch by inch across the nine realms.\nAll mountains and rivers beneath heaven emerge from here,\nGathering in this moment of celestial celebration.\n\n**Three Dou Rock**\nThe cauldron’s stone clefts cradle towering crags—\nBeneath the moon, who shares a cup with me?\nCould this be the day Prince Ruyang drank to excess,\nLeaving his wine gourd behind on his way to court?\n\n**Hidden Cloud Rock**\nThough riding the dragon is fine, remain concealed,\nFive-colored light veiled within the embroidered valley.\nEven with intent, do not leave the mountain’s embrace—\nAwait the timely spring rains borne on the wind.\n\n**Great Bright Mountain**\nA sacred realm of pure yang, nurturing Qian’s essence,\nAuspicious radiance shines boundless in all directions.\nNeither dawn nor dusk—here, heaven and earth differ,\nFor it is ever the midday sun at the central street.\n\n**Twisted Tooth Peak**\nAbrupt as an ancient tree rooted in jagged heights,\nSpring’s arrival brings forth teeming life.\nHew a branch with the thunder spirit’s axe,\nAnd ascend with the immortals to the Milky Way.\n\n**Gathering Cloud Peak**\nAuspicious vapors float in kindred formation,\nThe Celestial Perfected ride upon divine dragons.\nExotic fragrance billows atop the numinous peak,\nAs ten thousand sages come to pay homage to the nine-tiered heavens.\n\n**Cinnabar Rock**\nThe alchemical furnace refines the elixir to perfection,\nNurturing a fiery tree of radiant spirit.\nThe immortals crush it in a golden mortar,\nAnd the cosmos revives—all things bask in spring’s yang.\n\n**Brow-Ridge Mountain**\nAn ancient reclusive official, upright and incorruptible,\nHis dwelling as luminous as Yuan Lu Mountain.\nEnraged to see Yuan Gui’s face dust-laden,\nHe widens his eyes to question the world.\n\n**Subduing Demons Peak**\nThe heavenly gate, a mere footspan away, has transformed into a fish—\nYet it leaps with ease, moving in unhurried grace.\nThere is no need to seek the Chancellor in Longzhong,\nFor Zhuge now dwells here in this place.\n\n**Master Yu’s Rock**\nThe mountain elder adores dwelling in emerald peaks,\nHis domain by the rivers nurturing purple lingzhi.\nBearing the *Hetu* in his back, the divine *Yi* departs,\nPerhaps he has journeyed since antiquity to seek Fu Xi.\n\n**Parrot Peak**\nA mortal bird, now immortal, dwells in azure clouds,\nClaiming a lofty perch far above the common throng.\nAt the break of dawn in the grotto-heaven, it precedes the world,\nIts great vessel and resounding voice known across the earth.\n\n**Ever-Spring Rock**\nThe valley brims with immortal blossoms, brocade-lush,\nTheir fragrance unbroken through the four seasons, celestial sweet.\nThe Celestial Perfected expand life’s boundless creation—\nA single grain of elixir revives the cosmos’ yang.\n\n**Solitary Yang Rock**\nAt first light, it sketches the precelestial design,\nEvery mountain embodying the *Gen* trigram’s form.\nThose who cultivate fire—how vast their heaven!\nTheir bone and power, pure yang, are unmatched.\n\n**Favor Gate Mountain**\nPurchasing cassia to fuel the stove at the summit,\nSmoke towers rise, commanding the gaze of all.\nWhen the Han king arrived, his robes caught flame,\nIgniting the mid-heaven’s fiery virtue.\n\n**Hand-Climbed Mountain**\nThe waters are shallow, Penglai’s cloud-path distant,\nYet immortals gather here to ride the heavenly bridge.\nTogether, they stretch out Ma Gu’s claws,\nClambering to the peak’s crest—there lies the azure sky.\n\n**Yin Xi’s Rock**\nWhere the Dao conceals itself, immortals abide,\nThe heart-seal at the Han Pass, the *Dao De Jing*.\nNo need to knock on the gate and ride a crane away—\nThis mountain’s immortals are already in heaven’s court.\n\n**Stalwart Man Peak**\nJian Hai strides boldly across the nine provinces,\nFor millennia, he has stood at the vanguard of creation.\nEnraged, he severs Ao’s legs, clashes with Gong Gong,\nBracing the northwest corner of the sky.\n\n**Outer Cloud Rock**\nLeaving the mountain, he stumbles into dragon-riding,\nReturning from rain-bestowing, his sleep is deep.\nLet Master Xi Yi stretch his limbs at ease—\nNo worry his dream will fail to reach the Shang lord.\n\n**Cloud-Mist Rock**\nHidden leopards, concealed dragons, auspicious vapors rise,\nTrue immortals dwell here, their spirits at home.\nTheir carriages come and go without form,\nOne imagines pavilions merging with the ethereal void.\n\n**Dripping Water Rock**\nThe golden lock taps softly, channeling the Milky Way,\nA silver thread hangs, abundant and fine.\nNot to withhold the rain’s key in stubborn closure—\nThe jade cliffs shift, stones stir, winds and waves arise.\n\n**Great Green Sheep Gully**\nThe water’s pulse connects to the Luo Grotto,\nThe stream brims with strange stones—torpid dragons.\nThe earth immortals’ nine halls are not far,\nTheir root-realm comes to pay homage to the nine-tiered heavens.\n\n**Small Green Sheep Gully**\nThe Dongting shepherd resents his lifelong duty,\nThough the dragon maiden is divine, she has not attained true spirit.\nPurifying himself, he drives them forth to seek enlightenment,\nYet his steadfast heart turns to stone, neighbor to stone.\n\n**Resting Immortals’ Rock**\nRiding qi and wind, they traverse the ten thousand heavens,\nThe assembled Perfected till the clouds by day and night.\nPausing their jade pendants in the Jasper Flower Grotto,\nThey recline at a feast of flying cups on a tortoiseshell mat.\n\n**Early Worm Peak**\nThe Dark Heaven’s ancient might commands awe,\nAt its summit, the Black Killer’s banner flies high.\nNo need for the great god’s twin arms—\nThe winds and clouds on all sides sustain it forever.\n\n**Master Xi Yi’s Rock**\nThe immortals’ wondrous method is transmitted heart-to-heart,\nDream-sated on mist and rosy clouds, he sleeps with the peaks.\nPushing aside his pillow, he surveys the world’s affairs,\nThen moves his couch amid the clouds to Hua Mountain’s crest.\n\n**Scattered Stones Peak**\nChu Ping delves deep into azure mists,\nLeaving behind his flock of sheep for years.\nIf their true nature were touched by immortal alchemy,\nThe slow mountains’ glow would all turn to cinnabar.\n\n**Immortal Singers’ Rock**\nMist and rosy clouds—old friends to one another,\nPlaying with the moon, chanting to the wind, they share a home.\nAtop the great summit, the heavenly path draws near,\nThey come and go together in five-colored cloud chariots.\n\n**Jade Immortal Rock**\nThe golden crucible tames coiling dragons and tigers,\nThe immortal’s recipe—pine and citron—is the heart’s elixir.\nWhen the grotto gate’s lock opens to the clouds,\nA myriad miles of flying cranes widen the cosmos.\n\n**Subduing Demons Peak**\nSteep cliffs, verdant heights, stone swords piercing the sky,\nThe Celestial Perfected’s karmic mandate guards the sacred altar.\nThe Dragon Spring is sealed within a golden lotus casket,\nIts unshining radiance chills the demons’ hearts.\n\n**Yang Harmony Peak**\nA single sacred sprout stirs purple mist,\nThe earth’s essence warms, lush as Lantian’s fields.\nThe Daoist’s primordial qi is wrapped in spring’s rebirth,\nThe entire valley plows white clouds at noon.\n\n**Cloud-Rosy Abbey**\nSeveral strands of golden light, their hues resplendent,\nJade pendants flutter as ten thousand immortals descend.\nWhere the five dragons alight in ordered ranks,\nA new, secluded grotto-heaven of vast yang is created.\n\n**Dragon Pool**\nHalf a deep pool stilled, brimming with Yu Gate’s waves,\nIts location ordained for a celestial gathering.\nAwaiting the nine heavens’ thunderous roar,\nIt will surge straight up to the azure clouds.\n\n**Thunder Grotto**\nNurturing the precelestial, restoring earth’s yang,\nThe Heavenly Lord rides the jade dragon in concealment.\nWithin, the axis of heaven and earth turns,\nA single ladle of numinous spring rains the eight wilds.\n\n**Southern Rock (Renamed: Celestial Yi’s True Blessing, Longevity Palace)**\nUnlocking heaven’s treasury, expanding the sacred realm,\nPure yang immortals occupy pure yang’s domain.\nClouds and rosy mists, jade hues—beyond the mortal world,\nTheir radiant flames illuminate the entire earth.\n\n**Grotto-Abyss Meditation Chamber**\nHand grasping wind and thunder, he establishes the teaching’s gate,\nDivine and human merge to devise wondrous merit.\nLofty pavilions pierce the sky, his body bears the weight,\nIn this world’s ascension, he conceals the clouds of the ridge.\n\n**Sweet Dew Spring**\nJade well’s abyss, deep with rippling green,\nThe Celestial Perfected’s primordial sun refines the elixir pool.\nIts waters, fragrant through the ages, are all celestial wine—\nMay the drowned be cured, drinking but a single cup.\n\n**Celestial Bridge**\nFrom the hanging cliff, cascades plunge to the peak’s waist,\nEntering cultivation here, one already soars the nine heavens.\nHumans too build suspended walkways linking towering halls,\nGazing ahead, each step spans ten thousand leagues.\n\n**Three Halls of Southern Rock**\nThe Sage Emperor’s western retinue, the Sage Friends gather,\nThe Sacred Parents’ throne stands at the center.\nLeft and right, incense clouds coil and billow,\nThe Celestial Yi’s Purple Tenuity True Blessing Palace.\n\n**Shrine of the Southern Rock Perfected**\nThe Great Summit looms before all eyes,\nStreams and mountains encircle its emerald, facing the peak’s tip.\nWudang’s marvels, the marvel of marvels—\nAt first glance, the celestial Perfected dwell beneath the eaves.\n\n**Another Shrine of the Perfected**\nMyriad ravines and cliffs gather the essence of beauty,\nIts solemnity needs no ritual form.\nSay not that gods and spirits truly reside here—\nEven wood and earth, lifeless, radiate numinous power.\n\n**Southern Rock’s Sea Convergence**\nHow compare tripods to the furnace of water and fire?\nNobles joyfully offer alms, entering the Mystic Capital.\nThe Patriarch convenes to transmit the mind-seal,\nEach bestows the talisman of ascension and celestial mandate.\n\n**Abiding Immortal’s Reclusion**\nGolden abyss, jade sea swell with literary waves,\nThe eighth-month sky’s winds ride the ocean’s heights.\nHeroic qi gathers within clouds and ravines—\nFrom the immortal isles, he strides a golden turtle.\n\n**Trial Heart Stone**\nThe world’s human sentiments are treacherous as iron,\nYet when the spirit is whole, the realm is surely level.\nWalk the Way with ease, though the crags be hollow—\nTen thousand fathoms deep is no peril.\n\n**Ascension Terrace**\nFor long, his spirit descended before the Emperor,\nYet form is not the true mystery of the Dao.\nFrom the layered cliffs, he casts off his dust-laden body,\nRoaming the six directions, governing the ten thousand heavens.\n\n**Gratitude to Heaven and Earth Rock**\nMomentarily moved by the vault of heaven, speechless,\nFrom the cliff’s root, he reaches the celestial court.\nOnly when the shed bones are securely hidden does he lightly rise,\nFreely roaming as a spirit, attending the Jade Clarity.\n\n**Valley of Ten Thousand Households**\nImmortal dwellings stretch across verdant peaks,\nRidge clouds probe the locks of layered green.\nWithin the grotto, heaven and earth are vast from the start—\nA fiefdom’s households all find ample space.\n\n**Ox Ford Gorge**\nOf old, the Old Lord crossed the Hangu Pass,\nRiding a green ox, he passed this way.\nNow, as the Dragon-Horse appears in the revealed diagram,\nDaoists play with the *Yijing* by murmuring streams.\n\n**Azure Sheep Gorge**\nFor a thousand years, incense and verse recall Xie’s Pool,\nA single line from the Western Hall—a dreamt poem.\nRooted in duckweed and pondweed for offerings,\nIt transcends to the flourishing age of the royal *feng*.\n\n**Imperial Cliff Peak**\nThe earth’s weight shifts, yet it remains serene and focused,\nThe Dao’s words correspond above to the Great Peace Heaven.\nHollowed eaves and golden goblets encircle golden palaces,\nNeither existing nor void, at the vast desert’s edge.\n\n**Manifest Stability Peak**\nIt forbids the great yawn to shake heaven’s pivot,\nThe grand cosmos\n\n**Purple Void Crag**\nAt Qian and Dui’s sunlit highest peak,\nThe dragon-vein coils five myriad leagues.\nHeaven’s first abode for cultivating truth,\nA yard’s breadth holds ninefold imperial depths.\n\n**Great Harmony Crag**\nMyriad ravines and cliffs bloom in wondrous splendor,\nYet here remains the ancient harmony of Yong.\nA plot of the Old Master’s springtime terrace,\nEver abiding in the flourishing age of Tang and Yu.\n\n**Crown Prince Crag**\nCliff and ravine, dark and deep,\nThe royal heir pressed on to learn immortal arts.\nAscending through the ages as the Mysterious Heavenly Emperor,\nHow many kings of former dynasties matched his years?\n\n**Cloud-Gazing Peak**\nClouds drift from peaks without intent—yet they exist,\nHeaven and Earth bestow their grace to the eight directions.\nIn the towering ravines, a spontaneous joy arises,\nAt the summit, one burns incense and sits to watch.\n\n**Verdant Cloud Crag**\nWorldly affairs shift and twist with deceit,\nWhite robes and gray dogs change in an instant.\nYet a single green qi floats through the ages,\nVaguely recalling the Mercy Palace’s boundless reach.\n\n**Longevity Palace**\nGolden crucible, elixir void—dragon and tiger grow cold,\nThis pine, hollow with age, guards the immortal altar.\nWhen shall the Penglai Hall open once more,\nTo gaze at the five-colored clouds and pray for peace?\n\n**Summit-Gazing Peak**\nHuman worth varies on these purple-green heights,\nYet all revere this place where scholars seek worthiness.\nThe foremost peak aspires to sagehood,\nBut only Heaven stands beyond all comparison.\n\n**Return-to-Court Peak**\nSleeves filled with celestial fragrance, stepping from the palace gate,\nDelighted to join the Queen Mother’s feast in the Western Kunlun.\nStill, the heart clings to the court with loyal devotion,\nRushing to join the morning assembly before the August One.\n\n**Grand Constancy Office**\nOfferings and counsel dwell beside sun and moon,\nYi and Kui’s rites and music align with Shun’s ranks.\nThe White Cloud Office guards the White Cloud Grotto,\nIts earthly place in the sacred mountain, its duty in Heaven.\n\n**Protector-Sage Office**\nHolding Heaven’s northern pole, the office of the celestial pivot,\nThe Northern Pole’s pivot court bears the same charge.\nThunder and lightning rush forth at its commands,\nHow many secret scriptures of the Three Realms pass through?\n\n**Harmonious Relocation and Examination Office**\nTwo inquiries mold the myriad beings as one,\nThe registers of perfected immortals receive imperial favor.\nWhen the Celestial Court convenes to review merits,\nAll in Jade Capital Heaven answer to Kui and Gao.\n\n**Celestial Unity and True Felicity Palace**\nThe Emperor’s residence atop Kan, within the Purple Tenuity,\nThe four seas divide its spirit into ten thousand streams.\nA single pulse of primordial qi gives rise to living waters,\nTen thousand years of rain and dew bestow Heaven’s grace.\n\n**Martial Majesty King’s Temple**\nBorn with solemn resolve, yearning for the mysterious,\nGraced by karmic favor to guard the sacred mountain.\nSilent, formless, beyond sound in the darkest depths,\nYet thunder, lightning, wind, and storm answer to his gaze.\n\n**Cloud Grotto Hermitage**\nWhich tier of the sacred mountain’s retreat is this?\nA thatched hut, tightly sealed, concealing its traces.\nDeep within the shadowed vale, coiled and hidden,\nPerhaps in a former life, it was the Five Dragons.\n\n**Purple Empyrean Spirit Spring**\nHalf a pool beneath the stone, a small hill’s embrace,\nThe sea’s dust scatters, yet its flow never ceases.\nEach drop sustains thousands upon thousands,\nDivine workings transform countless autumn pools.\n\n**Nine-Ford Stream**\nThe crane’s chariot drifts far, never to return,\nThe heir apparent ascends to the White Cloud Mountain.\nHow could a mere stream block the path to a mother’s love?\nAwaiting the day he faces the Celestial Countenance in Heaven’s Palace.\n\n**Nine-Wave Service**\nJade blossoms hang suspended over the emerald creek’s bend,\nHow many times has its radiance graced these waters?\nA single handful of brewed spring brings a thousand days of drunkenness,\nEven the old sojourner of Xinfeng regains a youthful face.\n\n**Banner-Unfurling Peak**\nSeven crags arrayed like stars, towering and majestic,\nGreat banners and lofty standards escort the Six Dragons.\nScattered to fill the Six Directions,\nRaising wind and felling rain, its celestial might resounds.\n\n**Millennial Mugwort**\nThe mountain holds divine spirit, and its herbs share its power,\nA single pill’s strength rivals ginseng and poria.\nBranch by branch, leaf by leaf, it governs human fate,\nHeaven dwells at its roots, granting eternal life.\n\n**Ten-Thousand-Year Pine**\nHeaven’s essence and Earth’s purity merge in the wilds,\nNot in lofty grandeur to rival the Han’s heights.\nIn an instant, withered wood revives through transformation,\nUnaging through wind and frost, its root of longevity firm.\n\n**Golden Star Stone**\nIts qi pure and unyielding, wondrously congealed,\nThe Western Venus radiates auspicious light.\nIts scattered brilliance fills Heaven and Earth,\nMount Hua’s treasures flourish in its mountain.\n\n**Silver Star Stone**\nOnce carved as tribute to Liangzhou,\nIt remains to guard the sacred mountain’s highest peak.\nGrain by grain, cinnabar—a treasure of the world,\nIts auspicious glow illuminates the night sky.\n\n**Pine Lichen**\nTen thousand strands of trailing silk drape the green mist,\nFor millennia, it sways and coils.\nFully transformed, it robes the court in splendor,\nAdorning the Golden Gate across ten thousand heavens.\n\n**Non-Empty Bird**\nThe Daoist lineage of Zhuang and Lao studies emptiness,\nYet diligently doing good, it follows Shun’s path.\nObserve that bird—its meaning lies beyond words,\nFor three thousand meritorious deeds are true mastery.\n\n**Crow**\nAt the Coming Phoenix Terrace, it emulates swift flight,\nRecording offices like the phoenix at the Guest Gate.\nWhen celestial visitors arrive, the flock calls in unison,\nLeading the crane’s ranks to audience with the Sacred One.\n\n**Half-Set Music**\nThe Supreme Clarity’s refined strains, rare in the world,\nNeither bamboo nor silk, but five-colored birds.\nThe *Shao* dance shares in the universal celebration,\nThe numinous phoenix arrives with a single heart.\n\n**My Master’s Bird**\nThe Dao is everywhere, inherent in all nature,\nEvery moving thing, every living being, holds reverence.\nIts teaching’s work mirrors Heaven’s nurturing embrace,\nWho in this life can stand apart from Heaven and Earth?\n\n**White Pheasant Parrot**\nFeathered robes of pure jade, a deity of Yizhou,\nFacing east, it guards the sacred mountain’s truth.\nTransformed to soar in the palace courtyard, nesting with the phoenix,\nIts wings support the imperial carriage to the Celestial Ford.\n\n**Spirit-Longevity Staff**\nAn ancient pine’s bones, the Valley Spirit’s elder,\nThe Great One’s true essence, an ancient staff’s might.\nSpared the taint of Kong Guang’s treacherous hands,\nIts years in the mountains match Heaven’s own.\n\n**Kan Forest Tree**\nA wondrous marvel of the Seven Treasures Forest in the upper realms,\nBranch by branch, kingfisher jade, leaf by leaf, lapis lazuli.\nHad it not dwelled atop the Great Summit in Heaven,\nHow could its divine root claim such uniqueness?\n\n**Mind-Stabilizing Pine**\nA green official, Heaven-sent, exuding human grandeur,\nA single stone, rootless, towers ten thousand feet.\nLeaning like Mount Tai to peer beyond the Dipper,\nIts iron body upholds an emerald canopy in the void.\n\n**Cloud Bamboo Staff**\nBestowed in purple, concealed in forests and springs,\nIn times of peril, it upholds the state as a great worthy.\nThe world’s path is smooth, Heaven’s course steady,\nLao Ge invites it to accompany the immortals.\n\n**Heavenly Lamp**\nFrom yin cliffs and bottomless ravines, waters trickle,\nAt dusk, its windows gleam on all eight sides.\nSuddenly, the Nine Empyreans’ divine transformations appear,\nA few branches of flame glow in silver vats.\n\n**Stone Lamp Core**\nInch by inch, its unyielding heart embodies the Dao’s fullness,\nBoundless radiance illuminates the infinite.\nLantern oil never exhausts, its burning unceasing,\nFor ten thousand ages, it is the dawn of humanity’s world.\n\n**Solomon’s Seal**\nShoots of pure yang nestle with deer in slumber,\nIts roots, full and substantial, endure through the years.\n\n**Night Furnace**\nBy moonlight, the golden crucible simmers,\nEven plain rice, untainted by green essence, may lead to immortality.\n\n**Cangmu Decoction**\nHumble as weeds, yet precious as golden jade,\nFire forges the elixir to transmute bones and ascend.\nRefined within the cauldron of creation,\nThe drug of longevity needs not seek Penglai.\n\n**Black Tiger Elixir**\nMajestic as a bear’s solemn march,\nOn wild cliffs and mountain walls, dusk lingers.\nWithin the spoon, fangs and claws stir,\nAching ills and pains—mere tricks of the black donkey.\n\n**Chuanxiong Cakes**\nSharp attacks on head and eyes, bitter with hollow pain,\nThe immortal’s remedy wields mighty force.\nFlake by flake, snow-like blooms from Shu’s finest,\nNo need for ablutions or the Three Vehicles’ discourse.\n\n**Mugwort-Essence Pill**\nAmid thorny thickets lie ginseng and poria,\nThe emperor’s tribute, blessed by earth’s spirit.\nThough seven years of true illness may persist,\nThe mercury furnace’s merit blazes in cinnabar script.\n\n**Sweet Tea**\nCultivating the Dao, its taste is plain yet divine,\nSelf-cultivated cloud-fat, plucked jade blossoms.\nSince ancient times, it has sweetened mortal lips,\nA spring breeze for a hundred million lives.\n\n**Wudang Illustrated Scroll**\nAscend ninefold skies to witness great harmony,\nSpiral through eight hundred li of mountains and rivers.\nA thousand verses of brocade could not exhaust its splendor,\nYet a single painted scroll—does it suffice?\n\nMoments of wind and moon take on new grace,\nHow do mist and clouds shift in their forms?\nTo see beyond the scroll itself,\nIs to find the mountains’ endless vistas.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "武当纪胜集 经名：武当纪胜集。 元罗霎震撰。 一卷。 底本出处：《正统道藏》洞神部记传类。 武当纪胜集 龙兴路云麓樵翁罗霆震撰 樵歌首章 采樵远到太和山，山在神仙洞府问。 风露九霄丹阙近，乾坤万古白云问。 昤情月胁边消遣，步武天心处往还。 乐地更多天更阔，不知身外有尘寰。 次章 洞天福地满寰区，拱北来朝北帝居。 赫赫武当联艮岳，巍巍大顶压坤舆。 无边圣化身金阙，最上神霄相玉虚。 嘉会风云依日月，祝香班幸列霞倨。 界山 天上人问娃步殊，到均阳境入云衢。 飘飘自有神仙气，踊跃东风咏舞雩。 浪河 涓滴流成海样多，雨余万壑总鲸波。 杖华稳代商川橄，拜赐晴天过险坡。 梅溪 壬癸储精毓圣神，坎中阳露发生仁。 仁根遍地南枝暖，帝造充为天下春。 观庄 沆淦餐英天上仙，也储天凛富天田。 山中火枣交梨外，腐积困仓介寿年。 城子裹 匝绿堆红锦四围，天然图画此山溪。 循环一坛通门径，松竹岩前桃杏蹊。 蒿口 一边萧艾一芝兰，利欲关头道义关。 凡圣两岐争转脚，五云多处是蓬山。 天下武当 入圣超玄第一关，均阳福地甲人寰。 际天所覆宗辰极，万古乾坤共此山。 接待庵 薄海擎香献寿烟，谁能辟谷挟飞仙。 驿亭饷饱青精饭，着力登山即九天。 茅坡土地 贡岩缩酒荐芬芬，外护灵山效职勤。 若是有功当上赏，也同封土赐元勋。 山神堂 不假丹青亦阐灵，祠庭气力地精英。 道心泯作人心者，霹雳无声也震惊。 外朝峰 草木通灵感圣恩，山山随众谒金门。 遥岑回首招仙倡，接引同班觐至尊。 黑虎祠 变豹初头未炳文，文章不露已超群。 玄天约束巡廊了，爪距深藏铁色云。 浩劫之家 鳌极初来直至今，户庭岁月几何深？ 羲农以上人如在，幼子童孙太古心。 痉剑堠 有谁出岫片云孤，花月为妖媚半途。 雷斧暗藏黄壤酒，邪精褫魄死邓都。 磨针涧 淬砺功多粗者精，圣师邀请上天京。 我心匪石坚於石，小器成时大道成。 羊河江 地不居延苏子卿，水非纸乳始何名。 源头却是灵泉脉，到海门边流也清。 磨剑涧 帝真合是镇玄天，奉劫镕金冷紫烟。 三尺展开横海岳，肃清宇宙一龙泉。 隐仙岩 炉鼎消磨日月多，山中衮绣一青蓑。 白云也不知仙迹，今在何天呜玉坷。 山门 洞天深厦万峰青，乾户弘开夜不肩。 步步此关参得透，一条仙径上青冥。 朝帝峰 上圣天临驻晓銮，龙翔凤舞万山盘。 前峰宰执峨冕冤，望阙嵩呼祝寿安。 诵经台 仙梵声扬感万灵，灵坛字字响天庭。 当时听讲龙君座，依旧连珠列五星。 望仙亭 大顶今为启圣乡，十洲三岛在均阳。 众真想像归旌谛，朝跨苍龙夕彩凰。 会仙坡 蓬莱十四圣天人，聚太和山谒帝真。 说透微危精一外，一般尧舜禹心神。 会仙桥 洲泉浩浩驾星河，普济诸天谒太和。 几度好风明月夜，锵鸾跃凤响呜坷。 日月池 天德辉华炯帝前，地无两曜地非天。 山中光景天为一，昼夜雷呜两洞泉。 五龙官 金阙巍煌逼紫微，纯肠气数发光辉。 三峰示现真头角，护驾冲升夹日飞。 聚仙岩 近五龙宫拟会朝，帝家玉帛万诸侯。 山头整肃班联处，依约五城十二楼。 圣诞朝贺 一万诚心万圣真，祝香何地不身亲。 年年春月如朝市，海角天涯也有人。 天宫 宝山悬隔世尘嚣，高九层霄又九霄。 楼阁五云新彩结，三清三境共逍遥。",
      "translated_text": "**Wudang Record of Marvels**\n\n**Title:** *Wudang Record of Marvels*\n*Composed by Luo Tingzhen of the Yuan Dynasty. One fascicle.*\n*Source text: \"Daoist Canon of the Zhengtong Era,\" Dongshen Section, Records and Biographies Category.*\n\n**Wudang Record of Marvels**\n*By Luo Tingzhen, the Cloudy Peak Woodcutter of Longxing Prefecture*\n\n**First Stanza of the Woodcutter’s Song**\nGathering firewood, I journey afar to Mount Taihe,\nWhere mountains dwell as immortal grotto-palaces.\nWind and dew of the nine heavens brush the cinnabar gates,\nHeaven and earth endure through ages—white clouds ask.\nMoonlit crags dissolve the heart’s cares,\nSteps tread the celestial heart in comings and goings.\nA land of joy, vaster than the heavens,\nUnknowing of the dusty world beyond.\n\n**Second Stanza**\nGrotto-heavens and blessed lands fill the mortal realm,\nThe Northern Emperor’s abode receives homage from the north.\nResplendent Wudang links with Mount Gen,\nIts towering summit presses upon the earth’s expanse.\nBoundless sacred transformation—golden palaces,\nThe supreme divine realm mirrors Jade Clarity.\nAuspicious gatherings of wind and cloud align with sun and moon,\nIncense ranks in homage arrayed like rosy clouds.\n\n**Jieshan**\nWhere celestial beings tread, steps diverge,\nAt Junyang’s border, one enters the clouded thoroughfare.\nLightly drifting, imbued with the qi of immortals,\nLeaping in the eastern wind, chanting the *Dance of Yu*.\n\n**Lang River**\nTrickling drops swell into an ocean’s vastness,\nAfter rain, ten thousand ravines surge with whale waves.\nThe staff of blossoms steadies the journey like Shangchuan’s cane,\nBlessed by clear skies, one crosses perilous slopes.\n\n**Mei Creek**\nRen and Gui store essence, nurturing sages and spirits,\nYang within Kan reveals the sprouting of benevolence.\nBenevolence’s roots warm the southern branches,\nThe Emperor’s work brings spring to all under heaven.\n\n**Guanzhuang**\nFeasting on celestial blossoms, immortals of the heavens,\nThey store the sky’s chill, enriching the celestial fields.\nBeyond mountain fire-jujubes and exchanged pears,\nGranaries of decay and hardship extend longevity.\n\n**Chengzili**\nGreen piled upon red, brocade encircles all,\nA natural painting—this mountain stream.\nA single altar’s circuit opens the path,\nBefore pine and bamboo crags, peach and apricot trails.\n\n**Haokou**\nOne side mugwort, the other orchid,\nAt the gate of profit and desire stands the gate of Dao and righteousness.\nMortals and sages diverge—where to turn one’s steps?\nWhere five-colored clouds gather lies Penglai Mountain.\n\n**The World’s Wudang**\nThe foremost pass to transcendence and the sacred,\nJunyang’s blessed land excels all in the mortal realm.\nWhere heaven’s canopy meets the pole star,\nFor ten thousand ages, heaven and earth share this mountain.\n\n**Jiedai Hermitage**\nFrom distant seas, incense is raised in offering,\nWho can fast and embrace flying immortals?\nAt the post station, one feasts on azure essence-rice,\nExerting strength to ascend the mountain—reaching the nine heavens.\n\n**Land of Maoshan’s Earth God**\nOffering wine from Gongyan, fragrant and rich,\nExternally guarding the sacred mountain, fulfilling duties with diligence.\nIf merit is achieved, it shall be rewarded,\nAlso enfeoffed with land, granted as a meritorious minister.\n\n**Mountain Spirit Hall**\nNo need for pigments—its numen manifests,\nThe temple’s vigor draws from the earth’s essence.\nWhen the heart of Dao merges with the human heart,\nEven silent thunder strikes with awe.\n\n**Outer Audience Peak**\nGrass and trees, imbued with spirit, sense the sage’s grace,\nEvery mountain follows the multitude to pay homage at the golden gate.\nFrom distant peaks, one turns to summon immortal companions,\nJoining the ranks to behold the Supreme.\n\n**Black Tiger Shrine**\nA leopard’s transformation begins, patterns yet unformed,\nIts refinement concealed, it already surpasses the crowd.\nThe Dark Heaven’s discipline patrols the corridors complete,\nClaws and talons hidden deep in iron-hued clouds.\n\n**House of the Kalpa**\nFrom the era of Ao’s rise to the present,\nHow deep have the years stretched in this household?\nFrom the age of Fuxi and Nong onward, people endure,\nChild and grandchild—hearts of primordial antiquity.\n\n**Sword Mound**\nWho emerges from the peaks, a lone cloud?\nFlowers and moon bewitch halfway along the path.\nA thunder-axe concealed in yellow earth’s wine,\nEvil spirits stripped of souls die in Dengdu.\n\n**Grindstone Gorge**\nThrough tempering, the coarse becomes refined,\nThe sagely master summons one to the celestial capital.\nMy heart is not stone—firmer than stone,\nWhen the small vessel is complete, the great Dao is achieved.\n\n**Yang River**\nThe land does not belong to Su Wu’s exile,\nNor is the water first named from paper and milk.\nIts source is the vein of a sacred spring,\nFlowing clear even at the sea’s gate.\n\n**Sword-Grinding Gorge**\nThe imperial perfected one is truly the guardian of Dark Heaven,\nForging metal through the kalpa in cold purple mist.\nThree feet unfurled, spanning seas and mountains,\nPurifying the cosmos—a single dragon spring.\n\n**Hidden Immortal Crag**\nCrucible and cauldron refine through countless days and months,\nAmid the mountains, embroidered robes yield to a green straw cloak.\nEven white clouds know not the immortal’s traces,\nNow in which heaven does the jade flute resound?\n\n**Mountain Gate**\nThe grotto-heaven’s deep eaves, ten thousand peaks green,\nThe Qian gate swings wide, never closing at night.\nStep by step, this pass is thoroughly fathomed,\nA single immortal’s path ascends the azure void.\n\n**Audience Peak**\nThe supreme sage descends, halting the morning chariot,\nDragons soar, phoenixes dance—ten thousand mountains coil.\nThe front peak’s ministers wear caps and robes,\nGazing toward the palace, they hail longevity and peace.\n\n**Sutra-Recitation Terrace**\nImmortal chants resound, moving ten thousand spirits,\nThe sacred altar’s words echo in the celestial court.\nOnce, the Dragon Lord’s seat listened to lectures,\nStill arrayed like pearls in the five stars’ order.\n\n**Pavilion of Gazing at Immortals**\nThe great summit is now the birthplace of the sage,\nThe ten continents and three isles lie in Junyang.\nAll perfected ones, in thought, return to the banner’s truth,\nMorning riding azure dragons, evening on rainbow phoenixes.\n\n**Gathering Immortals Slope**\nFourteen celestial sages of Penglai,\nGather on Mount Taihe to pay homage to the imperial perfected.\nBeyond subtle peril and the essence of oneness,\nLike the hearts of Yao, Shun, and Yu.\n\n**Gathering Immortals Bridge**\nIsland springs vast, spanning the starry river,\nUniversally aiding all heavens to pay homage to Great Harmony.\nHow many nights of fine wind and bright moon,\nJade phoenixes and ringing luan-bells resound?\n\n**Sun-Moon Pool**\nHeaven’s virtue shines radiant before the emperor,\nEarth without two luminaries is no earth, no heaven.\nThe mountain’s light and shadow—heaven becomes one,\nDay and night, thunder roars from twin grotto springs.\n\n**Five Dragons Palace**\nGolden palaces resplendent, pressing upon the Purple Tenuity,\nPure yang’s qi and destiny emit radiance.\nThree peaks manifest true prominence,\nEscorting the ascent, flying beside the sun.\n\n**Gathering Immortals Crag**\nNear the Five Dragons Palace, poised for audience,\nThe imperial house’s jade and silk—ten thousand lords.\nAtop the mountain, ranks stand in solemn order,\nResembling the twelve towers of the five cities.\n\n**Birthday Celebration and Homage**\nTen thousand sincere hearts for ten thousand sagely perfected,\nWhere is there a place incense is not offered in person?\nYear after year, spring months like a bustling market,\nFrom the sea’s edge to the sky’s end—people come.\n\n**Celestial Palace**\nA treasure mountain suspended, far from worldly clamor,\nHigh in the ninefold heavens, and ninefold again.\nPavilions and towers newly adorned with five-colored clouds,\nThe Three Clarities, three realms—all in carefree ease.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1404,
      "start_sentence": 0,
      "end_sentence": 103,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 45.13935112953186,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\武当纪胜集.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "上升朝贺 武当如布满乾坤，冲举皆亲见帝尊。 大顶根头高第一，登高雷拜谒天合。 三清殿 太上官庭本自然，瑶空梵黑有无边。 垂光移下三真境，别个人问天上天。 玉皇殿 重明丽正俨端门，金阙人天两至尊。 宗主万方臣六合，显幽一样宰乾坤。 玄帝正殿 宫阙威严肃洞天，群峰环翠立群仙。 巍巍韵座端辰极，亿兆神人拜御前。 明真殿 元始初来几化身，再投父母造乾坤。 天宫内展家庭礼，上界双亲帝后尊。 蓬真殿 三天十四圣联班，勋德巍煌宇宙问。 金阙化身开帝座，风云庆会武当山。 七皇阁 一一胚浑太极先，玉清而次至玄天。 在天尧舜汤文武，作者均如古圣贤。 桂籍殿 职联上相主文昌，积行名贤席宠光。 到此即登蟾阙内，高枝攀动九天香。 元皇殿 三清宰辅判玄元，义重金兰两圣贤。 七曲分灵同阐化，摩夷天亦太和天。 三茅真君殿 赤城戏罢跨龙来，兄弟相联自衮台。 荣甚西班增焜耀，主人金阙倚天开。 五龙阁 夹日迎将帝驾升，赏功知得便飞腾。 彰施采色金鳞甲，同上凌烟最上层。 雷堂 洞渊帝帅宅神霄，霹雳声雄诚万妖。 收敛神功归掌握，威而不猛肃班朝。 雷司赵帅堂 前身邓岳鬼中王，制阐京西镇古襄。 风雨摄归玄帝部，更教天上总关张。 雷司孟帅堂 当年壮志在中原，破蔡亡金正为元。 天恐雷霆无斜察，三天借重溥天恩。 五龙井 兴汉元年聚处星，涌泉成坎匝祠庭。 渊潜一一飞天去，地脉香甘万古灵。 五百灵官祠 神人万亿戴玄天，列职分司者半千。 两序枢趁风夹动，皋夔稷契舜群贤。 锺楼 擎天立柱驾梁虹，发越鲸音气量洪。 如法大呜应大和，金声玉振九霄中。 步云楼 非雾非烟最上头，九霞光裹露喜烧。 朝元第一层高处，玉笋班联碧玉霄。 功德司 录善天官有职存，末将香火当奇勋。 其问行满三千者，卷卷金书玉册文。 海山堂 洞府中问洞府开，普天共作一蓬莱。 烟飘雨笠风云会，不是神仙不到来。 提举知官位 规模上界统群仙，小样钧衡领众贤。 坐定老君高玉局，主持天下洞中天。 知副宫位 为保为师道体同，圣真均赖亮天工。 心心协济周公事，此是灵坛一召公。 真官堂 辅正除邪禁不祥，职严主宰镇祠场。 诱吾松桂欺云壑，袖有弹文奏帝傍。 斋堂 味饱云厨养气元，烟瓢露钵起龙蟠。 丹田更有黄金粟，粒粒神仙不老丹。 紫云道域 化身开化到人问，元是天真天上班。 再造武当三洞府，方蓬瀛列海三山。 祖堂 道派相传奕叶光，仙魂多在白云乡。 孝思缥缈炉烟袅，通地通天一瓣香。 宣慰祠堂 泰山后裔旧臣邻，身是仙山会上人。 硬铁脊梁功德主，此心道老在高真。 尊宿堂 饱唐日月香山老，傲汉乾坤芝岭仙。 嘉会风云环四座，逍遥今古静中天。 官厅 煌煌晓日驻縿鸾，指准联班祝寿安。 闻阖一开天北阙，嵩呼雷动俨衣冠。 清心堂． 稳泊虚舟安乐窝，山林那解有风波。 一泓止水澄方寸，纳得无云泰宇多。 尘劳道倡 野马尘埃扰俗绿，贱中剩有贵神仙。 香泉万斛云千顷，昼日耕云晚汲泉。 真常遗烈 开辟灵坛棘刺林，空拳做出屋黄金。 万年香火炎炎盛，一片中兴铁石心。 承应仙游 几捧天书雨露香，风霆握在掌中央。 剑函蜕了仙魂往，尚想鞭鸾入帝乡。 冲虚庵 融融幽雅冰和气，洞洞庄生室大空。 玄教宗儒天地阔，无边风月草庭中。",
      "translated_text": "**Ascent and Homage**\nWu Dang fills the cosmos like a vast expanse,\nAll who ascend witness the August Lord in person.\nThe Great Summit’s root stands first in height,\nClimbing high, they bow in thunderous reverence to Heaven’s Gate.\n\n**Hall of the Three Clarities**\nThe Celestial Court of the Supreme Lord is naturally so,\nJade skies and boundless darkness stretch without end.\nRadiance descends to the Three True Realms,\nA realm apart—where mortals ask of the heavens above heavens.\n\n**Hall of the Jade Emperor**\nDouble brightness, resplendent and upright, stands the solemn gate,\nGolden towers where gods and men share dual supremacy.\nLord of all directions, vassal of the six harmonies,\nManifest or hidden, he governs the cosmos alike.\n\n**Hall of the Dark Emperor**\nPalaces stern and solemn, the cavern-heaven stands,\nPeaks encircle the verdant ranks of immortals.\nMajestic the throne, aligned with the Pole Star,\nCountless spirits and men bow before the imperial presence.\n\n**Hall of Illuminated Perfection**\nFrom the Primordial Beginning, how many incarnations have come?\nTwice born of parents to shape the cosmos.\nWithin the celestial palace, familial rites unfold,\nThe divine parents of the upper realms—Emperor and Empress—revered.\n\n**Hall of Peng’s Perfection**\nThree Heavens, fourteen sages arrayed in ranks,\nMerits and virtues resplendent, the universe inquires.\nGolden towers manifest incarnations to open the imperial seat,\nA celebration of wind and clouds on Wu Dang Mountain.\n\n**Pavilion of the Seven Emperors**\nOne by one, they emerged from the primordial chaos,\nFrom Jade Clarity to Dark Heaven in succession.\nIn heaven, Yao and Shun, Tang, Wen, and Wu,\nAll authors like the sages of old.\n\n**Hall of the Osmanthus Register**\nOffices linked to the prime minister, overseeing Wen Chang,\nAccumulated deeds of the worthy shine with imperial favor.\nHere, one ascends into the lunar palace,\nHigh branches sway, stirring incense through the nine heavens.\n\n**Hall of the Primordial Emperor**\nThe Three Clarities’ aides govern the Mysterious Origin,\nBonded in golden orchid virtue, two sages.\nSevenfold emanations share in the unfolding transformation,\nEven the Heaven of Móyí is a Heaven of Great Harmony.\n\n**Hall of the Three Mao Perfected Lords**\nFrom Red City’s games, riding dragons they came,\nBrothers united, descending from the imperial terrace.\nTheir glory outshines the western ranks,\nMasters of the golden towers, leaning against the sky.\n\n**Pavilion of the Five Dragons**\nFlanking the sun, they welcome the imperial ascent,\nRewarded for merit, they know to soar.\nAdorned in resplendent hues of golden scales,\nThey rise to the highest tier of the Lingyan Pavilion.\n\n**Hall of Thunder**\nThe cavern-abyss, abode of the Thunder Marshal,\nHis thunderous roar subdues ten thousand demons.\nGathering his divine might into his grasp,\nMajestic yet not fierce, he commands solemn ranks.\n\n**Hall of Marshal Zhao of the Thunder Bureau**\nFormerly Deng Yue, king among ghosts,\nHe subdued the capital’s west, guarding ancient Xiang.\nWind and rain he brought under the Dark Emperor’s command,\nNow he oversees all as Heaven’s gatekeeper.\n\n**Hall of Marshal Meng of the Thunder Bureau**\nOnce his ambition lay in the Central Plains,\nCrushing Cai, vanquishing Jin for the Yuan.\nHeaven feared thunder’s wrath would lack oversight,\nSo the Three Heavens entrusted him with universal grace.\n\n**Well of the Five Dragons**\nIn the first year of Han’s rise, they gathered as stars,\nA gushing spring formed a pool around the shrine’s courtyard.\nOne by one, they soared into the heavens,\nThe earth’s veins fragrant and sweet, eternally sacred.\n\n**Shrine of the Five Hundred Divine Officials**\nCountless spirits and men revere Dark Heaven,\nFive hundred hold offices, each with their duties.\nIn two ranks, they pivot like the wind,\nLike Gao, Kui, Ji, and Qi—Yao’s worthy ministers.\n\n**Bell Tower**\nA pillar upholding the sky, beams like a rainbow,\nIts whale-like resonance vast and resonant.\nStruck in proper measure, it harmonizes all,\nGolden tones and jade vibrations resound through the nine heavens.\n\n**Cloud-Stepping Tower**\nNeither mist nor smoke at its loftiest height,\nNinefold rosy clouds envelop its joyous glow.\nThe first tier of the \"Morning to the Origin\" ascent,\nJade bamboo ranks arrayed in the azure heavens.\n\n**Office of Merit and Virtue**\nThe Heavenly Official of Recorded Goodness holds his post,\nLowly officers tend incense and fire as extraordinary merit.\nThose who fulfill the three thousand deeds,\nEach scroll inscribed in golden script on jade tablets.\n\n**Hall of Sea and Mountain**\nWithin the grotto-palace, another grotto-palace unfolds,\nAll under heaven becomes a single Penglai.\nMist drifts, rain hats, wind and clouds gather,\nNone but immortals may come here.\n\n**Position of the Director**\nA model of the upper realms, governing all immortals,\nA small replica of the balance, leading the multitude of worthies.\nSeated, the Venerable Lord presides over the Jade Bureau,\nOverseeing the world’s cavern-heavens.\n\n**Position of the Deputy Palace Master**\nTo protect and to teach, the Dao’s essence is one,\nSages and perfected alike rely on Heaven’s work.\nHeart to heart, they aid like the Duke of Zhou,\nThis is the sacred altar’s Shao Gong.\n\n**Hall of the Perfected Officials**\nAiding the upright, expelling evil, banning misfortune,\nTheir duties stern, they govern and guard the shrine.\nEnticing our pines and cassias to mock the clouded ravines,\nIn their sleeves, memorials to present beside the Emperor.\n\n**Refectory**\nFlavors sate the cloud kitchens, nurturing the qi’s origin,\nIncense ladles and dew bowls stir coiled dragons.\nWithin the cinnabar field, golden millet grains,\nEach a grain of the immortal’s elixir of agelessness.\n\n**Realm of Purple Clouds**\nIncarnations manifest to transform the mortal realm,\nOriginally celestial perfected ones from the heavens above.\nRecreating Wu Dang’s three grotto-palaces,\nLike Penglai and Yingzhou, arrayed among the sea’s three mountains.\n\n**Ancestral Hall**\nThe Dao’s lineage transmitted, generations radiant,\nMany immortal souls dwell in the land of white clouds.\nFilial piety drifts, incense curling,\nA single wisp of fragrance connects earth and heaven.\n\n**Shrine of the Pacification Commissioner**\nDescendant of Mount Tai’s later generations, a neighbor to old ministers,\nA man of the immortal mountains’ assemblies.\nWith an iron spine, master of merit and virtue,\nHis heart, aged in the Dao, abides among the lofty perfected.\n\n**Hall of the Venerable Elders**\nSated by Tang’s sun and moon, the old man of Fragrant Mountain,\nProud through Han’s cosmos, the immortal of Lingzhi Ridge.\nAuspicious gatherings of wind and cloud encircle the seats,\nCarefree through past and present, in the stillness of heaven.\n\n**Official Hall**\nBrilliant as the morning sun, phoenix banners alight,\nDirecting ranks in precise order, they offer birthday blessings.\nAt the northern gate of heaven’s opening,\nA thunderous \"Long live!\" resounds, robes and crowns solemn.\n\n**Hall of Pure Heart**\nSteady as a moored empty boat, a nest of peace,\nHow could mountain forests know of wind and waves?\nA pool of still water clarifies the heart,\nEmbracing cloudless vastness, the universe at ease.\n\n**Daoist Chant of Worldly Toil**\nWild horses and dust disturb the vulgar green,\nYet among the lowly, noble immortals remain.\nFragrant springs by the thousands, clouds by the mile,\nBy day they plow clouds, by night they draw from the spring.\n\n**Eternal Legacy of Perfection**\nClearing thorny brambles to open the sacred altar,\nWith empty hands, they built a house of gold.\nA thousand years of blazing incense,\nA heart of iron and stone, steadfast in revival.\n\n**Responding to Immortal Journeys**\nSeveral handfuls of celestial script, fragrant with rain and dew,\nWind and thunder held in the palm’s center.\nThe sword’s sheath shed, the immortal soul departs,\nStill dreaming of riding the simurgh into the imperial realm.\n\n**Hermitage of Soaring Emptiness**\nMelted warmth, serene and gentle,\nA cavern vast as Zhuangzi’s chamber of great emptiness.\nThe Mysterious Teaching and Confucianism span heaven and earth,\nBoundless wind and moon grace the courtyard’s grass.",
      "overlap_context": "thday Celebration and Homage**\nTen thousand sincere hearts for ten thousand sagely perfected,\nWhere is there a place incense is not offered in person?\nYear after year, spring months like a bustling market,\nFrom the sea’s edge to the sky’s end—people come.\n\n**Celestial Palace**\nA treasure mountain suspended, far from worldly clamor,\nHigh in the ninefold heavens, and ninefold again.\nPavilions and towers newly adorned with five-colored clouds,\nThe Three Clarities, three realms—all in carefree ease.",
      "start_char": 1405,
      "end_char": 2812,
      "start_sentence": 104,
      "end_sentence": 205,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 46.17168378829956,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\武当纪胜集.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "月庵 八窗一样玉玲珑，放大光明此性中。 皎皎万山天不夜，全家住在桂华官。 白雪庵 长年境界住瑶华，鹤氅交辉六出葩。 清夜更添香满屋，四围锄月种梅花。 云山书隐 治平大学大勋庸，寓在明明德性中。 出岫略施肤寸用，饱藏时雨待束风。 讲师函丈 再抽关钥启颛蒙，学漆园翁河上公。 洞府藏身人不见，藏心更在六经中。 五龙顶 宝盖擎空节节抛，飞楼涌殿碧云动。 分明烟雾中头角，一振星峰乾一爻。 天池 绝顶峰高几万寻，银演注水庆源深。 早为四海苍生计，火日如焚便作霖。 上龙池 第一泉高际碧穹，中藏神物养威雄。 时来帝命苏霖雨，先下天边海若宫。 黑龙潭 渊底潜鳞且垫踪，坎宫纯水养神功。 恩波满注高峰顶，四海风云在此中。 炼丹池 先天祖气久胚浑，炉鼎阴阳更互根。 滴滴金膏仙造化，半泓泉坛有天门。 金鼎峰 耳铉规模三足形，俨然九牧铸初成。 帝家重器传千古，柱地承天镇八弦。 金锁峰 妖魔牢锢铁邓都，更炼精刚禁逆徒。 雾绕烟围添馆钥，两问清肃一邪无。 龙庙 一身造化挟风霆，受用炉烟杳气形。 听候九天符命到，八荒霖雨卷沧瞑。 六甲峰 天绉万亿众威灵，奉劫分曹斓帝庭。 显现震束阳木位，将军戈甲立真形。 六丁峰 炎炎阴火赫真精，爻列云端耀日明。 几檄八公山草木，号风吼雨震天声。 迭字峰 苍颉神通造化灵，云章凤篆切生成。 层层又似磨崖颂，摸写中天日月明。 三公岩 云头一品列崇冈，气象尊严坐庙堂。 开阖风雷神变化，经邦论道理阴阳。 九卿岩 两问气数属阴晴，轩豁云房琐闯青。 大小诸峰端笋坐，宛然面棘位王庭。 中质峰 格样桓圭立正班，群山霞佩列回环。 分明人在朝元殿，面抱天光近圣颜。 大笔峰 撑天柱地管城君，脱颖缄封五色云。 一纸青霄供翰墨，星辰日月炳乾文。 中笔峰 第二中山振姓毛，子孙收拾总英豪。 大书德行安银管，揭在云头甲第高。 读书岩 六经未作用先存，玄教仍从此入门。 中有玉虚师相位，赞襄天上帝王尊。 千丈峰 五倍参天蜀相高，乔松碟诃怒风号。 撑擎宇宙西南盖，一柱巍巍奠极鳌。 五总山 天上连珠列宿精，人问政府位朝廷。 常真现出神龟象，宇宙中问统气形。 小笔峰 谁制纤毫顿碧云，王家无用草书人。 仙舫拟写笺天表，翰染浮香达紫宸。 师子峰 山顶岩巉耸具瞻，兽中王者势尊严。 秋风草木金毫动，万怪嗥狐总伏潜。 中鼻峰 相尽群山面目妍，当心大贵准隆然。 台头两孔撩天坐，透顶熏香玉陛前。 香炉峰 岭头日暖瑞生烟，金兽浓熏介寿年。 帝造无私公四海，寿家寿国寿人天。 竹筱峰 秆荀行鞭出草茸，岭高丛矮蘸烟浓。 长房选取为仙杖，投葛陂中也化龙。 桃溪道域 渔郎今度访云关，髻霏仙源在此问。 人向玉京天上去，蜕函空镇剑文班。 桃源洞 天香泛作武陵春，山自多仙岂为秦。 圣代子孙均介寿，衣冠那更是秦人。 紫盖峰 山光闪烁暮烟凝，高罩鳜棱最上层。 帝辇在天闲彩仗，凌霄想见旧飞腾。 大莲峰 君子亭亭样一般，根株阔远万山盘。 花开十丈如船藕，泰华峰头至小看。 小莲峰 玉井移来藕子孙，那资雨露发生春。 他时借与菩提座，结束西方一圣人。 标子坡 地产英华剩土芬，山灵萃作果中珍。 秋风颗颗金丹熟，待与蟠桃寿帝君。 落帽峰 挂却尘冠住岭云，一头改便旧精神。",
      "translated_text": "**Moon Hermitage**\nEight windows alike in jadelike clarity,\nRadiant light expands within this nature.\nBright as ten thousand mountains beneath an endless night,\nThe whole family dwells in the Osmanthus Palace.\n\n**White Snow Hermitage**\nA realm of eternal splendor, home to jade blossoms,\nWhere crane-feather robes gleam with six-petaled snowflakes.\nOn clear nights, fragrance fills the house anew,\nAs moonlit hoes till plum blossoms round its walls.\n\n**Cloud Mountain’s Reclusive Scholar**\nGreat merit of governance, vast as the cosmos,\nResiding in the luminous virtue of one’s nature.\nEmerging from the peaks with but a touch of use,\nSated with timely rains, awaiting the binding wind.\n\n**Lecturer’s Study**\nAgain the locks are drawn to enlighten the unlearned,\nStudying like Zhuangzi of the marshes or the Old Master by the river.\nHidden within the grotto realm, unseen by men,\nYet the heart’s treasury lies deeper still in the Six Classics.\n\n**Five Dragons Summit**\nA jeweled canopy casts into the sky, link by link,\nFloating towers and palaces stir the azure clouds.\nAmid mist and haze, their forms stand clear—\nA single shake of the starry peaks stirs Qian’s first line.\n\n**Heavenly Pool**\nThe summit’s height ascends ten thousand fathoms,\nSilver streams pour forth, blessing the deep source.\nEarly on, it serves the world’s teeming multitudes,\nWhen the sun burns like fire, it becomes the saving rain.\n\n**Upper Dragon Pool**\nThe first spring rises to touch the azure vault,\nWithin it, a divine being nurtures its majestic might.\nWhen the time comes, by imperial decree, it brings timely rains,\nFirst descending beyond the heavens to the Sea God’s palace.\n\n**Black Dragon Pond**\nIn the abyss, the hidden scales lie concealed,\nThe Kan palace’s pure waters nourish its divine power.\nGrace flows to fill the highest peaks,\nWhere the winds and clouds of the four seas converge.\n\n**Elixir-Refining Pool**\nThe primal ancestral qi has long gestated in chaos,\nFurnace and cauldron, yin and yang intertwined at the root.\nDrop by drop, golden nectar forges immortal transformation—\nHalf a pool’s spring holds the gate of heaven.\n\n**Golden Tripod Peak**\nIts form shaped like an ear-ringed tripod,\nMajestic as the Nine Provinces’ first casting.\nThe imperial house’s treasured vessel, passed through ages,\nPillar of earth and heaven, anchoring the eight directions.\n\n**Golden Lock Peak**\nDemons and fiends imprisoned in iron Dengdu,\nRefined further into unyielding essence to restrain rebels.\nMist and haze swirl, sealing the gates,\nTwo realms purified—no trace of evil remains.\n\n**Dragon Temple**\nA single body holds the workings of wind and thunder,\nReceiving the alchemy of furnace smoke and ethereal form.\nAwaiting the nine heavens’ decree to arrive,\nIt rolls back the mists of the eight wilds in a deluge of rain.\n\n**Six Jia Peak**\nHeaven’s crumpled folds gather a hundred million mighty spirits,\nServing the kalpas, divided in ranks before the imperial court.\nManifesting in the east, the yang wood position,\nGenerals in armor stand revealed in their true forms.\n\n**Six Ding Peak**\nFiery yin flames blaze with true essence,\nHexagrams arrayed in the clouds, gleaming in the sun.\nSummoned by a few decrees, the grasses and trees of Bagong Mountain,\nRoaring winds and thunder shake the heavens.\n\n**Stacked Characters Peak**\nCang Jie’s divine craft, the magic of creation,\nCloud-script and phoenix-seal carve out existence.\nLayer upon layer, like cliffside eulogies,\nInscribed in midair, bright as sun and moon.\n\n**Three Dukes’ Crag**\nA first-rank cloud crowns the lofty ridge,\nIts majestic aura befits the temple hall.\nOpening and closing like wind and thunder, divine transformations,\nGoverning the realm, discoursing on the Dao of yin and yang.\n\n**Nine Ministers’ Crag**\nThe dual forces of fortune sway between clear and stormy,\nSpacious cloud chambers, their doors adorned with azure.\nAll peaks, great and small, stand like bamboo shoots,\nAs if arrayed in court, facing the royal throne.\n\n**Central Pillar Peak**\nA model of the Huan jade tablet, standing in proper rank,\nMountains in rosy sashes encircle it in formation.\nClearly, one stands in the Hall of Facing the Origin,\nEmbracing heaven’s light, near the sacred countenance.\n\n**Great Brush Peak**\nPillar of heaven, prop of earth, Lord of Yan City,\nIts tip freed from its sheath amid five-colored clouds.\nA single sheet of azure sky for calligraphy,\nWhere stars, sun, and moon illuminate Qian’s script.\n\n**Central Brush Peak**\nThe second of the Zhongshan clan, bearing the Mao surname,\nIts descendants gather, all heroes.\nInscribing virtue in grand strokes with a silver brush,\nRaised high in the clouds, first in rank.\n\n**Reading Rock**\nThe Six Classics existed before their use,\nYet the Mysterious Teaching still enters through this gate.\nWithin lies the position of the Jade Void’s master,\nAssisting the Heavenly Emperor, honoring the king.\n\n**Thousand-Fathom Peak**\nFive times loftier than Zhuge Liang’s towering height,\nAncient pines and cypresses roar in the howling wind.\nPropping up the cosmos as the southwest’s canopy,\nA single pillar, towering, anchors the turtle’s peak.\n\n**Five Summits Mountain**\nCelestial pearls arrayed as stellar essences,\nIn the human realm, they form the court’s positions.\nEver true, manifesting the divine tortoise’s image,\nAmid the cosmos, they govern the qi’s form.\n\n**Small Brush Peak**\nWho wields the fine brush to pierce the azure clouds?\nThe royal house has no use for cursive scribes.\nThe immortal boat prepares to write memorials to heaven,\nInk tinged with floating fragrance, reaching the purple palace.\n\n**Lion Peak**\nAtop the crag, cliffs soar, commanding all gazes,\nKing of beasts in bearing, majestic and stern.\nWhen autumn winds stir the grasses and trees, golden hairs bristle,\nTen thousand monsters howl and cower in submission.\n\n**Central Nose Peak**\nSurveying all mountains, their faces fair,\nAt its heart, the great noble’s nose stands proud.\nTwo holes at the summit pierce the heavens,\nWafting incense before the jade steps.\n\n**Incense Burner Peak**\nAt the ridge’s crest, the sun warms, auspicious smoke rises,\nGolden beasts thickly perfume the years of longevity.\nThe Emperor’s creation knows no partiality, serving the four seas,\nBlessing the household, the nation, and all under heaven.\n\n**Bamboo Shoot Peak**\nSlender shoots push forth from the grassy tufts,\nTowering ridges, clustered low, dipped in dense mist.\nChang Fang chose them for immortal staffs,\nCast into Ge’s pond, they too became dragons.\n\n**Peach Brook’s Daoist Realm**\nThe fisherman now seeks the clouded pass,\nWhere the immortal’s spring lies coiled in mist.\nPeople ascend to the Jade Capital above,\nLeaving behind only the empty sheath of the sword’s inscription.\n\n**Peach Blossom Spring**\nHeavenly fragrance drifts like Wuling’s spring,\nThe mountain abounds with immortals—why blame Qin?\nIn this sagely age, descendants all enjoy long life,\nNo need for robes and caps to be those of Qin’s folk.\n\n**Purple Canopy Peak**\nMountain light flickers as evening mist congeals,\nCrowning the highest tier of palace eaves.\nThe imperial carriage lingers in the heavens, its regalia idle,\nSoaring above, one recalls its former flight.\n\n**Great Lotus Peak**\nA gentleman’s upright form, peerless,\nIts roots spread wide, entwining ten thousand peaks.\nWhen the flower blooms, ten yards wide like a boat’s oar,\nEven Mount Tai and Hua seem small by comparison.\n\n**Small Lotus Peak**\nTransplanted from the Jade Well, lotus descendants,\nNurtured by rain and dew to bring forth spring.\nOne day, it will be lent to the bodhi seat,\nTo adorn the Western Quarter’s sacred one.\n\n**Seeded Slope**\nThe earth yields its finest essence, the soil rich with fragrance,\nMountain spirits gather to form treasures among fruits.\nWhen autumn winds come, golden elixir ripens,\nAwaiting to join the peaches in blessing the Lord Emperor.\n\n**Falling Hat Peak**\nDiscarding the dusty cap to dwell among ridge clouds,\nA single change restores the old spirit.",
      "overlap_context": "Responding to Immortal Journeys**\nSeveral handfuls of celestial script, fragrant with rain and dew,\nWind and thunder held in the palm’s center.\nThe sword’s sheath shed, the immortal soul departs,\nStill dreaming of riding the simurgh into the imperial realm.\n\n**Hermitage of Soaring Emptiness**\nMelted warmth, serene and gentle,\nA cavern vast as Zhuangzi’s chamber of great emptiness.\nThe Mysterious Teaching and Confucianism span heaven and earth,\nBoundless wind and moon grace the courtyard’s grass.",
      "start_char": 2813,
      "end_char": 4231,
      "start_sentence": 206,
      "end_sentence": 309,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 45.79062366485596,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\武当纪胜集.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "天风也卷乌纱去，端冕趁朝拜紫宸。 紫芥云峰 仙家法雨起蓬莱，肤寸悠然遍九垓。 天下山川之所出，一时庆会此中来。 三斗岩 鼎分石窍枕崔鬼，对月何人共一杯。 莫是汝阳酣醉日，朝天留下酒壶来。 藏云岩 从龙虽好且潜踪，五色光韬绣谷中。 纵是有心休出岫，一天时雨待春风。 大明山 圣境纯阳粹毓乾，祥光焕发四无边。 匪朝匪夕乾坤别，常是中街正午天。 搓牙峰 突如古木枕嵯峨，春到生生意亦多。 斫取一枝雷吏斧，也同仙客上天河。 聚云峰 瑞气浮空以类从，帝真乘驾是神龙。 异香蓊郁灵山顶，万圣来朝天九重。 朱砂岩 造化炉丹炼逼真，养成火树艳精神。 仙家碎入黄金碾，宇宙回阳物物春。 眉棱山 古之吏隐可廉顽，芝宇分明元鲁山。 怒见元规尘满面，撑开双眼看人问。 伏魔峰 咫尺天门已化鱼，以潜为跃且舒徐。 隆中不必求丞相，诸葛今来此地居。 俞公岩 山翁爱杀碧山栖，郡是河问振紫芝。 背负河图神易去，想从上古访抱羲。 鹦呜峰 凡羽成仙住碧云，占高地步越超群。 洞天之晓先天下，器大声闳举世闻。 常春岩 满谷仙花锦绣庄，四时不断九天香。 帝真充拓生生造，一粒丹回宇宙阳。 独阳岩 分晓先天已画图，山山艮象易规模。 畜之火者其天大，骨力纯阳别个无。 宠门山 买桂供薪到岭尖，烟楼可撞耸群瞻。 汉王到此衣曾燎，热起中天火德炎。 手爬山 水浅蓬莱云路遥，群仙来此驾天桥。 同时高展麻姑爪，攀到峰头是碧霄。 尹喜岩 道之所隐即仙灵，心印函关道德经。 不待叩州乘鹤去，此山仙已是天庭。 健人峰 坚亥雄奔步九州，向前开辟几千秋。 断鳌怒见共工触，顶住天西北角头。 外云岩 出山失脚偶从龙，施雨归来睡思浓。 且放希夷伸四体，不愁梦不到商宗。 云雾岩 隐豹藏龙瑞气蒸，真仙同此宅真灵。 飕车来往无形表，想有楼台混杳冥。 滴水岩 密敲金锁溜星河，好在垂银一线多。 不是为霖牢闭钥，琳崖转石起风波。 大青羊涧 水脉应连洛洞中，满溪怪石是痴龙。 地仙九馆知非远，根境来朝天九重。 小青羊涧 洞庭放牧怨终身，龙女虽神未入神。 洁己驱来求证果，片心刚化石邻邻。 歇仙岩 御气乘风遍万天，众真日夕走云耕。 暂停坷佩瑶华洞，列坐飞觞玳瑁筵。 早蠢峰 玄天镇古肃天威，绝顶高张黑杀旗。 不假大神双臂力，风云四面永撑持。 希夷岩 仙家妙法得心传，梦饱烟霞伴脚眠。 推枕起观天下事，和云移榻华山巅。 乱石峰 初平深入碧烟霞，遗下羊群几岁华。 本体若经仙点化，慢山光焰总丹砂。 仙倡岩 烟霞老友友烟霞，弄月吟风共一家。 大顶顶头天路近，往来同驾五云车。 玉仙岩 金鼎从教龙虎蟠，仙方松柑是心丹。 洞门一旦云开钥，万里飞昤宇宙宽。 伏魔峰 峭壁青高石剑钻，帝真劫命镇灵坛。 龙泉锁向金莲匣，不耀光芒鬼胆寒。 阳和峰 一树灵芽顿紫烟，土膏日暖盎蓝田。 道人元气春生裹，满坞白云耕午天。 云霞观 几道金光问色鲜，颉顽飞佩万神仙。 五龙无着班联处，别创寥阳一洞天。 龙池 半泓停蓄禹门涛，地位安排庆会遭。 待得九霄雷霹雳，一头直上碧云高。 雷洞 保毓先天复地阳，天君跨定玉龙藏。 其中运动乾坤轴，一勺灵泉雨八荒。 南岩改天乙真庆万寿宫 开启天藏拓圣疆，纯阳仙占地纯阳。 云霞玉彩非人世，照满寰区焰焰光。",
      "translated_text": "**Heavenly Wind Peak**\nThe heavenly wind sweeps away the black gauze cap—\nDonning court robes, he hastens to the purple court to pay homage.\n\n**Purple Mustard Cloud Peak**\nThe immortals’ dharma-rain rises from Penglai,\nSpreading inch by inch across the nine realms.\nAll mountains and rivers beneath heaven emerge from here,\nGathering in this moment of celestial celebration.\n\n**Three Dou Rock**\nThe cauldron’s stone clefts cradle towering crags—\nBeneath the moon, who shares a cup with me?\nCould this be the day Prince Ruyang drank to excess,\nLeaving his wine gourd behind on his way to court?\n\n**Hidden Cloud Rock**\nThough riding the dragon is fine, remain concealed,\nFive-colored light veiled within the embroidered valley.\nEven with intent, do not leave the mountain’s embrace—\nAwait the timely spring rains borne on the wind.\n\n**Great Bright Mountain**\nA sacred realm of pure yang, nurturing Qian’s essence,\nAuspicious radiance shines boundless in all directions.\nNeither dawn nor dusk—here, heaven and earth differ,\nFor it is ever the midday sun at the central street.\n\n**Twisted Tooth Peak**\nAbrupt as an ancient tree rooted in jagged heights,\nSpring’s arrival brings forth teeming life.\nHew a branch with the thunder spirit’s axe,\nAnd ascend with the immortals to the Milky Way.\n\n**Gathering Cloud Peak**\nAuspicious vapors float in kindred formation,\nThe Celestial Perfected ride upon divine dragons.\nExotic fragrance billows atop the numinous peak,\nAs ten thousand sages come to pay homage to the nine-tiered heavens.\n\n**Cinnabar Rock**\nThe alchemical furnace refines the elixir to perfection,\nNurturing a fiery tree of radiant spirit.\nThe immortals crush it in a golden mortar,\nAnd the cosmos revives—all things bask in spring’s yang.\n\n**Brow-Ridge Mountain**\nAn ancient reclusive official, upright and incorruptible,\nHis dwelling as luminous as Yuan Lu Mountain.\nEnraged to see Yuan Gui’s face dust-laden,\nHe widens his eyes to question the world.\n\n**Subduing Demons Peak**\nThe heavenly gate, a mere footspan away, has transformed into a fish—\nYet it leaps with ease, moving in unhurried grace.\nThere is no need to seek the Chancellor in Longzhong,\nFor Zhuge now dwells here in this place.\n\n**Master Yu’s Rock**\nThe mountain elder adores dwelling in emerald peaks,\nHis domain by the rivers nurturing purple lingzhi.\nBearing the *Hetu* in his back, the divine *Yi* departs,\nPerhaps he has journeyed since antiquity to seek Fu Xi.\n\n**Parrot Peak**\nA mortal bird, now immortal, dwells in azure clouds,\nClaiming a lofty perch far above the common throng.\nAt the break of dawn in the grotto-heaven, it precedes the world,\nIts great vessel and resounding voice known across the earth.\n\n**Ever-Spring Rock**\nThe valley brims with immortal blossoms, brocade-lush,\nTheir fragrance unbroken through the four seasons, celestial sweet.\nThe Celestial Perfected expand life’s boundless creation—\nA single grain of elixir revives the cosmos’ yang.\n\n**Solitary Yang Rock**\nAt first light, it sketches the precelestial design,\nEvery mountain embodying the *Gen* trigram’s form.\nThose who cultivate fire—how vast their heaven!\nTheir bone and power, pure yang, are unmatched.\n\n**Favor Gate Mountain**\nPurchasing cassia to fuel the stove at the summit,\nSmoke towers rise, commanding the gaze of all.\nWhen the Han king arrived, his robes caught flame,\nIgniting the mid-heaven’s fiery virtue.\n\n**Hand-Climbed Mountain**\nThe waters are shallow, Penglai’s cloud-path distant,\nYet immortals gather here to ride the heavenly bridge.\nTogether, they stretch out Ma Gu’s claws,\nClambering to the peak’s crest—there lies the azure sky.\n\n**Yin Xi’s Rock**\nWhere the Dao conceals itself, immortals abide,\nThe heart-seal at the Han Pass, the *Dao De Jing*.\nNo need to knock on the gate and ride a crane away—\nThis mountain’s immortals are already in heaven’s court.\n\n**Stalwart Man Peak**\nJian Hai strides boldly across the nine provinces,\nFor millennia, he has stood at the vanguard of creation.\nEnraged, he severs Ao’s legs, clashes with Gong Gong,\nBracing the northwest corner of the sky.\n\n**Outer Cloud Rock**\nLeaving the mountain, he stumbles into dragon-riding,\nReturning from rain-bestowing, his sleep is deep.\nLet Master Xi Yi stretch his limbs at ease—\nNo worry his dream will fail to reach the Shang lord.\n\n**Cloud-Mist Rock**\nHidden leopards, concealed dragons, auspicious vapors rise,\nTrue immortals dwell here, their spirits at home.\nTheir carriages come and go without form,\nOne imagines pavilions merging with the ethereal void.\n\n**Dripping Water Rock**\nThe golden lock taps softly, channeling the Milky Way,\nA silver thread hangs, abundant and fine.\nNot to withhold the rain’s key in stubborn closure—\nThe jade cliffs shift, stones stir, winds and waves arise.\n\n**Great Green Sheep Gully**\nThe water’s pulse connects to the Luo Grotto,\nThe stream brims with strange stones—torpid dragons.\nThe earth immortals’ nine halls are not far,\nTheir root-realm comes to pay homage to the nine-tiered heavens.\n\n**Small Green Sheep Gully**\nThe Dongting shepherd resents his lifelong duty,\nThough the dragon maiden is divine, she has not attained true spirit.\nPurifying himself, he drives them forth to seek enlightenment,\nYet his steadfast heart turns to stone, neighbor to stone.\n\n**Resting Immortals’ Rock**\nRiding qi and wind, they traverse the ten thousand heavens,\nThe assembled Perfected till the clouds by day and night.\nPausing their jade pendants in the Jasper Flower Grotto,\nThey recline at a feast of flying cups on a tortoiseshell mat.\n\n**Early Worm Peak**\nThe Dark Heaven’s ancient might commands awe,\nAt its summit, the Black Killer’s banner flies high.\nNo need for the great god’s twin arms—\nThe winds and clouds on all sides sustain it forever.\n\n**Master Xi Yi’s Rock**\nThe immortals’ wondrous method is transmitted heart-to-heart,\nDream-sated on mist and rosy clouds, he sleeps with the peaks.\nPushing aside his pillow, he surveys the world’s affairs,\nThen moves his couch amid the clouds to Hua Mountain’s crest.\n\n**Scattered Stones Peak**\nChu Ping delves deep into azure mists,\nLeaving behind his flock of sheep for years.\nIf their true nature were touched by immortal alchemy,\nThe slow mountains’ glow would all turn to cinnabar.\n\n**Immortal Singers’ Rock**\nMist and rosy clouds—old friends to one another,\nPlaying with the moon, chanting to the wind, they share a home.\nAtop the great summit, the heavenly path draws near,\nThey come and go together in five-colored cloud chariots.\n\n**Jade Immortal Rock**\nThe golden crucible tames coiling dragons and tigers,\nThe immortal’s recipe—pine and citron—is the heart’s elixir.\nWhen the grotto gate’s lock opens to the clouds,\nA myriad miles of flying cranes widen the cosmos.\n\n**Subduing Demons Peak**\nSteep cliffs, verdant heights, stone swords piercing the sky,\nThe Celestial Perfected’s karmic mandate guards the sacred altar.\nThe Dragon Spring is sealed within a golden lotus casket,\nIts unshining radiance chills the demons’ hearts.\n\n**Yang Harmony Peak**\nA single sacred sprout stirs purple mist,\nThe earth’s essence warms, lush as Lantian’s fields.\nThe Daoist’s primordial qi is wrapped in spring’s rebirth,\nThe entire valley plows white clouds at noon.\n\n**Cloud-Rosy Abbey**\nSeveral strands of golden light, their hues resplendent,\nJade pendants flutter as ten thousand immortals descend.\nWhere the five dragons alight in ordered ranks,\nA new, secluded grotto-heaven of vast yang is created.\n\n**Dragon Pool**\nHalf a deep pool stilled, brimming with Yu Gate’s waves,\nIts location ordained for a celestial gathering.\nAwaiting the nine heavens’ thunderous roar,\nIt will surge straight up to the azure clouds.\n\n**Thunder Grotto**\nNurturing the precelestial, restoring earth’s yang,\nThe Heavenly Lord rides the jade dragon in concealment.\nWithin, the axis of heaven and earth turns,\nA single ladle of numinous spring rains the eight wilds.\n\n**Southern Rock (Renamed: Celestial Yi’s True Blessing, Longevity Palace)**\nUnlocking heaven’s treasury, expanding the sacred realm,\nPure yang immortals occupy pure yang’s domain.\nClouds and rosy mists, jade hues—beyond the mortal world,\nTheir radiant flames illuminate the entire earth.",
      "overlap_context": "s,\nNurtured by rain and dew to bring forth spring.\nOne day, it will be lent to the bodhi seat,\nTo adorn the Western Quarter’s sacred one.\n\n**Seeded Slope**\nThe earth yields its finest essence, the soil rich with fragrance,\nMountain spirits gather to form treasures among fruits.\nWhen autumn winds come, golden elixir ripens,\nAwaiting to join the peaches in blessing the Lord Emperor.\n\n**Falling Hat Peak**\nDiscarding the dusty cap to dwell among ridge clouds,\nA single change restores the old spirit.",
      "start_char": 4231,
      "end_char": 5649,
      "start_sentence": 310,
      "end_sentence": 412,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 45.730647802352905,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\武当纪胜集.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "洞渊丈室 手握风霆立教门，神人混合策奇勋。 擎空楼阁身撑拄，现世冲升藏岭云。 甘露泉 玉井渊深浸碧漪，帝真元日炼丹池。 水香万古皆天酒，愿脱沉愈饮一卮。 天桥 悬崖飞瀑到峰腰，初入修真已九霄。 人亦架空联阁道，瞻前畦步万程遥。 南岩三殿 圣帝西班圣友束，圣尊父母位居中。 左盘右绕香云蓊，天乙紫微真庆宫。 南岩真官祠 大顶当前耸具瞻，溪山环翠面峰尖。 武当奇绝中奇绝，起眼天真在屋檐。 又前真官祠 万壑千崖萃秀英，庄严元不待仪形。 莫言真有神明在，土木无灵也炳灵。 南岩海汇 锺鼎何如水火炉，贵人喜舍入玄都。 祖师约会传心印，各付升仙受命符。 住持仙隐 金渊玉海涨文涛，八月天风驾海高。 豪气收藏云壑裹，只从仙岛跨金鳌。 试心石 天下人情自险铁，神全境界定平夷。 坦然履道虚岩小，万丈高深不是危。 飞升台 陆降精神久帝前，有形未是道真玄。 层岩抛却尘躯体，六合周行宰万天。 谢天地岩 暂感穹祇不脱声，悬崖根底达天庭。 稳藏蜕骨方轻举，自在神游侍玉清。 万户谷 仙屋纵横满翠蓬，岭云探锁碧重重。 洞中天地元来阔，封邑人家尽可容。 牛漕涧 老君昔日度函关，青犊曾骑过此问。 今次出图龙马现，道人玩易弄潺湲。 青羊涧 千载吟香说谢池，西堂一句梦中诗。 托根苹藻来供祭，超入王风古盛时。 皇崖峰 地拔重坤易静专，道言上应大安天。 瓤棱金爵盘金阙，非有非无广漠边。 显定峰 不教大噫撼乾枢，泰宇光生静境虚。 直下流形标艮岳，极风天上五云居。 下天门峰 三境逍遥大顶头，高高引盼五云浮。 鸿开第一层初上，如到玉京十二楼。 天门峰 下瞰洪崖上碧苍，心无职睑乃康庄。 九天间阖当头近，一转身来侍玉皇。 中天门峰 第一关疑帝者居，烟霞缥缈翼琼瑭。 登蚪踞虎攀巢鹊，挟得飞仙步碧虚。 钻天五里 攀几层崖上翠翘，只消半堠可逍遥。 台头穿透虚岩窍，一饷时问到碧霄。 飞升台 宝山绝顶有天宫，炉鼎层成小华嵩。 四十二年梯级到，唱鸾啸凤彩云中。 上天门 最上关头又进程，第三重在九霄行。 身高日月低云雾，更有何天是玉清。 大顶 天柱巍巍大武当，千崖万壑众尊王。 干天圣道尤高峻，独帝玄天相玉皇。 大顶圣坛 孤峰绝处凛威严，四海抬头耸具瞻。 十万里光神目电，真灵萃在五云尖。 王母宫 斗布乔松蓊翠寒，瑶池宴后驾青鸾。 蟠桃换骨蟠仙阙，就便年年祝万安。 击马峰 待诏金门陆翠微，玉聪停驻踏朝晖。 划然云路牵骇骥，得意朝天去似飞。 望州峰 帝先天地宅均阳，启圣乡如父母乡。 每一上心登绝顶，万年燕寝护凝香。 紫霄峰 翼翰摩肩石耸楼，俯观平地五云浮。 烟霞窟宅如开凿，荡荡玄天在裹头。 紫霄岩 高倚纵霄枕斗魁，栖真乐地绣苍苔。 仙家唤作天宫阙，那见人问风日来。 太清岩 大赤天居杳霭中，地仙那得过刚风。 奠形别向云山顶，幻出朝元道德宫。 紫霄仁圣宫 圣师指引宅穹高，四合云峰涌翠涛，乾位当阳端鲔座，方瀛海上跨金鳌。 风雷秘府 祖师心印阁青冥，震巽威行走万灵。 登紫霄峰亲领受，此身天界一枢庭。 灵虚岩 肩牖玲珑日月双，谁笼杳霭下洪厉。 人心方寸神明舍，天上玉堂云雾窗。 紫虚宫 建楚灵坛阐化初，祠庭想见大规模。 空中楼阁空遗迹，安得如天复圣图。",
      "translated_text": "**Grotto-Abyss Meditation Chamber**\nHand grasping wind and thunder, he establishes the teaching’s gate,\nDivine and human merge to devise wondrous merit.\nLofty pavilions pierce the sky, his body bears the weight,\nIn this world’s ascension, he conceals the clouds of the ridge.\n\n**Sweet Dew Spring**\nJade well’s abyss, deep with rippling green,\nThe Celestial Perfected’s primordial sun refines the elixir pool.\nIts waters, fragrant through the ages, are all celestial wine—\nMay the drowned be cured, drinking but a single cup.\n\n**Celestial Bridge**\nFrom the hanging cliff, cascades plunge to the peak’s waist,\nEntering cultivation here, one already soars the nine heavens.\nHumans too build suspended walkways linking towering halls,\nGazing ahead, each step spans ten thousand leagues.\n\n**Three Halls of Southern Rock**\nThe Sage Emperor’s western retinue, the Sage Friends gather,\nThe Sacred Parents’ throne stands at the center.\nLeft and right, incense clouds coil and billow,\nThe Celestial Yi’s Purple Tenuity True Blessing Palace.\n\n**Shrine of the Southern Rock Perfected**\nThe Great Summit looms before all eyes,\nStreams and mountains encircle its emerald, facing the peak’s tip.\nWudang’s marvels, the marvel of marvels—\nAt first glance, the celestial Perfected dwell beneath the eaves.\n\n**Another Shrine of the Perfected**\nMyriad ravines and cliffs gather the essence of beauty,\nIts solemnity needs no ritual form.\nSay not that gods and spirits truly reside here—\nEven wood and earth, lifeless, radiate numinous power.\n\n**Southern Rock’s Sea Convergence**\nHow compare tripods to the furnace of water and fire?\nNobles joyfully offer alms, entering the Mystic Capital.\nThe Patriarch convenes to transmit the mind-seal,\nEach bestows the talisman of ascension and celestial mandate.\n\n**Abiding Immortal’s Reclusion**\nGolden abyss, jade sea swell with literary waves,\nThe eighth-month sky’s winds ride the ocean’s heights.\nHeroic qi gathers within clouds and ravines—\nFrom the immortal isles, he strides a golden turtle.\n\n**Trial Heart Stone**\nThe world’s human sentiments are treacherous as iron,\nYet when the spirit is whole, the realm is surely level.\nWalk the Way with ease, though the crags be hollow—\nTen thousand fathoms deep is no peril.\n\n**Ascension Terrace**\nFor long, his spirit descended before the Emperor,\nYet form is not the true mystery of the Dao.\nFrom the layered cliffs, he casts off his dust-laden body,\nRoaming the six directions, governing the ten thousand heavens.\n\n**Gratitude to Heaven and Earth Rock**\nMomentarily moved by the vault of heaven, speechless,\nFrom the cliff’s root, he reaches the celestial court.\nOnly when the shed bones are securely hidden does he lightly rise,\nFreely roaming as a spirit, attending the Jade Clarity.\n\n**Valley of Ten Thousand Households**\nImmortal dwellings stretch across verdant peaks,\nRidge clouds probe the locks of layered green.\nWithin the grotto, heaven and earth are vast from the start—\nA fiefdom’s households all find ample space.\n\n**Ox Ford Gorge**\nOf old, the Old Lord crossed the Hangu Pass,\nRiding a green ox, he passed this way.\nNow, as the Dragon-Horse appears in the revealed diagram,\nDaoists play with the *Yijing* by murmuring streams.\n\n**Azure Sheep Gorge**\nFor a thousand years, incense and verse recall Xie’s Pool,\nA single line from the Western Hall—a dreamt poem.\nRooted in duckweed and pondweed for offerings,\nIt transcends to the flourishing age of the royal *feng*.\n\n**Imperial Cliff Peak**\nThe earth’s weight shifts, yet it remains serene and focused,\nThe Dao’s words correspond above to the Great Peace Heaven.\nHollowed eaves and golden goblets encircle golden palaces,\nNeither existing nor void, at the vast desert’s edge.\n\n**Manifest Stability Peak**\nIt forbids the great yawn to shake heaven’s pivot,\nThe grand cosmos",
      "overlap_context": "**\nNurturing the precelestial, restoring earth’s yang,\nThe Heavenly Lord rides the jade dragon in concealment.\nWithin, the axis of heaven and earth turns,\nA single ladle of numinous spring rains the eight wilds.\n\n**Southern Rock (Renamed: Celestial Yi’s True Blessing, Longevity Palace)**\nUnlocking heaven’s treasury, expanding the sacred realm,\nPure yang immortals occupy pure yang’s domain.\nClouds and rosy mists, jade hues—beyond the mortal world,\nTheir radiant flames illuminate the entire earth.",
      "start_char": 5650,
      "end_char": 7057,
      "start_sentence": 413,
      "end_sentence": 513,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.46097230911255,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\武当纪胜集.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "紫虚岩 乾兑当阳最上峰，盘旋五万里来龙。 天开第一修真宅，丈席中问帝九重。 太和岩 万壑千崖朵秀奇，此中依旧古雍熙。 一区老氏春台地，长在唐虞盛际时。 太子岩 崖壑阴阴地杳冥，皇储挤得学仙灵。 冲升万古玄天帝，昔代君王几寿龄。 望云峰 出岫无心亦有之，乾坤普施八方维。 岩岩壑壑油然意，绝顶焚香坐看时。 翠云岩 世态纷纷变诈同，白衣苍狗顷时中。 青青一气浮千古，依约慈仁束极宫。 延长宫 金鼎丹空龙虎寒，此松虚老玲仙坛。 何时再敞蓬莱殿，望五云束祝寿安。 望顶峰 人品参差紫翠巅，众尊此地士希贤。 前峰第一贤希圣，却没出齐只有天。 复朝峰 满袖天香出禁门，喜同王母宴西昆。 依然恋阙丹心在，连趁班朝面至尊。 太常府 献纳司存日月边，夷夔礼乐舜班联。 白云官守白云洞，地在名山职在天。 佑圣府 掌天北极职天枢，北极枢庭职亦如。 奔走雷霆神号令，几多三界密文书。 元和迁校府 两问万类一均陶，列籍真仙合宠褒。 时若帝朝群考绩，玉京天上总夔皋。 天乙真庆宫 帝居坎上紫微垣，四海分灵万派源。 一脉太初生气水，万年雨露溥天恩。 威烈王庙 生世精严志慕玄，叨恩准劫护灵山。 寂无形响杳冥际，雷电风霆目睫问。 云窟庵 养晦灵山第几重，草庐牢闭又藏踪。 阴霾窝底深盘泊，约莫前身是五龙。 紫霄灵泉 半泓石下小山揪，海纵扬尘不绝流。 涓滴饱供千万众，神功普化几潭秋。 九渡涧 鹤驾遥遥去不还，储君仙向白云山。 溪流岂隔慈闱路，待到天宫面圣颜。 九波务 瑶华悬隔碧溪湾，几次垂光此水问。 一掬酿泉千日醉，新丰老客也童颜。 展旗峰 七岩星布耸瞻依，大蠢高牙拥六飞。 掘散之弥六合，举风偃雨赫天威。 千年艾 山有神灵草亦灵，一丸气力几参苓。 枝枝叶叶人司命，天在根头永寿龄。 万年松 天英地粹混蓬蒿，岂在掀昂耸汉高。 枯槁顷时回造化，风霜不老寿根牢。 金星石 气数纯刚妙合凝，西方太白瑞光腾。 流辉散得乾坤满，华岳其山宝藏兴。 银星石 曩同球镂贡梁州，留镇灵山最上头。 粒粒丹砂天下宝，祥光彻夜烛天浮。 松萝 万缕垂丝挂碧烟，几千年久尚翩蜷。 十分换得朝衣阔，金阙全身遍万天。 不空禽 道宗庄老学虚无，为善孳孳亦舜徒。 相彼乌分言外意，三千功行实工夫。 乌鸦 来梧台中效骏奔，纪官如凤职宾门。 朝天有客群呼报，领袖鹤班觐圣尊。 半部乐 太清雅奏世希音，非竹非丝五色禽。 韶舞平分群祝庆，来仪灵凤一般心。 我师禽 道无不在性存存，蠢动含灵必有尊。 职教之功同覆载，此身谁可外乾坤。 白雉鹦 羽衣纯碧益州神，东向灵山护圣真。 化作翔庭巢阁凤，翼扶帝辇上天津。 灵寿杖 乔松老骨谷神耆，太乙真精古杖菜。 免得孔光奸手污，住山岁数与天齐。 骞林树 七宝林中上界奇，枝枝翡翠叶琉璃。 若非大顶居天上，安得灵根独有之。 定心松 苍官天挺挟人豪，片石无根万丈高。 倚作泰山窥斗绝，擎空翠盖铁身牢。 云竹杖 全身赐紫晦林泉，当国持危是大贤。 世道康庄天步稳，葛翁礼请伴神仙。 天灯 阴崖绝壑溜淙淙，暮夜玲珑八面窗。 恍见九霄神变化，几枝光焰炯银缸。 石灯心 寸寸刚肠道体全，无穷光焰照无边。 兰膏不断烧难烬，万古人问是晓天。 黄精 苗带纯阳伴鹿眠，根头充实几经年。",
      "translated_text": "**Purple Void Crag**\nAt Qian and Dui’s sunlit highest peak,\nThe dragon-vein coils five myriad leagues.\nHeaven’s first abode for cultivating truth,\nA yard’s breadth holds ninefold imperial depths.\n\n**Great Harmony Crag**\nMyriad ravines and cliffs bloom in wondrous splendor,\nYet here remains the ancient harmony of Yong.\nA plot of the Old Master’s springtime terrace,\nEver abiding in the flourishing age of Tang and Yu.\n\n**Crown Prince Crag**\nCliff and ravine, dark and deep,\nThe royal heir pressed on to learn immortal arts.\nAscending through the ages as the Mysterious Heavenly Emperor,\nHow many kings of former dynasties matched his years?\n\n**Cloud-Gazing Peak**\nClouds drift from peaks without intent—yet they exist,\nHeaven and Earth bestow their grace to the eight directions.\nIn the towering ravines, a spontaneous joy arises,\nAt the summit, one burns incense and sits to watch.\n\n**Verdant Cloud Crag**\nWorldly affairs shift and twist with deceit,\nWhite robes and gray dogs change in an instant.\nYet a single green qi floats through the ages,\nVaguely recalling the Mercy Palace’s boundless reach.\n\n**Longevity Palace**\nGolden crucible, elixir void—dragon and tiger grow cold,\nThis pine, hollow with age, guards the immortal altar.\nWhen shall the Penglai Hall open once more,\nTo gaze at the five-colored clouds and pray for peace?\n\n**Summit-Gazing Peak**\nHuman worth varies on these purple-green heights,\nYet all revere this place where scholars seek worthiness.\nThe foremost peak aspires to sagehood,\nBut only Heaven stands beyond all comparison.\n\n**Return-to-Court Peak**\nSleeves filled with celestial fragrance, stepping from the palace gate,\nDelighted to join the Queen Mother’s feast in the Western Kunlun.\nStill, the heart clings to the court with loyal devotion,\nRushing to join the morning assembly before the August One.\n\n**Grand Constancy Office**\nOfferings and counsel dwell beside sun and moon,\nYi and Kui’s rites and music align with Shun’s ranks.\nThe White Cloud Office guards the White Cloud Grotto,\nIts earthly place in the sacred mountain, its duty in Heaven.\n\n**Protector-Sage Office**\nHolding Heaven’s northern pole, the office of the celestial pivot,\nThe Northern Pole’s pivot court bears the same charge.\nThunder and lightning rush forth at its commands,\nHow many secret scriptures of the Three Realms pass through?\n\n**Harmonious Relocation and Examination Office**\nTwo inquiries mold the myriad beings as one,\nThe registers of perfected immortals receive imperial favor.\nWhen the Celestial Court convenes to review merits,\nAll in Jade Capital Heaven answer to Kui and Gao.\n\n**Celestial Unity and True Felicity Palace**\nThe Emperor’s residence atop Kan, within the Purple Tenuity,\nThe four seas divide its spirit into ten thousand streams.\nA single pulse of primordial qi gives rise to living waters,\nTen thousand years of rain and dew bestow Heaven’s grace.\n\n**Martial Majesty King’s Temple**\nBorn with solemn resolve, yearning for the mysterious,\nGraced by karmic favor to guard the sacred mountain.\nSilent, formless, beyond sound in the darkest depths,\nYet thunder, lightning, wind, and storm answer to his gaze.\n\n**Cloud Grotto Hermitage**\nWhich tier of the sacred mountain’s retreat is this?\nA thatched hut, tightly sealed, concealing its traces.\nDeep within the shadowed vale, coiled and hidden,\nPerhaps in a former life, it was the Five Dragons.\n\n**Purple Empyrean Spirit Spring**\nHalf a pool beneath the stone, a small hill’s embrace,\nThe sea’s dust scatters, yet its flow never ceases.\nEach drop sustains thousands upon thousands,\nDivine workings transform countless autumn pools.\n\n**Nine-Ford Stream**\nThe crane’s chariot drifts far, never to return,\nThe heir apparent ascends to the White Cloud Mountain.\nHow could a mere stream block the path to a mother’s love?\nAwaiting the day he faces the Celestial Countenance in Heaven’s Palace.\n\n**Nine-Wave Service**\nJade blossoms hang suspended over the emerald creek’s bend,\nHow many times has its radiance graced these waters?\nA single handful of brewed spring brings a thousand days of drunkenness,\nEven the old sojourner of Xinfeng regains a youthful face.\n\n**Banner-Unfurling Peak**\nSeven crags arrayed like stars, towering and majestic,\nGreat banners and lofty standards escort the Six Dragons.\nScattered to fill the Six Directions,\nRaising wind and felling rain, its celestial might resounds.\n\n**Millennial Mugwort**\nThe mountain holds divine spirit, and its herbs share its power,\nA single pill’s strength rivals ginseng and poria.\nBranch by branch, leaf by leaf, it governs human fate,\nHeaven dwells at its roots, granting eternal life.\n\n**Ten-Thousand-Year Pine**\nHeaven’s essence and Earth’s purity merge in the wilds,\nNot in lofty grandeur to rival the Han’s heights.\nIn an instant, withered wood revives through transformation,\nUnaging through wind and frost, its root of longevity firm.\n\n**Golden Star Stone**\nIts qi pure and unyielding, wondrously congealed,\nThe Western Venus radiates auspicious light.\nIts scattered brilliance fills Heaven and Earth,\nMount Hua’s treasures flourish in its mountain.\n\n**Silver Star Stone**\nOnce carved as tribute to Liangzhou,\nIt remains to guard the sacred mountain’s highest peak.\nGrain by grain, cinnabar—a treasure of the world,\nIts auspicious glow illuminates the night sky.\n\n**Pine Lichen**\nTen thousand strands of trailing silk drape the green mist,\nFor millennia, it sways and coils.\nFully transformed, it robes the court in splendor,\nAdorning the Golden Gate across ten thousand heavens.\n\n**Non-Empty Bird**\nThe Daoist lineage of Zhuang and Lao studies emptiness,\nYet diligently doing good, it follows Shun’s path.\nObserve that bird—its meaning lies beyond words,\nFor three thousand meritorious deeds are true mastery.\n\n**Crow**\nAt the Coming Phoenix Terrace, it emulates swift flight,\nRecording offices like the phoenix at the Guest Gate.\nWhen celestial visitors arrive, the flock calls in unison,\nLeading the crane’s ranks to audience with the Sacred One.\n\n**Half-Set Music**\nThe Supreme Clarity’s refined strains, rare in the world,\nNeither bamboo nor silk, but five-colored birds.\nThe *Shao* dance shares in the universal celebration,\nThe numinous phoenix arrives with a single heart.\n\n**My Master’s Bird**\nThe Dao is everywhere, inherent in all nature,\nEvery moving thing, every living being, holds reverence.\nIts teaching’s work mirrors Heaven’s nurturing embrace,\nWho in this life can stand apart from Heaven and Earth?\n\n**White Pheasant Parrot**\nFeathered robes of pure jade, a deity of Yizhou,\nFacing east, it guards the sacred mountain’s truth.\nTransformed to soar in the palace courtyard, nesting with the phoenix,\nIts wings support the imperial carriage to the Celestial Ford.\n\n**Spirit-Longevity Staff**\nAn ancient pine’s bones, the Valley Spirit’s elder,\nThe Great One’s true essence, an ancient staff’s might.\nSpared the taint of Kong Guang’s treacherous hands,\nIts years in the mountains match Heaven’s own.\n\n**Kan Forest Tree**\nA wondrous marvel of the Seven Treasures Forest in the upper realms,\nBranch by branch, kingfisher jade, leaf by leaf, lapis lazuli.\nHad it not dwelled atop the Great Summit in Heaven,\nHow could its divine root claim such uniqueness?\n\n**Mind-Stabilizing Pine**\nA green official, Heaven-sent, exuding human grandeur,\nA single stone, rootless, towers ten thousand feet.\nLeaning like Mount Tai to peer beyond the Dipper,\nIts iron body upholds an emerald canopy in the void.\n\n**Cloud Bamboo Staff**\nBestowed in purple, concealed in forests and springs,\nIn times of peril, it upholds the state as a great worthy.\nThe world’s path is smooth, Heaven’s course steady,\nLao Ge invites it to accompany the immortals.\n\n**Heavenly Lamp**\nFrom yin cliffs and bottomless ravines, waters trickle,\nAt dusk, its windows gleam on all eight sides.\nSuddenly, the Nine Empyreans’ divine transformations appear,\nA few branches of flame glow in silver vats.\n\n**Stone Lamp Core**\nInch by inch, its unyielding heart embodies the Dao’s fullness,\nBoundless radiance illuminates the infinite.\nLantern oil never exhausts, its burning unceasing,\nFor ten thousand ages, it is the dawn of humanity’s world.\n\n**Solomon’s Seal**\nShoots of pure yang nestle with deer in slumber,\nIts roots, full and substantial, endure through the years.",
      "overlap_context": "e from the Western Hall—a dreamt poem.\nRooted in duckweed and pondweed for offerings,\nIt transcends to the flourishing age of the royal *feng*.\n\n**Imperial Cliff Peak**\nThe earth’s weight shifts, yet it remains serene and focused,\nThe Dao’s words correspond above to the Great Peace Heaven.\nHollowed eaves and golden goblets encircle golden palaces,\nNeither existing nor void, at the vast desert’s edge.\n\n**Manifest Stability Peak**\nIt forbids the great yawn to shake heaven’s pivot,\nThe grand cosmos",
      "start_char": 7058,
      "end_char": 8477,
      "start_sentence": 514,
      "end_sentence": 617,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 48.13448786735535,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\武当纪胜集.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "夜炉和月烹金掖，饭不青精亦可仙。 苍木煎 贱同草芥贵金瑰，换骨成仙火是媒。 造化鼎中熬炼到，长生药不在蓬莱。 黑虎丹 威风肃肃赛熊组，野壁山墙暮夜余。 匕剂中问牙爪奋，痒病疾痛是黔驴。 川芍饼 疾攻头目苦虚疼，攻疾仙家药力弘。 片片雪花魁蜀产，不须灌顶说三乘。 艾煎元 荆榛丛裹有参苓，帝造锺英地又灵。 任是七年真病久，汞炉勋业炳丹青。 甜茶 修真苦淡味仙灵，自种云腴摘玉英。 亘古与人甘齿颊，春风百万亿苍生。 武当图本 步九层霄阅太和，盘旋八百里山河。 千章锦绣诗难尽，一幅丹青画了么。 风月好怀时更别，烟云变态处如何。 看图看透图之外，方见山问景趣多。 武当纪胜集竟",
      "translated_text": "**Night Furnace**\nBy moonlight, the golden crucible simmers,\nEven plain rice, untainted by green essence, may lead to immortality.\n\n**Cangmu Decoction**\nHumble as weeds, yet precious as golden jade,\nFire forges the elixir to transmute bones and ascend.\nRefined within the cauldron of creation,\nThe drug of longevity needs not seek Penglai.\n\n**Black Tiger Elixir**\nMajestic as a bear’s solemn march,\nOn wild cliffs and mountain walls, dusk lingers.\nWithin the spoon, fangs and claws stir,\nAching ills and pains—mere tricks of the black donkey.\n\n**Chuanxiong Cakes**\nSharp attacks on head and eyes, bitter with hollow pain,\nThe immortal’s remedy wields mighty force.\nFlake by flake, snow-like blooms from Shu’s finest,\nNo need for ablutions or the Three Vehicles’ discourse.\n\n**Mugwort-Essence Pill**\nAmid thorny thickets lie ginseng and poria,\nThe emperor’s tribute, blessed by earth’s spirit.\nThough seven years of true illness may persist,\nThe mercury furnace’s merit blazes in cinnabar script.\n\n**Sweet Tea**\nCultivating the Dao, its taste is plain yet divine,\nSelf-cultivated cloud-fat, plucked jade blossoms.\nSince ancient times, it has sweetened mortal lips,\nA spring breeze for a hundred million lives.\n\n**Wudang Illustrated Scroll**\nAscend ninefold skies to witness great harmony,\nSpiral through eight hundred li of mountains and rivers.\nA thousand verses of brocade could not exhaust its splendor,\nYet a single painted scroll—does it suffice?\n\nMoments of wind and moon take on new grace,\nHow do mist and clouds shift in their forms?\nTo see beyond the scroll itself,\nIs to find the mountains’ endless vistas.",
      "overlap_context": " gleam on all eight sides.\nSuddenly, the Nine Empyreans’ divine transformations appear,\nA few branches of flame glow in silver vats.\n\n**Stone Lamp Core**\nInch by inch, its unyielding heart embodies the Dao’s fullness,\nBoundless radiance illuminates the infinite.\nLantern oil never exhausts, its burning unceasing,\nFor ten thousand ages, it is the dawn of humanity’s world.\n\n**Solomon’s Seal**\nShoots of pure yang nestle with deer in slumber,\nIts roots, full and substantial, endure through the years.",
      "start_char": 8477,
      "end_char": 8784,
      "start_sentence": 618,
      "end_sentence": 639,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.52417278289795,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\武当纪胜集.txt",
        "category": "记传类"
      }
    }
  ]
}