{
  "source_id": "气法要妙至诀",
  "source_file": "chunked_daozang\\气法要妙至诀.json",
  "total_chunks": 6,
  "total_original_chars": 4866,
  "total_translated_chars": 28532,
  "total_translation_time": 132.13931369781494,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\方法类\\气法要妙至诀.txt",
    "category": "方法类"
  },
  "full_translation": "*The Essential and Wondrous Supreme Formula of Qi Regulation*\n**Text Title:** *The Essential and Wondrous Supreme Formula of Qi Regulation*\n**Author:** Anonymous\n**Volume:** One\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Methods* section of the *Dongshen* Division\n\n---\n\nThe Essential and Wondrous Supreme Formula of Qi Regulation—those who practice the true Dao employ it, and their longevity becomes equal to that of Heaven and Earth.\n\nHumans naturally possess six forms of *daoyin*, yet they remain unaware of the methods of *chui* (blowing), *he* (exhaling), *xu* (hissing), *yan* (swallowing), *hu* (breathing), and *xi* (sighing):\n- *Chui* dispels cold *qi*,\n- *He* dispels vexing *qi*,\n- *Xu* dispels phlegm accumulation,\n- *Yan* dispels fatigue and weariness,\n- *Hu* dispels warmth and heat,\n- *Xi* dispels wind *qi*.\n\nThis is what it means for humans to naturally understand their own vitality.\n\n### **Qi Regulation Method**\nPrepare a chamber of ten square feet, with a small window. At noon, consume a full meal of plain white rice, and moderate rich or pungent flavors to allow *qi* to flow smoothly. By midnight, knock the teeth together thirty-four times.\n\nNext, practice the *warm qi* method:\nRub the hands together, then massage the face, body, hands, and feet—this is called *Dry Bathing*.\n\nGather the hair with both hands, then sit upright. Close the breath and swallow it down to the *qi* sea. One may inhale once and swallow once, or inhale twice and swallow once, or inhale thrice and swallow once. After five swallows, exhale a small breath—this is called *one cycle*.\n\nThough one may feel empty, it should not be exhausting. Initially, it is quite difficult, and the intent may not be grasped. With prolonged practice, the rhythm becomes self-evident, and one naturally understands what is appropriate—words cannot fully convey it, nor can brush and ink capture it.\n\nIf the body seems afflicted with illness, close the eyes and hold the breath until extreme discomfort arises, causing the body and abdomen to expand and contract, sweat to emerge, and slight panting to occur. Once the panting ceases and the sweat dissipates, the cycle is complete. After ten such cycles, the illness will be cured.\n\nFrom midnight to noon pertains to *yang qi*—this may be absorbed.\nFrom noon to midnight pertains to *yin qi*—this must not be absorbed.\n\n*Qi* drawn through the nose is *orthodox qi*—this may be absorbed.\n*Qi* drawn through the mouth is *perverse qi*—this must not be absorbed.\n\nThe nose is the gate of the *hun* (ethereal soul), and the mouth is the door of the *po* (corporeal soul). The *hun* is pure, while the *po* is turbid—hence this distinction.\n\nAdditionally, minor *daoyin* exercises may be performed as needed when discomfort arises; one need not complete all of them. The twelve *supplementation methods* follow the same principle.\n\nBy dawn, after completing one cycle, consume a meal—it will be swiftly digested. Then relax and return to the method of absorbing *qi* as practiced at midnight.\n\nThe *Thirteen Stills of Lord Lao*: At noon, take honey broth, sesame drink, jujube decoction, turnip seed soup, or yellow essence soup—any one of these will suffice. A small cup or two of wine may also be taken, which is most efficacious. One should always hold a jujube pit in the mouth to stimulate saliva and moisten the inner organs; otherwise, the mouth will grow dry.\n\nDay and night, maintain focus, and the seasonal rhythms will naturally align. No strenuous effort is required, nor should one become fatigued—merely sustain it gently, as if preserving the body. On the first day, the *qi* settles into the body; on the second, it feels like a dream; on the third, the lower abdomen becomes aware; on the fourth, the abdomen rumbles; on the fifth, the eyes grow warm; on the sixth, the feet grow warm; on the seventh, the spirit appears; on the eighth, the *qi* moves like drifting clouds; on the ninth, upper and lower unite; on the tenth, the radiance of the spirit courses through the form.\n\nIn the first three days, slight dizziness may occur; by the twenty-eighth day, minor apparitions may arise; by the fortieth day, *qi* increases; by the sixtieth day, one returns to normal. If the urine is dark yellow, take jujube soup; if the stool is hard and difficult to pass, take mallow seed soup.\n\nAfter ten days, the complexion may appear sallow; after twenty days, the intestines and stomach become active; after thirty days, fatigue dissipates; after forty days, the countenance brightens; after fifty days, the six viscera harmonize; after sixty days, one returns to normal; after seventy days, aspirations grow lofty and distant. At this time, one should seclude the essence and guard the mysterious, taking cinnabar, realgar, or orpiment—then one will no longer fear cold or heat. Wine, though beneficial to *qi*, can disorder the spirit and should not be consumed in excess.\n\nAfter a hundred days, one attains spiritual communion. If one also takes herbal medicines, one will no longer be weak or emaciated. Be cautious never to leak *qi*. When *qi* is about to generate, the abdomen may feel full and vaporous—absorb it, then harmonize the *qi* to balance it. Visualize it exiting through the pores, not descending downward; this is called *refining qi*. Refining *qi* within a hundred days is most difficult—even if one fails once or twice, persist until success is achieved. Saliva should be swallowed, not spat out; this is called *refining saliva*. Even if urine appears like water, its purity is such that it may be consumed; this is called *refining urine*.\n\nAs *Huainanzi* states: \"To live long, keep the abdomen clear; to avoid death, keep the abdomen free of dregs.\" In winter, one will not feel cold; in summer, one will not feel heat—this is the method of *qi*-circulation practiced by tortoises, snakes, and swallows, where breath neither enters nor exits through nose or mouth.\n\nAfter a hundred days, light illuminates the body; after two hundred days, inner and outer become bright; after three hundred days, one communes with spirits; after four hundred days, one perceives the external from within; after five hundred days, one endures cold and heat; after six hundred days, one can conceal or reveal oneself; after seven hundred days, one moves without hindrance; after eight hundred days, if a woman practices, jade maidens attend her, and if a man practices, jade lads attend him; after nine hundred days, one sees ten thousand miles and knows all things. After nine years, one ascends as an immortal; after twelve years, one becomes a *zhenren*.\n\nIn another year, the *qi* is renewed; in two years, the blood; in three years, the vessels; in four years, the flesh; in five years, the marrow; in six years, the sinews and bones; in seven years, the skin; in eight years, the hair; in nine years, the form transforms into an immortal, with thirty-six thousand spirits dwelling within. One may ride clouds and mount dragons, command wind and rain, and summon ghosts and spirits. After a hundred and twenty years, the spirit is refined and unites with the Dao, merging with the void in truth.\n\n**Method for Regulating Qi**\nAfter midnight, lie supine with a level pillow, arms and legs extended, feet spaced a foot apart. Then stretch the hands, each five inches from the body, make fists, and hold the breath. Focus the mind on the afflicted area and attack it with *qi*. After a long while, gradually open the mouth and slowly exhale the turbid *qi*. Perform this six or seven breaths as one cycle. When refining *qi*, ensure it gathers at the afflicted area and disperses it. When exhaling, do so quietly so that even the ears do not hear—this ensures longevity.\n\nThe spleen resides in the central palace as the sovereign’s seat. The four *qi* arise from the primordial *qi* and thus dwell outside the spleen as ministers. If one can secure the primordial *qi* and keep it long within the spleen’s palace, then the nine orifices will forever cease their in-and-out breathing. The spleen has nine orifices—five horizontal and four vertical—serving as portals for storing the spirit. Nine times nine is eighty-one, which is also the number of the Dao. The spleen is the chamber of the spirit and thus ensures longevity.\n\nThe spleen, seated in the central palace as the sovereign’s seat, has orifices. If one can secure the primordial *qi* and keep it long within the spleen’s palace, then the nine external orifices will forever cease their in-and-out breathing. The three cinnabar fields all rely on the spleen to store *qi*; if the spleen’s *qi* is preserved, the body remains eternally firm. The spirit is established through *qi*, and *qi* is preserved through the spirit. Spirit and *qi* generate each other, hence longevity.\n\nIf one does not practice *daoyin*, the Dao is difficult to achieve. The *Yellow Court* of the immortals is the true stepping-stone of the Dao. Even if worldly attachments remain and bedroom affairs are not abandoned, one may still cultivate in a quiet studio, a secluded garden, or a place of fine scenery.\n\nTo learn *daoyin*, one must first abstain from meat and pungent foods, and reduce bedroom activities. Moderating desires clarifies the spirit; avoiding meat and pungent foods preserves the spirit’s *qi*. In the method of *daoyin*, first pluck the hairs from the nostrils, cleanse the mouth and teeth, wear fresh, clean clothes, a light hat, and a soft cap, and use a low pillow to keep the head level—otherwise, the *qi* will not harmonize.\n\nThe primordial *qi* resides in the spleen but cannot emerge on its own; it requires external *qi* to enter through the nose, draw the primordial *qi* from the spleen, and exit again through the nose. Thus, the nature of *qi* is natural—reversing the flow from external to internal is also natural.\n\n**Method for Moderating Qi**\nFirst close the mouth and silently observe the external breath entering through the nose. Estimate the inhalation as two parts, and when the inhalation reaches its limit, draw the primordial *qi* from the spleen and exhale it through the nose. Estimate the exhalation as two parts, then moderate and retain one part. Precisely moderate the head of the primordial *qi*; if the primordial *qi* is not moderated, it returns to the spleen and waits for the next external breath to enter before exiting. Estimate the inhalation, moderate the exhalation—thus, the breath is never interrupted. This moderation is guided by the mind, and the *qi* naturally halts.\n\nThus, *qi* is such that if one does not moderate it, it will naturally exit. If one restrains and moderates it, *qi* is then governed by the person, not by *qi* itself.\n\n*Qi* is mastered by spirit, for spirit can command *qi*, and *qi* can move the body—thus, it is known that intention is spirit. When moderating *qi*, one must keep the mouth closed so that *qi* does not escape through the Celestial Gate. If the Earth Gate is open, the thief will exit through the Earth Gate, hence the mouth must always remain closed. If one feels slight oppression, open the Earth Gate and release a little, then close it again after exhalation. This is called \"releasing a little when unharmonized\"; once skill is attained, never release it again.\n\nAt the beginning of *qi* practice, the inhalation should be slow, and the exhalation swift—after three moderations, exhale once, then swiftly moderate and slow it. One may fear that moderating the primordial *qi* lacks precision, for this is the refinement of seven or eight parts. If moderating *qi* achieves seven or eight parts, and without moderation, exhalation is estimated as three parts with half released, then the mind’s moderation is without error. Once *qi* is harmonized, return to the sage’s constant method. With diligent practice, exhalation becomes increasingly slow, and when slow, the primordial *qi* is subdued and reluctant to exit.\n\n**Method for Assisting Dao Yin with Swallowing Qi**\nMaster Wang said: Those who study *Dao Yin* and practice *qi* to abstain from grain, teaching others to fast, may become somewhat weak and emaciated, hence they use swallowing *qi* to assist *Dao Yin*. Swallowing *qi* refers to swallowing coarse *qi*. When swallowing *qi*, quickly close the mouth and swallow the *qi* within the throat—thirty or twenty swallows will fill the abdomen, causing it to gurgle and churn until it feels full. Though this is a separate method, it belongs to the same family. If one moderates the primordial *qi* to achieve satiety, this is the subtlety within subtlety.\n\n**Essential Secrets of Dao Yin’s New Signs**\nThose who study *Dao Yin* and practice diligently for one or two months will achieve harmony, depending on the effort expended. *Qi* will gradually descend, feeling like the movement of a mosquito. When *qi* fills the area below the heart, press downward with the fingers to guide it—this is *qi* arriving from below the heart and gradually entering the abdomen. Frequently press the abdomen with the fingertips; if it feels like a drum’s resonance, *qi* has returned. It then gradually descends to the navel, circulating around the abdomen. Observe carefully to know the length, breadth, and size of the abdomen. When foul substances are expelled, *qi* reaches the Bubbling Spring, descending slowly until it gradually reaches the soles of the feet, then extends to the hands and head. The head is the most difficult to unblock; only when *qi* circulates throughout the entire body is it fully open. When *qi* permeates the four limbs and irrigates the hundred vessels, the entire body becomes unobstructed—this is called a \"minor attainment.\"\n\nDivided into yin and yang, the right side feels cool, the left side warm—this is a \"minor attainment.\" During yang hours, use yang *qi*, and the left side remains still; during yin hours, use yin *qi*, and the right side remains still—this is also a \"minor attainment.\" From midnight to noon is yang time; from noon to midnight is yin time. Day and night follow this pattern: during yang hours, use yang *qi* and the left side remains still; when intending to guide *qi* to the right, the mind should not dwell on the left, and *qi* will not move there. During yin hours, use yin *qi* with the intention directed to the left, following the same method as for yang.\n\nWhen moderating *qi* for an extended period, as in seated meditation, one should consistently moderate *qi* with intention during spare moments, without reckless use. This prolonged moderation of *qi* is called a \"minor attainment.\" If the right side becomes hot from excessive yin *qi*, imagine the yang side as cool as the yin side; if the left side becomes hot from excessive yang *qi*, imagine the yin side as cool as the yang side—this is called \"directing *qi*,\" also a \"minor attainment.\" Directing *qi* occurs when moderating the primordial *qi*. When primordial *qi* is about to descend, guide it with intention, directing it from right to left. If it cannot be directed, first guide it to the left, then to the right.\n\nDuring yang hours, use yang *qi* and direct it to the left; during yin hours, use yin *qi* and direct it to the right, following the same method as for yang. If the body has ailments, direct *qi* to the affected area without regard to yin or yang hours—simply swallow the primordial *qi* and guide it downward immediately, ensuring it is not disordered. This prolonged moderation of *qi* is also called a \"minor attainment.\"\n\nSome, upon first hearing of directing *qi*, may laugh, asking, \"*Qi*—what is it that you command?\" *Qi* is the function of spirit, intention is the numen of spirit, and spirit commands *qi*, while *qi* moves the body—this is the activity of spirit. What is strange about it? Thus, when spirit desires movement, *qi* pulls the body to move; when spirit desires to run, *qi* pulls the body to run; when spirit desires to go outward, *qi* pulls the body outward; when spirit desires to rise, *qi* pulls the body to rise. This is the spirit’s employment of abundant *qi*. Just as eating enables one to walk and move upon the earth, when *qi* is mastered subtly, spirit can make the body move in emptiness—this is the numen of intention as spirit.\n\nUsing yang *qi* with a firm resolve, the jade stalk only releases yang *qi*, not bone essence, and its use makes it increasingly firm—this is a \"minor attainment.\" In winter, imagine being in a chamber with yang *qi* entering from others, and one feels warm—this is also a \"minor attainment.\" In hot weather, sitting indoors and imagining yin *qi* entering makes one feel cool—this too is a \"minor attainment.\" Those who attain this after practice are also said to have a \"minor attainment.\"\n\nWhen *qi* is harmonized, the abdomen’s skin gradually thickens—this is a \"minor attainment.\" Thus, the body frequently sheds skin—this is also a \"minor attainment.\" Using yin *qi* makes one as cool as iron and as hard as stone—this is a \"minor attainment.\" Using yang *qi*, one can ascend steep mountains and cliffs—this is a \"minor attainment.\" Using yang *qi* makes the body light and agile—this is a \"minor attainment.\" In summer, standing among trees and using yin *qi* makes the leaves of grasses and trees moist—this is a \"minor attainment.\" For those suffering from cold or heat illnesses, rubbing with yin or yang hands cures the ailment instantly—this is also a \"minor attainment.\" By listening to strings and pipes in imagination, one can foresee good or ill fortune—this too is a \"minor attainment.\"\n\nSeeing with inner vision, the secrets of ghosts and spirits cannot be concealed—this too is a \"minor attainment.\" The mind discerns subtle intentions, possessing wisdom beyond the ordinary—this too is a \"minor attainment.\" For extraordinary formulas, esoteric methods, ancient artifacts, and rare treasures unknown to others, the mind intuits their nature—this too is a \"minor attainment.\" Myriad spirits come to attend and serve—this too is a \"minor attainment.\" Using the *qi* within one’s body to generate the *qi* of another’s five viscera—this is a wondrous attainment.\n\nWhen primordial *qi* is stored within, with no ingress or egress, and the regulated breath reaches the place of no orifices, even the act of breathing becomes imperceptible—this is what the noble lords call \"one who has slipped the register, a fugitive no longer governed by the Great Yin,\" a wondrous state. Refining flesh and refining bones, becoming light and pure, ascending to float among the spirits of Heaven and Earth, transforming at will—this is the pinnacle of *daoyin*.\n\nYet this has not yet merged with the inner true spirit in its wanderings; such a one has not entered the rank of the Perfected. This is called the \"Perfected.\" This wondrous *qi*-guard method was transmitted by Master Zhang Guo of Dragon Ridge, most wondrous indeed.\n\nMaster Qin Xin said: The Perfected, surnamed Zhang and named Guo, was styled by Emperor Xuanzong as Master Tongxuan. He appeared suddenly, with no known lineage, yet his divine transformations were as free as those of the ancient highest Perfected. Someone asked: Did he ever serve in the world?\n\nHere the *bingzi* year is said to have been his appointment as a scribe. Yet no such record appears in the histories, and the transmitted *qi*-methods, absent from the immortal classics, are thus the secret treasures of the Daoist tradition. Practiced in stillness for twenty-one days, they allow one to see clearly through the intestines and stomach, to restore youth and reverse aging, to ride the clouds and traverse the void, ascending into the morning mist—this may be awaited with toes raised in anticipation. Only those whose *qi*-signs harmonize with the Dao may receive this transmission. Take heed!\n\nMaster Qishi said: Within the human abdomen, there are three barriers, including one at the heart. When first practicing *qi*-ingestion, one invariably feels fullness below the heart and in the stomach; simply eat less, and with prolonged practice, the passage will naturally open downward. When the barrier below the viscera is reached, fullness is felt in the abdomen; with persistent practice, one senses the *qi* arriving at the cinnabar field below the navel, where it begins to circulate throughout the body. Only when the *qi* has not yet entered the *jiuzhong* does one feel the *qi* emerge there—then one gains the ability to heal others.\n\nBeginners must practice in a quiet place, proceeding with meticulous care. The *qi* will naturally enter the abdomen, and this may be done whether walking, standing, sitting, or in any other circumstance. If the *qi* in the stomach has not descended into the navel and abdomen, it will not enter the other regions, making success difficult.\n\nWhen first learning *qi*-ingestion, one must, upon inhaling, pause the breath briefly, as if holding it until fullness is felt. Upon exhaling, reduce the breath by two-thirds, then pause again briefly before swallowing. After swallowing, repeat the process until the abdomen is full, then rest. This must be practiced day and night, in all four seasons.\n\nWhen first drawing *qi* inward, intending it to enter the cinnabar field, it easily scatters if the mind is distracted; one must ensure the *qi* connects seamlessly. Once the *qi* has entered the cinnabar field, even if one ceases *qi*-ingestion, the *qi* will not disperse.\n\nThe four seasons refer to dawn, dusk, midnight, and noon. If the heart feels full, do not ingest *qi*; instead, take a small amount of licorice or cassia heart to disperse the fullness. If the cinnabar field is not yet full, it has not reached fullness.\n\nWhen the original *qi* descends, one naturally feels a slight oppression. When first practicing *qi*-ingestion, one must use the prone and supine postures at dawn and dusk, while at midnight and noon, only the supine posture is used.\n\nFor the supine posture, use a low pillow, lie on the back, draw in the shoulders, raise the knees, and extend the hands to the sides of the ribs. Then swallow the *qi* ten times, and the cinnabar field will be full. After an hour of swallowing, guide the *qi* at will into the *jiuzhong*.\n\nFor the prone posture, lie with the abdomen flat on the bed, support the chest with a quilt to raise it, and extend the hands and feet. Then swallow the *qi* ten times, each time guiding it with the mind to descend along the spine and exit through the \"ripe viscera.\"\n\nAt dawn and dusk, when practicing *qi*-ingestion, first adopt the prone posture, then the supine. With each swallow, make a sound as you guide the *qi* downward into the cinnabar field, and also make a sound as it descends along the spine. Ten swallows per posture are sufficient. If one does not know how to make the sound, even three or five swallows will not suffice; one must learn to make the sound to succeed. Without this intention, the effort is in vain.\n\nWhen swallowing *qi*, always swallow deeply and slowly in the throat; do not do so forcefully, as this may provoke coughing. With each swallow, pause for ten breaths in between, and take breaks as needed, proceeding with ease and guiding the *qi* with the mind.\n\nBeyond the four regular *qi*-ingestion sessions, if at any time the abdomen feels deficient in *qi* or the strength wanes, swallow as much as desired. When first practicing *qi*-ingestion, the *qi* often descends from the \"ripe viscera\"; gradually stabilize it by guiding it with the mind to disperse.\n\nWhen first practicing *qi*-ingestion, the mind must be open and free of doubt, without fear. If fear is present, the *qi* will be difficult to circulate. When the body’s strength is harmonized, the mind must be joyful and content, free from desire for fame or achievement—then progress will be made day by day, with boundless delight.\n\nOne must not think of food, remaining open and free of distractions—only then will success come. If thoughts of food arise, they must be suppressed; if one does not take them seriously, the mind will still dwell on them. Those who can suppress such thoughts will remain undistracted even when facing sumptuous feasts all day.\n\nAs long as one does not miss the proper times for *qi*-ingestion, the cinnabar field will remain full. Even if one engages in worldly affairs during the day, cultivation is not abandoned. Missing an hour or two occasionally is of no consequence. For those who have succeeded in *qi*-ingestion, even if they do not practice it all day, their *qi* will remain sufficient—its wonders are inexhaustible.\n\nOnce the cinnabar field below the navel is full, one may call out, read, or converse with others all day without losing strength. One should still engage in light movement to guide the *qi* downward. After mastering *qi*-ingestion, eating is not harmful to the *qi*; even after a full meal, swallowing *qi* will cause it to resonate until it reaches the area below the navel. After success, one may eat while practicing *qi*-ingestion, and the descending *qi* will not interfere with the practice.\n\nTo expel all waste from the abdomen, simply refrain from eating for twenty days—this is even better. If one eats immediately after *qi*-ingestion, the results will not be refined. Each day, drinking a little medicinal wine is beneficial. If one craves food, a small amount of ginger-honey broth will settle the stomach, but one must not eat much. Abstaining from all foods is best.\n\nOne must be utterly sincere and free of fear. Even if the body or chest feels oppressed or unwell, it is of no concern—with time, it will improve. Do not eat fruits, as they may unsettle the abdomen or leave residue, hindering the flow of *qi*. Keep the abdomen empty to allow the *qi* to circulate.\n\nWith persistent practice, one will naturally sense a change in spirit and vitality, with the body growing stronger day by day, its clarity unmatched. After prolonged *qi*-ingestion, will one’s eyes naturally discern good and evil? One will perceive others’ inner nature from their outward appearance. With a sincere heart, after twenty-one days, one will internally visualize the intestines and stomach. Without such sincerity, prolonged practice will eventually open the passage, allowing one to internally visualize the five viscera in vivid detail—its wonders are beyond words.\n\nOne’s skin and flesh will become resilient, neither gaining nor losing weight, and one will not fall ill. If the practice is improper or the resolve is not firm, one may grow weak.\n\nIn the human body, the original *qi* constantly enters and exits through the mouth and nose. By restraining its outflow and keeping the cinnabar field full, one will not feel hunger, the spirit will be clear and bright, and even death will be unattainable.\n\nWhen the cinnabar field is full of ingested *qi* and one feels stifled, allow it to exit through the four limbs and the crown of the head. Above all, prevent it from dispersing through the mouth and nose. Though one may consume all manner of rich foods, the body will only grow hollowly plump, inviting a hundred ailments and gradually leading to death’s door. For those who indulge in wine and meat, though they may feel vigorous and strong for a time, all manner of illnesses easily arise, and miasmas, pestilence, and poisons will harm them upon encounter. By ingesting the original *qi* and practicing this over time, no toxin can cause injury, and every illness may be cured—with prolonged practice, one will come to know this naturally.\n\nWhen first completing the ingestion of *qi*, if it surges upward and exits through the mouth or nose, one must swallow saliva but not inhale, lest external *qi* enter. Beginners who draw in too much *qi* may experience bloating, discomfort, or rumbling sounds; in such cases, repeatedly guide the *qi* with intention to expel stagnant waste from the intestines. Once the bowels are empty, all will be well, and the *qi* will settle calmly in the abdomen. If the waste is not fully expelled and the intestines remain unsettled, one may allow a brief release of one or two bouts of flatulence to ease the discomfort. Though some *qi* may be lost in the process, simply ingest more to replenish it, ensuring the cinnabar field remains full at all times—this may be maintained for a full day and night.\n\nIn total, there are six periods for ingesting *qi*: *zi*, *yin*, *chen*, *wu*, *shen*, and *xu*—these six intervals of day and night are when the cinnabar field opens to receive it. The essential subtleties of the *qi* method conclude here.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "气法要妙至诀 经名：气法要妙至诀。 不着撰人。 一春。 底本出处：《正统道藏》洞神部方法类。 气法要妙至诀 要妙气诀，真道者用之，其寿与天地齐矣。 人自有六种导引，而不知吹、呵、嘘、咽、呼、嘻。 吹去寒气，呵去烦气，嘘去痰积，咽去痕劳，呼去温热。 嘻去风气。 此言人之生自解也。 气法 方丈室，开小窗，一日午时，饱食白，节斗切味，令气易行。 至子时，叩齿二七遍。 又取暖气法：两手相摩，摩面及身并手足，名乾浴。 两手各收发髻，收讫，正坐，闭气，咽之至气海，或一取一咽，或二取一咽，或三取一咽。 五咽之，口微吐少气，名一通。 虽虚而不困，初甚难，又不得其意，久闭则自解节度，自知所宜，非言能诠，非翰墨所及。 若体似有疾，则瞑目闭息，极闷不堪，身腹盈缩汗出，及微喘，喘定汗消为通。 凡至十通，病乃差。 从子至午为阳气，可服； 午至子为阴气，不可服。 鼻中取为正气，可服； 口中取为邪气，不可服。 鼻为魂门，口为魄户，魂清魄浊故也。 并小导引，随不利而为，不必备及。 十二补法亦如之。",
      "translated_text": "*The Essential and Wondrous Supreme Formula of Qi Regulation*\n**Text Title:** *The Essential and Wondrous Supreme Formula of Qi Regulation*\n**Author:** Anonymous\n**Volume:** One\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Methods* section of the *Dongshen* Division\n\n---\n\nThe Essential and Wondrous Supreme Formula of Qi Regulation—those who practice the true Dao employ it, and their longevity becomes equal to that of Heaven and Earth.\n\nHumans naturally possess six forms of *daoyin*, yet they remain unaware of the methods of *chui* (blowing), *he* (exhaling), *xu* (hissing), *yan* (swallowing), *hu* (breathing), and *xi* (sighing):\n- *Chui* dispels cold *qi*,\n- *He* dispels vexing *qi*,\n- *Xu* dispels phlegm accumulation,\n- *Yan* dispels fatigue and weariness,\n- *Hu* dispels warmth and heat,\n- *Xi* dispels wind *qi*.\n\nThis is what it means for humans to naturally understand their own vitality.\n\n### **Qi Regulation Method**\nPrepare a chamber of ten square feet, with a small window. At noon, consume a full meal of plain white rice, and moderate rich or pungent flavors to allow *qi* to flow smoothly. By midnight, knock the teeth together thirty-four times.\n\nNext, practice the *warm qi* method:\nRub the hands together, then massage the face, body, hands, and feet—this is called *Dry Bathing*.\n\nGather the hair with both hands, then sit upright. Close the breath and swallow it down to the *qi* sea. One may inhale once and swallow once, or inhale twice and swallow once, or inhale thrice and swallow once. After five swallows, exhale a small breath—this is called *one cycle*.\n\nThough one may feel empty, it should not be exhausting. Initially, it is quite difficult, and the intent may not be grasped. With prolonged practice, the rhythm becomes self-evident, and one naturally understands what is appropriate—words cannot fully convey it, nor can brush and ink capture it.\n\nIf the body seems afflicted with illness, close the eyes and hold the breath until extreme discomfort arises, causing the body and abdomen to expand and contract, sweat to emerge, and slight panting to occur. Once the panting ceases and the sweat dissipates, the cycle is complete. After ten such cycles, the illness will be cured.\n\nFrom midnight to noon pertains to *yang qi*—this may be absorbed.\nFrom noon to midnight pertains to *yin qi*—this must not be absorbed.\n\n*Qi* drawn through the nose is *orthodox qi*—this may be absorbed.\n*Qi* drawn through the mouth is *perverse qi*—this must not be absorbed.\n\nThe nose is the gate of the *hun* (ethereal soul), and the mouth is the door of the *po* (corporeal soul). The *hun* is pure, while the *po* is turbid—hence this distinction.\n\nAdditionally, minor *daoyin* exercises may be performed as needed when discomfort arises; one need not complete all of them. The twelve *supplementation methods* follow the same principle.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 440,
      "start_sentence": 0,
      "end_sentence": 26,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.428225755691528,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\气法要妙至诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "到明以来，一遍讫即一食，顿消散，放逸还如子时取气法门。 老君十三静，至日中作蜜汤或胡麻饮、在、汤、蔓菁子黄精汤一味，即得； 服一二小升酒亦得，甚妙。 常须含枣核，来津掖润内府，不然即口乾。 日夜存心，节候自成，不用勤，不至劳，绵绵若存身耳。 一日着身，二日如梦，三日小腹觉知，四日腹呜，五日两眼热，六日两足热，七日神见，八日气如云行，九日上下通，十日神光行形中。 初三日小头眩，二十八日小着物怪，四十日气增，六十日如故。 初或小便赤黄服枣汤，大便坚难服葵子汤。 一旬颜色痿黄，二旬动作肠胃，三旬消疲，四旬色悦，五旬六府和，六旬如故，七旬志及高远。 此时宜闲#1精守玄，服丹砂、雄黄、雌黄等，则不畏寒暑也。 酒虽益气，而能乱神，不可多饮。 十旬通神，若能当#2兼草药，不复虚羸，慎勿泄气。 气欲生时，腹中气氲亦吸，复合气令平，想从诸毛窍问出，勿令下出，名炼气。 百日内炼气最难，非不失之一二，失复为之，乃成矣。 津出咽而勿唾，名炼津。 虽溺如水，其洁可食，名炼溺。 《淮南》云：欲长生，腹中清； 欲不死，腹无滓。 冬不寒，夏不热，此龟蛇燕等行气之法，皆鼻口不出入息也。 一百日光照身，二百日中外明，三百日通神灵，四百日从外知内，五百日能寒能热，六百日能隐能彰，七百日出入无问，八百日女行则玉女侍给，男行则玉童侍给，九百日视见万里，无所不知，九年仙化，十二年真人也。 又一年易气，二年易血，三年易脉，四年易肉，五年易髓，六年易筋骨，七年易皮肤，八年易发，九年易形为仙，有三万六千神在身，或乘云驾龙，制御风雨，役使鬼神，百二十年检神会道，与空合真也。 调气法 夜半后，仰卧平枕，展手共足，足问相去一尺。 然后舒两手，手去身各五寸，握固闭气，心存所疾之处，以气攻之。 良久，渐开口，时却松出恶气，如此六息、七息为一度。 炼气必令归疾处散之，及吐之时，使耳不自闻，则可以长久。 脾居中宫为君位，四气从元气而生，故居脾外为臣位。 人能固得元气，长在脾宫，即九窍永绝出入息也。 脾有九窍，横五孔，坚四孔，以存神之窍耳，九九八十一，又存道之数也。 脾即神之室也，可以长久。 脾居中宫，为君位，有窍焉，能固得元气长在脾宫，即外九窍永绝出入息也。 三丹田真皆凭脾而存气，脾气若存，身则永固。 神以气立，气以神存，神气相生，故长久也。 又若不学导引，其道难成。 仙家黄庭，此真道阶也。 又宦情未歇，房室未除，但得静馆闲园佳赏之处，亦得修学也。 欲学导引，先须绝荤茹，少房室。 节嗜欲则神明宣，绝荤辛则神气全。 导引之法，先拔鼻孔毛，口齿清洁，衣新诤衣，低林薄盖，软枕低首，勿令头昂，则气不调耳。 元气在脾，不能自出，要假外气，从鼻入脾中引元气，还从鼻出，故气性自然，反外入内亦自然也。 节气法 先闭口，默察外息从鼻入，意料入息分，入息极，息即从脾中引元气还鼻中出，料去息二分，出即节取，余一分令住。 正节着元气头，元气节不得，即却入脾中，还待外气入来而出也。 入则料之，出则节之息之，如此不得断绝。 其节气者是人意中，以气节之，气即自止。",
      "translated_text": "By dawn, after completing one cycle, consume a meal—it will be swiftly digested. Then relax and return to the method of absorbing *qi* as practiced at midnight.\n\nThe *Thirteen Stills of Lord Lao*: At noon, take honey broth, sesame drink, jujube decoction, turnip seed soup, or yellow essence soup—any one of these will suffice. A small cup or two of wine may also be taken, which is most efficacious. One should always hold a jujube pit in the mouth to stimulate saliva and moisten the inner organs; otherwise, the mouth will grow dry.\n\nDay and night, maintain focus, and the seasonal rhythms will naturally align. No strenuous effort is required, nor should one become fatigued—merely sustain it gently, as if preserving the body. On the first day, the *qi* settles into the body; on the second, it feels like a dream; on the third, the lower abdomen becomes aware; on the fourth, the abdomen rumbles; on the fifth, the eyes grow warm; on the sixth, the feet grow warm; on the seventh, the spirit appears; on the eighth, the *qi* moves like drifting clouds; on the ninth, upper and lower unite; on the tenth, the radiance of the spirit courses through the form.\n\nIn the first three days, slight dizziness may occur; by the twenty-eighth day, minor apparitions may arise; by the fortieth day, *qi* increases; by the sixtieth day, one returns to normal. If the urine is dark yellow, take jujube soup; if the stool is hard and difficult to pass, take mallow seed soup.\n\nAfter ten days, the complexion may appear sallow; after twenty days, the intestines and stomach become active; after thirty days, fatigue dissipates; after forty days, the countenance brightens; after fifty days, the six viscera harmonize; after sixty days, one returns to normal; after seventy days, aspirations grow lofty and distant. At this time, one should seclude the essence and guard the mysterious, taking cinnabar, realgar, or orpiment—then one will no longer fear cold or heat. Wine, though beneficial to *qi*, can disorder the spirit and should not be consumed in excess.\n\nAfter a hundred days, one attains spiritual communion. If one also takes herbal medicines, one will no longer be weak or emaciated. Be cautious never to leak *qi*. When *qi* is about to generate, the abdomen may feel full and vaporous—absorb it, then harmonize the *qi* to balance it. Visualize it exiting through the pores, not descending downward; this is called *refining qi*. Refining *qi* within a hundred days is most difficult—even if one fails once or twice, persist until success is achieved. Saliva should be swallowed, not spat out; this is called *refining saliva*. Even if urine appears like water, its purity is such that it may be consumed; this is called *refining urine*.\n\nAs *Huainanzi* states: \"To live long, keep the abdomen clear; to avoid death, keep the abdomen free of dregs.\" In winter, one will not feel cold; in summer, one will not feel heat—this is the method of *qi*-circulation practiced by tortoises, snakes, and swallows, where breath neither enters nor exits through nose or mouth.\n\nAfter a hundred days, light illuminates the body; after two hundred days, inner and outer become bright; after three hundred days, one communes with spirits; after four hundred days, one perceives the external from within; after five hundred days, one endures cold and heat; after six hundred days, one can conceal or reveal oneself; after seven hundred days, one moves without hindrance; after eight hundred days, if a woman practices, jade maidens attend her, and if a man practices, jade lads attend him; after nine hundred days, one sees ten thousand miles and knows all things. After nine years, one ascends as an immortal; after twelve years, one becomes a *zhenren*.\n\nIn another year, the *qi* is renewed; in two years, the blood; in three years, the vessels; in four years, the flesh; in five years, the marrow; in six years, the sinews and bones; in seven years, the skin; in eight years, the hair; in nine years, the form transforms into an immortal, with thirty-six thousand spirits dwelling within. One may ride clouds and mount dragons, command wind and rain, and summon ghosts and spirits. After a hundred and twenty years, the spirit is refined and unites with the Dao, merging with the void in truth.\n\n**Method for Regulating Qi**\nAfter midnight, lie supine with a level pillow, arms and legs extended, feet spaced a foot apart. Then stretch the hands, each five inches from the body, make fists, and hold the breath. Focus the mind on the afflicted area and attack it with *qi*. After a long while, gradually open the mouth and slowly exhale the turbid *qi*. Perform this six or seven breaths as one cycle. When refining *qi*, ensure it gathers at the afflicted area and disperses it. When exhaling, do so quietly so that even the ears do not hear—this ensures longevity.\n\nThe spleen resides in the central palace as the sovereign’s seat. The four *qi* arise from the primordial *qi* and thus dwell outside the spleen as ministers. If one can secure the primordial *qi* and keep it long within the spleen’s palace, then the nine orifices will forever cease their in-and-out breathing. The spleen has nine orifices—five horizontal and four vertical—serving as portals for storing the spirit. Nine times nine is eighty-one, which is also the number of the Dao. The spleen is the chamber of the spirit and thus ensures longevity.\n\nThe spleen, seated in the central palace as the sovereign’s seat, has orifices. If one can secure the primordial *qi* and keep it long within the spleen’s palace, then the nine external orifices will forever cease their in-and-out breathing. The three cinnabar fields all rely on the spleen to store *qi*; if the spleen’s *qi* is preserved, the body remains eternally firm. The spirit is established through *qi*, and *qi* is preserved through the spirit. Spirit and *qi* generate each other, hence longevity.\n\nIf one does not practice *daoyin*, the Dao is difficult to achieve. The *Yellow Court* of the immortals is the true stepping-stone of the Dao. Even if worldly attachments remain and bedroom affairs are not abandoned, one may still cultivate in a quiet studio, a secluded garden, or a place of fine scenery.\n\nTo learn *daoyin*, one must first abstain from meat and pungent foods, and reduce bedroom activities. Moderating desires clarifies the spirit; avoiding meat and pungent foods preserves the spirit’s *qi*. In the method of *daoyin*, first pluck the hairs from the nostrils, cleanse the mouth and teeth, wear fresh, clean clothes, a light hat, and a soft cap, and use a low pillow to keep the head level—otherwise, the *qi* will not harmonize.\n\nThe primordial *qi* resides in the spleen but cannot emerge on its own; it requires external *qi* to enter through the nose, draw the primordial *qi* from the spleen, and exit again through the nose. Thus, the nature of *qi* is natural—reversing the flow from external to internal is also natural.\n\n**Method for Moderating Qi**\nFirst close the mouth and silently observe the external breath entering through the nose. Estimate the inhalation as two parts, and when the inhalation reaches its limit, draw the primordial *qi* from the spleen and exhale it through the nose. Estimate the exhalation as two parts, then moderate and retain one part. Precisely moderate the head of the primordial *qi*; if the primordial *qi* is not moderated, it returns to the spleen and waits for the next external breath to enter before exiting. Estimate the inhalation, moderate the exhalation—thus, the breath is never interrupted. This moderation is guided by the mind, and the *qi* naturally halts.",
      "overlap_context": "drawn through the nose is *orthodox qi*—this may be absorbed.\n*Qi* drawn through the mouth is *perverse qi*—this must not be absorbed.\n\nThe nose is the gate of the *hun* (ethereal soul), and the mouth is the door of the *po* (corporeal soul). The *hun* is pure, while the *po* is turbid—hence this distinction.\n\nAdditionally, minor *daoyin* exercises may be performed as needed when discomfort arises; one need not complete all of them. The twelve *supplementation methods* follow the same principle.",
      "start_char": 440,
      "end_char": 1690,
      "start_sentence": 27,
      "end_sentence": 71,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.28534722328186,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\气法要妙至诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "故气也，人不节之，气即得出，若约节之，气即由人不由气也。 气以神为主，故神能侵气，气能使身，即知意是神也。 节气时，当须闭口，气不得从天门出，若地户开，即盗从地户出也，故常须闭口也。 如觉气小闷，开地户，多少还出，出了闭之。 此谓未调和时须少放，若得方便，永勿放也。 初用气时分，入息缓，出疾，三节一即出，疾节缓之。 只恐节元气不着名，为炼七八也。 若节气得七八，若勿节气，料出气为三分出半，即节心无失矣。 待气调和，还依圣人常法，若勤为之，出息日迟，迟即元气调伏，不欲出也。 助导引咽气法 王公日：夫学导引之人者，用气断谷，教人不食，性少虚羸，乃用咽气助导引也。 咽气是咽粗气也。 若咽气，急闭口内咽喉中气，咽三十二十咽，即腹饱，只得绕腹呜转，腹中实满，虽是别道，亦是一家。 若节元气取饱，此是妙中之妙也。 导引新候要诀 夫学导引者，能勤勤行一两月，即得调和，由人用功多少，气即渐渐下。 气下时，如蚊行相似也。 气至满心下，以手指下呜，即是气到从心下，渐渐入腹。 常以手指肚，看如鼓呜，即气归； 即渐下至脐，绕腹而行，细意察之，即知腹长短大小。 腹中恶物尽出，即至涌泉，渐渐下迟，即渐渐至脚心，即出手及头。 头最难通，周一身始得通。 气遍四支，流灌百脉，一身内尽得通畅也。 此名小得。 分为阴阳，右边似玲，左边似暖，此名小得。 阳时用阳气，左边不动，阴时用阴气，右边不动，此亦小得。 从子时至巳时，为阳时； 从午时至亥时，为阴时。 昼夜以此许，用阳气左边不动，用阳将意欲右边气行解，意不在左边，气不行也。 阴时用阴意欲左边，一如用阳法。 节气长定，从如习静，一向节气欲者，意之余暇也，不得乱用。 节气长定，此名小得。 右边热用阴气过，想阳边同阴畔之玲，左用阳气过，想阴玲，阴同阳边热，故此名为使气也。 亦名小得。 使气者，是节元气之时也。 元气欲却下，意中使之问，右向左也。 使之不得，始使向左，又则使之向右。 言阳时用阳气，即使向左，阴时用阴气，即使向右，亦如阳法。 若身有患，即使气注之，不从阴阳时，但咽元气，欲却下即使，使不得乱，节气之长定，此亦名小得。 人乍闻使气，多有笑之者，气是何物？ 受尔使也。 气是神之用，意是神之灵，神之使气，气自使身，此乃神之动作也。 有何怪乎！ 故神欲动，气即牵身而令动，神欲走，气即牵身而令走，神欲外，气则牵身而令外，神欲起，气即牵身而令起。 此乃神用庞气也。 只得食，令人脚踏地动作，若用气得妙，神将身向空虚中走作也，此知意即神之灵也。 用阳气刚想玉茎只泄阳气，不泄骨精，用之弥坚，此名小得。 冬月想房室中用阳气入人来，尽觉性温，亦小得。 在热时坐家中，想阴气入来，觉清冻，此亦小得。 夫后妻得者，亦名小得。 用气调和，肚皮日觉厚，亦小得。 故身上常常退皮，亦小得。 用阴气玲如铁，硬如石，亦小得。 用阳气，能上得峻山峭壁，亦小得。 用阳气，身轻能行者，亦小得。 夏月向林中外，用阴气得草木叶润，亦小得。 有人患玲热病，用阴阳手摩之，病应手愈，亦小得。 耳听想及弦管者，悬知吉凶，亦小得。",
      "translated_text": "Thus, *qi* is such that if one does not moderate it, it will naturally exit. If one restrains and moderates it, *qi* is then governed by the person, not by *qi* itself.\n\n*Qi* is mastered by spirit, for spirit can command *qi*, and *qi* can move the body—thus, it is known that intention is spirit. When moderating *qi*, one must keep the mouth closed so that *qi* does not escape through the Celestial Gate. If the Earth Gate is open, the thief will exit through the Earth Gate, hence the mouth must always remain closed. If one feels slight oppression, open the Earth Gate and release a little, then close it again after exhalation. This is called \"releasing a little when unharmonized\"; once skill is attained, never release it again.\n\nAt the beginning of *qi* practice, the inhalation should be slow, and the exhalation swift—after three moderations, exhale once, then swiftly moderate and slow it. One may fear that moderating the primordial *qi* lacks precision, for this is the refinement of seven or eight parts. If moderating *qi* achieves seven or eight parts, and without moderation, exhalation is estimated as three parts with half released, then the mind’s moderation is without error. Once *qi* is harmonized, return to the sage’s constant method. With diligent practice, exhalation becomes increasingly slow, and when slow, the primordial *qi* is subdued and reluctant to exit.\n\n**Method for Assisting Dao Yin with Swallowing Qi**\nMaster Wang said: Those who study *Dao Yin* and practice *qi* to abstain from grain, teaching others to fast, may become somewhat weak and emaciated, hence they use swallowing *qi* to assist *Dao Yin*. Swallowing *qi* refers to swallowing coarse *qi*. When swallowing *qi*, quickly close the mouth and swallow the *qi* within the throat—thirty or twenty swallows will fill the abdomen, causing it to gurgle and churn until it feels full. Though this is a separate method, it belongs to the same family. If one moderates the primordial *qi* to achieve satiety, this is the subtlety within subtlety.\n\n**Essential Secrets of Dao Yin’s New Signs**\nThose who study *Dao Yin* and practice diligently for one or two months will achieve harmony, depending on the effort expended. *Qi* will gradually descend, feeling like the movement of a mosquito. When *qi* fills the area below the heart, press downward with the fingers to guide it—this is *qi* arriving from below the heart and gradually entering the abdomen. Frequently press the abdomen with the fingertips; if it feels like a drum’s resonance, *qi* has returned. It then gradually descends to the navel, circulating around the abdomen. Observe carefully to know the length, breadth, and size of the abdomen. When foul substances are expelled, *qi* reaches the Bubbling Spring, descending slowly until it gradually reaches the soles of the feet, then extends to the hands and head. The head is the most difficult to unblock; only when *qi* circulates throughout the entire body is it fully open. When *qi* permeates the four limbs and irrigates the hundred vessels, the entire body becomes unobstructed—this is called a \"minor attainment.\"\n\nDivided into yin and yang, the right side feels cool, the left side warm—this is a \"minor attainment.\" During yang hours, use yang *qi*, and the left side remains still; during yin hours, use yin *qi*, and the right side remains still—this is also a \"minor attainment.\" From midnight to noon is yang time; from noon to midnight is yin time. Day and night follow this pattern: during yang hours, use yang *qi* and the left side remains still; when intending to guide *qi* to the right, the mind should not dwell on the left, and *qi* will not move there. During yin hours, use yin *qi* with the intention directed to the left, following the same method as for yang.\n\nWhen moderating *qi* for an extended period, as in seated meditation, one should consistently moderate *qi* with intention during spare moments, without reckless use. This prolonged moderation of *qi* is called a \"minor attainment.\" If the right side becomes hot from excessive yin *qi*, imagine the yang side as cool as the yin side; if the left side becomes hot from excessive yang *qi*, imagine the yin side as cool as the yang side—this is called \"directing *qi*,\" also a \"minor attainment.\" Directing *qi* occurs when moderating the primordial *qi*. When primordial *qi* is about to descend, guide it with intention, directing it from right to left. If it cannot be directed, first guide it to the left, then to the right.\n\nDuring yang hours, use yang *qi* and direct it to the left; during yin hours, use yin *qi* and direct it to the right, following the same method as for yang. If the body has ailments, direct *qi* to the affected area without regard to yin or yang hours—simply swallow the primordial *qi* and guide it downward immediately, ensuring it is not disordered. This prolonged moderation of *qi* is also called a \"minor attainment.\"\n\nSome, upon first hearing of directing *qi*, may laugh, asking, \"*Qi*—what is it that you command?\" *Qi* is the function of spirit, intention is the numen of spirit, and spirit commands *qi*, while *qi* moves the body—this is the activity of spirit. What is strange about it? Thus, when spirit desires movement, *qi* pulls the body to move; when spirit desires to run, *qi* pulls the body to run; when spirit desires to go outward, *qi* pulls the body outward; when spirit desires to rise, *qi* pulls the body to rise. This is the spirit’s employment of abundant *qi*. Just as eating enables one to walk and move upon the earth, when *qi* is mastered subtly, spirit can make the body move in emptiness—this is the numen of intention as spirit.\n\nUsing yang *qi* with a firm resolve, the jade stalk only releases yang *qi*, not bone essence, and its use makes it increasingly firm—this is a \"minor attainment.\" In winter, imagine being in a chamber with yang *qi* entering from others, and one feels warm—this is also a \"minor attainment.\" In hot weather, sitting indoors and imagining yin *qi* entering makes one feel cool—this too is a \"minor attainment.\" Those who attain this after practice are also said to have a \"minor attainment.\"\n\nWhen *qi* is harmonized, the abdomen’s skin gradually thickens—this is a \"minor attainment.\" Thus, the body frequently sheds skin—this is also a \"minor attainment.\" Using yin *qi* makes one as cool as iron and as hard as stone—this is a \"minor attainment.\" Using yang *qi*, one can ascend steep mountains and cliffs—this is a \"minor attainment.\" Using yang *qi* makes the body light and agile—this is a \"minor attainment.\" In summer, standing among trees and using yin *qi* makes the leaves of grasses and trees moist—this is a \"minor attainment.\" For those suffering from cold or heat illnesses, rubbing with yin or yang hands cures the ailment instantly—this is also a \"minor attainment.\" By listening to strings and pipes in imagination, one can foresee good or ill fortune—this too is a \"minor attainment.\"",
      "overlap_context": "ches its limit, draw the primordial *qi* from the spleen and exhale it through the nose. Estimate the exhalation as two parts, then moderate and retain one part. Precisely moderate the head of the primordial *qi*; if the primordial *qi* is not moderated, it returns to the spleen and waits for the next external breath to enter before exiting. Estimate the inhalation, moderate the exhalation—thus, the breath is never interrupted. This moderation is guided by the mind, and the *qi* naturally halts.",
      "start_char": 1690,
      "end_char": 2977,
      "start_sentence": 72,
      "end_sentence": 129,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.06489086151123,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\气法要妙至诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "自视洞观，鬼神之情不能隐匿，亦小得。 心能察微意，有非常之智，亦小得。 奇方异法，古器奇宝，人不识者， 心自悟之，亦小得。 万神来附，为侍奉者，亦小得。 以身中之气能生得他人五藏气者，亦得妙也。 元气内藏，尽无出入，定息所有，到无窍之处，作出入息亦全王公曰：此是落籍逃丁，不为太阴所管者，妙也。 炼肉炼骨，轻清上浮，同太虚天地之神灵，变化自在者。 此是导引之极也，尚未与内真神同游，此名未入真人位也，号曰真人。 此气妙卫是张果先生传龙岗法，甚妙之耳。 琴心先生曰：真人云姓张氏，名果，玄宗制号通玄先生。 偶然而来，不知出其谁之子，观其神化自在，若则上古之高真也。 或问：亦曾仕於世乎？",
      "translated_text": "Seeing with inner vision, the secrets of ghosts and spirits cannot be concealed—this too is a \"minor attainment.\" The mind discerns subtle intentions, possessing wisdom beyond the ordinary—this too is a \"minor attainment.\" For extraordinary formulas, esoteric methods, ancient artifacts, and rare treasures unknown to others, the mind intuits their nature—this too is a \"minor attainment.\" Myriad spirits come to attend and serve—this too is a \"minor attainment.\" Using the *qi* within one’s body to generate the *qi* of another’s five viscera—this is a wondrous attainment.\n\nWhen primordial *qi* is stored within, with no ingress or egress, and the regulated breath reaches the place of no orifices, even the act of breathing becomes imperceptible—this is what the noble lords call \"one who has slipped the register, a fugitive no longer governed by the Great Yin,\" a wondrous state. Refining flesh and refining bones, becoming light and pure, ascending to float among the spirits of Heaven and Earth, transforming at will—this is the pinnacle of *daoyin*.\n\nYet this has not yet merged with the inner true spirit in its wanderings; such a one has not entered the rank of the Perfected. This is called the \"Perfected.\" This wondrous *qi*-guard method was transmitted by Master Zhang Guo of Dragon Ridge, most wondrous indeed.\n\nMaster Qin Xin said: The Perfected, surnamed Zhang and named Guo, was styled by Emperor Xuanzong as Master Tongxuan. He appeared suddenly, with no known lineage, yet his divine transformations were as free as those of the ancient highest Perfected. Someone asked: Did he ever serve in the world?",
      "overlap_context": "liffs—this is a \"minor attainment.\" Using yang *qi* makes the body light and agile—this is a \"minor attainment.\" In summer, standing among trees and using yin *qi* makes the leaves of grasses and trees moist—this is a \"minor attainment.\" For those suffering from cold or heat illnesses, rubbing with yin or yang hands cures the ailment instantly—this is also a \"minor attainment.\" By listening to strings and pipes in imagination, one can foresee good or ill fortune—this too is a \"minor attainment.\"",
      "start_char": 2978,
      "end_char": 3281,
      "start_sentence": 130,
      "end_sentence": 142,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.443662643432617,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\气法要妙至诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "因有丙子年为契史之说。 其如史传不载，而所传气诀，仙经阙如斯耳，乃道家之秘宝也。 静而行之三七日，彻视肠胃，还年却老，乘云陆空而登晨霞，可翘足而待之。 非夫气象合道者，不可辄传。 慎之！ 契史先生曰； 凡人腹中，三处有隔，即心有隔。 初服气皆觉心下胃中满，但少食，久作之，自觉通下。 至藏下有隔，即觉腹中满，久而行之，自觉到脐下丹田中，始觉气周行身中，由自未入鸠中候觉鸠中气出，即能与人治病。 初学必须安静处，细意行之不已，气自入腹中，於行住坐外一切处不妨。 胃中气未下入脐腹，即不入诸处，作难成。 初学服气，皆须入息时即住其息，少时似闭气满，其息出时，三分减二，还住，少时咽之，咽已又作，至腹中满，休。 必须日夜四时作为。 初学入气，欲入丹田，还易散意，欲得气相接也。 气入丹田已，纵不服气，气亦不散。 四时，朝暮子午时也。 心裹满，且勿服气，但交#3 少甘草桂心亦得，其满即散丹田，未满亦未到满也。 元气下时，自然少有闷也。 初服气时，要须朝暮二时用仰覆势，夜半及日中唯用仰势。 其仰势用低枕，仰卧缩两肩，坚两膝，伸两手着两肋边，即咽气，只咽十咽，气即满丹田。 待一时咽了，然后如意运入鸠中。 其覆势，以腹坦林，以被支胸令高，手脚并伸着状，即咽十咽，每咽皆以意运，令沿背下，从熟藏中出。 每朝暮行气，先覆后仰，每咽皆下作声，运入丹田，沿脊下亦须声作，每势十咽，即足。 如不解作声，三五咽亦不足，要解作声始得，不解作想，徒劳耳。 凡咽气，皆须喉中深徐徐咽，不得猛，猛即发嗽。 凡咽气，每一回咽，中问隔十息，亦须作事停歇，从容任事运意。 凡服气四度外，或非时腹中觉气少，气力不健，任意咽多少。 凡初服气未固，多从熟藏中下，稍宜固之，以意运令散。 初服气必须心意坦然无疑，勿畏惧。 若有畏惧，气即难行，若体力调和，必须意禀欣乐自足，不羡功名，即日胜一日，欢快无极。 不得思食，坦然无所念，始得。 若忽思食，必须抑捺，如不在意，抑捺心即须念，能抑捺者，终日对嘉宾肴膳亦无所念。 服气但不失时节，丹田中常满。 纵日别出行人事，不废修行，惯纵失一时两时，亦无妨。 若服成功者，终日不服气，气亦自足，至妙不可穷矣。 服气得脐下丹田中当满，叫唤读书，终日对人语话气力亦不少。 仍须行少地，令气向下大精服气成讫，饮食即食亦不妨气，饱食咽气，气还作声，直至脐下，成已后，兼食行气，下气无妨服气。 欲得以气推腹中粪令尽，但勿食二十日，弥佳。 若入头即食不得妙。 服气日别吃少药酒，亦好，如思食，吃少蜜姜汤，即定，仍不得多食，能常百种不食最好。 但至诚感神，百无所畏，纵体中及心胸闷不好，亦非事，久久则好。 不用吃果子，恐腹中不安稳，又恐滓秽，腹中气难行，且欲空腹，令气行。 但思久作，自觉神情有异，四体日胜，体清不可比。 方久久行气，人眼中自识善恶？ 视人从表知裹，能至心，三七日即内视肠胃。 如不至心，久久行始通，能内视五藏，历历使用，气妙不可言。 能坚用肌肤，不臧亦不病瘦，作不如法，或无坚固志，即疲弱。 凡人身中，元气常从口鼻中出入，制令不出，使丹田常满，即不至饥，其神清明，求死不可得也。",
      "translated_text": "Here the *bingzi* year is said to have been his appointment as a scribe. Yet no such record appears in the histories, and the transmitted *qi*-methods, absent from the immortal classics, are thus the secret treasures of the Daoist tradition. Practiced in stillness for twenty-one days, they allow one to see clearly through the intestines and stomach, to restore youth and reverse aging, to ride the clouds and traverse the void, ascending into the morning mist—this may be awaited with toes raised in anticipation. Only those whose *qi*-signs harmonize with the Dao may receive this transmission. Take heed!\n\nMaster Qishi said: Within the human abdomen, there are three barriers, including one at the heart. When first practicing *qi*-ingestion, one invariably feels fullness below the heart and in the stomach; simply eat less, and with prolonged practice, the passage will naturally open downward. When the barrier below the viscera is reached, fullness is felt in the abdomen; with persistent practice, one senses the *qi* arriving at the cinnabar field below the navel, where it begins to circulate throughout the body. Only when the *qi* has not yet entered the *jiuzhong* does one feel the *qi* emerge there—then one gains the ability to heal others.\n\nBeginners must practice in a quiet place, proceeding with meticulous care. The *qi* will naturally enter the abdomen, and this may be done whether walking, standing, sitting, or in any other circumstance. If the *qi* in the stomach has not descended into the navel and abdomen, it will not enter the other regions, making success difficult.\n\nWhen first learning *qi*-ingestion, one must, upon inhaling, pause the breath briefly, as if holding it until fullness is felt. Upon exhaling, reduce the breath by two-thirds, then pause again briefly before swallowing. After swallowing, repeat the process until the abdomen is full, then rest. This must be practiced day and night, in all four seasons.\n\nWhen first drawing *qi* inward, intending it to enter the cinnabar field, it easily scatters if the mind is distracted; one must ensure the *qi* connects seamlessly. Once the *qi* has entered the cinnabar field, even if one ceases *qi*-ingestion, the *qi* will not disperse.\n\nThe four seasons refer to dawn, dusk, midnight, and noon. If the heart feels full, do not ingest *qi*; instead, take a small amount of licorice or cassia heart to disperse the fullness. If the cinnabar field is not yet full, it has not reached fullness.\n\nWhen the original *qi* descends, one naturally feels a slight oppression. When first practicing *qi*-ingestion, one must use the prone and supine postures at dawn and dusk, while at midnight and noon, only the supine posture is used.\n\nFor the supine posture, use a low pillow, lie on the back, draw in the shoulders, raise the knees, and extend the hands to the sides of the ribs. Then swallow the *qi* ten times, and the cinnabar field will be full. After an hour of swallowing, guide the *qi* at will into the *jiuzhong*.\n\nFor the prone posture, lie with the abdomen flat on the bed, support the chest with a quilt to raise it, and extend the hands and feet. Then swallow the *qi* ten times, each time guiding it with the mind to descend along the spine and exit through the \"ripe viscera.\"\n\nAt dawn and dusk, when practicing *qi*-ingestion, first adopt the prone posture, then the supine. With each swallow, make a sound as you guide the *qi* downward into the cinnabar field, and also make a sound as it descends along the spine. Ten swallows per posture are sufficient. If one does not know how to make the sound, even three or five swallows will not suffice; one must learn to make the sound to succeed. Without this intention, the effort is in vain.\n\nWhen swallowing *qi*, always swallow deeply and slowly in the throat; do not do so forcefully, as this may provoke coughing. With each swallow, pause for ten breaths in between, and take breaks as needed, proceeding with ease and guiding the *qi* with the mind.\n\nBeyond the four regular *qi*-ingestion sessions, if at any time the abdomen feels deficient in *qi* or the strength wanes, swallow as much as desired. When first practicing *qi*-ingestion, the *qi* often descends from the \"ripe viscera\"; gradually stabilize it by guiding it with the mind to disperse.\n\nWhen first practicing *qi*-ingestion, the mind must be open and free of doubt, without fear. If fear is present, the *qi* will be difficult to circulate. When the body’s strength is harmonized, the mind must be joyful and content, free from desire for fame or achievement—then progress will be made day by day, with boundless delight.\n\nOne must not think of food, remaining open and free of distractions—only then will success come. If thoughts of food arise, they must be suppressed; if one does not take them seriously, the mind will still dwell on them. Those who can suppress such thoughts will remain undistracted even when facing sumptuous feasts all day.\n\nAs long as one does not miss the proper times for *qi*-ingestion, the cinnabar field will remain full. Even if one engages in worldly affairs during the day, cultivation is not abandoned. Missing an hour or two occasionally is of no consequence. For those who have succeeded in *qi*-ingestion, even if they do not practice it all day, their *qi* will remain sufficient—its wonders are inexhaustible.\n\nOnce the cinnabar field below the navel is full, one may call out, read, or converse with others all day without losing strength. One should still engage in light movement to guide the *qi* downward. After mastering *qi*-ingestion, eating is not harmful to the *qi*; even after a full meal, swallowing *qi* will cause it to resonate until it reaches the area below the navel. After success, one may eat while practicing *qi*-ingestion, and the descending *qi* will not interfere with the practice.\n\nTo expel all waste from the abdomen, simply refrain from eating for twenty days—this is even better. If one eats immediately after *qi*-ingestion, the results will not be refined. Each day, drinking a little medicinal wine is beneficial. If one craves food, a small amount of ginger-honey broth will settle the stomach, but one must not eat much. Abstaining from all foods is best.\n\nOne must be utterly sincere and free of fear. Even if the body or chest feels oppressed or unwell, it is of no concern—with time, it will improve. Do not eat fruits, as they may unsettle the abdomen or leave residue, hindering the flow of *qi*. Keep the abdomen empty to allow the *qi* to circulate.\n\nWith persistent practice, one will naturally sense a change in spirit and vitality, with the body growing stronger day by day, its clarity unmatched. After prolonged *qi*-ingestion, will one’s eyes naturally discern good and evil? One will perceive others’ inner nature from their outward appearance. With a sincere heart, after twenty-one days, one will internally visualize the intestines and stomach. Without such sincerity, prolonged practice will eventually open the passage, allowing one to internally visualize the five viscera in vivid detail—its wonders are beyond words.\n\nOne’s skin and flesh will become resilient, neither gaining nor losing weight, and one will not fall ill. If the practice is improper or the resolve is not firm, one may grow weak.\n\nIn the human body, the original *qi* constantly enters and exits through the mouth and nose. By restraining its outflow and keeping the cinnabar field full, one will not feel hunger, the spirit will be clear and bright, and even death will be unattainable.",
      "overlap_context": "anderings; such a one has not entered the rank of the Perfected. This is called the \"Perfected.\" This wondrous *qi*-guard method was transmitted by Master Zhang Guo of Dragon Ridge, most wondrous indeed.\n\nMaster Qin Xin said: The Perfected, surnamed Zhang and named Guo, was styled by Emperor Xuanzong as Master Tongxuan. He appeared suddenly, with no known lineage, yet his divine transformations were as free as those of the ancient highest Perfected. Someone asked: Did he ever serve in the world?",
      "start_char": 3281,
      "end_char": 4559,
      "start_sentence": 143,
      "end_sentence": 190,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.66822910308838,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\气法要妙至诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "服气丹田满，如闷即还令从四肢及顶上出。 第一莫令从口鼻出散，虽食百味饮食，但得虚肥，身受百病，渐入死地。 凡人饮食酒肉，一时虽得勇健，百病皆易生，瘴疠蛊毒，逢即被伤。 能服元气，久久行之，诸毒不能伤，一切疾病皆治，久久自知，服气初了，或冲上从口鼻出，即须咽津液，勿咽入息，恐外气入。 初学服气取气多，或胀满搅转作声不安，即须数数以意运气逐肠中宿粪，去尽即好，令肚空，其气在腹，即得安稳。 如逐粪未尽，肠问搅转不安，任下泄一两下，即宽。 虽下泄失气，续更咽添之，意者常令丹田气满，即住一日一夜。 总有六时咽气，子寅辰午申戌，此日夜六时，丹田开受。 气法要妙至诀竟 #1闲：按文义当作『闭』。 #2当：按文义当作『常』。 #3交：按文义当作『咬』。",
      "translated_text": "When the cinnabar field is full of ingested *qi* and one feels stifled, allow it to exit through the four limbs and the crown of the head. Above all, prevent it from dispersing through the mouth and nose. Though one may consume all manner of rich foods, the body will only grow hollowly plump, inviting a hundred ailments and gradually leading to death’s door. For those who indulge in wine and meat, though they may feel vigorous and strong for a time, all manner of illnesses easily arise, and miasmas, pestilence, and poisons will harm them upon encounter. By ingesting the original *qi* and practicing this over time, no toxin can cause injury, and every illness may be cured—with prolonged practice, one will come to know this naturally.\n\nWhen first completing the ingestion of *qi*, if it surges upward and exits through the mouth or nose, one must swallow saliva but not inhale, lest external *qi* enter. Beginners who draw in too much *qi* may experience bloating, discomfort, or rumbling sounds; in such cases, repeatedly guide the *qi* with intention to expel stagnant waste from the intestines. Once the bowels are empty, all will be well, and the *qi* will settle calmly in the abdomen. If the waste is not fully expelled and the intestines remain unsettled, one may allow a brief release of one or two bouts of flatulence to ease the discomfort. Though some *qi* may be lost in the process, simply ingest more to replenish it, ensuring the cinnabar field remains full at all times—this may be maintained for a full day and night.\n\nIn total, there are six periods for ingesting *qi*: *zi*, *yin*, *chen*, *wu*, *shen*, and *xu*—these six intervals of day and night are when the cinnabar field opens to receive it. The essential subtleties of the *qi* method conclude here.",
      "overlap_context": "e five viscera in vivid detail—its wonders are beyond words.\n\nOne’s skin and flesh will become resilient, neither gaining nor losing weight, and one will not fall ill. If the practice is improper or the resolve is not firm, one may grow weak.\n\nIn the human body, the original *qi* constantly enters and exits through the mouth and nose. By restraining its outflow and keeping the cinnabar field full, one will not feel hunger, the spirit will be clear and bright, and even death will be unattainable.",
      "start_char": 4559,
      "end_char": 4885,
      "start_sentence": 191,
      "end_sentence": 202,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.248958110809326,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\气法要妙至诀.txt",
        "category": "方法类"
      }
    }
  ]
}