{
  "source_id": "水镜录",
  "source_file": "chunked_daozang\\水镜录.json",
  "total_chunks": 8,
  "total_original_chars": 6539,
  "total_translated_chars": 37747,
  "total_translation_time": 197.478919506073,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏续道藏\\水镜录.txt",
    "category": "正统道藏续道藏"
  },
  "full_translation": "**The Water Mirror Record**\n\n**Scripture Title:** *The Water Mirror Record*. One fascicle. Base text from *The Wanli Continuation of the Daoist Canon*.\n\n**The Supreme Lord’s Treatise on Retribution**\n\nThe Supreme Lord said:\nFortune and misfortune have no fixed gate—only man summons them himself. The retribution for good and evil follows like a shadow clinging to form. Thus, heaven and earth possess spirits that oversee transgressions, diminishing a person’s allotted lifespan according to the severity of their offenses.\n\nWhen lifespan is reduced, poverty and depletion follow, along with frequent sorrows and calamities. All shun such a person; punishments and disasters pursue them, while blessings flee, and malevolent stars bring harm. When lifespan is exhausted, death ensues.\n\nMoreover, the Three Terraces and the Lords of the Northern Dipper constantly hover above a person’s head, recording their sins and seizing their allotted years. Within the body dwell the Three Corpses spirits, who, on every *gengshen* day, ascend to the celestial courts to report one’s transgressions. Likewise, on the last day of each lunar month, the Stove God does the same.\n\nFor every human fault—whether grave enough to forfeit one’s destiny or minor enough to reduce one’s lifespan—the offenses, great or small, number in the hundreds.\n\nThose who seek longevity must first avoid such transgressions. Follow the Dao, and you advance; stray from it, and you retreat. Do not tread crooked paths nor deceive in hidden chambers. Accumulate virtue and amass merit. Cultivate compassion toward all beings, uphold loyalty, filial piety, fraternal duty, and brotherly love. Rectify yourself to transform others. Pity orphans and relieve widows. Honor the aged and cherish the young. Even insects and plants must not be harmed.\n\nOne should grieve at others’ misfortunes, rejoice in their goodness, aid those in dire straits, and rescue those in peril. Regard another’s gain as your own, and another’s loss as your own. Do not expose others’ faults nor flaunt your own strengths. Suppress evil and extol virtue. Take less and give more. Bear humiliation without resentment, receive favor with awe. Bestow kindness without seeking repayment, and when giving to others, harbor no regret.\n\nSuch is the good person—all respect them, the Dao of Heaven protects them, and fortune and prosperity follow. All malevolent forces keep their distance.\n\nThe spirits and deities guard them, and all their undertakings shall surely succeed; even immortality may be hoped for. Those who seek celestial immortality must accumulate one thousand three hundred good deeds; those who seek earthly immortality must accumulate three hundred.\n\nYet if one acts without righteousness, moves against principle, treats evil as ability, or cruelly inflicts harm; if one secretly injures the good and kind, covertly slanders lord and kin, or disrespects one’s teachers; if one betrays one’s superiors, deceives the ignorant, or slanders fellow disciples; if one engages in falsehood, fraud, or deception, attacks and exposes one’s kin, or acts with unyielding cruelty; if one is perverse and self-willed, judges right and wrong unfairly, or takes sides inappropriately; if one oppresses subordinates to claim merit, flatters superiors to curry favor, or receives kindness without gratitude while nursing grudges endlessly; if one scorns the common people, disrupts state governance, rewards the unrighteous, or punishes the innocent; if one kills for wealth, overthrows others for position, slays the surrendered or executes the compliant, demotes the upright or ostracizes the worthy; if one bullies the orphaned and coerces the widowed, abandons the law for bribes, twists straight into crooked, or turns crooked into straight; if one lightens the heavy and adds to the light, or rages when killing is seen; if one fails to correct faults or refuses to do good, shifts blame onto others, or obstructs the Way and its arts; if one mocks and slanders sages and worthies, or encroaches upon the virtuous; if one shoots flying birds or chases running beasts, disturbs hibernating creatures or startles roosting fowl, fills burrows or overturns nests, or destroys embryos and breaks eggs; if one wishes for others’ failures, ruins others’ successes, endangers others for one’s own safety, or diminishes others for one’s own gain; if one exchanges good for evil, or sacrifices the public for private gain; if one steals others’ abilities, conceals others’ virtues, exposes others’ flaws, or reveals others’ secrets; if one depletes others’ wealth, separates others’ kin, seizes what others love, or aids others in wrongdoing; if one indulges in willfulness and tyranny, humiliates others to prevail, or destroys others’ crops; if one disrupts others’ marriages, grows arrogant in wealth, or acts shamelessly in escape; if one claims others’ kindness as one’s own or shifts blame onto others, or shifts misfortune onto others; if one trades in false reputation, harbors malicious intent, undermines others’ strengths, or defends one’s own flaws; if one exploits power to coerce, indulges in violence and killing, or wantonly cuts and slaughters; if one cooks and butchers without reason, scatters and wastes the five grains, or harasses living beings; if one destroys others’ families to seize their treasures, breaches dams or sets fires to harm dwellings, disrupts plans to ruin others’ work, or damages others’ tools to deprive them of use; if one, seeing others’ glory and wealth, wishes for their demotion, or seeing others’ riches, wishes for their ruin; if one, seeing another’s beauty, covets them in secret, or owing another’s wealth, wishes for their death; if one, when desires are unmet, curses in resentment, or when seeing others’ misfortune, speaks of their faults; if one laughs at others’ physical imperfections or suppresses others’ praiseworthy talents; if one employs sorcery to harm others or uses poison to kill trees; if one bears grudges against teachers or offends parents and elder brothers; if one takes by force or seizes by greed, plunders the wealthy, or schemes for promotion; if one metes out rewards and punishments unfairly, indulges in excess, or oppresses subordinates; if one intimidates others, blames Heaven and resents others, curses the wind and scolds the rain; if one incites disputes and litigations, forms cliques blindly, or heeds the words of wives and concubines over parents’ teachings; if one forgets the old for the new, speaks one way while thinking another, or covets and deceives for wealth; if one lies to superiors, fabricates malicious words, or slanders the innocent; if one defames others to appear upright, or curses deities to seem just; if one abandons loyalty to follow rebellion, turns from kin to favor strangers, invokes Heaven and Earth to witness base intentions, or calls upon spirits to witness vulgar deeds; if one regrets giving or fails to return what is borrowed; if one pursues what is beyond one’s due or forces efforts beyond one’s strength; if one indulges in excessive lust, harbors cruelty beneath a kind facade, or serves filthy food to others; if one misleads the masses with heterodox ways, uses short measures and narrow weights, or mixes false with true to seek illicit profit; if one presses the good into servitude, deceives the foolish, or is insatiably greedy; if one curses to prove oneself right, indulges in wine to the point of madness, or stirs strife among kin; if men are unfaithful and women ungentle, if one sows discord in the household or disrespects one’s husband; if one is constantly boastful and jealous, neglects duties to wife and children, or disrespects parents-in-law; if one slights ancestral spirits or defies the commands of superiors; if one engages in useless acts, harbors disloyalty, or curses oneself and others; if one shows partial love or hatred, leaps over wells or stoves, or jumps over food or people; if one harms children or causes miscarriages, acts in secret and perverse ways, sings and dances during inauspicious days, or wails and rages at the new moon; if one spits, weeps, or urinates in front of others, sings or wails near kilns, burns incense at the stove, or cooks with filthy firewood; if one rises naked at night, executes punishments during the eight solar terms, spits at shooting stars or points at rainbows, or constantly gazes at the sun and moon; if one hunts and burns in spring, curses facing north, or kills turtles and beats snakes without cause—such sins shall be weighed by the Deities of Fate, who will deduct from one’s allotted lifespan accordingly. When the lifespan is exhausted, death follows; if sins remain, misfortune extends to descendants.\n\nMoreover, those who wrongfully seize others’ wealth shall have their wives, children, and household counted against them, gradually leading to death and ruin.\n\nIf no death or ruin befalls them, then water, fire, bandits, thieves, lost possessions, illness, slander, and myriad troubles shall serve as repayment for their wrongful gains. Those who unjustly kill others merely exchange blades to slay one another. Taking wealth by improper means is like a starving man eating poison to stave off hunger, or a parched man drinking venom to quench his thirst—though it may grant temporary relief, death will soon follow.\n\nWhen the heart stirs with goodness, though the good deed remains undone, auspicious spirits already attend; when the heart stirs with evil, though the wicked act remains unexecuted, inauspicious spirits already follow. If one has committed evil in the past but later reforms, refraining from all wrongdoing and practicing every virtue, in time they shall surely receive blessings—this is what is meant by \"turning misfortune into fortune.\"\n\nThus, the fortunate speak kindly, see kindly, and act kindly; if they perform three acts of goodness in a day, Heaven shall bestow blessings upon them in three years. The wicked speak cruelly, see cruelly, and act cruelly; if they commit three evils in a day, Heaven shall bring calamity upon them in three years. Why not strive to practice this?\n\n*Admonition to Scholars by Lord Emperor Zitong*\n\nLord Emperor Zitong declares:\n\nOne who is intelligent, upright, and abides in benevolence need not choose between paths; one who is magnanimous, sincere, loyal, and devoted to righteousness naturally follows in its wake. Thus, moved by the earnestness of your innermost hearts, I offer this silent teaching in gentle guidance. Hear now my admonitions, all you assembled scholars.\n\nIt is said that wealth and honor lie with Heaven, while gain and loss are decreed by fate. Those who understand this rest content in the natural order and make no petition or complaint; those who do not grasp it covet what they deem certain and resort to supplication. Some claim that when spirit and essence commune, dreams and waking visions align; others insist that lavish sacrifices summon the presence of gods and spirits. Palaces and towers soar with emerald tiles; steps and corridors gleam with vermilion railings carved in jade. Yet in pursuing such vanities, one loses the root of authenticity, unaware of advance or retreat, oblivious that survival and ruin depend on forces beyond. The ranks of officials—three classes and four ranks—rise or fall, advance or retreat, all governed by these principles.\n\nThe Five Bureaus and Six Terraces are overseen by their respective stewards; how could one scheme to seize their favor? Yet one must not be bound by predestination nor remain deluded in self-cultivation. Thus, those who refine their conduct and strive in virtue shall surely receive a hundred blessings from Heaven; those who defy the Dao and corrupt their virtue shall have the five fortunes stripped away by the gods. Such principles are manifest, though men may not perceive them. Thus, fate’s hidden patterns may bring misfortune where none was expected, while baleful stars may shine yet bestow unexpected fortune. Creation’s ebb and flow, the gods’ calculations of gain and loss—all these govern the world. You scholars must reverently uphold and propagate this teaching.\n\nDo not deceive Heaven as though it were distant; do not presume the gods are too remote to know. Never say that the dark chamber may be deceived, nor that the bright hall need not be feared. Do not bully the orphaned or widowed, nor mock the elderly and venerable. Do not seize wealth that is not rightfully yours, nor lust after another’s spouse. Do not cultivate close ties with outsiders while estranging kin, nor form righteous bonds with strangers while sowing discord among brothers. Do not boast of your strengths, nor attack others’ weaknesses. Do not indulge in ease and pleasure, nor waste time in idle hunting. Do not rely on talent and reputation, nor wield official power to oppress. Do not venerate immortals and Buddhists while slighting your parents, nor revere ghosts and gods while disrespecting your teachers.\n\nShould any defy these words, they shall not escape Heaven’s judgment. Why is it that those of refined talent and lifelong learning often stumble in the examination halls, while those of sudden brilliance swiftly rise to local acclaim? All is bound by hidden affinities, not mere happenstance. Those who secretly slander and inwardly revile often find pretexts for their grievances; those who flatter to one’s face yet defame behind their back deceive only themselves. The arbiters of literary merit do not act out of favoritism; the dispensers of rank and emolument do not bestow them arbitrarily. O multitude of scholars, Heaven may yet look upon you with favor; towering achievements shall be mine to reward.\n\nLet this proclamation be spread far and wide, that all may hear and know.\n\n**Further Edict**\nThis year’s selection of scholars shall not be confined to a single criterion; the essential aim is to obtain worthy men and fulfill the people’s expectations. First, those who accumulate hidden merit and practice filial piety shall be esteemed; second, those who conduct themselves with humility and harmony shall be deemed virtuous. Those who study diligently shall be rewarded for their labor; those of exceptional talent shall have their aspirations fulfilled. The arrogant and careless shall not escape demotion; the frivolous and shallow shall be shown both encouragement and punishment. Literary works shall be evaluated to determine their retention or dismissal; the gods shall oversee the fairness of their judgment.\n\nIf men do not reflect upon themselves, let these admonitions be made clear: It is said that scholars are not defined by innate ability but by diligent study; though they may dwell in poverty, fame shall bring them wealth. Distinctions of high and low matter not—what matters is industrious effort. Before officials compare the short and long of virtue and achievement, they first assess the quality of one’s writing. Do not claim that predestination precludes diligent study, nor use past affinities as an excuse for neglecting self-cultivation. Though one may bear the name of scholar, if they possess not an inch of a scholar’s conduct; though they may wear the robes of a Confucian, if they merely present an outward appearance of refinement—such men do not revere Heaven and Earth, nor believe in the gods. They mock the elderly and venerable, disdain their elders, defy their parents while indulging in idleness, and neglect their teachers while living in dissipation.\n\nIf they fail the examination, they blame the examiners for injustice; when the list is first posted, they claim the mediocre have been unjustly favored. Those who demand much of others fail to demand it of themselves; those who criticize others thereby criticize Heaven. Some rely on their own views to suppress others’ abilities; some flaunt their strengths to attack others’ weaknesses. Some boast of their learning while disregarding the world; some grasp a single insight and look down upon all others. Those who stand without integrity use obscurity and greed as their skills; those whose hearts lack sincerity employ cunning and deceit as their strengths. They compare short and long without fairness, seize from one to give to another without regard for others’ words, flatter to one’s face yet slander behind their back to curry favor, and speak with forked tongues to alienate all around them.\n\nOutwardly, they may appear kind and gentle, uttering clever and honeyed words, but within, their hearts are cruel and violent, delighting in treachery and secret schemes. They do not choose their friends wisely, consorting with unrighteous companions; they do not harmonize their households, indulging in illicit affairs. They do not avoid unjust wealth, nor resist another’s spouse.\n\nAbandoning one’s own fields to weed another’s—how many losses have been thus incurred? Engaging in what is useless while harming what is beneficial—what greater harm could there be? Those who pass the local examinations grow complacent, believing their ambitions fulfilled, and cease further cultivation. Those who enter the provincial examinations claim their success and fame are assured, as if within easy reach. Relying on talent, they grow arrogant toward others; flaunting their seniority, they bully the solitary. They habitually seek favor with the powerful, boasting of their connections, while dismissing their peers with a mere word or fragment of writing. In the marketplace, they collude in trade to covet gains; before magistrates, they collude in litigation to satisfy their demands. Disloyal and undutiful, they willingly break the law and delight in it; acting against propriety and benevolence, they follow their impulses without restraint. They hunt and gamble without measure, squandering time; drowning in drink, they waste their spirit; flaunting their might, they ruin their virtue. Thus, they repeatedly fail in the examinations—how dare they hope for glory and splendor?\n\nMoreover, having done no diligent study in their first three years, they suddenly entertain hopes of passing the imperial exams. When they meet with no success, they attribute it to fate; when they have some ability, they devote themselves entirely to prayers and supplications. Unaware that the decree of Heaven is inescapable, they only deepen the confusion in people’s hearts. In every word and silence, Heaven observes; in every advance and retreat, in every bestowal and deprivation, the gods preside. How can one rely on luck or scheming to attain success? Only with conduct worthy of record can one hope for soaring achievement.\n\nIn recent times, after the transmission of family trades, many renowned scholarly lineages—those who had long worn the scholar’s cap and upheld their traditions—have instead been demoted or fallen into obscurity. Meanwhile, the sons of tradesmen, content in their station and devoted to study, show no arrogance in bearing or demeanor. By contrast, the descendants of scholarly families, relying on their noble lineage, often grow haughty and overbearing. The divine and impartial selection process serves to spur on the frivolous, while the revolving Way of Heaven rewards the honest and unassuming. If one can awaken to this truth, conceal one’s light, and bide in obscurity, then with diligent effort and苦志, one may fulfill one’s aspirations by exhausting the work of hidden virtue and cultivating a heart of loyalty and filial piety.\n\nIf, instead, the simple and honest ways of high antiquity fade without trace, and the degenerate customs of the final age naturally prevail, then even families that transmit the *Book of Songs* and the *Book of Rites* will see their scholarly honors restored only when they conduct themselves with humility and harmony, restoring their original bearing. Heaven does not fail those who strive—scholars should devote themselves to study. Let all who would be gentlemen take heed.\n\n**On Hidden Virtue Extending Longevity**\n\nA single moment of awakening is the foundation for attaining the threefold longevity of the Three Primordials; the cultivation of a single virtue is especially the means to nurture the lifeline of the Three Primordials. How crucial it is that one cannot afford not to awaken, nor can one neglect the cultivation of virtue!\n\nLaozi said: “My life rests with me, not with Heaven.”\nThe Perfected of Purple Yang said: “The great elixir is cultivated with ease or difficulty—it must depend on me.”\n\nIf left to Heaven, unless one accumulates deeds and bestows hidden virtue, myriad demons will arise as obstacles—how can one trust in that? The Daoist Guo Taishi was skilled in discussing the heavens. After receiving a book from the heavens, later astrologers who calculated the stars invariably sought his method. They spoke of the Five Phases and the Four Pillars, of stellar movements and fateful limits—such that wealth, nobility, longevity, poverty, lowliness, illness, suffering, misfortune, and early death were as clear as reflections in a mirror or tallying marks on a tally. The people of the world seemed unable to escape their destined numbers. Yet upon closer examination, while many cases aligned with the book, many did not. Why is this? Are some people in the universe bound by fate, while others are not?\n\nI have reflected on this: the profound and subtle calculations were meticulously laid out earlier, but later it is said: “Hidden virtue can extend life; the fortunate remain free of misfortune.” It is also said: “Acting with kindness in response to circumstances, even if one offends inauspicious stars, there is nothing to fear.” There must be insight here. Otherwise, why would it be said that “whether one lives long or dies young is not a matter of fate, but of cultivation—it rests with the person”?\n\nWhy did the Perfected Sun Simiao make such a statement? The Perfected of the Great Ultimate, Xu Laile, once encountered the Longevity Star of the Southern Dipper and inquired about the fortunes of life and death. The Star Lord replied: “The Way of Heaven blesses the good and punishes the wicked; the divine rewards virtue and penalizes evil. If one can wholeheartedly do good, abiding in stillness in harmony with the Dao and acting in accord with fortune, then ‘my life rests with me’—it is not controlled by the star of death. One does not seek longevity yet attains it; one does not seek life yet preserves it. But if one undermines the moral order, defies Heaven and Earth, indulges in folly and perversity, insults the divine, turns against benevolence and mercy, and neglects loyalty and filial piety, then in the manifest world, the net of law will bind them, and in the hidden realm, ghosts and spirits will punish them. Such a one, unaware of what they have accumulated, will have their lifespan secretly diminished and their life cut short.”\n\nHidden virtue, like Yu the Duke who administered justice and saw his son become a chancellor, or Xu the Duke who accumulated goodness and became a ceaseless stream of dukes and marquises—such cases are too numerous to mention. Once, a bhikkhu with the six supernatural powers dwelled in the wilderness with a śrāmaṇera. The bhikkhu knew the śrāmaṇera would die in seven days, so he said: “Your parents miss you—go home for a visit and return in eight days.” On the eighth day, the śrāmaṇera indeed returned. The bhikkhu, in a state of samādhi, examined the matter and found that on the way home, the śrāmaṇera had removed his robe to dam a stream, preventing water from entering an ant nest. Thus, his life was extended by twelve years.\n\nWhen Sun Shu’ao was a child, he saw a two-headed snake and, fearing others would see and kill it, buried it. His mother said: “I have heard that those who possess hidden virtue receive Heaven’s blessing in return—you will not die.” Later, he became the Prime Minister of Chu.\n\nBao Yujun once dreamed at night that his grandfather told him: “You will have no sons in your old age, and your life will not be long. You should cultivate hidden virtue early.” From then on, Yujun tirelessly practiced hidden virtue. Later, he dreamed again of his grandfather, who said: “Heaven, in recognition of your hidden virtue, has extended your life by thirty-six years, granted you five sons, and bestowed upon your descendants honor and prominence, dwelling in the grotto-heavens.” Fan Zhongyan wrote a record of this.\n\nFrom this, we see that the threefold longevity of the Three Primordials is indeed attained through a single moment of awakening.\n\nThe threefold longevity of the Three Primordials also depends on the cultivation of a single virtue.\n\nSome may ask: *How does one cultivate hidden virtue?*\nThe answer: *In all things that can be cultivated, one must not be constrained by wealth or poverty, nobility or lowliness, nor should one force actions beyond one’s capacity. Rather, wherever there is water or fire, bandits or thieves, hunger or cold, sickness or suffering, imprisonment or coercion, travel or peril, cruelty or danger, hardship or difficulty—even among flying birds, swimming fish, moving beasts, or growing plants—wherever one’s strength reaches, one should employ every expedient means. Thus, hidden virtue becomes boundless, and the measure of one’s reward will correspond. How excellent!*\n\nThe *Record of Xishan* states: *Meeting a perfected one and obtaining the true method, though called the result of self-cultivation, is also the reward of hidden merit.* This is why I have appended my reflections to the text and composed a discourse titled *Hidden Virtue Extends Longevity*.\n\n**Written by Li Pengfei, the Clear-Hearted Elder of Jiuhua**\n\n---\n\n### **On Liberating Life**\n\nI have heard that the most precious thing in the world is life, and the most grievous is killing. Thus, when captured, even lice flee for their lives; when rain approaches, even ants seek shelter. Yet why do men cast nets upon the mountains and drag lines through the depths, devising countless means to ensnare? Why bend hooks and loose arrows, setting traps with a hundred stratagems? They strike such terror that creatures lose their courage and scatter in panic—mothers torn from their young, imprisoned in cages like convicts in dungeons, or laid upon the butcher’s block as if facing execution. The deer that licks its fawn’s wounds severs its own tender heart; the ape that fears death weeps at the sight of a drawn bow. To rely on one’s strength to oppress the weak is unjust; to consume another’s flesh to sustain one’s own body is unbearable.\n\nThus, the August Heaven shows compassion, and the ancient sages practiced benevolence. King Tang of Shang reduced the mesh of his nets, and Zichan of Zheng raised fish in ponds. How noble! The flowing water moistens withered stalks, and the spring nourishes the parched. How tragic! The Buddha offered his own flesh to save a starving tiger. The Venerable Zhiyi of Tiantai dug ponds for liberating life; the Immortal of the Great Tree protected nesting birds. The Chan master who ransomed fish and shrimp left a legacy of kindness; the Perfected One who saved the dragon’s son passed down his compassionate influence. A single liberated ant allowed a novice monk to transform a short life into a long one, and a scholar to rise from obscurity to high rank. A single freed turtle enabled Mao Bao to escape peril and Kong Yu to be enfeoffed from a humble post. Qu Shi released carp in Yuan Village and gained twelve more years of life; the Marquis of Sui saved a snake in Qi’s wilderness and was repaid with a pearl of a thousand gold. The brewer who rescued a drowning fly was spared the death penalty; the kitchen maid who spared a turtle about to be cooked recovered from her grave illness. The magistrate Zhang redeemed lives from the butcher and ascended to the heavenly realms; Li Jingwen’s poison was neutralized by cinnabar after sparing a fish from the hook. Sun Liangsi, by freeing birds from snares, received divine aid in divining his burial site; Magistrate Pan, by lifting the ban on fishing in rivers and lakes, was mourned by aquatic creatures upon his departure. The foolish villagers of Xiangfu, who spared the old rabbit, were blessed with timely rain; the hunters of Caoxi, who released their prey, spread the Dao across the land. The sparrow that returned a jade ring in gratitude, the orphaned crane that taught its savior the art of immortality—even the wounded and the desperate find life: the white-haired elder who heard the sutra by offering a jade disk, the man in peril who dreamed of a yellow-robed figure. Every act of kindness is repaid; no good deed lacks evidence. These stories are recorded in books and known to all. May all who encounter living beings arouse compassion, relinquish transient wealth, and perform acts of mercy. Whether saving many lives or a single insect, all are virtuous deeds. Through daily accumulation and monthly growth, one’s deeds expand and blessings deepen. When compassion fills the world, one’s name reaches the celestial courts. Clearing karmic obstacles brings manifold blessings in this life; cultivating good roots ensures blessings for future lives. If one further assists by chanting the Buddha’s name and reciting scriptures, dedicating the merit to guide beings toward the Western Pure Land, ensuring they forever escape the evil destinies—then one’s heart is vast, one’s virtue profound, one’s Daoist practice swiftly perfected, and one’s lotus throne born in the highest grade.\n\n---\n\n### **Seven Precepts Against Killing**\n\nPeople today eat meat, believing it natural, and thus indulge in killing, amassing karmic debts. This has become a common custom, unquestioned and unnoticed—truly a cause for weeping and endless sighs. Their delusions can be summarized in seven points, listed below; the rest may be inferred by analogy.\n\n**1. Do not kill on birthdays.**\nAlas, our parents endured great hardship to give us life. The day of our birth is the day our parents approached death. On this day, one should abstain from killing, fast, and perform good deeds, so that departed ancestors may swiftly attain liberation, and living parents may enjoy increased blessings and longevity. How can one forget the mother’s suffering and instead kill living beings, bringing harm to one’s parents above and misfortune to oneself below? Even Emperor Taizong of Tang, a ruler of ten thousand chariots, refrained from celebration on his birthday. A humble farmer who reaps an extra ten bushels of grain may host feasts for days, yet does not realize the folly. Some, on their birthdays, feed monks, recite the *Lotus Sutra*, or perform other good deeds—how wise they are!\n\n**2. Do not kill when a child is born.**\nPeople grieve when childless and rejoice when blessed with a child, yet they do not consider that all creatures, even birds and beasts, love their young. To celebrate the birth of one’s own child by causing the death of another’s—how can one’s heart bear it? When an infant is born, instead of accumulating merit, one kills and creates karma—how foolish! There was once a hunter who, drunk at night, mistook his young son for a roebuck. He sharpened his blade and prepared to kill him. His wife wept and pleaded, but he would not listen. He slit the child’s belly and pulled out his intestines. Only after sleeping it off and waking at dawn did he call for his son, intending to sell roebuck meat in the market.\n\nHis wife wept and cried, \"What you killed last night was our son!\" The man leapt up in horror, his five viscera bursting asunder.\n\nAlas! Though human and beast differ, the love for one’s child is the same—how could one bear to kill?\n\n**3. Do not kill to sustain livelihood.**\nFor the sake of clothing and food, people hunt, fish, or slaughter oxen, sheep, pigs, and dogs to make a living. Yet I observe that those who do not engage in such trades also have clothing and food—they do not necessarily freeze or starve to death. To kill for livelihood is utterly abhorrent to divine principle. Those who prosper through killing are fewer than one in a hundred. Such acts plant the deepest seeds of hell and reap dire retribution in future lives—nothing is more grievous. Why not seek another means of livelihood?\n\nI have witnessed a butcher of sheep, at the brink of death, bleating like a sheep; and a seller of eels, on his deathbed, biting like an eel. These two cases occurred among my neighbors—no mere hearsay. I urge all people: if without means, better to beg for food than to live by killing and thus create karmic debt.\n\n**4. Do not kill when hosting guests.**\nOn fine days with good company, a simple meal of vegetables and broth suffices to preserve refinement. Why must one slaughter countless lives, indulging in excess with rich meats, filling cups and plates with song and dance while the cries of the slaughtered rise from the chopping block? Alas! Those with human hearts—can they not feel sorrow? If one knew that the food on the plate came from the anguished cries of the butcher’s block, that their extreme pleasure was another’s extreme suffering, even the morsel would stick in the throat. Can one not grieve?\n\n**5. Do not kill when offering ancestral sacrifices.**\nOn the death anniversaries of the departed and during spring and autumn sacrifices, one should abstain from killing to accumulate merit for the deceased. To kill for sacrifice only adds to karmic burden. Before the eight delicacies, how can one rouse the bones of the nine springs to partake? Such acts are harmful and bring no benefit—no wise person would do this.\n\nSome say: Emperor Wu of Liang used flour to make sacrificial animals, and the world mocked him for denying his ancestors \"blood offerings.\" But blood offerings are not necessarily noble, nor are vegetable offerings base. As descendants, what matters is to cultivate virtue and ensure the ancestral rites endure—not whether the sacrifice must involve blood. The *Book of Changes* teaches that a simple offering surpasses slaughtering an ox, and the sages declare that even sacrificial feasting is unfilial. Why insist on blood?\n\n**6. Do not kill when praying for blessings or averting misfortune.**\nWhen ill, people slaughter animals to sacrifice to the gods, seeking blessings. Yet they do not consider: in sacrificing to the gods, they seek to avoid death and prolong life—by taking another’s life to extend their own. Nothing is more contrary to heaven or reason. The gods are upright and impartial—how could they show favoritism? Life cannot be prolonged, yet the karma of killing remains. All such superstitious sacrifices are of this kind.\n\nThe *Bhaiṣajyaguru Sūtra* states: \"Those who kill various beings, beseeching gods and spirits, invoking demons to seek blessings and longevity, will never attain it.\" For life cannot be extended, and the karma of killing endures. Superstitious practices—such as killing for children, wealth, or official rank—are all the same. If one obtains a child, wealth, or position, it is by one’s own destined lot, not the work of ghosts or gods. If a wish is coincidentally fulfilled, one hastily deems it divine favor, believing all the more firmly and practicing all the more earnestly. Such delusion burns fiercely—none can be saved. How tragic!\n\n**7. Do not kill during marriage rites.**\nOn the day of marriage, from betrothal to the wedding feast, how much killing occurs! Marriage marks the beginning of human life—yet to begin life with killing is contrary to reason. Moreover, marriage is an auspicious rite, yet to use an inauspicious act on an auspicious day—how grim!\n\nWhen people form a union, they wish for the couple to grow old together. Do they wish the birds and beasts to die first? The bride’s family keeps lamps lit for three days, lamenting separation. Do they find separation painful, yet think beasts rejoice in it? Truly, marriage should not involve killing.\n\nThe above may offend common custom, but the discerning will recognize it as sound reasoning. If one can fully abstain, no greater good exists. If not, one may reduce killing by half or more—abandoning four or five practices, or forbidding two or three. Removing one act dissolves one karmic burden; reducing one killing severs one grievance.\n\nIf unable to renounce meat entirely, one may first refrain from personally slaughtering, buying only what is already butchered in the market. This too avoids grave transgression, nurturing a heart of compassion and gradually entering a better state.\n\nThose who receive this text should circulate it widely, exhorting one another. To persuade one person not to kill is to save a hundred thousand lives. To persuade ten, a hundred, or countless others—what vast hidden merit, what boundless good fruit! Only believe and practice, and you will not be deceived.\n\n**Song Exhorting Against Killing Oxen**\nI urge the world: do not eat beef.\nFor plowing and toil, they meet slaughter instead.\nFrom whence comes your food? How can you bear to feast?\nAlas, these oxen—do not call them mere beasts.\nThrough the six paths of rebirth, we repay one another.\nWho knows if in a past life, they were your kin?\nDo you think them senseless? At death, they tremble in fear.\nMute, they weep tears, their eyes wide in terror.\nSkinned and dismembered, their eyes still stare—\nNot just staring, but watching your fate.\nCan you be sure that in years to come,\nYou will not return as a calf?\nRemember our shared existence, yet you indulge greed and desire.\nYou love the taste, heedless of the poison within.\nRice fills the belly; vegetables suffice.\nWhy must you crave beef when so much else pleases the palate?\nThe warning is clear: to abstain is your blessing.\n\nThe *Record of the Water Mirror* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "水镜录 经名：水镜录。 一卷。 底本出处：《万历续这藏》。 水镜录 太上感应篇 太上曰：祸福无门，惟人自召，善恶之报，如影随形，是以天地有司过之神，依人所犯轻重以夺人算。 算减则贫耗，多逢忧患，人皆恶之，刑祸随之，吉庆避之，恶星灾之。 算尽则死。 又有三台、北斗星君等，常在人头上，录人罪恶，夺其纪算。 又有三尸神在人身中，每到庚申日，辄上诣天曹，言人罪过。 月晦之日，灶神亦然。 凡人有过．大则夺纪，小则夺算，其过大小，有数百事。 欲求长生者，先须避之，是道则进，非道则退，不履邪径，不欺暗室，积德累功。 慈心於物，忠孝友悌，正己化人，矜孤恤寡，敬老怀幼，昆虫草木。 犹不可伤，宜悯人之凶，乐人之善，济人之急，救人之危。 见人之得。 如己之得。 见人之失，如己之失，不彰人短，不衒己长，遏恶扬善。 推多取少，受辱不怨，受宠若惊，施恩不求报，与人不追梅，所谓善人，人皆敬之。 天道佑之，福禄随之。 众邪远之。",
      "translated_text": "**The Water Mirror Record**\n\n**Scripture Title:** *The Water Mirror Record*. One fascicle. Base text from *The Wanli Continuation of the Daoist Canon*.\n\n**The Supreme Lord’s Treatise on Retribution**\n\nThe Supreme Lord said:\nFortune and misfortune have no fixed gate—only man summons them himself. The retribution for good and evil follows like a shadow clinging to form. Thus, heaven and earth possess spirits that oversee transgressions, diminishing a person’s allotted lifespan according to the severity of their offenses.\n\nWhen lifespan is reduced, poverty and depletion follow, along with frequent sorrows and calamities. All shun such a person; punishments and disasters pursue them, while blessings flee, and malevolent stars bring harm. When lifespan is exhausted, death ensues.\n\nMoreover, the Three Terraces and the Lords of the Northern Dipper constantly hover above a person’s head, recording their sins and seizing their allotted years. Within the body dwell the Three Corpses spirits, who, on every *gengshen* day, ascend to the celestial courts to report one’s transgressions. Likewise, on the last day of each lunar month, the Stove God does the same.\n\nFor every human fault—whether grave enough to forfeit one’s destiny or minor enough to reduce one’s lifespan—the offenses, great or small, number in the hundreds.\n\nThose who seek longevity must first avoid such transgressions. Follow the Dao, and you advance; stray from it, and you retreat. Do not tread crooked paths nor deceive in hidden chambers. Accumulate virtue and amass merit. Cultivate compassion toward all beings, uphold loyalty, filial piety, fraternal duty, and brotherly love. Rectify yourself to transform others. Pity orphans and relieve widows. Honor the aged and cherish the young. Even insects and plants must not be harmed.\n\nOne should grieve at others’ misfortunes, rejoice in their goodness, aid those in dire straits, and rescue those in peril. Regard another’s gain as your own, and another’s loss as your own. Do not expose others’ faults nor flaunt your own strengths. Suppress evil and extol virtue. Take less and give more. Bear humiliation without resentment, receive favor with awe. Bestow kindness without seeking repayment, and when giving to others, harbor no regret.\n\nSuch is the good person—all respect them, the Dao of Heaven protects them, and fortune and prosperity follow. All malevolent forces keep their distance.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 395,
      "start_sentence": 0,
      "end_sentence": 21,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.209940910339355,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\水镜录.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "神灵卫之，所作必成，神仙可冀。 夫欲求天仙者，当立一千三百善； 欲求地仙者，当立三百善。 苟或非义而动。 背理而行，以恶为能。 忍作残害，阴贼良善，暗海君亲，慢其先生。 叛其所事，诳诸无识，谤诸同学．虚诬诈伪，攻讦宗亲，刚强不仁，狠戾自用，是非不当，向背乖宜，虐下取功，謟上希旨，受恩不感．念怨不休，轻蔑天民，扰乱国政，赏及非义，刑及无辜，杀人取财，倾人取位，诛降戮服，贬正排贤，凌孤逼寡，弃法受赂，以直为曲，以曲为直，入轻为重，见杀加怒，如过不改，知善不为，自罪引他，壅塞方术，讪谤圣贤，侵凌道德，射飞逐走，发蛰惊栖，填穴覆巢，复胎破卵，愿人有失．毁人成功，危人自安，减人自益，以恶易好，以私废公，窃人之能，蔽人之善，形人之丑，讦人之私，耗人货财，离人骨肉，侵人所爱，助人为非，逞志作威，辱人求胜，败人苗稼，破人婚姻，苟富而骄，苟兔无耻，认恩推过，嫁祸卖恶，沽买虚誉，包贮险心，挫人所长，护己所短，乘威逼胁，纵暴杀伤，无故剪裁，非理烹宰，散弃五谷，劳扰众生，破人之家，取其财宝，决水放火，以害民居，素乱规模，以败人功，损人器物，以穷人用，见他荣贵，愿他流贬，见他富有，愿他破散，见他色美，起心私之，负他货财，愿他身死，干求不遂，便生咒恨，见他失便，便说他过，见他体色不具而笑之，见他才能可称而抑之，理蛊厌人，用药杀树，恚怒师傅，抵触父兄，强取强求，好侵好夺，虏掠至富，巧诈求迁，赏罚不平，逸乐过节，可虐其下，恐吓於他，怨天尤人，呵风骂雨，斗合争讼，妄逐朋党，用妻妾语，违父母训，得新忘故，口是心非，贪冒於财，欺罔其上，造作恶语，谗毁平人，毁人称直，骂神称正，弃顺效逆，背亲向疏，指天地以证鄙怀，引神明而鉴猥事，施与后悔，假借不还，分外营求，力上施设，淫欲过度，心毒貌慈，秽食矮人，左道惑众，短尺狭度，轻秤小升，以伪杂真，采取奸利，压良为贱，谩蓦愚人，贪婪无厌，咒咀求直，嗜酒悖乱，骨肉忿争，男不忠良，女不柔顺，不和其室，不敬其夫，每好矜夸，常行妬忌，无行於妻子，失礼於舅姑，轻慢先灵，违逆上命，作为无益，怀挟外心，自咒咒他，偏憎偏爱，越井越灶，跳食跳人，损子坠胎，行多隐僻，晦腊歌舞，朔旦号怒，对比涕唾及溺，对窑吟咏及哭，灶火烧香，秽柴作食，夜起裸露，八节行刑，唾流星，指虹霓，辄指三光，久视日月，春月燎猎，对北恶骂，无故杀龟打蛇。 如是等罪，司命随其轻重，夺其纪算，算尽则死，死有余责，乃殃及子孙。 又诸横取人财者，乃计其妻子家口以当之，渐至死丧。",
      "translated_text": "The spirits and deities guard them, and all their undertakings shall surely succeed; even immortality may be hoped for. Those who seek celestial immortality must accumulate one thousand three hundred good deeds; those who seek earthly immortality must accumulate three hundred.\n\nYet if one acts without righteousness, moves against principle, treats evil as ability, or cruelly inflicts harm; if one secretly injures the good and kind, covertly slanders lord and kin, or disrespects one’s teachers; if one betrays one’s superiors, deceives the ignorant, or slanders fellow disciples; if one engages in falsehood, fraud, or deception, attacks and exposes one’s kin, or acts with unyielding cruelty; if one is perverse and self-willed, judges right and wrong unfairly, or takes sides inappropriately; if one oppresses subordinates to claim merit, flatters superiors to curry favor, or receives kindness without gratitude while nursing grudges endlessly; if one scorns the common people, disrupts state governance, rewards the unrighteous, or punishes the innocent; if one kills for wealth, overthrows others for position, slays the surrendered or executes the compliant, demotes the upright or ostracizes the worthy; if one bullies the orphaned and coerces the widowed, abandons the law for bribes, twists straight into crooked, or turns crooked into straight; if one lightens the heavy and adds to the light, or rages when killing is seen; if one fails to correct faults or refuses to do good, shifts blame onto others, or obstructs the Way and its arts; if one mocks and slanders sages and worthies, or encroaches upon the virtuous; if one shoots flying birds or chases running beasts, disturbs hibernating creatures or startles roosting fowl, fills burrows or overturns nests, or destroys embryos and breaks eggs; if one wishes for others’ failures, ruins others’ successes, endangers others for one’s own safety, or diminishes others for one’s own gain; if one exchanges good for evil, or sacrifices the public for private gain; if one steals others’ abilities, conceals others’ virtues, exposes others’ flaws, or reveals others’ secrets; if one depletes others’ wealth, separates others’ kin, seizes what others love, or aids others in wrongdoing; if one indulges in willfulness and tyranny, humiliates others to prevail, or destroys others’ crops; if one disrupts others’ marriages, grows arrogant in wealth, or acts shamelessly in escape; if one claims others’ kindness as one’s own or shifts blame onto others, or shifts misfortune onto others; if one trades in false reputation, harbors malicious intent, undermines others’ strengths, or defends one’s own flaws; if one exploits power to coerce, indulges in violence and killing, or wantonly cuts and slaughters; if one cooks and butchers without reason, scatters and wastes the five grains, or harasses living beings; if one destroys others’ families to seize their treasures, breaches dams or sets fires to harm dwellings, disrupts plans to ruin others’ work, or damages others’ tools to deprive them of use; if one, seeing others’ glory and wealth, wishes for their demotion, or seeing others’ riches, wishes for their ruin; if one, seeing another’s beauty, covets them in secret, or owing another’s wealth, wishes for their death; if one, when desires are unmet, curses in resentment, or when seeing others’ misfortune, speaks of their faults; if one laughs at others’ physical imperfections or suppresses others’ praiseworthy talents; if one employs sorcery to harm others or uses poison to kill trees; if one bears grudges against teachers or offends parents and elder brothers; if one takes by force or seizes by greed, plunders the wealthy, or schemes for promotion; if one metes out rewards and punishments unfairly, indulges in excess, or oppresses subordinates; if one intimidates others, blames Heaven and resents others, curses the wind and scolds the rain; if one incites disputes and litigations, forms cliques blindly, or heeds the words of wives and concubines over parents’ teachings; if one forgets the old for the new, speaks one way while thinking another, or covets and deceives for wealth; if one lies to superiors, fabricates malicious words, or slanders the innocent; if one defames others to appear upright, or curses deities to seem just; if one abandons loyalty to follow rebellion, turns from kin to favor strangers, invokes Heaven and Earth to witness base intentions, or calls upon spirits to witness vulgar deeds; if one regrets giving or fails to return what is borrowed; if one pursues what is beyond one’s due or forces efforts beyond one’s strength; if one indulges in excessive lust, harbors cruelty beneath a kind facade, or serves filthy food to others; if one misleads the masses with heterodox ways, uses short measures and narrow weights, or mixes false with true to seek illicit profit; if one presses the good into servitude, deceives the foolish, or is insatiably greedy; if one curses to prove oneself right, indulges in wine to the point of madness, or stirs strife among kin; if men are unfaithful and women ungentle, if one sows discord in the household or disrespects one’s husband; if one is constantly boastful and jealous, neglects duties to wife and children, or disrespects parents-in-law; if one slights ancestral spirits or defies the commands of superiors; if one engages in useless acts, harbors disloyalty, or curses oneself and others; if one shows partial love or hatred, leaps over wells or stoves, or jumps over food or people; if one harms children or causes miscarriages, acts in secret and perverse ways, sings and dances during inauspicious days, or wails and rages at the new moon; if one spits, weeps, or urinates in front of others, sings or wails near kilns, burns incense at the stove, or cooks with filthy firewood; if one rises naked at night, executes punishments during the eight solar terms, spits at shooting stars or points at rainbows, or constantly gazes at the sun and moon; if one hunts and burns in spring, curses facing north, or kills turtles and beats snakes without cause—such sins shall be weighed by the Deities of Fate, who will deduct from one’s allotted lifespan accordingly. When the lifespan is exhausted, death follows; if sins remain, misfortune extends to descendants.\n\nMoreover, those who wrongfully seize others’ wealth shall have their wives, children, and household counted against them, gradually leading to death and ruin.",
      "overlap_context": "ose in peril. Regard another’s gain as your own, and another’s loss as your own. Do not expose others’ faults nor flaunt your own strengths. Suppress evil and extol virtue. Take less and give more. Bear humiliation without resentment, receive favor with awe. Bestow kindness without seeking repayment, and when giving to others, harbor no regret.\n\nSuch is the good person—all respect them, the Dao of Heaven protects them, and fortune and prosperity follow. All malevolent forces keep their distance.",
      "start_char": 395,
      "end_char": 1413,
      "start_sentence": 22,
      "end_sentence": 30,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.20404624938965,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\水镜录.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "若不死丧、则有水火盗贼、遗亡器物、疾病口舌诸事，以当妄取之直。 又枉杀人者，是易刀兵而相杀也。 取非义之财者，譬如药者救饥，鸩酒止渴，非不暂饱，死亦及之。 夫心起於善，善虽未为，而吉神已随之； 或心起於恶，恶虽未为，而凶神已随之。 其有曾行恶事，后自改悔，诸恶莫作，众善奉行，久久必获吉庆，所谓转祸为福也。 故吉人语善、视善、行善，一日有三善，三年天必降之福； 凶人语恶、视恶、行恶，一日有三恶，三年天必降之祸。 胡不勉而行之。 梓潼帝君戒士子文",
      "translated_text": "If no death or ruin befalls them, then water, fire, bandits, thieves, lost possessions, illness, slander, and myriad troubles shall serve as repayment for their wrongful gains. Those who unjustly kill others merely exchange blades to slay one another. Taking wealth by improper means is like a starving man eating poison to stave off hunger, or a parched man drinking venom to quench his thirst—though it may grant temporary relief, death will soon follow.\n\nWhen the heart stirs with goodness, though the good deed remains undone, auspicious spirits already attend; when the heart stirs with evil, though the wicked act remains unexecuted, inauspicious spirits already follow. If one has committed evil in the past but later reforms, refraining from all wrongdoing and practicing every virtue, in time they shall surely receive blessings—this is what is meant by \"turning misfortune into fortune.\"\n\nThus, the fortunate speak kindly, see kindly, and act kindly; if they perform three acts of goodness in a day, Heaven shall bestow blessings upon them in three years. The wicked speak cruelly, see cruelly, and act cruelly; if they commit three evils in a day, Heaven shall bring calamity upon them in three years. Why not strive to practice this?\n\n*Admonition to Scholars by Lord Emperor Zitong*",
      "overlap_context": "tly gazes at the sun and moon; if one hunts and burns in spring, curses facing north, or kills turtles and beats snakes without cause—such sins shall be weighed by the Deities of Fate, who will deduct from one’s allotted lifespan accordingly. When the lifespan is exhausted, death follows; if sins remain, misfortune extends to descendants.\n\nMoreover, those who wrongfully seize others’ wealth shall have their wives, children, and household counted against them, gradually leading to death and ruin.",
      "start_char": 1413,
      "end_char": 1631,
      "start_sentence": 31,
      "end_sentence": 40,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.714696884155273,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\水镜录.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "梓潼帝君曰； 聪明正直而依仁，宁无所择； 宽厚忠信而好义，是用相仍。 故凭有感之精衷，曲示无声之教化，咨尔有众，听子格言。 盖闻富贵在天，得失有命，知之者，安於自然，而罔或控告； 昧之者，贪於必得，而有所祈求。 或谓精神交而梦寐通，或谓祭祀丰而神祇格。 宫殿楼观，务碧瓦之举飞； 陛戟右廊，夸朱栏之雕翠。 从兹末务，失其本真，不知进退，存亡系彼，三班四属，行藏用舍。 考兹五部六台，既有司存，岂容计取，然不可一拘於前定，又不可迷昧於进修。 故修身励行者，天必降之百祥； 而反道败德者，神亦夺其五福。 理所着者，人弗知之。 是故运数冥符，而反受其殃； 灾星显照，而或蒙其吉。 造化以之倚伏，神明由是乘除，凡厥儒流，恭行教化。 汝等勿欺天远，毋谓神幽，毋言暗室可欺，毋道明庭不畏，毋凌孤寡，毋侮老成，毋取不义之财，毋淫非己之色，毋厚结它人而亲戚岐路，毋义交异姓而兄弟阋墙，毋恃己长，毋攻人短，毋好逸乐，毋纵游畋，毋负才名，毋挟官贵，毋厚仙释而薄於父母，毋敬鬼神而慢於师资。 苟有负於吾言，端不逃於天。 宪政生平渡彦者，累困於场屋； 一旦精明者，遽登於乡书？ 皆有寅缘，固非造次。 世之腹诽心谤者，往往得以藉口； 人之面誉背毁者，悠悠姑以欺心。 彼司文衡，而岂得以私； 此权禄藉，而故先有取。 济济多士，天其或者临之； 巍巍成功，吾则是之取尔。 播告中外，咸使闻知。 又文 今岁取士，不止一端，要在得人，以副众望。 一以阴功孝行为上，一以处己谦和为贤。 苦学者，则酬其劳； 高才者，则遂其志； 傲忽者，未免黜落； 轻薄者，姑示劝惩。 文章假之，以定其去留； 神明司之，以公其予夺。 人不自省，明示训言：尝谓唯士无能，苦学为能； 居贫不富，成名即富。 上无分於贵贱，人切在於勤劳。 凡夫且先较德业之短长，故有司始定文章之优劣，不可谓前定而不能力学，岂可以宿缘而自怠操修。 名虽曰士，初无士行之寸长； 身虽曰儒，徒为儒服之观美。 不敬天地，不信神明，狎侮老成，轻慢前辈，违逆父母而逸乐度日，怠忽师长而放荡无时。 试不遂，则罪有司之不公； 榜初张，则谓庸流之滥得。 责人者，不能於责己； 议人者，乃所以议天。 或恃己之见，而遏人之能； 或衒己之长，而攻人之短； 或矜所学，而忽略一世； 或侍一解，而轻视众人。 立身不正，则以暧昧贪饕为能； 用心不减，则以机巧变诈为胜。 较短论长，而不从公道； 夺彼与此，而弗恤人言； 面誉背毁，而求苟合於人； 口是心非，而绝不容於物。 外貌虽慈祥，徒巧言而美语，中情多狠暴，好潜贼而阴谋； 不择乎友，而交不义之朋； 不和其室，而淫非己之色。",
      "translated_text": "Lord Emperor Zitong declares:\n\nOne who is intelligent, upright, and abides in benevolence need not choose between paths; one who is magnanimous, sincere, loyal, and devoted to righteousness naturally follows in its wake. Thus, moved by the earnestness of your innermost hearts, I offer this silent teaching in gentle guidance. Hear now my admonitions, all you assembled scholars.\n\nIt is said that wealth and honor lie with Heaven, while gain and loss are decreed by fate. Those who understand this rest content in the natural order and make no petition or complaint; those who do not grasp it covet what they deem certain and resort to supplication. Some claim that when spirit and essence commune, dreams and waking visions align; others insist that lavish sacrifices summon the presence of gods and spirits. Palaces and towers soar with emerald tiles; steps and corridors gleam with vermilion railings carved in jade. Yet in pursuing such vanities, one loses the root of authenticity, unaware of advance or retreat, oblivious that survival and ruin depend on forces beyond. The ranks of officials—three classes and four ranks—rise or fall, advance or retreat, all governed by these principles.\n\nThe Five Bureaus and Six Terraces are overseen by their respective stewards; how could one scheme to seize their favor? Yet one must not be bound by predestination nor remain deluded in self-cultivation. Thus, those who refine their conduct and strive in virtue shall surely receive a hundred blessings from Heaven; those who defy the Dao and corrupt their virtue shall have the five fortunes stripped away by the gods. Such principles are manifest, though men may not perceive them. Thus, fate’s hidden patterns may bring misfortune where none was expected, while baleful stars may shine yet bestow unexpected fortune. Creation’s ebb and flow, the gods’ calculations of gain and loss—all these govern the world. You scholars must reverently uphold and propagate this teaching.\n\nDo not deceive Heaven as though it were distant; do not presume the gods are too remote to know. Never say that the dark chamber may be deceived, nor that the bright hall need not be feared. Do not bully the orphaned or widowed, nor mock the elderly and venerable. Do not seize wealth that is not rightfully yours, nor lust after another’s spouse. Do not cultivate close ties with outsiders while estranging kin, nor form righteous bonds with strangers while sowing discord among brothers. Do not boast of your strengths, nor attack others’ weaknesses. Do not indulge in ease and pleasure, nor waste time in idle hunting. Do not rely on talent and reputation, nor wield official power to oppress. Do not venerate immortals and Buddhists while slighting your parents, nor revere ghosts and gods while disrespecting your teachers.\n\nShould any defy these words, they shall not escape Heaven’s judgment. Why is it that those of refined talent and lifelong learning often stumble in the examination halls, while those of sudden brilliance swiftly rise to local acclaim? All is bound by hidden affinities, not mere happenstance. Those who secretly slander and inwardly revile often find pretexts for their grievances; those who flatter to one’s face yet defame behind their back deceive only themselves. The arbiters of literary merit do not act out of favoritism; the dispensers of rank and emolument do not bestow them arbitrarily. O multitude of scholars, Heaven may yet look upon you with favor; towering achievements shall be mine to reward.\n\nLet this proclamation be spread far and wide, that all may hear and know.\n\n**Further Edict**\nThis year’s selection of scholars shall not be confined to a single criterion; the essential aim is to obtain worthy men and fulfill the people’s expectations. First, those who accumulate hidden merit and practice filial piety shall be esteemed; second, those who conduct themselves with humility and harmony shall be deemed virtuous. Those who study diligently shall be rewarded for their labor; those of exceptional talent shall have their aspirations fulfilled. The arrogant and careless shall not escape demotion; the frivolous and shallow shall be shown both encouragement and punishment. Literary works shall be evaluated to determine their retention or dismissal; the gods shall oversee the fairness of their judgment.\n\nIf men do not reflect upon themselves, let these admonitions be made clear: It is said that scholars are not defined by innate ability but by diligent study; though they may dwell in poverty, fame shall bring them wealth. Distinctions of high and low matter not—what matters is industrious effort. Before officials compare the short and long of virtue and achievement, they first assess the quality of one’s writing. Do not claim that predestination precludes diligent study, nor use past affinities as an excuse for neglecting self-cultivation. Though one may bear the name of scholar, if they possess not an inch of a scholar’s conduct; though they may wear the robes of a Confucian, if they merely present an outward appearance of refinement—such men do not revere Heaven and Earth, nor believe in the gods. They mock the elderly and venerable, disdain their elders, defy their parents while indulging in idleness, and neglect their teachers while living in dissipation.\n\nIf they fail the examination, they blame the examiners for injustice; when the list is first posted, they claim the mediocre have been unjustly favored. Those who demand much of others fail to demand it of themselves; those who criticize others thereby criticize Heaven. Some rely on their own views to suppress others’ abilities; some flaunt their strengths to attack others’ weaknesses. Some boast of their learning while disregarding the world; some grasp a single insight and look down upon all others. Those who stand without integrity use obscurity and greed as their skills; those whose hearts lack sincerity employ cunning and deceit as their strengths. They compare short and long without fairness, seize from one to give to another without regard for others’ words, flatter to one’s face yet slander behind their back to curry favor, and speak with forked tongues to alienate all around them.\n\nOutwardly, they may appear kind and gentle, uttering clever and honeyed words, but within, their hearts are cruel and violent, delighting in treachery and secret schemes. They do not choose their friends wisely, consorting with unrighteous companions; they do not harmonize their households, indulging in illicit affairs. They do not avoid unjust wealth, nor resist another’s spouse.",
      "overlap_context": "in time they shall surely receive blessings—this is what is meant by \"turning misfortune into fortune.\"\n\nThus, the fortunate speak kindly, see kindly, and act kindly; if they perform three acts of goodness in a day, Heaven shall bestow blessings upon them in three years. The wicked speak cruelly, see cruelly, and act cruelly; if they commit three evils in a day, Heaven shall bring calamity upon them in three years. Why not strive to practice this?\n\n*Admonition to Scholars by Lord Emperor Zitong*",
      "start_char": 1631,
      "end_char": 2662,
      "start_sentence": 41,
      "end_sentence": 102,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.24188446998596,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\水镜录.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "舍己田，耘人田，失云多矣； 作无益，害有益，损孰甚焉。 预乡荐者，自为志得意满，不复进修； 入省闱者，则曰功成名遂，直可唾取。 恃才傲物，挟长欺孤。 常交贵结援，而每夸等流； 以只字片文，而蔑视同辈。 在市道则和合贸易，以觊其所得； 遇州县则斗合争讼，以满其所求。 不忠不孝，甘心冒法而喜为； 非礼非仁，直情径行而弗顾。 游畋无度，博奕废时，耽饮而自丧其神，逞威而乃败於德，致屡困於场屋，安敢望於荣华。 况三年初无伏案之功，而一旦遂萌登科之望。 稍无成，直归之命运； 才有力，专务於祷祈。 不知天宪之难逃，深恐人心之愈惑。 出处语嘿之际，天必察之； 进退予夺之间，神所司者。 岂容幸取，不可计求，苟有行业之可书，奚患飞腾之不遂。 迩者营业相传之后，屡有声名儒冠世守之家，反被黜落，不知营业之子，安分读书，无形颜色，每见儒冠之后，自恃名族，多有骄矜。 神明公取，专激励於轻薄之流； 天道左旋，用奖予於淳朴之士。 若能自悟，晦迹韬光，望欲有成，劳心苦志，曲尽阴功之事，务存忠孝之心。 反乎，上古淳朴之风无流，末劫偷薄之俗自然，诗礼传家，科名复旧，谦和处己，气象如初，天不负人，人宜力学，凡为士者，各宜戒之。 阴德延寿论 一念所觉，固所以得三元之寿考； 一德之修，尤所以培三元之寿脉。 甚矣，念之不可以不觉，而德之不可以不修也。 老子曰：我命在我不在天。 紫阳真人曰：大药修之，有易难也，须由我也。 由天，若非积行施阴德，动有群魔作障缘，是可以自信矣。 道人郭太史，精於谈天者也，应天得书，后之星翁推步，必来取法，曰五行四柱，曰星辰运限，如是而富贵寿考，如是而贫贱疾苦，如是而凶恶夭折，若镜烛影，若契合符。 世之人，似不能逃其数者及其究也。 合於书者固多，其不合者亦不少，是何欤？ 岂人生宇宙间，或囿於数，或不囿於数欤？ 盖尝玫之，其推玄究微，既条列于前，至其后则曰：阴功可延寿，吉人依旧无凶。 又曰：随缘应物行方便，纵犯凶星亦不虞，是必有见矣，不然，寿夭休论命，修行本在人。 孙思邈真人何以有此言欤？ 太极真人徐来勒尝遇南斗寿星，问寿夭吉凶之事。 星君曰：天道福善祸淫，神明赏善罚恶，人能刻意为善，静与道合，动与福会，如此则我命在我，不为司煞所执，不求寿而自寿，不求生而自生。 苟或隳纲纪，违天地，肆愚悖，侮神明，背仁慈，亏忠孝，明则刑网理之，幽则鬼神诛之，是不知所积、冥冥中夺其算而夭其寿者矣。 阴德如于公治狱，子为丞相，徐公积善，衮衮公侯，在所不论。 昔比丘得六神通，与一沙弥同处林野，比丘知沙弥七日当死，因曰：父母思汝，可暂归八日复来。 沙尔八日果来，比丘佑之，入三昧，察其事，乃沙弥於归路中，脱袈裟壅水，令不得入蚁穴，得延寿一纪。 孙叔敖儿时，见两头蛇，恐他人见杀而埋之。 母曰：吾闻有阴德者，天报之福，汝不死也。 后为楚令尹。 又宝禹钧夜梦祖父谓曰：汝年过无子，又寿不永，当早修阴德。 禹钧自是修阴德罔倦。 后又梦其祖父语曰：天以汝阴德，故延寿三纪，赐五子，荣显后居洞天之位。 范仲淹为之记。 由是观之，三元寿考，固得於一念之觉；",
      "translated_text": "Abandoning one’s own fields to weed another’s—how many losses have been thus incurred? Engaging in what is useless while harming what is beneficial—what greater harm could there be? Those who pass the local examinations grow complacent, believing their ambitions fulfilled, and cease further cultivation. Those who enter the provincial examinations claim their success and fame are assured, as if within easy reach. Relying on talent, they grow arrogant toward others; flaunting their seniority, they bully the solitary. They habitually seek favor with the powerful, boasting of their connections, while dismissing their peers with a mere word or fragment of writing. In the marketplace, they collude in trade to covet gains; before magistrates, they collude in litigation to satisfy their demands. Disloyal and undutiful, they willingly break the law and delight in it; acting against propriety and benevolence, they follow their impulses without restraint. They hunt and gamble without measure, squandering time; drowning in drink, they waste their spirit; flaunting their might, they ruin their virtue. Thus, they repeatedly fail in the examinations—how dare they hope for glory and splendor?\n\nMoreover, having done no diligent study in their first three years, they suddenly entertain hopes of passing the imperial exams. When they meet with no success, they attribute it to fate; when they have some ability, they devote themselves entirely to prayers and supplications. Unaware that the decree of Heaven is inescapable, they only deepen the confusion in people’s hearts. In every word and silence, Heaven observes; in every advance and retreat, in every bestowal and deprivation, the gods preside. How can one rely on luck or scheming to attain success? Only with conduct worthy of record can one hope for soaring achievement.\n\nIn recent times, after the transmission of family trades, many renowned scholarly lineages—those who had long worn the scholar’s cap and upheld their traditions—have instead been demoted or fallen into obscurity. Meanwhile, the sons of tradesmen, content in their station and devoted to study, show no arrogance in bearing or demeanor. By contrast, the descendants of scholarly families, relying on their noble lineage, often grow haughty and overbearing. The divine and impartial selection process serves to spur on the frivolous, while the revolving Way of Heaven rewards the honest and unassuming. If one can awaken to this truth, conceal one’s light, and bide in obscurity, then with diligent effort and苦志, one may fulfill one’s aspirations by exhausting the work of hidden virtue and cultivating a heart of loyalty and filial piety.\n\nIf, instead, the simple and honest ways of high antiquity fade without trace, and the degenerate customs of the final age naturally prevail, then even families that transmit the *Book of Songs* and the *Book of Rites* will see their scholarly honors restored only when they conduct themselves with humility and harmony, restoring their original bearing. Heaven does not fail those who strive—scholars should devote themselves to study. Let all who would be gentlemen take heed.\n\n**On Hidden Virtue Extending Longevity**\n\nA single moment of awakening is the foundation for attaining the threefold longevity of the Three Primordials; the cultivation of a single virtue is especially the means to nurture the lifeline of the Three Primordials. How crucial it is that one cannot afford not to awaken, nor can one neglect the cultivation of virtue!\n\nLaozi said: “My life rests with me, not with Heaven.”\nThe Perfected of Purple Yang said: “The great elixir is cultivated with ease or difficulty—it must depend on me.”\n\nIf left to Heaven, unless one accumulates deeds and bestows hidden virtue, myriad demons will arise as obstacles—how can one trust in that? The Daoist Guo Taishi was skilled in discussing the heavens. After receiving a book from the heavens, later astrologers who calculated the stars invariably sought his method. They spoke of the Five Phases and the Four Pillars, of stellar movements and fateful limits—such that wealth, nobility, longevity, poverty, lowliness, illness, suffering, misfortune, and early death were as clear as reflections in a mirror or tallying marks on a tally. The people of the world seemed unable to escape their destined numbers. Yet upon closer examination, while many cases aligned with the book, many did not. Why is this? Are some people in the universe bound by fate, while others are not?\n\nI have reflected on this: the profound and subtle calculations were meticulously laid out earlier, but later it is said: “Hidden virtue can extend life; the fortunate remain free of misfortune.” It is also said: “Acting with kindness in response to circumstances, even if one offends inauspicious stars, there is nothing to fear.” There must be insight here. Otherwise, why would it be said that “whether one lives long or dies young is not a matter of fate, but of cultivation—it rests with the person”?\n\nWhy did the Perfected Sun Simiao make such a statement? The Perfected of the Great Ultimate, Xu Laile, once encountered the Longevity Star of the Southern Dipper and inquired about the fortunes of life and death. The Star Lord replied: “The Way of Heaven blesses the good and punishes the wicked; the divine rewards virtue and penalizes evil. If one can wholeheartedly do good, abiding in stillness in harmony with the Dao and acting in accord with fortune, then ‘my life rests with me’—it is not controlled by the star of death. One does not seek longevity yet attains it; one does not seek life yet preserves it. But if one undermines the moral order, defies Heaven and Earth, indulges in folly and perversity, insults the divine, turns against benevolence and mercy, and neglects loyalty and filial piety, then in the manifest world, the net of law will bind them, and in the hidden realm, ghosts and spirits will punish them. Such a one, unaware of what they have accumulated, will have their lifespan secretly diminished and their life cut short.”\n\nHidden virtue, like Yu the Duke who administered justice and saw his son become a chancellor, or Xu the Duke who accumulated goodness and became a ceaseless stream of dukes and marquises—such cases are too numerous to mention. Once, a bhikkhu with the six supernatural powers dwelled in the wilderness with a śrāmaṇera. The bhikkhu knew the śrāmaṇera would die in seven days, so he said: “Your parents miss you—go home for a visit and return in eight days.” On the eighth day, the śrāmaṇera indeed returned. The bhikkhu, in a state of samādhi, examined the matter and found that on the way home, the śrāmaṇera had removed his robe to dam a stream, preventing water from entering an ant nest. Thus, his life was extended by twelve years.\n\nWhen Sun Shu’ao was a child, he saw a two-headed snake and, fearing others would see and kill it, buried it. His mother said: “I have heard that those who possess hidden virtue receive Heaven’s blessing in return—you will not die.” Later, he became the Prime Minister of Chu.\n\nBao Yujun once dreamed at night that his grandfather told him: “You will have no sons in your old age, and your life will not be long. You should cultivate hidden virtue early.” From then on, Yujun tirelessly practiced hidden virtue. Later, he dreamed again of his grandfather, who said: “Heaven, in recognition of your hidden virtue, has extended your life by thirty-six years, granted you five sons, and bestowed upon your descendants honor and prominence, dwelling in the grotto-heavens.” Fan Zhongyan wrote a record of this.\n\nFrom this, we see that the threefold longevity of the Three Primordials is indeed attained through a single moment of awakening.",
      "overlap_context": "one’s face yet slander behind their back to curry favor, and speak with forked tongues to alienate all around them.\n\nOutwardly, they may appear kind and gentle, uttering clever and honeyed words, but within, their hearts are cruel and violent, delighting in treachery and secret schemes. They do not choose their friends wisely, consorting with unrighteous companions; they do not harmonize their households, indulging in illicit affairs. They do not avoid unjust wealth, nor resist another’s spouse.",
      "start_char": 2662,
      "end_char": 3885,
      "start_sentence": 103,
      "end_sentence": 154,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.28564929962158,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\水镜录.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "三元寿脉，又在於一德之修也。 或曰：阴德曷从而修之。 曰：凡可修者，不以富贵贫贱拘，亦不在勉强其所为，但於水火、盗贼、饥寒、疾苦、刑狱、逼迫、逆旅、狠( )、险阻、艰难，至於飞潜、动植，於力到处，种种方便，则阴德无限，量而受报如之矣，善乎。 西山之记曰：遇至人，得真法，虽云修养所至，亦阴功之报也。 此予所以参赞书后，复作论曰《阴德延寿》。 九华澄心老人李鹏飞述。 放生文 盖闻世间至重者，生命； 天下最惨者，杀伤。 是故逢擒则奔，虮虱犹知避死； 将雨而徙，蝼蚁尚且贪生。 何乃网於山，罟於渊，多方掩取； 曲而钩，直而矢，百言扶罗。 便其胆落魂飞，母离子散，或囚笼槛，则如处囹圄； 或被刀砧，则同临刚戮。 怜儿之鹿，舐疮痕而寸断柔肠； 畏死之猿，望弓影而双垂悲泪。 恃我强而凌彼弱，理恐非宜； 食他肉而补己身，心将安忍。 由是昊天垂悯，古圣行仁，鲜网着於成汤，畜鱼兴於子产。 圣哉，流水润枯稿以囊泉； 悲矣，释迦代危亡而割肉。 天台智者，凿放生之池； 大树仙人，护栖身之鸟。 赎鱼虾而得度寿，禅师之遗爱犹存； 救龙子而传方孙，真人之慈风未泯。 一活蚁也，沙弥易短命为长年，书生易卑名为上第； 一放龟也，毛宝以临危而脱难，孔愉以微职而封侯。 屈师纵鲤於元村，寿增一纪； 隋侯济蛇於齐野，珠报千．金。 拯已溺之蝇，酒匠之死刑免矣； 舍将烹之鳖，厨婢之笃疾瘳焉。 贸死命於屠家，张提刑魂超天界； 易余生於钩艇，李景文毒解丹砂。 孙良嗣解矰之危，卜葬而羽虫交助； 潘县令杀江湖之禁，去任而水族悲号。 信老兔愚民之牲，祥符甘雨； 曹溪守猎人之纲，道播神州。 雀解□环报恩，孤能临井授术，乃至残躯得命，垂白壁以闻经； 难地求生，现黄衣而入梦。 施皆有报，事匪无征，载在简编，昭乎耳目，愿随所见物，发慈悲心，捐不坚财，行方便事。 或恩周多命，则大积阴功； 若惠及一虫，亦何非善事。 苟日增而月累，自行广而福崇，慈满人寰，名通天府。 荡空冤障，多祉萃於今生； 培积善根，余庆及於他世。 倘更，助称佛号，加讽经文，为其回向西方，令彼永离恶道，则存心愈大，植德弥深，道业资之速成，莲台生其胜品矣。 杀生七戒 世人食肉，咸谓理所应然，乃恣意杀生，广积冤业，相习成俗，不自觉知，真可为痛哭流涕，长太息也。 计其迷执，略有七条，开列如左，余可例推。 一曰生日不宜杀生。 哀哀父母，生我劬劳。 己身始诞之辰，乃父母垂亡之日。 是日也，正宜戒杀扣齐，广行善事，庶使先亡考妣，早获超生，见在椿萱，增延福寿。 何乃顿忘母难，杀害生灵，上贻累於亲，下不利於己，昔唐太宗万乘之主，生日尚不为乐。 本田舍翁多收十斛粟，乃贺客盈门，欢晏累日，不知其可也。 世有生日，饭僧诵罗、修诸善事者，亦贤矣哉。 二曰生子不宜杀生。 凡人无子则悲，有子则喜，不思一切。 禽畜亦各爱其子，庆我子生，令他子死，於心安乎？ 夫婴孩始生，不为积福，而反杀生造业，亦太愚矣。 有一猎人，暮夜大醉，视其幼子为獐，砺刃将杀之。 妻泣谏不听，竟剖其腹，出其肠。 已而安寝天明，呼其子，与入市鬻獐肉。",
      "translated_text": "The threefold longevity of the Three Primordials also depends on the cultivation of a single virtue.\n\nSome may ask: *How does one cultivate hidden virtue?*\nThe answer: *In all things that can be cultivated, one must not be constrained by wealth or poverty, nobility or lowliness, nor should one force actions beyond one’s capacity. Rather, wherever there is water or fire, bandits or thieves, hunger or cold, sickness or suffering, imprisonment or coercion, travel or peril, cruelty or danger, hardship or difficulty—even among flying birds, swimming fish, moving beasts, or growing plants—wherever one’s strength reaches, one should employ every expedient means. Thus, hidden virtue becomes boundless, and the measure of one’s reward will correspond. How excellent!*\n\nThe *Record of Xishan* states: *Meeting a perfected one and obtaining the true method, though called the result of self-cultivation, is also the reward of hidden merit.* This is why I have appended my reflections to the text and composed a discourse titled *Hidden Virtue Extends Longevity*.\n\n**Written by Li Pengfei, the Clear-Hearted Elder of Jiuhua**\n\n---\n\n### **On Liberating Life**\n\nI have heard that the most precious thing in the world is life, and the most grievous is killing. Thus, when captured, even lice flee for their lives; when rain approaches, even ants seek shelter. Yet why do men cast nets upon the mountains and drag lines through the depths, devising countless means to ensnare? Why bend hooks and loose arrows, setting traps with a hundred stratagems? They strike such terror that creatures lose their courage and scatter in panic—mothers torn from their young, imprisoned in cages like convicts in dungeons, or laid upon the butcher’s block as if facing execution. The deer that licks its fawn’s wounds severs its own tender heart; the ape that fears death weeps at the sight of a drawn bow. To rely on one’s strength to oppress the weak is unjust; to consume another’s flesh to sustain one’s own body is unbearable.\n\nThus, the August Heaven shows compassion, and the ancient sages practiced benevolence. King Tang of Shang reduced the mesh of his nets, and Zichan of Zheng raised fish in ponds. How noble! The flowing water moistens withered stalks, and the spring nourishes the parched. How tragic! The Buddha offered his own flesh to save a starving tiger. The Venerable Zhiyi of Tiantai dug ponds for liberating life; the Immortal of the Great Tree protected nesting birds. The Chan master who ransomed fish and shrimp left a legacy of kindness; the Perfected One who saved the dragon’s son passed down his compassionate influence. A single liberated ant allowed a novice monk to transform a short life into a long one, and a scholar to rise from obscurity to high rank. A single freed turtle enabled Mao Bao to escape peril and Kong Yu to be enfeoffed from a humble post. Qu Shi released carp in Yuan Village and gained twelve more years of life; the Marquis of Sui saved a snake in Qi’s wilderness and was repaid with a pearl of a thousand gold. The brewer who rescued a drowning fly was spared the death penalty; the kitchen maid who spared a turtle about to be cooked recovered from her grave illness. The magistrate Zhang redeemed lives from the butcher and ascended to the heavenly realms; Li Jingwen’s poison was neutralized by cinnabar after sparing a fish from the hook. Sun Liangsi, by freeing birds from snares, received divine aid in divining his burial site; Magistrate Pan, by lifting the ban on fishing in rivers and lakes, was mourned by aquatic creatures upon his departure. The foolish villagers of Xiangfu, who spared the old rabbit, were blessed with timely rain; the hunters of Caoxi, who released their prey, spread the Dao across the land. The sparrow that returned a jade ring in gratitude, the orphaned crane that taught its savior the art of immortality—even the wounded and the desperate find life: the white-haired elder who heard the sutra by offering a jade disk, the man in peril who dreamed of a yellow-robed figure. Every act of kindness is repaid; no good deed lacks evidence. These stories are recorded in books and known to all. May all who encounter living beings arouse compassion, relinquish transient wealth, and perform acts of mercy. Whether saving many lives or a single insect, all are virtuous deeds. Through daily accumulation and monthly growth, one’s deeds expand and blessings deepen. When compassion fills the world, one’s name reaches the celestial courts. Clearing karmic obstacles brings manifold blessings in this life; cultivating good roots ensures blessings for future lives. If one further assists by chanting the Buddha’s name and reciting scriptures, dedicating the merit to guide beings toward the Western Pure Land, ensuring they forever escape the evil destinies—then one’s heart is vast, one’s virtue profound, one’s Daoist practice swiftly perfected, and one’s lotus throne born in the highest grade.\n\n---\n\n### **Seven Precepts Against Killing**\n\nPeople today eat meat, believing it natural, and thus indulge in killing, amassing karmic debts. This has become a common custom, unquestioned and unnoticed—truly a cause for weeping and endless sighs. Their delusions can be summarized in seven points, listed below; the rest may be inferred by analogy.\n\n**1. Do not kill on birthdays.**\nAlas, our parents endured great hardship to give us life. The day of our birth is the day our parents approached death. On this day, one should abstain from killing, fast, and perform good deeds, so that departed ancestors may swiftly attain liberation, and living parents may enjoy increased blessings and longevity. How can one forget the mother’s suffering and instead kill living beings, bringing harm to one’s parents above and misfortune to oneself below? Even Emperor Taizong of Tang, a ruler of ten thousand chariots, refrained from celebration on his birthday. A humble farmer who reaps an extra ten bushels of grain may host feasts for days, yet does not realize the folly. Some, on their birthdays, feed monks, recite the *Lotus Sutra*, or perform other good deeds—how wise they are!\n\n**2. Do not kill when a child is born.**\nPeople grieve when childless and rejoice when blessed with a child, yet they do not consider that all creatures, even birds and beasts, love their young. To celebrate the birth of one’s own child by causing the death of another’s—how can one’s heart bear it? When an infant is born, instead of accumulating merit, one kills and creates karma—how foolish! There was once a hunter who, drunk at night, mistook his young son for a roebuck. He sharpened his blade and prepared to kill him. His wife wept and pleaded, but he would not listen. He slit the child’s belly and pulled out his intestines. Only after sleeping it off and waking at dawn did he call for his son, intending to sell roebuck meat in the market.",
      "overlap_context": "dden virtue early.” From then on, Yujun tirelessly practiced hidden virtue. Later, he dreamed again of his grandfather, who said: “Heaven, in recognition of your hidden virtue, has extended your life by thirty-six years, granted you five sons, and bestowed upon your descendants honor and prominence, dwelling in the grotto-heavens.” Fan Zhongyan wrote a record of this.\n\nFrom this, we see that the threefold longevity of the Three Primordials is indeed attained through a single moment of awakening.",
      "start_char": 3885,
      "end_char": 5104,
      "start_sentence": 155,
      "end_sentence": 218,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.85435724258423,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\水镜录.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "妻哭曰：昨汝所杀者，子也。 其人举身自掷，五内崩裂。 噫，人畜虽殊，爱子之心一也，安可杀欤。 三曰营生不宜杀生。 世人为衣食故，或畋猎，或渔捕，或屠宰牛羊猜犬等，以资生计。 而我观不作此业者，亦衣亦食，未必其冻馁而死也。 杀生营生，神理所极，以杀昌裕，百无一人，种地狱之深因，受来生之恶报，莫斯为甚矣，何苦而不别求生计乎？ 尝观见屠羊者，垂死而口作羊鸣； 卖鳝者，将亡而头如鳝啮。 此二事，近在邻居，即非传说。 我劝世人，若无生计，宁丐食耳，勿得造杀而生，作此冤业也。 四曰宴客不宜杀生。 良辰美景，贤主嘉宾，蔬食菜羹，不妨清致，何须广杀生命，穷极肥甘，笙歌餍妖於杯盘，宰割冤号於砧几。 嗟乎，有人心者，能不悲乎？ 若知盘中之物，从砧几冤号中来，则以彼极苦，为我极欢，虽食且不下咽矣，可不悲乎。 五曰祭先不宜杀生。 亡者忌辰，及春秋祭扫，俱当戒杀，以资冥福，杀生以祭，徒增业耳。 夫八珍罗於前，安能起九泉之遗骨，而使之食乎？ 无益而有害，智者不为矣。 或曰：梁丑帝以面为牺牲，世讥其使祖宗不血食。 噫，血食未必珍，蔬食未必恶，为人子者，贵乎慎修其身，而不覆先宗祀，斯善矣，奚取於祀之必用血也。 礿祭胜於杀牛，易垂明训； 牲养犹为不孝，圣有嘉谟。 奚取於祀之必用血也。 六曰祈禳不宜杀生。 世人有疾，杀牲祀神，以祈福佑，不思己之祀神，欲兔死而求生也，杀他命而延我命，逆天悖理，莫甚於此矣。 夫正直者为神，神其有私乎？ 命不可延，而杀业具在，种种淫祀，亦复类是。 《药师经》云：杀种种众生，解奏神明，呼诸魍魉，请乞福佑，欲冀延年，终不可得，所谓命不可延，杀业俱在也。 种种淫祀，如杀生求子，杀生求财，杀生求官等，及其得子、得财、得官，皆本人分定，非鬼神所为也。 偶尔满愿，遽谓有灵，信之弥坚，行之愈笃，邪见炽然，莫可救疗，悲夫。 七日婚礼不宜杀生。 世间婚礼目，问名纳采，以至成婚杀生，不知其几。 夫妇者，生人之始也，生之始而行杀，理既逆矣。 又婚礼，吉礼也，吉日而用凶，事不亦惨乎。 凡人结因、，必祝愿夫妇谐老，尔愿谐老，禽兽愿先亡乎？ 嫁女之家，三日不息烛，思相离也。 尔以相离为苦，禽兽以离为乐乎？ 信乎，婚之不宜杀矣。 如上所列，甚拂常情，达人览之，必以为确论。 倘能全戒，善莫加焉。 其或不然，量力除减，或去四、五，或禁二、三，除一事则消一业，减一杀则杜一冤。 若未能断绝腥膻，且先，应市买见物，不加亲杀，亦免大愆，积养慈心，渐入佳境。 得斯文者，更望展转流通，相劝化，能劝一人不杀，如救百万生灵，劝至十人、百人，以及千万亿众，阴功浩大，善果无穷，但肯信行，决不相赚。 劝杀牛歌 我劝世人，勿食牛肉。 服耕效劳，反遭杀戮。 尔食何来，忍为烹鬻。 吁嗟此牛，莫云是畜。 六道轮回，互相报复。 焉知夙生，非尔眷属。 岂谓无知，临死觳觫。 口不能言，流泪若哭。 皮解体分，犹张两目。 目匪徒张，看尔反覆。 能保他年，不变为犊。 念我同生，贪才纵欲。 只爱口甜，不思中毒。 有饭充饥，得蔬已足。 适口物多，何必牛肉。 鉴戒甚明，勿食是福。",
      "translated_text": "His wife wept and cried, \"What you killed last night was our son!\" The man leapt up in horror, his five viscera bursting asunder.\n\nAlas! Though human and beast differ, the love for one’s child is the same—how could one bear to kill?\n\n**3. Do not kill to sustain livelihood.**\nFor the sake of clothing and food, people hunt, fish, or slaughter oxen, sheep, pigs, and dogs to make a living. Yet I observe that those who do not engage in such trades also have clothing and food—they do not necessarily freeze or starve to death. To kill for livelihood is utterly abhorrent to divine principle. Those who prosper through killing are fewer than one in a hundred. Such acts plant the deepest seeds of hell and reap dire retribution in future lives—nothing is more grievous. Why not seek another means of livelihood?\n\nI have witnessed a butcher of sheep, at the brink of death, bleating like a sheep; and a seller of eels, on his deathbed, biting like an eel. These two cases occurred among my neighbors—no mere hearsay. I urge all people: if without means, better to beg for food than to live by killing and thus create karmic debt.\n\n**4. Do not kill when hosting guests.**\nOn fine days with good company, a simple meal of vegetables and broth suffices to preserve refinement. Why must one slaughter countless lives, indulging in excess with rich meats, filling cups and plates with song and dance while the cries of the slaughtered rise from the chopping block? Alas! Those with human hearts—can they not feel sorrow? If one knew that the food on the plate came from the anguished cries of the butcher’s block, that their extreme pleasure was another’s extreme suffering, even the morsel would stick in the throat. Can one not grieve?\n\n**5. Do not kill when offering ancestral sacrifices.**\nOn the death anniversaries of the departed and during spring and autumn sacrifices, one should abstain from killing to accumulate merit for the deceased. To kill for sacrifice only adds to karmic burden. Before the eight delicacies, how can one rouse the bones of the nine springs to partake? Such acts are harmful and bring no benefit—no wise person would do this.\n\nSome say: Emperor Wu of Liang used flour to make sacrificial animals, and the world mocked him for denying his ancestors \"blood offerings.\" But blood offerings are not necessarily noble, nor are vegetable offerings base. As descendants, what matters is to cultivate virtue and ensure the ancestral rites endure—not whether the sacrifice must involve blood. The *Book of Changes* teaches that a simple offering surpasses slaughtering an ox, and the sages declare that even sacrificial feasting is unfilial. Why insist on blood?\n\n**6. Do not kill when praying for blessings or averting misfortune.**\nWhen ill, people slaughter animals to sacrifice to the gods, seeking blessings. Yet they do not consider: in sacrificing to the gods, they seek to avoid death and prolong life—by taking another’s life to extend their own. Nothing is more contrary to heaven or reason. The gods are upright and impartial—how could they show favoritism? Life cannot be prolonged, yet the karma of killing remains. All such superstitious sacrifices are of this kind.\n\nThe *Bhaiṣajyaguru Sūtra* states: \"Those who kill various beings, beseeching gods and spirits, invoking demons to seek blessings and longevity, will never attain it.\" For life cannot be extended, and the karma of killing endures. Superstitious practices—such as killing for children, wealth, or official rank—are all the same. If one obtains a child, wealth, or position, it is by one’s own destined lot, not the work of ghosts or gods. If a wish is coincidentally fulfilled, one hastily deems it divine favor, believing all the more firmly and practicing all the more earnestly. Such delusion burns fiercely—none can be saved. How tragic!\n\n**7. Do not kill during marriage rites.**\nOn the day of marriage, from betrothal to the wedding feast, how much killing occurs! Marriage marks the beginning of human life—yet to begin life with killing is contrary to reason. Moreover, marriage is an auspicious rite, yet to use an inauspicious act on an auspicious day—how grim!\n\nWhen people form a union, they wish for the couple to grow old together. Do they wish the birds and beasts to die first? The bride’s family keeps lamps lit for three days, lamenting separation. Do they find separation painful, yet think beasts rejoice in it? Truly, marriage should not involve killing.\n\nThe above may offend common custom, but the discerning will recognize it as sound reasoning. If one can fully abstain, no greater good exists. If not, one may reduce killing by half or more—abandoning four or five practices, or forbidding two or three. Removing one act dissolves one karmic burden; reducing one killing severs one grievance.\n\nIf unable to renounce meat entirely, one may first refrain from personally slaughtering, buying only what is already butchered in the market. This too avoids grave transgression, nurturing a heart of compassion and gradually entering a better state.\n\nThose who receive this text should circulate it widely, exhorting one another. To persuade one person not to kill is to save a hundred thousand lives. To persuade ten, a hundred, or countless others—what vast hidden merit, what boundless good fruit! Only believe and practice, and you will not be deceived.\n\n**Song Exhorting Against Killing Oxen**\nI urge the world: do not eat beef.\nFor plowing and toil, they meet slaughter instead.\nFrom whence comes your food? How can you bear to feast?\nAlas, these oxen—do not call them mere beasts.\nThrough the six paths of rebirth, we repay one another.\nWho knows if in a past life, they were your kin?\nDo you think them senseless? At death, they tremble in fear.\nMute, they weep tears, their eyes wide in terror.\nSkinned and dismembered, their eyes still stare—\nNot just staring, but watching your fate.\nCan you be sure that in years to come,\nYou will not return as a calf?\nRemember our shared existence, yet you indulge greed and desire.\nYou love the taste, heedless of the poison within.\nRice fills the belly; vegetables suffice.\nWhy must you crave beef when so much else pleases the palate?\nThe warning is clear: to abstain is your blessing.",
      "overlap_context": "death of another’s—how can one’s heart bear it? When an infant is born, instead of accumulating merit, one kills and creates karma—how foolish! There was once a hunter who, drunk at night, mistook his young son for a roebuck. He sharpened his blade and prepared to kill him. His wife wept and pleaded, but he would not listen. He slit the child’s belly and pulled out his intestines. Only after sleeping it off and waking at dawn did he call for his son, intending to sell roebuck meat in the market.",
      "start_char": 5104,
      "end_char": 6337,
      "start_sentence": 219,
      "end_sentence": 279,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.95697546005249,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\水镜录.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "水镜录竟",
      "translated_text": "The *Record of the Water Mirror* concludes.",
      "overlap_context": "y tremble in fear.\nMute, they weep tears, their eyes wide in terror.\nSkinned and dismembered, their eyes still stare—\nNot just staring, but watching your fate.\nCan you be sure that in years to come,\nYou will not return as a calf?\nRemember our shared existence, yet you indulge greed and desire.\nYou love the taste, heedless of the poison within.\nRice fills the belly; vegetables suffice.\nWhy must you crave beef when so much else pleases the palate?\nThe warning is clear: to abstain is your blessing.",
      "start_char": 6338,
      "end_char": 6345,
      "start_sentence": 280,
      "end_sentence": 280,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 3.011368989944458,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\水镜录.txt",
        "category": "正统道藏续道藏"
      }
    }
  ]
}