{
  "source_id": "汉武帝内传",
  "source_file": "chunked_daozang\\汉武帝内传.json",
  "total_chunks": 20,
  "total_original_chars": 14503,
  "total_translated_chars": 88962,
  "total_translation_time": 445.5339136123657,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\记传类\\汉武帝内传.txt",
    "category": "记传类"
  },
  "full_translation": "*The Inner Transmission of Emperor Wu of Han*\n*Text Title: The Inner Transmission of Emperor Wu of Han*\n*One fascicle. Base text from:* The Orthodox Daoist Canon*, \"Records and Biographies\" section of the* Dongzhen *department. Collated with:* Shoushan'ge Congshu *edition (annotated by Qian Xizuo) and the* Siku Quanshu *edition.*\n\nEmperor Xiaowu was fond of the arts of longevity and frequently offered sacrifices at famous mountains and great marshes in search of divine immortals. In the first year of the Yuanfeng reign, on the jiazi day, he sacrificed at Mount Song, establishing a divine palace. The Emperor fasted for seven days, and upon completing the rites, he returned.\n\nOn the wuchen day of the fourth month, as the Emperor leisurely resided in the Chenghua Palace at night, Dongfang Shuo and Dong Zhongshu attended him. Suddenly, a woman appeared, dressed in azure robes, of extraordinary beauty. Startled, the Emperor asked her who she was. The woman replied, \"I am Wang Zideng, the Jade Maiden of the Tang Palace, sent by the Queen Mother of the West from Kun Mountain.\" (Kun Mountain is Kunlun Mountain.) She said to the Emperor, \"I have heard that you, though revered across the Four Seas, seek the Dao and long for life, descending from the throne of emperors to repeatedly pray at mountains and peaks. How diligent! You seem one who may be taught. From now, purify and fast for a hundred days, abstaining from worldly affairs. Do not govern. On the seventh day of the seventh month, the Queen Mother will briefly visit.\"\n\nThe Emperor descended from his seat and knelt in assent. As soon as she finished speaking, the woman suddenly vanished. The Emperor asked Dongfang Shuo, \"Who was this?\" Shuo replied, \"She is a Jade Maiden of the Purple Orchid Chamber of the Queen Mother of the West, who often conveys decrees, traveling to Fusang, entering Lingzhou, passing through Changyang, and transmitting messages to the Mystic Capital. The Queen Mother was once betrothed to the Immortal of the Northern Candle, but was recently recalled to oversee decrees and records—a true divine official.\"\n\nThereupon, the Emperor ascended the Terrace of Extending Spirits, devoting himself to fasting and cultivating the Dao, entrusting the affairs of the four directions to his chief minister. By the seventh day of the seventh month, he had cleansed the inner palace, prepared a seat in the hall, spread purple silk upon the ground, burned incense of a hundred harmonies, hung cloud-patterned brocade curtains, lit lamps of ninefold radiance, set out jujubes from the Jade Gate, poured grape wine, and personally oversaw the dishes, preparing a celestial feast.\n\nThe Emperor, clad in his finest robes, stood below the steps, commanding that no one within the main gate dare to peek. Inside and out, all was silent and solemn as they awaited the cloud-borne carriage. After the second watch, suddenly the southwest sky stirred as if white clouds arose, swelling and approaching directly toward the palace. In an instant, it drew near, and from within the clouds came the sounds of flutes and drums, the clamor of men and horses. After half a meal’s time, the Queen Mother arrived. Her descent before the hall resembled a flock of crows alighting. Some rode dragons and tigers, others a single *jie* astride lions, or mounted white tigers, or rode white *lin* unicorns, or guided white cranes, or drove *ke* carriages. Tens of thousands of immortals illuminated the courtyard with their brilliance.\n\nOnce they arrived, her attendants could no longer be seen; only the Queen Mother remained, seated in a *jie* carriage of purple clouds, drawn by nine multicolored striped dragons. Beside her were fifty celestial immortals, each a *zhang* tall, all bearing feathered staves and wearing golden adamantine sashes, girded with celestial tallies. They all halted before the hall, while the Queen Mother, supported by two handmaidens, ascended the steps.\n\nThe handmaidens appeared to be sixteen or seventeen years old, dressed in azure silk robes with trailing sashes. Their eyes sparkled with radiant glances, their bearing elegant and luminous—true beauties. The Queen Mother, facing east, took her seat. She wore a yellow brocade robe with a high collar and wide sleeves, its embroidery resplendent, her demeanor serene and majestic. A great sash of *lingfei* hung from her waist, and she bore the Sword of Parting the Head. Upon her head was a grand floral knot, crowned with the *Tai Zhen Chen Ying* coronet. Her shoes were black, embroidered with phoenix patterns. Though she appeared to be thirty, her stature was perfectly proportioned, her celestial grace misty and ethereal, her countenance unmatched in the world—a true divine being.\n\nAs she alighted from her carriage and ascended the steps, the Emperor bowed and knelt, inquiring after her well-being. Once finished, he stood as before. She then summoned the Emperor to sit beside her. The Emperor faced south toward the Queen Mother.\n\nThe Queen Mother personally arranged the feast, which was of extraordinary refinement: sumptuous delicacies, fragrant fruits of a hundred kinds, purple mushrooms in rich broth, and dishes so abundant they seemed to fill the hall. The wine was of celestial fragrance, unlike anything on earth, its sweet aroma unparalleled. The Emperor could not name it. She then commanded her handmaidens to fetch peaches. In a moment, they presented seven peaches in a *luan* vessel, each as large as a duck’s egg, round and green in hue. The Queen Mother offered four to the Emperor and ate three herself. The peaches were so sweet and delicious that their flavor lingered in the mouth.\n\nThe Emperor ate them and kept the pits. (Keeping, that is, preserving them.) The Queen Mother asked, \"Why?\" The Emperor replied, \"I wish to plant them.\" The Queen Mother said, \"These peaches bear fruit but once every three thousand years. The soil of the Central Land is too poor; they will not grow. How can this be?\" The Emperor then desisted.\n\nAs the wine cups passed several times around the gathering, the Queen Mother then commanded her handmaiden Wang Zideng to pluck the *balang* zither, and her handmaiden Dong Shuangcheng to play the *yunsu* reed pipe. She further ordered her handmaiden Shi Gongzi to strike the bronze bells of Kunting, her handmaiden Xu Feiqiong to sound the *zhenling* reed organ, and her handmaiden Ruan Linghua to arrange the five *ling* stones—*cun* here meaning \"to arrange,\" and the stones resembling jade chimes. Her handmaiden Fan Chengjun was bidden to strike the *qing* of Dongting, while her handmaiden Duan Anxiang performed the *jiutian* zither. Thus, the myriad sounds rang clear and resonant, their divine music startling the heavens.\n\nThen the Queen Mother commanded her handmaiden An Faying to sing the *Xuanling* hymn, its lyrics as follows:\n\n*\"Though the Great Image be vast and boundless,\nI hold the gate of heaven and earth.\nParting the clouds, I descend in my spirit chariot,\nSwiftly arriving in the lower realm.\nThe void forms a mysterious sound,\nThe utmost spirit brooks no refinement.\nThe Supreme Perfected exhales a chant,\nOnly then do I know the bitterness of the dusty world.\nNurture the spirit in the Three Fields,\nAbsorb essence beneath the Six Palaces.\nThen ride the myriad dragons’ posts,\nGalloping through the nine wilds.\"*\n\nThe second verse:\n\n*\"The Dark Garden halts at the Northern Terrace,\nThe Five Cities stand towering.\nI open the boundless ford,\nCrossing the Weaving Maid’s River.\nAbove, I ascend the crimson court,\nBelow, I wander the moon’s hidden vale.\nGazing beyond the eight wastes,\nI beckon the nine clouds afar.\nSuddenly, weariness is unfelt,\nHow could I reckon little or much?\nI command the assembled maidens,\nSinging to stir harmonious resonance.\nExquisite joy flows naturally,\nThus I sing this hymn of the dark clouds.\nThe music fades, yet the melody lingers,\nThe true sound is free of all impurity.\"*\n\nWhen the song ended, the Emperor descended from his seat and kowtowed, declaring: \"I, Liu Che, unworthy and untalented, have long been mired in the mundane world. Inheriting the legacy of my ancestors, I am shackled by worldly burdens. My governance is flawed, the people disunited; wind and rain fall unseasonably, the five grains bear no fruit. Virtue and grace remain unestablished, bandits plague the four seas, the black-haired people toil to exhaustion, and households have dwindled by half. As an unfit ruler, my failures mount like mountains. Yet from youth I have loved the Dao, yearning for the immortals. I could not abandon rank and renown to dwell in the mountains and forests, nor sever worldly attachments to know where to turn. Forsaking the world to seek truth, I drilled and probed without a teacher. The years and months have worn on, and I fear my time is fleeting. Never did I imagine that today your celestial countenance would descend, granting this humble servant the fortune to behold your sacred presence. This must be my destined fate to attain transcendence. I beg your compassion, that you bestow upon me what I have failed to comprehend, and allow me to receive your personal teachings.\"\n\nThe Queen Mother replied: \"You—hereafter the same—have scorned glory and pleasure, delighting in emptiness and savoring the Dao; this is indeed excellent. Yet you indulge your desires, your excesses and licentiousness run rampant, your killings are unlawful, and your nature is steeped in extravagance. Indulgence is the chariot that rends the body, lust the axe that shatters the years. Killing invites retribution, extravagance rots the heart, desire topples the spirit, and filth severs fate. With a body as fragile as yours, housing a ruined form, a mere foot of timber assailed by a hundred *ren* of harm—how can you hope to shed the Three Corpses, preserve your body, and endure forever? It is like a wingless heron longing to flap its wings over the celestial pond, or a mayfly wishing to enjoy the spring and autumn. If you could sweep away these myriad disorders, purge filth and restore harmony, guard your spirit’s darkness in the Crimson Palace, close the gates of excess and open the gates of enlightenment, still the extravagance in the chamber of stillness, cherish all beings without endangering them, uphold these precepts of the Dao, contemplate its numinous essence, practice kindness and harmony, refine and treasure your essence and *qi*, cast aside frivolous adornments, and let the hundred strivings swiftly recede—then perhaps you might glimpse the path. If not, it would be as futile as embracing a stone to cross a great river.\"\n\nThe Emperor knelt to receive the sacred precepts, vowing to heed her words. \"The essentials of nurturing life I have now heard, yet my body is not of jade or stone, and my *qi* has no master within. My darkness is not of the four seasons, yet it constantly arises within. In governing, I must regulate my comings and goings, ensuring that breath is harmonious and fluids flow smoothly, that form and spirit are not disordered, and that *qi* adapts as needed. Then the hun and po will not stagnate. If I can align with my allotted portion, discerning the proper measure of *qi* and its movements, then my form may not wither, and my dwelling may not decay. Though I once received the scriptures of the Dao and diligently practiced them, I gained no true verification, no great benefit. My spirit is wearied by its comings and goings, my fluids labored by their egress and ingress. The years diminish their beginning, the months wane their past; my form gradually withers, my spirit declines. This is because I have failed to uphold the oral instructions, opening and closing the Gate of Brilliance as required. I do not know whether the arts of ingestion can ensure permanence, or whether breath control can extend the years. I beg you to bestow the art of longevity, that I may briefly awaken this walking corpse. If you would deign to instruct me today, I prostrate myself to receive the teachings of the resplendent heavens.\"\n\nThe Queen Mother said: \"Long ago, when the Primordial Heavenly King of the Origin was at leisure, he ascended the Terrace of Nieshao. His attendants—the Heavenly Emperor of Fusang, the Nine Perfected Lords, the myriad immortals and officials of the ten directions—gathered within the cinnabar chamber to hear his profound words. He asked me why I sought to attain long life. I withdrew from my seat, kowtowed, and begged to learn the art of longevity. The Heavenly King, in his wisdom, bestowed upon me essential words—utterances profound and subtle, truly the mysterious vision of heaven and humanity, the wondrous secrets of the Supreme Emperor. Would you now wish to hear them?\"\n\nThe Emperor knelt and said: \"I, Liu Che, a lowly and worthless creature, a remnant of withered bones, dare to aspire with my unworthy body to the years of dragons and phoenixes, hoping with the ephemeral quality of morning flowers to attain the span of dark and bright moons. Though I long for distant currents, I know not how to cross. The path is blocked and impassable, my needs unmet. I constantly fear that one day I will die in the struggle of seeking, becoming a laughingstock to the vulgar. Never did I imagine that today I would encounter this luminous convergence, gazing upon your sacred form, my spirit soaring as if awakened from a great dream.\"\n\n\"Should you traverse the world for a thousand years, to rescue and safeguard the day of death’s return—then I humbly beg your compassionate instruction, that you bestow upon me the primal essence.\"\n\nThe Queen Mother said: \"I shall now impart to you the essential teachings. I once heard the Heavenly King say: Those who seek long life must first seek it within themselves. Simply guard firmly the Three Ones and preserve your traveling clan. There are the golden radiance enfolding herbs, the yellow woods of Broad Mountain, the jade medicines of Prosperous City, the fire-jade of Night Mountain, the singing wine of Phoenix Grove, the jade wine of Western Jade, the purple honey of the Central Lands, the green mounds of Northern Tumulus, the supreme medicines of the Most High—phoenix fruits and cloud seeds, jade nectar and golden liquor, moon essence of ten thousand years, azure-sea coral greens, the patterned herbs of Penglai, the seven blossoms of Turbid River, the tall willows of Moving Mountain, the brocade flowers plucked from Dark Capital’s heights, the crimson honey sipped from Cloud Mountain’s peaks, the heavenly bones of Night River, the lacquer foam of Kunwu, the single spirit melon of the empty cavern, the fruit that ripens once in four kalpas, the unicorn gall of Proper Mound, the sun of Flame Mountain that rises in a single night, the cinnabar archives of Fusang’s east, the patterned algae dredged from the Long River’s depths. There are the white-violet lads, the nine-colored phoenix brains, the rainbow sprouts of the Great Perfected, the giant grasses of Heavenly Desert, the fire-jades of Southern Palace, the elder-supporting herbs of Western Land, the three-beamed dragon flowers, the birth herbs of the Great Dao—whoever partakes of these will age only after heaven itself. These are what the Most High consume; they are not what middling immortals preserve.\n\nNext in rank are the medicines: the Eight Radiant Supreme Harmony, the spotted dragon’s black embryo, the striped tiger’s white foam from Western Mound, the seven dark flying nodes, the nine-holed linked pearls, cloud nectar and jade wine, the fat of Jade Garden, the white glue of Bell Mountain, the azure of Jade Chamber, the stone marrow of Boudoir Wind, the black river’s coral, the white phoenix of Meng Mountain, the blood of the azure simurgh of Spirit Mound, the crimson herbs of Eastern Ying, the nine-jointed intertwined stalks, the fine grains of Supreme Microcosm, the brain-fruits of Jade Flower, the whale eyes of Flowing Abyss, the crimson jades of Red River, the fermented milk drawn from the Great Mystery’s north, the pulses grasped from the Two Modes’ center, the cloud-stream mugwort, the divine birds of Kun Hill, the stem herbs of Broad Night, the green teals of Flowing Abyss, the thunder essence of True Mound, the level canopy of Dark Capital, consuming the divine origin on the left, hearing the dark torrent on the right, bending to gather the golden essence of Orchid Garden above, stooping to pluck the purple crabapples of Round Mound below, the spirit clams of Luan Waters, the red Yueh of Eight Gorges—whoever partakes of these will depart only after heaven itself. These are what the Heavenly Emperor consumes; they are what lesser immortals may attain.\n\nNext are the medicines: the nine elixirs and golden liquor, the purple flowers and crimson blossoms, the nine transformations of Great Clarity, the nectar of five clouds, the dark frost and crimson snow, the leaping three yellows, the white incense of Eastern Sea, the flying life of Flame Continent, the eight stones and ten sprouts, the nine radiant perfected forms, the stone gall of Western Flow, the green coins of Eastern Sea, the surplus grains of High Mound, the essence stones of Jade Field, the returning elixir of Great Void, the golden orchids of Shengci, the ever-bright green herbs, the flying stalks of Cloud Lad—whoever consumes these will ascend to heaven in broad daylight. These are what flying immortals consume; they are what earthbound immortals may witness.\n\nBelow these are the medicines: the pines and cypresses’ resin, the essence of mountain ginger, the marsh plants and alisma, the wolfberries and poria, the calamus and asparagus, the sesame and astragalus, the flying red tablets of lepidium, the peach gum and vermilion blossoms, the pepper and hemp, the dipsacus and polygonatum, the polygonum and coptis—such lesser medicines, though I mention but a few, number in the thousands. Whoever consumes these may extend their years. Though they may not enjoy boundless longevity or ascend to the azure heavens, they can still restore their bodies’ luster, return their hair to youthful black, command plant spirits, and become earthbound immortals. The key is to record these in order, gradually seeking what is ever more excellent.\n\nThus the heavens’ offices are profoundly wondrous, and the numinous medicines are of distinct ranks. The divine is not singularly extraordinary, and true immortals have their domains. Now, one cannot simply claim that breathing the six blacks and securing them within the body, irrigating the three palaces and drawing near to the courtyard of the self, are shallow arts to be discarded and left unpracticed—this would be the greatest folly.\n\nTo master breath and govern essence, to preserve the luminous spirit and the black, is sufficient to ensure that when essence does not dissipate, one endures forever, and when the black remains eternal, one does not die. Having attained harmony, one’s life knows no end. Moreover, this requires neither the expense of medicines nor the toil of seeking them. It is what the people use daily, and thus the highest grade is called the natural.\n\nYet one may not roam the ten heavens or soar beyond the eight directions, but may freely wander within the four realms, and even there, command the multitude of spirits. For those who first wish to cultivate this, begin by nurturing the black—this is what the *True Scripture of the Most High* calls the Way of Benefit and Transformation. Benefit refers to augmenting essence; transformation refers to transforming form. Those who can augment and transform are recorded in the registers of the highest immortals. Those who cannot augment nor transform cannot escape the calamity of death.\n\nTo practice augmentation and transformation means to constantly contemplate the numinous treasure. The numinous is spirit; the treasure is essence. You need only receive essence, grasp it firmly, close the black, and swallow the fluid. The black transforms into blood, blood into essence, essence into fluid, fluid into bone. Practice this without weariness, and spirit and essence will overflow. In one year, the black is transformed; in two years, the blood; in three years, the vessels; in four years, the flesh; in five years, the marrow; in six years, the sinews; in seven years, the bones; in eight years, the hair; in nine years, the form is transformed and changed. When the form is transformed and changed, the Dao is achieved, and upon achieving the Dao, one is ranked among the immortals.\n\nExhaling and inhaling the six blacks, the mouth becomes sweetly fragrant. Desiring to taste the numinous sprouts, one may savor their flavor. With subtle breaths and embracing swallows, follow the heart’s inclination. The black is water—nothing it cannot accomplish. As the most yielding of substances, it conveys the divine essence.\n\nThese are the esoteric words spoken by the Primordial Heavenly King within the cinnabar chamber. Now, I command the jade maiden Li Qingsun to transcribe and deliver them to you. Record them well and follow them diligently.\"\n\nWith these words roughly concluded, the Queen Mother whistled to summon the spirit officials, ordering them to harness the dragon-drawn carriage, preparing to depart.\n\nThe Emperor kowtowed, entreating her earnestly to stay, and the Queen Mother relented.\n\nThe Queen Mother then dispatched her attendant, Guo Mixiang, to convey greetings to the Supreme Primordial Lady, saying: \"The Mother of the Nine Lights respectfully inquires after you. It has been over four thousand years since we last met. Heavenly affairs have wearied me, leaving my countenance wanting. Liu Che is devoted to the Dao, and I have come to observe him. I see that he is clear-minded and may yet progress. Yet his form is sluggish, his spirit defiled; his brain blood leaks wantonly, his five viscera impure. His stomach and intestines churn, his bones lack vital fluids, his qi drifts between inner and outer, his essence scant and jing abundant. His pupils are uneven, the Three Corpses stir in chaos, and his black and white hairs come untimely. To speak to him of the utmost Dao—I fear he may not be fit for immortality. Though I have long dwelled among mortals, I still find the stench and filth unbearable. Yet at times, I may still wander, hoping to dispel these petty concerns. The mediocre lord sits opposite, sullen and displeased. Would you deign to come for a brief visit? If you could condescend to descend, I shall wait for you.\"\n\nThe Emperor did not know who the Supreme Primordial Lady was, and as he watched the attendant descend from the hall, she suddenly vanished from sight. After a moment, Guo the attendant returned. The Supreme Primordial Lady had sent her own attendant in reply, saying: \"Ahuan bows twice and inquires after your well-being. Separated by the Crimson River and burdened by official duties, my countenance has faded for nearly five thousand years. I long for your radiance and grace, my heart ever bound to you without fail. When Mixiang arrived bearing your message, I learned of your condescension to visit Liu Che. Upon hearing this, I was overcome with joy. Yet just before, the Great Emperor Lord dispatched me to the Dark Continent to review and rectify the Heavenly Records. I must depart briefly, but I shall return. Upon my return, I shall don my sash and stay for a short while.\"\n\nThe Emperor then asked about the Supreme Primordial Lady’s origins. The Queen Mother replied: \"She is the overseer of the Supreme Primordial Palace of the Three Heavens, the one who governs the registers of jade maidens across the ten directions.\"\n\nShortly after, the Supreme Primordial Lady arrived. As she approached, the sound of flutes and drums echoed through the clouds. Upon her arrival, her retinue of over a thousand civil and martial officials—all women—appeared. They were around eighteen or nineteen years of age, their forms luminous and graceful, most clad in azure robes. Their radiance outshone the sun, for they were true divine officials. The Lady herself appeared to be in her twenties, her celestial bearing resplendent, her eyes surpassingly bright. She wore a robe of crimson frost, its hues shifting in dazzling patterns—neither brocade nor embroidery, beyond any name. Her hair was styled into a three-cornered topknot, the rest cascading down to her waist. She wore a crown of Nine Spirits’ Night Radiance, a girdle of Six-Rayed Fire Jade, a sash of phoenix-patterned lin-hua, a sword of flowing yellow essence at her waist. She ascended the hall and bowed to the Queen Mother, who sat and gestured for her to stop, inviting her to sit facing north.\n\nThe Lady prepared a feast, its delicacies as refined as those the Queen Mother had set before them. The Queen Mother urged the Emperor, saying: \"This is the True Primordial Mother, a most revered deity. You should rise and bow to her.\" The Emperor exchanged courtesies and returned to his seat.\n\nThe Lady smiled and said: \"The people of this turbid world are mired in glory and profit, addicted to flavors and lusts—such is their nature. Moreover, Che, as a Son of Heaven, is twice as prone to distraction as ordinary men. Yet here he stands in this realm of splendor, having uprooted the roots of desire—this is no small feat. He truly has resolve.\"\n\nThe Queen Mother said: \"Indeed, he has the heart for it.\"\n\nThe Supreme Primordial Lady then asked the Emperor: \"Do you love the Dao? I hear you have frequently summoned masters of the esoteric arts, made offerings to mountains and rivers, and supplicated the numinous spirits. You have been diligent. Yet your efforts have borne no fruit—there is a reason for this.\"\n\n\"Your inborn nature is violent, your inborn nature is extravagant, your inborn nature is lustful, your inborn nature is cruel, your inborn nature is treacherous—these five ever dwell within the channels of *ying* and *wei* and the five viscera. Though sharp blades and fine needles be applied, they are fundamentally difficult to cure.\n\nViolence drives the *shen* to flee in terror, so the spirit is disturbed and the *shen* exhausted. Lust causes essence to leak and the *hun* to weary, so essence is drained and the *hun* dissolved. Extravagance severs the true and scatters the *po*, so the root wanders and the numinous fades. Cruelty forfeits benevolence and turns against oneself, so one loses benevolence and submits to chaos. Treachery makes the heart a battleground and the mouth parched, so inner strife rages and outer ties are severed. These five are the saws and knives that sever the body, the axes and blades that cleave life. Though you may exhaust yourself in pursuit of longevity, if you cannot cast off these five afflictions, why harm your nature and weary yourself in vain?\n\nYet even this small benefit is enough to awaken you to the path ahead. If from this day forward you abandon these five natures, return to gentleness and goodness, clarify your duties and examine those below, show compassion to the aggrieved, bestow kindness to the poor, relieve the toiling, remember the orphaned, cherish your own body, and constantly perform hidden virtues to rescue those in mortal peril—if you persist in diligence without ceasing, refrain from leaking essence, seal off lust, nurture your spirit, cast off extravagance, embrace utmost frugality, devote yourself to fasting and abstinence, moderate your diet, abstain from the five grains, eliminate rich and rank foods, sound the Heavenly Drum, drink the Jade Nectar, bathe in the Flowery Pool, strike the Golden Bridge, and practice these disciplines—then wings shall grow.\n\nNow the Most Venerable Mother has descended from the weight of Heavenly Honor, condescending to this mole-cricket’s burrow, bending the numinous emptiness to attend this solitary crow’s altar. Moreover, the Most Venerable Mother’s solemn admonitions, her wondrous teachings of the mysterious, test your reverence and diligence, and her measured instructions are clearly set forth. If your devotion endures for a hundred years, the Most Venerable Mother will surely guide you to the precincts of the Dark Capital, welcome you within the gates of Kunlun, appoint you to the offices of immortality, and enable you to roam the ten directions.\n\nMy words are finished. Steel yourself! If you cannot do this, there is nothing more to say.\"\n\nThe Emperor descended from his seat and knelt in gratitude, saying: \"This servant’s nature is fierce and stubborn, born and raised in chaos and filth. Facing a wall, I have never known enlightenment, nor found a way to break through. Yet I cling to life and fear death, revering the numinous and honoring the gods. Today, I receive your teachings—this is the work of Heaven. I shall humbly embrace your sacred command as the model for my conduct. Though this lowly and contemptible servant, I may yet attain life. I beg only for your compassion and protection, that you grant me the very breath of existence.\"\n\nThe Lady then bade the Emperor return to his seat. The Queen Mother of the West addressed the Lady, saying: \"Your admonitions were most urgent and severe, which may cause those yet unenlightened to shrink from their profound intent.\"\n\nThe Lady replied: \"If one is truly resolved upon the Dao, they would cast their body before a starving tiger, forgetting themselves to the point of destruction. They would tread through fire and water, steadfast in their resolve, without fear. But if their loyalty and will are lacking, their heart will waver between truth and doubt, and such a hesitant, deluded soul will not be deterred by stern words. The urgency of my speech is meant only to strengthen their resolve. Since the Most Venerable Mother has taken this to heart, she will surely bestow upon them the method of *shijie*.\"\n\nThe Queen Mother said: \"This one has long been diligent in heart, yet has never encountered a true teacher, nearly causing him to abandon his rightful aspiration. He came to doubt whether immortals exist in this world. Thus, I revealed my celestial palace and briefly withdrew him from the dust and filth, both to fortify his resolve for immortality and to ensure his faith in the Way remains unshaken. Today’s meeting moves me deeply. As for the *shijie* method of the lower ranks, I do not begrudge it in the least.\"\n\nThree years hence, I shall bestow upon him half a dose of the elixir of perfection and a single *Stone Elephant Powder*—then he may no longer tarry here. Yet now the Xiongnu remain unquelled, and the frontier is unsettled; why should he hastily abandon the exalted station of the world to retreat into the mountain forests? First, let us inquire into the steadfastness of his aspiration. Should he waver or turn back, I shall come no more.\"\n\nThe Queen Mother then laid her hand upon the Emperor’s back and said: \"You have heard the profound words of the Lady of Supreme Prime—surely you shall attain long life. How can you not strive with all your might?\"\n\nThe Emperor knelt and replied: \"I shall inscribe these words upon golden tablets and take them as my own model.\"\n\nHe then noticed within the Queen Mother’s headscarf a small scroll, encased in a purple brocade pouch. He asked: \"Is this a divine formula of the immortals? Might I be permitted to glimpse its title?\"\n\nThe Queen Mother produced it and showed him, saying: \"This is the *Chart of the True Forms of the Five Peaks*. The immortals of Qingcheng sought it from me, and I was to deliver it to them. It was issued by the Supreme One of the Three Heavens, and its secrecy and prohibitions are most stringent—how could one of your impure constitution be fit to bear it? For now, I shall give you the *Scripture of the Radiant Life*, which may open the way to communion with the spirits and strengthen your resolve.\"\n\nThe Emperor prostrated himself upon the ground and entreated her without cease. The Queen Mother said: \"In the first year of the *Qingxu* reign of the Supreme August One, the Most High Lord of the Dao descended to survey the six directions. He beheld the length and breadth of rivers and seas, examined the heights and depths of hills and mountains, established the Pillar of Heaven, and fixed it in the earth’s pattern. He planted the Five Peaks as the supporting pillars of the realm, honored Kunlun as the abode of divine immortals, exalted Penglai as the lodge of perfected beings, settled the water spirits at the source of utmost yin, and enthroned the Great Emperor at the site of Fusang. Thus, the mound of Fangzhang became the chamber of destiny, the islands of Canglang became the hall of the Nine Elders, while Zuying, Xuanming, Changyuan, Liusheng, Fenglin, and Juqu were each named as isles, all lying amidst the vast expanse of the dark tides and the profound ford. Their waters flow both azure and black, their waves surge with the essence of the sun and moon. Immortal maidens and jade lads gather there in countless numbers, their names unfathomable, yet their reality distinct.\n\nObserving the contours of mountain origins and the meanders of rivers and peaks—how the ridges coil and the mounds turn, how the mountains rise high and stretch long, winding and undulating like written characters—he therefore shaped their forms into names, designating their true appellations. He drew their images in secret upon the Dark Terrace, and from there they emerged as tokens of the numinous and true. All immortals who bear them do so as one would transmit a sacred text. When Daoists carry them while traversing mountains and rivers, the hundred spirits and myriad numina honor them and come forth to welcome them.\n\nThough you are not yet perfected, your repeated visits to mountains and marshes, your unwavering resolve to seek and inquire, have not forgotten the Way. Delighted by your sincerity, I now grant this to you. You must hold it in the deepest reverence, as though serving a lord or father.\"\n\nRevealing these to the common and uninitiated will surely invite calamity. The Lady of Supreme Primordium said to the Emperor: \"The Celestial Mother has now unveiled the wondrous mysteries of the jade tablets, disclosed the script of the Purple Terrace, and bestowed upon you the *Eightfold Assembled Writ* and the *True Forms of the Five Peaks*—truly the most precious and exalted, the profound contemplation of the Supreme Thearch.\n\nUnless one is destined by mandate and aligned with the numinous, one shall never behold these texts. Though you have now obtained the *True Forms* and glimpsed their wondrous principles, without the talismans of the *Five Thearchs and Six Jia*, the *Leftward Numinous Flight of the Six Ding*, the *Register of the Six Yu Jade Maidens of Great Yin Who Traverse the Void*, the *Writ of the Six Wu of Great Yang That Summons Spirits and the Celestial Radiance of Refined Essence*, the *Script of Left Yi That Binds Chaos and Gathers Obscurity*, the *Law of Right Geng That Restrains and Gathers Destruction*, the *Eight Arts of the Six Ren and Gui That Conceal in Earth and Withdraw*, the *Nine Crimson Talismans of Bing and Ding That Enter Fire*, the *Method of the Six Xin That Enters Metal and Draws Forth the Yellow Waters and Moon Essence*, the *Art of the Six Si That Conceals the Golden Light of Stone Essence and Transforms Form*, the *Six Numinous Dignities of the Eight Endowments and Ten Resolutions of Zi, Wu, Mao, and You*, the *Three-Five Sequential Progression of the Purple Writ of Longevity and the Pristine Formulae of Earthly Perfection of Chou, Chen, Wei, and Xu*, and the *Inner Vision of the Central Realm of the Purple Crossing and Blazing Radiance of Yin, Shen, Si, and Hai*—how can one summon the mountain spirits, convene the earth deities, command the myriad essences, drive the hundred ghosts, summon tigers and leopards, or employ dragons?\n\nWhat you know is but one part; you have yet to see the rest.\"\n\nThe Emperor descended from his mat and kowtowed until his forehead bled, saying: \"This humble, muddied subject of the lower realm knows not the purity of the true. Today, hearing the Dao, is the meeting of this life with the Sagely Mother. Now that you have bestowed the *True Forms*, I shall cultivate them to transcend the world. The Lady has now instructed me that I must also seek the arts of the *Five Thearchs and Six Jia*, the *Six Ding*, and the *Six Wu* to summon the numinous. Having received this enlightenment, the benefit is boundless. I only beg for further instruction to quench my thirst, that this withered tree may be moistened by the numinous yang, and these scorched grasses may be graced by the sweet rains. I dare not speak at length; I only wish to be granted guidance.\"\n\nThe Lady of Supreme Primordium said: \"I do not possess these texts. Long ago, on Mount Guang, I encountered the Azure Perfected Youth, who held this golden script of secret characters. He said that to seek the Dao and prolong life, one must master a thousand threads and ten thousand strands—all requiring the arts of the *Five Thearchs and Six Jia* and the *Numinous Flight*, the names and designations of the *Six Ding and Six Ren*—to petition for life extension, attain long life and enduring vision, command the host of spirits, and employ the hundred deities. Without the essential matters of the *Six Jia*, even one who guards the *True Forms* will find no path to communion with the numinous. You have the heart for this, so I have told you of these texts. I hope you will broadly seek and inquire further.\"\n\nThe Emperor persisted in his entreaties, kowtowing until blood flowed. The Lady of Supreme Primordium said: \"I truly do not possess these texts. The reason I have shown you these twelve matters is to urge you to seek widely and amass them, that they may complement the use of the *True Forms*.\"\n\nThen the Queen Mother addressed the Lady of Supreme Primordium: \"The *True Forms* and precious writs are treasured by the numinous officials. This one has sought without ceasing, vowing to obtain them, so I have relaxed the prohibitions and made an exception to bestow them upon him. Yet the arts of the *Five Thearchs and Six Jia* for communing with the true and summoning spirits are subtle and remote; they demand utmost purity and sincerity, and are hardly suited for those of turbid and common nature. Now that I have granted the *True Forms* to this one, you, Lady, must instruct him in the path to summoning the numinous.\n\nI recall that long ago, you and I ascended the dark mounds of the northern wilds and the Radiant Perfected Mountain, where we met the Prince Youth of the Swine. The Prince Youth then entreated me for the *Hidden Writ of the Supreme*. I said that the *Secret Words of the Three Primordials* could not be transmitted even to mid-ranking immortals. You, Lady, also spoke then, supporting the Prince Youth’s resolve. Since I could not refuse his earnest plea, I did not withhold out of mere stinginess.\"\n\nHere the matter bears some resemblance to that earlier occasion. Later, I journeyed to the Vermilion Fire Mound of Cinnabar, where I tasted the numinous melon—its flavor was most excellent. Yet though this memory seems recent, seven thousand years have already passed.\n\nSince you, Lady, have already revealed to him the titles of the scriptures and the twelve methods are complete, he must now craft and perfect them. Why then should one of his station kneel and beg, kowtowing until his forehead bleeds? The Supreme Primordial Lady said: \"It is not that I, Ahuan, am stingy—it is simply that I did not bring them with me. These are the texts issued by the Red Youth, Perfected of the Celestial Writ of the Great Void. Their transmission is bound by prohibitions of gender, and they ought to be conferred only upon those who have attained the Way. I fear that this one’s talents are not yet equal to their use.\"\n\nThe Queen Mother’s expression grew stern, and she said: \"If the celestial prohibitions are violated and the luminous statutes transgressed, transmission must be to the proper person, and conferral only to one who truly understands. Why then did you, Lady, speak to one of such modest talent of the titles of the *Numinous Flight* scriptures? Idle words leak, reckless speech divulges. To speak without transmitting is to trifle with the Dao of Heaven—this prohibition is no lighter than that of transmission itself. The Three Offices of the kalpas will surely hold you, Lady, accountable for this careless disclosure.\n\nMy *True Writ of the Five Marchmounts* was issued by the Celestial August Supreme. Its script is precious and wondrous, serving as the token of Heavenly Transcendents. How could it be fitting to bestow it upon Liu Che? It is only because of his earnest heart, his repeated petitions to the rivers and mountains, his diligent observance of purification rites in pursuit of a response from the divine immortals, and his aspiration to transcend the world—yet lacking a radiant teacher—that we have deigned to descend and grant him this. As for the arts of teaching immortality, we do not begrudge or withhold their transmission.\n\nBut do you, Lady, possess methods for summoning the numinous that you alone may withhold? The reason I now bestow upon him the *True Writ of the Realized Forms* is not because I believe he will necessarily attain the Way, but to validate his sincerity, to dispel his doubts in seeking immortality, and to guide and encourage those who turn toward transformation. I also wish to let the benighted know that such true matters exist between Heaven and Earth, enough to confound the reckless who refuse to believe. This is my intent.\n\nYet this one’s nature is lewd and violent, his refined essence impure. How could he become a true immortal, drifting through the ten directions of the void? If he diligently practices, it will suffice only to avoid death. As the luminous statutes declare: it is not attaining long life that is difficult, but hearing the Way; it is not hearing the Way that is difficult, but practicing it; it is not practicing it that is difficult, but persisting to the end. A skilled craftsman can give another the compass and square, but cannot ensure they will be skillful. A radiant teacher can impart wondrous arts, but cannot ensure they will be realized. Why then should you conceal them?\n\nDo you not recall, Lady, when on behalf of Master Longsang you entreated me for the *Eight Radiance Swift-Healing Elixir* and the *Jade Tree Formula*?\" The Supreme Primordial Lady’s countenance briefly shifted, and she knelt in apology, saying: \"Ahuan once began studying the Way on the mounds of Guangdu. In the days when I was still cultivating the cinnabar sincerity beneath the Jian Tree and my arts had not yet come to fruition, the Lord of the Inverted Scenery and the Master of No-Constancy—these two were the numinous officials of the Great Clarity and the Harmonious Heavens of the Supreme Purity—conferred upon me the twelve methods of the *Left and Right Numinous Flight of the Six Jia*. On the day they first transmitted them, the two lords told Ahuan: 'For one newly studying the Way, transmission occurs once every forty years; for one who has attained the Way, once every four hundred years; for one who has attained immortality, once every four thousand years; for one who has attained the Realized, once every forty thousand years; for one who ascends to the Supreme, once every four hundred thousand years. Women transmit to women, men to men. The statutes and prohibitions of the Supreme have already been inscribed upon the talismans of Illustrious Life.'\n\nSince receiving these texts, I have transmitted them to sixty-eight women. The worthy Great Lady Baolan is Ahuan’s disciple. What I have transmitted cannot be conferred upon men. I have observed that the Azure Perfected Youth of Fuguang Mountain once transmitted to the Central Primordial Lord of the Great Tenuity the twelve methods of the *Numinous Flight through the Void of the Six Jia of the Five Thearchs*, the *Left and Right Strategies of Celestial Radiance*, and other arts—identical in text to what I received, without a single difference. The Azure Perfected is a male official, and I have not heard of him transmitting them further. This one was once Ahuan’s disciple in the arts of entering fire. Now, at this very moment, I am taking them to confer upon Che. The reason I previously revealed the titles to him was to pity his earnestness and to strengthen his resolve to concentrate his qi. Now that he seeks them broadly, I will one day transmit them to him, also intending to confer upon a man as a man, in accordance with the statutes. Having diligently obtained them, he will know the preciousness of the celestial perfected, not merely trifling with or leaking the Dao of Heaven.\n\nMy original intent was thus. Ahuan, your servant, hopes not to be found wanting.\"\n\nThe wondrous subtlety of the Queen Mother’s *True Forms* is the token by which numinous beings transmit trust. The treasures of Heavenly Transcendents are sealed in golden caskets, worn to enter the Purple Tenuity. They proceed forward with their retinue, great tigers guarding the gates, crouching at the thresholds. Passing beyond the Great Clarity, they shake their bodies in the jade chambers, roaming the eastern seas to the left, bowing to the Eastern Mount, and reaching toward the Eternal Yang to the right. Below, they gaze upon the Fusang. Crossing the eight seas, they ride entwined dragons; traversing these renowned mountains, hosts of perfected welcome them. In motion, clouds and feathered canopies attend them; in stillness, they abide in eternal peace. Such is their majestic protection—yet these were never transmitted to the terrestrial officials. Now, Mother, you bestow them upon a corpse of lewd impurity, granting them to a body of dry bones. This is most unseemly.\n\nMoreover, Ahuan possesses the lesser arts of the Six Jia, which alone can command the hundred spirits, summon the radiant essence of the sun and moon, conceal one’s form and shadow, transform and give life to the myriad things, enter water and fire, spit and shout into the dark void, see backward and hear afar, gather and bind a thousand essences, ride tigers and leopards in swift pursuit, pluck the moon’s radiance to attain long life, vanish into the eight earths, reverse the turning of the stars, prolong vision and lighten the body, and incline toward Heaven. How could these compare to the numinous scriptures of the Supreme, the wondrous texts of the Eight Assemblies? Their use is subtle and remote, allowing one to wander the palaces of the luminous scenery, to ascend the halls of drifting rosy clouds in a whirl of fragrance, to serve as lord of the Five Marchmounts, to hold the goblet of medicinal liquor, to mount nine dragons in empty ascent, and to descend upon purple swans in dark flight.\"\n\nQueen Mother of the West smiled and said, \"Could the earlier lapse truly be forgiven?\"\n\nThe Primordial Lady of the Upper Heavens then commanded her attendant, Ji Lirong, to proceed directly to Mount Fu Guang, where she summoned the Azure Perfected Youth to present the twelve methods of the Six Jia’s left and right spirit-flight techniques for summoning the divine, which were to be bestowed upon Liu Che.\n\nIn an instant, the attendant returned, bearing a case woven with eight-colored jade and phoenix-script patterns—its dark radiance resplendent, its true essence magnificent and dazzling—along with a greeting from the Azure Perfected Youth.\n\nThe disciple A Chang said, \"Earlier, I was ordered to the Crimson River to assist the Southern Perfected Seven Sovereigns of the Primordial in inspecting the tally of grass dragons and fierce beasts. Upon completing the task, I passed by the gate to receive instruction, where I learned that the Celestial Mother had invited me to the home of Liu Che. I never imagined that the august deities of Heaven would deign to descend into this foul and turbid realm. May I inquire after your well-being?\"\n\nWhen Attendant Ji Lirong arrived, she conveyed the exalted one’s desire to obtain the twelve sections of the golden script’s secret characters—the Six Jia’s spirit-flight techniques for commanding left and right essences—and to bestow them upon Liu Che. She sealed one copy and entrusted it to the messenger, saying, \"Though Liu Che ardently seeks and admires the Way, he is in truth no immortal talent. How could I dare disseminate this art to a mere walking corpse?\"\n\nA Chang, having recently been in the imperial presence, had witnessed many memorials submitted to the throne: mountain spirits weeping in the herb groves, lonely souls wailing in distant lands, armies raised and clans rewarded for merit, yet soldiers forgotten in reward and punished in service, white bones strewn across the land, the common folk oppressed by extravagance and turmoil, cruelty and debauchery run rampant, sins already manifest before the Supreme, resentments already visible in the qi of the people, clamorous voices heard on all sides—he could never attain transcendence.\n\nThe Perfected One, moved by these admonitions, dared not refuse.\n\nQueen Mother of the West smiled and said, \"This child’s transgressions are indeed many, but the Emperor need not be so harsh in judgment.\"\n\nThose who cherish the Dao and yearn for transcendence—if they concentrate their essence and sincerity, their will and thought, fasting and reflecting on their transgressions—may eliminate a month’s worth of faults in a single month. If they restrain themselves and return to goodness, revering the Perfected Spirits, preserving their true nature and guarding Unity, practicing this for a month, they may eliminate a year’s worth of faults. A Chang has pondered the Dao for many years, and his fasting and accumulation of merit have been diligent. He has repeatedly prayed to the true spirits of the famous mountains, wishing to seek deliverance. When weighing his merits against his faults, they nearly balance. Yet from this day forward, he must cultivate utmost sincerity, heed the words of the Lady of the Primordial Dawn, and no longer indulge in extravagance, debauchery, or cruelty, lest the myriad masses suffer and perish, lest the resentful souls and destitute ghosts raise accusations of desecration and corpses drenched in blood, and lest the words of reward for merit be forgotten.\n\nThereupon, the Lady of the Primordial Dawn rose from her seat, holding in her hand a scroll of eight-colored jade inscribed with phoenix patterns. She raised her gaze to the heavens and prayed to the Emperor, saying:\n\n\"Vast are the Nine Heavens, radiant is the Supreme Luminance. The divine shines upon the mysterious and tranquil, the pure and void, bright and clear. Those who ascend the void attain subtlety; those who guard their qi attain life. When utmost devotion to the Dao is reached, the tranquil responds to true sincerity. To toil the spirit and humiliate the form is to secure peace, essence, longevity, and glory. I bestow upon A Chang the *Lingfei* and the Six Ding spirits of the left and right, the *Celestial Light* and *Essence-Strategy*, with which he may tread the void, conceal his form, attain long life and enduring vision, and restore youth, leaving white hair behind while retaining black.\n\nMy transmission spans forty thousand cycles; A Chang’s transmission occurs at the age of forty. Should he violate or leak these teachings, he will surely sink into the dark netherworld. Beware this calamity! I dare to admonish you, Liu, that your master is the Lesser Lord of the Azure Youth, the true master of the Central Yellow Dao Lord of the Supreme, and an inner-chamber disciple of the Celestial King of the Primordial Beginning. His surname is Yanling, his given name Yang, and his courtesy name Bihua. His form bears the appearance of an infant, hence the immortals’ title of *Azure Perfected Lesser Youth*. As for his vessel, it is luminous and all-encompassing, sagely and all-adaptive, a mysterious mirror that discerns the obscure, a talent that distinguishes truth from falsehood. Roaming the boundless, wielding the primal authority, his palace abides in the Mystic Garden, where he governs the duties of transcendents. Should you honor your master, your wishes shall be fulfilled. Should you neglect what is transmitted, your life will surely collapse.\"\n\nWhen the Lady of the Primordial Dawn finished her prayer, she pointed with her hand to each of the instructions and methods she had bestowed upon the Emperor. The first scroll contained the talismans of the Five Thearchs and the Six Jia spirits of the left and right, the *Lingfei*. The second scroll contained the records of the Six Ding spirits, the *Passage to the True and Concealment of the Void*, and the Jade Maidens.\n\nThe third scroll contains the *Book of the Six Wu of the Great Yang, Summoning Spirits and the Celestial Radiance’s Strategic Essence*. The fourth scroll contains the *Writ of the Left Yi, the Primordial Chaos and the Binding of Meng*. The fifth scroll contains the *Statutes of the Right Geng, the White Refinement and the Restraint of Slaying*. The sixth scroll contains the *Methods of the Six Dun of Ren and Gui, the Eight Arts of Concealment and Earthly Seclusion*. The seventh scroll contains the *Talismans of Bing and Ding Entering Fire, the Nine Crimson Striated Writ*. The eighth scroll contains the *Methods of the Six Xin Entering Metal, Attracting the Yellow Water and the Moon’s Splendor*. The ninth scroll contains the *Methods of the Six Si, the Stone Essence and the Concealment of the Golden Radiance’s Shadow to Transform Form*. The tenth scroll contains the *Eight Endowments and Ten Secrets of Zi, Wu, Mao, and You, the Sixfold Numinous Demeanor*. The eleventh scroll contains the *Secrets of the Earthly True and the Unadorned of Chen, Xu, Chou, and Wei, the Purple Writ of Longevity and the Three-Five Sequential Progression of Earth*. The twelfth scroll contains the *Purple Measure and the Blazing Radiance of Yin, Shen, Si, and Hai, the Inner Vision of the Central Realm*.\n\nWhen all twelve matters were complete, she again addressed the Emperor, saying: \"The Five Thearchs are the celestial essences of the cardinal directions. The Six Jia are the numinous conduits of the six positions. The Great Yin possesses the subtlety of latent emptiness, the divine spirit of the *Dun* that treads the mechanism of opportunity. Autumn harbors the sprouting of spring, giving birth to a thousand truths. When it moves, stillness responds in waves; when it rests, rivers and mountains settle into vast tranquility. Thus, not even the tip of a hair shifts, yet the loftiest peaks may be toppled.\n\nHow majestic is the Great Yang’s summoning of spirits, driving the ten thousand numina to swift obedience! The Six Wu take flight, and the spirits rejoice; the celestial radiance kindles brilliance in the light. To the west, lightning flashes and thunder resounds; at the Mulberry Fields, the void trembles to form thunder. This is the day of the yang spirit, when Bing’s fiery might manifests the primal authority of the Nine Heavens.\n\nThe Left Yi’s chaotic vastness is where the myriad things first communicate. As yang subtly ascends, the azure radiance responds with the coiled dragon. Light clouds waft their splendor, whispering winds stir the unborn; the divine, though faint, gathers in its abode, and the true resonance must inevitably converge. When the myriad springs return to their beginning, this is called the *Binding of Meng*.\n\nThe Right Geng’s white autumn gathers the scattered and assembles the dark. It commands the ten thousand spirits to serve me; the White Tiger stirs with boundless vigor, and the Maiden of Metal arises to commune with the true. Extending the gaze of the Nine Heavens’ paths, the metal essence and earthly numen come to guard the body. Against those who harbor malice, it is thus called the *Statute of Restraint and Slaying*.\n\nThe Six Dun of Ren and Gui sink into rootless depths, concealing the myriad blades. They traverse hills and mountains, hide in the earth, and obscure their shadows. They dam the rushing currents and block the rivers. The Eight Arts and Six Strategies ensure everlasting victory. Those who bear my Six Dun shall abide in enduring vision and eternal life.\n\nBing and Ding enter fire, soaring through the misty clouds. The Nine Crimson Dragon Writ shines with dazzling brilliance. When you employ these striated talismans, a thousand spirits will come to pay homage. Thus, the spirit of Bing revolves the cinnabar fire to disperse obstructions, and the blazing radiance ascends as a guard—marvelous beyond compare.\n\nThe Six Xin enter metal, dissolving harm and grinding away obstacles. They attract the essence of the sun to obtain the pearl of yang radiance, and seek the moon’s spirit to acquire the blossom of the Yellow Water. They can summon the numinous fungi of the Eight Stones and draw the cinnabar clouds of Fusang. They revel in the cloud nectar of the cinnabar court and soar upon the azure rivers of the Mystic River. Though their use is slight, their benefits are manifold. Those who bear these Six Xin shall surely reach my abode.\n\nThe Six Si’s stone essence flows with golden liquid radiance, transforming in myriad ways—who could withstand it for a thousand years? Those who bear my Six Si shall change form and roam freely, attaining longevity that spans the heavens without beginning or end. How profound is this writ—most essential and difficult to fathom!\n\nZi, Wu, Mao, and You are the great deities of the four quarters, standing sentinel at the cardinal boundaries. The Eight Endowments and Ten Secrets summon the descent of spirits, which must be preceded by purification and sacrifice. All affairs are accomplished through meticulous care, and the thousand spirits seek communion through this art. Know my name, and celestial beings may be summoned.\n\nChou, Chen, Wei, and Xu are the talismans of the Earthly True. Roaming the Five Marchmounts requires the Purple Writ. The secrets of the Unadorned and the arcane incantations enable one to ascend the void. Following the Three-Five sequence, you shall ride with the spirits as in the same chariot.\n\nYin, Shen, Si, and Hai can dispel flying calamities. The Purple Measure and Blazing Radiance, inner vision and reversed hearing, divine incantations that penetrate, the Six Jia that gather and restrain—earthly officials roam the heavens, treading the earth with the true. Have no doubt in this.\n\nThese twelve matters were sealed by the Thearch upon the Terrace of the Mystic Radiance. Guard them with utmost secrecy.\n\nThe Queen Mother of the West said: \"These are all the numinous writings of the Great Spirit, compiled by the Supreme Three Heavens, or edited and finalized by the Celestial Perfected of the Three Sovereigns, or revealed by the Red Youths, the True Parents of the Nine Heavens. Such talismanic texts are concealed in the Terrace of Purple Mounds, hidden within the chambers of the Numinous Altar, sealed in caskets of resplendent jade, wrapped in silk of orchid and bamboo slips, bound with plain silk of the northern weave, and stamped with the seal of the Supreme Thearch.\n\nThe various noble and numinous perfected ones descend to roam the mountains and rivers, gazing upon the forests and peaks with distant vision, observing those who study with sincerity. Some instruct them in the Dao and virtue, while others transmit to them celestial talismans.\n\nFor those who have not yet completed their study of the Dao, these writings may be transmitted to one person every forty years. If no suitable recipient exists, two may be taught at once after eighty years. Those who have attained the Dao may transmit them to one person every four hundred years. If no suitable recipient exists, two may be taught at once after eight hundred years. Those who have attained immortality may transmit them to one person every four thousand years. If no suitable recipient exists, two may be taught at once after eight thousand years. Those who have attained the True may transmit them to one person every forty thousand years. If no suitable recipient exists, two may be taught at once after eighty thousand years. Those who ascend to the Supreme may transmit them to one person every four hundred thousand years.\n\nShould they be transmitted to an unworthy recipient, this is called *leaking the Heavenly Dao*. To withhold transmission when a worthy recipient exists is called *sealing the Heavenly Treasure*. To transmit recklessly without regard for the proper limits is called *trifling with the Heavenly Elder*. To receive them without reverence is called *disdaining the Heavenly Ornament*. Leaking, sealing, trifling, and disdaining—these four are the blades and axes that bring death, the chariots that extend misfortune.\n\nThose who leak them shall die by the roadside, their bodies reduced to dust and their bones shattered. Those who seal them shall be struck blind and deaf in their next life, their fate withering and their end untimely. Those who trifle shall bring calamity upon their parents and be summoned to the Dark Capital for punishment. Those who disdain shall meet a violent end and fall into evil destinies, casting aside infirmities upon future generations.\"\n\nThose who exceed even these transgressions shall face the severing of their lineage and the annihilation of their clan.\n\nThose who share the Dao are called *Heavenly Kin*; those who share the same heart are called *Earthly Love*. Those who pursue the Dao ought to transmit with mutual affection, sharing glory and disgrace alike, tending the True Unity, treasuring their essence and vital fluids, and reverently nurturing harmonious qi. When qi is whole and spirit returns, they shall surely join the assembly of the numinous.\n\nShould they fail in this, Heaven shall send down pestilence upon them. These are the statutes and prohibitions of the Dao, and thus I now admonish you—you must not be careless.\n\nYet this method is meant to be transmitted, though it should be regulated by the proper time limits. If one is truly worthy, there is no need to wait until the limit is reached before bestowing it.\n\nIf you wish to transmit the *True Forms of the Five Peaks*, Dong Zhongshu is a fitting recipient. If you wish to impart the *Six Jia Spirit-Flight Talismans of the Left and Right*, you may transmit them to Li Shaojun. These two are those who have attained the Dao.\n\nThe Queen Mother then commanded her attendant, Song Lingbin, to retrieve another diagram for the Emperor. Lingbin reached into her robe and produced a scroll, encased in a cloud-brocade pouch, its script and form as radiant and precise as those in the earlier vessel. The Queen Mother rose and placed it into the Emperor’s hands with her own.\n\nShe then pronounced this incantation:\n*\"Heaven is high, Earth is low,\nThe Five Peaks anchor form.\nPrimordial streams surge dark,\nDeep marshes yield dark essence.\nHeaven revolves through nine paths,\nSix Harmonies sustain balance.\nThe Eight Assemblies of the Most High,\nAchieve the flight of celestial beings.\nTrue weariness, steadfast trust—\nThrough these, the numinous is reached.\nLeaked or lost, decayed or spoiled,\nYet true attainment leads to long life.\nGrasp this well and be vigilant—\nI dare to instruct you, Liu!\"*\n\nWith the incantation complete, she bestowed it upon the Emperor. The Emperor bowed, touching his forehead to the ground.\n\nQueen Mother spoke: \"Those who first study the Daoist talismans should separately offer sacrifices to the Five Peaks and the various perfected immortals, purify themselves through fasting, and then wear them. Now, with these miscellaneous matters of the Six Jia, one must observe proper regulations and coordinate accordingly—this should be clearly followed as prescribed.\n\nIf you can diligently cultivate integrity, correct your conduct, turn from evil to practice goodness, then after three years and seven months, return to inform me of your desire for the essential Dao.\"\n\nPresently, from the Vermilion Bird window south of the hall, a figure suddenly appeared, peering in at the immortal officials. The Emperor, startled, asked, \"Who is that?\"\n\nQueen Mother replied, \"Do you not recognize this person? He is your attendant, Dongfang Shuo, my neighbor’s younger brother. His nature is playful and witty, and he has come three times to steal these peaches. Long ago, this man served as an emissary of the Most High, sent to Fangzhang to assist the Three Heavens’ Registrar of Destiny in recording the affairs of the immortals. Yet when Shuo arrived at Fangzhang, he indulged only in wandering among mountains and waters, neglecting to cultivate harmonious qi. Instead, he wantonly manipulated thunder and lightning, stirred waves, and summoned winds. The winds and rains fell out of season, yin and yang clashed, causing dragons and whales to crawl on land, mountains to collapse, borders to crumble, and the sea to dry up violently. The Yellow Bird nested in the abyss, and farming suffered. Drunk on jade wine, he lost the harmony of his office and failed in his mandated duties. Thus, the Elder of the Nine Springs reported this to the Most High, who then demoted and banished him to the mortal realm, exiling him from the court of the Great Clarity to dwell in this turbid land. Recently, the two immortals of Jinhua Mountain and the Lord of Jiuyi petitioned on his behalf, seeking clemency.\"\n\nThereupon, the Emperor realized Shuo was no ordinary mortal. As the feast neared its end and the wine flowed freely, the Supreme Primordial Lady herself plucked the *Cloud Forest* zither, her fingers striking awe-inspiring melodies. The pure notes rang clear, and a profound breeze spread in all directions. She then sang the *Step of the Mysterious* aria:\n\n*\"Long ago, I trod the true Dao of the Mysterious,\nAscending on soaring steps to the Great Rosy Clouds.\nBearing the steep peaks, I reached the Gate of Heaven,\nAnd asked where the Most High’s abode might be.\nSuddenly passing the Purple Tenuity Enclosure,\nI saw perfected ones arrayed like hemp.\nGreen auroras rose in clear recitation,\nAnd numinous canopies gleamed with crimson blossoms.\nThe Orchid Palace opened its jasper gates,\nWhile azure skies unveiled their wondrous sands.\nCinnabar terraces wove empty structures,\nShimmering with radiant light.\nFlying phoenixes perched on ridgepole peaks,\nAnd the Torch Dragon coiled in sinuous repose.\nJade embryos came from scarlet sprouts,\nNine hues intertwining in profusion.\nEmbracing the light, I refined my immortal bones—\nThrough ten thousand kalpas, I remained youthful.\nWho says life must have an end?\nThe Fusang tree does not wither.\"*\n\nQueen Mother then commanded her attendant, Tian Sifei, to respond with a song:\n\n*\"At dawn, I ascend the Palace of Great Rosy Clouds,\nEmbracing these eight jade orchids.\nAt dusk, I enter the Gate of the Mysterious Origin,\nGathering herbs and plucking stalks of jasper.\nI wash my feet in the Gourd River,\nWhere the Weaving Maiden stands by the ford.\nInhaling and exhaling the auroras,\nTheir savor suffices for a single meal.\nHow majestic is the Purple Tenuity!\nIts wondrous wheels glow crimson.\nAt dawn, I depart from the Boundless Court,\nBy dusk, I lodge within the Enclosure of the Curved Array.\nGoing our separate ways, our paths diverge—\nEach must abide in what brings peace.\nThe Two Modes endure as ever,\nWhy doubt the myriad eons?\nDo not speak of this to worldly folk—\nThe walking corpses would find these words hard to bear.\"*\n\nWhen the songs concluded, she proceeded to inform Emperor Wu of the names of the immortals’ attendants, as well as the names of their headdresses, sashes, and ritual implements—so that he might record them.\n\nAt daybreak, Queen Mother took her leave. The Supreme Primordial Lady then said to the Emperor, \"As for Li Shaojun, he is wholly devoted to diligent cultivation, his principles subtle and profound—he is certain to attain the Dao. However, he seems not yet to possess the *Six Jia Numinous Flight* texts. You should present them to him.\"\n\nThe Emperor replied, \"Very well.\"\n\nThen the Lady and the Queen Mother departed together in the same carriage. As they set off, their retinue of men and horses, dragons and tigers, and their majestic procession were just as they had been upon arrival. Clouds billowed and swirled, transforming entirely into fragrant mist; gazing southwest, the sight lingered long before fading away.\n\nAfter witnessing the Queen Mother and the Supreme Primordial Lady, the Emperor came to believe that divine immortals indeed existed in the world, and he began to consider plans for leaving the mortal realm. Yet he remained indulgent in sensual pleasures, unrestrained in his nature, and ceaseless in warfare. The people groaned under the burden of labor, and the dead lamented their unjust fates.\n\nThat year, he constructed the Gansui Palace and the Tower of Communion with Heaven, as well as the Lianlian Lodge in Chang’an. The King of Chaoxian attacked the eastern commandery of Liaodong, prompting the Emperor to recruit condemned criminals from across the land to strike back. In the eighth month, nine stalks of grain sprouted within the Gansui Palace. He issued an edict: *\"Nine stalks of grain with conjoined leaves have grown in the Gansui Palace—Heaven’s vast presence descends no differently than in a humble chamber. The August One bestows upon me great favor; let there be a general amnesty throughout the land. Grant the households of Yunyang a hundred oxen and wine, and compose the Song of the Grain Chamber.\"*\n\nBy the third year of the *Yuanfeng* era, he had assembled three hundred performers for the *Jiaodi* games. In the fourth year of *Yuanfeng*, he again journeyed to Yong to offer sacrifices to the Five Sacrificial Altars.\n\nBy the fifth year of *Yuanfeng*, he conducted an inner tour of the ancestral temples, proceeding to the Shengtang Shrine to sacrifice to Yu Shun and ascending Mount Wan at Jiuyi and Mount Tianzhu. In the third month of spring, he returned to Mount Tai, expanding its sacred enclosure on the *jiazi* day. He sacrificed to his august ancestor Gaozu in the Hall of Light, offering him as associate to the Supreme God. There he received the feudal lords and kings in audience.\n\nIn the sixth year of *Yuanfeng*, he journeyed to Huizhong and constructed the Shoushan Palace. In the third month, he traveled to the region east of the Yellow River to sacrifice to the Earth Queen. Earlier, on the seventh day of the seventh month in the second year of *Yuanfeng*, the Queen Mother of the West and the Upper Prime Lady descended before Emperor Wu. The Queen Mother bestowed upon him the *True Forms of the Five Peaks* and the *Scripture of Radiant Life*, while the Upper Prime Lady conferred the *Twelve Arts of the Numinous Flight of the Six Jia Spirits*. On the day the Queen Mother and Upper Prime Lady appeared to the Emperor, they expounded at length—now the secrets of prolonging life, now the methods of summoning divine spirits, now the techniques of riding the void, now the arts of treading the mysterious. Of all these essential and wondrous teachings, the Emperor compiled a single scroll. Together with the *True Form Scriptures* and the *Six Jia Numinous Flight* texts he had received, he placed them in a casket of yellow gold, sealed in a case of white jade, its rollers of coral, its wrapping of purple brocade. He enshrined it atop the Wuliang Terrace, where he would fast and purify himself, donning ceremonial robes to approach it in reverence, burning incense and rinsing his hands before unsealing and perusing the texts.\n\nFrom the time he first received the scriptures, six years passed, and his mind grew ever more at ease, his lofty aspirations ever more assured. He believed that the divine immortals had truly descended and that he would surely transcend the mortal world. Yet his vigor and strength remained untempered by utmost sincerity. He erected palaces and towers, exhausting the people; buried surrendered soldiers alive; launched distant campaigns against the barbarians. The roads swelled with lamentation, the frontier fortresses flowed with blood. In every matter, he spurned the profound admonitions of the Queen Mother and the subtle exhortations of the Upper Prime Lady. Thus the Queen Mother never came again.\n\nIn the eleventh month of the first year of *Taichu*, on the *yiyou* day, heavenly fire consumed the Terrace of the Soaring Beam. Therein, the *True Form Charts*—four scrolls in all—were lost to the flames. The Queen Mother had once warned Emperor Wu that he would fail to heed her teachings, and so she brought this conflagration upon him. Yet earlier, following the Queen Mother’s instructions, the Emperor had fasted in the seventh month of the third year of *Yuanfeng* and transmitted the *True Forms of the Five Peaks* to Dong Zhongshu, who ascended to receive it. And following the Upper Prime Lady’s words, he had fasted in the seventh month of the fourth year of *Yuanfeng* and transmitted the *Twelve Arts of the Numinous Flight of the Five Emperors and Six Jia Spirits* to Li Shaojun, who ascended to copy and receive it. These texts that survive and circulate in the world were first preserved through these two men.\n\nAfter losing the scriptures, the Emperor repented his failure to cultivate virtue, realizing that his Dao had been forfeit. Later, Dongfang Shuo one day mounted a cloud-dragon and soared away. Many witnessed him ascending toward the northwest; when they looked up again, a great mist had enveloped him, and he was nowhere to be seen. The Emperor grew ever more remorseful. That year, he performed the Feng sacrifice at Mount Song and the Shan sacrifice at Mount Hua, then journeyed east to the shores of the Bohai Sea, gazing toward Penglai. Facing heaven, he swore an oath, yearning for a divine response—but none came. In spring, he returned to receive the annual accounts at Gansui. In the second month, he began construction of the Jianzhang Palace.\n\nIn the fifth month of summer, the calendar was reformed, establishing the first month as the beginning of the year. The color yellow was esteemed, the number five was employed, and official titles were harmonized with the pitches of the *lü* and *lǚ*. This originated from the Queen Mother of the West’s intent.\n\nIn the third month of the second year of the *Taichu* era, the Emperor journeyed east to the banks of the Yellow River and performed the sacrifice to the Earth. In the first month of the third year of *Taichu*, he traveled east to inspect the seacoast. In the fourth month of summer, he returned and carried out the Feng sacrifice at Mount Tai. In the fourth year of *Taichu*, construction began on the Minguang Palace, and the reign title was changed to *Tianhan*.\n\nIn the first month of the first year of *Tianhan*, he journeyed east to the banks of the Yellow River and performed the sacrifice to the Earth. In the spring of the second year of *Tianhan*, he traveled to the Eastern Sea. Upon his return, he visited Huizhong. In the third month, he journeyed to Mount Tai, performed the Feng sacrifice, and offered rites in the Hall of Light.\n\nIn the fifth month of the third year of the *Taishi* era, he traveled to the Eastern Sea, where the mountains resounded with cries of \"Long live the Emperor!\" In winter, he bestowed five thousand coins upon each household along his route, and a bolt of silk upon every widow, orphan, and solitary elder.\n\nIn the third month of the fourth year of *Taishi*, he journeyed to Mount Tai and offered sacrifices to the Queen Mother of the West, seeking a divine response. In the spring of the fourth year of *Zhenghe*, he traveled to Donglai, approached the great sea, purified himself in fasting, and worshipped the Queen Mother of the West and the Lady of the Highest Prime, yet no response came. Upon his return, he journeyed to Mount Tai and performed the Feng sacrifice. On the *gengyin* day, he offered rites in the Hall of Light and changed the reign title to *Houyuan*.\n\nIn the first month of the first year of *Houyuan*, he journeyed to the Gansui Palace to emulate the rites of the ancient Xia. In the seventh month of autumn, an earthquake struck, and springs gushed forth. In the second year, he summoned the feudal lords to the Gansui Palace and bestowed gifts upon the imperial clan. In the second month, the Emperor fell ill and traveled to the Wuzuo Palace in Zhulu. On the *dingmao* day, the Emperor passed away and was laid in state in the front hall of the Weiyang Palace. In the third month, he was interred at Maoling.\n\nOn the evening of the burial, the Emperor’s coffin stirred of its own accord, and sounds were heard outside the palace—this occurred several times. An extraordinary fragrance also filled the air. After the burial was complete, the tomb mound was enveloped in a thick mist, and the gates collapsed; the mist persisted for over a month.\n\nWithin the Emperor’s tomb, there had originally been a jade box and a jade staff, two items he had treasured and used. Suddenly, they appeared in the world of men. Those who saw them recognized their significance and reported it to the authorities. The officials questioned the seller, who turned out to be a merchant. He had come from beyond the pass to the Luoyang market, where he encountered a man in the northern carriage lane selling the two items. The price was thirty bolts of plain silk and ninety thousand coins, and he purchased them. The merchant truly did not know the name of the seller of the box and staff. He had arrived in the Luoyang market the previous day and seen the items being sold. The facts matched his account, and the officials reported them. The two items were recorded and entered into the imperial registry, and the merchant was released without further inquiry.\n\nBefore the Emperor’s passing, he had issued a prior decree that over forty scrolls of miscellaneous texts—those he had often read and cherished—should be placed in his coffin to accompany him in burial. In the second year of the *Yankang* era, Li You, a clerk in the Hedong commandery, entered Mount Baodu in Shangdang to gather herbs. Within a secluded chamber, he discovered the buried texts, stored in a golden box. On the back of the scrolls were inscribed the names of the Eastern Observatory officials and the dates of their transcription.\n\nAmong Emperor Wu’s attendants had been a scribe named Ran Deng. Upon seeing the texts and the box, he wept and said, \"These are the very items placed in the late Emperor’s coffin at his burial. I personally arranged them within—how they came to be here, I cannot fathom.\" Emperor Xuan was deeply moved and astonished. The texts were returned to the shrine of Emperor Wu.\n\nMaoling remained intact as before, yet the book box and jade staff had suddenly emerged from beneath the earth. Moreover, the items appeared fresh and unblemished, without a speck of dust. Those who witnessed this were greatly perplexed and could not explain it.\n\nAccording to the *Scripture of the Nine Capitals and Dragon Perfections*, those who attain the lower ranks of immortality must first die, pass through the Great Yin to refine their corpses, and traverse the Earth’s Gate before achieving liberation through corpse-transformation.\n\nNow, Emperor Wu’s box, staff, and miscellaneous texts were all interred with him in his coffin, yet they emerged inexplicably from the void—his staff sold in the marketplace, his books discovered in a mountain chamber. If this were not the work of subtle and wondrous divine transformation, how could such things occur? Thus, it remains uncertain whether Emperor Wu truly died; he may well have undergone a numinous transformation in accordance with the cosmic rhythm.\n\nWhen Wang Mang usurped the throne and reached the second year of the *Dihuang* era, he dispatched envoys to perform sacrifices at the Han imperial tombs, invoking auspicious omens. Upon arriving at Maoling, the envoys heard four great sighs and long groans rising from beneath the earth. Terrified, they reported this to Wang Mang, who remarked, “Emperor Wu must resent the lateness of my sacrifices.” He then ordered an additional grand offering of the highest ritual.\n\n**Inventory of Buried Texts:**\n- *Scripture of Laozi*: 2 scrolls\n- *Supreme Purple Writ*: 13 scrolls\n- *Scripture of Numinous Elegance*: 6 scrolls\n- *Scripture of the Central Womb of Primordial Simplicity*: 6 scrolls\n- *Scripture of the Heavenly Pillar*: 9 scrolls\n- *Six Dragons’ Steps to the Mysterious Writ*: 7 scrolls\n- *Ma Huang’s Arts of Receiving Perfection*: 4 scrolls\n\nHere ends *The Esoteric Records of Emperor Wu of Han*.\n\n**Variant Collations from the *Shoushan Pavilion Collectanea* (Zibu, Qian Xizuo’s Collated Edition, hereafter \"Qian Edition\") and the *Complete Library of the Four Treasuries* Edition (hereafter \"*Siku* Edition):**\n\n1. Both the Qian Edition and *Siku* Edition include the characters \"正月\" (\"first month\") before \"甲子\" (\"jiazi day\").\n2. The character \"祭\" (\"sacrifice\") is written as \"登\" (\"ascend\") in the *Siku* Edition.\n3. The character \"神\" (\"divine\") is written as \"道\" (\"Dao\") in the *Siku* Edition.\n4. The character \"向\" (\"toward\") is written as \"乃\" (\"then\") in the *Siku* Edition.\n5. The character \"尊\" (\"honored\") appears as \"禄\" (\"emolument\") in both the Qian and *Siku* Editions.\n6. The Qian Edition includes the character \"玉\" (\"jade\") before \"女\" (\"woman\").\n7. The character \"酌\" (\"pour\") is supplied from the Qian Edition.\n8. The *Siku* Edition includes the character \"见\" (\"see\") after \"忽\" (\"suddenly\").\n9. The character \"遥\" (\"afar\") appears as \"径\" (\"directly\") in both the Qian and *Siku* Editions.\n10. The five characters following \"闻\" (\"heard\") are supplied from the Qian Edition.\n11. The character \"科\" (\"carriage\") appears as \"轩\" (\"chariot\") in the Qian Edition.\n12. The Qian Edition includes the sentence \"或乘天马\" (\"or ride celestial steeds\") after \"或乘科车\" (\"or ride ritual carriages\").\n13. The character \"知\" (\"know\") is supplied from the Qian and *Siku* Editions.\n14. The character \"佩\" (\"wear\") is supplied from the Qian Edition.\n15. This sentence appears as \"戴天真之冠\" (\"wear the crown of celestial perfected\") in the Qian Edition.\n16. This sentence appears as \"腰佩分景之剑\" (\"gird the sword that divides light\") in the *Siku* Edition.\n17. The character \"庵\" (\"hut\") appears as \"掩\" (\"conceal\") in the Qian Edition.\n18. The character \"云\" (\"cloud\") appears as \"容\" (\"countenance\") in the Qian Edition.\n19. The character \"甘\" (\"sweet\") appears as \"香\" (\"fragrant\") in the Qian Edition.\n20. The character \"圆\" (\"round\") is supplied from the Qian and *Siku* Editions.\n21. The character \"桩\" (\"stake\") appears as \"输\" (\"convey\") in the Qian Edition.\n22. The Qian Edition includes the character \"非\" (\"not\") before \"下\" (\"descend\").\n23. This sentence appears as \"九年易形，形易则变化\" (\"after nine years, the form transforms; once transformed, it changes\") in the Qian Edition.\n24. The Qian Edition reads \"所说微言\" (\"the subtle words spoken\") instead of \"微言所说\" (\"the subtle words that speak of\").\n25. The character \"循\" (\"follow\") appears as \"修\" (\"cultivate\") in the Qian Edition.\n26. The Qian Edition includes the characters \"下席\" (\"descend from the mat\") after \"帝\" (\"thearch\").\n27. The character \"见\" (\"see\") is supplied from the Qian Edition.\n28. The character \"谓\" (\"call\") appears as \"为\" (\"as\") in the Qian Edition.\n29. The character \"俄\" (\"suddenly\") originally appeared as \"仍\" (\"still\") and was emended according to the Qian Edition.\n30. The Qian Edition omits the character \"相\" (\"mutually\").\n31. The phrase \"情系\" (\"emotions bound\") originally appeared as \"系系\" (\"bound bound\") and was emended according to the Qian and *Siku* Editions.\n32. The Qian Edition omits the character \"使\" (\"cause\").\n33. The Qian Edition includes the characters \"真皇之母\" (\"Mother of the Perfected Thearch\") after \"三天\" (\"Three Heavens\").\n34. The character \"年\" (\"year\") is supplied from the Qian Edition.\n35. The Qian Edition includes the character \"拜\" (\"bow\") after \"帝\" (\"thearch\").\n36. The phrase \"振根\" (\"shake the roots\") originally appeared as only these two characters and was completed according to the Qian and *Siku* Editions.\n37. The character \"魂\" (\"soul\") was emended to \"魄\" (\"spirit\") in the Qian Edition.\n38. The character \"怨\" (\"resentment\") was emended to \"冤\" (\"grievance\") in the Qian Edition.\n39. The character \"翼\" (\"assist\") originally appeared as \"异\" (\"strange\") and was emended according to the Qian Edition.\n40. The character \"屈\" (\"yield\") is supplied from the Qian Edition.\n41. The character \"志\" (\"will\") originally appeared as \"至\" (\"utmost\") and was emended according to the Qian and *Siku* Editions.\n42. The Qian Edition includes the character \"否\" (\"no\") after \"钙\" (\"calcium?\").\n43. The Qian Edition includes the character \"今\" (\"now\") before \"当\" (\"should\").\n44. The character \"其\" (\"its\") is supplied from the Qian Edition.\n45. These two sentences appear as \"立天柱而安于地理\" (\"erect the pillar of heaven and settle the earth’s principles\") in the Qian Edition.\n46. The character \"灵\" (\"numinous\") appears as \"陵\" (\"tomb\") in the *Siku* Edition.\n47. The character \"尊\" (\"honor\") originally appeared as \"遵\" (\"follow\") and was emended according to the Qian Edition.\n48. The character \"考\" (\"examine\") appears as \"及\" (\"reach\") in the Qian Edition.\n49. The character \"摄\" (\"grasp\") originally appeared as \"撮\" (\"gather\") and was emended according to the Qian Edition.\n50. The Qian Edition omits the character \"当\" (\"should\").\n51. The Qian Edition omits the character \"今\" (\"now\").\n52. The character \"童\" (\"youth\") originally appeared as \"立\" (\"stand\") and was emended according to the Qian Edition.\n53. The text from \"灵\" (\"numinous\") to \"此\" (\"this\") is supplied from the Qian Edition.\n54. The character \"向\" (\"toward\") originally appeared as \"问\" (\"ask\") and was emended according to the Qian Edition.\n55. The Qian Edition includes the characters \"谨受命矣，但\" (\"I reverently receive the command, but\") before \"阿\" (\"Ah\").\n56. The character \"授\" (\"confer\") appears as \"受\" (\"receive\") in the Qian Edition.\n57. The character \"奉\" (\"offer\") appears as \"捧\" (\"hold\") in the Qian Edition.\n58. The Qian Edition includes the characters \"以出六甲之文\" (\"to reveal the writ of the Six Jia\") after \"蕴\" (\"conceal\").\n59. The Qian Edition includes the characters \"比来\" (\"recently\") after \"居\" (\"reside\").\n60. The four characters \"欲授刘彻\" (\"wishing to confer upon Liu Che\") are supplied from the Qian Edition.\n61. The two characters \"信曰\" (\"Xin said\") are supplied from the Qian Edition.\n62. The character \"奢\" (\"extravagant\") appears as \"烦\" (\"troublesome\") in the Qian Edition.\n63. These two sentences appear as \"违犯泄漏，祸必族倾。反是天真，必沉幽冥\" (\"If violated or leaked, calamity will surely destroy the clan. Conversely, if the celestial perfected are followed, one will sink into dark obscurity\") in the Qian Edition.\n64. This sentence appears as \"尔其慎祸\" (\"You must beware of disaster\") in the Qian Edition.\n65. The phrase \"一不帝\" (\"once not thearch\") appears as \"以示帝焉\" (\"to show the thearch\") in the Qian Edition.\n66. The character \"摄\" (\"grasp\") originally appeared as \"撮\" (\"gather\") and was emended according to the Qian Edition.\n67. The Qian Edition includes the character \"者\" (\"one who\") after \"甲\" (\"jia\").\n68. The Qian Edition omits the character \"之\" (\"of\").\n69. The character \"复\" (\"again\") appears as \"后\" (\"afterward\") in the Qian Edition.\n70. The phrase \"太上使\" (\"the Most High sent\") appears as \"太上仙宫，太上\" (\"the Most High’s immortal palace, the Most High\") in the Qian Edition.\n\n71. The phrase \"Fangzhang\" appears as \"Mount Fangzhang\" in the Qian Edition.\n72. The phrase \"Queen Mother\" appears as \"Two Perfected\" in the Qian Edition.\n73. The date \"yiyou\" originally appeared as \"yichou\" and was emended according to the Qian Edition.\n74. After \"Chart of the True Form,\" the Qian Edition includes the following text: \"Record of the Six Jia and Five Thearchs’ *Lingfei Jing*, the *Twelve Affairs of the* *Lingguang Sheng Jing*, and other works personally transmitted.\"\n75. The character \"chang\" appears as \"dang\" in the Qian Edition.\n76. The phrase \"to the northwest, gazing upward again\" appears as \"slowly ascending to the northwest, gazing upward for a long while\" in the Qian Edition.\n77. From \"These two objects\" to \"reported to the authorities,\" the Qian Edition reads: \"These were tribute from the Kangju king of the Western Hu. Thearch cherished them greatly, so they were placed in his coffin. Four years later, someone purchased these two objects in the market of Fufeng. A poet among the Thearch’s attendants recognized them as treasures once beloved by the late emperor and reported the matter to the authorities.\"\n78. The reign title \"Yankang\" appears as \"Yuankang\" in the Qian Edition.\n79. Below this sentence, the Qian Edition includes the following text: \"This occurred during the reign of Emperor Wu. Zhang Chun, the governor of Hedong, submitted them in a sutra case. Thearch inquired...\"\n80. The Qian Edition omits the character \"liao.\"",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "汉武帝内传 经名：汉武帝内传。 一卷。 底本出处：《正统道藏》洞真部记传类。 参校本：《守山阁丛书》钱熙祚校勘本、《四库全书》本。 汉武帝内传 孝武皇帝好长生之术，常祭名山大泽，以求神仙。 元封元年甲子#1，祭#2嵩山，起神#3官，帝齐七日，祠讫乃还。 至四月戊辰，帝夜闲居承华殿，束方朔、董仲舒侍，忽见一女子，着青衣，美丽非常。 帝愕然问之，女对曰：我塘宫玉女王子登也，向#4为王母所使，从昆山来。 昆山，昆仑山也。 语帝曰：闻子轻四海之尊#5，寻道求生，降帝王之位而屡梼山岳。 勤哉，有似可教者也。 从今百日清齐，不闲人事。 不治也。 至七月七日，王母暂来也。 帝下席跪诺。 言讫，女#6忽然不知所在。 帝问束方朔：此何人？ 朔曰：是西王母紫兰室玉女，常传使命，往来搏桑，出入灵州，交关常阳，传言玄都。 阿母昔以出配北烛仙人，近又召还，使领命录，真灵官也。 帝於是登延灵之台，盛齐存道，其四方之事权委於冢宰焉。 至七月七日，乃修除宫掖之内，设座殿上，以紫罗荐地，墦百和之香，张云锦之帐，然九光之灯，设玉门之枣，酌#7蒲桃之酒，躬监肴物，为天官之饥。 帝乃盛服立于陛下，敕端门之内不得妄有窥者。 内外寂谧静肃也，以俟云驾。 至二唱之后，即二更也。 忽#8天西南如白云起，郁然直来，遥#9趋宫庭，问须臾，转近，闻#10云中有箫鼓之声、人马之响。 复半食顷，王母至也。 县投殿前，有似乌集。 或驾龙虎，或一桀音乘狮子，或御白虎，或骑白磨音麟、或控白鹤，或乘科#11车#12，草仙数万，光耀庭宇。 既至，从官不复知#13所在，唯见王母一桀紫云之辇，驾九色斑龙，别有五十天仙侧近鸾舆，皆身长一丈,同执彩毛之节,，佩#14金刚灵茧，带天策#15，咸住殿前，王母唯扶二侍女上殿。 侍女年可十六七，服青绫之桂古兮切，倨也，上服。 容眸流陌莫见切，裹视也，作盼非，神姿清发，真美人也。 王母上殿，束向坐，着黄锦拾嘱，上夹下蜀，无絮长懦也。 文采鲜明，光仪淑穆，带灵飞大绶，腰分头之剑#16，头上大华结，上花下髻戴太真晨婴之冠，履玄谲凤文之乌，豚之可年卅许，修短得中，天姿庵#17霭，云#18颜绝世，真灵人也。 下车登林，帝拜跪，问寒温，毕，立如也。 因呼帝共坐。 帝南面向王母。 母自设膳，膳精非常，丰珍之肴，芳华百果，紫芝萎羹华盛貌，纷若填棵上音田，下立曰螺。 清香之酒，非地上所有，甘#19气殊绝，帝不能名也。 又命侍女索桃，须臾以銮盛桃七枚，大如鸭子，形圆#20色青，以呈王母。 母以四枚与帝，自食三桃。 桃之甘美，口有盈味。 帝食辄录核。 录，留也。 母日：何谓？ 帝日：欲种之耳。 母曰：此桃三千岁一生实耳。 中夏地薄，种之不生，如何？ 帝乃止。",
      "translated_text": "*The Inner Transmission of Emperor Wu of Han*\n*Text Title: The Inner Transmission of Emperor Wu of Han*\n*One fascicle. Base text from:* The Orthodox Daoist Canon*, \"Records and Biographies\" section of the* Dongzhen *department. Collated with:* Shoushan'ge Congshu *edition (annotated by Qian Xizuo) and the* Siku Quanshu *edition.*\n\nEmperor Xiaowu was fond of the arts of longevity and frequently offered sacrifices at famous mountains and great marshes in search of divine immortals. In the first year of the Yuanfeng reign, on the jiazi day, he sacrificed at Mount Song, establishing a divine palace. The Emperor fasted for seven days, and upon completing the rites, he returned.\n\nOn the wuchen day of the fourth month, as the Emperor leisurely resided in the Chenghua Palace at night, Dongfang Shuo and Dong Zhongshu attended him. Suddenly, a woman appeared, dressed in azure robes, of extraordinary beauty. Startled, the Emperor asked her who she was. The woman replied, \"I am Wang Zideng, the Jade Maiden of the Tang Palace, sent by the Queen Mother of the West from Kun Mountain.\" (Kun Mountain is Kunlun Mountain.) She said to the Emperor, \"I have heard that you, though revered across the Four Seas, seek the Dao and long for life, descending from the throne of emperors to repeatedly pray at mountains and peaks. How diligent! You seem one who may be taught. From now, purify and fast for a hundred days, abstaining from worldly affairs. Do not govern. On the seventh day of the seventh month, the Queen Mother will briefly visit.\"\n\nThe Emperor descended from his seat and knelt in assent. As soon as she finished speaking, the woman suddenly vanished. The Emperor asked Dongfang Shuo, \"Who was this?\" Shuo replied, \"She is a Jade Maiden of the Purple Orchid Chamber of the Queen Mother of the West, who often conveys decrees, traveling to Fusang, entering Lingzhou, passing through Changyang, and transmitting messages to the Mystic Capital. The Queen Mother was once betrothed to the Immortal of the Northern Candle, but was recently recalled to oversee decrees and records—a true divine official.\"\n\nThereupon, the Emperor ascended the Terrace of Extending Spirits, devoting himself to fasting and cultivating the Dao, entrusting the affairs of the four directions to his chief minister. By the seventh day of the seventh month, he had cleansed the inner palace, prepared a seat in the hall, spread purple silk upon the ground, burned incense of a hundred harmonies, hung cloud-patterned brocade curtains, lit lamps of ninefold radiance, set out jujubes from the Jade Gate, poured grape wine, and personally oversaw the dishes, preparing a celestial feast.\n\nThe Emperor, clad in his finest robes, stood below the steps, commanding that no one within the main gate dare to peek. Inside and out, all was silent and solemn as they awaited the cloud-borne carriage. After the second watch, suddenly the southwest sky stirred as if white clouds arose, swelling and approaching directly toward the palace. In an instant, it drew near, and from within the clouds came the sounds of flutes and drums, the clamor of men and horses. After half a meal’s time, the Queen Mother arrived. Her descent before the hall resembled a flock of crows alighting. Some rode dragons and tigers, others a single *jie* astride lions, or mounted white tigers, or rode white *lin* unicorns, or guided white cranes, or drove *ke* carriages. Tens of thousands of immortals illuminated the courtyard with their brilliance.\n\nOnce they arrived, her attendants could no longer be seen; only the Queen Mother remained, seated in a *jie* carriage of purple clouds, drawn by nine multicolored striped dragons. Beside her were fifty celestial immortals, each a *zhang* tall, all bearing feathered staves and wearing golden adamantine sashes, girded with celestial tallies. They all halted before the hall, while the Queen Mother, supported by two handmaidens, ascended the steps.\n\nThe handmaidens appeared to be sixteen or seventeen years old, dressed in azure silk robes with trailing sashes. Their eyes sparkled with radiant glances, their bearing elegant and luminous—true beauties. The Queen Mother, facing east, took her seat. She wore a yellow brocade robe with a high collar and wide sleeves, its embroidery resplendent, her demeanor serene and majestic. A great sash of *lingfei* hung from her waist, and she bore the Sword of Parting the Head. Upon her head was a grand floral knot, crowned with the *Tai Zhen Chen Ying* coronet. Her shoes were black, embroidered with phoenix patterns. Though she appeared to be thirty, her stature was perfectly proportioned, her celestial grace misty and ethereal, her countenance unmatched in the world—a true divine being.\n\nAs she alighted from her carriage and ascended the steps, the Emperor bowed and knelt, inquiring after her well-being. Once finished, he stood as before. She then summoned the Emperor to sit beside her. The Emperor faced south toward the Queen Mother.\n\nThe Queen Mother personally arranged the feast, which was of extraordinary refinement: sumptuous delicacies, fragrant fruits of a hundred kinds, purple mushrooms in rich broth, and dishes so abundant they seemed to fill the hall. The wine was of celestial fragrance, unlike anything on earth, its sweet aroma unparalleled. The Emperor could not name it. She then commanded her handmaidens to fetch peaches. In a moment, they presented seven peaches in a *luan* vessel, each as large as a duck’s egg, round and green in hue. The Queen Mother offered four to the Emperor and ate three herself. The peaches were so sweet and delicious that their flavor lingered in the mouth.\n\nThe Emperor ate them and kept the pits. (Keeping, that is, preserving them.) The Queen Mother asked, \"Why?\" The Emperor replied, \"I wish to plant them.\" The Queen Mother said, \"These peaches bear fruit but once every three thousand years. The soil of the Central Land is too poor; they will not grow. How can this be?\" The Emperor then desisted.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1081,
      "start_sentence": 0,
      "end_sentence": 49,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.51757550239563,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\汉武帝内传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "於坐上酒觞数过，王母乃命侍女王子登弹八琅之傲，又命侍女董双成吹云稣之笙，又命侍女石公子击昆庭之钟，又命侍女许飞琼鼓震灵之簧，侍女阮灵华扮五灵之石，村，循也。 石，如呜球之类也。 侍女范成君击洞庭之磬，侍女段安香作九天之钧。 於是众声彻朗，灵音骇空。 又命侍女安法婴歌玄灵之曲，其词曰：大象虽寥廓，我把天地户。 披云沉灵舆，鲦忽适下土。 空洞成玄音，至灵不容冶。 太真嘘中唱，始知风尘苦。 颐神三田中，纳精六阙下。 遂乘万龙桩#21，驰骋陌九野。 二曲日：玄圃遏北台，五城嵯峨。 启彼无涯津，泛此织女河。 仰上升绛庭，下游月窟阿。 顾陌八落外，指招九云遐。 忽已不觉劳，岂寤少与多。 抚傲命众女，咏发感中和。 妙畅自然乐，为此玄云歌。 韶尽至韵存，真音辞无邪。 歌毕，帝乃下地叩头，自陈日：彻武帝自称名受质不才，沉沦流俗。 承禅先业，遂羁世累。 政事多阙，兆民不和，风雨失节，五谷无－实，德泽不建，寇盗四海，黔首劳毙，户口灭半，当非其主，积皋丘山。 然少好道，仰慕灵仙，未能弃禄委荣，栖迹山林，思绝尘饵，罔知攸向。 且舍世寻真，钻启无师，岁月见及，但虑奄忽。 不图天颜顿集今日，下臣有幸，得瞻上圣。 是臣宿命合得度世，愿垂哀怜，赐诸不悟，得以奉承切己之教。 王母日：女音汝，后同。 能贱荣乐卑，耽虚味道，自复佳耳。 然女情恣体欲，淫乱过甚，杀伐非法，奢侈其性。 恣则裂身之车，淫为破年之斧，杀则响对，奢则心烂，欲则神陨，聚秽命断。 以子蕞在会切尔之身，而宅灭形之残，盈尺之材，攻以百仞之害，欲此解脱三尸，全身永久，难可得也。 有似无翅之鹭，愿鼓翼天池，朝生之虫，而乐春秋者哉。 若能荡此众乱，拨秽易韵，保神黑於绛府，闭淫宫而开悟，静奢侈於寂室，爱众生而不危，守兹道戒，思乎灵味，务施惠和，练惜精气，弃却浮丽，令百竞速游。 女行若斯之事，将岂无彷佛也？ 如其不尔，无为抱石而济长津矣。 帝跪受圣戒，请事斯语。 养身之要，既闻之矣，然体非玉石，而无主於但，黑非四时，而常生於内。 政当率御出入，呼吸中适，和液得循，形神靡错，黑既随宜，则魂魄不滞，若使理合其分，黑甄居延切，察也其适，则形可不枯，宅可不废。 昔受道书，具以施业之矣，遂不获真验，未为巨益，使精神疲於往来，津液劳於出入，岁臧其始，月亏其昔，形亦渐凋，神亦废落，是彻不得所奉於口诀，开间塞於明堂尔。 不审服御可以永久者，吐纳可以延年者，乞赐长生之术，暂悟於行尸之身。 若蒙圣诰於即日，臣伏听丽天之教矣。 王母曰：昔先师元始天王时及闲居，登於蘗霄之台，侍者天皇搏桑大帝君及九真诸王、十方众神仙官，爰延弟子丹房之内，说玄微之言，因问我何为而欲索长存矣。 吾因避席叩头，请问长生之术。 天王登见，遗以要言，辞深旨幽，实天人之玄观，上帝之奇秘，女今日愿闻之乎？ 帝跪曰：彻小丑贱生，枯骨之余，敢以不肖之躯，而慕龙凤之年，欲以朝花之质，希晦朔之期，虽乐远流，莫知以济。 涂路坚塞，所要无寄，常恐一旦死於钻仰之难，取笑於世俗之夫。 岂图今日遭遇光会，一睹圣姿，而精神飞扬，恍惚大梦。",
      "translated_text": "As the wine cups passed several times around the gathering, the Queen Mother then commanded her handmaiden Wang Zideng to pluck the *balang* zither, and her handmaiden Dong Shuangcheng to play the *yunsu* reed pipe. She further ordered her handmaiden Shi Gongzi to strike the bronze bells of Kunting, her handmaiden Xu Feiqiong to sound the *zhenling* reed organ, and her handmaiden Ruan Linghua to arrange the five *ling* stones—*cun* here meaning \"to arrange,\" and the stones resembling jade chimes. Her handmaiden Fan Chengjun was bidden to strike the *qing* of Dongting, while her handmaiden Duan Anxiang performed the *jiutian* zither. Thus, the myriad sounds rang clear and resonant, their divine music startling the heavens.\n\nThen the Queen Mother commanded her handmaiden An Faying to sing the *Xuanling* hymn, its lyrics as follows:\n\n*\"Though the Great Image be vast and boundless,\nI hold the gate of heaven and earth.\nParting the clouds, I descend in my spirit chariot,\nSwiftly arriving in the lower realm.\nThe void forms a mysterious sound,\nThe utmost spirit brooks no refinement.\nThe Supreme Perfected exhales a chant,\nOnly then do I know the bitterness of the dusty world.\nNurture the spirit in the Three Fields,\nAbsorb essence beneath the Six Palaces.\nThen ride the myriad dragons’ posts,\nGalloping through the nine wilds.\"*\n\nThe second verse:\n\n*\"The Dark Garden halts at the Northern Terrace,\nThe Five Cities stand towering.\nI open the boundless ford,\nCrossing the Weaving Maid’s River.\nAbove, I ascend the crimson court,\nBelow, I wander the moon’s hidden vale.\nGazing beyond the eight wastes,\nI beckon the nine clouds afar.\nSuddenly, weariness is unfelt,\nHow could I reckon little or much?\nI command the assembled maidens,\nSinging to stir harmonious resonance.\nExquisite joy flows naturally,\nThus I sing this hymn of the dark clouds.\nThe music fades, yet the melody lingers,\nThe true sound is free of all impurity.\"*\n\nWhen the song ended, the Emperor descended from his seat and kowtowed, declaring: \"I, Liu Che, unworthy and untalented, have long been mired in the mundane world. Inheriting the legacy of my ancestors, I am shackled by worldly burdens. My governance is flawed, the people disunited; wind and rain fall unseasonably, the five grains bear no fruit. Virtue and grace remain unestablished, bandits plague the four seas, the black-haired people toil to exhaustion, and households have dwindled by half. As an unfit ruler, my failures mount like mountains. Yet from youth I have loved the Dao, yearning for the immortals. I could not abandon rank and renown to dwell in the mountains and forests, nor sever worldly attachments to know where to turn. Forsaking the world to seek truth, I drilled and probed without a teacher. The years and months have worn on, and I fear my time is fleeting. Never did I imagine that today your celestial countenance would descend, granting this humble servant the fortune to behold your sacred presence. This must be my destined fate to attain transcendence. I beg your compassion, that you bestow upon me what I have failed to comprehend, and allow me to receive your personal teachings.\"\n\nThe Queen Mother replied: \"You—hereafter the same—have scorned glory and pleasure, delighting in emptiness and savoring the Dao; this is indeed excellent. Yet you indulge your desires, your excesses and licentiousness run rampant, your killings are unlawful, and your nature is steeped in extravagance. Indulgence is the chariot that rends the body, lust the axe that shatters the years. Killing invites retribution, extravagance rots the heart, desire topples the spirit, and filth severs fate. With a body as fragile as yours, housing a ruined form, a mere foot of timber assailed by a hundred *ren* of harm—how can you hope to shed the Three Corpses, preserve your body, and endure forever? It is like a wingless heron longing to flap its wings over the celestial pond, or a mayfly wishing to enjoy the spring and autumn. If you could sweep away these myriad disorders, purge filth and restore harmony, guard your spirit’s darkness in the Crimson Palace, close the gates of excess and open the gates of enlightenment, still the extravagance in the chamber of stillness, cherish all beings without endangering them, uphold these precepts of the Dao, contemplate its numinous essence, practice kindness and harmony, refine and treasure your essence and *qi*, cast aside frivolous adornments, and let the hundred strivings swiftly recede—then perhaps you might glimpse the path. If not, it would be as futile as embracing a stone to cross a great river.\"\n\nThe Emperor knelt to receive the sacred precepts, vowing to heed her words. \"The essentials of nurturing life I have now heard, yet my body is not of jade or stone, and my *qi* has no master within. My darkness is not of the four seasons, yet it constantly arises within. In governing, I must regulate my comings and goings, ensuring that breath is harmonious and fluids flow smoothly, that form and spirit are not disordered, and that *qi* adapts as needed. Then the hun and po will not stagnate. If I can align with my allotted portion, discerning the proper measure of *qi* and its movements, then my form may not wither, and my dwelling may not decay. Though I once received the scriptures of the Dao and diligently practiced them, I gained no true verification, no great benefit. My spirit is wearied by its comings and goings, my fluids labored by their egress and ingress. The years diminish their beginning, the months wane their past; my form gradually withers, my spirit declines. This is because I have failed to uphold the oral instructions, opening and closing the Gate of Brilliance as required. I do not know whether the arts of ingestion can ensure permanence, or whether breath control can extend the years. I beg you to bestow the art of longevity, that I may briefly awaken this walking corpse. If you would deign to instruct me today, I prostrate myself to receive the teachings of the resplendent heavens.\"\n\nThe Queen Mother said: \"Long ago, when the Primordial Heavenly King of the Origin was at leisure, he ascended the Terrace of Nieshao. His attendants—the Heavenly Emperor of Fusang, the Nine Perfected Lords, the myriad immortals and officials of the ten directions—gathered within the cinnabar chamber to hear his profound words. He asked me why I sought to attain long life. I withdrew from my seat, kowtowed, and begged to learn the art of longevity. The Heavenly King, in his wisdom, bestowed upon me essential words—utterances profound and subtle, truly the mysterious vision of heaven and humanity, the wondrous secrets of the Supreme Emperor. Would you now wish to hear them?\"\n\nThe Emperor knelt and said: \"I, Liu Che, a lowly and worthless creature, a remnant of withered bones, dare to aspire with my unworthy body to the years of dragons and phoenixes, hoping with the ephemeral quality of morning flowers to attain the span of dark and bright moons. Though I long for distant currents, I know not how to cross. The path is blocked and impassable, my needs unmet. I constantly fear that one day I will die in the struggle of seeking, becoming a laughingstock to the vulgar. Never did I imagine that today I would encounter this luminous convergence, gazing upon your sacred form, my spirit soaring as if awakened from a great dream.\"",
      "overlap_context": "hue. The Queen Mother offered four to the Emperor and ate three herself. The peaches were so sweet and delicious that their flavor lingered in the mouth.\n\nThe Emperor ate them and kept the pits. (Keeping, that is, preserving them.) The Queen Mother asked, \"Why?\" The Emperor replied, \"I wish to plant them.\" The Queen Mother said, \"These peaches bear fruit but once every three thousand years. The soil of the Central Land is too poor; they will not grow. How can this be?\" The Emperor then desisted.",
      "start_char": 1081,
      "end_char": 2301,
      "start_sentence": 50,
      "end_sentence": 95,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.450308084487915,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\汉武帝内传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "如以涉世千年，救护死归之日。 乞愿垂哀诰，赐彻元元。 王母曰：将告女要言。 我曾闻天王日：夫欲长生者，宜先取诸身。 但坚守三一，保尔旅族。 金瑛夹草，广山黄木，昌城玉药，夜山火玉，逮及凤林呜醉音醋，西瑶琼酒，中华紫蜜，北陵绿阜，太上之药，风实云子，玉津金浆，月精万寿，碧海琅菜，蓬莱文丑，浊河七荣，动山高柳，北采玄都之绮华，仰漱云山之朱蜜，夜河天骨，昆吾漆沬，一空洞灵瓜，四劫一实，宜陵麟胆，炎山一夜日，东攘扶桑之丹档，俯探长河之文藻。 素虹童子，九色凤脑，太真虹苗音面，天漠巨草，南宫火碧，西乡扶老，三梁龙华，生子大道，有得食之，后天而老。 此太上之所服，非中仙之所保。 其次药有八光太和，斑龙黑胎，文虎白沫，出于西丘，七玄飞节，九孔连珠，云浆玉酒，玄圃琼腴，钟山白胶，玉屋青,，闱风石髓，黑河珊瑚，蒙山白凤之，灵丘苍鸾之血，东英朱菜，九节交结，太微嘉禾，琼华脑实，流渊鲸眼，赤河绛璧，北汲太玄之酪，中握二仪之脉，云渎蘗艾，昆丘神雀，广夜茎草，流渊青狄，真陵雷精，玄都平盖，左食神元，右闻玄濑，上屈兰圆之金精，下摘圆丘之紫奈，鸾水灵蛤，八陕赤越，万载一生，流光九队，有得食之，后天而逝。 此天帝之所服，下#22仙之所逮。 其次药有九丹金液，紫华红英，太清九转，五云之浆，玄霜绛雪，腾跃三黄，东瀛白香，炎洲飞生，八石十苗，成僖九光，西流石胆，东沧青钱，高丘余粮，精石琼田，太虚还丹，盛次金兰，长光绿草，云童飞干，子得服之，白日升天。 此飞仙之所服，地仙之所见也。 其下药有松相之膏，山姜沈精，刍草泽泻，枸杞狭苓，莒蒲门冬，巨胜黄菁，蕾买飞赤版，桃胶朱英，椒麻续断，萎羹黄连，如此下药，略举其端，，草类繁多，名有数千，子得服之，可以延年。 虽不长享无期，上升青天，亦能身生光泽，还发童颜，役使草鬼，得为地仙。 要且录此有阶，渐寻远胜也。 是以天官远妙，灵药别品，灵无奇挺，真仙有域，今不可谓呼吸六黑，安在一身，灌溉三宫，近出阿庭，浅薄其术，弃而不为，其大蕙者也。 夫呼吸御精，保明神黑，足以精不脱则永久，黑长存则不死。 既得其和，其寿不已。 又复不用药物之烦费，营索之劬劳者也。 百姓日用，故上品谓之自然者矣o．但不得游乎十天，飞我八外，自得纵身於四域之内，亦驻策众灵焉。 夫始欲修之，先营其黑，《太上真经》所谓行益易之道。 益者益精，易者易形，能益能易，名上仙籍。 不益不易，不离死厄。 行益易者，谓常思灵宝也。 灵者神也，宝者精也。 子但受精握固，闭黑吞液，黑化血，血化精，精化液，液化骨，行之不倦，神精充溢。 为之一年易黑，二年易血，三年易脉，四年易音肉，五年易髓，六年易筋，七年易骨，八年易发，九年易形变化#23。 易形变化则道成，道成则位为仙人。 吐纳六黑，口中甘香。 欲食灵苗，存得其味，微息抱吞，从心所适。 黑者水也。 无所不成，至柔之物，通致神精矣。 此元始天王丹房之中微言所说#24，今敕侍岌玉女李庆孙书出，以相付子，善录而循#25焉。 於是王母言粗毕，啸命灵官，使驾龙严车，欲去。",
      "translated_text": "\"Should you traverse the world for a thousand years, to rescue and safeguard the day of death’s return—then I humbly beg your compassionate instruction, that you bestow upon me the primal essence.\"\n\nThe Queen Mother said: \"I shall now impart to you the essential teachings. I once heard the Heavenly King say: Those who seek long life must first seek it within themselves. Simply guard firmly the Three Ones and preserve your traveling clan. There are the golden radiance enfolding herbs, the yellow woods of Broad Mountain, the jade medicines of Prosperous City, the fire-jade of Night Mountain, the singing wine of Phoenix Grove, the jade wine of Western Jade, the purple honey of the Central Lands, the green mounds of Northern Tumulus, the supreme medicines of the Most High—phoenix fruits and cloud seeds, jade nectar and golden liquor, moon essence of ten thousand years, azure-sea coral greens, the patterned herbs of Penglai, the seven blossoms of Turbid River, the tall willows of Moving Mountain, the brocade flowers plucked from Dark Capital’s heights, the crimson honey sipped from Cloud Mountain’s peaks, the heavenly bones of Night River, the lacquer foam of Kunwu, the single spirit melon of the empty cavern, the fruit that ripens once in four kalpas, the unicorn gall of Proper Mound, the sun of Flame Mountain that rises in a single night, the cinnabar archives of Fusang’s east, the patterned algae dredged from the Long River’s depths. There are the white-violet lads, the nine-colored phoenix brains, the rainbow sprouts of the Great Perfected, the giant grasses of Heavenly Desert, the fire-jades of Southern Palace, the elder-supporting herbs of Western Land, the three-beamed dragon flowers, the birth herbs of the Great Dao—whoever partakes of these will age only after heaven itself. These are what the Most High consume; they are not what middling immortals preserve.\n\nNext in rank are the medicines: the Eight Radiant Supreme Harmony, the spotted dragon’s black embryo, the striped tiger’s white foam from Western Mound, the seven dark flying nodes, the nine-holed linked pearls, cloud nectar and jade wine, the fat of Jade Garden, the white glue of Bell Mountain, the azure of Jade Chamber, the stone marrow of Boudoir Wind, the black river’s coral, the white phoenix of Meng Mountain, the blood of the azure simurgh of Spirit Mound, the crimson herbs of Eastern Ying, the nine-jointed intertwined stalks, the fine grains of Supreme Microcosm, the brain-fruits of Jade Flower, the whale eyes of Flowing Abyss, the crimson jades of Red River, the fermented milk drawn from the Great Mystery’s north, the pulses grasped from the Two Modes’ center, the cloud-stream mugwort, the divine birds of Kun Hill, the stem herbs of Broad Night, the green teals of Flowing Abyss, the thunder essence of True Mound, the level canopy of Dark Capital, consuming the divine origin on the left, hearing the dark torrent on the right, bending to gather the golden essence of Orchid Garden above, stooping to pluck the purple crabapples of Round Mound below, the spirit clams of Luan Waters, the red Yueh of Eight Gorges—whoever partakes of these will depart only after heaven itself. These are what the Heavenly Emperor consumes; they are what lesser immortals may attain.\n\nNext are the medicines: the nine elixirs and golden liquor, the purple flowers and crimson blossoms, the nine transformations of Great Clarity, the nectar of five clouds, the dark frost and crimson snow, the leaping three yellows, the white incense of Eastern Sea, the flying life of Flame Continent, the eight stones and ten sprouts, the nine radiant perfected forms, the stone gall of Western Flow, the green coins of Eastern Sea, the surplus grains of High Mound, the essence stones of Jade Field, the returning elixir of Great Void, the golden orchids of Shengci, the ever-bright green herbs, the flying stalks of Cloud Lad—whoever consumes these will ascend to heaven in broad daylight. These are what flying immortals consume; they are what earthbound immortals may witness.\n\nBelow these are the medicines: the pines and cypresses’ resin, the essence of mountain ginger, the marsh plants and alisma, the wolfberries and poria, the calamus and asparagus, the sesame and astragalus, the flying red tablets of lepidium, the peach gum and vermilion blossoms, the pepper and hemp, the dipsacus and polygonatum, the polygonum and coptis—such lesser medicines, though I mention but a few, number in the thousands. Whoever consumes these may extend their years. Though they may not enjoy boundless longevity or ascend to the azure heavens, they can still restore their bodies’ luster, return their hair to youthful black, command plant spirits, and become earthbound immortals. The key is to record these in order, gradually seeking what is ever more excellent.\n\nThus the heavens’ offices are profoundly wondrous, and the numinous medicines are of distinct ranks. The divine is not singularly extraordinary, and true immortals have their domains. Now, one cannot simply claim that breathing the six blacks and securing them within the body, irrigating the three palaces and drawing near to the courtyard of the self, are shallow arts to be discarded and left unpracticed—this would be the greatest folly.\n\nTo master breath and govern essence, to preserve the luminous spirit and the black, is sufficient to ensure that when essence does not dissipate, one endures forever, and when the black remains eternal, one does not die. Having attained harmony, one’s life knows no end. Moreover, this requires neither the expense of medicines nor the toil of seeking them. It is what the people use daily, and thus the highest grade is called the natural.\n\nYet one may not roam the ten heavens or soar beyond the eight directions, but may freely wander within the four realms, and even there, command the multitude of spirits. For those who first wish to cultivate this, begin by nurturing the black—this is what the *True Scripture of the Most High* calls the Way of Benefit and Transformation. Benefit refers to augmenting essence; transformation refers to transforming form. Those who can augment and transform are recorded in the registers of the highest immortals. Those who cannot augment nor transform cannot escape the calamity of death.\n\nTo practice augmentation and transformation means to constantly contemplate the numinous treasure. The numinous is spirit; the treasure is essence. You need only receive essence, grasp it firmly, close the black, and swallow the fluid. The black transforms into blood, blood into essence, essence into fluid, fluid into bone. Practice this without weariness, and spirit and essence will overflow. In one year, the black is transformed; in two years, the blood; in three years, the vessels; in four years, the flesh; in five years, the marrow; in six years, the sinews; in seven years, the bones; in eight years, the hair; in nine years, the form is transformed and changed. When the form is transformed and changed, the Dao is achieved, and upon achieving the Dao, one is ranked among the immortals.\n\nExhaling and inhaling the six blacks, the mouth becomes sweetly fragrant. Desiring to taste the numinous sprouts, one may savor their flavor. With subtle breaths and embracing swallows, follow the heart’s inclination. The black is water—nothing it cannot accomplish. As the most yielding of substances, it conveys the divine essence.\n\nThese are the esoteric words spoken by the Primordial Heavenly King within the cinnabar chamber. Now, I command the jade maiden Li Qingsun to transcribe and deliver them to you. Record them well and follow them diligently.\"\n\nWith these words roughly concluded, the Queen Mother whistled to summon the spirit officials, ordering them to harness the dragon-drawn carriage, preparing to depart.",
      "overlap_context": "gons and phoenixes, hoping with the ephemeral quality of morning flowers to attain the span of dark and bright moons. Though I long for distant currents, I know not how to cross. The path is blocked and impassable, my needs unmet. I constantly fear that one day I will die in the struggle of seeking, becoming a laughingstock to the vulgar. Never did I imagine that today I would encounter this luminous convergence, gazing upon your sacred form, my spirit soaring as if awakened from a great dream.\"",
      "start_char": 2301,
      "end_char": 3518,
      "start_sentence": 96,
      "end_sentence": 129,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.484501123428345,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\汉武帝内传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "帝#26叩头，请留殷勤，王母乃止。 王母乃遣侍女郭密香与上元夫人相问，云：王九光母敬谢，但不相见四千余年。 天事劳我，致以愆面。 刘彻好道，适来视之。 见#27彻了了，似可成进。 然形慢神秽，脑血淫漏，五藏不淳，关胃彭勃，骨无津液，浮反外内，多精少，瞳子不夷，三尸狡乱，玄白失时，语之至道，殆恐非仙才。 吾久在人问，实谓#28臭浊，然时复可游，望以写细念。 庸主对坐，浥浥不乐。 夫人肯暂来否？ 若能屈驾，当停相须。 帝不知上元夫人何神人也，又见侍女下殿，俄#29失所在。 须臾，郭侍女返。 上元夫人又遣侍女答相#30问，云：阿环再拜，上问起居。 远隔绛河，扰以官事，遂替颜色近五千年。 仰恋光润，情系#31无违。 密香至，奉信，承降尊於刘彻处。 闻命之际，登当颠倒。 先被大帝君动使#32诣玄洲，校定天元。 正尔暂往，如是当还。 还便束带，须臾少留。 帝因问上元夫人由。 王母日：是三天#33上元之官，统领十方玉女之名录者也。 当二时许，上元夫人至。 来时亦闻云中箫鼓之声。 既至，从官文武千余人皆女子，年同十八九许，形容明逸，多服青衣，光彩耀日，真灵官也。 夫人年#34可廿余，天姿清辉，灵眸绝朗，着赤霜之袍，蕾买彩乱色，非锦非绣，不可名字。 头作三角髻，余发散垂之，至腰。 ．戴九灵夜光之冠，带六出火玉之佩，垂凤文琳华之绶，腰流黄挥精之剑，上殿向王母拜。 王母坐而止之，呼同坐北向。 夫人设厨，厨之精珍，与王母所设者相似。 王母劝帝日：此真元之母，尊贵之神，女当起拜。 帝#35寒温，还坐。 夫人笑日：五浊之人，耽湎荣利，嗜味淫色，固其常也。 且彻以天子之贵，其乱目者，倍於常人焉。 而复於华丽之墟，拔嗜欲之根#36，为之事，良有志也。 王母曰：所谓有心哉。 上元夫人谓帝日：女好道乎？ 闻数招方士，祭山岳，祠灵神，梼河川，亦为勤矣。 而不获者，皇有由也。",
      "translated_text": "The Emperor kowtowed, entreating her earnestly to stay, and the Queen Mother relented.\n\nThe Queen Mother then dispatched her attendant, Guo Mixiang, to convey greetings to the Supreme Primordial Lady, saying: \"The Mother of the Nine Lights respectfully inquires after you. It has been over four thousand years since we last met. Heavenly affairs have wearied me, leaving my countenance wanting. Liu Che is devoted to the Dao, and I have come to observe him. I see that he is clear-minded and may yet progress. Yet his form is sluggish, his spirit defiled; his brain blood leaks wantonly, his five viscera impure. His stomach and intestines churn, his bones lack vital fluids, his qi drifts between inner and outer, his essence scant and jing abundant. His pupils are uneven, the Three Corpses stir in chaos, and his black and white hairs come untimely. To speak to him of the utmost Dao—I fear he may not be fit for immortality. Though I have long dwelled among mortals, I still find the stench and filth unbearable. Yet at times, I may still wander, hoping to dispel these petty concerns. The mediocre lord sits opposite, sullen and displeased. Would you deign to come for a brief visit? If you could condescend to descend, I shall wait for you.\"\n\nThe Emperor did not know who the Supreme Primordial Lady was, and as he watched the attendant descend from the hall, she suddenly vanished from sight. After a moment, Guo the attendant returned. The Supreme Primordial Lady had sent her own attendant in reply, saying: \"Ahuan bows twice and inquires after your well-being. Separated by the Crimson River and burdened by official duties, my countenance has faded for nearly five thousand years. I long for your radiance and grace, my heart ever bound to you without fail. When Mixiang arrived bearing your message, I learned of your condescension to visit Liu Che. Upon hearing this, I was overcome with joy. Yet just before, the Great Emperor Lord dispatched me to the Dark Continent to review and rectify the Heavenly Records. I must depart briefly, but I shall return. Upon my return, I shall don my sash and stay for a short while.\"\n\nThe Emperor then asked about the Supreme Primordial Lady’s origins. The Queen Mother replied: \"She is the overseer of the Supreme Primordial Palace of the Three Heavens, the one who governs the registers of jade maidens across the ten directions.\"\n\nShortly after, the Supreme Primordial Lady arrived. As she approached, the sound of flutes and drums echoed through the clouds. Upon her arrival, her retinue of over a thousand civil and martial officials—all women—appeared. They were around eighteen or nineteen years of age, their forms luminous and graceful, most clad in azure robes. Their radiance outshone the sun, for they were true divine officials. The Lady herself appeared to be in her twenties, her celestial bearing resplendent, her eyes surpassingly bright. She wore a robe of crimson frost, its hues shifting in dazzling patterns—neither brocade nor embroidery, beyond any name. Her hair was styled into a three-cornered topknot, the rest cascading down to her waist. She wore a crown of Nine Spirits’ Night Radiance, a girdle of Six-Rayed Fire Jade, a sash of phoenix-patterned lin-hua, a sword of flowing yellow essence at her waist. She ascended the hall and bowed to the Queen Mother, who sat and gestured for her to stop, inviting her to sit facing north.\n\nThe Lady prepared a feast, its delicacies as refined as those the Queen Mother had set before them. The Queen Mother urged the Emperor, saying: \"This is the True Primordial Mother, a most revered deity. You should rise and bow to her.\" The Emperor exchanged courtesies and returned to his seat.\n\nThe Lady smiled and said: \"The people of this turbid world are mired in glory and profit, addicted to flavors and lusts—such is their nature. Moreover, Che, as a Son of Heaven, is twice as prone to distraction as ordinary men. Yet here he stands in this realm of splendor, having uprooted the roots of desire—this is no small feat. He truly has resolve.\"\n\nThe Queen Mother said: \"Indeed, he has the heart for it.\"\n\nThe Supreme Primordial Lady then asked the Emperor: \"Do you love the Dao? I hear you have frequently summoned masters of the esoteric arts, made offerings to mountains and rivers, and supplicated the numinous spirits. You have been diligent. Yet your efforts have borne no fruit—there is a reason for this.\"",
      "overlap_context": "k is water—nothing it cannot accomplish. As the most yielding of substances, it conveys the divine essence.\n\nThese are the esoteric words spoken by the Primordial Heavenly King within the cinnabar chamber. Now, I command the jade maiden Li Qingsun to transcribe and deliver them to you. Record them well and follow them diligently.\"\n\nWith these words roughly concluded, the Queen Mother whistled to summon the spirit officials, ordering them to harness the dragon-drawn carriage, preparing to depart.",
      "start_char": 3518,
      "end_char": 4262,
      "start_sentence": 130,
      "end_sentence": 168,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.49987268447876,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\汉武帝内传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "女胎性暴，胎性奢，胎性淫，胎性酷，胎性贼，五者恒舍於荣卫之中、五藏之内，虽锋错良针，固难愈矣。 暴则使黑奔而神攻，是故神扰而黑谒； 淫则使精漏而魂疲，是故精谒而魂销； 奢则使真离而魂#37，是故本游而灵皇； 酷则使丧仁而自攻，是故失仁而服乱； 贼则使心国而口乾，是故内战而外绝。 五者皆是截身之刀锯，剖命之斧铁，虽复疲好於长生，而不能遣兹五难，亦何为损性而自劳乎？ 然犹是得此小益，以自知往尔。 若从今已舍尔五性，反诸柔善，明务察下，慈务矜怨#38惠务济穷，赈务施劳，念务存孤，惜务及身，恒为阴德，救济死厄，一旦久孜孜，不泄精液，於是闭诸淫，养尔神，放诸奢，从至俭，勤斋戒，节饮食，绝五谷，去皇腥，呜天鼓，饮玉浆，荡华池，叩金梁，按而行之，当有翼#39。 今阿母迂天尊之重，下降於媳蛄之窟，屈#40虚之灵，而诣孤乌之俎，且阿母至戒，妙唱玄发，验其敬勖，节度明修，所奉比及百年，阿母必能致女於玄都之墟，迎女於昆阙之中，位以仙官，游迈十方。 吾言之毕矣，子厉之哉。 若不能尔，无所言矣。",
      "translated_text": "\"Your inborn nature is violent, your inborn nature is extravagant, your inborn nature is lustful, your inborn nature is cruel, your inborn nature is treacherous—these five ever dwell within the channels of *ying* and *wei* and the five viscera. Though sharp blades and fine needles be applied, they are fundamentally difficult to cure.\n\nViolence drives the *shen* to flee in terror, so the spirit is disturbed and the *shen* exhausted. Lust causes essence to leak and the *hun* to weary, so essence is drained and the *hun* dissolved. Extravagance severs the true and scatters the *po*, so the root wanders and the numinous fades. Cruelty forfeits benevolence and turns against oneself, so one loses benevolence and submits to chaos. Treachery makes the heart a battleground and the mouth parched, so inner strife rages and outer ties are severed. These five are the saws and knives that sever the body, the axes and blades that cleave life. Though you may exhaust yourself in pursuit of longevity, if you cannot cast off these five afflictions, why harm your nature and weary yourself in vain?\n\nYet even this small benefit is enough to awaken you to the path ahead. If from this day forward you abandon these five natures, return to gentleness and goodness, clarify your duties and examine those below, show compassion to the aggrieved, bestow kindness to the poor, relieve the toiling, remember the orphaned, cherish your own body, and constantly perform hidden virtues to rescue those in mortal peril—if you persist in diligence without ceasing, refrain from leaking essence, seal off lust, nurture your spirit, cast off extravagance, embrace utmost frugality, devote yourself to fasting and abstinence, moderate your diet, abstain from the five grains, eliminate rich and rank foods, sound the Heavenly Drum, drink the Jade Nectar, bathe in the Flowery Pool, strike the Golden Bridge, and practice these disciplines—then wings shall grow.\n\nNow the Most Venerable Mother has descended from the weight of Heavenly Honor, condescending to this mole-cricket’s burrow, bending the numinous emptiness to attend this solitary crow’s altar. Moreover, the Most Venerable Mother’s solemn admonitions, her wondrous teachings of the mysterious, test your reverence and diligence, and her measured instructions are clearly set forth. If your devotion endures for a hundred years, the Most Venerable Mother will surely guide you to the precincts of the Dark Capital, welcome you within the gates of Kunlun, appoint you to the offices of immortality, and enable you to roam the ten directions.\n\nMy words are finished. Steel yourself! If you cannot do this, there is nothing more to say.\"",
      "overlap_context": "men. Yet here he stands in this realm of splendor, having uprooted the roots of desire—this is no small feat. He truly has resolve.\"\n\nThe Queen Mother said: \"Indeed, he has the heart for it.\"\n\nThe Supreme Primordial Lady then asked the Emperor: \"Do you love the Dao? I hear you have frequently summoned masters of the esoteric arts, made offerings to mountains and rivers, and supplicated the numinous spirits. You have been diligent. Yet your efforts have borne no fruit—there is a reason for this.\"",
      "start_char": 4262,
      "end_char": 4692,
      "start_sentence": 169,
      "end_sentence": 180,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.394912481307983,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\汉武帝内传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "帝下席跪谢曰：臣受性凶顽，生长乱浊，面墙不启，无由开达。 然贪生畏死，奉灵敬神。 今日受教，此乃天也。 辄戢圣令，以为身范。 是小丑之臣，当获生活。 唯垂哀护，愿赐元元。 夫人使帝还坐。 王母谓夫人日：卿之戒言，言甚急切，更使未解之人畏於至意。 夫人曰：若其志道，将以身投饿虎，忘躯破灭。 蹈火履水，固於一志，必无忧也。 若其无忠志，则心疑真信，嫌惑之徒，勿畏急言。 急言之发，欲成其志耳。 阿母既有念，必当赐以尸解之方耳。 王母日：此子勤心已久，而不遇良师，遂欲毁其正志，当疑天下必无仙人，是故发我闻官，暂舍尘浊，既欲坚其仙志，又欲令向化不惑也。 今日相见，令人念之。 至於尸解下方，吾甚不惜。",
      "translated_text": "The Emperor descended from his seat and knelt in gratitude, saying: \"This servant’s nature is fierce and stubborn, born and raised in chaos and filth. Facing a wall, I have never known enlightenment, nor found a way to break through. Yet I cling to life and fear death, revering the numinous and honoring the gods. Today, I receive your teachings—this is the work of Heaven. I shall humbly embrace your sacred command as the model for my conduct. Though this lowly and contemptible servant, I may yet attain life. I beg only for your compassion and protection, that you grant me the very breath of existence.\"\n\nThe Lady then bade the Emperor return to his seat. The Queen Mother of the West addressed the Lady, saying: \"Your admonitions were most urgent and severe, which may cause those yet unenlightened to shrink from their profound intent.\"\n\nThe Lady replied: \"If one is truly resolved upon the Dao, they would cast their body before a starving tiger, forgetting themselves to the point of destruction. They would tread through fire and water, steadfast in their resolve, without fear. But if their loyalty and will are lacking, their heart will waver between truth and doubt, and such a hesitant, deluded soul will not be deterred by stern words. The urgency of my speech is meant only to strengthen their resolve. Since the Most Venerable Mother has taken this to heart, she will surely bestow upon them the method of *shijie*.\"\n\nThe Queen Mother said: \"This one has long been diligent in heart, yet has never encountered a true teacher, nearly causing him to abandon his rightful aspiration. He came to doubt whether immortals exist in this world. Thus, I revealed my celestial palace and briefly withdrew him from the dust and filth, both to fortify his resolve for immortality and to ensure his faith in the Way remains unshaken. Today’s meeting moves me deeply. As for the *shijie* method of the lower ranks, I do not begrudge it in the least.\"",
      "overlap_context": "olemn admonitions, her wondrous teachings of the mysterious, test your reverence and diligence, and her measured instructions are clearly set forth. If your devotion endures for a hundred years, the Most Venerable Mother will surely guide you to the precincts of the Dark Capital, welcome you within the gates of Kunlun, appoint you to the offices of immortality, and enable you to roam the ten directions.\n\nMy words are finished. Steel yourself! If you cannot do this, there is nothing more to say.\"",
      "start_char": 4692,
      "end_char": 4975,
      "start_sentence": 181,
      "end_sentence": 196,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.490853071212769,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\汉武帝内传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "复三年，吾必欲赐以成丹半剂、石象散一具与之，则彻不得复停。 当今匈奴未弥，边陲有事，何必令其仓卒舍天下之尊而便入林岫也？ 但当问笃向之志#41卒何如，如其回改，吾方数来。 王母因抚帝背曰：女用上元夫人至言，必得长生，可不勖勉？ 帝跪日：彻书之金简，以身模之焉。 帝又见王母巾岌中有卷子小书，盛以紫锦之囊。 帝问：此书是仙灵之方邪？ 不审其目可得瞻眄#42王母出以示之，曰：此《五岳真形图》也。 昨青城诸仙就我求请，当#43以付之，乃三天太上所出，其#44秘禁极重，岂女秽质所宜佩乎？ 今且与汝《灵光生经》，可以通神劝志也。 帝下地叩头，固请不已，王母日：昔上皇清虚元年，三天太上道君下观六合，瞻河海之短长，察丘岳之高卑，名立天柱，安于地理#45植五岳而拟诸镇辅，贵昆灵#46舍灵仙，尊#47蓬丘以馆真人，安水神乎极阴之源，柄太帝乎搏桑之墟，於是方丈之阜，为理命之室，沧浪海岛，养九老之堂，祖瀛玄炎、长元、流生、凤麟、聚窟，各为洲名，并在沧流大海玄津之中。 水则碧黑俱流，波则振荡旱精。 诸仙玉女，聚於沧俱，其名难测，其实分明。 乃因山源之规矩，睹河岳之盘曲，陵回阜转，山高珑长，周旋委蛇，形似书字，是故因象制名，定实之号，画形秘於玄台，而出为灵真之信。 诸仙佩之，皆如传章。 道士执之，经行山川，百神草灵尊奉亲迎。 女虽不正，然数访山泽，叩求之志，不忘于道。 欣子有心，今以相与。 当深奉慎，如事君父。",
      "translated_text": "Three years hence, I shall bestow upon him half a dose of the elixir of perfection and a single *Stone Elephant Powder*—then he may no longer tarry here. Yet now the Xiongnu remain unquelled, and the frontier is unsettled; why should he hastily abandon the exalted station of the world to retreat into the mountain forests? First, let us inquire into the steadfastness of his aspiration. Should he waver or turn back, I shall come no more.\"\n\nThe Queen Mother then laid her hand upon the Emperor’s back and said: \"You have heard the profound words of the Lady of Supreme Prime—surely you shall attain long life. How can you not strive with all your might?\"\n\nThe Emperor knelt and replied: \"I shall inscribe these words upon golden tablets and take them as my own model.\"\n\nHe then noticed within the Queen Mother’s headscarf a small scroll, encased in a purple brocade pouch. He asked: \"Is this a divine formula of the immortals? Might I be permitted to glimpse its title?\"\n\nThe Queen Mother produced it and showed him, saying: \"This is the *Chart of the True Forms of the Five Peaks*. The immortals of Qingcheng sought it from me, and I was to deliver it to them. It was issued by the Supreme One of the Three Heavens, and its secrecy and prohibitions are most stringent—how could one of your impure constitution be fit to bear it? For now, I shall give you the *Scripture of the Radiant Life*, which may open the way to communion with the spirits and strengthen your resolve.\"\n\nThe Emperor prostrated himself upon the ground and entreated her without cease. The Queen Mother said: \"In the first year of the *Qingxu* reign of the Supreme August One, the Most High Lord of the Dao descended to survey the six directions. He beheld the length and breadth of rivers and seas, examined the heights and depths of hills and mountains, established the Pillar of Heaven, and fixed it in the earth’s pattern. He planted the Five Peaks as the supporting pillars of the realm, honored Kunlun as the abode of divine immortals, exalted Penglai as the lodge of perfected beings, settled the water spirits at the source of utmost yin, and enthroned the Great Emperor at the site of Fusang. Thus, the mound of Fangzhang became the chamber of destiny, the islands of Canglang became the hall of the Nine Elders, while Zuying, Xuanming, Changyuan, Liusheng, Fenglin, and Juqu were each named as isles, all lying amidst the vast expanse of the dark tides and the profound ford. Their waters flow both azure and black, their waves surge with the essence of the sun and moon. Immortal maidens and jade lads gather there in countless numbers, their names unfathomable, yet their reality distinct.\n\nObserving the contours of mountain origins and the meanders of rivers and peaks—how the ridges coil and the mounds turn, how the mountains rise high and stretch long, winding and undulating like written characters—he therefore shaped their forms into names, designating their true appellations. He drew their images in secret upon the Dark Terrace, and from there they emerged as tokens of the numinous and true. All immortals who bear them do so as one would transmit a sacred text. When Daoists carry them while traversing mountains and rivers, the hundred spirits and myriad numina honor them and come forth to welcome them.\n\nThough you are not yet perfected, your repeated visits to mountains and marshes, your unwavering resolve to seek and inquire, have not forgotten the Way. Delighted by your sincerity, I now grant this to you. You must hold it in the deepest reverence, as though serving a lord or father.\"",
      "overlap_context": "aid: \"This one has long been diligent in heart, yet has never encountered a true teacher, nearly causing him to abandon his rightful aspiration. He came to doubt whether immortals exist in this world. Thus, I revealed my celestial palace and briefly withdrew him from the dust and filth, both to fortify his resolve for immortality and to ensure his faith in the Way remains unshaken. Today’s meeting moves me deeply. As for the *shijie* method of the lower ranks, I do not begrudge it in the least.\"",
      "start_char": 4975,
      "end_char": 5558,
      "start_sentence": 197,
      "end_sentence": 215,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.99045443534851,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\汉武帝内传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "泄示凡．夫，必致祸考#48也。 上元夫人语帝日：阿母今以琼岌妙蕴，发紫台之文，赐女八会之书、五岳真形，可谓至珍且贵，上帝之玄观矣。 子自非受命合神，弗见此文。 今虽得其真形，观其妙理，而无五帝六甲左右灵飞之符、太阴六丁通真遁虚玉女之箓、太阳六戊招神天光策精之书、左乙混沌束蒙之文、右庚素收摄#49杀之律、壬．癸六遁隐地八术、丙丁入火九赤班符、六辛入金致黄水月华之法、六巳石精金光藏影化形之方、子午卯酉八禀十决六灵威仪、丑辰未戌地真素诀长生紫书三五顺行、寅申巳亥紫度炎光内视中方，凡阙此十二事者，何以召山灵，朝地神，总摄万精，驱策百鬼，来虎豹，役蛟龙乎？ 子所谓适知其一，未见其他也。 帝下席叩头日：彻下土浊民，不识清真，今日闻道，是生命会遇圣母，今当赐与真形，修以度世。 夫人今告彻应须五帝六甲、六丁、六戊致灵之术，既蒙启发，弘益无量，唯原告诲，济臣饥渴，得使已枯之木，蒙灵阳之润，焦炎之草，幸甘雨之溉。 不敢多陈，愿赐指授。 上元夫人日：我无此文也。 昔曾扶广山见青真小童有此金书秘字，云求道益命，千端万绪，皆须五帝六甲灵飞之术、六丁六壬名字之号，得以请命延算，长生久视，驱策众灵，役使百神者也。 其无六甲要事，唯守真形者，於通灵之来，必无阶矣。 女有心可念，故相告篇目耳。 幸复广加搜访焉。 帝固请不已，叩头流血。 上元夫人日：吾无此文，所以相示十二事者，欲令女广寻博求，以参真形之用耳。 王母乃告上元夫人日：夫真形宝文，灵官所贵。 此子守求不已，誓以必得，故亏科禁，特以与之。 然五帝六甲，通真招神，此术眇邈，必当#50须精洁至诚，殆非流浊所宜施行。 吾今既赐彻以真形，夫人今#51当授以致灵之途矣。 吾尝忆昔日与夫人共登玄垄朔野，及曜真之山，豚王子童。 王子童#52乃就吾请求太上隐书，吾以三元秘言，不可传泄於中仙。 夫人时亦有言，见守助子童之言志矣。 吾既难违来意，不独执惜。",
      "translated_text": "Revealing these to the common and uninitiated will surely invite calamity. The Lady of Supreme Primordium said to the Emperor: \"The Celestial Mother has now unveiled the wondrous mysteries of the jade tablets, disclosed the script of the Purple Terrace, and bestowed upon you the *Eightfold Assembled Writ* and the *True Forms of the Five Peaks*—truly the most precious and exalted, the profound contemplation of the Supreme Thearch.\n\nUnless one is destined by mandate and aligned with the numinous, one shall never behold these texts. Though you have now obtained the *True Forms* and glimpsed their wondrous principles, without the talismans of the *Five Thearchs and Six Jia*, the *Leftward Numinous Flight of the Six Ding*, the *Register of the Six Yu Jade Maidens of Great Yin Who Traverse the Void*, the *Writ of the Six Wu of Great Yang That Summons Spirits and the Celestial Radiance of Refined Essence*, the *Script of Left Yi That Binds Chaos and Gathers Obscurity*, the *Law of Right Geng That Restrains and Gathers Destruction*, the *Eight Arts of the Six Ren and Gui That Conceal in Earth and Withdraw*, the *Nine Crimson Talismans of Bing and Ding That Enter Fire*, the *Method of the Six Xin That Enters Metal and Draws Forth the Yellow Waters and Moon Essence*, the *Art of the Six Si That Conceals the Golden Light of Stone Essence and Transforms Form*, the *Six Numinous Dignities of the Eight Endowments and Ten Resolutions of Zi, Wu, Mao, and You*, the *Three-Five Sequential Progression of the Purple Writ of Longevity and the Pristine Formulae of Earthly Perfection of Chou, Chen, Wei, and Xu*, and the *Inner Vision of the Central Realm of the Purple Crossing and Blazing Radiance of Yin, Shen, Si, and Hai*—how can one summon the mountain spirits, convene the earth deities, command the myriad essences, drive the hundred ghosts, summon tigers and leopards, or employ dragons?\n\nWhat you know is but one part; you have yet to see the rest.\"\n\nThe Emperor descended from his mat and kowtowed until his forehead bled, saying: \"This humble, muddied subject of the lower realm knows not the purity of the true. Today, hearing the Dao, is the meeting of this life with the Sagely Mother. Now that you have bestowed the *True Forms*, I shall cultivate them to transcend the world. The Lady has now instructed me that I must also seek the arts of the *Five Thearchs and Six Jia*, the *Six Ding*, and the *Six Wu* to summon the numinous. Having received this enlightenment, the benefit is boundless. I only beg for further instruction to quench my thirst, that this withered tree may be moistened by the numinous yang, and these scorched grasses may be graced by the sweet rains. I dare not speak at length; I only wish to be granted guidance.\"\n\nThe Lady of Supreme Primordium said: \"I do not possess these texts. Long ago, on Mount Guang, I encountered the Azure Perfected Youth, who held this golden script of secret characters. He said that to seek the Dao and prolong life, one must master a thousand threads and ten thousand strands—all requiring the arts of the *Five Thearchs and Six Jia* and the *Numinous Flight*, the names and designations of the *Six Ding and Six Ren*—to petition for life extension, attain long life and enduring vision, command the host of spirits, and employ the hundred deities. Without the essential matters of the *Six Jia*, even one who guards the *True Forms* will find no path to communion with the numinous. You have the heart for this, so I have told you of these texts. I hope you will broadly seek and inquire further.\"\n\nThe Emperor persisted in his entreaties, kowtowing until blood flowed. The Lady of Supreme Primordium said: \"I truly do not possess these texts. The reason I have shown you these twelve matters is to urge you to seek widely and amass them, that they may complement the use of the *True Forms*.\"\n\nThen the Queen Mother addressed the Lady of Supreme Primordium: \"The *True Forms* and precious writs are treasured by the numinous officials. This one has sought without ceasing, vowing to obtain them, so I have relaxed the prohibitions and made an exception to bestow them upon him. Yet the arts of the *Five Thearchs and Six Jia* for communing with the true and summoning spirits are subtle and remote; they demand utmost purity and sincerity, and are hardly suited for those of turbid and common nature. Now that I have granted the *True Forms* to this one, you, Lady, must instruct him in the path to summoning the numinous.\n\nI recall that long ago, you and I ascended the dark mounds of the northern wilds and the Radiant Perfected Mountain, where we met the Prince Youth of the Swine. The Prince Youth then entreated me for the *Hidden Writ of the Supreme*. I said that the *Secret Words of the Three Primordials* could not be transmitted even to mid-ranking immortals. You, Lady, also spoke then, supporting the Prince Youth’s resolve. Since I could not refuse his earnest plea, I did not withhold out of mere stinginess.\"",
      "overlap_context": " immortals who bear them do so as one would transmit a sacred text. When Daoists carry them while traversing mountains and rivers, the hundred spirits and myriad numina honor them and come forth to welcome them.\n\nThough you are not yet perfected, your repeated visits to mountains and marshes, your unwavering resolve to seek and inquire, have not forgotten the Way. Delighted by your sincerity, I now grant this to you. You must hold it in the deepest reverence, as though serving a lord or father.\"",
      "start_char": 5558,
      "end_char": 6329,
      "start_sentence": 216,
      "end_sentence": 238,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.315030336380005,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\汉武帝内传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "至於今日之事，有以相似。 后造朱火丹陵，食灵瓜，其味甚好。 忆此未久，而已七千岁矣。 夫人既已告彻篇目，十二事毕，必当匠而成之，何绿令人主启颗请乞，叩头流血邪？ 上元夫人曰：阿环不苟惜，向不持来耳。 此是太虚草文真人赤童所出，传之既自有男女之限禁，又宜授得道者，恐彻下才未应用此尔。 王母色不平，乃日：若天禁漏泄，犯违明科，传必其人，授必知真者，何绿夫人向下才而说灵飞之篇目乎？ 妄言则漏，妄说则泄，说而不传，是谓街天道，此禁岂轻於传也？ 别劫三官司，直推夫人之轻泄也。 吾之《五岳真形文》，乃太上天皇所出，其文宝妙，而为天仙之信，岂复应下授之於刘彻也邪？ 直以孜孜之心，数请川岳，勤修斋戒，以求神仙之应，志在度世，不遭明师，故吾等有以下吗之耳。 至於教仙之术，不复限惜而弗传。 夫人但有致灵之方，能独执之乎？ 吾今所以授彻真形文者，非谓其必能得道，欲使其精诚有验，求仙之不惑，可以诱进向化之徒。 又欲令悠悠者知天地问有此#53真之事，足以郁不信之狂夫耳。 吾意在是矣。 然此子性气淫暴，服精不纯，何能得成真仙，浮空参差十方乎？ 勤而行之，适足以不死耳。 明科所云，非长生难也，闻道难； 非闻道难也，行之难； 非行之难也，终之难。 良匠能与人规矩，不能使人必巧。 明师能授人妙术，不能使人必为。 何足其隐之也？ 夫人不尝忆向#54为长桑公子请吾，求八光挥疾药、玉树方乎？ 上元夫人有暂色，跪谢日：阿#55环昔初学道於广都之丘，建木丹诚，术数未成之时，倒景君、无常先生，此二人盖太清玄和天之灵官也，见授六甲左右灵飞方十二事。 初授之日，二君告阿环日：初学道者，听四十年一传，得道者，四百年一传，得仙者，四千年一传，得真者，四万年一传，得升太上者，四十万年一传。 女受传女，男受传男。 太上科禁，已表於昭生之符矣。 阿环受书已来，凡传六十八女子，贤大女郎抱兰，即阿环之弟子也。 阿环所授者，固不可以授男也。 伏见扶广山青真小童，往授#56太微中元君五帝六甲灵飞遁虚、天光左右策精等方，凡十二事，与阿环所受者同文，一无异也。 青真，男官也，未闻复有所授。 此子先是阿环学入火弟子，今正劲取，以授彻也。 先所以告彻篇目者，意是愍其有心，将欲坚其专气。 今且广求，他日与之，亦欲以男授男，承科而行，既勤而获，令知天真之珍贵，非徒苟执街泄天道矣。 本情如此，阿环主臣，愿不辜焉。 阿母真形之妙，灵人传信，天仙宝贵，封之金台，佩入紫微，乃经行而前，卫门大虎，却伏抱关，出过太清，则振身瑶房，左遨沧海，长揖束蒙，右接常阳，下盼版桐。 泛彼八海，则乘纠从龙，游此名山，则众真奉迎。 动有云输羽盖，静可长存永安，至卫洪矣，初不传地官，阿母今乃授於淫浊之尸，赐於枯骨之身，可谓太不宜矣。 况阿环有六甲下术，唯驱策百灵，致日月之华精，藏匿形影，化生万物，出入水火，唾叱杳冥，彻视反听，收束千精，乘虎豹以驱驰，采月华以长生，隐沦八地，回倒辰星，久视轻身，与天相倾耳。 安得及太上之灵书，八会之奇文乎？ 用之眇邈，可以游景灵之宫，纷纷讽讽，登流霞之堂，臣五岳之主，抱药醴之觞，驾九龙以虚腾，落紫鸿而玄翔邪？",
      "translated_text": "Here the matter bears some resemblance to that earlier occasion. Later, I journeyed to the Vermilion Fire Mound of Cinnabar, where I tasted the numinous melon—its flavor was most excellent. Yet though this memory seems recent, seven thousand years have already passed.\n\nSince you, Lady, have already revealed to him the titles of the scriptures and the twelve methods are complete, he must now craft and perfect them. Why then should one of his station kneel and beg, kowtowing until his forehead bleeds? The Supreme Primordial Lady said: \"It is not that I, Ahuan, am stingy—it is simply that I did not bring them with me. These are the texts issued by the Red Youth, Perfected of the Celestial Writ of the Great Void. Their transmission is bound by prohibitions of gender, and they ought to be conferred only upon those who have attained the Way. I fear that this one’s talents are not yet equal to their use.\"\n\nThe Queen Mother’s expression grew stern, and she said: \"If the celestial prohibitions are violated and the luminous statutes transgressed, transmission must be to the proper person, and conferral only to one who truly understands. Why then did you, Lady, speak to one of such modest talent of the titles of the *Numinous Flight* scriptures? Idle words leak, reckless speech divulges. To speak without transmitting is to trifle with the Dao of Heaven—this prohibition is no lighter than that of transmission itself. The Three Offices of the kalpas will surely hold you, Lady, accountable for this careless disclosure.\n\nMy *True Writ of the Five Marchmounts* was issued by the Celestial August Supreme. Its script is precious and wondrous, serving as the token of Heavenly Transcendents. How could it be fitting to bestow it upon Liu Che? It is only because of his earnest heart, his repeated petitions to the rivers and mountains, his diligent observance of purification rites in pursuit of a response from the divine immortals, and his aspiration to transcend the world—yet lacking a radiant teacher—that we have deigned to descend and grant him this. As for the arts of teaching immortality, we do not begrudge or withhold their transmission.\n\nBut do you, Lady, possess methods for summoning the numinous that you alone may withhold? The reason I now bestow upon him the *True Writ of the Realized Forms* is not because I believe he will necessarily attain the Way, but to validate his sincerity, to dispel his doubts in seeking immortality, and to guide and encourage those who turn toward transformation. I also wish to let the benighted know that such true matters exist between Heaven and Earth, enough to confound the reckless who refuse to believe. This is my intent.\n\nYet this one’s nature is lewd and violent, his refined essence impure. How could he become a true immortal, drifting through the ten directions of the void? If he diligently practices, it will suffice only to avoid death. As the luminous statutes declare: it is not attaining long life that is difficult, but hearing the Way; it is not hearing the Way that is difficult, but practicing it; it is not practicing it that is difficult, but persisting to the end. A skilled craftsman can give another the compass and square, but cannot ensure they will be skillful. A radiant teacher can impart wondrous arts, but cannot ensure they will be realized. Why then should you conceal them?\n\nDo you not recall, Lady, when on behalf of Master Longsang you entreated me for the *Eight Radiance Swift-Healing Elixir* and the *Jade Tree Formula*?\" The Supreme Primordial Lady’s countenance briefly shifted, and she knelt in apology, saying: \"Ahuan once began studying the Way on the mounds of Guangdu. In the days when I was still cultivating the cinnabar sincerity beneath the Jian Tree and my arts had not yet come to fruition, the Lord of the Inverted Scenery and the Master of No-Constancy—these two were the numinous officials of the Great Clarity and the Harmonious Heavens of the Supreme Purity—conferred upon me the twelve methods of the *Left and Right Numinous Flight of the Six Jia*. On the day they first transmitted them, the two lords told Ahuan: 'For one newly studying the Way, transmission occurs once every forty years; for one who has attained the Way, once every four hundred years; for one who has attained immortality, once every four thousand years; for one who has attained the Realized, once every forty thousand years; for one who ascends to the Supreme, once every four hundred thousand years. Women transmit to women, men to men. The statutes and prohibitions of the Supreme have already been inscribed upon the talismans of Illustrious Life.'\n\nSince receiving these texts, I have transmitted them to sixty-eight women. The worthy Great Lady Baolan is Ahuan’s disciple. What I have transmitted cannot be conferred upon men. I have observed that the Azure Perfected Youth of Fuguang Mountain once transmitted to the Central Primordial Lord of the Great Tenuity the twelve methods of the *Numinous Flight through the Void of the Six Jia of the Five Thearchs*, the *Left and Right Strategies of Celestial Radiance*, and other arts—identical in text to what I received, without a single difference. The Azure Perfected is a male official, and I have not heard of him transmitting them further. This one was once Ahuan’s disciple in the arts of entering fire. Now, at this very moment, I am taking them to confer upon Che. The reason I previously revealed the titles to him was to pity his earnestness and to strengthen his resolve to concentrate his qi. Now that he seeks them broadly, I will one day transmit them to him, also intending to confer upon a man as a man, in accordance with the statutes. Having diligently obtained them, he will know the preciousness of the celestial perfected, not merely trifling with or leaking the Dao of Heaven.\n\nMy original intent was thus. Ahuan, your servant, hopes not to be found wanting.\"\n\nThe wondrous subtlety of the Queen Mother’s *True Forms* is the token by which numinous beings transmit trust. The treasures of Heavenly Transcendents are sealed in golden caskets, worn to enter the Purple Tenuity. They proceed forward with their retinue, great tigers guarding the gates, crouching at the thresholds. Passing beyond the Great Clarity, they shake their bodies in the jade chambers, roaming the eastern seas to the left, bowing to the Eastern Mount, and reaching toward the Eternal Yang to the right. Below, they gaze upon the Fusang. Crossing the eight seas, they ride entwined dragons; traversing these renowned mountains, hosts of perfected welcome them. In motion, clouds and feathered canopies attend them; in stillness, they abide in eternal peace. Such is their majestic protection—yet these were never transmitted to the terrestrial officials. Now, Mother, you bestow them upon a corpse of lewd impurity, granting them to a body of dry bones. This is most unseemly.\n\nMoreover, Ahuan possesses the lesser arts of the Six Jia, which alone can command the hundred spirits, summon the radiant essence of the sun and moon, conceal one’s form and shadow, transform and give life to the myriad things, enter water and fire, spit and shout into the dark void, see backward and hear afar, gather and bind a thousand essences, ride tigers and leopards in swift pursuit, pluck the moon’s radiance to attain long life, vanish into the eight earths, reverse the turning of the stars, prolong vision and lighten the body, and incline toward Heaven. How could these compare to the numinous scriptures of the Supreme, the wondrous texts of the Eight Assemblies? Their use is subtle and remote, allowing one to wander the palaces of the luminous scenery, to ascend the halls of drifting rosy clouds in a whirl of fragrance, to serve as lord of the Five Marchmounts, to hold the goblet of medicinal liquor, to mount nine dragons in empty ascent, and to descend upon purple swans in dark flight.\"",
      "overlap_context": "\nI recall that long ago, you and I ascended the dark mounds of the northern wilds and the Radiant Perfected Mountain, where we met the Prince Youth of the Swine. The Prince Youth then entreated me for the *Hidden Writ of the Supreme*. I said that the *Secret Words of the Three Primordials* could not be transmitted even to mid-ranking immortals. You, Lady, also spoke then, supporting the Prince Youth’s resolve. Since I could not refuse his earnest plea, I did not withhold out of mere stinginess.\"",
      "start_char": 6329,
      "end_char": 7576,
      "start_sentence": 239,
      "end_sentence": 281,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.592557191848755,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\汉武帝内传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "王母笑曰：先失自可恕乎？ 上元夫人即命侍女纪离容径到扶广山，勃青真小童出六甲左右灵飞致神之方十二事，来以授彻也。 须臾侍女还，奉#57八色玉岌凤文之蕴#58，玄光明曜，真华伟焕，云青真小童问讯。 弟子阿昌言：向奉诣绛河，摄南真七元君检校草龙猛兽之数，事毕，过门受教，承阿母相邀，诣刘彻家，不意天灵至尊乃复下降於臭浊中也。 不审起居#59如何？ 侍女纪离容至，云尊欲得金书秘字六甲灵飞左右策精之文十二事，欲授刘彻#60辄封一通付信日#61：彻虽有心求慕，实非仙才，诅宜以此术传泄於行尸乎？ 阿昌近在帝处，见有上言者甚众，云山鬼哭於药林，孤魂号於绝域，兴师旅而族有功，忘赏劳而刑士卒，纵横白骨，奢#62扰黔首，淫酷自恣，罪已彰於太上，怨已见於夫气，嚣言互闻，必不得度世也。 真尊见劝，不敢违耳。 王母笑日：言此子者诚多愆，帝亦不必推也。",
      "translated_text": "Queen Mother of the West smiled and said, \"Could the earlier lapse truly be forgiven?\"\n\nThe Primordial Lady of the Upper Heavens then commanded her attendant, Ji Lirong, to proceed directly to Mount Fu Guang, where she summoned the Azure Perfected Youth to present the twelve methods of the Six Jia’s left and right spirit-flight techniques for summoning the divine, which were to be bestowed upon Liu Che.\n\nIn an instant, the attendant returned, bearing a case woven with eight-colored jade and phoenix-script patterns—its dark radiance resplendent, its true essence magnificent and dazzling—along with a greeting from the Azure Perfected Youth.\n\nThe disciple A Chang said, \"Earlier, I was ordered to the Crimson River to assist the Southern Perfected Seven Sovereigns of the Primordial in inspecting the tally of grass dragons and fierce beasts. Upon completing the task, I passed by the gate to receive instruction, where I learned that the Celestial Mother had invited me to the home of Liu Che. I never imagined that the august deities of Heaven would deign to descend into this foul and turbid realm. May I inquire after your well-being?\"\n\nWhen Attendant Ji Lirong arrived, she conveyed the exalted one’s desire to obtain the twelve sections of the golden script’s secret characters—the Six Jia’s spirit-flight techniques for commanding left and right essences—and to bestow them upon Liu Che. She sealed one copy and entrusted it to the messenger, saying, \"Though Liu Che ardently seeks and admires the Way, he is in truth no immortal talent. How could I dare disseminate this art to a mere walking corpse?\"\n\nA Chang, having recently been in the imperial presence, had witnessed many memorials submitted to the throne: mountain spirits weeping in the herb groves, lonely souls wailing in distant lands, armies raised and clans rewarded for merit, yet soldiers forgotten in reward and punished in service, white bones strewn across the land, the common folk oppressed by extravagance and turmoil, cruelty and debauchery run rampant, sins already manifest before the Supreme, resentments already visible in the qi of the people, clamorous voices heard on all sides—he could never attain transcendence.\n\nThe Perfected One, moved by these admonitions, dared not refuse.\n\nQueen Mother of the West smiled and said, \"This child’s transgressions are indeed many, but the Emperor need not be so harsh in judgment.\"",
      "overlap_context": "g vision and lighten the body, and incline toward Heaven. How could these compare to the numinous scriptures of the Supreme, the wondrous texts of the Eight Assemblies? Their use is subtle and remote, allowing one to wander the palaces of the luminous scenery, to ascend the halls of drifting rosy clouds in a whirl of fragrance, to serve as lord of the Five Marchmounts, to hold the goblet of medicinal liquor, to mount nine dragons in empty ascent, and to descend upon purple swans in dark flight.\"",
      "start_char": 7576,
      "end_char": 7934,
      "start_sentence": 282,
      "end_sentence": 290,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.207689762115479,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\汉武帝内传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "夫好道慕仙者，精诚志念，斋戒思愆，辄除过一月。 克己反善，奉敬真神，存真守一，行此一月，辄除过一年。 彻念道累年，齐亦勤积，屡祷名山真灵，愿求度脱。 校计功过，殆以相掩。 但自今已去，勤修至诚，奉上元夫人之言，不宜复奢淫暴虐，使万兆劳残，怨魄穷鬼有破掘之诉、流血之尸，忘功赏之辞耳。 於是上元夫人离席起立，手执八色玉岌凤文之蕴，仰天向帝而祝日： 九天浩洞，太上曜灵，神照玄寂，清虚朗明，登虚者妙，守气者生，至念道臻，寂感真诚，役神形辱，安精年荣。 授彻灵飞及此六丁左右招神天光策精，可以步虚，可以隐形，长生久视，还白留青。 我传有四万之纪，授彻传在四十之龄，违犯泄漏，必沉於幽冥#63，必慎其祸#64，敢告刘生，尔师主是青童小君，太上中黄道君之师真，元始天王入室弟子也。 姓延陵，名阳，字庇华。 形有婴孩之貌，故仙官以青真小童之号。 其为器也，环朗洞照，圣周万变，玄镜幽鉴，才为真伪，游于扶广，权此始运，宫馆玄圃，治仙职分。 子存师君，从尔所愿。 不存所授，命必倾陨。 上元夫人祝毕，乃一一手指所施用节度示帝#65。 第一篇有五帝六甲左右灵飞之符。 第二篇有六丁通真遁虚玉女之录。",
      "translated_text": "Those who cherish the Dao and yearn for transcendence—if they concentrate their essence and sincerity, their will and thought, fasting and reflecting on their transgressions—may eliminate a month’s worth of faults in a single month. If they restrain themselves and return to goodness, revering the Perfected Spirits, preserving their true nature and guarding Unity, practicing this for a month, they may eliminate a year’s worth of faults. A Chang has pondered the Dao for many years, and his fasting and accumulation of merit have been diligent. He has repeatedly prayed to the true spirits of the famous mountains, wishing to seek deliverance. When weighing his merits against his faults, they nearly balance. Yet from this day forward, he must cultivate utmost sincerity, heed the words of the Lady of the Primordial Dawn, and no longer indulge in extravagance, debauchery, or cruelty, lest the myriad masses suffer and perish, lest the resentful souls and destitute ghosts raise accusations of desecration and corpses drenched in blood, and lest the words of reward for merit be forgotten.\n\nThereupon, the Lady of the Primordial Dawn rose from her seat, holding in her hand a scroll of eight-colored jade inscribed with phoenix patterns. She raised her gaze to the heavens and prayed to the Emperor, saying:\n\n\"Vast are the Nine Heavens, radiant is the Supreme Luminance. The divine shines upon the mysterious and tranquil, the pure and void, bright and clear. Those who ascend the void attain subtlety; those who guard their qi attain life. When utmost devotion to the Dao is reached, the tranquil responds to true sincerity. To toil the spirit and humiliate the form is to secure peace, essence, longevity, and glory. I bestow upon A Chang the *Lingfei* and the Six Ding spirits of the left and right, the *Celestial Light* and *Essence-Strategy*, with which he may tread the void, conceal his form, attain long life and enduring vision, and restore youth, leaving white hair behind while retaining black.\n\nMy transmission spans forty thousand cycles; A Chang’s transmission occurs at the age of forty. Should he violate or leak these teachings, he will surely sink into the dark netherworld. Beware this calamity! I dare to admonish you, Liu, that your master is the Lesser Lord of the Azure Youth, the true master of the Central Yellow Dao Lord of the Supreme, and an inner-chamber disciple of the Celestial King of the Primordial Beginning. His surname is Yanling, his given name Yang, and his courtesy name Bihua. His form bears the appearance of an infant, hence the immortals’ title of *Azure Perfected Lesser Youth*. As for his vessel, it is luminous and all-encompassing, sagely and all-adaptive, a mysterious mirror that discerns the obscure, a talent that distinguishes truth from falsehood. Roaming the boundless, wielding the primal authority, his palace abides in the Mystic Garden, where he governs the duties of transcendents. Should you honor your master, your wishes shall be fulfilled. Should you neglect what is transmitted, your life will surely collapse.\"\n\nWhen the Lady of the Primordial Dawn finished her prayer, she pointed with her hand to each of the instructions and methods she had bestowed upon the Emperor. The first scroll contained the talismans of the Five Thearchs and the Six Jia spirits of the left and right, the *Lingfei*. The second scroll contained the records of the Six Ding spirits, the *Passage to the True and Concealment of the Void*, and the Jade Maidens.",
      "overlap_context": "white bones strewn across the land, the common folk oppressed by extravagance and turmoil, cruelty and debauchery run rampant, sins already manifest before the Supreme, resentments already visible in the qi of the people, clamorous voices heard on all sides—he could never attain transcendence.\n\nThe Perfected One, moved by these admonitions, dared not refuse.\n\nQueen Mother of the West smiled and said, \"This child’s transgressions are indeed many, but the Emperor need not be so harsh in judgment.\"",
      "start_char": 7934,
      "end_char": 8417,
      "start_sentence": 291,
      "end_sentence": 307,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.009080410003662,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\汉武帝内传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "第三篇有太阳六戊招神天光策精之书。 第四篇有左乙混沌束蒙之文。 第五篇有右庚素收摄#66杀之律。 第六篇有壬癸六遁隐地八术之方。 第七篇有丙丁入火九赤班文之符。 第八篇有六辛入金致黄水月华之法。 第九篇有六巳石精金光藏影化形之方。 第十篇有子午卯酉八禀十诀六灵威仪。 第十一篇有辰戌丑未地真曲素之诀长生紫书地三五顺行。 第十二篇有寅申己亥紫度炎光内视中方。 凡十二事都毕，因复告帝日：夫五帝者，方面之天精。 六甲#67六位之通灵。 太阴有潜空之妙，遁灵履机之神，秋含春挺，千真之生，动则寂应成波，静则川陵缅平，所以毫末不移，浩岳可倾。 赫哉，太阳之招神，策万灵而驱驰。 六戊飞而神畅，天光因景以扬晖，西乡激电而砰磕，束桑空震以成雷。 盖阳灵之日，丙赫实九天之元威。 左乙混洞，万物始通，阳微其升，苍晖应龙，轻云扬景，讽胎潜风，神眇集於有宅，真感应而必锺，万春回始，是为束蒙。 右庚素秋，敛散聚黑，摄万神而我役，白虎动以彭勃，少女起而通真，延九天之陌视，金精地灵，来为身卫，诚彼邪恶，故称摄杀之律。 壬癸六遁，沉沦无根，藏蔽万锋，移行丘山，隐地匿影，崩流塞川，八术六奇，万胜常全，佩我六遁，久视长存。 丙丁入火，凌烟云漠，九赤龙书，翳蔚朗焕，尔用斑符，致千灵以朝谒，乃由丙神回丹火以冲散，炎光上卫，妙乎异观。 六辛入金，飞害销磨，致日精，得阳光之珠，求月魄，获黄水之华，能致八石之灵菌，能引扶桑之丹霞，酣云浆於丹庭，腾碧川於玄河，其用少矣，有益盖多。 佩此六辛，必造我家。 六巳石精，金液流光，变化万端，千载孰当。 佩我六巳，易形游行，长生毕天，无复始终，元哉已书，甚要难冲。 子午卯酉，大神四界，方面峙镇，八禀十诀，降灵之来，必由斋祭。 万事取成於精慎，千神求通於此术，知我名字，天人可致。 丑辰未戌，地真之符，游行五岳，当用紫书，曲素诀辞，可以凌虚，三五顺行，与灵同车。 寅申巳亥，可禳飞灾，紫度炎光，内视反听，神辞通达，六甲收摄，地司游天，践地与真，不疑夫此。 十二事者，上帝封於玄景之台，子其秘慎之焉。 王母曰：此皆太灵草文，并三天太上所撰，或三皇天真所造校定，或九天父母真人赤童所出，此辈书符藏之#68於紫陵之台，隐以灵坛之房，封以华琳之函，蕴以兰简之帛，约以北罗之素，印以太帝之玺。 诸名真贵灵，下游山川，看林岫以眇视，察有心之学夫。 或告之以道德，或传之以天符。 诸学道未成者，受此书文，听四十年授一人。 如无其人，八十年可顿授二人。 得道者，四百年授一人。 无其人，八百年并授二人。 得仙者，四千年授一人。 知无其人，八千年可顿授二人。 得真者，四万年授一人。 如无其人，八万年顿授二人。 升太上者，四十万年授一人。 传非其人，是为泄天道。 可授而不传，是为闭天宝。 不计限而妄授者，是为轻天老。 受而不敬，是为慢天藻。 泄闭轻慢，四者取死之刀斧，延祸之车乘也。 泄之者身死道路，受土形而骸裂。 闭则目盲耳聋於来生，命凋枉而卒没。 轻则锺祸於父母，诣玄都而考罚。 慢则暴终而堕恶道，生弃疾於后世。",
      "translated_text": "The third scroll contains the *Book of the Six Wu of the Great Yang, Summoning Spirits and the Celestial Radiance’s Strategic Essence*. The fourth scroll contains the *Writ of the Left Yi, the Primordial Chaos and the Binding of Meng*. The fifth scroll contains the *Statutes of the Right Geng, the White Refinement and the Restraint of Slaying*. The sixth scroll contains the *Methods of the Six Dun of Ren and Gui, the Eight Arts of Concealment and Earthly Seclusion*. The seventh scroll contains the *Talismans of Bing and Ding Entering Fire, the Nine Crimson Striated Writ*. The eighth scroll contains the *Methods of the Six Xin Entering Metal, Attracting the Yellow Water and the Moon’s Splendor*. The ninth scroll contains the *Methods of the Six Si, the Stone Essence and the Concealment of the Golden Radiance’s Shadow to Transform Form*. The tenth scroll contains the *Eight Endowments and Ten Secrets of Zi, Wu, Mao, and You, the Sixfold Numinous Demeanor*. The eleventh scroll contains the *Secrets of the Earthly True and the Unadorned of Chen, Xu, Chou, and Wei, the Purple Writ of Longevity and the Three-Five Sequential Progression of Earth*. The twelfth scroll contains the *Purple Measure and the Blazing Radiance of Yin, Shen, Si, and Hai, the Inner Vision of the Central Realm*.\n\nWhen all twelve matters were complete, she again addressed the Emperor, saying: \"The Five Thearchs are the celestial essences of the cardinal directions. The Six Jia are the numinous conduits of the six positions. The Great Yin possesses the subtlety of latent emptiness, the divine spirit of the *Dun* that treads the mechanism of opportunity. Autumn harbors the sprouting of spring, giving birth to a thousand truths. When it moves, stillness responds in waves; when it rests, rivers and mountains settle into vast tranquility. Thus, not even the tip of a hair shifts, yet the loftiest peaks may be toppled.\n\nHow majestic is the Great Yang’s summoning of spirits, driving the ten thousand numina to swift obedience! The Six Wu take flight, and the spirits rejoice; the celestial radiance kindles brilliance in the light. To the west, lightning flashes and thunder resounds; at the Mulberry Fields, the void trembles to form thunder. This is the day of the yang spirit, when Bing’s fiery might manifests the primal authority of the Nine Heavens.\n\nThe Left Yi’s chaotic vastness is where the myriad things first communicate. As yang subtly ascends, the azure radiance responds with the coiled dragon. Light clouds waft their splendor, whispering winds stir the unborn; the divine, though faint, gathers in its abode, and the true resonance must inevitably converge. When the myriad springs return to their beginning, this is called the *Binding of Meng*.\n\nThe Right Geng’s white autumn gathers the scattered and assembles the dark. It commands the ten thousand spirits to serve me; the White Tiger stirs with boundless vigor, and the Maiden of Metal arises to commune with the true. Extending the gaze of the Nine Heavens’ paths, the metal essence and earthly numen come to guard the body. Against those who harbor malice, it is thus called the *Statute of Restraint and Slaying*.\n\nThe Six Dun of Ren and Gui sink into rootless depths, concealing the myriad blades. They traverse hills and mountains, hide in the earth, and obscure their shadows. They dam the rushing currents and block the rivers. The Eight Arts and Six Strategies ensure everlasting victory. Those who bear my Six Dun shall abide in enduring vision and eternal life.\n\nBing and Ding enter fire, soaring through the misty clouds. The Nine Crimson Dragon Writ shines with dazzling brilliance. When you employ these striated talismans, a thousand spirits will come to pay homage. Thus, the spirit of Bing revolves the cinnabar fire to disperse obstructions, and the blazing radiance ascends as a guard—marvelous beyond compare.\n\nThe Six Xin enter metal, dissolving harm and grinding away obstacles. They attract the essence of the sun to obtain the pearl of yang radiance, and seek the moon’s spirit to acquire the blossom of the Yellow Water. They can summon the numinous fungi of the Eight Stones and draw the cinnabar clouds of Fusang. They revel in the cloud nectar of the cinnabar court and soar upon the azure rivers of the Mystic River. Though their use is slight, their benefits are manifold. Those who bear these Six Xin shall surely reach my abode.\n\nThe Six Si’s stone essence flows with golden liquid radiance, transforming in myriad ways—who could withstand it for a thousand years? Those who bear my Six Si shall change form and roam freely, attaining longevity that spans the heavens without beginning or end. How profound is this writ—most essential and difficult to fathom!\n\nZi, Wu, Mao, and You are the great deities of the four quarters, standing sentinel at the cardinal boundaries. The Eight Endowments and Ten Secrets summon the descent of spirits, which must be preceded by purification and sacrifice. All affairs are accomplished through meticulous care, and the thousand spirits seek communion through this art. Know my name, and celestial beings may be summoned.\n\nChou, Chen, Wei, and Xu are the talismans of the Earthly True. Roaming the Five Marchmounts requires the Purple Writ. The secrets of the Unadorned and the arcane incantations enable one to ascend the void. Following the Three-Five sequence, you shall ride with the spirits as in the same chariot.\n\nYin, Shen, Si, and Hai can dispel flying calamities. The Purple Measure and Blazing Radiance, inner vision and reversed hearing, divine incantations that penetrate, the Six Jia that gather and restrain—earthly officials roam the heavens, treading the earth with the true. Have no doubt in this.\n\nThese twelve matters were sealed by the Thearch upon the Terrace of the Mystic Radiance. Guard them with utmost secrecy.\n\nThe Queen Mother of the West said: \"These are all the numinous writings of the Great Spirit, compiled by the Supreme Three Heavens, or edited and finalized by the Celestial Perfected of the Three Sovereigns, or revealed by the Red Youths, the True Parents of the Nine Heavens. Such talismanic texts are concealed in the Terrace of Purple Mounds, hidden within the chambers of the Numinous Altar, sealed in caskets of resplendent jade, wrapped in silk of orchid and bamboo slips, bound with plain silk of the northern weave, and stamped with the seal of the Supreme Thearch.\n\nThe various noble and numinous perfected ones descend to roam the mountains and rivers, gazing upon the forests and peaks with distant vision, observing those who study with sincerity. Some instruct them in the Dao and virtue, while others transmit to them celestial talismans.\n\nFor those who have not yet completed their study of the Dao, these writings may be transmitted to one person every forty years. If no suitable recipient exists, two may be taught at once after eighty years. Those who have attained the Dao may transmit them to one person every four hundred years. If no suitable recipient exists, two may be taught at once after eight hundred years. Those who have attained immortality may transmit them to one person every four thousand years. If no suitable recipient exists, two may be taught at once after eight thousand years. Those who have attained the True may transmit them to one person every forty thousand years. If no suitable recipient exists, two may be taught at once after eighty thousand years. Those who ascend to the Supreme may transmit them to one person every four hundred thousand years.\n\nShould they be transmitted to an unworthy recipient, this is called *leaking the Heavenly Dao*. To withhold transmission when a worthy recipient exists is called *sealing the Heavenly Treasure*. To transmit recklessly without regard for the proper limits is called *trifling with the Heavenly Elder*. To receive them without reverence is called *disdaining the Heavenly Ornament*. Leaking, sealing, trifling, and disdaining—these four are the blades and axes that bring death, the chariots that extend misfortune.\n\nThose who leak them shall die by the roadside, their bodies reduced to dust and their bones shattered. Those who seal them shall be struck blind and deaf in their next life, their fate withering and their end untimely. Those who trifle shall bring calamity upon their parents and be summoned to the Dark Capital for punishment. Those who disdain shall meet a violent end and fall into evil destinies, casting aside infirmities upon future generations.\"",
      "overlap_context": ". Should you neglect what is transmitted, your life will surely collapse.\"\n\nWhen the Lady of the Primordial Dawn finished her prayer, she pointed with her hand to each of the instructions and methods she had bestowed upon the Emperor. The first scroll contained the talismans of the Five Thearchs and the Six Jia spirits of the left and right, the *Lingfei*. The second scroll contained the records of the Six Ding spirits, the *Passage to the True and Concealment of the Void*, and the Jade Maidens.",
      "start_char": 8418,
      "end_char": 9656,
      "start_sentence": 308,
      "end_sentence": 357,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.011582374572754,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\汉武帝内传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "复有愈兹罪者，则宗断而族灭。 同道谓之天亲，同心谓之地爱。 为道者当相亲授，共均荣辱，营守真一，珍惜精液，恭养和气。 气全神归，必齐灵会。 如其不尔，天降尔疠。 此皆道之科禁，今故相诫，不可不慎。 然此法宜传，但当以年限齐之尔。 若便有其人，不必须限讫而授之也。 汝欲授五岳真形者，董仲舒似其人也。 欲行六甲灵飞左右之符者，可传李少君。 此二人得道者也。 王母又命侍女宋灵宾更取一图与帝。 灵宾探怀中得一卷，盛以云锦之囊，形书精明，俱如向巾器中者。 王母起立，手以付帝。 又祝日：天高地卑，五岳镇形。 元津激黑，沧泽玄精。 天回九道，六和长平。 太上八会，飞天之成。 真倦节信，由兹通灵。 泄坠灭腐，实归长生，彻其慎之，敢告刘生。 祝毕，授帝。 帝拜稽首。",
      "translated_text": "Those who exceed even these transgressions shall face the severing of their lineage and the annihilation of their clan.\n\nThose who share the Dao are called *Heavenly Kin*; those who share the same heart are called *Earthly Love*. Those who pursue the Dao ought to transmit with mutual affection, sharing glory and disgrace alike, tending the True Unity, treasuring their essence and vital fluids, and reverently nurturing harmonious qi. When qi is whole and spirit returns, they shall surely join the assembly of the numinous.\n\nShould they fail in this, Heaven shall send down pestilence upon them. These are the statutes and prohibitions of the Dao, and thus I now admonish you—you must not be careless.\n\nYet this method is meant to be transmitted, though it should be regulated by the proper time limits. If one is truly worthy, there is no need to wait until the limit is reached before bestowing it.\n\nIf you wish to transmit the *True Forms of the Five Peaks*, Dong Zhongshu is a fitting recipient. If you wish to impart the *Six Jia Spirit-Flight Talismans of the Left and Right*, you may transmit them to Li Shaojun. These two are those who have attained the Dao.\n\nThe Queen Mother then commanded her attendant, Song Lingbin, to retrieve another diagram for the Emperor. Lingbin reached into her robe and produced a scroll, encased in a cloud-brocade pouch, its script and form as radiant and precise as those in the earlier vessel. The Queen Mother rose and placed it into the Emperor’s hands with her own.\n\nShe then pronounced this incantation:\n*\"Heaven is high, Earth is low,\nThe Five Peaks anchor form.\nPrimordial streams surge dark,\nDeep marshes yield dark essence.\nHeaven revolves through nine paths,\nSix Harmonies sustain balance.\nThe Eight Assemblies of the Most High,\nAchieve the flight of celestial beings.\nTrue weariness, steadfast trust—\nThrough these, the numinous is reached.\nLeaked or lost, decayed or spoiled,\nYet true attainment leads to long life.\nGrasp this well and be vigilant—\nI dare to instruct you, Liu!\"*\n\nWith the incantation complete, she bestowed it upon the Emperor. The Emperor bowed, touching his forehead to the ground.",
      "overlap_context": "ng death, the chariots that extend misfortune.\n\nThose who leak them shall die by the roadside, their bodies reduced to dust and their bones shattered. Those who seal them shall be struck blind and deaf in their next life, their fate withering and their end untimely. Those who trifle shall bring calamity upon their parents and be summoned to the Dark Capital for punishment. Those who disdain shall meet a violent end and fall into evil destinies, casting aside infirmities upon future generations.\"",
      "start_char": 9656,
      "end_char": 9963,
      "start_sentence": 358,
      "end_sentence": 379,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.194269180297852,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\汉武帝内传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "王母曰：夫始学道符者，宜别祭五岳诸仙真灵，洁斋而佩之。 今亦以六甲杂事，须用节度相与，可明依案之也。 若女遂克明正身，反恶修善，复#69三年七月‘，更来告女要道也。 须臾，殿南朱雀窗中忽有一人来窥看仙官，帝惊问：何人？ 王母曰：女不识此人邪？ 是女侍郎束方朔，是我邻家小兄也。 性多滑稽，曾三来偷此桃。 此子昔为太上使#70，令到方丈#71助三天司命收录仙家。 朔到方丈，但务山水游戏，了不共营和气，擅弄雷电，激波扬风。 风雨失时，阴阳错逢，致今蛟鲸陆行，山崩境坏，海水暴竭，黄乌宿渊，妨农芸田。 沉湎玉酒，失部御之和，亏奉命之科。 於是九源丈人乃言之於太上，太上遂谪斥，使在人问，去太清之朝，令处见浊之乡。 近金华山二仙人及九疑君比为陈乞，以行原之。 於是帝乃知朔非世俗之徒也，时酒酣周宴言请粗毕，上元夫人自弹云林之傲，呜弦骇调，清音灵朗，玄风四发，乃歌步玄之曲。 辞日：昔涉玄真道，腾步登太霞。 负岌造天关，借问太上家。 忽过紫微垣，真人列如麻。 绿景清讽起， 灵盖映朱葩。 兰宫敞琳阙，碧空启谲沙。 丹台结空构，纬纬生光华。 飞凤跟甍峙，烛龙倚委蛇。 玉胎来绛苗，九色纷相挚。 抱景练仙骸，万劫方童牙。 谁言寿有终，扶桑不为查。 王母又命侍女田四飞答歌日： 晨登太霞宫，抱此八玉兰。 夕入玄元阙，采药攘琅牙。 洒足匏瓜河，织女立津盘。 吐纳抱景云，味之当一餐。 紫微何济济，谲轮复朱丹。 朝发汗漫府，暮宿句陈垣。 去去道不同，且各体所安。 二仪设犹存，奚疑亿万桩。 莫与世人说，行尸言此难。 歌毕，因告武帝仙官从者姓名，及冠带执佩物名，所以得知而纪焉。 至明旦，王母别去。 上元夫人谓帝日：夫李少君者，专念精进，理妙微密，必得道矣。 其似未有六甲灵飞之文，女当可以示之。 帝曰：诺。",
      "translated_text": "Queen Mother spoke: \"Those who first study the Daoist talismans should separately offer sacrifices to the Five Peaks and the various perfected immortals, purify themselves through fasting, and then wear them. Now, with these miscellaneous matters of the Six Jia, one must observe proper regulations and coordinate accordingly—this should be clearly followed as prescribed.\n\nIf you can diligently cultivate integrity, correct your conduct, turn from evil to practice goodness, then after three years and seven months, return to inform me of your desire for the essential Dao.\"\n\nPresently, from the Vermilion Bird window south of the hall, a figure suddenly appeared, peering in at the immortal officials. The Emperor, startled, asked, \"Who is that?\"\n\nQueen Mother replied, \"Do you not recognize this person? He is your attendant, Dongfang Shuo, my neighbor’s younger brother. His nature is playful and witty, and he has come three times to steal these peaches. Long ago, this man served as an emissary of the Most High, sent to Fangzhang to assist the Three Heavens’ Registrar of Destiny in recording the affairs of the immortals. Yet when Shuo arrived at Fangzhang, he indulged only in wandering among mountains and waters, neglecting to cultivate harmonious qi. Instead, he wantonly manipulated thunder and lightning, stirred waves, and summoned winds. The winds and rains fell out of season, yin and yang clashed, causing dragons and whales to crawl on land, mountains to collapse, borders to crumble, and the sea to dry up violently. The Yellow Bird nested in the abyss, and farming suffered. Drunk on jade wine, he lost the harmony of his office and failed in his mandated duties. Thus, the Elder of the Nine Springs reported this to the Most High, who then demoted and banished him to the mortal realm, exiling him from the court of the Great Clarity to dwell in this turbid land. Recently, the two immortals of Jinhua Mountain and the Lord of Jiuyi petitioned on his behalf, seeking clemency.\"\n\nThereupon, the Emperor realized Shuo was no ordinary mortal. As the feast neared its end and the wine flowed freely, the Supreme Primordial Lady herself plucked the *Cloud Forest* zither, her fingers striking awe-inspiring melodies. The pure notes rang clear, and a profound breeze spread in all directions. She then sang the *Step of the Mysterious* aria:\n\n*\"Long ago, I trod the true Dao of the Mysterious,\nAscending on soaring steps to the Great Rosy Clouds.\nBearing the steep peaks, I reached the Gate of Heaven,\nAnd asked where the Most High’s abode might be.\nSuddenly passing the Purple Tenuity Enclosure,\nI saw perfected ones arrayed like hemp.\nGreen auroras rose in clear recitation,\nAnd numinous canopies gleamed with crimson blossoms.\nThe Orchid Palace opened its jasper gates,\nWhile azure skies unveiled their wondrous sands.\nCinnabar terraces wove empty structures,\nShimmering with radiant light.\nFlying phoenixes perched on ridgepole peaks,\nAnd the Torch Dragon coiled in sinuous repose.\nJade embryos came from scarlet sprouts,\nNine hues intertwining in profusion.\nEmbracing the light, I refined my immortal bones—\nThrough ten thousand kalpas, I remained youthful.\nWho says life must have an end?\nThe Fusang tree does not wither.\"*\n\nQueen Mother then commanded her attendant, Tian Sifei, to respond with a song:\n\n*\"At dawn, I ascend the Palace of Great Rosy Clouds,\nEmbracing these eight jade orchids.\nAt dusk, I enter the Gate of the Mysterious Origin,\nGathering herbs and plucking stalks of jasper.\nI wash my feet in the Gourd River,\nWhere the Weaving Maiden stands by the ford.\nInhaling and exhaling the auroras,\nTheir savor suffices for a single meal.\nHow majestic is the Purple Tenuity!\nIts wondrous wheels glow crimson.\nAt dawn, I depart from the Boundless Court,\nBy dusk, I lodge within the Enclosure of the Curved Array.\nGoing our separate ways, our paths diverge—\nEach must abide in what brings peace.\nThe Two Modes endure as ever,\nWhy doubt the myriad eons?\nDo not speak of this to worldly folk—\nThe walking corpses would find these words hard to bear.\"*\n\nWhen the songs concluded, she proceeded to inform Emperor Wu of the names of the immortals’ attendants, as well as the names of their headdresses, sashes, and ritual implements—so that he might record them.\n\nAt daybreak, Queen Mother took her leave. The Supreme Primordial Lady then said to the Emperor, \"As for Li Shaojun, he is wholly devoted to diligent cultivation, his principles subtle and profound—he is certain to attain the Dao. However, he seems not yet to possess the *Six Jia Numinous Flight* texts. You should present them to him.\"\n\nThe Emperor replied, \"Very well.\"",
      "overlap_context": "yield dark essence.\nHeaven revolves through nine paths,\nSix Harmonies sustain balance.\nThe Eight Assemblies of the Most High,\nAchieve the flight of celestial beings.\nTrue weariness, steadfast trust—\nThrough these, the numinous is reached.\nLeaked or lost, decayed or spoiled,\nYet true attainment leads to long life.\nGrasp this well and be vigilant—\nI dare to instruct you, Liu!\"*\n\nWith the incantation complete, she bestowed it upon the Emperor. The Emperor bowed, touching his forehead to the ground.",
      "start_char": 9963,
      "end_char": 10677,
      "start_sentence": 380,
      "end_sentence": 419,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.489095449447632,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\汉武帝内传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "於是夫人与王母同乘而去。 临发，人马龙虎，威仪如初来时。 云气勃蔚，尽为香气，极望西南，良久乃绝。 於是帝既见王母及上元夫人，乃信天下有神仙之事，亦有欲去世计数矣。 而淫色恣性，杀伐不休，兆人怨於劳役，死者怨於无辜。 其年作甘泉宫、通天台，长安辈廉馆。 朝鲜王攻辽束都尉，乃募天下死罪击朝鲜。 八月甘泉宫内生苗草九茎，诏日：甘泉宫中产苗九茎联叶，上帝博临，不异下房，赐朕弘休，其大赦天下，赐云阳都百户牛酒，作苗房之歌。 至元封三年春，作角纸戏三百人。 至元封四年，又行幸雍祠五时。",
      "translated_text": "Then the Lady and the Queen Mother departed together in the same carriage. As they set off, their retinue of men and horses, dragons and tigers, and their majestic procession were just as they had been upon arrival. Clouds billowed and swirled, transforming entirely into fragrant mist; gazing southwest, the sight lingered long before fading away.\n\nAfter witnessing the Queen Mother and the Supreme Primordial Lady, the Emperor came to believe that divine immortals indeed existed in the world, and he began to consider plans for leaving the mortal realm. Yet he remained indulgent in sensual pleasures, unrestrained in his nature, and ceaseless in warfare. The people groaned under the burden of labor, and the dead lamented their unjust fates.\n\nThat year, he constructed the Gansui Palace and the Tower of Communion with Heaven, as well as the Lianlian Lodge in Chang’an. The King of Chaoxian attacked the eastern commandery of Liaodong, prompting the Emperor to recruit condemned criminals from across the land to strike back. In the eighth month, nine stalks of grain sprouted within the Gansui Palace. He issued an edict: *\"Nine stalks of grain with conjoined leaves have grown in the Gansui Palace—Heaven’s vast presence descends no differently than in a humble chamber. The August One bestows upon me great favor; let there be a general amnesty throughout the land. Grant the households of Yunyang a hundred oxen and wine, and compose the Song of the Grain Chamber.\"*\n\nBy the third year of the *Yuanfeng* era, he had assembled three hundred performers for the *Jiaodi* games. In the fourth year of *Yuanfeng*, he again journeyed to Yong to offer sacrifices to the Five Sacrificial Altars.",
      "overlap_context": "e immortals’ attendants, as well as the names of their headdresses, sashes, and ritual implements—so that he might record them.\n\nAt daybreak, Queen Mother took her leave. The Supreme Primordial Lady then said to the Emperor, \"As for Li Shaojun, he is wholly devoted to diligent cultivation, his principles subtle and profound—he is certain to attain the Dao. However, he seems not yet to possess the *Six Jia Numinous Flight* texts. You should present them to him.\"\n\nThe Emperor replied, \"Very well.\"",
      "start_char": 10677,
      "end_char": 10908,
      "start_sentence": 420,
      "end_sentence": 429,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.588094234466553,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\汉武帝内传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "至元封五年，行内守，至於盛唐祠虞舜，于九疑登湾山、天柱山。 春三月还至泰山，增封甲子、，祠高祖于明堂，以配上帝。 因朝诸侯王。 元封六年，行幸回中r作首山宫。 三月行幸河束，词后土。 又先以元封二年七月七日，西王母、上元夫人下降於武帝。 王母授帝《五岳真形图灵》、《光生经》，上元夫人授六甲灵飞招真十二事。 王母及上元夫人见帝之日，多所称说，或延年之诀，致神灵之法，或乘虚之数，步玄之术，诸要妙辞，帝乃自撰为一卷，及所授真形经书、六甲灵飞之事，帝乃盛以黄金之箱，封以白玉之函，珊瑚为轴，紫锦为帏囊，安着梧梁台上。 数自斋戒。 整衣服，亲诣朝拜，烧香盥漱，然后执省之焉。 帝自受书已来，出入六年，意旨自畅，高韵自许，云以为神真见降，必当度世。 强悍气力，不修至诚。 乃兴起台馆，劳弊百姓，坑杀降卒，远征夷狄，路盈怨叹，流血皋城，每事不从王母之深言、上元夫人之妙诚，王母#72遂不复来也。 到太初元年十一月乙酉#73，天火烧相梁台，於是《真形图》#74者凡四卷，共函烧失。 王母尝#75以武帝不能从训，故以火灾之耳。 但帝先承王母言，以元封三年七月斋戒，以《五岳真形图》授董仲舒登受。 帝又承上元夫人言，以元封四年七月斋戒，以五帝六甲灵飞十二事授李少君登写受。 此书得传行於世者，先传此二君以存矣。 帝既失书，悔不行德，自知道丧。 其后束方朔一旦乘云龙飞去，同时众人见从西北上，再仰望#76，大雾覆之，不知所在。 帝愈懊恼，其年禅蒿．里，祠后土，束临渤海，望祠蓬莱－－仰天自誓，重要灵应，而终无感。 春还，受计於甘泉。 二月，起建章宫。",
      "translated_text": "By the fifth year of *Yuanfeng*, he conducted an inner tour of the ancestral temples, proceeding to the Shengtang Shrine to sacrifice to Yu Shun and ascending Mount Wan at Jiuyi and Mount Tianzhu. In the third month of spring, he returned to Mount Tai, expanding its sacred enclosure on the *jiazi* day. He sacrificed to his august ancestor Gaozu in the Hall of Light, offering him as associate to the Supreme God. There he received the feudal lords and kings in audience.\n\nIn the sixth year of *Yuanfeng*, he journeyed to Huizhong and constructed the Shoushan Palace. In the third month, he traveled to the region east of the Yellow River to sacrifice to the Earth Queen. Earlier, on the seventh day of the seventh month in the second year of *Yuanfeng*, the Queen Mother of the West and the Upper Prime Lady descended before Emperor Wu. The Queen Mother bestowed upon him the *True Forms of the Five Peaks* and the *Scripture of Radiant Life*, while the Upper Prime Lady conferred the *Twelve Arts of the Numinous Flight of the Six Jia Spirits*. On the day the Queen Mother and Upper Prime Lady appeared to the Emperor, they expounded at length—now the secrets of prolonging life, now the methods of summoning divine spirits, now the techniques of riding the void, now the arts of treading the mysterious. Of all these essential and wondrous teachings, the Emperor compiled a single scroll. Together with the *True Form Scriptures* and the *Six Jia Numinous Flight* texts he had received, he placed them in a casket of yellow gold, sealed in a case of white jade, its rollers of coral, its wrapping of purple brocade. He enshrined it atop the Wuliang Terrace, where he would fast and purify himself, donning ceremonial robes to approach it in reverence, burning incense and rinsing his hands before unsealing and perusing the texts.\n\nFrom the time he first received the scriptures, six years passed, and his mind grew ever more at ease, his lofty aspirations ever more assured. He believed that the divine immortals had truly descended and that he would surely transcend the mortal world. Yet his vigor and strength remained untempered by utmost sincerity. He erected palaces and towers, exhausting the people; buried surrendered soldiers alive; launched distant campaigns against the barbarians. The roads swelled with lamentation, the frontier fortresses flowed with blood. In every matter, he spurned the profound admonitions of the Queen Mother and the subtle exhortations of the Upper Prime Lady. Thus the Queen Mother never came again.\n\nIn the eleventh month of the first year of *Taichu*, on the *yiyou* day, heavenly fire consumed the Terrace of the Soaring Beam. Therein, the *True Form Charts*—four scrolls in all—were lost to the flames. The Queen Mother had once warned Emperor Wu that he would fail to heed her teachings, and so she brought this conflagration upon him. Yet earlier, following the Queen Mother’s instructions, the Emperor had fasted in the seventh month of the third year of *Yuanfeng* and transmitted the *True Forms of the Five Peaks* to Dong Zhongshu, who ascended to receive it. And following the Upper Prime Lady’s words, he had fasted in the seventh month of the fourth year of *Yuanfeng* and transmitted the *Twelve Arts of the Numinous Flight of the Five Emperors and Six Jia Spirits* to Li Shaojun, who ascended to copy and receive it. These texts that survive and circulate in the world were first preserved through these two men.\n\nAfter losing the scriptures, the Emperor repented his failure to cultivate virtue, realizing that his Dao had been forfeit. Later, Dongfang Shuo one day mounted a cloud-dragon and soared away. Many witnessed him ascending toward the northwest; when they looked up again, a great mist had enveloped him, and he was nowhere to be seen. The Emperor grew ever more remorseful. That year, he performed the Feng sacrifice at Mount Song and the Shan sacrifice at Mount Hua, then journeyed east to the shores of the Bohai Sea, gazing toward Penglai. Facing heaven, he swore an oath, yearning for a divine response—but none came. In spring, he returned to receive the annual accounts at Gansui. In the second month, he began construction of the Jianzhang Palace.",
      "overlap_context": "i Palace—Heaven’s vast presence descends no differently than in a humble chamber. The August One bestows upon me great favor; let there be a general amnesty throughout the land. Grant the households of Yunyang a hundred oxen and wine, and compose the Song of the Grain Chamber.\"*\n\nBy the third year of the *Yuanfeng* era, he had assembled three hundred performers for the *Jiaodi* games. In the fourth year of *Yuanfeng*, he again journeyed to Yong to offer sacrifices to the Five Sacrificial Altars.",
      "start_char": 10908,
      "end_char": 11552,
      "start_sentence": 430,
      "end_sentence": 452,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.492711544036865,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\汉武帝内传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "夏五月正历，以正月为岁首，色尚黄，数用五，定官名协律吕。 此本王母意也。 至太初二年三月，行幸河束，祠后土。 以太初三年正月行幸，束巡海上。 夏四月还，修封泰山，以太初四年起明光宫，改号天汉。 元年正月，行幸河束，祠后土。 至天汉1一年春，行幸束海。 还，幸回中。 三月，行幸泰山，修封，祠明堂。 至太始三年五月，行幸束海，山称万岁。 冬，赐行所道户钱五千余，鳏寡孤独者，人帛一匹。 太始四年三月，行幸泰山，祠西王母，求灵应。 征和四年春，行幸束莱，临大海，清斋，祀王母、上元夫人，求应亦不得。 还，行幸泰山，修封。 庚寅，杞于明堂，改号后元。 元年正月，行幸甘泉宫，效泰时。 秋七月，地震，涌泉。 二年春，朝诸侯王於甘泉宫，赐宗室。 二月，帝疾，行幸整屋五祚宫。 丁卯，帝崩，入殡未央前殿。 三月，葬茂陵。 山陵之夕，帝棺自动，而有声闻宫外。 如此数过。 又有芳香之气异常。 陵毕，於是坟涎问大雾，门坏，雾经一月许日。 帝冢中先有一玉箱、一玉杖，此二物是帝所蓄用者，忽出在世问，人见其志，告之有司#77。 有司请辞，买者乃商人也，从关外来诣那市，见一人於北车巷卖此二物，责素三十匹，钱九万，即售之。 度实不知卖箱杖主名。 昨来洛市，因见诂此二物。 事实如辞，有司以闻。 二物簿入官，遗商人勿问。 帝未崩时，先诏以杂书四十余卷，常所读玩者，使随身敛於棺内。 至延康#78二年，河束功曹李友入上党抱犊山采药，於严室中得所葬之书，盛以金箱，书卷后题束观臣姓名，记书月日#79。 武帝时侍臣有典书郎冉登，见书及箱，流涕日：此是孝武皇帝殡殓时物也。 臣时料#80以着棺中，不知何绿得出耳。 宣帝大怆然惊愕，以书又付武帝庙中。 其茂陵安完如故，而书箱玉杖忽出地外。 又物尚鲜盛，无点污也。 见之者，亦甚惑，不能名之矣。",
      "translated_text": "In the fifth month of summer, the calendar was reformed, establishing the first month as the beginning of the year. The color yellow was esteemed, the number five was employed, and official titles were harmonized with the pitches of the *lü* and *lǚ*. This originated from the Queen Mother of the West’s intent.\n\nIn the third month of the second year of the *Taichu* era, the Emperor journeyed east to the banks of the Yellow River and performed the sacrifice to the Earth. In the first month of the third year of *Taichu*, he traveled east to inspect the seacoast. In the fourth month of summer, he returned and carried out the Feng sacrifice at Mount Tai. In the fourth year of *Taichu*, construction began on the Minguang Palace, and the reign title was changed to *Tianhan*.\n\nIn the first month of the first year of *Tianhan*, he journeyed east to the banks of the Yellow River and performed the sacrifice to the Earth. In the spring of the second year of *Tianhan*, he traveled to the Eastern Sea. Upon his return, he visited Huizhong. In the third month, he journeyed to Mount Tai, performed the Feng sacrifice, and offered rites in the Hall of Light.\n\nIn the fifth month of the third year of the *Taishi* era, he traveled to the Eastern Sea, where the mountains resounded with cries of \"Long live the Emperor!\" In winter, he bestowed five thousand coins upon each household along his route, and a bolt of silk upon every widow, orphan, and solitary elder.\n\nIn the third month of the fourth year of *Taishi*, he journeyed to Mount Tai and offered sacrifices to the Queen Mother of the West, seeking a divine response. In the spring of the fourth year of *Zhenghe*, he traveled to Donglai, approached the great sea, purified himself in fasting, and worshipped the Queen Mother of the West and the Lady of the Highest Prime, yet no response came. Upon his return, he journeyed to Mount Tai and performed the Feng sacrifice. On the *gengyin* day, he offered rites in the Hall of Light and changed the reign title to *Houyuan*.\n\nIn the first month of the first year of *Houyuan*, he journeyed to the Gansui Palace to emulate the rites of the ancient Xia. In the seventh month of autumn, an earthquake struck, and springs gushed forth. In the second year, he summoned the feudal lords to the Gansui Palace and bestowed gifts upon the imperial clan. In the second month, the Emperor fell ill and traveled to the Wuzuo Palace in Zhulu. On the *dingmao* day, the Emperor passed away and was laid in state in the front hall of the Weiyang Palace. In the third month, he was interred at Maoling.\n\nOn the evening of the burial, the Emperor’s coffin stirred of its own accord, and sounds were heard outside the palace—this occurred several times. An extraordinary fragrance also filled the air. After the burial was complete, the tomb mound was enveloped in a thick mist, and the gates collapsed; the mist persisted for over a month.\n\nWithin the Emperor’s tomb, there had originally been a jade box and a jade staff, two items he had treasured and used. Suddenly, they appeared in the world of men. Those who saw them recognized their significance and reported it to the authorities. The officials questioned the seller, who turned out to be a merchant. He had come from beyond the pass to the Luoyang market, where he encountered a man in the northern carriage lane selling the two items. The price was thirty bolts of plain silk and ninety thousand coins, and he purchased them. The merchant truly did not know the name of the seller of the box and staff. He had arrived in the Luoyang market the previous day and seen the items being sold. The facts matched his account, and the officials reported them. The two items were recorded and entered into the imperial registry, and the merchant was released without further inquiry.\n\nBefore the Emperor’s passing, he had issued a prior decree that over forty scrolls of miscellaneous texts—those he had often read and cherished—should be placed in his coffin to accompany him in burial. In the second year of the *Yankang* era, Li You, a clerk in the Hedong commandery, entered Mount Baodu in Shangdang to gather herbs. Within a secluded chamber, he discovered the buried texts, stored in a golden box. On the back of the scrolls were inscribed the names of the Eastern Observatory officials and the dates of their transcription.\n\nAmong Emperor Wu’s attendants had been a scribe named Ran Deng. Upon seeing the texts and the box, he wept and said, \"These are the very items placed in the late Emperor’s coffin at his burial. I personally arranged them within—how they came to be here, I cannot fathom.\" Emperor Xuan was deeply moved and astonished. The texts were returned to the shrine of Emperor Wu.\n\nMaoling remained intact as before, yet the book box and jade staff had suddenly emerged from beneath the earth. Moreover, the items appeared fresh and unblemished, without a speck of dust. Those who witnessed this were greatly perplexed and could not explain it.",
      "overlap_context": " looked up again, a great mist had enveloped him, and he was nowhere to be seen. The Emperor grew ever more remorseful. That year, he performed the Feng sacrifice at Mount Song and the Shan sacrifice at Mount Hua, then journeyed east to the shores of the Bohai Sea, gazing toward Penglai. Facing heaven, he swore an oath, yearning for a divine response—but none came. In spring, he returned to receive the annual accounts at Gansui. In the second month, he began construction of the Jianzhang Palace.",
      "start_char": 11552,
      "end_char": 12268,
      "start_sentence": 453,
      "end_sentence": 491,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.8750102519989,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\汉武帝内传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 17,
      "original_text": "按《九都龙真经》云：得仙之下者，皆先死，过太阴中练尸骸，度地户，然后乃得尸解去耳。 按武帝箱杖、杂书，先并随身入椁，乃从无问忽然显出，货杖於市，书见山室，自非神变幽妙，孰有如此者乎？ 明武帝之死，尚未可知，应运灵化。 又王莽篡位，到地皇二年，莽使通祭汉家诸陵，言符瑞之意。 使者到茂陵，闻地中大噫叱而长叹者四。 使者悚怖，以闻莽。 莽曰：武帝当恨吾祠祭之晚耳。 又特更祭以太牢。 所葬书目 《老子经》二卷《太上紫文》十三卷 《灵娇经》六卷《太素中胎经》六卷 《天柱经》九卷《六龙步玄文》七卷 《马皇受真术》四卷 汉武帝内传竟",
      "translated_text": "According to the *Scripture of the Nine Capitals and Dragon Perfections*, those who attain the lower ranks of immortality must first die, pass through the Great Yin to refine their corpses, and traverse the Earth’s Gate before achieving liberation through corpse-transformation.\n\nNow, Emperor Wu’s box, staff, and miscellaneous texts were all interred with him in his coffin, yet they emerged inexplicably from the void—his staff sold in the marketplace, his books discovered in a mountain chamber. If this were not the work of subtle and wondrous divine transformation, how could such things occur? Thus, it remains uncertain whether Emperor Wu truly died; he may well have undergone a numinous transformation in accordance with the cosmic rhythm.\n\nWhen Wang Mang usurped the throne and reached the second year of the *Dihuang* era, he dispatched envoys to perform sacrifices at the Han imperial tombs, invoking auspicious omens. Upon arriving at Maoling, the envoys heard four great sighs and long groans rising from beneath the earth. Terrified, they reported this to Wang Mang, who remarked, “Emperor Wu must resent the lateness of my sacrifices.” He then ordered an additional grand offering of the highest ritual.\n\n**Inventory of Buried Texts:**\n- *Scripture of Laozi*: 2 scrolls\n- *Supreme Purple Writ*: 13 scrolls\n- *Scripture of Numinous Elegance*: 6 scrolls\n- *Scripture of the Central Womb of Primordial Simplicity*: 6 scrolls\n- *Scripture of the Heavenly Pillar*: 9 scrolls\n- *Six Dragons’ Steps to the Mysterious Writ*: 7 scrolls\n- *Ma Huang’s Arts of Receiving Perfection*: 4 scrolls\n\nHere ends *The Esoteric Records of Emperor Wu of Han*.",
      "overlap_context": "ry items placed in the late Emperor’s coffin at his burial. I personally arranged them within—how they came to be here, I cannot fathom.\" Emperor Xuan was deeply moved and astonished. The texts were returned to the shrine of Emperor Wu.\n\nMaoling remained intact as before, yet the book box and jade staff had suddenly emerged from beneath the earth. Moreover, the items appeared fresh and unblemished, without a speck of dust. Those who witnessed this were greatly perplexed and could not explain it.",
      "start_char": 12268,
      "end_char": 12536,
      "start_sentence": 492,
      "end_sentence": 505,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.061618566513062,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\汉武帝内传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 18,
      "original_text": "#1《守山阁丛书》子部钱熙祚校勘本（下简称钱本）、《四库全书》本（下简称《四库》本）『甲子』前均有『正月』二字。 #2『祭』字《四库》本作『登』。 #3『神』字《四库》本作『道』。 #4『向』字《四库》本作『乃』。 #5『尊』字钱本、《四库》本均作『禄』。 #6钱本『女』前有一『玉』字。 #7『酌』字据钱本补。 #8《四库》本『忽』后有一『见』字。 #9『遥』字钱本、《四库》本均作『径』字。 #10『闻』后五字，据钱本补。 #11『科』字钱本作『轩』。 #12『或乘科车』后钱本有『或乘天马』一句。 #13『知』字据钱本、《四库》本补。 #14『佩』字据钱本补。 #15此句钱本作『戴天真之冠』。 #16此句《四库》本作『腰佩分景之剑』。 #17『庵』字钱本作『掩』 #18『云』字钱本作『容』。 #19『甘』字钱本作『香』。 #20『圆』字据钱本、《四库》本补。 #21『桩』字钱本作『输』。 #22『下』前钱本补一『非』字。 #23此句钱本作『九年易形，形易则变化』。 #24『微言所说』钱本作『所说微言』。 #25『循』字钱本作『修』字。 #26『帝』下钱本补『下席』二字。 #27『见』字据钱本补。 #28『谓』字钱本作『为』。 #29『俄』字原作『仍』，据钱本改。 #30钱本删去『相』字。 #31『情系』原作『系系』，据钱本、《四库》本改。 #32钱本删去『使一字。 #33钱本『三天』下有『真皇之母一四字。 #34『年』字据钱本补。 . #35『帝』下钱本补一『拜』字。 #36原文仅有『振根』二字，据钱本、《四库》本补。 #37『魂』字钱本改作『魄』。 #38『怨』字钱本改作『冤』。 #39『翼』字原作『异』，据钱本改。 #40『屈』字据钱本补。 #41『志一字原作『至』，据钱本、《四库》本改。 #42『钙』下钱本补一『否』字。 #43『当』上钱本补一『今』字。 #44『其』字据钱本补。 #45此二句钱本作『立天柱而安于地理』。 #46〔灵』字《四库》本作『陵』。 #47『尊』字原作『遵』，据钱本改。 #48『考』字钱本作『及』。 #49『摄』字原作『撮』，据钱本改。 #50钱本删去『当』字。 #51钱本删去『今』字。 #52『童』字原文作『立』，据钱本改。 #53画自『灵』下至『此』字，据钱本补。 #54『向』字原作『问』，据钱本改。 #55钱本『阿』前有『谨受命矣，但』五字。 #56『授』字钱本作『受』。 #57『奉一字钱本作『捧』。 #58钱本『蕴』下有『以出六甲之文』等字。 #59钱本『居』下有『比来』二字。 #60『欲授刘彻』四字据钱本补。 #61『信曰』二字据钱本补。 #62『奢』字钱本作一烦』。 #63此二句钱本作一违犯泄漏，祸必族倾。 反是天真，必沉幽冥』。 #64此句钱本作『尔其慎祸』。 #65『一不帝』钱本作『以示帝焉』。 #66『摄』字原作『撮』，据钱本改。 #67钱本『甲』下有一『者』字。 #68钱本删去『之』字。 #69『复』字钱本作『后』。 #70『太上使』钱本作『太上仙宫，太上』。",
      "translated_text": "**Variant Collations from the *Shoushan Pavilion Collectanea* (Zibu, Qian Xizuo’s Collated Edition, hereafter \"Qian Edition\") and the *Complete Library of the Four Treasuries* Edition (hereafter \"*Siku* Edition):**\n\n1. Both the Qian Edition and *Siku* Edition include the characters \"正月\" (\"first month\") before \"甲子\" (\"jiazi day\").\n2. The character \"祭\" (\"sacrifice\") is written as \"登\" (\"ascend\") in the *Siku* Edition.\n3. The character \"神\" (\"divine\") is written as \"道\" (\"Dao\") in the *Siku* Edition.\n4. The character \"向\" (\"toward\") is written as \"乃\" (\"then\") in the *Siku* Edition.\n5. The character \"尊\" (\"honored\") appears as \"禄\" (\"emolument\") in both the Qian and *Siku* Editions.\n6. The Qian Edition includes the character \"玉\" (\"jade\") before \"女\" (\"woman\").\n7. The character \"酌\" (\"pour\") is supplied from the Qian Edition.\n8. The *Siku* Edition includes the character \"见\" (\"see\") after \"忽\" (\"suddenly\").\n9. The character \"遥\" (\"afar\") appears as \"径\" (\"directly\") in both the Qian and *Siku* Editions.\n10. The five characters following \"闻\" (\"heard\") are supplied from the Qian Edition.\n11. The character \"科\" (\"carriage\") appears as \"轩\" (\"chariot\") in the Qian Edition.\n12. The Qian Edition includes the sentence \"或乘天马\" (\"or ride celestial steeds\") after \"或乘科车\" (\"or ride ritual carriages\").\n13. The character \"知\" (\"know\") is supplied from the Qian and *Siku* Editions.\n14. The character \"佩\" (\"wear\") is supplied from the Qian Edition.\n15. This sentence appears as \"戴天真之冠\" (\"wear the crown of celestial perfected\") in the Qian Edition.\n16. This sentence appears as \"腰佩分景之剑\" (\"gird the sword that divides light\") in the *Siku* Edition.\n17. The character \"庵\" (\"hut\") appears as \"掩\" (\"conceal\") in the Qian Edition.\n18. The character \"云\" (\"cloud\") appears as \"容\" (\"countenance\") in the Qian Edition.\n19. The character \"甘\" (\"sweet\") appears as \"香\" (\"fragrant\") in the Qian Edition.\n20. The character \"圆\" (\"round\") is supplied from the Qian and *Siku* Editions.\n21. The character \"桩\" (\"stake\") appears as \"输\" (\"convey\") in the Qian Edition.\n22. The Qian Edition includes the character \"非\" (\"not\") before \"下\" (\"descend\").\n23. This sentence appears as \"九年易形，形易则变化\" (\"after nine years, the form transforms; once transformed, it changes\") in the Qian Edition.\n24. The Qian Edition reads \"所说微言\" (\"the subtle words spoken\") instead of \"微言所说\" (\"the subtle words that speak of\").\n25. The character \"循\" (\"follow\") appears as \"修\" (\"cultivate\") in the Qian Edition.\n26. The Qian Edition includes the characters \"下席\" (\"descend from the mat\") after \"帝\" (\"thearch\").\n27. The character \"见\" (\"see\") is supplied from the Qian Edition.\n28. The character \"谓\" (\"call\") appears as \"为\" (\"as\") in the Qian Edition.\n29. The character \"俄\" (\"suddenly\") originally appeared as \"仍\" (\"still\") and was emended according to the Qian Edition.\n30. The Qian Edition omits the character \"相\" (\"mutually\").\n31. The phrase \"情系\" (\"emotions bound\") originally appeared as \"系系\" (\"bound bound\") and was emended according to the Qian and *Siku* Editions.\n32. The Qian Edition omits the character \"使\" (\"cause\").\n33. The Qian Edition includes the characters \"真皇之母\" (\"Mother of the Perfected Thearch\") after \"三天\" (\"Three Heavens\").\n34. The character \"年\" (\"year\") is supplied from the Qian Edition.\n35. The Qian Edition includes the character \"拜\" (\"bow\") after \"帝\" (\"thearch\").\n36. The phrase \"振根\" (\"shake the roots\") originally appeared as only these two characters and was completed according to the Qian and *Siku* Editions.\n37. The character \"魂\" (\"soul\") was emended to \"魄\" (\"spirit\") in the Qian Edition.\n38. The character \"怨\" (\"resentment\") was emended to \"冤\" (\"grievance\") in the Qian Edition.\n39. The character \"翼\" (\"assist\") originally appeared as \"异\" (\"strange\") and was emended according to the Qian Edition.\n40. The character \"屈\" (\"yield\") is supplied from the Qian Edition.\n41. The character \"志\" (\"will\") originally appeared as \"至\" (\"utmost\") and was emended according to the Qian and *Siku* Editions.\n42. The Qian Edition includes the character \"否\" (\"no\") after \"钙\" (\"calcium?\").\n43. The Qian Edition includes the character \"今\" (\"now\") before \"当\" (\"should\").\n44. The character \"其\" (\"its\") is supplied from the Qian Edition.\n45. These two sentences appear as \"立天柱而安于地理\" (\"erect the pillar of heaven and settle the earth’s principles\") in the Qian Edition.\n46. The character \"灵\" (\"numinous\") appears as \"陵\" (\"tomb\") in the *Siku* Edition.\n47. The character \"尊\" (\"honor\") originally appeared as \"遵\" (\"follow\") and was emended according to the Qian Edition.\n48. The character \"考\" (\"examine\") appears as \"及\" (\"reach\") in the Qian Edition.\n49. The character \"摄\" (\"grasp\") originally appeared as \"撮\" (\"gather\") and was emended according to the Qian Edition.\n50. The Qian Edition omits the character \"当\" (\"should\").\n51. The Qian Edition omits the character \"今\" (\"now\").\n52. The character \"童\" (\"youth\") originally appeared as \"立\" (\"stand\") and was emended according to the Qian Edition.\n53. The text from \"灵\" (\"numinous\") to \"此\" (\"this\") is supplied from the Qian Edition.\n54. The character \"向\" (\"toward\") originally appeared as \"问\" (\"ask\") and was emended according to the Qian Edition.\n55. The Qian Edition includes the characters \"谨受命矣，但\" (\"I reverently receive the command, but\") before \"阿\" (\"Ah\").\n56. The character \"授\" (\"confer\") appears as \"受\" (\"receive\") in the Qian Edition.\n57. The character \"奉\" (\"offer\") appears as \"捧\" (\"hold\") in the Qian Edition.\n58. The Qian Edition includes the characters \"以出六甲之文\" (\"to reveal the writ of the Six Jia\") after \"蕴\" (\"conceal\").\n59. The Qian Edition includes the characters \"比来\" (\"recently\") after \"居\" (\"reside\").\n60. The four characters \"欲授刘彻\" (\"wishing to confer upon Liu Che\") are supplied from the Qian Edition.\n61. The two characters \"信曰\" (\"Xin said\") are supplied from the Qian Edition.\n62. The character \"奢\" (\"extravagant\") appears as \"烦\" (\"troublesome\") in the Qian Edition.\n63. These two sentences appear as \"违犯泄漏，祸必族倾。反是天真，必沉幽冥\" (\"If violated or leaked, calamity will surely destroy the clan. Conversely, if the celestial perfected are followed, one will sink into dark obscurity\") in the Qian Edition.\n64. This sentence appears as \"尔其慎祸\" (\"You must beware of disaster\") in the Qian Edition.\n65. The phrase \"一不帝\" (\"once not thearch\") appears as \"以示帝焉\" (\"to show the thearch\") in the Qian Edition.\n66. The character \"摄\" (\"grasp\") originally appeared as \"撮\" (\"gather\") and was emended according to the Qian Edition.\n67. The Qian Edition includes the character \"者\" (\"one who\") after \"甲\" (\"jia\").\n68. The Qian Edition omits the character \"之\" (\"of\").\n69. The character \"复\" (\"again\") appears as \"后\" (\"afterward\") in the Qian Edition.\n70. The phrase \"太上使\" (\"the Most High sent\") appears as \"太上仙宫，太上\" (\"the Most High’s immortal palace, the Most High\") in the Qian Edition.",
      "overlap_context": "e then ordered an additional grand offering of the highest ritual.\n\n**Inventory of Buried Texts:**\n- *Scripture of Laozi*: 2 scrolls\n- *Supreme Purple Writ*: 13 scrolls\n- *Scripture of Numinous Elegance*: 6 scrolls\n- *Scripture of the Central Womb of Primordial Simplicity*: 6 scrolls\n- *Scripture of the Heavenly Pillar*: 9 scrolls\n- *Six Dragons’ Steps to the Mysterious Writ*: 7 scrolls\n- *Ma Huang’s Arts of Receiving Perfection*: 4 scrolls\n\nHere ends *The Esoteric Records of Emperor Wu of Han*.",
      "start_char": 12536,
      "end_char": 13951,
      "start_sentence": 506,
      "end_sentence": 577,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.65511512756348,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\汉武帝内传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 19,
      "original_text": "#71『方丈』钱本作『方丈山』。 #72『王母』钱本作『二真』。 #73『乙酉』原作『乙丑』，据钱本改。 #74『真形图』后钱本有『六甲五帝灵飞经录十二事灵光生经及自撰所受』等字。 #75『尝』字钱本作『当』。 #76『西北上，再仰望』，钱本作『西北上冉冉，仰望良久』。 #77『此二物』至『告之有司』钱本作『此是西胡康渠王所献，帝甚爱之，故入梓宫中。 其后四年有人于扶风市中买得此二物。 帝时左右诗人有识此物是先帝所珍玩者，告之有司』。 #78『延康』钱本作『元康』。 #79此句下钱本有『武帝时也。 河东太守张纯以经箱奏进。 帝问』等字。 #80钱本删去『料』字。",
      "translated_text": "71. The phrase \"Fangzhang\" appears as \"Mount Fangzhang\" in the Qian Edition.\n72. The phrase \"Queen Mother\" appears as \"Two Perfected\" in the Qian Edition.\n73. The date \"yiyou\" originally appeared as \"yichou\" and was emended according to the Qian Edition.\n74. After \"Chart of the True Form,\" the Qian Edition includes the following text: \"Record of the Six Jia and Five Thearchs’ *Lingfei Jing*, the *Twelve Affairs of the* *Lingguang Sheng Jing*, and other works personally transmitted.\"\n75. The character \"chang\" appears as \"dang\" in the Qian Edition.\n76. The phrase \"to the northwest, gazing upward again\" appears as \"slowly ascending to the northwest, gazing upward for a long while\" in the Qian Edition.\n77. From \"These two objects\" to \"reported to the authorities,\" the Qian Edition reads: \"These were tribute from the Kangju king of the Western Hu. Thearch cherished them greatly, so they were placed in his coffin. Four years later, someone purchased these two objects in the market of Fufeng. A poet among the Thearch’s attendants recognized them as treasures once beloved by the late emperor and reported the matter to the authorities.\"\n78. The reign title \"Yankang\" appears as \"Yuankang\" in the Qian Edition.\n79. Below this sentence, the Qian Edition includes the following text: \"This occurred during the reign of Emperor Wu. Zhang Chun, the governor of Hedong, submitted them in a sutra case. Thearch inquired...\"\n80. The Qian Edition omits the character \"liao.\"",
      "overlap_context": "e thearch\") in the Qian Edition.\n66. The character \"摄\" (\"grasp\") originally appeared as \"撮\" (\"gather\") and was emended according to the Qian Edition.\n67. The Qian Edition includes the character \"者\" (\"one who\") after \"甲\" (\"jia\").\n68. The Qian Edition omits the character \"之\" (\"of\").\n69. The character \"复\" (\"again\") appears as \"后\" (\"afterward\") in the Qian Edition.\n70. The phrase \"太上使\" (\"the Most High sent\") appears as \"太上仙宫，太上\" (\"the Most High’s immortal palace, the Most High\") in the Qian Edition.",
      "start_char": 13952,
      "end_char": 14252,
      "start_sentence": 578,
      "end_sentence": 591,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.213581800460815,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\汉武帝内传.txt",
        "category": "记传类"
      }
    }
  ]
}