{
  "source_id": "泄天机",
  "source_file": "chunked_daozang\\泄天机.json",
  "total_chunks": 6,
  "total_original_chars": 5736,
  "total_translated_chars": 34823,
  "total_translation_time": 166.42166113853455,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\藏外\\泄天机.txt",
    "category": "藏外"
  },
  "full_translation": "**The Divine Mechanism Revealed: Direct Pointers to the Great Return of Golden Elixir**\n\nThe medicines of the supreme Dao and the substances of the consummate Way are fundamentally the Three Powers. Yet the wondrous principles of generation and completion lie beyond the Two and Five. For all practitioners, entry begins with the fullness of spirit and sufficiency of qi. When spirit is full and qi is sufficient, true essence is born; when true essence arises, qi and spirit are preserved. For when essence is exhausted, spirit flees; when spirit perishes, qi scatters. Qi is born of the heart, while essence issues from the body. Grasping this wondrous principle, the sacred work of return and reversal is nothing more than the fusion of body and mind. Thus, the generation and completion of the supreme Dao lie in this alone.\n\nMaster Mud-Pillow said: Qi belongs to Heaven, essence to Earth, and spirit to Man. Since man is formed by receiving the essence of the Two and Five, man is Heaven and Earth, and Heaven and Earth are man. Therefore, to perfect the Dao of Heaven and Earth, to model Heaven and emulate Earth, is nothing beyond the self. What is the method? The heart is as clear as Heaven, the body as tranquil as Earth. Achieving clarity and tranquility, one becomes Heaven and Earth! From this, the Great Return proceeds. The work of cultivation is simply to attain spontaneity. The secret of reaching the ultimate lies in nothing more than utmost sincerity without ceasing. Those who attain ceaselessness do so by inheriting the essence of the Two and Five. Thus, Master Mud-Pillow said: Only through utmost sincerity without ceasing can one achieve the Great Return of Golden Elixir. Yet this is neither from within nor without; the ancient sages called it \"from emptiness and nothingness.\" For the Dao is fundamentally the most empty, and its substance is the most non-existent. Thus, the Great Return of Golden Elixir is the return to the substance of the Dao. To cultivate in accordance with the substance of the Dao is what the Most High meant by \"recognizing the One, and all things are complete.\"\n\nMin Xiaogen said: Carefully examining this text, its title and chapter headings indeed derive from the oral transmission of a divine person. Yet the composition of its content is clearly not the original oral version. Later hands must have interspersed additions. Thus, jade and stone are mixed together. Without emendation, the harm to later generations would be no small matter. Therefore, I have compiled the *Profound Discourse of the Sincere Studio of Supreme Emptiness*, based on the oral transmission of the divine person, and presented it here. Alas, it has not yet been verified by the ancient sages, so I record it awaiting confirmation by the wise.\n\n**Foundation-Laying Relies Entirely on the Bellows**\n\nFor all people, spirit is born of essence, and essence is born of qi. When the five qi merge and fill the body, they manifest as the constructive and protective energies, nourishing yin and yang and transforming into essence and marrow. However, if the body flows, essence leaks. If one does not know how to preserve the substance of the Dao, essence flows and marrow follows, gradually depleting. All people in this world begin practice only after damage has occurred, so when they begin, they must first establish a foundation. To establish this foundation, one must start with regulating the mind. When the mind is regulated and qi harmonized, one may hope to attain true breathing.\n\nTrue breathing is what *Nanhua* calls \"heel breathing,\" and what Master Mud-Pillow refers to as the origin of embryonic breathing. Yet relying on intention to guide it does not achieve spontaneity. Once embryonic breathing is accomplished, one directly unites in virtue with Heaven and Earth, with no room for the mind in between. Exhaling follows exhalation, inhaling follows inhalation, like a bellows. Inhaling and exhaling in ceaseless circulation—this is true breathing. Once true breathing is regulated, intention manifests immediately, opening and closing naturally, without relying on mental effort. One need only follow the method to open and connect.\n\nThe upper and lower magpie bridges are gently propped open with the diaphragm. The qi in the heart is lowered to the lower abdomen and stored in the extreme of the Kun Palace, called \"emptying the heart and filling the abdomen.\" Both hands cup the penis and scrotum, lifting and warming them—raising them is even better—so that one’s yang qi is emitted. Then the yang qi of Heaven and Earth responds, drawn into one’s body. One must not fixate on it or stir desire, for if the fire of desire flares, original yang becomes chaotic, and instead of absorbing the yang qi of Heaven and Earth, one’s own yang qi will be consumed by them. Therefore, one need only keep the heart and breathing interdependent.\n\nMaster Mud-Pillow said: At this stage of practice, one must use intention to nurture and preserve, allowing descent and forbidding ascent. When the fire in the Cinnabar Field blazes and the two kidneys boil like a decoction, after about nine breaths, use intention to guide it. Penetrating the spine from behind, one will experience the verification of the Five Dragons Bearing the Sage. There may be sensations of the spine breaking, the pass burning, and the wall scattering into the brain—one must not be alarmed. Suddenly, the grotto palace may open, revealing what has never been heard or seen. One must guard against attachment. Abiding in stillness for a long time, one will feel sweet dew pouring down, so abundant it cannot all be swallowed. Descending from the Tower Chamber to the Descending Gate, a cool delight pervades the heart, bringing indescribable peace. After a while, it sinks down, transforming like boiling water, and one feels harmony surging throughout the body. After achieving this, the human Dao is complete, and one may proceed to the immortal Dao without the flaw of skipping stages.\n\nWhat is the immortal Dao? When yang arises, use the Heavenly Eye to illuminate the Yin Heel vessel. Simply follow the opening and closing of true breathing, gently inhaling to activate the Yin Heel, rising and falling with the breath. Practicing as if nothing exists, one will feel a numinous aperture open before the coccyx. Within it, a rustling sensation arises, like a magnet attracting a needle. The true qi of Heaven and Earth enters the Yin Heel, ascending along the spine before the heart and behind the back, straight to the Mud-Pillow. One must retain it for about three to five breaths, then allow it to descend to the Flower Pool, passing through the Tower Chamber and Descending Gate to the lower Cinnabar Field. Both places require retention for about three to five breaths. Then, at the Yin Heel, absorb the qi that entered with the previous breath, and retain it for nine breaths before allowing it to ascend. Thereafter, practice follows spontaneity, for one has already embedded ascent and descent within opening and closing.\n\nMaster Mud-Pillow said: Practicing thus without counting repetitions, one proceeds until circulation is endless. When the two qi balance, the entire body feels harmonious and comfortable. Initially, one may experience limbs as heavy as mountains and the body like a wooden stump. This is because the latent yin qi in the body, encountering this yang qi’s attack, seeks to depart, hence the sensations of heaviness and dullness.\n\nWhen the yin dissipates in an instant, an indescribable clarity and joy arise. Thereafter, with each practice, the fire suffices and the body feels light, while the spirit delights in ever more beautiful and wondrous scenes, advancing day by day. The primordial yang gradually flourishes, and the primordial qi surges in harmony, transforming the yin impurities within the body into the essence of primal harmony, and transmuting the mundane flames within the heart into the qi of the True One. The marrow solidifies and the essence congeals, forever free from the afflictions of leakage or reckless dissipation. The foundation is firmly established, and the outer gate of the alchemical household is complete. This is called \"the body unmoving.\"\n\nYet the meaning of \"the body unmoving\" extends beyond the firmness of essence: even tears, sweat, and the seven bodily fluids vanish entirely, and one remains unmoved even when encountering desires. Moreover, as the classics say, \"When essence is sufficient, one does not think of lust\"—all these refer to the body unmoving.\n\nMin Xiaogen said: In the alchemical regulation of qi, there are originally three paths: the red, the black, and the yellow. The red is the Conception Vessel, the path in front, the route through which the heart’s qi flows. The heart is red in color, hence it is called the red path. Yet the nature of red is to blaze upward, so the method must restrain it and cause it to descend, thereby cooling the heart and warming the kidneys. The black is the Governor Vessel, the path behind, the route through which the kidneys’ qi flows. The kidneys are black in color, hence it is called the black path. Yet the nature of black is to moisten and descend, so the method must restrain it and cause it to ascend, thereby circulating the marrow and calming the spirit. These two paths are the routes through which essence and qi emerge, enabling the existence of all beings. Thus, the method designates them as the \"human path,\" which both alchemists and physicians describe in detail.\n\nThe yellow is the Yellow Center, the path lying between the red and black, situated before the spine and behind the heart. Its virtue governs the two qi, serving as the master of opening and closing. Its realm is utterly empty and still, so only the primordial can traverse and abide there. The formation and perfection of the immortal embryo for both ordinary beings and immortals occur within this realm. Though there are distinctions among the three fields, in truth they are one continuum. Thus, the method designates this as the \"immortal path.\" Yet because it was treasured and kept secret by the ancient sages, alchemical texts fill the shelves, yet few dare to expound it fully. From the Zhou and Qin dynasties through the Ming, the teachings were transmitted orally, and the transmission required a midnight oath.\n\nMy late teacher, Master Taixu, said: The first to commit the teachings to writing was Yin the Disheveled, my teacher, the Mud-Pillow Immortal. Yet even he merely hinted at the beginnings, for if the nature of the heart-mind is not understood, later generations, being of ordinary constitution, will be prone to curiosity and impatience. Moreover, the world abounds with heterodox teachings, all relying on sensory knowledge for instruction—this is diametrically opposed to the essence of the Dao, let alone other matters.\n\nNow, upon solemnly reading this text, it omits the red and black and directly describes the Yellow Center. The celestial mechanism remains unexposed, so how dare I conceal it? Failing to supplement it would betray the Immortal. Thus, I have composed this supplementary chapter; may readers forgive me.\n\n**Refining the Self Requires True Lead and Golden Water to Forge the Sword and Gather the Primordial**\n\nThe \"self\" is earth; earth is intention—specifically, the perfectly sincere and unerring true intention. The heart pertains to fire, and delusive thoughts and desires all belong to the postnatal. Blazing and racing, they are difficult to extinguish. Only with a speck of true gold from the primordial water—the primordial yang’s true essence—can the mundane flames be extinguished and transformed into true intention. This is what alchemists call the Yellow Center within the Yellow Court, also known as the golden tripod or the spirit chamber, for it can be bounded yet boundless, formless yet embodied.\n\nAccording to the earlier foundation-building, the self was already refined, and there was a wondrous mutual dependence. Previously, mercury was cast into lead to refine lead and produce gold, which in the human body corresponds to refining the form and nourishing the true essence. Only at this stage is lead cast into mercury, achieving the harmony of water and fire. In the human body, this corresponds to refining essence into qi and forming the golden elixir’s spirit chamber.\n\nThe secret method lies in the moment of yang arousal, the living midnight. Yet the living midnight also differs between the primordial and the postnatal, as the *Awakening to Reality* describes as \"two kinds of function.\" If desire is aroused by sensory encounter, giving rise to thoughts, this is the postnatal human heart, stirred by desire. At this time, one must employ the method of pursuit and restraint: secure the upper and lower gates, settle the body and calm the heart, lower the eyelids to inwardly illuminate the Yin Heel, and guide it upward from the tailbone. Stir the bellows to penetrate the void, and the thought will vanish, the desire will extinguish. Though this yang qi carries the fire of desire, if it lingers in the Mud-Pillow Palace without the method of transmutation, its accumulation will eventually erupt through the crown, leading to seated transformation. The remedy is to use the Celestial Eye to encircle the Mud-Pillow Palace, rotating the intention thirty-six times to the left and twenty-four times to the right. After a brief pause, this yang qi will naturally transform into a cold spring and descend into the Crimson Palace, dispersing into the meridians. Even a short period of tranquil sitting yields minor benefits.\n\nAs for the primordial living midnight—whether at midnight, the hour of *zi*, or the hours of *chou* and *yin*—when stillness gives rise to yang, the body’s ordinary yang qi responds to the yang qi of heaven and earth and arises, not generated by emotional thoughts or qi stimulation. This is the true one’s primordial yang qi of the celestial heart-mind. Yet at this time, there is a proper measure: it must neither be excessive nor deficient. If deficient, the fire is insufficient and the gold does not appear; if gathered, it is mere fire, and the medicine will be consumed, rendering it useless. If excessive, the gold transforms into water and becomes substantial; if gathered, it is mere water, foul and harmful.\n\nThus, the classic states: \"When lead encounters *gui*, gather it swiftly; when gold meets the full moon, it is unfit to taste.\" One must recognize the equilibrium of gold and water. At the winter solstice, the celestial heart-mind remains unchanged, and in the moment before the myriad things are born, the yang is at its firmest. The Yin Heel and tailbone exhibit a sensation like insects crawling—this is the sign. Swiftly employ the hand seal: gently lift the perineum and the urethra, stir the bellows, and the body’s true qi will draw the yang qi of heaven and earth to enter from the tailbone with a rustling sound. Following the bellows’ *xun* wind, it ascends to the Mud-Pillow Palace. Maintain steadfast observation without movement, and these yin and yang qi will transform into jade dew, sprinkling down into the Crimson Palace. This droplet extinguishes all mundane flames, and the primordial qi emerges to meet it. Entering the Yellow Center, they coalesce into a lump of cinnabar, which is called the \"self.\"\n\nYet the classic states: \"Within a single flavor of water lies gold,\" revealing that the alchemical tradition, from beginning to end, concerns but this one thing, this one matter. Previously, only the bellows was mentioned; here, refining lead into gold and generating true essence speaks of producing the water within lead-gold, which is used to restrain fire and form earth. This practice still belongs to the work of discipline, hence it is called \"refining the self.\" After refining the self, true earth is established, and one then gathers the qi of heaven and earth to transform earth and generate gold, thereby forming the elixir of pure yang gold-liquid.\n\nThe medicine thus possesses depths and shallows, each differing according to the realm. Only when the medicine is obtained and the firing process—withdrawing and adding fire without error—is applied does one become an immortal upon the earth. \"Cooking\" refers to yang cooking; \"refining\" refers to yin refining. The medicine must be obtained at the *living midnight*, the moment when the single yang revives within the body, the great medicine acquired in the second watch. From the initial work of laying the foundation and refining the self, all involve the practice of gathering medicine. This is reiterated for clarity: the earlier gathering of medicine served to cultivate the cauldron and furnace, while the present gathering and refining aim to complete the returning elixir.\n\nOne must await the quiet midnight hour, when the celestial mechanism stirs of itself, and the external yang arises—this is called the union of heaven and human. Yet one must not gather immediately; rather, one must assist with intention, called \"advancing the yang fire,\" until the tortoise’s eyes round and the dragon’s body stands erect, precisely the firing time. Use only the mind’s eye to illuminate the lower field: the mind is true intention, the eye is the celestial eye. Then, the field will manifest a millet-like pearl, and the inner and outer qi will sense each other’s attraction, growing from subtle to manifest. One feels the true qi drawing in more intensely, with the sensation of insects crawling between the orifices. The chest, abdomen, neck, and back reveal hidden glimmers of true light—this is when the true gold qi is full and the celestial water is just being born. One must swiftly gather it.\n\nEmploy the martial fire: lift the urethra, contract the perineum, raise the lower abdomen, and open the bellows. After a moment, one senses this medicine transforming into true qi, which must then be guided upward with intention. It will surely ascend with a rustling sound, rising along the Governing Vessel to the brain, halting at the *zhen* (pillar). The *zhen* is the human pillar, the crown of the head, a structure formed after birth as the body’s vital qi ascends. It corresponds to the celestial pillar, the central star among the five stars, the congealed essence of heaven and earth. The *chen* position governs the celestial stem, whose light, when shining, gives life, and when concentrated, effects transformation. \"Shining\" means universal illumination; \"concentration\" means focused infusion. Creation relies upon it for generation and completion, while the perfected one borrows it to refine the body. Now, it is used to meet the stem and merge with the Conception Vessel, descending from the celestial eye along the pool and pillar: the pool is the upper pool, the mouth; the pillar is the nose bridge, the mountain root. The method of reaching the *zhen* is to greet the star in the brain—the star is the celestial pillar—thereby transforming the mundane and returning to the primordial.\n\nThis is of utmost importance, hence it must be held for nine breaths—not out of attachment, but to await the primordial yang qi transforming into sweet dew, which follows the stem and pillar to shower down upon the pool and palace. This dew is cool, fragrant, and sweet, its mysterious function boundless. Moreover, its showering along the stem and pillar holds profound significance. The Master of the Mud-Pillow says: \"The tangible dew follows the stem to dot the palace; the intangible dew follows the pillar to return to the Yellow Center.\" Thus, all dew descending via the Magpie Bridge to rest in the Crimson Palace must be swallowed through the mouth to pass through the tower and reach the barrier, where it divides into clear yang and turbid yin. The perfected one at this stage stores the turbid yin to transform into blood and fluids, circulating through the meridians, while the clear yang merges into the central Yellow, uniting with one’s primordial qi. Following the true intention, within the central palace, it revolves left-up and right-down from small to large for thirty-six cycles, then right-up and left-down from large to small for twenty-four cycles, halting at the center of the central palace—this is called the *mao-you* circumpolar revolution.\n\nSit in stillness for a while, then rise, sleep, or act as one pleases, without seeking where it settles or where it resides. Only when it feels dissolved into emptiness and non-attachment does it become the true reality of the spiritual breath and the womb of primordial qi. Upon obtaining the medicine and completing its ascent and descent, one feels the entire body at ease and blissful. Beware of attachment, for even a trace of clinging instantly reverts one to the mundane, inviting no small calamity. After the practice, guard only the true breath, floating and roaming within the pupil, without seeking externally. Thus, daily gathering and refining will fill the hexagrams and accumulate grains, filling the three fields, warming the two kidneys like boiling water, igniting the qi sea with fire, and floating the jade liquid in the void. When the great medicine is about to form, one must enter the enclosure to await the birth of the infant, thereby attaining the great Dao of celestial immortality. Guard this closely! Guard it well!\n\n---\n\nTo seek the great medicine and verify the golden immortal’s firing process for nine revolutions:\n\nThe great medicine is the great returning of gold-liquid, the great medicine of celestial immortals. It is what the *Wuzhen Pian* calls: \"To learn immortality, one must learn celestial immortality; only the golden elixir is most certain.\" The previous medicine was external true lead, called the external golden elixir, also named the jade-liquid returning elixir, the medicine of earthly immortals. Once the jade-liquid is full, one must swiftly enter the enclosure to silently await the birth of the gold-liquid, which will transmute the primordial spirit into the sacred embryo and congeal the primordial qi into the divine treasure.\n\nChoose a blessed mountain and auspicious site to construct the enclosure. Its height, depth, brightness, and darkness must be appropriate. Engage three devoted Daoist companions to guard it. Within the chamber, place a level couch draped with curtains on all sides. Hang a bright mirror above, and place swords to the left and right. Beneath the bed, lay three *jin* of realgar, and upon it, a meditation cushion and a *hunyuan* robe, along with a bolster. Allow no other objects before it. Arrange the eight trigrams at the four corners. Select an auspicious time and report to the Celestial Emperor.\n\nEnter the enclosure and sit in stillness, practicing non-action and non-attachment, focusing the mind within the *guan* (inner elixir field). Let the body be like withered wood, sit in full lotus posture, and remain thus day and night without interruption. Only maintain fetal breathing, where spirit and *qi* embrace each other, neither issuing forth nor entering in—like being within the mother’s womb. To outsiders, one appears as if unconscious, for this is the moment of returning to the root and restoring life. The birth of the gold-liquid may take seven, fourteen, or even twenty-one days. The devoted companions must guard without the slightest lapse, strictly avoiding any disturbance by sound, and especially shunning startling noises. At this time, the adept’s spirit rests in the valley of response; sound may rouse awareness, and noise may cause alarm. If awareness stirs, one falls out of concentration, and the nurturing practice is lost. If startled, the spirit scatters—no misfortune could be greater. As the *Nihuan* states: \"The role of external protection is tied to life and death.\"\n\nWhen the adept reaches this stage, a moon-like wheel will appear suspended in the west, and a sun-like orb will manifest in the east. In stillness, guard these two wheels as they alternately swallow and spit, eventually merging into a single luminous sphere suspended before the valley. As *Changchun* said: \"At this time, the adept relies entirely on understanding companions who, from the side, carefully observe and silently guard. When a radiant light appears between the adept’s brows, they must be promptly informed—not by voice, but by sound alone—so the adept may inwardly comprehend, apply the mind’s *gang* (celestial pivot), and direct the gaze of the attendant spirits. Then the spirit will naturally rest in the valley, and the great medicine of resonance will be born, following the *gang* to merge with the primordial, fusing into a pearl-like essence.\"\n\nHaving attained this state, the adept’s spirit communes with the Great Void, and *qi* flows unimpeded—no longer divided by the three realms or the six directions. This is the moment when, as the alchemical classics say, \"gold returns to nature,\" and the pearl is the divine treasure, the divine treasure is the golden immortal. Once the divine treasure is obtained, one must proceed with ten months of gentle nurturing and carefully sustain the nine revolutions to complete the embryo’s formation and transform the pearl, thereby embodying the sacred infant.\n\nYet this nurturing and firing differ from earlier stages. Before, there were distinctions of withdrawal, addition, ascent, and descent; now, one focuses the mind within the *guan*, like fish in a spring pond or hibernating insects, absorbing and gathering primordial yang, preventing the dissipation of numinous *qi*, summoning the Great Void, and cultivating primordial essence. This step relies entirely on the *gang* and the two stellar guardians, which must be preserved and illuminated at every moment. The method lies in neither presence nor absence, neither forgetting nor forcing.\n\nAs the *Nihuan* master said: \"The mind must not scatter, for scattering cools the fire; thoughts must not arise, for arising inflames the fire. Both harm the embryo—utmost care is required.\" Thus, a full year—equivalent to nine months of work—is called the nine revolutions. The two months of February and August are excluded from firing, not as a complete abandonment but as a time of effortless attention, no longer applying deliberate focus. Yet the withdrawal of fire brings the clarity of water’s tide—this is the time for bathing, the moment to irrigate the yellow sprout.\n\nThis method calculates from the day of elixir formation as the Winter Solstice of the eleventh month. Counting ninety days forward, the first bathing occurs at the second month’s node. Taking the day of elixir formation as the first day of the month, the second bathing occurs on the twenty-third day of the eighth month, and the following day becomes the first day of the twelfth month. The time of embryo formation is reckoned as *mao* (the fourth double-hour) for the *mao* month and *you* (the tenth double-hour) for the *you* month. With this flexible method, nurturing and bathing proceed until the nine revolutions of fire are complete, the *qi* and timing are fulfilled, and the infant stirs.\n\nBefore proceeding, the adept must self-examine: Has the work of returning and refining reached purity? If all residual mundanity has dissolved, then movement and stillness will be as one, and whether to remain in the world or ascend beyond is a matter of choice. For one has now become the world itself, the earth itself, the heavens themselves—merged with the Dao in truth. What further distinction could there be between entering or exiting, ascending or descending, high or low, near or far, mortal or sacred?\n\nShould the process of aligning with fate—achieving communion, transformation, coagulation, and perfection—proceed unevenly, with lesser progress followed by greater, and the adept’s body remain unrefined, then one must first release a sphere of golden light, suspending it in the void above the crown. This is called the *Mind-Pearl*, corresponding to the Star of Stability above.\n\nMaster Tai Xu states: The Star of Stability governs the celestial pivot, formed by the ascent of Earth’s primordial *qi* from *Kun*. Where its light shines, life arises; where its radiance pours, transformation occurs. All beings depend on it for birth and completion. Positioned at the center of heaven, it is the central star among the five, towering above the sun, moon, and all other stars.\n\nMy master, Ni Wan, says: In the human body, this corresponds to the *lumen* bone at the crown—the bone where the *qi* of life converges after birth. Lü Dongbin called it the \"human stabilizer.\" Its essence is termed the *Mind-Pearl* in the Golden Palace, employed by the Most High to guard the sacred infant. Disciples must not remain ignorant of this.\n\nIf the elixir is attained prematurely, during the phase when the sacred infant has been nurtured but not yet matured, one may temporarily employ this pearl, suspending it in the void above the crown. This compensates for any lingering impurities in the work of returning and refining, or for the untransformed *shen* of consciousness, warding off temptations and humiliations to prevent the infant from being devoured by demonic forces. This has been elaborated in *Zheng Yang’s Final Stroke*. Zheng Yang said: \"To speak of cultivating the infant to completion—how easily is it said? Yet so long as a trace of *yin* remains unexhausted, the body’s residual awareness will inevitably attract external demons, colluding to assail and humiliate. The only method is to withdraw and conceal the Dao-body. If progress has been uneven, then merge into the *Mind-Pearl*, allowing self-fusion, self-transformation, and self-creation. Inner and outer dissolve like ice, and over time, the body becomes equal to that of an ancient Buddha.\"\n\nTai Xu says: The *Mind-Pearl* is thus precious beyond measure. Yet among the transmitted scriptures of successive patriarchs, few have described it in full. This method was devised to rescue those of inferior root-nature who have not yet penetrated their intrinsic nature. For those whose nature-light has stabilized early, this method is unnecessary at the final stage.\n\nThereafter, one’s body merges into the pearl, which in turn envelops the body. Inner fusion harmonizes with outer dissolution, refining away all residual mundanity until it is naturally purged. Disciples must simply abide in emptiness—silent, still, and void—to effect this transformation. Eventually, all perceptions vanish, and when stillness reaches its ultimate stillness, the true and constant nature is attained, no different from the state of pure returning and refining.\n\nThough innate endowments differ and entry points vary, whether proceeding with ease or effort, the fruition remains the same. The workings of creation harbor no partiality. Thus, those who verify their attainment must examine themselves: some may choose to remain in the world in their embodied form, fulfilling their nature to the utmost and perfecting their destiny to realize their aspirations.\n\nMin Xiao Gen says: \"We who cultivate the Dao devote our lives to diligent practice, all for the sake of verification and ascension. Should we falter even slightly, all prior efforts may be lost. Now, in this text, I have edited and expounded upon oral transmissions, detailing what has been passed down through the world. What is my intent? It is to abridge the descriptions while amplifying the master’s teachings, supplementing them with annotations and verifications. Thus, it may be seen that divine beings indeed possess authentic transmissions—not mere baseless claims.\"\n\nNine years of wall-facing severs worldly ties, fulfilling the original vow of immortality. To fulfill this vow, nothing surpasses the practice of wall-facing—undertaken when perfection has been attained but transformation is not yet complete.\n\nNi Wan says: This is a special transmission outside the teachings of the Western Sage, originating with the Buddha Vajra and inherited by Bodhidharma. Manifesting in the eastern lands, he engaged in nine years of wall-facing. Since then, over centuries, practitioners on both sides of the world have received this lineage, yet few grasp its essential principle.\n\nYet most pursue it merely to refine nature and fulfill destiny, unaware that when the First Patriarch arrived, his nature and destiny were already perfectly realized—so much so that he could cross rivers on a reed, a clear testament to this. Yet he still practiced nine years of wall-facing, specifically to demonstrate to the perfected ones of this land the shared practice of embodying the present life as the present world, and the present world as the mind—with wall-facing as the essential gateway. Only thus does the vow for a governed world begin to attain fulfillment. The method is fully expounded in Lü Zu’s *Three Numinous Principles of World-Rectifying Practice*, yet it is undertaken while the colored body remains untranscended, hence the instruction to ride the hours, days, months, and years of this very life.\n\nOur tradition is that of the Complete Realization, and the ultimate great endeavor of the Complete Realization points precisely to this step. Thus, the Dao advances through practice, and merit depends on the perfection of virtue—hence the accumulation of three thousand merits and eight hundred deeds. Yet for an ordinary person of low station, how can merit be accumulated or deeds perfected? Only through this special transmission, which requires no strenuous effort, no expenditure of a single coin—only a single heart aligned with the transformations of creation, embodying principle in this very body. With unwavering sincerity and unceasing practice, no result will fail to manifest, no merit will fail to be perfected. The method is supremely simple and easy: it is nothing more than attaining the clarity of heaven and the stillness of earth.\n\nThus, the mind is heaven, the body is earth, and spirit is the human. When this is embodied, why seek governance beyond the self? Yet these are celestial mysteries, which the sages of old never divulged—until Ni Wan revealed them. I have inherited and recorded them, hence I still call it *Revealing the Celestial Mystery*.\n\nMin Xiaogen says: The *World-Rectifying* tradition is the hidden treasure of the Vinaya school, formerly transmitted only orally. Though this text does not expound it, out of prudence, since the chapter titles have been detailed, the general outline should be briefly sketched. If one doubts this principle, let them read the *Platform Sutra of the Sixth Patriarch*. Having received the master’s instruction, I respectfully supplement and record it here.\n\nRespectfully noted by the later student Min Yide on the seventh day of the seventh month in the *gui-si* year of the Daoguang reign.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "泄天机 金液大还直指 至道药物，固是三才。 而生成妙义，不外二五。 凡人下手，总以神充气足入门，神充气足，真精乃生，真精发生，气神乃保，盖以精竭则神飞，神亡则气散。 而气自心生，精由身出。 识此妙义，还返圣功，不过身心混化。 则此生成至道，不外乎此。 泥丸氏曰：气属天，精属地，神则属人。 盖以人禀二五之精而成，则人即天地，天地即人。 故完天地之道，法天象地，不外一我。 其法惟何？ 心如天之清，身如地之宁。 克清克宁，即天即地矣！ 从而大还。 学造自然而已。 造极之诀，不外至诚无息焉尔。 其得无息者，学承二五之精故，故尔泥丸氏曰：学惟至诚无息，乃得金液大还。 然非自内自外，先哲谓自虚无是也。 盖言道本至虚，体本至无，则知金液大还，还自道体也，学循道体，是即太上所谓识得一，万事毕也夫！ 闵小艮曰：谨按是书，书名篇目，洵出神人口授，乃体其文，决非口述原本。 定经后人参杂。 故都玉石错砌，不以增删，误后非细，爰纂神人口授太虚诚斋玄论，成章於左，惜未经证先哲，录以待证高明云。 筑基全凭橐龠 凡人神生於精，精生於气，五气融充，发为营卫，补益阴阳，化为精髓。 然或体流则精泄，若人不知保惜道体，则精流而髓从，渐渐耗竭矣。 凡今世人，无不下手於既破之后，则其下手也，必先立基。 其立基也，必自调心始。 心调气和，则可冀造真息。 真息也者，盖即南华之踵息，泥丸谓为胎息之由。 而籍意引，未造自然。 一成胎息，则直与天地合德，而中无容心处。 呼则随呼，吸则随吸，一如橐龠。 吸吸呼呼，循环不息，是谓真息。 真息既调，意到即现，阖开自如，不假意念，只须依法开接。 上下鹊桥，微以胸膈撑开，将心中之气，降下少腹，存於坤宫中极。 谓之虚心实腹。 两手将肾茎并阴囊，兜捧使热，若举更妙，令我之阳气发露，则天地之阳气方应，得招摄入我身中也。 切不可着意於彼，拨动欲念，欲火一炽，原阳乱动，反被天地消受我身阳气而去矣。 故尔只要心息相依而已。 泥丸氏曰：学於此际，用意存养，且须听降禁升，迨到丹田火炽，两肾汤煎，约经九息，乃以意引，穿闾后透，自得五龙捧圣之验，然有破脊烧关撒壁入脑声势，切戒惊惶，而忽洞府瞥启，得有闻所未闻，见所未见，尤戒眷恋。 寂守久之，但觉下降得有甘露霈洒，咽不胜咽，由重楼达降阙，加得凉趣袭心，安泰难状，迟忽坠下，变若汤倾，而觉遍体冲和，功造此后，人道尽矣，续事仙道，可无躐等之弊。 仙道维何？ 乃於阳生之际，法用天目，照於阴跷，但随真息阖辟，微微吸动阴跷，随息起伏，行造若亡，自觉尾闾之前，启有灵窍，现觉窍内飕飕然，如磁吸针，天地之真气，入於阴跷，升从脊前心后夹缝中，直达泥丸，学须存留，约至三五息，听下华池，降由重楼下阙下丹田，两地均须存留约有三五息，又至阴跷，吸接后息所入之气，而须大存九息，始听上升。 此后行持，一听自然。 盖已得寓升降於阖辟之中也。 泥丸氏曰：如是行持，不计遍数，造至循环无端，迨到二气相停，惟觉遍身融畅，然其初得，或有四肢若山石，而身若木墩者，乃我身中伏阴之气，见此阳气攻击欲去，故有此沉重幽爽之状。",
      "translated_text": "**The Divine Mechanism Revealed: Direct Pointers to the Great Return of Golden Elixir**\n\nThe medicines of the supreme Dao and the substances of the consummate Way are fundamentally the Three Powers. Yet the wondrous principles of generation and completion lie beyond the Two and Five. For all practitioners, entry begins with the fullness of spirit and sufficiency of qi. When spirit is full and qi is sufficient, true essence is born; when true essence arises, qi and spirit are preserved. For when essence is exhausted, spirit flees; when spirit perishes, qi scatters. Qi is born of the heart, while essence issues from the body. Grasping this wondrous principle, the sacred work of return and reversal is nothing more than the fusion of body and mind. Thus, the generation and completion of the supreme Dao lie in this alone.\n\nMaster Mud-Pillow said: Qi belongs to Heaven, essence to Earth, and spirit to Man. Since man is formed by receiving the essence of the Two and Five, man is Heaven and Earth, and Heaven and Earth are man. Therefore, to perfect the Dao of Heaven and Earth, to model Heaven and emulate Earth, is nothing beyond the self. What is the method? The heart is as clear as Heaven, the body as tranquil as Earth. Achieving clarity and tranquility, one becomes Heaven and Earth! From this, the Great Return proceeds. The work of cultivation is simply to attain spontaneity. The secret of reaching the ultimate lies in nothing more than utmost sincerity without ceasing. Those who attain ceaselessness do so by inheriting the essence of the Two and Five. Thus, Master Mud-Pillow said: Only through utmost sincerity without ceasing can one achieve the Great Return of Golden Elixir. Yet this is neither from within nor without; the ancient sages called it \"from emptiness and nothingness.\" For the Dao is fundamentally the most empty, and its substance is the most non-existent. Thus, the Great Return of Golden Elixir is the return to the substance of the Dao. To cultivate in accordance with the substance of the Dao is what the Most High meant by \"recognizing the One, and all things are complete.\"\n\nMin Xiaogen said: Carefully examining this text, its title and chapter headings indeed derive from the oral transmission of a divine person. Yet the composition of its content is clearly not the original oral version. Later hands must have interspersed additions. Thus, jade and stone are mixed together. Without emendation, the harm to later generations would be no small matter. Therefore, I have compiled the *Profound Discourse of the Sincere Studio of Supreme Emptiness*, based on the oral transmission of the divine person, and presented it here. Alas, it has not yet been verified by the ancient sages, so I record it awaiting confirmation by the wise.\n\n**Foundation-Laying Relies Entirely on the Bellows**\n\nFor all people, spirit is born of essence, and essence is born of qi. When the five qi merge and fill the body, they manifest as the constructive and protective energies, nourishing yin and yang and transforming into essence and marrow. However, if the body flows, essence leaks. If one does not know how to preserve the substance of the Dao, essence flows and marrow follows, gradually depleting. All people in this world begin practice only after damage has occurred, so when they begin, they must first establish a foundation. To establish this foundation, one must start with regulating the mind. When the mind is regulated and qi harmonized, one may hope to attain true breathing.\n\nTrue breathing is what *Nanhua* calls \"heel breathing,\" and what Master Mud-Pillow refers to as the origin of embryonic breathing. Yet relying on intention to guide it does not achieve spontaneity. Once embryonic breathing is accomplished, one directly unites in virtue with Heaven and Earth, with no room for the mind in between. Exhaling follows exhalation, inhaling follows inhalation, like a bellows. Inhaling and exhaling in ceaseless circulation—this is true breathing. Once true breathing is regulated, intention manifests immediately, opening and closing naturally, without relying on mental effort. One need only follow the method to open and connect.\n\nThe upper and lower magpie bridges are gently propped open with the diaphragm. The qi in the heart is lowered to the lower abdomen and stored in the extreme of the Kun Palace, called \"emptying the heart and filling the abdomen.\" Both hands cup the penis and scrotum, lifting and warming them—raising them is even better—so that one’s yang qi is emitted. Then the yang qi of Heaven and Earth responds, drawn into one’s body. One must not fixate on it or stir desire, for if the fire of desire flares, original yang becomes chaotic, and instead of absorbing the yang qi of Heaven and Earth, one’s own yang qi will be consumed by them. Therefore, one need only keep the heart and breathing interdependent.\n\nMaster Mud-Pillow said: At this stage of practice, one must use intention to nurture and preserve, allowing descent and forbidding ascent. When the fire in the Cinnabar Field blazes and the two kidneys boil like a decoction, after about nine breaths, use intention to guide it. Penetrating the spine from behind, one will experience the verification of the Five Dragons Bearing the Sage. There may be sensations of the spine breaking, the pass burning, and the wall scattering into the brain—one must not be alarmed. Suddenly, the grotto palace may open, revealing what has never been heard or seen. One must guard against attachment. Abiding in stillness for a long time, one will feel sweet dew pouring down, so abundant it cannot all be swallowed. Descending from the Tower Chamber to the Descending Gate, a cool delight pervades the heart, bringing indescribable peace. After a while, it sinks down, transforming like boiling water, and one feels harmony surging throughout the body. After achieving this, the human Dao is complete, and one may proceed to the immortal Dao without the flaw of skipping stages.\n\nWhat is the immortal Dao? When yang arises, use the Heavenly Eye to illuminate the Yin Heel vessel. Simply follow the opening and closing of true breathing, gently inhaling to activate the Yin Heel, rising and falling with the breath. Practicing as if nothing exists, one will feel a numinous aperture open before the coccyx. Within it, a rustling sensation arises, like a magnet attracting a needle. The true qi of Heaven and Earth enters the Yin Heel, ascending along the spine before the heart and behind the back, straight to the Mud-Pillow. One must retain it for about three to five breaths, then allow it to descend to the Flower Pool, passing through the Tower Chamber and Descending Gate to the lower Cinnabar Field. Both places require retention for about three to five breaths. Then, at the Yin Heel, absorb the qi that entered with the previous breath, and retain it for nine breaths before allowing it to ascend. Thereafter, practice follows spontaneity, for one has already embedded ascent and descent within opening and closing.\n\nMaster Mud-Pillow said: Practicing thus without counting repetitions, one proceeds until circulation is endless. When the two qi balance, the entire body feels harmonious and comfortable. Initially, one may experience limbs as heavy as mountains and the body like a wooden stump. This is because the latent yin qi in the body, encountering this yang qi’s attack, seeks to depart, hence the sensations of heaviness and dullness.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1236,
      "start_sentence": 0,
      "end_sentence": 46,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.631115436553955,
      "metadata": {
        "source_file": "dao\\藏外\\泄天机.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "片晌阴尽，清快难名，向后每一行持，火足身轻，神悦美好之景，日进日增，元阳渐茂，元气冲和，化身中阴垢而为元和之精，化心中凡焰而为真一之气。 髓固精凝，永无渗漏妄泄之患，基址坚实，丹家外户具矣。 是云身不动也。 然身不动之义，不但精固，即涕汗津液七般俱无，即见可欲而不动。 且经所谓精足不思淫，皆主身不动而言也。 闵小艮曰：丹家理气，原有三道，曰赤，曰黑，曰黄。 赤乃任脉，道在前，心气所由之路，心色赤，故曰赤道，而赤性炎上，法必制之使降，则心凉而肾暖，黑乃督脉，道在后，肾气所由之路，肾色黑，故曰黑道，而黑性润下，法必制之使升，则髓运而神安。 原斯二道，精气所由出，人物类以生存者，法故标曰人道，丹家医家详述如此。 黄乃黄中，道介赤黑中缝，位在脊前心后，而德统二气，为阖辟中主，境则极虚而寂，故所经驻，只容先天，凡夫仙胎之结之圆皆在斯境，虽有三田之别，实则一贯，法故标曰仙道。 然为先哲宝秘，故尔丹书充栋，鲜敢备述，周秦迄明，法皆口授，而受必三更盟授。 先师太虚翁曰：授而笔之书者，始自蓬头尹氏，我师泥丸神人也，然亦不过略示端倪者，盖以心性未明，后凡体踞，而质禀好奇且躁，兼之世多外道，总以闻见开导，此与道体显背，何论其他。 得今肃读是篇，抹煞赤黑，迳述黄中，天机仍未直泄，得何敢隐？ 不为补述，辜负神人，爰为补述成章，见者谅之。 炼己须用真铅金水铸剑采先天 己者土也，土者意也，即至诚无妄真意是也。 心属火，妄想情欲，皆属后天，炽灼奔驰，难以遏灭，必得先天水中真金元阳真精一点，方能绝其凡焰，变成真意，丹家所谓黄中黄庭，而又谓之金鼎神室，故能有方无方，无体而体者。 按前筑基之始，己备炼己，而有相须妙用，但前以汞投铅，炼铅产金，在人身为炼形，资养真精，至此节方是以铅投汞，水火既济，在人身为炼精化气，而成金丹神室也。 秘诀，在阳举之时，即活子时，急宜采取，然活子时，亦有先天后天之不同，悟真所谓两般作用是也。 若见可欲，有触动念起者，乃后天人心，从欲念至者也。 此时只用追摄法，上下关按定，安体静心，垂帘下照阴跷转尾上升，鼓动橐龠，迳透虚空，则其念自灭，其欲自熄，此虽阳气，内带欲火，倘住泥丸，而无点化之法，则后来积聚数满，必致喷顶坐化，救法，须用天目，自绕泥丸，用意左旋三十六转，右旋二十四转，少停，则此阳气，亦自化为寒泉，而下入绛宫，并即散归脉络矣。 静坐片时，亦得小补。 若乃先天活子时，或半夜子时，或丑寅时，静极生阳，身中凡阳真气，应天地之阳气而发，不由情念气触而生，乃天心真一元阳之气也。 然此时，有经有度，不得太过不及，不及，则火未极而金不现，若采之，乃火也，则药销铄而无用。 太过，则金化水而成质，若采之，乃水也，秽浊而害事。 故经曰：铅遇癸生须急采，金逢望远不堪尝。 须以识金水平分，冬至子半，天心无改，万物未生之际，其阳坚极，阴跷与尾闾，有虫蚁蠕动之状，乃其候也，急用手诀，缓提谷道，并提小便，鼓动橐龠，则吾身之真气，遂引天地之阳气，从尾闾飕飕而入，随橐龠巽风升上泥丸，定观不动，则斯阴阳二气，化为玉露，下洒绛宫，此液一点，凡焰全消，而元气出现，与之相交，入於黄中，结成一块死朱，称之为己也。",
      "translated_text": "When the yin dissipates in an instant, an indescribable clarity and joy arise. Thereafter, with each practice, the fire suffices and the body feels light, while the spirit delights in ever more beautiful and wondrous scenes, advancing day by day. The primordial yang gradually flourishes, and the primordial qi surges in harmony, transforming the yin impurities within the body into the essence of primal harmony, and transmuting the mundane flames within the heart into the qi of the True One. The marrow solidifies and the essence congeals, forever free from the afflictions of leakage or reckless dissipation. The foundation is firmly established, and the outer gate of the alchemical household is complete. This is called \"the body unmoving.\"\n\nYet the meaning of \"the body unmoving\" extends beyond the firmness of essence: even tears, sweat, and the seven bodily fluids vanish entirely, and one remains unmoved even when encountering desires. Moreover, as the classics say, \"When essence is sufficient, one does not think of lust\"—all these refer to the body unmoving.\n\nMin Xiaogen said: In the alchemical regulation of qi, there are originally three paths: the red, the black, and the yellow. The red is the Conception Vessel, the path in front, the route through which the heart’s qi flows. The heart is red in color, hence it is called the red path. Yet the nature of red is to blaze upward, so the method must restrain it and cause it to descend, thereby cooling the heart and warming the kidneys. The black is the Governor Vessel, the path behind, the route through which the kidneys’ qi flows. The kidneys are black in color, hence it is called the black path. Yet the nature of black is to moisten and descend, so the method must restrain it and cause it to ascend, thereby circulating the marrow and calming the spirit. These two paths are the routes through which essence and qi emerge, enabling the existence of all beings. Thus, the method designates them as the \"human path,\" which both alchemists and physicians describe in detail.\n\nThe yellow is the Yellow Center, the path lying between the red and black, situated before the spine and behind the heart. Its virtue governs the two qi, serving as the master of opening and closing. Its realm is utterly empty and still, so only the primordial can traverse and abide there. The formation and perfection of the immortal embryo for both ordinary beings and immortals occur within this realm. Though there are distinctions among the three fields, in truth they are one continuum. Thus, the method designates this as the \"immortal path.\" Yet because it was treasured and kept secret by the ancient sages, alchemical texts fill the shelves, yet few dare to expound it fully. From the Zhou and Qin dynasties through the Ming, the teachings were transmitted orally, and the transmission required a midnight oath.\n\nMy late teacher, Master Taixu, said: The first to commit the teachings to writing was Yin the Disheveled, my teacher, the Mud-Pillow Immortal. Yet even he merely hinted at the beginnings, for if the nature of the heart-mind is not understood, later generations, being of ordinary constitution, will be prone to curiosity and impatience. Moreover, the world abounds with heterodox teachings, all relying on sensory knowledge for instruction—this is diametrically opposed to the essence of the Dao, let alone other matters.\n\nNow, upon solemnly reading this text, it omits the red and black and directly describes the Yellow Center. The celestial mechanism remains unexposed, so how dare I conceal it? Failing to supplement it would betray the Immortal. Thus, I have composed this supplementary chapter; may readers forgive me.\n\n**Refining the Self Requires True Lead and Golden Water to Forge the Sword and Gather the Primordial**\n\nThe \"self\" is earth; earth is intention—specifically, the perfectly sincere and unerring true intention. The heart pertains to fire, and delusive thoughts and desires all belong to the postnatal. Blazing and racing, they are difficult to extinguish. Only with a speck of true gold from the primordial water—the primordial yang’s true essence—can the mundane flames be extinguished and transformed into true intention. This is what alchemists call the Yellow Center within the Yellow Court, also known as the golden tripod or the spirit chamber, for it can be bounded yet boundless, formless yet embodied.\n\nAccording to the earlier foundation-building, the self was already refined, and there was a wondrous mutual dependence. Previously, mercury was cast into lead to refine lead and produce gold, which in the human body corresponds to refining the form and nourishing the true essence. Only at this stage is lead cast into mercury, achieving the harmony of water and fire. In the human body, this corresponds to refining essence into qi and forming the golden elixir’s spirit chamber.\n\nThe secret method lies in the moment of yang arousal, the living midnight. Yet the living midnight also differs between the primordial and the postnatal, as the *Awakening to Reality* describes as \"two kinds of function.\" If desire is aroused by sensory encounter, giving rise to thoughts, this is the postnatal human heart, stirred by desire. At this time, one must employ the method of pursuit and restraint: secure the upper and lower gates, settle the body and calm the heart, lower the eyelids to inwardly illuminate the Yin Heel, and guide it upward from the tailbone. Stir the bellows to penetrate the void, and the thought will vanish, the desire will extinguish. Though this yang qi carries the fire of desire, if it lingers in the Mud-Pillow Palace without the method of transmutation, its accumulation will eventually erupt through the crown, leading to seated transformation. The remedy is to use the Celestial Eye to encircle the Mud-Pillow Palace, rotating the intention thirty-six times to the left and twenty-four times to the right. After a brief pause, this yang qi will naturally transform into a cold spring and descend into the Crimson Palace, dispersing into the meridians. Even a short period of tranquil sitting yields minor benefits.\n\nAs for the primordial living midnight—whether at midnight, the hour of *zi*, or the hours of *chou* and *yin*—when stillness gives rise to yang, the body’s ordinary yang qi responds to the yang qi of heaven and earth and arises, not generated by emotional thoughts or qi stimulation. This is the true one’s primordial yang qi of the celestial heart-mind. Yet at this time, there is a proper measure: it must neither be excessive nor deficient. If deficient, the fire is insufficient and the gold does not appear; if gathered, it is mere fire, and the medicine will be consumed, rendering it useless. If excessive, the gold transforms into water and becomes substantial; if gathered, it is mere water, foul and harmful.\n\nThus, the classic states: \"When lead encounters *gui*, gather it swiftly; when gold meets the full moon, it is unfit to taste.\" One must recognize the equilibrium of gold and water. At the winter solstice, the celestial heart-mind remains unchanged, and in the moment before the myriad things are born, the yang is at its firmest. The Yin Heel and tailbone exhibit a sensation like insects crawling—this is the sign. Swiftly employ the hand seal: gently lift the perineum and the urethra, stir the bellows, and the body’s true qi will draw the yang qi of heaven and earth to enter from the tailbone with a rustling sound. Following the bellows’ *xun* wind, it ascends to the Mud-Pillow Palace. Maintain steadfast observation without movement, and these yin and yang qi will transform into jade dew, sprinkling down into the Crimson Palace. This droplet extinguishes all mundane flames, and the primordial qi emerges to meet it. Entering the Yellow Center, they coalesce into a lump of cinnabar, which is called the \"self.\"",
      "overlap_context": "one has already embedded ascent and descent within opening and closing.\n\nMaster Mud-Pillow said: Practicing thus without counting repetitions, one proceeds until circulation is endless. When the two qi balance, the entire body feels harmonious and comfortable. Initially, one may experience limbs as heavy as mountains and the body like a wooden stump. This is because the latent yin qi in the body, encountering this yang qi’s attack, seeks to depart, hence the sensations of heaviness and dullness.",
      "start_char": 1236,
      "end_char": 2526,
      "start_sentence": 47,
      "end_sentence": 72,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.65624141693115,
      "metadata": {
        "source_file": "dao\\藏外\\泄天机.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "然经曰：分明一味水中金，则知丹家始终，只此一物一事。 按前止言橐龠，至此炼铅金，生真精，言产铅金中之水，用以制火为土也。 而功夫尚属操持，故称炼己，炼己以后，则真土已就，乃采天地之气，化土生金，而成乾阳金液之丹。 此药所以有浅深，而各以境殊也。 得药方施烹炼抽添火候不忒方为陆地神仙 烹者，阳烹； 炼者，阴炼。 得药必在活子，乃身中一阳来复之时，二候所得之大药也。 自下手筑基炼己，俱有采药之功，此又重出发明者，前之采药，为修鼎炉，今之采炼，用成还丹也。 必俟夜半清静之子，天机自动，外阳举时，谓之天人合发，未可便采，还须用意助之，谓之进阳火，直至龟眼圆睁，龙身直竖，正是火候。 只用意目，普照下田，意乃真意，目则天目也，嗣必田现黍珠，内外二气，觉相引从，从微至着，自觉真气愈吸愈来，关窍之间，如蚁蠕动，胸腹颈背，真光隐现，此是真金气满，天癸正生之时也，急须采之。 乃用武火，提小便，摄谷道，掀少腹，开橐龠。 少顷，便觉此药自化真气，随即用意后导，自必飕飕升透，乃是由督达脑，抵镇而止，镇乃人镇，顶谷是也，此骨成自落地以后，一身生气升成之物，上应天镇，天镇也者，五星之中星，大地精华升结之星。 辰位天罡之主，光照则生，光注则化。 照乃普照，注则入注。 造化赖以生成，至人假以结蜕者，今则假以会罡合任而前降，乃由天目，分经池柱，下停绛阙。 池则上池，人口是也，柱乃鼻柱，山根是也。 法於抵镇，即脑迎星，星乃天镇。 迎以化凡而返先。 至要要用，故必数之九息，非有留恋而然，盖俟元阳气化甘露，分随罡镇，霈下池阙，此一露也，清凉香美，玄用无穷，而其霈随罡镇，更有玄义。 泥丸氏曰：有形之露，随罡点阙，无形之露，随镇归黄，故凡露由鹊桥，下停绛阙者，概籍口咽，乃得经楼抵关，而有阴阳清浊之别，至人於此，乃以阴浊存化血液，流行脉络，以其清阳融落中黄，与我元气交接，随同真意，即於中宫，左上右下，自小至大，顺运三十六转，又於右胯，右上左下，自大至小，逆旋二十四转，止於中宫之中，谓之卯酉周天。 静坐片时，或起或睡，任意施事，不必追寻落在何处，住於何地，惟觉融化於虚静不着之中，亦为神息胞胎真气之实际，方其得药升降，定觉周身畅美，切忌贪着，一或染着，立变凡后，为祸非细。 法於事后，只守真息，浮游规中，不得外求，如此日采日炼，至於爻满铢盈，三田充足，两肾汤暖，气海火炽，玉液浮空，大药将生，即须入圜，候结产婴，以臻天仙大道。 谨秘谨秘！ 再求大药证金仙火候修持九转 大药者，金液大还，天仙之大药也。 即悟真所谓学仙须是学天仙，惟有金丹最的端是也。 前药乃外真铅，是谓外金丹，又名玉液还丹，地仙之药物也。 玉液既满，急宜入圜，寂俟金液产生，点化元神，结成圣胎，点化元气，凝为神宝。 须择名山福地，筑立圜室。 高低明暗适宜，用志心道友三人卫护。 房中设平榻一张，四面帏帐，上悬明镜，左右插剑，床下镇雄黄三斤，上置蒲团，并混元衣一领，起臀一个，余外不安一物於前，四维安列八卦，须择吉奏达上帝。",
      "translated_text": "Yet the classic states: \"Within a single flavor of water lies gold,\" revealing that the alchemical tradition, from beginning to end, concerns but this one thing, this one matter. Previously, only the bellows was mentioned; here, refining lead into gold and generating true essence speaks of producing the water within lead-gold, which is used to restrain fire and form earth. This practice still belongs to the work of discipline, hence it is called \"refining the self.\" After refining the self, true earth is established, and one then gathers the qi of heaven and earth to transform earth and generate gold, thereby forming the elixir of pure yang gold-liquid.\n\nThe medicine thus possesses depths and shallows, each differing according to the realm. Only when the medicine is obtained and the firing process—withdrawing and adding fire without error—is applied does one become an immortal upon the earth. \"Cooking\" refers to yang cooking; \"refining\" refers to yin refining. The medicine must be obtained at the *living midnight*, the moment when the single yang revives within the body, the great medicine acquired in the second watch. From the initial work of laying the foundation and refining the self, all involve the practice of gathering medicine. This is reiterated for clarity: the earlier gathering of medicine served to cultivate the cauldron and furnace, while the present gathering and refining aim to complete the returning elixir.\n\nOne must await the quiet midnight hour, when the celestial mechanism stirs of itself, and the external yang arises—this is called the union of heaven and human. Yet one must not gather immediately; rather, one must assist with intention, called \"advancing the yang fire,\" until the tortoise’s eyes round and the dragon’s body stands erect, precisely the firing time. Use only the mind’s eye to illuminate the lower field: the mind is true intention, the eye is the celestial eye. Then, the field will manifest a millet-like pearl, and the inner and outer qi will sense each other’s attraction, growing from subtle to manifest. One feels the true qi drawing in more intensely, with the sensation of insects crawling between the orifices. The chest, abdomen, neck, and back reveal hidden glimmers of true light—this is when the true gold qi is full and the celestial water is just being born. One must swiftly gather it.\n\nEmploy the martial fire: lift the urethra, contract the perineum, raise the lower abdomen, and open the bellows. After a moment, one senses this medicine transforming into true qi, which must then be guided upward with intention. It will surely ascend with a rustling sound, rising along the Governing Vessel to the brain, halting at the *zhen* (pillar). The *zhen* is the human pillar, the crown of the head, a structure formed after birth as the body’s vital qi ascends. It corresponds to the celestial pillar, the central star among the five stars, the congealed essence of heaven and earth. The *chen* position governs the celestial stem, whose light, when shining, gives life, and when concentrated, effects transformation. \"Shining\" means universal illumination; \"concentration\" means focused infusion. Creation relies upon it for generation and completion, while the perfected one borrows it to refine the body. Now, it is used to meet the stem and merge with the Conception Vessel, descending from the celestial eye along the pool and pillar: the pool is the upper pool, the mouth; the pillar is the nose bridge, the mountain root. The method of reaching the *zhen* is to greet the star in the brain—the star is the celestial pillar—thereby transforming the mundane and returning to the primordial.\n\nThis is of utmost importance, hence it must be held for nine breaths—not out of attachment, but to await the primordial yang qi transforming into sweet dew, which follows the stem and pillar to shower down upon the pool and palace. This dew is cool, fragrant, and sweet, its mysterious function boundless. Moreover, its showering along the stem and pillar holds profound significance. The Master of the Mud-Pillow says: \"The tangible dew follows the stem to dot the palace; the intangible dew follows the pillar to return to the Yellow Center.\" Thus, all dew descending via the Magpie Bridge to rest in the Crimson Palace must be swallowed through the mouth to pass through the tower and reach the barrier, where it divides into clear yang and turbid yin. The perfected one at this stage stores the turbid yin to transform into blood and fluids, circulating through the meridians, while the clear yang merges into the central Yellow, uniting with one’s primordial qi. Following the true intention, within the central palace, it revolves left-up and right-down from small to large for thirty-six cycles, then right-up and left-down from large to small for twenty-four cycles, halting at the center of the central palace—this is called the *mao-you* circumpolar revolution.\n\nSit in stillness for a while, then rise, sleep, or act as one pleases, without seeking where it settles or where it resides. Only when it feels dissolved into emptiness and non-attachment does it become the true reality of the spiritual breath and the womb of primordial qi. Upon obtaining the medicine and completing its ascent and descent, one feels the entire body at ease and blissful. Beware of attachment, for even a trace of clinging instantly reverts one to the mundane, inviting no small calamity. After the practice, guard only the true breath, floating and roaming within the pupil, without seeking externally. Thus, daily gathering and refining will fill the hexagrams and accumulate grains, filling the three fields, warming the two kidneys like boiling water, igniting the qi sea with fire, and floating the jade liquid in the void. When the great medicine is about to form, one must enter the enclosure to await the birth of the infant, thereby attaining the great Dao of celestial immortality. Guard this closely! Guard it well!\n\n---\n\nTo seek the great medicine and verify the golden immortal’s firing process for nine revolutions:\n\nThe great medicine is the great returning of gold-liquid, the great medicine of celestial immortals. It is what the *Wuzhen Pian* calls: \"To learn immortality, one must learn celestial immortality; only the golden elixir is most certain.\" The previous medicine was external true lead, called the external golden elixir, also named the jade-liquid returning elixir, the medicine of earthly immortals. Once the jade-liquid is full, one must swiftly enter the enclosure to silently await the birth of the gold-liquid, which will transmute the primordial spirit into the sacred embryo and congeal the primordial qi into the divine treasure.\n\nChoose a blessed mountain and auspicious site to construct the enclosure. Its height, depth, brightness, and darkness must be appropriate. Engage three devoted Daoist companions to guard it. Within the chamber, place a level couch draped with curtains on all sides. Hang a bright mirror above, and place swords to the left and right. Beneath the bed, lay three *jin* of realgar, and upon it, a meditation cushion and a *hunyuan* robe, along with a bolster. Allow no other objects before it. Arrange the eight trigrams at the four corners. Select an auspicious time and report to the Celestial Emperor.",
      "overlap_context": "true qi will draw the yang qi of heaven and earth to enter from the tailbone with a rustling sound. Following the bellows’ *xun* wind, it ascends to the Mud-Pillow Palace. Maintain steadfast observation without movement, and these yin and yang qi will transform into jade dew, sprinkling down into the Crimson Palace. This droplet extinguishes all mundane flames, and the primordial qi emerges to meet it. Entering the Yellow Center, they coalesce into a lump of cinnabar, which is called the \"self.\"",
      "start_char": 2526,
      "end_char": 3741,
      "start_sentence": 73,
      "end_sentence": 104,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.00327467918396,
      "metadata": {
        "source_file": "dao\\藏外\\泄天机.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "入圜静坐，无为无着，一意规中，身如槁木，跏跌端坐，昼夜不间，只存胎息，神气相抱，不出不入，如在母腹，外人视之，宛同不省人事，是乃归根复命，金液产生之际，有或七日十四日，甚有二十一日者，志友护卫，不可暂离，大戒音扰，尤忌声惊，盖以学者斯时，神休应谷，音触则觉，声触则惊，觉虑出定，养功失矣。 惊则神散，祸莫大焉，泥丸故曰：外护一职，生死系之。 学者得此，内必现月一轮悬於西，又现日如悬於东，寂而守之，两轮必相吞吐，旋竟合璧，悬於谷前，长春有言曰：学於斯时，全赖知音志友，从旁谛审寂守，但得学者眉间，一放光明，须即通知，无劳声达，第以音传，学自神会，应用心罡，引镇眷注，则神自休谷，自得感生大药，随罡合元，融成珠若也。 学造此境，已与太虚神通气贯，无复三界六合可分，盖即丹经金归性初之候，而珠即神宝也，神宝即金仙也，神宝既得，还须加行十月温养，谨持九转，始得胎完珠化，身证圣婴。 然此温养，此火候，与前不同，前有抽添升降之别，此则一意规中，如春沼鱼，如百虫蛰，吸聚元阳，灵气不散，招摄太虚，培育元精。 此一步也，全仗罡镇两星，刻时葆照，而功法不外若存若亡、勿忘勿助焉。 泥丸氏曰：意不可散，意散则火冷，念不可起，念起则火炎，二俱伤胎，切宜详慎。 如此一年，实则九月之功，故谓之九转。 一年除二八两月，不用火功者，非撒手抛空，竟置膜外，只如无心照顾，不复加意耳。 然退火则水潮清静之象，乃沐浴之候，灌溉黄芽之时，此法只以结丹日，为十一月冬至节，算至九十日，候即沐浴一节，为二月节，月以结丹之日为初一日，至八月二十三沐浴一节，至次月一日，又为十二月初一日也 ，则以结胎之时，至第四时为卯，第十时为酉月也 ，以此活法，温养沐浴，九转火足，气候圆满，婴儿欲动，还宜自问，曾否到返还功纯，如后凡悉化悉销者，自必动定一如，驻世升遐，惟其所愿，盖已即身即世、即地即天，与道合真，何有出入升降高下远近凡胜(疑作圣)乎 哉 ！",
      "translated_text": "Enter the enclosure and sit in stillness, practicing non-action and non-attachment, focusing the mind within the *guan* (inner elixir field). Let the body be like withered wood, sit in full lotus posture, and remain thus day and night without interruption. Only maintain fetal breathing, where spirit and *qi* embrace each other, neither issuing forth nor entering in—like being within the mother’s womb. To outsiders, one appears as if unconscious, for this is the moment of returning to the root and restoring life. The birth of the gold-liquid may take seven, fourteen, or even twenty-one days. The devoted companions must guard without the slightest lapse, strictly avoiding any disturbance by sound, and especially shunning startling noises. At this time, the adept’s spirit rests in the valley of response; sound may rouse awareness, and noise may cause alarm. If awareness stirs, one falls out of concentration, and the nurturing practice is lost. If startled, the spirit scatters—no misfortune could be greater. As the *Nihuan* states: \"The role of external protection is tied to life and death.\"\n\nWhen the adept reaches this stage, a moon-like wheel will appear suspended in the west, and a sun-like orb will manifest in the east. In stillness, guard these two wheels as they alternately swallow and spit, eventually merging into a single luminous sphere suspended before the valley. As *Changchun* said: \"At this time, the adept relies entirely on understanding companions who, from the side, carefully observe and silently guard. When a radiant light appears between the adept’s brows, they must be promptly informed—not by voice, but by sound alone—so the adept may inwardly comprehend, apply the mind’s *gang* (celestial pivot), and direct the gaze of the attendant spirits. Then the spirit will naturally rest in the valley, and the great medicine of resonance will be born, following the *gang* to merge with the primordial, fusing into a pearl-like essence.\"\n\nHaving attained this state, the adept’s spirit communes with the Great Void, and *qi* flows unimpeded—no longer divided by the three realms or the six directions. This is the moment when, as the alchemical classics say, \"gold returns to nature,\" and the pearl is the divine treasure, the divine treasure is the golden immortal. Once the divine treasure is obtained, one must proceed with ten months of gentle nurturing and carefully sustain the nine revolutions to complete the embryo’s formation and transform the pearl, thereby embodying the sacred infant.\n\nYet this nurturing and firing differ from earlier stages. Before, there were distinctions of withdrawal, addition, ascent, and descent; now, one focuses the mind within the *guan*, like fish in a spring pond or hibernating insects, absorbing and gathering primordial yang, preventing the dissipation of numinous *qi*, summoning the Great Void, and cultivating primordial essence. This step relies entirely on the *gang* and the two stellar guardians, which must be preserved and illuminated at every moment. The method lies in neither presence nor absence, neither forgetting nor forcing.\n\nAs the *Nihuan* master said: \"The mind must not scatter, for scattering cools the fire; thoughts must not arise, for arising inflames the fire. Both harm the embryo—utmost care is required.\" Thus, a full year—equivalent to nine months of work—is called the nine revolutions. The two months of February and August are excluded from firing, not as a complete abandonment but as a time of effortless attention, no longer applying deliberate focus. Yet the withdrawal of fire brings the clarity of water’s tide—this is the time for bathing, the moment to irrigate the yellow sprout.\n\nThis method calculates from the day of elixir formation as the Winter Solstice of the eleventh month. Counting ninety days forward, the first bathing occurs at the second month’s node. Taking the day of elixir formation as the first day of the month, the second bathing occurs on the twenty-third day of the eighth month, and the following day becomes the first day of the twelfth month. The time of embryo formation is reckoned as *mao* (the fourth double-hour) for the *mao* month and *you* (the tenth double-hour) for the *you* month. With this flexible method, nurturing and bathing proceed until the nine revolutions of fire are complete, the *qi* and timing are fulfilled, and the infant stirs.\n\nBefore proceeding, the adept must self-examine: Has the work of returning and refining reached purity? If all residual mundanity has dissolved, then movement and stillness will be as one, and whether to remain in the world or ascend beyond is a matter of choice. For one has now become the world itself, the earth itself, the heavens themselves—merged with the Dao in truth. What further distinction could there be between entering or exiting, ascending or descending, high or low, near or far, mortal or sacred?",
      "overlap_context": "ss, and darkness must be appropriate. Engage three devoted Daoist companions to guard it. Within the chamber, place a level couch draped with curtains on all sides. Hang a bright mirror above, and place swords to the left and right. Beneath the bed, lay three *jin* of realgar, and upon it, a meditation cushion and a *hunyuan* robe, along with a bolster. Allow no other objects before it. Arrange the eight trigrams at the four corners. Select an auspicious time and report to the Celestial Emperor.",
      "start_char": 3741,
      "end_char": 4530,
      "start_sentence": 105,
      "end_sentence": 118,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.11452579498291,
      "metadata": {
        "source_file": "dao\\藏外\\泄天机.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "倘或凭运而通而化而结而圆，先少后多，未能融化此身，则必预放金光一团，悬於顶上虚际，名曰意珠，上应镇星者。 太虚氏曰：镇为天罡罡主，为坤地真元气升而结，光照则生，光注则化，人物赖以生成者，位在中天，按即五星之中星，高出日月诸星之上。 我师泥丸氏曰：於人身，按即卤门盖骨，此一骨也，人身生气所聚结，成於落地之后，吕神谓为人镇。 其华，金阙谓为意珠，太上用以卫婴者，学人不可不知。 倘得药过早者，用於圣婴既育未壮之时，假取是珠悬於顶上虚际，以补平时还返未纯、识神未化功夫，祛除诱侮，不致被魔吞食耳。 已详正阳末后一着，正阳有言，学造婴成，谈何容易，然而分阴未尽，必有身识勾引外魔朋比串侮，法惟退隐道体，苟或先少后多，则惟混入意珠，自融自化自造，内外冰释，久久身等古佛也。 太虚曰：意珠足珍如此。 然而历祖传经，鲜有备述者，尚因此法，为救下士性根未彻而设，如性光早定者，末后无须此法故也。 随将我身透入，珠随包覆我身，内融外洽，销化后凡，自然淘净，学士惟自存虚寂寂虚以化之。 已而闻见胥泯，到得寂无所寂，真常得性，自与还返功纯一般。 此禀受有不同，入手有各别，安行利行，功成则一。 造物毫无容心焉。 是故证贵自审，乃有留形之驻世，所以尽性正以致命而圆志耳。 闵小艮曰：我侪修道，一生精勤，只为证升，稍或迷昧，前功尽去，今按是篇，削删口授，详述世传，果何心哉？ 爰故删削其述，详为补述师授，并述师训以注以证者，以见神人确有所授，非无根无蒂云尔。 九年面壁绝尘缘始合神仙本愿 欲了本愿，无过面壁一宗，是盖行於得圆未化时也。 泥丸氏曰：是西圣教外别传，启自薄伽筏帝，达摩承之。 於是现身东士，乃有九年之面壁。 自是千百年来，两地人承，鲜识宗旨。",
      "translated_text": "Should the process of aligning with fate—achieving communion, transformation, coagulation, and perfection—proceed unevenly, with lesser progress followed by greater, and the adept’s body remain unrefined, then one must first release a sphere of golden light, suspending it in the void above the crown. This is called the *Mind-Pearl*, corresponding to the Star of Stability above.\n\nMaster Tai Xu states: The Star of Stability governs the celestial pivot, formed by the ascent of Earth’s primordial *qi* from *Kun*. Where its light shines, life arises; where its radiance pours, transformation occurs. All beings depend on it for birth and completion. Positioned at the center of heaven, it is the central star among the five, towering above the sun, moon, and all other stars.\n\nMy master, Ni Wan, says: In the human body, this corresponds to the *lumen* bone at the crown—the bone where the *qi* of life converges after birth. Lü Dongbin called it the \"human stabilizer.\" Its essence is termed the *Mind-Pearl* in the Golden Palace, employed by the Most High to guard the sacred infant. Disciples must not remain ignorant of this.\n\nIf the elixir is attained prematurely, during the phase when the sacred infant has been nurtured but not yet matured, one may temporarily employ this pearl, suspending it in the void above the crown. This compensates for any lingering impurities in the work of returning and refining, or for the untransformed *shen* of consciousness, warding off temptations and humiliations to prevent the infant from being devoured by demonic forces. This has been elaborated in *Zheng Yang’s Final Stroke*. Zheng Yang said: \"To speak of cultivating the infant to completion—how easily is it said? Yet so long as a trace of *yin* remains unexhausted, the body’s residual awareness will inevitably attract external demons, colluding to assail and humiliate. The only method is to withdraw and conceal the Dao-body. If progress has been uneven, then merge into the *Mind-Pearl*, allowing self-fusion, self-transformation, and self-creation. Inner and outer dissolve like ice, and over time, the body becomes equal to that of an ancient Buddha.\"\n\nTai Xu says: The *Mind-Pearl* is thus precious beyond measure. Yet among the transmitted scriptures of successive patriarchs, few have described it in full. This method was devised to rescue those of inferior root-nature who have not yet penetrated their intrinsic nature. For those whose nature-light has stabilized early, this method is unnecessary at the final stage.\n\nThereafter, one’s body merges into the pearl, which in turn envelops the body. Inner fusion harmonizes with outer dissolution, refining away all residual mundanity until it is naturally purged. Disciples must simply abide in emptiness—silent, still, and void—to effect this transformation. Eventually, all perceptions vanish, and when stillness reaches its ultimate stillness, the true and constant nature is attained, no different from the state of pure returning and refining.\n\nThough innate endowments differ and entry points vary, whether proceeding with ease or effort, the fruition remains the same. The workings of creation harbor no partiality. Thus, those who verify their attainment must examine themselves: some may choose to remain in the world in their embodied form, fulfilling their nature to the utmost and perfecting their destiny to realize their aspirations.\n\nMin Xiao Gen says: \"We who cultivate the Dao devote our lives to diligent practice, all for the sake of verification and ascension. Should we falter even slightly, all prior efforts may be lost. Now, in this text, I have edited and expounded upon oral transmissions, detailing what has been passed down through the world. What is my intent? It is to abridge the descriptions while amplifying the master’s teachings, supplementing them with annotations and verifications. Thus, it may be seen that divine beings indeed possess authentic transmissions—not mere baseless claims.\"\n\nNine years of wall-facing severs worldly ties, fulfilling the original vow of immortality. To fulfill this vow, nothing surpasses the practice of wall-facing—undertaken when perfection has been attained but transformation is not yet complete.\n\nNi Wan says: This is a special transmission outside the teachings of the Western Sage, originating with the Buddha Vajra and inherited by Bodhidharma. Manifesting in the eastern lands, he engaged in nine years of wall-facing. Since then, over centuries, practitioners on both sides of the world have received this lineage, yet few grasp its essential principle.",
      "overlap_context": "eding, the adept must self-examine: Has the work of returning and refining reached purity? If all residual mundanity has dissolved, then movement and stillness will be as one, and whether to remain in the world or ascend beyond is a matter of choice. For one has now become the world itself, the earth itself, the heavens themselves—merged with the Dao in truth. What further distinction could there be between entering or exiting, ascending or descending, high or low, near or far, mortal or sacred?",
      "start_char": 4530,
      "end_char": 5244,
      "start_sentence": 119,
      "end_sentence": 138,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.619462490081787,
      "metadata": {
        "source_file": "dao\\藏外\\泄天机.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "而率皆为了性了命，岂知初祖来时，一生性命，行已极圆，故能乘苇飞渡，此明征也。 而仍行夫九年面壁者，特示震旦至人，共行即身即世、即世即心，而功必以面壁入门，是以世治愿始圆耳。 其法备於吕祖《三尼医世功诀》，而行乘色身未脱时，故有乘此生年月日时之训。 吾宗乃全真，全真末后大着，指此步也。 是以道凭行进，功赖德圆，故有三千功八百行之积，然以在下匹夫，功由何积，行由何圆哉。 惟此别传，不劳丝力，不费一钱，只与造化一心，即身以理，但具恒诚而无息，行无不验，功无不圆，其诀至简至易，盖惟致如天之清地之静而已。 是以心即天也，身即地也，而神即人也。 如是体之，何须身外求治乎哉。 然皆天机也，古哲未之汇泄，泥丸氏泄之。 余承而述，故仍以泄天机名之。 闵小艮曰：《医世》一宗，律宗之枕秘，向惟口授。 是书不述，似出谨慎。 然既详述篇目，理应略述端倪，如或不信此理，请读《碧苑坛经》。 得承师训，谨补述之。 道光癸巳年七月七日后学闵一得谨识。",
      "translated_text": "Yet most pursue it merely to refine nature and fulfill destiny, unaware that when the First Patriarch arrived, his nature and destiny were already perfectly realized—so much so that he could cross rivers on a reed, a clear testament to this. Yet he still practiced nine years of wall-facing, specifically to demonstrate to the perfected ones of this land the shared practice of embodying the present life as the present world, and the present world as the mind—with wall-facing as the essential gateway. Only thus does the vow for a governed world begin to attain fulfillment. The method is fully expounded in Lü Zu’s *Three Numinous Principles of World-Rectifying Practice*, yet it is undertaken while the colored body remains untranscended, hence the instruction to ride the hours, days, months, and years of this very life.\n\nOur tradition is that of the Complete Realization, and the ultimate great endeavor of the Complete Realization points precisely to this step. Thus, the Dao advances through practice, and merit depends on the perfection of virtue—hence the accumulation of three thousand merits and eight hundred deeds. Yet for an ordinary person of low station, how can merit be accumulated or deeds perfected? Only through this special transmission, which requires no strenuous effort, no expenditure of a single coin—only a single heart aligned with the transformations of creation, embodying principle in this very body. With unwavering sincerity and unceasing practice, no result will fail to manifest, no merit will fail to be perfected. The method is supremely simple and easy: it is nothing more than attaining the clarity of heaven and the stillness of earth.\n\nThus, the mind is heaven, the body is earth, and spirit is the human. When this is embodied, why seek governance beyond the self? Yet these are celestial mysteries, which the sages of old never divulged—until Ni Wan revealed them. I have inherited and recorded them, hence I still call it *Revealing the Celestial Mystery*.\n\nMin Xiaogen says: The *World-Rectifying* tradition is the hidden treasure of the Vinaya school, formerly transmitted only orally. Though this text does not expound it, out of prudence, since the chapter titles have been detailed, the general outline should be briefly sketched. If one doubts this principle, let them read the *Platform Sutra of the Sixth Patriarch*. Having received the master’s instruction, I respectfully supplement and record it here.\n\nRespectfully noted by the later student Min Yide on the seventh day of the seventh month in the *gui-si* year of the Daoguang reign.",
      "overlap_context": "s vow, nothing surpasses the practice of wall-facing—undertaken when perfection has been attained but transformation is not yet complete.\n\nNi Wan says: This is a special transmission outside the teachings of the Western Sage, originating with the Buddha Vajra and inherited by Bodhidharma. Manifesting in the eastern lands, he engaged in nine years of wall-facing. Since then, over centuries, practitioners on both sides of the world have received this lineage, yet few grasp its essential principle.",
      "start_char": 5244,
      "end_char": 5652,
      "start_sentence": 139,
      "end_sentence": 153,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.397041320800781,
      "metadata": {
        "source_file": "dao\\藏外\\泄天机.txt",
        "category": "藏外"
      }
    }
  ]
}