{
  "source_id": "泥丸李祖师女宗双修宝筏",
  "source_file": "chunked_daozang\\泥丸李祖师女宗双修宝筏.json",
  "total_chunks": 7,
  "total_original_chars": 6026,
  "total_translated_chars": 33135,
  "total_translation_time": 164.69219398498535,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\藏外\\泥丸李祖师女宗双修宝筏.txt",
    "category": "藏外"
  },
  "full_translation": "**The Mud-Pill Master Li’s Precious Raft for Dual Cultivation in the Female Lineage, First Principle**\n\nThe Mud-Pill Master states: In the advancement of women’s practice, one first stills the thoughts, then harmonizes the mind. When thoughts are stilled and the mind harmonized, one may proceed with massage.\n\nThe method cautions against seeking coolness while avoiding warmth. Women, whose foundation is blood, are inherently yin in nature; yin delights in coolness. Without the subtle activation of qi through massage, one easily sinks into pure yin. Yin engenders coolness, and coolness congeals into ice. If no movement is applied, it breeds illnesses such as phlegm stagnation and blood stasis, making progress in practice difficult. Thus, one must begin with stilling thoughts and harmonizing the mind.\n\nWomen belong to *kun*, yet *kun* conceals true fire. When fire is subdued, all is auspicious; when fire flares, it scorches metal. If not regulated through movement, metal, pressed by fire, will manifest the omen of the *han-yin* ascending to heaven. Therefore, the secret of women’s cultivation lies precisely in beginning with stilling thoughts and harmonizing the mind.\n\nIn stilling thoughts and harmonizing the mind, one cannot practice too much, nor is prolonged practice to be avoided—within stillness, there is movement.\n\n**Master Tai Xu states:** When thoughts are stilled, qi becomes pure; when the mind is harmonized, qi becomes balanced. Proceeding with massage then gives rise to the mechanism of yang’s arousal. Yet one must guard against stagnation and restlessness. Women naturally prefer coolness and dislike heat. When thoughts are stilled, the mind harmonized, and qi balanced, if stagnation and restlessness arise, one may be tempted to replenish true yin—this is the cause of pure yin’s turbulent accumulation. Stillness congeals yin; inaction stifles yang. Beginners inevitably encounter this flaw. Without investigating the source of restlessness and vexation, one hastily seeks momentary coolness—this is a grave error! One must apply effort, employing methods to circulate qi. When qi moves, restlessness naturally dissolves. Those who fail to grasp this and seek results only compound their afflictions, leading precisely to phlegm stagnation and blood stasis. Hence, the strict warning.\n\nThe method of continuing with massage is precisely to close this gateway of stagnation and congealment. Moreover, as human nature delights in progress, one may massage too vigorously, causing the earthly fire to blaze and all fires to follow, resulting in the flaw of scorching metal. Thus, the caution against *han-yin* ascending to heaven. *Han-yin* is the bird of *you*; when pressed to its limit, it takes flight and soars upward. Therefore, the text reiterates the subtlety of stilling thoughts and harmonizing the mind. This, indeed, is the essential secret for women’s practice from beginning to end.\n\nThe Second Principle\n\nMaster Niwan states: In women’s refined practice, one begins with the flourishing of yang and concludes with the restraint of yin—this method is most esoteric, and few comprehend it. The deluded follow the male path in their cultivation; the wise turn toward Chan, attaining some fruition and even the power to vanish while seated or standing. Yet they remain mired in ghostly realms, far from the Dao.\n\nFor women, blood is the foundation. When blood is abundant, essence overflows. When the heart is cool, blood is generated. As the ancients said: the refinement of fluid into blood, the transformation of blood into essence, all depend on a clear spirit. Without the transformation of fluid, fluid loses the warmth of spirit, congeals into phlegm, flows into the spleen and stomach, steams upward to the lungs, scatters through the meridians, and gives rise to a hundred diseases. The five viscera suffer calamity, the six bowels meet disaster. Thus, ancient elixir methods always begin by stilling the heart. When the heart is stilled and breath settled, the spirit becomes clear, and the heart cools.\n\nOne must wait until the heart is cool and fluid surges forth, then direct attention to the breast channels, gently rotating and massaging with the hands to ensure the qi mechanism overflows. Next, raise both hands to rotate around the breasts, waiting until the misty vapors swirl completely. Only then will the warming qi suffuse from behind, and the twin passes emit a smoky flame, pressing through the barrier until the entire pass is filled with muddy fluid, which flows into the breast channels like a gushing spring.\n\nThen, with true intention, guide it into the Southern Ocean, silently guarding it for approximately thirty-six breaths. Relax the intention, and feel this essence gently descend, dividing to flow into both flanks, spiraling left and right for another thirty-six breaths each. Next, gather it with single-minded focus into the deep center of the navel wheel, slowly rotating forty-nine times, then swiftly rotating forty-nine times. Observe the tailbone: when the warming qi pierces through from behind, if the momentum weakens, employ the method of contracting the two excretory orifices to naturally ascend through the tailbone, up the spine, over the Kunlun peak, and descend into the Niwan Palace.\n\nFeel the Niwan Palace vast as the sea, allowing the essence to linger and nurture. Then let it descend into the Crimson Palace and Scarlet Tower, where the great earth’s dew scatters like pearls. All affairs forgotten, one feels only a hazy vagueness—breathing without conscious breath, swallowing without conscious swallow, lifting without conscious lift. Within this state, the flavor is sweet and fragrant, qi and spirit harmoniously full, the three fields unified.\n\nSoon, the mysterious condition pervades all, and one must turn inward, releasing all entanglements. Gradually, the body feels hollow as a valley, the great earth vanishes, and a subtle coolness gently envelops one, misty vapors filling all directions. Suddenly, the mist scatters and clouds disperse, revealing the Sea of Nature below, its azure waves perfectly clear. I remain unmoved by a single thought, forgetting both realm and emotion. Suddenly, myriad golden rays appear, fine rain like pearls descending with the light, spiraling left and right, transforming into a luminous moon floating upon the crystalline sea. In an instant, one awakens as from a dream.\n\nMaster Niwan states: At this moment, one must inwardly examine the body. If the qi is refreshed, the spirit clear, and the entire body harmoniously at ease, this is success. Then, for a time, the whole body radiates luminous stillness. Direct intention to the *pin* gate, and if one feels serene contentment within, this is it.\n\nNext, rub the hands and face, circulate spirit around the abdomen, and raise the windlass mechanism on both sides, each for forty-nine breaths. Gently twist the waist, sway the knees and legs, sit and tap the toes, each for twenty-four breaths, then stop.\n\nPracticing this for a hundred days, three times daily without interruption, the foundation of a celestial immortal is established.\n\nMaster Taixu comments: This principle is but a general outline, known in ancient times as the Ladder to Heaven. The great Dao’s elixir method lies herein, lacking only the final crucial step. Later scholars must first read it thoroughly, embodying each word, silently contemplating it a hundred times daily. Then, when practicing, one enters a familiar path, not led astray by phenomena. Even if manifestations slightly differ, the sequence remains clear. Scholars must not treat this as a mere reading of *Journey to the West*.\n\nFor men’s elixir texts fill libraries like cattle; women’s elixir texts are rarely complete in the world. To obtain even the *Eighteen Direct Pointers of Golden Flower* is to gain an esoteric transmission. With this guide to complement it, the secret method for women to attain celestial immortality is complete. Without it, one may achieve only earthly or human immortality.\n\n---\n\nThe Third Principle\n\nMaster Niwan states: In dual cultivation, men do not require a vessel; those who use one will never attain the Dao. Adding oil is but a minor technique, not the true method. The true method unites the Three Powers within one body. For women, dual cultivation is the same: without containing the Three, the elixir cannot form. Within it, the true One is like granary grain—transformation is the furnace, and ripeness is ready for consumption.\n\nHe further says: Know that in the world, there are Unobstructed Assemblies, where seeds originally pervade the great thousand worlds. Yet using an altar as furnace and vessel, after Lu’s departure, the true transmission was lost.\n\nHe also says: In speaking this verse, the Eight Divisions of Devas will surely be astonished, deeming my words reckless and fearing divine punishment. Yet I speak freely because I bear the august decree of the Divine Mother of Jade Purity, who lamented the extinction of the great Dao and commanded the Saintly Maiden of Non-Duality to solemnly proclaim it. She transmitted it to me orally, intending direct revelation without altering names or titles to further mislead later generations.\n\nHer teaching states: Solitary practice is not the ultimate Dao; those of the same kind naturally depend on one another. Those who possess a body beyond the body can forget form and serve all beings.\n\nHer method says:\n*\"Qian’s origin comes from the crown,\nKun’s origin is lost from the *pin*.\nThe human origin pervades the great stem,\nThe Three Origins are mastered by one heart.\nNot beyond the heart’s silent emptiness,\nNot beyond the body’s unobstructedness.\nIn movement and stillness, unite with the true constant;\nI have no origin, yet it naturally merges.\nWhen the origin merges, the One also merges,\nThe One Origin is emotion and nature.\nEmotion is nature’s origin,\nNature is endowed with talent.\nIf one can transform the origin and the One,\nOne naturally transcends the supreme rank.\"*\n\nThis is the august decree of the Divine Mother of Jade Purity and the oral transmission of the Saintly Maiden of Non-Duality. Those who are capable should follow it.\n\n[Tai Xu said: The principle of the Supreme Ultimate lies in beings of the same kind requiring one another—this is precisely what is meant by \"the essence of the two and the five, wondrously conjoined and congealed.\" Throughout the *Wuzhen pian* and its inner and outer chapters, as well as the entirety of the *Cantong qi*, only this single principle is expounded. Yet世人 misconstrue it, giving rise to the defiled practices of the \"Three Peaks.\" Now, having received the Master’s instruction, the oral transmission of a thousand years is at last made clear. How fortunate is Bing to have received it! (Bing is the lineage name of Tai Xu.) How fortunate is the world to have it illuminated! This is the final great teaching for both the male and female schools. Yet unless one possesses the power of wisdom, few can bring it to completion.\n\nBing, having savored the essence of the teaching, knows that only by transcending the self can one transcend all things. When both self and things are forgotten, the True One appears. Once the True One appears, follow the One in cultivation. The One naturally dissolves into itself, transforming endlessly, giving rise to life without cease. Within this imperial Dao, nothing surpasses the \"Unobstructed Buddha Assembly.\" As the alchemical texts say: \"Living dragons and tigers fill the void.\" Bing has witnessed this in such an assembly. However, one must adhere strictly to the ancient methods to avoid disgrace or regret.\n\nRegarding this assembly, its meaning is most profound while its form is most manifest. One must not misunderstand it. What is called \"profound\" lies in the singular heart—its gains and losses are known to none but oneself. What is called \"manifest\" is as open as a marketplace, where every action and pause is laid bare without the slightest concealment. Only by following the method thus can it avoid the world’s censure.\n\nAlas! The sage’s heart is burdened with suffering, and the sage’s vision is far-reaching indeed!] Fourth Passage.\n\nNīwán Shì says: Indeed, the ancient sages declared: \"If the gross substance is not transformed, the Dao remains ever distant; if merit and practice are not perfected, fruition will never come. To advance by skipping stages only leads to delusion and error; to attain realization without perfection yields but a lesser, minor fruit.\" Let scholars heed this compassionate instruction. One must first temper the Dharma-body to firmness, for only then is there a foundation to endure refinement. Without this foundation, one cannot speak of the higher principles.\n\nThe higher principles concern solely the work of transformation, yet each step arises from the physical body—this is the art of lodging the void within the substantial and attaining the void through the substantial. Such is the method of the Heavenly Immortals.\n\n[Tàixū Shì says: The Dharma-body is the body beyond the body. This body is not obtained through visualization, nor can it be accomplished by mere refinement. Its secret lies in \"borrowing the false to cultivate the real,\" and its practice does not extend beyond the physical body. The key is to refine this physical body until, within and without, it is pure and unblemished—where it is a body yet not a body, not a body yet a body. As the saying goes: \"When the work is active, the body is absent; when the work ceases, the body is present.\" In that absent state, all sensations of cold and warmth are not the self; all sensations of pain and itch are not the self. This is what is meant by \"awareness without attachment.\"\n\nHow is this achieved? The method lies in dwelling in the emptiness of the spirit’s abode, so that the body is no longer a body. One who can recognize the True One, beyond which all is illusion, achieves this even more. Refining thus until there is no far or near, no inside or outside, one advances further. Practicing until there is no going or coming, no entering or exiting, one truly attains the state of no far or near, no inside or outside. Further refining until there is no arising or ceasing, no movement or stillness, one truly reaches the state of no coming or going, no entering or exiting. Thus, the pure realm of the Dharma-body is fully possessed. Yet this is still sought within the physical body.]\n\nFifth Passage\n\nNīwán Shì says: True-Yang’s words are correct. (True-Yang is the sobriquet given to Tàixū Shì by Nīwán Shì.) Through such diligent cultivation, the Dharma-body naturally manifests; through such unwavering practice, a body exists beyond the body. You must know that the ancient sages relied on the final, decisive step to complete the Dao—this is the swiftest path within the Way of completion.\n\nFor the true yin and true yang within the body are limited. Refining them involves nothing more than mutual tempering of the prior and posterior. Though daily practice yields gradual accumulation, the body’s acquired, mundane encumbrances also grow day by day. Even with diligent cultivation, those who encounter great calamities are many across the ages—truly pitiable. There is no other reason: the body’s true, original essence is finite and measurable, while its false, acquired impurities proliferate without bound. Moreover, if one does not begin cultivation in youthful purity, the taints of corruption are inescapable. In this, you may well fear for the world!\n\n[Tàixū Shì says: Whether drinking water or broth, one knows its warmth or coolness. If the Dharma-body is already possessed, the secrets of regulation and protection, the proper timing of gathering and releasing, need not be sought elsewhere—for inner verification is sufficient for certainty. Even if the Dharma-body is not yet possessed, the methods of regulation and protection, of gathering and releasing, are still to be sought within the body’s own fluctuations. These are nothing other than the dynamics of blockage and flow, ascent and descent, cold and warmth, dryness and moisture.\n\nApplying the proper method here is no different from unblocking what is obstructed, warming what is cold, moistening what is dry—reversing and cycling through these states. The great principle lies in concentration and softness, not being led astray by external things, harmonizing the foundation of heart and qi, unifying the qi’s movement, and recognizing this body as a borrowed vessel. All practices—massage, contraction, visualization, and frequent circulation—serve only to enliven the qi’s movement. Once the qi’s mechanism is nimble and free, the method relies solely on concentration and softness: when a thought arises, dissolve it; when gathering, know when to rest.\n\nBeware of \"riding the ox to seek the ox,\" of gathering without knowing rest—this is called \"adding a head atop the head.\" Even when signs such as unobstructed flow, ascent and descent, warmth, coolness, balance, and moisture are achieved, avoid clinging or stagnation. This is akin to the principle of knowing when to rest in gathering. Cultivating and nurturing in accordance with this ensures no risk of collapse or ruin. Bing has witnessed this to be so.]\n\n**Sixth Principle**\n\nMaster Niwan states: Indeed, what you say is correct. The woman’s spirit takes flight, the man’s essence congeals—both stem from the error of \"adding a head atop the head.\" For the spirit clings to essence: when spirit congeals and essence is balanced, all is at peace; when essence dries and spirit stands alone, it flees. The unknowing mistakenly call this \"transformation and shedding\"—how lamentable!\n\nFrom this, one may discern the folly of excessive massage and visualization. Why is this so? Women are inwardly yin yet outwardly yang, their trigrammatic nature belonging to *Li*; their true yin leaks away with the monthly flow. Thus, stillness overcoming movement brings fortune, while movement overcoming stillness invites misfortune. Men take essence as their root, women take blood as theirs—essence thrives with warmth, blood arises from coolness. Know this, and you know how to nurture.\n\nFor women, practices that do not abandon massage and visualization serve two purposes: first, to unblock the qi’s mechanism, ensuring the meridians flow freely; second, to refine the fluids, preventing stagnation from congealing into phlegm, so that fluids may transform into blood.\n\nThe ancient sages spoke of stillness and preservation as the foundation, which also holds two meanings: when the ruler is at peace, the ministers are at ease, and the spirit remains clear, unflown; moreover, stillness gives rise to wisdom, shielding one from desire’s disturbances, thus preserving life. This is the secret of dual cultivation within the self.\n\nOnce the qi’s mechanism is at ease and the mind’s intent is pure and tranquil, augment it with harmony, follow with integrity and clarity. Daily progress may seem slight, but monthly gains accumulate. Persist in this, and one day you will realize a body as vast as empty space, the Three Fields unified as one—only then will you perceive every limb, joint, and aperture radiant with light. At this stage of cultivation, the self and the body beyond the self are both attained.\n\nIf you persist without retreat, spirit and qi will be full, thoughts will not stray outward, the spirit will not chase after thoughts, blood will flourish, true yin will be abundant, and qi and essence will naturally fill heaven and earth. Yet if you chase thoughts in flight, you will fall into the Two Vehicles—what the alchemical texts call \"the yin spirit departing the husk.\" This is something practitioners must guard against.\n\n**[Master Taixu states: Bing once heard from the Master that the spirit is the heart’s spirit, which, when guarded and not flown, clings to essence. Once essence dries, the spirit flees. Essence here refers to kidney essence; when essence does not congeal, it is governed by the spirit. Yet this congealed essence is not primordial essence—it is merely a fluid, like that of an unformed body. Once the true spirit departs, this essence hardens.\n\nThe *Book of Changes* says: \"The interplay of one yin and one yang is called the Dao.\" A verse reads: \"Half a catty and eight taels make the true.\" Another says: \"Solitary yin does not grow, lone yang does not flourish.\" Qian and Kun, Kan and Li, Zhen and Xun, Dui and Gen—heaven and earth, sun and moon, nature and life, male and female—all follow the cycle of one yin and one yang, ever revolving in their beginning and end. This is the constant Dao.\n\nIf cultivation leans toward one vehicle or perception tilts to one side, it becomes a flawed practice. It is also said: In the early stages of practice, one seeks harmony within the body, yet there is always a sequence—what comes first is called \"true,\" what follows is called \"false.\" Though the false arises from the true, the true may also be called false; when the false returns to the true, it is then called \"primordial.\" If gathering misses the proper time or clings to form and appearance, one strays onto side paths, becoming mired in the mundane and illusory—this is perilous, though still remediable.\n\nThe gravest danger lies in the moment when solitary cultivation reaches fulfillment, perception plunges into the profound, and a single bias in thought skews understanding. Though one may seek to halt it, it is already too late. The woman’s spirit flies, the man’s essence congeals—how can one not be cautious!\n\nAlas! Know that Master Cui’s *Mirror for Ingesting the Medicine* says: \"It is nature and life, not spirit and qi.\" To speak of spirit and essence is like offering a yellow leaf to stop a child’s crying. Without recognizing true gold, how can one distinguish the yellow leaf?\n\nMaster Zhong said: \"The four great elements of the body are all yin—what then is yang essence? Only when one meets a wise teacher’s guidance does the Daoist immortal’s work become a matter of the body.\" He also said: \"The intermingling of being and non-being is the root of the elixir; the mutual support of the hidden and manifest is the water and metal. Do not cling to this body and call it the Dao—solitary cultivation without the other is but solitary yin.\"\n\nCombined with the Master’s teachings, is there not something called the \"true seed\" at work? Yet if it is not sought outside this body, its meaning is profoundly subtle.]**\n\n**Seventh Principle**\n\nMaster Niwan states: Indeed.\n\nThe *Daode Jing* states: \"There is a thing, formlessly formed, born before heaven and earth. Silent and void, it stands alone and unchanging, circulates without cease, and may be called the mother of all under heaven. I know not its name; I style it the Dao.\" It also says: \"Vague and elusive, yet within it there is form; dim and obscure, yet within it there is essence. Its essence is most real, and within it there is truth.\"\n\nThis one thing lies concealed within the mountain of form. The ancients said: \"Seek it not within the body, nor gather it outside the body.\" Vague and elusive, it seems to dwell in the void and obscurity between being and non-being, yet it does not lie beyond the single aperture of the Mysterious Pass. This aperture—vast without boundary, minute without interior—cannot be grasped by thought nor opened by effort. The method lies only in making the body equal to emptiness, releasing all conditions, forgetting even emptiness, forgetting even stillness. Then the spirit enters of itself, and qi emerges from within. When qi manifests as a misty, boundless presence—without head or tail—this is the revelation of that thing, the first sign of the body beyond the body.\n\nIf this aperture remains closed, even if one severs the dragon and transforms the spirit, it is still but the illusory existence of a yellow leaf—how can it be called the gestation of the embryo? How can it be called entry into the gate? What was shown in the previous principle is still the yellow leaf, not true gold.\n\n**[Master Taixu states:]**\nMassage, though delusive, cannot be abandoned, for without it the qi mechanism does not flow. Visualization, though false, cannot be discarded, for without it qi and essence are insufficient. Advancing further, one cultivates until there is something and yet nothing—but even this the Master does not deem ultimate, for it remains but this-side work.\n\nYet when this-side work is complete, the other side becomes easily accessible. If the other side remains unopened, the mechanism is blocked by mountains. When it opens, intention draws it forth—effortless and abundant, the four neighbors arrive of themselves. Thus, though separated by mountains or lakes, the qi mechanism flows as if face to face.\n\nWhat is the method? The Master said: \"Emit light to draw it, gather the mind to await it.\" If it ascends while you descend, or retreats while you advance, the meeting is futile. The method lies in stillness amid motion, empty and receptive. When the qi mechanism arrives, a sense of harmony arises—yet remain still, envelop it with intention, and store it deep within for inner refinement. From *kun* to *gen*, riding the raft into the Milky Way, one perceives golden lightning flashing, cool qi filling the void, like clouds or mist swirling inside and out.\n\nAt this moment, guard against杂念—whether desire or doubt. As thoughts arise, cast them aside. A certain qi mechanism will then naturally fill the center, without inside or outside, without boundary or limit. In an instant, myriad transformations appear, beyond calculation, beyond depiction, beyond description. Yet there are also times of stillness without radiance, darkness like midnight. These are called \"mysterious shadows,\" or \"round images of the other shore.\"\n\nIn truth, they are the perfect interpenetration of self and other—what the *Huayan*, *Śūraṅgama*, and *Lotus* sutras call the three realms, the three mountains, the ten isles of mystery. Yet this is merely the qi mechanism of transformative work; the other shore is not truly other. And the attainment of the other shore does not lie beyond this.\n\nThe Master said: \"I once inquired of the Pure and Primordial Sovereign. She replied, 'So it is, so it is.' And she added: 'Why should the work of men be different?'\"\n\n---\n\n**Eighth Principle**\n\nMaster Niwan states:\nA verse says: \"Turning and overturning, the affairs of heaven and earth—when the two qi merge in essence, they unite with the metal of *gen*.\" It also says: \"The hawk seizes the swallow, the falcon strikes the crow—subtle within the subtle, wondrous within the wondrous.\" Yet this is nothing other than knowing the white and guarding the black, knowing the male and guarding the female. How could it be apart from preserving the void and guarding the existent?\n\n**[Master Taixu states:]**\nThe *Daode Jing* and *Nanhua* are not texts a woman can recite daily. The *Qingjing Jing* should be read until familiar, and its inner principles revered. Are not the *Kun Ning* and *Zhen Yi* the two essential scriptures? For without thorough cultivation of nature, life cannot be preserved; without strict discipline, merit is not sincere.\n\nThe Master’s cited verse is profoundly obscure—how could it be easily fathomed? Even with the revelation of the highest method, how many women would understand? They remain adrift in longing, as is common in the world. For it contains the entire record of the fire within.\n\nStudy the *Huangdi Yinfu Jing* thoroughly, and examine the *Longhu*, *Cantong*, and *Wuzhen* texts—only then can one speak of this principle. I shall briefly indicate its contours:\n\nTurning and overturning,\nthe affair cycles on.\nRecognize the one within the one—\nthe one precedes all.\nAll comes from the two qi,\nessence merging in myriad forms.\nWhen the body is empty of one,\nit can embrace the great thousand.\nThe great thousand’s radiance gleams,\ngleaming is the other’s origin.\nIf not led astray by the other’s origin,\nthe origin is one’s own origin.\nOrigin upon origin—not one,\none upon one—not whole.\nStill, without letting go,\nhow could the work be ordinary?\n\nSwallows and sparrows follow their nature,\ncrows and cold do the same.\nWhen not hungry, they do not come;\nwhen the time arrives, they feast at will.\nThis is the wondrous within the wondrous,\nthe mysterious within the mysterious.\nKnowing the white, guard the black—\nin utter oblivion, attain the great whole.\nHow does it come to be so?\nThe utmost void contains the utmost.\nSuch is the Master’s profound meaning.\n\nYet being and non-being arise from each other;\ntaking and relinquishing must follow the one.\nIf the colored body is not transformed,\nnothing can be accomplished.\n\nTai Xu Shi said: The *Dao De Jing* and *Nan Hua* are not texts a woman can recite daily. The *Qing Jing Jing* should be read until thoroughly familiar, its inner principles revered. Yet are not the *Kun Ning* and *Zhen Yi* the two sutras most fitting? For without penetrating nature, life cannot be preserved; without strict discipline, merit cannot be firm.\n\nThe Master’s cited gatha holds meanings profound and obscure, difficult to fathom. Even with the revelation of the highest Dharma, how can ordinary women comprehend? They remain adrift in longing—such is common throughout the world. For within them lies the complete record of the Fire.\n\nStudy deeply the *Huangdi Yin Fu*, and examine the *Long Hu*, *Can Tong*, and *Wu Zhen*—only then may one speak of this principle. I shall briefly outline its contours:\n\nTurning and returning,\nthe matter follows cycles.\nRecognize the one within the one—\nthe threefold one stands before you.\nAll comes down to the two qi,\ntheir essence intertwined, shadows myriad.\nWhen the body holds not one,\nit manifests, embracing the great thousand.\nThe great thousand’s radiance gleams,\ngleaming is the other’s origin.\nIf not led astray by the other’s origin,\nthe origin is one’s own origin.\nOrigin upon origin—not one,\none upon one—not whole.\nStill, without letting go,\nhow could the work be ordinary?\n\nSwallows and sparrows follow their nature,\ncrows and cold do the same.\nWhen not hungry, they do not come;\nwhen the time arrives, they feast at will.\nThis is the wondrous within the wondrous,\nthe mysterious within the mysterious.\nKnowing the white, guard the black—\nin utter oblivion, attain the great whole.\nHow does it come to be so?\nThe utmost void contains the utmost.\nSuch is the Master’s profound meaning.\n\nYet being and non-being arise from each other;\ntaking and relinquishing must follow the one.\nIf the colored body is not transformed,\nnothing can be accomplished.\n\n---\n\nNinth Principle\nNi Wan Shi said: Well said, your words! There is truth in this:\n\nTo transcend the mundane, first purify mundane thoughts,\nthen empty the Three Realms.\nYet do not transgress inner principles,\nnor flatter ghosts and spirits.\nBe filial, reverent, kind, and gentle,\nwithout defying the Master.\nBe yielding, smooth, advantageous, and steadfast,\nwithout straying from the Way of Kun.\nIn movement, follow principle;\nin stillness, release all.\nEmbed the wondrous Dao in holding the dustpan and broom,\nawaken to the Fire’s timing in tending the stove and cooking.\n\nThe *Odes* say:\nGentle and graceful,\nlike mountains, like rivers.\nIf one is not good,\nwhat can be done?\n\nSuch is the warning—how grave!\n\n---\n\nTai Xu Shi said: This principle of the Master is subtle indeed. For those in the world who take refuge in the Dao or in Buddhism, few follow inner principles, few grasp the nature of the school. Able to be yielding and compliant with masters and elders, they often grow jealous and cruel, defying human relations. Their disciples and masters are scorned by the teachings of names, and they cast themselves into the Iron Enclosure and Avīci—is this not lamentable?\n\nA note says: My Master, Tai Xu the Elder, received the supreme great Dao from his Master Ancestor Ni Wan Shi in nine parts out of ten. This is further evident in this book. Yet this transmission of the heart is not merely a precious raft for the women’s school. Among the men’s school, those who have penetrated its secrets in their evening meditations are not few.\n\nThe original text, having passed through many hands in transcription, contains many errors. I have carefully corrected and arranged it. Alas, the *Precious Raft of Dual Cultivation for the Men’s School* was taken away by Yuan of Changshan. I shall seek it—it should not be lost.\n\nFor in the men’s school texts, the *Precious Secrets of the Women’s School* are also embedded, though their copies suffer many omissions. If obtained and corrected, then combined in publication, they would form a complete work, allowing the two schools to be studied together. The merit for crossing the world would be no small thing.\n\nI record this to inform the gentlemen who possess the men’s school texts: to destroy good books is to invite karmic retribution. As the scriptures warn, can one not beware?\n\nJin Gai Shan Ren, Min Yi De, respectfully postscripts.\nOn the full moon of the first autumn month, the tenth year of Daoguang, gengyin.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "泥丸李祖师女宗双修宝筏 第一则 泥丸氏曰：女功进步，初则止念，继则调心，念止心调，便可从事按摩矣。 法忌避炎就凉。 盖女以血为本者，其性偏阴，阴性喜凉，不假按摩以微行气机，则易沦入纯阴，阴则凉，凉则冰，如不加之以动运，酿成痰凝血瘀等病，而功难行矣。 然须从止念调心始。 女属坤，而坤藏真火，火伏则吉，火发烁金，不调而运，金遭火逼，则有翰音登天之象，故女修诀惟从止念调心始。 止念调心，功不厌多，亦不忌久行者，静中有动也。 ［太虚氏曰：念止则气纯，心调则气和，续行按摩，则有阳发之机，虑或机郁躁生，故复示戒。 且凡女性喜凉恶热，而初得止念调心和气，中或遭机郁躁生景象，必起提灌真阴之念，此纯阴汹聚之由。 盖静则阴凝，不动则阳郁，初学必有此弊。 不知推究发躁生烦之由，遽求得凉快一时，误知！ 必须加功，用运气机之法，气行则躁自释，不悟此而求其效，适更增病，此又痰凝血瘀之所由致也。 故切戒之。 法惟续事按摩者，正以杜斯瘀凝之窦。 又以人情乐功喜进，或致按摩过猛，地火焰腾，凡火从之，则有烁金之弊，故有翰音登天之戒。 翰音者，酉禽也，逼之极，则飞走上登，故又申说止念调心之妙。 盖示此则为女宗澈始澈终之要诀云尔。 ］",
      "translated_text": "**The Mud-Pill Master Li’s Precious Raft for Dual Cultivation in the Female Lineage, First Principle**\n\nThe Mud-Pill Master states: In the advancement of women’s practice, one first stills the thoughts, then harmonizes the mind. When thoughts are stilled and the mind harmonized, one may proceed with massage.\n\nThe method cautions against seeking coolness while avoiding warmth. Women, whose foundation is blood, are inherently yin in nature; yin delights in coolness. Without the subtle activation of qi through massage, one easily sinks into pure yin. Yin engenders coolness, and coolness congeals into ice. If no movement is applied, it breeds illnesses such as phlegm stagnation and blood stasis, making progress in practice difficult. Thus, one must begin with stilling thoughts and harmonizing the mind.\n\nWomen belong to *kun*, yet *kun* conceals true fire. When fire is subdued, all is auspicious; when fire flares, it scorches metal. If not regulated through movement, metal, pressed by fire, will manifest the omen of the *han-yin* ascending to heaven. Therefore, the secret of women’s cultivation lies precisely in beginning with stilling thoughts and harmonizing the mind.\n\nIn stilling thoughts and harmonizing the mind, one cannot practice too much, nor is prolonged practice to be avoided—within stillness, there is movement.\n\n**Master Tai Xu states:** When thoughts are stilled, qi becomes pure; when the mind is harmonized, qi becomes balanced. Proceeding with massage then gives rise to the mechanism of yang’s arousal. Yet one must guard against stagnation and restlessness. Women naturally prefer coolness and dislike heat. When thoughts are stilled, the mind harmonized, and qi balanced, if stagnation and restlessness arise, one may be tempted to replenish true yin—this is the cause of pure yin’s turbulent accumulation. Stillness congeals yin; inaction stifles yang. Beginners inevitably encounter this flaw. Without investigating the source of restlessness and vexation, one hastily seeks momentary coolness—this is a grave error! One must apply effort, employing methods to circulate qi. When qi moves, restlessness naturally dissolves. Those who fail to grasp this and seek results only compound their afflictions, leading precisely to phlegm stagnation and blood stasis. Hence, the strict warning.\n\nThe method of continuing with massage is precisely to close this gateway of stagnation and congealment. Moreover, as human nature delights in progress, one may massage too vigorously, causing the earthly fire to blaze and all fires to follow, resulting in the flaw of scorching metal. Thus, the caution against *han-yin* ascending to heaven. *Han-yin* is the bird of *you*; when pressed to its limit, it takes flight and soars upward. Therefore, the text reiterates the subtlety of stilling thoughts and harmonizing the mind. This, indeed, is the essential secret for women’s practice from beginning to end.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 500,
      "start_sentence": 0,
      "end_sentence": 18,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.30150294303894,
      "metadata": {
        "source_file": "dao\\藏外\\泥丸李祖师女宗双修宝筏.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "第二则 泥丸氏曰：女子精修，以阳旺为始，而以阴格为终，此法至秘，知者鲜矣！ 迷者循修男诀，智者趋向禅宗，亦克自证一果，得有立亡坐化之效，不知仍沦鬼趣，离道远矣。 盖女以血为本者，血旺则精盈，心凉则生血，古云液血之炼、血精之化，还仗神清。 血无液化，液失神烘，液泥成痰，流注脾胃，蒸升着肺，散流经络，百病猬生，五脏被灾，六腑遭厄，故古丹诀，必先息心。 心息定而神清，心斯凉矣。 故必当俟心凉液涌，然后念注乳溪，加以用手旋摩，务使气机洋溢； 次举两手分旋其房，亦惟俟此氤氲周绕，更觉暖气后烘、双关得有烟焰，势逼透关，满关泥液，分注乳溪，一如泉涌； 旋以真意，导入南洋，寂而守之，约有四九之息，舍意一松，觉此个中，油然而降，分注两腰，左右盘旋，各约神息四九之数； 乃一意引聚脐轮深处，缓旋四十九，急旋四十九，察吾尾闾，暖气后穿，如或势缓，可甩提缩二便法，自得穿尾升脊，上过昆仑，降注泥丸； 觉此泥丸，宽广如海，自可停留涵育，既而降注华池绛阙，大地阎浮，露珠沛洒，混忘所事，但觉恍焉惚焉，不呼自呼，不吸自吸，不提自提，不咽自咽，此中滋味甘香，气神充和，三田一贯； 已而玄况四塞，急须内顾，顺将万缘放下，旋觉身虚若谷，大地亦无，隐隐凉气袭人，氤氲四塞； 忽复雾散云收，下现性海，碧波澄如，我总一念不动，忘境忘情，忽现金光万道，细雨如珠，随光下注，左旋右转，化成皓月，浮沉晶海，遽然如梦而醒。 泥丸氏曰：此际急须内省此身，斯时以气爽神清，遍体和畅为得，得则全身照凝片时，以意注牝，觉得此中恬泰，是矣。 遂复摩手摩面，运神绕腹，双耸辘轳，俱各行四十九息； 徐徐扭腰，摆洒膝腿，坐点趾尖，各行二十四息而止。 行之百日，日行三次无间，天仙根基立矣。 ［太虚氏曰：此则大略，古名上天梯，大道丹诀在是，只欠末后大着，后之学者，务先熟读，字字体去，息心默会，日十百遍，则行功时，如入熟径，不为境迷，纵或现象稍异，而层次井然，切戒学者持作《西游记》看过。 盖男子丹经，汗牛充栋； 女子丹经，世少全册，得如金华直指一十八则，已属不传之秘，得此指南以合参之，坤道天仙秘诀备矣。 若仅得夫直指，地仙人仙而矣］ 第三则 泥丸氏曰：男子双修不用鼎，用鼎终非得道人，添油乃小术、非真诀，真诀三才为一身； 女子双修总一般，无含三有育成丹，个中真一如仓粟，造化为炉熟任餐。 又曰：可知世有无遮会，种子原来遍大千，假个坛场作炉鼎，卢能去后失真传。 又曰：吾说此偈，天龙八部，应各惊骇，谓吾饶舌，恐遭玄罚。 而我畅言之者，盖承玉清神母懿旨，谓惜大道绝传，曾敕不二圣姑，郑重宣示，口以授我，意在直泄，毋复假名易号，重误后人。 其说曰：孤修非至道，同类自相须，身外有身者，形忘堪事诸。 其诀曰：\"乾元得自顶，坤元失自牝。 人元遍大干，三元一心领。 不外心寂虚，不外身无梗。 动静合真常； 我无元自并。 元并一亦并，一元即情性。 情乃性之元，性为才共禀。 能无元一化，自超无上品。 \"是乃玉清神母之懿旨、不二圣姑之口授也，能者从之。",
      "translated_text": "The Second Principle\n\nMaster Niwan states: In women’s refined practice, one begins with the flourishing of yang and concludes with the restraint of yin—this method is most esoteric, and few comprehend it. The deluded follow the male path in their cultivation; the wise turn toward Chan, attaining some fruition and even the power to vanish while seated or standing. Yet they remain mired in ghostly realms, far from the Dao.\n\nFor women, blood is the foundation. When blood is abundant, essence overflows. When the heart is cool, blood is generated. As the ancients said: the refinement of fluid into blood, the transformation of blood into essence, all depend on a clear spirit. Without the transformation of fluid, fluid loses the warmth of spirit, congeals into phlegm, flows into the spleen and stomach, steams upward to the lungs, scatters through the meridians, and gives rise to a hundred diseases. The five viscera suffer calamity, the six bowels meet disaster. Thus, ancient elixir methods always begin by stilling the heart. When the heart is stilled and breath settled, the spirit becomes clear, and the heart cools.\n\nOne must wait until the heart is cool and fluid surges forth, then direct attention to the breast channels, gently rotating and massaging with the hands to ensure the qi mechanism overflows. Next, raise both hands to rotate around the breasts, waiting until the misty vapors swirl completely. Only then will the warming qi suffuse from behind, and the twin passes emit a smoky flame, pressing through the barrier until the entire pass is filled with muddy fluid, which flows into the breast channels like a gushing spring.\n\nThen, with true intention, guide it into the Southern Ocean, silently guarding it for approximately thirty-six breaths. Relax the intention, and feel this essence gently descend, dividing to flow into both flanks, spiraling left and right for another thirty-six breaths each. Next, gather it with single-minded focus into the deep center of the navel wheel, slowly rotating forty-nine times, then swiftly rotating forty-nine times. Observe the tailbone: when the warming qi pierces through from behind, if the momentum weakens, employ the method of contracting the two excretory orifices to naturally ascend through the tailbone, up the spine, over the Kunlun peak, and descend into the Niwan Palace.\n\nFeel the Niwan Palace vast as the sea, allowing the essence to linger and nurture. Then let it descend into the Crimson Palace and Scarlet Tower, where the great earth’s dew scatters like pearls. All affairs forgotten, one feels only a hazy vagueness—breathing without conscious breath, swallowing without conscious swallow, lifting without conscious lift. Within this state, the flavor is sweet and fragrant, qi and spirit harmoniously full, the three fields unified.\n\nSoon, the mysterious condition pervades all, and one must turn inward, releasing all entanglements. Gradually, the body feels hollow as a valley, the great earth vanishes, and a subtle coolness gently envelops one, misty vapors filling all directions. Suddenly, the mist scatters and clouds disperse, revealing the Sea of Nature below, its azure waves perfectly clear. I remain unmoved by a single thought, forgetting both realm and emotion. Suddenly, myriad golden rays appear, fine rain like pearls descending with the light, spiraling left and right, transforming into a luminous moon floating upon the crystalline sea. In an instant, one awakens as from a dream.\n\nMaster Niwan states: At this moment, one must inwardly examine the body. If the qi is refreshed, the spirit clear, and the entire body harmoniously at ease, this is success. Then, for a time, the whole body radiates luminous stillness. Direct intention to the *pin* gate, and if one feels serene contentment within, this is it.\n\nNext, rub the hands and face, circulate spirit around the abdomen, and raise the windlass mechanism on both sides, each for forty-nine breaths. Gently twist the waist, sway the knees and legs, sit and tap the toes, each for twenty-four breaths, then stop.\n\nPracticing this for a hundred days, three times daily without interruption, the foundation of a celestial immortal is established.\n\nMaster Taixu comments: This principle is but a general outline, known in ancient times as the Ladder to Heaven. The great Dao’s elixir method lies herein, lacking only the final crucial step. Later scholars must first read it thoroughly, embodying each word, silently contemplating it a hundred times daily. Then, when practicing, one enters a familiar path, not led astray by phenomena. Even if manifestations slightly differ, the sequence remains clear. Scholars must not treat this as a mere reading of *Journey to the West*.\n\nFor men’s elixir texts fill libraries like cattle; women’s elixir texts are rarely complete in the world. To obtain even the *Eighteen Direct Pointers of Golden Flower* is to gain an esoteric transmission. With this guide to complement it, the secret method for women to attain celestial immortality is complete. Without it, one may achieve only earthly or human immortality.\n\n---\n\nThe Third Principle\n\nMaster Niwan states: In dual cultivation, men do not require a vessel; those who use one will never attain the Dao. Adding oil is but a minor technique, not the true method. The true method unites the Three Powers within one body. For women, dual cultivation is the same: without containing the Three, the elixir cannot form. Within it, the true One is like granary grain—transformation is the furnace, and ripeness is ready for consumption.\n\nHe further says: Know that in the world, there are Unobstructed Assemblies, where seeds originally pervade the great thousand worlds. Yet using an altar as furnace and vessel, after Lu’s departure, the true transmission was lost.\n\nHe also says: In speaking this verse, the Eight Divisions of Devas will surely be astonished, deeming my words reckless and fearing divine punishment. Yet I speak freely because I bear the august decree of the Divine Mother of Jade Purity, who lamented the extinction of the great Dao and commanded the Saintly Maiden of Non-Duality to solemnly proclaim it. She transmitted it to me orally, intending direct revelation without altering names or titles to further mislead later generations.\n\nHer teaching states: Solitary practice is not the ultimate Dao; those of the same kind naturally depend on one another. Those who possess a body beyond the body can forget form and serve all beings.\n\nHer method says:\n*\"Qian’s origin comes from the crown,\nKun’s origin is lost from the *pin*.\nThe human origin pervades the great stem,\nThe Three Origins are mastered by one heart.\nNot beyond the heart’s silent emptiness,\nNot beyond the body’s unobstructedness.\nIn movement and stillness, unite with the true constant;\nI have no origin, yet it naturally merges.\nWhen the origin merges, the One also merges,\nThe One Origin is emotion and nature.\nEmotion is nature’s origin,\nNature is endowed with talent.\nIf one can transform the origin and the One,\nOne naturally transcends the supreme rank.\"*\n\nThis is the august decree of the Divine Mother of Jade Purity and the oral transmission of the Saintly Maiden of Non-Duality. Those who are capable should follow it.",
      "overlap_context": "eover, as human nature delights in progress, one may massage too vigorously, causing the earthly fire to blaze and all fires to follow, resulting in the flaw of scorching metal. Thus, the caution against *han-yin* ascending to heaven. *Han-yin* is the bird of *you*; when pressed to its limit, it takes flight and soars upward. Therefore, the text reiterates the subtlety of stilling thoughts and harmonizing the mind. This, indeed, is the essential secret for women’s practice from beginning to end.",
      "start_char": 503,
      "end_char": 1727,
      "start_sentence": 19,
      "end_sentence": 55,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.062469720840454,
      "metadata": {
        "source_file": "dao\\藏外\\泥丸李祖师女宗双修宝筏.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "［太虚氏曰：同类相须，太极之理，是即所谓二五之精，妙合而凝也。 《悟真》内外，全部《参同》，所言只此一理，世人误会，乃有三峰之秽行，今得师训，千百载心传始白。 炳何幸而得授。 （炳乃太虚翁派名也。 ）世何幸而得明，是为男女二宗末后大着。 第非具有慧力，鲜克有终者。 炳味宗旨，法惟无我，乃能无物，物我两忘，真一乃现，真一已现，循一以持，一自相溶，化化生生，无穷无已。 个中皇道，莫如无遮佛会，丹书所谓生龙活虎，遍满虚空。 炳于斯会见之，然须一循古制，乃无侮吝。 以斯会也，其义至密而迹至显者，切莫误会。 夫所谓密，密在一心，有得有失，人莫得而知者是； 其所谓显，显若市聚，行行止止，纤毫无隐者是。 惟其则法乃尔，故能不为世忌。 噫！ 哲人心苦矣，哲人之见远矣！ ］ 第四则",
      "translated_text": "[Tai Xu said: The principle of the Supreme Ultimate lies in beings of the same kind requiring one another—this is precisely what is meant by \"the essence of the two and the five, wondrously conjoined and congealed.\" Throughout the *Wuzhen pian* and its inner and outer chapters, as well as the entirety of the *Cantong qi*, only this single principle is expounded. Yet世人 misconstrue it, giving rise to the defiled practices of the \"Three Peaks.\" Now, having received the Master’s instruction, the oral transmission of a thousand years is at last made clear. How fortunate is Bing to have received it! (Bing is the lineage name of Tai Xu.) How fortunate is the world to have it illuminated! This is the final great teaching for both the male and female schools. Yet unless one possesses the power of wisdom, few can bring it to completion.\n\nBing, having savored the essence of the teaching, knows that only by transcending the self can one transcend all things. When both self and things are forgotten, the True One appears. Once the True One appears, follow the One in cultivation. The One naturally dissolves into itself, transforming endlessly, giving rise to life without cease. Within this imperial Dao, nothing surpasses the \"Unobstructed Buddha Assembly.\" As the alchemical texts say: \"Living dragons and tigers fill the void.\" Bing has witnessed this in such an assembly. However, one must adhere strictly to the ancient methods to avoid disgrace or regret.\n\nRegarding this assembly, its meaning is most profound while its form is most manifest. One must not misunderstand it. What is called \"profound\" lies in the singular heart—its gains and losses are known to none but oneself. What is called \"manifest\" is as open as a marketplace, where every action and pause is laid bare without the slightest concealment. Only by following the method thus can it avoid the world’s censure.\n\nAlas! The sage’s heart is burdened with suffering, and the sage’s vision is far-reaching indeed!] Fourth Passage.",
      "overlap_context": ".\nIn movement and stillness, unite with the true constant;\nI have no origin, yet it naturally merges.\nWhen the origin merges, the One also merges,\nThe One Origin is emotion and nature.\nEmotion is nature’s origin,\nNature is endowed with talent.\nIf one can transform the origin and the One,\nOne naturally transcends the supreme rank.\"*\n\nThis is the august decree of the Divine Mother of Jade Purity and the oral transmission of the Saintly Maiden of Non-Duality. Those who are capable should follow it.",
      "start_char": 1731,
      "end_char": 2060,
      "start_sentence": 56,
      "end_sentence": 72,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.63998818397522,
      "metadata": {
        "source_file": "dao\\藏外\\泥丸李祖师女宗双修宝筏.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "泥丸氏曰：然，古圣有云，凡质不化，了道无期，功行不圆，证果无日，躐等而进，适证岐迷，不圆而证，下品小果。 学者凛此慈示，须预炼得法身坚固，则有受煅之基，此基不立，未可与言上则也。 上则所事，纯是化功，而步步起自色身，是乃寓虚于实、即实致虚之作甩。 天仙功法如此。 ［太虚氏曰：法身者，身外之身也。 夫此一身，非存想所得有，非法炼所能成。 其诀则借假修真，其加修不外色身，诀惟炼此色身，内外贞白，是身非身，非身是身，所谓功举则身无，功停则身有。 方其无时，一切寒暖觉非我，一切痛痒觉非我，所谓觉而勿着者是也。 如何得能，法惟神宅虚无，身不为身，则能之。 能识真一，一外皆幻者，更能之。 如是炼至无远无近、无内无外，则更进矣。 加修至夫无去无来、无入无出，则真造夫无远无近、无内无外也矣。 再能加修夫无起无灭、无动无静，斯真无来出入矣。 如是，则已具法身净境矣。 然不外于色身中讨者］ 第五则 泥丸氏曰：真阳之言是。 (真阳，太虚氏之号，为泥丸氏所赠)。 如是精修，法身自具，如是不退，身外有身。 汝须知，古哲必藉末后大着以了道者，乃是了道中之捷径耳！ 盖以一身之真阴真阳有限，从而炼之，不外后先互煅。 平时炼得此诀，非无日增月累之效，无如一身后天凡累，亦有日生月增之势，纵能勇于精修，而遭大厄者古今不少，良可悯也。 无他，总缘一身之真先，多寡可计，而一身之伪后，滋长莫测，况修不自童真，沾染破败，人人难免乎？ 汝于此，可为世人惧矣！ ［太虚氏曰：饮水饮汤，冷暖自觉。 苟其法身已具，所谓调护之诀，收放之宜，无劳访得者，固已有内验足审也。 即或法身末具，所谓调护之诀、放收之宜，亦只宜于一身中寻其消息者，亦不外乎塞通升降、寒温燥润也。 于此而施其则法者，夫岂外乎塞者通之、寒者温之、燥者润之，循环颠倒于其间乎？ 其大旨，以专以柔，不为物诱，调基心炁，一其气机，知此身为寄器。 凡夫按摩提缩与诸存运频加者，不过灵活其气机焉而已。 苟其炁机已灵且活，法惟专柔为主，念起即化，一收即休。 慎毋骑牛觅牛，收不知休，是名头上安头。 即如通充升降、温凉平润等验得之，皆忌粘滞，亦犹收当知休之义耳！ 准此以修以养，万无脱毙之虞也。 炳见如是］",
      "translated_text": "Nīwán Shì says: Indeed, the ancient sages declared: \"If the gross substance is not transformed, the Dao remains ever distant; if merit and practice are not perfected, fruition will never come. To advance by skipping stages only leads to delusion and error; to attain realization without perfection yields but a lesser, minor fruit.\" Let scholars heed this compassionate instruction. One must first temper the Dharma-body to firmness, for only then is there a foundation to endure refinement. Without this foundation, one cannot speak of the higher principles.\n\nThe higher principles concern solely the work of transformation, yet each step arises from the physical body—this is the art of lodging the void within the substantial and attaining the void through the substantial. Such is the method of the Heavenly Immortals.\n\n[Tàixū Shì says: The Dharma-body is the body beyond the body. This body is not obtained through visualization, nor can it be accomplished by mere refinement. Its secret lies in \"borrowing the false to cultivate the real,\" and its practice does not extend beyond the physical body. The key is to refine this physical body until, within and without, it is pure and unblemished—where it is a body yet not a body, not a body yet a body. As the saying goes: \"When the work is active, the body is absent; when the work ceases, the body is present.\" In that absent state, all sensations of cold and warmth are not the self; all sensations of pain and itch are not the self. This is what is meant by \"awareness without attachment.\"\n\nHow is this achieved? The method lies in dwelling in the emptiness of the spirit’s abode, so that the body is no longer a body. One who can recognize the True One, beyond which all is illusion, achieves this even more. Refining thus until there is no far or near, no inside or outside, one advances further. Practicing until there is no going or coming, no entering or exiting, one truly attains the state of no far or near, no inside or outside. Further refining until there is no arising or ceasing, no movement or stillness, one truly reaches the state of no coming or going, no entering or exiting. Thus, the pure realm of the Dharma-body is fully possessed. Yet this is still sought within the physical body.]\n\nFifth Passage\n\nNīwán Shì says: True-Yang’s words are correct. (True-Yang is the sobriquet given to Tàixū Shì by Nīwán Shì.) Through such diligent cultivation, the Dharma-body naturally manifests; through such unwavering practice, a body exists beyond the body. You must know that the ancient sages relied on the final, decisive step to complete the Dao—this is the swiftest path within the Way of completion.\n\nFor the true yin and true yang within the body are limited. Refining them involves nothing more than mutual tempering of the prior and posterior. Though daily practice yields gradual accumulation, the body’s acquired, mundane encumbrances also grow day by day. Even with diligent cultivation, those who encounter great calamities are many across the ages—truly pitiable. There is no other reason: the body’s true, original essence is finite and measurable, while its false, acquired impurities proliferate without bound. Moreover, if one does not begin cultivation in youthful purity, the taints of corruption are inescapable. In this, you may well fear for the world!\n\n[Tàixū Shì says: Whether drinking water or broth, one knows its warmth or coolness. If the Dharma-body is already possessed, the secrets of regulation and protection, the proper timing of gathering and releasing, need not be sought elsewhere—for inner verification is sufficient for certainty. Even if the Dharma-body is not yet possessed, the methods of regulation and protection, of gathering and releasing, are still to be sought within the body’s own fluctuations. These are nothing other than the dynamics of blockage and flow, ascent and descent, cold and warmth, dryness and moisture.\n\nApplying the proper method here is no different from unblocking what is obstructed, warming what is cold, moistening what is dry—reversing and cycling through these states. The great principle lies in concentration and softness, not being led astray by external things, harmonizing the foundation of heart and qi, unifying the qi’s movement, and recognizing this body as a borrowed vessel. All practices—massage, contraction, visualization, and frequent circulation—serve only to enliven the qi’s movement. Once the qi’s mechanism is nimble and free, the method relies solely on concentration and softness: when a thought arises, dissolve it; when gathering, know when to rest.\n\nBeware of \"riding the ox to seek the ox,\" of gathering without knowing rest—this is called \"adding a head atop the head.\" Even when signs such as unobstructed flow, ascent and descent, warmth, coolness, balance, and moisture are achieved, avoid clinging or stagnation. This is akin to the principle of knowing when to rest in gathering. Cultivating and nurturing in accordance with this ensures no risk of collapse or ruin. Bing has witnessed this to be so.]",
      "overlap_context": "is most profound while its form is most manifest. One must not misunderstand it. What is called \"profound\" lies in the singular heart—its gains and losses are known to none but oneself. What is called \"manifest\" is as open as a marketplace, where every action and pause is laid bare without the slightest concealment. Only by following the method thus can it avoid the world’s censure.\n\nAlas! The sage’s heart is burdened with suffering, and the sage’s vision is far-reaching indeed!] Fourth Passage.",
      "start_char": 2060,
      "end_char": 2962,
      "start_sentence": 73,
      "end_sentence": 107,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.550251245498657,
      "metadata": {
        "source_file": "dao\\藏外\\泥丸李祖师女宗双修宝筏.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "第六则 泥丸氏曰：然，汝言是。 女之神飞，男之精泥，皆缘头上安头之故。 盖神之所恋者，精也。 神凝精平则安，精涸神孤则飞，不知者谬为蜕化，大可哀也。 于是可知过行按摩存注之非，其故何哉？ 女子内阴而外阳，卦义属离，而真阴每随月信漏失，故静胜动者吉，动胜静者凶。 男子以精为本，女子以血为本，精以暖旺，血以凉生，知此，则知所以养矣。 女功之不废按摩存注者，其义有二：一以通其气机，则经络疏畅； 二以炼其津液，不使液滞化痰，而液乃化血。 古哲谓以静存为宗者，亦有二义，君安臣庶安，则神清不飞； 又静则慧生，不为欲搅，而命得保固。 此则一己双修之诀也。 气机既舒，志意净寂，加之以充和，继之以贞白，日计不足，月计有余，踵而事之，一旦证夫身等虚空、三田一贯，惟觉肢肢节节窍窍光明，功修至此，一己之身、外身具矣。 果能踵事不退，神足气充，念不外驰，则神不逐念，血生必旺，真阴亦足，气精自有弥天塞地局境。 然或逐念腾飞，便堕二乘，丹书所谓阴神出壳是也。 学者不可不戒者也。 ［太虚氏曰：炳尝闻诸夫子，神者心神，守而不飞者，恋精而守也。 精一涸，则神飞矣，精者肾精，精之不泥者，得神以御耳！ 盖此泥精，尚非元精，乃是液类，身且未成者是也。 真神一离，斯精乃泥凝矣。 《易》曰：一阴一阳之谓道。 偈曰：半斤八两始成真。 又曰：孤阴不生，独阳不长，乾坤坎离、震巽兑艮、地天日月、性命男女，一阴一阳，循环终始，谓之常道。 修或一乘，感或一偏，便成弊政。 又曰：大凡人之初修，惟在一身中求配合，而第有先后之后，先者曰真，后者曰假。 原夫假育于真，真亦名假，假返于真，便亦名元。 采或失时，或着色相，便落旁径，即成凡幻，大足为患。 然犹有救。 其最烈者，莫如孤修功足之候，感入杳冥，而念或一偏，则格致亦偏，虽求中止，事不及矣。 女则神飞，男则精泥，可不慎哉！ 噫，要知崔公《入药镜》\"是性命，非神气。 \"曰神曰精者，犹如黄叶止儿啼也。 不识真金，焉辨黄叶？ 钟祖有言：四大一身皆属阴，不知何物是阳精，有缘遭遇明师指，得道神仙只事身。 又云：有无交入为丹本，隐显相扶是水金，莫执此身云是道，独修无物是孤阴。 合之师示，盖有所谓真种子者在欤！ 然不外于此身求者，其旨玄矣］ 第七则 泥丸氏曰：然。",
      "translated_text": "**Sixth Principle**\n\nMaster Niwan states: Indeed, what you say is correct. The woman’s spirit takes flight, the man’s essence congeals—both stem from the error of \"adding a head atop the head.\" For the spirit clings to essence: when spirit congeals and essence is balanced, all is at peace; when essence dries and spirit stands alone, it flees. The unknowing mistakenly call this \"transformation and shedding\"—how lamentable!\n\nFrom this, one may discern the folly of excessive massage and visualization. Why is this so? Women are inwardly yin yet outwardly yang, their trigrammatic nature belonging to *Li*; their true yin leaks away with the monthly flow. Thus, stillness overcoming movement brings fortune, while movement overcoming stillness invites misfortune. Men take essence as their root, women take blood as theirs—essence thrives with warmth, blood arises from coolness. Know this, and you know how to nurture.\n\nFor women, practices that do not abandon massage and visualization serve two purposes: first, to unblock the qi’s mechanism, ensuring the meridians flow freely; second, to refine the fluids, preventing stagnation from congealing into phlegm, so that fluids may transform into blood.\n\nThe ancient sages spoke of stillness and preservation as the foundation, which also holds two meanings: when the ruler is at peace, the ministers are at ease, and the spirit remains clear, unflown; moreover, stillness gives rise to wisdom, shielding one from desire’s disturbances, thus preserving life. This is the secret of dual cultivation within the self.\n\nOnce the qi’s mechanism is at ease and the mind’s intent is pure and tranquil, augment it with harmony, follow with integrity and clarity. Daily progress may seem slight, but monthly gains accumulate. Persist in this, and one day you will realize a body as vast as empty space, the Three Fields unified as one—only then will you perceive every limb, joint, and aperture radiant with light. At this stage of cultivation, the self and the body beyond the self are both attained.\n\nIf you persist without retreat, spirit and qi will be full, thoughts will not stray outward, the spirit will not chase after thoughts, blood will flourish, true yin will be abundant, and qi and essence will naturally fill heaven and earth. Yet if you chase thoughts in flight, you will fall into the Two Vehicles—what the alchemical texts call \"the yin spirit departing the husk.\" This is something practitioners must guard against.\n\n**[Master Taixu states: Bing once heard from the Master that the spirit is the heart’s spirit, which, when guarded and not flown, clings to essence. Once essence dries, the spirit flees. Essence here refers to kidney essence; when essence does not congeal, it is governed by the spirit. Yet this congealed essence is not primordial essence—it is merely a fluid, like that of an unformed body. Once the true spirit departs, this essence hardens.\n\nThe *Book of Changes* says: \"The interplay of one yin and one yang is called the Dao.\" A verse reads: \"Half a catty and eight taels make the true.\" Another says: \"Solitary yin does not grow, lone yang does not flourish.\" Qian and Kun, Kan and Li, Zhen and Xun, Dui and Gen—heaven and earth, sun and moon, nature and life, male and female—all follow the cycle of one yin and one yang, ever revolving in their beginning and end. This is the constant Dao.\n\nIf cultivation leans toward one vehicle or perception tilts to one side, it becomes a flawed practice. It is also said: In the early stages of practice, one seeks harmony within the body, yet there is always a sequence—what comes first is called \"true,\" what follows is called \"false.\" Though the false arises from the true, the true may also be called false; when the false returns to the true, it is then called \"primordial.\" If gathering misses the proper time or clings to form and appearance, one strays onto side paths, becoming mired in the mundane and illusory—this is perilous, though still remediable.\n\nThe gravest danger lies in the moment when solitary cultivation reaches fulfillment, perception plunges into the profound, and a single bias in thought skews understanding. Though one may seek to halt it, it is already too late. The woman’s spirit flies, the man’s essence congeals—how can one not be cautious!\n\nAlas! Know that Master Cui’s *Mirror for Ingesting the Medicine* says: \"It is nature and life, not spirit and qi.\" To speak of spirit and essence is like offering a yellow leaf to stop a child’s crying. Without recognizing true gold, how can one distinguish the yellow leaf?\n\nMaster Zhong said: \"The four great elements of the body are all yin—what then is yang essence? Only when one meets a wise teacher’s guidance does the Daoist immortal’s work become a matter of the body.\" He also said: \"The intermingling of being and non-being is the root of the elixir; the mutual support of the hidden and manifest is the water and metal. Do not cling to this body and call it the Dao—solitary cultivation without the other is but solitary yin.\"\n\nCombined with the Master’s teachings, is there not something called the \"true seed\" at work? Yet if it is not sought outside this body, its meaning is profoundly subtle.]**\n\n**Seventh Principle**\n\nMaster Niwan states: Indeed.",
      "overlap_context": "e it; when gathering, know when to rest.\n\nBeware of \"riding the ox to seek the ox,\" of gathering without knowing rest—this is called \"adding a head atop the head.\" Even when signs such as unobstructed flow, ascent and descent, warmth, coolness, balance, and moisture are achieved, avoid clinging or stagnation. This is akin to the principle of knowing when to rest in gathering. Cultivating and nurturing in accordance with this ensures no risk of collapse or ruin. Bing has witnessed this to be so.]",
      "start_char": 2965,
      "end_char": 3880,
      "start_sentence": 108,
      "end_sentence": 147,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.62938642501831,
      "metadata": {
        "source_file": "dao\\藏外\\泥丸李祖师女宗双修宝筏.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "《道德经》云：有物混成，先天地生，寂兮寥兮，独立而不改，周行而不殆，可以为天下母，吾不知其名，强名曰日道。 又云：恍兮唿兮，其中有物，杳兮冥兮，其中有精，其精甚真，其中有信。 盖此一物，闭在形山，古人有言，不在身中求，不在身外采，恍恍又惚惚，似在虚无杳冥之间，而不外乎玄关一窍。 此一窍也，其大无外，其小无内，思之不得，运之不开。 法惟身等虚无、万缘放下、空忘其空、寂忘其寂者，神自入彀、炁自内出。 气体氤氲、无头无尾者，是此物之发现、身外身之始兆也。 此窍不开，纵能断龙神化，尚是黄叶之幻有幻无也，何得谓之结胎，何得谓之入门？ 前则所示，尚是黄叶，非真金也。 ［太虚氏曰：按摩虽妄，弃之则气机不通； 注想亦诬，废之则炁精不足。 踵而上之，修至有物无物，而师意犹未许为究竟者，以犹是这边事耳！ 虽然，这边事尽，那边易通； 那边未通，机隔重山。 其通也，以念引之，油然沛然，四邻自至。 故虽隔山隔湖，而气机之通，有如觌面。 其法惟何：闻之师云：放光以引之，摄心以俟之。 若彼升我降，彼退我归，会而已矣，无益也。 法惟于不寂中，寂然不动，虚而善受。 气机一到，觉有谐畅之趣，仍自寂然不动，以意包摄之，深藏内炼，由坤达艮，乘槎入汉，觉有金光电掣，凉气弥空，如云如烟，绕身内外。 于斯时也，戒杂人意，或慕或疑，念起立撇之，觉有一种气机，油然充塞于中，无有内外，无有边际，倏忽之间，变态叠现，难以计算，莫之能绘，莫之能说。 然亦有寂无光耀、黑漆成夜者。 是皆谓之玄影，又名彼岸圆象。 实则彼我圆图，谓之《华严》、《楞严》、《法华》三境，三山、十洲玄景。 其实彼我化工之气机，彼岸非彼岸也。 而彼岸得证，又不外此。 师云：某尝质诸清净元君，元君曰，如是如是。 又曰：男功何独不然］ 第八则 泥丸氏曰：偈有之，翻来覆去乾坤事，二炁交精合艮金。 又曰，鹰拿燕雀，鹘打寒鸦，细中之细，妙中之妙，而不外夫知白守黑、知雄守雌，又岂外夫存无守有也哉！ ［太虚氏曰：《道德》、《南华》，非女子所能日诵，《清净》一经，读之宜熟，内则宜崇，啉惟《坤宁》、《贞一》二经欤！ 盖性不彻者命难存，戒不严者功不笃也。 味师引偈，其义隐奥，讵易测核，虽沐揭示上上法，凡女何知，依然洋望，天下比比也。 盖含全部火记于中。 熟读《黄帝阴符》，参看《龙虎》、《参同》、《悟真》，乃可与言是则也。 炳为略示端倪，曰：翻来自覆去，其事有循环。 识得一中一，参参一在前。 都来只二炁，精交影万端。 身无一乃现，能包彼大千。 大千影灿灿，灿灿是彼元。 不为元引去，元始即吾元。 元元不一一，一一一无全，寂然不撤手，功夫岂等闲。 雀燕由渠燕，鸦寒亦听寒。 不饥时不到，时到任吾餐。 是为妙中妙，玄中更有玄。 白知故守黑，浑望得大全。 间渠何得尔，极无极具焉，师之精义盖如此，虽然，有无自相生、取舍须循一也。 色身不化，百事无成者］ 第八则 泥丸氏曰：偈有之，翻来覆去乾坤事，二炁交精合艮金。 又曰，鹰拿燕雀，鹘打寒鸦，细中之细，妙中之妙，而不外夫知白守黑、知雄守雌，又岂外夫存无守有也哉！",
      "translated_text": "The *Daode Jing* states: \"There is a thing, formlessly formed, born before heaven and earth. Silent and void, it stands alone and unchanging, circulates without cease, and may be called the mother of all under heaven. I know not its name; I style it the Dao.\" It also says: \"Vague and elusive, yet within it there is form; dim and obscure, yet within it there is essence. Its essence is most real, and within it there is truth.\"\n\nThis one thing lies concealed within the mountain of form. The ancients said: \"Seek it not within the body, nor gather it outside the body.\" Vague and elusive, it seems to dwell in the void and obscurity between being and non-being, yet it does not lie beyond the single aperture of the Mysterious Pass. This aperture—vast without boundary, minute without interior—cannot be grasped by thought nor opened by effort. The method lies only in making the body equal to emptiness, releasing all conditions, forgetting even emptiness, forgetting even stillness. Then the spirit enters of itself, and qi emerges from within. When qi manifests as a misty, boundless presence—without head or tail—this is the revelation of that thing, the first sign of the body beyond the body.\n\nIf this aperture remains closed, even if one severs the dragon and transforms the spirit, it is still but the illusory existence of a yellow leaf—how can it be called the gestation of the embryo? How can it be called entry into the gate? What was shown in the previous principle is still the yellow leaf, not true gold.\n\n**[Master Taixu states:]**\nMassage, though delusive, cannot be abandoned, for without it the qi mechanism does not flow. Visualization, though false, cannot be discarded, for without it qi and essence are insufficient. Advancing further, one cultivates until there is something and yet nothing—but even this the Master does not deem ultimate, for it remains but this-side work.\n\nYet when this-side work is complete, the other side becomes easily accessible. If the other side remains unopened, the mechanism is blocked by mountains. When it opens, intention draws it forth—effortless and abundant, the four neighbors arrive of themselves. Thus, though separated by mountains or lakes, the qi mechanism flows as if face to face.\n\nWhat is the method? The Master said: \"Emit light to draw it, gather the mind to await it.\" If it ascends while you descend, or retreats while you advance, the meeting is futile. The method lies in stillness amid motion, empty and receptive. When the qi mechanism arrives, a sense of harmony arises—yet remain still, envelop it with intention, and store it deep within for inner refinement. From *kun* to *gen*, riding the raft into the Milky Way, one perceives golden lightning flashing, cool qi filling the void, like clouds or mist swirling inside and out.\n\nAt this moment, guard against杂念—whether desire or doubt. As thoughts arise, cast them aside. A certain qi mechanism will then naturally fill the center, without inside or outside, without boundary or limit. In an instant, myriad transformations appear, beyond calculation, beyond depiction, beyond description. Yet there are also times of stillness without radiance, darkness like midnight. These are called \"mysterious shadows,\" or \"round images of the other shore.\"\n\nIn truth, they are the perfect interpenetration of self and other—what the *Huayan*, *Śūraṅgama*, and *Lotus* sutras call the three realms, the three mountains, the ten isles of mystery. Yet this is merely the qi mechanism of transformative work; the other shore is not truly other. And the attainment of the other shore does not lie beyond this.\n\nThe Master said: \"I once inquired of the Pure and Primordial Sovereign. She replied, 'So it is, so it is.' And she added: 'Why should the work of men be different?'\"\n\n---\n\n**Eighth Principle**\n\nMaster Niwan states:\nA verse says: \"Turning and overturning, the affairs of heaven and earth—when the two qi merge in essence, they unite with the metal of *gen*.\" It also says: \"The hawk seizes the swallow, the falcon strikes the crow—subtle within the subtle, wondrous within the wondrous.\" Yet this is nothing other than knowing the white and guarding the black, knowing the male and guarding the female. How could it be apart from preserving the void and guarding the existent?\n\n**[Master Taixu states:]**\nThe *Daode Jing* and *Nanhua* are not texts a woman can recite daily. The *Qingjing Jing* should be read until familiar, and its inner principles revered. Are not the *Kun Ning* and *Zhen Yi* the two essential scriptures? For without thorough cultivation of nature, life cannot be preserved; without strict discipline, merit is not sincere.\n\nThe Master’s cited verse is profoundly obscure—how could it be easily fathomed? Even with the revelation of the highest method, how many women would understand? They remain adrift in longing, as is common in the world. For it contains the entire record of the fire within.\n\nStudy the *Huangdi Yinfu Jing* thoroughly, and examine the *Longhu*, *Cantong*, and *Wuzhen* texts—only then can one speak of this principle. I shall briefly indicate its contours:\n\nTurning and overturning,\nthe affair cycles on.\nRecognize the one within the one—\nthe one precedes all.\nAll comes from the two qi,\nessence merging in myriad forms.\nWhen the body is empty of one,\nit can embrace the great thousand.\nThe great thousand’s radiance gleams,\ngleaming is the other’s origin.\nIf not led astray by the other’s origin,\nthe origin is one’s own origin.\nOrigin upon origin—not one,\none upon one—not whole.\nStill, without letting go,\nhow could the work be ordinary?\n\nSwallows and sparrows follow their nature,\ncrows and cold do the same.\nWhen not hungry, they do not come;\nwhen the time arrives, they feast at will.\nThis is the wondrous within the wondrous,\nthe mysterious within the mysterious.\nKnowing the white, guard the black—\nin utter oblivion, attain the great whole.\nHow does it come to be so?\nThe utmost void contains the utmost.\nSuch is the Master’s profound meaning.\n\nYet being and non-being arise from each other;\ntaking and relinquishing must follow the one.\nIf the colored body is not transformed,\nnothing can be accomplished.",
      "overlap_context": "of the body.\" He also said: \"The intermingling of being and non-being is the root of the elixir; the mutual support of the hidden and manifest is the water and metal. Do not cling to this body and call it the Dao—solitary cultivation without the other is but solitary yin.\"\n\nCombined with the Master’s teachings, is there not something called the \"true seed\" at work? Yet if it is not sought outside this body, its meaning is profoundly subtle.]**\n\n**Seventh Principle**\n\nMaster Niwan states: Indeed.",
      "start_char": 3880,
      "end_char": 5126,
      "start_sentence": 148,
      "end_sentence": 198,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.52263927459717,
      "metadata": {
        "source_file": "dao\\藏外\\泥丸李祖师女宗双修宝筏.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "［太虚氏曰：《道德》、《南华》，非女子所能日诵，《清净》一经，读之宜熟，内则宜崇，啉惟《坤宁》、《贞一》二经欤！ 盖性不彻者命难存，戒不严者功不笃也。 味师引偈，其义隐奥，讵易测核，虽沐揭示上上法，凡女何知，依然洋望，天下比比也。 盖含全部火记于中。 熟读《黄帝阴符》，参看《龙虎》、《参同》、《悟真》，乃可与言是则也。 炳为略示端倪，曰：翻来自覆去，其事有循环。 识得一中一，参参一在前。 都来只二炁，精交影万端。 身无一乃现，能包彼大千。 大千影灿灿，灿灿是彼元。 不为元引去，元始即吾元。 元元不一一，一一一无全，寂然不撤手，功夫岂等闲。 雀燕由渠燕，鸦寒亦听寒。 不饥时不到，时到任吾餐。 是为妙中妙，玄中更有玄。 白知故守黑，浑望得大全。 间渠何得尔，极无极具焉，师之精义盖如此，虽然，有无自相生、取舍须循一也。 色身不化，百事无成者］ 第九则 泥丸氏曰：善哉，汝说也。 语有诸：欲事超凡、先净凡思，继空三界； 而不愆内则，不媚鬼神，孝敬慈祥，无违夫子； 柔顺利贞，不违坤道； 动则循理，静则释如； 寓道妙于执箕执帚，悟火候于执爨执炊。 诗曰：委委佗佗，如山如河。 之子不淑，云如之何。 其垂戒也，为何如哉！ ［太虚氏曰：师此一则，其旨微矣。 盖夫世之皈道皈释者，鲜循内则，罕识性宗，能柔顺以事师长，每嫉狠以悖伦常，其弟其师，不齿于名教，抑将自投于铁围阿鼻也，不亦哀哉。 一得曰：我师太虚翁无上大道得传于师祖泥丸氏者，十有八九，更于此书见矣。 按：此中心传，岂仅女宗之宝筏？ 男宗枕秘夕于中逗透者，不一而足。 原本盖由辗转传写，颇多讹舛，谨订正而厘定之。 惜有《男宗双修宝筏》，为长山袁氏携去。 待访之，应未失也。 盖男宗书中，亦逗《女宗宝秘》，而其誊本，乃亦大有脱简，若得而订正之、合刻之，斯成完璧，两书得以会参矣，渡世之功不小也。 识此以告得男宗书之君子云，毁去善书，必遭冥罚，见诸经典，可不戒哉。 金盖山人闵一得谨跋。 时维道光十年岁次庚寅孟秋望日］",
      "translated_text": "Tai Xu Shi said: The *Dao De Jing* and *Nan Hua* are not texts a woman can recite daily. The *Qing Jing Jing* should be read until thoroughly familiar, its inner principles revered. Yet are not the *Kun Ning* and *Zhen Yi* the two sutras most fitting? For without penetrating nature, life cannot be preserved; without strict discipline, merit cannot be firm.\n\nThe Master’s cited gatha holds meanings profound and obscure, difficult to fathom. Even with the revelation of the highest Dharma, how can ordinary women comprehend? They remain adrift in longing—such is common throughout the world. For within them lies the complete record of the Fire.\n\nStudy deeply the *Huangdi Yin Fu*, and examine the *Long Hu*, *Can Tong*, and *Wu Zhen*—only then may one speak of this principle. I shall briefly outline its contours:\n\nTurning and returning,\nthe matter follows cycles.\nRecognize the one within the one—\nthe threefold one stands before you.\nAll comes down to the two qi,\ntheir essence intertwined, shadows myriad.\nWhen the body holds not one,\nit manifests, embracing the great thousand.\nThe great thousand’s radiance gleams,\ngleaming is the other’s origin.\nIf not led astray by the other’s origin,\nthe origin is one’s own origin.\nOrigin upon origin—not one,\none upon one—not whole.\nStill, without letting go,\nhow could the work be ordinary?\n\nSwallows and sparrows follow their nature,\ncrows and cold do the same.\nWhen not hungry, they do not come;\nwhen the time arrives, they feast at will.\nThis is the wondrous within the wondrous,\nthe mysterious within the mysterious.\nKnowing the white, guard the black—\nin utter oblivion, attain the great whole.\nHow does it come to be so?\nThe utmost void contains the utmost.\nSuch is the Master’s profound meaning.\n\nYet being and non-being arise from each other;\ntaking and relinquishing must follow the one.\nIf the colored body is not transformed,\nnothing can be accomplished.\n\n---\n\nNinth Principle\nNi Wan Shi said: Well said, your words! There is truth in this:\n\nTo transcend the mundane, first purify mundane thoughts,\nthen empty the Three Realms.\nYet do not transgress inner principles,\nnor flatter ghosts and spirits.\nBe filial, reverent, kind, and gentle,\nwithout defying the Master.\nBe yielding, smooth, advantageous, and steadfast,\nwithout straying from the Way of Kun.\nIn movement, follow principle;\nin stillness, release all.\nEmbed the wondrous Dao in holding the dustpan and broom,\nawaken to the Fire’s timing in tending the stove and cooking.\n\nThe *Odes* say:\nGentle and graceful,\nlike mountains, like rivers.\nIf one is not good,\nwhat can be done?\n\nSuch is the warning—how grave!\n\n---\n\nTai Xu Shi said: This principle of the Master is subtle indeed. For those in the world who take refuge in the Dao or in Buddhism, few follow inner principles, few grasp the nature of the school. Able to be yielding and compliant with masters and elders, they often grow jealous and cruel, defying human relations. Their disciples and masters are scorned by the teachings of names, and they cast themselves into the Iron Enclosure and Avīci—is this not lamentable?\n\nA note says: My Master, Tai Xu the Elder, received the supreme great Dao from his Master Ancestor Ni Wan Shi in nine parts out of ten. This is further evident in this book. Yet this transmission of the heart is not merely a precious raft for the women’s school. Among the men’s school, those who have penetrated its secrets in their evening meditations are not few.\n\nThe original text, having passed through many hands in transcription, contains many errors. I have carefully corrected and arranged it. Alas, the *Precious Raft of Dual Cultivation for the Men’s School* was taken away by Yuan of Changshan. I shall seek it—it should not be lost.\n\nFor in the men’s school texts, the *Precious Secrets of the Women’s School* are also embedded, though their copies suffer many omissions. If obtained and corrected, then combined in publication, they would form a complete work, allowing the two schools to be studied together. The merit for crossing the world would be no small thing.\n\nI record this to inform the gentlemen who possess the men’s school texts: to destroy good books is to invite karmic retribution. As the scriptures warn, can one not beware?\n\nJin Gai Shan Ren, Min Yi De, respectfully postscripts.\nOn the full moon of the first autumn month, the tenth year of Daoguang, gengyin.",
      "overlap_context": "en not hungry, they do not come;\nwhen the time arrives, they feast at will.\nThis is the wondrous within the wondrous,\nthe mysterious within the mysterious.\nKnowing the white, guard the black—\nin utter oblivion, attain the great whole.\nHow does it come to be so?\nThe utmost void contains the utmost.\nSuch is the Master’s profound meaning.\n\nYet being and non-being arise from each other;\ntaking and relinquishing must follow the one.\nIf the colored body is not transformed,\nnothing can be accomplished.",
      "start_char": 5130,
      "end_char": 5948,
      "start_sentence": 199,
      "end_sentence": 238,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.9859561920166,
      "metadata": {
        "source_file": "dao\\藏外\\泥丸李祖师女宗双修宝筏.txt",
        "category": "藏外"
      }
    }
  ]
}