{
  "source_id": "洞元子内丹诀",
  "source_file": "chunked_daozang\\洞元子内丹诀.json",
  "total_chunks": 15,
  "total_original_chars": 14272,
  "total_translated_chars": 81328,
  "total_translation_time": 417.21259212493896,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏太玄部\\洞元子内丹诀.txt",
    "category": "正统道藏太玄部"
  },
  "full_translation": "**The Internal Alchemy Formula of Master Dongyuan**\n\n**Title:** *The Internal Alchemy Formula of Master Dongyuan*\nTwo fascicles, likely composed during the Song dynasty.\nSource text: *Daoist Canon of the Zhengtong Era*, *Tai Xuan* Section.\n\n**Preface to *The Internal Alchemy Formula of Master Dongyuan***\n\nIn high antiquity, a million Daoist adepts attained the Dao, yet those who composed texts to guide the virtuous were but one in ten thousand! Yet when their words abound in allusions, the true source remains concealed, and the essential purport of their writings bewilders the multitude. Some compel readers to consult external classics, seeking correspondence with the primordial mystery. The analogies grow ever more intricate, the gates of elucidation ever more obscured—none but those who have penetrated the Dao can fathom them.\n\nThe sagely Dao is not inscribed upon bamboo slips; the path of cultivation unfolds along its own course. Some achieve it in ten months, others in a thousand days. The slightest misstep, and one plummets to become a ghost below. Thus, the drawer of the Eight Trigrams must array their images; the diviner of fortune must weigh their lines. The cycles of sun and moon transpire within them, and transformation resides therein.\n\nWhen lines and images take form within, change manifests without—such is the great virtue of Heaven and Earth that gives rise to the ten thousand things. The sage models themselves upon this, treasuring their position. To treasure one’s position is to treasure the sage’s body—how could it refer to mere rank? When position endures, the humane abide within it; when position is lost, the humane depart. If the humane are but of innate nature, how can they cultivate? Those who know and cultivate—are they not sages?\n\nThe hare and crow race to perfect their brightness; cold and heat alternate to complete the year. The dragon crouches to seek transformation; the toad bends to advance. Essence and thought reside in spirit, and in the end, their function is attained. In stillness, one may guard the affairs of the world—divergent paths converge in the same return.\n\nThus, the humane secure their bodies, dwelling in silence to await their use. They exalt virtue and achievement to fulfill their being. In recent times, deluded and errant disciples, having barely grasped the Lesser Vehicle, claim to have attained the Dao. They seek only liberation through thought, styling themselves as immortals, yet they know not that the path of thought-liberation is wholly a derangement of spirit. It does not compare to the immortal who refines spirit into transcendence.\n\nOnly humans possess spirit, ever capable of self-perception. Though the eye constantly beholds it, one does not recognize it—thus the sage says it is used daily yet unknown. Suppose a scholar gazes into a mirror and beholds the reflection within—is it not spirit? Whether the countenance is fair or foul, it is revealed in the reflection. How does the reflection in the mirror differ from the scholar who gazes into it? Thus, the image in the mirror—is it not called spirit?\n\nPeople see their spirit yet do not cultivate it—are they not then ghosts? Therefore, the sage says: people know spirit as spirit, yet do not know that the unspiritual is also spirit—this is the meaning.\n\nThose who refine spirit into transcendence must first refine their form. When the form is whole, the spirit is whole. One may ask: What does it mean that when the form is whole, the spirit is whole? I reply: Consider a scholar blind in one eye who gazes into a mirror and observes the reflection—it is the same. There has never been a one-eyed scholar whose reflection was not also one-eyed. Yet if a whole scholar gazes into a mirror, the reflection is one-eyed! Thus, one must first make the form whole.\n\nAnother asks: Does spirit dwell within the human body? I say: It dwells there. Then why does it emerge when one faces a mirror? I answer: If it does not emerge when facing a mirror, that is blindness in the person—spirit emerges yet is unseen. Moreover, the spirit in the human body is like a dwelling; spirit abiding in human form is like a person lodging in a house. If entry and exit are unobstructed, the locks and bolts secure, there will be no error. Thus, when the house decays, the person departs; when the form deteriorates, the spirit flees—this is the essential Dao.\n\nAll who cultivate must first be magnanimous and virtuous, abundant in righteousness and trustworthiness, radiating kindness and generosity, shunning greed and distancing harm. They do not engage in envious or grasping conduct—this may be called clarity. They do not utter flattering or deceptive words—this may be called integrity. They rescue the drowning, save the burning, support the distressed, cherish the young, comfort the aged, aid the imperiled, deliver the endangered, reduce punishments, quell anger, deliberate in affairs, bestow kindness upon the people. They regard evil as scalding water and good as ever beyond reach. With long-accumulated hidden merits, their solar virtue naturally flourishes. They do not add envy and grasping to self-destruction, nor rely on lust and desire to self-injury. When essence is preserved, spirit is firm; when essence is exhausted, spirit departs. Thus, the sage says: first essence, then spirit; first spirit, then transcendence.\n\nIn recent times, disciples ignorant of the sagely Dao all practice purity and restraint, dwelling in seclusion among forests and springs, subsisting on coarse fare and wearing plain robes, avoiding the bedchamber. Their essence knows no leakage, and their spirit is naturally whole. This may prolong life to dwell in the turbid world. Yet when their allotted span ends, piled kindling burns them. The essence they preserved without leakage becomes a strange relic of their vows—fierce fire cannot reduce it to ash, flowing water cannot dissolve it. Thus, the scriptures say: those who cling to it do not understand the Dao and virtue—this is the meaning.\n\nToday, people who barely enter the gate of grain-abstention and tranquility style themselves as immortals, clinging to their attachments. Alas! How truly pitiable!\n\nThose who refine the elixir without recourse to the Eight Trigrams labor in vain. Now, I have comprehensively set forth the methods of immortal cultivation and self-nurturance, arranging them in chapters. I wish that all learners may not waste their aspirations. There is no need to harmonize them with the *Zhouyi Cantong Qi* or the *Taiyi Supreme Diagram*—the principle shines forth clearly. I have expounded the essential purport in detail. Let all Daoist adepts examine and savor it.\n\n**The Internal Alchemy Formula of Master Dongyuan, Fascicle One**\n\n**Chapter One: The Primordial Mystery**\n\nThose who refine the elixir do not refine common lead and mercury—they refine true lead and true mercury. The sages drew analogies to model them for the multitude. They spoke of grasping lead and casting mercury, of timely firing, and of gathering the flower—how people regret their ignorance!\n\nThe northern *qi* is called Water, and the southern *qi* is called Fire. The two *qi* of Water and Fire must be gathered at the proper time and employed on the proper day. If one gathers them at the wrong moment, even after a hundred years of refinement, it will be in vain. But if the sun and moon return to their origin and Water and Fire achieve balance, success comes swiftly.\n\nThus, the \"elixir\" refers to the Cinnabar Field. How could mere lead and mercury ever succeed? The Upper Cinnabar Field is called the Muddy Pellet; the Middle Cinnabar Field is called the Crimson Palace; the Lower Cinnabar Field is called the *Qi*-Sea, also known as the Cauldron. One draws the *qi* of Water and Fire and returns it to the Cauldron—hence the term \"Furnace.\"\n\nTo reduce lust, cherish seminal essence, strengthen the sinews and bones, and nourish the Muddy Pellet is to refine the Upper Cinnabar Field. To cultivate a heart of loyalty, filial piety, and compassion; to bear the Way of rescue and succor; to walk in benevolence all day without ceasing; to broadly bestow aid without expectation of reward; to embrace the One and guard it, keeping one’s essence unshaken—this is to refine the Middle Cinnabar Field. To draw in the *qi* of Water and Fire and return it to the Furnace and Cauldron, never scattering one’s essence and ultimately securing the root—this is to refine the Lower Cinnabar Field.\n\nWhen the three Cinnabar Fields are accomplished, how could one die? Even the forms of Heaven and Earth endure long. Cold and heat alternate; the sun and moon revolve in succession. Great mountains have clouds; vast seas have tides—all are the cyclical movements of *qi*. So too is it with humans. Thus, the eyes are likened to the sun and moon; the intestines and stomach to rivers and seas; the liver to eastern Wood; the heart to southern Fire; the lungs to western Metal; the kidneys to northern Water; the spleen to central Earth. The ebb and flow of *qi* are likened to clouds; the circulation of fluids to tides; the flow of blood and vessels to rivers; the chamber of essence in the lower origin to the sea.\n\nThus, the sages followed the transformations of Heaven and Earth, taking their patterns as models for cultivation—thereby attaining long life and ascending as immortals. Yet many fools exhaust their minds and spirits, clinging to their own deluded views, forgetting even sleep and meals. All day they toil, yet never see success. For the *qi* of yin and yang must be gathered at the proper time; if the moment is missed, the elixir cannot be achieved.\n\nIn the fifth month, the first yin arises, and yang wanes while yin waxes. The *qi* of yin and yang are born on fixed days and gathered at fixed times—thus the year has its months, and the day its hours. The eleventh month, the Winter Solstice, is when the first yang arises; the rest follow accordingly. Yang is to be employed, while yin is to rest. Thus, those who gather *qi* often take the midnight hour of *zi* as their time—this is the same principle. The great employment is at the Winter Solstice; the lesser, at midnight. Here, a hairsbreadth’s error leads to a thousand *li*’s deviation.\n\nThe formula states:\nCommon lead and mercury are not Water and Fire;\nTrue Water and true Fire are but one.\nTransformed into Dragon and Tiger, they follow in tandem.\nWhen the Dragon moves, the Tiger does not rest.\nOnly on the proper day must you diligently drive them,\nAt midnight, the hour of *zi*, ensure their continuity.\n*Qi* is the Dragon, fluids are the Tiger;\nTogether they enter straight into the Mysterious Palace.\nIf you grasp the proper time and obtain them,\nThat person will ascend the path to the clouds.\n\n**Chapter Two: The Kan Palace**\n\n*Kan* is the North, representing yin, the moon, the Tiger, Water, and *qi*. Its trigram is ☵, two yin lines with one yang—yang born within yin. Water nurtures the myriad things; *qi* gives life to the myriad things. When the primordial chaos divided, its *qi* resembled water, then yang was born. Yang dwells within the shell—like an egg, or the *Kan* trigram’s two yin lines enclosing one yang. This is the principle of yang arising at the extreme of yin.\n\nThus, it can generate yang. When yang arises and unites with yin, Heaven and Earth divide, and the myriad things are born—this is the source of the Dao. Heaven and Earth endure long, beginning with Water. Thus, those who refine *qi* guard *Kan*; to lose *Kan* is to lose the Mother. Without the Mother, nothing can be nurtured. Therefore, one must guard the Mother to achieve success.\n\nDwelling in obscurity, yet within it lies principle—this is the meaning of *Kan*! Nurturing clarity within profound darkness, obtaining the thing within the indistinct—is this not refining essence and securing the thing? When the noble person maintains integrity amid turmoil, preserves their aspiration, and nurtures *qi* in profound obscurity, they safeguard the Dao. With aspiration intact, nothing is not established; with the Dao preserved, nothing is not achieved.\n\nThe *Book of Changes* says: *\"With sincerity, the heart is nourished.\"* Those who act while employing it do not ascend to Heaven, for Heaven is perilous. As for the Gate of the Mysterious Female, returning to the sea—if one departs from the Mysterious Female, they are lost. Thus, the *Book of Changes* says: *\"Action has its reward.\"* The two yin lines both proceed to pay homage to the Valley Spirit, traversing the meridians and all the peaks. Therefore, the *Kan* trigram’s image is heavy yin, yet its *qi* ascends without error, its fluids flow without disorder. Gathering must be done by the day, employment by the hour. Essence is not scattered; *qi* does not err. Traversing the paths, all return to the One.\n\nThus, the *Book of Changes* says: *\"Water flows without overflowing, traverses peril without losing its reliability.\"* How true this is! Those who cultivate *qi* must constantly practice within the *Kan* Palace, circulating it with measure, day and night without fail. After a thousand days, the work is complete. Thus, the *Book of Changes* says: *\"The noble person constantly practices virtue and habituates to affairs.\"* It also says: *\"If one does not succeed in three years, there is misfortune; if one does not complete it in a thousand days, the end is calamity.\"*\n\nThe *Qi*-Sea is called the Cauldron, also the Vessel. The two yin lines converge below, returning to the Cauldron’s fluids as Jade Flower. The Cauldron is called the Numinous Root; the path of *qi*’s movement is also called the Balance Hut. The taste of Jade Flower is as sweet as honey. Once it returns to the Cauldron, the Dao is first accomplished.\n\nThus, the *Book of Changes* says: *\"The fourth line: wine in a clay vessel, a second offering in a bamboo basket—simple and sincere.\"* This is the image. The seal-script says...\n\nThe image of the Kan Palace is that of primordial chaos, profound obscurity, and fleeting indistinctness—where mutual generation, yin and yang, and mother-and-child arise. When its movement brings clarity to the heart, there is trust; when it flows without overflowing, faces peril without disorder, there is sincerity. Without constant practice of virtue and habituation to affairs, one will not complete the thousand-day work and meet misfortune.\n\nThe fluid of this palace, refined over time, becomes the swift and surging Jade Flower—its essence. The \"wine in a clay vessel\" of the fourth line represents the fluid of the two yin; receiving it in an earthenware vessel is the Cauldron. The noble person who treads this path must be cautious, for no error is greater!\n\nThe secret formula says:\n*Qi becomes dragon, its fluid the tiger;\nWater has bones, fire has earth.\nPeople of this age do not comprehend yin and yang,\nNor know the root that gives birth to mother and child.\nChild welcomes mother, mother follows child—\nThe wine’s fine taste is sweet as nectar.\nAssisted into the River Chariot, borne back,\nWhite-haired, they guard each other without death.\nThe Mysterious Female’s gate is sealed tight,\nAt ease, seated only in the Jade Terrace.\nBathed in the divine spring, impurities shed,\nHunger feeds itself by kindling the primordial fire.\nAfter a thousand days, the work is complete, offspring born—\nThus it is said: \"My fate lies within me.\"*\n\n**Li Palace, Third Section**\nThe Li Palace is the position of the south, where the king’s virtue resides in fire—radiance and emanation. The *qi* of the Great Yang is both firm and fierce, hence its trigram is ☲, the image of Li: soft within yet firm without. With softness, it delights the firm; with firmness, it governs the soft—harmonious and compliant. When yang reaches its peak, yin arises; when yin reaches its peak, yang arises. Thus, Kan holds firmness within, Li softness within—harmonious and compliant.\n\nThe crow in the sun, the hare in the moon—such is the abundance of double brightness. Without obtaining yin’s virtue, it cannot endure. The abundance of double yin, without obtaining yang, cannot last.\n\nIn the practice of refining *qi*, one does not achieve completion by circulating only the Kan Palace, nor by circulating only the Li Palace. If one operates in isolation, yin and yang will not harmonize, leading inevitably to errors and making success difficult—like digging into the earth to seek the sun and moon.\n\nKan contains yang, Li contains yin; circulating them mutually completes their image. Thus, the *Book of Changes* says: *\"Raising a female ox brings good fortune.\"* The ox is *chou* (丑), which is yin. *Chou* is the final position of the north, neighboring Kan. When the fire of Li blazes intensely, it must be tempered by the water of Kan; without this tempering, misfortune follows. Hence, *\"Raising a female ox brings good fortune.\"* Receiving it and returning to the Cauldron, flowing together in the Balance Hut, the body’s *qi* radiates brilliance, the complexion like ice and jade. Thus, the *Book of Changes* says: *\"The great person continues brightness, illuminating the four directions.\"*\n\nAbsorbing the *qi* of Li and completing it with Kan, life arises from the heart—for the heart is the Emperor Lord. One must carefully proceed without losing the proper measure; losing measure invites misfortune. Thus, the *Book of Changes* says: *\"Suddenly, it comes like fire, like abandonment.\"* And: *\"Like death, like pouring away.\"* This describes encroaching upon the supreme—referring to the heart.\n\n**Image.** The *Xiang* says...\n\nWith softness one delights the hard; with hardness one governs the soft—this is the Dao of yin and yang, their harmony. Moving Kan to complete Li, moving Li to complete Kan—this is the *qi* of yin and yang, where movement and stillness nourish each other in alternation.\n\nRaising a female ox is to take softness to restrain hardness. *\"The great person continues brightness, illuminating the four directions\"*—receiving the flourishing *qi* of Li, one’s complexion shines radiantly, the four limbs are joyful and moist, free from all illness and affliction.\n\n*\"Suddenly, it comes like fire, like abandonment—like death, like pouring away.\"* When the *qi* of yin and yang flows smoothly, brightness encompasses darkness, dusk awaits dawn, and the Dao is accomplished in its embrace, while the form of the year is cast aside.\n\nAs for the Dao, to practice this is to ensure that primal delusion inevitably arises.\n\n**Secret Formula:**\nOne tiger’s power can govern two dragons,\nTogether they enter and exit the Mysterious Palace.\nThe Mysterious Palace’s terrace and halls stretch wide as the Celestial River,\nWithin them contains a luminous, round moon.\nIn the moon, a rabbit stirs restlessly,\nDrawing forth the yang crow to take flight at midnight.\nIt seeks the golden body, desiring to be refined in the Cauldron—\nIf not for the whetstone, who would dare to temper it?\n\nThe maiden of the Kan Palace is young in years,\nEver clad in dark robes, boasting of her grace.\nThrough the night she tends her cloud-like tresses in pairs,\nYet without seeing her true beloved, she never smiles.\nFortunately, the Li household has two fine sons,\nThe Three Powers complete in their majestic bearing.\nThey come to divine a marriage, at last content in their hearts,\nJoining in union, they set out jade wine in mutual offering.\n\nHaving drunk the jade wine, they sleep in perfect peace,\nWith a quilt of *qi* in hues of dark and yellow, like blossoming flowers.\nIn the jade hall and golden palace, their hearts are bound as one,\nVowing to share joy for ten thousand years.\nAfter ten thousand years, they swear anew,\nThis time to gaze together through the end of heaven and earth.\nYet once the adept has united them in bliss,\nHe commands her to wed the Infant instead.\n\nThe Infant’s yang *qi* is not yet complete—\nWhere then shall this maiden bear her descendants?\n\n**Hexagram 63: \"After Completion\"**\n*\"After Completion\"* means all is completed—great and small alike are fulfilled, hence it is called *\"After.\"* It is also said: *\"Though failing, one can stand; though leaking, one does not drown.\"*\n\nIts hexagram is **䷾**, the image of *\"After Completion,\"* the coupling of yin and yang. Coupled yet not disordered, hence it is called *\"Completion.\"* One yin and one yang—this is called the Dao, and the image of *\"After Completion\"* is just this.\n\nFor those who cultivate *qi*, one must first absorb Li after midnight, for Li’s six lines are complete, then absorb Kan, for Kan’s six lines are sufficient. Li comes first yet dwells below; Kan follows yet dwells above. Thus, above and below, water and fire achieve completion—completion that is fundamentally non-completion.\n\nThe first nine is flourishing yang, returned to the Cauldron, hence the *Book of Changes* says: *\"It wets its tail.\"*\n\nThe maiden of the Kan Palace, originally of Li’s position, attends the Cauldron at dawn, having lost her home and become a wanderer. The first nine of Li’s realm obtains the lesser yin and lesser yang, beginning in their coupling, yet the intent is not yet dense, hence the *Book of Changes* says: *\"It loses its ax.\"*\n\nSeven is called *\"attaining longevity\"* through harmony. Drawing the *qi* from the Kan Palace, it returns to the lower Cinnabar Field to pair with Li. Practicing this for three years, its merit naturally arrives, hence the *Book of Changes* says: *\"Attacking the Ghost Region, after three years one overcomes it.\"*\n\nA man whose yang has declined, though aged, may serve the Dao. Knowing the function of Kan and Li, refining without deficiency, guarding the proper time without fail, he too may replenish the upright *qi*. With long and persistent practice, he may attain immortality, hence the *Book of Changes* says: *\"The glutinous millet has clothing—from beginning to end, it is called vigilance.\"*\n\nThe *Book of Changes* says: *\"The beginning is what stops the boat’s leak.\"*\n\n**Image.**\nThe *Xiang* says...\n\nFirst high then low—water and fire. The imagery of water and fire, when balanced, is the pairing of yin and yang. Water and fire enter the cauldron, thus \"wetting its tail.\" The Kan maiden stands apart; the Li man obtains her. Without gathering to unite, he seizes her midway, hence \"losing his rank.\" Those who attain it in seven days achieve harmony naturally. \"Attacking the Ghost Region for three years\"—the Ghost Region is yin. Drawing and circulating the *qi* from the Kan Palace for a thousand days, only then does success come, hence \"overcoming it.\" For the Dao practitioner, though aged, if this refinement of *qi* is never neglected, the spirit and essence naturally replenish, thus \"the beginning is what stops the boat’s leak.\"\n\n**Formula:**\nThe Li man of the Yellow Court masters rare arts,\nAbandoning home for ten thousand leagues to court the Golden Gate.\nScarcely has he entered the Golden Door when the sun is not yet high,\nYet loftily he alone upholds the steadfastness of a true man.\nAh! In the north there is a fair maiden,\nHer face like peach and plum, her form like silver.\nAlone she drives the River Chariot to the jade door of the Li Palace,\nComing to the Primordial Mansion to seek union.\nOnce their marriage is joined, heaven and earth converge,\nSun and moon circulate in constant advance and retreat.\nAt midnight they meet at the hour of *zi*,\nThus yin and yang achieve the *Completion of the Cauldron*.\n\n**Hexagram 64: \"Not Yet Completed\"**\nYin begins, yang ends, hence \"Not Yet Completed.\" Yet \"Not Yet Completed\" ultimately reaches completion—through the proper sequence of yin and yang, it finally attains balance. Its hexagram is ☲☵, the proper order of yin and yang: fire above, water below, yet able to complete itself. For those who refine *qi*, returning at noon before yin *qi* arises, drawing and absorbing it to form their body—first Kan, then Li. Thus the six yang lines are matched by six Li.\n\nNext, when the initial yin is absorbed and returned to the Great Granary, yin *qi* is just beginning to stir, hence \"Not Yet Completed.\" As the *Book of Changes* says: *\"The little fox, having crossed, wets its tail.\"* This is it. The single yang of Li then enters the yin cauldron, and the union is obtained, hence \"ultimately completed,\" using firm strength to rescue the yielding. As the *Book of Changes* says: *\"Dragging its wheels—steadfastness brings good fortune.\"* This is it. With firmness guiding the yielding, yin restraining yang, the noble man’s Dao harmonizes with the petty man. As the *Book of Changes* says: *\"The noble man’s radiance holds sincerity.\"* This is it. Through the rescue of \"Not Yet Completed,\" \"Completion\" is attained.\n\nThe noble man obtains emolument and secures his household;\nThe Daoist obtains blessing and secures his person.\nAs the *Book of Changes* says: *\"The topmost yang holds sincerity in drinking wine.\"* This is it.\n\n**Image.**\nThe *Xiang* says...\n\nThe \"small fox crossing\" speaks of the fox as a yin creature, its strength slight and subtle—if it seeks to cross, it must first wet its tail! The yin creature refers to Kan; yin is obtained by yang, and Kan resides at its center, where firmness and yielding harmonize in joy, thus \"dragging its wheels.\" The noble man’s Dao first humbles itself before attaining honor, first avoids blame before achieving steadfastness. Dwelling in the time of \"Not Yet Completed,\" he is thus weak among the people, but after \"Completion\" is ultimately achieved, he must rise above them. Hence, \"the noble man’s radiance holds sincerity.\" Beneath \"Completion,\" one secures the body and knows destiny, obtaining Heaven’s emolument, thus \"holding sincerity in drinking wine.\"\n\nOne yin and one yang occupy the positions of firmness and yielding. Without force, one follows the Dao of Heaven, circulating its qi—hence \"ultimate completion.\" The formula states:\n*Within the Mysterious Palace, doors and locks are probed,\nA maiden of sixteen, graceful and refined,\nLong lamenting that no matchmaker comes to her gate,\nShe rests her chin, alone in her tower’s solitude.\nUnbeknownst to her parents, she slips from her chamber,\nHer beauty revealed as she wanders the streets.\nWith unhurried steps, she seeks the Yang Chamber,\nEntering the Dragon Palace with no strength left.\nThere she meets the Yang Lad driving his fiery wheel,\nUntimely they knot their pendants and swiftly wed.\nYin and yang alternately restrain each other—\nThe Dao of long life must ultimately be completed.*\n\n**Chapter Six: \"Not Yet Completed\" and \"Completion\"**\n\"Not Yet Completed\" begins with yang and follows with yin; \"Completion\" begins with water and follows with fire. In the preceding hexagram images, Heaven precedes Earth—this is the proper order of yin and yang. The moon precedes the sun—this is the Dao of mother and child. Thus, in union, the One gives birth to the myriad things.\n\nAll who cultivate qi must do so at the proper time. Having grasped the timely application, first employ the four yang lines, then the four yin lines, then again four yang to unite them, forming the twelve images. Then, in turn, first employ four yin lines, then four yang, then again four yin, uniting them into the twelve hexagrams—here the work is complete.\n\nThe formula states:\n*When the Great Yang first arises, the moon begins its motion;\nWhile the Great Yang has not yet waned, the moon must advance.\nOrdinary folk speak of the moon’s slow birth,\nYet in one night it circles the heavens twelve times.\nWhen you move, I too depart;\nWhen I advance, you do not stay.\nTogether we follow for a thousand myriad autumns,\nMeeting where place and time align.\nWithout the proper place, do not act recklessly;\nWithout the proper time, do not apply carelessly.\nExamine deeply and guard firmly—\nLet no common person know that I am the immortal and you are the mortal.*\n\n**Chapter Seven: The Qian Palace**\nHeaven and Earth first nurture the qi of yin and yang, thus Kan and Li precede Qian and Kun. The sun and moon move within Heaven and Earth—speaking in terms of proximity, Qian and Kun precede water and fire. The盛ness of yang virtue moves without weariness: at first, it is misty and obscure; in the end, it becomes visible. Unyielding, it never ceases; tempered, it never retreats. Vigorous, it can act; firm, it does not deviate. Gathered, it is as minute as a hair or mustard seed; expanded, it pervades the myriad things. It may be revered but not intimately approached—this demonstrates its loftiness. It may be observed but not fathomed—this demonstrates its numinosity. Unceasing throughout the day, never losing its subtlety—this is the essence of Qian!\n\nIts hexagram is ☰. For those who cultivate qi over time and abide in Qian, their virtue and power are firmly established. Heaven and Earth transform and give birth to the myriad things; following their transformations, one likewise nurtures change. One must act in accordance with the time, drawing in singly and receiving it. That which is received is called the Azure Dragon. The first yang begins its journey, its strength still subtle, unable to transform. It extends its position, and the noble man endures hardship while awaiting its盛ness. As the *Book of Changes* says: *\"The first nine: The hidden dragon—do not act.\"* \"Do not act\" means it is not yet time to act.\n\nDrawing it again and extending it, it arrives at the victorious ground. Yang virtue resonates and suddenly盛s, blazing forth, shining brilliantly, and settling resplendently. Its power can universally aid and occupy the central position. Positioned at the center, it harmonizes above and below in Heaven. Thus, the *Book of Changes* says: *\"The second nine: The dragon appears in the field.\"*\n\nDrawing it forth and further extending it, its image is completed. At the utmost height, without treading on doubled firmness, one cannot yet be at ease. The noble man reduces his thoughts, guards against desires and pleasures, cultivates virtue and power as his city walls, severs benevolence and righteousness as his shields and screens, is cautious in speech and secretive in pivotal matters, embodies the profound and obscure while observing the manifest. He attains the end of the time without negligence, practicing his Dao. Thus, the *Book of Changes* says: *\"The third nine: The noble man is ceaselessly active all day, vigilant in the evening as if facing danger—no blame.\"*\n\nQian originally has no name. When drawn forth and put into motion, it is imitated and symbolized; when forced and enacted, it is named after myriad things. When the single qi flows and expands, jade-like radiance surges and streams, infusing the numinous source, each governing its position. After a thousand days of work, one’s ability to transform is witnessed. Thus, the *Book of Changes* says: *\"Clouds move, rain falls, the myriad beings take form. The great light begins and ends, riding the six dragons to drive Heaven.\"* The Dao of Qian transforms, each rectifying its nature and destiny. The noble man receives its image.\n\nBefore the numinous fungus sprouts, its root is just planted. Drawing it again and extending it, yang virtue becomes盛. When one line resonates, no affair is short-lived—thus one obtains its benefit and profits the body. Having profited the body, one must firmly guard it, without indulging in idle thoughts. Thus, the *Book of Changes* says: *\"Origin is the leader of goodness; prosperity is the gathering of excellence; benefit is the harmony of righteousness; steadfastness is the trunk of affairs.\"* Here, the Dao of *origin, prosperity, benefit, and steadfastness* is complete!\n\n**Image.**\nThe *Xiang* says: *\"The hidden dragon—do not act\"*—the noble man’s Dao begins subtly. *\"The dragon appears in the field\"*—the Azure Dragon emerges from concealment, its virtue about to be employed, ascending to the cauldron. *\"Ceaselessly active all day, vigilant in the evening—no blame\"*—the Dao’s beginning becomes manifest; the warning lies in desire. *\"Proceeding to act\"*—clouds move, rain falls, the fluid qi flows together. *\"The great light begins and ends\"*—the work of a thousand days.\n\n**Oral Formula says:**\nThe noble one’s Dao begins as clarity—\nDo not act, do not employ, nor strive in practice.\nIf the single dragon returns again to the primal cauldron,\nLuminous and penetrating, discourse reaches the numinous.\n\nFire seeks dryness as clouds follow the dragon,\nEcho answers sound as wind attends the tiger.\nPreserve the Valley Spirit—if it does not die,\nThe Azure Dragon shall not gallop to foreign lands.\n\nDrive and chant, summoning it into the Great Yang,\nAllowing transformations to unfold by their own power.\nIf the driving and expelling do not move,\nTen thousand hosts shall fall to ruin.\n\nRefine no cinnabar, bind no mercury,\nNor meddle with yin-yang’s charcoal and fire.\nSince ancient times, countless households have been undone—\nAll saw immortals, yet none received their welcome or send-off.\n\nWelcome has its method, send-off its place;\nSecure the golden chamber, array the precious vessels.\nArray the precious vessels—ground them well,\nArrange dragon and tiger according to their stations.\nDo not let water and fire’s natures fall out of harmony,\nFor such a one shall surely gain the *qian*-origin’s benefit.\n\n**Hexagram *Kun*’s Chapter, the Eighth**\nOf heaven and earth’s Dao, none is greater than yin and yang.\nWhen yin reaches its extreme and surges, yang must govern it;\nWhen yang waxes in hardness, yin must subdue it.\nOnce governance and submission are settled,\nDragon and tiger find peace, and their positions become firm.\n\nThus, heaven and earth’s virtues unite, sun and moon pair,\nThe four seasons follow their order, ghosts and spirits align in fortune or misfortune—\nSuch is the greatness of the Dao’s mechanism.\nThe Dao of *Kun* is to comply and yield,\nSoftly submitting and guarding itself, giving birth to the myriad things.\nPreserving integrity and benefit, bringing the myriad things to completion.\n\nIts hexagram is formed thus: *Kun* means compliance.\nThe Dao of soft compliance preserves and completes the body,\nThen integrity and benefit follow.\nFor those who refine *qi*, it must be gathered in season,\nPressed and ingested, so that heaven and earth’s Dao\nNeither errs in cold nor heat.\nWhen cold and heat do not err, all affairs endure in harmony.\nHeaven’s Dao unites in accord, then preserves the great and endures long—\nThus the *Xiang* says: *\"Complying and receiving, heaven’s resting virtue unites,\"*\nAn unbounded kind.\n\nAt first, subtle yin takes charge;\nNext, mature yin reveals its pattern.\nFrom concealment to manifestation,\nVirtue unites with the Grand Real—\nThe noble one who employs it meets with unbroken fortune.\nThus the *Xiang* says: *\"The noble one’s virtue is thick, bearing all things,\"*\nAs in *\"Treading frost, firm ice approaches.\"*\n\nThe *qi* of Yellow Bell, gathered and concentrated,\nDelights the four limbs.\nWhen the four limbs are harmonious, its Dao is excellent—\nThus the *Xiang* says: *\"The earth’s Dao shines,\"* and *\"Six in the third: containing brilliance.\"*\nIt also says: *\"Yellow skirts—supreme fortune.\"*\n\nBefore heaven and after earth, receive it in the cauldron.\nWhen the two *qi* have merged, essence and *qi* overflow in abundance.\nYin reaches its extreme, and yang restrains it—\nThus the *Xiang* says: *\"Dragons battle in the wilds, their blood dark and yellow.\"*\n\n**Image.**\nThe *Xiang* says:\n\nUpholding the blessings of heaven, yin’s virtue is yang—\nTreading frost, firm ice approaches, from the subtle to the manifest.\nSix in the third contains brilliance, the thickness of earth’s virtue.\nDark and yellow blood—essence and *qi* of heaven and earth.\nThus the *Yi* says: *\"Dark and yellow—heaven and earth intermingled,\"* for heaven is dark and earth is yellow, and their Dao is luminous!\n\n**Formula:**\nYellow Matron has a daughter, her face like gold,\nYet without a worthy matchmaker, her heart finds no peace.\nVigilant in chastity, her resolve pure as ice and jade,\nLet Zhang San or Li Si dare not trespass.\n\nThe Heavenly King has a son, in his prime of years,\nFirst abiding in the central palace, enacting virtuous governance.\nFollowing the path, he strides forth from another gate,\nThen unties the golden ring to secure eternal stability.\nEternal stability demands a thousand days of effort—\nThe household’s radiance and prosperity shall emerge.\nChildren born surpass their parents,\nScarcely parted from the womb, they are already robed and combed.\n\n**Hexagrams *Dui* and *Gen*, Ninth Chapter**\n*Dui* is joy—firm within, yielding without, aligning with heaven in response.\n*\"O man, three days!\"*\nAt the waxing moon, yang flourishes while yin wanes.\nThus the practitioner of *qi* must, in due season, draw the Azure Dragon from the lofty palace,\nAbsorbing the number nine to augment yin’s insufficiency.\nWhen yin wanes in its position, summon yang to replenish it—\nIts hexagram is *Dui*, halting at the full moon.\nOne must cease replenishment then,\nFor over-replenishment disrupts the balance of yin and yang.\nAt sixteen, yin prevails and yang is deficient—\nThe practitioner must, in due season, draw the White Tiger from the *Kan* palace,\nAbsorbing the number seven to replenish yang’s *qi*.\nWhen yin prevails and yang is weak, its hexagram is *Gen*—\n*Gen* is stillness.\nStillness must be timely: when it is time to act, act; when it is time to halt, halt.\nThe noble one’s Dao encompasses waxing and waning, ebb and flow.\n\n*Gen* is the mountain, *Dui* is the marsh—\nThe images of mountain and marsh are here made clear.\nFirst *Dui*, then *Gen*, thus the hexagram *Sun* is obtained.\nThe meaning of *Sun* is vast indeed!\nThe Dao of *qi*-practice concludes here—\nThe work nears completion.\nDiminishing above to augment below,\nExtinguishing to preserve and engendering anew.\n\nFor all who absorb *qi*,\nThree days before and after each month, cease the circulation of *qi*—\nThis is called *\"extinction,\"* aligning with heaven’s timing.\nThis is the supreme Dao.\n\n**Formula:**\nWhen yang’s *qi* wanes, move the Azure Dragon—\nAt one and nine, the initial work bears fruit.\nWhen yang’s *qi* flourishes, augment the White Tiger—\nThe work of three and four follows measure.\nYin and yang decline—there are constant rules.\nThe sage who knows them replenishes accordingly.\nHow to replenish with the supreme Dao?\nThree days before and after—heed the prohibition.\nIf cultivation does not follow heaven’s timing,\nIt differs not from the common folk.\nArrange the sequence and adhere to the positions—\nA deviation by even a hair’s breadth spells great error.\nWithout knowing the positions, do not boast idly—\nA thousand efforts will but ruin the household.\n\n**Chapter on Transforming Images, Tenth**\nWhen the six lines move, the eight trigrams arise;\nWhen the eight trigrams surge, good and ill fortune hang in the balance.\nThe noble one observes the images of *qi* and examines their transformations—\nHow can he escape their sway?\n\nThus, fire first and water after yields *Jiji*;\nWater first and fire after yields *Weiji*;\n*Li* first and *Qian* after yields *Heavenly Fire*.\nThe image of *Heavenly Fire*—the *Yi* says *Tongren*,\nThe noble one who unites the aspirations of all under heaven.\n\nFirst *Xuanwu* and then the White Tiger yields *Earthly Water*.\nThe image of *Earthly Water*—the *Yi* says *Shi Zhen*.\nHe who attains *Shi Zhen* receives heaven’s favor.\nReversed, the images differ.\n\nPracticing *Kan* and *Li* concludes in the ninth month;\nContinuing *Kan* and *Li* follows likewise.\nAlternating *Kan* and *Li* in like manner,\nRiding the Dragon and Tiger in the third month—\nThen the transformation is complete!\n\n*Dongyuanzi’s Inner Alchemy Formula, Volume One—Concluded*\n*Dongyuanzi’s Inner Alchemy Formula, Volume Two*\n\n**Chapter Eleven: Water and Fire**\n\nWhen the Dragon and Tiger have formed their images and ninety days have passed, settle the spirit and calm the intent, silently guarding the empty chamber. Gaze fixedly and hold the body firm, driving away water and fire until the intent scatters and ceases.\n\nThe formula says:\nThe Golden Crow flies into the Moon Palace,\nYang flames blaze fiercely, the intent unwavering.\nLike a bounding hare entering the high palace,\nA single wheel of autumn water flows without cease.\nExchanging heads and altering faces, none know,\nAs creation’s transformations unfold in their time.\nMen transform into true women,\nDaughters become sons of men.\nWithin this, matters are often inverted—\nThe exchange of yin and yang is the Dao.\n\nThe Kan maiden dons yellow robes,\nThe Li lad reverses to black.\nMen refine and obtain yellow gold,\nTheir every movement clearly content.\nThe maiden’s heart, once frozen, now rejoices,\nSitting in the shade of crimson gauze without fanning.\nWho in the Li Palace remains unchanged?\nThe yang line stirs and casts itself into the Pearl Pavilion.\nThe form and image stand clearly as Qian—\nWho dares say yin and yang are mistaken?\n\nWho claims the Li Palace stores only water?\nWater’s nature flows in circles without fixed abode.\nNear yang, it grows hot; near water, cold—\nIts gentle, compliant nature is beyond compare.\nFrom this, heaven and earth birth the Yellow Sprout,\nThe Yellow Sprout itself blooms as golden blossoms.\nIf one can gather and refine it as a lifelong practice,\nKnow only fullness, loading the River Chariot.\nThe River Chariot returns to its master’s place,\nEven in famine, one suffers no hardship.\nOnly by giving birth to one’s own descendants,\nNever mistake others for father and mother.\n\n**Chapter Twelve: The Burning of Demons**\n\nDemons are the toxins gathered from the five grains. Every five days, they arise once from the Kan Palace, halting at Li, flaring forth in all directions to spread their five poisons.\n\nThe formula says:\nThe seasons’ nodes must always be avoided.\nFire naturally dwells in the depths of the sea,\nYang flames blazing, piercing water’s clarity—\nWithout movement, nothing great can be achieved.\nSuddenly surging forth from the Dark Spring,\nWhen the Dragon moves, the Tiger yields the path.\nRushing straight into the Palace of Great Yang,\nThe fiery Han gathers its flames in that moment.\nThe Li troops unite, raising spears and halberds,\nTen thousand oxen charge through the Cinnabar Field.\nThe Demon King surrenders, hands bound,\nIn an instant, the Three Corpses’ realm is burned away.\n\nWho sits alone within?\nSecretly sealing the Ghost Pass with a firm lock,\nBurning to the ends of heaven and earth—\nNo being can steal from me.\nAll things steal from man in countless ways,\nOthers encroach upon his fields.\nGuard and protect them, never let them be tilled—\nOnce broken, there is no means to sustain life.\n\nCarefully observe and await the moment without error.\nPlan three days or five in advance.\nIf they clearly intend to seize what is yours,\nStrike with fire and reduce them to hot ashes.\nIf three burnings fail to drive them away,\nSeek another path to soar aloft.\n\n**Chapter Thirteen: The Meeting**\n\nThe meeting (*jiaogou*) is an encounter, where the true Dragon and true Tiger meet in their time—hence *gou*.\n\nOn the day the Dragon and Tiger meet, one must avoid the Primordial Fire day and also the days of heaven and earth’s seasonal nodes.\n\nThe formula says:\nThe Azure Dragon lingers long in the Southern Marchmount,\nThe White Tiger hides deep in the Northern Sea.\nIf the Heavenly Talisman does not descend to urge them,\nThey rest, nestled in the cliffs of the hollow peaks.\nThe Lord Emperor issues a decree, extending a cinnabar summons—\nShaking off their scales and wings, they leave the ancient path.\nBreaking through the yin clouds, they release lightning,\nTheir full horns rise and fall, vying with the sun’s brilliance.\nFollowing heaven’s leftward turn, they rush to the Yang Valley,\nThe rosy clouds lock away the Yellow Gold Chamber.\nCommanding the White Tiger to emerge from the Dark Palace,\nA faint smile stirs a pure breeze.\n\nThe pure breeze circles to the right,\nEntering straight into the Fire City.\nWithin the city, affairs are unburdened—\nFirst, seek peace and stillness.\nThus it is done thrice,\nMoving without haste.\nIf Dragon and Tiger can be mastered,\nOne is already a divine immortal.\n\n**Chapter Fourteen: Primordial Fire**\n\nFire is not the fire of Li—it resides in the Kan gate. The kidneys are the root of the body’s unity; if one harms them, the body perishes—hence it is called *primordial*.\n\nKan is yang within and yin without—thus it is called *Primordial Fire*.\nTherefore, the sage accumulates this fire,\nWarming the chamber so the myriad spirits all settle in their abodes.\nIf the chamber does not glow, the myriad spirits depart.\nThose who can bear and move it—it is complete!\n\nThe formula says:\nThe four seasons begin with their flourishing days.\nAfter midnight, first arrange Li and Kan,\nOpening the great Fire City of the south—\nWithin the city, a spring sweet as honey.\nA cup, clear to the profound depths,\nNurtures the Golden Crow to avoid old age and death.\nWho would deliberately breach the sand dike,\nAllowing the current to flow freely so boats may cross?\n\nCollapsing in a rush toward the Primordial Head,\nStartling the Jade Hare into hasty flight.\nAvoiding the nets and snares, it bursts straight from the navel,\nPlunging into the Yin Pass, traversing nine li.\nMeeting the Muddy Pellet, it still does not stop,\nOnly upon seeing the Azure Flower does it turn back.\nSuddenly, warmth fills all under heaven—\nThe myriad demons flee to their origins.\n\nIn an instant, within the autumn down,\nEach returns according to its rank to the Crimson Palace.\nThe toad flies into the bright moon,\nWhile the Golden Crow ascends the white sun.\n\n**Chapter Fifteen: Bathing**\n\nThose who cultivate and refine must purify their bodies.\nTo purify the body, nothing surpasses bathing.\nBathing is not the fragrant waters of the mundane world!\nThe immortals’ song declares: without water, how can one be cleansed?\nThus, the water that is not water is true water.\n\nThe source of true water is exceedingly subtle.\nStored and used, it lasts through kalpas without end.\nHeld in an autumn hair’s tip, it cannot be filled;\nEncompassing heaven and earth, it cannot be contained.\nThus, those who use it—unless they are sages—will surely drown!\n\nThe formula says:\nThe Golden Crow flies swiftly before noon,\nArranging the Kan trigram as the uncle commands.\nThen, release the Northern Sea’s spring,\nForcing the Jade Toad to dwell in the dry place.\nWaves surge, pouring into the southern lands,\nEngulfing a thousand mountains and ten thousand peaks.\nA single wheel of autumn moon cascades through the sky,\nAssailing the flesh and bones with piercing cold.\n\nStirring the southern *bing ding* fire,\nIt dares not rest securely within the city.\nRiding the golden wheel, it rushes to the Moon Palace,\nComing to join the toad spider for a time.\n\nThe lingering waves surge forth from an autumn hair’s tip,\nVast and boundless, swelling into towering billows.\nThe Azure Dragon naturally guards the Primordial Yang Sea—\nWho dares cast a rod to hook the giant turtle?\n\nThe Perfected One bathes within,\nTaming his hair, his youthful face, his brows ever green.\nFor he has loved purity all his life,\nAnd finds no satisfaction in floating or sinking all day.\n\nThe Palace of Li is all water,\nWhile the Chamber of Kan is pure yang.\nHow wondrous the transformations of creation—\nHeaven and earth expand and contract!\n\nWho preserves this esoteric art?\nDragon and tiger do not long remain hidden.\nA single grain of medicine is all it takes—\nThe woman is inverted and becomes a man.\n\n**Chapter Sixteen: Mother and Child**\nThe child is not nurtured without the mother,\nThe mother is not preserved without the child.\nIf nurturing loses the Way, the mother is lost;\nIf preserving loses stillness, the child is lost.\nShould mother and child gather and never scatter,\nThe Dao is perfected!\n\nThe formula says:\nThe three hun and seven po\nAll reside within the human body.\nOnly spirit and intent,\nThese two must mutually communicate.\nPreserve them, lest they scatter—\nThis is the beginning and end of the Great Dao.\nIf mother and child unite as one,\nHow could the serpent fail to become a dragon?\n\n**Chapter Seventeen: Embracing the Origin and Guarding the One**\nSince ancient times, all sages and worthies who attained the Dao\nEmerged from this path.\nThose who attained the Dao yet did not fully master it\nAll longed to cast off the mortal form—this is what they meant.\nEven today’s Buddhist monks,\nWho enter samadhi and sit in transformation,\nHave all understood the Dao and grasped its essence—\nThis is called \"yin liberation,\" akin to the Daoist \"corpse liberation.\"\n\nTo cultivate this secret Dao, there is a crucial key,\nAnd its formula lies in the mouth.\n\nThe formula says:\nEmbrace the Origin without deviation, and the Dao is complete;\nEmbrace the Origin and deviate, and immortality is assured.\nGuard the One without losing it, and all matters are fulfilled—\nMy life is in my hands, not in Heaven’s.\n\nWithin the Cinnabar Field, there is a thing fiery as flame,\nIts flavor bland yet sweet as honey.\nSimply abide in profound stillness without wavering,\nAnd day by day, your essence will grow more radiant.\nWhen the time comes, shift to the Crimson Palace,\nWhere carriages and horses naturally come and go.\nAt times, the Valley Spirit draws near,\nEntering and exiting through the Mysterious Gate of heaven and earth.\n\nAt first, one step, then two,\nTen steps, a hundred, swirling like the wind.\nOne *li*, two *li*—yet you do not walk to reach them,\nA hundred *li*, a thousand—gone without a trace.\nWhen exiting, the gates and barriers are secured,\nLayer upon layer of hexagrams are recorded without carelessness.\nIf thieves harbor ill intent to plunder,\nYou will arrive within a thousand *li* in an instant.\n\nDo not take worldly Daoists lightly—\nDo not mistake your own treasure for another’s.\nIf you can fully repair your palaces and dwellings,\nYou will enter and exit freely within them.\n\n**Chapter Eighteen: Destiny and Calculation**\nThose who awaken to the Dao and cultivate late,\nIf their cultivation is incomplete and their destined time has not arrived,\nCannot escape death to ascend as flying immortals.\nYet if they know their destined time has come and can evade it,\nThey become earthbound immortals—\nOnly then can they cultivate the Dao of ascending to the heavens.\n\nThe formula says:\nThe lifespans of mortals vary in length,\nBut the great destiny draws near day and night.\nIf the spirit’s light departs from the gate of qi,\nThe fire of the three burnings will not turn back.\n\nKnowing the destined time has come, one must flee—\nIn profound stillness, the Mysterious Pass is firmly secured.\nBefore your eyes, many claim to be immortals,\nSome trailing vermilion sashes and wearing crimson pendants,\nHolding the *Taishang Xuanyuan* talismans,\nHumbly entreating you to join them.\nThey speak of ascending to the heavens in various ways,\nInviting you to rise with them to the Ninth Heaven.\n\nIf they speak thus, do not listen;\nIf they wish to accompany you, be cautious and do not contend.\nSimply know to close yourself within the vermilion gate,\nAnd declare to the Mysterious Palace: \"I seek great stillness.\"\nLet your spirit wander a thousand *li* beyond mountains and passes,\nWaiting for them to depart before returning to observe.\nAfter the spirit departs, a divine breath remains—\nThis breath was bestowed by the immortal master’s golden mouth.\n\n**Chapter Nineteen: The Spirit Light**\nModern Daoists adopt vulgar notions,\nClaiming that to perceive the spirit light,\nOne must gouge the eyes with one’s hands—\nThis is all incorrect!\n\nThe Dao arises naturally;\nWhy forcefully seek it?\nWhat is obtained through force\nCannot be called the Dao or virtue.\n\nSimply sit facing east before the fifth watch’s rooster crows,\nClose your eyes, still your thoughts, and abide in the realm of no-light.\nWait for a moment, and the spirit light will arrive of its own accord.\nIt may resemble the images of the sun and moon,\nOr the light of a lamp or candle,\nSpiraling up and down, vanishing and reappearing.\nWait patiently, and with closed eyes, it will come.\nIf after three days it does not arrive,\nYour destined time has come—\nHasten to evade it!\n\nThe formula says:\nSimply know to close your eyes and dwell in the Mysterious Chamber;\nAt midnight or the hour of *zi*, it will often emerge.\nSometimes like lightning, it suddenly appears,\nChasing the flowing waves, floating and sinking.\nSometimes like the sun and moon, it blazes brilliantly,\nOr like a divine pearl, it dazzles with fivefold light.\nIlluminating all things clearly,\nHalf white, half red, it fills the Grotto Chamber.\n\nIf it does not come and your destined time arrives,\nSwiftly lock your gates and retreat.\nFlee to distant mountains and old hermitages,\nDo not follow Zhang San or Li Si.\nThe magic mirror must be frequently consulted—\nDiscern the immortal’s threads with care.\nLeft-spinning, right-turning, growing familiar with its comings and goings,\nYou will witness the lofty forest where the cicada sheds its husk.\n\nThese words are not exhaustive, yet mortals remain deluded.\nTo speak fully would risk leaking heavenly secrets.\nDo not say cultivation has no gate—\nIt is only that immortals have their own paths and forks.\n\n**Chapter Twenty: The Essential Summary**\nWhen cultivating the hexagrams and their lines,\nWind and rain do not act.\nAfter wind and rain pass, then enact the hexagrams Kan and Li.\nDo not divine on the dark moon;\nComplete the twelve lines,\nAnd arrange the thirty-six.\n\nKan and Li continue for nine months with water and fire,\nThen nine months combining Kan and Li,\nForming the *jiji* and *weiji* hexagrams.\nAnother nine months rectify Qian and Kun,\nThree months for the Dao’s transformation—\nSeclude yourself in the Mysterious Chamber,\nAnd in a hundred days, it is accomplished.\nIn total, a thousand days are required!\n\nFor those whose vitality is depleted by sensual indulgence,\nEven a thousand days cannot restore it—\nOne must practice for a long, long time\nTo replenish the Yang Barrier.\n\nKan is one yang and two yin,\nFire is born from water—\nThis is the natural Dao.\nThose who indulge in desires\nExhaust their single yang.\nWhen the single yang’s power is spent,\nA person approaches death.\nThus, one must supplement it with the qi of original harmony!\n\nWhen supplementation is complete, a person is reborn!\n\nNow, heaven is high and earth is low—thus the Dao of yin and yang is arrayed. In every movement and stillness, the positions of firmness and softness appear. Like attracts like, kindred spirits gather, and from this gathering comes division—thus the principles of fortune and misfortune are made manifest.\n\nHeaven displays its images in the sun, moon, and stars; earth establishes its forms in mountains, marshes, grasses, and trees. The six lines intermingle and transform, yin and yang unite—wind and rain bring moisture, thunder and lightning strike, autumn departs and spring arrives, cold retreats and heat advances. Above and below communicate, the sun waxes and the moon wanes.\n\nDragons rise and clouds follow; tigers stir and wind arises. The Dao of dragon and tiger may be drawn near but not kept distant, may be subdued but not commanded. When they rage, they harm people; when they are intimate, they endure. Enduring, they grow great; growing great, they endure long. The virtue of the worthy is thus complete, their work perfected!\n\nThe sages established the *Yi*’s images to discern survival and decay—this is the foundation. *Yi* means change: only when the Dao reaches its utmost does transformation occur. Thus, the *Yi*’s images are likenesses, and likenesses are visions. Through vision, one perceives them, communing with spirit and illumination—where spirit and illumination abide, the Dao of long life is complete! Therefore, it is called *xiang* (image).\n\nThus, the noble person knows when to advance and when to retreat, when to be soft and when to be firm. They turn night into day, transform yin into yang, dwell in chaos yet remain tranquil, reside in peace yet stay vigilant. They immerse themselves in its flavors, delight in its wonders. In movement, they observe its divine radiance; in stillness, they examine its soul and spirit. Though a thousand miles distant, they grasp its patterns. Without a thousand days of cultivation, its achievement is not complete. Therefore, heaven must aid them—fortune will be without fail, for this is the Dao that encompasses heaven and earth.\n\nGazing upward, they observe the patterns of heaven; looking downward, they examine the principles of earth—thus they know the causes of the hidden and the manifest. Tracing beginnings to return to endings, they understand the discourse on life and death. The wandering soul becomes spirit; original *qi* becomes matter. Spirit and matter must be complete, with nothing leaking—leakage leads to the collapse of the vessel. Those who do not know this see the wandering soul as monstrous, speaking of ghosts. The forms of ghosts and spirits reveal gains and losses: losing, one becomes a ghost; gaining, one becomes a spirit. They follow the essence of the sun and moon’s movement, unite with the nature of dragon and tiger, model the completeness of heaven and earth, and connect the hidden and the manifest of day and night.\n\nSpirit has no fixed direction yet comes from all directions—thus it has direction. The *Yi* has no form yet arises from form—thus it has form. In every movement and stillness, the Dao of yin and yang—who can fathom it? Life is death, and death is life; yin and yang transform, and those who continue them flourish.\n\nThe Dao of sages and worthies is used daily by the people, yet they do not know it. Thus, the sage relies on the Dao to reveal it—this is called *ren* (benevolence). The wise illuminate it through patterns—this is called *zhi* (wisdom). They conceal its essence to await the benevolent; the noble person’s abundant virtue is thus made manifest. Therefore, the *Yi* says: \"Daily renewal is called abundant virtue,\" and \"Production and reproduction is called the *Yi*.\"\n\nAbiding in their chamber, they know its numbers; by its light, they examine its signs. Above, they emulate Qian; below, they model Kun. The Dao of Qian and Kun thus enables creation and transformation. The *Yi* says: \"To exhaust the numbers and know the future is called divination; to adapt and connect is called affairs; the unfathomable of yin and yang is called spirit.\"\n\nMovement and stillness have their proper times; gain and loss follow constant principles. Gaining this, one loses that; gaining that, one loses this. One day and one night, one cold and one heat—day is bright and night is dark, yet sometimes reversed. Cold and heat come and go, sometimes deviating. Thus, it is called *zhan* (divination), *xiang* (image), *yi* (change). Those who excel at thoroughness are called *dong* (penetrating); those who excel at completion are called *xuan* (profound).\n\n**Expansive Mystery, Chapter Twenty-One**\n*Expansive Mystery* expands the meaning of *Dongxuan* (Penetrating Mystery). Heaven and earth are formless yet give birth to the formed; male and female have no image yet nurture the imaged. Relying on the imageless, form arises; relying on form, names are established. Thus, to forcefully create is called heaven and earth, male and female, life and death.\n\nLife arises from nothing to become something; death arises from something to become nothing. To gain from nothing is the Dao; to lose from something is folly. The foolish do not gain through the Dao. To know being as being is being; life is when original *qi* has not yet dispersed and can be taught. When it scatters, yin forms, and yin’s beginning is born—fully storing the knowledge that nothing is the root of being.\n\nThus, at a male’s birth, *qi* is concentrated, solidifying his form. The nine orifices form, and when complete, he is nurtured. Yang *qi* is pure and substantial—thus his image corresponds to Qian. Qian is strength; desires have not yet arisen. He drinks blood, and likes and dislikes touch him—anger arises cautiously, like the profit of merchants, for his *qi* is purely yang.\n\nAt first, a person’s gates are firmly closed, guarding the One and purifying their spirit. By ten years of age, they can stand upon what they see. The Dao of civil and martial arts is extended to grasp its essence—his hexagram is *Gou* (Encounter). *Gou* means meeting, the beginning of the north, where strength is not yet mature. The strong boar has five yangs, and when it encounters, it stirs the body. Crowned and robed, it is influenced by *Gu* (Decay), its ambition confined to the chamber. Two yangs both retreat—thus the *Yi* says: \"The lord does not know that nothingness is the one yang beginning to descend.\" The four *xi* (joyful states) are greedy and lustful desires have not yet arisen. The six lines do not stir—playing with them is amusement, restrained by ritual and music. The mouth savors flavors, and desires arise accordingly. Thus, the first nine: one yang is initially defeated, its power beginning to return to its position—this is *Hai* (the twelfth earthly branch).\n\nThe *Yi*’s *Yingzhu* (Lean Boar) encounters the strong boar: the lean boar is one yin, and the Dao of lust is about to sprout. \"Heaven below has a mountain\"—*Dun* (Retreat) will diminish its strength. Should it join? A person halts here, and the many boars encounter harm.\n\nUpon reaching the capping ceremony and marriage, they are employed—thus their hexagram is *Dun* (Retreat). *Dun* means to avoid and withdraw, for yin *qi* is growing while yang has not yet departed—this is to distance oneself from petty people.\n\nThe petty person is the woman; the noble person knows the Dao and can secure their person. Desire can destroy one’s person—when yin is in full ascendancy, one must guard against indulgence in pleasure to reinforce the *Dun* (Retreat), thereby strengthening yang’s resolve.\n\nBy thirty, one’s blood and *qi* are robust, and the affairs of family and household are established. Descendants follow in succession. If one serves the state with loyalty, official profit will flow unceasingly; if one repays enmity with solemnity, the courage of resolute decisiveness will not be restrained. Coveting profit for the household, one desires that a thousand generations will not diminish it; seeking rank through poisonous office, one desires that nine promotions will not suffice. Yet they do not know that lust is the axe that hews at life, and rich flavors are the medicine that rots the intestines. Thus, when the three yang lines show deficiency, the hexagram becomes *Pi* (Stagnation).\n\n\"Heaven and Earth are *Pi* (Stagnated)\": *Pi* is not strength. The firm has already departed by half, and the yielding occupies its fullness. Therefore, in the prime of life, though one’s complexion may flourish and one’s *qi* may be fierce, if one follows desire without restraint, the virtue of firmness and strength will daily diminish. Outwardly strong but inwardly weak, the *Yi* thus calls this \"outwardly a noble person, inwardly a petty person.\" If one halts at this point and does not cultivate and refine, daily depletion will occur. Thus, the *Yi* speaks of \"the great departing and the small arriving\"—the Dao of the petty person lengthens while the Dao of the noble person wanes.\n\nThe noble person, knowing otherwise, understands that the great departs and the small arrives. They must moderate diet, be cautious of lust, secure the root and stem, embrace the primordial, and guard the One to dissolve yin. Thus, the *Yi* says, \"The noble person, through frugal virtue, avoids calamity\"—this is the meaning.\n\nBy forty, descendants stand in abundance, the path of lust has passed its peak, and teeth and hair approach twilight. Thus, the four yang lines show deficiency, and the hexagram becomes *Guan* (Contemplation). \"Wind moving over the earth\" is *Guan*. The nine in the fifth place is the ruler, and the ruler is the heart of the people. At forty, if lust is not yet sated, one can still repent—repenting the failures of the body. Thus, by observing the form with the heart, one is cautious in the bedchamber, sincere in curbing desire, and employs this to replenish the *qi* of primordial harmony. The noble person halts here and cultivates; the petty person does the opposite and destroys. One who is not cautious at forty will thereafter be abandoned. Thus, the *Yi* says, \"The six in the third place contemplates the advance and retreat of my life\"—the Dao is clear.\n\nAt this stage, through diligence in cultivation, using yang to supplement yin, one can still avoid loss. Thus, the *Yi* says, \"The nine in the fifth place contemplates my life; the noble person is without blame.\" By fifty, if one does not uphold this Dao, yang virtue falls into disorder, and yin ghosts daily grow stronger. Thus, the nine in the fifth place shows deficiency, and the hexagram becomes *Bo* (Splitting Apart).\n\n\"A mountain above the earth\" is *Bo*. *Bo* means to fall, like the grasses and trees falling in autumn. The initial six splits the foot—splitting begins from the subtle. The foot is what a person treads upon; without feet, one cannot go anywhere. Thus, the *Yi* says, \"*Bo* splits the bed’s foot.\" The bed is where a person rests; if it is split, it is not beneficial. What brings rest is the person’s body. The body’s having form is like the bed’s having a place to stop. If the bed is ruined, the form cannot rest; if the form withers, the spirit cannot dwell. If the spirit departs, the form is surely lost. Great is the meaning of *Bo*! The firm changes into the yielding, yang into yin, the upright into the ominous. Yin *qi* thus flourishes, and the Dao of the petty person lengthens. Thus, the *Yi* says, \"It is not beneficial to have somewhere to go.\"\n\nIf one does not awaken at this point, the affairs of profit from carriages and huts become manifest. By sixty, if one does not supplement the Dao, the walls show collapse, the house shows ruin, and the person shows demise.\n\nWhen yin flourishes and yang perishes, the *po* laughs while the *hun* grieves. Proceeding in compliance, the exalted dragon suffers loss—its hexagram becomes *Kun*. *Kun* is compliance; its name is Earth, its form is soil, its nature is yielding, and its affairs are abundance.\n\nWhen a person reaches sixty and fails to cultivate and refine, pure yin fully arises: the liver’s Dao declines, the lung’s Dao withers, the heart’s Dao grows dull, the spleen’s Dao decays, the gallbladder’s Dao weakens, and the kidney’s essence is exhausted. Once these six conditions are complete, death ensues, and one becomes a ghost—hence the saying, \"Ghost means return.\" The *hun* returns to heaven, the *po* returns to earth. Thus, following *Qian* is life, following *Kun* is death; the Dao of life and death is revealed. Those who know and refine reverse the *Kun* Dao!\n\nTherefore, the *Yi* calls *Qian* and *Kun* the gateways of the *Yi*. The *Yi* is the book through which the sage transforms life and death. If one understands its Dao at sixty, one still cultivates and refines! By refining yang to dissolve yin and replenishing the *Initial Nine*, the hexagram becomes *Fu*. Thunder beneath the earth is *Fu*: firmness moves, and yang returns within—its root is revealed! The root is the heart of heaven and earth.\n\nFor all people, awakening at sixty to cultivate the supreme Dao is to restore their origin. One must revolve the *Kan* and *Li* on the solstice, employing them in due season, without losing their measure. Perceiving what is seen, one silently guards the self, abiding in great stillness, following its governance to return to the root. Thus, the *Yi* says, \"*Fu* reveals the heart of heaven and earth.\" It also states: \"The former kings closed the passes on the solstice, halting merchants and travelers.\" The *Yi* speaks of profound tranquility—great stillness—by which the former kings modeled themselves on heaven and earth.\n\nThe *Image* says: \"Returning from not far away is for cultivating the self.\" Diligently and tirelessly, morning and evening, one strikes to secure great stillness, replenishing the *Sixth Two* to complete true yang. Then the hexagram becomes *Lin*. Marsh above earth is *Lin*: yang *qi* regains its abundance, while yin *qi*, though lush, daily diminishes. Thus, the noble person’s Dao lengthens, and the petty person’s Dao wanes. Persisting without rest, even in the yin months, one does not lose principle. As firm *qi* encroaches and daily spreads, there is no misfortune. This is called restoring the *Qian* hexagram—its affairs are peace!\n\nThus, the *Yi* says: \"By the eighth month, there is misfortune.\" The eighth month is the height of yin’s multitude; failing to refine yang to dissolve it ultimately brings misfortune. Great is the meaning of *Lin*! It restores heaven’s number. Thus, the *Yi* says: \"Firmness centered and responsive is the way of great success and correctness.\"\n\nIf one can recognize misfortune and uphold firmness, cultivating the three yangs to restore them, the hexagram becomes *Tai*. Earth above heaven is *Tai*: the noble person accumulates virtue and piles up deeds, refining yang to dissolve yin, daily sprouting progress without cease. The nine orifices flow smoothly, the four limbs are full and substantial, movement and rest are harmonious, and the myriad spirits are at peace. Yin *qi* daily diminishes, yang *qi* daily grows. Within, one is firm and strong, walking upright; without, one is yielding and harmonious. Proceeding thus brings universal benefit. Therefore, the *Yi* says: \"Heaven and earth unite, and the myriad things are at peace. The noble person’s Dao lengthens, and the petty person’s Dao wanes.\" This is its meaning.\n\nPersisting without cease, daily advancing the Dao, dissolving the *Sixth Four*, the hexagram becomes *Dazhuang*. Thunder above heaven is *Dazhuang*: strength follows heaven’s Dao, the shock of thunder arouses the myriad things, and none fail to stir. The noble person observes *Qian*’s Dao, exhausts *Qian*’s work, and acts accordingly! Abiding in great stillness, no demons arise, no perverse affairs stir. Gazing at *qi* with the heart, all distracting thoughts are severed. Filth is washed with true water, illness is cauterized with primordial fire. The last remnants of yin are incinerated by yang in a single day—at this, the petty person’s Dao perishes!\n\nFirm correctness arises within and manifests without. Though outwardly yielding and compliant, how can it be restrained by the flourishing of yang? Yet the Three Corpses plot rebellion, and the Seven *Po* await departure—only reverence for firm strength prevents them from boasting of their expansion. With yang’s virtue reigning supreme, it is called *Great* and *Strong*. Thus, the *Yi* says: \"Upright and great—thus the sentiments of heaven and earth are revealed!\"\n\nCultivating without cease, transforming at the *Ninth Five*, the hexagram becomes *Guai*. Marsh above heaven is *Guai*: the noble person cultivates the self and guards conduct, vigilant day and night without slackening. One examines penal cases, pities widows and orphans, rescues the drowning, supports the fallen, quells jealousy and expansion, roams the spirit and moves *qi*, embraces the origin and guards the One, refines the great yang to dissolve yin *qi*. When the petty person’s Dao wanes, one attains *Guai*—*Guai* means decision. At this point, there is resolution in the Dao of liberation.\n\nIn general, the noble person’s life begins at the *mao* horn—this is called complete yang. Halting at ten years, lacking the *Initial Nine*, the hexagram becomes *Shou*. If at the *mao* year one does not yet know cultivation and refinement, by twenty the hexagram becomes *Dun*. If at twenty one can cultivate and refine, nurturing and preserving the *Initial Nine*, the hexagram becomes *Tongren*. Heaven and fire are *Tongren*. By thirty, if one can fully preserve the true Dao and restore the *Initial Nine*, the hexagram becomes *Wuwang*. Thunder moves beneath heaven—*Wuwang*. By forty, if one can examine misfortune, guard the One, and remain silent without seeking, restoring the *Initial Nine*, the hexagram becomes *Yi*. Thunder is *Yi*. By fifty, cultivating the supreme Dao and replenishing the *Initial Nine*, the hexagram becomes *Yi*. Mountain and thunder are *Yi*. At twenty, replenishing *qi* and reaching the *Ninth Two*, the hexagram becomes *Lü*. Heaven above marsh is *Lü*. By forty, restoring the *Ninth Two*, the hexagram becomes *Zhongfu*. Wind above marsh is *Zhongfu*. At forty, tirelessly practicing *qi* to refine yin and replenish the three yangs, the hexagram becomes *Xiaoxu*. Wind moves above heaven—*Xiaoxu*. By fifty, understanding the Dao and practicing essence without slack, replenishing yang *qi* to the *Ninth Two*, the hexagram becomes *Sun*.\n\nMountain below marsh is called *Sun*. Yang *qi* ascends to dissolve yin, thus the *Book of Changes* speaks of \"diminishing above to augment below.\" At fifty, knowing the Dao of *Sun*, if one can diminish the *Sixth Three* and transform it into the *Ninth Three*, the hexagram becomes *Daxu*. Heaven within mountain is *Daxu*. By sixty, free from delusion and practicing the Dao to the utmost, diminishing above and strengthening below with *qi*, refining the *Sixth Four* to achieve pure yang, the hexagram becomes *Dayou*. Fire above heaven is *Dayou*. If one draws in the four images of *Qian*, *Kun*, *Kan*, and *Li*, yet miscalculates the rhythm of extraction and circulation, the eight trigrams will dissolve and transform anew—thus completing the sixty-four hexagrams. The sages expounded the *Changes*, and the Dao of transformation and change was fully revealed.\n\nWhen yang flourishes and yin recedes, immortals become visible. When yin flourishes and yang recedes, the hun and po may depart; if the hun and po depart, one dies prematurely, but if immortals appear, the body undergoes liberation. The Dao reaches its utmost! Though one may travel a thousand *li*, one need only turn inward and smile. Therefore, the noble person observes the Dao of high heaven, grasps it, and practices it—purifying the five flavors to cultivate the body, nurturing the five constants to refine conduct. To be plundered by thieves is the way of human life, but the sage reverses the plunder.\n\nHeaven and earth are vast, the sun and moon luminous; day and night alternate, the positions of high and low are fixed, the gates of ghosts are sealed, the horse of the mind does not gallop—all rests in one’s hands. When the mechanisms are secure and stillness is firmly established, in all comings and goings, one attains the freedom of myriad transformations, for the power of change lies within the body.\n\nThe greatest in heaven is humanity; the greatest in humanity is *ji*. Following heaven to circulate *qi*, adhering to the principle of the times to subdue *ji*—if *ji* does not leak, primordial yang is firmly consolidated. Refining yin into yang, the Dao of *Qian* becomes ever more manifest. Once the position of *Qian* is established, the foundation of *Kun* is firmly set.\n\nWhen yang flourishes and yin dissipates, yin *qi* scatters—thus heaven arises to slay the heart, and dragons and serpents collapse. The noble person casts out the Three Corpses, binds the demon hordes, drives away the Azure Dragon, expels the White Tiger, overturns and inverts them. Day by day, month by month, one departs from pure yin and enters pure yang of *Kan*—thus heaven and earth are reversed! When the positions of *Qian* and *Kun* are fixed, human affairs are firmly enduring. External evils cannot enter, and inner yang flourishes. Guarding the One without loss, embracing the primordial to fulfill one’s aspiration, one awaits the cicada’s molting—leaving the decayed form behind. Thus, the Dao of heaven and humanity unite, the foundation is discarded, and the spirit emerges.\n\nHeaven and earth give birth to humanity, with fixed lengths of life; whether clever or clumsy in nature, one may freely roam and shift the spirit, for it can be concealed or hidden. Ears that hear, eyes that see, noses that smell, mouths that taste, hearts that toil in labor and desire—all these diminish longevity. The noble person can close the eyes within, becoming blind to colors; block the ears without, accumulating silence; seal the nose from things, mastering scents; shut the mouth from delicacies, cutting off flavors; refrain from laboring the heart, preserving longevity; and not coveting desires, securing the foundation.\n\nThus, when the eyes behold beauty, the heart grows fond; fondness leads to movement, making it hard to forget. Therefore, seal the nine orifices so that evil cannot enter—this lies in blinding the eyes and stilling the heart, being cautious of the three desires. In movement there is loss; in stillness there is gain—this is the way.\n\nThe heart can store, yet the heart can also ruin a person. The heart is the sovereign ruler, governing the myriad spirits. When the heart is in chaos, excessive desires arise, and the myriad spirits scatter—death approaches! Thus, wood gives birth to fire and burns itself; a state gives rise to treachery and rebels against itself. If a man knows that the eyes must not gaze upon beauty, the heart must not be disordered by desire, and the mouth must not crave flavors, and thus cultivates and refines to preserve the body, he is a sage.\n\nHeaven and earth employ benevolence to give life, but humanity employs the lack of benevolence to kill—this is the constant way of human life. In the seasons of *Qian* and *Kun*, the hundred grains and grasses steal the time to emerge; humanity steals the autumn to consume the flavors of the hundred grains and grasses. The poisons of the hundred grains and grasses steal human life. The noble person stabilizes the Three Powers, preventing theft from arising. Only then, with the water of *Kan* and the fire of *Li*, does one cook and consume at the proper time—thus the hundred bones regulate themselves. Therefore, the former kings, on the solstices, closed the passes so that merchants and travelers did not move—this is the principle.\n\nPeople recognize the image of the spirit as the spirit, yet do not know that the spirit dwelling within the body is the true spirit. The spirit within the human body, when refined, becomes an immortal—thus it is called spirit. The Dao of liberation from the corpse follows the movement of the sun and moon: left rotation and right setting, right rotation and left setting—its number is three.\n\nStabilizing the body, cultivating the spirit, abiding in the chamber, cutting off thoughts—only then does minor stillness begin. With a hundred days of effort, progress becomes evident. Next, attaining great stillness, a thousand days of practice accumulate. When effort is evident and practice accumulates, the radiance of the spirit emerges—thus the numbers of the sun and moon. Whether great or small, the effort is the same. The numinous is born of this, and the sage’s work is established by this. The noble person, in poverty, holds fast to the Dao and does not leak *ji*; the petty person does the opposite.\n\nCalming the child, quieting the mother, embracing the primordial and guarding the One—one’s aspiration remains undisturbed, and evil naturally retreats. Refining hardness to dissolve softness, accumulating effort without weariness—like the deaf who see, the blind who hear, demonstrating singular focus. Cutting off profit from the One is the way. Cutting off profit from the One, effort increases tenfold. The sun and moon rise and set, cycling three times. When the Dao is accomplished in the One, the filthy form will fall away, and the luminous spirit will emerge—thus effort increases a hundredfold!\n\nWhat the heart desires is what it discards, thus it is born from things. What humanity loses is one’s own gain. Gaining and being able to guard without loss through the Dao—control lies in the heart, and circulation returns to the primordial. Thus, the bird in *qi* dwells in the dark chamber, silently guarding the Dao, profoundly without care—it may come and go. The person decays, but the spirit stands.\n\nThus, life is death, and death is life. In all circumstances, movement shifts the lines, and they may gather or disperse. The sun and moon have their measures; hardness and softness refine each other. Where there is merit, there is duration; where there is duration, there is flourishing—thus the foundation of the noble person is firmly established!\n\nWith each advance and retreat, the Dao of transformation is made clear. Through hardness dissolving softness, the principle of *Qian* and *Kun* is revealed. Therefore, the wise person abides in silence, finding peace in their dwelling, seeking the perfection of cultivation and refinement.\n\nA bright mirror stands beside them, radiating its light—then the true forms of ghosts and spirits become visible! The common people use it daily yet do not know it. They apply it to things and restrain it in *qi*: in movement, it is hard; in stillness, it is soft. Observe its form and appearance, await its advance and retreat—then the way of fortune and misfortune is decided!\n\nThus, one who cultivates and refines knowledge is called a sage—is this not its meaning?\n\n*The Inner Alchemy Formula of Master Dongyuan, Lower Scroll, Concluded.*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞元子内丹诀 经名：洞元子内丹诀。 二卷，疑出於宋代。 底本出处：《正统道藏》太玄部。 洞元子内丹诀序 上古道士得道者百万，其人着书诱善者，万一分矣！ 然者辞多指示，则弗露真源，文旨大纲，悉惑於众。 或使人考厥外典，用合玄元，比象既繁，阐闽莫履，非达道之士，无能晓诸。 然圣道不书於简册，而修炼自有於涂程，或成之於十月，或就之於千日，少有差误，终坠下鬼。 故画八卦者，必列乎象，辩吉凶者，必重其爻，日月往还，变在其中矣！ 爻象成乎内，则变化见乎外，生乎万物，天地之大德也。 圣人则之，必宝乎位也。 宝位者，圣人之身，匪名位欤位存则仁者处之，位丧则仁者去之。 仁者苟性，其能修炼乎？ 知之修炼，其匪圣人乎！ 乌兔奔驰，以成其明，寒暑交代，以成其岁，龙垫而求化，蟆屈而求进，精想在神，终获其用。 寂然能守天下之事，殊涂而同归也。 故仁者安其身，默居以俟其用，崇乎德业，以达其身。 近代迷谬之徒，才达小乘，便云得道，惟求想脱，称是神仙，殊不知想脱之涂，悉为神乱，未若神仙，炼神为仙也。 惟人有神，常能自见，虽目常睹，亦不自识，故圣人谓日用而不知也。 设使有士，临鉴自顾鉴中之像，其匪神乎1．容质美陋，必形於照中，照中之姿，曷异於临照之士？ 故照中之像，其日神乎！ 人见其神，不期修炼，其为鬼乎！ 是以圣人谓人知其神而神，不知不神而神，此之谓也。 夫以修炼以神为仙者，必先炼厥形，厥形若全，神自全也。 或日：何谓形全则神全？ 对日：谓有士瞽其一目，临照自观照中像，亦如之，未有瞽士临照之中，像弗瞽也； 全士临照，中之像瞽焉！ 所以必先全形也。 又问日：神居於人身乎？ 日：居之。 何以对照而出也？ 答日：对照弗出者，是人之盲，神出而不见也。 且人身神，其如宅乎！ 神居人形，又若人之舍於室尔。 苟出入无滞，关键牢密，亡差误也。 故室坏则人去，形败则神逝，此之谓要道也。 凡修炼者必先宽仁厚德，多义足信，扬慈丰惠，恶贪远害，嫉拓之行弗行焉，可谓明也已矣！ 娇佞之言弗出焉，可谓直也已矣！ 见溺必拯，见焚必救，见困必扶，见幼必怀，见耆必安，见危必济，见难必拔，临刑必减，临怒而息，临事而思，临民而惠，见恶如探汤，见善如不及，阴功久积，阳德自繁，无加嫉拓以自坏也，无恃淫欲以自伐也，精存则神固，精竭则神去，故圣人言，先精而后神也，先神而后仙也。 近代学徒，不知圣道，咸行戒洁戒行，专一林泉，蛎食庞衣，不亲房室，精无所漏，神亦自全，尚可延龄，以居浊世。 及当数尽，积薪焚烧，所存无漏之精，尽为戒珠之异，烈火不能为烬，水流不能为也。 故经谓执着之者，不明道德，此之谓矣！ 今之人才及断谷安定之门，自阶神仙，感执着之，吁！ 诚实可哀哉！ .夫炼黑不由八卦者，悉虚疲役耳。 今备述神仙修养之叔，咸为篇次，欲诸学者，不枉其志，即不必以，《周易参同契》《太易至图》而合之，理实焕然。 细述厥旨，凡诸道士，审而味之矣！ 洞元子内丹诀卷上 玄元篇第一 夫炼丹之士，非炼凡铅汞也，所炼者，真铅真汞也。 盖圣人取象而比之，以式於众。 云执铅投汞，火候以时，采诸花耳，人鉴恨也。",
      "translated_text": "**The Internal Alchemy Formula of Master Dongyuan**\n\n**Title:** *The Internal Alchemy Formula of Master Dongyuan*\nTwo fascicles, likely composed during the Song dynasty.\nSource text: *Daoist Canon of the Zhengtong Era*, *Tai Xuan* Section.\n\n**Preface to *The Internal Alchemy Formula of Master Dongyuan***\n\nIn high antiquity, a million Daoist adepts attained the Dao, yet those who composed texts to guide the virtuous were but one in ten thousand! Yet when their words abound in allusions, the true source remains concealed, and the essential purport of their writings bewilders the multitude. Some compel readers to consult external classics, seeking correspondence with the primordial mystery. The analogies grow ever more intricate, the gates of elucidation ever more obscured—none but those who have penetrated the Dao can fathom them.\n\nThe sagely Dao is not inscribed upon bamboo slips; the path of cultivation unfolds along its own course. Some achieve it in ten months, others in a thousand days. The slightest misstep, and one plummets to become a ghost below. Thus, the drawer of the Eight Trigrams must array their images; the diviner of fortune must weigh their lines. The cycles of sun and moon transpire within them, and transformation resides therein.\n\nWhen lines and images take form within, change manifests without—such is the great virtue of Heaven and Earth that gives rise to the ten thousand things. The sage models themselves upon this, treasuring their position. To treasure one’s position is to treasure the sage’s body—how could it refer to mere rank? When position endures, the humane abide within it; when position is lost, the humane depart. If the humane are but of innate nature, how can they cultivate? Those who know and cultivate—are they not sages?\n\nThe hare and crow race to perfect their brightness; cold and heat alternate to complete the year. The dragon crouches to seek transformation; the toad bends to advance. Essence and thought reside in spirit, and in the end, their function is attained. In stillness, one may guard the affairs of the world—divergent paths converge in the same return.\n\nThus, the humane secure their bodies, dwelling in silence to await their use. They exalt virtue and achievement to fulfill their being. In recent times, deluded and errant disciples, having barely grasped the Lesser Vehicle, claim to have attained the Dao. They seek only liberation through thought, styling themselves as immortals, yet they know not that the path of thought-liberation is wholly a derangement of spirit. It does not compare to the immortal who refines spirit into transcendence.\n\nOnly humans possess spirit, ever capable of self-perception. Though the eye constantly beholds it, one does not recognize it—thus the sage says it is used daily yet unknown. Suppose a scholar gazes into a mirror and beholds the reflection within—is it not spirit? Whether the countenance is fair or foul, it is revealed in the reflection. How does the reflection in the mirror differ from the scholar who gazes into it? Thus, the image in the mirror—is it not called spirit?\n\nPeople see their spirit yet do not cultivate it—are they not then ghosts? Therefore, the sage says: people know spirit as spirit, yet do not know that the unspiritual is also spirit—this is the meaning.\n\nThose who refine spirit into transcendence must first refine their form. When the form is whole, the spirit is whole. One may ask: What does it mean that when the form is whole, the spirit is whole? I reply: Consider a scholar blind in one eye who gazes into a mirror and observes the reflection—it is the same. There has never been a one-eyed scholar whose reflection was not also one-eyed. Yet if a whole scholar gazes into a mirror, the reflection is one-eyed! Thus, one must first make the form whole.\n\nAnother asks: Does spirit dwell within the human body? I say: It dwells there. Then why does it emerge when one faces a mirror? I answer: If it does not emerge when facing a mirror, that is blindness in the person—spirit emerges yet is unseen. Moreover, the spirit in the human body is like a dwelling; spirit abiding in human form is like a person lodging in a house. If entry and exit are unobstructed, the locks and bolts secure, there will be no error. Thus, when the house decays, the person departs; when the form deteriorates, the spirit flees—this is the essential Dao.\n\nAll who cultivate must first be magnanimous and virtuous, abundant in righteousness and trustworthiness, radiating kindness and generosity, shunning greed and distancing harm. They do not engage in envious or grasping conduct—this may be called clarity. They do not utter flattering or deceptive words—this may be called integrity. They rescue the drowning, save the burning, support the distressed, cherish the young, comfort the aged, aid the imperiled, deliver the endangered, reduce punishments, quell anger, deliberate in affairs, bestow kindness upon the people. They regard evil as scalding water and good as ever beyond reach. With long-accumulated hidden merits, their solar virtue naturally flourishes. They do not add envy and grasping to self-destruction, nor rely on lust and desire to self-injury. When essence is preserved, spirit is firm; when essence is exhausted, spirit departs. Thus, the sage says: first essence, then spirit; first spirit, then transcendence.\n\nIn recent times, disciples ignorant of the sagely Dao all practice purity and restraint, dwelling in seclusion among forests and springs, subsisting on coarse fare and wearing plain robes, avoiding the bedchamber. Their essence knows no leakage, and their spirit is naturally whole. This may prolong life to dwell in the turbid world. Yet when their allotted span ends, piled kindling burns them. The essence they preserved without leakage becomes a strange relic of their vows—fierce fire cannot reduce it to ash, flowing water cannot dissolve it. Thus, the scriptures say: those who cling to it do not understand the Dao and virtue—this is the meaning.\n\nToday, people who barely enter the gate of grain-abstention and tranquility style themselves as immortals, clinging to their attachments. Alas! How truly pitiable!\n\nThose who refine the elixir without recourse to the Eight Trigrams labor in vain. Now, I have comprehensively set forth the methods of immortal cultivation and self-nurturance, arranging them in chapters. I wish that all learners may not waste their aspirations. There is no need to harmonize them with the *Zhouyi Cantong Qi* or the *Taiyi Supreme Diagram*—the principle shines forth clearly. I have expounded the essential purport in detail. Let all Daoist adepts examine and savor it.\n\n**The Internal Alchemy Formula of Master Dongyuan, Fascicle One**\n\n**Chapter One: The Primordial Mystery**\n\nThose who refine the elixir do not refine common lead and mercury—they refine true lead and true mercury. The sages drew analogies to model them for the multitude. They spoke of grasping lead and casting mercury, of timely firing, and of gathering the flower—how people regret their ignorance!",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1237,
      "start_sentence": 0,
      "end_sentence": 52,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.89325499534607,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\洞元子内丹诀.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "北方正炁日水，南方正炁曰火，水火二炁，采必有时，用必有日，苟采取失候，虽炼百载，亦徒为也。 若使日月归元，水火得济，功成至速。 故丹者，丹田之谓也，其奚有铅汞能成乎？ 且上丹田日泥丸，中丹田曰绛宫，下丹田日炁海，亦日鼎，取水火之炁，归之於鼎，故日炉。 寡淫欲，惜精液，实筋骨，荣泥丸者，故炼上丹田也。 多忠孝恻隐之心，负拯救扶危之道，履仁终日，犹恐不及，博施济众，嫉拓弗恃，抱元守一，精无摇荡者，炼中丹也。 纳水火之炁，归炉鼎之中，弗荡厥精，终固其根者，炼下丹田也。 三丹若就，焉能死！ 及夫天地之形久长者也。 寒暑往来，日月迭运，大岳有云，巨海有潮，斯皆炁候往还也，人亦如之。 故以眼目比之为日月，肠胃比之为江海，肝比束方木，心比南方火，肺比西方金，肾比北方水，脾比中央土，炁候出没比之为云，津液往来比之为潮，血脉通流比之为河，下元精室比之为海。 故圣人顺天地造化，取象而修之，乃长生飞仙也。 多见愚辈，俟役心神，迷执己见，寝食或忘，区区终日，莫见成功。 凡阴阳之炁，采必有时，采若有差，丹莫得就。 夫五月一阴生，阳衰而阴盛也，阴阳之炁，生必有日，采必有时，故年有月也，日有时也。 十一月为之冬至日，一阳生也，他皆仿此也。 阳皆得以用之，阴得以休之，故人采炁者多以半夜子时，为候，斯亦然也。 大用之候冬至也，小用之候半夜也，此失之毫厘，差之千里也。 诀曰 凡铅凡汞非水火，真水真火唯一个。 化为龙虎镇相随，龙若行时虎不坐。 但於至日勤驱逐，半夜子时令相续。 炁为龙兮津为虎，相将直入玄宫去。 审其时候若获之，是人皆适云霄路。 坎宫篇第二 坎者，北方也，为阴为月，为虎为水，为炁。 其卦得＠＃，两阴而一阳也，阴中阳生也。 水能育万物，炁能生万物。 混沌之分，其炁象同水，然后生阳，阳处壳中，卵之象也，亦坎卦二阴而一阳，阴包乎阳也，阴极阳生之谓。 故能生其阳，阳生而合阴，则分为天地，天地生万物，道之源耳。 天地长久，始於水也，故炼炁者，守乎坎，亡坎者，亡母也。 万物无母而不育，故必守母，然后成耳。 居蒙昧之中，理者，其坎之谓欤！ ．是杳冥之中养精明，恍惚之中得物者，成其精，获其物，得无故乎？ 君子处身於罹乱之际，必全其志，养气於杳冥之问，必保其道。 志全则无不立，道保则无不就。 《易》曰：有孚维心享。 用而行者，不升於天，天则险也。 至於玄牝之门，复归於海，出於玄牝，则亡也。 故《易》曰行有尚用者，二阴俱往朝於谷神，历诸经脉及诸龄峰，是以易象坎，重阴也，炁上而无差，津注而不乱，采必以日，用必以时，精不荡，炁不错，巡历涂辙，同归於一。 故《易》曰：水流而不盈，行险而不失，其信夫！ 修炁者常习坎宫，运行有度，昼夜匪失，於千日功毕其数，故《易》曰：君子以常德行，习教事。 又曰：三岁不得凶，千日不就，终凶也。 炁海日鼎，亦日器，两阴并荐，下归鼎津为玉华，鼎曰灵根，气行之涂，亦曰衡庐。 玉华之味，其甘若蜜，既归於鼎，始成厥道。 故《易》曰：六四蹲酒□篡贰，用缶纳约是也。 类象。 篆日",
      "translated_text": "The northern *qi* is called Water, and the southern *qi* is called Fire. The two *qi* of Water and Fire must be gathered at the proper time and employed on the proper day. If one gathers them at the wrong moment, even after a hundred years of refinement, it will be in vain. But if the sun and moon return to their origin and Water and Fire achieve balance, success comes swiftly.\n\nThus, the \"elixir\" refers to the Cinnabar Field. How could mere lead and mercury ever succeed? The Upper Cinnabar Field is called the Muddy Pellet; the Middle Cinnabar Field is called the Crimson Palace; the Lower Cinnabar Field is called the *Qi*-Sea, also known as the Cauldron. One draws the *qi* of Water and Fire and returns it to the Cauldron—hence the term \"Furnace.\"\n\nTo reduce lust, cherish seminal essence, strengthen the sinews and bones, and nourish the Muddy Pellet is to refine the Upper Cinnabar Field. To cultivate a heart of loyalty, filial piety, and compassion; to bear the Way of rescue and succor; to walk in benevolence all day without ceasing; to broadly bestow aid without expectation of reward; to embrace the One and guard it, keeping one’s essence unshaken—this is to refine the Middle Cinnabar Field. To draw in the *qi* of Water and Fire and return it to the Furnace and Cauldron, never scattering one’s essence and ultimately securing the root—this is to refine the Lower Cinnabar Field.\n\nWhen the three Cinnabar Fields are accomplished, how could one die? Even the forms of Heaven and Earth endure long. Cold and heat alternate; the sun and moon revolve in succession. Great mountains have clouds; vast seas have tides—all are the cyclical movements of *qi*. So too is it with humans. Thus, the eyes are likened to the sun and moon; the intestines and stomach to rivers and seas; the liver to eastern Wood; the heart to southern Fire; the lungs to western Metal; the kidneys to northern Water; the spleen to central Earth. The ebb and flow of *qi* are likened to clouds; the circulation of fluids to tides; the flow of blood and vessels to rivers; the chamber of essence in the lower origin to the sea.\n\nThus, the sages followed the transformations of Heaven and Earth, taking their patterns as models for cultivation—thereby attaining long life and ascending as immortals. Yet many fools exhaust their minds and spirits, clinging to their own deluded views, forgetting even sleep and meals. All day they toil, yet never see success. For the *qi* of yin and yang must be gathered at the proper time; if the moment is missed, the elixir cannot be achieved.\n\nIn the fifth month, the first yin arises, and yang wanes while yin waxes. The *qi* of yin and yang are born on fixed days and gathered at fixed times—thus the year has its months, and the day its hours. The eleventh month, the Winter Solstice, is when the first yang arises; the rest follow accordingly. Yang is to be employed, while yin is to rest. Thus, those who gather *qi* often take the midnight hour of *zi* as their time—this is the same principle. The great employment is at the Winter Solstice; the lesser, at midnight. Here, a hairsbreadth’s error leads to a thousand *li*’s deviation.\n\nThe formula states:\nCommon lead and mercury are not Water and Fire;\nTrue Water and true Fire are but one.\nTransformed into Dragon and Tiger, they follow in tandem.\nWhen the Dragon moves, the Tiger does not rest.\nOnly on the proper day must you diligently drive them,\nAt midnight, the hour of *zi*, ensure their continuity.\n*Qi* is the Dragon, fluids are the Tiger;\nTogether they enter straight into the Mysterious Palace.\nIf you grasp the proper time and obtain them,\nThat person will ascend the path to the clouds.\n\n**Chapter Two: The Kan Palace**\n\n*Kan* is the North, representing yin, the moon, the Tiger, Water, and *qi*. Its trigram is ☵, two yin lines with one yang—yang born within yin. Water nurtures the myriad things; *qi* gives life to the myriad things. When the primordial chaos divided, its *qi* resembled water, then yang was born. Yang dwells within the shell—like an egg, or the *Kan* trigram’s two yin lines enclosing one yang. This is the principle of yang arising at the extreme of yin.\n\nThus, it can generate yang. When yang arises and unites with yin, Heaven and Earth divide, and the myriad things are born—this is the source of the Dao. Heaven and Earth endure long, beginning with Water. Thus, those who refine *qi* guard *Kan*; to lose *Kan* is to lose the Mother. Without the Mother, nothing can be nurtured. Therefore, one must guard the Mother to achieve success.\n\nDwelling in obscurity, yet within it lies principle—this is the meaning of *Kan*! Nurturing clarity within profound darkness, obtaining the thing within the indistinct—is this not refining essence and securing the thing? When the noble person maintains integrity amid turmoil, preserves their aspiration, and nurtures *qi* in profound obscurity, they safeguard the Dao. With aspiration intact, nothing is not established; with the Dao preserved, nothing is not achieved.\n\nThe *Book of Changes* says: *\"With sincerity, the heart is nourished.\"* Those who act while employing it do not ascend to Heaven, for Heaven is perilous. As for the Gate of the Mysterious Female, returning to the sea—if one departs from the Mysterious Female, they are lost. Thus, the *Book of Changes* says: *\"Action has its reward.\"* The two yin lines both proceed to pay homage to the Valley Spirit, traversing the meridians and all the peaks. Therefore, the *Kan* trigram’s image is heavy yin, yet its *qi* ascends without error, its fluids flow without disorder. Gathering must be done by the day, employment by the hour. Essence is not scattered; *qi* does not err. Traversing the paths, all return to the One.\n\nThus, the *Book of Changes* says: *\"Water flows without overflowing, traverses peril without losing its reliability.\"* How true this is! Those who cultivate *qi* must constantly practice within the *Kan* Palace, circulating it with measure, day and night without fail. After a thousand days, the work is complete. Thus, the *Book of Changes* says: *\"The noble person constantly practices virtue and habituates to affairs.\"* It also says: *\"If one does not succeed in three years, there is misfortune; if one does not complete it in a thousand days, the end is calamity.\"*\n\nThe *Qi*-Sea is called the Cauldron, also the Vessel. The two yin lines converge below, returning to the Cauldron’s fluids as Jade Flower. The Cauldron is called the Numinous Root; the path of *qi*’s movement is also called the Balance Hut. The taste of Jade Flower is as sweet as honey. Once it returns to the Cauldron, the Dao is first accomplished.\n\nThus, the *Book of Changes* says: *\"The fourth line: wine in a clay vessel, a second offering in a bamboo basket—simple and sincere.\"* This is the image. The seal-script says...",
      "overlap_context": "ly. I have expounded the essential purport in detail. Let all Daoist adepts examine and savor it.\n\n**The Internal Alchemy Formula of Master Dongyuan, Fascicle One**\n\n**Chapter One: The Primordial Mystery**\n\nThose who refine the elixir do not refine common lead and mercury—they refine true lead and true mercury. The sages drew analogies to model them for the multitude. They spoke of grasping lead and casting mercury, of timely firing, and of gathering the flower—how people regret their ignorance!",
      "start_char": 1237,
      "end_char": 2457,
      "start_sentence": 53,
      "end_sentence": 100,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.32315921783447,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\洞元子内丹诀.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "坎宫之象，混沌也，杳冥也，恍惚也，相生也，阴阳也，子母也，运而心亨者，有信也，流而不盈，险而不次，有诚者也。 匪常德行习，教事不周，千日凶者也。 本宫之液，炼之日久，玉华迅激，津者也。 六四蹲酒，二阴之液者也，纳之用缶，鼎器也。 君子履是有或。 过莫大焉！ 诀日 气之为龙津作虎，水有骨兮火有土，时人不会一阴阳，不知本生一子母。 子迎母，母随子，蹲酒嘉味甘如醴，扶入河车般载归，白头相守无能死。 玄牝之门密关锁，逍遥只向琼台坐，沐身除却有神泉，饥食自能发元火。 千日功成生子孙，故云我命即在我。 离宫篇第三 离宫，南方之位也，王德在火，丽也，发也。 太阳之炁既刚且猛，故其卦得 ，离之象柔其中，而刚其外也。 以柔悦刚，以刚御柔，和而顺也。 阳极则阴生，阴极则阳生，故坎中刚，高中柔，和而顺也。 日中乌，月中兔，重明之盛，匪获阴德，弗能久也。 重阴之盛，匪得阳，不能永也。 夫修炁之事，匪独运坎宫而得成坎也，匪独运高宫而得成高也，若当独运，阴阳不睦，必致差错，难得其成功也，若掘地而求日月也。 坎有阳，高有阴，互相运之，以成厥象，故《易》曰：畜牝牛，吉。 牛者，丑也，丑者，阴也。 丑，北方末位也，与坎为邻，高火炎盛，必坎水以济之，不济则凶也，故曰畜牝牛，吉。 纳而归鼎，同流衡庐，体炁光华，颜若冰玉，故《易》曰：大人以继明，昭一於四方。 纳高之炁，以坎成之，生自于心，心为帝君。 审宜行履无失厥度，失度则凶，故《易》曰：突如，其来如焚如弃。 如死如注曰； 逼近至尊，心之谓也。 类象。 象曰",
      "translated_text": "The image of the Kan Palace is that of primordial chaos, profound obscurity, and fleeting indistinctness—where mutual generation, yin and yang, and mother-and-child arise. When its movement brings clarity to the heart, there is trust; when it flows without overflowing, faces peril without disorder, there is sincerity. Without constant practice of virtue and habituation to affairs, one will not complete the thousand-day work and meet misfortune.\n\nThe fluid of this palace, refined over time, becomes the swift and surging Jade Flower—its essence. The \"wine in a clay vessel\" of the fourth line represents the fluid of the two yin; receiving it in an earthenware vessel is the Cauldron. The noble person who treads this path must be cautious, for no error is greater!\n\nThe secret formula says:\n*Qi becomes dragon, its fluid the tiger;\nWater has bones, fire has earth.\nPeople of this age do not comprehend yin and yang,\nNor know the root that gives birth to mother and child.\nChild welcomes mother, mother follows child—\nThe wine’s fine taste is sweet as nectar.\nAssisted into the River Chariot, borne back,\nWhite-haired, they guard each other without death.\nThe Mysterious Female’s gate is sealed tight,\nAt ease, seated only in the Jade Terrace.\nBathed in the divine spring, impurities shed,\nHunger feeds itself by kindling the primordial fire.\nAfter a thousand days, the work is complete, offspring born—\nThus it is said: \"My fate lies within me.\"*\n\n**Li Palace, Third Section**\nThe Li Palace is the position of the south, where the king’s virtue resides in fire—radiance and emanation. The *qi* of the Great Yang is both firm and fierce, hence its trigram is ☲, the image of Li: soft within yet firm without. With softness, it delights the firm; with firmness, it governs the soft—harmonious and compliant. When yang reaches its peak, yin arises; when yin reaches its peak, yang arises. Thus, Kan holds firmness within, Li softness within—harmonious and compliant.\n\nThe crow in the sun, the hare in the moon—such is the abundance of double brightness. Without obtaining yin’s virtue, it cannot endure. The abundance of double yin, without obtaining yang, cannot last.\n\nIn the practice of refining *qi*, one does not achieve completion by circulating only the Kan Palace, nor by circulating only the Li Palace. If one operates in isolation, yin and yang will not harmonize, leading inevitably to errors and making success difficult—like digging into the earth to seek the sun and moon.\n\nKan contains yang, Li contains yin; circulating them mutually completes their image. Thus, the *Book of Changes* says: *\"Raising a female ox brings good fortune.\"* The ox is *chou* (丑), which is yin. *Chou* is the final position of the north, neighboring Kan. When the fire of Li blazes intensely, it must be tempered by the water of Kan; without this tempering, misfortune follows. Hence, *\"Raising a female ox brings good fortune.\"* Receiving it and returning to the Cauldron, flowing together in the Balance Hut, the body’s *qi* radiates brilliance, the complexion like ice and jade. Thus, the *Book of Changes* says: *\"The great person continues brightness, illuminating the four directions.\"*\n\nAbsorbing the *qi* of Li and completing it with Kan, life arises from the heart—for the heart is the Emperor Lord. One must carefully proceed without losing the proper measure; losing measure invites misfortune. Thus, the *Book of Changes* says: *\"Suddenly, it comes like fire, like abandonment.\"* And: *\"Like death, like pouring away.\"* This describes encroaching upon the supreme—referring to the heart.\n\n**Image.** The *Xiang* says...",
      "overlap_context": "ldron, also the Vessel. The two yin lines converge below, returning to the Cauldron’s fluids as Jade Flower. The Cauldron is called the Numinous Root; the path of *qi*’s movement is also called the Balance Hut. The taste of Jade Flower is as sweet as honey. Once it returns to the Cauldron, the Dao is first accomplished.\n\nThus, the *Book of Changes* says: *\"The fourth line: wine in a clay vessel, a second offering in a bamboo basket—simple and sincere.\"* This is the image. The seal-script says...",
      "start_char": 2457,
      "end_char": 3101,
      "start_sentence": 101,
      "end_sentence": 129,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.596047401428223,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\洞元子内丹诀.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "以柔悦刚，以刚御柔，阴阳之道，和者也。 运坎成高，运高成坎，阴阳之炁，动静交相养者也。 畜牝牛，取柔制刚者也，大人以继明，昭一於四方，纳高炁之盛，炳焕人色，四体悦泽，无诸疾疹者也。 突如，其来如，焚如死，如弃如。 阴阳炁顺，以明兼暗，以昏待晓，道成於被，岁形斯弃者也。 道者，习是，元妄必至也。 诀曰 一虎功能御两龙，相将出入在玄宫，玄宫台殿天河阔，中含皎皎一轮月。 月中有兔探颠蹶，勾引阳乌半夜发，自求金体欲鼎烹，不是锋错谁敢煞。 坎官女子年方少，长着玄衣夸窈窕，双双终夜理云鬃，不见良人终不笑。 赖得高家两个郎，三才必备貌堂堂，来卜婚姻始称心，合晋同枉设玉浆。 玉浆饮绝安稳睡，玄黄炁作花花被，玉堂金殿结成心，誓卜合欢千万岁。 千万岁后更重誓，这回直看终天地，既被学人合相娱，教人嫁与婴儿去。 婴儿阳炁未能全，教妾子孙生何处。 既济篇第四 既济者，皆济也，大小皆济，故曰既，又曰败而能立，漏而不溺。 故其卦得 ，既济之象，阴阳耦也。 耦以不荡，故曰济，一阴一阳谓之道，既济之象是也。 夫修炁者，必以子后先纳高，高六备，后纳坎，坎六足。 高先而居下，坎后而居上，故上下水火，以得乎济，济元不济也。 初九盛阳，归之於鼎，故《易》谓濡其尾也。 坎宫勾女，始高本位，朝於鼎，失家而为旅。 初九高界，得之少阴少阳，始在厥耦，意未稠密，故易谓丧其弗也。 七曰得久，以和也，抽坎宫之炁，归於下丹田，与离为匹，行之三年，厥功自至，故《易》谓伐鬼方，三年克之也。 阳败之士，老以奉道，知坎高之谓用，炼以弗阙，守时不失，亦可补益正炁。 久久能行，自致神仙，故《易》谓糯有衣初终曰戒。 《易》曰：初所以塞舟漏也。 类象。 象曰",
      "translated_text": "With softness one delights the hard; with hardness one governs the soft—this is the Dao of yin and yang, their harmony. Moving Kan to complete Li, moving Li to complete Kan—this is the *qi* of yin and yang, where movement and stillness nourish each other in alternation.\n\nRaising a female ox is to take softness to restrain hardness. *\"The great person continues brightness, illuminating the four directions\"*—receiving the flourishing *qi* of Li, one’s complexion shines radiantly, the four limbs are joyful and moist, free from all illness and affliction.\n\n*\"Suddenly, it comes like fire, like abandonment—like death, like pouring away.\"* When the *qi* of yin and yang flows smoothly, brightness encompasses darkness, dusk awaits dawn, and the Dao is accomplished in its embrace, while the form of the year is cast aside.\n\nAs for the Dao, to practice this is to ensure that primal delusion inevitably arises.\n\n**Secret Formula:**\nOne tiger’s power can govern two dragons,\nTogether they enter and exit the Mysterious Palace.\nThe Mysterious Palace’s terrace and halls stretch wide as the Celestial River,\nWithin them contains a luminous, round moon.\nIn the moon, a rabbit stirs restlessly,\nDrawing forth the yang crow to take flight at midnight.\nIt seeks the golden body, desiring to be refined in the Cauldron—\nIf not for the whetstone, who would dare to temper it?\n\nThe maiden of the Kan Palace is young in years,\nEver clad in dark robes, boasting of her grace.\nThrough the night she tends her cloud-like tresses in pairs,\nYet without seeing her true beloved, she never smiles.\nFortunately, the Li household has two fine sons,\nThe Three Powers complete in their majestic bearing.\nThey come to divine a marriage, at last content in their hearts,\nJoining in union, they set out jade wine in mutual offering.\n\nHaving drunk the jade wine, they sleep in perfect peace,\nWith a quilt of *qi* in hues of dark and yellow, like blossoming flowers.\nIn the jade hall and golden palace, their hearts are bound as one,\nVowing to share joy for ten thousand years.\nAfter ten thousand years, they swear anew,\nThis time to gaze together through the end of heaven and earth.\nYet once the adept has united them in bliss,\nHe commands her to wed the Infant instead.\n\nThe Infant’s yang *qi* is not yet complete—\nWhere then shall this maiden bear her descendants?\n\n**Hexagram 63: \"After Completion\"**\n*\"After Completion\"* means all is completed—great and small alike are fulfilled, hence it is called *\"After.\"* It is also said: *\"Though failing, one can stand; though leaking, one does not drown.\"*\n\nIts hexagram is **䷾**, the image of *\"After Completion,\"* the coupling of yin and yang. Coupled yet not disordered, hence it is called *\"Completion.\"* One yin and one yang—this is called the Dao, and the image of *\"After Completion\"* is just this.\n\nFor those who cultivate *qi*, one must first absorb Li after midnight, for Li’s six lines are complete, then absorb Kan, for Kan’s six lines are sufficient. Li comes first yet dwells below; Kan follows yet dwells above. Thus, above and below, water and fire achieve completion—completion that is fundamentally non-completion.\n\nThe first nine is flourishing yang, returned to the Cauldron, hence the *Book of Changes* says: *\"It wets its tail.\"*\n\nThe maiden of the Kan Palace, originally of Li’s position, attends the Cauldron at dawn, having lost her home and become a wanderer. The first nine of Li’s realm obtains the lesser yin and lesser yang, beginning in their coupling, yet the intent is not yet dense, hence the *Book of Changes* says: *\"It loses its ax.\"*\n\nSeven is called *\"attaining longevity\"* through harmony. Drawing the *qi* from the Kan Palace, it returns to the lower Cinnabar Field to pair with Li. Practicing this for three years, its merit naturally arrives, hence the *Book of Changes* says: *\"Attacking the Ghost Region, after three years one overcomes it.\"*\n\nA man whose yang has declined, though aged, may serve the Dao. Knowing the function of Kan and Li, refining without deficiency, guarding the proper time without fail, he too may replenish the upright *qi*. With long and persistent practice, he may attain immortality, hence the *Book of Changes* says: *\"The glutinous millet has clothing—from beginning to end, it is called vigilance.\"*\n\nThe *Book of Changes* says: *\"The beginning is what stops the boat’s leak.\"*\n\n**Image.**\nThe *Xiang* says...",
      "overlap_context": "son continues brightness, illuminating the four directions.\"*\n\nAbsorbing the *qi* of Li and completing it with Kan, life arises from the heart—for the heart is the Emperor Lord. One must carefully proceed without losing the proper measure; losing measure invites misfortune. Thus, the *Book of Changes* says: *\"Suddenly, it comes like fire, like abandonment.\"* And: *\"Like death, like pouring away.\"* This describes encroaching upon the supreme—referring to the heart.\n\n**Image.** The *Xiang* says...",
      "start_char": 3101,
      "end_char": 3795,
      "start_sentence": 130,
      "end_sentence": 158,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.580711364746094,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\洞元子内丹诀.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "先高后坎，水火也，水火之象，得济者，阴阳之耦也。 水火投鼎，故濡其尾也，坎女别立，高男获之，非聚以合，获於中道，故丧其第也。 七日得者，久自睦也，伐鬼方三年，鬼方阴也。 坎宫之炁，抽运千日，然后成功，故克之也。 修道之士，纵老而此炼炁弗怠，则精神自补，故初所以塞舟漏也。 诀曰 黄高男子艺奇绝，万里抛家朝金阙，才入金门日未多，巍巍独秉丈夫节。 元何北方有佳人，颜如桃李体如银，独驾河车高玉户，来朝元府自求亲。 亲姻得合天地会，日月运行常进退，半夜相期向子时，是致阴阳成既济。 未济篇第五 阴始阳末，故曰未济，未济终济也，以阴阳之顺，故终济尔。 其卦得 ，阴阳之顺，上火下水，而能自济。 夫修炁者，复於午前阴炁未生，抽而纳之，互成厥体，先坎而后高也。 故六备高六。 次夫一阴始纳归诸太仓，阴炁始微，故曰未济，大易谓，小狐既济，濡其尾。 是也。 高之一阳，次投於鼎阴，伪斯获，故曰终济，而以刚健拯乎柔弱。 大易谓，曳其轮，贞吉是也。 以刚御柔，以阴制阳，君子之道和於小人。 大易谓君子之光有孚是也。 未济之拯而得，必济。 君子获禄，固於家也； 道士获祉，固於身也。 大易谓上九有孚於饮酒是也。 类象。 象曰",
      "translated_text": "First high then low—water and fire. The imagery of water and fire, when balanced, is the pairing of yin and yang. Water and fire enter the cauldron, thus \"wetting its tail.\" The Kan maiden stands apart; the Li man obtains her. Without gathering to unite, he seizes her midway, hence \"losing his rank.\" Those who attain it in seven days achieve harmony naturally. \"Attacking the Ghost Region for three years\"—the Ghost Region is yin. Drawing and circulating the *qi* from the Kan Palace for a thousand days, only then does success come, hence \"overcoming it.\" For the Dao practitioner, though aged, if this refinement of *qi* is never neglected, the spirit and essence naturally replenish, thus \"the beginning is what stops the boat’s leak.\"\n\n**Formula:**\nThe Li man of the Yellow Court masters rare arts,\nAbandoning home for ten thousand leagues to court the Golden Gate.\nScarcely has he entered the Golden Door when the sun is not yet high,\nYet loftily he alone upholds the steadfastness of a true man.\nAh! In the north there is a fair maiden,\nHer face like peach and plum, her form like silver.\nAlone she drives the River Chariot to the jade door of the Li Palace,\nComing to the Primordial Mansion to seek union.\nOnce their marriage is joined, heaven and earth converge,\nSun and moon circulate in constant advance and retreat.\nAt midnight they meet at the hour of *zi*,\nThus yin and yang achieve the *Completion of the Cauldron*.\n\n**Hexagram 64: \"Not Yet Completed\"**\nYin begins, yang ends, hence \"Not Yet Completed.\" Yet \"Not Yet Completed\" ultimately reaches completion—through the proper sequence of yin and yang, it finally attains balance. Its hexagram is ☲☵, the proper order of yin and yang: fire above, water below, yet able to complete itself. For those who refine *qi*, returning at noon before yin *qi* arises, drawing and absorbing it to form their body—first Kan, then Li. Thus the six yang lines are matched by six Li.\n\nNext, when the initial yin is absorbed and returned to the Great Granary, yin *qi* is just beginning to stir, hence \"Not Yet Completed.\" As the *Book of Changes* says: *\"The little fox, having crossed, wets its tail.\"* This is it. The single yang of Li then enters the yin cauldron, and the union is obtained, hence \"ultimately completed,\" using firm strength to rescue the yielding. As the *Book of Changes* says: *\"Dragging its wheels—steadfastness brings good fortune.\"* This is it. With firmness guiding the yielding, yin restraining yang, the noble man’s Dao harmonizes with the petty man. As the *Book of Changes* says: *\"The noble man’s radiance holds sincerity.\"* This is it. Through the rescue of \"Not Yet Completed,\" \"Completion\" is attained.\n\nThe noble man obtains emolument and secures his household;\nThe Daoist obtains blessing and secures his person.\nAs the *Book of Changes* says: *\"The topmost yang holds sincerity in drinking wine.\"* This is it.\n\n**Image.**\nThe *Xiang* says...",
      "overlap_context": "\"*\n\nA man whose yang has declined, though aged, may serve the Dao. Knowing the function of Kan and Li, refining without deficiency, guarding the proper time without fail, he too may replenish the upright *qi*. With long and persistent practice, he may attain immortality, hence the *Book of Changes* says: *\"The glutinous millet has clothing—from beginning to end, it is called vigilance.\"*\n\nThe *Book of Changes* says: *\"The beginning is what stops the boat’s leak.\"*\n\n**Image.**\nThe *Xiang* says...",
      "start_char": 3795,
      "end_char": 4295,
      "start_sentence": 159,
      "end_sentence": 184,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.297496557235718,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\洞元子内丹诀.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "小狐吃济者，狐为阴物，力小且微，欲济则必先濡矣！ 阴物者，坎之谓也，阴为阳得，坎正其中，刚柔和悦，故曳输也。 君子之道，先卑而后尊，无咎而后贞。 处未济之时，故弱於民，及终济之后，必上於民，故君子之光，有孚也。 终济之下，固身知命，获天之禄，故有孚於饮酒也。 一阴一阳，刚柔之位，无武乃顺天之道，以行其炁，故终济。 诀曰 玄宫门户探关锁，二八佳人矜姗娜，长怨良媒不到门，支颐独守糙楼坐。 不教父母知端的，潜出闺门街颜色，信步寻房到太阳，直入龙官无气力。 便得阳郎驾火轮，非时结佩旋成亲，一阴一阳递相制，长生之道必终济。 未济既济篇第六 未济先阳而后阴也，既济先水而后火也。 卦象在前，先天而后地者，阴阳之顺也； 先月而后日者，子母之道也。 故合同，一是生万物。 凡修炁者，必於厥时，既得其时用，先四高而后四坎，再四高以合之，互成一十二象。 又复以时先四坎后四高，再四坎，以合之十二卦，功毕於此。 诀曰 太阳始生月始运，太阳未臧月须进，时人刚道月生迟，一夕周天十二回。 子若行时吾亦去，吾若前时子弗住，与子相随千万秋，得地得时须拟聚。 不得地勿妄为，不得时勿妄施，审宜深须固护，勿使常人知我是仙兮，汝是尸。 乾宫篇第七 天地始育於阴阳之炁也，故先坎离而后乾坤； 日月运行天地之内，以近言焉，则先乾坤而后水火也。 阳德之盛，行而无倦，始则氤氲，终则有睹。 自刚弗息，自砺无退，健以能行，刚以弗由。 聚之则同於毫芥，展之则弥纶万物。 可尊而不可亲，示其崇也，可望而不可测，示其神也。 终日无息，弗失其几者，唯乾之谓乎！ 其卦得 。 凡修炁之士，久而行之，止於乾者，道德固也。 天地能变，化生万物，因天地而滋之变化，亦如之。 必以时，单引而纳之，纳之者，谓之青龙，一阳始往，厥力在微，未能变化，施张其位，君子固穷以俟乎盛。 《易》曰：初九潜龙勿用。 勿用者，未用也。 再引而申，来诸胜地，阳德相契，勃然以盛，赫然以作，焕然以来，炳然以居。 德能普济以处中位，位於中契，上下在天，故《易》曰：九二见龙在田。 引而荐申，厥象以成。 处上之极，不履重刚，未可以安。 君子以寡思虑，诫欲乐，修道德为城池，断仁义为干橹，慎言语而密枢机，体杳冥而视有，得终时无怠，以行其道。 故《易》曰：九三，君子终日乾乾，夕惕若厉，无咎。 乾本无名，引而行之，则而象之，强而行之，万而始之，故得名也。 一炁演畅，玉华涌流，贯注灵源，各司其位，功毕千日，视能变化。 故《易》曰：云行雨施，品物流形，大明终始，时乘六龙以御天。 乾道变化，各正性命，君子以纳其象。 灵芝未萌，根方在植，再而申之，阳德见盛。 一爻相契，事无不久，故获其利而利於身也。 既利於身，固以必守，无却逸志。 故《易》曰：元者善之长，亨者嘉之会，利者义之和，贞者事之干。 是以元亨利贞之道备矣！ ．类象。 象曰潜龙勿用，君子之道始微。 光者，见龙在田，青龙出隐，将德其用，以朝於鼎也。 终日乾乾，夕惕无咎，道之始着，戒之在欲。 至而行者也，云行雨施，津炁同往者，大明终始，千日之功。",
      "translated_text": "The \"small fox crossing\" speaks of the fox as a yin creature, its strength slight and subtle—if it seeks to cross, it must first wet its tail! The yin creature refers to Kan; yin is obtained by yang, and Kan resides at its center, where firmness and yielding harmonize in joy, thus \"dragging its wheels.\" The noble man’s Dao first humbles itself before attaining honor, first avoids blame before achieving steadfastness. Dwelling in the time of \"Not Yet Completed,\" he is thus weak among the people, but after \"Completion\" is ultimately achieved, he must rise above them. Hence, \"the noble man’s radiance holds sincerity.\" Beneath \"Completion,\" one secures the body and knows destiny, obtaining Heaven’s emolument, thus \"holding sincerity in drinking wine.\"\n\nOne yin and one yang occupy the positions of firmness and yielding. Without force, one follows the Dao of Heaven, circulating its qi—hence \"ultimate completion.\" The formula states:\n*Within the Mysterious Palace, doors and locks are probed,\nA maiden of sixteen, graceful and refined,\nLong lamenting that no matchmaker comes to her gate,\nShe rests her chin, alone in her tower’s solitude.\nUnbeknownst to her parents, she slips from her chamber,\nHer beauty revealed as she wanders the streets.\nWith unhurried steps, she seeks the Yang Chamber,\nEntering the Dragon Palace with no strength left.\nThere she meets the Yang Lad driving his fiery wheel,\nUntimely they knot their pendants and swiftly wed.\nYin and yang alternately restrain each other—\nThe Dao of long life must ultimately be completed.*\n\n**Chapter Six: \"Not Yet Completed\" and \"Completion\"**\n\"Not Yet Completed\" begins with yang and follows with yin; \"Completion\" begins with water and follows with fire. In the preceding hexagram images, Heaven precedes Earth—this is the proper order of yin and yang. The moon precedes the sun—this is the Dao of mother and child. Thus, in union, the One gives birth to the myriad things.\n\nAll who cultivate qi must do so at the proper time. Having grasped the timely application, first employ the four yang lines, then the four yin lines, then again four yang to unite them, forming the twelve images. Then, in turn, first employ four yin lines, then four yang, then again four yin, uniting them into the twelve hexagrams—here the work is complete.\n\nThe formula states:\n*When the Great Yang first arises, the moon begins its motion;\nWhile the Great Yang has not yet waned, the moon must advance.\nOrdinary folk speak of the moon’s slow birth,\nYet in one night it circles the heavens twelve times.\nWhen you move, I too depart;\nWhen I advance, you do not stay.\nTogether we follow for a thousand myriad autumns,\nMeeting where place and time align.\nWithout the proper place, do not act recklessly;\nWithout the proper time, do not apply carelessly.\nExamine deeply and guard firmly—\nLet no common person know that I am the immortal and you are the mortal.*\n\n**Chapter Seven: The Qian Palace**\nHeaven and Earth first nurture the qi of yin and yang, thus Kan and Li precede Qian and Kun. The sun and moon move within Heaven and Earth—speaking in terms of proximity, Qian and Kun precede water and fire. The盛ness of yang virtue moves without weariness: at first, it is misty and obscure; in the end, it becomes visible. Unyielding, it never ceases; tempered, it never retreats. Vigorous, it can act; firm, it does not deviate. Gathered, it is as minute as a hair or mustard seed; expanded, it pervades the myriad things. It may be revered but not intimately approached—this demonstrates its loftiness. It may be observed but not fathomed—this demonstrates its numinosity. Unceasing throughout the day, never losing its subtlety—this is the essence of Qian!\n\nIts hexagram is ☰. For those who cultivate qi over time and abide in Qian, their virtue and power are firmly established. Heaven and Earth transform and give birth to the myriad things; following their transformations, one likewise nurtures change. One must act in accordance with the time, drawing in singly and receiving it. That which is received is called the Azure Dragon. The first yang begins its journey, its strength still subtle, unable to transform. It extends its position, and the noble man endures hardship while awaiting its盛ness. As the *Book of Changes* says: *\"The first nine: The hidden dragon—do not act.\"* \"Do not act\" means it is not yet time to act.\n\nDrawing it again and extending it, it arrives at the victorious ground. Yang virtue resonates and suddenly盛s, blazing forth, shining brilliantly, and settling resplendently. Its power can universally aid and occupy the central position. Positioned at the center, it harmonizes above and below in Heaven. Thus, the *Book of Changes* says: *\"The second nine: The dragon appears in the field.\"*\n\nDrawing it forth and further extending it, its image is completed. At the utmost height, without treading on doubled firmness, one cannot yet be at ease. The noble man reduces his thoughts, guards against desires and pleasures, cultivates virtue and power as his city walls, severs benevolence and righteousness as his shields and screens, is cautious in speech and secretive in pivotal matters, embodies the profound and obscure while observing the manifest. He attains the end of the time without negligence, practicing his Dao. Thus, the *Book of Changes* says: *\"The third nine: The noble man is ceaselessly active all day, vigilant in the evening as if facing danger—no blame.\"*\n\nQian originally has no name. When drawn forth and put into motion, it is imitated and symbolized; when forced and enacted, it is named after myriad things. When the single qi flows and expands, jade-like radiance surges and streams, infusing the numinous source, each governing its position. After a thousand days of work, one’s ability to transform is witnessed. Thus, the *Book of Changes* says: *\"Clouds move, rain falls, the myriad beings take form. The great light begins and ends, riding the six dragons to drive Heaven.\"* The Dao of Qian transforms, each rectifying its nature and destiny. The noble man receives its image.\n\nBefore the numinous fungus sprouts, its root is just planted. Drawing it again and extending it, yang virtue becomes盛. When one line resonates, no affair is short-lived—thus one obtains its benefit and profits the body. Having profited the body, one must firmly guard it, without indulging in idle thoughts. Thus, the *Book of Changes* says: *\"Origin is the leader of goodness; prosperity is the gathering of excellence; benefit is the harmony of righteousness; steadfastness is the trunk of affairs.\"* Here, the Dao of *origin, prosperity, benefit, and steadfastness* is complete!\n\n**Image.**\nThe *Xiang* says: *\"The hidden dragon—do not act\"*—the noble man’s Dao begins subtly. *\"The dragon appears in the field\"*—the Azure Dragon emerges from concealment, its virtue about to be employed, ascending to the cauldron. *\"Ceaselessly active all day, vigilant in the evening—no blame\"*—the Dao’s beginning becomes manifest; the warning lies in desire. *\"Proceeding to act\"*—clouds move, rain falls, the fluid qi flows together. *\"The great light begins and ends\"*—the work of a thousand days.",
      "overlap_context": "mness guiding the yielding, yin restraining yang, the noble man’s Dao harmonizes with the petty man. As the *Book of Changes* says: *\"The noble man’s radiance holds sincerity.\"* This is it. Through the rescue of \"Not Yet Completed,\" \"Completion\" is attained.\n\nThe noble man obtains emolument and secures his household;\nThe Daoist obtains blessing and secures his person.\nAs the *Book of Changes* says: *\"The topmost yang holds sincerity in drinking wine.\"* This is it.\n\n**Image.**\nThe *Xiang* says...",
      "start_char": 4295,
      "end_char": 5536,
      "start_sentence": 185,
      "end_sentence": 239,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.198768854141235,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\洞元子内丹诀.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "诀曰 君子之道始若明，勿为勿用不勤行，一龙若再归元鼎，炳然通议达神明。 火就燥兮云从龙，响应声兮虎引风，存得谷神若不死，不放青龙驰外地。 驱唱将来人太阳，任从变化力施张， 驱逐若不动，败坏千千众。 莫炼砂，莫结汞，阴阳炭火不须弄，古来破却千万家，尽见神仙不迎送。 迎有方，送有位，安稳金房陈宝器。 陈宝器，须得地，安排龙虎要依位。 不教水火性不和，是人必得乾元利。 坤宫篇第八 天地之道，莫大於阴阳，阴极以荡，必阳以御之； 阳盛於刚，必阴以伏之。 御伏既定，龙虎自安，而能守厥位自固。 故天地德合，日月配，四时序理，鬼神吉凶而偶者，道机之大也。 夫坤之道能顺尔，柔顺自守，万物以生，贞利自保，万物以成。 其卦得＝一，坤者顺也，柔顺之道，保以成体，然后利贞。 夫炼炁者，必以时取之，按而饵之，使天地之道，寒暑弗愆。 寒暑弗愆则百事久顺，天之道和而合之，然后保大保久，故象谓顺承，天休德合，无疆之类也。 始以微阴用事，次以成阴见理，自潜及着，德合太真，君子用之，吉无不利。 故《象》谓君子德厚载物，初九履霜坚冰至之类是也。 黄锺之炁，总而集之，能悦四体。 四体既睦，其道也嘉，故《象》谓地道也光，六三含章。 又曰黄裳元吉。 先天而后地，纳诸鼎器，二炁既交，精炁浑溢，阴极而阳制，故《象》曰：龙战于野，其血玄黄。 类象。 象曰",
      "translated_text": "**Oral Formula says:**\nThe noble one’s Dao begins as clarity—\nDo not act, do not employ, nor strive in practice.\nIf the single dragon returns again to the primal cauldron,\nLuminous and penetrating, discourse reaches the numinous.\n\nFire seeks dryness as clouds follow the dragon,\nEcho answers sound as wind attends the tiger.\nPreserve the Valley Spirit—if it does not die,\nThe Azure Dragon shall not gallop to foreign lands.\n\nDrive and chant, summoning it into the Great Yang,\nAllowing transformations to unfold by their own power.\nIf the driving and expelling do not move,\nTen thousand hosts shall fall to ruin.\n\nRefine no cinnabar, bind no mercury,\nNor meddle with yin-yang’s charcoal and fire.\nSince ancient times, countless households have been undone—\nAll saw immortals, yet none received their welcome or send-off.\n\nWelcome has its method, send-off its place;\nSecure the golden chamber, array the precious vessels.\nArray the precious vessels—ground them well,\nArrange dragon and tiger according to their stations.\nDo not let water and fire’s natures fall out of harmony,\nFor such a one shall surely gain the *qian*-origin’s benefit.\n\n**Hexagram *Kun*’s Chapter, the Eighth**\nOf heaven and earth’s Dao, none is greater than yin and yang.\nWhen yin reaches its extreme and surges, yang must govern it;\nWhen yang waxes in hardness, yin must subdue it.\nOnce governance and submission are settled,\nDragon and tiger find peace, and their positions become firm.\n\nThus, heaven and earth’s virtues unite, sun and moon pair,\nThe four seasons follow their order, ghosts and spirits align in fortune or misfortune—\nSuch is the greatness of the Dao’s mechanism.\nThe Dao of *Kun* is to comply and yield,\nSoftly submitting and guarding itself, giving birth to the myriad things.\nPreserving integrity and benefit, bringing the myriad things to completion.\n\nIts hexagram is formed thus: *Kun* means compliance.\nThe Dao of soft compliance preserves and completes the body,\nThen integrity and benefit follow.\nFor those who refine *qi*, it must be gathered in season,\nPressed and ingested, so that heaven and earth’s Dao\nNeither errs in cold nor heat.\nWhen cold and heat do not err, all affairs endure in harmony.\nHeaven’s Dao unites in accord, then preserves the great and endures long—\nThus the *Xiang* says: *\"Complying and receiving, heaven’s resting virtue unites,\"*\nAn unbounded kind.\n\nAt first, subtle yin takes charge;\nNext, mature yin reveals its pattern.\nFrom concealment to manifestation,\nVirtue unites with the Grand Real—\nThe noble one who employs it meets with unbroken fortune.\nThus the *Xiang* says: *\"The noble one’s virtue is thick, bearing all things,\"*\nAs in *\"Treading frost, firm ice approaches.\"*\n\nThe *qi* of Yellow Bell, gathered and concentrated,\nDelights the four limbs.\nWhen the four limbs are harmonious, its Dao is excellent—\nThus the *Xiang* says: *\"The earth’s Dao shines,\"* and *\"Six in the third: containing brilliance.\"*\nIt also says: *\"Yellow skirts—supreme fortune.\"*\n\nBefore heaven and after earth, receive it in the cauldron.\nWhen the two *qi* have merged, essence and *qi* overflow in abundance.\nYin reaches its extreme, and yang restrains it—\nThus the *Xiang* says: *\"Dragons battle in the wilds, their blood dark and yellow.\"*\n\n**Image.**\nThe *Xiang* says:",
      "overlap_context": ".**\nThe *Xiang* says: *\"The hidden dragon—do not act\"*—the noble man’s Dao begins subtly. *\"The dragon appears in the field\"*—the Azure Dragon emerges from concealment, its virtue about to be employed, ascending to the cauldron. *\"Ceaselessly active all day, vigilant in the evening—no blame\"*—the Dao’s beginning becomes manifest; the warning lies in desire. *\"Proceeding to act\"*—clouds move, rain falls, the fluid qi flows together. *\"The great light begins and ends\"*—the work of a thousand days.",
      "start_char": 5537,
      "end_char": 6105,
      "start_sentence": 240,
      "end_sentence": 265,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.965333223342896,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\洞元子内丹诀.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "顺承天休，阴德阳也，履霜坚冰，自微而着者也。 六三含章，土德之厚者也。 玄黄之血，天地之精炁者也。 故《易》谓玄黄者，天地之杂，天玄而地黄，厥道昭矣！ 诀曰 黄婆有女颜如金，未见良媒不称心，守贞有志同冰玉，张三李四莫相侵。 天王有子年方盛，先在中宫施德政，因循独步出他门，便解金环为永定。 永定必期功千日，门户光华家道出，子孙生得胜爷娘，才离胞胎便巾栉。 兑艮二宫篇第九 兑者，悦也，刚中柔外，顺天以应。 人三日哉！ 生魄，阳王而阴微，故行炁者，必以时抽青龙於高宫，纳数惟九，增阴炁之不足。 阴微厥位，命阳以补之，其卦得兑，止於月圆，必住其补，补之若过，阴阳失道。 十六曰阴盛，阳不足，行炁者必以时抽白虎於坎宫，纳数在七，以补阳炁，阴盛而阳劣，故其卦得艮， 艮者，止也。 止必以时，时行则行，时止则止。 君子之道，盈虚消息备矣！ 艮其为山，兑其为泽，山泽之象，於此明矣！ 先兑而后艮，故其卦得 ，损之为义大矣哉！ 行炁之道，止於此者，功将毕焉！ 损上而益下，灭存而生之也。 凡纳气者，每月前后各三日，住行其炁，谓之灭没，以应天时也，斯谓至道。 诀曰 阳炁微而运青龙，一九初生自有功，阳炁王时增白虎，三四之功爰有度。 阴阳衰，有常规，圣人知者自补之，补之至道复如何，前三后三须要忌， 修持若不顺天时，亦与凡夫无别异。 安排次第须依位，若失分毫差大事。 不知位，莫妄夸，千万行之徒破家。 变象篇第十 六爻动发，八卦是生，八卦震荡，吉凶县是着矣！ 君子观炁象，审变化，其能脱乎！ 故先火而后水者，得乎既济； 先水而后火者，得乎未济； 先离而后乾者，得乎天火 。 天火之象，《易》曰同人，君子能通天下之志也。 先玄武而后白虎者得乎地水 ，地水之象，《易》曰师贞。 达师贞者，承天之宠也。 反而视之，其象各异。 行坎离，毕於九月，续坎离亦如之。 夹坎离如之，乘龙虎於三月，然后易矣！ 洞元子内丹诀卷上竟 洞元子内丹诀卷下",
      "translated_text": "Upholding the blessings of heaven, yin’s virtue is yang—\nTreading frost, firm ice approaches, from the subtle to the manifest.\nSix in the third contains brilliance, the thickness of earth’s virtue.\nDark and yellow blood—essence and *qi* of heaven and earth.\nThus the *Yi* says: *\"Dark and yellow—heaven and earth intermingled,\"* for heaven is dark and earth is yellow, and their Dao is luminous!\n\n**Formula:**\nYellow Matron has a daughter, her face like gold,\nYet without a worthy matchmaker, her heart finds no peace.\nVigilant in chastity, her resolve pure as ice and jade,\nLet Zhang San or Li Si dare not trespass.\n\nThe Heavenly King has a son, in his prime of years,\nFirst abiding in the central palace, enacting virtuous governance.\nFollowing the path, he strides forth from another gate,\nThen unties the golden ring to secure eternal stability.\nEternal stability demands a thousand days of effort—\nThe household’s radiance and prosperity shall emerge.\nChildren born surpass their parents,\nScarcely parted from the womb, they are already robed and combed.\n\n**Hexagrams *Dui* and *Gen*, Ninth Chapter**\n*Dui* is joy—firm within, yielding without, aligning with heaven in response.\n*\"O man, three days!\"*\nAt the waxing moon, yang flourishes while yin wanes.\nThus the practitioner of *qi* must, in due season, draw the Azure Dragon from the lofty palace,\nAbsorbing the number nine to augment yin’s insufficiency.\nWhen yin wanes in its position, summon yang to replenish it—\nIts hexagram is *Dui*, halting at the full moon.\nOne must cease replenishment then,\nFor over-replenishment disrupts the balance of yin and yang.\nAt sixteen, yin prevails and yang is deficient—\nThe practitioner must, in due season, draw the White Tiger from the *Kan* palace,\nAbsorbing the number seven to replenish yang’s *qi*.\nWhen yin prevails and yang is weak, its hexagram is *Gen*—\n*Gen* is stillness.\nStillness must be timely: when it is time to act, act; when it is time to halt, halt.\nThe noble one’s Dao encompasses waxing and waning, ebb and flow.\n\n*Gen* is the mountain, *Dui* is the marsh—\nThe images of mountain and marsh are here made clear.\nFirst *Dui*, then *Gen*, thus the hexagram *Sun* is obtained.\nThe meaning of *Sun* is vast indeed!\nThe Dao of *qi*-practice concludes here—\nThe work nears completion.\nDiminishing above to augment below,\nExtinguishing to preserve and engendering anew.\n\nFor all who absorb *qi*,\nThree days before and after each month, cease the circulation of *qi*—\nThis is called *\"extinction,\"* aligning with heaven’s timing.\nThis is the supreme Dao.\n\n**Formula:**\nWhen yang’s *qi* wanes, move the Azure Dragon—\nAt one and nine, the initial work bears fruit.\nWhen yang’s *qi* flourishes, augment the White Tiger—\nThe work of three and four follows measure.\nYin and yang decline—there are constant rules.\nThe sage who knows them replenishes accordingly.\nHow to replenish with the supreme Dao?\nThree days before and after—heed the prohibition.\nIf cultivation does not follow heaven’s timing,\nIt differs not from the common folk.\nArrange the sequence and adhere to the positions—\nA deviation by even a hair’s breadth spells great error.\nWithout knowing the positions, do not boast idly—\nA thousand efforts will but ruin the household.\n\n**Chapter on Transforming Images, Tenth**\nWhen the six lines move, the eight trigrams arise;\nWhen the eight trigrams surge, good and ill fortune hang in the balance.\nThe noble one observes the images of *qi* and examines their transformations—\nHow can he escape their sway?\n\nThus, fire first and water after yields *Jiji*;\nWater first and fire after yields *Weiji*;\n*Li* first and *Qian* after yields *Heavenly Fire*.\nThe image of *Heavenly Fire*—the *Yi* says *Tongren*,\nThe noble one who unites the aspirations of all under heaven.\n\nFirst *Xuanwu* and then the White Tiger yields *Earthly Water*.\nThe image of *Earthly Water*—the *Yi* says *Shi Zhen*.\nHe who attains *Shi Zhen* receives heaven’s favor.\nReversed, the images differ.\n\nPracticing *Kan* and *Li* concludes in the ninth month;\nContinuing *Kan* and *Li* follows likewise.\nAlternating *Kan* and *Li* in like manner,\nRiding the Dragon and Tiger in the third month—\nThen the transformation is complete!\n\n*Dongyuanzi’s Inner Alchemy Formula, Volume One—Concluded*\n*Dongyuanzi’s Inner Alchemy Formula, Volume Two*",
      "overlap_context": "When the four limbs are harmonious, its Dao is excellent—\nThus the *Xiang* says: *\"The earth’s Dao shines,\"* and *\"Six in the third: containing brilliance.\"*\nIt also says: *\"Yellow skirts—supreme fortune.\"*\n\nBefore heaven and after earth, receive it in the cauldron.\nWhen the two *qi* have merged, essence and *qi* overflow in abundance.\nYin reaches its extreme, and yang restrains it—\nThus the *Xiang* says: *\"Dragons battle in the wilds, their blood dark and yellow.\"*\n\n**Image.**\nThe *Xiang* says:",
      "start_char": 6105,
      "end_char": 6918,
      "start_sentence": 266,
      "end_sentence": 306,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.785441875457764,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\洞元子内丹诀.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "水火篇第十一 龙虎成象功毕，九十日尽，即安神定意，寂守空室，瞪目固躬，驱逐水火，意散而止。 诀曰 金乌飞入月官来，阳焰炎炎意不回。 如奔兔入高宫去，秋水一轮流不瀑。 换头改面人不知，施张造化遗巡时。 男子化为真女子，女儿变作丈夫儿。 就中此事多颠倒，阴阳变换却为道。 坎家女子便衣黄，离舍儿郎翻着皂。 男子烧炼得黄金，举动分明自称心。 女儿心头冻便喜，不摇扇坐绛纱阴。 谁为离宫无变作，阳爻发动投珠阁。 体象分明立是乾，谁人敢道阴阳错。 孰谓离宫纯贮水，水性圆流无定止。 近阳则热近水寒，柔顺性情难可比。 从此天地生黄芽，黄芽自发黄金葩。 若能收拾永为业，但知满满载河车。 河车还得归君处，任是饥年不困度。 只由自己生子孙，莫认他人为父母。 焚魔篇第十二 魔者，五谷之聚毒也，每五日一度，自坎官起，止於离，炽然四出，焰诸五毒。 诀曰 四时节候常须避，自有火居深海底，阳焰炎炎透水明，不运无能成大事。 倏然突出玄泉去，龙若行时虎避路，奔驰直入太阳宫，炎汉当时火得聚。 会合离兵举戈戟，丹田纵牛千万只，魔王束手自归降，片时焚尽三尸域。 何人独守其中坐，密把鬼关牢闭锁，直教焚着天地涯，万物无由能盗我。 万物盗人人数至，他人将侵己田地，慎须守护莫教耕，耕破无因作活计。 审须探候莫差错，三朝五日先计度，的的若还待夺来，便教发火热成灰。 三焚若是终不去，自家别觅飞腾路。 交选篇第十三 交遘者，相遇也，谓真龙真虎以时相遇，故曰遘。 凡龙虎交遘日，必与元火日相避，亦与天地节候日违之。 诀曰 青龙久居南岳里，白虎翻藏北海底，天符若不下天催，只倚嵌崆石壁睡。 帝君有命垂丹招，抖擞鳞医离古道，裂破阴云放电光，全角低昂日争耀。 顺天左转投旸谷，朋霞锁断黄金屋，叱他白虎出玄宫，微微一笑生清风。 清风当右旋，直入火城裹，城中事不烦，且要诤安止。 如是使三回，行时弗急催，龙虎若能役，已是神仙才。 元火篇第十四 火非离火也，坎户有之，肾为一体之宗，人败之则灭其身，故曰元。 坎内阳而外阴，故曰元火。 是以圣人积其火，而温其室，使万神咸安其居，室不焕则万神得而去之也。 其能任而运者，即毕矣！ 诀曰 四时首有王相日，子后先排离坎毕，开却南方大火城，城中有泉甘如蜜。 一杯澄彻深元底，养得金乌不老死，何人特为决沙堤，教放通流舟可楫济。 崩奔一注朝元首，惊他玉兔狼忙起，避却罟碍直出脐，倒入阴关过九里。 逢着泥丸犹不住，直见苍华方回去，烘然遍满天地问，谆得群魔走元处。 俄然一众秋毫中，一一依资归绛宫，蟾蛉飞入明月去，金乌却上白日中。 沐浴篇第十五 修炼之士，必洁其身。 洁其身者，元尚於沐浴，沐浴者，非尘世香水之谓欤！ 神仙之倡，必非水而焉能净诸！ 故非水之水，是真水也。 真水之源，其振甚微，庾而用之，历劫莫尽，贮之秋毫不能盈，包天地不能备，故用之者非圣贤，必溺诸！ 诀日 金乌飞翕未乃午，安排坎卦须依叔，然后决乎北海泉，直使玉蟾乾处住。 波涛汹涌注南蛮，陷却千山与万山，玲泻秋天月一轮，攻人肌骨森森寒。 冲动南方丙丁火，不敢依城安稳坐，驾得金轮奔月宫，来结蟾蛛权且过。",
      "translated_text": "**Chapter Eleven: Water and Fire**\n\nWhen the Dragon and Tiger have formed their images and ninety days have passed, settle the spirit and calm the intent, silently guarding the empty chamber. Gaze fixedly and hold the body firm, driving away water and fire until the intent scatters and ceases.\n\nThe formula says:\nThe Golden Crow flies into the Moon Palace,\nYang flames blaze fiercely, the intent unwavering.\nLike a bounding hare entering the high palace,\nA single wheel of autumn water flows without cease.\nExchanging heads and altering faces, none know,\nAs creation’s transformations unfold in their time.\nMen transform into true women,\nDaughters become sons of men.\nWithin this, matters are often inverted—\nThe exchange of yin and yang is the Dao.\n\nThe Kan maiden dons yellow robes,\nThe Li lad reverses to black.\nMen refine and obtain yellow gold,\nTheir every movement clearly content.\nThe maiden’s heart, once frozen, now rejoices,\nSitting in the shade of crimson gauze without fanning.\nWho in the Li Palace remains unchanged?\nThe yang line stirs and casts itself into the Pearl Pavilion.\nThe form and image stand clearly as Qian—\nWho dares say yin and yang are mistaken?\n\nWho claims the Li Palace stores only water?\nWater’s nature flows in circles without fixed abode.\nNear yang, it grows hot; near water, cold—\nIts gentle, compliant nature is beyond compare.\nFrom this, heaven and earth birth the Yellow Sprout,\nThe Yellow Sprout itself blooms as golden blossoms.\nIf one can gather and refine it as a lifelong practice,\nKnow only fullness, loading the River Chariot.\nThe River Chariot returns to its master’s place,\nEven in famine, one suffers no hardship.\nOnly by giving birth to one’s own descendants,\nNever mistake others for father and mother.\n\n**Chapter Twelve: The Burning of Demons**\n\nDemons are the toxins gathered from the five grains. Every five days, they arise once from the Kan Palace, halting at Li, flaring forth in all directions to spread their five poisons.\n\nThe formula says:\nThe seasons’ nodes must always be avoided.\nFire naturally dwells in the depths of the sea,\nYang flames blazing, piercing water’s clarity—\nWithout movement, nothing great can be achieved.\nSuddenly surging forth from the Dark Spring,\nWhen the Dragon moves, the Tiger yields the path.\nRushing straight into the Palace of Great Yang,\nThe fiery Han gathers its flames in that moment.\nThe Li troops unite, raising spears and halberds,\nTen thousand oxen charge through the Cinnabar Field.\nThe Demon King surrenders, hands bound,\nIn an instant, the Three Corpses’ realm is burned away.\n\nWho sits alone within?\nSecretly sealing the Ghost Pass with a firm lock,\nBurning to the ends of heaven and earth—\nNo being can steal from me.\nAll things steal from man in countless ways,\nOthers encroach upon his fields.\nGuard and protect them, never let them be tilled—\nOnce broken, there is no means to sustain life.\n\nCarefully observe and await the moment without error.\nPlan three days or five in advance.\nIf they clearly intend to seize what is yours,\nStrike with fire and reduce them to hot ashes.\nIf three burnings fail to drive them away,\nSeek another path to soar aloft.\n\n**Chapter Thirteen: The Meeting**\n\nThe meeting (*jiaogou*) is an encounter, where the true Dragon and true Tiger meet in their time—hence *gou*.\n\nOn the day the Dragon and Tiger meet, one must avoid the Primordial Fire day and also the days of heaven and earth’s seasonal nodes.\n\nThe formula says:\nThe Azure Dragon lingers long in the Southern Marchmount,\nThe White Tiger hides deep in the Northern Sea.\nIf the Heavenly Talisman does not descend to urge them,\nThey rest, nestled in the cliffs of the hollow peaks.\nThe Lord Emperor issues a decree, extending a cinnabar summons—\nShaking off their scales and wings, they leave the ancient path.\nBreaking through the yin clouds, they release lightning,\nTheir full horns rise and fall, vying with the sun’s brilliance.\nFollowing heaven’s leftward turn, they rush to the Yang Valley,\nThe rosy clouds lock away the Yellow Gold Chamber.\nCommanding the White Tiger to emerge from the Dark Palace,\nA faint smile stirs a pure breeze.\n\nThe pure breeze circles to the right,\nEntering straight into the Fire City.\nWithin the city, affairs are unburdened—\nFirst, seek peace and stillness.\nThus it is done thrice,\nMoving without haste.\nIf Dragon and Tiger can be mastered,\nOne is already a divine immortal.\n\n**Chapter Fourteen: Primordial Fire**\n\nFire is not the fire of Li—it resides in the Kan gate. The kidneys are the root of the body’s unity; if one harms them, the body perishes—hence it is called *primordial*.\n\nKan is yang within and yin without—thus it is called *Primordial Fire*.\nTherefore, the sage accumulates this fire,\nWarming the chamber so the myriad spirits all settle in their abodes.\nIf the chamber does not glow, the myriad spirits depart.\nThose who can bear and move it—it is complete!\n\nThe formula says:\nThe four seasons begin with their flourishing days.\nAfter midnight, first arrange Li and Kan,\nOpening the great Fire City of the south—\nWithin the city, a spring sweet as honey.\nA cup, clear to the profound depths,\nNurtures the Golden Crow to avoid old age and death.\nWho would deliberately breach the sand dike,\nAllowing the current to flow freely so boats may cross?\n\nCollapsing in a rush toward the Primordial Head,\nStartling the Jade Hare into hasty flight.\nAvoiding the nets and snares, it bursts straight from the navel,\nPlunging into the Yin Pass, traversing nine li.\nMeeting the Muddy Pellet, it still does not stop,\nOnly upon seeing the Azure Flower does it turn back.\nSuddenly, warmth fills all under heaven—\nThe myriad demons flee to their origins.\n\nIn an instant, within the autumn down,\nEach returns according to its rank to the Crimson Palace.\nThe toad flies into the bright moon,\nWhile the Golden Crow ascends the white sun.\n\n**Chapter Fifteen: Bathing**\n\nThose who cultivate and refine must purify their bodies.\nTo purify the body, nothing surpasses bathing.\nBathing is not the fragrant waters of the mundane world!\nThe immortals’ song declares: without water, how can one be cleansed?\nThus, the water that is not water is true water.\n\nThe source of true water is exceedingly subtle.\nStored and used, it lasts through kalpas without end.\nHeld in an autumn hair’s tip, it cannot be filled;\nEncompassing heaven and earth, it cannot be contained.\nThus, those who use it—unless they are sages—will surely drown!\n\nThe formula says:\nThe Golden Crow flies swiftly before noon,\nArranging the Kan trigram as the uncle commands.\nThen, release the Northern Sea’s spring,\nForcing the Jade Toad to dwell in the dry place.\nWaves surge, pouring into the southern lands,\nEngulfing a thousand mountains and ten thousand peaks.\nA single wheel of autumn moon cascades through the sky,\nAssailing the flesh and bones with piercing cold.\n\nStirring the southern *bing ding* fire,\nIt dares not rest securely within the city.\nRiding the golden wheel, it rushes to the Moon Palace,\nComing to join the toad spider for a time.",
      "overlap_context": "ger yields *Earthly Water*.\nThe image of *Earthly Water*—the *Yi* says *Shi Zhen*.\nHe who attains *Shi Zhen* receives heaven’s favor.\nReversed, the images differ.\n\nPracticing *Kan* and *Li* concludes in the ninth month;\nContinuing *Kan* and *Li* follows likewise.\nAlternating *Kan* and *Li* in like manner,\nRiding the Dragon and Tiger in the third month—\nThen the transformation is complete!\n\n*Dongyuanzi’s Inner Alchemy Formula, Volume One—Concluded*\n*Dongyuanzi’s Inner Alchemy Formula, Volume Two*",
      "start_char": 6918,
      "end_char": 8264,
      "start_sentence": 307,
      "end_sentence": 365,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.82585024833679,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\洞元子内丹诀.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "遗巡骇浪出秋毫，渺弥无际涨波涛，青龙自镇元阳海，孰敢持竿钓巨鳌。 真人自向其中浴，钳发童颜眉更绿，为是平生好洁身，尽日浮沉都不足。 离宫浑是水，坎室却纯阳，造化一何变，天地能弛张。 孰留此毕术，龙虎非久潜，只销一粒药，倒女却成男。 母子篇第十六 子非母弗育，母非子弗守，育不以道失其母，守不以寂失其子。 苟子母聚而不散，道为至矣！ 诀曰 三魂与七魄，尽在人身中，唯神与其意，二要互相通。 保之弗使散，大道之始终，子母若团圆，蛇焉不作龙。 抱元守一篇第十七 自古圣贤得道者，皆自此而出，得其道未尽者，咸想脱之谓也。 即今之释子，安禅入定坐化者，皆明道得其至要者，谓之阴脱，即今之道士尸解之类也。 修此秘道，成有关键，其诀在口。 诀日 抱元不迁要道全，抱元得迁定可仙，守一不失万事毕，我命在我不在天。 丹田有物炎如火，淡然滋味甘如蜜，但能冥守不参差，一日精妍胜一日。 时迁彼位来绛宫，往来车马自相通，有时亲附谷神来，出入天地玄门中， 初时一步至两步，十步百步旋如风，一里二里不行到，百里千里去无踪。 出时门户关键了，重重卦记无草草，盗贼兴心欲劫时，千里之中须便到。 世间道士无轻忽，莫将己物为他物，宫宅如能修补全，自在其中入或出。 渲数篇第十八 人晚悟道修炼者，修炼未成，历数未至，必无能免乎死而飞仙矣！ 苟知数至，而能这诸，已为地仙，然后可以修长生冲霄之道。 诀日 世人寿命有长短，大数看看朝夕满。 神光若去门户炁，发火三焚焚不转。 然知数至必须逃，静定玄关至在牢。 目前多见神仙倡，或曳朱巾佩绛销。 手持太上玄元动，谦辞苦苦来相邀。 更说冲天诸种事，共子身同上九霄。 或有此言终勿听，或欲同行慎勿争。 但知闭在朱门首，称向玄宫安大静。 游神千里隔关山，侍伊去后来相看。 游神去后有神呎，呎自仙师付金口o 神光篇第十九 近代道士采诸俗之说，后神光者，必手刻乎目訾，自见焉！ 斯咸非也。 夫道出自然，何必力求，力求得者，不名道德也。 但於五更鹦呜已前，面束正坐，暝目息虑於无明处，伺之片时，其神光自至。 运日月之象，或类灯烛之光，上下旋回，没而复出，候之久久，暝目则至。 或伺之三日，不至者，人数至焉！ 宜急这也。 诀日 但知瞑目居玄室，半夜子时多便出。 或如电影突然来，似逐流波浮又没。 或如日月耀荧煌，或若灵珠炫五光。 炳然万物皆可睹，半白半红填洞房。 或若不来人数至，急锁门庭且回避。 远去名山旧隐藏，莫逐张三并李四。 菱花切在频频照，认取神仙须缕细。 左旋右转往来熟，便见乔林蝉自蜕。 斯言不尽世人迷，尽言还恐泄天机。 莫言修炼无门户，自是神仙有路岐。 总要篇第二十 修卦庶爻，风雨不行，风雨过而后作坎离二卦，晦日弗卜卦，终一十二爻，布三｀十六是也。 坎离九月续水火，又有九月兼坎离，成既济未济，又九月正乾坤，三月道若，就居玄室，百日而成。 总而计之，千日备矣！ 夫色败之士，亦千日不可以补之，必久久行之，以填阳关。 坎一阳而二阴也，火生於水，其道自然。 人嗜欲者，竭乎一阳，一阳力尽矣，人至於死。 故必命元和之炁以补焉！",
      "translated_text": "The lingering waves surge forth from an autumn hair’s tip,\nVast and boundless, swelling into towering billows.\nThe Azure Dragon naturally guards the Primordial Yang Sea—\nWho dares cast a rod to hook the giant turtle?\n\nThe Perfected One bathes within,\nTaming his hair, his youthful face, his brows ever green.\nFor he has loved purity all his life,\nAnd finds no satisfaction in floating or sinking all day.\n\nThe Palace of Li is all water,\nWhile the Chamber of Kan is pure yang.\nHow wondrous the transformations of creation—\nHeaven and earth expand and contract!\n\nWho preserves this esoteric art?\nDragon and tiger do not long remain hidden.\nA single grain of medicine is all it takes—\nThe woman is inverted and becomes a man.\n\n**Chapter Sixteen: Mother and Child**\nThe child is not nurtured without the mother,\nThe mother is not preserved without the child.\nIf nurturing loses the Way, the mother is lost;\nIf preserving loses stillness, the child is lost.\nShould mother and child gather and never scatter,\nThe Dao is perfected!\n\nThe formula says:\nThe three hun and seven po\nAll reside within the human body.\nOnly spirit and intent,\nThese two must mutually communicate.\nPreserve them, lest they scatter—\nThis is the beginning and end of the Great Dao.\nIf mother and child unite as one,\nHow could the serpent fail to become a dragon?\n\n**Chapter Seventeen: Embracing the Origin and Guarding the One**\nSince ancient times, all sages and worthies who attained the Dao\nEmerged from this path.\nThose who attained the Dao yet did not fully master it\nAll longed to cast off the mortal form—this is what they meant.\nEven today’s Buddhist monks,\nWho enter samadhi and sit in transformation,\nHave all understood the Dao and grasped its essence—\nThis is called \"yin liberation,\" akin to the Daoist \"corpse liberation.\"\n\nTo cultivate this secret Dao, there is a crucial key,\nAnd its formula lies in the mouth.\n\nThe formula says:\nEmbrace the Origin without deviation, and the Dao is complete;\nEmbrace the Origin and deviate, and immortality is assured.\nGuard the One without losing it, and all matters are fulfilled—\nMy life is in my hands, not in Heaven’s.\n\nWithin the Cinnabar Field, there is a thing fiery as flame,\nIts flavor bland yet sweet as honey.\nSimply abide in profound stillness without wavering,\nAnd day by day, your essence will grow more radiant.\nWhen the time comes, shift to the Crimson Palace,\nWhere carriages and horses naturally come and go.\nAt times, the Valley Spirit draws near,\nEntering and exiting through the Mysterious Gate of heaven and earth.\n\nAt first, one step, then two,\nTen steps, a hundred, swirling like the wind.\nOne *li*, two *li*—yet you do not walk to reach them,\nA hundred *li*, a thousand—gone without a trace.\nWhen exiting, the gates and barriers are secured,\nLayer upon layer of hexagrams are recorded without carelessness.\nIf thieves harbor ill intent to plunder,\nYou will arrive within a thousand *li* in an instant.\n\nDo not take worldly Daoists lightly—\nDo not mistake your own treasure for another’s.\nIf you can fully repair your palaces and dwellings,\nYou will enter and exit freely within them.\n\n**Chapter Eighteen: Destiny and Calculation**\nThose who awaken to the Dao and cultivate late,\nIf their cultivation is incomplete and their destined time has not arrived,\nCannot escape death to ascend as flying immortals.\nYet if they know their destined time has come and can evade it,\nThey become earthbound immortals—\nOnly then can they cultivate the Dao of ascending to the heavens.\n\nThe formula says:\nThe lifespans of mortals vary in length,\nBut the great destiny draws near day and night.\nIf the spirit’s light departs from the gate of qi,\nThe fire of the three burnings will not turn back.\n\nKnowing the destined time has come, one must flee—\nIn profound stillness, the Mysterious Pass is firmly secured.\nBefore your eyes, many claim to be immortals,\nSome trailing vermilion sashes and wearing crimson pendants,\nHolding the *Taishang Xuanyuan* talismans,\nHumbly entreating you to join them.\nThey speak of ascending to the heavens in various ways,\nInviting you to rise with them to the Ninth Heaven.\n\nIf they speak thus, do not listen;\nIf they wish to accompany you, be cautious and do not contend.\nSimply know to close yourself within the vermilion gate,\nAnd declare to the Mysterious Palace: \"I seek great stillness.\"\nLet your spirit wander a thousand *li* beyond mountains and passes,\nWaiting for them to depart before returning to observe.\nAfter the spirit departs, a divine breath remains—\nThis breath was bestowed by the immortal master’s golden mouth.\n\n**Chapter Nineteen: The Spirit Light**\nModern Daoists adopt vulgar notions,\nClaiming that to perceive the spirit light,\nOne must gouge the eyes with one’s hands—\nThis is all incorrect!\n\nThe Dao arises naturally;\nWhy forcefully seek it?\nWhat is obtained through force\nCannot be called the Dao or virtue.\n\nSimply sit facing east before the fifth watch’s rooster crows,\nClose your eyes, still your thoughts, and abide in the realm of no-light.\nWait for a moment, and the spirit light will arrive of its own accord.\nIt may resemble the images of the sun and moon,\nOr the light of a lamp or candle,\nSpiraling up and down, vanishing and reappearing.\nWait patiently, and with closed eyes, it will come.\nIf after three days it does not arrive,\nYour destined time has come—\nHasten to evade it!\n\nThe formula says:\nSimply know to close your eyes and dwell in the Mysterious Chamber;\nAt midnight or the hour of *zi*, it will often emerge.\nSometimes like lightning, it suddenly appears,\nChasing the flowing waves, floating and sinking.\nSometimes like the sun and moon, it blazes brilliantly,\nOr like a divine pearl, it dazzles with fivefold light.\nIlluminating all things clearly,\nHalf white, half red, it fills the Grotto Chamber.\n\nIf it does not come and your destined time arrives,\nSwiftly lock your gates and retreat.\nFlee to distant mountains and old hermitages,\nDo not follow Zhang San or Li Si.\nThe magic mirror must be frequently consulted—\nDiscern the immortal’s threads with care.\nLeft-spinning, right-turning, growing familiar with its comings and goings,\nYou will witness the lofty forest where the cicada sheds its husk.\n\nThese words are not exhaustive, yet mortals remain deluded.\nTo speak fully would risk leaking heavenly secrets.\nDo not say cultivation has no gate—\nIt is only that immortals have their own paths and forks.\n\n**Chapter Twenty: The Essential Summary**\nWhen cultivating the hexagrams and their lines,\nWind and rain do not act.\nAfter wind and rain pass, then enact the hexagrams Kan and Li.\nDo not divine on the dark moon;\nComplete the twelve lines,\nAnd arrange the thirty-six.\n\nKan and Li continue for nine months with water and fire,\nThen nine months combining Kan and Li,\nForming the *jiji* and *weiji* hexagrams.\nAnother nine months rectify Qian and Kun,\nThree months for the Dao’s transformation—\nSeclude yourself in the Mysterious Chamber,\nAnd in a hundred days, it is accomplished.\nIn total, a thousand days are required!\n\nFor those whose vitality is depleted by sensual indulgence,\nEven a thousand days cannot restore it—\nOne must practice for a long, long time\nTo replenish the Yang Barrier.\n\nKan is one yang and two yin,\nFire is born from water—\nThis is the natural Dao.\nThose who indulge in desires\nExhaust their single yang.\nWhen the single yang’s power is spent,\nA person approaches death.\nThus, one must supplement it with the qi of original harmony!",
      "overlap_context": " the uncle commands.\nThen, release the Northern Sea’s spring,\nForcing the Jade Toad to dwell in the dry place.\nWaves surge, pouring into the southern lands,\nEngulfing a thousand mountains and ten thousand peaks.\nA single wheel of autumn moon cascades through the sky,\nAssailing the flesh and bones with piercing cold.\n\nStirring the southern *bing ding* fire,\nIt dares not rest securely within the city.\nRiding the golden wheel, it rushes to the Moon Palace,\nComing to join the toad spider for a time.",
      "start_char": 8265,
      "end_char": 9575,
      "start_sentence": 366,
      "end_sentence": 427,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.66781425476074,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\洞元子内丹诀.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "补之备，人生矣！ 且天高地卑，阴阳之道列矣！ 一动一静，刚柔之位见矣，．得类而合，得党而群，本群而分，吉凶之义彰矣，天列乎象，日月星辰也，坤设乎形，山泽草木也。 六爻互变，阴阳相交，风雨以润，雷电以震，秋往春来，寒藏暑格，上下交通，日盈月反。 龙翕云逐，虎动风生，龙虎之道，可亲而不可远，可伏而不可使。 勃勃则害人，亲则可久，既久则大，既大则久，贤人之德，业备矣！ 夫圣人设易象，知存亡，是为下也。 易者变也，道至而后变，故日易象者，像也，像者，想也，想而睹之，通於神明，神明者，长生之道备矣！ 故曰象。 是故君子知进知退，知柔知刚，俾夜作昼，变阴为阳，乱居而静，安居而忙，耽而味之，乐而玩之。 动则观其神光，静则观其魂魄，不远千里，这其数也，弗瑜千日，成其功也。 故天必佑之，吉无不利尔，故谓弥纶天地之道。 仰以观乎天文，俯以察乎地理，是以知幽明之故。 原始反终，故知死生之说是也。 游魂为神，元炁为物，神物须备，物无所漏，漏则囊堕。 弗知者游魂变怪，怪言鬼尔，鬼神之状，以明失得。 失而为鬼，得而为神，随日月之精运，合龙虎之情，范天地之周备，通昼夜之幽显。 神无方而从方来，故有方也； 易无体而生乎体，故有体也。 一动一静，阴阳之道，孰、可测矣！ 生者是死，死者是生，阴阳变化，继之者昌。 圣贤之道，民日用而不知，故圣人者，资道以见之，所以谓之仁。 智者明文以见之，所以谓之智。 藏其物以待诸仁，君子盛德着矣吃故《易》谓日新之为盛德，生生之谓易是也。 居其室而知其数，以其光而察其候，上效其乾，下法於坤，乾坤之道，故能造化。 《易》谓极数知来之谓占，变通之谓事，阴阳不测之谓神是也。 动静有常时，得失有常道，得彼而失此，得此而失彼。 一昼一夜，一寒一暑，昼明而夜幽，或反之； 寒暑往来，或差之。 故日占，故曰象，故曰易，善穷者故日洞，善了者故曰玄。 广玄篇第二十一 广玄者，所以广洞玄之义也。 天地无形，而生有形，男女无象，育有象也。 资於无象故有形，资於有象，故名所以立，故强为，是谓天地，是谓男女，是谓生死。 生者，自无而得有； 死者，自有而得无。 自无而得者道也，自有而失者愚也。 愚不以道得。 知有之为有，是有也； 生，元炁未散以可教，荡而成阴阴，阴始生，阴始生全臧知无之为无有也。 故男之生也锺，凝结其形，是生九窍，备而既育，阳炁淳实，故其象得乾。 乾者健也欲未作，饮乎血好恶，触之则慎怒，工贾之利纯阳之炁。 凡人始固关未开，守乎一纯其神尔！ 至於十岁随见以可立。 文武之道推而得之旨，其卦得遘。 遘者，遇也北方之首也力未壮也强豭五阳也遇将荡其身冠裳所被，所蛊，志有於室二阳俱遁故《易》谓君不知无之为一阳肇降，四熙爰贪爱未生六爻不荡玩之则戏乐礼乐所拘口爽滋味合有故淫应变系之故初九一阳初败，势始归其位曰亥。 亥之故《易》赢豕遇强豭赢豕一阴也淫欲之道将萌 天下有山，遁将缺其健，合？ 人止此一，其进众豭，而遇乎害也。 至於弱冠婚媾所役，故其卦得遁。 遁者，嫉拓退也，谓阴炁方长，阳未子以远小人是也。",
      "translated_text": "When supplementation is complete, a person is reborn!\n\nNow, heaven is high and earth is low—thus the Dao of yin and yang is arrayed. In every movement and stillness, the positions of firmness and softness appear. Like attracts like, kindred spirits gather, and from this gathering comes division—thus the principles of fortune and misfortune are made manifest.\n\nHeaven displays its images in the sun, moon, and stars; earth establishes its forms in mountains, marshes, grasses, and trees. The six lines intermingle and transform, yin and yang unite—wind and rain bring moisture, thunder and lightning strike, autumn departs and spring arrives, cold retreats and heat advances. Above and below communicate, the sun waxes and the moon wanes.\n\nDragons rise and clouds follow; tigers stir and wind arises. The Dao of dragon and tiger may be drawn near but not kept distant, may be subdued but not commanded. When they rage, they harm people; when they are intimate, they endure. Enduring, they grow great; growing great, they endure long. The virtue of the worthy is thus complete, their work perfected!\n\nThe sages established the *Yi*’s images to discern survival and decay—this is the foundation. *Yi* means change: only when the Dao reaches its utmost does transformation occur. Thus, the *Yi*’s images are likenesses, and likenesses are visions. Through vision, one perceives them, communing with spirit and illumination—where spirit and illumination abide, the Dao of long life is complete! Therefore, it is called *xiang* (image).\n\nThus, the noble person knows when to advance and when to retreat, when to be soft and when to be firm. They turn night into day, transform yin into yang, dwell in chaos yet remain tranquil, reside in peace yet stay vigilant. They immerse themselves in its flavors, delight in its wonders. In movement, they observe its divine radiance; in stillness, they examine its soul and spirit. Though a thousand miles distant, they grasp its patterns. Without a thousand days of cultivation, its achievement is not complete. Therefore, heaven must aid them—fortune will be without fail, for this is the Dao that encompasses heaven and earth.\n\nGazing upward, they observe the patterns of heaven; looking downward, they examine the principles of earth—thus they know the causes of the hidden and the manifest. Tracing beginnings to return to endings, they understand the discourse on life and death. The wandering soul becomes spirit; original *qi* becomes matter. Spirit and matter must be complete, with nothing leaking—leakage leads to the collapse of the vessel. Those who do not know this see the wandering soul as monstrous, speaking of ghosts. The forms of ghosts and spirits reveal gains and losses: losing, one becomes a ghost; gaining, one becomes a spirit. They follow the essence of the sun and moon’s movement, unite with the nature of dragon and tiger, model the completeness of heaven and earth, and connect the hidden and the manifest of day and night.\n\nSpirit has no fixed direction yet comes from all directions—thus it has direction. The *Yi* has no form yet arises from form—thus it has form. In every movement and stillness, the Dao of yin and yang—who can fathom it? Life is death, and death is life; yin and yang transform, and those who continue them flourish.\n\nThe Dao of sages and worthies is used daily by the people, yet they do not know it. Thus, the sage relies on the Dao to reveal it—this is called *ren* (benevolence). The wise illuminate it through patterns—this is called *zhi* (wisdom). They conceal its essence to await the benevolent; the noble person’s abundant virtue is thus made manifest. Therefore, the *Yi* says: \"Daily renewal is called abundant virtue,\" and \"Production and reproduction is called the *Yi*.\"\n\nAbiding in their chamber, they know its numbers; by its light, they examine its signs. Above, they emulate Qian; below, they model Kun. The Dao of Qian and Kun thus enables creation and transformation. The *Yi* says: \"To exhaust the numbers and know the future is called divination; to adapt and connect is called affairs; the unfathomable of yin and yang is called spirit.\"\n\nMovement and stillness have their proper times; gain and loss follow constant principles. Gaining this, one loses that; gaining that, one loses this. One day and one night, one cold and one heat—day is bright and night is dark, yet sometimes reversed. Cold and heat come and go, sometimes deviating. Thus, it is called *zhan* (divination), *xiang* (image), *yi* (change). Those who excel at thoroughness are called *dong* (penetrating); those who excel at completion are called *xuan* (profound).\n\n**Expansive Mystery, Chapter Twenty-One**\n*Expansive Mystery* expands the meaning of *Dongxuan* (Penetrating Mystery). Heaven and earth are formless yet give birth to the formed; male and female have no image yet nurture the imaged. Relying on the imageless, form arises; relying on form, names are established. Thus, to forcefully create is called heaven and earth, male and female, life and death.\n\nLife arises from nothing to become something; death arises from something to become nothing. To gain from nothing is the Dao; to lose from something is folly. The foolish do not gain through the Dao. To know being as being is being; life is when original *qi* has not yet dispersed and can be taught. When it scatters, yin forms, and yin’s beginning is born—fully storing the knowledge that nothing is the root of being.\n\nThus, at a male’s birth, *qi* is concentrated, solidifying his form. The nine orifices form, and when complete, he is nurtured. Yang *qi* is pure and substantial—thus his image corresponds to Qian. Qian is strength; desires have not yet arisen. He drinks blood, and likes and dislikes touch him—anger arises cautiously, like the profit of merchants, for his *qi* is purely yang.\n\nAt first, a person’s gates are firmly closed, guarding the One and purifying their spirit. By ten years of age, they can stand upon what they see. The Dao of civil and martial arts is extended to grasp its essence—his hexagram is *Gou* (Encounter). *Gou* means meeting, the beginning of the north, where strength is not yet mature. The strong boar has five yangs, and when it encounters, it stirs the body. Crowned and robed, it is influenced by *Gu* (Decay), its ambition confined to the chamber. Two yangs both retreat—thus the *Yi* says: \"The lord does not know that nothingness is the one yang beginning to descend.\" The four *xi* (joyful states) are greedy and lustful desires have not yet arisen. The six lines do not stir—playing with them is amusement, restrained by ritual and music. The mouth savors flavors, and desires arise accordingly. Thus, the first nine: one yang is initially defeated, its power beginning to return to its position—this is *Hai* (the twelfth earthly branch).\n\nThe *Yi*’s *Yingzhu* (Lean Boar) encounters the strong boar: the lean boar is one yin, and the Dao of lust is about to sprout. \"Heaven below has a mountain\"—*Dun* (Retreat) will diminish its strength. Should it join? A person halts here, and the many boars encounter harm.\n\nUpon reaching the capping ceremony and marriage, they are employed—thus their hexagram is *Dun* (Retreat). *Dun* means to avoid and withdraw, for yin *qi* is growing while yang has not yet departed—this is to distance oneself from petty people.",
      "overlap_context": "ays, it is accomplished.\nIn total, a thousand days are required!\n\nFor those whose vitality is depleted by sensual indulgence,\nEven a thousand days cannot restore it—\nOne must practice for a long, long time\nTo replenish the Yang Barrier.\n\nKan is one yang and two yin,\nFire is born from water—\nThis is the natural Dao.\nThose who indulge in desires\nExhaust their single yang.\nWhen the single yang’s power is spent,\nA person approaches death.\nThus, one must supplement it with the qi of original harmony!",
      "start_char": 9575,
      "end_char": 10795,
      "start_sentence": 428,
      "end_sentence": 478,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.65365505218506,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\洞元子内丹诀.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "小人者女子，君子知道，能固其身。 欲能丧其身，在阴方盛，必戒欲乐，以补乎遁，阳其志尔。 至於三十，壮於血炁，家室之作成矣！ 子孙之后继矣！ 施忠於国，则宦利所行，不能息也，报怨在俨，则刚断之勇，不能戢也。 贪利於家，欲千古之不能耗，毒爵於身，欲九迁之贵不尚。 不知淫欲为伐命之斧，滋味为腐肠之药，故三阳见缺，其卦得否。 天地否，否非健也，刚已去半，柔居其盛，故人之壮室，色虽其茂，炁虽其猛，苟顺而弗载其欲，则刚健之德日消矣！ 外强而内弱，是以《易》谓外君子而内小人。 人止於此，弗能修炼，日有耗臧，故《易》谓大往而小来，小人道长，君子道消者，是矣！ 以君子之不然，知大之往，小之来，必节饮食，慎淫欲，固根蒂，抱乎元，守乎一，以消乎阴也。 故《易》谓君，子以俭德避难此之谓也。 至於四十，子孙盛立，淫欲道过，齿发将暮，则缺乎四阳，其卦得观。 风行地上曰观，九五为君，君则人之心焉！ 人以四十，淫欲未足，故能悔，悔身之有败，是以心观形，则慎房室，诚贪欲，·用补元和之炁。 君子止于是，则修之，小人反是毁之，四十而不慎，然后见弃。 故《易》谓六三观我生之进＂退，其道明矣！ 至于是，以勤于修养，以阳补阴，尚能不失，故《易》谓九五观我生，君子无咎也。 至於五十弗奉厥道，阳德衰乱，阴鬼日盛，则缺乎九五，其卦得剥。 山下有地日剥，剥者，落也，其如草木之落归乎秋也。 初六剥足，自微剥也，足，人之所履，人非足无能适，故易谓剥床足矣！ 床，人之所安； 剥之则不利。 所安者，人之身尔，人之有形，其犹止之有床。 床之坏则无能憩形，形枯则无能宅神，神苟去，形必丧也。 剥之义大矣哉，刚变乎柔，阳变乎阴，贞变乎凶。 阴炁斯盛，小人道长，故《易》谓不利有攸往。 至此弗悟，得舆利庐之事显矣t．至於六十，弗补其道，垣见颓矣！ 室见坏矣！ 人见亡矣！",
      "translated_text": "The petty person is the woman; the noble person knows the Dao and can secure their person. Desire can destroy one’s person—when yin is in full ascendancy, one must guard against indulgence in pleasure to reinforce the *Dun* (Retreat), thereby strengthening yang’s resolve.\n\nBy thirty, one’s blood and *qi* are robust, and the affairs of family and household are established. Descendants follow in succession. If one serves the state with loyalty, official profit will flow unceasingly; if one repays enmity with solemnity, the courage of resolute decisiveness will not be restrained. Coveting profit for the household, one desires that a thousand generations will not diminish it; seeking rank through poisonous office, one desires that nine promotions will not suffice. Yet they do not know that lust is the axe that hews at life, and rich flavors are the medicine that rots the intestines. Thus, when the three yang lines show deficiency, the hexagram becomes *Pi* (Stagnation).\n\n\"Heaven and Earth are *Pi* (Stagnated)\": *Pi* is not strength. The firm has already departed by half, and the yielding occupies its fullness. Therefore, in the prime of life, though one’s complexion may flourish and one’s *qi* may be fierce, if one follows desire without restraint, the virtue of firmness and strength will daily diminish. Outwardly strong but inwardly weak, the *Yi* thus calls this \"outwardly a noble person, inwardly a petty person.\" If one halts at this point and does not cultivate and refine, daily depletion will occur. Thus, the *Yi* speaks of \"the great departing and the small arriving\"—the Dao of the petty person lengthens while the Dao of the noble person wanes.\n\nThe noble person, knowing otherwise, understands that the great departs and the small arrives. They must moderate diet, be cautious of lust, secure the root and stem, embrace the primordial, and guard the One to dissolve yin. Thus, the *Yi* says, \"The noble person, through frugal virtue, avoids calamity\"—this is the meaning.\n\nBy forty, descendants stand in abundance, the path of lust has passed its peak, and teeth and hair approach twilight. Thus, the four yang lines show deficiency, and the hexagram becomes *Guan* (Contemplation). \"Wind moving over the earth\" is *Guan*. The nine in the fifth place is the ruler, and the ruler is the heart of the people. At forty, if lust is not yet sated, one can still repent—repenting the failures of the body. Thus, by observing the form with the heart, one is cautious in the bedchamber, sincere in curbing desire, and employs this to replenish the *qi* of primordial harmony. The noble person halts here and cultivates; the petty person does the opposite and destroys. One who is not cautious at forty will thereafter be abandoned. Thus, the *Yi* says, \"The six in the third place contemplates the advance and retreat of my life\"—the Dao is clear.\n\nAt this stage, through diligence in cultivation, using yang to supplement yin, one can still avoid loss. Thus, the *Yi* says, \"The nine in the fifth place contemplates my life; the noble person is without blame.\" By fifty, if one does not uphold this Dao, yang virtue falls into disorder, and yin ghosts daily grow stronger. Thus, the nine in the fifth place shows deficiency, and the hexagram becomes *Bo* (Splitting Apart).\n\n\"A mountain above the earth\" is *Bo*. *Bo* means to fall, like the grasses and trees falling in autumn. The initial six splits the foot—splitting begins from the subtle. The foot is what a person treads upon; without feet, one cannot go anywhere. Thus, the *Yi* says, \"*Bo* splits the bed’s foot.\" The bed is where a person rests; if it is split, it is not beneficial. What brings rest is the person’s body. The body’s having form is like the bed’s having a place to stop. If the bed is ruined, the form cannot rest; if the form withers, the spirit cannot dwell. If the spirit departs, the form is surely lost. Great is the meaning of *Bo*! The firm changes into the yielding, yang into yin, the upright into the ominous. Yin *qi* thus flourishes, and the Dao of the petty person lengthens. Thus, the *Yi* says, \"It is not beneficial to have somewhere to go.\"\n\nIf one does not awaken at this point, the affairs of profit from carriages and huts become manifest. By sixty, if one does not supplement the Dao, the walls show collapse, the house shows ruin, and the person shows demise.",
      "overlap_context": "u* (Lean Boar) encounters the strong boar: the lean boar is one yin, and the Dao of lust is about to sprout. \"Heaven below has a mountain\"—*Dun* (Retreat) will diminish its strength. Should it join? A person halts here, and the many boars encounter harm.\n\nUpon reaching the capping ceremony and marriage, they are employed—thus their hexagram is *Dun* (Retreat). *Dun* means to avoid and withdraw, for yin *qi* is growing while yang has not yet departed—this is to distance oneself from petty people.",
      "start_char": 10795,
      "end_char": 11537,
      "start_sentence": 479,
      "end_sentence": 508,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.61468529701233,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\洞元子内丹诀.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "阴盛而阳丧，魄笑而魂悲，顺以行之，亢龙有缺，其卦得坤。 坤者，顺也、其名地，其形土，其性柔，其事隆。 夫人至於六十，不能修炼，纯阴备作，则肝道衰，肺道枯，心道懵，脾道败，胆道弱，肾逍竭。 六事既备，至於死而为鬼，故曰鬼之言归也。 魂归於。 天，魄归於地，故顺乾日生，顺坤曰死，生死之道见矣！ 知而炼者，反坤道焉！ 是以《易》谓乾坤为易之门户。 易乃圣人变化生死之书也。 六十而知其道，犹修炼乎！ 其能炼阳销阴，补其初九，则其卦得复。 雷在地曰复，刚动而阳反其中，本见矣！ 本者天地之心焉！ 凡人六十而悟修其至道，方复厥初。 必以至日运乎坎离，用亦以时，无失厥度，闻其所睹，默然自守，安乎大静，以从其政而得於本，故《易》谓复其见天地之心乎！ 又日先王以至日闭关，商旅不行，《易》日湛寂，然而大静，先王则天地而行者也。 《象》曰：不远之复，以修身也。 勤而不倦，以朝夕击安其大静，补其六二，成乎正阳，则其卦得临。 泽上见地日临，阳炁复盛，阴炁虽茂，日见消也。 故君子道长，小人道消，勤而弗息，至於阴月无失其理，刚炁侵而日蔓，则无。 咎称复乾卦，其事泰矣！ 故《易》曰至于八月，凶八月之众阴也，不炼阳而销之终凶也。 临之为义，大矣哉！ 复厥天数，故易曰：刚中而应，大亨以正之道也。 人能知咎承刚，以修复乎三阳，其卦得泰。 地天日泰，君子以积德累行，炼阳消阴，日萌其进，弗息。 其九窍通利，四体盈实，起居和节，万神通泰，阴炁日微，阳炁日大，内刚健而正行，外柔而和，从往则咸利，故《易》曰：天地交而万物泰，君子道长，小人道消。 斯之谓也。 至强不息，日进其道，消乎六四，则其卦得之大壮。 雷在天上曰大壮，壮顺天之道，震发万物，迅雷之用，莫不蠢然。 君子以观乾之道，尽乾之功，而行矣！ 执乎大静，群魔不作，妮事不兴，以心观炁，庶想悉断。 垢则沐以真水，疾则炙以元火，余阴一日为阳所烬，小人道丧於斯矣！ 刚正内作，发之於外，外虽柔顺，其何以制乎盛阳者焉！ 然三尸欲叛，七魄待离，必畏乎刚健，而无能矜其拓也。 以阳德大王，故曰大、壮。 是以《易》日，正大而天地之情可见矣！ 修之弗已，变乎九五，则其卦得夬。 泽上於天曰夬，君子以修身慎行，夙夜罔懈，省刑狱，恤狐寡，救沉溺，扶颠危，息嫉拓，游神运炁，抱元守一，炼乎太阳，以消阴炁。 小人道消，则得乎夬，夬者，庾也，至此有决於解脱之道也。 凡君子之生，基於卯角，则曰全阳； 止於十岁，缺，其初九，则卦得娠； 卯之年未知修炼，至於弱冠，其卦得遁，二十而能修炼。 养摄其初九，其卦得同人。 天与火同人，至於三十，能全其真道，复其初九，则其卦得无妄。 天下雷行无妄，至于四十，能省其咎，守其一，寂无所求，复其初九，则其卦得益。 雷日益，至子五十，修其至道，补于初九，则其卦得颐 山雷日颐，二十而补炁，至于九二，则其卦得履。 上天下泽日履，至于四十，复其九二，则其卦得中孚。 泽上有风曰中孚，四十而不倦，能行其炁，以炼乎阴，补乎三阳，则其卦得小畜。 风行天上日小畜，至於五十，能知其道，精行无怠，补其阳炁，至於九二，则其卦得损。",
      "translated_text": "When yin flourishes and yang perishes, the *po* laughs while the *hun* grieves. Proceeding in compliance, the exalted dragon suffers loss—its hexagram becomes *Kun*. *Kun* is compliance; its name is Earth, its form is soil, its nature is yielding, and its affairs are abundance.\n\nWhen a person reaches sixty and fails to cultivate and refine, pure yin fully arises: the liver’s Dao declines, the lung’s Dao withers, the heart’s Dao grows dull, the spleen’s Dao decays, the gallbladder’s Dao weakens, and the kidney’s essence is exhausted. Once these six conditions are complete, death ensues, and one becomes a ghost—hence the saying, \"Ghost means return.\" The *hun* returns to heaven, the *po* returns to earth. Thus, following *Qian* is life, following *Kun* is death; the Dao of life and death is revealed. Those who know and refine reverse the *Kun* Dao!\n\nTherefore, the *Yi* calls *Qian* and *Kun* the gateways of the *Yi*. The *Yi* is the book through which the sage transforms life and death. If one understands its Dao at sixty, one still cultivates and refines! By refining yang to dissolve yin and replenishing the *Initial Nine*, the hexagram becomes *Fu*. Thunder beneath the earth is *Fu*: firmness moves, and yang returns within—its root is revealed! The root is the heart of heaven and earth.\n\nFor all people, awakening at sixty to cultivate the supreme Dao is to restore their origin. One must revolve the *Kan* and *Li* on the solstice, employing them in due season, without losing their measure. Perceiving what is seen, one silently guards the self, abiding in great stillness, following its governance to return to the root. Thus, the *Yi* says, \"*Fu* reveals the heart of heaven and earth.\" It also states: \"The former kings closed the passes on the solstice, halting merchants and travelers.\" The *Yi* speaks of profound tranquility—great stillness—by which the former kings modeled themselves on heaven and earth.\n\nThe *Image* says: \"Returning from not far away is for cultivating the self.\" Diligently and tirelessly, morning and evening, one strikes to secure great stillness, replenishing the *Sixth Two* to complete true yang. Then the hexagram becomes *Lin*. Marsh above earth is *Lin*: yang *qi* regains its abundance, while yin *qi*, though lush, daily diminishes. Thus, the noble person’s Dao lengthens, and the petty person’s Dao wanes. Persisting without rest, even in the yin months, one does not lose principle. As firm *qi* encroaches and daily spreads, there is no misfortune. This is called restoring the *Qian* hexagram—its affairs are peace!\n\nThus, the *Yi* says: \"By the eighth month, there is misfortune.\" The eighth month is the height of yin’s multitude; failing to refine yang to dissolve it ultimately brings misfortune. Great is the meaning of *Lin*! It restores heaven’s number. Thus, the *Yi* says: \"Firmness centered and responsive is the way of great success and correctness.\"\n\nIf one can recognize misfortune and uphold firmness, cultivating the three yangs to restore them, the hexagram becomes *Tai*. Earth above heaven is *Tai*: the noble person accumulates virtue and piles up deeds, refining yang to dissolve yin, daily sprouting progress without cease. The nine orifices flow smoothly, the four limbs are full and substantial, movement and rest are harmonious, and the myriad spirits are at peace. Yin *qi* daily diminishes, yang *qi* daily grows. Within, one is firm and strong, walking upright; without, one is yielding and harmonious. Proceeding thus brings universal benefit. Therefore, the *Yi* says: \"Heaven and earth unite, and the myriad things are at peace. The noble person’s Dao lengthens, and the petty person’s Dao wanes.\" This is its meaning.\n\nPersisting without cease, daily advancing the Dao, dissolving the *Sixth Four*, the hexagram becomes *Dazhuang*. Thunder above heaven is *Dazhuang*: strength follows heaven’s Dao, the shock of thunder arouses the myriad things, and none fail to stir. The noble person observes *Qian*’s Dao, exhausts *Qian*’s work, and acts accordingly! Abiding in great stillness, no demons arise, no perverse affairs stir. Gazing at *qi* with the heart, all distracting thoughts are severed. Filth is washed with true water, illness is cauterized with primordial fire. The last remnants of yin are incinerated by yang in a single day—at this, the petty person’s Dao perishes!\n\nFirm correctness arises within and manifests without. Though outwardly yielding and compliant, how can it be restrained by the flourishing of yang? Yet the Three Corpses plot rebellion, and the Seven *Po* await departure—only reverence for firm strength prevents them from boasting of their expansion. With yang’s virtue reigning supreme, it is called *Great* and *Strong*. Thus, the *Yi* says: \"Upright and great—thus the sentiments of heaven and earth are revealed!\"\n\nCultivating without cease, transforming at the *Ninth Five*, the hexagram becomes *Guai*. Marsh above heaven is *Guai*: the noble person cultivates the self and guards conduct, vigilant day and night without slackening. One examines penal cases, pities widows and orphans, rescues the drowning, supports the fallen, quells jealousy and expansion, roams the spirit and moves *qi*, embraces the origin and guards the One, refines the great yang to dissolve yin *qi*. When the petty person’s Dao wanes, one attains *Guai*—*Guai* means decision. At this point, there is resolution in the Dao of liberation.\n\nIn general, the noble person’s life begins at the *mao* horn—this is called complete yang. Halting at ten years, lacking the *Initial Nine*, the hexagram becomes *Shou*. If at the *mao* year one does not yet know cultivation and refinement, by twenty the hexagram becomes *Dun*. If at twenty one can cultivate and refine, nurturing and preserving the *Initial Nine*, the hexagram becomes *Tongren*. Heaven and fire are *Tongren*. By thirty, if one can fully preserve the true Dao and restore the *Initial Nine*, the hexagram becomes *Wuwang*. Thunder moves beneath heaven—*Wuwang*. By forty, if one can examine misfortune, guard the One, and remain silent without seeking, restoring the *Initial Nine*, the hexagram becomes *Yi*. Thunder is *Yi*. By fifty, cultivating the supreme Dao and replenishing the *Initial Nine*, the hexagram becomes *Yi*. Mountain and thunder are *Yi*. At twenty, replenishing *qi* and reaching the *Ninth Two*, the hexagram becomes *Lü*. Heaven above marsh is *Lü*. By forty, restoring the *Ninth Two*, the hexagram becomes *Zhongfu*. Wind above marsh is *Zhongfu*. At forty, tirelessly practicing *qi* to refine yin and replenish the three yangs, the hexagram becomes *Xiaoxu*. Wind moves above heaven—*Xiaoxu*. By fifty, understanding the Dao and practicing essence without slack, replenishing yang *qi* to the *Ninth Two*, the hexagram becomes *Sun*.",
      "overlap_context": "s, the form is surely lost. Great is the meaning of *Bo*! The firm changes into the yielding, yang into yin, the upright into the ominous. Yin *qi* thus flourishes, and the Dao of the petty person lengthens. Thus, the *Yi* says, \"It is not beneficial to have somewhere to go.\"\n\nIf one does not awaken at this point, the affairs of profit from carriages and huts become manifest. By sixty, if one does not supplement the Dao, the walls show collapse, the house shows ruin, and the person shows demise.",
      "start_char": 11537,
      "end_char": 12801,
      "start_sentence": 509,
      "end_sentence": 559,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.353649854660034,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\洞元子内丹诀.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "山下有泽曰损，阳炁上消其阴，故《易》谓损上而益下是也。 五十知损之道，能损其六三，变乎九三，则其卦得大畜。 天在山下日大畜，六十而无惑，至行其道，上损下壮其炁，炼其六四，成乎纯阳，则其卦得大有。 火在天上日大有，凡纳乾坤坎离四象，抽运失度，则八卦荡而更矣！ 是成六十四也。 圣人演易，变化之道备矣！ 阳盛而阴伏，则神仙可见矣！ 阴盛而阳伏，则魂魄可离，魂魄离而人夭，神仙见而尸解，其道至矣！ 不远千里，自顾而笑，是以君子观上天之道，执而行之，荡五味而修乎身，蕴五常而洁其行，为贼盗人生也，圣人反盗矣！ 天地至大，日月至明，昼夜以革，尊卑位定，鬼关是闭，意马弗驰，在乎手也。 关键既密，静定既固，出入往来，得乎自在万变，化之在乎身也。 天之大者人也，人之大者机也，顺天以行其炁，从时之义，以伏其机，机无泄，元阳固实，炼阴至阳，乾道弥着，立乾之位，坤基方见定矣！ . 阳盛阴消，阴炁解散，故天起煞心，龙蛇溃矣！ 君子以下三尸，束群魔，逐青龙，走白虎，颠之倒之，日就月将，离纯阴而坎纯阳，故天地反矣！ 乾坤位定，人事固久，外邪不入，内阳则盛，守一不失，抱元得志，俟乎蝉蜕，漏形遗矣！ 故天人道合，基弃而神出也。 天地生人，长短有定，巧拙之性，任运自可游神，移神，故可藏可伏也。 耳听目视，鼻香口味，心劳欲作者，必损乎寿。 君子能瞑目於内，视盲於色也，塞耳於外，积於声也，窒鼻於物，能於香也，缄口於僎，绝於味也，弗劳其心，存乎寿也，不贪其欲，固乎基也。 是以目观其色，心所爱矣，爱而后动，令难忘矣。 是故塞九窍而邪不入，在乎盲目灰心，慎欲於三也。 动而有失，静而有得，是也。 人能贮心，心能败人，心为帝主，总统万神。 ．心者在乱，淫欲大作，万神离散，人将死矣！ 故木生火而自焚，国生奸而自叛。 男子知目不可视色，心不可乱欲，口不可贪味，故修炼之，以全其身，是为圣人也。 天地用仁而生乎，人用不仁而杀乎，人道之常也。 乾坤之候，百谷草木，盗时而出之； 百谷草木之味，人盗秋而食之。 百谷草木之毒，盗人之生者也。 君子以安乎三才，无使盗作，然后以坎水离火，烹而饵之，饵之以时，百骸自理。 故先王以至日闭关，商旅不行之类是也。 人识像神之像为神，不知舍於身之神而为神也，人身之神，炼之为仙，故为神也。 尸解之道，日月运行，左旋右没，右旋左没，其数有三。 安其身，修其神，处其室，绝其念，始有小静，百日之功着矣！ 次安大静，千日之行积矣！ 功着而行积，神光为之出，故日之与月，其数是也，大之与小，其功一也。 神明为之以生，圣功为之以立，君子以固穷守道，不泄其机； 小人则反矣！ 安其子，息其母，抱其元守其一，厥志不荡，厥邪自屏。 炼刚消柔，积功不倦，其若聋之视，瞽之听，示乎专也。 绝利其一者也，绝利其一，功加十倍，日月出没，三反其数。 道成以一，秽形将坠，明神是出，故功加百倍矣！ 心之所欲，复所弃，故生於物。 人之失者，己之得，得而能守不失以道，制之在心，运而归元。 故禽之於气，端居玄室，默守其道，湛然无虑，可往可来，人坏而神立。",
      "translated_text": "Mountain below marsh is called *Sun*. Yang *qi* ascends to dissolve yin, thus the *Book of Changes* speaks of \"diminishing above to augment below.\" At fifty, knowing the Dao of *Sun*, if one can diminish the *Sixth Three* and transform it into the *Ninth Three*, the hexagram becomes *Daxu*. Heaven within mountain is *Daxu*. By sixty, free from delusion and practicing the Dao to the utmost, diminishing above and strengthening below with *qi*, refining the *Sixth Four* to achieve pure yang, the hexagram becomes *Dayou*. Fire above heaven is *Dayou*. If one draws in the four images of *Qian*, *Kun*, *Kan*, and *Li*, yet miscalculates the rhythm of extraction and circulation, the eight trigrams will dissolve and transform anew—thus completing the sixty-four hexagrams. The sages expounded the *Changes*, and the Dao of transformation and change was fully revealed.\n\nWhen yang flourishes and yin recedes, immortals become visible. When yin flourishes and yang recedes, the hun and po may depart; if the hun and po depart, one dies prematurely, but if immortals appear, the body undergoes liberation. The Dao reaches its utmost! Though one may travel a thousand *li*, one need only turn inward and smile. Therefore, the noble person observes the Dao of high heaven, grasps it, and practices it—purifying the five flavors to cultivate the body, nurturing the five constants to refine conduct. To be plundered by thieves is the way of human life, but the sage reverses the plunder.\n\nHeaven and earth are vast, the sun and moon luminous; day and night alternate, the positions of high and low are fixed, the gates of ghosts are sealed, the horse of the mind does not gallop—all rests in one’s hands. When the mechanisms are secure and stillness is firmly established, in all comings and goings, one attains the freedom of myriad transformations, for the power of change lies within the body.\n\nThe greatest in heaven is humanity; the greatest in humanity is *ji*. Following heaven to circulate *qi*, adhering to the principle of the times to subdue *ji*—if *ji* does not leak, primordial yang is firmly consolidated. Refining yin into yang, the Dao of *Qian* becomes ever more manifest. Once the position of *Qian* is established, the foundation of *Kun* is firmly set.\n\nWhen yang flourishes and yin dissipates, yin *qi* scatters—thus heaven arises to slay the heart, and dragons and serpents collapse. The noble person casts out the Three Corpses, binds the demon hordes, drives away the Azure Dragon, expels the White Tiger, overturns and inverts them. Day by day, month by month, one departs from pure yin and enters pure yang of *Kan*—thus heaven and earth are reversed! When the positions of *Qian* and *Kun* are fixed, human affairs are firmly enduring. External evils cannot enter, and inner yang flourishes. Guarding the One without loss, embracing the primordial to fulfill one’s aspiration, one awaits the cicada’s molting—leaving the decayed form behind. Thus, the Dao of heaven and humanity unite, the foundation is discarded, and the spirit emerges.\n\nHeaven and earth give birth to humanity, with fixed lengths of life; whether clever or clumsy in nature, one may freely roam and shift the spirit, for it can be concealed or hidden. Ears that hear, eyes that see, noses that smell, mouths that taste, hearts that toil in labor and desire—all these diminish longevity. The noble person can close the eyes within, becoming blind to colors; block the ears without, accumulating silence; seal the nose from things, mastering scents; shut the mouth from delicacies, cutting off flavors; refrain from laboring the heart, preserving longevity; and not coveting desires, securing the foundation.\n\nThus, when the eyes behold beauty, the heart grows fond; fondness leads to movement, making it hard to forget. Therefore, seal the nine orifices so that evil cannot enter—this lies in blinding the eyes and stilling the heart, being cautious of the three desires. In movement there is loss; in stillness there is gain—this is the way.\n\nThe heart can store, yet the heart can also ruin a person. The heart is the sovereign ruler, governing the myriad spirits. When the heart is in chaos, excessive desires arise, and the myriad spirits scatter—death approaches! Thus, wood gives birth to fire and burns itself; a state gives rise to treachery and rebels against itself. If a man knows that the eyes must not gaze upon beauty, the heart must not be disordered by desire, and the mouth must not crave flavors, and thus cultivates and refines to preserve the body, he is a sage.\n\nHeaven and earth employ benevolence to give life, but humanity employs the lack of benevolence to kill—this is the constant way of human life. In the seasons of *Qian* and *Kun*, the hundred grains and grasses steal the time to emerge; humanity steals the autumn to consume the flavors of the hundred grains and grasses. The poisons of the hundred grains and grasses steal human life. The noble person stabilizes the Three Powers, preventing theft from arising. Only then, with the water of *Kan* and the fire of *Li*, does one cook and consume at the proper time—thus the hundred bones regulate themselves. Therefore, the former kings, on the solstices, closed the passes so that merchants and travelers did not move—this is the principle.\n\nPeople recognize the image of the spirit as the spirit, yet do not know that the spirit dwelling within the body is the true spirit. The spirit within the human body, when refined, becomes an immortal—thus it is called spirit. The Dao of liberation from the corpse follows the movement of the sun and moon: left rotation and right setting, right rotation and left setting—its number is three.\n\nStabilizing the body, cultivating the spirit, abiding in the chamber, cutting off thoughts—only then does minor stillness begin. With a hundred days of effort, progress becomes evident. Next, attaining great stillness, a thousand days of practice accumulate. When effort is evident and practice accumulates, the radiance of the spirit emerges—thus the numbers of the sun and moon. Whether great or small, the effort is the same. The numinous is born of this, and the sage’s work is established by this. The noble person, in poverty, holds fast to the Dao and does not leak *ji*; the petty person does the opposite.\n\nCalming the child, quieting the mother, embracing the primordial and guarding the One—one’s aspiration remains undisturbed, and evil naturally retreats. Refining hardness to dissolve softness, accumulating effort without weariness—like the deaf who see, the blind who hear, demonstrating singular focus. Cutting off profit from the One is the way. Cutting off profit from the One, effort increases tenfold. The sun and moon rise and set, cycling three times. When the Dao is accomplished in the One, the filthy form will fall away, and the luminous spirit will emerge—thus effort increases a hundredfold!\n\nWhat the heart desires is what it discards, thus it is born from things. What humanity loses is one’s own gain. Gaining and being able to guard without loss through the Dao—control lies in the heart, and circulation returns to the primordial. Thus, the bird in *qi* dwells in the dark chamber, silently guarding the Dao, profoundly without care—it may come and go. The person decays, but the spirit stands.",
      "overlap_context": "t twenty, replenishing *qi* and reaching the *Ninth Two*, the hexagram becomes *Lü*. Heaven above marsh is *Lü*. By forty, restoring the *Ninth Two*, the hexagram becomes *Zhongfu*. Wind above marsh is *Zhongfu*. At forty, tirelessly practicing *qi* to refine yin and replenish the three yangs, the hexagram becomes *Xiaoxu*. Wind moves above heaven—*Xiaoxu*. By fifty, understanding the Dao and practicing essence without slack, replenishing yang *qi* to the *Ninth Two*, the hexagram becomes *Sun*.",
      "start_char": 12802,
      "end_char": 14027,
      "start_sentence": 560,
      "end_sentence": 606,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.586015462875366,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\洞元子内丹诀.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "故生者是死，死者是生也，凡势动而爻变，可聚而可分，日月有度，刚柔相炼，有功则久，既久则盛，君子之基固矣！ 一进一退，变化之道明矣！ 以刚消柔，乾坤之理着矣！ 是以贤人之处默，所居而安者，求乎修炼之至也。 明鉴在侧，扬乎光也，则鬼神之情状睹矣！ 百姓日用而不知，以诸物禽诸气，其动也刚，其静也柔，止观其形容，俟其进退，则吉凶之道断矣！ 故知之修炼，谓之圣人，其是之谓欤！ 洞元子内丹诀卷下竟",
      "translated_text": "Thus, life is death, and death is life. In all circumstances, movement shifts the lines, and they may gather or disperse. The sun and moon have their measures; hardness and softness refine each other. Where there is merit, there is duration; where there is duration, there is flourishing—thus the foundation of the noble person is firmly established!\n\nWith each advance and retreat, the Dao of transformation is made clear. Through hardness dissolving softness, the principle of *Qian* and *Kun* is revealed. Therefore, the wise person abides in silence, finding peace in their dwelling, seeking the perfection of cultivation and refinement.\n\nA bright mirror stands beside them, radiating its light—then the true forms of ghosts and spirits become visible! The common people use it daily yet do not know it. They apply it to things and restrain it in *qi*: in movement, it is hard; in stillness, it is soft. Observe its form and appearance, await its advance and retreat—then the way of fortune and misfortune is decided!\n\nThus, one who cultivates and refines knowledge is called a sage—is this not its meaning?\n\n*The Inner Alchemy Formula of Master Dongyuan, Lower Scroll, Concluded.*",
      "overlap_context": "orm will fall away, and the luminous spirit will emerge—thus effort increases a hundredfold!\n\nWhat the heart desires is what it discards, thus it is born from things. What humanity loses is one’s own gain. Gaining and being able to guard without loss through the Dao—control lies in the heart, and circulation returns to the primordial. Thus, the bird in *qi* dwells in the dark chamber, silently guarding the Dao, profoundly without care—it may come and go. The person decays, but the spirit stands.",
      "start_char": 14027,
      "end_char": 14218,
      "start_sentence": 607,
      "end_sentence": 614,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 5.870708465576172,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\洞元子内丹诀.txt",
        "category": "正统道藏太玄部"
      }
    }
  ]
}