{
  "source_id": "洞玄灵宝五老摄召北酆鬼魔赤书玉诀",
  "source_file": "chunked_daozang\\洞玄灵宝五老摄召北酆鬼魔赤书玉诀.json",
  "total_chunks": 3,
  "total_original_chars": 2733,
  "total_translated_chars": 19129,
  "total_translation_time": 79.79478073120117,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\洞玄灵宝五老摄召北酆鬼魔赤书玉诀.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Wondrous Treasure Scripture of the Five Elders’ Summoning of Beifeng Ghosts and Demons from the Vermilion Writs of Jade Formulas**\n\n**Scripture Title:** *The Wondrous Treasure Scripture of the Five Elders’ Summoning of Beifeng Ghosts and Demons from the Vermilion Writs of Jade Formulas*\nAuthor unknown; an abridged adaptation excerpted from *The Vermilion Writs of Jade Formulas*. One scroll.\nSource text: *Daoist Canon of the Zhengtong Era*, Orthodox Section, Part One.\n\n---\n\nThis Vermilion Writ is the essential requisite for those who study the Dao. Regrettably, its original text is incomplete, and further collation is awaited.\n\n### **The Eightfold Numinous Talismans of the Wondrous Treasure**\nWhen inscribing the *Three Heavens’ Supreme Talisman for Summoning and Subduing Dragons, Tigers, Leopards, and Mountain Spirits* in cinnabar, place it upon a silverwood tablet. Inscribe the year, month, and the master’s surname and given name upon another tablet. Bind the two tablets together and enclose them in a pouch. Inscribe the subsequent text in cinnabar upon a third tablet, attaching it to the exterior of the pouch. Seal the three tablets as a divine talisman, following the transmission’s form. All tablets shall be made of silverwood, fourteen inches in length and two inches four fen in width. The pouch shall be crafted from crimson silk, twelve feet in length. Clothe the talisman within, sealing the outer tablet. At the lower end, impress the seal of the *Primordial Five Elders of the Middle Prime*. Encase it in a cypress box, wrapped in crimson silk, and store the talisman in a separate chamber. Burn incense on both sides, reverently enshrine it, and receive it to wear upon the body. The divine spirits of the world shall attend at the gates morning and evening, with twelve Jade Lads and Jade Maidens of the Five Thearchs assigned to serve. In all goings and comings, the Five Thearchs shall act as guards, the Three Realms’ administrators shall welcome you, and in life and death, you shall avoid the three evil destinies. You shall bypass Mount Tai, ascend directly to the Nine Heavens, and be clothed and fed by nature. Your rank shall equal that of the Great Ultimate, and you shall attain immortality as you will.\n\nThe Daoist who receives and wears this text shall employ the divine incantations. Pointing the talisman toward heaven, the celestial gods shall descend. Pointing it toward earth, the earthly deities shall prostrate themselves, and the Three Realms shall gird themselves in submission. Pointing it toward spirits, they shall pay homage. Pointing it toward ghosts, they shall perish and dissipate. Pointing it toward water, the water spirits shall obey. When great kalpas converge and floods gather from the four directions, summon the dragon with the talisman, and it shall bear you upon its back. Through long cultivation and accumulated resonance, the divine and numinous shall gather. Wherever you summon, they shall arrive at once. A thousand transformations and ten thousand changes shall follow your will. In all goings and comings, your rank shall match the Great Ultimate, with flying dragons leading the way and the Celestial Balance following. Phoenixes shall cry and simurghs shall sing, with twelve radiant banners and the *Twenty-Seven-Colored Standards of Life and Spirit* preceding you. After nine years of concentrated practice, the celestial regalia shall assemble of their own accord.\n\n### **The Eightfold Numinous Incantation of the Wondrous Treasure**\n*\"Primordial Supreme Perfection, Five Numinous Exalted Ones,\nRadiant brilliance of Mount Taihua, luminous clarity of the Eight Gates,\nThe Five Elders issue their decree—no hidden realm is barred.\nAbove, they govern the Nine Heavens; at the center, they restrain Mount Feng;\nBelow, they command rivers and seas, the twelve water sources.\nThe Eightfold Numinous Incantation, the divine talisman of jade writs,\nSummons dragons to bear the waters, gathers qi and assembles clouds,\nBinds demons and dispatches ghosts, sweeps away demonic hordes.\nTen thousand spirits are shattered; none escape their doom.\nSun, moon, and the five stars, the Northern Dipper’s seven origins,\nAll heavens, all earths, all waters, all mountains,\nThe jade perfected under their command, the great spirits of the netherworld,\nThe Immortal Kings at their banquets, the Five Thearchs’ subduing banners,\nHeavenly Soldiers leading the way, Metal Tigers rushing behind,\nFierce beasts of the Jue Heaven, arrayed at the four gates—\nWhat is called arrives at once; what is summoned stands before you.\nThe Vermilion Writs blaze forth, wind and fire unobstructed.\nWherever restraint is applied, golden dragons swiftly transmit it.\"*\n\nConclude by clicking the teeth nine times, howling thrice toward heaven, drawing in the celestial qi three times, and pointing the talisman toward the designated place. Hold the breath for nine cycles, then cease.\n\n### **The Jade Formulas of the Primordial Five Elders for Quelling Disasters and Seeking Immortality in the Eastern Quarter**\nWhen the Daoist secludes himself to study, he shall inscribe the *True Writ of the Azure Thearch in Vermilion* and place it in the east, whereupon the immortals of the Eastern Marchmount shall arrive. After a hundred days of fasting and concentrated devotion to the *Venerable Numinous Treasure*, the celestial perfected shall descend, assigning nine *Jade Maidens of the Azure Essence* to retrieve the *immortal mushrooms and deathless medicines* of the Eastern Marchmount. The ghostly demons of the Azure Thearch shall retreat ninety thousand *li*, and all malevolent beasts, venomous creatures, and wicked beings within the region shall cease their harmful intent, instead showing kindness to the virtuous. After twenty-four years of fasting and cultivation, one shall attain immortality. Merely wearing this writ shall also enable *corpse liberation* and *transformation into an immortal through the revolving wheel*.\n\nIf the land in the east or during the three months of spring suffers calamity, and one wishes to pacify and stabilize the eastern quarter, inscribe the text in vermilion upon green stone and place it in the east for nine days. The disaster shall vanish, and malevolence shall dissolve of itself. The region shall become virtuous, azure dragons shall soar, and auspicious omens shall arrive of their own accord. The land shall enjoy great peace. Wearing the inscribed writ upon the body shall avert all misfortunes, prevent untimely harm, and ensure constant communion with the divine. It shall protect the state and secure the household, bringing boundless blessings.\n\nWhen the Daoist inscribes the *True Writ of the Vermilion Thearch* and places it in the south, the immortals of the Southern Marchmount shall arrive. After a hundred days of fasting and concentrated devotion to the *Venerable Numinous Treasure*, the celestial perfected shall descend, assigning eight *Jade Maidens of the Vermilion Mound* to retrieve the *immortal mushrooms and deathless medicines* of the Southern Marchmount. The ghostly demons of the Vermilion Thearch shall retreat eighty thousand *li*, and all malevolent beasts, venomous creatures, and wicked beings within the region shall cease their harmful intent, instead showing kindness to the virtuous. After twenty-four years of fasting and cultivation, one shall attain immortality. Merely wearing this writ shall also enable *corpse liberation* and *transformation into an immortal through the revolving wheel*.\n\nIf the land in the south or during the three months of summer suffers calamity, and one wishes to pacify and stabilize the southern quarter, inscribe the text in vermilion upon red stone and place it in the south for eight days. The disaster shall vanish, and malevolence shall dissolve of itself. The region shall become virtuous, and auspicious omens shall manifest. Phoenixes shall come to roam, white simurghs shall fly and sing, celestial beings shall chant hymns, and the state shall enjoy great peace. Wearing the inscribed writ upon the body shall prevent all untimely deaths, dispel misfortune and impurity, summon divine spirits, and bring boundless blessings. It shall prolong life and bestow longevity, prosper the household, and secure the state’s tranquility.\n\nWhen the Daoist inscribes the *True Writ of the Yellow Thearch* and places it in the center, the immortals of the Central Marchmount shall arrive.\n\nAfter a hundred days of strict fasting and meditating upon the sacred *Lingbao* deities, the celestial perfected shall descend, and twelve jade maidens of the Yellow Essence shall be granted to gather the divine *zhi* herbs of immortality from the Central Marchmount. The ghostly demons of the Yellow Thearch shall flee twelve myriad leagues, and the malevolent beasts and venomous creatures of the central realm shall cease their harmful intent, turning instead to cherish the virtuous. After twenty-four years of fasting and cultivation, one shall attain the body of a divine immortal. Merely wearing this writ shall also enable *shijie*—liberation through simulated death—and transformation into an immortal through the revolving wheel.\n\nShould the central realm or the transitional months of the four seasons suffer calamity, and one wishes to pacify and stabilize the Middle Kingdom, inscribe the text in vermilion upon yellow stone and place it in the center for twelve days. The disaster shall vanish of itself, and malevolence shall dissolve. The four quarters shall live in harmony, auspicious omens shall arise spontaneously, qilin shall come to submit, white tigers shall roam the courtyards, the state shall prosper, the people shall flourish, and all under heaven shall enjoy great peace. Wearing the inscribed writ upon the body shall avert all disasters, strengthen the body and vital qi, sharpen the five senses, and perpetually safeguard both household and state, ensuring everlasting prosperity and uprightness.\n\nWhen the Daoist inscribes the *True Writ of the White Thearch* and places it in the west, the immortals of the Western Marchmount shall arrive.\n\nAfter a hundred days of strict fasting and meditating upon the sacred *Lingbao* deities, the celestial perfected shall descend, and six maidens of the Grand Simplicity shall be granted to gather the divine *zhi* herbs of immortality from the Western Marchmount. The ghostly demons of the White Thearch shall flee six myriad leagues, and the malevolent beasts and venomous creatures of the western realm shall cease their harmful intent, turning instead to cherish the virtuous. After twenty-four years of fasting and cultivation, one shall attain the body of a divine immortal. Merely wearing this writ shall also enable *shijie*—liberation through simulated death—and transformation into an immortal through the revolving wheel.\n\nShould the western realm or the three months of autumn suffer calamity, and one wishes to pacify and stabilize the western quarter, inscribe the text in vermilion upon white stone and place it in the west for six days. The disasters of that region shall vanish of itself, and malevolence shall dissolve. The west shall submit of itself, auspicious omens shall come to roam, divine beasts shall soar in flight, golden sparrows shall bear talismans, the Five Elders shall come as guests, the state shall be at peace, and the people shall rest. Wearing the inscribed writ upon the body shall enable communion with divine spirits, avert all disasters, share the same kitchen as the Five Thearchs, and ensure that descendants flourish, enjoying the rank of kings and marquises for generations. With such good karmic conditions, what cause for worry or sorrow remains?\n\nWhen the Daoist inscribes the *True Writ of the Black Thearch* and places it in the north, the immortals of the Northern Marchmount shall arrive.\n\nAfter a hundred days of strict fasting and meditating upon the sacred *Lingbao* deities, the celestial perfected shall descend, and five maidens of the Grand Mystery shall be granted to gather the divine *zhi* herbs of immortality from the Northern Marchmount. The ghostly demons of the Black Thearch shall flee five myriad leagues, and the malevolent beasts and venomous creatures of the northern realm shall cease their harmful intent, turning instead to cherish the virtuous. After twenty-four years of fasting and cultivation, one shall attain the body of a divine immortal. Merely wearing this writ shall also enable *shijie*—liberation through simulated death—and transformation into an immortal through the revolving wheel.\n\nShould the northern realm or the three months of winter suffer calamity, and one wishes to pacify and stabilize the northern quarter, inscribe the text in vermilion upon black stone and place it in the north for five days. The disasters of that region shall dissolve of themselves, and malevolence shall vanish. The north shall submit of itself, auspicious omens shall flourish daily, the treasures of the earth shall be revealed, gold and jade shall manifest, celestial beings shall chant hymns, the state shall be wealthy, and the people shall prosper. Wearing the inscribed writ upon the body shall dispel all disasters, grant a lifespan equal to heaven and earth, ensure everlasting fortune and emolument, and render all endeavors and aspirations upright and propitious. Descendants shall flourish, and generations of sages shall arise.\n\nThe Dao teaches: Those who study the supreme Daoist methods and observe the fasts and precepts must meditate upon the spirits and contemplate the Dao, aspiring to the celestial perfected, dispelling demons, and overcoming trials. All must first follow the ancient regulations of the *Lingbao* Upper Primordial, perform the installation of the true writs, and place them in the respective quarters. The divine perfected shall descend into the chamber, the officials and retinue of the Five Thearchs shall guard the gates, ghostly demons shall vanish, and all endeavors shall succeed.\n\nInscribe the *True Writ of the Azure Thearch* in vermilion upon azure silk and place it on the eastern wall of the chamber. Inscribe the *True Writ of the Vermilion Thearch* in vermilion upon crimson silk and place it on the southern wall. Inscribe the *True Writ of the Yellow Thearch* in vermilion upon yellow silk and place it in the center. Inscribe the *True Writ of the White Thearch* in vermilion upon white silk and place it on the western wall. Inscribe the *True Writ of the Black Thearch* in vermilion upon black silk and place it on the northern wall. Install these five writs within the fasting hall, burn incense morning and evening, and pay homage in the respective directions. No profane or heterodox persons may enter the hall. Each writ possesses its own mighty spirits, with jade lads and jade maidens in attendance. To violate these writs is to invite indictment before the Nine Heavens, where dark punishments shall be meted out immediately. Those who uphold them must clearly observe the prohibitions.\n\nWithin the Azure Heaven of the Nine Qi resides the Primordial Azure Lad of the Origin, whose taboo name is Kaiyang Qing. He oversees the *True Writ of the Azure Thearch* inscribed in vermilion. The Azure Lad stands nine inches tall, clad in azure feathered robes, and holds a green banner in his hand, standing to the left of the writ. Those who study the Dao should meditate upon this spirit descending into their own body. After a hundred days of focused contemplation, the divine perfected shall manifest in form, and all prayers shall be swiftly answered. Those who wear the true writ shall find this lad ever present within their liver palace, bestowing the essence of the green sprout.\n\nWithin the Cinnabar Heaven of the Three Qi resides the Primordial Vermilion Lad of the Origin, whose taboo name is Dan Quan Zhu. He oversees the *True Writ of the Vermilion Thearch* inscribed in vermilion. The Vermilion Lad stands three inches tall, clad in crimson feathered robes, and holds a red staff in his hand, standing before the writ. Those who study the Dao should meditate upon this spirit descending into their own body. After a hundred days of focused contemplation, the divine perfected shall manifest in form, and all prayers shall be readily answered. Those who wear the true writ shall find this lad ever present within their heart palace, bestowing the essence of the red sprout.\n\nWithin the Yellow Heaven of the Center resides the Primordial Yellow Lad of the Origin, whose taboo name is Hong Ying. He oversees the *True Writ of the Yellow Thearch* inscribed in vermilion. The Yellow Lad stands one inch and two fen tall, clad in yellow feathered robes, and holds a yellow halberd in his hand, standing at the center of the writ. Those who study the Dao should meditate upon this spirit descending into their own body. After a hundred days of focused contemplation, the divine perfected shall manifest in form, and all prayers shall be swiftly answered. Those who wear the true writ shall find this lad ever present within their spleen palace, bestowing the essence of the yellow sprout.\n\nWithin the White Heaven of the Seven Qi resides the Primordial White Lad of the Origin, whose taboo name is Ming Shi Liu. He oversees the *True Writ of the White Thearch* inscribed in vermilion. The White Lad stands seven inches tall, clad in white feathered robes, and holds a white banner in his hand, standing to the right of the writ. Those who study the Dao should meditate upon this spirit descending into their own body. After a hundred days of focused contemplation, the divine perfected shall manifest in form, and all prayers shall be swiftly answered.\n\nThose who wear the true writ shall find this lad ever present within their lung palace, bestowing the essence of the white sprout.\n\nWithin the Dark Heaven of the Five Qi resides the Primordial Black Lad of the Origin, whose taboo name is Yu Zi. He oversees the *True Writ of the Dark Thearch* inscribed in vermilion. The Black Lad stands five inches tall, clad in black feathered robes, and holds a black banner in his hand, standing behind the writ. Those who study the Dao should meditate upon this spirit descending into their own body. After a hundred days of focused contemplation, the divine perfected shall manifest in form, and all prayers shall be swiftly answered. Those who wear the true writ shall find this lad ever present within their kidney palace, bestowing the essence of the dark sprout.\n\nThese Five Thearch Lads of the Divine Perfected are born coeval with the Primordial Five Elders. They govern the five scrolls of the true writ, above commanding the qi of the Nine Heavens, below presiding over the Five Peaks, and within mastering the five viscera. They draw forth the essence of the five sprouts to nourish the human body. Those who consume the five sprouts yet remain ignorant of these spirits shall labor in vain, their efforts yielding no response.\n\nHere ends the *Cavernous Mystery Numinous Treasure Jade Formula of the Five Elders’ Summons of the Beasts and Demons of Fengdu*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞玄灵宝五老摄召北酆鬼魔赤书玉诀 经名：洞玄灵宝五老摄召北酆鬼魔赤书玉诀。 撰人不详，系节录《赤书玉诀》改编而成。 一卷。 底本出处：《正统道藏》正一部。 洞玄灵宝五老摄召北酆鬼魔赤书玉诀 此赤书乃学道之士之切要，惜其原阙，尚俟考补。 灵宝八威神策诀 当朱书三天太上召伏蛟龙虎豹山精文，着一银木板上。 又书记年月、师姓讳，着一板上。 合二板，纳囊裹。 朱书次文，着一板上，着囊外。 凡三板合封为神策，如传之状。 板悉用银木，长一尺四寸，广二寸四分。 以绛纹之缯作囊，令长一丈二尺。 衣之，封外板上。 下头印口中元始五老之章。 当以栢函，绛文作衣，衣函以请策文，着别室。 烧香左右，精心供养，受以佩身。 天下神灵朝夕朝门，给五帝玉童、玉女各一十二人。 出入游行，五帝侍卫，三界司迎，生死无复三恶之难，不经太山，径升九天，衣饭自然，位同太极，要自成仙。 受学道士佩此文，施行神咒。 以策文指天，天神下。 指地，地祇朝拜，三界束带。 指神，神礼。 指鬼，鬼自灭爽。 指水，水神通。 大劫数交，洪灾四会，以策召龙，龙为负身。 长修积感，神灵交会，所在施召，举向立到。 千变万化，适意所从。 出入行来，位准太极，皆前导飞龙，后从天钧，凤啸鸾呜，十二华光建二七色节、命灵之幡。 精思九年，天仪自备。 灵宝八威神咒 元始太真，五灵高尊，太华皓映，洞朗八门，五老告命，无幽不关，上御九天，中制酆山，下领河海，十二水源，八威神咒，灵策玉文，召龙负水，收气聚云，束魔送鬼，扫荡妖群，万精摧落，所诛无蠲，日月五星，北斗七元，诸天诸地，诸水诸山，玉真所部，冥灵大神，仙王游宴，五帝伏幡，天丁前驱，金虎后奔，玃天猛兽，罗备四门，所呼立到，所召立前，赤书焕落，风火无间，有所摄检，金龙驿传。 毕，叩齿九通，仰天三啸，引天气三咽，以策文指所告之地，闭气九息而止。 元始五老镇震求仙禳灾玉诀 道士隐学，书青帝赤书真文，置东方，则东岳仙官至。 长斋百日，精思灵宝尊神，则天真下降，给青要玉女九人，取东岳神仙芝草不死之药。 青帝鬼魔远舍九万里，一方凶悖恶兽、毒螫皆不生害心，反善仁人。 长斋修行二十四年，身得神仙。 但佩此文，亦得尸解，转轮成仙。 国土东方及春三月有灾，欲使东乡安镇，当赤书青石上，镇东方九日。 灾自灭，凶逆自消。 一方仁人，苍龙来翔，善瑞自至，国土太平。 书文佩身，却诸祸殃，身无患横，常与神明相当，保国宁家，享福无穷。 道士书赤帝真文，置南方，则南岳仙官至。 长斋百日，精思灵宝尊神，则天真下降，给朱陵玉女八人，取南岳神仙芝草不死之药。 赤帝鬼魔远舍八万里，一方凶悖恶兽毒螫皆不生害心，反善仁人。 长斋修行二十四年，身得神仙，但佩此文，亦得尸解，转轮成仙。 国土南方及夏三月有灾，欲使南乡安镇，当朱书赤石上，镇南方八日。 灾自灭，凶逆自消。 一方仁人善瑞显明，凤凰来游，白鸾飞呜，天人歌咏，欣国太平。 书文佩身，万夭不生，禳凶却秽，生致神灵，福庆无穷，延年长生，家致兴隆，国祚安宁。 道士书黄帝真文，置中央，则中岳仙官至。",
      "translated_text": "**The Wondrous Treasure Scripture of the Five Elders’ Summoning of Beifeng Ghosts and Demons from the Vermilion Writs of Jade Formulas**\n\n**Scripture Title:** *The Wondrous Treasure Scripture of the Five Elders’ Summoning of Beifeng Ghosts and Demons from the Vermilion Writs of Jade Formulas*\nAuthor unknown; an abridged adaptation excerpted from *The Vermilion Writs of Jade Formulas*. One scroll.\nSource text: *Daoist Canon of the Zhengtong Era*, Orthodox Section, Part One.\n\n---\n\nThis Vermilion Writ is the essential requisite for those who study the Dao. Regrettably, its original text is incomplete, and further collation is awaited.\n\n### **The Eightfold Numinous Talismans of the Wondrous Treasure**\nWhen inscribing the *Three Heavens’ Supreme Talisman for Summoning and Subduing Dragons, Tigers, Leopards, and Mountain Spirits* in cinnabar, place it upon a silverwood tablet. Inscribe the year, month, and the master’s surname and given name upon another tablet. Bind the two tablets together and enclose them in a pouch. Inscribe the subsequent text in cinnabar upon a third tablet, attaching it to the exterior of the pouch. Seal the three tablets as a divine talisman, following the transmission’s form. All tablets shall be made of silverwood, fourteen inches in length and two inches four fen in width. The pouch shall be crafted from crimson silk, twelve feet in length. Clothe the talisman within, sealing the outer tablet. At the lower end, impress the seal of the *Primordial Five Elders of the Middle Prime*. Encase it in a cypress box, wrapped in crimson silk, and store the talisman in a separate chamber. Burn incense on both sides, reverently enshrine it, and receive it to wear upon the body. The divine spirits of the world shall attend at the gates morning and evening, with twelve Jade Lads and Jade Maidens of the Five Thearchs assigned to serve. In all goings and comings, the Five Thearchs shall act as guards, the Three Realms’ administrators shall welcome you, and in life and death, you shall avoid the three evil destinies. You shall bypass Mount Tai, ascend directly to the Nine Heavens, and be clothed and fed by nature. Your rank shall equal that of the Great Ultimate, and you shall attain immortality as you will.\n\nThe Daoist who receives and wears this text shall employ the divine incantations. Pointing the talisman toward heaven, the celestial gods shall descend. Pointing it toward earth, the earthly deities shall prostrate themselves, and the Three Realms shall gird themselves in submission. Pointing it toward spirits, they shall pay homage. Pointing it toward ghosts, they shall perish and dissipate. Pointing it toward water, the water spirits shall obey. When great kalpas converge and floods gather from the four directions, summon the dragon with the talisman, and it shall bear you upon its back. Through long cultivation and accumulated resonance, the divine and numinous shall gather. Wherever you summon, they shall arrive at once. A thousand transformations and ten thousand changes shall follow your will. In all goings and comings, your rank shall match the Great Ultimate, with flying dragons leading the way and the Celestial Balance following. Phoenixes shall cry and simurghs shall sing, with twelve radiant banners and the *Twenty-Seven-Colored Standards of Life and Spirit* preceding you. After nine years of concentrated practice, the celestial regalia shall assemble of their own accord.\n\n### **The Eightfold Numinous Incantation of the Wondrous Treasure**\n*\"Primordial Supreme Perfection, Five Numinous Exalted Ones,\nRadiant brilliance of Mount Taihua, luminous clarity of the Eight Gates,\nThe Five Elders issue their decree—no hidden realm is barred.\nAbove, they govern the Nine Heavens; at the center, they restrain Mount Feng;\nBelow, they command rivers and seas, the twelve water sources.\nThe Eightfold Numinous Incantation, the divine talisman of jade writs,\nSummons dragons to bear the waters, gathers qi and assembles clouds,\nBinds demons and dispatches ghosts, sweeps away demonic hordes.\nTen thousand spirits are shattered; none escape their doom.\nSun, moon, and the five stars, the Northern Dipper’s seven origins,\nAll heavens, all earths, all waters, all mountains,\nThe jade perfected under their command, the great spirits of the netherworld,\nThe Immortal Kings at their banquets, the Five Thearchs’ subduing banners,\nHeavenly Soldiers leading the way, Metal Tigers rushing behind,\nFierce beasts of the Jue Heaven, arrayed at the four gates—\nWhat is called arrives at once; what is summoned stands before you.\nThe Vermilion Writs blaze forth, wind and fire unobstructed.\nWherever restraint is applied, golden dragons swiftly transmit it.\"*\n\nConclude by clicking the teeth nine times, howling thrice toward heaven, drawing in the celestial qi three times, and pointing the talisman toward the designated place. Hold the breath for nine cycles, then cease.\n\n### **The Jade Formulas of the Primordial Five Elders for Quelling Disasters and Seeking Immortality in the Eastern Quarter**\nWhen the Daoist secludes himself to study, he shall inscribe the *True Writ of the Azure Thearch in Vermilion* and place it in the east, whereupon the immortals of the Eastern Marchmount shall arrive. After a hundred days of fasting and concentrated devotion to the *Venerable Numinous Treasure*, the celestial perfected shall descend, assigning nine *Jade Maidens of the Azure Essence* to retrieve the *immortal mushrooms and deathless medicines* of the Eastern Marchmount. The ghostly demons of the Azure Thearch shall retreat ninety thousand *li*, and all malevolent beasts, venomous creatures, and wicked beings within the region shall cease their harmful intent, instead showing kindness to the virtuous. After twenty-four years of fasting and cultivation, one shall attain immortality. Merely wearing this writ shall also enable *corpse liberation* and *transformation into an immortal through the revolving wheel*.\n\nIf the land in the east or during the three months of spring suffers calamity, and one wishes to pacify and stabilize the eastern quarter, inscribe the text in vermilion upon green stone and place it in the east for nine days. The disaster shall vanish, and malevolence shall dissolve of itself. The region shall become virtuous, azure dragons shall soar, and auspicious omens shall arrive of their own accord. The land shall enjoy great peace. Wearing the inscribed writ upon the body shall avert all misfortunes, prevent untimely harm, and ensure constant communion with the divine. It shall protect the state and secure the household, bringing boundless blessings.\n\nWhen the Daoist inscribes the *True Writ of the Vermilion Thearch* and places it in the south, the immortals of the Southern Marchmount shall arrive. After a hundred days of fasting and concentrated devotion to the *Venerable Numinous Treasure*, the celestial perfected shall descend, assigning eight *Jade Maidens of the Vermilion Mound* to retrieve the *immortal mushrooms and deathless medicines* of the Southern Marchmount. The ghostly demons of the Vermilion Thearch shall retreat eighty thousand *li*, and all malevolent beasts, venomous creatures, and wicked beings within the region shall cease their harmful intent, instead showing kindness to the virtuous. After twenty-four years of fasting and cultivation, one shall attain immortality. Merely wearing this writ shall also enable *corpse liberation* and *transformation into an immortal through the revolving wheel*.\n\nIf the land in the south or during the three months of summer suffers calamity, and one wishes to pacify and stabilize the southern quarter, inscribe the text in vermilion upon red stone and place it in the south for eight days. The disaster shall vanish, and malevolence shall dissolve of itself. The region shall become virtuous, and auspicious omens shall manifest. Phoenixes shall come to roam, white simurghs shall fly and sing, celestial beings shall chant hymns, and the state shall enjoy great peace. Wearing the inscribed writ upon the body shall prevent all untimely deaths, dispel misfortune and impurity, summon divine spirits, and bring boundless blessings. It shall prolong life and bestow longevity, prosper the household, and secure the state’s tranquility.\n\nWhen the Daoist inscribes the *True Writ of the Yellow Thearch* and places it in the center, the immortals of the Central Marchmount shall arrive.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1248,
      "start_sentence": 0,
      "end_sentence": 53,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.9073281288147,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝五老摄召北酆鬼魔赤书玉诀.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "长斋百日，精思灵宝尊神，则天真下降，给黄素玉女十二人，取中岳神仙芝草不死之药。 黄帝鬼魔远舍十二万里，中央凶悖恶兽毒螫皆不生害心，反善仁人。 长斋修行二十四年，身得神仙。 但佩此文，亦得尸解，转轮成仙。 国土中央及四季月有灾，欲使中国安镇，当朱书黄石上，镇中央十二日。 灾自灭，凶逆自消。 四方和睦，善瑞自生，麒麟来归，白虎游庭，国丰民富，普天安宁。 书文佩身，万灾不经，身康气强，五官精明，长保家国，永亨利贞。 道士书白帝真文，置西方，则西岳仙官至。 长斋百日，精思灵宝尊神，则天真下降，给太素玉女六人，取西岳神仙芝草不死之药。 白帝鬼魔远舍六万里，西方凶悖恶兽毒螫皆不生害心，反善仁人。 长斋修行二十四年，身得神仙。 但佩此文，亦得尸解，转轮成仙。 国土西方及秋三月有灾，欲使西乡安镇，当朱书白石上，置西方六日。 其方灾自灭，凶逆自消。 西方自归，善祥来游，灵兽飞轩，金雀衔符，五老归宾，国宁民休。 书文佩身，神明交游，灾不加身，与五帝同厨，子孙昌炽，世享王侯。 与善因缘，何虑何忧。 道士书黑帝真文，置北方，则北岳仙官至。 长斋百日，精思灵宝尊神，则天真下降，给太玄玉女五人，取北岳神仙芝草不死之药。 黑帝鬼魔远舍五万里，北方凶悖恶兽毒螫皆不生害心，反善仁人。 长斋修行二十四年，身得神仙。 但佩此文，亦得尸解，转轮成仙。 国土北方及冬三月有灾，欲使北乡安镇，当朱书黑石上，置北方五日。 其方灾自消，凶恶自灭。 北方自宾，善瑞日昌，地藏发泄，金玉露形，天人歌咏，国富民丰。 书文佩身，万灾消亡，寿同天地，福禄永光，所向所求，莫不利贞，子孙昌盛，世出贤明。 道言：学至道上法，修奉斋戒，思神念道，上希灵真，灭魔却试，皆当先按灵宝上元旧格，施安真文，镇於方面。 灵真降室，五帝官属侍卫门户，鬼魔消灭，所向成从。 赤书青帝真文於青缯上，置室东壁。 赤书赤帝真文绛缯上，置南壁。 赤书黄帝真文黄缯上，置中央。 赤书白帝真文白缯上，置西壁。 赤书黑帝真文黑缯上，置北壁。 施安五篇於斋堂之中，朝暮烧香，随方礼拜，不得杂俗异人干入堂内。 此皆方方各有威神，玉童、玉女侍卫，犯之奏罪九天，冥考立加，奉者明慎禁忌。 九气青天中有元始青灵之童，讳开阳青，典青帝赤书真文。 青灵童长九寸，衣青羽衣，手执青麾，侍文左。 学者应思此神降己身，百日精念，灵真见形，所求立感。 有佩真文，此童亦恒在己肝府之中，致青芽之精。 三气丹天中有元始赤灵之童，讳丹湶珠，典赤帝赤书真文。 赤灵童长三寸，衣赤羽衣，手执赤节，侍文前。 学者应思此神降己身，百日精念，灵真见形，所求易感。 有佩真文，此童亦恒在己心府之中，致赤芽之精。 中央黄天中有元始黄灵之童，讳洪瑛，典黄帝赤书真文。 黄灵童长一寸二分，衣黄羽衣，手执黄钺，侍文中央。 学者应思此神降己身，百日精念，灵真见形，所求立感。 有佩真文，此童则恒在己脾府之中，致黄芽之精。 七气素天中有元始素灵之童，讳明石流，典白帝赤书真文，素灵之童长七寸，衣白羽衣，手执白旗侍文右。 学者应思此神降己身，百日精念，灵真见形，所求立感。",
      "translated_text": "After a hundred days of strict fasting and meditating upon the sacred *Lingbao* deities, the celestial perfected shall descend, and twelve jade maidens of the Yellow Essence shall be granted to gather the divine *zhi* herbs of immortality from the Central Marchmount. The ghostly demons of the Yellow Thearch shall flee twelve myriad leagues, and the malevolent beasts and venomous creatures of the central realm shall cease their harmful intent, turning instead to cherish the virtuous. After twenty-four years of fasting and cultivation, one shall attain the body of a divine immortal. Merely wearing this writ shall also enable *shijie*—liberation through simulated death—and transformation into an immortal through the revolving wheel.\n\nShould the central realm or the transitional months of the four seasons suffer calamity, and one wishes to pacify and stabilize the Middle Kingdom, inscribe the text in vermilion upon yellow stone and place it in the center for twelve days. The disaster shall vanish of itself, and malevolence shall dissolve. The four quarters shall live in harmony, auspicious omens shall arise spontaneously, qilin shall come to submit, white tigers shall roam the courtyards, the state shall prosper, the people shall flourish, and all under heaven shall enjoy great peace. Wearing the inscribed writ upon the body shall avert all disasters, strengthen the body and vital qi, sharpen the five senses, and perpetually safeguard both household and state, ensuring everlasting prosperity and uprightness.\n\nWhen the Daoist inscribes the *True Writ of the White Thearch* and places it in the west, the immortals of the Western Marchmount shall arrive.\n\nAfter a hundred days of strict fasting and meditating upon the sacred *Lingbao* deities, the celestial perfected shall descend, and six maidens of the Grand Simplicity shall be granted to gather the divine *zhi* herbs of immortality from the Western Marchmount. The ghostly demons of the White Thearch shall flee six myriad leagues, and the malevolent beasts and venomous creatures of the western realm shall cease their harmful intent, turning instead to cherish the virtuous. After twenty-four years of fasting and cultivation, one shall attain the body of a divine immortal. Merely wearing this writ shall also enable *shijie*—liberation through simulated death—and transformation into an immortal through the revolving wheel.\n\nShould the western realm or the three months of autumn suffer calamity, and one wishes to pacify and stabilize the western quarter, inscribe the text in vermilion upon white stone and place it in the west for six days. The disasters of that region shall vanish of itself, and malevolence shall dissolve. The west shall submit of itself, auspicious omens shall come to roam, divine beasts shall soar in flight, golden sparrows shall bear talismans, the Five Elders shall come as guests, the state shall be at peace, and the people shall rest. Wearing the inscribed writ upon the body shall enable communion with divine spirits, avert all disasters, share the same kitchen as the Five Thearchs, and ensure that descendants flourish, enjoying the rank of kings and marquises for generations. With such good karmic conditions, what cause for worry or sorrow remains?\n\nWhen the Daoist inscribes the *True Writ of the Black Thearch* and places it in the north, the immortals of the Northern Marchmount shall arrive.\n\nAfter a hundred days of strict fasting and meditating upon the sacred *Lingbao* deities, the celestial perfected shall descend, and five maidens of the Grand Mystery shall be granted to gather the divine *zhi* herbs of immortality from the Northern Marchmount. The ghostly demons of the Black Thearch shall flee five myriad leagues, and the malevolent beasts and venomous creatures of the northern realm shall cease their harmful intent, turning instead to cherish the virtuous. After twenty-four years of fasting and cultivation, one shall attain the body of a divine immortal. Merely wearing this writ shall also enable *shijie*—liberation through simulated death—and transformation into an immortal through the revolving wheel.\n\nShould the northern realm or the three months of winter suffer calamity, and one wishes to pacify and stabilize the northern quarter, inscribe the text in vermilion upon black stone and place it in the north for five days. The disasters of that region shall dissolve of themselves, and malevolence shall vanish. The north shall submit of itself, auspicious omens shall flourish daily, the treasures of the earth shall be revealed, gold and jade shall manifest, celestial beings shall chant hymns, the state shall be wealthy, and the people shall prosper. Wearing the inscribed writ upon the body shall dispel all disasters, grant a lifespan equal to heaven and earth, ensure everlasting fortune and emolument, and render all endeavors and aspirations upright and propitious. Descendants shall flourish, and generations of sages shall arise.\n\nThe Dao teaches: Those who study the supreme Daoist methods and observe the fasts and precepts must meditate upon the spirits and contemplate the Dao, aspiring to the celestial perfected, dispelling demons, and overcoming trials. All must first follow the ancient regulations of the *Lingbao* Upper Primordial, perform the installation of the true writs, and place them in the respective quarters. The divine perfected shall descend into the chamber, the officials and retinue of the Five Thearchs shall guard the gates, ghostly demons shall vanish, and all endeavors shall succeed.\n\nInscribe the *True Writ of the Azure Thearch* in vermilion upon azure silk and place it on the eastern wall of the chamber. Inscribe the *True Writ of the Vermilion Thearch* in vermilion upon crimson silk and place it on the southern wall. Inscribe the *True Writ of the Yellow Thearch* in vermilion upon yellow silk and place it in the center. Inscribe the *True Writ of the White Thearch* in vermilion upon white silk and place it on the western wall. Inscribe the *True Writ of the Black Thearch* in vermilion upon black silk and place it on the northern wall. Install these five writs within the fasting hall, burn incense morning and evening, and pay homage in the respective directions. No profane or heterodox persons may enter the hall. Each writ possesses its own mighty spirits, with jade lads and jade maidens in attendance. To violate these writs is to invite indictment before the Nine Heavens, where dark punishments shall be meted out immediately. Those who uphold them must clearly observe the prohibitions.\n\nWithin the Azure Heaven of the Nine Qi resides the Primordial Azure Lad of the Origin, whose taboo name is Kaiyang Qing. He oversees the *True Writ of the Azure Thearch* inscribed in vermilion. The Azure Lad stands nine inches tall, clad in azure feathered robes, and holds a green banner in his hand, standing to the left of the writ. Those who study the Dao should meditate upon this spirit descending into their own body. After a hundred days of focused contemplation, the divine perfected shall manifest in form, and all prayers shall be swiftly answered. Those who wear the true writ shall find this lad ever present within their liver palace, bestowing the essence of the green sprout.\n\nWithin the Cinnabar Heaven of the Three Qi resides the Primordial Vermilion Lad of the Origin, whose taboo name is Dan Quan Zhu. He oversees the *True Writ of the Vermilion Thearch* inscribed in vermilion. The Vermilion Lad stands three inches tall, clad in crimson feathered robes, and holds a red staff in his hand, standing before the writ. Those who study the Dao should meditate upon this spirit descending into their own body. After a hundred days of focused contemplation, the divine perfected shall manifest in form, and all prayers shall be readily answered. Those who wear the true writ shall find this lad ever present within their heart palace, bestowing the essence of the red sprout.\n\nWithin the Yellow Heaven of the Center resides the Primordial Yellow Lad of the Origin, whose taboo name is Hong Ying. He oversees the *True Writ of the Yellow Thearch* inscribed in vermilion. The Yellow Lad stands one inch and two fen tall, clad in yellow feathered robes, and holds a yellow halberd in his hand, standing at the center of the writ. Those who study the Dao should meditate upon this spirit descending into their own body. After a hundred days of focused contemplation, the divine perfected shall manifest in form, and all prayers shall be swiftly answered. Those who wear the true writ shall find this lad ever present within their spleen palace, bestowing the essence of the yellow sprout.\n\nWithin the White Heaven of the Seven Qi resides the Primordial White Lad of the Origin, whose taboo name is Ming Shi Liu. He oversees the *True Writ of the White Thearch* inscribed in vermilion. The White Lad stands seven inches tall, clad in white feathered robes, and holds a white banner in his hand, standing to the right of the writ. Those who study the Dao should meditate upon this spirit descending into their own body. After a hundred days of focused contemplation, the divine perfected shall manifest in form, and all prayers shall be swiftly answered.",
      "overlap_context": "ly and sing, celestial beings shall chant hymns, and the state shall enjoy great peace. Wearing the inscribed writ upon the body shall prevent all untimely deaths, dispel misfortune and impurity, summon divine spirits, and bring boundless blessings. It shall prolong life and bestow longevity, prosper the household, and secure the state’s tranquility.\n\nWhen the Daoist inscribes the *True Writ of the Yellow Thearch* and places it in the center, the immortals of the Central Marchmount shall arrive.",
      "start_char": 1248,
      "end_char": 2501,
      "start_sentence": 54,
      "end_sentence": 103,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.24070858955383,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝五老摄召北酆鬼魔赤书玉诀.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "有佩真文，此童则恒在己肺府之中，致素芽之精。 五气玄天中有元始黑灵之童，讳玉滋，曲黑帝赤书真文。 黑灵之童长五寸，衣黑羽衣； 手执黑幢，侍文后。 学者应思此神降己身，百日精念，灵真见形，所求立感。 有佩真文，此童则恒在己肾府之中，致玄芽之精。 此五帝灵童与元始五老同生，主五篇真文，上统九天之气，下领五岳，中主人五藏，引五芽之精，补养人身，服食五芽，不知此神，终而无感，徒劳疲勤。 洞玄灵宝五老摄召北酆鬼魔赤书玉诀竟",
      "translated_text": "Those who wear the true writ shall find this lad ever present within their lung palace, bestowing the essence of the white sprout.\n\nWithin the Dark Heaven of the Five Qi resides the Primordial Black Lad of the Origin, whose taboo name is Yu Zi. He oversees the *True Writ of the Dark Thearch* inscribed in vermilion. The Black Lad stands five inches tall, clad in black feathered robes, and holds a black banner in his hand, standing behind the writ. Those who study the Dao should meditate upon this spirit descending into their own body. After a hundred days of focused contemplation, the divine perfected shall manifest in form, and all prayers shall be swiftly answered. Those who wear the true writ shall find this lad ever present within their kidney palace, bestowing the essence of the dark sprout.\n\nThese Five Thearch Lads of the Divine Perfected are born coeval with the Primordial Five Elders. They govern the five scrolls of the true writ, above commanding the qi of the Nine Heavens, below presiding over the Five Peaks, and within mastering the five viscera. They draw forth the essence of the five sprouts to nourish the human body. Those who consume the five sprouts yet remain ignorant of these spirits shall labor in vain, their efforts yielding no response.\n\nHere ends the *Cavernous Mystery Numinous Treasure Jade Formula of the Five Elders’ Summons of the Beasts and Demons of Fengdu*.",
      "overlap_context": " White Lad of the Origin, whose taboo name is Ming Shi Liu. He oversees the *True Writ of the White Thearch* inscribed in vermilion. The White Lad stands seven inches tall, clad in white feathered robes, and holds a white banner in his hand, standing to the right of the writ. Those who study the Dao should meditate upon this spirit descending into their own body. After a hundred days of focused contemplation, the divine perfected shall manifest in form, and all prayers shall be swiftly answered.",
      "start_char": 2501,
      "end_char": 2712,
      "start_sentence": 104,
      "end_sentence": 111,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.646744012832642,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝五老摄召北酆鬼魔赤书玉诀.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}