{
  "source_id": "洞玄灵宝真灵位业图",
  "source_file": "chunked_daozang\\洞玄灵宝真灵位业图.json",
  "total_chunks": 20,
  "total_original_chars": 8525,
  "total_translated_chars": 43554,
  "total_translation_time": 262.2480032444,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\谱箓类\\洞玄灵宝真灵位业图.txt",
    "category": "谱箓类"
  },
  "full_translation": "**The Chart of the True Spirits’ Ranks and Duties of the Dongxuan Lingbao**\n\n**Title:** *The Chart of the True Spirits’ Ranks and Duties of the Dongxuan Lingbao*\nCompiled by Taoist Tao Hongjing of the Liang dynasty; collated by Taoist Lüqiu Fangyuan in the late Tang. Contains the register of immortals and perfected beings of the Shangqing lineage. One scroll.\n**Source text:** *Zhengtong Daozang* (Daoist Canon of the Zhengtong Era), *Dongzhen* section, *Pulu* (Registers) category.\n\n---\n\n### *The Chart of the True Spirits’ Ranks and Duties of the Dongxuan Lingbao*\n\n#### Preface\nGazing upward to mirror the subtle essence, one discerns the vast and minute of radiant luminosity; looking downward upon the level expanse, one perceives the loftiness and profundity of mountains and seas. Searching and inquiring into the web of humanity, one exhausts the gradations of ranks and orders; studying and synthesizing the celestial scriptures, one fathoms the stages and duties of the true spirits.\n\nYet names and titles may be hidden or manifest, and designations of learning may advance or recede. Within the four palaces, doubts and similarities intermingle. Now, it is fitting to rectify and classify, to verify and collate the rituals and vestments, to equalize their heights and depths, and to demarcate their palace domains.\n\nThere are also instances of singular designations—such as the Supreme August Dao Lord and the Five Emperors and Seven Elders—of which this is but one example. Some merely list names, like the cases of Mo Yu and Meng Zhuo. Others hold the same rank but differ in office, such as the Four Emperors of the Golden Tower and the Four Perfected of the Great Ultimate, as well as those in subordinate teachings. Those whose duties are equal but whose traces differ are exemplified by the various *bu gang* (step-registers).\n\nFor instance, the Perfected of the Rare Grove serves as the Right Duke of the Grand Tenuity, while also overseeing the Prime Minister of the Nine Palaces. Yet it remains unclear whether he is the Supreme Clarity of the Northern Banquet or a familiar attendant of the lower ranks. Such cases abound, and definitive proof is elusive.\n\nThus, I have followed the principle of inheriting their designated roles while aligning them with the highest domain. Matters are roughly arranged in order, and a brief exposition is provided in the subsequent sections.\n\nShould my shallow understanding, born of inferior birth, rashly rank the exalted sages, disrupting the proper order of ascent and descent and confounding the original hierarchy of steps, I would incur the censure of the Mystic Bureau and entangle myself in the retributions of the Nether Court. With reverence, I humbly present this, beseeching illumination. If it is deemed improper, I pray for admonishment.\n\nWhat is herein expounded and connected truly embodies the profound purport of the annotations and preserves the essential aim of devotion. In prayers and supplications, one must defer to the hierarchy of ranks; in encounters with the true and the transcendent, one must discern the weight of the engagement.\n\nThus, the Three Lords jointly declined, first addressing the errors of those whose learning has not yet grasped the essence. When lower ranks occupy higher positions, even the wise may suffer from obstructions of understanding. Though all may bear the title of Perfected, the true grades number in the dozens; though all may be called Immortals, the ranks of immortals span billions. Without precise mastery of the details and a rough understanding of the lineage, one is like a rustic entering the imperial court, mistaking a crimson-robed clerk for a high official, or a Goguryeo tribesman in the Central Kingdom, calling everyone a *canjun*. How could they distinguish the noble from the base or discern the differences in titles and ranks?\n\n**Preface by Tao Hongjing**\n\n---\n\n### *The Chart of the True Spirits’ Ranks and Duties of the Dongxuan Lingbao* #1\nCompiled by Master Zhenbai of the Liang, Tao Hongjing\nCollated by Master Miaoyou of Tiantai Mountain, the Purple-robed Lüqiu Fangyuan of Xuantong\n\n**Jade Clarity Palace of the Three Primes**\n**Upper First Central Position**\n\n**Upper First Central Position**\n\n**Upper Conjoined Position**\nThe Vacuous August Dao Lord, styled the Primordial Celestial Worthy.\n\n**Left Position**\nThe Five Numinous Seven Luminants, the Intermingled Birth, the Lofty August Dao Lord.\nThe Eastern Brilliance Lofty August Vacuous August Dao Lord.\nThe Western Florescence Lofty August Vacuous August Dao Lord.\nThe Northern Mystery Lofty August Vacuous August Dao Lord.\nThe Southern Vermilion Lofty August Vacuous August Dao Lord.\nThe Four Dao Lords of the Upper Prime Palace of Jade Clarity, each bearing a taboo name.\nThe Six Dao Lords of the Purple Clarity Middle Prime Palace of Jade Clarity, each bearing a taboo name.\nThe Four Prime Lords of the Lofty Clarity Lower Prime Palace of Jade Clarity, each bearing a taboo name.\nThe Ten Lords of the Jade Clarity Central Dispersed Positions, whose taboo names are not revealed.\n\n**Right Position**\nThe Purple Vacuous Lofty August Primordial August Dao Lord.\nThe Cavernous Vacuous Three Primes, the Grand Brilliance Lofty August Supreme August Dao Lord.\nThe Grand Simplicity Lofty Vacuous Supreme Ultimate Purple August Dao Lord.\nThe Vacuous Brilliance Purple Orchid Middle Prime Lofty August Peak August Dao Lord.\nThe Three Primes Upper Mystery Aged Vacuous August Primordial Dawn Lord.\nThe Three Primes Four Poles Upper Prime Vacuous August Primordial Numinous Lord.\nThe Three Primes Dawn Central Yellow Radiance Vacuous August Primordial Terrace Lord.\nThe Three Primes Purple Reflection Wielding Spirit Vacuous Birth Master True Primordial Womb Lord.\nThe Jade Mystery Grand August Lord.\nThe Supreme August Dao Lord.\nThe Jade August Dao Lord.\nThe Clarity Mystery Dao Lord.\nThe Supreme August Heavenly Thearch.\nThe Jade Heaven Grand Unity Lord.\nThe Grand Lofty Vacuous August Dao Lord.\nThe Grand Lofty Jade Perfected Guardian August Dao Lord.\nThe Mysterious August Lofty Perfected.\nThe Grand Unity Jade Lord.\nThe Lofty August Jade Thearch.\n\nWithin the Jade Clarity Realm, the Primordial Celestial Worthy presides; all Dao Lords below receive decrees to study the Dao and issue commands to the Perfected. The Grand Tenuity Heaven’s Thearchs come to receive duties, yet remain uninvolved with the lower realms. From the Nine Palaces upward to the Highest Clarity below, the Lofty Perfected and Transcendent Officials all attend the celestial banquets.\n\n**Second Central Position**\nThe Highest Clarity Lofty Sage Grand Lofty Jade Dawn Mysterious August Great Dao Lord, sovereign over the myriad Dao.\n\n**Left Position**\nThe Left Sage Purple Dawn Grand Tenuity Heavenly Thearch Dao Lord.\nThe Left Sage Southern Culmen Southern Marchmount Perfected, Left Transcendent Duke, Grand Vacuous Perfected, Red Pine Master. Disciple of the Yellow Venerable Lord, master of Master Pei.\nThe Left Assistant, Later Sage Supreme Minister, Western Region Western Culmen Perfected, Governor of All Perfected. Surnamed Wang, taboo name *Yuan*, style *Fangping*. Disciple of the Purple Yang Lord, master of the Controller of Destinies, Master Mao.\nThe Purple Clarity Grand Simplicity Lofty Vacuous Cavernous Radiance Dao Lord.\nThe Grand Vacuous Upper Empyrean Soaring Dawn Central Dao Lord, Red Pine.\nThe Grand Tenuity Eastern Radiance Fusang Vermilion Forest Great Thearch Supreme Dao Lord.\nThe Later Sage Grand Preceptor, Grand Tenuity Left Perfected Guardian August Dao Lord.\nThe Purple Brilliance Grand Tenuity Nine Dao Lofty Prime Jade Dawn Dao Lord.\nThe Purple Prime Grand Tenuity Eight Simplicities Three Primes Mysterious Dawn Dao Lord.\nThe Nine Subtleties Grand Perfected Jade Guardian King, Golden Watchtower Upper Minister, Grand Controller of Destinies, Lofty Dawn Preceptor.\nThe Azure Florescence Lad of the Eastern Sea, Lord Wang Qinghua.\nCommanding the Nine Palaces Upper Minister, Elder of the Long Mile, Master Xue. Attained the Dao in the Zhou dynasty, elder brother of Prefect Xu in a former life.\nThe Grand Tenuity Right Perfected Duke, commanding the Nine Palaces Upper Minister, Master Yan of the Rare Grove. From youth, received the mandate of the Heavenly King, replacing Lord Wang.\nThe Controller of Destinies, Eastern Marchmount Upper Perfected Minister, Grand Prime Perfected, Master Mao. The Great Master Mao, taboo name *Ying*, style *Shushen*.\nThe Left Minister Transcendent Marquis, Perfected Lord Xu. Taboo name *Mu*, disciple of the Southern Marchmount Lady, served the Jin as Protectorate General, later retired to Mount Juqu.\nThe Azure Canopy Perfected, Attendant to the Thearch of Dawn, Master Guo, personal name *Shigan*.\nThe Purple Yang Left Perfected, Master Zhou Yishan.\nThe Clarity Numinous Perfected, Master Pei. A native of Right Fufeng in the Han, attained the Dao in the Han dynasty.\nThe Numinous Flight Grand Perfected, Grandee of the Supreme Lofty.\nThe Attendant to the Thearch of Dawn, Eastern Florescence Upper Assistant Controller of Destinies, Master Yang.\nThe Dawn-Assisting Grandee, Master Shi Shumen.\nThe Orthodox Unity Feathered Dawn Marquis, Master Yang Ziming.\nThe Master of the Mysterious Continent, Dao Lord of the Supreme Lofty, Master Gongzi. Surnamed Qin, overseer of memorials on transcendent names.\nThe Scripture-Commanding Transcendent Earl, Grand Guardian Perfected.\nThe Eight Mysteries Transcendent Earl, Right Transcendent Duke, Master Gu.\nThe Orthodox Unity Left Mystery Bearer of the Canopy, Master Qie Weixuan.\nThe Embroidered Robe Envoy, Meng Liuqi.\nThe Grand Simplicity Palace Officer, Guardian of Prohibitions, Transcendent Gentleman Qiu Wenjian.\nThe Left Yang King.\nHua Zhongjie.\nThe Embroidered Robe Envoy, Xi Linzao.\nThe Right Consort’s Handmaiden, Zhao Yueluo.\nThe Three Heavens Left Palace Direct Inspector, Guan Changtiao.\nThe Leisurely Domain Palace.\nThe Eight Radiance City.\nThe Seven Numinous Terrace.\nThe Phoenix Terrace Jeweled Watchtower.\nThe Golden Dawn Florescence Watchtower.\n\n**Right Position**\nThe Right Sage Golden Watchtower Thearch of Dawn, Later Sage Mysterious Prime Dao Lord. Destined to descend in the *renchen* cycle.\nThe Right Assistant, Attendant to the Thearch of Dawn, commanding the Five Marchmounts Controller of Destinies, Right Adjutant Master of the Paulownia Hollow, Perfected of the Golden Court Palace, Lord Wang. Taboo name *Jin*, son of the Numinous King, descended to teach.\nThe Right Assistant, Lesser Grotto Heaven of the Grand Simplicity, Grand Vacuous Perfected, Four Offices Three Primes Right Guardian Duke, Lord Wang. Taboo name *Bao*, master of Lady Wei, descended to teach.\nThe Attendant to the Thearch of Dawn, Right Transcendent Duke, Master Xu. Son of the Prefect, taboo name *Hui*.\nThe Supreme Lofty Elder of the Mysterious Continent Transcendent Capital. Governs the Purple Cassia Palace of the Mysterious Continent, sovereign of the Mysterious Continent.\nThe Grand Guardian Jade Gentleman, Master Li, personal name *Fei*.\nThe Attendant to the Thearch of Dawn, Observer Grandee, Nine Palaces Grand Herald, Jade Dawn Gentleman.\nThe Northern Window’s Disciple, Central Attendant Transcendent. Surnamed Fan, taboo name *Yao*, style *Dushi*, formerly named *Yong*. Served as Gentleman of the Interior in the Han Emperor Huan’s court, compiled the *Biography of Lady Wei*.\n**Female Perfected Positions**\nThe Purple Tenuity Primordial Numinous White Jade Tortoise Terrace Nine Numinous Grand Perfected Primordial Lady.\nThe Purple Vacuous Primordial Lady, commanding the Upper Perfected Controller of Destinies, Southern Marchmount Lady Wei. Taboo name *Huacun*, style *Xian’an*, disciple of the Lesser Grotto Lord Wang, master of Master Yang.\nThe Eight Numinous Dao Mother, Western Marchmount Lady Jiang.\nThe Six Subtleties Northern Sea Mysterious Clarity Lady.\nThe Upper Perfected Eastern Palace Guardian Lady.\nThe Seven Numinous Northern Han Stone Lady.\nThe Purple Clarity Upper Palace Nine Florescence Perfected Consort. Surnamed An, descended upon Mount Mao in the Jin dynasty.\nThe Purple Vacuous Left Palace Lady Guo.\nThe Grand Ultimate Central Florescence Stone Lady.\nThe Grand Perfected Lady Wang.\nThe Azure Billows Cloud Grove Right Radiance Lady Wang.\nThe Upper Consort of the Northern Culmen of the Vermilion Mound, Lady Guan.\n\nThe Radiant Numinous Lady Li of Fangzhang Terrace.\nThe Upper Perfected Lady of the Northern Marchmount.\nThe Lady of Jasper Florescence.\nThe Lady Feng of the Three Primordials.\nThe Lady Fan of the Ninefold Accomplishments of the Right Florescence.\nThe Lady Wang of the Purple Tenuity Left Palace. Taboo name *Qing’e*, style *Yuyin*, the twenty-sixth daughter of the Celestial Mother.\nThe Lady Du of Changling.\nThe Left Lady of the Grand Tenuity Mysterious Clarity.\nThe Right Radiance Lady Wang Huazhongfei.\nThe Divine Consort Zhen Youxiao of the Western Florescence.\nThe Purple Primordial Lady, Upper Guardian of the Southern Culmen of the Latter Sage.\nThe Grand Simplicity Primordial Lady, Upper Attendant of the Latter Sage.\nThe Jade Consort Chun Wenqi of the Eastern Florescence, younger sister of the Azure Lad.\nThe Central Attendant Lady Wang of the Eastern Palace, younger sister of the Peach Blossom Grotto Realized One.\nThe Upper Perfected Left Lady of Grand Harmony.\nThe Lady of the Western Han.\nThe Lady of Mount Hua.\nThe Divine Maiden Fang Su of Jade Clarity.\nThe Handmaiden Wang Shanghua of the Queen Mother of the West.\nDong Shuangcheng.\nShi Gongzi.\nYuan Jueqing.\nDi Chengjun.\nGuo Mixiang.\nGan Ruobin.\nLi Fangming.\nZhang Lingzi.\nPalace Officials of the Grand Thearch.\nJade Maidens of the Numinous Grove.\nJia Quting.\nPalace Officials of the Golden Watchtower.\nThe Grand Guardian Marquis Fan Faan.\nThe Transmitted Mandate Immortal Earl Ya Shuping.\nThe Jade Maiden Yan Jingzhu of the Eastern Florescence Palace.\nThe Handmaiden Song Bifei of the Upper Primordial Lady.\nThe Handmaiden Fan Yunhua of the Lord of the Immortal Dao.\nZhao Junzhu.\nWang Baoyi.\n\nHua Jingdi.\nLi Boyi.\nXianyu Lingjin.\nThe Hall of Grand Harmony.\nThe Hall of Luminous Yang.\nThe Gate of Medicinal Pearls.\nThe Chamber of Seven Radiance.\nThe Tower of Everlasting Continuity.\n\n**Third Central Rank**\nThe Grand Supreme Lord of the Golden Watchtower of the Great Ultimate, surnamed Li.\nOn the ren-chen day, he descended with teachings as the Master of Great Peace.\n\n**Left Rank**\nThe Left Perfected of the Great Ultimate, the Central Yellow Elder Lord.\nThe Left Perfected of the Great Ultimate, the Purple Yang Left Immortal Duke, the Hua Duke.\nThe Left Minister of the Great Ultimate, Huang Guanzi.\nThe Supreme Perfected Wen Shi Xiansheng Yin Xi.\nThe Vermilion Fire Cinnabar Spirit Palace: Gong Zhongyang and Gong Youyang.\nTwo brothers who received the Dao from the Green Youth Lord.\nThe Eastern Yang Perfected, Lingyang Ziming.\nThe Central Primordial Elder, the Central Supreme Xuanzi.\nThe Northern Ultimate Perfected, An Qisheng.\nThe Northern Ultimate Elder, the Supreme Immortal Sovereign of the Dark.\nThe Lord Emperor of Pure Harmony.\nThe Southern Ultimate Elder, the Supreme Perfected of Vermilion Mound.\nThe Azure Essence Master, Tai Wan Beiguzi.\nThe Dark Harmony Lord Emperor of Yin Mound.\nThe High Immortal Duke of the Great Ultimate, Yan Gai Gongzi.\nThe Immortal Duke of the Dark Continent.\nThe Left Immortal Duke of the Great Ultimate, Ge Xuan.\nDuring the Wu dynasty, he expounded the *Lingbao* scriptures and descended as an earthbound immortal.\nThe Western Ultimate Elder, Su Lingzi Qi.\nThe Five Elders, Supreme Perfected and Immortal Capital Elder Duke.\nCompiler of the *Purple Texts of the Numinous Writ*.\nThe Eastern Ultimate Elder, Fu Yang Gongzi.\nThe Left Duke of the Great Ultimate, Beigu Xiansheng.\nThe Three Heavens’ Protectors: Wang Chang and Zhao Sheng.\nThe Supreme Perfected Duke of the Great Ultimate, Kong Qiu.\nThe Dawn Attendant and Minister of the Three Heavens’ Controller of Perfected, Yan Hui.\nThe Perfected of the Dark Garden, the Yellow Emperor Xuanyuan.\nThe Dark Emperor Zhuanxu.\nGrandson of the Yellow Emperor, recipient of the *Five Talismans of Lingbao*.\nPrince Emperor Yu.\nGreat-grandson of the Yellow Emperor, recipient of the *Five Talismans of Lingbao*.\nEmperor Shun.\nConsumed the nine-cycled divine elixir, entered the Nine Doubts Mountain, and attained the Dao.\nCheng Zigao.\nRetired from ploughing during the reign of Tang.\n\nThe Way of the Step-by-Step Registers.\nXia Yu.\nReceived the *Nine Steps Method of Lingbao* from the Perfected of Mount Zhong, and achieved merit in flood control.\nKing Mu of Zhou.\nJourneyed to Kunlun and met the Queen Mother of the West.\nEmperor Yao.\nFeng Hou.\nMaster of the Yellow Emperor, originator of the *Four Fans*.\nXigui Zi.\nUnmanifested.\nPuyi.\nAs Zhuangzi said: \"Still clad in robes.\"\nFengche Zi.\nUnmanifested.\nZhili.\nClad in Robes.\nWang Ni.\nNie Que.\nChaofu.\nXu You.\nBian Sui.\nHua Feng.\nBeiren.\nZizhou.\nShanjuan.\nMa Huang.\nAn Gong.\nSurnamed Tao, rode the Red Dragon.\nDa Xiang.\nPersonal name Tuo.\n\nTo the Right:\nPerfected of the Great Ultimate’s Right, Xiliang Ziwen.\nPerfected of the Great Ultimate’s Right, Andu Ming.\nJiang Wenqi of the Vermilion Texts of the Dark Continent’s Immortal Capital.\nPerfected of Purple Yang, Fan Mingqi.\nPerfected of Utmost Obscurity, Pei Xuanren.\nImmortal Maiden of Great Mystery, Xiling Zidu.\nSima Jizhu.\nReceived the *Sword Liberation Way* from Xiling Zidu.\nImmortal Marquis of the Great Ultimate, Zhang Feng.\nSeven Perfected of the Pure Void of the Terrace of Wu.\nVice Minister of Fate of the Western Peak, Li Yizhongfu.\nMaster Zuo Yuanfang.\nEight Elderly Primordial Immortals.\nJade Gentleman of the Supreme Mystery of the Orthodox Unity, Wang Zhong and Bao Qiu.\nJade Maiden of Nanling.\nPerfected of Yang Valley, leading the Western Return, Fu Chunyu of Great Mystery.\nPerfected of Mount Rong, Right Immortal Duke, Fan Bohua.\nPerfected of Lushan, Overseer of the Great Ultimate’s West, Guo Youdu.\nGrand Minister of the Four Yellows, leading the Duke of the Northern Sea, Juanzi.\nSu Jun, Master.\nDharma Master of the Great Ultimate, Xu Laile.\nDuring the Wu dynasty, the *Dharma Wheel Sutra* was transmitted on Mount Tiantai by Ge Xian’gong.\nHandan Zhangjun.\nGengsang Zi.\n\nXiao Shi.\nThree Perfected of the Supreme Mystery of the Great One.\nDuring the Wu dynasty, descended upon Mount Tiantai to transmit the *Lingbao Sutra* to Ge Xian’gong.\nLiu Jing.\nGrand Minister of the Dark Continent, Grand Master of the Central Watch of the Great Ultimate, Su Jun.\nNamed Lin, styled Zixuan.\nDisciple of Juanzi, Master of Zhou Jun.\nNongyu.\nTwo Maidens.\nWhite Water Messenger.\nLord Chang Sang.\nMaster of Zhuangzi.\nWei Bianlang, Zhuang Zhou.\nQin Yi.\nJieyu.\nBohun.\nQie Jian.\nLao Ping.\n\n**Fourth Central Rank**\nMost High Lord Lao of Great Clarity.\nAs Lord of the Dao of Great Clarity, he oversees the myriad people from below.\n\n**Supreme August Most High Primordial Lord of the Great Dao of the Highest Origin.**\n\n**Left Rank**\nPerfected of Orthodox Unity, Master of the Three Heavens’ Dharma, Zhang, whose taboo name is Daoling.\nLeft Immortal Minister of Eastern Florescence, White Stone Sage.\nZhang Shumao.\nCelestial King of Primordial Beginning.\nMaster of the Queen Mother of the West.\nAugust Emperor of Mysterious Completion of the Azure Heaven.\nThese three hold the exalted ranks of Great Clarity but do not govern the mortal realm.\n\n**Lord of the Great Dao of the Southern Summit.**\nMost High Venerable.\nCelestial Thearch.\nNine Elderly Lords of the Immortal Capital.\nNine Qi Venerable.\nThese are all the Perfected Officials of the Eastern Palace of the Three Heavens of Great Clarity, through whom memorials and petitions are submitted regarding the attainments of Dao cultivation.\n\nPerfected of Central Marchmount, Gao Qiuzi.\nPerfected of Auspicious Clouds.\nMaster of Ghost Valley.\nPrince of Grand Clarity.\nHeavenly Gentleman of the Nine Heavens.\nSeven Direct Attendants of the Northern Dipper.\nPerfected of Fixed Qi.\nPerfected of Supervising Immortals.\nFive Immortal Ladies.\nLady of the Inner Realm.\nTwenty-Four Lords, Generals, and Officials.\nOne Thousand Two Hundred Lords, Generals, and Officials.\n\nTwo Streams of Qi-Transformation Congealed.\n\nZhao Boxuan.\nLiu Zixian.\nZang Yanfu.\nZhang Zifang.\nNing Zhongjun.\nYan Zhao Wang.\nMao Chucheng.\nLord of the Northern Terrace of Shaoshi Mountain, Thousand-Longevity.\nMaster Redpine.\nPerfected of Great Liang, Wei Xianren.\nImmortal Elder of Mount Hua, Qin Shuyin.\nPerfected of Ge Extension, Zhou Jitong.\nPerfected of Great Harmony, Shan Shiyuan.\nPerfected of Mount Gouqu, Recorder of the Right Prohibitions, Master Mao.\nPersonal name Gu, style Jiwei, Earth Perfected.\nPerfected of Pan Household, Right Prohibitions Gentleman, Wang Daoning.\nRight Duke of Great Clarity, Li Baozu.\nLeft Duke of Penglai, Song Chensheng.\nRight Duke of Penglai, Jia Bao’an.\nPerfected Elder of Mount Qian, Zhao Zuyang.\nImmortal Marquis of Mount Jiuyi, Zhang Shanggui.\nLeft Minister of Penglai, Jiang Shumao.\nZhou Dabin.\nMao Bodao.\nLiu Daogong.\nTwo attained the Way on Mount Wangwu.\nDongfang Shuo.\nMa Mingsheng.\nPeng Keng.\nWestward into the Flowing Sands.\nFeng Gang.\nHan Zhong.\nMo Di.\nSong Dashui Jie.\nYue Zichang.\nLi Ming.\nLei Ping compounded the elixir.\nFour Elders of Shangxi.\nEight Lords of Huainan.\nMaster Green Crow.\nLord of Yellow Mountain.\nYu Feng.\nFang Ming.\n\nLimu. Changyu. Zhuang Bowei, a man of the Han dynasty.\n\n**Right Position:**\nGreat Clarity Immortal King Zhao Chezi.\nGreat Clarity Immortal King Li Yuanrong.\nLesser Existence Immortal King Deng Lizǐ.\nController of the Five Marchmounts, Ximen Shudu.\nCentral Perfected, Song Dexuan.\nCentral Marchmount Immortal Minister, Yanmenzi.\nCentral Marchmount Perfected, Mengzi Zhuo.\nWestern Marchmount Perfected, Feng Yanshou.\nSouthern Marchmount Perfected, Master Fu.\nGreen City Perfected, Master Hongya.\nJiuyi Perfected, Han Weiyuan.\nMinshan Perfected, Yin Youzong.\nDirector of Destinies, Four Perfected of the Purple Terrace of Grand Primordial Record.\nCentral Marchmount Perfected, Wang Zhongfu.\nNorthern Mound Elder.\nGrand Mystery Elder.\nNorthern Ascendant Elder.\nSouthern Ascendant Elder.\nGrand Qi Elder.\nLife-Enhancing Elder.\nFlying Perfected Elder.\nNine Ways Elder.\nManifest Peace Elder.\nHundred Blessings Elder.\nHundred Thousand Spirit-Qi Elder.\n\n**Four Jade Maidens of the Register of Ascending Heaven.**\nThree Jade Maidens of Highest Heaven.\nOne Hundred Jade Maidens of the Three Heavens.\nTen Jade Maidens of the Green Waist Office.\nLesser Jade Maidens.\nNorthern Palace Jade Maidens.\nJade Maidens of the Five Thearchs.\nGrand Simplicity Jade Maidens.\nHeavenly Simplicity Jade Maidens.\nWhite Simplicity Jade Maidens.\nLevel Heaven Jade Maidens.\nSixth-Wu Jade Maidens.\nGreen Heaven Life-Enhancing Jade Maidens.\nDivine Elixir Jade Maidens.\nFive Currents Jade Maidens.\n*(Fifteen designations of Jade Maidens above.)*\n\n**Highest General.**\nHengshan Messenger.\nHighest Heaven Valiant.\nHeavenly Ding Valiant.\n*(The four persons above, each with personal names, command one hundred thousand celestial soldiers, styled the Four Generals.)*\n\nFlying Heaven Messenger.\nNine Heavens Messenger.\nNine Heavens Perfected King Messenger.\nHighest Immortal, Heaven-Opening Messenger.\nRoaming Heaven Messenger.\nGreat Clarity Messenger.\nSixth-Yi Messenger.\nSixth-Bing Messenger.\nSixth-Ding Messenger.\nSixth-Ren Messenger.\nSixth-Gui Messenger.\n*(Fifteen Messengers above, spirits of spontaneity.)*\n\n**Eastern Spirit, Ling Weiyang.**\n**Southern Spirit, Chi Piaonu.**\n**Western Spirit, Yao Pobao.**\n**Northern Spirit, Yin Houju.**\n**Central Spirit, Han Shuniu.**\n*(These Five Thearchs of Great Clarity are spirits of spontaneity.)*\n\n**Lords of the Five Marchmounts**, replaced every five hundred years.\n**River Marquis.**\n**River Earl.**\n*(These three ranks are filled by those who have attained the Way.)*\n\n**Western Marchmount Elder.**\n**Three Heavens Jade Lads.**\n**Luo River Goddess.**\n*(These three ranks are also filled by practitioners of the Way.)*\n\n**Flying Heaven Elder.**\n**Grand One, Central Yellow.**\n**Dark Ascendant Jade Lad.**\n**Master Fierce Beast.**\n*(These are spirits of spontaneity, governing the ghosts, spirits, birds, and beasts of the world.)*\n\nZhao Shengqi, on Mount Wangwu.\nYin Changsheng.\nLiu Weidao, a man of the Han dynasty.\nGuo Chongzi, of the Yin.\nGuo Shengzi, diviner of the Luo market.\nLord Zhou.\nXu Jidao, of Humming Crane Mountain.\nMaster Deerhide.\nQiu Jizi.\nDirector of Records.\nZhang Jujun.\nGuo Shaoyao.\nZhao Aier.\nWang Lulian.\n*(These last three are Female Perfected.)*\n\n**Perfected of Salvation from Suffering, Jun Gui.**\n**Controller of Danger.**\n**Controller of Adversity.**\n**Director of Destinies.**\n**Eight Awesomeness.**\n**Eliminator of Misfortune.**\n**Bo He.**\n**Hua Zǐqi.**\n**Bao Cha.**\n**Le Ba.**\n**Ge Hong**, who concealed himself on Mount Luofu.\n\n**Left Supreme King of the East.**\n**King of the Four Heavenly Offices.**\n**King of Mandated Longevity.**\n**King Assisting Destiny.**\n**King of Flying Perfected Tigers.**\n**King of the Nine Capitals, Remover of Death.**\n**Yin King of the Four Seas.**\n**Grand One Primordial Lady.**\n**Lord of Highest Emptiness.**\n**Upper Primordial Lady of Healing.**\n**Lady of the Seven Stars’ Jade Radiance.**\n**Lord of the Three Primordials and Myriad Blessings.**\n**Lady of Night Radiance.**\n**Lady of Harmonious Adaptation.**\n\n**Fifth Central Rank: Nine Palaces Minister of State.**\nSurnamed Zhang, named Feng, styled Gongxian, a native of Henei. Formerly the Controller of Destinies and Marquis of Prohibitions in Hebei, now the Duke of Transcendent Ascent of the Great Ultimate, presiding over the Northern Office, stationed in the Great Ultimate.\n\n**Left Rank:**\n**Left Chancellor.**\nPerfected of Pure Emptiness, who from youth received transmission from the King of Cavern-Heavens; succeeding the Perfected King, he has already ascended to the Upper Clarity.\n\n**Left Transcendent Duke** Guo Sichao, concurrently Canopy-Bearer of the Jade Terrace.\n\n**Left Transcendent Duke** Wang Yaofu.\nDisciple of the Red Lord, a man of the time of Duke Xian of Qi.\n\nXin Yanyun.\nDisciple of the Red Lord, who descended with his master. Dispersed rank, not yet appointed to office.\n\nZhu Ling Concubine Ding Shuying.\nGuanchengzi.\nMaster Yin Qianzi.\nMaster of Su Gate.\nZhou Shouling.\nMeng Deran.\nMaster Zheng Jingnü.\nLord Song.\nLi Facheng.\nMaster Zhao Guangxin.\nDeng Yuanbo.\nWang Xuanfu.\nMan of Huo Mountain.\nYin Qianzi.\nMount Hua.\nZhang Shisheng, who serves as Earl of the Eastern Source.\nLi Fanghui.\nThree men, all of the Jin who ingested wood.\n\nZhang Lizheng.\nMount Heng.\n\nAt the end of the Han, those who ingested yellow essence.\nZhi Mingqi.\nMount Heng.\nZheng Jingshi.\nMount Lu of Lujiang in Qianshan.\n\n**Right Position**\n**Right Minister**, already ascended to the Upper Clarity.\n**Right Protector** Duke Shih of Zhao, who received this position from Luo Nanminggong.\n**Right Protector** Controller of the Upper Duke Zhan.\n**Right Perfected Duke** Guo Shaojin.\n**Lady of Harmonious Dawn** Huang Jinghua, daughter of Huang Qiong.\n**Right Daoist Overseer of Civil Virtue** Zhang Shuyin.\n**Perfected One** Yu Junzhang.\n\n**Dispersed Ranks**\nZhang Chonghua, who ingested sesame at the beginning of the Jin.\nPing Zhongqing.\nMount Guacang, who received the [ ] realm.\nZhao Guangxin.\nLittle White Mountain at the end of the Wei.\nYu Gongsheng.\nWolf Mountain in the sea.\nZhu Ruzhi.\nRed Water Mountain.\nHuang Luzhi.\n**Duke of the Western Marchmount**, surnamed Ge, who restrained qi and summoned dragons.\nSun Tianguang, also named Deng.\nMo Changsheng, disciple of Zhou Dabin.\nXu Zhao, formerly in the Luo Feng capital as Right Controller of Dawn for the Eastern Bright Duke.\nXu Fu, styled Zhongxian, who cultivated the *Great Grotto Perfection Scripture*.\n\n**Sixth Middle Position**\n**Right Prohibition Officer** True Lord of Fixed Register, Central Mao Lord, who governs the Hua-Yang Grotto-Heaven.\n\n**Left Position**\n**Three Officials’ Life-Protecting** Lesser Mao Lord.\n**Three Officials’ Grand Judge** Li Feng.\n**Three Officials’ Grand Judge Guardian** Wang Fuzi.\nXun Zhonghou, whose name is not publicly known.\n**White Water Immortal Capital** Zhu Jiaofu.\n**Northern River Controller of Destiny and Prohibition Marquis** Tao Jun.\n**Left Judge of the Central Bureau** Han Chong, akin to a Grand Secretariat Director or Left Controller.\n**Lady of the Nine Palaces’ Harmonious Dawn**, Wen Jie.\n**Earthly Controller**.\n\nBao Jing, Prefect of Nanhai, Divine Marquis of Mount Tai, who oversees the Right Prohibition Bureau for Luo and Deng—Bao Yuanjie.\n\n**Earthly Immortals in Dispersed Positions**\nXu Huya, named Yi, styled Wenhui, who received the *Guard-the-One Way* from Master Yang.\nWang Zhen of Shangdang.\nMeng Jun of Jingzhao.\nLu Nüsheng of Mount Song—these three cultivated the *Three Ones* and the *True One*.\nZuǒ Yuanfang, disciple of Li Zhongfu, residing on Mount Xiao-Kuo.\nLuo Yu, Female Perfected of Mount Jiuyi, now on Mount Xiangdong.\nLady of Duling.\nSong Ji of Yi’an—these two both received the *Azure Essence Formula* from the Perfected of Western Liang, yet their positions are unrecorded, having entrusted themselves to the immortals; for now, they rank among the Earthly Perfected.\nXu Mai, styled Shuxuan, childhood name Ying, later renamed Yuanyou, now an Earthly Immortal of Eastern Florescence.\nWeng Daoyuan.\nJiang Bozhen—one account places them on Mount Meng, where they studied the Dao and gathered herbs, companions to Ying.\nGuo Shengzi.\nHuang Ziyang—one account says they were disciples of Lady Wei, who ate peach-bark; both were constant followers of Ge Xuan.\nGe Xuan.\n\nStyled Xiaoxian, a native of Juqu in Danyang and the paternal great-uncle of Zichuan. Initially dwelling on Mount Chang, he rode tigers and commanded spirits, reaching every place; his rank was in the Palace of the Supreme Ultimate.\n\nZheng Siyuan, disciple of Ge Xuan, entered Mount Kuocang in the first year of Yongchang of the Jin.\n\nDai Meng, originally surnamed Yan, named Ji, styled Zhongwei, disciple of Master Pei.\n\nXie Yun of Liyang, disciple of Dai Meng, attained the Dao in the time of Emperor Cheng of Jin.\n\nShi Cun, also called Wanpenzi. Among Confucius’ three thousand disciples, several attained the Dao.\n\nLiu Fenglin, a man of the Zhou, who ingested *huanglian*.\n\nZhang Zhaoqi, teacher of Fei Zhangfang.\n\nMaster Zhou. These two both studied the *Plain Writ* in seven scrolls and attained the Dao.\n\nThe Lei clan, who raised dragons.\n\nJiang Shu.\n\nTian Gong, styled Liu’an.\n\nMaster Pei’s subordinate, the Attendant of Jizhou.\n\nChi Luban, who was Huangchu Qi.\n\nFan Anyuan.\n\nJia Xuandao.\n\nLi Shusheng.\n\nYan Chengsheng.\n\nFu Daoliu.\n\nFour masters, all subordinate to the Bureau of Destiny, preside over the examination and testing of Dao learners on Mount Tai.\n\nPerfected One Fan Ziming.\nDragon Might Elder.\nLiu Shaoweng.\nMount Hua.\nLiang Boluan.\nMaster Fan.\nWu Mu, a man of Chang’an, who in his youth served as a county clerk.\nZhu [missing character], a man of Chenliu, formerly a bandit.\nGuo Duan, a man of Yingchuan, orphaned in youth and serving as a county clerk.\nFan Boci, a man of Guiyang, who in his youth suffered from demonic illness.\nBao Shuyang.\nWang Yangbo.\nDuan Jizheng.\nLiu Weihui.\nFour disciples of Master Xiling Zidu.\n\nSong Xuande.\nMount Songgao.\nLi Dong.\nOffice of Youthful Primordium.\nPalace of Leisurely Ease—all male Perfected.\nPalace of Transformative Ascent.\nEighty-three persons.\nTerrace of Embracing the True—only two hundred persons, all female Perfected.\n\n[Right Position]\nRight Director of Central Governance, Supervisor Liu Yi.\nKeeper of the Authority and Enforcer of the Law, Lang Chunyu Zhen.\nDirector of Prohibitions, Zhang Xuanbin.\nOfficer in Charge of Rain and Water, also Keeper of the Writs of Life Protection.\n\nMaster of the Office of Youthful Primordium, Marquis Shanghou Liu Kuan—this being the Office of Life Protection.\nFour Assistants:\nZhao Weibo, in charge of the registers of immortals and of torrential rain and water.\nYue Changzhi, in charge of disasters and calamities.\nZheng Zhizheng, in charge of examinations and records.\nTang Gongfang, in charge of life and death.\n\nSeven Attendant Gentlemen of the Dawn, equivalent to the Censor-in-Chief.\nThree male Perfected:\nXia Fu, styled Zitian, a man of Chenliu, disciple of the Perfected One of Tong Bridge.\nTwo persons, names not recorded.\nFour female Perfected:\nZhou Xiayou, a woman of Ancheng in Runan, daughter of Zhou Chang, Prefect of Henan.\nZhang Taozhi, a woman of Pei, mother of Zhu Yu, Metropolitan Inspector.\nTwo persons, names not recorded.\nTwo Supervisors.\n\nFan Youchong, a man of Liaoxi.\nHan Shangshu—this being Li Zheng, a man of Henei.\nCommanders of the Demon-Quelling Host:\nWang Yan.\nFan Liang.\nFu Huang.\nChu Xian.\nFour persons, already transcended.\n\nEarthbound Immortals of Unassigned Rank:\nSong Laizi of Central Marchmount, formerly Market Director of Chu, who encountered Feng Yanshou.\nMaster Li of Central Marchmount.\nFive disciples of Bian Que:\nZirong.\nZiming.\nZiwei.\nZixi.\nZiyou.\nCrown Prince Zhao.\nThe Master Who Ingests Wood.\nGeneral Master.\nTeacher of Zhi Ziyuan.\nZhi Ziyuan, who in his youth studied under Master Pei.\nLu Sheng.\nMarquis Hou.\nShi Sheng, who entered the Eastern Sea as an emissary of the First Emperor.\nWang Zhangxuan, Immortal of Mount Linwu.\nMaster Shantu.\nA minister of King Ai of Zhou and teacher of Zhang Jinbao.\nChixuzi, teacher of Xia Mingchen.\nMaster Qinggu.\nTeacher of Liu Shangzhui.\nHuichezi, teacher of Chunyu Dianbing.\nShi Changsheng, teacher of Zhou Mingchen.\nDongguo Youping, teacher of Taobei River.\nZheng Zizhen of Mount Yangdi.\nDeng Yunshan.\nTang Lan of Mount Hua.\nXihe Jigong, teacher of Zhang Lijin.\nZhou Zhengshi.\nDiao Daolin, teacher of Long Bogao.\nGuo Zihua.\nZhao Shuji.\nZhang Jilian.\nThree persons residing on Mount Huo.\nZhao Gongcheng of Mount Heming.\nFan Qiulin.\nA female Perfected, teacher of Zhao Weibo in the Six Jia.\nMaster Xuyang, who transformed into white stone.\nJiqiuzi.\nCui Wenzi.\nShangqiuzi, who ingested calamus and did not age.\nLiu Gen, who ingested licorice.\nJie Xiang.\nBaiyang Gong.\n\nThose whose names remain unrecorded.\nJie Yan.\nDisciple of Baiyang.\nLiu Gang’s wife.\nYan Qing.\nAll six above excelled in qi-binding and incantations.\nChen Zhonglin.\nDao Lord.\nZhao Shudao.\nThree Perfected Ones of Mount Gaizhu.\nWang Shilong.\nDisciple of Xu Yuanyou.\nZhao Daoxuan.\nFu Taichu.\nFriend of Yuanyou.\nGong Youjie.\nLi Kailin.\nYuanyou’s respondent.\nWang Shaodao.\nFan Shusheng.\nLi Boshan.\nThree, markers of Tongchu Prefecture.\nLi Zhongwen.\nFu Zhili.\nFemale Perfected Dou Qiongying.\nHan Taihua.\nYounger sister of An Guo, wife of Li Guangli.\nLiu Chunlong.\nLi Xizi.\nWang Jinxian.\nYan’s daughter.\nGuo Shuxiang.\nZhao Sutai.\nXi’s daughter.\nZheng Tiansheng.\nMother of Deng Ai.\nXu Kedou.\nWife of the Chief Clerk.\nLi Zhuangu.\nWife of Xiahou Xuan.\nZhang Meizi.\nShi Shunü.\nXu’s daughter.\nMother of Song Piaojin.\nYounger sister of Bao Jing.\nZhang Weizi.\nFu He.\nTwo, masters of Hanzhen Terrace.\nBeyond the mountain to the east, Du Qi.\nXu Zongdu.\nYan Xiansheng.\nTwo, friends of Qi.\nSun Hanhua.\nFemale Perfected.\nChen Shijing.\nTwo, disciples of Qi.\nZhao Xi.\nMaster of the grotto-chamber beneath Mount Fang.\nZhang Zuchang.\nLiu Ping’e.\n\nLü Zihua.\nCai Tiansheng.\nLong Bogao.\nFive persons, all residing at Fang Terrace.\nXie Zhijian.\nWang Boliao.\nFan Yangzi He Miao.\nFeng Liang.\nLang Zong.\nFive persons, at Deer Track Grotto.\nWang Shuming.\nBao Yuanzhi.\nWife of Yin Gai.\nBeyond these three, the remaining thirty persons, all at the sheer grotto beneath Northern Mountain.\nXin Xuanzi.\nClaimed to be the Commandant of the Prohibited Void, controller of the ghosts and spirits of Wu and Yue.\nBi Gan.\nAt Mount Rong.\nLi Xi.\nA native of Nanyang.\nWu Guang.\nSeventh Middle Position.\nThe Great Emperor of the Northern Yin of Fengdu.\nThe Great Emperor Yandi of the Datiing clan, personal name Lǚ Jia, ancestral lord of all ghosts and spirits under heaven, ruling Mount Luofeng, succeeded every three thousand years.\n\nLeft Position:\nThe Supreme Minister of the Northern Emperor, Qin Shihuang.\nThe Grand Tutor of the Northern Emperor, Emperor Wu of Wei.\nThe Supreme Ministers of the Five Emperors.\nNot yet manifested.\nThe Duke of Ximing, leading the Northern Emperor’s Master, King Wen of Zhou.\nJunior Tutor.\nGuest and Friend, Emperor Xuan of Jin.\nCentral Protector-General, Zhou Yun.\nThe Duke of Dongming, leading the Master of the Dipper Lord, King Qi of Xia.\nGuest and Friend, Sun Ce.\n\nRight Division:\nChen.\nLike the Secretariat Supervisor of the mundane world.\nXu Zhao.\nAlready ascended through the Nine Palace Positions.\nThe Duke of Nanming, Shao Shi.\nOne account says the Duke of Dongming, already ascended as the Right Protector of the Nine Palaces.\nGuest and Friend, Emperor Gaozu of Han.\nThe Duke of Beiming, Wu Jizha.\nSon of King Shoumeng of Wu, uncle of Helü, Jizi of Yanling.\nGuest and Friend, Xun Yu.\nStyle name Wenruo, strategist of Emperor Wu of Wei, Han Minister of Works.\nZhao Shutai.\nWang Shiqing.\n\nUnmanifested.\nThese Four Ming Dukes oversee the four directions, each governing one Celestial Palace, holding office for one thousand six hundred years before qualifying to ascend as immortal officials. Those in other positions do not qualify.\n\nGhost Official: Northern Dipper Lord, King Wu of Zhou. Governs one Celestial Palace.\n\nThree Officials Chief Prohibition Officer: Duke Huan of Qi. Surname Jiang, personal name Xiaobai.\nWater Official Controller of Destiny: Duke Wen of Jin. Surname Ji, personal name Chong'er.\n\nTwo Grand Prohibition Officers, rank equivalent to the Director of the Imperial Secretariat:\nEmperor Guangwu of Han.\nSun Wentai. Personal name Jian.\n\nTwo Central Prohibition Officers, rank equivalent to the Director of the Central Secretariat:\nYan Huai. Style name Siji.\nYang Biao. Style name Wenguang.\n\nNorthern Emperor’s Southern Vermilion Yang Gate Spirit Barrier Marquis: Xi Jian. Formerly the Illustrious Rectifier of the Imperial Censorate, now holds a rank equivalent to the Deputy Director of the Imperial Secretariat.\n\nRight Prohibition Inspector: Xie Youyu. Personal name Kun. Formerly the Grand Master of Ceremonies of Jin.\n\nSima Deng Yue.\nRight Prohibition Inspector Attending the Imperial Morning Audience: Yu Yuan’gui. Personal name Liang, during the Jin dynasty held a rank equivalent to the Attendant-in-Ordinary and commanded the Right Guard. Another account states that Yuan’gui previously served as the Central Guard Grand General.\n\nSima Feng Huai. Style name Xiangsi, Grand Master of Ceremonies of Jin.\nHua Xin.\n\nChief Clerk: Yu Fan. Style name Changxiang, a native of Wuchang. Recruited by Yu Liang of Jiangzhou as his chief aide, but declined. Later, Central Guard Grand General Kong Wenju. Personal name Rong.\n\nChief Clerk: Tang Zhou. Served as a Minister of Wu.\n\nSima Zhang Xiu. General of the Later Han.\n\nMarquis Overseer of the Eastern Sea: Wen Tairen. Rank equivalent to Grand General.\n\nChief Clerk: Du Yu. Jin’s General of Southern Campaigns, rank equivalent to Left Mentor.\n\nEight Northern Emperor Attendants of the Morning Audience, rank equivalent to Attendant-in-Ordinary:\nXu Shu. Style name Wenzhi.\n\nPang De. Style name Lingming.\nYuan Yu. Style name Shidu.\nLi Guang. Han general.\nWang Jia.\nXie Jie. Style name Shuyun.\nHe Yan. Style name Pingshu.\nYin Hao. Style name Yuanyuan.\n\nThe Four Bright Lords and the Northern Dipper Lord each have five Attendants of the Morning Audience. Names not yet revealed.\n\nTwo Marquises of the Hebei Region:\nLiu Bei. Style name Xuande.\nHan Sui.\n\nThe above offices are under the jurisdiction of the Immortal Officials.\n\nFour Attendants of the Central Stable, rank equivalent to Regular Court Ministers:\nDai Yuan. Style name Ruosi, Jin’s General of the Swift Cavalry.\nGongsun Du. Style name Shuji, King of Liaodong.\nGuo Jia.\nLiu Feng. Adopted son of Liu Bei.\n\nTwo Northern Emperor Southern Gate Wardens:\nBu Jian.\nZhou Fu. Style name Daohe, succeeded Xi Jian.\n\nTwo Northern Heaven Repair Gate Gentlemen:\nYu Hui.\nJi Zhan.\n\nEight Repair Gate Gentlemen. The Northern Dipper Lord’s Gate also has this office, names not yet revealed.\n\nTwo Northern Dipper Lord Heaven Gate Wardens:\nZang Hong. Style name Ziyuan.\nWang Fang. Jin’s Palace Secretary.\n\nExpectant Gentleman of the Gate Wang Yunzhi. Younger cousin of Wang Dun.\nXie Feng.\nDianbing Marquis Fan Ming.\nZhou Fang. Style name Ziyu, overseer of examinations.\n\nNorthern Emperor Umbrella-Bearer Gentleman Gu He. Style name Junxiao, Jin’s Minister of Personnel.\nCommander of the Department of Ghosts General Wang Yu. Style name Shijiang, Jin’s Inspector of Jingzhou.\nKilling Ghosts of the Earth Reflecting Sunlight. Three ghosts, regularly dispatched by the Northern Emperor to kill, names unknown.\n\nSixteen Western Gate Gentlemen. Names not yet revealed. Overseers of the ghosts receiving blood sacrifices in the temples and ancestral halls throughout the world, also under the jurisdiction of the Four Bright Lords.\n\nMaster of Unauthorized Envoys Yan Baihu. A man of Wu, killed by Sun Ce.\nSouthern Garrison Marquis Xu Fu, commanding a thousand Southern Might troops. Having ascended through the Nine Palaces, no successor has yet been appointed.\nMaster of the Southern Gate Key Sima Liu Zan. A man of Changshan, served as a Wu general.\nNorthern Garrison Marquis Bao Xun, commanding a thousand Northern Might troops. Style name Shuye, Wei’s Palace Aide to the Censor-in-Chief.\nMaster of the Northern Gate Key Sima Wei Zun. Among the many gatekeepers of Wu’s Sun clan, overseer of arrests, rank equivalent to the Regular Feathered Forest Commandant.\nWestern River Marquis Tao Kan. Style name Shixing, also commanding several thousand troops.\n\nChief Clerk.\n\nFirst employed Xu Ning, who was impeached. Now employs Cai Mo, style name Daoming, Jin’s Minister over the Masses.\nLushan Marquis Wei Zhao, a man of Kuaiji.\nNanshan Earl Jiang Ji, style name Zitong, Wei’s Grand Commandant.\nThese three appointments each hold seals and authority.\n\nMount Tai Lord Xun Yi, style name Jingqian.\nGeneral Gu Zhong, style name Changshi, Jin’s Governor of Danyang and Household Counsellor.\nChief Clerk Huan Fan, style name Yuanze.\nMarshal Cao Hong, younger brother of Emperor Wu of Wei Cao Cao, style name Zilian.\nIt is also said that Jia Yi, a man of Former Han, was first employed.\n\nLu Long Duke Cao Ren, style name Zixiao, younger brother of Emperor Wu of Wei, held the position of Grand General.\nChief Clerk Marshal—rank not yet made manifest.\n\nNanba Marquis He Zeng, style name Yingxiao, Wei’s Minister over the Masses.\nEast Yue Grand General Liu Tao, style name Ziji, a man of Later Wei.\nThe right is designated as the Four Garrisons, each commanding ten thousand ghost troops, each with a chief steed. Additionally, there are several hundred lesser garrisons, each commanding several thousand ghost troops.\n\nChu Yan Duke—namely, King Zhuang of Chu, Xiong Zai.\n\nDuke Jian of Zhao. These two individuals previously held no office and have only now received appointments.\n\nXiang Liangcheng. Author of the *Hymn to the Fengdu Palace*.\n\nDu Qiong, a man of Shu.\n\nMa Rong.\n\nLiu Qingsun, who vied with Jia Yi for renown.\n\nWang Yishao.\n\nDeng You.\n\nThese six individuals’ ranks have not yet been made manifest.\n\nThe ghost officials on the right number seventy-five offices in all, with one hundred nineteen persons of renowned name.\n\n*The Chart of Ranks and Duties of the Perfected and Numinous Treasure of the Cavernous Mystery* concludes.\n\n#1 This text should belong to the *Scriptures of the Upper Clarity of the Cavernous Perfection* section. The *Daoist Canon of the Zhengtong Era* mistakenly classifies it under *Cavernous Mystery and Numinous Treasure*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞玄灵宝真灵位业图 经名：洞玄灵宝真灵位业图。 粱道士陶弘景撰，唐末道士闾丘方远校定。 内载上清派诸仙真谱录。 一卷。 底本出处：《正统道藏》洞真部谱录类。 洞玄灵宝真灵位业图 洞玄灵宝真灵位业图序 夫仰镜玄精，说景耀之巨细； 俯眄平区，见岩海之崇深。 搜访人纲，究朝斑之品序； 研综天经，测真灵之阶业。 但名爵隐显，学号进退，四宫之内，疑似相参。 今正当比类经正，雠校仪服，埒其高卑，区其宫域。 又有指目单位，上皇道君、五帝七老，如此比之类是矣。 略说姓名，墨羽孟卓之例是。 或任同秩异，金阙四帝、太极四真，及下教之例是矣。 业均迹别者，诸步纲之例也。 如希林真人为太微右公，而领九宫上相，未委为北宴上清，当下亲相识耶。 诸如此例，难可必证。 谓其并继其所领，而从高域，粗事事条辩，略宣后章。 辄以浅识下生，轻品上圣，升降失序，梯级乖本，戄贻谪玄府，络咎冥司。 谨依诚陈，启仰希照，亮若必不宜然，愿垂戒告。 今所诠贯者，实禀注之奥旨，存向之要趣。 祈祝跪请，宜委位序之尊卑； 对真接异，必究所遇之轻重。 是以三君共辞，先致学未体之尤； 下班居上，智有不达之蔽。 虽同号真人，真品乃有数，俱目仙人，仙亦有等级千亿。 若不精委条领，略识宗源者，犹如野夫出朝廷，见朱衣令史，句骊入中国，呼一切为参军。 岂解士庶之贵贱，辩爵号异同乎。 陶弘景序。 洞玄灵宝真灵位业图#1 梁贞白先生陶弘景纂 唐天台妙有大师玄同先生赐紫闾丘方远校定 玉清三元官 上第一中位",
      "translated_text": "**The Chart of the True Spirits’ Ranks and Duties of the Dongxuan Lingbao**\n\n**Title:** *The Chart of the True Spirits’ Ranks and Duties of the Dongxuan Lingbao*\nCompiled by Taoist Tao Hongjing of the Liang dynasty; collated by Taoist Lüqiu Fangyuan in the late Tang. Contains the register of immortals and perfected beings of the Shangqing lineage. One scroll.\n**Source text:** *Zhengtong Daozang* (Daoist Canon of the Zhengtong Era), *Dongzhen* section, *Pulu* (Registers) category.\n\n---\n\n### *The Chart of the True Spirits’ Ranks and Duties of the Dongxuan Lingbao*\n\n#### Preface\nGazing upward to mirror the subtle essence, one discerns the vast and minute of radiant luminosity; looking downward upon the level expanse, one perceives the loftiness and profundity of mountains and seas. Searching and inquiring into the web of humanity, one exhausts the gradations of ranks and orders; studying and synthesizing the celestial scriptures, one fathoms the stages and duties of the true spirits.\n\nYet names and titles may be hidden or manifest, and designations of learning may advance or recede. Within the four palaces, doubts and similarities intermingle. Now, it is fitting to rectify and classify, to verify and collate the rituals and vestments, to equalize their heights and depths, and to demarcate their palace domains.\n\nThere are also instances of singular designations—such as the Supreme August Dao Lord and the Five Emperors and Seven Elders—of which this is but one example. Some merely list names, like the cases of Mo Yu and Meng Zhuo. Others hold the same rank but differ in office, such as the Four Emperors of the Golden Tower and the Four Perfected of the Great Ultimate, as well as those in subordinate teachings. Those whose duties are equal but whose traces differ are exemplified by the various *bu gang* (step-registers).\n\nFor instance, the Perfected of the Rare Grove serves as the Right Duke of the Grand Tenuity, while also overseeing the Prime Minister of the Nine Palaces. Yet it remains unclear whether he is the Supreme Clarity of the Northern Banquet or a familiar attendant of the lower ranks. Such cases abound, and definitive proof is elusive.\n\nThus, I have followed the principle of inheriting their designated roles while aligning them with the highest domain. Matters are roughly arranged in order, and a brief exposition is provided in the subsequent sections.\n\nShould my shallow understanding, born of inferior birth, rashly rank the exalted sages, disrupting the proper order of ascent and descent and confounding the original hierarchy of steps, I would incur the censure of the Mystic Bureau and entangle myself in the retributions of the Nether Court. With reverence, I humbly present this, beseeching illumination. If it is deemed improper, I pray for admonishment.\n\nWhat is herein expounded and connected truly embodies the profound purport of the annotations and preserves the essential aim of devotion. In prayers and supplications, one must defer to the hierarchy of ranks; in encounters with the true and the transcendent, one must discern the weight of the engagement.\n\nThus, the Three Lords jointly declined, first addressing the errors of those whose learning has not yet grasped the essence. When lower ranks occupy higher positions, even the wise may suffer from obstructions of understanding. Though all may bear the title of Perfected, the true grades number in the dozens; though all may be called Immortals, the ranks of immortals span billions. Without precise mastery of the details and a rough understanding of the lineage, one is like a rustic entering the imperial court, mistaking a crimson-robed clerk for a high official, or a Goguryeo tribesman in the Central Kingdom, calling everyone a *canjun*. How could they distinguish the noble from the base or discern the differences in titles and ranks?\n\n**Preface by Tao Hongjing**\n\n---\n\n### *The Chart of the True Spirits’ Ranks and Duties of the Dongxuan Lingbao* #1\nCompiled by Master Zhenbai of the Liang, Tao Hongjing\nCollated by Master Miaoyou of Tiantai Mountain, the Purple-robed Lüqiu Fangyuan of Xuantong\n\n**Jade Clarity Palace of the Three Primes**\n**Upper First Central Position**",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 616,
      "start_sentence": 0,
      "end_sentence": 36,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.110841989517212,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\洞玄灵宝真灵位业图.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "上合虚皇道君应号元始天尊。 左位 五灵七明混生高上道君。 东明高上虚皇道君。 西华高上虚皇道君。 北玄高上虚皇道君。 南朱高上虚皇道君。 玉清上元宫四道君。 各有讳字。 玉清中元宫紫清六道君。 各有讳字。 玉清下元宫高清四元君。 各有讳字。 玉清中散位一十君。 讳字不显。 右位 紫虚高上元皇道君。 洞虚三元太明上皇道君。 太素高虚上极紫皇道君。 虚明紫兰中元高上嵉皇道君。 三元上玄老虚皇元晨君。 三元四极上元虚皇元灵君。 三元晨中黄景虚皇元台君。 三元紫映挥神虚生主真元胎君。 玉玄太皇君。 上皇道君。 玉皇道君。 清玄道君。 上皇天帝。 玉天太一君。 太上虚皇道君。 太上玉真保皇道君。 玄皇高真。 太一玉君。 高上玉帝。 右玉清境，元始天尊为主，已下道君 皆得策命学道，号令韦真。 太微天 帝来受事，并不与下界相关。 自九 宫已上，上清已下，高真仙官皆得朝宴焉。 第二中位 上清高圣太上玉晨玄皇大道君。 为万道之主。 左位 左圣紫晨太微天帝道君。 左圣南极南岳真人左仙公太虚真人赤松子。 黄老君弟子，裴君师。 左辅后圣上宰西域西极真人总真君。 姓王，讳远，字方平。 紫阳君弟子，司命茅君师。 紫清太素高虚洞曜道君。 太虚上霄飞晨中央道君。 赤松。 太微东霞扶桑丹林大帝上道君。 后圣太师太微左真保皇道君。 紫明太微九道高元玉晨道君。 紫元太微八素三元玄晨道君。 九微太真玉保王金阙上相大司命高晨师。 东海王青华小童君。 领九宫上相长里先生薛君。 周时得道，许长史前缘兄也。 太微右真公领九宫上相希林真人燕君。 从小有天王受，王君替代。 司命东岳上真卿太元真人茅君。 大茅君，讳盈，字叔申。 左卿仙侯真君许君。 讳穆，南岳夫人弟子，事晋为护军长史，退居句曲山。 侍帝晨青盖真人郭君名世干。 紫阳左真人周君义山。 清灵真人裴君。 汉右扶风人，汉时得道。 灵飞太真太上大夫。 侍帝晨东华上佐司命杨君。 协晨大夫石叔门。 正一羽晨侯公杨子明。 玄洲主仙道君太上公子。 姓勤，主关奏仙名。 经命仙伯太保真人。 八玄仙伯右仙公谷君。 正一左玄执盖郎郄伟玄。 绣衣使者孟六奇。 太素宫官保禁仙郎裘文坚。 左杨王。 华仲戒。 绣衣使者西林藻。 右嫔之姬赵约罗。 三天左官直御史管长条。 逸域宫。 八景城。 七灵台。 凤台琼阙。 金晨华阙。 右位 右圣金阙帝晨后圣玄元道君。 壬辰运当　下生。 右辅侍帝晨领五岳司命右弼桐□真人金庭宫王君。 讳晋，灵王太子，下教。 右辅小有洞天太素清虚真人四司三元右保公王君。 讳褒，魏夫人师，下教矣。 侍帝晨右仙公许君。 长史子，讳翙。 玄洲仙都太上丈人。 治玄洲紫桂宫，玄洲之主矣。 太保玉郎李君名飞。 侍帝晨观大夫九宫太传玉晨郎。 北牖弟子中候仙人。 姓范，讳遥，字度世，曾名永。 汉桓帝侍郎，撰魏夫人传。 女真位 紫微元灵白玉龟台九灵太真元君。 紫虚元君领上真司命南岳魏夫人。 讳华存，字贤安，小有王君弟子，杨君师。 八灵道母西岳蒋夫人。 北海六微玄清夫人。 上真东宫卫夫人。 北汉七灵石夫人。 紫清上宫九华真妃。 姓安，晋朝降於茅山。 紫虚左宫郭夫人。 太极中华石夫人。 太真王夫人。 沧浪云林右英王夫人。 朱陵北绝台上嫔管妃。",
      "translated_text": "**Upper First Central Position**\n\n**Upper Conjoined Position**\nThe Vacuous August Dao Lord, styled the Primordial Celestial Worthy.\n\n**Left Position**\nThe Five Numinous Seven Luminants, the Intermingled Birth, the Lofty August Dao Lord.\nThe Eastern Brilliance Lofty August Vacuous August Dao Lord.\nThe Western Florescence Lofty August Vacuous August Dao Lord.\nThe Northern Mystery Lofty August Vacuous August Dao Lord.\nThe Southern Vermilion Lofty August Vacuous August Dao Lord.\nThe Four Dao Lords of the Upper Prime Palace of Jade Clarity, each bearing a taboo name.\nThe Six Dao Lords of the Purple Clarity Middle Prime Palace of Jade Clarity, each bearing a taboo name.\nThe Four Prime Lords of the Lofty Clarity Lower Prime Palace of Jade Clarity, each bearing a taboo name.\nThe Ten Lords of the Jade Clarity Central Dispersed Positions, whose taboo names are not revealed.\n\n**Right Position**\nThe Purple Vacuous Lofty August Primordial August Dao Lord.\nThe Cavernous Vacuous Three Primes, the Grand Brilliance Lofty August Supreme August Dao Lord.\nThe Grand Simplicity Lofty Vacuous Supreme Ultimate Purple August Dao Lord.\nThe Vacuous Brilliance Purple Orchid Middle Prime Lofty August Peak August Dao Lord.\nThe Three Primes Upper Mystery Aged Vacuous August Primordial Dawn Lord.\nThe Three Primes Four Poles Upper Prime Vacuous August Primordial Numinous Lord.\nThe Three Primes Dawn Central Yellow Radiance Vacuous August Primordial Terrace Lord.\nThe Three Primes Purple Reflection Wielding Spirit Vacuous Birth Master True Primordial Womb Lord.\nThe Jade Mystery Grand August Lord.\nThe Supreme August Dao Lord.\nThe Jade August Dao Lord.\nThe Clarity Mystery Dao Lord.\nThe Supreme August Heavenly Thearch.\nThe Jade Heaven Grand Unity Lord.\nThe Grand Lofty Vacuous August Dao Lord.\nThe Grand Lofty Jade Perfected Guardian August Dao Lord.\nThe Mysterious August Lofty Perfected.\nThe Grand Unity Jade Lord.\nThe Lofty August Jade Thearch.\n\nWithin the Jade Clarity Realm, the Primordial Celestial Worthy presides; all Dao Lords below receive decrees to study the Dao and issue commands to the Perfected. The Grand Tenuity Heaven’s Thearchs come to receive duties, yet remain uninvolved with the lower realms. From the Nine Palaces upward to the Highest Clarity below, the Lofty Perfected and Transcendent Officials all attend the celestial banquets.\n\n**Second Central Position**\nThe Highest Clarity Lofty Sage Grand Lofty Jade Dawn Mysterious August Great Dao Lord, sovereign over the myriad Dao.\n\n**Left Position**\nThe Left Sage Purple Dawn Grand Tenuity Heavenly Thearch Dao Lord.\nThe Left Sage Southern Culmen Southern Marchmount Perfected, Left Transcendent Duke, Grand Vacuous Perfected, Red Pine Master. Disciple of the Yellow Venerable Lord, master of Master Pei.\nThe Left Assistant, Later Sage Supreme Minister, Western Region Western Culmen Perfected, Governor of All Perfected. Surnamed Wang, taboo name *Yuan*, style *Fangping*. Disciple of the Purple Yang Lord, master of the Controller of Destinies, Master Mao.\nThe Purple Clarity Grand Simplicity Lofty Vacuous Cavernous Radiance Dao Lord.\nThe Grand Vacuous Upper Empyrean Soaring Dawn Central Dao Lord, Red Pine.\nThe Grand Tenuity Eastern Radiance Fusang Vermilion Forest Great Thearch Supreme Dao Lord.\nThe Later Sage Grand Preceptor, Grand Tenuity Left Perfected Guardian August Dao Lord.\nThe Purple Brilliance Grand Tenuity Nine Dao Lofty Prime Jade Dawn Dao Lord.\nThe Purple Prime Grand Tenuity Eight Simplicities Three Primes Mysterious Dawn Dao Lord.\nThe Nine Subtleties Grand Perfected Jade Guardian King, Golden Watchtower Upper Minister, Grand Controller of Destinies, Lofty Dawn Preceptor.\nThe Azure Florescence Lad of the Eastern Sea, Lord Wang Qinghua.\nCommanding the Nine Palaces Upper Minister, Elder of the Long Mile, Master Xue. Attained the Dao in the Zhou dynasty, elder brother of Prefect Xu in a former life.\nThe Grand Tenuity Right Perfected Duke, commanding the Nine Palaces Upper Minister, Master Yan of the Rare Grove. From youth, received the mandate of the Heavenly King, replacing Lord Wang.\nThe Controller of Destinies, Eastern Marchmount Upper Perfected Minister, Grand Prime Perfected, Master Mao. The Great Master Mao, taboo name *Ying*, style *Shushen*.\nThe Left Minister Transcendent Marquis, Perfected Lord Xu. Taboo name *Mu*, disciple of the Southern Marchmount Lady, served the Jin as Protectorate General, later retired to Mount Juqu.\nThe Azure Canopy Perfected, Attendant to the Thearch of Dawn, Master Guo, personal name *Shigan*.\nThe Purple Yang Left Perfected, Master Zhou Yishan.\nThe Clarity Numinous Perfected, Master Pei. A native of Right Fufeng in the Han, attained the Dao in the Han dynasty.\nThe Numinous Flight Grand Perfected, Grandee of the Supreme Lofty.\nThe Attendant to the Thearch of Dawn, Eastern Florescence Upper Assistant Controller of Destinies, Master Yang.\nThe Dawn-Assisting Grandee, Master Shi Shumen.\nThe Orthodox Unity Feathered Dawn Marquis, Master Yang Ziming.\nThe Master of the Mysterious Continent, Dao Lord of the Supreme Lofty, Master Gongzi. Surnamed Qin, overseer of memorials on transcendent names.\nThe Scripture-Commanding Transcendent Earl, Grand Guardian Perfected.\nThe Eight Mysteries Transcendent Earl, Right Transcendent Duke, Master Gu.\nThe Orthodox Unity Left Mystery Bearer of the Canopy, Master Qie Weixuan.\nThe Embroidered Robe Envoy, Meng Liuqi.\nThe Grand Simplicity Palace Officer, Guardian of Prohibitions, Transcendent Gentleman Qiu Wenjian.\nThe Left Yang King.\nHua Zhongjie.\nThe Embroidered Robe Envoy, Xi Linzao.\nThe Right Consort’s Handmaiden, Zhao Yueluo.\nThe Three Heavens Left Palace Direct Inspector, Guan Changtiao.\nThe Leisurely Domain Palace.\nThe Eight Radiance City.\nThe Seven Numinous Terrace.\nThe Phoenix Terrace Jeweled Watchtower.\nThe Golden Dawn Florescence Watchtower.\n\n**Right Position**\nThe Right Sage Golden Watchtower Thearch of Dawn, Later Sage Mysterious Prime Dao Lord. Destined to descend in the *renchen* cycle.\nThe Right Assistant, Attendant to the Thearch of Dawn, commanding the Five Marchmounts Controller of Destinies, Right Adjutant Master of the Paulownia Hollow, Perfected of the Golden Court Palace, Lord Wang. Taboo name *Jin*, son of the Numinous King, descended to teach.\nThe Right Assistant, Lesser Grotto Heaven of the Grand Simplicity, Grand Vacuous Perfected, Four Offices Three Primes Right Guardian Duke, Lord Wang. Taboo name *Bao*, master of Lady Wei, descended to teach.\nThe Attendant to the Thearch of Dawn, Right Transcendent Duke, Master Xu. Son of the Prefect, taboo name *Hui*.\nThe Supreme Lofty Elder of the Mysterious Continent Transcendent Capital. Governs the Purple Cassia Palace of the Mysterious Continent, sovereign of the Mysterious Continent.\nThe Grand Guardian Jade Gentleman, Master Li, personal name *Fei*.\nThe Attendant to the Thearch of Dawn, Observer Grandee, Nine Palaces Grand Herald, Jade Dawn Gentleman.\nThe Northern Window’s Disciple, Central Attendant Transcendent. Surnamed Fan, taboo name *Yao*, style *Dushi*, formerly named *Yong*. Served as Gentleman of the Interior in the Han Emperor Huan’s court, compiled the *Biography of Lady Wei*.\n**Female Perfected Positions**\nThe Purple Tenuity Primordial Numinous White Jade Tortoise Terrace Nine Numinous Grand Perfected Primordial Lady.\nThe Purple Vacuous Primordial Lady, commanding the Upper Perfected Controller of Destinies, Southern Marchmount Lady Wei. Taboo name *Huacun*, style *Xian’an*, disciple of the Lesser Grotto Lord Wang, master of Master Yang.\nThe Eight Numinous Dao Mother, Western Marchmount Lady Jiang.\nThe Six Subtleties Northern Sea Mysterious Clarity Lady.\nThe Upper Perfected Eastern Palace Guardian Lady.\nThe Seven Numinous Northern Han Stone Lady.\nThe Purple Clarity Upper Palace Nine Florescence Perfected Consort. Surnamed An, descended upon Mount Mao in the Jin dynasty.\nThe Purple Vacuous Left Palace Lady Guo.\nThe Grand Ultimate Central Florescence Stone Lady.\nThe Grand Perfected Lady Wang.\nThe Azure Billows Cloud Grove Right Radiance Lady Wang.\nThe Upper Consort of the Northern Culmen of the Vermilion Mound, Lady Guan.",
      "overlap_context": "ribesman in the Central Kingdom, calling everyone a *canjun*. How could they distinguish the noble from the base or discern the differences in titles and ranks?\n\n**Preface by Tao Hongjing**\n\n---\n\n### *The Chart of the True Spirits’ Ranks and Duties of the Dongxuan Lingbao* #1\nCompiled by Master Zhenbai of the Liang, Tao Hongjing\nCollated by Master Miaoyou of Tiantai Mountain, the Purple-robed Lüqiu Fangyuan of Xuantong\n\n**Jade Clarity Palace of the Three Primes**\n**Upper First Central Position**",
      "start_char": 616,
      "end_char": 2125,
      "start_sentence": 37,
      "end_sentence": 160,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.453691482543945,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\洞玄灵宝真灵位业图.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "方丈台昭灵李夫人。 北岳上真山夫人。 琼华夫人。 三元冯夫人。 右华九成范夫人。 紫微左宫王夫人。 讳清娥，字愈音，阿母第二十六女也。 长陵杜夫人。 太微玄清左夫人。 右阳王华仲飞姬。 西华灵妃甄幽萧。 后圣上保南极元君紫元夫人。 后圣上傅太素元君。 东华玉妃淳文期。 青童之妹。 东宫中侯王夫人。 桐柏真人则生妹。 太和上真左夫人。 西汉夫人。 华山夫人。 玉清神女房素。 西王母侍女王上华。 董双成。 石公子。 苑绝青。 地成君。 郭密香。 干若宾。 李方明。 张灵子。 太帝宫官。 灵林玉女。 贾屈庭。 金阙宫官。 太保侯范法安。 经命仙伯牙叔平。 东华宫玉女烟景珠。 上元夫人侍女宋辟非。 主仙道君侍女范运华。 赵峻珠。 王抱一。",
      "translated_text": "The Radiant Numinous Lady Li of Fangzhang Terrace.\nThe Upper Perfected Lady of the Northern Marchmount.\nThe Lady of Jasper Florescence.\nThe Lady Feng of the Three Primordials.\nThe Lady Fan of the Ninefold Accomplishments of the Right Florescence.\nThe Lady Wang of the Purple Tenuity Left Palace. Taboo name *Qing’e*, style *Yuyin*, the twenty-sixth daughter of the Celestial Mother.\nThe Lady Du of Changling.\nThe Left Lady of the Grand Tenuity Mysterious Clarity.\nThe Right Radiance Lady Wang Huazhongfei.\nThe Divine Consort Zhen Youxiao of the Western Florescence.\nThe Purple Primordial Lady, Upper Guardian of the Southern Culmen of the Latter Sage.\nThe Grand Simplicity Primordial Lady, Upper Attendant of the Latter Sage.\nThe Jade Consort Chun Wenqi of the Eastern Florescence, younger sister of the Azure Lad.\nThe Central Attendant Lady Wang of the Eastern Palace, younger sister of the Peach Blossom Grotto Realized One.\nThe Upper Perfected Left Lady of Grand Harmony.\nThe Lady of the Western Han.\nThe Lady of Mount Hua.\nThe Divine Maiden Fang Su of Jade Clarity.\nThe Handmaiden Wang Shanghua of the Queen Mother of the West.\nDong Shuangcheng.\nShi Gongzi.\nYuan Jueqing.\nDi Chengjun.\nGuo Mixiang.\nGan Ruobin.\nLi Fangming.\nZhang Lingzi.\nPalace Officials of the Grand Thearch.\nJade Maidens of the Numinous Grove.\nJia Quting.\nPalace Officials of the Golden Watchtower.\nThe Grand Guardian Marquis Fan Faan.\nThe Transmitted Mandate Immortal Earl Ya Shuping.\nThe Jade Maiden Yan Jingzhu of the Eastern Florescence Palace.\nThe Handmaiden Song Bifei of the Upper Primordial Lady.\nThe Handmaiden Fan Yunhua of the Lord of the Immortal Dao.\nZhao Junzhu.\nWang Baoyi.",
      "overlap_context": " Mysterious Clarity Lady.\nThe Upper Perfected Eastern Palace Guardian Lady.\nThe Seven Numinous Northern Han Stone Lady.\nThe Purple Clarity Upper Palace Nine Florescence Perfected Consort. Surnamed An, descended upon Mount Mao in the Jin dynasty.\nThe Purple Vacuous Left Palace Lady Guo.\nThe Grand Ultimate Central Florescence Stone Lady.\nThe Grand Perfected Lady Wang.\nThe Azure Billows Cloud Grove Right Radiance Lady Wang.\nThe Upper Consort of the Northern Culmen of the Vermilion Mound, Lady Guan.",
      "start_char": 2126,
      "end_char": 2517,
      "start_sentence": 161,
      "end_sentence": 201,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.805689573287964,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\洞玄灵宝真灵位业图.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "华敬涤。 李伯益。 鲜于灵金。 太和殿。 寥阳殿。 药珠阙。 七映房。 长绵楼。 第三中位 太极金阙帝君姓李。 壬辰下教，太平主。 左位 太极左真人中央黄老君。 太极左真人紫阳左仙公中华公子。 太极左卿黄观子。 无上真人文始先生尹喜。 朱火丹灵宫龚仲阳、幼阳。 兄弟二人，受道於青童君。 东阳真人陵阳子明。 中元老人中央上玄子。 北极真人安期生。 北极老子玄上仙皇。 清和天帝君。 南极老人丹陵上真。 青精先生太宛北谷子。 玄和阴陵上帝。 太极高仙伯延盖公子。 玄洲仙伯。 太极左仙公葛玄。 吴时下演灵宝，下为地仙。 西极老人素灵子期。 五老上真仙都老公。 撰灵书紫文。 束极老人扶阳公子。 太极左公北谷先生。 三天都护王长、赵升。 太极上真公孔丘。 明晨侍郎三天司真颜回。 玄圃真人轩辕黄帝。 玄帝颛项。 黄帝孙，受灵宝五符。 王子帝誉。 黄帝曾孙，受灵宝五符。 帝舜。 服九转神丹，入於九疑山，而得道矣。 □成子高。 汤时退耕。",
      "translated_text": "Hua Jingdi.\nLi Boyi.\nXianyu Lingjin.\nThe Hall of Grand Harmony.\nThe Hall of Luminous Yang.\nThe Gate of Medicinal Pearls.\nThe Chamber of Seven Radiance.\nThe Tower of Everlasting Continuity.\n\n**Third Central Rank**\nThe Grand Supreme Lord of the Golden Watchtower of the Great Ultimate, surnamed Li.\nOn the ren-chen day, he descended with teachings as the Master of Great Peace.\n\n**Left Rank**\nThe Left Perfected of the Great Ultimate, the Central Yellow Elder Lord.\nThe Left Perfected of the Great Ultimate, the Purple Yang Left Immortal Duke, the Hua Duke.\nThe Left Minister of the Great Ultimate, Huang Guanzi.\nThe Supreme Perfected Wen Shi Xiansheng Yin Xi.\nThe Vermilion Fire Cinnabar Spirit Palace: Gong Zhongyang and Gong Youyang.\nTwo brothers who received the Dao from the Green Youth Lord.\nThe Eastern Yang Perfected, Lingyang Ziming.\nThe Central Primordial Elder, the Central Supreme Xuanzi.\nThe Northern Ultimate Perfected, An Qisheng.\nThe Northern Ultimate Elder, the Supreme Immortal Sovereign of the Dark.\nThe Lord Emperor of Pure Harmony.\nThe Southern Ultimate Elder, the Supreme Perfected of Vermilion Mound.\nThe Azure Essence Master, Tai Wan Beiguzi.\nThe Dark Harmony Lord Emperor of Yin Mound.\nThe High Immortal Duke of the Great Ultimate, Yan Gai Gongzi.\nThe Immortal Duke of the Dark Continent.\nThe Left Immortal Duke of the Great Ultimate, Ge Xuan.\nDuring the Wu dynasty, he expounded the *Lingbao* scriptures and descended as an earthbound immortal.\nThe Western Ultimate Elder, Su Lingzi Qi.\nThe Five Elders, Supreme Perfected and Immortal Capital Elder Duke.\nCompiler of the *Purple Texts of the Numinous Writ*.\nThe Eastern Ultimate Elder, Fu Yang Gongzi.\nThe Left Duke of the Great Ultimate, Beigu Xiansheng.\nThe Three Heavens’ Protectors: Wang Chang and Zhao Sheng.\nThe Supreme Perfected Duke of the Great Ultimate, Kong Qiu.\nThe Dawn Attendant and Minister of the Three Heavens’ Controller of Perfected, Yan Hui.\nThe Perfected of the Dark Garden, the Yellow Emperor Xuanyuan.\nThe Dark Emperor Zhuanxu.\nGrandson of the Yellow Emperor, recipient of the *Five Talismans of Lingbao*.\nPrince Emperor Yu.\nGreat-grandson of the Yellow Emperor, recipient of the *Five Talismans of Lingbao*.\nEmperor Shun.\nConsumed the nine-cycled divine elixir, entered the Nine Doubts Mountain, and attained the Dao.\nCheng Zigao.\nRetired from ploughing during the reign of Tang.",
      "overlap_context": ".\nYuan Jueqing.\nDi Chengjun.\nGuo Mixiang.\nGan Ruobin.\nLi Fangming.\nZhang Lingzi.\nPalace Officials of the Grand Thearch.\nJade Maidens of the Numinous Grove.\nJia Quting.\nPalace Officials of the Golden Watchtower.\nThe Grand Guardian Marquis Fan Faan.\nThe Transmitted Mandate Immortal Earl Ya Shuping.\nThe Jade Maiden Yan Jingzhu of the Eastern Florescence Palace.\nThe Handmaiden Song Bifei of the Upper Primordial Lady.\nThe Handmaiden Fan Yunhua of the Lord of the Immortal Dao.\nZhao Junzhu.\nWang Baoyi.",
      "start_char": 2518,
      "end_char": 3004,
      "start_sentence": 202,
      "end_sentence": 248,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.148184776306152,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\洞玄灵宝真灵位业图.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "修步纲之道。 夏禹。 受锺山真人灵宝九跚法，治水有功。 周穆王。 至昆仑，见西王母。 帝尧。 风后。 黄帝师，出四扇者。 西归子。 未显。 蒲衣。 庄子云：犹是被衣矣。 丰车子。 未显。 支离。 被衣。 王倪。 啮缺。 巢父。 许由。 卞随。 华封。 北人。 子州。 善卷。 马皇。 安公。 姓陶，乘赤龙矣。 大项。 名托。 右位 太极右真人西梁子文。 太极右真人安度明。 玄洲仙都绛文期。 紫阳真人范明期。 郁绝真人裴玄仁。 太玄仙女西灵子都。 司马季主。 受西灵子都剑解之道。 太极仙侯张奉。 洞台清虚七真人。 西岳卿副司命李翼仲甫。 左元放师。 八老元仙。 正一上玄玉郎王中、鲍丘。 南陵玉女。 阳谷真人领西归傅淳于太玄。 戎山真人右仙公范泊华。 陆浑真人太极监西郭幼度。 中黄四司大夫领北海公涓子。 苏君师矣。 太极法师徐来勒。 吴时天台山传葛仙公法轮经。 邯郸张君。 庚桑子。",
      "translated_text": "The Way of the Step-by-Step Registers.\nXia Yu.\nReceived the *Nine Steps Method of Lingbao* from the Perfected of Mount Zhong, and achieved merit in flood control.\nKing Mu of Zhou.\nJourneyed to Kunlun and met the Queen Mother of the West.\nEmperor Yao.\nFeng Hou.\nMaster of the Yellow Emperor, originator of the *Four Fans*.\nXigui Zi.\nUnmanifested.\nPuyi.\nAs Zhuangzi said: \"Still clad in robes.\"\nFengche Zi.\nUnmanifested.\nZhili.\nClad in Robes.\nWang Ni.\nNie Que.\nChaofu.\nXu You.\nBian Sui.\nHua Feng.\nBeiren.\nZizhou.\nShanjuan.\nMa Huang.\nAn Gong.\nSurnamed Tao, rode the Red Dragon.\nDa Xiang.\nPersonal name Tuo.\n\nTo the Right:\nPerfected of the Great Ultimate’s Right, Xiliang Ziwen.\nPerfected of the Great Ultimate’s Right, Andu Ming.\nJiang Wenqi of the Vermilion Texts of the Dark Continent’s Immortal Capital.\nPerfected of Purple Yang, Fan Mingqi.\nPerfected of Utmost Obscurity, Pei Xuanren.\nImmortal Maiden of Great Mystery, Xiling Zidu.\nSima Jizhu.\nReceived the *Sword Liberation Way* from Xiling Zidu.\nImmortal Marquis of the Great Ultimate, Zhang Feng.\nSeven Perfected of the Pure Void of the Terrace of Wu.\nVice Minister of Fate of the Western Peak, Li Yizhongfu.\nMaster Zuo Yuanfang.\nEight Elderly Primordial Immortals.\nJade Gentleman of the Supreme Mystery of the Orthodox Unity, Wang Zhong and Bao Qiu.\nJade Maiden of Nanling.\nPerfected of Yang Valley, leading the Western Return, Fu Chunyu of Great Mystery.\nPerfected of Mount Rong, Right Immortal Duke, Fan Bohua.\nPerfected of Lushan, Overseer of the Great Ultimate’s West, Guo Youdu.\nGrand Minister of the Four Yellows, leading the Duke of the Northern Sea, Juanzi.\nSu Jun, Master.\nDharma Master of the Great Ultimate, Xu Laile.\nDuring the Wu dynasty, the *Dharma Wheel Sutra* was transmitted on Mount Tiantai by Ge Xian’gong.\nHandan Zhangjun.\nGengsang Zi.",
      "overlap_context": "er of the Three Heavens’ Controller of Perfected, Yan Hui.\nThe Perfected of the Dark Garden, the Yellow Emperor Xuanyuan.\nThe Dark Emperor Zhuanxu.\nGrandson of the Yellow Emperor, recipient of the *Five Talismans of Lingbao*.\nPrince Emperor Yu.\nGreat-grandson of the Yellow Emperor, recipient of the *Five Talismans of Lingbao*.\nEmperor Shun.\nConsumed the nine-cycled divine elixir, entered the Nine Doubts Mountain, and attained the Dao.\nCheng Zigao.\nRetired from ploughing during the reign of Tang.",
      "start_char": 3004,
      "end_char": 3485,
      "start_sentence": 249,
      "end_sentence": 303,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.84547758102417,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\洞玄灵宝真灵位业图.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "萧史。 太上玄一三真。 吴时降天台山，传葛仙公灵宝经。 刘京。 玄洲上卿太极中候大夫苏君。 名林，字子 玄。 涓子弟子，周君师。 弄玉。 二女。 白水使者。 长桑公子。 庄子师。 韦编郎庄周。 秦佚。 接舆。 伯昏。 郄间。 老聘。 第四中位 太清太上老君。 为太清道主，下临万民。 上皇太上元上大道君。 左位 正一真人三天法师张讳道陵。 东华左仙卿白石生。 张叔茂。 元始天王。 西王母之师。 玄成青天上皇。 此三人太清尊位，不领兆民， 南上大道君。 太上丈人。 天帝君。 九老仙都君。 九气丈人。 此并太清三天东宫之真官，章奏关启学道所得。 中岳真人高丘子。 景云真人。 鬼谷先生。 泰清王。 九天郎吏。 北斗直符七人。 定气真人。 监仙真人。 五仙夫人。 郭内夫人。 二十四官君将吏。 千二百官君将吏。",
      "translated_text": "Xiao Shi.\nThree Perfected of the Supreme Mystery of the Great One.\nDuring the Wu dynasty, descended upon Mount Tiantai to transmit the *Lingbao Sutra* to Ge Xian’gong.\nLiu Jing.\nGrand Minister of the Dark Continent, Grand Master of the Central Watch of the Great Ultimate, Su Jun.\nNamed Lin, styled Zixuan.\nDisciple of Juanzi, Master of Zhou Jun.\nNongyu.\nTwo Maidens.\nWhite Water Messenger.\nLord Chang Sang.\nMaster of Zhuangzi.\nWei Bianlang, Zhuang Zhou.\nQin Yi.\nJieyu.\nBohun.\nQie Jian.\nLao Ping.\n\n**Fourth Central Rank**\nMost High Lord Lao of Great Clarity.\nAs Lord of the Dao of Great Clarity, he oversees the myriad people from below.\n\n**Supreme August Most High Primordial Lord of the Great Dao of the Highest Origin.**\n\n**Left Rank**\nPerfected of Orthodox Unity, Master of the Three Heavens’ Dharma, Zhang, whose taboo name is Daoling.\nLeft Immortal Minister of Eastern Florescence, White Stone Sage.\nZhang Shumao.\nCelestial King of Primordial Beginning.\nMaster of the Queen Mother of the West.\nAugust Emperor of Mysterious Completion of the Azure Heaven.\nThese three hold the exalted ranks of Great Clarity but do not govern the mortal realm.\n\n**Lord of the Great Dao of the Southern Summit.**\nMost High Venerable.\nCelestial Thearch.\nNine Elderly Lords of the Immortal Capital.\nNine Qi Venerable.\nThese are all the Perfected Officials of the Eastern Palace of the Three Heavens of Great Clarity, through whom memorials and petitions are submitted regarding the attainments of Dao cultivation.\n\nPerfected of Central Marchmount, Gao Qiuzi.\nPerfected of Auspicious Clouds.\nMaster of Ghost Valley.\nPrince of Grand Clarity.\nHeavenly Gentleman of the Nine Heavens.\nSeven Direct Attendants of the Northern Dipper.\nPerfected of Fixed Qi.\nPerfected of Supervising Immortals.\nFive Immortal Ladies.\nLady of the Inner Realm.\nTwenty-Four Lords, Generals, and Officials.\nOne Thousand Two Hundred Lords, Generals, and Officials.",
      "overlap_context": "aiden of Nanling.\nPerfected of Yang Valley, leading the Western Return, Fu Chunyu of Great Mystery.\nPerfected of Mount Rong, Right Immortal Duke, Fan Bohua.\nPerfected of Lushan, Overseer of the Great Ultimate’s West, Guo Youdu.\nGrand Minister of the Four Yellows, leading the Duke of the Northern Sea, Juanzi.\nSu Jun, Master.\nDharma Master of the Great Ultimate, Xu Laile.\nDuring the Wu dynasty, the *Dharma Wheel Sutra* was transmitted on Mount Tiantai by Ge Xian’gong.\nHandan Zhangjun.\nGengsang Zi.",
      "start_char": 3486,
      "end_char": 3924,
      "start_sentence": 304,
      "end_sentence": 352,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.198270082473755,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\洞玄灵宝真灵位业图.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "二条气化结成。 赵伯玄。 刘子先。 臧延甫。 张子房。 宁仲君。 燕照王。 茅初成。 少室山伯北台郎千寿。 赤松子。 大梁真人魏显仁。 华山仙伯秦叔隐。 葛衍真人周季通。 太和真人山世远。 句曲真人定录右禁师茅君。 讳固，字季伟，为地真。 磻家真人右禁郎王道宁。 太清右公李抱祖。 蓬莱左公宋晨生。 蓬莱右公贾保安。 潜山真伯赵祖阳。 九疑仙侯张上贵。 蓬莱左卿姜叔茂。 周大宾。 毛伯道。 刘道恭。 二人王屋山得道。 东方朔。 马明生。 彭铿。 西入流沙。 凤纲。 韩终。 墨翟。 宋大水解。 乐子长。 李明。 雷平合丹。 商西四皓。 淮南八公。 青乌公。 黄山君。 育封。 方明。",
      "translated_text": "Two Streams of Qi-Transformation Congealed.\n\nZhao Boxuan.\nLiu Zixian.\nZang Yanfu.\nZhang Zifang.\nNing Zhongjun.\nYan Zhao Wang.\nMao Chucheng.\nLord of the Northern Terrace of Shaoshi Mountain, Thousand-Longevity.\nMaster Redpine.\nPerfected of Great Liang, Wei Xianren.\nImmortal Elder of Mount Hua, Qin Shuyin.\nPerfected of Ge Extension, Zhou Jitong.\nPerfected of Great Harmony, Shan Shiyuan.\nPerfected of Mount Gouqu, Recorder of the Right Prohibitions, Master Mao.\nPersonal name Gu, style Jiwei, Earth Perfected.\nPerfected of Pan Household, Right Prohibitions Gentleman, Wang Daoning.\nRight Duke of Great Clarity, Li Baozu.\nLeft Duke of Penglai, Song Chensheng.\nRight Duke of Penglai, Jia Bao’an.\nPerfected Elder of Mount Qian, Zhao Zuyang.\nImmortal Marquis of Mount Jiuyi, Zhang Shanggui.\nLeft Minister of Penglai, Jiang Shumao.\nZhou Dabin.\nMao Bodao.\nLiu Daogong.\nTwo attained the Way on Mount Wangwu.\nDongfang Shuo.\nMa Mingsheng.\nPeng Keng.\nWestward into the Flowing Sands.\nFeng Gang.\nHan Zhong.\nMo Di.\nSong Dashui Jie.\nYue Zichang.\nLi Ming.\nLei Ping compounded the elixir.\nFour Elders of Shangxi.\nEight Lords of Huainan.\nMaster Green Crow.\nLord of Yellow Mountain.\nYu Feng.\nFang Ming.",
      "overlap_context": "rials and petitions are submitted regarding the attainments of Dao cultivation.\n\nPerfected of Central Marchmount, Gao Qiuzi.\nPerfected of Auspicious Clouds.\nMaster of Ghost Valley.\nPrince of Grand Clarity.\nHeavenly Gentleman of the Nine Heavens.\nSeven Direct Attendants of the Northern Dipper.\nPerfected of Fixed Qi.\nPerfected of Supervising Immortals.\nFive Immortal Ladies.\nLady of the Inner Realm.\nTwenty-Four Lords, Generals, and Officials.\nOne Thousand Two Hundred Lords, Generals, and Officials.",
      "start_char": 3924,
      "end_char": 4291,
      "start_sentence": 353,
      "end_sentence": 396,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.419322967529297,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\洞玄灵宝真灵位业图.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "力牧。 昌宇。 庄伯微。 汉时人。 右位 太清仙王赵车子。 太清仙王李元容。 小有仙王邓离子。 五岳司西门叔度。 中央真人宋德玄。 中岳仙卿衍门子。 中岳真人孟子卓。 西岳真人冯延寿。 南岳真人傅先生。 青城真人洪崖先生。 九疑真人韩伟远。 岷山真人阴友宗。 司命太元定录紫台四真人。 中岳真人王仲甫。 北陵丈人。 太玄丈人。 北上丈人。 南上丈人。 太气丈人。 益命丈人。 飞真丈人。 九道丈人。 示安丈人。 百福丈人。 百千神气丈人。 登天上箓玉女四人。 上天玉女三人。 三天玉女百人。 青腰玉女官十人。 下等玉女。 北宫玉女。 五帝玉女。 太素玉女。 天素玉女。 白素玉女。 平天玉女。 六戊玉女。 青天益命玉女。 神丹玉女。 五流玉女。 右十五玉女号。 高上将军。 衡山使者。 上天力士。 天丁力士。 已上四人，并有姓名。 各领天兵十万，号四将军。 飞天使者。 九天使者。 九天真王使者。 高仙启天使者。 游天使者。 太清使者。 六乙使者。 六丙使者。 六丁使者。 六壬使者。 六癸使者。 右十五使者，自然之神。 东方灵威仰。 南方赤嫖弩。 西方曜魄宝。 北方隐侯局。 中央含枢纽。 此太清五帝，自然之神。 五岳君。 五百年而一替。 河侯。 河伯。 此三条，是得道之人所补。 西岳丈人。 三天玉童。 洛水神女。 此三条，亦是学道人所补。 飞天丈人。 太一中黄。 玄上玉童。 猛兽先生。 此自然之神，主天下鬼神禽兽。 赵升期。 在王屋山。 阴长生。 刘伟道。 汉时人。 郭崇子。 殷人。 郭声子。 洛市中卜。 周君。 徐季道。 鹄呜山。 鹿皮公。 仇季子。 司录君。 张巨君。 郭芍药。 赵爱儿。 王鲁连。 此三人，女真。 救苦真人君轨。 司危。 司厄。 司命。 八威。 除福。 帛和。 华子期。 鲍察。 乐巴。 葛洪。 隐罗浮山。 左东无上王。 四天官王。 昌命天王。 佐命君王。 飞真虎王。 九都去死王。 四海阴王。 太一元君。 上虚君。 摩病上元君。 七星瑶光君。 三元万福君。 夜光夫人。 和适夫人。",
      "translated_text": "Limu. Changyu. Zhuang Bowei, a man of the Han dynasty.\n\n**Right Position:**\nGreat Clarity Immortal King Zhao Chezi.\nGreat Clarity Immortal King Li Yuanrong.\nLesser Existence Immortal King Deng Lizǐ.\nController of the Five Marchmounts, Ximen Shudu.\nCentral Perfected, Song Dexuan.\nCentral Marchmount Immortal Minister, Yanmenzi.\nCentral Marchmount Perfected, Mengzi Zhuo.\nWestern Marchmount Perfected, Feng Yanshou.\nSouthern Marchmount Perfected, Master Fu.\nGreen City Perfected, Master Hongya.\nJiuyi Perfected, Han Weiyuan.\nMinshan Perfected, Yin Youzong.\nDirector of Destinies, Four Perfected of the Purple Terrace of Grand Primordial Record.\nCentral Marchmount Perfected, Wang Zhongfu.\nNorthern Mound Elder.\nGrand Mystery Elder.\nNorthern Ascendant Elder.\nSouthern Ascendant Elder.\nGrand Qi Elder.\nLife-Enhancing Elder.\nFlying Perfected Elder.\nNine Ways Elder.\nManifest Peace Elder.\nHundred Blessings Elder.\nHundred Thousand Spirit-Qi Elder.\n\n**Four Jade Maidens of the Register of Ascending Heaven.**\nThree Jade Maidens of Highest Heaven.\nOne Hundred Jade Maidens of the Three Heavens.\nTen Jade Maidens of the Green Waist Office.\nLesser Jade Maidens.\nNorthern Palace Jade Maidens.\nJade Maidens of the Five Thearchs.\nGrand Simplicity Jade Maidens.\nHeavenly Simplicity Jade Maidens.\nWhite Simplicity Jade Maidens.\nLevel Heaven Jade Maidens.\nSixth-Wu Jade Maidens.\nGreen Heaven Life-Enhancing Jade Maidens.\nDivine Elixir Jade Maidens.\nFive Currents Jade Maidens.\n*(Fifteen designations of Jade Maidens above.)*\n\n**Highest General.**\nHengshan Messenger.\nHighest Heaven Valiant.\nHeavenly Ding Valiant.\n*(The four persons above, each with personal names, command one hundred thousand celestial soldiers, styled the Four Generals.)*\n\nFlying Heaven Messenger.\nNine Heavens Messenger.\nNine Heavens Perfected King Messenger.\nHighest Immortal, Heaven-Opening Messenger.\nRoaming Heaven Messenger.\nGreat Clarity Messenger.\nSixth-Yi Messenger.\nSixth-Bing Messenger.\nSixth-Ding Messenger.\nSixth-Ren Messenger.\nSixth-Gui Messenger.\n*(Fifteen Messengers above, spirits of spontaneity.)*\n\n**Eastern Spirit, Ling Weiyang.**\n**Southern Spirit, Chi Piaonu.**\n**Western Spirit, Yao Pobao.**\n**Northern Spirit, Yin Houju.**\n**Central Spirit, Han Shuniu.**\n*(These Five Thearchs of Great Clarity are spirits of spontaneity.)*\n\n**Lords of the Five Marchmounts**, replaced every five hundred years.\n**River Marquis.**\n**River Earl.**\n*(These three ranks are filled by those who have attained the Way.)*\n\n**Western Marchmount Elder.**\n**Three Heavens Jade Lads.**\n**Luo River Goddess.**\n*(These three ranks are also filled by practitioners of the Way.)*\n\n**Flying Heaven Elder.**\n**Grand One, Central Yellow.**\n**Dark Ascendant Jade Lad.**\n**Master Fierce Beast.**\n*(These are spirits of spontaneity, governing the ghosts, spirits, birds, and beasts of the world.)*\n\nZhao Shengqi, on Mount Wangwu.\nYin Changsheng.\nLiu Weidao, a man of the Han dynasty.\nGuo Chongzi, of the Yin.\nGuo Shengzi, diviner of the Luo market.\nLord Zhou.\nXu Jidao, of Humming Crane Mountain.\nMaster Deerhide.\nQiu Jizi.\nDirector of Records.\nZhang Jujun.\nGuo Shaoyao.\nZhao Aier.\nWang Lulian.\n*(These last three are Female Perfected.)*\n\n**Perfected of Salvation from Suffering, Jun Gui.**\n**Controller of Danger.**\n**Controller of Adversity.**\n**Director of Destinies.**\n**Eight Awesomeness.**\n**Eliminator of Misfortune.**\n**Bo He.**\n**Hua Zǐqi.**\n**Bao Cha.**\n**Le Ba.**\n**Ge Hong**, who concealed himself on Mount Luofu.\n\n**Left Supreme King of the East.**\n**King of the Four Heavenly Offices.**\n**King of Mandated Longevity.**\n**King Assisting Destiny.**\n**King of Flying Perfected Tigers.**\n**King of the Nine Capitals, Remover of Death.**\n**Yin King of the Four Seas.**\n**Grand One Primordial Lady.**\n**Lord of Highest Emptiness.**\n**Upper Primordial Lady of Healing.**\n**Lady of the Seven Stars’ Jade Radiance.**\n**Lord of the Three Primordials and Myriad Blessings.**\n**Lady of Night Radiance.**\n**Lady of Harmonious Adaptation.**",
      "overlap_context": " Bao’an.\nPerfected Elder of Mount Qian, Zhao Zuyang.\nImmortal Marquis of Mount Jiuyi, Zhang Shanggui.\nLeft Minister of Penglai, Jiang Shumao.\nZhou Dabin.\nMao Bodao.\nLiu Daogong.\nTwo attained the Way on Mount Wangwu.\nDongfang Shuo.\nMa Mingsheng.\nPeng Keng.\nWestward into the Flowing Sands.\nFeng Gang.\nHan Zhong.\nMo Di.\nSong Dashui Jie.\nYue Zichang.\nLi Ming.\nLei Ping compounded the elixir.\nFour Elders of Shangxi.\nEight Lords of Huainan.\nMaster Green Crow.\nLord of Yellow Mountain.\nYu Feng.\nFang Ming.",
      "start_char": 4291,
      "end_char": 5393,
      "start_sentence": 397,
      "end_sentence": 526,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.469467163085938,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\洞玄灵宝真灵位业图.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "第五中位 九宫尚书。 姓张，名奉，字公先，河内人。 先为河北司命禁保侯，今为太极仙陟公，领北职位，在太极矣。 左位 左相。 清虚真人，从小有洞天王受，王真人替，已度上清。 左仙公郭四朝兼玉台执盖郎。 左仙公王遥甫。 赤君弟子，齐献公时人。 辛彦云。 赤君弟子，随师下降。 散位未受其职。 朱陵嫔丁淑英。 管城子。 尹虔子师。 苏门先生。 周寿陵。 孟德然。 郑景女师。 宋君。 李法成。 赵广信师。 邓元伯。 王玄甫。 霍山人。 尹虔子。 华山。 张石生。 为东源伯。 李方回。 三人，并晋时服木。 张礼正。 衡山。",
      "translated_text": "**Fifth Central Rank: Nine Palaces Minister of State.**\nSurnamed Zhang, named Feng, styled Gongxian, a native of Henei. Formerly the Controller of Destinies and Marquis of Prohibitions in Hebei, now the Duke of Transcendent Ascent of the Great Ultimate, presiding over the Northern Office, stationed in the Great Ultimate.\n\n**Left Rank:**\n**Left Chancellor.**\nPerfected of Pure Emptiness, who from youth received transmission from the King of Cavern-Heavens; succeeding the Perfected King, he has already ascended to the Upper Clarity.\n\n**Left Transcendent Duke** Guo Sichao, concurrently Canopy-Bearer of the Jade Terrace.\n\n**Left Transcendent Duke** Wang Yaofu.\nDisciple of the Red Lord, a man of the time of Duke Xian of Qi.\n\nXin Yanyun.\nDisciple of the Red Lord, who descended with his master. Dispersed rank, not yet appointed to office.\n\nZhu Ling Concubine Ding Shuying.\nGuanchengzi.\nMaster Yin Qianzi.\nMaster of Su Gate.\nZhou Shouling.\nMeng Deran.\nMaster Zheng Jingnü.\nLord Song.\nLi Facheng.\nMaster Zhao Guangxin.\nDeng Yuanbo.\nWang Xuanfu.\nMan of Huo Mountain.\nYin Qianzi.\nMount Hua.\nZhang Shisheng, who serves as Earl of the Eastern Source.\nLi Fanghui.\nThree men, all of the Jin who ingested wood.\n\nZhang Lizheng.\nMount Heng.",
      "overlap_context": "e King of the East.**\n**King of the Four Heavenly Offices.**\n**King of Mandated Longevity.**\n**King Assisting Destiny.**\n**King of Flying Perfected Tigers.**\n**King of the Nine Capitals, Remover of Death.**\n**Yin King of the Four Seas.**\n**Grand One Primordial Lady.**\n**Lord of Highest Emptiness.**\n**Upper Primordial Lady of Healing.**\n**Lady of the Seven Stars’ Jade Radiance.**\n**Lord of the Three Primordials and Myriad Blessings.**\n**Lady of Night Radiance.**\n**Lady of Harmonious Adaptation.**",
      "start_char": 5394,
      "end_char": 5676,
      "start_sentence": 527,
      "end_sentence": 560,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.776901483535767,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\洞玄灵宝真灵位业图.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "汉末服黄精。 治明期。 衡山。 郑景世。 庐江潜山。 右位 右相。 已度上清。 右保召公奭。 从罗南明公受此位。 右保司展上公。 右真公郭少金。 协晨夫人黄景华。 黄琼之女。 文德右仙监张叔隐。 真人禺君章。 散位 张重华。 晋初服胡麻。 平仲卿。 括苍山。 受□境。 赵广信。 魏末小白山。 虞公生。 海中狼山。 朱孺子。 赤水山。 黄卢子。 西岳公，姓葛，禁气召龙。 孙田广。 一名登。 摩长生。 周大宾弟子。 许肇。 先在罗酆都，为东明公右司晨。 许副。 字仲先，修大洞真经。 第六中位 右禁郎定录真君中茅君。 治华阳洞天。 左位 三官保命小茅君。 三官大理都李丰。 三官大理守王附子。 荀中侯。 不显名字。 白水仙都朱交甫。 北河司命保禁侯桃俊。 左理中监韩崇。 如大府长史，左如司马。 九宫协晨夫人。 文解。 地上主者。",
      "translated_text": "At the end of the Han, those who ingested yellow essence.\nZhi Mingqi.\nMount Heng.\nZheng Jingshi.\nMount Lu of Lujiang in Qianshan.\n\n**Right Position**\n**Right Minister**, already ascended to the Upper Clarity.\n**Right Protector** Duke Shih of Zhao, who received this position from Luo Nanminggong.\n**Right Protector** Controller of the Upper Duke Zhan.\n**Right Perfected Duke** Guo Shaojin.\n**Lady of Harmonious Dawn** Huang Jinghua, daughter of Huang Qiong.\n**Right Daoist Overseer of Civil Virtue** Zhang Shuyin.\n**Perfected One** Yu Junzhang.\n\n**Dispersed Ranks**\nZhang Chonghua, who ingested sesame at the beginning of the Jin.\nPing Zhongqing.\nMount Guacang, who received the [ ] realm.\nZhao Guangxin.\nLittle White Mountain at the end of the Wei.\nYu Gongsheng.\nWolf Mountain in the sea.\nZhu Ruzhi.\nRed Water Mountain.\nHuang Luzhi.\n**Duke of the Western Marchmount**, surnamed Ge, who restrained qi and summoned dragons.\nSun Tianguang, also named Deng.\nMo Changsheng, disciple of Zhou Dabin.\nXu Zhao, formerly in the Luo Feng capital as Right Controller of Dawn for the Eastern Bright Duke.\nXu Fu, styled Zhongxian, who cultivated the *Great Grotto Perfection Scripture*.\n\n**Sixth Middle Position**\n**Right Prohibition Officer** True Lord of Fixed Register, Central Mao Lord, who governs the Hua-Yang Grotto-Heaven.\n\n**Left Position**\n**Three Officials’ Life-Protecting** Lesser Mao Lord.\n**Three Officials’ Grand Judge** Li Feng.\n**Three Officials’ Grand Judge Guardian** Wang Fuzi.\nXun Zhonghou, whose name is not publicly known.\n**White Water Immortal Capital** Zhu Jiaofu.\n**Northern River Controller of Destiny and Prohibition Marquis** Tao Jun.\n**Left Judge of the Central Bureau** Han Chong, akin to a Grand Secretariat Director or Left Controller.\n**Lady of the Nine Palaces’ Harmonious Dawn**, Wen Jie.\n**Earthly Controller**.",
      "overlap_context": "Yanyun.\nDisciple of the Red Lord, who descended with his master. Dispersed rank, not yet appointed to office.\n\nZhu Ling Concubine Ding Shuying.\nGuanchengzi.\nMaster Yin Qianzi.\nMaster of Su Gate.\nZhou Shouling.\nMeng Deran.\nMaster Zheng Jingnü.\nLord Song.\nLi Facheng.\nMaster Zhao Guangxin.\nDeng Yuanbo.\nWang Xuanfu.\nMan of Huo Mountain.\nYin Qianzi.\nMount Hua.\nZhang Shisheng, who serves as Earl of the Eastern Source.\nLi Fanghui.\nThree men, all of the Jin who ingested wood.\n\nZhang Lizheng.\nMount Heng.",
      "start_char": 5676,
      "end_char": 6087,
      "start_sentence": 561,
      "end_sentence": 614,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.843674898147583,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\洞玄灵宝真灵位业图.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "鲍靓。 南海太守。 岱宗神侯领罗邓右禁司鲍元节。 地仙散位 许虎牙。 名黟，字文晖。 受杨君守一之道。 王真。 上党人也。 孟君。 京兆人也。 鲁女生。 在中岳。 此三人受行三一、真一。 左元放。 李仲甫弟子，在小括山。 九疑山女真罗郁。 今在湘东山。 杜陵夫人。 宜安宋姬。 此二人，并受西梁真人青精方，而不书位号，来委何仙，且在地真之列。 许迈。 字叔玄，小名映，改名远游，东华为地仙矣。 翁道远。 姜伯真。 一云在猛山学道采药，二人映之俦侣。 郭声子。 黄子阳。 一云魏夫人食桃皮师。 二人葛玄常相随矣。 葛玄。",
      "translated_text": "Bao Jing, Prefect of Nanhai, Divine Marquis of Mount Tai, who oversees the Right Prohibition Bureau for Luo and Deng—Bao Yuanjie.\n\n**Earthly Immortals in Dispersed Positions**\nXu Huya, named Yi, styled Wenhui, who received the *Guard-the-One Way* from Master Yang.\nWang Zhen of Shangdang.\nMeng Jun of Jingzhao.\nLu Nüsheng of Mount Song—these three cultivated the *Three Ones* and the *True One*.\nZuǒ Yuanfang, disciple of Li Zhongfu, residing on Mount Xiao-Kuo.\nLuo Yu, Female Perfected of Mount Jiuyi, now on Mount Xiangdong.\nLady of Duling.\nSong Ji of Yi’an—these two both received the *Azure Essence Formula* from the Perfected of Western Liang, yet their positions are unrecorded, having entrusted themselves to the immortals; for now, they rank among the Earthly Perfected.\nXu Mai, styled Shuxuan, childhood name Ying, later renamed Yuanyou, now an Earthly Immortal of Eastern Florescence.\nWeng Daoyuan.\nJiang Bozhen—one account places them on Mount Meng, where they studied the Dao and gathered herbs, companions to Ying.\nGuo Shengzi.\nHuang Ziyang—one account says they were disciples of Lady Wei, who ate peach-bark; both were constant followers of Ge Xuan.\nGe Xuan.",
      "overlap_context": "**Three Officials’ Life-Protecting** Lesser Mao Lord.\n**Three Officials’ Grand Judge** Li Feng.\n**Three Officials’ Grand Judge Guardian** Wang Fuzi.\nXun Zhonghou, whose name is not publicly known.\n**White Water Immortal Capital** Zhu Jiaofu.\n**Northern River Controller of Destiny and Prohibition Marquis** Tao Jun.\n**Left Judge of the Central Bureau** Han Chong, akin to a Grand Secretariat Director or Left Controller.\n**Lady of the Nine Palaces’ Harmonious Dawn**, Wen Jie.\n**Earthly Controller**.",
      "start_char": 6088,
      "end_char": 6367,
      "start_sentence": 615,
      "end_sentence": 645,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.74144721031189,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\洞玄灵宝真灵位业图.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "字孝先，丹阳句曲人，稚川之从祖也。 初在长山，乘虎使鬼，无处不至，位在太极宫。 郑思远。 即葛玄弟子，晋永昌元年入括苍山。 戴孟。 本姓燕，名济，字仲微。 裴君弟子。 谢允。 历阳人。 戴孟弟子，晋成帝时得道。 施存。 一号婉盆子。 孔子弟子三千人，数得道。 刘奉林。 周时人，服黄连。 张兆期。 费长房之师。 周君。 二人，俱读素书七卷，得道。 雷氏。 周氏养龙。 姜叔。 田公刘安之。 裴君时冀州别驾。 赤鲁班。 即黄初起也。 范安远。 贾玄道。 李叔胜。 言成生。 傅道流。",
      "translated_text": "Styled Xiaoxian, a native of Juqu in Danyang and the paternal great-uncle of Zichuan. Initially dwelling on Mount Chang, he rode tigers and commanded spirits, reaching every place; his rank was in the Palace of the Supreme Ultimate.\n\nZheng Siyuan, disciple of Ge Xuan, entered Mount Kuocang in the first year of Yongchang of the Jin.\n\nDai Meng, originally surnamed Yan, named Ji, styled Zhongwei, disciple of Master Pei.\n\nXie Yun of Liyang, disciple of Dai Meng, attained the Dao in the time of Emperor Cheng of Jin.\n\nShi Cun, also called Wanpenzi. Among Confucius’ three thousand disciples, several attained the Dao.\n\nLiu Fenglin, a man of the Zhou, who ingested *huanglian*.\n\nZhang Zhaoqi, teacher of Fei Zhangfang.\n\nMaster Zhou. These two both studied the *Plain Writ* in seven scrolls and attained the Dao.\n\nThe Lei clan, who raised dragons.\n\nJiang Shu.\n\nTian Gong, styled Liu’an.\n\nMaster Pei’s subordinate, the Attendant of Jizhou.\n\nChi Luban, who was Huangchu Qi.\n\nFan Anyuan.\n\nJia Xuandao.\n\nLi Shusheng.\n\nYan Chengsheng.\n\nFu Daoliu.",
      "overlap_context": "unrecorded, having entrusted themselves to the immortals; for now, they rank among the Earthly Perfected.\nXu Mai, styled Shuxuan, childhood name Ying, later renamed Yuanyou, now an Earthly Immortal of Eastern Florescence.\nWeng Daoyuan.\nJiang Bozhen—one account places them on Mount Meng, where they studied the Dao and gathered herbs, companions to Ying.\nGuo Shengzi.\nHuang Ziyang—one account says they were disciples of Lady Wei, who ate peach-bark; both were constant followers of Ge Xuan.\nGe Xuan.",
      "start_char": 6367,
      "end_char": 6625,
      "start_sentence": 646,
      "end_sentence": 676,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.86066460609436,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\洞玄灵宝真灵位业图.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "四人并隶司命，主察试学道者，在太山。 真人樊子明。 龙威丈人。 刘少翁。 华山。 梁伯鸾。 樊大夫。 吴睦。 长安人，少为县吏。 朱□。 陈留人，昔作劫盗。 郭端。 颖川人，少孤为县吏。 范伯慈。 桂阳人，少曾邪病。 鲍叔阳。 王养伯。 段季正。 刘伟惠。 四人师西灵子都。 宋玄德。 嵩高山。 李东。 童初府。 萧闲宫。 并男真。 易迁宫。 八十三人。 含真台。 仅二百人，并女真。 右位 右理中监刘翊。 典柄执法郎淳于斟。 理禁张玄宾。 主雨水之官。 亦保命书。 童初府师上侯刘宽。 即保命府。 丞四人： 赵威伯。 主仙籍，并暴雨水。 乐长治。 主灾害。 郑稚政。 主考注。 唐公房。 主其死生。 明晨侍郎七人，比御史中丞。 三男真。 夏馥字子恬，阵留人，桐桥真人弟子。 二人不显。 四女真。 周夏友，汝南安城人，河南尹周畅之女。 张桃枝，沛人，司隶朱寓之母。 二人不显。 监二人。",
      "translated_text": "Four masters, all subordinate to the Bureau of Destiny, preside over the examination and testing of Dao learners on Mount Tai.\n\nPerfected One Fan Ziming.\nDragon Might Elder.\nLiu Shaoweng.\nMount Hua.\nLiang Boluan.\nMaster Fan.\nWu Mu, a man of Chang’an, who in his youth served as a county clerk.\nZhu [missing character], a man of Chenliu, formerly a bandit.\nGuo Duan, a man of Yingchuan, orphaned in youth and serving as a county clerk.\nFan Boci, a man of Guiyang, who in his youth suffered from demonic illness.\nBao Shuyang.\nWang Yangbo.\nDuan Jizheng.\nLiu Weihui.\nFour disciples of Master Xiling Zidu.\n\nSong Xuande.\nMount Songgao.\nLi Dong.\nOffice of Youthful Primordium.\nPalace of Leisurely Ease—all male Perfected.\nPalace of Transformative Ascent.\nEighty-three persons.\nTerrace of Embracing the True—only two hundred persons, all female Perfected.\n\n[Right Position]\nRight Director of Central Governance, Supervisor Liu Yi.\nKeeper of the Authority and Enforcer of the Law, Lang Chunyu Zhen.\nDirector of Prohibitions, Zhang Xuanbin.\nOfficer in Charge of Rain and Water, also Keeper of the Writs of Life Protection.\n\nMaster of the Office of Youthful Primordium, Marquis Shanghou Liu Kuan—this being the Office of Life Protection.\nFour Assistants:\nZhao Weibo, in charge of the registers of immortals and of torrential rain and water.\nYue Changzhi, in charge of disasters and calamities.\nZheng Zhizheng, in charge of examinations and records.\nTang Gongfang, in charge of life and death.\n\nSeven Attendant Gentlemen of the Dawn, equivalent to the Censor-in-Chief.\nThree male Perfected:\nXia Fu, styled Zitian, a man of Chenliu, disciple of the Perfected One of Tong Bridge.\nTwo persons, names not recorded.\nFour female Perfected:\nZhou Xiayou, a woman of Ancheng in Runan, daughter of Zhou Chang, Prefect of Henan.\nZhang Taozhi, a woman of Pei, mother of Zhu Yu, Metropolitan Inspector.\nTwo persons, names not recorded.\nTwo Supervisors.",
      "overlap_context": "Wanpenzi. Among Confucius’ three thousand disciples, several attained the Dao.\n\nLiu Fenglin, a man of the Zhou, who ingested *huanglian*.\n\nZhang Zhaoqi, teacher of Fei Zhangfang.\n\nMaster Zhou. These two both studied the *Plain Writ* in seven scrolls and attained the Dao.\n\nThe Lei clan, who raised dragons.\n\nJiang Shu.\n\nTian Gong, styled Liu’an.\n\nMaster Pei’s subordinate, the Attendant of Jizhou.\n\nChi Luban, who was Huangchu Qi.\n\nFan Anyuan.\n\nJia Xuandao.\n\nLi Shusheng.\n\nYan Chengsheng.\n\nFu Daoliu.",
      "start_char": 6625,
      "end_char": 7062,
      "start_sentence": 677,
      "end_sentence": 732,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.50840139389038,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\洞玄灵宝真灵位业图.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "范幽冲，辽西人。 汉尚书，即李整，河内人。 武解鬼帅者： 王延。 范粮。 傅晃。 除衔。 四人已度。 地仙散位 中岳仙人宋来子。 先为楚市长，遇冯延寿。 中岳李先生。 扁鹊弟子五人： 子容。 子明。 子威。 子戏。 子游。 赵太子。 服木者。 将先生。 支子元之师。 支子元。 作裴君小时师。 庐生。 侯公。 石生。 入东海，为始皇使。 林屋仙人王璋玄。 山图公子。 周哀王时大夫，张禁保之师。 赤须子。 夏明晨之师。 青谷先生。 刘上缀之师。 惠车子。 淳于典柄之师。 石长生。 周明晨之师。 东郭幼平。 桃北河之师。 郑子真。 阳翟山。 邓云山。 唐览。 华山。 西河蓟公。 张理禁之师。 周正时。 刁道林。 龙伯高之师。 郭子华。 赵叔逵。 张季连。 三人在霍山。 赵公成。 鹤呜山。 范丘林。 女真。 赵威伯六甲之师。 修羊公。 化为白石矣。 稷丘子。 崔文子。 商丘子。 服菖蒲而不老。 刘根。 服甘草。 介象。 白羊公。",
      "translated_text": "Fan Youchong, a man of Liaoxi.\nHan Shangshu—this being Li Zheng, a man of Henei.\nCommanders of the Demon-Quelling Host:\nWang Yan.\nFan Liang.\nFu Huang.\nChu Xian.\nFour persons, already transcended.\n\nEarthbound Immortals of Unassigned Rank:\nSong Laizi of Central Marchmount, formerly Market Director of Chu, who encountered Feng Yanshou.\nMaster Li of Central Marchmount.\nFive disciples of Bian Que:\nZirong.\nZiming.\nZiwei.\nZixi.\nZiyou.\nCrown Prince Zhao.\nThe Master Who Ingests Wood.\nGeneral Master.\nTeacher of Zhi Ziyuan.\nZhi Ziyuan, who in his youth studied under Master Pei.\nLu Sheng.\nMarquis Hou.\nShi Sheng, who entered the Eastern Sea as an emissary of the First Emperor.\nWang Zhangxuan, Immortal of Mount Linwu.\nMaster Shantu.\nA minister of King Ai of Zhou and teacher of Zhang Jinbao.\nChixuzi, teacher of Xia Mingchen.\nMaster Qinggu.\nTeacher of Liu Shangzhui.\nHuichezi, teacher of Chunyu Dianbing.\nShi Changsheng, teacher of Zhou Mingchen.\nDongguo Youping, teacher of Taobei River.\nZheng Zizhen of Mount Yangdi.\nDeng Yunshan.\nTang Lan of Mount Hua.\nXihe Jigong, teacher of Zhang Lijin.\nZhou Zhengshi.\nDiao Daolin, teacher of Long Bogao.\nGuo Zihua.\nZhao Shuji.\nZhang Jilian.\nThree persons residing on Mount Huo.\nZhao Gongcheng of Mount Heming.\nFan Qiulin.\nA female Perfected, teacher of Zhao Weibo in the Six Jia.\nMaster Xuyang, who transformed into white stone.\nJiqiuzi.\nCui Wenzi.\nShangqiuzi, who ingested calamus and did not age.\nLiu Gen, who ingested licorice.\nJie Xiang.\nBaiyang Gong.",
      "overlap_context": "d records.\nTang Gongfang, in charge of life and death.\n\nSeven Attendant Gentlemen of the Dawn, equivalent to the Censor-in-Chief.\nThree male Perfected:\nXia Fu, styled Zitian, a man of Chenliu, disciple of the Perfected One of Tong Bridge.\nTwo persons, names not recorded.\nFour female Perfected:\nZhou Xiayou, a woman of Ancheng in Runan, daughter of Zhou Chang, Prefect of Henan.\nZhang Taozhi, a woman of Pei, mother of Zhu Yu, Metropolitan Inspector.\nTwo persons, names not recorded.\nTwo Supervisors.",
      "start_char": 7062,
      "end_char": 7523,
      "start_sentence": 733,
      "end_sentence": 802,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.154437780380249,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\洞玄灵宝真灵位业图.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "不显姓名。 介琰。 白羊弟子。 刘纲妻。 严青。 并善禁气，已上六人善禁勅。 陈仲林。 道君。 赵叔道。 三人，盖竹山中真人。 王世龙。 许远游师。 赵道玄。 傅太初。 远游之交。 龚幼节。 李开林。 远游代对者。 王少道。 范叔胜。 李伯山。 三人，童初府标表。 李仲文。 傅知礼。 女真 窦琼英。 韩太华。 安国妹，李广利妇。 刘春龙。 李奚子。 王进贤。 衍女。 郭叔香。 赵素台。 熙女。 郑天生。 邓艾母。 许科斗。 长史妇。 李专姑。 夏侯玄妇。 张美子。 施淑女。 续女。 宋漂金母。 鲍靓妹。 张微子。 傅和。 二人，含真台主。 山外其东者杜契。 徐宗度。 晏贤生。 二人，契友。 孙寒华。 女真。 陈世景。 二人，契弟子。 赵熙。 方山下洞室主者。 张祖常。 刘平阿。",
      "translated_text": "Those whose names remain unrecorded.\nJie Yan.\nDisciple of Baiyang.\nLiu Gang’s wife.\nYan Qing.\nAll six above excelled in qi-binding and incantations.\nChen Zhonglin.\nDao Lord.\nZhao Shudao.\nThree Perfected Ones of Mount Gaizhu.\nWang Shilong.\nDisciple of Xu Yuanyou.\nZhao Daoxuan.\nFu Taichu.\nFriend of Yuanyou.\nGong Youjie.\nLi Kailin.\nYuanyou’s respondent.\nWang Shaodao.\nFan Shusheng.\nLi Boshan.\nThree, markers of Tongchu Prefecture.\nLi Zhongwen.\nFu Zhili.\nFemale Perfected Dou Qiongying.\nHan Taihua.\nYounger sister of An Guo, wife of Li Guangli.\nLiu Chunlong.\nLi Xizi.\nWang Jinxian.\nYan’s daughter.\nGuo Shuxiang.\nZhao Sutai.\nXi’s daughter.\nZheng Tiansheng.\nMother of Deng Ai.\nXu Kedou.\nWife of the Chief Clerk.\nLi Zhuangu.\nWife of Xiahou Xuan.\nZhang Meizi.\nShi Shunü.\nXu’s daughter.\nMother of Song Piaojin.\nYounger sister of Bao Jing.\nZhang Weizi.\nFu He.\nTwo, masters of Hanzhen Terrace.\nBeyond the mountain to the east, Du Qi.\nXu Zongdu.\nYan Xiansheng.\nTwo, friends of Qi.\nSun Hanhua.\nFemale Perfected.\nChen Shijing.\nTwo, disciples of Qi.\nZhao Xi.\nMaster of the grotto-chamber beneath Mount Fang.\nZhang Zuchang.\nLiu Ping’e.",
      "overlap_context": "Zizhen of Mount Yangdi.\nDeng Yunshan.\nTang Lan of Mount Hua.\nXihe Jigong, teacher of Zhang Lijin.\nZhou Zhengshi.\nDiao Daolin, teacher of Long Bogao.\nGuo Zihua.\nZhao Shuji.\nZhang Jilian.\nThree persons residing on Mount Huo.\nZhao Gongcheng of Mount Heming.\nFan Qiulin.\nA female Perfected, teacher of Zhao Weibo in the Six Jia.\nMaster Xuyang, who transformed into white stone.\nJiqiuzi.\nCui Wenzi.\nShangqiuzi, who ingested calamus and did not age.\nLiu Gen, who ingested licorice.\nJie Xiang.\nBaiyang Gong.",
      "start_char": 7523,
      "end_char": 7932,
      "start_sentence": 803,
      "end_sentence": 863,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.397419214248657,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\洞玄灵宝真灵位业图.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "吕子华。 蔡天生。 龙伯高。 五人，并处方台。 谢稚坚。 王伯辽。 繁阳子何苗。 冯良。 郎宗。 五人，在鹿迹洞。 王叔明。 鲍元治。 尹盖妇。 三人之外，余三十人，并北山下绝洞。 辛玄子。 自云禁无中郎将，吴越鬼神之司。 比干。 在戎山。 李喜。 南阳人。 务光。 第七中位 酆都北阴大帝。 炎帝大庭氏，讳履甲，天下鬼神之宗，治罗酆山，三千年而一替。 左位 北帝上相秦始皇。 北帝太傅魏武帝。 五帝上相。 未显。 西明公领北帝师周文王。 比少傅。 宾友晋宣帝。 中护军周颛。 东明公领斗君师夏启。 宾友孙策。 右师晨。 如世中书监。 许肇。 已度九宫位矣。 南明公召奭。 一云东明公，已度九宫右保公。 宾友汉高祖。 北明公吴季札。 吴王寿梦之子，阖闾之叔，延 陵季子。 宾友荀或。 字文若，魏武谋臣，汉尚书令。 赵叔台。 王世卿。",
      "translated_text": "Lü Zihua.\nCai Tiansheng.\nLong Bogao.\nFive persons, all residing at Fang Terrace.\nXie Zhijian.\nWang Boliao.\nFan Yangzi He Miao.\nFeng Liang.\nLang Zong.\nFive persons, at Deer Track Grotto.\nWang Shuming.\nBao Yuanzhi.\nWife of Yin Gai.\nBeyond these three, the remaining thirty persons, all at the sheer grotto beneath Northern Mountain.\nXin Xuanzi.\nClaimed to be the Commandant of the Prohibited Void, controller of the ghosts and spirits of Wu and Yue.\nBi Gan.\nAt Mount Rong.\nLi Xi.\nA native of Nanyang.\nWu Guang.\nSeventh Middle Position.\nThe Great Emperor of the Northern Yin of Fengdu.\nThe Great Emperor Yandi of the Datiing clan, personal name Lǚ Jia, ancestral lord of all ghosts and spirits under heaven, ruling Mount Luofeng, succeeded every three thousand years.\n\nLeft Position:\nThe Supreme Minister of the Northern Emperor, Qin Shihuang.\nThe Grand Tutor of the Northern Emperor, Emperor Wu of Wei.\nThe Supreme Ministers of the Five Emperors.\nNot yet manifested.\nThe Duke of Ximing, leading the Northern Emperor’s Master, King Wen of Zhou.\nJunior Tutor.\nGuest and Friend, Emperor Xuan of Jin.\nCentral Protector-General, Zhou Yun.\nThe Duke of Dongming, leading the Master of the Dipper Lord, King Qi of Xia.\nGuest and Friend, Sun Ce.\n\nRight Division:\nChen.\nLike the Secretariat Supervisor of the mundane world.\nXu Zhao.\nAlready ascended through the Nine Palace Positions.\nThe Duke of Nanming, Shao Shi.\nOne account says the Duke of Dongming, already ascended as the Right Protector of the Nine Palaces.\nGuest and Friend, Emperor Gaozu of Han.\nThe Duke of Beiming, Wu Jizha.\nSon of King Shoumeng of Wu, uncle of Helü, Jizi of Yanling.\nGuest and Friend, Xun Yu.\nStyle name Wenruo, strategist of Emperor Wu of Wei, Han Minister of Works.\nZhao Shutai.\nWang Shiqing.",
      "overlap_context": "\nXi’s daughter.\nZheng Tiansheng.\nMother of Deng Ai.\nXu Kedou.\nWife of the Chief Clerk.\nLi Zhuangu.\nWife of Xiahou Xuan.\nZhang Meizi.\nShi Shunü.\nXu’s daughter.\nMother of Song Piaojin.\nYounger sister of Bao Jing.\nZhang Weizi.\nFu He.\nTwo, masters of Hanzhen Terrace.\nBeyond the mountain to the east, Du Qi.\nXu Zongdu.\nYan Xiansheng.\nTwo, friends of Qi.\nSun Hanhua.\nFemale Perfected.\nChen Shijing.\nTwo, disciples of Qi.\nZhao Xi.\nMaster of the grotto-chamber beneath Mount Fang.\nZhang Zuchang.\nLiu Ping’e.",
      "start_char": 7933,
      "end_char": 8355,
      "start_sentence": 864,
      "end_sentence": 912,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.990061521530151,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\洞玄灵宝真灵位业图.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "未显。 此四明，主领四方，各治一天宫，在 职一千六百年，得补仙官。 其余职 不得矣。 鬼官北斗君周武王。 治一天宫。 三官都禁郎齐桓公。 姓姜，名小白。 水官司命晋文公。 姓姬，名重耳。 大禁晨二人，位比尚书令。 汉光武帝。 孙文台。 名坚。 中禁二人，位比中书令监。 颜怀。 字思季。 杨彪，字文光。 北帝南朱阳大门灵关侯郄鉴。 先是高明司直郄鉴，今为之位比尚书仆射。 右禁监谢幼舆。 名馄。 晋官太常。 司马邓岳。 右禁监侍帝晨庾元规。 名亮，晋时位比侍中，领右卫。 又云元规前为中卫大将军。 司马冯怀。 字相思，晋太常。 华歆。 长史虞翻。 字长翔，武昌人。 庾亮江州引为上佐，不就。 后中卫大将军孔文举。 名融。 长史唐周。 为吴尚书。 司马张绣。 后汉将军。 监海伯治东海温太真。 位比大将军。 长史杜预。 晋征南将军，位左傅。 北帝侍晨八人，位比侍中。 徐庶。 字文直。",
      "translated_text": "Unmanifested.\nThese Four Ming Dukes oversee the four directions, each governing one Celestial Palace, holding office for one thousand six hundred years before qualifying to ascend as immortal officials. Those in other positions do not qualify.\n\nGhost Official: Northern Dipper Lord, King Wu of Zhou. Governs one Celestial Palace.\n\nThree Officials Chief Prohibition Officer: Duke Huan of Qi. Surname Jiang, personal name Xiaobai.\nWater Official Controller of Destiny: Duke Wen of Jin. Surname Ji, personal name Chong'er.\n\nTwo Grand Prohibition Officers, rank equivalent to the Director of the Imperial Secretariat:\nEmperor Guangwu of Han.\nSun Wentai. Personal name Jian.\n\nTwo Central Prohibition Officers, rank equivalent to the Director of the Central Secretariat:\nYan Huai. Style name Siji.\nYang Biao. Style name Wenguang.\n\nNorthern Emperor’s Southern Vermilion Yang Gate Spirit Barrier Marquis: Xi Jian. Formerly the Illustrious Rectifier of the Imperial Censorate, now holds a rank equivalent to the Deputy Director of the Imperial Secretariat.\n\nRight Prohibition Inspector: Xie Youyu. Personal name Kun. Formerly the Grand Master of Ceremonies of Jin.\n\nSima Deng Yue.\nRight Prohibition Inspector Attending the Imperial Morning Audience: Yu Yuan’gui. Personal name Liang, during the Jin dynasty held a rank equivalent to the Attendant-in-Ordinary and commanded the Right Guard. Another account states that Yuan’gui previously served as the Central Guard Grand General.\n\nSima Feng Huai. Style name Xiangsi, Grand Master of Ceremonies of Jin.\nHua Xin.\n\nChief Clerk: Yu Fan. Style name Changxiang, a native of Wuchang. Recruited by Yu Liang of Jiangzhou as his chief aide, but declined. Later, Central Guard Grand General Kong Wenju. Personal name Rong.\n\nChief Clerk: Tang Zhou. Served as a Minister of Wu.\n\nSima Zhang Xiu. General of the Later Han.\n\nMarquis Overseer of the Eastern Sea: Wen Tairen. Rank equivalent to Grand General.\n\nChief Clerk: Du Yu. Jin’s General of Southern Campaigns, rank equivalent to Left Mentor.\n\nEight Northern Emperor Attendants of the Morning Audience, rank equivalent to Attendant-in-Ordinary:\nXu Shu. Style name Wenzhi.",
      "overlap_context": " the Secretariat Supervisor of the mundane world.\nXu Zhao.\nAlready ascended through the Nine Palace Positions.\nThe Duke of Nanming, Shao Shi.\nOne account says the Duke of Dongming, already ascended as the Right Protector of the Nine Palaces.\nGuest and Friend, Emperor Gaozu of Han.\nThe Duke of Beiming, Wu Jizha.\nSon of King Shoumeng of Wu, uncle of Helü, Jizi of Yanling.\nGuest and Friend, Xun Yu.\nStyle name Wenruo, strategist of Emperor Wu of Wei, Han Minister of Works.\nZhao Shutai.\nWang Shiqing.",
      "start_char": 8355,
      "end_char": 8772,
      "start_sentence": 913,
      "end_sentence": 959,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.997738122940063,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\洞玄灵宝真灵位业图.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 17,
      "original_text": "庞德。 字令明。 爰榆。 字世都。 李广。 汉将。 王嘉。 解结。 字叔运。 何晏。 字平叔。 殷浩字渊源。 四明公北斗君，各有侍帝晨五人。 未显姓名。 河北侯二人： 刘备。 字玄德。 韩遂。 右此职统属仙官。 右位 中厩直事四人，如世尚书。 戴渊。 字若思，晋骠骑。 公孙度。 字叔济，王辽束。 郭嘉。 刘封。 备养子。 北帝南门亭长二人： 部鉴。 周抚。 字道和，代郄鉴。 北天修门郎二人： 虞讳。 纪瞻。 修门郎八人。 北斗君门亦有此职，姓名并未显。 北斗君天门亭长二人： 臧洪。 字子源。 王放。 晋中书郎。 期门郎王允之。 王敦堂弟。 谢凤。 典柄侯范明。 周鲂。 字子鱼，主察试。 北帝执盖郎顾和。 字君孝，晋吏部尚书。 部鬼将军王庾。 字世将，晋时荆州刺史。 杀鬼地映日游。 三鬼，北帝常使杀人，无姓名。 西门郎十六人。 未显。 主天下房庙血食之鬼，亦应隶四明公。 主非使者严白虎。 吴时人，为孙策所杀。 南弹方侯许副，领威南兵千人。 已度九宫，未委谁代。 主南门钥司马留赞。 长山人，为吴将。 北弹方侯鲍勋，领威北兵千人。 字叔业，魏中丞。 主北门钥司马韦遵。 吴时众孙备门，主收执，如世羽林监。 西河侯陶侃。 字士行，亦领兵数千。 长史。",
      "translated_text": "Pang De. Style name Lingming.\nYuan Yu. Style name Shidu.\nLi Guang. Han general.\nWang Jia.\nXie Jie. Style name Shuyun.\nHe Yan. Style name Pingshu.\nYin Hao. Style name Yuanyuan.\n\nThe Four Bright Lords and the Northern Dipper Lord each have five Attendants of the Morning Audience. Names not yet revealed.\n\nTwo Marquises of the Hebei Region:\nLiu Bei. Style name Xuande.\nHan Sui.\n\nThe above offices are under the jurisdiction of the Immortal Officials.\n\nFour Attendants of the Central Stable, rank equivalent to Regular Court Ministers:\nDai Yuan. Style name Ruosi, Jin’s General of the Swift Cavalry.\nGongsun Du. Style name Shuji, King of Liaodong.\nGuo Jia.\nLiu Feng. Adopted son of Liu Bei.\n\nTwo Northern Emperor Southern Gate Wardens:\nBu Jian.\nZhou Fu. Style name Daohe, succeeded Xi Jian.\n\nTwo Northern Heaven Repair Gate Gentlemen:\nYu Hui.\nJi Zhan.\n\nEight Repair Gate Gentlemen. The Northern Dipper Lord’s Gate also has this office, names not yet revealed.\n\nTwo Northern Dipper Lord Heaven Gate Wardens:\nZang Hong. Style name Ziyuan.\nWang Fang. Jin’s Palace Secretary.\n\nExpectant Gentleman of the Gate Wang Yunzhi. Younger cousin of Wang Dun.\nXie Feng.\nDianbing Marquis Fan Ming.\nZhou Fang. Style name Ziyu, overseer of examinations.\n\nNorthern Emperor Umbrella-Bearer Gentleman Gu He. Style name Junxiao, Jin’s Minister of Personnel.\nCommander of the Department of Ghosts General Wang Yu. Style name Shijiang, Jin’s Inspector of Jingzhou.\nKilling Ghosts of the Earth Reflecting Sunlight. Three ghosts, regularly dispatched by the Northern Emperor to kill, names unknown.\n\nSixteen Western Gate Gentlemen. Names not yet revealed. Overseers of the ghosts receiving blood sacrifices in the temples and ancestral halls throughout the world, also under the jurisdiction of the Four Bright Lords.\n\nMaster of Unauthorized Envoys Yan Baihu. A man of Wu, killed by Sun Ce.\nSouthern Garrison Marquis Xu Fu, commanding a thousand Southern Might troops. Having ascended through the Nine Palaces, no successor has yet been appointed.\nMaster of the Southern Gate Key Sima Liu Zan. A man of Changshan, served as a Wu general.\nNorthern Garrison Marquis Bao Xun, commanding a thousand Northern Might troops. Style name Shuye, Wei’s Palace Aide to the Censor-in-Chief.\nMaster of the Northern Gate Key Sima Wei Zun. Among the many gatekeepers of Wu’s Sun clan, overseer of arrests, rank equivalent to the Regular Feathered Forest Commandant.\nWestern River Marquis Tao Kan. Style name Shixing, also commanding several thousand troops.\n\nChief Clerk.",
      "overlap_context": "u as his chief aide, but declined. Later, Central Guard Grand General Kong Wenju. Personal name Rong.\n\nChief Clerk: Tang Zhou. Served as a Minister of Wu.\n\nSima Zhang Xiu. General of the Later Han.\n\nMarquis Overseer of the Eastern Sea: Wen Tairen. Rank equivalent to Grand General.\n\nChief Clerk: Du Yu. Jin’s General of Southern Campaigns, rank equivalent to Left Mentor.\n\nEight Northern Emperor Attendants of the Morning Audience, rank equivalent to Attendant-in-Ordinary:\nXu Shu. Style name Wenzhi.",
      "start_char": 8772,
      "end_char": 9349,
      "start_sentence": 960,
      "end_sentence": 1029,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.62900996208191,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\洞玄灵宝真灵位业图.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 18,
      "original_text": "先用徐宁，被弹，今用蔡谟，字道明，晋司徒。 庐山侯魏钊。 会稽人也。 南山伯蒋济。 字子通，魏太尉。 此三任各有封掌。 泰山君荀顗。 字景倩。 将军顾众。 字长始，晋丹阳尹，仆射。 长史桓范。 字元则。 司马曹洪。 魏武帝操弟，字子廉。 又云先用贾谊，前汉人。 卢龙公曹仁。 字子孝，魏武帝弟，位大将军。 长史司马。 未显。 南巴侯何曾。 字颖孝，魏司徒。 东越大将军刘陶。 字子寄，后魏人。 右号为四镇，各领鬼兵万人，各有长马，复有小镇数百，各领鬼兵数千人。 楚严公。 即楚庄王熊斋",
      "translated_text": "First employed Xu Ning, who was impeached. Now employs Cai Mo, style name Daoming, Jin’s Minister over the Masses.\nLushan Marquis Wei Zhao, a man of Kuaiji.\nNanshan Earl Jiang Ji, style name Zitong, Wei’s Grand Commandant.\nThese three appointments each hold seals and authority.\n\nMount Tai Lord Xun Yi, style name Jingqian.\nGeneral Gu Zhong, style name Changshi, Jin’s Governor of Danyang and Household Counsellor.\nChief Clerk Huan Fan, style name Yuanze.\nMarshal Cao Hong, younger brother of Emperor Wu of Wei Cao Cao, style name Zilian.\nIt is also said that Jia Yi, a man of Former Han, was first employed.\n\nLu Long Duke Cao Ren, style name Zixiao, younger brother of Emperor Wu of Wei, held the position of Grand General.\nChief Clerk Marshal—rank not yet made manifest.\n\nNanba Marquis He Zeng, style name Yingxiao, Wei’s Minister over the Masses.\nEast Yue Grand General Liu Tao, style name Ziji, a man of Later Wei.\nThe right is designated as the Four Garrisons, each commanding ten thousand ghost troops, each with a chief steed. Additionally, there are several hundred lesser garrisons, each commanding several thousand ghost troops.\n\nChu Yan Duke—namely, King Zhuang of Chu, Xiong Zai.",
      "overlap_context": "of the Southern Gate Key Sima Liu Zan. A man of Changshan, served as a Wu general.\nNorthern Garrison Marquis Bao Xun, commanding a thousand Northern Might troops. Style name Shuye, Wei’s Palace Aide to the Censor-in-Chief.\nMaster of the Northern Gate Key Sima Wei Zun. Among the many gatekeepers of Wu’s Sun clan, overseer of arrests, rank equivalent to the Regular Feathered Forest Commandant.\nWestern River Marquis Tao Kan. Style name Shixing, also commanding several thousand troops.\n\nChief Clerk.",
      "start_char": 9349,
      "end_char": 9606,
      "start_sentence": 1030,
      "end_sentence": 1055,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.692108869552612,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\洞玄灵宝真灵位业图.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 19,
      "original_text": "赵简子。 此二人先未有职，今方受任。 项梁成。 作酆都宫颂者。 杜琼。 蜀人。 马融。 刘庆孙。 与贾谊争名誉。 王逸少。 邓攸。 此六人位未显。 右鬼官，见有七十五职，名显者凡一百一十九人。 洞玄灵宝真灵位业图竟 #1本篇应为洞真上清部经书。 《正统道藏》题作洞玄灵宝，有误。",
      "translated_text": "Duke Jian of Zhao. These two individuals previously held no office and have only now received appointments.\n\nXiang Liangcheng. Author of the *Hymn to the Fengdu Palace*.\n\nDu Qiong, a man of Shu.\n\nMa Rong.\n\nLiu Qingsun, who vied with Jia Yi for renown.\n\nWang Yishao.\n\nDeng You.\n\nThese six individuals’ ranks have not yet been made manifest.\n\nThe ghost officials on the right number seventy-five offices in all, with one hundred nineteen persons of renowned name.\n\n*The Chart of Ranks and Duties of the Perfected and Numinous Treasure of the Cavernous Mystery* concludes.\n\n#1 This text should belong to the *Scriptures of the Upper Clarity of the Cavernous Perfection* section. The *Daoist Canon of the Zhengtong Era* mistakenly classifies it under *Cavernous Mystery and Numinous Treasure*.",
      "overlap_context": "ld the position of Grand General.\nChief Clerk Marshal—rank not yet made manifest.\n\nNanba Marquis He Zeng, style name Yingxiao, Wei’s Minister over the Masses.\nEast Yue Grand General Liu Tao, style name Ziji, a man of Later Wei.\nThe right is designated as the Four Garrisons, each commanding ten thousand ghost troops, each with a chief steed. Additionally, there are several hundred lesser garrisons, each commanding several thousand ghost troops.\n\nChu Yan Duke—namely, King Zhuang of Chu, Xiong Zai.",
      "start_char": 9606,
      "end_char": 9759,
      "start_sentence": 1056,
      "end_sentence": 1071,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 5.205192565917969,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\洞玄灵宝真灵位业图.txt",
        "category": "谱箓类"
      }
    }
  ]
}