{
  "source_id": "洞真太上神虎隐文",
  "source_file": "chunked_daozang\\洞真太上神虎隐文.json",
  "total_chunks": 2,
  "total_original_chars": 2304,
  "total_translated_chars": 15792,
  "total_translation_time": 85.6267716884613,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\洞真太上神虎隐文.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Hidden Writ of the Divine Tiger of the Supreme Cavern-Realms**\n\n**Title:** *The Hidden Writ of the Divine Tiger of the Supreme Cavern-Realms*\n**Author:** Unknown; approximately dated to the late Eastern Jin period.\nA liturgical hymn to be used in conjunction with the *Golden Tiger* and *Divine Tiger* talismans. One fascicle.\n**Source Text:** *Daoist Canon of the Orthodox Tradition*, Proper Section I.\n\n---\n\nThe Hidden Writ of the Divine Tiger of the Supreme Cavern-Realms\n\nThe Supreme Lord of the Great Dao strummed the *Jinglong Yun’ao*, its celestial tones cascading in myriad echoes, resplendent and surging, purple mists swirling in shadow, the eightfold winds of the Mysterious Dao arising. Thereupon, the Jade Phoenix stretched its neck, the Golden Simurgh composed its *qi*, dragons intoned over sapphire waves, tigers leapt upon the Jasper Isle, ninefold roars harmonized, the Mysterious Chime pervaded the Cavern-Heavens. Subdued beasts bared their claws, fierce steeds opened their throats, the *Huo* peaks loomed vast, swords in maw to seize the perverse. A tumult of voices arose, a hundred apes shrieking in demonic frenzy.\n\nThen the Supreme Lord commanded the handmaidens of the Jade Clarity Upper Palace—An Faying, Tian Sifei, Zhao Dingzhu, and Li Yunmen—to join in singing the divine hymn that dispels spectral essences and scatters demonic spirits. Their verses proclaimed:\n\n> Once we rode the reins of Great Radiance,\n> Eightfold floating to the Cloud Encampment.\n> The divine lineage ordered the numinous heart,\n> Dragon brushes adorned the Jade Capital.\n> Golden Gates wove luxuriant splendor,\n> Nine Chambers gleamed with purple jasper.\n> Lofty chariots traversed the Northern Origin,\n> Whispering into the realm of No-Birth.\n> Crimson Tigers guided the spirit-master,\n> Green axles ascended to Supreme Clarity.\n> The Four Mysteries illumined the morning taboo,\n> Embracing blossoms to return to Phoenix City.\n> Seven trials still bound to karmic ties,\n> Yet we aspired to the Ninefold Primal Crossroads.\n> Proclaiming the radiance of the Treasured Great Brilliance,\n> Swift winds leapt, scattering luminous hues.\n> We arrayed and controlled the Pristine Homeland,\n> River spirits advanced as vanguard.\n> Yin clouds girded the night-sun,\n> Torch-moon suddenly met in first exchange.\n> Binding clarity to birth the Crimson Spirit,\n> Hand in hand we returned to Nothingness.\n> Myriad sources poured into the Northern Vale,\n> Riding the void to follow the shooting stars.\n> Extinguishing light to pluck the floating wanderer,\n> Towering peaks soared in celestial waves.\n> Entwined in the abode of joyous music,\n> Subtle wonders emerged toward the empty.\n> The Leisurely Mansion cradled the Cinnabar Mystery-Pearl,\n> The Great Void’s Dao flowed unimpeded.\n> Dark and bright wielded the numinous tally,\n> How could hidden reckoning stray or fail?\n> Falling Mystery revealed the assembly of multitudes,\n> Birth’s beginning seemed a long dream.\n> Virtue concealed its traces within the Void,\n> Utmost stillness unknowingly arrived.\n> Spirit-essence responded to the Great Simplicity,\n> Misty reflections dwelt wherever it went.\n> Mysterious echoes resounded beyond form,\n> How could twilight branches raise doubt?\n> Harmonizing dawn’s drum with the long fan,\n> Radiant clouds arose here and now.\n> Cutting through the abyss, the profound current flowed,\n> Soaring wings reached the Sixfold Terrace.\n> The Divine King entered Jade Clarity,\n> Utmost Nothingness overcame the Crimson Host.\n> Ninefold Nets met in the distant obscure,\n> The wondrous assembly was already at peace.\n> The Dao treasury’s Golden Ultimate Chapter,\n> Strummed and tuned to blazing cypress splendor.\n> A thousand dragons spewed green waters,\n> Nine Rivers poured in inverse torrents.\n> Vast mists seized the remote abode,\n> Numinous waves filled the Four-Canopied Court.\n> Heads aligned beneath towering silken eaves,\n> None sought to examine form or name.\n> Leading and uplifting, embracing harmony’s bloom,\n> Releasing the Mysterious to grasp the principles of transformation.\n> Containing essence, illuminating cloud-chambers,\n> Whispering winds purified the desolate records.\n> The numinous Dao hastened to the Orchid Palace,\n> The Profoundest Profound—how could it be arrayed?\n> Myriad peaks lay in wondrous view,\n> Above the clouds dwelt the Jasper Child.\n> Through kalpas harmonizing with Jade Blossoms,\n> Unaware, the day’s beginning had come.\n> Primal spirits aligned with Cavern-Transformation,\n> Sinking and concealing, forgetting fixed signs.\n> River Lords bound the Upper Observatory,\n> Luminous pearls adorned the Jasper Court.\n> Ordering the Origin beyond the Three Numinous,\n> How could congealing clarity suffer loss or gain?\n> The Great Yang intermingled with layered Yin,\n> Turning and sweeping to preserve the fallen obscure.\n> Fully entrusted beyond the Six Perceptions,\n> Numinous chants resounded as one.\n> The turning mechanism of the Jade Han Dao,\n> Resplendent, stirred the blossoming jasper.\n> Myriad spirits mounted crimson steeds,\n> A thousand demons found no leisure to arise.\n> Demonic forces of water and fire perished,\n> The true self preserved Supreme Purity.\n> The Four Lifespans of Northern *A*,\n> Ordered spirits and steadied reins.\n> Summoning Earth’s deities,\n> Earth’s essences concealed their *qi*.\n> Mountains and peaks hid their clouds,\n> Nine Sources were cut off and extinguished.\n> Pushing and examining a thousand spirits,\n> Seizing captives amid thunderous quaking.\n> The Northern Emperor opened the Dao,\n> Four Illuminations offered their axles.\n> Shattering myriad perversities,\n> Carving and severing Feng Mountain.\n> Nine ghosts shared a single head,\n> A thousand demons merged into one body.\n> Five Emperors wielded halberds,\n> Divine Lords exhaled mist.\n> Purple clarity rose in majestic observation,\n> Crimson *qi* coiled in layered strands.\n> Spirits fled to the Night Terrace,\n> Essences concealed in eternal continuity.\n> Venomous beasts of ten thousand feet,\n> Slaughtered without kinship.\n> What petty demon,\n> Gathering in hundreds or thousands,\n> Could exchange *qi* and gaze in unison,\n> Standing before the Gate of Human Life?\n> The Divine Tiger unleashed its might,\n> Slashing and tearing, decapitating and maiming.\n> The wondrous Dao of the Supreme Origin,\n> The utmost numinous selects its own.\n> Now you receive it,\n> Wear it forever upon your person.\n> Tested ten thousand times, it remains unchallenged,\n> A thousand demons dare not approach.\n> Jade Blossoms enter your chamber,\n> Heavenly Perfected wander in cycles.\n> Chanting the luminous numinous tones,\n> Ascend to pay homage to the Three Origins.\n\nWhen the hymn concluded, the Supreme Lord of the Great Dao commanded Yu Lixuan, the Jade Gentleman of the Left Mystery, to take up the Golden Feathered Staff and summon the Heavenly Emperor of the Supreme Tenuity. The Heavenly Emperor of the Supreme Tenuity condensed his refined *qi*, wielding true flourishing emptiness. With a roar, he summoned the myriad spirits, embracing the primordial origin. In his hand he held the Golden Real, his gaze serene upon the Great Nothingness. Suddenly hearing the command, he hastened to mount his chariot. Feathered spirits and Crimson Sovereigns opened the Daoist procession, celestial soldiers and ten thousand tigers drove forth golden dragons. Jade batons led the troops, casting radiant blossoms into flight. They entered the dark, streaming with torchlight, their resplendent ranks advancing. The Solar Essence struck the azure drums beside the waves, the jasper bells rang out in resonant peals.\n\nThereupon, the Mysterious Chime harmonized, the grand music fell silent. Nine Phoenixes stretched their necks and cried in unison, a hundred dragons held the pitch-pipes and exhaled as one. Golden essences leapt in melody, entering the simurghs’ soaring dance. Purple banners rose into the heavens, brocade pennants wound through the fields. Green canopies arrayed in shade, the winding dawn suddenly arose. Flowing bells tossed in exchange, moonlight pierced the echoes. Jasper staffs displayed the true, revolving in the Five Images. Fragrant flowers scattered in mist, blossoms of the Three Luminants. Light clouds received the radiance, thin auroras girded the light. Sevenfold reins chimed, eight chariots floated in the void. Nine thousand empty carriages were guarded by venomous dragons. Racing clouds hastened to the Mysterious, gathering *qi* to seize the winds. The heavens brightened, eightfold lights enveloped all. True maidens rode to the right, numinous youths were commanded to the left. In a flash, a thousand myriad arrived at the Upper Palace, halting their chariots in Jade Clarity. Rising from the Imperial Ramparts, they turned their steps toward the Purple Gates, bowing their heads in reverence to await audience.\n\nAfter a long while, the Great Dao of the Grand Centrality commanded the Four Ministers of the Dawn Attendant to slowly lead them forward, ascending the gates of the Jeweled Blossom and entering the inner chambers of the Sevenfold Radiance. The Heavenly Emperor of the Grand Tenuity announced his name, saying: \"Your humble servant has now arrived. I request the revelation of the Great Mandate.\"\n\nThe Most High Lord of the Great Dao declared: \"Li Shanyuan’s virtue aligns with the Seven Sages, and he shall be the master of the Golden Towers. Soon, he will pay homage to the Ten Heavens, govern the destinies of the myriad beings, determine the Middle Prime within the Mysterious Mechanism, and regulate yin and yang to unify all. He shall extract the true and elevate the leaders, seal the rivers and summon the seas, sever the threads of life and death, and grasp the awe of heaven. He will decapitate the Six Heavens, command the punishments of the Three Bureaus, and enforce the judgments of the Northern Emperor.\n\n\"Noble sir, you stand by the imperial chariot—your Dao is lofty, your virtue vast and far-reaching, your responsibilities weighty, your authority commensurate. You have been instructed in wisdom, and further, your memory has been fortified against demonic forces. Wisdom can drive away spirits, and the dispelling of demons can eradicate evil. Now, I bestow upon you the True Talisman of the Divine Tiger, that you may wield its might to decapitate the Six Heavens. I chant for you the Lofty Chapter of Divine Command to assist in dispersing filth and banishing calamities.\n\n\"Moreover, the Heavenly Emperor of the Grand Tenuity treasures the True Talisman of the Golden Tiger, which governs the spirits of heaven and earth. When commanded, it can shatter and slay a thousand spirits; when worn, it causes ten thousand ghosts to vanish. Any demon that dares to invade will perish, and every malevolent entity that gazes upon it will be plunged into darkness. Thus, it may be entrusted to Shanyuan to fulfill his duties.\"\n\nThereupon, the Heavenly Emperor of the Grand Tenuity bowed in reverence and opened his cloud-bound scripture case, revealing a jade casket. Sevenfold light illuminated the silk, and streaming sunlight unveiled the truth. Ninefold radiance paused in splendor as fragrant incense intertwined. Before the talisman was bestowed, the Heavenly Emperor personally commanded the attendant maidens of the Grand Tenuity—Jilin Hua, Yancai Yun, Zhutiao Yan, and Han Fangyao—to join in singing the *Poem of the Golden True* and the *Melody of Pacing the Void*. The lyrics were as follows:\n\nThe Great Darkness severs the Four Mysteries,\nThe cavernous light entrusts divine communion.\nJade terraces unfold in crimson auroras,\nGreen mists cradle golden ramparts.\nAbove, one draws from the cloud-pearl collar,\nGazing up to receive the peak without blade.\nThe numinous mirror dreads the purple halls,\nVermilion radiance fills the empty midst.\nMysterious transformations entwine the dark root,\nGrasping the tally and leading the purple youths.\nThe round path knows no stagnation,\nLuminous mists layer upon layer.\nTo the south, the vermilion mounds’ gates swing open,\nTo the west, one crosses the jagged casement.\nThe body soars over ten thousand waves,\nThe spirit arises to gather the ten directions.\nThe dark returns to the silent axle,\nAscending to ride the celestial dragon.\nThe dark chariot of flying light,\nBrandishing bells, roams the Seven Paths.\nLight ripples drift upon cloud-dust fords,\nIn an instant, they arrive at the Jade Land.\nTo the left, the Jade Radiance consort is summoned,\nTo the right, the Golden True husband is commanded.\nAbove, they meet the awakening of flying auroras,\nBelow, they receive the numinous and wondrous domains.\nThey weave through the vast halls of Guanghan,\nUnfurling brocade to enter the divine mounds.\nPhoenix brains secure the kalpas’ span,\nBlossom nectar restores fading splendor.\nThe Most High truly abounds in longevity,\nCommanding the myriad tiers of the cosmos.\nThe Three Awakenings uphold the dark reckoning,\nJoy unfurls in radiant spirals.\nThe tempest’s brilliance halts the wave-flowers;\nWhy do the purple cassia trees sway so?\nJade fruits chime in the ninefold heavens,\nJade staves march toward the Grand Tenuity.\nThe yellow writ restrains the blade of virtue—\nHow could it harm the radiance of the perfected?\nDiscarding the plain to enter formlessness,\nThe hundred images all begin to fade.\nThe yang essence of cinnabar qi sharpens,\nResplendent crimson clouds take flight.\nIn harmony with the stillness of Jade Radiance,\nDazzling light hangs over the Upper Clarity’s borders.\nSpirits respond to the dark reckoning,\nFollowing resonance to summon the world’s omens.\nVast ford-waves surge in lush profusion,\nJoining light to partake in the countenance’s lineage.\nO towering child of the Golden Towers,\nDesolate, you enter the numinous verge.\nLooking up and down, the myriad changes shift—\nTo comply is to unite in spirit.\nThe dark perches upon the Silent Terrace,\nPure chanting of wisdom and insight.\nDispelling demons to diminish ten thousand blades,\nWaving the poem to expel filth.\nThe Golden Tiger bears heaven’s might,\nCrushing spirits to conceal their qi.\nSweeping away a thousand myriad demons,\nTen thousand leagues of celestial evil reduced to dust.\n\nAt this, the great spirit,\nSevers the blood of a hundred spirits,\nBlinds the eyes of the Golden Tiger,\nUnleashes its mane to spew might,\nReleases venom to cast out ghosts,\nUnrelenting in its cross-cutting,\nRipping open the bellies of the Six Heavens,\nUniting the heads of the divine spirits,\nForcing birds and beasts to cower,\nHiding their cries in forests and grasses,\nProstrating before the Great Origin.\n\nThe wondrous and transcendent numinous script,\nDark and profound, is worn upon the body,\nAnd thus one may proceed to pay court to the Jade Emperor,\nOffering rites in the inner chambers,\nAs the assembled perfected ones arrive at their abodes.\n\nShould the Divine Tiger script be leaked,\nCalamity will befall the Nine Clans.\nShould the True Talisman of the Golden Tiger be divulged,\nDisaster will reach the Seven Ancestors.\nShanyuan, guard it well—you are the flower of Dao and virtue.\n\nAt night, if fear arises,\nSimply chant these two poems,\nAnd a thousand spirits will scatter and hide,\nAs if ten thousand men shared your lodging.\nWhen mountains and rivers hear this chant,\nThey will wield whips toward the sound and bow in reverence.\n\nThe latter poem was transcribed by the Ninth Radiance Peaceful Consort.\nOn the sixth day of the eleventh month, at the fifth watch before dawn,\nThe Purple Clarity Ninth Radiance Peaceful Consort came to bestow it,\nCommanding that it be written before daybreak.\nIt is recorded in the *Scroll of the Most High’s Eight Arts: Wisdom, Demon-Dispelling, Divine Tiger, and Hidden Script*.\nHere ends the *Hidden Script of the Most High’s Divine Tiger of the Cavernous True*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞真太上神虎隐文 经名：洞真太上神虎隐文。 撰人不详； 约出於东晋南期。 是与《金虎》、《神虎》二符合用之颂章。 一卷。 底本出处：《正统道藏》正一部。 洞真太上神虎隐文 太上大道君，爰乃自弹景龙云璈，霄音千逸，万响缠激，流徽郁勃，紫蔼回阴，玄风八发。 於是玉凤延颈，金鸾整炁，龙吟碧波，虎跃琼州，九啸和唱，玄钧洞天，伏兽攘袂，猛马张喉，猲岳横，衔剑摄邪，众声纷乱，百玃妖尔。 乃命玉清上宫侍女，安法婴、田四非、赵定珠、李云门，合歌挥神之诗，灭精散灵之曲，其辞曰： 昔泛太霞辔，八浮造云营。 神宗理灵襟，龙翰秀玉京。 金门缠蔚裕，九房朗紫琼。 高驾涉北元，萧萧入无生。 朱虎导灵师，绿辕登上清。 四玄明朝禁，抱华还凤城。 七难尚梵缘，拟标九元衢。 宣曜宝太晖，飙眇跃景敷。 整控启素乡，河灵已前驱。 阴云带夜日，烛月欻交初。 结朗朱生神，携领同反无。 万源写北谷，乘空归流星。 灭景擢浮游，峨峰自霄浪。 缠绵嘉乐宿，妙微挺虚向。 逸宅丹玄珠，太空道亦畅。 幽明秉灵符，暗推岂乖丧。 落玄表群会，生始似久梦。 德隐冲内迹，至寂不觉当。 神精感太素，烟映在所之。 玄响奏象外，幽条焉能疑。 协晨鼓长扇，晖霞生在兹。 绝洞溟溟流，翔翅六领台。 神王入玉虚，至无侵朱兵。 九罗遘幽辽，妙会亦已平。 道藏金极章，弹调赫栢荣。 千龙吐绿水，九河倒竭倾。 洪蔼摄绝宅，灵浪四盖庭。 齐首峻缯宇，莫检形与名。 领拔纳和秀，纵玄执化理。 含精灼云房，萧伻清零纪。 灵道趣兰阙，玄玄那排起。 万峰坦奇观，云上有琼子。 终劫协玉华，靡觉方日始。 原神齐洞化，沦伏忘定征。 河侯结上观，景珠玮琳庭。 理元三灵表，凝澄岂亏盈。 太阳交重阴，回拂存落冥。 全任六觉外，灵唱齐一声。 运机璇汉道，焕焕动华琼。 万神腾朱马，千魔无暇生。 妖灭水火官，真躬保太贞。 四命北阿，理神定辔，呼召地祇，土精匿炁，山岳藏云，九源绝灭，推校千精，执馘雷震，北帝启道，四明奉辕，摧烂万邪，勒割酆山，九鬼共首，千魔同身，五帝秉钺，神公吐烟，紫朗竦观，朱炁累缠，灵走夜台，精藏长绵，毒兽万尺，所屠无亲，有何小妖，聚百累千，交炁齐瞻，当人生门，神虎纵威，斩攫枭残，太元奇道，至灵所甄，子今受之，永以佩身，万试不校，千妖不干，玉华诣房，天真游旋，讽明灵音，上朝三元。 歌毕，於是太上大道君，乃命左玄玉郎郁利玄，执金羽节，召太微天帝君。 太微天帝君凝化精炁，操真荣虚，啸咤万神，拥罗本初，手执金真，淡盻太无，忽闻命卒，行登勑驾，羽灵朱皇，启道辇甲，天丁万虎，驱除金龙，御兵玉节，投景飞华，入冥流烛，焕阵行启，日精打碧鼓之旁浪，扣琼钟之砰砰。 於是玄钧合和，广乐遏后，九凤延颈而啸啸，百龙衔律而同呴，金精踊音，入鸾翔舞，紫旗建霄，锦旄绕野，绿盖列荫，曲晨欻举，流铃交掷，月明彻响，琼竿表真，回渟五象，香花散烟，芬葩三景，轻霄纳晖，薄霞带光，鸣辔七道，八舆浮空，虚辇九千，卫以毒龙，走云赴玄，聚炁摄风，天明蓊溃，八光蒙笼，真女右骑，左命灵童，鲦欻千亿，已到上宫，停驾玉清，身起帝墉，回步紫阙，稽首待通。",
      "translated_text": "**The Hidden Writ of the Divine Tiger of the Supreme Cavern-Realms**\n\n**Title:** *The Hidden Writ of the Divine Tiger of the Supreme Cavern-Realms*\n**Author:** Unknown; approximately dated to the late Eastern Jin period.\nA liturgical hymn to be used in conjunction with the *Golden Tiger* and *Divine Tiger* talismans. One fascicle.\n**Source Text:** *Daoist Canon of the Orthodox Tradition*, Proper Section I.\n\n---\n\nThe Hidden Writ of the Divine Tiger of the Supreme Cavern-Realms\n\nThe Supreme Lord of the Great Dao strummed the *Jinglong Yun’ao*, its celestial tones cascading in myriad echoes, resplendent and surging, purple mists swirling in shadow, the eightfold winds of the Mysterious Dao arising. Thereupon, the Jade Phoenix stretched its neck, the Golden Simurgh composed its *qi*, dragons intoned over sapphire waves, tigers leapt upon the Jasper Isle, ninefold roars harmonized, the Mysterious Chime pervaded the Cavern-Heavens. Subdued beasts bared their claws, fierce steeds opened their throats, the *Huo* peaks loomed vast, swords in maw to seize the perverse. A tumult of voices arose, a hundred apes shrieking in demonic frenzy.\n\nThen the Supreme Lord commanded the handmaidens of the Jade Clarity Upper Palace—An Faying, Tian Sifei, Zhao Dingzhu, and Li Yunmen—to join in singing the divine hymn that dispels spectral essences and scatters demonic spirits. Their verses proclaimed:\n\n> Once we rode the reins of Great Radiance,\n> Eightfold floating to the Cloud Encampment.\n> The divine lineage ordered the numinous heart,\n> Dragon brushes adorned the Jade Capital.\n> Golden Gates wove luxuriant splendor,\n> Nine Chambers gleamed with purple jasper.\n> Lofty chariots traversed the Northern Origin,\n> Whispering into the realm of No-Birth.\n> Crimson Tigers guided the spirit-master,\n> Green axles ascended to Supreme Clarity.\n> The Four Mysteries illumined the morning taboo,\n> Embracing blossoms to return to Phoenix City.\n> Seven trials still bound to karmic ties,\n> Yet we aspired to the Ninefold Primal Crossroads.\n> Proclaiming the radiance of the Treasured Great Brilliance,\n> Swift winds leapt, scattering luminous hues.\n> We arrayed and controlled the Pristine Homeland,\n> River spirits advanced as vanguard.\n> Yin clouds girded the night-sun,\n> Torch-moon suddenly met in first exchange.\n> Binding clarity to birth the Crimson Spirit,\n> Hand in hand we returned to Nothingness.\n> Myriad sources poured into the Northern Vale,\n> Riding the void to follow the shooting stars.\n> Extinguishing light to pluck the floating wanderer,\n> Towering peaks soared in celestial waves.\n> Entwined in the abode of joyous music,\n> Subtle wonders emerged toward the empty.\n> The Leisurely Mansion cradled the Cinnabar Mystery-Pearl,\n> The Great Void’s Dao flowed unimpeded.\n> Dark and bright wielded the numinous tally,\n> How could hidden reckoning stray or fail?\n> Falling Mystery revealed the assembly of multitudes,\n> Birth’s beginning seemed a long dream.\n> Virtue concealed its traces within the Void,\n> Utmost stillness unknowingly arrived.\n> Spirit-essence responded to the Great Simplicity,\n> Misty reflections dwelt wherever it went.\n> Mysterious echoes resounded beyond form,\n> How could twilight branches raise doubt?\n> Harmonizing dawn’s drum with the long fan,\n> Radiant clouds arose here and now.\n> Cutting through the abyss, the profound current flowed,\n> Soaring wings reached the Sixfold Terrace.\n> The Divine King entered Jade Clarity,\n> Utmost Nothingness overcame the Crimson Host.\n> Ninefold Nets met in the distant obscure,\n> The wondrous assembly was already at peace.\n> The Dao treasury’s Golden Ultimate Chapter,\n> Strummed and tuned to blazing cypress splendor.\n> A thousand dragons spewed green waters,\n> Nine Rivers poured in inverse torrents.\n> Vast mists seized the remote abode,\n> Numinous waves filled the Four-Canopied Court.\n> Heads aligned beneath towering silken eaves,\n> None sought to examine form or name.\n> Leading and uplifting, embracing harmony’s bloom,\n> Releasing the Mysterious to grasp the principles of transformation.\n> Containing essence, illuminating cloud-chambers,\n> Whispering winds purified the desolate records.\n> The numinous Dao hastened to the Orchid Palace,\n> The Profoundest Profound—how could it be arrayed?\n> Myriad peaks lay in wondrous view,\n> Above the clouds dwelt the Jasper Child.\n> Through kalpas harmonizing with Jade Blossoms,\n> Unaware, the day’s beginning had come.\n> Primal spirits aligned with Cavern-Transformation,\n> Sinking and concealing, forgetting fixed signs.\n> River Lords bound the Upper Observatory,\n> Luminous pearls adorned the Jasper Court.\n> Ordering the Origin beyond the Three Numinous,\n> How could congealing clarity suffer loss or gain?\n> The Great Yang intermingled with layered Yin,\n> Turning and sweeping to preserve the fallen obscure.\n> Fully entrusted beyond the Six Perceptions,\n> Numinous chants resounded as one.\n> The turning mechanism of the Jade Han Dao,\n> Resplendent, stirred the blossoming jasper.\n> Myriad spirits mounted crimson steeds,\n> A thousand demons found no leisure to arise.\n> Demonic forces of water and fire perished,\n> The true self preserved Supreme Purity.\n> The Four Lifespans of Northern *A*,\n> Ordered spirits and steadied reins.\n> Summoning Earth’s deities,\n> Earth’s essences concealed their *qi*.\n> Mountains and peaks hid their clouds,\n> Nine Sources were cut off and extinguished.\n> Pushing and examining a thousand spirits,\n> Seizing captives amid thunderous quaking.\n> The Northern Emperor opened the Dao,\n> Four Illuminations offered their axles.\n> Shattering myriad perversities,\n> Carving and severing Feng Mountain.\n> Nine ghosts shared a single head,\n> A thousand demons merged into one body.\n> Five Emperors wielded halberds,\n> Divine Lords exhaled mist.\n> Purple clarity rose in majestic observation,\n> Crimson *qi* coiled in layered strands.\n> Spirits fled to the Night Terrace,\n> Essences concealed in eternal continuity.\n> Venomous beasts of ten thousand feet,\n> Slaughtered without kinship.\n> What petty demon,\n> Gathering in hundreds or thousands,\n> Could exchange *qi* and gaze in unison,\n> Standing before the Gate of Human Life?\n> The Divine Tiger unleashed its might,\n> Slashing and tearing, decapitating and maiming.\n> The wondrous Dao of the Supreme Origin,\n> The utmost numinous selects its own.\n> Now you receive it,\n> Wear it forever upon your person.\n> Tested ten thousand times, it remains unchallenged,\n> A thousand demons dare not approach.\n> Jade Blossoms enter your chamber,\n> Heavenly Perfected wander in cycles.\n> Chanting the luminous numinous tones,\n> Ascend to pay homage to the Three Origins.\n\nWhen the hymn concluded, the Supreme Lord of the Great Dao commanded Yu Lixuan, the Jade Gentleman of the Left Mystery, to take up the Golden Feathered Staff and summon the Heavenly Emperor of the Supreme Tenuity. The Heavenly Emperor of the Supreme Tenuity condensed his refined *qi*, wielding true flourishing emptiness. With a roar, he summoned the myriad spirits, embracing the primordial origin. In his hand he held the Golden Real, his gaze serene upon the Great Nothingness. Suddenly hearing the command, he hastened to mount his chariot. Feathered spirits and Crimson Sovereigns opened the Daoist procession, celestial soldiers and ten thousand tigers drove forth golden dragons. Jade batons led the troops, casting radiant blossoms into flight. They entered the dark, streaming with torchlight, their resplendent ranks advancing. The Solar Essence struck the azure drums beside the waves, the jasper bells rang out in resonant peals.\n\nThereupon, the Mysterious Chime harmonized, the grand music fell silent. Nine Phoenixes stretched their necks and cried in unison, a hundred dragons held the pitch-pipes and exhaled as one. Golden essences leapt in melody, entering the simurghs’ soaring dance. Purple banners rose into the heavens, brocade pennants wound through the fields. Green canopies arrayed in shade, the winding dawn suddenly arose. Flowing bells tossed in exchange, moonlight pierced the echoes. Jasper staffs displayed the true, revolving in the Five Images. Fragrant flowers scattered in mist, blossoms of the Three Luminants. Light clouds received the radiance, thin auroras girded the light. Sevenfold reins chimed, eight chariots floated in the void. Nine thousand empty carriages were guarded by venomous dragons. Racing clouds hastened to the Mysterious, gathering *qi* to seize the winds. The heavens brightened, eightfold lights enveloped all. True maidens rode to the right, numinous youths were commanded to the left. In a flash, a thousand myriad arrived at the Upper Palace, halting their chariots in Jade Clarity. Rising from the Imperial Ramparts, they turned their steps toward the Purple Gates, bowing their heads in reverence to await audience.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1295,
      "start_sentence": 0,
      "end_sentence": 55,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 48.63848066329956,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上神虎隐文.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "既至良久，太中大道勑命侍晨四臣，徐引以前，登蕊珠之闼，入七映内房。 太微天帝君称名曰：贱臣今到，请开大命矣。 太上大道君曰：李山渊德合七圣，为金阙之主，方当参谒十天，理命亿兆，定中元於玄机，制阴阳以齐首，拔真擢领，封河召海，断任死生，把执天威，馘灭六天，总罚三官，罚执北帝。 明公侍轩，道亦高标，德弘逸远，任亦重矣，掌亦侔也哉。 既己说之以智慧，又复记之以消魔，智慧可以驱神，消魔可以灭邪。 复授之以神虎真符，使威馘六天，咏之以挥神高章，亦助之散秽去患也。 且太微帝君所宝，有金虎真符，以制天地神灵，叱之以行，便得摧斩千精，佩之而往，则万鬼灭形，众魔妄侵而即死，群妖窥之而自冥，乃可俱授山渊，以成其任乎。 於是太微帝君唯唯稽首，乃解云笈，发琼函，七光映素，流日启真，九晖停曜，飞香交缠，执符未授，亲命太微侍女，纪林华、严彩云、朱条烟、韩放要等，合歌金真之诗，步虚之曲。 其辞曰： 太冥绝四玄，洞景寄神通。 玉台敷朱霄，绿霞有金墉。 上挹云珠领，仰授无刃峰。 灵镜惧紫馆，蔼朱晖中空。 冥化缠玄根，把节携紫童。 圆涂无凝漠，绮蔼复有重。 南排朱阜户，西踰豪缺窗。 体矫万津波，神生摄十方。 玄归反寂辕，上向乘天龙。 冥摅飞景舆，挥铃七道游。 轻浪云尘津，欻已造玉州。 左摄玉映妻，右命金真夫。 上接飞霄觉，俯授灵妙畴。 弥缠广寒宇，披锦入神丘。 凤脑固劫龄，蕊醴反华颓。 太上寔寿稔，制命万杪阶。 三觉承玄数，纵欢焕牙回。 飙粲停浪华； 紫桂何栖栖。 琳实鸣九霄，玉节征太微。 黄策遏德刃，岂干真人晖。 弃素入无质，百象始俱遗。 豁阳丹炁颖，烂粲绛云飞。 齐契玉映静，炫悬上清畿。 神灵应冥数，顺感招兆世。 洪津浪纷蔚，并景参容裔。 巍峨金阙子，萧条入灵际。 俯仰万兆变，将顺同精契。 玄栖绝寂台，清咏智与慧。 消魔减万锋，挥诗以逐秽。 金虎承天威，摧神以匿炁。 扫妖千万倾，万里天邪芥。 於焉大神，割血百精，丧目金虎，奋豪吐威，放毒投鬼，无间横截，刳腹六天，共首神灵，顿局乌兽，藏音林草，偃伏太元。 奇逸灵文，玄郁佩之，而进得以朝玉皇，礼之於寝，众真诣其房。 有泄於神虎文，祸遘於九宗，有漏於金虎真符，灾逮於七祖。 山渊藏之，道德之英矣。 夜中恐畏，但讽此二篇诗，则千精迸匿，如与万人同宿，山川闻此咏，皆执鞭向声处而拜敬也。 其后一篇诗，九华安妃书出。 十一月六臼一五鼓向晓，紫清九华安妃来授此，令书，未旦毕。 在太上八术智慧灭魔神虎隐文卷中。 洞真太上神虎隐文竟",
      "translated_text": "After a long while, the Great Dao of the Grand Centrality commanded the Four Ministers of the Dawn Attendant to slowly lead them forward, ascending the gates of the Jeweled Blossom and entering the inner chambers of the Sevenfold Radiance. The Heavenly Emperor of the Grand Tenuity announced his name, saying: \"Your humble servant has now arrived. I request the revelation of the Great Mandate.\"\n\nThe Most High Lord of the Great Dao declared: \"Li Shanyuan’s virtue aligns with the Seven Sages, and he shall be the master of the Golden Towers. Soon, he will pay homage to the Ten Heavens, govern the destinies of the myriad beings, determine the Middle Prime within the Mysterious Mechanism, and regulate yin and yang to unify all. He shall extract the true and elevate the leaders, seal the rivers and summon the seas, sever the threads of life and death, and grasp the awe of heaven. He will decapitate the Six Heavens, command the punishments of the Three Bureaus, and enforce the judgments of the Northern Emperor.\n\n\"Noble sir, you stand by the imperial chariot—your Dao is lofty, your virtue vast and far-reaching, your responsibilities weighty, your authority commensurate. You have been instructed in wisdom, and further, your memory has been fortified against demonic forces. Wisdom can drive away spirits, and the dispelling of demons can eradicate evil. Now, I bestow upon you the True Talisman of the Divine Tiger, that you may wield its might to decapitate the Six Heavens. I chant for you the Lofty Chapter of Divine Command to assist in dispersing filth and banishing calamities.\n\n\"Moreover, the Heavenly Emperor of the Grand Tenuity treasures the True Talisman of the Golden Tiger, which governs the spirits of heaven and earth. When commanded, it can shatter and slay a thousand spirits; when worn, it causes ten thousand ghosts to vanish. Any demon that dares to invade will perish, and every malevolent entity that gazes upon it will be plunged into darkness. Thus, it may be entrusted to Shanyuan to fulfill his duties.\"\n\nThereupon, the Heavenly Emperor of the Grand Tenuity bowed in reverence and opened his cloud-bound scripture case, revealing a jade casket. Sevenfold light illuminated the silk, and streaming sunlight unveiled the truth. Ninefold radiance paused in splendor as fragrant incense intertwined. Before the talisman was bestowed, the Heavenly Emperor personally commanded the attendant maidens of the Grand Tenuity—Jilin Hua, Yancai Yun, Zhutiao Yan, and Han Fangyao—to join in singing the *Poem of the Golden True* and the *Melody of Pacing the Void*. The lyrics were as follows:\n\nThe Great Darkness severs the Four Mysteries,\nThe cavernous light entrusts divine communion.\nJade terraces unfold in crimson auroras,\nGreen mists cradle golden ramparts.\nAbove, one draws from the cloud-pearl collar,\nGazing up to receive the peak without blade.\nThe numinous mirror dreads the purple halls,\nVermilion radiance fills the empty midst.\nMysterious transformations entwine the dark root,\nGrasping the tally and leading the purple youths.\nThe round path knows no stagnation,\nLuminous mists layer upon layer.\nTo the south, the vermilion mounds’ gates swing open,\nTo the west, one crosses the jagged casement.\nThe body soars over ten thousand waves,\nThe spirit arises to gather the ten directions.\nThe dark returns to the silent axle,\nAscending to ride the celestial dragon.\nThe dark chariot of flying light,\nBrandishing bells, roams the Seven Paths.\nLight ripples drift upon cloud-dust fords,\nIn an instant, they arrive at the Jade Land.\nTo the left, the Jade Radiance consort is summoned,\nTo the right, the Golden True husband is commanded.\nAbove, they meet the awakening of flying auroras,\nBelow, they receive the numinous and wondrous domains.\nThey weave through the vast halls of Guanghan,\nUnfurling brocade to enter the divine mounds.\nPhoenix brains secure the kalpas’ span,\nBlossom nectar restores fading splendor.\nThe Most High truly abounds in longevity,\nCommanding the myriad tiers of the cosmos.\nThe Three Awakenings uphold the dark reckoning,\nJoy unfurls in radiant spirals.\nThe tempest’s brilliance halts the wave-flowers;\nWhy do the purple cassia trees sway so?\nJade fruits chime in the ninefold heavens,\nJade staves march toward the Grand Tenuity.\nThe yellow writ restrains the blade of virtue—\nHow could it harm the radiance of the perfected?\nDiscarding the plain to enter formlessness,\nThe hundred images all begin to fade.\nThe yang essence of cinnabar qi sharpens,\nResplendent crimson clouds take flight.\nIn harmony with the stillness of Jade Radiance,\nDazzling light hangs over the Upper Clarity’s borders.\nSpirits respond to the dark reckoning,\nFollowing resonance to summon the world’s omens.\nVast ford-waves surge in lush profusion,\nJoining light to partake in the countenance’s lineage.\nO towering child of the Golden Towers,\nDesolate, you enter the numinous verge.\nLooking up and down, the myriad changes shift—\nTo comply is to unite in spirit.\nThe dark perches upon the Silent Terrace,\nPure chanting of wisdom and insight.\nDispelling demons to diminish ten thousand blades,\nWaving the poem to expel filth.\nThe Golden Tiger bears heaven’s might,\nCrushing spirits to conceal their qi.\nSweeping away a thousand myriad demons,\nTen thousand leagues of celestial evil reduced to dust.\n\nAt this, the great spirit,\nSevers the blood of a hundred spirits,\nBlinds the eyes of the Golden Tiger,\nUnleashes its mane to spew might,\nReleases venom to cast out ghosts,\nUnrelenting in its cross-cutting,\nRipping open the bellies of the Six Heavens,\nUniting the heads of the divine spirits,\nForcing birds and beasts to cower,\nHiding their cries in forests and grasses,\nProstrating before the Great Origin.\n\nThe wondrous and transcendent numinous script,\nDark and profound, is worn upon the body,\nAnd thus one may proceed to pay court to the Jade Emperor,\nOffering rites in the inner chambers,\nAs the assembled perfected ones arrive at their abodes.\n\nShould the Divine Tiger script be leaked,\nCalamity will befall the Nine Clans.\nShould the True Talisman of the Golden Tiger be divulged,\nDisaster will reach the Seven Ancestors.\nShanyuan, guard it well—you are the flower of Dao and virtue.\n\nAt night, if fear arises,\nSimply chant these two poems,\nAnd a thousand spirits will scatter and hide,\nAs if ten thousand men shared your lodging.\nWhen mountains and rivers hear this chant,\nThey will wield whips toward the sound and bow in reverence.\n\nThe latter poem was transcribed by the Ninth Radiance Peaceful Consort.\nOn the sixth day of the eleventh month, at the fifth watch before dawn,\nThe Purple Clarity Ninth Radiance Peaceful Consort came to bestow it,\nCommanding that it be written before daybreak.\nIt is recorded in the *Scroll of the Most High’s Eight Arts: Wisdom, Demon-Dispelling, Divine Tiger, and Hidden Script*.\nHere ends the *Hidden Script of the Most High’s Divine Tiger of the Cavernous True*.",
      "overlap_context": "housand empty carriages were guarded by venomous dragons. Racing clouds hastened to the Mysterious, gathering *qi* to seize the winds. The heavens brightened, eightfold lights enveloped all. True maidens rode to the right, numinous youths were commanded to the left. In a flash, a thousand myriad arrived at the Upper Palace, halting their chariots in Jade Clarity. Rising from the Imperial Ramparts, they turned their steps toward the Purple Gates, bowing their heads in reverence to await audience.",
      "start_char": 1295,
      "end_char": 2345,
      "start_sentence": 56,
      "end_sentence": 105,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.98829102516174,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上神虎隐文.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}