{
  "source_id": "洞玄灵宝升玄步虚章序疏",
  "source_file": "chunked_daozang\\洞玄灵宝升玄步虚章序疏.json",
  "total_chunks": 6,
  "total_original_chars": 5228,
  "total_translated_chars": 30746,
  "total_translation_time": 156.1480576992035,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\赞颂类\\洞玄灵宝升玄步虚章序疏.txt",
    "category": "赞颂类"
  },
  "full_translation": "**Preface and Commentary on the *Dongxuan Lingbao Shengxuan Buwu Zhang***\n\nThe *Shengxuan* is the universal designation of wondrous enlightenment, while *Buwu* is the ultimate attainment of divine creation. *Sheng* (ascending) signifies verification without error; *Xuan* (mysterious) denotes profound union with the supreme virtue. *Bu* (stepping) is the term for traversing, and *Wu* (void) is the appellation for transcending all bounds.\n\nIt is also said that *Zhang* (verses) illumine and reveal, extolling the boundless flow of the Dharma-body. When the first notes of the mystical melody arise, the eight directions harmonize as one; when the divine resonance unfolds anew, the ten blossoms vie in gathering. Spiraling through the Mystic Capital to cast forth numinous power, treading the cloud-lattices to bear the契, this is truly the ritual ground for gladdening the spirit and purifying the will, the wondrous realm for dissolving form and shattering the mind—hence the title *Shengxuan Buwu Zhang*.\n\nIt is further said that the *Tai Shang* expounded the *Scripture of the Jade Capital Mountain of the Mystic Capital*. *Tai Shang* is the provisional title of the Sage, who proclaims the perfected Dharma. The *Jade Capital* is a metaphor for the Dharma-body. Though the Dharma is originally wordless and without form or appearance, here it provisionally employs the name and marks of the *Xuan Du* to expound the teaching. Thus, there are scriptures such as the *Jade Capital Mountain* and *City Terrace*, which constitute the eighth fascicle of the third section of the *Dongxuan Lingbao*. The reason it follows the *Kongdong* (Void Cavern) is that the *Kongdong* is the universal praise of all heavens, the Dharma-body’s all-embracing perfection, comprehending past and present as one principle and encompassing the coarse and subtle in shared practice—hence its sequence.\n\nThis text is the *Tai Shang*’s comprehensive summation, entitled the *Praise of the Great Pure Dharma-Gate*. It reveals the great essence of the conditioned teaching and illumines the shared path of wondrous enlightenment. Thus, every Dharma is the *Jade Capital*, and every being inscribes the Dao and virtue.\n\nIt is also said that the *Jade Capital* is the Dharma-body’s profound identity. *Du* (capital) is a designation. The name *Jade Capital Mountain* unites the three thousand great thousand-worlds into one, for this realm is the abode of the *Tai Shang*. It is also the dwelling of the human mind’s spirit—hence its proclamation as a teaching to instruct the mind’s spirit. When the mind’s spirit awakens, it is called awakening; when deluded, it is called delusion; when wise, it is called wisdom. Through reverent practice, it is termed the Dharma of humanity—thus it is called a *scripture*. *Scripture* (經) derives from *ford* (津), signifying passage. Principle arises from explanation, and explanation arises from principle. When the scholar’s spirit awakens, the text is thus named a *scripture*. *Yu* (jade) means purity; *Jing* (capital) means greatness. Expounding the *Xuan Du* as the principle of great purity, it is the Dharma-body. The *Tai Shang* is the person; the *Xuan Du Jade Capital* is the Dharma, and also the realm and wisdom. Speaking of the realm and its abode, both are called *treasures*; speaking of wisdom and its abode, both are called *Lingbao* (Numinous Treasure). Hence it is called the *Scripture of the Jade Capital Mountain of the Mystic Capital*.\n\nThis fascicle is divided into four parts:\n1. Presenting the *Xuan Du* as the realm of the Dao to establish the Dharma-body, elucidating the teaching’s methods through marks, and summarizing the activation of function from principle.\n2. Demonstrating the methods of cultivation.\n3. Listing ten hymns to praise the Dharma-body, summarizing the intent of entering principle from the external.\n4. Scattering and broadly reciting, ensuring every Dharma is correct, to illustrate the circulation of gain and loss.\n\nThe *Tai Shang* states: The *Jade Capital Mountain of the Mystic Capital* is the expounded discourse. It crowns the eight directions, for the mountain has four faces, four corners, and four slopes—hence the eight directions. This is the realm of heaven and earth, the abode where worlds are arrayed. Analogous to earthly topography, there are three *Xuan Du* (upper, middle, and lower), and the mountain is also called the *Three Great Ring Mountains*. The *Great Ring* is the crown, encompassing the eight directions, with all heavens contained within. The lowest *Small Xuan Du* corresponds to the eight directions’ eight worlds, forming one world encircled by one ring mountain. Layering upward to a thousand, it becomes a *small thousand-world*, arranged in the four directions. Encircling it again forms a *middle world*; layering upward to a thousand becomes a *middle thousand-world*, again arranged in the four directions. Encircling it once more forms a *great thousand-world*. Layering upward to a thousand, it becomes a *crown-encircling mountain*. Viewed collectively, these are the *three thousand great thousand-worlds*. This crowns the eight methods and encompasses the heavens.\n\nComposed of the seven treasures, it is also called a *treasure assembly*—hence the name *Jade Capital*. This metaphorical image clarifies the lofty subtlety of its meaning, designating the *Lingbao* Dharma-body’s all-pervading emptiness. Thus, the mountain naturally bears seven-jeweled trees. The mountain is named, not the trees—though the trees are its body, they are also called *Dao-trees*. A single trunk’s branches and leaves spread and cover all, hence it is called the *Dharma-Encompassing Heaven*. This is the place where the *Great Dao Lord* governs, transforms, sits, and walks—the realm of the Dharma, the site of the Dao-ground, the abode of the spirit, the place of Dharma-expounding. It is not established apart from the Real; every place is the Real. Throughout the world, there is no place that is empty or idle—whether the three poisons or the four arrivals, the numinous essence or the Dharma-ocean, the six senses or the five aggregates.\n\nThe *Jade Capital Mountain* is the *Xuan Du* of the lofty immortals, where all sages gather—it is also the sacred realm of the *Great Dao Lord*. Who else but the Sage could take all things as their own body? Hence it is called the *Great Dharma Sage*. Heavenly Worthies, Emperors, lofty immortals, and perfected transcendents all uphold the fast and revere the Dharma, venerating the *Tai Shang* here. *Zhai* (fasting) means washing the mind—*Zhai* is the sun, the time. It is also the mind’s purity and luminous reflection as the sun and time. When I am pure, nothing is impure. The title *Tai Shang Xuan Du* embodies this meaning.\n\nBurning the naturally arisen *Qiandao* incense and the reverse-born numinous fragrance—this is the divine incense. The realm is purity. Flying immortals scatter flowers—all Dharmas are flowers. Spiraling and circling, they chant the *Kongdong* numinous verses. All heavens perform a chaotic assembly of a hundred thousand sounds. This is the wondrous exposition, all matters of the numinous awakening within the Dharma-body—one must rely on the text to comprehend it.\n\nThe mountain bears ten titles, each reflecting the Dharma-body. Though it has ten names, they share a single meaning.\n\nFirst, it is called *Gaitian Shoushan* (Heaven-Covering Summit Mountain). This mountain embodies the true emptiness of Dharma-nature, spanning past and present as the primal head of all things—hence *Heaven’s Summit*.\n\nSecond, it is called *Mixuan Shangshan* (Boundless Mystery Supreme Mountain). Its expanse knows no edges to trace, no ascent or descent to reach—hence *Boundless Mystery*.\n\nThird, it is called *Luoxuan Dongxu Shan* (Mystic Net Cavern-Void Mountain). It is present everywhere, yet wherever it is, there is nothing—hence *Mystic Net*.\n\nFourth, it is called *Gaoshang Zhenyuan Shan* (Lofty Supreme True Origin Mountain). It is the ancestral seat of all sages—hence *Lofty Supreme*.\n\nFifth, it is called *Zhongbao Youjie Ren Shan* (Multitude-of-Treasures Hidden-Kalpa Blade Mountain). Every Dharma therein is treasure, revealed in both depth and surface—hence *Multitude-of-Treasures*.\n\nSixth, it is called *Wuse Dajue Shan* (Formless Great Awakening Mountain). Its wondrous awakening is without form—hence *Formless*.\n\nSeventh, it is called *Zhouguan Dongxuan Shan* (All-Encompassing Cavern-Mystery Mountain). Its luminous clarity is boundless—hence *All-Encompassing*.\n\nEighth, it is called *Jinghua Taizhen Shan* (Radiant-Flower Supreme Perfection Mountain). Its body is one, its flower-light flowing like nectar—hence *Radiant-Flower*.\n\nNinth, it is called *Busiyi Shan* (Inconceivable Mountain). Its true emptiness transcends thought and deliberation—hence *Inconceivable*.\n\nTenth, it is called *Taixuan Du Yujing Taishang Shan* (Great Mystery Capital Jade Capital Supreme Mountain). Here, person and Dharma are non-dual, purity its essence—hence *Great Mystery*.\n\nThe mountain is the body—it is also the body of the *Tai Shang*. Knowing the purport beneath these names, one aligns with the Dharma; name and essence unite, and thus one enters the register of immortals.\n\nThe realm of the mountain’s seven-jeweled trees—branches, stems, and leaves—along with its soil, stones, and terraced pavilions, are all composed of the seven treasures. Its flowers and leaves are the scriptures of the *Upper Clarity* and *Three Caverns*: the *Virtue/Power* and other sutras, their texts and commentaries comprising the thirty-six divisions. Those who consume them become golden-flowered immortals.\n\nEncouraged to sip the numinous nectar of the *Lingbao* pure libation, the realm brightens with the heart’s clarity, and the earth itself becomes the seven-jeweled mystery scriptures. The mountains, forests, grasses, and stones all possess wisdom, capable of expounding the treasure Dharma—where is there a place that is not the *Jade Capital*?\n\nThe *Dongxuan Bu Xu Yong* (Cavern-Mystery Pacing the Void Chant) that follows this passage is the method of savoring the seven-jeweled flowers and leaves. When the heart connects with the mysterious Dao, the spirit chants while pacing the void, traversing the scriptures. The adept’s spiritual awakening is called *scripture*; observation follows sound in wandering—hence *chanting*.\n\nAs for *bowing with reverence*, there are three kinds, as commonly understood. Here, given the purport of savoring and chanting, it is fitting to interpret from the heart’s resonance.\n\n*The Supreme Cavern-Mystery Pacing the Void Sutra Chant: First*\n\nBowing with reverence to the Supreme,\nincense burned to return to the Void Origin.\nLuminous radiance follows my return,\nthe Dharma-wheel likewise turns thrice.\nThe Mysterious Origin flourishes in the Four Greats,\nspiritual blessings extend to kings and lords.\nSeven generations of ancestors ascend to Heaven’s halls,\nresplendent, their glory unfurled.\nWhistling and singing, I contemplate the Great Vastness,\nheavenly music delights my joy.\nEqual in fragrance, the unsurpassed virtue,\nlesser immortals cannot compare.\nWondrous forms illumine the Mysterious Awakening,\nin throngs they roam the void in carefree wandering.\n\n*Bowing with reverence*: to *open* (稽) the *heart* (首) and *embody* (礼) it, allowing the wisdom-fire of the Supreme to burn away all bodily forms until pure. *Burning incense to return to the Void*: to *dissolve* (烧) all phenomena, where purity naturally returns to the Void—yet the Void does not return to the Supreme; the Supreme returns to itself, hence the phrase. *Luminous radiance follows my return*: \"I\" here is the realized Supreme; the Dharma-wheel turns thrice, completing its revolution in union with the Supreme. *The Mysterious Origin flourishes in the Four Greats*: \"Mysterious Origin\" means \"to follow\"; my Four Greats thrive in harmony with the Mysterious Dao. *Spiritual blessings extend to kings and lords*: spiritual wisdom and blessings converge, nurturing kin, serving rulers, and benefiting all beings—hence extending to kings and lords. Thus, *seven generations of ancestors ascend to Heaven’s halls*, their glory resplendent. *Whistling and singing, I contemplate the Great Vastness*: singing the tones of spiritual wisdom, a single sound pervades all, contemplating the Dao of the Great Vastness. In harmony with the Dao, joy naturally aligns with heavenly music, *heavenly music delights my joy*. *Equal in fragrance, the unsurpassed virtue*: \"fragrance\" means \"to receive\"; ancestors and rulers alike receive the unsurpassed virtue with me, for they are not the companions of lesser immortals. *Wondrous thoughts merge with all wonders*, hence the Mysterious Awakening. *In throngs* (诜诜), in splendid array, the multitude roams the void in carefree wandering.\n\n**Second**\n\nCircling in flight, treading the net of clouds,\nriding the void, pacing the Mysterious Record.\nChanting the hymn to the Imperial Unity,\na hundred joints naturally harmonize.\nBending to command the lads of the Eight Seas,\nlooking up to carry the lofty immortals.\nAll heavens scatter fragrant flowers,\na serene numinous wind arises.\nLong-held vows root the destiny,\nthus attaining the lofty aspiration.\nReverent joy before the Supreme—\nten thousand kalpas are but a beginning.\n\n*Circling in flight, treading the net of clouds*: circling the void in motion, *motion* (行) as in *forgetting*. Feet tread the guiding principles of the Dharma-cloud, *riding the void, pacing the Mysterious Record*. *Chanting*: the nature’s communion. When the nature communes, the Imperial Unity naturally unites with my body, and the hundred joints return to wholeness. *Hundred joints*: the hundred bones of the body, naturally harmonizing with the supreme principle. *Bending to command the lads of the Eight Seas*: embracing all things as one’s own body, thus the eight directions’ seas of nature are but a single infant lad. *Lad*: without mind. *Looking up to carry the lofty immortals*: what heaven and earth rely upon. *All heavens scatter fragrant flowers*: scattering the true Dharma-flower above and below. *The realm follows the heart’s clarity*, and jade scriptures arise in response to the realm. *A serene numinous wind arises*: the wind of spiritual awakening, rising in serene whispers. *Long-held vows root the destiny*: the vows accumulated over countless kalpas, boundless spiritual wisdom, pledged to enlightenment—thus the root of destiny is long established, now to be received. *Thus attaining the lofty aspiration*: the lofty aspiration is now fulfilled. With the Supreme present in my heart, the Dao-fruit is boundless, and vows are fulfilled—hence reverent joy abides in constancy. *Ten thousand kalpas are but a beginning*: the unraveling of eternity.\n\nThe third: Towering and majestic, the Dark Capital Mountain—\nthe ten directions revere the One Sovereign.\nLofty, the Terrace of Heavenly Treasure,\nits radiance flames like the streaming sun.\nResplendent, the Jade-Flower Grove,\ncrimson fruits gleam in dazzling splendor.\nEver mindful to nourish the primordial essence,\nrefining the fluid to solidify form and substance.\nGolden light scatters through the Purple Tenuity,\ngraceful and secluded, the Dark Capital’s leisure.\nTowering and majestic, the Dark Capital Mountain.\n\nIt speaks of the realm’s purity, the Dharma-body’s majesty—\nthe Dark Capital is the mountain where the mysterious Dao convenes.\nThe ten directions revere the One Sovereign:\nthe One Sovereign is the honored heart of wisdom’s purity.\nIn awakening, one recognizes that the Dark Capital encompasses the ten directions,\nall converging in reverence to the One Sovereign’s honor.\nLofty, the Terrace of Heavenly Treasure:\nit unites the myriad things as one’s own body.\nWhen realm and wisdom illumine as one,\nradiance flames like the streaming sun.\nThe light of sun and moon becomes dim and useless—\nthis is the sun’s light transcended.\nBelow, it is explained: resplendent, the Jade-Flower Grove,\ncrimson fruits gleam in dazzling splendor.\n\nEver mindful to nourish the primordial essence:\nthis recounts the practice of contemplation.\nPrimordial essence is numinous wisdom.\nDaily contemplation refines clarity and transforms the qi of mortality,\nthus the root of form and substance becomes a body of golden light.\nScattering brilliance through my being,\nit gives rise to the Purple Tenuity’s abode,\ngraceful and secluded, wandering freely in the Dark Capital’s dwelling.\nThose who later altered this to \"Mahayana\" reached the height of folly.\n\"Vehicle\" denotes the direction of conveyance—\nthe Dark Capital is the supreme chamber of the ultimate Dao.\nTo approach it through faith and devotion\nis like a traveler whose weariness and ease reach their extremes.\n\nThe fourth: In reverence, I hold the Supreme in mind,\nthe Flowery Radiance beautifies the cinnabar field.\nGazing left, I lift the Somber Luminant;\nglancing right, I carry the Linked Brilliance.\nThe Six Perfections crown the brahmic conduct,\nvirtue and power renew with each passing day.\nAccumulated blessings from past lives bring felicity—\nhearing the sutras is like meeting one’s closest kin.\nHeaven-endowed with transcendent talent,\njoyfully reciting the subtle and wondrous scriptures.\nThe qi of profound emptiness and great harmony,\nexhaling and inhaling the flowing rosy mist.\nFetal breathing stills the hundred passages,\nin solitude, mastering the three expedients.\nThe Mud-Pill Palace shines with luminous radiance,\nthus becoming an Immortal of Golden Flower.\nThe Demon King pays homage and receives his charge,\nenabling him to ascend and attend the heavens.\nAll begins with fasting and precepts,\naccumulating merit to weave past connections.\nSoaring through the vast void,\nuplifting the lofty ones.\n\nIn reverence, I hold the Supreme in mind:\neach of these chapters establishes a distinct contemplative gate,\na practice of nurturing and savoring through chanting.\nThe gates differ—\nthe ode declares that radiant awakening returns to the One Source.\nEach chapter stands alone, without overlap.\nNow, \"in reverence, I hold the Supreme in mind\":\n\"Hold\" is the heart.\nThe body’s movements have reverence and deference;\nthe heart’s movements have contemplation and visualization.\nWhen conduct and heart attain the numinous and wondrous,\nwondrous thoughts naturally gather,\nand the body follows the spirit.\nThe heart holds the spirit, moving in accord with the Supreme;\nthe Supreme follows the spirit to act.\nThus the reverent body equals the Supreme,\nand the Supreme, following the spirit, returns to me—\nhence the Flowery Radiance beautifies the cinnabar field.\nGazing left below, lifting the Somber Luminant and Linked Brilliance,\nall are carried by awakened wisdom.\nThe Six Perfections serve as its crown,\ncrowning the brahmic conduct—\nthus virtue and power renew with each passing day.\n\nAccumulated blessings from past lives:\nthis describes one who practices as above,\nwhose past cultivation spans eons,\nnow honored and advancing without regression.\nHearing the sutras is like meeting one’s closest kin:\nthe response to accumulated blessings.\nLike parents, the closest kin—\nthe feeling of suddenly encountering them after long separation.\nThe sutras are the Dharma-mother,\nthe Dao the Dharma-father.\nMeeting them brings joy and reverence,\nand one’s conduct reflects past connections.\nHeaven-endowed with transcendent talent,\nthus delighting in reciting the subtle and wondrous two scriptures.\n\"Subtle\" denotes the soundless,\n\"wondrous\" the formless.\nWithout past cultivation sustaining karmic force,\none would not believe in the sutras,\nhearing yet not knowing they are heard.\nEven if practiced, one would soon regress,\nlacking the power of restraint.\n\nThe qi of profound emptiness and great harmony:\nthis describes the practice of right contemplation.\n\"Profound\" is the heart.\nThe heart attains the wondrous qi of profound emptiness and great harmony,\nexhaling and inhaling the flowing radiance,\nthe rosy mist irrigating my being.\nThis is also called fetal breathing.\nLike a fetus at rest,\nbreathing without conscious effort,\nempty and at ease, nurturing—\nstilling the hundred passages.\nStillness makes the heart solitary and serene,\nbrightly illumined,\nmastering the expedient gates of the three realms.\nThe Mud-Pill is non-action;\nnon-action illumines within,\nlight and radiance shine without—\nthe Dao of true constancy, flourishing and luminous.\nThus one becomes an Immortal of Golden Flower.\nNaturally, the Demon King respects and receives his charge,\nenabling him to ascend and attend the heavens.\nAll begins with fasting and precepts:\nthis recounts how, from the outset,\npast cultivation accumulated myriad virtues across vast kalpas,\nsweeping away the dust left by the Primordial Beginning.\nThus the body equals the Dharma-realm,\nsoaring and traversing the vast void.\nGathering and uniting the wondrous,\nuplifting the lofty ones.\n\nThe fifth: Guiding the reins to the ten directions,\ncircling to rest in the Dark Radiance’s expanse.\nGazing up at the Terrace of Kalpas,\nlooking down upon the Purple Cloud Net.\nCarefree in the Supreme Capital,\ntogether seated upon lotus flowers.\nAccumulated learning makes one a Perfected Person,\ntranquil, the constructive and protective forces harmonize.\nForever enjoying boundless life,\nhow could ten thousand kinds compare?\n\nGuiding the reins to the ten directions:\nguiding the body, reining the heart—\nthe body follows the heart to purity,\nthe heart reins the body to act.\nRiding this, one reaches the ten directions, pervading all—\nthus circling to rest and pause,\nseated in the Dark Dao’s radiance,\nwithin the Aligned Chambers.\nGazing up, body and heart sit upon the Terrace of Kalpas;\nlooking down, turning to brightness,\nenveloped by the Purple Cloud.\nThe Purple Cloud’s canopy—\nthe color of the Dharma-cloud, the apex of numinous wisdom.\nSeated thus, carefree,\ndwelling in the Supreme’s Jade Capital.\nHoly companions gather,\ntogether seated upon lotus flowers.\n\nAccumulated learning makes one a Perfected Person:\nthis dispels delusion—\npast cultivation spans eons, hence its attainment now.\nTranquil, the constructive and protective forces harmonize:\nthe method of constructive and protective forces—\ntrue wisdom harmonizes tranquility,\nthe stomach’s inner harmony and clarity.\nForever enjoying boundless, endless life—\nhow could ten thousand kinds compare? Hence, how could they be many?\n\nThe sixth: The Great Dao’s master is mysterious and quiescent,\nascending immortals befriend the Peerless Hero.\nThe Noble Scion bestows the numinous talisman,\nthe Great One bears the Cavern Scripture.\nSarira radiate a golden form,\nthe dragon-drawn chariot suddenly arrives to welcome.\n\nThe Heavenly Worthy gazes upon the cloud-chariot,\nfloating, floating—riding the void in flight.\nFragrant blossoms like swirling snow,\nmist and haze flourish upon the dark beams.\n\nBowing in reverence toward the Golden Portal,\nhand in hand they roam the Jade Capital.\nThe Great Dao’s master is mysterious and quiescent.\nThose who seek the Great Dao\nshould take the realm of mysterious quiescence as their master.\nMastering quiescence externally,\nthey attain the primordial internally.\nQuiescence is non-action;\nnon-action is quiescence—\nthus is the Great Dao attained,\nthus is quiescence made one’s master.\n\nHence, they ascend as companions to the Peerless Hero.\nHaving befriended the Peerless Hero,\nthe numinous talisman naturally turns within me.\nThe Peerless Hero is the title of a celestial perfected.\nThe Supreme One of the Great Unity offers me the Cavern Scripture.\nThe Cavern Scripture is the celestial sound.\nSarira are the bones.\nThe Cavern Scripture washes my bone-form,\nand my bone-form assumes a golden countenance.\n\nThe dragon-drawn chariot suddenly arrives in the void to welcome,\nreining freely as we roam.\nThe Heavenly Worthy gazes upon me,\nthe cloud-chariot floating, floating—\ntogether we ride the void in flight.\nFragrant blossoms span the celestial realm,\nlike swirling snow in boundless haze,\nlush and splendid, the lofty beams of the dark Dao.\nBowing in reverence within the Golden Portal,\nthe Heavenly Worthy takes my hand,\nand we roam, seated in the Jade Capital.\n\n---\n\nThe seventh:\nThe towering trees of the Dark Radiance Garden,\nresplendent with the Seven Treasures’ grove.\nThree hundred celestial beasts in name,\nlions vast as ten thousand *xun*.\nFlying dragons pace and roar,\ndivine phoenixes chant in harmony.\nA numinous breeze fans rare blossoms,\ntheir pure fragrance scattering upon one’s lapels.\nWithout the talent of a lofty immortal,\nhow could one indulge such a heart?\n\nThe towering trees of the Dark Radiance Garden.\nRadiance follows a pure heart,\nhence the radiance forms Seven Treasures’ towering trees.\nNow, speaking of radiance’s wonder\nis also speaking of the heart’s wonder—\nthus, setting forth the heart’s wisdom to describe radiance,\nit is called the Dark Radiance Garden.\nThe wondrous heart illumines the perfectly pure radiance,\nand the treasure forms the Seven Treasures’ towering trees,\nthe garden of the Dharma-realm—\nhence, resplendent with the Seven Treasures’ grove.\n\nThree hundred celestial beasts in name.\nSpontaneous Dharma-beasts manifest in form,\nas the Dharma-king lion abides in freedom,\nhence the name \"lion.\"\nThree hundred names and vast as ten thousand *xun*—\nthese are but approximate counts.\nIn truth, their names and forms are numberless,\ntheir bodies vast and boundless.\nBelow, flying dragons and divine phoenixes\nare alternate names for celestial beasts.\nBeneath the divine phoenix’s fan,\nthe wondrous wisdom is expounded.\nWith luminous purity of numinous wisdom,\nits majestic wind and marvelous power\nfans the myriad scenes into the Dharma of radiant purity,\nfragrant blossoms scattering upon one’s lapels in the realm.\n\nThe following verse reveals:\nwithout the talent and wisdom of a lofty immortal and great sage,\nhow could one possess a heart to delight in such things?\n\n---\n\nThe eighth:\nAdorning my nine-dragon chariot,\nI ride the void in carefree roaming.\nThe eight heavens are like the palm of one’s hand,\nhow could the six directions be distant?\nThe assembled immortals chant the Cavern Scripture,\nthe Supreme One sings a pure melody.\nFragrant blossoms scatter with the wind,\njade tones ascend into the Purple Empyrean.\nThe Five Sufferings all burst forth at once,\nthe Eight Difficulties follow the scripture’s emptiness.\nWondrous indeed is the Numinous Treasure’s garden,\ngiving rise to this great Dharma-bridge.\n\nAdorning my nine-dragon chariot.\n\"Adorning me\" means that the Numinous Treasure’s true wisdom\nadorns and purifies my five faculties and four hearts,\nforming the six penetrations and three clarities,\npaving the level path of the multitude—\nhence, the nine-dragon chariot.\nThus, it is said: riding the void in carefree roaming.\n\nThe eight heavens are like the palm of one’s hand,\nhow could the six directions be distant?\nRiding in accord, the myriad things become one body.\nThe Supreme One, the honored teacher, and good companions\ngather without prior arrangement,\nall chanting and singing the empty cavern’s melodies to establish the teaching.\nThus, fragrant blossoms scatter with the wind,\njade tones ascend into the Purple Empyrean.\nThe Purple Empyrean’s realm and forms all become scripture,\nhence the Five Sufferings, in an instant,\nscatter with the scripture—\nthey too become scripture.\nThe Eight Difficulties are likewise.\nThus, it is said: wondrous indeed is the Numinous Treasure’s garden,\ngiving rise to this great Dharma-bridge.\n\n---\n\nThe ninth:\nThe Palace of the Heavenly Perfected and Imperial Unity,\nits misty radiance crowning the numinous.\nFlowing and resplendent, the Dharma-wheel’s net,\nspinning through the void to enter formlessness.\nThe August Void strums the cloud-zither,\nthe assembled perfected chant the Cavern Scripture.\nLofty immortals cup their hands in praise,\nthrough endless kalpas preserving integrity and purity.\n\nThe Palace of the Heavenly Perfected and Imperial Unity.\n\"Palace\" is the body.\nEmbodying the spontaneous Dao,\nit is the dwelling of the Heavenly Perfected,\nthe abode of the true Imperial Unity.\n\"Abode\" is the dwelling of the Imperial Unity.\nIts misty form crowns the numinous radiance.\nThe Dharma-body of the self\nflows with luminous splendor,\nbecoming the net of the Dharma-bridge’s principles.\nThe wheel turns to merge with the void,\nthe Great Dao spinning through the void to enter formlessness.\nThe August Void and the assembled perfected\nsuddenly arrive as great teachers and companions,\nstrumming the cloud-zither and singing,\ntogether chanting the Cavern Scripture to perfect me.\nLofty immortals cup their hands in praise and celebration.\nThrough endless kalpas preserving integrity and purity—\nthis is the constant.\n\nThe Utmost Perfected awaits nothing,\nat times reining in flying dragons.\nWith long fasts they gather in the Mystic Capital,\nstriking jade to sound the jasper bells.\nThe Ten Flowers host the assembled immortals,\npurple mists congeal to form their palace.\nJeweled canopies array the Most High,\nPerfected Ones grasp lotus blossoms.\nScattering flowers, they present my vows,\ngrasping the tally to subdue the Demon King.\nThe Dharma-drum summons the host of immortals,\ntheir numinous chants harmonize without discord.\nNo can, no cannot—\nthought merges with the subtle and imperceptible.\nThe Utmost Perfected awaits nothing,\nat times reining in flying dragons.\n\nEmbodied in the Utmost Perfection,\nthey ride all things without obstruction,\nbear all forms without support—\nthus they await nothing.\nAt times reining in flying dragons.\nWith prolonged fasting and purified hearts,\nthey naturally converge in the Mystic Capital.\nStriking jade to sound the jasper bells—\nthe Dharma-drum summons, and they respond.\nBeneath the Ten Flowers, the host of sages gathers.\nPurple mists exhale to form their natural abode.\nThe jeweled canopy is the Dharma-crown,\narrayed for the Most High.\nCountless Perfected Ones hold lotus Dharma-banners,\noffering to the emptiness-born.\nAll scatter the flowers of Dharma-wisdom,\narraying them to fulfill my past vows.\nPast vows become boundless wisdom and resolve—\nnow their fulfillment is attained.\nGrasping the tally to subdue the Demon King,\nthey accomplish the vow to sever delusion.\nThe Dharma-drum is the drum of Dharma-wisdom,\nassembling the host of spirits.\nTheir numinous chants harmonize without discord.\nThus there is no can, no cannot—\nthought merges with the subtle and imperceptible.\nInner illumination manifests outer function,\nso inner thought naturally communes with the subtle.\n*Commentary on the Preface to the \"Ascending the Mystic\" and \"Pacing the Void\" Chapters of the Cavernous Mystery Numinous Treasure Concluded*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞玄灵宝升玄步虚章序疏 经名：洞玄灵宝升玄步虚章序疏。 撰人不详，约出於隋唐。 一卷。 底本出处：《正统道藏》洞玄部赞颂类。 洞玄灵宝升玄步虚章序疏 升玄是妙觉之通名，步虚是神造之员极。 升则证实不差，玄则冥同至德。 步是通涉之名，虚是纵绝之称。 又云章者，焕辉敞露，赞法体之滂流，乃有玄音才吐，而八表咸和，神韵再敷，则十华竞集。 旋玄都以掷灵，蹑云纲而担契。 信是怡神涤志之法场，解形隳心之妙处也，故言升玄步虚章。 又云太上说玄都玉京山经者。 太上，圣人之假号，能说成法也。 玉京，喻法体也。 法本无言，亦无形相，今则假玄都名相说法，故有说玉京山及城台等经，是洞玄第三部灵宝第八卷。 所以次空洞者，空洞即是诸天通赞，法体周圆，识古今之一揆，括粗妙以同徒，故次。 此文太上通结述成，号大净法门之赞也。 乃显缘教之大体，朗妙觉之同徒。 故以法法尽是玉京，物物咸书道德。 又云玉京，即法体玄同也。 都，号也。 同号三千大千世界为一玉京山，为此境界太上住处。 又为人心神住处，故说之为教名，体教诲於心神。 心神觉悟时名觉悟，迷时名迷，智时名智。 敬使相称为人法，故说为经。 经由津通义也。 理因说解，说因理生。 学者神悟，便以经为名。 玉，净也。 京，大也。 说玄都为大净之理，故法体也。 太上是人，玄都玉京是法，亦是境智。 说境及境处，俱名为众宝，说智及智处，俱名为灵宝。 故云说玄都玉京山经。 就此卷为四等。 第一举玄都为道境，以建法体，依相以解教方，述结从理起用。 第二示修行方法。 第三列十颂以赞法体，结述从外入理之意。 第四散掷广诵，法法皆正，以示得失流通。 太上曰：夫玄都玉京山，即说辞也。 冠八方者，山有四面四维四垂，故有八方也。 是天地境界，住处有列世界。 比地形有上中下三玄都，山名亦日三大环山。 大环即冠，罗盖八方，诸天周尽在内。 初下小玄都，即八方比世界八天下，为一世界，一环山笼裹之，重迭上数至一千，即为一小千世界，即四方安之。 又一笼笼之，即为一中世界，重上数至千，即为一中千世界，又四方安之。 更一笼笼之，即为一大千世界。 重上数至千，即一冠笼山。 总望中下，名为三千大千世界是也。 此即冠八方法罗天。 以七宝为体，亦名宝聚，故日玉京。 此以寄相，明解美之高妙，以目灵宝法体，周观洞虚，故其山自然生七宝之树。 说山名，非树说也，以树为体，亦名道树。 唯一株枝叶罗覆，敷布皆周，故云法罗天也。 即大道君治化行坐之处，法界处，道场处，安神处，说法处。 非离真而立，处处即真也。 遍世问无有一处是空闲，三毒四到，灵津法海，六情五阴。 玉京山高仙之玄都，万圣同会，亦大道君圣也。 今万物以为己体者，其唯圣人乎。 故云法大圣。 天尊帝王、高仙上真，各持斋奉法，宗太上於此也。 斋者，洗心日斋。 日，时也。 亦以心净觉照为日时也。 并我净则无所不净也。 夫号太上玄都，即其义也。 烧自然旗旃檀，反生灵香，即神香也。 境界，净也。 飞仙散华，一切法为华也。 旋绕周歌空洞灵章也。 诸天奏百千众音乱会也。 此盖妙说，皆灵觉法体中事，但凭文自了。",
      "translated_text": "**Preface and Commentary on the *Dongxuan Lingbao Shengxuan Buwu Zhang***\n\nThe *Shengxuan* is the universal designation of wondrous enlightenment, while *Buwu* is the ultimate attainment of divine creation. *Sheng* (ascending) signifies verification without error; *Xuan* (mysterious) denotes profound union with the supreme virtue. *Bu* (stepping) is the term for traversing, and *Wu* (void) is the appellation for transcending all bounds.\n\nIt is also said that *Zhang* (verses) illumine and reveal, extolling the boundless flow of the Dharma-body. When the first notes of the mystical melody arise, the eight directions harmonize as one; when the divine resonance unfolds anew, the ten blossoms vie in gathering. Spiraling through the Mystic Capital to cast forth numinous power, treading the cloud-lattices to bear the契, this is truly the ritual ground for gladdening the spirit and purifying the will, the wondrous realm for dissolving form and shattering the mind—hence the title *Shengxuan Buwu Zhang*.\n\nIt is further said that the *Tai Shang* expounded the *Scripture of the Jade Capital Mountain of the Mystic Capital*. *Tai Shang* is the provisional title of the Sage, who proclaims the perfected Dharma. The *Jade Capital* is a metaphor for the Dharma-body. Though the Dharma is originally wordless and without form or appearance, here it provisionally employs the name and marks of the *Xuan Du* to expound the teaching. Thus, there are scriptures such as the *Jade Capital Mountain* and *City Terrace*, which constitute the eighth fascicle of the third section of the *Dongxuan Lingbao*. The reason it follows the *Kongdong* (Void Cavern) is that the *Kongdong* is the universal praise of all heavens, the Dharma-body’s all-embracing perfection, comprehending past and present as one principle and encompassing the coarse and subtle in shared practice—hence its sequence.\n\nThis text is the *Tai Shang*’s comprehensive summation, entitled the *Praise of the Great Pure Dharma-Gate*. It reveals the great essence of the conditioned teaching and illumines the shared path of wondrous enlightenment. Thus, every Dharma is the *Jade Capital*, and every being inscribes the Dao and virtue.\n\nIt is also said that the *Jade Capital* is the Dharma-body’s profound identity. *Du* (capital) is a designation. The name *Jade Capital Mountain* unites the three thousand great thousand-worlds into one, for this realm is the abode of the *Tai Shang*. It is also the dwelling of the human mind’s spirit—hence its proclamation as a teaching to instruct the mind’s spirit. When the mind’s spirit awakens, it is called awakening; when deluded, it is called delusion; when wise, it is called wisdom. Through reverent practice, it is termed the Dharma of humanity—thus it is called a *scripture*. *Scripture* (經) derives from *ford* (津), signifying passage. Principle arises from explanation, and explanation arises from principle. When the scholar’s spirit awakens, the text is thus named a *scripture*. *Yu* (jade) means purity; *Jing* (capital) means greatness. Expounding the *Xuan Du* as the principle of great purity, it is the Dharma-body. The *Tai Shang* is the person; the *Xuan Du Jade Capital* is the Dharma, and also the realm and wisdom. Speaking of the realm and its abode, both are called *treasures*; speaking of wisdom and its abode, both are called *Lingbao* (Numinous Treasure). Hence it is called the *Scripture of the Jade Capital Mountain of the Mystic Capital*.\n\nThis fascicle is divided into four parts:\n1. Presenting the *Xuan Du* as the realm of the Dao to establish the Dharma-body, elucidating the teaching’s methods through marks, and summarizing the activation of function from principle.\n2. Demonstrating the methods of cultivation.\n3. Listing ten hymns to praise the Dharma-body, summarizing the intent of entering principle from the external.\n4. Scattering and broadly reciting, ensuring every Dharma is correct, to illustrate the circulation of gain and loss.\n\nThe *Tai Shang* states: The *Jade Capital Mountain of the Mystic Capital* is the expounded discourse. It crowns the eight directions, for the mountain has four faces, four corners, and four slopes—hence the eight directions. This is the realm of heaven and earth, the abode where worlds are arrayed. Analogous to earthly topography, there are three *Xuan Du* (upper, middle, and lower), and the mountain is also called the *Three Great Ring Mountains*. The *Great Ring* is the crown, encompassing the eight directions, with all heavens contained within. The lowest *Small Xuan Du* corresponds to the eight directions’ eight worlds, forming one world encircled by one ring mountain. Layering upward to a thousand, it becomes a *small thousand-world*, arranged in the four directions. Encircling it again forms a *middle world*; layering upward to a thousand becomes a *middle thousand-world*, again arranged in the four directions. Encircling it once more forms a *great thousand-world*. Layering upward to a thousand, it becomes a *crown-encircling mountain*. Viewed collectively, these are the *three thousand great thousand-worlds*. This crowns the eight methods and encompasses the heavens.\n\nComposed of the seven treasures, it is also called a *treasure assembly*—hence the name *Jade Capital*. This metaphorical image clarifies the lofty subtlety of its meaning, designating the *Lingbao* Dharma-body’s all-pervading emptiness. Thus, the mountain naturally bears seven-jeweled trees. The mountain is named, not the trees—though the trees are its body, they are also called *Dao-trees*. A single trunk’s branches and leaves spread and cover all, hence it is called the *Dharma-Encompassing Heaven*. This is the place where the *Great Dao Lord* governs, transforms, sits, and walks—the realm of the Dharma, the site of the Dao-ground, the abode of the spirit, the place of Dharma-expounding. It is not established apart from the Real; every place is the Real. Throughout the world, there is no place that is empty or idle—whether the three poisons or the four arrivals, the numinous essence or the Dharma-ocean, the six senses or the five aggregates.\n\nThe *Jade Capital Mountain* is the *Xuan Du* of the lofty immortals, where all sages gather—it is also the sacred realm of the *Great Dao Lord*. Who else but the Sage could take all things as their own body? Hence it is called the *Great Dharma Sage*. Heavenly Worthies, Emperors, lofty immortals, and perfected transcendents all uphold the fast and revere the Dharma, venerating the *Tai Shang* here. *Zhai* (fasting) means washing the mind—*Zhai* is the sun, the time. It is also the mind’s purity and luminous reflection as the sun and time. When I am pure, nothing is impure. The title *Tai Shang Xuan Du* embodies this meaning.\n\nBurning the naturally arisen *Qiandao* incense and the reverse-born numinous fragrance—this is the divine incense. The realm is purity. Flying immortals scatter flowers—all Dharmas are flowers. Spiraling and circling, they chant the *Kongdong* numinous verses. All heavens perform a chaotic assembly of a hundred thousand sounds. This is the wondrous exposition, all matters of the numinous awakening within the Dharma-body—one must rely on the text to comprehend it.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1221,
      "start_sentence": 0,
      "end_sentence": 72,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.76179361343384,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\赞颂类\\洞玄灵宝升玄步虚章序疏.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "山有十号，号法体。 既有十名，一义耳。 一名盖天首山。 其山法性真空，罗於今古，为万物之元首也，故曰天首。 二名弥玄上山。 其山无边可寻，无上无下可至，故日弥玄。 三名罗玄洞虚山。 其山无所不在，所在皆无，故日罗玄。 四名高上真元山。 其山为万圣宗，故曰高上。 五名众宝幽劫刃山。 其山法法是宝，探浅并见，故曰众宝。 六名无色大觉山。 其山妙觉无相，故日无色。 七名周观洞玄山。 其山大明无际，故曰周观。 八名景华太真山。 其山一体，华光液液，故曰景华。 九名不思议山。 其山真空，非思虑所到，故日不思议。 十名太玄都玉京太上山。 其山人法不二，以净为体，故日太玄。 山者，身也，亦太上身也。 然知此名下旨，自与法同，名体俱合，故入仙录也。 七宝华叶山树境界，枝条茎叶，土石台观，皆是七宝，华叶皆是上清三洞道德等经，文字章解，俱三十六部经。 兆能餐食，自成金华仙人。 劝令咽味灵宝清觞，境随心爽，大地犹成七宝玄经。 山林草石，皆有智慧，能宣宝法，何处应非玉京。 洞玄步虚咏，此题下即味七宝华叶法也。 心通玄道，神咏步虚，游履经法。 学者神悟，曰经也，观随声游，故曰咏也。 稽首礼者，稽首有三，如常解。 今此中既是咽味吟咏之旨，宜从心叶解释也。 太上洞玄步虚经咏 第一",
      "translated_text": "The mountain bears ten titles, each reflecting the Dharma-body. Though it has ten names, they share a single meaning.\n\nFirst, it is called *Gaitian Shoushan* (Heaven-Covering Summit Mountain). This mountain embodies the true emptiness of Dharma-nature, spanning past and present as the primal head of all things—hence *Heaven’s Summit*.\n\nSecond, it is called *Mixuan Shangshan* (Boundless Mystery Supreme Mountain). Its expanse knows no edges to trace, no ascent or descent to reach—hence *Boundless Mystery*.\n\nThird, it is called *Luoxuan Dongxu Shan* (Mystic Net Cavern-Void Mountain). It is present everywhere, yet wherever it is, there is nothing—hence *Mystic Net*.\n\nFourth, it is called *Gaoshang Zhenyuan Shan* (Lofty Supreme True Origin Mountain). It is the ancestral seat of all sages—hence *Lofty Supreme*.\n\nFifth, it is called *Zhongbao Youjie Ren Shan* (Multitude-of-Treasures Hidden-Kalpa Blade Mountain). Every Dharma therein is treasure, revealed in both depth and surface—hence *Multitude-of-Treasures*.\n\nSixth, it is called *Wuse Dajue Shan* (Formless Great Awakening Mountain). Its wondrous awakening is without form—hence *Formless*.\n\nSeventh, it is called *Zhouguan Dongxuan Shan* (All-Encompassing Cavern-Mystery Mountain). Its luminous clarity is boundless—hence *All-Encompassing*.\n\nEighth, it is called *Jinghua Taizhen Shan* (Radiant-Flower Supreme Perfection Mountain). Its body is one, its flower-light flowing like nectar—hence *Radiant-Flower*.\n\nNinth, it is called *Busiyi Shan* (Inconceivable Mountain). Its true emptiness transcends thought and deliberation—hence *Inconceivable*.\n\nTenth, it is called *Taixuan Du Yujing Taishang Shan* (Great Mystery Capital Jade Capital Supreme Mountain). Here, person and Dharma are non-dual, purity its essence—hence *Great Mystery*.\n\nThe mountain is the body—it is also the body of the *Tai Shang*. Knowing the purport beneath these names, one aligns with the Dharma; name and essence unite, and thus one enters the register of immortals.\n\nThe realm of the mountain’s seven-jeweled trees—branches, stems, and leaves—along with its soil, stones, and terraced pavilions, are all composed of the seven treasures. Its flowers and leaves are the scriptures of the *Upper Clarity* and *Three Caverns*: the *Virtue/Power* and other sutras, their texts and commentaries comprising the thirty-six divisions. Those who consume them become golden-flowered immortals.\n\nEncouraged to sip the numinous nectar of the *Lingbao* pure libation, the realm brightens with the heart’s clarity, and the earth itself becomes the seven-jeweled mystery scriptures. The mountains, forests, grasses, and stones all possess wisdom, capable of expounding the treasure Dharma—where is there a place that is not the *Jade Capital*?\n\nThe *Dongxuan Bu Xu Yong* (Cavern-Mystery Pacing the Void Chant) that follows this passage is the method of savoring the seven-jeweled flowers and leaves. When the heart connects with the mysterious Dao, the spirit chants while pacing the void, traversing the scriptures. The adept’s spiritual awakening is called *scripture*; observation follows sound in wandering—hence *chanting*.\n\nAs for *bowing with reverence*, there are three kinds, as commonly understood. Here, given the purport of savoring and chanting, it is fitting to interpret from the heart’s resonance.\n\n*The Supreme Cavern-Mystery Pacing the Void Sutra Chant: First*",
      "overlap_context": "Xuan Du* embodies this meaning.\n\nBurning the naturally arisen *Qiandao* incense and the reverse-born numinous fragrance—this is the divine incense. The realm is purity. Flying immortals scatter flowers—all Dharmas are flowers. Spiraling and circling, they chant the *Kongdong* numinous verses. All heavens perform a chaotic assembly of a hundred thousand sounds. This is the wondrous exposition, all matters of the numinous awakening within the Dharma-body—one must rely on the text to comprehend it.",
      "start_char": 1222,
      "end_char": 1766,
      "start_sentence": 73,
      "end_sentence": 107,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.117558479309082,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\赞颂类\\洞玄灵宝升玄步虚章序疏.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "稽首礼太上，烧香归虚元。 流明随我回，法轮亦三周。 玄元四大兴，灵庆及王侯。 七祖生天堂，煌煌耀景敷。 啸歌观太漠，天乐适我娱。 齐馨无上德，下仙不与俦。 妙相明玄觉，诜诜巡虚游。 稽首礼太上。 稽，开也。 首，心也。 礼，体也。 开心体，令太上智慧火烧身相皆尽净。 烧香归虚无者。 烧，消灭也，消灭众相，香净自归虚无也。 虚无非归於太上，太上自归之，故云。 流明随我回。 我者，我即成太上，法轮亦三周，以此合太上，即转三法轮周竟。 玄元四大兴。 玄元遂也。 我之四大隆盛，与玄道合常也。 灵庆及王侯。 灵智庆合，可以养亲，可以适君，可以利物，故及王侯也。 故七祖生天堂，煌煌景敷也。 啸歌观太漠。 歌咏灵智之音也。 一音罗罩，观於太漠之道，道合之欢，自然合天乐，天乐适我娱也。 齐馨无上德。 馨，受也。 七祖及君人，同我受无上德也，非下仙之俦类故也。 妙想合众妙，无事故玄觉也。 诜诜，济济，众美巡虚而逍遥游也。 第二 旋行蹑云纲，乘虚步玄纪。 吟咏帝一尊，百关自调理。 俯命八海童，仰携高仙子。 诸天散香花，萧然灵风起。 宿愿定命根，故致标高拟。 惧乐太上前，万劫犹未始。 旋行蹑云纲。 旋虚而行。 行，忘也。 足蹑法云之纲纪，乘虚步玄纪也。 吟咏，通性也。 性通则帝一尊自合我身，百关全而归之。 百关，身骨百节也，调适自合至理也。 俯命八海童。 会万物以为己体，故八方性海，一婴童也。 童，无心也。 天人所仰赖，仰担高仙子也。 诸天散香花。 天上地下，散真法华也。 境随心爽，玉书应境生也。 萧然灵风起。 萧然者，灵觉之风，萧萧然起也。 宿愿定命根。 无量劫来，宿集之愿，灵智无边，誓愿解悟，如此则命根久定，今当受之。 故致标高拟。 高拟，今得之也。 今得太上在我心前，道果无边，誓愿得遂，故惨乐合常继之。 万劫犹未始。 解常也。",
      "translated_text": "Bowing with reverence to the Supreme,\nincense burned to return to the Void Origin.\nLuminous radiance follows my return,\nthe Dharma-wheel likewise turns thrice.\nThe Mysterious Origin flourishes in the Four Greats,\nspiritual blessings extend to kings and lords.\nSeven generations of ancestors ascend to Heaven’s halls,\nresplendent, their glory unfurled.\nWhistling and singing, I contemplate the Great Vastness,\nheavenly music delights my joy.\nEqual in fragrance, the unsurpassed virtue,\nlesser immortals cannot compare.\nWondrous forms illumine the Mysterious Awakening,\nin throngs they roam the void in carefree wandering.\n\n*Bowing with reverence*: to *open* (稽) the *heart* (首) and *embody* (礼) it, allowing the wisdom-fire of the Supreme to burn away all bodily forms until pure. *Burning incense to return to the Void*: to *dissolve* (烧) all phenomena, where purity naturally returns to the Void—yet the Void does not return to the Supreme; the Supreme returns to itself, hence the phrase. *Luminous radiance follows my return*: \"I\" here is the realized Supreme; the Dharma-wheel turns thrice, completing its revolution in union with the Supreme. *The Mysterious Origin flourishes in the Four Greats*: \"Mysterious Origin\" means \"to follow\"; my Four Greats thrive in harmony with the Mysterious Dao. *Spiritual blessings extend to kings and lords*: spiritual wisdom and blessings converge, nurturing kin, serving rulers, and benefiting all beings—hence extending to kings and lords. Thus, *seven generations of ancestors ascend to Heaven’s halls*, their glory resplendent. *Whistling and singing, I contemplate the Great Vastness*: singing the tones of spiritual wisdom, a single sound pervades all, contemplating the Dao of the Great Vastness. In harmony with the Dao, joy naturally aligns with heavenly music, *heavenly music delights my joy*. *Equal in fragrance, the unsurpassed virtue*: \"fragrance\" means \"to receive\"; ancestors and rulers alike receive the unsurpassed virtue with me, for they are not the companions of lesser immortals. *Wondrous thoughts merge with all wonders*, hence the Mysterious Awakening. *In throngs* (诜诜), in splendid array, the multitude roams the void in carefree wandering.\n\n**Second**\n\nCircling in flight, treading the net of clouds,\nriding the void, pacing the Mysterious Record.\nChanting the hymn to the Imperial Unity,\na hundred joints naturally harmonize.\nBending to command the lads of the Eight Seas,\nlooking up to carry the lofty immortals.\nAll heavens scatter fragrant flowers,\na serene numinous wind arises.\nLong-held vows root the destiny,\nthus attaining the lofty aspiration.\nReverent joy before the Supreme—\nten thousand kalpas are but a beginning.\n\n*Circling in flight, treading the net of clouds*: circling the void in motion, *motion* (行) as in *forgetting*. Feet tread the guiding principles of the Dharma-cloud, *riding the void, pacing the Mysterious Record*. *Chanting*: the nature’s communion. When the nature communes, the Imperial Unity naturally unites with my body, and the hundred joints return to wholeness. *Hundred joints*: the hundred bones of the body, naturally harmonizing with the supreme principle. *Bending to command the lads of the Eight Seas*: embracing all things as one’s own body, thus the eight directions’ seas of nature are but a single infant lad. *Lad*: without mind. *Looking up to carry the lofty immortals*: what heaven and earth rely upon. *All heavens scatter fragrant flowers*: scattering the true Dharma-flower above and below. *The realm follows the heart’s clarity*, and jade scriptures arise in response to the realm. *A serene numinous wind arises*: the wind of spiritual awakening, rising in serene whispers. *Long-held vows root the destiny*: the vows accumulated over countless kalpas, boundless spiritual wisdom, pledged to enlightenment—thus the root of destiny is long established, now to be received. *Thus attaining the lofty aspiration*: the lofty aspiration is now fulfilled. With the Supreme present in my heart, the Dao-fruit is boundless, and vows are fulfilled—hence reverent joy abides in constancy. *Ten thousand kalpas are but a beginning*: the unraveling of eternity.",
      "overlap_context": "d flowers and leaves. When the heart connects with the mysterious Dao, the spirit chants while pacing the void, traversing the scriptures. The adept’s spiritual awakening is called *scripture*; observation follows sound in wandering—hence *chanting*.\n\nAs for *bowing with reverence*, there are three kinds, as commonly understood. Here, given the purport of savoring and chanting, it is fitting to interpret from the heart’s resonance.\n\n*The Supreme Cavern-Mystery Pacing the Void Sutra Chant: First*",
      "start_char": 1766,
      "end_char": 2488,
      "start_sentence": 108,
      "end_sentence": 168,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.316060781478882,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\赞颂类\\洞玄灵宝升玄步虚章序疏.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "第三 嵯峨玄都山，十方宗皇一。 岧岧天宝台，光明焰流日。 炜烨玉华林，蒨璨耀朱实。 常念餐元精，炼液固形质。 金光散紫微，窈窕玄都逸。 嵯峨玄都山。 说境净法体嵯峨，玄道都会法山也。 十方宗皇一。 皇一，智净之心尊也。 悟则识摄包十方玄都，同宗归皇一之尊也。 岧岧天宝台。 会万物为己身也。 境智一照，光明焰流日也。 日月之光翳然无用，日光度也。 下释云炜烨玉林华，蒨粲曜朱实，是也。 常念养元精。 却述习观时也。 元精，灵智也。 日观练爽易死炁，故根形质遂成金光法体，散焕我身，生紫微之宅，窈窕在玄都舍游逸。 后人改为大乘者，愚之极也。 乘是运载之趣向也，玄都是至道室宅之极场也。 以趣向信仰至之，如人行时，劳逸殊极也。 第四 俯仰存太上，华景秀丹田。 左顾提郁仪，右盼携结璘。 六度冠梵行，道德随日新。 宿命积福庆，闻经若至亲。 天挺超世才，乐诵希微篇。 冲虚太和气，吐纳流霞津。 胎息静百关，寥寥究三便。 泥丸洞明景，遂成金华仙。 魔王敬受事，故能朝诸天。 皆从斋戒起，累功结宿绿。 飞行浚太虚，提擭高上人。 俯仰存太上。 此中诸章，各别立观门，养味吟咏之习门。 习门异者，颂云景悟归宗一是也。 章章自断，不相涉也。 今俯仰存太上者。 存，心也。 形行有俯仰，心行有存想，行心得神妙，妙想自摄，形从神也。 存神顺太上而动，太上从神而行，故俯仰之身等太上，太上从神而归我，故华景秀丹田也。 左顾下举郁仪结璘等，从觉智所携摄。 六度所冠盖，盖为梵行，故道德随日新而成也。 宿命积福庆者。 述能如上行者，即是宿习来久，今则尊重，行至不退。 闻经如至亲。 积福应也。 至亲父母，如人久离父母，忽见之意也。 经为法母，道为法父，遇之则忻适尊重而行有宿命。 天挺超世才。 故乐诵希微之二篇也。 无声日希，无形日微。 若无宿习系持业力，故不信经，闻知不闻。 纵使行之，少时即退，无制持力也。 冲虚太和炁。 述正观习也。 冲，心也。 心得冲虚太和之妙炁，吐纳流照，霞津灌我身也。 亦名胎息。 如胎之定，如息无心，虚而安养，静百关也。 静则寥寂其心，了了明照，究三界之便门也。 泥丸，无为也，无为洞明於内，光景明照於外，真常盛明之道，故遂成金华仙也。 自然使魔王尊敬而受事，故能朝会於诸天。 皆从斋戒起。 却述初因宿习积万善於旷劫，荡元始之遗尘，故得身等法界，飞行凌太虚也。 摄＠会妙，提携高上人也。 第五 控辔适十方，旋憩玄景阿。 仰观劫仞台，俯盼紫云罗。 逍遥太上京，相与坐莲花。 积学为真人，恬然荣卫和。 永享无期寿，万桩奚足多。 控辔适十方。 控身辔心也，即以身从心而净，心辔身而行，乘之而适十方周遍，故旋憩止息，坐玄道之景，阿房之中，仰观身心坐劫仞之台，俯视回明，为紫云之所。 罗盖紫云，灵智极法，法云之色也。 坐之而逍遥，处太上玉京之场也。 圣友俱会，相与坐莲华也。 积学为真人。 却迷宿习来久，而今故得。 恬然荣卫和。 荣卫之法，实智和恬，胃府内和明也。 永得享受无穷无竟之寿，非万桩何足比，故奚足多也。 第六 大道师玄寂，升仙友无英。 公子度灵符，太一捧洞章。 舍利曜金姿，龙驾欻来迎。",
      "translated_text": "The third: Towering and majestic, the Dark Capital Mountain—\nthe ten directions revere the One Sovereign.\nLofty, the Terrace of Heavenly Treasure,\nits radiance flames like the streaming sun.\nResplendent, the Jade-Flower Grove,\ncrimson fruits gleam in dazzling splendor.\nEver mindful to nourish the primordial essence,\nrefining the fluid to solidify form and substance.\nGolden light scatters through the Purple Tenuity,\ngraceful and secluded, the Dark Capital’s leisure.\nTowering and majestic, the Dark Capital Mountain.\n\nIt speaks of the realm’s purity, the Dharma-body’s majesty—\nthe Dark Capital is the mountain where the mysterious Dao convenes.\nThe ten directions revere the One Sovereign:\nthe One Sovereign is the honored heart of wisdom’s purity.\nIn awakening, one recognizes that the Dark Capital encompasses the ten directions,\nall converging in reverence to the One Sovereign’s honor.\nLofty, the Terrace of Heavenly Treasure:\nit unites the myriad things as one’s own body.\nWhen realm and wisdom illumine as one,\nradiance flames like the streaming sun.\nThe light of sun and moon becomes dim and useless—\nthis is the sun’s light transcended.\nBelow, it is explained: resplendent, the Jade-Flower Grove,\ncrimson fruits gleam in dazzling splendor.\n\nEver mindful to nourish the primordial essence:\nthis recounts the practice of contemplation.\nPrimordial essence is numinous wisdom.\nDaily contemplation refines clarity and transforms the qi of mortality,\nthus the root of form and substance becomes a body of golden light.\nScattering brilliance through my being,\nit gives rise to the Purple Tenuity’s abode,\ngraceful and secluded, wandering freely in the Dark Capital’s dwelling.\nThose who later altered this to \"Mahayana\" reached the height of folly.\n\"Vehicle\" denotes the direction of conveyance—\nthe Dark Capital is the supreme chamber of the ultimate Dao.\nTo approach it through faith and devotion\nis like a traveler whose weariness and ease reach their extremes.\n\nThe fourth: In reverence, I hold the Supreme in mind,\nthe Flowery Radiance beautifies the cinnabar field.\nGazing left, I lift the Somber Luminant;\nglancing right, I carry the Linked Brilliance.\nThe Six Perfections crown the brahmic conduct,\nvirtue and power renew with each passing day.\nAccumulated blessings from past lives bring felicity—\nhearing the sutras is like meeting one’s closest kin.\nHeaven-endowed with transcendent talent,\njoyfully reciting the subtle and wondrous scriptures.\nThe qi of profound emptiness and great harmony,\nexhaling and inhaling the flowing rosy mist.\nFetal breathing stills the hundred passages,\nin solitude, mastering the three expedients.\nThe Mud-Pill Palace shines with luminous radiance,\nthus becoming an Immortal of Golden Flower.\nThe Demon King pays homage and receives his charge,\nenabling him to ascend and attend the heavens.\nAll begins with fasting and precepts,\naccumulating merit to weave past connections.\nSoaring through the vast void,\nuplifting the lofty ones.\n\nIn reverence, I hold the Supreme in mind:\neach of these chapters establishes a distinct contemplative gate,\na practice of nurturing and savoring through chanting.\nThe gates differ—\nthe ode declares that radiant awakening returns to the One Source.\nEach chapter stands alone, without overlap.\nNow, \"in reverence, I hold the Supreme in mind\":\n\"Hold\" is the heart.\nThe body’s movements have reverence and deference;\nthe heart’s movements have contemplation and visualization.\nWhen conduct and heart attain the numinous and wondrous,\nwondrous thoughts naturally gather,\nand the body follows the spirit.\nThe heart holds the spirit, moving in accord with the Supreme;\nthe Supreme follows the spirit to act.\nThus the reverent body equals the Supreme,\nand the Supreme, following the spirit, returns to me—\nhence the Flowery Radiance beautifies the cinnabar field.\nGazing left below, lifting the Somber Luminant and Linked Brilliance,\nall are carried by awakened wisdom.\nThe Six Perfections serve as its crown,\ncrowning the brahmic conduct—\nthus virtue and power renew with each passing day.\n\nAccumulated blessings from past lives:\nthis describes one who practices as above,\nwhose past cultivation spans eons,\nnow honored and advancing without regression.\nHearing the sutras is like meeting one’s closest kin:\nthe response to accumulated blessings.\nLike parents, the closest kin—\nthe feeling of suddenly encountering them after long separation.\nThe sutras are the Dharma-mother,\nthe Dao the Dharma-father.\nMeeting them brings joy and reverence,\nand one’s conduct reflects past connections.\nHeaven-endowed with transcendent talent,\nthus delighting in reciting the subtle and wondrous two scriptures.\n\"Subtle\" denotes the soundless,\n\"wondrous\" the formless.\nWithout past cultivation sustaining karmic force,\none would not believe in the sutras,\nhearing yet not knowing they are heard.\nEven if practiced, one would soon regress,\nlacking the power of restraint.\n\nThe qi of profound emptiness and great harmony:\nthis describes the practice of right contemplation.\n\"Profound\" is the heart.\nThe heart attains the wondrous qi of profound emptiness and great harmony,\nexhaling and inhaling the flowing radiance,\nthe rosy mist irrigating my being.\nThis is also called fetal breathing.\nLike a fetus at rest,\nbreathing without conscious effort,\nempty and at ease, nurturing—\nstilling the hundred passages.\nStillness makes the heart solitary and serene,\nbrightly illumined,\nmastering the expedient gates of the three realms.\nThe Mud-Pill is non-action;\nnon-action illumines within,\nlight and radiance shine without—\nthe Dao of true constancy, flourishing and luminous.\nThus one becomes an Immortal of Golden Flower.\nNaturally, the Demon King respects and receives his charge,\nenabling him to ascend and attend the heavens.\nAll begins with fasting and precepts:\nthis recounts how, from the outset,\npast cultivation accumulated myriad virtues across vast kalpas,\nsweeping away the dust left by the Primordial Beginning.\nThus the body equals the Dharma-realm,\nsoaring and traversing the vast void.\nGathering and uniting the wondrous,\nuplifting the lofty ones.\n\nThe fifth: Guiding the reins to the ten directions,\ncircling to rest in the Dark Radiance’s expanse.\nGazing up at the Terrace of Kalpas,\nlooking down upon the Purple Cloud Net.\nCarefree in the Supreme Capital,\ntogether seated upon lotus flowers.\nAccumulated learning makes one a Perfected Person,\ntranquil, the constructive and protective forces harmonize.\nForever enjoying boundless life,\nhow could ten thousand kinds compare?\n\nGuiding the reins to the ten directions:\nguiding the body, reining the heart—\nthe body follows the heart to purity,\nthe heart reins the body to act.\nRiding this, one reaches the ten directions, pervading all—\nthus circling to rest and pause,\nseated in the Dark Dao’s radiance,\nwithin the Aligned Chambers.\nGazing up, body and heart sit upon the Terrace of Kalpas;\nlooking down, turning to brightness,\nenveloped by the Purple Cloud.\nThe Purple Cloud’s canopy—\nthe color of the Dharma-cloud, the apex of numinous wisdom.\nSeated thus, carefree,\ndwelling in the Supreme’s Jade Capital.\nHoly companions gather,\ntogether seated upon lotus flowers.\n\nAccumulated learning makes one a Perfected Person:\nthis dispels delusion—\npast cultivation spans eons, hence its attainment now.\nTranquil, the constructive and protective forces harmonize:\nthe method of constructive and protective forces—\ntrue wisdom harmonizes tranquility,\nthe stomach’s inner harmony and clarity.\nForever enjoying boundless, endless life—\nhow could ten thousand kinds compare? Hence, how could they be many?\n\nThe sixth: The Great Dao’s master is mysterious and quiescent,\nascending immortals befriend the Peerless Hero.\nThe Noble Scion bestows the numinous talisman,\nthe Great One bears the Cavern Scripture.\nSarira radiate a golden form,\nthe dragon-drawn chariot suddenly arrives to welcome.",
      "overlap_context": "sing in serene whispers. *Long-held vows root the destiny*: the vows accumulated over countless kalpas, boundless spiritual wisdom, pledged to enlightenment—thus the root of destiny is long established, now to be received. *Thus attaining the lofty aspiration*: the lofty aspiration is now fulfilled. With the Supreme present in my heart, the Dao-fruit is boundless, and vows are fulfilled—hence reverent joy abides in constancy. *Ten thousand kalpas are but a beginning*: the unraveling of eternity.",
      "start_char": 2489,
      "end_char": 3732,
      "start_sentence": 169,
      "end_sentence": 256,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.611820220947266,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\赞颂类\\洞玄灵宝升玄步虚章序疏.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "天尊盼云舆，飘飘乘虚翔。 香花若飞雪，氛霭茂玄梁。 头脑礼金阙，携手遨玉京。 大道师玄寂。 求大道者，宜用玄寂之境为师，师寂境於外，得元为於内，寂境即是无为，无为即是寂境，此得大道也，此即寂境为师也。 故升仙友无英。 既与无英为友，灵符自转在我也。 无英公子，天真号也。 太乙帝君以洞章奉我也。 洞章，天中音也。 舍利，骨也。 洞章灌我骨相，骨相成金容之姿也。 龙驾欻然，空中来迎，纵辔而游，天尊携盻於我，云舆飘飘，与我乘虚而同翔也。 香华亘空界，如飞雪氛氛，晻蔼茂美，玄道之高梁。 头脑礼在金阙内，天尊携提执手，遨游坐玉京也。 第七 骞树玄景园，焕烂七宝林。 天兽三百名，狮子巨万寻。 飞龙踯躅呜，神凤应节吟。 灵风扇奇花，清香散人衿。 自无高仙才，焉能耽此心。 骞树玄景园。 景随心净，故景成七宝骞树，今即说景之妙，亦是心妙，乃设心智而说景，故云玄景园。 妙心照圆净之景，宝成七宝骞树，法界之园囿，故云焕烂七宝林。 天兽三百名。 自然法兽现於色像，为法王狮子自在，故有狮子之名。 三百名及巨万寻者，皆趣举员数耳。 至於名实无数，体大无穷也。 下列飞龙神凤，皆天兽别名也。 灵凤扇下，即说妙智也。 灵智朗净，威风奇势，扇万景而成光净之法，香华散人衿於境界也。 下文解出自无有高仙大圣之才智，焉能有耽玩如此之心也。 第八 严我九龙驾，乘虚以逍遥。 八天如指掌，六合何足辽。 众仙诵洞经，太上唱清谣。 香花随风散，玉音成紫霄。 五苦一时迸，八难顺经寥。 妙哉灵宝囿，兴此大法桥。 严我九龙驾。 严我者，以灵宝正智严装洗饰我五根四心，即成六通三明，以坦众＠之夷涂，故九龙驾也。 故云乘虚以逍遥。 八天如指掌，六合何足辽。 乘顺会万物为一体，众仙太上尊师良友不期自会，尽唱诵空洞谣歌而成教也。 故云香花随风散，玉音成紫霄。 紫霄景界色悉成经，故五苦之在一时，随经迸散，亦成经也。 八难亦然。 故云妙哉灵宝囿，兴此大法桥。 第九 天真帝一宫，霭霭冠耀灵。 流焕法轮纲，旋空入无形。 虚皇抚云璈，众真诵洞经。 高仙拱手赞，弥劫保利贞。 天真帝一官。 官，身也。 体自然之道，故为天真自处，真帝至一之宅。 宅，帝一宅也。 蔼蔼之体，周冠曜灵也。 身之法体，流光焕烂，为法桥纲纪也。 轮转合虚无，大道旋空入无形也。 虚皇众真，欻然而至，为大师友，抚云璈而歌，齐诵洞经而成於我也。 高仙敛手赞庆成也。 弥劫保利贞。 合常也。 第十",
      "translated_text": "The Heavenly Worthy gazes upon the cloud-chariot,\nfloating, floating—riding the void in flight.\nFragrant blossoms like swirling snow,\nmist and haze flourish upon the dark beams.\n\nBowing in reverence toward the Golden Portal,\nhand in hand they roam the Jade Capital.\nThe Great Dao’s master is mysterious and quiescent.\nThose who seek the Great Dao\nshould take the realm of mysterious quiescence as their master.\nMastering quiescence externally,\nthey attain the primordial internally.\nQuiescence is non-action;\nnon-action is quiescence—\nthus is the Great Dao attained,\nthus is quiescence made one’s master.\n\nHence, they ascend as companions to the Peerless Hero.\nHaving befriended the Peerless Hero,\nthe numinous talisman naturally turns within me.\nThe Peerless Hero is the title of a celestial perfected.\nThe Supreme One of the Great Unity offers me the Cavern Scripture.\nThe Cavern Scripture is the celestial sound.\nSarira are the bones.\nThe Cavern Scripture washes my bone-form,\nand my bone-form assumes a golden countenance.\n\nThe dragon-drawn chariot suddenly arrives in the void to welcome,\nreining freely as we roam.\nThe Heavenly Worthy gazes upon me,\nthe cloud-chariot floating, floating—\ntogether we ride the void in flight.\nFragrant blossoms span the celestial realm,\nlike swirling snow in boundless haze,\nlush and splendid, the lofty beams of the dark Dao.\nBowing in reverence within the Golden Portal,\nthe Heavenly Worthy takes my hand,\nand we roam, seated in the Jade Capital.\n\n---\n\nThe seventh:\nThe towering trees of the Dark Radiance Garden,\nresplendent with the Seven Treasures’ grove.\nThree hundred celestial beasts in name,\nlions vast as ten thousand *xun*.\nFlying dragons pace and roar,\ndivine phoenixes chant in harmony.\nA numinous breeze fans rare blossoms,\ntheir pure fragrance scattering upon one’s lapels.\nWithout the talent of a lofty immortal,\nhow could one indulge such a heart?\n\nThe towering trees of the Dark Radiance Garden.\nRadiance follows a pure heart,\nhence the radiance forms Seven Treasures’ towering trees.\nNow, speaking of radiance’s wonder\nis also speaking of the heart’s wonder—\nthus, setting forth the heart’s wisdom to describe radiance,\nit is called the Dark Radiance Garden.\nThe wondrous heart illumines the perfectly pure radiance,\nand the treasure forms the Seven Treasures’ towering trees,\nthe garden of the Dharma-realm—\nhence, resplendent with the Seven Treasures’ grove.\n\nThree hundred celestial beasts in name.\nSpontaneous Dharma-beasts manifest in form,\nas the Dharma-king lion abides in freedom,\nhence the name \"lion.\"\nThree hundred names and vast as ten thousand *xun*—\nthese are but approximate counts.\nIn truth, their names and forms are numberless,\ntheir bodies vast and boundless.\nBelow, flying dragons and divine phoenixes\nare alternate names for celestial beasts.\nBeneath the divine phoenix’s fan,\nthe wondrous wisdom is expounded.\nWith luminous purity of numinous wisdom,\nits majestic wind and marvelous power\nfans the myriad scenes into the Dharma of radiant purity,\nfragrant blossoms scattering upon one’s lapels in the realm.\n\nThe following verse reveals:\nwithout the talent and wisdom of a lofty immortal and great sage,\nhow could one possess a heart to delight in such things?\n\n---\n\nThe eighth:\nAdorning my nine-dragon chariot,\nI ride the void in carefree roaming.\nThe eight heavens are like the palm of one’s hand,\nhow could the six directions be distant?\nThe assembled immortals chant the Cavern Scripture,\nthe Supreme One sings a pure melody.\nFragrant blossoms scatter with the wind,\njade tones ascend into the Purple Empyrean.\nThe Five Sufferings all burst forth at once,\nthe Eight Difficulties follow the scripture’s emptiness.\nWondrous indeed is the Numinous Treasure’s garden,\ngiving rise to this great Dharma-bridge.\n\nAdorning my nine-dragon chariot.\n\"Adorning me\" means that the Numinous Treasure’s true wisdom\nadorns and purifies my five faculties and four hearts,\nforming the six penetrations and three clarities,\npaving the level path of the multitude—\nhence, the nine-dragon chariot.\nThus, it is said: riding the void in carefree roaming.\n\nThe eight heavens are like the palm of one’s hand,\nhow could the six directions be distant?\nRiding in accord, the myriad things become one body.\nThe Supreme One, the honored teacher, and good companions\ngather without prior arrangement,\nall chanting and singing the empty cavern’s melodies to establish the teaching.\nThus, fragrant blossoms scatter with the wind,\njade tones ascend into the Purple Empyrean.\nThe Purple Empyrean’s realm and forms all become scripture,\nhence the Five Sufferings, in an instant,\nscatter with the scripture—\nthey too become scripture.\nThe Eight Difficulties are likewise.\nThus, it is said: wondrous indeed is the Numinous Treasure’s garden,\ngiving rise to this great Dharma-bridge.\n\n---\n\nThe ninth:\nThe Palace of the Heavenly Perfected and Imperial Unity,\nits misty radiance crowning the numinous.\nFlowing and resplendent, the Dharma-wheel’s net,\nspinning through the void to enter formlessness.\nThe August Void strums the cloud-zither,\nthe assembled perfected chant the Cavern Scripture.\nLofty immortals cup their hands in praise,\nthrough endless kalpas preserving integrity and purity.\n\nThe Palace of the Heavenly Perfected and Imperial Unity.\n\"Palace\" is the body.\nEmbodying the spontaneous Dao,\nit is the dwelling of the Heavenly Perfected,\nthe abode of the true Imperial Unity.\n\"Abode\" is the dwelling of the Imperial Unity.\nIts misty form crowns the numinous radiance.\nThe Dharma-body of the self\nflows with luminous splendor,\nbecoming the net of the Dharma-bridge’s principles.\nThe wheel turns to merge with the void,\nthe Great Dao spinning through the void to enter formlessness.\nThe August Void and the assembled perfected\nsuddenly arrive as great teachers and companions,\nstrumming the cloud-zither and singing,\ntogether chanting the Cavern Scripture to perfect me.\nLofty immortals cup their hands in praise and celebration.\nThrough endless kalpas preserving integrity and purity—\nthis is the constant.",
      "overlap_context": "tive and protective forces—\ntrue wisdom harmonizes tranquility,\nthe stomach’s inner harmony and clarity.\nForever enjoying boundless, endless life—\nhow could ten thousand kinds compare? Hence, how could they be many?\n\nThe sixth: The Great Dao’s master is mysterious and quiescent,\nascending immortals befriend the Peerless Hero.\nThe Noble Scion bestows the numinous talisman,\nthe Great One bears the Cavern Scripture.\nSarira radiate a golden form,\nthe dragon-drawn chariot suddenly arrives to welcome.",
      "start_char": 3732,
      "end_char": 4709,
      "start_sentence": 257,
      "end_sentence": 321,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.08403706550598,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\赞颂类\\洞玄灵宝升玄步虚章序疏.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "至真无所待，时或辔飞龙。 长斋会玄都，呜玉扣琼钟。 十华诸仙集，紫姻结成官。 宝盖罗太上，真人把芙蓉。 散华陈我愿，握节征魔王。 法鼓会群仙，灵唱靡不同。 无可无不可，思与希微通。 至真无所待，时或辔飞龙。 体洽於至真，故能无物而不乘，无形而不载，故无所待也。 时或辔飞龙也。 长斋洗心既净，自然玄会於玄都。 呜玉扣琼钟者。 有召其法鼓，自然呜也。 十华下即众圣应而会集也。 吐紫姻自成自然官观也。 宝益者，法冠。 盖以会太上自有无量真仙把芙蓉法华幢，盖供养空生也，皆散法智之华，陈列成我宿愿，宿愿成智慧无边誓愿，解今陈其愿得遂也。 握节征魔王。 亦遂愿断事也。 法鼓者，即法智之鼓，摄会群神。 灵唱靡不同也。 故有无可无不可，思与希微通。 内明则外用，故内思自通，希微也。 洞玄灵宝升玄步虚章序疏竟",
      "translated_text": "The Utmost Perfected awaits nothing,\nat times reining in flying dragons.\nWith long fasts they gather in the Mystic Capital,\nstriking jade to sound the jasper bells.\nThe Ten Flowers host the assembled immortals,\npurple mists congeal to form their palace.\nJeweled canopies array the Most High,\nPerfected Ones grasp lotus blossoms.\nScattering flowers, they present my vows,\ngrasping the tally to subdue the Demon King.\nThe Dharma-drum summons the host of immortals,\ntheir numinous chants harmonize without discord.\nNo can, no cannot—\nthought merges with the subtle and imperceptible.\nThe Utmost Perfected awaits nothing,\nat times reining in flying dragons.\n\nEmbodied in the Utmost Perfection,\nthey ride all things without obstruction,\nbear all forms without support—\nthus they await nothing.\nAt times reining in flying dragons.\nWith prolonged fasting and purified hearts,\nthey naturally converge in the Mystic Capital.\nStriking jade to sound the jasper bells—\nthe Dharma-drum summons, and they respond.\nBeneath the Ten Flowers, the host of sages gathers.\nPurple mists exhale to form their natural abode.\nThe jeweled canopy is the Dharma-crown,\narrayed for the Most High.\nCountless Perfected Ones hold lotus Dharma-banners,\noffering to the emptiness-born.\nAll scatter the flowers of Dharma-wisdom,\narraying them to fulfill my past vows.\nPast vows become boundless wisdom and resolve—\nnow their fulfillment is attained.\nGrasping the tally to subdue the Demon King,\nthey accomplish the vow to sever delusion.\nThe Dharma-drum is the drum of Dharma-wisdom,\nassembling the host of spirits.\nTheir numinous chants harmonize without discord.\nThus there is no can, no cannot—\nthought merges with the subtle and imperceptible.\nInner illumination manifests outer function,\nso inner thought naturally communes with the subtle.\n*Commentary on the Preface to the \"Ascending the Mystic\" and \"Pacing the Void\" Chapters of the Cavernous Mystery Numinous Treasure Concluded*",
      "overlap_context": "h luminous splendor,\nbecoming the net of the Dharma-bridge’s principles.\nThe wheel turns to merge with the void,\nthe Great Dao spinning through the void to enter formlessness.\nThe August Void and the assembled perfected\nsuddenly arrive as great teachers and companions,\nstrumming the cloud-zither and singing,\ntogether chanting the Cavern Scripture to perfect me.\nLofty immortals cup their hands in praise and celebration.\nThrough endless kalpas preserving integrity and purity—\nthis is the constant.",
      "start_char": 4709,
      "end_char": 5045,
      "start_sentence": 322,
      "end_sentence": 345,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.256787538528442,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\赞颂类\\洞玄灵宝升玄步虚章序疏.txt",
        "category": "赞颂类"
      }
    }
  ]
}