{
  "source_id": "洞真太上紫度炎光神元变经",
  "source_file": "chunked_daozang\\洞真太上紫度炎光神元变经.json",
  "total_chunks": 11,
  "total_original_chars": 12144,
  "total_translated_chars": 77547,
  "total_translation_time": 378.9658637046814,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\洞真太上紫度炎光神元变经.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Cavernous Perfection Scripture of the Supreme Venerable One on the Purple Ascension, Flaming Radiance, and Mysterious Transformations**\n\n**Scripture Title:** *The Cavernous Perfection Scripture of the Supreme Venerable One on the Purple Ascension, Flaming Radiance, and Mysterious Transformations*. Author unknown, approximately dated to the Eastern Jin dynasty. A foundational scripture of the early Shangqing tradition. One fascicle. Base text from *The Orthodox Daoist Canon*, Zhengyi Section, First Division.\n\n---\n\n### *The Purple Ascension and Flaming Radiance: Preface*\n\nThe *Purple Ascension and Flaming Radiance* is not a text with an original composition; rather, it is a divine scripture that coalesced from the void, its qi congealing into chapters. Its mysterious radiance blazes forth, accumulating over seven thousand years before its words manifested.\n\nThe Celestial Emperor of the Grand Tenuity bound its chapters with purple orchids and inscribed its main text upon golden tablets, thus recording it as *The Scripture of the Purple Ascension, Flaming Radiance, and Mysterious Transformations*. The *Scripture of Mysterious Transformations* derives its name from the transformations within the Mystery.\n\nOnce the mysterious chapters were established, the Highest Jade Sovereign commanded three thousand Golden Dawn Jade Lads and three thousand Western Flower Jade Maidens to attend upon the text, guarding it within the Purple Chamber of the Supreme Six Harmonies. The Primordial Lord of the Southern Culmen presides over it.\n\n---\n\n### *Record of the Celestial Emperor of the Grand Tenuity*\n\nThe Celestial Emperor of the Grand Tenuity was born at the inception of the Primordial Azure, his luminous essence penetrating the Mystery. At the very beginning, before qi had coalesced, he formed the ancestral method of the Fragrant Lineage. His radiance connected with the numinous, purple clouds flashing like lightning, mysterious mists flowing like mist, and cinnabar brilliance entwining all. Subtle awakening arose in concealment, and he absorbed the supreme契, unfolding in pure harmony. Exhaling and inhaling the dark tides, he descended into the womb of a numinous being, nourished by the curved mushrooms of the Dharma Spring.\n\nAt fourteen years of age, his golden countenance shone from within, and jade splendor radiated without. His wisdom was cavernous, his spirit keen, and he clearly perceived the Void and the Mystery. He was entrusted with the imperial title and charged with purifying the rosy clouds of the Nine Empyreans, gazing upon the source of the Cavernous Clarity. He discerned the mechanisms of the Utmost Mystery, mastered the convergence of myriad streams, accumulated resonance in the dark convergence, and awakened the wondrous spontaneity of nature.\n\nThus, he obtained the method of riding the *Purple Ascension and Flaming Radiance* to return the spirit, soar through the empyrean, and ascend to the exalted heights of the Jade Clarity. When his Dao was complete, he transmitted it to the Central Yellow Venerable Lord.\n\n---\n\n### *The Queen Mother of the West Bestows the Scripture and Composes Three Hymns*\n\n**First Hymn:**\nShe chants and sings on the Ninefold Mystery Terrace,\nWhere cliffs and ridges congeal in chill clarity.\nHer mind aligns the six senses,\nHer eyes cast off the dust and dregs.\nFlowing rosy clouds illuminate the golden chamber,\nThe empty hall disperses mysterious fragrance.\nAccumulated resonance summons the descent of the numinous,\nThough form is solitary, its concealment is also divided.\nIn an instant, she gazes upon ten thousand kalpas,\nHow could she perceive the span of a billion cedars?\nThe flourishing garden embellishes the numinous steps,\nCinnabar jade glows in the courtyard of gems.\nThe flowing wind scatters through the Cavernous Void,\nJade pipes ride the luminous emptiness.\nPurple mist entwines the curved script,\nCinnabar radiance reflects the green canopy.\nFlying banners flourish beneath the mysterious canopy,\nFeathered tablets gleam in the Purple Clarity.\nAscending the light to the borders of the Nine Empyreans,\nShe roams and plays in the Phoenix City.\nShe wishes to receive the honored disciple,\nTo share one joy with those born at dawn.\n\n**Second Hymn:**\nShe soars with reins, guiding the mysterious radiance,\nResting in the light beyond the wilds.\nWandering in search of the numinous one,\nShe joins her form in celebration at the empyrean’s edge.\nHer hands part the vermilion gates,\nHer eyes are as vast as the divine surge.\nThe golden towers rise in majestic splendor,\nThe clear scene is free of dust and filth.\nShe loosens her robe at the Terrace of the Mysterious Vault,\nFulfilling my deepest wishes.\nDiscarding her sandals, she transcends the three difficulties,\nPreserving refinement to secure longevity.\n\n**Third Hymn:**\n*(Translation of the third hymn omitted in the provided text.)*\n\n---\n\n### *The Method of Summoning the Unbounded and Observing the Heavens Within the Central Quadrant of the Purple Ascension and Flaming Radiance*\n\nAt the inception of the Celestial Emperor’s formation, he studied the Dao of summoning the perfected. With distant thoughts and far-reaching vision, he contemplated inwardly, sitting in observation of the boundless. His cavernous contemplation pierced the hidden void. At the age of three, he mastered the central quadrant, his true spirit unveiled in clarity. He foresaw what had not yet come to pass, exhaustively surveying the bounds of the utmost heavens. No mystery was left unilluminated, no height left unattended, no depth left unregarded. Thus, he received the title of Great Emperor, bestowed through accumulated resonance—how could it have been his natural endowment?\n\nHe regularly performed this at dawn, when the celestial light had not yet brightened, and the pure radiance first emerged. He rubbed his hands together until warm, then wiped his eyes and their four corners twenty-one times. He clicked his teeth twenty-four times, swirled his tongue around his mouth, top and bottom, until the mushroom elixir and saliva arose together, and swallowed the saliva nine times.\n\nUpon completion, he covered his body with a cap and robe, lay down in stillness, and aligned the central quadrant. He ensured both inner and outer quietude, hearing no sounds. Covering his ears with his hands and closing his eyes, he inwardly visualized his body nine myriad *li* to the east, seeing mountains, rivers, grasses, trees, birds, beasts, and the peoples of the Hu and Yue as if before his eyes. He made them distinct and precise, without wavering in his contemplation. With prolonged practice, he naturally saw them.\n\nOnce they became distinct, he heard the resonant sounds of bells and drums in his ears. After a long while, he saw the immortal officials of the Eastern Marchmount, riding azure dragons and azure clouds, holding the five sacred mushrooms. They were accompanied by twelve jade maidens, clad in flying azure feathered skirts, bearing the Azure Essence Jade Embryo in a golden tray, offering it to his body.\n\nUpon seeing the immortal officials, he bowed in reverence and received it, consuming it. He tasted its sweetness, then wiped his eyes and swallowed qi nine times before stopping.\n\nAfter three years of such practice, he could see events ten thousand *li* away and hear sounds from ten thousand *li* distant, all with perfect clarity. He foresaw future auspices and inauspicious omens, the length of years, and the portents of life. His body emitted wondrous radiance, and he perceived both the exterior and interior with cavernous vision.\n\nThe Dao of summoning the unbounded is supremely wondrous; it is transmitted orally and not committed to writing.\n\nNext, he contemplated in the same manner, inwardly visualizing nine myriad *li* to the south, seeing mountains, rivers, grasses, trees, the earth’s hues, birds, beasts, and the peoples of Yue, all as if before his eyes. He made them distinct and precise, without wavering in his contemplation. With prolonged practice, he naturally saw them.\n\nOnce they became distinct, he heard the clamor of a hundred pipes in his ears. After a long while, he saw the immortal officials of the Southern Marchmount, riding flying dragons beneath cloud canopies, holding flowered banners. They were accompanied by twelve jade maidens, clad in flying azure brocade skirts, bearing the Dark Net and Crimson Fruits in a golden tray, offering them to his body.\n\nUpon seeing the immortal officials, he bowed in reverence and received them, consuming them. He tasted their sourness, then wiped his eyes nine times before stopping.\n\nAfter three years of this practice, he naturally perceived the hidden depths of the void, his eyes seeing beyond ten thousand *li*, his ears hearing sounds from ten thousand *li* away. With prolonged cultivation, all became radiantly clear, and he could foreknow the auspicious and inauspicious events yet to come. His body took on the luster of jade, and his face shone with jade-like light. This is the Way of Summoning the Nonexistent.\n\nNext, he again contemplated as before, inwardly visualizing the lands nine ten-thousand *li* to the west: its mountains, rivers, earth’s hues, grasses, trees, birds, beasts, and the dark-haired elders, all as if before his eyes. He made them distinct and precise, without wavering in his contemplation. With prolonged practice, he naturally saw them.\n\nOnce they became distinct, he heard the clamor of gongs and drums in his ears. After a long while, he saw the immortal officials of the Western Marchmount, riding a flying chariot of pale mist, accompanied by twelve jade maidens clad in dark brocade skirts. They bore the Golden Liquid Elixir, held in a golden tray, and offered it to his body.\n\nUpon seeing the immortal officials, he bowed in reverence and received it, consuming it. He tasted its sweetness, then wiped his eyes and swallowed *qi* nine times before stopping.\n\nAfter three years of this, his vision became penetratingly clear, perceiving all events—auspicious and inauspicious, fortune and misfortune—beyond ten thousand *li* as if they had not yet come to pass. His face shone with golden light. This is the Way of Summoning the Nonexistent, a method so profound it cannot be transmitted in writing, only passed from mouth to mouth.\n\nNext, he contemplated as before, inwardly visualizing the lands nine ten-thousand *li* to the north: its mountains, rivers, earth’s hues, grasses, trees, birds, beasts, and the Qiang elders, all as if before his eyes. He made them distinct and precise, without wavering in his contemplation. With prolonged practice, he naturally saw them.\n\nOnce they became distinct, he heard the resonant chime of bells in his ears. After a long while, he saw the immortal officials of the Northern Marchmount, riding a flying chariot of dark clouds, holding the Five Mushrooms. They were accompanied by twelve jade maidens clad in dark brocade skirts, bearing the Jade Liquid and Langyu Elixir in a golden tray, offering them to his body.\n\nUpon seeing the immortal officials, he bowed in reverence and received them, consuming them. He tasted their bitterness, then wiped his eyes and swallowed *qi* nine times before stopping.\n\nAfter three years of this, he could perceive the eight directions, fathom the hidden and the void, and see beyond all limits while seated. His body became light, his essence bright, and he could sit or stand in empty space. This is the Way of Summoning the Nonexistent, so utterly true it defies description.\n\nNext, he contemplated as before, inwardly visualizing his own body piercing through to the palaces and terraces above the Nine Heavens, its mountains, forests, flying birds, and running beasts, the boundless edges of cloud cliffs, where he joined the assembled perfected ones and conversed with the host of immortals. He made them distinct and precise, without wavering in his contemplation. With prolonged practice, he naturally saw them clearly.\n\nOnce they became distinct, he heard in his ears the sounds of the five tones and chiming jade, as if audible. After a long while, he saw the immortal officials of the Central Marchmount, riding a dragon of yellow mist, accompanied by twelve jade maidens clad in yellow flying skirts. They held five-colored banners and bore the Five Mushroom Elixir in a golden tray, offering it to his body.\n\nUpon seeing the immortal officials, he bowed in reverence and received it, consuming it. He tasted its fragrance, then wiped his eyes and swallowed *qi* twelve times before stopping.\n\nThis is the Purple Radiance of the Blazing Light, the supreme and wondrous method of Summoning the Nonexistent, so profound it cannot be spoken aloud. After three years of practice, he perceived the hidden depths of the void, saw through the dark and mysterious, calculated lifespan and destiny, and discerned the omens of fortune and misfortune. His entire being became penetratingly clear, and his face shone with golden light.\n\nAfter visualizing the five directions, he rose and faced east, knocking his teeth nine times, and prayed:\n*\"The myriad transformations arise as one, the Dark Net governs the void. The turning wheel makes no sound, yet revolves through the four directions. Its flowing light spans ten thousand *li*, piercing through the empty vastness. The Three Essences, treasured luminaries, fly through the misty chambers. The morning essence infuses the dark, opening the nine apertures. The four convergences and eight reaches unite—visualizing the void to summon the nonexistent. May my spirit become wise, clearly discerning fortune and misfortune. Mounting the dark chariot, its green carriage poles soaring, I ascend to the Great Dawn and prostrate before the Jade Emperor.\"*\n\nThis is the method of the Celestial Lord’s inward visualization for Summoning the Nonexistent and penetrating sight, its efficacy immediate and unmatched. When contemplating the central direction with focused intent, after a hundred days in seclusion, faint signs will appear. After three years, the spirit will merge with the dark and penetrate all, nothing left unseen. This may be called summoning the true within the nonexistent, where the true descends. The Way is subtle and hidden, beyond worldly discourse.\n\nMen value rank and emolument; I value this Way. Even the lord of the four seas would find it difficult to obtain this method—I have never heard of it. This is the root of my undying Way: foreknowing the yet-to-be, perceiving the hidden and the void, measuring the boundless above, hearing echoes from ten thousand *li* away, and comprehending the wonders of the world—what could surpass it?\n\nThose who attain this will ride a green carriage, a canopy of flying mist and dark clouds, ascending to the Celestial Dawn. It must be treasured and kept secret; do not rashly transmit it. To violate this and reveal the true scripture is to burden oneself, one’s ancestral masters, the seven lineages, and parents with ghostly servitude, consigning the body to the dark springs and suffering the trials of the Three Officials. The hardships will be unbearable—beware and take heed.\n\nWhen receiving and practicing the Purple Radiance of the Blazing Light, the method of cultivating the true and Summoning the Nonexistent for penetrating sight, one should always do so in a separate, secluded chamber, free from worldly affairs. In stillness, contemplate and visualize the lands beyond ten thousand *li* in the four directions: their mountains, forests, grasses, trees, birds, beasts, peoples, the dark-haired Yi, Qiang, Hu, and Cang elders, and all strange beings, all coming to pay homage to one’s body.\n\nThen visualize one’s own eyes emitting flowing fire, like falling stars of crimson radiance, their light filling the space beyond ten thousand *li*. The mountains, marshes, Huai and Ji rivers, and forests all dissolve in this brilliance, the heavens becoming utterly clear and pure, free of dust and filth. The gaze reaches the boundless realm, penetrating all without obstruction.\n\nMake all this distinct and precise, knock the teeth nine times, and pray facing upward:\n*\"The dark light shines inwardly, penetrating all without limit. Sight and hearing become piercingly clear, the nine apertures open wide. Flowing essence rushes forth, ten thousand *li* of purity unobstructed. Seated, I perceive the natural, foreknowing fortune and misfortune. Mounting the flying mist, I ascend to the great void.\"*\n\nUpon completion, draw in *qi* and swallow saliva seven times, then cease.\n\nShould one cultivate this Dao, within a hundred days, faint traces will appear; in three years, the eyes will perceive the hollow void, seated one may see beyond ten thousand *li*, the ears hear sounds from ten thousand *li* away. The ultimate and wondrous Dao cannot be transmitted through writing—it is passed mouth to mouth, received with solemn secrecy.\n\n**Flowing Gold Fire Bell**\n\nThe Flowing Gold Fire Bell employs the radiant *qi* of the Most High Lord of the Great Dao in his wanderings and feasts, striking upward to rouse the might of the Nine Heavens, annihilating below the inauspicious forces of the Six Heavens. The void-reflected radiance of the Lord of the Dao crowns his neck, its flowing light illuminating the eight directions for three hundred thousand *li*.\n\nAt the inception of the Three Heavens’ rectification, when the Six Heavens were abolished, it was transmitted to the Celestial Emperor of the Grand Tenuity. The divine scripture is concealed within the Jade Palace’s chambers of crystal, its void-light self-luminous, resplendent in the Supreme Clarity. Flying dragons and venomous beasts flank its sides, purple clouds and dark radiance canopy its summit. Jade Flower maidens and Golden Perfected youths, three hundred each, attend the numinous scripture, scattering incense in the void courtyard.\n\nAfter seven thousand years, it transformed into five talismans, their light penetrating the eight directions, giving rise to the officials of the Five Quarters’ protective encampments. The Celestial Emperor of the Grand Tenuity transmitted it to the Posterior Sage Lord of the Golden Portals, who entrusted it to the Azure Lad of the Left Minister, charging him to confer it upon those who attain Perfected status, that they might wear it and wander the Supreme Clarity.\n\nThose who study the Real yet lack the Flowing Gold Fire Bell, whose necks do not bear the halo of radiance, shall not ascend to the Three Luminaries. Only those with bones of gold and jade, whose names are inscribed in the Azure Palace, may receive this scripture. Wearing it as they walk, all heavens and earths, the Four Seas and Five Peaks, the hosts of celestial saints and immortal officials, will bow in reverence, their divine lights startled into motion. Its command is not to be taken lightly: the Three Primes dispatch thirty-six Jade Lads and Maidens to attend and guard their person. After wearing it for nine years, one may ride the Eight Effulgences Jade Chariot, soaring through the Great Void.\n\nThe Flowing Gold Fire Bell is the essence of the Nine Stars, also called the Halo of Radiance. The mighty seal of the Most High arose before the Nine Heavens, congealing *qi* into script, its luminous brilliance blazing through the ten directions, its suspended essence casting its reflection upon the neck of the Most High. After ten thousand years, it transformed into five bell talismans of divine power, descending to the Celestial Emperor of the Grand Tenuity, who wielded its might to subdue the demons of the farthest heavens, its numinous presence spreading through the courts of the Nine Auroras, commanding all beneath the heavens without exception.\n\nThe Most High Lord of the Great Dao treasures and conceals this Dao, instructing the celestial overseers of the myriad heavens’ Perfected Immortals to investigate and punish those who lightly divulge it. Should one possess the talent of a Perfected Immortal and receive this talisman, yet transmit it carelessly to the unworthy, defiling the sacred scripture with irreverence, their seven ancestors will suffer calamity, their former masters will be examined, and all will be consigned to the offices of ghosts.\n\nInscribe it in vermilion upon two feet and two inches of purple silk, and wear it upon the head. Those with names of gold and bones of jade who receive this scripture are destined by past lives to become immortals. As they wear the talisman and move about, they must constantly visualize a halo of radiance crowning their necks, illuminating beyond three hundred thousand *li*. Within nine years, through diligent devotion to the Real, fasting with single-minded resolve, they may summon the descent of true numina, their halo shining of its own accord, allowing them to ride the void, seated or standing, to command life and death.\n\n**Five Bells Ascending Void, Treading Emptiness, Preserving Immortality Talisman—also called Fire Bell**\n\nWhen the Celestial Emperor of the Grand Tenuity first received *qi*, at the primordial division of the dark image, he ascended the Terrace of Ninefold Mystery’s Void Generation. The Five Thearchs’ divine officials guarded the eight directions; the five talismans’ void-reflected light flickered between presence and absence, veiled in mist upon the Phoenix Terrace, within the winding chambers of the crystal palace.\n\nAfter seven thousand years, the scripture manifested, its flowing light blazing through the Nine Heavens, its precious scripture glowing richly in the Jade Clarity. Cast to the left, it becomes the Flowing Gold Fire Bell; shaken to the right, it becomes the Diadem of the Seven Primes’ Dispersal, subduing the demons of the farthest heavens, its might spreading through the courts of the Nine Auroras. The ultimate and wondrous Dao is profound and subtle beyond measure.\n\nThe Celestial Emperor then fasted in the void upon the Crystal Terrace, within the Jade Chamber of the Cavern Real’s Hall, the Golden Flower’s chambers. Attendant maidens and host Perfected, ten myriad myriad multicolored divine officials, flying beasts and venomous dragons flanked the portals, guarding the gates. Serpents of a thousand *xun* patrolled the walls; phoenix cries and dragon roars, a hundred sounds, echoed through the halls. Might resounded through the vast courtyard; lions roared; celestial hymns were sung; jade tones flowed like scattered gems. Divine consorts harmonized in song; Jade Maidens plucked and strummed the strings.\n\nThereupon, I summoned the Central Yellow Thearch Lord Lao and the Four Perfected of the Great Ultimate, offering dew of flowing auroras and fruits of adamantine rings, red trees with white seeds, intertwined hidden mushrooms, and myriad fragrances wafting for ninety days.\n\nThen the Tortoise Mother held the brush, the Great One swept the mat, Heavenly Consorts attended the incense, Jade Flowers bound the scroll. Inscribed upon white jade slips in golden script, it was entrusted to the Left Duke of the Immortal Capital, sealed in a cloud-brocade satchel of jade cases, and transmitted to the Central Yellow Thearch Lord Lao. In accordance with the covenant, he received the Five Talismans, bowed, and withdrew. Immediately, he summoned the Nine Numinous Flowing Effulgence Cloud Chariot, fifty myriad Five-Colored Divine Officials, clad in azure kingfisher-feathered dragon capes, ascending to the Golden Portals and Jade Clarity’s palaces.\n\nShould one’s name be inscribed in the Eastern Florescence and behold this scripture, their past destiny calls them to immortality. Wearing the talisman as they walk, the myriad spirits come to pay homage. Emerging from the void, entering the constellations, circling the Five Peaks, traversing the Five Stars, their bodies generate water and fire, transforming the ten directions. After wearing it for nine years, green chariots descend to convey them upward to the Three Primes, where they ascend to the rank of Jade Clarity.\n\nThis Dao is secret and wondrous, transmitted only to the true. Those who lightly divulge its passages will perish, their forms destroyed. According to the luminous statutes of the Mysterious Real, it may be transmitted to one person every seven thousand years. Those who violate the covenant and betray their oaths will bring calamity upon their seven lineages, themselves and their former masters alike consigned to the lower ghosts, enduring ten torments and eight tribulations.\n\n**Azure Thearch, Azure Auroras, Flowing Bell, Ascending Void, Treading Emptiness, Supreme Talisman**\n\nThe Nine Thousand Perfected of the Eastern Azure Thearch’s Primal Cavern, Primal Clarity, Primal Radiance, and Extended Numinous Radiance, each accompanied by ninety Azure Yang Jade Lads attending the scripture to the left...\n\nThe Eastern Marchmount Mount Tai’s immortal officials, two thousand four hundred in number, with ninety Azure-Waisted Jade Maidens attending the numinous scripture to the right, guard and bear the talisman upon the body of so-and-so.\n\n**Crimson Thearch, Cinnabar Auroras, Flowing Bell, Ascending Void, Treading Emptiness, Supreme Talisman**\n\nThe Southern Thearch’s Primal Cavern, Primal Life, Great Numinous Mechanism, and Sovereign August Lords of the South, eight thousand each, with eighty Vermilion Palace Jade Lads attending the scripture to the left; the Southern Marchmount Mount Heng’s immortal officials, two thousand four hundred in number, with eighty Great Cinnabar Vermilion Jade Maidens attending the scripture to the right, guard and bear the talisman upon the body of so-and-so.\n\n**White Thearch, Azure Auroras, Flowing Bell, Ascending Void, Treading Emptiness, Supreme Talisman**\n\nThe Western Thearch’s Golden Citadel, Radiant Primal, Primal Guide, and Supreme Immortal Lords of the West, six thousand each, with sixty Effulgent Primal Transformation Jade Lads attending the scripture to the left; the Western Marchmount Mount Hua’s immortal officials, two thousand four hundred in number, with sixty Pristine Jade Maidens attending the scripture to the right, guard and bear the talisman upon the body of so-and-so.\n\n**Black Thearch, Verdant Auroras, Flowing Bell, Ascending Void, Treading Emptiness, Supreme Talisman**\n\nThe Northern Thearch’s Mysterious Cavern, Primal Yin, Five Radiant Extensions, and August Flowering Solitary Lords of the North, five thousand each, with fifty August Mechanism Supreme Ultimate Jade Lads attending the scripture to the left; the Northern Marchmount Mount Heng’s immortal officials, two thousand four hundred in number, with fifty Supreme Mystery Jade Maidens attending the scripture to the right, guard and bear the talisman upon the body of so-and-so.\n\n**Yellow Thearch, Verdant Auroras, Flowing Bell, Ascending Void, Treading Emptiness, Supreme Talisman**\n\nThe Central Thearch’s Central Radiance, Five Yang, Five Yin, and Central August Cavern Ultimate High Sovereign Lords, one thousand two hundred each, with twelve August Mechanism Upholding Center Jade Lads attending the scripture to the left; the Central Marchmount Mount Song’s immortal officials, two thousand four hundred in number, with twelve Yellow Pristine Jade Maidens attending the scripture to the right, guard and bear the talisman upon the body of so-and-so.\n\nMen inscribe in cinnabar upon azure silk and wear it to the left; women inscribe in yellow upon white silk and wear it to the right.\n\n**Flowing Gold Fire Bell, Internally Store the Invocation of Mighty Might, Divine Wisdom**\n\nWhen wearing the Flowing Gold Fire Bell, whether traveling near or far, passing through perilous places beset by bandits or illness, or beneath calamitous harm, one must concentrate on the true light to guard oneself, opening a path of ten thousand miles. At the outset of a journey, face directly toward the direction, strike the left teeth twice seven times, and swallow qi thirty-six times. Then visualize the forms of the place—its mountains, forests, grasses, trees, people, birds, beasts, and spirits—all clearly and brightly coming to pay homage to one’s body. Envision the Seven Stars of the Northern Dipper covering one’s head, then concentrate on one’s left eye as a Shooting Star and the right eye as Swift Lightning, their radiance blazing forth. The Shooting Star shines ninety thousand miles away, revealing the path ahead, its light parting mountains, forests, grasses, trees, people’s dwellings, soldiers, bandits, and ghostly qi, causing them to vanish without a trace, the four roads suddenly clear. Then recite the incantation:\n\n*\"Ahead opens, behind closes,\nHeaven levels, earth rises.\nDivine lords go forth,\nThe four roads open wide.\nLet heaven and earth\nBecome my bridge.\nBefore and behind, left and right,\nAll eight directions penetrate.\nTo the left, I cast the Shooting Star,\nTo the right, Swift Lightning’s glow.\nFlowing fire spans ten thousand miles—\nWhat demon dares stand before me?\nThe Great One escorts,\nTen thousand spirits come to greet.\nWherever I turn,\nAll is auspicious and good.\nRiding clouds, mounting the void,\nI ascend to the Great Emptiness.\"*\n\nWhen finished, draw the essence of both eyes back to their palaces. Inhale seven qi from the left, seven qi from the right, and swallow them. Thus, one may brave dangers and traverse difficulties, subdue ghosts and vanquish soldiers, with all responding instantly and resoundingly. This method is most wondrous and must not be recklessly transmitted.\n\nThe Five Thearchs’ Flowing Bells and Five Talismans command the demons of the utmost heavens, summon and bind the spirits of the five directions, correspond above to the Five Mornings and align with the Seven Origins, respond below to the human body’s nine orifices and seven luminaries, encircle heaven and earth, leaving nothing unconnected, no darkness unprobed, no detail unseen. When concentrating on the talisman, first store its power; when casting it, manifest its might. If you wear it, receive the master’s oral instructions.\n\nShould you encounter a place haunted by malevolent ghosts in the human realm, perform the Invocation of Mighty Might. Face north, hold the breath for twelve cycles, and envision the qi of the five directions covering your crown and entire body, inside and out, radiantly clear, with nothing visible. Then strike the teeth thirty-six times, swallow the qi of the five directions, and with each swallow, expel the qi of the three directions, allowing all to enter your body. Concentrate on the light of your eyes’ pupils like shooting stars, blazing in the five directions, and recite the incantation:\n\n*\"Celestial Origin’s Seven Essences,\nFive Thearchs’ Flowing Bells,\nBlazing, casting lightning’s glow,\nLike celestial shooting stars.\nRadiance illumines the ten directions,\nRevealing ghosts’ true forms.\nWhat petty demon\nDares approach my gate of life?\nThe Supreme has decreed:\nSlay without mercy,\nSever livers, carve bellies,\nExterminate ghostly essences.\nThousands upon thousands all shattered,\nMyriads upon myriads all toppled.\nDivine might utters the incantation,\nBinding and seizing without cease.\"*\n\nWhen finished, swallow qi thirty-six times to conclude. With this single incantation, the five directions’ divine officials will all protect your life, swiftly seizing the numinous qi of the place and binding it to appear before you. Three recitations will exterminate the ghost king’s lineage.\n\nWhen entering the Five Marchmounts, traversing mountains and rivers, braving dangers and scaling peaks, one must, a hundred paces before reaching the place, strike the left teeth thirty-six times. If going to the Eastern Marchmount, envision the Eastern Thearch’s Azure Emperor, the Rare Forest Pearl Officials and their retinue of nine thousand, guarding your front, back, left, and right, with the qi of Azure Auroras covering your crown. If going to the Southern Marchmount, envision the Southern Thearch’s Crimson Emperor, the Cinnabar Mystery Master and his retinue of eight thousand, guarding your front and back, with the qi of Vermilion Auroras covering your crown. If going to the Western Marchmount, envision the Western Thearch’s White Emperor, the Lesser Radiant Spirit and his retinue of five thousand, guarding your front and back, with the qi of Pristine Auroras covering your crown. If going to the Northern Marchmount, envision the Northern Thearch’s Black Emperor, the Mysterious Darkness Radiance and his retinue of five thousand, guarding your front and back, with the qi of Dark Auroras covering your crown. If going to the Central Marchmount, envision the Central Thearch’s Yellow Emperor, the Upholding Center Primal Officials and their retinue of twelve thousand, guarding your front and back, with the qi of Yellow covering your entire body. Then recite the incantation:\n\nThe Radiant Spirits of Qian Heaven, the Seven Luminaries’ Mysterious Essences, the Five Dipper’s Florid Canopy encircle and bind my form. Five-hued flying auroras intermingle and merge, my body girded with the Seven Primes, streaming with golden fire-bells, flashing and hurling boundlessly, reaching the utmost heights of heaven’s obscurity. The Five Thearchs’ divine officials command the celestial hosts to seize and restrain for me: the mountains and rivers, the earth gods, the thousand ghosts and ten thousand spirits all come to bow their heads, offering up their true forms. Those before are executed, those behind are slain—none captured escape. Thus concluded.\n\nWith this single incantation, the demons of heaven vanish without trace, and the myriad spirits come to pay homage. When roaming the Five Marchmounts, treading the mountains and rivers, you shall suffer no trials or perils. The immortals of the Five Marchmounts will themselves present the Five Mushrooms and Five Vital Jade Flowers to sustain your body.\n\nIf amidst military siege, beneath the hanging blades of execution, or in dire straits, knock the right teeth twelve times, envision the Seven Stars covering your body, their mysterious light penetrating and illuminating, surrounding you entirely. Envision the liver as Jupiter, emerging on the left; the lungs as Venus, emerging on the right; the heart as Mars, emerging before you; the kidneys as Mercury, emerging behind; the spleen as Saturn, emerging above the chest. Let the essences of the Five Stars coil around your front and back, your body dwelling within the Dipper’s Bowl, beneath the Five Stars.\n\nThen envision the Five Thearchs’ divine officials guarding your left and right, and recite the incantation:\nHeaven is my roof,\nEarth is my bed,\nThe Five Marchmounts and rivers are my bridges,\nThe Mysterious Dipper’s Primal Essence is my raiment.\nConcealed within the Seven Primes,\nIn the land of flowing fire,\nHe who measures me is Taiyi Wuyou,\nHe who passes me is Baiyuan Wuying.\nDisaster cannot assail,\nWeapons cannot harm.\nMay my body ascend to the Golden Gates,\nThe Capital of the Nine Elders.\nThus concluded.\n\nIn such dire straits, even at the brink of death, you shall attain liberation.\n\nFive bolts of five-colored brocade, each fifty feet in length, to entreat the divine officials of the Five Thearchs. Five taels of purple gold, as pledge of faith to the Five Directions. Five catties of agarwood, to ascend and reach the Three Primes. One tael of true pearls, as oath for the cinnabar covenant. One writing knife, to sever the path of deathly qi. Seven gold pearls, to offer to the essences of the Seven Primes. Seventy feet of crimson silk, to embody the qi of blazing radiance.\n\nFor all who receive the talismanic scriptures, they must present precious pledges to their master, purify themselves with a three-day fast, bathe, burn incense, and inscribe the talismans and scriptures. These are then placed in the open upon a high altar for one night. At dawn, master and disciple ascend the altar together, report to the Northern Thearch, present the covenant text, and transmit the talismanic scriptures to the disciple.\n\nShould one fail to ascend the altar and make the oath, they must not rashly open the scrolls. If the master carelessly divulges the scriptures, their body will suffer the trial of the wind-knife. If the disciple receives them but unfurls the scroll, calamity will extend to the Seven Mysteries, leaving them maimed and blind. The statutes of the Four Poles forbid the careless divulgence of scriptures; the laws of the Great Scriptures forbid transmission without covenant oaths. Unless one’s name is inscribed in gold and jade, they shall not hear or see them.\n\nFor those who seek immortality: without the Five Talismans worn upon the body, the immortal officials of the Five Marchmounts will not guard their form, the registers of the dead will not shed their mortal names. Dwelling in mountain caves, they will be overpowered by the Demon Kings of the Nine Heavens; venturing among men, they will not escape official oppression or the blade of weapons. Those who wear the talismans shall be sheltered by Heaven above, moving freely without restraint, their will circulating without hindrance.\n\nEnvisioning the perfected ones returning to their original palaces, the Five Mushrooms and Five Lives manifest, their bodies suffused with jade radiance. Immortal officials stand guard, the Three Primes attend their chambers, they ride clouds and mount the void, ascending to the Jade Clarity.\n\nOne hundred days after receiving the talismans, take five five-inch paulownia boards and inscribe each with a talisman. Also prepare five inscribed tablets, recording the year, month, and day of the new moon, the name of the disciple (e.g., Wang of such-and-such commandery, such-and-such village, Master of the Marchmounts), their age, and which Thearch’s child they belong to, and which Marchmount they are affiliated with. Bury the talismans and tablets at the Five Marchmounts. At the moment of burial, knock the teeth thirty-six times and recite the prayer:\n\n*I report above to the Three Primes, the Jade Emperor the Venerable; below I announce to the Five Marchmounts and the divine officials of the Five Colors. Having received the Flowing Bell and the true words of the Five Talismans, I fast with five incenses and inscribe my name upon the mountains and rivers. I entreat the perfected immortals to come and guard my form. The Five Mushrooms—yellow, black, white, red, and blue—flow forth; my body generates water and fire; the Fire Bell shines brilliantly. With dragon reins, I ascend to my chamber, mounting the Jade Court.*\n\nThus, the immortal officials of the Five Directions will guard the disciple’s body, transmitting the Way of divine perfected ones. Roaming the Five Marchmounts and seas, the hundred spirits will all come to pay homage.\n\n---\n\n**The Divine Candle of Night Illumination**\n\nThe Divine Candle of Night Illumination was bestowed upon the Thearch of the Grand Tenuity by the Perfected King of the Nine Heavens. Ascending a nine-tiered terrace, within the golden halls of purple orchids, the jade chambers, the divine candle is lit before the Five Thearchs. With reverent vows and disciplined practice, following the scriptures, reciting prayers, and concentrating the mind, after nine hundred days, the spirit is moved and the numinous responds. Thereupon, the Five Thearchs descend with their spirit talismans, void-born in the Five Directions, resplendent in the Highest Clarity. Their inner radiance shines brilliantly, illuminating the void, unfathomable to gaze upon, indestructible even if burned, their brilliance illuminating the jade chambers.\n\nAfter seven hundred years, the divine scripture appears. Five-colored beasts guard the talisman beside the lamp, recorded as the Divine Candle of Night Illumination, the Numinous Talisman of Penetrating Light. Five colors blaze resplendently, piercing through the Five Directions.\n\nThe Thearch then retreats to fast in the Highest Clarity. With purple gold, the scripture is cast in the midst of the Great Void. Auspicious omens announce its revelation. The Mother of Turtles holds the brush, the Great One brushes the mat. Inscribed upon gold tablets, bound with purple cords, it is entrusted to the Left Duke of the Immortal Capital for safekeeping. Above, jade palaces and purple clouds gather; below, ethereal fragrance scatters like mist. Thirty-six jade lads stand in attendance, transmitting it to the Nine Mysterious Thearchs of the Golden Gates, the Posterity of the Sage, and the Green Lad of the Highest Minister. Later, it is passed to worthy disciples destined to become perfected ones.\n\nThis dharma-treasure is secret, not transmitted to the lower world. Only those with bones of gold and marrow of jade, whose names are recorded in the Green Palace and inscribed in the Highest Clarity, may receive this scripture. Those who obtain it shall become perfected ones. Practicing for nine years, their divine radiance will naturally arise, their bodies luminous, their qi pure. Riding the void and mounting the sky, they ascend to the Thearch’s hall.\n\n---\n\n**Hymn of the Green Thearch’s Divine Candle**\nPlace the candle in the East. At the hour of human quietude, enter the chamber facing east. Knock the teeth nine times, close the eyes, and inwardly envision the green qi of the East, its radiance filling the room. Bow before the lamp, kneel, and recite the hymn:\n\n*Vast and obscure, the primal perfection,\nSwift and clear, the qi soars high.\nThe original thread knows no bounds,\nFeathered script shines bright and rises.\nSeeking through ten thousand kalpas,\nThe great radiance descends as the divine lamp.\nWashing away the seven mysteries’ trials,\nSuffering souls all transcend and ascend.\nThe void generates natural light,\nThe body, light, rides clouds to rise.*\n\n**Hymn of the Red Thearch’s Divine Candle**\nPlace the candle in the South. Knock the teeth nine times, close the eyes, and inwardly envision the red qi of the South, its radiance filling the room. Bow before the lamp, kneel, and recite the hymn:\n\n*The Great Void births the empty cavern,\nFormless, it returns without sound.\nSilent within the Primal Beginning,\nThe Three Purities give rise to cloudy scenes.\nHow desolate the secluded chamber—\nThe bright lamp connects thought.\nClearly beholding the natural light,\nThe Three Dawns share a single body.*\n\n**Hymn of the White Thearch’s Divine Candle**\nPlace the candle in the West. Knock the teeth nine times, close the eyes, and inwardly envision the white qi of the West, its radiance filling the room. Bow before the lamp, kneel, and recite the hymn:\n\n*The Three Numinous ones spit wondrous blossoms,\nThreading through the ninefold heavens.\nThe night’s light knows no blemish,\nIts precious radiance transcends intersecting paths.\nPiercing the boundless wilds,\nDawn breaks into the great seclusion.\nUprooting the nine mysteries’ suffering,\nFortune flourishes as misfortune vanishes.*\n\n**Hymn of the Black Thearch’s Divine Candle**\nPlace the candle in the North. Knock the teeth nine times, close the eyes, and inwardly envision the black qi of the North, its radiance filling the room. Bow before the lamp, kneel, and recite the hymn:\n\n*How bright, the radiance of the Great Yang!\nThe divine light pierces the Three Clarities.\nQi scatters within the dark desert,\nEthereal mist arises in the purple court.\nControlling and riding the flying clouds,\nDrifting, drifting, beyond all form.\nUprooting my seven mysteries’ ancestors,\nIn the Southern Palace, they are reborn anew.\nEver equal to the Three Lights,\nTo the ends of Heaven, without peril or collapse.*\n\n**Hymn of the Yellow Thearch’s Divine Candle**\nPlace the candle in the Center. Knock the teeth nine times, close the eyes, and inwardly envision the yellow qi of the Center, its radiance filling the room. Bow before the lamp with the heart, kneel, and recite the hymn:\n\n*The Five Thearchs unite in the Mysterious One,\nThe Central Origin governs the ten directions.\nSeizing rectitude to aid the Great Darkness,\nThe hidden candle shines as brightly as the empty void.\nQi scatters without bound,\nTogether they cross into the divine lineage.\nOffering hymns to the Perfected’s chapter,\nIn solemn steps, I tread the void,\nLonging stirs the Jade Thearch,\nEver to visit the Three Origins’ chambers.*\n\nThis hymn is received by the Thearch-Lord from the Divine Candle’s inner recitation of the Nine Heavens’ True Kings. Through cultivated resonance, the night’s radiance brightens of itself, and the Five Thearchs’ luminous spirit talismans descend into the Thearch’s chamber.\n\nShould your jade name be recorded above, and you awaken to the secret texts, you must present five taels of gold as an offering to the Five Directions, and fifty feet of five-colored silk to pledge alliance with the Five Thearchs. Swear your oath before the Three Origins, then receive the teachings.\n\n**The Five Thearchs’ Luminous Spirit Talismans**\n\n**Eastern Direction:**\n*The Great Clarity, the Great Void, the Great Cavern’s Primordial Yang Essence—*\nNine thousand myriad layers of mystery give birth to the Jade Perfected Qi,\nOverseeing the Jade Terrace’s nine thousand life-officials,\nCommanding the qi of the nine heavens,\nGoverning the immortal kings of the Three Heavens.\nThose who obtain it become immortals;\nthose who wear it attain Perfected-hood.\nPracticing it, one’s radiance becomes luminous and spiritually penetrating,\nascending to heaven in broad daylight.\n\n**Right:** The Azure Thearch’s self-generated Divine Candle Luminous Spirit Talisman.\nInscribe it in cinnabar on nine inches of green silk and wear it.\nAlso inscribe a nine-inch talisman and place it in the eastern direction of your dwelling,\nbeneath the divine candle’s lamp.\nAfter nine years of practice, the divine candle will brighten of itself,\nand the spirit talisman will manifest.\nThe Thearch dispatches twelve Azure Radiance Lads to attend and guard your person.\n\n**Southern Direction:**\n*The Great Yang, the Great Essence, the Great Cavern’s Fiery Origin Essence—*\nEight thousand myriad layers of mystery ascend to generate the Jade Perfected Qi,\nOverseeing the Jade Terrace’s eight thousand life-officials,\nCommanding the qi of the nine heavens,\nAssisting the rectitude of the Three Heavens’ laws.\nThose who obtain it become immortals;\nthose who wear it attain Perfected-hood.\nPracticing it, one’s radiance becomes luminous and spiritually penetrating,\nascending to heaven in broad daylight.\n\n**Right:** The Vermilion Thearch’s self-generated Divine Candle Luminous Spirit Talisman.\nInscribe it in cinnabar on nine inches of crimson silk and wear it.\nAlso inscribe a nine-inch talisman and place it in the southern direction of your dwelling,\nbeneath the divine candle’s lamp.\nAfter nine years of practice, the divine candle will brighten of itself,\nand the Thearch dispatches twelve Vermilion Radiance Lads to attend and guard your person.\n\n**Western Direction:**\n*The Great Treasure, the Great Splendor, the Great Cavern’s Mysterious Radiance Essence—*\nSix thousand myriad layers of void give birth to the spontaneous Jade Perfected Qi,\nOverseeing the Jade Terrace’s six thousand life-officials,\nCommanding the qi of the nine heavens,\nSeizing the rectitude of the Three Heavens’ Perfected.\nThose who obtain it become immortals;\nthose who wear it attain Perfected-hood.\nPracticing it, one’s radiance becomes luminous and spiritually penetrating,\nascending to heaven in broad daylight.\n\n**Right:** The White Thearch’s self-generated Divine Candle Luminous Spirit Talisman.\nInscribe it in cinnabar on nine inches of white silk and wear it.\nAlso inscribe a nine-inch talisman and place it in the western direction of your dwelling,\nbeneath the divine candle’s lamp.\nAfter nine years of practice, the divine lamp will brighten of itself,\nand the Thearch dispatches twelve White Radiance Lads to attend and guard your person.\n\n**Northern Direction:**\n*The Great Darkness, the Great Mystery, the Great Yin’s Northern Origin Essence—*\nFive thousand myriad layers of void give birth to the Jade Perfected Qi,\nOverseeing the Jade Terrace’s five thousand life-officials,\nCommanding the qi of the nine heavens,\nSeizing the rectitude of the Three Heavens’ Perfected.\nThose who obtain it become immortals;\nthose who wear it attain Perfected-hood.\nPracticing it, one’s radiance becomes luminous and spiritually penetrating,\nascending to heaven in broad daylight.\n\n**Right:** The Black Thearch’s self-generated Divine Candle Luminous Spirit Talisman.\nInscribe it in cinnabar on nine inches of black silk and wear it.\nAlso inscribe a nine-inch talisman and place it in the northern direction of your dwelling,\nbeneath the divine candle’s lamp.\nAfter nine years of practice, the divine lamp will brighten of itself,\nand the Thearch dispatches twelve Black Radiance Lads to attend and guard your person.\n\n**Central Direction:**\n*The Great Clarity, the Great Yellow, the Great Cavern’s Supreme Perfected Three Origins’ Origin Essence—*\nTwelve thousand myriad layers of void give birth to the Jade Perfected Qi,\nOverseeing the Jade Terrace’s twelve hundred life-officials,\nCommanding the qi of the nine heavens,\nSeizing the rectitude of the Three Heavens’ Perfected.\nThose who obtain it become immortals;\nthose who wear it attain Perfected-hood.\nPracticing it, one’s radiance becomes luminous and spiritually penetrating,\nascending to heaven in broad daylight.\n\n**Right:** The Yellow Thearch’s self-generated Divine Candle Luminous Spirit Talisman.\nInscribe it in cinnabar on nine inches of yellow silk and wear it.\nAlso inscribe a nine-inch talisman and place it in the central direction of your dwelling,\nbeneath the divine candle’s lamp.\nAfter nine years of practice, the divine lamp will brighten of itself,\nand the Thearch dispatches twelve Yellow Radiance Lads to attend and guard your person.\n\nThe Five Thearchs’ self-generated Night Candle Divine Lamp Luminous Spirit Talismans\nare born within the void,\ntheir divine radiance mysteriously illuminating,\nshining brilliantly into the Great Non-Being.\nThe Heavenly Thearch-Lord reveres and upholds them,\nentrusting them to the Golden Watchtower’s Sage-Lord and the High Minister Azure Lad,\nto be received by later students destined to become Perfected.\n\nIf your mysterious name is recorded above in the Jade Register,\nyou may behold this method.\nEach night at the hour of human stillness, enter your chamber,\nburn incense, bow before the divine lamp, and recite the texts in full.\nThen face east, knock the teeth twenty-four times, and pray:\n\n*O Mysterious Perfected, exalted and distant,\nPure radiance dispels the night’s obscurity.\nThe divine candle shines brightly,\nThe jade talisman shares in wisdom.\nPerfected spirits inwardly illuminate,\nMysterious light reflects the realms.\nFive-colored lads,\nTheir brilliance pierces all sight.\nAttaining the flying chariot,\nI ascend to the Thearch’s throne.*\n\nConclude by knocking the teeth twenty times and swallowing the qi of the Five Directions, five times each.\n\nAfter five years of such practice, you will attain the self-brightening candle,\nand the Five-Colored Lads will encircle your body,\ntheir clarity penetrating distant visions,\nretracing the boundless.\nKeep the bright candle ever lit,\nnever allowing it to extinguish.\n\nIf you cannot retreat to secluded mountains and forests,\nbut remain among people,\nplace the lamp in a separate chamber,\nensuring no one of impure qi treads upon or defiles it,\noffending the divine Perfected,\nlest the spirit radiance fail to appear.\n\nIf you follow this method and brighten the lamp,\nits light will illuminate an entire city,\nvanquishing ten thousand demons and blinding a thousand ghosts.\nWherever you dwell, the Perfected Officials will encamp and guard your gate.\n\nThis method is truly secret;\ndo not recklessly divulge it.\nShould you receive it in the dark and recklessly leak the treasured scripture,\nyour body will be consigned to the ghostly officials,\nyour seven mysteries’ ancestors will forever fill the earthly prisons,\nand in the ten thousand kalpas of the dark springs,\nyou will have no hope of immortality.\nBe ever vigilant.\n\nThe **Spirit-Stabilizing, Soul-Firming, Soaring Elixir of the Seventy-Four Directions**\n\n**Ingredients:**\n- Four liang of mica,\n- Four liang of realgar,\n- Niter, figwort root, sophora fruit, five liang of dragon bone,\n- Polyporus, frost from Green Mound, dried tiger’s-eye flower,\n- Two liang each of clove, spikenard, aloeswood,\n- Frankincense, two liang of rock candy, three liang of halite,\n- Eight liang each of malachite and cinnabar,\n- Azurite, two liang of white quartz,\n- Two liang of *Taiyang Infant’s Feather Garment*,\n- Two liang of *Taiyang Essence’s Supreme Floral Radiance*,\n- Four liang of peach blossom,\n- Four liang each of true rose remnants,\n- One sheng and two ge of *Northern Congealed Yin Essence Flowing Blossom*.\n\nCollect these on the *jian* day of the ninth month and store in a separate vessel.\n\n- One sheng and two ge of *Qi-Congealed, Essence-Condensed Plain Elixir*. Collect on the *jian* day of the twelfth month and store in a separate vessel.\n- One sheng and two ge of *Spirit-Transformed Yin Essence Flowing Pearl*. Collect on the winter solstice and store in a separate vessel.\n\nCombine the twenty-seven ingredients: the first twenty-four correspond to the twenty-four spirits, while the remaining three align with the *qi* of the Three Origins. Two respond to the Nine Mornings, consolidating the po and solidifying the hun, transmuting the Five Colors’ flowing yellow to shape-shift and transform without fixed form. When ingested, the spirit is stabilized and *qi* pacified.\n\nPrepare the elixir on the *jian* day of the third month and ingest the pills on the *ren* day of the fifth month. Begin by grinding each ingredient in sequence, starting with mica, each pounded three thousand times, up to peach blossom—twenty-four ingredients in total, seventy-two thousand pestle strokes. Once complete, place each in a separate tray.\n\nBefore grinding, observe a thirty-day fast. Afterward, have a young boy pound the medicine while a young girl tends the incense. Both must be of few words, cautious in speech, kind-hearted, and naturally fragrant in flesh and bone.\n\nExpose the twenty-four trays of medicine in the central courtyard for three nights. Ensure no chickens, dogs, or outsiders see them, and prevent exposure to sounds of weeping. After exposure, layer the ingredients into a cauldron in order: first mica, then realgar, lastly peach blossom, followed by the remaining twenty-four. Arrange them carefully, filling the cauldron.\n\nNext, add one sheng and two ge of *Northern Congealed Yin Essence Flowing Blossom*, then one sheng and two ge of *Qi-Congealed, Essence-Condensed Plain Elixir*, and finally one sheng and two ge of *Spirit-Transformed Yin Essence Flowing Pearl*. Once all are added, pour twelve sheng of pure millet water over the medicine, then seal the cauldron with a clay lid, ensuring all inner and outer surfaces are tightly sealed to a thickness of seven fen. Place mica at the bottom, its *qi* ascending, and peach blossom atop, its color crowning the rest—thus the order is set.\n\nFirst, craft two clay cauldrons using *Six-One Mud*: combine equal parts left-facing oyster shell from the East Sea, halite, red halloysite, lead oxide, talc, and earthworm soil. Grind finely, sift, and mix with hundred-day rice vinegar. Knead thoroughly to form the *Six-One Mud*. Coat the inner and outer surfaces of both cauldrons with thin layers, sun-drying until fully desiccated. Gradually build up the thickness to two and a half cun.\n\nOnce complete, construct a furnace facing south, placing the cauldron atop a solitary support at its center, elevating the base one chi and two cun above the ground. Ignite with chaff fire for three days and nights, keeping the flames nine cun from the cauldron. For nine days and nights, advance the fire to six cun away, then for another nine days and nights, bring the flames to the base—totaling twenty-seven days. Cool for three days, then open to inspect: if the medicine has ascended and adhered to the upper cauldron, the divine elixir is formed. If not, reseal with mud as before and repeat the firing for another twenty-seven days. Cool for three days; it will surely succeed.\n\nUse a three-year-old rooster’s feather to sweep the elixir from the upper cauldron: this yields *Flying Cinnabar Purple Flowing Essence*, shimmering with a hundred shifting hues, its mysterious radiance illuminating the seventy-four directions. Ingesting a single *zhu* will cause your body to emanate seventy-four colors of flowing light. Spitting to the left summons the Three Hun, while spitting to the right transforms the Seven Po into seven child-spirits with flying nets and feathered skirts, their divine chariots and jade carriages instantly appearing before you.\n\nStore the elixir in a cauldron tray; the essence congealed at the bottom becomes *Jade Embryo Nectar Ointment*. Blend with white honey, then grind in a mortar facing east for ten thousand strokes. Form into pills weighing one *zhu* each. Seal in an airtight vessel and expose in the central courtyard for three days and nights. Upon completion, ingest one pill at dawn. Take three pills over three days, enabling you to traverse the void, entering and exiting non-being. After seven days of taking seven pills, you will ascend amidst rosy clouds. Soaring over the Five Peaks, fifty thousand spirit-officials of the Five Colors will escort your form.\n\nFacing east, ingest nine pills to summon emerald mists and green chariots, with azure dragons reining the steeds. Ninety *Jade Lads of the Azure Yang* and ninety *Jade Maidens of the Azure Waist*, along with nine thousand immortals of the Eastern Peak, will come to receive you.\n\nFacing south, ingest eight pills to summon crimson mists and cloud chariots, with vermilion dragons reining the steeds. Eighty *Jade Lads of the Crimson Palace* and eighty *Jade Maidens of the Great Cinnabar*, along with eight thousand immortals of the Southern Peak, will come to receive you.\n\nFacing west, ingest six pills to summon pristine mists and jade carriages, with six dragons reining the steeds. Sixty *Radiant Spirit Jade Lads* and sixty *Jade Maidens of the Supreme Simplicity*, along with six thousand immortals of the Western Peak, will come to receive you.\n\nFacing north, ingest five pills to summon black mists and flying chariots, with dark dragons reining the steeds. Fifty *Jade Lads of the Supreme Ultimate* and fifty *Jade Maidens of the Supreme Mystery*, along with five thousand immortals of the Northern Peak, will come to receive you.\n\nFacing the direction of *wu-ji* (戊己), ingest three pills to summon a jade carriage of yellow mists, with twelve flying dragons reining the steeds. Twelve *Yellow Mechanism Jade Lads* and twelve *Yellow Simplicity Jade Maidens*, along with one thousand two hundred immortals of the Central Peak, will come to receive you.\n\nUpon completing the ingestion of the five regimens, the immortals of the Five Peaks will present a jade tablet with phoenix-script, inviting your person to ascend beneath the Nine Palaces and Golden Towers, there to receive the title of Perfected Immortal. Truly, the marvel of these numinous pills is great indeed.\n\nAll transformations manifest seventy-four kinds of gold, silver, and precious jade, along with crimson trees bearing vermilion fruits. They give rise to living water and fire, possessing wonders beyond the use of *langgan* jade, the Eight Effulgences, and the Four-Petaled Descending Numinous Elixir. These cannot be enumerated in full; only the subtleties of the great transformations are briefly outlined here.\n\nShould you wish to roam the Five Peaks and traverse the Eight Extremities, unburdened by the toil of immortal officials or the tedium of bureaucratic duties, and if you do not yet desire to ascend to heaven, you may forgo the pills of the Five Directions. Simply ingest the regular count of seven or three pills to secure your hun-soul and anchor your po-soul, soaring through the seventy-four directions, wandering the Five Peaks, and attaining a lifespan equal to the Three Luminaries.\n\nThe rest may follow the numbers of the Five Directions. If you ingest the pills of the Five Directions, you will become an overseer of the Five Peaks, assuming office and duties, and thus will be unable to move freely in the mortal world.\n\n---\n\n*Scripture on Preserving Life Through Radiant Light and Transforming Scenery*\n*Taiyi Perfected One* once ascended to the *Feather Bright Wilds* beyond the Northern Desert, to the *Mystic Ridge Mountain* and the *Purple Tenuity Palace*. There, he beheld *Purple Tenuity Lady* dwelling in seclusion, her spirit serene and luminous. She gazed upward to consume the Mystic Stream, gathered and ingested the Two Images, exhaled and inhaled flying mists, reflected herself in the Five Lights, and sheltered her body with the Two Luminaries. Five-colored vapors billowed and flowed, adorning the jeweled terrace with splendor.\n\nLooking up at the western wall of the Purple Tenuity Palace, in its northwest corner, he saw an inscribed jade slip named *The Chapter of the Five-Colored Radiant Lads*. The Perfected One purified himself for three months, then journeyed to the Purple Tenuity Palace to receive the scripture. The Purple Tenuity Lady declared it the *Scripture on Radiant Light and Transforming Scenery*. After receiving it and cultivating its practices for three years, he attained the rank of Perfected One.\n\nThis scripture is a treasure of the Purple Tenuity Lady, not to be recklessly transmitted. Without the Jade Clarion’s celestial sound or the Purple Script’s azure radiance, one may not hear or behold it. Those who practice it must purify themselves with fasting and bathing, burn incense in a secluded chamber, and meditate in stillness upon the Perfected for a hundred days. Then, five Jade Lads and five Jade Maidens will be granted to them.\n\nIf one cultivates without negligence, the Five-Colored Lads will rest in one’s chamber, and Radiant Light will circulate through one’s body, enabling ascent to the Jade Clarity. Always at the time when the clear sun rises in splendor, enter the chamber, face east, and visualize the Eastern Azure Radiance Lad, named *Azure Supreme Jade*, styled *Flying Upright*. His body is the color of azure mists, his flowing light blazing and illuminating the eastern quarter like the brilliance of lightning. He rides a carriage of azure mists, his entire being suffused with the streaming glow of Mystic Light. Feel your body transform and enter the azure light, where inner and outer merge into obscurity. After a long while, clarity returns. Knock the teeth twelve times and swallow qi nine times, then cease.\n\nRecite the invocation:\n*\"Eastern Lad, Azure Supreme Jade Lord, bestow upon me the Azure Mushroom and the Fountain of Radiant Light. With the Azure Mist Carriage, come receive my person, that I may ascend to the Jade Court and become a Perfected One.\"*\n\nNext, visualize the Southern Lad, named *Cinnabar Radiance*, styled *Mystic Record*. His body is the color of crimson mists, his flowing light blazing in the southern quarter like the brilliance of lightning. He rides a carriage of vermilion mists, his entire being suffused with the streaming glow of Mystic Light. Feel your body enter the crimson light, where inner and outer merge into obscurity. After a long while, clarity returns. Knock the teeth twelve times and swallow qi nine times, then cease.\n\nRecite the invocation:\n*\"Southern Lad, Cinnabar Radiance Perfected Lord, bestow upon me the Nectar of Descending Life and the Fragrance of Radiant Jade Mushrooms. With the Vermilion Mist and Lightning Brilliance, overshadow my chamber. Ascend with me, that together we may reach the Imperial Court.\"*\n\nNext, visualize the Western Lad of White Light, named *Luminous Splendor*, styled *Returning Spirit Lad*. His body is the color of pristine mists, his flowing light blazing and illuminating the western quarter like the brilliance of lightning. He rides a carriage of white mists, his entire being suffused with the streaming glow of Mystic Light. Feel your body transform and enter the white light, where inner and outer merge into obscurity, and nothing is heard or seen. After a long while, clarity returns. Knock the teeth twelve times and swallow qi nine times, then cease.\n\nRecite the invocation:\n*\"Western Lad, Luminous Splendor Supreme Lord, bestow upon me the Pristine Water and Jade Mushrooms, the Fountain of Flowing Pearls and Golden Liquor. With the White Mist Flying Canopy, descend to my person. Ascend with me, that together we may reach the Supreme Perfected.\"*\n\nNext, visualize the Northern Lad of the Black Emperor, named *Mystic Brilliance Supreme*, styled *Great Yin Script*. His body is the color of dark mists, his flowing light blazing and illuminating the northern quarter like the brilliance of lightning. He rides a carriage of white mists, his entire being suffused with the streaming glow of Mystic Light. Feel your body transform and enter the black light, where inner and outer merge into obscurity, and nothing is heard or seen. After a long while, clarity returns. Knock the teeth twelve times and swallow qi nine times, then cease.\n\nRecite the invocation:\n*\"Northern Lad, Mystic Brilliance Supreme Lord, bestow upon me the Black Mushroom and Mystic Water, the Jade Essence and Dark Mist Flying Carriage. With the Five-Colored Numinous Dragons and the Obscuring Radiant Light, descend to my person. Ascend with the clouds, that I may reach the Flourishing Palace.\"*\n\nNext, visualize the Central Lad of Yellow Light, named *Upholding Center*, styled *Yellow Record Lad*. His body is the color of yellow mists, like the essence of yellow gold, his flowing light blazing and illuminating the center, with five colors streaming and flashing like the brilliance of lightning. He rides a carriage of yellow mists, coming to rest in your chamber and coiling around your body. Feel your body transform and enter the yellow light, where inner and outer merge into obscurity, and nothing is heard or seen. After a long while, clarity returns. Knock the teeth twelve times and swallow qi nine times, then cease.\n\nRecite the invocation:\n*\"Central Lad, Upholding Loyalty Numinous Perfected, bestow upon me the Yellow Water and Moon Essence, the Returning Essence and Flying Dawn. With the Five Colors blazing and falling, and the Radiant Light gleaming within, overshadow me with the smoke of Yellow Splendor. Soaring through the void, ascend before the Emperor.\"*\n\nWhen the preceding is complete, visualize the five colors blending into yellow, layering and intensifying upon one another. Cloud-qi surges and billows, filling the entire chamber and coiling around your body. Feel your form suffused with warmth, heat radiating within and without, penetrating deeply for a long while. Then behold: a Green Dragon upon your left shoulder, a White Tiger upon your right, a Vermilion Phoenix above your head, and a Soaring Serpent beneath your feet. They crown your body and recite the incantation:\n\n*\"The five colors thicken and surge—white, black, red, and blue-green. From the Central Mystery they descend, merging in dark abundance. Transformed into celestial beasts, they come to guard my form. Bestow upon me the Five Mushrooms, filling my five viscera to abundance. The Crimson Palace knits its networks, and divine radiance arises of itself. My lifespan equals sun and moon, ever preserving Yellow Tranquility. Through a thousand transformations and ten thousand changes, I shall ascend to the Supreme Numinous.\"*\n\n**Method for Swallowing Saliva, Restoring Countenance, and Securing Teeth to Seek Immortality**\n\nAt the break of dawn, when the two qi have not yet divided and the dark radiance has just illuminated the world, when form and spirit descend together to gather at the Muddy Pellet Palace, essence and fluids are all generated. This is the time to swallow and ingest them. After three years of such practice, your face will glow with jade-like luster, your complexion will revert to youth, your cloud-like vitality will take root, and decayed teeth will regrow.\n\nIf you persist in this cultivation, the Five Elders will descend to your chamber. You will ascend as a divine immortal, your lifespan equaling the Three Luminaries. This is the Way of Undying—transmit it only to the true.\n\nAt the appointed time, calm your mind and settle your intent, allowing the Five Spirits to attain stillness. Knock the teeth twelve times, then visualize the Azure-Robed Jade Maiden bearing the Lesser Yang qi of the East, along with Azure Mushroom and Jade Nectar, irrigating your body. Let them flow and overflow within the Purple Tenuity Palace, and recite:\n\n*\"Eastern Bluegreen Fang, drink the morning radiance. Jade nectar and sweet springs pour forth in torrents, streaming to moisten the Six Palaces. Dark influx flows like a river. My body grows strong, my form light, ascending to grasp the Supreme Rosy Clouds.\"*\n\nWhen finished, lick the outer side of your upper teeth nine times and swallow.\n\nNext, visualize the Vermilion-Robed Jade Maiden of the South bearing the Great Yang qi, along with Crimson Mushroom and Jade Nectar, irrigating your body. Let them flow and overflow within the Crimson Palace, and recite:\n\n*\"Southern Red Fang, drink the sweet springs. Dark mushroom and jade nectar flow and overflow like rivers, further moistening the Crimson Palace. My bones transform and give birth to spirits. I feast upon the Great Void, my entire body becoming immortal. Riding clouds and driving the dawn, I ascend before the Emperor.\"*\n\nWhen finished, lick the outer side of your lower teeth eight times and swallow.\n\nNext, visualize the Pristine Jade Maiden of the West bearing the Lesser Yin qi, along with White Mushroom and Jade Nectar, irrigating your body. Let them flow and overflow within the Canopy Palace, and recite:\n\n*\"Western White Fang, drink the numinous fluid. Jade waters surge in mighty currents, dark mushrooms gleaming brightly. They irrigate my Six Palaces, anchoring my hun and solidifying my po. My spirit is at peace, my stomach and ducts secure. My name is inscribed in the Golden Register.\"*\n\nWhen finished, lick the inner side of your upper teeth six times and swallow.\n\nNext, visualize the Jade Maiden of the North bearing the Great Yin qi, along with Dark Mushroom and Jade Water, irrigating your body. Let them flow and overflow within the Great Granary Palace, and recite:\n\n*\"Northern Black Fang, consume the dark nourishment. Drink my flying springs, feed me jade broth. My divine palace fills to overflowing, like cinnabar, like mushrooms. My lifespan overturns heaven and earth, shared by millions for countless ages.\"*\n\nWhen finished, lick the inner side of your lower teeth five times and swallow.\n\nNext, visualize the Yellow-Robed Jade Maiden of the Center bearing the Harmonious qi, along with Yellow Water and Moon Essence Elixir, irrigating your body. Let them flow and overflow within the Jade Hall, and recite:\n\n*\"Central Yellow Fang, white stones towering high. Feast upon the jade broth’s elixir, slake your thirst with Yellow Water and Moon Essence. My five viscera fill to abundance, streaming and moistening like rivers. My lifespan equals the Three Luminaries, never to decline or perish. My form ascends the Nine Mysteries, riding dragons and soaring through rosy clouds.\"*\n\nWhen finished, lick all four sides of your upper and lower teeth, then press your tongue against the Mysterious Flower and draw the mushroom fluid twelve times before swallowing.\n\n**The Way of Swallowing Saliva to Preserve the Teeth**\n\nThe Central Yellow Venerable Lord and the Perfected of the Supreme Ultimate constantly practiced this method. Their complexions became like those of youths, their skin like jade, their bodies brimming with qi. Their white hair turned black again, their teeth took root and never decayed or fell out. Thus they attained the descent of the Mysterious, their names inscribed in the Jade Registers. They ascended to the Clear Void, sharing the Emperor’s seat.\n\nIf you cultivate this, you shall seek your name in the Jade Pavilion of the Golden Gates. Without immortal records, you may not unseal and reveal it.\n\n**Method for Riding Rosy Clouds, Descending Mist, and Ascending the Void**\n\nTransmitted by the Azure Lad\n\nThe Lord of the Empyrean was born within luminous rosy clouds, enveloped by the five clouds, his countenance suffused with empyrean qi. His form follows the imperial registers, and he received the title Jade Tenuity. Concentrating the true and solidifying the fluids, he contemplates the dark rosy clouds to set himself in motion, yearning to roam the empyrean and ascend the void. He rides the dark dawn through the Ten Heavens, galloping like lightning to rein in the dragons. Thus, through focused contemplation, he achieves perfection and ascends the void to enter non-being.\n\nThe essentials of this method are pure and unadulterated by other techniques. I now transmit it to you—you may practice it accordingly.\n\nThe Eastern Rosy Cloud is named *Flying Void*.\nThe Western Rosy Cloud is named *Pristine Hut*.\nThe Southern Rosy Cloud is named *Cinnabar Radiance*.\nThe Northern Rosy Cloud is named *Dark Image*.\nThe Central Rosy Cloud is named *Encompassing Life*.\n\nIf you know the five rosy clouds, they will descend and summon the flying chariots. Contemplate them morning and evening, and the dark empyrean will come to invite you. Riding the void, you will ascend and reach the Supreme Clarity.\n\nTo practice this method, at the first light of dawn, go to the central courtyard. Knock your teeth sixteen times, then face east and call the names of the five directional rosy clouds three times each. When finished, look up and recite:\n\n*\"Five Directions’ Dark Rosy Clouds, streaming and illuminating the Dark Void. Three and seven ride nine, returning to encircle my hut. Grant me the flying dawn, to rein in the purple chariot. Ascending to the Supreme Ultimate, I request the true scriptures.\"*\n\nWhen finished, bow in reverence and swallow qi thirty-six times.\n\nAt dusk, face west and perform the same method.\n\nThose who cultivate the Supreme Way yet do not know the inner names of the cloud chariots will find that the cloud carriages do not descend for them, and their contemplation will not evoke a response. If you obtain this method and practice it for eighteen years, the qi of self-generating clouds will form within your chamber, and the cloud chariots will descend to carry your body upward to the Jade Clarity.\n\nThis Dao treasure is profoundly secret. The text speaks of the hidden names of the radiant clouds, which worldly people must never learn or practice—thus it must be kept concealed. To carelessly reveal it brings sin upon oneself, calamity upon seven generations. How could one not be cautious?\n\n**Method for Moving Through the Celestial Pass and Unfolding the Divine Wondrous Observation of Secret Writ**\n\nThe Perfected Sovereign said: If you wish to ascend and soar to the Golden Gates, you must cultivate the Wondrous Observation, move through the Celestial Pass, pay homage to your parents, and inwardly invoke the true spirits. Then you may wander and play among the Nine Heavens, ascending to the Emperor’s chamber.\n\nAt midnight, step barefoot into the central courtyard. Gazing upward, visualize the Seven Stars of the Northern Dipper shining brightly. Envision your body standing at the Dipper’s center, revolving with it as it moves through the Celestial Pass. When it reaches the position above the southwest, bow twice, stand upright, and knock your head upon the ground nine times. Then, lifting your head slightly, softly call out three times:\n\n*\"Heavenly Father, Earthly Mother, I now return my body, restoring it to its natural honor in your care. Will you not move and deliver me? Once my body is delivered, I shall forever depart the paths of mortal thought. Contemplating the two honored ones, I reverently receive your blessed destiny.\"*\n\nWhen finished, swallow qi twice, then swallow saliva nine times.\n\nThese two honored ones are the most sacred names of Heaven and Earth, the hidden appellations of the Mysterious True. They must never be recklessly disclosed to others. Should one reveal them three times, the officials of the Nine Heavens will diminish one’s lifespan and cut short one’s years, casting one’s life into the Nine Springs—forever barring ascent to immortality.\n\nFor those who cultivate the Way of the Supreme True: if the Seven Stars shift their position and you open the Three Celestial Passes, yet do not know these names, the Jade Perfected of the Nine Heavens will block the resonance of your contemplation. Those who are not children of the Mysterious Gate cannot unfold this method, and the true spirits will not descend for them.\n\nThis is the wondrous method of Heaven and Earth. The recipient must present a golden figurine and a jade figurine, each one in form, to the master, and receive the oral transmission of the decisive instructions. Then, ascending the altar, they must swear an oath of initiation, never violating the precepts. Should one transgress, their body will be seized by the ghostly officials, and calamity will extend to the seven ancestral lines. The recipient must be cautious—most cautious indeed.\n\nHere ends the *Scripture of the Supreme Wondrous, Purple Passage, Blazing Radiance, and Divine Transformation of the Cavernous True*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞真太上紫度炎光神玄变经 经名：洞真太上紫度炎光神玄变经。 撰人不详，约出於东晋。 系早期上清派重要经典。 一卷。 底本出处：《正统道藏》正一部。 洞真太上紫度炎光神玄变经 紫度炎光序 紫度炎光者，非紫度炎光有本文，是神经自空虚之中凝炁成章，玄光炎映，积七千年，其文乃见。 太微天帝君以紫兰结其篇目，金简书其正文，仍记为《紫度炎光神玄变经》，神玄变经者，从玄中变而名焉。 玄章既存，高上玉皇命金晨玉童、西华玉女各三千人，侍文左右，卫在太上六合紫房之内。 南极元君主之。 太微帝君记 太微帝君者，生于始青之端，曜灵彻玄，炁未凝之始，结流芳之冑法形焉。 连光映灵，紫云曜电，玄烟流霭，丹晖缠络，妙觉潜启，仍采纳上契，条畅纯和，吐纳冥津，遂降生灵之胎，哺兼法泉曲芝。 行年二七，金容内发，玉华外映，洞慧神聪，朗睹虚玄，编掌帝号，其任乎澄流九霄之霞，飞眺洞清之源，明机览於极玄，须综运於亿津，积感加於冥会，妙启发於自然。 是以得御紫度炎光回神飞霄登空之法，修行内应上登玉清高上之尊，道备以付中央黄老君焉。 西王母授经时作颂三篇 啸歌九玄台，崖岭凝凄凄。 端心理六觉，畅目弃尘滓。 流霞耀金室，虚堂散玄熏。 积感致灵降，形单遁亦分。 倏忽盻万劫，岂觉周亿椿。 秀圃蔚神阶，朱琼炜琳庭。 流风散空洞，玉籁乘虚明。 紫烟缠曲字，丹晖映绿軿。 飞旗郁玄盖，羽节耀紫清。 登景九霄际，遨游戏凤城。 愿受荣境子，一乐同朝生。 腾辔控玄晖，晏景洞野外。 流浪寻灵人，合形庆霄际。 手披朱峊户，眼若神冲泰。 金阙郁嵯峨，清景无尘秽。 解衿玄阆台，适我良愿会。 脱屐三徒难，保炼固年迈。 紫度炎光中方内存招无洞观天上法 帝君结形之始，仍学招真之道，遐思远览，潜想内瞩，坐观无崖，洞想幽虚，年始三岁，中方审正，真神披朗，逆知未然，究览极天之境，无幽不鉴，无上不关，无下不盼，遂受大帝之号，由积感所降，岂生便任乎。 常以平旦，天光未明，清辉始发之时，两手相摩令热，拭两目四眦三七过，叩齿二十四通，以舌荡舐口内，上下周匝，令芝液并生，咽液九过。 毕，以被通冠覆一身，体定卧，令中方审正。 当使内外寂寞，不闻音响，手掩两耳，闭目内存，身见东方九万里之外，山川草木，禽兽胡老之类，如在目前，使分明审正，不定更存，久久自然见也。 既分明，使闻耳中有钟鼓之声琅琅，良久，仍见东岳仙官，乘碧龙碧霞，手把五芝，从玉女十二人，〔着〕#1飞青羽裙，赍青精玉胎，盛以金柈，授与我身。 既见仙官，觉礼而受之，即服，觉其味甘，便拭目，咽气九过止。 如些三年，目见万里之事，耳闻工万里之音，无不朗然，逆知方来吉凶，年算长短之兆，身生异光，洞见表裹。 招无之道，其法极妙，口口相传，不形於文。 次还思如上法，内存见南方九万里之外，山川草木，土色禽兽，越老之人，如在目前，使分明审正，不定更存，久久自然见也。 既分明，便听耳中有百籁之声嘈嘈，良久，仍见南岳仙官，乘飞龙云盖，手把华旛，从玉女十二人，着青锦飞裙，赍玄纲绛实，盛以金柈，授与我身。 既见仙官，觉礼而受之，即服，觉其味酸，便拭目九过止。",
      "translated_text": "**The Cavernous Perfection Scripture of the Supreme Venerable One on the Purple Ascension, Flaming Radiance, and Mysterious Transformations**\n\n**Scripture Title:** *The Cavernous Perfection Scripture of the Supreme Venerable One on the Purple Ascension, Flaming Radiance, and Mysterious Transformations*. Author unknown, approximately dated to the Eastern Jin dynasty. A foundational scripture of the early Shangqing tradition. One fascicle. Base text from *The Orthodox Daoist Canon*, Zhengyi Section, First Division.\n\n---\n\n### *The Purple Ascension and Flaming Radiance: Preface*\n\nThe *Purple Ascension and Flaming Radiance* is not a text with an original composition; rather, it is a divine scripture that coalesced from the void, its qi congealing into chapters. Its mysterious radiance blazes forth, accumulating over seven thousand years before its words manifested.\n\nThe Celestial Emperor of the Grand Tenuity bound its chapters with purple orchids and inscribed its main text upon golden tablets, thus recording it as *The Scripture of the Purple Ascension, Flaming Radiance, and Mysterious Transformations*. The *Scripture of Mysterious Transformations* derives its name from the transformations within the Mystery.\n\nOnce the mysterious chapters were established, the Highest Jade Sovereign commanded three thousand Golden Dawn Jade Lads and three thousand Western Flower Jade Maidens to attend upon the text, guarding it within the Purple Chamber of the Supreme Six Harmonies. The Primordial Lord of the Southern Culmen presides over it.\n\n---\n\n### *Record of the Celestial Emperor of the Grand Tenuity*\n\nThe Celestial Emperor of the Grand Tenuity was born at the inception of the Primordial Azure, his luminous essence penetrating the Mystery. At the very beginning, before qi had coalesced, he formed the ancestral method of the Fragrant Lineage. His radiance connected with the numinous, purple clouds flashing like lightning, mysterious mists flowing like mist, and cinnabar brilliance entwining all. Subtle awakening arose in concealment, and he absorbed the supreme契, unfolding in pure harmony. Exhaling and inhaling the dark tides, he descended into the womb of a numinous being, nourished by the curved mushrooms of the Dharma Spring.\n\nAt fourteen years of age, his golden countenance shone from within, and jade splendor radiated without. His wisdom was cavernous, his spirit keen, and he clearly perceived the Void and the Mystery. He was entrusted with the imperial title and charged with purifying the rosy clouds of the Nine Empyreans, gazing upon the source of the Cavernous Clarity. He discerned the mechanisms of the Utmost Mystery, mastered the convergence of myriad streams, accumulated resonance in the dark convergence, and awakened the wondrous spontaneity of nature.\n\nThus, he obtained the method of riding the *Purple Ascension and Flaming Radiance* to return the spirit, soar through the empyrean, and ascend to the exalted heights of the Jade Clarity. When his Dao was complete, he transmitted it to the Central Yellow Venerable Lord.\n\n---\n\n### *The Queen Mother of the West Bestows the Scripture and Composes Three Hymns*\n\n**First Hymn:**\nShe chants and sings on the Ninefold Mystery Terrace,\nWhere cliffs and ridges congeal in chill clarity.\nHer mind aligns the six senses,\nHer eyes cast off the dust and dregs.\nFlowing rosy clouds illuminate the golden chamber,\nThe empty hall disperses mysterious fragrance.\nAccumulated resonance summons the descent of the numinous,\nThough form is solitary, its concealment is also divided.\nIn an instant, she gazes upon ten thousand kalpas,\nHow could she perceive the span of a billion cedars?\nThe flourishing garden embellishes the numinous steps,\nCinnabar jade glows in the courtyard of gems.\nThe flowing wind scatters through the Cavernous Void,\nJade pipes ride the luminous emptiness.\nPurple mist entwines the curved script,\nCinnabar radiance reflects the green canopy.\nFlying banners flourish beneath the mysterious canopy,\nFeathered tablets gleam in the Purple Clarity.\nAscending the light to the borders of the Nine Empyreans,\nShe roams and plays in the Phoenix City.\nShe wishes to receive the honored disciple,\nTo share one joy with those born at dawn.\n\n**Second Hymn:**\nShe soars with reins, guiding the mysterious radiance,\nResting in the light beyond the wilds.\nWandering in search of the numinous one,\nShe joins her form in celebration at the empyrean’s edge.\nHer hands part the vermilion gates,\nHer eyes are as vast as the divine surge.\nThe golden towers rise in majestic splendor,\nThe clear scene is free of dust and filth.\nShe loosens her robe at the Terrace of the Mysterious Vault,\nFulfilling my deepest wishes.\nDiscarding her sandals, she transcends the three difficulties,\nPreserving refinement to secure longevity.\n\n**Third Hymn:**\n*(Translation of the third hymn omitted in the provided text.)*\n\n---\n\n### *The Method of Summoning the Unbounded and Observing the Heavens Within the Central Quadrant of the Purple Ascension and Flaming Radiance*\n\nAt the inception of the Celestial Emperor’s formation, he studied the Dao of summoning the perfected. With distant thoughts and far-reaching vision, he contemplated inwardly, sitting in observation of the boundless. His cavernous contemplation pierced the hidden void. At the age of three, he mastered the central quadrant, his true spirit unveiled in clarity. He foresaw what had not yet come to pass, exhaustively surveying the bounds of the utmost heavens. No mystery was left unilluminated, no height left unattended, no depth left unregarded. Thus, he received the title of Great Emperor, bestowed through accumulated resonance—how could it have been his natural endowment?\n\nHe regularly performed this at dawn, when the celestial light had not yet brightened, and the pure radiance first emerged. He rubbed his hands together until warm, then wiped his eyes and their four corners twenty-one times. He clicked his teeth twenty-four times, swirled his tongue around his mouth, top and bottom, until the mushroom elixir and saliva arose together, and swallowed the saliva nine times.\n\nUpon completion, he covered his body with a cap and robe, lay down in stillness, and aligned the central quadrant. He ensured both inner and outer quietude, hearing no sounds. Covering his ears with his hands and closing his eyes, he inwardly visualized his body nine myriad *li* to the east, seeing mountains, rivers, grasses, trees, birds, beasts, and the peoples of the Hu and Yue as if before his eyes. He made them distinct and precise, without wavering in his contemplation. With prolonged practice, he naturally saw them.\n\nOnce they became distinct, he heard the resonant sounds of bells and drums in his ears. After a long while, he saw the immortal officials of the Eastern Marchmount, riding azure dragons and azure clouds, holding the five sacred mushrooms. They were accompanied by twelve jade maidens, clad in flying azure feathered skirts, bearing the Azure Essence Jade Embryo in a golden tray, offering it to his body.\n\nUpon seeing the immortal officials, he bowed in reverence and received it, consuming it. He tasted its sweetness, then wiped his eyes and swallowed qi nine times before stopping.\n\nAfter three years of such practice, he could see events ten thousand *li* away and hear sounds from ten thousand *li* distant, all with perfect clarity. He foresaw future auspices and inauspicious omens, the length of years, and the portents of life. His body emitted wondrous radiance, and he perceived both the exterior and interior with cavernous vision.\n\nThe Dao of summoning the unbounded is supremely wondrous; it is transmitted orally and not committed to writing.\n\nNext, he contemplated in the same manner, inwardly visualizing nine myriad *li* to the south, seeing mountains, rivers, grasses, trees, the earth’s hues, birds, beasts, and the peoples of Yue, all as if before his eyes. He made them distinct and precise, without wavering in his contemplation. With prolonged practice, he naturally saw them.\n\nOnce they became distinct, he heard the clamor of a hundred pipes in his ears. After a long while, he saw the immortal officials of the Southern Marchmount, riding flying dragons beneath cloud canopies, holding flowered banners. They were accompanied by twelve jade maidens, clad in flying azure brocade skirts, bearing the Dark Net and Crimson Fruits in a golden tray, offering them to his body.\n\nUpon seeing the immortal officials, he bowed in reverence and received them, consuming them. He tasted their sourness, then wiped his eyes nine times before stopping.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1264,
      "start_sentence": 0,
      "end_sentence": 46,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.64480710029602,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上紫度炎光神元变经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "如此三年，自然洞睹幽虚，目见万里之外，耳闻万里之音，久久为之，无不朗然，逆知方来吉凶之事，体生玉泽，面有玉光。 招无之道。 #2 次存还如上法，内存见西方九万里之外，山川土色，草木禽兽，玄老之人，如在眼前，使分明审正，不定更存，久久自然见也。 既分明，便听正耳中有金鼓之声枪枪，良久，仍见西岳仙官，乘素霞飞舆，从玉女十二人，着玄锦飞裙，赍金液丹精，盛以金拌。 既见仙官，觉礼而受之，即服，觉其味甜，便拭目，咽气九过止。 如此三年，目视洞彻，察见无穷万里之事，吉凶祸福朗睹未然，面有金光。 招无之道，其法至不得文传，口口相告。 次思如上法，内存见北方九万里之外，山川土色，草木禽兽，羌老之人，如在眼前，使分明审正，不定更存，久久自然见也。 既分明，便听耳中有钟铜之声琅琅，良久，仍见北岳仙官，乘玄云飞軿，手把五芝，从玉女十二人，着玄锦飞裙，赍琼液琅腴，盛以金柈，授与我身。 既见仙官，觉礼而受之，即服，觉其味苦，便拭目，咽气九过止。 如此三年，洞观八方，察幽究虚，坐见无穷，身轻体明，坐在立空。 招无之道，极真难宣。 次思如上法，内存己身彻见九天之上宫台，山川林木，飞禽走兽，云崖无际之端，与众真相接，群仙共言，审正分明，不定更思，久久自然分明。 既〔分明〕#3，听耳中闻有五音弦磬之声，如可听闻，良久，因见中岳仙官，乘黄霞龙，从十二玉女，着黄飞裙，手把五色华旛，赍五芝丹精，盛以金柈，授与我身。 既见仙官，仍觉礼而受之，即服，其味香，便拭目，咽炁十二过止。 紫度炎光招无至极妙法，难可口宣，行之三年，洞睹幽虚，彻见玄冥，算禄寿命，吉凶之兆，一身洞达，面生金光。 存五方既毕，起坐东向，叩齿九通，祝曰： 万化浑生，玄纲御空，回轮无声，运转四方，流光万里，洞睹空洞，三精宝曜，飞霞郁房，晨精玄注，九窍开通，四会八达，存虚招无，令我神慧，明究吉凶，骖驾玄舆，绿軿飞辕，上升太晨，进拜玉皇。 帝君内存招无洞视观天上法，事毕於此，立验之妙，殊於众用。 中方审正，一心存念，入室百日，便有彷佛将来。 三年，神冥洞彻，无不朗然，万不遣一，可谓无中希真，真为之降。 其道幽微，非世所论。 人贵禄位，我贵此道。 四海之主，求易此法，吾未闻矣。 吾道不死之根，逆知未然，洞鉴幽虚，仰测无穷，听响万里之趣，旁通天下之奇，岂复过乎。 有得之者，刻乘绿軿，飞霞玄盖，上升帝晨。 唯在宝秘，慎勿妄传，违负明科，泄露真文，身及祖师、七玄、父母，同充鬼役，身没幽泉，负考三官，艰苦备受，明慎之焉。 佩受紫度炎光，修学存真招无洞视之道，常当於别室寂处，不关人事，静念存思天下四方万里之外，山林草木禽兽，人民玄夷羌胡伧老异类，皆来朝拜己身。 又思我两目有流火之光，如星焕落赤曜，光充万里之外，四方山泽，淮济林木，皆随光明消除，极天清荡，无复尘秽，目观无极之乡，周遍洞达，无所不关。 如此皆令分明审正，叩齿九通，仰祝曰： 玄光内映，洞鉴无穷，彻视达听，九孔开张，流精奔激，万里清通，坐睹自然，逆究吉凶，得乘飞霞，上登太空。",
      "translated_text": "After three years of this practice, he naturally perceived the hidden depths of the void, his eyes seeing beyond ten thousand *li*, his ears hearing sounds from ten thousand *li* away. With prolonged cultivation, all became radiantly clear, and he could foreknow the auspicious and inauspicious events yet to come. His body took on the luster of jade, and his face shone with jade-like light. This is the Way of Summoning the Nonexistent.\n\nNext, he again contemplated as before, inwardly visualizing the lands nine ten-thousand *li* to the west: its mountains, rivers, earth’s hues, grasses, trees, birds, beasts, and the dark-haired elders, all as if before his eyes. He made them distinct and precise, without wavering in his contemplation. With prolonged practice, he naturally saw them.\n\nOnce they became distinct, he heard the clamor of gongs and drums in his ears. After a long while, he saw the immortal officials of the Western Marchmount, riding a flying chariot of pale mist, accompanied by twelve jade maidens clad in dark brocade skirts. They bore the Golden Liquid Elixir, held in a golden tray, and offered it to his body.\n\nUpon seeing the immortal officials, he bowed in reverence and received it, consuming it. He tasted its sweetness, then wiped his eyes and swallowed *qi* nine times before stopping.\n\nAfter three years of this, his vision became penetratingly clear, perceiving all events—auspicious and inauspicious, fortune and misfortune—beyond ten thousand *li* as if they had not yet come to pass. His face shone with golden light. This is the Way of Summoning the Nonexistent, a method so profound it cannot be transmitted in writing, only passed from mouth to mouth.\n\nNext, he contemplated as before, inwardly visualizing the lands nine ten-thousand *li* to the north: its mountains, rivers, earth’s hues, grasses, trees, birds, beasts, and the Qiang elders, all as if before his eyes. He made them distinct and precise, without wavering in his contemplation. With prolonged practice, he naturally saw them.\n\nOnce they became distinct, he heard the resonant chime of bells in his ears. After a long while, he saw the immortal officials of the Northern Marchmount, riding a flying chariot of dark clouds, holding the Five Mushrooms. They were accompanied by twelve jade maidens clad in dark brocade skirts, bearing the Jade Liquid and Langyu Elixir in a golden tray, offering them to his body.\n\nUpon seeing the immortal officials, he bowed in reverence and received them, consuming them. He tasted their bitterness, then wiped his eyes and swallowed *qi* nine times before stopping.\n\nAfter three years of this, he could perceive the eight directions, fathom the hidden and the void, and see beyond all limits while seated. His body became light, his essence bright, and he could sit or stand in empty space. This is the Way of Summoning the Nonexistent, so utterly true it defies description.\n\nNext, he contemplated as before, inwardly visualizing his own body piercing through to the palaces and terraces above the Nine Heavens, its mountains, forests, flying birds, and running beasts, the boundless edges of cloud cliffs, where he joined the assembled perfected ones and conversed with the host of immortals. He made them distinct and precise, without wavering in his contemplation. With prolonged practice, he naturally saw them clearly.\n\nOnce they became distinct, he heard in his ears the sounds of the five tones and chiming jade, as if audible. After a long while, he saw the immortal officials of the Central Marchmount, riding a dragon of yellow mist, accompanied by twelve jade maidens clad in yellow flying skirts. They held five-colored banners and bore the Five Mushroom Elixir in a golden tray, offering it to his body.\n\nUpon seeing the immortal officials, he bowed in reverence and received it, consuming it. He tasted its fragrance, then wiped his eyes and swallowed *qi* twelve times before stopping.\n\nThis is the Purple Radiance of the Blazing Light, the supreme and wondrous method of Summoning the Nonexistent, so profound it cannot be spoken aloud. After three years of practice, he perceived the hidden depths of the void, saw through the dark and mysterious, calculated lifespan and destiny, and discerned the omens of fortune and misfortune. His entire being became penetratingly clear, and his face shone with golden light.\n\nAfter visualizing the five directions, he rose and faced east, knocking his teeth nine times, and prayed:\n*\"The myriad transformations arise as one, the Dark Net governs the void. The turning wheel makes no sound, yet revolves through the four directions. Its flowing light spans ten thousand *li*, piercing through the empty vastness. The Three Essences, treasured luminaries, fly through the misty chambers. The morning essence infuses the dark, opening the nine apertures. The four convergences and eight reaches unite—visualizing the void to summon the nonexistent. May my spirit become wise, clearly discerning fortune and misfortune. Mounting the dark chariot, its green carriage poles soaring, I ascend to the Great Dawn and prostrate before the Jade Emperor.\"*\n\nThis is the method of the Celestial Lord’s inward visualization for Summoning the Nonexistent and penetrating sight, its efficacy immediate and unmatched. When contemplating the central direction with focused intent, after a hundred days in seclusion, faint signs will appear. After three years, the spirit will merge with the dark and penetrate all, nothing left unseen. This may be called summoning the true within the nonexistent, where the true descends. The Way is subtle and hidden, beyond worldly discourse.\n\nMen value rank and emolument; I value this Way. Even the lord of the four seas would find it difficult to obtain this method—I have never heard of it. This is the root of my undying Way: foreknowing the yet-to-be, perceiving the hidden and the void, measuring the boundless above, hearing echoes from ten thousand *li* away, and comprehending the wonders of the world—what could surpass it?\n\nThose who attain this will ride a green carriage, a canopy of flying mist and dark clouds, ascending to the Celestial Dawn. It must be treasured and kept secret; do not rashly transmit it. To violate this and reveal the true scripture is to burden oneself, one’s ancestral masters, the seven lineages, and parents with ghostly servitude, consigning the body to the dark springs and suffering the trials of the Three Officials. The hardships will be unbearable—beware and take heed.\n\nWhen receiving and practicing the Purple Radiance of the Blazing Light, the method of cultivating the true and Summoning the Nonexistent for penetrating sight, one should always do so in a separate, secluded chamber, free from worldly affairs. In stillness, contemplate and visualize the lands beyond ten thousand *li* in the four directions: their mountains, forests, grasses, trees, birds, beasts, peoples, the dark-haired Yi, Qiang, Hu, and Cang elders, and all strange beings, all coming to pay homage to one’s body.\n\nThen visualize one’s own eyes emitting flowing fire, like falling stars of crimson radiance, their light filling the space beyond ten thousand *li*. The mountains, marshes, Huai and Ji rivers, and forests all dissolve in this brilliance, the heavens becoming utterly clear and pure, free of dust and filth. The gaze reaches the boundless realm, penetrating all without obstruction.\n\nMake all this distinct and precise, knock the teeth nine times, and pray facing upward:\n*\"The dark light shines inwardly, penetrating all without limit. Sight and hearing become piercingly clear, the nine apertures open wide. Flowing essence rushes forth, ten thousand *li* of purity unobstructed. Seated, I perceive the natural, foreknowing fortune and misfortune. Mounting the flying mist, I ascend to the great void.\"*",
      "overlap_context": "s in his ears. After a long while, he saw the immortal officials of the Southern Marchmount, riding flying dragons beneath cloud canopies, holding flowered banners. They were accompanied by twelve jade maidens, clad in flying azure brocade skirts, bearing the Dark Net and Crimson Fruits in a golden tray, offering them to his body.\n\nUpon seeing the immortal officials, he bowed in reverence and received them, consuming them. He tasted their sourness, then wiped his eyes nine times before stopping.",
      "start_char": 1264,
      "end_char": 2499,
      "start_sentence": 47,
      "end_sentence": 78,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.439902544021606,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上紫度炎光神元变经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "毕，引炁咽液七过止。 若能修行此道，百日之中，便有彷佛将来，三年目睹空洞，坐见万里之外，耳闻万里之音。 至极妙道，非可文传，口口相付，审受秘言。 流金火铃 流金火铃，以太上大道君游宴之玄光，上激九天之威，下灭六天之凶，玄光虚映道君之项，流照八极三十万里。 三天立正之初，罢除六天之始，以传太微天帝君。 神文藏於琼宫玉房之内，虚光自明，焕赫上清，飞龙毒兽翼其侧，紫云玄晖盖其巅，玉华之女、金真之童各三百人，典卫灵文，散香虚庭。 积七千年，化生五符，光彻八方，因有五方营卫之官。 太微天帝君，以传金阙后圣道君，后圣道君以付上相青童君，使授诸为真人者，佩游上清。 学真之夫，而无流金火铃，项生圆光，皆不得上登三光。 若有金骨玉质，玄名青宫，得受此文，佩之而行，诸天诸地四海五岳，率天众圣仙官，莫不稽首来迎，神光骇动，所制不轻，三元立遣玉童玉女三十六人，侍卫其身。 佩之九年，得乘八景玉舆，飞行太空。 流金火铃者，九星之精，一名圆光。 太上之威章，生於九天之先，结炁成文，光明焕赫，照彻十方，悬精垂映太上之项。 积十千年，化生五铃神符，玄降太微天帝君，威摄极天之魔，神布九霞之庭，率天以下，莫不总统。 太上大道君宝秘此道，告下普天主司真仙，纠察轻泄。 有真仙之才，得佩此符，不依玄科而轻付非真，秽慢灵文，皆七祖受殃，考及先师，同充鬼官。 以紫缯二尺二寸，朱书戴之头上。 若有金名玉骨，得佩此文，皆宿命应仙。 佩符之身，出入游行，常当存想己身项上有圆光，映照三十万里之外。 九年之中，勤心念真，清斋笃志，克得真灵下降，圆光自明，乘空而行，坐存立亡。 五钤登空步虚保仙上符一名火铃 太微天帝君受炁之始，玄象初分，登九玄虚生之台，五帝神官卫於八方，五符空映，若存若亡，晻蔼凤台之上，琼房曲室之内。 积七千年，其文见焉，流光曜於九天，宝文郁焕乎玉清，左掷则为流金火铃，右振则冠豁落七元，摄制极天之魔，威布九霞之庭，至极妙道，洞微难胜。 帝君方清斋太空琼台，洞真之殿玉室金华之房，侍女众真、五色神官十亿万人，飞兽毒龙，侠阙备门，巨虬千寻，卫於墙岸，凤鸣龙啸，百音激馆，威扬广庭，狮子嗥唤，众吹灵歌，玉响流璨，神妃合唱而奏音，玉女鸣弦而批弹。 余乃引中央黄帝老君、太极四真人，设流霞之醴，环刚之果，赤树白子，隐芝杂结，众香芬落，积九十日。 於是龟母按笔，太一拂筵，天妃侍香，玉华结编，以白玉为简，金书其文，以付仙都左公，封以玉笈云锦之囊，传付中央黄老君，依盟奉受五符，稽首而退。 即致九灵流景云舆，五色神官五万人，飞青翠羽龙帔，上登金阙玉清之宫。 若有金书东华，得见此文，则宿运应仙。 佩符而行，万神来朝，出虚入宿，回巅五岳，运度五星，身生水火，变化十方。 佩之九年，降致绿軿，上谒三元，位登玉清。 其道秘妙，非真不传，轻泄篇目，身没形残。 依玄真明科，七千年得传一人，违盟负誓，殃及七玄，身及先师，同充下鬼，十苦八难。 青帝碧霞流铃登空步虚上符 东方青帝元洞元明元曜延灵曜元君各九千人，青阳玉童九十人侍文左；",
      "translated_text": "Upon completion, draw in *qi* and swallow saliva seven times, then cease.\n\nShould one cultivate this Dao, within a hundred days, faint traces will appear; in three years, the eyes will perceive the hollow void, seated one may see beyond ten thousand *li*, the ears hear sounds from ten thousand *li* away. The ultimate and wondrous Dao cannot be transmitted through writing—it is passed mouth to mouth, received with solemn secrecy.\n\n**Flowing Gold Fire Bell**\n\nThe Flowing Gold Fire Bell employs the radiant *qi* of the Most High Lord of the Great Dao in his wanderings and feasts, striking upward to rouse the might of the Nine Heavens, annihilating below the inauspicious forces of the Six Heavens. The void-reflected radiance of the Lord of the Dao crowns his neck, its flowing light illuminating the eight directions for three hundred thousand *li*.\n\nAt the inception of the Three Heavens’ rectification, when the Six Heavens were abolished, it was transmitted to the Celestial Emperor of the Grand Tenuity. The divine scripture is concealed within the Jade Palace’s chambers of crystal, its void-light self-luminous, resplendent in the Supreme Clarity. Flying dragons and venomous beasts flank its sides, purple clouds and dark radiance canopy its summit. Jade Flower maidens and Golden Perfected youths, three hundred each, attend the numinous scripture, scattering incense in the void courtyard.\n\nAfter seven thousand years, it transformed into five talismans, their light penetrating the eight directions, giving rise to the officials of the Five Quarters’ protective encampments. The Celestial Emperor of the Grand Tenuity transmitted it to the Posterior Sage Lord of the Golden Portals, who entrusted it to the Azure Lad of the Left Minister, charging him to confer it upon those who attain Perfected status, that they might wear it and wander the Supreme Clarity.\n\nThose who study the Real yet lack the Flowing Gold Fire Bell, whose necks do not bear the halo of radiance, shall not ascend to the Three Luminaries. Only those with bones of gold and jade, whose names are inscribed in the Azure Palace, may receive this scripture. Wearing it as they walk, all heavens and earths, the Four Seas and Five Peaks, the hosts of celestial saints and immortal officials, will bow in reverence, their divine lights startled into motion. Its command is not to be taken lightly: the Three Primes dispatch thirty-six Jade Lads and Maidens to attend and guard their person. After wearing it for nine years, one may ride the Eight Effulgences Jade Chariot, soaring through the Great Void.\n\nThe Flowing Gold Fire Bell is the essence of the Nine Stars, also called the Halo of Radiance. The mighty seal of the Most High arose before the Nine Heavens, congealing *qi* into script, its luminous brilliance blazing through the ten directions, its suspended essence casting its reflection upon the neck of the Most High. After ten thousand years, it transformed into five bell talismans of divine power, descending to the Celestial Emperor of the Grand Tenuity, who wielded its might to subdue the demons of the farthest heavens, its numinous presence spreading through the courts of the Nine Auroras, commanding all beneath the heavens without exception.\n\nThe Most High Lord of the Great Dao treasures and conceals this Dao, instructing the celestial overseers of the myriad heavens’ Perfected Immortals to investigate and punish those who lightly divulge it. Should one possess the talent of a Perfected Immortal and receive this talisman, yet transmit it carelessly to the unworthy, defiling the sacred scripture with irreverence, their seven ancestors will suffer calamity, their former masters will be examined, and all will be consigned to the offices of ghosts.\n\nInscribe it in vermilion upon two feet and two inches of purple silk, and wear it upon the head. Those with names of gold and bones of jade who receive this scripture are destined by past lives to become immortals. As they wear the talisman and move about, they must constantly visualize a halo of radiance crowning their necks, illuminating beyond three hundred thousand *li*. Within nine years, through diligent devotion to the Real, fasting with single-minded resolve, they may summon the descent of true numina, their halo shining of its own accord, allowing them to ride the void, seated or standing, to command life and death.\n\n**Five Bells Ascending Void, Treading Emptiness, Preserving Immortality Talisman—also called Fire Bell**\n\nWhen the Celestial Emperor of the Grand Tenuity first received *qi*, at the primordial division of the dark image, he ascended the Terrace of Ninefold Mystery’s Void Generation. The Five Thearchs’ divine officials guarded the eight directions; the five talismans’ void-reflected light flickered between presence and absence, veiled in mist upon the Phoenix Terrace, within the winding chambers of the crystal palace.\n\nAfter seven thousand years, the scripture manifested, its flowing light blazing through the Nine Heavens, its precious scripture glowing richly in the Jade Clarity. Cast to the left, it becomes the Flowing Gold Fire Bell; shaken to the right, it becomes the Diadem of the Seven Primes’ Dispersal, subduing the demons of the farthest heavens, its might spreading through the courts of the Nine Auroras. The ultimate and wondrous Dao is profound and subtle beyond measure.\n\nThe Celestial Emperor then fasted in the void upon the Crystal Terrace, within the Jade Chamber of the Cavern Real’s Hall, the Golden Flower’s chambers. Attendant maidens and host Perfected, ten myriad myriad multicolored divine officials, flying beasts and venomous dragons flanked the portals, guarding the gates. Serpents of a thousand *xun* patrolled the walls; phoenix cries and dragon roars, a hundred sounds, echoed through the halls. Might resounded through the vast courtyard; lions roared; celestial hymns were sung; jade tones flowed like scattered gems. Divine consorts harmonized in song; Jade Maidens plucked and strummed the strings.\n\nThereupon, I summoned the Central Yellow Thearch Lord Lao and the Four Perfected of the Great Ultimate, offering dew of flowing auroras and fruits of adamantine rings, red trees with white seeds, intertwined hidden mushrooms, and myriad fragrances wafting for ninety days.\n\nThen the Tortoise Mother held the brush, the Great One swept the mat, Heavenly Consorts attended the incense, Jade Flowers bound the scroll. Inscribed upon white jade slips in golden script, it was entrusted to the Left Duke of the Immortal Capital, sealed in a cloud-brocade satchel of jade cases, and transmitted to the Central Yellow Thearch Lord Lao. In accordance with the covenant, he received the Five Talismans, bowed, and withdrew. Immediately, he summoned the Nine Numinous Flowing Effulgence Cloud Chariot, fifty myriad Five-Colored Divine Officials, clad in azure kingfisher-feathered dragon capes, ascending to the Golden Portals and Jade Clarity’s palaces.\n\nShould one’s name be inscribed in the Eastern Florescence and behold this scripture, their past destiny calls them to immortality. Wearing the talisman as they walk, the myriad spirits come to pay homage. Emerging from the void, entering the constellations, circling the Five Peaks, traversing the Five Stars, their bodies generate water and fire, transforming the ten directions. After wearing it for nine years, green chariots descend to convey them upward to the Three Primes, where they ascend to the rank of Jade Clarity.\n\nThis Dao is secret and wondrous, transmitted only to the true. Those who lightly divulge its passages will perish, their forms destroyed. According to the luminous statutes of the Mysterious Real, it may be transmitted to one person every seven thousand years. Those who violate the covenant and betray their oaths will bring calamity upon their seven lineages, themselves and their former masters alike consigned to the lower ghosts, enduring ten torments and eight tribulations.\n\n**Azure Thearch, Azure Auroras, Flowing Bell, Ascending Void, Treading Emptiness, Supreme Talisman**\n\nThe Nine Thousand Perfected of the Eastern Azure Thearch’s Primal Cavern, Primal Clarity, Primal Radiance, and Extended Numinous Radiance, each accompanied by ninety Azure Yang Jade Lads attending the scripture to the left...",
      "overlap_context": "h. The gaze reaches the boundless realm, penetrating all without obstruction.\n\nMake all this distinct and precise, knock the teeth nine times, and pray facing upward:\n*\"The dark light shines inwardly, penetrating all without limit. Sight and hearing become piercingly clear, the nine apertures open wide. Flowing essence rushes forth, ten thousand *li* of purity unobstructed. Seated, I perceive the natural, foreknowing fortune and misfortune. Mounting the flying mist, I ascend to the great void.\"*",
      "start_char": 2499,
      "end_char": 3734,
      "start_sentence": 79,
      "end_sentence": 113,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.78339648246765,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上紫度炎光神元变经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "东岳太山仙官二千四百人，青腰玉女九十人侍卫灵文右，卫佩符某甲身。 赤帝丹霞流铃登空步虚上符 南方赤帝大洞元生大灵机皇君各八千人，绛宫玉童八十人侍文左； 南岳衡山仙官二千四百人，大丹赤圭玉女八十人侍文右，卫佩符某甲身。 白帝青霞流铃登空步虚上符 西方白帝金城曜元元导太仙君六千人，耀灵元化玉童六十人侍文左； 西岳华山仙官二千四百人，太素玉女六十人侍文右，卫佩符某甲身。 黑帝绿霞流铃登空步虚上符 北方黑帝玄洞元阴五耀延灵元华郁单君各五千人，皇机太极玉童五十人侍文左； 北岳恒山仙官二千四百人，太玄玉女五十人侍文右，卫佩符某甲身。 黄帝苍霞流铃登空步虚上符 中央黄帝中耀五阳五阴中皇洞极高皇君各千二百人，皇机执中玉童十二人侍文左； 中岳嵩山仙官各二千四百人，黄素玉女十二人侍文右，卫佩符某甲身。 男以丹书青素佩之左，女以黄书白素佩之右。 流金火铃内存振威大祝神慧 修佩流金火铃，出入远近，经履危险寇病之中，厄害之下，当存真光以自卫，开道万里之路。 发行之始，正向其方，叩左齿二七通，咽炁三十六过，便思所在之处形象，山林草木，人民禽兽神灵，分明朗然，皆来朝拜我身。 思北斗七星覆我头上，仍存我左目为奔星，右目为迅电，其光焕赫奔星九万里外，见所之道路随光开通，山林草木，人民屋宅，兵寇鬼炁，令消除无复孑遗，四道豁然，因祝曰： 前开后闭，天平地昂，神公出游，四道开张，当令天地，通我桥梁，前后左右，洞达八方，左掷奔星，右迅电光，流火万里，何妖敢当，太一将送，万神来迎，有所之向，靡不吉良，乘云驾虚，上升太空。 毕，引二目之精各还其宫，左取七炁，右取七炁咽之，毕。 如此可以冒险涉难，攻鬼伐兵，无不应响荡然。 其法至妙，不得妄传。 五帝流铃五符，威制极天之魔，召摄五方神灵，上应五晨，参落七元，下应人身，九孔七明，周天竟地，靡有不关，无幽不测，细无不鉴，存符财先，掷符则振威，子若佩之，口受师言。 若在人间遇恶鬼之地，当作振威大祝，北向闭炁十二息，思五方炁覆冠一身，内外朗明，都无所见。 因叩齿三十六通，咽五方炁，方启三咽炁除，尽入兆身，存我两目童子光如流星，焕落五方，便祝曰： 天元七精，五帝流铃，焕掷电光，如天奔星，光曜十方，照鬼真形，有何小妖，当我生门，太上有命，诛戮无亲，屠肝刳腹，绝灭鬼精，千千皆摧，万万皆倾，神威吐祝，摄录无停。 〔毕〕，#4便咽炁三十六过止。 如此一祝，则五方神官皆保甲命，卒录所在有灵之炁，束缚诣庭，三祝则鬼王灭种。 若入五岳，周游山川，冒险履峻，皆当未及其处百步，叩左齿三十六通。 若之东岳，便存东方青帝希林珠官属九千人，卫我前后左右，以青霞之炁覆冠我身； 若之南岳，便存南方赤帝丹玄子官属八千人，卫我前后，以绛霞之炁覆冠我身； 若之西岳，存西方白帝少皓灵官属五千人，卫我前后，以素霞之炁覆冠我身； 若之北岳，当存北方黑帝玄冥皓官属五千人，卫我前后，以皂霞之炁覆冠我身； 若之中岳，当存中央黄帝执中元官属万二千人，卫我前后，以黄炁覆冠一身。 毕，祝曰：",
      "translated_text": "The Eastern Marchmount Mount Tai’s immortal officials, two thousand four hundred in number, with ninety Azure-Waisted Jade Maidens attending the numinous scripture to the right, guard and bear the talisman upon the body of so-and-so.\n\n**Crimson Thearch, Cinnabar Auroras, Flowing Bell, Ascending Void, Treading Emptiness, Supreme Talisman**\n\nThe Southern Thearch’s Primal Cavern, Primal Life, Great Numinous Mechanism, and Sovereign August Lords of the South, eight thousand each, with eighty Vermilion Palace Jade Lads attending the scripture to the left; the Southern Marchmount Mount Heng’s immortal officials, two thousand four hundred in number, with eighty Great Cinnabar Vermilion Jade Maidens attending the scripture to the right, guard and bear the talisman upon the body of so-and-so.\n\n**White Thearch, Azure Auroras, Flowing Bell, Ascending Void, Treading Emptiness, Supreme Talisman**\n\nThe Western Thearch’s Golden Citadel, Radiant Primal, Primal Guide, and Supreme Immortal Lords of the West, six thousand each, with sixty Effulgent Primal Transformation Jade Lads attending the scripture to the left; the Western Marchmount Mount Hua’s immortal officials, two thousand four hundred in number, with sixty Pristine Jade Maidens attending the scripture to the right, guard and bear the talisman upon the body of so-and-so.\n\n**Black Thearch, Verdant Auroras, Flowing Bell, Ascending Void, Treading Emptiness, Supreme Talisman**\n\nThe Northern Thearch’s Mysterious Cavern, Primal Yin, Five Radiant Extensions, and August Flowering Solitary Lords of the North, five thousand each, with fifty August Mechanism Supreme Ultimate Jade Lads attending the scripture to the left; the Northern Marchmount Mount Heng’s immortal officials, two thousand four hundred in number, with fifty Supreme Mystery Jade Maidens attending the scripture to the right, guard and bear the talisman upon the body of so-and-so.\n\n**Yellow Thearch, Verdant Auroras, Flowing Bell, Ascending Void, Treading Emptiness, Supreme Talisman**\n\nThe Central Thearch’s Central Radiance, Five Yang, Five Yin, and Central August Cavern Ultimate High Sovereign Lords, one thousand two hundred each, with twelve August Mechanism Upholding Center Jade Lads attending the scripture to the left; the Central Marchmount Mount Song’s immortal officials, two thousand four hundred in number, with twelve Yellow Pristine Jade Maidens attending the scripture to the right, guard and bear the talisman upon the body of so-and-so.\n\nMen inscribe in cinnabar upon azure silk and wear it to the left; women inscribe in yellow upon white silk and wear it to the right.\n\n**Flowing Gold Fire Bell, Internally Store the Invocation of Mighty Might, Divine Wisdom**\n\nWhen wearing the Flowing Gold Fire Bell, whether traveling near or far, passing through perilous places beset by bandits or illness, or beneath calamitous harm, one must concentrate on the true light to guard oneself, opening a path of ten thousand miles. At the outset of a journey, face directly toward the direction, strike the left teeth twice seven times, and swallow qi thirty-six times. Then visualize the forms of the place—its mountains, forests, grasses, trees, people, birds, beasts, and spirits—all clearly and brightly coming to pay homage to one’s body. Envision the Seven Stars of the Northern Dipper covering one’s head, then concentrate on one’s left eye as a Shooting Star and the right eye as Swift Lightning, their radiance blazing forth. The Shooting Star shines ninety thousand miles away, revealing the path ahead, its light parting mountains, forests, grasses, trees, people’s dwellings, soldiers, bandits, and ghostly qi, causing them to vanish without a trace, the four roads suddenly clear. Then recite the incantation:\n\n*\"Ahead opens, behind closes,\nHeaven levels, earth rises.\nDivine lords go forth,\nThe four roads open wide.\nLet heaven and earth\nBecome my bridge.\nBefore and behind, left and right,\nAll eight directions penetrate.\nTo the left, I cast the Shooting Star,\nTo the right, Swift Lightning’s glow.\nFlowing fire spans ten thousand miles—\nWhat demon dares stand before me?\nThe Great One escorts,\nTen thousand spirits come to greet.\nWherever I turn,\nAll is auspicious and good.\nRiding clouds, mounting the void,\nI ascend to the Great Emptiness.\"*\n\nWhen finished, draw the essence of both eyes back to their palaces. Inhale seven qi from the left, seven qi from the right, and swallow them. Thus, one may brave dangers and traverse difficulties, subdue ghosts and vanquish soldiers, with all responding instantly and resoundingly. This method is most wondrous and must not be recklessly transmitted.\n\nThe Five Thearchs’ Flowing Bells and Five Talismans command the demons of the utmost heavens, summon and bind the spirits of the five directions, correspond above to the Five Mornings and align with the Seven Origins, respond below to the human body’s nine orifices and seven luminaries, encircle heaven and earth, leaving nothing unconnected, no darkness unprobed, no detail unseen. When concentrating on the talisman, first store its power; when casting it, manifest its might. If you wear it, receive the master’s oral instructions.\n\nShould you encounter a place haunted by malevolent ghosts in the human realm, perform the Invocation of Mighty Might. Face north, hold the breath for twelve cycles, and envision the qi of the five directions covering your crown and entire body, inside and out, radiantly clear, with nothing visible. Then strike the teeth thirty-six times, swallow the qi of the five directions, and with each swallow, expel the qi of the three directions, allowing all to enter your body. Concentrate on the light of your eyes’ pupils like shooting stars, blazing in the five directions, and recite the incantation:\n\n*\"Celestial Origin’s Seven Essences,\nFive Thearchs’ Flowing Bells,\nBlazing, casting lightning’s glow,\nLike celestial shooting stars.\nRadiance illumines the ten directions,\nRevealing ghosts’ true forms.\nWhat petty demon\nDares approach my gate of life?\nThe Supreme has decreed:\nSlay without mercy,\nSever livers, carve bellies,\nExterminate ghostly essences.\nThousands upon thousands all shattered,\nMyriads upon myriads all toppled.\nDivine might utters the incantation,\nBinding and seizing without cease.\"*\n\nWhen finished, swallow qi thirty-six times to conclude. With this single incantation, the five directions’ divine officials will all protect your life, swiftly seizing the numinous qi of the place and binding it to appear before you. Three recitations will exterminate the ghost king’s lineage.\n\nWhen entering the Five Marchmounts, traversing mountains and rivers, braving dangers and scaling peaks, one must, a hundred paces before reaching the place, strike the left teeth thirty-six times. If going to the Eastern Marchmount, envision the Eastern Thearch’s Azure Emperor, the Rare Forest Pearl Officials and their retinue of nine thousand, guarding your front, back, left, and right, with the qi of Azure Auroras covering your crown. If going to the Southern Marchmount, envision the Southern Thearch’s Crimson Emperor, the Cinnabar Mystery Master and his retinue of eight thousand, guarding your front and back, with the qi of Vermilion Auroras covering your crown. If going to the Western Marchmount, envision the Western Thearch’s White Emperor, the Lesser Radiant Spirit and his retinue of five thousand, guarding your front and back, with the qi of Pristine Auroras covering your crown. If going to the Northern Marchmount, envision the Northern Thearch’s Black Emperor, the Mysterious Darkness Radiance and his retinue of five thousand, guarding your front and back, with the qi of Dark Auroras covering your crown. If going to the Central Marchmount, envision the Central Thearch’s Yellow Emperor, the Upholding Center Primal Officials and their retinue of twelve thousand, guarding your front and back, with the qi of Yellow covering your entire body. Then recite the incantation:",
      "overlap_context": "oaths will bring calamity upon their seven lineages, themselves and their former masters alike consigned to the lower ghosts, enduring ten torments and eight tribulations.\n\n**Azure Thearch, Azure Auroras, Flowing Bell, Ascending Void, Treading Emptiness, Supreme Talisman**\n\nThe Nine Thousand Perfected of the Eastern Azure Thearch’s Primal Cavern, Primal Clarity, Primal Radiance, and Extended Numinous Radiance, each accompanied by ninety Azure Yang Jade Lads attending the scripture to the left...",
      "start_char": 3734,
      "end_char": 4986,
      "start_sentence": 114,
      "end_sentence": 148,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.130040645599365,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上紫度炎光神元变经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "乾天耀灵，七晨玄精，五斗华盖，绕络我形，五色飞霞，混合交并，身佩七元，流金火铃，焕掷无方，极天郁冥，五帝神官，驱策天兵，为我摄制，山川土地，千鬼万灵，皆来束首，自送真形，前诛后戮，所捕无停。 毕。 如此一祝，天魔灭迹，万神来朝，游行五岳，履涉山川，无复试观之患，五岳仙官自奉送五芝五生玉英，来给子身。 若在军寇之中，悬白刃之下，厄难之中，当叩右齿十二通，存七星覆身，玄光洞映，周匝一体。 存肝为岁星，出在左； 肺为太白，出右； 心为荧惑，出在前； 肾为辰星，出在后； 脾为镇星，出在胸上。 令五星精炁缠绕前后，我身居斗魁之中，五星之下。 次存五帝神官卫我左右，祝曰： 天为我屋，地为我床，五岳山川，为我桥梁，玄斗元精，为我衣裳，藏身七元之内，流火之乡，度我者太一务猷，过我者白元无英，灾不能干，兵不能伤，当令我身，上诣金阙，九老之京。 毕。 如此在屈厄之中，垂终之命便得解脱。",
      "translated_text": "The Radiant Spirits of Qian Heaven, the Seven Luminaries’ Mysterious Essences, the Five Dipper’s Florid Canopy encircle and bind my form. Five-hued flying auroras intermingle and merge, my body girded with the Seven Primes, streaming with golden fire-bells, flashing and hurling boundlessly, reaching the utmost heights of heaven’s obscurity. The Five Thearchs’ divine officials command the celestial hosts to seize and restrain for me: the mountains and rivers, the earth gods, the thousand ghosts and ten thousand spirits all come to bow their heads, offering up their true forms. Those before are executed, those behind are slain—none captured escape. Thus concluded.\n\nWith this single incantation, the demons of heaven vanish without trace, and the myriad spirits come to pay homage. When roaming the Five Marchmounts, treading the mountains and rivers, you shall suffer no trials or perils. The immortals of the Five Marchmounts will themselves present the Five Mushrooms and Five Vital Jade Flowers to sustain your body.\n\nIf amidst military siege, beneath the hanging blades of execution, or in dire straits, knock the right teeth twelve times, envision the Seven Stars covering your body, their mysterious light penetrating and illuminating, surrounding you entirely. Envision the liver as Jupiter, emerging on the left; the lungs as Venus, emerging on the right; the heart as Mars, emerging before you; the kidneys as Mercury, emerging behind; the spleen as Saturn, emerging above the chest. Let the essences of the Five Stars coil around your front and back, your body dwelling within the Dipper’s Bowl, beneath the Five Stars.\n\nThen envision the Five Thearchs’ divine officials guarding your left and right, and recite the incantation:\nHeaven is my roof,\nEarth is my bed,\nThe Five Marchmounts and rivers are my bridges,\nThe Mysterious Dipper’s Primal Essence is my raiment.\nConcealed within the Seven Primes,\nIn the land of flowing fire,\nHe who measures me is Taiyi Wuyou,\nHe who passes me is Baiyuan Wuying.\nDisaster cannot assail,\nWeapons cannot harm.\nMay my body ascend to the Golden Gates,\nThe Capital of the Nine Elders.\nThus concluded.\n\nIn such dire straits, even at the brink of death, you shall attain liberation.",
      "overlap_context": "wn. If going to the Northern Marchmount, envision the Northern Thearch’s Black Emperor, the Mysterious Darkness Radiance and his retinue of five thousand, guarding your front and back, with the qi of Dark Auroras covering your crown. If going to the Central Marchmount, envision the Central Thearch’s Yellow Emperor, the Upholding Center Primal Officials and their retinue of twelve thousand, guarding your front and back, with the qi of Yellow covering your entire body. Then recite the incantation:",
      "start_char": 4986,
      "end_char": 5369,
      "start_sentence": 149,
      "end_sentence": 162,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.255371809005737,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上紫度炎光神元变经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "五色锦各五十尺，以请五帝仙官。 紫金五两，誓五方之信。 沉香五斤，上闻三元。 真珠一两，以为盟丹之誓。 书刀子一枚，以为断死气之路。 金珠七枚，以奉七元之精。 绛纹七十尺，以为炎光之炁。 凡授符经之身，当宝信诣师，清斋三日，沐浴烧香，书符及经，露置高坛之上一宿，明朝共登坛，告北帝，启盟文，度符经付弟子。 自不登坛告誓，不得妄开篇目，师轻泄经文，身被风刀之考，弟子不受而披卷，殃及七玄，身残失明。 四极之科，禁轻泄经文，太经之律，禁无盟誓。 自非金名玉格，莫得闻见。 求仙之夫，先无五符佩身，五岳仙官不卫兆形，鬼箓不落死名，栖身岩岫则为九天魔王所败，出入人间则不免官横刃兵。 得佩之者，上天覆护，纵横无方，适意周旋。 存思真人还复本宫，五芝五生，身映玉光，仙官防卫，三元诣房，乘云驾虚，上升玉清。 受符百日，当以五寸桐板五枚书符，各着一板上。 又书刺各一枚，记某年月朔某日某子，某郡某乡某岳先生王甲，年若干，某帝子属某岳。 以符刺埋着五岳，临埋符时，叩齿三十六通，祝曰： 上启三元，玉皇帝尊，下告五岳，五色仙官，奉受流铃，五符真言，清斋五香，记名山川，请定真仙，来卫我形，五芝流黄，黑白赤青，身生水火，焕落火铃，龙辔诣房，上登玉庭。 如此，即五方仙官防卫兆身，授子神真之道，游行五岳山海，百灵莫不来朝。 帝君夜照神烛 夜照神烛，乃九天真王授於太微天帝君。 登九层之台，金辉紫兰之殿，玉房之内，明神烛於五帝，礼愿修行，按篇祝念精思，九百日中，神感灵应，遂致五帝降以灵符，虚生五方，焕乎上清，光鲜内照，洞映虚无，览之不测，毁之不亡，晖曜琼房。 七百年中，神文乃见，五色之兽，卫符侠灯，记为夜照神烛通光灵符，五色焕烂，洞彻五方。 帝君方退斋上清，以紫金铸文，受於太空之中，灵瑞告启，乃使龟母按笔，太一拂筵，书以金简，结以紫绳，付仙都左公掌录，琼宫紫云蔼其上，虚馥散其烟，玉童侍卫三十六人，传付金阙后圣九玄帝君，上相青童君，后授后学应为真人者。 此法宝秘，不传下世，有金骨玉髓，名参青宫，录字上清，当得此文。 有得之者，便成真人，行之九年，神光自生，体朗炁清，乘虚驾空，上造帝堂。 青帝神烛颂：安灯烛於东方，人定入室东向，叩齿九通，冥目内存东方青炁光明，覆满一室，心拜灯前，长跪颂曰：霭霭玄真初，飙飙炁高澄，元绪无方纪，羽章朗而兴，寻求履万劫，太辉降神灯，洗荡七玄难，苦魂皆超腾，空生自然光，身轻乘云升。 赤帝神烛颂：安灯烛於南方，叩齿九通，冥目内存南方赤炁光明，覆满一室，心拜於灯前，长跪颂曰：太虚生空洞，无形复无响，寂寂元始内，三素生云景，幽室何寥寥，明灯以通想，朗睹自然光，三晨同体象。 白帝神烛颂：安灯烛於西方，叩齿九通，冥目内存西方白炁光明，覆满一室，心拜灯前，长跪颂曰：三灵吐奇华，经络九重霄，夜光无瑕翳，宝耀越度交，洞映无穷野，朝彻入太幽，拔出九玄苦，福隆积祸消。 黑帝神烛颂：安灯烛於北方，叩齿九通，冥目存北方黑炁，覆满一室，拜灯前，跪颂曰：朗哉太阳辉，神光洞三清，炁散玄漠内，虚烟生紫庭，控御乘飞霞，飘飘凌无形，拔我七玄祖，南宫更受生，长与三光齐，极天无危倾。",
      "translated_text": "Five bolts of five-colored brocade, each fifty feet in length, to entreat the divine officials of the Five Thearchs. Five taels of purple gold, as pledge of faith to the Five Directions. Five catties of agarwood, to ascend and reach the Three Primes. One tael of true pearls, as oath for the cinnabar covenant. One writing knife, to sever the path of deathly qi. Seven gold pearls, to offer to the essences of the Seven Primes. Seventy feet of crimson silk, to embody the qi of blazing radiance.\n\nFor all who receive the talismanic scriptures, they must present precious pledges to their master, purify themselves with a three-day fast, bathe, burn incense, and inscribe the talismans and scriptures. These are then placed in the open upon a high altar for one night. At dawn, master and disciple ascend the altar together, report to the Northern Thearch, present the covenant text, and transmit the talismanic scriptures to the disciple.\n\nShould one fail to ascend the altar and make the oath, they must not rashly open the scrolls. If the master carelessly divulges the scriptures, their body will suffer the trial of the wind-knife. If the disciple receives them but unfurls the scroll, calamity will extend to the Seven Mysteries, leaving them maimed and blind. The statutes of the Four Poles forbid the careless divulgence of scriptures; the laws of the Great Scriptures forbid transmission without covenant oaths. Unless one’s name is inscribed in gold and jade, they shall not hear or see them.\n\nFor those who seek immortality: without the Five Talismans worn upon the body, the immortal officials of the Five Marchmounts will not guard their form, the registers of the dead will not shed their mortal names. Dwelling in mountain caves, they will be overpowered by the Demon Kings of the Nine Heavens; venturing among men, they will not escape official oppression or the blade of weapons. Those who wear the talismans shall be sheltered by Heaven above, moving freely without restraint, their will circulating without hindrance.\n\nEnvisioning the perfected ones returning to their original palaces, the Five Mushrooms and Five Lives manifest, their bodies suffused with jade radiance. Immortal officials stand guard, the Three Primes attend their chambers, they ride clouds and mount the void, ascending to the Jade Clarity.\n\nOne hundred days after receiving the talismans, take five five-inch paulownia boards and inscribe each with a talisman. Also prepare five inscribed tablets, recording the year, month, and day of the new moon, the name of the disciple (e.g., Wang of such-and-such commandery, such-and-such village, Master of the Marchmounts), their age, and which Thearch’s child they belong to, and which Marchmount they are affiliated with. Bury the talismans and tablets at the Five Marchmounts. At the moment of burial, knock the teeth thirty-six times and recite the prayer:\n\n*I report above to the Three Primes, the Jade Emperor the Venerable; below I announce to the Five Marchmounts and the divine officials of the Five Colors. Having received the Flowing Bell and the true words of the Five Talismans, I fast with five incenses and inscribe my name upon the mountains and rivers. I entreat the perfected immortals to come and guard my form. The Five Mushrooms—yellow, black, white, red, and blue—flow forth; my body generates water and fire; the Fire Bell shines brilliantly. With dragon reins, I ascend to my chamber, mounting the Jade Court.*\n\nThus, the immortal officials of the Five Directions will guard the disciple’s body, transmitting the Way of divine perfected ones. Roaming the Five Marchmounts and seas, the hundred spirits will all come to pay homage.\n\n---\n\n**The Divine Candle of Night Illumination**\n\nThe Divine Candle of Night Illumination was bestowed upon the Thearch of the Grand Tenuity by the Perfected King of the Nine Heavens. Ascending a nine-tiered terrace, within the golden halls of purple orchids, the jade chambers, the divine candle is lit before the Five Thearchs. With reverent vows and disciplined practice, following the scriptures, reciting prayers, and concentrating the mind, after nine hundred days, the spirit is moved and the numinous responds. Thereupon, the Five Thearchs descend with their spirit talismans, void-born in the Five Directions, resplendent in the Highest Clarity. Their inner radiance shines brilliantly, illuminating the void, unfathomable to gaze upon, indestructible even if burned, their brilliance illuminating the jade chambers.\n\nAfter seven hundred years, the divine scripture appears. Five-colored beasts guard the talisman beside the lamp, recorded as the Divine Candle of Night Illumination, the Numinous Talisman of Penetrating Light. Five colors blaze resplendently, piercing through the Five Directions.\n\nThe Thearch then retreats to fast in the Highest Clarity. With purple gold, the scripture is cast in the midst of the Great Void. Auspicious omens announce its revelation. The Mother of Turtles holds the brush, the Great One brushes the mat. Inscribed upon gold tablets, bound with purple cords, it is entrusted to the Left Duke of the Immortal Capital for safekeeping. Above, jade palaces and purple clouds gather; below, ethereal fragrance scatters like mist. Thirty-six jade lads stand in attendance, transmitting it to the Nine Mysterious Thearchs of the Golden Gates, the Posterity of the Sage, and the Green Lad of the Highest Minister. Later, it is passed to worthy disciples destined to become perfected ones.\n\nThis dharma-treasure is secret, not transmitted to the lower world. Only those with bones of gold and marrow of jade, whose names are recorded in the Green Palace and inscribed in the Highest Clarity, may receive this scripture. Those who obtain it shall become perfected ones. Practicing for nine years, their divine radiance will naturally arise, their bodies luminous, their qi pure. Riding the void and mounting the sky, they ascend to the Thearch’s hall.\n\n---\n\n**Hymn of the Green Thearch’s Divine Candle**\nPlace the candle in the East. At the hour of human quietude, enter the chamber facing east. Knock the teeth nine times, close the eyes, and inwardly envision the green qi of the East, its radiance filling the room. Bow before the lamp, kneel, and recite the hymn:\n\n*Vast and obscure, the primal perfection,\nSwift and clear, the qi soars high.\nThe original thread knows no bounds,\nFeathered script shines bright and rises.\nSeeking through ten thousand kalpas,\nThe great radiance descends as the divine lamp.\nWashing away the seven mysteries’ trials,\nSuffering souls all transcend and ascend.\nThe void generates natural light,\nThe body, light, rides clouds to rise.*\n\n**Hymn of the Red Thearch’s Divine Candle**\nPlace the candle in the South. Knock the teeth nine times, close the eyes, and inwardly envision the red qi of the South, its radiance filling the room. Bow before the lamp, kneel, and recite the hymn:\n\n*The Great Void births the empty cavern,\nFormless, it returns without sound.\nSilent within the Primal Beginning,\nThe Three Purities give rise to cloudy scenes.\nHow desolate the secluded chamber—\nThe bright lamp connects thought.\nClearly beholding the natural light,\nThe Three Dawns share a single body.*\n\n**Hymn of the White Thearch’s Divine Candle**\nPlace the candle in the West. Knock the teeth nine times, close the eyes, and inwardly envision the white qi of the West, its radiance filling the room. Bow before the lamp, kneel, and recite the hymn:\n\n*The Three Numinous ones spit wondrous blossoms,\nThreading through the ninefold heavens.\nThe night’s light knows no blemish,\nIts precious radiance transcends intersecting paths.\nPiercing the boundless wilds,\nDawn breaks into the great seclusion.\nUprooting the nine mysteries’ suffering,\nFortune flourishes as misfortune vanishes.*\n\n**Hymn of the Black Thearch’s Divine Candle**\nPlace the candle in the North. Knock the teeth nine times, close the eyes, and inwardly envision the black qi of the North, its radiance filling the room. Bow before the lamp, kneel, and recite the hymn:\n\n*How bright, the radiance of the Great Yang!\nThe divine light pierces the Three Clarities.\nQi scatters within the dark desert,\nEthereal mist arises in the purple court.\nControlling and riding the flying clouds,\nDrifting, drifting, beyond all form.\nUprooting my seven mysteries’ ancestors,\nIn the Southern Palace, they are reborn anew.\nEver equal to the Three Lights,\nTo the ends of Heaven, without peril or collapse.*",
      "overlap_context": "e incantation:\nHeaven is my roof,\nEarth is my bed,\nThe Five Marchmounts and rivers are my bridges,\nThe Mysterious Dipper’s Primal Essence is my raiment.\nConcealed within the Seven Primes,\nIn the land of flowing fire,\nHe who measures me is Taiyi Wuyou,\nHe who passes me is Baiyuan Wuying.\nDisaster cannot assail,\nWeapons cannot harm.\nMay my body ascend to the Golden Gates,\nThe Capital of the Nine Elders.\nThus concluded.\n\nIn such dire straits, even at the brink of death, you shall attain liberation.",
      "start_char": 5370,
      "end_char": 6656,
      "start_sentence": 163,
      "end_sentence": 192,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.96085500717163,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上紫度炎光神元变经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "黄帝神烛颂：安灯烛於中央，叩齿九通，冥目内视，存中央黄炁覆满一室，心拜灯前，跪颂曰：五帝捴玄一，中元御十方，摄正辅大冥，幽烛朗空同，炁散无崖际，同度及神宗，礼颂太真章，诜诜步虚空，希感彻玉帝，长谒三元房。 此帝君受九天真王神烛内颂，修行积感，致夜光自朗，五帝通光灵符，降于帝室也。 子有玉名，得悟秘文，当赍上金五两，以礼五方，五色之缯各五十尺，以盟五帝，告誓三元，然后奉焉。 五帝通光灵符 东方太明太虚太洞玄元始阳之精，九千万重玄生玉真炁，典统玉台九千生官，制御九千之炁，通理三天仙王。 得者神仙，佩者成真人，行之者光明通灵，白日升天。 右东方青帝自生神烛通光灵符，以青绢九寸朱书佩之，又书九寸符，安所住东方，安着神烛灯下，九年神烛自明，神符自生也。 帝遣青光童子十二人，侍卫己身。 南方太阳太精太洞炎始之精，八千万重玄上生玉真炁，典统玉台八千生官，制御九天之炁，辅正三天之法。 得者神仙，佩者成真人，行之者光明通灵，白日升天。 右南方赤帝自生神烛通光灵符，以绛缯九寸朱书佩之，又书九寸符，安所住南方，着神烛灯下，九年修行神烛自明，帝遣赤光童子十二人，侍卫己身。 西方太宝太华太洞玄辉之精，六千万重虚生自然玉真炁，典统玉台六千生官，制御九天之炁，摄正三天之真。 有得之者神仙，佩之者成真人，行之者光明通灵，白日升天。 右西方白帝自然神烛通光灵符，以白缯九寸朱书佩之，又书九寸符，安於所住西方神灯烛下，九年修行，神灯自明，帝遣白光童子十二人，侍卫己身。 北方太冥太玄太阴北始之精，五千万重虚生玉真炁，典统玉台五千生官，制御九天之炁，摄正三天之真。 有得之者神仙，佩之者成真人，行之者光明通灵，白日升天。 右北方黑帝自生神烛通光灵符，以黑缯九寸朱书佩之，又书九寸符，安於所住北方神灯烛下，九年修行，神灯自明，帝遣黑光童子十二人，侍卫己身。 中央太明太黄太洞太真三元始生之精，千二万重虚生玉真炁，典统玉台千二百生官，制御九天之炁，摄正三天之真。 有得之者神仙，佩之者成真人，行之者光明通灵，白日升天。 右中央黄帝自生神烛通光灵符，以黄缯九寸朱书佩之，又书九寸符，安於所住中央神灯烛下，九年修行，神灯自明，帝遣黄光童子十二人，侍卫已身。 五帝自生夜烛神灯通光灵符，生於虚空之内，神光玄照，焕落太无，天帝君礼而奉焉。 付金阙圣君、上相青童君，使受后学当为真人者。 若有玄名上参玉格，得见此法。 每以人定入室，烧香礼拜神灯，读诵都毕，还东向，叩齿二十四通，祝曰： 玄真高遐，清晖夜翳，神烛通明，玉符同慧，真灵内照，玄光映界，五色童子，耀辉彻视，得乘飞舆，上升帝位。 毕，叩齿二十通，咽五方炁各五过止。 如此五年，克得自明之烛，五色童子络身，明彻远览，逆究无穷。 明烛每令常明，不令中灭也。 若未能隐处远托山林，故在人中，安灯别室，不得使异炁之人履殗冒秽，干忤神真，则灵光不现。 若依此如法明灯，光照一城，则万魔灭形，千鬼丧目，所在真官营卫一门也。 其法实秘，不得妄宣，朝得冥传，使宝经轻泄，身没鬼官，七玄之祖，长充地狱，万劫幽泉，已无仙冀，明慎之焉。",
      "translated_text": "**Hymn of the Yellow Thearch’s Divine Candle**\nPlace the candle in the Center. Knock the teeth nine times, close the eyes, and inwardly envision the yellow qi of the Center, its radiance filling the room. Bow before the lamp with the heart, kneel, and recite the hymn:\n\n*The Five Thearchs unite in the Mysterious One,\nThe Central Origin governs the ten directions.\nSeizing rectitude to aid the Great Darkness,\nThe hidden candle shines as brightly as the empty void.\nQi scatters without bound,\nTogether they cross into the divine lineage.\nOffering hymns to the Perfected’s chapter,\nIn solemn steps, I tread the void,\nLonging stirs the Jade Thearch,\nEver to visit the Three Origins’ chambers.*\n\nThis hymn is received by the Thearch-Lord from the Divine Candle’s inner recitation of the Nine Heavens’ True Kings. Through cultivated resonance, the night’s radiance brightens of itself, and the Five Thearchs’ luminous spirit talismans descend into the Thearch’s chamber.\n\nShould your jade name be recorded above, and you awaken to the secret texts, you must present five taels of gold as an offering to the Five Directions, and fifty feet of five-colored silk to pledge alliance with the Five Thearchs. Swear your oath before the Three Origins, then receive the teachings.\n\n**The Five Thearchs’ Luminous Spirit Talismans**\n\n**Eastern Direction:**\n*The Great Clarity, the Great Void, the Great Cavern’s Primordial Yang Essence—*\nNine thousand myriad layers of mystery give birth to the Jade Perfected Qi,\nOverseeing the Jade Terrace’s nine thousand life-officials,\nCommanding the qi of the nine heavens,\nGoverning the immortal kings of the Three Heavens.\nThose who obtain it become immortals;\nthose who wear it attain Perfected-hood.\nPracticing it, one’s radiance becomes luminous and spiritually penetrating,\nascending to heaven in broad daylight.\n\n**Right:** The Azure Thearch’s self-generated Divine Candle Luminous Spirit Talisman.\nInscribe it in cinnabar on nine inches of green silk and wear it.\nAlso inscribe a nine-inch talisman and place it in the eastern direction of your dwelling,\nbeneath the divine candle’s lamp.\nAfter nine years of practice, the divine candle will brighten of itself,\nand the spirit talisman will manifest.\nThe Thearch dispatches twelve Azure Radiance Lads to attend and guard your person.\n\n**Southern Direction:**\n*The Great Yang, the Great Essence, the Great Cavern’s Fiery Origin Essence—*\nEight thousand myriad layers of mystery ascend to generate the Jade Perfected Qi,\nOverseeing the Jade Terrace’s eight thousand life-officials,\nCommanding the qi of the nine heavens,\nAssisting the rectitude of the Three Heavens’ laws.\nThose who obtain it become immortals;\nthose who wear it attain Perfected-hood.\nPracticing it, one’s radiance becomes luminous and spiritually penetrating,\nascending to heaven in broad daylight.\n\n**Right:** The Vermilion Thearch’s self-generated Divine Candle Luminous Spirit Talisman.\nInscribe it in cinnabar on nine inches of crimson silk and wear it.\nAlso inscribe a nine-inch talisman and place it in the southern direction of your dwelling,\nbeneath the divine candle’s lamp.\nAfter nine years of practice, the divine candle will brighten of itself,\nand the Thearch dispatches twelve Vermilion Radiance Lads to attend and guard your person.\n\n**Western Direction:**\n*The Great Treasure, the Great Splendor, the Great Cavern’s Mysterious Radiance Essence—*\nSix thousand myriad layers of void give birth to the spontaneous Jade Perfected Qi,\nOverseeing the Jade Terrace’s six thousand life-officials,\nCommanding the qi of the nine heavens,\nSeizing the rectitude of the Three Heavens’ Perfected.\nThose who obtain it become immortals;\nthose who wear it attain Perfected-hood.\nPracticing it, one’s radiance becomes luminous and spiritually penetrating,\nascending to heaven in broad daylight.\n\n**Right:** The White Thearch’s self-generated Divine Candle Luminous Spirit Talisman.\nInscribe it in cinnabar on nine inches of white silk and wear it.\nAlso inscribe a nine-inch talisman and place it in the western direction of your dwelling,\nbeneath the divine candle’s lamp.\nAfter nine years of practice, the divine lamp will brighten of itself,\nand the Thearch dispatches twelve White Radiance Lads to attend and guard your person.\n\n**Northern Direction:**\n*The Great Darkness, the Great Mystery, the Great Yin’s Northern Origin Essence—*\nFive thousand myriad layers of void give birth to the Jade Perfected Qi,\nOverseeing the Jade Terrace’s five thousand life-officials,\nCommanding the qi of the nine heavens,\nSeizing the rectitude of the Three Heavens’ Perfected.\nThose who obtain it become immortals;\nthose who wear it attain Perfected-hood.\nPracticing it, one’s radiance becomes luminous and spiritually penetrating,\nascending to heaven in broad daylight.\n\n**Right:** The Black Thearch’s self-generated Divine Candle Luminous Spirit Talisman.\nInscribe it in cinnabar on nine inches of black silk and wear it.\nAlso inscribe a nine-inch talisman and place it in the northern direction of your dwelling,\nbeneath the divine candle’s lamp.\nAfter nine years of practice, the divine lamp will brighten of itself,\nand the Thearch dispatches twelve Black Radiance Lads to attend and guard your person.\n\n**Central Direction:**\n*The Great Clarity, the Great Yellow, the Great Cavern’s Supreme Perfected Three Origins’ Origin Essence—*\nTwelve thousand myriad layers of void give birth to the Jade Perfected Qi,\nOverseeing the Jade Terrace’s twelve hundred life-officials,\nCommanding the qi of the nine heavens,\nSeizing the rectitude of the Three Heavens’ Perfected.\nThose who obtain it become immortals;\nthose who wear it attain Perfected-hood.\nPracticing it, one’s radiance becomes luminous and spiritually penetrating,\nascending to heaven in broad daylight.\n\n**Right:** The Yellow Thearch’s self-generated Divine Candle Luminous Spirit Talisman.\nInscribe it in cinnabar on nine inches of yellow silk and wear it.\nAlso inscribe a nine-inch talisman and place it in the central direction of your dwelling,\nbeneath the divine candle’s lamp.\nAfter nine years of practice, the divine lamp will brighten of itself,\nand the Thearch dispatches twelve Yellow Radiance Lads to attend and guard your person.\n\nThe Five Thearchs’ self-generated Night Candle Divine Lamp Luminous Spirit Talismans\nare born within the void,\ntheir divine radiance mysteriously illuminating,\nshining brilliantly into the Great Non-Being.\nThe Heavenly Thearch-Lord reveres and upholds them,\nentrusting them to the Golden Watchtower’s Sage-Lord and the High Minister Azure Lad,\nto be received by later students destined to become Perfected.\n\nIf your mysterious name is recorded above in the Jade Register,\nyou may behold this method.\nEach night at the hour of human stillness, enter your chamber,\nburn incense, bow before the divine lamp, and recite the texts in full.\nThen face east, knock the teeth twenty-four times, and pray:\n\n*O Mysterious Perfected, exalted and distant,\nPure radiance dispels the night’s obscurity.\nThe divine candle shines brightly,\nThe jade talisman shares in wisdom.\nPerfected spirits inwardly illuminate,\nMysterious light reflects the realms.\nFive-colored lads,\nTheir brilliance pierces all sight.\nAttaining the flying chariot,\nI ascend to the Thearch’s throne.*\n\nConclude by knocking the teeth twenty times and swallowing the qi of the Five Directions, five times each.\n\nAfter five years of such practice, you will attain the self-brightening candle,\nand the Five-Colored Lads will encircle your body,\ntheir clarity penetrating distant visions,\nretracing the boundless.\nKeep the bright candle ever lit,\nnever allowing it to extinguish.\n\nIf you cannot retreat to secluded mountains and forests,\nbut remain among people,\nplace the lamp in a separate chamber,\nensuring no one of impure qi treads upon or defiles it,\noffending the divine Perfected,\nlest the spirit radiance fail to appear.\n\nIf you follow this method and brighten the lamp,\nits light will illuminate an entire city,\nvanquishing ten thousand demons and blinding a thousand ghosts.\nWherever you dwell, the Perfected Officials will encamp and guard your gate.\n\nThis method is truly secret;\ndo not recklessly divulge it.\nShould you receive it in the dark and recklessly leak the treasured scripture,\nyour body will be consigned to the ghostly officials,\nyour seven mysteries’ ancestors will forever fill the earthly prisons,\nand in the ten thousand kalpas of the dark springs,\nyou will have no hope of immortality.\nBe ever vigilant.",
      "overlap_context": ", its radiance filling the room. Bow before the lamp, kneel, and recite the hymn:\n\n*How bright, the radiance of the Great Yang!\nThe divine light pierces the Three Clarities.\nQi scatters within the dark desert,\nEthereal mist arises in the purple court.\nControlling and riding the flying clouds,\nDrifting, drifting, beyond all form.\nUprooting my seven mysteries’ ancestors,\nIn the Southern Palace, they are reborn anew.\nEver equal to the Three Lights,\nTo the ends of Heaven, without peril or collapse.*",
      "start_char": 6657,
      "end_char": 7940,
      "start_sentence": 193,
      "end_sentence": 223,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.82535147666931,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上紫度炎光神元变经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "镇魂固魄飞腾七十四方灵丸 云母四两、　　雄黄四两、　　　硝石、 玄参、　　　槐仁、　　　龙骨五两、 猪苓、　　　青丘霜、　　虎枚花阴干、 鸡舌香二两、　青木香二两、　沉香二两 熏陆香、　　詹糖二两、　　戎盐三两、 空青八两、　　　丹砂八两、　　　石黛、 白石英二两、　太阳婴童羽衣二两、 太阳精上素华二两、　　　　　　桃花四两、 真瑰余各四两、 北结阴精流花、一升二合。 当以九月建日取之，盛别器中。 结炁凝精素丹、一升二合。 当以十二月建日取之，盛之别器中。 神化阴精流珠。 一升二合。 当以冬至日取之，盛别器中。 合二十七种，上二十四种法二十四神，三种应以三元之精炁，二应九晨，结魄凝魂，五色流黄化形变景无有常方，故人服之，神镇气安。 当以三月建日合药，五月壬日服丸。 始合，以次从云母，各别捣三千杵，至桃花，合二十四种，合七万二千杵。 毕，各置一柈中。 未得捣药，仍告斋三十日，讫事，令童男捣药，童女侍香，皆令少口慎言，好性善言，肉香骨芳之人。 置药二十四柈中，露着中庭三宿，勿令鸡犬、外人见，不使闻哭声。 露毕，以次纳药着釜中，第一纳云母，次雄黄，后纳桃花，内二十四种都毕。 皆当好以次第相覆，令竟釜中。 次北结阴精流华一升二合，次纳结炁凝精素华丹一升二合，次神化阴精流珠一升二合。 毕，以清稷柳一斗二升，沃药上，即以土釜盖之，令上下内外四面四边，令内外密厚七分。 故以云母在下，其炁充上，桃花在上，其色冠下，故有次第也。 当先作六一泥土釜二枚。 用东海左顾牡砺、戎盐、赤石脂、黄丹、滑石、蚓蝼土，六分皆等，合治捣细筛，和以百日米醋，和毕，捣令相和，合成六一之泥也。 以泥两土釜内外，渐渐薄泥，日暴令爆燥，稍上内外令厚二寸半。 都毕，仍作灶，南向安孤，着灶中央，釜底令去地一尺二寸，糠火烧之三日三夕，令火去釜九寸，九日九夕进火，令近六寸，又九日九夕，令火至底，令三九二十七日。 毕，寒之三日，发开视，药起飞精，仰着上釜，神药成也。 不起，更泥如初，又进火如先二十七一日，寒之三日，无不成也。 取三岁雄鸡羽扫取之，仰着上釜，则为飞丹紫流精，有百变之色，玄光映焕七十四方。 服之一铢，身自生流光七十四色，左唾则三魂立见，右唾则七魄化生七形之童，飞罗羽裙，神舆玉辇立到於前。 盛之釜柈，精凝釜底，则为玉胎琼液之膏，和以白蜜，更合於臼中，东向捣之令一万杵，一铢为一丸，丸毕，密器封之，露着中庭三日三夕。 毕，清朝服一丸，合三日服三丸，即能乘空步虚，出有入无。 令七日合服七丸，即自浮景霄霞。 腾身五岳，五色神官五万人，卫从身形。 东向服九丸，则致青霞绿軿，青龙控辔，青阳玉童九十人，青腰玉女九十人，东岳仙官九千，来迎兆身。 南向服八丸，则致绛霞云軿，赤龙控辔，绛宫玉童八十人，太丹赤圭玉女八十人，南岳仙官八千人，来迎兆身。 西向服六丸，则致素霞玉舆，六龙控辔，耀灵玉童六十人，太素玉女六十人，西岳仙官六千人，来迎兆身。 北向服五丸，则致皂霞飞辇，玄龙控辔，太极玉童五十人，太玄玉女五十人，北岳仙官五千人，来迎兆身。",
      "translated_text": "The **Spirit-Stabilizing, Soul-Firming, Soaring Elixir of the Seventy-Four Directions**\n\n**Ingredients:**\n- Four liang of mica,\n- Four liang of realgar,\n- Niter, figwort root, sophora fruit, five liang of dragon bone,\n- Polyporus, frost from Green Mound, dried tiger’s-eye flower,\n- Two liang each of clove, spikenard, aloeswood,\n- Frankincense, two liang of rock candy, three liang of halite,\n- Eight liang each of malachite and cinnabar,\n- Azurite, two liang of white quartz,\n- Two liang of *Taiyang Infant’s Feather Garment*,\n- Two liang of *Taiyang Essence’s Supreme Floral Radiance*,\n- Four liang of peach blossom,\n- Four liang each of true rose remnants,\n- One sheng and two ge of *Northern Congealed Yin Essence Flowing Blossom*.\n\nCollect these on the *jian* day of the ninth month and store in a separate vessel.\n\n- One sheng and two ge of *Qi-Congealed, Essence-Condensed Plain Elixir*. Collect on the *jian* day of the twelfth month and store in a separate vessel.\n- One sheng and two ge of *Spirit-Transformed Yin Essence Flowing Pearl*. Collect on the winter solstice and store in a separate vessel.\n\nCombine the twenty-seven ingredients: the first twenty-four correspond to the twenty-four spirits, while the remaining three align with the *qi* of the Three Origins. Two respond to the Nine Mornings, consolidating the po and solidifying the hun, transmuting the Five Colors’ flowing yellow to shape-shift and transform without fixed form. When ingested, the spirit is stabilized and *qi* pacified.\n\nPrepare the elixir on the *jian* day of the third month and ingest the pills on the *ren* day of the fifth month. Begin by grinding each ingredient in sequence, starting with mica, each pounded three thousand times, up to peach blossom—twenty-four ingredients in total, seventy-two thousand pestle strokes. Once complete, place each in a separate tray.\n\nBefore grinding, observe a thirty-day fast. Afterward, have a young boy pound the medicine while a young girl tends the incense. Both must be of few words, cautious in speech, kind-hearted, and naturally fragrant in flesh and bone.\n\nExpose the twenty-four trays of medicine in the central courtyard for three nights. Ensure no chickens, dogs, or outsiders see them, and prevent exposure to sounds of weeping. After exposure, layer the ingredients into a cauldron in order: first mica, then realgar, lastly peach blossom, followed by the remaining twenty-four. Arrange them carefully, filling the cauldron.\n\nNext, add one sheng and two ge of *Northern Congealed Yin Essence Flowing Blossom*, then one sheng and two ge of *Qi-Congealed, Essence-Condensed Plain Elixir*, and finally one sheng and two ge of *Spirit-Transformed Yin Essence Flowing Pearl*. Once all are added, pour twelve sheng of pure millet water over the medicine, then seal the cauldron with a clay lid, ensuring all inner and outer surfaces are tightly sealed to a thickness of seven fen. Place mica at the bottom, its *qi* ascending, and peach blossom atop, its color crowning the rest—thus the order is set.\n\nFirst, craft two clay cauldrons using *Six-One Mud*: combine equal parts left-facing oyster shell from the East Sea, halite, red halloysite, lead oxide, talc, and earthworm soil. Grind finely, sift, and mix with hundred-day rice vinegar. Knead thoroughly to form the *Six-One Mud*. Coat the inner and outer surfaces of both cauldrons with thin layers, sun-drying until fully desiccated. Gradually build up the thickness to two and a half cun.\n\nOnce complete, construct a furnace facing south, placing the cauldron atop a solitary support at its center, elevating the base one chi and two cun above the ground. Ignite with chaff fire for three days and nights, keeping the flames nine cun from the cauldron. For nine days and nights, advance the fire to six cun away, then for another nine days and nights, bring the flames to the base—totaling twenty-seven days. Cool for three days, then open to inspect: if the medicine has ascended and adhered to the upper cauldron, the divine elixir is formed. If not, reseal with mud as before and repeat the firing for another twenty-seven days. Cool for three days; it will surely succeed.\n\nUse a three-year-old rooster’s feather to sweep the elixir from the upper cauldron: this yields *Flying Cinnabar Purple Flowing Essence*, shimmering with a hundred shifting hues, its mysterious radiance illuminating the seventy-four directions. Ingesting a single *zhu* will cause your body to emanate seventy-four colors of flowing light. Spitting to the left summons the Three Hun, while spitting to the right transforms the Seven Po into seven child-spirits with flying nets and feathered skirts, their divine chariots and jade carriages instantly appearing before you.\n\nStore the elixir in a cauldron tray; the essence congealed at the bottom becomes *Jade Embryo Nectar Ointment*. Blend with white honey, then grind in a mortar facing east for ten thousand strokes. Form into pills weighing one *zhu* each. Seal in an airtight vessel and expose in the central courtyard for three days and nights. Upon completion, ingest one pill at dawn. Take three pills over three days, enabling you to traverse the void, entering and exiting non-being. After seven days of taking seven pills, you will ascend amidst rosy clouds. Soaring over the Five Peaks, fifty thousand spirit-officials of the Five Colors will escort your form.\n\nFacing east, ingest nine pills to summon emerald mists and green chariots, with azure dragons reining the steeds. Ninety *Jade Lads of the Azure Yang* and ninety *Jade Maidens of the Azure Waist*, along with nine thousand immortals of the Eastern Peak, will come to receive you.\n\nFacing south, ingest eight pills to summon crimson mists and cloud chariots, with vermilion dragons reining the steeds. Eighty *Jade Lads of the Crimson Palace* and eighty *Jade Maidens of the Great Cinnabar*, along with eight thousand immortals of the Southern Peak, will come to receive you.\n\nFacing west, ingest six pills to summon pristine mists and jade carriages, with six dragons reining the steeds. Sixty *Radiant Spirit Jade Lads* and sixty *Jade Maidens of the Supreme Simplicity*, along with six thousand immortals of the Western Peak, will come to receive you.\n\nFacing north, ingest five pills to summon black mists and flying chariots, with dark dragons reining the steeds. Fifty *Jade Lads of the Supreme Ultimate* and fifty *Jade Maidens of the Supreme Mystery*, along with five thousand immortals of the Northern Peak, will come to receive you.",
      "overlap_context": "ten thousand demons and blinding a thousand ghosts.\nWherever you dwell, the Perfected Officials will encamp and guard your gate.\n\nThis method is truly secret;\ndo not recklessly divulge it.\nShould you receive it in the dark and recklessly leak the treasured scripture,\nyour body will be consigned to the ghostly officials,\nyour seven mysteries’ ancestors will forever fill the earthly prisons,\nand in the ten thousand kalpas of the dark springs,\nyou will have no hope of immortality.\nBe ever vigilant.",
      "start_char": 7941,
      "end_char": 9200,
      "start_sentence": 224,
      "end_sentence": 267,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.52416706085205,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上紫度炎光神元变经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "又向戊己之上服三丸，则致黄霞玉舆，十二飞龙控辔，中央黄机玉童十二人，黄素玉女十二人，中岳仙官千二百人，来迎兆身。 服五事毕，即致五岳仙官，奉玉札凤章，请兆之身上诣九宫金阙之下，受署真仙之号，可谓灵丸之妙大哉。 凡诸变化，作七十四种金银宝玉、赤树绛实； 立生水火，有妙於琅玕八景四蕊降生神丹之用，不能一一具处，特略大化之微。 凡欲游戏五岳，周流八极，不拘仙官之劳，不惮典局之烦，未欲升天者，自可不须服五方之丸，但常服七丸、三丸之数，固魂镇魄，飞腾七十四方，遨游五岳，寿同三光。 余可依五方之数尔，若服五方之丸，便为五岳之司，便有局任，不得适意世间也。 流光曜电变景保生上经 太极真人时登北漠外羽明野玄陇山紫微宫，见紫微夫人闲居寂室，固神澄晖，仰餐玄流，采服二象，吐纳飞霞，回五光以自映，运二曜以荫躯，五色蓊蔼流，焕琼台。 仰看紫微之中壁，西北角有刻书玉简，名流光五色童子之章。 真人清斋三月，诣紫微奉受其篇，紫微说是流光曜电变景上经。 受还修行三年，得成真人。 紫微常所宝秘，不得妄传，自无金阙玉音，紫字青华，不得闻见。 若行之者，清斋沐浴，烧香寂室，静思念真百日，得给玉童玉女各五人。 修行勿懈，五色童子憩子之房，流光运子之身，上登玉清。 常当清朝日出晖之时，入室东向，存思东方青光童子，名青上玉，字飞正，身作碧霞之色，流光烂照东方一面，如电曜之状，乘碧霞之舆，玄光流映冠覆一身，觉身变入青光之中，内外晻冥，良久乃豁除，叩齿十二通，咽炁九过止。 祝曰：东方童子，青上玉君，赐我青芝，流光之泉，玄霞碧辇，来迎我身，上造玉庭，得为真人。 次存南方童子，名丹晖，字玄纪，身作赤霞之色，流光竟於南方，如电晖曜之状，乘绛霞之舆，玄光流映冠覆一身，觉我身入赤光之中，内外晻冥，良久豁除，仍叩齿十二通，咽炁九过止。 祝曰：南方童子，丹晖真君，赐我降生之浆，流光玉芝之芳，丹霞电曜，覆荫我房，与我同升，俱造帝庭。 次存西方白光童子，名皓华，字回神子，身作素霞之色，流光烂照西方一面，如电曜之状，乘素霞之辇，玄光流映冠覆我身，觉我变入白光之中，内外晻明，无所闻见，良久豁除，叩齿十二通，咽炁九过止。 祝曰：西方童子，皓华上君，赐我素水玉芝，流珠金液之泉，素霞飞盖，来降我身，与我同升，俱造太真。 次存北方黑帝童子，名玄明上，字太阴文，身作皂霞之色，流光洞照焕於北方，如电曜之状，乘素霞之辇，玄光流映冠覆我身，变入黑光之中，内外晻明，无所闻见，良久豁除，叩齿十二通，咽炁九过止。 祝曰：北方童子，玄明上君，赐我黑芝玄水，玉英皂霞飞軿，五色神龙，流光晻蔼，来降我身，随云上升，得造华宫。 次存中央黄光童子，名执中，字黄录子，身作黄霞之色，如黄金之精，流光烂照中央，五色流曜，如电之扬，乘黄霞之辇，来憩我房，缠绕我身，觉身变入黄光之中，内外晻明，无所闻见，良久豁除，叩齿十二通，咽炁九过止。 祝曰：中央童子，执忠神真，赐我黄水月华，回精飞晨，五色焕落，流光内鲜，覆我黄华之烟，腾空登虚，上升帝前。",
      "translated_text": "Facing the direction of *wu-ji* (戊己), ingest three pills to summon a jade carriage of yellow mists, with twelve flying dragons reining the steeds. Twelve *Yellow Mechanism Jade Lads* and twelve *Yellow Simplicity Jade Maidens*, along with one thousand two hundred immortals of the Central Peak, will come to receive you.\n\nUpon completing the ingestion of the five regimens, the immortals of the Five Peaks will present a jade tablet with phoenix-script, inviting your person to ascend beneath the Nine Palaces and Golden Towers, there to receive the title of Perfected Immortal. Truly, the marvel of these numinous pills is great indeed.\n\nAll transformations manifest seventy-four kinds of gold, silver, and precious jade, along with crimson trees bearing vermilion fruits. They give rise to living water and fire, possessing wonders beyond the use of *langgan* jade, the Eight Effulgences, and the Four-Petaled Descending Numinous Elixir. These cannot be enumerated in full; only the subtleties of the great transformations are briefly outlined here.\n\nShould you wish to roam the Five Peaks and traverse the Eight Extremities, unburdened by the toil of immortal officials or the tedium of bureaucratic duties, and if you do not yet desire to ascend to heaven, you may forgo the pills of the Five Directions. Simply ingest the regular count of seven or three pills to secure your hun-soul and anchor your po-soul, soaring through the seventy-four directions, wandering the Five Peaks, and attaining a lifespan equal to the Three Luminaries.\n\nThe rest may follow the numbers of the Five Directions. If you ingest the pills of the Five Directions, you will become an overseer of the Five Peaks, assuming office and duties, and thus will be unable to move freely in the mortal world.\n\n---\n\n*Scripture on Preserving Life Through Radiant Light and Transforming Scenery*\n*Taiyi Perfected One* once ascended to the *Feather Bright Wilds* beyond the Northern Desert, to the *Mystic Ridge Mountain* and the *Purple Tenuity Palace*. There, he beheld *Purple Tenuity Lady* dwelling in seclusion, her spirit serene and luminous. She gazed upward to consume the Mystic Stream, gathered and ingested the Two Images, exhaled and inhaled flying mists, reflected herself in the Five Lights, and sheltered her body with the Two Luminaries. Five-colored vapors billowed and flowed, adorning the jeweled terrace with splendor.\n\nLooking up at the western wall of the Purple Tenuity Palace, in its northwest corner, he saw an inscribed jade slip named *The Chapter of the Five-Colored Radiant Lads*. The Perfected One purified himself for three months, then journeyed to the Purple Tenuity Palace to receive the scripture. The Purple Tenuity Lady declared it the *Scripture on Radiant Light and Transforming Scenery*. After receiving it and cultivating its practices for three years, he attained the rank of Perfected One.\n\nThis scripture is a treasure of the Purple Tenuity Lady, not to be recklessly transmitted. Without the Jade Clarion’s celestial sound or the Purple Script’s azure radiance, one may not hear or behold it. Those who practice it must purify themselves with fasting and bathing, burn incense in a secluded chamber, and meditate in stillness upon the Perfected for a hundred days. Then, five Jade Lads and five Jade Maidens will be granted to them.\n\nIf one cultivates without negligence, the Five-Colored Lads will rest in one’s chamber, and Radiant Light will circulate through one’s body, enabling ascent to the Jade Clarity. Always at the time when the clear sun rises in splendor, enter the chamber, face east, and visualize the Eastern Azure Radiance Lad, named *Azure Supreme Jade*, styled *Flying Upright*. His body is the color of azure mists, his flowing light blazing and illuminating the eastern quarter like the brilliance of lightning. He rides a carriage of azure mists, his entire being suffused with the streaming glow of Mystic Light. Feel your body transform and enter the azure light, where inner and outer merge into obscurity. After a long while, clarity returns. Knock the teeth twelve times and swallow qi nine times, then cease.\n\nRecite the invocation:\n*\"Eastern Lad, Azure Supreme Jade Lord, bestow upon me the Azure Mushroom and the Fountain of Radiant Light. With the Azure Mist Carriage, come receive my person, that I may ascend to the Jade Court and become a Perfected One.\"*\n\nNext, visualize the Southern Lad, named *Cinnabar Radiance*, styled *Mystic Record*. His body is the color of crimson mists, his flowing light blazing in the southern quarter like the brilliance of lightning. He rides a carriage of vermilion mists, his entire being suffused with the streaming glow of Mystic Light. Feel your body enter the crimson light, where inner and outer merge into obscurity. After a long while, clarity returns. Knock the teeth twelve times and swallow qi nine times, then cease.\n\nRecite the invocation:\n*\"Southern Lad, Cinnabar Radiance Perfected Lord, bestow upon me the Nectar of Descending Life and the Fragrance of Radiant Jade Mushrooms. With the Vermilion Mist and Lightning Brilliance, overshadow my chamber. Ascend with me, that together we may reach the Imperial Court.\"*\n\nNext, visualize the Western Lad of White Light, named *Luminous Splendor*, styled *Returning Spirit Lad*. His body is the color of pristine mists, his flowing light blazing and illuminating the western quarter like the brilliance of lightning. He rides a carriage of white mists, his entire being suffused with the streaming glow of Mystic Light. Feel your body transform and enter the white light, where inner and outer merge into obscurity, and nothing is heard or seen. After a long while, clarity returns. Knock the teeth twelve times and swallow qi nine times, then cease.\n\nRecite the invocation:\n*\"Western Lad, Luminous Splendor Supreme Lord, bestow upon me the Pristine Water and Jade Mushrooms, the Fountain of Flowing Pearls and Golden Liquor. With the White Mist Flying Canopy, descend to my person. Ascend with me, that together we may reach the Supreme Perfected.\"*\n\nNext, visualize the Northern Lad of the Black Emperor, named *Mystic Brilliance Supreme*, styled *Great Yin Script*. His body is the color of dark mists, his flowing light blazing and illuminating the northern quarter like the brilliance of lightning. He rides a carriage of white mists, his entire being suffused with the streaming glow of Mystic Light. Feel your body transform and enter the black light, where inner and outer merge into obscurity, and nothing is heard or seen. After a long while, clarity returns. Knock the teeth twelve times and swallow qi nine times, then cease.\n\nRecite the invocation:\n*\"Northern Lad, Mystic Brilliance Supreme Lord, bestow upon me the Black Mushroom and Mystic Water, the Jade Essence and Dark Mist Flying Carriage. With the Five-Colored Numinous Dragons and the Obscuring Radiant Light, descend to my person. Ascend with the clouds, that I may reach the Flourishing Palace.\"*\n\nNext, visualize the Central Lad of Yellow Light, named *Upholding Center*, styled *Yellow Record Lad*. His body is the color of yellow mists, like the essence of yellow gold, his flowing light blazing and illuminating the center, with five colors streaming and flashing like the brilliance of lightning. He rides a carriage of yellow mists, coming to rest in your chamber and coiling around your body. Feel your body transform and enter the yellow light, where inner and outer merge into obscurity, and nothing is heard or seen. After a long while, clarity returns. Knock the teeth twelve times and swallow qi nine times, then cease.\n\nRecite the invocation:\n*\"Central Lad, Upholding Loyalty Numinous Perfected, bestow upon me the Yellow Water and Moon Essence, the Returning Essence and Flying Dawn. With the Five Colors blazing and falling, and the Radiant Light gleaming within, overshadow me with the smoke of Yellow Splendor. Soaring through the void, ascend before the Emperor.\"*",
      "overlap_context": "arriages, with six dragons reining the steeds. Sixty *Radiant Spirit Jade Lads* and sixty *Jade Maidens of the Supreme Simplicity*, along with six thousand immortals of the Western Peak, will come to receive you.\n\nFacing north, ingest five pills to summon black mists and flying chariots, with dark dragons reining the steeds. Fifty *Jade Lads of the Supreme Ultimate* and fifty *Jade Maidens of the Supreme Mystery*, along with five thousand immortals of the Northern Peak, will come to receive you.",
      "start_char": 9200,
      "end_char": 10437,
      "start_sentence": 268,
      "end_sentence": 291,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.74442648887634,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上紫度炎光神元变经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "都毕，思五色混黄，更相覆烈，云炁郁勃，正匝一室，缠绕我身，觉体熏熏，有热内外，洞彻良久，化见青龙在左肩上，白虎在右肩上，朱雀在头上，腾蛇在足下，冠我身形，咒曰：五色蓊郁，白黑赤青，中央玄降，混合郁冥，化为天兽，来卫我形，赐我五芝，五藏丰盈，绛府结络，神华自生，寿齐日月，长保黄宁，千变万化，当升太灵。 咽液还容保牙求仙上法 常以平旦二炁未分之始，玄晖已映，形神并降，上会泥丸，精液咸生。 是故其时咽而服之，将来三年，面生玉泽，光变童颜，云华固根，朽齿方生。 必能长修，五老降房，神仙升玄，寿齐三光，不死之道，非真勿传。 至其时，安心定意，令五神静宁，叩齿十二通，以思青腰玉女，赍东方少阳之炁，青芝玉浆灌溉我身，流溢紫微宫中，祝曰：东方青牙，饮以朝华，玉浆醴泉，注液滂沱，流润六府，玄注如河，身强体轻，上摄太霞。 毕，以舌舐上齿外九过，咽之。 次思南方赤圭玉女，赍太阳之炁，绛芝玉浆灌溉我身，流溢绛宫之中，祝曰：南方赤牙，饮以醴泉，玄芝玉浆，流溢如川，仍润绛府，骨化生神，饮食太虚，举体皆仙，乘云驾霄，上造帝前。 〔毕〕，#5便以舌舐下齿之外八过，咽之。 次存西方太素玉女，赍少阴之炁，素芝玉浆灌溉身中，流溢华盖宫，祝曰：西方白牙，饮以灵液，玉水洪流，玄芝奕奕，灌我六府，镇魂固魄，神安胃管，名言金格。 毕，以舌舐上齿之内六过，咽之。 次存北方玉女，赍太阴之炁，玄芝玉水灌概我身，流溢太仓之宫，祝曰：北方黑牙，服食玄滋，饮我飞泉，哺我玉，神府充溢，如丹如芝，寿倾天地，亿万同期。 毕，以舌舐下齿内五过，咽之。 次思中央黄素玉女，赍中和之炁，黄水水华之丹灌溉我身，流溢玉堂，祝曰：中央黄牙，白石峨峨，饮食玉之丹，渴饮黄水月华，五藏充盈，流润如河，寿同三辰，万无倾殂，形升九玄，御龙飞霞。 毕，以舌舐上下内外四面，反舌刺玄英，取芝液十二过，咽之。 咽液保牙之道，中央黄老君、太极真人常所修学，色如童子，肤如玉泽，体充炁盈，发白反黑，牙齿根固，无有朽落，遂致玄降，名言玉籍，位登清虚，与帝同席。 子若修之，当於金阙，寻名玉阁，无有仙录，不得披释。 回霄降霞御空上法 青童君受 帝君生於明霞之内，五云缠络，霄炁映容，形法帝籍，受号玉虚，凝真固液，方思玄霞以自运，念游霄以登空，御玄晨於十天，骋飞电以控龙，於是精思成真，遂乘虚入无。 其诀省要，不杂众方，今以授子，便可奉行。 东方青霞，讳飞虚。 西方白霞，讳素庐。 南方赤霞，讳丹映。 北方黑霞，讳玄象， 中央黄霞，讳揔生。 能知五霞，降致飞轮，朝夕存思，玄霄来请，乘空上升，身造太清。 子修此道，每以平旦日始晖之时，出中庭，叩齿十六通，东向三呼五方霞讳。 毕，仰祝曰：五方玄霞，流映玄虚，参七御九，回造我庐，得乘飞晨，控御紫舆、上造太极，请受真书。 毕，心拜，咽炁三十六止。 暮向西，亦如上法。 夫人修学上道，不知云霞内名，云舆不为之降，存思亦不致感。 子得此法，行之十八年，室生自结之炁，云軿下降，运子之身上登玉清也。",
      "translated_text": "When the preceding is complete, visualize the five colors blending into yellow, layering and intensifying upon one another. Cloud-qi surges and billows, filling the entire chamber and coiling around your body. Feel your form suffused with warmth, heat radiating within and without, penetrating deeply for a long while. Then behold: a Green Dragon upon your left shoulder, a White Tiger upon your right, a Vermilion Phoenix above your head, and a Soaring Serpent beneath your feet. They crown your body and recite the incantation:\n\n*\"The five colors thicken and surge—white, black, red, and blue-green. From the Central Mystery they descend, merging in dark abundance. Transformed into celestial beasts, they come to guard my form. Bestow upon me the Five Mushrooms, filling my five viscera to abundance. The Crimson Palace knits its networks, and divine radiance arises of itself. My lifespan equals sun and moon, ever preserving Yellow Tranquility. Through a thousand transformations and ten thousand changes, I shall ascend to the Supreme Numinous.\"*\n\n**Method for Swallowing Saliva, Restoring Countenance, and Securing Teeth to Seek Immortality**\n\nAt the break of dawn, when the two qi have not yet divided and the dark radiance has just illuminated the world, when form and spirit descend together to gather at the Muddy Pellet Palace, essence and fluids are all generated. This is the time to swallow and ingest them. After three years of such practice, your face will glow with jade-like luster, your complexion will revert to youth, your cloud-like vitality will take root, and decayed teeth will regrow.\n\nIf you persist in this cultivation, the Five Elders will descend to your chamber. You will ascend as a divine immortal, your lifespan equaling the Three Luminaries. This is the Way of Undying—transmit it only to the true.\n\nAt the appointed time, calm your mind and settle your intent, allowing the Five Spirits to attain stillness. Knock the teeth twelve times, then visualize the Azure-Robed Jade Maiden bearing the Lesser Yang qi of the East, along with Azure Mushroom and Jade Nectar, irrigating your body. Let them flow and overflow within the Purple Tenuity Palace, and recite:\n\n*\"Eastern Bluegreen Fang, drink the morning radiance. Jade nectar and sweet springs pour forth in torrents, streaming to moisten the Six Palaces. Dark influx flows like a river. My body grows strong, my form light, ascending to grasp the Supreme Rosy Clouds.\"*\n\nWhen finished, lick the outer side of your upper teeth nine times and swallow.\n\nNext, visualize the Vermilion-Robed Jade Maiden of the South bearing the Great Yang qi, along with Crimson Mushroom and Jade Nectar, irrigating your body. Let them flow and overflow within the Crimson Palace, and recite:\n\n*\"Southern Red Fang, drink the sweet springs. Dark mushroom and jade nectar flow and overflow like rivers, further moistening the Crimson Palace. My bones transform and give birth to spirits. I feast upon the Great Void, my entire body becoming immortal. Riding clouds and driving the dawn, I ascend before the Emperor.\"*\n\nWhen finished, lick the outer side of your lower teeth eight times and swallow.\n\nNext, visualize the Pristine Jade Maiden of the West bearing the Lesser Yin qi, along with White Mushroom and Jade Nectar, irrigating your body. Let them flow and overflow within the Canopy Palace, and recite:\n\n*\"Western White Fang, drink the numinous fluid. Jade waters surge in mighty currents, dark mushrooms gleaming brightly. They irrigate my Six Palaces, anchoring my hun and solidifying my po. My spirit is at peace, my stomach and ducts secure. My name is inscribed in the Golden Register.\"*\n\nWhen finished, lick the inner side of your upper teeth six times and swallow.\n\nNext, visualize the Jade Maiden of the North bearing the Great Yin qi, along with Dark Mushroom and Jade Water, irrigating your body. Let them flow and overflow within the Great Granary Palace, and recite:\n\n*\"Northern Black Fang, consume the dark nourishment. Drink my flying springs, feed me jade broth. My divine palace fills to overflowing, like cinnabar, like mushrooms. My lifespan overturns heaven and earth, shared by millions for countless ages.\"*\n\nWhen finished, lick the inner side of your lower teeth five times and swallow.\n\nNext, visualize the Yellow-Robed Jade Maiden of the Center bearing the Harmonious qi, along with Yellow Water and Moon Essence Elixir, irrigating your body. Let them flow and overflow within the Jade Hall, and recite:\n\n*\"Central Yellow Fang, white stones towering high. Feast upon the jade broth’s elixir, slake your thirst with Yellow Water and Moon Essence. My five viscera fill to abundance, streaming and moistening like rivers. My lifespan equals the Three Luminaries, never to decline or perish. My form ascends the Nine Mysteries, riding dragons and soaring through rosy clouds.\"*\n\nWhen finished, lick all four sides of your upper and lower teeth, then press your tongue against the Mysterious Flower and draw the mushroom fluid twelve times before swallowing.\n\n**The Way of Swallowing Saliva to Preserve the Teeth**\n\nThe Central Yellow Venerable Lord and the Perfected of the Supreme Ultimate constantly practiced this method. Their complexions became like those of youths, their skin like jade, their bodies brimming with qi. Their white hair turned black again, their teeth took root and never decayed or fell out. Thus they attained the descent of the Mysterious, their names inscribed in the Jade Registers. They ascended to the Clear Void, sharing the Emperor’s seat.\n\nIf you cultivate this, you shall seek your name in the Jade Pavilion of the Golden Gates. Without immortal records, you may not unseal and reveal it.\n\n**Method for Riding Rosy Clouds, Descending Mist, and Ascending the Void**\n\nTransmitted by the Azure Lad\n\nThe Lord of the Empyrean was born within luminous rosy clouds, enveloped by the five clouds, his countenance suffused with empyrean qi. His form follows the imperial registers, and he received the title Jade Tenuity. Concentrating the true and solidifying the fluids, he contemplates the dark rosy clouds to set himself in motion, yearning to roam the empyrean and ascend the void. He rides the dark dawn through the Ten Heavens, galloping like lightning to rein in the dragons. Thus, through focused contemplation, he achieves perfection and ascends the void to enter non-being.\n\nThe essentials of this method are pure and unadulterated by other techniques. I now transmit it to you—you may practice it accordingly.\n\nThe Eastern Rosy Cloud is named *Flying Void*.\nThe Western Rosy Cloud is named *Pristine Hut*.\nThe Southern Rosy Cloud is named *Cinnabar Radiance*.\nThe Northern Rosy Cloud is named *Dark Image*.\nThe Central Rosy Cloud is named *Encompassing Life*.\n\nIf you know the five rosy clouds, they will descend and summon the flying chariots. Contemplate them morning and evening, and the dark empyrean will come to invite you. Riding the void, you will ascend and reach the Supreme Clarity.\n\nTo practice this method, at the first light of dawn, go to the central courtyard. Knock your teeth sixteen times, then face east and call the names of the five directional rosy clouds three times each. When finished, look up and recite:\n\n*\"Five Directions’ Dark Rosy Clouds, streaming and illuminating the Dark Void. Three and seven ride nine, returning to encircle my hut. Grant me the flying dawn, to rein in the purple chariot. Ascending to the Supreme Ultimate, I request the true scriptures.\"*\n\nWhen finished, bow in reverence and swallow qi thirty-six times.\n\nAt dusk, face west and perform the same method.\n\nThose who cultivate the Supreme Way yet do not know the inner names of the cloud chariots will find that the cloud carriages do not descend for them, and their contemplation will not evoke a response. If you obtain this method and practice it for eighteen years, the qi of self-generating clouds will form within your chamber, and the cloud chariots will descend to carry your body upward to the Jade Clarity.",
      "overlap_context": "nto obscurity, and nothing is heard or seen. After a long while, clarity returns. Knock the teeth twelve times and swallow qi nine times, then cease.\n\nRecite the invocation:\n*\"Central Lad, Upholding Loyalty Numinous Perfected, bestow upon me the Yellow Water and Moon Essence, the Returning Essence and Flying Dawn. With the Five Colors blazing and falling, and the Radiant Light gleaming within, overshadow me with the smoke of Yellow Splendor. Soaring through the void, ascend before the Emperor.\"*",
      "start_char": 10438,
      "end_char": 11688,
      "start_sentence": 292,
      "end_sentence": 324,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.23527240753174,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上紫度炎光神元变经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "此道宝秘，文说玄霞之讳，於世人终不得又修其方，故宜秘之。 轻泄罪累子身，殃及七祖，可不慎之。 运度天关披神洞观秘文 帝君曰：子欲飞腾上造金阙，当修洞观，运度天关，朝拜父母，存呼内真，游戏九天，上诣帝房。 每以夜半，露出中庭，仰存北斗七星朗然，思见我身在斗中央，随斗运转，历度天关，至西南方之上，便再拜，正立叩头九通，仰头微三呼：天父，地母，今故归身，归身反於父母，自然之尊，可不运度我身，我身得度，永离思路，存思二尊，仰享福祚。 毕，咽炁二过，咽液九过止。 此二尊，天地之至讳，玄真之隐名，不得妄告於人。 三过告人，九天之司减算损年，殒命九泉，终不得仙。 凡修上真之道，七星移度，披天三关，不知此讳，九天玉真闭子修思之感，非玄门之子，不可得而披，真灵不为子降。 此天地之妙法，受者当赍金人、玉人各一形，诣师口受诀言，登盟告度，不得违科，身没鬼官，殃及七玄，受者慎之慎之。 洞真太上紫度炎光神玄变经竟 #1『着』字原本缺，据下文补。 #2『道』字下当有缺文。 #3原本缺『分明』二字，据上下文补。 #4『毕』字原本缺，据上下文补。 #5『毕』字原本缺，据上下文补。",
      "translated_text": "This Dao treasure is profoundly secret. The text speaks of the hidden names of the radiant clouds, which worldly people must never learn or practice—thus it must be kept concealed. To carelessly reveal it brings sin upon oneself, calamity upon seven generations. How could one not be cautious?\n\n**Method for Moving Through the Celestial Pass and Unfolding the Divine Wondrous Observation of Secret Writ**\n\nThe Perfected Sovereign said: If you wish to ascend and soar to the Golden Gates, you must cultivate the Wondrous Observation, move through the Celestial Pass, pay homage to your parents, and inwardly invoke the true spirits. Then you may wander and play among the Nine Heavens, ascending to the Emperor’s chamber.\n\nAt midnight, step barefoot into the central courtyard. Gazing upward, visualize the Seven Stars of the Northern Dipper shining brightly. Envision your body standing at the Dipper’s center, revolving with it as it moves through the Celestial Pass. When it reaches the position above the southwest, bow twice, stand upright, and knock your head upon the ground nine times. Then, lifting your head slightly, softly call out three times:\n\n*\"Heavenly Father, Earthly Mother, I now return my body, restoring it to its natural honor in your care. Will you not move and deliver me? Once my body is delivered, I shall forever depart the paths of mortal thought. Contemplating the two honored ones, I reverently receive your blessed destiny.\"*\n\nWhen finished, swallow qi twice, then swallow saliva nine times.\n\nThese two honored ones are the most sacred names of Heaven and Earth, the hidden appellations of the Mysterious True. They must never be recklessly disclosed to others. Should one reveal them three times, the officials of the Nine Heavens will diminish one’s lifespan and cut short one’s years, casting one’s life into the Nine Springs—forever barring ascent to immortality.\n\nFor those who cultivate the Way of the Supreme True: if the Seven Stars shift their position and you open the Three Celestial Passes, yet do not know these names, the Jade Perfected of the Nine Heavens will block the resonance of your contemplation. Those who are not children of the Mysterious Gate cannot unfold this method, and the true spirits will not descend for them.\n\nThis is the wondrous method of Heaven and Earth. The recipient must present a golden figurine and a jade figurine, each one in form, to the master, and receive the oral transmission of the decisive instructions. Then, ascending the altar, they must swear an oath of initiation, never violating the precepts. Should one transgress, their body will be seized by the ghostly officials, and calamity will extend to the seven ancestral lines. The recipient must be cautious—most cautious indeed.\n\nHere ends the *Scripture of the Supreme Wondrous, Purple Passage, Blazing Radiance, and Divine Transformation of the Cavernous True*.",
      "overlap_context": "verence and swallow qi thirty-six times.\n\nAt dusk, face west and perform the same method.\n\nThose who cultivate the Supreme Way yet do not know the inner names of the cloud chariots will find that the cloud carriages do not descend for them, and their contemplation will not evoke a response. If you obtain this method and practice it for eighteen years, the qi of self-generating clouds will form within your chamber, and the cloud chariots will descend to carry your body upward to the Jade Clarity.",
      "start_char": 11688,
      "end_char": 12183,
      "start_sentence": 325,
      "end_sentence": 340,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.42227268218994,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上紫度炎光神元变经.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}