{
  "source_id": "洞真太上太素玉箓",
  "source_file": "chunked_daozang\\洞真太上太素玉箓.json",
  "total_chunks": 2,
  "total_original_chars": 1888,
  "total_translated_chars": 12209,
  "total_translation_time": 62.607686281204224,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\洞真太上太素玉箓.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Supreme Perfection Jade Register of Great Simplicity**\n\nThe *Dongzhen Taishang Dasu Yulu* (*Supreme Perfection Jade Register of Great Simplicity from the Cavern of Perfection*) is of uncertain authorship, likely compiled during the Northern and Southern Dynasties. It synthesizes the *Shijing Jinyang Sujing* (*Stone Mirror Golden Radiance Scripture of Simplicity*) and esoteric talismanic texts of the Shangqing tradition. Comprising one scroll, its base text is drawn from the *Zhengtong Daozang* (*Orthodox Daoist Canon*), Zhengyi section.\n\nThe *Jade Register of Great Simplicity* was cultivated by the Lord of Jade Dawn. Concealed by the divine envoys of the Five Thearchs within the Chamber of Great Possession in the Upper Palace of Simplicity, those who obtain it may soar through the celestial void, conceal or hide themselves, and be attended by two jade lads and two jade maidens. Secret practice yields swift verification, but leakage invites disaster. One must be meticulous and heed the master’s instructions with utmost care.\n\nThe Lord of Great Simplicity, Yuancheng Laozi, is the celestial hun-soul. He governs within the Central Culmen of the Grand Clarity, ever attending the Thearch, presiding over the primordial qi of the True Origin. He is styled the Lord of Great Simplicity and stands in paired attendance with the Lord of Great Harmony before the Thearch.\n\nThe Lord of Great Harmony, Huangcheng Laozi, is the celestial po-soul, presiding over the qi of the embryonic origin.\n\nThe Lord of Great Simplicity constantly guards the left, while the Lord of Great Harmony ever accompanies the Thearch in his comings and goings. When the Celestial Thearch enters the Purple Tenuity, he resides in the Purple Chamber of the Kunlun Yellow Gate, at the abode of the Great One.\n\nThe Three Lords and Three Qi originate from the undifferentiated primordial source, the root of all transformations. Together with Heaven and Earth, they form four; with the manifested body, five. Those who cultivate these five merge with the Dao and attain authenticity.\n\nOn the second and third days of the lunar month, at midnight (the hour of *zi*), lie in repose with eyes closed. Visualize your manifested body within the Palace of the Grand Ultimate in the Grand Clarity, where the Thearch resides. Next, contemplate the Lord of Great Simplicity in your left eye, clad in azure robes, wearing a Nine-Flowered Crown, holding green lingzhi in his left hand and a green banner in his right. Then, contemplate the Lord of Great Harmony in your right eye, clad in white robes, wearing a Five-Flowered Crown, holding golden liquid and jade nectar in his left hand and a white banner in his right, standing to the Thearch’s left and right.\n\nThe Grand Ultimate has nine names: first, the Grand Clarity; second, the Grand Ultimate; third, the Grand Tenuity; fourth, the Purple Chamber; fifth, the Mysterious Chamber; sixth, the Thearch’s Hall; seventh, the Celestial Treasury; eighth, the Imperial Palace; ninth, the Celestial Capital and Mysterious Metropolis. In essence, the Palace of the Grand Ultimate lies one *cun* directly above the crown of the head, measuring one *cun* square, situated above the Palace of the Six Harmonies.\n\nThe Palace of the Six Harmonies is where the divine sovereign of the Great One eternally resides. After visualizing the Three Perfected Ones, further visualize your hun-soul, identical in form to yourself, ascending into the Palace of the Grand Ultimate. There, the Two Elders bestow upon you green lingzhi and golden liquid, which you consume. The lingzhi resembles a lotus blossom, and the liquid is like fine wine. After partaking, visualize yourself bowing twice before the Thearch and declaring:\n\n*\"Today, I humbly petition the Thearch in his court. You bestow upon me divine lingzhi, golden liquid, and jade nectar. The Two Elders transmit the register, the Great One presents the writ. May I attain longevity and enduring vision, my lifespan boundless.\"*\n\nThe Thearch replies: *\"Fortunate one, observe the times. Return on the second and third days of the second month.\"*\n\nUpon completion, remain in repose. Through prolonged practice, you shall attain immortality and transcendence.\n\nThe Great One is the essence of the embryonic womb, the master of transformations. The hun and po are born of the womb-spirit; invoking the yang, one’s desires swiftly manifest. Disclosure or violation of the precepts brings calamity upon seven generations. How can one not be cautious? How can one not be cautious?\n\nBy ingesting the talisman of the Eastern Marchmount, the divine script unfolds, revealing the Upper Clarity. Cloud chariots welcome you, and you foreknow the myriad affairs. The Five Marchmounts follow the same method: begin with the Eastern Marchmount, then proceed in sequence. After ingesting the eighteen talismanic petitions and seal scripts, transcribe them onto purple silk and place them in a bamboo tube. In the first month, present them at the famous mountains. After submission, conceal them among great stones, ensuring no one discovers them. Take seven *sheng* of yellow earth to make mud, seal the top, and recite the following incantation:\n\n*\"I wear the Yellow Script of the Stone Mirror of the Grand Tenuity. Today, I reverently transcribe one copy to return to the Immortal Lords. May I ascend the void, ride the primordial cloud-chariot, be attended by immortal spirits, and join the company of the Perfected.\"*\n\nUpon completion, apply this method to all Five Marchmounts. Then, the divine texts of the famous mountains and stone chambers will be revealed to you, and miraculous lingzhi and rare herbs will naturally appear.\n\nTo craft the seal of the Golden Radiance of the Stone Mirror, burn the seal script and ingest it along with the seal. Suddenly, you shall commune with the divine. The method for ingesting the seal: write it in ink, swallow one seal at a time as a measure. Seal the talismans with the seal, and they will mutually reinforce each other. When ingesting talismans, consume them before meals. Upon ingestion, you may experience chills and fever, but your vision will sharpen. In a moment, a white-robed jade lad or a scholar in proper attire may appear before you—do not be alarmed, for they will soon vanish. After thirty days of such visualization, your body will naturally become light and buoyant. Superior practitioners may ascend into the Clear Void, roaming and feasting in the Upper Clarity. Middling practitioners may elevate their forms a hundred *zhang*, while lesser practitioners may rise ten *zhang*.\n\nAfter ingesting the eighteen talismans, you shall behold white-robed figures—this signifies your sincerity, and the jade lads and maidens who guard the talismans will reveal their true forms to you.\n\nBefore ingesting talismans, first abstain from the five pungent vegetables, meat, and sexual activity. Avoid defilement for a hundred days, then seclude yourself in a quiet chamber, free from the clamor of worldly people. Only then will the Dao be accomplished.\n\nThose who ingest the *Stone Mirror Golden Radiance* talismans must especially refrain from defilement, sloth, and evil conduct. Cultivate the body, contemplate the Dao, and prioritize purification, stillness, and focused devotion.\n\nThose who cultivate this Way may ascend as immortals, befriend celestial Perfected Ones, and commune with the host of immortals. They may summon divine spirits, draw forth golden elixirs and lingzhi herbs, and command traveling kitchens, dragon chariots, feathered canopies, spirit lads, jade maidens, and all the myriad spirits of the world to serve them. There shall be no knowledge unattainable, no desire unfulfilled.\n\nThe celestial talismans can repel armies for a thousand miles. If bandits in the world plot against you, they shall suffer misfortune in return. Should they raise the five weapons against you, they shall only harm themselves.\"\n\nWith the jade horse talismans and spirit texts inscribed upon the body, one may stride through the void, roam freely without obstruction, come and go at will. All malevolent forces dare not encroach, and the host of spirits reverently guard. The established patterns take form, the oral instructions held within—masters discern the worthy and transmit them according to fitness.\n\nThe *Dark Capital’s Interwoven Girdle: Cavern-True Hidden Writ of Stone Essence and Jade Talismans*\nThe Supreme Perfected of the Grand Ultimate, the Sage-Lord of Later Saints, received the *Hidden Writ of the Supreme, the Pacing of Heaven’s Net and Treading of Flying Records*, and transmitted it to the Azure Lad of Square Vessels. He in turn passed it to Perfected Wang, who bestowed it upon those of steadfast integrity and destined for immortality. In the eleventh year of the Yonghe reign of the Jin, the *yimao* year, on the ninth day of the seventh month, Perfected Wang at Red King in Linhai transmitted it to Xu Yuanyou. After purification rites, gold dragon and jade fish offerings, and ascent of the altar to swear oaths, the contract was split in two. After seven years of cultivation, one may ascend into the formless, spirit-transform without limit, and follow the heart’s desire—such is the practice of this Way.\n\nThe *Supreme Hidden Writ: Flying Pacing of the Nine Stars Talisman*\nInscribed in vermilion on silk as ground. Its heading reads: \"In the year of the Great Year, [year], the [month] month, the first day, the disciple [prefecture, commandery, county, village], Daoist [name], aged [years].\" The right column proceeds as above.\n\nThe *Dark Capital’s Interwoven Girdle: Secret Talisman of the Grand Tenuity*\nIts heading reads: \"In the year of the Great Year, [year], the [month] month, the first day, the Daoist [prefecture, commandery, county, village, name], having received the *Three Radiances of the Supreme Cavern-True Canon*, transmits it to the disciple [prefecture, commandery, county, village], Daoist [name], with forty feet of white silk, daring not to disclose it lightly.\" The right column proceeds as above.\n\nThe *Supreme Hidden Writ: Flying Pacing and Serving of the Five Stars Talisman*\nInscribed in vermilion on silk as ground. Its heading reads: \"In the year of the Great Year, [year], the [month] month, the first day, the disciple, Celestial Master of [register], Libationer of Qi of [prefecture, commandery, county, village], [name].\" The right column proceeds as above.\n\nThe *Three Radiances of the Grand Cavern Talisman*\nPearls gather radiance, green sheaths emulate the sun,\nrevolving clouds blaze bright, the Red Lad wields the numinous,\nmysterious flames scatter light, the whirlwind’s form is pure.\nSuch is the power of the sun, the fruition of the spirit.\n\nThe sixteen-character true writ: the Golden Portal Sage-Lord plucked and served the flying root of the Upper Dao. The Supreme Primordial Perfected received it from the Celestial Emperor of the Grand Tenuity. Also named the *Canon of Golden Essence, Stone Radiance, and Water Mother*, it is the *Hidden Characters of the Five Emperors Within the Sun* and the *Eight Simplicities’ Interwoven Girdle True Writ*, totaling two hundred characters. These are the secret names of the Five True Spirits of the Nine Heavens’ mutual resonance. One who bears this writ receives the characters of the Five Emperors Within the Sun, seals them, and wears them on the left elbow, naturally gaining sagely wisdom, understanding the affairs of the five directions, roaming the Five Marchmounts, sealing mountains and summoning seas, commanding the ten thousand soldiers, controlling ghosts and spirits. Heavenly spirits and earthly deities, spirit lads and jade maidens shall attend you. Ten thousand trials shall not touch you, and the Way of seeking immortals is complete. It must not be transmitted to the world.\n\nDaoists of steadfast integrity who encounter a true master shall ascend the altar to receive it, swearing the unbreakable oath of the gold dragon and jade fish. Upon completion, the master takes the gold dragon and jade fish and bestows them upon the recipient. Inscribed in yellow on azure as ground.\n\n*Here ends the Jade Register of the Supreme Primordial of the Cavern-True.*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞真太上太素玉箓 经名：洞真太上大素玉箓。 撰人不详，约出於南北期。 系纂集《石景金阳素经》及上清派符文秘契而成。 一卷。 底本出处：《正统道藏》正一部。 洞真太上太素玉箓 太素玉箓者，玉晨君所修，五帝神使秘於素灵上宫大有之房，得者飞行太空，能隐能藏，给玉童玉女各二人，密修即验，泄露致灾，精加谨慎，谛忆师言也。 太素君元成老子，天之魂也，治在太清之中句陈之内，常侍帝君，主真元之炁，号曰太素君，与太和君对侍帝君。 太和君皇成老子，天之魄也，主胎元之炁。 太素常卫左右，太和常从出入，天帝入紫微，正在昆仑黄阙紫房太一君所。 三君三炁，本混沌一原，应化之根，与天地为四，并兆身为五，能存五者，与道合真。 常以月二日、三日，夜半子时，安卧闭目，存兆身头太清太极宫中帝君，次思左目太素君，衣青衣，冠九华冠，左手持青芝，右手执青旛。 次思右目太和君，衣白衣，冠五华冠，左手持金液玉浆，右手执白幡，在帝君左右。 太极有九名，一曰太清，二曰太极，三曰太微，四曰紫房，五曰玄室，六曰帝堂，七曰天府，八曰皇官，九曰天京玄都。 要而言之，从人顶上直下一寸为太极宫，方一寸耳，在六合官上。 六合宫，太一之神皇常居其中。 常存三真毕，又存我魂一人如我之状，上入太极宫中，二老因授青芝金掖，使以与我，我食芝饮液，芝似莲花，掖如美酒。 饮食毕，存再拜帝君之前，言曰：今日告请，帝君在庭，赐以神芝，金液玉浆，二老度籍，太一奉章，长生久视，寿命未央。 帝答曰：幸哉，奉时月二月三复来。 毕仍卧，长生不死，久则神仙。 太一者，胞胎之精，变化之主，魂魄生於胎神，召阳所欲立至。 泄漏不遵科约，殃及七世，可不慎哉，可不慎哉。 服东岳之符，则神文开出上清，云舆迎子，逆知万事。 五岳同法，先东岳，以次服之，及十八谒符印文，具写之紫素，元在置筒中，以正月奏之名山，常以奏毕置大石间，莫令人知也。 子以黄土七升作泥，泥上竟，因祝之曰： 戴佩太微石景黄文，今谨写一通，以还仙君，使我登虚，运元驾云，仙灵侍卫，与真为群。 毕。 五岳悉如此法，则名山石室神仙之文，为子露出，神芝奇草自然而见也。 子欲作金阳其印具烧文，子服印俱烧而吞之，忽然自与神通。 服印之法，以墨书之，吞一印随为程，以印封符，其相成，子服符，常先食服之，符入当寒热视益明，须臾之间，当有白衣玉童，或是书生，服正立子前，勿惊也，须臾自消去矣。 当存之三十日，子身自然轻举，上士能腾入清虚，游宴上清，中士能举形百丈，下士十丈。 子服十八符，皆见白衣人也，是子诚笃，卫符玉童玉女见兆真形也。 欲服符，先绝五熏、血食、房室，勿履污秽百日，乃幽居无人之室，勿与俗人喧哗共处，则其道成也。 子服石景金阳符者，尤禁污慢恶行，当修身念道，斋静精专为先。 兆能修此道，可以升仙与天真相友，得与众仙交通，则诃召神灵，降致金丹芝草也，坐致行厨、龙车羽盖，灵童玉女、天下众精，皆来走使，无问不知，无求不得。 天地别符可以辟兵万里，天下贼人有谋之者，反受其殃，有举五兵向之者，皆还自伤。",
      "translated_text": "**The Supreme Perfection Jade Register of Great Simplicity**\n\nThe *Dongzhen Taishang Dasu Yulu* (*Supreme Perfection Jade Register of Great Simplicity from the Cavern of Perfection*) is of uncertain authorship, likely compiled during the Northern and Southern Dynasties. It synthesizes the *Shijing Jinyang Sujing* (*Stone Mirror Golden Radiance Scripture of Simplicity*) and esoteric talismanic texts of the Shangqing tradition. Comprising one scroll, its base text is drawn from the *Zhengtong Daozang* (*Orthodox Daoist Canon*), Zhengyi section.\n\nThe *Jade Register of Great Simplicity* was cultivated by the Lord of Jade Dawn. Concealed by the divine envoys of the Five Thearchs within the Chamber of Great Possession in the Upper Palace of Simplicity, those who obtain it may soar through the celestial void, conceal or hide themselves, and be attended by two jade lads and two jade maidens. Secret practice yields swift verification, but leakage invites disaster. One must be meticulous and heed the master’s instructions with utmost care.\n\nThe Lord of Great Simplicity, Yuancheng Laozi, is the celestial hun-soul. He governs within the Central Culmen of the Grand Clarity, ever attending the Thearch, presiding over the primordial qi of the True Origin. He is styled the Lord of Great Simplicity and stands in paired attendance with the Lord of Great Harmony before the Thearch.\n\nThe Lord of Great Harmony, Huangcheng Laozi, is the celestial po-soul, presiding over the qi of the embryonic origin.\n\nThe Lord of Great Simplicity constantly guards the left, while the Lord of Great Harmony ever accompanies the Thearch in his comings and goings. When the Celestial Thearch enters the Purple Tenuity, he resides in the Purple Chamber of the Kunlun Yellow Gate, at the abode of the Great One.\n\nThe Three Lords and Three Qi originate from the undifferentiated primordial source, the root of all transformations. Together with Heaven and Earth, they form four; with the manifested body, five. Those who cultivate these five merge with the Dao and attain authenticity.\n\nOn the second and third days of the lunar month, at midnight (the hour of *zi*), lie in repose with eyes closed. Visualize your manifested body within the Palace of the Grand Ultimate in the Grand Clarity, where the Thearch resides. Next, contemplate the Lord of Great Simplicity in your left eye, clad in azure robes, wearing a Nine-Flowered Crown, holding green lingzhi in his left hand and a green banner in his right. Then, contemplate the Lord of Great Harmony in your right eye, clad in white robes, wearing a Five-Flowered Crown, holding golden liquid and jade nectar in his left hand and a white banner in his right, standing to the Thearch’s left and right.\n\nThe Grand Ultimate has nine names: first, the Grand Clarity; second, the Grand Ultimate; third, the Grand Tenuity; fourth, the Purple Chamber; fifth, the Mysterious Chamber; sixth, the Thearch’s Hall; seventh, the Celestial Treasury; eighth, the Imperial Palace; ninth, the Celestial Capital and Mysterious Metropolis. In essence, the Palace of the Grand Ultimate lies one *cun* directly above the crown of the head, measuring one *cun* square, situated above the Palace of the Six Harmonies.\n\nThe Palace of the Six Harmonies is where the divine sovereign of the Great One eternally resides. After visualizing the Three Perfected Ones, further visualize your hun-soul, identical in form to yourself, ascending into the Palace of the Grand Ultimate. There, the Two Elders bestow upon you green lingzhi and golden liquid, which you consume. The lingzhi resembles a lotus blossom, and the liquid is like fine wine. After partaking, visualize yourself bowing twice before the Thearch and declaring:\n\n*\"Today, I humbly petition the Thearch in his court. You bestow upon me divine lingzhi, golden liquid, and jade nectar. The Two Elders transmit the register, the Great One presents the writ. May I attain longevity and enduring vision, my lifespan boundless.\"*\n\nThe Thearch replies: *\"Fortunate one, observe the times. Return on the second and third days of the second month.\"*\n\nUpon completion, remain in repose. Through prolonged practice, you shall attain immortality and transcendence.\n\nThe Great One is the essence of the embryonic womb, the master of transformations. The hun and po are born of the womb-spirit; invoking the yang, one’s desires swiftly manifest. Disclosure or violation of the precepts brings calamity upon seven generations. How can one not be cautious? How can one not be cautious?\n\nBy ingesting the talisman of the Eastern Marchmount, the divine script unfolds, revealing the Upper Clarity. Cloud chariots welcome you, and you foreknow the myriad affairs. The Five Marchmounts follow the same method: begin with the Eastern Marchmount, then proceed in sequence. After ingesting the eighteen talismanic petitions and seal scripts, transcribe them onto purple silk and place them in a bamboo tube. In the first month, present them at the famous mountains. After submission, conceal them among great stones, ensuring no one discovers them. Take seven *sheng* of yellow earth to make mud, seal the top, and recite the following incantation:\n\n*\"I wear the Yellow Script of the Stone Mirror of the Grand Tenuity. Today, I reverently transcribe one copy to return to the Immortal Lords. May I ascend the void, ride the primordial cloud-chariot, be attended by immortal spirits, and join the company of the Perfected.\"*\n\nUpon completion, apply this method to all Five Marchmounts. Then, the divine texts of the famous mountains and stone chambers will be revealed to you, and miraculous lingzhi and rare herbs will naturally appear.\n\nTo craft the seal of the Golden Radiance of the Stone Mirror, burn the seal script and ingest it along with the seal. Suddenly, you shall commune with the divine. The method for ingesting the seal: write it in ink, swallow one seal at a time as a measure. Seal the talismans with the seal, and they will mutually reinforce each other. When ingesting talismans, consume them before meals. Upon ingestion, you may experience chills and fever, but your vision will sharpen. In a moment, a white-robed jade lad or a scholar in proper attire may appear before you—do not be alarmed, for they will soon vanish. After thirty days of such visualization, your body will naturally become light and buoyant. Superior practitioners may ascend into the Clear Void, roaming and feasting in the Upper Clarity. Middling practitioners may elevate their forms a hundred *zhang*, while lesser practitioners may rise ten *zhang*.\n\nAfter ingesting the eighteen talismans, you shall behold white-robed figures—this signifies your sincerity, and the jade lads and maidens who guard the talismans will reveal their true forms to you.\n\nBefore ingesting talismans, first abstain from the five pungent vegetables, meat, and sexual activity. Avoid defilement for a hundred days, then seclude yourself in a quiet chamber, free from the clamor of worldly people. Only then will the Dao be accomplished.\n\nThose who ingest the *Stone Mirror Golden Radiance* talismans must especially refrain from defilement, sloth, and evil conduct. Cultivate the body, contemplate the Dao, and prioritize purification, stillness, and focused devotion.\n\nThose who cultivate this Way may ascend as immortals, befriend celestial Perfected Ones, and commune with the host of immortals. They may summon divine spirits, draw forth golden elixirs and lingzhi herbs, and command traveling kitchens, dragon chariots, feathered canopies, spirit lads, jade maidens, and all the myriad spirits of the world to serve them. There shall be no knowledge unattainable, no desire unfulfilled.\n\nThe celestial talismans can repel armies for a thousand miles. If bandits in the world plot against you, they shall suffer misfortune in return. Should they raise the five weapons against you, they shall only harm themselves.\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1244,
      "start_sentence": 0,
      "end_sentence": 36,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.51452159881592,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上太素玉箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "亦精玉马契灵文在身，飞步空境，游行无碍，去来自在，众邪不敢犯，群神所敬护，成规有象，诀在口中，师详其人，随宜启授也。 玄都交带洞真隐书石精玉契 太极真人后圣君受，太上隐书步天纲蹑飞纪，付方诸青童君，君传授王君，使授有志节之人，骨录应得仙者。 王君以晋永和十一年乙卯岁七月九日，於临海赤王授许远游。 斋戒资金龙玉鱼，登坛盟誓，分破券契，修之七年乘空入无，神化无方，随心所欲，是行斯道。 右太上隐书飞步九星契，绢为地，朱书。 其号年太岁某某月朔日子某州郡县乡里男女道士姓名年如干岁 号右行如前。 右玄都交带太微秘契。 某号年太岁某某月朔日男女道士州郡县乡里姓名以太上三景大洞真经授学者某州郡县乡里男女道士姓名以白缯绢四十尺不敢辄告要 号右行如前。 右太上隐书飞步服五星契，绢为地，朱书。 某号年太岁某某月朔日子系天师某治炁祭酒某州郡县乡里男女 号右行如前。 右大洞三景契。 珠员会晖，韬绿拟日，回霞焕明，赤童秉灵，玄炎散光，飙像郁清。 此日之势也，神之成也。 真文十六字，金阙圣君采服飞根上道，太元真人受之於太微天帝，一名金精石景水母之经，即是日中五帝隐字八素交带真文，凡二百字。 此是九天王相五方真神讳字，佩此文者，得受日中五帝字，封其字，佩之左肘，使人自然聪明圣智，晓解五方之事，游行五岳，封山召海，摄万兵，制鬼神，天灵地祇，神童玉女侍子也，万试不干，寻仙之道毕矣，不得传於世。 志节道士遭遇真师，受者登坛，誓以金龙玉鱼不泄之盟，毕，师取金龙玉鱼，以与受者，碧为地，黄书之。 洞真太上太素玉箓竟",
      "translated_text": "With the jade horse talismans and spirit texts inscribed upon the body, one may stride through the void, roam freely without obstruction, come and go at will. All malevolent forces dare not encroach, and the host of spirits reverently guard. The established patterns take form, the oral instructions held within—masters discern the worthy and transmit them according to fitness.\n\nThe *Dark Capital’s Interwoven Girdle: Cavern-True Hidden Writ of Stone Essence and Jade Talismans*\nThe Supreme Perfected of the Grand Ultimate, the Sage-Lord of Later Saints, received the *Hidden Writ of the Supreme, the Pacing of Heaven’s Net and Treading of Flying Records*, and transmitted it to the Azure Lad of Square Vessels. He in turn passed it to Perfected Wang, who bestowed it upon those of steadfast integrity and destined for immortality. In the eleventh year of the Yonghe reign of the Jin, the *yimao* year, on the ninth day of the seventh month, Perfected Wang at Red King in Linhai transmitted it to Xu Yuanyou. After purification rites, gold dragon and jade fish offerings, and ascent of the altar to swear oaths, the contract was split in two. After seven years of cultivation, one may ascend into the formless, spirit-transform without limit, and follow the heart’s desire—such is the practice of this Way.\n\nThe *Supreme Hidden Writ: Flying Pacing of the Nine Stars Talisman*\nInscribed in vermilion on silk as ground. Its heading reads: \"In the year of the Great Year, [year], the [month] month, the first day, the disciple [prefecture, commandery, county, village], Daoist [name], aged [years].\" The right column proceeds as above.\n\nThe *Dark Capital’s Interwoven Girdle: Secret Talisman of the Grand Tenuity*\nIts heading reads: \"In the year of the Great Year, [year], the [month] month, the first day, the Daoist [prefecture, commandery, county, village, name], having received the *Three Radiances of the Supreme Cavern-True Canon*, transmits it to the disciple [prefecture, commandery, county, village], Daoist [name], with forty feet of white silk, daring not to disclose it lightly.\" The right column proceeds as above.\n\nThe *Supreme Hidden Writ: Flying Pacing and Serving of the Five Stars Talisman*\nInscribed in vermilion on silk as ground. Its heading reads: \"In the year of the Great Year, [year], the [month] month, the first day, the disciple, Celestial Master of [register], Libationer of Qi of [prefecture, commandery, county, village], [name].\" The right column proceeds as above.\n\nThe *Three Radiances of the Grand Cavern Talisman*\nPearls gather radiance, green sheaths emulate the sun,\nrevolving clouds blaze bright, the Red Lad wields the numinous,\nmysterious flames scatter light, the whirlwind’s form is pure.\nSuch is the power of the sun, the fruition of the spirit.\n\nThe sixteen-character true writ: the Golden Portal Sage-Lord plucked and served the flying root of the Upper Dao. The Supreme Primordial Perfected received it from the Celestial Emperor of the Grand Tenuity. Also named the *Canon of Golden Essence, Stone Radiance, and Water Mother*, it is the *Hidden Characters of the Five Emperors Within the Sun* and the *Eight Simplicities’ Interwoven Girdle True Writ*, totaling two hundred characters. These are the secret names of the Five True Spirits of the Nine Heavens’ mutual resonance. One who bears this writ receives the characters of the Five Emperors Within the Sun, seals them, and wears them on the left elbow, naturally gaining sagely wisdom, understanding the affairs of the five directions, roaming the Five Marchmounts, sealing mountains and summoning seas, commanding the ten thousand soldiers, controlling ghosts and spirits. Heavenly spirits and earthly deities, spirit lads and jade maidens shall attend you. Ten thousand trials shall not touch you, and the Way of seeking immortals is complete. It must not be transmitted to the world.\n\nDaoists of steadfast integrity who encounter a true master shall ascend the altar to receive it, swearing the unbreakable oath of the gold dragon and jade fish. Upon completion, the master takes the gold dragon and jade fish and bestows them upon the recipient. Inscribed in yellow on azure as ground.\n\n*Here ends the Jade Register of the Supreme Primordial of the Cavern-True.*",
      "overlap_context": "ne spirits, draw forth golden elixirs and lingzhi herbs, and command traveling kitchens, dragon chariots, feathered canopies, spirit lads, jade maidens, and all the myriad spirits of the world to serve them. There shall be no knowledge unattainable, no desire unfulfilled.\n\nThe celestial talismans can repel armies for a thousand miles. If bandits in the world plot against you, they shall suffer misfortune in return. Should they raise the five weapons against you, they shall only harm themselves.\"",
      "start_char": 1244,
      "end_char": 1920,
      "start_sentence": 37,
      "end_sentence": 57,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.093164682388306,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上太素玉箓.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}