{
  "source_id": "洞玄灵宝诸天世界造化经",
  "source_file": "chunked_daozang\\洞玄灵宝诸天世界造化经.json",
  "total_chunks": 4,
  "total_original_chars": 4320,
  "total_translated_chars": 24990,
  "total_translation_time": 121.30509209632874,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\本文类\\洞玄灵宝诸天世界造化经.txt",
    "category": "本文类"
  },
  "full_translation": "**The Scripture of the Evolution of the Worlds of the Various Heavens from the Cavernous Mystery and Numinous Treasure**\n\n**Scripture Title:** *The Scripture of the Evolution of the Worlds of the Various Heavens from the Cavernous Mystery and Numinous Treasure*. Author unknown, likely composed during the Northern and Southern Dynasties or the Sui-Tang period. It expounds upon the cycles of kalpas, calamities, and methods of salvation. One scroll.\n\n**Source of the Base Text:** *Daoist Canon of the Zhengtong Era*, Cavernous Mystery Division, *Benwen* Category.\n\n---\n\n### **The Scripture of the Evolution of the Worlds of the Various Heavens from the Cavernous Mystery and Numinous Treasure**\n\n#### **Chapter One: The Heavenly Worthy’s Opening Discourse on the Scripture**\n\nThe Most High Heavenly Worthy dwelt upon Mount Lingniao, where he expounded the Twelve Divisions of the Scriptures to the assembled gods and humans. Thereupon, he divided them into four hundred thousand sections, which his disciples transcribed. Thus, it is called the Wondrous Dao.\n\nAt that time, the Heavenly Worthy transformed into a layman, his wisdom boundless, and addressed the assembly, saying: \"Since I began cultivating the Dao, I have passed through ninety-one kalpas, severing all craving and emptying the mind. Thus, I attained the Samādhi of No-Thought and became the sovereign among all sages. Through the illumination of penetrating insight, I beheld the decay and renewal of Heaven and Earth, the death and rebirth of sentient beings, without end.\n\nIt is like the sun and moon circling Mount Kunlun, revolving to illuminate the four directions. The world completes its cycle and begins anew, without cessation. There are four thousand Kunluns, four thousand suns and moons, four thousand worlds; four thousand great seas, four thousand palaces of the Dragon Kings, four thousand palaces of the Great Golden-Winged Garuḍa Kings. The great evil paths rise tens of thousands of *li* high, the great divine mountains stand thousands of *li* tall, and the great divine trees and myriad hells are boundless.\n\nAll these together are called the number of a minor kalpa-world. A thousand minor kalpa-worlds are called the number of a middle kalpa-world. A thousand middle kalpa-worlds are called the Three Realms.\n\nThe great kalpa-world begins with its formation, and after seven days, all things emerge, only to be consumed by fire and utterly destroyed. Thereafter, it forms anew, just as before, without end. This occurs naturally, without the agency of gods.\n\nIt is also like the death and rebirth of sentient beings—only their lifespans are long, and people do not perceive it. Moreover, when sentient beings die, their forms perish, but their spirits migrate, all according to the sins and blessings they accumulated in life, arriving at the abodes of the Five Paths.\n\nWhat are the Five Paths?\n1. The Heavenly Path,\n2. The Human Path,\n3. The Path of Hell,\n4. The Path of Hungry Ghosts,\n5. The Path of Animals and Beasts.\n\nIf one accumulates profound virtue in life, attaining supreme blessings, one is reborn in the Heavenly Path, enjoying long life, fine form, and boundless bliss, while retaining knowledge of past lives and their causes. If one attains middling blessings in life, one is reborn in the Human Path, entering the gate of wealth and nobility, lacking nothing.\n\nIf one’s blessings are meager and sins many, one attains lesser blessings and is reborn in the gate of poverty and lowliness, enduring base and vile circumstances in all things, or afflicted with blindness, deafness, muteness, or the six maladies, assuming an ugly, servile, foul, and filthy form.\n\nThough these two upper paths differ in superiority, they are still far better than the suffering of the three lower destinies. If one is miserly, greedy, and stingy in life, refusing to relieve hunger and thirst or aid the poor and desperate, one is reborn in the Path of Hungry Ghosts. Assuming a ghostly form, with a belly like a drum and a throat as thin as thread, even when fine food is seen, one cannot eat, enduring eternal hunger. The form is hideous, and the years long, with no escape from suffering.\n\nIf one fails to honor parents with filial piety, lacks benevolence toward the nine relations, and harms the common people, incurring the hatred of the multitude, one is reborn in the Path of Hell. Assuming the form of a sinful ghost, one endures unending torment, beyond description.\n\nIf one delights in killing and harming sentient beings, making hunting and butchery one’s occupation, neglecting to cultivate blessings and only committing evil, one is reborn in the Path of Animals, becoming sheep, cattle, pigs, geese, chickens, or ducks, suffering the retribution of slaughter and sale.\n\nWho could witness what was done in a past life? Only those who attain the Dao know this. To dispel your disbelief, I shall recite a verse:\n\nHeaven and Earth truly transform,\nWhat endures without change?\nBirth inevitably leads to death,\nSpirits follow the causes of the Five Paths.\nDare one deceive or falsify,\nHell’s bonds shall ensnare.\nOnly cultivate good deeds,\nRepent and uproot the roots of sin.\n\nThe Talisman of the Radiant Spirit of the Most High, if practiced without negligence, transcends the Three Realms, escapes the Five Sufferings, turns the Wheel without ceasing, and attains the rank of Perfected One.\"\n\n---\n\n#### **Chapter Two: The King of the Four Kunlun Worlds**\n\nThe Dao states: \"Before the mysterious transformation, I bore the title of the Most High. I beheld the King of Mount Kunlun, fashioned from gold, silver, lapis lazuli, and crystal. Its height reaches three million three hundred sixty thousand *li*. Below, it is encircled by a great sea, equally deep and wide, at three million three hundred sixty thousand *li*.\n\nThe earth’s depth is twenty billion *li*. Beneath it lies another layer of earth, also twenty billion *li* deep. Below that, a layer of grain-like gold, twenty billion *li* deep; then a layer of hard iron, twenty billion *li* deep; then water, eighty billion *li* deep; and beneath that, a great wind, five hundred twenty billion *li* thick.\n\nThis great wind supports the earth, preventing it from falling. The earth floats upon the water, the water upon the wind, and below lies the great void, a realm apart from Heaven and Earth.\n\nTo the north of Mount Kunlun, golden light illuminates the world, called *Uttarakuru*. Its land spans four hundred thousand *li*, and its people live a thousand years. Their hair is of uniform color, and men and women are of equal height, with no distinctions. The people are all virtuous and do not teach one another to do evil. Among the Four Worlds, this is the most excellent of the three.\n\nTo the west of Mount Kunlun, crystal light illuminates the world, called the *Great Tang Realm*. Its land is shaped like a half-moon, spanning three hundred twenty thousand *li* in length and breadth. Its people live two hundred years, and their stature and affairs resemble those of the human world, with lifespans long and short.\"\n\nTo the east of Mount Kunlun, silver light illuminates the world, called the *Jade Fall Realm*. Its land spans four hundred sixty thousand *li*, perfectly round in shape. Its people live three hundred years, some tall and some short, all experiencing the affairs of the human world, with lifespans long and short.\n\nTo the south of Mount Kunlun, lapis lazuli light illuminates the land, spanning two hundred eighty thousand *li*, called the *Realm of the Forsaken Worthy*. Its people vary in stature, enduring the greatest hardships of the human world, faring worse than those of the other three realms. Their lifespans are uncertain, yet they possess one virtue surpassing the three realms and even the celestial beings above: their courage and fervor make the pursuit of the Dao easier. If they cultivate merit and follow my Way, they ascend directly to the heavenly halls or transcend the Three Realms to attain the supreme Dao. But those who accumulate sins descend into hell upon death, their fate shifting in an instant, with no fixed rank.\n\nMount Kunlun stands within the *Yellow Court Heaven*, where the *August Sovereign of the Grand Tenuity* sometimes resides at its center. Four Heavenly Kings guard the four directions, each governing one of the Four Worlds. On the first and eighth days of each month, they dispatch envoys to descend and inspect the world, observing the thoughts, words, and deeds—good or evil—of emperors, ministers, common folk, dragons, spirits, and all crawling, flying, and creeping beings. On the fourteenth day, Perfected Ones descend; on the fifteenth and eighteenth days, Immortal Kings descend; on the twenty-third and twenty-fourth days, envoys descend again; on the twenty-eighth and twenty-ninth days, Immortal Kings descend once more; and on the thirtieth day, the Heavenly Kings themselves descend. These four descents are accompanied by the sun, moon, five planets, and twenty-eight constellations, with all celestial beings descending in solemn array to scrutinize those who commit sins and crimes. You should use these days to reform your hearts and conduct, observe fasts, repent of transgressions, recite scriptures, uphold precepts, and engage only in virtuous deeds. Those who do so will earn the protection of the heavenly officials, their life spans extended to their full measure, free from unjust calamities. When their allotted years are spent, they will ascend to the heavenly halls, where clothing and sustenance arise naturally, and bliss knows no end.\n\nThese words are utterly true, yet you do not believe them. Thus, I speak these verses:\n\nBehold the Four Worlds—\nno secret lies herein.\nLife passes swift as lightning—\nwhy not till the field of merit?\nIn the dark depths of hell,\ncountless aeons stretch on.\nHeaven’s law admits no pardon—\nto whom would you appeal?\n\nHeaven’s law follows truth,\nsubduing demons and wayward spirits.\nTalismans soar, blessings arrive,\nascending with the Dao to distant realms.\nThe Dark Capital enforces its decrees—\ntransgressors find no mercy.\nHasten now, as the law commands!\n\n**The Rotation of the Sun and Moon Illuminates the Four Worlds and the Third Heavenly Rank**\n\nThe Dao speaks: Above Mount Kunlun, thirty-six myriad *li* in the heavens, divine sages dwell, each in their appointed place. There are also the *Son of the Sun* and the *Son of the Moon*, their radiance complete, universally illuminating the world. Within the Moon’s city, five winds circulate, and the moon contains four palaces and five ladies. There stands the *Kan* tree, towering four thousand *li* high, its shadow appearing in the moon. The virtuous see it, and its fruit is beyond description. There are also seven immortal abodes and seven mountains and trees of the seven treasures. These immortals constantly cultivate my Way, never suffering untimely death or shortened lifespans.\n\nIf you wish to be born in this realm of long life, you must practice these five deeds:\n1. Cultivate a compassionate heart and refrain from killing, cherishing all living things.\n2. Be virtuous and refrain from theft, aiding those in poverty and distress.\n3. Maintain a pure heart and avoid illicit relations.\n4. Observe fasts, uphold precepts, and practice diligently without weariness.\n5. Be sincere and truthful, reduce alcohol consumption, and guard against transgressions.\n\nPractice these five deeds, and you will surely be born in heaven. If you still do not believe, I speak these verses:\n\nTime’s course cannot be controlled—\nalas, how fleeting is this world!\nWhy nurture guilt and sin,\nrecorded by the heavenly officials?\nOnce gone, none can be saved—\nsouls sink into hell’s abyss.\nSwiftly seek the joys of heaven,\nfor the Three Wretched Paths must not be touched.\n\nThe talisman of the *Venerable Numinous Scripture* saves and nurtures all beings, awakening the blind and benighted. With wondrous flowers and incense, cultivate the heart in reverence, attain a body of golden light, and enjoy boundless life. Hasten now, as the law commands!\n\n**The Fourth Chapter: The Great Cavern of the Heavenly Realms**\n\nThe Dao speaks: Among the beings of the Three Realms, there are three kinds of birth:\n1. Birth from flowers,\n2. Birth by transformation,\n3. Birth from the womb.\n\nThose born from flowers have accumulated profound merit and are born within lotus blossoms as heavenly beings. Those born by transformation possess meritorious spiritual power and arise through metamorphosis. Only those born from the womb, with meager merit and virtue, are the most inferior, entrusting their spirits to fleshly forms. Their lifespans are brief, and they do not compare to heavenly beings. Though heavenly beings enjoy bliss, they remain within the Three Realms. When their lifespans end, they are reborn in lower realms and cannot attain the Dao.\n\nThe Perfected are deathless, able to be and not to be. Neither diamond nor stone walls can obstruct them; thunder cannot hasten them; water and fire cannot harm them; the heavens cannot separate them; wisdom cannot surpass them; and no spirits or gods fail to submit to them. All living beings revere them without exception. These are the supreme beings of the Three Realms. Those who attain the Dao merge with the emptiness of space, boundless and endless.\n\nThose born by transformation first perform good deeds, responding to the need for transformation. To aspire to transcendence is like shedding one’s body to save beasts, forgetting death in pursuit of the Dao. One must perform myriad good deeds, sever worldly ties, retreat to mountains and forests, venerate the sacred herbs, fast day and night, bathe in purity, rinse the mouth, and avoid foul and putrid foods. Now, with spirit attached, harm no living beings, follow only the Dao, and vow without ceasing to attain the Dao and become a flying immortal.\n\nSuch teachings are imparted to the immortal officials. Daoists possess bodies clad in the robes of the law—emperors, kings, ministers, and common folk cannot practice them.\n\nOnly those who revere and practice the Ten Good Deeds, cultivate and uphold the Five Precepts, and avoid the Ten Evils will surely ascend to the heavens, gaining a lifespan of eight kalpas. Should they further embody sagely conduct, they will attain the Dao—this is no deception. All celestial beings accumulate merit in unison, and retribution follows their vows without delay. Those recorded in the Registers of Virtue within the Immortal Capitals, along with the myriad demons, ghosts, and spirits who come to listen, will have their ranks elevated and their clans augmented, swiftly attaining the Heavenly Dao and becoming Radiant Golden Immortals. Let none slight the statutes of the Mysterious Capital; the officers shall be as enlightened as the divine decrees.\n\n**Chapter Five: The Grades of Heavenly and Earthly Destruction in Minor and Major Kalpas**\n\nThe Dao declares: The earth is afflicted by three disasters.\nThe first is fire,\nthe second is water,\nand the third is wind.\nFirst comes the minor kalpa, followed by the major kalpa.\n\nWhen the minor kalpa arrives, the qi of yin and yang transforms, bringing drought and flood out of balance. The five grains grow scarce, and all trees, stones, grasses, and thorns, along with the claws and nails of living beings, turn into blades and swords, slaying one another. The people perish entirely, their lives brief and fleeting, deluded and self-deceiving. Within seven days, all kill one another until none remain.\n\nThen the great floods surge and overflow, scouring heaven and earth. Mountains and rivers shift, and the land becomes level. Sweet dew descends, and perfected beings are born, their bodies radiant with light, known as Kunlun. At that time, the floodwaters are fair and sweet, dispelling all afflictions. A single planting yields seven harvests. Should one pass foul and impure waste, the earth splits to receive it, then seals once more.\n\nHuman lifespans extend to eighty thousand years, and women wed only at five hundred. The world rejoices, its bliss equal to that of the heavens above. Yet when these perfected beings depart, their successors gradually accumulate sins. After countless millions of years, hells overflow, and the great kalpa draws near. Emperors, kings, ministers, and common folk—fathers and sons, superiors and inferiors—turn upon one another. The people lack loyalty and filial piety; rulers lack compassion and benevolence. Banditry and rebellion arise in waves, and the suffering of evil surpasses even that of the great kalpa’s onset.\n\nBeneath the Four Heavens, human nature becomes wholly corrupt, devoid of the former simplicity of customs. Then the great kalpa begins, and the great disasters arise first. Two suns appear, then three, four, five, six, and seven suns emerge simultaneously. For what seems like tens of thousands of billions of years, rivers and seas dry up, and all living beings perish.\n\nThe Heavenly Worthy gazes upon the earth, where men and women scatter and play amidst the grasses of earthly flavor. Their complexions darken, their radiance fades, and their bodies grow heavy, unable to take flight, forever mired in lower suffering. Moved by their plight, the Heavenly Worthy commands the sun and moon to return, the constellations to resume their courses, and wind and rain to follow their seasons. Sweet dew descends from heaven, and sweet springs well from the earth. People know no illness, their splendor resplendent. Their lifespans reach sixty thousand years, nourished by spontaneous grain and clothed in spontaneous garments.\n\nYet in later generations, human nature and conduct grow ever more shallow, and the roots of sin sprout anew. Lifespans gradually shorten, and the spontaneous garments and food suddenly vanish. They begin to eat the flesh of birds and beasts, donning their skins and feathers, and turn to mutual slaughter. Sins accumulate day by day, yin and yang fall out of harmony, and rain and drought lose their rhythm. In winter, they dwell in caves; in summer, they nest in trees to evade the harms of the seasons. Bereft of clothing, food, rites, and propriety, they die and descend into hell, never to ascend to heaven.\n\nThus, for countless billions of years, myriad sages and wise ones, moved by compassion, descend to teach and transform. They tame oxen and ride horses, kindle fires, till fields, and raise silkworms. They establish the affairs of rulers and subjects, clothing and feeding one another, maintaining order through hierarchy and distinctions of high and low. Those who practice the utmost goodness, aligning their conduct with the Daoist teachings, may ascend to heaven. Those who do not shall all enter hell, plunged into darkness for ten thousand kalpas without hope of release.\n\nFor this reason, I now recite these verses:\nThe suffering of hell’s prisoners knows no end,\neternal kalpas stretch without escape.\nThe poison of transgression is sown by the self—\nbelieve it well, mock not these words.\nWhen form perishes, it returns to the earth,\nwhile spirit and soul follow the foundation of deeds.\nHeaven and earth pass in a fleeting instant—\nyou have no time like the swift wind.\n\nBelow, the Primordial Life unfolds,\nharmonizing the measure of spirit.\nWings of this sacred scripture bring\nheaven and humanity joy and reverence,\nupholding fortune across the Three Realms,\nerasing your sins thereby.\nShould any dare to destroy or cast it aside,\nthe laws of hell shall show no mercy.\nSwiftly, swiftly, as the divine decree commands.\n\n**Chapter Six: The Nine Dark Hells**\n\nThe Dao declares: Beneath the Yellow and Layered Heavens lie nine continents, each encircled by a minor sea, all flowing into the great sea of Kunlun. The realm where I now teach is called the Red Continent, a lesser land. At its center lie the Nine Provinces, modeled after the greater continent.\n\nThe people of these Nine Provinces are clever and cunning, rarely sincere. Few ascend to heaven; most descend into the Nine Dark Hells, which stretch for hundreds of thousands of miles in all directions, a realm of utter darkness filled with sinners. Some have molten bronze poured down their throats; others are boiled in cauldrons, burned in raging fires, or impaled on iron forks. Some are struck with iron hammers, beaten with fiery rods, or dismembered, their heads hung aloft. Others bear sand and carry stones to fill rivers and block seas. The great spirits enforce their governance, and the punishments of the damned know no pardon.\n\nSome suffer for one kalpa, others for two, three, four, or even a hundred kalpas. There is a great pit, forty *li* square, where sinners are ordered to labor for a hundred years, casting a single mustard seed into it. Only when the pit is filled is one kalpa complete. Another great stone, forty *li* square, is set before the sinners, who are ordered to labor for a hundred years, brushing it once with a celestial robe. Only when the stone is entirely worn away is one kalpa complete.\n\nAt that time, the sinners weep and wail, turning to one another to say: *\"The mustard seed is so small, and this pit so deep and vast—when will it ever be filled? This stone is so hard, and the celestial robe so light and delicate. A single brush every hundred years—when will it ever be worn away?\"* Hearing this, the hell wardens grow enraged and declare: *\"These twenty kalpas are but half of a minor kalpa!\"*\n\nUpon hearing this, the sinners choke with grief, their breath stolen, dying and reviving only to be cast into these punishments, with no hope of escape.\n\nThe sinners then bitterly regret their past lives—how they were unfilial and rebellious, how they murdered living beings, slandered the sutras and the Dao, took lives, owed debts, schemed and stole, and failed to honor the divine Way—thus bringing upon themselves these retributions.\n\nWitnessing this, I pity you, men and women, for your sins cannot go unpunished. Therefore, I speak these verses:\n\nNeither pit nor stone is named for fame,\nTwenty kalpas are not yet half a minor kalpa’s span.\nEndlessly you toil in sin’s futile round,\nYet spirit and soul shall never be undone.\nFor but a moment you regain your form,\nOnly to be torn and flayed again.\nBoiling cauldrons seethe and steam,\nBlades and winds carve like butcher’s knives.\nPity these beings of the lower heavens—\nWhy not cultivate blessings and merit?\nRebirth in heaven is surely attainable,\nHow much more the immortal Dao’s way.\n\n**Chapter Seven: Addressing the Assembly of Sages**\n\nWhen the Most High Heavenly Worthy had finished speaking this sutra, all the assembled sages—noble lords, elders, the Nine Elders of the Immortal Capital, the Nine Qi Elders, and others—rose as one and declared, “Excellent!” They addressed the Heavenly Worthy, saying: “Such awakening to the Dao is worthy of universal reverence.”\n\nThey then asked: “In those celestial worlds, are there yet higher transformations?”\n\nThe Heavenly Worthy replied: “Since I began cultivating the Dao ninety-one kalpas ago, I have taught and transformed worlds numbering sixty-two *yì* of sands. At times, I divided my spirit and scattered my form, sharing in the cycles of birth and death. At others, I manifested as radiant vajra and lapis lazuli light, or took the form of emperors, sages, wise elders, or youths. I appeared as divine omens and benevolent beasts—lions, white deer, qilin, and phoenixes—employing every expedient means without limitation.\n\nYet the sentient beings of the world are burdened by deep and heavy sins. Their karmic conditions have not yet ripened, so they cannot receive transformation and ultimately descend into hell. Those who do receive it attain the supreme Dao and are no longer reborn within the Three Realms.\n\nNow that you have beheld this sacred precinct, you must propagate the teachings of the Dao, deliver all beings, and make great vows. May all sovereigns and emperors, all the celestial and terrestrial realms, every subject and citizen—down to the smallest flying, crawling, and creeping creatures—awaken to the truth. May none fall into the Three Evil Paths, the Ten Sufferings, or the Eight Adversities. May the dead attain boundless joy, and the living attain the Dharma-body and immeasurable life. May jeweled palaces and all things be abundant without lack.\n\nIf you thus deliver beings, you shall become teachers of gods and humans. Can you not strive with diligence?”\n\nThe Heavenly Worthy further declared: “This sutra, once revealed to the world, must not be concealed. Those who transmit it in accord with its true meaning shall prosper in blessings. Those who falsely propagate it among the vulgar shall incur guilt and calamity.”\n\nThereupon, the assembly of sages bowed their heads in reverence, all affirming its goodness. They received and upheld it with faith.\n\n*The Scripture on the Creation of the Worlds by the Divine and Wondrous Numinous Treasure of the Cavernous Mystery* is now complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞玄灵宝诸天世界造化经 经名：洞玄灵宝诸天誉界造化经。 撰人不详，约出於南北朝或隋唐。 言劫运灾变及济度之法。 一卷。 底本出处：《正统道藏》 洞玄部本文类。 洞玄灵宝诸天世界造化经 天尊说经开叙品第一 太上天尊居灵鸟山中，与诸天人说十二部经。 於是乃分四十万品，弟子书之，故曰妙道。 尔时天尊化为居士，而智慧无穷，而告众曰：我学道以来，九十一劫，断求念空，故得无想定通众圣中王。 以洞达之照，得见天地败而更成，众生死而复生，无有穷已。 如日月围绕昆仑之山，旋照四方。 天下周而复始，无止息时。 有四千昆仑，四千日月，四千天下； 有大海水四千，大龙王宫四千，大金翅鸟王宫四千； 大恶道高数万里，大神山高数千里，大神树万种种大地狱。 合尔所名，为小劫世界数； 是小劫世界千，名为中劫世界数； 是中劫世界千，名为三界。 大劫世界从彼始成，至后七日并出，悉烧败之，一切荡尽，后复更成，一如往法，无休止时。 自然如是，无神为也。 亦如众生死而复生，但其寿长远，人不知之。 又众生死时，形灭而神移，皆缘其生时所作罪福，至彼五道之处。 何谓五道。 一者天道，二者人道，三者地狱之道，四者饿鬼之道，五者畜生虫兽之道。 若其人生世积德探厚，得入上福，则生天道，长寿好形，安乐无极，还知宿命因缘之事。 若其生世得在中福，则生人道，得其富贵之门，无所不足。 若其人生世福微罪多，得在下福，则生贫贱之门，凡事下恶，所向无可，或得盲聋喑痖六疾，丑恶奴婢臭处躁秽之身。 是上二道，虽有优劣，犹胜是下三涂有生之苦。 若其人生世悭贪吝惜，不施饥渴，不济穷急，即生饿鬼之道。 当受鬼形，腹如悬鼓，喉中容缕，纵见美馔，不能得食，长受饥饿，形色丑恶，兼有长年，思灭不得。 若其人生世奉亲无孝，九族无仁，恶及百姓，群众所忌者，则生地狱之道。 受其罪鬼之形，常被考毒，不可胜说。 若其人生世好杀害众生，射猎为事，屠割为业，不知修福，但行恶事，即生畜生之道，为彼羊牛猪鹅鸡鸭，受其屠割秤卖之报。 如先身所为，谁能见是，唯得道者知之，谓汝未信，故说偈颂： 天地谅改换，何等能常存。 出生必入死，神随五道缘。 敢或有欺诳，地狱相拘连。 但当修善业，悔过灭罪根。 太上耀灵之符，行之无怠，超凌三界，得离五苦，转轮不灭，位为真人。 昆仑山王四天下品第二 道言：我在玄化之前，故有太上号，见彼昆仑山王，以金银琉璃水精作之。 上高三百三十六万里，下有大海围之，深亦三百三十六万里，广亦三百三十六万里。 地深二十亿万里。 次下有地，亦深二十亿万里。 次下有粟金二十亿万里，次下有刚铁二十亿万里，次下有水深八十亿万里，次下有大风，深厚五百二十亿万里。 以是大风持地，使有堕落地浮水上，水浮风上，其下大空，异天地也。 昆仑山北以金光照之，其天下名郁单越，地方四十万里，人寿千岁，其发钳色，男女长短同等，无有高下，民悉好善，不复相教作恶者也。 凡四天下，是天下最胜三天下也。 又昆仑山西，以水精照之，其天下名大唐界，其地如半月之形，广长三十二万里，人寿二百岁。 其人长短皆有人间之事，寿夭之年。",
      "translated_text": "**The Scripture of the Evolution of the Worlds of the Various Heavens from the Cavernous Mystery and Numinous Treasure**\n\n**Scripture Title:** *The Scripture of the Evolution of the Worlds of the Various Heavens from the Cavernous Mystery and Numinous Treasure*. Author unknown, likely composed during the Northern and Southern Dynasties or the Sui-Tang period. It expounds upon the cycles of kalpas, calamities, and methods of salvation. One scroll.\n\n**Source of the Base Text:** *Daoist Canon of the Zhengtong Era*, Cavernous Mystery Division, *Benwen* Category.\n\n---\n\n### **The Scripture of the Evolution of the Worlds of the Various Heavens from the Cavernous Mystery and Numinous Treasure**\n\n#### **Chapter One: The Heavenly Worthy’s Opening Discourse on the Scripture**\n\nThe Most High Heavenly Worthy dwelt upon Mount Lingniao, where he expounded the Twelve Divisions of the Scriptures to the assembled gods and humans. Thereupon, he divided them into four hundred thousand sections, which his disciples transcribed. Thus, it is called the Wondrous Dao.\n\nAt that time, the Heavenly Worthy transformed into a layman, his wisdom boundless, and addressed the assembly, saying: \"Since I began cultivating the Dao, I have passed through ninety-one kalpas, severing all craving and emptying the mind. Thus, I attained the Samādhi of No-Thought and became the sovereign among all sages. Through the illumination of penetrating insight, I beheld the decay and renewal of Heaven and Earth, the death and rebirth of sentient beings, without end.\n\nIt is like the sun and moon circling Mount Kunlun, revolving to illuminate the four directions. The world completes its cycle and begins anew, without cessation. There are four thousand Kunluns, four thousand suns and moons, four thousand worlds; four thousand great seas, four thousand palaces of the Dragon Kings, four thousand palaces of the Great Golden-Winged Garuḍa Kings. The great evil paths rise tens of thousands of *li* high, the great divine mountains stand thousands of *li* tall, and the great divine trees and myriad hells are boundless.\n\nAll these together are called the number of a minor kalpa-world. A thousand minor kalpa-worlds are called the number of a middle kalpa-world. A thousand middle kalpa-worlds are called the Three Realms.\n\nThe great kalpa-world begins with its formation, and after seven days, all things emerge, only to be consumed by fire and utterly destroyed. Thereafter, it forms anew, just as before, without end. This occurs naturally, without the agency of gods.\n\nIt is also like the death and rebirth of sentient beings—only their lifespans are long, and people do not perceive it. Moreover, when sentient beings die, their forms perish, but their spirits migrate, all according to the sins and blessings they accumulated in life, arriving at the abodes of the Five Paths.\n\nWhat are the Five Paths?\n1. The Heavenly Path,\n2. The Human Path,\n3. The Path of Hell,\n4. The Path of Hungry Ghosts,\n5. The Path of Animals and Beasts.\n\nIf one accumulates profound virtue in life, attaining supreme blessings, one is reborn in the Heavenly Path, enjoying long life, fine form, and boundless bliss, while retaining knowledge of past lives and their causes. If one attains middling blessings in life, one is reborn in the Human Path, entering the gate of wealth and nobility, lacking nothing.\n\nIf one’s blessings are meager and sins many, one attains lesser blessings and is reborn in the gate of poverty and lowliness, enduring base and vile circumstances in all things, or afflicted with blindness, deafness, muteness, or the six maladies, assuming an ugly, servile, foul, and filthy form.\n\nThough these two upper paths differ in superiority, they are still far better than the suffering of the three lower destinies. If one is miserly, greedy, and stingy in life, refusing to relieve hunger and thirst or aid the poor and desperate, one is reborn in the Path of Hungry Ghosts. Assuming a ghostly form, with a belly like a drum and a throat as thin as thread, even when fine food is seen, one cannot eat, enduring eternal hunger. The form is hideous, and the years long, with no escape from suffering.\n\nIf one fails to honor parents with filial piety, lacks benevolence toward the nine relations, and harms the common people, incurring the hatred of the multitude, one is reborn in the Path of Hell. Assuming the form of a sinful ghost, one endures unending torment, beyond description.\n\nIf one delights in killing and harming sentient beings, making hunting and butchery one’s occupation, neglecting to cultivate blessings and only committing evil, one is reborn in the Path of Animals, becoming sheep, cattle, pigs, geese, chickens, or ducks, suffering the retribution of slaughter and sale.\n\nWho could witness what was done in a past life? Only those who attain the Dao know this. To dispel your disbelief, I shall recite a verse:\n\nHeaven and Earth truly transform,\nWhat endures without change?\nBirth inevitably leads to death,\nSpirits follow the causes of the Five Paths.\nDare one deceive or falsify,\nHell’s bonds shall ensnare.\nOnly cultivate good deeds,\nRepent and uproot the roots of sin.\n\nThe Talisman of the Radiant Spirit of the Most High, if practiced without negligence, transcends the Three Realms, escapes the Five Sufferings, turns the Wheel without ceasing, and attains the rank of Perfected One.\"\n\n---\n\n#### **Chapter Two: The King of the Four Kunlun Worlds**\n\nThe Dao states: \"Before the mysterious transformation, I bore the title of the Most High. I beheld the King of Mount Kunlun, fashioned from gold, silver, lapis lazuli, and crystal. Its height reaches three million three hundred sixty thousand *li*. Below, it is encircled by a great sea, equally deep and wide, at three million three hundred sixty thousand *li*.\n\nThe earth’s depth is twenty billion *li*. Beneath it lies another layer of earth, also twenty billion *li* deep. Below that, a layer of grain-like gold, twenty billion *li* deep; then a layer of hard iron, twenty billion *li* deep; then water, eighty billion *li* deep; and beneath that, a great wind, five hundred twenty billion *li* thick.\n\nThis great wind supports the earth, preventing it from falling. The earth floats upon the water, the water upon the wind, and below lies the great void, a realm apart from Heaven and Earth.\n\nTo the north of Mount Kunlun, golden light illuminates the world, called *Uttarakuru*. Its land spans four hundred thousand *li*, and its people live a thousand years. Their hair is of uniform color, and men and women are of equal height, with no distinctions. The people are all virtuous and do not teach one another to do evil. Among the Four Worlds, this is the most excellent of the three.\n\nTo the west of Mount Kunlun, crystal light illuminates the world, called the *Great Tang Realm*. Its land is shaped like a half-moon, spanning three hundred twenty thousand *li* in length and breadth. Its people live two hundred years, and their stature and affairs resemble those of the human world, with lifespans long and short.\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1242,
      "start_sentence": 0,
      "end_sentence": 51,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.17489266395569,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\洞玄灵宝诸天世界造化经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "又昆仑山东天下，以银光照之，名碧落界，地方四十六万里，地正圆，人寿三百岁，或长或短，皆有人间之事，寿夭之年。 又此昆仑山南，以琉璃光照之，地方二十八万里，其地名弃贤界。 其人或长或短，於人间最苦，不如彼三天下人也。 年寿无定，犹有一事胜三天下，及上诸天人者，其人勇猛，求道易也。 若能修福，从我道者，径上生天堂，或出三界，得无上道。 如其积罪者，死入地狱，俄顷之间，无有定品。 又昆仑之山在黄曾天下，太微帝君或居中央，有四天王，各镇四边，各掌一方天下，常以月一日、八日，遣使者下，案行天下，伺察帝王臣民龙鬼，蝖飞蚑行蠕动之类，心念口言，身行善恶。 十四日遣真人下，十五日、十八日仙王下，二十三日、二十四日使者复下，二十八日、二十九日仙王下，三十日诸天王下。 四下者，日月五星、二十八宿，其中诸天森然俱下，伺察众恶罪犯之者。 汝曹当以是日，改心易行，持斋悔过，诵经持戒，唯行善事，能如是者，天官爱护，司命益算，尽其本寿，不遭枉横。 至其寿尽，上生天堂，衣食自然，安乐无穷。 是言至实而汝未信，故说偈颂： 尔观四天下，矜是无秘言。 受生若电过，那不修福田。 冥冥地狱中，万万亿劫年。 天律无原赦，为欲诉何尊。 天律乘真，正魔邪神，符腾福至，与道升遐，玄都司契，犯法不赦，急急如律令。 日月旋照四天下及天上品第三 道言：昆仑山上方三十六万里，其中神圣居之，各有方位。 又有日月天子，光明具足，普照天下。 唯月城之中，有五风转行，月中有四宫，五夫人，有骞树，上高四千里，所以影见月中，善人见之，其树有实，不可称说。 又有七仙精舍，及七宝之山，七宝之树。 此等仙人，常修我道，终无横夭损寿也。 汝曹若欲生是长寿天中者，当修是下五事。 一者慈心不杀，爱存物命。 二者贤良不盗，济救穷急。 三者用心贞洁，不犯外色。 四者奉斋护戒，精进无倦。 五者诚信不欺，减酒慎过。 行是五事，必得生天。 谓汝不信，故说偈颂： 时行叵能制，哀哉生世促。 如何萌罪辜，天官所纠录。 一往无拯拔，沈魂沦地狱。 速愿生天好，三涂不可触。 太上尊灵经之符，济育群生，开悟盲冥，杂妙华香，修心恭敬，得金光之身，无量寿命，急急如律令。 诸天世界大洞品第四 道言：三界之人，凡有三生。 一者花生，二者化生，三者胎生。 花生者，积福深厚，於莲花中生，为彼天人。 化生者，福有神力，於变化中生。 唯有胎生，福德微浅，最为下劣，托神肉形，年寿短促，不如天人。 天人虽乐，犹有三界之内，至其寿尽，还生下土，无由得道。 真人无死，能有能无，金刚不能为固，石壁不能为障，雷霆不能为驶，水火不能为患，诸天不能为隔，智慧不能为长，鬼神无不降伏，有生无不宗仰。 是为无上三界之人，得道者与虚空合体，无尽者也。 其化生者，先有善功，应化故也。 欲希升度，喻如脱身救兽，忘死求道。 当行万善，断弃俗缘，隐居山林，奉礼草圣，日夜斋直，沐浴洁清，洗荡口齿，不食臭恶。 今精神附着，不害群生，唯道是从，誓愿不绝，得道飞仙。 如是之教，语诸仙官，道士有法服之身，非是帝王臣民所能行之。",
      "translated_text": "To the east of Mount Kunlun, silver light illuminates the world, called the *Jade Fall Realm*. Its land spans four hundred sixty thousand *li*, perfectly round in shape. Its people live three hundred years, some tall and some short, all experiencing the affairs of the human world, with lifespans long and short.\n\nTo the south of Mount Kunlun, lapis lazuli light illuminates the land, spanning two hundred eighty thousand *li*, called the *Realm of the Forsaken Worthy*. Its people vary in stature, enduring the greatest hardships of the human world, faring worse than those of the other three realms. Their lifespans are uncertain, yet they possess one virtue surpassing the three realms and even the celestial beings above: their courage and fervor make the pursuit of the Dao easier. If they cultivate merit and follow my Way, they ascend directly to the heavenly halls or transcend the Three Realms to attain the supreme Dao. But those who accumulate sins descend into hell upon death, their fate shifting in an instant, with no fixed rank.\n\nMount Kunlun stands within the *Yellow Court Heaven*, where the *August Sovereign of the Grand Tenuity* sometimes resides at its center. Four Heavenly Kings guard the four directions, each governing one of the Four Worlds. On the first and eighth days of each month, they dispatch envoys to descend and inspect the world, observing the thoughts, words, and deeds—good or evil—of emperors, ministers, common folk, dragons, spirits, and all crawling, flying, and creeping beings. On the fourteenth day, Perfected Ones descend; on the fifteenth and eighteenth days, Immortal Kings descend; on the twenty-third and twenty-fourth days, envoys descend again; on the twenty-eighth and twenty-ninth days, Immortal Kings descend once more; and on the thirtieth day, the Heavenly Kings themselves descend. These four descents are accompanied by the sun, moon, five planets, and twenty-eight constellations, with all celestial beings descending in solemn array to scrutinize those who commit sins and crimes. You should use these days to reform your hearts and conduct, observe fasts, repent of transgressions, recite scriptures, uphold precepts, and engage only in virtuous deeds. Those who do so will earn the protection of the heavenly officials, their life spans extended to their full measure, free from unjust calamities. When their allotted years are spent, they will ascend to the heavenly halls, where clothing and sustenance arise naturally, and bliss knows no end.\n\nThese words are utterly true, yet you do not believe them. Thus, I speak these verses:\n\nBehold the Four Worlds—\nno secret lies herein.\nLife passes swift as lightning—\nwhy not till the field of merit?\nIn the dark depths of hell,\ncountless aeons stretch on.\nHeaven’s law admits no pardon—\nto whom would you appeal?\n\nHeaven’s law follows truth,\nsubduing demons and wayward spirits.\nTalismans soar, blessings arrive,\nascending with the Dao to distant realms.\nThe Dark Capital enforces its decrees—\ntransgressors find no mercy.\nHasten now, as the law commands!\n\n**The Rotation of the Sun and Moon Illuminates the Four Worlds and the Third Heavenly Rank**\n\nThe Dao speaks: Above Mount Kunlun, thirty-six myriad *li* in the heavens, divine sages dwell, each in their appointed place. There are also the *Son of the Sun* and the *Son of the Moon*, their radiance complete, universally illuminating the world. Within the Moon’s city, five winds circulate, and the moon contains four palaces and five ladies. There stands the *Kan* tree, towering four thousand *li* high, its shadow appearing in the moon. The virtuous see it, and its fruit is beyond description. There are also seven immortal abodes and seven mountains and trees of the seven treasures. These immortals constantly cultivate my Way, never suffering untimely death or shortened lifespans.\n\nIf you wish to be born in this realm of long life, you must practice these five deeds:\n1. Cultivate a compassionate heart and refrain from killing, cherishing all living things.\n2. Be virtuous and refrain from theft, aiding those in poverty and distress.\n3. Maintain a pure heart and avoid illicit relations.\n4. Observe fasts, uphold precepts, and practice diligently without weariness.\n5. Be sincere and truthful, reduce alcohol consumption, and guard against transgressions.\n\nPractice these five deeds, and you will surely be born in heaven. If you still do not believe, I speak these verses:\n\nTime’s course cannot be controlled—\nalas, how fleeting is this world!\nWhy nurture guilt and sin,\nrecorded by the heavenly officials?\nOnce gone, none can be saved—\nsouls sink into hell’s abyss.\nSwiftly seek the joys of heaven,\nfor the Three Wretched Paths must not be touched.\n\nThe talisman of the *Venerable Numinous Scripture* saves and nurtures all beings, awakening the blind and benighted. With wondrous flowers and incense, cultivate the heart in reverence, attain a body of golden light, and enjoy boundless life. Hasten now, as the law commands!\n\n**The Fourth Chapter: The Great Cavern of the Heavenly Realms**\n\nThe Dao speaks: Among the beings of the Three Realms, there are three kinds of birth:\n1. Birth from flowers,\n2. Birth by transformation,\n3. Birth from the womb.\n\nThose born from flowers have accumulated profound merit and are born within lotus blossoms as heavenly beings. Those born by transformation possess meritorious spiritual power and arise through metamorphosis. Only those born from the womb, with meager merit and virtue, are the most inferior, entrusting their spirits to fleshly forms. Their lifespans are brief, and they do not compare to heavenly beings. Though heavenly beings enjoy bliss, they remain within the Three Realms. When their lifespans end, they are reborn in lower realms and cannot attain the Dao.\n\nThe Perfected are deathless, able to be and not to be. Neither diamond nor stone walls can obstruct them; thunder cannot hasten them; water and fire cannot harm them; the heavens cannot separate them; wisdom cannot surpass them; and no spirits or gods fail to submit to them. All living beings revere them without exception. These are the supreme beings of the Three Realms. Those who attain the Dao merge with the emptiness of space, boundless and endless.\n\nThose born by transformation first perform good deeds, responding to the need for transformation. To aspire to transcendence is like shedding one’s body to save beasts, forgetting death in pursuit of the Dao. One must perform myriad good deeds, sever worldly ties, retreat to mountains and forests, venerate the sacred herbs, fast day and night, bathe in purity, rinse the mouth, and avoid foul and putrid foods. Now, with spirit attached, harm no living beings, follow only the Dao, and vow without ceasing to attain the Dao and become a flying immortal.\n\nSuch teachings are imparted to the immortal officials. Daoists possess bodies clad in the robes of the law—emperors, kings, ministers, and common folk cannot practice them.",
      "overlap_context": "ual height, with no distinctions. The people are all virtuous and do not teach one another to do evil. Among the Four Worlds, this is the most excellent of the three.\n\nTo the west of Mount Kunlun, crystal light illuminates the world, called the *Great Tang Realm*. Its land is shaped like a half-moon, spanning three hundred twenty thousand *li* in length and breadth. Its people live two hundred years, and their stature and affairs resemble those of the human world, with lifespans long and short.\"",
      "start_char": 1242,
      "end_char": 2478,
      "start_sentence": 52,
      "end_sentence": 101,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.75528049468994,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\洞玄灵宝诸天世界造化经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "但能尊行十善，修奉五戒，不染十恶，必生上天，八劫之寿，有兼圣则得生道，非诳汝也。 诸天齐功，随愿即报，纪德仙都，及诸群魔鬼神，有来听者，增官益族，早得天道，为金光真人，不轻慢玄都律，吏明如律令。 小劫大劫天地败成品第五 道言：地有三灾。 一者火灾，二者水灾，三者风灾。 先为小劫，后为大劫。 小劫至时，阴阳气变，水旱不调，五谷匮乏，一切木石草棘，及众生指爪，尽成刀剑，互相杀伐，人民死尽，兼人命短浅，忽自诳惑，七日之内，相杀都尽。 是洪水滔溢，洗荡天地，山川改换，土地平坦。 甘露降臻，真人下生，身有明光，名曰昆仑。 尔时洪水美好，味甘除患，一种七获，如有便利不净，地即裂之，受已还合。 人寿八万岁，女年五百岁，方乃行嫁，天下快乐，同彼上天。 其后真人过去，后生之徒，渐渐积罪，经是数千万年，地狱满溢，大劫欲至。 帝王臣民父子，上下相残，民无忠孝，君无慈仁，劫盗横起，逆暴相仍，为恶之苦，剧於大劫之前。 及四天之下，人情尽恶，无有往日淳风之俗，於是大劫始至，大灾先起，二日并出，乃至三日、四日、五日、六日、七日，一时俱为是数万亿年，河海乾涸，众生死尽。 天尊观地上，其中男女，散戏地味之草，颜色变恶，失其光明，其身即重，不能飞去，常居下苦。 於是天尊愍此众苦，令日月还生，星宿复度，风雨顺时，天降甘露，地出醴泉，人无疾病，华色赫奕。 其寿六万，食自然之米，衣自然之服。 后世人性行转薄，罪根萌生，年寿渐短，自然衣食，忽自殄灭，乃食鸟兽之肉，衣其皮羽，更相残害，罪负日积，阴阳不调，雨旱不节，冬则穴处，一夏则巢居，以避时害，未有衣食礼义之节，死入地狱，不得生天。 如是万亿年，万生圣智，感降教化，伏牛乘马，造火田蚕，衣食君人之事，以相维制，有高下贵贱之差，能行至善。 行合道教，则得生天。 如其不然，悉入地狱。 冥冥万劫，无有出期。 以是之故，今说偈颂： 地狱徒罪苦，永劫无出期。 衅毒由身植，信哉莫尔嗤。 形灭反泉壤，神魄随功基。 天地犹一忽，汝无疾风时。 下敷元生，和神之度，翼是灵经，天人庆慕，扶福三界，除汝罪故。 敢有毁堕，狱律无恕，急急如律令。 九幽地狱品第六 道言：其黄曾天下，凡有九州，皆以小海环之，流通昆仑大海。 我今教化之处，名曰赤县小洲，中为九州，法彼大洲者也。 是小九州之人，聪明巧伪，少有真实，希得生天，多入九幽地狱，纵横数十万里，其中冥冥，尽是罪人。 或洋铜灌口，或镬煮之，或猛火烧之，或铁叉刺之，或铁锤锤之，或火杖拷之，或屠解其形，悬其头首，或担砂负石，填河塞海，大神结政，徒罪无赦。 或为一劫、二劫、三劫、四劫，乃至百劫。 是劫有大探坑，方四十里，告令罪人，作役百年，投一芥子，至是坑平满，名为一劫。 又有大石方四十里，告令罪人，徒作百年，以天衣一拂，须是大石消尽，名为一劫。 尔时罪人哭泣相向，相谓曰：芥子至小，是坑深广，何当平满。 是石坚劲，天衣轻眇，百年一拂，何当消尽。 而狱吏闻之，怒而告曰：如是之劫，其数二十，未名半小劫也。 罪人闻之，气思哀咽，死而复生，将之入是科罪，无复出期。",
      "translated_text": "Only those who revere and practice the Ten Good Deeds, cultivate and uphold the Five Precepts, and avoid the Ten Evils will surely ascend to the heavens, gaining a lifespan of eight kalpas. Should they further embody sagely conduct, they will attain the Dao—this is no deception. All celestial beings accumulate merit in unison, and retribution follows their vows without delay. Those recorded in the Registers of Virtue within the Immortal Capitals, along with the myriad demons, ghosts, and spirits who come to listen, will have their ranks elevated and their clans augmented, swiftly attaining the Heavenly Dao and becoming Radiant Golden Immortals. Let none slight the statutes of the Mysterious Capital; the officers shall be as enlightened as the divine decrees.\n\n**Chapter Five: The Grades of Heavenly and Earthly Destruction in Minor and Major Kalpas**\n\nThe Dao declares: The earth is afflicted by three disasters.\nThe first is fire,\nthe second is water,\nand the third is wind.\nFirst comes the minor kalpa, followed by the major kalpa.\n\nWhen the minor kalpa arrives, the qi of yin and yang transforms, bringing drought and flood out of balance. The five grains grow scarce, and all trees, stones, grasses, and thorns, along with the claws and nails of living beings, turn into blades and swords, slaying one another. The people perish entirely, their lives brief and fleeting, deluded and self-deceiving. Within seven days, all kill one another until none remain.\n\nThen the great floods surge and overflow, scouring heaven and earth. Mountains and rivers shift, and the land becomes level. Sweet dew descends, and perfected beings are born, their bodies radiant with light, known as Kunlun. At that time, the floodwaters are fair and sweet, dispelling all afflictions. A single planting yields seven harvests. Should one pass foul and impure waste, the earth splits to receive it, then seals once more.\n\nHuman lifespans extend to eighty thousand years, and women wed only at five hundred. The world rejoices, its bliss equal to that of the heavens above. Yet when these perfected beings depart, their successors gradually accumulate sins. After countless millions of years, hells overflow, and the great kalpa draws near. Emperors, kings, ministers, and common folk—fathers and sons, superiors and inferiors—turn upon one another. The people lack loyalty and filial piety; rulers lack compassion and benevolence. Banditry and rebellion arise in waves, and the suffering of evil surpasses even that of the great kalpa’s onset.\n\nBeneath the Four Heavens, human nature becomes wholly corrupt, devoid of the former simplicity of customs. Then the great kalpa begins, and the great disasters arise first. Two suns appear, then three, four, five, six, and seven suns emerge simultaneously. For what seems like tens of thousands of billions of years, rivers and seas dry up, and all living beings perish.\n\nThe Heavenly Worthy gazes upon the earth, where men and women scatter and play amidst the grasses of earthly flavor. Their complexions darken, their radiance fades, and their bodies grow heavy, unable to take flight, forever mired in lower suffering. Moved by their plight, the Heavenly Worthy commands the sun and moon to return, the constellations to resume their courses, and wind and rain to follow their seasons. Sweet dew descends from heaven, and sweet springs well from the earth. People know no illness, their splendor resplendent. Their lifespans reach sixty thousand years, nourished by spontaneous grain and clothed in spontaneous garments.\n\nYet in later generations, human nature and conduct grow ever more shallow, and the roots of sin sprout anew. Lifespans gradually shorten, and the spontaneous garments and food suddenly vanish. They begin to eat the flesh of birds and beasts, donning their skins and feathers, and turn to mutual slaughter. Sins accumulate day by day, yin and yang fall out of harmony, and rain and drought lose their rhythm. In winter, they dwell in caves; in summer, they nest in trees to evade the harms of the seasons. Bereft of clothing, food, rites, and propriety, they die and descend into hell, never to ascend to heaven.\n\nThus, for countless billions of years, myriad sages and wise ones, moved by compassion, descend to teach and transform. They tame oxen and ride horses, kindle fires, till fields, and raise silkworms. They establish the affairs of rulers and subjects, clothing and feeding one another, maintaining order through hierarchy and distinctions of high and low. Those who practice the utmost goodness, aligning their conduct with the Daoist teachings, may ascend to heaven. Those who do not shall all enter hell, plunged into darkness for ten thousand kalpas without hope of release.\n\nFor this reason, I now recite these verses:\nThe suffering of hell’s prisoners knows no end,\neternal kalpas stretch without escape.\nThe poison of transgression is sown by the self—\nbelieve it well, mock not these words.\nWhen form perishes, it returns to the earth,\nwhile spirit and soul follow the foundation of deeds.\nHeaven and earth pass in a fleeting instant—\nyou have no time like the swift wind.\n\nBelow, the Primordial Life unfolds,\nharmonizing the measure of spirit.\nWings of this sacred scripture bring\nheaven and humanity joy and reverence,\nupholding fortune across the Three Realms,\nerasing your sins thereby.\nShould any dare to destroy or cast it aside,\nthe laws of hell shall show no mercy.\nSwiftly, swiftly, as the divine decree commands.\n\n**Chapter Six: The Nine Dark Hells**\n\nThe Dao declares: Beneath the Yellow and Layered Heavens lie nine continents, each encircled by a minor sea, all flowing into the great sea of Kunlun. The realm where I now teach is called the Red Continent, a lesser land. At its center lie the Nine Provinces, modeled after the greater continent.\n\nThe people of these Nine Provinces are clever and cunning, rarely sincere. Few ascend to heaven; most descend into the Nine Dark Hells, which stretch for hundreds of thousands of miles in all directions, a realm of utter darkness filled with sinners. Some have molten bronze poured down their throats; others are boiled in cauldrons, burned in raging fires, or impaled on iron forks. Some are struck with iron hammers, beaten with fiery rods, or dismembered, their heads hung aloft. Others bear sand and carry stones to fill rivers and block seas. The great spirits enforce their governance, and the punishments of the damned know no pardon.\n\nSome suffer for one kalpa, others for two, three, four, or even a hundred kalpas. There is a great pit, forty *li* square, where sinners are ordered to labor for a hundred years, casting a single mustard seed into it. Only when the pit is filled is one kalpa complete. Another great stone, forty *li* square, is set before the sinners, who are ordered to labor for a hundred years, brushing it once with a celestial robe. Only when the stone is entirely worn away is one kalpa complete.\n\nAt that time, the sinners weep and wail, turning to one another to say: *\"The mustard seed is so small, and this pit so deep and vast—when will it ever be filled? This stone is so hard, and the celestial robe so light and delicate. A single brush every hundred years—when will it ever be worn away?\"* Hearing this, the hell wardens grow enraged and declare: *\"These twenty kalpas are but half of a minor kalpa!\"*\n\nUpon hearing this, the sinners choke with grief, their breath stolen, dying and reviving only to be cast into these punishments, with no hope of escape.",
      "overlap_context": "iad good deeds, sever worldly ties, retreat to mountains and forests, venerate the sacred herbs, fast day and night, bathe in purity, rinse the mouth, and avoid foul and putrid foods. Now, with spirit attached, harm no living beings, follow only the Dao, and vow without ceasing to attain the Dao and become a flying immortal.\n\nSuch teachings are imparted to the immortal officials. Daoists possess bodies clad in the robes of the law—emperors, kings, ministers, and common folk cannot practice them.",
      "start_char": 2478,
      "end_char": 3721,
      "start_sentence": 102,
      "end_sentence": 142,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.91949248313904,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\洞玄灵宝诸天世界造化经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "方恨先身不孝恶逆，为贼杀生，诽谤经道，夺人之命，负人之财，奸巧盗取，不奉神道，致有是报者也。 我见如是，念汝士女不可为罪，故说偈颂： 坑石不为名，二十非大劫。 悠悠徒罪中，神魄不为灭。 须臾起身形，暂尔复屠裂。 镬汤为蒸煮，刀风为俎切。 愍哉下天人，何不建福业。 生天必可果，况复神仙法。 告众圣品第七 太上天尊说是经已，尔时众圣诸君丈人、九老仙都君、九炁丈人等，悉皆在座，咸曰善哉，上白天尊：如是悟道，无不宗仰。 请问彼诸天世界，复有至化不。 天尊告曰：自我学道九十一劫，因学教化六十二亿尘沙世界，或分神散体，同其生死，或化作金刚瑠璃之光，或为帝王圣智长老童子，或为神瑞仁兽，师子白鹿、麒麟凤凰，种种方便，无所不通。 但天下众生，罪业深重，缘期未至，不能受化，终归地狱。 其中受化之者，悉得至道，不生三界。 汝曹既睹道场，唯当阐扬道教，济度群生，为发大愿，普令国主帝王，总及诸天地法界，一切臣民，下至蜎飞蠕动蚊行之类，皆使开悟，不入三涂十苦八难，死得无极之乐，生得法身无量之寿。 七宝宫殿，无物不足。 汝能如是济度，则为天人之师，可不勉也。 天尊告曰：是经出世，未可隐藏。 同契相授，景福由昌。 谬传流俗，获罪招殃。 於是众圣稽首，悉皆称善，信受奉行。 洞玄灵宝诸天世界造化经竟",
      "translated_text": "The sinners then bitterly regret their past lives—how they were unfilial and rebellious, how they murdered living beings, slandered the sutras and the Dao, took lives, owed debts, schemed and stole, and failed to honor the divine Way—thus bringing upon themselves these retributions.\n\nWitnessing this, I pity you, men and women, for your sins cannot go unpunished. Therefore, I speak these verses:\n\nNeither pit nor stone is named for fame,\nTwenty kalpas are not yet half a minor kalpa’s span.\nEndlessly you toil in sin’s futile round,\nYet spirit and soul shall never be undone.\nFor but a moment you regain your form,\nOnly to be torn and flayed again.\nBoiling cauldrons seethe and steam,\nBlades and winds carve like butcher’s knives.\nPity these beings of the lower heavens—\nWhy not cultivate blessings and merit?\nRebirth in heaven is surely attainable,\nHow much more the immortal Dao’s way.\n\n**Chapter Seven: Addressing the Assembly of Sages**\n\nWhen the Most High Heavenly Worthy had finished speaking this sutra, all the assembled sages—noble lords, elders, the Nine Elders of the Immortal Capital, the Nine Qi Elders, and others—rose as one and declared, “Excellent!” They addressed the Heavenly Worthy, saying: “Such awakening to the Dao is worthy of universal reverence.”\n\nThey then asked: “In those celestial worlds, are there yet higher transformations?”\n\nThe Heavenly Worthy replied: “Since I began cultivating the Dao ninety-one kalpas ago, I have taught and transformed worlds numbering sixty-two *yì* of sands. At times, I divided my spirit and scattered my form, sharing in the cycles of birth and death. At others, I manifested as radiant vajra and lapis lazuli light, or took the form of emperors, sages, wise elders, or youths. I appeared as divine omens and benevolent beasts—lions, white deer, qilin, and phoenixes—employing every expedient means without limitation.\n\nYet the sentient beings of the world are burdened by deep and heavy sins. Their karmic conditions have not yet ripened, so they cannot receive transformation and ultimately descend into hell. Those who do receive it attain the supreme Dao and are no longer reborn within the Three Realms.\n\nNow that you have beheld this sacred precinct, you must propagate the teachings of the Dao, deliver all beings, and make great vows. May all sovereigns and emperors, all the celestial and terrestrial realms, every subject and citizen—down to the smallest flying, crawling, and creeping creatures—awaken to the truth. May none fall into the Three Evil Paths, the Ten Sufferings, or the Eight Adversities. May the dead attain boundless joy, and the living attain the Dharma-body and immeasurable life. May jeweled palaces and all things be abundant without lack.\n\nIf you thus deliver beings, you shall become teachers of gods and humans. Can you not strive with diligence?”\n\nThe Heavenly Worthy further declared: “This sutra, once revealed to the world, must not be concealed. Those who transmit it in accord with its true meaning shall prosper in blessings. Those who falsely propagate it among the vulgar shall incur guilt and calamity.”\n\nThereupon, the assembly of sages bowed their heads in reverence, all affirming its goodness. They received and upheld it with faith.\n\n*The Scripture on the Creation of the Worlds by the Divine and Wondrous Numinous Treasure of the Cavernous Mystery* is now complete.",
      "overlap_context": " say: *\"The mustard seed is so small, and this pit so deep and vast—when will it ever be filled? This stone is so hard, and the celestial robe so light and delicate. A single brush every hundred years—when will it ever be worn away?\"* Hearing this, the hell wardens grow enraged and declare: *\"These twenty kalpas are but half of a minor kalpa!\"*\n\nUpon hearing this, the sinners choke with grief, their breath stolen, dying and reviving only to be cast into these punishments, with no hope of escape.",
      "start_char": 3721,
      "end_char": 4262,
      "start_sentence": 143,
      "end_sentence": 164,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.455426454544067,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\洞玄灵宝诸天世界造化经.txt",
        "category": "本文类"
      }
    }
  ]
}