{
  "source_id": "洞真太上八道命籍经",
  "source_file": "chunked_daozang\\洞真太上八道命籍经.json",
  "total_chunks": 17,
  "total_original_chars": 18153,
  "total_translated_chars": 118917,
  "total_translation_time": 606.8730101585388,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\洞真太上八道命籍经.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Wondrous Scripture of the Supreme Eight Dao Registers of Life**\n\n**Scripture Title:** *The Wondrous Scripture of the Supreme Eight Dao Registers of Life*\nAuthor unknown, approximately composed during the Northern and Southern Dynasties. It expounds the methods for absolving sins and repenting transgressions on the eight solar terms. In two fascicles.\n\n**Source of Base Text:** *Daoist Canon of the Zhengtong Era*, Orthodox Section, Part One.\nSee also *Seven Bamboo Tablets of the Cloudy Satchel*, Fascicle 51.\n\n---\n\n**The Wondrous Scripture of the Supreme Eight Dao Registers of Life, Fascicle One**\n\n**Formulas for Absolving Sins**\n\nThe *Eight Dao Registers of Life* is also called the *Eight Intervals*, the *Eight Attainments*, and further named the *Wondrous Scripture of the Eightfold Liberation, Unbinding Knots, Repenting Sins, and Prolonging Blessings*. The Lord of Primordial Purity’s Three Origins received it from the natural chapters and sealed it within the Purple Chamber of the Numinous Capital of the Supreme. Three hundred attendants, adorned with golden seals and jade blossoms, stood guard and tended the incense. The Youth of the Eastern Sea, the Perfected of the Four Poles, and the Lord King of the Western City sealed it within the western chamber of Mount Emei. Transmitted once every ten thousand kalpas, those with the mystic name \"Imperial Tablet of Purple Script\" and the \"Jade Treasury of the Azure Palace\" may receive three transmissions within a thousand years. Disciples of the highest learning who lack this text will toil in vain among the mountains and forests, never attaining the Dao.\n\nThe so-called *Eight Dao* refer to the paths traversed by the sun and moon during the eight solar terms of the four seasons. The sun travels the Red Dao, and the moon travels the Yellow Dao—these two, the Yellow and Red Dao, are the constant paths of yin and yang. At the solar terms of *Lichun* (Beginning of Spring) and *Chunfen* (Spring Equinox), the moon travels the two Green Dao, emerging east of the Yellow Dao. At *Lixia* (Beginning of Summer) and *Xiazhi* (Summer Solstice), the moon travels the two Red Dao, emerging south of the Yellow Dao. At *Liqiu* (Beginning of Autumn) and *Qiufen* (Autumn Equinox), the moon travels the two White Dao, emerging west of the Yellow Dao. At *Lidong* (Beginning of Winter) and *Dongzhi* (Winter Solstice), the moon travels the two Black Dao, emerging north of the Yellow Dao. These are the *Eight Dao*.\n\nOn the days when the moon traverses the Eight Dao, all things undergo transformation: winged creatures take flight, crawling beings stir, and all that bears qi—plants, trees, flying and submerged beings—respond to conditions, altering the old and renewing themselves. The light becomes heavier, the heavy becomes lighter; good and evil interchange. The movement of qi and its manifestations occur naturally. Disciples of the highest learning, following these transformations, practice auspiciousness and eliminate inauspiciousness, advance the fortunate and demote the wicked, clarify the abandonment of darkness, enter rectitude to govern perversity, refine the false into the true, and elevate the foolish to sagehood. This method is lofty and wondrous; this Dao is profound and unfathomable. Thus, it is called the *Eight Attainments*, reaching the ultimate without end.\n\nFor the *First Dao Register of Life*: at dawn on *Lichun* (Beginning of Spring), gaze northward for clouds of purple, green, and white—these are the Three Primordial Lords of the Supreme’s *Three Pure Flying Clouds*. Kneel, knock your head to the ground, and clasp your cheeks nine times each. Bow four times in your heart, then prostrate twice more. Silently recite the incantation:\n\n*\"The humble descendant [insert name] today fortunately encounters the procession of the Three Origins. May I attain longevity and serve the wheel-hub of the celestial chariot. The rest of my words follow my own intent: [I] beseech healing from illness, deliverance from calamity, dissolution of disaster, and fulfillment of my wishes.\"*\n\nUpon seeing the cloud chariot thrice, one ascends to immortality in broad daylight, no longer requiring other meditative practices of a thousand or a hundred.\n\nPerforming these rites ensures enrollment in the immortal registers—hence they are called the *Eight Dao Registers of Destiny*.\n\nThe **Second Dao Register of Destiny**: At midnight of the vernal equinox, facing northeast, observe clouds of dark cyan and yellow—these are the *Three Primordial Clouds* of the Celestial Emperor of the Supreme Subtlety. The rites of visualization, obeisance, and secret incantation follow the method above.\n\nThe **Third Dao Register of Destiny**: At dawn of the summer solstice’s onset, facing northwest, observe clouds of purple, cyan, and yellow—these are the *Three Primordial Clouds* of the Supreme Perfected Lords of the Great Ultimate’s Inner Palace. The rites of visualization, obeisance, and secret incantation follow the method above.\n\nThe **Fourth Dao Register of Destiny**: At dawn of the summer solstice, facing southeast, observe clouds of red, white, and cyan—these are the *Three Primordial Clouds* of the Celestial Emperor of Fusang. The rites of visualization, obeisance, and secret incantation follow the method above.\n\nThe **Fifth Dao Register of Destiny**: At dawn of the autumnal equinox’s onset, facing due west, observe clouds of white, red, and purple—these are the *Three Primordial Clouds* of the Heavenly Sovereign White Emperor of the Supreme Perfected. The rites of visualization, obeisance, and secret incantation follow the method above.\n\nThe **Sixth Dao Register of Destiny**: At dawn of the autumnal equinox, facing south, observe clouds of plain white, red, and yellow—these are the *Three Primordial Clouds* of the Supreme Perfected Lord of the Southern Culmen and the August Red Emperor. The rites of visualization, obeisance, and secret incantation follow the method above.\n\nThe **Seventh Dao Register of Destiny**: At dawn of the winter solstice’s onset, facing southwest, observe clouds of green, purple, and cyan—these are the *Three Primordial Clouds* of the Perfected Lord of the Supreme Clarity and the Imperial Ancestor. The rites of visualization, obeisance, and secret incantation follow the method above.\n\nThe **Eighth Dao Register of Destiny**: At dawn of the winter solstice, facing due east, observe clouds of vermilion, azure, and yellow—these are the *Three Primordial Clouds* of the Jade Consort of the Great Empyrean and the Supreme Perfected of the Great Void. The rites of visualization, obeisance, and secret incantation follow the method above.\n\nOn the days of the Eight Dao Registers, one or two days prior, bathe, burn incense, and await the appointed time. At the proper hour, go forth to gaze for the duration of a meal, then return indoors. If overcast or rainy, do not gaze. Should these clouds appear unexpectedly on other days, perform the rites and incantations as above—this is thrice as efficacious as on the appointed day.\n\nFor all past and present transgressions—whether from former lives or this life, sins unresolved, apologies unaccepted, pardons delayed, merits difficult to advance, demonic trials unrecognized, leading to setbacks, premature aging, and elusive ascension—once departed, one lingers in unseen suffering without end. Disciples of the higher studies, awaken to this with alarm! Swear devotion, yearn for the mysterious, and penetrate the numinous. By obtaining the Dao Registers, you decisively sever the roots of sin, untie the knots of evil, and nourish the wellspring of goodness. No demon dares intrude, and swift attainment of Perfection is assured. Sincerely cultivate in secret, and verification will soon follow.\n\nFor all absolutions of sin, first conduct a purification fast. On the days of the Eight Dao Registers, maintain purity of body and mind. Without like-minded companions, do not rashly partake in the Great Dao. The divine Perfected, immortals male and female, constantly gather in the Mystic Capital, observing long fasts and pure assemblies. They transform countless beings through the sincerity of their forms and propagate karmic deeds to aid the living. The living are never without need, and responses must never lapse. Where responses never lapse, there are always methods of governance—such is the Terrace of the Jade Capital, the eternal site of response.\n\nLife never ceases in death, nor death in life. Emerging into life and entering death, boundless and endless. Heaven and earth are innumerable, lands are infinite. Rebirth and death recur without pause, moment by moment. Arising and ceasing intermingle; being and non-being mutually constitute. Life is called \"being,\" death is called \"non-being.\" Yet non-being is not truly non-being, nor being truly being. Neither being nor non-being, eternally responsive and present, abiding without extinction, wisdom is inexhaustible.\n\nDisciples of the higher studies, together return and hasten to this! The path to hastening lies in stages; entry comes through *qi*. Contemplate the divine, record the *qi*, practice the methods, and ascend the stages—this is called *fasting*. *Fasting* means *alignment*. Purify the heart and cleanse the body; body and heart respond in unison. Inner and outer harmonize, reverence is meticulous, devotion unwavering from beginning to end. Without negligence or omission, without carelessness or arrogance, one savors the Supreme Dao—hence it is called *fasting*. Fasting methods are manifold and cannot all be recorded. The Perfected transmit them orally, teaching one another. The scriptures contain their forms; here, only the essentials are outlined. Their adaptation and practice depend on the individual.\n\nTo study without fasting is labor in vain—like firewood without flame, like flame without transmission, like ascending heaven without a cloud-ladder, like flying without astral *qi*. Though one may exert oneself, how can the heart’s desire be fulfilled? Fulfillment must come through fasting; fasting’s stillness must entail repentance. Unwashed transgressions bar blessings; without blessings, calamity surely arrives. If calamity comes and cannot be averted, there is no means to become a Perfected Immortal. The Perfected and Immortals observe long fasts, accumulate contemplation over time, absolve manifold faults, sever misfortune and welcome fortune, amass blessings and deepen virtue. With virtue fulfilled, one enters the Dao, unites with the divine, and abides in eternal joy, free from suffering.\n\nThose resolved to pursue this must cast off worldly dust, vow to conduct pure fasts, and employ the methods of the Three Origins. The method takes *guarding the One* as its essence, and the One takes tranquility as its home. This home lies within the human heart—it should be harmonious and compliant. The beauty of harmony and compliance is what people esteem. Yet to practice this is most difficult to expand, for sins past and present entangle, and demonic forces intrude, making attainment arduous. Urgently conduct fasts—morning, noon, and evening, or six times daily—great and small repentances and vows. The finest invocations and principles are explored herein.\n\nAfter completing the fasts in sequence, perform almsgiving, rescue the distressed, aid the imperiled, secretly establish hidden merits, reform the heart and alter conduct, diligently cultivate yang virtues, and avoid known transgressions. Acknowledge faults and refrain from repeating them; if repeated, repent again. After three repentances, calamities dissolve and blessings arrive. If wishes remain unfulfilled, cultivate diligently without slackening. When aspirations and the Dao align, one may rest.\n\nAfter three transgressions, further repentance is not accepted, and pardon is not granted. Clearly understand and be cautious. Before receiving the methods, the first category of calamities arises; after receiving them, the second category emerges; from birth onward, the third category persists. These three categories encompass manifold calamities of varying depths, which cannot all be recorded. Here, only the general outline is provided—apply it analogously to other cases.\n\nFrom past lives to the present, from former incarnations to this body, though the span may be distant or near, the categories of transgressions remain the same. Yet by tracing their origins and dissolving them, one may perfect virtue through meritorious deeds.\n\nBorn into wealth and nobility, one may cultivate both the Dao and worldly affairs, moving through life in peace and security, accompanied by good fortune and joy. Some may take official service as their vocation, others trade and commerce as their means, still others farming and sericulture as their occupation, or fishing and hunting as their custom. Though these pursuits are mundane, one must neither indulge in excess nor steal, neither act in delusion nor sow disorder, nor recklessly interfere with others. Fathers do not mourn their sons, lords do not mourn their ministers, elder brothers do not mourn their younger siblings, masters do not mourn their disciples. The aged pass without illness, the young live free from affliction, serving one another. They send off the dead and welcome the newborn, offering condolences in misfortune and celebrating in joy—this is the state of middling equilibrium, yet few can preserve it.\n\nThe heavenly hosts rejoice in such harmony, yet if one ceases to accumulate merit, and the blessings of former lives are exhausted, one may still fall among the ill-fated. Therefore, the wise and discerning aspire to be born in a lower realm, follow a master to practice the Dao, transmit and receive teachings in succession, and attain immortality—living forever without death. This is called \"superior study,\" its achievement surpassing the middling path.\n\nOnly those who rise from the middling may ascend to superior study, for the methods of superior study are not to be debated by the common or base.\n\n**First Category: Frequent Bereavement**\nThe deaths of grandparents, father, master, or lord, as well as close kin and family—whether elders or juniors, beyond the bounds of natural calamity or fate—bring mourning upon oneself, and thus share the same affliction. The transgression arises from disobedience, rebellion against superiors, and encouraging others in such acts without repentance. To dissolve this, use gold and silk to purchase many living beings, feed and release them, each to its proper place.\n\n**Second Category: Chronic Illness from Infancy**\nBorn with frequent illness, recovery brings suffering to the household and oneself alike, both falling into the third category. The transgression arises from a lack of benevolence, harming living beings with qi, mocking others’ afflictions, and cursing them with illness. To dissolve this, prepare wine and medicine, and place them at night along thoroughfares, marketplaces, and places of destitution.\n\n**Third Category: Entanglement in Public and Private Affairs**\nThough not one’s own fault, one is unjustly implicated, whether noble or base, male or female, close or distant kin—all become entangled.\n\n**Fourth Category: Strife and Litigation**\nThe transgression arises from a lack of gentleness, delighting in conflict and inciting lawsuits, restraining and confining creatures of the air and water, caging and binding living beings. To dissolve this, use paper, brushes, cinnabar, ink, and knives, bestowing them upon whomever one encounters—no need to explain the reason.\n\n**Fifth Category: Slander and Gossip**\nWhether ordained or lay, one spreads defamation and hearsay, engages in groundless disputes over blind texts, and stirs empty, baseless strife. The transgression arises from a refusal to accept counsel, treating kin and strangers with equal coldness, broadcasting others’ faults, and defying admonitions. To dissolve this, prepare rice, soup, broth, fish, meat, fruits, and vegetables, and place them along thoroughfares—no need to observe who partakes.\n\n**Sixth Category: Encounters with Bandits**\nIn public or private travels, whether dwelling in mountains or the world, one suffers assault, coercion, plunder, or injury from violent men. The transgression arises from a lack of compassion, seizing and plundering all things, harming both humans and spirits, and indulging one’s desires for personal gain. To dissolve this, use treasures, bamboo, tiles, grass, earth, and bricks to repair and protect lodgings, altering ritual implements.\n\n**Seventh Category: Failure in Scholarship**\nExternally, one studies the classics, histories, philosophers, anthologies, maps, and books; internally, one practices sacred texts, esoteric methods, and essential techniques. Yet one loathes to seek knowledge, whether seen or unseen, and though one reads and recites, nothing is mastered—years pass in vain. The transgression arises from a lack of integrity, defiling body and mind, violating the decorum of teachers and friends, envying others’ talents, and corrupting the *Book of Changes* and scriptures. To dissolve this, use oil, firewood, charcoal, torches, and candles to hand-copy scriptures and diagrams, encouraging and aiding like-minded practitioners.\n\n**The above six items, ranked in three grades, encompass ninety-nine thousand nine hundred and ninety transgressions.**\n\n**Eighth Category: Demotion in Office**\nWhether serving as ruler, minister, or official, one is dismissed for incompetence while in office, or though possessing some virtue, suffers unjust demotion and returns home, relegated to remote posts and reduced to poverty. The transgression arises from a lack of propriety, usurping rank and feigning authority, arrogantly defying the three courts, and oppressing the four regions. To dissolve this, use brooms and dustpans, secretly delivering them to others’ homes, sweeping paths morning and evening—let no one know.\n\n**Ninth Category: Childlessness or Many Daughters**\nThough a wife or concubine has been with one for years, no son is born; if a boy arrives, he dies, while daughters survive. The transgression arises from a lack of obedience, defying superiors, severing others’ bloodlines, and colluding in licentiousness. To dissolve this, cast gold, silver, pearls, and jade into flowing water, making offerings to childless kin and worthy predecessors to continue the lineage of Dao and virtue.\n\n**Tenth Category: Miscarriage and Infant Loss**\nA wife or concubine conceives, but the fetus is harmed and miscarried; or the child lives for ten days, or even a few years. The transgression arises from a lack of restraint, carelessly engaging in intercourse, harming another’s pregnancy, and making both public and private imprecations. To dissolve this, offer fragrant oil, golden *ruyi* scepters, tables, mats, and bamboo sleeping mats to healing abodes.\n\n**Eleventh Category: Jealousy Between Husband and Wife**\nWhether husband and wife or master and concubine, their union is immoderate, fostering mutual suspicion and jealousy, causing discord within and without. The transgression arises from a lack of chastity, engaging in affairs, prizing one’s own beauty, and resenting others’ attractiveness. To dissolve this, distribute five-colored ink and five-hued silks along the road, regardless of wealth or status.\n\n**Twelfth Category: Humiliation of High and Low**\nKings fall to rebels, ministers encounter bandits, the ordained and laity meet with misfortune, suffering insults and beatings on the road. The transgression arises from a lack of uprightness, abandoning good for evil, reversing proper roles between men and women, and defiling purity. To dissolve this, secretly deliver incense burners, cosmetic boxes, and bronze or iron vessels to the wilderness, aiding others in marriage and encouraging vegetarian feasts and gatherings.\n\n**Thirteenth Category: Harm from Water, Fire, Insects, Birds, Ghosts, and Multitudes of Disasters**\nWhether dwelling or traveling, in mountains, waters, or roads, one suffers calamities where nurture turns to harm. The transgression arises from a lack of righteousness, slaughtering and butchering, violating the intimacy of ruler, teacher, and elders, and inciting internal strife. To dissolve this, cast caps, robes, chests, tables, knives, and spoons into mountains, waters, or along roads in court and countryside.\n\n**The above six items, ranked in three grades, encompass thirty-three thousand three hundred and thirty transgressions.**\n\n**Fourteenth Category: Unintentional Loss**\nScriptures, treasures, money, grain, cloth, servants, and slaves vanish without cause. The transgression arises from a lack of discipline, indulging in laziness, refusing others’ requests, and stealing for personal gain. To dissolve this, deliver glue, lacquer, locks, and keys to healing abodes.\n\n**Fifteenth Category: Drunkenness and Forgetfulness**\nIn recitation and speech, one forgets what came before and loses what follows, spreading perverse and erroneous tales. The transgression arises from a lack of caution, treating confusion as clarity, neglecting the recitation of scriptures and precepts, and carelessly incurring faults. To dissolve this, deliver mirrors and assorted hides to healing abodes.\n\n**Sixteenth Category: Remote and Desolate Dwellings**\nOne resides in humble alleys within the central lands, or in border towns and barbarian regions, amid perilous mountains and treacherous waters. The transgression arises from a lack of resolve, flattering and fawning to favor one’s own kin while harming others’ dwellings. To dissolve this, scatter knives, axes, saws, chisels, hammers, drills, nails, and stakes along the road.\n\n**Seventeenth Category: Blessings Turning to Misfortune**\nOne performs vegetarian feasts and almsgiving, yet provokes disputes and offenses, suffers robbery and calamity, or incurs harm from humans and ghosts. The transgression arises from a lack of understanding, defying the Three Honored Ones, falsely invoking spirits and ghosts, and making reckless divinations and dream interpretations. To dissolve this, fashion golden dragons and jade fish, entwining them with bamboo slips, and cast them into mountains and waters.\n\n**Eighteenth Category: Good Deeds Inviting Evil**\nOne intends good for others, yet they suspect ill; what one advises turns to resentment, and one is scorned, mocked, and resented, fostering deep, empty grudges. The transgression arises from a lack of wisdom, mistaking folly for cunning, slandering the Dao of teachers, and forcing a reputation for virtue. To dissolve this, light lamps—ten, a hundred, a thousand, ten thousand—matching the number of days to one’s capacity.\n\n**Nineteenth Category: Success Turning to Failure**\nIn matters of Dao and the world, whether constructing, establishing, or creating, whether public or private undertakings, though logic dictates success, they are ruined by humans or ghosts. The transgression arises from a lack of clarity, acting with hesitation and obstruction, pursuing selfish ends, and sabotaging others’ accomplishments. To dissolve this, provide servants, carriages, oxen, boats, lamps, and abundant offerings to healing abodes.\n\n**The above six items, ranked in three grades, encompass seventy-seven thousand seven hundred and seventy transgressions.**\n\n**Twentieth Category: Gains Lost Again**\nIn matters of Dao and the world, whether public or private, what one seeks, sees, or obtains clearly may vanish in an instant or over time, leaving no trace. The transgression arises from a lack of purity, recklessly accepting things, concealing illicit affairs, and bestowing favors only to later regret them. To dissolve this, distribute one’s own clothing and belongings along the road, giving them to whomever one meets—ask not whether they are in need.\n\n**Twentieth Category: Being Envied by Others**\nThose with talent and virtue, who attain rank and wealth, drawing people to them, may incur envy and resentment. The transgression arises from inequity, forming cliques at will, seeking to surpass others, and suppressing the worthy and wise. To dissolve this, offer wooden sandals, bedframes, and curtains to all those of the Dao—whether known or unknown—giving whenever encountered.\n\n**Twenty-First Category: Being Suspected by Others**\nAs one’s Dao, reputation, and rank advance daily, whether concealing brilliance or guarding constancy, others may harbor groundless suspicion and jealousy. The transgression arises from disloyalty, deceiving both the hidden and the manifest, breaking myriad vows, and misleading or ruining the good. To dissolve this, provide cold jars and basins, along with combs and bathing implements, and send them to healing abodes.\n\n**Twenty-Second Category: Being Afflicted by Ghosts**\nOne may suddenly see ghosts approach, engaging in union with men or women, or spewing foul and vile curses without self-awareness. The transgression arises from faithlessness, deceitful pretenses, illicit sacrifices that distort truth, and alarming the common people. To dissolve this, use peach-wood talismans and inscribed boards, carving and purifying them, then present them with vermilion mats, sending them to healing abodes.\n\n**Twenty-Third Category: Being Possessed by Evil**\nOne may suddenly behave strangely, or amid illness and suffering, see disturbing visions, seek truth in vain, and though no harm manifests, the influence of evil grows daily. The transgression arises from impropriety, blending Dao with worldly customs, mingling men and women indiscriminately, and confusing humans and spirits. To dissolve this, offer scripture pedestals, halls, bedframes, curtains, desks, headscarves, hats, kitchenware, and chests, sending them to healing abodes.\n\n**Twenty-Fourth Category: Failing Trials Beyond Measure**\nTeachers, friends, or demonic forces may impose unforeseen trials—matters one has never encountered, which ought to be rejected—yet one now deems them good, stirring the mind and consciousness. The transgression arises from lack of focus, superficial learning, hasty expectations, delayed disillusionment, and leaking sacred teachings. To dissolve this, offer oneself in service to one’s teacher, then construct a healing abode, personally tending incense and lamps, sweeping and cleansing with utmost devotion, and establishing teachings for future generations.\n\n**The above six items, ranked in three grades, encompass thirty-three thousand three hundred and thirty transgressions.**\n\n**In total, there are twenty-four categories, comprising four sets of six. The three eights lie within them, encompassing all conditions—great and small, doubtful and certain, right and wrong, tangled in deliberation—all are clarified and rectified here. Through repentance and gratitude, they are dissolved and released. What is offered and dispersed must be given with utmost sincerity, without regret or reluctance, and great fortune will swiftly arrive. If not using gold or silk, one must exert mind and body, calculating labor and time, estimating worth by the day. Those who give without reckoning do so by their own will; if others cannot bear it, whether rich or poor, take the middle path—what matters is the absence of stinginess. Stinginess leads to relapse, and three relapses leave no recourse.**\n\nThe Lord of the Azure Youth of the Eastern Sea addressed the Perfected One of Square Cauldron, saying: *\"Your responsiveness and transformation of sentient beings—those with aspirations must be encouraged and guided. Transmit this teaching with utmost secrecy and care. Past transgressions need not be recounted; from this day forward, correct yourself according to these principles. After repentance and gratitude, minor calamities will dissolve at once. For major calamities not yet dispelled, hasten to avoid them. Where you flee, observe the celestial patterns, gazing above and below, with precision and without disclosure. As the celestial texts foretell, great calamities must be eradicated, and in eradicating calamities, fortune is summoned—this begins with this scripture. This scripture’s essential method is treasured both within and without, revered by all sages, its fragrance enduring without end. The Two Perfected Lords guarded this in utmost secrecy; Wei Huacun received the decree and practiced it with efficacy, later transmitting it to the solitary and reclusive. Few have cultivated this text, and fewer still attained perfection. Only through the mysterious names and illustrated registers may one obtain it. The highest serves as the state’s teacher, the middle as a teacher among the people, and the lowest cultivates the self to become a teacher—these are the three grades.\"*\n\n**The Upper Scroll of the Supreme Perfected’s Scripture of the Eightfold Dao’s Register of Life Concludes**\n\n**The Lower Scroll of the Supreme Perfected’s Scripture of the Eightfold Dao’s Register of Life**\n\nThe Great Dao of the Supreme, its *qi* pervading the ten directions, governs human movement and stillness through the eight alone. The four cardinal directions and four diagonals belong to the upper and lower; the lower and upper directions encompass and unify the eight. The eight trigrams’ true spirits enact the eight *qi*, with the Great One as their master, and the Three Origins flowing in circulation. This circulation extends among humans, where paths exist within the spaces. These paths connect to the virtuous—those with jade tablets may wander freely, exiting through the eight gates, guided and roaming, reaching the ten directions. The sacred multitudes of the ten directions all depart through the eight gates; the *Eightfold Dao’s Register of Life* records all that the sages practice. In transforming and aiding the good, the sun is yang and the moon yin; hidden virtue secretly connects, linking to the wondrous teachings of the spirits. These are the secrets of the sages and perfected, guarded with strictest discipline. Without dissolving transgressions, one cannot perceive or hear them; hearing and perceiving without understanding, or understanding without practicing, or practicing without efficacy—all is labor in vain, increasing faults. Yet if one possesses utmost sincerity, meditating deeply on the mysterious, one will surely dissolve transgressions, behold this scripture, comprehend its matters, and obtain great fortune. Following its cultivation, efficacy will manifest, and perfection will be achieved.\n\n**The Method of Repentance and Gratitude**\nCultivate the Dharma-body alone. If there are like-minded companions, two or three, up to nine, but no more. If by good fortune and karmic conditions, many worthy and wise gather beyond nine, form a separate repentance assembly—do not forcibly combine, lest you offend the Nine Heavens, seeking fortune only to invite misfortune. Let each be cautious.\n\nWhen teachers or friends face illness or hardship and cannot personally perform repentance, fellow students or aspirants may act on their behalf, alone or with companions, but never exceeding nine. The Dharma-teacher, reciter, repentance supervisor, scripture attendant, incense attendant, lamp attendant, and tablet bearer must all follow the proper method.\n\n**The Practice of the Eightfold Dao**\nObserve the four seasons, six affairs, eight solar terms, five phases, twenty-four qi, the virtues of faith and earthly works, encompassing both inner and outer—thus, there are no longer repentances for the four seasons.\n\n**In performing mutual repentance, none may accept the offerings of the host’s refined altar in four categories.** Upon concluding the repentance and gratitude, the four categories of offerings are to be distributed in silence, without others’ awareness.\n\nWhen questioned, respond with appropriate expedience. Should there be alms offered, one may say it is \"presented in devotion\"; if the recipient declines out of humility, do not press or harbor suspicion, but instead offer it to another who may accept. There is no need to inform others whether it was received or not.\n\n**The Method of Concluding the Repentance Ritual**\nApplies universally to the Three Origins, though the number of days varies: nine in spring, three in summer, seven in autumn, and five in winter. Day and night, one practices the Dao, observing the six periods and three times of dawn. Offerings of dried vegetables, fruits, and grains are made according to each person’s means.\n\nBefore the appointed days, sweep and purify both inner and outer spaces, arrange ritual implements, and prepare fresh and refined offerings—never hastily fulfilling requirements at the last moment. Boundaries must be strictly observed, and no clamor or disorder permitted. Those engaged in the ritual fast must not leave the premises; if they do, they may not return, and if they return, they must reside separately, taking care not to intrude upon the ritual space.\n\nFor messengers from outside, they are to remain at the gate to relay messages. Those inside shall interpret, first rinsing their mouths with water before speaking and again afterward—this must not be neglected. Arrange the altar, courtyard, halls, and chambers with beds, curtains, tables, incense vessels, mats, wells, screens, and hangings, ensuring all is clean, secure, and complete. The kitchen, well, stove, bathhouse, and latrines must all be suffused with fine incense to prevent foul qi from spreading and defiling the dwelling.\n\nEach latrine must be designated for specific use—sitting or lying down—without overlap. High and low must not intermingle, lest all incur calamity. To prevent misfortune and seek blessings, one must exercise utmost caution.\n\nOn the evening of the ritual assembly, some may eat while others do not; beverages and medicines vary, but all must bathe alike. Even for prolonged fasts, bathing remains essential. Adjust words and intentions, announce one’s presence at the hour of rest, enter the chamber with solemn purity, and follow the usual morning rites.\n\nWhen performing the Great Repentance and reciting the text, a chanter shall intone the names and titles. The Dharma-teacher strikes the teeth thirty-six times, then kneels and holds the text as follows:\n\n*Great Mystery Capital Three Caverns Dharma-teacher, [Name] of [Sacred Peak], Lesser Self Perfected of the Three Luminaries, disciple practicing the Great Cavern Scripture. If not yet received into the Three Caverns, simply state: Disciple of the Supreme Mystery Capital Jade Capital Purple Palace Celestial Chamber Three Luminaries, Great Cavern Dharma-teacher, Lesser Self Perfected, [Name] of [Sacred Peak], Lady [Name].*\n\n*[Names of Lords, Ministers, Concubines, and Servants], reverently address the Supreme Boundless Great Dao, the Three Origins Supreme Perfected August Elders, the Highest Celestial Capital High August Jade Emperor, the Nine Mysteries Dao Lord, the Boundless Heavenly Worthy, the Supreme Cavern Mystery Natural Vacant Sovereign, the Five Directions and Five Emperors, the Flying Immortals of the Five Peaks, the Jade Bureau and Golden Towers, and all divine officials. Your humble servant, [Name], unworthy and foolish, has presumptuously received the Supreme Dao, filled with joy and gratitude, yet also trembling with awe and shame. Unable to devote myself fully to the wondrous Dharma or swiftly ascend to immortality, I have drifted through the worldly realm, accumulating faults and transgressions. Days and months pass swiftly, but life is fleeting. I constantly fear sudden demise, never to return, and am struck with sorrow, my heart and viscera rent with pain. I rely upon your mysterious compassion to bestow mercy and protection.*\n\n*Now, in this era of purgation, I have fortunately encountered the path to deathlessness. Though my polluted body has long forgotten its sins, I vow to aspire to the arts of longevity. Prostrating before the Eightfold Dao’s register of destinies and the Eightfold Essential Texts, gazing upon the Three Primes, I honor the Eight Venerables. Through the repentance ritual, I seek to untangle the coils of sin, disperse past and future calamities, and attain immortality. Undeterred by my worthless existence, I pledge to cultivate this practice. If acting on behalf of another, state: \"Now there is a teacher, friend, esteemed lord, elder, parent, child, or disciple [Name], who has received this Dharma. Due to illness, hardship, or worldly obligations, they cannot perform the ritual themselves. Through your servants’ entreaty, we focus our minds as prescribed, united in purpose and daring to present these words on their behalf, reverently reciting them for your hearing.\"*\n\n*In accordance with the rites, we have prepared offerings and secretly adhered to the essential instructions. With purified hearts and solemn words, we reverently recite for your hearing.*\n\n*[Name], Daoist Disciple and Libationer of [State, Commandery, Village], disciple of the [Cavern] School, your humble servant [Name], aged [X] years, of [X] household members, currently residing at [Location], prostrates in repentance, seeking grace and pardon. Those joining in this entreaty shall list their village, rank, and names.*\n\n*Your humble servant [Name], base and foolish, a mere sprout of the earth, has fortunately, through good karma, received the wondrous Dharma and bears the profound and boundless debt of mysterious grace. Yet, born and raised in the vulgar world, I have grown accustomed to evil and wasted time, accumulating faults in movement and stillness, day and night. Though I have received scriptures and precepts, I have failed to cultivate them. Now, in this era of disasters and poisons, facing the time of purgation, I fear becoming mere dust, struck with sorrow and dread. Like the sparrow and mouse, I cling to life; like the mayfly and reed, I yearn to live. Undeterred by my polluted state, I dare to seek the blessings of advancement.*\n\n*On [Date] at [Location], I received from the Dharma-teacher [Name] the [Scripture/Precept], essential methods, wondrous arts, secret texts, and treasured instructions, totaling [X] volumes in [X] bundles. Or, in the year of [Celestial Stem] under the reign of [Year], on [Date] at [Location], due to [Circumstance], I obtained [X] volumes. On [Date] at [Location], I entered the Mysterious Covenant.*\n\n*Filled with joy and delight, I vowed to uphold and practice them, hoping to fulfill my long-held wishes. On [Date] at [Location], I suddenly fell ill with [Disease], or encountered [Public/Private Calamity], as the case may be. Anxious and fearful, I worried for my survival. Or, I was born sickly, impoverished, and distressed, orphaned young or solitary in old age, forsaken by heaven and man—[describe circumstances]. Truly, my past sins run deep, and my present transgressions are grave, bringing this misfortune upon me. Ashamed and terrified, I dare not complain.*\n\n*Upon reflection, my sinful self deserves annihilation; how dare I presume to trouble your hearing? Yet, relying upon your mysterious compassion, which embraces all dust and filth, bestows goodness, and perfects even the slightest merit, I humbly purify my heart and body, fast, and prostrate in repentance. I beg for renewed grace, the profound mercy of triple forgiveness, the dissolution of disasters and illnesses, the resolution of official matters, the restoration of balance, and the extension of my years. I vow never to transgress again, to reform and renew myself, to cultivate the Dharma I have received, and to attain the limit of immortality’s seed. May I now receive your inscription and bear the grace of your perfecting mercy.*\n\nWith reverent words, I hereby declare:\n\nOn the [day] of the [month], in the year of the [celestial stem] under the Great Year [Tai Sui], at the hour of [zodiac sign], in the mountain lodge of [village], [district], [county], [prefecture], I, [name], humbly present my earnest plea, beseeching your compassion and grace. Grant what I have requested, fulfill what I have prayed for—absolve my sins and bestow blessings, let the Dao and virtue flourish, let merits and deeds be accomplished, and may I surely attain the state of divine immortality.\n\nI diligently recite the precepts and observe the secret teachings, subduing the thousand demons and securing the protection of the ten thousand spirits. The Nine Perfected Envoys shall transmit my supplication, presenting it directly before the throne of the Jade Emperor of the Nine Mysteries. At dawn, I shall perform the Daoist rites and once more submit my plea.\n\nWhen the invocation is complete, I rise and circumambulate, reciting the Three Stanzas of Wisdom. Upon finishing, I face north and bow in reverence to the ten directions. Then, proceeding eastward to face west, I recite the Seven Retributions and Seven Harms, and chant the Great Precepts of Bodily Observation. For those not yet familiar, I hold the text and read aloud.\n\n**The Seven Retributions are as follows:**\n\nThe Perfected One says: Embracing yin and holding yang, causes and conditions differ; forsaking death to attain life, karmic retribution varies. Good begets good, evil begets evil—like a shadow following form, not a hair’s breadth in error.\n\nGood and evil are manifold, and their blessings and retributions innumerable. Speaking broadly, their manifestations number seven:\n\n1. In a former life, one performed meritorious deeds and spread virtue, delivering and saving all beings. If one’s conduct in this life remains unchanged, one shall be reborn in a hall of blessings, transcend the Eight Difficulties, receive human felicity, and enjoy the natural rewards of heaven.\n\n2. In a former life, one was devoted to learning, aspired to divine immortality, revered the mysterious precepts, and held the sacred scriptures in faith. One repented of evil and embraced goodness, establishing practices to enter the realm of the Perfected. If one’s conduct in this life remains unchanged, one shall be received by the Thearchs, one’s name inscribed on the Purple Tablets, and ascend to the Jade Dawn.\n\n3. In a former life, one delighted in the Dao, unafraid of hardship or cold, serving one’s master with diligence, prioritizing labor, enduring hunger and thirst without complaint. If one’s conduct in this life remains unchanged, one shall ride the flying plow, roam and feast upon the Five Peaks, and traverse the void like drifting mist.\n\n4. In a former life, one was pure and chaste, neither licentious nor deceitful, neither greedy nor desirous, unmoved by beauty, with a heart like dead ashes, firmly rooted in the source of the Dao. If one’s conduct in this life remains unchanged, one shall be rewarded with the company of numinous beings, transcend the Three Paths, and avoid the Five Sufferings.\n\n5. In a former life, one performed good deeds, wishing for universal prosperity, that all might ascend and transcend the Eight Difficulties. Though others did not suffer, one could not bear one’s own comfort, giving away one’s own garments to relieve the destitute and cold, sharing food with crows, and leaving offerings in desolate mountains. If one’s conduct in this life remains unchanged, the Four Administrations shall praise one’s virtue, moving the Jade Emperor to inscribe one’s name on the Purple Tablets and elevate one to the rank of Perfected Immortal.\n\n6. In a former life, one was loyal and filial, reverently serving one’s elders and superiors, honoring those more accomplished, and respecting one’s teachers and lords. One’s heart and eyes were in harmony, as if one body, free from jealousy or careless speech. One’s inner and outer conduct were aligned, every movement in accord with the Perfected. If one’s conduct in this life remains unchanged, one shall be received by numinous beings, avoid the Three Paths, transcend the Eight Difficulties, and enjoy the mutual infusion of goodness and blessings. Such is the retribution—how could the Dao ever fail one?\n\n7. In this life, one is wicked, harboring malice and deceit, attacking one’s teachers, slandering sacred texts, disdaining the numinous scriptures, and doubting the Two Heavenly Perfected Ones. Outwardly, one feigns goodness, seeking vain glory, speaking with a forked tongue, acting contrary to the source of the Dao. One steals scriptures without swearing an oath, recklessly divulging secret formulas, and spreading false teachings. If one’s conduct in this life remains unchanged, one shall violate the precepts and transgress taboos, falling into the source of sin. One’s seven ancestors shall suffer calamity, and one’s destitute soul shall be held accountable. Upon death, one shall endure torment, feed on fire, tread upon mountains, and suffer the Three Paths and Five Agonies for ten thousand kalpas without reprieve. In the dark of the netherworld, one’s body shall be lashed with pain.\n\nThose who wish to cultivate and learn must carefully study this text, reform evil, and practice goodness to swiftly ascend as divine immortals.\n\n**The Seven Harms are as follows:**\n\nThe Perfected One says: In learning, one must harmonize the Six Directions and beware of the Seven Harms.\n\n1. The first harm: outwardly embracing the Perfected while inwardly acting falsely, indulging in lust and dissipating one’s spirit. One’s ethereal soul leaks, essence and light wither, qi scatters, and the corporeal soul disperses. One’s bones hollow, one’s form trembles, and the spirits weep in the exhausted palaces. This is heard at the Gate of Heaven, and the Perfected Immortals flee far away. One then forms karmic ties with the mundane world, becoming akin to the Earthly Bureau. How can one ever attain immortality?\n\n2. The second harm: outwardly appearing to follow the Dao, with a demeanor of reverence for the Perfected, yet inwardly harboring malice, allowing wickedness to fester. One wishes for others’ ruin, envies the capable, and resents the worthy. One’s speech is fair, but one’s heart is perverse; one’s face is joyful, but one’s heart is wrathful. One judges others’ gains and losses, recklessly creates the source of sin, slanders fellow students, and attacks one’s teacher’s foundation. The Three Offices record this, marking one as an evil portal. The Perfected Immortals depart, and demonic forces assail one’s body, causing one’s form to wander and one’s spirit to scatter. Thus, one suffers unjust calamities, reaching the depths of evil. When one’s allotted years are exhausted, one’s form turns to ash, and one is extinguished in the Nine Springs. Though one may have a name in the mysterious records, how can one preserve one’s natural state?\n\n3. The third harm: drinking to utter intoxication, damaging one’s qi and dissipating one’s spirit. The Five Palaces collapse, and the ten thousand spirits are startled. One’s ethereal and corporeal souls scatter, and one’s inner and outer being decay. One’s original chamber is left empty, and the Red Child wails in sorrow. The Perfected Immortals depart, and demonic forces enter one’s form. Such learning only wastes one’s essence and sincerity. Though one may have a name in the mysterious records, one’s jade-like reputation is lost in vain. One’s spirit ascends to the Upper Palace, while one’s body turns to ash in the dark netherworld. Though one may linger in a state of confusion, how can one endure for long?\n\n4. The fourth harm: failing to respect others, disparaging one’s teachers and masters, harboring resentment in one’s heart and expressing it in speech, cursing and reviling without restraint. One’s anger and joy lack moderation, and one’s temperament is perverse. One’s qi surges, and one’s spirit scatters; one’s inner Perfected flees, and one’s corporeal soul departs. The nine orifices gather dust, and the Five Palaces flee in disarray—all due to one’s impure nature and inauspicious conduct. The Perfected Immortals depart, and external afflictions enter one’s form. With such learning, what can one hope to gain? Though one may possess the mysterious charts, one cannot escape this calamity. The days of aspiring to immortality grow distant, while the netherworld’s trials lengthen.\n\nThe fifth harm: when one’s mysterious charts are revealed or one receives precious scriptures, or when one encounters a numinous master who imparts divine texts—yet fails to follow the precepts and covenants, outwardly leaking celestial perfection, and before completing nine years of practice, presents petitions to sacred mountains, causing the Azure Palace to record one’s name and the Golden Tower to compile one’s deeds, then transmits these to others, scattering them among the world—such reckless disclosure of the true and leakage of the sacred will bring retribution upon oneself. Though one may bear a transcendent name, it will instead burden the Seven Mysteries. The Dao of immortality ascends on high, while one’s body perishes in the nether springs, forever consigned to ghostly reckoning, never to be absolved through ten thousand kalpas.\n\nThe sixth harm: when the body lingers in defilement and impurity, the numinous barrier loses its radiance, the Five Spirits scatter and flee, the Red Child soars away, and demonic forces assail one from within and without—both inner and outer are lost. With such learning, one’s aspirations to attainment only invite harm. The Perfected Immortals ascend in solitude, while one sinks into turbid chaos, and immortality remains forever beyond reach.\n\nThe seventh harm: consuming the flesh of the six livestock, slaughtering creatures with hooves and mouths for their savor, filling the viscera with foul qi, inflicting death’s punishment upon the innocent, disturbing the true qi at the numinous gate, startling the wandering spirits of the Red Child, causing the hun and po to wander the chambers, and clogging the mouth and teeth with turbid stagnation. The Perfected Immortals ascend to the Jade Clarity, while one’s own body founders in the earthly realm. Though one may bear a transcendent name in the Emperor’s records, this will not exempt one from inevitable death.\n\nThe Most High Sagely Thearch declares: The foundation of learning lies in urgently guarding against the seven harms. Once one has gazed upon the gates of the cavern-heavens and perused the jade scriptures, if one does not transgress the prohibitions of the seven harms, one may sit and await the descent of the numinous, ascending at dawn into the light of day.\n\nIf one toils externally in study yet fails to dispel the seven harms within, this will lead to attainment turning into failure, life into death, fortune into misfortune, and flight into sinking. The numinous immortals wander the lofty clarity, while the Five Spirits scatter to the eight wilds. The Red Child wails within the central chamber, and the wandering soul laments in the dark emptiness.\n\nThus, the path to immortality has its successes and failures, and superior learning entails the seven harms. Those who earnestly revere the Dao must thoroughly refine their true nature.\n\nAll who are divinely endowed and aligned with the charts, whose jade embryos dwell in the Purple Void, whose names are inscribed in the Eastern Florescence—having beheld the text on the examination of the seven harms—if they possess no such endowment, may not rashly peruse the numinous scriptures or casually view the sacred texts. Those who encounter this text are of a nature harmonious with transcendence; after nine years of cultivation, they may attain flight through the mysterious void and ascend to the Jade Clarity of the Highest Heaven.\n\nRecite the precepts beginning from the fifth, proceeding in order to the end and then returning to the start, completing one cycle at the fourth, without reading the prefaces or postscripts. As the text is lengthy and not repeated, refer to separate scrolls when reciting.\n\nUpon completing the recitation of the precepts, rise and approach the lamp, strike the teeth three times, and silently recite the Lamp-Brightening Incantation three times:\n\nThe Most High scatters light in the ten directions,\nFlowering lamps convey sincerity.\nAll heavens blaze resplendent,\nAll earths shine with clarity.\nMy body, too, becomes luminous,\nThe five viscera blossom with splendor.\nFiery radiance illumines the Great Void,\nFar-reaching thoughts flourish in the Jade Clarity.\n\nCinnabar essence abides in the Great Origin,\nMysterious intestines resound in emptiness.\nEmbracing form, eradicating the roots of suffering,\nContemplating the profound and true.\nHanging blossoms reveal no substance,\nCausal conditions manifest as light and image.\nMy body is likewise transformed,\nRiding transformation, entrusting to the flowing radiance.\n\nNight’s light reveals the yang elixir,\nShining brightly in the numinous chamber.\nAll lamps universally radiate brilliance,\nAll yin is extinguished.\nMy spirit, too, becomes keen and bright,\nEver delighting in wisdom and insight.\nCarefree, I follow the Dao’s course,\nChanging and yielding to heaven’s decree.\n\nRaising my form, I tread the empty cavern,\nNight’s candle gleams with flowing splendor.\n\nWhen the incantation is finished, turn from west to east, return the incense burner, and recite the incantation to clear the throat before retiring to the chamber, observing all movements as in the morning rites.\n\nAt dawn the next day, at the hour of *chou*, rise with solemn purity. At the hour of *yin*, ascend the platform to the door, clear the throat, recite the incantation, and visualize the master—all as in the morning rites.\n\nFor those who have not taken a worldly master and seek to invoke the mysterious covenant, visualize the Azure Lad of the Mysterious Master in the Palace of the Square Cauldron, beseeching his descent and manifestation, □ the secret of longevity, and swift attainment of immortality, that the dissemination of transformation may be boundless.\n\nUpon completing the visualization of the master, close the eyes, strike the teeth thirty-six times, and recite the incantation:\n\nBefore the Great Demon King of the Northern Thearch,\nBefore the Lord Who Receives Affairs,\nGhosts of the Yellow Springs’ bends,\nThe Four Luminaries of Mount Feng,\nA thousand demons mingling forms,\nNine-headed beings sharing one body,\nDivine tigers releasing venom,\nDecapitating with thunderous might,\nTrue tones of the divine lords,\nUttering curses of execution,\nNo kinship with the Great Tenuity,\nYet by command they seize and record.\nMountains and rivers ring with bells,\nIntertwining radiance flows and flashes.\nNine heavens’ winds and fires,\nWield the divine blades of subjugation.\nTen trials of the inauspicious,\nSubduing and extinguishing the myriad spirits.\nShould any demonic toxin dare rise,\nIt shall be sealed within the Three Passes.\nI invoke the cavernous laws—\nLet none disobey these words.\n\nUpon completion, strike the teeth thirty-six times again, open the incense burner, and strike the teeth once more.\n\nWhen the incense burner is opened, kneel facing north (or sit slightly), strike the teeth thirty-six times, and summon the officials:\n\nWith reverence, I summon from within the body of your servant [Name]—from the four limbs, five constituents, Jade Gate, Purple Chamber, and thirty-nine portals of the Upper Perfected—\nthe numinous officials of the left and right flying immortals,\nthe Jade Clarity Attendants,\nthe Five Emperors and Five-Colored Primordial August Perfected,\nthe Flying Dragon Merit Clerks,\nthe Divine Immortal Envoys—\nthirty-six of each.\n\nThe Jade Clarity Attendants wield the feathered tablets of the flying immortals, their nine-colored banners illuminating the heavens;\nThe Five Emperors and Five-Colored Primordial August Perfected hold the life-controlling demonic banners of the Five Emperors;\nThe Flying Dragon Merit Clerks, adorned in feathered robes and golden true phoenix insignia;\nThe Divine Immortal Envoys, intertwining the Seven Origins, bearing jade tablets, standing before your servant—\nthey receive the secret words from your servant’s mouth, ascend the golden root, purple canopy, cinnabar shafts, and jade carriage of flying clouds’ wheels, accompanied by twelve Golden Immortals and Jade Lads, twelve Great Flower Jade Maidens, twenty-four myriad hosts of left and right dragon-tiger soaring feathered riders, flying through the Purple Void, ascending to the Golden Tower Jade Palace, the jasper chambers and cinnabar halls within the nine heavens above.\n\nThey ascend to report to the Supreme, Boundless, and Utmost Cavern-True Nine Mysteries Primordial Father;\nthe Great Void Mysterious Mother;\nthe Primordial Heavenly Thearch;\nthe Most High Jade Clarity Myriad Dao Venerable;\nthe King of the Immeasurable Heaven of Yu Shan;\nthe King of the Utmost Good Immeasurable Longevity Heaven;\nthe King of Xu Yan Heaven;\nthe King of Silent Heaven;\nthe King of Unarrogant Joy Heaven;\nthe King of Responsive Transformation Heaven;\nthe King of Brahma Treasure Heaven;\nthe King of Brahma Kama Heaven;\nthe King of Pari-Dhava Heaven;\nthe seventy-four Heavenly Thearchs;\nthe thirty-six Heavenly Kings;\nthe thirty-six Earthly Sovereigns;\nthe Venerable of the Myriad Origins;\nthe Jade Lads of the Three Heavens;\nthe Nine Heavens’ Chancellor, the Perfected King of Great Truth;\nthe thirty-nine Highest Emperors;\nthe twenty-four Jade Thearchs;\nthe Venerable of the Mysterious Antiquity;\nthe Venerable of the Myriad Origins;\nthe Most High Jade Dawn, the Great Dao Lord of the Supreme;\nthe Golden Tower Thearch of the Later Saints;\nthe Divine King of Fusang’s Yang Valley;\nthe Four Controllers and Five Emperors;\nthe Southern Culmen’s Upper Prime Lord of Prohibitions;\nthe Western Terrace’s Tortoise Mother;\nthe Jade Guardian King of the Supreme Clarity;\nthe Highest Minister of Destiny, the Great Controller of the Dawn;\nthe Azure Lad of the Jade Gate of the Eastern Sea;\nthe Great Dao of the Supreme Three Heavens of the Great Void of Tai Qing;\nthe Most High Lord Lao;\nthe Most High Venerable;\nthe Heavenly Thearch Lord;\nthe Lord of the Nine Heavens’ Immortal Capital;\nthe Venerable of the Nine Qi—\nthe hundred thousand myriad layers of Dao qi,\nthe twelve hundred official lords,\nthe Four Perfected of the Supreme Polarity beneath the Jade Steps of Tai Qing,\nthe countless Highest August Perfected of the Dao,\nthe Heavenly Worthy of the Boundless—\nthe qi of the natural Mysterious Capital’s Primordial August.\n\nThe Lesser Manifestation Perfected of the Three Radiant Caverns of the Great Cavern,\nMaster of the Sacred Peak [Name], Lady Primordial of the [Name] Household,\nand their servant-retinue—\nborn of defiled wombs in this kalpa of numinous fortune,\nbound by karmic blessings to the wheel of dharma-gates,\nwe have attained human birth.\nBy the grace of the Highest Void’s lingering radiance, bent to illumine our benighted minds,\nwe, with our foul and mortal frames, dare to lift our gaze and pore over the sacred texts.\n\nThe Dharma-Master, Daoist adepts, male and female Perfected—[Names]—\non the [day, month, year, hour] at [location],\nconferred upon your servants [Names]\nthe Dragon-Script Phoenix-Chapters of the Nine Heavens of the Highest Mystery,\nthe Jade Tablets of the Three Clarities’ Treasure Texts—\nin [number] scrolls, [number] talismans, [number] oral transmissions.\nSome were received by our ancestors from their masters of the Supreme Clarity’s Treasure Scriptures,\npassed down through generations.\nOthers, encountered by karmic affinity,\nwere obtained on the [day, month, year, hour] at [location].\nWe have venerated, studied, and perused them repeatedly,\nconsulting our revered masters to resolve doubts and obstructions.\nYet in some years, seeking a master, we could not meet one—\nuntil the [day, month, year, hour] at [location], within the Mysterious Covenant,\nwe pledged to uphold and cultivate, fulfilling our heart’s vows.\n\nYet born and raised in the Five Turbidities,\nwe presumptuously aspire to the Three Clarities.\nOur bodies tainted by defilements, days and months pass in vain;\nwe have not soared on radiant wings, nor floated through the Nine Mysteries,\nbut sink into the lower worlds.\nOur deeds often transgress, precepts falter,\nour conduct incurs faults—\nthe Four Offices seize us, binding us to the gates of karmic retribution.\n\nDaring to rely on the sacred canon,\nwe receive the covenant of the Fast Texts and the Three Primordials’ Essential Oral Transmissions of the Three Grades of the Supreme Perfected,\nwhich above correspond to the Nine Mysteries, conjoining the elixir to guard life;\nin the middle, to the Six Harmonies, dissolving our own transgressions of precepts and karmic obstructions;\nbelow, to the Three Powers, delivering the Seven Ancestors,\nreleasing the debts of the Nine Yin,\nraising the dead to celestial rebirth.\n\nThis is the supreme and wondrous Dharma,\nthe root of seeking immortality.\nWe, your servants, [Names], greedy for the Dao and delighting in the Real,\nvow to cultivate and practice.\n\nSome recite scriptures and precepts,\nor refine the elixir with precision.\nFor those not yet accomplished, we declare:\nwe intend to prepare medicinal substances,\nthe essential formulas of divine immortality,\nto compound the divine elixir,\nor to refine pills, powders, and alchemical wines.\n\nYet we fear that from the beginningless kalpas,\nour karmic roots have been shallow,\nour present merits still meager,\nand the compounding may fail.\nWe dread that past and recent actions—\nbreaches of precepts, violations of scriptures—\ncause obstructions in the unseen and manifest realms,\nentangling us day by day,\nunresolved,\nour good intentions unfulfilled.\nWe tremble lest our myriad ancestors,\nour seven generations of parents,\nladen with heavy transgressions in life,\nsink into the Three Wretched Paths,\nwander through the Five Sufferings,\nunable to ascend,\ntheir residual calamities flowing down to later generations,\nmaking it difficult to invoke the Perfected,\nwhile demonic trials assail us easily.\nMoreover, reviewing past and present,\nour universal fasts and comprehensive repentances\nhave been tainted by insincerity,\nunworthy of compassionate pardon.\n\nNow, in accordance with the wondrous principles of the Eight Daoist Paths,\nwe sincerely repent our deep transgressions past and present,\nweighing our thoughts and measuring our deeds.\nRegarding the matter of [specific matter],\nwe humbly present [specific offering or act] as proof of our utmost sincerity.\nFollowing the prescribed liturgy, we dare not profane the ears of the august ones—\nour words echo those of former petitions.\nWith hearts sincere and supplications earnest,\nwe beseech your compassion:\nthis very day, enter the chamber,\nascend the fast, recite scriptures,\npractice the Dao, visualize the master,\ncontemplate the Perfected, meditate on the Real,\nburn incense, light lamps,\nworship the Jade Heaven,\ncultivate arts and compound medicines, and so forth.\n\nWe repent our sins, atone for transgressions,\nredeem deep karmic debts,\nestablish merit,\ndeliver the Nine Mysteries and Seven Ancestors,\nour inner and outer departed kin,\ndissolve karmic roots,\nfree them from the dark night,\nascend to the Southern Palace,\nwhere wandering souls receive deliverance,\ntransforming their bodies to be born in heaven.\nOr, abiding in the Dao’s gate, they may roam in blessed joy,\nforming bonds with the Perfected,\nflowing blessings and spreading grace to later generations,\nso that your servants’ evil sins may be absolved,\nand [Name]’s good deeds renewed and flourishing.\n\nWe implore the Highest and Boundless Heavenly Worthy\nto deign to cast your radiance,\nto witness the supplications of your servants [Names].\nWe entreat the Three Treasures,\nthe Immortal Attendant Gentlemen,\nthe Five Directions’ Five Thearchs,\nthe Inspectors of Numinous Powers,\nthe Supervisors of Fasts,\nthe Envoys of the Fast,\nthe Supreme Perfected of the True Fast,\nthe Divine Immortals, Flying Immortals, Celestial Immortals, Terrestrial Immortals,\nthe Sacred Peak Immortals of the Five Marchmounts,\nand the nine hundred million myriad hosts of cavalry and chariots—\nto descend as one,\nto encamp and protect your servants’ bodies,\nto extinguish demons and dispel trials,\nto avert misfortune and repel calamities,\nto summon the natural true qi of the Nine Heavens,\nthe golden liquid, elixir essence, and divine mushrooms,\nto gather in the fast hall and altar,\nilluminating your servants’ bodies,\nwith Jade Lads and Jade Maidens attending the incense smoke.\n\nMay your servants,\nin practicing the Dao, attain the Dao;\nin seeking immortality, attain immortality;\nsoar through the Great Void,\nascend on radiant wings to the Nine Heavens.\nMay their heartfelt vows and aspirations\nbecome as real as the Three Treasures,\nmay the Seven Mysteries’ parents be delivered from the Three Wretched Paths,\nthe debts of the Nine Yin released,\nthe dead reborn in heaven,\nall the heavens’ beings universally delivered.\nMay [Name]’s disasters dissolve in the Three Absences,\nsins vanish in the Nine Yin,\na thousand transgressions and myriad faults\nall receive compassionate pardon.\nMay [Name]’s sins be dispersed,\n[Name]’s affairs flourish,\nescaping the Ten Sufferings and Eight Difficulties,\nattaining divine immortality,\nreceiving the grace of the Supreme Perfected’s Eight Daoist Paths,\nthe Eight Venerables’ boundless and immeasurable salvation.\n\nUpon completing the cultivation,\nwe shall report back to our original abodes,\nhumbly awaiting your transmission.\nThe rites concluded, we return,\nfacing east,\nthrice offering incense,\nand recite the incantation:\n\nThe Lesser Manifestation Perfected of the Three Radiant Caverns of the Great Cavern of the Supreme Mystery Capital,\nMaster of the Sacred Peak [Name],\nLady Primordial of the [Name] Household,\nyour servants [Names]—\ntoday, in the fast and practice of the Dao,\ncontemplating the Perfected, meditating on the Real,\nreciting scriptures and invoking vows,\nwe soar to the Nine Heavens,\nsincerely repenting to the Three Primordials.\nBurning incense and lighting lamps,\nwe dedicate this merit\nto absolve your servants’ transgressions and dissolve entanglements,\nsever the roots of death,\nsummon the true and real,\ninscribe our names in the Supreme Clarity,\ndeliver the Nine Mysteries and Seven Ancestors,\nour parents and departed kin,\ncutting off the flow of calamities,\nreleasing the bound in darkness,\nforever escaping hell,\nascending to the celestial halls,\nfreed from the Five Sufferings,\nreceiving blessings in the Southern Palace,\ntransforming to become Perfected,\nbenefiting and protecting the living.\nWe eradicate your servants’ thousand karmic roots and myriad past obstructions,\nwashing away [Name]’s sins,\nfulfilling [Name]’s affairs.\n\nNow we offer our bodies, spirits, and lives to the Supreme Nine Mysteries, the Primordial Jade Sovereign, the Jade Emperor, the Great Perfected of the Pure Land of Yu Shan, the Heavenly King of the Immeasurable Realm, the Heavenly King of Infinite Longevity in the Uppermost Meditation and Goodness, the Heavenly King of Xu Yan, the Thirty-Nine Emperors, the Twenty-Four Perfected, the Nine Heavenly Chancellors, the Supreme Jade Dawn Lord of the Great Dao, the Myriad Immortals and Holy Worthies, and the Boundless Heavenly Venerables. May this merit flow into the bodies of your servants, absolving transgressions and dissolving entanglements, severing the roots of death, summoning the true and real, inscribing our names in the Supreme Clarity, delivering the Seven Ancestors and all departed kin, cutting off the flow of calamities, releasing the bound in darkness, forever escaping hell, ascending to the celestial halls, freed from the Five Sufferings, receiving blessings in the Southern Palace, transforming to become Perfected, benefiting and protecting the living. We eradicate your servants’ thousand karmic roots and myriad past obstructions, washing away [Name]’s sins, fulfilling [Name]’s affairs.\n\nMay our bodily spirits be refined and transformed, traversing the empty void, soaring to the Jade Clarity and Golden Towers. Now we burn incense, taking refuge in the Supreme and Utmost Heavenly Perfected, that after attaining the Dao, we may ascend into formlessness, wheeling together with the Three Treasures.\n\n**Second Offering of Incense:**\nYour servants, in this fast and Dao-practice, meditating on the divine and invoking the real, reciting scriptures and invoking vows, soaring to the Nine Heavens, sincerely repenting to the Three Primordials, burning incense and lighting lamps, dedicate this merit to all hidden learners in the ten directions, the boundless, infinite, immeasurable, and endless four borderlands and sacred mountains—those who have attained the Dao and those who have not, the Dharma Masters, our parents and revered kin, fellow disciples, and worthy Daoists—may all universally attain deliverance, together escape the gates of sin, each realize their Dao, and ascend to the Supreme Clarity. May the seven generations of our parents be freed from sorrow and suffering, ascend to the celestial halls, and may we eradicate the thousand karmic roots and myriad past obstructions of your servants as above.\n\nWe offer our bodies, spirits, and lives to the Great Perfected of the Three Primordials and Nine Mysteries, the Myriad Immortals and Jade Sovereign, the Boundless Primordial Supreme Jade Emperor, the Utmost Heavenly King of Stillness, the Heavenly King of Unarrogant Joy, the Heavenly King of Responsive Transformation, the Thirty-Nine Emperors, the Twenty-Four Perfected, the Nine Heavenly Chancellors, the Supreme Jade Dawn Lord of the Great Dao, the Myriad Immortals and Holy Worthies, and the Boundless Heavenly Venerables. May this merit flow to all hidden learners in the ten directions, the boundless, infinite, immeasurable, and endless four borderlands and sacred mountains—those who have attained the Dao and those who have not, the Dharma Masters, our parents and revered kin, fellow disciples, and worthy Daoists—may all universally attain deliverance, together escape the gates of sin, each realize their Dao, and ascend to the Supreme Clarity. May the seven generations of our parents be freed from sorrow and suffering, ascend to the celestial halls, and be clothed and fed by nature. We eradicate the thousand karmic roots and myriad past obstructions of your servants as above.\n\nNow we burn incense, taking refuge in the Void and Supreme Perfected of the Three Primordials, the Utmost and Supreme, the Boundless and Utmost Heavenly Venerables, that we may attain the Dao, ascend as immortals, roam the Golden Towers, enter formlessness, and wheel together with the Three Treasures.\n\n**Third Offering of Incense:**\nYour servants, in this fast and Dao-practice, meditating on the divine and invoking the real, reciting scriptures and invoking vows, soaring to the Nine Heavens, sincerely repenting to the Three Primordials, burning incense and lighting lamps, dedicate this merit to our household and clan, the nine relations and in-laws, the emperors and kings of all under heaven, their ministers and officials, the people of their domains, and all living beings—creeping, crawling, slithering, and breathing—whether already born or yet to be born, may all be granted life and fulfillment. May the thousand sins and myriad transgressions of our household be universally pardoned, extending compassion to all beings in the heavens.\n\nWe offer our bodies, spirits, and lives to the Supreme Perfected of the Nine Heavens, the Jade Emperor of the Boundless Primordial Jade Void, the Utmost and Supreme Jade Sovereign of the Nine Mysteries, the Heavenly King of Brahma Treasure, the Heavenly King of Brahma Kāma, the Heavenly King of Pāriyātra, the Thirty-Nine Emperors, the Twenty-Four Perfected, the Nine Heavenly Chancellors, the Supreme Jade Dawn Lord of the Great Dao, the Myriad Immortals and Holy Worthies, and the Boundless Heavenly Venerables. May this merit flow to our household and nine relations, the emperors and kings, their ministers and officials, the people of their domains, and all living beings—creeping, crawling, slithering, and breathing—whether already born or yet to be born, may all be granted life and fulfillment. May the thousand sins and myriad transgressions of our household be universally pardoned, extending compassion to all beings in the heavens, that all may receive the grace of deliverance and salvation, escape the Ten Sufferings and Eight Difficulties, the Five Calamities and Six Harms, the Nine Tribulations and Seven Injuries, each preserving their blessings and emoluments, dwelling forever in the natural state.\n\nNow we burn incense, taking refuge in the Supreme and Boundless Heavenly Venerables, that we may attain the Dao, ascend as immortals, soar through the Nine Heavens, enter formlessness, and wheel together with the Three Treasures.\n\nAfter the three offerings of incense, facing east, we chant the obeisance as follows:\nYour servants wholeheartedly offer our lives to the Boundless and Primordial Supreme Jade Perfected Great Emperor and Heavenly Venerable of the East.\n*Three bows.* After bowing, the Dharma Master kneels to read the repentance, while the others prostrate to listen. When finished, all rise together, maintaining composure and focus, without haste or disorder.\n\n**Repentance:**\nYour servants, having established this fast and upright practice, cultivating the Dao and honoring the masters, meditating on the divine and invoking the real, reciting scriptures to seek immortality, soaring to the Nine Heavens, burning incense and lighting lamps to absolve past transgressions, repenting to the Three Primordials, offer our lives to the Boundless Primordial Supreme Jade Emperor and Great Perfected Heavenly Venerable of the East, beseeching your gracious illumination to pardon the sins of your servants—whether from past lives or this life, past bodies or this body—of [Name]’s transgressions, and so on.\nMay they be suddenly washed away, casting off the old and renewing, sins forever extinguished, blessings eternally preserved. Grant that [Name]’s tribulations be overcome, [Name]’s affairs fulfilled, the Dao attained through study, immortality achieved through seeking, soaring through the great void, ascending the Nine Heavens. May the seven generations of our parents escape the Three Wretched Realms, ascend to the Southern Palace, their blessings flowing boundlessly, receiving the grace of deliverance from the Heavenly Venerables.\n\nUpon completion, all bow three times in unison, ceasing after three touches of the cheeks. All movements should be gentle and unhurried, without sound.\n\nNext, proceed to the southeast, then due south, southwest, due west, northwest, due north, northeast, the northwest of the upper realm, and the southeast of the lower realm. For the repentance in the ten directions, follow the same ritual as in the east: all bow three times, though one may suffice, or three prostrations may be made in the heart. The touching of the cheeks must not be omitted, nor may it be excessive or insufficient.\n\nNext, intone the invocation for repentance in the five directions.\n\nThen, facing west, chant: *\"Your servants [Name] and company, with utmost sincerity, take refuge in the Supreme Heavenly Venerable of the West, bowing twice.\"*\n\nThe Dharma Master sits briefly to recite the vow, while the others prostrate themselves.\n\n*\"Your servants [Name] and company, having established this fast and set forth this offering, burn incense and light lamps to dissolve and release the thousand transgressions and ten thousand faults of past sins—specifically, the errors of [Name], and so on. May the Supreme Primordial Void-Emptiness Great Origin Ninefold Mystic Essence Jade Perfected Lord of the West, the Lofty Sage and Supreme Immortal Jade Terrace Consort, and the Jade Void Supreme Numinous Boundless Heavenly Venerable deign to bestow grace and favor, specially granting compassion and pardon. May the faults of [Name], and so on, be restrained and removed; may the affairs of [Name], and so on, be granted fulfillment. May the Dao be attained through study, immortality achieved through seeking, soaring through the great void, ascending the Nine Heavens. May the seven generations of ancestors be delivered, ascending to the Southern Palace, dwelling eternally in non-action, clothed and fed by nature, receiving the grace of deliverance from the Supreme Sages.\"*\n\nEach touches the cheeks three times.\n\nNext, facing north, follow the same ritual as in the west.\n\nWe, your servants [Names], now establish the fast and perform the vigil, burning incense and lighting lamps to absolve and deliver from past transgressions—innumerable faults and myriad offenses, specifically those of [Name], and so on. May the Lofty and Supreme, the Primordial Perfected Lord of the North’s Great Void and Purple Mystery, the Three Heavens’ Jade Lads, the Highest Jade Dawn Lord of the Great Dao, the Supreme Perfected Lord, the Supreme Perfected King, the Northern Marquis of Central Perfection, and the Highest Mysterious Myriad Immortals and Supreme Sages, the Heavenly Venerables, deign to bestow grace and favor, specially granting compassion and pardon. May the faults of [Name] be restrained and removed; may the affairs of [Name] be granted fulfillment. May the Dao be attained through study, immortality achieved through seeking, soaring through the great void, ascending the Nine Heavens. May the seven generations of ancestors be delivered, ascending to the Southern Palace, dwelling eternally in non-action, clothed and fed by nature, receiving the grace of deliverance from the Supreme Sages.\n\nNext, facing east, follow the same ritual as before.\n\nWe, your servants [Names], now establish the fast and perform the vigil, burning incense and lighting lamps to absolve and deliver from past transgressions—innumerable faults and myriad offenses, specifically those of [Name], and so on. May the Supreme and Lofty, the Nine Mysteries Jade Void Emperor of the East, the Grand Clarity’s Primordial Lord of the Three Heavens’ Boundless Dao, the Most High Lord Lao, the Perfected Lords, the Yang Valley Divine King and Fusang Supreme Emperor, the Heavenly Emperor, the Supreme Micro Emperor, the Central Yellow Elder Lord, the Nine Elders of the Immortal Capital, the Nine Qi Perfected Lord, the Jade Sovereign of Grand Clarity’s Lower Palace, the Supreme Perfected Jade Protector King, the Prime Minister and Jade Gate Azure Radiance Lad of the Eastern Sea, and the Highest Immortals and Myriad Sages, the Utmost Heavenly Venerables, deign to bestow grace and favor, specially granting compassion and pardon. May the faults of [Name] be restrained and removed; may the affairs of [Name] be granted fulfillment. May the Dao be attained through study, immortality achieved through seeking, soaring through the great void, ascending the Nine Heavens. May the seven generations of ancestors be delivered, ascending to the Southern Palace, dwelling eternally in non-action, clothed and fed by nature, receiving the grace of deliverance from the Supreme Sages.\n\nNext, facing south, follow the same ritual as before.\n\nWe, your servants [Names], now establish the fast and perform the vigil, burning incense and lighting lamps to absolve and deliver from past transgressions—innumerable faults and myriad offenses, specifically those of [Name], and so on. May the Supreme and Lofty, the Primordial Lord of the South’s Great Void and Nine Mysteries Cavern Spirit, the Southern Culmen’s Supreme Origin Lord, the Southern Prosperity Controller of Destiny and Lord of Longevity, and the Cavern Yang High Sage and Supreme Immortal Heavenly Venerable, deign to bestow grace and favor, specially granting compassion and pardon. May the faults of [Name] be restrained and removed; may the affairs of [Name] be granted fulfillment. May the Dao be attained through study, immortality achieved through seeking, soaring through the great void, ascending the Nine Heavens. May the seven generations of ancestors be delivered, ascending to the Southern Palace, dwelling eternally in non-action, clothed and fed by nature, receiving the grace of deliverance from the Supreme Sages.\n\nNext, facing the Central Palace of the Great Year, follow the same ritual as before.\n\nWe, your servants [Names], now establish the fast and perform the vigil, burning incense and lighting lamps to absolve and deliver from past transgressions—innumerable faults and myriad offenses, specifically those of [Name], and so on. May the Supreme and Boundless, the Primordial Master of the Central Void’s Inexhaustible Mystery, the Ten Thousand Dao’s Father and Mother, the Purple Mystery and Azure Essence Lord, the Later Sage and Nine Mysteries Golden Gate Emperor, the Four Perfected of the Central Mystery’s Great Flower Jade Numinosity, and the High Sage and Central August Supreme Immortal Heavenly Venerable, deign to bestow grace and favor, specially granting compassion and pardon. May the faults of [Name] be restrained and removed; may the affairs of [Name] be granted fulfillment. May the Dao be attained through study, immortality achieved through seeking, soaring through the great void, ascending the Nine Heavens. May the seven generations of ancestors be delivered, ascending to the Southern Palace, dwelling eternally in non-action, clothed and fed by nature, receiving the grace of deliverance from the Supreme Sages.\n\nThe rites to the Five Directions now complete, return to face east. Meditate upon the deities with eyes closed, knock the teeth five times, swallow saliva five times, and visualize the Five Spirits fully present within the body, the Five Talismans radiant within and without. Let the demonic hordes of the Five Directions flee far away, while those who come to serve stand in solemn array behind the Perfected Officials. After a long while, swallow saliva three times, knock the teeth three times, and recite the *Scripture of Reniao Mountain’s Incantation*:\n\n*\"Within the Yellow Center, qi is marshaled to sever demonic lineages,\nInspecting and restraining fierce spirits, cutting off the old fiend’s root.\nThe Most High issues commands from the Most High’s chamber—\nHasten the Northern Emperor to the Jade Palace!\nReverently bearing the mighty decree, proclaim it to the Demon Kings.\nThe Nine Qi billow and surge, clashing with fate’s decree.\nThe secret jade texts now flourish in completion:\nThe Three Heavens turn in brightness,\nThe Six Heavens’ course is fulfilled.\nHow worthy are the virtuous!\"*\n\nThe visualization and incantation complete, invoke the Ten Directions’ Return to Mystery as follows:\n\n**Northern Supreme Hymn:**\nThe Supreme unfolds its mysterious store,\nResplendent, it spreads the true methods.\nScattered and boundless, the Heavenly Treasures,\nRevered by all in the Ten Directions.\nWithout beginning, without end,\nUnobscured, thus without darkness.\nAscending the Jade Capital’s terrace,\nWandering carefree upon Kunlun.\nTranscending the Yellow Springs’ dark realm,\nEven demon kings long to hear.\nSeven ancestors receive transformation,\nReleasing me from past-life grievances.\nEntering, I rein in the soaring mystery;\nExiting, I ride the floating purple clouds.\n\n**Northeastern Supreme Hymn:**\nDouble radiance illumines the Jade Dawn,\nRiding the light to open perfect clarity.\nTowering, the Cavern Perfection’s hall,\nGleaming, the seven treasures’ essence.\nA single thought delivers from eight perils,\nForever paired with the Supreme.\nSpiraling, I offer the yellow effulgence,\nSunlight born within the void.\nWorldly folk do not contemplate the Dao,\nNor hear the *Sutra of Wisdom*.\nVast is the Cavern Perfection’s precept—\nThe mystery’s response moves demon kings to sincerity.\nTen thousand kalpas as a single breath,\nHow could they rival a thousand billion eons?\n\n**Eastern Supreme Hymn:**\nThe Supreme embodies the Great Nothing,\nDispersing form to ferry the weak and lost.\nDiligently expounding the mysterious arts,\nHeavenly Perfected join in praise.\nThose with affinity manifest through scripture,\nThose without are concealed in the canon.\nShould one attain this Dao,\nA halo of light first crowns the head.\nThe body crosses without awaiting a ford,\nDrifting lightly to the Immortals’ hall.\n\n**Southeastern Supreme Hymn:**\nThe boundless Nothing eternally abides,\nThe conditioned \"have\" securely enters the wondrous.\nHeaven’s brush inscribes the supreme,\nThe mystery’s lineage holds its essentials.\nRevolving, the Three Treasures are conveyed,\nThe Ten Directions universally resound.\nThe Supreme gazes upon the Jade Capital,\nDemon kings howl in the empty sky.\nThe Heavenly Emperor clasps hands and chants,\nPerfected Ones ride the void in laughter.\nScattering blossoms, my thoughts align—\nThe Eight Vows naturally transcend.\n\n**Southern Supreme Hymn:**\nDivine immortals ride the auspicious clouds,\nMounting dragons to tread the dark waves.\nHarmonizing with the true, they display felicitous signs,\nWashing their feet in the Eight Rivers.\n\nFortune’s response comes not as I await,\nThus able to unbind the celestial nets.\nVirtue and power crown the Three Realms,\nThe earth’s web too has been transcended.\nInspired encounter with the numinous assembly,\nCold wisdom illumines the lotus scripture.\n\n**Southwestern Supreme Hymn:**\nThe peerless awakens the four assemblies,\nVast beyond the great expanse.\nDark and bright surely have their cause—\nNo obscurity, thus no concealment.\nThe net of destiny turns the mysterious wheel,\nPerfected immortals gather in the blossom assembly.\nWandering at times through the distant wilds,\nHeavenly and human, no boundary is seen.\n\n**Western Supreme Hymn:**\nThe numinous and wondrous lodge in proclaimed traces,\nHeavenly and human find ford and shore.\nAdrift on the fathomless abyss,\nEver fearful of winds and waves dispersing.\nIts conditions rooted in prior power,\nWho can reckon wisdom and knowledge?\nGently yielding to the mysterious pivot,\nLuminously the hidden causes are discerned.\nA stalwart shoot, a disciple of the Perfected,\nPlucks the spirit zither in the empty sky.\nCold contemplation reveres the Ten Directions,\nNeither departure nor stay do I envy.\n\n**Northwestern Supreme Hymn:**\nThe Supreme unfolds the profound scriptures,\nThe worthy and wise return to the great affinity.\nDesolate the Three Treasures’ preserve,\nLush the flowering of my karmic causes.\nElders and scribes enter refinement,\nTheir essence purified, golden bodies arise.\nFrom kalpa’s end to kalpa’s beginning,\nEver more radiant their numinous countenances.\nRare deliverance bows to the peerless,\nDevout scriptures descend to the perfected.\nThe Dao’s grove flourishes in the Heavenly Capital,\nBelow, its light illumines all earthly immortals.\nFreely they disperse their numinous might,\nVastly the great Dharma is proclaimed.\n\n**Upper Supreme Hymn:**\nThe Supreme gazes upon the Ten Directions,\nDim and misty, harmonizing with the wind’s stillness.\nThe halo’s light illumines the Three Luminaries,\nPerfected Ones don the celestial robes.\nDemon kings stand with clasped hands,\nOfficials receive them beside the Feng capital.\nSun and moon veil their coursing brilliance,\nThe Seven Treasures gleam boundlessly.\nAll endeavors flourish at this hour,\nFortune extinguishes, hells fall silent.\nHow distant, the immeasurable Honored One—\nHeavenly and human cannot fathom.\n\n**Lower Supreme Hymn:**\nThe Three Treasures flourish throughout the Ten Directions,\nSteadily the void clears in the empty sky.\nTurning and revolving with the transformative principle,\nA single inspiration, the Dharma’s conveyance ascends.\nDo not obscure the dim and murky chambers,\nThe Four Great Elements arise with the times.\nEmptiness and being—nothing is not possessed,\nTowering, the many mountains and hills.\nThe Supreme harbors no lingering thoughts,\nExtinguishing thoughts, returns to the Great Vehicle.\nAt the six hours, savor the *Plain Numinous Melody* and the *Luminous Writ of the Grand Empyrean*.\nThe text is too vast to record; consult the scrolls when the time comes.\n\nThe Five Emperors’ verses of sorrow and joy,\nPatrolling thrice around, circling the southern quarter,\nFacing north they halt, reciting the *Three Poems of the Four Poles and Five Sufferings*, as follows:\n\n**The Great Cavern Sums Three Principles**\nThe primordial transformation has form and formlessness.\nStill as a rootless teaching,\nSolemn as if possessed of numinous might.\nAlas! Within the Three Paths,\nSorrow and suffering arise therefrom.\nTo the utmost study, heed these precepts,\nAccumulate goodness through kalpas’ ages.\nWhen kalpas end, reborn in heaven,\nBody conjoined with sun and moon.\nFoolish and deluded, following worldly fancies,\nPursuing superficial learning for glory.\nProclaiming transformation without discipline,\nCarelessly leaking the Heavenly Treasures’ scriptures.\nEyes measured, entering death’s gate,\nThe Four Poles knot your name.\nSoul and spirit tread the Nine Perils,\nThe Five Sufferings ever bind you.\nFeeding on fire, treading the Knife Mountain,\nHardships without momentary respite.\nLamenting this origin of fortune and misfortune,\nEver clear amidst the vast.\nThe exalted leave stern warnings,\nFortune and misfortune move one to sigh.\nThe immortal Dao arises from destiny,\nIn the unseen, already determined.\nWithout destiny, it does not unfold;\nOnce awakened, ever at peace.\nIf one can honor the mysterious precepts,\nNaturally soaring beyond the empyrean.\nIf ensnared by love and desire’s burdens,\nWhy forcefully strive and play?\nDwelling in transgression, the Four Luminaries are knotted,\nLife and death tread the path of suffering.\nDragged through the Five Sufferings’ courts,\nThe Three Paths’ knots remain unbroken.\nThe numinous sinks, seized in the Nine Darks,\nTen thousand kalpas without dawn’s waiting.\nGrieving for this teaching of the Primordial Beginning,\nHow can one not incite resentment?\n\n**Vast the Nine Mysteries Above**\nVeil upon veil, the first transformation’s inception.\nNo form, no image,\nNo depth, no measure.\nThe Two Modes initiate the unfolding,\nQi congeals to form sediment.\nThe Three Dawns brighten the Primordial Chamber,\nThe Five Nines possess their discipline.\nFortune and misfortune arise from human action,\nGood and evil—who indeed prevails?\nIf one can awaken to the mysterious enlightenment,\nTranscending, surmounting the lofty barriers.\nIf grasping the axe that hews destiny,\nAccumulating days, filling the heart.\nSinking transgressions knot the Four Luminaries,\nFormer punishments truly have their end.\nBorn bearing the wind’s blade,\nThe Five Sufferings know no release.\nThe Seven Mysteries fill the dark night,\nTen thousand kalpas mark a single era.\nLingering in the Three Paths,\nUnawakened to life and death.\n\nReciting the *Five Sufferings* complete, chant:\nYour servant [Name], with utmost sincerity, reverently submits to the *Supreme, Boundless, Peerless Dao; the Most Real Honored Scripture and Treasure Talisman; the Grand Dharma Master of the Mysterious, Lord Lao; and the Azure Lad*.\n\nNine bows, or three bows, or bows of the heart may be made.\nThe Dharma Master reads the great repentance,\nOthers prostrate themselves.\nAfter the Three Honored Ones and nine bows,\nEach knocks the head nine times and ceases, then returns to the incense burner.\n\nIf companions perform the thanksgiving for the deceased,\nThough the fifteen directions are complete,\nOne should still offer a general thanksgiving for the great repentance,\nScattering hair and concentrating the mind.\nThe text follows:\n\nThe Grand Mystery Capital’s Three Caverns Dharma Master, Master of [Mountain] Yue,\nLesser Manifestation Real Person, Disciple of the Three Luminaries,\nPractitioner of the *Great Cavern Scripture*’s affairs,\nYour servant [Name],\nRespectfully addresses the Supreme, Most Supreme, Boundless, Inexhaustible, Utmost Honored Cavern Real, Nine Mysteries Primordial Father;\nThe Primordial Void Mysterious Mother;\nThe Primordial Beginning Heavenly King;\nThe Lofty Jade Void, Myriad Dao Venerable;\nThe Highest Joyous Immeasurable Lifespan Heavenly King;\nThe Purifier Heavenly King;\nThe Serene Heavenly King;\nThe Unboastful Joy Heavenly King;\nThe Responsive Sound Heavenly King;\nThe Brahma Treasure Heavenly King;\nThe Brahma Kapila Heavenly King;\nThe Parinirmitavaśavartin Heavenly King;\nThe Nine Heavens’ Chancellor;\nThe Three Heavens’ Jade Lads;\nThe Thirty-Nine Lofty Emperors;\nThe Twenty-Four Perfected;\nThe Primordial Master;\nThe Myriad Beginnings Venerable;\nThe Lofty Sage, Jade Dawn, Supreme Great Dao Lord;\nThe Fusang Supreme Emperor, Sun Valley Divine King;\nThe Four Officers and Five Emperors;\nThe Western Terrace Tortoise Mother;\nThe Supreme Clarity, Jade Perfected, Royal Protector;\nThe High Minister, Grand Controller of Destinies, Lofty Dawn Master;\nThe Azure Lad of the Jade Gate of the Eastern Sea;\nThe Grand Clarity, Mysterious, Supreme Three Heavens’ Boundless Great Dao;\nThe Supreme Lord Lao;\nThe Supreme Venerable;\nThe Heavenly Emperor Lord;\nThe Nine Elders of the Immortal Capital;\nThe Nine Qi Venerable;\nAnd the hundred thousand myriad layers of Dao qi,\nThe twelve hundred officials,\nThe immeasurable hosts of Daoist August Real Persons of the Grand Clarity’s Jade Palace,\nThe Boundless Heavenly Worthies,\nThe qi lineage of the Natural Mysterious Capital’s Primordial August One,\nAnd all responsive and attuned deities within and beyond the Three Realms.\n\nWe, your humble servants, undeservedly blessed by karmic fortune and steeped in the mysterious truth, have reverently practiced the precious scriptures without daring to slacken. Yet our innate nature is dim and shallow, failing to grasp the profound and pure; in following the Way, we violate its precepts, and in every movement and pause, we incur transgressions. Our past sins being already grave, our present faults have only multiplied. We fear that even a moment’s lapse may prevent our modest vows from being heard. Now, by great mercy, we are granted benevolent pardon. We swear to cherish every instant, striving to establish a sincere resolve. In accordance with the ritual, we present our words, humbly reciting them for your hearing.\n\nThe text of the petition is as above.\n\nAs our plea is earnest and sincere, we humbly beseech your compassion. Bestow upon us the grace of threefold forgiveness, absolving the sins of your servants—past and present lives, former and current bodies—and those of our sevenfold ancestors, both maternal and paternal kin, sovereigns and ministers, teachers and friends, all karmic connections, the departed and the yet-to-die, and all beings now in the world. May those burdened by grave sins in the yin and yang realms, beset by calamities, hindered in study or office, or whose aspirations remain unfulfilled, now be cleansed in heart and devoted in life. With unbound hair and bowed heads, we implore the Three Venerables to shed tears of mercy, commanding the relevant authorities to issue decrees of rectification, removing the transgressions of us, your servants, and all our karmic ties across past lives—both hidden and manifest—where our actions and stillness have defied the Way:\n\nWhether through lack of filial piety or kindness, lack of benevolence or wisdom, lack of reverence or humility, lack of faith or loyalty, lack of solemnity or resolve, lack of yielding or integrity, lack of generosity or aid, lack of purity or fairness, lack of uprightness or harmony, lack of diligence or obedience;\n\nOr by taking lives with our own hands, plundering and raiding, scheming for illicit unions, or engaging in incestuous relations with the nine clans;\n\nOr by teaching others to kill, slaughter, or cruelly oppress beings, instigating plunder, schemes, or illicit unions within the nine clans, envying the worthy and resenting the capable, or rebelling against teachers and masters;\n\nOr by leaking scriptures after receiving them, treating sacred texts with disdain;\n\nOr by defiling the Dao by mingling with the profane, weeping before corpses, treading upon blood and filth without repentance or reform;\n\nOr by employing sacred methods while consorting with women, allowing yin and yang to intermingle chaotically, disobeying the Seven Classics;\n\nOr by presumptuously partaking in the Three Caverns without expelling the Three Corpses, harboring treacherous thoughts, committing violent acts, acting arrogantly, injuring kin, desecrating scriptures and precepts, or betraying the Three Venerables;\n\nOr by heedlessly moving about without regard for taboos, knowingly violating prohibitions, pursuing private desires contrary to the rules, indulging in gluttony and drunkenness, behaving abnormally, undermining the Dao and corrupting the Dharma, or confusing evil with truth;\n\nOr by failing to receive teachings from a master, stealing scriptures and transmitting them recklessly, exchanging them without fasting or vows, borrowing and misusing them, deceiving the common folk, altering sacred texts, feigning profound understanding, abandoning the ancient for the modern, or inventing one’s own methods;\n\nOr by practicing the Dao without devotion, lacking proper halls for scriptures, neglecting offerings, slackening in daily rites, associating with unrelated men and women, exchanging garments, or mingling with improper company;\n\nOr by occupying high positions as honored masters or sovereigns, yet belittling inferiors, killing the innocent, meting out unjust rewards and punishments, taking and giving arbitrarily, indulging ignorance and desires, or offending the Three Luminaries;\n\nOr by serving as ministers, officials, clerks, or servants, yet deceiving in comings and goings, stealing, acting recklessly, rebelling, or defying the Five Phases;\n\nOr by men and women who reverse right and wrong, harming public and private interests, abandoning the true for the perverse, slandering the true Dao, persisting in evil without repentance, or repeating offenses after repentance, accumulating unresolved grievances—\n\nWe beseech you to wash all these away, dissolving sins and spreading blessings, reconciling enmities, dispelling lawsuits, severing the roots of evil. May our departed kin likewise be freed from the dark springs, ascending together into radiant realms, and may our descendants be blessed and protected. May divine spirits guard and assist both the living and the dead, allowing the deceased to reincarnate and form bonds with the Dao, while the living renew their studies and virtues. May tombs rest in peace, dwellings remain serene, families and nations prosper, the Dao flourish daily, demons be subdued, sages descend to wander, heaven and earth harmonize, the Three Luminaries shine together, the Seven Luminaries align without error, the Nine August Ones govern in balance, the Four Seas calm their waves, the Five Peaks stand majestic, wind and rain come in due measure, crops yield abundance, all beings receive blessings, and the world attain great peace.\n\nWe especially pray that your mysterious compassion grant our requests, that our vows be fulfilled by your grace, and that our words today not be in vain. Above, may the great Dao’s boundless generosity be manifest; below, may it match the sincerity of your servants’ longing.\n\nThe Great Repentance concludes. Face east and strike the teeth thirty-six times.\n\nRecite the Five Vows, which may also be used with three days of fasting.\n\n**First Vow:** May the qi of my birth be natural, and from this qi may my body be formed, equal to the Three Luminaries, eternally rooted in the boundless.\n\n**Second Vow:** May my body ever dwell above the Great Void, within jade palaces and chambers, feasting with the Jade Emperor by day and wandering with the Mysterious Mother by night. When thirsty, may I drink from the vast well’s jade mushrooms; when hungry, may I consume dragon embryos, crimson tree fruits, and red children.\n\n**Third Vow:** May my body give birth to ten thousand marvels, seventy-two radiant lights, extraordinary fur and form, and garments of flying feathers. May I ride the void and mount the sky, entering and leaving the imperial palace, with all blessings converging, and my lifespan boundless.\n\n**Fourth Vow:** May I be born with qi and die with qi, reborn after death, becoming an emperor, ruling over the Ten Heavens, and governing all immortals.\n\n**Fifth Vow:** May all beings, born and unborn, together preserve the Three Luminaries. May those who follow the Dao and their sevenfold ancestors ascend to the Southern Palace, and may all blessings under heaven be fulfilled. May the vows of the four directions and five realms converge in the Jade Hall.\n\n**Next Vow:** May the Nine Ancestors nurture my body, and may my hun and po spirits, my true deities, forever dwell within my palace, communicating above with celestial immortals and below with the abyssal depths. May the Vow of Earth, the Vow of Wind, the Vow of Clouds, the Vow of Spirits, and the Five Vows unite, securing my name in the register of long life. May purple mists descend from heaven, and may the Five Spirits guard the earth. Riding clouds and mounting the void, may I ascend in a green chariot to the Golden Gate, advancing into the Jade Clarity. May blessings extend to my seven ancestors, who shall be reborn in the womb, and may the Five Vows unite in eternal harmony and prosperity.\n\nThe Middle Vows are also five: may the root of Dao-attainment be realized. The Vow of Yin, the Vow of Yang, the Vow of Great Void, the Vow of Supreme Non-Being, and the Vow of Supreme Mystery—may they ascend to feast in the Jade Chamber, forging karmic bonds with the Emperor. Roaming the Gate of Life’s Gaze, riding the waves of the Nine Heavens, may the Primordial Father inscribe my name in the register, and the Mysterious Mother record my years. May peach-vigor bind my essence, firmly guarding the Cinnabar Field. May my body ascend as adamantine, my name inscribed in the Jade Volume. May the seven ancestors attain liberation, and blessings and fortune arrive in full.\n\nThe Lower Vows are also five: the Vow of Great Emptiness, the Vow of Supreme Existence, the Vow of Supreme Oneness, the Vow of Supreme Perfection, and the Vow of Divine Immortals. May I traverse the peaks of the Five Marchmounts, drift among the Nine Firmaments, move in and out of the Gates of Opening, and transcend the threshold of death. May Heaven and Earth be my parents, the Three Luminaries guard my years, the myriad spirits watch over the nine apertures of the Yellow Springs, and numinous qi descend naturally. With these five vows aligned, may all resound and converge.\n\nWhen the vows are complete, knock the teeth twice seven times and recite the incantation:\n*\"Supreme Emperor of the Upper Origin, Scripture of the Emperor’s Unity and Mystery, five clouds scatter radiance, luxuriant through the Three Clarities. Jade lads and jade maidens burn incense and attend the numinous. The upper vows unfold and merge with me, enabling me to become a divine immortal and ascend to the Emperor’s court. The Northern Emperor severs death, the Southern Pass inscribes life. The Golden Register of Eastern Florescence records my name. May boundless vows unite with me in equality.\"*\n\nWhen finished, knock the teeth thrice seven times, look up, and swallow qi five times, then cease.\n\nAfter the incantation, pinch the incense three times, replenish the censer, and recite:\n*\"Three Origins and Three Heavens, Five Marchmounts and Five Emperors, divine immortal messengers, true perfected of the Three Qi, left and right Dragon and Tiger, celestial immortals and earthly immortals, flying immortals and divine immortals, officials of the Five Numinous Incense—summon now the upright qi of the ten directions, the natural golden liquid, elixir essence, and mushroom spirits. May the Nine Mysteries and Jade Perfected converge in the oratory’s exposed altar, pouring through the bodies of your servants so-and-so, enabling us to study the Dao and attain the Dao, seek immortality and attain immortality, soar through the Great Void, and ascend the radiance of the Nine Heavens. May jade lads and jade maidens attend the incense smoke, presenting the petitions of your servants so-and-so before the throne of the Highest, Boundless, Supreme, Great Dao, Jade Emperor.\"*\n\nWhen finished, knock the teeth nine times, swallow saliva nine times, and cease entirely.\n\nReplenish the censer, then circumambulate and exit while chanting as before.\n\nThe six preceding sections are to be recited one each during the six periods of the day. If reciting during three periods, alternate them in rotation, cycling through without end. Upon completion of the chant, exit while coughing—all procedures mirror those of the morning rites.\n\nAfter meals, when ascending to the scripture hall, likewise rinse the mouth, knock the teeth three times, and visualize the spirits as prescribed. Bow three times in reverence, then recite the secret incantation:\n\n*\"The Jade Emperor’s supreme law,\nAscends to the Three Clarities on high.\nOn this auspicious day of fasting,\nOpen my divine scriptures.\nThough myriad trials lie concealed,\nAll endeavors shall succeed.\nJade lads attend and guard,\nJade blossoms scatter fragrance,\nAscending to the Three Origins,\nGranting me eternal life.\"*\n\nThis incantation is also used when opening the scriptures.\n\nEnter the hall, face the Dao, and bow three times. If the assembly is large, circumambulate to the east. If fixed in position, all bow three times—or once, or bow in the heart. After bowing, sit upright, close the eyes, clench the fists, and knock the teeth. Visualize the head as pure azure jade, the hands as cinnabar, the feet as snow; the hun-spirit stationed on the left, the po-spirit guarding the right. After a long while, open the eyes, rub the palms together, and massage the face. Ascend to the high seat and, upon completing the visualization, begin reciting the scriptures and expounding their meaning.\n\nFirst, bow nine times toward the Dao seat—three bows in sets of three—then ascend the high seat. When opening the scriptures, first knock the teeth thirty-six times, swallow saliva thirty-six times, and visualize the Hundred Spirits and Ten Thousand Perfected converging in the swirling winds. Then recite the secret incantation:\n\n*\"Subtle, subtle is the Gate of the Mysterious Origin,\nRadiant and profound, it pierces the empty void.\nThe supreme Dao arises from stillness and silence;\nThere, the Three Pure Palaces shall be seen.\nThe Great Dao is perfected here,\nRiding clouds and dragons, soaring through the heavens.\nTo left and right attend those who uphold the scriptures,\nJade maidens and jade lads.\nTheir bodies brim with the elixir of immortality,\nUntangling the nets, riding the divine winds.\nSeven ancestors return to the womb and are reborn,\nBecoming for all generations the lineage of immortals.\"*\n\nRecite the *Thirty-Nine Chapters*, the *Feminine One*, the *Great Possession*, the *Nine Perfected*, and the *Great Elixir*. Face north and bow in the heart to the four directions, knock the teeth thirty-six times, swallow saliva thirty-six times, and visualize within the five viscera five-colored lights infusing the essences of the Five Stars. Then read the *Divine Continent*, followed by the *Inner Names of the Hundred Spirits*, and finally the *Thirty-Nine Chapters*. Mind and eyes must align, with no stray thoughts; ensure each passage is completed without interruption.\n\nWhen reading the thirty-first scroll, face north and bow in the heart to the four directions, knock the teeth twenty-four times, swallow saliva thirty-four times, and visualize the Three Essences of the Five Stars and the sun and moon infusing the adept’s body. For the remaining scrolls, follow separate instructions.\n\nWhen reading the *Scripture of Wisdom* and its verses and hymns, first close the eyes, knock the teeth three times, swallow saliva three times, and visualize the Three Primordial Sovereigns in the Golden Flower Palace, appearing as infants, before reciting the text.\n\nUpon completing the recitation and exposition, descend and stand upright. Bow three times to the Three Honored Ones, then prostrate fully. Knock the teeth three times and recite the secret prayer:\n\n*\"Ascend the Brahma-realm, tread upon prosperity,\nSevenfold Numinous Venerable,\nGreat One of Utmost Endeavor,\nFive Spirits of Yellow Tranquility.\nAscend to the Nine Heavens,\nStand peerless beside the Emperor.\nI beseech flight as an immortal,\nSeven ancestors reborn as infants,\nFreed from transgressions, released from nets,\nAscending to the Jade Clarity.\"*\n\nAfterward, knock the teeth seven times and swallow saliva three times to conclude.\n\nRise and exit the hall, visualizing the spirits. Morning and evening, practice this diligently; after seven years, ascend to the heavens.\n\nThe rituals for the three periods of day and night and the six periods are the same. For those entering the altar or oratory, minor variations exist in the incantations—where \"hall\" or \"chamber\" is mentioned, substitute \"altar\" or \"oratory.\"\n\nThe altar, oratory, hall, and chamber are all arranged in three concentric layers. For major rites, the Dharma Master enters the innermost, the next-ranking officiant stands in the middle, and the assembly faces the altar from the outer layer.\n\nThe lamps of the hall and altar—beyond the seven or nine—are lit as appropriate. Generally, follow the numbers: ninety for the Upper Origin, sixty for the Middle Origin, thirty-six for the Lower Origin, totaling one hundred eighty-six. Arrange them on the left and right of the hall and altar, as well as at the gates, the Year Star, the Monthly Establishment, the Day Stem and Branch, the Natal Star, and the Current Year.\n\nThe Year Star and Natal Star lamps burn day and night without ceasing; the rest are lit only at night. If it rains, light two lamps in the hall; the others may be placed at the gates.\n\nUpon completing the circumambulation, each bows again before their Natal Star lamp and the Year Star lamp, presenting their petitions and expressing their wishes as they please.\n\nAccording to the *Bright Regulations of the Four Poles*, at the Beginning of Spring and the Spring Equinox, arrange nine lamps in the courtyard; at the Beginning of Summer and the Summer Solstice, eight; at the Beginning of Autumn and the Autumn Equinox, six; at the Beginning of Winter and the Winter Solstice, five. For the Natal Star, twelve lamps; during the Eight Festivals, face the Sovereign; for the Natal Star, face the Year Star. Knock the teeth twenty-four times and recite:\n\n*\"Supreme and Lofty Perfected,\nTen Thousand Sages and Five Emperors,\nJade Controller of the Emperor,\nGovernor of All Immortals and Perfected,\nOn this auspicious morning of the Eight Festivals,\nThe offerings are arrayed.\nSins of yang and judgments of yin,\nSevered and extinguished in the Nine Yin.\nFrom this day forth, forevermore,\nUplift the Seven Mysteries,\nDeliver from the fiery realm,\nEternally escape the Mountain of Knives.\nThe Three Paths and Five Sufferings,\nShall no longer burden my body.\nAttain harmony with heaven and earth,\nPreserve the dawn of the Emperor.\nFive Wishes and Eight Assemblies,\nAll shall be as proclaimed.\"*\n\nAfterward, remove the headscarf and bow one hundred twenty times, touching the forehead to the ground without causing pain. Upon finishing, replace the headscarf and gaze upward, reciting in the heart: *\"Today, my body receives the grace of heaven, granted rebirth in a transformed body, ascending as a flying immortal.\"* Then swallow twenty-four breaths of qi to conclude. After three years, transgressions are erased, and the body becomes one with the Perfected.\n\nFor an altar spanning nine *zhang*, arrange one hundred eighty-six lamps on each of the four sides, totaling six hundred forty-four. Beyond these, one thousand eight hundred sixty lamps are placed along gates, courtyards, and pathways, remaining lit until dawn—unless wind or rain intervenes. When the allotted time expires, conclude and report the merits accomplished.\n\nOn the morning after the fast concludes, following the circumambulation, do not replenish the censer. Instead, chant the names and titles of all present, stating each person’s rank and the Daoist registers they have received, in order of seniority. For those who have received the highest Dharma, follow the *Yellow Writ*; if participating in the master’s register, the officiant’s name is recited first.\n\nSupplicate to the Three Origins, the Supreme Perfected of the Empty Cavern and Nine Mysteries, the Lofty Jade Emperor of the Great Void, the Thirty-Nine Emperors, the Twenty-Four Perfected, the August Jade Dawn of the Supreme Great Dao Lord, the Four Controllers and Five Emperors, the Ten Thousand Dao of the Primordial Supreme Sages, and the Most Exalted Heavenly Worthies.\n\nYour servants, devoted to the Dao and delighting in immortality, aspire to ascend through the Nine Mysteries and present ourselves before the Supreme Perfected. On the [specific] day and hour of the [specific] month, we commenced the fast and vigil at [location], performing the Dao-circuits, reciting scriptures, meditating upon the divine, invoking the Perfected, compounding elixirs with focused intent, atoning for transgressions, and establishing merit. With hearts purified and strength exhausted, we adhered to the Dharma and followed the rites. Now that the prescribed days have concluded and the practices are complete, we humbly supplicate and invoke the Most High Three Origins, the Three Clarities, the Three Treasures, the Attendant Immortals of the Divine Court, the Five Directions and Five Emperors, the Inspectors of the Numinous, the Directors of the Fast, the Flying Immortals, the Heavenly, Earthly, and Divine Immortals, the Perfected Officials and Numinous Immortals of the Five Marchmounts, the Four Seas, and the Four Quarters. May they return to their true palaces, ascend in rank as Upper Immortals, and be enfeoffed with imperial titles according to their merit.\n\nIn accordance with the rites of the Supreme Perfected, may your servants, along with our Nine Ancestors of the Mysteries, the Seven Generations of Forebears, and all departed kin both near and distant, together escape the dark night and enter the radiant light. May long-standing transgressions be absolved, and may fortune and virtue flourish.\n\nMay your servants, through the practice of the Dao, attain the Dao; through seeking immortality, attain immortality; through compounding the elixir, perfect the elixir; through refining gold, achieve gold. Through focused meditation, may we achieve resonance with the divine, commune with the numinous, have our transgressions absolved, and our prayers for blessings fulfilled. May we transform our forms, traverse the seventy-four directions, and have the Three Origins descend, sending forth green chariots. May we soar through the Upper Clarity, ascend through the Nine Heavens, shine with the brilliance of the sun and moon, and turn in harmony with the Three Treasures. We humbly beseech the Most Exalted to witness and reflect our sincere devotion.\n\nYour servants, in learning the Dharma, have not yet mastered the proper forms of reverence; in conducting the fast, have often strayed from the subtle guidelines. Our actions may not conform to the canonical standards, and our conduct may violate the regulations, subjecting us to the scrutiny of the Four Controllers and the jurisdiction of the Five Emperors. For our myriad transgressions and innumerable faults, we implore your forgiveness. Pity our ignorance and lack of understanding, reward our virtuous intentions, and spare us from punishment.\n\nMay the Perfected Officials of the Five Corporeal Realms pursue their immortal duties, ascend to the Dark Capital, receive ranks according to their merit, and complete their rewards. Upon their return to our bodies, may they ascend in unison with us, soaring through the Great Void.\n\nWith this, we respectfully submit our petition and await your response. Your servants, with utmost reverence and trepidation, prostrate ourselves and bow twice in submission.\n\nThe rites conclude. Bow twice again, perform the triple offering of incense, replenish the censer, and recite the purification mantra as usual.\n\nAll offerings and rituals should be conducted on the designated day of the fast. If hindered by wind or rain, they may be performed afterward, but no later than nine days hence. Should the delay exceed this period, another fast must be held to atone for the deepened transgressions and unfulfilled intentions. Submit a renewed petition to realize your sincere aspirations.\n\nShould inauspicious or adverse events, whether public or private, disrupt the fast, the rites must be repeated—tenfold, a hundredfold—until the response is achieved. The prescribed number of days for each of the four seasons must not be exceeded, nor should the rituals be abbreviated; all must be completed in full.\n\nIf the effort required exceeds one’s capacity, sell possessions or borrow from others to ensure completion. Distribute the offerings widely among those of like mind, avoiding those of disparate intent. For those residing in secluded or remote areas, far from towns and roads, prepare boats and carriages with diligence, calculate the strength required for the fast’s duration, and complete the work without delay or procrastination. Should sudden hardship cause one to forget prior commitments, turning blessings into misfortune, be ever vigilant.\n\nShould any ritual implements be lost, misappropriated, destroyed by water or fire, stolen by thieves, concealed by demons, or defiled by base elements, abandon them and report the matter. Bury or burn them, and do not repurpose them for profane use. Prepare new implements in accordance with the Dharma, without deficiency, and submit a separate petition to atone for the loss.\n\nFor the various calamities and transgressions—some comprising twenty-four categories—do not attempt to absolve them all at once. Instead, complete the process over three years, observing all twenty-four solar terms without omission. To omit even one requires starting anew, a task of great difficulty that only those of unwavering devotion can accomplish. Whether one succeeds or fails, the Dao will not be attained. Future opportunities may not align with present aspirations; thus, today’s vows must be pursued with diligence and precision, never wavering in intent. Only then will fulfillment be assured.\n\nFor transgressions, calamities, or misfortunes that are interconnected and fall under six categories, all six may be absolved simultaneously, rather than addressing one per term. If, after three years, resonance with the divine has not been achieved, proceed to absolve one matter at a time. Once the cycle of years is complete, ascension will surely be attained.\n\n*The Lower Scroll of the* Writ of the Eight Dao Commands and Life Registers *of the Supreme Perfected of the Cavernous Truth concludes.* #According to the context, six poetic hymns are missing below the character \"左.\"",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞真太上八道命籍经 经名：洞真太上八道命籍经。 撰人不详，约出於南北朝。 言八节日解罪谢过之法。 二卷。 底本出处：《正统道藏》正一部。 参见《云笈七签》卷五一。 洞真太上八道命籍经卷上 解罪所用诀 八道命籍，一名八间，一名八达，又名八解解缠释结谢罪延福妙经。 太素三元君受於自然之章，封於太上灵都紫房之内，金章玉华三百人侍卫典香。 东海小童、四极真人、西城王君，封於峨媚之山西室之中。 万劫一传，有玄名帝简紫字，青宫玉藏之人，千年之内听得三传。 上学之子，不得此文，虚困山林，终不得道。 所谓八道者，日月四时八节所行也。 日行赤道，月行黄道，黄赤二道，阴阳之所常行。 至於立春、春分，月行青道二； 出黄道东。 立夏、夏至，月行赤道二； 出黄道南。 立秋、秋分，月行白道二； 出黄道西。 立冬、冬至，月行黑道二，出黄道北。 此为八道也。 月行八道之日，各有变化，翾飞蠕动，含炁之流，草木飞沉，随缘感应，改故易新，轻者更重，重者更轻，善恶回换，炁象之运，自然而然。 上学真人，因变行化，习吉除凶，进吉黜恶，申明弃暗，入正治邪，炼伪成真，厉愚登圣，其法高妙，兹道玄通，故曰八达，至极无穷矣。 一道命籍，立春清朝，北望有紫绿白云者，是太上三元君三素飞云也。 至存叩头抟颊各九，心礼四，再拜，密咒曰：曾孙姓名，今日幸遇三元出行，愿得长生，侍给轮毂，余所言随人意也。 某病乞差，某厄乞度，某灾乞消，某事乞果。 三见云舆，白日升仙，不须复他存思千百。",
      "translated_text": "**The Wondrous Scripture of the Supreme Eight Dao Registers of Life**\n\n**Scripture Title:** *The Wondrous Scripture of the Supreme Eight Dao Registers of Life*\nAuthor unknown, approximately composed during the Northern and Southern Dynasties. It expounds the methods for absolving sins and repenting transgressions on the eight solar terms. In two fascicles.\n\n**Source of Base Text:** *Daoist Canon of the Zhengtong Era*, Orthodox Section, Part One.\nSee also *Seven Bamboo Tablets of the Cloudy Satchel*, Fascicle 51.\n\n---\n\n**The Wondrous Scripture of the Supreme Eight Dao Registers of Life, Fascicle One**\n\n**Formulas for Absolving Sins**\n\nThe *Eight Dao Registers of Life* is also called the *Eight Intervals*, the *Eight Attainments*, and further named the *Wondrous Scripture of the Eightfold Liberation, Unbinding Knots, Repenting Sins, and Prolonging Blessings*. The Lord of Primordial Purity’s Three Origins received it from the natural chapters and sealed it within the Purple Chamber of the Numinous Capital of the Supreme. Three hundred attendants, adorned with golden seals and jade blossoms, stood guard and tended the incense. The Youth of the Eastern Sea, the Perfected of the Four Poles, and the Lord King of the Western City sealed it within the western chamber of Mount Emei. Transmitted once every ten thousand kalpas, those with the mystic name \"Imperial Tablet of Purple Script\" and the \"Jade Treasury of the Azure Palace\" may receive three transmissions within a thousand years. Disciples of the highest learning who lack this text will toil in vain among the mountains and forests, never attaining the Dao.\n\nThe so-called *Eight Dao* refer to the paths traversed by the sun and moon during the eight solar terms of the four seasons. The sun travels the Red Dao, and the moon travels the Yellow Dao—these two, the Yellow and Red Dao, are the constant paths of yin and yang. At the solar terms of *Lichun* (Beginning of Spring) and *Chunfen* (Spring Equinox), the moon travels the two Green Dao, emerging east of the Yellow Dao. At *Lixia* (Beginning of Summer) and *Xiazhi* (Summer Solstice), the moon travels the two Red Dao, emerging south of the Yellow Dao. At *Liqiu* (Beginning of Autumn) and *Qiufen* (Autumn Equinox), the moon travels the two White Dao, emerging west of the Yellow Dao. At *Lidong* (Beginning of Winter) and *Dongzhi* (Winter Solstice), the moon travels the two Black Dao, emerging north of the Yellow Dao. These are the *Eight Dao*.\n\nOn the days when the moon traverses the Eight Dao, all things undergo transformation: winged creatures take flight, crawling beings stir, and all that bears qi—plants, trees, flying and submerged beings—respond to conditions, altering the old and renewing themselves. The light becomes heavier, the heavy becomes lighter; good and evil interchange. The movement of qi and its manifestations occur naturally. Disciples of the highest learning, following these transformations, practice auspiciousness and eliminate inauspiciousness, advance the fortunate and demote the wicked, clarify the abandonment of darkness, enter rectitude to govern perversity, refine the false into the true, and elevate the foolish to sagehood. This method is lofty and wondrous; this Dao is profound and unfathomable. Thus, it is called the *Eight Attainments*, reaching the ultimate without end.\n\nFor the *First Dao Register of Life*: at dawn on *Lichun* (Beginning of Spring), gaze northward for clouds of purple, green, and white—these are the Three Primordial Lords of the Supreme’s *Three Pure Flying Clouds*. Kneel, knock your head to the ground, and clasp your cheeks nine times each. Bow four times in your heart, then prostrate twice more. Silently recite the incantation:\n\n*\"The humble descendant [insert name] today fortunately encounters the procession of the Three Origins. May I attain longevity and serve the wheel-hub of the celestial chariot. The rest of my words follow my own intent: [I] beseech healing from illness, deliverance from calamity, dissolution of disaster, and fulfillment of my wishes.\"*\n\nUpon seeing the cloud chariot thrice, one ascends to immortality in broad daylight, no longer requiring other meditative practices of a thousand or a hundred.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 605,
      "start_sentence": 0,
      "end_sentence": 29,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.658278942108154,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上八道命籍经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "所施为行此，必有仙录，是故谓之八道命籍也。 二道命籍，春分夜半子时，东北望有玄青黄云，是太微天帝君三素云也。 存礼密咒，皆如上法。 三道命籍，立夏清旦，西北望有紫青黄云者，是太极上真君三元内宫真人三素云也。 存礼密咒，皆如上法。 四道命籍，夏至清旦，东南望有赤白青云者，是扶桑太帝君三素云也。 存礼密咒，皆如上法。 五道命籍，立秋清旦，正西望有白赤紫云者，是太素真人天皇白帝君三素云也。 存礼密咒，皆如上法。 六道命籍，秋分清旦，南望有素赤黄云者，是南极上真人上皇赤帝君三素云也。 存礼密咒，皆如上法。 七道命籍，立冬清旦，西南望有绿紫青云者，是上清真人帝君皇祖三素云也。 存礼密咒，皆如上法。 八道命籍，冬至清旦，正东望有朱碧黄云者，是太霄玉妃太虚上真人三素云也。 存礼密咒，皆如上法。 右八道命籍之日，日未至一二，先沐浴烧香以待，至日依时出望一食顷，还室，阴雨勿望。 非其日忽见此云，礼咒如上，三倍胜於其日也。 凡先身今身，前世今世，罪结不除，谩谢不的，原恕赊迟，功行难进，魔试不知，多致退落，衰老易至，求升难期，一去长逝，幽苦未央，上学之子，悟此惊心，誓志仰慕，感玄彻灵，能得命籍，的断罪根，解释恶结，滋长善源，群邪敢干，成真必速，谛念密修，即有验矣。 凡诸解罪，必先营斋，克用八道之日，身心清严，自非同志，不得妄参大道。 圣真神仙男女，常会玄都，长斋清集，率心形以化亿兆，流行业以济苍生。 苍生未尝暂无，应化不得暂阙，应不暂阙，常有主应之方，玉京之台，是常应之所。 生未尝无死，死未尝不生，出生入死，无量无央。 天地无数，国土无穷，更生更死，时刻无休，起灭相涉，有无互成。 生称其有，死目其无，无不无，有不有，不有不无，常应常在，存而不灭，智慧无穷。 上学之人，相与归赴，赴之由阶，入之由炁，思神录炁，习法登阶，名之为斋。 斋者，齐也。 洗心净身，身心相应，内外咸同，精敬整畟，始终弥笃，无有参差，不怠不替，无苟无矜，恬啖至道，故号曰斋。 斋法甚多，不可具载，圣真相传，口口相教，诸经有仪，略举梗，斟酌修用，存乎其人。 学而不斋，徒劳无获，如薪无火，如火无传，如升天无云梯，如飞步无星炁，虽自奋体，岂能遂心。 心遂必由斋，斋静必谢过，过不洗则福不来，福不来则祸必至，祸至不能禳，无缘成仙圣。 圣仙长斋，精思积久，解谢众愆，断凶纳吉，积福重德，德充入道，与神合同，常乐无苦。 有志期此，摆拨诸尘，誓营清斋，用三元法。 法以守一为主，一以恬静为家，家在人心，宜和顺，顺和之美，人之所重。 至於习此，弘之最难，良由前后罪鄣缠结，邪魔相干，致招不易，急应修斋，三时六时，大小忏愿，的之胜都辞旨探此。 案次行之斋竟，布施救厄扶危，密立阴功，改心易行，勤建阳德，不犯所知，知过勿复犯，犯之即又谢，三谢之后，灾消福至，犹未如愿，精修勿怠，果愿成道，乃可得休。 三犯之后，不得复谢，谢不被恕，明各慎之。 受法之前，有诸灾厄第一； 受法之后，有诸灾厄第二； 出生以来，有诸灾厄第三。 右三条，灾有多端，厄有浅深，不可具记，大略标举，触类附之。",
      "translated_text": "Performing these rites ensures enrollment in the immortal registers—hence they are called the *Eight Dao Registers of Destiny*.\n\nThe **Second Dao Register of Destiny**: At midnight of the vernal equinox, facing northeast, observe clouds of dark cyan and yellow—these are the *Three Primordial Clouds* of the Celestial Emperor of the Supreme Subtlety. The rites of visualization, obeisance, and secret incantation follow the method above.\n\nThe **Third Dao Register of Destiny**: At dawn of the summer solstice’s onset, facing northwest, observe clouds of purple, cyan, and yellow—these are the *Three Primordial Clouds* of the Supreme Perfected Lords of the Great Ultimate’s Inner Palace. The rites of visualization, obeisance, and secret incantation follow the method above.\n\nThe **Fourth Dao Register of Destiny**: At dawn of the summer solstice, facing southeast, observe clouds of red, white, and cyan—these are the *Three Primordial Clouds* of the Celestial Emperor of Fusang. The rites of visualization, obeisance, and secret incantation follow the method above.\n\nThe **Fifth Dao Register of Destiny**: At dawn of the autumnal equinox’s onset, facing due west, observe clouds of white, red, and purple—these are the *Three Primordial Clouds* of the Heavenly Sovereign White Emperor of the Supreme Perfected. The rites of visualization, obeisance, and secret incantation follow the method above.\n\nThe **Sixth Dao Register of Destiny**: At dawn of the autumnal equinox, facing south, observe clouds of plain white, red, and yellow—these are the *Three Primordial Clouds* of the Supreme Perfected Lord of the Southern Culmen and the August Red Emperor. The rites of visualization, obeisance, and secret incantation follow the method above.\n\nThe **Seventh Dao Register of Destiny**: At dawn of the winter solstice’s onset, facing southwest, observe clouds of green, purple, and cyan—these are the *Three Primordial Clouds* of the Perfected Lord of the Supreme Clarity and the Imperial Ancestor. The rites of visualization, obeisance, and secret incantation follow the method above.\n\nThe **Eighth Dao Register of Destiny**: At dawn of the winter solstice, facing due east, observe clouds of vermilion, azure, and yellow—these are the *Three Primordial Clouds* of the Jade Consort of the Great Empyrean and the Supreme Perfected of the Great Void. The rites of visualization, obeisance, and secret incantation follow the method above.\n\nOn the days of the Eight Dao Registers, one or two days prior, bathe, burn incense, and await the appointed time. At the proper hour, go forth to gaze for the duration of a meal, then return indoors. If overcast or rainy, do not gaze. Should these clouds appear unexpectedly on other days, perform the rites and incantations as above—this is thrice as efficacious as on the appointed day.\n\nFor all past and present transgressions—whether from former lives or this life, sins unresolved, apologies unaccepted, pardons delayed, merits difficult to advance, demonic trials unrecognized, leading to setbacks, premature aging, and elusive ascension—once departed, one lingers in unseen suffering without end. Disciples of the higher studies, awaken to this with alarm! Swear devotion, yearn for the mysterious, and penetrate the numinous. By obtaining the Dao Registers, you decisively sever the roots of sin, untie the knots of evil, and nourish the wellspring of goodness. No demon dares intrude, and swift attainment of Perfection is assured. Sincerely cultivate in secret, and verification will soon follow.\n\nFor all absolutions of sin, first conduct a purification fast. On the days of the Eight Dao Registers, maintain purity of body and mind. Without like-minded companions, do not rashly partake in the Great Dao. The divine Perfected, immortals male and female, constantly gather in the Mystic Capital, observing long fasts and pure assemblies. They transform countless beings through the sincerity of their forms and propagate karmic deeds to aid the living. The living are never without need, and responses must never lapse. Where responses never lapse, there are always methods of governance—such is the Terrace of the Jade Capital, the eternal site of response.\n\nLife never ceases in death, nor death in life. Emerging into life and entering death, boundless and endless. Heaven and earth are innumerable, lands are infinite. Rebirth and death recur without pause, moment by moment. Arising and ceasing intermingle; being and non-being mutually constitute. Life is called \"being,\" death is called \"non-being.\" Yet non-being is not truly non-being, nor being truly being. Neither being nor non-being, eternally responsive and present, abiding without extinction, wisdom is inexhaustible.\n\nDisciples of the higher studies, together return and hasten to this! The path to hastening lies in stages; entry comes through *qi*. Contemplate the divine, record the *qi*, practice the methods, and ascend the stages—this is called *fasting*. *Fasting* means *alignment*. Purify the heart and cleanse the body; body and heart respond in unison. Inner and outer harmonize, reverence is meticulous, devotion unwavering from beginning to end. Without negligence or omission, without carelessness or arrogance, one savors the Supreme Dao—hence it is called *fasting*. Fasting methods are manifold and cannot all be recorded. The Perfected transmit them orally, teaching one another. The scriptures contain their forms; here, only the essentials are outlined. Their adaptation and practice depend on the individual.\n\nTo study without fasting is labor in vain—like firewood without flame, like flame without transmission, like ascending heaven without a cloud-ladder, like flying without astral *qi*. Though one may exert oneself, how can the heart’s desire be fulfilled? Fulfillment must come through fasting; fasting’s stillness must entail repentance. Unwashed transgressions bar blessings; without blessings, calamity surely arrives. If calamity comes and cannot be averted, there is no means to become a Perfected Immortal. The Perfected and Immortals observe long fasts, accumulate contemplation over time, absolve manifold faults, sever misfortune and welcome fortune, amass blessings and deepen virtue. With virtue fulfilled, one enters the Dao, unites with the divine, and abides in eternal joy, free from suffering.\n\nThose resolved to pursue this must cast off worldly dust, vow to conduct pure fasts, and employ the methods of the Three Origins. The method takes *guarding the One* as its essence, and the One takes tranquility as its home. This home lies within the human heart—it should be harmonious and compliant. The beauty of harmony and compliance is what people esteem. Yet to practice this is most difficult to expand, for sins past and present entangle, and demonic forces intrude, making attainment arduous. Urgently conduct fasts—morning, noon, and evening, or six times daily—great and small repentances and vows. The finest invocations and principles are explored herein.\n\nAfter completing the fasts in sequence, perform almsgiving, rescue the distressed, aid the imperiled, secretly establish hidden merits, reform the heart and alter conduct, diligently cultivate yang virtues, and avoid known transgressions. Acknowledge faults and refrain from repeating them; if repeated, repent again. After three repentances, calamities dissolve and blessings arrive. If wishes remain unfulfilled, cultivate diligently without slackening. When aspirations and the Dao align, one may rest.\n\nAfter three transgressions, further repentance is not accepted, and pardon is not granted. Clearly understand and be cautious. Before receiving the methods, the first category of calamities arises; after receiving them, the second category emerges; from birth onward, the third category persists. These three categories encompass manifold calamities of varying depths, which cannot all be recorded. Here, only the general outline is provided—apply it analogously to other cases.",
      "overlap_context": ":\n\n*\"The humble descendant [insert name] today fortunately encounters the procession of the Three Origins. May I attain longevity and serve the wheel-hub of the celestial chariot. The rest of my words follow my own intent: [I] beseech healing from illness, deliverance from calamity, dissolution of disaster, and fulfillment of my wishes.\"*\n\nUpon seeing the cloud chariot thrice, one ascends to immortality in broad daylight, no longer requiring other meditative practices of a thousand or a hundred.",
      "start_char": 605,
      "end_char": 1863,
      "start_sentence": 30,
      "end_sentence": 69,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.28779983520508,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上八道命籍经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "先世今世，前身今身，虽有远近，罪目是同，还随源解释，以功成德也。 出生富贵，道俗兼修，出处安隐，吉乐相从。 或仕官为业，或商贩为资，或田蚕为事，或渔猎为常，常业虽俗，不淫不盗，不昏不乱，不妄相干，父不哭子，君不哭臣，兄不哭弟，师不哭资，老者无病而终，少者无患相奉，送死接生，吊凶庆吉，此为中平，保之者希。 诸天着乐，不复立功，先福既尽，尚入凶徒，是故贤明，愿生下世，随师行道，授受相成，克获神仙，长生不死，名为上学，业高乎中。 中平可上，乃得学上，上学之方，非凡下所议矣。 频遭丧亡一， 祖父师君，傍亲眷属，年尊卑过，非正灾限，己身惨服，为厄则同。 罪由不孝，逆伐尊上，自作劝他，不知改悔。 解用金帛，多买众生，饮饲放之，各得其所。 连婴疾病二， 生来多病，一差一家人己身，同入第三条。 罪由不仁，伤损含气，笑他疾厄，咒愿令病。 解用酒药，夜置於都路、市朝之间，穷乏之处。 内外公家三， 虽非己过，非横相牵，贵贱男女，亲疏流连。",
      "translated_text": "From past lives to the present, from former incarnations to this body, though the span may be distant or near, the categories of transgressions remain the same. Yet by tracing their origins and dissolving them, one may perfect virtue through meritorious deeds.\n\nBorn into wealth and nobility, one may cultivate both the Dao and worldly affairs, moving through life in peace and security, accompanied by good fortune and joy. Some may take official service as their vocation, others trade and commerce as their means, still others farming and sericulture as their occupation, or fishing and hunting as their custom. Though these pursuits are mundane, one must neither indulge in excess nor steal, neither act in delusion nor sow disorder, nor recklessly interfere with others. Fathers do not mourn their sons, lords do not mourn their ministers, elder brothers do not mourn their younger siblings, masters do not mourn their disciples. The aged pass without illness, the young live free from affliction, serving one another. They send off the dead and welcome the newborn, offering condolences in misfortune and celebrating in joy—this is the state of middling equilibrium, yet few can preserve it.\n\nThe heavenly hosts rejoice in such harmony, yet if one ceases to accumulate merit, and the blessings of former lives are exhausted, one may still fall among the ill-fated. Therefore, the wise and discerning aspire to be born in a lower realm, follow a master to practice the Dao, transmit and receive teachings in succession, and attain immortality—living forever without death. This is called \"superior study,\" its achievement surpassing the middling path.\n\nOnly those who rise from the middling may ascend to superior study, for the methods of superior study are not to be debated by the common or base.\n\n**First Category: Frequent Bereavement**\nThe deaths of grandparents, father, master, or lord, as well as close kin and family—whether elders or juniors, beyond the bounds of natural calamity or fate—bring mourning upon oneself, and thus share the same affliction. The transgression arises from disobedience, rebellion against superiors, and encouraging others in such acts without repentance. To dissolve this, use gold and silk to purchase many living beings, feed and release them, each to its proper place.\n\n**Second Category: Chronic Illness from Infancy**\nBorn with frequent illness, recovery brings suffering to the household and oneself alike, both falling into the third category. The transgression arises from a lack of benevolence, harming living beings with qi, mocking others’ afflictions, and cursing them with illness. To dissolve this, prepare wine and medicine, and place them at night along thoroughfares, marketplaces, and places of destitution.\n\n**Third Category: Entanglement in Public and Private Affairs**\nThough not one’s own fault, one is unjustly implicated, whether noble or base, male or female, close or distant kin—all become entangled.",
      "overlap_context": "align, one may rest.\n\nAfter three transgressions, further repentance is not accepted, and pardon is not granted. Clearly understand and be cautious. Before receiving the methods, the first category of calamities arises; after receiving them, the second category emerges; from birth onward, the third category persists. These three categories encompass manifold calamities of varying depths, which cannot all be recorded. Here, only the general outline is provided—apply it analogously to other cases.",
      "start_char": 1863,
      "end_char": 2281,
      "start_sentence": 70,
      "end_sentence": 84,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.649310827255249,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上八道命籍经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "罪由不柔，好斗劝讼，制拘飞沉，笼系生物。 解用纸笔、朱墨、刀子，手中逢人赐与，不须说源。 大小口舌四， 道俗诽谤传说，盲书辩诤无实，空中虚生。 罪由不受，素薄亲疏，道说人恶，负违谏谕。 解用饮饭羹臛，鲑肴果菜，设之要路，不须看视。 出入逢贼五， 公私往来，住止山世，凶人侵迫，掠夺毁伤。 罪由不慈，略夺一切，侵害人神，肆欲利己。 解用珍宝，村竹瓦草土砖，治护治馆，改易法物。 学业不升六， 外习经史子集图书，内习真文方术要诀，憎闻之求，见不见之，读诵不通，积年空过。 罪由不贞，秽浊心身，师友乖仪，嫉他才学，破易经文。 解用膏油及薪炭炬烛，手写经图，劝助同志。 右六件，准三品，九万九千九百九过行之。 仕宦退落七， 为君为臣为吏，在位无能被废，或有中德，横遭左迁归里，僻遐守尽穷困。 罪由不礼，矫位诈威，骄慢三朝，凌按四野。 解用扫帚拂箕，密送他舍，晨夕扫路，勿使人知。 无子多女八， 妻妾积年，不经有子，或有男则死，有女则生。 罪由不顺，逆件尊上，断人血嗣，通同奸淫。 解用金银珠玉，投之流水，祠无后亲贤，继绝世道德。 伤胎失育九， 妻妾有胎，伤动堕落，或生旬日，或至少年。 罪由不馑，轻忽交会，伤落他孕，厌祷公私。 解用香油、金如意、几席祠簟，送诸治舍。 男女媱妬十， 夫妻君妾，交接无度，空相疑妬，内外不和。 罪由不贞素，伉俪通他，争华在己，怒色在人。 解用五色之墨，五彩之缯，施於行路，不问富贵。 贵贱凌辱十一， 帝王遭贼，臣下遇盗，道俗逢凶，伤骂约路。 罪由不干，舍善从恶，翻覆男女，秽污清净。 解用香炉奁盒，铜铁器物，密送山野，助人婚嫁，劝人斋集。 水火虫鸟鬼众灾所侵害十二， 居止出入，山水道路，所养反变之灾。 罪由不义，形戮屠脍，亲君师尊，内乱相威。 解用冠衣、箱案、刀匕，投山水、朝野路上。 右六件，准三品，三万三千三百三过行之。 非意去失十三， 经书珍宝，钱米布帛，臣下奴婢，无故去失。 罪由不严，怠惰自适，不耐他求，窃人自益。 解用胶漆锁钥，送治舍中。 酣酗忘误十四， 读诵言语，忘前失后，传说僻谬。 罪由不慎，惚同为可，诵习经戒，忽略取过。 解用明镜杂皮，送治舍中。 居止偏僻十五， 中国陋巷，边城戎夷，山水险阻。 罪由不断，谄佞自亲己亲，损人舍宇。 解用刀斧锯凿，锤钻钉挺，布之行路。 作福得祸十六， 斋戒布施，斗诤伤犯，遭盗遇患，人鬼相加。 罪由不解，违越三尊，假托神鬼，卜梦妄占。 解用金龙、玉鱼，令形缠简，投之山水。 行善致恶十七， 吉意白彼，彼以凶疑，所劝成怨，所以为鄙，嗤诮忿责，结恨空深。 罪由不智，以愚为黠，诽谤师道，强名求誉。 解用然灯，十百千万，法数日数，随堪行之。 应成反败十八， 道世所营，造立建创，公私计业，推理必成，为人鬼所坏。 罪由不明，动止合滞，自作苟为，毁他成事。 解用奴婢，车马牛船，灯纂主盛，给治中。 右六件，准三品，七万七千七百七过行之。 已得又失十九， 道世所求，公私所作，出入所见，已得分明，俄顷或经时，遂不觉处所。 罪由不清，滥受诸物，诱匿奸私，施惠追咎。 解用身所服玩，布施行途，逢人即与，勿问有无。",
      "translated_text": "**Fourth Category: Strife and Litigation**\nThe transgression arises from a lack of gentleness, delighting in conflict and inciting lawsuits, restraining and confining creatures of the air and water, caging and binding living beings. To dissolve this, use paper, brushes, cinnabar, ink, and knives, bestowing them upon whomever one encounters—no need to explain the reason.\n\n**Fifth Category: Slander and Gossip**\nWhether ordained or lay, one spreads defamation and hearsay, engages in groundless disputes over blind texts, and stirs empty, baseless strife. The transgression arises from a refusal to accept counsel, treating kin and strangers with equal coldness, broadcasting others’ faults, and defying admonitions. To dissolve this, prepare rice, soup, broth, fish, meat, fruits, and vegetables, and place them along thoroughfares—no need to observe who partakes.\n\n**Sixth Category: Encounters with Bandits**\nIn public or private travels, whether dwelling in mountains or the world, one suffers assault, coercion, plunder, or injury from violent men. The transgression arises from a lack of compassion, seizing and plundering all things, harming both humans and spirits, and indulging one’s desires for personal gain. To dissolve this, use treasures, bamboo, tiles, grass, earth, and bricks to repair and protect lodgings, altering ritual implements.\n\n**Seventh Category: Failure in Scholarship**\nExternally, one studies the classics, histories, philosophers, anthologies, maps, and books; internally, one practices sacred texts, esoteric methods, and essential techniques. Yet one loathes to seek knowledge, whether seen or unseen, and though one reads and recites, nothing is mastered—years pass in vain. The transgression arises from a lack of integrity, defiling body and mind, violating the decorum of teachers and friends, envying others’ talents, and corrupting the *Book of Changes* and scriptures. To dissolve this, use oil, firewood, charcoal, torches, and candles to hand-copy scriptures and diagrams, encouraging and aiding like-minded practitioners.\n\n**The above six items, ranked in three grades, encompass ninety-nine thousand nine hundred and ninety transgressions.**\n\n**Eighth Category: Demotion in Office**\nWhether serving as ruler, minister, or official, one is dismissed for incompetence while in office, or though possessing some virtue, suffers unjust demotion and returns home, relegated to remote posts and reduced to poverty. The transgression arises from a lack of propriety, usurping rank and feigning authority, arrogantly defying the three courts, and oppressing the four regions. To dissolve this, use brooms and dustpans, secretly delivering them to others’ homes, sweeping paths morning and evening—let no one know.\n\n**Ninth Category: Childlessness or Many Daughters**\nThough a wife or concubine has been with one for years, no son is born; if a boy arrives, he dies, while daughters survive. The transgression arises from a lack of obedience, defying superiors, severing others’ bloodlines, and colluding in licentiousness. To dissolve this, cast gold, silver, pearls, and jade into flowing water, making offerings to childless kin and worthy predecessors to continue the lineage of Dao and virtue.\n\n**Tenth Category: Miscarriage and Infant Loss**\nA wife or concubine conceives, but the fetus is harmed and miscarried; or the child lives for ten days, or even a few years. The transgression arises from a lack of restraint, carelessly engaging in intercourse, harming another’s pregnancy, and making both public and private imprecations. To dissolve this, offer fragrant oil, golden *ruyi* scepters, tables, mats, and bamboo sleeping mats to healing abodes.\n\n**Eleventh Category: Jealousy Between Husband and Wife**\nWhether husband and wife or master and concubine, their union is immoderate, fostering mutual suspicion and jealousy, causing discord within and without. The transgression arises from a lack of chastity, engaging in affairs, prizing one’s own beauty, and resenting others’ attractiveness. To dissolve this, distribute five-colored ink and five-hued silks along the road, regardless of wealth or status.\n\n**Twelfth Category: Humiliation of High and Low**\nKings fall to rebels, ministers encounter bandits, the ordained and laity meet with misfortune, suffering insults and beatings on the road. The transgression arises from a lack of uprightness, abandoning good for evil, reversing proper roles between men and women, and defiling purity. To dissolve this, secretly deliver incense burners, cosmetic boxes, and bronze or iron vessels to the wilderness, aiding others in marriage and encouraging vegetarian feasts and gatherings.\n\n**Thirteenth Category: Harm from Water, Fire, Insects, Birds, Ghosts, and Multitudes of Disasters**\nWhether dwelling or traveling, in mountains, waters, or roads, one suffers calamities where nurture turns to harm. The transgression arises from a lack of righteousness, slaughtering and butchering, violating the intimacy of ruler, teacher, and elders, and inciting internal strife. To dissolve this, cast caps, robes, chests, tables, knives, and spoons into mountains, waters, or along roads in court and countryside.\n\n**The above six items, ranked in three grades, encompass thirty-three thousand three hundred and thirty transgressions.**\n\n**Fourteenth Category: Unintentional Loss**\nScriptures, treasures, money, grain, cloth, servants, and slaves vanish without cause. The transgression arises from a lack of discipline, indulging in laziness, refusing others’ requests, and stealing for personal gain. To dissolve this, deliver glue, lacquer, locks, and keys to healing abodes.\n\n**Fifteenth Category: Drunkenness and Forgetfulness**\nIn recitation and speech, one forgets what came before and loses what follows, spreading perverse and erroneous tales. The transgression arises from a lack of caution, treating confusion as clarity, neglecting the recitation of scriptures and precepts, and carelessly incurring faults. To dissolve this, deliver mirrors and assorted hides to healing abodes.\n\n**Sixteenth Category: Remote and Desolate Dwellings**\nOne resides in humble alleys within the central lands, or in border towns and barbarian regions, amid perilous mountains and treacherous waters. The transgression arises from a lack of resolve, flattering and fawning to favor one’s own kin while harming others’ dwellings. To dissolve this, scatter knives, axes, saws, chisels, hammers, drills, nails, and stakes along the road.\n\n**Seventeenth Category: Blessings Turning to Misfortune**\nOne performs vegetarian feasts and almsgiving, yet provokes disputes and offenses, suffers robbery and calamity, or incurs harm from humans and ghosts. The transgression arises from a lack of understanding, defying the Three Honored Ones, falsely invoking spirits and ghosts, and making reckless divinations and dream interpretations. To dissolve this, fashion golden dragons and jade fish, entwining them with bamboo slips, and cast them into mountains and waters.\n\n**Eighteenth Category: Good Deeds Inviting Evil**\nOne intends good for others, yet they suspect ill; what one advises turns to resentment, and one is scorned, mocked, and resented, fostering deep, empty grudges. The transgression arises from a lack of wisdom, mistaking folly for cunning, slandering the Dao of teachers, and forcing a reputation for virtue. To dissolve this, light lamps—ten, a hundred, a thousand, ten thousand—matching the number of days to one’s capacity.\n\n**Nineteenth Category: Success Turning to Failure**\nIn matters of Dao and the world, whether constructing, establishing, or creating, whether public or private undertakings, though logic dictates success, they are ruined by humans or ghosts. The transgression arises from a lack of clarity, acting with hesitation and obstruction, pursuing selfish ends, and sabotaging others’ accomplishments. To dissolve this, provide servants, carriages, oxen, boats, lamps, and abundant offerings to healing abodes.\n\n**The above six items, ranked in three grades, encompass seventy-seven thousand seven hundred and seventy transgressions.**\n\n**Twentieth Category: Gains Lost Again**\nIn matters of Dao and the world, whether public or private, what one seeks, sees, or obtains clearly may vanish in an instant or over time, leaving no trace. The transgression arises from a lack of purity, recklessly accepting things, concealing illicit affairs, and bestowing favors only to later regret them. To dissolve this, distribute one’s own clothing and belongings along the road, giving them to whomever one meets—ask not whether they are in need.",
      "overlap_context": "nto the third category. The transgression arises from a lack of benevolence, harming living beings with qi, mocking others’ afflictions, and cursing them with illness. To dissolve this, prepare wine and medicine, and place them at night along thoroughfares, marketplaces, and places of destitution.\n\n**Third Category: Entanglement in Public and Private Affairs**\nThough not one’s own fault, one is unjustly implicated, whether noble or base, male or female, close or distant kin—all become entangled.",
      "start_char": 2281,
      "end_char": 3604,
      "start_sentence": 85,
      "end_sentence": 153,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.607584714889526,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上八道命籍经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "为人所嫉二十， 有才有德，得位得财，人物所附，而有嫉憎。 罪由不平，阿党任意，好胜干众，抑绝贤明。 解用履板床帐，供诸有道，识与不识，遇之则与。 为人所疑二十一， 道德名位，日进日新，或藏明晦迹，或宝己守常，人横疑猜忌。 罪由不忠，欺罔幽显，万端负誓，误败良善。 解用冷罂与盘，栉沐浴具，送治中。 为鬼所着二十二 忽见鬼来，男女和合，或骂詈秽丑，不自觉知。 罪由不信，唝嗃诈伪，淫祀乱真，惊恐百姓。 解用桃奏符板，削治净洁，荐席真朱，送治中。 为邪所通二十三， 平常忽异，或因疾苦，所见惊忧，所解求真，发作无损，邪弊日增。 罪由不正，协道营俗，男女混杂，迷乱天人。 解用经台堂室，床帐机案，巾帽厨箱，送治中。 被试不度二十四。 师友魔王，公私非意，所未尝经，是所宜弃，今皆善之，并动心识。 罪由不专，习学泛滥，望速厌迟，泄露宝诀。 解用舍身，给师驱使，次造治馆，躬执香灯，扫洒尽其心力，教化立於后生。 右六件，准三品，三万三千三百三过行之。 凡有四六件，合二十四事，三八在乎其中，包罗众条，大小疑似，是非纷纭思议，附此注正分明。 依源斋谢，解而释之。 所输所散，洗竭至诚，无悔无吝，大福即臻。 非用金帛，当运心形，计力量工，算日准直，能输不计，皆得由人，人不堪者，或有贫富，制以取中，要在无惜，惜即又首，三首无原也。 东海青童君告方诸真人曰：子之应感，行化群生，凡有志向，宜须奖成，传付此诀，密重丁宁。 前代已过，今不具陈，即日自改，准此为科。 斋谢之后，小灾即消，大灾未释，当急避之。 避之所往，依案浑仪，仰观俯察，精密勿宣。 且如天文说大灾必除，除灾招福，先由此经。 此经要法，内外所珍，众圣所贵，流芳元穷矣。 二王君至秘此，魏华存受旨，行之有验，后传独立又隐。 此文修之者寡，成真者疏，玄名图录，必得之耳。 上为国师，中为民间师，下学修身，末为人师，此为三品也。 洞真太上八道命籍经卷上竟 洞真太上八道命籍经卷下 太上大道，炁周十方，人之动静，在八而已。 四面四维，隶上属下，下方上方，摄统乎八。 八卦正神，施行八炁，太一为主，三元流通。 流通人间，间中有路，路通善人，有玉简者，习向逍遥，出乎八门，导达游宴，适乎十方。 十方圣众，皆从八门得出，八道命籍，悉载众圣所行。 行化济善，日阳月阴，阴德隐通，通神妙诀，圣真所秘，斋禁弥严，未能解罪，不得见闻，闻见不解，解亦不行，行亦不验，徒劳增愆。 若有至诚，精思玄感，必能解罪，必见此经，必晓此事，必获重福，遵修即验，克成真矣。 的谢斋法，法身独修，若有同志，二人三人，乃至九人，不得过也。 脱善缘运会，偶多贤明，九人之外，别更结斋，慎勿强共，干忤九天，求福得祸，明各慎之。 凡师友疾厄，不堪躬斋，同学志人，可得相为，独及有侣，亦极九人。 法师都讲，监斋侍经，侍香侍灯，执简如法。 的行八道，四时六事，八节五行，二十四气，信德土功，周遍内外，是故无复四季之斋也。 凡相为的斋，悉不得受观主人所用精案四科。 的谢斋竟，四科所输，默而施行，勿使他觉。",
      "translated_text": "**Twentieth Category: Being Envied by Others**\nThose with talent and virtue, who attain rank and wealth, drawing people to them, may incur envy and resentment. The transgression arises from inequity, forming cliques at will, seeking to surpass others, and suppressing the worthy and wise. To dissolve this, offer wooden sandals, bedframes, and curtains to all those of the Dao—whether known or unknown—giving whenever encountered.\n\n**Twenty-First Category: Being Suspected by Others**\nAs one’s Dao, reputation, and rank advance daily, whether concealing brilliance or guarding constancy, others may harbor groundless suspicion and jealousy. The transgression arises from disloyalty, deceiving both the hidden and the manifest, breaking myriad vows, and misleading or ruining the good. To dissolve this, provide cold jars and basins, along with combs and bathing implements, and send them to healing abodes.\n\n**Twenty-Second Category: Being Afflicted by Ghosts**\nOne may suddenly see ghosts approach, engaging in union with men or women, or spewing foul and vile curses without self-awareness. The transgression arises from faithlessness, deceitful pretenses, illicit sacrifices that distort truth, and alarming the common people. To dissolve this, use peach-wood talismans and inscribed boards, carving and purifying them, then present them with vermilion mats, sending them to healing abodes.\n\n**Twenty-Third Category: Being Possessed by Evil**\nOne may suddenly behave strangely, or amid illness and suffering, see disturbing visions, seek truth in vain, and though no harm manifests, the influence of evil grows daily. The transgression arises from impropriety, blending Dao with worldly customs, mingling men and women indiscriminately, and confusing humans and spirits. To dissolve this, offer scripture pedestals, halls, bedframes, curtains, desks, headscarves, hats, kitchenware, and chests, sending them to healing abodes.\n\n**Twenty-Fourth Category: Failing Trials Beyond Measure**\nTeachers, friends, or demonic forces may impose unforeseen trials—matters one has never encountered, which ought to be rejected—yet one now deems them good, stirring the mind and consciousness. The transgression arises from lack of focus, superficial learning, hasty expectations, delayed disillusionment, and leaking sacred teachings. To dissolve this, offer oneself in service to one’s teacher, then construct a healing abode, personally tending incense and lamps, sweeping and cleansing with utmost devotion, and establishing teachings for future generations.\n\n**The above six items, ranked in three grades, encompass thirty-three thousand three hundred and thirty transgressions.**\n\n**In total, there are twenty-four categories, comprising four sets of six. The three eights lie within them, encompassing all conditions—great and small, doubtful and certain, right and wrong, tangled in deliberation—all are clarified and rectified here. Through repentance and gratitude, they are dissolved and released. What is offered and dispersed must be given with utmost sincerity, without regret or reluctance, and great fortune will swiftly arrive. If not using gold or silk, one must exert mind and body, calculating labor and time, estimating worth by the day. Those who give without reckoning do so by their own will; if others cannot bear it, whether rich or poor, take the middle path—what matters is the absence of stinginess. Stinginess leads to relapse, and three relapses leave no recourse.**\n\nThe Lord of the Azure Youth of the Eastern Sea addressed the Perfected One of Square Cauldron, saying: *\"Your responsiveness and transformation of sentient beings—those with aspirations must be encouraged and guided. Transmit this teaching with utmost secrecy and care. Past transgressions need not be recounted; from this day forward, correct yourself according to these principles. After repentance and gratitude, minor calamities will dissolve at once. For major calamities not yet dispelled, hasten to avoid them. Where you flee, observe the celestial patterns, gazing above and below, with precision and without disclosure. As the celestial texts foretell, great calamities must be eradicated, and in eradicating calamities, fortune is summoned—this begins with this scripture. This scripture’s essential method is treasured both within and without, revered by all sages, its fragrance enduring without end. The Two Perfected Lords guarded this in utmost secrecy; Wei Huacun received the decree and practiced it with efficacy, later transmitting it to the solitary and reclusive. Few have cultivated this text, and fewer still attained perfection. Only through the mysterious names and illustrated registers may one obtain it. The highest serves as the state’s teacher, the middle as a teacher among the people, and the lowest cultivates the self to become a teacher—these are the three grades.\"*\n\n**The Upper Scroll of the Supreme Perfected’s Scripture of the Eightfold Dao’s Register of Life Concludes**\n\n**The Lower Scroll of the Supreme Perfected’s Scripture of the Eightfold Dao’s Register of Life**\n\nThe Great Dao of the Supreme, its *qi* pervading the ten directions, governs human movement and stillness through the eight alone. The four cardinal directions and four diagonals belong to the upper and lower; the lower and upper directions encompass and unify the eight. The eight trigrams’ true spirits enact the eight *qi*, with the Great One as their master, and the Three Origins flowing in circulation. This circulation extends among humans, where paths exist within the spaces. These paths connect to the virtuous—those with jade tablets may wander freely, exiting through the eight gates, guided and roaming, reaching the ten directions. The sacred multitudes of the ten directions all depart through the eight gates; the *Eightfold Dao’s Register of Life* records all that the sages practice. In transforming and aiding the good, the sun is yang and the moon yin; hidden virtue secretly connects, linking to the wondrous teachings of the spirits. These are the secrets of the sages and perfected, guarded with strictest discipline. Without dissolving transgressions, one cannot perceive or hear them; hearing and perceiving without understanding, or understanding without practicing, or practicing without efficacy—all is labor in vain, increasing faults. Yet if one possesses utmost sincerity, meditating deeply on the mysterious, one will surely dissolve transgressions, behold this scripture, comprehend its matters, and obtain great fortune. Following its cultivation, efficacy will manifest, and perfection will be achieved.\n\n**The Method of Repentance and Gratitude**\nCultivate the Dharma-body alone. If there are like-minded companions, two or three, up to nine, but no more. If by good fortune and karmic conditions, many worthy and wise gather beyond nine, form a separate repentance assembly—do not forcibly combine, lest you offend the Nine Heavens, seeking fortune only to invite misfortune. Let each be cautious.\n\nWhen teachers or friends face illness or hardship and cannot personally perform repentance, fellow students or aspirants may act on their behalf, alone or with companions, but never exceeding nine. The Dharma-teacher, reciter, repentance supervisor, scripture attendant, incense attendant, lamp attendant, and tablet bearer must all follow the proper method.\n\n**The Practice of the Eightfold Dao**\nObserve the four seasons, six affairs, eight solar terms, five phases, twenty-four qi, the virtues of faith and earthly works, encompassing both inner and outer—thus, there are no longer repentances for the four seasons.\n\n**In performing mutual repentance, none may accept the offerings of the host’s refined altar in four categories.** Upon concluding the repentance and gratitude, the four categories of offerings are to be distributed in silence, without others’ awareness.",
      "overlap_context": "\n\n**Twentieth Category: Gains Lost Again**\nIn matters of Dao and the world, whether public or private, what one seeks, sees, or obtains clearly may vanish in an instant or over time, leaving no trace. The transgression arises from a lack of purity, recklessly accepting things, concealing illicit affairs, and bestowing favors only to later regret them. To dissolve this, distribute one’s own clothing and belongings along the road, giving them to whomever one meets—ask not whether they are in need.",
      "start_char": 3605,
      "end_char": 4864,
      "start_sentence": 154,
      "end_sentence": 203,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.96155595779419,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上八道命籍经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "有相问者，方便答之。 偶有布施，或云奉上，彼苦不受，勿强致猜，更复与他，他会受者，不须语人，道彼受不受也。 的谢斋法，通用三元，日数则异，春九、夏三、秋七、冬五，日夜行道，六时三时朝，朝中乾菜果实随人。 未至数日，扫洒内外，整理法物，逆辨精新，不得临时率尔充限。 禁隔唯严，不得嚣杂。 营斋之身，不得出外，出外勿还，还则别住，慎勿冒前，误至斋所。 外来信使，住门传言，内人译语，先水吩嗽，去又嗽之，不得忽略。 施安坛墠堂房，床帐几案，香具荐席，井帏步障幔幙，净洁密完。 厨帐井灶，浴室及囿厕，皆当烧诸名香，勿令臭炁发泄，猥人住处。 各立圊厕，坐卧解脱，不得相涉，高卑混同，俱被灾考，防祸求福，明加慎之。 斋集之夕，或食或不食，浆药各异，沐浴当同。 虽久长斋，亦宜沐浴，消息治辞，人定启告，清严入室，依常朝仪。 至大忏读文，有倡者唱称名位，法师叩齿三十六通，长跪执文如左： 太玄都三洞法师某岳先生，小兆真人三景弟子，奉行大洞经事，若不受三洞，直云太上玄都玉京紫宫琼房三景弟子，大洞法师小兆真人，某岳先生夫人。 元君臣妾姓名，上启太上无极大道、三元太真皇老、高上仙都高皇玉帝、九玄道君、无极天尊、无上洞玄自然虚皇、五方五帝、五岳飞仙，玉司金阙一切诸灵官，臣某下愚，谬叨上道，诚欢诚荷，载惕载惭，未能专习妙法，速登神仙，推迁世途，咎衅消积，日月易去，年命难留，常恐奄忽，一往无还，自惊自悲，痛切心腑，仰怙玄慈，赐垂哀佑。 今在驱除之运，幸见不死之方，久忘罪秽之躬，誓慕长生之术，伏览八道命籍，八达要文，仰瞻三素，存礼八尊，的谢斋法，解释罪缠，前后殃散，克获神仙，不揆行尸，誓愿修习。 若为人云：今有师友，尊上君亲，子弟男女某，同受此法，某今疾厄，公私迫碍，不得躬修，因臣妾等启告，注心如科，臣妾等道同志合，冒操某辞，谨读以闻。 依科供办，密遵要言，洗心赍辞，谨读以闻。 某州某郡乡里，男女官祭酒道士，某洞弟子，臣妾姓名，年如干岁，户口如干，今住某处，某稽颡谢罪，乞恩辞：共辞者，具乡居位姓名。 臣某凡贱下愚，草土苗裔，幸籍善缘，叨染妙法，衔荷玄恩，寔深罔极，但生长流俗，习恶移辰，动静成愆，日夜增积，虽奉经戒，不能修行，出入灾毒之世，遭逢驱除之期，由是惧充齑粉，俯仰惊悲，雀鼠贪生，蜫苇愿活，不揆罪秽之余，冒乐升进之泽。 某年月日时，於某处诣男女法师姓名，受某经戒，要方妙术，宝诀秘文如干卷，如干帙。 或某年太岁某，某月日时，於某处，某因缘得如干卷，某年月日时，於某处玄盟。 诚欢诚喜，誓志遵行，冀申素愿。 某月日时，於某处忽得某疾病，公私灾厄随意言之。 忧怖屏营，虑不全济，或出生多病，贫穷困苦，少孤长独，天人罕此，某事云云。 良由宿衅既深，今愆又重，致此凶灾，惭惧敢怨。 伏寻罪躬，分当甘陨，岂宜叨忤，冒昧上闻，但仰怙玄慈，含弘尘垢，善贷善成，不遗毫分，谨洗心清身，斋戒首谢，乞更造之恩，赐三宥之渥，消灾瘵疾，官事解释，依原消息，年命申延，誓不言犯，展得自新，修行所受，克获神仙道种之限，蒙如今请铭，荷曲成之恩。",
      "translated_text": "When questioned, respond with appropriate expedience. Should there be alms offered, one may say it is \"presented in devotion\"; if the recipient declines out of humility, do not press or harbor suspicion, but instead offer it to another who may accept. There is no need to inform others whether it was received or not.\n\n**The Method of Concluding the Repentance Ritual**\nApplies universally to the Three Origins, though the number of days varies: nine in spring, three in summer, seven in autumn, and five in winter. Day and night, one practices the Dao, observing the six periods and three times of dawn. Offerings of dried vegetables, fruits, and grains are made according to each person’s means.\n\nBefore the appointed days, sweep and purify both inner and outer spaces, arrange ritual implements, and prepare fresh and refined offerings—never hastily fulfilling requirements at the last moment. Boundaries must be strictly observed, and no clamor or disorder permitted. Those engaged in the ritual fast must not leave the premises; if they do, they may not return, and if they return, they must reside separately, taking care not to intrude upon the ritual space.\n\nFor messengers from outside, they are to remain at the gate to relay messages. Those inside shall interpret, first rinsing their mouths with water before speaking and again afterward—this must not be neglected. Arrange the altar, courtyard, halls, and chambers with beds, curtains, tables, incense vessels, mats, wells, screens, and hangings, ensuring all is clean, secure, and complete. The kitchen, well, stove, bathhouse, and latrines must all be suffused with fine incense to prevent foul qi from spreading and defiling the dwelling.\n\nEach latrine must be designated for specific use—sitting or lying down—without overlap. High and low must not intermingle, lest all incur calamity. To prevent misfortune and seek blessings, one must exercise utmost caution.\n\nOn the evening of the ritual assembly, some may eat while others do not; beverages and medicines vary, but all must bathe alike. Even for prolonged fasts, bathing remains essential. Adjust words and intentions, announce one’s presence at the hour of rest, enter the chamber with solemn purity, and follow the usual morning rites.\n\nWhen performing the Great Repentance and reciting the text, a chanter shall intone the names and titles. The Dharma-teacher strikes the teeth thirty-six times, then kneels and holds the text as follows:\n\n*Great Mystery Capital Three Caverns Dharma-teacher, [Name] of [Sacred Peak], Lesser Self Perfected of the Three Luminaries, disciple practicing the Great Cavern Scripture. If not yet received into the Three Caverns, simply state: Disciple of the Supreme Mystery Capital Jade Capital Purple Palace Celestial Chamber Three Luminaries, Great Cavern Dharma-teacher, Lesser Self Perfected, [Name] of [Sacred Peak], Lady [Name].*\n\n*[Names of Lords, Ministers, Concubines, and Servants], reverently address the Supreme Boundless Great Dao, the Three Origins Supreme Perfected August Elders, the Highest Celestial Capital High August Jade Emperor, the Nine Mysteries Dao Lord, the Boundless Heavenly Worthy, the Supreme Cavern Mystery Natural Vacant Sovereign, the Five Directions and Five Emperors, the Flying Immortals of the Five Peaks, the Jade Bureau and Golden Towers, and all divine officials. Your humble servant, [Name], unworthy and foolish, has presumptuously received the Supreme Dao, filled with joy and gratitude, yet also trembling with awe and shame. Unable to devote myself fully to the wondrous Dharma or swiftly ascend to immortality, I have drifted through the worldly realm, accumulating faults and transgressions. Days and months pass swiftly, but life is fleeting. I constantly fear sudden demise, never to return, and am struck with sorrow, my heart and viscera rent with pain. I rely upon your mysterious compassion to bestow mercy and protection.*\n\n*Now, in this era of purgation, I have fortunately encountered the path to deathlessness. Though my polluted body has long forgotten its sins, I vow to aspire to the arts of longevity. Prostrating before the Eightfold Dao’s register of destinies and the Eightfold Essential Texts, gazing upon the Three Primes, I honor the Eight Venerables. Through the repentance ritual, I seek to untangle the coils of sin, disperse past and future calamities, and attain immortality. Undeterred by my worthless existence, I pledge to cultivate this practice. If acting on behalf of another, state: \"Now there is a teacher, friend, esteemed lord, elder, parent, child, or disciple [Name], who has received this Dharma. Due to illness, hardship, or worldly obligations, they cannot perform the ritual themselves. Through your servants’ entreaty, we focus our minds as prescribed, united in purpose and daring to present these words on their behalf, reverently reciting them for your hearing.\"*\n\n*In accordance with the rites, we have prepared offerings and secretly adhered to the essential instructions. With purified hearts and solemn words, we reverently recite for your hearing.*\n\n*[Name], Daoist Disciple and Libationer of [State, Commandery, Village], disciple of the [Cavern] School, your humble servant [Name], aged [X] years, of [X] household members, currently residing at [Location], prostrates in repentance, seeking grace and pardon. Those joining in this entreaty shall list their village, rank, and names.*\n\n*Your humble servant [Name], base and foolish, a mere sprout of the earth, has fortunately, through good karma, received the wondrous Dharma and bears the profound and boundless debt of mysterious grace. Yet, born and raised in the vulgar world, I have grown accustomed to evil and wasted time, accumulating faults in movement and stillness, day and night. Though I have received scriptures and precepts, I have failed to cultivate them. Now, in this era of disasters and poisons, facing the time of purgation, I fear becoming mere dust, struck with sorrow and dread. Like the sparrow and mouse, I cling to life; like the mayfly and reed, I yearn to live. Undeterred by my polluted state, I dare to seek the blessings of advancement.*\n\n*On [Date] at [Location], I received from the Dharma-teacher [Name] the [Scripture/Precept], essential methods, wondrous arts, secret texts, and treasured instructions, totaling [X] volumes in [X] bundles. Or, in the year of [Celestial Stem] under the reign of [Year], on [Date] at [Location], due to [Circumstance], I obtained [X] volumes. On [Date] at [Location], I entered the Mysterious Covenant.*\n\n*Filled with joy and delight, I vowed to uphold and practice them, hoping to fulfill my long-held wishes. On [Date] at [Location], I suddenly fell ill with [Disease], or encountered [Public/Private Calamity], as the case may be. Anxious and fearful, I worried for my survival. Or, I was born sickly, impoverished, and distressed, orphaned young or solitary in old age, forsaken by heaven and man—[describe circumstances]. Truly, my past sins run deep, and my present transgressions are grave, bringing this misfortune upon me. Ashamed and terrified, I dare not complain.*\n\n*Upon reflection, my sinful self deserves annihilation; how dare I presume to trouble your hearing? Yet, relying upon your mysterious compassion, which embraces all dust and filth, bestows goodness, and perfects even the slightest merit, I humbly purify my heart and body, fast, and prostrate in repentance. I beg for renewed grace, the profound mercy of triple forgiveness, the dissolution of disasters and illnesses, the resolution of official matters, the restoration of balance, and the extension of my years. I vow never to transgress again, to reform and renew myself, to cultivate the Dharma I have received, and to attain the limit of immortality’s seed. May I now receive your inscription and bear the grace of your perfecting mercy.*",
      "overlap_context": " of the Eightfold Dao**\nObserve the four seasons, six affairs, eight solar terms, five phases, twenty-four qi, the virtues of faith and earthly works, encompassing both inner and outer—thus, there are no longer repentances for the four seasons.\n\n**In performing mutual repentance, none may accept the offerings of the host’s refined altar in four categories.** Upon concluding the repentance and gratitude, the four categories of offerings are to be distributed in silence, without others’ awareness.",
      "start_char": 4864,
      "end_char": 6102,
      "start_sentence": 204,
      "end_sentence": 230,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.695417642593384,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上八道命籍经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "谨辞。 某号某年太岁某，某月朔某日子某时，於某州郡县乡里山馆，奉辞情慊款，特乞恩矜，赐如所请，赐允所祈，原罪降福，道德兴隆，功业成就，必获神仙。 谨习诵戒律，遵行秘言，千魔降伏，万神卫门，九真使者，传说所陈，径御九玄玉帝几前，明晨行道，续复上闻。 启毕，起巡行，诵智慧三首，毕，向北心礼十方竟，巡行至东向西，说七报七伤，诵观身大戒。 未能谙者，执文读之。 七报如左： 真人曰：负阴抱阳，因缘各异，舍死得生，果报不同，为善善至，为恶恶来，如影随形，毫分无谬。 善恶多端，福报难数，大而言之，其标有七。 一者先身施功布德，救度一切，今身所行，与先不异，必得化生福堂，超过八难，受人之庆，天报自然。 二者先身好学，志念神仙，崇奉玄科，敬信灵文，念善改恶，立行入真，今身所行，与先不异，得接帝皇，名书紫简，上升玉晨。 三者先身乐道，不惮苦寒，随师执役，唯劳为先，饥渴务效，不生怨言，今身所行，与先不异，得策飞耕，游宴五岳，乘虚落烟。 四者先身贞洁，不淫不奸，不贪不欲，见色无欢，心如死灰，执固道源，今身所行，与先不异，得报灵人，超度三涂，五苦不经。 五者先身施善，愿天普隆，同得升度，去离八难，众身不过，己身不安，割己之服，以拯穷寒，损粮饷乌，遗物空山，今身所行，与先不异，四司称善，感彻玉皇，书名紫简，礼补上仙。 六者先身忠孝，恭奉尊亲，崇敬胜己，宗礼师君，腹目相和，如同一身，心无嫉妬，口无轻言，内外齐并，动止合真，今身所行，与先不异，得受灵人，不经三涂，超过八难，善善相注，福福相因，如此之报，道岂负人。 七者生世不良，怀恶抱奸，攻伐师本，訾毁圣文，不崇灵章，疑二天真，外形浮好，假求华荣，口是心非，行负道源，窃盗经书，不盟而宣，泄露秘诀，流放非真，今身所行，与先不异，违科犯忌，身入罪源，七祖横罹，责及穷魂，身死负掠，食火践山，三涂五苦，万劫不原，楚挞幽夜，痛切其身。 夫欲修学，熟寻此文，改恶行善，速登神仙。 七伤如左： 真人曰：学贵六合，宜慎七伤。 第一之伤，带真行伪，淫色丧神，魂液泄漏，精光枯乾，炁散魄零，骨空形振，神泣穷府，上闻天关，真仙远逝，则与凡尘结因，土府同符，岂复得仙。 第二之伤，外形在道，皮好念真，而心抱阴贼，凶恶内臻，愿人破败，嫉能妬贤，口美心逆，面欢内嗔，形论得失，妄造罪原，毁谤同学，攻伐师根，三官所记，摽为恶门，仙真高逝，邪魔攻身，走作形景，飞散体神，故令枉横，极其恶源，考满形灰，灭己九泉，图有玄名，岂保自然。 第三之伤，饮酒洞醉，损炁丧灵，五府攻溃，万神振惊，魂魄飞散，内外朽零，本室空索，赤子悲鸣，真仙高逝，邪魔入形，如此之学，徒损精诚，虽有玄记，空失玉名，神升上宫，身灰幽冥，恍惚延年，焉得久停。 第四之伤，行不敬物，责人宗匠，心忿口形，骂詈无常，嗔喜失节，意性乖常，炁激神散，内真飞扬，魄离魂逝，九孔尘埃，五府奔丧，皆由性之不纯，行之不祥，真仙高逝，外痾入形，如此之学，将欲何蒙，虽有玄图，不免斯殃，望仙日悠，地理日长。",
      "translated_text": "With reverent words, I hereby declare:\n\nOn the [day] of the [month], in the year of the [celestial stem] under the Great Year [Tai Sui], at the hour of [zodiac sign], in the mountain lodge of [village], [district], [county], [prefecture], I, [name], humbly present my earnest plea, beseeching your compassion and grace. Grant what I have requested, fulfill what I have prayed for—absolve my sins and bestow blessings, let the Dao and virtue flourish, let merits and deeds be accomplished, and may I surely attain the state of divine immortality.\n\nI diligently recite the precepts and observe the secret teachings, subduing the thousand demons and securing the protection of the ten thousand spirits. The Nine Perfected Envoys shall transmit my supplication, presenting it directly before the throne of the Jade Emperor of the Nine Mysteries. At dawn, I shall perform the Daoist rites and once more submit my plea.\n\nWhen the invocation is complete, I rise and circumambulate, reciting the Three Stanzas of Wisdom. Upon finishing, I face north and bow in reverence to the ten directions. Then, proceeding eastward to face west, I recite the Seven Retributions and Seven Harms, and chant the Great Precepts of Bodily Observation. For those not yet familiar, I hold the text and read aloud.\n\n**The Seven Retributions are as follows:**\n\nThe Perfected One says: Embracing yin and holding yang, causes and conditions differ; forsaking death to attain life, karmic retribution varies. Good begets good, evil begets evil—like a shadow following form, not a hair’s breadth in error.\n\nGood and evil are manifold, and their blessings and retributions innumerable. Speaking broadly, their manifestations number seven:\n\n1. In a former life, one performed meritorious deeds and spread virtue, delivering and saving all beings. If one’s conduct in this life remains unchanged, one shall be reborn in a hall of blessings, transcend the Eight Difficulties, receive human felicity, and enjoy the natural rewards of heaven.\n\n2. In a former life, one was devoted to learning, aspired to divine immortality, revered the mysterious precepts, and held the sacred scriptures in faith. One repented of evil and embraced goodness, establishing practices to enter the realm of the Perfected. If one’s conduct in this life remains unchanged, one shall be received by the Thearchs, one’s name inscribed on the Purple Tablets, and ascend to the Jade Dawn.\n\n3. In a former life, one delighted in the Dao, unafraid of hardship or cold, serving one’s master with diligence, prioritizing labor, enduring hunger and thirst without complaint. If one’s conduct in this life remains unchanged, one shall ride the flying plow, roam and feast upon the Five Peaks, and traverse the void like drifting mist.\n\n4. In a former life, one was pure and chaste, neither licentious nor deceitful, neither greedy nor desirous, unmoved by beauty, with a heart like dead ashes, firmly rooted in the source of the Dao. If one’s conduct in this life remains unchanged, one shall be rewarded with the company of numinous beings, transcend the Three Paths, and avoid the Five Sufferings.\n\n5. In a former life, one performed good deeds, wishing for universal prosperity, that all might ascend and transcend the Eight Difficulties. Though others did not suffer, one could not bear one’s own comfort, giving away one’s own garments to relieve the destitute and cold, sharing food with crows, and leaving offerings in desolate mountains. If one’s conduct in this life remains unchanged, the Four Administrations shall praise one’s virtue, moving the Jade Emperor to inscribe one’s name on the Purple Tablets and elevate one to the rank of Perfected Immortal.\n\n6. In a former life, one was loyal and filial, reverently serving one’s elders and superiors, honoring those more accomplished, and respecting one’s teachers and lords. One’s heart and eyes were in harmony, as if one body, free from jealousy or careless speech. One’s inner and outer conduct were aligned, every movement in accord with the Perfected. If one’s conduct in this life remains unchanged, one shall be received by numinous beings, avoid the Three Paths, transcend the Eight Difficulties, and enjoy the mutual infusion of goodness and blessings. Such is the retribution—how could the Dao ever fail one?\n\n7. In this life, one is wicked, harboring malice and deceit, attacking one’s teachers, slandering sacred texts, disdaining the numinous scriptures, and doubting the Two Heavenly Perfected Ones. Outwardly, one feigns goodness, seeking vain glory, speaking with a forked tongue, acting contrary to the source of the Dao. One steals scriptures without swearing an oath, recklessly divulging secret formulas, and spreading false teachings. If one’s conduct in this life remains unchanged, one shall violate the precepts and transgress taboos, falling into the source of sin. One’s seven ancestors shall suffer calamity, and one’s destitute soul shall be held accountable. Upon death, one shall endure torment, feed on fire, tread upon mountains, and suffer the Three Paths and Five Agonies for ten thousand kalpas without reprieve. In the dark of the netherworld, one’s body shall be lashed with pain.\n\nThose who wish to cultivate and learn must carefully study this text, reform evil, and practice goodness to swiftly ascend as divine immortals.\n\n**The Seven Harms are as follows:**\n\nThe Perfected One says: In learning, one must harmonize the Six Directions and beware of the Seven Harms.\n\n1. The first harm: outwardly embracing the Perfected while inwardly acting falsely, indulging in lust and dissipating one’s spirit. One’s ethereal soul leaks, essence and light wither, qi scatters, and the corporeal soul disperses. One’s bones hollow, one’s form trembles, and the spirits weep in the exhausted palaces. This is heard at the Gate of Heaven, and the Perfected Immortals flee far away. One then forms karmic ties with the mundane world, becoming akin to the Earthly Bureau. How can one ever attain immortality?\n\n2. The second harm: outwardly appearing to follow the Dao, with a demeanor of reverence for the Perfected, yet inwardly harboring malice, allowing wickedness to fester. One wishes for others’ ruin, envies the capable, and resents the worthy. One’s speech is fair, but one’s heart is perverse; one’s face is joyful, but one’s heart is wrathful. One judges others’ gains and losses, recklessly creates the source of sin, slanders fellow students, and attacks one’s teacher’s foundation. The Three Offices record this, marking one as an evil portal. The Perfected Immortals depart, and demonic forces assail one’s body, causing one’s form to wander and one’s spirit to scatter. Thus, one suffers unjust calamities, reaching the depths of evil. When one’s allotted years are exhausted, one’s form turns to ash, and one is extinguished in the Nine Springs. Though one may have a name in the mysterious records, how can one preserve one’s natural state?\n\n3. The third harm: drinking to utter intoxication, damaging one’s qi and dissipating one’s spirit. The Five Palaces collapse, and the ten thousand spirits are startled. One’s ethereal and corporeal souls scatter, and one’s inner and outer being decay. One’s original chamber is left empty, and the Red Child wails in sorrow. The Perfected Immortals depart, and demonic forces enter one’s form. Such learning only wastes one’s essence and sincerity. Though one may have a name in the mysterious records, one’s jade-like reputation is lost in vain. One’s spirit ascends to the Upper Palace, while one’s body turns to ash in the dark netherworld. Though one may linger in a state of confusion, how can one endure for long?\n\n4. The fourth harm: failing to respect others, disparaging one’s teachers and masters, harboring resentment in one’s heart and expressing it in speech, cursing and reviling without restraint. One’s anger and joy lack moderation, and one’s temperament is perverse. One’s qi surges, and one’s spirit scatters; one’s inner Perfected flees, and one’s corporeal soul departs. The nine orifices gather dust, and the Five Palaces flee in disarray—all due to one’s impure nature and inauspicious conduct. The Perfected Immortals depart, and external afflictions enter one’s form. With such learning, what can one hope to gain? Though one may possess the mysterious charts, one cannot escape this calamity. The days of aspiring to immortality grow distant, while the netherworld’s trials lengthen.",
      "overlap_context": "bly purify my heart and body, fast, and prostrate in repentance. I beg for renewed grace, the profound mercy of triple forgiveness, the dissolution of disasters and illnesses, the resolution of official matters, the restoration of balance, and the extension of my years. I vow never to transgress again, to reform and renew myself, to cultivate the Dharma I have received, and to attain the limit of immortality’s seed. May I now receive your inscription and bear the grace of your perfecting mercy.*",
      "start_char": 6102,
      "end_char": 7362,
      "start_sentence": 231,
      "end_sentence": 252,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.358675479888916,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上八道命籍经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "第五之伤，或玄图表见，得受宝经，或运值灵师，启授神文，而不依科盟，形泄天真，未经九年，投刺名山，使青宫有录，金阙结篇，便传於人，流散世间，轻真泄宝，考结己身，徒有玄名，反累七玄，仙道高逝，身死幽泉，长充鬼责，万劫不原。 第六之伤，身履淹精，灵关失光，五神飞散，赤子骞扬，邪魔来攻，内外交丧，如此之学，望成反伤，真仙高逝，空景独行，沦於混浊，仙胡可蒙。 第七之伤，啖食六畜之肉，杀害足口之美，臭炁充於藏府，伐生刑於非己，真炁扰於灵门，游神骇於赤子，魂魄游於宫宅，浊滞缠於口齿，仙真高登於玉清，己身沉顿於地里，徒有玄名帝简，亦不兔於必死。 高圣帝君曰：为学之本，当以七伤为急，既得瞻盻洞门，披睹玉篇，不犯七伤之禁，将坐待灵降，白日升晨。 如外勤存学，内不遣於七伤者，此将望成而反败，期生而反亡，希吉而反凶，求飞而反沉，灵仙游於高清，五神散於八荒，赤子号泣於中宅，游魂悲呜於玄空。 故仙相有成败，上学有七伤，笃尚之士，熟精其真。 诸有神挺应图，琼胎紫虚，名题东华，得见七伤检文。 自无此挺，灵篇不可得而妄披，宝文不可得而辄看。 见此文者，玄质合仙，九年修行，克得飞行玄虚，上升玉清。 诵戒从第五始，为第至后还前，取第一周第四讫，不须读前后序说。 文多不重书，临时读别卷。 诵戒毕，起向前灯，叩齿三通，密咒明灯颂三首： 太上散十方，华灯通精诚。 诸天皆赫然，诸地悉朗明。 我身亦光彻，五藏生华荣。 炎景照太无，遐想繁玉清。 丹精寄太元，玄肠空中响。 含形灭苦根，幽妙至真想。 垂华不现实，因缘示光象。 我身亦如之，乘化托流景。 夜光表阳丹，苕苕照灵室。 诸灯普光显，诸阴即已灭。 我神亦聪明，常玩智与慧。 逍遥适道运，迁谢任天势。 举形蹑空洞，夜烛焕流华。 咒竟，还西向东，复炉出，诵咒嗽还房，动止皆如朝仪。 明旦丑时，同起清严，寅时登台至户，嗽咒存师，亦如朝仪。 凡不师世师，启告玄盟者，存玄师青童君在方诸官，愿赐降现，□诀长生，神仙速就，宣化无穷。 存师竟，仍临目叩齿三十六通，咒曰： 北帝大魔王，受事帝君前，泉曲之鬼，四明酆山，千妖混形，九首同身，神虎放毒，馘灭雷震，真音神公，吐咒所戮，无亲太微，有命摄录，山川鸣铃，交掷流焕，九天风火，征伐神锋，十陈凶试，伏灭万精，枭残妖毒敢起，受闭三关，请依洞法，莫不如言。 毕，又叩齿三十六，发炉，别叩齿也。 发炉竟，向北长跪，亦可小坐，叩齿三十六通，出官： 谨出臣妾某等身中，四肢五体玉门紫阁三十九户上真灵官、左右飞仙、玉虚侍郎、五帝五色元皇太真、飞龙功曹、神仙使者，各三十六人。 玉虚侍郎执飞仙羽节，九色耀天之麾； 五帝五色元皇太真，手执五帝命魔灵幡； 飞龙功曹，冠带羽服金真凤章； 神仙使者交绕七元，擎持玉案，对立臣妾等前，衔臣妾等口中秘言，乘金根紫盖丹辕琼舆飞云之轮，从金仙玉童、太华玉女各十二人，左右龙虎腾天羽骑二十四万众，飞行紫虚，上登九天之上金阙玉殿琼房丹室之内，上启上上无极无穷至上洞真九玄元父、太虚玄母、元始天王、高上玉虚万道丈人、郁单无量天王、上上禅善无量寿天王，须延天王、寂然天王、不骄乐天王、化应声天王、梵宝天王、梵迦摩夷天王、波梨答和天王、七十四天帝、三十六天王、三十六土皇、万始先生、三天玉童、九天丞相太真王、高上三十九帝、二十四玉皇、玄古先生、万始丈人、高上玉晨太上大道君、后圣金阙帝君、扶桑旸谷神王、四司五帝、南极上元禁君、西台龟母、上清太真玉保王、上相大司命高晨师、东海玉门青华小童君、泰清玄元上三天无极大道、太上老君、太上丈人、天帝君、九天仙都君、九炁丈人等，百千万重道炁，千二百官君，泰清玉陛下太极四真，无鞅数道上皇真人，无极天尊，炁系自然玄都元皇。",
      "translated_text": "The fifth harm: when one’s mysterious charts are revealed or one receives precious scriptures, or when one encounters a numinous master who imparts divine texts—yet fails to follow the precepts and covenants, outwardly leaking celestial perfection, and before completing nine years of practice, presents petitions to sacred mountains, causing the Azure Palace to record one’s name and the Golden Tower to compile one’s deeds, then transmits these to others, scattering them among the world—such reckless disclosure of the true and leakage of the sacred will bring retribution upon oneself. Though one may bear a transcendent name, it will instead burden the Seven Mysteries. The Dao of immortality ascends on high, while one’s body perishes in the nether springs, forever consigned to ghostly reckoning, never to be absolved through ten thousand kalpas.\n\nThe sixth harm: when the body lingers in defilement and impurity, the numinous barrier loses its radiance, the Five Spirits scatter and flee, the Red Child soars away, and demonic forces assail one from within and without—both inner and outer are lost. With such learning, one’s aspirations to attainment only invite harm. The Perfected Immortals ascend in solitude, while one sinks into turbid chaos, and immortality remains forever beyond reach.\n\nThe seventh harm: consuming the flesh of the six livestock, slaughtering creatures with hooves and mouths for their savor, filling the viscera with foul qi, inflicting death’s punishment upon the innocent, disturbing the true qi at the numinous gate, startling the wandering spirits of the Red Child, causing the hun and po to wander the chambers, and clogging the mouth and teeth with turbid stagnation. The Perfected Immortals ascend to the Jade Clarity, while one’s own body founders in the earthly realm. Though one may bear a transcendent name in the Emperor’s records, this will not exempt one from inevitable death.\n\nThe Most High Sagely Thearch declares: The foundation of learning lies in urgently guarding against the seven harms. Once one has gazed upon the gates of the cavern-heavens and perused the jade scriptures, if one does not transgress the prohibitions of the seven harms, one may sit and await the descent of the numinous, ascending at dawn into the light of day.\n\nIf one toils externally in study yet fails to dispel the seven harms within, this will lead to attainment turning into failure, life into death, fortune into misfortune, and flight into sinking. The numinous immortals wander the lofty clarity, while the Five Spirits scatter to the eight wilds. The Red Child wails within the central chamber, and the wandering soul laments in the dark emptiness.\n\nThus, the path to immortality has its successes and failures, and superior learning entails the seven harms. Those who earnestly revere the Dao must thoroughly refine their true nature.\n\nAll who are divinely endowed and aligned with the charts, whose jade embryos dwell in the Purple Void, whose names are inscribed in the Eastern Florescence—having beheld the text on the examination of the seven harms—if they possess no such endowment, may not rashly peruse the numinous scriptures or casually view the sacred texts. Those who encounter this text are of a nature harmonious with transcendence; after nine years of cultivation, they may attain flight through the mysterious void and ascend to the Jade Clarity of the Highest Heaven.\n\nRecite the precepts beginning from the fifth, proceeding in order to the end and then returning to the start, completing one cycle at the fourth, without reading the prefaces or postscripts. As the text is lengthy and not repeated, refer to separate scrolls when reciting.\n\nUpon completing the recitation of the precepts, rise and approach the lamp, strike the teeth three times, and silently recite the Lamp-Brightening Incantation three times:\n\nThe Most High scatters light in the ten directions,\nFlowering lamps convey sincerity.\nAll heavens blaze resplendent,\nAll earths shine with clarity.\nMy body, too, becomes luminous,\nThe five viscera blossom with splendor.\nFiery radiance illumines the Great Void,\nFar-reaching thoughts flourish in the Jade Clarity.\n\nCinnabar essence abides in the Great Origin,\nMysterious intestines resound in emptiness.\nEmbracing form, eradicating the roots of suffering,\nContemplating the profound and true.\nHanging blossoms reveal no substance,\nCausal conditions manifest as light and image.\nMy body is likewise transformed,\nRiding transformation, entrusting to the flowing radiance.\n\nNight’s light reveals the yang elixir,\nShining brightly in the numinous chamber.\nAll lamps universally radiate brilliance,\nAll yin is extinguished.\nMy spirit, too, becomes keen and bright,\nEver delighting in wisdom and insight.\nCarefree, I follow the Dao’s course,\nChanging and yielding to heaven’s decree.\n\nRaising my form, I tread the empty cavern,\nNight’s candle gleams with flowing splendor.\n\nWhen the incantation is finished, turn from west to east, return the incense burner, and recite the incantation to clear the throat before retiring to the chamber, observing all movements as in the morning rites.\n\nAt dawn the next day, at the hour of *chou*, rise with solemn purity. At the hour of *yin*, ascend the platform to the door, clear the throat, recite the incantation, and visualize the master—all as in the morning rites.\n\nFor those who have not taken a worldly master and seek to invoke the mysterious covenant, visualize the Azure Lad of the Mysterious Master in the Palace of the Square Cauldron, beseeching his descent and manifestation, □ the secret of longevity, and swift attainment of immortality, that the dissemination of transformation may be boundless.\n\nUpon completing the visualization of the master, close the eyes, strike the teeth thirty-six times, and recite the incantation:\n\nBefore the Great Demon King of the Northern Thearch,\nBefore the Lord Who Receives Affairs,\nGhosts of the Yellow Springs’ bends,\nThe Four Luminaries of Mount Feng,\nA thousand demons mingling forms,\nNine-headed beings sharing one body,\nDivine tigers releasing venom,\nDecapitating with thunderous might,\nTrue tones of the divine lords,\nUttering curses of execution,\nNo kinship with the Great Tenuity,\nYet by command they seize and record.\nMountains and rivers ring with bells,\nIntertwining radiance flows and flashes.\nNine heavens’ winds and fires,\nWield the divine blades of subjugation.\nTen trials of the inauspicious,\nSubduing and extinguishing the myriad spirits.\nShould any demonic toxin dare rise,\nIt shall be sealed within the Three Passes.\nI invoke the cavernous laws—\nLet none disobey these words.\n\nUpon completion, strike the teeth thirty-six times again, open the incense burner, and strike the teeth once more.\n\nWhen the incense burner is opened, kneel facing north (or sit slightly), strike the teeth thirty-six times, and summon the officials:\n\nWith reverence, I summon from within the body of your servant [Name]—from the four limbs, five constituents, Jade Gate, Purple Chamber, and thirty-nine portals of the Upper Perfected—\nthe numinous officials of the left and right flying immortals,\nthe Jade Clarity Attendants,\nthe Five Emperors and Five-Colored Primordial August Perfected,\nthe Flying Dragon Merit Clerks,\nthe Divine Immortal Envoys—\nthirty-six of each.\n\nThe Jade Clarity Attendants wield the feathered tablets of the flying immortals, their nine-colored banners illuminating the heavens;\nThe Five Emperors and Five-Colored Primordial August Perfected hold the life-controlling demonic banners of the Five Emperors;\nThe Flying Dragon Merit Clerks, adorned in feathered robes and golden true phoenix insignia;\nThe Divine Immortal Envoys, intertwining the Seven Origins, bearing jade tablets, standing before your servant—\nthey receive the secret words from your servant’s mouth, ascend the golden root, purple canopy, cinnabar shafts, and jade carriage of flying clouds’ wheels, accompanied by twelve Golden Immortals and Jade Lads, twelve Great Flower Jade Maidens, twenty-four myriad hosts of left and right dragon-tiger soaring feathered riders, flying through the Purple Void, ascending to the Golden Tower Jade Palace, the jasper chambers and cinnabar halls within the nine heavens above.\n\nThey ascend to report to the Supreme, Boundless, and Utmost Cavern-True Nine Mysteries Primordial Father;\nthe Great Void Mysterious Mother;\nthe Primordial Heavenly Thearch;\nthe Most High Jade Clarity Myriad Dao Venerable;\nthe King of the Immeasurable Heaven of Yu Shan;\nthe King of the Utmost Good Immeasurable Longevity Heaven;\nthe King of Xu Yan Heaven;\nthe King of Silent Heaven;\nthe King of Unarrogant Joy Heaven;\nthe King of Responsive Transformation Heaven;\nthe King of Brahma Treasure Heaven;\nthe King of Brahma Kama Heaven;\nthe King of Pari-Dhava Heaven;\nthe seventy-four Heavenly Thearchs;\nthe thirty-six Heavenly Kings;\nthe thirty-six Earthly Sovereigns;\nthe Venerable of the Myriad Origins;\nthe Jade Lads of the Three Heavens;\nthe Nine Heavens’ Chancellor, the Perfected King of Great Truth;\nthe thirty-nine Highest Emperors;\nthe twenty-four Jade Thearchs;\nthe Venerable of the Mysterious Antiquity;\nthe Venerable of the Myriad Origins;\nthe Most High Jade Dawn, the Great Dao Lord of the Supreme;\nthe Golden Tower Thearch of the Later Saints;\nthe Divine King of Fusang’s Yang Valley;\nthe Four Controllers and Five Emperors;\nthe Southern Culmen’s Upper Prime Lord of Prohibitions;\nthe Western Terrace’s Tortoise Mother;\nthe Jade Guardian King of the Supreme Clarity;\nthe Highest Minister of Destiny, the Great Controller of the Dawn;\nthe Azure Lad of the Jade Gate of the Eastern Sea;\nthe Great Dao of the Supreme Three Heavens of the Great Void of Tai Qing;\nthe Most High Lord Lao;\nthe Most High Venerable;\nthe Heavenly Thearch Lord;\nthe Lord of the Nine Heavens’ Immortal Capital;\nthe Venerable of the Nine Qi—\nthe hundred thousand myriad layers of Dao qi,\nthe twelve hundred official lords,\nthe Four Perfected of the Supreme Polarity beneath the Jade Steps of Tai Qing,\nthe countless Highest August Perfected of the Dao,\nthe Heavenly Worthy of the Boundless—\nthe qi of the natural Mysterious Capital’s Primordial August.",
      "overlap_context": "’s spirit scatters; one’s inner Perfected flees, and one’s corporeal soul departs. The nine orifices gather dust, and the Five Palaces flee in disarray—all due to one’s impure nature and inauspicious conduct. The Perfected Immortals depart, and external afflictions enter one’s form. With such learning, what can one hope to gain? Though one may possess the mysterious charts, one cannot escape this calamity. The days of aspiring to immortality grow distant, while the netherworld’s trials lengthen.",
      "start_char": 7363,
      "end_char": 8872,
      "start_sentence": 253,
      "end_sentence": 289,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 53.90072178840637,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上八道命籍经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "大洞三景弟子小兆真人，某岳先生、夫人元君臣妾等本生胎秽，遭遇灵运，因缘福庆，轮转法门，得生人道，忝蒙高虚余光曲映，启悟愚蒙，得以臭质，仰披圣文。 法师、道士、男女真人姓名，以某年月日时於某处，授臣妾某高玄九天龙书凤章，太上玉简三清宝文，如干卷、如干符、如干诀。 或先人某承受某师上清宝经，世世相传。 或因缘所遇，某年月日时，於某处所得。 供养研寻，周览反覆，谘请师尊，解释疑滞，或即年寻师，不能相值，某年月日时，某处玄盟。 誓愿遵修，以果心愿。 但生长五浊，而叨慕三清，身染秽累，日月迁延，未能腾景，浮轮九玄，沉沦下世，业行多违，戒律亏替，举止罹愆，四司所执，结罪科门。 敢缘圣典，盟授斋文太真三元要诀三品，上应九玄，合丹镇生； 中应六合，以解己身犯科违戒，宿结之愆； 下应三才，拔度七祖，释九阴之责，上死魂生天。 此高上妙法，求仙之本根，臣某等贪道乐真，志愿修行。 某或诵经戒，或合丹精，今未合者云：比欲经营药物，神仙要方，合和神丹，或禁丸散酒饵。 自虑无始中来，因缘粗浅，今功尚薄，合和不成； 又恐宿新动止破戒违经，幽显罪鄣日结日缠，未能解释，善志弗申； 又惧亿曾万祖、七世父母生平衅重，沉沦三涂，流连五苦，未获升迁，余殃流注，延逮后生，致祈真难感，魔试易干，兼揆前后普斋都谢，精诚漫昧，不蒙矜原。 今依八道妙旨，的谢先后深愆，忖度心识，推准所行，今有某事云云，谨以某物某事证明至诚，依科辞列，曷黩上闻，辞同宿启。 辞情款到，特乞哀怜，即日入室，登斋诵经，行道存师，思神念真，烧香燃灯，朝礼玉天，修行方术合药云云。 悔罪谢过，拔赎深愆，建立功德，拯度九玄、七祖父母，中外先亡，解释宿根，脱出幽夜，上升南宫，穷魂受度，转身生天； 或在道门逍遥福乐，与真结缘，流恩布泽，润洽后昆，使臣妾恶罪即释，某云善事光新，特从高上无极天尊，乞垂曲映，鉴臣某等所陈，请烦三宝领仙侍郎、五方五帝监灵大夫、监斋大神、典斋使者、真斋上真，神仙飞仙天仙地仙五岳灵仙，兵马骑乘各九亿万众，一合降下，营护臣妾等身，灭魔消试，辟凶禳患，招致九天自然正气，金液丹精芝英，神仙交会斋堂坛墠，洞映臣妾等身，玉童玉女侍卫香烟，令臣某等行道得道，求仙得仙，飞行太空，腾景九天，举心愿念，与三宝齐真，七玄父母拔度三涂，释九阴之责，死魂生天，一切诸天咸蒙度脱，某灾消三无，罪灭九阴，千愆万咎，并蒙哀原，某罪廓散，某事兴隆，免离十苦八难，克获神仙，被受太真八道八尊无极无量济度之恩。 修行事竟，启还本宫，惟蒙御达，须报奉行。 出官毕，回还向东，第一三上香，咒曰： 太玄都大洞三景弟子小兆真人，某岳先生，夫人元君，臣某姓名等，今斋直行道，思神念真，诵经启愿，飞腾九天，的谢三元，烧香然灯，持是功德，为臣某等解愆释罗，斩灭死根，降致正真，刻名上清，拔度九玄七祖、父母中外穷魂，断绝殃注，放散幽徒，永出地狱，上生天堂，免离五苦，受福南宫，输转成真，利佑见在，除臣某等千基万考，宿对恶缘，某罪洗荡，某事果成。",
      "translated_text": "The Lesser Manifestation Perfected of the Three Radiant Caverns of the Great Cavern,\nMaster of the Sacred Peak [Name], Lady Primordial of the [Name] Household,\nand their servant-retinue—\nborn of defiled wombs in this kalpa of numinous fortune,\nbound by karmic blessings to the wheel of dharma-gates,\nwe have attained human birth.\nBy the grace of the Highest Void’s lingering radiance, bent to illumine our benighted minds,\nwe, with our foul and mortal frames, dare to lift our gaze and pore over the sacred texts.\n\nThe Dharma-Master, Daoist adepts, male and female Perfected—[Names]—\non the [day, month, year, hour] at [location],\nconferred upon your servants [Names]\nthe Dragon-Script Phoenix-Chapters of the Nine Heavens of the Highest Mystery,\nthe Jade Tablets of the Three Clarities’ Treasure Texts—\nin [number] scrolls, [number] talismans, [number] oral transmissions.\nSome were received by our ancestors from their masters of the Supreme Clarity’s Treasure Scriptures,\npassed down through generations.\nOthers, encountered by karmic affinity,\nwere obtained on the [day, month, year, hour] at [location].\nWe have venerated, studied, and perused them repeatedly,\nconsulting our revered masters to resolve doubts and obstructions.\nYet in some years, seeking a master, we could not meet one—\nuntil the [day, month, year, hour] at [location], within the Mysterious Covenant,\nwe pledged to uphold and cultivate, fulfilling our heart’s vows.\n\nYet born and raised in the Five Turbidities,\nwe presumptuously aspire to the Three Clarities.\nOur bodies tainted by defilements, days and months pass in vain;\nwe have not soared on radiant wings, nor floated through the Nine Mysteries,\nbut sink into the lower worlds.\nOur deeds often transgress, precepts falter,\nour conduct incurs faults—\nthe Four Offices seize us, binding us to the gates of karmic retribution.\n\nDaring to rely on the sacred canon,\nwe receive the covenant of the Fast Texts and the Three Primordials’ Essential Oral Transmissions of the Three Grades of the Supreme Perfected,\nwhich above correspond to the Nine Mysteries, conjoining the elixir to guard life;\nin the middle, to the Six Harmonies, dissolving our own transgressions of precepts and karmic obstructions;\nbelow, to the Three Powers, delivering the Seven Ancestors,\nreleasing the debts of the Nine Yin,\nraising the dead to celestial rebirth.\n\nThis is the supreme and wondrous Dharma,\nthe root of seeking immortality.\nWe, your servants, [Names], greedy for the Dao and delighting in the Real,\nvow to cultivate and practice.\n\nSome recite scriptures and precepts,\nor refine the elixir with precision.\nFor those not yet accomplished, we declare:\nwe intend to prepare medicinal substances,\nthe essential formulas of divine immortality,\nto compound the divine elixir,\nor to refine pills, powders, and alchemical wines.\n\nYet we fear that from the beginningless kalpas,\nour karmic roots have been shallow,\nour present merits still meager,\nand the compounding may fail.\nWe dread that past and recent actions—\nbreaches of precepts, violations of scriptures—\ncause obstructions in the unseen and manifest realms,\nentangling us day by day,\nunresolved,\nour good intentions unfulfilled.\nWe tremble lest our myriad ancestors,\nour seven generations of parents,\nladen with heavy transgressions in life,\nsink into the Three Wretched Paths,\nwander through the Five Sufferings,\nunable to ascend,\ntheir residual calamities flowing down to later generations,\nmaking it difficult to invoke the Perfected,\nwhile demonic trials assail us easily.\nMoreover, reviewing past and present,\nour universal fasts and comprehensive repentances\nhave been tainted by insincerity,\nunworthy of compassionate pardon.\n\nNow, in accordance with the wondrous principles of the Eight Daoist Paths,\nwe sincerely repent our deep transgressions past and present,\nweighing our thoughts and measuring our deeds.\nRegarding the matter of [specific matter],\nwe humbly present [specific offering or act] as proof of our utmost sincerity.\nFollowing the prescribed liturgy, we dare not profane the ears of the august ones—\nour words echo those of former petitions.\nWith hearts sincere and supplications earnest,\nwe beseech your compassion:\nthis very day, enter the chamber,\nascend the fast, recite scriptures,\npractice the Dao, visualize the master,\ncontemplate the Perfected, meditate on the Real,\nburn incense, light lamps,\nworship the Jade Heaven,\ncultivate arts and compound medicines, and so forth.\n\nWe repent our sins, atone for transgressions,\nredeem deep karmic debts,\nestablish merit,\ndeliver the Nine Mysteries and Seven Ancestors,\nour inner and outer departed kin,\ndissolve karmic roots,\nfree them from the dark night,\nascend to the Southern Palace,\nwhere wandering souls receive deliverance,\ntransforming their bodies to be born in heaven.\nOr, abiding in the Dao’s gate, they may roam in blessed joy,\nforming bonds with the Perfected,\nflowing blessings and spreading grace to later generations,\nso that your servants’ evil sins may be absolved,\nand [Name]’s good deeds renewed and flourishing.\n\nWe implore the Highest and Boundless Heavenly Worthy\nto deign to cast your radiance,\nto witness the supplications of your servants [Names].\nWe entreat the Three Treasures,\nthe Immortal Attendant Gentlemen,\nthe Five Directions’ Five Thearchs,\nthe Inspectors of Numinous Powers,\nthe Supervisors of Fasts,\nthe Envoys of the Fast,\nthe Supreme Perfected of the True Fast,\nthe Divine Immortals, Flying Immortals, Celestial Immortals, Terrestrial Immortals,\nthe Sacred Peak Immortals of the Five Marchmounts,\nand the nine hundred million myriad hosts of cavalry and chariots—\nto descend as one,\nto encamp and protect your servants’ bodies,\nto extinguish demons and dispel trials,\nto avert misfortune and repel calamities,\nto summon the natural true qi of the Nine Heavens,\nthe golden liquid, elixir essence, and divine mushrooms,\nto gather in the fast hall and altar,\nilluminating your servants’ bodies,\nwith Jade Lads and Jade Maidens attending the incense smoke.\n\nMay your servants,\nin practicing the Dao, attain the Dao;\nin seeking immortality, attain immortality;\nsoar through the Great Void,\nascend on radiant wings to the Nine Heavens.\nMay their heartfelt vows and aspirations\nbecome as real as the Three Treasures,\nmay the Seven Mysteries’ parents be delivered from the Three Wretched Paths,\nthe debts of the Nine Yin released,\nthe dead reborn in heaven,\nall the heavens’ beings universally delivered.\nMay [Name]’s disasters dissolve in the Three Absences,\nsins vanish in the Nine Yin,\na thousand transgressions and myriad faults\nall receive compassionate pardon.\nMay [Name]’s sins be dispersed,\n[Name]’s affairs flourish,\nescaping the Ten Sufferings and Eight Difficulties,\nattaining divine immortality,\nreceiving the grace of the Supreme Perfected’s Eight Daoist Paths,\nthe Eight Venerables’ boundless and immeasurable salvation.\n\nUpon completing the cultivation,\nwe shall report back to our original abodes,\nhumbly awaiting your transmission.\nThe rites concluded, we return,\nfacing east,\nthrice offering incense,\nand recite the incantation:\n\nThe Lesser Manifestation Perfected of the Three Radiant Caverns of the Great Cavern of the Supreme Mystery Capital,\nMaster of the Sacred Peak [Name],\nLady Primordial of the [Name] Household,\nyour servants [Names]—\ntoday, in the fast and practice of the Dao,\ncontemplating the Perfected, meditating on the Real,\nreciting scriptures and invoking vows,\nwe soar to the Nine Heavens,\nsincerely repenting to the Three Primordials.\nBurning incense and lighting lamps,\nwe dedicate this merit\nto absolve your servants’ transgressions and dissolve entanglements,\nsever the roots of death,\nsummon the true and real,\ninscribe our names in the Supreme Clarity,\ndeliver the Nine Mysteries and Seven Ancestors,\nour parents and departed kin,\ncutting off the flow of calamities,\nreleasing the bound in darkness,\nforever escaping hell,\nascending to the celestial halls,\nfreed from the Five Sufferings,\nreceiving blessings in the Southern Palace,\ntransforming to become Perfected,\nbenefiting and protecting the living.\nWe eradicate your servants’ thousand karmic roots and myriad past obstructions,\nwashing away [Name]’s sins,\nfulfilling [Name]’s affairs.",
      "overlap_context": "vens of the Great Void of Tai Qing;\nthe Most High Lord Lao;\nthe Most High Venerable;\nthe Heavenly Thearch Lord;\nthe Lord of the Nine Heavens’ Immortal Capital;\nthe Venerable of the Nine Qi—\nthe hundred thousand myriad layers of Dao qi,\nthe twelve hundred official lords,\nthe Four Perfected of the Supreme Polarity beneath the Jade Steps of Tai Qing,\nthe countless Highest August Perfected of the Dao,\nthe Heavenly Worthy of the Boundless—\nthe qi of the natural Mysterious Capital’s Primordial August.",
      "start_char": 8872,
      "end_char": 10085,
      "start_sentence": 290,
      "end_sentence": 311,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 49.60557746887207,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上八道命籍经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "今归身归神归命无上九玄元始玉皇玉帝、太真郁单无量天王、上上禅善无量寿天王、须延天王、三十九帝、二十四真、九天丞相、高上玉晨太上大道君，万仙众圣，无极天尊，愿以是功德，归流臣某等身，解愆释罗，斩灭死根，降致正真，刻名上清，拔度七祖、中外穷魂，断绝殃注，放散幽徒，永出地狱，上生天堂，免离五苦，受福南宫，轮转成真，利佑见在，除臣某等千基万考，宿对恶缘，某罪洗荡，某事果成。 身神炼易，变化洞空，飞行玉清金阙之宫。 今故烧香，自归依高上至极天真，得道之后，升入无形，与三宝齐轮。 第二三上香曰： 臣妾等，今斋直行道，思神念真，诵经启愿，飞腾九天，的谢三无，烧香然灯，持是功德，愿为诸天十方无极无穷无量无央四垂边城诸名山隐学、已得道未得道法师、父母尊亲，及同学门人、道士贤者，普获升度，同免罪门，各得其道，飞腾上清。 臣妾七世父母，解脱忧苦，上生天堂，除臣妾等千基万考，宿对重愆如上。 归身归神归命太真三元九玄众圣万仙玉皇、无极元始高上玉帝、无上至极寂然天王、不骄乐天王、化应声天王、三十九帝、二十四真、九天丞相、高上玉晨太上大道君，万仙上圣无极天尊，愿以是功德，归流诸天十方无极无穷无量无央四垂边域诸名山隐学、已得道未得道法师、父母尊亲，及同学门人、道士贤者，普获升度，同免罪门，各得其道，飞行上清。 臣妾七世父母，解脱忧苦，上生天堂，衣食自然，除臣妾等千基万考，宿对重愆如上。 今故烧香，自归依虚无太真三元高圣、太上至真、高上无极至极天尊，得道飞仙，逍遥金阙，升入无形，与三宝齐轮。 第三三上香曰： 臣某等，今斋直行道，思神念真，诵经启愿，飞腾九天，的谢三元，烧香然灯，持是功德，为臣某等家门宗室、九族姻亲，普天匝地帝主国王、君臣吏民，治舍人民，及蝖飞蠕动、蚑行喘息一切众生，已生未生，咸乞生成。 臣某等家门千罪万过，普蒙哀原，惠及诸天一切众生。 归身归神归命九天高上众真、玉虚无极元始玉帝、太真无上至极九玄玉皇、梵宝天王、梵迦摩夷天王、波梨答和天王、三十九帝、二十四真、九天丞相、高上玉晨太上大道君，万仙上圣无极天尊，愿以是功德，归流臣某等家门九族姻亲，帝王国主、君臣吏民，治舍人民，及蝖飞蠕动、蚑行喘息一切众生，已生未生，咸得生成。 臣某等家门千罪万过，普蒙哀原，惠及诸天一切众生，并受升度广济之恩，免离十苦八难，五灾六害，九厄七伤，各保福禄，长居自然。 今故烧香，自归依高上无极天尊，得道飞仙，腾景九天，升入无形，与三宝齐轮。 三上香毕，向东唱礼如左： 臣妾等至心归命东方无极无始高上玉真大帝天尊。 三拜，拜毕，法师长跪读忏，余人悉伏听忏，至竟齐起，持身制意，慎勿参差。 忏曰： 臣某等，今建斋立直，行道存师，思神念真，诵经求仙，飞腾九天，烧香然灯，解拔宿愆，谢罪三元，归命东方无极元始高上玉帝太真天尊，乞垂曲映，原臣某等先世今世、先身今身的有某罪云云。 乞豁然涤荡，除故布新，罪目永灭，福名长存，赐臣某某厄得度，某事果成，学道得道，求仙得仙，飞行太空，腾景九天，七世父母免离三涂，上升南宫，福流无极，被受天尊济度之恩。",
      "translated_text": "Now we offer our bodies, spirits, and lives to the Supreme Nine Mysteries, the Primordial Jade Sovereign, the Jade Emperor, the Great Perfected of the Pure Land of Yu Shan, the Heavenly King of the Immeasurable Realm, the Heavenly King of Infinite Longevity in the Uppermost Meditation and Goodness, the Heavenly King of Xu Yan, the Thirty-Nine Emperors, the Twenty-Four Perfected, the Nine Heavenly Chancellors, the Supreme Jade Dawn Lord of the Great Dao, the Myriad Immortals and Holy Worthies, and the Boundless Heavenly Venerables. May this merit flow into the bodies of your servants, absolving transgressions and dissolving entanglements, severing the roots of death, summoning the true and real, inscribing our names in the Supreme Clarity, delivering the Seven Ancestors and all departed kin, cutting off the flow of calamities, releasing the bound in darkness, forever escaping hell, ascending to the celestial halls, freed from the Five Sufferings, receiving blessings in the Southern Palace, transforming to become Perfected, benefiting and protecting the living. We eradicate your servants’ thousand karmic roots and myriad past obstructions, washing away [Name]’s sins, fulfilling [Name]’s affairs.\n\nMay our bodily spirits be refined and transformed, traversing the empty void, soaring to the Jade Clarity and Golden Towers. Now we burn incense, taking refuge in the Supreme and Utmost Heavenly Perfected, that after attaining the Dao, we may ascend into formlessness, wheeling together with the Three Treasures.\n\n**Second Offering of Incense:**\nYour servants, in this fast and Dao-practice, meditating on the divine and invoking the real, reciting scriptures and invoking vows, soaring to the Nine Heavens, sincerely repenting to the Three Primordials, burning incense and lighting lamps, dedicate this merit to all hidden learners in the ten directions, the boundless, infinite, immeasurable, and endless four borderlands and sacred mountains—those who have attained the Dao and those who have not, the Dharma Masters, our parents and revered kin, fellow disciples, and worthy Daoists—may all universally attain deliverance, together escape the gates of sin, each realize their Dao, and ascend to the Supreme Clarity. May the seven generations of our parents be freed from sorrow and suffering, ascend to the celestial halls, and may we eradicate the thousand karmic roots and myriad past obstructions of your servants as above.\n\nWe offer our bodies, spirits, and lives to the Great Perfected of the Three Primordials and Nine Mysteries, the Myriad Immortals and Jade Sovereign, the Boundless Primordial Supreme Jade Emperor, the Utmost Heavenly King of Stillness, the Heavenly King of Unarrogant Joy, the Heavenly King of Responsive Transformation, the Thirty-Nine Emperors, the Twenty-Four Perfected, the Nine Heavenly Chancellors, the Supreme Jade Dawn Lord of the Great Dao, the Myriad Immortals and Holy Worthies, and the Boundless Heavenly Venerables. May this merit flow to all hidden learners in the ten directions, the boundless, infinite, immeasurable, and endless four borderlands and sacred mountains—those who have attained the Dao and those who have not, the Dharma Masters, our parents and revered kin, fellow disciples, and worthy Daoists—may all universally attain deliverance, together escape the gates of sin, each realize their Dao, and ascend to the Supreme Clarity. May the seven generations of our parents be freed from sorrow and suffering, ascend to the celestial halls, and be clothed and fed by nature. We eradicate the thousand karmic roots and myriad past obstructions of your servants as above.\n\nNow we burn incense, taking refuge in the Void and Supreme Perfected of the Three Primordials, the Utmost and Supreme, the Boundless and Utmost Heavenly Venerables, that we may attain the Dao, ascend as immortals, roam the Golden Towers, enter formlessness, and wheel together with the Three Treasures.\n\n**Third Offering of Incense:**\nYour servants, in this fast and Dao-practice, meditating on the divine and invoking the real, reciting scriptures and invoking vows, soaring to the Nine Heavens, sincerely repenting to the Three Primordials, burning incense and lighting lamps, dedicate this merit to our household and clan, the nine relations and in-laws, the emperors and kings of all under heaven, their ministers and officials, the people of their domains, and all living beings—creeping, crawling, slithering, and breathing—whether already born or yet to be born, may all be granted life and fulfillment. May the thousand sins and myriad transgressions of our household be universally pardoned, extending compassion to all beings in the heavens.\n\nWe offer our bodies, spirits, and lives to the Supreme Perfected of the Nine Heavens, the Jade Emperor of the Boundless Primordial Jade Void, the Utmost and Supreme Jade Sovereign of the Nine Mysteries, the Heavenly King of Brahma Treasure, the Heavenly King of Brahma Kāma, the Heavenly King of Pāriyātra, the Thirty-Nine Emperors, the Twenty-Four Perfected, the Nine Heavenly Chancellors, the Supreme Jade Dawn Lord of the Great Dao, the Myriad Immortals and Holy Worthies, and the Boundless Heavenly Venerables. May this merit flow to our household and nine relations, the emperors and kings, their ministers and officials, the people of their domains, and all living beings—creeping, crawling, slithering, and breathing—whether already born or yet to be born, may all be granted life and fulfillment. May the thousand sins and myriad transgressions of our household be universally pardoned, extending compassion to all beings in the heavens, that all may receive the grace of deliverance and salvation, escape the Ten Sufferings and Eight Difficulties, the Five Calamities and Six Harms, the Nine Tribulations and Seven Injuries, each preserving their blessings and emoluments, dwelling forever in the natural state.\n\nNow we burn incense, taking refuge in the Supreme and Boundless Heavenly Venerables, that we may attain the Dao, ascend as immortals, soar through the Nine Heavens, enter formlessness, and wheel together with the Three Treasures.\n\nAfter the three offerings of incense, facing east, we chant the obeisance as follows:\nYour servants wholeheartedly offer our lives to the Boundless and Primordial Supreme Jade Perfected Great Emperor and Heavenly Venerable of the East.\n*Three bows.* After bowing, the Dharma Master kneels to read the repentance, while the others prostrate to listen. When finished, all rise together, maintaining composure and focus, without haste or disorder.\n\n**Repentance:**\nYour servants, having established this fast and upright practice, cultivating the Dao and honoring the masters, meditating on the divine and invoking the real, reciting scriptures to seek immortality, soaring to the Nine Heavens, burning incense and lighting lamps to absolve past transgressions, repenting to the Three Primordials, offer our lives to the Boundless Primordial Supreme Jade Emperor and Great Perfected Heavenly Venerable of the East, beseeching your gracious illumination to pardon the sins of your servants—whether from past lives or this life, past bodies or this body—of [Name]’s transgressions, and so on.\nMay they be suddenly washed away, casting off the old and renewing, sins forever extinguished, blessings eternally preserved. Grant that [Name]’s tribulations be overcome, [Name]’s affairs fulfilled, the Dao attained through study, immortality achieved through seeking, soaring through the great void, ascending the Nine Heavens. May the seven generations of our parents escape the Three Wretched Realms, ascend to the Southern Palace, their blessings flowing boundlessly, receiving the grace of deliverance from the Heavenly Venerables.",
      "overlap_context": "me Clarity,\ndeliver the Nine Mysteries and Seven Ancestors,\nour parents and departed kin,\ncutting off the flow of calamities,\nreleasing the bound in darkness,\nforever escaping hell,\nascending to the celestial halls,\nfreed from the Five Sufferings,\nreceiving blessings in the Southern Palace,\ntransforming to become Perfected,\nbenefiting and protecting the living.\nWe eradicate your servants’ thousand karmic roots and myriad past obstructions,\nwashing away [Name]’s sins,\nfulfilling [Name]’s affairs.",
      "start_char": 10085,
      "end_char": 11347,
      "start_sentence": 312,
      "end_sentence": 332,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.61042404174805,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上八道命籍经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "毕，同叩头三下，抟颊三过止。 皆微微安徐，勿令有声也。 次东南、次正南、次西南、次正西、次西北、次正北、次东北、次上方西北、次下方东南。 十方忏悔，皆如东，悉三拜，亦可止一，亦可心三叩，抟不可阙，不得多及少。 次唱礼五方忏。 次向西唱：臣某等至心归命西方无上天尊，再拜。 法师小坐读愿，余人伏。 臣某等，今建斋立直，烧香然灯，解拔宿罪千咎万愆，的有某过云云。 愿从西方无上玄元空洞大始九玄元素玉真丈人、高圣上仙龟台玉妃、玉虚太灵无极天尊，垂恩曲映，特见哀原，拘除某过云云，赐某事云云，行道得道，求仙得仙，飞行太空，腾景九天，拔度七祖，上升南宫，长居无为，衣食自然，被受上圣济度之恩。 各三抟颊。 次向北唱，效西。",
      "translated_text": "Upon completion, all bow three times in unison, ceasing after three touches of the cheeks. All movements should be gentle and unhurried, without sound.\n\nNext, proceed to the southeast, then due south, southwest, due west, northwest, due north, northeast, the northwest of the upper realm, and the southeast of the lower realm. For the repentance in the ten directions, follow the same ritual as in the east: all bow three times, though one may suffice, or three prostrations may be made in the heart. The touching of the cheeks must not be omitted, nor may it be excessive or insufficient.\n\nNext, intone the invocation for repentance in the five directions.\n\nThen, facing west, chant: *\"Your servants [Name] and company, with utmost sincerity, take refuge in the Supreme Heavenly Venerable of the West, bowing twice.\"*\n\nThe Dharma Master sits briefly to recite the vow, while the others prostrate themselves.\n\n*\"Your servants [Name] and company, having established this fast and set forth this offering, burn incense and light lamps to dissolve and release the thousand transgressions and ten thousand faults of past sins—specifically, the errors of [Name], and so on. May the Supreme Primordial Void-Emptiness Great Origin Ninefold Mystic Essence Jade Perfected Lord of the West, the Lofty Sage and Supreme Immortal Jade Terrace Consort, and the Jade Void Supreme Numinous Boundless Heavenly Venerable deign to bestow grace and favor, specially granting compassion and pardon. May the faults of [Name], and so on, be restrained and removed; may the affairs of [Name], and so on, be granted fulfillment. May the Dao be attained through study, immortality achieved through seeking, soaring through the great void, ascending the Nine Heavens. May the seven generations of ancestors be delivered, ascending to the Southern Palace, dwelling eternally in non-action, clothed and fed by nature, receiving the grace of deliverance from the Supreme Sages.\"*\n\nEach touches the cheeks three times.\n\nNext, facing north, follow the same ritual as in the west.",
      "overlap_context": "ting off the old and renewing, sins forever extinguished, blessings eternally preserved. Grant that [Name]’s tribulations be overcome, [Name]’s affairs fulfilled, the Dao attained through study, immortality achieved through seeking, soaring through the great void, ascending the Nine Heavens. May the seven generations of our parents escape the Three Wretched Realms, ascend to the Southern Palace, their blessings flowing boundlessly, receiving the grace of deliverance from the Heavenly Venerables.",
      "start_char": 11347,
      "end_char": 11661,
      "start_sentence": 333,
      "end_sentence": 343,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.68428897857666,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上八道命籍经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "臣某等，今建斋立直，烧香然灯，解拔宿罪，千咎万愆，的有云云。 愿从北方无上太空玄洞紫虚元始丈人、三天玉童、高上玉晨太上大道君、太真丈人、太真王、北侯中真、高玄万仙上圣天尊，垂恩曲映，特见哀原，拘除某过，赐云云，行道得道，求仙得仙，飞行太空，腾景九天，拔度七祖，上升南宫，长居无为，衣食自然，被受上圣济度之恩。 次向东唱，效前。 臣某等，今建斋立直，烧香然灯，解拔宿罪，千咎万愆，的有云云。 愿从东方无上高上九玄玉虚帝皇、泰清玄元上三天无极大道、太上老君、诸君丈人、旸谷神王扶桑太帝君、天帝君、太微帝君、中央黄老君、九老仙都君、九炁丈人、泰清玉陛下上清太真玉保王、上相东海玉门青华小童君、高仙万圣至极天尊，垂恩曲映，特见哀原，拘除某过，赐云云，行道得道，求仙得仙，飞行太空，腾景九天，拔度七祖，上升南宫，长居无为，衣食自然，被受上圣济度之恩。 次向南唱，效前。 臣某等，今建斋立直，烧香然灯，解拔宿罪，千咎万愆，的有云云。 愿从南方无上太空九玄元始洞灵虚皇玉帝、南极上元禁君、南昌司命长生君、洞阳高圣上仙天尊，垂恩曲映，特见哀原，拘除某过，赐云云，行道得道，求仙得仙，飞行太空，腾景九天，拔度七祖，上升南宫，长居无为，衣食自然，被受上圣济度之恩。 次向中央太岁上唱，效前。 臣某等，今建斋立直，烧香然灯，解拔宿罪，千咎万愆，的有云云。 愿从中央无上无极无穷太虚空洞玄古先生、万道父母、紫虚青要君、后圣九玄金阙帝君、太华玉灵中玄四真、高圣中皇上仙天尊，垂恩曲映，特见哀原，拘除某过，赐云云，行道得道，求仙得仙，飞行太虚，腾景九天，拔度七祖，上升南宫，长居无为，衣食自然，被受上圣济度之恩。 礼五方竟，还向东，思神闭目，叩齿五，咽液五，存五神备在身中，五符焕明内外，五方群魔奔走远迸，来侍卫者严装，罗列在真官后，良久，咽液三，叩齿三，诵《人鸟山经咒》曰： 黄中策炁斩妖宗，察制强精断邪翁，太上有命太上房，急召北帝诣玉宫，奉承威令宣魔王，九炁蓊郁与命冲，秘藏玉文方就隆，三天运明，六天运终，贤者哉。 思神咒毕，谓十方回玄如左： 北方太上颂曰： 太上发玄蕴，焕烂敷真方。 落落散天宝，十方所共尊。 不始亦不终，不明故无昏。 仰登玉京台，逍遥憩昆仑。 超度泉曲都，魔王愿欲闻。 七祖受化生，解我宿世怨。 入控飞玄景，出驾浮紫云。 东北方太上颂曰： 重晖曜玉晨，乘景开圆明。 苕苕洞真殿，晃晃七宝精。 一念度八难，长与太上并。 缠旋献黄景，日华虚中生。 世人不念道，莫闻智慧经。 大矣洞真戒，玄感魔王诚。 万劫若一息，岂击千亿龄。 东方太上颂曰： 太上体太无，散形渡弱丧。 务猷宣玄术，天真并赞扬。 有缘文自表，无因经为藏。 若能得此道，首即生圆光。 身济无待津，飘飖逸仙堂。 东南方太上颂曰： 无无竟无永，有有安入妙。 天翰蔚无上，玄宗自有要。 回转三宝输，十方普震耀。 太上观玉京，魔王空中啸。 天帝叉手唱，众真乘虚笑。 散华正我念，八愿自然超。 南方太上颂曰： 灵仙乘庆霄，驾龙蹑玄波。 洽真表嘉祥，濯足以八河。",
      "translated_text": "We, your servants [Names], now establish the fast and perform the vigil, burning incense and lighting lamps to absolve and deliver from past transgressions—innumerable faults and myriad offenses, specifically those of [Name], and so on. May the Lofty and Supreme, the Primordial Perfected Lord of the North’s Great Void and Purple Mystery, the Three Heavens’ Jade Lads, the Highest Jade Dawn Lord of the Great Dao, the Supreme Perfected Lord, the Supreme Perfected King, the Northern Marquis of Central Perfection, and the Highest Mysterious Myriad Immortals and Supreme Sages, the Heavenly Venerables, deign to bestow grace and favor, specially granting compassion and pardon. May the faults of [Name] be restrained and removed; may the affairs of [Name] be granted fulfillment. May the Dao be attained through study, immortality achieved through seeking, soaring through the great void, ascending the Nine Heavens. May the seven generations of ancestors be delivered, ascending to the Southern Palace, dwelling eternally in non-action, clothed and fed by nature, receiving the grace of deliverance from the Supreme Sages.\n\nNext, facing east, follow the same ritual as before.\n\nWe, your servants [Names], now establish the fast and perform the vigil, burning incense and lighting lamps to absolve and deliver from past transgressions—innumerable faults and myriad offenses, specifically those of [Name], and so on. May the Supreme and Lofty, the Nine Mysteries Jade Void Emperor of the East, the Grand Clarity’s Primordial Lord of the Three Heavens’ Boundless Dao, the Most High Lord Lao, the Perfected Lords, the Yang Valley Divine King and Fusang Supreme Emperor, the Heavenly Emperor, the Supreme Micro Emperor, the Central Yellow Elder Lord, the Nine Elders of the Immortal Capital, the Nine Qi Perfected Lord, the Jade Sovereign of Grand Clarity’s Lower Palace, the Supreme Perfected Jade Protector King, the Prime Minister and Jade Gate Azure Radiance Lad of the Eastern Sea, and the Highest Immortals and Myriad Sages, the Utmost Heavenly Venerables, deign to bestow grace and favor, specially granting compassion and pardon. May the faults of [Name] be restrained and removed; may the affairs of [Name] be granted fulfillment. May the Dao be attained through study, immortality achieved through seeking, soaring through the great void, ascending the Nine Heavens. May the seven generations of ancestors be delivered, ascending to the Southern Palace, dwelling eternally in non-action, clothed and fed by nature, receiving the grace of deliverance from the Supreme Sages.\n\nNext, facing south, follow the same ritual as before.\n\nWe, your servants [Names], now establish the fast and perform the vigil, burning incense and lighting lamps to absolve and deliver from past transgressions—innumerable faults and myriad offenses, specifically those of [Name], and so on. May the Supreme and Lofty, the Primordial Lord of the South’s Great Void and Nine Mysteries Cavern Spirit, the Southern Culmen’s Supreme Origin Lord, the Southern Prosperity Controller of Destiny and Lord of Longevity, and the Cavern Yang High Sage and Supreme Immortal Heavenly Venerable, deign to bestow grace and favor, specially granting compassion and pardon. May the faults of [Name] be restrained and removed; may the affairs of [Name] be granted fulfillment. May the Dao be attained through study, immortality achieved through seeking, soaring through the great void, ascending the Nine Heavens. May the seven generations of ancestors be delivered, ascending to the Southern Palace, dwelling eternally in non-action, clothed and fed by nature, receiving the grace of deliverance from the Supreme Sages.\n\nNext, facing the Central Palace of the Great Year, follow the same ritual as before.\n\nWe, your servants [Names], now establish the fast and perform the vigil, burning incense and lighting lamps to absolve and deliver from past transgressions—innumerable faults and myriad offenses, specifically those of [Name], and so on. May the Supreme and Boundless, the Primordial Master of the Central Void’s Inexhaustible Mystery, the Ten Thousand Dao’s Father and Mother, the Purple Mystery and Azure Essence Lord, the Later Sage and Nine Mysteries Golden Gate Emperor, the Four Perfected of the Central Mystery’s Great Flower Jade Numinosity, and the High Sage and Central August Supreme Immortal Heavenly Venerable, deign to bestow grace and favor, specially granting compassion and pardon. May the faults of [Name] be restrained and removed; may the affairs of [Name] be granted fulfillment. May the Dao be attained through study, immortality achieved through seeking, soaring through the great void, ascending the Nine Heavens. May the seven generations of ancestors be delivered, ascending to the Southern Palace, dwelling eternally in non-action, clothed and fed by nature, receiving the grace of deliverance from the Supreme Sages.\n\nThe rites to the Five Directions now complete, return to face east. Meditate upon the deities with eyes closed, knock the teeth five times, swallow saliva five times, and visualize the Five Spirits fully present within the body, the Five Talismans radiant within and without. Let the demonic hordes of the Five Directions flee far away, while those who come to serve stand in solemn array behind the Perfected Officials. After a long while, swallow saliva three times, knock the teeth three times, and recite the *Scripture of Reniao Mountain’s Incantation*:\n\n*\"Within the Yellow Center, qi is marshaled to sever demonic lineages,\nInspecting and restraining fierce spirits, cutting off the old fiend’s root.\nThe Most High issues commands from the Most High’s chamber—\nHasten the Northern Emperor to the Jade Palace!\nReverently bearing the mighty decree, proclaim it to the Demon Kings.\nThe Nine Qi billow and surge, clashing with fate’s decree.\nThe secret jade texts now flourish in completion:\nThe Three Heavens turn in brightness,\nThe Six Heavens’ course is fulfilled.\nHow worthy are the virtuous!\"*\n\nThe visualization and incantation complete, invoke the Ten Directions’ Return to Mystery as follows:\n\n**Northern Supreme Hymn:**\nThe Supreme unfolds its mysterious store,\nResplendent, it spreads the true methods.\nScattered and boundless, the Heavenly Treasures,\nRevered by all in the Ten Directions.\nWithout beginning, without end,\nUnobscured, thus without darkness.\nAscending the Jade Capital’s terrace,\nWandering carefree upon Kunlun.\nTranscending the Yellow Springs’ dark realm,\nEven demon kings long to hear.\nSeven ancestors receive transformation,\nReleasing me from past-life grievances.\nEntering, I rein in the soaring mystery;\nExiting, I ride the floating purple clouds.\n\n**Northeastern Supreme Hymn:**\nDouble radiance illumines the Jade Dawn,\nRiding the light to open perfect clarity.\nTowering, the Cavern Perfection’s hall,\nGleaming, the seven treasures’ essence.\nA single thought delivers from eight perils,\nForever paired with the Supreme.\nSpiraling, I offer the yellow effulgence,\nSunlight born within the void.\nWorldly folk do not contemplate the Dao,\nNor hear the *Sutra of Wisdom*.\nVast is the Cavern Perfection’s precept—\nThe mystery’s response moves demon kings to sincerity.\nTen thousand kalpas as a single breath,\nHow could they rival a thousand billion eons?\n\n**Eastern Supreme Hymn:**\nThe Supreme embodies the Great Nothing,\nDispersing form to ferry the weak and lost.\nDiligently expounding the mysterious arts,\nHeavenly Perfected join in praise.\nThose with affinity manifest through scripture,\nThose without are concealed in the canon.\nShould one attain this Dao,\nA halo of light first crowns the head.\nThe body crosses without awaiting a ford,\nDrifting lightly to the Immortals’ hall.\n\n**Southeastern Supreme Hymn:**\nThe boundless Nothing eternally abides,\nThe conditioned \"have\" securely enters the wondrous.\nHeaven’s brush inscribes the supreme,\nThe mystery’s lineage holds its essentials.\nRevolving, the Three Treasures are conveyed,\nThe Ten Directions universally resound.\nThe Supreme gazes upon the Jade Capital,\nDemon kings howl in the empty sky.\nThe Heavenly Emperor clasps hands and chants,\nPerfected Ones ride the void in laughter.\nScattering blossoms, my thoughts align—\nThe Eight Vows naturally transcend.\n\n**Southern Supreme Hymn:**\nDivine immortals ride the auspicious clouds,\nMounting dragons to tread the dark waves.\nHarmonizing with the true, they display felicitous signs,\nWashing their feet in the Eight Rivers.",
      "overlap_context": "he affairs of [Name], and so on, be granted fulfillment. May the Dao be attained through study, immortality achieved through seeking, soaring through the great void, ascending the Nine Heavens. May the seven generations of ancestors be delivered, ascending to the Southern Palace, dwelling eternally in non-action, clothed and fed by nature, receiving the grace of deliverance from the Supreme Sages.\"*\n\nEach touches the cheeks three times.\n\nNext, facing north, follow the same ritual as in the west.",
      "start_char": 11662,
      "end_char": 12928,
      "start_sentence": 344,
      "end_sentence": 389,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.559386253356934,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上八道命籍经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "福应不我期，故能释天罗。 道德冠三界，地纲亦已过。 感遇灵真会，冷慧经莲华。 西南方太上颂曰： 无上觉四辈，芒芒大方外。 幽显谅有由，无幽故不昧。 来罗运玄轮，真仙萃华会。 时游眇莽间，天人无见际。 西方太上颂曰： 灵妙寄宣迹，天人有津岸。 泛舟不测渊，常恐风波涣。 其缘有前力，智识谁能算。 冉冉任玄枢，昭然冥因判。 挺颖应真子，灵琴空中弹。 冷思恭十方，去留不我羡。 西北方太上颂曰： 太上敷洞文，贤贤归大缘。 萧条三宝囿，繁华秀我因。 伯史与入精，质净生金身。 终劫复始劫，愈觉灵颜新。 希度礼无上，虔文降至真。 道林蔚天京，下光诸地仙。 纵容散灵威，洋洋大法宣。 上方太上颂曰： 太上观十方，晻蔼融风穆。 圆光映三辰，真人被天服。 魔王叉手立，司迎酆京侧。 日月翳行曜，七宝焕无极。 一切营此时，福灭地狱息。 眇乎无量尊，天人莫能测。 下方太上颂曰： 三宝繁十方，亹亹空中澄。 宛转随化理，一感法输升。 莫皦暗昧阁，四大与时兴。 空有靡不有，崔嵬多山陵。 太上无滞念，灭念归大乘。 六时味素灵之曲、太霄琅书。 文多不载，临时取卷咏之。 五帝忧乐之辞，巡行三周，周於南方，向北止，诵四极五苦诗三篇，如左： 大洞总三伦，元化有无形。 寂若无根教，肃若有威灵。 哀哉三涂中，忧苦从是生。 至学慎兹戒，积善穷劫龄。 劫尽化生天，身与日月并。 愚痴随世好，浮学以求荣。 宣化无纲纪，轻漏天宝经。 目科入死门，四极结尔名。 魂神履九难，五苦长尔婴。 食火践刀山，艰辛无暂宁。 叹此祸福原，悠悠中甚明。 高上遗严戒，祸福令人叹。 仙道本由运，冥中亦已判。 无运亦不启，既悟常若晏。 若能崇玄科，自然超霄汉。 苟贪爱欲累，何为强敖玩。 居罪结四明，生死履苦难。 流曳五苦庭，三涂结不散。 沉灵九幽掠，万劫无待旦。 悲此元始教，能不便人怨。 寥寥九玄上，翳翳初化始。 无形亦无景，无深亦无测。 二仪启运彰，结炁以成滓。 三晨朗元室，五九有纲纪。 祸福由人生，善恶竟孰在。 若能悟玄觉，超然凌高碍。 苟执伐命斧，积昼盈心里。 沉罪结四明，宿罚良有已。 生身负风刀，五苦无穷解。 七玄填幽夜，万劫方一纪。 流连三涂中，未悟有生死。 诵五苦毕，唱： 臣某等，至心归命太上无极大道太真尊经宝符，玄中大法师老子、青童君。 九拜，亦可三拜，亦可心拜。 法师读大忏，余人伏。 三尊九拜毕，叩抟各九止，仍复炉。 若同侣为人的谢，十五方虽竟，犹应都谢大忏，散发注心。 其文在左： 太玄都三洞法师某岳先生，小兆真人三景弟子，奉行大洞经事，臣某姓名，上启太上上上无极无穷至上洞真九玄元父、太虚玄母、元始天王、高上玉虚万道丈人、郁单无量天王、上上禅善无量寿天王、须延天王、寂然天王、不骄乐天王、化应声天王、梵宝天王、梵迦摩夷天王、波梨答和天王、九天丞相、三天玉童、高上三十九帝、二十四真、玄古先生、万始丈人、高圣玉晨太上大道君、扶桑太帝旸谷神王、四司五帝、西台龟母、上清太真玉保王、上相大司命高晨师、东海玉门青华小童君、泰清玄无上三天无极大道、太上老君、太上丈人、天帝君、九老仙都君、九炁丈人等，百千万重道炁，千二百官君，泰清玉陛下无鞅数道上皇真人、无极天尊，炁系自然玄都元皇、三界内外应感正神。",
      "translated_text": "Fortune’s response comes not as I await,\nThus able to unbind the celestial nets.\nVirtue and power crown the Three Realms,\nThe earth’s web too has been transcended.\nInspired encounter with the numinous assembly,\nCold wisdom illumines the lotus scripture.\n\n**Southwestern Supreme Hymn:**\nThe peerless awakens the four assemblies,\nVast beyond the great expanse.\nDark and bright surely have their cause—\nNo obscurity, thus no concealment.\nThe net of destiny turns the mysterious wheel,\nPerfected immortals gather in the blossom assembly.\nWandering at times through the distant wilds,\nHeavenly and human, no boundary is seen.\n\n**Western Supreme Hymn:**\nThe numinous and wondrous lodge in proclaimed traces,\nHeavenly and human find ford and shore.\nAdrift on the fathomless abyss,\nEver fearful of winds and waves dispersing.\nIts conditions rooted in prior power,\nWho can reckon wisdom and knowledge?\nGently yielding to the mysterious pivot,\nLuminously the hidden causes are discerned.\nA stalwart shoot, a disciple of the Perfected,\nPlucks the spirit zither in the empty sky.\nCold contemplation reveres the Ten Directions,\nNeither departure nor stay do I envy.\n\n**Northwestern Supreme Hymn:**\nThe Supreme unfolds the profound scriptures,\nThe worthy and wise return to the great affinity.\nDesolate the Three Treasures’ preserve,\nLush the flowering of my karmic causes.\nElders and scribes enter refinement,\nTheir essence purified, golden bodies arise.\nFrom kalpa’s end to kalpa’s beginning,\nEver more radiant their numinous countenances.\nRare deliverance bows to the peerless,\nDevout scriptures descend to the perfected.\nThe Dao’s grove flourishes in the Heavenly Capital,\nBelow, its light illumines all earthly immortals.\nFreely they disperse their numinous might,\nVastly the great Dharma is proclaimed.\n\n**Upper Supreme Hymn:**\nThe Supreme gazes upon the Ten Directions,\nDim and misty, harmonizing with the wind’s stillness.\nThe halo’s light illumines the Three Luminaries,\nPerfected Ones don the celestial robes.\nDemon kings stand with clasped hands,\nOfficials receive them beside the Feng capital.\nSun and moon veil their coursing brilliance,\nThe Seven Treasures gleam boundlessly.\nAll endeavors flourish at this hour,\nFortune extinguishes, hells fall silent.\nHow distant, the immeasurable Honored One—\nHeavenly and human cannot fathom.\n\n**Lower Supreme Hymn:**\nThe Three Treasures flourish throughout the Ten Directions,\nSteadily the void clears in the empty sky.\nTurning and revolving with the transformative principle,\nA single inspiration, the Dharma’s conveyance ascends.\nDo not obscure the dim and murky chambers,\nThe Four Great Elements arise with the times.\nEmptiness and being—nothing is not possessed,\nTowering, the many mountains and hills.\nThe Supreme harbors no lingering thoughts,\nExtinguishing thoughts, returns to the Great Vehicle.\nAt the six hours, savor the *Plain Numinous Melody* and the *Luminous Writ of the Grand Empyrean*.\nThe text is too vast to record; consult the scrolls when the time comes.\n\nThe Five Emperors’ verses of sorrow and joy,\nPatrolling thrice around, circling the southern quarter,\nFacing north they halt, reciting the *Three Poems of the Four Poles and Five Sufferings*, as follows:\n\n**The Great Cavern Sums Three Principles**\nThe primordial transformation has form and formlessness.\nStill as a rootless teaching,\nSolemn as if possessed of numinous might.\nAlas! Within the Three Paths,\nSorrow and suffering arise therefrom.\nTo the utmost study, heed these precepts,\nAccumulate goodness through kalpas’ ages.\nWhen kalpas end, reborn in heaven,\nBody conjoined with sun and moon.\nFoolish and deluded, following worldly fancies,\nPursuing superficial learning for glory.\nProclaiming transformation without discipline,\nCarelessly leaking the Heavenly Treasures’ scriptures.\nEyes measured, entering death’s gate,\nThe Four Poles knot your name.\nSoul and spirit tread the Nine Perils,\nThe Five Sufferings ever bind you.\nFeeding on fire, treading the Knife Mountain,\nHardships without momentary respite.\nLamenting this origin of fortune and misfortune,\nEver clear amidst the vast.\nThe exalted leave stern warnings,\nFortune and misfortune move one to sigh.\nThe immortal Dao arises from destiny,\nIn the unseen, already determined.\nWithout destiny, it does not unfold;\nOnce awakened, ever at peace.\nIf one can honor the mysterious precepts,\nNaturally soaring beyond the empyrean.\nIf ensnared by love and desire’s burdens,\nWhy forcefully strive and play?\nDwelling in transgression, the Four Luminaries are knotted,\nLife and death tread the path of suffering.\nDragged through the Five Sufferings’ courts,\nThe Three Paths’ knots remain unbroken.\nThe numinous sinks, seized in the Nine Darks,\nTen thousand kalpas without dawn’s waiting.\nGrieving for this teaching of the Primordial Beginning,\nHow can one not incite resentment?\n\n**Vast the Nine Mysteries Above**\nVeil upon veil, the first transformation’s inception.\nNo form, no image,\nNo depth, no measure.\nThe Two Modes initiate the unfolding,\nQi congeals to form sediment.\nThe Three Dawns brighten the Primordial Chamber,\nThe Five Nines possess their discipline.\nFortune and misfortune arise from human action,\nGood and evil—who indeed prevails?\nIf one can awaken to the mysterious enlightenment,\nTranscending, surmounting the lofty barriers.\nIf grasping the axe that hews destiny,\nAccumulating days, filling the heart.\nSinking transgressions knot the Four Luminaries,\nFormer punishments truly have their end.\nBorn bearing the wind’s blade,\nThe Five Sufferings know no release.\nThe Seven Mysteries fill the dark night,\nTen thousand kalpas mark a single era.\nLingering in the Three Paths,\nUnawakened to life and death.\n\nReciting the *Five Sufferings* complete, chant:\nYour servant [Name], with utmost sincerity, reverently submits to the *Supreme, Boundless, Peerless Dao; the Most Real Honored Scripture and Treasure Talisman; the Grand Dharma Master of the Mysterious, Lord Lao; and the Azure Lad*.\n\nNine bows, or three bows, or bows of the heart may be made.\nThe Dharma Master reads the great repentance,\nOthers prostrate themselves.\nAfter the Three Honored Ones and nine bows,\nEach knocks the head nine times and ceases, then returns to the incense burner.\n\nIf companions perform the thanksgiving for the deceased,\nThough the fifteen directions are complete,\nOne should still offer a general thanksgiving for the great repentance,\nScattering hair and concentrating the mind.\nThe text follows:\n\nThe Grand Mystery Capital’s Three Caverns Dharma Master, Master of [Mountain] Yue,\nLesser Manifestation Real Person, Disciple of the Three Luminaries,\nPractitioner of the *Great Cavern Scripture*’s affairs,\nYour servant [Name],\nRespectfully addresses the Supreme, Most Supreme, Boundless, Inexhaustible, Utmost Honored Cavern Real, Nine Mysteries Primordial Father;\nThe Primordial Void Mysterious Mother;\nThe Primordial Beginning Heavenly King;\nThe Lofty Jade Void, Myriad Dao Venerable;\nThe Highest Joyous Immeasurable Lifespan Heavenly King;\nThe Purifier Heavenly King;\nThe Serene Heavenly King;\nThe Unboastful Joy Heavenly King;\nThe Responsive Sound Heavenly King;\nThe Brahma Treasure Heavenly King;\nThe Brahma Kapila Heavenly King;\nThe Parinirmitavaśavartin Heavenly King;\nThe Nine Heavens’ Chancellor;\nThe Three Heavens’ Jade Lads;\nThe Thirty-Nine Lofty Emperors;\nThe Twenty-Four Perfected;\nThe Primordial Master;\nThe Myriad Beginnings Venerable;\nThe Lofty Sage, Jade Dawn, Supreme Great Dao Lord;\nThe Fusang Supreme Emperor, Sun Valley Divine King;\nThe Four Officers and Five Emperors;\nThe Western Terrace Tortoise Mother;\nThe Supreme Clarity, Jade Perfected, Royal Protector;\nThe High Minister, Grand Controller of Destinies, Lofty Dawn Master;\nThe Azure Lad of the Jade Gate of the Eastern Sea;\nThe Grand Clarity, Mysterious, Supreme Three Heavens’ Boundless Great Dao;\nThe Supreme Lord Lao;\nThe Supreme Venerable;\nThe Heavenly Emperor Lord;\nThe Nine Elders of the Immortal Capital;\nThe Nine Qi Venerable;\nAnd the hundred thousand myriad layers of Dao qi,\nThe twelve hundred officials,\nThe immeasurable hosts of Daoist August Real Persons of the Grand Clarity’s Jade Palace,\nThe Boundless Heavenly Worthies,\nThe qi lineage of the Natural Mysterious Capital’s Primordial August One,\nAnd all responsive and attuned deities within and beyond the Three Realms.",
      "overlap_context": "nveyed,\nThe Ten Directions universally resound.\nThe Supreme gazes upon the Jade Capital,\nDemon kings howl in the empty sky.\nThe Heavenly Emperor clasps hands and chants,\nPerfected Ones ride the void in laughter.\nScattering blossoms, my thoughts align—\nThe Eight Vows naturally transcend.\n\n**Southern Supreme Hymn:**\nDivine immortals ride the auspicious clouds,\nMounting dragons to tread the dark waves.\nHarmonizing with the true, they display felicitous signs,\nWashing their feet in the Eight Rivers.",
      "start_char": 12928,
      "end_char": 14239,
      "start_sentence": 390,
      "end_sentence": 467,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 49.61030292510986,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上八道命籍经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "臣某等谬藉宿庆，陶染玄真，奉修宝经，不敢有懈，但禀性暗浅，未达清深，遵行违科，动止成衅，宿罪既重，今愆又增，惧陨漏刻，微愿不申，今幸蒙大慈，赐加善贷，誓及寸阴，庶立丹志，依法奉辞，谨读以闻。 辞本如前。 辞情款到，仰希哀矜，赐以三宥之泽，原赦臣妾等前世今世、先身今身，及七玄七祖、中外种亲，君臣师友，一切因缘前亡后死、见在世间，有阴阳重罪，生诸灾害，学宦不达，所愿不成。 今洗心归命，散发顿头，特愿三尊涕然垂亮，敕勒所由班下正职，拘除臣某等，及上世因缘幽显，动止违逆之愆； 或不慈不孝、不仁不明、不恭不逊、不信不忠、不严不断、不让不廉、不施不救、不清不平、不正不通、不勤不顺； 或手害人命，劫贼攻略，谋图奸淫，九族交接； 或教人杀戮酷虐众生，劫略谋图奸通九族，嫉贤妬能，伐逆师主； 或受经泄露，轻慢宝章； 或染法混俗，哭泣临尸，履冒血秽，不自改悛； 或行用宝诀，带近女人，阴阴杂乱，不遵七经； 或叨参三洞，不除三尸，心怀阴贼，手肆顽凶，唝嗃自专，伤毁同气，破贼经诰，违负三尊； 或便旋兴居，不顾禁忌，公知故犯，私欲乖科，饱食醉酒，作性异常，亏道坏法，协邪疑真； 或不师受，窃经辄传，不斋告盟，率尔交换，假借施行，欺侮百姓，改易圣文，意通玄妙，废古竞今，自作一法； 或奉道不精，经无堂室，供养不具，朝礼顿替，异人妇女，共处往来，服饰交关，非类相会； 或处高位尊上师君，轻蔑自下，杀害无辜，赏罚不平，取与无定，任愚恣欲，触犯三光； 或为臣子吏民仆隶，出入欺罔，窃滥纵横，弒逆反倒，干忤五行； 或男女翻覆，妬害公私，弃正逐邪，诽谤真道，知恶不悔，悔又重犯，积结未解，悉乞荡除，解罪布福，和释怨仇，消灭注讼，杜绝恶源，先亡眷属，同免幽泉，俱升光景，利佑后人，善神拥护，扶助存亡。 令死者轮转，与道结缘，生者学业功行惟新，坟墓安稳，宅舍清宁，家国兴隆，道化日盛，群魔降伏，众圣来游，二仪交泰，三光同明，七曜无舛，九皇调均，四海停波，五岳秀峰，风雨普适，谷稼丰盈，一切荷庆，天下太平。 特愿玄慈，赐如所请，蒙恩果愿，不废今言，上明大道更造之施，下副臣妾等渴仰之诚。 大忏竟，向东叩齿三十六通。 读五愿，此别有五日三斋自得通用。 第一上愿我生自然之炁，炁中结成我身，身与三光齐伦，长享无极之根。 二愿我身常处太空之上，琼宫玉房之里，朝与玉帝同宴，夕与玄母同游，渴噏浪井洪泉玉芝，饥纳龙胎琼油绛树赤子。 三愿我身身生万怪，七十二光，奇毛异质，飞羽衣裳，乘虚驾空，出入帝宫，众庆来臻，万寿无量。 四愿与炁俱生，与炁俱死，死而又生，生为帝王，封掌十天，总领群仙。 五愿一切众生，已生未生，同保日月三光，有道之人，七玄之祖上升南宫，天下之福靡有不当，四方五愿，并会玉堂。 次上愿九玄，扶养我身，魂魄真神，常居我宫，上通天仙，下逮洞渊，愿地、愿风、愿云、愿神，五愿一合，定籍长生，天降紫烟，地卫五灵，乘云驾虚，飞辇绿軿，上造金阙，进登玉清，庆及七祖，更受胎生，上愿五合，长亨利贞。",
      "translated_text": "We, your humble servants, undeservedly blessed by karmic fortune and steeped in the mysterious truth, have reverently practiced the precious scriptures without daring to slacken. Yet our innate nature is dim and shallow, failing to grasp the profound and pure; in following the Way, we violate its precepts, and in every movement and pause, we incur transgressions. Our past sins being already grave, our present faults have only multiplied. We fear that even a moment’s lapse may prevent our modest vows from being heard. Now, by great mercy, we are granted benevolent pardon. We swear to cherish every instant, striving to establish a sincere resolve. In accordance with the ritual, we present our words, humbly reciting them for your hearing.\n\nThe text of the petition is as above.\n\nAs our plea is earnest and sincere, we humbly beseech your compassion. Bestow upon us the grace of threefold forgiveness, absolving the sins of your servants—past and present lives, former and current bodies—and those of our sevenfold ancestors, both maternal and paternal kin, sovereigns and ministers, teachers and friends, all karmic connections, the departed and the yet-to-die, and all beings now in the world. May those burdened by grave sins in the yin and yang realms, beset by calamities, hindered in study or office, or whose aspirations remain unfulfilled, now be cleansed in heart and devoted in life. With unbound hair and bowed heads, we implore the Three Venerables to shed tears of mercy, commanding the relevant authorities to issue decrees of rectification, removing the transgressions of us, your servants, and all our karmic ties across past lives—both hidden and manifest—where our actions and stillness have defied the Way:\n\nWhether through lack of filial piety or kindness, lack of benevolence or wisdom, lack of reverence or humility, lack of faith or loyalty, lack of solemnity or resolve, lack of yielding or integrity, lack of generosity or aid, lack of purity or fairness, lack of uprightness or harmony, lack of diligence or obedience;\n\nOr by taking lives with our own hands, plundering and raiding, scheming for illicit unions, or engaging in incestuous relations with the nine clans;\n\nOr by teaching others to kill, slaughter, or cruelly oppress beings, instigating plunder, schemes, or illicit unions within the nine clans, envying the worthy and resenting the capable, or rebelling against teachers and masters;\n\nOr by leaking scriptures after receiving them, treating sacred texts with disdain;\n\nOr by defiling the Dao by mingling with the profane, weeping before corpses, treading upon blood and filth without repentance or reform;\n\nOr by employing sacred methods while consorting with women, allowing yin and yang to intermingle chaotically, disobeying the Seven Classics;\n\nOr by presumptuously partaking in the Three Caverns without expelling the Three Corpses, harboring treacherous thoughts, committing violent acts, acting arrogantly, injuring kin, desecrating scriptures and precepts, or betraying the Three Venerables;\n\nOr by heedlessly moving about without regard for taboos, knowingly violating prohibitions, pursuing private desires contrary to the rules, indulging in gluttony and drunkenness, behaving abnormally, undermining the Dao and corrupting the Dharma, or confusing evil with truth;\n\nOr by failing to receive teachings from a master, stealing scriptures and transmitting them recklessly, exchanging them without fasting or vows, borrowing and misusing them, deceiving the common folk, altering sacred texts, feigning profound understanding, abandoning the ancient for the modern, or inventing one’s own methods;\n\nOr by practicing the Dao without devotion, lacking proper halls for scriptures, neglecting offerings, slackening in daily rites, associating with unrelated men and women, exchanging garments, or mingling with improper company;\n\nOr by occupying high positions as honored masters or sovereigns, yet belittling inferiors, killing the innocent, meting out unjust rewards and punishments, taking and giving arbitrarily, indulging ignorance and desires, or offending the Three Luminaries;\n\nOr by serving as ministers, officials, clerks, or servants, yet deceiving in comings and goings, stealing, acting recklessly, rebelling, or defying the Five Phases;\n\nOr by men and women who reverse right and wrong, harming public and private interests, abandoning the true for the perverse, slandering the true Dao, persisting in evil without repentance, or repeating offenses after repentance, accumulating unresolved grievances—\n\nWe beseech you to wash all these away, dissolving sins and spreading blessings, reconciling enmities, dispelling lawsuits, severing the roots of evil. May our departed kin likewise be freed from the dark springs, ascending together into radiant realms, and may our descendants be blessed and protected. May divine spirits guard and assist both the living and the dead, allowing the deceased to reincarnate and form bonds with the Dao, while the living renew their studies and virtues. May tombs rest in peace, dwellings remain serene, families and nations prosper, the Dao flourish daily, demons be subdued, sages descend to wander, heaven and earth harmonize, the Three Luminaries shine together, the Seven Luminaries align without error, the Nine August Ones govern in balance, the Four Seas calm their waves, the Five Peaks stand majestic, wind and rain come in due measure, crops yield abundance, all beings receive blessings, and the world attain great peace.\n\nWe especially pray that your mysterious compassion grant our requests, that our vows be fulfilled by your grace, and that our words today not be in vain. Above, may the great Dao’s boundless generosity be manifest; below, may it match the sincerity of your servants’ longing.\n\nThe Great Repentance concludes. Face east and strike the teeth thirty-six times.\n\nRecite the Five Vows, which may also be used with three days of fasting.\n\n**First Vow:** May the qi of my birth be natural, and from this qi may my body be formed, equal to the Three Luminaries, eternally rooted in the boundless.\n\n**Second Vow:** May my body ever dwell above the Great Void, within jade palaces and chambers, feasting with the Jade Emperor by day and wandering with the Mysterious Mother by night. When thirsty, may I drink from the vast well’s jade mushrooms; when hungry, may I consume dragon embryos, crimson tree fruits, and red children.\n\n**Third Vow:** May my body give birth to ten thousand marvels, seventy-two radiant lights, extraordinary fur and form, and garments of flying feathers. May I ride the void and mount the sky, entering and leaving the imperial palace, with all blessings converging, and my lifespan boundless.\n\n**Fourth Vow:** May I be born with qi and die with qi, reborn after death, becoming an emperor, ruling over the Ten Heavens, and governing all immortals.\n\n**Fifth Vow:** May all beings, born and unborn, together preserve the Three Luminaries. May those who follow the Dao and their sevenfold ancestors ascend to the Southern Palace, and may all blessings under heaven be fulfilled. May the vows of the four directions and five realms converge in the Jade Hall.\n\n**Next Vow:** May the Nine Ancestors nurture my body, and may my hun and po spirits, my true deities, forever dwell within my palace, communicating above with celestial immortals and below with the abyssal depths. May the Vow of Earth, the Vow of Wind, the Vow of Clouds, the Vow of Spirits, and the Five Vows unite, securing my name in the register of long life. May purple mists descend from heaven, and may the Five Spirits guard the earth. Riding clouds and mounting the void, may I ascend in a green chariot to the Golden Gate, advancing into the Jade Clarity. May blessings extend to my seven ancestors, who shall be reborn in the womb, and may the Five Vows unite in eternal harmony and prosperity.",
      "overlap_context": "ss Great Dao;\nThe Supreme Lord Lao;\nThe Supreme Venerable;\nThe Heavenly Emperor Lord;\nThe Nine Elders of the Immortal Capital;\nThe Nine Qi Venerable;\nAnd the hundred thousand myriad layers of Dao qi,\nThe twelve hundred officials,\nThe immeasurable hosts of Daoist August Real Persons of the Grand Clarity’s Jade Palace,\nThe Boundless Heavenly Worthies,\nThe qi lineage of the Natural Mysterious Capital’s Primordial August One,\nAnd all responsive and attuned deities within and beyond the Three Realms.",
      "start_char": 14239,
      "end_char": 15463,
      "start_sentence": 468,
      "end_sentence": 494,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.50233006477356,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上八道命籍经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "中愿亦五，得道本根，愿阴、愿阳、愿太空、愿太无、愿太玄，上宴玉房，与帝因缘，游盻生关，披浪九天，元父定籍，玄母记年，桃康结精，固保丹田，身腾金刚，名书玉篇，七祖解脱，福庆来臻。 下愿亦五，愿太虚、愿太有、愿太上、愿太真、愿神仙，运身於五岳之岭，飘飖九霄之际，出入开关之里，移脱死户之外，愿天地为我父母，三光卫我年，万神守九泉之孔，灵降自然之炁，以方五愿，举响而会。 愿毕，叩齿二七，咒曰： 太帝上元，帝一玄经，五云散景，郁彻三清，玉童玉女，烧香侍灵，上愿开陈，与我合并，使我神仙，上升帝庭，北帝落死，南关注生，东华金格，得上我名，无穷之愿，与我齐并。 毕，又叩齿三七，仰咽炁五过止。 咒毕，三捻香，复炉，咒曰： 三元三天，五岳五帝，神仙使者，三炁正真，左右龙虎，天仙地仙，飞仙神仙，五灵香官，当令招致十方正炁，自然金液丹精芝英，九玄玉真，交会斋堂露墠灵坛，洞灌臣某等身中，使臣某等学道得道，求仙得仙，飞行太空，腾景九天，玉童玉女，侍卫香烟，奏臣某等所启，上御高上无极太上大道玉皇帝几前。 毕，叩齿九通，咽液九过，都止。 复炉，仍回巡，出时行咏，如左#1。",
      "translated_text": "The Middle Vows are also five: may the root of Dao-attainment be realized. The Vow of Yin, the Vow of Yang, the Vow of Great Void, the Vow of Supreme Non-Being, and the Vow of Supreme Mystery—may they ascend to feast in the Jade Chamber, forging karmic bonds with the Emperor. Roaming the Gate of Life’s Gaze, riding the waves of the Nine Heavens, may the Primordial Father inscribe my name in the register, and the Mysterious Mother record my years. May peach-vigor bind my essence, firmly guarding the Cinnabar Field. May my body ascend as adamantine, my name inscribed in the Jade Volume. May the seven ancestors attain liberation, and blessings and fortune arrive in full.\n\nThe Lower Vows are also five: the Vow of Great Emptiness, the Vow of Supreme Existence, the Vow of Supreme Oneness, the Vow of Supreme Perfection, and the Vow of Divine Immortals. May I traverse the peaks of the Five Marchmounts, drift among the Nine Firmaments, move in and out of the Gates of Opening, and transcend the threshold of death. May Heaven and Earth be my parents, the Three Luminaries guard my years, the myriad spirits watch over the nine apertures of the Yellow Springs, and numinous qi descend naturally. With these five vows aligned, may all resound and converge.\n\nWhen the vows are complete, knock the teeth twice seven times and recite the incantation:\n*\"Supreme Emperor of the Upper Origin, Scripture of the Emperor’s Unity and Mystery, five clouds scatter radiance, luxuriant through the Three Clarities. Jade lads and jade maidens burn incense and attend the numinous. The upper vows unfold and merge with me, enabling me to become a divine immortal and ascend to the Emperor’s court. The Northern Emperor severs death, the Southern Pass inscribes life. The Golden Register of Eastern Florescence records my name. May boundless vows unite with me in equality.\"*\n\nWhen finished, knock the teeth thrice seven times, look up, and swallow qi five times, then cease.\n\nAfter the incantation, pinch the incense three times, replenish the censer, and recite:\n*\"Three Origins and Three Heavens, Five Marchmounts and Five Emperors, divine immortal messengers, true perfected of the Three Qi, left and right Dragon and Tiger, celestial immortals and earthly immortals, flying immortals and divine immortals, officials of the Five Numinous Incense—summon now the upright qi of the ten directions, the natural golden liquid, elixir essence, and mushroom spirits. May the Nine Mysteries and Jade Perfected converge in the oratory’s exposed altar, pouring through the bodies of your servants so-and-so, enabling us to study the Dao and attain the Dao, seek immortality and attain immortality, soar through the Great Void, and ascend the radiance of the Nine Heavens. May jade lads and jade maidens attend the incense smoke, presenting the petitions of your servants so-and-so before the throne of the Highest, Boundless, Supreme, Great Dao, Jade Emperor.\"*\n\nWhen finished, knock the teeth nine times, swallow saliva nine times, and cease entirely.\n\nReplenish the censer, then circumambulate and exit while chanting as before.",
      "overlap_context": " depths. May the Vow of Earth, the Vow of Wind, the Vow of Clouds, the Vow of Spirits, and the Five Vows unite, securing my name in the register of long life. May purple mists descend from heaven, and may the Five Spirits guard the earth. Riding clouds and mounting the void, may I ascend in a green chariot to the Golden Gate, advancing into the Jade Clarity. May blessings extend to my seven ancestors, who shall be reborn in the womb, and may the Five Vows unite in eternal harmony and prosperity.",
      "start_char": 15464,
      "end_char": 15953,
      "start_sentence": 495,
      "end_sentence": 503,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.005887746810913,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上八道命籍经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "右六篇，六时各诵一，若三时迭互，周而复始。 咏毕，出咒嗽，悉如朝仪。 食后上经讲至户，亦嗽口，叩齿三通，存神如法，心礼三拜，密咒曰： 玉帝上法，上闻三清，吉日斋戒，开我神经，万试隐伏，所向皆成，玉童侍护，玉华散馨，上生三元，与我长生。 开经亦用。 入堂向道礼三拜，若人众，可巡行至东。 若定位，俱三拜，亦可一拜，亦可心拜。 拜毕，正坐，坐定闭目，握固叩齿，存头正青如碧玉，两手如丹，两脚如雪，魂备左，魄守右，良久开目，挼掌案摩，上坐，存毕，上高座诵经讲义。 先向道座礼九，三一拜，登高座，开经时先叩齿三十六通，咽液三十六，存回风混合帝一百神万真，仍密咒曰： 微微玄宗门，焕玄彻空洞，至道由静默，当见三素宫，大道於此成，骖景乘云龙，左右待经人，玉女及玉童，身济不死津，解罗顺灵风，七祖反胎生，世为神仙宗。 读《三十九章》、《雌一》、《大有》、《九真》、《太丹》，北向心礼四方，叩齿三十六，咽液三十六，存五藏之内有五色之光，注五星之精，然后读《神州》，次《百神内名》，乃诵《三十九章》，心目相应，不得杂想，令篇句毕了，不得中住。 读三十一卷，北向心拜四方，叩齿二十四，咽液三十四，存五星日月三精，玄注兆身，余卷依别诀。 读《智慧经》及偈赞，先闭目，叩齿三，咽液三，存三素元君在金华宫，如婴儿状，而咏文也。 读经讲义毕，俱下正立，礼三尊，三拜，拜竟同伏，叩齿三，密祝曰： 陵梵履昌，七灵丈人，太一务犹，五神黄宁，上升九天，与帝共并，乞愿飞仙，七祖胎婴，解愆释罗，上登玉清。 毕，又叩齿七通，咽液三过止。 起出户，存神，晨夕常耳，七年上升。 日夜三时、六时，存咒皆同，入坛墠者，咒中小异，言堂室处，易云坛墠耳。 坛墠堂室，内外皆三重，上座大法，法师入内，次下座住中，次对斋住外。 堂坛之灯，七九之外随宜燃之，大略依上元九十，中元六十，下元三十六，合一百八十六，罗列堂坛左右、门阁、太岁、月建、日辰、本命行年之上。 太岁、本命，昼夜常明，余唯夜朗。 若雨，於堂然二灯，余者可门。 行道毕，各向本命及太岁灯再拜，启乞求愿，随意所言。 又依《四极明科》，立春、春分九灯，列庭中； 立夏、夏至八； 立秋、秋分六； 立冬、冬至五； 本命十二灯，八节向王，本命向太岁，叩齿二十四，咒曰： 高上太真，万圣五帝，皇帝玉司，总仙监真，今日吉晨，八节开陈，阳罪阴考，绝灭九阴，於今永始，拔擢七玄，免脱火乡，长离刀山，三涂五苦，不累我身，得同天地，克保帝晨，五愿八会，靡不如言。 毕，解巾，叩头一百二十，下额向地而已，勿令痛。 竟，复巾，仰天心念：我身今日，上享天恩，赐反形骸，更生飞仙。 毕，仰咽二十四炁止，三年愆除，身与真同耳。 坛墠四方，合一百八十六灯，九丈者，方各一百八十六，合六百四十四也。 此外千八百六十灯，门庭巷路，侍之至晓，风雨则停。 日限竟止，都竟言功。 斋竟之朝，行道之后，未可复炉，仍唱各称名位某位，凡所受道高卑，依次言之，极大法者，一如黄素，若参师箓，治历称在前。 上启三元太真洞空九玄太虚高上玉皇、三十九帝、二十四真、高圣玉晨太上大道君、四司五帝、万道元始上圣、至极天尊。",
      "translated_text": "The six preceding sections are to be recited one each during the six periods of the day. If reciting during three periods, alternate them in rotation, cycling through without end. Upon completion of the chant, exit while coughing—all procedures mirror those of the morning rites.\n\nAfter meals, when ascending to the scripture hall, likewise rinse the mouth, knock the teeth three times, and visualize the spirits as prescribed. Bow three times in reverence, then recite the secret incantation:\n\n*\"The Jade Emperor’s supreme law,\nAscends to the Three Clarities on high.\nOn this auspicious day of fasting,\nOpen my divine scriptures.\nThough myriad trials lie concealed,\nAll endeavors shall succeed.\nJade lads attend and guard,\nJade blossoms scatter fragrance,\nAscending to the Three Origins,\nGranting me eternal life.\"*\n\nThis incantation is also used when opening the scriptures.\n\nEnter the hall, face the Dao, and bow three times. If the assembly is large, circumambulate to the east. If fixed in position, all bow three times—or once, or bow in the heart. After bowing, sit upright, close the eyes, clench the fists, and knock the teeth. Visualize the head as pure azure jade, the hands as cinnabar, the feet as snow; the hun-spirit stationed on the left, the po-spirit guarding the right. After a long while, open the eyes, rub the palms together, and massage the face. Ascend to the high seat and, upon completing the visualization, begin reciting the scriptures and expounding their meaning.\n\nFirst, bow nine times toward the Dao seat—three bows in sets of three—then ascend the high seat. When opening the scriptures, first knock the teeth thirty-six times, swallow saliva thirty-six times, and visualize the Hundred Spirits and Ten Thousand Perfected converging in the swirling winds. Then recite the secret incantation:\n\n*\"Subtle, subtle is the Gate of the Mysterious Origin,\nRadiant and profound, it pierces the empty void.\nThe supreme Dao arises from stillness and silence;\nThere, the Three Pure Palaces shall be seen.\nThe Great Dao is perfected here,\nRiding clouds and dragons, soaring through the heavens.\nTo left and right attend those who uphold the scriptures,\nJade maidens and jade lads.\nTheir bodies brim with the elixir of immortality,\nUntangling the nets, riding the divine winds.\nSeven ancestors return to the womb and are reborn,\nBecoming for all generations the lineage of immortals.\"*\n\nRecite the *Thirty-Nine Chapters*, the *Feminine One*, the *Great Possession*, the *Nine Perfected*, and the *Great Elixir*. Face north and bow in the heart to the four directions, knock the teeth thirty-six times, swallow saliva thirty-six times, and visualize within the five viscera five-colored lights infusing the essences of the Five Stars. Then read the *Divine Continent*, followed by the *Inner Names of the Hundred Spirits*, and finally the *Thirty-Nine Chapters*. Mind and eyes must align, with no stray thoughts; ensure each passage is completed without interruption.\n\nWhen reading the thirty-first scroll, face north and bow in the heart to the four directions, knock the teeth twenty-four times, swallow saliva thirty-four times, and visualize the Three Essences of the Five Stars and the sun and moon infusing the adept’s body. For the remaining scrolls, follow separate instructions.\n\nWhen reading the *Scripture of Wisdom* and its verses and hymns, first close the eyes, knock the teeth three times, swallow saliva three times, and visualize the Three Primordial Sovereigns in the Golden Flower Palace, appearing as infants, before reciting the text.\n\nUpon completing the recitation and exposition, descend and stand upright. Bow three times to the Three Honored Ones, then prostrate fully. Knock the teeth three times and recite the secret prayer:\n\n*\"Ascend the Brahma-realm, tread upon prosperity,\nSevenfold Numinous Venerable,\nGreat One of Utmost Endeavor,\nFive Spirits of Yellow Tranquility.\nAscend to the Nine Heavens,\nStand peerless beside the Emperor.\nI beseech flight as an immortal,\nSeven ancestors reborn as infants,\nFreed from transgressions, released from nets,\nAscending to the Jade Clarity.\"*\n\nAfterward, knock the teeth seven times and swallow saliva three times to conclude.\n\nRise and exit the hall, visualizing the spirits. Morning and evening, practice this diligently; after seven years, ascend to the heavens.\n\nThe rituals for the three periods of day and night and the six periods are the same. For those entering the altar or oratory, minor variations exist in the incantations—where \"hall\" or \"chamber\" is mentioned, substitute \"altar\" or \"oratory.\"\n\nThe altar, oratory, hall, and chamber are all arranged in three concentric layers. For major rites, the Dharma Master enters the innermost, the next-ranking officiant stands in the middle, and the assembly faces the altar from the outer layer.\n\nThe lamps of the hall and altar—beyond the seven or nine—are lit as appropriate. Generally, follow the numbers: ninety for the Upper Origin, sixty for the Middle Origin, thirty-six for the Lower Origin, totaling one hundred eighty-six. Arrange them on the left and right of the hall and altar, as well as at the gates, the Year Star, the Monthly Establishment, the Day Stem and Branch, the Natal Star, and the Current Year.\n\nThe Year Star and Natal Star lamps burn day and night without ceasing; the rest are lit only at night. If it rains, light two lamps in the hall; the others may be placed at the gates.\n\nUpon completing the circumambulation, each bows again before their Natal Star lamp and the Year Star lamp, presenting their petitions and expressing their wishes as they please.\n\nAccording to the *Bright Regulations of the Four Poles*, at the Beginning of Spring and the Spring Equinox, arrange nine lamps in the courtyard; at the Beginning of Summer and the Summer Solstice, eight; at the Beginning of Autumn and the Autumn Equinox, six; at the Beginning of Winter and the Winter Solstice, five. For the Natal Star, twelve lamps; during the Eight Festivals, face the Sovereign; for the Natal Star, face the Year Star. Knock the teeth twenty-four times and recite:\n\n*\"Supreme and Lofty Perfected,\nTen Thousand Sages and Five Emperors,\nJade Controller of the Emperor,\nGovernor of All Immortals and Perfected,\nOn this auspicious morning of the Eight Festivals,\nThe offerings are arrayed.\nSins of yang and judgments of yin,\nSevered and extinguished in the Nine Yin.\nFrom this day forth, forevermore,\nUplift the Seven Mysteries,\nDeliver from the fiery realm,\nEternally escape the Mountain of Knives.\nThe Three Paths and Five Sufferings,\nShall no longer burden my body.\nAttain harmony with heaven and earth,\nPreserve the dawn of the Emperor.\nFive Wishes and Eight Assemblies,\nAll shall be as proclaimed.\"*\n\nAfterward, remove the headscarf and bow one hundred twenty times, touching the forehead to the ground without causing pain. Upon finishing, replace the headscarf and gaze upward, reciting in the heart: *\"Today, my body receives the grace of heaven, granted rebirth in a transformed body, ascending as a flying immortal.\"* Then swallow twenty-four breaths of qi to conclude. After three years, transgressions are erased, and the body becomes one with the Perfected.\n\nFor an altar spanning nine *zhang*, arrange one hundred eighty-six lamps on each of the four sides, totaling six hundred forty-four. Beyond these, one thousand eight hundred sixty lamps are placed along gates, courtyards, and pathways, remaining lit until dawn—unless wind or rain intervenes. When the allotted time expires, conclude and report the merits accomplished.\n\nOn the morning after the fast concludes, following the circumambulation, do not replenish the censer. Instead, chant the names and titles of all present, stating each person’s rank and the Daoist registers they have received, in order of seniority. For those who have received the highest Dharma, follow the *Yellow Writ*; if participating in the master’s register, the officiant’s name is recited first.\n\nSupplicate to the Three Origins, the Supreme Perfected of the Empty Cavern and Nine Mysteries, the Lofty Jade Emperor of the Great Void, the Thirty-Nine Emperors, the Twenty-Four Perfected, the August Jade Dawn of the Supreme Great Dao Lord, the Four Controllers and Five Emperors, the Ten Thousand Dao of the Primordial Supreme Sages, and the Most Exalted Heavenly Worthies.",
      "overlap_context": "he Dao and attain the Dao, seek immortality and attain immortality, soar through the Great Void, and ascend the radiance of the Nine Heavens. May jade lads and jade maidens attend the incense smoke, presenting the petitions of your servants so-and-so before the throne of the Highest, Boundless, Supreme, Great Dao, Jade Emperor.\"*\n\nWhen finished, knock the teeth nine times, swallow saliva nine times, and cease entirely.\n\nReplenish the censer, then circumambulate and exit while chanting as before.",
      "start_char": 15954,
      "end_char": 17234,
      "start_sentence": 504,
      "end_sentence": 540,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.96084928512573,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上八道命籍经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "臣等好道乐仙，志愿腾景九玄，上谒上真，以某月某日时，於某处开启斋直，行道诵经，思神念真，合药精思，谢罪立功，洗心竭力，遵法依科，修行事竟，日限讫今，所启上请高上三元三清三宝领仙侍郎、五方五帝监灵大夫、典斋使者、飞仙天仙地仙神仙、五岳四渍四方监察真官灵仙，谒还真宫，进品上仙，加爵帝秩，随品署真。 当如太真之仪，令臣某等九玄七祖、中外先亡，同免幽夜，俱入光明，宿罪解释，福德兴隆。 臣某等行道得道，求仙得仙，作丹成丹，作金成金，精思感通，神明交游，谢罪罪释，祈福福臻，分形变化，七十四方，三元下降，降致绿軿，飞行上清，腾景九天，日月同辉，三宝齐轮，惟蒙至上，鉴映丹情。 臣某等学法，未备俯仰之格，斋法难精，多违妙轨，不合典式，进止犯科，为四司所纠，五帝所执，千愆万罪，特希赦宥，哀原未悟，愚昧不及，矜奖善心，不赐谴罚。 臣某五体真官，随寻仙职，上诣玄都，依品受秩，班赏事竟，还臣某等身中，与臣某等同科升，飞行太空。 谨以启闻，伏须告报，臣某等诚惶诚恐，稽首再拜以闻。 毕，再拜，又三捻香，复炉出，咏咒漱如常。 凡所送之物，所作之事，皆用正斋之日，随便施行，若风雨阻异，可至斋后，不得过九日。 过此更斋，首谢愆深，所为未遂，今更启告，乞果素心。 斋中吉凶，公私触忤，不终斋事，后皆更营，十之百之，得应乃止。 凡四时之日数不可过，复不得减事，悉取周。 若计用功夫，身力不赡，当货卖，借人相助为之。 所赋诸物，分人广布，必是同志，勿使杂人。 或所住幽僻，去邑道遐，皆严装船车，办强事，计力斋日限，成就工夫，不得逋违，迁延日月。 忽遇窘迫，忘失前为，为福得祸，明各慎之。 凡所办法物未得，输送非意去失，水火盗贼，魔鬼窃藏，丑类秽污，皆应委舍，启告焚埋，不得供他凡猥之用，悉更新办，依法勿亏，亦应别辞启告首谢。 凡有数种灾罪，或备有二十四条，皆不得一时并解，当三年取周，三年二十四节，不可亏一，亏一更始，此甚为难，非精志者莫能办之。 办之不办，皆不得道，将来之缘，不副今日，今日之愿，当勤精密，营念不忘，无不果者。 其中数灾数厄，数罪相关，共在六条者，一时并解六条，不必六时时解一事也。 三年之后未得感通，乃可一时一事，的的解之，积年周竟，必获上升也。 洞真太上八道命籍经卷下竟 #1据上下文，『左』字下当缺六篇诗颂。",
      "translated_text": "Your servants, devoted to the Dao and delighting in immortality, aspire to ascend through the Nine Mysteries and present ourselves before the Supreme Perfected. On the [specific] day and hour of the [specific] month, we commenced the fast and vigil at [location], performing the Dao-circuits, reciting scriptures, meditating upon the divine, invoking the Perfected, compounding elixirs with focused intent, atoning for transgressions, and establishing merit. With hearts purified and strength exhausted, we adhered to the Dharma and followed the rites. Now that the prescribed days have concluded and the practices are complete, we humbly supplicate and invoke the Most High Three Origins, the Three Clarities, the Three Treasures, the Attendant Immortals of the Divine Court, the Five Directions and Five Emperors, the Inspectors of the Numinous, the Directors of the Fast, the Flying Immortals, the Heavenly, Earthly, and Divine Immortals, the Perfected Officials and Numinous Immortals of the Five Marchmounts, the Four Seas, and the Four Quarters. May they return to their true palaces, ascend in rank as Upper Immortals, and be enfeoffed with imperial titles according to their merit.\n\nIn accordance with the rites of the Supreme Perfected, may your servants, along with our Nine Ancestors of the Mysteries, the Seven Generations of Forebears, and all departed kin both near and distant, together escape the dark night and enter the radiant light. May long-standing transgressions be absolved, and may fortune and virtue flourish.\n\nMay your servants, through the practice of the Dao, attain the Dao; through seeking immortality, attain immortality; through compounding the elixir, perfect the elixir; through refining gold, achieve gold. Through focused meditation, may we achieve resonance with the divine, commune with the numinous, have our transgressions absolved, and our prayers for blessings fulfilled. May we transform our forms, traverse the seventy-four directions, and have the Three Origins descend, sending forth green chariots. May we soar through the Upper Clarity, ascend through the Nine Heavens, shine with the brilliance of the sun and moon, and turn in harmony with the Three Treasures. We humbly beseech the Most Exalted to witness and reflect our sincere devotion.\n\nYour servants, in learning the Dharma, have not yet mastered the proper forms of reverence; in conducting the fast, have often strayed from the subtle guidelines. Our actions may not conform to the canonical standards, and our conduct may violate the regulations, subjecting us to the scrutiny of the Four Controllers and the jurisdiction of the Five Emperors. For our myriad transgressions and innumerable faults, we implore your forgiveness. Pity our ignorance and lack of understanding, reward our virtuous intentions, and spare us from punishment.\n\nMay the Perfected Officials of the Five Corporeal Realms pursue their immortal duties, ascend to the Dark Capital, receive ranks according to their merit, and complete their rewards. Upon their return to our bodies, may they ascend in unison with us, soaring through the Great Void.\n\nWith this, we respectfully submit our petition and await your response. Your servants, with utmost reverence and trepidation, prostrate ourselves and bow twice in submission.\n\nThe rites conclude. Bow twice again, perform the triple offering of incense, replenish the censer, and recite the purification mantra as usual.\n\nAll offerings and rituals should be conducted on the designated day of the fast. If hindered by wind or rain, they may be performed afterward, but no later than nine days hence. Should the delay exceed this period, another fast must be held to atone for the deepened transgressions and unfulfilled intentions. Submit a renewed petition to realize your sincere aspirations.\n\nShould inauspicious or adverse events, whether public or private, disrupt the fast, the rites must be repeated—tenfold, a hundredfold—until the response is achieved. The prescribed number of days for each of the four seasons must not be exceeded, nor should the rituals be abbreviated; all must be completed in full.\n\nIf the effort required exceeds one’s capacity, sell possessions or borrow from others to ensure completion. Distribute the offerings widely among those of like mind, avoiding those of disparate intent. For those residing in secluded or remote areas, far from towns and roads, prepare boats and carriages with diligence, calculate the strength required for the fast’s duration, and complete the work without delay or procrastination. Should sudden hardship cause one to forget prior commitments, turning blessings into misfortune, be ever vigilant.\n\nShould any ritual implements be lost, misappropriated, destroyed by water or fire, stolen by thieves, concealed by demons, or defiled by base elements, abandon them and report the matter. Bury or burn them, and do not repurpose them for profane use. Prepare new implements in accordance with the Dharma, without deficiency, and submit a separate petition to atone for the loss.\n\nFor the various calamities and transgressions—some comprising twenty-four categories—do not attempt to absolve them all at once. Instead, complete the process over three years, observing all twenty-four solar terms without omission. To omit even one requires starting anew, a task of great difficulty that only those of unwavering devotion can accomplish. Whether one succeeds or fails, the Dao will not be attained. Future opportunities may not align with present aspirations; thus, today’s vows must be pursued with diligence and precision, never wavering in intent. Only then will fulfillment be assured.\n\nFor transgressions, calamities, or misfortunes that are interconnected and fall under six categories, all six may be absolved simultaneously, rather than addressing one per term. If, after three years, resonance with the divine has not been achieved, proceed to absolve one matter at a time. Once the cycle of years is complete, ascension will surely be attained.\n\n*The Lower Scroll of the* Writ of the Eight Dao Commands and Life Registers *of the Supreme Perfected of the Cavernous Truth concludes.* #According to the context, six poetic hymns are missing below the character \"左.\"",
      "overlap_context": "highest Dharma, follow the *Yellow Writ*; if participating in the master’s register, the officiant’s name is recited first.\n\nSupplicate to the Three Origins, the Supreme Perfected of the Empty Cavern and Nine Mysteries, the Lofty Jade Emperor of the Great Void, the Thirty-Nine Emperors, the Twenty-Four Perfected, the August Jade Dawn of the Supreme Great Dao Lord, the Four Controllers and Five Emperors, the Ten Thousand Dao of the Primordial Supreme Sages, and the Most Exalted Heavenly Worthies.",
      "start_char": 17234,
      "end_char": 18184,
      "start_sentence": 541,
      "end_sentence": 562,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.21461820602417,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上八道命籍经.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}