{
  "source_id": "洞玄灵宝定观经注",
  "source_file": "chunked_daozang\\洞玄灵宝定观经注.json",
  "total_chunks": 2,
  "total_original_chars": 2595,
  "total_translated_chars": 14859,
  "total_translation_time": 71.67854762077332,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\玉诀类\\洞玄灵宝定观经注.txt",
    "category": "玉诀类"
  },
  "full_translation": "**Commentary on the *Dongxuan Lingbao Scripture of Stabilized Contemplation***\n\n**Scripture Title:** *Commentary on the Dongxuan Lingbao Scripture of Stabilized Contemplation*. The original text does not specify an author; the scripture likely emerged between the late Northern and Southern Dynasties and the Sui-Tang transition. According to colophons, the commentary was composed by the Tang-dynasty Daoist Lengxuzi.\n\n**Source of Base Text:** *Daoist Canon of the Zhengtong Era*, Dongxuan Section, Jade Instructions Category.\n**Collated Edition:** *Seven Lots from the Cloudy Satchel*, Scroll 17.\n\n---\n\n**Commentary on the *Dongxuan Lingbao Scripture of Stabilized Contemplation***\n**By Lengxuzi**\n\n\"Spiritual\" (*ling*) denotes the numinous—what is called \"spirit\" in heaven.\n\"Treasure\" (*bao*) denotes the precious—what is called \"treasure\" on earth.\nHeaven possesses spiritual transformations, its divine functions unfathomable, thus its vast covering knows no bounds.\nEarth possesses manifold treasures, sustaining and nourishing all beings, thus its profound bearing upholds the ten thousand things.\nThis scripture is like heaven and earth: it covers and upholds, possesses the spiritual and the precious, its merit and power boundless. One who realizes this mind names it *Lingbao* (\"Numinous Treasure\").\n\n\"Stabilization\" (*ding*) is the stabilization of the mind, like the earth’s immovability.\n\"Contemplation\" (*guan*) is the illumination of wisdom, like the sky’s constant radiance.\nThe essence of stabilization is without thought; the illumination of wisdom is without limit. Stabilization and wisdom cultivated equally are thus called *dingguan* (\"Stabilized Contemplation\").\n\nThe Heavenly Worthy addressed Left Mystery Perfected One, saying:\n\"Left\" (*zuo*) signifies stabilization.\n\"Mystery\" (*xuan*) signifies profound subtlety.\n\"Perfected\" (*zhen*) signifies purity—singular and without admixture.\n\"One\" (*ren*) signifies a person who penetrates principle and fathoms nature.\n\"Said\" (*yue*) is a particle of speech.\n\nIf one desires to cultivate the Dao,\nthe mind that advances and strives is called \"cultivating the Dao.\"\nFirst, one must relinquish affairs—\nfreedom from all defilement is called \"relinquishing affairs.\"\nSever all external affairs:\nthe six dusts are external affairs, which must be distanced.\nThe six dusts are form, sound, scent, flavor, touch, and dharmas.\nNo longer being stained or attached is called \"severing all.\"\nNothing opposes the mind—\nwhen circumstances do not oppose, the mind is without vexation;\nwhen the mind does not arise in defilement, circumstances are without affliction.\nWhen both mind and circumstances are forgotten, there is no vexation,\nthus it is called \"nothing opposes the mind.\"\nThen sit in stability—\ngathering and settling afflictions is called \"stability.\"\nThe original mind not arising is called \"sitting.\"\nContemplate internally the arising of the mind.\nIf one perceives a single thought arising, it must be extinguished, striving to achieve tranquility.\nThe illumination of wisdom inwardly is called \"internal contemplation.\"\nUnsevered delusive thoughts are called \"the arising of the mind.\"\nWhen a prior thought suddenly arises, the subsequent awareness follows.\nOnce the arising mind is extinguished, the illuminating awareness is also forgotten,\nthus it is called \"extinguishing.\"\nUnderstanding that the mind does not arise is called \"tranquility.\"\nThe awakened nature’s immovability is called \"stillness,\"\nthus it is called \"tranquility.\"\n\nNext, even if there is no specific attachment, drifting and chaotic thoughts must also be entirely extinguished.\nWhen the multitude of minds does not arise, false thoughts are wholly forgotten; when chaotic thoughts do not arise, how can there be attachment?\nThus it is called \"extinguishing.\"\nPractice diligently day and night, without the slightest interruption.\n\"Day\" signifies purity; \"night\" signifies defilement.\nWhen both defilement and purity are forgotten, there is no interval or interruption,\nthus it is called \"without interruption.\"\nOnly extinguish the moving mind—\nforgetting discriminative thoughts is called \"the moving mind.\"\nAwareness and illumination dispel it, thus it is called \"extinguishing.\"\nDo not extinguish the illuminating mind—\nthe illumination of wisdom is constantly bright, without interruption,\nthus it is called \"not extinguishing the illuminating mind.\"\nSimply congeal the empty mind—\nnot arising in any mind is called \"the empty mind.\"\nDo not congeal or abide in the mind—\nnon-attachment to anything is called \"not congealing or abiding in the mind.\"\nDo not rely on a single dharma while the mind abides constantly.\nIf one grasps a single dharma, this is called \"attachment to form.\"\nWhen the mind does not grasp dharmas, this is called \"not relying.\"\nIlluminating yet constantly quiescent, it is thus called \"constant abiding.\"\n\nHowever, the ordinary mind is restless and competitive.\nNext, for beginners, quieting the mind is exceedingly difficult; even if momentarily stilled, it may be lost again upon pause.\nThis speaks of habitual afflictions, which are difficult to extinguish. When the power of stabilization is not yet perfected, a momentary pause leads to loss.\nDeparture and abiding engage in battle; the hundred bodily [functions] flow unceasingly.\nWhen the mind arises in defiled circumstances, circumstances come to drag the mind; when mind and circumstances defile each other, this is called \"engaging in battle.\"\nWhen false thoughts do not cease, the hundred evils arise spontaneously,\nthus it is called \"the hundred bodily [functions] flowing unceasingly.\"\nWith prolonged and concentrated reflection, one will eventually become attuned.\nDo not, because momentary gathering is unattainable, abandon the endeavor of a thousand lifetimes.\nWhen the stabilizing mind does not arise, one accords with the true and constant.\nA single thought not gathered, and a thousand lifetimes are abandoned.\nHaving attained a measure of stillness—\nhaving attained purity, right wisdom has not yet arisen,\nthus it is called \"having attained a measure of stillness.\"\nThen, in the times of walking, standing, sitting, and reclining—\nthese are the times of the four dignified postures—\nin places of engagement with affairs, in clamorous settings,\nseeing all various forms is called \"places of engagement\"; arising in all various minds is called \"clamorous settings.\"\none intentionally stabilizes—\nquieting chaos and returning to stillness is called \"intentionally.\"\nBeing serene and properly situated is called \"stabilizing.\"\nWhether in activity or inactivity, one is always as if without mind;\nwhether in stillness or in clamor, one’s resolve remains singular.\nAbandoning both existence and nonexistence, forgetting both stillness and function, the myriad dharmas are non-dual,\nthus it is called \"singular.\"\nIf one binds the mind too tightly, this will become an illness, with qi manifesting as madness and derangement—this is its sign.\nPartiality toward stillness is called \"binding the mind.\"\nPerceiving forms outside the mind is called \"derangement.\"\nIf the mind is unmoving, one must also allow it freedom, adjusting tension and relaxation to their proper measure.\nIssuing wisdom from stabilization is called \"allowing freedom.\"\nStabilization and wisdom equally blended is called \"proper measure.\"\nNaturally and constantly regulate and harmonize—\ntoo much stabilization leads to dullness; too much wisdom leads to madness.\nStabilization and wisdom employed equally is called \"regulating and harmonizing.\"\nRestraining without attachment, allowing freedom without movement, abiding in clamor without aversion, engaging in affairs without vexation—this is true stabilization.\nQuiescent yet constantly illuminating, illuminating yet constantly quiescent, empty yet constantly functioning, functioning yet constantly empty, attaining the original and fundamental quiescence,\nthus it is called \"true stabilization.\"\nDo not, because one is without vexation in engaging affairs, seek out many affairs;\ndo not, because one is without aversion in abiding in clamor, forcefully approach clamor.\nHabitual defiled labors must constantly be restrained and governed; one must not indulge in excess.\nTaking non-activity as the true dwelling—\nseeing the original nature’s emptiness and quiescence,\nthus it is called \"the true dwelling.\"\n\nHaving affairs manifests as responsive traces. The boundless application of wisdom thus becomes responsive traces. Like water or a mirror serving as a reflection, it reveals forms in accordance with things. The original mind is pure and still, like water or a mirror—its illuminating function unimpeded, all phenomena simultaneously appearing—this is called \"revealing forms.\" Skillful expedient means arise only through attaining stabilization. All dharmas are empty in nature, quiescent without arising—thus it is called \"entering stabilization.\" The speed of wisdom’s arising does not depend on the person. Do not urgently seek wisdom within stabilization, for haste injures the nature, and injury precludes wisdom. Eagerly pursuing knowledge and perception destroys true stabilization. Clinging to all appearances is called \"lacking wisdom.\" If, without seeking wisdom in stabilization, wisdom arises spontaneously, this is called \"true wisdom.\" The mind’s essence is quiescent, its wondrous function inexhaustible—thus it is called \"true stabilization.\" Wisdom unused is true insight resembling foolishness. Comprehending without discrimination is called \"unused.\" Concealing brilliance and obscuring traces is thus called \"resembling foolishness.\" Both stabilization and wisdom are perfected, their beauty boundless. Quiescence and illumination merge equally—thus it is called \"boundless beauty.\"\n\nIf within stabilization thoughts arise, they often attract manifold demons—specters and spirits of all kinds appear in response to the mind. This is the mind grasping at appearances. When all appearances arise, every demon and evil spirit competes to disturb and confuse. Even the sight of Heavenly Worthies, immortals, or perfected beings is but an auspicious sign—these too are appearances and must not be clung to. Only let the stabilized mind be utterly unobstructed above, vast and unbounded below. No prior thought arises—thus it is called \"unobstructed above\"; no subsequent thought arises—thus it is called \"unbounded below.\" Old karma daily dissolves, new karma is not created. Past habits are entirely exhausted—this is called \"old karma daily dissolving\"; no further thoughts arise—thus it is called \"new karma not created.\" Without entanglements, one transcends the cage of dust. Free from all defilement—this is called \"without entanglements\"; liberated and unbound—thus it is called \"transcending the cage of dust.\"\n\nWith prolonged practice, the Dao is naturally attained. Unceasing luminous insight—this is called \"prolonged practice\"; accord with principle and union with truth—thus it is called \"attaining the Dao.\" Those who attain the Dao exhibit seven signs: First, the mind easily attains stabilization and perceives all defiled leaks. The mind attains purity and knows all defiled thoughts—thus it is called \"perceiving all defiled leaks.\" Second, chronic illnesses vanish entirely, body and mind become light and refreshed. True qi and fetal breathing heal all deep-seated ailments. Embodied union with the Dao brings a lightness of body and agelessness. Third, premature decay is restored, years are regained, and life is renewed. Bones and marrow become firm and full—thus it is called \"restoring premature decay\"; the countenance remains unchanged—this is called \"regaining years and renewing life.\" Fourth, one extends life for ten thousand years and is called an immortal. Attaining longevity without death, extending life for ten thousand years, one’s name is recorded in the immortal registers—thus it is called an \"immortal.\" Fifth, refining form into qi, one is called a perfected person. Attaining the original primordial qi—thus it is called \"refining form into qi\"; the true nature is without falsity—thus it is called a \"perfected person.\" Sixth, refining qi into spirit, one is called a spirit person. True qi communicates with spirit, yin and yang are unfathomable—thus it is called a \"spirit person.\" Seventh, refining spirit to merge with the Dao, one is called a consummate person. True spirit unites with the Dao—thus it is called a \"consummate person.\" Their discerning power grows ever clearer with each sign. \"Discerning power\" means constant, unceasing illumination. \"Ever clearer\" means luminosity without end.\n\nWhen the Dao is attained and perfected, wisdom becomes fully complete. If the original nature is realized, the Dao is attained and truth is perfected—wisdom becomes perfectly luminous, and all dharmas are complete. If, after long study of the stabilized mind, the body shows none of these signs, and one’s brief, impure life ends with the fading of form—claiming to have awakened wisdom or attained the Dao—such a one has not truly grasped the principle of seeking the Dao. Only through communion with spirit and union with the Dao is true attainment of the Dao achieved. Delusion of the mind and death of the body keep one from transcending birth and death. As the *Scripture of Western Ascension* states: \"Thus, losing the root of life, how can one know the source of the Dao?\"\n\nThere is a gāthā that says:\nWisdom arises from conditions,\nFire is born from causes.\nEach is the true seed-nature,\nYet following the current, the source of the Dao is lost.\nTo seek cessation of knowledge by arousing the mind—\nThe mind arises, and vexation increases.\nRealizing the nature is fundamentally empty,\nKnowledge becomes the gateway to all wonders.\n\nThe *Commentary on the Scripture of Stabilization and Contemplation of the Numinous Treasure* concludes here.\n\nThe Dao is learned through the mind, not sought elsewhere;\nSpirit resides in form, with nothing beyond.\nMy numinous luminosity spans past and present,\nYet bound by the six senses, my true thought is harmed.\nGreed, anger, delusion, and ignorance—\nManifold perceptual delusions,\nTurning from truth toward falsity,\nWithout end.\nTruly, the true teacher, pitying the ignorance of sentient beings,\nExpounded this wondrous scripture,\nAs a model for humans and gods,\nA ladder and vessel for attaining the Dao.\nThus, the teaching of stabilization and contemplation\nUnfolds the wondrous essence,\nPenetrates the profound and subtle,\nWashes away defilements,\nTranscends sight and sound;\nIlluminates the formless behind forms,\nExtends emptiness to the unmanifest,\nForgets both self and others,\nPerfects both form and spirit.\nAll my fellow Daoists,\nRevere it, revere it.\n\nRespectfully inscribed on an auspicious day in the third month of the *ren-shen* year of the *Longji* era,\nBy Lengxuzi.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞玄灵宝定观经注 经名：洞玄灵宝定观经注。 原不题撰者，经文约出於南北朝末或隋唐之际。 又据徒跋，注文当系唐代道士泠虚子撰。 底本出处：《正统道藏》洞玄部玉诀类。 参校本：《云笈七签》卷十七。 洞玄灵宝定观经注 冷虚子注 灵者，神也，在天曰灵。 宝者，珍也，在地曰宝。 天有灵化，神用不测，则广覆无边； 地有众宝，济养群品，则厚载万物。 言此经如天如地，能覆能载，有灵有宝，功德无穷，证得此心，故名灵宝。 定者，心定也，如地不动。 观者，慧观也，如天常照。 定体无念，慧照无边，定慧等修，故名定观。 天尊告左玄真人曰： 左者，定也。 玄者，深妙也。 真者，纯也，一而无杂。 人者，通理达性之人也。 曰者，语辞也。 夫欲修道， 进趣之心，名为修道。 先能舍事， 一切无染，名为舍事。 外事都绝， 六尘为外事，须远离也。 六尘者，色、声、香、味、触、法。 更不染着，名为都绝。 无与忤心， 境不来忤，心即无恼； 心不起染，境则无烦。 心境两忘，即无烦恼。 故名无与忤心。 然后安坐， 摄澄烦恼，名之为安。 本心不起，名之为坐。 内观心起。 若觉一念起，须除灭，务令安静。 慧心内照，名曰内观。 漏念未除，名为心起。 前念忽起，后觉则随。 起心既灭，觉照亦忘。 故称除灭。 了心不起，名之为安。 觉性不动，名之为静。 故称安静。 其次，虽非的有贪着，浮游乱想，亦尽灭除。 众心不起，妄念悉忘，乱想不生，何有贪着？ 故曰灭除。 昼夜勤行，须臾不替。 昼之言净，夜之言垢。 垢净两忘，无有间替，故名不替。 唯灭动心， 忘想分别，名曰动心。 觉照祛之，故名为灭。 不灭照心； 慧照常明，无有间，故名不灭照心。 但凝空心， 不起一切心名空心。 不凝住心， 一切无着，名之不凝住心。 不依一法而心常住。 若取一法，即名着相。 心不取法，名为不依。 照而常寂，故为常住。 然则凡心躁竞。 其次，初学息心甚难，或息不得，暂停还失。 言习性烦恼，难可灭除，定力未成，暂停还失也。 去留交战，百体流行。 心起染境，境来牵心，心境相染，故名交战。 妄念不息，百非自生，名曰百体流行。 久久精思，方乃调熟。 勿以暂收不得，遂废千生之业。 定心不起，则契真常。 一念不收，千生遂废。 少得静#1已， 初得清净，正慧未生，故曰少得静已o 则於行立坐卧之时， 四威仪之时也。 涉事之处，喧闹之所， 见一切诸相为涉之处，起一切诸心，名为喧闹之所也。 皆作意安； 息乱归寂，名为作意。 恬淡得所，名之为安也。 有事无事，常若无心； 处静处喧，其志惟一。 有无双遣，寂用俱忘，万法不二，名之唯一。 若束心太急，又则成病，气发狂颠，是其候也。 偏心执静，名曰束心。 心外见相，名为颠也。 心若不动，又须放任，宽急得所。 从定发慧，名为放任。 定慧齐融，名曰得所。 自恒调适， 定多即愚，慧多即狂； 定慧等用，名曰调适。 制而不着，放而不动，处喧无恶，涉事无恼者，此是真定。 寂而常照，照而常寂，空而常用，用而常空，得本元寂，故为真定。 不以涉事无恼，故求多事； 不以处喧无恶，强来就喧。 习性尘劳，常须制御，不可纵逸。 以无事为真宅， 见本性空寂，故为真宅。",
      "translated_text": "**Commentary on the *Dongxuan Lingbao Scripture of Stabilized Contemplation***\n\n**Scripture Title:** *Commentary on the Dongxuan Lingbao Scripture of Stabilized Contemplation*. The original text does not specify an author; the scripture likely emerged between the late Northern and Southern Dynasties and the Sui-Tang transition. According to colophons, the commentary was composed by the Tang-dynasty Daoist Lengxuzi.\n\n**Source of Base Text:** *Daoist Canon of the Zhengtong Era*, Dongxuan Section, Jade Instructions Category.\n**Collated Edition:** *Seven Lots from the Cloudy Satchel*, Scroll 17.\n\n---\n\n**Commentary on the *Dongxuan Lingbao Scripture of Stabilized Contemplation***\n**By Lengxuzi**\n\n\"Spiritual\" (*ling*) denotes the numinous—what is called \"spirit\" in heaven.\n\"Treasure\" (*bao*) denotes the precious—what is called \"treasure\" on earth.\nHeaven possesses spiritual transformations, its divine functions unfathomable, thus its vast covering knows no bounds.\nEarth possesses manifold treasures, sustaining and nourishing all beings, thus its profound bearing upholds the ten thousand things.\nThis scripture is like heaven and earth: it covers and upholds, possesses the spiritual and the precious, its merit and power boundless. One who realizes this mind names it *Lingbao* (\"Numinous Treasure\").\n\n\"Stabilization\" (*ding*) is the stabilization of the mind, like the earth’s immovability.\n\"Contemplation\" (*guan*) is the illumination of wisdom, like the sky’s constant radiance.\nThe essence of stabilization is without thought; the illumination of wisdom is without limit. Stabilization and wisdom cultivated equally are thus called *dingguan* (\"Stabilized Contemplation\").\n\nThe Heavenly Worthy addressed Left Mystery Perfected One, saying:\n\"Left\" (*zuo*) signifies stabilization.\n\"Mystery\" (*xuan*) signifies profound subtlety.\n\"Perfected\" (*zhen*) signifies purity—singular and without admixture.\n\"One\" (*ren*) signifies a person who penetrates principle and fathoms nature.\n\"Said\" (*yue*) is a particle of speech.\n\nIf one desires to cultivate the Dao,\nthe mind that advances and strives is called \"cultivating the Dao.\"\nFirst, one must relinquish affairs—\nfreedom from all defilement is called \"relinquishing affairs.\"\nSever all external affairs:\nthe six dusts are external affairs, which must be distanced.\nThe six dusts are form, sound, scent, flavor, touch, and dharmas.\nNo longer being stained or attached is called \"severing all.\"\nNothing opposes the mind—\nwhen circumstances do not oppose, the mind is without vexation;\nwhen the mind does not arise in defilement, circumstances are without affliction.\nWhen both mind and circumstances are forgotten, there is no vexation,\nthus it is called \"nothing opposes the mind.\"\nThen sit in stability—\ngathering and settling afflictions is called \"stability.\"\nThe original mind not arising is called \"sitting.\"\nContemplate internally the arising of the mind.\nIf one perceives a single thought arising, it must be extinguished, striving to achieve tranquility.\nThe illumination of wisdom inwardly is called \"internal contemplation.\"\nUnsevered delusive thoughts are called \"the arising of the mind.\"\nWhen a prior thought suddenly arises, the subsequent awareness follows.\nOnce the arising mind is extinguished, the illuminating awareness is also forgotten,\nthus it is called \"extinguishing.\"\nUnderstanding that the mind does not arise is called \"tranquility.\"\nThe awakened nature’s immovability is called \"stillness,\"\nthus it is called \"tranquility.\"\n\nNext, even if there is no specific attachment, drifting and chaotic thoughts must also be entirely extinguished.\nWhen the multitude of minds does not arise, false thoughts are wholly forgotten; when chaotic thoughts do not arise, how can there be attachment?\nThus it is called \"extinguishing.\"\nPractice diligently day and night, without the slightest interruption.\n\"Day\" signifies purity; \"night\" signifies defilement.\nWhen both defilement and purity are forgotten, there is no interval or interruption,\nthus it is called \"without interruption.\"\nOnly extinguish the moving mind—\nforgetting discriminative thoughts is called \"the moving mind.\"\nAwareness and illumination dispel it, thus it is called \"extinguishing.\"\nDo not extinguish the illuminating mind—\nthe illumination of wisdom is constantly bright, without interruption,\nthus it is called \"not extinguishing the illuminating mind.\"\nSimply congeal the empty mind—\nnot arising in any mind is called \"the empty mind.\"\nDo not congeal or abide in the mind—\nnon-attachment to anything is called \"not congealing or abiding in the mind.\"\nDo not rely on a single dharma while the mind abides constantly.\nIf one grasps a single dharma, this is called \"attachment to form.\"\nWhen the mind does not grasp dharmas, this is called \"not relying.\"\nIlluminating yet constantly quiescent, it is thus called \"constant abiding.\"\n\nHowever, the ordinary mind is restless and competitive.\nNext, for beginners, quieting the mind is exceedingly difficult; even if momentarily stilled, it may be lost again upon pause.\nThis speaks of habitual afflictions, which are difficult to extinguish. When the power of stabilization is not yet perfected, a momentary pause leads to loss.\nDeparture and abiding engage in battle; the hundred bodily [functions] flow unceasingly.\nWhen the mind arises in defiled circumstances, circumstances come to drag the mind; when mind and circumstances defile each other, this is called \"engaging in battle.\"\nWhen false thoughts do not cease, the hundred evils arise spontaneously,\nthus it is called \"the hundred bodily [functions] flowing unceasingly.\"\nWith prolonged and concentrated reflection, one will eventually become attuned.\nDo not, because momentary gathering is unattainable, abandon the endeavor of a thousand lifetimes.\nWhen the stabilizing mind does not arise, one accords with the true and constant.\nA single thought not gathered, and a thousand lifetimes are abandoned.\nHaving attained a measure of stillness—\nhaving attained purity, right wisdom has not yet arisen,\nthus it is called \"having attained a measure of stillness.\"\nThen, in the times of walking, standing, sitting, and reclining—\nthese are the times of the four dignified postures—\nin places of engagement with affairs, in clamorous settings,\nseeing all various forms is called \"places of engagement\"; arising in all various minds is called \"clamorous settings.\"\none intentionally stabilizes—\nquieting chaos and returning to stillness is called \"intentionally.\"\nBeing serene and properly situated is called \"stabilizing.\"\nWhether in activity or inactivity, one is always as if without mind;\nwhether in stillness or in clamor, one’s resolve remains singular.\nAbandoning both existence and nonexistence, forgetting both stillness and function, the myriad dharmas are non-dual,\nthus it is called \"singular.\"\nIf one binds the mind too tightly, this will become an illness, with qi manifesting as madness and derangement—this is its sign.\nPartiality toward stillness is called \"binding the mind.\"\nPerceiving forms outside the mind is called \"derangement.\"\nIf the mind is unmoving, one must also allow it freedom, adjusting tension and relaxation to their proper measure.\nIssuing wisdom from stabilization is called \"allowing freedom.\"\nStabilization and wisdom equally blended is called \"proper measure.\"\nNaturally and constantly regulate and harmonize—\ntoo much stabilization leads to dullness; too much wisdom leads to madness.\nStabilization and wisdom employed equally is called \"regulating and harmonizing.\"\nRestraining without attachment, allowing freedom without movement, abiding in clamor without aversion, engaging in affairs without vexation—this is true stabilization.\nQuiescent yet constantly illuminating, illuminating yet constantly quiescent, empty yet constantly functioning, functioning yet constantly empty, attaining the original and fundamental quiescence,\nthus it is called \"true stabilization.\"\nDo not, because one is without vexation in engaging affairs, seek out many affairs;\ndo not, because one is without aversion in abiding in clamor, forcefully approach clamor.\nHabitual defiled labors must constantly be restrained and governed; one must not indulge in excess.\nTaking non-activity as the true dwelling—\nseeing the original nature’s emptiness and quiescence,\nthus it is called \"the true dwelling.\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1387,
      "start_sentence": 0,
      "end_sentence": 104,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.922168016433716,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\洞玄灵宝定观经注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "有事为应迹。 慧用无边，故为应迹。 若水镜之为鉴，则随物而现形。 本心清净，犹如水镜，照用无碍，万象#2俱现，名为现形。 善巧方便，唯能入定。 诸法性空，寂无所起，故为入定。 慧发迟速，则不由人。 勿令定中急急求慧，急则伤性，伤则无慧。 急求知见，真定乃亡。 贪着诸相，故云无慧。 若定不求慧而慧自生，此名真慧。 心体寂静，妙用无穷，故为真定。 慧而不用，实智若愚。 了无分别，名之不用。 韬光晦迹，故曰若愚。 益资定慧，双美无极。 寂照齐融，故云双美无极。 若定中念想，多感众邪，妖精百魅，随心应见。 为心取相。 诸相应生，一切邪魔，竞来挠乱。 所见天尊、诸仙、真人，是其祥也。 此为诸相，不可取着。 唯令定心之上，豁然无覆； 定心之下，旷然无基。 前念不生，故云无覆； 后念不起，故曰无基。 旧业日销，新业不造。 宿习并尽，名曰旧业日销，更不起心，故名新业不造。 无所挂碍，迥脱尘笼。 一切无染，故名无所挂碍； 解脱无系，故云迥脱尘笼。 行而久之，自然得道。 智照不灭，名曰行而久之； 契理合真，故云得道。 夫得道之人，凡有七候； 一者，心得定易，觉诸尘漏； 心得清静，尘念尽知，故曰觉诸尘漏。 二者，宿疾普销，身心轻爽； 真气胎息，痼#3疾尽瘳。 体道合真，身轻不老。 三者，填补夭损，还年复命； 骨髓坚满，故填补夭损； 驻颜不易，名为还年复命也。 四者，延数万岁，名曰仙人； 长生不死，延数万岁，名编仙箓，故曰仙人。 五者，炼形为气，名曰真人； 得本元气，故曰炼形为气； 正性无伪，故曰真人。 六者，炼气成神，名曰神人； 真气通神，阴阳不测，故曰神人。 七者，炼神合道，名曰至人。 真神契道，故曰至人。 其於鉴力，随候益明。 鉴力者，常照不息也。 益明者，明明不绝也。 得至道成，慧乃圆备。 若了本性，得道成真，智慧圆明，万法俱备。 若乃久学定心，身无一候，促龄秽质，色谢方空。 自云慧觉，又称成道者，求道之理，实所未然。 通神合道即得道真成#4。 心惑身亡#5，不离生死。 《西升经》云：是故失生本，焉能知道源？ 而说颂曰： 智起生於境，火发生於缘。 各是真种性#6，承流失道源。 起心欲息知，心起知更烦。 了知性本空，知则众妙门。 洞玄灵宝定观经注终#7 道由心学，匪假佗求； 神依形住，罔有其外。 我之灵明，亘今亘古，惟其绁於六情，是以戕我正念。 贪嗔痴昧，种种见惑，背真向伪，无有殚期。 寔惟真师悯念众生无知，故演此妙经，作人天规鉴，为证道梯航。 是有定观之说，发挥妙本，洞彻玄微，涤乎垢氛，超乎视听； 明无相於有形之后，致虚极於未兆之先； 物我俱忘，形神俱妙。 凡我羽流，敬之敬之。 龙集壬申三月初吉，泠虚子稽首谨识。 洞玄灵宝定观经注竟 #1 『静』，《云笈七签》本作『浄』。 #2 『万象』，《云笈七签》本作『万物』 。 #3 『痼』，《云笈七签》本作『故』。 #4 『即得道真成』，《云岌七签》本作『即身得道真』。 #5 『惑』，《云笈七签》本作『证』 。 #6 『种』，《云笈七签》本作『动」。 #7 《云笈七签》本所录经注止於此，无后泠虚子题识。",
      "translated_text": "Having affairs manifests as responsive traces. The boundless application of wisdom thus becomes responsive traces. Like water or a mirror serving as a reflection, it reveals forms in accordance with things. The original mind is pure and still, like water or a mirror—its illuminating function unimpeded, all phenomena simultaneously appearing—this is called \"revealing forms.\" Skillful expedient means arise only through attaining stabilization. All dharmas are empty in nature, quiescent without arising—thus it is called \"entering stabilization.\" The speed of wisdom’s arising does not depend on the person. Do not urgently seek wisdom within stabilization, for haste injures the nature, and injury precludes wisdom. Eagerly pursuing knowledge and perception destroys true stabilization. Clinging to all appearances is called \"lacking wisdom.\" If, without seeking wisdom in stabilization, wisdom arises spontaneously, this is called \"true wisdom.\" The mind’s essence is quiescent, its wondrous function inexhaustible—thus it is called \"true stabilization.\" Wisdom unused is true insight resembling foolishness. Comprehending without discrimination is called \"unused.\" Concealing brilliance and obscuring traces is thus called \"resembling foolishness.\" Both stabilization and wisdom are perfected, their beauty boundless. Quiescence and illumination merge equally—thus it is called \"boundless beauty.\"\n\nIf within stabilization thoughts arise, they often attract manifold demons—specters and spirits of all kinds appear in response to the mind. This is the mind grasping at appearances. When all appearances arise, every demon and evil spirit competes to disturb and confuse. Even the sight of Heavenly Worthies, immortals, or perfected beings is but an auspicious sign—these too are appearances and must not be clung to. Only let the stabilized mind be utterly unobstructed above, vast and unbounded below. No prior thought arises—thus it is called \"unobstructed above\"; no subsequent thought arises—thus it is called \"unbounded below.\" Old karma daily dissolves, new karma is not created. Past habits are entirely exhausted—this is called \"old karma daily dissolving\"; no further thoughts arise—thus it is called \"new karma not created.\" Without entanglements, one transcends the cage of dust. Free from all defilement—this is called \"without entanglements\"; liberated and unbound—thus it is called \"transcending the cage of dust.\"\n\nWith prolonged practice, the Dao is naturally attained. Unceasing luminous insight—this is called \"prolonged practice\"; accord with principle and union with truth—thus it is called \"attaining the Dao.\" Those who attain the Dao exhibit seven signs: First, the mind easily attains stabilization and perceives all defiled leaks. The mind attains purity and knows all defiled thoughts—thus it is called \"perceiving all defiled leaks.\" Second, chronic illnesses vanish entirely, body and mind become light and refreshed. True qi and fetal breathing heal all deep-seated ailments. Embodied union with the Dao brings a lightness of body and agelessness. Third, premature decay is restored, years are regained, and life is renewed. Bones and marrow become firm and full—thus it is called \"restoring premature decay\"; the countenance remains unchanged—this is called \"regaining years and renewing life.\" Fourth, one extends life for ten thousand years and is called an immortal. Attaining longevity without death, extending life for ten thousand years, one’s name is recorded in the immortal registers—thus it is called an \"immortal.\" Fifth, refining form into qi, one is called a perfected person. Attaining the original primordial qi—thus it is called \"refining form into qi\"; the true nature is without falsity—thus it is called a \"perfected person.\" Sixth, refining qi into spirit, one is called a spirit person. True qi communicates with spirit, yin and yang are unfathomable—thus it is called a \"spirit person.\" Seventh, refining spirit to merge with the Dao, one is called a consummate person. True spirit unites with the Dao—thus it is called a \"consummate person.\" Their discerning power grows ever clearer with each sign. \"Discerning power\" means constant, unceasing illumination. \"Ever clearer\" means luminosity without end.\n\nWhen the Dao is attained and perfected, wisdom becomes fully complete. If the original nature is realized, the Dao is attained and truth is perfected—wisdom becomes perfectly luminous, and all dharmas are complete. If, after long study of the stabilized mind, the body shows none of these signs, and one’s brief, impure life ends with the fading of form—claiming to have awakened wisdom or attained the Dao—such a one has not truly grasped the principle of seeking the Dao. Only through communion with spirit and union with the Dao is true attainment of the Dao achieved. Delusion of the mind and death of the body keep one from transcending birth and death. As the *Scripture of Western Ascension* states: \"Thus, losing the root of life, how can one know the source of the Dao?\"\n\nThere is a gāthā that says:\nWisdom arises from conditions,\nFire is born from causes.\nEach is the true seed-nature,\nYet following the current, the source of the Dao is lost.\nTo seek cessation of knowledge by arousing the mind—\nThe mind arises, and vexation increases.\nRealizing the nature is fundamentally empty,\nKnowledge becomes the gateway to all wonders.\n\nThe *Commentary on the Scripture of Stabilization and Contemplation of the Numinous Treasure* concludes here.\n\nThe Dao is learned through the mind, not sought elsewhere;\nSpirit resides in form, with nothing beyond.\nMy numinous luminosity spans past and present,\nYet bound by the six senses, my true thought is harmed.\nGreed, anger, delusion, and ignorance—\nManifold perceptual delusions,\nTurning from truth toward falsity,\nWithout end.\nTruly, the true teacher, pitying the ignorance of sentient beings,\nExpounded this wondrous scripture,\nAs a model for humans and gods,\nA ladder and vessel for attaining the Dao.\nThus, the teaching of stabilization and contemplation\nUnfolds the wondrous essence,\nPenetrates the profound and subtle,\nWashes away defilements,\nTranscends sight and sound;\nIlluminates the formless behind forms,\nExtends emptiness to the unmanifest,\nForgets both self and others,\nPerfects both form and spirit.\nAll my fellow Daoists,\nRevere it, revere it.\n\nRespectfully inscribed on an auspicious day in the third month of the *ren-shen* year of the *Longji* era,\nBy Lengxuzi.",
      "overlap_context": "attaining the original and fundamental quiescence,\nthus it is called \"true stabilization.\"\nDo not, because one is without vexation in engaging affairs, seek out many affairs;\ndo not, because one is without aversion in abiding in clamor, forcefully approach clamor.\nHabitual defiled labors must constantly be restrained and governed; one must not indulge in excess.\nTaking non-activity as the true dwelling—\nseeing the original nature’s emptiness and quiescence,\nthus it is called \"the true dwelling.\"",
      "start_char": 1388,
      "end_char": 2766,
      "start_sentence": 105,
      "end_sentence": 190,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.7563796043396,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\洞玄灵宝定观经注.txt",
        "category": "玉诀类"
      }
    }
  ]
}