{
  "source_id": "洞真太上金篇虎符真文经",
  "source_file": "chunked_daozang\\洞真太上金篇虎符真文经.json",
  "total_chunks": 2,
  "total_original_chars": 1995,
  "total_translated_chars": 12804,
  "total_translation_time": 62.7659432888031,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\洞真太上金篇虎符真文经.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Wondrous Scripture of the Golden Tiger Talisman of the Supreme Cavernous Perfection**\n\n**Scripture Title:** *The Wondrous Scripture of the Golden Tiger Talisman of the Supreme Cavernous Perfection*. Its compiler is unknown, likely dating to the Eastern Jin or Southern Dynasties. It is an abridged adaptation of the *Golden Tiger* and *Divine Tiger* talismans. One scroll.\n\n**Source Text:** *Daoist Canon of the Orthodox Tradition*, Section Zheng Yi.\n\n---\n\n**The Wondrous Scripture of the Golden Tiger Talisman of the Supreme Cavernous Perfection**\n\nThe Golden Tiger True Talisman was transmitted by the Heavenly Emperor of the Grand Tenuity to the Celestial Lord of the Golden Tower. Inscribed in cinnabar upon white silk and encased in a purple brocade pouch, it is worn upon the head when in use. Thus empowered, one commands the spirits of heaven and earth, and all divine immortals bow in reverence. Jade maidens proffer towels, celestial warriors guard the body, and the mountains and peaks submit their essence.\n\nWhen combined with the incantation of divine authority and the jade scripture of numinous essence, one may decapitate the Nine Demons and annihilate a thousand specters. This is a forbidden talisman of the Supreme Clarity, not to be disseminated in the world. Those who wear it ascend to the Supreme Clarity.\n\nThe **Inner Incantation of the Supreme Radiance of the Primordial Qi’s Golden True Might** is employed to summon divine soldiers and exterminate wayward souls. One must enter a chamber, burn incense, and strike the teeth thirty-six times. Seated or reclining at will, recite the following:\n\n*\"Expel the Toxic King of Qian,\nThe Banner of Zhen-Shi-Luo,\nThe Eight Immortals wielding axes,\nThe Five Numinous Ones of the Supreme Emperor,\nThe Supreme Mystery’s Falling Radiance,\nThe Seven Dawns guarding the courtyard,\nThe Yellow True’s luminous talisman,\nFlaming bells cast in splendor,\nThe Divine Tiger baring its fangs,\nPoisoned blades raging unchecked,\nThe Purple Flourishing of Patterned Rites,\nFour leaps, roaring skyward,\nThe Nine Heavens and Six Heavens,\nThe Four Heavens gleaming bright,\nExternally enwrapped in primordial qi,\nInternally commanding the marshaled hosts,\nLeft wielding might, right surveying,\nWind cleaves, fire conquers,\nRoaring to slay ten thousand specters,\nSeizing and beheading a thousand spirits,\nThe Golden True awakens in thunder,\nThe Nine Demons submit their forms,\nThe Northern Feng crumbles,\nAll that is destroyed collapses.\nI wear the true talisman,\nCommanding ten thousand spirits.\nThe Three Origins declare the truth,\nMysteriously uniting with the Emperor’s sincerity.\nBy the Supreme Tenuity’s decree,\nAscend to the Three Clarities.\"*\n\nThe method of the **Inner Incantation of the Supreme Radiance’s Might** belongs to the forbidden scriptures of the Supreme Clarity.\n\nThe **\"Toxic King of Qian\"** is the esoteric name of the great demon of the Six Heavens.\nThe **\"Banner of Zhen-Shi-Luo\"** is the hidden title of the Demon King of the Northern Emperor.\nThe **\"Four Heavens gleaming bright\"** are the soul-names of the ghost-ministers of the Northern Feng.\n\nOne who knows the names of these three demons causes a thousand specters to flee and ten thousand ghosts to conceal their forms. The Nine Demons dare not stir, and a hundred evils cannot inflict harm. Whether dwelling alone in mountains and forests or amidst the spirits of temples and shrines, one may act accordingly without needing to burn incense or enter a chamber.\n\nAlternatively, inscribe the talisman with realgar upon green silk, three feet in length and one foot two inches in width—or a square of one foot two inches. Border it on all four sides with red brocade, and wear it on the right side of the waist. When entering a fast or chamber, or during the eight or nine assemblies of dawn and dusk, it may be worn to subdue demons, summon spirits, and command divine perfected beings.\n\nBeware never to approach corpses or impurities, for the sin is equal to leaking the secret. The Ancestor of the Seven Mysteries will be punished in hell.\n\n---\n\n**The Jade Scripture of the Divine Tiger’s Inner True Talisman**\n\nThe Divine Tiger True Talisman was bestowed by the Supreme Perfected Parents of the Nine Heavens. The Supreme Perfected Elder transmitted it to the Youth of the Eastern Sea, and the True King of the Nine Heavens transmitted it to the Supreme Dao Lord. The Supreme Dao Lord treasured and concealed it within the Jade Chamber of the Numinous Capital of the Grand Tenuity, guarded by mighty beasts and defended by venomous dragons. Seven thousand Divine Tigers stand ready in the Golden Tower, while three hundred Golden Dawn Jade Lads and three hundred Pure Numinous Jade Maidens attend the sacred scripture.\n\nIts mystic radiance shines through empty space, scattering purple mist across the courtyard. Its might shakes the nine distant realms, its divine light blazes in the Supreme Clarity, its wondrous harmony arises from spontaneity, and its penetrating wisdom pierces the formless. The Divine Tiger’s stripes manifest its image, the Golden Tiger spans its truth, wisdom marks its essence, and the vanquishing of demons unfolds its source.\n\nIts subtle meanings and hidden phrases are difficult to fathom, for they record the hidden titles of heavenly demons and the esoteric names of a hundred spirits. Reciting its verses startles a thousand spirits, and chanting its passages binds ten thousand specters.\n\nAt the inception of governance in the Three Heavens, it was entrusted to the Heavenly Emperor of the Grand Tenuity, empowering him to overawe the Six Heavens, decapitate ten thousand specters, summon mountains and seas, bind all spirits, subdue demons, and reverse the course of the five planets.\n\nThereupon, the Heavenly Emperor of the Grand Tenuity received the two talismans of **Numinous Golden Wisdom for Vanquishing Demons**. Wearing them, he soared through the Supreme Clarity, riding the void in a transcendent chariot. He traversed the Grand Tenuity, alighted in the Palace of the Supreme Perfected’s Radiance, and stood upon the steps of the Jade Emperor. At rest, he harmonized with heaven and earth; in motion, he gleamed with the Seven Luminaries. He rectified the Nine Mysteries, grasped the tally of numinous mechanism, encompassed the ten thousand measures, and unified the myriad rhythms. He stirred the hundred yang to generate lightning and moved the thousand yin to unleash might. Divine auroras draped the Dao over the Golden Tower, and the Celestial Pass responded to resonance, opening of itself. He commanded the Eight Radiant Ones to ascend, spurred the Divine Tiger to take flight, and the host of immortals cleared the path while the Seven Stars hastened in motion. Mystic light dimmed and stagnated, transforming in myriad wondrous ways. Gazing into the boundless, he surveyed the edges of the heavens, casting his eyes upon the Five Turbidities and lamenting the suffering of life and death. Truly, how subtle is the marvel of the Numinous North!\n\nThe Heavenly Emperor of the Grand Tenuity addressed the Prime Minister, the Azure Youth, and the Lord of the Western City, saying: *\"The Supreme Clarity’s Great Wisdom Scripture for Vanquishing Demons is the Jade Scroll of the Supreme Ultimate, the supreme treasure formula. Its divine verses are the treasured chapters of the Supreme Perfected of the Nine Heavens. Wisdom dispels impurity, vanquishing demons binds evil, and true talismans subdue demons. Those who possess jade tablets with purple names and cultivate the supreme method shall not be assailed by myriad specters or tested by ten thousand demons. Truly, no harm can befall them, no trial can touch them—such is the might of the Divine Tiger and the wondrous efficacy of the true scripture. Now I entrust it to you, to transmit to future disciples who are destined to become perfected beings.\"*\n\nIn accordance with the statutes of the Supreme Perfected, within seven hundred years, transmission may be granted thrice, but it must not be shown to the unworthy. Should the true scripture be recklessly revealed, the offender shall suffer the torment of the Wind Blade, and calamity shall extend to the seven generations of their ancestors. If one bears a golden name from the Eastern Florescence and a verdant inscription of the Supreme Clarity, upon receiving this talisman, thirty-six jade lads and jade maidens shall attend and guard their person. With this, they may traverse perilous trials, cross mountains and seas, summon spirits and subdue ghosts, and command the sacred peaks. Wherever they go, a thousand demons shall prostrate at their side, ten thousand evil spirits shall be bound in form, and hosts of immortals shall serve as their guard, their body radiating wondrous light. If they cultivate for less than seven years, the true spirits shall descend to their chamber, and they shall ascend in broad daylight upon a flying chariot with green canopy.\n\nThe recipient must observe a fast for ninety days, or thirty days, or seventy days, and offer ten taels of refined gold as a token of faith to the divine perfected, ninety feet of brocade to swear an oath before the Nine Heavens, and thirty feet of azure silk to pledge their heart. Those who cherish the Dao and delight in truth, who diligently focus their minds on the mysteries, who do not begrudge wealth but value the Dao above all—such is the kind of person with whom this may be shared. The Dao abides with them. But those who inwardly covet riches and outwardly indulge in frivolous desires—the Dao has already discerned them. Seal the scripture within a jade coffer, lock it with a golden bolt, and after their ascension, conceal it deep within a sacred mountain.\n\nWear the talisman of the Divine Tiger, inscribed in yellow upon an azure ground. When traversing the Five Peaks, or when in the midst of peril and misfortune, or in places haunted by ghosts and demons, one must invoke the mighty divine incantation, striking the left teeth thirty-six times, and recite:\n\n*\"Mysterious sound of the Nine Heavens, harmonious node of the Ox,\nGoverning the hidden and vast, opening the divine hundred blossoms,\nTranscending stagnation without trace, the Three Baskets’ net of waves,\nRevolving purity to fill the radiance, pearls dense as woven sands,\nCinnabar brilliance commands life, secret pears of kalpas past,\nContaining light to illumine the depths, ascending to fill the house,\nBo Le rides the formless, wielding the whip to tame heavenly demons,\nRegulating and severing their lineage, annihilating their forms in the Nine Nets,\nThe tiger transforms with divine might, seizing and subduing the myriad evils,\nSlaying without distinction great or small, all perish,\nDemons vanish with the light of time, disasters extinguish in grand harmony,\nRiding the radiance to wield the void, ascending upon flying clouds,\nEntering and departing the imperial court, eternally preserving the numinous stem.\"*\n\nWhen finished, swallow the qi thirty-six times and cease.\n\nWithout receiving the Divine Tiger’s supreme talisman, one must not recklessly speak this incantation. This invocation comprises the inner taboo names of the great demons of the Nine Heavens. A single recitation shakes the Nine Heavens, binds the forms of ten thousand ghosts, blinds a thousand spirits, and summons a hundred gods to court. Those who speak it without receiving it shall lose their souls and forfeit their spirits. The incantation for vanquishing demons of the Supreme Perfected is likewise—take heed and be cautious.\n\nThere are also the Demon-Vanquishing Talisman and the Divine Tiger’s Talisman within the *Scripture for Vanquishing Demons*, all of which are the hidden sounds of the Demon Kings of the Nine Heavens. When wearing the talisman and reciting the incantation, it is best to consume one as well.\n\nOn the first day of the seventh month in the third year of the Xingning reign (the year *yichou*), Master Tongbo transmitted this to Xu Yuanyou. He declared that in the years *jiashen*, *yihai*, *renchen*, and *guisi*, on the first day of the ninth month, the seventh day of the seventh month, and the eighth day of the fourth month, there shall appear a Daoist clad in seven-colored ritual robes, holding a nine-curved staff, either at a sacred altar or among the people, begging or chanting scriptures, or singing wild songs. If you encounter such a one, earnestly seek their teachings, and they shall surely bestow upon you the supreme talisman of the Divine Tiger. This is the Perfected One of the Southern Peak, whom the Most High regularly dispatches to the mortal realm to observe the hearts of those who cultivate the Dao.\n\nHere ends the *Scripture of the Golden Scroll and Tiger Talisman of the Supreme Perfected of the Cavern of Truth*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞真太上金篇虎符真文经 经名：洞真太上金篇虎符真文经。 撰人不详，约出於东晋南朝。 系摘录《金虎》、《神虎》二符改编而成。 一卷。 底本出处：《正统道藏》正一部。 洞真太上金篇虎符真文经 右金虎真符，太微天帝君以传金阙帝君，朱书白素，盛以紫锦囊、佩之头上以行，则制命天地群灵，神仙敬伏，玉华执巾，天丁卫躯，山岳稽精。 加敕威神之祝，玉精之章，便得馘斩九魔，千妖灭形矣。 此上清禁符，不传於世，得佩之者，飞升上清。 太元上景金真威神内祝，以召使神兵，斩灭邪魂。 当入室烧香，叩齿三十六通，坐卧任意，乃祝之曰： 辟乾毒王，震拾罗旌，八仙秉钺，上帝五灵，太玄落景，七晨卫庭，黄真曜符，焕掷火铃，神虎奋豪，毒锋乱逞，紫勃文仪，四跃仰鸣，九天六天，四天晶晶，外缠玄炁，内守帅兵，左威右顾，风伐火征，叱斩万妖，擢馘千精，金真启震，九魔摄形，北酆摧落，所灭皆倾，我佩真符，役使万灵，三元告真，玄合帝诚，太微上命，上升三清。 太元上景威神内祝之法，皆上清之禁经也。 辟乾毒王者，是六天大鬼之内名也。 震拾罗旌者，是北帝魔王之隐讳也。 四天皛晶者，是北酆鬼相之魂名也。 能知三鬼名者，则千妖窜迹，万鬼匿形，九魔莫得而动试，百邪弗得而陈害。 山林独处及在府庙神鬼之中，便可按而行事，不必烧香入室也。 又以雌黄书碧缯，长三尺，广一尺二寸，亦可都方圆一尺二寸也。 又以四郭其外，并以丹锦缘厕其裹，带於腰中之右面也。 若登斋入室，及朝宴八九，并制魔召灵，驱策神真，便佩而行事也。 慎不可临见尸秽，罪同漏泄，七玄之祖拷于地狱。 太上神虎玉经神虎内真符 神虎真符，太真九天父母所出，太真丈人以传东海小童，九天真王以传太上道君。 太上道君常所宝秘，藏於太微灵都琼宫玉房之裹，卫以巨兽，捍以毒龙，神虎七千，备于金阙，金晨玉童、素灵玉女各三百人，侍卫灵文。 玄晖空映，散烟紫庭，威振九遐之域，神光焕乎上清，妙畅启於自然，洞惠彻於无形，神虎斑其像，金虎亘其真，智慧标其干，消魔演其源。 微旨幽句，妙趣难详，皆着天魔隐讳，或标百神内名，诵其章千精骇动，咏其篇万妖束形。 以三天立政之始，付太微天帝君，使威制六天，馘斩万妖，摄山召海，束缚群灵，威魔灭试，回转五星。 於是太微天帝君，奉受消魔智慧神金二符，佩游上清，乘虚逸驾，浮轮太微，澄景太真之馆，止足玉帝之阶，静与天地合契，动与七景齐晖，匡落九玄，握节灵机，领括万度，亿律总归，激百阳以生电，运千阴以吐威，神霞被道於金阙，天关应感而自开，命八景以高登，骋神虎以升飞，群仙启路，七星奔移，玄光冥滞，亿变万奇，洞观无极之境，周览极天之崖，流目眄於五浊，衰生死以告之，可谓微乎，灵北之妙哉。 太微天帝君，告上相青童君、西城王君曰：上清大智慧文消魔真经，此太极之玉篇，高上之宝诀。 神魄真诗，九天太真所宝章。 智慧可以逐秽，消魔可以束邪，真符可以制魔。 夫有玉简紫名，得修上法者，不为众妖所乘，万魔所试也。 可谓万害不能伤，万试不能干，皆神虎之威，真经之妙用也。 今以相付，可传后学应为真人者。",
      "translated_text": "**The Wondrous Scripture of the Golden Tiger Talisman of the Supreme Cavernous Perfection**\n\n**Scripture Title:** *The Wondrous Scripture of the Golden Tiger Talisman of the Supreme Cavernous Perfection*. Its compiler is unknown, likely dating to the Eastern Jin or Southern Dynasties. It is an abridged adaptation of the *Golden Tiger* and *Divine Tiger* talismans. One scroll.\n\n**Source Text:** *Daoist Canon of the Orthodox Tradition*, Section Zheng Yi.\n\n---\n\n**The Wondrous Scripture of the Golden Tiger Talisman of the Supreme Cavernous Perfection**\n\nThe Golden Tiger True Talisman was transmitted by the Heavenly Emperor of the Grand Tenuity to the Celestial Lord of the Golden Tower. Inscribed in cinnabar upon white silk and encased in a purple brocade pouch, it is worn upon the head when in use. Thus empowered, one commands the spirits of heaven and earth, and all divine immortals bow in reverence. Jade maidens proffer towels, celestial warriors guard the body, and the mountains and peaks submit their essence.\n\nWhen combined with the incantation of divine authority and the jade scripture of numinous essence, one may decapitate the Nine Demons and annihilate a thousand specters. This is a forbidden talisman of the Supreme Clarity, not to be disseminated in the world. Those who wear it ascend to the Supreme Clarity.\n\nThe **Inner Incantation of the Supreme Radiance of the Primordial Qi’s Golden True Might** is employed to summon divine soldiers and exterminate wayward souls. One must enter a chamber, burn incense, and strike the teeth thirty-six times. Seated or reclining at will, recite the following:\n\n*\"Expel the Toxic King of Qian,\nThe Banner of Zhen-Shi-Luo,\nThe Eight Immortals wielding axes,\nThe Five Numinous Ones of the Supreme Emperor,\nThe Supreme Mystery’s Falling Radiance,\nThe Seven Dawns guarding the courtyard,\nThe Yellow True’s luminous talisman,\nFlaming bells cast in splendor,\nThe Divine Tiger baring its fangs,\nPoisoned blades raging unchecked,\nThe Purple Flourishing of Patterned Rites,\nFour leaps, roaring skyward,\nThe Nine Heavens and Six Heavens,\nThe Four Heavens gleaming bright,\nExternally enwrapped in primordial qi,\nInternally commanding the marshaled hosts,\nLeft wielding might, right surveying,\nWind cleaves, fire conquers,\nRoaring to slay ten thousand specters,\nSeizing and beheading a thousand spirits,\nThe Golden True awakens in thunder,\nThe Nine Demons submit their forms,\nThe Northern Feng crumbles,\nAll that is destroyed collapses.\nI wear the true talisman,\nCommanding ten thousand spirits.\nThe Three Origins declare the truth,\nMysteriously uniting with the Emperor’s sincerity.\nBy the Supreme Tenuity’s decree,\nAscend to the Three Clarities.\"*\n\nThe method of the **Inner Incantation of the Supreme Radiance’s Might** belongs to the forbidden scriptures of the Supreme Clarity.\n\nThe **\"Toxic King of Qian\"** is the esoteric name of the great demon of the Six Heavens.\nThe **\"Banner of Zhen-Shi-Luo\"** is the hidden title of the Demon King of the Northern Emperor.\nThe **\"Four Heavens gleaming bright\"** are the soul-names of the ghost-ministers of the Northern Feng.\n\nOne who knows the names of these three demons causes a thousand specters to flee and ten thousand ghosts to conceal their forms. The Nine Demons dare not stir, and a hundred evils cannot inflict harm. Whether dwelling alone in mountains and forests or amidst the spirits of temples and shrines, one may act accordingly without needing to burn incense or enter a chamber.\n\nAlternatively, inscribe the talisman with realgar upon green silk, three feet in length and one foot two inches in width—or a square of one foot two inches. Border it on all four sides with red brocade, and wear it on the right side of the waist. When entering a fast or chamber, or during the eight or nine assemblies of dawn and dusk, it may be worn to subdue demons, summon spirits, and command divine perfected beings.\n\nBeware never to approach corpses or impurities, for the sin is equal to leaking the secret. The Ancestor of the Seven Mysteries will be punished in hell.\n\n---\n\n**The Jade Scripture of the Divine Tiger’s Inner True Talisman**\n\nThe Divine Tiger True Talisman was bestowed by the Supreme Perfected Parents of the Nine Heavens. The Supreme Perfected Elder transmitted it to the Youth of the Eastern Sea, and the True King of the Nine Heavens transmitted it to the Supreme Dao Lord. The Supreme Dao Lord treasured and concealed it within the Jade Chamber of the Numinous Capital of the Grand Tenuity, guarded by mighty beasts and defended by venomous dragons. Seven thousand Divine Tigers stand ready in the Golden Tower, while three hundred Golden Dawn Jade Lads and three hundred Pure Numinous Jade Maidens attend the sacred scripture.\n\nIts mystic radiance shines through empty space, scattering purple mist across the courtyard. Its might shakes the nine distant realms, its divine light blazes in the Supreme Clarity, its wondrous harmony arises from spontaneity, and its penetrating wisdom pierces the formless. The Divine Tiger’s stripes manifest its image, the Golden Tiger spans its truth, wisdom marks its essence, and the vanquishing of demons unfolds its source.\n\nIts subtle meanings and hidden phrases are difficult to fathom, for they record the hidden titles of heavenly demons and the esoteric names of a hundred spirits. Reciting its verses startles a thousand spirits, and chanting its passages binds ten thousand specters.\n\nAt the inception of governance in the Three Heavens, it was entrusted to the Heavenly Emperor of the Grand Tenuity, empowering him to overawe the Six Heavens, decapitate ten thousand specters, summon mountains and seas, bind all spirits, subdue demons, and reverse the course of the five planets.\n\nThereupon, the Heavenly Emperor of the Grand Tenuity received the two talismans of **Numinous Golden Wisdom for Vanquishing Demons**. Wearing them, he soared through the Supreme Clarity, riding the void in a transcendent chariot. He traversed the Grand Tenuity, alighted in the Palace of the Supreme Perfected’s Radiance, and stood upon the steps of the Jade Emperor. At rest, he harmonized with heaven and earth; in motion, he gleamed with the Seven Luminaries. He rectified the Nine Mysteries, grasped the tally of numinous mechanism, encompassed the ten thousand measures, and unified the myriad rhythms. He stirred the hundred yang to generate lightning and moved the thousand yin to unleash might. Divine auroras draped the Dao over the Golden Tower, and the Celestial Pass responded to resonance, opening of itself. He commanded the Eight Radiant Ones to ascend, spurred the Divine Tiger to take flight, and the host of immortals cleared the path while the Seven Stars hastened in motion. Mystic light dimmed and stagnated, transforming in myriad wondrous ways. Gazing into the boundless, he surveyed the edges of the heavens, casting his eyes upon the Five Turbidities and lamenting the suffering of life and death. Truly, how subtle is the marvel of the Numinous North!\n\nThe Heavenly Emperor of the Grand Tenuity addressed the Prime Minister, the Azure Youth, and the Lord of the Western City, saying: *\"The Supreme Clarity’s Great Wisdom Scripture for Vanquishing Demons is the Jade Scroll of the Supreme Ultimate, the supreme treasure formula. Its divine verses are the treasured chapters of the Supreme Perfected of the Nine Heavens. Wisdom dispels impurity, vanquishing demons binds evil, and true talismans subdue demons. Those who possess jade tablets with purple names and cultivate the supreme method shall not be assailed by myriad specters or tested by ten thousand demons. Truly, no harm can befall them, no trial can touch them—such is the might of the Divine Tiger and the wondrous efficacy of the true scripture. Now I entrust it to you, to transmit to future disciples who are destined to become perfected beings.\"*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1240,
      "start_sentence": 0,
      "end_sentence": 35,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.84577035903931,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上金篇虎符真文经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "当依太真之科也，七百年内听得三传，不得示非其人。 轻露真文，身被风刀之拷，殃及七玄。 若有金名东华，绿字上清者，得吾此符，便以玉童玉女三十六人，侍卫子身，将可以经危冒险，越山跨海，召神制鬼，封掌灵岳，所之所向，千妖伏侧，万魔束形，群仙侍卫，身生异光。 修未七年，真灵自当降子之房，飞舆绿軿，白日登晨。 受者对斋九十日，或三十日，或七十日，皆资上金十两，以为神真之信，锦九十尺，以誓九天，青缯三十尺，以盟其心。 好道乐真，勤心注玄，无吝财物，轻财贵道，道无不存，如此之士，始可与言。 内爱财宝，外心浮好，道亦己照，闭之玉笈，加以金阙，升度之后，深藏名山。 佩神虎上符，以青为地，黄书文。 若之五岳，并在厄难之中，鬼魅之地，皆当作威神大祝，叩左齿三十六通，祝曰： 九天玄音，丑节秉和，总统幽张，开神百华，超滞无迹，三篮罗波，回素满景，珠郁幄沙，丹明揔命，梨秘劫阿，含光映遂，登来盈家，伯乐乘无，运策天魔，调更绝种，灭形九罗，虎变神威，摄制万邪，斩戮无大，自小皆殂，妖绝光阴，祸灭太和，乘景策虚，上蹑飞霞，出入帝庭，长保灵柯。 毕，次咽炁三十六过止。 不受神虎上符，不得妄说此祝。 此祝皆九天大魔内讳，一咒九天骇动，万鬼束形，千精丧目，百神诣庭。 不受而妄说，皆亡魂失魄。 高上灭魔之祝，亦如此，明慎之焉。 又有消魔符及神虎之符，在消魔经中，悉是九天魔王之隐音也。 亦应佩祝制之时，悉服一枚益佳。 兴宁三年乙丑岁七月一日，桐栢真人授许远游，言至甲申、乙亥、壬辰、癸巳之岁，九月一日、七月七日、四月八日，当有道士着七色法衣，手持九曲策杖，或在灵坛之所，或在人间告乞，或咏经诗，或作狂歌。 子若见之，勤请其道，必授子神虎上符。 此南岳真人，太上常使其时下在人间，察视学道者之心。 洞真太上金篇虎符真文经竟",
      "translated_text": "In accordance with the statutes of the Supreme Perfected, within seven hundred years, transmission may be granted thrice, but it must not be shown to the unworthy. Should the true scripture be recklessly revealed, the offender shall suffer the torment of the Wind Blade, and calamity shall extend to the seven generations of their ancestors. If one bears a golden name from the Eastern Florescence and a verdant inscription of the Supreme Clarity, upon receiving this talisman, thirty-six jade lads and jade maidens shall attend and guard their person. With this, they may traverse perilous trials, cross mountains and seas, summon spirits and subdue ghosts, and command the sacred peaks. Wherever they go, a thousand demons shall prostrate at their side, ten thousand evil spirits shall be bound in form, and hosts of immortals shall serve as their guard, their body radiating wondrous light. If they cultivate for less than seven years, the true spirits shall descend to their chamber, and they shall ascend in broad daylight upon a flying chariot with green canopy.\n\nThe recipient must observe a fast for ninety days, or thirty days, or seventy days, and offer ten taels of refined gold as a token of faith to the divine perfected, ninety feet of brocade to swear an oath before the Nine Heavens, and thirty feet of azure silk to pledge their heart. Those who cherish the Dao and delight in truth, who diligently focus their minds on the mysteries, who do not begrudge wealth but value the Dao above all—such is the kind of person with whom this may be shared. The Dao abides with them. But those who inwardly covet riches and outwardly indulge in frivolous desires—the Dao has already discerned them. Seal the scripture within a jade coffer, lock it with a golden bolt, and after their ascension, conceal it deep within a sacred mountain.\n\nWear the talisman of the Divine Tiger, inscribed in yellow upon an azure ground. When traversing the Five Peaks, or when in the midst of peril and misfortune, or in places haunted by ghosts and demons, one must invoke the mighty divine incantation, striking the left teeth thirty-six times, and recite:\n\n*\"Mysterious sound of the Nine Heavens, harmonious node of the Ox,\nGoverning the hidden and vast, opening the divine hundred blossoms,\nTranscending stagnation without trace, the Three Baskets’ net of waves,\nRevolving purity to fill the radiance, pearls dense as woven sands,\nCinnabar brilliance commands life, secret pears of kalpas past,\nContaining light to illumine the depths, ascending to fill the house,\nBo Le rides the formless, wielding the whip to tame heavenly demons,\nRegulating and severing their lineage, annihilating their forms in the Nine Nets,\nThe tiger transforms with divine might, seizing and subduing the myriad evils,\nSlaying without distinction great or small, all perish,\nDemons vanish with the light of time, disasters extinguish in grand harmony,\nRiding the radiance to wield the void, ascending upon flying clouds,\nEntering and departing the imperial court, eternally preserving the numinous stem.\"*\n\nWhen finished, swallow the qi thirty-six times and cease.\n\nWithout receiving the Divine Tiger’s supreme talisman, one must not recklessly speak this incantation. This invocation comprises the inner taboo names of the great demons of the Nine Heavens. A single recitation shakes the Nine Heavens, binds the forms of ten thousand ghosts, blinds a thousand spirits, and summons a hundred gods to court. Those who speak it without receiving it shall lose their souls and forfeit their spirits. The incantation for vanquishing demons of the Supreme Perfected is likewise—take heed and be cautious.\n\nThere are also the Demon-Vanquishing Talisman and the Divine Tiger’s Talisman within the *Scripture for Vanquishing Demons*, all of which are the hidden sounds of the Demon Kings of the Nine Heavens. When wearing the talisman and reciting the incantation, it is best to consume one as well.\n\nOn the first day of the seventh month in the third year of the Xingning reign (the year *yichou*), Master Tongbo transmitted this to Xu Yuanyou. He declared that in the years *jiashen*, *yihai*, *renchen*, and *guisi*, on the first day of the ninth month, the seventh day of the seventh month, and the eighth day of the fourth month, there shall appear a Daoist clad in seven-colored ritual robes, holding a nine-curved staff, either at a sacred altar or among the people, begging or chanting scriptures, or singing wild songs. If you encounter such a one, earnestly seek their teachings, and they shall surely bestow upon you the supreme talisman of the Divine Tiger. This is the Perfected One of the Southern Peak, whom the Most High regularly dispatches to the mortal realm to observe the hearts of those who cultivate the Dao.\n\nHere ends the *Scripture of the Golden Scroll and Tiger Talisman of the Supreme Perfected of the Cavern of Truth*.",
      "overlap_context": "avens. Wisdom dispels impurity, vanquishing demons binds evil, and true talismans subdue demons. Those who possess jade tablets with purple names and cultivate the supreme method shall not be assailed by myriad specters or tested by ten thousand demons. Truly, no harm can befall them, no trial can touch them—such is the might of the Divine Tiger and the wondrous efficacy of the true scripture. Now I entrust it to you, to transmit to future disciples who are destined to become perfected beings.\"*",
      "start_char": 1240,
      "end_char": 1983,
      "start_sentence": 36,
      "end_sentence": 56,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.920172929763794,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上金篇虎符真文经.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}