{
  "source_id": "洞真太微黄书天帝君石景金阳素经",
  "source_file": "chunked_daozang\\洞真太微黄书天帝君石景金阳素经.json",
  "total_chunks": 3,
  "total_original_chars": 2966,
  "total_translated_chars": 19155,
  "total_translation_time": 94.64037990570068,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\神符类\\洞真太微黄书天帝君石景金阳素经.txt",
    "category": "神符类"
  },
  "full_translation": "**The Wondrous Perfection Supreme Pervasive Yellow Writ of the Heavenly Thearch of the Golden Radiance and Stone Scenery: The Plain Writ of the Golden Radiance**\n\n**Title:** *The Wondrous Perfection Supreme Pervasive Yellow Writ of the Heavenly Thearch of the Golden Radiance and Stone Scenery: The Plain Writ of the Golden Radiance*. Author unknown, likely composed during the mid-to-late Eastern Jin dynasty. Originally one of the eight scrolls of *The Wondrous Perfection Supreme Pervasive Yellow Writ*. It expounds methods of swallowing talismans, wearing registers, and practicing arts of the Dao.\n\n**Source Text:** *Daoist Canon of the Orthodox Unity*, Wondrous Perfection Division, Spirit-Talisman Category.\n\n---\n\n### *The Plain Writ of the Golden Radiance*\n\nThe *Plain Writ of the Golden Radiance* states: Those who desire long life and transcendence as divine immortals should master the Dao of embryonic breathing, for it is the treasure of seeking life. It restores youth, reverses white hair, and extends life without aging. Regularly, after midnight when the generative *qi* arises, sit upright facing east, close the eyes, and hold the breath until it reaches its limit. By practicing this consistently, the hundred illnesses and myriad harms will not afflict you, and no malevolent spirits or demons will dare to test you.\n\nAt dawn, when the sun first rises, face it directly and gently inhale its essence through the nose, ceasing after a short while. This bestows the complexion of a youth, a radiant countenance, and forever banishes wrinkles and blemishes. Ingesting *qi* eliminates hunger; ingesting the sun’s essence prevents aging. Embryonic breathing through held breath grants boundless longevity. Constantly visualize the twenty-four spirits within yourself to remain free of illness. If afflicted by sickness, silently invoke their names and pray—the ailment will vanish in an instant.\n\nThe *Writ of the Golden Radiance* states: Always visualize a crimson *qi* emanating from your heart, ascending through your throat. With intention, guide it to the Mud Pill Palace (the upper *dantian*). Persist in this practice without cease, and the Three Corpses will depart, granting long life and enduring vision. The Director of Destinies will inscribe your name in the Purple Register of the Undying.\n\nIf you wish to ascend the Dragon and enter the Dipper, regularly ingest the Nine Terraces Talisman. Then you will meet the Great One. Without ingesting the Nine Terraces Talisman, the gates of heaven will remain closed. Upon ingesting it, the myriad spirits and celestial immortals will descend to your chamber. In broad daylight, you will ascend to the Palace of the Supreme Pervasive, where you may command all immortal officials.\n\nThe Heavenly Thearch of the Supreme Pervasive declares: The eighteen talismans of the Stone Scenery of the Upper Clarity, along with the *Summons of the Soul* by the Heavenly Thearch, are secret texts of the Upper Clarity. They originally emerged from the Jade Pavilion of the Upper Clarity, later sealed within the Golden Hall and Jade Gates of Kunlun Mountain, opened but once in ten thousand years. Formerly, the Heavenly Thearch of the Supreme Pervasive received them from the Immortal Elder of the Dark Garden, thereby attaining flight to the Upper Clarity and being granted the rank of Heavenly Thearch. With free will, he pays homage at the Golden Gates and rides cloud-dragons at his pleasure.\n\nThose who seek the Dao without obtaining these talismans will never succeed. They will labor in vain among mountains and marshes, inevitably failing the demonic trials. To ingest them, inscribe the talismans with orpiment ink—never with cinnabar. Write them on paper and burn to ingest, or carve them on a one-foot-two-inch paulownia wood tablet, with characters both inside and out. This ensures swift ascent to heaven. Do not recklessly divulge them; transmit only to the worthy.\n\nBy reverently practicing these methods, you may command all spirits, summon yin and call forth yang, and achieve whatever you desire instantly. Those who leak these secrets or violate the covenants will bring calamity upon seven generations. How can one not be cautious? How can one not be cautious?\n\nIngest the talisman of the Eastern Marchmount, and the divine writ will unfold, revealing the Upper Clarity. Cloud chariots will welcome you, and you will foreknow all matters. The method is the same for the Five Marchmounts, beginning with the Eastern Marchmount and proceeding in order. Also, inscribe the eighteen *Yejie* talisman seals on purple silk. First, store them in a bamboo tube, then present them at a famous mountain during the first month. After the presentation, conceal them among large rocks where no one may find them. Seal the tube with seven *sheng* of yellow earth mixed into mud.\n\nUpon completion, pray thus:\n*\"I wear and bear the Yellow Writ of the Stone Scenery of the Supreme Pervasive. Now, I reverently transcribe one copy to return to the Immortal Lord, that I may ascend the void, ride clouds without reins, and be attended by divine immortals, joining the company of the perfected.\"*\nConclude the prayer.\n\nFollow this method for all Five Marchmounts, and the divine writs of the immortal stone chambers on the sacred mountains will be revealed to you. Divine mushrooms and rare herbs will appear of their own accord.\n\nIf you wish to create the seal of the Golden Radiance, inscribe its complete text. Ingest both the seal and its inscription by burning and swallowing them, and you will suddenly commune with the spirits. To ingest the seal, write it in ink and swallow one impression at a time, following a set progression. Use the seal to stamp talismans, and they will be efficacious. Ingest the talismans regularly before meals. Upon their entry, you may experience cold and heat, but your vision will grow sharper. Soon, a white-robed jade youth or a scholar in proper attire may appear before you—do not startle, for they will vanish of their own accord.\n\nAfter thirty days of visualization, your body will naturally become light. Superior practitioners may ascend into the pure void, roaming and feasting in the Upper Clarity. Middling practitioners may lift their forms a hundred *zhang*, and lesser practitioners ten *zhang*. Upon ingesting all eighteen talismans, you will see the attendants in seal-embroidered robes—proof of your sincerity. The jade youths and jade maidens guarding the talismans will reveal their true forms to you.\n\nBefore ingesting the talismans, first abstain from the five pungent plants, meat, blood, and sexual activity. Avoid defilement and impurity. After a hundred days, seclude yourself in a quiet chamber, avoiding contact with worldly people or noisy gatherings. Only then will the Dao be accomplished.\n\nThose who ingest the Stone Scenery and Golden Radiance talismans must especially refrain from defilement, sloth, and evil conduct. Cultivate the body, focus the mind on the Dao, and prioritize purification and concentration. By practicing this Dao, you may ascend as an immortal, befriend celestial perfected beings, and commune with the host of immortals. You will be able to summon spirits, attract divine elixirs and magic mushrooms, and conjure traveling kitchens, dragon chariots, feathered canopies, jade youths, jade maidens, and all spirits under heaven to serve you. There will be nothing you do not know and nothing you cannot obtain.\n\nThe Heaven-Earth Separation Talisman can repel armies for a thousand miles. Those who plot against you will suffer misfortune, and any who raise weapons against you will turn them upon themselves. The talisman may be sealed, burned and ingested, or placed within a bamboo staff. Use a one-foot-two-inch tube, inscribe the talisman on silk nine *cun* long and four *cun* wide, place it in the tube, and bind it to your arm—left for men, right for women.\n\nGuard this well, guard this well—none but those whose names are inscribed upon the Jade Tablet of the Great Ultimate may encounter it. Those who bear it shall wander freely through the four directions, suppressing all calamities. Mortals who wear it shall enjoy blessings and long life, their descendants flourishing in abundance. Daoists who obtain it shall ascend to the Upper Clarity. Those who possess it shall receive fortune; those who cultivate it shall rise into the void.\n\nIf you wish to ascend and enter the Great Subtlety, consume the Supreme Numinous Talisman, and you shall enter the midst of the Primordial Sovereign of the Great One. If you wish to pay homage to the Heavenly Thearch and ascend to the Purple Palace, consume the Supreme Lord’s Numinous Talisman. If you wish to behold the Supreme Lord of the Dao, consume the Hall of Light Talisman. If you wish to enter the Five Marchmounts, causing their mountain spirits and all immortals to come and attend you, consume each marchmount’s respective talisman. If you wish to enter the Primordial Pass, consume the Primordial Forerunner Talisman, and you shall behold the Lord of the Primordial Forerunner. If you wish to follow the immortal officials and behold the one hundred twenty spirits, consume the Talisman of the Myriad Spirits, and you shall behold the lords of all immortals. If you wish to descend and behold the Nine Divine Persons of the Great Clarity, consume the Talisman of the Heavenly Gate, and you shall behold the Lord of the Great Clarity. If you wish to ascend to heaven or enter the abyss, to soar through the Eight Simplicities, to roam and conceal yourself at will, consume the Separate Talisman of the Heavenly Thearch of the Great Subtlety and the Stone Radiance—then the spirits of heaven and earth shall not detain you.\n\nThe Seal of Ascended Immortals\nThe Seal of Divine Spirits\nThe Seal for Commanding Inferiors\nThe Seal of the Dipper’s Balance\nThe Seal of the Primordial Sovereign\nThe Seal of the Myriad Spirits\nThe Seal of the Divine Elixir of Heaven and Earth\nThe Seal of the Nine Sovereigns\nThe Seal of the Myriad Immortals\nThe Seal for Entering the Heavenly Gate\nThe Seal of Unopposed Myriad Spirits\nThe Seal of Unity with Immortals\nThe Seal of the True Person’s Dipper Gate\nThe Seal No One Dares Question\nThe Seal for Galloping into the Great Clarity\nThe Seal for Commanding the Dipper Palace\nThe Seal Before Which the Myriad Spirits Flee\nThe Seal of Receiving Rank\nThe Seal of the Primordial Forerunner\nThe Seal for Mounting the Dragon and Ascending as an Immortal\nThe Seal for Issuing the Great Clarity\nThe Seal of the Cloud Chariot\nThe Seal of the Primordial Sovereign of the Vault of Heaven\nThe Seal for Mounting the Dragon\nThe Seal of Yang Radiance\nThe Seal of the Dipper Lord\nThe Seal of Heaven’s Welcome\nThe Seal of the Heavenly Thearch’s Bestowal of Life\nThe Seal for Opening the Gate of Qian\nThe Seal of Bestowed Authority\nThe Seal of the Myriad Spirits Flanking You\nThe Seal of the Hundred Beasts Losing Their Qi\nThe Seal of Heaven’s Envoys Enacting Might\nThe Seal for Controlling the Myriad Spirits\nThe Seal That Follows Your Command\nThe Seal of the One Thousand Two Hundred Forms\nThe Seal of the Envoys Holding Official Titles\nThe Seal of Command\nThe Seal of Shared Distinction\nThe Seal of the Ninefold Lord’s Rank\nThe Seal of the Divine Chapters’ Descent\nThe Seal of Utmost Urgency\nThe Seal of the Yellow and the Old\nThe Seal of the Primordial Forerunner\nThe Seal for Repelling Evil\nThe Seal for Commanding Heavenly Fire\nThe Seal of Cold and Heat\nThe Seal of Winter and Summer’s Naturalness\nThe Seal of the Cavernous Numinous Great One’s Offering\nThe Seal for Obtaining the Eight Wonders\nThe Seal of Good Fortune Without Offending Immortals\nThe Seal of the Primordial Beginning and the Myriad Spirits\nThe Seal of the Myriad Directions’ Reception\nThe Seal for Dispelling the Myriad Evils\n\nThe Heavenly Thearch of the Great Subtlety states: The Talisman of the Heavenly Gate is the fourth among those transmitted above. If you cultivate and consume it, first burn incense to your left and right. Jade lads and jade maidens, forty each, shall attend you. Those who possess the scripture must revere and honor it, wrapping it in a case of yellow brocade. Do not allow the jade lads and maidens to reproach your transgressions—how could you not be diligent?\n\nThose who receive this text shall use forty feet of yellow-ground brocade and seven taels of gold. At the time of transmission, master and disciple shall fast together for seven days—or four days—before performing the covenant and declaration. If you bear this text or meditate upon consuming it, it shall be the great invocation of the Golden Radiance and Stone Radiance.\n\nThe *Scripture of Golden Radiance* states: Each time you meditate upon consuming or bearing the talisman, knock your teeth thirty-six times, swallow saliva thirty-six times, and with eyes closed, softly invoke:\n*\"Heavenly Thearch of the Great Subtlety, numinous honor of the Purple Palace, mysterious emptiness and great perfection, forerunners of the Thearch, whose Dao is vast and great, whose transformations are spontaneous, whose true principles flow unseen, spreading without interruption—essence enters the Hall of Light, protecting the embryo and augmenting the hun-soul. The Crimson Mountain opens again, welcoming the numinous origin. To the left, I gather the radiance of the sun; to the right, I pluck the root of the moon. A thousand fathoms of flowing fire, golden gauze and azure skirts, a sash bearing the records of heaven, a headscarf and flowered crown. Grant that I ascend the void, soaring to the Upper Clarity. I beseech ascension as an immortal, to command the myriad spirits. The numina of heaven and earth shall dare not disobey; all directions shall converge, and fortune and virtue shall be as mountains. The resonance of jade shall echo afar, and evil demons shall vanish like smoke.\"*\n\nThe Talisman of the Heavenly Thearch for Summoning the Hun-Soul: At the hour of the cock’s crow, face north, burn incense, and swallow it to gather the hun-soul. After consuming the talisman, softly invoke:\n*\"Radiant brilliance of the Great Thearch, harmonizing and gathering the court of the hun-soul. The three hun and seven po shall guard and stabilize this original form. Spirit at peace, body whole, I attain long life. A hundred illnesses disperse, the five viscera find peace. Let me ascend as a flying immortal, driving a cloud chariot. The Red Child shall support me, and I shall obtain the essence of qi. A purple canopy shall cover me, and spirit attendants shall follow.\"*\n\nConclude by knocking your teeth three times and swallowing saliva three times. After consuming the talisman, always meditate upon and invoke this method to assemble the hundred spirits—this is the secret for never losing them. Guard and practice it well.\n\nThe Perfected Consort of the Nine Flowers states: The *Yellow Writ of the Great Subtlety* originally comprised eight scrolls. In former times, a true person on Red City Mountain transmitted the *True Writ of the Eight Registers Worn at the Girdle* to Xu Yuanyou. What Your Excellency now possesses is that very text. The reason you have not yet soared to the Upper Clarity, riding a cloud-dragon chariot, is precisely because you have not beheld the *Stone Radiance and Eight Simplicities* in their entirety. Now I transmit them to you, comprising eighteen talismans and their scriptural prefaces. Cultivate them accordingly, and you shall stride the dragon’s steps and ascend the mysterious stages. Treasure and guard them well—the *Yellow Writ of the Stone Radiance of the Great Subtlety* is no trifling technique of yellow and red. Repeated warnings have been given.\n\nBefore it has cleansed your heart and mind, your inherent conduct has already become manifest, and your jade body has been marked by exalted destiny. Savor the mysterious and chew the real; summon and draw in radiant splendor. Calm the six spirits, discern the eight luminances. Submit to the numinous root, refine the three passes, nourish the fluids and harmonize the hun-soul. Even if violent winds rage, they shall not assail your true nature.\n\nLet not the clamor of the vulgar and the murk of the worldly turn back your pure and unsullied nature. Then shall you chant in the void, empty your heart to await the spirits, tend to the hundred absolutes, and dwell in the clarity of the utmost real. Thus shall no cares or burdens disturb your mysterious abode, nor sorrowful thoughts trouble the crimson ford.\n\nIn serene detachment and distant contemplation, gazing upon the light with shared joy, the supreme bliss shall resound like chimes in both ears, and the cloud-borne zither and tiger’s strum shall echo through the empty pavilion. Your mouth shall sip fragrant winds, your eyes behold the threefold clouds, your waist bear the golden yang, and your command subdue all malevolence. Moving with the four seasons, you shall naturally attain perfection, and all that your distant gaze washes over shall merge with the divine.\n\nThe perfected attain perfection precisely through this, while those who feign perfection without truth shall stumble and fall thereby. Yet if transgressions and ailments fill the ledgers, if sorrow and grief choke the heart, if constant striving wearies the spirit, if petty ways are clung to in secret, if harmony is sought only to please the crowd, if the mind yearns for ease in old age—suddenly, mournful cries shall arise. Through endless nights, long lamenting the dead, grieving with a heart that mourns the departed, essence and spirit shall part, the three *hun*-souls scatter their *qi*, and in the void of inauspicious fate, the *po*-soul shall summon *wangliang* spirits. Abandoning my empty hall, they shall bring forth a hundred afflictions. How can one grasp the Way of life only to rush into the chambers of death? Having once refined the numinous wind, you now tread the halls of death, casting aside your auspicious signs and hurling yourself into foul defilement.\n\nThough your name resounds in lofty triumph, you still hesitate; though you have repeatedly beheld the luminous precepts, you have not dispelled your doubts. Thus you entangle yourself in defiled petitions, causing the stench of dawn to obscure the hidden writs. The four poles beat their drums, the Three Officials brandish their spears, and you swear oaths—how could you forget the Great Beginning?\n\nThen shall the divine tiger unsheathe its claws, the venomous dragon bare its fangs, and the eight directions stretch boundless—where could you flee? Only after such warnings shall you realize the longing for purity’s distant expanse, and that the words spoken were not empty. Yet how lamentable that wailing voices disrupt the true and disturb the upright *qi*! Why does the enlightened sovereign not dwell always in the land of fortune, shaking his robes and returning to his chamber?\n\nNow I entrust to you the *Stone Radiance Golden Yang Writ*, bidding you fully behold the first of the eight scrolls. Here ends the *Supreme Mystery Yellow Writ of the Heavenly Thearch of the Great Subtlety: The Stone Radiance Golden Yang Plain Scripture*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞真太微黄书天帝君石景金阳素经 经名：洞真太彻黄书天帝君石景金阳素经。 撰人不详，约出於东晋南期。 原系《洞真太彻黄书》八卷之一。 言吞符佩箓法术。 底本出处：《正统道藏》洞真部神符类。 洞真太微黄书天帝君石景金阳素经 太帝招魂众文 《金阳素经》曰：夫欲长生神仙，宜知胎息之道，是求生之宝也，还年返白，延寿不老。 常以夜半之后生气之时，正平坐东向，冥目闭气，气极则止，常能为之，百病万害不干，群精魍魉莫敢犯试矣。 至平旦日初出时，辄正向之，微以鼻取日精服之，须移时则止，令人有少童之容，面有华色，永无皱斑也。 服气令人不饥，服日精之法令人不老，闭气胎息长年无极，常存兆二十四神令兆无病，病窃呼神名祝之，须臾之顿愈也。 ， 《金阳经》曰：常念心中出赤气，上行通喉咙，以意闭之於泥丸，为之不止，三尸自去，长生久视，司命刻名，着不死之紫箓也。 子欲升龙入斗，常服九台符，则与太一相见，不知服九台符，则天门闭不开也，服之万神天仙皆来降子之室，白日飞登太微之宫，可总制仙官也。 太微天帝曰：上清石景之符十八首，及太帝招魂一篇，上清之秘文，本出乎上清之琼阁，后封乎昆仑之山，金堂玉户之内，万年一开。 昔太微天帝君受之於玄圃仙伯，遂得飞行上清，是锡天帝之位也，适意所欲，朝礼金阙，策御云龙矣。 诸欲学道者不得此符，必不成也，徒劳於山薮，不免卒败於魔试。 欲服之者，以雌黄墨书符，勿以丹书之也，以纸书烧服之，亦可作尺二梧桐，外内皆有字，必疾升天。 勿妄泄，非贤不传。 奉而述之，制总群精，呼阴召阳，所欲立至。 泄漏不遵科约，殃及七世，可不慎哉，可不慎哉。 服东岳之符，则神文开出上清，云舆迎子，逆知万事。 五岳同法，先东岳，以次服之。 及十八谒符印文，具写之紫素，先存置筒中，以正月奏之名山，常以奏毕，置大石间，莫令人知也。 子以黄土七升作泥泥上。 竟，因祝之曰： 戴佩太微石景黄文，今谨写一通，以还仙君，使我登虚，运无驾云，仙灵侍卫，与真为群。 毕。 五岳悉如此法，则名山石室神仙之文，为子露出，神芝奇草自然而见也。 子欲作金阳其印具烧文，子服印俱烧而吞之，忽然自与神通。 服印之法，以墨书之，吞一印，随为程，以印封符，其相成，子服符。 常先食服之，符入当寒热视益明，须臾之间，当有白衣玉童，或是书生，服正立子前，勿警也，须臾自消去矣。 当存之三十日，子身自然轻举，上士能腾入清虚，游宴上清，中士能举形百丈，下士十丈。 子服十八符，皆见印衣人也，是子诚笃，卫符玉童玉女见兆真形也。 欲服符，先绝五荤血食房室，勿履污秽，百日乃幽居无人之室，勿与俗人喧哗共处，则其道成也。 子服石景金阳符者，尤禁污慢恶行，当修身念道，斋静精专为先，兆能修此道，可以升仙，与天真相友，得与众仙交通，则诃召神灵，降致金丹芝草也，坐致行厨，龙车羽盖，灵童玉女，天下 众精，皆来走使，无问不知，无求不得。 天地别符可以辟兵万里，天下贼人有谋之者反受其殃，有举五兵向之者皆还自伤。 亦可封，亦可烧服，亦可着竹杖中，以尺二筒，书符素长九寸，广四寸，置符筒中，以系臂，男左女右。",
      "translated_text": "**The Wondrous Perfection Supreme Pervasive Yellow Writ of the Heavenly Thearch of the Golden Radiance and Stone Scenery: The Plain Writ of the Golden Radiance**\n\n**Title:** *The Wondrous Perfection Supreme Pervasive Yellow Writ of the Heavenly Thearch of the Golden Radiance and Stone Scenery: The Plain Writ of the Golden Radiance*. Author unknown, likely composed during the mid-to-late Eastern Jin dynasty. Originally one of the eight scrolls of *The Wondrous Perfection Supreme Pervasive Yellow Writ*. It expounds methods of swallowing talismans, wearing registers, and practicing arts of the Dao.\n\n**Source Text:** *Daoist Canon of the Orthodox Unity*, Wondrous Perfection Division, Spirit-Talisman Category.\n\n---\n\n### *The Plain Writ of the Golden Radiance*\n\nThe *Plain Writ of the Golden Radiance* states: Those who desire long life and transcendence as divine immortals should master the Dao of embryonic breathing, for it is the treasure of seeking life. It restores youth, reverses white hair, and extends life without aging. Regularly, after midnight when the generative *qi* arises, sit upright facing east, close the eyes, and hold the breath until it reaches its limit. By practicing this consistently, the hundred illnesses and myriad harms will not afflict you, and no malevolent spirits or demons will dare to test you.\n\nAt dawn, when the sun first rises, face it directly and gently inhale its essence through the nose, ceasing after a short while. This bestows the complexion of a youth, a radiant countenance, and forever banishes wrinkles and blemishes. Ingesting *qi* eliminates hunger; ingesting the sun’s essence prevents aging. Embryonic breathing through held breath grants boundless longevity. Constantly visualize the twenty-four spirits within yourself to remain free of illness. If afflicted by sickness, silently invoke their names and pray—the ailment will vanish in an instant.\n\nThe *Writ of the Golden Radiance* states: Always visualize a crimson *qi* emanating from your heart, ascending through your throat. With intention, guide it to the Mud Pill Palace (the upper *dantian*). Persist in this practice without cease, and the Three Corpses will depart, granting long life and enduring vision. The Director of Destinies will inscribe your name in the Purple Register of the Undying.\n\nIf you wish to ascend the Dragon and enter the Dipper, regularly ingest the Nine Terraces Talisman. Then you will meet the Great One. Without ingesting the Nine Terraces Talisman, the gates of heaven will remain closed. Upon ingesting it, the myriad spirits and celestial immortals will descend to your chamber. In broad daylight, you will ascend to the Palace of the Supreme Pervasive, where you may command all immortal officials.\n\nThe Heavenly Thearch of the Supreme Pervasive declares: The eighteen talismans of the Stone Scenery of the Upper Clarity, along with the *Summons of the Soul* by the Heavenly Thearch, are secret texts of the Upper Clarity. They originally emerged from the Jade Pavilion of the Upper Clarity, later sealed within the Golden Hall and Jade Gates of Kunlun Mountain, opened but once in ten thousand years. Formerly, the Heavenly Thearch of the Supreme Pervasive received them from the Immortal Elder of the Dark Garden, thereby attaining flight to the Upper Clarity and being granted the rank of Heavenly Thearch. With free will, he pays homage at the Golden Gates and rides cloud-dragons at his pleasure.\n\nThose who seek the Dao without obtaining these talismans will never succeed. They will labor in vain among mountains and marshes, inevitably failing the demonic trials. To ingest them, inscribe the talismans with orpiment ink—never with cinnabar. Write them on paper and burn to ingest, or carve them on a one-foot-two-inch paulownia wood tablet, with characters both inside and out. This ensures swift ascent to heaven. Do not recklessly divulge them; transmit only to the worthy.\n\nBy reverently practicing these methods, you may command all spirits, summon yin and call forth yang, and achieve whatever you desire instantly. Those who leak these secrets or violate the covenants will bring calamity upon seven generations. How can one not be cautious? How can one not be cautious?\n\nIngest the talisman of the Eastern Marchmount, and the divine writ will unfold, revealing the Upper Clarity. Cloud chariots will welcome you, and you will foreknow all matters. The method is the same for the Five Marchmounts, beginning with the Eastern Marchmount and proceeding in order. Also, inscribe the eighteen *Yejie* talisman seals on purple silk. First, store them in a bamboo tube, then present them at a famous mountain during the first month. After the presentation, conceal them among large rocks where no one may find them. Seal the tube with seven *sheng* of yellow earth mixed into mud.\n\nUpon completion, pray thus:\n*\"I wear and bear the Yellow Writ of the Stone Scenery of the Supreme Pervasive. Now, I reverently transcribe one copy to return to the Immortal Lord, that I may ascend the void, ride clouds without reins, and be attended by divine immortals, joining the company of the perfected.\"*\nConclude the prayer.\n\nFollow this method for all Five Marchmounts, and the divine writs of the immortal stone chambers on the sacred mountains will be revealed to you. Divine mushrooms and rare herbs will appear of their own accord.\n\nIf you wish to create the seal of the Golden Radiance, inscribe its complete text. Ingest both the seal and its inscription by burning and swallowing them, and you will suddenly commune with the spirits. To ingest the seal, write it in ink and swallow one impression at a time, following a set progression. Use the seal to stamp talismans, and they will be efficacious. Ingest the talismans regularly before meals. Upon their entry, you may experience cold and heat, but your vision will grow sharper. Soon, a white-robed jade youth or a scholar in proper attire may appear before you—do not startle, for they will vanish of their own accord.\n\nAfter thirty days of visualization, your body will naturally become light. Superior practitioners may ascend into the pure void, roaming and feasting in the Upper Clarity. Middling practitioners may lift their forms a hundred *zhang*, and lesser practitioners ten *zhang*. Upon ingesting all eighteen talismans, you will see the attendants in seal-embroidered robes—proof of your sincerity. The jade youths and jade maidens guarding the talismans will reveal their true forms to you.\n\nBefore ingesting the talismans, first abstain from the five pungent plants, meat, blood, and sexual activity. Avoid defilement and impurity. After a hundred days, seclude yourself in a quiet chamber, avoiding contact with worldly people or noisy gatherings. Only then will the Dao be accomplished.\n\nThose who ingest the Stone Scenery and Golden Radiance talismans must especially refrain from defilement, sloth, and evil conduct. Cultivate the body, focus the mind on the Dao, and prioritize purification and concentration. By practicing this Dao, you may ascend as an immortal, befriend celestial perfected beings, and commune with the host of immortals. You will be able to summon spirits, attract divine elixirs and magic mushrooms, and conjure traveling kitchens, dragon chariots, feathered canopies, jade youths, jade maidens, and all spirits under heaven to serve you. There will be nothing you do not know and nothing you cannot obtain.\n\nThe Heaven-Earth Separation Talisman can repel armies for a thousand miles. Those who plot against you will suffer misfortune, and any who raise weapons against you will turn them upon themselves. The talisman may be sealed, burned and ingested, or placed within a bamboo staff. Use a one-foot-two-inch tube, inscribe the talisman on silk nine *cun* long and four *cun* wide, place it in the tube, and bind it to your arm—left for men, right for women.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1272,
      "start_sentence": 0,
      "end_sentence": 38,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.34516882896423,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\神符类\\洞真太微黄书天帝君石景金阳素经.txt",
        "category": "神符类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "秘之秘之，自非录名太极玉简之子，不得与相遇。 得带之者，浮游四方，厌伏万 灾，世人佩之，享福延年，子孙繁昌，道士得之，飞行上清，有之者降福，修之者升虚也。 子欲升入太微，当服无上灵符，则入太一元皇中矣。 子欲朝礼天帝，上紫宫，当服太上灵符。 子欲见太上道君，当服明堂符。 子欲入五岳，令其山大神及诸仙人皆来侍卫者，当各服其岳符也。 子欲入元关中，当服元先符，即见元先君矣。 子欲服从仙官见百二十神者，当服万神符，即见诸仙君矣。 子欲降见太清九神人，当服天门符，即见太清君矣。 子欲上天入渊，飞行八素，纵横隐匿，唯意所之，当服太微天帝石景别符，则天地鬼神不拘留子也。 举仙人之印　奉神灵之印　可以御辈之印 斗衡之印　元皇之印　万神之印 天地神丹印　九皇之印　万仙之印 可以入天门印　万神不忤印　与仙同印 真人斗门之印　无敢问之印　驰入太清印 驱斗宫印　万神避之印　受爵之印 元先之印　乘龙升仙印　发太清印 云车之印　仓元皇之印　乘龙之印 阳光之印　斗君之印　天迎之印 天帝奉生印　乾门以开印　奉节之印 万神夹已印　百兽失炁印　天使行威印 制万神印　皆从已印　千二百形印 使持称官印　使令之印　 众同别印 九回君秩印　神章所下印　甚急之印 黄老之印　元先之印　可令却邪印 天火以行印　寒温之印　冬夏自然印 洞灵太一奉上之印　八异以得之印　幸不逆仙印 元始万神之印　万方受之印　万凶除之印 太微天帝君曰：天门符者，上来第四是也。 子若修服之者，先烧香於左右，玉童玉女各四十人，卫之有经之者，礼拜崇敬，盛以黄锦之蕴，勿令玉童玉女纠子之过也，可不勖哉。 受此文者，用黄地锦四十尺，黄金七两，临授，师与弟子对斋七日，或四日，然后而盟告也。 若带此文及存服者，皆以金阳石景之大祝也。 《金阳经》曰：每存服带佩之时，叩齿三十六通，咽液三十六过，临目而微祝曰： 太微天帝，紫宫灵尊，玄空太真，为帝之先，其道广大，其化自然，真理潜通，流布无间，精入明堂，保胎益魂，朱山再开，奉迎灵元，左采日华，右掇月根，流火万丈，金罗碧裙，腰带天录，首巾华冠，赐某登虚，飞行上清，乞愿升仙，役使万神，天灵地祇，莫敢不臣，万向皆会，福德如山，琼响遐振，恶魔灭烟。 右太帝招魂符，以鸡呜时北向烧香吞之，以摄魂神者也。 服符毕，微祝曰： 太帝耀明，和摄魂庭，三魂七魄，镇守故形，神安体全，得以长生，百疾消散，五藏康宁，使我飞仙，策驾云軿，赤子扶胥，得气之精，覆我紫盖，导从草灵。 毕叩齿三通，咽液三过。 服符之后心中常当存祝此法，具百神，不相失之诀，秘而行之。 按九华真妃曰：太微黄书本有八卷，真人昔於赤城山中，以《八箓交带真文》授许远游，明君所有者是也。 君所以未飞腾上清，骖驾云龙，正由不睹睹石景八素之篇第，今以相授，都有十八符并经序，按而修之，策龙步玄，举形阶渐矣。 可秘而宝之，太微石景之黄文，故非黄赤之小术，累相鉴诫矣。 未荡於胸心，君素行既彰，且玉体已标高运，味玄咀真，呼引景耀，凝静六神，搜别八明，委顺灵根，保炼三度，养液和魂，假使冲风繁激，将不能伐我之正性也。",
      "translated_text": "Guard this well, guard this well—none but those whose names are inscribed upon the Jade Tablet of the Great Ultimate may encounter it. Those who bear it shall wander freely through the four directions, suppressing all calamities. Mortals who wear it shall enjoy blessings and long life, their descendants flourishing in abundance. Daoists who obtain it shall ascend to the Upper Clarity. Those who possess it shall receive fortune; those who cultivate it shall rise into the void.\n\nIf you wish to ascend and enter the Great Subtlety, consume the Supreme Numinous Talisman, and you shall enter the midst of the Primordial Sovereign of the Great One. If you wish to pay homage to the Heavenly Thearch and ascend to the Purple Palace, consume the Supreme Lord’s Numinous Talisman. If you wish to behold the Supreme Lord of the Dao, consume the Hall of Light Talisman. If you wish to enter the Five Marchmounts, causing their mountain spirits and all immortals to come and attend you, consume each marchmount’s respective talisman. If you wish to enter the Primordial Pass, consume the Primordial Forerunner Talisman, and you shall behold the Lord of the Primordial Forerunner. If you wish to follow the immortal officials and behold the one hundred twenty spirits, consume the Talisman of the Myriad Spirits, and you shall behold the lords of all immortals. If you wish to descend and behold the Nine Divine Persons of the Great Clarity, consume the Talisman of the Heavenly Gate, and you shall behold the Lord of the Great Clarity. If you wish to ascend to heaven or enter the abyss, to soar through the Eight Simplicities, to roam and conceal yourself at will, consume the Separate Talisman of the Heavenly Thearch of the Great Subtlety and the Stone Radiance—then the spirits of heaven and earth shall not detain you.\n\nThe Seal of Ascended Immortals\nThe Seal of Divine Spirits\nThe Seal for Commanding Inferiors\nThe Seal of the Dipper’s Balance\nThe Seal of the Primordial Sovereign\nThe Seal of the Myriad Spirits\nThe Seal of the Divine Elixir of Heaven and Earth\nThe Seal of the Nine Sovereigns\nThe Seal of the Myriad Immortals\nThe Seal for Entering the Heavenly Gate\nThe Seal of Unopposed Myriad Spirits\nThe Seal of Unity with Immortals\nThe Seal of the True Person’s Dipper Gate\nThe Seal No One Dares Question\nThe Seal for Galloping into the Great Clarity\nThe Seal for Commanding the Dipper Palace\nThe Seal Before Which the Myriad Spirits Flee\nThe Seal of Receiving Rank\nThe Seal of the Primordial Forerunner\nThe Seal for Mounting the Dragon and Ascending as an Immortal\nThe Seal for Issuing the Great Clarity\nThe Seal of the Cloud Chariot\nThe Seal of the Primordial Sovereign of the Vault of Heaven\nThe Seal for Mounting the Dragon\nThe Seal of Yang Radiance\nThe Seal of the Dipper Lord\nThe Seal of Heaven’s Welcome\nThe Seal of the Heavenly Thearch’s Bestowal of Life\nThe Seal for Opening the Gate of Qian\nThe Seal of Bestowed Authority\nThe Seal of the Myriad Spirits Flanking You\nThe Seal of the Hundred Beasts Losing Their Qi\nThe Seal of Heaven’s Envoys Enacting Might\nThe Seal for Controlling the Myriad Spirits\nThe Seal That Follows Your Command\nThe Seal of the One Thousand Two Hundred Forms\nThe Seal of the Envoys Holding Official Titles\nThe Seal of Command\nThe Seal of Shared Distinction\nThe Seal of the Ninefold Lord’s Rank\nThe Seal of the Divine Chapters’ Descent\nThe Seal of Utmost Urgency\nThe Seal of the Yellow and the Old\nThe Seal of the Primordial Forerunner\nThe Seal for Repelling Evil\nThe Seal for Commanding Heavenly Fire\nThe Seal of Cold and Heat\nThe Seal of Winter and Summer’s Naturalness\nThe Seal of the Cavernous Numinous Great One’s Offering\nThe Seal for Obtaining the Eight Wonders\nThe Seal of Good Fortune Without Offending Immortals\nThe Seal of the Primordial Beginning and the Myriad Spirits\nThe Seal of the Myriad Directions’ Reception\nThe Seal for Dispelling the Myriad Evils\n\nThe Heavenly Thearch of the Great Subtlety states: The Talisman of the Heavenly Gate is the fourth among those transmitted above. If you cultivate and consume it, first burn incense to your left and right. Jade lads and jade maidens, forty each, shall attend you. Those who possess the scripture must revere and honor it, wrapping it in a case of yellow brocade. Do not allow the jade lads and maidens to reproach your transgressions—how could you not be diligent?\n\nThose who receive this text shall use forty feet of yellow-ground brocade and seven taels of gold. At the time of transmission, master and disciple shall fast together for seven days—or four days—before performing the covenant and declaration. If you bear this text or meditate upon consuming it, it shall be the great invocation of the Golden Radiance and Stone Radiance.\n\nThe *Scripture of Golden Radiance* states: Each time you meditate upon consuming or bearing the talisman, knock your teeth thirty-six times, swallow saliva thirty-six times, and with eyes closed, softly invoke:\n*\"Heavenly Thearch of the Great Subtlety, numinous honor of the Purple Palace, mysterious emptiness and great perfection, forerunners of the Thearch, whose Dao is vast and great, whose transformations are spontaneous, whose true principles flow unseen, spreading without interruption—essence enters the Hall of Light, protecting the embryo and augmenting the hun-soul. The Crimson Mountain opens again, welcoming the numinous origin. To the left, I gather the radiance of the sun; to the right, I pluck the root of the moon. A thousand fathoms of flowing fire, golden gauze and azure skirts, a sash bearing the records of heaven, a headscarf and flowered crown. Grant that I ascend the void, soaring to the Upper Clarity. I beseech ascension as an immortal, to command the myriad spirits. The numina of heaven and earth shall dare not disobey; all directions shall converge, and fortune and virtue shall be as mountains. The resonance of jade shall echo afar, and evil demons shall vanish like smoke.\"*\n\nThe Talisman of the Heavenly Thearch for Summoning the Hun-Soul: At the hour of the cock’s crow, face north, burn incense, and swallow it to gather the hun-soul. After consuming the talisman, softly invoke:\n*\"Radiant brilliance of the Great Thearch, harmonizing and gathering the court of the hun-soul. The three hun and seven po shall guard and stabilize this original form. Spirit at peace, body whole, I attain long life. A hundred illnesses disperse, the five viscera find peace. Let me ascend as a flying immortal, driving a cloud chariot. The Red Child shall support me, and I shall obtain the essence of qi. A purple canopy shall cover me, and spirit attendants shall follow.\"*\n\nConclude by knocking your teeth three times and swallowing saliva three times. After consuming the talisman, always meditate upon and invoke this method to assemble the hundred spirits—this is the secret for never losing them. Guard and practice it well.\n\nThe Perfected Consort of the Nine Flowers states: The *Yellow Writ of the Great Subtlety* originally comprised eight scrolls. In former times, a true person on Red City Mountain transmitted the *True Writ of the Eight Registers Worn at the Girdle* to Xu Yuanyou. What Your Excellency now possesses is that very text. The reason you have not yet soared to the Upper Clarity, riding a cloud-dragon chariot, is precisely because you have not beheld the *Stone Radiance and Eight Simplicities* in their entirety. Now I transmit them to you, comprising eighteen talismans and their scriptural prefaces. Cultivate them accordingly, and you shall stride the dragon’s steps and ascend the mysterious stages. Treasure and guard them well—the *Yellow Writ of the Stone Radiance of the Great Subtlety* is no trifling technique of yellow and red. Repeated warnings have been given.\n\nBefore it has cleansed your heart and mind, your inherent conduct has already become manifest, and your jade body has been marked by exalted destiny. Savor the mysterious and chew the real; summon and draw in radiant splendor. Calm the six spirits, discern the eight luminances. Submit to the numinous root, refine the three passes, nourish the fluids and harmonize the hun-soul. Even if violent winds rage, they shall not assail your true nature.",
      "overlap_context": "you do not know and nothing you cannot obtain.\n\nThe Heaven-Earth Separation Talisman can repel armies for a thousand miles. Those who plot against you will suffer misfortune, and any who raise weapons against you will turn them upon themselves. The talisman may be sealed, burned and ingested, or placed within a bamboo staff. Use a one-foot-two-inch tube, inscribe the talisman on silk nine *cun* long and four *cun* wide, place it in the tube, and bind it to your arm—left for men, right for women.",
      "start_char": 1272,
      "end_char": 2590,
      "start_sentence": 39,
      "end_sentence": 81,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.156301736831665,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\神符类\\洞真太微黄书天帝君石景金阳素经.txt",
        "category": "神符类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "绝讽勃蔼，焉能回己清淳邪。 尔乃空中自吟，虚心待神，营摄百绝，栖澄至真，当使忧累靡干於玄宅，哀念莫扰於绛津也。 淡泊眇观，顾景共欢，於是至乐自铿铉闻於两耳，云璈虎弹乎空轩也。 口挹香风，眼接三云，带佩金阳，制御群凶，俯仰四运，自得成真，视眇所灌，皆已合神矣。 夫真人之得真，每从是而获耳，不真而强真，亦於此而颠蹶也。 复使愆痾填籍，忧哀塞抱，经营常累，隐惜小道，和适群听，求心裕老，忽发哀音乎。 永夕长悼死殁，以悲逝心，精戚神离，三魂陨气，邪运空间，魄告魍魉，弃我虚陈，造遘百祟，何可握生道以奔於死房，已陶灵风，方践死室，掷已吉象，投之凶秽乎？ 名闻高胜而故犹豫，屡睹明科而未释疑。 遂罗污上章，使臭晨隐书，四极击鼓，三官寻矛，誓云何而忘太初焉。 於是神虎奋爪，毒龙放牙，八方诚广，曷处而逃身。 告谢之后，方悟清辽之可羡，言者之不虚，且哀声乱真，干作正炁，明君胡不常处福乡，於此振衣而归室乎？ 今以石景金阳文相付，行令尽睹八卷之首也。 洞真太微黄书天帝君石景金阳素经竟",
      "translated_text": "Let not the clamor of the vulgar and the murk of the worldly turn back your pure and unsullied nature. Then shall you chant in the void, empty your heart to await the spirits, tend to the hundred absolutes, and dwell in the clarity of the utmost real. Thus shall no cares or burdens disturb your mysterious abode, nor sorrowful thoughts trouble the crimson ford.\n\nIn serene detachment and distant contemplation, gazing upon the light with shared joy, the supreme bliss shall resound like chimes in both ears, and the cloud-borne zither and tiger’s strum shall echo through the empty pavilion. Your mouth shall sip fragrant winds, your eyes behold the threefold clouds, your waist bear the golden yang, and your command subdue all malevolence. Moving with the four seasons, you shall naturally attain perfection, and all that your distant gaze washes over shall merge with the divine.\n\nThe perfected attain perfection precisely through this, while those who feign perfection without truth shall stumble and fall thereby. Yet if transgressions and ailments fill the ledgers, if sorrow and grief choke the heart, if constant striving wearies the spirit, if petty ways are clung to in secret, if harmony is sought only to please the crowd, if the mind yearns for ease in old age—suddenly, mournful cries shall arise. Through endless nights, long lamenting the dead, grieving with a heart that mourns the departed, essence and spirit shall part, the three *hun*-souls scatter their *qi*, and in the void of inauspicious fate, the *po*-soul shall summon *wangliang* spirits. Abandoning my empty hall, they shall bring forth a hundred afflictions. How can one grasp the Way of life only to rush into the chambers of death? Having once refined the numinous wind, you now tread the halls of death, casting aside your auspicious signs and hurling yourself into foul defilement.\n\nThough your name resounds in lofty triumph, you still hesitate; though you have repeatedly beheld the luminous precepts, you have not dispelled your doubts. Thus you entangle yourself in defiled petitions, causing the stench of dawn to obscure the hidden writs. The four poles beat their drums, the Three Officials brandish their spears, and you swear oaths—how could you forget the Great Beginning?\n\nThen shall the divine tiger unsheathe its claws, the venomous dragon bare its fangs, and the eight directions stretch boundless—where could you flee? Only after such warnings shall you realize the longing for purity’s distant expanse, and that the words spoken were not empty. Yet how lamentable that wailing voices disrupt the true and disturb the upright *qi*! Why does the enlightened sovereign not dwell always in the land of fortune, shaking his robes and returning to his chamber?\n\nNow I entrust to you the *Stone Radiance Golden Yang Writ*, bidding you fully behold the first of the eight scrolls. Here ends the *Supreme Mystery Yellow Writ of the Heavenly Thearch of the Great Subtlety: The Stone Radiance Golden Yang Plain Scripture*.",
      "overlap_context": " yellow and red. Repeated warnings have been given.\n\nBefore it has cleansed your heart and mind, your inherent conduct has already become manifest, and your jade body has been marked by exalted destiny. Savor the mysterious and chew the real; summon and draw in radiant splendor. Calm the six spirits, discern the eight luminances. Submit to the numinous root, refine the three passes, nourish the fluids and harmonize the hun-soul. Even if violent winds rage, they shall not assail your true nature.",
      "start_char": 2590,
      "end_char": 3016,
      "start_sentence": 82,
      "end_sentence": 94,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.138909339904785,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\神符类\\洞真太微黄书天帝君石景金阳素经.txt",
        "category": "神符类"
      }
    }
  ]
}