{
  "source_id": "洞玄灵宝本相运度劫期经",
  "source_file": "chunked_daozang\\洞玄灵宝本相运度劫期经.json",
  "total_chunks": 9,
  "total_original_chars": 6048,
  "total_translated_chars": 33331,
  "total_translation_time": 160.7586646080017,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\本文类\\洞玄灵宝本相运度劫期经.txt",
    "category": "本文类"
  },
  "full_translation": "*The Scripture on the Original Forms and Cyclical Salvation Through Kalpas of the Cavern Mystery and Numinous Treasure*\n\nThe title of this scripture is *The Scripture on the Original Forms and Cyclical Salvation Through Kalpas of the Cavern Mystery and Numinous Treasure*. Its author is unknown, though it likely dates to the Northern and Southern Dynasties period. This text is a surviving fascicle of *The Scripture on Original Forms*. The base text is drawn from the *Zhengtong Daoist Canon*, under the Cavern Mystery Division, \"Scriptural Texts\" category.\n\n---\n\n*The Scripture on the Original Forms and Cyclical Salvation Through Kalpas of the Cavern Mystery and Numinous Treasure*\n\nOnce, the Numinous Treasure Heavenly Worthy, dwelling in the Cavern-Floating Mountains, addressed the Daoist Yanming, saying: \"How long have you resided in these mountains?\"\n\nYanming replied: \"Your disciple has dwelt in this realm for three million kalpas.\"\n\nThe Heavenly Worthy said: \"You have lived in this realm for three million kalpas—have you encountered any wondrous chapters or rare and marvelous beings?\"\n\nYanming answered: \"Since dwelling in this land for three million kalpas, the orchid groves have never withered, nor have the phoenixes ever died. The leaves of the trees in these groves bear the celestial script of the Great Primal Chaos, and nine-colored phoenixes perpetually feed upon them. These birds, in the six periods of day and night, emit extraordinary sounds. When they sing, all men and women in the kingdom turn toward their voices in reverence. Every man and woman in the land bears a golden countenance, and their lifespans extend to three hundred and sixty thousand years, with none meeting an untimely end.\n\nWithin this kingdom lies a pool refined by fire, its waters surging and frothing, swirling in patterns resembling the celestial script of the Great Primal Chaos. Once every three years, the men and women of the kingdom visit this fiery pool to bathe their forms, though they know not the cause or origin of this practice.\n\nThe people of this land do not know the Three Treasures to be revered, nor do they commit evil deeds. They follow the transformations of nature, living as freely as birds or deer. I only beseech the Heavenly Worthy to reveal the cause and origin of these things, that all in the kingdom may hear and understand.\"\n\nThe Heavenly Worthy replied:\n\nThis land’s men and women are innocent, their lifespans long and free from untimely death. In the first year of the Red Clarity era, I composed here the celestial script of the Great Primal Chaos, refining its characters with fire and channeling their essence into the pool, whence the script’s forms arose. Every three years, the kingdom’s men and women visit the fiery pool to bathe their bodies and drink its waters, which regulate their inner harmony for three years—thus their lives are prolonged, all by virtue of this celestial script of the Great Primal Chaos. At that time, fragrant grasses swept the ground, and the Dao transformed into orchid groves, their leaves bearing the script’s original forms. The leaves bore celestial patterns, and the phoenixes and birds that fed upon them gained long life and voices of refined beauty. Do you understand?\n\nFrom this day forth, the celestial cycle shall hasten, and the true script will be reclaimed to the Purple Tenuity Palace in the Supreme Vastness’ upper capital. Thereafter, human lifespans will grow short, the Five Turbidities will stir with restless strife, and wild heterodoxies will surge forth to disrupt and harm. Rulers will turn rapacious and violent, wars will erupt without cause, and pestilence will spread, amplifying their cruelty. The people will sicken and die in chaos, their fates—whether man or woman—left to chance, without reason or principle.\n\nMoved by pity, I composed the celestial script of the Great Primal Chaos and traversed the lands to expound the Dao, delivering the lost through the Law. If there are good men and good women who cultivate virtue and the Way, they may forever escape this evil age and attain the blessings of the future’s realm of non-action.\n\nFlame Clarity replied: This matter is ancient and profound, beyond the discernment of those with shallow wisdom or foolish hearts. To hear this teaching today and learn the origin of these things is a fortune unmatched in a lifetime.\n\nThe Heavenly Worthy said: The celestial cycle hastens, and the true script is withdrawn beyond the Great Veil to the Jade Vastness’ Mystic Terrace in the Purple Tenuity Palace. The Five Turbidities will surge with restless strife, human lifespans will grow ever shorter, and wild heterodoxies will rush forth to afflict and harm. The people will sicken and die in chaos. In such suffering, there is none to blame—only through reverence, incense offerings, and prayers to escape this evil age and seek the boundless blessings of the future may one endure. By such deeds, one may balance their fate; with further merit, they may escape calamity and later attain great fortune.\n\nThe answer states: The Three Treasures are the origin of the Dao and the foundation of salvation across the world. The Three Actions are the pathways of divine perfected beings and the routes by which all sages proceed. Perpetual fasting is the supreme practice of true immortals and the beginning of severing karmic knots. Almsgiving is the boundless Dao-field where the Seven Treasures naturally abide. As for the Five Precepts, they bring peace without endless suffering, ensuring the continuity of the human path. The Forty-Five Contemplations are the radiant practice of great compassion, distinguishing the Three Evils from beginning to end. Building dwellings brings immeasurable tranquility, with palaces ever following one’s steps. Offerings ensure that in movement and stillness, one is never hungry or wanting, for the celestial kitchens are ever naturally present. Aiding those parched and destitute brings constant safety in going and staying, free from all other suffering. Constructing bridges to ferry others across ensures that in times of peril, one does not perceive peril, for heavenly spirits ever lend their support. Bestowing alms brings joy to the gods in the empty sky, and Daoists manifest their profound sincerity. Chanting the Dao brings constant fulfillment in coming and going, and in life and death, one attains a human lord. In all such practices, there is none that does not bring fulfillment. Those who act accordingly find every intention realized; what the heart dwells upon, the mouth speaks, and in hesitation, the feet hasten. When heart, mouth, and action align, harmonious light pervades, and the spirit is complete. If emotions oppose and conflict, even a hundred attempts find no one to aid; though one may temporarily gain slight favor, Heaven will surely reclaim it. To practice learning without intent is like straying from the path and falling into a pit; restraining desires is perilous within, while indulging them casts one into the vast sea. When dust-like thoughts arise, burning and vexing, only the solitary true thought remains. One must not be agitated by external disturbances, nor allow the slightest defilement to take hold. Even the slightest attachment can seize a person, obscuring the original resolve of the heart. A hundred afflictions open through the slightest gaps, yet all may receive the supreme Dharma. Use it when needed, and set it aside when not; what is born is born, and what is not born remains unborn. If scholars do not reflect carefully, demonic desires will arise without doubt. Entrusting actions to wise discernment, the path becomes smooth and level. From beginning to end, there is no decay, and the spirit delights in aiding the Dao. With merit established and affairs accomplished, the Dao King rejoices. One receives the prophecy of the supreme realm, profound and boundless in wisdom, forever parting from the hundred afflictions, sharing the divine wisdom of the myriad perfected beings.\n\nYanming asked: In the future, should the Five Turbidities of the evil age arise, with wild heterodoxies and all manner of calamities disturbing the good and upright, bringing illness and death without reason—how then?\n\nThe Heavenly Worthy replied: By cultivating all meritorious deeds and practicing the Dao’s methods, with merit universally perfected, one may deliver all beings from the evil age. Yet if one is pressed by official duties, oppressed from above and burdened below, suffering and afflicting all beings, unable to advance in merit or retreat from death, with official matters and illnesses vying to torment—how can one escape such dire straits?\n\nThe sagely ones, in their great compassion, respond to the world’s suffering. How could they not urge us? How could they not urge us?\n\nThe Heavenly Worthy declared: Excellent is your question, most essential and wondrous. Listen carefully, listen carefully, as I tell you the methods to relieve suffering and deliver from distress.\n\nIn the first year of the Red Brightness era, on the first *yin* day of the first month, the celestial light shone brilliantly, the sun and moon radiated their splendor, a numinous wind swept away the dust, and the mountains and peaks concealed the clouds. At that time, this Dharma was revealed, foreseeing the coming end of the kalpa’s final age, when warfare and illness would spread, and human lifespans would grow short. Thus, the method of extending life and delivering the world from death was opened in the Purple Tenuity’s Upper Palace, the Dao of relieving distress, saving from suffering, and rescuing from peril. Therefore, the *Scripture of Divine Incantations* in ten scrolls was expounded to save all beings from suffering and distress. If any being encounters illness, official matters, imprisonment, or any calamity, and can recite, sincerely uphold, copy, and make offerings to this scripture, they will in the future be reborn in *Tushita*, and in time, all will emerge together, able to witness the present world, forever ending in health and fortune.\n\nIf any being, beset by suffering and distress, cannot access the *Scripture of Divine Incantations* in ten scrolls, the *Vows of Demons* and *Incantations Against Evil* in two scrolls are indispensable. Even if one’s strength is insufficient, a single scroll can still deliver from distress and peril, bringing peace in this life. Why is this so? These two scrolls can summon the thirty-five great demon kings, the thirty-six great evil ghosts of the world, and subdue all the ghostly spirits of the Six Heavens. If any do not comply with the divine incantations’ methods, the demon kings can be cast into the abyss, into fire, or beheaded ten thousand times, their heads shattered into ten thousand pieces, without remorse.\n\nFurthermore, there are the Medicine Kings and Medicine Lords, who annually gather herbs from the Snow Mountains, compounding and refining them to save all from illness and suffering. If any being, amidst illness and distress, cannot obtain medicine, they need only single-mindedly contemplate the two medicines, and the perfected ones will prepare excellent remedies to heal the people, all recovering and growing well. One must maintain right thought and right mindfulness, and illness can be cured; if the mind wanders and right mindfulness is absent, recovery is impossible.\n\nMoreover, there are the seven perfected beings of the Upper Primordial Yang, the six divine immortals, and the names of the thirteen perfected beings who attained the Dao in past ages. When facing peril that cannot be escaped, one need only sincerely invoke their names, and the thirteen perfected beings will immediately respond to rescue and protect, ensuring complete peace. Without sincerity, even calling ten thousand times will not summon the divine perfected beings.\n\nThis Upper Primordial Yang’s supreme method delivers people from distress and rescues all suffering beings in the world. If any being is without sons or daughters, and can sincerely uphold, copy, recite, and contemplate this scripture, all their wishes will be fulfilled. Furthermore, the *Supreme Numinous Treasure for Delivering All Beings* can be copied, recited, and chanted in purification rites, and all wishes will be fulfilled without exception. Why is this so? This scripture contains the hidden sounds of the heavens, most revered and wondrous beyond all thought. If any being suffers from illness, death, official matters, or imprisonment, and can establish a purification rite and recite it ten times, the deceased will depart from the dark sufferings, ascend to heaven, and receive blessings naturally.\n\nIf one encounters distress and hardship, calling upon the names of the Thirty-Two Heavens with utmost sincerity and prayer will bring deliverance without fail. Furthermore, the names of the Twenty-Five Perfected of Great Clarity can also rescue one from distress, wondrous beyond all thought. The secret names of the Six Heavenly Demon Kings from the *True Scripture of the Great Cavern* likewise deliver one from hardship. The names of the Twelve Perfected Lords from the *Boundless Divine Scriptures*, when recited with utmost sincerity, also rescue one from distress. The names of the Nine Heavens from the *True Scripture of Samādhi* can likewise deliver one from hardship. The names of the Five Visceral True Spirits from the *Exegesis of the Dao and Its Virtues* Sections, when invoked with utmost sincerity, guard and protect the body, pacify and secure the hun and po souls, allowing the spirit to be serene and settled, avoiding all misfortunes, and fulfilling every wish.\n\nIf one can contemplate the boundless and infinite, whenever one directs their thoughts, pondering, recalling, invoking, and calling upon them, all will be granted, and every desire fulfilled.\n\nYanming said: All beings who thus contemplate, thus reflect, and call upon the names of the sages will be delivered from distress and receive blessings. Yet beings do not believe in such contemplation, nor trust in the existence of the sages’ names. Only when they encounter misfortune and suffering do they turn their thoughts to the mysterious workings, entrust themselves to the Daoist gate, and with utmost sincerity call upon the names of the sages—will their efforts bear fruit?\n\nThe Heavenly Worthy replied: Yes.\nWhy is this so?\nFor the initial sincerity is precious, and the later fruition is to be esteemed.\n\nThose who can fully engage both body and mind may be called excellent—how could their efforts fail to bear fruit? Yet those who cultivate the Dao without faith in merit and virtue resign themselves to the cycles of life and death, unaware of the karmic wheel of cause and effect and retribution. They do not study the scriptures of the various traditions, dismissing them as empty words. Should they encounter a starving scholar, emaciated and near death, and take pity upon seeing him, unable to bear his suffering, they might support him to a place of abundance, feeding him sweet broth and fine gruel. After the first meal, his complexion brightens with joy; after the second, his strength returns to walk with vigor; after the third, his speech flows with eloquence; after the fourth, his wisdom and vitality arise naturally. Thus, the starving man’s life is saved, his name and fate preserved. With three days and five meals, the five virtues are complete. Such a person’s name is then inscribed in the Eastern Flower Register, his death stricken from the Northern Ledger, and he is nourished by faith and compassion. If such is the fruit of kindness, how much more so when one, in distress, calls upon the sages for deliverance?\n\nThe sages ever attend to those in peril, never forsaking the ignorant or destitute. They constantly repay enmity with virtue and transform those with sincere hearts. Though one may have had no prior connection with them, if they turn in earnest devotion, how could their plea go unanswered? It is like the spirit of the valley: it responds to every inquiry, never choosing which voice to answer. The response of the sages is likewise.\n\nSomeone asked: If a virtuous man cultivates the three karmic actions, perfects all dharmas, fulfills every good deed, and exhausts all contemplation, what becomes of his Dao?\n\nThe answer: It is recorded in the *Ten Immortals*. Why? When all practices are complete, virtue flourishes and shines forth, the weight of defilements is extinguished, and merit is fully inscribed.\n\nSomeone asked: If a woman cultivates the three karmic actions, perfects all dharmas, fulfills every good deed, and exhausts all contemplation, what becomes of her Dao?\n\nThe answer: She is granted a transformed form. Why? A woman’s past merit was humble, which is why she was born in a female body. Now that her merit and practice are complete, her name is inscribed in the record of merit, and none can take it from her. Yet she must still transform from female to male before attaining this fruit.\n\nSomeone asked: Can the Ten Immortals be achieved all at once? Or is there a revolving progression?\n\nThe answer: From the First Immortal to the Tenth, each has its proper sequence; they cannot be treated as equal or made to revolve together. Why? Some may be ordinary beings yet practice the Ten Immortals; others may be voice-hearers who have not awakened and cannot practice even one. Thus, practice varies in refinement, insight in depth, and application in degree—all depending on the heart.\n\nSomeone asked: In the method of the learned adept, should one tally the body, the heart, the actions, the merit, or the years? If one cultivates the body, it need not be arduous; if one follows the heart, it need not tally the body; if one counts the actions, it need not be meticulous; if one counts the merit, it need not be ascetic; if one counts the years, it need not be diligent. The proper balance of advance and retreat remains unclear. I pray the Heavenly Worthy enlighten the unenlightened, that all beings may fully understand.\n\nThe answer: The heart does not tally the body; merit is counted, not years. Why? A learned adept may go through countless rebirths yet not attain a single fruit.\n\nA learned adept may rise within a single chamber to practice the Dao and attain the rank of immortal. Thus, merit is reckoned by the heart’s arising, counted by the heart’s intent, and perfected through action to reach the True.\n\nSomeone asked: All things under heaven arise from the Dao and qi. Since they are born, should they not all possess *ming*? Do earth, water, stone, and iron alone lack *ming*?\n\nThe answer: These four things possess nature but not *ming*. Why? They have nature but no *ming* because they lack blood, veins, sap, or color. Thus, they have nature but no *ming*.\n\nSomeone asked: Why do humans possess ten subtle constituents, while plants possess eight?\n\nThe answer: Because they lack intention and movement.\n\nSomeone asked: Why is the Dao alone called pure?\n\nThe answer: Purity means all actions are complete yet free from dust or defilement—hence, it is called pure. All below the Dao remain impure. Why? Externally, it manifests nothing; internally, it bears no dust. Its nature is serene, without gain or loss. It cannot be destroyed by slander nor exalted by praise; it cannot be muddied by disturbance nor clarified by stillness. Vast and empty, nothing compares to it. Drifting without obstruction, it is thus named pure.\n\nSomeone asked: Why is the Dao called One?\n\nThe answer: The Dao is so named because it is non-action yet nothing is left undone. Lofty without a canopy, deep without a base, above it no higher authority covers, below it no lower foundation supports. Without peer or counterpart, beyond analogy or metaphor, it is vast and empty. Ancestor of all sages, even the countless revered deities of the world revere and follow it to attain the utmost truth. Thus, it alone stands beyond the sacred, beyond thought, without equal—hence, it is called One.\n\nSomeone asked: Why is it called the Original Form?\n\nThe answer: The Original Form is so named by scriptural designation. Why? The *Original* refers to the unfolding of the Dao’s teachings, the illumination of sacred arts, the establishment of the Dharma realm, and the beginning of its transmission. The *Form* refers to the Dao’s laws opening the path, guiding beings through images, traversing the three realms, and radiating brilliant light. All beings in the ten directions receive the merit of its majestic form. Thus, the two names—Original and Form—were established at the inception, the foundation of all teachings. All perfected beings revere and receive it as the root of attaining the Dao and the beginning of accomplishment. Hence, it is called the Original Form.\n\nSomeone asked: How did heaven and earth come to be? How were the sun and moon established? How were the stars arrayed in their constellations?\n\nThe answer: When heaven and earth first arose, human lifespans were long, and evil thoughts were absent. The Dao’s qi was pure, and governance was effortless. As worldly rulers grew corrupt and people gradually turned to wickedness, the Dao’s qi became shallow, and the celestial cycle shortened. Heavenly demons descended, and heterodox ways spread unchecked. Rulers grew tyrannical, wars ravaged lives, and pestilential qi spread, aiding their cruelty. The unborn were harmed, infants perished, and the innocent suffered. The world fell into despair, plagued by war. Men and women lived in longing, their faces marked by sorrow. Even the wealthy were stripped of their wealth by taxes. Men could not marry, women could not wed. Men and women missed their proper time, and this grievance reached the celestial spirits. The balance of yin and yang was disrupted, floods and droughts struck together, frost and hail damaged the five grains, and people starved. They abandoned their homes, plundered one another, and even resorted to cannibalism.\n\nSome licentious men and untimely women issued private decrees and made mutual oaths. Beneath the sun, moon, and stars, or beside mountains, rivers, and shrines, they swore curses, abandoned their households, and sought verification. True spirits and venomous ghosts seized upon these oaths, causing male infants to be harmed at birth and female infants to die young. Ghostly armies aided their cruelty, and people died without reason. Bandits rose in competition, officials devoured the common folk, and the destitute wailed in despair, their grievances rising to heaven. Lifespans gradually shortened, and few lived beyond thirty. Boys matured at eight, girls at seven.\n\nIn such an age, the celestial cycle hastened, and all was chaos beyond description. Scorching yang surged against yin, clashing and pressing together. Yang’s poison and yin’s wrath ignited fires in rivers and seas, burning the cosmos to ash. Above, the sky lost its color; below, the earth lost its depths. All was hollow and empty, vast winds howling, crimson qi spreading everywhere.\n\nThen, the recorded sages were dispatched, bearing censers and keys to restore and expand the cosmos. The pure qi ascended to form heaven, the turbid qi descended to form earth. The pure spread the yang path, the turbid spread the yin path. They measured heaven and earth, establishing the four directions—east, west, south, north—and the four corners, above, below, and the center.\n\nThen, the mighty spirit Huhai was sent to construct mountains and rivers, the Five Peaks and Four Waterways, channeling them to their oceanic sources. The recorded sage-rulers, nurtured in the mysterious center with the numinous treasure’s true essence, condensed the sun, moon, and stars. The sun governs the yang path, moving one degree per day; the moon governs the yin path, moving thirteen degrees per day. Three hundred sixty-five degrees complete one celestial cycle. The sun spans a thousand *li*, the moon twelve hundred *li*, and the distance between heaven and earth is one hundred five thousand *li*.\n\nMount Kunlun stands at the earth’s center, comprising eighty-one tiers—also called the Eighty-One Heavens. The four faces of Kunlun are named the Four Continents, each governed by a Heavenly King who serves the Supreme Unity. Kunlun is the source of the Four Seas. Why? The four great seas emerge from its base, swirling outward in all directions before settling into the abyss. This abyss is three million three hundred sixty thousand *zhang* deep and thirty-six thousand five hundred *li* wide, aligning with the celestial measurements and requiring a ruler to govern it. This sea hosts thirty-two great dragon kings, who serve the Anavatapta Dragon King, along with millions of celestial dragons and countless dragon offspring.\n\nThe Kunlun mountain rises fifteen thousand *li* above the earth. There dwell earthly immortals and divine beings, whose chariot paths ascend from the northeast *jia* land and exit through the southwest *geng* land. The central route winds twelvefold before reaching the summit, which spans three hundred and thirty-six myriad *li*. The divine chariots and oxen remain there to this day.\n\nHeaven and earth, in their creation and transformation, give form to all things, cycling endlessly like the twelve-month system. Thus, among all earthly mountains, Kunlun stands as the highest.\n\nThree hundred myriad *li* south of Kunlun lies another Kunlun mountain, its expanse in the four directions—east, west, south, and north—boundless and immeasurable. The Kunlun illuminated by the sun and moon is called the Four Continents, surpassing all other regions.\n\nFrom one Kunlun to another, a count of one thousand makes one; from Kunlun to Kunlun, a count of one thousand makes two; from Kunlun to Kunlun, a count of one thousand makes three. When the count reaches one thousand, the lesser count begins at one. From the lesser count of one, when the number reaches one thousand, it is called a lesser thousand. From one lesser thousand to a count of one thousand, it is called one; from one lesser thousand to a count of one thousand, it is called two; from one lesser thousand to a count of one thousand, it is called three. These three counts of one thousand constitute the middle thousand. From the middle thousand to a count of one thousand, it is called one; from the middle thousand to a count of one thousand, it is called two; from the middle thousand to a count of one thousand, it is called three. These three counts of one thousand are called the great thousand. These three thousand worlds are governed by ten immortals, whose transformative manifestations and divine wisdom encompass all within their power.\n\nThus, the worlds are boundless, sagely wisdom is infinite, the burden of the multitudes has no end, and the power of the Dao knows no cultivation. All embodied beings attain life, virtue has no origin, and independence defies comparison.\n\nQuestion: When the Heavenly Venerable speaks of the end of heaven and earth’s cycle, the kalpas are exhausted, and all creation renews under a new heaven and earth. The vastness and depth of Kunlun and the great seas have been described. How many years pass before the cycle of adversity concludes? How many years elapse before calamities strike?\n\nAnswer: From the formation of heaven and earth to their end, there are three origins and nine adversities, along with great and minor disasters—these cycles cannot be altered. Why? Because when the numbers reach their end, they cannot be changed. What does this mean? The three origins are the upper, middle, and lower. Each origin has three adversities, and their numbers, once complete, cannot be altered. There are nine adversities in total, which neither heaven can alter nor earth can change—their numbers are fixed.\n\nWhy? The upper origin’s upper adversity concludes after eighty-one myriad years; its middle adversity after sixty-four myriad years; and its lower adversity after forty-nine myriad years. These are the cyclical numbers of the upper origin’s three adversities, and they cannot be altered. The middle origin’s upper adversity concludes after thirty-six myriad years; its middle adversity after twenty-five myriad years; and its lower adversity after sixteen myriad years. These are the cyclical numbers of the middle origin’s three adversities, and they cannot be altered. The lower origin’s upper adversity concludes after nine myriad years; its middle adversity after four myriad years; and its lower adversity after ten thousand years. These are the cyclical numbers of the lower origin’s three adversities, and they cannot be altered. These are the three origins and nine adversities, whose numerical terms cannot be defied.\n\nWithin these nine adversities, each adversity brings three disasters and six harms, which cannot be averted. Every three thousand years, a great disaster strikes, causing the death of people whose bones remain unburied. Every thousand years, a disaster kills half the people, their bones also left unburied. Every hundred years, wars rage across the land, and people perish. These three disasters, once their numbers are due, cannot be altered or averted.\n\nThe six harms occur as follows: one harm every three hundred sixty years, one every three hundred years, one every two hundred forty years, one every one hundred eighty years, one every one hundred twenty years, and one every sixty years. These six harms cannot be averted. Within the six harms, there are also three minor disasters. Why? Every thirty years, a disaster brings cattle plagues and grain shortages. Every twelve years, a minor disaster forces the sale of cattle and horses to store food. Every six years, a minor disaster causes cloth and silk to become cheap while rice and wheat grow expensive. These cycles are immutable.\n\nAll these—three origins, nine adversities, three disasters, and six harms—cannot be averted. The wise may discern them and avoid or escape them. For minor disasters, such as famine and poor harvests, one should store grain in preparation. Thus, the virtuous dwell where virtue resides, shun the lawless, seek blessed lands, and avoid peril, ensuring they remain free from misfortune. While the world falls into chaos, the virtuous alone remain secure; while all suffer hunger, the virtuous alone have enough.\n\nThus, the wise observe the times, discern fortune and misfortune, scrutinize the years, and avoid calamities, ensuring they remain free from harm. Therefore, the noble dwell near the virtuous and reap benefits, while the petty cling to their lands and face ruin. One must follow the virtuous.\n\nYanming said: I have received your teaching. I wish to ask further. In the great thousand worlds, all beings possess the nature of the Dao, though they lack its truth. When the cycle of destruction ends, what becomes of their nature?\n\nAnswer: When the cycle of destruction concludes, all beings universally cultivate compassionate hearts and aspire to the Dao’s realm. At the end of this kalpa, they attain the Dao in due time. Only those born from bubbles drift and float, yet they do not perish. Why? Because their seed is preserved. Thus, all myriad beings retain their seed and do not universally ascend.\n\nQuestion: If all beings universally attain the Dao’s truth, do they become one in substance with the Great Dao?\n\nAnswer: When all beings attain the Dao and become immortals, they are called *World-Honored Ones*, and in this, their attainment is complete. Only the qi of the Great Dao may be obtained—none can merge to equal its measure. Why? It is like a starving man who longs for satiety; once sated, he forgets his hunger. Thus, the perfected arise from insufficiency yet forget their former want, attaining sufficiency and forgetting insufficiency.\n\nQuestion: Can the nature of the Dao be seen?\n\nAnswer: It cannot be seen, yet through attainment, it becomes visible. Thus, what is visible remains unfulfilled, striking the eye yet unseen. Why? Even an immortal or perfected one perceives but one ten-thousandth of the Dao’s nature. From *śrāvakas* to those of *perfect enlightenment*, they know progress yet do not perceive it. Those who \"know progress\" have exhausted all defilements, leaving no afflictions; their spiritual transformations and powers surpass what scholars can attain. Thus, they know progress and forget regression. Even the four paths know progress yet not regression—how much less the two lesser vehicles?\n\nQuestion: The fruition beings of the three paths all possess fruition conduct. Why are their defilements not eradicated?\n\nAnswer: The fruition beings of the three paths may at times have defilements yet do not forget them. The fruition being of the first path has not yet parted from wife, children, or family; their cares and attachments to kin cannot be severed, thus their defilements persist, and they waver between advance and retreat. But those of the four paths and above ascend daily toward the hour of Chen, inevitably reaching the height of Wu. Why? Free from defilements and attachments, they ascend toward Chen and advance toward Wu. Thus, all is preserved without forgetting—hence the analogy.\n\n*The Scripture on the Original Phase, Cyclical Movement, and Kalpa Measures of the Cavernous Mystery and Numinous Treasure concludes.*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞玄灵宝本相运度劫期经 经名：洞玄灵宝本相运度劫期经。 撰人不详，约出於南北朝。 系《本相经》缺卷。 底本出处：《正统道藏》洞玄部本文类。 洞玄灵宝本相运度劫期经 灵宝天尊昔於洞浮山中，谓道士炎明曰：汝居此山几何也？ 炎明答曰：弟子自住此境三百万劫。 天尊曰：汝住是境三百万劫，叵有何奇章异种之物乎？ 炎明答曰：自居此土三百万劫，兰林不衰，凤鸟不死。 其林树叶有天景大混自然文字，九色凤鸟恒食树叶。 其鸟昼夜六时，吐其异音； 其鸟鸣时，国中男女皆望音而礼。 举国男女各面有金容，寿命三十六万岁，无有中夭者。 其国中有一火炼之池，其水蔚勃，礼服而激，形状有似天景大混之文。 国中男女三年一诣火池，沐浴身形，不知因缘所从而来。 其国人民不知三宝可奉，不知造恶，任化自然，亦如鸟鹿之徒生也。 唯愿天尊告其因缘所从而来，令诸国人悉得闻知。 天尊告曰；",
      "translated_text": "*The Scripture on the Original Forms and Cyclical Salvation Through Kalpas of the Cavern Mystery and Numinous Treasure*\n\nThe title of this scripture is *The Scripture on the Original Forms and Cyclical Salvation Through Kalpas of the Cavern Mystery and Numinous Treasure*. Its author is unknown, though it likely dates to the Northern and Southern Dynasties period. This text is a surviving fascicle of *The Scripture on Original Forms*. The base text is drawn from the *Zhengtong Daoist Canon*, under the Cavern Mystery Division, \"Scriptural Texts\" category.\n\n---\n\n*The Scripture on the Original Forms and Cyclical Salvation Through Kalpas of the Cavern Mystery and Numinous Treasure*\n\nOnce, the Numinous Treasure Heavenly Worthy, dwelling in the Cavern-Floating Mountains, addressed the Daoist Yanming, saying: \"How long have you resided in these mountains?\"\n\nYanming replied: \"Your disciple has dwelt in this realm for three million kalpas.\"\n\nThe Heavenly Worthy said: \"You have lived in this realm for three million kalpas—have you encountered any wondrous chapters or rare and marvelous beings?\"\n\nYanming answered: \"Since dwelling in this land for three million kalpas, the orchid groves have never withered, nor have the phoenixes ever died. The leaves of the trees in these groves bear the celestial script of the Great Primal Chaos, and nine-colored phoenixes perpetually feed upon them. These birds, in the six periods of day and night, emit extraordinary sounds. When they sing, all men and women in the kingdom turn toward their voices in reverence. Every man and woman in the land bears a golden countenance, and their lifespans extend to three hundred and sixty thousand years, with none meeting an untimely end.\n\nWithin this kingdom lies a pool refined by fire, its waters surging and frothing, swirling in patterns resembling the celestial script of the Great Primal Chaos. Once every three years, the men and women of the kingdom visit this fiery pool to bathe their forms, though they know not the cause or origin of this practice.\n\nThe people of this land do not know the Three Treasures to be revered, nor do they commit evil deeds. They follow the transformations of nature, living as freely as birds or deer. I only beseech the Heavenly Worthy to reveal the cause and origin of these things, that all in the kingdom may hear and understand.\"\n\nThe Heavenly Worthy replied:",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 374,
      "start_sentence": 0,
      "end_sentence": 18,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.80434799194336,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\洞玄灵宝本相运度劫期经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "此土男女无辜、寿命长远而无中夭者，吾昔在赤明元年，於此土中撰天景大混自然文字，以火炼其字形，流精水池，故有字形。 国人男女三年一诣火池，沐浴身形，即饮其水，腹中三年调节，故人命寿长远，以此天景大混自然文字故。 尔时香草拂拭，天文化成兰林，其叶文字以本有之。 故叶起天文，凤鸟食之，故能长命，其音丽雅。 汝知不乎？ 从今以去，天运当促，真文还收，太芒上京紫微宫中。 其后，人命短促，五浊躁竞，众邪野道竞来扰乱，国主贪暴，兵革妄兴，疫气流行，助其威虐； 人民疾病，死亡狼籍，是男是女，任命生死，不以道理。 吾哀之，故为撰其文字天景大混之科，历国说法，出法度人。 若有善男善女修行道德，永度恶世，取於将来无为之福场。 炎明曰：此事久远，非是浅智愚情之士所能分别。 今日闻说，得知本始所从而来，一生之幸，无喻可匹。 天尊言：天运当促，真文收还大罗之外，玉芒玄台紫微官宫。 五浊躁竞，人命转促，众邪野道，竞来扰害，人民疾病，死亡狼籍。 如斯之苦，无可怨之，唯有礼拜烧香，愿度恶世，求将来世无量之福场。 如有斯业，可以均之； 复有余业，可得免脱，后获大福乎？",
      "translated_text": "This land’s men and women are innocent, their lifespans long and free from untimely death. In the first year of the Red Clarity era, I composed here the celestial script of the Great Primal Chaos, refining its characters with fire and channeling their essence into the pool, whence the script’s forms arose. Every three years, the kingdom’s men and women visit the fiery pool to bathe their bodies and drink its waters, which regulate their inner harmony for three years—thus their lives are prolonged, all by virtue of this celestial script of the Great Primal Chaos. At that time, fragrant grasses swept the ground, and the Dao transformed into orchid groves, their leaves bearing the script’s original forms. The leaves bore celestial patterns, and the phoenixes and birds that fed upon them gained long life and voices of refined beauty. Do you understand?\n\nFrom this day forth, the celestial cycle shall hasten, and the true script will be reclaimed to the Purple Tenuity Palace in the Supreme Vastness’ upper capital. Thereafter, human lifespans will grow short, the Five Turbidities will stir with restless strife, and wild heterodoxies will surge forth to disrupt and harm. Rulers will turn rapacious and violent, wars will erupt without cause, and pestilence will spread, amplifying their cruelty. The people will sicken and die in chaos, their fates—whether man or woman—left to chance, without reason or principle.\n\nMoved by pity, I composed the celestial script of the Great Primal Chaos and traversed the lands to expound the Dao, delivering the lost through the Law. If there are good men and good women who cultivate virtue and the Way, they may forever escape this evil age and attain the blessings of the future’s realm of non-action.\n\nFlame Clarity replied: This matter is ancient and profound, beyond the discernment of those with shallow wisdom or foolish hearts. To hear this teaching today and learn the origin of these things is a fortune unmatched in a lifetime.\n\nThe Heavenly Worthy said: The celestial cycle hastens, and the true script is withdrawn beyond the Great Veil to the Jade Vastness’ Mystic Terrace in the Purple Tenuity Palace. The Five Turbidities will surge with restless strife, human lifespans will grow ever shorter, and wild heterodoxies will rush forth to afflict and harm. The people will sicken and die in chaos. In such suffering, there is none to blame—only through reverence, incense offerings, and prayers to escape this evil age and seek the boundless blessings of the future may one endure. By such deeds, one may balance their fate; with further merit, they may escape calamity and later attain great fortune.",
      "overlap_context": "e every three years, the men and women of the kingdom visit this fiery pool to bathe their forms, though they know not the cause or origin of this practice.\n\nThe people of this land do not know the Three Treasures to be revered, nor do they commit evil deeds. They follow the transformations of nature, living as freely as birds or deer. I only beseech the Heavenly Worthy to reveal the cause and origin of these things, that all in the kingdom may hear and understand.\"\n\nThe Heavenly Worthy replied:",
      "start_char": 374,
      "end_char": 837,
      "start_sentence": 19,
      "end_sentence": 35,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.448319435119629,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\洞玄灵宝本相运度劫期经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "答曰：三宝者，道之元，度世之本。 三业者，神真之径路，万圣之所由。 长斋者，真仙之上业，断结之本始。 布施者，无穷之道场，七宝常自然。 如五戒者，安乐无终患，人道常不绝。 四十五念者，大慈之业明，始终别三恶。 造屋者，安静无量乐，宫殿常自随。 供养者，行坐无饥乏，天厨常自然。 济人渴乏者，去住常安稳，始终无他苦。 桥梁过度者，临难不以难，天神常扶持。 舍施者，天神空中喜，道士殊丹诚。 唱道者，行来常如意，生死得人主。 一切诸业者，莫不得如意。 人能行如是，意从无不达，心注口必书，徘徊必驰之，心口行相从，和光神必周。 情逆其相违，百向无人可，虽假得微恩，天必还夺之。 行学从意浪，径违必坠坑，摄之崄#1五内，遣欲投巨海。 尘至想炎烦，正念孤独存，不得躁外烦，毫染不得加。 微受想夺人，本志心泯塞，百烦毫孔开，悉纳无上法。 用之便用之，不用便不用，生之何生之，不生为不生。 学士不思审，魔欲无疑之，付行良择用，驰路且夷止。 始终无朽败，神怡助道之，功立事亦成，道王其欢之。 授记无上乡，湛而无边知，永辞百烦苦，万真同神慧。 炎明问曰：当来傥为五浊恶世，众邪野道、一切众横扰乱良善，疾病死亡，不以道理。 蒙天尊言：造诸功德，修行道法，功普成就，得度恶世一切众生。 为生官逼迮，上扰下给，苦恼众生，进不及功，退不兔死，官事疾病，竞来威虐。 如斯之厄，奈何免脱？ 夫圣人大慈，应济世苦，岂不勉之，岂不勉之。 天尊告曰：善汝之所问，甚要甚妙。 谛听，谛听，语汝诸苦济厄之法。 昔者赤明元年正月上寅，天光悉朗，日月吐晖，灵风扫尘，山岳藏云。 出是法时，知当来运终劫末之世，兵病流行，人命短促，致开紫微上宫延生度世不死之法，济厄救苦拯难之道，故说神咒经十卷，救济众生苦厄之者。 若有众生遭诸疾病、官事刑狱、一切众横者，有能读诵、至心受持、书写供养，将来往生兜术，徐来勒一时同出，能迁见世，永终康吉。 若有众生遭诸苦厄，不能及是神咒经十卷者，誓魔、咒邪二卷，二卷不可无也。 假使力不能及，一卷亦可免度厄难，见世平安。 何以故？ 此二卷能召三十五大魔王、三十六世大邪鬼，威誓六天鬼神，无不威伏。 若有不如神咒之法，能令魔王入渊，能令魔王入火，能令魔王万斩，头破万分，不以为谢。 复有药王药盛，恒岁以雪山采药，采合药草，和合捣筛，救诸病苦。 若有众生遭诸众病苦厄之中，不及汤药，但当一心思惟二药，真人造诸良药医治百姓，皆得差愈。 但当正思正念，病可差除； 若心飞驰，不加正念，不能差愈。 复有元阳上部七仙真人、六神仙人、十三过去得道真人名号，临有厄难不能免脱，但当至心呼其名号，十三真人亦即来应救护，是人悉得平安。 若无至心，呼之万遍，不能降致神真也。 此元阳上品济人厄难，救护世中苦厄众生。 若有众生无男无女，有能至心受持、书写读诵、忆念是经，有愿悉得。 复有灵宝无量度人上品，有能书写读诵、斋咏是经，有愿无不如意。 何以故？ 斯经诸天隐韵之音，尊妙无量不可思议，若有众生病疾死亡、官事刑狱，有能建斋读诵十遍，亡者去离幽苦，上升天上，受福自然。",
      "translated_text": "The answer states: The Three Treasures are the origin of the Dao and the foundation of salvation across the world. The Three Actions are the pathways of divine perfected beings and the routes by which all sages proceed. Perpetual fasting is the supreme practice of true immortals and the beginning of severing karmic knots. Almsgiving is the boundless Dao-field where the Seven Treasures naturally abide. As for the Five Precepts, they bring peace without endless suffering, ensuring the continuity of the human path. The Forty-Five Contemplations are the radiant practice of great compassion, distinguishing the Three Evils from beginning to end. Building dwellings brings immeasurable tranquility, with palaces ever following one’s steps. Offerings ensure that in movement and stillness, one is never hungry or wanting, for the celestial kitchens are ever naturally present. Aiding those parched and destitute brings constant safety in going and staying, free from all other suffering. Constructing bridges to ferry others across ensures that in times of peril, one does not perceive peril, for heavenly spirits ever lend their support. Bestowing alms brings joy to the gods in the empty sky, and Daoists manifest their profound sincerity. Chanting the Dao brings constant fulfillment in coming and going, and in life and death, one attains a human lord. In all such practices, there is none that does not bring fulfillment. Those who act accordingly find every intention realized; what the heart dwells upon, the mouth speaks, and in hesitation, the feet hasten. When heart, mouth, and action align, harmonious light pervades, and the spirit is complete. If emotions oppose and conflict, even a hundred attempts find no one to aid; though one may temporarily gain slight favor, Heaven will surely reclaim it. To practice learning without intent is like straying from the path and falling into a pit; restraining desires is perilous within, while indulging them casts one into the vast sea. When dust-like thoughts arise, burning and vexing, only the solitary true thought remains. One must not be agitated by external disturbances, nor allow the slightest defilement to take hold. Even the slightest attachment can seize a person, obscuring the original resolve of the heart. A hundred afflictions open through the slightest gaps, yet all may receive the supreme Dharma. Use it when needed, and set it aside when not; what is born is born, and what is not born remains unborn. If scholars do not reflect carefully, demonic desires will arise without doubt. Entrusting actions to wise discernment, the path becomes smooth and level. From beginning to end, there is no decay, and the spirit delights in aiding the Dao. With merit established and affairs accomplished, the Dao King rejoices. One receives the prophecy of the supreme realm, profound and boundless in wisdom, forever parting from the hundred afflictions, sharing the divine wisdom of the myriad perfected beings.\n\nYanming asked: In the future, should the Five Turbidities of the evil age arise, with wild heterodoxies and all manner of calamities disturbing the good and upright, bringing illness and death without reason—how then?\n\nThe Heavenly Worthy replied: By cultivating all meritorious deeds and practicing the Dao’s methods, with merit universally perfected, one may deliver all beings from the evil age. Yet if one is pressed by official duties, oppressed from above and burdened below, suffering and afflicting all beings, unable to advance in merit or retreat from death, with official matters and illnesses vying to torment—how can one escape such dire straits?\n\nThe sagely ones, in their great compassion, respond to the world’s suffering. How could they not urge us? How could they not urge us?\n\nThe Heavenly Worthy declared: Excellent is your question, most essential and wondrous. Listen carefully, listen carefully, as I tell you the methods to relieve suffering and deliver from distress.\n\nIn the first year of the Red Brightness era, on the first *yin* day of the first month, the celestial light shone brilliantly, the sun and moon radiated their splendor, a numinous wind swept away the dust, and the mountains and peaks concealed the clouds. At that time, this Dharma was revealed, foreseeing the coming end of the kalpa’s final age, when warfare and illness would spread, and human lifespans would grow short. Thus, the method of extending life and delivering the world from death was opened in the Purple Tenuity’s Upper Palace, the Dao of relieving distress, saving from suffering, and rescuing from peril. Therefore, the *Scripture of Divine Incantations* in ten scrolls was expounded to save all beings from suffering and distress. If any being encounters illness, official matters, imprisonment, or any calamity, and can recite, sincerely uphold, copy, and make offerings to this scripture, they will in the future be reborn in *Tushita*, and in time, all will emerge together, able to witness the present world, forever ending in health and fortune.\n\nIf any being, beset by suffering and distress, cannot access the *Scripture of Divine Incantations* in ten scrolls, the *Vows of Demons* and *Incantations Against Evil* in two scrolls are indispensable. Even if one’s strength is insufficient, a single scroll can still deliver from distress and peril, bringing peace in this life. Why is this so? These two scrolls can summon the thirty-five great demon kings, the thirty-six great evil ghosts of the world, and subdue all the ghostly spirits of the Six Heavens. If any do not comply with the divine incantations’ methods, the demon kings can be cast into the abyss, into fire, or beheaded ten thousand times, their heads shattered into ten thousand pieces, without remorse.\n\nFurthermore, there are the Medicine Kings and Medicine Lords, who annually gather herbs from the Snow Mountains, compounding and refining them to save all from illness and suffering. If any being, amidst illness and distress, cannot obtain medicine, they need only single-mindedly contemplate the two medicines, and the perfected ones will prepare excellent remedies to heal the people, all recovering and growing well. One must maintain right thought and right mindfulness, and illness can be cured; if the mind wanders and right mindfulness is absent, recovery is impossible.\n\nMoreover, there are the seven perfected beings of the Upper Primordial Yang, the six divine immortals, and the names of the thirteen perfected beings who attained the Dao in past ages. When facing peril that cannot be escaped, one need only sincerely invoke their names, and the thirteen perfected beings will immediately respond to rescue and protect, ensuring complete peace. Without sincerity, even calling ten thousand times will not summon the divine perfected beings.\n\nThis Upper Primordial Yang’s supreme method delivers people from distress and rescues all suffering beings in the world. If any being is without sons or daughters, and can sincerely uphold, copy, recite, and contemplate this scripture, all their wishes will be fulfilled. Furthermore, the *Supreme Numinous Treasure for Delivering All Beings* can be copied, recited, and chanted in purification rites, and all wishes will be fulfilled without exception. Why is this so? This scripture contains the hidden sounds of the heavens, most revered and wondrous beyond all thought. If any being suffers from illness, death, official matters, or imprisonment, and can establish a purification rite and recite it ten times, the deceased will depart from the dark sufferings, ascend to heaven, and receive blessings naturally.",
      "overlap_context": "e. The Five Turbidities will surge with restless strife, human lifespans will grow ever shorter, and wild heterodoxies will rush forth to afflict and harm. The people will sicken and die in chaos. In such suffering, there is none to blame—only through reverence, incense offerings, and prayers to escape this evil age and seek the boundless blessings of the future may one endure. By such deeds, one may balance their fate; with further merit, they may escape calamity and later attain great fortune.",
      "start_char": 838,
      "end_char": 2064,
      "start_sentence": 36,
      "end_sentence": 83,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.85641002655029,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\洞玄灵宝本相运度劫期经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "若遭厄难，能呼三十二天名号，至心祈愿，无不解脱。 复有太清二十五真人名号，亦能济人厄难，不可思议。 复有大洞真经六天魔王讳字，亦复济人厄难。 无量神经十二真君名号，至心称诵，亦复济人厄难。 复有三昧真经九天名号，亦能济人厄难。 复有道德节解五藏真神名号，至心呼召，附卫身形，安镇魂魄，能使神爽安定，不遭众横，悉得如意。 若能思念无量至无边亿，所向之时，思之念之，号之呼之，无不允合，皆得如意。 炎明曰：一切众生作如是念，作如是思，称呼圣人名号，得度厄难，一切蒙恩。 但以众生不信斯念，不信圣人之有名号； 遇於众横苦恼之中，方思玄业，委身道门，至心称其圣人名号，有功感以否？ 天尊答曰：有。 何以故？ 贵其初心，尚其后果。",
      "translated_text": "If one encounters distress and hardship, calling upon the names of the Thirty-Two Heavens with utmost sincerity and prayer will bring deliverance without fail. Furthermore, the names of the Twenty-Five Perfected of Great Clarity can also rescue one from distress, wondrous beyond all thought. The secret names of the Six Heavenly Demon Kings from the *True Scripture of the Great Cavern* likewise deliver one from hardship. The names of the Twelve Perfected Lords from the *Boundless Divine Scriptures*, when recited with utmost sincerity, also rescue one from distress. The names of the Nine Heavens from the *True Scripture of Samādhi* can likewise deliver one from hardship. The names of the Five Visceral True Spirits from the *Exegesis of the Dao and Its Virtues* Sections, when invoked with utmost sincerity, guard and protect the body, pacify and secure the hun and po souls, allowing the spirit to be serene and settled, avoiding all misfortunes, and fulfilling every wish.\n\nIf one can contemplate the boundless and infinite, whenever one directs their thoughts, pondering, recalling, invoking, and calling upon them, all will be granted, and every desire fulfilled.\n\nYanming said: All beings who thus contemplate, thus reflect, and call upon the names of the sages will be delivered from distress and receive blessings. Yet beings do not believe in such contemplation, nor trust in the existence of the sages’ names. Only when they encounter misfortune and suffering do they turn their thoughts to the mysterious workings, entrust themselves to the Daoist gate, and with utmost sincerity call upon the names of the sages—will their efforts bear fruit?\n\nThe Heavenly Worthy replied: Yes.\nWhy is this so?\nFor the initial sincerity is precious, and the later fruition is to be esteemed.",
      "overlap_context": " for Delivering All Beings* can be copied, recited, and chanted in purification rites, and all wishes will be fulfilled without exception. Why is this so? This scripture contains the hidden sounds of the heavens, most revered and wondrous beyond all thought. If any being suffers from illness, death, official matters, or imprisonment, and can establish a purification rite and recite it ten times, the deceased will depart from the dark sufferings, ascend to heaven, and receive blessings naturally.",
      "start_char": 2064,
      "end_char": 2368,
      "start_sentence": 84,
      "end_sentence": 96,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.371444702148438,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\洞玄灵宝本相运度劫期经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "能有身心具发，可谓美矣，岂有无感功也。 炼陀人不信功德，任命生死，不知因缘轮转福报，而不经怀诸部经典，谓之虚言。 遇一馁士赢瘦欲死，路见怀矜，甚无已已，扶将到丰，饮饴过糜。 食一以毕，颜色畅悦； 食二以讫，走力充足； 食三以竟，辩口通说； 食四以足，智力自然。 馁困得济名号与命，三日五食，五德备矣。 斯人即名书东华，落死北簿，食信慈心。 其果如是，而况遭厄思圣济度。 夫圣人常临难接人，不穷无智，恒以德报怨，授化有心。 其人前虽无亲，思附丹诚，岂得不应者乎。 譬如谷神，咨无不对，岂择声而授者乎。 圣人之应，亦复如是。 问曰：若善男子修行三业，诸法亦备，万善普全，思虑亦尽，其道如何？ 答曰：十仙记矣。 何以故？ 众行普备，盛德诞彰，累烦灭除，功尽记矣。",
      "translated_text": "Those who can fully engage both body and mind may be called excellent—how could their efforts fail to bear fruit? Yet those who cultivate the Dao without faith in merit and virtue resign themselves to the cycles of life and death, unaware of the karmic wheel of cause and effect and retribution. They do not study the scriptures of the various traditions, dismissing them as empty words. Should they encounter a starving scholar, emaciated and near death, and take pity upon seeing him, unable to bear his suffering, they might support him to a place of abundance, feeding him sweet broth and fine gruel. After the first meal, his complexion brightens with joy; after the second, his strength returns to walk with vigor; after the third, his speech flows with eloquence; after the fourth, his wisdom and vitality arise naturally. Thus, the starving man’s life is saved, his name and fate preserved. With three days and five meals, the five virtues are complete. Such a person’s name is then inscribed in the Eastern Flower Register, his death stricken from the Northern Ledger, and he is nourished by faith and compassion. If such is the fruit of kindness, how much more so when one, in distress, calls upon the sages for deliverance?\n\nThe sages ever attend to those in peril, never forsaking the ignorant or destitute. They constantly repay enmity with virtue and transform those with sincere hearts. Though one may have had no prior connection with them, if they turn in earnest devotion, how could their plea go unanswered? It is like the spirit of the valley: it responds to every inquiry, never choosing which voice to answer. The response of the sages is likewise.\n\nSomeone asked: If a virtuous man cultivates the three karmic actions, perfects all dharmas, fulfills every good deed, and exhausts all contemplation, what becomes of his Dao?\n\nThe answer: It is recorded in the *Ten Immortals*. Why? When all practices are complete, virtue flourishes and shines forth, the weight of defilements is extinguished, and merit is fully inscribed.",
      "overlap_context": "from distress and receive blessings. Yet beings do not believe in such contemplation, nor trust in the existence of the sages’ names. Only when they encounter misfortune and suffering do they turn their thoughts to the mysterious workings, entrust themselves to the Daoist gate, and with utmost sincerity call upon the names of the sages—will their efforts bear fruit?\n\nThe Heavenly Worthy replied: Yes.\nWhy is this so?\nFor the initial sincerity is precious, and the later fruition is to be esteemed.",
      "start_char": 2368,
      "end_char": 2685,
      "start_sentence": 97,
      "end_sentence": 114,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.928889036178589,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\洞玄灵宝本相运度劫期经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "问曰：若有女人修行三业，诸法以备，万善普全，思虑亦尽，其道云何？ 答曰：降授一形。 何以故？ 女人前功卑，故生在女身。 今合功行并备，功书名记，无可夺之，要须转女化男，乃就此果耳。 问曰：十仙可一起而成？ 复有转轮？ 答曰：一仙、二仙，乃至十仙，皆有次第，未可等而同轮也。 何以故？ 或有凡夫，而行十仙； 或有声闻未悟，不能行一仙者。 是以行有精粗，见有远近，所用不等，各由心也。 问曰：学士之法，为数身数心，数行数功数年。 若修其身，未必苦勤； 若依其心，未必数身； 若计其行，未必细心； 若计其功，未必苦行； 若数其年，未必翘勤。 进退之宜，不能明了。 惟愿天尊告其未悟，令诸众生悉得解了。 答曰：自心不数身，计功不计年。 何以故？ 学士乃至兆身，而不一果；",
      "translated_text": "Someone asked: If a woman cultivates the three karmic actions, perfects all dharmas, fulfills every good deed, and exhausts all contemplation, what becomes of her Dao?\n\nThe answer: She is granted a transformed form. Why? A woman’s past merit was humble, which is why she was born in a female body. Now that her merit and practice are complete, her name is inscribed in the record of merit, and none can take it from her. Yet she must still transform from female to male before attaining this fruit.\n\nSomeone asked: Can the Ten Immortals be achieved all at once? Or is there a revolving progression?\n\nThe answer: From the First Immortal to the Tenth, each has its proper sequence; they cannot be treated as equal or made to revolve together. Why? Some may be ordinary beings yet practice the Ten Immortals; others may be voice-hearers who have not awakened and cannot practice even one. Thus, practice varies in refinement, insight in depth, and application in degree—all depending on the heart.\n\nSomeone asked: In the method of the learned adept, should one tally the body, the heart, the actions, the merit, or the years? If one cultivates the body, it need not be arduous; if one follows the heart, it need not tally the body; if one counts the actions, it need not be meticulous; if one counts the merit, it need not be ascetic; if one counts the years, it need not be diligent. The proper balance of advance and retreat remains unclear. I pray the Heavenly Worthy enlighten the unenlightened, that all beings may fully understand.\n\nThe answer: The heart does not tally the body; merit is counted, not years. Why? A learned adept may go through countless rebirths yet not attain a single fruit.",
      "overlap_context": "rit of the valley: it responds to every inquiry, never choosing which voice to answer. The response of the sages is likewise.\n\nSomeone asked: If a virtuous man cultivates the three karmic actions, perfects all dharmas, fulfills every good deed, and exhausts all contemplation, what becomes of his Dao?\n\nThe answer: It is recorded in the *Ten Immortals*. Why? When all practices are complete, virtue flourishes and shines forth, the weight of defilements is extinguished, and merit is fully inscribed.",
      "start_char": 2686,
      "end_char": 3012,
      "start_sentence": 115,
      "end_sentence": 137,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.21874189376831,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\洞玄灵宝本相运度劫期经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "乃有学士起一室而行道，以成一仙。 是故计功因心而起，因心而数其功，因行以致其真。 问曰：天下万物，都由道气而生。 既有其生，皆应有〔命〕#2。 土水石铁，独无命乎？ 答曰：此四事者，有性而无命。 何以故？ 有性而无命，无命者，以无血脉汁色，是以有性而无命也。 问曰：人所以十微？ 草木所以八微？ 答曰：以无意行。 问曰：道所以独清？ 答曰：清者，万行足而无垢尘，故曰清。 自道以下，皆未清。 何以故？ 外无所彰，内无若尘，其性淡然，而无亏盈，毁之不灭，誉之不荣，挠之不浊，澄之不清，淡泊虚无，无有及之，漂流无滞，称之日清耳。 问曰：道何以称一？ 答曰：名道者，无为无不为，高而无盖，下而无底，上无复尊覆，下无复卑承； 无匹无偶，无譬无喻，淡泊虚无。 万圣之祖宗，乃至世界恒沙尊神，莫不宗述以成至真。 是故独标圣外不可思议，而无草徒，故称之曰一耳。 问曰：何以称之本相？ 答曰：本相者，经号称耳。 何以故？ 本者，道教开敷，启曜圣艺，践起法场，流通之始，故称之曰本。 相者，道法开辟，像教众生，形践三界，光明振晖，十方众生得蒙威相之功，故称之曰相。 二名肇建，开张之首，一切万真，莫不宗受。 得道之本，成就之始，故称之曰本相也。 问曰：天地所以生成？ 日月所以布立？ 众星所以列宿？ 答曰：天地初生，人命长寿，而无恶心，道炁纯化，无为而治。 世王烦耗，民渐生恶，道炁浇浮，天运渐促。 天魔下降，野道横行，国主克暴，兵残民命，疫炁流布，助行威虐，伤胎落子，无辜纵毒。 天下无憀，皆遭兵患，男旷女怨，面有忧色。 虽有豪家，赋税荡尽，男失其娶，女失其嫁，男女失时，上彻天灵。 使阴阳失度，水旱交并，灾霜雨雹，伤害五谷，人民饥馑，各离乡侨，递相陵夺，更相吞食。 或有淫荡之男，不时之女，私行号令，共相咒誓； 或於日月星辰之下，或於山河社祠之边，迭相疏誓，弃门荡户，以临证验； 真神毒鬼，因誓摄录，生男堕伤，生女便夭。 天下鬼兵，助行威虐，人民死亡，不以道理。 盗贼竞兴，吏食百姓，穷民呼嗟，正怨上天。 渐渐夭促，命延不久，寿不过三十岁而终，男年八岁而阳，女年七岁而阴。 当斯之世，天运促急，共相浑浊，不可称记。 炎阳涌阴，激结相迫，阳毒阴怒，生火江海，劫烧乾坤，万物灰扬，上无天色，下无地渊，上下譊豁，混然空荡，滥风鸿鸿，赤炁弥张。 方遣授记之贤，持炉钥，排托施张，雕造乾坤，清炁上升为天，浊炁下降为地，清布阳道，浊布阴道，步天量地，制作东西南北四维，上下中央。 方遣巨灵胡亥建造山川，五岳四渎，通之海源。 授记贤主，玄中养以灵宝真精，凝成日月星宿。 日主阳道，日行一度； 月主阴道，月行十三度； 三百六十五度一周天。 日围千里，月围一千二百里，天地相去一亿五万里。 昆仑山处、於土中，凡有八十一重，亦名八十一天。 昆仑四面，即名四天下，天王主之，上承帝一。 昆仑者，四海之源。 何以故？ 四方大海出於山下，旋流四面而去，湛於渊。 其渊探三百三十六万丈，纵广三万六千五百里，上合天度，须人主之。 此海广有大龙王三十二头，上承阿耨龙王、诸天神龙百万之数，及诸龙子，亦无数量。",
      "translated_text": "A learned adept may rise within a single chamber to practice the Dao and attain the rank of immortal. Thus, merit is reckoned by the heart’s arising, counted by the heart’s intent, and perfected through action to reach the True.\n\nSomeone asked: All things under heaven arise from the Dao and qi. Since they are born, should they not all possess *ming*? Do earth, water, stone, and iron alone lack *ming*?\n\nThe answer: These four things possess nature but not *ming*. Why? They have nature but no *ming* because they lack blood, veins, sap, or color. Thus, they have nature but no *ming*.\n\nSomeone asked: Why do humans possess ten subtle constituents, while plants possess eight?\n\nThe answer: Because they lack intention and movement.\n\nSomeone asked: Why is the Dao alone called pure?\n\nThe answer: Purity means all actions are complete yet free from dust or defilement—hence, it is called pure. All below the Dao remain impure. Why? Externally, it manifests nothing; internally, it bears no dust. Its nature is serene, without gain or loss. It cannot be destroyed by slander nor exalted by praise; it cannot be muddied by disturbance nor clarified by stillness. Vast and empty, nothing compares to it. Drifting without obstruction, it is thus named pure.\n\nSomeone asked: Why is the Dao called One?\n\nThe answer: The Dao is so named because it is non-action yet nothing is left undone. Lofty without a canopy, deep without a base, above it no higher authority covers, below it no lower foundation supports. Without peer or counterpart, beyond analogy or metaphor, it is vast and empty. Ancestor of all sages, even the countless revered deities of the world revere and follow it to attain the utmost truth. Thus, it alone stands beyond the sacred, beyond thought, without equal—hence, it is called One.\n\nSomeone asked: Why is it called the Original Form?\n\nThe answer: The Original Form is so named by scriptural designation. Why? The *Original* refers to the unfolding of the Dao’s teachings, the illumination of sacred arts, the establishment of the Dharma realm, and the beginning of its transmission. The *Form* refers to the Dao’s laws opening the path, guiding beings through images, traversing the three realms, and radiating brilliant light. All beings in the ten directions receive the merit of its majestic form. Thus, the two names—Original and Form—were established at the inception, the foundation of all teachings. All perfected beings revere and receive it as the root of attaining the Dao and the beginning of accomplishment. Hence, it is called the Original Form.\n\nSomeone asked: How did heaven and earth come to be? How were the sun and moon established? How were the stars arrayed in their constellations?\n\nThe answer: When heaven and earth first arose, human lifespans were long, and evil thoughts were absent. The Dao’s qi was pure, and governance was effortless. As worldly rulers grew corrupt and people gradually turned to wickedness, the Dao’s qi became shallow, and the celestial cycle shortened. Heavenly demons descended, and heterodox ways spread unchecked. Rulers grew tyrannical, wars ravaged lives, and pestilential qi spread, aiding their cruelty. The unborn were harmed, infants perished, and the innocent suffered. The world fell into despair, plagued by war. Men and women lived in longing, their faces marked by sorrow. Even the wealthy were stripped of their wealth by taxes. Men could not marry, women could not wed. Men and women missed their proper time, and this grievance reached the celestial spirits. The balance of yin and yang was disrupted, floods and droughts struck together, frost and hail damaged the five grains, and people starved. They abandoned their homes, plundered one another, and even resorted to cannibalism.\n\nSome licentious men and untimely women issued private decrees and made mutual oaths. Beneath the sun, moon, and stars, or beside mountains, rivers, and shrines, they swore curses, abandoned their households, and sought verification. True spirits and venomous ghosts seized upon these oaths, causing male infants to be harmed at birth and female infants to die young. Ghostly armies aided their cruelty, and people died without reason. Bandits rose in competition, officials devoured the common folk, and the destitute wailed in despair, their grievances rising to heaven. Lifespans gradually shortened, and few lived beyond thirty. Boys matured at eight, girls at seven.\n\nIn such an age, the celestial cycle hastened, and all was chaos beyond description. Scorching yang surged against yin, clashing and pressing together. Yang’s poison and yin’s wrath ignited fires in rivers and seas, burning the cosmos to ash. Above, the sky lost its color; below, the earth lost its depths. All was hollow and empty, vast winds howling, crimson qi spreading everywhere.\n\nThen, the recorded sages were dispatched, bearing censers and keys to restore and expand the cosmos. The pure qi ascended to form heaven, the turbid qi descended to form earth. The pure spread the yang path, the turbid spread the yin path. They measured heaven and earth, establishing the four directions—east, west, south, north—and the four corners, above, below, and the center.\n\nThen, the mighty spirit Huhai was sent to construct mountains and rivers, the Five Peaks and Four Waterways, channeling them to their oceanic sources. The recorded sage-rulers, nurtured in the mysterious center with the numinous treasure’s true essence, condensed the sun, moon, and stars. The sun governs the yang path, moving one degree per day; the moon governs the yin path, moving thirteen degrees per day. Three hundred sixty-five degrees complete one celestial cycle. The sun spans a thousand *li*, the moon twelve hundred *li*, and the distance between heaven and earth is one hundred five thousand *li*.\n\nMount Kunlun stands at the earth’s center, comprising eighty-one tiers—also called the Eighty-One Heavens. The four faces of Kunlun are named the Four Continents, each governed by a Heavenly King who serves the Supreme Unity. Kunlun is the source of the Four Seas. Why? The four great seas emerge from its base, swirling outward in all directions before settling into the abyss. This abyss is three million three hundred sixty thousand *zhang* deep and thirty-six thousand five hundred *li* wide, aligning with the celestial measurements and requiring a ruler to govern it. This sea hosts thirty-two great dragon kings, who serve the Anavatapta Dragon King, along with millions of celestial dragons and countless dragon offspring.",
      "overlap_context": "rt, it need not tally the body; if one counts the actions, it need not be meticulous; if one counts the merit, it need not be ascetic; if one counts the years, it need not be diligent. The proper balance of advance and retreat remains unclear. I pray the Heavenly Worthy enlighten the unenlightened, that all beings may fully understand.\n\nThe answer: The heart does not tally the body; merit is counted, not years. Why? A learned adept may go through countless rebirths yet not attain a single fruit.",
      "start_char": 3012,
      "end_char": 4272,
      "start_sentence": 138,
      "end_sentence": 196,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.42143702507019,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\洞玄灵宝本相运度劫期经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "昆仑之山，一高地一万五千里，有地神仙人，车道从东北甲地而上，西南庚地而出。 其申一徘徊十二匝乃达其顶，上凡有三百三，十六万里，神仙车牛於今在也。 天地。 造化，万物有形，周而复始，亦如十二月法。 所以地山之高，昆仑为之最高。 昆仑之南三十万兆里，复有昆仑之山，东西南北亦有无量不可称计一日月所正一昆仑，名为四天下，更不及诸方。 从昆仑至昆仑，满千数之为一； 从昆仑至昆仑，满千数之为二； 从昆仑至昆仑，满千数之为三。 其数满千，小数始一； 从小数一起，其数至千，始名一小千。 从小千数至满千，始名为一； 从小千至满千，始名为二； 从小千至满千，始名为三； 其三满千，中千之数也。 从中千数至满千，始名为一； 从中千数至满千，始名为二； 从中千数之至满千，始名为三； 其三满千，名为大千。 些三千世界，十仙所主，化见神智，具相威力所能及也。 是以世界无边，圣智无极，载众无头，道力无修，一切含形悉得生活，德无所宗，独立无喻。 问曰：天尊所说天地运终劫数尽矣。 造化万物，乾坤更始。 昆仑巨海，广狭高卑具以说之。 运阨之难，几年一终？ 灾会之艰，几岁一遭？ 唯愿分别。 答曰：天地一成，乃至终尽，其中有三元九阨、大灾小灾，其运不可移。 何以故？ 但数终矣，故不可移。 所以者何？ 三元者，上中下也。 一元三阨，数终叵易，凡有九阨，天不能改，地不能易，其数定矣。 何以故？ 上元之上，九九八十一万年而终； 上元之中，八八六十四万年而终； 上元之下，七七四十九万年而终：此上元三阨交运之数，故不可夺。 中元之上，六六三十六万年而终； 中元之中，五五二十五万年而终； 中元之下，四四十六万年而终：此中元三阨交运之数，故不可夺。 下元之上，三三九万年而终； 下元之一中，二二四万年而终； 下元之下，一万年而终：此下元三阨交运之数也，故不可夺。 此是三元九阨，数期叵违。 九阨之中，一阨三灾六害，亦不可却之。 三千年一大灾，人民死亡，骸骨不收。 千年一灾，人民半死，骸骨亦不收。 百年一灾，兵起满野，人民亦有死者。 些三灾，其数既至，不可改禳之。 六害者，三百六十年一害，三百年一害，二百四十年一害，一百八十年一害，一百二十年一害，六十年一害，凡有六害，不可禳却。 六害之中，复有三小灾。 所以者何？ 三十年一灾，牛病五谷贵。 十二年一小灾，卖牛马，籴食储。 六年一小灾，布绢贱，米麦贵。 恒以此度，不可却之。 凡此三元九阨、三灾六害，皆不可禳之。 智人审之，可避而去之。 若小灾，饥馑不熟，贮谷备之。 是以贤人就有德，去无道，逐福地，离汤火，故始终无殃患也。 故天下皆乱而贤独安，天下皆饥而贤独足。 是以贤者观时来，知吉凶； 审年数，避祸难，故终无患也。 是以君子逐贤而居，果有利益； 小人就土地而处，果有覆没之患。 故须逐贤者也。 炎明曰：受恩。 愿问余解。 大千之载，一切众生悉有道性，虽有其性而无其真。 当运灭尽，其性如何？ 答曰：灭尽运终，一切众生普生慈心，志存道场，当斯末劫，周时得道。 唯有种子泡生而漂，终不死也。 何以故？ 以重其种。 故一切万类，亦留其种，终不普升也。",
      "translated_text": "The Kunlun mountain rises fifteen thousand *li* above the earth. There dwell earthly immortals and divine beings, whose chariot paths ascend from the northeast *jia* land and exit through the southwest *geng* land. The central route winds twelvefold before reaching the summit, which spans three hundred and thirty-six myriad *li*. The divine chariots and oxen remain there to this day.\n\nHeaven and earth, in their creation and transformation, give form to all things, cycling endlessly like the twelve-month system. Thus, among all earthly mountains, Kunlun stands as the highest.\n\nThree hundred myriad *li* south of Kunlun lies another Kunlun mountain, its expanse in the four directions—east, west, south, and north—boundless and immeasurable. The Kunlun illuminated by the sun and moon is called the Four Continents, surpassing all other regions.\n\nFrom one Kunlun to another, a count of one thousand makes one; from Kunlun to Kunlun, a count of one thousand makes two; from Kunlun to Kunlun, a count of one thousand makes three. When the count reaches one thousand, the lesser count begins at one. From the lesser count of one, when the number reaches one thousand, it is called a lesser thousand. From one lesser thousand to a count of one thousand, it is called one; from one lesser thousand to a count of one thousand, it is called two; from one lesser thousand to a count of one thousand, it is called three. These three counts of one thousand constitute the middle thousand. From the middle thousand to a count of one thousand, it is called one; from the middle thousand to a count of one thousand, it is called two; from the middle thousand to a count of one thousand, it is called three. These three counts of one thousand are called the great thousand. These three thousand worlds are governed by ten immortals, whose transformative manifestations and divine wisdom encompass all within their power.\n\nThus, the worlds are boundless, sagely wisdom is infinite, the burden of the multitudes has no end, and the power of the Dao knows no cultivation. All embodied beings attain life, virtue has no origin, and independence defies comparison.\n\nQuestion: When the Heavenly Venerable speaks of the end of heaven and earth’s cycle, the kalpas are exhausted, and all creation renews under a new heaven and earth. The vastness and depth of Kunlun and the great seas have been described. How many years pass before the cycle of adversity concludes? How many years elapse before calamities strike?\n\nAnswer: From the formation of heaven and earth to their end, there are three origins and nine adversities, along with great and minor disasters—these cycles cannot be altered. Why? Because when the numbers reach their end, they cannot be changed. What does this mean? The three origins are the upper, middle, and lower. Each origin has three adversities, and their numbers, once complete, cannot be altered. There are nine adversities in total, which neither heaven can alter nor earth can change—their numbers are fixed.\n\nWhy? The upper origin’s upper adversity concludes after eighty-one myriad years; its middle adversity after sixty-four myriad years; and its lower adversity after forty-nine myriad years. These are the cyclical numbers of the upper origin’s three adversities, and they cannot be altered. The middle origin’s upper adversity concludes after thirty-six myriad years; its middle adversity after twenty-five myriad years; and its lower adversity after sixteen myriad years. These are the cyclical numbers of the middle origin’s three adversities, and they cannot be altered. The lower origin’s upper adversity concludes after nine myriad years; its middle adversity after four myriad years; and its lower adversity after ten thousand years. These are the cyclical numbers of the lower origin’s three adversities, and they cannot be altered. These are the three origins and nine adversities, whose numerical terms cannot be defied.\n\nWithin these nine adversities, each adversity brings three disasters and six harms, which cannot be averted. Every three thousand years, a great disaster strikes, causing the death of people whose bones remain unburied. Every thousand years, a disaster kills half the people, their bones also left unburied. Every hundred years, wars rage across the land, and people perish. These three disasters, once their numbers are due, cannot be altered or averted.\n\nThe six harms occur as follows: one harm every three hundred sixty years, one every three hundred years, one every two hundred forty years, one every one hundred eighty years, one every one hundred twenty years, and one every sixty years. These six harms cannot be averted. Within the six harms, there are also three minor disasters. Why? Every thirty years, a disaster brings cattle plagues and grain shortages. Every twelve years, a minor disaster forces the sale of cattle and horses to store food. Every six years, a minor disaster causes cloth and silk to become cheap while rice and wheat grow expensive. These cycles are immutable.\n\nAll these—three origins, nine adversities, three disasters, and six harms—cannot be averted. The wise may discern them and avoid or escape them. For minor disasters, such as famine and poor harvests, one should store grain in preparation. Thus, the virtuous dwell where virtue resides, shun the lawless, seek blessed lands, and avoid peril, ensuring they remain free from misfortune. While the world falls into chaos, the virtuous alone remain secure; while all suffer hunger, the virtuous alone have enough.\n\nThus, the wise observe the times, discern fortune and misfortune, scrutinize the years, and avoid calamities, ensuring they remain free from harm. Therefore, the noble dwell near the virtuous and reap benefits, while the petty cling to their lands and face ruin. One must follow the virtuous.\n\nYanming said: I have received your teaching. I wish to ask further. In the great thousand worlds, all beings possess the nature of the Dao, though they lack its truth. When the cycle of destruction ends, what becomes of their nature?\n\nAnswer: When the cycle of destruction concludes, all beings universally cultivate compassionate hearts and aspire to the Dao’s realm. At the end of this kalpa, they attain the Dao in due time. Only those born from bubbles drift and float, yet they do not perish. Why? Because their seed is preserved. Thus, all myriad beings retain their seed and do not universally ascend.",
      "overlap_context": "un is the source of the Four Seas. Why? The four great seas emerge from its base, swirling outward in all directions before settling into the abyss. This abyss is three million three hundred sixty thousand *zhang* deep and thirty-six thousand five hundred *li* wide, aligning with the celestial measurements and requiring a ruler to govern it. This sea hosts thirty-two great dragon kings, who serve the Anavatapta Dragon King, along with millions of celestial dragons and countless dragon offspring.",
      "start_char": 4272,
      "end_char": 5496,
      "start_sentence": 197,
      "end_sentence": 271,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.701876878738403,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\洞玄灵宝本相运度劫期经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "问曰：如诸众生普得道真，与大道同体否？ 答曰：一切众生，得道成仙，号曰世尊，於此称尽矣。 唯有大道之气，可得之耳。 云欲合同道量，未之有也。 何以故？ 譬如饥人羡饱，得饱，饱而忘饥，是以真人起於不足而忘於乏，得足以忘不足。 问曰：道性可见否？ 答曰：不可见而可见之成之。 故可见未成，触目而不睹。 何以故？ 一仙真人视道性万分，始得见一。 自声闻、圆觉，知进而不睹。 知进者，诸漏已尽，更无烦恼，神通变效，学士所不能及。 故知进而忘其退。 四道尚知进而不知退，而况於二士乎。 问曰：三道果人俱有果行，其漏何以不除？ 答曰：三道果人，有时漏而不忘； 一道果人，妻子眷属未相去离，忧念眷属，不能断绝，故为漏有顾进退。 若有之四道以上，日升于辰，必至盛午。 何以故？ 无漏无顾，是升于辰，亦向午也。 是以悉存而不忘，故譬之也。 洞玄灵宝本相运度劫期经竟 #1 崄：疑当作「敛」。 #2 命：底本无。 据文义补。",
      "translated_text": "Question: If all beings universally attain the Dao’s truth, do they become one in substance with the Great Dao?\n\nAnswer: When all beings attain the Dao and become immortals, they are called *World-Honored Ones*, and in this, their attainment is complete. Only the qi of the Great Dao may be obtained—none can merge to equal its measure. Why? It is like a starving man who longs for satiety; once sated, he forgets his hunger. Thus, the perfected arise from insufficiency yet forget their former want, attaining sufficiency and forgetting insufficiency.\n\nQuestion: Can the nature of the Dao be seen?\n\nAnswer: It cannot be seen, yet through attainment, it becomes visible. Thus, what is visible remains unfulfilled, striking the eye yet unseen. Why? Even an immortal or perfected one perceives but one ten-thousandth of the Dao’s nature. From *śrāvakas* to those of *perfect enlightenment*, they know progress yet do not perceive it. Those who \"know progress\" have exhausted all defilements, leaving no afflictions; their spiritual transformations and powers surpass what scholars can attain. Thus, they know progress and forget regression. Even the four paths know progress yet not regression—how much less the two lesser vehicles?\n\nQuestion: The fruition beings of the three paths all possess fruition conduct. Why are their defilements not eradicated?\n\nAnswer: The fruition beings of the three paths may at times have defilements yet do not forget them. The fruition being of the first path has not yet parted from wife, children, or family; their cares and attachments to kin cannot be severed, thus their defilements persist, and they waver between advance and retreat. But those of the four paths and above ascend daily toward the hour of Chen, inevitably reaching the height of Wu. Why? Free from defilements and attachments, they ascend toward Chen and advance toward Wu. Thus, all is preserved without forgetting—hence the analogy.\n\n*The Scripture on the Original Phase, Cyclical Movement, and Kalpa Measures of the Cavernous Mystery and Numinous Treasure concludes.*",
      "overlap_context": " possess the nature of the Dao, though they lack its truth. When the cycle of destruction ends, what becomes of their nature?\n\nAnswer: When the cycle of destruction concludes, all beings universally cultivate compassionate hearts and aspire to the Dao’s realm. At the end of this kalpa, they attain the Dao in due time. Only those born from bubbles drift and float, yet they do not perish. Why? Because their seed is preserved. Thus, all myriad beings retain their seed and do not universally ascend.",
      "start_char": 5497,
      "end_char": 5900,
      "start_sentence": 272,
      "end_sentence": 297,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.007197618484497,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\洞玄灵宝本相运度劫期经.txt",
        "category": "本文类"
      }
    }
  ]
}