{
  "source_id": "洞玄灵宝钟磬威仪经",
  "source_file": "chunked_daozang\\洞玄灵宝钟磬威仪经.json",
  "total_chunks": 2,
  "total_original_chars": 2280,
  "total_translated_chars": 14109,
  "total_translation_time": 73.7536416053772,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\威仪类\\洞玄灵宝钟磬威仪经.txt",
    "category": "威仪类"
  },
  "full_translation": "*The Scripture on the Ritual Decorum of Bells and Chimes from the Cavernous Mystery and Numinous Treasure*\n\nAt that time, the Perfected One of Wisdom and Virtue, together with five hundred perfected beings, approached the Most High, bowed their heads, and inquired about the ritual decorum for assembling the multitude.\n\nThe Most High said: \"The multitude is of two kinds—one, the sacred assembly, and two, the ordinary assembly. Whenever the Dharma is expounded, precepts observed, obeisances made, or repentance offered, and whenever salvation is extended to the living to deliver them from birth and death, or in all meritorious gatherings where they should convene, the bell shall be struck to summon them.\n\n\"In former times, the Celestial Worthy of Original Beginning, while in the Heaven of Form, taught and transformed through the Dharma. As the time was not uniform and the assembly arrived in succession, he emitted ten kinds of radiance from between his brows, illuminating all the heavens, the five hundred million worlds, and the boundless lands, so that all might hear and know. Manifesting his great divine power, he expounded the wondrous Dao of the True One, harmonizing the essence of the Five Harmonies to form the boundless treasure bells. Each resonated according to its region, emitting numinous sounds in unison, their voices pervading heaven and earth, their tones like jade chimes. All intoned cavernous hymns, shaking day and night in accord with the twelve hours. Every being who heard them rejoiced, their hundred afflictions dispelled. Those who had not believed came to believe; those who had not awakened came to awakening. They gave rise to all manner of good wisdom and aroused the mind of right mindfulness.\n\n\"From that time onward, the system of bell sounds spread throughout the ten directions. Now, what you have asked is how to open and awaken the wisdom and virtue of all beings—how disciples, novices, and later learners, though they may have heard the bells and chimes, do not yet understand their ritual decorum. They are uncertain whether the bells of all the heavens are the same as those of the lower realms, or if there are distinctions among them.\"\n\nThe Most High replied: \"In the Three Clarities’ supreme realms and throughout the Three Realms and ten directions, the names and forms of bells differ. Now I shall roughly explain them; listen well.\"\n\nThe Most High said: \"In the Heaven of Great Pervasiveness, there are the Nine Luminous Floral Bells, the Seven Luminaries Divine Bells, the Cavernous Radiance Floating Bells, the Flying Essence Void Bells, the Great Radiance Cloud Bells, the Heaven-Opening Radiance Bells, and the Spontaneous Divine Bells.\n\n\"In the Heaven of Jade Clarity, there are the Phoenix-Born Heavenly Bells, the Floral Treasure Cloud Bells, the Rosy Flame Numinous Bells, the Jade Dragon Floral Bells, the Void Brightness Treasure Bells, the Ninefold Radiance Bells, and the Myriad-Transforming Jade Bells.\n\n\"In the Heaven of Highest Clarity, there are the Ten Floral Treasure Bells, the Four Floral Phoenix Bells, the Lightning Radiance Bright Bells, the Dragon Radiance Bright Bells, and the Simurgh-Soaring Floral Bells.\n\n\"In the Heaven of Supreme Clarity, there are the Ninefold Essence-Composed Bells, the Hundred Treasures Void Brightness Bells, the Cloud-Forming Floral Phoenix Bells, and the Heaven-Flying Dragon Bells.\n\n\"In the Nine Heavens, there are the Self-Sounding Floral Bells, the Nine-Colored Radiance Bells, the Myriad Treasures Floral Bells, and the Great Spontaneous Bells.\n\n\"All these are formed from the spontaneous true essence and wondrous qi, their radiance penetrating and luminous, their divine transformations boundless. They take a thousand forms and ten thousand appearances, responding and changing beyond naming. Some are large, some small, each sounding of itself in accord with the cosmic movement. Their tones are resonant and bright, harmonious and refined, attuned to the numinous.\n\n\"In the Four Brahmā Heavens, there are the Life-Delivering Divine Bells, the Longevity Numinous Bells, the Salvation Divine Bells, the Demon-Dispelling Divine Bells, the Soul-Returning Divine Bells, the Demon-Restraining Divine Bells, the Demon-Subduing Divine Bells, the Evil-Quelling Divine Bells, the Numinous Treasure Waving Bells, the Immortal-Gathering Jade Bells, and the Truth-Returning Harmonious Bells.\n\n\"In the heavens of the Three Realms, there are the Life-Preserving Bells, the Prosperity-Joy Bells, the Self-Sounding Bells, the State-Pacifying Bells, the Fate-Responding Bells, the Treasure-Longevity Bells, the Harmony-Extending Bells, the Longevity-Prolonging Bells, and the Spirit-Guarding Bells. All these are forged from the gold of purple phoenixes and azure dragons, the night-shining rosy treasures, receiving the qi of the Nine Heavens and the fire of the Nine Springs, combined to form them.\n\n\"In the Heaven of Blissful Ease, there are the Lotus Bells, the Soaring Cloud Bells, the Graceful Phoenix Bells, the Intertwining Dragon Bells, the Longevity Bells, the Disaster-Dispelling Bells, the Calamity-Delivering Bells, the State-Protecting Bells, the Life-Stabilizing Bells, the Life-Preserving Bells, the Cultivation-Period Bells, the Weapon-Averting Bells, and the Demon-Dispelling Bells. All these are cast and carved from gold, silver, bronze, iron, jade, and precious stones. There are hundreds of thousands of myriads of each, some sounding at six, nine, or twelve hours. Each is attended by bell-keeping numinous officials, jade lads and maidens, golden essence fierce beasts, lions and apotropaic creatures, vajra spirit-kings, who guard and serve them day and night, striking them to awaken all beings.\n\n\"Thus, the ritual decorum and precepts were transmitted to the Perfected One of Wisdom and Virtue, and proclaimed throughout the Three Realms and ten directions, that all might see and hear.\n\n\"Thereupon, the Perfected One of Wisdom bowed to the Most High and reverently received the ritual decorum.\n\nThe Most High said: \"As for worldly bells, they are made of gold, silver, bronze, or iron, with two, three, four, six, or nine corners, or no corners at all, their size varying as appropriate. They are hung on the left side of terraces, pavilions, towers, or halls. At the proper time, one dons ritual vestments, recites invocations, chants praises, and strikes them. Begin with rapid strikes, then slow and sparse, sounding three times. If eight strikes are used, they follow a rapid rhythm.\"\n\nBegin again with rapid strikes, then slow and sparse, sounding twenty-four times. Once more, strike rapidly, then gradually slow, sounding twelve times in all.\n\nThe Most High said: \"At improper times, one must not strike them wantonly. If one does not don ritual vestments, recite invocations with purity, or maintain proper rhythm, the Five Emperors shall examine such transgressions. The offender shall fall into icy hells after death, and for a hundred kalpas endure the retribution of being born without soles. Be ever vigilant.\"\n\nThe Most High said: \"When a Daoist master passes away, strike the bell three hundred and sixty times to announce their end to all.\"\n\nThe Most High said: \"The chime-stone is made of gold, silver, bronze, iron, or jade. When performing the Dao, reciting scriptures, chanting praises, or observing precepts, strike it in rhythm, always suspending it on a stand.\"\n\nThereupon, the Perfected One of Wisdom and Virtue recited thirteen invocations:\n\n**Dawn**\nSix Brahmā voices answer Heaven’s Gate,\nTen thousand emperors ascend Cloud Palace bright.\nIncense wafts, crimson sun ascends,\nChants flow with the pure wind’s flight.\nDivine perfected scatter jade blossoms,\nSpiritual sounds ripple through the vast sky.\nAll sages gather at the appointed hour,\nFar and near, they hear the bell’s cry.\n\n**Sunrise**\nPurple Tenuity emits celestial light,\nAzure splendor births jade tones.\nMyriad scenes illuminate Cloud Palace,\nImmortals pay homage at the jade peak’s throne.\nResounding echoes stir the endless void,\nLingering notes shake the jeweled grove.\nRejoice in this celestial joy,\nDispelling my long-held gloom.\n\n**Morning**\nParting clouds, I ascend Heaven’s Terrace,\nGaze afar at the Nine Pures’ domain.\nRecalling the soaring clouds’ flight,\nI hear the cavernous void’s refrain.\nWorldly movements are not worth beholding,\nYet the wondrous sound is fit to hear.\nLet jade tones arise,\nDissolving this hidden sorrow’s veneer.\n\n**Mid-Morning**\nJade maidens wield numinous mechanism,\nGolden bells resound in distant skies.\nAwakening the myriad heavens’ beings,\nDelivering the Nine Darks’ lost sighs.\nSuffering souls emerge through clouds,\nSunken spirits ascend on fate’s tide.\nDivine power defies all reckoning,\nDharma sounds pervade the formless wide.\n\n**Noon**\nThe Great Void enfolds the Six Qi,\nThe Supreme Dao unfurls the One Origin.\nBrahmā voices weave earth’s net,\nDharma drums emerge from heaven’s margin.\nWhen realms are empty, the heart is still,\nYet when emotions cling, the will grows loud.\nContemplate these six-hour sounds,\nAnd release the hundred cares that crowd.\n\n**Afternoon**\nCelestial youths turn the wheel of space,\nDivine maidens play the hidden loom.\nDay and night, Heaven’s Gate is traversed,\nCycles follow the stars’ silent gloom.\nPhoenixes sing through twelve hours,\nDragons soar, returning to their home.\nStrike the jade tones’ melody,\nAnd manifest the Heavenly Worthy’s might.\n\n**Late Afternoon**\nFour dragons follow heaven’s course,\nFive Emperors drive the sun’s chariot bright.\nMoon maidens scatter fragrant treasures,\nCloud Palace descends with jade blossoms white.\nTen immortals heed the Dharma bell,\nAll gather at the Most High’s abode.\nThe Five Sufferings find lasting release,\nForever chanting the Cavernous Void’s ode.\n\n**Sunset**\nLoftily, the myriad heavens’ mechanism turns,\nDay and night follow in endless round.\nThe Most High expounds the sacred teachings,\nProclaiming them throughout the world’s bound.\nResponding to realms, True Kings arise,\nOfficials divide their duties with care.\nImmortal youths strike the jade bell,\nAll sages assemble at Heaven’s Gate fair.\n\n**Dusk**\nCrimson radiance reins the morning glow,\nPurple wheels ride the night’s moon.\nThe Two Luminaries alternate,\nThe Four Seasons never cease to croon.\nJade youths announce the appointed hour,\nJeweled bells ring out with resonant sound.\nBowing to the Most High,\nThey ascend the Golden Portal’s ground.\n\n**Nightfall**\nThe yang wheel descends to the hidden chamber,\nYin shadows illuminate the clouded hall.\nPearl terraces resound with jade tones,\nJasper palaces waft with fragrant allure.\nWondrous sounds arise from the cavernous void,\nSubtle echoes contain hidden verses’ store.\nTogether they praise the Void’s melody,\nPure notes soar beyond the wind’s roar.\n\n**Midnight**\nDivine youths open the starry gates,\nHoly mothers mount cloud-borne dragons.\nSun and moon alternate in succession,\nDay and night renew their ancient pacts.\nHeaven and earth blend myriad incenses,\nA thousand perfected descend from on high.\nJade sounds weave the Great Void,\nGolden censers birth purple mist’s sigh.\n\n**Cockcrow**\nFive hundred million celestial realms,\nThree thousand worlds in their vast array.\nEvery region arrays immortal domains,\nEvery place has its spirit bells’ play.\nBrahmā sounds arise in Dharma halls,\nWondrous rhythms stir the numinous breeze.\nCauses and conditions never cease,\nMerit and virtue forever increase.\n\n**Perpetual Bell and Chime-Stone Verse**\nPurify and don celestial robes,\nFocus thoughts on the Terrace of Clouds.\nWhen the hour arrives, strike the bell,\nImmortals and sages step through the void.\nJade tones whisper in the Mystic Capital,\nGolden incense wafts in Purple Tenuity’s glow.\nTen thousand riders soar through clouds,\nNine blossoms fly beyond the empty sky.\nPhoenixes wheel and soar,\nLions charge and roam free.\nJade-hungry maidens array,\nImmortals sit reciting scripture’s decree.\nBowing to the ten directions,\nEmpty thoughts dwell in the Three Pures’ sea.\nThe Heavenly Worthy abides in the void,\nVague and indistinct, originally formless.\nSerene and numinous, naturally responsive,\nEver able to move with sincerity’s force.\nWestern consorts play jade chime-stones,\nIn harmony with the Cavernous Void’s song.\nHell holds no guilty souls,\nHeaven records the virtuous’ names.\nAt one resounding jade bell’s chime,\nAll bow and listen in awe’s thrall.\n\nThe Most High said: \"These verses and gāthās were transmitted by the Primordial Beginning to the heavens at the dawn of the Dragon Han kalpa. Should emperors and kings recite them, their souls shall be purified and at ease, all perfected beings descend to their chambers. When bells are struck and invocations recited, their sounds shall resound in unison, ringing clearly through the ten directions. All sages rejoice, the Nine Darks’ souls are pardoned, men and women chant in praise, lands enjoy peace, and blessings endure forever, unending through the ages.\"\n\nThe Most High said: \"When all assemble, listen for the three bell strikes, then don caps and sashes, and arrange incense. When the long bell ceases, refine and purify your ritual decorum, then join in unison with Brahmā sounds and harmonious elegance. Proceed to your seats, circumambulate, and upon completion, strike the chime-stone in rhythm. Heavenly beings, immortals, sages, and mortals—all gather thereby. Be ever mindful and cautious, lest you incur the Five Emperors’ punishment.\"\n\nThe Most High said: \"In the Mystic Capital stand eight jade-blossom bells, placed upon the terrace of the Central Heaven. Responding to the Six Brahmā qi, cycling through the Twelve Mechanisms, they sound without being struck, their voices ringing through the ten directions. All perfected beings bow, listening to their tones, and gather in the Mystic Capital. The heavens take this as their model.\"\n\nThe Perfected One of Wisdom and Virtue, along with five hundred companions who had come together, all voiced their approval, bowed, and withdrew.\n\nThus concludes *The Cavernous Mystery’s Ritual Decorum of Bells and Chime-Stones*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞玄灵宝钟磬威仪经 经名：洞玄灵宝钟磬威仪经。 一卷。 底本出处：《正统道藏》洞玄部威仪类。 洞玄灵宝钟磬威仪经 尔时，智德真人与五百真人等众，同诣太上，稽首请问集众威仪。 太上曰：众有二种，一者圣众，二者凡众。 若说法斋戒，礼拜下谢，救度生死，一切福会，应当来集，皆听击锺。 昔元始天尊於色界天中，教化说法。 时至不齐，众有前后，放十种相，光从眉间出，彻照诸天，五亿世界、无量国土，普使闻知，示大神力，演真一妙道，合五和之精，成无量宝钟。 各随方域，同发灵音，声遍天地，响若琳琅，皆作洞章，昼夜震动，应十二时。 一切众生，闻悉欢喜，百恼皆除。 时不信者信，未悟者悟，生．诸善慧，兴正念心。 自是之后，钟声制度，普遍十方。 汝今所请，当欲开悟诸众生智德，稽首弟子、后生末学，虽闻钟磬，未解威仪，不审诸天所有，同於下界，亦有等差。 太上告曰：三清上境，三界十方，大小名目，亦有不同。 今粗说之，汝其听焉。 太上告曰：大罗天中，有九明华钟、七曜神钟、洞光浮钟、飞精空钟、大光云钟、开天光钟、自然神钟。 玉清天中，有凤生天钟、华宝云钟、霄焰灵钟、玉龙华钟、空明宝钟、九合光钟、万变瑶钟。 上清天中，有十华宝钟、四华凤钟、电耀明钟、龙耀明钟、鸾翔华钟。 太清天中，有九精合成钟、百宝空明钟、结云华凤钟、天飞龙钟。 九天中，有自鸣华钟、九色光钟、万宝华钟、大自然钟。 皆结自然真精、妙炁而成，光明洞彻，神化无方，千形万象，应变难名。 或大或小，随运自鸣，音声响亮，和雅应神。 四梵天中，有度命神钟、长生灵钟、济生神钟、消魔神钟、反魂神钟、制魔神钟、降魔神钟、伏邪神钟、挥灵宝钟、集仙琼钟、归真和钟。 三界天中，有保生之钟、昌乐之钟、自鸣之钟、安国之钟、应命之钟、宝龄之钟、延和之钟、长寿之钟、护神之钟，皆以紫凤翠龙之金，照夜明霄之宝，承九天之气、九泉之火，合而成之。 宛利天中，有莲花之钟、翔云之钟、宛凤之钟、交龙之钟、遐龄之钟、消灾之钟、度厄之钟、护国之钟、定生之钟、保命之钟、修期之钟、辟兵之钟、消魔之钟，皆以金银铜铁、琼瑶宝玉，镕铸雕刻而成，各有百千万亿，或六时、九时、十二时，悉有典钟灵官、玉童玉女、金精猛兽、狮子辟邪、金刚神王，防守侍卫，昼夜考击，开悟群生。 於是授智德威仪科诫，告下三界十方，令得见闻。 於是，智德礼拜太上，伏受威仪。 太上曰：世间钟，用金银铜铁作，两角、三角、四角、六角、九角、无角，大小随宜，悬治左方台阁楼殿，依时整法服、祝诵赞唱击之。 皆初急之，缓疏打三下。 若八下，为节急之。",
      "translated_text": "*The Scripture on the Ritual Decorum of Bells and Chimes from the Cavernous Mystery and Numinous Treasure*\n\nAt that time, the Perfected One of Wisdom and Virtue, together with five hundred perfected beings, approached the Most High, bowed their heads, and inquired about the ritual decorum for assembling the multitude.\n\nThe Most High said: \"The multitude is of two kinds—one, the sacred assembly, and two, the ordinary assembly. Whenever the Dharma is expounded, precepts observed, obeisances made, or repentance offered, and whenever salvation is extended to the living to deliver them from birth and death, or in all meritorious gatherings where they should convene, the bell shall be struck to summon them.\n\n\"In former times, the Celestial Worthy of Original Beginning, while in the Heaven of Form, taught and transformed through the Dharma. As the time was not uniform and the assembly arrived in succession, he emitted ten kinds of radiance from between his brows, illuminating all the heavens, the five hundred million worlds, and the boundless lands, so that all might hear and know. Manifesting his great divine power, he expounded the wondrous Dao of the True One, harmonizing the essence of the Five Harmonies to form the boundless treasure bells. Each resonated according to its region, emitting numinous sounds in unison, their voices pervading heaven and earth, their tones like jade chimes. All intoned cavernous hymns, shaking day and night in accord with the twelve hours. Every being who heard them rejoiced, their hundred afflictions dispelled. Those who had not believed came to believe; those who had not awakened came to awakening. They gave rise to all manner of good wisdom and aroused the mind of right mindfulness.\n\n\"From that time onward, the system of bell sounds spread throughout the ten directions. Now, what you have asked is how to open and awaken the wisdom and virtue of all beings—how disciples, novices, and later learners, though they may have heard the bells and chimes, do not yet understand their ritual decorum. They are uncertain whether the bells of all the heavens are the same as those of the lower realms, or if there are distinctions among them.\"\n\nThe Most High replied: \"In the Three Clarities’ supreme realms and throughout the Three Realms and ten directions, the names and forms of bells differ. Now I shall roughly explain them; listen well.\"\n\nThe Most High said: \"In the Heaven of Great Pervasiveness, there are the Nine Luminous Floral Bells, the Seven Luminaries Divine Bells, the Cavernous Radiance Floating Bells, the Flying Essence Void Bells, the Great Radiance Cloud Bells, the Heaven-Opening Radiance Bells, and the Spontaneous Divine Bells.\n\n\"In the Heaven of Jade Clarity, there are the Phoenix-Born Heavenly Bells, the Floral Treasure Cloud Bells, the Rosy Flame Numinous Bells, the Jade Dragon Floral Bells, the Void Brightness Treasure Bells, the Ninefold Radiance Bells, and the Myriad-Transforming Jade Bells.\n\n\"In the Heaven of Highest Clarity, there are the Ten Floral Treasure Bells, the Four Floral Phoenix Bells, the Lightning Radiance Bright Bells, the Dragon Radiance Bright Bells, and the Simurgh-Soaring Floral Bells.\n\n\"In the Heaven of Supreme Clarity, there are the Ninefold Essence-Composed Bells, the Hundred Treasures Void Brightness Bells, the Cloud-Forming Floral Phoenix Bells, and the Heaven-Flying Dragon Bells.\n\n\"In the Nine Heavens, there are the Self-Sounding Floral Bells, the Nine-Colored Radiance Bells, the Myriad Treasures Floral Bells, and the Great Spontaneous Bells.\n\n\"All these are formed from the spontaneous true essence and wondrous qi, their radiance penetrating and luminous, their divine transformations boundless. They take a thousand forms and ten thousand appearances, responding and changing beyond naming. Some are large, some small, each sounding of itself in accord with the cosmic movement. Their tones are resonant and bright, harmonious and refined, attuned to the numinous.\n\n\"In the Four Brahmā Heavens, there are the Life-Delivering Divine Bells, the Longevity Numinous Bells, the Salvation Divine Bells, the Demon-Dispelling Divine Bells, the Soul-Returning Divine Bells, the Demon-Restraining Divine Bells, the Demon-Subduing Divine Bells, the Evil-Quelling Divine Bells, the Numinous Treasure Waving Bells, the Immortal-Gathering Jade Bells, and the Truth-Returning Harmonious Bells.\n\n\"In the heavens of the Three Realms, there are the Life-Preserving Bells, the Prosperity-Joy Bells, the Self-Sounding Bells, the State-Pacifying Bells, the Fate-Responding Bells, the Treasure-Longevity Bells, the Harmony-Extending Bells, the Longevity-Prolonging Bells, and the Spirit-Guarding Bells. All these are forged from the gold of purple phoenixes and azure dragons, the night-shining rosy treasures, receiving the qi of the Nine Heavens and the fire of the Nine Springs, combined to form them.\n\n\"In the Heaven of Blissful Ease, there are the Lotus Bells, the Soaring Cloud Bells, the Graceful Phoenix Bells, the Intertwining Dragon Bells, the Longevity Bells, the Disaster-Dispelling Bells, the Calamity-Delivering Bells, the State-Protecting Bells, the Life-Stabilizing Bells, the Life-Preserving Bells, the Cultivation-Period Bells, the Weapon-Averting Bells, and the Demon-Dispelling Bells. All these are cast and carved from gold, silver, bronze, iron, jade, and precious stones. There are hundreds of thousands of myriads of each, some sounding at six, nine, or twelve hours. Each is attended by bell-keeping numinous officials, jade lads and maidens, golden essence fierce beasts, lions and apotropaic creatures, vajra spirit-kings, who guard and serve them day and night, striking them to awaken all beings.\n\n\"Thus, the ritual decorum and precepts were transmitted to the Perfected One of Wisdom and Virtue, and proclaimed throughout the Three Realms and ten directions, that all might see and hear.\n\n\"Thereupon, the Perfected One of Wisdom bowed to the Most High and reverently received the ritual decorum.\n\nThe Most High said: \"As for worldly bells, they are made of gold, silver, bronze, or iron, with two, three, four, six, or nine corners, or no corners at all, their size varying as appropriate. They are hung on the left side of terraces, pavilions, towers, or halls. At the proper time, one dons ritual vestments, recites invocations, chants praises, and strikes them. Begin with rapid strikes, then slow and sparse, sounding three times. If eight strikes are used, they follow a rapid rhythm.\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1041,
      "start_sentence": 0,
      "end_sentence": 31,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.02750015258789,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洞玄灵宝钟磬威仪经.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "复初急之，缓疏击二十四槌。 急之复急之，缓徐击十二槌毕。 太上曰：非时不得妄击。 若不整法服，清净祝诵，失其节度，皆五帝考之，死堕寒冰之中，百劫当生无跟之报。 慎之焉。 太上曰：若道士终亡，击钟三百六十槌，示人知终。 太上曰：磬，以金银铜铁玉作。 若行道礼诵、赞唱斋诫，击以节之，皆当作架悬之。 智德因说祝颂十三章： 平旦 六梵应天关，万帝朝云宫。 飞香霭朱日，流咏顺清风。 神真散瑶华，灵音泛太空。 众圣赴期来，远近听鸣钟。 日出 紫微发天光，青华生琅音。 万景照云宫，众仙礼玉岑。 流响动长空，余声振宝林。 庆此天真乐，散我幽滞心。 辰时 披云登天轩，环目瞩九清。 还想排云逸，俯闻空洞声。 众动非所观，妙音良可听。 发彼琼瑶响，解兹幽蔚情。 禺中 玉女秉灵机，金钟振遐响。 开觉万天人，拔度九幽爽。 苦魂披云出，沉魄乘运上。 神力叵思议，法音被无象。 正中 太虚包六气，至道敷一元。 梵声纶地络，法鼓出天端。 境空心自静，情攀志更喧。 察此六时响，释我百忧烦。 日映 圆童转空轮，神女抚幽机。 昼夜天关尽，循环星杜希。 凤鸣十二时，龙翔百六归。 击以琼华音，畅我天尊威。 哺时 四龙随天运，五帝推日车。 月女散宝香，云宫下瑶华。 十仙聆法钟，俱集太上家。 五苦长解脱，恒吟空洞歌。 日入 高抗万天机，昼夜相循环。 太上敷圣教，普告於世间。 应境立真王，分职有司官。 仙童击玉钟，众圣朝天关。 黄昏 朱景控朝晖，紫轮乘夜月。 二曜递推迁，四序无停歇。 玉童唱时至，宝钟铿然发。 稽首无上尊，携驾登金阙。 人定 阳轮下幽室，阴景照云房。 珠台铿瑶音，碧殿蔼琼香。 妙声发空洞，微响含幽章。 共美虚中曲，清音风外扬。 中夜 灵童启星扉，圣母御云龙。 日月相代谢，昼夜更故新。 天下万合香，空降千品真。 玉音罗太虚，金炉生紫烟。 鸡鸣 五亿诸天境，三千世界中。 方方列仙域，处处有神钟。 梵音生法宇，妙韵起灵风。 因缘常不绝，功德永无穷。 常鸣钟磬偈 盥洁披天衣，端念陆云台。 时至当鸣钟，仙圣步虚来。 琼音微玄都，金香蔼紫微。 万骑云间逸，九华空外飞。 凤凰翩翻翔，狮子纵横驰。 王女罗瑶饥，仙人坐诵经。 稽首礼十方，虚想在三清。 天尊住虚空，惚怳本无形。 湛然自灵一应，常能感精诚。 西妃抚瑶磬，齐和空洞声。 地狱无罪魂，天堂奏善名。 一振琅钟响，万众稽首听。 太上曰：此颂偈，龙汉劫初，元始传诸天。 帝王诵之者，魂神清畅，众真降房，鸣钟祝之，与响齐闻，朗彻十方，万圣欢乐，九幽赦魂，男女歌咏，国土安宁，永享福祚，世世无穷。 太上曰：众集时，听三下钟，冠带整香。 长钟竟，严净威仪，复与梵音齐发庠雅。 诣座旋绕竟，已叩磬节之，人天圣凡，皆以之集。 当审慎焉，勿罹五帝之罚也。 太上曰：玄都有八琼华钟，置中天之台，应六梵气，周十二机，不击自鸣，声彻十方。 众真稽首，听声而会玄都，诸天取则矣。 智德真人及同来五百众，一时称善，稽首而退。 洞玄灵宝钟磬威仪经竟",
      "translated_text": "Begin again with rapid strikes, then slow and sparse, sounding twenty-four times. Once more, strike rapidly, then gradually slow, sounding twelve times in all.\n\nThe Most High said: \"At improper times, one must not strike them wantonly. If one does not don ritual vestments, recite invocations with purity, or maintain proper rhythm, the Five Emperors shall examine such transgressions. The offender shall fall into icy hells after death, and for a hundred kalpas endure the retribution of being born without soles. Be ever vigilant.\"\n\nThe Most High said: \"When a Daoist master passes away, strike the bell three hundred and sixty times to announce their end to all.\"\n\nThe Most High said: \"The chime-stone is made of gold, silver, bronze, iron, or jade. When performing the Dao, reciting scriptures, chanting praises, or observing precepts, strike it in rhythm, always suspending it on a stand.\"\n\nThereupon, the Perfected One of Wisdom and Virtue recited thirteen invocations:\n\n**Dawn**\nSix Brahmā voices answer Heaven’s Gate,\nTen thousand emperors ascend Cloud Palace bright.\nIncense wafts, crimson sun ascends,\nChants flow with the pure wind’s flight.\nDivine perfected scatter jade blossoms,\nSpiritual sounds ripple through the vast sky.\nAll sages gather at the appointed hour,\nFar and near, they hear the bell’s cry.\n\n**Sunrise**\nPurple Tenuity emits celestial light,\nAzure splendor births jade tones.\nMyriad scenes illuminate Cloud Palace,\nImmortals pay homage at the jade peak’s throne.\nResounding echoes stir the endless void,\nLingering notes shake the jeweled grove.\nRejoice in this celestial joy,\nDispelling my long-held gloom.\n\n**Morning**\nParting clouds, I ascend Heaven’s Terrace,\nGaze afar at the Nine Pures’ domain.\nRecalling the soaring clouds’ flight,\nI hear the cavernous void’s refrain.\nWorldly movements are not worth beholding,\nYet the wondrous sound is fit to hear.\nLet jade tones arise,\nDissolving this hidden sorrow’s veneer.\n\n**Mid-Morning**\nJade maidens wield numinous mechanism,\nGolden bells resound in distant skies.\nAwakening the myriad heavens’ beings,\nDelivering the Nine Darks’ lost sighs.\nSuffering souls emerge through clouds,\nSunken spirits ascend on fate’s tide.\nDivine power defies all reckoning,\nDharma sounds pervade the formless wide.\n\n**Noon**\nThe Great Void enfolds the Six Qi,\nThe Supreme Dao unfurls the One Origin.\nBrahmā voices weave earth’s net,\nDharma drums emerge from heaven’s margin.\nWhen realms are empty, the heart is still,\nYet when emotions cling, the will grows loud.\nContemplate these six-hour sounds,\nAnd release the hundred cares that crowd.\n\n**Afternoon**\nCelestial youths turn the wheel of space,\nDivine maidens play the hidden loom.\nDay and night, Heaven’s Gate is traversed,\nCycles follow the stars’ silent gloom.\nPhoenixes sing through twelve hours,\nDragons soar, returning to their home.\nStrike the jade tones’ melody,\nAnd manifest the Heavenly Worthy’s might.\n\n**Late Afternoon**\nFour dragons follow heaven’s course,\nFive Emperors drive the sun’s chariot bright.\nMoon maidens scatter fragrant treasures,\nCloud Palace descends with jade blossoms white.\nTen immortals heed the Dharma bell,\nAll gather at the Most High’s abode.\nThe Five Sufferings find lasting release,\nForever chanting the Cavernous Void’s ode.\n\n**Sunset**\nLoftily, the myriad heavens’ mechanism turns,\nDay and night follow in endless round.\nThe Most High expounds the sacred teachings,\nProclaiming them throughout the world’s bound.\nResponding to realms, True Kings arise,\nOfficials divide their duties with care.\nImmortal youths strike the jade bell,\nAll sages assemble at Heaven’s Gate fair.\n\n**Dusk**\nCrimson radiance reins the morning glow,\nPurple wheels ride the night’s moon.\nThe Two Luminaries alternate,\nThe Four Seasons never cease to croon.\nJade youths announce the appointed hour,\nJeweled bells ring out with resonant sound.\nBowing to the Most High,\nThey ascend the Golden Portal’s ground.\n\n**Nightfall**\nThe yang wheel descends to the hidden chamber,\nYin shadows illuminate the clouded hall.\nPearl terraces resound with jade tones,\nJasper palaces waft with fragrant allure.\nWondrous sounds arise from the cavernous void,\nSubtle echoes contain hidden verses’ store.\nTogether they praise the Void’s melody,\nPure notes soar beyond the wind’s roar.\n\n**Midnight**\nDivine youths open the starry gates,\nHoly mothers mount cloud-borne dragons.\nSun and moon alternate in succession,\nDay and night renew their ancient pacts.\nHeaven and earth blend myriad incenses,\nA thousand perfected descend from on high.\nJade sounds weave the Great Void,\nGolden censers birth purple mist’s sigh.\n\n**Cockcrow**\nFive hundred million celestial realms,\nThree thousand worlds in their vast array.\nEvery region arrays immortal domains,\nEvery place has its spirit bells’ play.\nBrahmā sounds arise in Dharma halls,\nWondrous rhythms stir the numinous breeze.\nCauses and conditions never cease,\nMerit and virtue forever increase.\n\n**Perpetual Bell and Chime-Stone Verse**\nPurify and don celestial robes,\nFocus thoughts on the Terrace of Clouds.\nWhen the hour arrives, strike the bell,\nImmortals and sages step through the void.\nJade tones whisper in the Mystic Capital,\nGolden incense wafts in Purple Tenuity’s glow.\nTen thousand riders soar through clouds,\nNine blossoms fly beyond the empty sky.\nPhoenixes wheel and soar,\nLions charge and roam free.\nJade-hungry maidens array,\nImmortals sit reciting scripture’s decree.\nBowing to the ten directions,\nEmpty thoughts dwell in the Three Pures’ sea.\nThe Heavenly Worthy abides in the void,\nVague and indistinct, originally formless.\nSerene and numinous, naturally responsive,\nEver able to move with sincerity’s force.\nWestern consorts play jade chime-stones,\nIn harmony with the Cavernous Void’s song.\nHell holds no guilty souls,\nHeaven records the virtuous’ names.\nAt one resounding jade bell’s chime,\nAll bow and listen in awe’s thrall.\n\nThe Most High said: \"These verses and gāthās were transmitted by the Primordial Beginning to the heavens at the dawn of the Dragon Han kalpa. Should emperors and kings recite them, their souls shall be purified and at ease, all perfected beings descend to their chambers. When bells are struck and invocations recited, their sounds shall resound in unison, ringing clearly through the ten directions. All sages rejoice, the Nine Darks’ souls are pardoned, men and women chant in praise, lands enjoy peace, and blessings endure forever, unending through the ages.\"\n\nThe Most High said: \"When all assemble, listen for the three bell strikes, then don caps and sashes, and arrange incense. When the long bell ceases, refine and purify your ritual decorum, then join in unison with Brahmā sounds and harmonious elegance. Proceed to your seats, circumambulate, and upon completion, strike the chime-stone in rhythm. Heavenly beings, immortals, sages, and mortals—all gather thereby. Be ever mindful and cautious, lest you incur the Five Emperors’ punishment.\"\n\nThe Most High said: \"In the Mystic Capital stand eight jade-blossom bells, placed upon the terrace of the Central Heaven. Responding to the Six Brahmā qi, cycling through the Twelve Mechanisms, they sound without being struck, their voices ringing through the ten directions. All perfected beings bow, listening to their tones, and gather in the Mystic Capital. The heavens take this as their model.\"\n\nThe Perfected One of Wisdom and Virtue, along with five hundred companions who had come together, all voiced their approval, bowed, and withdrew.\n\nThus concludes *The Cavernous Mystery’s Ritual Decorum of Bells and Chime-Stones*.",
      "overlap_context": "orum.\n\nThe Most High said: \"As for worldly bells, they are made of gold, silver, bronze, or iron, with two, three, four, six, or nine corners, or no corners at all, their size varying as appropriate. They are hung on the left side of terraces, pavilions, towers, or halls. At the proper time, one dons ritual vestments, recites invocations, chants praises, and strikes them. Begin with rapid strikes, then slow and sparse, sounding three times. If eight strikes are used, they follow a rapid rhythm.\"",
      "start_char": 1041,
      "end_char": 2282,
      "start_sentence": 32,
      "end_sentence": 123,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.72614145278931,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洞玄灵宝钟磬威仪经.txt",
        "category": "威仪类"
      }
    }
  ]
}