{
  "source_id": "洞真上清神州七转七变舞天经",
  "source_file": "chunked_daozang\\洞真上清神州七转七变舞天经.json",
  "total_chunks": 9,
  "total_original_chars": 11036,
  "total_translated_chars": 73028,
  "total_translation_time": 369.4913749694824,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\洞真上清神州七转七变舞天经.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Wondrous Scripture of the Seven Cycles and Seven Transformations of the Divine Continent in the Supreme Clarity, Dancing Heaven Sutra**\n\n**Scripture Title:** *The Wondrous Scripture of the Seven Cycles and Seven Transformations of the Divine Continent in the Supreme Clarity, Dancing Heaven Sutra*. Author unknown, approximately dated to the Eastern Jin dynasty. A foundational scripture of the early Supreme Clarity tradition. One scroll. Base text from *The Orthodox Daoist Canon*, First Section.\n\n---\n\n**The Supreme Scripture of the Purple Dawn Lord of the Highest Emperor, from *The Wondrous Scripture of the Seven Cycles and Seven Transformations of the Divine Continent in the Supreme Clarity, Dancing Heaven Sutra***\n\nThe Divine Continent lies north of the Celestial Pass, with the sun and moon revolving to its south. The Seven Stars turn as a wheel at its center, circling left through the Eight Latitudes by day and right through the Seven Constellations by night. As the Seven Stars complete their revolution, the celestial radiance returns in its numinous splendor.\n\nThis is the realm where the Purple Dawn of the Highest Emperor receives transformation, cultivating the method of the Seven Cycles to ascend to the Jade Clarity.\n\nThe Purple Dawn Lord of the Highest Emperor is the descendant of the Twin Radiance, embodying the essence of the Kingly Dawn. Born of the Dragon Mist in the Great Void, he enfolds the Purple Emptiness within the Permeating Numinous. Entrusted to the Nine Mysteries to contain his brilliance, he congeals the Vast Dew to form his spirit, refines the Three Qi to bathe himself, and traverses the Mysterious Mother to be born through the Dao. Enduring kalpas of transformation, he responds to the Auspicious Day to cleanse his form.\n\nIn the first year of the Highest Emperor, on the celestial stem *jia* at dawn, he was born in the Heaven of Eight Effulgences of the Divine Continent, by the shores of the Abyssal Cavern in the central plains of the Level Mound. His taboo name is *Po*, and his style is *Hufeng*. At the moment of his birth, his face shone with golden countenance, his body radiated jade light, and his five-colored purple markings underwent seventy-two transformations. His spirit illumined his jade visage, as the divine dragon spat forth mushrooms to nourish him, and the simurgh and phoenix danced their wings to adorn the Mysterious. The cinnabar auroras scattered their splendor upon the jasper pavilion, and flowing light blazed brilliantly in the distant Realms of Truth. The Twin Effulgences paused their radiance in the Eight Clarities, and the Seven Primes revolved their essence to assist the dawn. The golden immortals dispersed incense to mingle with the qi, and the divine consorts cast flowers to kindle the mist. The Five Latitudes wove their patterns, and the divine splendor suffused the purple heavens.\n\nAt the age of eighteen, he roamed freely in the Middle Prime, consuming essence and swallowing qi, exhaling and inhaling the numinous fluids. He ingested mushrooms for inner irrigation, congealed his spirit into the Embryo Immortal, drew in and rinsed with silence, and dwelled in natural detachment. His thoughts were subtle, his mindfulness of qi unceasing, and through accumulated resonance with the Cavernous Prime, his name transcended the Supreme Clarity. He received the title of Primordial Emperor, ascended to the position of Purple Dawn, and the orchid phoenix responded with auspicious omens. Following the flow of destiny, his spirit embraced the Five Luminaries, and his form coiled with the Seven Primes. Soaring through the auroras, he rode the void’s misty webs, as the host of immortals opened the path. The Three Ways merged in luminosity, and streaming lightning issued forth his might. His swift chariot traversed the Nine Mysteries, ascending the jade steps twice and paying homage thrice at the Purple Court. He wandered the jasper towers, feasted in the Three Primes, and forged bonds with the Five Elders. As an honored guest in the Jade Auroras, flying beasts rampaged and divine phoenixes soothed with their cries. The great yoke and reins were held by the numinous winds, which scattered incense and wafted fragrance in billowing waves, suffusing the Jade Clarity.\n\nThe Divine King of the Sun Valley, overseer of the jade offices of immortals, presented the *Primordial Chart of the Nine Mysteries* in azure essence and emerald numen, along with the *Luminous Chapter of the Nine Transformations and the Solar Effulgence*, to refine the true and transform the form, roaming the Cavernous Upper Palace. To the west, in the Dark Feathered Primal Wilderness by the shores of the Western Ridge’s misty expanse, within the Purple Tenuity’s Jade Hall, the Queen Mother requested the *Pristine Chapter of the Radiant Numen* and the *Primordial Register of Mount Tortoise* to determine the true and establish the royal standard, bestowing the title of Purple Emperor. To the south, he journeyed to the Great Cinnabar of the Vermilion Mound, the land of extreme flame and flowing fire, to the Nine-Tiered Jade Terrace of the Sun Palace. The Supreme Prime Lord of the Southern Culmen presented the *Great Cinnabar Cavernous Prime Fire Bell and the Seven Luminaries’ Jasper Chapter*, along with the *Golden True Jade Radiance*, to summon the Twin Effulgences’ jade essence and refine the sevenfold transformations of his countenance. To the north, he traveled to the frigid lands of the Nine Mysteries in the Dark Yin. The Nine Primes True Consort of the Jade Dawn of the Great Yin received the *Flying Effulgence Treasure Chapter of Flowing Essence*, the desolate *Nine Luminaries*, and the *Seven Primes of the Vast Fall*, to part the Celestial Pass and ascend to the Jade Capital for audience. He mounted the towering terrace of the Primordial Heaven’s Effulgent Jade Capital, with its nine winding chambers.\n\nThe Great True Elder and the Most High Lord of the Great Dao received the *Orthodox Dharma of the Three Heavens* to govern the Six Heavens, and the *Flying Essence Chapter of the Nine Seams*, donning the *Seal of the Flowing Gold Phoenix*. Thus, he ascended to the position of the Purple Dawn Lord of the Highest Emperor.\n\nThereupon, his numinous radiance shone forth, his golden countenance beamed, and his body was clad in the dharma robes. Upon his head rested the *Seven-Colored Crown of the Purple Script and Flying Frost*. His attendants—ten billion immortals and maidens—along with flying dragons and venomous beasts, guarded his jasper chariot. The night naturally brightened with divine candles, and the chamber dispersed the misty fragrance of the Void. The winds stirred the dark banners, and the dance swirled in profusion. His whistling resounded through the Great Vacuity, and the jade tones rang out in harmony. The empty chant soared as a flying song, and the eight echoes responded in unison. The simurghs cried and phoenixes played, their pure melodies attuning to the Mysterious Peace. The dark essence revolved in reflection, and the Three Dawns paused their canopies. The myriad immortals offered obeisance and celebration, all submitting in reverence. He governed the palace of the Divine Continent’s numen, the boundless and desolate halls, regulating the revolutions of the Three and Five, rescuing and transforming the difficulties of the Tang succession. He ordered the Two Modes within the Mysterious Chart and oversaw the legacy of the Highest Emperor. In tranquil recitation within the jasper pavilion, he gazed downward into the profound and played with the obscure, while the lush Three Passes unfolded their hidden verses. He commanded the singing of the Mysterious Hymn, the resounding of the Luminous Model, and the praise of the Resonant Response. The empty tones galloped freely, and the Cavernous Wisdom shone brilliantly. He spurred the Eight Winds to hasten his form, seized the streaming lightning to exalt his essence, summoned the Six Jia within the Five Phases, and employed the martial legions of the Celestial Soldiers. He dispatched talismans to the Five Peaks to await his chariot and issued proclamations of might to rouse the numinous. He transformed the heavens above the Divine Continent and revolved the Seven Cycles within the Wondrous Court. He summoned the Void and Emptiness to bathe himself and ingested jade talismans to ascend in form. He wove the celestial patterns of the sun and moon and revolved the Seven Qi within the Dipper Stars.\n\nThereupon, he drifted through the Nine Realms, his noble sons sharing his chariot, the Directors of Destiny aligning their wheels. He roamed and feasted in the Purple Dawn, encompassing the Cavernous Abyss and commanding the host of immortals. From the heavens downward, none failed to serve the Highest Emperor, for the Dao of the Seven Transformations was wondrous indeed.\n\n---\n\n**The Supreme Scripture of the Seven Cycles**\n\nThe Dao of the Seven Cycles and Seven Transformations was received by the Purple Dawn Lord of the Highest Emperor from the Nine Heavenly Parents. Upon perfecting his cultivation, he transmitted it to the Highest Emperor Lord of the Pure Heaven. The Highest Emperor Lord transmitted it to the Jade Lads of the Three Heavens, who passed it to the True Primordial Lord of the Purple Culmen. The True Primordial Lord of the Purple Culmen transmitted it to the Heavenly Emperor Lord, who passed it to the Supreme Prime Lord of the Southern Culmen. The Supreme Prime Lord of the Southern Culmen transmitted it to the Heavenly Emperor Lord of the Grand Tenuity, who passed it to the Later Sage Lord of the Golden Portal. The Later Sage Lord of the Golden Portal transmitted it to the Azure Lad of the Prime Minister, forming an unbroken lineage of true transmission. Through the wisdom of kalpas, each transmission was recorded in a minor register by the King of Calculations and the Queen of the Later Sage. One copy was sealed within the mountains of the Western Region. Those who obtain it are all received as sagely lords in the Supreme Clarity Palace, granted twenty-one Jade Lads and twenty-one Jade Maidens to attend the numinous scriptures and protect the bearers of this scripture.\n\nThe Way of the Seven Cycles of the Supreme Prime Lord is inscribed on crimson tablets and written in purple script, concealed within the Jade Chamber of the Golden House of the Primordial Terrace of the Purple Heaven. It is conferred only upon perfected transcendents, never taught to beginners. Those who receive the *Thirty-Nine Chapters of the Cavernous Perfection*, the *Jade Tablet of the Feminine One*, or the *Wondrous Scripture of the Great Existence*—though they may dissolve stagnation and deliver the Seven Mysteries—yet remain ignorant of the Seven Cycles and thus cannot be said to chant the Jade Chapters.\n\nThe verses of the Seven Cycles are the melodies of the Divine Continent, the celestial tones of the Most High. They circulate through heaven and earth, interweaving with the Three Mornings. Turning left and revolving right, they converge at the Cavernous Gate, transmuting the Five into the Two to align with the Seven Origins, and cycling the Three into the Five to traverse the Celestial Pass. Their Way is profoundly subtle, and thus they are called the [ ] Heaven.\n\nTo chant them once is to achieve unbroken clarity; seven cycles and eight recitations harmonize the Three Luminaries as one reality. The Five Elders fix the registers, the Lords of Destiny revise the records, knots of past karma are untied, and the roots of rebirth severed. Nine generations of ancestors ascend, and the adept is reborn as a womb-transcendent. A thousand autumns are mastered, ten thousand demons bound in submission. After ten thousand recitations, one ascends to the Purple Morn.\n\nIn practicing the Way of the Seven Cycles, one must first recite the chapter of the Most High Great Dao Lord, then the chapter of the Three Origins Purple Essence Lord, followed by the chapter of the True Yang Primordial Elder Mysterious One Lord, then the chapter of the Azure Spirit Yang Peace Lord, next the chapter of the August Clarity Cavernous Perfection Lord, then the chapter of the Nine Heavens Supreme Perfection, and finally the chapter of the Primordial Most High Jade Sovereign. These seven cycles conclude with the Primordial Most High.\n\nNext, recite the chapter of the Supreme Prime Dao, then the chapter of the August Thearch Lord, followed by the chapter of the Great Yang Lord, then the chapter of the Most High Great Simplicity Lord, next the chapter of the Central Yellow Elder Lord, then the chapter of the Non-Dual Middle Perfected Supreme Elder Lord, and finally the chapter of the August Primordial Purple Vacuity Lord. Returning to recite the chapter of the Most High Great Dao Lord, these eight latitudinal cycles conclude at the Jade Capital Mountain governed by the Most High.\n\nRecite again as before, beginning from the fifth chapter, and repeat seven times to complete the practice. Thus, one’s voice ascends to the Jade Sovereign, and the myriad perfected ones bow in reverent harmony. Below, the ten thousand realms are summoned, and the true form is bound and refined. After a hundred days of diligent cultivation, bathing to cleanse dust and grime, seated upon the numinous mat, recite the Seven Cycles ten thousand times. When the Dao is perfected, one ascends to heaven in broad daylight.\n\nThe Most High Jade Chapters are to be reverently practiced in secret. Beware of revealing them to the unworthy, for leaking the numinous verses brings annihilation upon oneself and condemns one’s descendants to the Seven Mysteries.\n\nWhen practicing the Way of the Seven Cycles, on the first and fifteenth days of each month, as well as during the eight solar terms, observe purification rites. At noon, enter the chamber, face east, and recite the Seven Cycles eight times. At midnight, face north and recite them seven more times. In a single day and night, complete fifteen cycles. This aligns above with the Celestial Pass, circulating the Three Luminaries; centers and harmonizes the body, unblocking the passages and stabilizing the spirit; and below, subdues the myriad demons, pacifying the thousand spirits. The cycles interweave and harmonize, uniting the Five in radiant clarity. Those who neglect this Way descend into darkness after death, but through earnest cultivation and苦念, one ascends in a flying chariot to the Purple Morn, roaming and feasting in the Jade Clarity.\n\nThe Way of the Seven Cycles and Seven Transformations of the Divine Continent’s [ ] Heaven commands the service of twenty-one Jade Lads and twenty-one Jade Maidens. They traverse the Five Marchmounts, their dark-veined jade tokens in hand, riding azure radiance dragons, bearing tiger talismans of spirit, wearing lotus crowns, clad in purple embroidered feathered robes and cinnabar-green flying skirts. They ring golden bells and jade chimes, unfurl purple canopies and flowered banners, and wield nine vermilion-striped talismans to seal mountains and summon clouds, ascending to the Golden Hall of the Purple Culmen.\n\nIf one has not yet transformed into a radiant ascendant, practicing this Way while still in the mortal realm, the Nine Heavens’ Parents—the Supreme Prime Purple Morn—will bestow upon the adept the vestments of flying transcendents and feathered scriptures, though these remain concealed from the clamor of the dusty world. When cultivating this Way, one should constantly visualize oneself adorned in these sacred garments, riding dragons and driving clouds. After seven years, the true spirit will manifest, and one will ascend to the Purple Morn.\n\n**First Chapter: The Way of the Primordial Most High Jade Sovereign**\nThe Jade Chapter of the Divine Continent states:\nPrimordial and profoundly mysterious,\nThe ancestral qi refines its essence.\nDivine winds stir the heavens,\nPacifying the Four Clarities.\nThe supreme radiance gathers the immortals,\nThe Imperial One governs in yellow tranquility.\nThe Six Luminaries unfold their splendor,\nAscending Brahma to quell the march.\nMerging the myriad transformations,\nJade orchids bloom in glory.\nThe Great Perfected shines in concealment,\nFlowers return to the Southern Court.\nDelivering from seven sufferings,\nLost souls are transformed and reborn.\nIn the halls of the Bright Beam,\nWhite turns to azure.\nEver swallowing and exhaling mist,\nLush and verdant in the Purple Clarity.\nForests of solar essences align,\nA hundred harmonies resound as one.\nJade chants echo through the Cavernous Brightness,\nBlessings crown the formless.\nSeven cycles and eight latitudinal paths,\nAscend into the Sovereign’s numinous presence.\n\n**Second Chapter: The Way of the Nine Heavens Supreme Perfection**\nThe Jade Chapter of the Divine Continent states:\nMysterious and empty, the qi of the Nine Clarities,\nThree Simplicities ascend in radiant splendor.\nProfound echoes open the numinous gates,\nSeven portals unfurl feathered scriptures.\nVast and open, the Crimson Empyrean is beheld,\nThe secluded and boundless manifest their glory.\nSix senses awaken to the mysterious assembly,\nSubtly perching in harmony with the Great Void.\nThe Yang Terrace spans the Cavernous Wilds,\nThe reclusive flourish with the glow of sacred mushrooms.\nAbandoning burdens, obscuring the void,\nSevering ties, one naturally communes with the unseen.\nIn the high assembly at the Cavernous Morn’s gates,\nHeads raised, they pay homage to the Jade Sovereign.\nDivine reflections resonate with the Wood Spirit’s sound,\nEmpty drums echo with luminous bells.\nNine reins guide the cloud chariot,\nWandering freely upon the Purple Mist Peak.\nCinnabar mounds open the Azure Chamber,\nGreen courts unfold the Five Houses.\nGolden gates gleam in majestic splendor,\nMists ascend to the Supreme Clarity Palace.\nThe Great Unity’s talisman and register\nPreserve me alongside the Right Non-Dual.\nSeven generations escape suffering,\nSouthern immortals regain their forms.\nRoaming the dark chambers of the Great Thearch,\nFloating freely to the ten directions.\n\n**Third Chapter: The Way of the Supreme Prime Jade Vacuity Lord**\nThe Jade Chapter of the Divine Continent states:\nJade Vacuity shapes the mysterious craft,\nIn lofty assembly, one communes with the unseen.\nObscurely ascending the Nine Origins,\nBrightly the Sovereign’s radiance is born.\nThe Three Luminaries’ brilliance never ceases,\nThe Perfected shine, and clouds vanish.\nLifting and escorting the jade guests to feast,\nTheir chariots contract and ride the mist.\nThe Yellow Register commands the jade talisman,\nThe Noble Scion carries me aloft.\n\n**Fourth Chapter: The Way of the Supreme Jade Thearch**\n\nThe Jade Chapter of the Divine Continent states:\nDissolving the seven mysterious ancestors,\nThe law transforms beyond the shadow of Non-Being.\nSeven transformations return to spontaneity,\nThe Thearch’s Unity harmonizes with the mysterious resonance.\n\nJade portals enfold jade orchids,\nAbove the profound, pure gates unfold.\nSeven awakenings pierce the dark dawn,\nThe radiant spirit descends with the returning wind.\nBanners gleam across the Great Void,\nResplendent, the golden numinous brilliance shines.\nSupporting the dawn, they unfurl the net of luminaries,\nFirmly expanding the Cavern of Purple Tenuity.\nThe Cinnabar Thearch whistles and commands the pearl,\nThe Red Child guards the mysterious precincts.\nSeven ancestors unbind their womb-roots,\nReturning to the womb, all ascend as immortals.\nReversing the Five to restore the Two,\nThree cycles follow the turning of destiny.\nJoining the Three Mornings, they weave the mysterious record,\nThe myriad perfected all converge in unity.\nLifting and escorting the guests of the Empyrean,\nTheir luminous robes gleam beneath the jade canopy.\nTaking the reins, they mount cloud-chariots,\nFeasting to the utmost in the Jade Thearch’s hall.\n\n---\n\n**Fifth Chapter: The Way of the Supreme Great Dao Lord**\n\nThe Jade Chapter of the Divine Continent states:\nRadiance transforms the Nine Mysterious Passes,\nJade dawn revolves with purple essence.\nInwardly illumining the absolute abode,\nRiding the void, they ascend to the Four Luminaries.\nThe Dharma-wheel completes its three cycles,\nSeven changes return to the Non-Dual.\nThe Great Unity inspects celestial demons,\nReversing the chapters to examine the thousand spirits.\nWhistling to the left, they penetrate the profound subtleties,\nRebuking to the right, the Nine Heavens incline.\nTheir covenant extends across the Eight Wastes,\nTheir sweeping gaze commands the divine soldiers.\nThey rescue the seven ancestral tribulations,\nTranscending to join the immortal sovereigns.\nThe Registrar of Destinies preserves the primordial register,\nThe Eastern Palace inscribes their jade names.\nReversing the light into the Mud-Pill Palace,\nThe five viscera flourish with radiant splendor.\nIlluminating their forms, they bear the round pearl,\nSecuring the hun-soul to preserve kalpic ages.\nAscending to feast in the Nine Empyrean’s halls,\nSerenely they ascend to Jade Purity.\n\n---\n\n**Sixth Chapter: The Way of the Three Primordials’ Purple Essence Lord**\n\nThe Jade Chapter of the Divine Continent states:\nThe Three Primordials clarify the numinous transformation,\nPurple Purity pervades the Void of Non-Being.\nThe Earl of the Center initiates the divine lineage,\nThe Golden Gate seeks the profound in mutual pursuit.\nThe Three Simplicities revolve within the Thearch’s chamber,\nDrifting and playing in the Jade Continent.\nCinnabar brilliance reflects the empty heavens,\nThe golden chamber shines upon the orchid’s unfolding.\nBearing the light, they secure the dark passes,\nAscending the Brahma-realm, they tread the cloud-body.\nFive clouds [obscure] the night sun,\nTheir splendor ascends the capital’s thoroughfares.\nThe Great Unity’s talisman and register\nDissolve the seven mysterious sorrows.\nReturning to infancy and the immortal dwellings,\nSuddenly the divine illumination begins anew.\nTransforming the Five to restore the Two,\nThe celestial signs complete one revolution.\nSeven changes follow the turning of qi,\nThe Noble Scion receives the numinous talisman.\nWondrously blowing the Nine Mornings’ gale,\nThey transcend to the immortal lords’ abode.\n\n---\n\n**Seventh Chapter: The Way of the True Yang’s Primordial Unity Lord**\n\nThe Jade Chapter of the Divine Continent states:\nThe Primordial Unity, Thearch and Venerable,\nNurtures the tranquil True Yang,\nFive blossoms bind the qi,\nThe divine splendor flourishes within.\nThe Registrar of Destinies fixes the record,\nThe Great Unity assists and upholds.\nAnnihilating demons, cleansing defilement,\nExterminating and severing misfortune,\nSwiftly reporting to the Northern Thearch,\nInspecting the demonic realms.\nThose who transgress are executed,\nLest they spread and rise.\nThe divine perfected set forth on their journey,\nThe Ten Heavens’ administrators welcome them.\nTo the right, they grasp White Prime,\nTo the left, they lead the Non-Dual.\nRiding cloud-chariots in swift flight,\nThey ascend to Jade Purity.\nTossing the flowing bells in exchange,\nThe vast expanse unfolds and opens.\nGolden immortals bear the banners,\nWestern Florescence scatters incense.\nFive-colored feathered standards,\nCinnabar and azure, jade frost.\nFlowing gold and jeweled canopies,\nAscending immortal phoenix sigils.\nAbove, they sport in the Cavern of Azure,\nRoaming and feasting beneath the mysterious beam.\n\n---\n\n**Eighth Chapter: The Way of the Azure Numinous Yang Peace Lord**\n\nThe Jade Chapter of the Divine Continent states:\nThree blossoms illuminate the Cinnabar Palace,\nThe Azure Numinous fans the Eight Qi.\nThe revolving wheel ascends the Upper Prime’s gate,\nThe Five Ways align with the jade ranks.\nOn the day of ascending Brahma’s gate,\nThey tread the flourishing, uniting with the divine covenant.\nTwo perfected grasp the talismanic mandate,\nDelivering the Five Suffering Realms.\nBlending the transformation of the Thearch’s Unity’s radiance,\nThe returning wind pervades wondrous wisdom.\nThey fly in steps into the Northern Prime,\nSeven mornings revolve as the body departs.\nAbove, they grasp the Nine Heavens’ passes,\nThe jade path first dispels the mists.\nUniting the talismans in the Cinnabar Empyrean,\nDrifting and soaring at the clouds’ edge.\n\n---\n\n**Ninth Chapter: The Way of the Sovereign Purity Cavern-Real Lord**\n\nThe Jade Chapter of the Divine Continent states:\nThe Cavern-Real blends the mysterious transformation,\nSovereign Purity enacts the Three Numinous.\nRainbow light reflects the Nine Heavens’ steps,\nEmbracing the true, radiant splendor flourishes.\nThe flaming blade gleams in the golden chamber,\nCinnabar brilliance illumines the Great Obscurity.\nThe Five Elders govern the registers of destiny,\nThe Jade Administrators command the divine encampments.\nReturning to assemble above the Net of Separation,\nThe Eight Harmonies encompass Yellow Tranquility.\nUnbinding the knots, severing the womb-roots,\nSeven ancestors receive renewed glory.\nThe Great Unity delivers the Five Registers,\nDecay and fall reverse to the fetal infant.\nFilling and guarding the Mud-Pill Palace,\nThe five viscera flourish with cinnabar’s fullness.\nEight revolutions gaze upon the Sun Gate,\nRiding the void, they ascend the Purple Court.\n\n---\n\n**Tenth Chapter: The Way of the Sovereign Prime’s Purple Prime Lord**\n\nThe Jade Chapter of the Divine Continent states:\nPurple Prime illumines the Nine Empyreans,\nSovereign Prime shines in the radiant chamber.\nThree and Five unite with the Divine Continent,\nSeparation and union revolve with the vermilion sun.\nDesolate above the Golden Gate,\nThe distant Yin gathers the Primordial Seven.\nDelivering from the Five Sufferings’ [realm],\nTranscending to join White Prime’s ranks.\nOpening the Cavern, they part the vermilion mound’s gate,\nRoaming freely into the mysterious threshold.\nGoverning transformation, following the wind’s qi,\nBlending and uniting with the Thearch’s Unity.\nEmbracing the moon, they hold the Young King,\nPassing me, the root of death is extinguished.\nFive talismans preserve long life,\nForever parting from Mount Feng’s underworld.\nSeven ancestors together attain felicity,\nVast mushrooms and orchids overflow.\nThe returning wind transforms the seven cycles,\nThe golden chapters pervade the Cavern-Numinous chamber.\n\n---\n\n**Eleventh Chapter: The Way of the Non-Dual’s Central Perfected Supreme Elder Lord**\n\nThe Jade Chapter of the Divine Continent states:\nThe Non-Dual descends in cloud-like grace,\nBinding splendor in the Jade Yang chamber.\nSerene, the Primordial Simplicity’s qi,\nThe round pearl reflects the Purple Palace.\nIn lofty assembly above the Profound Profound,\nThey lift me to the Nine Heavens’ King.\nClad in the radiance of the Golden Flower Gate,\nThe Five Thearchs command the emptiness in unison.\nDelivering the multitudes through the Five Talismanic Registers,\nThe precious hun-soul shines across the Nine Layers.\nPeach and prosperity secure the lower passes,\nQi communicates with the Mud-Pill Palace.\nThe numinous transformation blends and unites the true,\nThe Three Thearchs share the mysterious palace.\nFather pacifies, mother extends essence,\nEnabling me to become an immortal lord.\nSeven ancestors escape the dark bonds,\nIn the Southern Pavilion, their forms are restored.\nRoaming beyond the Cavern-Wilds,\nGazing upon the kalpic blade’s midst.\n\n---\n\n**Twelfth Chapter: The Way of the Central Yellow Elder Lord**\n\nThe Jade Chapter of the Divine Continent states:\nThe round blossom illumines the Great Brilliance,\nThe Yellow Elder governs the Central True.\nChanting the Jade Thearch’s chapters,\nThe wondrous resonance stirs the Cavern-Neighbors.\nThe red radiance flees into the distant desolation,\nThe Great Unity augments the kalpic years.\nDelivered by talismans, they ascend the Purple Chamber,\nSeven ancestors escape suffering’s culmination.\nDrifting above the Profound Blossom,\nThe numinous wind scatters purple mist.\nBlending the Three and Five’s qi,\nRevolving and uniting to complete my body.\n\n**Thirteenth Chapter: The Way of the Highest Lord of Grand Simplicity**\n\nThe Jade Chapter of the Divine Continent states:\nThe Highest ascends in a stern dragon-chariot,\nFeasting in the Purple Empyrean’s halls.\nGrand Simplicity illumines the dark radiance,\nThe Five Elders assist with numinous praise.\nHarmonizing the tally of life’s register,\nIn the primal darkness, all is already decreed.\nDelivering across the Three Beams’ bridges,\nTranscending far from suffering’s bonds.\nGazing upward to pluck the fruits of the Kāśa-grove,\nAbsorbing their blossoms to augment my years.\nThe Thearch of Unity guards the Upper Pass,\nThe Grand Expansion dissolves the womb’s dispersal.\nBlending to transform into the womb-immortal,\nThe precious soul shines in the dark stems.\nJoyous and harmonious, the Six Palaces flourish,\nThe Dark Mother weaves the dawn’s beginning.\nSeven ancestors depart the dark palace,\nDrifting and playing in the dark Han.\n\n**Fourteenth Chapter: The Way of the Lord of Grand Yang**\n\nThe Jade Chapter of the Divine Continent states:\nThe jade treasure illumines the cloud-canopy,\nThe subtle mystery accords with the Three Mornings.\nGrand Yang transforms the primordial radiance,\nBlending and revolving to evolve the womb-immortal.\nOpening the Yin to conjoin the Grand Desert,\nCongealing essence to secure the soul and spirit.\nThe golden talisman gleams with the jade tally,\nUnbinding the roots of seven ancestors.\nThe Grand Unity chants the Cavern-Chapters,\nThe numinous resonance pierces the Southern Pavilion.\nThe youths embrace the pure brightness,\nGirded with the sun, they ride the cloud-wheel.\nMounting the whirlwind, they reflect the empty canopy,\nReaching upward to pluck the blossoms of the Kāśa.\nThe Registrar of Destinies inscribes their immortal register,\nReceiving their titles before the Jade Thearch.\n\nThe Jade Chapter of the Divine Continent is the hymn of the Fourteen Thearchs’ Cavern-Wilds, the inner names of the hundred spirits, the dark image of the Jade Heaven, the essence of the Three Mornings. Reciting its chapters, the jade resonance stirs the Upper Primordial Void, so that the Nine Heavens’ Perfected Kings and the ten thousand immortals all attend in the divine court, bowing their heads to the sacred sound.\n\nThus, when reciting the *True Scripture of the Great Cavern*, one must first practice the Way of the Seven Revolutions. This chapter interlinks the Ten Heavens, revolves and halts the Three Mornings, ten thousand demons prostrate and flee, a thousand demons lose their forms. Reciting it ten thousand times, one ascends to heaven in broad daylight.\n\nOn the third, seventh, ninth, fourteenth, seventeenth, twenty-first, and twenty-seventh days of the month, take *Angelica dahurica*, *Ailanthus* wood, and peach bark—three substances, each seven parts—boil them in seven *dou* of water, and at the hour of *zi*, facing north, wash your head. Before washing, knock the teeth nine times and softly invoke:\n\n*\"Five rivers, vast pools,\nCurving waters, cinnabar blossoms,\nWash away filth and dust,\nFragrant and flowing,\nSpirit and form refined,\nJade nectar and mushroom mud.\"*\n\nWhen the washing is complete, recite this secret incantation:\n\n*\"Divine Perfected transform their radiance,\nReshaping countenance and refining form,\nBody containing jade marrow,\nStomach storing blossoming life.\"*\n\nThis is the Way of the Nine Baths for transformation and refinement. Practicing it makes the body fragrant and the spirit communicative, uniting with the Perfected in numinosity. Without knowing this method, the divine luminaries will not descend, and recitation will not penetrate. Let the scholar cultivate it.\n\n**The Scripture of the Divine Continent’s Seven Transformations for Dancing in Heaven**\n\n**First Transformation: Qi**\nFirst, transform the body into cloud, summon wind and transcend qi, exhale flames to become mist, with five auroras crowning the head to transform the omen-body. Through accumulated resonance, the Dao descends, ascending to Grand Mystery.\n\nOn the days of *ren* and *gui*, at midnight during the hour of *zi*, burn incense in a quiet chamber, sit evenly facing north, calm the mind, close the eyes, and visualize qi. See mist and dew swirling, crowning and covering the body until all is settled. Utter three long whistles, sensing wind and qi entering the chamber. Then, with the left breath, exhale nine times, visualizing qi leaving the mouth and transforming into blue mist. Nine times, summon the Eastern Blue Aurora, whose name is *Fēi Xū*, to guard the left. Turn to the right, exhale seven breaths, visualizing qi leaving the mouth and transforming into white mist. Seven times, summon the Western White Aurora, whose name is *Sù Lú*, to guard the right. Glance left and right, exhale three breaths, visualizing qi leaving the mouth and transforming into red mist. Three times, summon the Southern Red Aurora, whose name is *Dān Yìng*, to stand before you. Exhale five breaths straight ahead, visualizing qi leaving the mouth and transforming into black mist. Five times, summon the Northern Black Aurora, whose name is *Xuán Xiàng*, to guard behind. Exhale twelve breaths upward, visualizing qi leaving the mouth and transforming into yellow mist. Twelve times, summon the Central Yellow Aurora, whose name is *Zǒng Shēng*, to guard the form.\n\nWhen all is complete, knock the teeth twelve times and invoke upward:\n\n*\"Summon wind to command heaven,\nExhale qi to become mist,\nMist and dew swirling,\nSpreading across the Ten Heavens,\nFive auroras entwining,\nCrowning my body,\nTransforming with the form,\nNo delay in appearance,\nResponding to the call,\nAscending to the Thearch’s morning.\"*\n\nAfterward, ingest the *Flying Mystery Life Talisman of Aurora Essence and Jade Radiance*, lie down with the head to the north, stretch the four limbs upward, close the eyes, and visualize the body transforming into a five-colored cloud. The cloud-qi swirls, merging with qi to ascend lightly, drifting and rising into the void, dispersing to fill the heavens, circling without bounds, then returning from the emptiness. Rub the palms until warm, wipe the face twenty-seven times, then from the top down to the feet three times. Shake the head seven times, face north, and softly invoke:\n\n*\"Five colors transform the radiance,\nBecoming flying clouds,\nMerging with the body’s qi,\nTogether ascending the Cavern-Gate,\nRiding the auroras to entwine the morning,\nAscending to meet the Three Primordials.\"*\n\nAfterward, swallow qi seven times and stop.\n\nPracticing this for seven years without daily lapse, cloud-qi will descend in resonance, responding to qi and gathering in echo. The body transforms and the form changes, merging with qi as mist, riding clouds to fly, ascending to the Thearch’s morning. This is the most wondrous Way, the Jade Scroll of the Highest Thearch. Secretly uphold and cultivate it; be cautious not to show it to others. Heaven’s statutes warn: transmit only with utmost care.\n\n**Second Transformation: Light**\nTransform the body into light, illuminating the chamber’s interior, shining brilliantly across the Eight Wastes, riding the dark to ascend into the Grand Void.\n\nPractice this Way on the new moon, the third, ninth, fifteenth, and twenty-fifth days of the month, at noon. Enter the chamber, burn incense on both sides, settle the spirit and stabilize qi, close the eyes and meditate. Visualize the essence-light of the sun’s center, five-colored flowing auroras blazing in the east. Within the light, there is also purple qi, large as the eye’s pupil, shining brilliantly amid the five lights, flowing and dazzling across the heavens.\n\nThen silently invoke the inner name of the Sun-Soul: \"Sun-Soul Pearl Radiance Shining Green Reflected Rosy Clouds Crimson Youth Dark Flame Whirlwind Image.\" These sixteen characters in full. Once done, visualize the sunlight descending upon your form, entering your left eye’s pupil. After a moment, purple qi envelops your crown inside and out.\n\nNext, visualize the essence-light of the moon’s center, five-colored flowing essences shining brilliantly in the west. Within the moonlight, there is also yellow qi, large as the eye’s pupil, glowing amid the lunar radiance, flowing and dazzling across the heavens. Then silently invoke the inner name of the Moon-Spirit: \"Moon-Spirit Warm Mist Fragrant Bloom Veiled Vast Graceful Void Numinous Orchid Luxuriant Blossom Jade Purity Gleaming Gen Upright Terrace Mark.\" These twenty-four characters in full. Once done, visualize the moonlight descending upon your form, entering your right eye’s pupil. After a moment, yellow qi envelops your crown inside and out. The twin luminaries of sun and moon merge, intertwining and coiling around your body.\n\nThen click your teeth twenty-four times and recite the incantation: \"Sun and Moon’s mysterious light, round heaven’s paired essence, nine yangs transform as one, twin vapors arise together. Dark auroras flow and shine, pouring into my form. Transform radiance into light, blending with qi. Sitting or standing, vanish—twin perfected ones unite in spirit. Mounting the three steeds, soar and float, ascending to the Jade Court.\"\n\nOnce done, ingest the Yin-Yang Jade Radiance Opening Brightness Numinous Talisman. Then lie down facing east, stretching your limbs upward, close your eyes, and visualize within the sun the Youthful Yang Lord, seven inches tall, wearing a flying celestial crown and a crimson silk robe, surnamed Xi, named Zhao Ling. Within the moon, visualize the Maiden of Moonlight, the Lesser Yin Woman, three inches and five parts tall, her head adorned with a seven-tiered \"Advancing Worth\" treasure crown, wearing a white silk flying skirt, surnamed Xuan, named E Jing. The twin perfected ones descend into your body, governing the pupils of your two eyes.\n\nVisualize your own body transforming into the five-colored light of sun and moon, flowing and blazing brilliantly. Feel your body become weightlessly buoyant, suddenly treading the void, ascending with the light. Your entire body envelops in warmth, as if dwelling within the sun and moon, journeying through the four directions, traversing the heavens, then returning. Then rub your palms until warm, wipe your face twenty-one times, stroke from top to bottom three times, rise and shake your head seven times.\n\nOnce done, look up and recite the incantation: \"Twin radiance flows and shines, light illuminating the five forms. Inside and out, thoroughly permeated, transformation arises instantly. Ascending with qi, uniting essence with light, the round blossom unfurls, bearing the luminous one’s spirit. Dark perfection spreads and scatters, carrying me into the unseen.\"\n\nOnce done, swallow qi twenty-four times and stop. Practicing this for eighteen years, your eyes will emit lightning-like radiance, and your head will perpetually bear the essence of sun and moon. Transforming and altering your radiance, you will equal the twin luminaries, riding the void and commanding the sky, ascending to the Jade Court.\n\nThis wondrous transformation Way must be secretly upheld and practiced; do not reveal it. If divulged, calamity will extend to the Seven Mysteries, and your body will sink into the dark springs—you will never attain immortality.\n\n**Third Transformation: Fire**\nFirst, cause your body to transform into the essence of fire, its radiant light flowing with flames, refining and tempering your form inside and out. From fire, rebirth arises. Your body undergoes the Three Refining Trials, enabling ascent to the Grand Clarity. Only through diligent focus can you summon the true numen.\n\nPractice this Way on the days of *jia-wu*, *bing-wu*, *wu-wu*, *geng-wu*, *yi-mao*, *ding-mao*, *ji-mao*, and *xin-mao*. Enter the chamber, burn incense, face south, and close your eyes in meditation. Visualize above your head a qi of blue smoke, thickly crowning your head. Then visualize within your left eye the Blazing Yang Lord of Firelight, seven inches tall, surnamed Zhu, named Chi Jing, his head adorned with a three-beamed \"Rosy Dawn\" treasure crown, wearing a crimson silk robe. In his left hand, he holds the Sun Essence; in his right, the Talisman of Transforming Radiance and Pervading Light. Within your right eye, visualize the Crimson Jade Radiant Numinous Perfected Jade Maiden, five inches tall, surnamed Nan, named E Yan, her head adorned with a three-cornered \"Flying Cloud\" topknot, wearing a crimson silk garment. In her left hand, she holds the Moon Pearl; in her right, the Jade Talisman of Seven Transformations Refining Essence.\n\nThe two emerge from your eyes and ascend into the blue smoke, their mysterious light shining and illuminating your crown. Click your teeth three times and recite the incantation:\n\nThe two Fire Essence spirits transform and generate flowing flames, refining the body and altering its radiance. They ride the blue smoke and soar, merging with the primordial qi, penetrating deeply into the Fire Realm. The Peach Lord bestows the talismans, and the register of life endures forever.\n\nWhen finished, ingest the two talismans: the Talisman of Transforming Radiance and Pervading Light, and the Jade Talisman of Seven Transformations Refining Essence. After ingestion, loosen your clothing and belt, let down your hair, lie with your head to the south, stretch your four limbs upward, close your eyes, and draw in the qi of the blue smoke through your nose, swallowing it twenty-one times. Then exhale red qi forty-five times. As you exhale, visualize the qi forming a fire essence that crowns your body, and see yourself within the fire until your body feels thoroughly warm, with a slight sweat being ideal.\n\nThen rise, face south, and call three times to the spirit of your left eye, Chi Jing, and three times to the spirit of your right eye, E Yan. The two spirits together refine and deliver my body with the great flaming smoke.\n\nNext, rub your palms until warm and wipe your eyes forty-five times, then stroke your face down to your feet seven times.\n\nWhen finished, look up and recite the incantation:\nTransform and refine the five spirits, solidify bones and generate life. Mysterious light flows with flames, swiftly flying Fire Essence. Three cycles and seven turns, my Dao becomes luminous. Subtle contemplation and profound visualization reveal and inspect the hidden numinous. Scatter light to the ends of heaven, brightly illuminating the Purple Court.\n\nWhen finished, swallow the qi three times and stop.\n\nThis is the method of fire refinement and bodily transformation. If one constantly contemplates and earnestly recites it, practicing for seven years, flowing lightning-like light will emerge from the eyes. Inscribing talismans upon the five centers, one may enter fire without burning, exhale qi to form smoke, and in winter enter water without feeling cold. One may command the Six Jia, revolve the Celestial Pass, ride clouds and ascend through the void, and ascend to the dawn in broad daylight.\n\nThe fourth transformation involves floating and sinking with qi, refining the body into water, with the Nine Rivers as companions. Drawing in qi forms waves, exhaling qi forms currents. One may command and summon dragons, employ the Water Lords, and roam the depths of ten-thousand-fathom abysses. If you can practice this, you may ascend to the heavens without ceasing.\n\nWhenever cultivating this method, choose the first, third, ninth, eighteenth, and twenty-seventh days of the lunar month—five days in total—when the Nine Rivers Emperor of Grand Yin is feasting in the Bright Valley of Yang and playing with Mysterious Essence during the gathering.\n\nOn those days, at midnight, enter your chamber, burn incense, face north, and close your eyes in meditation. Visualize the Nine Rivers Emperor, surnamed Xiao, named Feng Ming, wearing a \"Roaming Heaven Jade Essence\" crown, clad in a five-colored embroidered robe. In his left hand, he holds a golden bell; in his right, a jade pendant. He governs the Upper Palace of Clear Water in the Bright Valley of Fusang, seated upon a golden bed and jade couch within five-colored curtains, the interior and exterior radiant with light. Twenty-four jade maidens attend him, and the paths of the sun and moon weave through his court.\n\nFocus your thoughts clearly. After a moment, visualize the Nine Rivers Emperor holding the Precious Talisman of the Nine Sources of the Life River, entering your body and residing in the Cinnabar Field Palace below your navel.\n\nVisualize the Azure Dragon of the East, circulating the green waves of the Eastern Limit; the White Dragon of the West, circulating the pure and clear sources of the Western Sea; the Crimson Dragon of the South, circulating the ten-thousand-fathom crimson surges of the Southern Sea; the Black Dragon of the North, circulating the dark yin extreme currents of the Northern Sea; and the Yellow Dragon of the Center, circulating the yellow qi, yang essence, and mysterious infusion of the Five-Colored Jade Mushroom waters. Together, they come to refine and irrigate your body.\n\nWhen you feel a slight chill, call three times to the Nine Rivers Emperor Feng Ming, asking him to govern long within your Cinnabar Field and command the dragons to circulate water and refine your body.\n\nThen ingest the Precious Talisman of the Nine Sources of the Life River, click your teeth twelve times, and recite the incantation while looking up:\nFive Divine Dragons, draw from the four seas. Five Mushroom Grand Springs refine my form. My form transformed, I walk the water’s source, sink into the dark waves of the boundless depths. The Nine Rivers open the path, dragons lead the way. Twelve River Earls all guard my body, preventing specters from falsely opposing my true self.\n\nWhen finished, turn your head to the north, lie straight on your back, close your eyes in meditation, and visualize your body riding the five-colored dragons into the Western Sea. Wade through the waters and walk the rivers as if on a road, riding swift waves without difficulty. Roam beneath the deep waters, freely circling, always keeping the Emperor before your eyes.\n\nWhen the journey is complete and you return, rise and draw in the nine qi of the nine directions of the East, the nine qi of the South, the nine qi of the West, the nine qi of the North, and the nine qi of the Center, swallowing them all. Rub your palms until warm, wipe your face eighteen times, then recite while looking up:\nThree Rivers and Four Seas govern the Nine Rivers. Long waves stretch ten thousand miles, deep abysses without end. Divine perfected ones roam, controlling and riding the five dragons. River Earls and Water Emperors build bridges for me. Whales and leviathans clear the path, specters perish. Jade maidens of the Clear River support and escort me.\n\nWhen finished, swallow the five qi and stop.\n\nThis is the method of water refinement and bodily transformation. Practicing for five years, one may draw on the ground to form rivers, spit to create abysses, enter the sea floor, whistle to command dragons, ride waves and currents at will, employ water officials, and have River Earls attend and welcome. Riding clouds to ascend, one may mount the great void.\n\nThe fifth transformation involves transforming the body into a dragon, riding and commanding the Five Stars, refining and altering one’s form, ascending on clouds to feast in the radiant light, and mounting the Mysterious Palace.\n\nTo cultivate this method, enter your chamber at noon, face south, and close your eyes in meditation. Visualize Jupiter to your left, Venus to your right, Mars before you, Mercury behind you, and Saturn above your head, the Five Stars coiling around your body.\n\nAfter a moment, Jupiter transforms into blue qi, Venus into white qi, Mars into red qi, Mercury into black qi, and Saturn into yellow qi. The five qi surge and transform into five-colored clouds, crowning and covering the chamber.\n\nPerceiving myself seated amidst the cloud-qi, I draw in blue qi with eighteen breaths from the left, white qi with twelve breaths from the right, red qi with sixteen breaths from the front, black qi with ten breaths from behind, and yellow qi with twelve breaths from above. Feeling my body suffused with warmth, I click my teeth thirty-two times and call out, facing upward:\n\n\"Eastern Jupiter Star Sovereign, whose taboo name is Zheng Lan and style is Qing Ning;\nSouthern Mars Star Sovereign, whose taboo name is Bao Rong and style is Fei Yun;\nWestern Venus Star Sovereign, whose taboo name is Wei Ting and style is San Rong;\nNorthern Mercury Star Sovereign, whose taboo name is Hua Ping and style is Xuan Luo;\nCentral Saturn Star Sovereign, whose taboo name is Liao Ling and style is Zhen Xun.\nFive Star Perfected Sovereigns, together you ride the five-colored cloud-palanquin of the Mysterious Chariot, descending into my body, streaming your essence to infuse me, nourishing my dragon-saliva, feasting in Great Harmony. My embryonic breathing arises naturally, my dragon-spirit stirs my transformed body, and I ascend in radiance to the Mysterious Palace.\"\n\nWhen finished, I ingest the talisman for dragon-embryo essence-preservation, then lie down with my head to the east, stretching my four limbs upward. Closing my eyes, I visualize the five-colored clouds shading me above, imagining my body transforming into a green dragon, slowly rising with the clouds, roaming the Five Peaks, ascending to the Three Clarities. In but a moment, I return to my bed. Concluding, I swiftly rub my palms until warm, wiping my face twenty-one times, shaking my body twenty-one times, and recite the incantation:\n\n\"Five spirits return and transform, radiant ascent in flight,\nRoaming the Five Peaks, ascending to the Supreme Microcosm,\nCircling heaven and earth, attaining the Dao and returning,\nEternally preserving the natural, undiminished for ten thousand kalpas.\"\n\nWhen finished, I swallow qi twenty-one times and stop. Practicing thus for five years without missing a day, the divine dragon will descend and appear, granting all desires, transforming into a dragon-body. This is the supreme method of transformation, the Purple Dawn’s Wondrous Perfection—secretly revered and practiced, one ascends at dawn.\n\nThe sixth transformation involves the Dao of moving from existence into non-existence, the method of dissolving form, vanishing, and flowing with radiance. On each day of the six *wu* cyclical signs, enter your chamber facing south, close your eyes in meditation, and visualize your left eye as a shooting star and your right eye as swift lightning, their luminous essence blazing, streaming with dazzling brilliance in the dark. Visualize within the light a perfected person, nine inches tall, wearing a Heaven-Piercing Radiant Jade Crown, clad in a five-colored, flowing yellow cloud-garment. His surname is Duan, taboo name Liu Lan, holding in his left hand the Spirit-Tiger Whip Script and in his right the Talisman of Seven Dissolutions for Form-Transformation—this is the Lad of Non-Florescence.\n\nBorn within the streaming light, he bestows the Mysterious Talisman upon my body. I then click my teeth thirty-six times and invoke:\n\n\"Streaming light swiftly shifts, blazing with celestial might,\nFive forms dissolve and transform, seven radiant scenes take flight,\nExiting existence, entering non-existence, ascending to the Purple Tenuity,\nAttaining union with the Three Dawns, eternally preserving luminous splendor.\"\n\nWhen finished, I ingest the Talisman of Seven Dissolutions for Form-Transformation to release root-bound stagnation. Then, lying with my head to the south and eyes closed, I visualize my body within the streaming light, moving swiftly with its flow. Feeling my body light and buoyant, as if ascending and flying, in but a moment the light of the shooting star and swift lightning enters my body, its brilliance resplendent, my body suffused with warmth. I visualize the perfected person returning to my Crimson Palace and call thrice:\n\n\"Lad of Non-Florescence, Duan Liu Lan, dissolve my form and vanish me,\nFollowing the light’s flow and radiance, my form changes with the qi, my bones scatter with the light.\"\n\nThen, rubbing my hands, I wipe my eyes and face thirty-six times and invoke, facing upward:\n\n\"Transforming form, dispersing qi, dividing shadow into light,\nLight races ten thousand leagues, form and shadow both concealed,\nTwo qi ride one another, streaming through the eight wilds,\nAttaining the Mysterious Chariot, ascending to the Imperial Hall.\"\n\nWhen finished, I swallow qi thirty-six times and stop. This is the Dao of dissolution and transformation, practiced by the Thearch-Lord. Having attained the Perfected Thearch, it is a treasure beyond ten thousand gold—guard it well and do not transmit it lightly. Cultivating this for seven years, one’s body transforms into seventy-two lights, streaming with purple essence, illuminating within and without, capable of myriad transformations without limit—able to conceal, able to manifest, able to see, able to hide. Attaining this method, one ascends as a Perfected Sovereign.\n\nThe seventh transformation is the utmost essence: the body unbound, empty and cavernous, entwined with the Seven Stars, summoning wind and descending clouds; whistling and commanding the host of spirits, exhaling and inhaling the Mysterious Mushroom, refining form and altering appearance, exchanging withered for radiant hue, regenerating decayed teeth, containing the Perfected within and emitting it, reverting to infancy after ten thousand years, revolving through the Seven Transformations of the Divine Continent—only then does one ascend to the Jade Clarity. If one seeks this, meditate deeply in seclusion, accumulating resonance until the spirit descends and the Dao manifests of itself.\n\nTo cultivate this transformation, perform it thrice monthly on the seventh, fourteenth, and twenty-first days—these are the days of the seven transformations, the times of the Purple Dawn’s seven refinements. On each of these days at noon and midnight, enter your chamber and first recite the Chapter of Seven Revolutions. When finished, face north and visualize the hidden taboo names of the Nine Perfected Sovereigns and Inner Consorts of the Northern Dipper:\n\nFirst Star Sovereign, who transforms and conceals the primordial, Inner Consort: named Tai Yi Fa Tan, styled Qian Zheng;\nSecond Star Sovereign, who preserves the embryo and transforms form, Inner Concubine: named Tai Yi San Peng, styled Luo Zhu Ying;\nThird Star Sovereign, Mistress of the Six Vanishings and Seven Stars, Upper Prime Elixir Mother: named Tai Yi Yun Yi, styled Shuang Zhao;\nFourth Star Sovereign, who conceals radiance and hides light, Middle Prime Inner Consort: named Tai Yi Qi Lie, styled Qiu Shan Ying;\nFifth Star Sovereign, who transforms body and alters radiance, Great Maiden of the Dipper’s Center: named Tai Yi Yu Shu, styled Qiu Lan;\nSixth Star Sovereign, who conceals traces and disperses images, Middle Maiden of the Dipper’s Center: named Tai Yi Qi Jing, styled Bao Ding Ling;\nSeventh Star Sovereign, who divides radiance into myriad forms, Maiden of the Dipper’s Center: named Tai Yi Yu Mo, styled Tian Fan Shu;\nEighth Sovereign, who transforms sun, moon, water, and fire, High Thearch’s Left Consort of the Dipper’s Center: named Tai Yi Qi Zhu, styled Luo Mao Hua;\n\nNinth Sovereign, who transforms metals, stones, mountains, and rivers, High Thearch’s Right Consort of the Dipper’s Center: named Tai Yi Ai Tiao, styled Yun Jing Xuan.\n\nThe nine consorts’ inner radiance blazes resplendent, shining brilliantly upon the northern quarter. Then they invoke, saying:\n“Mysterious Dipper Divine Thearch, nine perfected inner consorts,\nStreaming essence descends to pour, refining and irrigating my body.\nTransforming form through seven cycles, ascending to the Dipper’s stars,\nRefining the embryo and transmuting essence, inwardly manifesting as Golden Immortals.”\n\nWhen finished, ingest the Seven Primes’ Radiant Jade Talisman. Lie with head to the north, close the eyes, and visualize one’s body ascending into the Dipper’s central canopy, revolving with the Dipper’s motion and traversing the four directions. Envision the Three Terraces Perfected within the Dipper, their forms two inches and four fen in height, surnamed Hui Yuan, named Hui Ling, wearing vermilion caps and crimson robes, bestowing the Seven Primes’ Radiant Jade Talisman. Upon awakening, having ingested the talisman, one naturally ascends in flight, returning to the bed. Rise facing north, knock the teeth seven times, and thrice call upon the Dipper’s Perfected Hui Ling. Then raise the head and invoke, saying:\n“Tai Yi’s nine maidens, scattering forms upon the Mysterious Vault,\nDivine radiance revolves and shines, numinous winds emit blossoms.\nLeft hand grasps the Seven Essences, right hand steers the flying auroras,\nFlowing bells undergo nine transformations, ten evolutions and seven songs.\nDividing form into thousands, spitting upon the earth to form rivers—\nWhatever is wished or sought, let there be no hardship.\nThe numinous scripture cycles sevenfold, its might subduing heavenly demons.\nThose who comply and revere shall become immortals; those who oppose the Dao shall perish.”\n\nWhen finished, swallow qi thirty-four times and stop.\n\nThis is the Way of the Seven Cycles of the Divine Continent, the method of myriad transformations of radiance, the jade formula for refining form and transmuting into immortals. Practicing it for nine years, the nine consorts feast upon radiance, together ascending into flight. The body emits wondrous light, the face reflects a golden countenance, the Seven Stars entwine the body, and one rides the clouds to ascend at dawn.\n\nThe Seven Cycles of Transformation are the Way of the Supreme Thearch of Purple Dawn, who first studied the jade-perfected refining and transforming Dao. The Nine Heavens’ Father and Mother bestowed upon him the scripture of the Seven Cycles of Radiance Transformation, untying knots and releasing obstructions, dispersing the Seven Mysteries, enabling the refinement of form and alteration of body to ascend to the Jade Palace. Through profound cultivation and accumulated resonance with the Primordial Heaven, he attained the rank of Supreme Thearch and received the title Purple Dawn. This Way is lofty and wondrous; it must not be recklessly transmitted. To carelessly divulge this treasure text brings calamity upon one’s ancestors and oneself, subjecting them to ten sufferings and eight poisons, with no deliverance for ten thousand kalpas. Those of destined bone who obtain this divine scripture, keeping it secret and practicing it, shall attain perfection in due time.\n\n**First: Cloud Essence Jade Radiance Flying Mystery Life Talisman**\nPerform the ritual by writing in vermilion on blue paper and ingesting it; write in vermilion on blue silk and wear it. The essence of the Five Auroras enables knowledge of the Upper Clarity’s Golden Flower of the Five Auroras. Practicing it for seven years, one shares the radiance of the luminous net.\n\n**Second: Yin-Yang Jade Radiance Opening Brilliance Numinous Talisman**\nPerform the ritual by writing in vermilion on blue paper and ingesting it; write in vermilion on blue silk and wear it. This is the essence of the sun and moon’s two radiant forms, enabling knowledge of the two radiant forms’ essence, concealing radiance and hiding form. Practicing it for eighteen years, one ascends to the Purple Court.\n\n**Third: Radiance-Transforming Illuminating Spirit Seven Cycles Refining Essence Jade Talisman**\nPerform the ritual by writing in blue on white paper and ingesting it; write in blue on white silk and wear it. This is the essence of the Great Yang, enabling knowledge of its transformations, refining the body and altering form, radiance and qi penetrating emptiness, equal to fire in brilliance. Practicing it for seven years, one ascends to the Imperial Court.\n\n**Fourth: Life River Nine Sources Treasure Chapter Talisman**\nPerform the ritual by writing in ink on white paper and ingesting it; write in ink on white silk and wear it. This is the qi of the Vast Waves’ Jade Essence, enabling knowledge of the Nine Rivers’ inner names, transforming and dividing form, ascending to roam the Nine Sources, descending to sink into the water spirits. Practicing it for five years, ten thousand transformations are immediately accomplished.\n\n**Fifth: Dragon Embryo Preserving Essence Talisman**\nPerform the ritual by writing in yellow on white paper and ingesting it; write in yellow on white silk and wear it. This is the qi of the Nine Transformations of Dragon Essence, enabling knowledge of the Dragon Embryo, transforming radiance and ascending cliffs, ascending to roam the Nine Mysteries, descending to sport at the Nine Doubts. Practicing it for five years, one remains undiminished through kalpas.\n\n**Sixth: Dissolving Form Seven Cycles Talisman**\nPerform the ritual by writing in blue on yellow paper and ingesting it; write in blue on yellow silk and wear it. This is the essence of the primordial coagulation of thunder and lightning. This Way is supremely wondrous, dividing shadows and dispersing form, streaming light into ten thousand transformations, merging with the Perfected in darkness.\n\n**Seventh: Seven Primes Radiant Jade Talisman**\nPerform the ritual by writing in vermilion on blue paper and ingesting it; write in vermilion on blue silk and wear it. This is the essence of the Seven Stars, enabling transformations, concealment, and ascension to the Jade Court of Radiance.\n\nThe above seven transformation talismans were bestowed upon the Supreme Thearch of Purple Dawn by the Nine Heavens’ Father and Mother, comprising the Way of transforming radiance and refining form, a secret of the Great Perfected and a treasure of the Nine Heavens. Through their cultivation, the Purple Dawn Lord attained the exalted title of Imperial Thearch. This Way is revered and wondrous, the origin of all scriptures. When the seven cycles are complete, one’s celestial perfected nature becomes equal to the heavens. Without a body of golden bones and jade constitution, one may not partake in or hear of it. Only those whose mystical name is Dong Hua and whose green character is Shang Qing may behold this wondrous text and secretly practice it. In accordance with the Great Perfected’s regulations, one may receive three transmissions in seven thousand years; if a suitable person appears within seven hundred years, transmission may also be granted. The recipient must offer one catty of true pearls, thirty-two feet of green damask, and five taels of superior gold as a pledge to the Nine Heavens’ vow of secrecy. Coveting wealth and admiring the Dharma incurs the same sin as greed; lightly valuing treasures and receiving scriptures sincerely moves the Jade Thearch. Cinnabar is used to express resonance, and trust is used to clarify the heart. Without a sincere heart, why engage in superficial admiration? Such learning is like sinking into a ten-thousand-fathom abyss while hoping to climb the path of clouds—how distant it is! Lightly valuing wealth and revering the Dao, though the Dao may be secluded and silent, dark scrutiny will reveal it, leading to the steps of ascending the heights and attaining the Perfected through proper means. This text is now compiled and transmitted to those destined for immortality; it is not bestowed upon the mediocre. To carelessly divulge this treasure text and expose it to the Upper Perfected brings retribution upon one’s seven generations of ancestors and parents, who are consigned to the offices of ghostly officials, made to transport the stones of Mount Meng to fill the River of Night. For ten thousand kalpas, they are reborn outside the human realm, their bodies subjected to the tortures of wind and blades. The scripture is naturally lost, and immortality is utterly unattainable.\n\nLet the recipient guard it in secrecy and reverence. All the three hundred scrolls of the Supreme Clarity’s precious scriptures, the nine thousand chapters of jade instructions, and the seven thousand sections of talismanic diagrams originate from the Most High Jade Emperor of the Primordial Beginning, who received the natural writ and the Dao of remote antiquity. Should a practitioner obtain even the titles of these texts, they shall ascend at once to the rank of Perfected Sovereign. The Dao is concealed in the Nine Heavens above, within the Palace of Great Existence, where the jade texts are transmitted and entrusted to the Supreme Minister, the Azure Lad of the Blue Palace. Sealed within the Jade Flower Azure Palace, they remained until the first year of the Yuanjing era, when a complete compilation was made and sealed within the Western City Mountain. According to the old statutes, these texts were transmitted but once in ten thousand kalpas. Yet after the Six Heavens were abolished and the Three Ways were rectified, the cosmic reckoning hastened, and the Great Dao was destined to spread. The statutes were thus revised to permit transmission every seven thousand years. If within seven hundred years there appears one of utmost sincerity, whose bones and countenance accord with the mysterious, whose name is recorded in the registers of Supreme Clarity, they may receive the texts in accordance with the covenant.\n\nOne who obtains these scriptures and succeeds in becoming a Perfected may proceed through the practices in proper order; nothing in principle will be lacking, and nothing in the Dao will fail to be accomplished. When qi is full and the Dao complete, one ascends at dawn in broad daylight. The Great Emperor commanded the Solar Valley Divine King of Fusang to compile thirty-one independent scrolls of instructions, which encompass the movements of Heaven and Earth, the Jade Radiance of the Yellow Court, the regulation of the five viscera, and the free flow of the spirit gates. Reciting them ten thousand times also enables one to soar aloft.\n\nAll who undertake this study must first receive the luminous statutes, expiate their transgressions, and redeem their faults, thereby dissolving the seven mysteries and extinguishing their sins in the Nine Yin. Blessings then arise in Supreme Clarity, after which one may present a memorial on golden tablets and jade slips to inscribe their name in the Azure Palace. They shall then receive the liberation of the Seven Primes, the Flowing Gold Fire Bells, the Golden Perfection Jade Radiance Golden Mystery Feathered Chapters, the authoritative methods of the Six Heavens and Three Heavens, and the *Scripture for Subduing Demons*.\n\nNext come the Nine Perfected and Eight Ways’ numinous books of purple writ, which enable the ingestion of sun and moon and the summoning of clouds and rosy dawn. There are the forty-four ranks of the Yellow Plain’s standards, the five-phase soul-summoning incantations of the Curved Silk, the strategies for riding the void and steering the Purple Passage of Flaming Light, the *Feathered Scripture of Flight* and the *Seven Primes’ Treading Steps*, the twenty-seven plain words for invoking the five directions, the Yellow Qi and Yang Essence that illumine sun, moon, and caverns, the Golden Pendants and Jade Girdles that blend the Two Radiant Ones, the Three Primes’ jade tallies that secure the treasure of the spirit, and the seven transformations and eight mutations of the Divine Continent’s *Seven Revolutions and Seven Changes Dancing Heaven Scripture*, which harmonize Heaven and Earth and synchronize day and night.\n\nOnly then may one recite the thirty-nine chapters of the *Great Cavern Perfected Scripture*, deliver one’s seven ancestors, and be reborn in the Southern Palace. There are the *Single Jade Tally and Five Elders’ Precious Scripture*, the *Golden Flower Jade Chamber* where the Three Primes are concealed and courted, the *Wondrous Scripture of Great Existence and Cavern Mystery Plain Numinosity*, the *Five Registers’ Treasure Spirit of the Concealed Elixir*, and the *Three Marvels’ Precious Writ*. Reciting these ten thousand times enables ascent to the Mystery, along with the ingestion of the *Numinous Flight*, the recording of one’s form in the *Hidden Radiance*, the traversal of the Three Celestial Passes through the shifting of the Seven Stars, the Eight Arts of Concealment and the Elixir Radiance’s Dao Essence, the seventy-two transformations and myriad transmutations that are instantly accomplished, and the fusion with the Imperial Unity and the birth of the Five Spirit Embryos.\n\nWhen all scriptures are practiced to completion, the Dao is full and qi abundant; above and below mutually sustain one another, and great and small are equally numinous. Entering the chamber to fast and meditate, one’s profound thoughts arise, and the Perfected Spirits descend in response. The Three Primes visit the chamber, but if one’s steps falter or retreat, spirit disperses and qi scatters. To practice in an empty body alone, like a soul without form, or to covet fulfillment without following the root, to carelessly reveal the Three Treasures and shake the Nine Heavens—such acts are seized by the Three Offices, and sins are bound in the Four Luminaries. Within three years, one’s body is consigned to the offices of ghostly officials. Should one fail to resent one’s own faults and instead blame the Dao and its scriptures, not the Dao betraying the person but the person betraying themselves.\n\nThose who earnestly study and receive the precious texts must follow the statutes and proceed in order. There is nothing that will not respond, nothing in principle that will not be perfected, no Dao that will not descend, no form that will not become immortal. When the Dao is complete after ten thousand recitations, one ascends to Heaven in broad daylight. The three hundred chapters of the supreme scriptures are each bestowed upon the Perfected according to their capacity; not all are fully provided. Later diligent learners cannot equal the practices of the Great Perfected. The world is filled with impure qi, and the correct qi is obscured, hence the study of the Dao proceeds by sequence and rank.\n\nIf one practices the thirty-one scrolls compiled by the Great Emperor and completes the Dao, one may then pursue what one desires. Beginners must not leap directly to their aspirations, lest they violate the luminous statutes, for the consequences are severe. Beware and take heed.\n\nThe Lesser Existence Heavenly King states: One who practices the thirty-one scrolls in proper order, with the cinnabar purity ascending to the heights, shall be visited by the Great Emperor, who will dispatch the Perfected of the Supreme Ultimate to further instruct them in the postures and protocols of the various scriptures. Those who diligently and painstakingly cultivate without lapse shall be able to soar and wander in the Jade Capital.\n\nAll who receive the supreme scriptures must guard their speech and be cautious in their words. They must not turn their backs on one to face another, nor discuss the scriptures’ contents, thereby confusing the Heavenly Perfected. To reveal them to the world, slander fellow practitioners, falsely claim the names of the worthy, belittle those more advanced, deceive the numinous powers, attack teachers and friends, plot rebellion, or claim to possess the wondrous completeness of the cavern scriptures—such acts are seized by the Four Offices and reported to the Great Emperor. One’s seven generations of ancestors and parents are bound to the offices of ghostly officials, eternally confined to the earth prisons, their bodies subjected to the tortures of wind and blades. They shall never attain immortality. Let all practitioners beware.\n\nThe statutes of the Four Poles state: One who does not receive the scriptures but steals the Heavenly Treasures, or receives them without covenant or faith, spurns the Heavenly Dao. If one obtains scriptures through karmic conditions but there is no master in the world, one may proceed according to the statutes, bearing a pledge to a secluded peak to receive them in secret. If a master exists, one must visit them to receive the covenant and transmission. To obtain scriptures without receiving the covenant, to practice recklessly, offend the numinous powers, or idly discuss the scriptures’ titles with the uninitiated—such acts incur severe consequences. They are seized by the officials of the Four Poles and Four Offices, and one’s seven generations of ancestors and parents are consigned to the endless labor of filling the River of Night. Their bodies endure the visible tortures, and after death, they suffer the Ten Torments and Eight Difficulties, swallowing fire and embracing swords, to atone for the crime of carelessly discussing the scriptures. Let the recipient clearly heed the statutes and regulations.\n\nHere ends the *Seven Revolutions and Seven Changes Dancing Heaven Scripture of the Supreme Clarity’s Divine Continent*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞真上清神州七转七变舞天经 经名：洞真上清神州七转七变 舞天经。 撰人不详，约出於东晋。 系早期上清派重要经典。 一卷。 底本出处：《正统道藏》正一部。 洞真上清神州七转七变舞天经 上皇先生紫晨君上经 神州在天关之北，日月回度其南，七星转轮其中央，昼左回八纬，夜右转七经，七星运周，天光回灵。 此上皇紫晨受化之度，便修七转之法，位登於玉清也。 上皇先生紫晨君，盖二晖之胤，结王晨之精，育龙烟於大空，包紫虚於通灵，托九玄以含秀，凝洪露以成神，陶三炁以自灌，经玄母以法生，任历劫而受化，感吉日而濯形。 於是上皇元年天甲启晨，诞於神州八景之天，平丘中域洞渊之滨。 厥名讳婆，字曰虎讽。 既生之旦，面发金容，体映玉光，五色紫章，七十二变，精耀玉颜，神龙吐芝以灌溉，鸾凤舞翼以癊玄，丹霄散景於琼轩，流光焕烂於遐真，二景停晖於八朗，七元回精以匡晨，金仙散香以乱气，神妃掷华以发烟，五纬结络，神秀紫天。 年冠二九，逍遥中元，餐精咽气，吐纳灵津，含芝内灌，凝神胎仙，挹漱守默，淡泊自然，思微念炁，时不亏闲，积感洞元，名超上清，受号元皇，登位紫晨，兰凤应瑞，顺运流迁，神秉五曜，形盘七元，飞霄回转，乘空络烟，群仙启路，三道合明，流电吐威，逸驾九玄，再登玉陛，三谒紫庭，游吗琼阙，宴景三元，携契五老，玉霄上宾，飞兽攘踞，神凤抚呜，巨此框辔，灵风散香，流芬激扬，蓊蔼玉清，金童攀云而侍轮，玉女蹑虚而卫灵，东游碧水桑材之馆，洞净浩灵极清之源。 旸谷神王总仙玉司，请九玄元图青精翠灵，九变之光日景启明之章，以炼真化形，游洞上宫，西之玄羽素野，西陇蒙泛之滨，紫微玉堂。 王母请皓灵素章，龟山元录定真王格，以禅紫皇之号，南造朱陵大丹极炎流火之乡，太阳琼宫九层玉台。 南极上元君请太丹洞元火铃七曜琼章，金真玉光，以招二景玉精，炼化七变之容，北造朔阴九玄寒乡。 太阴玉晨九元真妃，受流精飞景宝章，萧条九耀豁落七元，以披天关，朝宴玉京，上登始天元景玉京，峻嶒之台九曲之房。 太真丈人、太上大道君，受三天正法威制六天，受九缝飞精章，衣流金凤玺，位登紫晨上皇先生。 於是灵晖曜姿，金容畅颜，体冠法服，头戴紫文飞霜七色之冠，侍女众仙十亿万人，飞龙毒兽备卫玉轩，夜明自然神烛，室散虚馥之烟，风鼓玄旌，回舞纷蔼，啸朗太无，玉音激籁，虚唱飞歌，八响应会，鸾呜凤吹，清奏玄泰，玄精回映，三晨停盖，万真礼庆，莫不宗赖，顺神神州之阙，萧条无崖之馆，匡制三五之运，拯化承唐之难，理二仪於玄图，总上皇之遗干，静咏琼轩二，俯胛冥玩，蔚蔚三关，幽章启韵，令唱玄闻、明范应赞，虚音驰骋，洞惠朗焕，激八风以迅躯，摄流电以扬精，召六甲於五行，役武卒於天丁，符五岳以伺驾，檄威章以振灵，变□天於神州，回七转於妙庭，招虚无以自灌，服玉符以升形，络玄象於日月，运七炁於斗星。 於是飘飘九域，公子同轩，司命齐轮，游宴紫晨，领括洞渊，总御群仙，自天以下，莫不受事於上皇，由七变之道妙焉。 神州七转上经 七转七变之道，上皇紫晨君受於九天父母，修行道成，以传玄感清天上皇君，皇君以传三天玉童，三天玉童以传紫极真元君，紫极真元君传天帝君，天帝君传南极上元君，南极上元君传太微天帝君，太微天帝君传后圣金阙君，后圣金阙肴传上相青童君，承真相系，智经万劫一传一小有计决王后撰一通，以封於西域山中，得者皆奉迎圣君於上清宫，给玉童玉女各二十一人，典卫灵文，营护有经者身。",
      "translated_text": "**The Wondrous Scripture of the Seven Cycles and Seven Transformations of the Divine Continent in the Supreme Clarity, Dancing Heaven Sutra**\n\n**Scripture Title:** *The Wondrous Scripture of the Seven Cycles and Seven Transformations of the Divine Continent in the Supreme Clarity, Dancing Heaven Sutra*. Author unknown, approximately dated to the Eastern Jin dynasty. A foundational scripture of the early Supreme Clarity tradition. One scroll. Base text from *The Orthodox Daoist Canon*, First Section.\n\n---\n\n**The Supreme Scripture of the Purple Dawn Lord of the Highest Emperor, from *The Wondrous Scripture of the Seven Cycles and Seven Transformations of the Divine Continent in the Supreme Clarity, Dancing Heaven Sutra***\n\nThe Divine Continent lies north of the Celestial Pass, with the sun and moon revolving to its south. The Seven Stars turn as a wheel at its center, circling left through the Eight Latitudes by day and right through the Seven Constellations by night. As the Seven Stars complete their revolution, the celestial radiance returns in its numinous splendor.\n\nThis is the realm where the Purple Dawn of the Highest Emperor receives transformation, cultivating the method of the Seven Cycles to ascend to the Jade Clarity.\n\nThe Purple Dawn Lord of the Highest Emperor is the descendant of the Twin Radiance, embodying the essence of the Kingly Dawn. Born of the Dragon Mist in the Great Void, he enfolds the Purple Emptiness within the Permeating Numinous. Entrusted to the Nine Mysteries to contain his brilliance, he congeals the Vast Dew to form his spirit, refines the Three Qi to bathe himself, and traverses the Mysterious Mother to be born through the Dao. Enduring kalpas of transformation, he responds to the Auspicious Day to cleanse his form.\n\nIn the first year of the Highest Emperor, on the celestial stem *jia* at dawn, he was born in the Heaven of Eight Effulgences of the Divine Continent, by the shores of the Abyssal Cavern in the central plains of the Level Mound. His taboo name is *Po*, and his style is *Hufeng*. At the moment of his birth, his face shone with golden countenance, his body radiated jade light, and his five-colored purple markings underwent seventy-two transformations. His spirit illumined his jade visage, as the divine dragon spat forth mushrooms to nourish him, and the simurgh and phoenix danced their wings to adorn the Mysterious. The cinnabar auroras scattered their splendor upon the jasper pavilion, and flowing light blazed brilliantly in the distant Realms of Truth. The Twin Effulgences paused their radiance in the Eight Clarities, and the Seven Primes revolved their essence to assist the dawn. The golden immortals dispersed incense to mingle with the qi, and the divine consorts cast flowers to kindle the mist. The Five Latitudes wove their patterns, and the divine splendor suffused the purple heavens.\n\nAt the age of eighteen, he roamed freely in the Middle Prime, consuming essence and swallowing qi, exhaling and inhaling the numinous fluids. He ingested mushrooms for inner irrigation, congealed his spirit into the Embryo Immortal, drew in and rinsed with silence, and dwelled in natural detachment. His thoughts were subtle, his mindfulness of qi unceasing, and through accumulated resonance with the Cavernous Prime, his name transcended the Supreme Clarity. He received the title of Primordial Emperor, ascended to the position of Purple Dawn, and the orchid phoenix responded with auspicious omens. Following the flow of destiny, his spirit embraced the Five Luminaries, and his form coiled with the Seven Primes. Soaring through the auroras, he rode the void’s misty webs, as the host of immortals opened the path. The Three Ways merged in luminosity, and streaming lightning issued forth his might. His swift chariot traversed the Nine Mysteries, ascending the jade steps twice and paying homage thrice at the Purple Court. He wandered the jasper towers, feasted in the Three Primes, and forged bonds with the Five Elders. As an honored guest in the Jade Auroras, flying beasts rampaged and divine phoenixes soothed with their cries. The great yoke and reins were held by the numinous winds, which scattered incense and wafted fragrance in billowing waves, suffusing the Jade Clarity.\n\nThe Divine King of the Sun Valley, overseer of the jade offices of immortals, presented the *Primordial Chart of the Nine Mysteries* in azure essence and emerald numen, along with the *Luminous Chapter of the Nine Transformations and the Solar Effulgence*, to refine the true and transform the form, roaming the Cavernous Upper Palace. To the west, in the Dark Feathered Primal Wilderness by the shores of the Western Ridge’s misty expanse, within the Purple Tenuity’s Jade Hall, the Queen Mother requested the *Pristine Chapter of the Radiant Numen* and the *Primordial Register of Mount Tortoise* to determine the true and establish the royal standard, bestowing the title of Purple Emperor. To the south, he journeyed to the Great Cinnabar of the Vermilion Mound, the land of extreme flame and flowing fire, to the Nine-Tiered Jade Terrace of the Sun Palace. The Supreme Prime Lord of the Southern Culmen presented the *Great Cinnabar Cavernous Prime Fire Bell and the Seven Luminaries’ Jasper Chapter*, along with the *Golden True Jade Radiance*, to summon the Twin Effulgences’ jade essence and refine the sevenfold transformations of his countenance. To the north, he traveled to the frigid lands of the Nine Mysteries in the Dark Yin. The Nine Primes True Consort of the Jade Dawn of the Great Yin received the *Flying Effulgence Treasure Chapter of Flowing Essence*, the desolate *Nine Luminaries*, and the *Seven Primes of the Vast Fall*, to part the Celestial Pass and ascend to the Jade Capital for audience. He mounted the towering terrace of the Primordial Heaven’s Effulgent Jade Capital, with its nine winding chambers.\n\nThe Great True Elder and the Most High Lord of the Great Dao received the *Orthodox Dharma of the Three Heavens* to govern the Six Heavens, and the *Flying Essence Chapter of the Nine Seams*, donning the *Seal of the Flowing Gold Phoenix*. Thus, he ascended to the position of the Purple Dawn Lord of the Highest Emperor.\n\nThereupon, his numinous radiance shone forth, his golden countenance beamed, and his body was clad in the dharma robes. Upon his head rested the *Seven-Colored Crown of the Purple Script and Flying Frost*. His attendants—ten billion immortals and maidens—along with flying dragons and venomous beasts, guarded his jasper chariot. The night naturally brightened with divine candles, and the chamber dispersed the misty fragrance of the Void. The winds stirred the dark banners, and the dance swirled in profusion. His whistling resounded through the Great Vacuity, and the jade tones rang out in harmony. The empty chant soared as a flying song, and the eight echoes responded in unison. The simurghs cried and phoenixes played, their pure melodies attuning to the Mysterious Peace. The dark essence revolved in reflection, and the Three Dawns paused their canopies. The myriad immortals offered obeisance and celebration, all submitting in reverence. He governed the palace of the Divine Continent’s numen, the boundless and desolate halls, regulating the revolutions of the Three and Five, rescuing and transforming the difficulties of the Tang succession. He ordered the Two Modes within the Mysterious Chart and oversaw the legacy of the Highest Emperor. In tranquil recitation within the jasper pavilion, he gazed downward into the profound and played with the obscure, while the lush Three Passes unfolded their hidden verses. He commanded the singing of the Mysterious Hymn, the resounding of the Luminous Model, and the praise of the Resonant Response. The empty tones galloped freely, and the Cavernous Wisdom shone brilliantly. He spurred the Eight Winds to hasten his form, seized the streaming lightning to exalt his essence, summoned the Six Jia within the Five Phases, and employed the martial legions of the Celestial Soldiers. He dispatched talismans to the Five Peaks to await his chariot and issued proclamations of might to rouse the numinous. He transformed the heavens above the Divine Continent and revolved the Seven Cycles within the Wondrous Court. He summoned the Void and Emptiness to bathe himself and ingested jade talismans to ascend in form. He wove the celestial patterns of the sun and moon and revolved the Seven Qi within the Dipper Stars.\n\nThereupon, he drifted through the Nine Realms, his noble sons sharing his chariot, the Directors of Destiny aligning their wheels. He roamed and feasted in the Purple Dawn, encompassing the Cavernous Abyss and commanding the host of immortals. From the heavens downward, none failed to serve the Highest Emperor, for the Dao of the Seven Transformations was wondrous indeed.\n\n---\n\n**The Supreme Scripture of the Seven Cycles**\n\nThe Dao of the Seven Cycles and Seven Transformations was received by the Purple Dawn Lord of the Highest Emperor from the Nine Heavenly Parents. Upon perfecting his cultivation, he transmitted it to the Highest Emperor Lord of the Pure Heaven. The Highest Emperor Lord transmitted it to the Jade Lads of the Three Heavens, who passed it to the True Primordial Lord of the Purple Culmen. The True Primordial Lord of the Purple Culmen transmitted it to the Heavenly Emperor Lord, who passed it to the Supreme Prime Lord of the Southern Culmen. The Supreme Prime Lord of the Southern Culmen transmitted it to the Heavenly Emperor Lord of the Grand Tenuity, who passed it to the Later Sage Lord of the Golden Portal. The Later Sage Lord of the Golden Portal transmitted it to the Azure Lad of the Prime Minister, forming an unbroken lineage of true transmission. Through the wisdom of kalpas, each transmission was recorded in a minor register by the King of Calculations and the Queen of the Later Sage. One copy was sealed within the mountains of the Western Region. Those who obtain it are all received as sagely lords in the Supreme Clarity Palace, granted twenty-one Jade Lads and twenty-one Jade Maidens to attend the numinous scriptures and protect the bearers of this scripture.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1386,
      "start_sentence": 0,
      "end_sentence": 23,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 51.09045958518982,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真上清神州七转七变舞天经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "上皇七转之道，绛简紫书，秘於紫天元台玉室金房之内，授已成真人，不教始学。 凡受《洞真三十九章》、《雌一玉检》、《大有妙经》，解给散滞，拔度七玄，而不知七转之法，皆不得谓咏玉篇。 夫七转之章、皆神州之曲，高上之音，运於天地，参络三晨，左回右转，合会洞门，变五还二，以应七元，转三还五，纬度天关，其道甚妙，故为□天。 谓之一遍，朗彻无间，七转八诵，三光齐真，五老定籍，司命改篇，解散宿结，断绝胎根，上开九祖，更反胎仙，制御千秋，万魔束身，修之万遍，位登紫晨。 凡修七转之道，当先读第五太上大道君章，次读三元紫精君章，次读真阳元老玄一君道章，次读青灵阳安君章，次读皇清洞真君章，次读九天太真章，次读元始高上玉皇章，此七转竟，周於元始高上也。 还读上皇道章，次读皇上帝君章，次读太阳君章，次读高上太素君章、次读中央黄老君章，次读无英中真上老君章，次读皇初紫虚君章，还读太上大道君章，此八纬周竟，会於太上所治玉京山也。 还读如先，又从第五起，七过乃毕。 如此则上响玉帝，万真礼音，下召万境，束结真形，精修百日，沐浴垢尘，坐震灵之上，诵七转之章万遍、道备白日升天。 高上玉篇，秘而奉行，慎示非真，泄露灵章，罪灭子身，考流七玄。 凡修七转之道，每以月朔十五日，及八节之日，斋戒，正中入室东向，读七转之章八过止，至夜半北向，又读七过止。 一日昼夜，合十五转，此则上应天关，运度三光； 中整一形，通津固神； 下制万魔，平灭千灵轮转相和，参五齐明。 学失此道，死入幽冥，精修苦念，克乘飞軿，上登紫晨，游宴玉清。 凡有神州七转七变□天之道，役使玉童玉女各二十一人，游行五岳，玄络青毛之节，驾青景之龙，佩神虎之符，戴芙蓉之冠，着紫绣毛帔丹青飞裙，呜金铃玉真紫盖华幡、带九赤班符封山召云，上游紫极金堂之中。 若未能变景腾霄，故在人中修行此道，九天父母上皇紫晨，亦以法服飞仙羽章给子之身，但不显於嚣尘之中耳。 子修此道，当常存己身着此章服，乘龙御云，七年克得真灵见形，上升紫晨也。 高上元始玉皇道章第一 神州玉章曰：元始玄玄，祖气肃精，神风乱天，抚闲四清，上景总仙，帝一黄宁，六曜启晖，凌梵抚征，混合万变，玉兰发荣，太真潜映，华反南庭，拔苦七难，穷魂化生，明梁之馆，变白为青，长咽吐霞，蓊蔼紫清，森罗曜日，百和俱呜，玉唱洞朗，惠冠无形，七转八纬，升入帝灵。 九天太真道章第二 神州玉章曰：玄虚九清气，三素凌华芒。 渊响启灵扉，七门扇羽章。 豁落丹霄观，幽寥宜运彰。 六觉悟玄会，眇栖合太空。 阳台大洞野，幽逸英芝光。 遗累翳虚空，绝宅自冥通。 高会玄晨阙，骞首朝玉皇。 神映木灵音，虚鼓响明钟。 九辔浮云轩，逍遥紫霞峰。 丹陵启碧室，绿庭披五房。 金门焕嵯峨，蔼沫上清宫。 太一度符籍，保我右无英。 七祖离穷徒，南仙反形容。 游冥太帝室，乘浮适十方。 上皇玉虚君道章第三 神州玉章曰：玉虚范玄匠，高会通冥想。 翳翳升九元，朗朗生帝景。 三曜无停晖，明真焕云亡。 提携宴玉宾，契驾乘烟骋。 黄箓命玉符，公子运我上。",
      "translated_text": "The Way of the Seven Cycles of the Supreme Prime Lord is inscribed on crimson tablets and written in purple script, concealed within the Jade Chamber of the Golden House of the Primordial Terrace of the Purple Heaven. It is conferred only upon perfected transcendents, never taught to beginners. Those who receive the *Thirty-Nine Chapters of the Cavernous Perfection*, the *Jade Tablet of the Feminine One*, or the *Wondrous Scripture of the Great Existence*—though they may dissolve stagnation and deliver the Seven Mysteries—yet remain ignorant of the Seven Cycles and thus cannot be said to chant the Jade Chapters.\n\nThe verses of the Seven Cycles are the melodies of the Divine Continent, the celestial tones of the Most High. They circulate through heaven and earth, interweaving with the Three Mornings. Turning left and revolving right, they converge at the Cavernous Gate, transmuting the Five into the Two to align with the Seven Origins, and cycling the Three into the Five to traverse the Celestial Pass. Their Way is profoundly subtle, and thus they are called the [ ] Heaven.\n\nTo chant them once is to achieve unbroken clarity; seven cycles and eight recitations harmonize the Three Luminaries as one reality. The Five Elders fix the registers, the Lords of Destiny revise the records, knots of past karma are untied, and the roots of rebirth severed. Nine generations of ancestors ascend, and the adept is reborn as a womb-transcendent. A thousand autumns are mastered, ten thousand demons bound in submission. After ten thousand recitations, one ascends to the Purple Morn.\n\nIn practicing the Way of the Seven Cycles, one must first recite the chapter of the Most High Great Dao Lord, then the chapter of the Three Origins Purple Essence Lord, followed by the chapter of the True Yang Primordial Elder Mysterious One Lord, then the chapter of the Azure Spirit Yang Peace Lord, next the chapter of the August Clarity Cavernous Perfection Lord, then the chapter of the Nine Heavens Supreme Perfection, and finally the chapter of the Primordial Most High Jade Sovereign. These seven cycles conclude with the Primordial Most High.\n\nNext, recite the chapter of the Supreme Prime Dao, then the chapter of the August Thearch Lord, followed by the chapter of the Great Yang Lord, then the chapter of the Most High Great Simplicity Lord, next the chapter of the Central Yellow Elder Lord, then the chapter of the Non-Dual Middle Perfected Supreme Elder Lord, and finally the chapter of the August Primordial Purple Vacuity Lord. Returning to recite the chapter of the Most High Great Dao Lord, these eight latitudinal cycles conclude at the Jade Capital Mountain governed by the Most High.\n\nRecite again as before, beginning from the fifth chapter, and repeat seven times to complete the practice. Thus, one’s voice ascends to the Jade Sovereign, and the myriad perfected ones bow in reverent harmony. Below, the ten thousand realms are summoned, and the true form is bound and refined. After a hundred days of diligent cultivation, bathing to cleanse dust and grime, seated upon the numinous mat, recite the Seven Cycles ten thousand times. When the Dao is perfected, one ascends to heaven in broad daylight.\n\nThe Most High Jade Chapters are to be reverently practiced in secret. Beware of revealing them to the unworthy, for leaking the numinous verses brings annihilation upon oneself and condemns one’s descendants to the Seven Mysteries.\n\nWhen practicing the Way of the Seven Cycles, on the first and fifteenth days of each month, as well as during the eight solar terms, observe purification rites. At noon, enter the chamber, face east, and recite the Seven Cycles eight times. At midnight, face north and recite them seven more times. In a single day and night, complete fifteen cycles. This aligns above with the Celestial Pass, circulating the Three Luminaries; centers and harmonizes the body, unblocking the passages and stabilizing the spirit; and below, subdues the myriad demons, pacifying the thousand spirits. The cycles interweave and harmonize, uniting the Five in radiant clarity. Those who neglect this Way descend into darkness after death, but through earnest cultivation and苦念, one ascends in a flying chariot to the Purple Morn, roaming and feasting in the Jade Clarity.\n\nThe Way of the Seven Cycles and Seven Transformations of the Divine Continent’s [ ] Heaven commands the service of twenty-one Jade Lads and twenty-one Jade Maidens. They traverse the Five Marchmounts, their dark-veined jade tokens in hand, riding azure radiance dragons, bearing tiger talismans of spirit, wearing lotus crowns, clad in purple embroidered feathered robes and cinnabar-green flying skirts. They ring golden bells and jade chimes, unfurl purple canopies and flowered banners, and wield nine vermilion-striped talismans to seal mountains and summon clouds, ascending to the Golden Hall of the Purple Culmen.\n\nIf one has not yet transformed into a radiant ascendant, practicing this Way while still in the mortal realm, the Nine Heavens’ Parents—the Supreme Prime Purple Morn—will bestow upon the adept the vestments of flying transcendents and feathered scriptures, though these remain concealed from the clamor of the dusty world. When cultivating this Way, one should constantly visualize oneself adorned in these sacred garments, riding dragons and driving clouds. After seven years, the true spirit will manifest, and one will ascend to the Purple Morn.\n\n**First Chapter: The Way of the Primordial Most High Jade Sovereign**\nThe Jade Chapter of the Divine Continent states:\nPrimordial and profoundly mysterious,\nThe ancestral qi refines its essence.\nDivine winds stir the heavens,\nPacifying the Four Clarities.\nThe supreme radiance gathers the immortals,\nThe Imperial One governs in yellow tranquility.\nThe Six Luminaries unfold their splendor,\nAscending Brahma to quell the march.\nMerging the myriad transformations,\nJade orchids bloom in glory.\nThe Great Perfected shines in concealment,\nFlowers return to the Southern Court.\nDelivering from seven sufferings,\nLost souls are transformed and reborn.\nIn the halls of the Bright Beam,\nWhite turns to azure.\nEver swallowing and exhaling mist,\nLush and verdant in the Purple Clarity.\nForests of solar essences align,\nA hundred harmonies resound as one.\nJade chants echo through the Cavernous Brightness,\nBlessings crown the formless.\nSeven cycles and eight latitudinal paths,\nAscend into the Sovereign’s numinous presence.\n\n**Second Chapter: The Way of the Nine Heavens Supreme Perfection**\nThe Jade Chapter of the Divine Continent states:\nMysterious and empty, the qi of the Nine Clarities,\nThree Simplicities ascend in radiant splendor.\nProfound echoes open the numinous gates,\nSeven portals unfurl feathered scriptures.\nVast and open, the Crimson Empyrean is beheld,\nThe secluded and boundless manifest their glory.\nSix senses awaken to the mysterious assembly,\nSubtly perching in harmony with the Great Void.\nThe Yang Terrace spans the Cavernous Wilds,\nThe reclusive flourish with the glow of sacred mushrooms.\nAbandoning burdens, obscuring the void,\nSevering ties, one naturally communes with the unseen.\nIn the high assembly at the Cavernous Morn’s gates,\nHeads raised, they pay homage to the Jade Sovereign.\nDivine reflections resonate with the Wood Spirit’s sound,\nEmpty drums echo with luminous bells.\nNine reins guide the cloud chariot,\nWandering freely upon the Purple Mist Peak.\nCinnabar mounds open the Azure Chamber,\nGreen courts unfold the Five Houses.\nGolden gates gleam in majestic splendor,\nMists ascend to the Supreme Clarity Palace.\nThe Great Unity’s talisman and register\nPreserve me alongside the Right Non-Dual.\nSeven generations escape suffering,\nSouthern immortals regain their forms.\nRoaming the dark chambers of the Great Thearch,\nFloating freely to the ten directions.\n\n**Third Chapter: The Way of the Supreme Prime Jade Vacuity Lord**\nThe Jade Chapter of the Divine Continent states:\nJade Vacuity shapes the mysterious craft,\nIn lofty assembly, one communes with the unseen.\nObscurely ascending the Nine Origins,\nBrightly the Sovereign’s radiance is born.\nThe Three Luminaries’ brilliance never ceases,\nThe Perfected shine, and clouds vanish.\nLifting and escorting the jade guests to feast,\nTheir chariots contract and ride the mist.\nThe Yellow Register commands the jade talisman,\nThe Noble Scion carries me aloft.",
      "overlap_context": "Lad of the Prime Minister, forming an unbroken lineage of true transmission. Through the wisdom of kalpas, each transmission was recorded in a minor register by the King of Calculations and the Queen of the Later Sage. One copy was sealed within the mountains of the Western Region. Those who obtain it are all received as sagely lords in the Supreme Clarity Palace, granted twenty-one Jade Lads and twenty-one Jade Maidens to attend the numinous scriptures and protect the bearers of this scripture.",
      "start_char": 1387,
      "end_char": 2620,
      "start_sentence": 24,
      "end_sentence": 63,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.866360664367676,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真上清神州七转七变舞天经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "解散七玄祖，更法无中影。 七化反自然，帝一同玄响。 皇上玉帝道章第四 神州玉章曰：帝牖含玉兰，玄上有清扉。 七觉悟幽旦，熙神落风回。 旌旗耀太空，焕朗金灵晖。 扶晨发曜罗，牢张洞紫微。 丹皇啸运珠，赤子守玄畿。 七祖解胞根，反胎皆仙飞。 回五还造二，三周顺运回。 参晨络玄纪，万真咸总归。 携提霄上客，帔景朗琼帏。 控辔登云轮，极宴玉帝喈。 太上大道君章第五 神州玉章曰：景化九玄关，玉晨回紫精。 内映绝宅府，乘虚造四明。 法轮皆三周，七变还无英。 太一检天魔，回章校千灵。 左啸洞玄微，右叱九天倾。 契落弥八荒，流眄策神兵。 拔过七祖难，越度仙皇人。 司命保元籍，东宫注玉名。 回光泥丸府，五藏秀华荣。 耀景负圆珠，固魂保劫龄。 上宴九霄馆，萧萧登玉清。 三元紫精君道章第六 神州玉章曰：三元澄灵化，紫清洞虚无。 伯央启神宗，金门玄相求。 三素回帝室，飘飘戏玉州。 丹晖映空天，金室曜兰敷。 承光固幽关，凌梵蹑云躯。 五云□夜日，秀朗上京衢。 太一度符籍，拔散七玄忧。 回婴及仙宅，欻然神明初。 变五还反二，天象回一周。 七化顺炁转，公子受灵符。 妙吹九晨飙，超登仙公庐。 真阳元老玄一君道章第七 神州玉章曰：玄一帝尊，抚闲真阳，五秀结炁，神华内昌，司命定录，太一扶将，灭魔洗秽，诛剪不祥，急告北帝，检察鬼乡，有横者戮，无使越扬，神真出游，十天司迎，右携白元，左引无英，乘云迅驾，上造玉清，流铃交掷，豁落开张，金仙执幡，西华散香，五色羽节，丹青玉霜，流金宝盖，登仙凤章，上戏洞青，游宴玄梁。 青灵阳安君道章第入 神州玉章曰：三华曜丹府，青灵扇八气。 回轮上元阙，五道齐玉位。 凌梵之日门，履昌合神契。 二真把符命，拔度五苦界。 混化帝一景，回风洞妙惠。 飞步入北元，七晨运身逝。 上挟九天关，玉路先氛翳。 合符丹霄上，飘飘凌云际。 皇清洞真君道章第九 神州玉章曰：洞真混玄化，皇清法三灵。 虹映九天阶，含真秀景生。 萧刃焕金室，丹晖曜太冥。 五老典命籍，玉司总神营。 归会离罗上，八合周黄宁。 解结绝胞根，七祖更受荣。 太乙度五籍，朽落反胎婴。 充镇泥丸宫，五藏秀丹盈。 八徊盻日门，乘虚腾紫庭。 皇初紫元君道章第十 神州玉章曰：紫元焕九霄，皇初曜辉室。 三五契神州，离合运朱日。 萧条金门上，迥阴总元七。 拔出五苦□，超登白元匹。 洞披朱阜户，逍遥入玄荜。 理化顺风气，混合帝尊一。 带月抱叔王，过我死根灭。 五符保长命，永与酆都别。 七祖同获庆，洪芝蕙流溢。 回风化七转，金章洞灵室。 无英中真上老君道章第十－ 神州玉章曰：无英落云姿，结秀玉阳房。 萧萧元素炁，圆珠映紫宫。 高会玄玄上，携我九天王。 被朗金华门，五帝命空同。 度兆五符籍，宝魂耀九重。 桃康固下关，气与泥丸通。 霐化混合真，三帝同玄宫。 父宁母延精，使我成仙公。 七祖离幽徒，南轩反形容。 逍遥洞野外，盻观劫刃中。 中央黄老君道章第十二 神州玉章曰：圆华曜太晖，黄老治中真。 吟咏玉皇章，妙响激洞邻。 赤景逸幽寥，太一增劫年。 度符升紫房，七祖离苦臻。 飘飘玄华上，灵风散紫烟。 混化三五气，回合成我身。",
      "translated_text": "**Fourth Chapter: The Way of the Supreme Jade Thearch**\n\nThe Jade Chapter of the Divine Continent states:\nDissolving the seven mysterious ancestors,\nThe law transforms beyond the shadow of Non-Being.\nSeven transformations return to spontaneity,\nThe Thearch’s Unity harmonizes with the mysterious resonance.\n\nJade portals enfold jade orchids,\nAbove the profound, pure gates unfold.\nSeven awakenings pierce the dark dawn,\nThe radiant spirit descends with the returning wind.\nBanners gleam across the Great Void,\nResplendent, the golden numinous brilliance shines.\nSupporting the dawn, they unfurl the net of luminaries,\nFirmly expanding the Cavern of Purple Tenuity.\nThe Cinnabar Thearch whistles and commands the pearl,\nThe Red Child guards the mysterious precincts.\nSeven ancestors unbind their womb-roots,\nReturning to the womb, all ascend as immortals.\nReversing the Five to restore the Two,\nThree cycles follow the turning of destiny.\nJoining the Three Mornings, they weave the mysterious record,\nThe myriad perfected all converge in unity.\nLifting and escorting the guests of the Empyrean,\nTheir luminous robes gleam beneath the jade canopy.\nTaking the reins, they mount cloud-chariots,\nFeasting to the utmost in the Jade Thearch’s hall.\n\n---\n\n**Fifth Chapter: The Way of the Supreme Great Dao Lord**\n\nThe Jade Chapter of the Divine Continent states:\nRadiance transforms the Nine Mysterious Passes,\nJade dawn revolves with purple essence.\nInwardly illumining the absolute abode,\nRiding the void, they ascend to the Four Luminaries.\nThe Dharma-wheel completes its three cycles,\nSeven changes return to the Non-Dual.\nThe Great Unity inspects celestial demons,\nReversing the chapters to examine the thousand spirits.\nWhistling to the left, they penetrate the profound subtleties,\nRebuking to the right, the Nine Heavens incline.\nTheir covenant extends across the Eight Wastes,\nTheir sweeping gaze commands the divine soldiers.\nThey rescue the seven ancestral tribulations,\nTranscending to join the immortal sovereigns.\nThe Registrar of Destinies preserves the primordial register,\nThe Eastern Palace inscribes their jade names.\nReversing the light into the Mud-Pill Palace,\nThe five viscera flourish with radiant splendor.\nIlluminating their forms, they bear the round pearl,\nSecuring the hun-soul to preserve kalpic ages.\nAscending to feast in the Nine Empyrean’s halls,\nSerenely they ascend to Jade Purity.\n\n---\n\n**Sixth Chapter: The Way of the Three Primordials’ Purple Essence Lord**\n\nThe Jade Chapter of the Divine Continent states:\nThe Three Primordials clarify the numinous transformation,\nPurple Purity pervades the Void of Non-Being.\nThe Earl of the Center initiates the divine lineage,\nThe Golden Gate seeks the profound in mutual pursuit.\nThe Three Simplicities revolve within the Thearch’s chamber,\nDrifting and playing in the Jade Continent.\nCinnabar brilliance reflects the empty heavens,\nThe golden chamber shines upon the orchid’s unfolding.\nBearing the light, they secure the dark passes,\nAscending the Brahma-realm, they tread the cloud-body.\nFive clouds [obscure] the night sun,\nTheir splendor ascends the capital’s thoroughfares.\nThe Great Unity’s talisman and register\nDissolve the seven mysterious sorrows.\nReturning to infancy and the immortal dwellings,\nSuddenly the divine illumination begins anew.\nTransforming the Five to restore the Two,\nThe celestial signs complete one revolution.\nSeven changes follow the turning of qi,\nThe Noble Scion receives the numinous talisman.\nWondrously blowing the Nine Mornings’ gale,\nThey transcend to the immortal lords’ abode.\n\n---\n\n**Seventh Chapter: The Way of the True Yang’s Primordial Unity Lord**\n\nThe Jade Chapter of the Divine Continent states:\nThe Primordial Unity, Thearch and Venerable,\nNurtures the tranquil True Yang,\nFive blossoms bind the qi,\nThe divine splendor flourishes within.\nThe Registrar of Destinies fixes the record,\nThe Great Unity assists and upholds.\nAnnihilating demons, cleansing defilement,\nExterminating and severing misfortune,\nSwiftly reporting to the Northern Thearch,\nInspecting the demonic realms.\nThose who transgress are executed,\nLest they spread and rise.\nThe divine perfected set forth on their journey,\nThe Ten Heavens’ administrators welcome them.\nTo the right, they grasp White Prime,\nTo the left, they lead the Non-Dual.\nRiding cloud-chariots in swift flight,\nThey ascend to Jade Purity.\nTossing the flowing bells in exchange,\nThe vast expanse unfolds and opens.\nGolden immortals bear the banners,\nWestern Florescence scatters incense.\nFive-colored feathered standards,\nCinnabar and azure, jade frost.\nFlowing gold and jeweled canopies,\nAscending immortal phoenix sigils.\nAbove, they sport in the Cavern of Azure,\nRoaming and feasting beneath the mysterious beam.\n\n---\n\n**Eighth Chapter: The Way of the Azure Numinous Yang Peace Lord**\n\nThe Jade Chapter of the Divine Continent states:\nThree blossoms illuminate the Cinnabar Palace,\nThe Azure Numinous fans the Eight Qi.\nThe revolving wheel ascends the Upper Prime’s gate,\nThe Five Ways align with the jade ranks.\nOn the day of ascending Brahma’s gate,\nThey tread the flourishing, uniting with the divine covenant.\nTwo perfected grasp the talismanic mandate,\nDelivering the Five Suffering Realms.\nBlending the transformation of the Thearch’s Unity’s radiance,\nThe returning wind pervades wondrous wisdom.\nThey fly in steps into the Northern Prime,\nSeven mornings revolve as the body departs.\nAbove, they grasp the Nine Heavens’ passes,\nThe jade path first dispels the mists.\nUniting the talismans in the Cinnabar Empyrean,\nDrifting and soaring at the clouds’ edge.\n\n---\n\n**Ninth Chapter: The Way of the Sovereign Purity Cavern-Real Lord**\n\nThe Jade Chapter of the Divine Continent states:\nThe Cavern-Real blends the mysterious transformation,\nSovereign Purity enacts the Three Numinous.\nRainbow light reflects the Nine Heavens’ steps,\nEmbracing the true, radiant splendor flourishes.\nThe flaming blade gleams in the golden chamber,\nCinnabar brilliance illumines the Great Obscurity.\nThe Five Elders govern the registers of destiny,\nThe Jade Administrators command the divine encampments.\nReturning to assemble above the Net of Separation,\nThe Eight Harmonies encompass Yellow Tranquility.\nUnbinding the knots, severing the womb-roots,\nSeven ancestors receive renewed glory.\nThe Great Unity delivers the Five Registers,\nDecay and fall reverse to the fetal infant.\nFilling and guarding the Mud-Pill Palace,\nThe five viscera flourish with cinnabar’s fullness.\nEight revolutions gaze upon the Sun Gate,\nRiding the void, they ascend the Purple Court.\n\n---\n\n**Tenth Chapter: The Way of the Sovereign Prime’s Purple Prime Lord**\n\nThe Jade Chapter of the Divine Continent states:\nPurple Prime illumines the Nine Empyreans,\nSovereign Prime shines in the radiant chamber.\nThree and Five unite with the Divine Continent,\nSeparation and union revolve with the vermilion sun.\nDesolate above the Golden Gate,\nThe distant Yin gathers the Primordial Seven.\nDelivering from the Five Sufferings’ [realm],\nTranscending to join White Prime’s ranks.\nOpening the Cavern, they part the vermilion mound’s gate,\nRoaming freely into the mysterious threshold.\nGoverning transformation, following the wind’s qi,\nBlending and uniting with the Thearch’s Unity.\nEmbracing the moon, they hold the Young King,\nPassing me, the root of death is extinguished.\nFive talismans preserve long life,\nForever parting from Mount Feng’s underworld.\nSeven ancestors together attain felicity,\nVast mushrooms and orchids overflow.\nThe returning wind transforms the seven cycles,\nThe golden chapters pervade the Cavern-Numinous chamber.\n\n---\n\n**Eleventh Chapter: The Way of the Non-Dual’s Central Perfected Supreme Elder Lord**\n\nThe Jade Chapter of the Divine Continent states:\nThe Non-Dual descends in cloud-like grace,\nBinding splendor in the Jade Yang chamber.\nSerene, the Primordial Simplicity’s qi,\nThe round pearl reflects the Purple Palace.\nIn lofty assembly above the Profound Profound,\nThey lift me to the Nine Heavens’ King.\nClad in the radiance of the Golden Flower Gate,\nThe Five Thearchs command the emptiness in unison.\nDelivering the multitudes through the Five Talismanic Registers,\nThe precious hun-soul shines across the Nine Layers.\nPeach and prosperity secure the lower passes,\nQi communicates with the Mud-Pill Palace.\nThe numinous transformation blends and unites the true,\nThe Three Thearchs share the mysterious palace.\nFather pacifies, mother extends essence,\nEnabling me to become an immortal lord.\nSeven ancestors escape the dark bonds,\nIn the Southern Pavilion, their forms are restored.\nRoaming beyond the Cavern-Wilds,\nGazing upon the kalpic blade’s midst.\n\n---\n\n**Twelfth Chapter: The Way of the Central Yellow Elder Lord**\n\nThe Jade Chapter of the Divine Continent states:\nThe round blossom illumines the Great Brilliance,\nThe Yellow Elder governs the Central True.\nChanting the Jade Thearch’s chapters,\nThe wondrous resonance stirs the Cavern-Neighbors.\nThe red radiance flees into the distant desolation,\nThe Great Unity augments the kalpic years.\nDelivered by talismans, they ascend the Purple Chamber,\nSeven ancestors escape suffering’s culmination.\nDrifting above the Profound Blossom,\nThe numinous wind scatters purple mist.\nBlending the Three and Five’s qi,\nRevolving and uniting to complete my body.",
      "overlap_context": "Jade Vacuity Lord**\nThe Jade Chapter of the Divine Continent states:\nJade Vacuity shapes the mysterious craft,\nIn lofty assembly, one communes with the unseen.\nObscurely ascending the Nine Origins,\nBrightly the Sovereign’s radiance is born.\nThe Three Luminaries’ brilliance never ceases,\nThe Perfected shine, and clouds vanish.\nLifting and escorting the jade guests to feast,\nTheir chariots contract and ride the mist.\nThe Yellow Register commands the jade talisman,\nThe Noble Scion carries me aloft.",
      "start_char": 2620,
      "end_char": 3877,
      "start_sentence": 64,
      "end_sentence": 150,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 51.82836198806763,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真上清神州七转七变舞天经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "司命保箓籍，公子度灵篇。 长宴景龙舆，携契高上宾。 高上太素君道章第十三 神州玉章曰：高上严龙驾，宴景紫霄馆。 太素映玄光，五老翼灵赞。 合契命符籍，冥初欻已判。 拔度三涂梁，超然离苦难。 仰掇骞林实，含华增年算。 帝一守上关，太张解胞散。 混合化胎仙，宝魂耀幽干。 熙恰畅六府，玄母结始旦。 七祖去幽宫，飘飘戏玄汉。 太阳君道章第十四 神州玉章曰：玉宝耀云盖，微玄契三晨。 太阳化元景，混合运胎仙。 开阴结太漠，凝精固魂神。 金符焕玉契，披释七祖根。 太一啸洞章，灵响彻南轩。 童子拥素明，带日御云轮。 乘飙映空盖，仰手掇华骞。 司命度仙籍，受号玉皇前。 神州玉章，乃十四帝君洞野之曲，百神内名，玉天之玄象，三晨之精，诵其章，玉响激朗上元虚无，则九天真王万仙，皆陪位神庭，稽首礼音。 故诵大洞真经，皆当先行七转之道。 此章契络十天，回停三晨，万魔伏窜，千妖丧形，诵之万遍，白日升天。 紫晨常以月三日、七日、九日、十四日、十七日、二十一日、二十七日、当取白芷，青木、香桃皮三物，各七分，煮之七斗水，子时北向沐头。 临沐之时，即叩齿九通，微祝曰： 五川洪池，曲水丹华，洗垢除尘，芳香滂沲，神形濯炼，玉浆芝泥。 便沐事竟，又阴咒曰： 神真变景，改容炼形，体含玉髓，胃藏华生。 毕。 此九沐浴变炼之道，行之令人体香神通，与真合灵。 修七转之道，不知此法，神明不降，诵咏无彻也。 学者习之。 神州七变舞天经 第一之变气，当先化身为云，召风超气，吐焰成烟，五霞冠匝，以变兆身，积感道降，上升太玄。 当以壬癸之日夜半子时，烧香静室，平坐北向，安徐静 思，冥目存炁，见雾露蓊蔼，冠覆己身都定。 仰啸三过，觉有风气入室，便左嘘九过，思炁出口，化为青烟，便九过思唤东方青霞，讳飞虚，来卫我左； 转右嘘七炁，思炁出口，化为白烟，便七过唤西方白霞，讳素庐，来卫我右； 左顾右嘘三炁，思炁出口，化为赤烟，便三过唤南方赤霞，讳丹映，来在我前； 正嘘五炁，思炁出口，化为黑烟，便五过唤北方黑霞，讳玄象，来卫我后； 仰嘘十二气，思炁出口，化为黄烟，便十二过唤中央黄霞，讳总生，来卫我形。 都毕，叩齿十二通，仰祝曰： 召风制天，吐炁为烟，雾露蓊郁，罗布十天，五霞缠络，匝冠我身，变化随体，形无稽延，呼召应命，飞升帝晨。 毕，服霞精玉景飞玄生符，还北首而卧，正申四体向上，闭目存己身化为五色之云，云炁怜郁，与炁合升然，飘飘升虚，散满於天，周竟无崖，从空来还。 便摩两手掌心令热，拭面三九过，将上至脚下三过，起摇头七过，以正北向，微祝曰： 五色变景，化成飞云，与体合炁，俱升洞门，乘霞络晨，上谒三元。 毕，咽炁七过止。 修此七年，思不亏日，则云炁降感，应炁响集，身化形变，与炁同烟，乘云而飞，上造帝晨。 至妙之道，上皇玉篇，秘而奉修，慎勿示人，天科告慎，唯不妄传。 第二之变，当化身为光，映照室内，朗曜八荒，乘玄御虚，升入太空。 行此之道，常以月朔、三日、九日，及十五日、二十五日正中，入室烧香左右，安神定炁，冥月静思，存日中精光五色流霞，焕明东方，光中又有紫炁，大如目瞳，焕曜在五光之内，流烂竟天。",
      "translated_text": "**Thirteenth Chapter: The Way of the Highest Lord of Grand Simplicity**\n\nThe Jade Chapter of the Divine Continent states:\nThe Highest ascends in a stern dragon-chariot,\nFeasting in the Purple Empyrean’s halls.\nGrand Simplicity illumines the dark radiance,\nThe Five Elders assist with numinous praise.\nHarmonizing the tally of life’s register,\nIn the primal darkness, all is already decreed.\nDelivering across the Three Beams’ bridges,\nTranscending far from suffering’s bonds.\nGazing upward to pluck the fruits of the Kāśa-grove,\nAbsorbing their blossoms to augment my years.\nThe Thearch of Unity guards the Upper Pass,\nThe Grand Expansion dissolves the womb’s dispersal.\nBlending to transform into the womb-immortal,\nThe precious soul shines in the dark stems.\nJoyous and harmonious, the Six Palaces flourish,\nThe Dark Mother weaves the dawn’s beginning.\nSeven ancestors depart the dark palace,\nDrifting and playing in the dark Han.\n\n**Fourteenth Chapter: The Way of the Lord of Grand Yang**\n\nThe Jade Chapter of the Divine Continent states:\nThe jade treasure illumines the cloud-canopy,\nThe subtle mystery accords with the Three Mornings.\nGrand Yang transforms the primordial radiance,\nBlending and revolving to evolve the womb-immortal.\nOpening the Yin to conjoin the Grand Desert,\nCongealing essence to secure the soul and spirit.\nThe golden talisman gleams with the jade tally,\nUnbinding the roots of seven ancestors.\nThe Grand Unity chants the Cavern-Chapters,\nThe numinous resonance pierces the Southern Pavilion.\nThe youths embrace the pure brightness,\nGirded with the sun, they ride the cloud-wheel.\nMounting the whirlwind, they reflect the empty canopy,\nReaching upward to pluck the blossoms of the Kāśa.\nThe Registrar of Destinies inscribes their immortal register,\nReceiving their titles before the Jade Thearch.\n\nThe Jade Chapter of the Divine Continent is the hymn of the Fourteen Thearchs’ Cavern-Wilds, the inner names of the hundred spirits, the dark image of the Jade Heaven, the essence of the Three Mornings. Reciting its chapters, the jade resonance stirs the Upper Primordial Void, so that the Nine Heavens’ Perfected Kings and the ten thousand immortals all attend in the divine court, bowing their heads to the sacred sound.\n\nThus, when reciting the *True Scripture of the Great Cavern*, one must first practice the Way of the Seven Revolutions. This chapter interlinks the Ten Heavens, revolves and halts the Three Mornings, ten thousand demons prostrate and flee, a thousand demons lose their forms. Reciting it ten thousand times, one ascends to heaven in broad daylight.\n\nOn the third, seventh, ninth, fourteenth, seventeenth, twenty-first, and twenty-seventh days of the month, take *Angelica dahurica*, *Ailanthus* wood, and peach bark—three substances, each seven parts—boil them in seven *dou* of water, and at the hour of *zi*, facing north, wash your head. Before washing, knock the teeth nine times and softly invoke:\n\n*\"Five rivers, vast pools,\nCurving waters, cinnabar blossoms,\nWash away filth and dust,\nFragrant and flowing,\nSpirit and form refined,\nJade nectar and mushroom mud.\"*\n\nWhen the washing is complete, recite this secret incantation:\n\n*\"Divine Perfected transform their radiance,\nReshaping countenance and refining form,\nBody containing jade marrow,\nStomach storing blossoming life.\"*\n\nThis is the Way of the Nine Baths for transformation and refinement. Practicing it makes the body fragrant and the spirit communicative, uniting with the Perfected in numinosity. Without knowing this method, the divine luminaries will not descend, and recitation will not penetrate. Let the scholar cultivate it.\n\n**The Scripture of the Divine Continent’s Seven Transformations for Dancing in Heaven**\n\n**First Transformation: Qi**\nFirst, transform the body into cloud, summon wind and transcend qi, exhale flames to become mist, with five auroras crowning the head to transform the omen-body. Through accumulated resonance, the Dao descends, ascending to Grand Mystery.\n\nOn the days of *ren* and *gui*, at midnight during the hour of *zi*, burn incense in a quiet chamber, sit evenly facing north, calm the mind, close the eyes, and visualize qi. See mist and dew swirling, crowning and covering the body until all is settled. Utter three long whistles, sensing wind and qi entering the chamber. Then, with the left breath, exhale nine times, visualizing qi leaving the mouth and transforming into blue mist. Nine times, summon the Eastern Blue Aurora, whose name is *Fēi Xū*, to guard the left. Turn to the right, exhale seven breaths, visualizing qi leaving the mouth and transforming into white mist. Seven times, summon the Western White Aurora, whose name is *Sù Lú*, to guard the right. Glance left and right, exhale three breaths, visualizing qi leaving the mouth and transforming into red mist. Three times, summon the Southern Red Aurora, whose name is *Dān Yìng*, to stand before you. Exhale five breaths straight ahead, visualizing qi leaving the mouth and transforming into black mist. Five times, summon the Northern Black Aurora, whose name is *Xuán Xiàng*, to guard behind. Exhale twelve breaths upward, visualizing qi leaving the mouth and transforming into yellow mist. Twelve times, summon the Central Yellow Aurora, whose name is *Zǒng Shēng*, to guard the form.\n\nWhen all is complete, knock the teeth twelve times and invoke upward:\n\n*\"Summon wind to command heaven,\nExhale qi to become mist,\nMist and dew swirling,\nSpreading across the Ten Heavens,\nFive auroras entwining,\nCrowning my body,\nTransforming with the form,\nNo delay in appearance,\nResponding to the call,\nAscending to the Thearch’s morning.\"*\n\nAfterward, ingest the *Flying Mystery Life Talisman of Aurora Essence and Jade Radiance*, lie down with the head to the north, stretch the four limbs upward, close the eyes, and visualize the body transforming into a five-colored cloud. The cloud-qi swirls, merging with qi to ascend lightly, drifting and rising into the void, dispersing to fill the heavens, circling without bounds, then returning from the emptiness. Rub the palms until warm, wipe the face twenty-seven times, then from the top down to the feet three times. Shake the head seven times, face north, and softly invoke:\n\n*\"Five colors transform the radiance,\nBecoming flying clouds,\nMerging with the body’s qi,\nTogether ascending the Cavern-Gate,\nRiding the auroras to entwine the morning,\nAscending to meet the Three Primordials.\"*\n\nAfterward, swallow qi seven times and stop.\n\nPracticing this for seven years without daily lapse, cloud-qi will descend in resonance, responding to qi and gathering in echo. The body transforms and the form changes, merging with qi as mist, riding clouds to fly, ascending to the Thearch’s morning. This is the most wondrous Way, the Jade Scroll of the Highest Thearch. Secretly uphold and cultivate it; be cautious not to show it to others. Heaven’s statutes warn: transmit only with utmost care.\n\n**Second Transformation: Light**\nTransform the body into light, illuminating the chamber’s interior, shining brilliantly across the Eight Wastes, riding the dark to ascend into the Grand Void.\n\nPractice this Way on the new moon, the third, ninth, fifteenth, and twenty-fifth days of the month, at noon. Enter the chamber, burn incense on both sides, settle the spirit and stabilize qi, close the eyes and meditate. Visualize the essence-light of the sun’s center, five-colored flowing auroras blazing in the east. Within the light, there is also purple qi, large as the eye’s pupil, shining brilliantly amid the five lights, flowing and dazzling across the heavens.",
      "overlap_context": "eat Brilliance,\nThe Yellow Elder governs the Central True.\nChanting the Jade Thearch’s chapters,\nThe wondrous resonance stirs the Cavern-Neighbors.\nThe red radiance flees into the distant desolation,\nThe Great Unity augments the kalpic years.\nDelivered by talismans, they ascend the Purple Chamber,\nSeven ancestors escape suffering’s culmination.\nDrifting above the Profound Blossom,\nThe numinous wind scatters purple mist.\nBlending the Three and Five’s qi,\nRevolving and uniting to complete my body.",
      "start_char": 3877,
      "end_char": 5150,
      "start_sentence": 151,
      "end_sentence": 202,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.97409462928772,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真上清神州七转七变舞天经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "便阴呼日魂内名曰：日魂珠景照韬绿映回霞赤童玄炎飙象。 凡十六字。 毕，思见日光下降兆身，入左目瞳中，须臾，紫炁匝冠内外。 次存月中精光五色流精，朗映西方，月光之中又有黄炁，大如目瞳，在月光之内，流烂极天。 便阴呼月魄内名曰：月魄暧萧芬艳翳寥婉虚灵兰郁华结翘淳金清荧艮容台标。 凡二十四字。 毕，思月光下降兆身，入右目瞳中，须臾，黄炁匝冠内外，日月二景混合，更相缠绕，匝络兆身。 便叩齿二十四通，祝曰： 日月玄光，圆天俳精，九阳齐化，二烟同生，玄霞流映，注入我形，变景为光，与炁混并，坐在立亡，二真合灵，参驾飞浮，上之玉庭。 毕，服阴阳玉景开明灵符讫，还东首而卧，正伸四体向上，闭目思日中有童阳君，长七寸，冠飞天冠，衣朱绞单衣，姓羲，讳兆灵； 月中有娥景少阴女，长三寸五分，头戴七称进贤宝冠，衣素罗飞裙，姓玄，讳娥精。 日月二真下入兆身，治两眼之瞳。 存已身化为日月五色之光，流烂焕耀，觉体飞轻，豁然蹈空，随光而升，通体匝热，如在日月之中，游历四回，竟天来还。 便摩两掌令热，拭面三七过，将上至下三过，起坐摇头七过。 毕，仰祝曰： 二景流晖，光映五形，内外洞彻，变化立生，与炁同升，与光合精，圆华已布，耀羲持灵，玄真敷散，运我入冥。 毕，咽炁二十四过止。 行此一十八年，目生流电之光，头上常负日月之精，变化易景，与二耀齐并，乘虚御空，造之玉庭。 妙化之道，秘而奉行，不得宣泄，祸延七玄，身没幽泉，万不得仙。 第三之变，当先使其身化为火精，精光流焰，烧炼身形，内外圆匝，从火反生，身被三炼，克登太清，唯使懃念，以招真灵。 行此之道，常以甲午、丙午、戊午、庚午、乙卯、丁卯、己卯、辛卯之日，入室烧香，南向冥目，存头顶之上有青烟之炁，郁郁冠头，思己左目中有炎熏火光曜阳君，长七寸，姓祝，讳赤精，头着霞阳三梁宝冠，衣绛章单衣，左手执日精，右手执变景通光之符； 右目中有赤圭耀灵通精玉女，长五寸，姓南，讳娥延，头着飞云三角之髻，衣赤罗之□，左手执月珠，右手执神化七变炼精玉符。 二人俱从目中而出，上入青烟之内，玄光映照，洞冠於头。 叩齿三通，祝曰：",
      "translated_text": "Then silently invoke the inner name of the Sun-Soul: \"Sun-Soul Pearl Radiance Shining Green Reflected Rosy Clouds Crimson Youth Dark Flame Whirlwind Image.\" These sixteen characters in full. Once done, visualize the sunlight descending upon your form, entering your left eye’s pupil. After a moment, purple qi envelops your crown inside and out.\n\nNext, visualize the essence-light of the moon’s center, five-colored flowing essences shining brilliantly in the west. Within the moonlight, there is also yellow qi, large as the eye’s pupil, glowing amid the lunar radiance, flowing and dazzling across the heavens. Then silently invoke the inner name of the Moon-Spirit: \"Moon-Spirit Warm Mist Fragrant Bloom Veiled Vast Graceful Void Numinous Orchid Luxuriant Blossom Jade Purity Gleaming Gen Upright Terrace Mark.\" These twenty-four characters in full. Once done, visualize the moonlight descending upon your form, entering your right eye’s pupil. After a moment, yellow qi envelops your crown inside and out. The twin luminaries of sun and moon merge, intertwining and coiling around your body.\n\nThen click your teeth twenty-four times and recite the incantation: \"Sun and Moon’s mysterious light, round heaven’s paired essence, nine yangs transform as one, twin vapors arise together. Dark auroras flow and shine, pouring into my form. Transform radiance into light, blending with qi. Sitting or standing, vanish—twin perfected ones unite in spirit. Mounting the three steeds, soar and float, ascending to the Jade Court.\"\n\nOnce done, ingest the Yin-Yang Jade Radiance Opening Brightness Numinous Talisman. Then lie down facing east, stretching your limbs upward, close your eyes, and visualize within the sun the Youthful Yang Lord, seven inches tall, wearing a flying celestial crown and a crimson silk robe, surnamed Xi, named Zhao Ling. Within the moon, visualize the Maiden of Moonlight, the Lesser Yin Woman, three inches and five parts tall, her head adorned with a seven-tiered \"Advancing Worth\" treasure crown, wearing a white silk flying skirt, surnamed Xuan, named E Jing. The twin perfected ones descend into your body, governing the pupils of your two eyes.\n\nVisualize your own body transforming into the five-colored light of sun and moon, flowing and blazing brilliantly. Feel your body become weightlessly buoyant, suddenly treading the void, ascending with the light. Your entire body envelops in warmth, as if dwelling within the sun and moon, journeying through the four directions, traversing the heavens, then returning. Then rub your palms until warm, wipe your face twenty-one times, stroke from top to bottom three times, rise and shake your head seven times.\n\nOnce done, look up and recite the incantation: \"Twin radiance flows and shines, light illuminating the five forms. Inside and out, thoroughly permeated, transformation arises instantly. Ascending with qi, uniting essence with light, the round blossom unfurls, bearing the luminous one’s spirit. Dark perfection spreads and scatters, carrying me into the unseen.\"\n\nOnce done, swallow qi twenty-four times and stop. Practicing this for eighteen years, your eyes will emit lightning-like radiance, and your head will perpetually bear the essence of sun and moon. Transforming and altering your radiance, you will equal the twin luminaries, riding the void and commanding the sky, ascending to the Jade Court.\n\nThis wondrous transformation Way must be secretly upheld and practiced; do not reveal it. If divulged, calamity will extend to the Seven Mysteries, and your body will sink into the dark springs—you will never attain immortality.\n\n**Third Transformation: Fire**\nFirst, cause your body to transform into the essence of fire, its radiant light flowing with flames, refining and tempering your form inside and out. From fire, rebirth arises. Your body undergoes the Three Refining Trials, enabling ascent to the Grand Clarity. Only through diligent focus can you summon the true numen.\n\nPractice this Way on the days of *jia-wu*, *bing-wu*, *wu-wu*, *geng-wu*, *yi-mao*, *ding-mao*, *ji-mao*, and *xin-mao*. Enter the chamber, burn incense, face south, and close your eyes in meditation. Visualize above your head a qi of blue smoke, thickly crowning your head. Then visualize within your left eye the Blazing Yang Lord of Firelight, seven inches tall, surnamed Zhu, named Chi Jing, his head adorned with a three-beamed \"Rosy Dawn\" treasure crown, wearing a crimson silk robe. In his left hand, he holds the Sun Essence; in his right, the Talisman of Transforming Radiance and Pervading Light. Within your right eye, visualize the Crimson Jade Radiant Numinous Perfected Jade Maiden, five inches tall, surnamed Nan, named E Yan, her head adorned with a three-cornered \"Flying Cloud\" topknot, wearing a crimson silk garment. In her left hand, she holds the Moon Pearl; in her right, the Jade Talisman of Seven Transformations Refining Essence.\n\nThe two emerge from your eyes and ascend into the blue smoke, their mysterious light shining and illuminating your crown. Click your teeth three times and recite the incantation:",
      "overlap_context": "ascend into the Grand Void.\n\nPractice this Way on the new moon, the third, ninth, fifteenth, and twenty-fifth days of the month, at noon. Enter the chamber, burn incense on both sides, settle the spirit and stabilize qi, close the eyes and meditate. Visualize the essence-light of the sun’s center, five-colored flowing auroras blazing in the east. Within the light, there is also purple qi, large as the eye’s pupil, shining brilliantly amid the five lights, flowing and dazzling across the heavens.",
      "start_char": 5150,
      "end_char": 6005,
      "start_sentence": 203,
      "end_sentence": 226,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.120356798171997,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真上清神州七转七变舞天经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "炎精二神，化生流火，炼体变景，乘烟飞扬，混合元炁，洞入火乡，桃君 授符，命籍永昌。 毕，服变景通光、神化七变炼精二符。 服毕，解衣带，散发，南首而卧，正伸四体向上，闭目鼻引青烟之炁，咽之二十一过，毕。 次口吐赤炁四十五通，吐炁之时，以目存炁作火精冠身，兆已在火中，觉体通热，有微汗佳。 便起南向，三过呼左目神赤精，三过呼右目神娥延，二神共以大炎之烟，炼度我身。 便摩两掌令热，拭目四十五过，将面至脚七过。 毕，仰祝曰： 变炼五神，体骨凝生，玄光流焰，飞迅炎精，三回七转，吾道能明，微思洞想，览察幽灵，散光天穷，朗曜紫庭。 毕，咽炁三过止。 此火炼变形之道，能常思苦祝，行之七年，两目之中则生流电之光，书符於五心，入火不然，吐炁成烟，冬能入水，裸身不寒，役召六甲，回转天关，乘云御空，白日升晨。 第四之变，与气浮沉，炼身化水，九河为俦，引炁成涛、吐炁成流，制御蛟龙，召役水侯，万丈之渊，可得入游，子能行之，极天不休。 凡修此道，当以月一日、三日、九日、十八日、二十七日，一月五日，以太阴九河帝君宴景旸谷，上戏玄精，游会之时也。 兆至其日，当以夜半入室烧香，北向冥目，内思九河帝君，姓萧，讳冯命，头冠游天玉精之冠，衣五色杂彩章衣，左手执金铃，右手执玉珰，治在扶桑旸谷清水上宫，坐金床玉榻，五色帏帐，内外光明，侍玉女童，各二十四人，日月之道，经纬其庭。 兆当审思，每使分明。 旋顷，存见九河帝君，执命河九源宝章之符，来入兆身，治於脐下丹田宫中。 思东方青龙，运东极渌波之水； 西方白龙，运西海素流洞清之源； 南方赤龙，运南海丹洪万丈之泉； 北方黑龙，运北海玄阴极源之澜； 中央黄龙，运黄炁阳精玄注玉芝五色之水，共来陶灌兆身。 觉体小寒，便三呼九河帝君冯命，长治我身丹田之中，命龙运水灌炼我身。 便服命河九源宝章之符，叩齿十二通，仰祝曰： 五帝神龙，运取四海，五芝洪泉，以炼我形，我形得化，步行水源，沉沦溟波，无极之津，九河开道，蛟龙导前，十二河伯，皆卫我身，无使魍魉，妄当我真。 毕，还北首，正卧向上，冥目，又思兆身乘五色之龙，入於西海之中，涉水步川，如之路行，扬涛迅浪，意不为难，游洞水下，极意周旋，常存帝君在兆眼前。 既竟来还，便起，引东方九方九炁、南方九炁、西方九炁、北方九炁、中央九炁，咽之毕，两手相摩令热，拭面二九过，又仰祝曰： 三河四海，总统九江，长波万里，洞渊无穷，神真出游，控御五龙，河伯水帝，通我桥梁，鲸鲵开道，魍魉灭亡，清河玉女，扶将送迎。 毕，又咽五炁止。 此水炼变形之道，修行五年，则画地为江，唾地成渊，身入海底，啸御蛟龙，乘涛运流，适意所从，役使水官，河伯司迎，乘云飞升，上登太空。 第五之变，当化身为龙，匡御五星，炼易形容，乘云宴景，上登玄宫。 修此之道，当正中入室，南向冥目，思岁星在我左，太白在我右，荧惑在我前，辰星在我后，镇星在头上，五星缠绕我形躯。 须臾之顷岁星化为青炁，太白化为白炁，荧惑星化为赤炁，辰星化为黑炁，镇星化为黄炁，五气郁勃，化成五色之云，冠覆室内。",
      "translated_text": "The two Fire Essence spirits transform and generate flowing flames, refining the body and altering its radiance. They ride the blue smoke and soar, merging with the primordial qi, penetrating deeply into the Fire Realm. The Peach Lord bestows the talismans, and the register of life endures forever.\n\nWhen finished, ingest the two talismans: the Talisman of Transforming Radiance and Pervading Light, and the Jade Talisman of Seven Transformations Refining Essence. After ingestion, loosen your clothing and belt, let down your hair, lie with your head to the south, stretch your four limbs upward, close your eyes, and draw in the qi of the blue smoke through your nose, swallowing it twenty-one times. Then exhale red qi forty-five times. As you exhale, visualize the qi forming a fire essence that crowns your body, and see yourself within the fire until your body feels thoroughly warm, with a slight sweat being ideal.\n\nThen rise, face south, and call three times to the spirit of your left eye, Chi Jing, and three times to the spirit of your right eye, E Yan. The two spirits together refine and deliver my body with the great flaming smoke.\n\nNext, rub your palms until warm and wipe your eyes forty-five times, then stroke your face down to your feet seven times.\n\nWhen finished, look up and recite the incantation:\nTransform and refine the five spirits, solidify bones and generate life. Mysterious light flows with flames, swiftly flying Fire Essence. Three cycles and seven turns, my Dao becomes luminous. Subtle contemplation and profound visualization reveal and inspect the hidden numinous. Scatter light to the ends of heaven, brightly illuminating the Purple Court.\n\nWhen finished, swallow the qi three times and stop.\n\nThis is the method of fire refinement and bodily transformation. If one constantly contemplates and earnestly recites it, practicing for seven years, flowing lightning-like light will emerge from the eyes. Inscribing talismans upon the five centers, one may enter fire without burning, exhale qi to form smoke, and in winter enter water without feeling cold. One may command the Six Jia, revolve the Celestial Pass, ride clouds and ascend through the void, and ascend to the dawn in broad daylight.\n\nThe fourth transformation involves floating and sinking with qi, refining the body into water, with the Nine Rivers as companions. Drawing in qi forms waves, exhaling qi forms currents. One may command and summon dragons, employ the Water Lords, and roam the depths of ten-thousand-fathom abysses. If you can practice this, you may ascend to the heavens without ceasing.\n\nWhenever cultivating this method, choose the first, third, ninth, eighteenth, and twenty-seventh days of the lunar month—five days in total—when the Nine Rivers Emperor of Grand Yin is feasting in the Bright Valley of Yang and playing with Mysterious Essence during the gathering.\n\nOn those days, at midnight, enter your chamber, burn incense, face north, and close your eyes in meditation. Visualize the Nine Rivers Emperor, surnamed Xiao, named Feng Ming, wearing a \"Roaming Heaven Jade Essence\" crown, clad in a five-colored embroidered robe. In his left hand, he holds a golden bell; in his right, a jade pendant. He governs the Upper Palace of Clear Water in the Bright Valley of Fusang, seated upon a golden bed and jade couch within five-colored curtains, the interior and exterior radiant with light. Twenty-four jade maidens attend him, and the paths of the sun and moon weave through his court.\n\nFocus your thoughts clearly. After a moment, visualize the Nine Rivers Emperor holding the Precious Talisman of the Nine Sources of the Life River, entering your body and residing in the Cinnabar Field Palace below your navel.\n\nVisualize the Azure Dragon of the East, circulating the green waves of the Eastern Limit; the White Dragon of the West, circulating the pure and clear sources of the Western Sea; the Crimson Dragon of the South, circulating the ten-thousand-fathom crimson surges of the Southern Sea; the Black Dragon of the North, circulating the dark yin extreme currents of the Northern Sea; and the Yellow Dragon of the Center, circulating the yellow qi, yang essence, and mysterious infusion of the Five-Colored Jade Mushroom waters. Together, they come to refine and irrigate your body.\n\nWhen you feel a slight chill, call three times to the Nine Rivers Emperor Feng Ming, asking him to govern long within your Cinnabar Field and command the dragons to circulate water and refine your body.\n\nThen ingest the Precious Talisman of the Nine Sources of the Life River, click your teeth twelve times, and recite the incantation while looking up:\nFive Divine Dragons, draw from the four seas. Five Mushroom Grand Springs refine my form. My form transformed, I walk the water’s source, sink into the dark waves of the boundless depths. The Nine Rivers open the path, dragons lead the way. Twelve River Earls all guard my body, preventing specters from falsely opposing my true self.\n\nWhen finished, turn your head to the north, lie straight on your back, close your eyes in meditation, and visualize your body riding the five-colored dragons into the Western Sea. Wade through the waters and walk the rivers as if on a road, riding swift waves without difficulty. Roam beneath the deep waters, freely circling, always keeping the Emperor before your eyes.\n\nWhen the journey is complete and you return, rise and draw in the nine qi of the nine directions of the East, the nine qi of the South, the nine qi of the West, the nine qi of the North, and the nine qi of the Center, swallowing them all. Rub your palms until warm, wipe your face eighteen times, then recite while looking up:\nThree Rivers and Four Seas govern the Nine Rivers. Long waves stretch ten thousand miles, deep abysses without end. Divine perfected ones roam, controlling and riding the five dragons. River Earls and Water Emperors build bridges for me. Whales and leviathans clear the path, specters perish. Jade maidens of the Clear River support and escort me.\n\nWhen finished, swallow the five qi and stop.\n\nThis is the method of water refinement and bodily transformation. Practicing for five years, one may draw on the ground to form rivers, spit to create abysses, enter the sea floor, whistle to command dragons, ride waves and currents at will, employ water officials, and have River Earls attend and welcome. Riding clouds to ascend, one may mount the great void.\n\nThe fifth transformation involves transforming the body into a dragon, riding and commanding the Five Stars, refining and altering one’s form, ascending on clouds to feast in the radiant light, and mounting the Mysterious Palace.\n\nTo cultivate this method, enter your chamber at noon, face south, and close your eyes in meditation. Visualize Jupiter to your left, Venus to your right, Mars before you, Mercury behind you, and Saturn above your head, the Five Stars coiling around your body.\n\nAfter a moment, Jupiter transforms into blue qi, Venus into white qi, Mars into red qi, Mercury into black qi, and Saturn into yellow qi. The five qi surge and transform into five-colored clouds, crowning and covering the chamber.",
      "overlap_context": "lize the Crimson Jade Radiant Numinous Perfected Jade Maiden, five inches tall, surnamed Nan, named E Yan, her head adorned with a three-cornered \"Flying Cloud\" topknot, wearing a crimson silk garment. In her left hand, she holds the Moon Pearl; in her right, the Jade Talisman of Seven Transformations Refining Essence.\n\nThe two emerge from your eyes and ascend into the blue smoke, their mysterious light shining and illuminating your crown. Click your teeth three times and recite the incantation:",
      "start_char": 6005,
      "end_char": 7241,
      "start_sentence": 227,
      "end_sentence": 258,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.57511115074158,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真上清神州七转七变舞天经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "觉我坐在云炁之中，左引青炁十八息，右引白炁十二息，前引赤炁十六息，后引黑炁十息，仰引黄炁十二息。 觉体匝热，叩齿三十二通，仰呼：东方岁星皇君，讳证澜，字清凝； 南方荧惑星皇君，讳宝容，字飞云； 西方太白星皇君，讳维停，字散融； 北方辰星皇君，讳华瓶，字玄罗； 中央镇星皇君，讳寥凌，字振寻。 五星真皇，共乘飞云五色玄舆，来降我身，流精陶注，哺我龙津，饮宴太和，胎息自然，龙振体化，郁然登玄。 毕，服龙胎保精之符，还东首而卧，正伸四体向上，闭目存五色之云覆荫我上，思我身化为青龙，冉冉随云而升，周游五岳，上造三清，须臾之间，还於寝床。 竟，急摩两掌令热，拭面三七过，摇身三七过，又祝曰： 五神回化，变景升飞，游戏五岳，上之太微，周旋天地，得道来归，长保自然，万劫不衰。 毕，咽炁三七过止。 如此五年，修不废日，神龙降见，随意所欲，化为龙身。 此上化之道，紫晨妙真，秘而奉行，白日登晨。 第六之变，当行出有入无之道，解形遁变流景之法。 每以六戊之日，入室南向、冥目内思，存左目为奔星，右目为迅电，光精焕赫，流电郁冥。 存见光中有一真人，形长九寸，头冠通天耀光玉冠，衣五色流黄飞云之衣，姓端，讳流烂，左手执神虎策文，右手执解形七变之符，此无英童子也。 生在流光之内，以符玄授於兆身，便叩齿三十六通，祝曰： 流光奔移，焕赫天威，五形解变，七景齐飞，出有入无，上造紫微，得与三晨，长保光辉。 毕，服解形七变之符，以释根解滞。 毕，南首而卧，向上冥目，思兆身在流光之中，随光奔移，觉体轻扬，如升如飞，须央之间，奔星迅电之光入兆身中，光明洞赫，体中匝热。 思见真人还兆绛宫中，便三呼：无英童子端流烂，为我解形遁变，随光流焕，形逐炁变，骨随光散。 便摩手，拭目及面三十六过，仰祝曰： 变形散炁，分影为光，光奔万里，形影俱藏，二炁相乘，流淇八荒，得御玄舆，上造帝堂。 毕，咽炁三十六过止。 此解变之道，帝君所行，已得帝真，万金宝秘，慎勿轻传。 修之七年，身变七十二光，流精紫章，洞映内外，万化无方，能隐能显，能见能藏，得有此法，上为真皇。 第七之变，其夫至精，纵体空洞，缠络七星，召风降云； 啸叱群灵，吐纳玄芝，改容炼形，皓华易色，朽齿更生，含真内发，万岁反婴，神州七转，乃升玉清，兆欲寻之，苦思幽冥，积感神降，道自见形。 欲修其化，当以月七日、十四日、二十一日，一月三过行之，此以七变之日，紫晨七炼之时也。 每至其日正中、夜半二时，入室先读之七转之章，竟，便北向，思天北斗九真帝君内妃隐讳。 第一星帝君变隐逃元内妃，名太一法坦，字牵正； 第二星帝君保胎化形内嫔，名太一三瓫，字罗朱婴； 第三星帝君六遁七星上元丹母，名太一云夷，字双兆； 第四星帝君匿景藏光中元内妃，名太一七列，字丘单婴； 第五星帝君变体易景斗中大女，名太一郁书，字丘阑； 第六星帝君隐迹散象斗中中女，名太一炁精，字抱定陵； 第七星帝君分景万形斗中少女； 名太一郁默，字天凡淑； 第八帝君化日月水火斗中高皇左夫人，名太乙启珠，字络茂华；",
      "translated_text": "Perceiving myself seated amidst the cloud-qi, I draw in blue qi with eighteen breaths from the left, white qi with twelve breaths from the right, red qi with sixteen breaths from the front, black qi with ten breaths from behind, and yellow qi with twelve breaths from above. Feeling my body suffused with warmth, I click my teeth thirty-two times and call out, facing upward:\n\n\"Eastern Jupiter Star Sovereign, whose taboo name is Zheng Lan and style is Qing Ning;\nSouthern Mars Star Sovereign, whose taboo name is Bao Rong and style is Fei Yun;\nWestern Venus Star Sovereign, whose taboo name is Wei Ting and style is San Rong;\nNorthern Mercury Star Sovereign, whose taboo name is Hua Ping and style is Xuan Luo;\nCentral Saturn Star Sovereign, whose taboo name is Liao Ling and style is Zhen Xun.\nFive Star Perfected Sovereigns, together you ride the five-colored cloud-palanquin of the Mysterious Chariot, descending into my body, streaming your essence to infuse me, nourishing my dragon-saliva, feasting in Great Harmony. My embryonic breathing arises naturally, my dragon-spirit stirs my transformed body, and I ascend in radiance to the Mysterious Palace.\"\n\nWhen finished, I ingest the talisman for dragon-embryo essence-preservation, then lie down with my head to the east, stretching my four limbs upward. Closing my eyes, I visualize the five-colored clouds shading me above, imagining my body transforming into a green dragon, slowly rising with the clouds, roaming the Five Peaks, ascending to the Three Clarities. In but a moment, I return to my bed. Concluding, I swiftly rub my palms until warm, wiping my face twenty-one times, shaking my body twenty-one times, and recite the incantation:\n\n\"Five spirits return and transform, radiant ascent in flight,\nRoaming the Five Peaks, ascending to the Supreme Microcosm,\nCircling heaven and earth, attaining the Dao and returning,\nEternally preserving the natural, undiminished for ten thousand kalpas.\"\n\nWhen finished, I swallow qi twenty-one times and stop. Practicing thus for five years without missing a day, the divine dragon will descend and appear, granting all desires, transforming into a dragon-body. This is the supreme method of transformation, the Purple Dawn’s Wondrous Perfection—secretly revered and practiced, one ascends at dawn.\n\nThe sixth transformation involves the Dao of moving from existence into non-existence, the method of dissolving form, vanishing, and flowing with radiance. On each day of the six *wu* cyclical signs, enter your chamber facing south, close your eyes in meditation, and visualize your left eye as a shooting star and your right eye as swift lightning, their luminous essence blazing, streaming with dazzling brilliance in the dark. Visualize within the light a perfected person, nine inches tall, wearing a Heaven-Piercing Radiant Jade Crown, clad in a five-colored, flowing yellow cloud-garment. His surname is Duan, taboo name Liu Lan, holding in his left hand the Spirit-Tiger Whip Script and in his right the Talisman of Seven Dissolutions for Form-Transformation—this is the Lad of Non-Florescence.\n\nBorn within the streaming light, he bestows the Mysterious Talisman upon my body. I then click my teeth thirty-six times and invoke:\n\n\"Streaming light swiftly shifts, blazing with celestial might,\nFive forms dissolve and transform, seven radiant scenes take flight,\nExiting existence, entering non-existence, ascending to the Purple Tenuity,\nAttaining union with the Three Dawns, eternally preserving luminous splendor.\"\n\nWhen finished, I ingest the Talisman of Seven Dissolutions for Form-Transformation to release root-bound stagnation. Then, lying with my head to the south and eyes closed, I visualize my body within the streaming light, moving swiftly with its flow. Feeling my body light and buoyant, as if ascending and flying, in but a moment the light of the shooting star and swift lightning enters my body, its brilliance resplendent, my body suffused with warmth. I visualize the perfected person returning to my Crimson Palace and call thrice:\n\n\"Lad of Non-Florescence, Duan Liu Lan, dissolve my form and vanish me,\nFollowing the light’s flow and radiance, my form changes with the qi, my bones scatter with the light.\"\n\nThen, rubbing my hands, I wipe my eyes and face thirty-six times and invoke, facing upward:\n\n\"Transforming form, dispersing qi, dividing shadow into light,\nLight races ten thousand leagues, form and shadow both concealed,\nTwo qi ride one another, streaming through the eight wilds,\nAttaining the Mysterious Chariot, ascending to the Imperial Hall.\"\n\nWhen finished, I swallow qi thirty-six times and stop. This is the Dao of dissolution and transformation, practiced by the Thearch-Lord. Having attained the Perfected Thearch, it is a treasure beyond ten thousand gold—guard it well and do not transmit it lightly. Cultivating this for seven years, one’s body transforms into seventy-two lights, streaming with purple essence, illuminating within and without, capable of myriad transformations without limit—able to conceal, able to manifest, able to see, able to hide. Attaining this method, one ascends as a Perfected Sovereign.\n\nThe seventh transformation is the utmost essence: the body unbound, empty and cavernous, entwined with the Seven Stars, summoning wind and descending clouds; whistling and commanding the host of spirits, exhaling and inhaling the Mysterious Mushroom, refining form and altering appearance, exchanging withered for radiant hue, regenerating decayed teeth, containing the Perfected within and emitting it, reverting to infancy after ten thousand years, revolving through the Seven Transformations of the Divine Continent—only then does one ascend to the Jade Clarity. If one seeks this, meditate deeply in seclusion, accumulating resonance until the spirit descends and the Dao manifests of itself.\n\nTo cultivate this transformation, perform it thrice monthly on the seventh, fourteenth, and twenty-first days—these are the days of the seven transformations, the times of the Purple Dawn’s seven refinements. On each of these days at noon and midnight, enter your chamber and first recite the Chapter of Seven Revolutions. When finished, face north and visualize the hidden taboo names of the Nine Perfected Sovereigns and Inner Consorts of the Northern Dipper:\n\nFirst Star Sovereign, who transforms and conceals the primordial, Inner Consort: named Tai Yi Fa Tan, styled Qian Zheng;\nSecond Star Sovereign, who preserves the embryo and transforms form, Inner Concubine: named Tai Yi San Peng, styled Luo Zhu Ying;\nThird Star Sovereign, Mistress of the Six Vanishings and Seven Stars, Upper Prime Elixir Mother: named Tai Yi Yun Yi, styled Shuang Zhao;\nFourth Star Sovereign, who conceals radiance and hides light, Middle Prime Inner Consort: named Tai Yi Qi Lie, styled Qiu Shan Ying;\nFifth Star Sovereign, who transforms body and alters radiance, Great Maiden of the Dipper’s Center: named Tai Yi Yu Shu, styled Qiu Lan;\nSixth Star Sovereign, who conceals traces and disperses images, Middle Maiden of the Dipper’s Center: named Tai Yi Qi Jing, styled Bao Ding Ling;\nSeventh Star Sovereign, who divides radiance into myriad forms, Maiden of the Dipper’s Center: named Tai Yi Yu Mo, styled Tian Fan Shu;\nEighth Sovereign, who transforms sun, moon, water, and fire, High Thearch’s Left Consort of the Dipper’s Center: named Tai Yi Qi Zhu, styled Luo Mao Hua;",
      "overlap_context": "Palace.\n\nTo cultivate this method, enter your chamber at noon, face south, and close your eyes in meditation. Visualize Jupiter to your left, Venus to your right, Mars before you, Mercury behind you, and Saturn above your head, the Five Stars coiling around your body.\n\nAfter a moment, Jupiter transforms into blue qi, Venus into white qi, Mars into red qi, Mercury into black qi, and Saturn into yellow qi. The five qi surge and transform into five-colored clouds, crowning and covering the chamber.",
      "start_char": 7241,
      "end_char": 8463,
      "start_sentence": 259,
      "end_sentence": 297,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.78345561027527,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真上清神州七转七变舞天经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "第九帝君化金石山河斗中高皇右夫人，名太一爱条，字云精玄。 九君内妃精光焕赫，朗曜北方，便祝曰： 玄斗神皇，内妃九真，流精下注，陶灌我身，变形七转，上升斗辰，炼胎化精，内发金仙。 毕，服七元曜灵玉符，还北首而卧，闭目思己身升入斗星中央华盖之下，随斗运转，回历四方。 存见斗中三台真人，形长二寸四分，姓回元，讳回灵，朱冠绛衣，授我七元曜灵玉符。 觉我服符，自然飞升，来还寝床，起北向，叩齿七通，三呼斗中真人回灵，便仰祝曰： 太一九女，散形玄阿，神光回曜，灵风发华，左握七精，右御飞霞，流铃九变，十化七歌，分形为千，唾地成河，所愿所求，无令艰难，灵章七转，威制天魔，顺敬者仙，逆道者殂。 毕，咽炁二七过止。 此神州七转□天之道，纵景万变之法，炼形化仙玉诀，行之九年，九妃宴景，同举飞空，体发奇光，面映金容，七星络躯，乘云升晨。 七变□天，乃上皇紫晨始学玉真炼化之道，九天父母授以变景七转之章，解结释滞，披散七玄，使炼形易体，上升玉宫。 修之洞究，积感始天，遂位登上皇，受号紫晨。 其道高妙，不得妄传，轻泄宝文，殃延上祖，考及己身，十苦八毒，万劫不原。 有骨分之人，得此神文，秘而奉行，克日成真。 第一云精玉景飞玄生符 行事以朱书青纸服之，朱书青缯佩之。 五霞之精，能知五霞上清金华，行之七年，同景曜罗。 第二阴阳玉景开明灵符 行事朱书青纸服之，朱书青缯佩之。 此日月二景之精，能知二景之精，隐景藏形，行之十八年，上升紫庭。 第三变景通光神化七变炼精玉符 行事青书白纸服之，青书白缯佩之。 此太阳之精，能知其化，炼身易形，景炁洞虚，与火齐并，行之七年，上升帝庭。 第四命河九源宝章符 行事墨书白纸服之，墨书白素佩之。 此洪波玉精之炁，能知九河内名，变化分形，上游九源，下沉水灵，行之五年，万变立成。 第五龙胎保精符 行事黄书白纸服之，黄书白缯佩之。 此龙精九化之炁，能知龙胎，变景升崖，上游九玄，下戏九疑，行之五年，历劫不衰。 第六解形七变符 行事青书黄纸服之，青书黄缯佩此雷电始凝之精，此道极妙，分影散形，流光万化，与真合冥。 第七七元耀灵玉符 行事朱书青纸服之，朱书青缯佩之。 此七星之精，变化隐藏，升景玉庭。 右七变之符，九天父母以授上皇紫晨君，变影炼形之道，太真之所秘，九天之所宝。 紫晨君所修，得上登帝皇之号。 其道尊妙，众经之宗，七转既备，天真齐同，自无金骨玉体，不得参闻。 若玄名东华，绿字上清，得见妙篇，秘而修行。 当依太真之科，七千年听得三传，七百年内有其人，亦听传之。 受者当责真珠一斤，青纹三十二尺，上金五两，以盟九天不泄之信。 爱财慕法，罪同贪欲，轻宝受经，诚感玉皇。 丹以告感，信以明心，苟无信心，何为其於浮好乎。 如此之学，将沈万丈之谷，而望攀云之路，岂不邈哉。 轻财尊道，道虽幽寂，阴察已彰，将有登峻之阶，造真有由也。 今撰此篇，以传应仙之人，不施於凡才。 轻泄宝文，宣露上真，七祖父母充责鬼官，运蒙山之石，填积夜之河，万劫还生不人之道，身被风刀之拷，自然失经，万不得仙。",
      "translated_text": "Ninth Sovereign, who transforms metals, stones, mountains, and rivers, High Thearch’s Right Consort of the Dipper’s Center: named Tai Yi Ai Tiao, styled Yun Jing Xuan.\n\nThe nine consorts’ inner radiance blazes resplendent, shining brilliantly upon the northern quarter. Then they invoke, saying:\n“Mysterious Dipper Divine Thearch, nine perfected inner consorts,\nStreaming essence descends to pour, refining and irrigating my body.\nTransforming form through seven cycles, ascending to the Dipper’s stars,\nRefining the embryo and transmuting essence, inwardly manifesting as Golden Immortals.”\n\nWhen finished, ingest the Seven Primes’ Radiant Jade Talisman. Lie with head to the north, close the eyes, and visualize one’s body ascending into the Dipper’s central canopy, revolving with the Dipper’s motion and traversing the four directions. Envision the Three Terraces Perfected within the Dipper, their forms two inches and four fen in height, surnamed Hui Yuan, named Hui Ling, wearing vermilion caps and crimson robes, bestowing the Seven Primes’ Radiant Jade Talisman. Upon awakening, having ingested the talisman, one naturally ascends in flight, returning to the bed. Rise facing north, knock the teeth seven times, and thrice call upon the Dipper’s Perfected Hui Ling. Then raise the head and invoke, saying:\n“Tai Yi’s nine maidens, scattering forms upon the Mysterious Vault,\nDivine radiance revolves and shines, numinous winds emit blossoms.\nLeft hand grasps the Seven Essences, right hand steers the flying auroras,\nFlowing bells undergo nine transformations, ten evolutions and seven songs.\nDividing form into thousands, spitting upon the earth to form rivers—\nWhatever is wished or sought, let there be no hardship.\nThe numinous scripture cycles sevenfold, its might subduing heavenly demons.\nThose who comply and revere shall become immortals; those who oppose the Dao shall perish.”\n\nWhen finished, swallow qi thirty-four times and stop.\n\nThis is the Way of the Seven Cycles of the Divine Continent, the method of myriad transformations of radiance, the jade formula for refining form and transmuting into immortals. Practicing it for nine years, the nine consorts feast upon radiance, together ascending into flight. The body emits wondrous light, the face reflects a golden countenance, the Seven Stars entwine the body, and one rides the clouds to ascend at dawn.\n\nThe Seven Cycles of Transformation are the Way of the Supreme Thearch of Purple Dawn, who first studied the jade-perfected refining and transforming Dao. The Nine Heavens’ Father and Mother bestowed upon him the scripture of the Seven Cycles of Radiance Transformation, untying knots and releasing obstructions, dispersing the Seven Mysteries, enabling the refinement of form and alteration of body to ascend to the Jade Palace. Through profound cultivation and accumulated resonance with the Primordial Heaven, he attained the rank of Supreme Thearch and received the title Purple Dawn. This Way is lofty and wondrous; it must not be recklessly transmitted. To carelessly divulge this treasure text brings calamity upon one’s ancestors and oneself, subjecting them to ten sufferings and eight poisons, with no deliverance for ten thousand kalpas. Those of destined bone who obtain this divine scripture, keeping it secret and practicing it, shall attain perfection in due time.\n\n**First: Cloud Essence Jade Radiance Flying Mystery Life Talisman**\nPerform the ritual by writing in vermilion on blue paper and ingesting it; write in vermilion on blue silk and wear it. The essence of the Five Auroras enables knowledge of the Upper Clarity’s Golden Flower of the Five Auroras. Practicing it for seven years, one shares the radiance of the luminous net.\n\n**Second: Yin-Yang Jade Radiance Opening Brilliance Numinous Talisman**\nPerform the ritual by writing in vermilion on blue paper and ingesting it; write in vermilion on blue silk and wear it. This is the essence of the sun and moon’s two radiant forms, enabling knowledge of the two radiant forms’ essence, concealing radiance and hiding form. Practicing it for eighteen years, one ascends to the Purple Court.\n\n**Third: Radiance-Transforming Illuminating Spirit Seven Cycles Refining Essence Jade Talisman**\nPerform the ritual by writing in blue on white paper and ingesting it; write in blue on white silk and wear it. This is the essence of the Great Yang, enabling knowledge of its transformations, refining the body and altering form, radiance and qi penetrating emptiness, equal to fire in brilliance. Practicing it for seven years, one ascends to the Imperial Court.\n\n**Fourth: Life River Nine Sources Treasure Chapter Talisman**\nPerform the ritual by writing in ink on white paper and ingesting it; write in ink on white silk and wear it. This is the qi of the Vast Waves’ Jade Essence, enabling knowledge of the Nine Rivers’ inner names, transforming and dividing form, ascending to roam the Nine Sources, descending to sink into the water spirits. Practicing it for five years, ten thousand transformations are immediately accomplished.\n\n**Fifth: Dragon Embryo Preserving Essence Talisman**\nPerform the ritual by writing in yellow on white paper and ingesting it; write in yellow on white silk and wear it. This is the qi of the Nine Transformations of Dragon Essence, enabling knowledge of the Dragon Embryo, transforming radiance and ascending cliffs, ascending to roam the Nine Mysteries, descending to sport at the Nine Doubts. Practicing it for five years, one remains undiminished through kalpas.\n\n**Sixth: Dissolving Form Seven Cycles Talisman**\nPerform the ritual by writing in blue on yellow paper and ingesting it; write in blue on yellow silk and wear it. This is the essence of the primordial coagulation of thunder and lightning. This Way is supremely wondrous, dividing shadows and dispersing form, streaming light into ten thousand transformations, merging with the Perfected in darkness.\n\n**Seventh: Seven Primes Radiant Jade Talisman**\nPerform the ritual by writing in vermilion on blue paper and ingesting it; write in vermilion on blue silk and wear it. This is the essence of the Seven Stars, enabling transformations, concealment, and ascension to the Jade Court of Radiance.\n\nThe above seven transformation talismans were bestowed upon the Supreme Thearch of Purple Dawn by the Nine Heavens’ Father and Mother, comprising the Way of transforming radiance and refining form, a secret of the Great Perfected and a treasure of the Nine Heavens. Through their cultivation, the Purple Dawn Lord attained the exalted title of Imperial Thearch. This Way is revered and wondrous, the origin of all scriptures. When the seven cycles are complete, one’s celestial perfected nature becomes equal to the heavens. Without a body of golden bones and jade constitution, one may not partake in or hear of it. Only those whose mystical name is Dong Hua and whose green character is Shang Qing may behold this wondrous text and secretly practice it. In accordance with the Great Perfected’s regulations, one may receive three transmissions in seven thousand years; if a suitable person appears within seven hundred years, transmission may also be granted. The recipient must offer one catty of true pearls, thirty-two feet of green damask, and five taels of superior gold as a pledge to the Nine Heavens’ vow of secrecy. Coveting wealth and admiring the Dharma incurs the same sin as greed; lightly valuing treasures and receiving scriptures sincerely moves the Jade Thearch. Cinnabar is used to express resonance, and trust is used to clarify the heart. Without a sincere heart, why engage in superficial admiration? Such learning is like sinking into a ten-thousand-fathom abyss while hoping to climb the path of clouds—how distant it is! Lightly valuing wealth and revering the Dao, though the Dao may be secluded and silent, dark scrutiny will reveal it, leading to the steps of ascending the heights and attaining the Perfected through proper means. This text is now compiled and transmitted to those destined for immortality; it is not bestowed upon the mediocre. To carelessly divulge this treasure text and expose it to the Upper Perfected brings retribution upon one’s seven generations of ancestors and parents, who are consigned to the offices of ghostly officials, made to transport the stones of Mount Meng to fill the River of Night. For ten thousand kalpas, they are reborn outside the human realm, their bodies subjected to the tortures of wind and blades. The scripture is naturally lost, and immortality is utterly unattainable.",
      "overlap_context": "den of the Dipper’s Center: named Tai Yi Yu Shu, styled Qiu Lan;\nSixth Star Sovereign, who conceals traces and disperses images, Middle Maiden of the Dipper’s Center: named Tai Yi Qi Jing, styled Bao Ding Ling;\nSeventh Star Sovereign, who divides radiance into myriad forms, Maiden of the Dipper’s Center: named Tai Yi Yu Mo, styled Tian Fan Shu;\nEighth Sovereign, who transforms sun, moon, water, and fire, High Thearch’s Left Consort of the Dipper’s Center: named Tai Yi Qi Zhu, styled Luo Mao Hua;",
      "start_char": 8463,
      "end_char": 9720,
      "start_sentence": 298,
      "end_sentence": 342,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.33137536048889,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真上清神州七转七变舞天经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "受者秘而慎焉。 凡上清宝经三百卷，玉诀九千篇，符图七千章，皆出元始高上玉帝，禀承自然之章，玄古之道。 学者得其篇目，立登真皇。 其道秘在九天之上，大有之宫，相传玉文，以付上相青童君，封於玉华青宫； 逮至元景元年，撰集一通，以封西城山中。 旧科皆经万劫一传，自六天罢退，三道正明，运度相促，至道应行，改科七千年听传，若七百年内有至心，骨相应玄，录字上清者，皆得依盟而传。 有得此经，克成真人，依次修行，理无不足，道无不成，炁足道备，则白日升晨。 太帝君命扶桑大帝旸谷神王所撰三十一卷独立之诀，皆备天地之运，黄庭玉景，调理五藏，通畅神关，诵之万遍，亦得飞腾。 凡学之士，皆当先受明科，拔罪赎过，披解七玄，令罪灭九阴，福生上清，然后得投金简玉札，奏名青宫，受豁落七元、流金火铃、金真玉光金玄羽章，威制六天三天正法、消魔上经。 次有九真八道灵书紫文，服御日月招致云霞，黄素品格四十四方，曲素诀辞五行招魂，策虚驾无紫度炎光，飞行羽经蹑行七元，三九素语祝命五方，黄炁阳精日月洞明，金当玉佩二景混生，三元玉检固神宝真，神州七转八变□天，契络天地齐回昼冥。 乃得披诵大洞真经三十九章，拔度七祖，受生南宫。 雌一玉检五老宝经，金华玉房隐朝三元。 大有妙经洞玄素灵，太丹隐书五籍宝神。 三奇宝文，万遍升玄，兼御灵飞藏景录形，七星移度披天三关，隐地八术丹景道精，七十二变万化立成，混合帝一五神胎生。 备行众经，道满炁盈，上下相须，大小齐灵，登斋入室，幽思念生，真神降感，三元诣房，越行错缩，神散炁零，空体独学，若魂无形，苟欲贪足，不从本根，轻披三宝，摇动九天，三司所执，结罪四明，不出三年，身没鬼官。 不自忿己，反怨道经，非道负人，自由诸身。 至学之士，参受宝文，当案科品，以次修行，万无不感，理无不全，道无不降，形无不仙，万遍道备，白日升天。 上经三百首，上真各有所禀，亦不悉备，后来积学，亦不得齐於太真之所修也。 世人多混秽炁炁正，故学有次序阶级之科。 若修大帝所撰三十一卷，道备然后自得适其所好尔。 始学之士，不得径造所欲，以亏明科，其考甚重，深各慎之。 小有天王曰：凡修三十一卷，以得次第，丹清上彻，太帝自当遣太极真人，更授子众经俯仰之格。 学者勤精苦念，每使无亏，克得飞腾游宴玉京也。 凡受上经，当检口慎言，不得背彼向此，道说经文，疑惑天真，宣露世间，毁坏同学，冒名贤人，始能胜己，虚诞天灵，攻伐师友，谋反不道，自言有道洞备妙经。 如此皆四司所执，奏言太帝，七祖父母收结鬼官，长闭地狱，身被风刀之考，万不得仙。 学者各宜慎之。 四极科中品曰：经不受，师窃天宝，受无盟信，忽天道。 若於因缘得经，世无经师，得依科赉信诣绝岩之峰，隐盟而受。 若有经师，便诣师盟度，得经而不盟受，轻妄修行，触忤天灵，妄说经目，语於凡学之人者，此考甚重，四极四司之官所执，七祖父母充积夜之河无极之役，身被见事之拷，死充十苦八难，吞火抱剑，以谢轻说经之责，受者明慎科制。 洞真上清神州七转七变舞天经竟",
      "translated_text": "Let the recipient guard it in secrecy and reverence. All the three hundred scrolls of the Supreme Clarity’s precious scriptures, the nine thousand chapters of jade instructions, and the seven thousand sections of talismanic diagrams originate from the Most High Jade Emperor of the Primordial Beginning, who received the natural writ and the Dao of remote antiquity. Should a practitioner obtain even the titles of these texts, they shall ascend at once to the rank of Perfected Sovereign. The Dao is concealed in the Nine Heavens above, within the Palace of Great Existence, where the jade texts are transmitted and entrusted to the Supreme Minister, the Azure Lad of the Blue Palace. Sealed within the Jade Flower Azure Palace, they remained until the first year of the Yuanjing era, when a complete compilation was made and sealed within the Western City Mountain. According to the old statutes, these texts were transmitted but once in ten thousand kalpas. Yet after the Six Heavens were abolished and the Three Ways were rectified, the cosmic reckoning hastened, and the Great Dao was destined to spread. The statutes were thus revised to permit transmission every seven thousand years. If within seven hundred years there appears one of utmost sincerity, whose bones and countenance accord with the mysterious, whose name is recorded in the registers of Supreme Clarity, they may receive the texts in accordance with the covenant.\n\nOne who obtains these scriptures and succeeds in becoming a Perfected may proceed through the practices in proper order; nothing in principle will be lacking, and nothing in the Dao will fail to be accomplished. When qi is full and the Dao complete, one ascends at dawn in broad daylight. The Great Emperor commanded the Solar Valley Divine King of Fusang to compile thirty-one independent scrolls of instructions, which encompass the movements of Heaven and Earth, the Jade Radiance of the Yellow Court, the regulation of the five viscera, and the free flow of the spirit gates. Reciting them ten thousand times also enables one to soar aloft.\n\nAll who undertake this study must first receive the luminous statutes, expiate their transgressions, and redeem their faults, thereby dissolving the seven mysteries and extinguishing their sins in the Nine Yin. Blessings then arise in Supreme Clarity, after which one may present a memorial on golden tablets and jade slips to inscribe their name in the Azure Palace. They shall then receive the liberation of the Seven Primes, the Flowing Gold Fire Bells, the Golden Perfection Jade Radiance Golden Mystery Feathered Chapters, the authoritative methods of the Six Heavens and Three Heavens, and the *Scripture for Subduing Demons*.\n\nNext come the Nine Perfected and Eight Ways’ numinous books of purple writ, which enable the ingestion of sun and moon and the summoning of clouds and rosy dawn. There are the forty-four ranks of the Yellow Plain’s standards, the five-phase soul-summoning incantations of the Curved Silk, the strategies for riding the void and steering the Purple Passage of Flaming Light, the *Feathered Scripture of Flight* and the *Seven Primes’ Treading Steps*, the twenty-seven plain words for invoking the five directions, the Yellow Qi and Yang Essence that illumine sun, moon, and caverns, the Golden Pendants and Jade Girdles that blend the Two Radiant Ones, the Three Primes’ jade tallies that secure the treasure of the spirit, and the seven transformations and eight mutations of the Divine Continent’s *Seven Revolutions and Seven Changes Dancing Heaven Scripture*, which harmonize Heaven and Earth and synchronize day and night.\n\nOnly then may one recite the thirty-nine chapters of the *Great Cavern Perfected Scripture*, deliver one’s seven ancestors, and be reborn in the Southern Palace. There are the *Single Jade Tally and Five Elders’ Precious Scripture*, the *Golden Flower Jade Chamber* where the Three Primes are concealed and courted, the *Wondrous Scripture of Great Existence and Cavern Mystery Plain Numinosity*, the *Five Registers’ Treasure Spirit of the Concealed Elixir*, and the *Three Marvels’ Precious Writ*. Reciting these ten thousand times enables ascent to the Mystery, along with the ingestion of the *Numinous Flight*, the recording of one’s form in the *Hidden Radiance*, the traversal of the Three Celestial Passes through the shifting of the Seven Stars, the Eight Arts of Concealment and the Elixir Radiance’s Dao Essence, the seventy-two transformations and myriad transmutations that are instantly accomplished, and the fusion with the Imperial Unity and the birth of the Five Spirit Embryos.\n\nWhen all scriptures are practiced to completion, the Dao is full and qi abundant; above and below mutually sustain one another, and great and small are equally numinous. Entering the chamber to fast and meditate, one’s profound thoughts arise, and the Perfected Spirits descend in response. The Three Primes visit the chamber, but if one’s steps falter or retreat, spirit disperses and qi scatters. To practice in an empty body alone, like a soul without form, or to covet fulfillment without following the root, to carelessly reveal the Three Treasures and shake the Nine Heavens—such acts are seized by the Three Offices, and sins are bound in the Four Luminaries. Within three years, one’s body is consigned to the offices of ghostly officials. Should one fail to resent one’s own faults and instead blame the Dao and its scriptures, not the Dao betraying the person but the person betraying themselves.\n\nThose who earnestly study and receive the precious texts must follow the statutes and proceed in order. There is nothing that will not respond, nothing in principle that will not be perfected, no Dao that will not descend, no form that will not become immortal. When the Dao is complete after ten thousand recitations, one ascends to Heaven in broad daylight. The three hundred chapters of the supreme scriptures are each bestowed upon the Perfected according to their capacity; not all are fully provided. Later diligent learners cannot equal the practices of the Great Perfected. The world is filled with impure qi, and the correct qi is obscured, hence the study of the Dao proceeds by sequence and rank.\n\nIf one practices the thirty-one scrolls compiled by the Great Emperor and completes the Dao, one may then pursue what one desires. Beginners must not leap directly to their aspirations, lest they violate the luminous statutes, for the consequences are severe. Beware and take heed.\n\nThe Lesser Existence Heavenly King states: One who practices the thirty-one scrolls in proper order, with the cinnabar purity ascending to the heights, shall be visited by the Great Emperor, who will dispatch the Perfected of the Supreme Ultimate to further instruct them in the postures and protocols of the various scriptures. Those who diligently and painstakingly cultivate without lapse shall be able to soar and wander in the Jade Capital.\n\nAll who receive the supreme scriptures must guard their speech and be cautious in their words. They must not turn their backs on one to face another, nor discuss the scriptures’ contents, thereby confusing the Heavenly Perfected. To reveal them to the world, slander fellow practitioners, falsely claim the names of the worthy, belittle those more advanced, deceive the numinous powers, attack teachers and friends, plot rebellion, or claim to possess the wondrous completeness of the cavern scriptures—such acts are seized by the Four Offices and reported to the Great Emperor. One’s seven generations of ancestors and parents are bound to the offices of ghostly officials, eternally confined to the earth prisons, their bodies subjected to the tortures of wind and blades. They shall never attain immortality. Let all practitioners beware.\n\nThe statutes of the Four Poles state: One who does not receive the scriptures but steals the Heavenly Treasures, or receives them without covenant or faith, spurns the Heavenly Dao. If one obtains scriptures through karmic conditions but there is no master in the world, one may proceed according to the statutes, bearing a pledge to a secluded peak to receive them in secret. If a master exists, one must visit them to receive the covenant and transmission. To obtain scriptures without receiving the covenant, to practice recklessly, offend the numinous powers, or idly discuss the scriptures’ titles with the uninitiated—such acts incur severe consequences. They are seized by the officials of the Four Poles and Four Offices, and one’s seven generations of ancestors and parents are consigned to the endless labor of filling the River of Night. Their bodies endure the visible tortures, and after death, they suffer the Ten Torments and Eight Difficulties, swallowing fire and embracing swords, to atone for the crime of carelessly discussing the scriptures. Let the recipient clearly heed the statutes and regulations.\n\nHere ends the *Seven Revolutions and Seven Changes Dancing Heaven Scripture of the Supreme Clarity’s Divine Continent*.",
      "overlap_context": "owed upon the mediocre. To carelessly divulge this treasure text and expose it to the Upper Perfected brings retribution upon one’s seven generations of ancestors and parents, who are consigned to the offices of ghostly officials, made to transport the stones of Mount Meng to fill the River of Night. For ten thousand kalpas, they are reborn outside the human realm, their bodies subjected to the tortures of wind and blades. The scripture is naturally lost, and immortality is utterly unattainable.",
      "start_char": 9720,
      "end_char": 10941,
      "start_sentence": 343,
      "end_sentence": 372,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 44.921799182891846,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真上清神州七转七变舞天经.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}