{
  "source_id": "洞玄灵宝三师记",
  "source_file": "chunked_daozang\\洞玄灵宝三师记.json",
  "total_chunks": 6,
  "total_original_chars": 3161,
  "total_translated_chars": 20226,
  "total_translation_time": 108.9279854297638,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\谱箓类\\洞玄灵宝三师记.txt",
    "category": "谱箓类"
  },
  "full_translation": "**Record of the Three Masters of the Cavern Mystery and Numinous Treasure**\n\n**Scripture Title:** *Record of the Three Masters of the Cavern Mystery and Numinous Treasure*\nTwo fascicles, bound as one volume. Originally attributed to Liu Chujing of the late Tang, but likely composed by Du Guangting.\n**Source Text:** *Daoist Canon of the Zhengtong Era*, Cavern Mystery Section, Registers and Records Category.\n\n---\n\n**Record of the Three Masters of the Cavern Mystery and Numinous Treasure, with Preface**\nComposed by Master Guangcheng, Liu Chujing\n\nThe essence of the Dao is utmost quiescence and non-action.\nIts function is to permeate life and respond to stimuli.\nIt begins before the beginning, precedes what has no precedence.\nIt arises from wondrous non-being and gives birth to wondrous being.\nThe teaching of the Perfect Truth was established therefrom.\n\nOur Primordial Celestial Worthy of Original Commencement initiated the Double Mystery, traversed the Five Primes, grasped the primordial transformation, wielded the true essence, and synthesized the wondrous gate into a dharma-seal, which he bestowed upon the Great Lord of the Dao.\nThe Lord of the Dao refined and expanded it, unfolding and proclaiming it.\nIn all, twelve seals encompassed the hidden traces, exhausting and penetrating the mysterious and wondrous, which he then transmitted to Lord Lao.\nLord Lao received and practiced it, reaching upward to the Three Clarities, extending laterally without bound, spanning countless eons, enlightening the unenlightened. Each emperor became a master, and in every region, teachings were established. From the obscure to the manifest, from the vast to the minute, none did not revere it.\n\nThus, from generation to generation, masters transmitted the teachings, passing down the precepts from the Primordial Commencement to the present age.\nThose who receive the Dao and honor its precepts—are they not the Masters of Transmission?\nThe master of the Master of Transmission is the Master of Registers.\n\"Registers\" means succession. To inherit the true vehicle is to depart from the mundane and contract the Dao.\nThe master of the Master of Registers is the Master of Scriptures.\n\"Scriptures\" means \"by way of.\" By the master’s awakening, one abandons the mundane and ascends as an immortal.\nThe weight of the Three Masters is comparable to that of ancestors and progenitors.\nAncestors and progenitors can transmit the teachings but cannot enable the multitudes to attain the Dao. Parents can give life but cannot enable the multitudes to ascend as immortals.\nThe way of honoring the master is without peer.\nThe Confucian principle of \"all things in threes\" cannot compare to it.\n\nReverently considering the Three Lords, their luminous virtue shines forth. In tracing and honoring their teachings, admiration knows no bounds.\nYet, since their ascent to the heavens, their records have not been systematically compiled. Though their steadfast principles and flourishing models are inscribed upon sacred mountains, later disciples and followers find it difficult to delve into their profound mysteries.\nThus, I dare to arrange these factual records to illuminate future generations.\nI humbly present this brief preface and compose a eulogy.\n\nThe disciple of the Dao, Lu Shenyi of Haoxing, and the Perfected of the Dao-Origin, Xiu Lie, merely appended short praises to commemorate their virtuous influence.\nMay the kalpas come to an end, yet their pure regulations never fade.\n\nComposed on the Zhongyuan Festival of the Gengchen year of the Tang, the Jiachen day.\n\n---\n\n**The Three Masters**\n\n**Master of Scriptures:** Lord Tian of the Great Cavern of Supreme Clarity on Mount Nanyue, whose personal name was Xu Ying, style Liangyi, a native of the Qi state.\nDuring the Kaihuang era of the Sui, he served his parents and resided in You County to the west. Though the land spanned several *li* and connected with human relations, it was not a place for resting or advancing in the Dao. Even though the forests and foothills were serene and secluded, he abandoned it and departed, relocating to the midst of the mountain.\n\nLord Tian was endowed with pure spiritual essence, having nurtured celestial harmony from birth. He inherited the numinous source of the Maoshui and carried forward the filial virtue of the Great Shun. Thereafter, he settled at the southeastern layered cliffs beneath Zigai Peak, where he tilled the soil and cultivated crops to provide for his parents for over fifty years, never faltering in his morning and evening duties. Though he longed to part the brambles in search of the Dao and conceal his radiance to seek truth, his reverent devotion and filial piety left no room for self-indulgence until his parents’ passing.\n\nAfter their transformation, he wandered the Five Peaks, letting his aspirations roam freely. In the Longsuo era of the Tang, he encountered the reclusive immortal He Jun, from whom he received the Dao in silent transmission. From then on, wherever vines, creepers, springs, or rocks drew him, he would stay, and thus his mountain abode had no fixed place. The prefectural governor, Lord Tian Xia, revered his virtue and Dao, and at the eastern hall of the Yueguan Temple, constructed the Jiangzhen Hall. Tian Qiancheng and the scholar-officials Zhuge and Huang inscribed praises on its walls to honor his profound virtue. The Master often rested there, propagating the Dao and transmitting its teachings.\n\nThe Shangqing Great Cavern scriptures he transmitted had been passed down from Master Zhenyi to Celestial Master Xue Jun, and from Xue Jun to the Master. The Master delved deeply into its mysteries, attaining the profoundest realms of the Dao. He traversed the rivers and clouds for over two hundred years. Though seasons changed and time shifted, his lifespan knew no bounds, and to this day, brush-wielding travelers and wanderers often claim to have seen him. This confirms that within jade palaces and grotto-heavens, he must have his abodes, and among the ranks of immortals and the stages of perfected beings, he must have his place. Yet the barrier of the mundane world obscures the details, which cannot be fully known.\n\nThe Master had four accomplished disciples: Feng Jun Weiliang of Bingyao, Chen Jun Guayan of Xianglin, Xu Jun Lingfu of Fangying, and during the Yuanhe era, they entered Tiantai Mountain, spreading teachings as circumstances allowed. Emperor Xianzong summoned them, but they did not respond. Master Liu of Guangcheng remained at the foot of the mountain; Emperor Wuzong summoned him to serve as Celestial Master and enter the capital to transmit the Dao. Today, the Three Caverns teachings of Jiangzhe trace their lineage to Master Tian as their founding patriarch.\n\n**Eulogy:**\nThe august and boundless Dao,\nThe uncarved simplicity without name.\n\nSubtle and profound, neither pure nor turbid.\nRadiant our ancestor, transcendent in prior enlightenment.\nSilently he attained it—learning without learning.\nMama River inaugurated his line; Qi State bore its splendor.\nDelighting in the Dao with a bamboo bowl of food,\nhe unrolled the classics beneath crimson gauze.\nThough chaff might cling to his ceremonial sash,\nhis guests and kin were clouds of rosy mist.\nHe tilled the soil to provide for his parents,\nfulfilling filial piety at home.\nDeep in the crags’ embrace, he pursued the Perfected amid forest peaks,\nwhere Peng Xian led the way and Pine and Jo lived on.\nWhile the world’s sundials turned in vain,\nhis own being grew ever more still.\nHe revered the chariot of recitation, soaring through the Eight Sceneries.\n\nRecorded in the register: Master Feng of the Great Cavern of Supreme Clarity at Tongwu Abbey on Mount Tiantai, the thrice-summoned Perfected Gentleman, styled Weiliang, a native of Changle. He cultivated the Dao at the Central Palace of Mount Heng, where he befriended Xu of Fangying and Chen of Xianglin as kin of the mist-bound vines. Each built a quiet chamber beside the Central Palace, two or three *li* apart. Later, at the Hall of Descending Perfection, he approached Master Tian, receiving the true instructions. The three caverns’ hidden mysteries were all imparted to him.\n\nDuring the Yuanhe era, he entered Mount Tiantai to propagate the Great Teaching. The Inspector of Kuaiji, Yuan Ji of Henan, heard of his reputation and rejoiced, sending earnest letters with reverence as if gazing at clouds, and paying him the respect due a disciple. At that time, Tongwu Abbey, since its restoration by Master Zhenyi, had endured through the years, its splendid halls and tiered towers overgrown with brambles and shrouded in green. The three gentlemen, recalling the merit of the former commander, undertook its reconstruction anew, building the Upper Clarity Pavilion, the Hall of Descending Perfection, the White Cloud Pavilion, and the Leisurely Retreat, thus reviving the legacy of Master Zhenyi. As Master Zhenyi Tian’s transmission of the Three Caverns’ Dao spread through Jiangnan, Emperors Xianzong and Jingzong repeatedly issued summons, dispatching carriages of rushes and missives of cranes, yet he remained unyielding. Instead, he established his dwelling in Hualing Valley, where he concealed himself in reclusion. There, he trod the paths in search of seclusion, exploring every marvel, from the numinous ruins of Lingxu to the Flower Peak, from the jade chambers of Stone Bridge to the Peach Blossom Springs of Tianmu, the golden courts of Jinting, and the yellow-clouded wilds. Alone he wandered, returning but once in months. From then on, he vanished into deep seclusion, his whereabouts unknown.\n\nHis disciples—Ying Yijie of the Three Caverns, Ye Cangzhi of Jade霄 (styled Hanxiang), Liu Chujing of Xiandu, and Shen Guanwu of Jinting—each a luminous branch of the immortal lineage, succeeded him in flourishing the Dao across the land.\n\nIn praise it is said:\nAt the inception, the Supreme Polarity,\nGave rise to the Two Modes.\nOnce the chaos was pierced,\nFloating strife surged forth.\nTracing the source, returning to simplicity,\nThe Dao stood as foundation.\nThe Heavenly Lad’s precious register,\nPassed from master to disciple.\nElixir of jade, golden nectar,\nRefining the primordial embryo, tempering the soul.\nAscending the altar to report to the Emperor,\nDiscarding the mundane to tread the mysterious path.\nBeneath the purple canopy, riding the clouds,\nJinting became his abode.\nClearing the brambles and overgrowth,\nTongqiao was revived.\nAmid ten thousand valleys’ hush,\nThree found their kindred.\nWest of the Milky Way,\nOur Way thus flourished.\nThe sagely sovereigns admired his virtue,\nThe commanders revered his teachings.\nHis heart, like clouds, clung to nothing,\nThe crane’s summons could not compel him.\nWith steps like stars, driving the wind,\nHe soared aloft.\n\nThe Master of Transmission, the Venerable Master of the Great Cavern of Supreme Clarity at Daoyuan Abbey on Mount Tiantai, the Purple-robed Responding Lord, whose personal name was Yijie and courtesy name Shizhong, traced his ancestry to Runan. His forebears settled in Mount Jinhua of the Po Valley during the Eastern Jin, and thus he became a native of Dongyang Prefecture. He was the great-grandson of the Recluse Master Shu Ning, a lofty scholar of the Kaiyuan era, who had mastered the classics through generations and cultivated his conduct, yet sought no official advancement.\n\nThe Master’s Dao shone with primordial harmony, his qi stored in profound emptiness. He nurtured a nature of pure numinosity and tempered his talents in the Purple Court. His essence was utterly refined, unstained by worldly dust, and he harmonized with the spirit of the valley without flaw. His mother, Lady He, dreamed of a shooting star entering her window; awakening in alarm, she beheld a divine radiance lingering there, and soon conceived. In the fifth year of the Yuanhe reign, the gengyin year, he was born—already distinct from the common, refusing meat and impure foods even as an infant.\n\nAt seven, he left his parents to pursue the Dao, entering Lingrui Abbey in Lanxi County of his home prefecture to study under Master Wu Xuansu. There he received the *Nanhua Chongxu Tongling Zhenjing* (*True Scripture of the Penetrating Spirit of the Southern Florescence and Primal Vacuity*), the *Book of Changes*, the *Classic of Filial Piety*, and the *Analects*. He chanted and recited with diligent devotion, mastering all five classics at once. At thirteen, he donned the hempen robe, the triple garment, and the Five Precepts, reverently upholding his practice. Masters and peers alike gazed upon him with awe.\n\nAt fifteen, he entered Mount Tiantai to study the Orthodox Unity teachings. At seventeen, he was invested with the Purple Void of the High Mystery. At eighteen, he journeyed to Mount Longhu to receive the Three Ranks of the Great Capital Merit from Shaoren, the eighteenth-generation descendant of the Celestial Master. At twenty-four, he delved into the True Writs of Numinous Treasure, the Cavern Spirit, and the Cavern Mystery. At twenty-nine, he ascended to the Mystery of Ascent. At thirty-two, he received the Great Cavern of Supreme Clarity, the Way of the Returning Chariot, the Purple Writs and Plain Sashes, and the talismans for treading earth and soaring heaven. He explored the histories and philosophers, distilled the profound commentaries, concealed his brilliance, and assiduously cultivated the wondrous path.\n\nThe transmission of the Great Law of Supreme Clarity had passed from the Perfected Lord Tao of Juqu to the Perfected Lord Wang of Ascent, from Wang to the Perfected Lord Pan of Embodied Mystery, from Pan to the Perfected Lord Sima of Integrity, from Sima to the Celestial Master Xue Jichang of Nanyue, from Xue to Master Tian Liangyi of Mount Heng, from Tian to the Recluse Master Feng Weiliang of Qiyao on Mount Tiantai, and from Feng to the Master. Through successive generations, the numinous descended, virtue linked like cicadas in a chain, the essence of the azure grove was entrusted, and the immortal ranks were ascended step by step.\n\nFellow disciples included Ye Hanxiang of the Jade Empyrean and Liu Chujing of Mount Xiandu. In the third year of the Huichang reign, the Master dwelled on the verdant screen of rock southwest of Tongwu Abbey, where he established a purification altar and immersed himself in the secret mysteries. Clearing brambles and fording streams, he sought a fitting abode. Li Baoyuan, the Military Commissioner of Yuezhou, admired his steadfast integrity and, following the wind of his reputation, petitioned for the establishment of an abbey, urging that it be named Daoyuan. Thereafter, the Master withdrew into the forest’s edge for over fifty years, upholding the great teaching without respite. People of Wu and Yue gazed upon his incense and bowed in reverence; those who wished to serve as his attendants either cast off their worldly sandals or brought renown to their states—his virtues cannot be fully recounted.\n\nFrom youth to maturity, the Master remained unsullied by worldly dust. He cast off the dregs of the mundane, sharply distinct from the common and indolent. His demeanor was warm and serene, his true qi undispersed. His virtue was solemn and profound, his words luminous and pure. Whenever he entered stillness to perform rites, ascended the altar to inspect the registers, or brought blessings to the times, he delivered beings and guided souls. His offerings of honey and wax communicated with the numinous, yielding auspicious omens. He chanted the hidden verses of the *Yellow Court* and intoned the jade stanzas of the *Great Cavern*. At the Eight Daoist Festivals, he gazed toward the clouds; at the Three Primordial Assemblies, he received his duties. He wandered the wind and concealed himself in the earth, grasped hands and hid in the heavens. Diligent in his refinement, he continued day and night without cease. Thus did the numinous descend to bestow liberation, and the mysterious transmit the true lineage.\n\nWhen his empty chamber awaited the concealed arrival of the imperial carriage, and his gaze longed for the secret halting of the wind-driven chariot, the Master attained it. Nobles and marquises heard of him and turned their eyes toward the screens of the realm; they reverently welcomed him with soaring memorials. The imperial court, upon learning of his virtue, bestowed a noble title and honored him with a rescript of purple-clad favor. Though the world’s acclaim swelled, his original intent remained unshaken.\n\nThe Master often said to his disciples: “I have devoted myself to propagating and protecting the fundamental teaching, and thus cannot retreat from the world to silence my voice. The Dao does not shun humanity; through diligent seeking, it may be attained. The Jade Capital and Golden Portals, the Yellow Springs and Deng Metropolis—how far apart are they? Only the heart’s intent determines the outcome. Let those who come after strive to uphold this.”\n\nOn the assembly day of the seventh month in the jia-yin year of the Qianning reign, after completing his audience at court, he bathed, entered stillness, and composed his spirit as if awaiting something. At the hour of chou on the eighth day, he peacefully shed his mortal form at the age of eighty-five. His limbs remained supple, his countenance unchanged—what the *True Scripture* calls the “upper liberation.” That evening, the abbey filled with pure fragrance, and purple qi floated in the sky. Birds and beasts cried out for a full day, and the mountains and rivers lost their color.\n\nSeven days later, his spirit was conveyed to a stone chamber in the northeast corner of the abbey, where his remains were refined—a practice in accordance with the ritual codes. On the fourth day of that month, two divine beings in feathered robes, holding tablets, entered from outside, their bearing extraordinary. When the abbey’s disciples hastened to greet them, they heard only the sound of chanted praises before the figures vanished. This was a mysterious announcement from the numinous officials.\n\nFive years earlier, in the first month of winter, the Daoist Zhang Jingxuan of the Tiantai Abbey had chanced to gaze upon the peaks and seen clouds of red and purple swirling strangely. Within them appeared three jeweled boats: one bore Ye Hanxiang of the Jade Empyrean, another bore Liu Xiuran of Fangying, and the third carried the Master. The first two boats soared away, while the Master’s followed behind. Indeed, Liu and Ye had already ascended and transformed, while the Master later departed. This further confirmed the signs of his attainment and the imperial manifestation of his cultivation.\n\nZhang Ying composed the abbey’s record, and Luo Yin of Hengyang wrote the *Eulogy of the Perfected*, their magnificent brushstrokes and resplendent phrases inscribing stone with enduring elegance—both were towering talents of the age, their legacy imperishable. Yet at the threshold of his immortal transformation, his radiance shone ever brighter.\n\nThe brush of a worthy scholar, though humble and slight, dares to record these grand principles. May luminous talents of later times bestow further refinement. The disciple of later learning, Lu Shenyi of Wu Commandery, bows in reverence to the rosy clouds and sets down the events in plain words—composed by Master Guangcheng of the disciples’ gate.\n\n**Eulogy:**\nThe Dao is profound, the Mystery doubly abstruse;\nIts traces divide into the Three Caverns.\nJade script and golden writ,\nThe Purple Phoenix embodies their mystery.\nThe Three Radiances are this treasure,\nThe bound blossoms they chant.\nTheir principle illumines the darkened crossroads,\nTo awaken the great dream.\nOur Master’s august virtue\nShook off the dust and clamor.\nLike Shang’s hymns scorning Han,\nOr Ying’s melodies confounding Yao,\nThe Eight Dao were purified,\nThe Three Primes silently attended.\nHis cultivation reached its apex,\nHis merit sought to mount the phoenix.\nThe cinnabar towers of Huotai,\nThe immortal halls of Red City.\nExpounding the Dharma, transmitting the teachings,\nHis numinous rule and wondrous measure.\n*Record of the Three Masters of the Cavernous Mystery and Numinous Treasure* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞玄灵宝三师记 经名：洞玄灵宝三师记。 二篇同卷。 原题唐末刘处静撰，应为杜光庭撰。 底本出处：《正统道藏》洞玄部谱录类。 洞玄灵宝三师记 洞玄灵宝三师名讳形状居观方所文 洞玄灵宝三师记并序 广成先生刘处静撰 道之体也，至静而无为。 道之用也，通生而赴感。 始乎无始，先乎无先。 起於妙无，而生妙有。 至真之教，由兹而立焉。 我元始天尊，启重玄，历五太，握元化，运真精，总括妙门以为法印，付于大道君。 道君钻统以光大之，敷畅以宣布之。 凡十二印，包举幽迹，穷达玄妙，以授于老君。 老君奉而行之，上极三清，旁周无外，绵亘亿载，开导未闻，帝帝为师，方方立教，幽明巨细，靡不宗焉。 自是奕叶绍承，师师授度，上自元始，下逮兹辰。 故受道尊奉，其为度师乎。 度师之师，日籍师。 籍者，嗣也。 嗣籍真乘，离凡契道。 籍师之师，日经师。 经者，由也。 由师开悟，舍凡登仙。 三师之重，媲于祖宗。 祖宗能传之，而不能使兆致道，父母能生之，而不能使兆升仙。 奉师之道，无以过矣。 儒家在三之义，莫能及焉，钦惟三君，焕有明德，追仰尊禀，瞻慕无阶。 粤自上宾未列图纪，虽贞猷茂范，刊勒於名山，而后学门人，难披於真奥。 敢条实录，昭示将来。 辄陈小序，仍为颂述。 道弟昊兴陆甚夷己叔，道元先生休烈，但继裁短赞以纪德风。 庶劫历有终，而清规不泯有唐龙集。 庚辰中元日甲辰序。 三师 经师，南岳上清大洞田君，讳虚应，字良逸，齐国人也。 隋开皇中侍亲，而居攸县之西。 数里以为地，接人姻，非柄息进道之所，虽林麓清幽，亦舍之而去，迁于岳中。",
      "translated_text": "**Record of the Three Masters of the Cavern Mystery and Numinous Treasure**\n\n**Scripture Title:** *Record of the Three Masters of the Cavern Mystery and Numinous Treasure*\nTwo fascicles, bound as one volume. Originally attributed to Liu Chujing of the late Tang, but likely composed by Du Guangting.\n**Source Text:** *Daoist Canon of the Zhengtong Era*, Cavern Mystery Section, Registers and Records Category.\n\n---\n\n**Record of the Three Masters of the Cavern Mystery and Numinous Treasure, with Preface**\nComposed by Master Guangcheng, Liu Chujing\n\nThe essence of the Dao is utmost quiescence and non-action.\nIts function is to permeate life and respond to stimuli.\nIt begins before the beginning, precedes what has no precedence.\nIt arises from wondrous non-being and gives birth to wondrous being.\nThe teaching of the Perfect Truth was established therefrom.\n\nOur Primordial Celestial Worthy of Original Commencement initiated the Double Mystery, traversed the Five Primes, grasped the primordial transformation, wielded the true essence, and synthesized the wondrous gate into a dharma-seal, which he bestowed upon the Great Lord of the Dao.\nThe Lord of the Dao refined and expanded it, unfolding and proclaiming it.\nIn all, twelve seals encompassed the hidden traces, exhausting and penetrating the mysterious and wondrous, which he then transmitted to Lord Lao.\nLord Lao received and practiced it, reaching upward to the Three Clarities, extending laterally without bound, spanning countless eons, enlightening the unenlightened. Each emperor became a master, and in every region, teachings were established. From the obscure to the manifest, from the vast to the minute, none did not revere it.\n\nThus, from generation to generation, masters transmitted the teachings, passing down the precepts from the Primordial Commencement to the present age.\nThose who receive the Dao and honor its precepts—are they not the Masters of Transmission?\nThe master of the Master of Transmission is the Master of Registers.\n\"Registers\" means succession. To inherit the true vehicle is to depart from the mundane and contract the Dao.\nThe master of the Master of Registers is the Master of Scriptures.\n\"Scriptures\" means \"by way of.\" By the master’s awakening, one abandons the mundane and ascends as an immortal.\nThe weight of the Three Masters is comparable to that of ancestors and progenitors.\nAncestors and progenitors can transmit the teachings but cannot enable the multitudes to attain the Dao. Parents can give life but cannot enable the multitudes to ascend as immortals.\nThe way of honoring the master is without peer.\nThe Confucian principle of \"all things in threes\" cannot compare to it.\n\nReverently considering the Three Lords, their luminous virtue shines forth. In tracing and honoring their teachings, admiration knows no bounds.\nYet, since their ascent to the heavens, their records have not been systematically compiled. Though their steadfast principles and flourishing models are inscribed upon sacred mountains, later disciples and followers find it difficult to delve into their profound mysteries.\nThus, I dare to arrange these factual records to illuminate future generations.\nI humbly present this brief preface and compose a eulogy.\n\nThe disciple of the Dao, Lu Shenyi of Haoxing, and the Perfected of the Dao-Origin, Xiu Lie, merely appended short praises to commemorate their virtuous influence.\nMay the kalpas come to an end, yet their pure regulations never fade.\n\nComposed on the Zhongyuan Festival of the Gengchen year of the Tang, the Jiachen day.\n\n---\n\n**The Three Masters**\n\n**Master of Scriptures:** Lord Tian of the Great Cavern of Supreme Clarity on Mount Nanyue, whose personal name was Xu Ying, style Liangyi, a native of the Qi state.\nDuring the Kaihuang era of the Sui, he served his parents and resided in You County to the west. Though the land spanned several *li* and connected with human relations, it was not a place for resting or advancing in the Dao. Even though the forests and foothills were serene and secluded, he abandoned it and departed, relocating to the midst of the mountain.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 639,
      "start_sentence": 0,
      "end_sentence": 39,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.426353216171265,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\谱箓类\\洞玄灵宝三师记.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "君禀灵纯粹，夙蕴天和。 绍妈水之灵源，纂重华之孝德。 其后拥未於紫盖峰之束南层岩之下，躬耕稼穑，致养於亲五十余年，晨夕无怠。 虽欲披榛访道，匿景寻真，而肃恭温清，罔敢自适洎圣。 善委蜕，乃周游五峰，放志长往。 唐龙朔年中，与隐仙何君相遇，默传其道，自此姻萝、泉石所止忌归，由是山门居无定所。 州牧田侯遐迎道德，於岳观殿束构降真堂，田千乘诸葛黄述赞于壁，以旌玄德。 先生时憩於兹，弘道传法。 所授上清大洞，自贞一先生传天师薛君，薛君以传先生。 先生钻承玄要，深臻道域0 ．涉历云水二百余年。 虽寒暑迁贸，而寿纪莫穷，至今诸笔游人，往往有见之者。 斯则瑶宫、问洞必有所宴居，仙秩、真阶必有所扬历。 但尘凡厦隔，不可得而详焉。 先生门弟子达者四人，柄瑶冯君惟良，香林陈君寡言，方瀛徐君灵府，元和中，束入天台山，随方宣教，宪宗皇帝诏征不起。 广成先生刘君，犹居岳下，武宗皇帝征为天师，入国传道。 今江浙三洞之法，以先生田君为祖师焉。 赞曰： 皇皇至道，无名之朴。",
      "translated_text": "Lord Tian was endowed with pure spiritual essence, having nurtured celestial harmony from birth. He inherited the numinous source of the Maoshui and carried forward the filial virtue of the Great Shun. Thereafter, he settled at the southeastern layered cliffs beneath Zigai Peak, where he tilled the soil and cultivated crops to provide for his parents for over fifty years, never faltering in his morning and evening duties. Though he longed to part the brambles in search of the Dao and conceal his radiance to seek truth, his reverent devotion and filial piety left no room for self-indulgence until his parents’ passing.\n\nAfter their transformation, he wandered the Five Peaks, letting his aspirations roam freely. In the Longsuo era of the Tang, he encountered the reclusive immortal He Jun, from whom he received the Dao in silent transmission. From then on, wherever vines, creepers, springs, or rocks drew him, he would stay, and thus his mountain abode had no fixed place. The prefectural governor, Lord Tian Xia, revered his virtue and Dao, and at the eastern hall of the Yueguan Temple, constructed the Jiangzhen Hall. Tian Qiancheng and the scholar-officials Zhuge and Huang inscribed praises on its walls to honor his profound virtue. The Master often rested there, propagating the Dao and transmitting its teachings.\n\nThe Shangqing Great Cavern scriptures he transmitted had been passed down from Master Zhenyi to Celestial Master Xue Jun, and from Xue Jun to the Master. The Master delved deeply into its mysteries, attaining the profoundest realms of the Dao. He traversed the rivers and clouds for over two hundred years. Though seasons changed and time shifted, his lifespan knew no bounds, and to this day, brush-wielding travelers and wanderers often claim to have seen him. This confirms that within jade palaces and grotto-heavens, he must have his abodes, and among the ranks of immortals and the stages of perfected beings, he must have his place. Yet the barrier of the mundane world obscures the details, which cannot be fully known.\n\nThe Master had four accomplished disciples: Feng Jun Weiliang of Bingyao, Chen Jun Guayan of Xianglin, Xu Jun Lingfu of Fangying, and during the Yuanhe era, they entered Tiantai Mountain, spreading teachings as circumstances allowed. Emperor Xianzong summoned them, but they did not respond. Master Liu of Guangcheng remained at the foot of the mountain; Emperor Wuzong summoned him to serve as Celestial Master and enter the capital to transmit the Dao. Today, the Three Caverns teachings of Jiangzhe trace their lineage to Master Tian as their founding patriarch.\n\n**Eulogy:**\nThe august and boundless Dao,\nThe uncarved simplicity without name.",
      "overlap_context": "Lord Tian of the Great Cavern of Supreme Clarity on Mount Nanyue, whose personal name was Xu Ying, style Liangyi, a native of the Qi state.\nDuring the Kaihuang era of the Sui, he served his parents and resided in You County to the west. Though the land spanned several *li* and connected with human relations, it was not a place for resting or advancing in the Dao. Even though the forests and foothills were serene and secluded, he abandoned it and departed, relocating to the midst of the mountain.",
      "start_char": 639,
      "end_char": 1055,
      "start_sentence": 40,
      "end_sentence": 57,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.02827525138855,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\谱箓类\\洞玄灵宝三师记.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "惟希惟微，匪清匪浊。 昭昭吾祖，超然先觉。 默而得之，学无所学。 妈川启祚，齐国承华。 乐道箪．食，横经绛纱。 枇糠簪绂，宾友姻霞。 躬耕致养，尽孝于家。 深隐岩肩，追真林岭。 佺羡为倡，松乔共永。 世晷徒迁，我身弥静。 钦驾讽车，飞翔八景。 籍师，天台山桐梧观上清大洞三征君冯君，讳惟良，长乐人也。 修道於衡岳中宫，与方瀛徐君、香林陈君为姻萝之友，各茸静室於中宫之侧，相去二三里焉。 其后於降真堂诣先生田君，师禀真诀，三洞幽奥，咸得参授。",
      "translated_text": "Subtle and profound, neither pure nor turbid.\nRadiant our ancestor, transcendent in prior enlightenment.\nSilently he attained it—learning without learning.\nMama River inaugurated his line; Qi State bore its splendor.\nDelighting in the Dao with a bamboo bowl of food,\nhe unrolled the classics beneath crimson gauze.\nThough chaff might cling to his ceremonial sash,\nhis guests and kin were clouds of rosy mist.\nHe tilled the soil to provide for his parents,\nfulfilling filial piety at home.\nDeep in the crags’ embrace, he pursued the Perfected amid forest peaks,\nwhere Peng Xian led the way and Pine and Jo lived on.\nWhile the world’s sundials turned in vain,\nhis own being grew ever more still.\nHe revered the chariot of recitation, soaring through the Eight Sceneries.\n\nRecorded in the register: Master Feng of the Great Cavern of Supreme Clarity at Tongwu Abbey on Mount Tiantai, the thrice-summoned Perfected Gentleman, styled Weiliang, a native of Changle. He cultivated the Dao at the Central Palace of Mount Heng, where he befriended Xu of Fangying and Chen of Xianglin as kin of the mist-bound vines. Each built a quiet chamber beside the Central Palace, two or three *li* apart. Later, at the Hall of Descending Perfection, he approached Master Tian, receiving the true instructions. The three caverns’ hidden mysteries were all imparted to him.",
      "overlap_context": "uanhe era, they entered Tiantai Mountain, spreading teachings as circumstances allowed. Emperor Xianzong summoned them, but they did not respond. Master Liu of Guangcheng remained at the foot of the mountain; Emperor Wuzong summoned him to serve as Celestial Master and enter the capital to transmit the Dao. Today, the Three Caverns teachings of Jiangzhe trace their lineage to Master Tian as their founding patriarch.\n\n**Eulogy:**\nThe august and boundless Dao,\nThe uncarved simplicity without name.",
      "start_char": 1055,
      "end_char": 1265,
      "start_sentence": 58,
      "end_sentence": 71,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.533514499664307,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\谱箓类\\洞玄灵宝三师记.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "元和中，束入天台山，弘宣大教。 会稽廉察、河南元积，闻其风而悦之，叔恳缄词，望云致敬，执弟子之礼。 时桐梧观自贞一先生缮修之后，绵历岁年，华殿、层楼榛芜翳苍。 三君记元戎之力，再加兴构，作上清阁、降真堂、白云亭、鲦闲院，以复贞一先生之迹，以贞一田君旧传三洞之道，行于江南，宪宗、敬宗迭降征韶，蒲轮鹤书，竟不能屈，即於华林谷创柄瑶，隐居以止焉。 於是履策寻幽，遍讨奇趣，灵墟华顶，琼室石桥，天姥桃花之源，金庭黄云之野，偷然独往，．累月一归。 自此深隐，莫知其所。 门人三洞应君夷节，玉霄叶君藏质，字含象，仙都刘君处静，金庭沈君观无，皆法叶仙枝辉映，相继盛於海内焉。 赞曰： 厥初太极，是生两仪。 混沌既凿，浮竞交驰。 沂源归朴，以道为基。 天童宝录，授受于师。 液玉膏金，胎元炼魄。 登坛告帝，投披玄迹。 紫盖云迈，金庭是宅。 剪萝榛芜，中兴桐桥。 万壑岑寂，三人得朋。 制河之左，吾道斯弘。 圣主翘德，元戎服膺。 云心无着，鹤诏难征。 星步风驭，飒然上腾。",
      "translated_text": "During the Yuanhe era, he entered Mount Tiantai to propagate the Great Teaching. The Inspector of Kuaiji, Yuan Ji of Henan, heard of his reputation and rejoiced, sending earnest letters with reverence as if gazing at clouds, and paying him the respect due a disciple. At that time, Tongwu Abbey, since its restoration by Master Zhenyi, had endured through the years, its splendid halls and tiered towers overgrown with brambles and shrouded in green. The three gentlemen, recalling the merit of the former commander, undertook its reconstruction anew, building the Upper Clarity Pavilion, the Hall of Descending Perfection, the White Cloud Pavilion, and the Leisurely Retreat, thus reviving the legacy of Master Zhenyi. As Master Zhenyi Tian’s transmission of the Three Caverns’ Dao spread through Jiangnan, Emperors Xianzong and Jingzong repeatedly issued summons, dispatching carriages of rushes and missives of cranes, yet he remained unyielding. Instead, he established his dwelling in Hualing Valley, where he concealed himself in reclusion. There, he trod the paths in search of seclusion, exploring every marvel, from the numinous ruins of Lingxu to the Flower Peak, from the jade chambers of Stone Bridge to the Peach Blossom Springs of Tianmu, the golden courts of Jinting, and the yellow-clouded wilds. Alone he wandered, returning but once in months. From then on, he vanished into deep seclusion, his whereabouts unknown.\n\nHis disciples—Ying Yijie of the Three Caverns, Ye Cangzhi of Jade霄 (styled Hanxiang), Liu Chujing of Xiandu, and Shen Guanwu of Jinting—each a luminous branch of the immortal lineage, succeeded him in flourishing the Dao across the land.\n\nIn praise it is said:\nAt the inception, the Supreme Polarity,\nGave rise to the Two Modes.\nOnce the chaos was pierced,\nFloating strife surged forth.\nTracing the source, returning to simplicity,\nThe Dao stood as foundation.\nThe Heavenly Lad’s precious register,\nPassed from master to disciple.\nElixir of jade, golden nectar,\nRefining the primordial embryo, tempering the soul.\nAscending the altar to report to the Emperor,\nDiscarding the mundane to tread the mysterious path.\nBeneath the purple canopy, riding the clouds,\nJinting became his abode.\nClearing the brambles and overgrowth,\nTongqiao was revived.\nAmid ten thousand valleys’ hush,\nThree found their kindred.\nWest of the Milky Way,\nOur Way thus flourished.\nThe sagely sovereigns admired his virtue,\nThe commanders revered his teachings.\nHis heart, like clouds, clung to nothing,\nThe crane’s summons could not compel him.\nWith steps like stars, driving the wind,\nHe soared aloft.",
      "overlap_context": "ngwu Abbey on Mount Tiantai, the thrice-summoned Perfected Gentleman, styled Weiliang, a native of Changle. He cultivated the Dao at the Central Palace of Mount Heng, where he befriended Xu of Fangying and Chen of Xianglin as kin of the mist-bound vines. Each built a quiet chamber beside the Central Palace, two or three *li* apart. Later, at the Hall of Descending Perfection, he approached Master Tian, receiving the true instructions. The three caverns’ hidden mysteries were all imparted to him.",
      "start_char": 1265,
      "end_char": 1679,
      "start_sentence": 72,
      "end_sentence": 92,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.799407005310059,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\谱箓类\\洞玄灵宝三师记.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "度师，天台山道元院上清大洞道元先生，赐紫应君，讳夷节，字适中，祖汝南人，束晋居婆女金华山，．今为东阳郡人也。 开元朝高士征君庶凝之玄孙。 仍世经明，行修仕，不求达。 先生道焕太和，气蕴冲邈。 孕素灵之质，炼紫庭之才。 体至精而不缁，契谷神而无玷。 母何氏夫人，梦流星入牖，惊寤而神光在焉，因觉怀妊。 元和五年庚寅岁诞，而居然异俗，乱哺之中，不喜荤杂。 年七岁，辞亲慕道，就本郡兰溪县灵瑞观昊尊师玄素，受《南华冲虚通灵真经》及《周易》、《孝经》、《论语》，讽读专勤，五行俱下。 十三岁，备冠褐、三衣、五戒，祇禀恭修。 师友仰之肃如也。 年十五，入天台，参正一，十七佩高玄紫虚，十八诣龙虎山，系天师十八代孙少任，受三品大都功，二十四参灵宝真文、洞神、洞玄之法，二十九进升玄，三十有二受上清大洞、回车毕道、紫文素带、藉地腾天之符，旁探子史，内约玄诠，晦迩韬光，勤修妙迹。 以上清大法，自句曲陶真人传升玄王真人，王传体玄潘真人，潘传贞一司马真人，司马传南岳薛天师季昌，薛传衡山田先生良逸，田传天台栖瑶冯征君惟良，冯传先生。 奕叶降灵，蝉联至德，青林委粹，继蹑仙阶。 玉霄叶君含象、仙都刘君处静，皆同学也。 会昌三年，栖桐梧观西南翠屏岩，别建挣坛，冥心秘旨。 剪茅度水，冀厥攸居，越州观察使李公褒远慕贞规，顺风翘请，奏置院额，劝旨以道元为名。 既而息影林端五十余载，秉持大教，日无旷时。 至昊越之人，瞻香稽首，愿执巾几者，或脱履人寰，或扬名邦国，不可具载懿哉。 先生自幼及长，风尘靡杂。 摆落阴滓，峭隔常偷。 温润冲襟，真气不散。 德宇严邃，词华朗清。 每入静行斋，登坛阅录，为时致福，济物度人。 腊蜜通灵，郁有嘉瑞。 诵黄庭隐诀，吟大洞琼章。 八道望云，三元受事，徊风隐地，攀手藏天。 勤而炼之，昏旦相续。 固亦降灵垂脱，玄授真传。 虚室而钦驾潜臻，盼仰而讽车密税，先生得之矣。 闻者公侯，倾瞩藩屏，钦迎飞章。 J上闻允崇懿号，荐奉芝诏，宠锡紫衣。 虽吋世誉，初心匪惬。 先生深意，尝谓门弟子日：吾以弘护本教，不得遁世销声，道不违人，勤求可至。 玉京、金阙，泉曲、邓都，相去几何，惟心所兆。 后学之者，勉弘之焉。 以乾宁甲寅七月中会日，朝谒讫，澡沐入静，凝神如有所待。 八日丑时，恬然解化，春秋八十有五。 肢体柔和，颜状无改，《真经》所谓：上解者也。 是夕，清香满院，紫气浮空，禽乌一辰呜，山川失色。 后七日，迁神干院束北隅石室，为炼蜕之所，遵科范也。 是月四日，有神二人，羽服执简，自外而入，仪质非凡。 院中门人继往参讯，但闻昤赞之声，已失所在。 此乃灵官之所玄告也。 又五年前孟冬月，山中道士章敬玄於天台观偶瞻岩峰之上，见云物红紫，纷然有异，中有彩舟三艘，其一玉霄叶君乘之，一则方瀛刘君修然乘之，一则先生居其中，二舟飘然飞去，先生之舟在二舟之后。 果刘、叶已先升化，先生后方登遐。 益明得道之征，皇表修行之应矣。 舍遗张颖述院记，衡阳罗隐撰真赞，鸿笔铄石丽藻清词，皆当朝伟才，垂之不朽。 然而化仙之边，昭昭然未在。",
      "translated_text": "The Master of Transmission, the Venerable Master of the Great Cavern of Supreme Clarity at Daoyuan Abbey on Mount Tiantai, the Purple-robed Responding Lord, whose personal name was Yijie and courtesy name Shizhong, traced his ancestry to Runan. His forebears settled in Mount Jinhua of the Po Valley during the Eastern Jin, and thus he became a native of Dongyang Prefecture. He was the great-grandson of the Recluse Master Shu Ning, a lofty scholar of the Kaiyuan era, who had mastered the classics through generations and cultivated his conduct, yet sought no official advancement.\n\nThe Master’s Dao shone with primordial harmony, his qi stored in profound emptiness. He nurtured a nature of pure numinosity and tempered his talents in the Purple Court. His essence was utterly refined, unstained by worldly dust, and he harmonized with the spirit of the valley without flaw. His mother, Lady He, dreamed of a shooting star entering her window; awakening in alarm, she beheld a divine radiance lingering there, and soon conceived. In the fifth year of the Yuanhe reign, the gengyin year, he was born—already distinct from the common, refusing meat and impure foods even as an infant.\n\nAt seven, he left his parents to pursue the Dao, entering Lingrui Abbey in Lanxi County of his home prefecture to study under Master Wu Xuansu. There he received the *Nanhua Chongxu Tongling Zhenjing* (*True Scripture of the Penetrating Spirit of the Southern Florescence and Primal Vacuity*), the *Book of Changes*, the *Classic of Filial Piety*, and the *Analects*. He chanted and recited with diligent devotion, mastering all five classics at once. At thirteen, he donned the hempen robe, the triple garment, and the Five Precepts, reverently upholding his practice. Masters and peers alike gazed upon him with awe.\n\nAt fifteen, he entered Mount Tiantai to study the Orthodox Unity teachings. At seventeen, he was invested with the Purple Void of the High Mystery. At eighteen, he journeyed to Mount Longhu to receive the Three Ranks of the Great Capital Merit from Shaoren, the eighteenth-generation descendant of the Celestial Master. At twenty-four, he delved into the True Writs of Numinous Treasure, the Cavern Spirit, and the Cavern Mystery. At twenty-nine, he ascended to the Mystery of Ascent. At thirty-two, he received the Great Cavern of Supreme Clarity, the Way of the Returning Chariot, the Purple Writs and Plain Sashes, and the talismans for treading earth and soaring heaven. He explored the histories and philosophers, distilled the profound commentaries, concealed his brilliance, and assiduously cultivated the wondrous path.\n\nThe transmission of the Great Law of Supreme Clarity had passed from the Perfected Lord Tao of Juqu to the Perfected Lord Wang of Ascent, from Wang to the Perfected Lord Pan of Embodied Mystery, from Pan to the Perfected Lord Sima of Integrity, from Sima to the Celestial Master Xue Jichang of Nanyue, from Xue to Master Tian Liangyi of Mount Heng, from Tian to the Recluse Master Feng Weiliang of Qiyao on Mount Tiantai, and from Feng to the Master. Through successive generations, the numinous descended, virtue linked like cicadas in a chain, the essence of the azure grove was entrusted, and the immortal ranks were ascended step by step.\n\nFellow disciples included Ye Hanxiang of the Jade Empyrean and Liu Chujing of Mount Xiandu. In the third year of the Huichang reign, the Master dwelled on the verdant screen of rock southwest of Tongwu Abbey, where he established a purification altar and immersed himself in the secret mysteries. Clearing brambles and fording streams, he sought a fitting abode. Li Baoyuan, the Military Commissioner of Yuezhou, admired his steadfast integrity and, following the wind of his reputation, petitioned for the establishment of an abbey, urging that it be named Daoyuan. Thereafter, the Master withdrew into the forest’s edge for over fifty years, upholding the great teaching without respite. People of Wu and Yue gazed upon his incense and bowed in reverence; those who wished to serve as his attendants either cast off their worldly sandals or brought renown to their states—his virtues cannot be fully recounted.\n\nFrom youth to maturity, the Master remained unsullied by worldly dust. He cast off the dregs of the mundane, sharply distinct from the common and indolent. His demeanor was warm and serene, his true qi undispersed. His virtue was solemn and profound, his words luminous and pure. Whenever he entered stillness to perform rites, ascended the altar to inspect the registers, or brought blessings to the times, he delivered beings and guided souls. His offerings of honey and wax communicated with the numinous, yielding auspicious omens. He chanted the hidden verses of the *Yellow Court* and intoned the jade stanzas of the *Great Cavern*. At the Eight Daoist Festivals, he gazed toward the clouds; at the Three Primordial Assemblies, he received his duties. He wandered the wind and concealed himself in the earth, grasped hands and hid in the heavens. Diligent in his refinement, he continued day and night without cease. Thus did the numinous descend to bestow liberation, and the mysterious transmit the true lineage.\n\nWhen his empty chamber awaited the concealed arrival of the imperial carriage, and his gaze longed for the secret halting of the wind-driven chariot, the Master attained it. Nobles and marquises heard of him and turned their eyes toward the screens of the realm; they reverently welcomed him with soaring memorials. The imperial court, upon learning of his virtue, bestowed a noble title and honored him with a rescript of purple-clad favor. Though the world’s acclaim swelled, his original intent remained unshaken.\n\nThe Master often said to his disciples: “I have devoted myself to propagating and protecting the fundamental teaching, and thus cannot retreat from the world to silence my voice. The Dao does not shun humanity; through diligent seeking, it may be attained. The Jade Capital and Golden Portals, the Yellow Springs and Deng Metropolis—how far apart are they? Only the heart’s intent determines the outcome. Let those who come after strive to uphold this.”\n\nOn the assembly day of the seventh month in the jia-yin year of the Qianning reign, after completing his audience at court, he bathed, entered stillness, and composed his spirit as if awaiting something. At the hour of chou on the eighth day, he peacefully shed his mortal form at the age of eighty-five. His limbs remained supple, his countenance unchanged—what the *True Scripture* calls the “upper liberation.” That evening, the abbey filled with pure fragrance, and purple qi floated in the sky. Birds and beasts cried out for a full day, and the mountains and rivers lost their color.\n\nSeven days later, his spirit was conveyed to a stone chamber in the northeast corner of the abbey, where his remains were refined—a practice in accordance with the ritual codes. On the fourth day of that month, two divine beings in feathered robes, holding tablets, entered from outside, their bearing extraordinary. When the abbey’s disciples hastened to greet them, they heard only the sound of chanted praises before the figures vanished. This was a mysterious announcement from the numinous officials.\n\nFive years earlier, in the first month of winter, the Daoist Zhang Jingxuan of the Tiantai Abbey had chanced to gaze upon the peaks and seen clouds of red and purple swirling strangely. Within them appeared three jeweled boats: one bore Ye Hanxiang of the Jade Empyrean, another bore Liu Xiuran of Fangying, and the third carried the Master. The first two boats soared away, while the Master’s followed behind. Indeed, Liu and Ye had already ascended and transformed, while the Master later departed. This further confirmed the signs of his attainment and the imperial manifestation of his cultivation.\n\nZhang Ying composed the abbey’s record, and Luo Yin of Hengyang wrote the *Eulogy of the Perfected*, their magnificent brushstrokes and resplendent phrases inscribing stone with enduring elegance—both were towering talents of the age, their legacy imperishable. Yet at the threshold of his immortal transformation, his radiance shone ever brighter.",
      "overlap_context": " mundane to tread the mysterious path.\nBeneath the purple canopy, riding the clouds,\nJinting became his abode.\nClearing the brambles and overgrowth,\nTongqiao was revived.\nAmid ten thousand valleys’ hush,\nThree found their kindred.\nWest of the Milky Way,\nOur Way thus flourished.\nThe sagely sovereigns admired his virtue,\nThe commanders revered his teachings.\nHis heart, like clouds, clung to nothing,\nThe crane’s summons could not compel him.\nWith steps like stars, driving the wind,\nHe soared aloft.",
      "start_char": 1680,
      "end_char": 2889,
      "start_sentence": 93,
      "end_sentence": 141,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.26009702682495,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\谱箓类\\洞玄灵宝三师记.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "贤儒之笔，顾惟孱眇，辄纪大猷。 显伫英才，别加润色。 后学弟子昊郡陆甚夷，稽首姻霞，直书其事，门人广成先生制。 赞日： 道秘重玄，迹分三洞。 玉字金诀，玄此紫凤。 三景斯宝，束华所讽。 理烛昏衢，以醒大梦。 惟师懿德，摆落氛嚣。 商颂傲汉，颖曲乱尧。 八道清炼，三元默朝，修之造极，功欲乘讽。 丹霍洞台，赤城仙宇。 阐法传教，灵规妙矩。 洞玄灵宝三师记竟",
      "translated_text": "The brush of a worthy scholar, though humble and slight, dares to record these grand principles. May luminous talents of later times bestow further refinement. The disciple of later learning, Lu Shenyi of Wu Commandery, bows in reverence to the rosy clouds and sets down the events in plain words—composed by Master Guangcheng of the disciples’ gate.\n\n**Eulogy:**\nThe Dao is profound, the Mystery doubly abstruse;\nIts traces divide into the Three Caverns.\nJade script and golden writ,\nThe Purple Phoenix embodies their mystery.\nThe Three Radiances are this treasure,\nThe bound blossoms they chant.\nTheir principle illumines the darkened crossroads,\nTo awaken the great dream.\nOur Master’s august virtue\nShook off the dust and clamor.\nLike Shang’s hymns scorning Han,\nOr Ying’s melodies confounding Yao,\nThe Eight Dao were purified,\nThe Three Primes silently attended.\nHis cultivation reached its apex,\nHis merit sought to mount the phoenix.\nThe cinnabar towers of Huotai,\nThe immortal halls of Red City.\nExpounding the Dharma, transmitting the teachings,\nHis numinous rule and wondrous measure.\n*Record of the Three Masters of the Cavernous Mystery and Numinous Treasure* concludes.",
      "overlap_context": "nd transformed, while the Master later departed. This further confirmed the signs of his attainment and the imperial manifestation of his cultivation.\n\nZhang Ying composed the abbey’s record, and Luo Yin of Hengyang wrote the *Eulogy of the Perfected*, their magnificent brushstrokes and resplendent phrases inscribing stone with enduring elegance—both were towering talents of the age, their legacy imperishable. Yet at the threshold of his immortal transformation, his radiance shone ever brighter.",
      "start_char": 2889,
      "end_char": 3063,
      "start_sentence": 142,
      "end_sentence": 155,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.880338430404663,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\谱箓类\\洞玄灵宝三师记.txt",
        "category": "谱箓类"
      }
    }
  ]
}