{
  "source_id": "洞玄灵宝飞仙上品妙经",
  "source_file": "chunked_daozang\\洞玄灵宝飞仙上品妙经.json",
  "total_chunks": 2,
  "total_original_chars": 2135,
  "total_translated_chars": 12654,
  "total_translation_time": 54.69625282287598,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\本文类\\洞玄灵宝飞仙上品妙经.txt",
    "category": "本文类"
  },
  "full_translation": "**The Wondrous Scripture of the Supreme Grade for Flying Immortals of the Cavern Mystery and Numinous Treasure**\n\nThe *Scripture of the Supreme Grade for Flying Immortals of the Cavern Mystery and Numinous Treasure* is of unknown authorship. Four scriptures share this scroll. The source text comes from the *Zhengtong Daoist Canon*, Cavern Mystery Section, Original Texts Category.\n\nThe Dao speaks: The *Scripture of Flying Immortals* emerged from the Mysterious Wondrous Palace of Mount Taiyuan. The Perfected One, Master of Emptiness and Void, together with the Supreme Ones of the Ten Directions, the Immortals of the Five Peaks, and seven hundred thousand jade maidens of the Nine Heavens, assembled upon the Purple Jade Terrace of the Jade Capital of the Mysterious Metropolis. There, they expounded the *Great Scripture of the Boundless Samādhi of the Divine Net*, transforming the world below.\n\nAt that time, three hundred twenty thousand immortals and celestial beings arrived, bowing their heads to inquire of the Heavenly Worthy: \"We, your disciples, are dull of heart and beset by the six extremes, unable to comprehend the opening and closing of the Dao. Formerly, we received the grace of our former masters, who bestowed upon us the Yellow, Red, and Purple Talismans, along with the true and secret teachings of the Three Caverns. We practiced the Dao to save others, never faltering in our resolve. Yet in this shallow and frivolous age, many do not believe in the Dao and the transformative power of the Three Caverns. Foolish people cling to perverse views, destined for the Nine Dark Hells of eternal night, with no hope of escape. Since they do not believe, what can be done? The great kalpa draws near, and heaven and earth will soon be destroyed. Before long, the waters shall rise, sweeping away nine hundred million beings. The people will scatter and dissolve like mud in the current, flowing into the sea like water—how can they be transformed?\n\nThe Heavenly Worthy’s heart of great compassion—how can such stubborn and benighted people be saved? Is there a special method we may hear?\"\n\nThe Heavenly Worthy replied: \"Your question is most excellent, an inquiry into the boundless Dao. Now, there is an art of the immortals—listen carefully, and I shall transmit it to you in due course.\"\n\nThe Dao speaks: In the land of Jambudvīpa, transformation meets with disbelief. Those who seek to ascend as immortals must first receive the registers. The Yellow, Red, and Purple Talismans are the source of enlightenment. Later, with the guidance of the Three Masters, one may cross over and attain perfection. Receiving the thirty-six scriptures and contracts of the Perfected One’s boundless *Three Heavens of Great Illumination*, along with the divine incantations, one may slay demons and revive the living. When Daoists heal the sick and deliver the people, they should receive this scripture.\n\nThe vast multitude of the Great Wilderness, the talismans of the Nine Heavens’ soldiers, the registers for summoning a hundred ghosts, the great talismans of clouds and thunder, the talismans for warding off calamities, and the true contract of the Great One—these are the foundation of immortality. When Daoists receive these inner and outer registers of the Dao, they become immortals. In the process of attaining the Dao, one must practice the Dao according to the method. When merit is complete after three thousand deeds, one ascends to heaven in broad daylight.\n\nOn the days of Gengshen and Jiazi, the days of one’s fate, and during the six fasts and ten auspicious days, one should burn incense and practice the Dao to dispel disasters, disperse misfortune, pacify the household, and seek blessings. Even a single or double practice must not be concealed. If one fails to do so, one’s descendants, seven generations of ancestors, and parents will be consigned to the eternal night of the Nine Dark Hells. Not only oneself but even the lowly and impoverished will suffer—endless lawsuits, disputes, and the daily harassment of officials and soldiers. If you seek the Dao, it lies within your heart. With a single heart devoted to the Dao, you too may become a flying immortal.\n\nAssisting others in holding fasts—you may become a flying immortal.\nDigging wells by the roadside—you may become a flying immortal.\nTeaching others to do good—you may become a flying immortal.\nProviding for Daoists—you may become a flying immortal.\nDelivering beings through the Dharma gate—you may become a flying immortal.\nRespecting the old and the young—you may become a flying immortal.\nHolding monthly fasts—you may become a flying immortal.\nCompleting three seven-day fasts—you may become a flying immortal.\nNot consuming the master’s offerings—you may become a flying immortal.\nNever speaking ill—you may become a flying immortal.\nDevoting oneself wholeheartedly to the Dharma—you may become a flying immortal.\nNot coveting worldly affairs—you may become a flying immortal.\nNeither flattering nor envying—you may become a flying immortal.\nNot harming others’ hearts—you may become a flying immortal.\nNot seeking to prevail—you may become a flying immortal.\nHaving no partiality—you may become a flying immortal.\nMaintaining an impartial and single heart—you may become a flying immortal.\nAlways speaking kindly—you may become a flying immortal.\nMaking offerings to Daoists—you may become a flying immortal.\nTending to the sick—you may become a flying immortal.\nLending to the poor—you may become a flying immortal.\nEstablishing fasting halls—you may become a flying immortal.\nBuilding bridges to ferry people—you may become a flying immortal.\nDistributing scriptures—you may become a flying immortal.\nHelping to extinguish fires—you may become a flying immortal.\nRescuing those in dire need—you may become a flying immortal.\nSaving people from drowning—you may become a flying immortal.\nRecollecting the master and the Dao—you may become a flying immortal.\nBurning incense day and night—you may become a flying immortal.\nAssisting in the fasting kitchen—you may become a flying immortal.\nEstablishing conduct for others—you may become a flying immortal.\nProviding for the master’s needs—you may become a flying immortal.\nNot angering the master—you may become a flying immortal.\nRecollecting the Dao and cultivating practice—you may become a flying immortal.\nOffering housing to the master—you may become a flying immortal.\nServing the master with diligence—you may become a flying immortal.\nDirecting one’s heart constantly toward the Dao—you may become a flying immortal.\nObserving daily fasts—you may become a flying immortal.\nNot stealing others’ belongings—you may become a flying immortal.\nNever tiring of practicing the Dao—you may become a flying immortal.\nRevering goodness and bowing in worship—you may become a flying immortal.\nGiving clothing and hats to others—you may become a flying immortal.\nCherishing the orphaned and poor—you may become a flying immortal.\nInstructing disciples—you may become a flying immortal.\nMaking offerings to heavenly and ancestral spirits—you may become a flying immortal.\nEnsuring no shortage of yearly provisions—you may become a flying immortal.\nNever violating the Dao—you may become a flying immortal.\nDedicating one’s life to the master—you may become a flying immortal.\nPlanting a thousand trees—you may become a flying immortal.\nFerrying people at crossing points—you may become a flying immortal.\n\nThe Dao speaks: For Daoists seeking immortality and studying the Dao, the foremost practice is to establish fasts. Then, ten thousand spirits will abide in the empty mystery of the void, and countless officials and soldiers will fill the fasting hall. With single-minded devotion, you may discourse on the Dharma. Attaining this boundless flying immortality, ten thousand celestial beings, a hundred thousand jade maidens, and countless Supreme Ones will descend to witness the people’s fasts.\n\nThe method of fasting lies in diligence—you must not be careless in this.\n\nThe Dao speaks: At that time, the Flying Celestial Immortals King, the Heavenly Emperor Immortals King, and the Thirty-Six Heavenly Immortals Kings, along with the Immortals’ Realm Youths, the Immortals’ Might Youths, the Immortals’ Prefecture Youths, the Immortals’ Salvation Youths, the Immortals’ Raven Youths, and the Immortals’ Perfected Youths—thirty-six thousand in all—together arrived at the Great Luo Palace to pay their respects to the Heavenly Worthy. They prostrated themselves, touching their heads to the ground in reverence. Overjoyed and exultant, they took their seats in due order, circumambulating the Heavenly Worthy three times before settling. After a long while in attendance, they bowed in devotion, gazing upward to behold the radiant majesty of the Heavenly Worthies and Great Sages. Now gathered in assembly, they received the *Scripture of Flying Immortality* day and night without cease.\n\nAt that time, among the assembly was an immortal named Hao Gangwen, who debated with the Supreme Perfected One but could not resolve their dispute. The Immortals King then addressed the Heavenly Worthy: \"We humbly request Your judgment—who is right and who is wrong in this debate? Each seeks to prevail before the assembly.\" The Heavenly Worthy declared: \"Gangwen is without reason. He shall be stripped of his immortal rank and banished to the moon, where he must fell the osmanthus tree. He shall not keep company with you henceforth.\"\n\nThen the Immortals King again addressed the Heavenly Worthy: \"Today, in Your presence, we are filled with boundless joy. Such a great assembly of thirty-six thousand—all standing before the Dao. These sages, perfected ones, and immortals are all past worthies and Dharma masters. In the vast emptiness, they cultivated merit and established virtue, fulfilling the causes and conditions for attaining the Dao. Yet now, they have forgotten, and neither recognize the ranks of immortals and sages nor understand the path for future generations of Dao-seeking scholars, good men, and good women. Nor do they comprehend the merits of almsgiving within the Dao sanctuary, the cultivation of longevity, or the causes and conditions for liberating the mud-pill essence. We beseech the Heavenly Worthy to explain in sequence, that future generations may know the bridge of goodness, the causes of goodness, and the fields of blessed merit.\"\n\nAt that time, the Heavenly Worthy, seated in the Seven Treasures Terrace of the Mystic Capital Jade Metropolis, raised a hand and snapped His fingers, exclaiming: \"Excellent! Excellent!\" The heavens trembled, and He addressed the Immortals King and the assembly: \"You have asked well, opening the way to enlightenment for all. This is most essential for future generations. Now, I shall explain to you the causes and conditions of former days. Build great ships and oars, construct great bridges, establish good causes and conditions, and cultivate blessed fields of merit—listen closely with your hearts.\n\nFrom countless kalpas past, from birth to death, you have now ascended to the rank of Heavenly Kings. Such inconceivable merit and virtue arise from cultivation. Your merits perfected, you gradually ascend to the supreme Dao fruit. With the six penetrations and wisdom, you descend to the lower seats. There are nine ranks of sages, nine ranks of perfected ones, and nine ranks of immortals. Do you understand? All these assembled here are those who, since the Kai Guang era, the Dragon Han and Red Clarity epochs, have endured kalpas of cultivation, accumulating merit and virtue. They have traversed the cycles of birth and death, entered the hells, endured boiling cauldrons and searing coals, climbed mountains of knives and forests of swords, clung to copper pillars and iron beds, swallowed fire and consumed embers. Some took the form of beasts, undergoing countless trials. Now, they have achieved perfection, attaining the realm of longevity—neither born nor dying, abiding in serene stillness.\n\nImmortal Kings, you must all know: the distance between mortals and sages is not far. Mortals who cultivate the Dao ascend to immortality, from immortality to perfection, from perfection to sagehood. From sagehood, through the accumulation of merit, all arise from the mortal realm. It is like building a tower—one must begin from the foundation. A journey of a thousand miles starts with a single step. Thus, when merit is complete and the three thousand virtues fulfilled, one ascends to heaven in broad daylight.\"\n\nHere ends the *Supreme Wondrous Scripture of the Numinous Treasure: The Flying Immortals, Upper Grade*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞玄灵宝飞仙上品妙经 经名：洞玄灵宝飞仙上品妙经。 撰人不详。 四经同卷。 底本出处：《正统道藏》洞玄部本文类。 洞玄灵宝飞仙上品妙经 道言：《飞仙经》者，出於太原之山玄妙宫中。 真人空虚法师，与十方太上五岳仙人，九天玉女七十万人之众来，在玄都玉京紫玉台之上，说《三昧无量神阮大经》，化於天下。 当尔之时，诸天仙众三十二万人来，稽首请问天尊曰：我等弟子，愚心六极，不解开闭。 昔蒙先师垂眷，赐授黄赤紫符、三洞真秘，行道救人，不自中替。 今世浅薄浮逸，人多不信道法、三洞之化。 其愚人皆信邪倒见，当入九幽长夜之府，无有出期。 愚人不信，无复奈何？ 大劫运至，天地将坏。 不久水来，荡除九亿万众。 人民崩散，与泥同流。 如水归海，何可以为化？ 天尊大慈之心，不审如此薄顽之人，何以救之？ 当有异法，可得闻不？ 天尊曰：汝所问甚是善哉，无量之道。 今有仙人之术，子但谛听，当次受汝。 道言：閰浮之国，化而不信。 欲求升仙，先求受箓。 黄赤紫符，开导之源。 后得三师，过度分了。 得真人无量三十六部经契，三天大明。 以受神咒，杀鬼生人。 道士治病，救济百姓，当受此经。 大无之众盘驮，九天兵符，召箓百鬼。 云雷大符，天捍厄。 太一真契，得仙之本也。 道士以受此内外法箓，便成仙人。 得道之次，当如法行道。 功满三千，白日升天。 庚申甲子本命日，六斋十直。 亦当烧香行道，消灾散祸，安宅求福。 一二行之，不得自隐而行之。 考及子孙，七祖父母，当受长夜九幽。 不但自身，即令下贱贫穷。 口舌官事，日日虚使，吏兵从其身。 子欲求道，在子心也。 一心奉道，亦得飞仙。 助人作斋，亦得飞仙。 当路作井，亦得飞仙。 教人作善，亦得飞仙。 供养道士，亦得飞仙。 救拔法门，亦得飞仙。 敬重老少，亦得飞仙。 月月建斋，亦得飞仙。 斋满三七，亦得飞仙。 不食供师，亦得飞仙。 口不说恶，亦得飞仙。 一心敬法，亦得飞仙。 不贪世业，亦得飞仙。 不不妬，亦得飞仙。 不坏人心，亦得飞仙。 不求好胜，亦得飞仙。 无有偏心，亦得飞仙。 平等一心，亦得飞仙。 口常好语，亦得飞仙。 布施道士，亦得飞仙。 看侍疾病，亦得飞仙。 借贷贫穷，亦得飞仙。 立治斋堂，亦得飞仙。 桥梁度人，亦得飞仙。 施人经书，亦得飞仙。 火起助灭，亦得飞仙。 救人悬乏，亦得飞仙。 水中接人，亦得飞仙。 念师忆道，亦得飞仙。 昼夜烧香，亦得飞仙。 助人斋厨，亦得飞仙。 为人立行，亦得飞仙。 供养给师，亦得飞仙。 不使师怒，亦得飞仙。 念道修行，亦得飞仙。 与师屋舍，亦得飞仙。 奉师勤苦，亦得飞仙。 心常向道，亦得飞仙。 日日长斋，亦得飞仙。 不偷人物，亦得飞仙。 行道不厌，亦得飞仙。 好善礼拜，亦得飞仙。 施人巾帽，亦得飞仙。 爱念孤贫，亦得飞仙。 教化弟子，亦得飞仙。 天祖年输，亦得飞仙。 岁食不缺，亦得飞仙。 不有违道，亦得飞仙。 投命为师，亦得飞仙。 种树千根，亦得飞仙。 渡头渡人，亦得飞仙。 道言：道士求仙学道，第一建斋，便有万神在空玄之中，吏兵万兆悉在斋堂之中。 子等一心，得讲论法事。 达此无量飞仙，天人万兆，玉女一十万人，太上无数之人，来下看人作斋。",
      "translated_text": "**The Wondrous Scripture of the Supreme Grade for Flying Immortals of the Cavern Mystery and Numinous Treasure**\n\nThe *Scripture of the Supreme Grade for Flying Immortals of the Cavern Mystery and Numinous Treasure* is of unknown authorship. Four scriptures share this scroll. The source text comes from the *Zhengtong Daoist Canon*, Cavern Mystery Section, Original Texts Category.\n\nThe Dao speaks: The *Scripture of Flying Immortals* emerged from the Mysterious Wondrous Palace of Mount Taiyuan. The Perfected One, Master of Emptiness and Void, together with the Supreme Ones of the Ten Directions, the Immortals of the Five Peaks, and seven hundred thousand jade maidens of the Nine Heavens, assembled upon the Purple Jade Terrace of the Jade Capital of the Mysterious Metropolis. There, they expounded the *Great Scripture of the Boundless Samādhi of the Divine Net*, transforming the world below.\n\nAt that time, three hundred twenty thousand immortals and celestial beings arrived, bowing their heads to inquire of the Heavenly Worthy: \"We, your disciples, are dull of heart and beset by the six extremes, unable to comprehend the opening and closing of the Dao. Formerly, we received the grace of our former masters, who bestowed upon us the Yellow, Red, and Purple Talismans, along with the true and secret teachings of the Three Caverns. We practiced the Dao to save others, never faltering in our resolve. Yet in this shallow and frivolous age, many do not believe in the Dao and the transformative power of the Three Caverns. Foolish people cling to perverse views, destined for the Nine Dark Hells of eternal night, with no hope of escape. Since they do not believe, what can be done? The great kalpa draws near, and heaven and earth will soon be destroyed. Before long, the waters shall rise, sweeping away nine hundred million beings. The people will scatter and dissolve like mud in the current, flowing into the sea like water—how can they be transformed?\n\nThe Heavenly Worthy’s heart of great compassion—how can such stubborn and benighted people be saved? Is there a special method we may hear?\"\n\nThe Heavenly Worthy replied: \"Your question is most excellent, an inquiry into the boundless Dao. Now, there is an art of the immortals—listen carefully, and I shall transmit it to you in due course.\"\n\nThe Dao speaks: In the land of Jambudvīpa, transformation meets with disbelief. Those who seek to ascend as immortals must first receive the registers. The Yellow, Red, and Purple Talismans are the source of enlightenment. Later, with the guidance of the Three Masters, one may cross over and attain perfection. Receiving the thirty-six scriptures and contracts of the Perfected One’s boundless *Three Heavens of Great Illumination*, along with the divine incantations, one may slay demons and revive the living. When Daoists heal the sick and deliver the people, they should receive this scripture.\n\nThe vast multitude of the Great Wilderness, the talismans of the Nine Heavens’ soldiers, the registers for summoning a hundred ghosts, the great talismans of clouds and thunder, the talismans for warding off calamities, and the true contract of the Great One—these are the foundation of immortality. When Daoists receive these inner and outer registers of the Dao, they become immortals. In the process of attaining the Dao, one must practice the Dao according to the method. When merit is complete after three thousand deeds, one ascends to heaven in broad daylight.\n\nOn the days of Gengshen and Jiazi, the days of one’s fate, and during the six fasts and ten auspicious days, one should burn incense and practice the Dao to dispel disasters, disperse misfortune, pacify the household, and seek blessings. Even a single or double practice must not be concealed. If one fails to do so, one’s descendants, seven generations of ancestors, and parents will be consigned to the eternal night of the Nine Dark Hells. Not only oneself but even the lowly and impoverished will suffer—endless lawsuits, disputes, and the daily harassment of officials and soldiers. If you seek the Dao, it lies within your heart. With a single heart devoted to the Dao, you too may become a flying immortal.\n\nAssisting others in holding fasts—you may become a flying immortal.\nDigging wells by the roadside—you may become a flying immortal.\nTeaching others to do good—you may become a flying immortal.\nProviding for Daoists—you may become a flying immortal.\nDelivering beings through the Dharma gate—you may become a flying immortal.\nRespecting the old and the young—you may become a flying immortal.\nHolding monthly fasts—you may become a flying immortal.\nCompleting three seven-day fasts—you may become a flying immortal.\nNot consuming the master’s offerings—you may become a flying immortal.\nNever speaking ill—you may become a flying immortal.\nDevoting oneself wholeheartedly to the Dharma—you may become a flying immortal.\nNot coveting worldly affairs—you may become a flying immortal.\nNeither flattering nor envying—you may become a flying immortal.\nNot harming others’ hearts—you may become a flying immortal.\nNot seeking to prevail—you may become a flying immortal.\nHaving no partiality—you may become a flying immortal.\nMaintaining an impartial and single heart—you may become a flying immortal.\nAlways speaking kindly—you may become a flying immortal.\nMaking offerings to Daoists—you may become a flying immortal.\nTending to the sick—you may become a flying immortal.\nLending to the poor—you may become a flying immortal.\nEstablishing fasting halls—you may become a flying immortal.\nBuilding bridges to ferry people—you may become a flying immortal.\nDistributing scriptures—you may become a flying immortal.\nHelping to extinguish fires—you may become a flying immortal.\nRescuing those in dire need—you may become a flying immortal.\nSaving people from drowning—you may become a flying immortal.\nRecollecting the master and the Dao—you may become a flying immortal.\nBurning incense day and night—you may become a flying immortal.\nAssisting in the fasting kitchen—you may become a flying immortal.\nEstablishing conduct for others—you may become a flying immortal.\nProviding for the master’s needs—you may become a flying immortal.\nNot angering the master—you may become a flying immortal.\nRecollecting the Dao and cultivating practice—you may become a flying immortal.\nOffering housing to the master—you may become a flying immortal.\nServing the master with diligence—you may become a flying immortal.\nDirecting one’s heart constantly toward the Dao—you may become a flying immortal.\nObserving daily fasts—you may become a flying immortal.\nNot stealing others’ belongings—you may become a flying immortal.\nNever tiring of practicing the Dao—you may become a flying immortal.\nRevering goodness and bowing in worship—you may become a flying immortal.\nGiving clothing and hats to others—you may become a flying immortal.\nCherishing the orphaned and poor—you may become a flying immortal.\nInstructing disciples—you may become a flying immortal.\nMaking offerings to heavenly and ancestral spirits—you may become a flying immortal.\nEnsuring no shortage of yearly provisions—you may become a flying immortal.\nNever violating the Dao—you may become a flying immortal.\nDedicating one’s life to the master—you may become a flying immortal.\nPlanting a thousand trees—you may become a flying immortal.\nFerrying people at crossing points—you may become a flying immortal.\n\nThe Dao speaks: For Daoists seeking immortality and studying the Dao, the foremost practice is to establish fasts. Then, ten thousand spirits will abide in the empty mystery of the void, and countless officials and soldiers will fill the fasting hall. With single-minded devotion, you may discourse on the Dharma. Attaining this boundless flying immortality, ten thousand celestial beings, a hundred thousand jade maidens, and countless Supreme Ones will descend to witness the people’s fasts.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1235,
      "start_sentence": 0,
      "end_sentence": 94,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.801151514053345,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\洞玄灵宝飞仙上品妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "斋法在勤，子等不可不慎之。 道言：尔时，飞天仙王，天帝仙王，三十六天仙王，复有仙乡童子，仙威童子，仙郡童子，仙度童子，仙鸦童子，仙真童子等，三万六千人，俱到大罗宫中，巡谒天尊。 头面着地，稽首作礼。 欢喜踊跃，依位而坐。 围绕天尊，三匝毕竟。 侍座良久，虔恭作礼。 仰承威光，得见诸天大圣。 今同会听，受《飞仙经》弥日继夜。 是时，众中有一仙人，姓昊名刚文，与太上真人论议，於义不得解释。 仙王时即上白天尊：未审二人孰是孰非，於众座思胜。 伏愿天尊，赐垂判释。 天尊即语：刚文无理，退仙之位，令在月中，伐於桂树。 不得同侣于今尔。 是时，仙王重白天尊：今日侍座，实为倾喜。 如此大圣等众，有三万六千人，同在道前。 圣人真人仙人，如斯等众，并是往时贤哲法师。 於虚空纵，有修功立德。 成道因缘，今由忘矣，不识仙圣阶品。 及将来世，学仙道士，诸善男子善女人等，悉皆不晓。 及诸布施，入於道场功德，学於长生，度脱泥丸因缘。 伏愿天尊，次为解说。 使来世人，知善桥梁，知善因缘，知善福田。 尔时，天尊在玄都玉京七宝台中，举身弹指，叹言：善哉，善哉。 天堂悉皆振动，即告仙王卿等，须能作此问，开悟一切。 将来后世，甚为要乎。 今当以次，为汝开示昔日因缘。 作大舟檝，作大桥梁。 作善因缘，作善福田、盛听在心。 汝昔从无量劫来，从生至死，今日得登天王之位。 功德如此，不可思议，皆从修来。 汝等功德成就，渐登无上道果。 六通智慧，往诸下座。 圣有九品，真有九品，仙有九品。 卿解乎？ 如此等众，并是往昔开光元年，龙汉赤明，皆逐劫而来。 修功立德，输转生死，入诸地狱。 擭汤炉炭，刀山剑树，铜柱铁床，吞火食炭。 或作畜生身，种种讫竟。 今得成就，至长寿处，不生不死，湛然当住。 仙王汝等须皆知，凡圣不相去离。 凡人学道至仙，从仙至真，从真至圣，从圣如许积功，皆从凡人间来。 譬如造台，先从下起。 千里之行，始於足下。 故谓功满三千，白日升天矣。 洞玄灵宝飞仙上品妙经竟",
      "translated_text": "The method of fasting lies in diligence—you must not be careless in this.\n\nThe Dao speaks: At that time, the Flying Celestial Immortals King, the Heavenly Emperor Immortals King, and the Thirty-Six Heavenly Immortals Kings, along with the Immortals’ Realm Youths, the Immortals’ Might Youths, the Immortals’ Prefecture Youths, the Immortals’ Salvation Youths, the Immortals’ Raven Youths, and the Immortals’ Perfected Youths—thirty-six thousand in all—together arrived at the Great Luo Palace to pay their respects to the Heavenly Worthy. They prostrated themselves, touching their heads to the ground in reverence. Overjoyed and exultant, they took their seats in due order, circumambulating the Heavenly Worthy three times before settling. After a long while in attendance, they bowed in devotion, gazing upward to behold the radiant majesty of the Heavenly Worthies and Great Sages. Now gathered in assembly, they received the *Scripture of Flying Immortality* day and night without cease.\n\nAt that time, among the assembly was an immortal named Hao Gangwen, who debated with the Supreme Perfected One but could not resolve their dispute. The Immortals King then addressed the Heavenly Worthy: \"We humbly request Your judgment—who is right and who is wrong in this debate? Each seeks to prevail before the assembly.\" The Heavenly Worthy declared: \"Gangwen is without reason. He shall be stripped of his immortal rank and banished to the moon, where he must fell the osmanthus tree. He shall not keep company with you henceforth.\"\n\nThen the Immortals King again addressed the Heavenly Worthy: \"Today, in Your presence, we are filled with boundless joy. Such a great assembly of thirty-six thousand—all standing before the Dao. These sages, perfected ones, and immortals are all past worthies and Dharma masters. In the vast emptiness, they cultivated merit and established virtue, fulfilling the causes and conditions for attaining the Dao. Yet now, they have forgotten, and neither recognize the ranks of immortals and sages nor understand the path for future generations of Dao-seeking scholars, good men, and good women. Nor do they comprehend the merits of almsgiving within the Dao sanctuary, the cultivation of longevity, or the causes and conditions for liberating the mud-pill essence. We beseech the Heavenly Worthy to explain in sequence, that future generations may know the bridge of goodness, the causes of goodness, and the fields of blessed merit.\"\n\nAt that time, the Heavenly Worthy, seated in the Seven Treasures Terrace of the Mystic Capital Jade Metropolis, raised a hand and snapped His fingers, exclaiming: \"Excellent! Excellent!\" The heavens trembled, and He addressed the Immortals King and the assembly: \"You have asked well, opening the way to enlightenment for all. This is most essential for future generations. Now, I shall explain to you the causes and conditions of former days. Build great ships and oars, construct great bridges, establish good causes and conditions, and cultivate blessed fields of merit—listen closely with your hearts.\n\nFrom countless kalpas past, from birth to death, you have now ascended to the rank of Heavenly Kings. Such inconceivable merit and virtue arise from cultivation. Your merits perfected, you gradually ascend to the supreme Dao fruit. With the six penetrations and wisdom, you descend to the lower seats. There are nine ranks of sages, nine ranks of perfected ones, and nine ranks of immortals. Do you understand? All these assembled here are those who, since the Kai Guang era, the Dragon Han and Red Clarity epochs, have endured kalpas of cultivation, accumulating merit and virtue. They have traversed the cycles of birth and death, entered the hells, endured boiling cauldrons and searing coals, climbed mountains of knives and forests of swords, clung to copper pillars and iron beds, swallowed fire and consumed embers. Some took the form of beasts, undergoing countless trials. Now, they have achieved perfection, attaining the realm of longevity—neither born nor dying, abiding in serene stillness.\n\nImmortal Kings, you must all know: the distance between mortals and sages is not far. Mortals who cultivate the Dao ascend to immortality, from immortality to perfection, from perfection to sagehood. From sagehood, through the accumulation of merit, all arise from the mortal realm. It is like building a tower—one must begin from the foundation. A journey of a thousand miles starts with a single step. Thus, when merit is complete and the three thousand virtues fulfilled, one ascends to heaven in broad daylight.\"\n\nHere ends the *Supreme Wondrous Scripture of the Numinous Treasure: The Flying Immortals, Upper Grade*.",
      "overlap_context": "rtal.\n\nThe Dao speaks: For Daoists seeking immortality and studying the Dao, the foremost practice is to establish fasts. Then, ten thousand spirits will abide in the empty mystery of the void, and countless officials and soldiers will fill the fasting hall. With single-minded devotion, you may discourse on the Dharma. Attaining this boundless flying immortality, ten thousand celestial beings, a hundred thousand jade maidens, and countless Supreme Ones will descend to witness the people’s fasts.",
      "start_char": 1235,
      "end_char": 2028,
      "start_sentence": 95,
      "end_sentence": 139,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.895101308822632,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\洞玄灵宝飞仙上品妙经.txt",
        "category": "本文类"
      }
    }
  ]
}