{
  "source_id": "洞灵真经注",
  "source_file": "chunked_daozang\\洞灵真经注.json",
  "total_chunks": 24,
  "total_original_chars": 21985,
  "total_translated_chars": 118906,
  "total_translation_time": 585.4712612628937,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\玉诀类\\洞灵真经注.txt",
    "category": "玉诀类"
  },
  "full_translation": "**The Authentic Scripture of Penetrating Spirit (Annotated)**\n\n**Scripture Title:** *The Authentic Scripture of Penetrating Spirit* [Annotated]. Originally annotated by He Can, likely composed between the Tang and Song dynasties. Three fascicles. Base text sourced from: *Daoist Canon of the Zhengtong Era*, *Wondrous Teachings Section*, *Jade Instructions Category*. Collated with: *Sibu Congkan*, Third Series, facsimile of the Song-dynasty printed edition held in the Tieqin Tongjian Library of the Zhai family of Changshu (hereafter referred to as the *Song Edition*). This work also exists in a nine-fascicle version in the *Complete Library of the Four Treasuries*.\n\n**Table of Contents**\n**Fascicle One**\n1. The All-Encompassing Dao\n2. Applying the Dao\n3. Governing by the Dao\n\n**Fascicle Two**\n4. The Dao of the Ruler\n5. The Dao of the Minister\n6. The Dao of the Worthy\n\n**Fascicle Three**\n7. The Dao of Instruction\n8. The Dao of Agriculture\n9. The Dao of Warfare\n\n---\n\n**The Authentic Scripture of Penetrating Spirit, Fascicle One**\nAnnotated by He Can\n\n**1. The All-Encompassing Dao**\nWhen the mind merges with the ultimate void, virtue penetrates the subtle and mysterious. Its merit aligns with the four seasons, and the common people transform of themselves.\n\nKang Cangzi dwelled on the southern slope of Mount Yu for three years. *Mount Yu*, as recorded in the *Yugong* chapter of the *Book of Documents*, lies in Xuzhou. The *Canon of Shun* states: \"Gun was executed at Mount Yu.\" It was situated in the eastern frontier and later belonged to Lu. *Southern slope* refers to the mountain’s southern face. The *Zhuangzi* cites this passage as: \"He dwelled north of Mount Kunlun,\" which refers to this same mountain. The local customs knew no plagues or pestilence, and the grain harvests ripened in succession. Where the worthy and sagely dwell, Heaven protects and spirits aid, so that nearby regions suffer no plagues or pestilence, and the five grains yield abundant harvests. *Successive ripening* is called *still*. The people secretly said to one another...\n\nWhen Master Kangcang first arrived, I was struck with astonishment—*fresh with wonder* describes my reaction. I marveled at his empty heart and tranquil stillness, so far removed from common sentiment. Now, as I reckon each day, I find it lacking, yet when I tally the year, I find it abundant. Could he be a sage? Having witnessed his beneficence, I suspect he may indeed be one. Why do we not together enthrone him in sacrifice and worship him as our lord, establishing ancestral temples and honoring both soil and grain? Why not offer him the ritual vessels, perform the invocations, and serve him as our sovereign?\n\nWhen Master Kangcang heard this, his expression showed unease. His disciple Yanshuai, following his lead, sought to persuade him. *Yanshuai was one of Master Kangcang’s disciples.* Wishing to fulfill the people’s desire, he thus urged his master. Master Kangcang replied: I have heard that the perfected one dwells like a corpse in a humble chamber, while the common folk roam wildly, unaware of where they go. The perfected one, with a heart stilled and thoughts extinguished, resembles a corpse—free from affairs, he abides alone in his modest dwelling. Yet the people, drawn by admiration, flock to him in devotion. But when one examines their allegiance, it is not born of wisdom. Now, the elders and youths of Yu’s folk whisper among themselves, preparing to honor me with ritual vessels. Am I truly such a man? I originally sought seclusion to preserve the Way and follow my true nature. Now, to be exalted with ritual vessels is to become the very mark of worldly distinction. This is why I remain unsettled by the words of Lao Dan: \"I practice non-action, and the people transform themselves; I refrain from meddling, and the people prosper on their own; I cherish stillness, and the people correct themselves.\" Yet now, the opposite has come to pass. Thus, I cannot set aside my disquiet.\n\nYanshuai said:\n\n\"Nay,\"—\"nay\" means \"not so.\" Consider the shallow puddle: the great fish cannot turn its body within it, while minnows and loaches dominate its bounds. The modest hillock: the mighty beast cannot conceal its frame upon it, while wretched foxes claim its omens. A length of eight *chi* is called a *xun*; twice that is a *chang*. A *wu* is a pool. *Huan* means to turn back. The *ni* is a small fish with legs. *Zhi* means to monopolize. Six *chi* make a *bu*; seven *chi* make a *ren*. *Nie* signifies misfortune. *Xiang* means auspiciousness. Thus, shallow waters cannot contain the great fish, nor can small hills hide the massive beast. This illustrates that one as lofty as Kang Cang must require ample emolument.\n\nMoreover, to honor the worthy and employ the capable, to incline toward goodness and pursue advantage—this has been the way since the time of Yao and Shun. How much more so for the folk of Yu? Sir, you should heed this.\n\nKang Cangzi said: \"Ah, come! Ah!\"—*Xi* is an exclamation, expressing surprise at their failure to grasp his intent. Wishing to instruct them in loftier matters, he called out, \"Come!\"\n\n\"Do those two understand?\"—The \"two\" refer to Yao and Shun. \"Understand?\" implies, \"How could they?\" The beast that fills a carriage, once parted from the mountain, is ensnared by nets and traps. The fish that swallows a boat, once cast from the water, is tormented by ants and crickets. Thus, birds and beasts seek the heights for their dwelling, while fish and turtles seek the depths. For one who preserves his form and life, to conceal himself requires nothing less than profound obscurity. *Han* means fullness. *Jie* means solitary. *Miao* means distant.\n\nI speak to you of the roots of great disorder, which trace back to the era of Yao and Shun and will endure for a thousand generations hence. In a thousand generations, there will surely be men who devour one another. *Ruo* means \"you.\" For matters may begin in success and end in failure, start with fortune and conclude with misfortune—how can one be certain? Thus, Yao and Shun’s abdication brought a momentary glory, but their legacy flowed into later ages, giving rise to usurpation and regicide. As *Zhuangzi* says: \"Yao and Shun abdicated and became emperors; Zhi Kuai abdicated and perished. Tang and Wu contended and reigned; Bai Gong contended and was destroyed.\" Is this not the proof?\n\nOnly by refusing to establish a reputation for goodness can one ensure that no traces remain to invite emulation. Before he could finish speaking, the man Rongzhi Chu’s countenance darkened, and he drew his knees close upon his mat, saying: \"My years advance ever onward—how may I entrust my life’s work to these words?\" Rongzhi Chu is the Nan Rong Chu of whom *Zhuangzi* speaks. Having heard such profound teachings, his expression changed, and he gathered himself upon his seat, entreating instruction with reverence.\n\nKang Cangzi said: \"Preserve your form, embrace your life, and let not your thoughts churn restlessly. If you persist in this until the end of your days, you may yet attain these words. *Yingying* means ceaseless motion. *Xu* means conclusion. To preserve form and embrace life is to still the churning of thought, emptying the mind into profound stillness, where the Dao naturally abides. If you do so until the end of your days, you may attain these words.\n\nYet my talents are meager and insufficient to transform you. Why not journey south to seek my master, Dan?\"—Dan is the courtesy name of Laozi.\n\nKang Cangzi, having dismissed Rongzhi Chu, did not abandon the folk of Yu but soared like a dragon through the world. *Xie* means to send away. \"Did not abandon the folk of Yu\" means he remained in reclusion, wandering like a dragon, ascending and descending with the times.\n\nWater’s nature is to be clear, but earth muddies it, so it cannot remain clear. Man’s nature is to live long, but things muddy it, so he cannot attain longevity. *Gu* means disorder. Man’s nature is to live a full span, but external things disorder it, preventing him from completing his natural years.\n\nThings exist to nourish our nature, yet the deluded of this age often use their nature to nourish things, failing to distinguish weight from lightness. Clothing and food nourish our nature and cannot be lacking for even a day. Yet the deluded harm their nature in pursuit of things, accumulating more while their nature suffers ever greater injury—unaware that nature is weighty and things are light. This is a complete inversion.\n\nThus, the sage’s approach to sounds, colors, and flavors is this: if they benefit his nature, he takes them; if they harm his nature, he discards them. This is the way to preserve one’s nature. A thousand men draw their bows, all aiming at a single target, and the target is struck without fail. A thousand things clamor, all harming a single life, and that life is wounded without exception. *Juan* means to discard. *Cao* means to hold. *Zhao* is the target. *Zhangzhang* means bustling. Thus, the sage’s regulation of the myriad things is to preserve their Heaven. The sage restrains the myriad things, preventing them from harming his nature, thereby preserving his Heavenly truth. When Heaven is preserved, spirit is preserved.\n\nThe man of whole spirit requires no deliberation to penetrate all things, no scheming to act rightly. His essence illuminates all without, his will congeals within the cosmos, and his virtue descends like Heaven. Such a one may be the Son of Heaven yet remain unarrogant, or a common man yet remain untroubled—this is the man of whole Dao. The man of whole spirit is filled with wisdom and insight, his essence shining boundlessly, his will and qi congealing within the cosmos, his virtue of nurturing and sustaining equal to Heaven and Earth. Whether exalted as the Son of Heaven or lowly as a common man, he does not alter his resolve in response to poverty or prosperity.\n\nA mind level and upright, unenticed by external things, is called *qing* (pure). Purity sustained becomes *ming* (lucidity). Lucidity sustained becomes *xu* (emptiness). In emptiness, the Dao is whole and dwells within.\n\nWhen Qin Yi died, Kang Cangzi wept for him. Qin Yi was an ancient man of the Dao, a friend of Laozi. His disciple asked: \"When all the world dies, Master, why do you weep?\"—*Yi* refers to a disciple, one who serves. The way of life and death is constant across past and present. The enlightened comprehend this and do not weep—is that not so?\n\nKang Cangzi said: \"When all the world weeps, how can I not weep? To weep in accord with things is to weep without truly weeping.\"\n\nHis disciple said: \"Weeping must express sorrow, yet Master, you have not begun to grieve. Why?\"\n\n\"Unbegun\" means \"never yet.\" The world’s weeping must arise from sorrow and pain—yet though you weep, Master, no grief appears. May I ask why?\n\nKang Cangzi said: When all under heaven shares no joy with me, where would I find sorrow? Joy and sorrow are the common lot of men. The enlightened see broadly—what distance lies between kin and stranger? Since I share no joy, I take no sorrow.\n\nWhat falls away is called water; what falls away from water is called *qi*; what falls away from *qi* is called emptiness; what falls away from emptiness is called the Dao. \"Falling away\" means casting off. Casting off earth is water; casting off water is *qi*; casting off *qi* is emptiness; casting off emptiness is the Dao. Thus the perfected person, unbound by joy or sorrow, attains the ultimate.\n\nEmptiness is the Dao’s body; stillness is the Dao’s ground; principle is the Dao’s warp; discernment is the Dao’s eye. To say the perfected person can be empty, still, discerning, and principled is to say they unite with the Dao’s form and grasp its warp and weft.\n\nThe Dao preserves spirit; virtue expands capacity; ritual orders conduct; things nourish the body. These four sustain life and cannot be briefly forsaken.\n\nThose who favor white things deem black defiled; those who favor black things deem white defiled. How then can I know what under heaven is truly pure or defiled? Thus I do not fix upon purity or defilement.\n\nThe dim-sighted see yellow as red, blue as black—what I call black and white, how can the discerning not see as crimson and yellow? How then can I know what under heaven is the true color? Thus I do not flee from colors.\n\n*Mao* means vertigo. *Tou* is yellow; *cheng* is red. Those with vertigo cannot see clearly, mistaking yellow for red and green for black—just as the common mind clings falsely to purity and defilement. Even a great sage cannot correct this, so I do not fix upon purity or defilement nor drift among colors.\n\nThose who love wealth excessively see nothing else worth loving; those who love horses excessively see nothing else worth loving; those who love books excessively see nothing else worth loving. How then can I know what under heaven is truly lovable or detestable? Thus I do not see things as worthy of attachment, and nothing can disturb my constancy.\n\n\"Fruit\" means determination; \"preserve\" means cherishing. Duke Huai of Chen sent his minister Dao to pay a visit to Lu. Huai was his posthumous name; Liu was his given name. Dao was the name of Chen’s minister.\n\nViscount Sun privately asked: The Viscount Sun clan had long served as ministers of Lu. Does our state have a sage? Do you know of him?\n\nThe sage referred to Confucius.\n\nThe minister of Chen asked: How can you be certain of his sagacity?\n\nViscount Sun said: He can set aside the mind and use the body.\n\nThe sagely realm transcends the ordinary—how can common sentiments fathom it? They see only his ability to handle worldly affairs and take that as proof of sagacity, yet how can they know his true sagacity?\n\nThe minister of Chen said: Our humble state is small, yet it too has a sage, different from what you have heard.\n\nHe asked: Who is this sage?\n\nThe minister of Chen said: There is one called Kang Cangzi, who partially attained the Dao of Lao Dan. Among his disciples, he is most renowned—hence \"partially attained.\" He can use his ears to see and his eyes to hear.\n\nDuke Ding heard this and found it strange. He sent the Viscount Sun clan to return the visit and invite Kang Cangzi, receiving him with the rites due an upper minister.\n\nKang Cangzi arrived and was lodged in the secondary hall. The Duke of Lu spoke humbly to inquire of him.\n\nKang Cangzi said: I can hear and see without using ears or eyes—it is not that I reverse their functions, as the messenger mistakenly reported.\n\nThe Duke said: How can this be? You increase my wonder. What is this Dao like? I truly wish to hear of it.\n\nKang Cangzi said: My body unites with mind, mind with *qi*, *qi* with spirit, spirit with nothingness. Though there is a boundary of being, a resonance of sound—whether distant beyond the eight wilds or near within the space between brows and lashes—whatever comes to me, I know it completely, yet do not know *how* I know it.\n\nWhat my seven orifices and limbs perceive, what my six viscera, five organs, and heart-mind know—these I know of myself. When mind and form merge, spirit and *qi* mysteriously align, utterly forgotten, one with nothingness—then the mind grows ever stiller and wisdom ever more far-reaching, spirit ever more silent and illumination ever clearer. Principle reaches its limit and naturally flows; without thought, one gazes into the profound.\n\nWho but the supremely sagely and spiritually attuned can attain this? This is indeed the pivotal essence of numinous reality, the wondrous Dao of profound mystery.\n\n**Using the Dao, Second Chapter**\n\nNothing fails to benefit things; it accords with the heart of Heaven. Mastering oneself, one returns to benevolence; transformation spreads, and punishments are set aside.\n\nHeaven cannot be trusted; falling cannot be trusted; men cannot be trusted; the heart cannot be trusted. Only the Dao can be trusted. How can worthy rulers and outstanding scholars know this?\n\nOf old, Jie trusted Heaven and his ancestral dominion over the Four Seas, yet he did not cultivate the Dao, so Heaven took his state and granted it to Yin. Zhou likewise trusted Heaven and his ancestral dominion over the Four Seas, yet he did not personally practice the Dao, so Heaven took his state and granted it to Zhou.\n\n\"Granted\" means \"bestowed\"; \"ancestral\" means \"primary.\" The Xia tyrant Jie and the Yin tyrant Zhou indulged in excess and extravagance, claiming their mandate came from Heaven. Yet they acted with utter cruelty, neglecting the Dao, so Heaven took their states and bestowed them upon Tang and Wu.\n\nNow, the slothful farmer trusts that falling seeds produce all grains, yet if he does not exert himself in the Dao, weeds will steal his harvest and leave it overgrown. The indolent farmer trusts that seeds produce grain but does not diligently weed or plow, so the fields become choked with weeds.\n\nThus he cannot reap his harvest.\n\nThe Lord of Qi trusted in human nature’s propensity for yielding and deference, yet he did not comprehend the Dao. He entrusted his entire realm to others, who in truth were like kites and jackals, seizing his state. *Lord* refers to the ruler, namely Duke Jian of Qi. Trusting in human nature’s lack of clarity in yielding and deference, he was assassinated by Chen Heng, who took his state. *Kites and jackals* is a metaphor for rapacity and cruelty.\n\nWhenever one does not cultivate the Dao but follows the heart’s inclinations as a teacher, nurturing desires to flourish and multiply, calamities and illnesses arise in swarms, harming the body and shortening life—such is the heart’s harm to the self. When one takes the heart as teacher and does not follow sagely teachings, desires burn fiercely, and a hundred misfortunes gather. This is how the heart harms the body. *Swarms* means groups; *arise* means to stir; *harm* means to injure.\n\nThus it is said: only the Dao can be trusted. The Dao is vast, tranquil, and serene, unstained by attachment. If one empties the heart and returns to the Dao, body and life are preserved.\n\nHeaven, without the Dao, cannot endure long; Heaven attains the One and becomes clear, Earth attains the One and becomes stable. The common people, without the worthy, cannot be pacified and obedient; governance, without talent, cannot be harmonized and ordered. When the worthy and talented are all employed, the Dao is used to order things.\n\nThose who employ the Dao do not display their use of it; their blessings nourish the myriad things, yet they claim no merit. Their hidden merits and subtle aid allow the people to say, “We are naturally thus.” Their spirit flows and their deeds flourish, their numinous blessings enduring long. *Flows* means to circulate. When the workings of spirit are unimpeded and virtue’s deeds flourish, accumulated goodness gathers, and blessings flow to descendants.\n\nTo know and distinguish is called *discernment*; to know without distinguishing is called the *Dao*. Discernment is for governing people; the Dao is for pacifying them. Analyzing and distinguishing things guides people to abandon evil and embrace good—this is how one governs. Embracing vastness, dwelling in tranquility, refraining from praise or blame—this is how one pacifies and stills restless striving.\n\nThe rooster crows at dawn, toiling under the sun, sweat dripping to the ground, resting only at midnight—such is the farmer’s Dao. *Dawn* refers to the cock’s crow at daybreak; *midnight* is the middle of the night; *toiling under the sun* means exposed to the sun’s heat; *only* means barely.\n\nBending to gather, reaching to take, sharpening the mind like an awl, straining thought to concentrate, seeking profit and gain—such is the merchant’s Dao.\n\nSwallowing qi and nurturing spirit, cutting off thoughts and reducing cares, transcending and ascending lightly, refining the essence of the sun to attain immortality—such is the noble adept’s Dao. *Swallowing qi* refers to embryonic breathing and the Five Sprouts; *nurturing* means to cultivate; *cutting off* means to sever; *essence of the sun* means absorbing solar essence; *refining immortality* means refining one’s substance until ascent to immortality is achieved.\n\nDirecting emotions and focusing thoughts, dedicating oneself wholly to one’s duties, deliberating with such devotion that sleep is forgotten, planning to fulfill one’s office—such is the minister’s Dao. Concentrating emotions and rectifying thoughts, devoting loyalty to the ruler one serves; guiding governance and measuring affairs to render service in one’s office—this is the minister’s Dao.\n\nPurifying the heart and reducing thoughts, examining and verifying close attendants, striving to seek worthy talent to pacify the myriad people—such is the ruler’s Dao. *Purifying the heart* means diminishing desires; *reducing thoughts* means being selfless; *close attendants* refers to courtiers.\n\nIf each follows the order of their aspirations and measures, not obstructing their professional conduct, this is called *the world possessing the Dao*. Farmers and merchants each preserve their vocations; enlightened rulers and worthy ministers each cultivate their Dao—thus the world follows its order, and professional conduct is secure.\n\nGuiding the sinews and bones preserves the form; pruning emotions and desires preserves the spirit; quieting speech preserves blessings. Mastering these three preservations is called *pure worthiness*.\n\nWhen the Dao and virtue flourish, ghosts and spirits assist; when trust and integrity are sincere, the noble converge; when rites and propriety are complete, the petty submit.\n\nThose with discernment are self-assured; those without discernment are also self-assured. Those with the Dao are silent and still; the dull and obtuse are also silent and still. Things inherently possess what seems right but is wrong, what seems wrong but is right. Some wail first and laugh later; some begin auspiciously and end in misfortune. Some bodies may be embraced, yet their talents cannot be; some talents may be revered, yet their bodies cannot be. Excessive reverence precludes intimacy; excessive intimacy precludes reverence. Embracing may lead to estrangement; estrangement may lead to embrace. Excessive favor breeds resentment; excessive love invites hatred.\n\nSome value speed, some value slowness; some value straightness, some value curvature. The suitability of all affairs arises from the subtlest origins—one cannot be ignorant of them, which is why the wise find them difficult.\n\nStillness allows spirit to penetrate; adversity allows intent to penetrate; nobility allows speech to penetrate; wealth allows the body to penetrate—such is the nature of principle and circumstance. Some texts read: *such is the nature of principle, the force of circumstance.*\n\nThose who share the Dao love one another; those who share chrysanthemums envy one another. Those who give love one another; those who take envy one another. Those who share suffering love one another; those who share strength envy one another—this is the natural human condition. When emotions connect without seeking, they love; when competing for ability and striving for superiority, they envy—such is the force of circumstance.\n\nTalented yet fond of humility, poor and lowly yet not obsequious, enduring toil yet not deeming it disgrace, noble and wealthy yet increasingly reverent and diligent—this may be called one who possesses virtue.\n\n**Section Three: The Dao of Governance**\nEnforce the decrees of Heaven and act accordingly, without regard for near or far. Distant lands converge as one, submitting at the mere sight of virtue.\n\nMen cannot fathom the cycles of Heaven’s four seasons—cold and heat, nor the movements of sun, moon, and stars. Yet if they knew the proper course of Heaven’s seasons—cold and heat, sun, moon, and stars—then all living creatures of blood and qi would find their place and rest secure in their procreation.\n\nMinisters likewise cannot fathom where their lord’s rewards, punishments, ranks, and emoluments will fall. Yet if they knew where such bestowals were fitting, then the near and far, worthy and unworthy alike would exhaust their talents and strengths to be of use.\n\nWhen trust is complete, the realm is at peace; when trust is lost, the realm is in peril. When the common people toil exhaustively and their resources are spent, contentious and harmful thoughts arise, and trust is broken. When men do not trust, it is because governance is unjust. When governance is unjust, it is the fault of the officials. When officials are at fault, it is because punishments and rewards are uneven. When punishments and rewards are uneven, it is because the lord is not diligent and enlightened. When the lord is diligent and enlightened, punishments and rewards are unified; when punishments and rewards are unified, officials uphold the law; when officials uphold the law, governance flows downward; when governance flows downward, the people find their place and mutual trust is restored. Thus we know that the loss of trust throughout the realm stems from the lord’s lack of diligence and enlightenment.\n\nKang Cangzi dwelled in Xirang for five years. (Xirang was a place name in Zhou.) King Ling dispatched Minister Ji to present a bamboo basket of silk and threaded jade. (King Ling was King Ling of Zhou; Minister Ji was a minister of Zhou. *Lu* was fine jade.) King Ling, admiring Kang Cangzi’s virtue, sent Minister Ji with gifts of jade and silk to summon him. (The *fei* was a basket for holding silk; *ren* was the cord used to string jade.) The king said: “I, a humble and unworthy youth, have disgraced the throne. Floods and droughts come unseasonably—how, as a mere man, may I avert them?”\n\nKing Ling said: “I, a shallow and unworthy youth, have failed in virtue and disgraced the royal seat, bringing untimely floods and droughts that cause the people to suffer hunger. I humbly ask for the method to dispel these calamities.”\n\nKang Cangzi replied: “Floods are the disorder of yin. In governance, yin corresponds to punishment; in human affairs, it corresponds to selfishness. (*Li* means disorder. Water is a yin image, and yin governs punishment. Water also resembles hidden, selfish currents.) If punishments are unjust and human affairs are rife with selfishness, then the disorder of floodwaters arises.\n\nDrought is the excess of yang. In governance, yang corresponds to virtue; in human affairs, it corresponds to excess. (Drought is a yang image. Yang governs virtue. Yang also resembles ostentation, arrogance, and excess.) If the lord does not cultivate virtue and human affairs are marked by extravagance, then the calamity of great drought arises.”\n\nChu (Kang Cangzi’s given name) concluded: “Whenever floods or droughts occur, the Son of Heaven should rectify punishments and cultivate virtue, while all officials should eliminate selfishness and guard against excess. Thus, by correspondence, the calamities will dissipate, and a hundred blessings will arrive.” (All subsequent references follow this pattern.)\n\nIn Zheng, there were the Hu jade tablet and the Rong bow. Hu was the name of a state. *Feng gui* refers to a large jade tablet, while *Rong gong* refers to a type of bow. These two objects originally belonged to the state of Hu and were later obtained by Zheng. At another time, Zheng failed to attend the *tong* assembly with Jing. *Yishi* means \"at another time.\" The feudal lords’ formal audience with the overlord was called *tong*. Jing was the former name of Chu. At that time, Chu was powerful, and the feudal lords gathered to pay court to it during the scheduled assembly. Zheng arrived late, so Jing said, “You must hand over the *feng gui* and *Rong gong*; otherwise, we will bring our troops against you.” Relying on its strength, Jing acted unjustly, using Zheng’s tardiness as a pretext to coerce and extort the two treasures.\n\nThe lord of Zheng was troubled by this. He drove his carriage to see Kang Cangzi and said, “The *feng gui* and *Rong gong* were obtained from Hu by our former lord, passed down through generations as tokens of merit and virtue to be cherished by our descendants. Now Jing, relying on its size, demands them, threatening military action if we refuse. Our state will be in peril. I wish to send other jade tablets and bows in their place—what do you think?” *Other jade tablets* refers to different jade tablets.\n\nKang Cangzi replied, “My lord, put your mind at ease for now. Even Jing possesses treasures of its own. I shall adorn Jing’s treasure to absolve you of blame—though Jing itself cannot do this. *Shi* means ‘to defer.’ To deceive a great state with counterfeit jades is to tarnish our integrity with falsehood. Though the blame may be postponed, it will ultimately lead to punishment. You must present the genuine articles.” He urged the lord of Zheng not to send substitutes.\n\n“Now Jing, over a trivial offense, wields its might and punishment, indulging in unjust aggression to plunder and weaken its allies. Jing will lose the allegiance of the feudal lords. When the lords hear of this, they will take warning, strengthen their defenses, and unite in righteous assembly, with Zheng at the forefront. My lord, wait patiently—could this not be a blessing in disguise?” *Qian* suggests insignificance; *fu* means “to rely on”; *cheng* means “to indulge”; *lunbi* means “peers” or “equals”; *gu* means “for now.”\n\nZheng’s tardiness was indeed a minor fault, but Jing, relying on its strength, sought to impose its will and punishments, coercing the surrender of the jade and bow while encroaching upon its allies. Such greed and lack of virtue would surely cost it the allegiance of the feudal lords.\n\nThus, Zheng sent the Hu jade tablet and Rong bow. Before they reached Ying (the capital of Jing), the people of Jing heard of it—likely of Kang Cangzi’s counsel. They said, “They follow the words of a sage. How can we accept these gifts, exposing our injustice to the world and giving the feudal lords cause to resent us?” They promptly returned the gifts and treated Zheng with even greater favor.\n\nHuman nature desires life and fears death, seeks security and shuns peril, craves honor and avoids disgrace. When people attain their desires, they are joyful and at peace; when they do not, they suffer and face danger. If a ruler indulges his desires, then all officials and administrators will likewise pursue theirs. *Fang* means “to indulge.” *Baili* refers to all officials; *shu guo* refers to the heads of various affairs. *Zhan* means “to extend.” If officials and administrators all pursue their desires, then the people of the realm—whether poor or wealthy—will exhaust their strength or their wealth. The four classes (scholars, farmers, artisans, and merchants) will lose their proper order, and none will attain their desires.\n\nWhen the people of the realm cannot attain their desires, they will band together, clinging to one another, fleeing and hiding, drifting like floating weeds, gathering wild fruits to sustain their lives. *Jun* means “to gather”; *cai* means “to collect.” They will forage for wild fruits to preserve their lives. If officials then pursue and capture them, they will be overwhelmed by hardship and danger, and thoughts of rebellion will arise. If such rebellious thoughts spread, the state will no longer be the ruler’s own.\n\nDo not covet population growth, for the people will flee from you. Do not fortify your cities excessively, for the people will be exhausted. If taxes are not moderate, the poor will grow poorer. If punishments are inconsistent, the powerful will grow more powerful. If laws and prohibitions are not enforced, the state will collapse. *Zhong* means “balanced.” If officials are unworthy, then leniency and severity will be misapplied. Some may even compete with the people for profit, breeding cunning and deceit, making the people treacherous and difficult to govern.\n\nWhen the people are difficult to govern, the ruler becomes suspicious. When the ruler is suspicious, the people grow more confused. When the people are confused, officials toil in vain. When officials toil in vain, rewards fail to encourage, and punishments fail to deter. The state becomes easily agitated and difficult to pacify—all because the right people are not in office.\n\nThe essence of governance lies in carefully selecting officials. *Li* means “to be diligent.” If a scholar’s talent and conduct are esteemed by his village, entrust him with village affairs. If his talent and conduct are esteemed by his county, entrust him with county affairs. If his talent and conduct are esteemed by his province, entrust him with provincial affairs. If his talent and conduct are esteemed by the state, entrust him with state affairs. Only then will there be no hidden talents left unutilized.\n\nIf someone commits a transgression in the village, admonish them. *Li* means “offense.” If they do not reform, send them to the county for punishment. If they still do not reform, send them to the province for exile. If they persist in their transgressions, execute them.\n\nAnd only then can there be no rebellious conduct.\n\nIf this is truly so, every person under heaven will harbor no seeds of disobedience, resentment, indolence, or arrogance in their hearts—this is called *jingren* (the settled people). When worthy talents are employed and the violent and wicked turn toward goodness, the people of the world will be at peace.\n\nOf all the affairs of the world, none is greater than seeking out scholars. Of all the ways scholars await being sought, none is better than *tongzheng* (open governance). And of all the virtues of open governance, none surpasses *jingren*. When the ruler is enlightened by sagely teachings, scholars will flock to him. When many worthies govern together, nothing is better than *jingren*.\n\nThe talents of *jingren*, however, are scarcely found among those judged by literary composition—perhaps only four or five in a hundred. For literary compositions are often florid and deceitful, lacking substance. If one were to rigorously assess the talents of *jingren* by their writings, not even four or five in a hundred would meet the mark.\n\nIf judged by their speech, perhaps one or two in ten might suffice. For those who speak well may not possess virtue, and those who possess virtue may not speak well—thus, only one or two in ten may prove true.\n\nBut if judged by their *qi* and settled demeanor, eight or nine in ten will be genuine. The worthy and good have broad minds and relaxed bodies; their *qi* is harmonious and unhurried. Their movements and bearing invariably align with propriety. By carefully observing these signs, one may identify eight or nine out of ten.\n\nAll this depends on the discernment and judgment of a sagacious king in a prosperous age. Even if worthy talents exist externally, without a ruler’s clear discernment, they cannot be properly selected.\n\nIn a declining age, if rulers select scholars by literary composition, cunning and extravagance will flourish, while refined and sincere voices will retreat. When florid writing is prized in a degenerate era, those of true simplicity will not come forward.\n\nIf scholars are chosen by their speech, glib and ostentatious men will thrive, while forthright and loyal remonstrators will fade into obscurity. When those who flaunt their eloquence are esteemed, the candid and upright will withdraw.\n\nIf scholars are selected by their *qi* and settled demeanor, those who appear upright but harbor wickedness will be exalted, while those of pure cultivation and true substance will remain hidden. This occurs when rulers lack discernment and fail to choose the right people.\n\nIn such cases, the more \"worthies\" are appointed, the more governance strays; the more decrees are issued, the more the people descend into chaos. To mistake the unworthy for the worthy is to invite greater disorder.\n\nThe world is the greatest of vessels; the throne of the emperor is the weightiest of positions. With the right scholars, there is peace; without them, there is chaos. The ruler labors in seeking the worthy but finds ease in employing them.\n\nAlas! He who guards heaven’s mandate and gathers the people—how can he not devote himself sincerely to scholars?\n\nWhen human affairs go awry, nothing concerns the ruler more deeply than the miscarriage of justice. Of all such failures, none is more grievous than errors in punishment.\n\nA ruler of enlightened talent, when adjudicating disputes, may employ deception to coax the truth, or intimidation to compel it, or empathy to draw it out, or punishment to force it. Though his methods may vary, he must always ensure fairness. Even a single misjudgment weighs heavily on a wise ruler—how much more so the grave matter of criminal trials?\n\nIn examining cases and interrogating prisoners, the utmost effort must be made to uncover the truth. If a prisoner conceals the facts, the ruler may employ threats to compel them; or guide them with reason; or, if necessary, resort to punishment. Though his tactics may be manifold, he must never allow injustice or excess.\n\nThus, the people of the world will have no cause for gratitude in life or resentment in death. If a man’s life is rightfully spared, he owes no debt of gratitude; if his death is rightfully decreed, he bears no grievance.\n\nA ruler who governs the state, appoints officials, and administers justice in this manner may be called *zhiguan* (the perfect office). In an age of perfect governance, the people’s hearts are harmonious and upright; all livelihoods are fitting; love and respect run deep; superiors and inferiors are firmly aligned, unshakable as a single family. How could any disobedience or rebellion arise?\n\nWhen King Ping restored order and settled in the capital, he devoted himself to seeking worthy talents. Upon hearing even a single good report, his joy would last for days.\n\nKing Ping succeeded the chaotic reigns of Kings You and Li, when the world was in turmoil and all discipline had collapsed. He then quelled the disorder, moved the capital east to Luoyi, corrected past wrongs, and diligently sought wise men. Upon hearing even one commendable deed, his delight would endure for days.\n\n*Resided* refers to dwelling; *heavenly capital* refers to Luoyi. *Attained* means *obtained*.\n\nHis attendants repeatedly praised certain great ministers as exceptionally worthy, and this continued for over a year. These attendants were minor officials at his side, who, seeing the king’s pleasure, flattered him to curry favor.\n\nThe king said: \"I, alone, am not enlightened in virtue. I strive to seek out the worthy, yet I fear that those hidden in mountains and marshes may go unrecognized. How could I take pleasure in hearing good reports only to shut myself off from them?\n\nFormerly, my fawning and obsequious servants repeatedly extolled those in power, gradually gaining influence at my side. My own weakness and dullness left me unable to discern clearly, so I merely echoed their harmonious words, allowing their influence to grow unchecked.\n\nNo greater harm to virtue comes from the failure to correct such errors in time, allowing cliques to form and solidify.\"\n\n\"Oblique flattery\" refers to perverse flattery. \"Those in power\" are the great ministers. \"To ascend\" means to rise. \"Weak\" means feeble. \"Dependence\" means mutual reliance. Perverse and flattering minor officials extolled those in power, climbing by clinging to the king’s attendants, jointly concealing the truth, claiming that I was dim-witted and weak, unable to discern clearly. If not suppressed in time, factionalism would deepen and solidify.\n\nThereupon, he cast out three of his closest attendants to the marketplace—meaning he executed them and exposed their corpses in public. In ancient times, criminals were punished in the marketplace, where all could witness their rejection. He demoted five of the chief ministers of the various offices—these were the powerful great ministers—saying: \"Let no minister who serves his lord attach himself to inferiors to deceive his superiors, nor cling to his salary while flattering to curry favor.\"\n\nWhen the realm heard of this, they called him enlightened and discerning. Seven states west of the Southern Sea submitted in allegiance.\n\nIn an age of perfect governance, carriages and robes were plain and unadorned, laws and decrees were lenient and simple, and prohibitions were sparse and broad. When carriages and robes were plain, people did not covet excess; without mutual envy, desires waned. When laws and decrees were lenient and simple, customs knew no taboos; when prohibitions were sparse and broad, transgressions were easy to avoid yet hard to commit. If people did not covet excess, their cravings diminished, and they willingly followed their labors with joy. If customs knew no taboos, repression dissolved, and hearts opened in glad exchange. If transgressions were easy to avoid yet hard to commit, good and evil became distinct, and people valued virtue and knew shame. To value virtue is to refrain from wrongdoing; to know shame is to avoid it easily.\n\nTo willingly follow one’s labors with joy is called *obedience*; to open in glad exchange is called *harmony*; to value virtue and know shame is called *rectitude*. The indolent cannot overcome *obedience*; the rebellious cannot overcome *harmony*; the wicked cannot overcome *rectitude*. *Obedience*, *harmony*, and *rectitude*—these three are the foundation of governing a state.\n\nIn an age of decline, carriages and robes were ornate and cunning, laws and decrees were superstitious and excessive—*superstitious excess* meaning overabundance—and prohibitions were biased and perverse. When carriages and robes were ornate and cunning, people followed the current in mutual envy, as flames rise in emulation. When laws and decrees were superstitious and excessive, customs brimmed with taboos; when prohibitions were biased and perverse, none knew where to flee. If people followed the current in mutual envy, they became disloyal and impure, scorning simplicity and prizing ostentation. If customs brimmed with taboos, emotions and intentions were stifled, and superiors and inferiors clashed in discord. If none knew where to flee, slander and calamity multiplied, and the people feared not death.\n\nTo scorn simplicity and prize ostentation is called *frivolity*; for superiors and inferiors to clash in discord is called *strife*; for the people to fear not death is called *recklessness*. The truly upright cannot serve in *frivolity*; the just and impartial cannot serve in *strife*; the capable and talented cannot serve in *recklessness*. *Frivolity*, *strife*, and *recklessness*—these three are the ladders to a state’s ruin.\n\nKing Xiong Yu of Jing inquired about floods, droughts, order, and chaos. *Xiong* was the surname of Jing, and *Yu* his given name. Master Kang Cang replied: \"Floods and droughts come from Heaven; order and chaos arise from man. If human affairs are harmonious and well-governed, even floods and droughts cannot bring harm—such were the cases of Yao and Tang. In Yao’s time, there were nine years of floods; in Tang’s time, seven years of drought. Thus, the *Zhi Guan* of Zhou states: 'Man’s strength overcomes Heaven.' *Zhi Guan* is a chapter of the *Book of Zhou*. If human affairs are corrupt and chaotic, even without floods or droughts, the state will daily crumble and collapse—how were Jie and Zhou destroyed by floods and droughts alone? One version reads: 'How were they destroyed *because of* floods and droughts?' The rulers Jie and Zhou perished through cruelty, extravagance, and debauchery—not merely from floods and droughts.\"\n\nThe lord of Jing faced north, followed in reverence, and bowed deeply, saying: \"Heaven has not abandoned this unworthy one, allowing me to hear these words.\" One version reads: \"followed and cultivated.\" *Followed in reverence* means to retreat in deference. The lord of Jing held Master Kang Cang in such esteem that he called him \"Heaven.\" *This unworthy one* is a humble term used by kings and dukes. That Master Kang Cang did not abandon me is why I have been able to hear these words.\n\nThereupon, he presented ten pairs of great jade discs as a gift to Master Kang Cang and appointed him as Vice Minister. *Great jade discs* refers to large jades. *Ten pairs* means ten sets. *Vice Minister* is a lesser ministerial rank. He said:\n\n\"Might my state yet recover?\" Master Kang Cang, unable to bear this, departed in the dead of night in plain clothes for another land. *Recover* means to improve. *Departed* means to leave.\n\nIn an age of perfect governance, mountains harbor no false recluses, markets yield no illicit profits, and courts grant no sycophantic stipends.\n\nGuo Chan asked: \"How might one restore the people’s customs to purity and simplicity?\" *Guo Chan* was the courtesy name of Gongsun Qiao, a grandee of Zheng.\n\nMaster Kang Cang replied: \"When governance is oppressive and laws proliferate, the people grow cunning and deceitful. The more laws and decrees are promulgated, the more thieves and bandits arise. When governance is streamlined and unified, the people return to purity and simplicity. *When its governance is carefree, its people are unsullied.* The customs of the people follow the shape of state policy as the inchworm conforms to the leaf—feeding on green, its body turns green; feeding on yellow, its body turns yellow.\"\n\nHe asked: \"What must be done to enrich the people?\"\n\nMaster Kang Cang replied: \"When taxes are levied in due season and officials are pure and frugal, the people grow rich. When taxes are unchecked and officials are extravagant and indulgent, the people grow poor.\"\n\nThe arrows of Gou Yue are tipped with refined gold, fletched with the feathers of startled falcons. Yet when used for beating, they differ not from withered wood. *Gou Yue* refers to Eastern Yue. *Arrows* here means arrow shafts. *Startled falcons* are akin to eagles and ospreys. *Beating* means striking. The *Erya* states: \"Among the finest things of the southeast are the bamboo arrows of Kuaiji.\" Though the arrows of Gou Yue are tipped with refined gold and fletched with falcon feathers, when used for striking, they are no different from withered wood.\n\nYet when deployed in repelling bandits and contending for victory, when fitted to a mighty crossbow, they leave no foe standing beyond three hundred paces. *Repelling bandits and contending for victory* means to engage in decisive combat. When such arrows are mounted on a powerful crossbow, none can withstand them.\n\nThe sword Fei Jing dazzles the white sun with its radiance, its qi surging like purple rainbows. Yet when used for reaping, it differs not from a sickle blade. *Fei Jing* is a divine sword. *Sickle blade* here means a reaping tool. Though the divine sword is keen, when used to harvest rice, it is no different from a sickle.\n\nYet when malevolent qi and seething toxins roil unchecked, when wielded in the palm, its might courses unobstructed for a thousand li. *Malevolent qi and seething toxins* refer to pestilential vapors. This divine sword dispels such malevolence, so that wherever its awe-inspiring light reaches, none within a thousand li may tarry.\n\nEach material has its proper place, and each use its fitting application. What matters is to employ them aptly according to the times. Withered wood and sickle blades suffice for common tasks, while the arrows of Yue and the sword Fei Jing are for warding off calamities. Each material has its proper use, valued according to the needs of the time.\n\nIn ancient times, the Radiant August Thearch governed the realm in peace, all things flourished, and all beings attained their full potential—this was because he followed the times without disturbance.\n\nIn recent ages, the realm has grown rife with deceit and treachery, while the upright are few. The frivolous and profit-seeking abound, while the steadfast and retiring are rare. The wicked outshout the loyal, their cunning and falsehood sowing confusion, leaving none able to discern the truth. Thus the people of the realm come to harm one another.\n\nAlas! In crafting laws, what is prized is that they be easy to avoid yet hard to violate. In remedying abuses, what is prized is that measures be simple and decrees unified. Eliminate the overbearing, and officials will be at ease. Enforce punishments and prohibitions without fail, and officials will not dare pursue private gain. When officials do not pursue private gain, the people grow rich.\n\nThe *Records of Punishment* state: \"Calamities and disasters call for amnesties, but amnesties should not be frequent. Frequent amnesties embolden the wicked, while the common people grow restive. When the wicked are emboldened, they redouble their villainy; when the common people grow restive, they too turn to wrongdoing. Thus the worthy and good are stifled.\"\n\nWhen one commits great harm, and the officials apprehend them, they may cast a wide net, falsely implicating the innocent, dragging in distant connections, hoping to stretch out the proceedings until an amnesty is declared. The victims of such harm find no satisfaction, only self-inflicted torment. As a result, the common people devise ever more cunning schemes, officials toil under harsh governance, and none can quell the chaos—all due to the excess of amnesties.\n\nPeople refrain from wickedness and injustice because of punishment, and are encouraged toward virtue and right conduct because of rewards. Now, if the wicked and unjust are pardoned, while the virtuous and upright are harmed and go unrewarded, is it not difficult to expect people to embrace goodness?\n\nIf there were a worthy ruler or discerning scholar who would heed this discourse:\n\n*Finally* means to reach an end. *Satisfaction* means joy. *Torment* means suffering. *Heed* means to accept.\n\nThe resentment of the people does not stem from failing to engage with them; the wrath of the spirits does not stem from failing to serve them. The more cunning and flattery abound, the more the people resent; the more excessive the sacrifices, the more the spirits rage.\n\n*Dongling Zhenjing*, Scroll One, concludes.\n\nVariant readings:\n1. \"Heaven’s protection and divine aid, near\" — Song edition reads: \"In Heaven’s protective blessings, thus the customs.\"\n2. \"In\" — Song edition reads: \"Preserve.\"\n3. \"Regicide\" — original reads \"slaughter\"; emended according to Song edition.\n4. \"Pestilence\" — Song edition reads \"great.\"\n5. \"Scholar\" — Song edition reads \"affair.\"\n6. \"Righteousness\" — Song edition reads \"goodness.\"\n\n*Dongling Zhenjing*, Scroll Two, with commentary by He Can.\n\n**Scroll on the Way of the Ruler, Chapter Four**\n\nTo govern with clarity and non-action, leading by personal example.\n\nThat which gives life is Heaven; that which nurtures and completes it is man. All things owe their beginning to Heaven; to assist Heaven in nurturing them is the role of man. One who can nurture what Heaven has brought forth without disturbing the things of the world is called the Son of Heaven. *Disturb* means to agitate. When man aids Heaven in nurturing things and they become docile, he who governs them is called the Son of Heaven.\n\nIn ancient times, Shun possessed sagely virtue, and wherever he moved, a capital flourished. The movements of the Son of Heaven serve to preserve the *qi* of Heaven—this is the principle by which offices are established. Offices are established to preserve life. Heaven does not govern directly, so the sage acts on Heaven’s behalf to order all things. The sage cannot govern alone, so he establishes offices to assist him. The purpose of establishing offices is fundamentally to nurture all things, valuing the preservation of Heaven’s *qi* and preventing harm or depletion.\n\nYet the deluded rulers of this age multiply offices only to harm life, losing sight of the original purpose of their establishment. Later generations of misguided rulers focus on increasing offices, but more offices lead to more policies, and more policies harm the people—this betrays the original intent of establishing offices.\n\nWhen grasses are stifled, they rot; when trees are stifled, they become infested; when men are stifled, they fall ill; when a state is stifled, a hundred evils arise, and chaos becomes uncontrollable. *Stifled* means the *qi* is obstructed. When offices multiply and policies proliferate, affairs become congested, like grasses and trees succumbing to rot and infestation.\n\nThe so-called stifling of the state occurs when the ruler’s virtue fails to spread downward and the people’s desires fail to reach upward. Wicked ministers block the way, so the ruler’s virtue does not descend; the common folk are oppressed, so their desires do not ascend. Therefore, sagely kings value loyal ministers and upright scholars, for they dare to speak frankly and dispel obstructions.\n\nBy restraining oneself and returning to ritual, the worthy and good will come of their own accord. *Restrain* means to diminish; *return* means to revert. If the ruler can humble himself and return to ritual, the worthy and good will gather to him. When the ruler plows and the empress tends silkworms, the common people will naturally be transformed. When the Son of Heaven personally plows and the Empress personally tends silkworms, leading by example, the world follows their model.\n\nThus, the worthy and upright may be awaited but not sought—those obtained by seeking are not truly worthy. When the ruler embodies ritual and deference, worthy ministers will come of their own accord, so they may be awaited. If the ruler lacks ritual and deference, even if he seeks the worthy, those who come will not be truly worthy.\n\nThe common people may be transformed but not punished—punishment that is applied is not in accord with principle. When the ruler plows and the empress tends silkworms, the people will emulate them, so they may be transformed. If one does not act oneself but compels others to act, they will not obey.\n\nThough...\n\neven if punishment is repeatedly applied, such punishment does not accord with the highest principle.\n\nYao and Shun labored as rulers for the people, yet harbored no desires as rulers for themselves—thus the world each attained fulfillment of its desires. \"Labor\" refers to toiling with the mind to nurture all things; \"desire\" refers to serving the self to gratify one’s own wishes. They held the position of ruler but not the mind of one—thus the world each could freely follow its heart. \"Position\" means occupying office to govern affairs; \"mind\" means seeking ease for one’s own comfort. \"Freely\" means to extend.\n\nThere are those loved by the whole world yet not loved by their lord, and those loved solely by their lord yet not loved by the world. Those who exhaust their public loyalty to nourish the world are loved by the world; those who indulge private favor to curry favor with one person are loved by their lord. When one employs those loved by the world, the world is at peace; when one employs those loved only by their lord, the world is in peril. How can a ruler afford to indulge his own loves and hates? Therefore, one who values the world’s love must restrain his emotions. The sage takes the world’s peace or peril as his own concern. If he desires the world’s peace, the ruler must not indulge his loves and hates but must suppress his private inclinations.\n\nWhat is called \"the world\" refers to its possession of the myriad things; what is called \"the state\" refers to its possession of the multitude of people. The state takes the people as its foundation—when the people are at peace, the state is at peace. Thus, a ruler who worries for the state must seek those capable of governing the people. The world is rich in the myriad things, the state is rich in its multitude of people—one who worries for the state and nation cannot but employ the worthy to assist him.\n\nThe reason jade is difficult to discern is that there exists *keng*-stone; the reason gold is difficult to discern is that there exists *tou*-stone. *Keng*-stone resembles jade, *tou*-stone resembles gold—just as the treacherous appear upright externally yet are inwardly perverse, they too are difficult to discern.\n\nNow, if one covers a sparrow with the wings of a falcon, those with dim vision will mistake it for a falcon; only the clear-sighted will see that it is a sparrow. The falcon is the hawk; the sparrow is the finch. Now, petty men often recite the classics and medical texts, or study arcane arts and eclectic doctrines, and are clad in blue and purple robes of office. The foolish, hearing and seeing them, take them for true gentlemen; only the discerning, hearing and seeing them, recognize them as petty men. \"Arcane arts\" refers to unusual skills; \"eclectic doctrines\" refers to miscellaneous teachings.\n\nThus, when a ruler is truly enlightened, he selects men by their words, by their talents, and by their conduct—all in accord with principle. When a ruler is benighted, he selects men by their words, by their talents, and by their conduct—all leading to disorder. The enlightened ruler, in selecting men by their words and conduct, ensures all is in accord with principle; the dull ruler, though selecting men by their words and conduct, ensures all is in disorder.\n\nWhen the sage ruler employs men, he values achievements unseen by the ear, unseen by the eye, and inexpressible in words—yet the people flourish and govern themselves. When the worthy govern the world, they do not display their names, nor make manifest their use, nor proclaim their abilities. Their merit works in secret, their governance flows smoothly and mysteriously, no trace of fame arises, and none vie for eminence—thus the sage ruler esteems them.\n\nIf a ruler values achievements heard by the ear, the people of the world will traffic in goods to chase profit and peddle reputation. If a ruler values the achievements he hears of from his ministers, the treacherous will deploy their wealth and resources, chasing every advantage to market their reputations. If a ruler values achievements seen by the eye, the people of the world will exaggerate their forms and flaunt their arts to compete for advancement—boasting and vying for notice, they will only bring greater disorder to the world. If a ruler values achievements that can be spoken of, the people of the world will cultivate glib tongues and adorn their words. With eloquent speech and facile arguments, empty yet insubstantial, they will vie for reputation and advancement, embellishing their words to gain access—thus the government will fail. When competition for fame and esteem for ability prevail, the way of proper principle declines.\n\nA ruler knows that a mirror clarifies his appearance yet resents the gentleman who clarifies his faults. The mirror’s service is small, the gentleman’s service is great—knowing the small yet losing the great, he fails to grasp the likeness. The mirror reveals the beauty or ugliness of form; the gentleman reveals the goodness or evil of the heart. Correcting form is a small service; correcting the heart is a great one. Yet now the ruler esteems the small and loses the great—how can he not be deluded?\n\nAlas! If the ruler purifies his heart and reduces his affairs, and his ministers are reverent, frugal, and steadfast in their duties, great peace will swiftly arrive. Yet the world sometimes finds this difficult—how can I fathom why?\n\nIf the ruler’s heart, the seat of his judgment, is unclear and indecisive, then the harmony of heaven and earth, all within the four seas, the moving and the rooted, the myriad kinds—all will lose their proper way. \"The seat of judgment\" refers to where the heart resides. \"Moving\" refers to those endowed with *qi*; \"rooted\" refers to the grasses and trees.\n\nWhen a ruler selects men by what he hears and sees, offices multiply and governance falls into disorder—for those who embellish falsehoods abound, and those who vie for advancement are many. The ruler cannot discern them, thus offices multiply and governance falls into disorder. When a ruler selects men by careful reflection, offices are few and governance is clear—for those employed with sincere intent and keen perception are few, and their governance is well-ordered.\n\nThus, in an age that follows principle, one must seek talents unseen and unheard; in an age of peril and decline, one must select talents seen and heard. Alas! Does the ruler truly understand?\n\nWhen a ruler selects men by what he hears and sees, people all flatter and deceive to buy reputation; when a ruler selects men by careful reflection, people all remain composed and upright, diligent in virtue. When officials are composed, upright, and diligent in virtue, transformation occurs without words; when officials flatter and deceive to buy reputation, punishment fails to inspire awe—does the ruler of this age truly understand?\n\n**Chapter Five: The Way of the Minister**\nDevote oneself wholly, exert all strength, and strive to fulfill one’s duties.\n\nWhen a state is about to rise, among the hundred officials of the court, some are short, some tall, some plain, some comely, some gentle, some stern, some right, some wrong...\n\nUgly means repulsive. Gentle means pleasing. Stern means severe. Though their words may be heard and their appearances observed—seeming at first unlike—yet when their aspirations are examined and their hearts tested, all are devoted to serving the state. Thus, they neither resent forthright admonition nor startle at demotion; their counsel strikes the mean and never deviates from principle. Therefore, Heaven does not confuse its seasons, Earth does not withhold its bounty, men do not disrupt their proper roles, spirits and gods lend their aid, and distant barbarians submit in harmony. All things transform and flourish, and the Great Harmony is preserved.\n\nWhen a state is rising, the court’s ranks and offices are filled by those who exhaust their loyalty, each giving their utmost ability, acting with impartial justice, and harboring no favoritism. Thus, Heaven’s seasons do not err, Earth’s resources do not fail, human affairs do not fall into disorder, spirits and gods grant their protection, and distant lands submit in compliance.\n\nWhen a state is nearing ruin, the court’s hundred officials present fine appearances, their complexions harmonious, their words and tones refined and soft, their movements graceful and polished. Though the ministers of a doomed state appear outwardly compliant and agreeable, inwardly they harbor suspicion and envy, each pursuing private ends and secretly plotting harm. Though their appearances may be observed and their words heard—seeming at first cordial—yet when their aspirations are examined and their hearts tested, all are consumed by rivalry for position. Thus, they marvel at the unusual, startle at the unexpected, and in their mutual jealousy and deception, they lose the Way. Therefore, Heaven sends forth disasters in untimely seasons, Earth produces monstrous things—Heaven’s untimely seasons become calamities, Earth’s monstrous things become portents. Men commit wicked deeds, spirits and gods lie in wait to bring misfortune, border tribes invade in succession, and chaos and ruin abound. All things fail to transform.\n\nThose who do not waste resources, do not exhaust the people’s strength, and do not harm officials, yet achieve success and establish good governance, enriching the people below and enhancing the ruler’s virtue above—such are the loyal and worthy ministers. Those who squander wealth, harass the people, endanger officials for fleeting results, seeking only immediate rewards from the ruler while ignoring the disasters they leave for the state—such are the treacherous ministers.\n\nIn a well-governed age, offices are filled by the right men. In a disordered age, men seize offices for themselves.\n\nWhen Zhu Longti asked about serving a ruler, Kang Cangzi replied: “Once you inscribe your name as a subject, let your heart be nothing if not impartial, harboring no favoritism. Let your appearance be nothing if not harmonious, your words nothing if not upright. Impartiality should not seek to be clever, harmony should not be adulterated, and uprightness should not offend. Even if the ruler does not perceive it, one should not offend his countenance by remonstrating.”\n\nThe ancients practiced diligence and frugality to govern the state; today, men practice diligence and frugality to cultivate their reputations. Those who govern the state arrange matters with clarity, act appropriately, and align with the greater good. Those who cultivate their reputations arrange matters with clarity but fail to reach distant goals, constrained by petty concerns.\n\nThus, when the heart takes the Dao as its master, it touches matters and finds their proper place; when the heart takes matters as its master, it touches things and loses their proper place. Taking the Dao as master is impartiality; taking matters as master is self-interest. *Di* means to touch.\n\nMinisters in high positions who do not admonish, and those in low positions who are not impartial, do not deserve their emoluments. *Shan* means to provide. If the ruler is not solemn and respectful, if high ministers do not display trustworthiness to their subordinates, then ministers do not rightfully hold office in the court.\n\nThe talented are not necessarily loyal, and the loyal are not necessarily talented. Ministers need not fear disloyalty; they need only fear that, though loyal, the ruler may not trust them. The ruler need not fear distrust; he need only fear that, though trusting, he may not employ them effectively. *Shishi* means to put into practice.\n\nThe highest type of person, when their nature is realized, brings order to the world. The middling type, when their nature is realized, brings chaos to the world. A wise ruler employs the highest type, entrusting them with discretionary power and allowing them to act freely. The highest type—meaning the worthy and good, who are impartial and upright, harboring no favoritism—when placed in office, can be trusted to assist and correct. Though they may exercise flexibility at times, they always return to the upright.\n\nWhen employing the middling type, one must set standards for their achievements and make clear the rewards and punishments. The middling type—meaning those with skills and abilities—improve when they see good and are corrupted when they see evil. Thus, the ruler controls them with rewards and punishments.\n\n**Chapter Six: The Way of the Worthy**\nMaster oneself and return to ritual, and the worthy will come of their own accord.\n\nThe worthy are often sought but rarely arrive, difficult to advance yet easy to retreat—not because they cherish their lives and refuse to die for the ruler’s cause, but because they fear that, though loyal, the ruler may not trust them.\n\nThose who know themselves to be capable and discerning are outwardly respectful yet inwardly free of worry. Among the multitude, they are harmonious and upright without being overly familiar. Draw near to them, and they become all the more dignified; distance yourself, and they withdraw without resentment. In adversity, they console themselves with fate; in prosperity, they rectify themselves with the Dao.\n\nSome appear worthy in their bearing, others in their voice, but when their spirit is tested and their knowledge examined, they may fall short of expectations. When the worthy are employed, they enter court to gently admonish and praise, and withdraw to observe silence. They diligently attend to their duties, living simply and prudently. *Feng* means to subtly criticize the ruler’s faults; *yu* means to praise the ruler’s virtues. *Gongmo* means quiet and cautious. *Ban* means to manage; *xian* means to guard.\n\nWhen not employed, they conceal themselves among the crowd, hide their knowledge from sight, and restrain their words. They eat their fill, walk at ease, cultivate their own integrity, and remain steadfast without resentment.\n\nThe wise do not doubt their roles, and the discerning do not doubt others. The perceptive, though their conduct may be perilous, maintain an unalterable demeanor; though their words may be modest, their principles remain unshakable. This means that in a corrupt age, they do not change their aspirations: though their conduct may be perilous, their countenance remains composed; though their words may be modest, their principles stand firm.\n\nThe worthy do not proclaim their own worth. Those who boast of themselves achieve no merit; thus, they are not worthy. Their effectiveness is seen in governance, their merit in action. Examine their governance, observe their actions, and the worthy and the unworthy can be distinguished.\n\nIn times of Great Peace, the highest scholars apply their knowledge, the middling scholars exhaust their endurance, and the petty men contribute their strength.\n\nIn Qi there was a man named Pouzi, whose talents could have saved the state, whose conduct could have stood alone. *Zhen* means to rescue.\n\n\"To stand alone\" means that one's virtue and conduct are so lofty and unshakable that none can topple them. In serving his parents, he is filial and reverent; among his village and kin, he is respectful and dutiful. Yet dwelling in poverty with nothing to provide for them, he has long wandered afar, upholding trust and righteousness. Wherever he goes, few find accord with him—sometimes mocked and deceived by those who flatter the times and fawn for advantage.\n\n*Ru* means \"to go.\" Originally written as *suo chi wang*. *Dai* is pronounced *dai*. Another version reads: \"beginning from this.\" *Gua he shao xie* means \"few harmonize, rare are those who coincide.\" *Kua pi* means \"arrogant and obsequious.\" *Chi* means \"to laugh.\" *Dai* means \"to deceive.\"\n\nThereupon, leaning on his staff and dragging his feet, he went to inquire of Kang Cangzi: \"I have heard that the perfected person forgets emotion—his empty mind merges with the Dao in unity, thus he forgets emotion. The common people do not employ emotion—being dull-witted and ignorant, they cannot apply it. Those who preserve emotion devote themselves to teaching and revere trust and righteousness. *Cao* means 'company.' The middling sort preserve emotion, holding trust and righteousness in highest esteem. Yet now I do not know what I am capable of. *Gong* means 'ability.' Though I personally practice trust and righteousness, wherever I go few find accord with me; I do not know what ability I possess.\n\nSome accept what is untrustworthy as trust; some take trust that is not recognized as trust—though they are truly trustworthy, others do not see it, yet they still regard themselves as trustworthy. Some exert themselves in admiring righteousness and call it righteousness—though their actions are not righteous, they are praised as righteous by others. Some act righteously yet do not wait for others to call it righteous—they always regard themselves as righteous.\n\nThus, those who uphold trust and righteousness often meet with hardship and retreat. How can they gain esteem in their time, and how can teaching and principle rise above? Kang Cangzi stroked his lapel, composed his spirit, and sighed. Then, rising aloft, he sang:\n\nWhen the times are bright, trust and righteousness flourish;\nWhen the times are dark, trust and righteousness lie hidden.\nBrightness and darkness, flourishing and concealment—\nWhy should I alone be troubled, swept along without preference?\n\n*Gǔ* means \"confused.\" *Qiang* is an exclamatory sound. *Du* means \"to speak.\" The times know order and chaos, thus one's conduct knows action and concealment. When times are bright, one flourishes with them; when times are dark, one hides with them—following the current, moving with fate, how can there be partiality? Now you ask me, yet I do not know what you mean.\n\nTo move with one's true nature as if strolling freely—yet none respond—is to be truly unrecognized. When the true is unrecognized, it is called the loss of the Dao. Trust and righteousness are the function of true nature; the true is the root of true nature. When the Dao is lost, the highest scholars withdraw—withdrawal is righteous. There are times when action is possible, and times when it is not; there are times of prosperity and decline, none lasting forever. There are times when ability is employed, and times when it is not—employment knows action and concealment, none lasting forever.\n\nThe Duke of Zhai asked: \"From where does one obtain worthy talent?\"\nKang Cangzi replied: \"The worthy and upright can be awaited but not sought; talent lies in seeking, but one must be cautious—without caution, there is no talent. If talent is sought but not chosen with care, there will be no talent. If the Son of Heaven is serene and his great ministers enlightened, if punishment does not spare the noble and favor does not bypass the lowly, then worthy men will come of their own accord seeking employment. When worthy men are employed, within the Four Seas all will see with clear eyes, hear with keen ears, and hold open hearts free of gloom. Heaven will perfect itself, Earth will settle itself, the myriad things will transform in purity, and even ghosts and spirits will be powerless to work wonders. When all under Heaven is pure and harmonious, ghosts and spirits cannot display strange marvels. Thus it is said: the worthy and upright can be awaited but not sought.\n\nIf the Son of Heaven is diligent and discerning, and his great ministers seek scholars with harmony and reason, then magnanimous, broad-minded, publicly upright, and steadfast talents will arrive. If the Son of Heaven is harsh and suspicious, and his great ministers seek scholars with impatience and haste, then cunning, artful, destructive, and way-breaking talents will arrive. If the Son of Heaven is doubtful and jealous, and his great ministers seek scholars with clever compliance, then talents of strange surnames and unusual names, with sidelong flattery and bizarre arts, will arrive. If the Son of Heaven esteems himself, and his great ministers cling to their positions while seeking scholars, then talents who chase reputation with embellishments, greedy and impure, will arrive. If the Son of Heaven is indecisive, and his great ministers seek scholars with devious flattery, then talents who appear loyal but are inwardly perverse, with venomous natures and gentle words, will arrive. Thus it is said: talent lies in seeking, but one must be cautious—without caution, there is no talent.\n\nIn ancient times, the Yellow Emperor obtained Chang Xian, Feng Hong, and Rong Qiu—three ministers. The Shang king obtained Yi Yin; the Restoration king obtained Fu Shen—Fu being Zhongshan Fu, and Shen being Shen Bo. Duke Huan of Qi obtained Mi Ning Ji—this is Ning Qi. All these rulers embodied the Dao and surpassed in benevolence, widely displaying sagely martial virtue, seeking to gather brilliance, and governing with magnanimity, generosity, and uprightness. Thus, the multitude of worthies came of their own accord seeking employment—not obtained through meticulous selection. *Mai* means 'to practice.' *Ji* means 'harmony.' *Jian he* means 'to choose.'\n\nThe Duke of Zhai said: \"Master, you say that worthy men do not seek but come of their own accord—are there also those who are not worthy yet come of their own accord without being sought?\"\nKang Cangzi replied: \"Those who are not worthy yet come of their own accord without being sought are indeed many. When the world has the Dao, worthy men do not seek but come of their own accord; when the world lacks the Dao, those who are not worthy do not seek but come of their own accord. Rulers with the Dao are few; those without it are many. Worthy men in the world are few; the unworthy are many. Thus, those who are not worthy yet come of their own accord without being sought are many.\"\n\nThe Duke of Zhai said: \"The worthy surely save the world, and talent can also save the world—if both save the world, how do the worthy and the talented differ?\"\n\nKang Cangzi replied: \"How pressing is this question! Pressing—it is urgent. The inquiry is indeed pressing. Now, when merits are accomplished and affairs are completed, yet one does not seek titles or fame, but retreats with reverence, simplicity, and frugality—this is what we call *worthy*. To seek is to pursue. Having achieved merit, one does not occupy the position but nurtures oneself with reverent humility. When merits are accomplished and affairs are completed, yet glory lies in emoluments and reputation, and one’s aspirations are fully displayed—this is what we call *talent*. The worthy can *pacify* a state; talent can *govern* a state. What is meant by *pacifying*? It is harmony, tranquility, and non-action—people do not perceive its power. Supreme virtue transforms in hidden ways, and none can comprehend it. What is meant by *governing*? It is diligent execution of affairs, and people recognize the virtue therein. They rely on its merit, thus attributing virtue to oneself.\n\nOne worthy leading many talents is more than sufficient; many talents measuring themselves against one worthy still fall short—such is the vast difference between the worthy and talent. Though one worthy is few, leading many talents, their virtue still abounds; though many talents are numerous, compared to one worthy, they still cannot match. There are those who dwell in mountains and forests yet act with righteousness; there are those amidst worldly customs yet remain serene. There are those who are boisterous yet upright; there are those who are quiet yet perverse. This shows that in seeking the worthy, one must not fail to discern the upright from the perverse.\n\nGenerally, when observing one whose appearance is coarse and vulgar yet proves worthy, not one in ten thousand exists; when observing one whose appearance is refined and elegant yet is in truth a petty man, nine in ten are so. Thus, the worthy are hard to come by. One who, without refining their words, understands their pattern; without demanding their demeanor, examines their measure; without heeding their praise, knows their goodness; without being swayed by slander, judges their worth—such a one may be called discerning. Without waiting for rumors or defamation, they perceive the true nature of evil.\n\n*The Writ of the Cavernous Numinous* concludes, Volume the Middle.\n\n---\n*Variant notes from Song Dynasty block-print edition:*\n1. \"That which gives birth is Heaven; that which nurtures and completes is man\" originally read: \"That which gives birth is Heaven and Earth; that which nurtures and completes is [man].\"\n2. \"Heaven\" originally read: \"Heaven and Earth.\"\n3. \"Qi not yet flowing\" originally read: \"qi obstructed and not flowing.\"\n4. \"Official\" originally written as \"text,\" emended per Song edition.\n5. \"Suspicion\" originally written as \"sentiment,\" emended per Song edition.\n6. \"There are times when action is possible\" originally omitted, added per Song edition.\n7. \"None can be employed\" originally omitted, added per Song edition.\n8. \"There are those who can be used\" originally preceded by \"none can act\" and followed by \"When the state has the Dao, the wise are wise; when the state lacks the Dao, the wise are foolish,\" deleted per Song edition.\n9. \"None\" originally preceded by \"thus,\" deleted per Song edition.\n\n*The Writ of the Cavernous Numinous*, Volume the Lower, with commentary by He Can.\n\n**Chapter Seven: The Instruction of the Dao**\n\nThe application of utmost virtue is the master of all teachings, praised by numinous spirits, and can transform the people.\n\nMin Ziqian asked Confucius: \"How far apart are the Dao and filial piety?\"\n\nHe suspected they were distant from one another.\n\nConfucius said: \"The Dao is the wondrous function of spontaneity. Filial piety is the utmost virtue of human relations. That which exhausts the root and origin is called the Dao; that which is applied to human principles is called filial piety. The Dao can penetrate the generation of the myriad things, yet none know whence it arises—hence it is called wondrous function. Filial piety is the good service of one’s parents, exhausting reverence and compliance, penetrating to the numinous—hence it is called utmost virtue.\n\nIt embraces and revolves Heaven and Earth, engenders and nurtures the myriad things, subtly completes their forms, and bestows their natures and lifespans. *Nature* refers to the substance of hardness and softness; *lifespan* refers to the exhaustion of a single term. Its achievement is most substantial, yet it does not serve as a storehouse for things, nor as an office for affairs. It does not claim merit as its own, and though one may seek it through touch, sight, or hearing, none can possess it—thus it is named the Dao. Though it subtly completes the myriad kinds and carves the multitude of forms, when one seeks the master of life, no trace of it is seen—hence it is named the Dao. The Dao is called *emptiness and penetration*. When applied to humanity, it is named *filial piety*.\n\nFilial piety is the name for the good service of one’s parents. In serving one’s parents well, reverence and compliance are fundamental. One’s intent must accord with them, complying with their countenance in all things. In uttering a single word or raising a single thought, one does not dare forget one’s parents. In moving a hand or placing a foot, one does not dare forget one’s parents. In serving one’s lord, one does not dare be disloyal; in dealing with friends, one does not dare be untrustworthy; in facing subordinates, one does not dare be disrespectful; in pursuing goodness, one does not dare be idle. Even when dwelling alone in a chamber, one does not dare relax one’s sincerity—this is called *complete filial piety*. Thus, the utmost of filial sincerity penetrates to the numinous, shines throughout the Four Seas, and invariably responds to what is felt—this is the result of the good service of one’s parents.\n\nOf old, Shun was greatly filial. His stepmother deceived his father, who repeatedly sought to harm him, yet Shun’s heart grew only more reverent, fearful but without resentment. When they schemed to have him dredge a well and then filled it with earth from below, Heaven bestowed its favor, and the numinous spirits shook with power, allowing him to emerge from a hidden tunnel. He served his parents with ever-greater care, and by this, his dark virtue flourished, and he became lord of the world—this was the result of the good service of his parents. According to the *Records of the Historian*: Shun’s father, Gusou, and his half-brother both wished to kill him. They sent Shun to repair a granary, then Gusou set fire to it from below. Shun used two conical hats to shield himself as he descended and escaped, surviving. Later, they sent Shun to dig a well, and he secretly excavated a side tunnel. After he had entered deeply, Gusou and Xiang filled the well with earth, but Shun emerged through the hidden tunnel and escaped. Such were the events. At that time, Heaven, bestowing its fine virtue, stirred Shun’s heart, and the numinous spirits blazed forth, allowing him to avoid harm. After his escape, he served his father with even greater diligence. Yao, recognizing his sageliness, tested him through many trials, and afterward abdicated his throne to him.\n\nKing Wen, when he was crown prince, was greatly filial. Morning and evening, he would invariably arrive outside the door of his father’s chamber and ask the attendants: \"Is he at peace today? How is he?\"\n\nThe *temple attendant* was a eunuch official, one who served at the ruler’s side. When he said, \"At peace,\" the crown prince’s face would soften with joy. If there was the slightest sign of discomfort, the crown prince’s expression would fill with worry. Morning and evening, when food was presented—meaning the attendants brought meals to the lord—the crown prince would always observe whether the temperature was appropriate. Only after confirming what nourishment had been served would he withdraw, knowing the quantity consumed.\n\nWhen the temple attendant reported illness, the crown prince would don solemn robes and fast, for when the lord was ill, the crown prince dressed with utmost gravity and purified his heart, concentrating his will to pray to the spirits for protection. He would respectfully inspect the food prepared by the royal chef and personally examine the garments offered as tribute. If the lord tasted the food and found it good, the crown prince would also eat his fill; if the lord found it lacking, the crown prince would not eat to satisfaction, and only when the lord recovered would he return to his usual state.\n\nIf the lord later erred, the crown prince would speak in a gentle voice to admonish him subtly. Whatever the lord cherished, no matter how small, the crown prince treated it with solemn reverence, never daring to slight what his father and ruler loved. Thus, filial piety perfected his person, and the Dao harmonized all under Heaven.\n\nThe *Ya* states: \"King Wen ascended and descended, ever at the Lord’s side.\" The *Ya* refers to the *Greater Ya* section of the *Book of Songs*. *Ascended* means to rise; *Lord* refers to Heaven; *at the side* means to assist. It speaks of King Wen’s conduct, which Heaven always aided. It says that in King Wen’s stillness and action, advance and retreat, Heaven invariably supported him, so that Zhou could not harm him. *Supported* means to assist. King Wen served Zhou, and Heaven assisted him, so even though King Zhou of Yin was tyrannical, he could not readily harm Wen.\n\nThe dream of \"nine lifespans\" is recorded in the *Record of Rites*: When King Wen fell ill, it took twelve days for him to recover. He asked King Wu, \"What did you dream?\" King Wu replied, \"I dreamed the Lord granted me nine lifespans.\" King Wen said, \"What do you think it means?\" King Wu said, \"There are nine states in the west—will you ultimately pacify them?\" King Wen said, \"No. I am ninety of your ninety, and I share three with you.\" King Wen died at ninety-seven, and King Wu at ninety-three.\n\nThirty generations were divined, seven hundred years were foretold—this was Heaven’s mandate, the result of serving one’s parents with goodness. The *Zuozhuan* states: \"When King Cheng established the tripods at Jiaru, it was divined that there would be thirty generations and seven hundred years—this was Heaven’s mandate.\" Min Ziqian asked, \"I have been fortunate to hear the way of serving parents well. May I ask about the principle of teaching one’s children?\" Confucius said, \"In all cases, the Three Kings taught their children by demonstrating ritual and music. *Demonstrating* means to show. Music cultivates the inner self, harmonizing the heart; ritual cultivates the outer self, refining one’s bearing. When ritual and music are practiced together, virtue and demeanor shine forth in one’s appearance, enabling one to be warmly respectful and civilized.\n\nNow, if a minister would sacrifice his life for the ruler’s benefit, how much more should he benefit himself to serve his ruler well? Therefore, they selected loyal, upright, and steadfast gentlemen as tutors, so that they might understand the Dao of father and son, ruler and minister, elder and younger. Only after knowing how to be a son can one be a father; only after knowing how to be a minister can one be a ruler; only after knowing how to serve others can one employ them. This is the principle by which the Three Kings taught their children.\" The Three Kings refer to the kings of the Xia, Yin, and Zhou dynasties.\n\nMin Ziqian withdrew and practiced this at home. For three years, no one could find fault with his words toward his parents or brothers. He served his parents above and deferred to his brothers below, achieving utmost goodness and beauty. Thus, no one spoke ill of him. Among his acquaintances, he was praised for his trustworthiness; in his village, for his benevolence; in his clan, for his fraternal duty. The reputation of his virtuous conduct spread throughout the world—this was the result of serving his parents well.\n\nThe crown prince of Qi sat upon the Clear Terrace when Yan Duke Zhuang, named Ta, arrived. The duke wore a tall hat and a stern expression, with a jade-hilted sword at his left waist and jade pendants at his right. The light from the left shone upon the right, and the light from the right shone upon the left—meaning the radiance of the jade ornaments illuminated one another. The crown prince continued reading without looking up. Duke Zhuang asked him, \"Does Qi possess treasures?\" The crown prince replied, \"A ruler who is trustworthy and ministers who are loyal, with the people supporting their superiors—these are Qi’s treasures.\" Duke Zhuang Ta immediately removed his sword and departed, submitting to righteousness. This illustrates that the noble person values virtue, not ostentatious adornment.\n\nAlas! Do people have biases and blind spots without ever realizing them? The worthy see them and forgive without speaking; petty men, in their reckless affection, speak excessively; relatives, out of pity and jealousy, speak ambiguously. How could one with biases and blind spots fail to recognize them? *How* means *why*. Therefore, the noble person examines himself as if he always has faults. Wearing his clothes, eating his food, knowing his faults yet lacking the strength to correct them—this the noble person considers shameful. It speaks of a minister who cannot rectify anything.\n\nWhen about to speak, if one knows it will certainly not be heeded, the noble person rarely speaks. If the ruler does not accept loyal admonition, he speaks little to avoid calamity. When criticizing the faults of others, does one first examine one’s own goodness? When condemning others’ wrongdoing, does one first examine one’s own rectitude? This is called *reflecting on clarity*—first scrutinizing one’s own goodness and rectitude, then criticizing others’ wrongdoing.\n\nThe son of Di Xi was extremely filial and cautious. Di Xi, pitying his son, often spoke to him falsely. When Di Xi went out in the morning and returned at dusk, he would say, \"So-and-so has died.\" His son believed him, but later found that so-and-so was still alive.\n\nOne evening, he would say, \"Yi is about to harm someone.\" His son, fearing he would seek vengeance, kept watch. Yet no sign of malice appeared. Another evening, he would say, \"Ding has fallen ill.\" His son observed him, and indeed, Ding was free of affliction—this was always the case.\n\n*Observed* means to watch; *affliction* means distress; *always* means entirely. As time passed, though the son remained filial and cautious, he could no longer trust or obey his father’s words. The people of his village and state grew resentful of his reckless speech and plotted to kill him. When Di Xi heard this, he was terrified and returned to warn his son. The son did not fully believe him, but soon after, Di Xi was murdered.\n\nThis passage warns against speaking carelessly of political harm. Even one’s beloved son may not be trusted, leading to murder—how much less so others? Those who speak excessively are called *careless and exposed*, yet some are sparing in words but still indiscreet. Those who are *frivolous* are called *unsettled*, yet some appear composed while their hearts are restless. *Frivolous* means flighty and impulsive. Those who are *disorderly* are called *petty and coarse*, yet some appear pure while their inner selves are tainted. If one were to enumerate such cases, they could not all be recorded. Without thorough discernment, who could fully investigate and understand them?\n\nThere are times when one cannot but respond—outwardly still, yet inwardly stirred, easily moved but difficult to calm. This refers to those who, upon seeing profit, greedily pursue it, growing ever more avaricious, thus wearing themselves out and finding no peace. There are times when one cannot but seek employment—internally desiring, yet outwardly waiting, finding joy only upon attainment. This refers to those who, stirred by passions and desires, crave external conditions, their hearts set on fulfillment, rejoicing when they obtain what they seek, unaware that their restless minds harm their nature.\n\nThus, those who are outwardly still but inwardly restless damage their nature through anxious thoughts; those who chase profit through relentless toil harm their reputation through exhausting labor. Only those who are serene and free of passions, unenticed by fame or gain, may then preserve their well-being and wholeness of nature.\n\nSome in this world, when their ambitions go unfulfilled, claim they have not met their time—this is no different from bearing the guilt of a crimson-necked crime, awaiting execution when the moment arrives. How perilous! Those who cannot conduct themselves with caution and speak with restraint, offending the ruler of their time, differ not from bearing the guilt of decapitation, awaiting the hour of their execution. *Crimson* refers to the color of blood.\n\nThose of vast talent and profound understanding who go unrecognized and unappointed may rightly say that the times are not unclean, but their fate has not aligned—is this not true?\n\nThose skilled in remonstrance ensure they preserve the other’s nature while pruning the roots of their emotions—thus, both parties advance in harmony, and mutual respect deepens. Those unskilled in remonstrance assail the other’s nature and remain blind to the source of their emotions—thus, mutual suspicion and resentment accumulate day by day.\n\nWhat children dismiss, the aged condemn;\nwhat delights the eyes and ears, the mind deems a malady.\n\nTo harshly reproach the foolishness of the world is to reveal one’s own lack of worth;\nto harshly reproach the delusion of the world is to reveal one’s own lack of clarity.\nThe worthy and enlightened should practice forbearance—\nreprove not the foolish and deluded.\n\nTo reproach the multitude for their foolishness while lacking worth is to invite ruin;\nto reproach the multitude for their delusion while lacking clarity is to invite harm.\nThe foolish and deluded suffer no loss—\nonly the harsh reproacher wounds himself in vain.\n\n**Chapter Eight: The Way of Agriculture**\n\nGrain is the people’s Heaven.\nIn governing a state, agriculture is the foundation.\nWhen people abandon the root to pursue the branch,\ncommands cannot be unified—\nthe *root* refers to agriculture,\nthe *branch* to the pursuit of superficial profit.\nWhen people chase superficial profit,\ndeceit and cunning multiply,\nand no single command can restrain them.\nWithout unified commands,\nneither defense nor warfare is possible.\nWith profit-seeking diversions,\nhearts are divided—\nthus, neither steadfast defense nor victorious warfare can be achieved.\n\nWhen people abandon the root to pursue the branch,\ntheir livelihoods grow meager.\nWith meager livelihoods, they lightly abandon their homes;\nwith light abandonment, the state suffers frequent calamities.\nAll cultivate distant ambitions,\nand none remain settled in heart.\n\nWhen people abandon the root to pursue the branch, they become cunning;\nwith cunning, deceit multiplies;\nwith deceit, laws and decrees are manipulated—\nright is made wrong, and wrong is made right.\n\nThe way by which the sage-kings of antiquity governed their people\nwas first to ensure their sustenance.\nEnsuring sustenance was not merely for material gain—\nit was to honor the fulfillment of their will,\na will directed toward the people’s peace.\n\nWhen people are well-sustained, they remain simple;\nwhen simple, they are easily employed;\nwhen easily employed, the borders are secure;\nwhen secure, the ruler’s position is exalted.\n\nWhen people are well-sustained, they become like children—\nfree of divergent ambitions.\nLike children, they harbor few private interests;\nwith few private interests, public laws stand firm.\n\nWhen strength is devoted to deep cultivation,\nlivelihoods grow abundant—\n*abundant* meaning prosperous.\nWith prosperous livelihoods, people do not lightly scatter;\nwithout light scattering, they die in their place without second thoughts—\nthus, the world unites in a single heart.\n\nWhen the world unites in a single heart,\neven the governance of the Xuanyuan and Jilian Emperors would not surpass it.\nXuanyuan and Jilian were enlightened rulers of antiquity.\n\nThe reason the sage-emperors of old esteemed farming and weaving\nwas to make them the foundation of instruction.\nThus, the Son of Heaven personally led the feudal lords in plowing the sacred field,\nwhile officials of all ranks were rewarded according to merit to encourage the people to value production—\n*ranks* referring to hierarchy.\nAs the *Monthly Ordinances* states:\n\"In the first month, when the vital energy is balanced, the Son of Heaven selects an auspicious day, personally carries the plow and plowshare, places them to the right of his chariot, and leads the dukes, ministers, and feudal lords in plowing the sacred field.\nThe Son of Heaven makes three furrows,\nthe Three Dukes five,\nand the ministers and feudal lords nine.\"\nThus, merit was rewarded to encourage the people.\n\nThe empress and consorts led the palace ladies in silkworm rearing at the suburban altars, tending the mulberry fields of the public estate to encourage diligent labor—a return to fundamental instruction. As the *Monthly Ordinances* states: \"In the third month, when the vital energy is balanced, the authorities are commanded not to fell mulberry or silkworm-thorn trees. Then, the implements are prepared. The empress fasts and purifies herself to offer sacrifices to the silkworm ancestors, then personally gathers mulberry leaves to promote sericulture.\"\n\nThe *Record of Sacrifices* says: \"In antiquity, the Son of Heaven and feudal lords necessarily had public mulberry groves and silkworm chambers, built near rivers. The ruler divined among the three palace ladies, the wives of high ministers, and the concubines to select the most auspicious, who entered the silkworm chamber. The concubines personally tended the silkworms, presented the cocoons to the ruler, and then offered them to the empress. The empress reeled three cocoons by hand, then distributed them to the three palaces. The most auspicious among the high ministers’ wives and concubines were tasked with reeling the silk. This was to encourage women’s instruction.\"\n\nMen do not weave yet are clothed; women do not plow yet are fed. Through the exchange of labor between men and women, their occupations mutually sustain one another—this was the system of the sage-kings. *Exchange* means to barter. Thus, they revered the seasons and cherished the days, measuring tasks by their substance to assess merit. *Measuring* means to quantify. They did not rest unless aged, nor cease unless ill. The toil of one man fed ten. The foremost farmers fed ten people.\n\nIn the pressing affairs of the season, earthworks were not initiated, nor were armies mobilized. Men did not go forth to welcome brides, nor were women married outside—*one version reads \"grand marriage.\"* This was to avoid hindering agriculture. *Earthworks, military campaigns, and weddings* all referred to obstructing farming. *Welcoming* meant men did not personally receive brides.\n\nThe Yellow Emperor said: \"The four seasons cannot be made correct; one can only rectify the five grains.\" Cultivation is undertaken by man, *cultivation* meaning to sow. Growth comes from Heaven, nourishment from Earth. Thus, furrows must accommodate the foot, hoeing must accommodate the hoe—*hoeing* means to weed. *Hoe* refers to the weeding tool. Weeding must accommodate the hand—*weeding* means to clear grass. This is called the *Dao of cultivation*. Seedlings should allow room for the foot, tilling room for the hoe, and weeding room for the hand.\n\nFarmers refine food, artisans refine tools, merchants refine goods. *Refine* means to cultivate. If the seasons are not revered and earthworks are imposed, this is called *great calamity*. For a ruler to be irreverent is the path to great misfortune.\n\nIn cultivation, those who begin early act ahead of time, while those who begin late fall behind. If cold and heat are unbalanced, crops suffer many disasters. *Too early or too late* refers to failing to attain the harmonious qi. Fifty-seven days after the winter solstice, plants flourish—*a decade* means ten days. The fifty-seventh day falls within the *Beginning of Spring* solar term, when grasses and trees burst forth. Thus, plowing begins.\n\nThe *Dao of agriculture* is this: upon seeing life, plant life; upon seeing death, harvest death. This means to act in accord with Heaven’s timing. *Plant* means to sow; *harvest* means to reap. Heaven bestows the seasons, while man produces wealth—it does not make appointments with man. In years of plenty, the earth is sacrificed to; in years of famine, the earth is sacrificed to. *Years of plenty* means abundant harvests; *years of famine* means poor harvests. *Sacrificing to the earth* means offering to the altars of soil and grain. The spring sacrifice prays for abundance; the autumn sacrifice gives thanks for ripeness. Whether in years of plenty or famine, sacrifices are made to entreat the earth, for the benefit of life is weighty.\n\nDo not lose the proper time: act when the season arrives, cease when it passes. Even the strength of the old and weak can be fully employed. *Act* means to reach. Though old and weak, they can be made to exhaust their strength—this is how plowing follows the season. Those who do not know the time act before it arrives, *meaning they begin farming too early,* or long for it after it has passed—*meaning the season has passed, yet they yearn for it, which is too late.* Or they neglect it when it arrives—*though the time is right, they exert little effort, so the harvest is meager.* These three are the lowest in agricultural practice. Though they engage in farming, they do not grasp the season, hence they are called the lowest.\n\nTilling must be done early to make the soil fertile and loose. Hoeing must be done in the early season, for then weeds die easily and the soil’s veins become rich and soft. Crops desire to sprout in dust-like soil and grow in firm earth—*grow* means to lengthen. Sowing requires soil as fine as dust, so the earth is porous and roots run deep. When seedlings grow, rain firms the soil, and firmness strengthens the stalks.\n\nBe careful with the seeds: do not make them too dense, nor too sparse. *Dense* means crowded. When applying soil, do not make it insufficient, nor excessive. *Applying soil* means placing seeds in the earth. Insufficient seeds lead to sparsity and waste land; excessive seeds lead to density and harm the grain. Neither waste nor harm—take the middle way.\n\nFurrows should be deep and straight, ridges fertile and level. *Straight* means upright. Deep, straight furrows allow water to flow swiftly; fertile, level ridges ensure even moisture. Below, they receive yin; above, they receive yang—*yin below* means water’s moisture; *yang above* means the sun’s qi. Then life is completed.\n\nSeedlings planted in rows grow quickly; the strong and weak do not harm one another, so they grow swiftly. Straight rows allow passage through their centers, thinning them to admit cool breezes. Then there will be harvests and great success.\n\nIf crops appear abundant from afar but sparse up close, it is the earth’s theft—*due to barren soil, seedlings are not lush, as if stolen.* If weeds are not removed, they overgrow; if removed, the seedlings are left bare—this is man’s harm. *Remove* means to tend. If weeds are allowed to flourish before removal, the seedlings will be bare—this is harm from human effort.\n\nWeak seedlings desire solitude—*wishing to grow singly, not clustered.* Strong seedlings desire to dwell together—*to live among many, sharing shade.* Ripe seedlings desire mutual support—*to avoid damage from falling.* When these three are grouped, crops yield abundant grain.\n\nThe three types, like human clans, yield greater harvests when they mutually support one another. All seedlings suffer when they do not sprout and perish together—uneven growth allows large seedlings to oppress small ones, stunting their flourishing. Thus, early sprouts produce fine grain, while late ones yield □. The strong oppress the weak, so late sprouts fail to bear fruit. Therefore, in cultivation, one retains the elder and removes the younger. This analogy compares seedlings to people: early sprouts are elder brothers, late ones younger brothers.\n\nFor trees in fertile soil, do not let them grow too luxuriantly; for those in barren soil, do not allow them to grow singly in isolation. *Qiao* refers to barren land. Growing singly and isolated leaves them vulnerable to wind and drought. Luxuriant growth in fertile soil leads to much blight; solitary growth in barren soil leads to much death. Those who do not understand weeding remove the elder and nurture the younger, forsaking the grain to harvest □. When upper and lower are unsettled, crops die in great numbers.\n\nTimely millet grows tall with large ears, its grains round and husks thin, sweet and fragrant, easy to hull and nourishing to eat. *He* refers to millet. *Tong* is the ear’s stem. *Yuan* means round. *Yi* describes its taste, sweet as malt sugar. Untimely millet has long awns and slender stalks, its ears sharp and filled with □, its grains green and withered. *Shen mang* means long awns. *Rui* means slender. *Qing ling* describes its green grains.\n\nTimely millet has long, awnless ears, its grains plump and husks few. *Bo* means to rub the grain by hand to remove the husk. Untimely millet has thick roots and flowering stalks, its leaves lush and ears short. *Ben* refers to roots. *Hua jing* describes stalks with flowers. *Gao* means lush and thick.\n\nTimely rice has thick stalks and long stems, its ears like a horse’s tail. *Bao* means large. *Ma wei* describes long ears. Untimely rice has slender stalks lacking vigor, its husks thick, and it withers and dies.\n\nTimely hemp has sparse nodes and bright color, its fibers strong and roots small. *Yang* means bright and radiant. *Jian* means firm, describing its tough skin. Untimely hemp has many branches, short stalks, prominent nodes, and insect-damaged leaves. *Fan ke* refers to many branches. *An jie* means high nodes.\n\nTimely beans have long stalks and short stems, their pods clustered in groups of fourteen, with many branches and numerous nodes, their leaves lush and pods full, heavy to the hand and satisfying to eat. *Shu* refers to beans. *Zu* means clustered. *Xi* means abundant. Untimely beans grow long vines, their leaves floating and roots weak, their nodes sparse and pods small.\n\nTimely wheat has long stems and clustered ears, its grains arranged in rows of fourteen, its husks thin and color yellow, nourishing to eat, strengthening the body. *Bo yi* refers to husks. *Tun* means yellow. Its ears bear fourteen grains per row. Untimely wheat swells with disease, its seedlings weak and ears bristling. *Fu zhong* describes thick, insect-ridden stalks and roots. *Sha sui* means many awns.\n\nThus, timely crops yield abundance, while untimely ones yield scarcity. When all grains are cultivated appropriately and consumed, they fortify the four limbs, sharpen hearing and sight, prevent *qi* from invading, and spare the body from ailments. The four limbs are the *si wei*. How excellent are Confucius’s words: “In winter, a full stomach warms the body; in summer, it cools it.” When warmth and coolness are seasonally fitting, people suffer no illness; free from illness, epidemics do not spread; without epidemics, all fulfill their natural lifespans. Thus it is said: “Grain is the sky of man.” Therefore, enlightened rulers devote themselves to agriculture. A ruler who neglects agriculture abandons his people. A ruler who abandons his people—what kingdom can he govern?\n\n**Military Strategy, Chapter Nine**\nWarfare is an inauspicious instrument, to be employed only when unavoidable.\n\nDuke Jing of Qin sought to display his military might to the world. Qin relied on the steep passes of Xiao and its formidable army of brave soldiers, so it wished to demonstrate its strength, leaving none in the world to dare oppose it. *Shi* means to display.\n\nHe sent the minister Bao Rong to compel Kang Cangzi to come. *Shu zhang* was a Qin noble rank. Bao Rong was a person’s name. He offered twelve ruined cities as inducement, secretly pressuring him. *Zhou* means secret. Desiring Kang Cangzi’s counsel, he offered twelve cities to secure his arrival; fearing he might refuse, he secretly sent Bao Rong to compel him.\n\nKang Cangzi arrived and was lodged as an honored guest at Rongquan. Rongquan was a place in Qin. For three days, Duke Jing could not broach the matter he wished to discuss. This means he sought to question him but could not.\n\nSeating himself below and facing north, he struck his tablet to the ground, saying: \"Does Heaven truly have no intention to aid this orphaned ruler?\" Facing north and striking the tablet were acts of utmost ritual propriety.\n\nKang Cangzi’s gaze subtly shifted as he replied: \"I deemed Your Lordship’s inquiry extraordinary—why then this wearisome insistence?\" *Oilran* describes a slight movement; *kui* means to incline; *mian* signifies a sidelong glance. *Zhen* is the royal \"I.\" \"I thought Your Lordship’s question possessed rare depth—why this fixation on trivial matters?\" He alluded to the subject of warfare and conquest. \"Yet if one follows another’s desires to seek rectification, there is no principle by which it may be deemed proper.\" He meant that since the Duke had framed his question in terms of military force, he would respond in kind to correct his intent, though this was not the highest principle.\n\nDuke Jing bowed once, then again, gathering his embroidered robe and straightening his tablet. Lowering his head, he sat and said: \"This is truly what Heaven has ordained.\" *Furen* refers to the embroidered lapel of a robe; *yishou* means to bow the head. \"I wish to receive your instruction as a mandate from Heaven.\"\n\nKang Cangzi looked up at the rafters and sighed, then lowered his head and composed his expression, saying: \"The origin of warfare and its beginnings arose together with humankind.\" *Cui* means rafter; *yangcui* describes looking up at the roof beams. *Xu* is the sound of a sigh. He sighed toward the rafters, lamenting that the Duke had not inquired into the highest Dao. \"Warfare has existed alongside humanity since the very beginning—it is not unique to the present age. Generally, warfare arises from human might. The possession of might is an innate quality bestowed by Heaven.\" Human nature, including joy and anger, is fundamentally received from Heaven. \"Anger gives rise to might, and might gives rise to the origins of warfare. Thus, the roots of warfare extend far back into antiquity. There has never been even a brief moment when it was not employed.\" *Shaoxuan* means a short while.\n\nThe emotions of joy and anger are employed without constancy, thus there has never been even a brief moment when they were not in use. The noble and the base, the old and the young, the worthy and the foolish—all alike share this. By observing the stirring of anger, one knows the origins of warfare. To discern the omens of war: when resentment lingers in the heart yet remains unexpressed, this is war; when the gaze turns fierce and the countenance shifts, this is war; when haughty words are spoken and forceful thrusts are made, this is war; when boastful strife and violent assaults erupt, this is war. These four are but disputes of greater or lesser scale. *Hui* means anger; *zuose* describes a stern expression; *zun* also means to push, referring to mutual provocation. Though these four differ in magnitude, all arise from a heart of anger, and thus are war.\n\nEven before the time of Chiyou, men already brandished timber and fought. Chiyou, a minister to the feudal lords in the time of the Yellow Emperor, had eighty-one brothers, each with a head of bronze and a brow of iron. He waged war against the Emperor at the wilds of Zhuolu, forged weapons, and was later destroyed by the Yellow Emperor. The Yellow Emperor employed water and fire—some diverted rivers to flood cities, others set fires to burn them. Gonggong rebelled, contending with Zhuanxu for the realm. The Five Emperors likewise contended with one another, each rising and falling in turn; the victorious ruled. The way of warfare knows both decline and resurgence, yet all who prevailed did so by aligning with Heaven.\n\nThere are those who die from swallowing medicine—yet to ban all physicians in the world would be wrong. There are those who die from boarding a boat—yet to ban all ships in the world would be wrong. There are those who lose their states through warfare—yet to ban all warfare in the world would be wrong. Warfare cannot be abolished, just as water and fire cannot: when used well, they bring fortune; when used poorly, they bring disaster.\n\nThus, the rod of anger must not be laid to rest within the household, punishments must not be laid to rest within the state, and military campaigns must not be laid to rest in the world. *Chi* refers to the whip or staff; *yan* means to cease. The sage-kings of antiquity had righteous armies but no idle armies. A righteous army follows Heaven and responds to the people, punishing tyranny and chaos. When an army truly acts with righteousness to punish a cruel ruler and rescue the suffering, the people rejoice as a filial child beholding a loving parent, or as a starving servant encountering a feast. They cry out and rush forward as a powerful crossbow loosed into a deep valley. *Zhen* means to rescue; *li* refers to servants. The comparison to a crossbow shot into a deep valley illustrates the swiftness of the rescue.\n\nThe outcome of victory or defeat does not depend on external signs but must return to human nature. The outcome of war does not lie in external verification but in returning to the sentiments of the people. Human nature desires life and abhors death, seeks honor and shuns disgrace. When the principles of life and death, honor and disgrace are unified, the soldiers of the Three Armies can be made of one heart. If the ruler shares in the life and death, honor and disgrace of the Three Armies, then though the armies be vast, they can be made of one heart.\n\nGenerally, a ruler desires his multitudes to be of one mind. When the Three Armies are of one heart, commands can be issued without fear of opposition. The supreme armies of antiquity valued their commands above all. Thus, the strength of their commands made their enemies weak, and the trustworthiness of their commands made their enemies yield. Victory is first secured here, then secured there. To assess the enemy and secure victory, one must first assess oneself. If one shares life and death with the multitudes and unites the Three Armies in heart, then victory over the enemy is assured. If this is truly so, how could the enemy ever prevail?\n\nWhen the enemy approaches, it is to seek gain. If they come and meet death, then flight becomes their gain. If all enemies see flight as gain, then blades will never meet. This is the supreme army.\n\nArrogance, cruelty, deceit, and treachery stand in opposition to righteousness and principle. Their forces cannot both prevail; they cannot coexist. Thus, when a righteous army enters the enemy’s territory, the people know where to seek refuge. When the army reaches the outskirts of a city or state, it does not trample crops, does not desecrate tombs, does not plunder stores, does not burn homes. It captures people but treats them generously and returns them. It keeps its promises, seizes the enemy’s resources to weaken them, makes clear what is good and evil, and demonstrates what is right and wrong—first showing them righteousness.\n\nIf, despite this, there remain those who are stubborn, cruel, domineering, and defiant, refusing to submit, then the use of force is permissible. *Bihen* means obstinate cruelty; *dang* means reckless defiance. After first demonstrating righteousness, if there are still those who remain wicked and disobedient, then punishing them with force is permissible.\n\nFirst, a proclamation is issued: \"Our army comes to avenge the people’s enemies and to follow the Dao of Heaven.\" Thus, when they conquer a state, they do not massacre its people but punish only those who deserve punishment—only the cruel ruler. Then, they select and honor the worthy and virtuous, seek out the orphaned and infirm, the elderly, and rescue them. They provide for the orphaned and infirm, respect the elderly, open the treasuries and granaries, distributing their wealth and grain without keeping anything for themselves, and bestow honors with great care. They do not hoard their gains but share them with all, offering courtesies to seek out the worthy.\n\nIf there were a man who could save a single life from death, the people of the world would vie to serve him. To save a life means to restore it. If a man, through righteousness, could restore one life from death, the world would hasten to serve him. A righteous army saves not one but many lives—who would not rejoice? Thus, when a righteous army arrives, the people of neighboring states flock to it like flowing water, and the people of the conquered state look upon it as parents. The farther it advances, the more people it gains.\n\nBefore the words were finished, Lord Jing rose, bowed deeply, and said: \"I have been fortunate to hear your teachings, Master. Unknowingly, my spirit fills the cosmos, and my will knows where to turn. My heart swells with ever greater reverence.\"\n\nHaving heard the Way of the righteous army, he cast aside his deceitful and arrogant heart, and thus his qi and will swelled to fill the cosmos, his purpose knowing where to turn. Thereupon, he stepped forward, raised his voice in a toast, and wished Master Kangcang longevity. With each step he advanced, he silently offered blessings, thereby honoring the master and revering the Way. He bowed and took his place at the head of the disciples’ ranks, maintaining strict observance in the purification chamber.\n\nFor over a month, at the hour when the celestial gate opened—*Tian Guan*, that is, the *chen* hour—he practiced the Way by day. *Tian Guan* refers to the celestial net, meaning the *chen* hour. *Practicing the Way* means performing the rites of a disciple.\n\nHere ends the lower scroll of the *Dongling Zhenjing*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞灵真经﹝注﹞ 经名：洞灵真经〔注〕。 原题何璨注，约出於唐宋间。 三卷。 底本出处：《正统道藏》洞神部玉诀类。 参校本：《四部丛刊》三编影印常熟翟氏铁琴铜剑楼藏宋刊本（简称宋刊本）。 此书另有《四库全书》本九卷。 目　录 卷上 全道篇第一 用道篇第二 政道篇第三 卷中 君道篇第四 臣道篇第五 贤道篇第六 卷下 训道篇第七 农道篇第八 兵道篇第九 洞灵真经卷上 何璨注 全道篇第一 夫心冥虚极，德洞玄微。 功并四时，苍生自化。 亢仓子居羽山之颜三年， 羽山，《尚书□禹贡》 在徐州。 《舜典》云：殛鲧于羽山。 盖在东裔，后属鲁。 颜，山之南面也。 《庄子》引此章云：北居垒之山。 即此山是也。 俗无疵疠而仍谷熟。 贤圣之居，天佑神助，近#1无疵疠而五谷丰稔。 频熟曰仍也。 其俗窃相谓曰；",
      "translated_text": "**The Authentic Scripture of Penetrating Spirit (Annotated)**\n\n**Scripture Title:** *The Authentic Scripture of Penetrating Spirit* [Annotated]. Originally annotated by He Can, likely composed between the Tang and Song dynasties. Three fascicles. Base text sourced from: *Daoist Canon of the Zhengtong Era*, *Wondrous Teachings Section*, *Jade Instructions Category*. Collated with: *Sibu Congkan*, Third Series, facsimile of the Song-dynasty printed edition held in the Tieqin Tongjian Library of the Zhai family of Changshu (hereafter referred to as the *Song Edition*). This work also exists in a nine-fascicle version in the *Complete Library of the Four Treasuries*.\n\n**Table of Contents**\n**Fascicle One**\n1. The All-Encompassing Dao\n2. Applying the Dao\n3. Governing by the Dao\n\n**Fascicle Two**\n4. The Dao of the Ruler\n5. The Dao of the Minister\n6. The Dao of the Worthy\n\n**Fascicle Three**\n7. The Dao of Instruction\n8. The Dao of Agriculture\n9. The Dao of Warfare\n\n---\n\n**The Authentic Scripture of Penetrating Spirit, Fascicle One**\nAnnotated by He Can\n\n**1. The All-Encompassing Dao**\nWhen the mind merges with the ultimate void, virtue penetrates the subtle and mysterious. Its merit aligns with the four seasons, and the common people transform of themselves.\n\nKang Cangzi dwelled on the southern slope of Mount Yu for three years. *Mount Yu*, as recorded in the *Yugong* chapter of the *Book of Documents*, lies in Xuzhou. The *Canon of Shun* states: \"Gun was executed at Mount Yu.\" It was situated in the eastern frontier and later belonged to Lu. *Southern slope* refers to the mountain’s southern face. The *Zhuangzi* cites this passage as: \"He dwelled north of Mount Kunlun,\" which refers to this same mountain. The local customs knew no plagues or pestilence, and the grain harvests ripened in succession. Where the worthy and sagely dwell, Heaven protects and spirits aid, so that nearby regions suffer no plagues or pestilence, and the five grains yield abundant harvests. *Successive ripening* is called *still*. The people secretly said to one another...",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 381,
      "start_sentence": 0,
      "end_sentence": 35,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.988182306289673,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\洞灵真经注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "亢仓子始来、吾鲜然异之， 鲜然，惊异之貌也。 异其虚怀寂泊，不在#2近情 今吾日计之不足，岁计之有余，其或圣者耶！ 验其利益，故疑之为圣人。 盍相与尸而祝之、社而稷之乎？ 盍，何不也。 既蒙厚利，欲立为君，何不建置宗庙，并及社稷，尸谷祝祭，南面事之者乎？ 亢仓子闻之色有不释。 其徒黡啜从而启之， 黡啜，亢仓子之门人也。 欲允众心，故从而启之。 亢仓子曰：吾闻至人尸居环堵之室，而百姓猖狂不知其所如往， 至人冥心绝虑有类於尸，无事萧然独居环堵。 苍生欣慕，共往归依，察其所归，非由知者也。 今以羽俗子父窃窃焉将俎豆予，我其的之人耶？ 窃窃，私议之谓也。 我本栖隐，全道任真，今乃俎豆相尊，反成人之标的也。 吾是以不释於老聃之言。 老聃言，我无为而民自化，我无事而民自足，我好静而民自正，今乃反此。 故不释然。 黡啜曰；",
      "translated_text": "When Master Kangcang first arrived, I was struck with astonishment—*fresh with wonder* describes my reaction. I marveled at his empty heart and tranquil stillness, so far removed from common sentiment. Now, as I reckon each day, I find it lacking, yet when I tally the year, I find it abundant. Could he be a sage? Having witnessed his beneficence, I suspect he may indeed be one. Why do we not together enthrone him in sacrifice and worship him as our lord, establishing ancestral temples and honoring both soil and grain? Why not offer him the ritual vessels, perform the invocations, and serve him as our sovereign?\n\nWhen Master Kangcang heard this, his expression showed unease. His disciple Yanshuai, following his lead, sought to persuade him. *Yanshuai was one of Master Kangcang’s disciples.* Wishing to fulfill the people’s desire, he thus urged his master. Master Kangcang replied: I have heard that the perfected one dwells like a corpse in a humble chamber, while the common folk roam wildly, unaware of where they go. The perfected one, with a heart stilled and thoughts extinguished, resembles a corpse—free from affairs, he abides alone in his modest dwelling. Yet the people, drawn by admiration, flock to him in devotion. But when one examines their allegiance, it is not born of wisdom. Now, the elders and youths of Yu’s folk whisper among themselves, preparing to honor me with ritual vessels. Am I truly such a man? I originally sought seclusion to preserve the Way and follow my true nature. Now, to be exalted with ritual vessels is to become the very mark of worldly distinction. This is why I remain unsettled by the words of Lao Dan: \"I practice non-action, and the people transform themselves; I refrain from meddling, and the people prosper on their own; I cherish stillness, and the people correct themselves.\" Yet now, the opposite has come to pass. Thus, I cannot set aside my disquiet.\n\nYanshuai said:",
      "overlap_context": "e* refers to the mountain’s southern face. The *Zhuangzi* cites this passage as: \"He dwelled north of Mount Kunlun,\" which refers to this same mountain. The local customs knew no plagues or pestilence, and the grain harvests ripened in succession. Where the worthy and sagely dwell, Heaven protects and spirits aid, so that nearby regions suffer no plagues or pestilence, and the five grains yield abundant harvests. *Successive ripening* is called *still*. The people secretly said to one another...",
      "start_char": 381,
      "end_char": 761,
      "start_sentence": 36,
      "end_sentence": 57,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.618255853652954,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\洞灵真经注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "不者， 不者，犹不然也。 夫寻常之污，巨鱼无所还其体，而鲵、鳅 音为。 之制； 步仞之丘，巨兽无所隐其躯，而孽狐 之祥； 八尺曰寻，倍寻曰常。 污，池也。 还，回也。 鲵，小鱼而有脚。 制，犹专擅也。 六尺曰步，七尺曰仞。 祆也。 祥，善也。 言小水不能容巨鱼，小丘不能藏大兽。 喻亢仓道德既高，必须厚禄也。 且也尊贤音事能，向善就利，自尧舜以固然，而况羽俗乎？ 先生其听矣。 亢仓子曰：嘻来， 嘻，叹声也。 怪其不达己志，故发嘻叹。 将欲告之远致，故呼之曰来也。 夫二子者知乎？ 二子，尧、舜也。 知乎，言岂知也。 函车之兽介而离山，罔罟制之； 吞舟之鱼，荡而失水，蝼、蚁苦之。 故鸟兽居欲其高，鱼鳖居欲其深。 夫全其形生之人，藏其身也，亦不厌深渺而已。 函，盈也。 介，孤介也。 渺，远也。 吾语若大乱之本，祖乎尧舜之间，其音终存乎千代之后。 千代之后必有人与人相食者矣。 若，汝也。 夫事有先成后败、始吉终凶，胡可必耶？ 故尧舜禅让，光一时之美，迹流后代，成篡弒#3之祸。 故《庄子》云：尧、舜让而帝，之哙让而绝； 汤武争而王，白公争而灭。 斯其效欤？ 夫唯不立善名者，则事迹宜绝，无所企慕耳。 言未，男子荣之樗色蹙然膝席曰：樗年运而长矣，将奚以托业以岂斯言？ 荣之樗，庄子所谓南荣趎也。 既闻高义深欲，蹴然变色，敛膝于席，愿垂告示以敬事此言。 亢仓子曰：全汝形，抱汝生，无使汝思虑营营，若此绪年，或可以及此言。 营营，运动不息也。 绪，终也。 全形抱生，不运思虑，虚心冥寂，道自居之。 若此终年，可及此言也。 虽然，吾才小，不足以化子，子胡不南谒吾师聃？ 聃，老子之字也。 亢仓子既谢荣之樗，不释羽俗而龙已乎天下。 谢，犹遣也。 不释羽俗，潜遁而游，如龙变化，与时升降。 水之性欲清，土者滑音骨之，故不得清； 人之性欲寿，物者滑之，故不得寿。 滑，乱也。 人性寿考，为外物所乱，故使不终天年。 物也者，所以养性也，今世之惑者，多以性养物，则不知轻重也。 衣食养性，不可一日而无。 而惑者乃损性以求物，物愈积而性愈伤，殊不知性重而物轻。 盖倒置者也。 是故圣人之於声色滋味也，利於性则取之，害於性则捐之，此全性之道也。 万人操弓，音共射一招，招无不中； 万物章章，以害一生，生无不伤。 捐，弃也。 操，持也。 招，射的也。 章章，犹扰扰也。 故圣人之制万物也，全其天也。 圣人抑制万物，不使伤性以全天真。 天全则神全矣。 神全之人不虑而通，不谋而当，精照无外，志凝宇宙，德若天坠。 然上为天子而不骄，下为匹夫而不惛，此之为全道之人。 神全之人，智虑充溢，精明照於无外，志气凝乎宇宙，覆载之德同乎天地。 虽贵为天子，贱为匹夫，不以穷达而回其志者也。 心平正不为外物所诱曰清，清而能久则明，明而能久则虚，虚则道全而居之。 秦佚死，亢仓子哭之。 秦佚，古之有道者，盖老子之友也。 其役曰：天下皆死，先生何哭 也？ 役，谓门人，充使役也。 死生之道，古今是常，达人体之，不哭可也。 亢仓子曰：天下皆哭，安得不哭？ 顺物而哭，虽哭而非哭也。 其役曰：哭者必哀，而先生未始哀，何也？",
      "translated_text": "\"Nay,\"—\"nay\" means \"not so.\" Consider the shallow puddle: the great fish cannot turn its body within it, while minnows and loaches dominate its bounds. The modest hillock: the mighty beast cannot conceal its frame upon it, while wretched foxes claim its omens. A length of eight *chi* is called a *xun*; twice that is a *chang*. A *wu* is a pool. *Huan* means to turn back. The *ni* is a small fish with legs. *Zhi* means to monopolize. Six *chi* make a *bu*; seven *chi* make a *ren*. *Nie* signifies misfortune. *Xiang* means auspiciousness. Thus, shallow waters cannot contain the great fish, nor can small hills hide the massive beast. This illustrates that one as lofty as Kang Cang must require ample emolument.\n\nMoreover, to honor the worthy and employ the capable, to incline toward goodness and pursue advantage—this has been the way since the time of Yao and Shun. How much more so for the folk of Yu? Sir, you should heed this.\n\nKang Cangzi said: \"Ah, come! Ah!\"—*Xi* is an exclamation, expressing surprise at their failure to grasp his intent. Wishing to instruct them in loftier matters, he called out, \"Come!\"\n\n\"Do those two understand?\"—The \"two\" refer to Yao and Shun. \"Understand?\" implies, \"How could they?\" The beast that fills a carriage, once parted from the mountain, is ensnared by nets and traps. The fish that swallows a boat, once cast from the water, is tormented by ants and crickets. Thus, birds and beasts seek the heights for their dwelling, while fish and turtles seek the depths. For one who preserves his form and life, to conceal himself requires nothing less than profound obscurity. *Han* means fullness. *Jie* means solitary. *Miao* means distant.\n\nI speak to you of the roots of great disorder, which trace back to the era of Yao and Shun and will endure for a thousand generations hence. In a thousand generations, there will surely be men who devour one another. *Ruo* means \"you.\" For matters may begin in success and end in failure, start with fortune and conclude with misfortune—how can one be certain? Thus, Yao and Shun’s abdication brought a momentary glory, but their legacy flowed into later ages, giving rise to usurpation and regicide. As *Zhuangzi* says: \"Yao and Shun abdicated and became emperors; Zhi Kuai abdicated and perished. Tang and Wu contended and reigned; Bai Gong contended and was destroyed.\" Is this not the proof?\n\nOnly by refusing to establish a reputation for goodness can one ensure that no traces remain to invite emulation. Before he could finish speaking, the man Rongzhi Chu’s countenance darkened, and he drew his knees close upon his mat, saying: \"My years advance ever onward—how may I entrust my life’s work to these words?\" Rongzhi Chu is the Nan Rong Chu of whom *Zhuangzi* speaks. Having heard such profound teachings, his expression changed, and he gathered himself upon his seat, entreating instruction with reverence.\n\nKang Cangzi said: \"Preserve your form, embrace your life, and let not your thoughts churn restlessly. If you persist in this until the end of your days, you may yet attain these words. *Yingying* means ceaseless motion. *Xu* means conclusion. To preserve form and embrace life is to still the churning of thought, emptying the mind into profound stillness, where the Dao naturally abides. If you do so until the end of your days, you may attain these words.\n\nYet my talents are meager and insufficient to transform you. Why not journey south to seek my master, Dan?\"—Dan is the courtesy name of Laozi.\n\nKang Cangzi, having dismissed Rongzhi Chu, did not abandon the folk of Yu but soared like a dragon through the world. *Xie* means to send away. \"Did not abandon the folk of Yu\" means he remained in reclusion, wandering like a dragon, ascending and descending with the times.\n\nWater’s nature is to be clear, but earth muddies it, so it cannot remain clear. Man’s nature is to live long, but things muddy it, so he cannot attain longevity. *Gu* means disorder. Man’s nature is to live a full span, but external things disorder it, preventing him from completing his natural years.\n\nThings exist to nourish our nature, yet the deluded of this age often use their nature to nourish things, failing to distinguish weight from lightness. Clothing and food nourish our nature and cannot be lacking for even a day. Yet the deluded harm their nature in pursuit of things, accumulating more while their nature suffers ever greater injury—unaware that nature is weighty and things are light. This is a complete inversion.\n\nThus, the sage’s approach to sounds, colors, and flavors is this: if they benefit his nature, he takes them; if they harm his nature, he discards them. This is the way to preserve one’s nature. A thousand men draw their bows, all aiming at a single target, and the target is struck without fail. A thousand things clamor, all harming a single life, and that life is wounded without exception. *Juan* means to discard. *Cao* means to hold. *Zhao* is the target. *Zhangzhang* means bustling. Thus, the sage’s regulation of the myriad things is to preserve their Heaven. The sage restrains the myriad things, preventing them from harming his nature, thereby preserving his Heavenly truth. When Heaven is preserved, spirit is preserved.\n\nThe man of whole spirit requires no deliberation to penetrate all things, no scheming to act rightly. His essence illuminates all without, his will congeals within the cosmos, and his virtue descends like Heaven. Such a one may be the Son of Heaven yet remain unarrogant, or a common man yet remain untroubled—this is the man of whole Dao. The man of whole spirit is filled with wisdom and insight, his essence shining boundlessly, his will and qi congealing within the cosmos, his virtue of nurturing and sustaining equal to Heaven and Earth. Whether exalted as the Son of Heaven or lowly as a common man, he does not alter his resolve in response to poverty or prosperity.\n\nA mind level and upright, unenticed by external things, is called *qing* (pure). Purity sustained becomes *ming* (lucidity). Lucidity sustained becomes *xu* (emptiness). In emptiness, the Dao is whole and dwells within.\n\nWhen Qin Yi died, Kang Cangzi wept for him. Qin Yi was an ancient man of the Dao, a friend of Laozi. His disciple asked: \"When all the world dies, Master, why do you weep?\"—*Yi* refers to a disciple, one who serves. The way of life and death is constant across past and present. The enlightened comprehend this and do not weep—is that not so?\n\nKang Cangzi said: \"When all the world weeps, how can I not weep? To weep in accord with things is to weep without truly weeping.\"\n\nHis disciple said: \"Weeping must express sorrow, yet Master, you have not begun to grieve. Why?\"",
      "overlap_context": "an? I originally sought seclusion to preserve the Way and follow my true nature. Now, to be exalted with ritual vessels is to become the very mark of worldly distinction. This is why I remain unsettled by the words of Lao Dan: \"I practice non-action, and the people transform themselves; I refrain from meddling, and the people prosper on their own; I cherish stillness, and the people correct themselves.\" Yet now, the opposite has come to pass. Thus, I cannot set aside my disquiet.\n\nYanshuai said:",
      "start_char": 761,
      "end_char": 2079,
      "start_sentence": 58,
      "end_sentence": 141,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.676557540893555,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\洞灵真经注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "未始，犹未尝也。 世人之哭必生哀痛，今先生虽哭不见悲伤，敢问何故也？ 亢仓子曰：举天下之吾无与乐，安所取哀？ 夫有乐必有哀，人之常情也。 达人大观，岂有疏亲？ 既不与为乐，亦无所取哀。 蜕坠之谓水，蜕水之谓气，蜕气之谓虚，蜕虚之谓道。 蜕者，免脱之谓也，夫脱地之谓水，脱水之谓气，脱气之谓虚，脱虚之谓道，犹至人不系情於哀乐，然后为极也。 虚者道之体，靖者道之地，理者道之纲，识者道之目。 言至人能虚能静有识有理者，则能契道之形体，知道之纲目。 道所以保神，德所以弘量，礼所以齐仪，物所以养体。 四者皆可以资身，不可暂无也。 好质白之物者以黑为污； 好质黑之物者，以白为污。 吾又安知天下之正洁污哉？ 由是不主物之洁污矣。 夫瞀视者以黈为赤，以苍为玄，吾乃今所谓皂白，安知识者不以为赪黄，吾又安知天下之正色哉？ 由是不遁物之色矣。 瞀，风眩也。 黈黄色也。 赪，赤色也。 夫有风眩之疾者，视物不能审也。 故以黄为赤，以青为黑，亦犹凡俗之情妄执洁污。 虽有大圣，孰能正之？ 故不主一其洁污不流遁於众色也。 夫好货甚者，不见他物之可好； 好马甚者，不见他物之可好； 好书甚者，不见他物之可好。 吾又安知天下之果可好者，果可恶者哉？ 由是不见物之可以保恋矣，无能滑吾音长矣。 果，决定也。 保，犹怀也。 陈怀君柳使其大夫祷行聘於鲁。 怀君，谥也。 柳，名也。 祷陈大夫之名也。 叔孙卿私曰： 叔孙氏，世为鲁卿也。 吾国有圣人，若知之乎？ 圣人，谓仲尼也。 陈大夫曰； 奚以果明其圣？ 叔孙卿曰； 能废心而用形。 圣境超殊，非凡情所测，徒见其能应接世务，便证以为圣人，岂知其所圣哉？ 陈大夫曰：弊邑则小，亦有圣人，异於所闻。 曰：圣人 谁？ 陈大夫曰：有亢仓子者，偏得老聃之道， 门人之中最为称首，故曰偏得也。 其能用耳视而目听，定公闻而异焉，使叔孙氏报聘，且致亢仓子，待以上卿之礼。 亢仓子至宾于亚寝。 亚寝，公之次殿。 鲁公卑辞以问之。 亢仓子曰：吾能听视不用耳目，非能易耳目之所用，告者过也。 公曰：孰如是寡人增异矣，其道若何？ 寡人果愿闻之。 亢仓子曰：我体合於心，心合於气，气合於神，神合於无，其有介然之有，唯然之音，虽远际八荒之表，迩在眉睫之内，来干我者，吾必尽知之，乃不知 是。 我七窍手足之所觉，六腑五脏心虑之所知，其自知而已矣 心形泯合，神气冥符，洞然至忘，与无同体，然后心弥静而智弥远，神愈默而照愈章，理极而自通，不思而玄览。 非夫至圣至神，其孰能与於此哉？ 斯固灵真之要枢，重玄之妙道也。 用道篇第二 无非利物，上合天心，克己归仁，化行刑措。 天不可信，坠不可信； 人不可信，心不可信。 惟道可信，贤主秀士岂可知哉？ 昔者桀信天与其祖四海，已不勤於道，天夺其国以授殷。 纣亦信天与其祖四海，己不躬於道，天夺其国以授周。 与，犹以也。 祖，犹主也。 夏桀、殷纣，耽淫奢纵，自云有命，禀於上天。 穷凶肆虐，不修其道，故天夺其国以授於汤武。 今夫堕音农信坠实生百谷，不力於其道，坠窃其果稼而荒翳之。 堕农之人信坠生谷，不勤耘耕，稂莠荒芜。",
      "translated_text": "\"Unbegun\" means \"never yet.\" The world’s weeping must arise from sorrow and pain—yet though you weep, Master, no grief appears. May I ask why?\n\nKang Cangzi said: When all under heaven shares no joy with me, where would I find sorrow? Joy and sorrow are the common lot of men. The enlightened see broadly—what distance lies between kin and stranger? Since I share no joy, I take no sorrow.\n\nWhat falls away is called water; what falls away from water is called *qi*; what falls away from *qi* is called emptiness; what falls away from emptiness is called the Dao. \"Falling away\" means casting off. Casting off earth is water; casting off water is *qi*; casting off *qi* is emptiness; casting off emptiness is the Dao. Thus the perfected person, unbound by joy or sorrow, attains the ultimate.\n\nEmptiness is the Dao’s body; stillness is the Dao’s ground; principle is the Dao’s warp; discernment is the Dao’s eye. To say the perfected person can be empty, still, discerning, and principled is to say they unite with the Dao’s form and grasp its warp and weft.\n\nThe Dao preserves spirit; virtue expands capacity; ritual orders conduct; things nourish the body. These four sustain life and cannot be briefly forsaken.\n\nThose who favor white things deem black defiled; those who favor black things deem white defiled. How then can I know what under heaven is truly pure or defiled? Thus I do not fix upon purity or defilement.\n\nThe dim-sighted see yellow as red, blue as black—what I call black and white, how can the discerning not see as crimson and yellow? How then can I know what under heaven is the true color? Thus I do not flee from colors.\n\n*Mao* means vertigo. *Tou* is yellow; *cheng* is red. Those with vertigo cannot see clearly, mistaking yellow for red and green for black—just as the common mind clings falsely to purity and defilement. Even a great sage cannot correct this, so I do not fix upon purity or defilement nor drift among colors.\n\nThose who love wealth excessively see nothing else worth loving; those who love horses excessively see nothing else worth loving; those who love books excessively see nothing else worth loving. How then can I know what under heaven is truly lovable or detestable? Thus I do not see things as worthy of attachment, and nothing can disturb my constancy.\n\n\"Fruit\" means determination; \"preserve\" means cherishing. Duke Huai of Chen sent his minister Dao to pay a visit to Lu. Huai was his posthumous name; Liu was his given name. Dao was the name of Chen’s minister.\n\nViscount Sun privately asked: The Viscount Sun clan had long served as ministers of Lu. Does our state have a sage? Do you know of him?\n\nThe sage referred to Confucius.\n\nThe minister of Chen asked: How can you be certain of his sagacity?\n\nViscount Sun said: He can set aside the mind and use the body.\n\nThe sagely realm transcends the ordinary—how can common sentiments fathom it? They see only his ability to handle worldly affairs and take that as proof of sagacity, yet how can they know his true sagacity?\n\nThe minister of Chen said: Our humble state is small, yet it too has a sage, different from what you have heard.\n\nHe asked: Who is this sage?\n\nThe minister of Chen said: There is one called Kang Cangzi, who partially attained the Dao of Lao Dan. Among his disciples, he is most renowned—hence \"partially attained.\" He can use his ears to see and his eyes to hear.\n\nDuke Ding heard this and found it strange. He sent the Viscount Sun clan to return the visit and invite Kang Cangzi, receiving him with the rites due an upper minister.\n\nKang Cangzi arrived and was lodged in the secondary hall. The Duke of Lu spoke humbly to inquire of him.\n\nKang Cangzi said: I can hear and see without using ears or eyes—it is not that I reverse their functions, as the messenger mistakenly reported.\n\nThe Duke said: How can this be? You increase my wonder. What is this Dao like? I truly wish to hear of it.\n\nKang Cangzi said: My body unites with mind, mind with *qi*, *qi* with spirit, spirit with nothingness. Though there is a boundary of being, a resonance of sound—whether distant beyond the eight wilds or near within the space between brows and lashes—whatever comes to me, I know it completely, yet do not know *how* I know it.\n\nWhat my seven orifices and limbs perceive, what my six viscera, five organs, and heart-mind know—these I know of myself. When mind and form merge, spirit and *qi* mysteriously align, utterly forgotten, one with nothingness—then the mind grows ever stiller and wisdom ever more far-reaching, spirit ever more silent and illumination ever clearer. Principle reaches its limit and naturally flows; without thought, one gazes into the profound.\n\nWho but the supremely sagely and spiritually attuned can attain this? This is indeed the pivotal essence of numinous reality, the wondrous Dao of profound mystery.\n\n**Using the Dao, Second Chapter**\n\nNothing fails to benefit things; it accords with the heart of Heaven. Mastering oneself, one returns to benevolence; transformation spreads, and punishments are set aside.\n\nHeaven cannot be trusted; falling cannot be trusted; men cannot be trusted; the heart cannot be trusted. Only the Dao can be trusted. How can worthy rulers and outstanding scholars know this?\n\nOf old, Jie trusted Heaven and his ancestral dominion over the Four Seas, yet he did not cultivate the Dao, so Heaven took his state and granted it to Yin. Zhou likewise trusted Heaven and his ancestral dominion over the Four Seas, yet he did not personally practice the Dao, so Heaven took his state and granted it to Zhou.\n\n\"Granted\" means \"bestowed\"; \"ancestral\" means \"primary.\" The Xia tyrant Jie and the Yin tyrant Zhou indulged in excess and extravagance, claiming their mandate came from Heaven. Yet they acted with utter cruelty, neglecting the Dao, so Heaven took their states and bestowed them upon Tang and Wu.\n\nNow, the slothful farmer trusts that falling seeds produce all grains, yet if he does not exert himself in the Dao, weeds will steal his harvest and leave it overgrown. The indolent farmer trusts that seeds produce grain but does not diligently weed or plow, so the fields become choked with weeds.",
      "overlap_context": "f the Dao, a friend of Laozi. His disciple asked: \"When all the world dies, Master, why do you weep?\"—*Yi* refers to a disciple, one who serves. The way of life and death is constant across past and present. The enlightened comprehend this and do not weep—is that not so?\n\nKang Cangzi said: \"When all the world weeps, how can I not weep? To weep in accord with things is to weep without truly weeping.\"\n\nHis disciple said: \"Weeping must express sorrow, yet Master, you have not begun to grieve. Why?\"",
      "start_char": 2080,
      "end_char": 3379,
      "start_sentence": 142,
      "end_sentence": 215,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.9489803314209,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\洞灵真经注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "故不能获果稼。 齐后信人之性酬让，不明於其道，举全境以付人，人实鸦义而有其国。 后，君也，齐简公也。 信人性不明酬让，为陈恒之所弒，而取其国。 鸱义，喻贪残也。 凡人不修其道，随其心而师之，营欲茂滋，灾疾朋衅，戕身损寿，心斯害之矣， 人自师心，不遵圣教，营欲炽盛，百殃斯集。 此乃心为身害。 朋，犹群也。 衅，犹动也。 戕，害者也 故曰惟道可信。 道者，坦荡恬怡，无所染着。 人能虚心归道，则身命保全也。 天坠非道，不能悠久； 天得一以清，地得一以宁。 苍生非贤，不能靖顺； 庶政非材，不能龢理。 贤材皆用，道以理物。 夫用道之人，不露其用，福滋万物，归功无有， 潜功密济，百姓谓我自然。 神融业茂，灵庆悠长。 融，通也。 神理通达，德业荣茂，积善所钟，庆流后裔也。 知而辨之谓之识，知而不辨谓之道。 识以理人，道以安人。 辨析事物，使人去恶就善，所以理人也。 含弘冲寂，无所毁誉，所以安镇浮竞也。 夫鸡音辰而作，负日任劳，流汗洒坠，夜分仅息，夫之道也。 鸡晨，谓鸡鸣之旦也。 夜分，中夜。 负日，为日所曝也。 仅，少也。 俯拾仰取，锐心锥撮，力思搏精，希求利润，贾竖之道也。 咽气谷神，宰思损虑，超遥轻举，日精炼仙，高士之道也。 咽气，胎息，五牙之类也。 谷，养也。 宰，割也。 日精，吸日精也。 炼仙，炼质专而乃升仙也。 剸情端想，毕志所事，伦揆忘寝，谋效位司，人臣之道也。 专情正想，尽忠於所事之君； 导理揆度，效功於所司之位，是人臣之道也。 清心省念，察验近习，务求才良，以安万姓，人主之道也。 清心，寡嗜欲也。 省念，无私也。 近习，谓近臣。 若由是类之，各顺序其志度，不替音塞其业履，是为天下有道。 农夫贾竖，各保其业，明君贤臣，各修其道，则天下顺序而业履安定者也。 导筋骨则形全，剪情欲则神全，靖言语则福全。 音克此三全，是谓清贤。 道德盛，则鬼神助，信义敦，则君子合，礼义备，则小人怀。 有识者自是，无识者亦自是； 有道者静默，暗钝者亦静默。 物固有似是而非，似非而是； 先号后笑，始吉终凶； 身可亲而才不堪亲，才可敬而身不堪敬； 敬甚则不亲，亲甚则不敬； 亲之而疏，疏之而亲。 恩甚则怨生，爱多则憎至。 有以速为贵，有以缓为贵，有以直为贵，有以曲为贵。 百事之宜，其由甚微，不可不知，是故智者难之。 静则神通，穷则意通，贵则语通，富则身通，理势然也。 王本云理，势使然也。 同道者相爱，同菊者相嫉； 同与者相爱，同取者相嫉； 同病者相爱，同壮者相嫉； 人情自然也。 情通无求则相爱，争能尚胜则相嫉，势使然也。 才多而好谦，贫贱而不谄，处劳而不为辱，贵富而益恭勤，可谓有德者也。 政道篇第三 顺天行令，不择亲疏； 异域同归，望风而靡。",
      "translated_text": "Thus he cannot reap his harvest.\n\nThe Lord of Qi trusted in human nature’s propensity for yielding and deference, yet he did not comprehend the Dao. He entrusted his entire realm to others, who in truth were like kites and jackals, seizing his state. *Lord* refers to the ruler, namely Duke Jian of Qi. Trusting in human nature’s lack of clarity in yielding and deference, he was assassinated by Chen Heng, who took his state. *Kites and jackals* is a metaphor for rapacity and cruelty.\n\nWhenever one does not cultivate the Dao but follows the heart’s inclinations as a teacher, nurturing desires to flourish and multiply, calamities and illnesses arise in swarms, harming the body and shortening life—such is the heart’s harm to the self. When one takes the heart as teacher and does not follow sagely teachings, desires burn fiercely, and a hundred misfortunes gather. This is how the heart harms the body. *Swarms* means groups; *arise* means to stir; *harm* means to injure.\n\nThus it is said: only the Dao can be trusted. The Dao is vast, tranquil, and serene, unstained by attachment. If one empties the heart and returns to the Dao, body and life are preserved.\n\nHeaven, without the Dao, cannot endure long; Heaven attains the One and becomes clear, Earth attains the One and becomes stable. The common people, without the worthy, cannot be pacified and obedient; governance, without talent, cannot be harmonized and ordered. When the worthy and talented are all employed, the Dao is used to order things.\n\nThose who employ the Dao do not display their use of it; their blessings nourish the myriad things, yet they claim no merit. Their hidden merits and subtle aid allow the people to say, “We are naturally thus.” Their spirit flows and their deeds flourish, their numinous blessings enduring long. *Flows* means to circulate. When the workings of spirit are unimpeded and virtue’s deeds flourish, accumulated goodness gathers, and blessings flow to descendants.\n\nTo know and distinguish is called *discernment*; to know without distinguishing is called the *Dao*. Discernment is for governing people; the Dao is for pacifying them. Analyzing and distinguishing things guides people to abandon evil and embrace good—this is how one governs. Embracing vastness, dwelling in tranquility, refraining from praise or blame—this is how one pacifies and stills restless striving.\n\nThe rooster crows at dawn, toiling under the sun, sweat dripping to the ground, resting only at midnight—such is the farmer’s Dao. *Dawn* refers to the cock’s crow at daybreak; *midnight* is the middle of the night; *toiling under the sun* means exposed to the sun’s heat; *only* means barely.\n\nBending to gather, reaching to take, sharpening the mind like an awl, straining thought to concentrate, seeking profit and gain—such is the merchant’s Dao.\n\nSwallowing qi and nurturing spirit, cutting off thoughts and reducing cares, transcending and ascending lightly, refining the essence of the sun to attain immortality—such is the noble adept’s Dao. *Swallowing qi* refers to embryonic breathing and the Five Sprouts; *nurturing* means to cultivate; *cutting off* means to sever; *essence of the sun* means absorbing solar essence; *refining immortality* means refining one’s substance until ascent to immortality is achieved.\n\nDirecting emotions and focusing thoughts, dedicating oneself wholly to one’s duties, deliberating with such devotion that sleep is forgotten, planning to fulfill one’s office—such is the minister’s Dao. Concentrating emotions and rectifying thoughts, devoting loyalty to the ruler one serves; guiding governance and measuring affairs to render service in one’s office—this is the minister’s Dao.\n\nPurifying the heart and reducing thoughts, examining and verifying close attendants, striving to seek worthy talent to pacify the myriad people—such is the ruler’s Dao. *Purifying the heart* means diminishing desires; *reducing thoughts* means being selfless; *close attendants* refers to courtiers.\n\nIf each follows the order of their aspirations and measures, not obstructing their professional conduct, this is called *the world possessing the Dao*. Farmers and merchants each preserve their vocations; enlightened rulers and worthy ministers each cultivate their Dao—thus the world follows its order, and professional conduct is secure.\n\nGuiding the sinews and bones preserves the form; pruning emotions and desires preserves the spirit; quieting speech preserves blessings. Mastering these three preservations is called *pure worthiness*.\n\nWhen the Dao and virtue flourish, ghosts and spirits assist; when trust and integrity are sincere, the noble converge; when rites and propriety are complete, the petty submit.\n\nThose with discernment are self-assured; those without discernment are also self-assured. Those with the Dao are silent and still; the dull and obtuse are also silent and still. Things inherently possess what seems right but is wrong, what seems wrong but is right. Some wail first and laugh later; some begin auspiciously and end in misfortune. Some bodies may be embraced, yet their talents cannot be; some talents may be revered, yet their bodies cannot be. Excessive reverence precludes intimacy; excessive intimacy precludes reverence. Embracing may lead to estrangement; estrangement may lead to embrace. Excessive favor breeds resentment; excessive love invites hatred.\n\nSome value speed, some value slowness; some value straightness, some value curvature. The suitability of all affairs arises from the subtlest origins—one cannot be ignorant of them, which is why the wise find them difficult.\n\nStillness allows spirit to penetrate; adversity allows intent to penetrate; nobility allows speech to penetrate; wealth allows the body to penetrate—such is the nature of principle and circumstance. Some texts read: *such is the nature of principle, the force of circumstance.*\n\nThose who share the Dao love one another; those who share chrysanthemums envy one another. Those who give love one another; those who take envy one another. Those who share suffering love one another; those who share strength envy one another—this is the natural human condition. When emotions connect without seeking, they love; when competing for ability and striving for superiority, they envy—such is the force of circumstance.\n\nTalented yet fond of humility, poor and lowly yet not obsequious, enduring toil yet not deeming it disgrace, noble and wealthy yet increasingly reverent and diligent—this may be called one who possesses virtue.\n\n**Section Three: The Dao of Governance**\nEnforce the decrees of Heaven and act accordingly, without regard for near or far. Distant lands converge as one, submitting at the mere sight of virtue.",
      "overlap_context": "hou indulged in excess and extravagance, claiming their mandate came from Heaven. Yet they acted with utter cruelty, neglecting the Dao, so Heaven took their states and bestowed them upon Tang and Wu.\n\nNow, the slothful farmer trusts that falling seeds produce all grains, yet if he does not exert himself in the Dao, weeds will steal his harvest and leave it overgrown. The indolent farmer trusts that seeds produce grain but does not diligently weed or plow, so the fields become choked with weeds.",
      "start_char": 3379,
      "end_char": 4535,
      "start_sentence": 216,
      "end_sentence": 288,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.66111373901367,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\洞灵真经注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "人无法以知天之四时寒暑，日月星之所行，若知天之四时寒暑、日月星之所行当，则诸生血气之类皆得其处，而安其产矣。 人臣亦无法以知主之赏罚爵禄之所加，若知主之赏罚爵禄之所加宜，则亲疏、远近、贤不肖皆尽其才力，而以为用矣。 信全则天下安，信失则天下危。 夫百姓勤劳，财物殚尽，则争害之心生，而不相信矣。 人不相信，由政之不平也。 政之不平，吏之罪也。 吏之有罪，刑赏不齐也。 刑赏不齐，主不勤明也。 夫主勤明则刑赏一，刑赏一则吏奉法，吏奉法则政下宣，政下宣则民得其所，而交相信矣。 是知天下不相信者，由主不勤明也。 亢仓子居息壤五年， 息壤，是周地名也。 灵王使祭公致篚帛与纫璐， 灵王，周灵王也。 祭公，周之卿士也。 璐，美玉也。 灵王慕亢仓之德，使祭公致玉帛之礼以聘之。 篚，盛帛之篚也。 纫，所以贯玉者也。 曰：余末小子，否德忝位，水旱不时，藉为人，若何以禳之？ 灵王云：我浅末小子，不明其德，忝君宝位，致使水旱失时，人遭饥苦，故请问禳辟之方也。 亢仓子曰：水，阴沴也。 阴於国政类刑，人事类私。 沴，乱也。 水，阴象，阴主刑。 水，又潜流私匿之类也。 若刑狱不直，人事多私，则有沴#1水之灾也。 旱，阳过也。 阳於国政类德，人事类盈。 旱，阳象。 阳主德。 阳，为显盛骄盈之类也。 若君不修其德，人事盈侈，则有大旱之灾也。 楚以为凡遭水旱，天子宜正刑修德，百官宜去私戒盈，则以类而消，百福日至矣。 楚，亢仓子名也。 后皆放此。",
      "translated_text": "Men cannot fathom the cycles of Heaven’s four seasons—cold and heat, nor the movements of sun, moon, and stars. Yet if they knew the proper course of Heaven’s seasons—cold and heat, sun, moon, and stars—then all living creatures of blood and qi would find their place and rest secure in their procreation.\n\nMinisters likewise cannot fathom where their lord’s rewards, punishments, ranks, and emoluments will fall. Yet if they knew where such bestowals were fitting, then the near and far, worthy and unworthy alike would exhaust their talents and strengths to be of use.\n\nWhen trust is complete, the realm is at peace; when trust is lost, the realm is in peril. When the common people toil exhaustively and their resources are spent, contentious and harmful thoughts arise, and trust is broken. When men do not trust, it is because governance is unjust. When governance is unjust, it is the fault of the officials. When officials are at fault, it is because punishments and rewards are uneven. When punishments and rewards are uneven, it is because the lord is not diligent and enlightened. When the lord is diligent and enlightened, punishments and rewards are unified; when punishments and rewards are unified, officials uphold the law; when officials uphold the law, governance flows downward; when governance flows downward, the people find their place and mutual trust is restored. Thus we know that the loss of trust throughout the realm stems from the lord’s lack of diligence and enlightenment.\n\nKang Cangzi dwelled in Xirang for five years. (Xirang was a place name in Zhou.) King Ling dispatched Minister Ji to present a bamboo basket of silk and threaded jade. (King Ling was King Ling of Zhou; Minister Ji was a minister of Zhou. *Lu* was fine jade.) King Ling, admiring Kang Cangzi’s virtue, sent Minister Ji with gifts of jade and silk to summon him. (The *fei* was a basket for holding silk; *ren* was the cord used to string jade.) The king said: “I, a humble and unworthy youth, have disgraced the throne. Floods and droughts come unseasonably—how, as a mere man, may I avert them?”\n\nKing Ling said: “I, a shallow and unworthy youth, have failed in virtue and disgraced the royal seat, bringing untimely floods and droughts that cause the people to suffer hunger. I humbly ask for the method to dispel these calamities.”\n\nKang Cangzi replied: “Floods are the disorder of yin. In governance, yin corresponds to punishment; in human affairs, it corresponds to selfishness. (*Li* means disorder. Water is a yin image, and yin governs punishment. Water also resembles hidden, selfish currents.) If punishments are unjust and human affairs are rife with selfishness, then the disorder of floodwaters arises.\n\nDrought is the excess of yang. In governance, yang corresponds to virtue; in human affairs, it corresponds to excess. (Drought is a yang image. Yang governs virtue. Yang also resembles ostentation, arrogance, and excess.) If the lord does not cultivate virtue and human affairs are marked by extravagance, then the calamity of great drought arises.”\n\nChu (Kang Cangzi’s given name) concluded: “Whenever floods or droughts occur, the Son of Heaven should rectify punishments and cultivate virtue, while all officials should eliminate selfishness and guard against excess. Thus, by correspondence, the calamities will dissipate, and a hundred blessings will arrive.” (All subsequent references follow this pattern.)",
      "overlap_context": "eting for ability and striving for superiority, they envy—such is the force of circumstance.\n\nTalented yet fond of humility, poor and lowly yet not obsequious, enduring toil yet not deeming it disgrace, noble and wealthy yet increasingly reverent and diligent—this may be called one who possesses virtue.\n\n**Section Three: The Dao of Governance**\nEnforce the decrees of Heaven and act accordingly, without regard for near or far. Distant lands converge as one, submitting at the mere sight of virtue.",
      "start_char": 4536,
      "end_char": 5151,
      "start_sentence": 289,
      "end_sentence": 324,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.481083393096924,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\洞灵真经注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "郑有胡之封珪、戎弓， 胡，国名。 封珪，大珪也。 戎弓，弓名也。 二物本胡国所有，后为郑所得也。 异时失同於荆。 异时，犹他时也。 诸侯殷见曰同。 荆，楚之旧号也。 盖时楚大，诸侯共朝于楚，为会同之期，而郑后至也。 荆曰：必得封珪、戎弓，不然，临兵于汝。 荆恃强大，欲行非义，因郑后期，胁而迫之，将求二物。 郑君病之，驾见亢仓子，曰：封珪、戎弓先君得之胡，绵代功实传章翼嗣。 病，患也。 绵，历也。 翼嗣，谓后嗣。 先君得此二物，敬而藏之，欲传示子孙，以为有功之宝也。 今荆恃大而曰必得，不然临兵国危矣。 寡人欲以他封珪，戎弓往，若之何？ 他封珪、别珪也。 亢仓子曰：君其少安， 劝君少安，勿怀忧惧。 今是楚亦有宝於此， 亢仓以信义为宝也。 饰楚之宝以贳罪於君，楚所不能为， 贳，赊也。 伪以他珪欺诳大国，取我诚信光饰而行。 虽罪可延赊，终致后戮。 陷君於罪，亏我信义，故我不能为也。 君必致夫真。 劝郑君勿以他珪往。 今荆以浅鲜之过而负其威刑，申逞不直以耗敚与国，荆失诸侯，於是乎在诸侯闻之，将警劝备伦比勤明，会同上义，固存郑为首，君姑待之，岂必非福？ 浅，鲜小貌也。 负，恃也。 逞，快也。 伦比，犹等伦也。 姑，且也。 郑之失期，实为小过； 荆恃强大，欲肆威刑，胁迫珪弓，侵夺与国，无德贪取必失诸侯矣。 於是，以胡珪、戎弓往。 未至郢， 郢，荆所都。 荆人闻之， 闻么几仓之谋也。 曰：彼用圣人之训辞，吾焉取此，以暴不直於天下，而令诸侯实生心焉。 遽返其赂，而益善郑焉。 暴，犹露也。 遽，急也。 赂，即郑之珪弓也。 人之情欲生而恶死，欲安而恶危，欲荣而恶辱。 天下之人得其欲则乐，乐则安； 不得其欲则苦，苦则危。 若人主放其欲，则百吏庶具展其欲； 放，谓放纵也。 百吏，百官也。 庶果，众事之长。 展，申者也。 百吏庶具展其欲，则天下之人，贫者竭其力，富者竭其财，四人失其序， 士农工商，失其次序。 皆不得其欲矣。 天下之人不得其欲，则相与擭持，保抱逋逃，隐蔽漂音流，捃采以祈性命。 捃，拾也。 采，取也。 拾取野果求养性命。 吏又从而捕之，是故不胜其危苦，因有群聚背叛之心生，若群聚背叛之心生，则国非其国也。 勿贪户口，百姓汝走； 勿壮城池，百姓汝疲； 赋敛不中，穷者日穷； 刑罚且二，贵者日贵； 科禁不行，国则以倾。 中，平之也。 官吏非才，则宽猛失所。 或与百姓争利，由是狡诈之心生，所以百姓奸而难知。 夫下难知则上人疑，上人疑则下益惑，下既惑则官长劳，官长劳则赏不足劝，刑不能禁，易动而难静，此由官不得人故也。 政术至要，力於审士。 力，犹勤也。 士有才行比於一乡，委之乡； 士能和比一乡，则委一乡之政以任。 才行比於一县，委之县； 才行比於一音州，委之； 才行比於一国，委之国政。 而后乃能无伏士矣 各得展其才用，则无隐伏之士者矣。 人有恶戾於乡者，则以诲之； 戾，罪也。 人有罪恶者，则一乡之长先教诲之也。 不改是为恶戾，於县则挞之； 在乡不改，则送上於县而挞之也。 不改是为恶戾，於则移之； 挞之不改，则送州而流移之也。 不改是为恶戾，於国则诛之。",
      "translated_text": "In Zheng, there were the Hu jade tablet and the Rong bow. Hu was the name of a state. *Feng gui* refers to a large jade tablet, while *Rong gong* refers to a type of bow. These two objects originally belonged to the state of Hu and were later obtained by Zheng. At another time, Zheng failed to attend the *tong* assembly with Jing. *Yishi* means \"at another time.\" The feudal lords’ formal audience with the overlord was called *tong*. Jing was the former name of Chu. At that time, Chu was powerful, and the feudal lords gathered to pay court to it during the scheduled assembly. Zheng arrived late, so Jing said, “You must hand over the *feng gui* and *Rong gong*; otherwise, we will bring our troops against you.” Relying on its strength, Jing acted unjustly, using Zheng’s tardiness as a pretext to coerce and extort the two treasures.\n\nThe lord of Zheng was troubled by this. He drove his carriage to see Kang Cangzi and said, “The *feng gui* and *Rong gong* were obtained from Hu by our former lord, passed down through generations as tokens of merit and virtue to be cherished by our descendants. Now Jing, relying on its size, demands them, threatening military action if we refuse. Our state will be in peril. I wish to send other jade tablets and bows in their place—what do you think?” *Other jade tablets* refers to different jade tablets.\n\nKang Cangzi replied, “My lord, put your mind at ease for now. Even Jing possesses treasures of its own. I shall adorn Jing’s treasure to absolve you of blame—though Jing itself cannot do this. *Shi* means ‘to defer.’ To deceive a great state with counterfeit jades is to tarnish our integrity with falsehood. Though the blame may be postponed, it will ultimately lead to punishment. You must present the genuine articles.” He urged the lord of Zheng not to send substitutes.\n\n“Now Jing, over a trivial offense, wields its might and punishment, indulging in unjust aggression to plunder and weaken its allies. Jing will lose the allegiance of the feudal lords. When the lords hear of this, they will take warning, strengthen their defenses, and unite in righteous assembly, with Zheng at the forefront. My lord, wait patiently—could this not be a blessing in disguise?” *Qian* suggests insignificance; *fu* means “to rely on”; *cheng* means “to indulge”; *lunbi* means “peers” or “equals”; *gu* means “for now.”\n\nZheng’s tardiness was indeed a minor fault, but Jing, relying on its strength, sought to impose its will and punishments, coercing the surrender of the jade and bow while encroaching upon its allies. Such greed and lack of virtue would surely cost it the allegiance of the feudal lords.\n\nThus, Zheng sent the Hu jade tablet and Rong bow. Before they reached Ying (the capital of Jing), the people of Jing heard of it—likely of Kang Cangzi’s counsel. They said, “They follow the words of a sage. How can we accept these gifts, exposing our injustice to the world and giving the feudal lords cause to resent us?” They promptly returned the gifts and treated Zheng with even greater favor.\n\nHuman nature desires life and fears death, seeks security and shuns peril, craves honor and avoids disgrace. When people attain their desires, they are joyful and at peace; when they do not, they suffer and face danger. If a ruler indulges his desires, then all officials and administrators will likewise pursue theirs. *Fang* means “to indulge.” *Baili* refers to all officials; *shu guo* refers to the heads of various affairs. *Zhan* means “to extend.” If officials and administrators all pursue their desires, then the people of the realm—whether poor or wealthy—will exhaust their strength or their wealth. The four classes (scholars, farmers, artisans, and merchants) will lose their proper order, and none will attain their desires.\n\nWhen the people of the realm cannot attain their desires, they will band together, clinging to one another, fleeing and hiding, drifting like floating weeds, gathering wild fruits to sustain their lives. *Jun* means “to gather”; *cai* means “to collect.” They will forage for wild fruits to preserve their lives. If officials then pursue and capture them, they will be overwhelmed by hardship and danger, and thoughts of rebellion will arise. If such rebellious thoughts spread, the state will no longer be the ruler’s own.\n\nDo not covet population growth, for the people will flee from you. Do not fortify your cities excessively, for the people will be exhausted. If taxes are not moderate, the poor will grow poorer. If punishments are inconsistent, the powerful will grow more powerful. If laws and prohibitions are not enforced, the state will collapse. *Zhong* means “balanced.” If officials are unworthy, then leniency and severity will be misapplied. Some may even compete with the people for profit, breeding cunning and deceit, making the people treacherous and difficult to govern.\n\nWhen the people are difficult to govern, the ruler becomes suspicious. When the ruler is suspicious, the people grow more confused. When the people are confused, officials toil in vain. When officials toil in vain, rewards fail to encourage, and punishments fail to deter. The state becomes easily agitated and difficult to pacify—all because the right people are not in office.\n\nThe essence of governance lies in carefully selecting officials. *Li* means “to be diligent.” If a scholar’s talent and conduct are esteemed by his village, entrust him with village affairs. If his talent and conduct are esteemed by his county, entrust him with county affairs. If his talent and conduct are esteemed by his province, entrust him with provincial affairs. If his talent and conduct are esteemed by the state, entrust him with state affairs. Only then will there be no hidden talents left unutilized.\n\nIf someone commits a transgression in the village, admonish them. *Li* means “offense.” If they do not reform, send them to the county for punishment. If they still do not reform, send them to the province for exile. If they persist in their transgressions, execute them.",
      "overlap_context": "excess.) If the lord does not cultivate virtue and human affairs are marked by extravagance, then the calamity of great drought arises.”\n\nChu (Kang Cangzi’s given name) concluded: “Whenever floods or droughts occur, the Son of Heaven should rectify punishments and cultivate virtue, while all officials should eliminate selfishness and guard against excess. Thus, by correspondence, the calamities will dissipate, and a hundred blessings will arrive.” (All subsequent references follow this pattern.)",
      "start_char": 5152,
      "end_char": 6493,
      "start_sentence": 325,
      "end_sentence": 415,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.64500856399536,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\洞灵真经注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "而后乃能无逆节矣。 诚如是，举天下之人，一一胸怀，无有干背慆慢之萌矣，此之谓靖人。 贤材获用，暴恶迁善，则天下之人安静也。 凡为天下之务，莫大求士； 士之待求，莫善通政； 通政之善莫若靖人。 人主通达圣教，则士归之。 众贤共治，莫善於靖人也。 靖人之才，盖以文章考之，百不四五； 文章浮华，矫而不实。 今以文章考严靖人之才，百中无四五也。 以言论考之，十或一二； 有言者不必有德，有德者不必有言，故十中或有一二也。 以神气靖作态度考之，十全八九。 贤良心广体胖，神气冲和，动靖态度必合仪，则审而察之，十得八九者矣。 是皆贤王庆世明识，裁择所能尔也。 外虽有贤才，而主无明识，亦不能以裁择。 夫下王危世，以文章取士，则翦巧绮滥益至，而正雅音素实益藏矣； 末世文章尚於绮靡，则雅素之士不来矣。 以言论取士，则浮掞游饰益来，而謇谔诤直益晦矣； 浮游华饰之士#5贵，则謇谔忠诤之才伏矣。 以神气靖作态度取士，则外正内邪益尊，而清修明实益隐矣。 内无明识故任，择不得其人也。 若然者，贤愈到，政愈僻，令愈勤，人愈乱矣。 用非贤为贤，乃益所以乱。 夫天下，至大器也； 帝王，至重位也。 得士则靖，失士则乱，人主劳於求贤，逸於任使。 於呼，守天聚人者，其胡可以不事诚於士乎？ 人情失宜，主所深恤，失宜之大，莫痛刑狱。 夫明达之才，将欲听讼，或诱之以诈，或胁之以威，或开之以情，或苦之以戮，虽作设权异，而必也公平。 一物失宜，明主之所深恤，况刑狱之大乎？ 夫察狱问囚，务得其实，或有隐匿，则设威以胁之； 或导之以实情，或苦之以刑戮。 虽权变多端，而终无枉滥也。 故使天下之人，生无所於德，死无所於怨。 理自当生，故生无报德； 理自当死，故死无咎怨。 夫秉国、建吏、持刑若此，可谓至官。 至官之世，群情和正，诸产咸宜，爱敬交深，上下条固，不可摇荡，有类一家，苟有违顺陵逆，安得动哉？ 平王反正，既宅天邑，务求才良，等闻一善，喜豫连日。 平王承幽、厉之后，天下板荡，无复纪纲。 於是拨乱返正，东迁洛邑，改革前非，务求贤哲，得闻一善，累日欢悦。 宅，居也。 天邑，即洛邑也。 等，犹得也。 左右侍仆累言大臣有贤异者，如是踰岁。 侍仆，左右小臣也。 见王悦喜，承意阿谀也。 王曰：余一人于德不明，务求贤异，益恐山泽遗逸不举，岂乐闻善以自闭塞哉？ 乃者仄媚仆臣累誉权任，颇阶左右，意余孱昧，无能断明，徒唯音共和，依违浸长。 自贤败德，莫此为多，不时匡遏，就兹固党。",
      "translated_text": "And only then can there be no rebellious conduct.\n\nIf this is truly so, every person under heaven will harbor no seeds of disobedience, resentment, indolence, or arrogance in their hearts—this is called *jingren* (the settled people). When worthy talents are employed and the violent and wicked turn toward goodness, the people of the world will be at peace.\n\nOf all the affairs of the world, none is greater than seeking out scholars. Of all the ways scholars await being sought, none is better than *tongzheng* (open governance). And of all the virtues of open governance, none surpasses *jingren*. When the ruler is enlightened by sagely teachings, scholars will flock to him. When many worthies govern together, nothing is better than *jingren*.\n\nThe talents of *jingren*, however, are scarcely found among those judged by literary composition—perhaps only four or five in a hundred. For literary compositions are often florid and deceitful, lacking substance. If one were to rigorously assess the talents of *jingren* by their writings, not even four or five in a hundred would meet the mark.\n\nIf judged by their speech, perhaps one or two in ten might suffice. For those who speak well may not possess virtue, and those who possess virtue may not speak well—thus, only one or two in ten may prove true.\n\nBut if judged by their *qi* and settled demeanor, eight or nine in ten will be genuine. The worthy and good have broad minds and relaxed bodies; their *qi* is harmonious and unhurried. Their movements and bearing invariably align with propriety. By carefully observing these signs, one may identify eight or nine out of ten.\n\nAll this depends on the discernment and judgment of a sagacious king in a prosperous age. Even if worthy talents exist externally, without a ruler’s clear discernment, they cannot be properly selected.\n\nIn a declining age, if rulers select scholars by literary composition, cunning and extravagance will flourish, while refined and sincere voices will retreat. When florid writing is prized in a degenerate era, those of true simplicity will not come forward.\n\nIf scholars are chosen by their speech, glib and ostentatious men will thrive, while forthright and loyal remonstrators will fade into obscurity. When those who flaunt their eloquence are esteemed, the candid and upright will withdraw.\n\nIf scholars are selected by their *qi* and settled demeanor, those who appear upright but harbor wickedness will be exalted, while those of pure cultivation and true substance will remain hidden. This occurs when rulers lack discernment and fail to choose the right people.\n\nIn such cases, the more \"worthies\" are appointed, the more governance strays; the more decrees are issued, the more the people descend into chaos. To mistake the unworthy for the worthy is to invite greater disorder.\n\nThe world is the greatest of vessels; the throne of the emperor is the weightiest of positions. With the right scholars, there is peace; without them, there is chaos. The ruler labors in seeking the worthy but finds ease in employing them.\n\nAlas! He who guards heaven’s mandate and gathers the people—how can he not devote himself sincerely to scholars?\n\nWhen human affairs go awry, nothing concerns the ruler more deeply than the miscarriage of justice. Of all such failures, none is more grievous than errors in punishment.\n\nA ruler of enlightened talent, when adjudicating disputes, may employ deception to coax the truth, or intimidation to compel it, or empathy to draw it out, or punishment to force it. Though his methods may vary, he must always ensure fairness. Even a single misjudgment weighs heavily on a wise ruler—how much more so the grave matter of criminal trials?\n\nIn examining cases and interrogating prisoners, the utmost effort must be made to uncover the truth. If a prisoner conceals the facts, the ruler may employ threats to compel them; or guide them with reason; or, if necessary, resort to punishment. Though his tactics may be manifold, he must never allow injustice or excess.\n\nThus, the people of the world will have no cause for gratitude in life or resentment in death. If a man’s life is rightfully spared, he owes no debt of gratitude; if his death is rightfully decreed, he bears no grievance.\n\nA ruler who governs the state, appoints officials, and administers justice in this manner may be called *zhiguan* (the perfect office). In an age of perfect governance, the people’s hearts are harmonious and upright; all livelihoods are fitting; love and respect run deep; superiors and inferiors are firmly aligned, unshakable as a single family. How could any disobedience or rebellion arise?\n\nWhen King Ping restored order and settled in the capital, he devoted himself to seeking worthy talents. Upon hearing even a single good report, his joy would last for days.\n\nKing Ping succeeded the chaotic reigns of Kings You and Li, when the world was in turmoil and all discipline had collapsed. He then quelled the disorder, moved the capital east to Luoyi, corrected past wrongs, and diligently sought wise men. Upon hearing even one commendable deed, his delight would endure for days.\n\n*Resided* refers to dwelling; *heavenly capital* refers to Luoyi. *Attained* means *obtained*.\n\nHis attendants repeatedly praised certain great ministers as exceptionally worthy, and this continued for over a year. These attendants were minor officials at his side, who, seeing the king’s pleasure, flattered him to curry favor.\n\nThe king said: \"I, alone, am not enlightened in virtue. I strive to seek out the worthy, yet I fear that those hidden in mountains and marshes may go unrecognized. How could I take pleasure in hearing good reports only to shut myself off from them?\n\nFormerly, my fawning and obsequious servants repeatedly extolled those in power, gradually gaining influence at my side. My own weakness and dullness left me unable to discern clearly, so I merely echoed their harmonious words, allowing their influence to grow unchecked.\n\nNo greater harm to virtue comes from the failure to correct such errors in time, allowing cliques to form and solidify.\"",
      "overlap_context": "lent and conduct are esteemed by his province, entrust him with provincial affairs. If his talent and conduct are esteemed by the state, entrust him with state affairs. Only then will there be no hidden talents left unutilized.\n\nIf someone commits a transgression in the village, admonish them. *Li* means “offense.” If they do not reform, send them to the county for punishment. If they still do not reform, send them to the province for exile. If they persist in their transgressions, execute them.",
      "start_char": 6493,
      "end_char": 7547,
      "start_sentence": 416,
      "end_sentence": 467,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.491868257522583,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\洞灵真经注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "仄媚，邪媚也。 权任，大臣也。 阶，升也。 孱，弱也。 依违，相依也。 邪媚小臣称扬权任，阶缘左右，共相蒙蔽，谓我暗弱，不能明察。 若不遏绝，党固滋深也。 於是弃左右近习三人市， 谓杀之而曝尸於市也。 古者刑人於市，与众共弃之。 贬庶司尹夫五人， 庶司尹，谓权任大臣也。 曰：无令臣君者附下罔上，持禄阿意。 天下闻之，称为齐明，海南之西归者七国。 至理之世，舆服纯素，宪令宽简，禁网疏阔。 夫舆服纯素，则人不胜羡； 不相企羡。 宪令宽简，则俗无忌讳； 禁网疏阔，则易避难犯。 若人不胜羡，则嗜欲希微，而服役乐业矣； 服，从也。 从於所役之业也。 俗无忌讳，则抑闭开舒，而欢欣交通矣； 凡所抑闭，皆由忌讳； 今既无忌讳，皆得开舒也。 易避难犯，则好恶分明，而贵德知耻矣。 贵德则不犯，知耻则易避。 夫服役乐业之谓顺，欢欣交通之谓和，贵德知耻之谓正。 浮堕之人，不胜於顺； 逆节之人，不胜於和； 奸邪之人，不胜於正。 顺、和、正三者，理国之宗也。 衰末之世，舆服文巧，宪令禳祈， 禳祈，烦多者也。 禁网颇僻。 夫舆服文巧，则流相炎慕； 俗尚文巧，则下人随流，递相企慕。 如火之上炎也。 宪令欀祈，则俗多忌讳； 禁网颇僻，则莫知所逭。 追，犹逃也。 若流相炎慕，则人不忠洁，而耻朴贵华矣； 俗多忌讳，则情志不通，而上下胶戾矣； 莫知所逭，则谗祸繁兴，而众不惧死矣。 夫耻朴贵华之谓浮，上下胶戾之谓，众不惧死之谓冒。 真正之士，不官於浮； 公直之士，不官於； 器能之士，不官於冒。 浮、、冒三者，乱国之梯也。 刑君熊圉问水旱理乱， 熊，荆之姓，圉名。 亢仓子曰：水旱由天，理乱由人。 若人事和理，虽有水旱，无能为害，尧汤是也。 尧时九年洪水，汤时七年大旱。 故周之秩官云：人强胜天。 《秩官》、《周书》篇也。 若人事坏乱，纵无水旱，日益崩离，且桀纣之灭岂惟水旱？ 一云岂因水旱。 桀纣之君，暴雪奢淫以灭亡，非独水旱也。 荆君北面遵循稽首曰：天不弃不谷，及此言也。 一本云遵修。 遵循，退行也。 荆君敬重亢仓子，故称之曰天。 不弃不 谷，王公之卑称也。 亢仓子不弃於我，故得及闻此言者也。 乃以弘璧十朋为亢仓子寿，拜为亚尹。 弘璧，大璧也。 十朋，十双也。 亚尹，小尹也。 曰；",
      "translated_text": "\"Oblique flattery\" refers to perverse flattery. \"Those in power\" are the great ministers. \"To ascend\" means to rise. \"Weak\" means feeble. \"Dependence\" means mutual reliance. Perverse and flattering minor officials extolled those in power, climbing by clinging to the king’s attendants, jointly concealing the truth, claiming that I was dim-witted and weak, unable to discern clearly. If not suppressed in time, factionalism would deepen and solidify.\n\nThereupon, he cast out three of his closest attendants to the marketplace—meaning he executed them and exposed their corpses in public. In ancient times, criminals were punished in the marketplace, where all could witness their rejection. He demoted five of the chief ministers of the various offices—these were the powerful great ministers—saying: \"Let no minister who serves his lord attach himself to inferiors to deceive his superiors, nor cling to his salary while flattering to curry favor.\"\n\nWhen the realm heard of this, they called him enlightened and discerning. Seven states west of the Southern Sea submitted in allegiance.\n\nIn an age of perfect governance, carriages and robes were plain and unadorned, laws and decrees were lenient and simple, and prohibitions were sparse and broad. When carriages and robes were plain, people did not covet excess; without mutual envy, desires waned. When laws and decrees were lenient and simple, customs knew no taboos; when prohibitions were sparse and broad, transgressions were easy to avoid yet hard to commit. If people did not covet excess, their cravings diminished, and they willingly followed their labors with joy. If customs knew no taboos, repression dissolved, and hearts opened in glad exchange. If transgressions were easy to avoid yet hard to commit, good and evil became distinct, and people valued virtue and knew shame. To value virtue is to refrain from wrongdoing; to know shame is to avoid it easily.\n\nTo willingly follow one’s labors with joy is called *obedience*; to open in glad exchange is called *harmony*; to value virtue and know shame is called *rectitude*. The indolent cannot overcome *obedience*; the rebellious cannot overcome *harmony*; the wicked cannot overcome *rectitude*. *Obedience*, *harmony*, and *rectitude*—these three are the foundation of governing a state.\n\nIn an age of decline, carriages and robes were ornate and cunning, laws and decrees were superstitious and excessive—*superstitious excess* meaning overabundance—and prohibitions were biased and perverse. When carriages and robes were ornate and cunning, people followed the current in mutual envy, as flames rise in emulation. When laws and decrees were superstitious and excessive, customs brimmed with taboos; when prohibitions were biased and perverse, none knew where to flee. If people followed the current in mutual envy, they became disloyal and impure, scorning simplicity and prizing ostentation. If customs brimmed with taboos, emotions and intentions were stifled, and superiors and inferiors clashed in discord. If none knew where to flee, slander and calamity multiplied, and the people feared not death.\n\nTo scorn simplicity and prize ostentation is called *frivolity*; for superiors and inferiors to clash in discord is called *strife*; for the people to fear not death is called *recklessness*. The truly upright cannot serve in *frivolity*; the just and impartial cannot serve in *strife*; the capable and talented cannot serve in *recklessness*. *Frivolity*, *strife*, and *recklessness*—these three are the ladders to a state’s ruin.\n\nKing Xiong Yu of Jing inquired about floods, droughts, order, and chaos. *Xiong* was the surname of Jing, and *Yu* his given name. Master Kang Cang replied: \"Floods and droughts come from Heaven; order and chaos arise from man. If human affairs are harmonious and well-governed, even floods and droughts cannot bring harm—such were the cases of Yao and Tang. In Yao’s time, there were nine years of floods; in Tang’s time, seven years of drought. Thus, the *Zhi Guan* of Zhou states: 'Man’s strength overcomes Heaven.' *Zhi Guan* is a chapter of the *Book of Zhou*. If human affairs are corrupt and chaotic, even without floods or droughts, the state will daily crumble and collapse—how were Jie and Zhou destroyed by floods and droughts alone? One version reads: 'How were they destroyed *because of* floods and droughts?' The rulers Jie and Zhou perished through cruelty, extravagance, and debauchery—not merely from floods and droughts.\"\n\nThe lord of Jing faced north, followed in reverence, and bowed deeply, saying: \"Heaven has not abandoned this unworthy one, allowing me to hear these words.\" One version reads: \"followed and cultivated.\" *Followed in reverence* means to retreat in deference. The lord of Jing held Master Kang Cang in such esteem that he called him \"Heaven.\" *This unworthy one* is a humble term used by kings and dukes. That Master Kang Cang did not abandon me is why I have been able to hear these words.\n\nThereupon, he presented ten pairs of great jade discs as a gift to Master Kang Cang and appointed him as Vice Minister. *Great jade discs* refers to large jades. *Ten pairs* means ten sets. *Vice Minister* is a lesser ministerial rank. He said:",
      "overlap_context": "may go unrecognized. How could I take pleasure in hearing good reports only to shut myself off from them?\n\nFormerly, my fawning and obsequious servants repeatedly extolled those in power, gradually gaining influence at my side. My own weakness and dullness left me unable to discern clearly, so I merely echoed their harmonious words, allowing their influence to grow unchecked.\n\nNo greater harm to virtue comes from the failure to correct such errors in time, allowing cliques to form and solidify.\"",
      "start_char": 7548,
      "end_char": 8514,
      "start_sentence": 468,
      "end_sentence": 538,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.35741090774536,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\洞灵真经注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "庶吾国有瘳乎？ 亢仓子不得已中宿微服，违之他邦。 瘳，差也。 违，去也。 至理之世，山无伪隐，市无邪利，朝无佞禄。 国产问：何由得人俗醇朴？ 国产，郑大夫公孙乔，字子产也。 亢仓子曰； 政烦苛，则人奸伪； 法令滋彰，盗贼多矣。 政省一，则人醇朴。 其政闷闷，其人醇醇。 夫人俗随国政之方圆，犹蠖屈之於叶也，食苍则身苍，食黄则身黄。 曰：何为则人富？ 亢仓子曰：赋敛以时，官上清约，则人富。 赋敛无节，官上奢纵，则人贫。 句粤之簳镞以精金，惊隼为之羽，以之掊棰，则其与槁朴也无择。 勾粤，东粤也。 簳，箭朴也。 惊隼，雕鹗之类也。 掊棰，打击也。 《尔雅》云：东南之美者，有会稽之竹箭焉。 夫勾粤之簳，以精金为簇，以隼翎为羽，用之打击，则同於槁朴。 无择，犹无异。 及夫荡寇争音冲，觌武决胜，加之骇弩之上，则三百步之外不立敌矣。 排荡寇敌，争冲决胜，加此勾粤之簳於强弩之上，则前无立敌矣。 蜚景之剑威夺白日，气盛紫蜺，以之刲获，则其与刃也无择。 蜚景，神剑也，嫌也。 神剑虽利，以获稻则同於鎌刃也。 及夫凶邪流毒沸渭不靖，加之运掌之上，则千里之内不留行矣。 凶邪流毒，谓温疫之气也。 此神剑能辟凶邪？ 故威光所行，则千里之内未尝留止也。 夫材有分，而用有当，所贵善因时而已耳。 槁朴、刃施於常用耳，粤簳、蜚景以御凶灾。 材分所当，各因时而贵也。 昔者明皇圣帝，天下和平，万物畅茂，群性得极，善因时而勿扰者也。 近古是来，天下奸邪者众，正直者寡； 轻薄趁利者多，敦方退静者鲜。 奸者出言於忠言，巧伪乱真，不能辨也。 遂使天下之人交相疑害。 悲夫，作法贵於易避而难犯，救弊贵於省事而一令。 除去豪横则官人安，刑禁必行则官人不敢务私利，官人不敢务私利，而百姓富。 史刑曰：眚灾肆赦，赦不欲数，赦数则恶者得计，平人生心，恶者得计，务益於奸； 平人生心，亦为不善也。 而贤良否塞矣。 人有大为贼害，官吏捕获，因广条引，诬陷页良，阔远牵率，冀推时序，卒蒙赦宥。 遇贼害者，讫无所快，自毒而已。 由是平人递生黠计，吏劳政酷，莫能镇止，此由数赦之过也。 夫人之所以恶为无道不义#6者，为其有罚也； 所以勉为有道行义者，为其有赏也。 今无道不义者赦之，而有道行义者被妎音害而不赏，欲人之就善也，不亦难乎？ 世有贤主秀士肯察此论： 讫，犹终也。 快，喜也。 毒，苦也。 肯，可也。 人怨若，非不接人也； 神怒者，非不事神也； 巧佞甚，人愈怨； 淫祀盛，神益怒。 洞灵真经卷上竟 #1 『天佑神助，近』宋刊本作『在天佑之福，故俗』。 #2 在：宋刊本作『存』。 #3 弒：原作『煞』。 据宋刊本改。 #4 沴：宋刊本作『大』。 #5 士：宋刊本作『事』。 #6 义：宋刊本作『善』。 洞灵真经卷中 何粲注",
      "translated_text": "\"Might my state yet recover?\" Master Kang Cang, unable to bear this, departed in the dead of night in plain clothes for another land. *Recover* means to improve. *Departed* means to leave.\n\nIn an age of perfect governance, mountains harbor no false recluses, markets yield no illicit profits, and courts grant no sycophantic stipends.\n\nGuo Chan asked: \"How might one restore the people’s customs to purity and simplicity?\" *Guo Chan* was the courtesy name of Gongsun Qiao, a grandee of Zheng.\n\nMaster Kang Cang replied: \"When governance is oppressive and laws proliferate, the people grow cunning and deceitful. The more laws and decrees are promulgated, the more thieves and bandits arise. When governance is streamlined and unified, the people return to purity and simplicity. *When its governance is carefree, its people are unsullied.* The customs of the people follow the shape of state policy as the inchworm conforms to the leaf—feeding on green, its body turns green; feeding on yellow, its body turns yellow.\"\n\nHe asked: \"What must be done to enrich the people?\"\n\nMaster Kang Cang replied: \"When taxes are levied in due season and officials are pure and frugal, the people grow rich. When taxes are unchecked and officials are extravagant and indulgent, the people grow poor.\"\n\nThe arrows of Gou Yue are tipped with refined gold, fletched with the feathers of startled falcons. Yet when used for beating, they differ not from withered wood. *Gou Yue* refers to Eastern Yue. *Arrows* here means arrow shafts. *Startled falcons* are akin to eagles and ospreys. *Beating* means striking. The *Erya* states: \"Among the finest things of the southeast are the bamboo arrows of Kuaiji.\" Though the arrows of Gou Yue are tipped with refined gold and fletched with falcon feathers, when used for striking, they are no different from withered wood.\n\nYet when deployed in repelling bandits and contending for victory, when fitted to a mighty crossbow, they leave no foe standing beyond three hundred paces. *Repelling bandits and contending for victory* means to engage in decisive combat. When such arrows are mounted on a powerful crossbow, none can withstand them.\n\nThe sword Fei Jing dazzles the white sun with its radiance, its qi surging like purple rainbows. Yet when used for reaping, it differs not from a sickle blade. *Fei Jing* is a divine sword. *Sickle blade* here means a reaping tool. Though the divine sword is keen, when used to harvest rice, it is no different from a sickle.\n\nYet when malevolent qi and seething toxins roil unchecked, when wielded in the palm, its might courses unobstructed for a thousand li. *Malevolent qi and seething toxins* refer to pestilential vapors. This divine sword dispels such malevolence, so that wherever its awe-inspiring light reaches, none within a thousand li may tarry.\n\nEach material has its proper place, and each use its fitting application. What matters is to employ them aptly according to the times. Withered wood and sickle blades suffice for common tasks, while the arrows of Yue and the sword Fei Jing are for warding off calamities. Each material has its proper use, valued according to the needs of the time.\n\nIn ancient times, the Radiant August Thearch governed the realm in peace, all things flourished, and all beings attained their full potential—this was because he followed the times without disturbance.\n\nIn recent ages, the realm has grown rife with deceit and treachery, while the upright are few. The frivolous and profit-seeking abound, while the steadfast and retiring are rare. The wicked outshout the loyal, their cunning and falsehood sowing confusion, leaving none able to discern the truth. Thus the people of the realm come to harm one another.\n\nAlas! In crafting laws, what is prized is that they be easy to avoid yet hard to violate. In remedying abuses, what is prized is that measures be simple and decrees unified. Eliminate the overbearing, and officials will be at ease. Enforce punishments and prohibitions without fail, and officials will not dare pursue private gain. When officials do not pursue private gain, the people grow rich.\n\nThe *Records of Punishment* state: \"Calamities and disasters call for amnesties, but amnesties should not be frequent. Frequent amnesties embolden the wicked, while the common people grow restive. When the wicked are emboldened, they redouble their villainy; when the common people grow restive, they too turn to wrongdoing. Thus the worthy and good are stifled.\"\n\nWhen one commits great harm, and the officials apprehend them, they may cast a wide net, falsely implicating the innocent, dragging in distant connections, hoping to stretch out the proceedings until an amnesty is declared. The victims of such harm find no satisfaction, only self-inflicted torment. As a result, the common people devise ever more cunning schemes, officials toil under harsh governance, and none can quell the chaos—all due to the excess of amnesties.\n\nPeople refrain from wickedness and injustice because of punishment, and are encouraged toward virtue and right conduct because of rewards. Now, if the wicked and unjust are pardoned, while the virtuous and upright are harmed and go unrewarded, is it not difficult to expect people to embrace goodness?\n\nIf there were a worthy ruler or discerning scholar who would heed this discourse:\n\n*Finally* means to reach an end. *Satisfaction* means joy. *Torment* means suffering. *Heed* means to accept.\n\nThe resentment of the people does not stem from failing to engage with them; the wrath of the spirits does not stem from failing to serve them. The more cunning and flattery abound, the more the people resent; the more excessive the sacrifices, the more the spirits rage.\n\n*Dongling Zhenjing*, Scroll One, concludes.\n\nVariant readings:\n1. \"Heaven’s protection and divine aid, near\" — Song edition reads: \"In Heaven’s protective blessings, thus the customs.\"\n2. \"In\" — Song edition reads: \"Preserve.\"\n3. \"Regicide\" — original reads \"slaughter\"; emended according to Song edition.\n4. \"Pestilence\" — Song edition reads \"great.\"\n5. \"Scholar\" — Song edition reads \"affair.\"\n6. \"Righteousness\" — Song edition reads \"goodness.\"\n\n*Dongling Zhenjing*, Scroll Two, with commentary by He Can.",
      "overlap_context": "o retreat in deference. The lord of Jing held Master Kang Cang in such esteem that he called him \"Heaven.\" *This unworthy one* is a humble term used by kings and dukes. That Master Kang Cang did not abandon me is why I have been able to hear these words.\n\nThereupon, he presented ten pairs of great jade discs as a gift to Master Kang Cang and appointed him as Vice Minister. *Great jade discs* refers to large jades. *Ten pairs* means ten sets. *Vice Minister* is a lesser ministerial rank. He said:",
      "start_char": 8514,
      "end_char": 9683,
      "start_sentence": 539,
      "end_sentence": 609,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.64214825630188,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\洞灵真经注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "君道篇第四 清静无为，以身帅下。 始生之者天也，养成之者人也#1。 万物之始生者，由乎天也； 助天而养之，由乎人也。 能养天之所生而物撄之谓天子。 撄，扰也。 人能助天养物而物驯，扰之者是谓天子也。 昔舜有圣德，三徙成都是也。 天子之动也，以全天气，故此官之所以自立也。 立官者，以全生也。 天不自治，故圣人代天以治物者也。 圣人不能独治，故立官以辅之。 立官之由，本以养物，贵全天气，不使有亏伤。 今世之惑主，多官而反以害生，则失所以为立官之本矣。 后世惑主，务在多官，官多则政烦，政烦则害物，是失立官之本意也。 草郁则为腐，树郁则为蠹，人郁则为病，国郁则百慝并起，危乱不禁。 郁者，气未通#2之谓也。 官多政烦，事有拥滞，如草木之成腐蠹也。 所谓国郁者，主德不下宣，人欲不上达也。 奸臣蒙蔽，故主德不下宣； 黎庶枉届，故人欲不上达。 是故圣王贵忠臣、正士，为其敢直言，而决郁塞也。 克己复礼，贤良自至； 克，损也。 复，反也。 人君能以谦损反礼，则贤良归。 君耕后蚕，苍生自化。 天子亲耕，皇后亲蚕，以身率人，则天下化之也。 由是言之，贤良正，可待不可求，求得非贤也； 君有礼让，贤臣自归，故可待也。 君无礼让，虽复求贤，贤至，乃非贤也。 苍生正，可化不可刑，刑行非理也。 君耕后蚕，人自效之，故可化也。 身不自为而使人为之，人必不从。 虽",
      "translated_text": "**Scroll on the Way of the Ruler, Chapter Four**\n\nTo govern with clarity and non-action, leading by personal example.\n\nThat which gives life is Heaven; that which nurtures and completes it is man. All things owe their beginning to Heaven; to assist Heaven in nurturing them is the role of man. One who can nurture what Heaven has brought forth without disturbing the things of the world is called the Son of Heaven. *Disturb* means to agitate. When man aids Heaven in nurturing things and they become docile, he who governs them is called the Son of Heaven.\n\nIn ancient times, Shun possessed sagely virtue, and wherever he moved, a capital flourished. The movements of the Son of Heaven serve to preserve the *qi* of Heaven—this is the principle by which offices are established. Offices are established to preserve life. Heaven does not govern directly, so the sage acts on Heaven’s behalf to order all things. The sage cannot govern alone, so he establishes offices to assist him. The purpose of establishing offices is fundamentally to nurture all things, valuing the preservation of Heaven’s *qi* and preventing harm or depletion.\n\nYet the deluded rulers of this age multiply offices only to harm life, losing sight of the original purpose of their establishment. Later generations of misguided rulers focus on increasing offices, but more offices lead to more policies, and more policies harm the people—this betrays the original intent of establishing offices.\n\nWhen grasses are stifled, they rot; when trees are stifled, they become infested; when men are stifled, they fall ill; when a state is stifled, a hundred evils arise, and chaos becomes uncontrollable. *Stifled* means the *qi* is obstructed. When offices multiply and policies proliferate, affairs become congested, like grasses and trees succumbing to rot and infestation.\n\nThe so-called stifling of the state occurs when the ruler’s virtue fails to spread downward and the people’s desires fail to reach upward. Wicked ministers block the way, so the ruler’s virtue does not descend; the common folk are oppressed, so their desires do not ascend. Therefore, sagely kings value loyal ministers and upright scholars, for they dare to speak frankly and dispel obstructions.\n\nBy restraining oneself and returning to ritual, the worthy and good will come of their own accord. *Restrain* means to diminish; *return* means to revert. If the ruler can humble himself and return to ritual, the worthy and good will gather to him. When the ruler plows and the empress tends silkworms, the common people will naturally be transformed. When the Son of Heaven personally plows and the Empress personally tends silkworms, leading by example, the world follows their model.\n\nThus, the worthy and upright may be awaited but not sought—those obtained by seeking are not truly worthy. When the ruler embodies ritual and deference, worthy ministers will come of their own accord, so they may be awaited. If the ruler lacks ritual and deference, even if he seeks the worthy, those who come will not be truly worthy.\n\nThe common people may be transformed but not punished—punishment that is applied is not in accord with principle. When the ruler plows and the empress tends silkworms, the people will emulate them, so they may be transformed. If one does not act oneself but compels others to act, they will not obey.\n\nThough...",
      "overlap_context": "g Zhenjing*, Scroll One, concludes.\n\nVariant readings:\n1. \"Heaven’s protection and divine aid, near\" — Song edition reads: \"In Heaven’s protective blessings, thus the customs.\"\n2. \"In\" — Song edition reads: \"Preserve.\"\n3. \"Regicide\" — original reads \"slaughter\"; emended according to Song edition.\n4. \"Pestilence\" — Song edition reads \"great.\"\n5. \"Scholar\" — Song edition reads \"affair.\"\n6. \"Righteousness\" — Song edition reads \"goodness.\"\n\n*Dongling Zhenjing*, Scroll Two, with commentary by He Can.",
      "start_char": 9683,
      "end_char": 10286,
      "start_sentence": 610,
      "end_sentence": 645,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.371555089950562,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\洞灵真经注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "复刑之，刑行非至理。 尧舜有为人主之勤，无为人主之欲，天下各得济其欲； 勤，谓劳心以养物； 欲，谓私身以奉己也。 有为人主之位，无为人主之心，故天下' 各得肆其心。 位，谓居位而治事； 心，谓求安以自适。 肆者，申也。 士有天下爱之，而主不爱者； 有主独爱之，而天下人不爱者。 竭公忠而养天下者，则天下爱之； 狥私情而媚一人者，则其主爱之。 用天下人爱者，则天下安； 用主独爱者，则天下危。 人主安可以自放其爱憎哉？ 由是重天下爱者，当制其情。 圣人以天下为安危者也。 欲天下之安，则人主不得纵其爱憎，当抑制其私也。 所谓天下者，谓其有万物也； 所谓邦国者，谓其有人众也。 夫国以人为本，人安则国安，故忧国之主，务求理人之材。 天下以万物为多，邦国以人众为富，忧国家者不可不任贤以辅己也。 玉之所以难辨者，谓其有硁石也； 金之所以难辨者，谓其有鍮石也。 硁石似玉，鍮石似金，犹奸人外正内邪，亦难辨也。 今夫以隼翼而被之鴳，视而不明者，正以为隼； 明者，视之乃鴳也。 隼，鹰也。 鴳，雀也。 今夫小人多诵经籍方书，或学奇技通说，而被以青紫章服，使愚者听而视之，正为君子也； 明者听而视之，乃小人也。 奇技，异艺也。 通说，杂说也。 故人主诚明，以言取人理也，以才取人理也，以行取人理也； 人主不明，以言取人乱也，以才取人乱也，以行取人乱也。 人主明者，以言行取人，尽皆理也； 主昏昧，虽以言行取人，尽皆乱也。 夫圣主之用人也，贵耳不闻之功，目不见之功，口不可道之功，而百姓畅然自理矣。 夫贤良之治世也，不显其名，不彰其用，不称其能，潜功密济，理自玄畅，名迹不生，人无企尚，故圣主贵之也。 若人主贵耳闻之功，则天下之人运货逐利而市誉矣； 若人主贵闻臣下之功，则奸人运其财货随逐便利以市声誉也。 贵目见之功，则天下之人恢形异艺而争进矣； 恢诞形容，奇异技艺，夸企争进，愈乱天下矣。 贵可道之功，则天下之人习舌调吻而饰辞矣。 利口便辩，虚而不实。 使天下之人市誉争进，饰辞见达者，政败矣。 争名尚能，则正理之道衰矣。 人主皆知镜之明己也，而恶士之明己也，镜之明己也功细，士之明己也功大，知其细，失其大，不知类也。 镜知形之好丑，士知心之善恶。 正形之功细，正心之功大。 今人主乃贵其细而失其大，岂不惑哉？ 於呼，人主清心省事，人臣恭俭守职，太平立致矣。 而世或难之，吾所不知也。 若人主方寸之坠不明不断，则天地之宜，四海之内，动植万类，咸失其道矣。 方寸之地，谓心之所居也。 动，谓含气之类。 植，谓草木之类也。 以耳目取人者，官多而政乱； 取闻见之功，则饰伪者众，争进者多，主不能辨，故官多而政乱也。 以心虑取人者，官少而政清。 用心愿神识而得人者，其官甚寡，其政甚治也。 是知循理之世，务求不可见，不可闻之材； 浇危之世，务取可闻可见之材。 呜呼，人主岂知哉？ 以耳目取人，人皆敚以买誉； 以心虑取人，人皆静正以勤德。 吏#3静正以勤德，则不言而目化； 吏敚以买誉，则刑之而不音畏，世主岂知哉？ 臣道篇第五 尽忠竭力谋效所司。 夫国之将兴也，朝廷百吏或短、或长、或丑、或美、或怡、或厉、或是、或非。",
      "translated_text": "even if punishment is repeatedly applied, such punishment does not accord with the highest principle.\n\nYao and Shun labored as rulers for the people, yet harbored no desires as rulers for themselves—thus the world each attained fulfillment of its desires. \"Labor\" refers to toiling with the mind to nurture all things; \"desire\" refers to serving the self to gratify one’s own wishes. They held the position of ruler but not the mind of one—thus the world each could freely follow its heart. \"Position\" means occupying office to govern affairs; \"mind\" means seeking ease for one’s own comfort. \"Freely\" means to extend.\n\nThere are those loved by the whole world yet not loved by their lord, and those loved solely by their lord yet not loved by the world. Those who exhaust their public loyalty to nourish the world are loved by the world; those who indulge private favor to curry favor with one person are loved by their lord. When one employs those loved by the world, the world is at peace; when one employs those loved only by their lord, the world is in peril. How can a ruler afford to indulge his own loves and hates? Therefore, one who values the world’s love must restrain his emotions. The sage takes the world’s peace or peril as his own concern. If he desires the world’s peace, the ruler must not indulge his loves and hates but must suppress his private inclinations.\n\nWhat is called \"the world\" refers to its possession of the myriad things; what is called \"the state\" refers to its possession of the multitude of people. The state takes the people as its foundation—when the people are at peace, the state is at peace. Thus, a ruler who worries for the state must seek those capable of governing the people. The world is rich in the myriad things, the state is rich in its multitude of people—one who worries for the state and nation cannot but employ the worthy to assist him.\n\nThe reason jade is difficult to discern is that there exists *keng*-stone; the reason gold is difficult to discern is that there exists *tou*-stone. *Keng*-stone resembles jade, *tou*-stone resembles gold—just as the treacherous appear upright externally yet are inwardly perverse, they too are difficult to discern.\n\nNow, if one covers a sparrow with the wings of a falcon, those with dim vision will mistake it for a falcon; only the clear-sighted will see that it is a sparrow. The falcon is the hawk; the sparrow is the finch. Now, petty men often recite the classics and medical texts, or study arcane arts and eclectic doctrines, and are clad in blue and purple robes of office. The foolish, hearing and seeing them, take them for true gentlemen; only the discerning, hearing and seeing them, recognize them as petty men. \"Arcane arts\" refers to unusual skills; \"eclectic doctrines\" refers to miscellaneous teachings.\n\nThus, when a ruler is truly enlightened, he selects men by their words, by their talents, and by their conduct—all in accord with principle. When a ruler is benighted, he selects men by their words, by their talents, and by their conduct—all leading to disorder. The enlightened ruler, in selecting men by their words and conduct, ensures all is in accord with principle; the dull ruler, though selecting men by their words and conduct, ensures all is in disorder.\n\nWhen the sage ruler employs men, he values achievements unseen by the ear, unseen by the eye, and inexpressible in words—yet the people flourish and govern themselves. When the worthy govern the world, they do not display their names, nor make manifest their use, nor proclaim their abilities. Their merit works in secret, their governance flows smoothly and mysteriously, no trace of fame arises, and none vie for eminence—thus the sage ruler esteems them.\n\nIf a ruler values achievements heard by the ear, the people of the world will traffic in goods to chase profit and peddle reputation. If a ruler values the achievements he hears of from his ministers, the treacherous will deploy their wealth and resources, chasing every advantage to market their reputations. If a ruler values achievements seen by the eye, the people of the world will exaggerate their forms and flaunt their arts to compete for advancement—boasting and vying for notice, they will only bring greater disorder to the world. If a ruler values achievements that can be spoken of, the people of the world will cultivate glib tongues and adorn their words. With eloquent speech and facile arguments, empty yet insubstantial, they will vie for reputation and advancement, embellishing their words to gain access—thus the government will fail. When competition for fame and esteem for ability prevail, the way of proper principle declines.\n\nA ruler knows that a mirror clarifies his appearance yet resents the gentleman who clarifies his faults. The mirror’s service is small, the gentleman’s service is great—knowing the small yet losing the great, he fails to grasp the likeness. The mirror reveals the beauty or ugliness of form; the gentleman reveals the goodness or evil of the heart. Correcting form is a small service; correcting the heart is a great one. Yet now the ruler esteems the small and loses the great—how can he not be deluded?\n\nAlas! If the ruler purifies his heart and reduces his affairs, and his ministers are reverent, frugal, and steadfast in their duties, great peace will swiftly arrive. Yet the world sometimes finds this difficult—how can I fathom why?\n\nIf the ruler’s heart, the seat of his judgment, is unclear and indecisive, then the harmony of heaven and earth, all within the four seas, the moving and the rooted, the myriad kinds—all will lose their proper way. \"The seat of judgment\" refers to where the heart resides. \"Moving\" refers to those endowed with *qi*; \"rooted\" refers to the grasses and trees.\n\nWhen a ruler selects men by what he hears and sees, offices multiply and governance falls into disorder—for those who embellish falsehoods abound, and those who vie for advancement are many. The ruler cannot discern them, thus offices multiply and governance falls into disorder. When a ruler selects men by careful reflection, offices are few and governance is clear—for those employed with sincere intent and keen perception are few, and their governance is well-ordered.\n\nThus, in an age that follows principle, one must seek talents unseen and unheard; in an age of peril and decline, one must select talents seen and heard. Alas! Does the ruler truly understand?\n\nWhen a ruler selects men by what he hears and sees, people all flatter and deceive to buy reputation; when a ruler selects men by careful reflection, people all remain composed and upright, diligent in virtue. When officials are composed, upright, and diligent in virtue, transformation occurs without words; when officials flatter and deceive to buy reputation, punishment fails to inspire awe—does the ruler of this age truly understand?\n\n**Chapter Five: The Way of the Minister**\nDevote oneself wholly, exert all strength, and strive to fulfill one’s duties.\n\nWhen a state is about to rise, among the hundred officials of the court, some are short, some tall, some plain, some comely, some gentle, some stern, some right, some wrong...",
      "overlap_context": "nce, worthy ministers will come of their own accord, so they may be awaited. If the ruler lacks ritual and deference, even if he seeks the worthy, those who come will not be truly worthy.\n\nThe common people may be transformed but not punished—punishment that is applied is not in accord with principle. When the ruler plows and the empress tends silkworms, the people will emulate them, so they may be transformed. If one does not act oneself but compels others to act, they will not obey.\n\nThough...",
      "start_char": 10286,
      "end_char": 11635,
      "start_sentence": 646,
      "end_sentence": 716,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.6157488822937,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\洞灵真经注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "丑，恶也。 怡，悦也。 厉，严厉也。 虽听其言，观其貌，有似不同，然察其志，征其心，尽於为国。 所以刚讦不怨，黜退不愕，议得其中，无违乎理。 故天不惑其时，坠不乏其利，人不乱其，鬼神开赞，蛮夷柔同，保合大和，万物化育。 国之兴也，朝廷禄位务尽其忠，各竭其能，力行公正，无有阿私。 故天时不忒，地利不乏，人事不乱，鬼神佑助，远方柔服也。 国之将亡也，朝廷百吏姿貌多美，颜色谐和，词气华柔，动止详润。 亡国之臣，外虽、和顺，内怀猜#4忌，各徇其私，暗相谋害。 虽观其貌，听其言，有若欢洽，然察其志，征其心，尽在竞位。 所以闻奇则怪，见异必愕，相嫉相蒙，遂丧其道。 故天告灾时，坠生反物， 天反时为灾，地反物为祆。 人作凶德，鬼神闲祸， 闲，犹伺也。 戎狄交侵，丧乱弘多，万物不化。 夫不伤货财，不妎人力，不损官吏，而功成政立，下阜百姓，上滋主德，如此者忠贤之臣也。 若费财烦人，危官苟效，一时功利规赏於主，不顾过后贻灾於国，如此者奸臣也。 至理之世，官得人。 不理之世，人得官。 邾龙顅问事君，亢仓子曰：既策名而臣人者，心莫若公，无阿私也。 貌莫若和，言莫若正。 公不欲灵，和不欲杂，正不欲犯。 君不见察，亦不欲犯颜而谏也。 古之清勤为国修政，今之清勤为身修名。 夫为国修政者，区处条别，动得其宜，合於大体。 为身修名者，区处条别，致远不通，拘於小节。 是知心以道为主，抵事得其所； 心以事为主，抵物失其所。 以道为主，公心也； 以事为主，私情也。 抵者，触也。 臣居上位不谏，下位不公，不合赡其禄。 赡，赒给也。 君不严敬，大臣不彰信小，臣不合官其朝。 有才者不必忠，忠者不必有才。 臣不患不忠，适恐尽忠而主莫之信； 主不患不信，适恐信之而莫能事事。 事事，犹用事也。 上等之人，得其性则天下理； 中等之人，得其性则天下乱。 明主用上等之人，当委以权宜，便肆其所为； 上等之人，谓贤良也公平正直，无所阿私，使之莅职，信能匡赞。 虽权变有时，必归於正也。 用中等之人，则当程课其功，示以赏罚。 中等之人，谓艺能之士。 见善则迁见恶则染，故人主以赏罚制之也。 贤道篇第六 克己复礼贤良自至。 贤良所以屡求而不至，难进而易退者，非为爱身而不死王事，适恐尽忠而主莫之信耳。 自知有材识之人，外恭谨而内无忧。 其於众也，龢正而不狎。 亲之则弥庄； 疏之则退去而不怨； 穷厄则以命自宽； 荣达则以道自正。 人有视其仪贤也，听其声贤也，征神课识，或负所望。 夫贤人其见用也，入则讽誉，出则龚默，职司勤办，居室俭闲。 讽，谓刺君之过。 誉，谓称君之美。 龚默，静慎也。 办，治也，闲，谓防闲。 其未见用也，藏身於众，藏识於目，藏言於口，饱食安步，独善其身，贞而不怨。 智者不疑，识者不疑人。 有识之士，行危而色不可疏，言逊而理不可拔。 谓遇浊世不变其志，行虽危而色常和，言虽逊而理确然。 凡谓贤人不自称贤， 自伐者无功，故非贤。 效在官政，功在事事。 验其官政，察其用事，贤不肖可辩也。 太平之时，上士运其识，中士竭其耐，小人输其力。 齐有掊子者，材可以振国，行可以独立，振，济也。",
      "translated_text": "Ugly means repulsive. Gentle means pleasing. Stern means severe. Though their words may be heard and their appearances observed—seeming at first unlike—yet when their aspirations are examined and their hearts tested, all are devoted to serving the state. Thus, they neither resent forthright admonition nor startle at demotion; their counsel strikes the mean and never deviates from principle. Therefore, Heaven does not confuse its seasons, Earth does not withhold its bounty, men do not disrupt their proper roles, spirits and gods lend their aid, and distant barbarians submit in harmony. All things transform and flourish, and the Great Harmony is preserved.\n\nWhen a state is rising, the court’s ranks and offices are filled by those who exhaust their loyalty, each giving their utmost ability, acting with impartial justice, and harboring no favoritism. Thus, Heaven’s seasons do not err, Earth’s resources do not fail, human affairs do not fall into disorder, spirits and gods grant their protection, and distant lands submit in compliance.\n\nWhen a state is nearing ruin, the court’s hundred officials present fine appearances, their complexions harmonious, their words and tones refined and soft, their movements graceful and polished. Though the ministers of a doomed state appear outwardly compliant and agreeable, inwardly they harbor suspicion and envy, each pursuing private ends and secretly plotting harm. Though their appearances may be observed and their words heard—seeming at first cordial—yet when their aspirations are examined and their hearts tested, all are consumed by rivalry for position. Thus, they marvel at the unusual, startle at the unexpected, and in their mutual jealousy and deception, they lose the Way. Therefore, Heaven sends forth disasters in untimely seasons, Earth produces monstrous things—Heaven’s untimely seasons become calamities, Earth’s monstrous things become portents. Men commit wicked deeds, spirits and gods lie in wait to bring misfortune, border tribes invade in succession, and chaos and ruin abound. All things fail to transform.\n\nThose who do not waste resources, do not exhaust the people’s strength, and do not harm officials, yet achieve success and establish good governance, enriching the people below and enhancing the ruler’s virtue above—such are the loyal and worthy ministers. Those who squander wealth, harass the people, endanger officials for fleeting results, seeking only immediate rewards from the ruler while ignoring the disasters they leave for the state—such are the treacherous ministers.\n\nIn a well-governed age, offices are filled by the right men. In a disordered age, men seize offices for themselves.\n\nWhen Zhu Longti asked about serving a ruler, Kang Cangzi replied: “Once you inscribe your name as a subject, let your heart be nothing if not impartial, harboring no favoritism. Let your appearance be nothing if not harmonious, your words nothing if not upright. Impartiality should not seek to be clever, harmony should not be adulterated, and uprightness should not offend. Even if the ruler does not perceive it, one should not offend his countenance by remonstrating.”\n\nThe ancients practiced diligence and frugality to govern the state; today, men practice diligence and frugality to cultivate their reputations. Those who govern the state arrange matters with clarity, act appropriately, and align with the greater good. Those who cultivate their reputations arrange matters with clarity but fail to reach distant goals, constrained by petty concerns.\n\nThus, when the heart takes the Dao as its master, it touches matters and finds their proper place; when the heart takes matters as its master, it touches things and loses their proper place. Taking the Dao as master is impartiality; taking matters as master is self-interest. *Di* means to touch.\n\nMinisters in high positions who do not admonish, and those in low positions who are not impartial, do not deserve their emoluments. *Shan* means to provide. If the ruler is not solemn and respectful, if high ministers do not display trustworthiness to their subordinates, then ministers do not rightfully hold office in the court.\n\nThe talented are not necessarily loyal, and the loyal are not necessarily talented. Ministers need not fear disloyalty; they need only fear that, though loyal, the ruler may not trust them. The ruler need not fear distrust; he need only fear that, though trusting, he may not employ them effectively. *Shishi* means to put into practice.\n\nThe highest type of person, when their nature is realized, brings order to the world. The middling type, when their nature is realized, brings chaos to the world. A wise ruler employs the highest type, entrusting them with discretionary power and allowing them to act freely. The highest type—meaning the worthy and good, who are impartial and upright, harboring no favoritism—when placed in office, can be trusted to assist and correct. Though they may exercise flexibility at times, they always return to the upright.\n\nWhen employing the middling type, one must set standards for their achievements and make clear the rewards and punishments. The middling type—meaning those with skills and abilities—improve when they see good and are corrupted when they see evil. Thus, the ruler controls them with rewards and punishments.\n\n**Chapter Six: The Way of the Worthy**\nMaster oneself and return to ritual, and the worthy will come of their own accord.\n\nThe worthy are often sought but rarely arrive, difficult to advance yet easy to retreat—not because they cherish their lives and refuse to die for the ruler’s cause, but because they fear that, though loyal, the ruler may not trust them.\n\nThose who know themselves to be capable and discerning are outwardly respectful yet inwardly free of worry. Among the multitude, they are harmonious and upright without being overly familiar. Draw near to them, and they become all the more dignified; distance yourself, and they withdraw without resentment. In adversity, they console themselves with fate; in prosperity, they rectify themselves with the Dao.\n\nSome appear worthy in their bearing, others in their voice, but when their spirit is tested and their knowledge examined, they may fall short of expectations. When the worthy are employed, they enter court to gently admonish and praise, and withdraw to observe silence. They diligently attend to their duties, living simply and prudently. *Feng* means to subtly criticize the ruler’s faults; *yu* means to praise the ruler’s virtues. *Gongmo* means quiet and cautious. *Ban* means to manage; *xian* means to guard.\n\nWhen not employed, they conceal themselves among the crowd, hide their knowledge from sight, and restrain their words. They eat their fill, walk at ease, cultivate their own integrity, and remain steadfast without resentment.\n\nThe wise do not doubt their roles, and the discerning do not doubt others. The perceptive, though their conduct may be perilous, maintain an unalterable demeanor; though their words may be modest, their principles remain unshakable. This means that in a corrupt age, they do not change their aspirations: though their conduct may be perilous, their countenance remains composed; though their words may be modest, their principles stand firm.\n\nThe worthy do not proclaim their own worth. Those who boast of themselves achieve no merit; thus, they are not worthy. Their effectiveness is seen in governance, their merit in action. Examine their governance, observe their actions, and the worthy and the unworthy can be distinguished.\n\nIn times of Great Peace, the highest scholars apply their knowledge, the middling scholars exhaust their endurance, and the petty men contribute their strength.\n\nIn Qi there was a man named Pouzi, whose talents could have saved the state, whose conduct could have stood alone. *Zhen* means to rescue.",
      "overlap_context": " upright, and diligent in virtue, transformation occurs without words; when officials flatter and deceive to buy reputation, punishment fails to inspire awe—does the ruler of this age truly understand?\n\n**Chapter Five: The Way of the Minister**\nDevote oneself wholly, exert all strength, and strive to fulfill one’s duties.\n\nWhen a state is about to rise, among the hundred officials of the court, some are short, some tall, some plain, some comely, some gentle, some stern, some right, some wrong...",
      "start_char": 11636,
      "end_char": 12944,
      "start_sentence": 717,
      "end_sentence": 789,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.00543165206909,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\洞灵真经注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "独立，谓德行孤标不可倾拔。 事父母孝谨，乡党恭循，念居贫无以为养，施信义而游者久之矣。 所如寡合，或为乘时夸毗者所蚩绐， 如，往也。 本作所蚩往。 绐，音待。 一云始於是也。 寡合少谐，偶也。 夸毗，矜恃也。 蚩，笑也。 绐，欺也。 於是负杖步足，问乎亢仓子曰； 吾闻至人忘情， 至人虚怀，与道合体，故忘情也。 黎人不事情， 黎，众也。 智力愚昧，不能用情也。 存情之曹务其教训而尊信义。 曹，辈也。 中人存情，以信义为尊。 吾乃今不知为工， 工，犹能也。 躬行信义，所往寡合，不知其所为能。 受不信为信， 世有受人之不信，将以为信也。 信而不见信为信， 有实为信，而不为人所见信，乃自以为信。 为勤慕义为义， 人有本非义，而以慕义为义，乃为人所称义也。 义而不俟义为义。 有实为义，而不待人称义，亦常自为义也。 然则信义之士，常独厄随退，胡以取贵乎时，而教理之所上也？ 亢仓子俯而循衽，神而嘻，超然而歌， 衽，衣襟也。 嘻，叹声也。 超然，高举之貌。 曰：时之阳兮信义音昌， 时之阳喻君有道也。 有道则信义昌也。 时之默兮信义伏， 时之默喻君暗昧也。 君暗昧则信义伏藏。 阳与默，昌与伏，汨吾无谁私兮？ 羌忽不知其读。 汨，乱也。 羌，发声也。 读，犹云也。 夫时有治乱，故用有行藏。 阳则与时俱昌，默则与时俱伏，随流任运，宁有私耶？ 今乃问我，不知其云也。 夫运正性以如适，而物莫之应者，真不行也。 夫真且不行，谓之道丧。 信义者，正性之用也。 真者，正性之本也。 道丧之时，上士乃隐，隐之为义。 有可音为也， 时有可为#5，莫可#6者也，时有否泰，莫得长为。 有可用也#7，有时而用。 莫#8可用者也。 用有行藏，莫得长用。 祭公问：贤材何从而致？ 亢仓子曰：贤正可待不可求，材慎在求不慎无。 材在求而择之不慎，无材。 若天子静，大臣明，刑不避贵，泽不隔下，则贤人自至而求用矣。 贤人用，则四海之内，明目而视，清耳而听，坦心而无郁矣。 天自成，地自宁，万物醇化，鬼神不能灵。 天下醇和，故鬼神不能见灵怪。 故曰贤正可待不可求。 若天子勤明、大臣和理之求士也，则恢弘方大、公直靖人之才至； 若天子苛察、大臣躁急之求士也，则心巧应、毁方破道之才至； 若天子疑忌、大臣巧随之求士也，则奇姓异名、仄媚怪术之才至； 若天子自贤、大臣固位之求士也，则事文逐誉、贪浊浮丽之才至； 若天子依违、大臣回佞之求士也，则外忠内僻、情毒言和之才至。 故曰才慎在求不慎无。 昔者黄帝得常仙、封鸿音鬼、容丘音丘， 三人，黄帝臣也。 商王得伊尹，中兴得甫申， 中兴，周宣王也。 甫，仲山甫也。 申，申伯。 齐桓得蜜宁籍， 即宁戚也。 皆由数君体道迈仁，布昭圣武，思辑光明，宽厚昌正，而众贤自至而求用，非为简核而得之也。 迈，行也。 辑，睦也。 简核，犹择也。 祭公曰：夫子云贤人不求而自至，亦有非贤不求而自至者乎？ 亢仓子曰：夫非贤不求而自至者固众矣。 夫天下有道，则贤人不求而自至； 天下无道，则非贤不求而自至。 人主有道者寡， 无道者众； 天下贤人少，不肖者多。 是知非贤不求而自至者多矣。 祭公曰：贤固济天下，材亦能济天下，俱济天下，贤与材安异耶？",
      "translated_text": "\"To stand alone\" means that one's virtue and conduct are so lofty and unshakable that none can topple them. In serving his parents, he is filial and reverent; among his village and kin, he is respectful and dutiful. Yet dwelling in poverty with nothing to provide for them, he has long wandered afar, upholding trust and righteousness. Wherever he goes, few find accord with him—sometimes mocked and deceived by those who flatter the times and fawn for advantage.\n\n*Ru* means \"to go.\" Originally written as *suo chi wang*. *Dai* is pronounced *dai*. Another version reads: \"beginning from this.\" *Gua he shao xie* means \"few harmonize, rare are those who coincide.\" *Kua pi* means \"arrogant and obsequious.\" *Chi* means \"to laugh.\" *Dai* means \"to deceive.\"\n\nThereupon, leaning on his staff and dragging his feet, he went to inquire of Kang Cangzi: \"I have heard that the perfected person forgets emotion—his empty mind merges with the Dao in unity, thus he forgets emotion. The common people do not employ emotion—being dull-witted and ignorant, they cannot apply it. Those who preserve emotion devote themselves to teaching and revere trust and righteousness. *Cao* means 'company.' The middling sort preserve emotion, holding trust and righteousness in highest esteem. Yet now I do not know what I am capable of. *Gong* means 'ability.' Though I personally practice trust and righteousness, wherever I go few find accord with me; I do not know what ability I possess.\n\nSome accept what is untrustworthy as trust; some take trust that is not recognized as trust—though they are truly trustworthy, others do not see it, yet they still regard themselves as trustworthy. Some exert themselves in admiring righteousness and call it righteousness—though their actions are not righteous, they are praised as righteous by others. Some act righteously yet do not wait for others to call it righteous—they always regard themselves as righteous.\n\nThus, those who uphold trust and righteousness often meet with hardship and retreat. How can they gain esteem in their time, and how can teaching and principle rise above? Kang Cangzi stroked his lapel, composed his spirit, and sighed. Then, rising aloft, he sang:\n\nWhen the times are bright, trust and righteousness flourish;\nWhen the times are dark, trust and righteousness lie hidden.\nBrightness and darkness, flourishing and concealment—\nWhy should I alone be troubled, swept along without preference?\n\n*Gǔ* means \"confused.\" *Qiang* is an exclamatory sound. *Du* means \"to speak.\" The times know order and chaos, thus one's conduct knows action and concealment. When times are bright, one flourishes with them; when times are dark, one hides with them—following the current, moving with fate, how can there be partiality? Now you ask me, yet I do not know what you mean.\n\nTo move with one's true nature as if strolling freely—yet none respond—is to be truly unrecognized. When the true is unrecognized, it is called the loss of the Dao. Trust and righteousness are the function of true nature; the true is the root of true nature. When the Dao is lost, the highest scholars withdraw—withdrawal is righteous. There are times when action is possible, and times when it is not; there are times of prosperity and decline, none lasting forever. There are times when ability is employed, and times when it is not—employment knows action and concealment, none lasting forever.\n\nThe Duke of Zhai asked: \"From where does one obtain worthy talent?\"\nKang Cangzi replied: \"The worthy and upright can be awaited but not sought; talent lies in seeking, but one must be cautious—without caution, there is no talent. If talent is sought but not chosen with care, there will be no talent. If the Son of Heaven is serene and his great ministers enlightened, if punishment does not spare the noble and favor does not bypass the lowly, then worthy men will come of their own accord seeking employment. When worthy men are employed, within the Four Seas all will see with clear eyes, hear with keen ears, and hold open hearts free of gloom. Heaven will perfect itself, Earth will settle itself, the myriad things will transform in purity, and even ghosts and spirits will be powerless to work wonders. When all under Heaven is pure and harmonious, ghosts and spirits cannot display strange marvels. Thus it is said: the worthy and upright can be awaited but not sought.\n\nIf the Son of Heaven is diligent and discerning, and his great ministers seek scholars with harmony and reason, then magnanimous, broad-minded, publicly upright, and steadfast talents will arrive. If the Son of Heaven is harsh and suspicious, and his great ministers seek scholars with impatience and haste, then cunning, artful, destructive, and way-breaking talents will arrive. If the Son of Heaven is doubtful and jealous, and his great ministers seek scholars with clever compliance, then talents of strange surnames and unusual names, with sidelong flattery and bizarre arts, will arrive. If the Son of Heaven esteems himself, and his great ministers cling to their positions while seeking scholars, then talents who chase reputation with embellishments, greedy and impure, will arrive. If the Son of Heaven is indecisive, and his great ministers seek scholars with devious flattery, then talents who appear loyal but are inwardly perverse, with venomous natures and gentle words, will arrive. Thus it is said: talent lies in seeking, but one must be cautious—without caution, there is no talent.\n\nIn ancient times, the Yellow Emperor obtained Chang Xian, Feng Hong, and Rong Qiu—three ministers. The Shang king obtained Yi Yin; the Restoration king obtained Fu Shen—Fu being Zhongshan Fu, and Shen being Shen Bo. Duke Huan of Qi obtained Mi Ning Ji—this is Ning Qi. All these rulers embodied the Dao and surpassed in benevolence, widely displaying sagely martial virtue, seeking to gather brilliance, and governing with magnanimity, generosity, and uprightness. Thus, the multitude of worthies came of their own accord seeking employment—not obtained through meticulous selection. *Mai* means 'to practice.' *Ji* means 'harmony.' *Jian he* means 'to choose.'\n\nThe Duke of Zhai said: \"Master, you say that worthy men do not seek but come of their own accord—are there also those who are not worthy yet come of their own accord without being sought?\"\nKang Cangzi replied: \"Those who are not worthy yet come of their own accord without being sought are indeed many. When the world has the Dao, worthy men do not seek but come of their own accord; when the world lacks the Dao, those who are not worthy do not seek but come of their own accord. Rulers with the Dao are few; those without it are many. Worthy men in the world are few; the unworthy are many. Thus, those who are not worthy yet come of their own accord without being sought are many.\"\n\nThe Duke of Zhai said: \"The worthy surely save the world, and talent can also save the world—if both save the world, how do the worthy and the talented differ?\"",
      "overlap_context": "t; thus, they are not worthy. Their effectiveness is seen in governance, their merit in action. Examine their governance, observe their actions, and the worthy and the unworthy can be distinguished.\n\nIn times of Great Peace, the highest scholars apply their knowledge, the middling scholars exhaust their endurance, and the petty men contribute their strength.\n\nIn Qi there was a man named Pouzi, whose talents could have saved the state, whose conduct could have stood alone. *Zhen* means to rescue.",
      "start_char": 12944,
      "end_char": 14309,
      "start_sentence": 790,
      "end_sentence": 884,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.1259765625,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\洞灵真经注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "亢仓子曰：窘乎哉，其问也。 窘，迫也。 言所问切迫。 夫功成事毕，不徇封誉，恭退朴俭之谓贤。 徇，求也。 功成不居其位，守恭谦以自牧也。 功成事毕，荣在禄誉，光扬满志之谓材。 贤可以镇国，材可以理国。 所谓镇者，龢宁无为，人不知其力。 至德潜化，人莫能知之也。 所谓理者，勤率其事，人知所於德。 人赖其功，故推德於己也。 一贤统众材则有余，众材度一贤犹不足，如是贤材之殊域。 一贤虽少，统领众材，尚有余德； 众材虽多，比度一贤，犹不能及。 有居山林而谊者，有在人俗而静者，有。 喧而正者，有静而邪者也。 言求贤不可不察其邪正矣。 凡视察其貌鄙俗，而能有贤者，万不有一； 视察其貌端雅，而实小人者，十而有九。 言贤人难得也。 夫不炼其言而知其文，不责其仪而审其度，不采其誉而知其善，不流其毁而断其宝，可谓有识者也。 不待流言毁谤而知其恶情也。 洞灵真经卷中竟 #1 始生之者天也，养成之者人也：宋刊本作『始生之者天地养成之者也』。 天也：宋刊本作『天地』。 #2 气未通：宋刊本作『气拥不通』。 #3 吏：原作『文』，据宋刊本改。 #4 猜：原作『情』，据宋刊本改。 #5 时有可为：原本无，据宋刊本增。 #6 莫可者也：原本无，据宋刊本增。 #7 有可用也：此句前有『莫可为者』此句后有『邦有道则智，邦无道则愚』，据宋刊本删。 #8 莫：字前原本有『故』字，据宋刊本删。 洞灵真经卷下 何粲注",
      "translated_text": "Kang Cangzi replied: \"How pressing is this question! Pressing—it is urgent. The inquiry is indeed pressing. Now, when merits are accomplished and affairs are completed, yet one does not seek titles or fame, but retreats with reverence, simplicity, and frugality—this is what we call *worthy*. To seek is to pursue. Having achieved merit, one does not occupy the position but nurtures oneself with reverent humility. When merits are accomplished and affairs are completed, yet glory lies in emoluments and reputation, and one’s aspirations are fully displayed—this is what we call *talent*. The worthy can *pacify* a state; talent can *govern* a state. What is meant by *pacifying*? It is harmony, tranquility, and non-action—people do not perceive its power. Supreme virtue transforms in hidden ways, and none can comprehend it. What is meant by *governing*? It is diligent execution of affairs, and people recognize the virtue therein. They rely on its merit, thus attributing virtue to oneself.\n\nOne worthy leading many talents is more than sufficient; many talents measuring themselves against one worthy still fall short—such is the vast difference between the worthy and talent. Though one worthy is few, leading many talents, their virtue still abounds; though many talents are numerous, compared to one worthy, they still cannot match. There are those who dwell in mountains and forests yet act with righteousness; there are those amidst worldly customs yet remain serene. There are those who are boisterous yet upright; there are those who are quiet yet perverse. This shows that in seeking the worthy, one must not fail to discern the upright from the perverse.\n\nGenerally, when observing one whose appearance is coarse and vulgar yet proves worthy, not one in ten thousand exists; when observing one whose appearance is refined and elegant yet is in truth a petty man, nine in ten are so. Thus, the worthy are hard to come by. One who, without refining their words, understands their pattern; without demanding their demeanor, examines their measure; without heeding their praise, knows their goodness; without being swayed by slander, judges their worth—such a one may be called discerning. Without waiting for rumors or defamation, they perceive the true nature of evil.\n\n*The Writ of the Cavernous Numinous* concludes, Volume the Middle.\n\n---\n*Variant notes from Song Dynasty block-print edition:*\n1. \"That which gives birth is Heaven; that which nurtures and completes is man\" originally read: \"That which gives birth is Heaven and Earth; that which nurtures and completes is [man].\"\n2. \"Heaven\" originally read: \"Heaven and Earth.\"\n3. \"Qi not yet flowing\" originally read: \"qi obstructed and not flowing.\"\n4. \"Official\" originally written as \"text,\" emended per Song edition.\n5. \"Suspicion\" originally written as \"sentiment,\" emended per Song edition.\n6. \"There are times when action is possible\" originally omitted, added per Song edition.\n7. \"None can be employed\" originally omitted, added per Song edition.\n8. \"There are those who can be used\" originally preceded by \"none can act\" and followed by \"When the state has the Dao, the wise are wise; when the state lacks the Dao, the wise are foolish,\" deleted per Song edition.\n9. \"None\" originally preceded by \"thus,\" deleted per Song edition.\n\n*The Writ of the Cavernous Numinous*, Volume the Lower, with commentary by He Can.",
      "overlap_context": "ot seek but come of their own accord; when the world lacks the Dao, those who are not worthy do not seek but come of their own accord. Rulers with the Dao are few; those without it are many. Worthy men in the world are few; the unworthy are many. Thus, those who are not worthy yet come of their own accord without being sought are many.\"\n\nThe Duke of Zhai said: \"The worthy surely save the world, and talent can also save the world—if both save the world, how do the worthy and the talented differ?\"",
      "start_char": 14309,
      "end_char": 14954,
      "start_sentence": 885,
      "end_sentence": 919,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.35847568511963,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\洞灵真经注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "训道篇第七 至德之用，万教之主，神明共赞，可以化民。 闵子骞问仲尼：道之与孝相去奚若？ 疑其相去远也。 仲尼曰：道者，自然之妙用。 孝者，人道之至德。 穷於本始谓之道，施於人理谓之孝。 道能通生万物，不知其所由然，故曰妙用。 孝者，善事父母，尽敬尽顺，通乎神明，故曰至德。 夫其包运天地，发育万物，曲成类形，布丕性寿。 性者刚柔之质，寿者一期之尽。 其功至实，而不为物府，不为事官，无为功尸，扪求视听，莫得而有，字之曰道， 虽曲成万类，雕刻众形，寻求生宰，莫见其眹，故字之曰道。 道者，虚通之谓。 用之於人，字之曰孝。 孝者，善事父母之名也，夫善事父母，敬顺为本，意以承之，顺承颜色，无所不至。 发一言，举一意，不敢忘父母； 营一手，措一足，不敢忘父母。 事君不敢不忠，朋友不敢不信，临下不敢不敬，向善不敢不勤，虽居独室之中，亦不敢懈其诚，此之谓全孝。 故孝诚之至，通乎神明，光于四海，有感必应，善事父母之所致也。 昔者虞舜其大孝矣乎，庶母惑父屡憎害之，舜心益恭，惧而无怨。 谋使浚井，下土实之，于时天休，震动神明，骏赫道穴而出，奉养滋谨，由是玄德茂盛，为天下君，善事父母之所致也。 按《史记》称：舜父瞽叟与庶母弟皆欲杀舜。 使舜修廪，瞽叟从下纵火焚廪。 舜乃以两笠自抒而下。 去，得不死。 后又使舜穿井，舜穿井为匿孔旁出。 舜既入深，瞽叟与象共下土填井，舜匿孔出，去。 是其事也。 于时天以休美之德，震动舜心，神明#1赫然，令其免害。 及出之后，事父弥馑。 尧知其圣，历试诸难，后乃禅其位焉。 文王之为太子也，其大孝矣，朝夕必至乎寝门#2之外，问寺人曰； 兹日安否？ 何如？",
      "translated_text": "**Chapter Seven: The Instruction of the Dao**\n\nThe application of utmost virtue is the master of all teachings, praised by numinous spirits, and can transform the people.\n\nMin Ziqian asked Confucius: \"How far apart are the Dao and filial piety?\"\n\nHe suspected they were distant from one another.\n\nConfucius said: \"The Dao is the wondrous function of spontaneity. Filial piety is the utmost virtue of human relations. That which exhausts the root and origin is called the Dao; that which is applied to human principles is called filial piety. The Dao can penetrate the generation of the myriad things, yet none know whence it arises—hence it is called wondrous function. Filial piety is the good service of one’s parents, exhausting reverence and compliance, penetrating to the numinous—hence it is called utmost virtue.\n\nIt embraces and revolves Heaven and Earth, engenders and nurtures the myriad things, subtly completes their forms, and bestows their natures and lifespans. *Nature* refers to the substance of hardness and softness; *lifespan* refers to the exhaustion of a single term. Its achievement is most substantial, yet it does not serve as a storehouse for things, nor as an office for affairs. It does not claim merit as its own, and though one may seek it through touch, sight, or hearing, none can possess it—thus it is named the Dao. Though it subtly completes the myriad kinds and carves the multitude of forms, when one seeks the master of life, no trace of it is seen—hence it is named the Dao. The Dao is called *emptiness and penetration*. When applied to humanity, it is named *filial piety*.\n\nFilial piety is the name for the good service of one’s parents. In serving one’s parents well, reverence and compliance are fundamental. One’s intent must accord with them, complying with their countenance in all things. In uttering a single word or raising a single thought, one does not dare forget one’s parents. In moving a hand or placing a foot, one does not dare forget one’s parents. In serving one’s lord, one does not dare be disloyal; in dealing with friends, one does not dare be untrustworthy; in facing subordinates, one does not dare be disrespectful; in pursuing goodness, one does not dare be idle. Even when dwelling alone in a chamber, one does not dare relax one’s sincerity—this is called *complete filial piety*. Thus, the utmost of filial sincerity penetrates to the numinous, shines throughout the Four Seas, and invariably responds to what is felt—this is the result of the good service of one’s parents.\n\nOf old, Shun was greatly filial. His stepmother deceived his father, who repeatedly sought to harm him, yet Shun’s heart grew only more reverent, fearful but without resentment. When they schemed to have him dredge a well and then filled it with earth from below, Heaven bestowed its favor, and the numinous spirits shook with power, allowing him to emerge from a hidden tunnel. He served his parents with ever-greater care, and by this, his dark virtue flourished, and he became lord of the world—this was the result of the good service of his parents. According to the *Records of the Historian*: Shun’s father, Gusou, and his half-brother both wished to kill him. They sent Shun to repair a granary, then Gusou set fire to it from below. Shun used two conical hats to shield himself as he descended and escaped, surviving. Later, they sent Shun to dig a well, and he secretly excavated a side tunnel. After he had entered deeply, Gusou and Xiang filled the well with earth, but Shun emerged through the hidden tunnel and escaped. Such were the events. At that time, Heaven, bestowing its fine virtue, stirred Shun’s heart, and the numinous spirits blazed forth, allowing him to avoid harm. After his escape, he served his father with even greater diligence. Yao, recognizing his sageliness, tested him through many trials, and afterward abdicated his throne to him.\n\nKing Wen, when he was crown prince, was greatly filial. Morning and evening, he would invariably arrive outside the door of his father’s chamber and ask the attendants: \"Is he at peace today? How is he?\"",
      "overlap_context": "tion is possible\" originally omitted, added per Song edition.\n7. \"None can be employed\" originally omitted, added per Song edition.\n8. \"There are those who can be used\" originally preceded by \"none can act\" and followed by \"When the state has the Dao, the wise are wise; when the state lacks the Dao, the wise are foolish,\" deleted per Song edition.\n9. \"None\" originally preceded by \"thus,\" deleted per Song edition.\n\n*The Writ of the Cavernous Numinous*, Volume the Lower, with commentary by He Can.",
      "start_char": 14954,
      "end_char": 15646,
      "start_sentence": 920,
      "end_sentence": 954,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.684197425842285,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\洞灵真经注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "寺人，奄#3官。 主在左右侍君也。 曰：安，太子温然喜色。 小不安节，太子色忧满容。 朝夕食上， 谓侍者进食於君也。 太子必视寒暖之节，食下必知膳#4养所进，然后退。 知所食之多少。 寺人言疾，太子肃冠而斋， 君有疾，故太子严肃衣冠而斋斋者，虚心专志以祈神明，使救护者耳。 膳宰之馔，必敬视之，汤衣之贡衣必亲赏之， 馔，饮食也。 贡，进之也。 尝馔#5善， 谓君尝候者也。 则太子亦能食，尝馔寡，太子亦不能饱，以至乎复初，然后亦复初。 君病间，而太子亦复初也。 君后有过，怡声以讽。 怡，悦也。 谓下气怡声，几微讽谏。 君后所爱虽小，物必严龚。 不敢慢君父之所爱。 是故孝成於身，道洽天下。 《雅》曰：文王陟降，在帝左右， 《雅》，《诗□大雅》也。 陟，升也。 帝，天也。 左右，助也。 言文王所为，天必助之。 言文王静作进退，天必赞之，故纣不能害。 赞，佐也。 文王事纣，为天所佐。 故殷纣虽暴，不能辄害。 梦启之寿， 《礼记》云：文王有疾，旬有二日乃间。 文王谓武王曰：汝何梦矣？ 武王对曰：梦帝与我九龄。 文王曰：汝以为何也？ 武王曰：西方有九国，君王其终抚诸？ 文王曰：非也。 我百尔九十，吾与汝三焉。 文王九十七而终，武王九十三而终也。 卜世三十，卜年七百，天所命也，善事父母之所致也。 《左传》曰：成王定鼎于郏鄏，卜世三十，卜年七百，天所命也。 闵子骞曰：善事父母之道幸既闻之矣，敢问教子之义？ 仲尼曰：凡· 三王教子必视礼乐。 视，犹示也。 乐所以修内， 和其心也。 礼所以修外， 检其容也。 礼，乐交修，则德容发辉于貌，故能温恭而文明。 夫 人臣者，杀其身有益於君则为之，况利其身以善其君乎？ 是故择建忠良贞正之士为之师傅，欲其知父子、君臣、长幼之道。 夫知为人子，然后可以为人父； 知为人臣，然后可以为人君； 知事人，然后能使人。 此三王教子之义也。 三王，谓夏、殷、周三代之王也。 闵子骞退而事之於家，三年人无间於父母兄弟之言， 上事父母，下顺兄弟，尽善尽美。 故人无非间之言也。 交游称其信，乡党称其仁，宗族称其悌，德行之声溢於天下，此善事父母之所致也。 齐太子坐清台之上，燕壮侯他， 壮，燕侯谥也，他，名也。 高冠严色，左带玉具剑，右带环佩，左光照右，右光照左。 言玉佩之光交相#6照也。 太子读书不视，壮侯他问曰：齐国有宝乎？ 太子曰：主信臣忠，百姓戴上，齐国之宝也。 壮侯他应声解剑而去。 闻义而服也。 此言君子尚德，不尚华饰也。 呜呼，人有偏蔽，终身莫自知已乎？ 贤者见之宽恕而不言，小人暴爱而溢言，亲戚怜嫉而贰言。 人有偏蔽，恶乎不自知哉？ 恶乎，犹何也。 是故君子检身常若有过。 衣其衣，食其食，知其过而不克音克有以正之者，君子耻之。 言为人臣#7，不能有所匡正也。 将欲有言，识其必不能行者，君子罕言。 君不纳忠练，则罕言以避患也。 当责众人之恶者，视己善乎哉？ 当责众人之邪者，视己正乎哉？ 此之谓反明。 先审身之善正，然后责人之邪恶也。 翟西氏之子甚孝谨，翟西怜其子而好妄与之言。 翟西出，夕返，则曰：甲死矣。 其子信之，既而甲在焉。",
      "translated_text": "The *temple attendant* was a eunuch official, one who served at the ruler’s side. When he said, \"At peace,\" the crown prince’s face would soften with joy. If there was the slightest sign of discomfort, the crown prince’s expression would fill with worry. Morning and evening, when food was presented—meaning the attendants brought meals to the lord—the crown prince would always observe whether the temperature was appropriate. Only after confirming what nourishment had been served would he withdraw, knowing the quantity consumed.\n\nWhen the temple attendant reported illness, the crown prince would don solemn robes and fast, for when the lord was ill, the crown prince dressed with utmost gravity and purified his heart, concentrating his will to pray to the spirits for protection. He would respectfully inspect the food prepared by the royal chef and personally examine the garments offered as tribute. If the lord tasted the food and found it good, the crown prince would also eat his fill; if the lord found it lacking, the crown prince would not eat to satisfaction, and only when the lord recovered would he return to his usual state.\n\nIf the lord later erred, the crown prince would speak in a gentle voice to admonish him subtly. Whatever the lord cherished, no matter how small, the crown prince treated it with solemn reverence, never daring to slight what his father and ruler loved. Thus, filial piety perfected his person, and the Dao harmonized all under Heaven.\n\nThe *Ya* states: \"King Wen ascended and descended, ever at the Lord’s side.\" The *Ya* refers to the *Greater Ya* section of the *Book of Songs*. *Ascended* means to rise; *Lord* refers to Heaven; *at the side* means to assist. It speaks of King Wen’s conduct, which Heaven always aided. It says that in King Wen’s stillness and action, advance and retreat, Heaven invariably supported him, so that Zhou could not harm him. *Supported* means to assist. King Wen served Zhou, and Heaven assisted him, so even though King Zhou of Yin was tyrannical, he could not readily harm Wen.\n\nThe dream of \"nine lifespans\" is recorded in the *Record of Rites*: When King Wen fell ill, it took twelve days for him to recover. He asked King Wu, \"What did you dream?\" King Wu replied, \"I dreamed the Lord granted me nine lifespans.\" King Wen said, \"What do you think it means?\" King Wu said, \"There are nine states in the west—will you ultimately pacify them?\" King Wen said, \"No. I am ninety of your ninety, and I share three with you.\" King Wen died at ninety-seven, and King Wu at ninety-three.\n\nThirty generations were divined, seven hundred years were foretold—this was Heaven’s mandate, the result of serving one’s parents with goodness. The *Zuozhuan* states: \"When King Cheng established the tripods at Jiaru, it was divined that there would be thirty generations and seven hundred years—this was Heaven’s mandate.\" Min Ziqian asked, \"I have been fortunate to hear the way of serving parents well. May I ask about the principle of teaching one’s children?\" Confucius said, \"In all cases, the Three Kings taught their children by demonstrating ritual and music. *Demonstrating* means to show. Music cultivates the inner self, harmonizing the heart; ritual cultivates the outer self, refining one’s bearing. When ritual and music are practiced together, virtue and demeanor shine forth in one’s appearance, enabling one to be warmly respectful and civilized.\n\nNow, if a minister would sacrifice his life for the ruler’s benefit, how much more should he benefit himself to serve his ruler well? Therefore, they selected loyal, upright, and steadfast gentlemen as tutors, so that they might understand the Dao of father and son, ruler and minister, elder and younger. Only after knowing how to be a son can one be a father; only after knowing how to be a minister can one be a ruler; only after knowing how to serve others can one employ them. This is the principle by which the Three Kings taught their children.\" The Three Kings refer to the kings of the Xia, Yin, and Zhou dynasties.\n\nMin Ziqian withdrew and practiced this at home. For three years, no one could find fault with his words toward his parents or brothers. He served his parents above and deferred to his brothers below, achieving utmost goodness and beauty. Thus, no one spoke ill of him. Among his acquaintances, he was praised for his trustworthiness; in his village, for his benevolence; in his clan, for his fraternal duty. The reputation of his virtuous conduct spread throughout the world—this was the result of serving his parents well.\n\nThe crown prince of Qi sat upon the Clear Terrace when Yan Duke Zhuang, named Ta, arrived. The duke wore a tall hat and a stern expression, with a jade-hilted sword at his left waist and jade pendants at his right. The light from the left shone upon the right, and the light from the right shone upon the left—meaning the radiance of the jade ornaments illuminated one another. The crown prince continued reading without looking up. Duke Zhuang asked him, \"Does Qi possess treasures?\" The crown prince replied, \"A ruler who is trustworthy and ministers who are loyal, with the people supporting their superiors—these are Qi’s treasures.\" Duke Zhuang Ta immediately removed his sword and departed, submitting to righteousness. This illustrates that the noble person values virtue, not ostentatious adornment.\n\nAlas! Do people have biases and blind spots without ever realizing them? The worthy see them and forgive without speaking; petty men, in their reckless affection, speak excessively; relatives, out of pity and jealousy, speak ambiguously. How could one with biases and blind spots fail to recognize them? *How* means *why*. Therefore, the noble person examines himself as if he always has faults. Wearing his clothes, eating his food, knowing his faults yet lacking the strength to correct them—this the noble person considers shameful. It speaks of a minister who cannot rectify anything.\n\nWhen about to speak, if one knows it will certainly not be heeded, the noble person rarely speaks. If the ruler does not accept loyal admonition, he speaks little to avoid calamity. When criticizing the faults of others, does one first examine one’s own goodness? When condemning others’ wrongdoing, does one first examine one’s own rectitude? This is called *reflecting on clarity*—first scrutinizing one’s own goodness and rectitude, then criticizing others’ wrongdoing.\n\nThe son of Di Xi was extremely filial and cautious. Di Xi, pitying his son, often spoke to him falsely. When Di Xi went out in the morning and returned at dusk, he would say, \"So-and-so has died.\" His son believed him, but later found that so-and-so was still alive.",
      "overlap_context": "en, bestowing its fine virtue, stirred Shun’s heart, and the numinous spirits blazed forth, allowing him to avoid harm. After his escape, he served his father with even greater diligence. Yao, recognizing his sageliness, tested him through many trials, and afterward abdicated his throne to him.\n\nKing Wen, when he was crown prince, was greatly filial. Morning and evening, he would invariably arrive outside the door of his father’s chamber and ask the attendants: \"Is he at peace today? How is he?\"",
      "start_char": 15647,
      "end_char": 16997,
      "start_sentence": 955,
      "end_sentence": 1042,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.303874015808105,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\洞灵真经注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 17,
      "original_text": "他夕则曰：乙且害。 余其子伺将行仇。 既而不见恶端。 他夕则曰：丁病矣。 其子觇之，丁诚无恙，举此类也。 觇，视也。 恙，忧也。 举，皆也。 冒淹年序。 子固孝谨，至於训勒，益不保承。 乡国之人，疾其咎口，谋将煞之。 翟西闻而惧，归以告子，子未甚信，既而翟西见煞。 此章戒人轻言政害。 虽爱子，犹不信之，以至见煞，况他人乎？ 谓多言之人为疏露，亦有辞约而不密者； 谓轻佻之人为不定，亦有体闲而心躁者； 轻佻，犹轻躁也。 谓丛杂之人为猥细，亦有外洁而内浊者。 若类而引之，不可殚载。 若非彻识，孰音克究详？ 殚，犹尽也。 时有不可不应也者，内静而外动，易动而难静。 谓外见利贪而逐之，愈得愈贪，故身劳而难静。 时有不可不求使也者，内思而外待，待至而后乐。 谓内兴情欲，缘境思求，心有所待，故待得而复乐，不知心摇而伤性。 是故外静而内动者，摇思而损性； 奔走而逐利者，劳力而害名。 唯泊然无情欲，而不为名利所诱者，然后身安而性全也。 人生於世或有不遂志，而宣言云不遇时者，是无异负丹颈之罪，俟时行戮，岂不殆哉？ 不能危行言逊，干犯时君，无异负斩首之罪，待时行戮也。 丹，血色。 其博才通识未见称用者，正可云时非不清，命未与耳，岂不韪欤？ 韪，犹是也。",
      "translated_text": "One evening, he would say, \"Yi is about to harm someone.\" His son, fearing he would seek vengeance, kept watch. Yet no sign of malice appeared. Another evening, he would say, \"Ding has fallen ill.\" His son observed him, and indeed, Ding was free of affliction—this was always the case.\n\n*Observed* means to watch; *affliction* means distress; *always* means entirely. As time passed, though the son remained filial and cautious, he could no longer trust or obey his father’s words. The people of his village and state grew resentful of his reckless speech and plotted to kill him. When Di Xi heard this, he was terrified and returned to warn his son. The son did not fully believe him, but soon after, Di Xi was murdered.\n\nThis passage warns against speaking carelessly of political harm. Even one’s beloved son may not be trusted, leading to murder—how much less so others? Those who speak excessively are called *careless and exposed*, yet some are sparing in words but still indiscreet. Those who are *frivolous* are called *unsettled*, yet some appear composed while their hearts are restless. *Frivolous* means flighty and impulsive. Those who are *disorderly* are called *petty and coarse*, yet some appear pure while their inner selves are tainted. If one were to enumerate such cases, they could not all be recorded. Without thorough discernment, who could fully investigate and understand them?\n\nThere are times when one cannot but respond—outwardly still, yet inwardly stirred, easily moved but difficult to calm. This refers to those who, upon seeing profit, greedily pursue it, growing ever more avaricious, thus wearing themselves out and finding no peace. There are times when one cannot but seek employment—internally desiring, yet outwardly waiting, finding joy only upon attainment. This refers to those who, stirred by passions and desires, crave external conditions, their hearts set on fulfillment, rejoicing when they obtain what they seek, unaware that their restless minds harm their nature.\n\nThus, those who are outwardly still but inwardly restless damage their nature through anxious thoughts; those who chase profit through relentless toil harm their reputation through exhausting labor. Only those who are serene and free of passions, unenticed by fame or gain, may then preserve their well-being and wholeness of nature.\n\nSome in this world, when their ambitions go unfulfilled, claim they have not met their time—this is no different from bearing the guilt of a crimson-necked crime, awaiting execution when the moment arrives. How perilous! Those who cannot conduct themselves with caution and speak with restraint, offending the ruler of their time, differ not from bearing the guilt of decapitation, awaiting the hour of their execution. *Crimson* refers to the color of blood.\n\nThose of vast talent and profound understanding who go unrecognized and unappointed may rightly say that the times are not unclean, but their fate has not aligned—is this not true?",
      "overlap_context": "ine one’s own goodness? When condemning others’ wrongdoing, does one first examine one’s own rectitude? This is called *reflecting on clarity*—first scrutinizing one’s own goodness and rectitude, then criticizing others’ wrongdoing.\n\nThe son of Di Xi was extremely filial and cautious. Di Xi, pitying his son, often spoke to him falsely. When Di Xi went out in the morning and returned at dusk, he would say, \"So-and-so has died.\" His son believed him, but later found that so-and-so was still alive.",
      "start_char": 16997,
      "end_char": 17542,
      "start_sentence": 1043,
      "end_sentence": 1075,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.239534854888916,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\洞灵真经注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 18,
      "original_text": "长於谏者，务依存前人之性而翦制其情之所由起，是彼此开进，亲敬殷笃。 不长於谏者，务攻前人之性而暗於情之所来，是以彼此嫌贰猜衅日积。 儿童之所简者，乃耆耋之所非； 耳目之所娱者，乃心虑之所疾。 健责天下之愚者，己之未贤也； 健责天下之迷者，己之未明也。 贤明者当恕，愚迷而勿责。 以未贤责众愚，未贤者以之亡； 以未明责众迷，未明者以之伤。 愚迷之人无所损，健责者徒自伤耳。 农道篇第八 夫谷者，人之天。 理国之道，务农为本。 人舍本而事未，则不一令， 本谓农也，未谓趋浮利也。 人趋末利，则奸诈多端，故一令不能制也。 不一令则不可以守，不可以战。 趋利多端，人心不一。 故不可以固守，不可以攻战也。 人舍本而事未，则兀音其产约， 人贪浮利则产业薄也。 兀产约则轻流徙，轻流徙则国家时有灾患。 皆生远志，无复居心。 人舍本而事未则好知，好知则多诈，多诈则巧法令，巧法令则以是为非，以非为是。 古先圣王之所以理人者，先务人。 人非徒为坠利也，贵行其志也。 志在安人。 人则朴，朴则易用，易用则边境安，安则主位尊。 人则童， 如童儿无异志也。 童则少私义，少私义则公法立。 力博深则兀产复， 复，犹厚也。 兀产复则重流散， 不流散也。 重流散则死其处无二虑，是天下一心矣。 天下一心，轩皇几莲之理不足#8过也。 轩皇、几连，古之有道之君也。 古先圣皇之所以茂耕织者，以为本教也。 是故天子躬率诸侯耕籍田，火夫、 士第有功级劝人尊坠产也， 第，次第也。 《月令》云：正月中气，天子乃择元辰，亲载耒耜，置之车右，率公卿、诸侯、大夫，躬耕籍田。 天子三推，三公五推，卿、诸侯九推。 是以功级劝人也。",
      "translated_text": "Those skilled in remonstrance ensure they preserve the other’s nature while pruning the roots of their emotions—thus, both parties advance in harmony, and mutual respect deepens. Those unskilled in remonstrance assail the other’s nature and remain blind to the source of their emotions—thus, mutual suspicion and resentment accumulate day by day.\n\nWhat children dismiss, the aged condemn;\nwhat delights the eyes and ears, the mind deems a malady.\n\nTo harshly reproach the foolishness of the world is to reveal one’s own lack of worth;\nto harshly reproach the delusion of the world is to reveal one’s own lack of clarity.\nThe worthy and enlightened should practice forbearance—\nreprove not the foolish and deluded.\n\nTo reproach the multitude for their foolishness while lacking worth is to invite ruin;\nto reproach the multitude for their delusion while lacking clarity is to invite harm.\nThe foolish and deluded suffer no loss—\nonly the harsh reproacher wounds himself in vain.\n\n**Chapter Eight: The Way of Agriculture**\n\nGrain is the people’s Heaven.\nIn governing a state, agriculture is the foundation.\nWhen people abandon the root to pursue the branch,\ncommands cannot be unified—\nthe *root* refers to agriculture,\nthe *branch* to the pursuit of superficial profit.\nWhen people chase superficial profit,\ndeceit and cunning multiply,\nand no single command can restrain them.\nWithout unified commands,\nneither defense nor warfare is possible.\nWith profit-seeking diversions,\nhearts are divided—\nthus, neither steadfast defense nor victorious warfare can be achieved.\n\nWhen people abandon the root to pursue the branch,\ntheir livelihoods grow meager.\nWith meager livelihoods, they lightly abandon their homes;\nwith light abandonment, the state suffers frequent calamities.\nAll cultivate distant ambitions,\nand none remain settled in heart.\n\nWhen people abandon the root to pursue the branch, they become cunning;\nwith cunning, deceit multiplies;\nwith deceit, laws and decrees are manipulated—\nright is made wrong, and wrong is made right.\n\nThe way by which the sage-kings of antiquity governed their people\nwas first to ensure their sustenance.\nEnsuring sustenance was not merely for material gain—\nit was to honor the fulfillment of their will,\na will directed toward the people’s peace.\n\nWhen people are well-sustained, they remain simple;\nwhen simple, they are easily employed;\nwhen easily employed, the borders are secure;\nwhen secure, the ruler’s position is exalted.\n\nWhen people are well-sustained, they become like children—\nfree of divergent ambitions.\nLike children, they harbor few private interests;\nwith few private interests, public laws stand firm.\n\nWhen strength is devoted to deep cultivation,\nlivelihoods grow abundant—\n*abundant* meaning prosperous.\nWith prosperous livelihoods, people do not lightly scatter;\nwithout light scattering, they die in their place without second thoughts—\nthus, the world unites in a single heart.\n\nWhen the world unites in a single heart,\neven the governance of the Xuanyuan and Jilian Emperors would not surpass it.\nXuanyuan and Jilian were enlightened rulers of antiquity.\n\nThe reason the sage-emperors of old esteemed farming and weaving\nwas to make them the foundation of instruction.\nThus, the Son of Heaven personally led the feudal lords in plowing the sacred field,\nwhile officials of all ranks were rewarded according to merit to encourage the people to value production—\n*ranks* referring to hierarchy.\nAs the *Monthly Ordinances* states:\n\"In the first month, when the vital energy is balanced, the Son of Heaven selects an auspicious day, personally carries the plow and plowshare, places them to the right of his chariot, and leads the dukes, ministers, and feudal lords in plowing the sacred field.\nThe Son of Heaven makes three furrows,\nthe Three Dukes five,\nand the ministers and feudal lords nine.\"\nThus, merit was rewarded to encourage the people.",
      "overlap_context": "crimson-necked crime, awaiting execution when the moment arrives. How perilous! Those who cannot conduct themselves with caution and speak with restraint, offending the ruler of their time, differ not from bearing the guilt of decapitation, awaiting the hour of their execution. *Crimson* refers to the color of blood.\n\nThose of vast talent and profound understanding who go unrecognized and unappointed may rightly say that the times are not unclean, but their fate has not aligned—is this not true?",
      "start_char": 17543,
      "end_char": 18271,
      "start_sentence": 1076,
      "end_sentence": 1120,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.833932638168335,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\洞灵真经注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 19,
      "original_text": "后妃率嫔御蚕於郊，桑公田，劝人力，归教也。 《月令》云：三月中气，命有司无伐桑柘。 乃修器。 后妃斋戒享先，蚕而躬桑，以劝蚕事。 《祭义》云：古者天子诸侯必有公桑蚕室，近川而为之，君卜三官之夫人、世妇之吉者，使入蚕室，世妇亲蚕，奉以示于君，遂献于夫人。 夫人缲，三盆手，遂布于三宫夫人，世妇之吉者，使缲之。 此劝妇教也。 男子不织而衣，归人不耕而食，男女贸功，资相业，此圣王之制也。 贸，犹易也。 故敬时爱日，坍实课功， 埒，量也。 非老不休，非疾不息，一人勤之，十人食之。 上农夫，食十人。 当时之务，不兴土功，不料师旅，男不出御，女不外嫁， 一作大嫁。 以妨也。 兴土功，治师旅，行婚嫁，皆谓妨农业也。 御，迎也。 谓男子不亲御。 黄帝曰：四时之不可正，正五谷而已耳。 夫稼，为之者人也， 稼，谓种也。 生之者天也，养之者地也。 是以稼之容足，耨之容耰， 耨，锄也。 又，耰，谓锄器也。 耘之容手， 耕，除草也。 是谓耕道。 种苗可使容足，褥之可使容粮，耘之可使容手。 攻食，工攻器，贾攻货。 攻，治也。 时不龚，敚之以土功，是谓大。 君王不恭，则大凶之道也。 凡稼早者先时，暮者不及时，寒暑不节，稼乃多灾。 言太早太晚者，谓不得中和之气也。 冬至已后五旬有七日而昌生， 旬，十日也。 五十七日在立春节中，而草木昌发。 於是乎始耕。 之道，见生而艺生，见死而获死。 因天时而兴人事也。 艺，种也。 获，刈也心 天发时，坠产财，不与人音期。 产，生也。 有年祀土，无年祀土， 有年，丰年也。 无年，荒年也。 祀土，祭社稷也。 春祭祈丰，祥也。 秋祭报成，熟也。 不以有年则祭，无年不祭，所以祈地，利重人命。 无失人时，迨时而作，过时而止，老弱之力可使尽起。 迨，及也。 虽老弱可使尽，耕所以趋时也。 不知时者，未至而逆之， 谓兴农太早也。 既往而慕之， 时既过，往而慕之，是大晚。 当兀时而薄之， 虽当其时而用功寡薄，所收亦不多。 此从使之下也。 此三者，虽从农务，不得其时，故云下也。 夫褥必以旱，使坠肥而土缓。 夫锄必用旱时，旱时则草易死，而土脉肥缓也。 稼欲产於尘土而殖於地坚者， 殖，长也。 下种欲其土细如尘，则地虚而根深； 及苗长也，得雨则土坚，坚则茎固也。 慎其种勿使数，亦无使疏。 数，为烦也。 於其施土，无使不足，亦无使有余。 施土，谓施种於土也。 种不足则伤疏而费地，种有余则伤密而损谷。 不费不损，取其中也。 圳欲深以端，亩欲沃以平。 端，正直也。 圳深直则水流疾，亩沃平则润泽匀。 下得阴，上得阳，然后成生。 下阴谓水润，上阳谓日气。 立苗有行，故速成，强弱不相害，故速大。 苗成行则长疾，强不害弱则易大也。 正兀行，通其中，疏泠风， 使苗疏而通风。 则有收而多功。 率稼望之有余，就之则疏，是坠之窃也。 由地瘠薄也，苗不茂盛，若被窃之状。 不除则芜，除之则虚，是伤之也。 除，治也。 草盛而后除之，苗则虚矣，是人事伤之也。 苗兀弱也欲孤， 欲一一孤生不并聚也。 兀夫也欲相与居， 与众同居，共相荫映。 兀熟也欲相与扶。 无倒折之害也。 三以 族，稼乃多谷。",
      "translated_text": "The empress and consorts led the palace ladies in silkworm rearing at the suburban altars, tending the mulberry fields of the public estate to encourage diligent labor—a return to fundamental instruction. As the *Monthly Ordinances* states: \"In the third month, when the vital energy is balanced, the authorities are commanded not to fell mulberry or silkworm-thorn trees. Then, the implements are prepared. The empress fasts and purifies herself to offer sacrifices to the silkworm ancestors, then personally gathers mulberry leaves to promote sericulture.\"\n\nThe *Record of Sacrifices* says: \"In antiquity, the Son of Heaven and feudal lords necessarily had public mulberry groves and silkworm chambers, built near rivers. The ruler divined among the three palace ladies, the wives of high ministers, and the concubines to select the most auspicious, who entered the silkworm chamber. The concubines personally tended the silkworms, presented the cocoons to the ruler, and then offered them to the empress. The empress reeled three cocoons by hand, then distributed them to the three palaces. The most auspicious among the high ministers’ wives and concubines were tasked with reeling the silk. This was to encourage women’s instruction.\"\n\nMen do not weave yet are clothed; women do not plow yet are fed. Through the exchange of labor between men and women, their occupations mutually sustain one another—this was the system of the sage-kings. *Exchange* means to barter. Thus, they revered the seasons and cherished the days, measuring tasks by their substance to assess merit. *Measuring* means to quantify. They did not rest unless aged, nor cease unless ill. The toil of one man fed ten. The foremost farmers fed ten people.\n\nIn the pressing affairs of the season, earthworks were not initiated, nor were armies mobilized. Men did not go forth to welcome brides, nor were women married outside—*one version reads \"grand marriage.\"* This was to avoid hindering agriculture. *Earthworks, military campaigns, and weddings* all referred to obstructing farming. *Welcoming* meant men did not personally receive brides.\n\nThe Yellow Emperor said: \"The four seasons cannot be made correct; one can only rectify the five grains.\" Cultivation is undertaken by man, *cultivation* meaning to sow. Growth comes from Heaven, nourishment from Earth. Thus, furrows must accommodate the foot, hoeing must accommodate the hoe—*hoeing* means to weed. *Hoe* refers to the weeding tool. Weeding must accommodate the hand—*weeding* means to clear grass. This is called the *Dao of cultivation*. Seedlings should allow room for the foot, tilling room for the hoe, and weeding room for the hand.\n\nFarmers refine food, artisans refine tools, merchants refine goods. *Refine* means to cultivate. If the seasons are not revered and earthworks are imposed, this is called *great calamity*. For a ruler to be irreverent is the path to great misfortune.\n\nIn cultivation, those who begin early act ahead of time, while those who begin late fall behind. If cold and heat are unbalanced, crops suffer many disasters. *Too early or too late* refers to failing to attain the harmonious qi. Fifty-seven days after the winter solstice, plants flourish—*a decade* means ten days. The fifty-seventh day falls within the *Beginning of Spring* solar term, when grasses and trees burst forth. Thus, plowing begins.\n\nThe *Dao of agriculture* is this: upon seeing life, plant life; upon seeing death, harvest death. This means to act in accord with Heaven’s timing. *Plant* means to sow; *harvest* means to reap. Heaven bestows the seasons, while man produces wealth—it does not make appointments with man. In years of plenty, the earth is sacrificed to; in years of famine, the earth is sacrificed to. *Years of plenty* means abundant harvests; *years of famine* means poor harvests. *Sacrificing to the earth* means offering to the altars of soil and grain. The spring sacrifice prays for abundance; the autumn sacrifice gives thanks for ripeness. Whether in years of plenty or famine, sacrifices are made to entreat the earth, for the benefit of life is weighty.\n\nDo not lose the proper time: act when the season arrives, cease when it passes. Even the strength of the old and weak can be fully employed. *Act* means to reach. Though old and weak, they can be made to exhaust their strength—this is how plowing follows the season. Those who do not know the time act before it arrives, *meaning they begin farming too early,* or long for it after it has passed—*meaning the season has passed, yet they yearn for it, which is too late.* Or they neglect it when it arrives—*though the time is right, they exert little effort, so the harvest is meager.* These three are the lowest in agricultural practice. Though they engage in farming, they do not grasp the season, hence they are called the lowest.\n\nTilling must be done early to make the soil fertile and loose. Hoeing must be done in the early season, for then weeds die easily and the soil’s veins become rich and soft. Crops desire to sprout in dust-like soil and grow in firm earth—*grow* means to lengthen. Sowing requires soil as fine as dust, so the earth is porous and roots run deep. When seedlings grow, rain firms the soil, and firmness strengthens the stalks.\n\nBe careful with the seeds: do not make them too dense, nor too sparse. *Dense* means crowded. When applying soil, do not make it insufficient, nor excessive. *Applying soil* means placing seeds in the earth. Insufficient seeds lead to sparsity and waste land; excessive seeds lead to density and harm the grain. Neither waste nor harm—take the middle way.\n\nFurrows should be deep and straight, ridges fertile and level. *Straight* means upright. Deep, straight furrows allow water to flow swiftly; fertile, level ridges ensure even moisture. Below, they receive yin; above, they receive yang—*yin below* means water’s moisture; *yang above* means the sun’s qi. Then life is completed.\n\nSeedlings planted in rows grow quickly; the strong and weak do not harm one another, so they grow swiftly. Straight rows allow passage through their centers, thinning them to admit cool breezes. Then there will be harvests and great success.\n\nIf crops appear abundant from afar but sparse up close, it is the earth’s theft—*due to barren soil, seedlings are not lush, as if stolen.* If weeds are not removed, they overgrow; if removed, the seedlings are left bare—this is man’s harm. *Remove* means to tend. If weeds are allowed to flourish before removal, the seedlings will be bare—this is harm from human effort.\n\nWeak seedlings desire solitude—*wishing to grow singly, not clustered.* Strong seedlings desire to dwell together—*to live among many, sharing shade.* Ripe seedlings desire mutual support—*to avoid damage from falling.* When these three are grouped, crops yield abundant grain.",
      "overlap_context": "alue production—\n*ranks* referring to hierarchy.\nAs the *Monthly Ordinances* states:\n\"In the first month, when the vital energy is balanced, the Son of Heaven selects an auspicious day, personally carries the plow and plowshare, places them to the right of his chariot, and leads the dukes, ministers, and feudal lords in plowing the sacred field.\nThe Son of Heaven makes three furrows,\nthe Three Dukes five,\nand the ministers and feudal lords nine.\"\nThus, merit was rewarded to encourage the people.",
      "start_char": 18272,
      "end_char": 19692,
      "start_sentence": 1121,
      "end_sentence": 1218,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.787840604782104,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\洞灵真经注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 20,
      "original_text": "三者，如人之宗族，共相扶持则多收。 凡苗之患不俱生而俱死， 生不齐则大苗凌小，小苗不茂。 是以先生者美米，后生者为□。 强者凌弱，故后生者不实。 是故其也，其兄而去其弟。 以人喻苗也，先生为兄，后生为弟也。 树肥无使扶疏，树硗不欲专生而独居。 硗，瘠地。 专生#9独居，不耐风旱。 肥而扶疏则多枇，硗而专居则多死。 不知耨者，去其兄而养其弟，不收其粟而收其□。 上下不安，则稼多死。 得时之禾，长秱而大穗，圜粟而薄糠，饴而香，舂#10之易而食之强 禾，谓粟也。 秱，穗颈也。 圜，圆也。 饴，谓味甘如饴也。 失时之禾，深芒而小茎，穗锐多□而青蘦。 深芒，长芒也。 锐细也。 青蘦，其米青也。 得时之黍，穗不芒以长，搏米而寡糠； 搏，谓以手挼谷而出米。 失时之黍，大本华茎，叶膏短穗。 本，根也。 华茎，茎傍有华也。 膏，言肥大也。 得时之稻，茎葆长秱，穗如马尾； 葆，大也。 马尾，言长也， 失时之稻，纤茎而不滋厚糠而菑死。 得时之麻，疏节而色阳，坚枲而小本； 阳，光扬也。 坚，牢也。 言皮坚劲。 失时之麻，蕃柯短茎，岸节而叶虫。 蕃柯，谓枝柯多也。 岸节者，高节也。 得时之菽，长茎而短足，其荚二七以为族，多枝数节，竞叶繁实，称之重，食之息； 菽者，豆也。 族，聚也。 息，犹盈也。 失时之菽，必长以蔓，浮叶虚本，疏节而小荚。 得时之麦，长秱而颈族，二七以行，薄翼谓音屯色，食之使人肥且有力； 薄翼，谓糠也。 ，黄色也。 其麦穗一行有二七粒。 失时之麦，胕肿多病，弱苗而翜穗。 胕肿，谓茎根粗而且虫。 翜穗，多芒。 是故得时之稼丰，失时之稼约。 庶谷尽宜，从而食之，使人四卫变强，耳目聪明，气不入，身无苛殃， 四卫，四支也。 善乎，孔子之言：冬饱则身温，夏饱则身凉。 夫温凉时适，则人无疾疢； 人无疾疢，是疫疠不行； 疫疠不行，咸得遂其天年。 故曰：谷者，人之天。 是以兴王务，王不务，是弃人也。 王而弃人，将何国哉？ 兵道篇第九 兵者，不祥之器。 不得已而用之。 秦景主将视强兵於天下， 秦恃崤亟险固、兵强士勇，故欲示强 於兵，使天下无敢与之敌。 视，犹示 也。 使庶鲍戎必致亢仓子， 庶长，秦爵号。 鲍戎，人姓名也。 待以坏邑十二，周实迫之。 周，密也。 欲问亢仓子计，故以十二邑待之； 恐其不来，密使鲍戎迫之使必来。 亢仓子至，自荣泉宾于上馆。 荣泉，秦地名也。 景主三日弗得所问， 谓欲问之而不得也。",
      "translated_text": "The three types, like human clans, yield greater harvests when they mutually support one another. All seedlings suffer when they do not sprout and perish together—uneven growth allows large seedlings to oppress small ones, stunting their flourishing. Thus, early sprouts produce fine grain, while late ones yield □. The strong oppress the weak, so late sprouts fail to bear fruit. Therefore, in cultivation, one retains the elder and removes the younger. This analogy compares seedlings to people: early sprouts are elder brothers, late ones younger brothers.\n\nFor trees in fertile soil, do not let them grow too luxuriantly; for those in barren soil, do not allow them to grow singly in isolation. *Qiao* refers to barren land. Growing singly and isolated leaves them vulnerable to wind and drought. Luxuriant growth in fertile soil leads to much blight; solitary growth in barren soil leads to much death. Those who do not understand weeding remove the elder and nurture the younger, forsaking the grain to harvest □. When upper and lower are unsettled, crops die in great numbers.\n\nTimely millet grows tall with large ears, its grains round and husks thin, sweet and fragrant, easy to hull and nourishing to eat. *He* refers to millet. *Tong* is the ear’s stem. *Yuan* means round. *Yi* describes its taste, sweet as malt sugar. Untimely millet has long awns and slender stalks, its ears sharp and filled with □, its grains green and withered. *Shen mang* means long awns. *Rui* means slender. *Qing ling* describes its green grains.\n\nTimely millet has long, awnless ears, its grains plump and husks few. *Bo* means to rub the grain by hand to remove the husk. Untimely millet has thick roots and flowering stalks, its leaves lush and ears short. *Ben* refers to roots. *Hua jing* describes stalks with flowers. *Gao* means lush and thick.\n\nTimely rice has thick stalks and long stems, its ears like a horse’s tail. *Bao* means large. *Ma wei* describes long ears. Untimely rice has slender stalks lacking vigor, its husks thick, and it withers and dies.\n\nTimely hemp has sparse nodes and bright color, its fibers strong and roots small. *Yang* means bright and radiant. *Jian* means firm, describing its tough skin. Untimely hemp has many branches, short stalks, prominent nodes, and insect-damaged leaves. *Fan ke* refers to many branches. *An jie* means high nodes.\n\nTimely beans have long stalks and short stems, their pods clustered in groups of fourteen, with many branches and numerous nodes, their leaves lush and pods full, heavy to the hand and satisfying to eat. *Shu* refers to beans. *Zu* means clustered. *Xi* means abundant. Untimely beans grow long vines, their leaves floating and roots weak, their nodes sparse and pods small.\n\nTimely wheat has long stems and clustered ears, its grains arranged in rows of fourteen, its husks thin and color yellow, nourishing to eat, strengthening the body. *Bo yi* refers to husks. *Tun* means yellow. Its ears bear fourteen grains per row. Untimely wheat swells with disease, its seedlings weak and ears bristling. *Fu zhong* describes thick, insect-ridden stalks and roots. *Sha sui* means many awns.\n\nThus, timely crops yield abundance, while untimely ones yield scarcity. When all grains are cultivated appropriately and consumed, they fortify the four limbs, sharpen hearing and sight, prevent *qi* from invading, and spare the body from ailments. The four limbs are the *si wei*. How excellent are Confucius’s words: “In winter, a full stomach warms the body; in summer, it cools it.” When warmth and coolness are seasonally fitting, people suffer no illness; free from illness, epidemics do not spread; without epidemics, all fulfill their natural lifespans. Thus it is said: “Grain is the sky of man.” Therefore, enlightened rulers devote themselves to agriculture. A ruler who neglects agriculture abandons his people. A ruler who abandons his people—what kingdom can he govern?\n\n**Military Strategy, Chapter Nine**\nWarfare is an inauspicious instrument, to be employed only when unavoidable.\n\nDuke Jing of Qin sought to display his military might to the world. Qin relied on the steep passes of Xiao and its formidable army of brave soldiers, so it wished to demonstrate its strength, leaving none in the world to dare oppose it. *Shi* means to display.\n\nHe sent the minister Bao Rong to compel Kang Cangzi to come. *Shu zhang* was a Qin noble rank. Bao Rong was a person’s name. He offered twelve ruined cities as inducement, secretly pressuring him. *Zhou* means secret. Desiring Kang Cangzi’s counsel, he offered twelve cities to secure his arrival; fearing he might refuse, he secretly sent Bao Rong to compel him.\n\nKang Cangzi arrived and was lodged as an honored guest at Rongquan. Rongquan was a place in Qin. For three days, Duke Jing could not broach the matter he wished to discuss. This means he sought to question him but could not.",
      "overlap_context": "e not removed, they overgrow; if removed, the seedlings are left bare—this is man’s harm. *Remove* means to tend. If weeds are allowed to flourish before removal, the seedlings will be bare—this is harm from human effort.\n\nWeak seedlings desire solitude—*wishing to grow singly, not clustered.* Strong seedlings desire to dwell together—*to live among many, sharing shade.* Ripe seedlings desire mutual support—*to avoid damage from falling.* When these three are grouped, crops yield abundant grain.",
      "start_char": 19693,
      "end_char": 20766,
      "start_sentence": 1219,
      "end_sentence": 1298,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.974278688430786,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\洞灵真经注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 21,
      "original_text": "下席北首顿珪曰：天果无意恤孤耶？ 北首顿珪，尽礼也。 亢仓子油然亏盼曰：朕以主异之，问而宁弊弊焉？ 以斫刺故， 油然，微动貌。 亏，侧也。 眄，顾盻也。 朕，我也。 我以景主有远异之问，而何为弊弊焉？ 言景主以兵戈斫刺为故乎？ 言其所问下。 抑者亦随其欲而得正焉，无如可矣。 言景主既以兵道问我，故我抑亦随其所欲而正之，非至理之可也。 景主一拜再举，敛黼衽端珪，抑首而坐曰：实惟天所命。 黼衽绣襟也。 抑首，低首也。 惟天所命，愿垂告命。 亢仓子仰榱而嘘，俯正颜色曰：原兵之所起与始，有人俱。 榱，椽也。 仰榱，仰面屋榱也。 嘘， 叹声也。 嗟其不问至道，故仰面而发嘘叹。 夫兵之所起与人俱生，本始有之，非独今也。 凡兵也者，出人之威也。 人之有威，性受於天， 人有喜怒之性，本受於天。 怒则威生，威生则兵起之由也。 故兵之所自来上矣。 尝无少选不用， 少选，犹少时也。",
      "translated_text": "Seating himself below and facing north, he struck his tablet to the ground, saying: \"Does Heaven truly have no intention to aid this orphaned ruler?\" Facing north and striking the tablet were acts of utmost ritual propriety.\n\nKang Cangzi’s gaze subtly shifted as he replied: \"I deemed Your Lordship’s inquiry extraordinary—why then this wearisome insistence?\" *Oilran* describes a slight movement; *kui* means to incline; *mian* signifies a sidelong glance. *Zhen* is the royal \"I.\" \"I thought Your Lordship’s question possessed rare depth—why this fixation on trivial matters?\" He alluded to the subject of warfare and conquest. \"Yet if one follows another’s desires to seek rectification, there is no principle by which it may be deemed proper.\" He meant that since the Duke had framed his question in terms of military force, he would respond in kind to correct his intent, though this was not the highest principle.\n\nDuke Jing bowed once, then again, gathering his embroidered robe and straightening his tablet. Lowering his head, he sat and said: \"This is truly what Heaven has ordained.\" *Furen* refers to the embroidered lapel of a robe; *yishou* means to bow the head. \"I wish to receive your instruction as a mandate from Heaven.\"\n\nKang Cangzi looked up at the rafters and sighed, then lowered his head and composed his expression, saying: \"The origin of warfare and its beginnings arose together with humankind.\" *Cui* means rafter; *yangcui* describes looking up at the roof beams. *Xu* is the sound of a sigh. He sighed toward the rafters, lamenting that the Duke had not inquired into the highest Dao. \"Warfare has existed alongside humanity since the very beginning—it is not unique to the present age. Generally, warfare arises from human might. The possession of might is an innate quality bestowed by Heaven.\" Human nature, including joy and anger, is fundamentally received from Heaven. \"Anger gives rise to might, and might gives rise to the origins of warfare. Thus, the roots of warfare extend far back into antiquity. There has never been even a brief moment when it was not employed.\" *Shaoxuan* means a short while.",
      "overlap_context": "rank. Bao Rong was a person’s name. He offered twelve ruined cities as inducement, secretly pressuring him. *Zhou* means secret. Desiring Kang Cangzi’s counsel, he offered twelve cities to secure his arrival; fearing he might refuse, he secretly sent Bao Rong to compel him.\n\nKang Cangzi arrived and was lodged as an honored guest at Rongquan. Rongquan was a place in Qin. For three days, Duke Jing could not broach the matter he wished to discuss. This means he sought to question him but could not.",
      "start_char": 20767,
      "end_char": 21168,
      "start_sentence": 1299,
      "end_sentence": 1329,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.494903564453125,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\洞灵真经注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 22,
      "original_text": "喜怒之情用之无常，故无少时不用也。 贵贱、少、贤愚相与同。 同察怒气之动，则知兵起之原。 察兵之兆，在心怀恚而未发，兵也； 疾视作色，兵也； 傲言推捘，兵也； 侈斗攻战，兵也。 此四者鸿细之争也。 恚，怒也。 作色，厉色。 捘，亦推也，谓相推荡也。 四者虽有大小之异，皆有怒心，故为兵也。 未有蚩尤之时，人实揭材木以斗矣。 蚩尤，黄帝时掾诸侯，兄弟八十一人，铜头铁额，与帝战於涿鹿之野，造兵器，后为黄帝所灭也。 黄帝用水火矣，或引水注邑，或纵火烧城。 共工称乱矣， 共工与颛顼争天下。 五帝相与争矣，一兴一废，胜者用事。 用兵之道，有废有兴，皆以顺天而胜者，得用耳。 夫有以咽药而死者，欲禁天下之医，非也； 有以乘舟而死者，欲禁天下之船，非也； 有以用兵丧其国者，欲禁天下之兵，非也。 夫兵之不可废，譬水火焉，善用之则为福，不善用之则为祸。 是故怒笞不可偃於家，刑罚不可偃於国，征罚不可偃於天下。 笞，鞭杖。 偃，息也。 古之圣王有义兵而无偃兵， 义兵者，顺天应人，所以诛暴乱也。 兵诚义以诛暴君而振苦人，人之悦也，若孝子之见慈亲，饿隶之遇美食，号呼而走之，若强弩之射深谷也。 振，救也。 隶，仆隶也。 强弩之射深谷，言救之疾也。 胜负之决勿征於他，必反人情。 兵之胜负勿征验於他，反求人情，则得之。 人之情欲生而恶死．’欲荣而恶辱，死生荣辱之道一，则三军之士可使一心矣。 人君与三军之士同其死生荣辱，则三军虽众，可使一心矣。 凡君欲其众也，心欲其一也，三军一心，则令可使无敌矣。 古之至兵，盖重令也， 古之至极善用兵者，盖重慎其令也。 故其令强者其敌弱，其令信者其敌诎。 先胜之於此，则胜之於彼。 夫料敌制胜，必先自料。 若与众同死生，而三军一心，则胜於彼矣。 诚若此，则敌胡足胜也？ 凡敌人之来也，以求利也，今来而得死，且以走为利，敌皆以走为利，则刃无所与接矣，此之谓至兵。 傲虐奸诈之与义理反也， 言奸兵与义兵，逆顺之理相反。 其势不俱胜，不两立， 义兵胜，奸兵败。 故义兵之入於敌之境，则人知所庇矣。 兵至於国邑之郊，不践果稼，不穴丘 墓，不残积聚，不焚室屋，得人虏厚而归之。 信与人期，以敚敌资，以章好恶，以示逆顺。 先示之以义也。 若此而犹有愎狠凌傲遂宕不听者，虽行武焉可也。 愎狠，犹恶戾也。 宕，流宕也。 先行义以示之，犹有恶戾不听服者，用武诛之可也。 先发声出号令曰：兵之来也，以除人之雠，以顺天之道。 故克其国，不屠其人，独诛所诛而已矣。 独诛者，暴君也。 於是举选秀士贤良而尊封之，求见孤疾长老而拯救之， 孤疾之人拯给之，长老者政敬之也。 发府库之财，散仓糜之谷#11，不私其物，曲加其礼。 不私其利，与众共之，曲加其礼，聘以求贤也。 今有人於此，能生死一人，则天下之人争事之矣。 生，犹活也。 言有人以义能活一人之死，则天下咸能事之矣。 义兵之生一人亦多矣，人孰不悦？ 故义兵至，则邻国之人归之若流水，诛国之人望之如父母。 行地滋远，得人滋众。 辞未终，景主兴，稽首曰； 孤获闻先生教言，不觉气盈宇宙，志知所如。 也。 而心滋益龚，",
      "translated_text": "The emotions of joy and anger are employed without constancy, thus there has never been even a brief moment when they were not in use. The noble and the base, the old and the young, the worthy and the foolish—all alike share this. By observing the stirring of anger, one knows the origins of warfare. To discern the omens of war: when resentment lingers in the heart yet remains unexpressed, this is war; when the gaze turns fierce and the countenance shifts, this is war; when haughty words are spoken and forceful thrusts are made, this is war; when boastful strife and violent assaults erupt, this is war. These four are but disputes of greater or lesser scale. *Hui* means anger; *zuose* describes a stern expression; *zun* also means to push, referring to mutual provocation. Though these four differ in magnitude, all arise from a heart of anger, and thus are war.\n\nEven before the time of Chiyou, men already brandished timber and fought. Chiyou, a minister to the feudal lords in the time of the Yellow Emperor, had eighty-one brothers, each with a head of bronze and a brow of iron. He waged war against the Emperor at the wilds of Zhuolu, forged weapons, and was later destroyed by the Yellow Emperor. The Yellow Emperor employed water and fire—some diverted rivers to flood cities, others set fires to burn them. Gonggong rebelled, contending with Zhuanxu for the realm. The Five Emperors likewise contended with one another, each rising and falling in turn; the victorious ruled. The way of warfare knows both decline and resurgence, yet all who prevailed did so by aligning with Heaven.\n\nThere are those who die from swallowing medicine—yet to ban all physicians in the world would be wrong. There are those who die from boarding a boat—yet to ban all ships in the world would be wrong. There are those who lose their states through warfare—yet to ban all warfare in the world would be wrong. Warfare cannot be abolished, just as water and fire cannot: when used well, they bring fortune; when used poorly, they bring disaster.\n\nThus, the rod of anger must not be laid to rest within the household, punishments must not be laid to rest within the state, and military campaigns must not be laid to rest in the world. *Chi* refers to the whip or staff; *yan* means to cease. The sage-kings of antiquity had righteous armies but no idle armies. A righteous army follows Heaven and responds to the people, punishing tyranny and chaos. When an army truly acts with righteousness to punish a cruel ruler and rescue the suffering, the people rejoice as a filial child beholding a loving parent, or as a starving servant encountering a feast. They cry out and rush forward as a powerful crossbow loosed into a deep valley. *Zhen* means to rescue; *li* refers to servants. The comparison to a crossbow shot into a deep valley illustrates the swiftness of the rescue.\n\nThe outcome of victory or defeat does not depend on external signs but must return to human nature. The outcome of war does not lie in external verification but in returning to the sentiments of the people. Human nature desires life and abhors death, seeks honor and shuns disgrace. When the principles of life and death, honor and disgrace are unified, the soldiers of the Three Armies can be made of one heart. If the ruler shares in the life and death, honor and disgrace of the Three Armies, then though the armies be vast, they can be made of one heart.\n\nGenerally, a ruler desires his multitudes to be of one mind. When the Three Armies are of one heart, commands can be issued without fear of opposition. The supreme armies of antiquity valued their commands above all. Thus, the strength of their commands made their enemies weak, and the trustworthiness of their commands made their enemies yield. Victory is first secured here, then secured there. To assess the enemy and secure victory, one must first assess oneself. If one shares life and death with the multitudes and unites the Three Armies in heart, then victory over the enemy is assured. If this is truly so, how could the enemy ever prevail?\n\nWhen the enemy approaches, it is to seek gain. If they come and meet death, then flight becomes their gain. If all enemies see flight as gain, then blades will never meet. This is the supreme army.\n\nArrogance, cruelty, deceit, and treachery stand in opposition to righteousness and principle. Their forces cannot both prevail; they cannot coexist. Thus, when a righteous army enters the enemy’s territory, the people know where to seek refuge. When the army reaches the outskirts of a city or state, it does not trample crops, does not desecrate tombs, does not plunder stores, does not burn homes. It captures people but treats them generously and returns them. It keeps its promises, seizes the enemy’s resources to weaken them, makes clear what is good and evil, and demonstrates what is right and wrong—first showing them righteousness.\n\nIf, despite this, there remain those who are stubborn, cruel, domineering, and defiant, refusing to submit, then the use of force is permissible. *Bihen* means obstinate cruelty; *dang* means reckless defiance. After first demonstrating righteousness, if there are still those who remain wicked and disobedient, then punishing them with force is permissible.\n\nFirst, a proclamation is issued: \"Our army comes to avenge the people’s enemies and to follow the Dao of Heaven.\" Thus, when they conquer a state, they do not massacre its people but punish only those who deserve punishment—only the cruel ruler. Then, they select and honor the worthy and virtuous, seek out the orphaned and infirm, the elderly, and rescue them. They provide for the orphaned and infirm, respect the elderly, open the treasuries and granaries, distributing their wealth and grain without keeping anything for themselves, and bestow honors with great care. They do not hoard their gains but share them with all, offering courtesies to seek out the worthy.\n\nIf there were a man who could save a single life from death, the people of the world would vie to serve him. To save a life means to restore it. If a man, through righteousness, could restore one life from death, the world would hasten to serve him. A righteous army saves not one but many lives—who would not rejoice? Thus, when a righteous army arrives, the people of neighboring states flock to it like flowing water, and the people of the conquered state look upon it as parents. The farther it advances, the more people it gains.\n\nBefore the words were finished, Lord Jing rose, bowed deeply, and said: \"I have been fortunate to hear your teachings, Master. Unknowingly, my spirit fills the cosmos, and my will knows where to turn. My heart swells with ever greater reverence.\"",
      "overlap_context": "ngside humanity since the very beginning—it is not unique to the present age. Generally, warfare arises from human might. The possession of might is an innate quality bestowed by Heaven.\" Human nature, including joy and anger, is fundamentally received from Heaven. \"Anger gives rise to might, and might gives rise to the origins of warfare. Thus, the roots of warfare extend far back into antiquity. There has never been even a brief moment when it was not employed.\" *Shaoxuan* means a short while.",
      "start_char": 21168,
      "end_char": 22503,
      "start_sentence": 1330,
      "end_sentence": 1404,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.15913414955139,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\洞灵真经注.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 23,
      "original_text": "既闻义兵之道，鄙其奸傲之心，故气志盈满，充塞宇宙，志知所如也。 於是步前称音觞为亢仓子寿， 举步前进称默寿，所以严师重道也。 拜居首列师位，严于斋室。 又月涉旬，辰加天关，白昼行道。 天关，即天纲，谓辰时也。 行道，行弟子礼也。 洞灵真经卷下竟 #1 明：原作『功』，据宋刊本改。 #2 门：原作『问』，据宋刊本改。 #3 奄：原作『问』据宋刊本改。 #4 膳：宋刊本作『饥』。 #5 馔： 原作『膳』，据宋刊本改。 #6 交相：原作『柌』，据宋刊本改。 #7 臣：原作『口』，据宋刊本改。 #8 足：原作『是』，据宋刊本改。 #9 生：原作『主』，据宋刊本改。 #10 舂：原作『春』，据宋刊本改。 #11 毅：宋刊本作『秩』。",
      "translated_text": "Having heard the Way of the righteous army, he cast aside his deceitful and arrogant heart, and thus his qi and will swelled to fill the cosmos, his purpose knowing where to turn. Thereupon, he stepped forward, raised his voice in a toast, and wished Master Kangcang longevity. With each step he advanced, he silently offered blessings, thereby honoring the master and revering the Way. He bowed and took his place at the head of the disciples’ ranks, maintaining strict observance in the purification chamber.\n\nFor over a month, at the hour when the celestial gate opened—*Tian Guan*, that is, the *chen* hour—he practiced the Way by day. *Tian Guan* refers to the celestial net, meaning the *chen* hour. *Practicing the Way* means performing the rites of a disciple.\n\nHere ends the lower scroll of the *Dongling Zhenjing*.",
      "overlap_context": "ut many lives—who would not rejoice? Thus, when a righteous army arrives, the people of neighboring states flock to it like flowing water, and the people of the conquered state look upon it as parents. The farther it advances, the more people it gains.\n\nBefore the words were finished, Lord Jing rose, bowed deeply, and said: \"I have been fortunate to hear your teachings, Master. Unknowingly, my spirit fills the cosmos, and my will knows where to turn. My heart swells with ever greater reverence.\"",
      "start_char": 22503,
      "end_char": 22851,
      "start_sentence": 1405,
      "end_sentence": 1423,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 5.005768299102783,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\洞灵真经注.txt",
        "category": "玉诀类"
      }
    }
  ]
}