{
  "source_id": "洞真三天秘讳",
  "source_file": "chunked_daozang\\洞真三天秘讳.json",
  "total_chunks": 3,
  "total_original_chars": 2625,
  "total_translated_chars": 16233,
  "total_translation_time": 80.90416073799133,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\洞真三天秘讳.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Esoteric Secret Taboos of the Three Heavens of the Cavern of Perfection**\n\n**Scripture Title:** *The Esoteric Secret Taboos of the Three Heavens of the Cavern of Perfection*\n**Author:** Unknown, likely composed during the Northern and Southern Dynasties. An early manual of cultivation methods from the Heavenly Master Dao.\n**Volume:** One.\n**Source Text:** *Zhengtong Daoist Canon*, Orthodox Section, Part One.\n\n---\n\n**The Esoteric Secret Taboos of the Three Heavens of the Cavern of Perfection**\n\nFor all who receive the Three and Five, first visualize the true names of the Three Heavens and the true names of the Three Masters. In times of urgent calamity, distress, or illness, loudly invoke the names of the Three Heavens thrice, and secretly call upon the names of the Three Masters—thus shall all disasters and illnesses be dispelled.\n\nThe true name of the Upper Clarity Subtle Heaven is *Fang*.\nThe true name of the Middle Yu-Yu Heaven is *Yuan*.\nThe true name of the Lower Great Red Heaven is *Deqiu*.\nThese are the true names of the Three Heavens.\n\nThe true name of the Left Primordial Supreme Perfected is *Yan*.\nThe true name of the Right Mysterious Elder Perfected is *Yi*.\nThe true name of the Central Supreme Perfected is *Xu*.\nThese are the true names of the Three Masters.\n\nThose who know the true names of the Three Heavens and Three Masters shall attain longevity and immortality. Yet if one’s visualization is inconsistent, or if virtuous conduct is incomplete, occasional misfortunes may arise. These may be dissolved by pacing the stellar net, invoking the Celestial Tortoise’s celestial undulations, and reciting the proper incantations—all of which shall prove efficacious. One must also constantly visualize the taboo names of the Dipper Terrace; forget not, forget not.\n\nWhenever one unfolds the stellar chart or paces the steps while visualizing, as well as upon rising at dawn or retiring at dusk, one must first knock the teeth nine times and secretly invoke the names of the Nine Stars, saying:\n\n1. The essence of the First Great Star is named *Xuanshu*. May I, [one’s name], ascend as a flying immortal, riding the void and steering the floating.\n2. The essence of the Second Primordial Star is named *Beitai*. May I, [one’s name], wander as a flying immortal upon the Terrace of the Flourishing.\n3. The essence of the Third Perfected Star is named *Nine Ultimates of the Supreme Perfected*. May I, [one’s name], govern the Three Clouds as a flying immortal.\n4. The essence of the Fourth Pivot Star is named *Xuan’gen*. May my name be recorded among the flying immortals.\n5. The essence of the Fifth Net Star is named *Celestial Balance*. May I, [one’s name], ascend and traverse the Upper Clarity as a flying immortal.\n6. The essence of the Sixth Chronicle Star is named *Destiny’s Mechanism*. May my name be inscribed in the Grand Tenuity as a flying immortal.\n7. The essence of the Seventh Pass Star is named *Mysterious Yang*. May I, [one’s name], command the Jade Lads as a flying immortal.\n8. The essence of the Eighth Emperor Star is named *Supreme Jade Sovereign on High*. May I, [one’s name], ascend the hall of the Latter Sage as a flying immortal.\n9. The essence of the Ninth Venerable Star is named *Emperor Lord of the Grand Tenuity*. May I, [one’s name], enter the cinnabar-jade chamber as a flying immortal.\n\nUpon completing these nine incantations, knock the teeth nine times. If, during the practice, fire arises within the mouth, this signifies attainment of the Dao.\n\nWhen encountering malevolent ghosts or wicked persons, immediately visualize the Dipper’s stars pointing at them. Hold the breath and silently recite: *\"I am the Celestial Eye, one with Heaven. I expel spirits like thunder and lightning, illuminating the eight directions, penetrating all within and without. Nothing shall resist me.\"* Thus shall all treacherous ghosts, myriad demons, and hosts of misfortune dare not assail you.\n\n**The Dipper Repose Method**\n\nThe Dipper’s stars are the purple canopy of the Supreme Ultimate, the numinous palace of the Mysterious Perfected, the divine seat of the Nine Stars, and the reclining chamber of the Celestial Honored One. Those who study the Perfected receive this from the Celestial Honored One, who instructs them to repose within the Dipper. At night, while lying down, visualize the Dipper’s stars above the mat, aligning the head with the Nine Ultimates. Let the true qi enter the Mud Pill Palace, the feet tread upon the Venerable Emperor’s two stars, and the heart recite the flying immortal’s command: *\"May the Supreme on High restrain my seven po, and may the Grand Tenuity govern my three hun.\"* Grasp the Northern Terrace with the left hand and hold the Jade Armillary with the right. After practicing this for eighteen years, one’s complexion shall revert to that of an infant. The essences of the Nine Stars shall transform into Nine Elders, all coming to welcome you, ascending at dawn into the light of day.\n\n**For Responding to Summons to Save Others from Disasters**\n\nWhen called to save others from calamity, proceed three steps outside the household gate. Stand upright, knock the teeth three times, and secretly invoke the names of the Seven Stars’ hun and po. Recite the incantation as when pacing the stellar steps, intently visualizing the divine stars. Even in haste, perform both the pacing and the incantation. Upon completion, clench the fists firmly. Thirty paces from the destination, visualize fire burning the household of the afflicted, reducing it to ashes. Advance twenty-five paces, visualize the kidneys as water, extinguishing the fire and restoring the house anew. Upon reaching the gate, knock the teeth twenty times and perform the Yu Step nine times. Enter the gate, visualizing the names of the Three Generals and their troops encircling your form. Further visualize the Five Stars’ Generals of the Five Directions, and the Four Greatnesses and Seven Stars, with the Floral Canopy covering your head. Proceed without fear. Sit facing the monthly establishment and the yearly sovereign; if this is inconvenient, first face them, hold the breath, then take your seat. If the seat aligns with the daily establishment and the yearly sovereign, it is auspicious—only avoid the *po* and *bi* days. In all movements, exits, and entries, maintain vigilance. Once seated, recite the incantation. Upon completion, instruct the host to sweep and purify the courtyard (or the hall if raining). Arrange the mat and incense fire, facing east by day and north by night. Place a basin of water before the mat, with a great blade upon it. Calculate the time according to the Dipper’s position, adding the Ghost Gate hour. The host shall present the petition, bow, and invite the Daoist, who shall gird himself, take his seat, rinse his mouth, and ignite the incense, reciting the oral scripture.\n\n**For Expelling Evil Dreams, Ominous Portents, Death, Lingering Illness, Malevolent Persons, Public or Private Oppression, Licentiousness, Theft, and Other Banishments**\n\nAt the year’s beginning, to sever pestilence, epidemic diseases, and great plagues, or to transform and exchange qi for widespread blessings, prepare a large basin filled with water, fine sand, pebbles, and several *dou* of red beans, adjusting the quantity according to the dwelling’s size. Store these pure substances at the Ghost Gate. Perform the ritual on the six auspicious days according to the method.\n\nDuring the *jiayin*旬, *xinyou* and *renxu* are inauspicious; all other days are auspicious.\n\nUpon completion of the affair, sitting, consuming remaining food, or resting—each action has its corresponding incantation. If the illness is urgent and banishment cannot be performed, proceed to the patient’s side, recite the incantation over a bowl of water, and sprinkle it thrice to conclude. Then, visualize the divine spirits adorning your garments, face the Nine Stars, and secretly recite: *\"Day remains unhurried, Sun Lady of Grand Yang, Old Lord of Supreme Yang, eyes of Zou Suo Nuo Tuo, carve into my heart. Eight thousand, also Water Mother, disciple may complete the pacing of the stellar net, descending the stars, gazing into darkness. Hover a foot above the ground, bones and joints all crimson, as if newly born. Visualize the left eye as the sun, the right as the moon. Green Dragon and White Tiger, the Five Spirits all present. Seven stars above the head, seven stars below the feet. Left hand pointing to the earth, eyes gazing at the Northern Dipper. Secretly invoke the fifteen words: Li Luo Yao Yu Su, Shen Ming Zhu Su Fan Guang Xing Tun Xuan Mao. Conclude by transforming the form with both hands.\"*\n\nAdorning the jade gate as the host of stars, the mouth becomes the Slayer of Malevolence. The left hand is the Annihilator of Doom, five-headed and single-bodied; the right hand is the Punisher of Rebellion, five-headed and single-bodied, to cure illness and subdue calamities. This done, next face the Perfected One’s star and state your rank and name, respectfully declaring:\n\n*\"Supreme Lord Lao, Supreme Elder, Celestial Master, Female Master, Three Masters and Their Ladies, Northern Dipper’s Seven Stars, Generals of the Three and Five—humbly, this fellow Daoist of shared bond, [surname given], has failed in devotion to the Dao and brought upon himself disaster and suffering. On account of this matter, I trace its source and lay it forth: the afflictions of father, mother, brothers, [names given], and so on. With head bowed, I come before you to beseech [request stated], to forge and refine malevolent spirits, febrile poisons, ghostly bandits. This disciple and [name given] share the same eyes and belly—no longer shall we witness such sights. Reverently following the original method of my former master, I perform this rite: may what is prayed for descend, what is summoned arrive, what is suppressed be subdued, what is seized be captured, what is executed be destroyed, what is treated be healed, what is exorcised be repelled. Solemnly, I implore the Supreme and all the Venerable Ones to bestow grace and protection, sheltering this mortal flesh.\"*\n\nThis declared, bow twice again.\n\nShould one encounter official misfortune, illness, or sudden calamity, first perform the Seven Stars Rite. Facing north, raise the head to visualize the Dipper, its crimson radiance blazing forth. Cry out seven times, invoking: \"Northern Dipper, Star of Such-and-Such True Name, Lord of the Kuaigang Prefecture!\" Repeat this sevenfold. State the urgent matter at hand, beseeching deliverance and swift efficacy from the Lord of the Kuaigang Seven Stars and all stellar officials. Offer pure wine, incense cakes, fresh fruits, and choice delicacies as a sacrificial feast, rewarding merit and upholding vows. Depart without hesitation once the wish is granted.\n\nPrepare seven measures of clear wine, seven measures of dried jujubes and chestnuts, and ten ounces of aloeswood. Arrange five incense burners, one for each direction, and purify the altar ground. At midnight, in a secluded place, set up the offerings in stillness. Cry out seven times to summon the Lord, then kneel, bow seven times, and present the petition. Pour wine seven times, expressing wishes as desired. Upon completion, consume the offerings on the spot, ensuring none remain. If any food is left, bury it at the altar, taking care that neither fowl nor dog sees it.\n\nFor dire emergencies, grave illness, or major exorcisms, face north and cry out three times: \"Northern Dipper, Lord of the Kuaigang Prefecture! Left and Right Three Divisions, Great Generals! Tang, Ge, Zhou, Five Directions, Three Origins Generals! Generals of Inverted Hooks, Heaven-Striking, Earth-Smashing, Rebellion-Quelling, Disaster-Dispersing, Calamity-Repelling, Gold-Armored, Gold-Adorned!\" Invoke the Three Generals, the Divine Soldiers, Ghost-Seizing Envoys, the Three-Five Hosts, and the Red Qi Officials and Troops. State the matter at hand, beseeching swift deliverance. Prepare the exorcism offerings to recompense their toil, upholding the vow of faith. Depart without hesitation once the wish is granted. Follow the subsequent rites.\n\nFor urgent matters, perform the Three-Five Kitchen Rite. Face east and cry out three times: \"Red Heaven Three-Five, Left and Right Great Generals! Supreme Three Venerables!\" State the matter, beseeching swift deliverance. Prepare a feast for the specified number of attendees, promising rewards for merit and upholding the vow. Offer a crimson silk banner of fifty feet as the principal token, with additional lengths of twenty, forty, fifty, seventy, or ninety feet—up to fifteen feet—commensurate with the severity of the calamity and the household’s means. The wish shall be granted accordingly.\n\nNow I set forth the Ten Precepts of the Highest Grade, which may ferry beings across, widely open the gates of conversion, and guide them into the Dao. Those who diligently observe them shall attain the natural blessings of the effortless Way.\n\nThe Ten Precepts are as follows:\n1. Do not envy those superior to oneself or suppress the wise and perceptive.\n2. Do not drink wine, indulge in licentiousness, or defile the Three Palaces.\n3. Do not commit adultery with another’s spouse or covet lewd pleasures.\n4. Do not abandon the elderly, sick, impoverished, or lowly.\n5. Do not slander the virtuous or malign fellow disciples.\n6. Do not hoard treasures and refuse to bestow alms.\n7. Do not kill living beings or sacrifice to the Six Heavenly Ghosts.\n8. Do not dismiss scriptures as false and absurd.\n9. Do not betray the kindness of teachers or deceive new disciples.\n10. Maintain equanimity, benevolence, and filial piety toward all.\n\nThese Ten Precepts are universally taught throughout the boundless worlds. Those who uphold them shall have their merit recorded in the Ten Heavens, their blessings extended to nine generations, and be delivered from the eternal night of the Nine Dark Realms. They shall ascend to the Southern Palace, their bodies entering radiant light, their karma unbroken, and attain the immortality of the divine transcendent. All practices fulfilled, they shall shun the Ten Evils and distance themselves from the path of blindness.\n\nThe Ten Evils are as follows:\n1. Indulging in wine, lust, and insatiable desire.\n2. Secretly harming the world and slandering Daoists.\n3. Disrespecting teachers, scorning the Dao, and slighting the Three Treasures.\n4. Stealing scriptures and recklessly divulging the essentials of the Dao.\n5. Borrowing without repayment, deceiving the masses.\n6. Killing living beings for taste, harboring deceit in speech.\n7. Being unfilial, ungrateful, and violating prohibitions.\n8. Reciting scriptures carelessly, arrogantly dismissing others.\n9. Demanding compliance with one’s will, harboring resentment toward all.\n10. Arbitrarily interpreting scriptures, altering sacred texts, disbelieving in predestination, indulging in base desires, defiling the Four Great Elements, and neglecting the path of life.\n\nThose who cannot free themselves from these Ten Evils shall suffer myriad misfortunes: malevolent spirits shall harm their lives, inflicting endless torment. Good deeds shall be met with misfortune, all ventures shall fail, and upon death, they shall descend into hell, confined in heavy fetters within eternal night. Deprived of the Three Lights, they shall drift day and night, embracing copper pillars, treading upon knife mountains, circling sword trees, plunging into cauldrons of boiling liquid, swallowing fire and devouring coals. Enduring the Five Sufferings, they shall forever sink into the Nine Dark Realms, without hope of rebirth. Even if delivered, they shall return as beasts of burden, barred from the human realm. Evil begets evil, good begets good—the opposition of sin and blessing is as the light of sun and moon. The unending cycle of life and death follows like a shadow clings to form, ever-turning like a wheel. Now these precepts are expounded to protect and ferry celestial and mortal beings. Clearly recognize and sincerely receive them, practicing diligently without forgetfulness.\n\nThe Secret Names of the Three Heavens of the Cavernous True are concluded.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞真三天秘讳 经名：洞真三天秘讳。 撰人不详，似出於南北朝。 系早期天师道修行法诀。 一卷。 底本出处：《正统道藏》正一部。 洞真三天秘讳 凡受三五，先存识三天真名，三师真名，有急灾困病，三声大唤三天名，密唤三师名，灾病皆消也。 上清微天真名防， 中禹余天真名元， 下太赤天真名德丘。 右三天真名。 左元上真名， 右玄老真名， 中央太上真名 右三师真名。 凡知三天三师真名，长生不死，其间存之不恒，行善未备，时有灾厄，步纲消之，不得行神龟天娇直禹步步星，咒愿亦验，又常应存斗讳台名也，勿忘勿忘。 凡开星图及步时存思，并晨起夕卧，皆先叩齿九通，阴祝九星，名曰： 第一太星精名玄枢，愿某飞仙乘虚驾浮。 第二元星精名北台，愿某飞仙游行洞台。 第三真星精名九极上真，愿某飞仙得治三云。 第四纽星精名璇根，愿某名列为飞仙。 第五纲星精名天平，愿某飞仙登行上清。 第六纪星精名命机，愿某飞仙名书太微。 第七关星精名玄阳，愿某飞仙得使玉童。 第八帝星精名高上玉皇，愿某飞仙得登后圣之堂。 第九尊星精名太微帝君，愿某飞仙得入丹瑶玉房。 右九咒毕，叩齿九通，行随意外有口中火者，达乎道也。 凡见凶鬼恶人，即存斗星指之，闭气心祝曰：吾是天目与天相，逐精若雷电，明耀八域，彻知表裹，无物不伏，如此则奸凶万鬼祸恶众辈莫敢犯子。 卧斗诀 斗星者，太极之紫盖，玄真之灵阙，九星之神席，天尊之偃房，学真之士，天尊授之，使其偃息斗中，暮卧存斗星，在所卧席上依图首九极，使真气入泥丸，足蹑尊帝二星，心念飞仙令，高上拘我七魄，太微制我三魂，左手把北台，右手执璇玑，行之十八年，色反婴童，九星之精变成九老，俱来迎子，白日登晨。 凡能赴请为人救灾严就行出家门外三步，正立叩齿三通，阴唤七星魂魄名，密咒依如步法咒时临目谛存神星，虽急急急亦并行并咒存咒毕，握固勿已，未至所往之家三十步，心存为火烧，所往人家屋舍荡尽，前进二十五步存肾为水，往杀火，作新屋舍立具，至门扣齿二十通，仍禹步九迹，入门存三将军姓名兵众，周绕身形。 又存五方五星将军，又存四大七星，华盖覆头，径入旡畏，入坐向月建岁王，不便者先向之闭气，就座得向日时建王，亦善唯勿用破闭，起止出入，常存慎之，坐定咒，咒毕命主人扫酒堂庭，晴则庭中，雨则堂内，施席香火，昼向东，夜向北，盆水置席前，大刀置盆上，计取斗中，加鬼门时主人投辞，拜请道士束带就座，漱口发炉，捻香口章。 凡恶梦光怪死丧滞病凶人，公私侵凌淫盗，皆用驱除若年初断绝瘟疫及邪病大疠炼易，故气流布祈恩，悉以大盆盛水细沙石子，数斗赤豆随多少宅大小取足净物，贮之置鬼门上，六吉日依法施行。 甲寅旬，辛酉壬戌凶，余日皆吉。 事毕坐及余食卧息便旋出还皆有咒，若有病急不得驱除，至病人前咒，一瓯水盛灵，吩漱散之三过止，仍存神配衣讫，向九星阴咒之，日留不徐冉太阳夫人老君阳太上眼邹索诺橐头刻心我八千亦水女母门人可毕见步纲竟下星冥目视，去地尺许，骨节尽赤，如新生形存，左目为日，右目为月，青龙白虎五神备具，头上七星，足下七星，左手指地，目视北斗，阴唤十五言离罗耀郁俗神明珠苏樊光性吞玄茂毕下手变形存两耳",
      "translated_text": "**The Esoteric Secret Taboos of the Three Heavens of the Cavern of Perfection**\n\n**Scripture Title:** *The Esoteric Secret Taboos of the Three Heavens of the Cavern of Perfection*\n**Author:** Unknown, likely composed during the Northern and Southern Dynasties. An early manual of cultivation methods from the Heavenly Master Dao.\n**Volume:** One.\n**Source Text:** *Zhengtong Daoist Canon*, Orthodox Section, Part One.\n\n---\n\n**The Esoteric Secret Taboos of the Three Heavens of the Cavern of Perfection**\n\nFor all who receive the Three and Five, first visualize the true names of the Three Heavens and the true names of the Three Masters. In times of urgent calamity, distress, or illness, loudly invoke the names of the Three Heavens thrice, and secretly call upon the names of the Three Masters—thus shall all disasters and illnesses be dispelled.\n\nThe true name of the Upper Clarity Subtle Heaven is *Fang*.\nThe true name of the Middle Yu-Yu Heaven is *Yuan*.\nThe true name of the Lower Great Red Heaven is *Deqiu*.\nThese are the true names of the Three Heavens.\n\nThe true name of the Left Primordial Supreme Perfected is *Yan*.\nThe true name of the Right Mysterious Elder Perfected is *Yi*.\nThe true name of the Central Supreme Perfected is *Xu*.\nThese are the true names of the Three Masters.\n\nThose who know the true names of the Three Heavens and Three Masters shall attain longevity and immortality. Yet if one’s visualization is inconsistent, or if virtuous conduct is incomplete, occasional misfortunes may arise. These may be dissolved by pacing the stellar net, invoking the Celestial Tortoise’s celestial undulations, and reciting the proper incantations—all of which shall prove efficacious. One must also constantly visualize the taboo names of the Dipper Terrace; forget not, forget not.\n\nWhenever one unfolds the stellar chart or paces the steps while visualizing, as well as upon rising at dawn or retiring at dusk, one must first knock the teeth nine times and secretly invoke the names of the Nine Stars, saying:\n\n1. The essence of the First Great Star is named *Xuanshu*. May I, [one’s name], ascend as a flying immortal, riding the void and steering the floating.\n2. The essence of the Second Primordial Star is named *Beitai*. May I, [one’s name], wander as a flying immortal upon the Terrace of the Flourishing.\n3. The essence of the Third Perfected Star is named *Nine Ultimates of the Supreme Perfected*. May I, [one’s name], govern the Three Clouds as a flying immortal.\n4. The essence of the Fourth Pivot Star is named *Xuan’gen*. May my name be recorded among the flying immortals.\n5. The essence of the Fifth Net Star is named *Celestial Balance*. May I, [one’s name], ascend and traverse the Upper Clarity as a flying immortal.\n6. The essence of the Sixth Chronicle Star is named *Destiny’s Mechanism*. May my name be inscribed in the Grand Tenuity as a flying immortal.\n7. The essence of the Seventh Pass Star is named *Mysterious Yang*. May I, [one’s name], command the Jade Lads as a flying immortal.\n8. The essence of the Eighth Emperor Star is named *Supreme Jade Sovereign on High*. May I, [one’s name], ascend the hall of the Latter Sage as a flying immortal.\n9. The essence of the Ninth Venerable Star is named *Emperor Lord of the Grand Tenuity*. May I, [one’s name], enter the cinnabar-jade chamber as a flying immortal.\n\nUpon completing these nine incantations, knock the teeth nine times. If, during the practice, fire arises within the mouth, this signifies attainment of the Dao.\n\nWhen encountering malevolent ghosts or wicked persons, immediately visualize the Dipper’s stars pointing at them. Hold the breath and silently recite: *\"I am the Celestial Eye, one with Heaven. I expel spirits like thunder and lightning, illuminating the eight directions, penetrating all within and without. Nothing shall resist me.\"* Thus shall all treacherous ghosts, myriad demons, and hosts of misfortune dare not assail you.\n\n**The Dipper Repose Method**\n\nThe Dipper’s stars are the purple canopy of the Supreme Ultimate, the numinous palace of the Mysterious Perfected, the divine seat of the Nine Stars, and the reclining chamber of the Celestial Honored One. Those who study the Perfected receive this from the Celestial Honored One, who instructs them to repose within the Dipper. At night, while lying down, visualize the Dipper’s stars above the mat, aligning the head with the Nine Ultimates. Let the true qi enter the Mud Pill Palace, the feet tread upon the Venerable Emperor’s two stars, and the heart recite the flying immortal’s command: *\"May the Supreme on High restrain my seven po, and may the Grand Tenuity govern my three hun.\"* Grasp the Northern Terrace with the left hand and hold the Jade Armillary with the right. After practicing this for eighteen years, one’s complexion shall revert to that of an infant. The essences of the Nine Stars shall transform into Nine Elders, all coming to welcome you, ascending at dawn into the light of day.\n\n**For Responding to Summons to Save Others from Disasters**\n\nWhen called to save others from calamity, proceed three steps outside the household gate. Stand upright, knock the teeth three times, and secretly invoke the names of the Seven Stars’ hun and po. Recite the incantation as when pacing the stellar steps, intently visualizing the divine stars. Even in haste, perform both the pacing and the incantation. Upon completion, clench the fists firmly. Thirty paces from the destination, visualize fire burning the household of the afflicted, reducing it to ashes. Advance twenty-five paces, visualize the kidneys as water, extinguishing the fire and restoring the house anew. Upon reaching the gate, knock the teeth twenty times and perform the Yu Step nine times. Enter the gate, visualizing the names of the Three Generals and their troops encircling your form. Further visualize the Five Stars’ Generals of the Five Directions, and the Four Greatnesses and Seven Stars, with the Floral Canopy covering your head. Proceed without fear. Sit facing the monthly establishment and the yearly sovereign; if this is inconvenient, first face them, hold the breath, then take your seat. If the seat aligns with the daily establishment and the yearly sovereign, it is auspicious—only avoid the *po* and *bi* days. In all movements, exits, and entries, maintain vigilance. Once seated, recite the incantation. Upon completion, instruct the host to sweep and purify the courtyard (or the hall if raining). Arrange the mat and incense fire, facing east by day and north by night. Place a basin of water before the mat, with a great blade upon it. Calculate the time according to the Dipper’s position, adding the Ghost Gate hour. The host shall present the petition, bow, and invite the Daoist, who shall gird himself, take his seat, rinse his mouth, and ignite the incense, reciting the oral scripture.\n\n**For Expelling Evil Dreams, Ominous Portents, Death, Lingering Illness, Malevolent Persons, Public or Private Oppression, Licentiousness, Theft, and Other Banishments**\n\nAt the year’s beginning, to sever pestilence, epidemic diseases, and great plagues, or to transform and exchange qi for widespread blessings, prepare a large basin filled with water, fine sand, pebbles, and several *dou* of red beans, adjusting the quantity according to the dwelling’s size. Store these pure substances at the Ghost Gate. Perform the ritual on the six auspicious days according to the method.\n\nDuring the *jiayin*旬, *xinyou* and *renxu* are inauspicious; all other days are auspicious.\n\nUpon completion of the affair, sitting, consuming remaining food, or resting—each action has its corresponding incantation. If the illness is urgent and banishment cannot be performed, proceed to the patient’s side, recite the incantation over a bowl of water, and sprinkle it thrice to conclude. Then, visualize the divine spirits adorning your garments, face the Nine Stars, and secretly recite: *\"Day remains unhurried, Sun Lady of Grand Yang, Old Lord of Supreme Yang, eyes of Zou Suo Nuo Tuo, carve into my heart. Eight thousand, also Water Mother, disciple may complete the pacing of the stellar net, descending the stars, gazing into darkness. Hover a foot above the ground, bones and joints all crimson, as if newly born. Visualize the left eye as the sun, the right as the moon. Green Dragon and White Tiger, the Five Spirits all present. Seven stars above the head, seven stars below the feet. Left hand pointing to the earth, eyes gazing at the Northern Dipper. Secretly invoke the fifteen words: Li Luo Yao Yu Su, Shen Ming Zhu Su Fan Guang Xing Tun Xuan Mao. Conclude by transforming the form with both hands.\"*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1338,
      "start_sentence": 0,
      "end_sentence": 35,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.08063817024231,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真三天秘讳.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "为玉门熨发为众星，口为斩邪使者。 左手灭亡使者五头一身，右手伐逆使者五头一身，以治病摧伏灾害。 讫，次向真人星称位姓名，谨启： 太上老君，太上丈人，天师女师，三师夫人，北斗七星，三五将军，谨有同义男女姓某，奉法失忠，招灾抱考，因有事者，依源陈之，父母兄弟某疾厄，云云，稽颗诣臣求乞云云。 锻炼凶邪温毒鬼贼，臣与某义同腹目，不复所见，谨按先师本法奉修，所受愿所请者下，所召者到，所厌者伏，所收者擒，所诛者灭，所治者愈，所禳者却，恩唯太上众尊乞垂恩佑，覆盖肉人。 谨启。 毕，再拜。",
      "translated_text": "Adorning the jade gate as the host of stars, the mouth becomes the Slayer of Malevolence. The left hand is the Annihilator of Doom, five-headed and single-bodied; the right hand is the Punisher of Rebellion, five-headed and single-bodied, to cure illness and subdue calamities. This done, next face the Perfected One’s star and state your rank and name, respectfully declaring:\n\n*\"Supreme Lord Lao, Supreme Elder, Celestial Master, Female Master, Three Masters and Their Ladies, Northern Dipper’s Seven Stars, Generals of the Three and Five—humbly, this fellow Daoist of shared bond, [surname given], has failed in devotion to the Dao and brought upon himself disaster and suffering. On account of this matter, I trace its source and lay it forth: the afflictions of father, mother, brothers, [names given], and so on. With head bowed, I come before you to beseech [request stated], to forge and refine malevolent spirits, febrile poisons, ghostly bandits. This disciple and [name given] share the same eyes and belly—no longer shall we witness such sights. Reverently following the original method of my former master, I perform this rite: may what is prayed for descend, what is summoned arrive, what is suppressed be subdued, what is seized be captured, what is executed be destroyed, what is treated be healed, what is exorcised be repelled. Solemnly, I implore the Supreme and all the Venerable Ones to bestow grace and protection, sheltering this mortal flesh.\"*\n\nThis declared, bow twice again.",
      "overlap_context": "ars, gazing into darkness. Hover a foot above the ground, bones and joints all crimson, as if newly born. Visualize the left eye as the sun, the right as the moon. Green Dragon and White Tiger, the Five Spirits all present. Seven stars above the head, seven stars below the feet. Left hand pointing to the earth, eyes gazing at the Northern Dipper. Secretly invoke the fifteen words: Li Luo Yao Yu Su, Shen Ming Zhu Su Fan Guang Xing Tun Xuan Mao. Conclude by transforming the form with both hands.\"*",
      "start_char": 1338,
      "end_char": 1574,
      "start_sentence": 36,
      "end_sentence": 42,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.592930793762207,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真三天秘讳.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "凡有官灾疾病、急卒灾厄，初下七星祭，向北仰头存见斗星，赤光赫然，仍大唤七声，唤曰北斗某星真讳魁纲府君，如此七遍。 某今有某事急切云云，乞丐救济须效即为魁纲七星府君，七星诸官设祭，奉上清酒香饼新果正味，报赏有功，不负信誓，便去勿顾，如愿即解，用清酒七胜乾枣栗子七胜沉香十两，五方香炉各一具，洁坛场之法，夜半时於无人处静寐为之施设毕，七声大唤，请下府君礼七拜跪启乞。 随丰言之，凡七过上酒，愿随意说之。 毕，於座食之，令尽法，不得遗分他人。 临时食不尽，埋坛上，忌鸡犬见之，若急事厄难困病下大醮，向北三声大唤唤北斗魁纲府君，左右三部大将军，唐葛周五方三元将军，颠倒钩天击地斩伐击逆消灾散祸金铠金装大将军，三将军力士捕鬼使者三五众官赤气吏兵。 某今某事云云，乞丐救济须效奉设醮具，以报劳苦，不负效信，还勿顾如愿即解。 依后仪式。 若有大事卒急下三五厨，向东三声大唤赤天三五左右大将军，太上三尊。 某今有事云云，乞丐救济须效即设某厨如干人，言功报赏不负效信，真绛五十尺为纲头信，次二十尺，亦用四十尺，五丈七丈九丈，极十五丈，随灾轻重及家贫富量之，如愿即解。 今撰上品十诚之律，可以度人，广加开化，令入法门，勤奉之者，则得自然之福无为之道也。 十诚者，一者，不得嫉妬胜己，抑绝肾明。 二者，不得饮酒放荡秽乱三宫。 三者，不得淫犯他妻，好贪细滑。 四者，不得弃薄老病穷贱之人。 五者，不得诽谤善人毁攻同学。 六者，不得贪积珍宝，弗肯施散。 七者，不得杀生祠祀六天鬼神。 八者，不得评论经典，以为虚诞。 九者，不得背师恩爱，欺诈新学。 十者，平等一心，仁孝一切。 此十诫普教十方无极世界，开度一切能奉之者，功书十天，福延九祖，拔出长夜九幽之中，上升南宫，身入光明，因绿不绝，克得神仙。 诸行并足，当避十恶远於盲道。 十恶者，一者，饮酒淫色贪欲无已。 二者，阴贼世间讪谤道士。 三者，轻师慢法，傲忽三宝。 四者，窃取经书妄宣道要。 五者，借换不还，欺诱万民，六者，杀生贪味，口是心非。 七者，不孝背恩违义，犯诸禁忌。 八者，诵经忽略，唝嗃自是。 九者，责望人意，瞋恚四辈。 十者，臆断经旨，损益圣典，不信宿命，快情所为，秽慢四大，不念生道。 此十恶之诫不能离身，犯之者身遭众横鬼神害命，考楚万痛恒无一宁，履善遇恶万向失利，死入地狱，幽闭重槛长夜之中，不赌三光，昼夜流曳，抱铜柱，履刀山，循剑树，入镬汤，吞火食炭，五苦备经，长沦九幽，无有生时，纵得解脱，还生六畜之中，不得人道，恶恶相牵，善善相因，罪福之对如日月之垂光，生死之不灭，如影之随形，绿转相加，如车之轮，今说是诚，护度天人，明识谛受，勤行勿忘矣。 洞真三天秘讳竟",
      "translated_text": "Should one encounter official misfortune, illness, or sudden calamity, first perform the Seven Stars Rite. Facing north, raise the head to visualize the Dipper, its crimson radiance blazing forth. Cry out seven times, invoking: \"Northern Dipper, Star of Such-and-Such True Name, Lord of the Kuaigang Prefecture!\" Repeat this sevenfold. State the urgent matter at hand, beseeching deliverance and swift efficacy from the Lord of the Kuaigang Seven Stars and all stellar officials. Offer pure wine, incense cakes, fresh fruits, and choice delicacies as a sacrificial feast, rewarding merit and upholding vows. Depart without hesitation once the wish is granted.\n\nPrepare seven measures of clear wine, seven measures of dried jujubes and chestnuts, and ten ounces of aloeswood. Arrange five incense burners, one for each direction, and purify the altar ground. At midnight, in a secluded place, set up the offerings in stillness. Cry out seven times to summon the Lord, then kneel, bow seven times, and present the petition. Pour wine seven times, expressing wishes as desired. Upon completion, consume the offerings on the spot, ensuring none remain. If any food is left, bury it at the altar, taking care that neither fowl nor dog sees it.\n\nFor dire emergencies, grave illness, or major exorcisms, face north and cry out three times: \"Northern Dipper, Lord of the Kuaigang Prefecture! Left and Right Three Divisions, Great Generals! Tang, Ge, Zhou, Five Directions, Three Origins Generals! Generals of Inverted Hooks, Heaven-Striking, Earth-Smashing, Rebellion-Quelling, Disaster-Dispersing, Calamity-Repelling, Gold-Armored, Gold-Adorned!\" Invoke the Three Generals, the Divine Soldiers, Ghost-Seizing Envoys, the Three-Five Hosts, and the Red Qi Officials and Troops. State the matter at hand, beseeching swift deliverance. Prepare the exorcism offerings to recompense their toil, upholding the vow of faith. Depart without hesitation once the wish is granted. Follow the subsequent rites.\n\nFor urgent matters, perform the Three-Five Kitchen Rite. Face east and cry out three times: \"Red Heaven Three-Five, Left and Right Great Generals! Supreme Three Venerables!\" State the matter, beseeching swift deliverance. Prepare a feast for the specified number of attendees, promising rewards for merit and upholding the vow. Offer a crimson silk banner of fifty feet as the principal token, with additional lengths of twenty, forty, fifty, seventy, or ninety feet—up to fifteen feet—commensurate with the severity of the calamity and the household’s means. The wish shall be granted accordingly.\n\nNow I set forth the Ten Precepts of the Highest Grade, which may ferry beings across, widely open the gates of conversion, and guide them into the Dao. Those who diligently observe them shall attain the natural blessings of the effortless Way.\n\nThe Ten Precepts are as follows:\n1. Do not envy those superior to oneself or suppress the wise and perceptive.\n2. Do not drink wine, indulge in licentiousness, or defile the Three Palaces.\n3. Do not commit adultery with another’s spouse or covet lewd pleasures.\n4. Do not abandon the elderly, sick, impoverished, or lowly.\n5. Do not slander the virtuous or malign fellow disciples.\n6. Do not hoard treasures and refuse to bestow alms.\n7. Do not kill living beings or sacrifice to the Six Heavenly Ghosts.\n8. Do not dismiss scriptures as false and absurd.\n9. Do not betray the kindness of teachers or deceive new disciples.\n10. Maintain equanimity, benevolence, and filial piety toward all.\n\nThese Ten Precepts are universally taught throughout the boundless worlds. Those who uphold them shall have their merit recorded in the Ten Heavens, their blessings extended to nine generations, and be delivered from the eternal night of the Nine Dark Realms. They shall ascend to the Southern Palace, their bodies entering radiant light, their karma unbroken, and attain the immortality of the divine transcendent. All practices fulfilled, they shall shun the Ten Evils and distance themselves from the path of blindness.\n\nThe Ten Evils are as follows:\n1. Indulging in wine, lust, and insatiable desire.\n2. Secretly harming the world and slandering Daoists.\n3. Disrespecting teachers, scorning the Dao, and slighting the Three Treasures.\n4. Stealing scriptures and recklessly divulging the essentials of the Dao.\n5. Borrowing without repayment, deceiving the masses.\n6. Killing living beings for taste, harboring deceit in speech.\n7. Being unfilial, ungrateful, and violating prohibitions.\n8. Reciting scriptures carelessly, arrogantly dismissing others.\n9. Demanding compliance with one’s will, harboring resentment toward all.\n10. Arbitrarily interpreting scriptures, altering sacred texts, disbelieving in predestination, indulging in base desires, defiling the Four Great Elements, and neglecting the path of life.\n\nThose who cannot free themselves from these Ten Evils shall suffer myriad misfortunes: malevolent spirits shall harm their lives, inflicting endless torment. Good deeds shall be met with misfortune, all ventures shall fail, and upon death, they shall descend into hell, confined in heavy fetters within eternal night. Deprived of the Three Lights, they shall drift day and night, embracing copper pillars, treading upon knife mountains, circling sword trees, plunging into cauldrons of boiling liquid, swallowing fire and devouring coals. Enduring the Five Sufferings, they shall forever sink into the Nine Dark Realms, without hope of rebirth. Even if delivered, they shall return as beasts of burden, barred from the human realm. Evil begets evil, good begets good—the opposition of sin and blessing is as the light of sun and moon. The unending cycle of life and death follows like a shadow clings to form, ever-turning like a wheel. Now these precepts are expounded to protect and ferry celestial and mortal beings. Clearly recognize and sincerely receive them, practicing diligently without forgetfulness.\n\nThe Secret Names of the Three Heavens of the Cavernous True are concluded.",
      "overlap_context": "e eyes and belly—no longer shall we witness such sights. Reverently following the original method of my former master, I perform this rite: may what is prayed for descend, what is summoned arrive, what is suppressed be subdued, what is seized be captured, what is executed be destroyed, what is treated be healed, what is exorcised be repelled. Solemnly, I implore the Supreme and all the Venerable Ones to bestow grace and protection, sheltering this mortal flesh.\"*\n\nThis declared, bow twice again.",
      "start_char": 1575,
      "end_char": 2658,
      "start_sentence": 43,
      "end_sentence": 75,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.230591773986816,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真三天秘讳.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}