{
  "source_id": "洞真太上八素真经占候入定妙诀",
  "source_file": "chunked_daozang\\洞真太上八素真经占候入定妙诀.json",
  "total_chunks": 4,
  "total_original_chars": 4060,
  "total_translated_chars": 26216,
  "total_translation_time": 125.27003240585327,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\洞真太上八素真经占候入定妙诀.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Wondrous Scripture of the Supreme Cavern of Perfection on the Eight Pure Essentials, Divination, and the Secret of Entering Samādhi**\n\nThe *Wondrous Scripture of the Supreme Cavern of Perfection on the Eight Pure Essentials, Divination, and the Secret of Entering Samādhi* is of uncertain authorship, approximately dating to the Eastern Jin or Southern Dynasties. Originally part of the *Secret of the Eight Pure Essentials*, it later circulated independently as a single fascicle. The present text is derived from the *Zhengtong Daoist Canon*, Section Zhengyi, First Division.\n\n---\n\nThe Supreme Thearch addressed the Perfected Ones of the Four Poles, saying: Those who now steadfastly believe in the Supreme Dao and cultivate its study without ceasing—all such persons have in former lives already accumulated goodness, being born in the heavens above. Yet in the heavens, they indulge in pleasures and make no further progress in merit. When their years are exhausted, they return to the world below, cycling through rebirth. Some, moved by vows, petition to be born in the world to save beings and establish merit, diligently practicing the Supreme Dao—these are no ordinary people. Ordinary people neither perceive nor recognize them; even if they recognize themselves, they do not speak of it.\n\nYet such persons cannot escape misfortune: their kin may decline or perish, their bodies may be afflicted by illness, or they may encounter public or private disputes, hidden or manifest calamities, evil men, hideous ghosts, venomous beasts, birds, or insects, or harm from metal, wood, water, fire, earth, or plants. This arises because their merit is not yet complete, and their reception of the Dao is not yet perfected. They must swiftly purify themselves through fasting, examine their conduct, repent of transgressions, and pray for blessings. They should concentrate their essence on the Supreme, guard the One without forgetfulness, practice the Three and Five, and sincerely recall the Mysterious Master.\n\nThe Mysterious Master, the Lord of the Azure Lad, presides over all scriptures, treasured texts, and wondrous diagrams—all proceed from him. If scholars seek a master but do not meet one, or seek scriptures but do not obtain them; if they obtain them but not in full, or fully but without clarity; if they are clear but do not practice, or practice but not for long; if they err or forget, or recall but then suddenly lose it—these are the workings of deviant spirits or the trials of demonic forces.\n\nThey must swiftly choose an auspicious day, such as the day of *dingmao*, ascend a mountain, enter a chamber, purify themselves, and burn incense. They should petition the Supreme, sincerely visualize the Azure Lad, direct their minds eastward, and imagine the Palace of the Square Cauldron. Bowing their heads in reverence, they face the golden portals of the Highest Ministers, beseeching deliverance from misfortune and hardship. They perform the customary six bows, and upon completion, kowtow and secretly declare their苦志. Whether their troubles are public or private, or their minds are scattered and forgetful, they should state their wishes accordingly. They must address urgent afflictions first, not dwelling on lesser or delayed matters. If both urgent and minor concerns must be mentioned, they should write them in detail. After bowing, they read them silently, and if not finished, burn them afterward in the same manner.\n\nIf their qi and strength are abundant, they may perform twelve, twenty-four, thirty-six, seventy-two, one hundred twenty, two hundred forty, three hundred sixty, seven hundred twenty, or one thousand two hundred bows—completing them at once is best, as focused devotion yields greater benefit. Those unable to do so may perform one hundred bows from the hour of *yin* to *chou* (twelve hours). Others may perform at two hours, such as *yin* and *shen*, or *zi* and *wu*, as they are able. They should practice this once every sixty days, without shifting to other days or hours.\n\nThree to five like-minded companions may join, but no more, to avoid noise and distraction, which would render their efforts ineffective. Advanced scholars must be meticulous and cautious. Only after practicing this method should they transmit scriptures as masters, ensuring the recipient is worthy—thus bestowing without regret.\n\nIf a master transmits scriptures to an unworthy person, or to one who, though worthy, does not follow the proper method, then within twelve ten-day periods, various disasters will converge. They must swiftly petition the Azure Lad, and though suffering may persist, they will also receive blessings, for which they should express gratitude.\n\nAfter receiving the Dao, if one practices according to the method and remains free of illness for ninety days, this indicates that in past and present lives, they have accumulated goodness and are destined for immortality. If for four nine-day periods (three hundred sixty days) their public and private affairs prosper, this shows that their past and present merit is sufficient to align with the Perfected. After three cycles spanning four years and one thousand two hundred days, their merit flourishes, and both the hidden and manifest realms submit in reverence—this marks an advanced scholar of utmost diligence, destined for divinity.\n\nThey may then transmit the teachings, broadly delivering the worthy and enlightened, saving the common and the loving, establishing merit with a compassionate heart, and aiding all without selfishness. Thus, they ascend to the rank of the Most High Sage, Divine Perfected Immortal Lord, or the positions of emperor, king, duke, or minister.\n\nIf, after receiving the Dao, one encounters various hardships and illnesses within a hundred days, this reveals that in past and present lives, they have accumulated many transgressions and are not destined for immortality. They must swiftly repent, vow to reform their conduct, amend past wrongs, and cultivate future goodness. Relying on the support of masters and companions, they should cleanse their remorseful hearts, strengthen their sincere resolve, and cultivate reverence and unwavering faith—thus they will surely attain blessings and benefit.\n\nFor four nine-day periods and three cycles, they should follow this example: establish virtue, perform meritorious deeds, and avoid perilous calamities. They must remain vigilant and fearful, ever mindful of shame and caution, humbled by deep transgressions and ashamed of insufficient merit. They must not act as masters or transmit teachings carelessly. As their virtue gradually ascends, after five eight-year periods (forty years), they may then select a worthy recipient to initiate.\n\nIf, despite misfortune, one forcibly proceeds and rashly becomes a master, both teacher and disciple will lead each other astray—this is an evil karmic connection. Among those of sincere commitment, if one does not observe the fast, the master bears a karmic bond with them. They must pray and petition, confessing transgressions and seeking mercy with utmost sincerity, without pretense or carelessness—neither deceitful in heart nor insincere in speech. They must not boast of their merit to others, but remain devoted and discreet, so that both parties receive blessings. Advanced scholars must clearly understand and adhere to this.\n\nAs long as the cycle of birth and death continues, it is because the roots of transgression have not been eradicated. Moving from yin to yang, in motion and stillness, one commits many faults. When faults accumulate, death follows—a sorrowful suffering that the advanced scholar fears. They diligently study to seek liberation, receive scriptures, observe precepts, practice methods to avert calamity, resolve transgressions, and extend blessings, thereby ascending to the ranks of divine immortals.\n\nBeginners must first confess transgressions and seek mercy, tracing back through beginningless kalpas to the billions of past lives and the seven generations of parents in this life. Good and evil are interconnected: if among the seven generations there are those who attained the Dao, or were worthy, enlightened, and talented, whose merit was manifest in the hidden and visible realms, then the residual blessings will dissolve transgressions. But if there are stubborn, violent, or rebellious ones, their collective misfortunes will be difficult to dispel.\n\nMoreover, from one’s own existence through beginningless kalpas up to the seven generations of ancestors, there have been transgressions in yin and yang, some minor, some grave. Grave transgressions are difficult to dispel, while minor ones are easily removed. Those easily removed may be resolved through purification rites and merit-making, and in a short time, one may perceive a response. Those difficult to dispel require years of devoted austerity, yet still may not receive a sign. When no sign is received, one may grow lax and retreat, failing to recognize that the root of past offenses runs deep. Instead, one may resent the divine for lacking efficacy, thereby increasing karmic entanglements—such sins are unforgivable. Yet if one remains diligent, vowing never to slacken even unto death, good effects will surely follow, turning misfortune into fortune.\n\nIf among one’s past lives or ancestors there were many who accumulated merit, and one now adds to this with further cultivation, the fruition of blessings will come swiftly. Those who lack clarity may claim their virtue is insufficient to be deemed worthy, or dismiss attainment as illusory, or attribute it to spontaneity rather than disciplined practice. Such individuals cannot be taught; they forfeit the Dao’s affinity, becoming instead part of the demonic host, trapped in endless cycles of birth and death—deeply lamentable. Those of penetrating wisdom and resolute faith harbor no such doubts. They practice diligently without cease, and regardless of difficulty, through persistent accumulation over time, all may attain the Dao.\n\nTo attain the Dao and achieve longevity, one must practice goodness. Practicing goodness and ceasing evil requires a steadfast mind and unwavering resolve. In upholding precepts, one must ensure the Three Treasures remain unviolated and the Five Virtues undiminished. One should silently comprehend and secretly act, never forgetting through speech. Good and evil need not always be enacted; practicing goodness need not involve crowds. Yet crowds may suspect and mock, giving rise to doubt, jealousy, and calamity. Thus, even the sagely do not perform goodness on another’s behalf—knowing goodness as goodness yet still acting is not true goodness. One who knows goodness without boasting, without self-righteousness, without scheming, without considering it \"good,\" and remains serene as if nothing has occurred—only then may one attain the Dao.\n\nTo those not of like mind, one must not recklessly speak. Teach only those who can be transformed; do not force it upon the unwilling. The swift may achieve it in four, nine, or three cycles; the slow in two, four, four, or six, extending to five or eight years—none fail to attain the Dao. Those who do not attain it do so because they receive the method but do not practice it, or practice without diligence, or practice without precision. Between them, they commit offenses, mingling good and evil, so that merit cannot redeem transgressions, nor virtue compensate for faults. After death, they may become good karmic connections, their affinity growing among ghosts. If they awaken in the unseen realm and establish virtue, they may become ghostly officials, accumulating merit to ascend as immortals, or become numinous beings, or be reborn into noble and virtuous families, free from worldly toil—yet they cannot attain the Dao in this very body.\n\nIf one betrays and slanders the teachings, initially accepting but later rejecting them, death will follow the demonic faction, severing all connection to goodness. That the connection to goodness is not severed stems from faith and devotion. Even if one’s faith and devotion do not reach perfection, as long as one does not waver or retreat in confusion, the affinity for goodness will grow day by day, and this growth, unceasing, will surely lead to true attainment. A true person may live four hundred years, four thousand years, forty thousand years, or even ten thousand kalpas. Each transmission has its own instructions. Beginners should take four, nine, or three cycles as their limit, adhering to the regulations on good and evil, and carefully avoiding reckless transgressions.\n\nIn studying the supreme Dao, one must settle body and mind. If body and mind are unsettled, study will yield no accomplishment. To accomplish study and enter samadhi, guarding the One comes first. Subtle and difficult to master, if one cannot maintain this guard, the mind will become entangled with other affairs. If one cannot enter samadhi through guarding the One, one should carefully observe omens, reflecting on oneself and others, noting differences in one’s own body and strange transformations in external things. Upon perceiving them, one should reform, applying methods and remedies to dissolve and dispel them. Only after no further anomalies occur may one enter samadhi, where the host of perfected beings will accompany one.\n\nFirst, if the eyes appear hazy, the light unsteady, and what is seen unreal, indistinct, and unrecognizable, one should enter a purified chamber, burn incense, and visualize the divine youths of the eye’s spirit pathway, each three inches long, clad in five-colored garments. In each eye resides one, joyfully facing and approaching each other, traveling from east to west, attended by a thousand chariots and ten thousand riders. After a long and focused visualization, cease, then resume. Practice this twelve times daily until one can go six days without sleep. Then the divine youths will manifest, and after one hundred twenty days, one will clearly see ten thousand miles away. After three hundred sixty days, one will foreknow fortune and misfortune, harmonizing one’s virtue with the divine. The sin arises from gazing upon improper sights and failing to behold the true and real. By reforming and focusing one’s visualization, verification will follow.\n\nSecond, if the ears roar or ache with fullness, unable to hear distant sounds or distinguish speech, one should enter a purified chamber, burn incense, and visualize the divine youth of the ear’s spirit pathway, eight inches and one fen long, clad in white, attended by a thousand chariots and ten thousand riders, returning to the two ear cavities. Cease when the visualization reaches its peak, then resume. Healing will follow the method above. The sin arises from delighting in lewd sounds and failing to heed sacred teachings. By reforming and focusing one’s visualization, verification will follow.\n\nThird, if the nose drips clear fluid or becomes congested and painful, unable to distinguish fragrance, or failing to detect odors, one should enter a purified chamber, burn incense, and visualize the divine youth of the nose’s spirit pathway, two inches and five fen long, clad in black, attended by a thousand chariots and ten thousand riders, returning to the two nostrils. Cease when the visualization reaches its peak, then resume. Healing will follow the method above. The sin arises from craving rich and rare flavors and disliking fragrant aromas. By reforming and focusing one’s visualization, verification will follow.\n\nFourth, if the mouth cannot taste, or the teeth, tongue, and lips ache, the throat feels uncomfortable, and eating and drinking are difficult, one should enter a purified chamber, burn incense, and visualize the divine youth of the tongue’s spirit pathway, seven inches long, clad in red, attended by a thousand chariots and ten thousand riders, returning to the mouth. Cease when the visualization reaches its peak, then resume. Healing will follow the method above. The sin arises from delighting in flavors and harsh words, lacking plainness and sincerity. By reforming and focusing one’s visualization, verification will follow.\n\nFifth, if the head suffers from pain, itching, or hair loss without regrowth, one should enter a purified chamber, burn incense, and visualize the divine youth of the brain’s spirit pathway, one inch and one fen long, clad in blue-green, attended by a thousand chariots and ten thousand riders, returning to the head.\n\nCease when the visualization reaches its peak, then resume. Healing will follow the method above. The sin arises from frivolity and offending superiors, failing to pay reverence to the Three Honored Ones. By reforming and focusing one’s visualization, verification will follow.\n\nSixth, if the heart and abdomen suffer from vexation, discontent, twisting pain, hardness, distension, or indigestion, one should enter a purified chamber, burn incense, and visualize the divine youth of the heart’s spirit pathway, *Daomingjing*, nine inches long, clad in multicolored robes, attended by a thousand chariots and ten thousand riders, returning to the abdomen. Cease when the visualization reaches its peak, then resume. Healing will follow the method above. The sin arises from restlessness, capricious joy and anger, neglect of purity and tranquility, and failure to dispel jealousy and contention. By reforming and focusing one’s visualization, verification will follow.\n\nSeventh, if the lower back, spine, hips, knees, shins, calves, or feet suffer from soreness, pain, sores, or difficulty in movement, one should enter a purified chamber, burn incense, and visualize the divine youth of the rib-side’s spirit pathway, *Daocheng*, clad in variegated robes, attended by a thousand chariots and ten thousand riders, returning to the lower back, spine, hips, knees, shins, calves, feet, and both rib-sides. Cease when the visualization reaches its peak, then resume. Healing will follow the method above. The sin arises from over-exertion and disturbance, lacking steadfast dignity. By reforming and focusing one’s visualization, verification will follow.\n\nEighth, if the entire body, both internally and externally, suffers from illness and distress, with no self-awareness, and shortness of breath, one should enter a purified chamber, burn incense, and visualize the divine youth of the skin’s spirit pathway, *Daolianjing*, one inch and five *fen* long, clad in cinnabar and white robes, attended by a thousand chariots and ten thousand riders, returning to the body’s interior and exterior to expel evil and establish correctness. Cease when the visualization reaches its peak, then resume. Healing will follow the method above. The sin arises from killing, theft, lewdness, and ugliness, disregarding the true and upright. By reforming and focusing one’s visualization, verification will follow.\n\nNinth, if one suddenly falls ill or is bedridden with chronic disease, unable to recover, one should enter a quiet chamber, burn incense, bow the head, and visualize the divine youth of the kidneys’ spirit pathway, *Daosheng*, with the two kidney spirits, each two inches and three *fen* long, attended by a thousand chariots and ten thousand riders, returning to fill the body. Cease when the visualization reaches its peak, then resume. Healing will follow the method above. The sin arises from cruelty, violence, and recklessness, failing to reflect and repent. By reforming and focusing one’s visualization, verification will follow.\n\nThe onset of these nine conditions will have its signs. Those skilled in divination may anticipate and prepare, naturally dissolving them and forever preserving purity and auspiciousness.\n\nWhenever one dreams or travels and sees murky *qi*, gloom, dry wells, filthy pools, excrement, blood, corpses, ghosts, or people engaging in lewd acts, the eyes are likely to fall ill. One should immediately visualize the eye spirit, rub the palms until warm, and press them over the eyes twenty-one times. Then, use the fingernails to pinch the inner corners of the eyes. If there is brightness and clarity, it is auspicious; if dark or black, it is inauspicious. By diligently visualizing, massaging, and pressing, and repenting one’s transgressions, there will be no affliction.\n\nWhenever one dreams or travels and hears strange sounds in the void—mournful, startling, or harsh—the ears are likely to fall ill. One should immediately visualize the ear spirit, cross the hands to cover the ears, press them twenty-one times, then cup the hands and listen quietly. Visualize hearing the music of the *Tai Shang Yun’ao* and the *Celestial Harmony*, gathering teachers and friends to discuss and recite scriptures. By repenting one’s transgressions, there will be no affliction.\n\nWhenever one dreams or travels and smells foul or unusual odors—fishy, pungent, or strange—with something entering the nose, whether dust, insects, or vanishing without trace, the nose is likely to fall ill. One should immediately visualize the nose spirit, cross the hands to pinch the nose, inhale and exhale sharply twenty-one times. By diligently tending incense, blending fine fragrances, and ensuring the smoke of *qi* is continuous without interruption, and repenting one’s transgressions, there will be no affliction.\n\nWhenever one dreams or travels and sees spoiled or rotten food, reviled by evil people, with the mouth moving, teeth aching, or speech becoming slurred, the mouth is likely to fall ill. One should immediately visualize the mouth spirit, curl the tongue to rinse the mouth with saliva, and swallow it twenty-one times. By reciting essential precepts, silently chanting mantras, consulting scriptures, and resolving doubts, and repenting one’s transgressions, there will be no affliction.\n\nWhenever one dreams or travels and sees dazzling lights, falling rain or snow, or falling from heights or overturned objects, the head is likely to fall ill. One should immediately visualize the brain spirit, rub the hands and massage the eyebrows, then traverse the *Mingtang*, *Dongfang*, and *Dantian* palaces on the forehead. Select water from the Eastern Well, blend it with fragrant herbs, and use it to wash and comb the hair, applying incense three times. By diligently repenting, gazing upon the Three Honored Ones, and repenting one’s transgressions, there will be no affliction.\n\nWhenever one dreams or travels and sees water or fire spreading uncontrollably, nets and snares crisscrossing, or boats and carts overturning, with naked figures fleeing in panic, the heart and abdomen are likely to fall ill. One should immediately visualize the heart spirit, cover the heart with the left hand and the navel with the right, close the eyes, hold the breath until the limit, then exhale gently. Repeat this nine times. By bathing with purity, tending the flame of continuity, strictly eliminating thoughts of killing, facing south in movement and stillness, observing light and admiring scenery, and ensuring one’s conduct is pure and upright, and repenting one’s transgressions, there will be no affliction.\n\nWhenever one dreams or travels and sees fighting, beating, carrying heavy burdens, falling and injuring oneself, soldiers collapsing, canes or punishments in motion, or yin and yang clashing, the waist, back, and joints are likely to fall ill. One should immediately visualize the rib-side spirit, cross the hands to cover the rib-sides, pinch them twenty times, swallow *qi*, and click the teeth twenty-one times each. Reflect on one’s conduct, correct any violations of precepts, perform acts of kindness, manage one’s affairs, admonish disputes, restrain speech, and control the body. Do not move recklessly; in walking, sitting, lying, or rising, be cautious and deliberate. Move slowly, observe carefully, and align the heart and body. By repenting one’s transgressions, there will be no affliction.\n\nWhenever one dreams or travels and sees people flaying each other, consuming strange foods, or men and women in disorder, with yin and yang inverted, the body is likely to fall ill.\n\nImmediately visualize the skin spirit, rub both hands together, and massage the entire body until thoroughly warmed, then cease. Repeat this process, completing three full cycles. Recite and study the precepts, delve deeply into profound teachings, dispel stagnation and resolve confusion, reduce desires and selfishness, repent one’s transgressions, and there will be no affliction.\n\nWhenever one dreams or travels and sees people fleeing in panic, great floods or fires, birds and beasts in chaotic flight, bandits or drunken brawls, weapons scattered wildly, dogs or tigers chasing and biting, or unfamiliar people falsely claiming acquaintance—these all portend sudden illness. Immediately visualize the true spirit, apply the oral instructions for women, and alternately massage and grasp the Green Dragon and White Tiger twenty-one times each. Diligently follow the Mysterious and Plain, never betray the Yellow Writ, and when giving birth to children, strictly adhere to the master’s teachings. Repent one’s transgressions, and there will be no affliction.\n\nAmong these nine matters, with their myriad details, whatever one perceives while seated in stillness aligns with dreams and journeys. Carefully adhere to these principles, and all afflictions will naturally dissolve, rendering medicine and prayers unnecessary.\n\nTo dispel afflictions and purify the body, one must recognize the need for change and reform the mind. When the mind is upright, the body becomes pure; only then may one enter concentration. Through concentration, the Dao may be attained. Without concentration, the true cannot descend; without the descent of the true, how can the Dao be realized? The Dao is attained through the descent of the true, and the true descends through purity and uprightness. If one is pure and upright yet fails to attain the Dao, such a case has never existed.\n\n*The Wondrous Oral Instructions on Entering Concentration in the* Supreme Perfection of the Cavernous Truth’s *Eightfold Simplicity Scripture on Divination and Omens* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞真太上八素真经占候入定妙诀 经名：洞真太上八素真经占候入定妙诀。 撰人不详，约出於东晋南朝。 原为《八素真经诀》之一，后分出单行。 一卷。 底本出处：《正统道藏》正一部。 洞真太上八素真经占候入定妙诀 太帝告四极真人曰：今有笃信至道，修学不懈，皆是先身已经积善，生诸天上，天上着乐，无以进功，年讫来生，轮转下世。 或发愿启告，求生世间，救物立功，勤习上道，皆非凡人。 凡人不觉伊，亦不自知，自知亦不说。 如此诸人，不免灾否，或眷属衰丧，或身婴疾病，或公私口舌，或隐显逢凶，恶人丑鬼，毒兽鸟虫，金木水火土草为妨，良由功德未满，受法未备。 急清斋责躬，谢过请福，精存太上，守一无忘，施行三五，谛忆玄师。 玄师青童君，总领一切经书，宝文妙图，皆悉由之。 学士寻师未遇，求经未得，得或不足，足或不明，明或不行，行或不久，或多漏悞，不能忆知，或己忆知，瞥已遗忘，邪精所干，魔鬼所试。 急择佳辰，丁卯之日，登山入室，清严烧香，启告太上，谛存青童，向东住心，想见方诸宫，稽首礼拜，面对金阙上相，赢疾厄难，常礼六拜，拜毕叩头，密陈苦志，或公私否塞，或心识露忘，随愿言之。 指彼即急患，不得多及缓事。 若缓急备言，当书委曲，拜竟密读取，不闻竟，即烧之后为亦尔。 气力强盛，可礼十二拜、二十四拜、三十六拜、七十二拜、百二十拜、二百四十拜、三百六十拜、七百二十拜、一千二百拜，一时能竟，注心益善。 复不堪者，寅时至丑十二时，时百拜也。 有能二时寅申、子午，适所堪耳。 常能行之六旬一百，不能移日他辰行也。 同志三五人，不可多相引喧闹，泄漏考不可解。 上学之士，精加详慎，修行此法，然后为师传经，必得其人，付授无悔恨矣。 凡师传经，不得其人，或是其人，传不如法，付授之后，一十二旬，众灾互凑，急谢青童，苦有福庆，亦启荷恩也，凡受道后，如法修行，九十日无灾病，此宿新有善，合仙之人。 四九三百六十日，公私胜泰，此前后积福，合真之人。 三周涉四年一千二百，功德兴隆，幽显敬伏，此上士至勤，合神之人。 便传授，广度贤明，救凡泛爱，慈心立功，博济无私，克登上圣神真仙君，帝王公卿之位矣。 若受道之后，百日之内有诸厄病，皆宿新多罪，非合仙之人。 急应首谢，誓革心行，改往修来，凭请师友，洗悔恨之情，笃慊款之志，敬信无疑，必获福利。 四九三周，准拟此例，建德立功，免度危患，战战兢兢，恒怀惭惧，媿有深罪，惭无重功，不可为师，慎勿传授。 德业渐升，五八四十年，乃择人启付耳。 有灾强行，叼遇为师，彼此相误，皆是恶因缘也。 期笃之中，不斋度者，师有相结，为之祈请，首过乞恩，至诚丹切，不得虚饰，又勿苟为，心非口是。 又勿语人，称为功德，唯精唯密，彼此得福，上学之士，明共遵行。 凡生死未止，皆由罪根未除，出阴入阳，动静多过，过积则死，死苦可悲，上士所畏，勤学求生，受经行戒，方术禳灾，解罪延福，以登神仙。 初习法者，先首过请恩，从无始中来，亿曾万祖，今身七世父母，善恶相关，七世有得道，及贤明才智，功德着於幽显者，余庆所锺，诸罪易释，有顽凶悖逆者，众殃难祛。",
      "translated_text": "**The Wondrous Scripture of the Supreme Cavern of Perfection on the Eight Pure Essentials, Divination, and the Secret of Entering Samādhi**\n\nThe *Wondrous Scripture of the Supreme Cavern of Perfection on the Eight Pure Essentials, Divination, and the Secret of Entering Samādhi* is of uncertain authorship, approximately dating to the Eastern Jin or Southern Dynasties. Originally part of the *Secret of the Eight Pure Essentials*, it later circulated independently as a single fascicle. The present text is derived from the *Zhengtong Daoist Canon*, Section Zhengyi, First Division.\n\n---\n\nThe Supreme Thearch addressed the Perfected Ones of the Four Poles, saying: Those who now steadfastly believe in the Supreme Dao and cultivate its study without ceasing—all such persons have in former lives already accumulated goodness, being born in the heavens above. Yet in the heavens, they indulge in pleasures and make no further progress in merit. When their years are exhausted, they return to the world below, cycling through rebirth. Some, moved by vows, petition to be born in the world to save beings and establish merit, diligently practicing the Supreme Dao—these are no ordinary people. Ordinary people neither perceive nor recognize them; even if they recognize themselves, they do not speak of it.\n\nYet such persons cannot escape misfortune: their kin may decline or perish, their bodies may be afflicted by illness, or they may encounter public or private disputes, hidden or manifest calamities, evil men, hideous ghosts, venomous beasts, birds, or insects, or harm from metal, wood, water, fire, earth, or plants. This arises because their merit is not yet complete, and their reception of the Dao is not yet perfected. They must swiftly purify themselves through fasting, examine their conduct, repent of transgressions, and pray for blessings. They should concentrate their essence on the Supreme, guard the One without forgetfulness, practice the Three and Five, and sincerely recall the Mysterious Master.\n\nThe Mysterious Master, the Lord of the Azure Lad, presides over all scriptures, treasured texts, and wondrous diagrams—all proceed from him. If scholars seek a master but do not meet one, or seek scriptures but do not obtain them; if they obtain them but not in full, or fully but without clarity; if they are clear but do not practice, or practice but not for long; if they err or forget, or recall but then suddenly lose it—these are the workings of deviant spirits or the trials of demonic forces.\n\nThey must swiftly choose an auspicious day, such as the day of *dingmao*, ascend a mountain, enter a chamber, purify themselves, and burn incense. They should petition the Supreme, sincerely visualize the Azure Lad, direct their minds eastward, and imagine the Palace of the Square Cauldron. Bowing their heads in reverence, they face the golden portals of the Highest Ministers, beseeching deliverance from misfortune and hardship. They perform the customary six bows, and upon completion, kowtow and secretly declare their苦志. Whether their troubles are public or private, or their minds are scattered and forgetful, they should state their wishes accordingly. They must address urgent afflictions first, not dwelling on lesser or delayed matters. If both urgent and minor concerns must be mentioned, they should write them in detail. After bowing, they read them silently, and if not finished, burn them afterward in the same manner.\n\nIf their qi and strength are abundant, they may perform twelve, twenty-four, thirty-six, seventy-two, one hundred twenty, two hundred forty, three hundred sixty, seven hundred twenty, or one thousand two hundred bows—completing them at once is best, as focused devotion yields greater benefit. Those unable to do so may perform one hundred bows from the hour of *yin* to *chou* (twelve hours). Others may perform at two hours, such as *yin* and *shen*, or *zi* and *wu*, as they are able. They should practice this once every sixty days, without shifting to other days or hours.\n\nThree to five like-minded companions may join, but no more, to avoid noise and distraction, which would render their efforts ineffective. Advanced scholars must be meticulous and cautious. Only after practicing this method should they transmit scriptures as masters, ensuring the recipient is worthy—thus bestowing without regret.\n\nIf a master transmits scriptures to an unworthy person, or to one who, though worthy, does not follow the proper method, then within twelve ten-day periods, various disasters will converge. They must swiftly petition the Azure Lad, and though suffering may persist, they will also receive blessings, for which they should express gratitude.\n\nAfter receiving the Dao, if one practices according to the method and remains free of illness for ninety days, this indicates that in past and present lives, they have accumulated goodness and are destined for immortality. If for four nine-day periods (three hundred sixty days) their public and private affairs prosper, this shows that their past and present merit is sufficient to align with the Perfected. After three cycles spanning four years and one thousand two hundred days, their merit flourishes, and both the hidden and manifest realms submit in reverence—this marks an advanced scholar of utmost diligence, destined for divinity.\n\nThey may then transmit the teachings, broadly delivering the worthy and enlightened, saving the common and the loving, establishing merit with a compassionate heart, and aiding all without selfishness. Thus, they ascend to the rank of the Most High Sage, Divine Perfected Immortal Lord, or the positions of emperor, king, duke, or minister.\n\nIf, after receiving the Dao, one encounters various hardships and illnesses within a hundred days, this reveals that in past and present lives, they have accumulated many transgressions and are not destined for immortality. They must swiftly repent, vow to reform their conduct, amend past wrongs, and cultivate future goodness. Relying on the support of masters and companions, they should cleanse their remorseful hearts, strengthen their sincere resolve, and cultivate reverence and unwavering faith—thus they will surely attain blessings and benefit.\n\nFor four nine-day periods and three cycles, they should follow this example: establish virtue, perform meritorious deeds, and avoid perilous calamities. They must remain vigilant and fearful, ever mindful of shame and caution, humbled by deep transgressions and ashamed of insufficient merit. They must not act as masters or transmit teachings carelessly. As their virtue gradually ascends, after five eight-year periods (forty years), they may then select a worthy recipient to initiate.\n\nIf, despite misfortune, one forcibly proceeds and rashly becomes a master, both teacher and disciple will lead each other astray—this is an evil karmic connection. Among those of sincere commitment, if one does not observe the fast, the master bears a karmic bond with them. They must pray and petition, confessing transgressions and seeking mercy with utmost sincerity, without pretense or carelessness—neither deceitful in heart nor insincere in speech. They must not boast of their merit to others, but remain devoted and discreet, so that both parties receive blessings. Advanced scholars must clearly understand and adhere to this.\n\nAs long as the cycle of birth and death continues, it is because the roots of transgression have not been eradicated. Moving from yin to yang, in motion and stillness, one commits many faults. When faults accumulate, death follows—a sorrowful suffering that the advanced scholar fears. They diligently study to seek liberation, receive scriptures, observe precepts, practice methods to avert calamity, resolve transgressions, and extend blessings, thereby ascending to the ranks of divine immortals.\n\nBeginners must first confess transgressions and seek mercy, tracing back through beginningless kalpas to the billions of past lives and the seven generations of parents in this life. Good and evil are interconnected: if among the seven generations there are those who attained the Dao, or were worthy, enlightened, and talented, whose merit was manifest in the hidden and visible realms, then the residual blessings will dissolve transgressions. But if there are stubborn, violent, or rebellious ones, their collective misfortunes will be difficult to dispel.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1243,
      "start_sentence": 0,
      "end_sentence": 35,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.58079934120178,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上八素真经占候入定妙诀.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "又己身无始中来，至于七祖以来，阴阳愆咎，或轻或重，重则难遣，轻则易除。 易除者，齐戒立功，少日便感，难遣者，精苦累岁，尚不蒙应。 不蒙应者，好致懈退，不悟先衅源深，更忿神明无验，此增恶缘，罪不在赦。 若能弥勤，誓死不怠，必有良效，转祸为福。 其中先世先身，多功德者，今加修善，招果自速。 不明了者，乃谓其善未足可称，便云得道，或云虚妄，或云自然，非学所得，如此之流，复不可教，永失道缘，方为魔群，生死不已，深可痛悼。 智明洞达之人，高才笃信之士，无此诸疑，勤行不怠，难易小复，推移积久，皆能得道。 得道长生，要在行善，行善止恶，心坚意固，持戒必令不圆三尊，不遣五德，默识密行，不忘言说。 善恶未必能行，行善不必会众，众猜致诮，疑嫉生灾。 是以上圣为善不代，知善为善，斯不善矣。 能知善不以矜夸，不以自是，不以规图，不以为善，恬然若无，乃得道耳。 非同志者，不得妄说，说化可化，非人勿强，易者四九三周，难者二四四六，极乎五八之年，无不得道。 不得道者，皆由受法不行，行之不勤，勤之不精，其间作罪，善恶杂糅，功不赎过，德不补愆，死后得为善缘，缘增於鬼，得悟幽中立德，亦作鬼官，积功升仙，或为灵人，或转轮贵盛道德之家，并不尘劳，唯不能於即身得道耳。 若背叛诽毁，初是末非，死随邪党，与善绝因。 因善不绝，皆由信向，信向虽不能至到，但令不疑惑迷退，则善缘日增，增长不止，必亦成真。 真人四百年，四千年，四万年，爰至万劫。 传付各有诀令，初学之人，以四九三周为限，善恶依科，慎勿妄犯。 凡学上道，谛定身心，身心不定，学无所成。 成学入定，守一为先，微妙难习，守之不能，即坚杂营他事。 守之不能入定，当精占候，省己及物，己身异同，物有变怪，觉之即改，修术用方，消而却之，久无复异，然后入定，众真相携矣。 一若眼中漠漠，光明不恒，所见非真，彷佛不识，当精严入室烧香，存思两目神道童精，长三寸，衣五色衣，两目各一人，喜相向相就，从东西游行，侍从有千乘万骑。 良久谛思，极则止，止又思，日夜可十二时存之，差乃已能六日不睡，道童现形，百二十日分明见万里之外，三百六十日逆知吉凶，与神合德也。 罪由好看邪色，不视正真，改过精思，即有验也。 二若耳中訇訇，或至痛满，不闻远声，听语不别，当精严入室烧香，存思耳神道平精，长八寸一分，素衣，从千乘万骑，还耳两孔之中。 思极则止，止又思，差乃已如上法。 罪由好听淫声，不察圣教，改过精思，乃有验也。 三若鼻中清汁，或至塞痛，所闻不香，臭香不齅，当精严入室烧香，存思鼻神道微精，长二寸五分，玄衣，从千乘万骑，还鼻两孔之中。 思极则止，止又思，差乃已如上法，罪由好嗜肥鲜，不喜香馥，改过精思，即有验也。 四若口不知味，或齿舌唇痛，咽喉不快，饮食艰涩，当精严入室烧香，存思舌神道岐精，长七寸，朱衣，从千乘万骑，还口中。 思极则止，止又思，差乃已如上法。 罪由好味恶言，不素不实，改过精思，即有验也。 五若头痃痛痒，发落不生，当精严入室烧香，存思脑神道都精，长一寸一分，青衣，从千乘万骑，还头中。",
      "translated_text": "Moreover, from one’s own existence through beginningless kalpas up to the seven generations of ancestors, there have been transgressions in yin and yang, some minor, some grave. Grave transgressions are difficult to dispel, while minor ones are easily removed. Those easily removed may be resolved through purification rites and merit-making, and in a short time, one may perceive a response. Those difficult to dispel require years of devoted austerity, yet still may not receive a sign. When no sign is received, one may grow lax and retreat, failing to recognize that the root of past offenses runs deep. Instead, one may resent the divine for lacking efficacy, thereby increasing karmic entanglements—such sins are unforgivable. Yet if one remains diligent, vowing never to slacken even unto death, good effects will surely follow, turning misfortune into fortune.\n\nIf among one’s past lives or ancestors there were many who accumulated merit, and one now adds to this with further cultivation, the fruition of blessings will come swiftly. Those who lack clarity may claim their virtue is insufficient to be deemed worthy, or dismiss attainment as illusory, or attribute it to spontaneity rather than disciplined practice. Such individuals cannot be taught; they forfeit the Dao’s affinity, becoming instead part of the demonic host, trapped in endless cycles of birth and death—deeply lamentable. Those of penetrating wisdom and resolute faith harbor no such doubts. They practice diligently without cease, and regardless of difficulty, through persistent accumulation over time, all may attain the Dao.\n\nTo attain the Dao and achieve longevity, one must practice goodness. Practicing goodness and ceasing evil requires a steadfast mind and unwavering resolve. In upholding precepts, one must ensure the Three Treasures remain unviolated and the Five Virtues undiminished. One should silently comprehend and secretly act, never forgetting through speech. Good and evil need not always be enacted; practicing goodness need not involve crowds. Yet crowds may suspect and mock, giving rise to doubt, jealousy, and calamity. Thus, even the sagely do not perform goodness on another’s behalf—knowing goodness as goodness yet still acting is not true goodness. One who knows goodness without boasting, without self-righteousness, without scheming, without considering it \"good,\" and remains serene as if nothing has occurred—only then may one attain the Dao.\n\nTo those not of like mind, one must not recklessly speak. Teach only those who can be transformed; do not force it upon the unwilling. The swift may achieve it in four, nine, or three cycles; the slow in two, four, four, or six, extending to five or eight years—none fail to attain the Dao. Those who do not attain it do so because they receive the method but do not practice it, or practice without diligence, or practice without precision. Between them, they commit offenses, mingling good and evil, so that merit cannot redeem transgressions, nor virtue compensate for faults. After death, they may become good karmic connections, their affinity growing among ghosts. If they awaken in the unseen realm and establish virtue, they may become ghostly officials, accumulating merit to ascend as immortals, or become numinous beings, or be reborn into noble and virtuous families, free from worldly toil—yet they cannot attain the Dao in this very body.\n\nIf one betrays and slanders the teachings, initially accepting but later rejecting them, death will follow the demonic faction, severing all connection to goodness. That the connection to goodness is not severed stems from faith and devotion. Even if one’s faith and devotion do not reach perfection, as long as one does not waver or retreat in confusion, the affinity for goodness will grow day by day, and this growth, unceasing, will surely lead to true attainment. A true person may live four hundred years, four thousand years, forty thousand years, or even ten thousand kalpas. Each transmission has its own instructions. Beginners should take four, nine, or three cycles as their limit, adhering to the regulations on good and evil, and carefully avoiding reckless transgressions.\n\nIn studying the supreme Dao, one must settle body and mind. If body and mind are unsettled, study will yield no accomplishment. To accomplish study and enter samadhi, guarding the One comes first. Subtle and difficult to master, if one cannot maintain this guard, the mind will become entangled with other affairs. If one cannot enter samadhi through guarding the One, one should carefully observe omens, reflecting on oneself and others, noting differences in one’s own body and strange transformations in external things. Upon perceiving them, one should reform, applying methods and remedies to dissolve and dispel them. Only after no further anomalies occur may one enter samadhi, where the host of perfected beings will accompany one.\n\nFirst, if the eyes appear hazy, the light unsteady, and what is seen unreal, indistinct, and unrecognizable, one should enter a purified chamber, burn incense, and visualize the divine youths of the eye’s spirit pathway, each three inches long, clad in five-colored garments. In each eye resides one, joyfully facing and approaching each other, traveling from east to west, attended by a thousand chariots and ten thousand riders. After a long and focused visualization, cease, then resume. Practice this twelve times daily until one can go six days without sleep. Then the divine youths will manifest, and after one hundred twenty days, one will clearly see ten thousand miles away. After three hundred sixty days, one will foreknow fortune and misfortune, harmonizing one’s virtue with the divine. The sin arises from gazing upon improper sights and failing to behold the true and real. By reforming and focusing one’s visualization, verification will follow.\n\nSecond, if the ears roar or ache with fullness, unable to hear distant sounds or distinguish speech, one should enter a purified chamber, burn incense, and visualize the divine youth of the ear’s spirit pathway, eight inches and one fen long, clad in white, attended by a thousand chariots and ten thousand riders, returning to the two ear cavities. Cease when the visualization reaches its peak, then resume. Healing will follow the method above. The sin arises from delighting in lewd sounds and failing to heed sacred teachings. By reforming and focusing one’s visualization, verification will follow.\n\nThird, if the nose drips clear fluid or becomes congested and painful, unable to distinguish fragrance, or failing to detect odors, one should enter a purified chamber, burn incense, and visualize the divine youth of the nose’s spirit pathway, two inches and five fen long, clad in black, attended by a thousand chariots and ten thousand riders, returning to the two nostrils. Cease when the visualization reaches its peak, then resume. Healing will follow the method above. The sin arises from craving rich and rare flavors and disliking fragrant aromas. By reforming and focusing one’s visualization, verification will follow.\n\nFourth, if the mouth cannot taste, or the teeth, tongue, and lips ache, the throat feels uncomfortable, and eating and drinking are difficult, one should enter a purified chamber, burn incense, and visualize the divine youth of the tongue’s spirit pathway, seven inches long, clad in red, attended by a thousand chariots and ten thousand riders, returning to the mouth. Cease when the visualization reaches its peak, then resume. Healing will follow the method above. The sin arises from delighting in flavors and harsh words, lacking plainness and sincerity. By reforming and focusing one’s visualization, verification will follow.\n\nFifth, if the head suffers from pain, itching, or hair loss without regrowth, one should enter a purified chamber, burn incense, and visualize the divine youth of the brain’s spirit pathway, one inch and one fen long, clad in blue-green, attended by a thousand chariots and ten thousand riders, returning to the head.",
      "overlap_context": " tracing back through beginningless kalpas to the billions of past lives and the seven generations of parents in this life. Good and evil are interconnected: if among the seven generations there are those who attained the Dao, or were worthy, enlightened, and talented, whose merit was manifest in the hidden and visible realms, then the residual blessings will dissolve transgressions. But if there are stubborn, violent, or rebellious ones, their collective misfortunes will be difficult to dispel.",
      "start_char": 1243,
      "end_char": 2484,
      "start_sentence": 36,
      "end_sentence": 67,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.100743770599365,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上八素真经占候入定妙诀.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "思极则止，止又思，差乃已如上法。 罪由轻佻犯上，不礼谢三尊，改过精思，即有验也。 六若心腹中烦，忿忿不乐，绞痛坚胀，饮食不消，当精严入室烧香，存思心神道明精，长九寸，彩衣，从千乘万骑，还腹中。 思极则止，止又思，差乃已如上法。 罪由好动，喜怒无常，不念清静，不除嫉诤，改过精思，即有验也。 七若腰背髀骼、膝胫腓足，酸痛疼疖，动转艰难，当精严入室烧香，存思胁神道成，杂彩斑衣，从千乘万骑，还腰背髀骼、膝胫腓足、两胁之中。 思极则止，止又思，差乃已如上法。 罪由强健劳扰，不笃端严，改过，精思，即有验也。 八若举体合身，内外疾恼，不复自觉，气息短急，当精严入室烧香，存思皮肤神道连精，长一寸五分，丹素之衣，从千乘万骑，还身中内外，驱邪布正。 思极则止，止又思，差乃已如上法。 罪由杀盗奸丑，不顾正真，改过精思，即有验也。 九若卒病顿卧，或积疾困笃，不能痊瘥，当令入靖烧香顿首，存思肾神道生，左右二肾精，长二寸三分，从千乘万骑，还备体中。 思极则止，止又思，差乃已如上法。 罪由凶逆肆暴，不念首悔，改过精思，即有验也。 右九事之来，必有候，善能占之，逆营防备，自然消除，永保贞吉。 凡梦及出行，见氛气晦暝，井浊无水，洿池不净，粪血尸鬼，人物交淫，皆眼当有疾。 急存眼神，挼掌令热，以熨两眼，二七过止。 又以手指爪捻目訾，有光明朗则吉，青黑则凶。 又精存思摩熨，首谢罪愆，则无患矣。 凡梦及出行，闻空中异声，悲惊丑切，皆耳当有疾。 急存耳神，交手掩耳，二七按之，毕拱静听，思闻太上云璈之音，天钧之乐，延集师友，察讲诵之声，首谢罪愆，则无患矣。 凡梦及出行，闻不香之气，腥躁异常，有物入鼻，不测是何，或尘或虫，或消或灭，皆鼻当有疾。 急存鼻神，交手捻鼻，缩之喷之二七可止。 勤守香火，合和名香，气烟相续，不舍时刻，首谢罪愆，则无患矣。 凡梦及出行，见饮食朽败，恶人骂詈，口动齿酸，言语僻误，皆口当有疾。 急存口神，反舌漱液，满口咽之二七可止。 习诵要戒，密咒微吟，谘询经典，解滞释疑，首谢罪愆，则无患矣。 凡梦及出行，见游光炫焕，雨雪纷披，从高堕下，器物翻覆，皆头当有疾。 急存脑神，挼手摩眉，修历额上明堂、洞房、丹田诸宫，择取东井之水，香药合和，为汤沐栉，传香三过可止。 勤心礼忏，瞻仰三尊，首谢罪愆，则无患矣。 凡梦及出行，见水火散泆，罗网纵横，船车翻覆，裸露惊奔，皆心腹当有疾。 急思心神，左手掩心，右手掩脐，临目闭气，极则微吐之，平又闭，如此九可止。 精洁沐浴，谨事续明，严除杀想，动止向南，候光玩景，所行见清贞，首谢罪愆，则无患矣。 凡梦及出行，见斗战打击，担多负重，倒跢折伤，武僵仆，行杖动刑，阴阳相侵，皆腰背机关当有疾病。 急存胁神，交手掩胁，捻之二十，咽气、叩齿各二七可止。 思惟所行，破戒违科，即改革之，宜有施恩，便自营理，谏诤止讼，检口抑身，勿妄出入，行坐卧起，皆务防慎，安徐顾望，周正心身，首谢罪愆，则无患矣。 凡梦及出行，见人物相剥，食啖非常，翻覆男女，倒乱阴阳，皆使身当疾。",
      "translated_text": "Cease when the visualization reaches its peak, then resume. Healing will follow the method above. The sin arises from frivolity and offending superiors, failing to pay reverence to the Three Honored Ones. By reforming and focusing one’s visualization, verification will follow.\n\nSixth, if the heart and abdomen suffer from vexation, discontent, twisting pain, hardness, distension, or indigestion, one should enter a purified chamber, burn incense, and visualize the divine youth of the heart’s spirit pathway, *Daomingjing*, nine inches long, clad in multicolored robes, attended by a thousand chariots and ten thousand riders, returning to the abdomen. Cease when the visualization reaches its peak, then resume. Healing will follow the method above. The sin arises from restlessness, capricious joy and anger, neglect of purity and tranquility, and failure to dispel jealousy and contention. By reforming and focusing one’s visualization, verification will follow.\n\nSeventh, if the lower back, spine, hips, knees, shins, calves, or feet suffer from soreness, pain, sores, or difficulty in movement, one should enter a purified chamber, burn incense, and visualize the divine youth of the rib-side’s spirit pathway, *Daocheng*, clad in variegated robes, attended by a thousand chariots and ten thousand riders, returning to the lower back, spine, hips, knees, shins, calves, feet, and both rib-sides. Cease when the visualization reaches its peak, then resume. Healing will follow the method above. The sin arises from over-exertion and disturbance, lacking steadfast dignity. By reforming and focusing one’s visualization, verification will follow.\n\nEighth, if the entire body, both internally and externally, suffers from illness and distress, with no self-awareness, and shortness of breath, one should enter a purified chamber, burn incense, and visualize the divine youth of the skin’s spirit pathway, *Daolianjing*, one inch and five *fen* long, clad in cinnabar and white robes, attended by a thousand chariots and ten thousand riders, returning to the body’s interior and exterior to expel evil and establish correctness. Cease when the visualization reaches its peak, then resume. Healing will follow the method above. The sin arises from killing, theft, lewdness, and ugliness, disregarding the true and upright. By reforming and focusing one’s visualization, verification will follow.\n\nNinth, if one suddenly falls ill or is bedridden with chronic disease, unable to recover, one should enter a quiet chamber, burn incense, bow the head, and visualize the divine youth of the kidneys’ spirit pathway, *Daosheng*, with the two kidney spirits, each two inches and three *fen* long, attended by a thousand chariots and ten thousand riders, returning to fill the body. Cease when the visualization reaches its peak, then resume. Healing will follow the method above. The sin arises from cruelty, violence, and recklessness, failing to reflect and repent. By reforming and focusing one’s visualization, verification will follow.\n\nThe onset of these nine conditions will have its signs. Those skilled in divination may anticipate and prepare, naturally dissolving them and forever preserving purity and auspiciousness.\n\nWhenever one dreams or travels and sees murky *qi*, gloom, dry wells, filthy pools, excrement, blood, corpses, ghosts, or people engaging in lewd acts, the eyes are likely to fall ill. One should immediately visualize the eye spirit, rub the palms until warm, and press them over the eyes twenty-one times. Then, use the fingernails to pinch the inner corners of the eyes. If there is brightness and clarity, it is auspicious; if dark or black, it is inauspicious. By diligently visualizing, massaging, and pressing, and repenting one’s transgressions, there will be no affliction.\n\nWhenever one dreams or travels and hears strange sounds in the void—mournful, startling, or harsh—the ears are likely to fall ill. One should immediately visualize the ear spirit, cross the hands to cover the ears, press them twenty-one times, then cup the hands and listen quietly. Visualize hearing the music of the *Tai Shang Yun’ao* and the *Celestial Harmony*, gathering teachers and friends to discuss and recite scriptures. By repenting one’s transgressions, there will be no affliction.\n\nWhenever one dreams or travels and smells foul or unusual odors—fishy, pungent, or strange—with something entering the nose, whether dust, insects, or vanishing without trace, the nose is likely to fall ill. One should immediately visualize the nose spirit, cross the hands to pinch the nose, inhale and exhale sharply twenty-one times. By diligently tending incense, blending fine fragrances, and ensuring the smoke of *qi* is continuous without interruption, and repenting one’s transgressions, there will be no affliction.\n\nWhenever one dreams or travels and sees spoiled or rotten food, reviled by evil people, with the mouth moving, teeth aching, or speech becoming slurred, the mouth is likely to fall ill. One should immediately visualize the mouth spirit, curl the tongue to rinse the mouth with saliva, and swallow it twenty-one times. By reciting essential precepts, silently chanting mantras, consulting scriptures, and resolving doubts, and repenting one’s transgressions, there will be no affliction.\n\nWhenever one dreams or travels and sees dazzling lights, falling rain or snow, or falling from heights or overturned objects, the head is likely to fall ill. One should immediately visualize the brain spirit, rub the hands and massage the eyebrows, then traverse the *Mingtang*, *Dongfang*, and *Dantian* palaces on the forehead. Select water from the Eastern Well, blend it with fragrant herbs, and use it to wash and comb the hair, applying incense three times. By diligently repenting, gazing upon the Three Honored Ones, and repenting one’s transgressions, there will be no affliction.\n\nWhenever one dreams or travels and sees water or fire spreading uncontrollably, nets and snares crisscrossing, or boats and carts overturning, with naked figures fleeing in panic, the heart and abdomen are likely to fall ill. One should immediately visualize the heart spirit, cover the heart with the left hand and the navel with the right, close the eyes, hold the breath until the limit, then exhale gently. Repeat this nine times. By bathing with purity, tending the flame of continuity, strictly eliminating thoughts of killing, facing south in movement and stillness, observing light and admiring scenery, and ensuring one’s conduct is pure and upright, and repenting one’s transgressions, there will be no affliction.\n\nWhenever one dreams or travels and sees fighting, beating, carrying heavy burdens, falling and injuring oneself, soldiers collapsing, canes or punishments in motion, or yin and yang clashing, the waist, back, and joints are likely to fall ill. One should immediately visualize the rib-side spirit, cross the hands to cover the rib-sides, pinch them twenty times, swallow *qi*, and click the teeth twenty-one times each. Reflect on one’s conduct, correct any violations of precepts, perform acts of kindness, manage one’s affairs, admonish disputes, restrain speech, and control the body. Do not move recklessly; in walking, sitting, lying, or rising, be cautious and deliberate. Move slowly, observe carefully, and align the heart and body. By repenting one’s transgressions, there will be no affliction.\n\nWhenever one dreams or travels and sees people flaying each other, consuming strange foods, or men and women in disorder, with yin and yang inverted, the body is likely to fall ill.",
      "overlap_context": "he method above. The sin arises from delighting in flavors and harsh words, lacking plainness and sincerity. By reforming and focusing one’s visualization, verification will follow.\n\nFifth, if the head suffers from pain, itching, or hair loss without regrowth, one should enter a purified chamber, burn incense, and visualize the divine youth of the brain’s spirit pathway, one inch and one fen long, clad in blue-green, attended by a thousand chariots and ten thousand riders, returning to the head.",
      "start_char": 2484,
      "end_char": 3733,
      "start_sentence": 68,
      "end_sentence": 104,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.38323736190796,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上八素真经占候入定妙诀.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "急存肤神，两手相摩，奖将通体，极而后己，已又为之，三周可止。 诵习戒律，精寻玄言，除滞去惑，寡欲少私，首谢罪愆，则无患矣。 凡梦及出行，见人物惊奔，大水大火，鸟兽纷汨，劫贼狂酒，兵戈纵横，狗虎逐啮，不识之人妄云有旧，皆身当卒病。 急存实神，女子口诀，青龙白虎，更互摩握，二七过止。 勤遵玄素，无负黄书，生人生子，必依师言，首谢罪愆，则无患矣。 凡九事之中，万亿条绪，端坐闻见，与梦行同，精按斯旨，众患自消，无劳医药，则不假祈请矣。 凡除患清身，知变革意，意正身清，然后入定。 入定道可成，不定真弗降，弗能降真，岂能得道，得道由降真，降真由清正，清正而不得道，未之有也。 洞真太上八素真经占候入定妙诀竟",
      "translated_text": "Immediately visualize the skin spirit, rub both hands together, and massage the entire body until thoroughly warmed, then cease. Repeat this process, completing three full cycles. Recite and study the precepts, delve deeply into profound teachings, dispel stagnation and resolve confusion, reduce desires and selfishness, repent one’s transgressions, and there will be no affliction.\n\nWhenever one dreams or travels and sees people fleeing in panic, great floods or fires, birds and beasts in chaotic flight, bandits or drunken brawls, weapons scattered wildly, dogs or tigers chasing and biting, or unfamiliar people falsely claiming acquaintance—these all portend sudden illness. Immediately visualize the true spirit, apply the oral instructions for women, and alternately massage and grasp the Green Dragon and White Tiger twenty-one times each. Diligently follow the Mysterious and Plain, never betray the Yellow Writ, and when giving birth to children, strictly adhere to the master’s teachings. Repent one’s transgressions, and there will be no affliction.\n\nAmong these nine matters, with their myriad details, whatever one perceives while seated in stillness aligns with dreams and journeys. Carefully adhere to these principles, and all afflictions will naturally dissolve, rendering medicine and prayers unnecessary.\n\nTo dispel afflictions and purify the body, one must recognize the need for change and reform the mind. When the mind is upright, the body becomes pure; only then may one enter concentration. Through concentration, the Dao may be attained. Without concentration, the true cannot descend; without the descent of the true, how can the Dao be realized? The Dao is attained through the descent of the true, and the true descends through purity and uprightness. If one is pure and upright yet fails to attain the Dao, such a case has never existed.\n\n*The Wondrous Oral Instructions on Entering Concentration in the* Supreme Perfection of the Cavernous Truth’s *Eightfold Simplicity Scripture on Divination and Omens* concludes.",
      "overlap_context": "rm acts of kindness, manage one’s affairs, admonish disputes, restrain speech, and control the body. Do not move recklessly; in walking, sitting, lying, or rising, be cautious and deliberate. Move slowly, observe carefully, and align the heart and body. By repenting one’s transgressions, there will be no affliction.\n\nWhenever one dreams or travels and sees people flaying each other, consuming strange foods, or men and women in disorder, with yin and yang inverted, the body is likely to fall ill.",
      "start_char": 3733,
      "end_char": 4040,
      "start_sentence": 105,
      "end_sentence": 113,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.205251932144165,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上八素真经占候入定妙诀.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}