{
  "source_id": "洞玄灵宝长夜之府九幽玉匮明真科",
  "source_file": "chunked_daozang\\洞玄灵宝长夜之府九幽玉匮明真科.json",
  "total_chunks": 21,
  "total_original_chars": 18245,
  "total_translated_chars": 108997,
  "total_translation_time": 493.7404053211212,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\洞玄灵宝长夜之府九幽玉匮明真科.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "*The Cavernous Mystery of the Numinous Treasure: The Jade Casket of the Nine Dark Realms of the Long Night’s Repository—The Luminous Statutes of Authentic Reality*\n\n**Title:** *The Cavernous Mystery of the Numinous Treasure: The Jade Casket of the Nine Dark Realms of the Long Night’s Repository—The Luminous Statutes of Authentic Reality*\n**Author:** Unknown (approximately dated to the Eastern Jin dynasty)\n**Classification:** One of the ancient *Scriptures of the Numinous Treasure* (*Lingbao Jing*)\n**Volume:** One fascicle\n**Base Text:** *Daoist Canon of the Orthodox Tradition* (*Zhengtong Daozang*), Proper Section I\n**Collated Manuscripts:** Dunhuang manuscripts P.2730, P.2442, P.2406, P.2352, P.4658, and S.6312+S.7730+S.2451\n\n---\n\nAt that time, the Celestial Worthy of Primordial Beginning dwelled in the Fragrant Grove Garden, accompanied by seven thousand two hundred and forty youths. There, he expounded the teachings of transformation, bestowing upon them the majesty of bodily transcendence.\n\nThen, the Celestial Worthy emitted a radiance of five colors, which pierced through the celestial halls of perpetual joy and the hells of the ten directions’ boundless worlds. The youths, gathered in one place, beheld the men and women of virtue in the celestial halls of bliss—carefree and unburdened, their clothing and sustenance arising naturally. Yet they also witnessed the boundless worlds’ hells, where condemned souls toiled in penal servitude: hungry ghosts and deceased spirits, naked and unclothed, their heads and feet shackled in iron, standing upon mountains of blades, bearing iron staves upon their backs. Great and small dragged one another, their five viscera rotting away until no human form remained. When hungry, they ate embers; when thirsty, they drank fiery essence. They were dragged and cast into the Three Paths and Eight Difficulties.\n\nThereupon, the youth of superior wisdom prostrated himself, eyes closed and face to the earth, kowtowing to address the Celestial Worthy: “Today, while attending your seat, we have witnessed the roots of good and evil fates within the heavens and hells. Our hearts tremble with dread, our five spirits grieve in terror. Daring to rely upon your boundless compassion, we humbly inquire: Would that the Celestial Worthy enlighten our benighted minds, directly bestow your stern instruction, and expound the mysterious teachings, that all may attain clarity. For those of future generations who fail to behold these statutes and precepts, they shall tread into the Five Defilements’ cauldrons of poison. They will encounter calamity and harm, unable to transcend their forms. Whether man or woman, all shall become like the hell-bound convicts, hungry ghosts, and penal spirits we now see—enduring eons of suffering in the mire, never to return. Ignorant and made to answer for their deeds, how pitiful and sorrowful! May these luminous statutes and precepts of the authentic reality be established as the karmic conditions for goodness in the world to come, that all may generation after generation receive this great fortune, escape the roots of suffering, transcend the Three Paths, and ascend to the celestial halls.”\n\nThe Celestial Worthy of Primordial Beginning replied: “Excellent, excellent! Your question is of profound importance. The *Luminous Statutes of Authentic Reality* within the *Jade Casket of the Nine Dark Realms of the Long Night’s Repository* fully expound the karmic causes of sin and fortune, the retributions of good and evil, the liberation from the roots of suffering, and the precepts for cultivating conduct. Through these, the body enters radiance, evil is shunned, and goodness pursued, ultimately returning to the gate of fortune. This Dharma is vast and universal, broadly delivering gods and humans. Those in the cycle of birth and death receive its grace, escape the Eight Difficulties, transcend the Three Realms, and partake of natural blessings. Generation after generation, they shall rejoice, enjoying endless felicity. I now impart this to you—guard it in secret.”\n\nThe youth of superior wisdom advanced, bowed, and knelt in reverence, addressing the Celestial Worthy: “We humbly inquire: By what karmic causes do we now universally behold the celestial halls of bliss and the hells of the boundless worlds, where the retributions of good and evil arise? From whence do they come?\n\nWhat cultivation in life leads to flight and transcendence, carefree wandering in the Upper Clarity, and ascension to the ranks of the lofty immortals?\n\nWhat karmic cause in life allows the body to attain liberation through simulated death, extinguishing all action?\n\nWhat karmic cause in life leads to ceaseless rebirth after death?\n\nWhat karmic cause in life results in death and subsequent appointment as an official of the celestial bureaus, the body suffused with radiance?\n\nWhat karmic cause in life leads to rebirth among the various heavens, becoming a guest of the Most High?\n\nWhat karmic cause in life results in death without confinement, freely associating with the Five Emperors?\n\nWhat karmic cause in life leads to posthumous investiture as a numinous spirit of the earth?\n\nWhat karmic cause in life results in death and ascension as one of the host of sages, driving a chariot through the clouds?\n\nWhat karmic cause in life leads to posthumous ascent to the halls of fortune, where clothing and sustenance arise naturally?\n\nWhat karmic cause in life results in death and rebirth in the Southern Palace, returning to the realm of humans?\n\nWhat karmic cause in life leads to descent into hell after death, enduring eternal night?\n\nWhat karmic cause in life results in death and the infliction of torment, myriad pains afflicting the body?\n\nWhat karmic cause in life leads to death without sustenance, dwelling among hungry ghosts?\n\nWhat karmic cause in life results in death and separation, the body shattered and form destroyed?\n\nWhat karmic cause in life leads to death as a convict, dragged and cast into the Three Bureaus?\n\nWhat karmic cause in life results in death and immersion in boiling cauldrons, never to regain human form?\n\nWhat karmic cause in life leads to death and wandering among the forests of swords, wind and blades assailing one another?\n\nWhat karmic cause in life results in death with the head scorched and charred, bearing a mountain of fire upon it?\n\nWhat karmic cause in life leads to death without clothing, an iron staff borne upon the back?\n\nWhat karmic cause in life results in death with the body shorn and mutilated, bearing stones without respite?\n\nWhat karmic cause in life leads to death in shackles and fetters, imprisoned in darkness, the Three Luminaries obscured?\n\nWhat karmic cause in life results in ceaseless toil, food and rest forever denied?\n\nWhat karmic cause in life leads to death with the tongue torn out, pierced by iron awls?\n\nWhat karmic cause in life results in death drawing the dark waves to irrigate the Four Rivers?\n\nNow, beholding such beings in hell, what transgressions in life have they committed to endure such retribution? Their souls suffer torment to this degree—how many years must pass before they attain liberation? On the day of their release, shall they be reborn as beasts of burden, or return to the realm of humans? We beseech you to distinguish and expound upon the roots of fate, to reveal the karmic causes for rebirth, and to establish the conditions for goodness in the world to come. If we are graced with your enlightenment, we shall receive the sagely benevolence.”\n\nThereupon, the Celestial Worthy commanded the flying divine beings of the ten directions to open the *Jade Casket of the Nine Dark Realms of the Long Night’s Repository* and bring forth the *Luminous Statutes of Authentic Reality*, that the youths might be delivered.\n\nAt that moment, the great sages of the various heavens, the honored deities of the primordial limit, the divine immortals and jade maidens—an innumerable host beyond reckoning—all simultaneously approached the seat.\n\nHeaven scattered fragrant blossoms, divine dragons performed with music, soaring songs resounded in all directions, jade-like melodies flowed and drifted. The sky was bright, the qi clear, all haze and obscurity dissolved. The Sun Lad poured forth essence, the Moon Maiden scattered flowers, radiant light converged from all sides, illuminating the various heavens. A hundred harmonies cleansed defilement, divine winds swept away dust. Rivers and seas lay hidden in stillness, mountains and peaks swallowed the mist. Dragon scales leapt and danced, divine beings and humans rejoiced universally. The gates of life and death opened to prosperity, blessings and felicity spread universally. The Five Sufferings were released, the Nine Dark Realms pardoned souls. Long-bound prisoners were freed, ascending to the heavens. Men and women rejoiced, everlasting joy abounded, the various heavens celebrated, prostrating to hear the decisive words.\n\nFrom the *Jade Casket of the Nine Dark Realms of the Long Night’s Repository*, the *Luminous Statutes of Authentic Reality* declared:\n\n**The Luminous Statutes state:** In this life, devote yourself to learning, forsake sensual desire, and sever emotional attachments. Maintain a perpetual fast, uphold the precepts, recite scriptures day and night without weariness, and cultivate the Dao at all times. Harmonize the Six Conducts, soften the heart, and darken the intent. Your thoughts dwell in the Dharma, and though you cycle through life and death, your vow remains unbroken. Through lifetimes of karmic conditions, your name is inscribed in the Golden Registers, listed among the Nine Heavens. Thus, you shall attain the ability to ride the void, soaring in broad daylight, driving the radiant chariot and spurring the dragon to ascend to the Jade Clarity Heaven.\n\n**The Luminous Statutes state:** In this life, devote yourself to learning and practicing the scriptural teachings. Ingest essence and swallow qi without weariness or rest. Maintain a fast, regulate your diet, refine yourself through breath, accumulate merit, and spread virtue. Your name is inscribed in the Upper Clarity Heaven. Thus, you shall attain liberation through simulated death as a lower immortal, roaming the Five Peaks. In a later life among humans, you shall again receive the scriptural teachings, become a master of the lineage, perfect the turning of the Dao’s wheel, and attain the rank of upper immortal, soaring in broad daylight to join the exalted perfected.\n\n**The Luminous Statutes state:** In this life, refine the authentic and ingest divine elixirs. The Five Minerals stabilize life, and the divine treasures of the Five Palaces are secured. Though your merit is modest and your virtue slight, your destiny has yet to ascend to heaven. When your body undergoes extinction, your bones shall remain fragrant and flourishing, imperishable for countless kalpas. In an instant, you shall regain form and be reborn among humans. Endowed with wisdom and keen insight, you shall foresee fortune and misfortune, your destiny unimpeded, your vision penetrating. You shall command ghosts and spirits, cycling without cessation, and attain the scriptures to become a Perfected of the Nine Palaces.\n\n**The Luminous Statutes state:** In this life, devote yourself to the Dharma, subdue ghosts, and heal the sick. Assist the celestial rectifying qi, act with diligence and care, and never violate the statutes and precepts. Your deeds accord with the Dharma, and your merit and virtue towering. Praised by the earth deities, your name ascends to the various heavens. At death, you shall rise to the Southern Palace, receiving the title of Supreme Attendant to the Celestial Offices, governing all ghosts and spirits. In a later life, you shall be reborn as a human patriarch, teaching and transforming the world, penetrating the natural, and cycling without end. Your rank shall reach that of divine immortal.\n\n**The Luminous Statutes state:** In this life, cultivate goodness and revere the divine. Make offerings to the Three Treasures, pay homage to and receive the teachings of your masters and lineage. At death, you shall ascend to heaven as a guest of the Most High. In a later life among humans, you shall be honored as a human patriarch, respected by the Three Realms, and praised by ghosts and spirits. Your household shall be pure and noble, delighting gods and humans. From this, you shall study and receive the great scriptures, maintain fasts, uphold the precepts, and broadly perceive the fields of merit. When your merit is complete and your virtue sufficient, you shall attain the rank of divine immortal.\n\n**The Luminous Statutes state:** In this life, devote yourself to the Dao, journeying to renowned mountains. On the eight seasonal nodes and your natal day, pay homage to and invoke the divine. Burn incense and make vows with unwavering devotion. Relieve the destitute, rescue the distressed, and deliver sentient beings. Reverently honor your masters and the Three Treasures, moving the various heavens to respond. Recommended by the Five Emperors, your name is proclaimed in the Azure Palace. At death, you shall directly ascend to the Five Peaks, unbound by confinement, and consort with the Five Emperors. In a later life among humans, you shall receive the great scriptures, guarded by divine beings, your might subduing the Five Directions. None shall fail to submit, and all shall follow your will. Divine elixirs and jade mushrooms shall abound without seeking, your body shall command water and fire, transforming in myriad ways. With unbroken karmic conditions, you shall receive the title of Perfected of the Five Emperors.\n\n**The Luminous Statutes state:** In this life, be courageous and resolute, pacifying the Four Directions. Assist the rectifying qi of the times, executing the treacherous and malevolent. Keep your heart pure and your body clean, your conduct aligning with the divine. After death, your soul shall ascend to receive the scriptures in the Southern Palace, becoming a Luminous Duke of the Four Poles or a spirit of blessed radiance. In a later life among humans, you shall possess penetrating insight, attaining the natural effortlessly. Revered by the Three Offices and honored by gods and humans, you shall rescue those in distress and perform great deeds. With unbroken karmic conditions, you shall attain the Dao of Non-Action and Perfection.\n\n**The Luminous Statutes state:** In this life, be reverent and faithful, practicing the Ten Superior Precepts of Wisdom. Accumulate all good deeds, make offerings to Dharma masters, burn incense, and light lamps to assist the celestial illumination, shining upon the Ten Directions. Bestow kindness upon the virtuous, and vow to deliver sentient beings. At death, you shall ascend to the Eastern Florescence, receiving the title of Flying Immortal, your rank equal to the Ten Transformed Disciples of the Most High. You shall drive the chariots of the assembled sages, roaming the clouds. In a later life, you shall be born into the household of a noble lord or king, enjoying joy through the generations, ever encountering enlightened masters. You shall study and receive the scriptural teachings, establishing great merit. Revered by the various heavens, honored by the divine, and looked up to by gods and humans, you shall attain the natural effortlessly. Your blessings and felicity shall be towering, unmatched. When your merit is complete and your virtue perfected, you shall ascend to heaven in broad daylight.\n\n**The Luminous Statutes state:** In this life, delight in and honor the supreme scriptures, making offerings to the Three Treasures and broadly opening the Dharma gates. Donate wealth and distribute alms to the poor. Provide your masters with Dharma robes, establish halls of practice, and keep lamps burning through the night. Within the Nine Dark Realms, the world shall witness your radiance. At death, you shall ascend to the heavenly halls, carefree and joyful, your clothing and food naturally provided. In a later life, you shall be born into the household of a wealthy and noble king, blessed through the generations with good karmic conditions. Again, in your noble and prosperous state, you shall make exceptional offerings, maintain fasts, uphold the precepts, and deliver sentient beings. Praised by the earthly administrators, your name shall ascend to the various heavens. When your merit is complete and your virtue sufficient, your body shall emanate light, a circular image appearing above your neck. You shall soar in broad daylight, ascending to the Mysterious Capital to become a Perfected King of Immortals.\n\nThe *Luminous Perfection Regulations* states: Those born into the world who serve their masters, make offerings to the Daoist scriptures, maintain long fasts and uphold the precepts, never violating the celestial statutes, burn incense and light lamps to illuminate the various heavens, their radiance penetrating the Nine Dark Realms, bringing light to the long night—such that their seven generations of ancestors rejoice in peace, free from sorrow and suffering. Those who perform good deeds, extensively cultivate fields of merit, broadly deliver all beings, and bestow kindness upon the multitude—when their immortal destiny is not yet complete and their dharma-bound fate requires further dissolution—shall ascend at death to the Southern Palace and immediately be reborn. Returning to a noble household, within the palace of an emperor, they shall live at ease and unhurried. There, they shall renew their vows with exceptional sincerity and diligence, their resolve unwavering, their merit ever-renewing. Praised by the Three Realms, their names shall be inscribed in the Upper Clarity. When their destined dissolution is fulfilled, they shall attain flight, ascending to the Great Ultimate to assume the rank of Immortal Duke.\n\nThe Flying Heavenly Divine Persons declare: The *Luminous Perfection Regulations of the Nine Dark Realms’ Jade Casket* records the ten good karmic conditions and the merits accrued through virtuous conduct. Their names shall be inscribed in the golden tablets and jade characters of the divine immortals among the heavens. Before their destined ascension is complete, they shall undergo cyclic rebirth, ascending at death to the heavenly halls where clothing and food arise naturally, carefree and without striving, their blessings and joys beyond measure. Reborn into wealth and nobility, within the household of an emperor, they shall enjoy happiness through the generations, bound in karmic affinity with the Dao. Building upon this foundation, they shall diligently cultivate the great dharma, broadly establish good deeds, their devotion unwavering, their aspirations ever-renewing. Praised by the Three Realms, they shall attain the rank of divine immortals. Yet if, amid their blessings, they fail to remain diligent, indulging in laxity and regression, they shall reenter the gates of evil, committing violent and treacherous acts, their deeds disloyal, violating the laws and sinking into the roots of wickedness. Once the ladder of goodness is lost, there shall be no return. Let all future worthies reflect deeply upon these words.\n\nThereupon, seventy-two hundred and forty divine youths of the various heavens simultaneously voiced their approval. When the Flying Heavenly Divine Persons finished expounding the karmic retributions of the ten good conditions, the divine youths rejoiced and paid homage. Then the Flying Heavenly Divine Persons offered this hymn:\n\nDiligent in fasting and precepts,\nReciting scriptures to restrain the six senses—\nThey attain flight through empty space,\nTheir radiance ascending to Jade Clarity.\n\nWith sincere heart they uphold the scriptural teachings,\nRefining the five spirits through breath and absorption.\nTheir merit crowns the heavens,\nThrough cyclic rebirth they become superior immortals.\n\nThrough ascetic practice they cultivate the Dao of life,\nIngesting medicines and refining the essence of mushrooms.\nWhen dissolution comes, their form does not perish,\nTheir bones exude natural fragrance.\n\nThrough rigorous discipline they master the methods of spirits,\nDriving and striving to demonstrate their merit.\nWhen dissolution comes, they fill the offices of the capital,\nLater reborn as human patriarchs.\n\nReceiving the Dao and revering the divine,\nMaking offerings to the Three Treasures in truth—\nIn life they are honored among men,\nAt dissolution they become guests of the Most High.\n\nOn the eight seasonal nodes they wander sacred mountains,\nVowing to deliver sentient beings.\nThey ascend to become companions of the Five Emperors,\nIn later lives endowed with majesty.\n\nWith courage and impartiality they calm their minds,\nTurning away from evil and extinguishing treachery.\nFeared and revered by the Three Officials,\nThey become patriarchs of heaven and men.\n\nReverently upholding the Ten Precepts,\nBurning incense and keeping lamps ever-bright—\nTheir merit equals tenfold repayment,\nAttaining the rank of flying immortals.\n\nMaking offerings to the Three Treasures and scriptures,\nDispersing alms to establish diligent merit—\nAt dissolution they ascend to the heavenly halls,\nLater reborn into the household of a king.\n\nServing their masters beyond even the divine,\nJoyfully facing the true scriptures—\nBorn into noble households,\nAt dissolution they enter the courts of the Three Realms.\n\nThe *Luminous Perfection Regulations* states: In the boundless world, men and women who in life perform no good deeds, their actions rooted in evil, assaulting their masters and slandering the virtuous, committing murder without principle, showing no regard for sentient beings, practicing cruelty and oppression, harboring treacherous schemes, envying those superior to themselves, suppressing and silencing the worthy and enlightened—upon death, they shall face retribution, their sinful souls bound and confined, descending directly into hell. In the long night, they shall endure every torment, their suffering unbearable. After ten thousand kalpas, they may return, but only to the paths of non-human beings, forever barred from the gates of blessing, eternally mired in the roads of sin, endlessly cycling without deliverance, for a hundred million kalpas without hope of return.\n\nThe *Luminous Perfection Regulations* states: In the boundless world, men and women who in life set their minds and intentions upon evil as their constant practice, inflicting boundless cruelty, deceiving and harming the loyal and good, destroying virtue and fostering wickedness, slandering and attacking the worthy—upon death, they shall face retribution, their bodies transformed into those of ox-headed jailers. Day and night they shall be tortured, their suffering beyond words. Their bodies shall fester and rot, no longer retaining human form. After ten thousand kalpas, they may return, but only to the lands of frontier barbarians, possessing human form but lacking human nature, forever barred from the human path, eternally mired in the gates of sin, drifting through the five sufferings and eight adversities, without deliverance, for a hundred million kalpas without hope of return.\n\nThe *Luminous Perfection Regulations* states: In the boundless world, men and women who in life are miserly and greedy, seeking only to benefit themselves, never considering others, seizing from the four classes, incurring the resentment of gods and men, insatiably devouring, enriching only themselves—upon death, they shall face retribution, becoming hungry ghosts and beasts, swallowing fire and eating coals, never satisfied. Their bodies shall char and fester, no longer retaining human form, drifting through the roads of ash and embers, their suffering beyond words. After ten thousand kalpas, they may return, but only into the bodies of the six domestic animals, forever barred from the human path, eternally trapped in alien forms, without deliverance, their hope of return exceedingly remote.\n\nThe *Luminous Perfection Regulations* states: In the boundless world, men and women of wealth and nobility who in life oppress and bully the poor and lowly, seize what others love, separate others from their kindred, dividing flesh and bone to dwell in distant places—if they commit incest with their six relations, such sins are profoundly grave. Upon death, they shall face dismemberment, their bodies torn apart, heads severed from torsos, their souls shorn and bound in chains and fetters. They shall be dragged back and forth over beds of iron needles, unable to eat or rest, thrice daily tortured before being reborn into the bodies of oxen and horses to repay their karmic debts. Forever barred from the human path, eternally mired in the roots of sin, without deliverance, for a hundred million kalpas trapped in alien forms.\n\nThe *Luminous Perfection Regulations* states: In the boundless world, men and women who in life commit evil and treachery, cursing the virtuous, invoking gods and ghosts, swearing oaths before the Three Officials, killing living beings in licentious sacrifices, praying to and worshipping demonic spirits, engaging in lewd dances and sorcery, calling themselves \"aunt\" or \"uncle,\" greedily devouring the common folk, wantonly committing senseless acts—when their crimes accumulate and their sins are fixed, upon death they shall face retribution, their souls imprisoned as convicts, drifting through the Three Officials and the Five Peaks. Thrice daily they shall be tortured, their suffering beyond words. After ten thousand kalpas, they may return as lowly persons, or afflicted by the six adversities, lacking human form, sunk deep in sin. Their hope of return is dark and distant, without deliverance, forever barred from the path of blessing.\n\nThe *Mingzhen Canon* states: In the boundless world, men and women who in life commit crimes—hands that slay rulers and fathers, plots to betray masters and teachers, murderous harm to human lives, bullying the weak with brute strength, assaulting the virtuous, cruelty in official posts, wanton suffering inflicted without cause, false accusations and grievances cried out—shall see their vengeful karma stretch to the heavens. Some expose the Three Luminaries to nakedness, defile and insult the Northern Lord, show no reverence for Heaven and Earth, no fear of gods and spirits, destroy scriptures and teachings, and defile the celestial perfected. Upon death, they shall face retribution, their bodies cast into cauldrons of boiling broth, their five limbs stewed and dissolved until no human form remains. A hundred poisons shall be poured upon them, pain unbearable, suffering beyond endurance. After ten thousand kalpas, they may return as beasts of burden, or as lowly persons afflicted with deafness, blindness, and the six infirmities, lacking human form, subject to slaughter at others’ whim, repaying old enmities. The path of blessing grows ever more distant, the roots of sin ever deeper, with no deliverance, forever sunk in inescapable damnation.\n\nThe *Mingzhen Canon* states: In the boundless world, men and women who in life act without faith in the Great Law, showing no reverence for the divine, or feign devotion to the Three Treasures while their hearts remain uncommitted, treat scriptures with disdain, and defile sacred texts—some transmit teachings to disciples without regard for the ordained years, or secretly pass on the Way without invoking Heaven and Earth, forging their own doctrines in violation of the Four Illuminations. Some observe fasts and precepts with negligence, doubting and slighting the perfected. Their sins are grave and heavy. Upon death, they shall be shaved and shackled, made to climb sword trees where winds from eight directions blow the branches low and high, their feet slipping onto blade mountains, ascending and descending without end, their bodies torn and wounded, pain unbearable, agony beyond endurance. After ten thousand kalpas, they may return as the most foolish of beings, or be afflicted with the six infirmities, deaf and blind, forever barred from the Dao, eternally shut out from the gates of learning. Trapped in the Five Sufferings, sunk deep in the causes of sin, they shall find no deliverance, forever bound to evil roots.\n\nThe *Mingzhen Canon* states: In the boundless world, men and women who in life act without compassion or filial piety, lacking benevolence or loyalty, cursing and humiliating parents, turning kin against one another—some boil and slaughter livestock, carving and maiming, cutting short lives through hunting, poisoning and butchering living beings. Their sins are deeply perverse. Upon death, they shall face cruel retribution, forced to swallow fire and eat coals, burned by flames until their heads and faces are scorched, their bodies rotted beyond recognition. They shall bear iron cauldrons on their backs and wear mountains of fire upon their heads, pain beyond endurance, torment beyond bearing. They shall return as beasts of burden, subject to slaughter at others’ hands to repay old enmities, forever losing the human path, eternally mired in the roots of sin, with no deliverance, no hope of return.\n\nThe *Mingzhen Canon* states: In the boundless world, men and women who in life kill living beings in licentious sacrifices, betray the Dao to follow heresy, mock Daoist priests, slander the perfected, show contempt for the Three Treasures, abandon the Law for falsehood, indulge in wanton impiety, deny predestined fate, and forge their own doctrines—some dig up human bones, exposing them in the wild. Their sins are grave and heavy. Upon death, they shall face severe retribution, stripped naked and made to bear iron rods upon their flesh, their five limbs festering with pus, suffering beyond endurance. After ten thousand kalpas, they may return as the most foolish of beings, dull and deaf, or afflicted with demonic illnesses, no longer human. The path of blessing shall forever diverge, entwined with sin, with no deliverance, lost for countless kalpas.\n\nThe *Mingzhen Canon* states: In the boundless world, men and women who in life act without the Dao—robbing and plundering, committing violent crimes, taking lives with blades and arrows without hesitation, refusing to repay debts, demanding without end—shall bear grave sins. Upon death, they shall face calamitous retribution, their bodies shaved and severed, made to bear mountains and carry stones, laboring without rest day or night, mired in toil and misery beyond endurance. After ten thousand kalpas, they may return as oxen or horses, repaying enmities with their strength. Even if reborn as humans, they shall suffer mutilation, imprisonment, and beatings, drifting through the Eight Adversities, longing for death yet denied it, tormented by endless sorrow. They shall find no deliverance, forever trapped in the gates of sin.\n\nThe *Mingzhen Canon* states: In the boundless world, men and women who in life act without the Dao, moving under cover of darkness to break into homes, abducting wives and concubines, seizing clothing, plotting wicked schemes, and harming men and women—shall upon death face severe punishment, their heads and feet locked in shackles, imprisoned in darkness where the Three Luminaries are unseen, subjected to torture and pain beyond endurance. After ten thousand kalpas, they may return as lowly persons, enslaved and beaten, or deaf and blind, led by others, repaying old enmities. Forever barred from the path of goodness, their evil roots deepening, they shall remain lost for countless kalpas, with no deliverance.\n\nThe *Mingzhen Canon* states: In the boundless world, men and women who in life act without the Dao, heedless of good causes, roaming in the three spring months for hunting, flying hawks and unleashing hounds, setting snares and nets, burning mountains with fire, shooting wild beasts, and slaughtering living beings—shall bear cruel and perverse sins. Upon death, they shall be condemned to heavy suffering, made to bear iron rods, a thousand pains assailing them at once, driven to the ends of the earth without rest, their souls tormented by unrelenting agony. After ten thousand kalpas, they may return as wild beasts, forever hunted and butchered to repay old enmities. Even if reborn as humans, they shall constantly suffer at the hands of evil men, whipped and tormented for ten thousand kalpas, sorrow and suffering their constant companions. The path of blessing grows ever more distant, the roots of sin ever deeper, with no deliverance, lost in an endless night.\n\nThe *Mingzhen Canon* states: In the boundless world, men and women who in life act with malicious tongues and deceitful words, stirring strife within and without, slandering the Dao and the virtuous, disbelieving in scriptures, speaking falsely while harboring evil, plotting in secret, attacking the four classes, and spreading rumors about others—whether men or women—shall incur the vengeful karma of gods and humans, cursing without restraint, uttering vile and filthy words, invoking ghosts and spirits, and hurling mutual curses. Their sins are grave and heavy. Upon death, they shall suffer cruel torment, their tongues torn out and pierced with iron awls, struck without limit by mighty celestial warriors wielding iron rods, their bodies rotted beyond recognition, pain beyond endurance. After ten thousand kalpas, they may return as dogs, forever barking at others, beaten and abused at will. Even if reborn as humans, they shall be born among barbarians, no longer human, the target of all evil, repaying old enmities. Forever barred from the human path, with no hope of return, they shall drift endlessly in the gates of sin, with no deliverance.\n\nThe *Luminous Percepts of the True* states: In the boundless world, men and women who live in the world and establish their conduct indulge in wine and lust, losing their nature in distraction, growing reckless and deluded. Their five emotions scatter in chaos, driving away spirit and harming qi. Drunk and greedy for desire, they commit evil unawares, shouting curses and vile words, acting alone without adversary. They strike the good, defile and scorn the Dao and its teachings, slander and destroy scriptures, turn from truth to falsehood, break promises and betray trust, deceive and malign the four assemblies. Their deeds stray from the Dao, and their sins run deep and perverse.\n\nUpon death, they face heavy retribution: their souls endure bitter torment, drawing and pouring the dark waves to flood the Four Rivers. Banished to become rivers and streams, they toil day and night without rest, bound in iron fetters and shackles, dragged and pulled endlessly through the long, dark night, never to be freed. After ten thousand kalpas, they shall be born among thieves—poor, base, and afflicted with loathsome diseases, despised by all, repaying old enmities. The bonds of their karmic causes tighten, their path to fortune grows ever more distant, and their roots of sin take deeper hold. They cannot be delivered, nor find any way out.\n\nThe Flying Celestial Divine Person says: The *Luminous Percepts of the Jade Casket of the Nine Dark Realms of the Long Night’s Repository* enumerate fourteen categories of karmic retribution. Past deeds accumulate, bearing the weight of perverse and evil adversities. Good binds to good, evil follows evil, each adding to the other in an unbroken cycle. Having lost the human path, they do not even realize it, sinking into the six kinds of beasts. Even if reborn among humans, they shall be utterly foolish, or born among barbarians, or afflicted with the six illnesses, dragged and pulled endlessly for ten thousand kalpas with no escape. Their lives in the world are brief, but their deaths are long and sealed. Once they lose the path of goodness, they forever stray from the realm of the worthy. In the long, dark night, when shall they find deliverance?\n\nMen and women of future generations, take heed and rouse yourselves! Establish great merit to redeem yourselves. Receive the Ten Precepts, and you may avoid this calamity. Remember well these words, and never forget them.\n\nThereupon, seven thousand two hundred and forty divine youths, the Great Perfected Saints of the heavens, all proclaimed their assent.\n\nThe Flying Celestial Divine Person having expounded the fourteen categories of karmic retribution for evil deeds and the unbroken bonds of evil causes, the divine youths rejoiced, paid homage, and then the Flying Celestial Divine Person spoke in verse:\n\nThose who in life harbor no good thoughts,\nCruelly abuse their teachers and treasures,\nShall in death suffer ten thousand agonies,\nAnd for ten thousand kalpas lose the human path.\n\nThose who cruelly flatter the loyal and good,\nSlander and strike the worthy,\nShall in life dwell among barbarians,\nAnd in death take the form of oxen and horses.\n\nThose who are miserly and greedy, desiring only gain,\nNever thinking to give to living beings,\nShall in death become hungry ghosts,\nAnd later be born as beasts of burden.\n\nThose who in wealth and power oppress the poor and lowly,\nSeize and separate others from their kin,\nShall in body suffer the retribution of being torn apart,\nAnd their souls, as ghosts, endure shaving and branding.\n\nThose who curse the innocent,\nAnd in lewd rites dance for evil spirits,\nShall be dragged through the Three Wretched Realms,\nAnd for ten thousand kalpas be born in lowly bodies.\n\nThose who plot treason and abuse their lords and fathers,\nDefile and disgrace the Celestial Perfected,\nShall in death be boiled in cauldrons of scalding water,\nTheir suffering unending, with no return.\n\nThose whose minds are not steadfast and resolute,\nWho slight and scorn the Heavenly Treasures of scripture,\nShall after death walk the path of sword trees,\nWhere wind and blades never cease.\n\nThose who harbor no compassion,\nBut cruelly harm living beings,\nShall in death bear iron cauldrons,\nAnd for ten thousand kalpas wear mountains of fire.\n\nThose who betray the Dao and turn to evil spirits,\nSlander and turn their backs on the Perfected,\nShall in death have no clothes to wear,\nAnd iron rods shall never leave their bodies.\n\nThose who rob and steal others’ wealth,\nCutting and stabbing the people of heaven,\nShall in death suffer shaving and amputation,\nAnd in life be maimed by punishment.\n\nThose who, under cover of darkness, break into homes,\nAnd act wantonly as they please,\nShall in death be forever confined in darkness,\nNever to see the light of sun or moon.\n\nThose who accumulate deeds without thought of kindness,\nAnd roam hunting to capture living beings,\nShall have their enmity repaid with iron rods,\nDriven and chased without a moment’s rest.\n\nThose of fierce nature who stir up strife with their tongues,\nCreating discord among kin and stranger alike,\nShall in death suffer the retribution of having their tongues torn out,\nAnd later be born to bark at others forever.\n\nThose who love wine and lose their original conduct,\nTheir five spirits all growing reckless,\nShall in death draw the waters of the dark waves,\nAnd pour them to flood the Four Rivers.\n\nThus the Flying Celestial Divine Person chanted in verse the karmic retribution of good and evil, proclaiming it to the divine youths. At that time, the celestial beings all awakened, clearly seeing the roots of their lives. They reflected on the sources of their past sins, reformed their hearts, and roused themselves to cultivate and uphold the scriptures. Their old debts were dispersed, the Nine Dark Realms were purified, and all were reborn amid good causes.\n\nThe divine youths received the Dharma-sound with reverence, rejoiced as one, paid homage, and departed.\n\nThe *Upper Grade on Deliverance from Karmic Retribution of Sin and Fortune in the Jade Casket of the Nine Dark Realms*\n\nThe Most High Lord of the Dao stepped forward, bowed, and addressed the Heavenly Worthy: Today, while attending in your presence, I have witnessed the divine youths receiving your majestic radiance, which illumines the halls of fortune in all the heavens and the hells of the boundless world, where the retribution of good and evil differs in suffering and joy. The good rejoice in peace, carefree and endless, while the evil wallow in misery, dragged through the Eight Difficulties, their bodies lost forever—how pitiable! Such retribution, bound to evil causes, faces endless kalpas of adversity, never recognizing the roots of their lives. Do they not possess merit to redeem and deliver the dead, to lead them out of the long night of the Nine Dark Realms, to enter the light, and be reborn in the gates of fortune?\n\nIf you would show compassion, the living and the dead would bear your grace. The departed would rest in peace, and the living would prosper, flourishing in wealth and honor, their lives long and enduring. Their influence would shade the eight distant lands, and their virtue would sprinkle the forests of orchids. Men and women of future generations would hear the Dharma-sound. I only pray, Heavenly Worthy, that you distinguish and explain, bestowing upon us the decisive words, so that all may see the precepts clearly and find peace.\n\nThe Heavenly Worthy addressed the Most High Lord of the Dao, saying: Listen well to my words, reflect deeply, and inscribe them in your heart. Day and night, hold them in mind, and never forget. I shall now explain the wondrous sound for you to follow, so that you may redeem sinful souls, open the way out of the long night, the Nine Dark Realms, and the Eight Difficulties. Their old adversities shall be dispersed, and they shall turn to the roots of faith, rejoicing in life and death, their karmic bonds spanning generations.\n\nThe method is most exalted and wondrous, transmitted but once in ten thousand kalpas. Only when a worthy and enlightened one appears in the world is it solemnly imparted. Kept secret, blessings descend; revealed, calamities draw near. The warning of the Wind and Blade is declared to the Perfected Illuminati—transgress the precepts and statutes, and blame not the heavens.\n\nThereupon, the Heavenly Worthy commanded the Flying Celestial Beings to expound the karmic retribution of sins and blessings, delivering the highest grade of souls. As the scripture was recited, the luminaries of the heavens—sun, moon, and stars—radiated their brilliance, universally illuminating the boundless worlds of the Nine Earths and the long-night abodes of the Nine Dark Realms. The long-bound hungry ghosts, the toiling dead souls, received the light upon their bodies and beheld their life-roots. Thereupon, they awakened, turning their hearts as one, all inclining toward goodness, contemplating the return to the gate of blessings. The Five Sufferings were dissolved, the Three Paths uplifted; karmic adversities were dispersed, and the hells found tranquility.\n\nAt that time, men and women universally heard the Dharma-sound. Those who had prepared their minds all attained divine transcendence.\n\nThe Flying Celestial Being declared: The *Highest Grade of the Jade Casket for Delivering the Dead from the Nine Dark Realms and Their Karmic Adversities* is to be performed during the six months of the year—namely, the first, third, fifth, seventh, ninth, and eleventh months. Within each month, on the first, eighth, fourteenth, fifteenth, eighteenth, twenty-third, twenty-fourth, twenty-eighth, twenty-ninth, and thirtieth days—a total of ten days—as well as on the Eight Seasonal Festivals, the days of *jiazi* and *gengshen*, one should set a tall lamp, nine feet high, in the central courtyard of the home. Upon this single lamp, kindle nine lamps, each radiating light to illuminate above the Nine Mysteries and the celestial halls of blessings, and below the boundless worlds of the Nine Earths and the long-night abodes.\n\nIn accordance with the ritual decorum and prescribed method, invoke and welcome the Heavenly Immortals, Earthly Immortals, Perfected Ones, Flying Immortals, the luminaries of the sun, moon, and stars, the Nine Palaces and Five Emperors, the Five Sacred Peaks and Three Rivers, the armies of the Four Seas—each numbering ninety-nine billion cavalry—as well as the thirty-two celestial overseers of the fast, the attendant incense-bearing Golden Lads, the flower-scattering Jade Maidens, the thirty-two direct messengers of the Five Emperors, and the flying dragon couriers who transmit words and memorials. Let them all descend together to oversee the ritual hall, receive the incense offerings, and bear the vows upward. When the circumambulation and rites are complete, they shall return to their celestial palaces.\n\nBy day, burn incense; by night, kindle lamps, ensuring the fragrance never ceases. Display the scripture in the courtyard beneath the nine lamps, circumambulate the lamps, and after offering incense and reciting vows, turn to the east and bow nine times, saying:\n\n*\"I, [Name], now take refuge in the Eastern Infinite Supreme Numinous Treasure Heavenly Worthy, the Great Sage Hosts who have attained the Dao, the Perfected Lords and Venerable Masters, the Nine Qi Heavenly Lords, and the myriad divine officials of the Eastern Realm. Today, I establish this fast, burn incense, and kindle lamps, dedicating these merits to illuminate all heavens. May they universally benefit the Emperor, lords of states, officials, common folk, Dharma-receiving masters, parents and honored kin, fellow disciples, recluses in the mountains and forests cultivating the true Dao, all worthy ones, the crawling and flying, wriggling and creeping, all sentient beings—may they all be delivered from the Ten Sufferings and Eight Difficulties, dwell eternally in non-action, and attain universal deliverance by nature. May the myriad generations of my ancestors, the imprisoned and wandering souls of my lineage, be bathed in light, liberated, and turned toward the roots of faith. May they depart the Five Paths, resolve karmic bonds, and find eternal joy in death, while the living receive grace. May the world know great peace, the Dao and virtue flourish. Thus, I burn incense and take refuge in the virtue of the Great Sage Hosts and Perfected Ones. After attaining the Dao, may I ascend into the formless and unite with the true Dao.\"*\n\nWhen finished, remove the headscarf, kowtow, and clasp the hands, repeating this eighty-one times. Then, turn to the south and bow three times, saying:\n\nI, [Name], now take refuge in the Southern Quadrant’s Boundless Supreme Numinous Treasure Heavenly Worthy, the Hosts of Great Sages who have attained the Dao, the Perfected Lords and Venerable Ones, the Three Qi Heavenly Lords, and the Divine Officials of the Southern Realm. Today, I establish this fast, burn incense, and light lamps, dedicating these merits to illumine all heavens. May they universally benefit emperors and kings, lords and officials, the people, masters who receive the Daoist teachings, parents and honored kin, fellow students and disciples, reclusive scholars in mountains and forests cultivating the true Dao, all worthy ones, the crawling and flying, the creeping and wriggling, all breathing beings—may all universally be delivered from the Ten Sufferings and Eight Difficulties, dwell eternally in non-action, and attain universal deliverance by nature. May the myriad generations of my ancestors, the imprisoned and wandering souls of my lineage, be bathed in light, liberated, and turned toward the roots of faith. May they depart the Five Paths, resolve karmic bonds, and find eternal joy in death, while the living receive grace. May the world know great peace, the Dao and virtue flourish. Thus, I burn incense and take refuge in the virtue of the Great Sage Hosts and Perfected Ones. After attaining the Dao, may I ascend into the formless and unite with the true Dao.\n\nWhen finished, kowtow and clasp the hands, repeating this twenty-seven times. Then, turn to the west and bow seven times, saying:\n\nI, [Name], now take refuge in the Western Quadrant’s Boundless Supreme Numinous Treasure Heavenly Worthy, the Hosts of Great Sages who have attained the Dao, the Perfected Lords and Venerable Ones, the Seven Qi Heavenly Lords, and the Divine Immortals and Officials of the Western Realm. Today, I establish this fast, burn incense, and light lamps, dedicating these merits to illumine all heavens. May they universally benefit emperors and kings, lords and officials, the people, masters who receive the Daoist teachings, parents and honored kin, fellow students and disciples, reclusive scholars in mountains and forests cultivating the true Dao, all worthy ones, the crawling and flying, the creeping and wriggling, all breathing beings—may all universally be delivered from the Ten Sufferings and Eight Difficulties, dwell eternally in non-action, and attain universal deliverance by nature. May the myriad generations of my ancestors, the imprisoned and wandering souls of my lineage, be bathed in light, liberated, and turned toward the roots of faith. May they depart the Five Paths, resolve karmic bonds, and find eternal joy in death, while the living receive grace. May the world know great peace, the Dao and virtue flourish. Thus, I burn incense and take refuge in the virtue of the Great Sage Hosts and Perfected Ones. After attaining the Dao, may I ascend into the formless and unite with the true Dao.\n\nWhen finished, kowtow and clasp the hands, repeating this sixty-three times. Then, turn to the north and bow five times, saying:\n\nI, [Name], now take refuge in the Northern Quadrant’s Boundless Supreme Numinous Treasure Heavenly Worthy, the Hosts of Great Sages who have attained the Dao, the Perfected Lords and Venerable Ones, the Five Qi Heavenly Lords, and the Divine Officials of the Northern Realm. Today, I establish this fast, burn incense, and light lamps, dedicating these merits to illumine all heavens. May they universally benefit emperors and kings, lords and officials, the people, masters who receive the Daoist teachings, parents and honored kin, fellow students and disciples, reclusive scholars in mountains and forests cultivating the true Dao, all worthy ones, the crawling and flying, the creeping and wriggling, all breathing beings—may all universally be delivered from the Ten Sufferings and Eight Difficulties, dwell eternally in non-action, and attain universal deliverance by nature. May the myriad generations of my ancestors, the imprisoned and wandering souls of my lineage, be bathed in light, liberated, and turned toward the roots of faith. May they depart the Five Paths, resolve karmic bonds, and find eternal joy in death, while the living receive grace. May the world know great peace, the Dao and virtue flourish. Thus, I burn incense and take refuge in the virtue of the Great Sage Hosts and Perfected Ones. After attaining the Dao, may I ascend into the formless and unite with the true Dao.\n\nWhen finished, kowtow and clasp the hands, repeating this forty-five times. Then, turn to the northeast and bow once, saying:\n\nI, [Name], now take refuge in the Northeastern Quadrant’s Boundless Supreme Numinous Treasure Heavenly Worthy, the Hosts of Great Sages who have attained the Dao, the Perfected Lords and Venerable Ones, the Brahman Qi Heavenly Lords, and the Divine Officials of the Northeastern Realm. Today, I establish this fast, burn incense, and light lamps, dedicating these merits to illumine all heavens. May they benefit emperors and kings, lords and officials, the people, masters who receive the Daoist teachings, parents and honored kin, fellow students and disciples, reclusive scholars in mountains and forests cultivating the true Dao, all worthy ones, the crawling and flying, the creeping and wriggling, all breathing beings—may all universally be delivered from the Ten Sufferings and Eight Difficulties, dwell eternally in non-action, and attain universal deliverance by nature. May the myriad generations of my ancestors, the imprisoned and wandering souls of my lineage, be bathed in light, liberated, and turned toward the roots of faith. May they depart the Five Paths, resolve karmic bonds, and find eternal joy in death, while the living receive grace. May the world know great peace, the Dao and virtue flourish. Thus, I burn incense and take refuge in the virtue of the Great Sage Hosts and Perfected Ones. After attaining the Dao, may I ascend into the formless and unite with the true Dao.\n\nWhen finished, kowtow and clasp the hands, repeating this nine times. Then, turn to the southeast and bow once, saying:\n\nI, [Name], now take refuge in the Southeastern Quadrant’s Boundless Supreme Numinous Treasure Heavenly Worthy, the Hosts of Great Sages who have attained the Dao, the Perfected Lords and Venerable Ones, the Brahman Qi Heavenly Lords, and the Divine Officials of the Southeastern Realm. Today, I establish this fast, burn incense, and light lamps, dedicating these merits to illumine all heavens. May they benefit emperors and kings, lords and officials, the people, masters who receive the Daoist teachings, parents and honored kin, fellow students and disciples, reclusive scholars in mountains and forests cultivating the true Dao, all worthy ones, the crawling and flying, the creeping and wriggling, all breathing beings—may all universally be delivered from the Ten Sufferings and Eight Difficulties, dwell eternally in non-action, and attain universal deliverance by nature. May the myriad generations of my ancestors, the imprisoned and wandering souls of my lineage, be bathed in light, liberated, and turned toward the roots of faith. May they depart the Five Paths, resolve karmic bonds, and find eternal joy in death, while the living receive grace. May the world know great peace, the Dao and virtue flourish. Thus, I burn incense and take refuge in the virtue of the Great Sage Hosts and Perfected Ones. After attaining the Dao, may I ascend into the formless and unite with the true Dao.\n\nHaving completed this, they kowtowed and pressed their cheeks to the ground, each nine times. Then, facing the southwest, they bowed once and said:\n\nI, [Name], now take refuge in the Boundless Supreme Numinous Treasure Heavenly Worthy of the Southwest, the Great Sage Hosts who have attained the Dao, the Perfected Lords and Venerable Ones, the Heavenly Lords of Brahma Qi, and the divine officials of the Southwest. Today, I establish this fast, burn incense, and light lamps. May the merit of this act illuminate the heavens, universally benefiting emperors and kings, lords and officials, the people, Daoist masters who transmit the teachings, parents and honored kin, fellow disciples, reclusive scholars of the true Dao in mountains and forests, all worthy ones, the crawling and flying, the creeping and wriggling, all breathing beings—may all universally be delivered from the Ten Sufferings and Eight Difficulties, dwell eternally in non-action, and attain universal deliverance by nature. May the myriad generations of my ancestors, the imprisoned and wandering souls of my lineage, be bathed in light, liberated, and turned toward the roots of faith. May they depart the Five Paths, resolve karmic bonds, and find eternal joy in death, while the living receive grace. May the world know great peace, the Dao and virtue flourish. Thus, I burn incense and take refuge in the virtue of the Great Sage Hosts and Perfected Ones. After attaining the Dao, may I ascend into the formless and unite with the true Dao.\n\nHaving completed this, they kowtowed and pressed their cheeks to the ground, each nine times. Then, facing the northwest, they bowed once and said:\n\nI, [Name], now take refuge in the Boundless Supreme Numinous Treasure Heavenly Worthy of the Northwest, the Great Sage Hosts who have attained the Dao, the Perfected Lords and Venerable Ones, the Heavenly Lords of Brahma Qi, and the divine officials of the Northwest. Today, I establish this fast, burn incense, and light lamps. May the merit of this act illuminate the heavens, universally benefiting emperors and kings, lords and officials, the people, Daoist masters who transmit the teachings, parents and honored kin, fellow disciples, reclusive scholars of the true Dao in mountains and forests, all worthy ones, the crawling and flying, the creeping and wriggling, all breathing beings—may all universally be delivered from the Seven Sufferings and Eight Difficulties, dwell eternally in non-action, and attain universal deliverance by nature. May the myriad generations of my ancestors, the imprisoned and wandering souls of my lineage, be bathed in light, liberated, and turned toward the roots of faith. May they depart the Five Paths, resolve karmic bonds, and find eternal joy in death, while the living receive grace. May the world know great peace, the Dao and virtue flourish. Thus, I burn incense and take refuge in the virtue of the Great Sage Hosts and Perfected Ones. After attaining the Dao, may I ascend into the formless and unite with the true Dao.\n\nHaving completed this, they kowtowed and pressed their cheeks to the ground, each nine times. Then, facing upward, they bowed thirty-two times and said:\n\nI, [Name], now take refuge in the Boundless Supreme Numinous Treasure Heavenly Worthy of the Upper Realm, the Great Sage Hosts who have attained the Dao, the Perfected Lords and Venerable Ones, the Thirty-Two Heavenly Emperors, the Perfected Ones and Jade Maidens of the Jade Capital, Mystic Metropolis, and Purple Tenuity Upper Palace, and the divine officials and immortals. Today, I establish this fast, burn incense, and light lamps. May the merit of this act illuminate the heavens, universally benefiting emperors and kings, lords and officials, the people, Daoist masters who transmit the teachings, parents and honored kin, fellow disciples, reclusive scholars of the true Dao in mountains and forests, all worthy ones, the crawling and flying, the creeping and wriggling, all breathing beings—may all universally be delivered from the Ten Sufferings and Eight Difficulties, dwell eternally in non-action, and attain universal deliverance by nature. May the myriad generations of my ancestors, the imprisoned and wandering souls of my lineage, be bathed in light, liberated, and turned toward the roots of faith. May they depart the Five Paths, resolve karmic bonds, and find eternal joy in death, while the living receive grace. May the world know great peace, the Dao and virtue flourish. Thus, I burn incense and take refuge in the virtue of the Great Sage Hosts and Perfected Ones. After attaining the Dao, may I ascend into the formless and unite with the true Dao.\n\nHaving completed this, they kowtowed and pressed their cheeks to the ground, each two hundred and eighty-eight times. Then, facing downward, they bowed twelve times and said:\n\nI, [Name], now take refuge in the Boundless Supreme Numinous Treasure Heavenly Worthy of the Lower Realm, the Great Sage Hosts who have attained the Dao, the Perfected Lords and Venerable Ones, the Ninefold Earthly Sovereigns, the Four Controllers and Five Emperors, the Twelve Immortal Officials, the Five Peaks and Four Waterways, the Perfected Ones of the Nine Palaces, the immortals and Jade Maidens, and the divine officials of the Boundless World’s earthly deities. Today, I establish this fast, burn incense, and light lamps. May the merit of this act illuminate the Boundless World’s eternal night abode and the Nine Dark Realms. Universally, may it benefit emperors and kings, lords and officials, the people, Daoist masters who transmit the teachings, parents and honored kin, fellow disciples, reclusive scholars of the true Dao in mountains and forests, all worthy ones, and the myriad generations of my ancestors—those long-dead souls confined in darkness, whose past transgressions of heavenly prohibitions and earthly precepts have bound them in sin, subjecting them to karmic retribution, endless cycles of suffering, and the Five Torments without escape. By this offering of incense and lamps, I repent and seek redemption, that light may universally shine upon the eternal night abode and the Nine Dark Hells. May the imprisoned souls be freed, their karmic roots dissolved, and the Three Offices and Nine Bureaus release them from confinement. May they be delivered and ascend, entering halls of blessing, departing the evil paths, and dwelling eternally in the gates of goodness. May the living rejoice, and all under heaven know peace. Thus, I burn incense and take refuge in the virtue of the Great Sage Hosts and Perfected Ones. After attaining the Dao, may I ascend into the formless and unite with the true Dao.\n\nHaving completed this, they kowtowed and pressed their cheeks to the ground, each one hundred and twenty times, and ceased.\n\nThe Flying Heavenly Spirits declared: According to the statutes of the Luminous Perfected, to deliver the myriad generations of ancestors from their deep-rooted sins, one must perform the Daoist rites with proper observance. Then, the Nine Dark Realms will open, and the long-imprisoned dead souls will receive the light. Such is the path of great compassion, an immeasurable field of merit.\n\nTo bow humbly, kowtow, and press one’s cheeks to the ground is to offer words of reverence and repentance. When the cinnabar heart and sincere intent are fully expressed, and devotion is utterly profound, resonance will naturally occur. Though the body may be weary and unable to endure further prostration, one may still offer a heartfelt bow to the Heavenly Perfected, without need for further physical submission.\n\nIf one merely adorns the exterior while the heart grows negligent, such prostrations weary the body in vain. Yet for those of sincere devotion, whose hearts and words align, the offering of incense and the voicing of vows already penetrate the myriad heavens—birth and death, sins and retributions, all dissolve without exception.\n\nThis merit is most weighty, praised throughout the Three Realms; its blessings towering and vast, beyond all measure. The Most High Dao Lord bowed deeply and addressed the Heavenly Worthy: \"Now having heard the Flying Heavenly Spirits expound upon the karmic bonds of sin and blessing, the supreme methods of deliverance, the rites of supplication and gratitude, and the dissolution of deep-rooted transgressions—so that in future lives, men and women may receive this grace, attain universal deliverance, and enter the light—if such goodness is practiced, yet further methods remain, I ask: when heaven sends grave disasters, the nation’s destiny falters, the stars and constellations stray from their courses, the four seasons lose their order, warfare and pestilence arise, the emperor finds no peace, plagues spread, and heaven and humanity suffer harm—what methods should be employed to dispel these calamities, deliver from peril, and resolve all inauspicious omens? I humbly beseech your teaching, that we may practice and thereby harmonize heaven and earth, assist the nation, and establish merit.\"\n\n\"If your instructions are received and followed, then blessings will spread throughout the ten directions, the nation’s destiny will be secure, the emperor will flourish, the realm will rejoice in peace, and boundless fortune will endure, so that in future lives, all beings may hear the sound of the Dharma.\"\n\nThereupon, the Heavenly Worthy instructed the Flying Heavenly Spirits to expound fully upon the supreme methods of deliverance from karmic bonds of sin and blessing, and the salvation of the land from plagues, perils, and disasters—whatever had not yet been fully explained—so that the Most High Dao Lord might hear it all in detail. Thus, those who had not seen would see, those who had not heard would hear, and all beings would be universally taught, enabling them to behold the light. Having spoken thus, the Heavenly Worthy commanded that the essential instructions be reverently received.\n\nThe Flying Heavenly Spirits declared: \"For the Nine Dark Realms of the Long Night’s Repository, the *Mingzhen Statutes* of the Jade Treasury prescribe this: when the emperor’s land suffers from pestilence, warfare, or dire peril, one must inscribe the five sacred texts of the *Lingbao True Writ* in cinnabar. In the central courtyard, arrange five altars corresponding to the five directions, placing one text upon each. Offer five taels of gold, fashioning one tael into a dragon for each, so that five dragons may guard the five texts. Further, present five-colored silken pledges to honor the Five Emperors. Those afflicted by calamity, according to their age, shall offer purple-silk writs to deliver their lives, secure the nation’s destiny, and dispel heavenly disasters, aligning the stars and constellations.\n\nIn spring, kindle nine lamps—or ninety, or nine hundred. In summer, kindle three lamps—or thirty, or three hundred. In autumn, kindle seven lamps—or seventy, or seven hundred. In winter, kindle five lamps—or fifty, or five hundred. During the intercalary months, kindle twelve lamps—or one hundred twenty, or one thousand two hundred. Additionally, set a tall lamp, nine feet in height, with nine lamps upon it, placed at the center to illuminate the Nine Dark Realms of the Long Night’s Repository.\n\nThe Great Dharma Master, standing at the center, shall loosen the hair and untie the topknot, anoint the body with mud and ashes, and perform the six-hour rites of supplication and gratitude while conducting the ritual in the central courtyard. If devout men and women wish to assist the nation in prayer, they shall scatter their hair and anoint themselves with mud and ashes at the gate, presenting their pleas.\n\nIn spring, the rites last nine days and nights; in summer, three days and nights; in autumn, seven days and nights; in winter, five days and nights; and during the intercalary months, twelve days and nights. Arraying the radiant lamps, their light will shine upon the boundless worlds within the Long Night, opening the Nine Dark Realms to clarity. The light will penetrate without end, the Three Luminaries will shine brightly, heaven and earth will be at peace, the stars and constellations will return to their places, the four seasons will harmonize, all calamities will vanish, warfare and pestilence will cease, heaven and humanity will rejoice, and the nation’s destiny will flourish.\n\nWhen the day’s rites conclude, burn the true writs, dispersing them in the blue smoke.\"\n\nThe Flying Heavenly Spirits continued: \"The Dharma Master shall enter through the Earth Gate, burn incense, and circumambulate the incense and lamps three times before standing facing east. Strike the teeth thirty-six times and invoke the furnace. Then invoke the furnace of the Supreme Three Heavens, the Primordial Qi of the Most High Dao Lord, summoning forth from within the master’s body the Three and Five Merit Officers, the Left and Right Attendants, the Left and Right Incense-Bearing Dragon Couriers, the Golden Lads of Incense, the Jade Maidens of Transmission, and the Five Emperors’ Direct Messengers—thirty-six of each—who shall emerge in solemn array. Notify the true officials of the four directions and the local deities: 'I now burn incense and perform the Dao rites. May the qi of the ten directions’ true perfected ones enter my body, so that my prayers swiftly ascend to the presence of the Most High, the Boundless Dao, the Supreme Worthy, the Jade Emperor.'\n\nThereafter, each shall declare their dharma rank: 'The humble disciple, the minor adept [Name], Great Dharma Master of the Three Caverns, respectfully addresses the Primordial Heavenly Worthy of the Void and the Natural, the Most High Dao Lord of the Boundless Dao, the Most High Lord Lao, the August Jade Emperor, the great sages who have attained the Dao, the perfected lords and venerable masters, the thirty-two Heavenly Emperors, the Jade Void Emperor, the Jade Emperor, the Great Emperor, the Eastern Flowery Peak, the Southern Culmen, the Western Numinous, the Northern Perfected, the Golden Towers and Jade Capitals of the Mystic Metropolis, the Seven Treasures and Mystic Terrace of the Purple Tenuity’s Upper Palace, and the Numinous Treasure Perfected Sovereign of the Radiant August Dao.\n\nBy the karmic conditions of my past lives, I was born into this Dharma gate. Through the mysterious and true deliverance, I entered the root of faith. My former master transmitted to me the sacred scriptures of the Three Treasures, and by the Dharma, I am to deliver ninety-nine thousand beings, ascending to the rank of the perfected. From my ancestors through the generations to my present life, I have encountered the scriptural teachings and dwelt always within blessings. Yet my merit is slight, my virtue meager, and I have not attained immortality. With exhausted devotion, I take refuge and vow to assist the nation and establish merit.\n\nNow the land is in disharmony, warfare and pestilence arise together, yin and yang clash violently, the stars and constellations stray from their paths, and grave calamities press heavily. The circumstances are as described. Perhaps the emperor, having received the heavenly mandate to oversee the myriad people, has not yet fully extended his benevolence to nourish the ten directions, leaving heaven and humanity unprosperous and the nation unsettled. Without songs of praise, the roads echo with stifled sobs. Thus, the Three Luminaries grow dim and disordered, great disasters spread, the emperor is anxious, and the people find no peace.'\"\n\nNow, in strict accordance with the Great Rites, I reverently disclose the true scriptures, burn incense, and kindle lamps to illuminate the myriad heavens. With sincere vows, I offer myself in service, performing the Dao to atone for calamities. I humbly beseech the celestial immortals’ nine hundred million cavalry, the terrestrial immortals’ nine hundred million cavalry, the perfected beings’ nine hundred million cavalry, the flying immortals’ nine hundred million cavalry, the divine beings’ nine hundred million cavalry, the sun and moon’s nine hundred million cavalry, the stellar constellations’ nine hundred million cavalry, the Nine Palaces’ nine hundred million cavalry, the Five Emperors’ nine hundred million cavalry, the Five Marchmounts’ nine hundred million cavalry, and the Three Rivers and Four Seas’ nine hundred million cavalry. I also invoke the thirty-two heavens’ overseers of the fast, attendants of incense, golden lads, jade maidens scattering flowers, and the thirty-two direct messengers of the Five Emperors, along with the flying dragon couriers who transmit words and memorials. May they all descend together to oversee the ritual hall, witness the offering of incense and the recitation of vows, and ensure that every word ascends directly. When the Dao-performing rites are complete, those who have rendered meritorious service shall be reported to the immortal officials.\n\nNext, three offerings of incense:\nThe humble disciple, a minor adept of the Three Caverns and Great Master of the Dao, now stands in attendance. With the first offering of incense, I vow that through this merit, the emperor and rulers of the nation, their ministers and officials, and all people under heaven, along with the seven generations of their parents, may depart from sorrow and suffering and ascend to the celestial halls. Thus, I burn incense, taking refuge in body, spirit, and life in the Great Dao. I prostrate myself, bowing my head to the ground, and take refuge in the Most High Three Worthies. May this merit flow to the seven generations of parents under heaven, beseeching deliverance from the ten sufferings and eight difficulties, that they may ascend to the celestial halls, where clothing and sustenance arise naturally, and they may dwell eternally in non-action. Thus, I burn incense, taking refuge in the virtue of my master, the great sagely host of perfected beings. After attaining the Dao, may I ascend into formlessness and unite with the true Dao.\n\nNow, standing in attendance, with the second offering of incense, I vow that through this merit, the emperor and rulers of the nation, their ministers, officials, and people, the masters who transmit the Dao, parents and honored kin, fellow disciples, and all those who dwell in mountains and forests to study the true Dao, along with all worthy ones, may each attain their Way. I take refuge in body, spirit, and life in the Great Dao. I prostrate myself, bowing my head to the ground, and take refuge in the Three Masters Most High. May this merit flow to the emperor and rulers of the nation, their ministers, officials, and people, the masters who transmit the Dao, parents and honored kin, fellow disciples, and all those who dwell in mountains and forests to study the true Dao, along with all worthy ones. May each attain their Way, dwell in peace and non-action, and enjoy eternal blessings. Thus, I burn incense, taking refuge in the virtue of my master, the great sagely host of most venerable perfected beings. After attaining the Dao, may I ascend into formlessness and unite with the true Dao.\n\nNow, standing in attendance, with the third offering of incense, I vow that through this merit, I may swiftly attain the immortal Dao, along with my ninefold kin, fellow disciples within the nation, all people under heaven, and all creatures—whether crawling, flying, wriggling, or breathing—both those already born and those yet to be born. May all be perfected. I take refuge in body, spirit, and life in the Great Dao. I prostrate myself, bowing my head to the ground, and take refuge in the Most High Three Worthies. May this merit flow to my own person, that I may attain transcendence and ultimately enter non-action, uniting in virtue with the Four Great Elements. May all people under heaven and all sentient beings be delivered from the ten sufferings and eight difficulties, the five poisons, water and fire, bandits, epidemics, ghostly harms, and all calamities. May the nation be at peace and the world prosper. Thus, I burn incense, taking refuge in the virtue of my master, the great sagely host of perfected beings. After attaining the Dao, may I ascend into formlessness and unite with the true Dao.\n\nNext, facing east, nine bows are performed, and the following is recited:\nHeaven and earth are in disharmony, yin and yang clash violently. The four seasons lose their harmony, and disasters and harms spread. The stellar constellations are disordered, foretelling inauspicious omens. The nation is in turmoil, warfare and pestilence arise together. The emperor is grieved, and the people find no peace. In strict accordance with the Great Rites, I disclose the true scriptures and take refuge in the Most High Numinous Treasure Heavenly Worthy of the Boundless East, the host of great sages who have attained the Dao, the perfected lords and venerable ones, the Nine Qi Heavenly Lords, and the various spirit officials of the eastern realm. Now, I establish this fast, baring my heart and revealing my form, acknowledging my faults and restraining myself to atone for the nation’s calamities. I burn incense and kindle lamps to illuminate the myriad heavens, casting light into the boundless darkness of the Nine Nether Realms, opening all radiance. Through this merit, may the emperor and rulers of the nation, their ministers and officials, and all people be freed from disasters and misfortunes. May the Three Luminaries return to their positions, the Five Phases follow their proper course, warfare cease, illnesses be cured, the nation’s fortune flourish, the people rejoice in peace, and gods and humans dwell in tranquility. Thus, I burn incense, taking refuge in body, spirit, and life in the virtue of my master, the great sagely host of perfected beings. After attaining the Dao, may I ascend into formlessness and unite with the true Dao.\n\nUpon completion, the headscarf is removed, and the forehead is pressed to the ground in full prostration, repeated eighty-one times.\n\nNext, facing south, three bows are performed, and the following is recited:\nHeaven and earth are in disharmony, yin and yang clash violently. The four seasons lose their harmony, and disasters and harms spread. The stellar constellations are disordered, foretelling inauspicious omens. The nation is in turmoil, warfare and pestilence arise together. The emperor is grieved, and the people find no peace. In strict accordance with the Great Rites, I disclose the true scriptures and take refuge in the Most High Numinous Treasure Heavenly Worthy of the Boundless South, the host of great sages who have attained the Dao, the perfected lords and venerable ones, the Three Qi Heavenly Lords, and the various spirit officials of the southern realm. Now, I establish this fast, baring my heart and revealing my form, acknowledging my faults and restraining myself to atone for the nation’s calamities. I burn incense and kindle lamps to illuminate the myriad heavens, casting light into the boundless darkness of the Nine Nether Realms, opening all radiance. Through this merit, may the emperor and rulers of the nation, their ministers and officials, and all people be freed from disasters and misfortunes. May the Three Luminaries return to their positions, the Five Phases follow their proper course, warfare cease, illnesses be cured, the nation’s fortune flourish, the people rejoice in peace, and gods and humans dwell in tranquility.\n\nNow, therefore, I burn incense, surrendering body, spirit, and life to the virtue of the Master, the Venerable Ones, the Perfected, and the Great Sages who have attained the Dao, ascending into formlessness after their enlightenment to merge with the Dao in truth. Having completed this, I bow in prostration, striking my breast—twenty-seven times in all, and no more.\n\nThen, facing west, I perform seven bows, saying:\nHeaven and Earth are obstructed, yin and yang clash in punishment. The four seasons lose their harmony, disasters and harms arise in succession. The celestial bodies are disordered, foretelling inauspicious omens. The land is thrown into turmoil, warfare and illness spread together. The emperor and kings grieve, the myriad people know no peace.\n\nNow, I strictly follow the Great Rites, baring the true scriptures, surrendering to the boundless Most High Numinous Treasure Heavenly Worthy of the West, the Great Sages who have attained the Dao, the Perfected Lords and Venerable Ones, the Seven Qi Heavenly Lords, and the various spirit officials of the western realm. Now, I establish this fast, baring my heart and revealing my form, acknowledging my faults and restraining myself to atone for the nation’s calamities. I burn incense and kindle lamps to illuminate the myriad heavens, casting light into the boundless darkness of the Nine Nether Realms, opening all radiance. Through this merit, may the emperor and rulers of the nation, their ministers and officials, and all people be freed from disasters and misfortunes. May the Three Luminaries return to their positions, the Five Phases follow their proper course, warfare cease, illnesses be cured, the nation’s fortune flourish, the people rejoice in peace, and gods and humans dwell in tranquility.\n\nNow, therefore, I burn incense, surrendering body, spirit, and life to the virtue of the Master, the Venerable Ones, the Perfected, and the Great Sages who have attained the Dao, ascending into formlessness after their enlightenment to merge with the Dao in truth. Having completed this, I bow in prostration, striking my breast—sixty-three times in all, and no more.\n\nThen, facing north, I perform five bows, saying:\nHeaven and Earth are obstructed, yin and yang clash in punishment. The four seasons lose their harmony, disasters and harms arise in succession. The celestial bodies are disordered, foretelling inauspicious omens. The land is thrown into turmoil, warfare and illness spread together. The emperor and kings grieve, the myriad people know no peace.\n\nNow, I strictly follow the Great Rites, baring the true scriptures, surrendering to the boundless Most High Numinous Treasure Heavenly Worthy of the North, the Great Sages who have attained the Dao, the Perfected Lords and Venerable Ones, the Five Qi Heavenly Lords, and the various spirit officials of the northern realm. Now, I establish this fast, baring my heart and revealing my form, acknowledging my faults and restraining myself to atone for the nation’s calamities. I burn incense and kindle lamps to illuminate the myriad heavens, casting light into the boundless darkness of the Nine Nether Realms, opening all radiance. Through this merit, may the emperor and rulers of the nation, their ministers and officials, and all people be freed from disasters and misfortunes. May the Three Luminaries return to their positions, the Five Phases follow their proper course, warfare cease, illnesses be cured, the nation’s fortune flourish, the people rejoice in peace, and gods and humans dwell in tranquility.\n\nNow, therefore, I burn incense, surrendering body, spirit, and life to the virtue of the Master, the Venerable Ones, the Perfected, and the Great Sages who have attained the Dao, ascending into formlessness after their enlightenment to merge with the Dao in truth. Having completed this, I bow in prostration, striking my breast—forty-five times in all, and no more.\n\nThen, facing northeast, I perform one bow, saying:\n\nWhen Heaven and Earth are obstructed and in turmoil, when yin and yang clash and punish one another, when the four seasons lose their harmony, disasters and calamities arise in succession. The stellar lodges fall into disarray, heralding omens of misfortune; the land is thrown into chaos, with warfare and illness spreading unchecked. The emperor and rulers grieve in sorrow, and the myriad people find no peace.\n\nIn solemn observance of the Great Rites, I now unfold the true scriptures, surrendering body, spirit, and life to the Venerable Supreme Numinous Treasure Heavenly Worthy of the Boundless in the Northeast, to the Great Sages who have attained the Dao, to the Perfected Lords and Venerable Masters, to the Heavenly Lords of Brahma-qi, and to the divine officials of the Northeast quarter.\n\nThus, I establish this fast, baring my heart and exposing my form, acknowledging my faults and chastising myself. For the nation, I seek to dispel calamities, burning incense and kindling lamps to illuminate the heavens above and cast light into the boundless, eternal night of the Nine Dark Realms below, opening all paths to radiance. Through this merit, may the emperor and rulers of the nation, their ministers and officials, and all people be freed from disasters and misfortunes. May the Three Luminaries return to their positions, the Five Phases follow their proper course, warfare cease, illnesses be cured, the nation’s fortune flourish, the people rejoice in peace, and gods and humans dwell in tranquility.\n\nNow, therefore, I burn incense, surrendering body, spirit, and life to the virtue of the Master, the Venerable Ones, the Perfected, and the Great Sages who have attained the Dao, ascending into formlessness after their enlightenment to merge with the Dao in truth. Having completed this, I bow in prostration, striking my breast—nine times in all, and no more.\n\nThen, facing southeast, I perform one bow, saying:\n\nWhen Heaven and Earth are obstructed and in turmoil, when yin and yang clash in mutual harm, when the four seasons lose their harmony, disasters and calamities spread unchecked, and the celestial bodies fall into disarray, portending ill omens. The realm is thrown into chaos, warfare and disease rage together, the emperor grieves in sorrow, and the myriad people find no peace.\n\nIn reverent accordance with the Great Law, I now reveal the true scripture, surrendering body, spirit, and life to the Venerable Most High Numinous Treasure Heavenly Worthy of the Boundless in the Southeast, the Great Sages who have attained the Dao, the Perfected Lords and Venerable Ones, the Heavenly Lords of Brahma-qi, and the divine officials of the Southeast. Today, I establish this fast, baring my heart and revealing my form, acknowledging my faults and restraining myself, beseeching the nation’s deliverance from calamity. I burn incense and kindle lamps to illuminate the heavens above and shine upon the Nine Dark Realms within the boundless, eternal night below, unveiling all radiant light. Through this merit, may the emperor and rulers of the nation, their ministers and officials, and all people be freed from disasters and misfortunes. May the Three Luminaries return to their positions, the Five Phases follow their proper course, warfare cease, illnesses be cured, the nation’s fortune flourish, the people rejoice in peace, and gods and humans dwell in tranquility.\n\nNow, therefore, I burn incense, surrendering body, spirit, and life to the virtue of the Master, the Venerable Ones, the Perfected, and the Great Sages who have attained the Dao, ascending into formlessness after their enlightenment to merge with the Dao in truth. Having completed this, I bow in prostration, striking my breast—nine times in all, and no more.\n\nThen, facing southwest, I perform one bow, saying:\n\nWhen Heaven and Earth are obstructed, yin and yang clash in conflict, the four seasons lose their harmony, and calamities flow forth; when the celestial lodgings are entangled, portending ill omens; when the land is thrown into turmoil, warfare and illness spread together; when the emperor grieves in sorrow and the myriad people know no peace—\n\nI now reverently follow the Great Rites, unfolding the true scriptures, and surrender body, spirit, and life to the Venerable Supreme Numinous Treasure Heavenly Worthy of the Boundless in the Southwest, the Great Sages who have attained the Dao, the Perfected Lords and Venerable Ones, the Heavenly Lords of Pristine Qi, and the divine officials of the Southwest Quarter.\n\nThus, I establish this fast, baring my heart and revealing my form, acknowledging my faults and reproaching myself, beseeching the nation’s deliverance from misfortune. I burn incense and kindle lamps to illuminate the heavens above and shine below into the boundless, eternal night of the Nine Dark Realms, unfolding all radiant light. Through this merit, may the emperor and rulers of the nation, their ministers and officials, and all people be freed from disasters and misfortunes. May the Three Luminaries return to their positions, the Five Phases follow their proper course, warfare cease, illnesses be cured, the nation’s fortune flourish, the people rejoice in peace, and gods and humans dwell in tranquility.\n\nNow, therefore, I burn incense, surrendering body, spirit, and life to the virtue of the Master, the Venerable Ones, the Perfected, and the Great Sages who have attained the Dao, ascending into formlessness after their enlightenment to merge with the Dao in truth. Having completed this, I bow in prostration, striking my breast—nine times in all, and no more.\n\nThen, facing northwest, I perform one bow, saying:\n\nWhen Heaven and Earth are obstructed and in turmoil, when yin and yang clash in mutual harm, when the four seasons lose their harmony, disasters and calamities spread unchecked. The constellations fall into disarray, portending ill omens; the land is thrown into chaos, with warfare and disease raging together. The emperor is grieved, and the myriad people find no peace.\n\nIn reverent accordance with the Great Law, I now reveal the true scripture, surrendering body, spirit, and life to the Venerable and Most High Numinous Treasure Heavenly Worthy of the Infinite in the Northwest, to the Great Sages who have attained the Dao, to the Perfected Lords and Venerable Masters, to the Heavenly Lords of Pristine Qi, and to the divine officials of the Northwest. Today, I establish this fast, baring my heart and revealing my form, acknowledging my faults and restraining myself to atone for the nation’s misfortunes. I burn incense and light lamps to illuminate the heavens above and shine upon the Nine Dark Realms within the boundless, eternal night below, opening all paths to radiant light.\n\nThrough this merit, may the emperor and rulers of the nation, their ministers and officials, and all people be freed from disasters and misfortunes. May the Three Luminaries return to their positions, the Five Phases follow their proper course, warfare cease, illnesses be cured, the nation’s fortune flourish, the people rejoice in peace, and gods and humans dwell in tranquility.\n\nNow, therefore, I burn incense, surrendering body, spirit, and life to the virtue of the Master, the Venerable Ones, the Perfected, and the Great Sages who have attained the Dao, ascending into formlessness after their enlightenment to merge with the Dao in truth. Having completed this, I bow in prostration, striking my breast—nine times each in all.\n\nThen, facing northwest, I perform thirty-two bows to the Upper Realm, saying:\n\nWhen Heaven and Earth are obstructed, yin and yang clash in punishment, the four seasons lose harmony, and disasters and calamities spread. The stellar lodges entangle, foretelling ill omens; the land is thrown into turmoil, war and illness rage together. The emperor and kings grieve, and the myriad people know no peace.\n\nReverently following the Great Law, I reveal the true scriptures and surrender body, spirit, and life to the Upper Realm’s Boundless Supreme Numinous Treasure Heavenly Worthy, the enlightened assembly of Great Sages, the Perfected Lords and Venerable Ones, the Lords of the Thirty-Two Heavens, the Realized Ones of the Jade Capital, Mystic Capital, and Purple Tenuity’s Upper Palace, the Jade Maidens, Divine Immortals, and all spirit officials. Now, therefore, I establish this retreat, baring my heart and exposing my form, acknowledging my faults and chastising myself to atone for the nation’s misfortunes. I burn incense and kindle lamps to illuminate the heavens above and shine upon the Nine Dark Realms within the boundless long night below, unveiling all radiance. May this merit and power be dedicated to the emperor, kings, rulers, ministers, officials, and all people, that disasters be dispelled, misfortunes averted, the Three Luminaries restored to their positions, the Five Phases follow their proper course, warfare cease, illnesses be cured, the nation’s fortune flourish, the people rejoice in peace, and gods and humans dwell in tranquility.\n\nNow, therefore, I burn incense, surrendering body, spirit, and life to the virtue of the Master, the Venerable Ones, the Perfected, and the Great Sages who have attained the Dao, ascending into formlessness after their enlightenment to merge with the Dao in truth. Having completed this, I bow in prostration, striking my breast—eighty-eight times each.\n\nThen, facing southeast, I perform twelve bows to the Lower Realm, saying:\n\nWhen Heaven and Earth are obstructed, yin and yang clash in punishment, the four seasons lose harmony, and disasters and calamities spread. The stellar lodges entangle, foretelling ill omens; the land is thrown into turmoil, war and illness rage together. The emperor and kings grieve, and the myriad people know no peace.\n\nReverently following the Great Law, I reveal the true scriptures and surrender body, spirit, and life to the Lower Realm’s Boundless Supreme Numinous Treasure Heavenly Worthy, the enlightened assembly of Great Sages, the Perfected Lords and Venerable Ones, the Nine Mounds’ Earthly Sovereigns, the Four Directors and Five Emperors, the Twelve Immortal Officials, the Realized Ones of the Five Peaks, Four Waterways, and Nine Palaces, the Divine Immortals, Jade Maidens, and all spirit officials of the boundless world’s earthly deities. Now, therefore, I establish this retreat, baring my heart and exposing my form, acknowledging my faults and chastising myself to atone for the nation’s misfortunes. I burn incense and kindle lamps to illuminate the heavens above and shine upon the Nine Dark Realms within the boundless long night below, unveiling all radiance. May this merit and power be dedicated to the emperor, kings, rulers, ministers, officials, and all people, that disasters be dispelled, misfortunes averted, the Three Luminaries restored to their positions, the Five Phases follow their proper course, warfare cease, illnesses be cured, the nation’s fortune flourish, the people rejoice in peace, and gods and humans dwell in tranquility.\n\nNow, therefore, I burn incense, surrendering body, spirit, and life to the virtue of the Master, the Venerable Ones, the Perfected, and the Great Sages who have attained the Dao, ascending into formlessness after their enlightenment to merge with the Dao in truth. Having completed this, I bow in prostration, striking my breast—one hundred and eight times each.\n\nThen, circling three times, I recite the *Lingzhang* of the *BuXu*.\n\nNext, to the incense officials and messengers, the Left and Right Dragon-Tiger Lords, and the incense-bearing dragon couriers, I command: Announce this retreat hall, where the spontaneous golden elixir, cinnabar mushrooms, and azure herbs flourish. May the hundred spirits and host of Perfected gather here before this incense burner, that I may attain the Dao, achieve immortality, my household receive blessings, the world be graced with favor, and the jade lads and maidens of the ten directions attend the fragrant smoke, transmitting my prayers directly to the throne of the Boundless Supreme Great Dao.\n\nThe Flying Heavenly Spirits declare: The duration of Daoist practice may be adjusted as one sees fit. Though human endeavors follow the four seasons and the cycles of the Five Phases, even three days and nights of earnest supplication with a sincere heart will move the heavens. Scholars may proceed according to their capacity.\n\nThe Flying Heavenly Spirits declare: When kings and emperors perform rites to avert disasters and transcend calamities, they use five-colored silks corresponding to the directions, each of specified length. Dragons are adorned with superior gold, and the ritual silks bear purple patterns, honoring the celestial hierarchy. Commoners use plain silk, dragons are adorned with medium gold, and the lamp offerings follow the same protocol. Those who violate this are examined by the Celestial Bureau of the Mystic Capital.\n\nThe Flying Heavenly Spirits declare: Upon receiving the ten sections of the wondrous scriptures of the Numinous Treasure, cast three golden dragons into the water palace, a sacred mountain, and one’s residence—three locations in total—as a pledge of one’s commitment to Daoist cultivation. Failing this, the Three Officials will retain one’s life register, and prayers will not reach their destination. Violations are examined by the Earthly Bureau of the Nine Capitals according to the Jade Instructions.\n\nThe Flying Heavenly Spirits declare: Upon receiving the ten sections of the wondrous scriptures of the Numinous Treasure, use forty feet of patterned silk in each of the five directions to invoke the Five Emperors as a pledge of one’s oath. Without this, the Five Emperors will not accept one’s name, and the demon kings of the Five Emperors will disrupt one’s resolve. Violations are examined by the Water Bureau of the Yellow Springs.\n\nThe Flying Heavenly Spirits declare: Upon receiving the ten sections of the wondrous scriptures of the Numinous Treasure, use five ounces of superior gold to pledge allegiance to the Five Peaks as a sign of reverence for the sacred scriptures. Without this, one incurs the penalty of disrespecting the scriptures, and the sacred mountains of the Five Peaks will not register one’s name among the learners. Violations are examined by the Yin Bureau.\n\nThe Flying Heavenly Spirits declare: Upon receiving the ten sections of the wondrous scriptures of the Numinous Treasure, use two hundred and forty gold coins as a pledge to the twenty-four qi-generating officials, affirming one’s sincerity. Without this, the gods of the Three Departments and Eight Sceneries will not transfer one’s life register. If gold is unavailable, six hundred copper coins may suffice. Violations are examined by the General Spirit Bureau.\n\nThe Flying Heavenly Spirits declare: If scholars do not kindle lamps and burn incense, their seven ancestors will not be liberated from the Nine Dark Realms within the long night, and their bodies will lack radiance. Violations are examined by the Supreme Yin Bureau.\n\nThe Flying Heavenly Spirits declare: If scholars do not observe fasts and uphold precepts, their seven ancestors will not ascend to the celestial halls, their bodies will lack purity, and they will not attract the presence of spirits. Those who can uphold fasts and precepts will find their thoughts swiftly answered, and their merits naturally manifest. Violations are examined by the Supreme Yang Bureau.\n\nThe Flying Heavenly Spirits declare: The celestial texts are profoundly sacred and are not treasured without faith. Thus, the supreme sages demonstrate their hearts through faith. Without faith, one becomes base in the Dao; without covenants, one trivializes the sacred. Violations are examined by the Left and Right Official Bureaus.\n\nThe Flying Heavenly Spirits declare: Scriptures not transmitted by a master lack the Five Emperors’ covenant. To recklessly peruse their contents is a transgression equal to stealing scriptures. Violations are examined by the Bureau of Illuminated Laws.\n\nThe Flying Heavenly Spirits declare: Those who receive scriptures must first present their pledge before wearing them. Should they later encounter a worthy person and offer their pledge to request transmission, they must use the received pledge to complete the term of their former master, with any remainder to be used for their own practice. Violations are examined by the Fire Official Bureau.\n\nThe Flying Heavenly Spirits declare: For the pledges of transmitted scriptures, one-tenth must be offered to the ancestral master, and another two-tenths distributed to the poor, mendicant Daoists, and mountain-dwelling adepts. The remaining pledge is to be used for one’s own practice—burning incense, kindling lamps, and establishing merit for disciples. Violations are examined by the Three Officials Bureau.\n\nThe Flying Heavenly Spirits declare: Those who regret receiving scriptures and recklessly disseminate celestial texts will be examined by the Bureau of Wrongdoing, and their lineage will be extinguished in the long night for three years.\n\nDo not treat the Three Treasures lightly, do not leak the true scriptures, do not deceive your master or violate righteousness, do not claim merit or fame for yourself, do not disrespect heaven or belittle earth, do not defile or insult the Three Luminaries, do not pollute the Five Peaks, do not encroach upon or slight the spirits, do not speak falsely while harboring deceit, do not envy or harm the worthy and capable, do not withhold alms or begrudge acts of merit, and do not indulge in greed or seek self-glorification.\n\nThe Flying Heavenly Spirits declare: The statutes of the Illuminated True Regulations delineate the boundaries of transgression and blessing, as outlined above. Those of utmost sincerity who diligently cultivate the statutes, uphold the laws, and do not violate the scriptures will naturally evoke hidden resonance. Heaven will illumine their hearts, and their seven ancestors will swiftly be liberated from the Nine Dark Realms of the long night, ascending to the celestial halls. Their clothing and sustenance will come naturally, and they will soon be reborn into the houses of kings and nobles. In this life, they will radiate brilliance, and their blessings will be boundless. By ceaselessly practicing with devotion, they will attain the rank of divine immortals.\n\nThe *Dongxuan Lingbao* *Jade Casket of the Illuminated True Statutes for the Nine Dark Realms of the Long Night* concludes.\n\nThose who receive such retribution—should they not repent and reform, their sins will be recorded in the celestial ledgers. Even if they were to perform good deeds for ten thousand kalpas, they would still be bound by their past transgressions. Their misfortunes will multiply, their lifespans will be cut short, and they will be conscripted into laborious servitude. Their descendants will suffer poverty and hardship, and their families will be scattered and ruined.\n\nAccording to the manuscript P.2406, this passage begins here, preceded by the title *\"Ritual Ordinances of the Supreme Pervasive Mystery Numinous Treasure Scripture of Illuminating the True.\"* Manuscript P.2442 omits this title. The ritual implements shall be nine feet in height, and all procedures must follow the established methods.\n\nIn the Dunhuang manuscripts, following the phrases *\"Supervisors of the Ritual Fast, Attending Incense Golden Lads, and Flower-Scattering Jade Maidens,\"* the text includes *\"thirty-two persons\"* in each instance.\n\nThe character *\"et cetera\"* is supplied according to the Dunhuang manuscripts. The character *\"petition\"* is likewise supplied. *\"Emperors, kings, and lords of states\"* appears as *\"emperors, lords, and kings\"* in the Dunhuang manuscripts, and this convention is maintained throughout without further annotation. *\"Rulers, officials, and common folk\"* appears as *\"rulers, ministers, officials, and common folk\"* in the Dunhuang manuscripts, and this is likewise followed in most subsequent instances without further annotation.\n\nIn the Dunhuang manuscripts, the petitionary invocations often replace *\"so-and-so\"* with *\"Jia.\"* The term *\"take refuge\"* appears as *\"return to refuge\"* in the Dunhuang manuscripts. Hereafter, wherever *\"take refuge,\"* *\"submit one’s life,\"* or similar phrases appear, the Dunhuang manuscripts uniformly render them as *\"return to refuge,\"* *\"return one’s life,\"* or *\"return one’s spirit,\"* and no further annotations will be provided.\n\nFrom *\"Now, therefore, we establish this ritual fast...\"* to *\"unite with the Dao and merge with the True,\"* the Dunhuang manuscripts abbreviate the entire petitionary invocation of over one hundred and fifty characters to *\"May the above dharma be remembered with devotion.\"* This convention is maintained in subsequent passages without further annotation.\n\nThe three sections of scripture beginning with *\"Next, bow once toward the southeast\"* are condensed in the Dunhuang manuscripts as follows: *\"Next, bow once toward the southeast, then the southwest, then the northwest—each of the four directions—with nine prostrations, nine bows touching the forehead to the ground, and nine invocations of submission, all performed in the same manner as for the northeast.\"*\n\n*\"Next, face the upper direction\"* appears as *\"After the four directions are completed, next face the northwest upper direction\"* in the Dunhuang manuscripts. *\"Next, face the lower direction\"* appears as *\"next face the southeast lower direction.\"*\n\n*\"Ninefold Walled Earthly Sovereigns\"* appears as *\"Ninefold Earthly Jade Sovereigns\"* in the Dunhuang manuscripts. *\"Military incursions\"* was originally *\"military epidemics\"* and has been emended according to the Dunhuang manuscripts. *\"Expounds\"* appears as *\"states the expounded\"* in the Dunhuang manuscripts. *\"Diseases and rashes\"* appears as *\"disasters and illnesses\"* in the Dunhuang manuscripts, which is more accurate.\n\nThe Dunhuang manuscripts omit the phrase *\"burn incense.\"* *\"Activate the incense burner\"* appears as *\"declare, saying\"* in the Dunhuang manuscripts. The Dunhuang manuscripts omit the phrase *\"next, activate the incense burner.\"* *\"The Attending Incense Golden Lads transmit the words of the Flower-Scattering Jade Maidens\"* appears as *\"the Attending Incense Jade Lads and Attending Incense Jade Maidens\"* in the Dunhuang manuscripts.\n\nThe Dunhuang manuscripts omit the phrase *\"next, each recites their dharma rank.\"* *\"Your servant, so-and-so\"* appears as *\"Wang Jia\"* in the Dunhuang manuscripts, and this convention is maintained throughout. The Dunhuang manuscripts omit the phrase *\"Most High Lord Lao.\"*\n\n*\"Encounter\"* appears as *\"fall upon\"* in the Dunhuang manuscripts. *\"Perfected True\"* appears as *\"Highest True\"* in the Dunhuang manuscripts. In the Dunhuang manuscripts, the character *\"servant\"* is followed by a small-character annotation: *\"of the Dao’s lineage and virtue.\"* The character *\"body\"* is followed by the annotation *\"later learners need only say\"* in the Dunhuang manuscripts.\n\n*\"Submit one’s life\"* appears as *\"offer one’s body and life\"* in the Dunhuang manuscripts. *\"Disasters and illnesses\"* appears as *\"perils and disasters\"* in the Dunhuang manuscripts. *\"One fears that emperors may receive the heavenly mandate to abdicate\"* appears as *\"truly, as emperors receive the heavenly fortune\"* in the Dunhuang manuscripts.\n\n*\"Incomplete\"* appears as *\"unable\"* in the Dunhuang manuscripts. *\"No songs are sung on the road, and voices are stifled\"* appears as *\"no grace is sung, and voices are stifled on the road\"* in the Dunhuang manuscripts, with the subsequent *\"thus\"* rendered as *\"thereby.\"*\n\nFollowing the phrases *\"Supervisors of the Ritual Fast, Attending Incense Golden Lads, and Flower-Scattering Jade Maidens,\"* the Dunhuang manuscripts include *\"thirty-two persons\"* in each instance.\n\n*\"Those with meritorious service report their merits to the Three Officials\"* appears as *\"Those with diligent service petition the Transcendent Officials; then rise, face east, offer incense three times, and recite the incantation\"* in the Dunhuang manuscripts, which omits the subsequent phrase *\"next, take three pinches of incense.\"*\n\n*\"First pinch of incense\"* appears as *\"burn incense\"* in the Dunhuang manuscripts. *\"Now, therefore, your servant establishes this and takes a second pinch of incense\"* appears as *\"Next, take three more pinches of incense and recite the incantation: Now, therefore, your servant burns this incense\"* in the Dunhuang manuscripts, and this convention is maintained for *\"third pinch of incense.\"*\n\n*\"May your servant swiftly attain the Dao of immortality, along with nine generations of kin\"* was originally *\"May your servant attain the Dao of immortality and befriend nine kinds of relatives,\"* and has been emended according to the Dunhuang manuscripts.\n\nThis sentence in the Dunhuang manuscripts reads: *\"After the invocation for the offering of incense is completed, face east, bow nine times, and declare.\"* The Dunhuang manuscripts omit the phrase *\"Most High Numinous Treasure.\"* In subsequent passages, the names of the Heavenly Worthies of the West, North, and other directions likewise omit *\"Most High Numinous Treasure\"* in the Dunhuang manuscripts.\n\n*\"Acknowledge faults and self-discipline\"* was mistakenly written as *\"seek and self-discipline,\"* and has been emended according to the Dunhuang manuscripts. Hereafter, all instances of *\"seek and self-discipline\"* are emended accordingly without further annotation.\n\n#89 The four characters *\"then remove the headscarf\"* are supplemented according to the Dunhuang manuscripts.\n\n#90 According to the Dunhuang manuscripts, the following sections of supplicatory invocations are heavily abridged, retaining only the phrases addressing the Heavenly Worthies and deities of all directions, while the remaining text is condensed to *\"as in the above method.\"* No further detailed collation is provided.\n\n#91 The two characters *\"when the invocation is complete\"* are supplemented according to the Dunhuang manuscripts. The same applies to subsequent passages.\n\n#92 *\"Most High Numinous Treasure Heavenly Worthy of the Upper Realm of the Boundless\"*: The Dunhuang manuscripts read *\"Numinous Treasure Heavenly Worthy of the Thirty-Two Heavens of the Boundless.\"*\n\n#93 According to the Dunhuang manuscripts, the passage *\"next circumambulate three times while reciting the 'Lingzhang of Pacing the Void,' then return to the incense burner\"* is emended to read: *\"When the invocations and obeisances to the ten directions are complete, circumambulate three times, encircle the incense and lamps, recite aloud the 'Dongzhang of Pacing the Void,' then face east again and intone the incantation.\"* This comprises twenty-eight characters in total.\n\n#94 The character *\"sun\"* is supplemented according to the Dunhuang manuscripts.\n\n#95 *\"Circumference\"*: Originally written as *\"expenditure,\"* emended according to the Dunhuang manuscripts.\n\n#96 *\"Measurement in chi\"*: The Dunhuang manuscripts read *\"measurement in zhang.\"*\n\n#97 The character *\"should\"* is supplemented according to the Dunhuang manuscripts.\n\nThe Dunhuang manuscripts and the *Daoist Canon* versions differ in more places than those listed above, and these cannot be enumerated one by one.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞玄灵宝长夜之府九幽玉匮明真科 经名：洞玄灵宝长夜之府九幽玉匮明真科。 撰人不祥，约出於东晋。 系古《灵宝经》之一。 一卷。 底本出处：《正统道藏》正一部。 参校本：敦煌七P.2730、P.2442、P.2406、P.2352、P.4658、S.6312+S.7730+S.2451号抄本。 洞玄灵宝长夜之府九幽玉匮明真科 元始天尊时在香林园中，与七千二百四十童子俱，教化诸法，度身威光。 於是天尊放五色光明，彻照诸天长乐福堂、十方无极世界地狱。 是时童子俱在一处，见诸天福堂男女善人，逍遥无为，衣食自然； 普见无极世界地狱之中囚徒谪役，饿鬼死魂裸身无衣，头脚锁械，足立刀山，身负铁杖，大小相牵，五体烂坏，无复人形。 饥则食炭，渴饮火精，流曳三涂八难之中。 尔时上智童子闭眼伏地，稽首上白天尊：今日侍座，得见诸天地狱之中善恶命根，心振意惧，五神悲惶，敢缘天慈，曲逮无穷，欲有所问。 惟愿天尊有以开悟愚蒙之心，直垂训厉，敷演玄教，令众得明。 来世之人，不见科戒，方当履向五浊毒汤，遭难遇害，不能度身，是男是女，皆当如今所见地狱囚徒饿鬼谪役之魂，亿劫涂炭而不得还，无知受对，甚可哀伤。 愿使禁戒明真科律，以为来生人世作善因绿，世世可得蒙此大福，免离苦根，度脱三涂，上升天堂。 元始天尊曰：善哉善哉。 子之所问，要乎深矣。 长夜之府九幽玉匮明真科律，具说罪福宿命因缘，善恶报应，解拔苦根，戒人治行，身入光明，远恶就善，终归福门。 其法弘普，广度天人，生死蒙惠，免脱八难，身超三界，受庆自然，世世欢乐，享祚无穷，今以相告，密遵之焉。 上智童子前进作礼，长跪稽首，上白天尊言：不审今所普见诸天福堂，及无极世界地狱之中，善恶报应，悉何因缘，所从而来。 生世何修而得飞行！ 逍遥上清，位登高仙。 生世何缘，身得尸解，灭度无为。 生世何缘，死而不休，后还更生。 生世何缘，死补天官，身有光明。 生世何缘，死生诸天，为太上之宾。 生世何缘，死无拘闭，与五帝交游。 生世何缘，死得受号，为地上灵神。 生世何缘，死为众圣，策驾云中。 生世何缘，死升福堂，衣食自然。 生世何缘，死升南宫，即生人中。 生世何缘，死入地狱，长夜无穷。 生世何缘，死受楚毒，万痛加身。 生世何缘，死不得食，饿鬼之中。 生世何缘，死受分离，破裂身形。 生世何缘，死充囚徒，流曳三官。 生世何缘，死入擭汤，无复人身。 生世何缘，死循剑树，风刀往还。 生世何缘，头面焦燎，头戴火山。 生世何缘，身无衣服，铁杖负身。 生世何缘，身被髡截，负石无闲。 生世何缘，死受锁械，幽闭三光。 生世何缘，驱驰若极，食息无宁。 生世何缘，拔出其舌，铁锥刺之。 生世何缘，死汲溟波，以灌四渎。 今见地狱之中有如此辈，生何所犯，而受斯对，魂神苦痛，乃至如此，不审几年，当得解脱，解脱之日，当生六畜，为还人中。 愿为分别，解说命根，为说来生，作善因缘，如蒙开悟，即受圣恩。 天尊於是命召十方飞天神人，披长夜之府九幽玉匮，出明真科律，以度童子。 是时诸天大圣、元极尊神、神仙玉女，无鞅数众，不可胜计，同时诣座。",
      "translated_text": "*The Cavernous Mystery of the Numinous Treasure: The Jade Casket of the Nine Dark Realms of the Long Night’s Repository—The Luminous Statutes of Authentic Reality*\n\n**Title:** *The Cavernous Mystery of the Numinous Treasure: The Jade Casket of the Nine Dark Realms of the Long Night’s Repository—The Luminous Statutes of Authentic Reality*\n**Author:** Unknown (approximately dated to the Eastern Jin dynasty)\n**Classification:** One of the ancient *Scriptures of the Numinous Treasure* (*Lingbao Jing*)\n**Volume:** One fascicle\n**Base Text:** *Daoist Canon of the Orthodox Tradition* (*Zhengtong Daozang*), Proper Section I\n**Collated Manuscripts:** Dunhuang manuscripts P.2730, P.2442, P.2406, P.2352, P.4658, and S.6312+S.7730+S.2451\n\n---\n\nAt that time, the Celestial Worthy of Primordial Beginning dwelled in the Fragrant Grove Garden, accompanied by seven thousand two hundred and forty youths. There, he expounded the teachings of transformation, bestowing upon them the majesty of bodily transcendence.\n\nThen, the Celestial Worthy emitted a radiance of five colors, which pierced through the celestial halls of perpetual joy and the hells of the ten directions’ boundless worlds. The youths, gathered in one place, beheld the men and women of virtue in the celestial halls of bliss—carefree and unburdened, their clothing and sustenance arising naturally. Yet they also witnessed the boundless worlds’ hells, where condemned souls toiled in penal servitude: hungry ghosts and deceased spirits, naked and unclothed, their heads and feet shackled in iron, standing upon mountains of blades, bearing iron staves upon their backs. Great and small dragged one another, their five viscera rotting away until no human form remained. When hungry, they ate embers; when thirsty, they drank fiery essence. They were dragged and cast into the Three Paths and Eight Difficulties.\n\nThereupon, the youth of superior wisdom prostrated himself, eyes closed and face to the earth, kowtowing to address the Celestial Worthy: “Today, while attending your seat, we have witnessed the roots of good and evil fates within the heavens and hells. Our hearts tremble with dread, our five spirits grieve in terror. Daring to rely upon your boundless compassion, we humbly inquire: Would that the Celestial Worthy enlighten our benighted minds, directly bestow your stern instruction, and expound the mysterious teachings, that all may attain clarity. For those of future generations who fail to behold these statutes and precepts, they shall tread into the Five Defilements’ cauldrons of poison. They will encounter calamity and harm, unable to transcend their forms. Whether man or woman, all shall become like the hell-bound convicts, hungry ghosts, and penal spirits we now see—enduring eons of suffering in the mire, never to return. Ignorant and made to answer for their deeds, how pitiful and sorrowful! May these luminous statutes and precepts of the authentic reality be established as the karmic conditions for goodness in the world to come, that all may generation after generation receive this great fortune, escape the roots of suffering, transcend the Three Paths, and ascend to the celestial halls.”\n\nThe Celestial Worthy of Primordial Beginning replied: “Excellent, excellent! Your question is of profound importance. The *Luminous Statutes of Authentic Reality* within the *Jade Casket of the Nine Dark Realms of the Long Night’s Repository* fully expound the karmic causes of sin and fortune, the retributions of good and evil, the liberation from the roots of suffering, and the precepts for cultivating conduct. Through these, the body enters radiance, evil is shunned, and goodness pursued, ultimately returning to the gate of fortune. This Dharma is vast and universal, broadly delivering gods and humans. Those in the cycle of birth and death receive its grace, escape the Eight Difficulties, transcend the Three Realms, and partake of natural blessings. Generation after generation, they shall rejoice, enjoying endless felicity. I now impart this to you—guard it in secret.”\n\nThe youth of superior wisdom advanced, bowed, and knelt in reverence, addressing the Celestial Worthy: “We humbly inquire: By what karmic causes do we now universally behold the celestial halls of bliss and the hells of the boundless worlds, where the retributions of good and evil arise? From whence do they come?\n\nWhat cultivation in life leads to flight and transcendence, carefree wandering in the Upper Clarity, and ascension to the ranks of the lofty immortals?\n\nWhat karmic cause in life allows the body to attain liberation through simulated death, extinguishing all action?\n\nWhat karmic cause in life leads to ceaseless rebirth after death?\n\nWhat karmic cause in life results in death and subsequent appointment as an official of the celestial bureaus, the body suffused with radiance?\n\nWhat karmic cause in life leads to rebirth among the various heavens, becoming a guest of the Most High?\n\nWhat karmic cause in life results in death without confinement, freely associating with the Five Emperors?\n\nWhat karmic cause in life leads to posthumous investiture as a numinous spirit of the earth?\n\nWhat karmic cause in life results in death and ascension as one of the host of sages, driving a chariot through the clouds?\n\nWhat karmic cause in life leads to posthumous ascent to the halls of fortune, where clothing and sustenance arise naturally?\n\nWhat karmic cause in life results in death and rebirth in the Southern Palace, returning to the realm of humans?\n\nWhat karmic cause in life leads to descent into hell after death, enduring eternal night?\n\nWhat karmic cause in life results in death and the infliction of torment, myriad pains afflicting the body?\n\nWhat karmic cause in life leads to death without sustenance, dwelling among hungry ghosts?\n\nWhat karmic cause in life results in death and separation, the body shattered and form destroyed?\n\nWhat karmic cause in life leads to death as a convict, dragged and cast into the Three Bureaus?\n\nWhat karmic cause in life results in death and immersion in boiling cauldrons, never to regain human form?\n\nWhat karmic cause in life leads to death and wandering among the forests of swords, wind and blades assailing one another?\n\nWhat karmic cause in life results in death with the head scorched and charred, bearing a mountain of fire upon it?\n\nWhat karmic cause in life leads to death without clothing, an iron staff borne upon the back?\n\nWhat karmic cause in life results in death with the body shorn and mutilated, bearing stones without respite?\n\nWhat karmic cause in life leads to death in shackles and fetters, imprisoned in darkness, the Three Luminaries obscured?\n\nWhat karmic cause in life results in ceaseless toil, food and rest forever denied?\n\nWhat karmic cause in life leads to death with the tongue torn out, pierced by iron awls?\n\nWhat karmic cause in life results in death drawing the dark waves to irrigate the Four Rivers?\n\nNow, beholding such beings in hell, what transgressions in life have they committed to endure such retribution? Their souls suffer torment to this degree—how many years must pass before they attain liberation? On the day of their release, shall they be reborn as beasts of burden, or return to the realm of humans? We beseech you to distinguish and expound upon the roots of fate, to reveal the karmic causes for rebirth, and to establish the conditions for goodness in the world to come. If we are graced with your enlightenment, we shall receive the sagely benevolence.”\n\nThereupon, the Celestial Worthy commanded the flying divine beings of the ten directions to open the *Jade Casket of the Nine Dark Realms of the Long Night’s Repository* and bring forth the *Luminous Statutes of Authentic Reality*, that the youths might be delivered.\n\nAt that moment, the great sages of the various heavens, the honored deities of the primordial limit, the divine immortals and jade maidens—an innumerable host beyond reckoning—all simultaneously approached the seat.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1235,
      "start_sentence": 0,
      "end_sentence": 50,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.03153347969055,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝长夜之府九幽玉匮明真科.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "天洒香花，神龙伎乐，飞歌四畅，琼音流逸，天朗气清，澄无氛翳，日童灌精，月女散花，流光四合，照曜诸天，百和洗秽，神风扫尘，河海潜伏，山岳吞烟，龙鳞踊跃，神人普欢，生死开泰，福庆普隆，五苦解脱，九幽赦魂，长徒披散，上升天堂。 男女欢悦，长乐欣欣，诸天称庆，伏听诀言。 长夜之府九幽玉匮明真科#1 明真科曰：生世好学，弃色断情。 长斋持戒，晨夜诵经，不倦时刻，惟道自营。 恬和六行，心柔意玄，想念在法，轮转生死，愿心不绝。 世世因缘，名书金格，列字九天。 致得乘虚，白日飞行，驾景策龙，上登玉清。 明真科曰：生世好学，修行经教，吞精咽炁，恒无倦息，持斋服御，吐纳自练，积功布德，名书上清。 致得尸解下仙，游行五岳。 后生人中，更受经法，为人宗师，转轮道备，克得上仙，白日飞行，位及高真。 明真科曰：生世炼真，服御神丹，五石镇生，神宝#2五宫，功微德侠，运未升天。 身受灭度，而骸骨芳盈，亿劫不朽#3，须臾返形，便更受生，还为人中#4。 智慧聪达，逆知吉凶，运通#5彻视，役使鬼神，轮转不绝，克得受书，为九宫真人。 明真科曰：生世好法，收鬼治病，佐天正炁，驱驰谨按，不犯科戒，施为得法，功德巍巍，为地祇所称，名上诸天，死升南宫，受号上补诸天都官，总领鬼神。 后更受生，还为人宗，随世教化，洞明自然，输转不绝，位及神仙。 明真科曰：生世念善，敬乐神明，供养三宝，礼受师宗，命过升天，为太上之宾。 后生人中，得为人尊，三界所敬，鬼神所称，门户清贵，天人所欣。 於此而学，宗受大经，修斋持戒，广见福田，功满德足，克得神仙。 明真科曰：生世好道，游涉名山，八节本命，礼请神明。 烧香愿乐，恒无暂忘，施穷救厄，济度众生。 敬仰师宝，感应诸天，五帝所举，名言青宫。 命过克得径升五岳，死无拘闭，与五帝周旋。 后生人中，身受大经，神明备卫，威制五方，靡不回伏，适意所从，神丹玉芝，不求自丰，身生水火，变化万端，因缘不绝，克得受号为#6五帝真人。 明真科曰：生世勇猛，平断四方，佐时正炁，诛除奸凶。 心清身净，行合神明，后死魂升，南宫受书，为四极明公，或为善爽之神。 后生人中，通灵彻视，坐致自然，三官所敬，天人所宗。 救度厄命，广作大功，因缘不绝，克自得入无为道真。 明真科曰：生世敬信，修奉智慧#7上品十戒。 积诸善功，供养法师，烧香燃灯，佐天光明，照耀十方，施惠有德，念度众生，死升东华，受号飞天，位比太上#8十转弟子，为众圣策驾，游行云中。 后生贵家侯王之门，世世欢乐，恒值明师，修受经法，建大善功，诸天所敬，神明所宗，天人所仰，坐致自然，福庆巍巍，难可为胜，功满德就，白日升天。 明真科曰：生世愿乐，宗奉至经，供养三宝，广开法门。 捐弃财物，散施贫民。 供师法服，建立治堂，明灯照夜，九幽之中，见世光明，死升天堂#9，逍遥欢乐，衣食自然。 后生富贵国王之门，世世庆祚，与善因缘。 又於贵盛供养殊精，修斋持戒，济度众生，地司所称，名上诸天，功满德足，身有光明，项生圆象，白日飞行，上升玄都，位为仙王。",
      "translated_text": "Heaven scattered fragrant blossoms, divine dragons performed with music, soaring songs resounded in all directions, jade-like melodies flowed and drifted. The sky was bright, the qi clear, all haze and obscurity dissolved. The Sun Lad poured forth essence, the Moon Maiden scattered flowers, radiant light converged from all sides, illuminating the various heavens. A hundred harmonies cleansed defilement, divine winds swept away dust. Rivers and seas lay hidden in stillness, mountains and peaks swallowed the mist. Dragon scales leapt and danced, divine beings and humans rejoiced universally. The gates of life and death opened to prosperity, blessings and felicity spread universally. The Five Sufferings were released, the Nine Dark Realms pardoned souls. Long-bound prisoners were freed, ascending to the heavens. Men and women rejoiced, everlasting joy abounded, the various heavens celebrated, prostrating to hear the decisive words.\n\nFrom the *Jade Casket of the Nine Dark Realms of the Long Night’s Repository*, the *Luminous Statutes of Authentic Reality* declared:\n\n**The Luminous Statutes state:** In this life, devote yourself to learning, forsake sensual desire, and sever emotional attachments. Maintain a perpetual fast, uphold the precepts, recite scriptures day and night without weariness, and cultivate the Dao at all times. Harmonize the Six Conducts, soften the heart, and darken the intent. Your thoughts dwell in the Dharma, and though you cycle through life and death, your vow remains unbroken. Through lifetimes of karmic conditions, your name is inscribed in the Golden Registers, listed among the Nine Heavens. Thus, you shall attain the ability to ride the void, soaring in broad daylight, driving the radiant chariot and spurring the dragon to ascend to the Jade Clarity Heaven.\n\n**The Luminous Statutes state:** In this life, devote yourself to learning and practicing the scriptural teachings. Ingest essence and swallow qi without weariness or rest. Maintain a fast, regulate your diet, refine yourself through breath, accumulate merit, and spread virtue. Your name is inscribed in the Upper Clarity Heaven. Thus, you shall attain liberation through simulated death as a lower immortal, roaming the Five Peaks. In a later life among humans, you shall again receive the scriptural teachings, become a master of the lineage, perfect the turning of the Dao’s wheel, and attain the rank of upper immortal, soaring in broad daylight to join the exalted perfected.\n\n**The Luminous Statutes state:** In this life, refine the authentic and ingest divine elixirs. The Five Minerals stabilize life, and the divine treasures of the Five Palaces are secured. Though your merit is modest and your virtue slight, your destiny has yet to ascend to heaven. When your body undergoes extinction, your bones shall remain fragrant and flourishing, imperishable for countless kalpas. In an instant, you shall regain form and be reborn among humans. Endowed with wisdom and keen insight, you shall foresee fortune and misfortune, your destiny unimpeded, your vision penetrating. You shall command ghosts and spirits, cycling without cessation, and attain the scriptures to become a Perfected of the Nine Palaces.\n\n**The Luminous Statutes state:** In this life, devote yourself to the Dharma, subdue ghosts, and heal the sick. Assist the celestial rectifying qi, act with diligence and care, and never violate the statutes and precepts. Your deeds accord with the Dharma, and your merit and virtue towering. Praised by the earth deities, your name ascends to the various heavens. At death, you shall rise to the Southern Palace, receiving the title of Supreme Attendant to the Celestial Offices, governing all ghosts and spirits. In a later life, you shall be reborn as a human patriarch, teaching and transforming the world, penetrating the natural, and cycling without end. Your rank shall reach that of divine immortal.\n\n**The Luminous Statutes state:** In this life, cultivate goodness and revere the divine. Make offerings to the Three Treasures, pay homage to and receive the teachings of your masters and lineage. At death, you shall ascend to heaven as a guest of the Most High. In a later life among humans, you shall be honored as a human patriarch, respected by the Three Realms, and praised by ghosts and spirits. Your household shall be pure and noble, delighting gods and humans. From this, you shall study and receive the great scriptures, maintain fasts, uphold the precepts, and broadly perceive the fields of merit. When your merit is complete and your virtue sufficient, you shall attain the rank of divine immortal.\n\n**The Luminous Statutes state:** In this life, devote yourself to the Dao, journeying to renowned mountains. On the eight seasonal nodes and your natal day, pay homage to and invoke the divine. Burn incense and make vows with unwavering devotion. Relieve the destitute, rescue the distressed, and deliver sentient beings. Reverently honor your masters and the Three Treasures, moving the various heavens to respond. Recommended by the Five Emperors, your name is proclaimed in the Azure Palace. At death, you shall directly ascend to the Five Peaks, unbound by confinement, and consort with the Five Emperors. In a later life among humans, you shall receive the great scriptures, guarded by divine beings, your might subduing the Five Directions. None shall fail to submit, and all shall follow your will. Divine elixirs and jade mushrooms shall abound without seeking, your body shall command water and fire, transforming in myriad ways. With unbroken karmic conditions, you shall receive the title of Perfected of the Five Emperors.\n\n**The Luminous Statutes state:** In this life, be courageous and resolute, pacifying the Four Directions. Assist the rectifying qi of the times, executing the treacherous and malevolent. Keep your heart pure and your body clean, your conduct aligning with the divine. After death, your soul shall ascend to receive the scriptures in the Southern Palace, becoming a Luminous Duke of the Four Poles or a spirit of blessed radiance. In a later life among humans, you shall possess penetrating insight, attaining the natural effortlessly. Revered by the Three Offices and honored by gods and humans, you shall rescue those in distress and perform great deeds. With unbroken karmic conditions, you shall attain the Dao of Non-Action and Perfection.\n\n**The Luminous Statutes state:** In this life, be reverent and faithful, practicing the Ten Superior Precepts of Wisdom. Accumulate all good deeds, make offerings to Dharma masters, burn incense, and light lamps to assist the celestial illumination, shining upon the Ten Directions. Bestow kindness upon the virtuous, and vow to deliver sentient beings. At death, you shall ascend to the Eastern Florescence, receiving the title of Flying Immortal, your rank equal to the Ten Transformed Disciples of the Most High. You shall drive the chariots of the assembled sages, roaming the clouds. In a later life, you shall be born into the household of a noble lord or king, enjoying joy through the generations, ever encountering enlightened masters. You shall study and receive the scriptural teachings, establishing great merit. Revered by the various heavens, honored by the divine, and looked up to by gods and humans, you shall attain the natural effortlessly. Your blessings and felicity shall be towering, unmatched. When your merit is complete and your virtue perfected, you shall ascend to heaven in broad daylight.\n\n**The Luminous Statutes state:** In this life, delight in and honor the supreme scriptures, making offerings to the Three Treasures and broadly opening the Dharma gates. Donate wealth and distribute alms to the poor. Provide your masters with Dharma robes, establish halls of practice, and keep lamps burning through the night. Within the Nine Dark Realms, the world shall witness your radiance. At death, you shall ascend to the heavenly halls, carefree and joyful, your clothing and food naturally provided. In a later life, you shall be born into the household of a wealthy and noble king, blessed through the generations with good karmic conditions. Again, in your noble and prosperous state, you shall make exceptional offerings, maintain fasts, uphold the precepts, and deliver sentient beings. Praised by the earthly administrators, your name shall ascend to the various heavens. When your merit is complete and your virtue sufficient, your body shall emanate light, a circular image appearing above your neck. You shall soar in broad daylight, ascending to the Mysterious Capital to become a Perfected King of Immortals.",
      "overlap_context": " benevolence.”\n\nThereupon, the Celestial Worthy commanded the flying divine beings of the ten directions to open the *Jade Casket of the Nine Dark Realms of the Long Night’s Repository* and bring forth the *Luminous Statutes of Authentic Reality*, that the youths might be delivered.\n\nAt that moment, the great sages of the various heavens, the honored deities of the primordial limit, the divine immortals and jade maidens—an innumerable host beyond reckoning—all simultaneously approached the seat.",
      "start_char": 1235,
      "end_char": 2472,
      "start_sentence": 51,
      "end_sentence": 86,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.81553673744202,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝长夜之府九幽玉匮明真科.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "明真科曰：生世奉师，供养道经，长斋持戒，不违天科，烧香燃灯，照曜诸天，朗彻九幽，长夜光明，七祖欢泰，无复忧患。 身行善功，大建福田，广度一切，惠流众生，仙运未满，法应更灭，死升南官，即得更生。 还生贵门，帝王宫中，适意从容，於此发愿，精诚殊勤； 心不退转，施功日新，三界所称，名书上清，灭度运充，克得飞行，上升太极，位登仙公。 飞天神人曰：长夜之府九幽玉匮明真科品，上牒十善因缘，治行所得积善之功，名题诸天金简玉字神仙品中。 运未升度，应经轮转，死升天堂，衣饭自然，逍遥无为，福庆难胜。 还生富贵，帝王之门，世世欢乐，与道因缘#10。 承此之基，勤修大法，广立善功，情不懈怠，志行日新，三界所称，克得神仙。 若於福中，不能勤心，纵情退转，还入恶门，施行凶逆，所作不忠，犯诸非法，沉轮恶根，一失善阶，无有还缘。 来生诸贤，善思吾言。 於是诸天大圣七千二百四十童子，同时称善。 飞天神人说十善因缘功德报应毕，诸天童子欢喜作礼，是时飞天神人而作颂曰： 勤行奉斋戒，诵经制六情。 致得乘空飞，曜景上玉清。 精心奉经教，吐纳练五神。 功德冠诸天，轮转成上仙。 苦行修生道，服药炼芝英。 灭度形不休，体骨自香芳。 精苦明鬼法，驱驰以效功。 灭度补都官，后生为人宗。 受道敬神明，供养三宝真。 生世为人尊，灭度太上宾。 八节游名山，愿念度众生。 位登五帝友，后生有威严。 勇猛平正心，回恶灭奸凶。 三官所畏敬，得为天人宗。 敬信奉十戒，烧香恒明灯。 功齐十转报，位得及飞天。 供养三宝经，施散立功勤。 灭度升天堂，后生国王门。 奉师过奉神，欣欣对真经。 生处贵门中，灭度三界庭。 明真科#11曰：无极世界男女之人，生世身行，不念为善，动为恶根，攻伐师主，谗击善人，杀害无道，不念众生，酷虐为行，阴怀谋逆，嫉妬胜己，抑绝贤明，死受恶对，拘闭罪魂，径入地狱，长夜之中，诸痛备加，苦毒难胜，万劫当还，生非人之道，永失福门，长沦罪涂，往返无穷，不得开度，亿劫无缘。 明真科曰：无极世界男女之人，生世身行，发心举意，恒恶为先，苦酷无度，谄害忠良，毁善长恶，谤击贤人，死受恶对，牛头狩身，昼夜考掠，楚毒难言，身体脓坏，无复人形，万劫当还，生边夷之国，有人之形，无人之情，永失人道，长沦罪门，流曳五苦八难之中，不得开度，亿劫无还。 明真科曰：无极世界男女之人，生世悭贪，惟欲益己，不念施人，割夺四辈，神人为冤，啖食无厌，自饶一身。 死受恶对，为饿鬼畜生，吞火食炭，恒不得充。 身体焦烂，无复人形，流曳涂炭，苦毒难言。 万劫当还#12生六畜之中，永失人道，长沦异形，不得开度，望反甚难。 明真科曰：无极世界男女之人，生世富贵，凌虐贫贱，夺人所爱，离人种亲，分隔骨肉，各在一方。 或六亲通同，淫犯骨肉，斯罪深重，死受破裂，身形分离，头首异处，魂鬼髡截，锒铛锁械，往返铁针之上，食息不得，一日三掠，乃得还生牛马之身，以报宿冤，永失人道，长沦罪根，不得开度，亿劫异形。 明真科曰：无极世界男女之人，生世恶逆，咒诅善人，叫唤神鬼，质誓三官，杀生淫祀，祷祭邪神，歌舞妖孽，自称姑郎，贪啖#13百姓，妄作无端，赃满罪定，死受恶对，魂鬼囚徒，流曳三官，五岳之中，一日三掠，痛苦难言，万劫当得还生贱人，或婴六极，无人之形，沉沦罪深#14，望反冥冥，不得开度，福道无缘。",
      "translated_text": "The *Luminous Perfection Regulations* states: Those born into the world who serve their masters, make offerings to the Daoist scriptures, maintain long fasts and uphold the precepts, never violating the celestial statutes, burn incense and light lamps to illuminate the various heavens, their radiance penetrating the Nine Dark Realms, bringing light to the long night—such that their seven generations of ancestors rejoice in peace, free from sorrow and suffering. Those who perform good deeds, extensively cultivate fields of merit, broadly deliver all beings, and bestow kindness upon the multitude—when their immortal destiny is not yet complete and their dharma-bound fate requires further dissolution—shall ascend at death to the Southern Palace and immediately be reborn. Returning to a noble household, within the palace of an emperor, they shall live at ease and unhurried. There, they shall renew their vows with exceptional sincerity and diligence, their resolve unwavering, their merit ever-renewing. Praised by the Three Realms, their names shall be inscribed in the Upper Clarity. When their destined dissolution is fulfilled, they shall attain flight, ascending to the Great Ultimate to assume the rank of Immortal Duke.\n\nThe Flying Heavenly Divine Persons declare: The *Luminous Perfection Regulations of the Nine Dark Realms’ Jade Casket* records the ten good karmic conditions and the merits accrued through virtuous conduct. Their names shall be inscribed in the golden tablets and jade characters of the divine immortals among the heavens. Before their destined ascension is complete, they shall undergo cyclic rebirth, ascending at death to the heavenly halls where clothing and food arise naturally, carefree and without striving, their blessings and joys beyond measure. Reborn into wealth and nobility, within the household of an emperor, they shall enjoy happiness through the generations, bound in karmic affinity with the Dao. Building upon this foundation, they shall diligently cultivate the great dharma, broadly establish good deeds, their devotion unwavering, their aspirations ever-renewing. Praised by the Three Realms, they shall attain the rank of divine immortals. Yet if, amid their blessings, they fail to remain diligent, indulging in laxity and regression, they shall reenter the gates of evil, committing violent and treacherous acts, their deeds disloyal, violating the laws and sinking into the roots of wickedness. Once the ladder of goodness is lost, there shall be no return. Let all future worthies reflect deeply upon these words.\n\nThereupon, seventy-two hundred and forty divine youths of the various heavens simultaneously voiced their approval. When the Flying Heavenly Divine Persons finished expounding the karmic retributions of the ten good conditions, the divine youths rejoiced and paid homage. Then the Flying Heavenly Divine Persons offered this hymn:\n\nDiligent in fasting and precepts,\nReciting scriptures to restrain the six senses—\nThey attain flight through empty space,\nTheir radiance ascending to Jade Clarity.\n\nWith sincere heart they uphold the scriptural teachings,\nRefining the five spirits through breath and absorption.\nTheir merit crowns the heavens,\nThrough cyclic rebirth they become superior immortals.\n\nThrough ascetic practice they cultivate the Dao of life,\nIngesting medicines and refining the essence of mushrooms.\nWhen dissolution comes, their form does not perish,\nTheir bones exude natural fragrance.\n\nThrough rigorous discipline they master the methods of spirits,\nDriving and striving to demonstrate their merit.\nWhen dissolution comes, they fill the offices of the capital,\nLater reborn as human patriarchs.\n\nReceiving the Dao and revering the divine,\nMaking offerings to the Three Treasures in truth—\nIn life they are honored among men,\nAt dissolution they become guests of the Most High.\n\nOn the eight seasonal nodes they wander sacred mountains,\nVowing to deliver sentient beings.\nThey ascend to become companions of the Five Emperors,\nIn later lives endowed with majesty.\n\nWith courage and impartiality they calm their minds,\nTurning away from evil and extinguishing treachery.\nFeared and revered by the Three Officials,\nThey become patriarchs of heaven and men.\n\nReverently upholding the Ten Precepts,\nBurning incense and keeping lamps ever-bright—\nTheir merit equals tenfold repayment,\nAttaining the rank of flying immortals.\n\nMaking offerings to the Three Treasures and scriptures,\nDispersing alms to establish diligent merit—\nAt dissolution they ascend to the heavenly halls,\nLater reborn into the household of a king.\n\nServing their masters beyond even the divine,\nJoyfully facing the true scriptures—\nBorn into noble households,\nAt dissolution they enter the courts of the Three Realms.\n\nThe *Luminous Perfection Regulations* states: In the boundless world, men and women who in life perform no good deeds, their actions rooted in evil, assaulting their masters and slandering the virtuous, committing murder without principle, showing no regard for sentient beings, practicing cruelty and oppression, harboring treacherous schemes, envying those superior to themselves, suppressing and silencing the worthy and enlightened—upon death, they shall face retribution, their sinful souls bound and confined, descending directly into hell. In the long night, they shall endure every torment, their suffering unbearable. After ten thousand kalpas, they may return, but only to the paths of non-human beings, forever barred from the gates of blessing, eternally mired in the roads of sin, endlessly cycling without deliverance, for a hundred million kalpas without hope of return.\n\nThe *Luminous Perfection Regulations* states: In the boundless world, men and women who in life set their minds and intentions upon evil as their constant practice, inflicting boundless cruelty, deceiving and harming the loyal and good, destroying virtue and fostering wickedness, slandering and attacking the worthy—upon death, they shall face retribution, their bodies transformed into those of ox-headed jailers. Day and night they shall be tortured, their suffering beyond words. Their bodies shall fester and rot, no longer retaining human form. After ten thousand kalpas, they may return, but only to the lands of frontier barbarians, possessing human form but lacking human nature, forever barred from the human path, eternally mired in the gates of sin, drifting through the five sufferings and eight adversities, without deliverance, for a hundred million kalpas without hope of return.\n\nThe *Luminous Perfection Regulations* states: In the boundless world, men and women who in life are miserly and greedy, seeking only to benefit themselves, never considering others, seizing from the four classes, incurring the resentment of gods and men, insatiably devouring, enriching only themselves—upon death, they shall face retribution, becoming hungry ghosts and beasts, swallowing fire and eating coals, never satisfied. Their bodies shall char and fester, no longer retaining human form, drifting through the roads of ash and embers, their suffering beyond words. After ten thousand kalpas, they may return, but only into the bodies of the six domestic animals, forever barred from the human path, eternally trapped in alien forms, without deliverance, their hope of return exceedingly remote.\n\nThe *Luminous Perfection Regulations* states: In the boundless world, men and women of wealth and nobility who in life oppress and bully the poor and lowly, seize what others love, separate others from their kindred, dividing flesh and bone to dwell in distant places—if they commit incest with their six relations, such sins are profoundly grave. Upon death, they shall face dismemberment, their bodies torn apart, heads severed from torsos, their souls shorn and bound in chains and fetters. They shall be dragged back and forth over beds of iron needles, unable to eat or rest, thrice daily tortured before being reborn into the bodies of oxen and horses to repay their karmic debts. Forever barred from the human path, eternally mired in the roots of sin, without deliverance, for a hundred million kalpas trapped in alien forms.\n\nThe *Luminous Perfection Regulations* states: In the boundless world, men and women who in life commit evil and treachery, cursing the virtuous, invoking gods and ghosts, swearing oaths before the Three Officials, killing living beings in licentious sacrifices, praying to and worshipping demonic spirits, engaging in lewd dances and sorcery, calling themselves \"aunt\" or \"uncle,\" greedily devouring the common folk, wantonly committing senseless acts—when their crimes accumulate and their sins are fixed, upon death they shall face retribution, their souls imprisoned as convicts, drifting through the Three Officials and the Five Peaks. Thrice daily they shall be tortured, their suffering beyond words. After ten thousand kalpas, they may return as lowly persons, or afflicted by the six adversities, lacking human form, sunk deep in sin. Their hope of return is dark and distant, without deliverance, forever barred from the path of blessing.",
      "overlap_context": "h good karmic conditions. Again, in your noble and prosperous state, you shall make exceptional offerings, maintain fasts, uphold the precepts, and deliver sentient beings. Praised by the earthly administrators, your name shall ascend to the various heavens. When your merit is complete and your virtue sufficient, your body shall emanate light, a circular image appearing above your neck. You shall soar in broad daylight, ascending to the Mysterious Capital to become a Perfected King of Immortals.",
      "start_char": 2473,
      "end_char": 3817,
      "start_sentence": 87,
      "end_sentence": 127,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.14298605918884,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝长夜之府九幽玉匮明真科.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "明真科曰：无极世界男女之人，生世所犯，手杀君父，谋反师主，贼害人命，恃强抑弱，攻击善人，官府怨酷，横罹无端，枉者称诉，怨对弥天。 或裸露三光，秽慢北君，不敬天地，不畏鬼神，毁灭经教，秽辱天真。 死受恶对，身入镬汤，五体煮渍，无复人形，百毒之汁，以灌其上，痛不可居，苦难不任，万劫当生六畜之中。 或为贱人，聋盲六疾，非人之形，任人杀活，以报宿怨，福路日远#15，罪根日深，不得开度，长沦无还。 明真科曰：无极世界男女之人，生世所行，不信大法，不敬神明，或浮好三宝，执心不专，轻怠经法，秽慢灵文。 或传受弟子，不依科年，或不关天地，私传无盟，自作一法，违负四明，或斋戒怠慢，疑忽上真。 其罪深重，死被髡钳，循上剑树，八达交风，吹树低昂，足落刀山，往返无数，身体烂伤，痛不可忍，毒不可任#16，万劫当得还生下愚之中。 或婴六疾，聋盲不聪，长与#17道隔，永远学门，转轮五苦，沉沦罪由，不得开度，长值恶根。 明真科曰：无极世界男女之人，生世所行，评详四辈，攻击天人，不慈不孝，不仁不忠，骂#18辱父母，六亲相残。 或烹杀六畜，割剔残伤，夭杀狩命，屠毒众生，其罪深逆，死受酷对，吞火食炭，为火所烧，头面焦燎，通体烂坏，无复人形，身负铁镬，头戴火山，痛非可忍，考不可担，当得还生六畜之中，任人杀活，以酬昔怨，永失人道，长沦罪根，不得开度，何由得还#19。 明真科曰：无极世界男女之人，杀生淫祠，叛道入邪，诽笑道士，訾毁真人，轻慢三宝，弃法入伪，恣意无道，不信宿命，自作一法。 或掘人骸骨，暴露草野，其罪深重，死受重对，裸身无衣，肉负#20铁杖，五体脓烂，不可胜忍，万劫当得还生下愚之中，痴聋无知，或受邪病，非复人道，福路长乖#21，与罪为绿，不得开度，亿劫无还。 明真科曰：无极世界男女之人，生世无道，劫盗人物，肆行凶逆，伤害人命，刀戟刺射，无所顾虑，换贷不还，取求无足，其罪深重，死受殃对，身形髡截，负山担石，食息无闲，不舍昼夜，涂炭辛苦，非可堪忍。 万劫当得还生牛马之中，以力报怨。 纵生人道，当受残伤，刑狱幽击，流曳八难，求死不得，忧恼自婴，不得开度，永沦罪门。 明真科曰：无极世界男女之人，生世无道，乘暗而行，夜入人家，掠人妻妾，夺人衣服，谋图不轨，伤残男女，死受重罪，头脚锁械，幽闭三光，不见日月，考掠楚痛，非可堪忍。 万劫当得还生下人之中，为人仆#22使，任人鞭杖，或聋盲无目，为人所牵，以报宿怨，永去善道，恶根日深，长沦亿劫，不得开度#23。 明真科曰：无极世界男女之人，生世无道，不念善缘，三春游猎，放鹰走犬，张罗布网，放火烧山，刺射野兽，杀害众生，其罪酷逆，死充重殃，身负铁杖，万痛交行，驱驰百极，食息无宁，死魂苦毒，非可堪当，万劫当生，野兽之身。 恒被烧斫，以报宿怨，纵横人道，恒遭恶人，万劫鞭迫#24，忧苦自婴，福路日远，罪根日臻，不得开度，长夜绵绵。 明真科曰：无极世界男女之人，生世立行，恶口赤舌，斗乱中外，评论道德，毁辱天真，不信经法，口是心非，潜行谋恶，攻击四辈，走作人物，形名男女，天人冤对，骂詈无度，声言丑秽，叫唤鬼神，更相咒诅，其罪深重，死受苦毒，拔出其舌，铁锥#25刺之，巨天力士，铁杖乱打，无复限极#26，身体烂坏，不可为忍，万劫当还，受形为犬，恒使吠人，任人打扑#27，纵还#28人中，当生边夷，非人之类，百恶所归，以报宿对，永失人道，无有归期，流连罪门，不得开度#29。",
      "translated_text": "The *Mingzhen Canon* states: In the boundless world, men and women who in life commit crimes—hands that slay rulers and fathers, plots to betray masters and teachers, murderous harm to human lives, bullying the weak with brute strength, assaulting the virtuous, cruelty in official posts, wanton suffering inflicted without cause, false accusations and grievances cried out—shall see their vengeful karma stretch to the heavens. Some expose the Three Luminaries to nakedness, defile and insult the Northern Lord, show no reverence for Heaven and Earth, no fear of gods and spirits, destroy scriptures and teachings, and defile the celestial perfected. Upon death, they shall face retribution, their bodies cast into cauldrons of boiling broth, their five limbs stewed and dissolved until no human form remains. A hundred poisons shall be poured upon them, pain unbearable, suffering beyond endurance. After ten thousand kalpas, they may return as beasts of burden, or as lowly persons afflicted with deafness, blindness, and the six infirmities, lacking human form, subject to slaughter at others’ whim, repaying old enmities. The path of blessing grows ever more distant, the roots of sin ever deeper, with no deliverance, forever sunk in inescapable damnation.\n\nThe *Mingzhen Canon* states: In the boundless world, men and women who in life act without faith in the Great Law, showing no reverence for the divine, or feign devotion to the Three Treasures while their hearts remain uncommitted, treat scriptures with disdain, and defile sacred texts—some transmit teachings to disciples without regard for the ordained years, or secretly pass on the Way without invoking Heaven and Earth, forging their own doctrines in violation of the Four Illuminations. Some observe fasts and precepts with negligence, doubting and slighting the perfected. Their sins are grave and heavy. Upon death, they shall be shaved and shackled, made to climb sword trees where winds from eight directions blow the branches low and high, their feet slipping onto blade mountains, ascending and descending without end, their bodies torn and wounded, pain unbearable, agony beyond endurance. After ten thousand kalpas, they may return as the most foolish of beings, or be afflicted with the six infirmities, deaf and blind, forever barred from the Dao, eternally shut out from the gates of learning. Trapped in the Five Sufferings, sunk deep in the causes of sin, they shall find no deliverance, forever bound to evil roots.\n\nThe *Mingzhen Canon* states: In the boundless world, men and women who in life act without compassion or filial piety, lacking benevolence or loyalty, cursing and humiliating parents, turning kin against one another—some boil and slaughter livestock, carving and maiming, cutting short lives through hunting, poisoning and butchering living beings. Their sins are deeply perverse. Upon death, they shall face cruel retribution, forced to swallow fire and eat coals, burned by flames until their heads and faces are scorched, their bodies rotted beyond recognition. They shall bear iron cauldrons on their backs and wear mountains of fire upon their heads, pain beyond endurance, torment beyond bearing. They shall return as beasts of burden, subject to slaughter at others’ hands to repay old enmities, forever losing the human path, eternally mired in the roots of sin, with no deliverance, no hope of return.\n\nThe *Mingzhen Canon* states: In the boundless world, men and women who in life kill living beings in licentious sacrifices, betray the Dao to follow heresy, mock Daoist priests, slander the perfected, show contempt for the Three Treasures, abandon the Law for falsehood, indulge in wanton impiety, deny predestined fate, and forge their own doctrines—some dig up human bones, exposing them in the wild. Their sins are grave and heavy. Upon death, they shall face severe retribution, stripped naked and made to bear iron rods upon their flesh, their five limbs festering with pus, suffering beyond endurance. After ten thousand kalpas, they may return as the most foolish of beings, dull and deaf, or afflicted with demonic illnesses, no longer human. The path of blessing shall forever diverge, entwined with sin, with no deliverance, lost for countless kalpas.\n\nThe *Mingzhen Canon* states: In the boundless world, men and women who in life act without the Dao—robbing and plundering, committing violent crimes, taking lives with blades and arrows without hesitation, refusing to repay debts, demanding without end—shall bear grave sins. Upon death, they shall face calamitous retribution, their bodies shaved and severed, made to bear mountains and carry stones, laboring without rest day or night, mired in toil and misery beyond endurance. After ten thousand kalpas, they may return as oxen or horses, repaying enmities with their strength. Even if reborn as humans, they shall suffer mutilation, imprisonment, and beatings, drifting through the Eight Adversities, longing for death yet denied it, tormented by endless sorrow. They shall find no deliverance, forever trapped in the gates of sin.\n\nThe *Mingzhen Canon* states: In the boundless world, men and women who in life act without the Dao, moving under cover of darkness to break into homes, abducting wives and concubines, seizing clothing, plotting wicked schemes, and harming men and women—shall upon death face severe punishment, their heads and feet locked in shackles, imprisoned in darkness where the Three Luminaries are unseen, subjected to torture and pain beyond endurance. After ten thousand kalpas, they may return as lowly persons, enslaved and beaten, or deaf and blind, led by others, repaying old enmities. Forever barred from the path of goodness, their evil roots deepening, they shall remain lost for countless kalpas, with no deliverance.\n\nThe *Mingzhen Canon* states: In the boundless world, men and women who in life act without the Dao, heedless of good causes, roaming in the three spring months for hunting, flying hawks and unleashing hounds, setting snares and nets, burning mountains with fire, shooting wild beasts, and slaughtering living beings—shall bear cruel and perverse sins. Upon death, they shall be condemned to heavy suffering, made to bear iron rods, a thousand pains assailing them at once, driven to the ends of the earth without rest, their souls tormented by unrelenting agony. After ten thousand kalpas, they may return as wild beasts, forever hunted and butchered to repay old enmities. Even if reborn as humans, they shall constantly suffer at the hands of evil men, whipped and tormented for ten thousand kalpas, sorrow and suffering their constant companions. The path of blessing grows ever more distant, the roots of sin ever deeper, with no deliverance, lost in an endless night.\n\nThe *Mingzhen Canon* states: In the boundless world, men and women who in life act with malicious tongues and deceitful words, stirring strife within and without, slandering the Dao and the virtuous, disbelieving in scriptures, speaking falsely while harboring evil, plotting in secret, attacking the four classes, and spreading rumors about others—whether men or women—shall incur the vengeful karma of gods and humans, cursing without restraint, uttering vile and filthy words, invoking ghosts and spirits, and hurling mutual curses. Their sins are grave and heavy. Upon death, they shall suffer cruel torment, their tongues torn out and pierced with iron awls, struck without limit by mighty celestial warriors wielding iron rods, their bodies rotted beyond recognition, pain beyond endurance. After ten thousand kalpas, they may return as dogs, forever barking at others, beaten and abused at will. Even if reborn as humans, they shall be born among barbarians, no longer human, the target of all evil, repaying old enmities. Forever barred from the human path, with no hope of return, they shall drift endlessly in the gates of sin, with no deliverance.",
      "overlap_context": "acts—when their crimes accumulate and their sins are fixed, upon death they shall face retribution, their souls imprisoned as convicts, drifting through the Three Officials and the Five Peaks. Thrice daily they shall be tortured, their suffering beyond words. After ten thousand kalpas, they may return as lowly persons, or afflicted by the six adversities, lacking human form, sunk deep in sin. Their hope of return is dark and distant, without deliverance, forever barred from the path of blessing.",
      "start_char": 3818,
      "end_char": 5223,
      "start_sentence": 128,
      "end_sentence": 147,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.55516695976257,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝长夜之府九幽玉匮明真科.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "明真科曰：无极世界男女之人，生世立行，耽酒好色，恍惚失性，猖狂迷惑，五情乱离，去神损气，因醉贪欲，为恶不觉，叫唤骂詈，独作无对，打击善人，秽慢道法，谤毁经教，背真入伪，违负口信，欺谤#30四辈，所行失道，罪有深逆。 死受重对，魂神苦剧，摙#31汲溟波，以灌四渎，谪作江河，昼夜无息，锒#32铛锁械，相牵流曳，冥冥长夜，终无解脱。 万劫当生贼人之中，贫贱陋疾，为人所恶，以报宿怨，因缘之对，福路日远，罪根日结，不得开度，无由得出。 飞天神人曰：长夜之府九幽玉匮明真科律，一十四条罪报之目，先身积行，负逆恶对，善善相系，恶恶相续，往返相加，以致不绝，既失人道，转不自觉，沉沦六畜，畜生之类。 纵还人中，痴愚之极，或生边夷，或婴六疾，相牵流曳，万劫无出，生世无几，死日长闭，一失善路，永乖贤域，冥冥长夜，何时得脱。 来生男女，明自勖#33励，建立大功，以自拔赎，身受十戒，可免此厄，善识吾言，慎勿忘失。 於是诸天大圣真人七千二百四十童子，一时称善。 飞天神人说行恶受对一十四条，恶根因缘不绝之科毕，诸天童子欢喜作礼，於是飞天神人而作颂曰： 生世不善念，酷虐攻师宝。 死受万痛毒#34，万劫失人道。 苦酷谄忠良，谗谤击贤人。 生世处边夷，死受牛马身#35。 悭贪惟欲得，不念施众生。 死魂为饿鬼，后生六畜形。 富贵凌贫贱，离夺人种亲。 身受破裂报，魂鬼被髡钳。 咒诅无辜人，淫祀舞邪神。 流曳三涂中，万劫生贱身。 谋逆虐君父，秽辱毁天真。 死入镬汤煮，苦痛不得还。 执心不专固，轻慢天宝经。 命过循剑树，风刀无暂停。 不念怀慈心，酷毒害众生。 死魂负铁镬，万劫戴火山。 叛道向邪神，訾毁背真人。 死形无衣披#36，铁杖不去身。 劫盗人财物，斫刺於天民#37。 死魂受髡截，生世被刑残。 乘暗入人家，肆意适所行。 死魂长幽闭，不见日月光。 积行不念仁，游猎捕众生。 铁杖以报怨，驱驰无暂宁。 凶性作口舌，斗乱无疏亲。 死受拔舌报，后生恒吠人。 好酒失本行，五神并猖狂。 死汲溟波水，灌沃四渎中。 於是飞天神人偈诵善恶因缘报应，以告诸天童子。 是时天人莫不开悟，咸见命根，普思宿昔所行罪源，改心自励，修奉经文，宿责披散，九幽肃清，皆得更生善缘之中。 诸天童子伏受法音，一时欢喜，作礼而去。 九幽玉匮罪福缘对拔度上品#38 太上道君前进作礼，上白天尊：今日侍座，得见童子，受诸威光，普照#39诸天福堂，及无极世界地狱之中，善恶报应，苦乐不同。 善者欢泰，逍遥无穷，恶者涂炭，流曳八难，无复身形，甚可哀伤。 如此之报#40，受恶因缘，亿劫长对，不识命根，不审可有功德，拔赎开度死魂，令出长夜九幽之中，身入光明，更生福门不乎#41。 如蒙慈愍，生死荷恩，亡者闲乐，见世兴隆，富贵昌炽，寿命久长，则云荫八遐，风洒兰林，来生男女，得闻法音，惟愿天尊，分别解说，授以诀言，令众见明科，一切得安。 天尊告太上道君曰：谛听吾言，善思善识封#42於中心，晨夜存念，慎勿使忘。 吾今为汝解说妙音，可得依用，拔赎罪魂，开出长夜，九幽八难，宿对披散，转入信根，生死欢乐，世世因缘。",
      "translated_text": "The *Luminous Percepts of the True* states: In the boundless world, men and women who live in the world and establish their conduct indulge in wine and lust, losing their nature in distraction, growing reckless and deluded. Their five emotions scatter in chaos, driving away spirit and harming qi. Drunk and greedy for desire, they commit evil unawares, shouting curses and vile words, acting alone without adversary. They strike the good, defile and scorn the Dao and its teachings, slander and destroy scriptures, turn from truth to falsehood, break promises and betray trust, deceive and malign the four assemblies. Their deeds stray from the Dao, and their sins run deep and perverse.\n\nUpon death, they face heavy retribution: their souls endure bitter torment, drawing and pouring the dark waves to flood the Four Rivers. Banished to become rivers and streams, they toil day and night without rest, bound in iron fetters and shackles, dragged and pulled endlessly through the long, dark night, never to be freed. After ten thousand kalpas, they shall be born among thieves—poor, base, and afflicted with loathsome diseases, despised by all, repaying old enmities. The bonds of their karmic causes tighten, their path to fortune grows ever more distant, and their roots of sin take deeper hold. They cannot be delivered, nor find any way out.\n\nThe Flying Celestial Divine Person says: The *Luminous Percepts of the Jade Casket of the Nine Dark Realms of the Long Night’s Repository* enumerate fourteen categories of karmic retribution. Past deeds accumulate, bearing the weight of perverse and evil adversities. Good binds to good, evil follows evil, each adding to the other in an unbroken cycle. Having lost the human path, they do not even realize it, sinking into the six kinds of beasts. Even if reborn among humans, they shall be utterly foolish, or born among barbarians, or afflicted with the six illnesses, dragged and pulled endlessly for ten thousand kalpas with no escape. Their lives in the world are brief, but their deaths are long and sealed. Once they lose the path of goodness, they forever stray from the realm of the worthy. In the long, dark night, when shall they find deliverance?\n\nMen and women of future generations, take heed and rouse yourselves! Establish great merit to redeem yourselves. Receive the Ten Precepts, and you may avoid this calamity. Remember well these words, and never forget them.\n\nThereupon, seven thousand two hundred and forty divine youths, the Great Perfected Saints of the heavens, all proclaimed their assent.\n\nThe Flying Celestial Divine Person having expounded the fourteen categories of karmic retribution for evil deeds and the unbroken bonds of evil causes, the divine youths rejoiced, paid homage, and then the Flying Celestial Divine Person spoke in verse:\n\nThose who in life harbor no good thoughts,\nCruelly abuse their teachers and treasures,\nShall in death suffer ten thousand agonies,\nAnd for ten thousand kalpas lose the human path.\n\nThose who cruelly flatter the loyal and good,\nSlander and strike the worthy,\nShall in life dwell among barbarians,\nAnd in death take the form of oxen and horses.\n\nThose who are miserly and greedy, desiring only gain,\nNever thinking to give to living beings,\nShall in death become hungry ghosts,\nAnd later be born as beasts of burden.\n\nThose who in wealth and power oppress the poor and lowly,\nSeize and separate others from their kin,\nShall in body suffer the retribution of being torn apart,\nAnd their souls, as ghosts, endure shaving and branding.\n\nThose who curse the innocent,\nAnd in lewd rites dance for evil spirits,\nShall be dragged through the Three Wretched Realms,\nAnd for ten thousand kalpas be born in lowly bodies.\n\nThose who plot treason and abuse their lords and fathers,\nDefile and disgrace the Celestial Perfected,\nShall in death be boiled in cauldrons of scalding water,\nTheir suffering unending, with no return.\n\nThose whose minds are not steadfast and resolute,\nWho slight and scorn the Heavenly Treasures of scripture,\nShall after death walk the path of sword trees,\nWhere wind and blades never cease.\n\nThose who harbor no compassion,\nBut cruelly harm living beings,\nShall in death bear iron cauldrons,\nAnd for ten thousand kalpas wear mountains of fire.\n\nThose who betray the Dao and turn to evil spirits,\nSlander and turn their backs on the Perfected,\nShall in death have no clothes to wear,\nAnd iron rods shall never leave their bodies.\n\nThose who rob and steal others’ wealth,\nCutting and stabbing the people of heaven,\nShall in death suffer shaving and amputation,\nAnd in life be maimed by punishment.\n\nThose who, under cover of darkness, break into homes,\nAnd act wantonly as they please,\nShall in death be forever confined in darkness,\nNever to see the light of sun or moon.\n\nThose who accumulate deeds without thought of kindness,\nAnd roam hunting to capture living beings,\nShall have their enmity repaid with iron rods,\nDriven and chased without a moment’s rest.\n\nThose of fierce nature who stir up strife with their tongues,\nCreating discord among kin and stranger alike,\nShall in death suffer the retribution of having their tongues torn out,\nAnd later be born to bark at others forever.\n\nThose who love wine and lose their original conduct,\nTheir five spirits all growing reckless,\nShall in death draw the waters of the dark waves,\nAnd pour them to flood the Four Rivers.\n\nThus the Flying Celestial Divine Person chanted in verse the karmic retribution of good and evil, proclaiming it to the divine youths. At that time, the celestial beings all awakened, clearly seeing the roots of their lives. They reflected on the sources of their past sins, reformed their hearts, and roused themselves to cultivate and uphold the scriptures. Their old debts were dispersed, the Nine Dark Realms were purified, and all were reborn amid good causes.\n\nThe divine youths received the Dharma-sound with reverence, rejoiced as one, paid homage, and departed.\n\nThe *Upper Grade on Deliverance from Karmic Retribution of Sin and Fortune in the Jade Casket of the Nine Dark Realms*\n\nThe Most High Lord of the Dao stepped forward, bowed, and addressed the Heavenly Worthy: Today, while attending in your presence, I have witnessed the divine youths receiving your majestic radiance, which illumines the halls of fortune in all the heavens and the hells of the boundless world, where the retribution of good and evil differs in suffering and joy. The good rejoice in peace, carefree and endless, while the evil wallow in misery, dragged through the Eight Difficulties, their bodies lost forever—how pitiable! Such retribution, bound to evil causes, faces endless kalpas of adversity, never recognizing the roots of their lives. Do they not possess merit to redeem and deliver the dead, to lead them out of the long night of the Nine Dark Realms, to enter the light, and be reborn in the gates of fortune?\n\nIf you would show compassion, the living and the dead would bear your grace. The departed would rest in peace, and the living would prosper, flourishing in wealth and honor, their lives long and enduring. Their influence would shade the eight distant lands, and their virtue would sprinkle the forests of orchids. Men and women of future generations would hear the Dharma-sound. I only pray, Heavenly Worthy, that you distinguish and explain, bestowing upon us the decisive words, so that all may see the precepts clearly and find peace.\n\nThe Heavenly Worthy addressed the Most High Lord of the Dao, saying: Listen well to my words, reflect deeply, and inscribe them in your heart. Day and night, hold them in mind, and never forget. I shall now explain the wondrous sound for you to follow, so that you may redeem sinful souls, open the way out of the long night, the Nine Dark Realms, and the Eight Difficulties. Their old adversities shall be dispersed, and they shall turn to the roots of faith, rejoicing in life and death, their karmic bonds spanning generations.",
      "overlap_context": "awls, struck without limit by mighty celestial warriors wielding iron rods, their bodies rotted beyond recognition, pain beyond endurance. After ten thousand kalpas, they may return as dogs, forever barking at others, beaten and abused at will. Even if reborn as humans, they shall be born among barbarians, no longer human, the target of all evil, repaying old enmities. Forever barred from the human path, with no hope of return, they shall drift endlessly in the gates of sin, with no deliverance.",
      "start_char": 5224,
      "end_char": 6471,
      "start_sentence": 148,
      "end_sentence": 193,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.41936206817627,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝长夜之府九幽玉匮明真科.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "其法高妙，万劫#43一传，世有贤明，誓而告焉。 密则福降，泄则祸#44臻。 风刀之戒，告於明真，违犯科律，勿怨诸天。 於是天尊命#45飞天神人说罪福缘对拔度上品。 当说经时，诸天日月星宿，朗曜普照九地无极世界，长夜之府九幽之中。 长徒饿鬼，责役#46死魂，身受光明，普见命根，於是自悟，一时回心，咸使思善，念还福门，五苦解脱，三涂蒙迁，宿对披释，地狱宁闲。 是时男女，普闻法音，预以有心，悉得神仙。 飞天神人曰#47：九幽玉匮拔度死魂罪对上品，常以正月、三月、五月、七月、九月、十一月，一年六月； 月一日、八日、十四日、十五日、十八日、二十三日、二十四日、二十八日、二十九日、三十日，一月合十日； 及八节日、甲子日、庚申日。 於家中庭安一长灯，令高九尺，於一灯上然九灯，每令光明，上照九玄诸天福堂#48，下照九地无极世界长夜之中。 依威仪具法#49开启，上请天仙地仙，真人飞仙，日月星宿，九宫五帝，五岳三河，四海兵马，各九亿万骑，三十二天监斋直事，侍香金童，散花玉女#50，五帝直符等#51，各三十二人，传言奏事飞龙骑吏等一合来下，监临斋堂，捻香愿念，应口上彻，行道事竟，皆启#52还天宫。 昼则烧香，夜则然灯，使香烟不绝息，露经中庭，於九灯之下，绕灯行道，上香愿念毕，次向东九拜言： 某甲今皈命东方无极太上灵宝天尊、已得道大圣众、至真诸君丈人、九炁天君、东乡诸灵官。 今故立斋，烧香然灯，愿以是功德，照曜诸天，普为帝王国主#53，君官吏民#54，受道法师，父母尊亲，同学门人，隐居山林学真道士、诸贤者，蠢飞蠕动，蚑行蜎息，一切众生，普得免度十苦八难，长居无为，普度自然，某#55家亿曾万祖，囚徒先魂，开诸光明，咸得解脱，转入信根，去离五道，开度因缘，死者长乐，生世蒙恩，天下太平，道德兴隆，今故烧香，自皈依#56师尊大圣众至真之德，得道之后，升入无形，与道合真。 毕，脱巾叩头自抟，各八十一过止。 次南向三拜言：",
      "translated_text": "The method is most exalted and wondrous, transmitted but once in ten thousand kalpas. Only when a worthy and enlightened one appears in the world is it solemnly imparted. Kept secret, blessings descend; revealed, calamities draw near. The warning of the Wind and Blade is declared to the Perfected Illuminati—transgress the precepts and statutes, and blame not the heavens.\n\nThereupon, the Heavenly Worthy commanded the Flying Celestial Beings to expound the karmic retribution of sins and blessings, delivering the highest grade of souls. As the scripture was recited, the luminaries of the heavens—sun, moon, and stars—radiated their brilliance, universally illuminating the boundless worlds of the Nine Earths and the long-night abodes of the Nine Dark Realms. The long-bound hungry ghosts, the toiling dead souls, received the light upon their bodies and beheld their life-roots. Thereupon, they awakened, turning their hearts as one, all inclining toward goodness, contemplating the return to the gate of blessings. The Five Sufferings were dissolved, the Three Paths uplifted; karmic adversities were dispersed, and the hells found tranquility.\n\nAt that time, men and women universally heard the Dharma-sound. Those who had prepared their minds all attained divine transcendence.\n\nThe Flying Celestial Being declared: The *Highest Grade of the Jade Casket for Delivering the Dead from the Nine Dark Realms and Their Karmic Adversities* is to be performed during the six months of the year—namely, the first, third, fifth, seventh, ninth, and eleventh months. Within each month, on the first, eighth, fourteenth, fifteenth, eighteenth, twenty-third, twenty-fourth, twenty-eighth, twenty-ninth, and thirtieth days—a total of ten days—as well as on the Eight Seasonal Festivals, the days of *jiazi* and *gengshen*, one should set a tall lamp, nine feet high, in the central courtyard of the home. Upon this single lamp, kindle nine lamps, each radiating light to illuminate above the Nine Mysteries and the celestial halls of blessings, and below the boundless worlds of the Nine Earths and the long-night abodes.\n\nIn accordance with the ritual decorum and prescribed method, invoke and welcome the Heavenly Immortals, Earthly Immortals, Perfected Ones, Flying Immortals, the luminaries of the sun, moon, and stars, the Nine Palaces and Five Emperors, the Five Sacred Peaks and Three Rivers, the armies of the Four Seas—each numbering ninety-nine billion cavalry—as well as the thirty-two celestial overseers of the fast, the attendant incense-bearing Golden Lads, the flower-scattering Jade Maidens, the thirty-two direct messengers of the Five Emperors, and the flying dragon couriers who transmit words and memorials. Let them all descend together to oversee the ritual hall, receive the incense offerings, and bear the vows upward. When the circumambulation and rites are complete, they shall return to their celestial palaces.\n\nBy day, burn incense; by night, kindle lamps, ensuring the fragrance never ceases. Display the scripture in the courtyard beneath the nine lamps, circumambulate the lamps, and after offering incense and reciting vows, turn to the east and bow nine times, saying:\n\n*\"I, [Name], now take refuge in the Eastern Infinite Supreme Numinous Treasure Heavenly Worthy, the Great Sage Hosts who have attained the Dao, the Perfected Lords and Venerable Masters, the Nine Qi Heavenly Lords, and the myriad divine officials of the Eastern Realm. Today, I establish this fast, burn incense, and kindle lamps, dedicating these merits to illuminate all heavens. May they universally benefit the Emperor, lords of states, officials, common folk, Dharma-receiving masters, parents and honored kin, fellow disciples, recluses in the mountains and forests cultivating the true Dao, all worthy ones, the crawling and flying, wriggling and creeping, all sentient beings—may they all be delivered from the Ten Sufferings and Eight Difficulties, dwell eternally in non-action, and attain universal deliverance by nature. May the myriad generations of my ancestors, the imprisoned and wandering souls of my lineage, be bathed in light, liberated, and turned toward the roots of faith. May they depart the Five Paths, resolve karmic bonds, and find eternal joy in death, while the living receive grace. May the world know great peace, the Dao and virtue flourish. Thus, I burn incense and take refuge in the virtue of the Great Sage Hosts and Perfected Ones. After attaining the Dao, may I ascend into the formless and unite with the true Dao.\"*\n\nWhen finished, remove the headscarf, kowtow, and clasp the hands, repeating this eighty-one times. Then, turn to the south and bow three times, saying:",
      "overlap_context": "the Most High Lord of the Dao, saying: Listen well to my words, reflect deeply, and inscribe them in your heart. Day and night, hold them in mind, and never forget. I shall now explain the wondrous sound for you to follow, so that you may redeem sinful souls, open the way out of the long night, the Nine Dark Realms, and the Eight Difficulties. Their old adversities shall be dispersed, and they shall turn to the roots of faith, rejoicing in life and death, their karmic bonds spanning generations.",
      "start_char": 6471,
      "end_char": 7278,
      "start_sentence": 194,
      "end_sentence": 210,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.91783118247986,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝长夜之府九幽玉匮明真科.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "某甲今皈命南方无极太上灵宝天尊、已得道大圣众、至真诸君丈人、三炁天君、南乡诸灵官。 今故立斋，烧香然灯，愿以是功德，照曜诸天，普为帝王国主，君官吏民，受道法师，父母尊亲，同学门人，隐居山林学真道士、诸贤者，蠢飞蠕动，跂行蜎息，一切众生，普得免度十苦八难，长居无为，普得自然。 某家亿曾万祖，囚徒先魂，开诸光明，咸得解脱，转入信根，去离五道，开度因缘，死者长乐，生世蒙恩，天下太平，道德兴隆。 今故烧香，自皈依师尊大圣众至真之德，得道之后，升入无形，与道合真#57。 毕，叩头抟颊，各二十七过止。 次西向七拜，言： 某甲今皈命西方无极太上灵宝天尊、已得道大圣众、至真诸君丈人、七炁天君、西乡神仙诸灵官。 今故立斋，烧香然灯，愿以是功德，照曜诸天，普为帝王国主，君官吏民，受道法师，父母尊亲，同学门人，隐居山林学真道士、诸贤者，蠢飞蠕动，跂行蜎息，一切众生，普得免度十苦八难，长居无为，普度自然。 某家亿曾万祖，囚徒先魂，开诸光明，咸得解脱，转入信根，去离五道，开度因缘，死者长乐，生世蒙恩，天下太平，道德兴隆。 今故烧香，自皈依师尊大圣众至真之德，得道之后，升入无形，与道合真。 毕，叩头自抟，各六十三过止。 次北向五拜言： 某甲今皈命北方无极太上灵宝天尊、已得道大圣众、至真诸君丈人、五炁天君、北乡诸灵官。 今故立斋，烧香然灯，愿以是功德、照曜诸天，普为帝王国主，君官吏民，受道法师，父母尊亲，同学门人，隐居山林学真道士、诸贤者，蠢飞蠕动，跂行蜎息，一切众生，普得免度十苦八难，长居无为，普度自然。 某家亿曾万祖，囚徒先魂，开诸光明，咸得解脱，转入信根，去离五道，开度因绿，死者长乐，生世蒙恩，天下太平，道德兴隆。 今故烧香，自皈依师尊大圣众至真之德，得道之后，升入无形，与道合真。 毕，叩头抟颊，各四十五过止。 次东北向一拜，言： 某甲今皈命东北方无极太上灵宝天尊、已得道大圣众、至真诸君丈人、梵炁天君、东北乡诸灵官。 今故立斋，烧香然灯，愿以是功德，照曜诸天，为帝王国主，君官吏民，受道法师，父母尊亲，同学门人，隐居山林学真道士、诸贤者，蠢飞蠕动，跂行蜎息，一切众生，普得免度十苦八难，长居无为，普度自然。 某家亿曾万祖，囚徒先魂，开诸光明，咸得解脱，转入信根，去离五道，开度因缘，死者长乐，生世蒙恩，天下太平，道德兴隆。 今故烧香，自皈依师尊大圣众至真之德，得道之后，升入无形，与道合真。 毕，叩头抟颊，各九过止。 次向东南一拜，言： 某甲今皈命东南方无极太上灵宝天尊、已得道大圣众、至真诸君丈人、梵炁天君、东南乡诸灵官。 今故立斋，烧香然灯，愿以是功德，照曜诸天，为帝王国主，君官吏民，受道法师，父母尊亲，同学门人，隐居山林学真道士、诸贤者，蠢飞蠕动，跂行蜎息，一切众生，普得免度十苦八难，长居无为，普度自然。 某家亿曾万祖，囚徒先魂，开诸光明，咸得解脱，转入信根，去离五道，开度因缘，死者长乐，生世蒙恩，天下太平，道德兴隆。 今故烧香，自皈依师尊大圣众至真之德，得道之后，升入无形，与道合真。",
      "translated_text": "I, [Name], now take refuge in the Southern Quadrant’s Boundless Supreme Numinous Treasure Heavenly Worthy, the Hosts of Great Sages who have attained the Dao, the Perfected Lords and Venerable Ones, the Three Qi Heavenly Lords, and the Divine Officials of the Southern Realm. Today, I establish this fast, burn incense, and light lamps, dedicating these merits to illumine all heavens. May they universally benefit emperors and kings, lords and officials, the people, masters who receive the Daoist teachings, parents and honored kin, fellow students and disciples, reclusive scholars in mountains and forests cultivating the true Dao, all worthy ones, the crawling and flying, the creeping and wriggling, all breathing beings—may all universally be delivered from the Ten Sufferings and Eight Difficulties, dwell eternally in non-action, and attain universal deliverance by nature. May the myriad generations of my ancestors, the imprisoned and wandering souls of my lineage, be bathed in light, liberated, and turned toward the roots of faith. May they depart the Five Paths, resolve karmic bonds, and find eternal joy in death, while the living receive grace. May the world know great peace, the Dao and virtue flourish. Thus, I burn incense and take refuge in the virtue of the Great Sage Hosts and Perfected Ones. After attaining the Dao, may I ascend into the formless and unite with the true Dao.\n\nWhen finished, kowtow and clasp the hands, repeating this twenty-seven times. Then, turn to the west and bow seven times, saying:\n\nI, [Name], now take refuge in the Western Quadrant’s Boundless Supreme Numinous Treasure Heavenly Worthy, the Hosts of Great Sages who have attained the Dao, the Perfected Lords and Venerable Ones, the Seven Qi Heavenly Lords, and the Divine Immortals and Officials of the Western Realm. Today, I establish this fast, burn incense, and light lamps, dedicating these merits to illumine all heavens. May they universally benefit emperors and kings, lords and officials, the people, masters who receive the Daoist teachings, parents and honored kin, fellow students and disciples, reclusive scholars in mountains and forests cultivating the true Dao, all worthy ones, the crawling and flying, the creeping and wriggling, all breathing beings—may all universally be delivered from the Ten Sufferings and Eight Difficulties, dwell eternally in non-action, and attain universal deliverance by nature. May the myriad generations of my ancestors, the imprisoned and wandering souls of my lineage, be bathed in light, liberated, and turned toward the roots of faith. May they depart the Five Paths, resolve karmic bonds, and find eternal joy in death, while the living receive grace. May the world know great peace, the Dao and virtue flourish. Thus, I burn incense and take refuge in the virtue of the Great Sage Hosts and Perfected Ones. After attaining the Dao, may I ascend into the formless and unite with the true Dao.\n\nWhen finished, kowtow and clasp the hands, repeating this sixty-three times. Then, turn to the north and bow five times, saying:\n\nI, [Name], now take refuge in the Northern Quadrant’s Boundless Supreme Numinous Treasure Heavenly Worthy, the Hosts of Great Sages who have attained the Dao, the Perfected Lords and Venerable Ones, the Five Qi Heavenly Lords, and the Divine Officials of the Northern Realm. Today, I establish this fast, burn incense, and light lamps, dedicating these merits to illumine all heavens. May they universally benefit emperors and kings, lords and officials, the people, masters who receive the Daoist teachings, parents and honored kin, fellow students and disciples, reclusive scholars in mountains and forests cultivating the true Dao, all worthy ones, the crawling and flying, the creeping and wriggling, all breathing beings—may all universally be delivered from the Ten Sufferings and Eight Difficulties, dwell eternally in non-action, and attain universal deliverance by nature. May the myriad generations of my ancestors, the imprisoned and wandering souls of my lineage, be bathed in light, liberated, and turned toward the roots of faith. May they depart the Five Paths, resolve karmic bonds, and find eternal joy in death, while the living receive grace. May the world know great peace, the Dao and virtue flourish. Thus, I burn incense and take refuge in the virtue of the Great Sage Hosts and Perfected Ones. After attaining the Dao, may I ascend into the formless and unite with the true Dao.\n\nWhen finished, kowtow and clasp the hands, repeating this forty-five times. Then, turn to the northeast and bow once, saying:\n\nI, [Name], now take refuge in the Northeastern Quadrant’s Boundless Supreme Numinous Treasure Heavenly Worthy, the Hosts of Great Sages who have attained the Dao, the Perfected Lords and Venerable Ones, the Brahman Qi Heavenly Lords, and the Divine Officials of the Northeastern Realm. Today, I establish this fast, burn incense, and light lamps, dedicating these merits to illumine all heavens. May they benefit emperors and kings, lords and officials, the people, masters who receive the Daoist teachings, parents and honored kin, fellow students and disciples, reclusive scholars in mountains and forests cultivating the true Dao, all worthy ones, the crawling and flying, the creeping and wriggling, all breathing beings—may all universally be delivered from the Ten Sufferings and Eight Difficulties, dwell eternally in non-action, and attain universal deliverance by nature. May the myriad generations of my ancestors, the imprisoned and wandering souls of my lineage, be bathed in light, liberated, and turned toward the roots of faith. May they depart the Five Paths, resolve karmic bonds, and find eternal joy in death, while the living receive grace. May the world know great peace, the Dao and virtue flourish. Thus, I burn incense and take refuge in the virtue of the Great Sage Hosts and Perfected Ones. After attaining the Dao, may I ascend into the formless and unite with the true Dao.\n\nWhen finished, kowtow and clasp the hands, repeating this nine times. Then, turn to the southeast and bow once, saying:\n\nI, [Name], now take refuge in the Southeastern Quadrant’s Boundless Supreme Numinous Treasure Heavenly Worthy, the Hosts of Great Sages who have attained the Dao, the Perfected Lords and Venerable Ones, the Brahman Qi Heavenly Lords, and the Divine Officials of the Southeastern Realm. Today, I establish this fast, burn incense, and light lamps, dedicating these merits to illumine all heavens. May they benefit emperors and kings, lords and officials, the people, masters who receive the Daoist teachings, parents and honored kin, fellow students and disciples, reclusive scholars in mountains and forests cultivating the true Dao, all worthy ones, the crawling and flying, the creeping and wriggling, all breathing beings—may all universally be delivered from the Ten Sufferings and Eight Difficulties, dwell eternally in non-action, and attain universal deliverance by nature. May the myriad generations of my ancestors, the imprisoned and wandering souls of my lineage, be bathed in light, liberated, and turned toward the roots of faith. May they depart the Five Paths, resolve karmic bonds, and find eternal joy in death, while the living receive grace. May the world know great peace, the Dao and virtue flourish. Thus, I burn incense and take refuge in the virtue of the Great Sage Hosts and Perfected Ones. After attaining the Dao, may I ascend into the formless and unite with the true Dao.",
      "overlap_context": "art the Five Paths, resolve karmic bonds, and find eternal joy in death, while the living receive grace. May the world know great peace, the Dao and virtue flourish. Thus, I burn incense and take refuge in the virtue of the Great Sage Hosts and Perfected Ones. After attaining the Dao, may I ascend into the formless and unite with the true Dao.\"*\n\nWhen finished, remove the headscarf, kowtow, and clasp the hands, repeating this eighty-one times. Then, turn to the south and bow three times, saying:",
      "start_char": 7278,
      "end_char": 8540,
      "start_sentence": 211,
      "end_sentence": 238,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.283000230789185,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝长夜之府九幽玉匮明真科.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "毕，叩头抟颊，各九过止。 次西南向一拜言： 某甲今皈命西南方无极太上灵宝天尊、已得道大圣众、至真诸君丈人、梵炁天君、西南乡诸灵官。 今故立斋，烧香然灯，愿以是功德，照曜诸天，普为帝王国主，君官吏民，受道法师，父母尊亲，同学门人，隐居山林学真道士、诸贤者，蠢飞蠕动，跂行蜎息，一切众生，普得免度十苦八难，长居无为，普度自然。 某家亿曾万祖，囚徒先魂，开诸光明，咸得解脱，转入信根，去离五道，开度因绿，死者长乐，生世蒙恩，天下太平，道德兴隆。 今故烧香，自皈依师尊大圣众至真之德，得道之后，升入无形，与道合真。 毕，叩头抟颊，各九过止。 次向西北一拜，言： 某甲今皈命西北方无极太上灵宝天尊、已得道大圣众、至真诸君丈人、梵炁天君、西北乡诸灵官。 今故立斋，烧香然灯，愿以是功德，照曜诸天，普为帝王国主，君官吏民，受道法师，父母尊亲，同学门人，隐居山林学真道士、诸贤者，蠢飞蠕动，跂行蜎息，一切众生，普得免度七苦八难，长居无为，普度自然。 某家亿曾万祖，囚徒先魂，开诸光明，咸得解脱，转入信根，去离五道，开度因缘，死者长乐，生世蒙恩，天下太平，道德兴隆。 今故烧香，自皈依师尊大圣众至真之德，得道之后，升入无形，与道合真。 毕，叩头抟颊各九过止#58。 次向上方#59三十二拜言： 某甲今皈命上方无极太上灵宝天尊、已得道大圣众、至真诸君丈人、三十二天帝君、玉京玄都紫微上宫诸真人玉女、神仙灵官。 今故立斋，烧香然灯，愿以是功德，照曜诸天，普为帝王国主，君官吏民，受道法师，父母尊亲，同学门人，隐居山林学真道士、诸贤者，蠢飞蠕动，跂行蜎息，一切众生，普得免度十苦八难，长居无为，普度自然。 某家亿曾万祖，囚徒先魂，开诸光明，咸得解脱，转入信根，去离五道，开度因缘，死者长乐，生世蒙恩，天下太平，道德兴隆。 今故烧香，自皈依师尊大圣众至真之德，得道之后，升入无形，与道合真。 毕，叩头自抟，各二百八十八过止。 次向下方#60一十二拜，言： 某甲今皈命下方无极太上灵宝天尊、已得道大圣众、至真诸君丈人、九垒土皇#61、四司五帝、十二仙官、五岳四渎、九宫真人、神仙玉女、无极世界地祇诸灵官。 今故立斋，烧香然灯，愿以是功德，照曜无极世界长夜之府九幽之中，普为帝王国主，君官吏民，受道法师，父母尊亲，同学门人，隐居山林学真道士、诸贤者，及臣家亿曾万祖，长夜死魂，先身所犯天禁地戒，罪恶缠结，死受宿对，往返涂炭，因缘不绝，流曳五苦，长徒无脱，乞今烧香，然灯忏谢，以自拔赎，光明普照长夜之府九幽地狱，解出幽魂，罪根散释，三官九署，不见拘闭，开度升迁，得入福堂，去离恶道，恒居善门，生世欢乐，普天安宁。 今故烧香，自皈依师尊大圣众至真之德，得道之后，升入无形，与道合真。 毕，叩头自抟，各一百二十过，止。 飞天神人曰：明真科品，凡拔度亿曾万祖宿罪恶根，行道如法，则九幽开通，长徒死魂，身受光明，大慈之道，无量福田。 夫屈折礼拜，叩头自抟，以施逊谢之辞，而心丹意尽，精诚苦到，自然感彻，身体疲弊，不任牵曳，自可心拜於天真，无烦於屈折。",
      "translated_text": "Having completed this, they kowtowed and pressed their cheeks to the ground, each nine times. Then, facing the southwest, they bowed once and said:\n\nI, [Name], now take refuge in the Boundless Supreme Numinous Treasure Heavenly Worthy of the Southwest, the Great Sage Hosts who have attained the Dao, the Perfected Lords and Venerable Ones, the Heavenly Lords of Brahma Qi, and the divine officials of the Southwest. Today, I establish this fast, burn incense, and light lamps. May the merit of this act illuminate the heavens, universally benefiting emperors and kings, lords and officials, the people, Daoist masters who transmit the teachings, parents and honored kin, fellow disciples, reclusive scholars of the true Dao in mountains and forests, all worthy ones, the crawling and flying, the creeping and wriggling, all breathing beings—may all universally be delivered from the Ten Sufferings and Eight Difficulties, dwell eternally in non-action, and attain universal deliverance by nature. May the myriad generations of my ancestors, the imprisoned and wandering souls of my lineage, be bathed in light, liberated, and turned toward the roots of faith. May they depart the Five Paths, resolve karmic bonds, and find eternal joy in death, while the living receive grace. May the world know great peace, the Dao and virtue flourish. Thus, I burn incense and take refuge in the virtue of the Great Sage Hosts and Perfected Ones. After attaining the Dao, may I ascend into the formless and unite with the true Dao.\n\nHaving completed this, they kowtowed and pressed their cheeks to the ground, each nine times. Then, facing the northwest, they bowed once and said:\n\nI, [Name], now take refuge in the Boundless Supreme Numinous Treasure Heavenly Worthy of the Northwest, the Great Sage Hosts who have attained the Dao, the Perfected Lords and Venerable Ones, the Heavenly Lords of Brahma Qi, and the divine officials of the Northwest. Today, I establish this fast, burn incense, and light lamps. May the merit of this act illuminate the heavens, universally benefiting emperors and kings, lords and officials, the people, Daoist masters who transmit the teachings, parents and honored kin, fellow disciples, reclusive scholars of the true Dao in mountains and forests, all worthy ones, the crawling and flying, the creeping and wriggling, all breathing beings—may all universally be delivered from the Seven Sufferings and Eight Difficulties, dwell eternally in non-action, and attain universal deliverance by nature. May the myriad generations of my ancestors, the imprisoned and wandering souls of my lineage, be bathed in light, liberated, and turned toward the roots of faith. May they depart the Five Paths, resolve karmic bonds, and find eternal joy in death, while the living receive grace. May the world know great peace, the Dao and virtue flourish. Thus, I burn incense and take refuge in the virtue of the Great Sage Hosts and Perfected Ones. After attaining the Dao, may I ascend into the formless and unite with the true Dao.\n\nHaving completed this, they kowtowed and pressed their cheeks to the ground, each nine times. Then, facing upward, they bowed thirty-two times and said:\n\nI, [Name], now take refuge in the Boundless Supreme Numinous Treasure Heavenly Worthy of the Upper Realm, the Great Sage Hosts who have attained the Dao, the Perfected Lords and Venerable Ones, the Thirty-Two Heavenly Emperors, the Perfected Ones and Jade Maidens of the Jade Capital, Mystic Metropolis, and Purple Tenuity Upper Palace, and the divine officials and immortals. Today, I establish this fast, burn incense, and light lamps. May the merit of this act illuminate the heavens, universally benefiting emperors and kings, lords and officials, the people, Daoist masters who transmit the teachings, parents and honored kin, fellow disciples, reclusive scholars of the true Dao in mountains and forests, all worthy ones, the crawling and flying, the creeping and wriggling, all breathing beings—may all universally be delivered from the Ten Sufferings and Eight Difficulties, dwell eternally in non-action, and attain universal deliverance by nature. May the myriad generations of my ancestors, the imprisoned and wandering souls of my lineage, be bathed in light, liberated, and turned toward the roots of faith. May they depart the Five Paths, resolve karmic bonds, and find eternal joy in death, while the living receive grace. May the world know great peace, the Dao and virtue flourish. Thus, I burn incense and take refuge in the virtue of the Great Sage Hosts and Perfected Ones. After attaining the Dao, may I ascend into the formless and unite with the true Dao.\n\nHaving completed this, they kowtowed and pressed their cheeks to the ground, each two hundred and eighty-eight times. Then, facing downward, they bowed twelve times and said:\n\nI, [Name], now take refuge in the Boundless Supreme Numinous Treasure Heavenly Worthy of the Lower Realm, the Great Sage Hosts who have attained the Dao, the Perfected Lords and Venerable Ones, the Ninefold Earthly Sovereigns, the Four Controllers and Five Emperors, the Twelve Immortal Officials, the Five Peaks and Four Waterways, the Perfected Ones of the Nine Palaces, the immortals and Jade Maidens, and the divine officials of the Boundless World’s earthly deities. Today, I establish this fast, burn incense, and light lamps. May the merit of this act illuminate the Boundless World’s eternal night abode and the Nine Dark Realms. Universally, may it benefit emperors and kings, lords and officials, the people, Daoist masters who transmit the teachings, parents and honored kin, fellow disciples, reclusive scholars of the true Dao in mountains and forests, all worthy ones, and the myriad generations of my ancestors—those long-dead souls confined in darkness, whose past transgressions of heavenly prohibitions and earthly precepts have bound them in sin, subjecting them to karmic retribution, endless cycles of suffering, and the Five Torments without escape. By this offering of incense and lamps, I repent and seek redemption, that light may universally shine upon the eternal night abode and the Nine Dark Hells. May the imprisoned souls be freed, their karmic roots dissolved, and the Three Offices and Nine Bureaus release them from confinement. May they be delivered and ascend, entering halls of blessing, departing the evil paths, and dwelling eternally in the gates of goodness. May the living rejoice, and all under heaven know peace. Thus, I burn incense and take refuge in the virtue of the Great Sage Hosts and Perfected Ones. After attaining the Dao, may I ascend into the formless and unite with the true Dao.\n\nHaving completed this, they kowtowed and pressed their cheeks to the ground, each one hundred and twenty times, and ceased.\n\nThe Flying Heavenly Spirits declared: According to the statutes of the Luminous Perfected, to deliver the myriad generations of ancestors from their deep-rooted sins, one must perform the Daoist rites with proper observance. Then, the Nine Dark Realms will open, and the long-imprisoned dead souls will receive the light. Such is the path of great compassion, an immeasurable field of merit.\n\nTo bow humbly, kowtow, and press one’s cheeks to the ground is to offer words of reverence and repentance. When the cinnabar heart and sincere intent are fully expressed, and devotion is utterly profound, resonance will naturally occur. Though the body may be weary and unable to endure further prostration, one may still offer a heartfelt bow to the Heavenly Perfected, without need for further physical submission.",
      "overlap_context": "ations of my ancestors, the imprisoned and wandering souls of my lineage, be bathed in light, liberated, and turned toward the roots of faith. May they depart the Five Paths, resolve karmic bonds, and find eternal joy in death, while the living receive grace. May the world know great peace, the Dao and virtue flourish. Thus, I burn incense and take refuge in the virtue of the Great Sage Hosts and Perfected Ones. After attaining the Dao, may I ascend into the formless and unite with the true Dao.",
      "start_char": 8541,
      "end_char": 9812,
      "start_sentence": 239,
      "end_sentence": 264,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.546090602874756,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝长夜之府九幽玉匮明真科.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "苟外饰而心怠，亦劳形於礼拜尔。 信向之士，心口相应，捻香感愿，已彻诸天，生死罪对，靡不散释。 然此功德甚重，三界所称，福德巍巍，难可载焉。 太上道君稽首上白天尊：今闻飞天神人说罪福缘对拔度上品，陈请礼谢，解释宿根，来生男女当受其恩，普得开度，身入光明，为善如是，复有余方，不审天有重灾，国祚不安，星宿越错，四气失常，兵寇#62疾厄，帝王不宁，毒疠流布，天人死伤，当作何法，以禳其灾，拔度厄难，解诸不祥，愿垂教旨，可得修行，和天安地，佐国立功。 如见训敕，则恩布十方，国祚安镇，帝王兴隆，天下欢泰，福庆无穷，来世一切，普闻法音。 於是天尊告飞天神人而说#63罪福缘对拔度上品，救度国土灾疾、危厄灾难，未尽者便可尽为对太上道君一一说之，使未见者见，未闻者闻，普教一切，令众见光明，於是说之，善受诀言。 飞天神人曰：长夜之府九幽玉匮明真科法，帝王国土疾疹#64兵寇，危急厄难，当丹书灵宝真文五篇，於中庭五案，置五方，一案请一篇真文。 以上金五两，一两作一龙，五两分作五龙，以镇五篇文上。 又以五色纹缯之信，以镇五帝，有灾之身随年赍紫文之缯，拔度身命，安镇国祚，禳解天灾，明星列宿。 春则然九灯，亦可九十灯，亦可九百灯。 夏则然三灯，亦可三十灯，亦可三百灯。 秋则然七灯，亦可七十灯，亦可七百灯。 冬则然五灯，亦可五十灯，亦可五百灯。 四季之月则然灯十二，亦可百二十灯，亦可千二百灯。 又安一长灯，长九尺，上安九灯置中央，以照九幽长夜之府明达。 大法师於中央，披头散结，依诀涂炭，六时请谢，中庭行事。 若清信男女，佐国祈请，当於门外散发，涂炭陈情。 春则九日九夜，夏则三日三夜，秋则七日七夜，冬则五日五夜，四季则十二日十二夜。 罗列光明，照曜诸天无极世界长夜之中，则九幽开清，光入无穷，三景朗照，天地安宁，星宿复位，四时和平，万灾咸消，兵疾不行，天人欢泰，国祚兴隆。 行道日竟，当烧真文，散之青烟。 飞天神人曰：法师从地户入烧香#65，绕香灯三过，还东向立，叩齿三十六通，发炉#66。 次发炉#67 无上三天玄元始三炁太上道君，召出臣身中三五功曹、左右官使者、左右捧香驿龙骑吏、侍香金童、传言玉女#68、五帝直符，各三十六人出，出者严装，关启土地里域四面真官，臣今正尔烧香行道，愿使十方正真之炁入臣身中，所启速达，径御太上无极大道至尊玉皇上帝御前。 次各称法位#69 三洞大法师小兆臣某#70上启虚无自然元始天尊、无极大道太上道君、太上老君#71、高上玉皇、已得道大圣众、至真诸君丈人、三十二天帝、玉虚上帝、玉帝、大帝、东华南极西灵北真、玄都玉京金阙七宝玄台紫微上宫灵宝至真明皇道君。 臣宿命因缘，生值#72法门，玄真启拔，得入信根，先师盟授三宝神经，法应度人九万九千，位登至真#73。 臣#74祖世以来，逮及今身#75，生值经教，常居福中，功微德少，未能自仙，志竭皈命#76，佐国立功。 今国土失和，兵病并兴，阴阳否激，星宿错行，灾疾#77重厄，其事云云。 或虑帝王受天禅祚#78，总监兆民，未周#79施惠，广润十方，使天人丰沃，欣国太平，而行无歌咏，路致吞声#80，故三景昏错，大灾流行，帝王忧惕，兆民无宁。",
      "translated_text": "If one merely adorns the exterior while the heart grows negligent, such prostrations weary the body in vain. Yet for those of sincere devotion, whose hearts and words align, the offering of incense and the voicing of vows already penetrate the myriad heavens—birth and death, sins and retributions, all dissolve without exception.\n\nThis merit is most weighty, praised throughout the Three Realms; its blessings towering and vast, beyond all measure. The Most High Dao Lord bowed deeply and addressed the Heavenly Worthy: \"Now having heard the Flying Heavenly Spirits expound upon the karmic bonds of sin and blessing, the supreme methods of deliverance, the rites of supplication and gratitude, and the dissolution of deep-rooted transgressions—so that in future lives, men and women may receive this grace, attain universal deliverance, and enter the light—if such goodness is practiced, yet further methods remain, I ask: when heaven sends grave disasters, the nation’s destiny falters, the stars and constellations stray from their courses, the four seasons lose their order, warfare and pestilence arise, the emperor finds no peace, plagues spread, and heaven and humanity suffer harm—what methods should be employed to dispel these calamities, deliver from peril, and resolve all inauspicious omens? I humbly beseech your teaching, that we may practice and thereby harmonize heaven and earth, assist the nation, and establish merit.\"\n\n\"If your instructions are received and followed, then blessings will spread throughout the ten directions, the nation’s destiny will be secure, the emperor will flourish, the realm will rejoice in peace, and boundless fortune will endure, so that in future lives, all beings may hear the sound of the Dharma.\"\n\nThereupon, the Heavenly Worthy instructed the Flying Heavenly Spirits to expound fully upon the supreme methods of deliverance from karmic bonds of sin and blessing, and the salvation of the land from plagues, perils, and disasters—whatever had not yet been fully explained—so that the Most High Dao Lord might hear it all in detail. Thus, those who had not seen would see, those who had not heard would hear, and all beings would be universally taught, enabling them to behold the light. Having spoken thus, the Heavenly Worthy commanded that the essential instructions be reverently received.\n\nThe Flying Heavenly Spirits declared: \"For the Nine Dark Realms of the Long Night’s Repository, the *Mingzhen Statutes* of the Jade Treasury prescribe this: when the emperor’s land suffers from pestilence, warfare, or dire peril, one must inscribe the five sacred texts of the *Lingbao True Writ* in cinnabar. In the central courtyard, arrange five altars corresponding to the five directions, placing one text upon each. Offer five taels of gold, fashioning one tael into a dragon for each, so that five dragons may guard the five texts. Further, present five-colored silken pledges to honor the Five Emperors. Those afflicted by calamity, according to their age, shall offer purple-silk writs to deliver their lives, secure the nation’s destiny, and dispel heavenly disasters, aligning the stars and constellations.\n\nIn spring, kindle nine lamps—or ninety, or nine hundred. In summer, kindle three lamps—or thirty, or three hundred. In autumn, kindle seven lamps—or seventy, or seven hundred. In winter, kindle five lamps—or fifty, or five hundred. During the intercalary months, kindle twelve lamps—or one hundred twenty, or one thousand two hundred. Additionally, set a tall lamp, nine feet in height, with nine lamps upon it, placed at the center to illuminate the Nine Dark Realms of the Long Night’s Repository.\n\nThe Great Dharma Master, standing at the center, shall loosen the hair and untie the topknot, anoint the body with mud and ashes, and perform the six-hour rites of supplication and gratitude while conducting the ritual in the central courtyard. If devout men and women wish to assist the nation in prayer, they shall scatter their hair and anoint themselves with mud and ashes at the gate, presenting their pleas.\n\nIn spring, the rites last nine days and nights; in summer, three days and nights; in autumn, seven days and nights; in winter, five days and nights; and during the intercalary months, twelve days and nights. Arraying the radiant lamps, their light will shine upon the boundless worlds within the Long Night, opening the Nine Dark Realms to clarity. The light will penetrate without end, the Three Luminaries will shine brightly, heaven and earth will be at peace, the stars and constellations will return to their places, the four seasons will harmonize, all calamities will vanish, warfare and pestilence will cease, heaven and humanity will rejoice, and the nation’s destiny will flourish.\n\nWhen the day’s rites conclude, burn the true writs, dispersing them in the blue smoke.\"\n\nThe Flying Heavenly Spirits continued: \"The Dharma Master shall enter through the Earth Gate, burn incense, and circumambulate the incense and lamps three times before standing facing east. Strike the teeth thirty-six times and invoke the furnace. Then invoke the furnace of the Supreme Three Heavens, the Primordial Qi of the Most High Dao Lord, summoning forth from within the master’s body the Three and Five Merit Officers, the Left and Right Attendants, the Left and Right Incense-Bearing Dragon Couriers, the Golden Lads of Incense, the Jade Maidens of Transmission, and the Five Emperors’ Direct Messengers—thirty-six of each—who shall emerge in solemn array. Notify the true officials of the four directions and the local deities: 'I now burn incense and perform the Dao rites. May the qi of the ten directions’ true perfected ones enter my body, so that my prayers swiftly ascend to the presence of the Most High, the Boundless Dao, the Supreme Worthy, the Jade Emperor.'\n\nThereafter, each shall declare their dharma rank: 'The humble disciple, the minor adept [Name], Great Dharma Master of the Three Caverns, respectfully addresses the Primordial Heavenly Worthy of the Void and the Natural, the Most High Dao Lord of the Boundless Dao, the Most High Lord Lao, the August Jade Emperor, the great sages who have attained the Dao, the perfected lords and venerable masters, the thirty-two Heavenly Emperors, the Jade Void Emperor, the Jade Emperor, the Great Emperor, the Eastern Flowery Peak, the Southern Culmen, the Western Numinous, the Northern Perfected, the Golden Towers and Jade Capitals of the Mystic Metropolis, the Seven Treasures and Mystic Terrace of the Purple Tenuity’s Upper Palace, and the Numinous Treasure Perfected Sovereign of the Radiant August Dao.\n\nBy the karmic conditions of my past lives, I was born into this Dharma gate. Through the mysterious and true deliverance, I entered the root of faith. My former master transmitted to me the sacred scriptures of the Three Treasures, and by the Dharma, I am to deliver ninety-nine thousand beings, ascending to the rank of the perfected. From my ancestors through the generations to my present life, I have encountered the scriptural teachings and dwelt always within blessings. Yet my merit is slight, my virtue meager, and I have not attained immortality. With exhausted devotion, I take refuge and vow to assist the nation and establish merit.\n\nNow the land is in disharmony, warfare and pestilence arise together, yin and yang clash violently, the stars and constellations stray from their paths, and grave calamities press heavily. The circumstances are as described. Perhaps the emperor, having received the heavenly mandate to oversee the myriad people, has not yet fully extended his benevolence to nourish the ten directions, leaving heaven and humanity unprosperous and the nation unsettled. Without songs of praise, the roads echo with stifled sobs. Thus, the Three Luminaries grow dim and disordered, great disasters spread, the emperor is anxious, and the people find no peace.'\"",
      "overlap_context": "e the light. Such is the path of great compassion, an immeasurable field of merit.\n\nTo bow humbly, kowtow, and press one’s cheeks to the ground is to offer words of reverence and repentance. When the cinnabar heart and sincere intent are fully expressed, and devotion is utterly profound, resonance will naturally occur. Though the body may be weary and unable to endure further prostration, one may still offer a heartfelt bow to the Heavenly Perfected, without need for further physical submission.",
      "start_char": 9812,
      "end_char": 11110,
      "start_sentence": 265,
      "end_sentence": 293,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.8311665058136,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝长夜之府九幽玉匮明真科.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "今谨依大法，披露真文，烧香然灯，昭曜诸天，信誓自效，行道谢殃，愿上请天仙兵马九亿万骑，地仙兵马九亿万骑，真人兵马九亿万骑，飞仙兵马九亿万骑，神人兵马九亿万骑，日月兵马九亿万骑，星宿兵马九亿万骑，九宫兵马九亿万骑，五帝兵马九亿万骑，五岳兵马九亿万骑，三河四海兵马九亿万骑，三十二天监斋直事、侍香金童、散花玉女#81、五帝直符各三十二人，传言奏事飞龙骑吏等，一合来下，监临斋堂，捻香愿念，应口上彻，须行道事竟，有功勤者，言功仙官#82。 次三捻上香 三洞大法师小兆臣某，今故立直，初捻上香#83愿以是功德，为帝王国主，君臣吏民、普天七世父母，去离忧苦，上升天堂，今故烧香，皈身皈神皈命大道，臣首体投地，皈命太上三尊。 愿以是功德，归流普天七世父母，乞免离十苦八难，上升天堂，衣食自然，长居无为，今故烧香，自皈依师尊大圣众至真之德，得道之后，升入无形，与道合真。 臣今故立直，二捻上香#84，愿以是功德为帝王国主，君官吏民，受道法师，父母尊亲，同学门人，隐居山林学真道士、诸贤者，愿各得其道，皈身皈神皈命大道。 臣首体投地，皈命太上三师，愿以是功德，归流帝王国主、君官吏民、受道法师、父母尊亲、同学门人，隐居山林学真道士、诸贤者，愿各得其道，安居无为，长享福祚。 今故烧香，自皈依师尊大圣众至尊之德，得道之后，升入无形，与道合真。 臣今故立直，三捻上香，愿以是功德、令臣速得仙道，及九亲姻族#85，国中同法学士，天下人民，及蝖飞蠢动，跂行蜎息，一切众生，已生未生，并乞成就，皈身皈神皈命大道。 臣首体投地，皈命太上三尊。 愿以是功德，归流臣身，令得仙度，终入无为，与四大合德。 天下人民，一切众生，并得免离十苦八难，五毒水火，贼疫鬼害，灾厄之中，国土安宁，天下兴隆。 今故烧香，自皈依师尊大圣众至真之德，得道之后，升入无形，与道合真。 次东向九拜，言曰#86： 天地否激，阴阳相刑，四时失和，灾害流生。 星宿错综，以告不祥，国土扰乱，兵病并行，帝王忧伤，兆民无宁。 谨依大法，披露真文，皈命东方无极太上灵宝#87天尊、已得道大圣众、至真诸君丈人、九炁天君、东乡诸灵官。 今故立斋，披心露形，引咎#88自克，为国谢殃，烧香然灯，照曜诸天，下映无极长夜之中九幽之府，开诸光明，愿以是功德，为帝王国主，君官吏民，解灾却患，三景复位，五行顺常，兵止病愈，国祚兴隆，兆民欢泰，人神安宁。 今故烧香，皈身皈神皈命师尊大圣众至真之德，得道之后，升入无形，与道合真。 毕，便解巾#89叩头自抟，八十一过止。 次南向三拜，言曰#90： 天地否激，阴阳相刑。 四时失和，灾害流生。 星宿错综，以告不祥，国土扰乱，兵病并行，帝王忧伤，兆民无宁。 谨依大法，披露真文，皈命南方无极太上灵宝天尊、已得道大圣众、至真诸君丈人、三炁天君、南乡诸灵官。 今故立斋，披心露形，引咎自克，为国谢殃，烧香然灯，照曜诸天，下映无极长夜之中九幽之府，开诸光明，愿以是功德，为帝主国王，君官吏民，解灾却患，三景复位，五行顺常，兵止病愈，国祚兴隆，兆民欢泰，人神安宁。",
      "translated_text": "Now, in strict accordance with the Great Rites, I reverently disclose the true scriptures, burn incense, and kindle lamps to illuminate the myriad heavens. With sincere vows, I offer myself in service, performing the Dao to atone for calamities. I humbly beseech the celestial immortals’ nine hundred million cavalry, the terrestrial immortals’ nine hundred million cavalry, the perfected beings’ nine hundred million cavalry, the flying immortals’ nine hundred million cavalry, the divine beings’ nine hundred million cavalry, the sun and moon’s nine hundred million cavalry, the stellar constellations’ nine hundred million cavalry, the Nine Palaces’ nine hundred million cavalry, the Five Emperors’ nine hundred million cavalry, the Five Marchmounts’ nine hundred million cavalry, and the Three Rivers and Four Seas’ nine hundred million cavalry. I also invoke the thirty-two heavens’ overseers of the fast, attendants of incense, golden lads, jade maidens scattering flowers, and the thirty-two direct messengers of the Five Emperors, along with the flying dragon couriers who transmit words and memorials. May they all descend together to oversee the ritual hall, witness the offering of incense and the recitation of vows, and ensure that every word ascends directly. When the Dao-performing rites are complete, those who have rendered meritorious service shall be reported to the immortal officials.\n\nNext, three offerings of incense:\nThe humble disciple, a minor adept of the Three Caverns and Great Master of the Dao, now stands in attendance. With the first offering of incense, I vow that through this merit, the emperor and rulers of the nation, their ministers and officials, and all people under heaven, along with the seven generations of their parents, may depart from sorrow and suffering and ascend to the celestial halls. Thus, I burn incense, taking refuge in body, spirit, and life in the Great Dao. I prostrate myself, bowing my head to the ground, and take refuge in the Most High Three Worthies. May this merit flow to the seven generations of parents under heaven, beseeching deliverance from the ten sufferings and eight difficulties, that they may ascend to the celestial halls, where clothing and sustenance arise naturally, and they may dwell eternally in non-action. Thus, I burn incense, taking refuge in the virtue of my master, the great sagely host of perfected beings. After attaining the Dao, may I ascend into formlessness and unite with the true Dao.\n\nNow, standing in attendance, with the second offering of incense, I vow that through this merit, the emperor and rulers of the nation, their ministers, officials, and people, the masters who transmit the Dao, parents and honored kin, fellow disciples, and all those who dwell in mountains and forests to study the true Dao, along with all worthy ones, may each attain their Way. I take refuge in body, spirit, and life in the Great Dao. I prostrate myself, bowing my head to the ground, and take refuge in the Three Masters Most High. May this merit flow to the emperor and rulers of the nation, their ministers, officials, and people, the masters who transmit the Dao, parents and honored kin, fellow disciples, and all those who dwell in mountains and forests to study the true Dao, along with all worthy ones. May each attain their Way, dwell in peace and non-action, and enjoy eternal blessings. Thus, I burn incense, taking refuge in the virtue of my master, the great sagely host of most venerable perfected beings. After attaining the Dao, may I ascend into formlessness and unite with the true Dao.\n\nNow, standing in attendance, with the third offering of incense, I vow that through this merit, I may swiftly attain the immortal Dao, along with my ninefold kin, fellow disciples within the nation, all people under heaven, and all creatures—whether crawling, flying, wriggling, or breathing—both those already born and those yet to be born. May all be perfected. I take refuge in body, spirit, and life in the Great Dao. I prostrate myself, bowing my head to the ground, and take refuge in the Most High Three Worthies. May this merit flow to my own person, that I may attain transcendence and ultimately enter non-action, uniting in virtue with the Four Great Elements. May all people under heaven and all sentient beings be delivered from the ten sufferings and eight difficulties, the five poisons, water and fire, bandits, epidemics, ghostly harms, and all calamities. May the nation be at peace and the world prosper. Thus, I burn incense, taking refuge in the virtue of my master, the great sagely host of perfected beings. After attaining the Dao, may I ascend into formlessness and unite with the true Dao.\n\nNext, facing east, nine bows are performed, and the following is recited:\nHeaven and earth are in disharmony, yin and yang clash violently. The four seasons lose their harmony, and disasters and harms spread. The stellar constellations are disordered, foretelling inauspicious omens. The nation is in turmoil, warfare and pestilence arise together. The emperor is grieved, and the people find no peace. In strict accordance with the Great Rites, I disclose the true scriptures and take refuge in the Most High Numinous Treasure Heavenly Worthy of the Boundless East, the host of great sages who have attained the Dao, the perfected lords and venerable ones, the Nine Qi Heavenly Lords, and the various spirit officials of the eastern realm. Now, I establish this fast, baring my heart and revealing my form, acknowledging my faults and restraining myself to atone for the nation’s calamities. I burn incense and kindle lamps to illuminate the myriad heavens, casting light into the boundless darkness of the Nine Nether Realms, opening all radiance. Through this merit, may the emperor and rulers of the nation, their ministers and officials, and all people be freed from disasters and misfortunes. May the Three Luminaries return to their positions, the Five Phases follow their proper course, warfare cease, illnesses be cured, the nation’s fortune flourish, the people rejoice in peace, and gods and humans dwell in tranquility. Thus, I burn incense, taking refuge in body, spirit, and life in the virtue of my master, the great sagely host of perfected beings. After attaining the Dao, may I ascend into formlessness and unite with the true Dao.\n\nUpon completion, the headscarf is removed, and the forehead is pressed to the ground in full prostration, repeated eighty-one times.\n\nNext, facing south, three bows are performed, and the following is recited:\nHeaven and earth are in disharmony, yin and yang clash violently. The four seasons lose their harmony, and disasters and harms spread. The stellar constellations are disordered, foretelling inauspicious omens. The nation is in turmoil, warfare and pestilence arise together. The emperor is grieved, and the people find no peace. In strict accordance with the Great Rites, I disclose the true scriptures and take refuge in the Most High Numinous Treasure Heavenly Worthy of the Boundless South, the host of great sages who have attained the Dao, the perfected lords and venerable ones, the Three Qi Heavenly Lords, and the various spirit officials of the southern realm. Now, I establish this fast, baring my heart and revealing my form, acknowledging my faults and restraining myself to atone for the nation’s calamities. I burn incense and kindle lamps to illuminate the myriad heavens, casting light into the boundless darkness of the Nine Nether Realms, opening all radiance. Through this merit, may the emperor and rulers of the nation, their ministers and officials, and all people be freed from disasters and misfortunes. May the Three Luminaries return to their positions, the Five Phases follow their proper course, warfare cease, illnesses be cured, the nation’s fortune flourish, the people rejoice in peace, and gods and humans dwell in tranquility.",
      "overlap_context": "r paths, and grave calamities press heavily. The circumstances are as described. Perhaps the emperor, having received the heavenly mandate to oversee the myriad people, has not yet fully extended his benevolence to nourish the ten directions, leaving heaven and humanity unprosperous and the nation unsettled. Without songs of praise, the roads echo with stifled sobs. Thus, the Three Luminaries grow dim and disordered, great disasters spread, the emperor is anxious, and the people find no peace.'\"",
      "start_char": 11110,
      "end_char": 12368,
      "start_sentence": 294,
      "end_sentence": 318,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.95605540275574,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝长夜之府九幽玉匮明真科.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "今故烧香，皈身皈神皈命师尊大圣众至真之德，得道之后，升入无形，与道合真。 愿毕#91叩头自抟，各二十七过止。 次西向七拜，言曰： 天地否激，阴阳相刑，四时失和，灾害流生，星宿错综，以告不祥，国土扰乱，兵病并行，帝王忧伤，兆民无宁。 谨依大法，披露真文，皈命西方无极太上灵宝天尊、已得道大圣众、至真诸君丈人、七炁天君、西乡诸灵官。 今故立斋，披心露形，引咎自克，为国谢殃，烧香燃灯，照曜诸天，下映无极长夜之中九幽之府，开诸光明，愿以是功德，为帝主国王，君官吏民，解灾却患，三景复位，五行顺常，兵止病愈，国祚兴隆，兆民欢泰，人神安宁。 今故烧香，皈身皈神皈命师尊大圣众至真之德，得道之后，升入无形，与道合真。 愿毕，叩头自抟，各六十三过止。 次北向五拜，言曰： 天地否激，阴阳相刑。 四时失和，灾害流生，星宿错综，以告不祥。 国土扰乱，兵病并行，帝王忧伤，兆民无宁。 谨依大法，披露真文，皈命北方无极太上灵宝天尊、已得道大圣众、至真诸君丈人、五炁天君、北乡诸灵官。 今故立斋，披心露形，引咎自克，为国谢殃，烧香然灯，照曜诸天，下映无极长夜之中九幽之府，开诸光明。 愿以是功德，为帝主国王，君官吏民，解灾却患，三景复位，五行顺常，兵止病愈，国祚兴隆，兆民欢泰，人神安宁。 今故烧香，皈身皈神皈命师尊大圣众至真之德，得道之后，升入无形，与道合真。 愿毕，叩头自抟，各四十五过止。 次东北向一拜，言曰：",
      "translated_text": "Now, therefore, I burn incense, surrendering body, spirit, and life to the virtue of the Master, the Venerable Ones, the Perfected, and the Great Sages who have attained the Dao, ascending into formlessness after their enlightenment to merge with the Dao in truth. Having completed this, I bow in prostration, striking my breast—twenty-seven times in all, and no more.\n\nThen, facing west, I perform seven bows, saying:\nHeaven and Earth are obstructed, yin and yang clash in punishment. The four seasons lose their harmony, disasters and harms arise in succession. The celestial bodies are disordered, foretelling inauspicious omens. The land is thrown into turmoil, warfare and illness spread together. The emperor and kings grieve, the myriad people know no peace.\n\nNow, I strictly follow the Great Rites, baring the true scriptures, surrendering to the boundless Most High Numinous Treasure Heavenly Worthy of the West, the Great Sages who have attained the Dao, the Perfected Lords and Venerable Ones, the Seven Qi Heavenly Lords, and the various spirit officials of the western realm. Now, I establish this fast, baring my heart and revealing my form, acknowledging my faults and restraining myself to atone for the nation’s calamities. I burn incense and kindle lamps to illuminate the myriad heavens, casting light into the boundless darkness of the Nine Nether Realms, opening all radiance. Through this merit, may the emperor and rulers of the nation, their ministers and officials, and all people be freed from disasters and misfortunes. May the Three Luminaries return to their positions, the Five Phases follow their proper course, warfare cease, illnesses be cured, the nation’s fortune flourish, the people rejoice in peace, and gods and humans dwell in tranquility.\n\nNow, therefore, I burn incense, surrendering body, spirit, and life to the virtue of the Master, the Venerable Ones, the Perfected, and the Great Sages who have attained the Dao, ascending into formlessness after their enlightenment to merge with the Dao in truth. Having completed this, I bow in prostration, striking my breast—sixty-three times in all, and no more.\n\nThen, facing north, I perform five bows, saying:\nHeaven and Earth are obstructed, yin and yang clash in punishment. The four seasons lose their harmony, disasters and harms arise in succession. The celestial bodies are disordered, foretelling inauspicious omens. The land is thrown into turmoil, warfare and illness spread together. The emperor and kings grieve, the myriad people know no peace.\n\nNow, I strictly follow the Great Rites, baring the true scriptures, surrendering to the boundless Most High Numinous Treasure Heavenly Worthy of the North, the Great Sages who have attained the Dao, the Perfected Lords and Venerable Ones, the Five Qi Heavenly Lords, and the various spirit officials of the northern realm. Now, I establish this fast, baring my heart and revealing my form, acknowledging my faults and restraining myself to atone for the nation’s calamities. I burn incense and kindle lamps to illuminate the myriad heavens, casting light into the boundless darkness of the Nine Nether Realms, opening all radiance. Through this merit, may the emperor and rulers of the nation, their ministers and officials, and all people be freed from disasters and misfortunes. May the Three Luminaries return to their positions, the Five Phases follow their proper course, warfare cease, illnesses be cured, the nation’s fortune flourish, the people rejoice in peace, and gods and humans dwell in tranquility.\n\nNow, therefore, I burn incense, surrendering body, spirit, and life to the virtue of the Master, the Venerable Ones, the Perfected, and the Great Sages who have attained the Dao, ascending into formlessness after their enlightenment to merge with the Dao in truth. Having completed this, I bow in prostration, striking my breast—forty-five times in all, and no more.\n\nThen, facing northeast, I perform one bow, saying:",
      "overlap_context": "uminate the myriad heavens, casting light into the boundless darkness of the Nine Nether Realms, opening all radiance. Through this merit, may the emperor and rulers of the nation, their ministers and officials, and all people be freed from disasters and misfortunes. May the Three Luminaries return to their positions, the Five Phases follow their proper course, warfare cease, illnesses be cured, the nation’s fortune flourish, the people rejoice in peace, and gods and humans dwell in tranquility.",
      "start_char": 12368,
      "end_char": 12963,
      "start_sentence": 319,
      "end_sentence": 336,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.96317195892334,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝长夜之府九幽玉匮明真科.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "天地否激，阴阳相刑，四时失和，灾害流生，星宿错综，以告不祥，国土扰乱，兵病并行，帝王忧伤，兆民无宁。 谨依大法，披露真文，皈命东北方无极太上灵宝天尊、已得道大圣众、至真诸君丈人、梵炁天君，东北乡诸灵官。 今故立斋，披心露形，引咎自克，为国谢殃，烧香然灯，照曜诸天，下映无极长夜之中九幽之府，开诸光明，愿以是功德，为帝主国王，君官吏民，解灾却患。 三景复位，五行顺常，兵止病愈，国祚兴隆，兆民欢泰，人神安宁。 今故烧香，皈身皈神皈命师尊大圣众至真之德，得道之后，升入无形，与道合真。 愿毕，叩头自抟，九过止。 次东南向一拜，言曰：",
      "translated_text": "When Heaven and Earth are obstructed and in turmoil, when yin and yang clash and punish one another, when the four seasons lose their harmony, disasters and calamities arise in succession. The stellar lodges fall into disarray, heralding omens of misfortune; the land is thrown into chaos, with warfare and illness spreading unchecked. The emperor and rulers grieve in sorrow, and the myriad people find no peace.\n\nIn solemn observance of the Great Rites, I now unfold the true scriptures, surrendering body, spirit, and life to the Venerable Supreme Numinous Treasure Heavenly Worthy of the Boundless in the Northeast, to the Great Sages who have attained the Dao, to the Perfected Lords and Venerable Masters, to the Heavenly Lords of Brahma-qi, and to the divine officials of the Northeast quarter.\n\nThus, I establish this fast, baring my heart and exposing my form, acknowledging my faults and chastising myself. For the nation, I seek to dispel calamities, burning incense and kindling lamps to illuminate the heavens above and cast light into the boundless, eternal night of the Nine Dark Realms below, opening all paths to radiance. Through this merit, may the emperor and rulers of the nation, their ministers and officials, and all people be freed from disasters and misfortunes. May the Three Luminaries return to their positions, the Five Phases follow their proper course, warfare cease, illnesses be cured, the nation’s fortune flourish, the people rejoice in peace, and gods and humans dwell in tranquility.\n\nNow, therefore, I burn incense, surrendering body, spirit, and life to the virtue of the Master, the Venerable Ones, the Perfected, and the Great Sages who have attained the Dao, ascending into formlessness after their enlightenment to merge with the Dao in truth. Having completed this, I bow in prostration, striking my breast—nine times in all, and no more.\n\nThen, facing southeast, I perform one bow, saying:",
      "overlap_context": "flourish, the people rejoice in peace, and gods and humans dwell in tranquility.\n\nNow, therefore, I burn incense, surrendering body, spirit, and life to the virtue of the Master, the Venerable Ones, the Perfected, and the Great Sages who have attained the Dao, ascending into formlessness after their enlightenment to merge with the Dao in truth. Having completed this, I bow in prostration, striking my breast—forty-five times in all, and no more.\n\nThen, facing northeast, I perform one bow, saying:",
      "start_char": 12963,
      "end_char": 13227,
      "start_sentence": 337,
      "end_sentence": 343,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.95741605758667,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝长夜之府九幽玉匮明真科.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "天地否激，阴阳相刑，四时失和，灾害流生，星宿错综，以告不祥。 国土扰乱，兵病并行，帝王忧伤，兆民无宁。 谨依大法，披露真文，皈命东南方无极太上灵宝天尊、已得道大圣众、至真诸君丈人、梵炁天君、东南乡诸灵官。 今故立斋，披心露形，引咎自克，为国谢殃，烧香然灯，照曜诸天，下映无极长夜之中九幽之府，开诸光明，愿以是功德，为帝主国王，君官吏民，解灾却患。 三景复位，五行顺常，兵止病愈，国祚兴隆，兆民欢泰，人神安宁。 今故烧香，皈身皈神皈命师尊大圣众至真之德，得道之后，升入无形，与道合真。 愿毕，叩头自抟，各九过止。 次西南向一拜，言曰：",
      "translated_text": "When Heaven and Earth are obstructed and in turmoil, when yin and yang clash in mutual harm, when the four seasons lose their harmony, disasters and calamities spread unchecked, and the celestial bodies fall into disarray, portending ill omens. The realm is thrown into chaos, warfare and disease rage together, the emperor grieves in sorrow, and the myriad people find no peace.\n\nIn reverent accordance with the Great Law, I now reveal the true scripture, surrendering body, spirit, and life to the Venerable Most High Numinous Treasure Heavenly Worthy of the Boundless in the Southeast, the Great Sages who have attained the Dao, the Perfected Lords and Venerable Ones, the Heavenly Lords of Brahma-qi, and the divine officials of the Southeast. Today, I establish this fast, baring my heart and revealing my form, acknowledging my faults and restraining myself, beseeching the nation’s deliverance from calamity. I burn incense and kindle lamps to illuminate the heavens above and shine upon the Nine Dark Realms within the boundless, eternal night below, unveiling all radiant light. Through this merit, may the emperor and rulers of the nation, their ministers and officials, and all people be freed from disasters and misfortunes. May the Three Luminaries return to their positions, the Five Phases follow their proper course, warfare cease, illnesses be cured, the nation’s fortune flourish, the people rejoice in peace, and gods and humans dwell in tranquility.\n\nNow, therefore, I burn incense, surrendering body, spirit, and life to the virtue of the Master, the Venerable Ones, the Perfected, and the Great Sages who have attained the Dao, ascending into formlessness after their enlightenment to merge with the Dao in truth. Having completed this, I bow in prostration, striking my breast—nine times in all, and no more.\n\nThen, facing southwest, I perform one bow, saying:",
      "overlap_context": "rtune flourish, the people rejoice in peace, and gods and humans dwell in tranquility.\n\nNow, therefore, I burn incense, surrendering body, spirit, and life to the virtue of the Master, the Venerable Ones, the Perfected, and the Great Sages who have attained the Dao, ascending into formlessness after their enlightenment to merge with the Dao in truth. Having completed this, I bow in prostration, striking my breast—nine times in all, and no more.\n\nThen, facing southeast, I perform one bow, saying:",
      "start_char": 13227,
      "end_char": 13492,
      "start_sentence": 344,
      "end_sentence": 351,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.87866473197937,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝长夜之府九幽玉匮明真科.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "天地否激，阴阳相刑，四时失和，灾害流生，星宿错综，以告不祥，国土扰乱，兵病并行，帝王忧伤，兆民无宁。 谨依大法，披露真文，皈命西南方无极太上灵宝天尊、已得道大圣众、至真诸君丈人、梵炁天君、西南乡诸灵官。 今故立斋，披心露形，引咎自克，为国谢殃，烧香然灯，照曜诸天，下映无极长夜之中九幽之府，开诸光明。 愿以是功德，为帝主国王，君官吏民，解灾却患。 三景复位，五行顺常，兵止病愈，国祚兴隆，兆民欢泰，人神安宁。 今故烧香，皈身皈神皈命师尊大圣众至真之德，得道之后，升入无形，与道合真。 愿毕，叩头自抟九过止。 次西北向一拜，言曰：",
      "translated_text": "When Heaven and Earth are obstructed, yin and yang clash in conflict, the four seasons lose their harmony, and calamities flow forth; when the celestial lodgings are entangled, portending ill omens; when the land is thrown into turmoil, warfare and illness spread together; when the emperor grieves in sorrow and the myriad people know no peace—\n\nI now reverently follow the Great Rites, unfolding the true scriptures, and surrender body, spirit, and life to the Venerable Supreme Numinous Treasure Heavenly Worthy of the Boundless in the Southwest, the Great Sages who have attained the Dao, the Perfected Lords and Venerable Ones, the Heavenly Lords of Pristine Qi, and the divine officials of the Southwest Quarter.\n\nThus, I establish this fast, baring my heart and revealing my form, acknowledging my faults and reproaching myself, beseeching the nation’s deliverance from misfortune. I burn incense and kindle lamps to illuminate the heavens above and shine below into the boundless, eternal night of the Nine Dark Realms, unfolding all radiant light. Through this merit, may the emperor and rulers of the nation, their ministers and officials, and all people be freed from disasters and misfortunes. May the Three Luminaries return to their positions, the Five Phases follow their proper course, warfare cease, illnesses be cured, the nation’s fortune flourish, the people rejoice in peace, and gods and humans dwell in tranquility.\n\nNow, therefore, I burn incense, surrendering body, spirit, and life to the virtue of the Master, the Venerable Ones, the Perfected, and the Great Sages who have attained the Dao, ascending into formlessness after their enlightenment to merge with the Dao in truth. Having completed this, I bow in prostration, striking my breast—nine times in all, and no more.\n\nThen, facing northwest, I perform one bow, saying:",
      "overlap_context": "rtune flourish, the people rejoice in peace, and gods and humans dwell in tranquility.\n\nNow, therefore, I burn incense, surrendering body, spirit, and life to the virtue of the Master, the Venerable Ones, the Perfected, and the Great Sages who have attained the Dao, ascending into formlessness after their enlightenment to merge with the Dao in truth. Having completed this, I bow in prostration, striking my breast—nine times in all, and no more.\n\nThen, facing southwest, I perform one bow, saying:",
      "start_char": 13492,
      "end_char": 13755,
      "start_sentence": 352,
      "end_sentence": 359,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.255193710327148,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝长夜之府九幽玉匮明真科.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "天地否激，阴阳相刑，四时失和，灾害流生，星宿错综，以告不祥，国土扰乱，兵病并行。 帝王忧伤，兆民无宁。 谨依大法，披露真文，皈命西北方无极太上灵宝天尊、已得道大圣众、至真诸君丈人、梵炁天君、西北乡诸灵官。 今故立斋，披心露形，引咎自克，为国谢殃，烧香然灯，照曜诸天，下映无极长夜之中九幽之府，开诸光明。 愿以是功德，为帝主国王，君官吏民，解灾却患，三景复位，五行顺常，兵止病愈，国祚兴隆，兆民欢泰，人神安宁。 今故烧香，皈身皈神皈命师尊大圣众至真之德，得道之后，升入无形，与道合真。 愿毕，叩头自抟，各九过止。 次西北向上方三十二拜，言曰：",
      "translated_text": "When Heaven and Earth are obstructed and in turmoil, when yin and yang clash in mutual harm, when the four seasons lose their harmony, disasters and calamities spread unchecked. The constellations fall into disarray, portending ill omens; the land is thrown into chaos, with warfare and disease raging together. The emperor is grieved, and the myriad people find no peace.\n\nIn reverent accordance with the Great Law, I now reveal the true scripture, surrendering body, spirit, and life to the Venerable and Most High Numinous Treasure Heavenly Worthy of the Infinite in the Northwest, to the Great Sages who have attained the Dao, to the Perfected Lords and Venerable Masters, to the Heavenly Lords of Pristine Qi, and to the divine officials of the Northwest. Today, I establish this fast, baring my heart and revealing my form, acknowledging my faults and restraining myself to atone for the nation’s misfortunes. I burn incense and light lamps to illuminate the heavens above and shine upon the Nine Dark Realms within the boundless, eternal night below, opening all paths to radiant light.\n\nThrough this merit, may the emperor and rulers of the nation, their ministers and officials, and all people be freed from disasters and misfortunes. May the Three Luminaries return to their positions, the Five Phases follow their proper course, warfare cease, illnesses be cured, the nation’s fortune flourish, the people rejoice in peace, and gods and humans dwell in tranquility.\n\nNow, therefore, I burn incense, surrendering body, spirit, and life to the virtue of the Master, the Venerable Ones, the Perfected, and the Great Sages who have attained the Dao, ascending into formlessness after their enlightenment to merge with the Dao in truth. Having completed this, I bow in prostration, striking my breast—nine times each in all.\n\nThen, facing northwest, I perform thirty-two bows to the Upper Realm, saying:",
      "overlap_context": "rtune flourish, the people rejoice in peace, and gods and humans dwell in tranquility.\n\nNow, therefore, I burn incense, surrendering body, spirit, and life to the virtue of the Master, the Venerable Ones, the Perfected, and the Great Sages who have attained the Dao, ascending into formlessness after their enlightenment to merge with the Dao in truth. Having completed this, I bow in prostration, striking my breast—nine times in all, and no more.\n\nThen, facing northwest, I perform one bow, saying:",
      "start_char": 13755,
      "end_char": 14024,
      "start_sentence": 360,
      "end_sentence": 367,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.929591655731201,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝长夜之府九幽玉匮明真科.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "天地否激，阴阳相刑，四时失和，灾害流生。 星宿错综，以告不祥，国土扰乱，兵病并行，帝王忧伤，兆民无宁。 谨依大法，披露真文，皈命上方无极太上灵宝天尊#92、已得道大圣众、至真诸君丈人、三十二天帝君、玉京玄都紫微上宫诸真人、玉女神仙诸灵官。 今故立斋，披心露形，引咎自克，为国谢殃，烧香然灯，照曜诸天，下映无极长夜之中九幽之府，开诸光明。 愿以是功德，为帝主国王、君官吏民，解灾却患，三景复位，五行顺常，兵止病愈，国祚兴隆，兆民欢泰，人神安宁。 今故烧香，皈身皈神皈命师尊大圣众至真之德，得道之后，升入无形，与道合真。 愿毕，叩头自抟，各八十八过止。 次向东南下方十二拜，言曰： 天地否激，阴阳相刑，四时失和，灾害流生，星宿错综，以告不祥，国土扰乱，兵病并行，帝王忧伤，兆民无宁。 谨依大法，披露真文，皈命下方无极太上灵宝天尊、已得道大圣众、至真诸君丈人、九垒土皇、四司五帝、十二仙官、五岳四渎九宫真人，神仙玉女，无极世界地祇诸灵官。 今故立斋，披心露形，引咎自克，为国谢殃，烧香然灯，照曜诸天，下映无极长夜之中九幽之府，开诸光明。 愿以是功德，为帝主国王，君官吏民，解灾却患，三景复位，五行顺常，兵止病愈，国祚兴隆，兆民欢泰，人神安宁。 今故烧香，皈身皈神皈命师尊大圣众至真之德，得道之后，升入无形，与道合真。 愿毕，叩头自抟，各一百八过止。 次旋行三匝，诵步虚灵章 次复炉#93 香官使者、左右龙虎君、捧香驿龙骑吏，当令请宣斋堂，生自然金液丹碧芝英，百灵众真交会在此香火炉前，令臣得道，遂获神仙，举家蒙福，天下受恩，十方玉童玉女侍卫香烟，传臣所启，径御无极大上大道御前。 飞天神人曰：凡行道日数，多少自适。 人所为虽有四时日#94数，依五行周#95度，至於三日三夜苦请，丹心亦感彻於诸天。 学士自可量节而行事。 飞天神人曰：凡国王帝主，禳灾度厄，用五方纹缯，随方尺数#96。 龙用上金，命缯用紫纹，法天家之重。 庶民用缦缯，龙用中金，然灯请乞，同於上法。 有违考属天官玄都曹。 飞天神人曰：受灵宝真文十部妙经，以金龙三枚，投於水府，及灵山、所住宅中，合三处，为学仙之信。 不投此，三官拘人命籍，求乞不达。 法依玉诀之文，有违考属地官九都曹。 飞天神人曰：受灵宝真文十部妙经，当#97以纹缯五方之彩，各四十尺，以关五帝，为告盟之信。 阙则五帝不受人名，为五帝魔王所坏，使人志念不专。 考属水官泉曲曹。 飞天神人曰：受灵宝真文十部妙经，法用上金五两，以盟五岳，为宝经之信。 阙则犯慢经之科，五岳灵山不领人学籍。 违者考属阴官曹。 飞天神人曰：受灵宝真文十部妙经，以金钱二百四十，以质二十四炁生官重真之信。 阙则三部八景之神不度人命籍。 无金钱者，铜钱六百准。 犯之考属都神曹。 飞天神人曰：学士不明然灯烧香，七祖不得开度长夜之府九幽之中，身无光明。 考属太阴曹。 飞天神人曰：学士不持斋奉戒，七祖不得上升天堂，身无香洁，不致神明。 至士能持斋戒，则思念立感，功应自然。 有违考属太阳曹。",
      "translated_text": "When Heaven and Earth are obstructed, yin and yang clash in punishment, the four seasons lose harmony, and disasters and calamities spread. The stellar lodges entangle, foretelling ill omens; the land is thrown into turmoil, war and illness rage together. The emperor and kings grieve, and the myriad people know no peace.\n\nReverently following the Great Law, I reveal the true scriptures and surrender body, spirit, and life to the Upper Realm’s Boundless Supreme Numinous Treasure Heavenly Worthy, the enlightened assembly of Great Sages, the Perfected Lords and Venerable Ones, the Lords of the Thirty-Two Heavens, the Realized Ones of the Jade Capital, Mystic Capital, and Purple Tenuity’s Upper Palace, the Jade Maidens, Divine Immortals, and all spirit officials. Now, therefore, I establish this retreat, baring my heart and exposing my form, acknowledging my faults and chastising myself to atone for the nation’s misfortunes. I burn incense and kindle lamps to illuminate the heavens above and shine upon the Nine Dark Realms within the boundless long night below, unveiling all radiance. May this merit and power be dedicated to the emperor, kings, rulers, ministers, officials, and all people, that disasters be dispelled, misfortunes averted, the Three Luminaries restored to their positions, the Five Phases follow their proper course, warfare cease, illnesses be cured, the nation’s fortune flourish, the people rejoice in peace, and gods and humans dwell in tranquility.\n\nNow, therefore, I burn incense, surrendering body, spirit, and life to the virtue of the Master, the Venerable Ones, the Perfected, and the Great Sages who have attained the Dao, ascending into formlessness after their enlightenment to merge with the Dao in truth. Having completed this, I bow in prostration, striking my breast—eighty-eight times each.\n\nThen, facing southeast, I perform twelve bows to the Lower Realm, saying:\n\nWhen Heaven and Earth are obstructed, yin and yang clash in punishment, the four seasons lose harmony, and disasters and calamities spread. The stellar lodges entangle, foretelling ill omens; the land is thrown into turmoil, war and illness rage together. The emperor and kings grieve, and the myriad people know no peace.\n\nReverently following the Great Law, I reveal the true scriptures and surrender body, spirit, and life to the Lower Realm’s Boundless Supreme Numinous Treasure Heavenly Worthy, the enlightened assembly of Great Sages, the Perfected Lords and Venerable Ones, the Nine Mounds’ Earthly Sovereigns, the Four Directors and Five Emperors, the Twelve Immortal Officials, the Realized Ones of the Five Peaks, Four Waterways, and Nine Palaces, the Divine Immortals, Jade Maidens, and all spirit officials of the boundless world’s earthly deities. Now, therefore, I establish this retreat, baring my heart and exposing my form, acknowledging my faults and chastising myself to atone for the nation’s misfortunes. I burn incense and kindle lamps to illuminate the heavens above and shine upon the Nine Dark Realms within the boundless long night below, unveiling all radiance. May this merit and power be dedicated to the emperor, kings, rulers, ministers, officials, and all people, that disasters be dispelled, misfortunes averted, the Three Luminaries restored to their positions, the Five Phases follow their proper course, warfare cease, illnesses be cured, the nation’s fortune flourish, the people rejoice in peace, and gods and humans dwell in tranquility.\n\nNow, therefore, I burn incense, surrendering body, spirit, and life to the virtue of the Master, the Venerable Ones, the Perfected, and the Great Sages who have attained the Dao, ascending into formlessness after their enlightenment to merge with the Dao in truth. Having completed this, I bow in prostration, striking my breast—one hundred and eight times each.\n\nThen, circling three times, I recite the *Lingzhang* of the *BuXu*.\n\nNext, to the incense officials and messengers, the Left and Right Dragon-Tiger Lords, and the incense-bearing dragon couriers, I command: Announce this retreat hall, where the spontaneous golden elixir, cinnabar mushrooms, and azure herbs flourish. May the hundred spirits and host of Perfected gather here before this incense burner, that I may attain the Dao, achieve immortality, my household receive blessings, the world be graced with favor, and the jade lads and maidens of the ten directions attend the fragrant smoke, transmitting my prayers directly to the throne of the Boundless Supreme Great Dao.\n\nThe Flying Heavenly Spirits declare: The duration of Daoist practice may be adjusted as one sees fit. Though human endeavors follow the four seasons and the cycles of the Five Phases, even three days and nights of earnest supplication with a sincere heart will move the heavens. Scholars may proceed according to their capacity.\n\nThe Flying Heavenly Spirits declare: When kings and emperors perform rites to avert disasters and transcend calamities, they use five-colored silks corresponding to the directions, each of specified length. Dragons are adorned with superior gold, and the ritual silks bear purple patterns, honoring the celestial hierarchy. Commoners use plain silk, dragons are adorned with medium gold, and the lamp offerings follow the same protocol. Those who violate this are examined by the Celestial Bureau of the Mystic Capital.\n\nThe Flying Heavenly Spirits declare: Upon receiving the ten sections of the wondrous scriptures of the Numinous Treasure, cast three golden dragons into the water palace, a sacred mountain, and one’s residence—three locations in total—as a pledge of one’s commitment to Daoist cultivation. Failing this, the Three Officials will retain one’s life register, and prayers will not reach their destination. Violations are examined by the Earthly Bureau of the Nine Capitals according to the Jade Instructions.\n\nThe Flying Heavenly Spirits declare: Upon receiving the ten sections of the wondrous scriptures of the Numinous Treasure, use forty feet of patterned silk in each of the five directions to invoke the Five Emperors as a pledge of one’s oath. Without this, the Five Emperors will not accept one’s name, and the demon kings of the Five Emperors will disrupt one’s resolve. Violations are examined by the Water Bureau of the Yellow Springs.\n\nThe Flying Heavenly Spirits declare: Upon receiving the ten sections of the wondrous scriptures of the Numinous Treasure, use five ounces of superior gold to pledge allegiance to the Five Peaks as a sign of reverence for the sacred scriptures. Without this, one incurs the penalty of disrespecting the scriptures, and the sacred mountains of the Five Peaks will not register one’s name among the learners. Violations are examined by the Yin Bureau.\n\nThe Flying Heavenly Spirits declare: Upon receiving the ten sections of the wondrous scriptures of the Numinous Treasure, use two hundred and forty gold coins as a pledge to the twenty-four qi-generating officials, affirming one’s sincerity. Without this, the gods of the Three Departments and Eight Sceneries will not transfer one’s life register. If gold is unavailable, six hundred copper coins may suffice. Violations are examined by the General Spirit Bureau.\n\nThe Flying Heavenly Spirits declare: If scholars do not kindle lamps and burn incense, their seven ancestors will not be liberated from the Nine Dark Realms within the long night, and their bodies will lack radiance. Violations are examined by the Supreme Yin Bureau.\n\nThe Flying Heavenly Spirits declare: If scholars do not observe fasts and uphold precepts, their seven ancestors will not ascend to the celestial halls, their bodies will lack purity, and they will not attract the presence of spirits. Those who can uphold fasts and precepts will find their thoughts swiftly answered, and their merits naturally manifest. Violations are examined by the Supreme Yang Bureau.",
      "overlap_context": " people rejoice in peace, and gods and humans dwell in tranquility.\n\nNow, therefore, I burn incense, surrendering body, spirit, and life to the virtue of the Master, the Venerable Ones, the Perfected, and the Great Sages who have attained the Dao, ascending into formlessness after their enlightenment to merge with the Dao in truth. Having completed this, I bow in prostration, striking my breast—nine times each in all.\n\nThen, facing northwest, I perform thirty-two bows to the Upper Realm, saying:",
      "start_char": 14024,
      "end_char": 15269,
      "start_sentence": 368,
      "end_sentence": 409,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.91983103752136,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝长夜之府九幽玉匮明真科.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "飞天神人曰：天文秘重，非信不宝。 故上圣以信效心，无信则为贱道，无盟则为轻宝。 有违考属左右官曹。 飞天神人曰：经不师受，五帝无盟，妄披其篇目，罪同窃经之科，考属明法曹。 飞天神人曰：受经之身，先信未佩，后遇贤人，赍信请受，皆当以所受之信，完补先师之限，余者可为身法用。 有违考属火官曹。 飞天神人曰：受经法信，当十分折二送祖师，又折二散乞贫人、山栖道士，余信营己，法用烧香然灯，为弟子立功。 有违考属三官曹。 飞天神人曰：受经中悔，放散天文，考属司非曹，三年灭种长夜。 不轻忽三宝，不泄露真经，不欺师违义，不称己功名，不轻天慢地，不毁辱三光，不秽污五岳，不凌籍神明，不口是心非，不妬害贤能，不悭惜施功，不贪欲自荣。 飞天神人曰：明真科文，戒於罪福，品目如上。 至士精心，修科奉法，不违经典，冥感自然，天亮尔心，七祖立得开度九幽长夜之中，上升天堂，衣食自然，早得更生王侯之门，见世光明，庆福难胜，勤行弗息，克获神仙矣。 洞玄灵宝长夜之府九幽玉匮明真科竟 #1《道藏》本原缺此标题，据敦煌P.2730抄本补。 #1宝：原作「室」，据敦煌本改。 #3不朽：原作「不休」，据敦煌本改。 #4便更受生还为人中：敦煌本作「便更受炁，还生人中」。 #5运通：敦煌本作「运灵」。 #6「为」字据敦煌本补。 #7智慧：原作『 智惠J ，据敦煌本改。 #8太上：原作『 太和」，据敦煌本改。 #9天堂：敦煌本作「福堂」。 #10因缘：敦煌本作「结因」。 #11明真科：敦煌本作「长夜之府九幽玉遗明真科」。 #12「还」字据敦煌本补。 #13 贪啖：敦煌本作「食啖」。 #14沉沦罪深：敦煌本作「幽沦罪源」。 #15日远：敦煌本作「转远」。 #16任：原作「壬」，据敦煌本改。 #17与：原作「兴」，据敦煌本改。 #18骂辱，原作「詈辱」，据敦煌本改。 #19得还：原作「得道」据敦煌本改。 #20 肉负：P.2730作「身负」P.2352作「肉负」。 #21长乖：原作「长革」，据敦煌本改。 #22仆使：原作「伏使」，据敦煌本改。 #23不得开度：敦煌本作「不见前缘」。 #24万劫鞭迫：P.2730作「身被鞭拍」，P.2352 作「身受鞭拍」敦煌本近是。 #25铁锥：敦煌本作「铁针」。 #26限极：敦煌本作「限数」。 #27打扑：敦煌本作「打拍」。 #28纵还：原作「纵横」，据敦煌本改。 #29不得开度：敦煌本作「生死莫知」。 #30欺谤：敦煌本作「欺诱」。 #31摙：原误作「涟」，据敦煌本改。 #32锒铛：原误作「刨铛」，敦煌本作「狼挡」。 当从前文改作「锒铛。 」 #33勋励：原误作「厄励」，据敦煌本改。 #34痛毒：敦煌本作「痛楚」。 #35牛马身：敦煌本作「牛狩身」。 #36衣披：敦煌本作「衣被」。 #37天民：敦煌本作「天人」。 #38 P.2730 抄本止於此句，作尾题。 P.2442抄本起於此句，作首题。 P . 2352 抄本以此句为文中小标题。 《道藏》本亦以此句为小标题，但句末多一「曰」字。 #39 P.2442「普照」前有「光明」二字。",
      "translated_text": "The Flying Heavenly Spirits declare: The celestial texts are profoundly sacred and are not treasured without faith. Thus, the supreme sages demonstrate their hearts through faith. Without faith, one becomes base in the Dao; without covenants, one trivializes the sacred. Violations are examined by the Left and Right Official Bureaus.\n\nThe Flying Heavenly Spirits declare: Scriptures not transmitted by a master lack the Five Emperors’ covenant. To recklessly peruse their contents is a transgression equal to stealing scriptures. Violations are examined by the Bureau of Illuminated Laws.\n\nThe Flying Heavenly Spirits declare: Those who receive scriptures must first present their pledge before wearing them. Should they later encounter a worthy person and offer their pledge to request transmission, they must use the received pledge to complete the term of their former master, with any remainder to be used for their own practice. Violations are examined by the Fire Official Bureau.\n\nThe Flying Heavenly Spirits declare: For the pledges of transmitted scriptures, one-tenth must be offered to the ancestral master, and another two-tenths distributed to the poor, mendicant Daoists, and mountain-dwelling adepts. The remaining pledge is to be used for one’s own practice—burning incense, kindling lamps, and establishing merit for disciples. Violations are examined by the Three Officials Bureau.\n\nThe Flying Heavenly Spirits declare: Those who regret receiving scriptures and recklessly disseminate celestial texts will be examined by the Bureau of Wrongdoing, and their lineage will be extinguished in the long night for three years.\n\nDo not treat the Three Treasures lightly, do not leak the true scriptures, do not deceive your master or violate righteousness, do not claim merit or fame for yourself, do not disrespect heaven or belittle earth, do not defile or insult the Three Luminaries, do not pollute the Five Peaks, do not encroach upon or slight the spirits, do not speak falsely while harboring deceit, do not envy or harm the worthy and capable, do not withhold alms or begrudge acts of merit, and do not indulge in greed or seek self-glorification.\n\nThe Flying Heavenly Spirits declare: The statutes of the Illuminated True Regulations delineate the boundaries of transgression and blessing, as outlined above. Those of utmost sincerity who diligently cultivate the statutes, uphold the laws, and do not violate the scriptures will naturally evoke hidden resonance. Heaven will illumine their hearts, and their seven ancestors will swiftly be liberated from the Nine Dark Realms of the long night, ascending to the celestial halls. Their clothing and sustenance will come naturally, and they will soon be reborn into the houses of kings and nobles. In this life, they will radiate brilliance, and their blessings will be boundless. By ceaselessly practicing with devotion, they will attain the rank of divine immortals.\n\nThe *Dongxuan Lingbao* *Jade Casket of the Illuminated True Statutes for the Nine Dark Realms of the Long Night* concludes.",
      "overlap_context": "ght, and their bodies will lack radiance. Violations are examined by the Supreme Yin Bureau.\n\nThe Flying Heavenly Spirits declare: If scholars do not observe fasts and uphold precepts, their seven ancestors will not ascend to the celestial halls, their bodies will lack purity, and they will not attract the presence of spirits. Those who can uphold fasts and precepts will find their thoughts swiftly answered, and their merits naturally manifest. Violations are examined by the Supreme Yang Bureau.",
      "start_char": 15270,
      "end_char": 16632,
      "start_sentence": 410,
      "end_sentence": 466,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.370540857315063,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝长夜之府九幽玉匮明真科.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 17,
      "original_text": "#40如此之报：敦煌本作「凡如此辈」。 #41「不乎」 二字据敦煌本补。 #42封：原作「对」，据敦煌本改。 #43万劫：敦煌本作「四万劫」。 #44 祸：原作「恶」，据敦煌本改。 #45命：原作「会」，据敦煌本改。 #46责役：敦煌本作「责作」。 #47按P.2406抄本起於此句，句前有标题「太上洞玄灵宝明真经科仪」。 P.2442抄本无此标题。 #48 令高九尺：S.6312 抄本作「杆长九尺」。 其它敦煌抄本无此四字。 #49具法：P.2406抄本作「旧法」。",
      "translated_text": "Those who receive such retribution—should they not repent and reform, their sins will be recorded in the celestial ledgers. Even if they were to perform good deeds for ten thousand kalpas, they would still be bound by their past transgressions. Their misfortunes will multiply, their lifespans will be cut short, and they will be conscripted into laborious servitude. Their descendants will suffer poverty and hardship, and their families will be scattered and ruined.\n\nAccording to the manuscript P.2406, this passage begins here, preceded by the title *\"Ritual Ordinances of the Supreme Pervasive Mystery Numinous Treasure Scripture of Illuminating the True.\"* Manuscript P.2442 omits this title. The ritual implements shall be nine feet in height, and all procedures must follow the established methods.",
      "overlap_context": "iberated from the Nine Dark Realms of the long night, ascending to the celestial halls. Their clothing and sustenance will come naturally, and they will soon be reborn into the houses of kings and nobles. In this life, they will radiate brilliance, and their blessings will be boundless. By ceaselessly practicing with devotion, they will attain the rank of divine immortals.\n\nThe *Dongxuan Lingbao* *Jade Casket of the Illuminated True Statutes for the Nine Dark Realms of the Long Night* concludes.",
      "start_char": 16633,
      "end_char": 16886,
      "start_sentence": 467,
      "end_sentence": 478,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 4.8114306926727295,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝长夜之府九幽玉匮明真科.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 18,
      "original_text": "#50敦煌本於「监斋直事，侍香金童，散花玉女」三句下，均有「卅二人」三字。 #51「等」字据敦煌本补。 #52「启」字据敦煌本补。 #53帝王国主：敦煌本作「帝主国王」。 后文均同此，不复出校记。 #54君官吏民：敦煌本作「君臣吏民」。 后文大多同此，不复出校记。 #55按敦煌本祈愿词中「某」字多作「甲」 。 #56皈依：敦煌本作「归依」。 按后文中凡「皈依」、「皈命」 等词，敦煌本均作「归依」、「归命」、「归神」。 不复详出校记。 #57按自「今故立斋」至「与道合真」，凡一百五十余字祈愿词，敦煌本均省略作「愿念如上法」。 下文同此，不复出校记。 #58按自「次向东南一拜」以下三节经文，敦煌本省略作：「次东南、次西南、次西北，四角俱一拜，叩头抟颊并各九过，归命愿念，悉如东北方之法」。 #59次向上方：敦煌本作「四角毕，次向西北上方」。 #60次向下方：敦煌本作「次向东南下方」。 #61九垒土皇：敦煌本作「九土玉皇」。 #62兵寇：原作「兵疫」，据敦煌本改。 #63而说：敦煌本作「曰所说」三字。 #64疾疹：敦煌本作「灾疾」，近是。 #65敦煌本无「烧香」二字。 #66发炉：敦煌本作「言曰」。 #67敦煌本无「次发炉」三字。 #68侍香金童传言玉女：敦煌本作「侍香玉童侍香玉女」。 #69敦煌本无「次各称法位」五字。 #70臣某：敦煌本作「王甲」。 后文与此同例。 #71敦煌本无「太上老君」四字。 #72值：敦煌本作「落」。 #73至真：敦煌本作「上真」。 #74敦煌本「臣」字下有小字注文「之道胤德」。 #75敦煌本「身」字下有注文「后学者但云」五字。 #76皈命：敦煌本作「躯命」。 #77灾疾：敦煌本作「危灾」。 #78或虑帝王受天禅祚：敦煌本作「诚由帝主受天福祚」。 #79未周：敦煌本作「不能」。 #80行无歌咏路致吞声：敦煌本作「恩无歌咏，路有吞声」。 下文「故」字作「致」。 #81「监斋直事、侍香金童、散花玉女」 三句下，敦煌本均有「卅二人」三字。 #82有功勤者言功三官：敦煌本作「有勤谒功仙官，便起，东向三上香，咒曰」。 无后文「次三捻上香」五字。 #83初捻上香：敦煌本作「烧香」。 #84臣今故立直二捻上香：敦煌本作「次又三捻香，咒曰： 臣今故烧香」。 下文「三捻上香」同此例。 #85令臣速得仙道及九亲姻族：原本作「令臣得仙道，友九种姻亲。 」据敦煌本改。 #86敦煌本此句作「开启上香愿念毕，东向九拜，言曰」。 #87敦煌本无「太上灵宝」四字。 后文西方、北方等天尊名号，敦煌本亦无「太上灵宝」四字。 #88引咎自克：原误「引求自克」，据敦煌本改。 按后文中「引求自克」句，均据此例改，不复出校。",
      "translated_text": "In the Dunhuang manuscripts, following the phrases *\"Supervisors of the Ritual Fast, Attending Incense Golden Lads, and Flower-Scattering Jade Maidens,\"* the text includes *\"thirty-two persons\"* in each instance.\n\nThe character *\"et cetera\"* is supplied according to the Dunhuang manuscripts. The character *\"petition\"* is likewise supplied. *\"Emperors, kings, and lords of states\"* appears as *\"emperors, lords, and kings\"* in the Dunhuang manuscripts, and this convention is maintained throughout without further annotation. *\"Rulers, officials, and common folk\"* appears as *\"rulers, ministers, officials, and common folk\"* in the Dunhuang manuscripts, and this is likewise followed in most subsequent instances without further annotation.\n\nIn the Dunhuang manuscripts, the petitionary invocations often replace *\"so-and-so\"* with *\"Jia.\"* The term *\"take refuge\"* appears as *\"return to refuge\"* in the Dunhuang manuscripts. Hereafter, wherever *\"take refuge,\"* *\"submit one’s life,\"* or similar phrases appear, the Dunhuang manuscripts uniformly render them as *\"return to refuge,\"* *\"return one’s life,\"* or *\"return one’s spirit,\"* and no further annotations will be provided.\n\nFrom *\"Now, therefore, we establish this ritual fast...\"* to *\"unite with the Dao and merge with the True,\"* the Dunhuang manuscripts abbreviate the entire petitionary invocation of over one hundred and fifty characters to *\"May the above dharma be remembered with devotion.\"* This convention is maintained in subsequent passages without further annotation.\n\nThe three sections of scripture beginning with *\"Next, bow once toward the southeast\"* are condensed in the Dunhuang manuscripts as follows: *\"Next, bow once toward the southeast, then the southwest, then the northwest—each of the four directions—with nine prostrations, nine bows touching the forehead to the ground, and nine invocations of submission, all performed in the same manner as for the northeast.\"*\n\n*\"Next, face the upper direction\"* appears as *\"After the four directions are completed, next face the northwest upper direction\"* in the Dunhuang manuscripts. *\"Next, face the lower direction\"* appears as *\"next face the southeast lower direction.\"*\n\n*\"Ninefold Walled Earthly Sovereigns\"* appears as *\"Ninefold Earthly Jade Sovereigns\"* in the Dunhuang manuscripts. *\"Military incursions\"* was originally *\"military epidemics\"* and has been emended according to the Dunhuang manuscripts. *\"Expounds\"* appears as *\"states the expounded\"* in the Dunhuang manuscripts. *\"Diseases and rashes\"* appears as *\"disasters and illnesses\"* in the Dunhuang manuscripts, which is more accurate.\n\nThe Dunhuang manuscripts omit the phrase *\"burn incense.\"* *\"Activate the incense burner\"* appears as *\"declare, saying\"* in the Dunhuang manuscripts. The Dunhuang manuscripts omit the phrase *\"next, activate the incense burner.\"* *\"The Attending Incense Golden Lads transmit the words of the Flower-Scattering Jade Maidens\"* appears as *\"the Attending Incense Jade Lads and Attending Incense Jade Maidens\"* in the Dunhuang manuscripts.\n\nThe Dunhuang manuscripts omit the phrase *\"next, each recites their dharma rank.\"* *\"Your servant, so-and-so\"* appears as *\"Wang Jia\"* in the Dunhuang manuscripts, and this convention is maintained throughout. The Dunhuang manuscripts omit the phrase *\"Most High Lord Lao.\"*\n\n*\"Encounter\"* appears as *\"fall upon\"* in the Dunhuang manuscripts. *\"Perfected True\"* appears as *\"Highest True\"* in the Dunhuang manuscripts. In the Dunhuang manuscripts, the character *\"servant\"* is followed by a small-character annotation: *\"of the Dao’s lineage and virtue.\"* The character *\"body\"* is followed by the annotation *\"later learners need only say\"* in the Dunhuang manuscripts.\n\n*\"Submit one’s life\"* appears as *\"offer one’s body and life\"* in the Dunhuang manuscripts. *\"Disasters and illnesses\"* appears as *\"perils and disasters\"* in the Dunhuang manuscripts. *\"One fears that emperors may receive the heavenly mandate to abdicate\"* appears as *\"truly, as emperors receive the heavenly fortune\"* in the Dunhuang manuscripts.\n\n*\"Incomplete\"* appears as *\"unable\"* in the Dunhuang manuscripts. *\"No songs are sung on the road, and voices are stifled\"* appears as *\"no grace is sung, and voices are stifled on the road\"* in the Dunhuang manuscripts, with the subsequent *\"thus\"* rendered as *\"thereby.\"*\n\nFollowing the phrases *\"Supervisors of the Ritual Fast, Attending Incense Golden Lads, and Flower-Scattering Jade Maidens,\"* the Dunhuang manuscripts include *\"thirty-two persons\"* in each instance.\n\n*\"Those with meritorious service report their merits to the Three Officials\"* appears as *\"Those with diligent service petition the Transcendent Officials; then rise, face east, offer incense three times, and recite the incantation\"* in the Dunhuang manuscripts, which omits the subsequent phrase *\"next, take three pinches of incense.\"*\n\n*\"First pinch of incense\"* appears as *\"burn incense\"* in the Dunhuang manuscripts. *\"Now, therefore, your servant establishes this and takes a second pinch of incense\"* appears as *\"Next, take three more pinches of incense and recite the incantation: Now, therefore, your servant burns this incense\"* in the Dunhuang manuscripts, and this convention is maintained for *\"third pinch of incense.\"*\n\n*\"May your servant swiftly attain the Dao of immortality, along with nine generations of kin\"* was originally *\"May your servant attain the Dao of immortality and befriend nine kinds of relatives,\"* and has been emended according to the Dunhuang manuscripts.\n\nThis sentence in the Dunhuang manuscripts reads: *\"After the invocation for the offering of incense is completed, face east, bow nine times, and declare.\"* The Dunhuang manuscripts omit the phrase *\"Most High Numinous Treasure.\"* In subsequent passages, the names of the Heavenly Worthies of the West, North, and other directions likewise omit *\"Most High Numinous Treasure\"* in the Dunhuang manuscripts.\n\n*\"Acknowledge faults and self-discipline\"* was mistakenly written as *\"seek and self-discipline,\"* and has been emended according to the Dunhuang manuscripts. Hereafter, all instances of *\"seek and self-discipline\"* are emended accordingly without further annotation.",
      "overlap_context": "short, and they will be conscripted into laborious servitude. Their descendants will suffer poverty and hardship, and their families will be scattered and ruined.\n\nAccording to the manuscript P.2406, this passage begins here, preceded by the title *\"Ritual Ordinances of the Supreme Pervasive Mystery Numinous Treasure Scripture of Illuminating the True.\"* Manuscript P.2442 omits this title. The ritual implements shall be nine feet in height, and all procedures must follow the established methods.",
      "start_char": 16887,
      "end_char": 18075,
      "start_sentence": 479,
      "end_sentence": 530,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 27.561556339263916,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝长夜之府九幽玉匮明真科.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 19,
      "original_text": "#89「毕便解巾」四字据敦煌本补。 #90按敦煌本以下各节祈愿词，均有大段省略，仅保留归命诸方天尊神人文句，其余文字则省作「愿如上法」。 不复详校。 #91「愿毕」二字据敦煌本补。 后文皆同此例。 #92上方无极太上灵宝天尊：敦煌本作「卅二天无极灵宝天尊」。 #93按敦煌本「次旋行三匝诵步虚灵章次复炉」等句，改作「十方愿念礼谢都毕，当旋行三匝，绕香灯，口诵步虚洞章竟，还东向，咒曰」。 凡二十八字。 #94「日」字据敦煌本补。",
      "translated_text": "#89 The four characters *\"then remove the headscarf\"* are supplemented according to the Dunhuang manuscripts.\n\n#90 According to the Dunhuang manuscripts, the following sections of supplicatory invocations are heavily abridged, retaining only the phrases addressing the Heavenly Worthies and deities of all directions, while the remaining text is condensed to *\"as in the above method.\"* No further detailed collation is provided.\n\n#91 The two characters *\"when the invocation is complete\"* are supplemented according to the Dunhuang manuscripts. The same applies to subsequent passages.\n\n#92 *\"Most High Numinous Treasure Heavenly Worthy of the Upper Realm of the Boundless\"*: The Dunhuang manuscripts read *\"Numinous Treasure Heavenly Worthy of the Thirty-Two Heavens of the Boundless.\"*\n\n#93 According to the Dunhuang manuscripts, the passage *\"next circumambulate three times while reciting the 'Lingzhang of Pacing the Void,' then return to the incense burner\"* is emended to read: *\"When the invocations and obeisances to the ten directions are complete, circumambulate three times, encircle the incense and lamps, recite aloud the 'Dongzhang of Pacing the Void,' then face east again and intone the incantation.\"* This comprises twenty-eight characters in total.\n\n#94 The character *\"sun\"* is supplemented according to the Dunhuang manuscripts.",
      "overlap_context": "scripts omit the phrase *\"Most High Numinous Treasure.\"* In subsequent passages, the names of the Heavenly Worthies of the West, North, and other directions likewise omit *\"Most High Numinous Treasure\"* in the Dunhuang manuscripts.\n\n*\"Acknowledge faults and self-discipline\"* was mistakenly written as *\"seek and self-discipline,\"* and has been emended according to the Dunhuang manuscripts. Hereafter, all instances of *\"seek and self-discipline\"* are emended accordingly without further annotation.",
      "start_char": 18076,
      "end_char": 18299,
      "start_sentence": 531,
      "end_sentence": 539,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.187976598739624,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝长夜之府九幽玉匮明真科.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 20,
      "original_text": "#95周度：原作「用度」，据敦煌本改。 #96尺数：敦煌本作「丈数」。 #97「当」字据敦煌本补。 按敦煌本与《道藏》 本文字异处较以上所列更多，不能一一列举。",
      "translated_text": "#95 *\"Circumference\"*: Originally written as *\"expenditure,\"* emended according to the Dunhuang manuscripts.\n\n#96 *\"Measurement in chi\"*: The Dunhuang manuscripts read *\"measurement in zhang.\"*\n\n#97 The character *\"should\"* is supplemented according to the Dunhuang manuscripts.\n\nThe Dunhuang manuscripts and the *Daoist Canon* versions differ in more places than those listed above, and these cannot be enumerated one by one.",
      "overlap_context": "t circumambulate three times while reciting the 'Lingzhang of Pacing the Void,' then return to the incense burner\"* is emended to read: *\"When the invocations and obeisances to the ten directions are complete, circumambulate three times, encircle the incense and lamps, recite aloud the 'Dongzhang of Pacing the Void,' then face east again and intone the incantation.\"* This comprises twenty-eight characters in total.\n\n#94 The character *\"sun\"* is supplemented according to the Dunhuang manuscripts.",
      "start_char": 18300,
      "end_char": 18385,
      "start_sentence": 540,
      "end_sentence": 543,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 3.4063024520874023,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝长夜之府九幽玉匮明真科.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}