{
  "source_id": "洞真太上三九素语玉清真诀",
  "source_file": "chunked_daozang\\洞真太上三九素语玉清真诀.json",
  "total_chunks": 4,
  "total_original_chars": 4527,
  "total_translated_chars": 30847,
  "total_translation_time": 145.64161491394043,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\洞真太上三九素语玉清真诀.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Wondrous Scripture of the Three Nines and Jade Essence from the Supreme Cavern of Perfection**\n\n**Scripture Title:** *The Wondrous Scripture of the Three Nines and Jade Essence from the Supreme Cavern of Perfection*\n**Author:** Unknown, approximately dated to the Eastern Jin dynasty. A foundational scripture of the early Shangqing tradition.\n\n**The Wondrous Oral Formula of the Three Nines and Jade Essence**\n\nOn the auspicious celestial stem day of the first year of the *shangyuan* era, at the hour of the northern quadrant, when the Three Origins aligned in radiance and the Nine Emperors returned to perfection, the Nine Heavens’ Venerable One and the Three Heavens’ Jade Lads ascended the Jade Pavilion of the Lofty Heights, the Purple Void Heaven. There, the *Three Nines Oral Formula* was revealed, unlocking the numinous barrier, and the *Jade Essence True Formula* was bestowed—governing destiny for eternal preservation. Its revelation illuminated the distant expanse, its clarity as pure as the rustling wind, its jade tones resounding through the void, its jasper melodies soaring beyond the heavens. Fragrant winds stirred without cease, and wisdom’s chant echoed into the farthest reaches. Its fragrance suffused the depths of the visage, its qi outstripped the divine gales. The Jade Tablet commanded all, and the myriad immortals came to pay homage. This was the wondrous transformation of primordial mystery, enduring through ten thousand kalpas without decay. The true formula was recorded to bequeath to the worthy, testing the sincerity of those who seek with diligence.\n\nShould one’s golden name be *Eastern Radiance* and one’s verdant appellation *Purple Court*, upon receiving this wondrous scripture, one ascends to the Jade Clarity Heaven. The Three Passes unlock their mechanism, the Nine Portals receive the numinous, and the visage assumes a golden countenance. The Five Viscera flourish in splendor, the golden perfection is felt in harmony, and the boundless is illuminated with clarity. The divine candle shines in hidden radiance, the treasure-light is born in the night. Molten gold is cast in exchange, and the flaming bells blaze forth. With a whistle, the command is instantly fulfilled, and the divine soldiers are marshaled. The Three Origins journey to the chamber, descending in a jade-green chariot. Riding the void, soaring through emptiness, one ascends to the Supreme Clarity.\n\nThe Most Exalted Azure Lad said: The *Three Nines Oral Formula* originates from the incantations of the Nine Emperors and the Three Perfected, governing qi to prolong the years and unlocking the numinous barrier to freshen the Five Viscera.\n\nYou possess jade bones and have beheld this text. Receive it in secret, swear a luminous oath, and pledge your faith to the Nine Heavens. Cultivate this Dao in seclusion. Guard against reckless transmission; to reveal it to the unworthy is to invite calamity upon yourself—not merely the wind’s blade, but misfortune extending to the Seven Mysteries. Be vigilant in celestial law, seeking the true Dao. After nine years of unwavering practice, you shall attain the rank of Supreme Immortal.\n\nThe formula was transmitted simultaneously by the Nine Heavens’ Venerable One and the Three Heavens’ Jade Lads to the Supreme Thearch, the Celestial Thearch, and the Thearch of the Grand Tenuity. The Supreme Thearch transmitted it to the Lord of the Upper Prime of the Southern Culmen; the Celestial Thearch transmitted it to the Queen Mother of the West; the Thearch of the Grand Tenuity transmitted it to the Sacred Lord of the Golden Portal. The Sacred Lord of the Golden Portal transmitted it to the Most Exalted Azure Lad, who in turn transmitted it to the Lord of the Western City, entrusting it to later disciples destined to become Perfected. The lineage of transmission, bound by true qi, traces back to the imperial scripture. By the time of the Lord of the Western City, over seven thousand kalpas had passed. Thereafter, the Lord of the Western City sealed the numinous text within the jade chamber of the western cavern of Mount Wangwu, where the officials of the Plain Spirit attended to its incense and guarded its scripture.\n\nThis Dao is profoundly wondrous and not disseminated in the world. Should one of mysterious destiny encounter this text, the myriad immortals shall come to pay homage, and celestial officials shall guard one’s person. Through diligent practice and arduous contemplation, one shall ascend at dawn.\n\nFor those who receive the wondrous chapters of the Three Treasures of the Supreme Clarity’s Dao and Virtue, practicing the Way of pacing the void to ascend the mystery, yet do not first release the Five Viscera and open the hidden barriers, their myriad qi will not be stabilized, and their true numen will not rejoice. Their diligent efforts shall be in vain, and they shall never attain immortality.\n\nNow, this *Jade Formula*, the wondrous words of the Supreme Thearch, is transmitted to later disciples. Guard it in secrecy and revere the true. Beware of careless transmission, lest calamity befall you.\n\nOn the day of your life-destiny, bathe and enter the chamber. Face east, knock your teeth nine times, and with eyes closed, visualize the Nine Numinous Perfected of the Eastern Azure Thearch and Lesser Yang, whose taboo name is *Jushangsheng*. He is nine inches tall, wears a Nine Origins crown, and is clad in a single-layered azure flying skirt. In his hand, he holds a jade tablet of azure essence, riding a flying chariot of azure clouds, accompanied by twelve Jade Maidens of the Azure Cassia. They descend from the Palace of Celestial Clarity and Yang. Visualize the azure cloud crown covering your body.\n\nImagine the Nine Numinous Perfected riding the cloud-qi into your body, settling and stabilizing your liver. Then, call thrice upon the Nine Numinous Perfected of Lesser Yang, *Jushangsheng*, beseeching him to bestow the five essences of azure mushrooms to nourish your body. Then, taste thrice and swallow three times. Look upward and recite the incantation:\n\n*\"Vast and numinous Azure Origin, Master of Lesser Yang,\nNine qi return to the liver, pacifying the po soul.\nThe hidden palace knots in splendor, the viscera’s interior gleams bright.\nRefine the countenance, strengthen the body, reverse white to azure.\nThe divine transformation arises within, the radiance ascends to the Purple Court.\nShould any dare transgress, be shattered by the flaming bells.\nInscribed in the Jade Record of the Supreme Thearch, the name is recorded in the Grand Clarity.\"*\n\nConclude by drawing in qi and swallowing nine times.\n\nFace due south, close your eyes, and knock your teeth three times. Visualize the Perfected of the Southern Culmen and Greater Yang of the Southern Crimson Thearch, whose taboo name is *Rongshangsheng*. He is three inches tall, wears a *Jinxian* crown, and is clad in a robe of woven patterns. In his hand, he holds a vermilion jade tablet, riding a flying chariot of crimson clouds, accompanied by twelve Jade Maidens of the Crimson Cassia. They descend from the Palace of the Orchid Terrace. Visualize the crimson cloud chariot covering your body.\n\nImagine the Perfected of the Southern Culmen and Greater Yang riding the cloud-qi into your body, settling and stabilizing your heart. Then, call thrice upon the Perfected of the Southern Culmen and Greater Yang, *Rongshangsheng*, beseeching him to bestow the jade essence of cinnabar mushrooms to nourish your body. Then, taste thrice and swallow three times. Look upward and recite the incantation:\n\n*\"Crimson Court of scarlet clouds, above dwell the exalted Perfected.\nThree qi return to the heart, this is my cinnabar origin.\nExalt my pure body, ascend directly to make report.\nThe heart is stabilized, the spirit is tranquil, the Nine Numinous seal the barrier.\nGolden perfection shines within, purple mist knots into clouds.\nInscribed in the verdant script of the Grand Tenuity, the name is written as divine immortal.\nSoaring to the Supreme Clarity, I pay homage to the Imperial Honored One.\"*\n\nConclude by drawing in qi and swallowing three times.\n\nFace due west, close your eyes, and knock your teeth seven times. Visualize the Plain Numinous Perfected of the Western White Thearch and Lesser Yin, whose taboo name is *Rumingzi*. He is seven inches tall, wears a dark jade crown, and is clad in a robe of plain brocade. In his hand, he holds a plain jade tablet, riding a flying chariot of white clouds, accompanied by twelve Jade Maidens of the Plain Spirit. They descend from the Palace of the Celestial August Hall. Visualize the plain cloud crown covering your body.\n\nVisualize the Plain Numinous Perfected riding clouds and qi into my body, settling and stabilizing within my chest. Then call three times upon the Lesser Yin Plain Numinous Perfected *Rumingzi*, beseeching him to bestow the great zhi-fungus and jade essence to nourish my body. Then savor three times and swallow three times. Look upward and recite the incantation:\n\n*\"Plain Origin, cavernous emptiness,\nCelestial Perfected’s divine abode.\nSeven qi guard the chest,\nDwelling with the spirit as one.\nPreserve and refine the five viscera,\nContaining blossoms and lustrous zhi.\nLimpid sincerity, luminous stone,\nRoaming and ascending the mysterious void.\nWhite jade, golden script,\nNine Emperors’ true writ.\nLet me become a flying immortal,\nShedding the name of death.\nRoam the Three Caverns of Clarity,\nFreely as my heart desires.\"*\n\nConclude by drawing in qi and swallowing seven times.\n\nFace due north, close your eyes, and knock your teeth five times. Visualize the Northern Black Thearch’s Greater Yin Mysterious Numinous Perfected, whose taboo name is *Mingxuanmo*. He is five inches tall, wears a dark crown, and is clad in a robe of dark cloud brocade. In his hand, he holds a tablet of mysterious essence jade, riding a flying chariot of dark clouds, accompanied by twelve Jade Maidens of the Greater Mystery. They descend from the Palace of the Celestial Mysterious Yin Jade Void. Visualize the dark cloud crown covering your body.\n\nVisualize the Greater Yin Mysterious Numinous Perfected riding clouds into my body, settling and stabilizing within my kidneys. Then call three times upon the Greater Yin Mysterious Numinous Perfected *Mingxuanmo*, beseeching him to bestow the dark zhi-fungus and jade essence to nourish my body. Then savor three times and swallow three times. Look upward and recite the incantation:\n\n*\"Mysterious Origin of the Northern Ultimate,\nSupreme Numinous Pivot.\nFive qi defend the kidneys,\nTortoise and jade interlock.\nPrecious blossoms weave the network,\nThe stomach-viscus shines forth.\nThe spirit’s name is Jade Terrace,\nYears equal the Two Modes.\nSupreme August Thearch of High Antiquity,\nSteadfast and unconfused.\nCommand the Six Jia,\nSummon the Eight Might.\nRide the three dragons’ chariot aloft,\nTranscending to ascend and fly.\nInhaling and exhaling divine zhi,\nEnduring through kalpas without decline.\"*\n\nConclude by drawing in qi and swallowing five times.\n\nFace the direction of your natal destiny, close your eyes, and knock your teeth twelve times. Visualize the Central Yellow Thearch’s Prime Origin Threefold Numinous Perfected, whose taboo name is *Yuanhua*. He is one inch and two fen tall, wears a crown of yellow dawn jade, and is clad in a flying skirt of yellow brocade. In his hand, he holds a tablet of yellow essence jade, riding a flying chariot of yellow clouds, accompanied by twelve Jade Maidens of the Central Yellow Thearch. They descend from the Palace of the Celestial Jade Chamber. Visualize the yellow cloud covering your crown.\n\nVisualize the Threefold Numinous Perfected riding clouds into my body, settling and stabilizing within my spleen. Then call three times upon the Prime Origin Threefold Numinous Perfected *Yuanhua*, beseeching him to bestow the yellow essence jade zhi to nourish my body. Then savor three times and swallow three times. Look upward and recant the incantation:\n\n*\"Yellow Origin, Central Thearch,\nSpirit of my natal destiny.\nOne qi attends the spleen,\nEnabling me to attain the true.\nThe solid viscus engenders blossoms,\nWeaving the network of purple dawn.\nTransforming the countenance through refinement,\nPreserving life and prolonging years.\nInclining toward things yet unshaken,\nA thousand spirits come to serve.\nThe Elder Lord’s mysterious register,\nInscribes the name of divine immortal.\nLong life and enduring vision,\nCoexisting with heaven.\"*\n\nConclude by drawing in qi and swallowing twelve times.\n\nReturn to face the east, close your eyes, and knock your teeth thirty-six times. Visualize the Five Qi Jade Clarity High August Supreme Treasure Perfected, whose taboo name is *Taixu*. He is three inches tall, wears a crown of jade dawn, and is clad in a seamless robe of five colors. In his left hand, he holds the essence of the sun; in his right, the light of the moon. He stabilizes my upper mansion, the Muddy Pellet Palace.\n\nCall three times upon the Supreme Treasure Perfected *Taixu*, beseeching him to bestow the flowing essence of the five qi to refine and irrigate my body. Then savor five times and swallow five times. Look upward and recite the incantation:\n\n*\"High August Perfected Sovereign,\nFive Thearchs’ great numen.\nPreserve my Muddy Pellet,\nMysteriously reflecting the five forms.\nThree luminaries shine brightly,\nSun and moon penetratingly clear.\nFlying clouds, flowing rosy clouds,\nInfusing and irrigating jade essence.\nRefining the countenance, preserving the po,\nSpirit and soul spontaneously born.\nA thousand transformations, myriad changes,\nAscending into the Purple Court.\"*\n\nConclude by drawing in qi and swallowing five times.\n\nWhen the incantations for the five directions are complete, rub your palms together and wipe your face and eyes.\n\nAfter five years of such practice, your face and hair will take on a golden countenance, the five viscera will blossom with splendor, the jade viscus will preserve qi, and the Dao of divine immortality will be achieved. The Three Palaces will feel harmonious and unobstructed, the true numina will manifest their forms, and you will ride the void and ascend into emptiness, ascending to heaven in broad daylight. This depends solely on secret cultivation; guard it carefully and do not transmit it lightly.\n\n**Method of Presenting Memorials on the Eight Nodal Days**\n\nFor those who cultivate the above method, recite the Dao ten thousand times, hoping to attain numinosity and realize the divine, seeking to become a divine immortal: on the days of the eight nodes, present a memorial to the numinous mountain of your natal destiny, submitting it to the Jade Clarity. After three years without fail, your name will be inscribed in the Azure Palace, your memorial tied to the Jade August One, with jade blossoms as attendants and golden dawn to receive you.\n\nThis is the true formula of Jade Clarity, the precious scripture of the Thearch-Lord. Whoever obtains this formula will ascend as an immortal in a calculated number of days. To recklessly divulge the divine text is to invite judgment upon the Nine Mysteries: the body will perish, the form will be destroyed, and one will be eternally sealed in the River Source. This depends solely on secret cultivation; the Dao does not speak falsely.\n\nOn the day of the Summer Solstice, at the peak of your natal destiny mountain, face due south, knock your teeth thirty-two times, and look upward to softly recite the incantation:\n\n*\"Mysterious essence, yang brightness,\nPrime Origin Thearch’s numen.\nFour scenes, eight qi,\nWeaving the warp and weft of heaven’s scripture.\nWhite Origin sheds death,\nFlourishing Hero infuses life.\nPresent the memorial to the numinous mountain,\nRecorded and heard in Jade Clarity.\nHigh August Thearch,\nInscribe the true name of the first celestial stem.\nAwaiting the imperial audience,\nBody to pay homage in the Purple Court.\nThe Three Offices and Nine Bureaus,\nNone will disobey or fail to heed.\"*\n\nConclude by swallowing qi nine times. Then face north, kneel, and read the memorial, reciting the incantation as per the subsequent method before burying the memorial atop a sheer cliff.\n\nOn the day of the Autumnal Equinox, at the peak, face due west, knock your teeth thirty-two times, and look upward to softly recite the incantation:\n\n*\"Flowing flames, fourfold radiance,\nFlying scenes illuminate the dawn.\nEight qi intermingle and shine,\nFalling together with heaven’s scripture.\nPrime Origin announces the morning,\nResponding above to the Thearch’s numen.\nPresent the memorial to the numinous mountain,\nEastern Florescence records the name.\nLong preserve the mysterious chamber,\nFeasting in the Purple Court.\nThe Three Palaces and Nine Bureaus,\nList me among the long-lived.\nCoexisting with heaven,\nEternally preserving yellow tranquility.\"*\n\nConclude by swallowing qi nine times. Then face north, kneel, and read the memorial, reciting the incantation as per the subsequent method before burying the memorial. On the day of the Autumnal Equinox, at the peak, face due west, knock your teeth thirty-two times, and look upward to softly recite the incantation:\n\nAt the Minor Yin’s announcement of the mandate,\nThe Eight Ways unfold,\nThe Two Images turn in harmony,\nWeaving the celestial beams.\nThe Prime Origin reins in rectitude,\nAligning with the four quarters.\nPresent the memorial to the Mysterious Peak,\nThat it may ascend to the Jade Capital’s summit,\nTo the Highest Thearch and Lofty Honored One.\nRecord the name in the Hall of No-Blossoms,\nThe Three Offices strike off death,\nThe Nine Bureaus prosper in accord.\nFrom this moment forth,\nThe Three Realms’ overseers shall welcome me,\nRiding the void, steering the mists,\nSoaring through the Great Empyrean.\n\nConclude by swallowing qi nine times. Then face north, kneel, and read the memorial, reciting the incantation as per the subsequent method before burying the memorial.\n\nOn the day of the Beginning of Winter, at the peak, face northwest, knock your teeth thirty-two times, and look upward to softly recite the incantation:\nDark Yin governs the dawn,\nThe Four Movements revolve heaven,\nEight qi intermingle and traverse,\nThree and Five cycle in return.\nThe Thearch announces the mandate,\nMother Auspice inaugurates the morning.\nPresent the name to the Azure Palace,\nTo be enrolled as an imperial minister above,\nReceiving heaven’s decree and obeying the mandate,\nPaying homage to the Jade Dawn.\nStrike off death in the Northern Feng,\nRecord the name in the Southern Palace.\n\nConclude by swallowing qi nine times. Then face north, kneel, and read the memorial, reciting the incantation as per the subsequent method before burying the memorial.\n\nOn the day of the Winter Solstice, at the peak, face north, knock your teeth thirty-two times, and look upward to softly recite the incantation:\nYin essence spurs qi,\nThe northern dawn rides the dark,\nThe Two Radiances intertwine,\nTraversing the celestial scripture.\nThe Nine Thearchs move in unison,\nIlluminating the true name.\nPresent the memorial to ascend,\nRecord the covenant in the Jade Court.\nThe Five Peaks and Three Offices\nAll affirm my life,\nSharing the sun’s radiance,\nSharing heaven’s tranquility.\n\nConclude by swallowing qi nine times. Kneel and read the memorial, reciting the incantation as per the subsequent method before burying the memorial.\n\nOn the day of the Beginning of Spring, at the peak, face northeast, knock your teeth thirty-two times, and look upward to softly recite the incantation:\nYang essence heralds the beginning,\nMysterious qi pierces the dawn,\nThe Two Movements intermingle and shine,\nThree and Five revert to truth.\nThe Thearch bears a mandate,\nAnnouncing to me the numinous scripture.\nSubmit the memorial to the Numinous Peak,\nEternally preserving the flying immortal.\nThe Three Offices and Nine Bureaus\nPass me through the river sources,\nMy name enrolled in the imperial register,\nEver to be a jade guest.\n\nConclude by swallowing qi nine times. Then face north, kneel, and read the memorial, reciting the incantation as per the subsequent method before burying the memorial.\n\nOn the day of the Spring Equinox, at the peak, face east, knock your teeth thirty-two times, and look upward to softly recite the incantation:\nHeaven clears, qi spreads,\nVast purity flows azure,\nRiding the firm to govern the dawn,\nRevolving through the Five Stars.\nThe Yellow Register illumines the soul,\nEastern Florescence preserves life.\nLong enjoy the boundless,\nFor aeons commencing longevity.\nPresent the memorial to the Jade Gate,\nThe Northern Thearch records the name,\nWandering through the Mysterious Terrace,\nFloating radiance in the Purple Clarity.\n\nConclude by swallowing qi nine times. Then face north, kneel, and read the memorial, reciting the incantation as per the subsequent method before burying the memorial.\n\nIn the month of the Beginning of Summer, at the peak, face southeast, knock your teeth thirty-two times, and look upward to softly recite the incantation:\nEight qi bind and interlace,\nOrdering positions to pity heaven,\nFive revolutions, seven turns,\nTransformations suddenly heard.\nThrice refined, nine times tested,\nAltering countenance and renewing years,\nCrossing radiance without delay,\nEternally preserving the highest immortal.\n\nConclude by swallowing qi nine times. Then face north, kneel, and read the memorial, reciting the incantation as per the subsequent method before burying the memorial.\n\nThe Highest Purple Void Jade Thearch, Great Cavern Three Radiance Disciple, Master of the Sacred Peak, Wang of such-and-such a district, aged so-and-so, styled such-and-such, born in such-and-such a month, having undergone the Three Trials, is to serve as an imperial minister. Respectfully petition the true spirits of the Five Peaks and numinous mountains, the Three Offices, Nine Bureaus, and Twelve River Sources to record my mysterious name and submit it to the Jade Clarity above.\n\nInscribe this in vermilion on a silver slip, face north to read the slip, then bury it beneath the Mysterious Crag, ensuring no one learns of it.\n\nFace north, bow twice, kneel, and read the memorial to its conclusion. Then knock your teeth nine times and softly recite the incantation:\nPrime Origin Thearch Sovereign,\nHighest Jade Perfected,\nGolden Immortal Father and Mother,\nJade Florescence and Purple Dawn,\nOverseers of the myriad qi,\nSupervisors of the perfected and leaders of immortals,\nExaminers of the Azure Palace,\nNuminous spirits bearing the talismanic mandate,\nInspectors of the registers and records,\nPresenting them before the Thearch,\nRespectfully petition the Nine Bureaus,\nThe Three Offices and River Sources,\nTo pass my name into the Jade Register,\nEternally preserving long life.\n\nConclude and bury the memorial.\n\nThese are the plain words and wondrous secrets of the Thearch Lord, transmitted only to those of bone predestined for immortality. At each seasonal node, perform the above method, ensuring that over three years, twenty-four memorial slips are submitted to the numinous peaks. Then the True Thearch shall inscribe the name, and the Thearch shall grant twelve jade boys and twelve jade maidens. To lightly divulge this precious secret is to invite the annihilation of oneself and one’s descendants. Be clear and cautious in the mysterious statutes, guarding and practicing them in secret.\n\n**Thearch Lord’s Jade Scripture: Divine Ruling Upper Method**\n\n**Jade Essence Oral Instructions:**\nShould you wish to conceal and study,\nPurify and fast upon the mountains.\nOn a *ren* or *gui* day,\nCarve a green stone and inscribe in black the Nine Heavens’ Jade Scripture,\nBurying it in the east of your dwelling.\nAt the moment of burial, face east, knock your teeth nine times, and recite the incantation:\nGreen Humiliation, Green Humiliation,\nSacred Peak of Mount Tai,\nNine qi’s numinous essence,\nLong forests and deep darkness,\nThree Fields of indigo waves,\nFour legs and six eyes,\nAbodes of the highest perfected,\nUniversally proclaimed to the four domains.\nThe thousand spirits and myriad essences,\nNone dare disobey.\nThe Jade Thearch bears a mandate,\nThose who violate shall be punished by execution.\n\nConclude and bury the stone nine feet deep.\n\nThis is the Thearch Lord’s Jade Scripture: Divine Ruling Upper Method. The text is as follows:\nThe Heavenly Thearch Lord received the Nine Heavens’ Jade Scripture from the Nine Heavens’ Venerable One, inscribed in black on green stone to be buried in the east of the dwelling peak, subduing the myriad demons and summoning perfected immortals and true persons to appear, with jade maidens guarding the form. Guard this secret and do not transmit it.\n\n**Jade Essence Oral Instructions:**\nOn a *jia* or *yi* day,\nCarve a red stone and inscribe in blue-green the Nine Heavens’ Jade Scripture,\nBurying it in the south of the dwelling peak.\nAt the moment of burial, face south, knock your teeth nine times, and recite the incantation:\nVermilion Yang essence,\nSouthern Huo’s myriad spirits,\nLush and verdant, nurturing the whirlwind,\nRiding the dark to enter the obscure,\nThe Thearch’s palace holds its position,\nFloating life in yellow tranquility.\nFrom heaven downward,\nNone dare disobey.\nThose who violate shall be executed,\nThose who offend shall be punished.\n\nConclude and bury the stone nine feet deep.\n\nThis is the Thearch Lord’s Jade Scripture: Divine Ruling Upper Method. The text is as follows:\nThe Heavenly Thearch Lord received the Nine Heavens’ Jade Scripture from the Nine Heavens’ Venerable One, inscribed in blue-green on red stone to be buried in the south of the dwelling peak, subduing the myriad demons and summoning perfected immortals and true persons to appear, with jade maidens guarding the form. Attain the Jade Essence True Instructions, ascend to heaven in broad daylight. Guard this secret and do not transmit it.\n\nThe Jade Essence Instructions state: On a *wu-ji* day, carve white stone and inscribe the Nine Heavens’ Jade Scripture in yellow, to be buried in the west of the dwelling peak. At the moment of burial, face west and knock the teeth nine times, reciting the incantation:\n\n*\"White radiance weaves the net,\nPristine spirits dwell in the dark expanse,\nThe myriad essences of the Western Peak,\nRiding qi upon surging waves,\nThe Primordial Beginning issues the decree,\nCommanding the Three Florets,\nThe Four Quarters and Eight Qi,\nAll become my domain.\nThose who violate shall be beheaded,\nThose who offend shall be punished.\"*\n\nConclude and bury the stone nine feet deep.\n\nThis is the Thearch Lord’s Jade Scripture: Divine Ruling Upper Method. The text is as follows:\nThe Heavenly Thearch Lord received the Nine Heavens’ Jade Scripture from the Nine Heavens’ Venerable One, inscribed in yellow on white stone to be buried in the west of the dwelling peak, subduing the myriad demons and summoning perfected immortals and true persons to appear, with jade maidens guarding the body. The Jade Scripture shall illuminate itself, and one shall ascend to heaven in broad daylight. Guard this secret and do not transmit it.\n\nThe Jade Essence Instructions state: On a *geng-xin* day, carve black stone and inscribe the Nine Heavens’ Jade Scripture in white, to be buried in the north of the dwelling peak. At the moment of burial, face north and knock the teeth nine times, reciting the incantation:\n\n*\"The Northern Peak of Hengshan,\nEssence of the Star of Dawn,\nDark shade and black specks,\nHarmonizing qi to release numinous power,\nThe Thearch issues the decree,\nThe Jade Scripture governs life,\nThe Three Paths display their might,\nTheir dominion is not trifling.\nAll should obey the command,\nRestore your true form.\"*\n\nConclude and bury the stone nine feet deep.\n\nThis is the Thearch Lord’s Jade Scripture: Divine Ruling Upper Method. The text is as follows:\nThe Heavenly Thearch Lord received the Nine Heavens’ Jade Scripture from the Nine Heavens’ Venerable One, inscribed in white on black stone to be buried in the north of the dwelling peak, subduing the myriad demons and summoning perfected immortals and true persons to appear, with jade maidens guarding the form. The true instructions shall illuminate themselves, and one shall ascend to heaven in broad daylight. Hold this secret and do not transmit it.\n\nThe Jade Essence Instructions state: On a *bing-ding* day, carve yellow stone and inscribe the Nine Heavens’ Jade Scripture in red, to be buried at the center of the dwelling peak. At the moment of burial, face your life-destiny direction and knock the teeth nine times, reciting the incantation:\n\n*\"Yellow qi and dark Song Peak,\nGoverning the Five Directions,\nRiding the primordial destiny above,\nSubduing the demon kings,\nA thousand soldiers and a hundred aides,\nConspire with demons in malice,\nThe One Thearch’s numinous power,\nReceives the mandate of the Nine Yangs,\nThe Primordial Beginning’s Jade Scripture,\nGoverns the spirits of the Central Palace.\"*\n\nConclude and bury the stone nine feet deep.\n\nThis is the Thearch Lord’s Jade Scripture: Divine Ruling Upper Method. The text is as follows:\nThe Heavenly Thearch Lord received the Nine Heavens’ Jade Scripture from the Nine Heavens’ Venerable One, inscribed in red on yellow stone to be buried at the center of the dwelling peak, subduing the myriad demons and summoning perfected immortals and true persons to appear, with jade maidens guarding the body. The true instructions shall illuminate themselves, and one shall ascend to heaven in broad daylight. Guard this secret and do not transmit it.\n\nThe above are the Jade Essence Peak-Governing Upper Methods, received by the Thearch Lord from the Nine Heavens’ Venerable One as oral instructions. According to the statutes of the Perfected and Mysterious, transmission may only be granted to those with the bone-sign of destined immortality after seven hundred years. Those without jade names must not recklessly divulge it. To lightly reveal the divine scripture is to invite retribution upon seven generations of ancestors and calamity upon one’s descendants. The recipient must be cautious, keeping it secret and upholding its practice.\n\nFor the transmission of true instructions and essential plain-language teachings, in accordance with the luminous statutes, one must present a golden fish, a jade dragon, forty feet of blue silk, nine pairs of golden buttons, a hundred feet of life-destiny silk, and swear an oath of fidelity to the Nine Heavens. Proclaim the covenant before all heavens, perform purification rites in a secluded chamber, and only then may the transmission proceed. To break the oath or violate the trust incurs the same punishment from the ghostly officials upon both master and disciple. Each party must be meticulous in their conduct.\n\n*Washen Supreme Three-Nine Plain-Speech Jade Essence True Instructions* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞真太上三九素语玉精真诀 经名：洞真太上三九素语玉精。 撰人不详，约出於东晋。 系早期上清派重要经典。 一卷底本出处：《正统道藏》正一部 洞真太上三九素语玉精真诀 三九素语玉精真诀 九天丈人、三天玉童，以上始元年天甲吉辰，时加北维，移度停轩，三元齐景，九帝回真，登高上玉馆，紫虚之天，三九素语，披解灵关，玉精真诀，理命长存，开究辽朗，清畅萧条，玉音秀虚，琼音逸霄，香风激无，慧唱遐寥，流芳深颐，气冠神飙，玉检总御，万仙来朝，斯玄古之妙化，经万劫而不雕，撰真诀以遗观，试来心於懃翘。 若金名东华，绿字紫庭，得受妙篇，位登玉清，三关启机，九户受灵，面登金容，五藏华荣，金真感畅，豁落洞明，神烛潜照，宝光夜生，流金交掷，焕落火铃，啸命立到，驱策神兵，三元诣房，降致绿軿，乘空驾虚，飞腾上清。 上相青童君曰：三九素语，出於九帝三真命咒之辞，理气停年，开解灵关，五藏华鲜。 子有玉骨，得见此文，密告明誓，誓信九天，潜修其道。 慎勿妄宣，宣示非人，考延子身，不但风刀，殃逮七玄。 明慎天科，以求道真，九年不懈，克得上仙。 诀文以九天丈人、三天玉童，同时传太帝君、天帝君、太微天帝君。 太帝君以传南极上元君，天帝君以传西王母，太微天帝君以传金阙圣君，金阙圣君传上相青童君，青童君传西城王君，使付后学应为真人者。 承真相统，气系皇篇，至王君已经七千余劫。 王君后封灵文於王屋山西穴玉室之内，有素灵之官侍香典文。 其道秘妙，不行於世，若有玄名遇得此文，万仙来朝，天官卫身，懃行苦思，白日升晨。 凡受上清道德三宝妙章，步虚升玄之道，而不先释五藏，开理幽关，万气不固，真灵不欣，徒劳懃事，万不得仙。 今撰玉诀，上帝妙言，以传后学，秘而奉真，慎勿轻传，殃灭子身。 每至本命之日，沐浴入室，东向叩齿九通，冥目思东方青帝少阳九灵真人，讳拘上生，身长九寸，头戴九元之冠，衣单青飞裙，手执青精玉板，乘青云飞舆，从十二青桂玉女，从天清阳宫中来下，以青云冠覆我身。 思九灵真人乘云气入我身中，安镇肝内，便三呼少阳九灵真人拘上生，赍青芝五精补养我身。 便三味口三咽止，仰咒曰： 苍元浩灵，少阳先生，九气还肝，使为魄宁，幽府结华，藏内鲜明，练容固体，反白为青，神化内发，景登紫庭，敢有犯试，摧以流铃，上帝玉录，太清记名。 毕，引气九咽止。 正南向，冥目叩齿三通，思南方赤帝太阳南极真人，讳融尚生，身长三寸，头戴进贤之冠，衣纬章之衣，手执朱玉之板，乘赤云飞舆，从赤桂玉女十二人，从天兰台宫中来下，以丹云飞舆冠覆我身。 思太阳南极真人乘云气入我身中，安镇心内，便三呼太阳南极真人融尚生，赍丹芝玉精补养我身，便三味口三咽，仰祝曰： 赤庭绛云，上有高真，三气归心，是我丹元，腾我净躬，径奏以闻，心固神静，九灵闭关，金真内映，紫烟结云，太微绿字，书名神仙，飞行上清，朝谒帝尊。 毕，引气三过咽止。 正西向，冥目叩齿七通，思西方白帝少阴素灵真人，讳辱明子，身长七寸，头戴玉宝玄冠，衣素锦之衣，手执素玉之板，乘白云飞舆，从素灵玉女十二人，从天皇堂宫来下，以素云冠覆我身。",
      "translated_text": "**The Wondrous Scripture of the Three Nines and Jade Essence from the Supreme Cavern of Perfection**\n\n**Scripture Title:** *The Wondrous Scripture of the Three Nines and Jade Essence from the Supreme Cavern of Perfection*\n**Author:** Unknown, approximately dated to the Eastern Jin dynasty. A foundational scripture of the early Shangqing tradition.\n\n**The Wondrous Oral Formula of the Three Nines and Jade Essence**\n\nOn the auspicious celestial stem day of the first year of the *shangyuan* era, at the hour of the northern quadrant, when the Three Origins aligned in radiance and the Nine Emperors returned to perfection, the Nine Heavens’ Venerable One and the Three Heavens’ Jade Lads ascended the Jade Pavilion of the Lofty Heights, the Purple Void Heaven. There, the *Three Nines Oral Formula* was revealed, unlocking the numinous barrier, and the *Jade Essence True Formula* was bestowed—governing destiny for eternal preservation. Its revelation illuminated the distant expanse, its clarity as pure as the rustling wind, its jade tones resounding through the void, its jasper melodies soaring beyond the heavens. Fragrant winds stirred without cease, and wisdom’s chant echoed into the farthest reaches. Its fragrance suffused the depths of the visage, its qi outstripped the divine gales. The Jade Tablet commanded all, and the myriad immortals came to pay homage. This was the wondrous transformation of primordial mystery, enduring through ten thousand kalpas without decay. The true formula was recorded to bequeath to the worthy, testing the sincerity of those who seek with diligence.\n\nShould one’s golden name be *Eastern Radiance* and one’s verdant appellation *Purple Court*, upon receiving this wondrous scripture, one ascends to the Jade Clarity Heaven. The Three Passes unlock their mechanism, the Nine Portals receive the numinous, and the visage assumes a golden countenance. The Five Viscera flourish in splendor, the golden perfection is felt in harmony, and the boundless is illuminated with clarity. The divine candle shines in hidden radiance, the treasure-light is born in the night. Molten gold is cast in exchange, and the flaming bells blaze forth. With a whistle, the command is instantly fulfilled, and the divine soldiers are marshaled. The Three Origins journey to the chamber, descending in a jade-green chariot. Riding the void, soaring through emptiness, one ascends to the Supreme Clarity.\n\nThe Most Exalted Azure Lad said: The *Three Nines Oral Formula* originates from the incantations of the Nine Emperors and the Three Perfected, governing qi to prolong the years and unlocking the numinous barrier to freshen the Five Viscera.\n\nYou possess jade bones and have beheld this text. Receive it in secret, swear a luminous oath, and pledge your faith to the Nine Heavens. Cultivate this Dao in seclusion. Guard against reckless transmission; to reveal it to the unworthy is to invite calamity upon yourself—not merely the wind’s blade, but misfortune extending to the Seven Mysteries. Be vigilant in celestial law, seeking the true Dao. After nine years of unwavering practice, you shall attain the rank of Supreme Immortal.\n\nThe formula was transmitted simultaneously by the Nine Heavens’ Venerable One and the Three Heavens’ Jade Lads to the Supreme Thearch, the Celestial Thearch, and the Thearch of the Grand Tenuity. The Supreme Thearch transmitted it to the Lord of the Upper Prime of the Southern Culmen; the Celestial Thearch transmitted it to the Queen Mother of the West; the Thearch of the Grand Tenuity transmitted it to the Sacred Lord of the Golden Portal. The Sacred Lord of the Golden Portal transmitted it to the Most Exalted Azure Lad, who in turn transmitted it to the Lord of the Western City, entrusting it to later disciples destined to become Perfected. The lineage of transmission, bound by true qi, traces back to the imperial scripture. By the time of the Lord of the Western City, over seven thousand kalpas had passed. Thereafter, the Lord of the Western City sealed the numinous text within the jade chamber of the western cavern of Mount Wangwu, where the officials of the Plain Spirit attended to its incense and guarded its scripture.\n\nThis Dao is profoundly wondrous and not disseminated in the world. Should one of mysterious destiny encounter this text, the myriad immortals shall come to pay homage, and celestial officials shall guard one’s person. Through diligent practice and arduous contemplation, one shall ascend at dawn.\n\nFor those who receive the wondrous chapters of the Three Treasures of the Supreme Clarity’s Dao and Virtue, practicing the Way of pacing the void to ascend the mystery, yet do not first release the Five Viscera and open the hidden barriers, their myriad qi will not be stabilized, and their true numen will not rejoice. Their diligent efforts shall be in vain, and they shall never attain immortality.\n\nNow, this *Jade Formula*, the wondrous words of the Supreme Thearch, is transmitted to later disciples. Guard it in secrecy and revere the true. Beware of careless transmission, lest calamity befall you.\n\nOn the day of your life-destiny, bathe and enter the chamber. Face east, knock your teeth nine times, and with eyes closed, visualize the Nine Numinous Perfected of the Eastern Azure Thearch and Lesser Yang, whose taboo name is *Jushangsheng*. He is nine inches tall, wears a Nine Origins crown, and is clad in a single-layered azure flying skirt. In his hand, he holds a jade tablet of azure essence, riding a flying chariot of azure clouds, accompanied by twelve Jade Maidens of the Azure Cassia. They descend from the Palace of Celestial Clarity and Yang. Visualize the azure cloud crown covering your body.\n\nImagine the Nine Numinous Perfected riding the cloud-qi into your body, settling and stabilizing your liver. Then, call thrice upon the Nine Numinous Perfected of Lesser Yang, *Jushangsheng*, beseeching him to bestow the five essences of azure mushrooms to nourish your body. Then, taste thrice and swallow three times. Look upward and recite the incantation:\n\n*\"Vast and numinous Azure Origin, Master of Lesser Yang,\nNine qi return to the liver, pacifying the po soul.\nThe hidden palace knots in splendor, the viscera’s interior gleams bright.\nRefine the countenance, strengthen the body, reverse white to azure.\nThe divine transformation arises within, the radiance ascends to the Purple Court.\nShould any dare transgress, be shattered by the flaming bells.\nInscribed in the Jade Record of the Supreme Thearch, the name is recorded in the Grand Clarity.\"*\n\nConclude by drawing in qi and swallowing nine times.\n\nFace due south, close your eyes, and knock your teeth three times. Visualize the Perfected of the Southern Culmen and Greater Yang of the Southern Crimson Thearch, whose taboo name is *Rongshangsheng*. He is three inches tall, wears a *Jinxian* crown, and is clad in a robe of woven patterns. In his hand, he holds a vermilion jade tablet, riding a flying chariot of crimson clouds, accompanied by twelve Jade Maidens of the Crimson Cassia. They descend from the Palace of the Orchid Terrace. Visualize the crimson cloud chariot covering your body.\n\nImagine the Perfected of the Southern Culmen and Greater Yang riding the cloud-qi into your body, settling and stabilizing your heart. Then, call thrice upon the Perfected of the Southern Culmen and Greater Yang, *Rongshangsheng*, beseeching him to bestow the jade essence of cinnabar mushrooms to nourish your body. Then, taste thrice and swallow three times. Look upward and recite the incantation:\n\n*\"Crimson Court of scarlet clouds, above dwell the exalted Perfected.\nThree qi return to the heart, this is my cinnabar origin.\nExalt my pure body, ascend directly to make report.\nThe heart is stabilized, the spirit is tranquil, the Nine Numinous seal the barrier.\nGolden perfection shines within, purple mist knots into clouds.\nInscribed in the verdant script of the Grand Tenuity, the name is written as divine immortal.\nSoaring to the Supreme Clarity, I pay homage to the Imperial Honored One.\"*\n\nConclude by drawing in qi and swallowing three times.\n\nFace due west, close your eyes, and knock your teeth seven times. Visualize the Plain Numinous Perfected of the Western White Thearch and Lesser Yin, whose taboo name is *Rumingzi*. He is seven inches tall, wears a dark jade crown, and is clad in a robe of plain brocade. In his hand, he holds a plain jade tablet, riding a flying chariot of white clouds, accompanied by twelve Jade Maidens of the Plain Spirit. They descend from the Palace of the Celestial August Hall. Visualize the plain cloud crown covering your body.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1265,
      "start_sentence": 0,
      "end_sentence": 29,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.88904857635498,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上三九素语玉清真诀.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "思素灵真人乘云气入我身中，安镇胇内，便三呼少阴素灵真人辱明子，赍洪芝玉精补养我身，便三味口三咽止，仰咒曰： 素元洞虚，天真神庐，七气守胇，与神同居，保练五藏，含华秀芝，澄诚明石，游御玄虚，白玉金字，九帝真书，使我飞仙，死名落除，游洞三清，适意所如。 毕，引气七过咽止。 正北向，冥月叩齿五通，思北方黑帝太阴玄灵真人，讳冥玄默，身长五寸，头戴玄冠，衣玄云之衣，手执玄精玉版，乘玄云飞舆，从太玄玉女十二人，从天玄阴玉虚宫中下，以玄云冠覆我身。 思太阴玄灵真人乘云入我身中，安镇肾内，便三呼太阴玄灵真人冥玄默，赍玄芝玉精补养我身，便三味口三咽止。 仰咒曰： 玄元北极，太上灵玑，五气卫肾，龟玉参差，宝华结络，胃藏朗开，神名玉台，年同二仪，上皇太帝，峙然不迷，役使六甲，以致八威，参龙驾浮，超然升飞，吐纳神芝，历劫不衰。 毕，引气五过咽止。 正向本命之上，冥目叩齿十二通，思中央黄帝总元三灵真人，讳原华，身长一寸二分，头戴黄晨玉冠，衣黄锦飞裙，手执黄精玉版，乘黄霞飞舆，从中央黄帝玉女十二人，从天玉房宫中下，以黄云覆冠我身。 思三灵真人乘云入我身中，安镇脾内，便三呼总元三灵真人原华，赍黄精玉芝补我身，便三味口三咽止，仰咒曰： 黄元中帝，本命之神，一气侍脾，使我得真，实藏生华，结络紫晨，变景练容，保命长延，后物而倾，千神来臣，老君玄录，名书神仙，长生久视，与天同存。 毕，引气十二咽止。 还东向，瞑目叩齿三十六通，思五气玉清高皇上宝真人，讳太虚，身长三寸，头戴玉晨之冠，衣五色无缝单衣，左手捧日精，右手执月光，镇我上府泥丸宫中。 三呼上宝真人太虚，赍五气流精陶灌我身，便五味口五咽止，仰咒曰： 高上真皇，五帝太灵，保我泥丸，玄映五形，三光朗耀，日月洞明，飞云流霞，陶注玉精，练容保魄，神魂自生，千变万化，升入紫庭。 毕，引气五咽止。 五方命咒毕，摩两掌，拭面目。 如此五年，面发金容，五内华生，玉藏保气，神仙道成，三宫感畅，真灵见形，乘空驾虚，白日升天，惟在密修，慎勿轻传。 八节投刺法 夫修上法，诵万遍之道，希真致自灵，以求神仙者，当以八节之日，投刺灵山本命之岳，列奏玉清，三年勿失，则名书青宫，札系玉皇，玉华侍卫，金晨奉迎。 此玉清真诀，帝君宝篇，有得此诀，计日升仙。 妄泄神文，考及九玄，身没形残，长闭河源，惟在密修，道不虚言。 夏至节之日，於本命岳，正中，南向叩齿三十二通，仰微咒曰： 玄精阳明，元始帝灵，四景八气，纬度天经，白元落死，无英注生，奏简灵岳，录闻玉清，高上帝尊，记甲真名，伏须告御，身谒紫庭，三官九府，靡不顺听。 毕，咽气九过止。 还北向，长跪读简，咒如后法讫，埋简於绝岩之峰。 立秋之日正中，向西南叩齿三十二通，仰微咒曰： 流炎四射，飞景启明，八气交焕，齐落天经，元始告晨，上应帝灵，奏简灵岳，东华记名，长保玄室，宴景紫庭，三宫九府，列我长生，与天同休，永保黄宁。 毕，咽气九过止乞还北向，长跪读简，咒如后法讫，埋简。 秋分之日正中，西向叩齿三十二通，仰微咒曰：",
      "translated_text": "Visualize the Plain Numinous Perfected riding clouds and qi into my body, settling and stabilizing within my chest. Then call three times upon the Lesser Yin Plain Numinous Perfected *Rumingzi*, beseeching him to bestow the great zhi-fungus and jade essence to nourish my body. Then savor three times and swallow three times. Look upward and recite the incantation:\n\n*\"Plain Origin, cavernous emptiness,\nCelestial Perfected’s divine abode.\nSeven qi guard the chest,\nDwelling with the spirit as one.\nPreserve and refine the five viscera,\nContaining blossoms and lustrous zhi.\nLimpid sincerity, luminous stone,\nRoaming and ascending the mysterious void.\nWhite jade, golden script,\nNine Emperors’ true writ.\nLet me become a flying immortal,\nShedding the name of death.\nRoam the Three Caverns of Clarity,\nFreely as my heart desires.\"*\n\nConclude by drawing in qi and swallowing seven times.\n\nFace due north, close your eyes, and knock your teeth five times. Visualize the Northern Black Thearch’s Greater Yin Mysterious Numinous Perfected, whose taboo name is *Mingxuanmo*. He is five inches tall, wears a dark crown, and is clad in a robe of dark cloud brocade. In his hand, he holds a tablet of mysterious essence jade, riding a flying chariot of dark clouds, accompanied by twelve Jade Maidens of the Greater Mystery. They descend from the Palace of the Celestial Mysterious Yin Jade Void. Visualize the dark cloud crown covering your body.\n\nVisualize the Greater Yin Mysterious Numinous Perfected riding clouds into my body, settling and stabilizing within my kidneys. Then call three times upon the Greater Yin Mysterious Numinous Perfected *Mingxuanmo*, beseeching him to bestow the dark zhi-fungus and jade essence to nourish my body. Then savor three times and swallow three times. Look upward and recite the incantation:\n\n*\"Mysterious Origin of the Northern Ultimate,\nSupreme Numinous Pivot.\nFive qi defend the kidneys,\nTortoise and jade interlock.\nPrecious blossoms weave the network,\nThe stomach-viscus shines forth.\nThe spirit’s name is Jade Terrace,\nYears equal the Two Modes.\nSupreme August Thearch of High Antiquity,\nSteadfast and unconfused.\nCommand the Six Jia,\nSummon the Eight Might.\nRide the three dragons’ chariot aloft,\nTranscending to ascend and fly.\nInhaling and exhaling divine zhi,\nEnduring through kalpas without decline.\"*\n\nConclude by drawing in qi and swallowing five times.\n\nFace the direction of your natal destiny, close your eyes, and knock your teeth twelve times. Visualize the Central Yellow Thearch’s Prime Origin Threefold Numinous Perfected, whose taboo name is *Yuanhua*. He is one inch and two fen tall, wears a crown of yellow dawn jade, and is clad in a flying skirt of yellow brocade. In his hand, he holds a tablet of yellow essence jade, riding a flying chariot of yellow clouds, accompanied by twelve Jade Maidens of the Central Yellow Thearch. They descend from the Palace of the Celestial Jade Chamber. Visualize the yellow cloud covering your crown.\n\nVisualize the Threefold Numinous Perfected riding clouds into my body, settling and stabilizing within my spleen. Then call three times upon the Prime Origin Threefold Numinous Perfected *Yuanhua*, beseeching him to bestow the yellow essence jade zhi to nourish my body. Then savor three times and swallow three times. Look upward and recant the incantation:\n\n*\"Yellow Origin, Central Thearch,\nSpirit of my natal destiny.\nOne qi attends the spleen,\nEnabling me to attain the true.\nThe solid viscus engenders blossoms,\nWeaving the network of purple dawn.\nTransforming the countenance through refinement,\nPreserving life and prolonging years.\nInclining toward things yet unshaken,\nA thousand spirits come to serve.\nThe Elder Lord’s mysterious register,\nInscribes the name of divine immortal.\nLong life and enduring vision,\nCoexisting with heaven.\"*\n\nConclude by drawing in qi and swallowing twelve times.\n\nReturn to face the east, close your eyes, and knock your teeth thirty-six times. Visualize the Five Qi Jade Clarity High August Supreme Treasure Perfected, whose taboo name is *Taixu*. He is three inches tall, wears a crown of jade dawn, and is clad in a seamless robe of five colors. In his left hand, he holds the essence of the sun; in his right, the light of the moon. He stabilizes my upper mansion, the Muddy Pellet Palace.\n\nCall three times upon the Supreme Treasure Perfected *Taixu*, beseeching him to bestow the flowing essence of the five qi to refine and irrigate my body. Then savor five times and swallow five times. Look upward and recite the incantation:\n\n*\"High August Perfected Sovereign,\nFive Thearchs’ great numen.\nPreserve my Muddy Pellet,\nMysteriously reflecting the five forms.\nThree luminaries shine brightly,\nSun and moon penetratingly clear.\nFlying clouds, flowing rosy clouds,\nInfusing and irrigating jade essence.\nRefining the countenance, preserving the po,\nSpirit and soul spontaneously born.\nA thousand transformations, myriad changes,\nAscending into the Purple Court.\"*\n\nConclude by drawing in qi and swallowing five times.\n\nWhen the incantations for the five directions are complete, rub your palms together and wipe your face and eyes.\n\nAfter five years of such practice, your face and hair will take on a golden countenance, the five viscera will blossom with splendor, the jade viscus will preserve qi, and the Dao of divine immortality will be achieved. The Three Palaces will feel harmonious and unobstructed, the true numina will manifest their forms, and you will ride the void and ascend into emptiness, ascending to heaven in broad daylight. This depends solely on secret cultivation; guard it carefully and do not transmit it lightly.\n\n**Method of Presenting Memorials on the Eight Nodal Days**\n\nFor those who cultivate the above method, recite the Dao ten thousand times, hoping to attain numinosity and realize the divine, seeking to become a divine immortal: on the days of the eight nodes, present a memorial to the numinous mountain of your natal destiny, submitting it to the Jade Clarity. After three years without fail, your name will be inscribed in the Azure Palace, your memorial tied to the Jade August One, with jade blossoms as attendants and golden dawn to receive you.\n\nThis is the true formula of Jade Clarity, the precious scripture of the Thearch-Lord. Whoever obtains this formula will ascend as an immortal in a calculated number of days. To recklessly divulge the divine text is to invite judgment upon the Nine Mysteries: the body will perish, the form will be destroyed, and one will be eternally sealed in the River Source. This depends solely on secret cultivation; the Dao does not speak falsely.\n\nOn the day of the Summer Solstice, at the peak of your natal destiny mountain, face due south, knock your teeth thirty-two times, and look upward to softly recite the incantation:\n\n*\"Mysterious essence, yang brightness,\nPrime Origin Thearch’s numen.\nFour scenes, eight qi,\nWeaving the warp and weft of heaven’s scripture.\nWhite Origin sheds death,\nFlourishing Hero infuses life.\nPresent the memorial to the numinous mountain,\nRecorded and heard in Jade Clarity.\nHigh August Thearch,\nInscribe the true name of the first celestial stem.\nAwaiting the imperial audience,\nBody to pay homage in the Purple Court.\nThe Three Offices and Nine Bureaus,\nNone will disobey or fail to heed.\"*\n\nConclude by swallowing qi nine times. Then face north, kneel, and read the memorial, reciting the incantation as per the subsequent method before burying the memorial atop a sheer cliff.\n\nOn the day of the Autumnal Equinox, at the peak, face due west, knock your teeth thirty-two times, and look upward to softly recite the incantation:\n\n*\"Flowing flames, fourfold radiance,\nFlying scenes illuminate the dawn.\nEight qi intermingle and shine,\nFalling together with heaven’s scripture.\nPrime Origin announces the morning,\nResponding above to the Thearch’s numen.\nPresent the memorial to the numinous mountain,\nEastern Florescence records the name.\nLong preserve the mysterious chamber,\nFeasting in the Purple Court.\nThe Three Palaces and Nine Bureaus,\nList me among the long-lived.\nCoexisting with heaven,\nEternally preserving yellow tranquility.\"*\n\nConclude by swallowing qi nine times. Then face north, kneel, and read the memorial, reciting the incantation as per the subsequent method before burying the memorial. On the day of the Autumnal Equinox, at the peak, face due west, knock your teeth thirty-two times, and look upward to softly recite the incantation:",
      "overlap_context": "our eyes, and knock your teeth seven times. Visualize the Plain Numinous Perfected of the Western White Thearch and Lesser Yin, whose taboo name is *Rumingzi*. He is seven inches tall, wears a dark jade crown, and is clad in a robe of plain brocade. In his hand, he holds a plain jade tablet, riding a flying chariot of white clouds, accompanied by twelve Jade Maidens of the Plain Spirit. They descend from the Palace of the Celestial August Hall. Visualize the plain cloud crown covering your body.",
      "start_char": 1265,
      "end_char": 2522,
      "start_sentence": 30,
      "end_sentence": 59,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.05903339385986,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上三九素语玉清真诀.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "少阴告运，八道开张，二象顺回，纬度天梁，元始勒正，齐契四乡，奏简玄岳，上闻玉京顶上帝高尊，记名无英，三官落死，九府顺昌，自尔之后，三界司迎，乘虚驾烟，飞行太空。 毕，咽气九过止。 还北向，长跪读简，咒如后法讫，埋简。 立冬之日正中，西北向叩齿三十二通，仰微祝曰： 玄阴御晨，四运回天，八气交度，三五周还，上帝告命，母吉启辰，奏名青宫，上补帝臣，承天顺命，拜谒玉晨，北酆落死，南宫度名。 毕，咽气九过止。 还北向，长跪读简，咒如后法讫，埋简。 冬至之日正中，北向叩齿三十二通，仰微咒曰： 阴精激气，朔晨乘冥，二景交络，运度天经，九帝齐运，焕采真名，奏札上闻，记契玉庭，五岳三司，咸定我生，与日同光，与天同宁。 毕，咽气九过止。 长跪读简，咒如后法讫，埋简。 立春之日正中，东北向叩齿三十二通，仰微咒曰： 阳精告始，玄气射晨，二运交焕，三五反真，上帝有命，告我灵篇，投简灵岳，永保飞仙，三官九府，度我河源，名参帝籍，长为玉宾。 毕，咽炁九过止。 还北向，长跪读简，咒同后法讫，埋简。 春分之日正中，东向叩齿三十二通，仰微咒曰： 天清气布，浩素流青，乘刚御晨，回历五星，黄箓映魂，东华保生，长享无极，亿劫肇龄，奏简玉阙，北帝落名，游历玄台，浮景紫清。 毕，咽气九过。 还北向，长跪读简，咒如后法讫，埋简。 立夏之月正中，东南向叩齿三十二通，仰微咒曰： 八气维络，整位怜天，五回七转，变化忽闻，三练九试，改容易年，济景无蹉，永保上仙。 毕，咽气九过止。 还北向，长跪读简，咒如后法讫，埋简。 高上紫虚玉皇大洞三景弟子某岳先生王甲，年如干，字某甲，某月生，已被三试，应为帝臣，谨关五岳灵山真神、三官九府十二河源，记臣玄名，上奏玉清。 右朱书银刺上，北向读刺毕，埋刺玄岩之下，勿令人得知之。 北向再拜，长跪读简毕，又叩齿九通，微咒曰： 元始帝皇，高上玉真，金仙父母，玉华紫晨，万气总司，监真领仙，上校青宫，符命灵神，检定录札，列奉帝前，谨关九府，三官河源，度名玉篇，永保长存。 毕，埋简。 此帝君素语妙诀，传有骨分应仙之人。 每至一节，辄如上法，令三年得二十四过投刺灵岳，则真皇注名，帝给玉童玉女各十二人。 轻泄宝诀，罪灭子身，明慎玄科，秘而奉修。 帝君玉文镇神上法 玉精诀言：子欲隐学，清斋山岳，当以壬癸之日，刻青石，黑书九天玉文，埋所住东方。 临埋时，东向叩齿九通，咒曰： 青辱青辱，太山灵岳，九炁灵精，长林幽黑，三田蓝波，四脚六目，上真宫宅，四域普告，千灵万精，靡不顺伏，玉帝有命，干者刑戮。 毕，埋石深九尺。 此帝君玉文镇神上法，文如左： 此天帝君受九天丈人九天玉文，以黑书青石，以镇所住岳东方，制万魔，致神仙真人来见，玉女卫形，秘慎勿传。 玉精诀言：当以甲乙之日，刻赤石，以青书九天玉文，埋所住岳南方。 临埋时，南向叩齿九通，咒曰： 赤丹阳精，南霍万灵，郁萧育飙，乘幽入冥，帝宫有位，浮命黄宁，自天以下，敢不顺听，有干者戮，有犯者刑。 毕，埋石深九尺。 此帝君玉文镇神上法，文如左： 此帝君受九天丈人九天玉文，以青书赤石，以镇所住岳南方，制万魔，致神仙真人来见，玉女卫形，得玉精真诀，白日升天，秘慎勿传。",
      "translated_text": "At the Minor Yin’s announcement of the mandate,\nThe Eight Ways unfold,\nThe Two Images turn in harmony,\nWeaving the celestial beams.\nThe Prime Origin reins in rectitude,\nAligning with the four quarters.\nPresent the memorial to the Mysterious Peak,\nThat it may ascend to the Jade Capital’s summit,\nTo the Highest Thearch and Lofty Honored One.\nRecord the name in the Hall of No-Blossoms,\nThe Three Offices strike off death,\nThe Nine Bureaus prosper in accord.\nFrom this moment forth,\nThe Three Realms’ overseers shall welcome me,\nRiding the void, steering the mists,\nSoaring through the Great Empyrean.\n\nConclude by swallowing qi nine times. Then face north, kneel, and read the memorial, reciting the incantation as per the subsequent method before burying the memorial.\n\nOn the day of the Beginning of Winter, at the peak, face northwest, knock your teeth thirty-two times, and look upward to softly recite the incantation:\nDark Yin governs the dawn,\nThe Four Movements revolve heaven,\nEight qi intermingle and traverse,\nThree and Five cycle in return.\nThe Thearch announces the mandate,\nMother Auspice inaugurates the morning.\nPresent the name to the Azure Palace,\nTo be enrolled as an imperial minister above,\nReceiving heaven’s decree and obeying the mandate,\nPaying homage to the Jade Dawn.\nStrike off death in the Northern Feng,\nRecord the name in the Southern Palace.\n\nConclude by swallowing qi nine times. Then face north, kneel, and read the memorial, reciting the incantation as per the subsequent method before burying the memorial.\n\nOn the day of the Winter Solstice, at the peak, face north, knock your teeth thirty-two times, and look upward to softly recite the incantation:\nYin essence spurs qi,\nThe northern dawn rides the dark,\nThe Two Radiances intertwine,\nTraversing the celestial scripture.\nThe Nine Thearchs move in unison,\nIlluminating the true name.\nPresent the memorial to ascend,\nRecord the covenant in the Jade Court.\nThe Five Peaks and Three Offices\nAll affirm my life,\nSharing the sun’s radiance,\nSharing heaven’s tranquility.\n\nConclude by swallowing qi nine times. Kneel and read the memorial, reciting the incantation as per the subsequent method before burying the memorial.\n\nOn the day of the Beginning of Spring, at the peak, face northeast, knock your teeth thirty-two times, and look upward to softly recite the incantation:\nYang essence heralds the beginning,\nMysterious qi pierces the dawn,\nThe Two Movements intermingle and shine,\nThree and Five revert to truth.\nThe Thearch bears a mandate,\nAnnouncing to me the numinous scripture.\nSubmit the memorial to the Numinous Peak,\nEternally preserving the flying immortal.\nThe Three Offices and Nine Bureaus\nPass me through the river sources,\nMy name enrolled in the imperial register,\nEver to be a jade guest.\n\nConclude by swallowing qi nine times. Then face north, kneel, and read the memorial, reciting the incantation as per the subsequent method before burying the memorial.\n\nOn the day of the Spring Equinox, at the peak, face east, knock your teeth thirty-two times, and look upward to softly recite the incantation:\nHeaven clears, qi spreads,\nVast purity flows azure,\nRiding the firm to govern the dawn,\nRevolving through the Five Stars.\nThe Yellow Register illumines the soul,\nEastern Florescence preserves life.\nLong enjoy the boundless,\nFor aeons commencing longevity.\nPresent the memorial to the Jade Gate,\nThe Northern Thearch records the name,\nWandering through the Mysterious Terrace,\nFloating radiance in the Purple Clarity.\n\nConclude by swallowing qi nine times. Then face north, kneel, and read the memorial, reciting the incantation as per the subsequent method before burying the memorial.\n\nIn the month of the Beginning of Summer, at the peak, face southeast, knock your teeth thirty-two times, and look upward to softly recite the incantation:\nEight qi bind and interlace,\nOrdering positions to pity heaven,\nFive revolutions, seven turns,\nTransformations suddenly heard.\nThrice refined, nine times tested,\nAltering countenance and renewing years,\nCrossing radiance without delay,\nEternally preserving the highest immortal.\n\nConclude by swallowing qi nine times. Then face north, kneel, and read the memorial, reciting the incantation as per the subsequent method before burying the memorial.\n\nThe Highest Purple Void Jade Thearch, Great Cavern Three Radiance Disciple, Master of the Sacred Peak, Wang of such-and-such a district, aged so-and-so, styled such-and-such, born in such-and-such a month, having undergone the Three Trials, is to serve as an imperial minister. Respectfully petition the true spirits of the Five Peaks and numinous mountains, the Three Offices, Nine Bureaus, and Twelve River Sources to record my mysterious name and submit it to the Jade Clarity above.\n\nInscribe this in vermilion on a silver slip, face north to read the slip, then bury it beneath the Mysterious Crag, ensuring no one learns of it.\n\nFace north, bow twice, kneel, and read the memorial to its conclusion. Then knock your teeth nine times and softly recite the incantation:\nPrime Origin Thearch Sovereign,\nHighest Jade Perfected,\nGolden Immortal Father and Mother,\nJade Florescence and Purple Dawn,\nOverseers of the myriad qi,\nSupervisors of the perfected and leaders of immortals,\nExaminers of the Azure Palace,\nNuminous spirits bearing the talismanic mandate,\nInspectors of the registers and records,\nPresenting them before the Thearch,\nRespectfully petition the Nine Bureaus,\nThe Three Offices and River Sources,\nTo pass my name into the Jade Register,\nEternally preserving long life.\n\nConclude and bury the memorial.\n\nThese are the plain words and wondrous secrets of the Thearch Lord, transmitted only to those of bone predestined for immortality. At each seasonal node, perform the above method, ensuring that over three years, twenty-four memorial slips are submitted to the numinous peaks. Then the True Thearch shall inscribe the name, and the Thearch shall grant twelve jade boys and twelve jade maidens. To lightly divulge this precious secret is to invite the annihilation of oneself and one’s descendants. Be clear and cautious in the mysterious statutes, guarding and practicing them in secret.\n\n**Thearch Lord’s Jade Scripture: Divine Ruling Upper Method**\n\n**Jade Essence Oral Instructions:**\nShould you wish to conceal and study,\nPurify and fast upon the mountains.\nOn a *ren* or *gui* day,\nCarve a green stone and inscribe in black the Nine Heavens’ Jade Scripture,\nBurying it in the east of your dwelling.\nAt the moment of burial, face east, knock your teeth nine times, and recite the incantation:\nGreen Humiliation, Green Humiliation,\nSacred Peak of Mount Tai,\nNine qi’s numinous essence,\nLong forests and deep darkness,\nThree Fields of indigo waves,\nFour legs and six eyes,\nAbodes of the highest perfected,\nUniversally proclaimed to the four domains.\nThe thousand spirits and myriad essences,\nNone dare disobey.\nThe Jade Thearch bears a mandate,\nThose who violate shall be punished by execution.\n\nConclude and bury the stone nine feet deep.\n\nThis is the Thearch Lord’s Jade Scripture: Divine Ruling Upper Method. The text is as follows:\nThe Heavenly Thearch Lord received the Nine Heavens’ Jade Scripture from the Nine Heavens’ Venerable One, inscribed in black on green stone to be buried in the east of the dwelling peak, subduing the myriad demons and summoning perfected immortals and true persons to appear, with jade maidens guarding the form. Guard this secret and do not transmit it.\n\n**Jade Essence Oral Instructions:**\nOn a *jia* or *yi* day,\nCarve a red stone and inscribe in blue-green the Nine Heavens’ Jade Scripture,\nBurying it in the south of the dwelling peak.\nAt the moment of burial, face south, knock your teeth nine times, and recite the incantation:\nVermilion Yang essence,\nSouthern Huo’s myriad spirits,\nLush and verdant, nurturing the whirlwind,\nRiding the dark to enter the obscure,\nThe Thearch’s palace holds its position,\nFloating life in yellow tranquility.\nFrom heaven downward,\nNone dare disobey.\nThose who violate shall be executed,\nThose who offend shall be punished.\n\nConclude and bury the stone nine feet deep.\n\nThis is the Thearch Lord’s Jade Scripture: Divine Ruling Upper Method. The text is as follows:\nThe Heavenly Thearch Lord received the Nine Heavens’ Jade Scripture from the Nine Heavens’ Venerable One, inscribed in blue-green on red stone to be buried in the south of the dwelling peak, subduing the myriad demons and summoning perfected immortals and true persons to appear, with jade maidens guarding the form. Attain the Jade Essence True Instructions, ascend to heaven in broad daylight. Guard this secret and do not transmit it.",
      "overlap_context": "mysterious chamber,\nFeasting in the Purple Court.\nThe Three Palaces and Nine Bureaus,\nList me among the long-lived.\nCoexisting with heaven,\nEternally preserving yellow tranquility.\"*\n\nConclude by swallowing qi nine times. Then face north, kneel, and read the memorial, reciting the incantation as per the subsequent method before burying the memorial. On the day of the Autumnal Equinox, at the peak, face due west, knock your teeth thirty-two times, and look upward to softly recite the incantation:",
      "start_char": 2522,
      "end_char": 3854,
      "start_sentence": 60,
      "end_sentence": 103,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.100680351257324,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上三九素语玉清真诀.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "玉精诀言：当以戊己之日，刻白石，以黄书九天玉文，埋所住岳西方。 临埋时，西向叩齿九通，咒曰： 白皓结罗，素灵玄阿，西岳万精，乘气逸波，元始告命，制御三华，四域八气，悉为我家，有干者斩，有犯者刑。 毕，埋石深九尺。 此帝君玉文镇神上法，文如左： 此帝君受九天丈人九天玉文，以黄书白石，镇所住岳西方，制万魔，致神仙真人来见，玉女卫身，玉文自明，白日升天，秘慎勿传。 玉精诀言：当以庚辛之日，刻黄石，以白书九天玉文，埋所住岳北方。 临埋时，北向叩齿九通，咒曰： 北方恒山，辰星之精，玄荫黑点，协气放灵，上帝有命，玉文镇生，三道扬威，所制不轻，宜各顺令，复尔真形。 毕，埋石深九尺。 此帝君玉文镇神上法，文如左： 此帝君受九天丈人九天玉文，以白书黑石，镇所住岳北方，以制万魔，致神仙真人来见，玉女卫形，真诀自明，白日升天，秘怀勿传。 玉精诀言：当以丙丁之日，刻黄石、以赤书九天玉文，埋所住岳中央。 临埋时，向本命叩齿九通，咒曰： 黄气玄嵩，总御五方，上乘元命，制伏妖王，千卒伯扶，与魔同凶，天一 帝灵，受命九阳，元始玉文，镇神中宫。 毕，埋石深九尺。 此帝君玉文镇神上法，文如左： 此帝君受九天丈人九天玉文，以朱书黄石，镇所住岳中央，以制万魔，致神仙真人来见，玉女卫身，真诀自明，白日升天，秘慎勿传。 右玉精镇岳上法，帝君受於九天丈人，口口之诀。 依上真玄科，七百年听传有骨应仙之人，自无玉名，不得妄宣，轻泄神文，考延七祖，殃灭子身。 受者慎焉，秘而奉行。 传真诀素语之要，依明科，皆赍金鱼、玉龙，青纹四十尺，金钮九双，本命之缯百尺，以誓九天之信。 告盟誓诸天，清斋幽室，然后奉传。 亏誓违信，师及弟子同罪鬼官，传受之身，各详，慎而行。 洞真太上三九素语玉精真诀竟",
      "translated_text": "The Jade Essence Instructions state: On a *wu-ji* day, carve white stone and inscribe the Nine Heavens’ Jade Scripture in yellow, to be buried in the west of the dwelling peak. At the moment of burial, face west and knock the teeth nine times, reciting the incantation:\n\n*\"White radiance weaves the net,\nPristine spirits dwell in the dark expanse,\nThe myriad essences of the Western Peak,\nRiding qi upon surging waves,\nThe Primordial Beginning issues the decree,\nCommanding the Three Florets,\nThe Four Quarters and Eight Qi,\nAll become my domain.\nThose who violate shall be beheaded,\nThose who offend shall be punished.\"*\n\nConclude and bury the stone nine feet deep.\n\nThis is the Thearch Lord’s Jade Scripture: Divine Ruling Upper Method. The text is as follows:\nThe Heavenly Thearch Lord received the Nine Heavens’ Jade Scripture from the Nine Heavens’ Venerable One, inscribed in yellow on white stone to be buried in the west of the dwelling peak, subduing the myriad demons and summoning perfected immortals and true persons to appear, with jade maidens guarding the body. The Jade Scripture shall illuminate itself, and one shall ascend to heaven in broad daylight. Guard this secret and do not transmit it.\n\nThe Jade Essence Instructions state: On a *geng-xin* day, carve black stone and inscribe the Nine Heavens’ Jade Scripture in white, to be buried in the north of the dwelling peak. At the moment of burial, face north and knock the teeth nine times, reciting the incantation:\n\n*\"The Northern Peak of Hengshan,\nEssence of the Star of Dawn,\nDark shade and black specks,\nHarmonizing qi to release numinous power,\nThe Thearch issues the decree,\nThe Jade Scripture governs life,\nThe Three Paths display their might,\nTheir dominion is not trifling.\nAll should obey the command,\nRestore your true form.\"*\n\nConclude and bury the stone nine feet deep.\n\nThis is the Thearch Lord’s Jade Scripture: Divine Ruling Upper Method. The text is as follows:\nThe Heavenly Thearch Lord received the Nine Heavens’ Jade Scripture from the Nine Heavens’ Venerable One, inscribed in white on black stone to be buried in the north of the dwelling peak, subduing the myriad demons and summoning perfected immortals and true persons to appear, with jade maidens guarding the form. The true instructions shall illuminate themselves, and one shall ascend to heaven in broad daylight. Hold this secret and do not transmit it.\n\nThe Jade Essence Instructions state: On a *bing-ding* day, carve yellow stone and inscribe the Nine Heavens’ Jade Scripture in red, to be buried at the center of the dwelling peak. At the moment of burial, face your life-destiny direction and knock the teeth nine times, reciting the incantation:\n\n*\"Yellow qi and dark Song Peak,\nGoverning the Five Directions,\nRiding the primordial destiny above,\nSubduing the demon kings,\nA thousand soldiers and a hundred aides,\nConspire with demons in malice,\nThe One Thearch’s numinous power,\nReceives the mandate of the Nine Yangs,\nThe Primordial Beginning’s Jade Scripture,\nGoverns the spirits of the Central Palace.\"*\n\nConclude and bury the stone nine feet deep.\n\nThis is the Thearch Lord’s Jade Scripture: Divine Ruling Upper Method. The text is as follows:\nThe Heavenly Thearch Lord received the Nine Heavens’ Jade Scripture from the Nine Heavens’ Venerable One, inscribed in red on yellow stone to be buried at the center of the dwelling peak, subduing the myriad demons and summoning perfected immortals and true persons to appear, with jade maidens guarding the body. The true instructions shall illuminate themselves, and one shall ascend to heaven in broad daylight. Guard this secret and do not transmit it.\n\nThe above are the Jade Essence Peak-Governing Upper Methods, received by the Thearch Lord from the Nine Heavens’ Venerable One as oral instructions. According to the statutes of the Perfected and Mysterious, transmission may only be granted to those with the bone-sign of destined immortality after seven hundred years. Those without jade names must not recklessly divulge it. To lightly reveal the divine scripture is to invite retribution upon seven generations of ancestors and calamity upon one’s descendants. The recipient must be cautious, keeping it secret and upholding its practice.\n\nFor the transmission of true instructions and essential plain-language teachings, in accordance with the luminous statutes, one must present a golden fish, a jade dragon, forty feet of blue silk, nine pairs of golden buttons, a hundred feet of life-destiny silk, and swear an oath of fidelity to the Nine Heavens. Proclaim the covenant before all heavens, perform purification rites in a secluded chamber, and only then may the transmission proceed. To break the oath or violate the trust incurs the same punishment from the ghostly officials upon both master and disciple. Each party must be meticulous in their conduct.\n\n*Washen Supreme Three-Nine Plain-Speech Jade Essence True Instructions* concludes.",
      "overlap_context": "Scripture: Divine Ruling Upper Method. The text is as follows:\nThe Heavenly Thearch Lord received the Nine Heavens’ Jade Scripture from the Nine Heavens’ Venerable One, inscribed in blue-green on red stone to be buried in the south of the dwelling peak, subduing the myriad demons and summoning perfected immortals and true persons to appear, with jade maidens guarding the form. Attain the Jade Essence True Instructions, ascend to heaven in broad daylight. Guard this secret and do not transmit it.",
      "start_char": 3855,
      "end_char": 4606,
      "start_sentence": 104,
      "end_sentence": 129,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.59285259246826,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上三九素语玉清真诀.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}