{
  "source_id": "洞玄灵宝二十四生图经",
  "source_file": "chunked_daozang\\洞玄灵宝二十四生图经.json",
  "total_chunks": 11,
  "total_original_chars": 13147,
  "total_translated_chars": 80473,
  "total_translation_time": 339.2053165435791,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\洞玄灵宝二十四生图经.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Scripture of the Twenty-Four Images of Life from the Cavernous Mystery and Numinous Treasure**\n\n**Scripture Title:** *The Scripture of the Twenty-Four Images of Life from the Cavernous Mystery and Numinous Treasure*. Author unknown, approximately composed during the Jin dynasty. One of the ancient *Scriptures of the Numinous Treasure*. One scroll. Base text from *The Orthodox Daoist Canon*, Primary Section.\n\n---\n\nThe Three Divisions and Eight Radiant Spirits of the Natural Divine Perfection, at the appointed time of the Great Cycle, usher in the Crimson Clarity and the Dawn of Light. The Three Radiances shine resplendent, and the Five Kalpas begin their division.\n\nThe Celestial Venerable of Original Beginning, together with the Great Sages of the Ten Directions, the Most Perfected and Honored Spirits, the Limitless Supreme Lords of the Great Dao, the Flying Celestial Beings, the Jade Maidens of Mystic Harmony, and their innumerable hosts, all sit within the Cypress Grove Lodge of the Southern Floating Cavernous Yang. In pure discourse and serene stillness, their words flow naturally, their numinous voices harmonizing in tenfold resonance. Their wondrous hymns illuminate the True, filling all heavens with joy. The sun and moon halt their wheels, the stellar lodges traverse in silence, the Nine Heavens’ gates revolve, rivers and seas calm their waves, mountains and peaks swallow their mists, dragons and scaled creatures leap and surge, and gods and humans rejoice as one.\n\nAt this moment, the Supreme Limitless Lord of the Dao bows in reverence and addresses the Celestial Venerable: \"Today, as we attend this assembly, the Great Vastness dispels the gloom, and the Limitless Worlds are all illumined. The Dharma’s sound resonates afar, its blessings extending to the Ten Directions. Yet the causes of past excesses, kalpa after kalpa, give rise to rebirth, cycling through sacred ranks, assuming the offices of the Assembled Perfected. Now, as we prepare to govern and divide the Six Heavens, to examine the kalpas and order the cycles, to assess and measure the multitudes, to reckon the long night, and to audit the records of the Three Bureaus—our duties are heavy, our labors arduous, and our joys and sorrows defy expression. Daring to ride the numinous winds, I bare my heart in resonance.\n\nPreviously, with the Celestial King of Original Beginning, I was in the Azure Grove of Long Mulberry, where we heard the Celestial Venerable proclaim to the Great Sages and Honored Spirits: Within the *Cavernous Mystery’s Celestial Writ and Numinous Treasure’s Jade Mysteries*, there exist the Three Divisions and Eight Radiant Spirits, the Twenty-Four Images—above corresponding to the Twenty-Four Perfected, the middle division to the Twenty-Four Qi, and below governing the Twenty-Four Lives. Their numinous chapters gleam resplendent, their wonders surpassing the empty void. Those who behold them have their names inscribed in the Nine Heavens’ registers, recorded on golden tablets, and attain transcendence from life and death.\n\nYet the coming kalpa draws near, and the Three and Five will suffer loss. Countless beings will face shortened lives, drifting through the Eight Difficulties, their bodies tormented by wind and blade, beset by the Five Sufferings, sinking into the long night, deprived of the Three Lights. Ignorant and unknowing, they endure karmic retribution, subject to the cycles of life and death. To witness this moves one to grief, stirring sorrow in gods and humans alike.\n\nNow, the Great Compassion of the Dao’s practice bestows boundless grace. I humbly beseech the Celestial Venerable to take pity, to rely directly upon the Mystic Regulations, and to teach what has not yet been heard—so that those who have not seen may see, those who have not achieved may achieve, and blessings may flow to all, granting favor for a hundred million kalpas.\n\nShould you deign to instruct, I shall then bear the divine winds, spreading the waves, purifying the Three Realms, suppressing the hordes of demons, rectifying the Six Heavens, beheading the legions of evil, pacifying nations and nurturing the people, so that yin and yang may rest in tranquility, enlightened governance may flourish, and the Dao may course through the Great Void.\"\n\nThereupon, the Celestial Venerable lifted his face and smiled. From his mouth emerged qi of blue, yellow, and crimson hues, their radiance penetrating all, illuminating the Ten Directions within and without. No darkness remained hidden, and for a kalpa, all was as bright as dawn. Golden script in purple characters, jade texts in cinnabar chapters—resplendent in their brilliance—appeared within the Three Qi. The Eight Radiant Spirits of the Three Divisions and the Twenty-Four Perfected, each accompanied by a thousand chariots and ten thousand riders, hovered above the Empty Mystery, guarding the numinous writ. The suns and moons of all heavens scattered blossoming light, the myriad streams converged in libation, fragrant incense coiled in eightfold spirals, and the myriad sages rejoiced, all bowing in reverence to the True.\n\nThe Celestial Venerable proclaimed: \"All beings of this generation, your joy is beyond compare. With hearts laid bare and feelings fully revealed, you shall abide by the Mystic Regulations. The Seven Treasures shall guard the numinous, and a golden altar shall be raised to transmit to you the Way of the Divine Perfected. The Dao is revered, its Dharma weighty—once in forty thousand kalpas is it practiced, descending to the world to deliver beings. If kept secret, the True will descend; if revealed, calamity will arrive. Today, I impart this to you—clearly recognize it.\"\n\nThe Supreme Lord of the Dao rejoiced with exultant praise, standing facing north to receive the command.\n\nThe Celestial Venerable commanded the Nine Radiant Perfected of Great Brilliance, the Flying Immortals of the Ten Directions, and the Jade Lads attendant upon the scriptures to unfurl the Ninefold Radiant Jade Writ. They brought forth the golden script with purple characters, the jade-text vermilion chapters—three divisions, eight luminous scenes, and twenty-four diagrams—arrayed upon a white jade table suspended in the void. A nine-colored cloth, woven from cloud-essence and celestial patterns, served as a flying brocade canopy, draped and suspended above the scriptures.\n\nAll the Great Sages of the Heavens, the Boundless Celestial Venerables, the Flying Immortal Kings, and the Perfected of the Three Heavens simultaneously oversaw the covenant. They burned incense, scattered blossoms, chanted the numinous verses, and circumambulated the celestial palace, encircling the scriptures thrice. Following the ancient rites of reverent bearing and natural majesty, they transmitted the teachings to the Dao Lord. When the ritual was roughly concluded, the Three Luminaries returned to their positions, and the assembled Perfected withdrew from their seats.\n\nAt that time, in the Vermilion Clarity Heaven, whether man or woman, none failed to cultivate virtue, turn their hearts in faith, and aspire toward the Dao—all attained deliverance across the ages.\n\nIn the first year of the Supreme August Era, on the second day of the ninth month, the Later Sage, Lord Li, journeyed to the Western River and traversed the Eight Gates. There, he encountered the Celestial Venerable of Primordial Beginning, who rode in an eightfold luminous jade chariot, drawn by nine-colored dark dragons and threefold pure flying clouds. A procession of immortals followed, bearing floral banners, lions, and white cranes, their harmonious songs resounding as they floated through the void to convene above the Western River.\n\nLord Li bowed deeply and inquired of the Celestial King: \"Formerly, I received your instruction and was granted the celestial script of jade characters—twenty-four diagrams. Though I obtained the text, I have not fathomed its wondrous chapters; though I possess the illustrated eulogies, their images remain absent. In my cultivation, the mysteries are veiled, and the subtleties of the Dao elude me. Today, I meet the Celestial Venerable—my joy is beyond words. I pray you bestow completion and perfect the Way of the True.\"\n\nThereupon, the Celestial King exhaled the Jade Talisman of Internal Vision from the Cavernous Mystery and bestowed it upon Lord Li, instructing him to purify himself with a thousand-day fast, anoint his body with fivefold incense, and face east to ingest the talisman. \"When your form and spirit are fully prepared, you shall naturally attain penetrating insight, and all doubts will instantly dissolve.\"\n\nLord Li bowed deeply, received the celestial decree, and fully adhered to the heavenly rites. After a thousand-day fast, facing east to ingest the talisman, the Threefold Eightfold Luminous Spirits all manifested within his body. The golden script and jade characters of the twenty-four diagrams shone clearly in the void, their radiant patterns luminous and boundless, their intricate details naturally unfolding.\n\nAt that moment, he summoned the Immortal Overseer of Diagrams to render the images. The golden script with purple characters and jade-text vermilion chapters thus resounded in clarity. From the Nine Radiant Perfected Lady Wang of the Upper Prime of the Southern Culmen, the Eastern and Western Twin Floras, the Northern and Southern Perfected Lords, the immortals of the Five Peaks, to the Pure Void Perfected—all who received the true texts were those for whom the Later Sage had inscribed the diagrams, each appended accordingly.\n\n**Diagram of the Perfected Bathing in the Eastern Well** – *First True Qi of the Upper Division*\nThe Heavenly River pours into the Eastern Well,\nStone reflections, essence of the Water Mother.\nCircular light brushes the numinous radiance,\nMysterious brilliance responds to the exalted.\nPrimordial Beginning parts the long night,\nHeavenly beings follow the moon’s birth.\nBathing atop the Orchid Pool,\nDragons bear the long-rope jars.\nGolden youths scatter fragrant blossoms,\nJade maidens stream the Five Stars.\nCrowned and girded, they bathe in jade nectar,\nRefining and delivering the Five Immortal forms.\nTheir bodies fragrant, myriad spirits descend,\nRiding the luminous to ascend the exalted.\n\n**Diagram of the True Forms of the Five Peaks** – *Second True Qi of the Upper Division*\nWondrous, the Dao of Primordial Beginning,\nFive numina unfold the true writ.\nAbove, it opens the Dragon Han kalpa,\nResplendent, the Three Luminaries divide.\nTen divisions of flying celestial script,\nSecurely settle the Five Thearch spirits.\nThe numinous peaks receive the Mysterious Palace,\nBillowing forth treasure clouds.\nAbove, the undying qi,\nPlants its sprouts to refine the Five Immortals.\nJade mushrooms dissolve in the mysterious,\nBodies purified, naturally perfumed.\nWith concentrated thought, the exalted descend,\nConsorting with the Lords of the Empyrean.\n\n**Diagram of the Eight Histories of the Numinous Communication** – *Third True Qi of the Upper Division*\nThree luminaries exhale numinous blossoms,\nBrilliant, the Eight Gates open.\nWithin, the spirit of wisdom,\nClad in flying celestial robes.\nEight histories communicate the numinous qi,\nJade talismans penetrate the subtle.\nTreasure clouds reflect jade characters,\nMighty beasts shake celestial might.\nResplendent, the Eightfold Assembly Palace,\nMultitudes of numinous beings fly.\nWith concentrated thought, summon the true qi,\nFive talismans generate radiance.\nEightfold luminous chariots,\nAscend the void to enter the Purple Tenuity.\n\n**Diagram of the Six Jia Spirits Communing with the Numinous** – *Fourth True Qi of the Upper Division*\nNuminous palace, flying celestial maidens,\nSix Perfected feast in constant springs.\nEmbracing the sun, bearing the bright moon,\nGazing upward at the Three Dawn Lights.\nCommuning with the numinous, they fathom the subtle,\nPenetrating vision illumines the ten directions.\nSummoning the natural kitchens,\nFive mushrooms and six palaces flourish.\nTransforming and refining the myriad spirits,\nDividing forms, altering true countenances.\nTreading the void, they step into the Mysterious Capital,\nSoaring high into the Cavernous Void.\nAt times descending as golden auroral beings,\nRoaming the Threefold Pure chambers.\nHolding covenants, they urge flying canopies,\nCarefree, ascending the Jade Capital.\n\n**Diagram of the Nine Palaces and Purple Chambers** – *Fifth True Qi of the Upper Division*\nPurple chambers reflect the exalted clarity,\nPalaces mutually support one another.\nFragrant smoke encircles sun and moon,\nFlying immortals shade the Great Void.\nThe utmost Perfected, great sages,\nDesolate, flowing feathered script.\nDelivering the kalpas of all heavens,\nDust and sand begin one cycle.\nNine and five secure the numinous workings,\nLong preserving heaven and earth’s abode.\nWith concentrated thought, how could one be distant?\nThe Purple Palace generates my body.\n\n**Diagram of Primordial Beginning and the Grand Clarity** – *Sixth True Qi of the Upper Division*\nThe Grand Clarity knows no bounds,\nAzure qi billows in the Purple Tenuity.\nNuminous winds swiftly traverse the Seven Treasures,\nHow lush the jade trees!\nPurple phoenixes sing on long branches,\nDragon scales intertwine in flight.\nThe Supreme surveys the ten directions,\nAll heavens adjust their Dharma robes.\nCircumambulating the palace city,\nThree circuits open the long night.\nIf one can contemplate the numinous qi,\nOne shall naturally ride the luminous in flight.\n\n**Diagram of the True Dao’s Primal Integration** – *Seventh True Qi of the Upper Division*\nVast, the Primordial Beginning’s dawn,\nChaos’ qi yet undivided.\nThree colors transform within the void,\nRevolving like luminous clouds.\nThe obscure gives birth to true scenes,\nResplendent, unfolding numinous writ.\nBrilliant, it opens the long night,\nEstablishing heaven and earth’s roots.\nThe natural wondrous true qi,\nPure and constant, ever abiding.\nCirculating through the Great Nine Realms,\nOpening the gates of all heavens.\n\n**Diagram of the Western Ascent and Preservation Record** – *Eighth True Qi of the Upper Division*\nRiding the swift numinous qi,\nDriving the luminous to ascend the Western Palace.\n\nTo the land of Yuna That,\nTen thousand chariots come in allegiance.\nDivine demons bow their heads in submission,\nHeavenly kings all surrender in obeisance.\nForging gold to mold the true Dharma,\nThe world reveres the King of Dao and Virtue.\nThus bestowing the primal true qi,\nBy another name, it delivers an entire region.\nAt that time, an age of the Dao arose,\nCalled the Hall of Blessed Virtue.\n\n**Numinous Treasure Divine Immortals Diagram** states: *Upper Division’s Eighth True Spirit Diagram*\nWith the primordial qi of the Cavern-Heaven’s Origin,\nIt transforms and gives birth to the Eight Luminous Upper Perfected,\nWho guard the Upper Prime Palace within the human body,\nInducing the Upper Prime’s generative qi.\nWith focused mind, inwardly contemplating for eight years,\nThe Eight Perfected manifest in form,\nA thousand chariots and ten thousand riders,\nConveying luminous clouds to bear one aloft.\n\n**First Luminous Perfected of the Upper Prime**\nBrain spirit, named Awakened Origin Child, styled Dao Capital.\nColor: white. First luminous jade talisman,\nFirst spirit of the Upper Prime Cavern-Heaven’s qi division.\n\n**Second Luminous Perfected of the Upper Prime**\nHair spirit, named Mysterious Father Hua, styled Dao Balance.\nColor: dark. Second luminous jade talisman,\nSecond spirit of the Upper Prime Cavern-Heaven’s qi division.\n\n**Third Luminous Perfected of the Upper Prime**\nSkin spirit, named Penetrating Multitude Zhong, styled Dao Link.\nColor: yellow. Third luminous jade talisman,\nThird spirit of the Upper Prime Cavern-Heaven’s qi division.\n\n**Fourth Luminous Perfected of the Upper Prime**\nEye spirit, named Void Overseer, styled Dao Youth.\nColor: five-hued. Fourth luminous jade talisman,\nFourth spirit of the Upper Prime Cavern-Heaven’s qi division.\n\n**Fifth Luminous Perfected of the Upper Prime**\nNeck marrow spirit, named Numinous Plan Cover, styled Dao Cycle.\nColor: white. Fifth luminous jade talisman,\nFifth spirit of the Upper Prime Cavern-Heaven’s qi division.\n\n**Sixth Luminous Perfected of the Upper Prime**\nSpine spirit, named Beneficial Calendar Turn, styled Dao Pillar.\nColor: white jade. Sixth luminous jade talisman,\nSixth spirit of the Upper Prime Cavern-Heaven’s qi division.\n\n**Seventh Luminous Perfected of the Upper Prime**\nNose spirit, named Second Dragon King, styled Dao Subtle.\nColor: azure, yellow, white. Seventh luminous jade talisman,\nSeventh spirit of the Upper Prime Cavern-Heaven’s qi division.\n\n**Eighth Luminous Perfected of the Upper Prime**\nTongue spirit, named Originating Ridge Peak, styled Dao Fork.\nColor: red. Eighth luminous jade talisman,\nEighth spirit of the Upper Prime Cavern-Heaven’s qi division.\n\n**Numinous Treasure Divine Immortals Diagram** states:\nThe Eight Luminous Perfected’s jade talismans,\nWith the natural qi of the Upper Prime Cavern-Heaven,\nGovern the Upper Division’s Eight Luminous Perfected,\nWho guard the Upper Prime Palace within the human body.\nIngesting them for eight years,\nThe Eight Luminous manifest in form,\nEnabling one to penetrate the subtle and obscure,\nTo perceive the natural with clarity,\nTo sit in life and vanish in death,\nTo summon and attain celestial immortals,\nA thousand chariots and ten thousand riders,\nCloud carriages and feathered canopies,\nAscending at dawn in broad daylight.\n\n**Divine Immortals’ Subtle Numinous Transformations Diagram** – *Middle Division’s First True Qi*\nThe wondrous Dao bears no image,\nIts qi congeals in the High Mystery.\nBinding emptiness, it naturally arises,\nNuminous transformations revealing the Three Spirits.\nAt dawn, it draws the essence of the Five Stars,\nInhaling the midday nectar of the sun.\nAt dusk, it consumes the yellow radiance of the moon,\nReclining to refine the Five Immortals.\nTransforming scenes in accord with emptiness,\nSuddenly, spontaneously, it stands in the natural.\n\n**Divine Immortals’ Radiant Numinous Nine Heavens Diagram** – *Middle Division’s Second True Qi*\nThe ethereal qi of the Nine Heavens,\nPure and limpid, from the High Mystery.\nAuspicious clouds veil the layered void,\nGolden towers bear the purple mist.\nWithin lies the Palace of the Great Ultimate,\nWhere the Lord of the Dao arrays the Great Thousand.\nAzure groves fill the Brahma-vehicle,\nThe Ten Directions all with flying immortals.\nThe Southern Mound’s Hall of Blessed Virtue,\nFour seats all with pure guests.\nScattering blossoms to celebrate my vow,\nCarefree, without waves or ford.\n\n**Divine Immortals’ Nine Transformations Diagram** – *Middle Division’s Third True Qi*\nWondrous transformations respond to emptiness,\nFocused thought connects to the utmost numinous.\nAbove, consuming the qi of the Nine Heavens,\nGuiding and absorbing the essence of the Five Clouds.\nThree days to refine the myriad spirits,\nOne day to undergo nine transformations.\nShedding the body to roam the Nine Realms,\nPlayfully wandering the Three Realms’ courts.\nRiding the luminous to gaze upon the Great Simplicity,\nNuminous winds turn the green carriage.\nFlying mists encircle the Ten Absolutes,\nYellow banners summon the myriad spirits.\nThe Heavens descend with feathered regalia,\nLushly entering the Great Clarity.\n\n**Divine Immortals’ Constant Abiding Diagram** – *Middle Division’s Fourth True Qi*\nSilently invoking the obscure perfected,\nFocused stillness, the spirit naturally returns.\nWhen the clepsydra’s flow is exhausted, external responses fade,\nThe true qi spontaneously becomes serene and subtle.\nAccumulated resonance summons the wondrous perfected,\nThe Six Palaces generate radiance.\nMysterious union harmonizes with emptiness,\nThe myriad spirits respond in unison.\nEight luminous support the cloud canopy,\nResplendent, swift with feathered regalia.\nBearing me beyond the Great Brahma,\nCarefree, riding the void in flight.\n\n**Divine Immortals’ Guarding the One and Nurturing the Body Diagram** – *Middle Division’s Fifth True Qi*\nGuiding and absorbing the qi of the Nine Heavens,\nRubbing the hands to soothe the body’s form.\nBlocking the paths of deviant demons,\nPolishing and refining luminous clarity.\nPhoenix soaring, it connects to the true qi,\nDragon leaping, it governs the myriad spirits.\nAt dawn, the host of perfected assemble,\nNurturing the body, awakening the spirit’s birth.\nDetached, returning to guard the One,\nStill contemplation in the court of true qi.\nWith spirit complete, the luminous naturally flies,\nAscending to enter the Highest Clarity.\n\n**Divine Immortals’ Guarding the Spirit and Merging with the Luminous Diagram** – *Middle Division’s Sixth True Qi*\nThe Muddy Pellet houses the po soul’s camp,\nThe Middle Prime embraces the One’s palace.\nThe Cinnabar Field, threefold numinous mansion,\nMerging with the Hundred Spirits’ King.\nThe Three Passes govern the Nine Heavens,\nInhaling and exhaling the sun and moon’s light.\nThe Five Stars’ profound mystery nourishes,\nFlowing and infusing to fill the Six Stomachs.\nStill contemplation, the myriad qi return,\nSpirit at peace, the form also flourishes.\nThe Three Divisions’ Eight Luminous Perfected,\nBearing me into the Great Void.\nTo dwell long through heaven and earth’s kalpas,\nWithout beginning, forever without end.\n\n**Divine Immortals’ Silent Nurturing of Essence and Guarding the Will Diagram** – *Middle Division’s Seventh True Qi*\nAt dawn, consuming the Five Stars,\nFocused contemplation, guarding the Muddy Pellet.\nAt the center, swallowing the sun’s light,\nSilently reciting to warm the Crimson Palace.\nAt dusk, guiding the moon’s essence,\nIrrigating the Cinnabar Field’s Lord.\nThree perfected give birth to one luminous,\nTransformations and forms spontaneously divide.\nAt first sight, the myriad spirits return,\nAbsorbing qi, the luminous soars aloft.\nAscending to the sun and moon’s palaces,\nExiting and entering, observing the Eight Gates.\nThrough dragon’s kalpas without end,\nWondrous indeed, the numinous writ.\n\n**Divine Maidens of the Mushroom and Jade Diagram** – *Middle Division’s Eighth True Qi*\nFloating, the numinous qi scatters,\nMushroom blossoms follow the wind’s turn.\nThe Heavens shower fragrant blossoms,\nSun and moon bathe in numinous radiance.\nJade maidens hold golden platters,\nBrilliant, riding the void in flight.\nGazing upward, contemplating the perfected countenance’s descent,\nSwallowing the mushroom, the Five Spirits open.\nGuiding and absorbing luminous clarity,\nThrough ten thousand kalpas, the body does not decay.\n\n**Numinous Treasure Divine Immortals Diagram** states:\n*Middle Division’s Eight Luminous Spirit Diagram*\nWith the primordial numinous treasure’s Cavern Mystery qi,\nIt transforms and gives birth to the Eight Luminous Middle Perfected of the Middle Division,\nWho guard the Middle Prime Palace within the human body,\nInducing the Middle Prime’s generative qi.\n\nAfter eight years of concentrated meditation, the Eight Perfected manifest in form,\nA thousand chariots and ten thousand riders convey the divine immortals,\nJade canopies and feathered carriages soaring through the Great Void.\n\n**Middle Perfected First Luminous Spirit** – Throat Spirit:\nName: Hundred Streams Released, Style: Dao-Pervading.\nNine-colored, of the Cavern Mystery’s Middle Prime First Luminous Perfected Talisman Division, First Luminous Spirit.\n\n**Middle Perfected Second Luminous Spirit** – Lung Spirit:\nName: Pure Numinous Life, Style: Dao-Peaceful.\nWhite-colored, of the Cavern Mystery’s Middle Prime Second Luminous Perfected Talisman Division, Second Luminous Spirit.\n\n**Middle Perfected Third Luminous Spirit** – Heart Spirit:\nName: Radiant Yang Prospering, Style: Dao-Illuminating.\nRed-colored, of the Cavern Mystery’s Middle Prime Third Luminous Perfected Talisman Division, Third Luminous Spirit.\n\n**Middle Perfected Fourth Luminous Spirit** – Liver Spirit:\nName: Opening Lord Lad, Style: Dao-Pure.\nBlue-green-colored, of the Cavern Mystery’s Middle Prime Fourth Luminous Perfected Talisman Division, Fourth Luminous Spirit.\n\n**Middle Perfected Fifth Luminous Spirit** – Gallbladder Spirit:\nName: Dragon Virtue Restraining, Style: Dao-Released.\nBlue-green and yellow-green-colored, of the Cavern Mystery’s Middle Prime Fifth Luminous Perfected Talisman Division, Fifth Luminous Spirit.\n\n**Middle Perfected Sixth Luminous Spirit** – Left Kidney Spirit:\nName: Spring Prime Perfected, Style: Dao-Minister.\nFive-colored-robed, of the Cavern Mystery’s Middle Prime Sixth Luminous Perfected Talisman Division, Sixth Luminous Spirit.\n\n**Middle Perfected Seventh Luminous Spirit** – Right Kidney Spirit:\nName: Elephant Other None, Style: Dao-King.\nBlack-and-white-colored, of the Cavern Mystery’s Middle Prime Seventh Luminous Perfected Talisman Division, Seventh Luminous Spirit.\n\n**Middle Perfected Eighth Luminous Spirit** – Spleen Spirit:\nName: Treasure Without Lack, Style: Dao-Soaring.\nTrue yellow-colored, of the Cavern Mystery’s Middle Prime Eighth Luminous Perfected Talisman Division, Eighth Luminous Spirit.\n\nThe *Numinous Treasure Divine Immortals Diagram* states:\nThe Numinous Treasure Cavern Mystery Middle Prime Eight Luminous Perfected Talismans,\nWith the division’s Middle Prime Eight Luminous Perfected Spirits,\nAre stationed within the Middle Prime Palace of the human body.\nAfter eight years of ingestion, the Middle Prime Eight Luminous Spirits manifest in form,\nEnabling one to commune with the numinous and penetrate the divine,\nGaze through the eight directions,\nPartake of divine mushroom elixirs and jade nectar, the Five Qi’s mysterious sprouts,\nThe body radiates luminosity,\nDivine immortals ride in procession,\nSoaring through the vast heavens.\n\n**Divine Immortals Six Yin Jade Maidens Diagram** – Lower Division First Perfected Qi\nNuminous flight adorns the Supreme Ultimate,\nJade maidens in emerald and vermilion splendor.\nGracefully they emerge, soaring through the void,\nLightly borne upon emptiness.\nMysterious and wondrous, the natural qi,\nSix Yin spirits settle in constant form.\nLonging for rare communion,\nGazing upward, awaiting the descent of the Six Dings.\nWithin the golden chamber of radiance,\nGentle and sincere in devotion.\nMysterious resonance seeks its own,\nHow could it be bound by form or name?\nTransformations arise from mutual affinity,\nResponses echo as the spirit becomes numinous.\n\n**Divine Immortals Nine Primes Conveying Immortals Diagram** – Lower Division Second Perfected Qi\nJade Clarity illumines the Mystic Capital,\nTen sages revolve in the Purple Tenuity.\nDivine immortals emerge through clouds,\nFeathered robes fluttering.\nFragrant blossoms scatter with the wind,\nTen heavens ride upon clouds in flight.\nCinnabar skies reflect light canopies,\nSun and moon bathe in numinous radiance.\nGazing upward, yearning for the wondrous perfected to descend,\nSpiritual resonance returns to the heart.\n\n**Divine Immortals Guiding and Absorbing Diagram** – Lower Division Third Perfected Qi\nLush, the five-cloud mushrooms,\nMysterious radiance emits jade light.\nCongealed essence pervades the numinous palace,\nWandering through the palaces of sun and moon.\nFive colors govern the lofty perfected,\nFlowing essence irrigates the ten directions.\nBreathing without fatigue,\nSoaring through the heavens alongside golden countenances.\nGuiding and absorbing the numinous qi,\nMysterious nourishment fills the six stomachs.\nConcentrated meditation swiftly induces resonance,\nSitting in stillness, observing the empty cavern.\n\n**Divine Immortals Cavern’s Vast Guardian Diagram** – Lower Division Fourth Perfected Qi\nCalming the mind to order the Great Mystery,\nIn tranquil seclusion, the host of perfected reside.\nBelow, they govern the myriad famous mountains,\nCavern chambers pure and empty.\nFive colors illumine sun and moon,\nTheir ranks designated as the immortals’ storehouse.\nAbove, they govern the Purple Tenuity Palace,\nCompiling the celestial treasures’ registers.\nWithin, there is a practitioner of Unity,\nMeditating intently, awaiting the opening of the diagram.\nThe Five Elders oversee demonic trials,\nWith a steadfast heart, emotions naturally ease.\nThe body traverses the palaces of water and fire,\nThe name enters the Nine Heavens’ abode.\nHow fortunate is the present person,\nWho thus attains to ride the radiant carriage.\n\n**Divine Immortals Transformations and Concealments Diagram** – Lower Division Fifth Perfected Qi\nTransformations arise within the empty void,\nThe Five Phases foretell the body’s form.\nMeditating upon the natural qi,\nMetal, wood, water, fire, and essence.\nEarth serves as the concealed divination palace,\nSix Wus harmonize with the radiant courtyard.\nJade maidens transform garments,\nYouth and age respond to resonance.\nSubtly entering within the finest hairs,\nVastly embracing the mountains and peaks’ numen.\nCultivating the divine herbs of communion,\nThe body parallels the Eight Histories.\nMyriad transformations follow desire,\nCarefree, one may delight the heart.\n\n**Divine Immortals Gathering Mushrooms and Opening Mountains Diagram** – Lower Division Sixth Perfected Qi\nSacred peaks rise in towering majesty,\nVerdant mounds ascend to the luminous skies.\nFive mushrooms flourish on the mysterious ridges,\nImmortal herbs thrive on frost-kissed branches.\nAbove, there are gatherers of mushrooms,\nClad in feathered robes, riding the numinous winds.\nThe divine cavern opens after ten thousand kalpas,\nIn a single radiance, all heavens converge.\nAttaining the wondrous, tranquil, and awakened state,\nCountless sands pass as a single dawn.\n\n**Divine Immortals Luminous Mirror Diagram** – Lower Division Seventh Perfected Qi\nThe wondrous mirror generates awe-inspiring light,\nFlowing radiance illuminates the Eight Luminous.\nPenetrating clarity within square and circle,\nDistinguishing the true and discerning demonic essence.\nNaturally observing the layered Yin,\nIlluminating the forms of all heavens.\nSubduing demons to summon divine immortals,\nTransforming to enter the Purple Court.\n\n**Divine Immortals Boundless Supreme One Diagram** – Lower Division Eighth Perfected Qi\nResplendent, the First Perfected,\nThe body bears dragon and phoenix patterns.\nMajestic radiance penetrates the Nine Heavens,\nBrilliant illumination encompasses the great park’s expanse.\nAbove, it governs the heavens’ qi,\nPresiding as the lord of ten thousand immortals.\nMajestic, the ultimate Dao’s lineage,\nVast, the great Brahma’s gate.\n\nThe *Numinous Treasure Divine Immortals Diagram* states:\nThe Lower Division Eight Perfected Spirits Diagram,\nWith the Primordial Numinous Treasure’s Cavern Spirit qi,\nTransforms and gives birth to the natural Lower Division Eight Luminous Lower Perfected,\nWho guard the Lower Prime Palace within the human body,\nInducing the Lower Prime’s generative qi.\nAfter eight years of concentrated meditation, the Lower Prime Eight Perfected dispatch a thousand chariots and ten thousand riders,\nConveying divine immortals,\nFeathered canopies bearing the practitioner,\nTogether ascending to the Seven Treasures Grove.\n\n**Lower Perfected First Luminous Spirit** – Stomach Spirit:\nName: Together Coming Nurturing, Style: Dao-Unfolding.\nYellow-colored; of the Cavern Spirit’s Lower Prime First Luminous Perfected Talisman Division, First Luminous Spirit.\n\n**Lower Perfected Second Luminous Spirit** – Exhausted Intestine Spirit:\nName: Omen Soaring Prosperity, Style: Dao-Returning.\nYellow-red-colored, of the Cavern Spirit’s Lower Prime Second Luminous Perfected Talisman Division, Second Luminous Spirit.\n\n**Lower Perfected Third Luminous Spirit** – Large and Small Intestine Spirit:\nName: Bluegreen Conveying Remaining, Style: Dao-Kitchen.\n\nRed-yellow-colored, of the Cavern Spirit’s Lower Prime Third Luminous Perfected Talisman Division, Third Luminous Spirit.\n\n**Lower Perfected Fourth Luminous Spirit** – Torso Spirit:\nName: Receiving Abundant Vitality, Style: Dao-Void.\nNine-colored, of the Cavern Spirit’s Lower Prime Fourth Luminous Perfected Talisman Division, Fourth Luminous Spirit.\n\n**Lower Perfected Fifth Luminous Spirit** – Chest Diaphragm Spirit:\nName: Vast Radiant Abode, Style: Dao-Surging.\nWhite-colored, of the Cavern Spirit’s Lower Prime Fifth Luminous Perfected Talisman Division, Fifth Luminous Spirit.\n\n**Lower Perfected Sixth Luminous Spirit** – Two Flanks Spirit:\nName: Dispelling False Steeds, Style: Dao-Accomplished.\nRed-white-colored, of the Cavern Spirit’s Lower Prime Sixth Luminous Perfected Talisman Division, Sixth Luminous Spirit.\n\n**Lower Perfected Seventh Luminous Spirit** – Left Yang Spirit:\nName: Supporting Flowing Ascent, Style: Dao-Jade.\nBluegreen-yellow-white-colored, of the Cavern Spirit’s Lower Prime Seventh Luminous Perfected Talisman Division, Seventh Luminous Spirit.\n\n**Lower Perfected Eighth Luminous Spirit** – Right Yin Spirit:\nName: Enveloping Manifest Clarity, Style: Dao-Living.\nBluegreen-yellow-white-colored, of the Cavern Spirit’s Lower Prime Eighth Luminous Perfected Talisman Division, Eighth Luminous Spirit.\n\nThe *Illustrated Charts of Numinous Treasure Immortals* states: The Numinous Treasure Cavern Spirit’s Lower Prime Eight Luminous Talismans, with their divisions of the Eight Luminous Perfected Spirits, are stationed within the human body’s Lower Prime Palace. After ingesting them for eight years, the Eight Luminous Spirits of the Lower Prime manifest in human form, nurturing essence, replenishing qi, refining marrow, and congealing perfection. The body radiates luminous splendor, and the Eight Luminous Cloud Chariots bear one aloft in flight.\n\n*The Seven Treasures Immortal Charts of Jade Clarity*\n**Total: Three Eight Divisions of Perfected Qi**\n\nWhispering through the Three Clarities above,\nPerfected qi congeals in the Great Canopy of Heaven.\nJade groves and emerald-dark terraces,\nSun and moon gleam upon numinous chariots.\nFlying immortals in jade-green qi,\nRiding upon scenes borne by purple mist.\nLushly they emerge through clouds,\nIn throngs the Numinous Treasure immortals.\nCarefree in the Seven Treasures Grove,\nFive hues gleam with gold and silver.\nResonant echoes gather the assembly of perfected beings,\nNuminous hymns celebrate the myriad spirits.\nWith concentrated focus on the Three Eight Luminous Spirits,\nOne transcends steps to ascend the Gate of Treasures.\n\nIn the first year of the Radiant Crimson Epoch, on the first day of the first month, at the hour of noon, celestial light shone in four directions, purple clouds coiled through the heavens, the Eight Assemblies of Auspicious Clouds gathered, numinous winds swept away dust, sun and moon emitted radiance, the five stars poured forth essences, heaven and earth merged in primordial vastness, fragrant blossoms streamed and scattered, rivers and seas stilled, mountains and peaks concealed their mists. The Five Sufferings were all dissolved, the Three Bonds released souls, the Nine Dark Realms ceased their confrontations, eternal friendships forged alliances, the deaf and blind regained clarity, the Six Afflictions all healed. Earth’s treasuries opened, gold and jade revealed their forms, white bones generated qi, decayed remains returned to human form, dragons and unicorns leapt in joy, birds and beasts flew in delight, the Three Realms knew eternal bliss, humans and spirits rejoiced together. On this day of great celebration, the myriad kalpas were renewed.\n\nThe Primordial Heavenly Venerable extended his hospitality in the Jade Hall, upon the Crimson Radiance Heaven’s Southern Fire Peak within the Cinnabar Numinous Cavern Palace. He spread out five-colored silks, erected an altar of yellow gold, laid out a foundation of white jade, and with the Seven Treasures invoked the numinous. He transmitted the Cavern Mystery Golden Writ of Purple Characters and Cinnabar Scripts of the Spontaneous Numinous Charts, the Twenty-Four Perfected Ones of the Three Divisions and Eight Luminous Spirits, the flying immortals, divine immortals, earthbound immortals, and their hosts of chariots and riders, bestowing them upon the Supreme Peerless Dao Lord. Following the solemn protocols, the mysterious standards, and the luminous statutes of the Perfected, he initiated ninety-nine billion nine hundred ninety-nine million nine hundred ninety-nine thousand individuals whose names were inscribed in gold, whose characters were arrayed in the heavens, and who were destined for immortality.\n\nIn the midst of the great kalpic cycle, these texts shall be gathered and returned to the Seven Treasures Mysterious Terrace of the Great Canopy’s Purple Tenuity Palace. Now, under the governance of the Three Caverns, the Numinous Treasure’s Lower Teaching is first to initiate and ascend those who fill the vacancies among the immortal officials of the empty celestial ranks, as ordained by the Worthy Ones of the Central Heavens and the Masters of the Sacred Peaks.\n\nYour servant, [Name], formerly on [Day] of [Month] in [Year], at [Location] in [Prefecture and County], received the method from Master [Name] of the Sacred Peak, also known as the Black Emperor Perfected One or the Northern Peak Master. Your servant’s master, in turn, received the method on the thirteenth day of the seventh month in the year of the Earth Dog from Master Yang of the Central Peak in the Southern Cavern of the Central Heaven, as ordained to further transmit and initiate others. Those whose names were predestined in the golden registers and jade records, who harmonize with perfection, shall be appointed to celestial offices, traversing the Eight Poles, arriving from the midst of emptiness and non-being.\n\nNow, the predestined [Name], Perfected One of [Emperor] of [Heaven], born in the [Stem-Branch] year, whose fate belongs to [Heaven] under [Emperor]’s registry, born in [Month], or the Red Emperor Perfected One [Name], born in the year of the Fire Horse, whose fate belongs to the Vermilion Heaven’s Southern Emperor, registered in the seventh month, refined by the Primordial Qi of the Pure Heaven, whose bones and fate harmonize with perfection, is destined to fill the vacancy of the Second Rank Immortal of the Cavern Mystery. In this year of [Stem-Branch], on [Day] of [Month], in [Heaven], following the ancient statutes of the former master’s luminous great method, ascending the yellow altar, the Seven Treasures securing the numinous, the five hues clarifying the immortal, [Name] received the initiation of the Spontaneous Numinous Treasure Cavern Mystery Golden Writ of Purple Characters and Cinnabar Scripts, the Charts of the Twenty-Four Perfected Ones of the Three Eight Divisions, and the immortal hosts of chariots and riders. Having received the great method, [Name] is commended by the Three Realms, protected and illuminated by the Numinous Treasure, transcends the Five Paths, and has their name inscribed in the golden tablets and jade records of the Purple Palace, ascending to the rank of Perfected Immortal.\n\nHenceforth, they may roam freely, clad in celestial regalia and feathered garments, borne by cloud chariots and dragon carriages, preceded by the Three-Seven colored standards and phoenix songs, followed by the celestial zither, with the Five Emperors opening the Way and the Supreme Ultimate attending the chariot. Immortal youths and jade maidens scatter blossoms and burn incense, jeweled canopies cast their shade, and guardian spirits escort their journey. [Name]’s qi aligns with the Cavern Mystery, their body ascends to the immortal palace. They must observe proper conduct, guard their speech, refrain from all worldly entanglements, sever external distractions, calm the mind in serene silence, and focus their will upon the method. They must not allow turbidity or mutual inducements to disrupt their qi. In every action, they shall practice great compassion, broadly initiating all beings, ensuring the nation’s peace and the people’s prosperity, unifying the Four Seas in tranquility. Their seven generations of ancestors shall all ascend and be initiated, their bodies entering luminous clarity, and they shall be reborn early among humankind. When the great kalpic cycle ends, they shall together ascend to the Clarity Above, carefree in the Golden Gates and the Seven Treasures Grove.\n\nThose who have not yet attained immortal initiation shall prepare for seven years until their celestial qi is fully cultivated. When the celestial signs manifest their numinous response, those destined for immortality shall transmit the method according to the statutes. If there is no spiritual resonance, the method shall not be disseminated for forty thousand kalpas. Those who break their vows, betray their trust, or leak the numinous texts shall have their parents in life and death eternally confined to the dark night, their bodies departing the Five Paths to endure the wind blades for ten thousand kalpas. They dare not speak of this. Following the statutes with utmost sincerity, they shall share the same immortal fate in life and death, their conduct unified in the luminous texts.\n\nIn the Nine Qi Heaven, the Cavernous Azure Numinous Demon King, surnamed [ ], named [ ], safeguards Master [ ] of [ ] Sacred Peak, ranked among the Upper Immortals of the Three Realms.\n\nIn the Nine Qi Heaven, the Cavernous Vermilion Numinous Demon King, surnamed [ ], named [ ], safeguards Master [ ] of [ ] Sacred Peak, ranked among the Upper Immortals of the Three Realms.\n\nIn the Central Sacred Peak, the High August Heaven’s Cavernous Yellow Numinous Demon King, surnamed [ ], named [ ], safeguards Master [ ] of [ ] Sacred Peak, ranked among the Upper Immortals of the Three Realms.\n\nIn the Seven Qi Heaven, the Cavernous White Numinous Demon King, surnamed [ ], named [ ], safeguards Master [ ] of [ ] Sacred Peak, ranked among the Upper Immortals of the Three Realms.\n\nIn the Five Qi Heaven, the Cavernous Black Numinous Demon King, surnamed [ ], named [ ], safeguards Master [ ] of [ ] Sacred Peak, ranked among the Upper Immortals of the Three Realms.\n\nWithin the Cavern-Heavens of the Upper Realm:\n- The Twenty-Four True Spirits of the First Radiance, Brain Palace, Dao Metropolis, Divine Immortal Cavern-Heaven, Niwan Flying Heaven Upper Immortals.\n- The Twenty-Four True Spirits of the Second Radiance, Hair Palace, Dao Balance, Divine Immortal Cavern-Heaven, Essence-Pervading Flying Heaven Upper Immortals.\n- The Twenty-Four True Spirits of the Third Radiance, Skin Palace, Dao Union, Divine Immortal Cavern-Heaven, Plumed Regalia Flying Heaven Upper Immortals.\n- The Twenty-Four True Spirits of the Fourth Radiance, Eye Palace, Dao Youth, Divine Immortal Cavern-Heaven, Cavernous Luminance Flying Heaven Upper Immortals.\n- The Twenty-Four True Spirits of the Fifth Radiance, Crown Marrow Palace, Dao Periphery, Divine Immortal Cavern-Heaven, True-Congealing Flying Heaven Upper Immortals.\n- The Twenty-Four True Spirits of the Sixth Radiance, Spine Palace, Dao Pillar, Divine Immortal Cavern-Heaven, Passage-Pervading Flying Heaven Upper Immortals.\n- The Twenty-Four True Spirits of the Seventh Radiance, Nose Palace, Dao Subtlety, Divine Immortal Cavern-Heaven, Qi-Bestowing Flying Heaven Upper Immortals.\n- The Twenty-Four True Spirits of the Eighth Radiance, Tongue Palace, Dao Branch, Divine Immortal Cavern-Heaven, Wisdom Flying Heaven Upper Immortals.\n\nFrom the Eight Radiant Cavern-Heavens of the Upper Realm:\n- Eighty-One Flying, Three-Five Direct Numinous Divine Immortals, Flying Heaven Life-Conveying Merit Recorders.\n- Eighty-One Flying, Three-Five Direct Numinous Divine Immortals, Orthodox Unity Ascending Mystery Merit Recorders.\n- Eighty-One Flying, Three-Five Direct Numinous Divine Immortals, Direct Envoys of Generative Qi Merit Recorders.\n- Eighty-One Flying, Three-Five Direct Numinous Divine Immortals, Numinous Treasure Azure Emperor Merit Recorders.\n- Eighty-One Flying, Three-Five Direct Numinous Divine Immortals, Numinous Treasure Vermilion Emperor Merit Recorders.\n- Eighty-One Flying, Three-Five Direct Numinous Divine Immortals, Numinous Treasure Yellow Emperor Merit Recorders.\n- Eighty-One Flying, Three-Five Direct Numinous Divine Immortals, Numinous Treasure White Emperor Merit Recorders.\n- Eighty-One Flying, Three-Five Direct Numinous Divine Immortals, Numinous Treasure Black Emperor Merit Recorders.\n- Eighty-One Spontaneous Numinous Treasure Divine Immortals, Envoys of Passage and Life-Conveyance.\n- Eighty-One Spontaneous Numinous Treasure Divine Immortals, Flying Heaven Messengers of Transmission.\n- Eighty-One Spontaneous Numinous Treasure Divine Immortals, Qi-Generating Envoys of Incense Offering.\n- Eighty-One Spontaneous Numinous Treasure Divine Immortals, Cavernous Luminance Azure Emperor Envoys.\n- Eighty-One Spontaneous Numinous Treasure Divine Immortals, Cavernous Luminance Vermilion Emperor Envoys.\n- Eighty-One Spontaneous Numinous Treasure Divine Immortals, Cavernous Luminance Yellow Emperor Envoys.\n- Eighty-One Spontaneous Numinous Treasure Divine Immortals, Cavernous Luminance White Emperor Envoys.\n- Eighty-One Spontaneous Numinous Treasure Divine Immortals, Cavernous Luminance Black Emperor Envoys.\n- Thirty-Two Spontaneous Numinous Treasure Divine Immortals, Direct Attendants of Fast Supervision.\n- Thirty-Two Spontaneous Numinous Treasure Divine Immortals, Direct Attendants of Fast Administration.\n- Thirty-Two Spontaneous Numinous Treasure Divine Immortals, Scribes of Transmission.\n- Thirty-Two Spontaneous Numinous Treasure Divine Immortals, Scribes of Incense Offering.\n- Thirty-Two Spontaneous Numinous Treasure Divine Immortals, Merit-Inspecting Heralds.\n- Thirty-Two Spontaneous Numinous Treasure Divine Immortals, Verifying Heralds.\n- Thirty-Two Spontaneous Numinous Treasure Divine Immortals, Jade Lads of Incense Attendance.\n- Thirty-Two Spontaneous Numinous Treasure Divine Immortals, Jade Maidens of Flower Scattering.\n\nFrom the Thirty-Two Heavens of the Upper Realm’s Eight Radiant Cavern-Heavens:\n- Thirty-Two Spontaneous Numinous Treasure Void Direct Talismans.\n- Thirty-Two Spontaneous Numinous Treasure Upper Prime Direct Talismans.\n- Thirty-Two Spontaneous Numinous Treasure Sun-Moon Direct Talismans.\n- Thirty-Two Spontaneous Numinous Treasure Transmission Direct Talismans.\n- Thirty-Two Spontaneous Numinous Treasure Memorial Direct Talismans.\n- Thirty-Two Spontaneous Numinous Treasure Fast Direct Talismans.\n- Thirty-Two Spontaneous Numinous Treasure Incense Attendance Direct Talismans.\n\nFrom the Thirty-Two Heavens of the Upper Realm’s Eight Radiant Cavern-Heavens:\n- Thirty-Two Spontaneous Numinous Treasure Five Thearchs Direct Talismans, each thirty-two in number.\n- Thirty-Two Spontaneous Numinous Treasure Yang Palace Bingyin Refining-Brain Generative-Soul Flying Heavenly Perfected, each three thousand two hundred in number.\n- Thirty-Two Spontaneous Numinous Treasure Yin Palace Bingshen Refining-Essence Generative-Soul Flying Heavenly Perfected, each three thousand two hundred in number.\n- Thirty-Two Spontaneous Numinous Treasure Yang Palace Bingzi Refining-Skin Flying Heavenly Perfected, each three thousand two hundred in number.\n- Thirty-Two Spontaneous Numinous Treasure Yin Palace Bingwu Refining-Eyes Flying Heavenly Perfected, each three thousand two hundred in number.\n- Thirty-Two Spontaneous Numinous Treasure Yang Palace Dinghai Refining-Marrow Flying Heavenly Perfected, each three thousand two hundred in number.\n- Thirty-Two Spontaneous Numinous Treasure Yin Palace Dingsi Refining-Spine Flying Heavenly Perfected, each three thousand two hundred in number.\n- Thirty-Two Spontaneous Numinous Treasure Yang Palace Dingmao Refining-Nose Flying Heavenly Perfected, each three thousand two hundred in number.\n- Thirty-Two Spontaneous Numinous Treasure Yin Palace Dingyou Refining-Tongue Generative-Corpse Flying Heavenly Perfected, each three thousand two hundred in number.\n\nFrom the Eight Radiant Cavern-Heavens of the Supreme Mystery Upper Realm:\n- Spontaneous Numinous Treasure Divine Immortals Delivering Destiny: Heavenly Immortals’ Troops and Cavalry, each nine hundred million myriad in number.\n- Spontaneous Numinous Treasure Divine Immortals Delivering Destiny: Earthly Immortals’ Troops and Cavalry, each nine hundred million myriad in number.\n- Spontaneous Numinous Treasure Divine Immortals Delivering Destiny: Flying Immortals’ Troops and Cavalry, each nine hundred million myriad in number.\n- Spontaneous Numinous Treasure Divine Immortals Delivering Destiny: Perfected Persons’ Troops and Cavalry, each nine hundred million myriad in number.\n- Spontaneous Numinous Treasure Divine Immortals Delivering Destiny: Divine Persons’ Troops and Cavalry, each nine hundred million myriad in number.\n- Spontaneous Numinous Treasure Divine Immortals Delivering Destiny: Sun-Moon Troops and Cavalry, each nine hundred million myriad in number.\n- Spontaneous Numinous Treasure Divine Immortals Delivering Destiny: Constellation Troops and Cavalry, each nine hundred million myriad in number.\n- Spontaneous Numinous Treasure Divine Immortals Delivering Destiny: Nine Palaces Troops and Cavalry, each nine hundred million myriad in number.\n- Spontaneous Numinous Treasure Divine Immortals Delivering Destiny: Five Thearchs’ Troops and Cavalry, each nine hundred million myriad in number.\n- Spontaneous Numinous Treasure Divine Immortals Delivering Destiny: Five Marchmounts’ Troops and Cavalry, each nine hundred million myriad in number.\n- Spontaneous Numinous Treasure Divine Immortals Delivering Destiny: Three Rivers and Four Seas’ Troops and Cavalry, each nine hundred million myriad in number.\n- Spontaneous Numinous Treasure Divine Immortals Delivering Destiny: All-Heaven Supervising Immortals’ Troops and Cavalry, each nine hundred million myriad in number.\n- Spontaneous Numinous Treasure Divine Immortals Extinguishing Destiny and Generating Corpse: Troops and Cavalry, each nine hundred million myriad in number.\n- Spontaneous Numinous Treasure Divine Immortals Initiating Destiny and Renewing Life: Troops and Cavalry, each nine hundred million myriad in number.\n- Spontaneous Numinous Treasure Divine Immortals: Golden Dragon Cavalry, each nine hundred million myriad in number.\n- Spontaneous Numinous Treasure Divine Immortals: Flying Dragon Cavalry, each nine hundred million myriad in number.\n- Spontaneous Numinous Treasure Divine Immortals: Roaming Dragon Cavalry, each nine hundred million myriad in number.\n- Spontaneous Numinous Treasure Divine Immortals: Divine Dragon Cavalry, each nine hundred million myriad in number.\n- Spontaneous Numinous Treasure Divine Immortals: Post Dragon Cavalry, each nine hundred million myriad in number.\n- Spontaneous Numinous Treasure Divine Immortals: Cloud Dragon Cavalry, each nine hundred million myriad in number.\n- Spontaneous Numinous Treasure Divine Immortals: Dragon-Tiger Cavalry, each nine hundred million myriad in number.\n- Spontaneous Numinous Treasure Divine Immortals: Dragon-Soaring Cavalry, each nine hundred million myriad in number.\n\nFrom the Eight Radiant Cavern-Heavens of the Supreme Mystery Upper Realm:\n- Spontaneous Numinous Treasure Divine Immortals Delivering Destiny: Nine Qi Heavenly Officials Azure Jade Maidens, each nine thousand in number.\n- Spontaneous Numinous Treasure Divine Immortals Delivering Destiny: Three Qi Heavenly Officials Vermilion Jade Maidens, each three thousand in number.\n- Spontaneous Numinous Treasure Divine Immortals Delivering Destiny: Seven Qi Heavenly Officials Luminous Stone Jade Maidens, each seven thousand in number.\n- Spontaneous Numinous Treasure Divine Immortals Delivering Destiny: Five Qi Heavenly Officials Mysterious Nourishing Jade Maidens, each fifty in number.\n- Spontaneous Numinous Treasure Divine Immortals Delivering Destiny: Central Yellow Upper Heavenly Officials Numinous Cord Jade Maidens, each twelve thousand in number.\n\nFrom the Eight Radiant Cavern-Heavens of the Supreme Mystery Upper Realm:\n- Spontaneous Numinous Treasure Divine Immortals: Eastern Marchmount Azure Thearch Master of Charts Flying Heavenly Officers, each twenty-four in number.\n- Spontaneous Numinous Treasure Divine Immortals: Southern Marchmount Vermilion Thearch Master of Charts Flying Heavenly Officers, each twenty-four in number.\n- Spontaneous Numinous Treasure Divine Immortals: Central Marchmount Yellow Thearch Master of Charts Flying Heavenly Officers, each twenty-four in number.\n- Spontaneous Numinous Treasure Divine Immortals: Western Marchmount White Thearch Master of Charts Flying Heavenly Officers, each twenty-four in number.\n- Spontaneous Numinous Treasure Divine Immortals: Northern Marchmount Black Thearch Master of Charts Flying Heavenly Officers, each twenty-four in number.\n\n*(Four characters per line, arranged in eight lines, all with text corners, written in black.)*\n\nFrom the Middle Cavern Mystery’s First Radiance:\n- Throat Mansion True Spirits Dao-Pervading Divine Immortals: Middle Cavern Mystery Refining-Soul Flying Heavenly Transcendent Officials, each twenty-four in number.\n\nFrom the Middle Cavern Mystery’s Second Radiance:\n- Lung Mansion True Spirits Dao-Balancing Divine Immortals: Middle Cavern Mystery Refining-Spirit Flying Heavenly Transcendent Officials, each twenty-four in number.\n\nFrom the Middle Cavern Mystery’s Third Radiance:\n- Heart Mansion True Spirits Dao-Illuminating Divine Immortals: Middle Cavern Mystery Refining-Immortal Flying Heavenly Transcendent Officials, each twenty-four in number.\n\nFrom the Middle Cavern Mystery’s Fourth Radiance:\n- Liver Mansion True Spirits Dao-Purifying Divine Immortals: Middle Cavern Mystery Wisdom-Sage Flying Heavenly Transcendent Officials, each twenty-four in number.\n\nFrom the Middle Cavern Mystery’s Fifth Radiance:\n- Gallbladder Mansion True Spirits Dao-Releasing Divine Immortals: Middle Cavern Mystery Stabilizing-Will Flying Heavenly Transcendent Officials, each twenty-four in number.\n\nFrom the Middle Cavern Mystery’s Sixth Radiance:\n- Left Kidney Mansion True Spirits Dao-Ministering Divine Immortals: Middle Cavern Mystery Generating-Spirit Flying Heavenly Transcendent Officials, each twenty-four in number.\n\nFrom the Middle Cavern Mystery’s Seventh Radiance:\n- Right Kidney Mansion True Spirits Dao-Ruling Divine Immortals: Middle Cavern Mystery Generating-Immortal Flying Heavenly Transcendent Officials, each twenty-four in number.\n\nFrom the Middle Cavern Mystery’s Eighth Radiance:\n- Spleen Mansion True Spirits Dao-Ascending Divine Immortals: Middle Cavern Mystery Guarding-Void Flying Heavenly Transcendent Officials, each twenty-four in number.\n\nMiddle Cavern Eight Radiance Flying Three-Five Direct Numinous Divine Immortals Flying Heavenly Life-Conferring Attendants, each eighty-one in number.\nMiddle Cavern Eight Radiance Flying Three-Five Direct Numinous Divine Immortals Orthodox Unity Ascending-Mystery Attendants, each eighty-one in number.\nMiddle Cavern Eight Radiance Flying Three-Five Direct Numinous Divine Immortals Direct qi-Generating Attendants, each eighty-one in number.\nMiddle Cavern Eight Radiance Flying Three-Five Direct Numinous Divine Immortals Numinous Treasure Azure Thearch Attendants, each eighty-one in number.\nMiddle Cavern Eight Radiance Flying Three-Five Direct Numinous Divine Immortals Numinous Treasure Vermilion Thearch Attendants, each eighty-one in number.\nMiddle Cavern Eight Radiance Flying Three-Five Direct Numinous Divine Immortals Numinous Treasure Yellow Thearch Attendants, each eighty-one in number.\nMiddle Cavern Eight Radiance Flying Three-Five Direct Numinous Divine Immortals Numinous Treasure White Thearch Attendants, each eighty-one in number.\nMiddle Cavern Eight Radiance Flying Three-Five Direct Numinous Divine Immortals Numinous Treasure Black Thearch Attendants, each eighty-one in number.\n\nMiddle Cavern Eight Radiance Flying Spontaneous Numinous Treasure Divine Immortals Perfected-Conveying Life-Conferring Envoys, each eighty-one in number.\nMiddle Cavern Eight Radiance Flying Spontaneous Numinous Treasure Divine Immortals Transmission Flying Heavenly Envoys, each eighty-one in number.\nMiddle Cavern Eight Radiance Flying Spontaneous Numinous Treasure Divine Immortals Incense-Official qi-Generating Envoys, each eighty-one in number.\nMiddle Cavern Eight Radiance Flying Spontaneous Numinous Treasure Cavern-Illuminating Azure Thearch Envoys, each eighty-one in number.\nMiddle Cavern Eight Radiance Flying Spontaneous Numinous Treasure Cavern-Illuminating Vermilion Thearch Envoys, each eighty-one in number.\nMiddle Cavern Eight Radiance Flying Spontaneous Numinous Treasure Cavern-Illuminating Yellow Thearch Envoys, each eighty-one in number.\nMiddle Cavern Eight Radiance Flying Spontaneous Numinous Treasure Cavern-Illuminating White Thearch Envoys, each eighty-one in number.\nMiddle Cavern Eight Radiance Flying Spontaneous Numinous Treasure Cavern-Illuminating Black Thearch Envoys, each eighty-one in number.\n\nMiddle Cavern Eight Radiance Flying Spontaneous Numinous Treasure Divine Immortals Fast-Overseeing Direct Attendants, each thirty-two in number.\nMiddle Cavern Eight Radiance Flying Spontaneous Numinous Treasure Divine Immortals Fast-Directing Direct Attendants, each thirty-two in number.\nMiddle Cavern Eight Radiance Flying Spontaneous Numinous Treasure Divine Immortals Message-Transmitting Scribes, each thirty-two in number.\nMiddle Cavern Eight Radiance Flying Spontaneous Numinous Treasure Divine Immortals Incense-Presenting Scribes, each thirty-two in number.\nMiddle Cavern Eight Radiance Flying Spontaneous Numinous Treasure Divine Immortals Merit-Overseeing Heralds, each thirty-two in number.\nMiddle Cavern Eight Radiance Flying Spontaneous Numinous Treasure Divine Immortals Affairs-Examining Heralds, each thirty-two in number.\nMiddle Cavern Eight Radiance Flying Spontaneous Numinous Treasure Divine Immortals Incense-Attending Jade Lads, each thirty-two in number.\nMiddle Cavern Eight Radiance Flying Spontaneous Numinous Treasure Divine Immortals Flower-Scattering Jade Maidens, each thirty-two in number.\n\nMiddle Thirty-Two Heavens Middle Cavern Eight Radiance Flying Spontaneous Numinous Treasure Void Direct Talismans, each thirty-two in number.\nMiddle Thirty-Two Heavens Middle Cavern Eight Radiance Flying Spontaneous Numinous Treasure Upper Prime Direct Talismans, each thirty-two in number.\nMiddle Thirty-Two Heavens Middle Cavern Eight Radiance Flying Spontaneous Numinous Treasure Sun-Moon Direct Talismans, each thirty-two in number.\nMiddle Thirty-Two Heavens Middle Cavern Eight Radiance Flying Spontaneous Numinous Treasure Message-Transmitting Direct Talismans, each thirty-two in number.\nMiddle Thirty-Two Heavens Middle Cavern Eight Radiance Flying Spontaneous Numinous Treasure Memorial-Presenting Direct Talismans, each thirty-two in number.\nMiddle Thirty-Two Heavens Middle Cavern Eight Radiance Flying Spontaneous Numinous Treasure Fast-Overseeing Direct Talismans, each thirty-two in number.\nMiddle Thirty-Two Heavens Middle Cavern Eight Radiance Flying Spontaneous Numinous Treasure Incense-Attending Direct Talismans, each thirty-two in number.\nMiddle Thirty-Two Heavens Middle Cavern Eight Radiance Flying Spontaneous Numinous Treasure Five Thearchs Direct Talismans, each thirty-two in number.\n\nMiddle Thirty-Two Heavens Middle Cavern First Radiance Numinous Treasure Yang Palace Bingchen Throat-Refining Flying Immortals Perfected Ones, each three thousand two hundred in number.\nMiddle Thirty-Two Heavens Middle Cavern Second Radiance Numinous Treasure Yin Palace Bingxu Lung-Refining Flying Immortals Perfected Ones, each three thousand two hundred in number.\nMiddle Thirty-Two Heavens Middle Cavern Third Radiance Numinous Treasure Yang Palace Dingchou Heart-Refining Flying Immortals Perfected Ones, each three thousand two hundred in number.\nMiddle Thirty-Two Heavens Middle Cavern Fourth Radiance Numinous Treasure Yin Palace Dingwei Liver-Refining Flying Immortals Perfected Ones, each three thousand two hundred in number.\nMiddle Thirty-Two Heavens Middle Cavern Fifth Radiance Numinous Treasure Yang Palace Wuyin Gallbladder-Refining Flying Immortals Perfected Ones, each three thousand two hundred in number.\nMiddle Thirty-Two Heavens Middle Cavern Sixth Radiance Numinous Treasure Yin Palace Wushen Left-Kidney-Refining Flying Immortals Perfected Ones, each three thousand two hundred in number.\n\nMiddle Thirty-Two Heavens Middle Cavern Seventh Radiance Numinous Treasure Yang Palace Wuzi Right-Kidney-Refining Flying Immortals Perfected Ones, each three thousand two hundred in number.\nMiddle Thirty-Two Heavens Middle Cavern Eighth Radiance Numinous Treasure Yin Palace Wuwu Spleen-Refining Flying Immortals Perfected Ones, each three thousand two hundred in number.\n\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Life-Delivering Heavenly Immortals Troops and Cavalry, each nine hundred million myriad riders.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Life-Delivering Earthly Immortals Troops and Cavalry, each nine hundred million myriad riders.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Life-Delivering Flying Immortals Troops and Cavalry, each nine hundred million myriad riders.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Life-Delivering Perfected Ones Troops and Cavalry, each nine hundred million myriad riders.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Life-Delivering Divine Beings Troops and Cavalry, each nine hundred million myriad riders.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Life-Delivering Sun and Moon Troops and Cavalry, each nine hundred million myriad riders.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Life-Delivering Constellations Troops and Cavalry, each nine hundred million myriad riders.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Life-Delivering Nine Palaces Troops and Cavalry, each nine hundred million myriad riders.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Life-Delivering Five Emperors Troops and Cavalry, each nine hundred million myriad riders.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Life-Delivering Five Peaks Troops and Cavalry, each nine hundred million myriad riders.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Life-Delivering Three Rivers and Four Seas Troops and Cavalry, each nine hundred million myriad riders.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Life-Delivering All-Heaven Supervising Immortals Troops and Cavalry, each nine hundred million myriad riders.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Salvation-Extinguishing Corpse-Generating Troops and Cavalry, each nine hundred million myriad riders.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Liberation-Rebirth-Initiating Troops and Cavalry, each nine hundred million myriad riders.\n\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Golden Dragon Cavalry, each nine hundred million myriad hosts.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Flying Dragon Cavalry, each nine hundred million myriad hosts.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Roaming Dragon Cavalry, each nine hundred million myriad hosts.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Divine Dragon Cavalry, each nine hundred million myriad hosts.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Courier Dragon Cavalry, each nine hundred million myriad hosts.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Cloud Dragon Cavalry, each nine hundred million myriad hosts.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Dragon-Tiger Cavalry, each nine hundred million myriad hosts.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Dragon-Soaring Cavalry, each nine hundred million myriad hosts.\n\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Life-Delivering Nine Qi Heavenly Officials Azure Jade Maidens, each nine thousand in number.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Life-Delivering Three Qi Heavenly Officials Vermilion Jade Maidens, each three thousand in number.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Life-Delivering Seven Qi Heavenly Officials Luminous Stone Jade Maidens, each seven thousand in number.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Life-Delivering Five Qi Heavenly Officials Mysterious Nourishment Jade Maidens, each five thousand in number.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Life-Delivering Central Yellow High Heavenly Officials Numinous Button Jade Maidens, each twelve thousand in number.\n\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Eastern Peak Azure Emperor Chart-Holding Flying Heavenly Officers, each twenty-four in number.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Southern Peak Vermilion Emperor Chart-Holding Flying Heavenly Officers, each twenty-four in number.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Central Peak Yellow Emperor Chart-Holding Flying Heavenly Officers, each twenty-four in number.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Western Peak White Emperor Chart-Holding Flying Heavenly Officers, each twenty-four in number.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Northern Peak Black Emperor Chart-Holding Flying Heavenly Officers, each twenty-four in number.\n\nRight: four characters per line, totaling eight lines, all with textual corners, written in vermilion.\n\nLower Cavern First Radiance Stomach Mansion Perfected Spirits Dao-Extending Divine Immortals Cavern Numinous Penetrating Origin Flying Heavenly Transcendent Officials, each twenty-four in number.\nLower Cavern Second Radiance Exhausted Intestine Mansion Perfected Spirits Dao-Returning Divine Immortals Cavern Numinous Mysterious Void Flying Heavenly Transcendent Officials, each twenty-four in number.\nLower Cavern Third Radiance Large and Small Intestine Mansion Perfected Spirits Dao-Kitchen Divine Immortals Cavern Numinous Hidden Emptiness Flying Heavenly Transcendent Officials, each twenty-four in number.\nLower Cavern Fourth Radiance Torso Center Mansion Perfected Spirits Dao-Void Divine Immortals Cavern Numinous Illuminating Flying Heavenly Transcendent Officials, each twenty-four in number.\nLower Cavern Fifth Radiance Chest Diaphragm Mansion Perfected Spirits Dao-Surging Divine Immortals Cavern Numinous Sun-Concealing Flying Heavenly Transcendent Officials, each twenty-four in number.\nLower Cavern Sixth Radiance Two Flanks Mansion Perfected Spirits Dao-Accomplishing Divine Immortals Cavern Numinous Form-Dissolving Flying Heavenly Transcendent Officials, each twenty-four in number.\nLower Cavern Seventh Radiance Left Yang Mansion Perfected Spirits Dao-Jade Tablet Divine Immortals Cavern Numinous Vanishing Traces Flying Heavenly Transcendent Officials, each twenty-four in number.\nLower Cavern Eighth Radiance Right Yin Mansion Perfected Spirits Dao-Generating Divine Immortals Cavern Numinous Soaring Void Flying Heavenly Transcendent Officials, each twenty-four in number.\n\nLower Cavern Eighth Radiance Cavern Numinous Flying Three-Five Direct Numinous Divine Immortals Flying Heavenly Transcendents Life-Conveying Merit Recorders, each eighty-one in number.\nLower Cavern Eighth Radiance Cavern Numinous Flying Three-Five Direct Numinous Divine Immortals Orthodox Unity Ascending Mystery Merit Recorders, each eighty-one in number.\nLower Cavern Eighth Radiance Cavern Numinous Flying Three-Five Direct Numinous Divine Immortals Direct Envoys Primordial Qi Merit Recorders, each eighty-one in number.\nLower Cavern Eighth Radiance Cavern Numinous Flying Three-Five Direct Numinous Divine Immortals Numinous Treasure Azure Emperor Merit Recorders, each eighty-one in number.\nLower Cavern Eighth Radiance Cavern Numinous Flying Three-Five Direct Numinous Divine Immortals Numinous Treasure Vermilion Emperor Merit Recorders, each eighty-one in number.\nLower Cavern Eighth Radiance Cavern Numinous Flying Three-Five Direct Numinous Divine Immortals Numinous Treasure Yellow Emperor Merit Recorders, each eighty-one in number.\nLower Cavern Eighth Radiance Cavern Numinous Flying Three-Five Direct Numinous Divine Immortals Numinous Treasure White Emperor Merit Recorders, each eighty-one in number.\nLower Cavern Eighth Radiance Cavern Numinous Flying Three-Five Direct Numinous Divine Immortals Numinous Treasure Black Emperor Merit Recorders, each eighty-one in number.\nLower Cavern Eighth Radiance Cavern Numinous Flying Spontaneous Numinous Treasure Divine Immortals Penetrating Perfection Life-Conveying Envoys, each eighty-one in number.\nLower Cavern Eighth Radiance Cavern Numinous Flying Spontaneous Numinous Treasure Divine Immortals Transmission Attendants Flying Heavenly Envoys, each eighty-one in number.\nLower Cavern Eighth Radiance Cavern Numinous Flying Spontaneous Numinous Treasure Divine Immortals Incense Officials Primordial Qi Envoys, each eighty-one in number.\nLower Cavern Eighth Radiance Cavern Numinous Flying Spontaneous Numinous Treasure Divine Immortals Cavern Illuminating Azure Emperor Envoys, each eighty-one in number.\nLower Cavern Eighth Radiance Cavern Numinous Flying Spontaneous Numinous Treasure Divine Immortals Cavern Illuminating Vermilion Emperor Envoys, each eighty-one in number.\nLower Cavern Eighth Radiance Cavern Numinous Flying Spontaneous Numinous Treasure Divine Immortals Cavern Illuminating Yellow Emperor Envoys, each eighty-one in number.\nLower Cavern Eighth Radiance Cavern Numinous Flying Spontaneous Numinous Treasure Divine Immortals Cavern Illuminating White Emperor Envoys, each eighty-one in number.\nLower Cavern Eighth Radiance Cavern Numinous Flying Spontaneous Numinous Treasure Divine Immortals Cavern Illuminating Black Emperor Envoys, each eighty-one in number.\nLower Cavern Eighth Radiance Cavern Numinous Flying Spontaneous Numinous Treasure Divine Immortals Fast Supervisors, each thirty-two in number.\nLower Cavern Eighth Radiance Cavern Numinous Flying Spontaneous Numinous Treasure Divine Immortals Fast Directors, each thirty-two in number.\nLower Cavern Eighth Radiance Cavern Numinous Flying Spontaneous Numinous Treasure Divine Immortals Transmission Scribes, each thirty-two in number.\nLower Cavern Eighth Radiance Cavern Numinous Flying Spontaneous Numinous Treasure Divine Immortals Incense-Bearing Scribes, each thirty-two in number.\nLower Cavern Eighth Radiance Cavern Numinous Flying Spontaneous Numinous Treasure Divine Immortals Merit Supervisors, each thirty-two in number.\nLower Cavern Eighth Radiance Cavern Numinous Flying Spontaneous Numinous Treasure Divine Immortals Merit Examiners, thirty-two in number.\nLower Cavern Eighth Radiance Cavern Numinous Flying Spontaneous Numinous Treasure Divine Immortals Incense-Attending Jade Lads, each thirty-two in number.\nLower Cavern Eighth Radiance Cavern Numinous Flying Spontaneous Numinous Treasure Divine Immortals Flower-Scattering Jade Maidens, each thirty-two in number.\nLower Thirty-Two Heavens Cavern Numinous Eighth Radiance Flying Spontaneous Numinous Treasure Void Direct Talismans, each thirty-two in number.\nLower Thirty-Two Heavens Cavern Numinous Eighth Radiance Flying Spontaneous Numinous Treasure Upper Prime Direct Talismans, each thirty-two in number.\nLower Thirty-Two Heavens Cavern Numinous Eighth Radiance Flying Spontaneous Numinous Treasure Sun-Moon Direct Talismans, each thirty-two in number.\nLower Thirty-Two Heavens Cavern Numinous Eighth Radiance Flying Spontaneous Numinous Treasure Transmission Direct Talismans, each thirty-two in number.\nLower Thirty-Two Heavens Cavern Numinous Eighth Radiance Flying Spontaneous Numinous Treasure Memorial Direct Talismans, each thirty-two in number.\nLower Thirty-Two Heavens Cavern Numinous Eighth Radiance Flying Spontaneous Numinous Treasure Fast Direct Talismans, each thirty-two in number.\nLower Thirty-Two Heavens Cavern Numinous Eighth Radiance Flying Spontaneous Numinous Treasure Incense-Attending Direct Talismans, each thirty-two in number.\nLower Thirty-Two Heavens Cavern Numinous Eighth Radiance Flying Spontaneous Numinous Treasure Five Emperors Direct Talismans, each thirty-two in number.\nLower Thirty-Two Heavens Cavern Numinous First Radiance Numinous Treasure Yang Palace Ji-Hai Refining Stomach Engendering Splendor Flying Heavenly Perfected, each three thousand two hundred in number.\nLower Thirty-Two Heavens Cavern Numinous Second Radiance Numinous Treasure Yin Palace Ji-Si Refining Intestines Engendering Fluid Flying Heavenly Perfected, each three thousand two hundred in number.\nLower Thirty-Two Heavens Cavern Numinous Third Radiance Numinous Treasure Yang Palace Ji-You Refining Large and Small Intestines Engendering Humor Flying Heavenly Perfected, each three thousand two hundred in number.\nLower Thirty-Two Heavens Cavern Numinous Fourth Radiance Numinous Treasure Yin Palace Ji-Mao Refining Torso Engendering Radiance Flying Heavenly Perfected, each three thousand two hundred in number.\nLower Thirty-Two Heavens Cavern Numinous Fifth Radiance Numinous Treasure Yang Palace Wu-Chen Refining Chest Diaphragm Engendering Immortality Flying Heavenly Perfected, each three thousand two hundred in number.\nLower Thirty-Two Heavens Cavern Numinous Sixth Radiance Numinous Treasure Yin Palace Wu-Xu Refining Two Flanks Engendering Spirits Flying Heavenly Perfected, each three thousand two hundred in number.\nLower Thirty-Two Heavens Cavern Numinous Seventh Radiance Numinous Treasure Yang Palace Ji-Chou Refining Left Yang Engendering Life Flying Heavenly Perfected, each three thousand two hundred in number.\nLower Thirty-Two Heavens Cavern Numinous Eighth Radiance Numinous Treasure Yin Palace Ji-Wei Refining Right Yin Engendering Life Flying Heavenly Perfected, each three thousand two hundred in number.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Life-Conveying Heavenly Immortal Troops, each nine hundred million cavalry.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Life-Conveying Earthly Immortal Troops, each nine hundred million cavalry.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Life-Conveying Flying Immortal Troops, each nine hundred million cavalry.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Life-Conveying Perfected Troops, each nine hundred million cavalry.\n\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Life-Conveying Divine Person Troops, each nine hundred million cavalry.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Life-Conveying Sun and Moon Troops, each nine hundred million cavalry.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Life-Conveying Constellation Troops, each nine hundred million cavalry.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Life-Conveying Nine Palaces Troops, each nine hundred million cavalry.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Life-Conveying Five Emperors Troops, each nine hundred million cavalry.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Life-Conveying Five Peaks Troops, each nine hundred million cavalry.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Life-Conveying Three Rivers and Four Seas Troops, each nine hundred million cavalry.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Life-Conveying All Heavens Supervising Immortal Troops, each nine hundred million cavalry.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Salvation-from-Destruction Corpse Troops, each nine hundred million cavalry.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Liberation-and-Rebirth Troops, each nine hundred million cavalry.\n\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Golden Dragon Cavalry, each nine hundred million hosts.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Flying Dragon Cavalry, each nine hundred million hosts.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Roaming Dragon Cavalry, each nine hundred million hosts.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Divine Dragon Cavalry, each nine hundred million hosts.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Post Dragon Cavalry, each nine hundred million hosts.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Cloud Dragon Cavalry, each nine hundred million hosts.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Dragon-Tiger Cavalry, each nine hundred million hosts.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Dragon-Soaring Cavalry, each nine hundred million hosts.\n\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Life-Conveying Nine Qi Heavenly Officials Azure Jade Maidens, each nine thousand.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Life-Conveying Three Qi Heavenly Officials Vermilion Jade Maidens, each three thousand.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Life-Conveying Seven Qi Heavenly Officials Bright Stone Jade Maidens, each seven thousand.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Life-Conveying Five Qi Heavenly Officials Mysterious Essence Jade Maidens, each five thousand.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Life-Conveying Central Yellow Prime Heavenly Officials Numinous Button Jade Maidens, each twelve thousand.\n\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Eastern Peak Azure Emperor Master Chart Flying Heavenly Clerks, each twenty-four.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Southern Peak Vermilion Emperor Master Chart Flying Heavenly Clerks, each twenty-four.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Central Peak Yellow Emperor Master Chart Flying Heavenly Clerks, each twenty-four.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Western Peak White Emperor Master Chart Flying Heavenly Clerks, each twenty-four.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Northern Peak Black Emperor Master Chart Flying Heavenly Clerks, each twenty-four.\n\nFour characters per line, totaling eight lines, all with patterned corners, written in black.\nCavern Mystery Numinous Treasure Twenty-Four Life Charts Scripture Complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞玄灵宝二十四生图经 经名：洞玄灵宝二十四生图经。 撰人不详，约出於晋代。 系古《灵宝经》之一。 一卷。 底本出处：《正统道藏》正一部。 洞玄灵宝二十四生图经 三部八景自然神真，大运告期，赤明开光，三景朗焕，五劫始分。 元始天尊与十方大圣、至真尊神、无极太上大道君、飞天神人、玄和玉女、无鞅之众，同坐南浮洞阳上馆栢陵舍中，清谈虚泊，素语自然，灵音十合，妙唱明真，诸天欢乐，日月停轮，星宿默度，九天徊关，河海静波，山岳吞烟，龙麟涌跃，人神欢焉。 是时太上无极道君稽首作礼，上白天尊：今日侍座，太漠开昏，无极世界，一切见明，法音遐振，泽被十方。 过泰因缘，劫劫化生，轮转圣位，任居总真。 方当胤御，剖判六天，考劫理运，料度种民，推算长夜，检实三官，役劳任重，欢戚难言。 敢附灵风，自响披心。 前与元始天王，俱於长桑碧林园中，闻天尊普告大圣尊神云：洞玄天文灵宝玉奥，有三部八景神二十四图，上应二十四真，中部二十四炁，下镇二十四生。 灵章璀璨，妙绝空洞，睹之者九天书名，金简记录，生死得仙。 来运当促，三五伤丧，万兆短命，流曳八难，风刀痛体，五苦备婴，沦於长夜，不睹三光，无知受对，任运生死，抚之伤襟，痛感人神。 今大慈道行，惠泽普隆。 伏愿天尊有以哀矜，直据玄科，教所未闻，使未见者见，未成者成，福流一切，亿劫得恩。 如蒙训授，辄当承神鼓风，因流扬波，清荡三界，肃检众魔，部正六天，馘斩群邪，安国育民，使阴阳宁休，明化既兴，道畅太虚。 於是天尊仰面含笑，有青黄赤三色之炁，从口中而出，光明彻照，十方内外，无幽无隐，一劫晓明。 金书紫字，玉文丹章，文彩焕斓，在三炁之中，三八景神，二十四真，各从千乘万骑，在空玄之上，辅卫灵文，诸天日月，流洒华光，众津交灌，飞香八缠，万圣称庆，一时礼真。 天尊告曰：今生一切，欢乐难譬，倾心露蕴，情无遗隐。 当依玄科，七宝镇灵，黄金为坛，授子神真之道。 道尊法重，四万劫一行，下世度人。 秘则真降，泄则祸臻。 今#1以相告，明识之焉。 太上道君欣喜欢叹，唯北向而立听命。",
      "translated_text": "**The Scripture of the Twenty-Four Images of Life from the Cavernous Mystery and Numinous Treasure**\n\n**Scripture Title:** *The Scripture of the Twenty-Four Images of Life from the Cavernous Mystery and Numinous Treasure*. Author unknown, approximately composed during the Jin dynasty. One of the ancient *Scriptures of the Numinous Treasure*. One scroll. Base text from *The Orthodox Daoist Canon*, Primary Section.\n\n---\n\nThe Three Divisions and Eight Radiant Spirits of the Natural Divine Perfection, at the appointed time of the Great Cycle, usher in the Crimson Clarity and the Dawn of Light. The Three Radiances shine resplendent, and the Five Kalpas begin their division.\n\nThe Celestial Venerable of Original Beginning, together with the Great Sages of the Ten Directions, the Most Perfected and Honored Spirits, the Limitless Supreme Lords of the Great Dao, the Flying Celestial Beings, the Jade Maidens of Mystic Harmony, and their innumerable hosts, all sit within the Cypress Grove Lodge of the Southern Floating Cavernous Yang. In pure discourse and serene stillness, their words flow naturally, their numinous voices harmonizing in tenfold resonance. Their wondrous hymns illuminate the True, filling all heavens with joy. The sun and moon halt their wheels, the stellar lodges traverse in silence, the Nine Heavens’ gates revolve, rivers and seas calm their waves, mountains and peaks swallow their mists, dragons and scaled creatures leap and surge, and gods and humans rejoice as one.\n\nAt this moment, the Supreme Limitless Lord of the Dao bows in reverence and addresses the Celestial Venerable: \"Today, as we attend this assembly, the Great Vastness dispels the gloom, and the Limitless Worlds are all illumined. The Dharma’s sound resonates afar, its blessings extending to the Ten Directions. Yet the causes of past excesses, kalpa after kalpa, give rise to rebirth, cycling through sacred ranks, assuming the offices of the Assembled Perfected. Now, as we prepare to govern and divide the Six Heavens, to examine the kalpas and order the cycles, to assess and measure the multitudes, to reckon the long night, and to audit the records of the Three Bureaus—our duties are heavy, our labors arduous, and our joys and sorrows defy expression. Daring to ride the numinous winds, I bare my heart in resonance.\n\nPreviously, with the Celestial King of Original Beginning, I was in the Azure Grove of Long Mulberry, where we heard the Celestial Venerable proclaim to the Great Sages and Honored Spirits: Within the *Cavernous Mystery’s Celestial Writ and Numinous Treasure’s Jade Mysteries*, there exist the Three Divisions and Eight Radiant Spirits, the Twenty-Four Images—above corresponding to the Twenty-Four Perfected, the middle division to the Twenty-Four Qi, and below governing the Twenty-Four Lives. Their numinous chapters gleam resplendent, their wonders surpassing the empty void. Those who behold them have their names inscribed in the Nine Heavens’ registers, recorded on golden tablets, and attain transcendence from life and death.\n\nYet the coming kalpa draws near, and the Three and Five will suffer loss. Countless beings will face shortened lives, drifting through the Eight Difficulties, their bodies tormented by wind and blade, beset by the Five Sufferings, sinking into the long night, deprived of the Three Lights. Ignorant and unknowing, they endure karmic retribution, subject to the cycles of life and death. To witness this moves one to grief, stirring sorrow in gods and humans alike.\n\nNow, the Great Compassion of the Dao’s practice bestows boundless grace. I humbly beseech the Celestial Venerable to take pity, to rely directly upon the Mystic Regulations, and to teach what has not yet been heard—so that those who have not seen may see, those who have not achieved may achieve, and blessings may flow to all, granting favor for a hundred million kalpas.\n\nShould you deign to instruct, I shall then bear the divine winds, spreading the waves, purifying the Three Realms, suppressing the hordes of demons, rectifying the Six Heavens, beheading the legions of evil, pacifying nations and nurturing the people, so that yin and yang may rest in tranquility, enlightened governance may flourish, and the Dao may course through the Great Void.\"\n\nThereupon, the Celestial Venerable lifted his face and smiled. From his mouth emerged qi of blue, yellow, and crimson hues, their radiance penetrating all, illuminating the Ten Directions within and without. No darkness remained hidden, and for a kalpa, all was as bright as dawn. Golden script in purple characters, jade texts in cinnabar chapters—resplendent in their brilliance—appeared within the Three Qi. The Eight Radiant Spirits of the Three Divisions and the Twenty-Four Perfected, each accompanied by a thousand chariots and ten thousand riders, hovered above the Empty Mystery, guarding the numinous writ. The suns and moons of all heavens scattered blossoming light, the myriad streams converged in libation, fragrant incense coiled in eightfold spirals, and the myriad sages rejoiced, all bowing in reverence to the True.\n\nThe Celestial Venerable proclaimed: \"All beings of this generation, your joy is beyond compare. With hearts laid bare and feelings fully revealed, you shall abide by the Mystic Regulations. The Seven Treasures shall guard the numinous, and a golden altar shall be raised to transmit to you the Way of the Divine Perfected. The Dao is revered, its Dharma weighty—once in forty thousand kalpas is it practiced, descending to the world to deliver beings. If kept secret, the True will descend; if revealed, calamity will arrive. Today, I impart this to you—clearly recognize it.\"\n\nThe Supreme Lord of the Dao rejoiced with exultant praise, standing facing north to receive the command.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 839,
      "start_sentence": 0,
      "end_sentence": 26,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.998483896255493,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝二十四生图经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "天尊登命九光太真、十方飞天、侍经玉郎，披九光玉蕴，出金书紫字玉文丹章，三部八景二十四图，盛以白玉立空之案，九色之巾，云精空结飞文锦盖，悬覆经上。 诸天大圣、无极天尊、飞天神王、三天真人，同时监盟，烧香散华，诵咏灵章，旋行宫城，绕经三周，一依旧典俯仰之格自然威仪，付度道君。 法事粗毕，三景复位，众真退席。 是时赤明天中，是男是女，莫不范德，归心信向，皆得度世。 上皇元年九月二日，后圣李君出游西河，历观八门。 值元始天王乘八景玉舆，驾九色玄龙，三素飞云，导从群仙，手把华幡，狮子白鹤，啸歌邕邕，浮空而来，同会西河之上。 李君稽首请问天王，昔蒙训授天书玉字二十四图，虽得其文，未究妙章，虽有图赞，而无其像，修之庵蔼，妙理难详。 今遇天尊，喜庆难言。 愿垂成就，极其道真。 於是天王口吐洞玄内观玉符，以授於君，使清斋千日，五香熏体，东向服符。 子形神备见，自当洞达，诸疑顿了。 李君稽首，奉承教旨，具依天仪，长斋千日，东向服符，三八景神，并见身中。 金书玉字，二十四图，空中而明，文彩光鲜，洞彻无穷，罗缕自然。 是时即命主图上仙而画图焉。 金书紫字玉文丹章，於此成音。 自南极上元九光太真王夫人、东西二华、南北真公、五岳神仙、清虚真人，所受真文，并是后圣所书图像，而各系之焉。 真人沐浴东井图　上部第一真炁 天河灌东井，石景水母精。 圆光拂灵曜，玄辉应高明。 元始披长夜，天人逐月生。 沐浴兰池上，龙负长绠缾。 金童洒香华，玉女流五星。 冠带灌玉津，炼度五仙形。 体香万神降，乘景登高明。 神仙五岳真形图　上部第二真炁 妙哉元始道，五灵敷真文。 上开龙汉劫，焕烂三景分。 十部飞天书，安镇五帝神。 灵岳承玄宫，郁勃吐宝云。 上有不死炁，植牙练五仙。 玉芝玄中涣，体洁自然熏。 精思高灵降，交游上帝君。 通灵诀精八史图　上部第三真炁 三景吐灵华，晃朗八门开。 中有智慧神，被服飞天衣。 八史通灵炁，玉符洞精微。 宝云映玉字，巨兽振天威。 焕烂八会宫，纷纷灵人飞。 精思招真炁，五符生光辉。 八景策玉舆，登空入紫微。 神仙六甲通灵图　上部第四真炁 灵宫飞天女，六真宴常汤。 抱日负明月，仰蹑三晨光。 通灵究幽微，洞观朗十方。 招致自然厨，五芝六府昌。 变化炼万神，分形改正容。 乘虚步玄都，高奔入空洞。 时降金霄人，徉襟三素房。 携契策飞盖，逍遥升玉京。 神仙九宫紫房图　上部第五真炁 紫房映高清，宫室互相扶，香烟绕日月，飞天翳太虚。 至真大圣众，萧条流羽书。 开度诸天劫，尘沙始一周。 九五固灵运，长保天地居。 精思安能远，紫宫生我躯。 元始太清图　上部第六真炁 太清无边际，青炁郁紫微。 灵风迅七宝，琳树何萋萋。 紫凤鸣长条，龙麟交横驰。 太上观十方，诸天整法衣。 旋行绕宫城，三周长夜开。 若能思灵炁，自得乘景飞。 神仙真道混成图　上部第七真炁 荡荡元始初，混沌炁未分。 三色无中化，回合若景云。 幽冥生真景，焕落敷灵文。 豁朗开长夜，植立天地根。 自然妙真炁，淳淳炁常存。 运通大九界，开度诸天门。 神仙西升保录图　上部第八真炁 乘运迅灵炁，驾景升西宫。",
      "translated_text": "The Celestial Venerable commanded the Nine Radiant Perfected of Great Brilliance, the Flying Immortals of the Ten Directions, and the Jade Lads attendant upon the scriptures to unfurl the Ninefold Radiant Jade Writ. They brought forth the golden script with purple characters, the jade-text vermilion chapters—three divisions, eight luminous scenes, and twenty-four diagrams—arrayed upon a white jade table suspended in the void. A nine-colored cloth, woven from cloud-essence and celestial patterns, served as a flying brocade canopy, draped and suspended above the scriptures.\n\nAll the Great Sages of the Heavens, the Boundless Celestial Venerables, the Flying Immortal Kings, and the Perfected of the Three Heavens simultaneously oversaw the covenant. They burned incense, scattered blossoms, chanted the numinous verses, and circumambulated the celestial palace, encircling the scriptures thrice. Following the ancient rites of reverent bearing and natural majesty, they transmitted the teachings to the Dao Lord. When the ritual was roughly concluded, the Three Luminaries returned to their positions, and the assembled Perfected withdrew from their seats.\n\nAt that time, in the Vermilion Clarity Heaven, whether man or woman, none failed to cultivate virtue, turn their hearts in faith, and aspire toward the Dao—all attained deliverance across the ages.\n\nIn the first year of the Supreme August Era, on the second day of the ninth month, the Later Sage, Lord Li, journeyed to the Western River and traversed the Eight Gates. There, he encountered the Celestial Venerable of Primordial Beginning, who rode in an eightfold luminous jade chariot, drawn by nine-colored dark dragons and threefold pure flying clouds. A procession of immortals followed, bearing floral banners, lions, and white cranes, their harmonious songs resounding as they floated through the void to convene above the Western River.\n\nLord Li bowed deeply and inquired of the Celestial King: \"Formerly, I received your instruction and was granted the celestial script of jade characters—twenty-four diagrams. Though I obtained the text, I have not fathomed its wondrous chapters; though I possess the illustrated eulogies, their images remain absent. In my cultivation, the mysteries are veiled, and the subtleties of the Dao elude me. Today, I meet the Celestial Venerable—my joy is beyond words. I pray you bestow completion and perfect the Way of the True.\"\n\nThereupon, the Celestial King exhaled the Jade Talisman of Internal Vision from the Cavernous Mystery and bestowed it upon Lord Li, instructing him to purify himself with a thousand-day fast, anoint his body with fivefold incense, and face east to ingest the talisman. \"When your form and spirit are fully prepared, you shall naturally attain penetrating insight, and all doubts will instantly dissolve.\"\n\nLord Li bowed deeply, received the celestial decree, and fully adhered to the heavenly rites. After a thousand-day fast, facing east to ingest the talisman, the Threefold Eightfold Luminous Spirits all manifested within his body. The golden script and jade characters of the twenty-four diagrams shone clearly in the void, their radiant patterns luminous and boundless, their intricate details naturally unfolding.\n\nAt that moment, he summoned the Immortal Overseer of Diagrams to render the images. The golden script with purple characters and jade-text vermilion chapters thus resounded in clarity. From the Nine Radiant Perfected Lady Wang of the Upper Prime of the Southern Culmen, the Eastern and Western Twin Floras, the Northern and Southern Perfected Lords, the immortals of the Five Peaks, to the Pure Void Perfected—all who received the true texts were those for whom the Later Sage had inscribed the diagrams, each appended accordingly.\n\n**Diagram of the Perfected Bathing in the Eastern Well** – *First True Qi of the Upper Division*\nThe Heavenly River pours into the Eastern Well,\nStone reflections, essence of the Water Mother.\nCircular light brushes the numinous radiance,\nMysterious brilliance responds to the exalted.\nPrimordial Beginning parts the long night,\nHeavenly beings follow the moon’s birth.\nBathing atop the Orchid Pool,\nDragons bear the long-rope jars.\nGolden youths scatter fragrant blossoms,\nJade maidens stream the Five Stars.\nCrowned and girded, they bathe in jade nectar,\nRefining and delivering the Five Immortal forms.\nTheir bodies fragrant, myriad spirits descend,\nRiding the luminous to ascend the exalted.\n\n**Diagram of the True Forms of the Five Peaks** – *Second True Qi of the Upper Division*\nWondrous, the Dao of Primordial Beginning,\nFive numina unfold the true writ.\nAbove, it opens the Dragon Han kalpa,\nResplendent, the Three Luminaries divide.\nTen divisions of flying celestial script,\nSecurely settle the Five Thearch spirits.\nThe numinous peaks receive the Mysterious Palace,\nBillowing forth treasure clouds.\nAbove, the undying qi,\nPlants its sprouts to refine the Five Immortals.\nJade mushrooms dissolve in the mysterious,\nBodies purified, naturally perfumed.\nWith concentrated thought, the exalted descend,\nConsorting with the Lords of the Empyrean.\n\n**Diagram of the Eight Histories of the Numinous Communication** – *Third True Qi of the Upper Division*\nThree luminaries exhale numinous blossoms,\nBrilliant, the Eight Gates open.\nWithin, the spirit of wisdom,\nClad in flying celestial robes.\nEight histories communicate the numinous qi,\nJade talismans penetrate the subtle.\nTreasure clouds reflect jade characters,\nMighty beasts shake celestial might.\nResplendent, the Eightfold Assembly Palace,\nMultitudes of numinous beings fly.\nWith concentrated thought, summon the true qi,\nFive talismans generate radiance.\nEightfold luminous chariots,\nAscend the void to enter the Purple Tenuity.\n\n**Diagram of the Six Jia Spirits Communing with the Numinous** – *Fourth True Qi of the Upper Division*\nNuminous palace, flying celestial maidens,\nSix Perfected feast in constant springs.\nEmbracing the sun, bearing the bright moon,\nGazing upward at the Three Dawn Lights.\nCommuning with the numinous, they fathom the subtle,\nPenetrating vision illumines the ten directions.\nSummoning the natural kitchens,\nFive mushrooms and six palaces flourish.\nTransforming and refining the myriad spirits,\nDividing forms, altering true countenances.\nTreading the void, they step into the Mysterious Capital,\nSoaring high into the Cavernous Void.\nAt times descending as golden auroral beings,\nRoaming the Threefold Pure chambers.\nHolding covenants, they urge flying canopies,\nCarefree, ascending the Jade Capital.\n\n**Diagram of the Nine Palaces and Purple Chambers** – *Fifth True Qi of the Upper Division*\nPurple chambers reflect the exalted clarity,\nPalaces mutually support one another.\nFragrant smoke encircles sun and moon,\nFlying immortals shade the Great Void.\nThe utmost Perfected, great sages,\nDesolate, flowing feathered script.\nDelivering the kalpas of all heavens,\nDust and sand begin one cycle.\nNine and five secure the numinous workings,\nLong preserving heaven and earth’s abode.\nWith concentrated thought, how could one be distant?\nThe Purple Palace generates my body.\n\n**Diagram of Primordial Beginning and the Grand Clarity** – *Sixth True Qi of the Upper Division*\nThe Grand Clarity knows no bounds,\nAzure qi billows in the Purple Tenuity.\nNuminous winds swiftly traverse the Seven Treasures,\nHow lush the jade trees!\nPurple phoenixes sing on long branches,\nDragon scales intertwine in flight.\nThe Supreme surveys the ten directions,\nAll heavens adjust their Dharma robes.\nCircumambulating the palace city,\nThree circuits open the long night.\nIf one can contemplate the numinous qi,\nOne shall naturally ride the luminous in flight.\n\n**Diagram of the True Dao’s Primal Integration** – *Seventh True Qi of the Upper Division*\nVast, the Primordial Beginning’s dawn,\nChaos’ qi yet undivided.\nThree colors transform within the void,\nRevolving like luminous clouds.\nThe obscure gives birth to true scenes,\nResplendent, unfolding numinous writ.\nBrilliant, it opens the long night,\nEstablishing heaven and earth’s roots.\nThe natural wondrous true qi,\nPure and constant, ever abiding.\nCirculating through the Great Nine Realms,\nOpening the gates of all heavens.\n\n**Diagram of the Western Ascent and Preservation Record** – *Eighth True Qi of the Upper Division*\nRiding the swift numinous qi,\nDriving the luminous to ascend the Western Palace.",
      "overlap_context": "ations. The Seven Treasures shall guard the numinous, and a golden altar shall be raised to transmit to you the Way of the Divine Perfected. The Dao is revered, its Dharma weighty—once in forty thousand kalpas is it practiced, descending to the world to deliver beings. If kept secret, the True will descend; if revealed, calamity will arrive. Today, I impart this to you—clearly recognize it.\"\n\nThe Supreme Lord of the Dao rejoiced with exultant praise, standing facing north to receive the command.",
      "start_char": 840,
      "end_char": 2178,
      "start_sentence": 27,
      "end_sentence": 97,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 45.01614570617676,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝二十四生图经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "之造玉那国，万乘来相从。 神魔稽首伏，天王并归降。 分金范正法，世恭道德王。 故施正真炁，别号度一方。 是时有道世，称曰福德堂。 灵宝神仙图曰：上部八真神图，以洞天元始之炁，化生自然八景上真，镇在人身中上元宫中，致上元生炁。 精心内思八年，八真见形，千乘万骑，运致景云，载人上升。 上真一景脑神，名觉元子，字道都。 色白，一景玉符，上元洞天炁部一景神。 上真二景发神，名玄父华，字道衡。 色玄，二景玉符，上元洞天炁部二景神。 上真三景皮肤神，名通众仲，字道连。 色黄，三景玉符，上元洞天炁部三景神。 上真四景目神，名虚监，字道童。 五色，四景玉符，上元洞天炁部四景神。 上真五景项髓神，名灵谟盖，字道周。 色白，五景玉符，上元洞天炁部五景神。 上真六景膂神，名益历转，字道柱。 白玉色，六景玉符，上元洞天炁部六景神。 上真七景鼻神，名仲龙王，字道微。 青黄白三色，七景玉符，上元洞天炁部七景神。 上真八景舌神，名始梁峙，字道岐。 色赤，八景玉符，上元洞天炁部八景神。 灵宝神仙图曰：八景神真玉符，上元洞天自然之炁，以部上部八景神真，镇在人身上元宫中。 服之八年，八景见形，为己通达幽微之事，洞观自然，坐在立亡，降致天仙，千乘万骑，云舆羽盖，白日登晨。 神仙通微灵化图　中部第一真炁 大道妙无像，运炁凝高玄。 结空自然生，灵化表三神。 朝引五星精，中噏日中津。 夕餐黄月华，寝卧炼五仙。 变景随空化，倏忽立自然。 神仙耀灵九天图　中部第二真炁 箫箫九天炁，清澄自高玄。 庆云翳重虚，金阙承紫烟。 中有太极宫，道君罗大千。 青林弥乘梵，十方并飞天。 南陵福德堂，四座皆清宾。 散华庆我愿，逍遥无波津。 神仙九变图　中部第三真炁 妙化因空感，专思通至灵。 上食九天炁，导引五云精。 三日练万神，一日九变形。 脱身游九域，遨戏三界庭。 乘景望太素，灵风回绿軿。 飞烟绕十绝，黄旛召万灵。 诸天降羽仪，郁郁入太清。 神仙常存图　中部第四真炁 默念招幽真，专静神自归。 漏尽外应消，正炁自夷微。 积感妙真降，六府生光辉。 玄会空相和，万神应响齐。 八景扶云盖，焕落迅羽仪。 载我大梵外，逍遥乘空飞。 神仙守一养身图　中部第五真炁 导引九天炁，摩手慰身形。 遏断邪魔径，莹饰练光明。 凤翔通真炁，龙超制万灵。 辰旦众真会，养身觉神生。 淡泊还守一，静思正炁庭。 神备景自飞，高升入上清。 神仙守神合景图　中部第六真炁 泥丸置魄营，中元抱一宫。 丹田三灵府，混合百神王。 三关统九天，呼噏日月光。 五星奥玄滋，流演六胃充。 静思万炁归，神安形亦芳。 三部八景真，携我入太空。 长居天地劫，无始永无终。 神仙寂嘿养精守志图　中部第七真炁 清朝餐五星，专思守泥丸。 正中咽日光，嘿念绛府熏。 黄昏导月精，灌溉丹田君。 三真生一景，变化形自分。 一见万神归，摄炁景高奔。 上登日月宫，出入观八门。 龙汉无终劫，妙哉灵文。 芝英玉女图　中部第八真炁 飘飘散灵炁，芝英随风回。 诸天洒香华，日月灌灵晖。 玉女檠金盘，粲粲乘空飞。 仰思真颜降，咽芝五神开。 导引光明彻，万劫体不衰。 灵宝神仙图曰：中部八景神图，以元始灵宝洞玄之炁，化生自然中部八景中真，镇在人身中中元宫中，致中元生炁。",
      "translated_text": "To the land of Yuna That,\nTen thousand chariots come in allegiance.\nDivine demons bow their heads in submission,\nHeavenly kings all surrender in obeisance.\nForging gold to mold the true Dharma,\nThe world reveres the King of Dao and Virtue.\nThus bestowing the primal true qi,\nBy another name, it delivers an entire region.\nAt that time, an age of the Dao arose,\nCalled the Hall of Blessed Virtue.\n\n**Numinous Treasure Divine Immortals Diagram** states: *Upper Division’s Eighth True Spirit Diagram*\nWith the primordial qi of the Cavern-Heaven’s Origin,\nIt transforms and gives birth to the Eight Luminous Upper Perfected,\nWho guard the Upper Prime Palace within the human body,\nInducing the Upper Prime’s generative qi.\nWith focused mind, inwardly contemplating for eight years,\nThe Eight Perfected manifest in form,\nA thousand chariots and ten thousand riders,\nConveying luminous clouds to bear one aloft.\n\n**First Luminous Perfected of the Upper Prime**\nBrain spirit, named Awakened Origin Child, styled Dao Capital.\nColor: white. First luminous jade talisman,\nFirst spirit of the Upper Prime Cavern-Heaven’s qi division.\n\n**Second Luminous Perfected of the Upper Prime**\nHair spirit, named Mysterious Father Hua, styled Dao Balance.\nColor: dark. Second luminous jade talisman,\nSecond spirit of the Upper Prime Cavern-Heaven’s qi division.\n\n**Third Luminous Perfected of the Upper Prime**\nSkin spirit, named Penetrating Multitude Zhong, styled Dao Link.\nColor: yellow. Third luminous jade talisman,\nThird spirit of the Upper Prime Cavern-Heaven’s qi division.\n\n**Fourth Luminous Perfected of the Upper Prime**\nEye spirit, named Void Overseer, styled Dao Youth.\nColor: five-hued. Fourth luminous jade talisman,\nFourth spirit of the Upper Prime Cavern-Heaven’s qi division.\n\n**Fifth Luminous Perfected of the Upper Prime**\nNeck marrow spirit, named Numinous Plan Cover, styled Dao Cycle.\nColor: white. Fifth luminous jade talisman,\nFifth spirit of the Upper Prime Cavern-Heaven’s qi division.\n\n**Sixth Luminous Perfected of the Upper Prime**\nSpine spirit, named Beneficial Calendar Turn, styled Dao Pillar.\nColor: white jade. Sixth luminous jade talisman,\nSixth spirit of the Upper Prime Cavern-Heaven’s qi division.\n\n**Seventh Luminous Perfected of the Upper Prime**\nNose spirit, named Second Dragon King, styled Dao Subtle.\nColor: azure, yellow, white. Seventh luminous jade talisman,\nSeventh spirit of the Upper Prime Cavern-Heaven’s qi division.\n\n**Eighth Luminous Perfected of the Upper Prime**\nTongue spirit, named Originating Ridge Peak, styled Dao Fork.\nColor: red. Eighth luminous jade talisman,\nEighth spirit of the Upper Prime Cavern-Heaven’s qi division.\n\n**Numinous Treasure Divine Immortals Diagram** states:\nThe Eight Luminous Perfected’s jade talismans,\nWith the natural qi of the Upper Prime Cavern-Heaven,\nGovern the Upper Division’s Eight Luminous Perfected,\nWho guard the Upper Prime Palace within the human body.\nIngesting them for eight years,\nThe Eight Luminous manifest in form,\nEnabling one to penetrate the subtle and obscure,\nTo perceive the natural with clarity,\nTo sit in life and vanish in death,\nTo summon and attain celestial immortals,\nA thousand chariots and ten thousand riders,\nCloud carriages and feathered canopies,\nAscending at dawn in broad daylight.\n\n**Divine Immortals’ Subtle Numinous Transformations Diagram** – *Middle Division’s First True Qi*\nThe wondrous Dao bears no image,\nIts qi congeals in the High Mystery.\nBinding emptiness, it naturally arises,\nNuminous transformations revealing the Three Spirits.\nAt dawn, it draws the essence of the Five Stars,\nInhaling the midday nectar of the sun.\nAt dusk, it consumes the yellow radiance of the moon,\nReclining to refine the Five Immortals.\nTransforming scenes in accord with emptiness,\nSuddenly, spontaneously, it stands in the natural.\n\n**Divine Immortals’ Radiant Numinous Nine Heavens Diagram** – *Middle Division’s Second True Qi*\nThe ethereal qi of the Nine Heavens,\nPure and limpid, from the High Mystery.\nAuspicious clouds veil the layered void,\nGolden towers bear the purple mist.\nWithin lies the Palace of the Great Ultimate,\nWhere the Lord of the Dao arrays the Great Thousand.\nAzure groves fill the Brahma-vehicle,\nThe Ten Directions all with flying immortals.\nThe Southern Mound’s Hall of Blessed Virtue,\nFour seats all with pure guests.\nScattering blossoms to celebrate my vow,\nCarefree, without waves or ford.\n\n**Divine Immortals’ Nine Transformations Diagram** – *Middle Division’s Third True Qi*\nWondrous transformations respond to emptiness,\nFocused thought connects to the utmost numinous.\nAbove, consuming the qi of the Nine Heavens,\nGuiding and absorbing the essence of the Five Clouds.\nThree days to refine the myriad spirits,\nOne day to undergo nine transformations.\nShedding the body to roam the Nine Realms,\nPlayfully wandering the Three Realms’ courts.\nRiding the luminous to gaze upon the Great Simplicity,\nNuminous winds turn the green carriage.\nFlying mists encircle the Ten Absolutes,\nYellow banners summon the myriad spirits.\nThe Heavens descend with feathered regalia,\nLushly entering the Great Clarity.\n\n**Divine Immortals’ Constant Abiding Diagram** – *Middle Division’s Fourth True Qi*\nSilently invoking the obscure perfected,\nFocused stillness, the spirit naturally returns.\nWhen the clepsydra’s flow is exhausted, external responses fade,\nThe true qi spontaneously becomes serene and subtle.\nAccumulated resonance summons the wondrous perfected,\nThe Six Palaces generate radiance.\nMysterious union harmonizes with emptiness,\nThe myriad spirits respond in unison.\nEight luminous support the cloud canopy,\nResplendent, swift with feathered regalia.\nBearing me beyond the Great Brahma,\nCarefree, riding the void in flight.\n\n**Divine Immortals’ Guarding the One and Nurturing the Body Diagram** – *Middle Division’s Fifth True Qi*\nGuiding and absorbing the qi of the Nine Heavens,\nRubbing the hands to soothe the body’s form.\nBlocking the paths of deviant demons,\nPolishing and refining luminous clarity.\nPhoenix soaring, it connects to the true qi,\nDragon leaping, it governs the myriad spirits.\nAt dawn, the host of perfected assemble,\nNurturing the body, awakening the spirit’s birth.\nDetached, returning to guard the One,\nStill contemplation in the court of true qi.\nWith spirit complete, the luminous naturally flies,\nAscending to enter the Highest Clarity.\n\n**Divine Immortals’ Guarding the Spirit and Merging with the Luminous Diagram** – *Middle Division’s Sixth True Qi*\nThe Muddy Pellet houses the po soul’s camp,\nThe Middle Prime embraces the One’s palace.\nThe Cinnabar Field, threefold numinous mansion,\nMerging with the Hundred Spirits’ King.\nThe Three Passes govern the Nine Heavens,\nInhaling and exhaling the sun and moon’s light.\nThe Five Stars’ profound mystery nourishes,\nFlowing and infusing to fill the Six Stomachs.\nStill contemplation, the myriad qi return,\nSpirit at peace, the form also flourishes.\nThe Three Divisions’ Eight Luminous Perfected,\nBearing me into the Great Void.\nTo dwell long through heaven and earth’s kalpas,\nWithout beginning, forever without end.\n\n**Divine Immortals’ Silent Nurturing of Essence and Guarding the Will Diagram** – *Middle Division’s Seventh True Qi*\nAt dawn, consuming the Five Stars,\nFocused contemplation, guarding the Muddy Pellet.\nAt the center, swallowing the sun’s light,\nSilently reciting to warm the Crimson Palace.\nAt dusk, guiding the moon’s essence,\nIrrigating the Cinnabar Field’s Lord.\nThree perfected give birth to one luminous,\nTransformations and forms spontaneously divide.\nAt first sight, the myriad spirits return,\nAbsorbing qi, the luminous soars aloft.\nAscending to the sun and moon’s palaces,\nExiting and entering, observing the Eight Gates.\nThrough dragon’s kalpas without end,\nWondrous indeed, the numinous writ.\n\n**Divine Maidens of the Mushroom and Jade Diagram** – *Middle Division’s Eighth True Qi*\nFloating, the numinous qi scatters,\nMushroom blossoms follow the wind’s turn.\nThe Heavens shower fragrant blossoms,\nSun and moon bathe in numinous radiance.\nJade maidens hold golden platters,\nBrilliant, riding the void in flight.\nGazing upward, contemplating the perfected countenance’s descent,\nSwallowing the mushroom, the Five Spirits open.\nGuiding and absorbing luminous clarity,\nThrough ten thousand kalpas, the body does not decay.\n\n**Numinous Treasure Divine Immortals Diagram** states:\n*Middle Division’s Eight Luminous Spirit Diagram*\nWith the primordial numinous treasure’s Cavern Mystery qi,\nIt transforms and gives birth to the Eight Luminous Middle Perfected of the Middle Division,\nWho guard the Middle Prime Palace within the human body,\nInducing the Middle Prime’s generative qi.",
      "overlap_context": "ving like luminous clouds.\nThe obscure gives birth to true scenes,\nResplendent, unfolding numinous writ.\nBrilliant, it opens the long night,\nEstablishing heaven and earth’s roots.\nThe natural wondrous true qi,\nPure and constant, ever abiding.\nCirculating through the Great Nine Realms,\nOpening the gates of all heavens.\n\n**Diagram of the Western Ascent and Preservation Record** – *Eighth True Qi of the Upper Division*\nRiding the swift numinous qi,\nDriving the luminous to ascend the Western Palace.",
      "start_char": 2178,
      "end_char": 3506,
      "start_sentence": 98,
      "end_sentence": 180,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.681562423706055,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝二十四生图经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "精思八年，八真见形，千乘万骑，运致神仙，羽盖玉舆，飞行太虚。 中真一景喉神，名百流放，字道通。 九色，洞玄中元一景真符部一景神。 中真二景肺神，名素灵生，字道平。 色白，洞玄中元二景真符部二景神。 中真三景心神，名焕阳昌，字道明。 色赤，洞玄中元三景真符部三景神。 中真四景肝神，名开君童，字道清。 色青，洞玄中元四景真符部四景神。 中真五景胆神，名龙德拘，字道放。 色青，黄绿洞玄中元五景真符部五景神。 中真六景左肾神，名春元真，字道卿。 五色衣，洞玄中元六景真符部六景神。 中真七景右肾神，名象他无，字道王。 白黑色，洞玄中元七景真符部七景神。 中真八景脾神，名宝无全，字道骞。 正黄色，洞玄中元八景真符部八景神。 灵宝神仙图曰：灵宝洞玄中元八景真符，以部中部八景神真，镇在人身中中元宫中。 服之八年，中元八景见形，为己通灵达神，洞观八方，神芝玉浆五炁玄芽，身生光明，神仙乘骑，飞行太空。 神仙六阴玉女图　下部第一真炁 灵飞秀太极，玉女翠朱琼。 窈窕飞空出，飘飘乘虚生。 玄妙自然炁，六阴安常形。 遐念希良会，仰面盻降六丁。 携景金房内，嬿婉娉精诚。 玄感自相求，岂期形与名。 变化因欵发，应响神自灵。 神仙九元导仙图　下部第二真炁 玉清耀玄都，十圣回紫微。 神仙披云出，纷纷流羽衣。 香花随风散，十天乘云飞。 丹霄映轻盖，日月灌灵晖。 仰思妙真降，神感因心归。 神仙导引图　下部第三真炁 郁郁五云芝，玄晖吐玉光。 凝津洞灵府，徘徊日月宫。 五色理高真，流精灌十方。 呼吸不觉疲，飞天并金容。 导引餐灵炁，玄哺六胃充。 精思易致感，安坐观空洞。 神仙洞中洪保图　下部第四真炁 澄心理太玄，萧萧群真居。 下治诸名山，洞房清且虚。 五色焕日月，列号众仙储。 上统紫微宫，总录天宝书。 中有守一士，精思待开图。 五老监魔试，心端情自舒。 身度水火宫，名入九天庐。 善哉有今人，遂得乘景舆。 神仙变化隐测图　下部第五真炁 变化空无中，五行兆身形。 洞思自然炁，金木水火精。 土为隐测府，六戊合景庭。 玉女变衣裳，老壮应响生。 细入毫厘裹，大包山岳灵。 种植通神草，身与八史并。 万化随所欲，逍遥可娱情。 神仙采芝开山图　下部第六真炁 灵岳郁嵯峨，翠阜陵景霄。 五芝秀玄岭，仙草茂霜条。 上有采芝人，披服乘羽飙。 灵洞万劫开，一焕诸天交。 得妙安觉厌，恒沙如一朝。 神仙明镜图　下部第七真炁 妙镜生威光，流焕照八景。 洞彻方圆内，通真别鬼精。 自然观重阴，照耀诸天形。 伏魔致神仙，变化入紫庭。 神仙无极太一图　下部第八真炁 焕烂第一真，身生龙凤文。 威光洞九天，烂照大囿圆。 上御诸天炁，总为万仙君。 巍巍至道宗，洛洛大梵门。 灵宝神仙图日：下部八真神图，以元始灵宝洞神之炁，化生自然下部八景下真，镇在人身中下元宫中，致下元生炁。 精思八年，下元八真使千乘万骑，运致神仙，羽盖载人，俱升七宝林中。 下真一景胃神，名同来育，字道展。 黄色； 洞神下元一景灵符部一景神。 下真二景穷肠神，名兆腾康，字道还。 黄赤色，洞神下元二景灵符部二景神。 下真三景大小肠神，名蓬送留，字道厨。",
      "translated_text": "After eight years of concentrated meditation, the Eight Perfected manifest in form,\nA thousand chariots and ten thousand riders convey the divine immortals,\nJade canopies and feathered carriages soaring through the Great Void.\n\n**Middle Perfected First Luminous Spirit** – Throat Spirit:\nName: Hundred Streams Released, Style: Dao-Pervading.\nNine-colored, of the Cavern Mystery’s Middle Prime First Luminous Perfected Talisman Division, First Luminous Spirit.\n\n**Middle Perfected Second Luminous Spirit** – Lung Spirit:\nName: Pure Numinous Life, Style: Dao-Peaceful.\nWhite-colored, of the Cavern Mystery’s Middle Prime Second Luminous Perfected Talisman Division, Second Luminous Spirit.\n\n**Middle Perfected Third Luminous Spirit** – Heart Spirit:\nName: Radiant Yang Prospering, Style: Dao-Illuminating.\nRed-colored, of the Cavern Mystery’s Middle Prime Third Luminous Perfected Talisman Division, Third Luminous Spirit.\n\n**Middle Perfected Fourth Luminous Spirit** – Liver Spirit:\nName: Opening Lord Lad, Style: Dao-Pure.\nBlue-green-colored, of the Cavern Mystery’s Middle Prime Fourth Luminous Perfected Talisman Division, Fourth Luminous Spirit.\n\n**Middle Perfected Fifth Luminous Spirit** – Gallbladder Spirit:\nName: Dragon Virtue Restraining, Style: Dao-Released.\nBlue-green and yellow-green-colored, of the Cavern Mystery’s Middle Prime Fifth Luminous Perfected Talisman Division, Fifth Luminous Spirit.\n\n**Middle Perfected Sixth Luminous Spirit** – Left Kidney Spirit:\nName: Spring Prime Perfected, Style: Dao-Minister.\nFive-colored-robed, of the Cavern Mystery’s Middle Prime Sixth Luminous Perfected Talisman Division, Sixth Luminous Spirit.\n\n**Middle Perfected Seventh Luminous Spirit** – Right Kidney Spirit:\nName: Elephant Other None, Style: Dao-King.\nBlack-and-white-colored, of the Cavern Mystery’s Middle Prime Seventh Luminous Perfected Talisman Division, Seventh Luminous Spirit.\n\n**Middle Perfected Eighth Luminous Spirit** – Spleen Spirit:\nName: Treasure Without Lack, Style: Dao-Soaring.\nTrue yellow-colored, of the Cavern Mystery’s Middle Prime Eighth Luminous Perfected Talisman Division, Eighth Luminous Spirit.\n\nThe *Numinous Treasure Divine Immortals Diagram* states:\nThe Numinous Treasure Cavern Mystery Middle Prime Eight Luminous Perfected Talismans,\nWith the division’s Middle Prime Eight Luminous Perfected Spirits,\nAre stationed within the Middle Prime Palace of the human body.\nAfter eight years of ingestion, the Middle Prime Eight Luminous Spirits manifest in form,\nEnabling one to commune with the numinous and penetrate the divine,\nGaze through the eight directions,\nPartake of divine mushroom elixirs and jade nectar, the Five Qi’s mysterious sprouts,\nThe body radiates luminosity,\nDivine immortals ride in procession,\nSoaring through the vast heavens.\n\n**Divine Immortals Six Yin Jade Maidens Diagram** – Lower Division First Perfected Qi\nNuminous flight adorns the Supreme Ultimate,\nJade maidens in emerald and vermilion splendor.\nGracefully they emerge, soaring through the void,\nLightly borne upon emptiness.\nMysterious and wondrous, the natural qi,\nSix Yin spirits settle in constant form.\nLonging for rare communion,\nGazing upward, awaiting the descent of the Six Dings.\nWithin the golden chamber of radiance,\nGentle and sincere in devotion.\nMysterious resonance seeks its own,\nHow could it be bound by form or name?\nTransformations arise from mutual affinity,\nResponses echo as the spirit becomes numinous.\n\n**Divine Immortals Nine Primes Conveying Immortals Diagram** – Lower Division Second Perfected Qi\nJade Clarity illumines the Mystic Capital,\nTen sages revolve in the Purple Tenuity.\nDivine immortals emerge through clouds,\nFeathered robes fluttering.\nFragrant blossoms scatter with the wind,\nTen heavens ride upon clouds in flight.\nCinnabar skies reflect light canopies,\nSun and moon bathe in numinous radiance.\nGazing upward, yearning for the wondrous perfected to descend,\nSpiritual resonance returns to the heart.\n\n**Divine Immortals Guiding and Absorbing Diagram** – Lower Division Third Perfected Qi\nLush, the five-cloud mushrooms,\nMysterious radiance emits jade light.\nCongealed essence pervades the numinous palace,\nWandering through the palaces of sun and moon.\nFive colors govern the lofty perfected,\nFlowing essence irrigates the ten directions.\nBreathing without fatigue,\nSoaring through the heavens alongside golden countenances.\nGuiding and absorbing the numinous qi,\nMysterious nourishment fills the six stomachs.\nConcentrated meditation swiftly induces resonance,\nSitting in stillness, observing the empty cavern.\n\n**Divine Immortals Cavern’s Vast Guardian Diagram** – Lower Division Fourth Perfected Qi\nCalming the mind to order the Great Mystery,\nIn tranquil seclusion, the host of perfected reside.\nBelow, they govern the myriad famous mountains,\nCavern chambers pure and empty.\nFive colors illumine sun and moon,\nTheir ranks designated as the immortals’ storehouse.\nAbove, they govern the Purple Tenuity Palace,\nCompiling the celestial treasures’ registers.\nWithin, there is a practitioner of Unity,\nMeditating intently, awaiting the opening of the diagram.\nThe Five Elders oversee demonic trials,\nWith a steadfast heart, emotions naturally ease.\nThe body traverses the palaces of water and fire,\nThe name enters the Nine Heavens’ abode.\nHow fortunate is the present person,\nWho thus attains to ride the radiant carriage.\n\n**Divine Immortals Transformations and Concealments Diagram** – Lower Division Fifth Perfected Qi\nTransformations arise within the empty void,\nThe Five Phases foretell the body’s form.\nMeditating upon the natural qi,\nMetal, wood, water, fire, and essence.\nEarth serves as the concealed divination palace,\nSix Wus harmonize with the radiant courtyard.\nJade maidens transform garments,\nYouth and age respond to resonance.\nSubtly entering within the finest hairs,\nVastly embracing the mountains and peaks’ numen.\nCultivating the divine herbs of communion,\nThe body parallels the Eight Histories.\nMyriad transformations follow desire,\nCarefree, one may delight the heart.\n\n**Divine Immortals Gathering Mushrooms and Opening Mountains Diagram** – Lower Division Sixth Perfected Qi\nSacred peaks rise in towering majesty,\nVerdant mounds ascend to the luminous skies.\nFive mushrooms flourish on the mysterious ridges,\nImmortal herbs thrive on frost-kissed branches.\nAbove, there are gatherers of mushrooms,\nClad in feathered robes, riding the numinous winds.\nThe divine cavern opens after ten thousand kalpas,\nIn a single radiance, all heavens converge.\nAttaining the wondrous, tranquil, and awakened state,\nCountless sands pass as a single dawn.\n\n**Divine Immortals Luminous Mirror Diagram** – Lower Division Seventh Perfected Qi\nThe wondrous mirror generates awe-inspiring light,\nFlowing radiance illuminates the Eight Luminous.\nPenetrating clarity within square and circle,\nDistinguishing the true and discerning demonic essence.\nNaturally observing the layered Yin,\nIlluminating the forms of all heavens.\nSubduing demons to summon divine immortals,\nTransforming to enter the Purple Court.\n\n**Divine Immortals Boundless Supreme One Diagram** – Lower Division Eighth Perfected Qi\nResplendent, the First Perfected,\nThe body bears dragon and phoenix patterns.\nMajestic radiance penetrates the Nine Heavens,\nBrilliant illumination encompasses the great park’s expanse.\nAbove, it governs the heavens’ qi,\nPresiding as the lord of ten thousand immortals.\nMajestic, the ultimate Dao’s lineage,\nVast, the great Brahma’s gate.\n\nThe *Numinous Treasure Divine Immortals Diagram* states:\nThe Lower Division Eight Perfected Spirits Diagram,\nWith the Primordial Numinous Treasure’s Cavern Spirit qi,\nTransforms and gives birth to the natural Lower Division Eight Luminous Lower Perfected,\nWho guard the Lower Prime Palace within the human body,\nInducing the Lower Prime’s generative qi.\nAfter eight years of concentrated meditation, the Lower Prime Eight Perfected dispatch a thousand chariots and ten thousand riders,\nConveying divine immortals,\nFeathered canopies bearing the practitioner,\nTogether ascending to the Seven Treasures Grove.\n\n**Lower Perfected First Luminous Spirit** – Stomach Spirit:\nName: Together Coming Nurturing, Style: Dao-Unfolding.\nYellow-colored; of the Cavern Spirit’s Lower Prime First Luminous Perfected Talisman Division, First Luminous Spirit.\n\n**Lower Perfected Second Luminous Spirit** – Exhausted Intestine Spirit:\nName: Omen Soaring Prosperity, Style: Dao-Returning.\nYellow-red-colored, of the Cavern Spirit’s Lower Prime Second Luminous Perfected Talisman Division, Second Luminous Spirit.\n\n**Lower Perfected Third Luminous Spirit** – Large and Small Intestine Spirit:\nName: Bluegreen Conveying Remaining, Style: Dao-Kitchen.",
      "overlap_context": "\nSwallowing the mushroom, the Five Spirits open.\nGuiding and absorbing luminous clarity,\nThrough ten thousand kalpas, the body does not decay.\n\n**Numinous Treasure Divine Immortals Diagram** states:\n*Middle Division’s Eight Luminous Spirit Diagram*\nWith the primordial numinous treasure’s Cavern Mystery qi,\nIt transforms and gives birth to the Eight Luminous Middle Perfected of the Middle Division,\nWho guard the Middle Prime Palace within the human body,\nInducing the Middle Prime’s generative qi.",
      "start_char": 3506,
      "end_char": 4799,
      "start_sentence": 181,
      "end_sentence": 261,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.07893371582031,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝二十四生图经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "赤黄色，洞神下元三景灵符部三景神。 下真四景胴中神，名受厚勃，字道虚。 九色，洞神下元四景灵符部四景神。 下真五景胸膈神，名广瑛宅，字道冲。 白色，洞神下元五景灵符部五景神。 下真六景两胁神，名辟假马，字道成。 赤白色，洞神下元六景灵符部六景神。 下真七景左阳神，名扶流起，字道圭。 青黄白色，洞神下元七景灵符部七景神。 下真八景右阴神，名包表明，字道生。 青黄白色，洞神下元八景灵符部八景神。 灵宝神仙图曰：灵宝洞神下元八景灵符，以部下部八景神真，镇在人身下元宫中。 服之八年，下元八景，见形为人，养精补气，炼髓凝真，身生光泽，八景云舆，载人飞行。 玉清七宝神仙图　总三八部真炁 箫箫三清上，凝真大罗天。 琼林翠玄台，日月焕灵轩。 飞天梵绿炁，驾景乘紫烟。 郁郁披云出，纷纷灵宝仙。 逍遥七宝林，五色焕金银。 振响众真会，灵歌庆万神。 精思三八景，超步登宝门。 赤明元年正月上寅一日午时，天光四朗，紫云回天，庆霄八会，灵风扫尘，日月吐辉，五星灌津，天地溟涬，流洒香华，河海静默，山岳藏烟。 五苦咸解，三徒赦魂，九幽息对，长友盟缘，聋盲总明，六痾并痊。 地藏发泄，金玉露形，白骨生炁，腐骸还人，龙麟踊跃，鸟兽飞欣，三界长乐，人神欢焉。 是日大庆，万劫更新。 元始天尊延宾琼堂，於赤明天中南霍之丘丹灵洞宫，敷罗五色，黄金为坛，白玉荐地，七宝告灵，传度洞玄金书紫字玉文丹章自然灵图，二十四真三部八景神、天仙飞仙、神仙地仙、兵马乘骑，以授太上无极道君。 依威仪玄格明真科文，度人九万九千九百九十九万亿，宿有金名，列字诸天，应仙之人。 大运之中，当收文还上大罗七宝玄台紫微宫中。 今三洞御运，灵宝下教，先度并升仙官空缺，应须中贤以充诸天某帝真人某岳先生。 臣某昔以某年某月某日，於某州县某所，从某岳先生某君一作黑帝真人、北岳先生，臣君昔以戊戌年七月十三日，於中天南洞，从中岳先生杨君受法，应更度人。 先有宿名金格玉箓合真之人，以补天官，周历八极，从虚无中来。 今有宿命某帝真人某，本命某甲子，命属某天，某帝领籍，某月生，某天一作赤帝真人某，本命丙午，命属丹天南帝，领籍七月生，素天度炁，骨命合真，应补洞玄第二品仙。 今岁在某甲子某月某日，於某天中，依先师旧科明真大法，身登黄坛，七宝镇灵，五彩澄仙，授度虚无自然灵宝洞玄金书紫字玉文丹章，二十四真三八部图，神仙乘骑，某受大法，三界所举，灵宝保明，身度五道，名入紫宫金简玉箓，位登真仙。 出入游行，天仪羽服，云舆龙驾，三七色节，前导凤歌，后从天钧，五帝启道，太极参轩。 仙童玉女，散华烧香，宝盖垂阴，营卫游行。 某炁齐洞玄，身登仙宫，宜遵俯仰，检口慎行，弃诸色累，断绝外想，静心夷嘿，专志在法，不得混浊，更相招引，以乱其炁。 每行大慈，广度一切，国安民丰，四海宁一，七祖父母，皆得升度，身入光明，早生人中。 大劫运终，同飞上清，逍遥金阙，七宝林中。 其未仙度，备法七年，天炁备足，天告玄应，合仙之人，当依科以传。 自无灵感，四万劫勿宣。 愆盟负信，中泄灵文，生死父母，长闭幽夜，身谢五道，风刀万劫，不敢有言，依科奉诚，生死同仙，众行一如，明真之文。",
      "translated_text": "Red-yellow-colored, of the Cavern Spirit’s Lower Prime Third Luminous Perfected Talisman Division, Third Luminous Spirit.\n\n**Lower Perfected Fourth Luminous Spirit** – Torso Spirit:\nName: Receiving Abundant Vitality, Style: Dao-Void.\nNine-colored, of the Cavern Spirit’s Lower Prime Fourth Luminous Perfected Talisman Division, Fourth Luminous Spirit.\n\n**Lower Perfected Fifth Luminous Spirit** – Chest Diaphragm Spirit:\nName: Vast Radiant Abode, Style: Dao-Surging.\nWhite-colored, of the Cavern Spirit’s Lower Prime Fifth Luminous Perfected Talisman Division, Fifth Luminous Spirit.\n\n**Lower Perfected Sixth Luminous Spirit** – Two Flanks Spirit:\nName: Dispelling False Steeds, Style: Dao-Accomplished.\nRed-white-colored, of the Cavern Spirit’s Lower Prime Sixth Luminous Perfected Talisman Division, Sixth Luminous Spirit.\n\n**Lower Perfected Seventh Luminous Spirit** – Left Yang Spirit:\nName: Supporting Flowing Ascent, Style: Dao-Jade.\nBluegreen-yellow-white-colored, of the Cavern Spirit’s Lower Prime Seventh Luminous Perfected Talisman Division, Seventh Luminous Spirit.\n\n**Lower Perfected Eighth Luminous Spirit** – Right Yin Spirit:\nName: Enveloping Manifest Clarity, Style: Dao-Living.\nBluegreen-yellow-white-colored, of the Cavern Spirit’s Lower Prime Eighth Luminous Perfected Talisman Division, Eighth Luminous Spirit.\n\nThe *Illustrated Charts of Numinous Treasure Immortals* states: The Numinous Treasure Cavern Spirit’s Lower Prime Eight Luminous Talismans, with their divisions of the Eight Luminous Perfected Spirits, are stationed within the human body’s Lower Prime Palace. After ingesting them for eight years, the Eight Luminous Spirits of the Lower Prime manifest in human form, nurturing essence, replenishing qi, refining marrow, and congealing perfection. The body radiates luminous splendor, and the Eight Luminous Cloud Chariots bear one aloft in flight.\n\n*The Seven Treasures Immortal Charts of Jade Clarity*\n**Total: Three Eight Divisions of Perfected Qi**\n\nWhispering through the Three Clarities above,\nPerfected qi congeals in the Great Canopy of Heaven.\nJade groves and emerald-dark terraces,\nSun and moon gleam upon numinous chariots.\nFlying immortals in jade-green qi,\nRiding upon scenes borne by purple mist.\nLushly they emerge through clouds,\nIn throngs the Numinous Treasure immortals.\nCarefree in the Seven Treasures Grove,\nFive hues gleam with gold and silver.\nResonant echoes gather the assembly of perfected beings,\nNuminous hymns celebrate the myriad spirits.\nWith concentrated focus on the Three Eight Luminous Spirits,\nOne transcends steps to ascend the Gate of Treasures.\n\nIn the first year of the Radiant Crimson Epoch, on the first day of the first month, at the hour of noon, celestial light shone in four directions, purple clouds coiled through the heavens, the Eight Assemblies of Auspicious Clouds gathered, numinous winds swept away dust, sun and moon emitted radiance, the five stars poured forth essences, heaven and earth merged in primordial vastness, fragrant blossoms streamed and scattered, rivers and seas stilled, mountains and peaks concealed their mists. The Five Sufferings were all dissolved, the Three Bonds released souls, the Nine Dark Realms ceased their confrontations, eternal friendships forged alliances, the deaf and blind regained clarity, the Six Afflictions all healed. Earth’s treasuries opened, gold and jade revealed their forms, white bones generated qi, decayed remains returned to human form, dragons and unicorns leapt in joy, birds and beasts flew in delight, the Three Realms knew eternal bliss, humans and spirits rejoiced together. On this day of great celebration, the myriad kalpas were renewed.\n\nThe Primordial Heavenly Venerable extended his hospitality in the Jade Hall, upon the Crimson Radiance Heaven’s Southern Fire Peak within the Cinnabar Numinous Cavern Palace. He spread out five-colored silks, erected an altar of yellow gold, laid out a foundation of white jade, and with the Seven Treasures invoked the numinous. He transmitted the Cavern Mystery Golden Writ of Purple Characters and Cinnabar Scripts of the Spontaneous Numinous Charts, the Twenty-Four Perfected Ones of the Three Divisions and Eight Luminous Spirits, the flying immortals, divine immortals, earthbound immortals, and their hosts of chariots and riders, bestowing them upon the Supreme Peerless Dao Lord. Following the solemn protocols, the mysterious standards, and the luminous statutes of the Perfected, he initiated ninety-nine billion nine hundred ninety-nine million nine hundred ninety-nine thousand individuals whose names were inscribed in gold, whose characters were arrayed in the heavens, and who were destined for immortality.\n\nIn the midst of the great kalpic cycle, these texts shall be gathered and returned to the Seven Treasures Mysterious Terrace of the Great Canopy’s Purple Tenuity Palace. Now, under the governance of the Three Caverns, the Numinous Treasure’s Lower Teaching is first to initiate and ascend those who fill the vacancies among the immortal officials of the empty celestial ranks, as ordained by the Worthy Ones of the Central Heavens and the Masters of the Sacred Peaks.\n\nYour servant, [Name], formerly on [Day] of [Month] in [Year], at [Location] in [Prefecture and County], received the method from Master [Name] of the Sacred Peak, also known as the Black Emperor Perfected One or the Northern Peak Master. Your servant’s master, in turn, received the method on the thirteenth day of the seventh month in the year of the Earth Dog from Master Yang of the Central Peak in the Southern Cavern of the Central Heaven, as ordained to further transmit and initiate others. Those whose names were predestined in the golden registers and jade records, who harmonize with perfection, shall be appointed to celestial offices, traversing the Eight Poles, arriving from the midst of emptiness and non-being.\n\nNow, the predestined [Name], Perfected One of [Emperor] of [Heaven], born in the [Stem-Branch] year, whose fate belongs to [Heaven] under [Emperor]’s registry, born in [Month], or the Red Emperor Perfected One [Name], born in the year of the Fire Horse, whose fate belongs to the Vermilion Heaven’s Southern Emperor, registered in the seventh month, refined by the Primordial Qi of the Pure Heaven, whose bones and fate harmonize with perfection, is destined to fill the vacancy of the Second Rank Immortal of the Cavern Mystery. In this year of [Stem-Branch], on [Day] of [Month], in [Heaven], following the ancient statutes of the former master’s luminous great method, ascending the yellow altar, the Seven Treasures securing the numinous, the five hues clarifying the immortal, [Name] received the initiation of the Spontaneous Numinous Treasure Cavern Mystery Golden Writ of Purple Characters and Cinnabar Scripts, the Charts of the Twenty-Four Perfected Ones of the Three Eight Divisions, and the immortal hosts of chariots and riders. Having received the great method, [Name] is commended by the Three Realms, protected and illuminated by the Numinous Treasure, transcends the Five Paths, and has their name inscribed in the golden tablets and jade records of the Purple Palace, ascending to the rank of Perfected Immortal.\n\nHenceforth, they may roam freely, clad in celestial regalia and feathered garments, borne by cloud chariots and dragon carriages, preceded by the Three-Seven colored standards and phoenix songs, followed by the celestial zither, with the Five Emperors opening the Way and the Supreme Ultimate attending the chariot. Immortal youths and jade maidens scatter blossoms and burn incense, jeweled canopies cast their shade, and guardian spirits escort their journey. [Name]’s qi aligns with the Cavern Mystery, their body ascends to the immortal palace. They must observe proper conduct, guard their speech, refrain from all worldly entanglements, sever external distractions, calm the mind in serene silence, and focus their will upon the method. They must not allow turbidity or mutual inducements to disrupt their qi. In every action, they shall practice great compassion, broadly initiating all beings, ensuring the nation’s peace and the people’s prosperity, unifying the Four Seas in tranquility. Their seven generations of ancestors shall all ascend and be initiated, their bodies entering luminous clarity, and they shall be reborn early among humankind. When the great kalpic cycle ends, they shall together ascend to the Clarity Above, carefree in the Golden Gates and the Seven Treasures Grove.\n\nThose who have not yet attained immortal initiation shall prepare for seven years until their celestial qi is fully cultivated. When the celestial signs manifest their numinous response, those destined for immortality shall transmit the method according to the statutes. If there is no spiritual resonance, the method shall not be disseminated for forty thousand kalpas. Those who break their vows, betray their trust, or leak the numinous texts shall have their parents in life and death eternally confined to the dark night, their bodies departing the Five Paths to endure the wind blades for ten thousand kalpas. They dare not speak of this. Following the statutes with utmost sincerity, they shall share the same immortal fate in life and death, their conduct unified in the luminous texts.",
      "overlap_context": "ow-colored; of the Cavern Spirit’s Lower Prime First Luminous Perfected Talisman Division, First Luminous Spirit.\n\n**Lower Perfected Second Luminous Spirit** – Exhausted Intestine Spirit:\nName: Omen Soaring Prosperity, Style: Dao-Returning.\nYellow-red-colored, of the Cavern Spirit’s Lower Prime Second Luminous Perfected Talisman Division, Second Luminous Spirit.\n\n**Lower Perfected Third Luminous Spirit** – Large and Small Intestine Spirit:\nName: Bluegreen Conveying Remaining, Style: Dao-Kitchen.",
      "start_char": 4799,
      "end_char": 6079,
      "start_sentence": 262,
      "end_sentence": 302,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 44.66387891769409,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝二十四生图经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "九炁天中空洞青灵魔王　姓 　讳 　保度某岳先生某三界上仙品 九炁天中空洞赤灵魔王　姓 　讳 　保度某岳先生某三界上仙品 中岳高皇天空洞黄灵魔王　姓 　讳 　保度某岳先生某三界上仙品 七炁天中空洞白灵魔王　姓 　讳 　保度某岳先生某三界上仙品 五炁天中空洞黑灵魔王　姓 　讳 　保度某岳先生某三界上仙品 洞天上部一景脑府真神道都神仙洞天泥丸飞天上仙官，各二十四人。 洞天上部二景发府真神道衡神仙洞天通精飞天上仙官，各二十四人。 洞天上部三景皮肤府真神道连神仙洞天羽仪飞天上仙官，各二十四人。 洞天上部四景目府真神道童神仙洞天洞明飞天上仙官，各二十四人。 洞天上部五景顶髓府真神道周神仙洞天凝真飞天上仙官，各二十四人。 洞天上部六景膂府真神道柱神仙洞天通津飞天上仙官，各二十四人。 洞天上部七景鼻府真神道微神仙洞天惠气飞天上仙官，各二十四人。 洞天上部八景舌府真神道岐神仙洞天智慧飞天上仙官，各二十四人。 上部八景洞天飞行三五直灵神仙飞天度命功曹，各八十一人。 上部八景洞天飞行三五直灵神仙正一升玄功曹，各八十一人。 上部八景洞天飞行三五直灵神仙直使生炁功曹，各八十一人。 上部八景洞天飞行三五直灵神仙灵宝青帝功曹，各八十一人。 上部八景洞天飞行三五直灵神仙灵宝赤帝功曹，各八十一人。 上部八景洞天飞行三五直灵神仙灵宝黄帝功曹，各八十一人。 上部八景洞天飞行三五直灵神仙灵宝白帝功曹，各八十一人。 上部八景洞天飞行三五直灵神仙灵宝黑帝功曹，各八十一人。 上部八景洞天飞行自然灵宝神仙通真度命使者，各八十一人。 上部八景洞天飞行自然灵宝神仙传事飞天使者，各八十一人。 上部八景洞天飞行自然灵宝神仙香官生炁使者，各八十一人。 上部八景洞天飞行自然灵宝神仙洞明青帝使者，各八十一人。 上部八景洞天飞行自然灵宝神仙洞明赤帝使者，各八十一人。 上部八景洞天飞行自然灵宝神仙洞明黄帝使者，各八十一人。 上部八景洞天飞行自然灵宝神仙洞明白帝使者，各八十一人。 上部八景洞天飞行自然灵宝神仙洞明黑帝使者，各八十一人。 上部八景洞天飞行自然灵宝神仙监斋直事，各三十二人。 上部八景洞天飞行自然灵宝神仙典斋直事，各三十二人。 上部八景洞天飞行自然灵宝神仙传言书佐，各三十二人。 上部八景洞天飞行自然灵宝神仙奉香书佐，各三十二人。 上部八景洞天飞行自然灵宝神仙监功谒者，各三十二人。 上部八景洞天飞行自然灵宝神仙校事谒者，各三十二人。 上部八景洞天飞行自然灵宝神仙侍香玉童，各三十二人。 上部八景洞天飞行自然灵宝神仙散华玉女，各三十二人。 上部三十二天洞天八景飞行自然灵宝虚无直符，各三十二人。 上部三十二天洞天八景飞行自然灵宝上元直符，各三十二人。 上部三十二天洞天八景飞行自然灵宝日月直符，各三十二人。 上部三十二天洞天八景飞行自然灵宝传言直符，各三十二人。 上部三十二天洞天八景飞行自然灵宝奏事直符，各三十二人。 上部三十二天洞天八景飞行自然灵宝直斋直符，各三十二人。 上部三十二天洞天八景飞行自然灵宝侍香直符，各三十二人。",
      "translated_text": "In the Nine Qi Heaven, the Cavernous Azure Numinous Demon King, surnamed [ ], named [ ], safeguards Master [ ] of [ ] Sacred Peak, ranked among the Upper Immortals of the Three Realms.\n\nIn the Nine Qi Heaven, the Cavernous Vermilion Numinous Demon King, surnamed [ ], named [ ], safeguards Master [ ] of [ ] Sacred Peak, ranked among the Upper Immortals of the Three Realms.\n\nIn the Central Sacred Peak, the High August Heaven’s Cavernous Yellow Numinous Demon King, surnamed [ ], named [ ], safeguards Master [ ] of [ ] Sacred Peak, ranked among the Upper Immortals of the Three Realms.\n\nIn the Seven Qi Heaven, the Cavernous White Numinous Demon King, surnamed [ ], named [ ], safeguards Master [ ] of [ ] Sacred Peak, ranked among the Upper Immortals of the Three Realms.\n\nIn the Five Qi Heaven, the Cavernous Black Numinous Demon King, surnamed [ ], named [ ], safeguards Master [ ] of [ ] Sacred Peak, ranked among the Upper Immortals of the Three Realms.\n\nWithin the Cavern-Heavens of the Upper Realm:\n- The Twenty-Four True Spirits of the First Radiance, Brain Palace, Dao Metropolis, Divine Immortal Cavern-Heaven, Niwan Flying Heaven Upper Immortals.\n- The Twenty-Four True Spirits of the Second Radiance, Hair Palace, Dao Balance, Divine Immortal Cavern-Heaven, Essence-Pervading Flying Heaven Upper Immortals.\n- The Twenty-Four True Spirits of the Third Radiance, Skin Palace, Dao Union, Divine Immortal Cavern-Heaven, Plumed Regalia Flying Heaven Upper Immortals.\n- The Twenty-Four True Spirits of the Fourth Radiance, Eye Palace, Dao Youth, Divine Immortal Cavern-Heaven, Cavernous Luminance Flying Heaven Upper Immortals.\n- The Twenty-Four True Spirits of the Fifth Radiance, Crown Marrow Palace, Dao Periphery, Divine Immortal Cavern-Heaven, True-Congealing Flying Heaven Upper Immortals.\n- The Twenty-Four True Spirits of the Sixth Radiance, Spine Palace, Dao Pillar, Divine Immortal Cavern-Heaven, Passage-Pervading Flying Heaven Upper Immortals.\n- The Twenty-Four True Spirits of the Seventh Radiance, Nose Palace, Dao Subtlety, Divine Immortal Cavern-Heaven, Qi-Bestowing Flying Heaven Upper Immortals.\n- The Twenty-Four True Spirits of the Eighth Radiance, Tongue Palace, Dao Branch, Divine Immortal Cavern-Heaven, Wisdom Flying Heaven Upper Immortals.\n\nFrom the Eight Radiant Cavern-Heavens of the Upper Realm:\n- Eighty-One Flying, Three-Five Direct Numinous Divine Immortals, Flying Heaven Life-Conveying Merit Recorders.\n- Eighty-One Flying, Three-Five Direct Numinous Divine Immortals, Orthodox Unity Ascending Mystery Merit Recorders.\n- Eighty-One Flying, Three-Five Direct Numinous Divine Immortals, Direct Envoys of Generative Qi Merit Recorders.\n- Eighty-One Flying, Three-Five Direct Numinous Divine Immortals, Numinous Treasure Azure Emperor Merit Recorders.\n- Eighty-One Flying, Three-Five Direct Numinous Divine Immortals, Numinous Treasure Vermilion Emperor Merit Recorders.\n- Eighty-One Flying, Three-Five Direct Numinous Divine Immortals, Numinous Treasure Yellow Emperor Merit Recorders.\n- Eighty-One Flying, Three-Five Direct Numinous Divine Immortals, Numinous Treasure White Emperor Merit Recorders.\n- Eighty-One Flying, Three-Five Direct Numinous Divine Immortals, Numinous Treasure Black Emperor Merit Recorders.\n- Eighty-One Spontaneous Numinous Treasure Divine Immortals, Envoys of Passage and Life-Conveyance.\n- Eighty-One Spontaneous Numinous Treasure Divine Immortals, Flying Heaven Messengers of Transmission.\n- Eighty-One Spontaneous Numinous Treasure Divine Immortals, Qi-Generating Envoys of Incense Offering.\n- Eighty-One Spontaneous Numinous Treasure Divine Immortals, Cavernous Luminance Azure Emperor Envoys.\n- Eighty-One Spontaneous Numinous Treasure Divine Immortals, Cavernous Luminance Vermilion Emperor Envoys.\n- Eighty-One Spontaneous Numinous Treasure Divine Immortals, Cavernous Luminance Yellow Emperor Envoys.\n- Eighty-One Spontaneous Numinous Treasure Divine Immortals, Cavernous Luminance White Emperor Envoys.\n- Eighty-One Spontaneous Numinous Treasure Divine Immortals, Cavernous Luminance Black Emperor Envoys.\n- Thirty-Two Spontaneous Numinous Treasure Divine Immortals, Direct Attendants of Fast Supervision.\n- Thirty-Two Spontaneous Numinous Treasure Divine Immortals, Direct Attendants of Fast Administration.\n- Thirty-Two Spontaneous Numinous Treasure Divine Immortals, Scribes of Transmission.\n- Thirty-Two Spontaneous Numinous Treasure Divine Immortals, Scribes of Incense Offering.\n- Thirty-Two Spontaneous Numinous Treasure Divine Immortals, Merit-Inspecting Heralds.\n- Thirty-Two Spontaneous Numinous Treasure Divine Immortals, Verifying Heralds.\n- Thirty-Two Spontaneous Numinous Treasure Divine Immortals, Jade Lads of Incense Attendance.\n- Thirty-Two Spontaneous Numinous Treasure Divine Immortals, Jade Maidens of Flower Scattering.\n\nFrom the Thirty-Two Heavens of the Upper Realm’s Eight Radiant Cavern-Heavens:\n- Thirty-Two Spontaneous Numinous Treasure Void Direct Talismans.\n- Thirty-Two Spontaneous Numinous Treasure Upper Prime Direct Talismans.\n- Thirty-Two Spontaneous Numinous Treasure Sun-Moon Direct Talismans.\n- Thirty-Two Spontaneous Numinous Treasure Transmission Direct Talismans.\n- Thirty-Two Spontaneous Numinous Treasure Memorial Direct Talismans.\n- Thirty-Two Spontaneous Numinous Treasure Fast Direct Talismans.\n- Thirty-Two Spontaneous Numinous Treasure Incense Attendance Direct Talismans.",
      "overlap_context": "l resonance, the method shall not be disseminated for forty thousand kalpas. Those who break their vows, betray their trust, or leak the numinous texts shall have their parents in life and death eternally confined to the dark night, their bodies departing the Five Paths to endure the wind blades for ten thousand kalpas. They dare not speak of this. Following the statutes with utmost sincerity, they shall share the same immortal fate in life and death, their conduct unified in the luminous texts.",
      "start_char": 6080,
      "end_char": 7420,
      "start_sentence": 303,
      "end_sentence": 346,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.29418396949768,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝二十四生图经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "上部三十二天洞天八景飞行自然灵宝五帝直符，各三十二人。 上部三十二天洞天一景灵宝阳宫丙寅炼脑生魂飞天上真，各三千二百人。 上部三十二天洞天二景灵宝阴宫丙申炼发生魂飞天上真，各三千二百人。 上部三十二天洞天三景灵宝阳宫丙子炼肤飞天上真，各三千二百人。 上部三十二天洞天四景灵宝阴宫丙午炼目飞天上真，各三千二百人。 上部三十二天洞天五景灵宝阳宫丁亥炼髓飞天上真，各三千二百人。 上部三十二天洞天六景灵宝阴宫丁巳炼膂飞天上真，各三千二百人。 上部三十二天洞天七景灵宝阳宫丁卯炼鼻飞天上真，各三千二百人。 上部三十二天洞天八景灵宝阴宫丁酉炼舌生尸飞天上真，各三千二百人。 太玄上部洞天八景自然灵宝神仙度命天仙兵马，各九亿万骑。 太玄上部洞天八景自然灵宝神仙度命地仙兵马，各九亿万骑。 太玄上部洞天八景自然灵宝神仙度命飞仙兵马，各九亿万骑。 太玄上部洞天八景自然灵宝神仙度命真人兵马，各九亿万骑。 太玄上部洞天八景自然灵宝神仙度命神人兵马，各九亿万骑。 太玄上部洞天八景自然灵宝神仙度命日月兵马，各九亿万骑。 太玄上部洞天八景自然灵宝神仙度命星宿兵马，各九亿万骑。 太玄上部洞天八景自然灵宝神仙度命九宫兵马，各九亿万骑。 太玄上部洞天八景自然灵宝神仙度命五帝兵马，各九亿万骑。 太玄上部洞天八景自然灵宝神仙度命五岳兵马，各九亿万骑。 太玄上部洞天八景自然灵宝神仙度命三河四海兵马，各九亿万骑。 太玄上部洞天八景自然灵宝神仙度命诸天督仙兵马，各九亿万骑。 太玄上部洞天八景自然灵宝神仙灭度生尸兵马，各九亿万骑。 太玄上部洞天八景自然灵宝神仙开度更生兵马，各九亿万骑。 太玄上部洞天八景自然灵宝神仙金龙骑，各九亿万众。 太玄上部洞天八景自然灵宝神仙飞龙骑，各九亿万众。 太玄上部洞天八景自然灵宝神仙游龙骑，各九亿万众。 太玄上部洞天八景自然灵宝神仙神龙骑，各九亿万众。 太玄上部洞天八景自然灵宝神仙驿龙骑，各九亿万众。 太玄上部洞天八景自然灵宝神仙云龙骑，各九亿万众。 太玄上部洞天八景自然灵宝神仙龙虎骑，各九亿万众。 太玄上部洞天八景自然灵宝神仙龙腾骑，各九亿万众。 太玄上部洞天八景自然灵宝神仙度命九炁天官青牙玉女，各九千人。 太玄上部洞天八景自然灵宝神仙度命三炁天官朱丹玉女，各三千人。 太玄上部洞天八景自然灵宝神仙度命七炁天官明石玉女，各七千人。 太玄上部洞天八景自然灵宝神仙度命五炁天官玄滋玉女，各五十人。 太玄上部洞天八景自然灵宝神仙度命中央黄上天官灵纽玉女，各万二千人。 太玄上部洞天八景自然灵宝神仙东岳青帝主图飞天吏，各二十四人。 太玄上部洞天八景自然灵宝神仙南岳赤帝主图飞天吏，各二十四人。 太玄上部洞天八景自然灵宝神仙中岳黄帝主图飞天吏，各二十四人。 太玄上部洞天八景自然灵宝神仙西岳白帝主图飞天吏，各二十四人。 太玄上部洞天八景自然灵宝神仙北岳黑帝主图飞天吏，各二十四人。 右四字一行合八行，皆有文角，黑书。 洞玄中部一景喉府真神道通神仙洞玄炼魂飞天上仙官，各二十四人。 洞玄中部二景肺府真神道平神仙洞玄炼魄飞天上仙官，各二十四人。",
      "translated_text": "From the Thirty-Two Heavens of the Upper Realm’s Eight Radiant Cavern-Heavens:\n- Thirty-Two Spontaneous Numinous Treasure Five Thearchs Direct Talismans, each thirty-two in number.\n- Thirty-Two Spontaneous Numinous Treasure Yang Palace Bingyin Refining-Brain Generative-Soul Flying Heavenly Perfected, each three thousand two hundred in number.\n- Thirty-Two Spontaneous Numinous Treasure Yin Palace Bingshen Refining-Essence Generative-Soul Flying Heavenly Perfected, each three thousand two hundred in number.\n- Thirty-Two Spontaneous Numinous Treasure Yang Palace Bingzi Refining-Skin Flying Heavenly Perfected, each three thousand two hundred in number.\n- Thirty-Two Spontaneous Numinous Treasure Yin Palace Bingwu Refining-Eyes Flying Heavenly Perfected, each three thousand two hundred in number.\n- Thirty-Two Spontaneous Numinous Treasure Yang Palace Dinghai Refining-Marrow Flying Heavenly Perfected, each three thousand two hundred in number.\n- Thirty-Two Spontaneous Numinous Treasure Yin Palace Dingsi Refining-Spine Flying Heavenly Perfected, each three thousand two hundred in number.\n- Thirty-Two Spontaneous Numinous Treasure Yang Palace Dingmao Refining-Nose Flying Heavenly Perfected, each three thousand two hundred in number.\n- Thirty-Two Spontaneous Numinous Treasure Yin Palace Dingyou Refining-Tongue Generative-Corpse Flying Heavenly Perfected, each three thousand two hundred in number.\n\nFrom the Eight Radiant Cavern-Heavens of the Supreme Mystery Upper Realm:\n- Spontaneous Numinous Treasure Divine Immortals Delivering Destiny: Heavenly Immortals’ Troops and Cavalry, each nine hundred million myriad in number.\n- Spontaneous Numinous Treasure Divine Immortals Delivering Destiny: Earthly Immortals’ Troops and Cavalry, each nine hundred million myriad in number.\n- Spontaneous Numinous Treasure Divine Immortals Delivering Destiny: Flying Immortals’ Troops and Cavalry, each nine hundred million myriad in number.\n- Spontaneous Numinous Treasure Divine Immortals Delivering Destiny: Perfected Persons’ Troops and Cavalry, each nine hundred million myriad in number.\n- Spontaneous Numinous Treasure Divine Immortals Delivering Destiny: Divine Persons’ Troops and Cavalry, each nine hundred million myriad in number.\n- Spontaneous Numinous Treasure Divine Immortals Delivering Destiny: Sun-Moon Troops and Cavalry, each nine hundred million myriad in number.\n- Spontaneous Numinous Treasure Divine Immortals Delivering Destiny: Constellation Troops and Cavalry, each nine hundred million myriad in number.\n- Spontaneous Numinous Treasure Divine Immortals Delivering Destiny: Nine Palaces Troops and Cavalry, each nine hundred million myriad in number.\n- Spontaneous Numinous Treasure Divine Immortals Delivering Destiny: Five Thearchs’ Troops and Cavalry, each nine hundred million myriad in number.\n- Spontaneous Numinous Treasure Divine Immortals Delivering Destiny: Five Marchmounts’ Troops and Cavalry, each nine hundred million myriad in number.\n- Spontaneous Numinous Treasure Divine Immortals Delivering Destiny: Three Rivers and Four Seas’ Troops and Cavalry, each nine hundred million myriad in number.\n- Spontaneous Numinous Treasure Divine Immortals Delivering Destiny: All-Heaven Supervising Immortals’ Troops and Cavalry, each nine hundred million myriad in number.\n- Spontaneous Numinous Treasure Divine Immortals Extinguishing Destiny and Generating Corpse: Troops and Cavalry, each nine hundred million myriad in number.\n- Spontaneous Numinous Treasure Divine Immortals Initiating Destiny and Renewing Life: Troops and Cavalry, each nine hundred million myriad in number.\n- Spontaneous Numinous Treasure Divine Immortals: Golden Dragon Cavalry, each nine hundred million myriad in number.\n- Spontaneous Numinous Treasure Divine Immortals: Flying Dragon Cavalry, each nine hundred million myriad in number.\n- Spontaneous Numinous Treasure Divine Immortals: Roaming Dragon Cavalry, each nine hundred million myriad in number.\n- Spontaneous Numinous Treasure Divine Immortals: Divine Dragon Cavalry, each nine hundred million myriad in number.\n- Spontaneous Numinous Treasure Divine Immortals: Post Dragon Cavalry, each nine hundred million myriad in number.\n- Spontaneous Numinous Treasure Divine Immortals: Cloud Dragon Cavalry, each nine hundred million myriad in number.\n- Spontaneous Numinous Treasure Divine Immortals: Dragon-Tiger Cavalry, each nine hundred million myriad in number.\n- Spontaneous Numinous Treasure Divine Immortals: Dragon-Soaring Cavalry, each nine hundred million myriad in number.\n\nFrom the Eight Radiant Cavern-Heavens of the Supreme Mystery Upper Realm:\n- Spontaneous Numinous Treasure Divine Immortals Delivering Destiny: Nine Qi Heavenly Officials Azure Jade Maidens, each nine thousand in number.\n- Spontaneous Numinous Treasure Divine Immortals Delivering Destiny: Three Qi Heavenly Officials Vermilion Jade Maidens, each three thousand in number.\n- Spontaneous Numinous Treasure Divine Immortals Delivering Destiny: Seven Qi Heavenly Officials Luminous Stone Jade Maidens, each seven thousand in number.\n- Spontaneous Numinous Treasure Divine Immortals Delivering Destiny: Five Qi Heavenly Officials Mysterious Nourishing Jade Maidens, each fifty in number.\n- Spontaneous Numinous Treasure Divine Immortals Delivering Destiny: Central Yellow Upper Heavenly Officials Numinous Cord Jade Maidens, each twelve thousand in number.\n\nFrom the Eight Radiant Cavern-Heavens of the Supreme Mystery Upper Realm:\n- Spontaneous Numinous Treasure Divine Immortals: Eastern Marchmount Azure Thearch Master of Charts Flying Heavenly Officers, each twenty-four in number.\n- Spontaneous Numinous Treasure Divine Immortals: Southern Marchmount Vermilion Thearch Master of Charts Flying Heavenly Officers, each twenty-four in number.\n- Spontaneous Numinous Treasure Divine Immortals: Central Marchmount Yellow Thearch Master of Charts Flying Heavenly Officers, each twenty-four in number.\n- Spontaneous Numinous Treasure Divine Immortals: Western Marchmount White Thearch Master of Charts Flying Heavenly Officers, each twenty-four in number.\n- Spontaneous Numinous Treasure Divine Immortals: Northern Marchmount Black Thearch Master of Charts Flying Heavenly Officers, each twenty-four in number.\n\n*(Four characters per line, arranged in eight lines, all with text corners, written in black.)*\n\nFrom the Middle Cavern Mystery’s First Radiance:\n- Throat Mansion True Spirits Dao-Pervading Divine Immortals: Middle Cavern Mystery Refining-Soul Flying Heavenly Transcendent Officials, each twenty-four in number.\n\nFrom the Middle Cavern Mystery’s Second Radiance:\n- Lung Mansion True Spirits Dao-Balancing Divine Immortals: Middle Cavern Mystery Refining-Spirit Flying Heavenly Transcendent Officials, each twenty-four in number.",
      "overlap_context": ":\n- Thirty-Two Spontaneous Numinous Treasure Void Direct Talismans.\n- Thirty-Two Spontaneous Numinous Treasure Upper Prime Direct Talismans.\n- Thirty-Two Spontaneous Numinous Treasure Sun-Moon Direct Talismans.\n- Thirty-Two Spontaneous Numinous Treasure Transmission Direct Talismans.\n- Thirty-Two Spontaneous Numinous Treasure Memorial Direct Talismans.\n- Thirty-Two Spontaneous Numinous Treasure Fast Direct Talismans.\n- Thirty-Two Spontaneous Numinous Treasure Incense Attendance Direct Talismans.",
      "start_char": 7421,
      "end_char": 8779,
      "start_sentence": 347,
      "end_sentence": 390,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.14799928665161,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝二十四生图经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "洞玄中部三景心府真神道明神仙洞玄炼仙飞天上仙官，各二十四人。 洞玄中部四景肝府真神道清神仙洞玄智圣飞天上仙官，各二十四人。 洞玄中部五景胆府真神道放神仙洞玄定志飞天上仙官，各二十四人。 洞玄中部六景左肾府真神道卿神仙洞玄生神飞天上仙官，各二十四人。 洞玄中部七景右肾府真神道王神仙洞玄生仙飞天上仙官，各二十四人。 洞玄中部八景脾府真神道骞神仙洞玄守虚飞天上仙官，各二十四人。 中部八景洞玄飞行三五直灵神仙飞天度命功曹，各八十一人。 中部八景洞玄飞行三五直灵神仙正一升玄功曹，各八十一人。 中部八景洞玄飞行三五直灵神仙直使生炁功曹，各八十一人。 中部八景洞玄飞行三五直灵神仙灵宝青帝功曹，各八十一人。 中部八景洞玄飞行三五直灵神仙灵宝赤帝功曹，各八十一人。 中部八景洞玄飞行三五直灵神仙灵宝黄帝功曹，各八十一人。 中部八景洞玄飞行三五直灵神仙灵宝白帝功曹，各八一人。 中部八景洞玄飞行三五直灵神仙灵宝黑帝功曹，各八十一人。 中部八景洞玄飞行自然灵宝神仙通真度命使者，各八十一人。 中部八景洞玄飞行自然灵宝神仙传事飞天使者，各八十一人。 中部八景洞玄飞行自然灵宝神仙香官生炁使者，各八十一人。 中部八景洞玄飞行自然灵宝洞明青帝使者，各八十一人。 中部八景洞玄飞行自然灵宝洞明赤帝使者，各八十一人。 中部八景洞玄飞行自然灵宝洞明黄帝使者，各八十一人。 中部八景洞玄飞行自然灵宝洞明白帝使者，各八十一人。 中部八景洞玄飞行自然灵宝洞明黑帝使者，各八十一人。 中部八景洞玄飞行自然灵宝神仙监斋直事，各三十二人。 中部八景洞玄飞行自然灵宝神仙典斋直事，各三十二人。 中部八景洞玄飞行自然灵宝神仙传言书佐，各三十二人。 中部八景洞玄飞行自然灵宝神仙奉香书佐，各三十二人。 中部八景洞玄飞行自然灵宝神仙监功谒者，各三十二人。 中部八景洞玄飞行自然灵宝神仙校事谒者，各三十二人。 中部八景洞玄飞行自然灵宝神仙侍香玉童，各三十二人。 中部八景洞玄飞行自然灵宝神仙散花玉女，各三十二人。 中部三十二天洞玄八景飞行自然灵宝虚无直符，各三十二人。 中部三十二天洞玄八景飞行自然灵宝上元直符，各三十二人。 中部三十二天洞玄八景飞行自然灵宝日月直符，各三十二人。 中部三十二天洞玄八景飞行自然灵宝传言直符，各三十二人。 中部三十二天洞玄八景飞行自然灵宝奏事直符，各三十二人。 中部三十二天洞玄八景飞行自然灵宝直斋直符，各三十二人。 中部三十二天洞玄八景飞行自然灵宝侍香直符，各三十二人。 中部三十二一天洞玄八景飞行自然灵宝五帝直符，各三十二人。 中部三十二天洞玄一景灵宝阳宫丙辰炼喉飞仙上真，各三千二百人。 中部三十二天洞玄二景灵宝阴宫丙戌炼肺飞仙上真，各三千二百人。 中部三十二天洞玄三景灵宝阳宫丁丑炼心飞仙上真，各三千二百人。 中部三十二天洞玄四景灵宝阴宫丁未炼肝飞仙上真，各三千二百人。 中部三十二天洞玄五景灵宝阳宫戊寅炼胆飞仙上真，各三千二百人。 中部三十二天洞玄六景灵宝阴宫戊申炼左肾飞仙上真，各三千二百人。",
      "translated_text": "From the Middle Cavern Mystery’s Third Radiance:\n- Heart Mansion True Spirits Dao-Illuminating Divine Immortals: Middle Cavern Mystery Refining-Immortal Flying Heavenly Transcendent Officials, each twenty-four in number.\n\nFrom the Middle Cavern Mystery’s Fourth Radiance:\n- Liver Mansion True Spirits Dao-Purifying Divine Immortals: Middle Cavern Mystery Wisdom-Sage Flying Heavenly Transcendent Officials, each twenty-four in number.\n\nFrom the Middle Cavern Mystery’s Fifth Radiance:\n- Gallbladder Mansion True Spirits Dao-Releasing Divine Immortals: Middle Cavern Mystery Stabilizing-Will Flying Heavenly Transcendent Officials, each twenty-four in number.\n\nFrom the Middle Cavern Mystery’s Sixth Radiance:\n- Left Kidney Mansion True Spirits Dao-Ministering Divine Immortals: Middle Cavern Mystery Generating-Spirit Flying Heavenly Transcendent Officials, each twenty-four in number.\n\nFrom the Middle Cavern Mystery’s Seventh Radiance:\n- Right Kidney Mansion True Spirits Dao-Ruling Divine Immortals: Middle Cavern Mystery Generating-Immortal Flying Heavenly Transcendent Officials, each twenty-four in number.\n\nFrom the Middle Cavern Mystery’s Eighth Radiance:\n- Spleen Mansion True Spirits Dao-Ascending Divine Immortals: Middle Cavern Mystery Guarding-Void Flying Heavenly Transcendent Officials, each twenty-four in number.\n\nMiddle Cavern Eight Radiance Flying Three-Five Direct Numinous Divine Immortals Flying Heavenly Life-Conferring Attendants, each eighty-one in number.\nMiddle Cavern Eight Radiance Flying Three-Five Direct Numinous Divine Immortals Orthodox Unity Ascending-Mystery Attendants, each eighty-one in number.\nMiddle Cavern Eight Radiance Flying Three-Five Direct Numinous Divine Immortals Direct qi-Generating Attendants, each eighty-one in number.\nMiddle Cavern Eight Radiance Flying Three-Five Direct Numinous Divine Immortals Numinous Treasure Azure Thearch Attendants, each eighty-one in number.\nMiddle Cavern Eight Radiance Flying Three-Five Direct Numinous Divine Immortals Numinous Treasure Vermilion Thearch Attendants, each eighty-one in number.\nMiddle Cavern Eight Radiance Flying Three-Five Direct Numinous Divine Immortals Numinous Treasure Yellow Thearch Attendants, each eighty-one in number.\nMiddle Cavern Eight Radiance Flying Three-Five Direct Numinous Divine Immortals Numinous Treasure White Thearch Attendants, each eighty-one in number.\nMiddle Cavern Eight Radiance Flying Three-Five Direct Numinous Divine Immortals Numinous Treasure Black Thearch Attendants, each eighty-one in number.\n\nMiddle Cavern Eight Radiance Flying Spontaneous Numinous Treasure Divine Immortals Perfected-Conveying Life-Conferring Envoys, each eighty-one in number.\nMiddle Cavern Eight Radiance Flying Spontaneous Numinous Treasure Divine Immortals Transmission Flying Heavenly Envoys, each eighty-one in number.\nMiddle Cavern Eight Radiance Flying Spontaneous Numinous Treasure Divine Immortals Incense-Official qi-Generating Envoys, each eighty-one in number.\nMiddle Cavern Eight Radiance Flying Spontaneous Numinous Treasure Cavern-Illuminating Azure Thearch Envoys, each eighty-one in number.\nMiddle Cavern Eight Radiance Flying Spontaneous Numinous Treasure Cavern-Illuminating Vermilion Thearch Envoys, each eighty-one in number.\nMiddle Cavern Eight Radiance Flying Spontaneous Numinous Treasure Cavern-Illuminating Yellow Thearch Envoys, each eighty-one in number.\nMiddle Cavern Eight Radiance Flying Spontaneous Numinous Treasure Cavern-Illuminating White Thearch Envoys, each eighty-one in number.\nMiddle Cavern Eight Radiance Flying Spontaneous Numinous Treasure Cavern-Illuminating Black Thearch Envoys, each eighty-one in number.\n\nMiddle Cavern Eight Radiance Flying Spontaneous Numinous Treasure Divine Immortals Fast-Overseeing Direct Attendants, each thirty-two in number.\nMiddle Cavern Eight Radiance Flying Spontaneous Numinous Treasure Divine Immortals Fast-Directing Direct Attendants, each thirty-two in number.\nMiddle Cavern Eight Radiance Flying Spontaneous Numinous Treasure Divine Immortals Message-Transmitting Scribes, each thirty-two in number.\nMiddle Cavern Eight Radiance Flying Spontaneous Numinous Treasure Divine Immortals Incense-Presenting Scribes, each thirty-two in number.\nMiddle Cavern Eight Radiance Flying Spontaneous Numinous Treasure Divine Immortals Merit-Overseeing Heralds, each thirty-two in number.\nMiddle Cavern Eight Radiance Flying Spontaneous Numinous Treasure Divine Immortals Affairs-Examining Heralds, each thirty-two in number.\nMiddle Cavern Eight Radiance Flying Spontaneous Numinous Treasure Divine Immortals Incense-Attending Jade Lads, each thirty-two in number.\nMiddle Cavern Eight Radiance Flying Spontaneous Numinous Treasure Divine Immortals Flower-Scattering Jade Maidens, each thirty-two in number.\n\nMiddle Thirty-Two Heavens Middle Cavern Eight Radiance Flying Spontaneous Numinous Treasure Void Direct Talismans, each thirty-two in number.\nMiddle Thirty-Two Heavens Middle Cavern Eight Radiance Flying Spontaneous Numinous Treasure Upper Prime Direct Talismans, each thirty-two in number.\nMiddle Thirty-Two Heavens Middle Cavern Eight Radiance Flying Spontaneous Numinous Treasure Sun-Moon Direct Talismans, each thirty-two in number.\nMiddle Thirty-Two Heavens Middle Cavern Eight Radiance Flying Spontaneous Numinous Treasure Message-Transmitting Direct Talismans, each thirty-two in number.\nMiddle Thirty-Two Heavens Middle Cavern Eight Radiance Flying Spontaneous Numinous Treasure Memorial-Presenting Direct Talismans, each thirty-two in number.\nMiddle Thirty-Two Heavens Middle Cavern Eight Radiance Flying Spontaneous Numinous Treasure Fast-Overseeing Direct Talismans, each thirty-two in number.\nMiddle Thirty-Two Heavens Middle Cavern Eight Radiance Flying Spontaneous Numinous Treasure Incense-Attending Direct Talismans, each thirty-two in number.\nMiddle Thirty-Two Heavens Middle Cavern Eight Radiance Flying Spontaneous Numinous Treasure Five Thearchs Direct Talismans, each thirty-two in number.\n\nMiddle Thirty-Two Heavens Middle Cavern First Radiance Numinous Treasure Yang Palace Bingchen Throat-Refining Flying Immortals Perfected Ones, each three thousand two hundred in number.\nMiddle Thirty-Two Heavens Middle Cavern Second Radiance Numinous Treasure Yin Palace Bingxu Lung-Refining Flying Immortals Perfected Ones, each three thousand two hundred in number.\nMiddle Thirty-Two Heavens Middle Cavern Third Radiance Numinous Treasure Yang Palace Dingchou Heart-Refining Flying Immortals Perfected Ones, each three thousand two hundred in number.\nMiddle Thirty-Two Heavens Middle Cavern Fourth Radiance Numinous Treasure Yin Palace Dingwei Liver-Refining Flying Immortals Perfected Ones, each three thousand two hundred in number.\nMiddle Thirty-Two Heavens Middle Cavern Fifth Radiance Numinous Treasure Yang Palace Wuyin Gallbladder-Refining Flying Immortals Perfected Ones, each three thousand two hundred in number.\nMiddle Thirty-Two Heavens Middle Cavern Sixth Radiance Numinous Treasure Yin Palace Wushen Left-Kidney-Refining Flying Immortals Perfected Ones, each three thousand two hundred in number.",
      "overlap_context": "arranged in eight lines, all with text corners, written in black.)*\n\nFrom the Middle Cavern Mystery’s First Radiance:\n- Throat Mansion True Spirits Dao-Pervading Divine Immortals: Middle Cavern Mystery Refining-Soul Flying Heavenly Transcendent Officials, each twenty-four in number.\n\nFrom the Middle Cavern Mystery’s Second Radiance:\n- Lung Mansion True Spirits Dao-Balancing Divine Immortals: Middle Cavern Mystery Refining-Spirit Flying Heavenly Transcendent Officials, each twenty-four in number.",
      "start_char": 8780,
      "end_char": 10112,
      "start_sentence": 391,
      "end_sentence": 434,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.160921096801758,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝二十四生图经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "中部三十二天洞玄七景灵宝阳宫戊子炼右肾飞仙上真，各三千二百人。 中部三十二天洞玄八景灵宝阴宫戊午炼脾飞仙上真，各三千二百人。 太玄中部洞玄八景自然灵宝神仙度命天仙兵马，各九亿万骑。 太玄中部洞玄八景自然灵宝神仙度命地仙兵马，各九亿万骑。 太玄中部洞玄八景自然灵宝神仙度命飞仙兵马，各九亿万骑。 太玄中部洞玄八景自然灵宝神仙度命真人兵马，各九亿万骑。 太玄中部洞玄八景自然灵宝神仙度命神人兵马，各九亿万骑。 太玄中部洞玄八景自然灵宝神仙度命日月兵马，各九亿万骑。 太玄中部洞玄八景自然灵宝神仙度命星宿兵马，各九亿万骑。 太玄中部洞玄八景自然灵宝神仙度命九宫兵马，各九亿万骑。 太玄中部洞玄八景自然灵宝神仙度命五帝兵马，各九亿万骑。 太玄中部洞玄八景自然灵宝神仙度命五岳兵马，各九亿万骑。 太玄中部洞玄八景自然灵宝神仙度命三河四海兵马，各九亿万骑。 太玄中部洞玄八景自然灵宝神仙度命诸天督仙兵马，各九亿万骑。 太玄中部洞玄八景自然灵宝神仙灭度生尸兵马，各九亿万骑。 太玄中部洞玄八景自然灵宝神仙开度更生兵马，各九亿万骑。 太玄中部洞玄八景自然灵宝神仙金龙骑，各九亿万众。 太玄中部洞玄八景自然灵宝神仙飞龙骑，各九亿万众。 太玄中部洞玄八景自然灵宝神仙游龙骑，各九亿万众。 太玄中部洞玄八景自然灵宝神仙神龙骑，各九亿万众。 太玄中部洞玄八景自然灵宝神仙驿龙骑，各九亿万众。 太玄中部洞玄八景自然灵宝神仙云龙骑，各九亿万众。 太玄中部洞玄八景自然灵宝神仙龙虎骑，各九亿万众。 太玄中部洞玄八景自然灵宝神仙龙腾骑，各九亿万众。 太玄中部洞玄八景自然灵宝神仙度命九炁天官青牙玉女，各九千人。 太玄中部洞玄八景自然灵宝神仙度命三炁天官朱丹玉女，各三千人。 太玄中部洞玄八景自然灵宝神仙度命七炁天官明石玉女，各七千人。 太玄中部洞玄八景自然灵宝神仙度命五炁天官玄滋玉女，各五千人。 太玄中部洞玄八景自然灵宝神仙度命中央黄上天官灵钮玉女，各万二千人。 太玄中部洞玄八景自然灵宝神仙东岳青帝主图飞天吏，各二十四人。 太玄中部洞玄八景自然灵宝神仙南岳赤帝主图飞天吏，各二十四人。 太玄中部洞玄八景自然灵宝神仙中岳黄帝主图飞天吏，各二十四人。 太玄中部洞玄八景自然灵宝神仙西岳白帝主图飞天吏，各二十四人。 太玄中部洞玄八景自然灵宝神仙北岳黑帝主图飞天吏，各二十四人。 右四字一行合八行，皆有文角，朱书。 洞玄下部一景胃府真神道展神仙洞灵通元飞天上仙官，各二十四人。 洞玄下部二景穷肠府真神道还神仙洞灵洞微飞天上仙官，各二十四人。 洞玄下部三景大小肠府真神道厨神仙洞灵隐空飞天上仙官，各二十四人。 洞玄下部四景胴中府真神道虚神仙洞灵开明飞天上仙官，各二十四人。 洞玄下部五景胸膈府真神道冲神仙洞灵蔽日飞天上仙官，各二十四人。 洞玄下部六景两胁府真神道成神仙洞灵解形飞天上仙官，各二十四人。 洞玄下部七景左阳府真神道圭神仙洞灵灭迹飞天上仙官，各二十四人。 洞玄下部八景右阴府真神道生神仙洞灵腾虚飞天上仙官，各二十四人。",
      "translated_text": "Middle Thirty-Two Heavens Middle Cavern Seventh Radiance Numinous Treasure Yang Palace Wuzi Right-Kidney-Refining Flying Immortals Perfected Ones, each three thousand two hundred in number.\nMiddle Thirty-Two Heavens Middle Cavern Eighth Radiance Numinous Treasure Yin Palace Wuwu Spleen-Refining Flying Immortals Perfected Ones, each three thousand two hundred in number.\n\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Life-Delivering Heavenly Immortals Troops and Cavalry, each nine hundred million myriad riders.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Life-Delivering Earthly Immortals Troops and Cavalry, each nine hundred million myriad riders.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Life-Delivering Flying Immortals Troops and Cavalry, each nine hundred million myriad riders.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Life-Delivering Perfected Ones Troops and Cavalry, each nine hundred million myriad riders.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Life-Delivering Divine Beings Troops and Cavalry, each nine hundred million myriad riders.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Life-Delivering Sun and Moon Troops and Cavalry, each nine hundred million myriad riders.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Life-Delivering Constellations Troops and Cavalry, each nine hundred million myriad riders.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Life-Delivering Nine Palaces Troops and Cavalry, each nine hundred million myriad riders.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Life-Delivering Five Emperors Troops and Cavalry, each nine hundred million myriad riders.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Life-Delivering Five Peaks Troops and Cavalry, each nine hundred million myriad riders.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Life-Delivering Three Rivers and Four Seas Troops and Cavalry, each nine hundred million myriad riders.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Life-Delivering All-Heaven Supervising Immortals Troops and Cavalry, each nine hundred million myriad riders.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Salvation-Extinguishing Corpse-Generating Troops and Cavalry, each nine hundred million myriad riders.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Liberation-Rebirth-Initiating Troops and Cavalry, each nine hundred million myriad riders.\n\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Golden Dragon Cavalry, each nine hundred million myriad hosts.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Flying Dragon Cavalry, each nine hundred million myriad hosts.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Roaming Dragon Cavalry, each nine hundred million myriad hosts.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Divine Dragon Cavalry, each nine hundred million myriad hosts.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Courier Dragon Cavalry, each nine hundred million myriad hosts.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Cloud Dragon Cavalry, each nine hundred million myriad hosts.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Dragon-Tiger Cavalry, each nine hundred million myriad hosts.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Dragon-Soaring Cavalry, each nine hundred million myriad hosts.\n\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Life-Delivering Nine Qi Heavenly Officials Azure Jade Maidens, each nine thousand in number.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Life-Delivering Three Qi Heavenly Officials Vermilion Jade Maidens, each three thousand in number.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Life-Delivering Seven Qi Heavenly Officials Luminous Stone Jade Maidens, each seven thousand in number.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Life-Delivering Five Qi Heavenly Officials Mysterious Nourishment Jade Maidens, each five thousand in number.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Life-Delivering Central Yellow High Heavenly Officials Numinous Button Jade Maidens, each twelve thousand in number.\n\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Eastern Peak Azure Emperor Chart-Holding Flying Heavenly Officers, each twenty-four in number.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Southern Peak Vermilion Emperor Chart-Holding Flying Heavenly Officers, each twenty-four in number.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Central Peak Yellow Emperor Chart-Holding Flying Heavenly Officers, each twenty-four in number.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Western Peak White Emperor Chart-Holding Flying Heavenly Officers, each twenty-four in number.\nGreat Mystery Middle Cavern Eighth Radiance Natural Numinous Treasure Divine Immortals Northern Peak Black Emperor Chart-Holding Flying Heavenly Officers, each twenty-four in number.\n\nRight: four characters per line, totaling eight lines, all with textual corners, written in vermilion.\n\nLower Cavern First Radiance Stomach Mansion Perfected Spirits Dao-Extending Divine Immortals Cavern Numinous Penetrating Origin Flying Heavenly Transcendent Officials, each twenty-four in number.\nLower Cavern Second Radiance Exhausted Intestine Mansion Perfected Spirits Dao-Returning Divine Immortals Cavern Numinous Mysterious Void Flying Heavenly Transcendent Officials, each twenty-four in number.\nLower Cavern Third Radiance Large and Small Intestine Mansion Perfected Spirits Dao-Kitchen Divine Immortals Cavern Numinous Hidden Emptiness Flying Heavenly Transcendent Officials, each twenty-four in number.\nLower Cavern Fourth Radiance Torso Center Mansion Perfected Spirits Dao-Void Divine Immortals Cavern Numinous Illuminating Flying Heavenly Transcendent Officials, each twenty-four in number.\nLower Cavern Fifth Radiance Chest Diaphragm Mansion Perfected Spirits Dao-Surging Divine Immortals Cavern Numinous Sun-Concealing Flying Heavenly Transcendent Officials, each twenty-four in number.\nLower Cavern Sixth Radiance Two Flanks Mansion Perfected Spirits Dao-Accomplishing Divine Immortals Cavern Numinous Form-Dissolving Flying Heavenly Transcendent Officials, each twenty-four in number.\nLower Cavern Seventh Radiance Left Yang Mansion Perfected Spirits Dao-Jade Tablet Divine Immortals Cavern Numinous Vanishing Traces Flying Heavenly Transcendent Officials, each twenty-four in number.\nLower Cavern Eighth Radiance Right Yin Mansion Perfected Spirits Dao-Generating Divine Immortals Cavern Numinous Soaring Void Flying Heavenly Transcendent Officials, each twenty-four in number.",
      "overlap_context": "inous Treasure Yin Palace Dingwei Liver-Refining Flying Immortals Perfected Ones, each three thousand two hundred in number.\nMiddle Thirty-Two Heavens Middle Cavern Fifth Radiance Numinous Treasure Yang Palace Wuyin Gallbladder-Refining Flying Immortals Perfected Ones, each three thousand two hundred in number.\nMiddle Thirty-Two Heavens Middle Cavern Sixth Radiance Numinous Treasure Yin Palace Wushen Left-Kidney-Refining Flying Immortals Perfected Ones, each three thousand two hundred in number.",
      "start_char": 10113,
      "end_char": 11444,
      "start_sentence": 435,
      "end_sentence": 477,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.47830295562744,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝二十四生图经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "下部八景洞灵飞行三五直灵神仙飞天度命功曹，各八十一人。 下部八景洞灵飞行三五直灵神仙正一升玄功曹，各八十一人。 下部八景洞灵飞行三五直灵神仙直使生炁功曹，各八十一人。 下部八景洞灵飞行三五直灵神仙灵宝青帝功曹，各八十一人。 下部八景洞灵飞行三五直灵神仙灵宝赤帝功曹，各八十一人。 下部八景洞灵飞行三五直灵神仙灵宝黄帝功曹，各八十一人。 下部八景洞灵飞行三五直灵神仙灵宝白帝功曹，各八十一人。 下部八景洞灵飞行三五直灵神仙灵宝黑帝功曹，各八十一人。 下部八景洞灵飞行自然灵宝神仙通真度命使者，各八十一人。 下部八景洞灵飞行自然灵宝神仙传事飞天使者，各八十一人。 下部八景洞灵飞行自然灵宝神仙香官生炁使者，各八十一人。 下部八景洞灵飞行自然灵宝神仙洞明青帝使者，各八十一人。 下部八景洞灵飞行自然灵宝神仙洞明赤帝使者，各八十一人。 下部八景洞灵飞行自然灵宝神仙洞明黄帝使者，各八十一人。 下部八景洞灵飞行自然灵宝神仙洞明白帝使者，各八十一人。 下部八景洞灵飞行自然灵宝神仙洞明黑帝使者，各八十一人。 下部八景洞灵飞行自然灵宝神仙监斋直事，各三十二人。 下部八景洞灵飞行自然灵宝神仙典斋直事，各三十二人， 下部八景洞灵飞行自然灵宝神仙传言书佐，各三十二人。 下部八景洞灵飞行自然灵宝神仙奉香书佐，各三十二人。 下部八景洞灵飞行自然灵宝神仙监功谒者，各三十二人。 下部八景洞灵飞行自然灵宝神仙校事谒者三十二人。 下部八景洞灵飞行自然灵宝神仙侍香玉童，各三十二人。 下部八景洞灵飞行自然灵宝神仙散花玉女，各三十二人。 下部三十二天洞灵八景飞行自然灵宝虚无直符，各三十二人。 下部三十二天洞灵八景飞行自然灵宝上元直符，各三十二人。 下部三十二天洞灵八景飞行自然灵宝日月直符，各三十二人。 下部三十二天洞灵八景飞行自然灵宝传言直符，各三十二人。 下部三十二天洞灵八景飞行自然灵宝奏事直符，各三十二人。 下部三十二天洞灵八景飞行自然灵宝直斋直符，各三十二人。 下部三十二天洞灵八景飞行自然灵宝侍香直符，各三十二人。 下部三十二天洞灵八景飞行自然灵宝五帝直符，各三十二人。 下部三十二天洞灵一景灵宝阳宫己亥炼胃生华飞天上真，各三千二百人。 下部三十二天洞灵二景灵宝阴宫己巳炼穷肠生津飞天上真，各三千二百人。 下部三十二天洞灵三景灵宝阳宫己酉炼大小肠生液飞天上真，各三千二百人。 下部三十二天洞灵四景灵宝阴宫己卯炼胴中生光飞天上真，各三千二百人。 下部三十二天洞灵五景灵宝阳宫戊辰炼胸膈生仙飞天上真，各三千二百人。 下部三十二天洞灵六景灵宝阴宫戊戌炼两胁生神飞天上真，各三千二百人。 下部三十二天洞灵七景灵宝阳宫己丑炼左阳生命飞天上真，各三千二百人。 下部三十二天洞灵八景灵宝阴宫己未炼右阴生命飞天上真，各三千二百人。 太玄下部洞灵八景自然灵宝神仙度命天仙兵马，各九亿万骑。 太玄下部洞灵八景自然灵宝神仙度命地仙兵马，各九亿万骑。 太玄下部洞灵八景自然灵宝神仙度命飞仙兵马，各九亿万骑。 太玄下部洞灵八景自然灵宝神仙度命真人兵马，各九亿万骑。",
      "translated_text": "Lower Cavern Eighth Radiance Cavern Numinous Flying Three-Five Direct Numinous Divine Immortals Flying Heavenly Transcendents Life-Conveying Merit Recorders, each eighty-one in number.\nLower Cavern Eighth Radiance Cavern Numinous Flying Three-Five Direct Numinous Divine Immortals Orthodox Unity Ascending Mystery Merit Recorders, each eighty-one in number.\nLower Cavern Eighth Radiance Cavern Numinous Flying Three-Five Direct Numinous Divine Immortals Direct Envoys Primordial Qi Merit Recorders, each eighty-one in number.\nLower Cavern Eighth Radiance Cavern Numinous Flying Three-Five Direct Numinous Divine Immortals Numinous Treasure Azure Emperor Merit Recorders, each eighty-one in number.\nLower Cavern Eighth Radiance Cavern Numinous Flying Three-Five Direct Numinous Divine Immortals Numinous Treasure Vermilion Emperor Merit Recorders, each eighty-one in number.\nLower Cavern Eighth Radiance Cavern Numinous Flying Three-Five Direct Numinous Divine Immortals Numinous Treasure Yellow Emperor Merit Recorders, each eighty-one in number.\nLower Cavern Eighth Radiance Cavern Numinous Flying Three-Five Direct Numinous Divine Immortals Numinous Treasure White Emperor Merit Recorders, each eighty-one in number.\nLower Cavern Eighth Radiance Cavern Numinous Flying Three-Five Direct Numinous Divine Immortals Numinous Treasure Black Emperor Merit Recorders, each eighty-one in number.\nLower Cavern Eighth Radiance Cavern Numinous Flying Spontaneous Numinous Treasure Divine Immortals Penetrating Perfection Life-Conveying Envoys, each eighty-one in number.\nLower Cavern Eighth Radiance Cavern Numinous Flying Spontaneous Numinous Treasure Divine Immortals Transmission Attendants Flying Heavenly Envoys, each eighty-one in number.\nLower Cavern Eighth Radiance Cavern Numinous Flying Spontaneous Numinous Treasure Divine Immortals Incense Officials Primordial Qi Envoys, each eighty-one in number.\nLower Cavern Eighth Radiance Cavern Numinous Flying Spontaneous Numinous Treasure Divine Immortals Cavern Illuminating Azure Emperor Envoys, each eighty-one in number.\nLower Cavern Eighth Radiance Cavern Numinous Flying Spontaneous Numinous Treasure Divine Immortals Cavern Illuminating Vermilion Emperor Envoys, each eighty-one in number.\nLower Cavern Eighth Radiance Cavern Numinous Flying Spontaneous Numinous Treasure Divine Immortals Cavern Illuminating Yellow Emperor Envoys, each eighty-one in number.\nLower Cavern Eighth Radiance Cavern Numinous Flying Spontaneous Numinous Treasure Divine Immortals Cavern Illuminating White Emperor Envoys, each eighty-one in number.\nLower Cavern Eighth Radiance Cavern Numinous Flying Spontaneous Numinous Treasure Divine Immortals Cavern Illuminating Black Emperor Envoys, each eighty-one in number.\nLower Cavern Eighth Radiance Cavern Numinous Flying Spontaneous Numinous Treasure Divine Immortals Fast Supervisors, each thirty-two in number.\nLower Cavern Eighth Radiance Cavern Numinous Flying Spontaneous Numinous Treasure Divine Immortals Fast Directors, each thirty-two in number.\nLower Cavern Eighth Radiance Cavern Numinous Flying Spontaneous Numinous Treasure Divine Immortals Transmission Scribes, each thirty-two in number.\nLower Cavern Eighth Radiance Cavern Numinous Flying Spontaneous Numinous Treasure Divine Immortals Incense-Bearing Scribes, each thirty-two in number.\nLower Cavern Eighth Radiance Cavern Numinous Flying Spontaneous Numinous Treasure Divine Immortals Merit Supervisors, each thirty-two in number.\nLower Cavern Eighth Radiance Cavern Numinous Flying Spontaneous Numinous Treasure Divine Immortals Merit Examiners, thirty-two in number.\nLower Cavern Eighth Radiance Cavern Numinous Flying Spontaneous Numinous Treasure Divine Immortals Incense-Attending Jade Lads, each thirty-two in number.\nLower Cavern Eighth Radiance Cavern Numinous Flying Spontaneous Numinous Treasure Divine Immortals Flower-Scattering Jade Maidens, each thirty-two in number.\nLower Thirty-Two Heavens Cavern Numinous Eighth Radiance Flying Spontaneous Numinous Treasure Void Direct Talismans, each thirty-two in number.\nLower Thirty-Two Heavens Cavern Numinous Eighth Radiance Flying Spontaneous Numinous Treasure Upper Prime Direct Talismans, each thirty-two in number.\nLower Thirty-Two Heavens Cavern Numinous Eighth Radiance Flying Spontaneous Numinous Treasure Sun-Moon Direct Talismans, each thirty-two in number.\nLower Thirty-Two Heavens Cavern Numinous Eighth Radiance Flying Spontaneous Numinous Treasure Transmission Direct Talismans, each thirty-two in number.\nLower Thirty-Two Heavens Cavern Numinous Eighth Radiance Flying Spontaneous Numinous Treasure Memorial Direct Talismans, each thirty-two in number.\nLower Thirty-Two Heavens Cavern Numinous Eighth Radiance Flying Spontaneous Numinous Treasure Fast Direct Talismans, each thirty-two in number.\nLower Thirty-Two Heavens Cavern Numinous Eighth Radiance Flying Spontaneous Numinous Treasure Incense-Attending Direct Talismans, each thirty-two in number.\nLower Thirty-Two Heavens Cavern Numinous Eighth Radiance Flying Spontaneous Numinous Treasure Five Emperors Direct Talismans, each thirty-two in number.\nLower Thirty-Two Heavens Cavern Numinous First Radiance Numinous Treasure Yang Palace Ji-Hai Refining Stomach Engendering Splendor Flying Heavenly Perfected, each three thousand two hundred in number.\nLower Thirty-Two Heavens Cavern Numinous Second Radiance Numinous Treasure Yin Palace Ji-Si Refining Intestines Engendering Fluid Flying Heavenly Perfected, each three thousand two hundred in number.\nLower Thirty-Two Heavens Cavern Numinous Third Radiance Numinous Treasure Yang Palace Ji-You Refining Large and Small Intestines Engendering Humor Flying Heavenly Perfected, each three thousand two hundred in number.\nLower Thirty-Two Heavens Cavern Numinous Fourth Radiance Numinous Treasure Yin Palace Ji-Mao Refining Torso Engendering Radiance Flying Heavenly Perfected, each three thousand two hundred in number.\nLower Thirty-Two Heavens Cavern Numinous Fifth Radiance Numinous Treasure Yang Palace Wu-Chen Refining Chest Diaphragm Engendering Immortality Flying Heavenly Perfected, each three thousand two hundred in number.\nLower Thirty-Two Heavens Cavern Numinous Sixth Radiance Numinous Treasure Yin Palace Wu-Xu Refining Two Flanks Engendering Spirits Flying Heavenly Perfected, each three thousand two hundred in number.\nLower Thirty-Two Heavens Cavern Numinous Seventh Radiance Numinous Treasure Yang Palace Ji-Chou Refining Left Yang Engendering Life Flying Heavenly Perfected, each three thousand two hundred in number.\nLower Thirty-Two Heavens Cavern Numinous Eighth Radiance Numinous Treasure Yin Palace Ji-Wei Refining Right Yin Engendering Life Flying Heavenly Perfected, each three thousand two hundred in number.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Life-Conveying Heavenly Immortal Troops, each nine hundred million cavalry.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Life-Conveying Earthly Immortal Troops, each nine hundred million cavalry.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Life-Conveying Flying Immortal Troops, each nine hundred million cavalry.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Life-Conveying Perfected Troops, each nine hundred million cavalry.",
      "overlap_context": "ortals Cavern Numinous Form-Dissolving Flying Heavenly Transcendent Officials, each twenty-four in number.\nLower Cavern Seventh Radiance Left Yang Mansion Perfected Spirits Dao-Jade Tablet Divine Immortals Cavern Numinous Vanishing Traces Flying Heavenly Transcendent Officials, each twenty-four in number.\nLower Cavern Eighth Radiance Right Yin Mansion Perfected Spirits Dao-Generating Divine Immortals Cavern Numinous Soaring Void Flying Heavenly Transcendent Officials, each twenty-four in number.",
      "start_char": 11445,
      "end_char": 12794,
      "start_sentence": 478,
      "end_sentence": 521,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.713255405426025,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝二十四生图经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "太玄下部洞灵八景自然灵宝神仙度命神人兵马，各九亿万骑。 太玄下部洞灵八景自然灵宝神仙度命日月兵马，各九亿万骑。 太玄下部洞灵八景自然灵宝神仙度命星宿兵马，各九亿万骑。 太玄下部洞灵八景自然灵宝神仙度命九宫兵马，各九亿万骑。 太玄下部洞灵八景自然灵宝神仙度命五帝兵马，各九亿万骑 太玄下部洞灵八景自然灵宝神仙度命五岳兵马，各九亿万骑。 太玄下部洞灵八景自然灵宝神仙度命三河四海兵马，各九亿万骑。 太玄下部洞灵八景自然灵宝神仙度命诸天督仙兵马，各九亿万骑。 太玄下部洞灵八景自然灵宝神仙灭度生尸兵马，各九亿万骑。 太玄下部洞灵八景自然灵宝神仙开度更生兵马，各九亿万骑。 太玄下部洞灵八景自然灵宝神仙金龙骑，各九亿万众。 太玄下部洞灵八景自然灵宝神仙飞龙骑，各九亿万众。 太玄下部洞灵八景自然灵宝神仙游龙骑，各九亿万众。 太玄下部洞灵八景自然灵宝神仙神龙骑，各九亿万众。 太玄下部洞灵八景自然灵宝神仙驿龙骑，各九亿万众。 太玄下部洞灵八景自然灵宝神仙云龙骑，各九亿万众。 太玄下部洞灵八景自然灵宝神仙龙虎骑，各九亿万众。 太玄下部洞灵八景自然灵宝神仙龙腾骑，各九亿万众。 太玄下部洞灵八景自然灵宝神仙度命九炁天官青牙玉女，各九千人。 太玄下部洞灵八景自然灵宝神仙度命三炁天官朱丹玉女，各三千人。 太玄下部洞灵八景自然灵宝神仙度命七炁天官明石玉女，各七千人。 太玄下部洞灵八景自然灵宝神仙度命五炁天官玄滋玉女，各五千人。 太玄下部洞灵八景自然灵宝神仙度命中央黄上天官灵钮玉女，各万二千人。 太玄下部洞灵八景自然灵宝神仙东岳青帝主图飞天吏，各二十四人。 太玄下部洞灵八景自然灵宝神仙南岳赤帝主图飞天吏，各二十四人。 太玄下部洞灵八景自然灵宝神仙中岳黄帝主图飞天吏，各二十四人。 太玄下部洞灵八景自然灵宝神仙西岳白帝主图飞天吏，各二十四人。 太玄下部洞灵八景自然灵宝神仙北岳黑帝主图飞天吏，各二十四人。 右四字一行，合八行，皆有文角，黑书。 洞玄灵宝二十四生图经竟 #1今：原误作「金」，据文义改。",
      "translated_text": "Great Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Life-Conveying Divine Person Troops, each nine hundred million cavalry.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Life-Conveying Sun and Moon Troops, each nine hundred million cavalry.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Life-Conveying Constellation Troops, each nine hundred million cavalry.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Life-Conveying Nine Palaces Troops, each nine hundred million cavalry.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Life-Conveying Five Emperors Troops, each nine hundred million cavalry.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Life-Conveying Five Peaks Troops, each nine hundred million cavalry.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Life-Conveying Three Rivers and Four Seas Troops, each nine hundred million cavalry.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Life-Conveying All Heavens Supervising Immortal Troops, each nine hundred million cavalry.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Salvation-from-Destruction Corpse Troops, each nine hundred million cavalry.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Liberation-and-Rebirth Troops, each nine hundred million cavalry.\n\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Golden Dragon Cavalry, each nine hundred million hosts.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Flying Dragon Cavalry, each nine hundred million hosts.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Roaming Dragon Cavalry, each nine hundred million hosts.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Divine Dragon Cavalry, each nine hundred million hosts.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Post Dragon Cavalry, each nine hundred million hosts.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Cloud Dragon Cavalry, each nine hundred million hosts.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Dragon-Tiger Cavalry, each nine hundred million hosts.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Dragon-Soaring Cavalry, each nine hundred million hosts.\n\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Life-Conveying Nine Qi Heavenly Officials Azure Jade Maidens, each nine thousand.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Life-Conveying Three Qi Heavenly Officials Vermilion Jade Maidens, each three thousand.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Life-Conveying Seven Qi Heavenly Officials Bright Stone Jade Maidens, each seven thousand.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Life-Conveying Five Qi Heavenly Officials Mysterious Essence Jade Maidens, each five thousand.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Life-Conveying Central Yellow Prime Heavenly Officials Numinous Button Jade Maidens, each twelve thousand.\n\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Eastern Peak Azure Emperor Master Chart Flying Heavenly Clerks, each twenty-four.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Southern Peak Vermilion Emperor Master Chart Flying Heavenly Clerks, each twenty-four.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Central Peak Yellow Emperor Master Chart Flying Heavenly Clerks, each twenty-four.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Western Peak White Emperor Master Chart Flying Heavenly Clerks, each twenty-four.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Northern Peak Black Emperor Master Chart Flying Heavenly Clerks, each twenty-four.\n\nFour characters per line, totaling eight lines, all with patterned corners, written in black.\nCavern Mystery Numinous Treasure Twenty-Four Life Charts Scripture Complete.",
      "overlap_context": " Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Life-Conveying Earthly Immortal Troops, each nine hundred million cavalry.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Life-Conveying Flying Immortal Troops, each nine hundred million cavalry.\nGreat Mystery Lower Cavern Numinous Eighth Radiance Spontaneous Numinous Treasure Divine Immortals Life-Conveying Perfected Troops, each nine hundred million cavalry.",
      "start_char": 12795,
      "end_char": 13700,
      "start_sentence": 522,
      "end_sentence": 552,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.971649169921875,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞玄灵宝二十四生图经.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}