{
  "source_id": "洞玄灵宝无量度人经诀音义",
  "source_file": "chunked_daozang\\洞玄灵宝无量度人经诀音义.json",
  "total_chunks": 4,
  "total_original_chars": 3785,
  "total_translated_chars": 21118,
  "total_translation_time": 120.83860874176025,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\玉诀类\\洞玄灵宝无量度人经诀音义.txt",
    "category": "玉诀类"
  },
  "full_translation": "**The Pronunciation and Meaning of the *Wondrous Scripture of Limitless Salvation from the Cavern of Mystery and Numinous Treasure of the Most High***\n\n**Title:** *Pronunciation and Meaning of the Wondrous Scripture of Limitless Salvation from the Cavern of Mystery and Numinous Treasure of the Most High*. Compiled by the Tang-dynasty Daoist Zhang Wanfu. One scroll.\n\n**Source:** *Zhengtong Daoist Canon*, Cavern of Perfection Section, Jade Instructions Category.\n\n---\n\nWhen reciting the *Ten Revered Scriptures of the Most High’s Cavern of Mystery and Numinous Treasure of Limitless Salvation*, first perform three bows facing east, then stand facing north, turn left to face east, and strike the teeth thirty-six times. Visualize five-colored clouds and qi filling the chamber, with the Azure Dragon, White Tiger, Black Warrior, Vermilion Bird, and Phoenix guarding front and rear, while jade maidens, immortal youths, divine officials of the Five Thearchs, and nine hundred million legions of immortals, gods, and celestial soldiers encamp to left and right. After shaking the body thrice and completing the recitation, descend from the southern side to the earth, bowing as before.\n\n*(From the* Golden Register of Simplified Scriptures*.)*\n\nWhen unveiling the numinous mysteries and reciting scriptures, one must burn incense, don the proper ritual vestments, and pay homage to the scripture according to the rites. Recite the incantation:\n\nSilent, it reaches the ultimate origin,\nVast as the blade of kalpas, lofty as *Ā*.\nProfound and open, the text of the Cavern of Mystery—\nWho can fathom its depths?\nEntering the path of the Great Vehicle,\nWho reckons the kalpas’ span?\nNeither born nor destroyed,\nYet born from the lotus.\nTranscending the three realms’ bonds,\nWith compassion, unraveling the world’s snares.\nThe Perfected, of unsurpassed virtue,\nGeneration after generation, dwell as immortals.\n\n*(From the* Supreme Ultimate Precious Instructions*.)*\n\nThe *Divine Incantation for Preserving Life* follows the same incantation and method as above.\n\n---\n\nThe *Wondrous Scripture of Limitless Salvation, Supreme Grade, from the Most High’s Cavern of Mystery and Numinous Treasure* presents both the Dao and its methods, encompassing the general and the particular, serving as the Dharma King of the Most High’s dispensation and the transforming sovereign proclaimed by the Lord of the Dao.\n\n*Cavern of Mystery and Numinous Treasure* is the overarching title of the Ten Scriptures, while *Limitless Salvation* is the distinct designation of this scroll. *Supreme* is the most exalted appellation, and *Most High* the loftiest honorific. Lofty, it dwells above without summit; vast, no thing surpasses it. Thus, *Most High* signifies the sage’s embodiment of noble virtue, exhausting principle and perfecting subtlety, turning and returning beyond measure—difficult to conceive, hence the name.\n\n*Cavern* denotes emptiness, unimpeded flow, openness, and non-action, its clarity pervading the distant and its brilliance penetrating the profound. *Mystery* signifies profundity, remoteness, and wondrous tranquility, its principle abstruse and its origins obscure. *Numinous* refers to luminous essence and radiant wisdom, responding to transformations and fulfilling the proper end of nature, its wisdom pervading the ten thousand conditions. *Treasure* signifies rarity, excellence, and exalted honor, its manifestations shaping heaven and earth, its qi nurturing the myriad beings.\n\n*Limitless Salvation*:\n*Limitless* denotes what is beyond being; *measure* signifies the extremity of number; *salvation* means to ferry others across; *human* refers to the classification of beings. This signifies the salvation of gods and humans beyond all measure, guiding all who ascend to enter the wondrous gate, perfecting the aspirant’s heart to return to formlessness.\n\n*Supreme Grade Wondrous Scripture*:\nThis scripture originates before the beginning, first among all teachings. Among the grades, it is supreme, its primordial source ever profound—hence, the *Wondrous Scripture*.\n\nExploring its purport, its meaning is limitless. In elucidating this limitlessness, five aspects emerge:\n\n1. **Limitless in Essence**: The Celestial Worthy’s origin is ancient and unfathomable. Whether in true or responsive form, provisional or realized wisdom, it is thus named *Dragon Han*, yet is formless; styled *Kaihuang*, yet called *Yuanshi*. Adapting to conditions, it prescribes medicine for illness, its responses inexhaustible, its origin ever-present—this is the first, the limitless essence.\n\n2. **Limitless in Virtue**: Dwelling in primordial yang, serene and still, its mouth emits five-colored light, illuminating the great chiliocosm. It enables those who receive the Dharma to hear the scripture in the realm of the Most High—this is the second, the limitless virtue.\n\n3. **Limitless in Power**: The sage harbors sun and moon, regulates yin and yang, halts mountains and arrests rivers, harmonizing the sequence of qi. With a thousand cuts, it severs heads; subduing demons, it vanquishes evil. With ten thousand transformations, it severs forms, ensuring the perverse does not disturb the upright—this is the third, the limitless power.\n\n4. **Limitless in Grade**: While ordinary things possess grades—high and low, few and many—the sage responds to conditions without high or low, adapting to circumstances without excess or deficiency. It cannot be measured by high or low, nor grasped by few or many. Thus, it is without grade, and being without grade, it is limitless—this is the fourth, the limitless grade.\n\n5. **Limitless in Sound**: The sage expounds without words, yet the exposition is inexhaustible; resonates without sound, yet the resonance is unending. It enables understanding across kalpas and enlightenment among gods and humans. Thus, it is called the *hidden speech of Great Brahmā*, the *limitless sound*, or the *sound within heaven*—this is the fifth, the limitless sound.\n\nThis briefly outlines its general meaning.\n\n*(From the* Preface to the Ten Scriptures of the Cavern of Mystery and Numinous Treasure*.)*\n\nThe *Clarifying Regulations of the Four Poles* states: When reciting scriptures, one must align heart and eyes, avoiding wayward gazing and stray thoughts. Each time one unfolds the scroll and completes the verses, one must not pause midway or skip the celestial sounds. Three transgressions render immortality unattainable; five or more condemn one to the Three Paths and Five Sufferings of hell for ten thousand kalpas.\n\nThe *Hidden Commentary* states: After reading five hundred words of scripture, knock the teeth three times, lick the upper and lower lips with the tongue, and swallow saliva three times. This prevents exhaustion, clears the voice over time, and without this method, one harms the qi and wearies the spirit.\n\n*(From the* Preface to the Heart-Cultivation Practices of the Cavern of Mystery and Numinous Treasure Rituals*.)*\n\nPeople often recite the *Numinous Treasure Scripture of the Limitless Salvation of Humans*, yet while they may know the visualization incantations, few understand the proper measures. Here, these are fully expounded for clarity.\n\nFrom the title onward, the descent of the Primordial Beginning’s true scripture—being the eulogies of the Dao Lord—should follow the *Cavern of Mystery’s* Ten Scriptures. When inwardly intoning the inner sounds, one must adhere to the original method. Below, these are listed in order.\n\nUpon reaching the words of the Dao, proceed as follows, visualizing and invoking the officiant and the cyclical signs Jia and Yi. If reciting for oneself, omit the phrase \"and for others\"; if reciting for another, omit \"your servant.\" The heart cannot serve two masters. If reciting for both self and others, follow the original text. Upon completion, draw qi thirty-two times, slowly inhaling the qi of the Thirty-Two Heavens, then proceed with the recitation as prescribed. This is precisely the visualization method of the *Primordial Beginning’s Limitless Salvation of Humans*.\n\nFor the \"Practice of the Dao\" chapter: knock the teeth thirty-two times to ascend to the Thirty-Two Heavens, and bow in the heart thirty-two times. Each time, silently recite the names of the heavens, inwardly perceiving each, and bow in the heart. Though the body remains still, the heart prostrates as if the body were bowing. Practice this thoroughly beforehand to know the heavens’ locations, lest one falter in the moment, causing delay or disorder. All visualizations and invocations follow this principle.\n\n**The Eight Heavens of the East (Nine Qi of the Azure Heavens, beginning from the north and proceeding south):**\nGreat Yellow Sovereign Layered Heaven, Great Bright Jade Complete Heaven, Clear Bright Harmonious Youth Heaven, Primordial Countenance Level Nurturing Heaven, Primordial Bright Literary Ascension Heaven, Seven Luminaries Rubbing Yi Heaven, Void Transcending Heng Heaven, Great Ultimate Concealing Canopy Heaven.\n\n**The Eight Heavens of the South (Three Qi of the Cinnabar Heavens, beginning from the east and proceeding west):**\nVermilion Bright Harmonious Yang Heaven, Primordial Bright Reverent Splendor Heaven, Radiant Bright Ancestral Fluttering Heaven, Bamboo Grove August Reed Heaven, Void Bright Hall Radiance Heaven, Observing Bright Upright Stillness Heaven, Primordial Bright Reverent Celebration Heaven, Great Resplendent Ultimate Jade Heaven.\n\n**The Eight Heavens of the West (Seven Qi of the White Heavens, beginning from the south and proceeding north):**\nPrimordial Bearing Aperture Ascension Heaven, Great Peace August Cliff Heaven, Manifest Stability Ultimate Wind Heaven, Beginning August Filial Awn Heaven, Great Yellow Converging Weight Heaven, No-Thought River Origin Heaven, Upper Gambling Joy Heaven, Limitless Vow Oath Heaven.\n\n**The Eight Heavens of the North (Five Qi of the Black Mysterious Heavens, beginning from the west and proceeding east):**\nLuminous Court Rosy Crossing Heaven, Abyssal Penetrating Primordial Cavern Heaven, Brush Adorned Wondrous Completion Heaven, Elegant Joy Forbidden Upper Heaven, Peerless Constant Fusion Heaven, Jade Dragon Ascending Victory Heaven, Dragon Transformation Brahmā Crossing Heaven, Level Nurturing Excellence Heaven.\n\n**Method for Inwardly Intending the Inner Sounds of the Heavens**\n\n**Eastern Danlou Sixty-Four Character Visualization Method:**\nKnock the teeth nine times, visualize nine-colored dragons guiding before and behind, with nine layers of azure clouds enveloping the body. Recite the incantation:\n*\"Vermilion Brightness unfolds the chart,\nEight qi return to the true.\nGoverning the primordial pass,\nAzure Emperor, great spirit.\nFlowing transformations beyond the nine,\nEntwining my body.\nSpiritual sounds of eight writings,\nSixty-four chapters.\nIlluminating heaven and earth,\nUniting with me in immortality.\nConveying the dragon chariot,\nAscending to the imperial axle.\"*\n\nUpon completion, draw qi and swallow nine times. After nine years of practice, the eight heavens each send eight azure-waisted jade maidens and eight azure-flower jade lads to attend the body, bestowing the essence of azure teeth, generating bodily radiance that penetrates the void. After ten thousand recitations, the Dao is accomplished, enabling flight. Seven ancestors share this fortune and ascend to the Southern Palace.\n\n**Southern Nanyan Sixty-Four Character Visualization Method:**\nKnock the teeth three times, visualize vermilion phoenixes and phoenixes soaring before you, with three layers of crimson clouds enveloping the body. Silently recite the incantation:\n*\"Three qi meander,\nSpiritual phoenixes come flying.\nJade sounds of eight characters,\nResplendent in the Purple Tenuity.\nAuspicious day, great celebration,\nMy Dao opens wide.\nVermilion cinnabar feeds,\nGazing upward to absorb the spiritual radiance.\nBody generates water and fire,\nCrimson-clad in feathered robes.\nAscending the void, stepping in flight,\nFeet tread the phoenix ladder.\nCirculating through the eight heavens,\nSeven ancestors follow.\nUpon completion, draw qi and swallow three times. After three years of practice, the eight heavens each send eight great cinnabar jade maidens and eight great yang jade lads to attend the body, descending the essence of the three vermilion cinnabar qi. Complexion reverses to youth, enduring ten thousand kalpas without decline. Seven ancestors transcend and ascend, entering the Hall of Fortune, returning to the womb of royal lineage to be reborn.\n\n**Western Daoli Sixty-Four Character Visualization Method:**\nKnock the teeth seven times, visualize white tigers and lions guiding left and right, with seven layers of white clouds enveloping the body. Silently recite the incantation:\n*\"Seven qi of golden numen,\nEight heavens’ honored spirits.\nWhite tigers draw the carriage,\nLions bear the axle.\nSeven qi entwine,\nRefining me into immortality.\nBody ascends golden light,\nShining upon white clouds.\nInner and outer transformations,\nAscending into the cavern gate.\nSeven ancestors emerge from night,\nNine dark realms’ souls return.\nEons of deliverance,\nAbiding with the turning of the Dao.\"*\n\nUpon completion, draw qi and swallow seven times. After seven years of practice, the eight heavens each send eight white numinous jade lads to attend the body, descending the essence of the seven great white qi. Age halts, countenance remains youthful for ten thousand kalpas. Blessings extend to seven ancestors, who ascend to the Southern Palace, returning to the womb to be reborn in royal lineage, generation after generation.\n\nThe Northern Jue’s Sixty-Four Character Method of Mindful Recitation:\nStrike the teeth five times, envision soaring dragons with feathered canopies lush and dense on left and right, five layers of black clouds enveloping the body. Divine lads and jade maidens in feathered robes and flying garments attend before and behind. Recite the esoteric incantation:\n\n*\"Primordial Heaven lingers,\nFlowing radiance ascends to Supreme Clarity.\nGreat Possession initiates the turning,\nEight characters rise in luminous height.\nFlying essence stills the void,\nCavernous yin spontaneously arises.\nFive qi entwine,\nIrrigating my form.\nCrowned and girded at Northern Solitude,\nReceiving refinement from cavernous numina.\nKidney palace emerges from the north,\nInner and outer gleam with essence.\nSoaring through the Three Realms,\nRoaming and feasting in the Purple Court.\nSeven ancestors rejoice together,\nDelighting in kalpas of age.\nWithin the Seven Treasures Grove,\nReturning to the womb to be reborn.\nEmerging from eternal night,\nNames recorded in the Southern Palace.\nYellow registers and white tablets,\nGeneration after generation born as immortals.\"*\n\nUpon completion, draw qi and swallow five times. After five years of practice, the eight heavens each send eight lads of Grand Primordial Jade to attend the body, descending the essence of the five numinous qi. Years reverse, countenance remains youthful, life preserved in the Three Clarities. Blessings extend to seven ancestors, generation after generation born as immortals.\n\nFrom the *Scripture of Numinous Jade Characters of the Numinous Treasure*. For all who uphold this scripture of deliverance, the methods of Six Perfections’ mindful recitation and invocation are as set forth above.\n\n**Glossary Notes:**\n*Dao* speaks—\nThe Most High Dao Lord composed the preface to this scripture, hence all is termed *Dao*-utterance.\n\nAt the Azure Heavens’ Center—this is the Heaven of the Northeast. *Fuli*: in local pronunciation, *Du*. *Liang*: pronounced *liang* (去声). *Wu yang*: read *yǎng* (於仰切), denoting the bounds of heaven’s enclosure. *Yubo*: as written. *Yin*: read *yīn* (音因), signifying muteness, an ailment of speech; also refers to yin. *Bo*: read *bǒ* (博我切), a foot ailment. *Ē*: read *jiǔ* (音久), a chronic illness. *Gù*: read *shěn* (音沈), the appearance of long-entrenched affliction. *Fǎn*: read *fǔ* (府远切). *Bóbó*: read *fú* (音拂). *Kuòsàn*: read *sìgān* (思干切). *Jiāndù*: *jiān* (上音缄). *Cūxī*: read *zǔgū* (祖沽切). *Shū*: read *shū* (音叔). *Xū*: read *xū* (许物切). *Zhòngshāng*: *zhòng* (中去). *Zēng*: read *zǐnéng* (子能切). *@*: read *jì* (音忌). *Jingshǐ chū jiào*: Some say *Yuánshǐ chū jiào* (\"Primordial Beginning issued the teaching\"), which is incorrect. *Cáng*: read *sìláng* (似郎切). *Xuánjī*: *xuán* (上旋) and *jī* (下机), referring to the four stars of the Dipper’s bowl. *Bùxíng*: read *héng* (音衡). *Shī*: sometimes written as *shī sǐ* (\"corpse-death\"). *Sāng*: read *xīyī* (息依切). *Wēi wèi zhì tiān*: phrase ends here. *Yì céng*: read *zēng* (音憎). *Shàng*: read *cháng* (常去). *Shījiě*: the state of discarding the body to conceal transformation, whereby the inner self departs and the physical form attains immortality. *Cháng yì*: read *yíngzhī* (营只切). *Duàn dì*: read *túguǎn* (徒管切). *Cháng wéi*: read *gānwěi* (干伪切). *Wéi dìwáng*: read as *zhēngyuè wèi* (正月位), same as the imperial throne. *Wěngmíng*: read *wūkǒng* (乌孔切). *Shǐzhě*: read *shīshì* (师事切). *Dàfàn*: the eight heavens above the sun and moon. *Miǎomiǎo jiérèn*: *miǎo* as in *miǎománg* (\"vast and indistinct\"). *Sānhuá*: level tone. *Líbiàn*: *biàn* as in *fāngbiàn* (\"expedient\"). *Sēn*: read *suǒcén* (所岑切). *Jìnghóng*: read *hóng* (音泓). *Dàxíng*: read *héng* (音衡). *Dù’è*: read *è* (音厄). *Cān*: read *cān* (音参). *Jiānzhēn*: read *jiān* (音缄). *Yìngdù*: read *xiǎng* (音响). *Yùlán*: read *lán* (音蓝). *Tiánhuài*: *tián* (上音甜), *huài* (下乌外切). *Huángjiā*: read *jiā* (音加). *Wǎnlí*: *wǎn* (上於远切), *lí* (下力低切). *Ruǎnlè*: read *yuè* (音岳). *Bóbèi*: read *pèi* (音沛). *Tán*: read *tán* (音潭). *Xiùlè*: read *luò* (音洛). *Zǒngjiān*: read *jiàn* (音鉴). *Xíngyuán*: *yuán* (下孟切). *Jīnrì xīnqìng shòudù*: phrase ends here. *Dànshí*: read *duōgān* (多甘切). *Gǔcóng*: read *cíyòng* (词用切). *Yóuguān*: read *guàn* (音贯). *Xián tīng*: read *tīng* (音汀). *Xìng*: read *húdǐng* (胡顶切). *Shǐ tiān*: read *shǐ* (音史). *Yīshíwǔ fēn*: read *fúwèn* (扶问切). *Shàng wén zhūtiān*: Some say *guān* (\"gate\"), which is incorrect. *Zhǎnguó*: read *gǔbó* (古伯切), the punishment of severing ears. *Lè xī*: read *luò* (音洛); same below. *Guò zhī*: read *gǔwò* (古卧切). *Bié zhēn*: read *bǐyuè* (彼月切). *Xiètùi*: read *gǔ’ài* (古隘切). *Yúncéng*: read *céng* (音层). *Yì xié*: read *yǐzhì* (以致切). *Bù lè*: read *wǔjiào* (五教切). *Dé guò*: read *gē* (音戈). *Jiù gé*: Some say *qí gé* (\"its standard\"), which is incorrect. *Pǐ zhōng*: read *bǐ* (音彼). *Páo*: read *xiū* (音休), denoting grandeur. *Fán yǒu cǐ zāi tóng qì*: phrase ends here. *Wéi*: read *wèi* (音位). *Háofēn*: read *fúwèn* (符问切). *Dǎn*: read *dān* (丹上). *Huì*: read *wài* (乌外切). *Hé*: read *wài* (胡外切). *Guānyīn*: read *guàn* (音贯). *Huí zhí*: read *zhǐ* (音只). *Nán yàn*: read *yàn* (音艳). *Shēnshēn*: Yan Gong’s annotation reads *xǐxǐ* (\"pure and clear\"). *Tuī qián*: read *chuī* (音吹). *Duò luò*: *duò* (上铎), *luò* (下郝). *Yuán zhān*: read *zhīlián* (陟连切). *Xiāo yú*: read *yú* (音愚). *Yì miǎo*: read *yì* (音亦). *Jué*: read *jūfù* (居缚切). *Dōng fù*: read *fāngmào* (方茂切). *Zǒngjiān*: read *jiàn* (音鉴). *Bù bì*: read *bì* (音壁). *Dà liàng xuán xuán*: Some say *yuán liàng* (\"original measure\"), which is incorrect.\n\nThis scripture was received by the Most High Lord of the Dao from the Primordial Celestial Worthy and transmitted to the world. The Lord of the Dao composed three prefaces: the first, the middle, and the last. The first preface begins with *Dao* speaks of the past... and ends with facing east to recite the scripture. The middle preface follows the *Song of the Three Realms* and includes these two chapters, which together constitute the *Profound and Luminous Utmost Words*. The last preface begins with *Among the heavens...* and concludes with *Great Measure, Profound and Mysterious*.\n\nThe scripture contains two chapters: the first from *Primordial Mysterious* to *Proclaiming the Upper Clarity*, and the latter from *Primordial Jade Calendar* to *Disasters befalling the seven ancestors*. The esoteric incantations of the Great Brahmā are not counted among these two chapters. Some mistakenly treat the scripture as one chapter and the esoteric verses as two, which is also incorrect. The middle preface states: *Reciting the scripture ten thousand times enables one to attain the Dao*. The *Profound and Luminous Utmost Words* are thus esoteric and abstruse, not part of the two chapters of the scripture proper.\n\nThose who recite this text must believe wholeheartedly without doubt. When merit is complete and the Dao perfected, profound understanding will naturally arise. Both humans and celestials share in the blessings, and the living and the deceased alike receive grace. How can one not be resolute? How can one not strive?\n\nThe *Records of Mysterious Verifications of the Daoist Gate* and the *Collected Verifications of the Daoist Gate* contain accounts of those who attained verification through upholding this scripture, all of which have been transmitted. Those who seek communion with the true should diligently practice this.\n\nThe *Pronunciation and Meaning of the Precepts of the Numinous Treasure Scripture of Limitless Salvation* concludes here.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞玄灵宝无量度人经诀音义 经名：洞玄灵宝无量度人经诀音义。 唐代道士张万福撰。 一卷。 底本出处：《正统道藏》洞真部玉诀类。 洞玄灵宝无量度人经诀音义 凡持太上洞玄灵宝无量十部尊经，东向前三礼，北向立左转东向，叩齿三十六通。 思五色云气覆满一室，青龙白虎，师子玄武，朱雀凤凰，备守前后，玉女仙童，五帝神官，神仙兵马九亿万众，营卫左右。 便摇身三过而诵经竟，当从南面下肺，礼如初。 右出金录简文经。 凡开灵蕴，诵经之时，皆当烧香，整具法服，礼经如法，诵咒曰： 寂寂至无宗，虚峙劫刃阿。 豁落洞玄文，谁测此幽遐。 一入大乘路，孰计年劫多。 不生亦不灭，欲生因莲华。 超浚三界徒，慈心解世罗。 真人无上德，世世为仙家。 右出太极宝诀。 持生神章经亦同此上咒及法o 《太上洞玄灵宝无量度人上品妙经》者，斯乃人法双举，总别俱舍，太上一代之法王，道君宣经之化主。 洞玄灵宝是十部之总题，无量度人为一轴之别目。 太者，极大之嘉名。 上者，穷高之美称。 穷高则居上无顶，极大则物莫能过。 欲明圣人体贵德尊，穷理尽妙，转回靡测，难可思议，故云太上。 洞者，虚通不滞，豁达无为，营览清遥，显畅遐彻。 玄者，冲微邃远，妙寂湛然，理致杳冥，幽原眇邈。 灵者，精用朗挣，智照圆明，将应变尽性之宜，实慧周万机之境。 宝者，珍奇挺秀，尊贵加荣，布象则天地成形，贷炁则含生化育。 无量度人者。 无是不有之目，量是数极之名，度以济彼为言，人以物类成称。 斯乃济度天人，极无数量，凡厥升进，俱入妙门，成就有心，使归无相。 上品妙经者，此经始於无始，最为先说，众品之内，标之其上，元宗常湛，故曰妙经。 寻斯旨趣，义含无量，就明无量，自有五意。 一者体无量，二者德无量，三者威无量，四者品无量，五者音无量。 体无量者，但天尊宗源久远，本自难知，或真应两身，权实二智，是以托名龙汉，即日无形，设号开皇，乃称元始，随机设教，逐病与药，周应不穷，元乎不在，此第一体元量也。 德无量者，体处元阳，恬神静漠，口含五色，光照大千，能使受法珠中，闻经太上，此第二德无量也。 威无量者，圣人怀藏日月，推定阴阳，回山驻流，调和炁序，千千截首，制伏祆魔，万万翦形，邪不扰正，此第三威无量也。 品无量者，若论凡物，皆有品第，即有高下少多之目，今明圣人应物随缘，非高非下，赴机逐便，不少不多，难可以高下格量，无能以少多所得，是以无品，品则无量，此第四品元量也。 音元量者，明圣人以无言之说，说则不穷，无声之响，响则无绝，使历劫解悟，人天晓闻，故云大梵隐语，无量之音，又云天中之音，斯之谓也，此第五音无量也。 略陈梗概，其意云尔。 右出洞元灵宝十部经序。",
      "translated_text": "**The Pronunciation and Meaning of the *Wondrous Scripture of Limitless Salvation from the Cavern of Mystery and Numinous Treasure of the Most High***\n\n**Title:** *Pronunciation and Meaning of the Wondrous Scripture of Limitless Salvation from the Cavern of Mystery and Numinous Treasure of the Most High*. Compiled by the Tang-dynasty Daoist Zhang Wanfu. One scroll.\n\n**Source:** *Zhengtong Daoist Canon*, Cavern of Perfection Section, Jade Instructions Category.\n\n---\n\nWhen reciting the *Ten Revered Scriptures of the Most High’s Cavern of Mystery and Numinous Treasure of Limitless Salvation*, first perform three bows facing east, then stand facing north, turn left to face east, and strike the teeth thirty-six times. Visualize five-colored clouds and qi filling the chamber, with the Azure Dragon, White Tiger, Black Warrior, Vermilion Bird, and Phoenix guarding front and rear, while jade maidens, immortal youths, divine officials of the Five Thearchs, and nine hundred million legions of immortals, gods, and celestial soldiers encamp to left and right. After shaking the body thrice and completing the recitation, descend from the southern side to the earth, bowing as before.\n\n*(From the* Golden Register of Simplified Scriptures*.)*\n\nWhen unveiling the numinous mysteries and reciting scriptures, one must burn incense, don the proper ritual vestments, and pay homage to the scripture according to the rites. Recite the incantation:\n\nSilent, it reaches the ultimate origin,\nVast as the blade of kalpas, lofty as *Ā*.\nProfound and open, the text of the Cavern of Mystery—\nWho can fathom its depths?\nEntering the path of the Great Vehicle,\nWho reckons the kalpas’ span?\nNeither born nor destroyed,\nYet born from the lotus.\nTranscending the three realms’ bonds,\nWith compassion, unraveling the world’s snares.\nThe Perfected, of unsurpassed virtue,\nGeneration after generation, dwell as immortals.\n\n*(From the* Supreme Ultimate Precious Instructions*.)*\n\nThe *Divine Incantation for Preserving Life* follows the same incantation and method as above.\n\n---\n\nThe *Wondrous Scripture of Limitless Salvation, Supreme Grade, from the Most High’s Cavern of Mystery and Numinous Treasure* presents both the Dao and its methods, encompassing the general and the particular, serving as the Dharma King of the Most High’s dispensation and the transforming sovereign proclaimed by the Lord of the Dao.\n\n*Cavern of Mystery and Numinous Treasure* is the overarching title of the Ten Scriptures, while *Limitless Salvation* is the distinct designation of this scroll. *Supreme* is the most exalted appellation, and *Most High* the loftiest honorific. Lofty, it dwells above without summit; vast, no thing surpasses it. Thus, *Most High* signifies the sage’s embodiment of noble virtue, exhausting principle and perfecting subtlety, turning and returning beyond measure—difficult to conceive, hence the name.\n\n*Cavern* denotes emptiness, unimpeded flow, openness, and non-action, its clarity pervading the distant and its brilliance penetrating the profound. *Mystery* signifies profundity, remoteness, and wondrous tranquility, its principle abstruse and its origins obscure. *Numinous* refers to luminous essence and radiant wisdom, responding to transformations and fulfilling the proper end of nature, its wisdom pervading the ten thousand conditions. *Treasure* signifies rarity, excellence, and exalted honor, its manifestations shaping heaven and earth, its qi nurturing the myriad beings.\n\n*Limitless Salvation*:\n*Limitless* denotes what is beyond being; *measure* signifies the extremity of number; *salvation* means to ferry others across; *human* refers to the classification of beings. This signifies the salvation of gods and humans beyond all measure, guiding all who ascend to enter the wondrous gate, perfecting the aspirant’s heart to return to formlessness.\n\n*Supreme Grade Wondrous Scripture*:\nThis scripture originates before the beginning, first among all teachings. Among the grades, it is supreme, its primordial source ever profound—hence, the *Wondrous Scripture*.\n\nExploring its purport, its meaning is limitless. In elucidating this limitlessness, five aspects emerge:\n\n1. **Limitless in Essence**: The Celestial Worthy’s origin is ancient and unfathomable. Whether in true or responsive form, provisional or realized wisdom, it is thus named *Dragon Han*, yet is formless; styled *Kaihuang*, yet called *Yuanshi*. Adapting to conditions, it prescribes medicine for illness, its responses inexhaustible, its origin ever-present—this is the first, the limitless essence.\n\n2. **Limitless in Virtue**: Dwelling in primordial yang, serene and still, its mouth emits five-colored light, illuminating the great chiliocosm. It enables those who receive the Dharma to hear the scripture in the realm of the Most High—this is the second, the limitless virtue.\n\n3. **Limitless in Power**: The sage harbors sun and moon, regulates yin and yang, halts mountains and arrests rivers, harmonizing the sequence of qi. With a thousand cuts, it severs heads; subduing demons, it vanquishes evil. With ten thousand transformations, it severs forms, ensuring the perverse does not disturb the upright—this is the third, the limitless power.\n\n4. **Limitless in Grade**: While ordinary things possess grades—high and low, few and many—the sage responds to conditions without high or low, adapting to circumstances without excess or deficiency. It cannot be measured by high or low, nor grasped by few or many. Thus, it is without grade, and being without grade, it is limitless—this is the fourth, the limitless grade.\n\n5. **Limitless in Sound**: The sage expounds without words, yet the exposition is inexhaustible; resonates without sound, yet the resonance is unending. It enables understanding across kalpas and enlightenment among gods and humans. Thus, it is called the *hidden speech of Great Brahmā*, the *limitless sound*, or the *sound within heaven*—this is the fifth, the limitless sound.\n\nThis briefly outlines its general meaning.\n\n*(From the* Preface to the Ten Scriptures of the Cavern of Mystery and Numinous Treasure*.)*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1089,
      "start_sentence": 0,
      "end_sentence": 41,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.20916509628296,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\洞玄灵宝无量度人经诀音义.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "《四极明科》曰：凡诵经，当令心目相应，目无妄视，心无异念。 每使披卷言句周竟，不得中住，越略天音，三犯万不得仙，五犯已上，死充地狱三涂五苦万劫之中。 《隐注》曰：读经五百言，则叩齿三下，以舌舐上下唇，咽液三过，令人不极，久而声清，不如此法，损气劳神也。 右出洞玄灵宝斋内事心业序 人间多读诵《洞玄灵宝元量度人经》，虽有祝想之诀，而罕解节度，今复具言，庶可得知。 自题以下降元始正经，既是道君叔赞，宜依洞玄十部。 存念内音，自须依本法。 今具列之如左。 读至道言，次依下文，存思祝诵臣及甲乙。 若自为，不宜云，及为人，不宜云，臣心不兼二故也。 若为己及人，宜依本文。 毕，引炁三十二过，须徐徐引取三十二天之炁，然后依法诵之。 此正是元始元量度人存念法也。 行道章，叩齿三十二通，上闻三十二天，心拜三十二过。 须一一依口密诵天名，心闻诸天，一一心拜。 心拜，形虽不动，随心屈伏，如身礼也。 皆先习精熟，知天所在，无令临事致得，迟回不次。 凡存念祝诵，悉皆如此也。 太黄皇曾天，太明玉完天，清明何童天，元脸平育天， 元明文举天，七曜摩夷天，虚无越衡天，太极蒙翳天。 右八天位系东方九炁青天，从北头为始南行也。 赤明和阳天，元明恭华天，曜明宗飘天，竺落皇笳天， 虚明堂曜天，观明端静天，元明恭庆天，太焕极瑶天。 右八天位系南方三炁丹天，从东头起西行。 元载孔升天，太安皇崖天，显定极风天，始皇孝芒天， 太黄翕重天，无思江由天，上揲阮乐天，无极昙誓天。 右八天位系西方七炁素天，从南头为始北行。 皓庭霄度天，渊通元洞天，翰宠妙成天，秀乐禁上天， 无上常融天，玉隆腾胜天，龙变梵度天，平育贾奕天。 右八天位系北方五黑玄天，从西头始东行。 诵诸天内音存念法 东亶娄六十四字存念法。 叩齿九通，思九色之龙导引前后，青云九重覆匝身形，咒曰： 赤明开图，八炁回真。 总统元关，青帝大神。 流化九外，缠绵我身。 灵音八书，六十四篇。 洞明天地，与我合仙。 运致龙驾，上升帝辕。 咒毕，引炁九咽止。 行之九年，八天各以青腰玉女、青华玉童各八人，侍卫身形，致青牙之精，生身光明，彻见虚无。 万遍道成，即得飞行，七祖同福，皆升南宫也。 南南爓六十四字存念法。 叩齿三通，思朱雀凤凰翱翔其前，绛云三重覆匝身形，密咒曰： 三炁徘徊，灵凤来飞。 玉音八字，爓焕紫微。 吉日大庆，我道洞开。 朱丹哺饴，仰吸灵晖。 身生水火，绛被羽衣。 登空飞步，足践凤梯。 周旋八天，七祖相随。 咒毕，引炁三咽止。 行之三年，八天各以太丹玉女、太阳玉童各八人，侍卫身形，降致朱丹三炁之精，反白留容，万劫不倾，七祖超升，上入福堂，反胎王家，即得更生。 西刀利六十四字存念法。 叩齿七通，思白虎师子导引左右，素云七重覆匝身形，密咒曰： 七炁金灵，八天尊神。 白虎策辇，师子捧辕。 七炁缠绵，炼我成仙。 身登金光，映照素云。 内外变化，升入洞门。 七祖出夜，九幽旋魂。 亿劫开度，随运长存。 咒毕引炁七咽止。 行之七年，八天各以素灵玉童八人侍卫身形，降致太素七炁之精，停年留貌，万劫童颜，庆及七祖，升度南宫，反胎更生，世世王门。",
      "translated_text": "The *Clarifying Regulations of the Four Poles* states: When reciting scriptures, one must align heart and eyes, avoiding wayward gazing and stray thoughts. Each time one unfolds the scroll and completes the verses, one must not pause midway or skip the celestial sounds. Three transgressions render immortality unattainable; five or more condemn one to the Three Paths and Five Sufferings of hell for ten thousand kalpas.\n\nThe *Hidden Commentary* states: After reading five hundred words of scripture, knock the teeth three times, lick the upper and lower lips with the tongue, and swallow saliva three times. This prevents exhaustion, clears the voice over time, and without this method, one harms the qi and wearies the spirit.\n\n*(From the* Preface to the Heart-Cultivation Practices of the Cavern of Mystery and Numinous Treasure Rituals*.)*\n\nPeople often recite the *Numinous Treasure Scripture of the Limitless Salvation of Humans*, yet while they may know the visualization incantations, few understand the proper measures. Here, these are fully expounded for clarity.\n\nFrom the title onward, the descent of the Primordial Beginning’s true scripture—being the eulogies of the Dao Lord—should follow the *Cavern of Mystery’s* Ten Scriptures. When inwardly intoning the inner sounds, one must adhere to the original method. Below, these are listed in order.\n\nUpon reaching the words of the Dao, proceed as follows, visualizing and invoking the officiant and the cyclical signs Jia and Yi. If reciting for oneself, omit the phrase \"and for others\"; if reciting for another, omit \"your servant.\" The heart cannot serve two masters. If reciting for both self and others, follow the original text. Upon completion, draw qi thirty-two times, slowly inhaling the qi of the Thirty-Two Heavens, then proceed with the recitation as prescribed. This is precisely the visualization method of the *Primordial Beginning’s Limitless Salvation of Humans*.\n\nFor the \"Practice of the Dao\" chapter: knock the teeth thirty-two times to ascend to the Thirty-Two Heavens, and bow in the heart thirty-two times. Each time, silently recite the names of the heavens, inwardly perceiving each, and bow in the heart. Though the body remains still, the heart prostrates as if the body were bowing. Practice this thoroughly beforehand to know the heavens’ locations, lest one falter in the moment, causing delay or disorder. All visualizations and invocations follow this principle.\n\n**The Eight Heavens of the East (Nine Qi of the Azure Heavens, beginning from the north and proceeding south):**\nGreat Yellow Sovereign Layered Heaven, Great Bright Jade Complete Heaven, Clear Bright Harmonious Youth Heaven, Primordial Countenance Level Nurturing Heaven, Primordial Bright Literary Ascension Heaven, Seven Luminaries Rubbing Yi Heaven, Void Transcending Heng Heaven, Great Ultimate Concealing Canopy Heaven.\n\n**The Eight Heavens of the South (Three Qi of the Cinnabar Heavens, beginning from the east and proceeding west):**\nVermilion Bright Harmonious Yang Heaven, Primordial Bright Reverent Splendor Heaven, Radiant Bright Ancestral Fluttering Heaven, Bamboo Grove August Reed Heaven, Void Bright Hall Radiance Heaven, Observing Bright Upright Stillness Heaven, Primordial Bright Reverent Celebration Heaven, Great Resplendent Ultimate Jade Heaven.\n\n**The Eight Heavens of the West (Seven Qi of the White Heavens, beginning from the south and proceeding north):**\nPrimordial Bearing Aperture Ascension Heaven, Great Peace August Cliff Heaven, Manifest Stability Ultimate Wind Heaven, Beginning August Filial Awn Heaven, Great Yellow Converging Weight Heaven, No-Thought River Origin Heaven, Upper Gambling Joy Heaven, Limitless Vow Oath Heaven.\n\n**The Eight Heavens of the North (Five Qi of the Black Mysterious Heavens, beginning from the west and proceeding east):**\nLuminous Court Rosy Crossing Heaven, Abyssal Penetrating Primordial Cavern Heaven, Brush Adorned Wondrous Completion Heaven, Elegant Joy Forbidden Upper Heaven, Peerless Constant Fusion Heaven, Jade Dragon Ascending Victory Heaven, Dragon Transformation Brahmā Crossing Heaven, Level Nurturing Excellence Heaven.\n\n**Method for Inwardly Intending the Inner Sounds of the Heavens**\n\n**Eastern Danlou Sixty-Four Character Visualization Method:**\nKnock the teeth nine times, visualize nine-colored dragons guiding before and behind, with nine layers of azure clouds enveloping the body. Recite the incantation:\n*\"Vermilion Brightness unfolds the chart,\nEight qi return to the true.\nGoverning the primordial pass,\nAzure Emperor, great spirit.\nFlowing transformations beyond the nine,\nEntwining my body.\nSpiritual sounds of eight writings,\nSixty-four chapters.\nIlluminating heaven and earth,\nUniting with me in immortality.\nConveying the dragon chariot,\nAscending to the imperial axle.\"*\n\nUpon completion, draw qi and swallow nine times. After nine years of practice, the eight heavens each send eight azure-waisted jade maidens and eight azure-flower jade lads to attend the body, bestowing the essence of azure teeth, generating bodily radiance that penetrates the void. After ten thousand recitations, the Dao is accomplished, enabling flight. Seven ancestors share this fortune and ascend to the Southern Palace.\n\n**Southern Nanyan Sixty-Four Character Visualization Method:**\nKnock the teeth three times, visualize vermilion phoenixes and phoenixes soaring before you, with three layers of crimson clouds enveloping the body. Silently recite the incantation:\n*\"Three qi meander,\nSpiritual phoenixes come flying.\nJade sounds of eight characters,\nResplendent in the Purple Tenuity.\nAuspicious day, great celebration,\nMy Dao opens wide.\nVermilion cinnabar feeds,\nGazing upward to absorb the spiritual radiance.\nBody generates water and fire,\nCrimson-clad in feathered robes.\nAscending the void, stepping in flight,\nFeet tread the phoenix ladder.\nCirculating through the eight heavens,\nSeven ancestors follow.\nUpon completion, draw qi and swallow three times. After three years of practice, the eight heavens each send eight great cinnabar jade maidens and eight great yang jade lads to attend the body, descending the essence of the three vermilion cinnabar qi. Complexion reverses to youth, enduring ten thousand kalpas without decline. Seven ancestors transcend and ascend, entering the Hall of Fortune, returning to the womb of royal lineage to be reborn.\n\n**Western Daoli Sixty-Four Character Visualization Method:**\nKnock the teeth seven times, visualize white tigers and lions guiding left and right, with seven layers of white clouds enveloping the body. Silently recite the incantation:\n*\"Seven qi of golden numen,\nEight heavens’ honored spirits.\nWhite tigers draw the carriage,\nLions bear the axle.\nSeven qi entwine,\nRefining me into immortality.\nBody ascends golden light,\nShining upon white clouds.\nInner and outer transformations,\nAscending into the cavern gate.\nSeven ancestors emerge from night,\nNine dark realms’ souls return.\nEons of deliverance,\nAbiding with the turning of the Dao.\"*\n\nUpon completion, draw qi and swallow seven times. After seven years of practice, the eight heavens each send eight white numinous jade lads to attend the body, descending the essence of the seven great white qi. Age halts, countenance remains youthful for ten thousand kalpas. Blessings extend to seven ancestors, who ascend to the Southern Palace, returning to the womb to be reborn in royal lineage, generation after generation.",
      "overlap_context": "Sound**: The sage expounds without words, yet the exposition is inexhaustible; resonates without sound, yet the resonance is unending. It enables understanding across kalpas and enlightenment among gods and humans. Thus, it is called the *hidden speech of Great Brahmā*, the *limitless sound*, or the *sound within heaven*—this is the fifth, the limitless sound.\n\nThis briefly outlines its general meaning.\n\n*(From the* Preface to the Ten Scriptures of the Cavern of Mystery and Numinous Treasure*.)*",
      "start_char": 1090,
      "end_char": 2416,
      "start_sentence": 42,
      "end_sentence": 105,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.53176832199097,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\洞玄灵宝无量度人经诀音义.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "北玃无六十四字存念法，叩齿五通，思飞龙羽盖蓊郁左右，黑云五重覆匝身形，神童玉女羽衣飞裳，侍卫前后，密咒曰： 元天徘徊，流景上清。 大有启运，八字高明。 飞元澄空，洞阴自生。 五炁缠绵，灌我身形。 冠带北单，受炼洞灵。 肾府北出，内外光精。 飞行三界，游宴紫庭。 七祖同庆，欢乐劫龄。 七宝林中，反胎更生。 长夜出离，南宫记名。 黄箓白简，世世生仙。 咒毕，引炁五咽止。 行之五年，八天各以太元玉童各八人，侍卫身形，降致灵滋五炁之精，还年留景，保命三清，庆及七祖，世世生仙。 右出灵宝玉字经。 凡持此度人经，六度存念祝诵法具件如前。 音义 道古 太上道君为此经序，故皆云道言也。",
      "translated_text": "The Northern Jue’s Sixty-Four Character Method of Mindful Recitation:\nStrike the teeth five times, envision soaring dragons with feathered canopies lush and dense on left and right, five layers of black clouds enveloping the body. Divine lads and jade maidens in feathered robes and flying garments attend before and behind. Recite the esoteric incantation:\n\n*\"Primordial Heaven lingers,\nFlowing radiance ascends to Supreme Clarity.\nGreat Possession initiates the turning,\nEight characters rise in luminous height.\nFlying essence stills the void,\nCavernous yin spontaneously arises.\nFive qi entwine,\nIrrigating my form.\nCrowned and girded at Northern Solitude,\nReceiving refinement from cavernous numina.\nKidney palace emerges from the north,\nInner and outer gleam with essence.\nSoaring through the Three Realms,\nRoaming and feasting in the Purple Court.\nSeven ancestors rejoice together,\nDelighting in kalpas of age.\nWithin the Seven Treasures Grove,\nReturning to the womb to be reborn.\nEmerging from eternal night,\nNames recorded in the Southern Palace.\nYellow registers and white tablets,\nGeneration after generation born as immortals.\"*\n\nUpon completion, draw qi and swallow five times. After five years of practice, the eight heavens each send eight lads of Grand Primordial Jade to attend the body, descending the essence of the five numinous qi. Years reverse, countenance remains youthful, life preserved in the Three Clarities. Blessings extend to seven ancestors, generation after generation born as immortals.\n\nFrom the *Scripture of Numinous Jade Characters of the Numinous Treasure*. For all who uphold this scripture of deliverance, the methods of Six Perfections’ mindful recitation and invocation are as set forth above.\n\n**Glossary Notes:**\n*Dao* speaks—\nThe Most High Dao Lord composed the preface to this scripture, hence all is termed *Dao*-utterance.",
      "overlap_context": " return.\nEons of deliverance,\nAbiding with the turning of the Dao.\"*\n\nUpon completion, draw qi and swallow seven times. After seven years of practice, the eight heavens each send eight white numinous jade lads to attend the body, descending the essence of the seven great white qi. Age halts, countenance remains youthful for ten thousand kalpas. Blessings extend to seven ancestors, who ascend to the Southern Palace, returning to the womb to be reborn in royal lineage, generation after generation.",
      "start_char": 2417,
      "end_char": 2708,
      "start_sentence": 106,
      "end_sentence": 123,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.933510065078735,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\洞玄灵宝无量度人经诀音义.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "始青天中 东北之天是也。 浮黎 土音杜。 量 良去。 无鞅 於仰切，天围限也。 郁勃 如字。 喑 音因，疾不言，阴之谓也。 跛 博我切，足疾也。 痾 音久，疾阿也。 痼 音沈，困久故远之貌。 返 府远切。 勃勃 音拂。 廓散 思干切。 监度 上音缄。 粗悉 祖沽切。 倏 音叔。 欻 许物切。 中伤 中去。 憎 子能切。 @ 音忌。 经始出教 或云元始出教，误也。 藏 似郎切。 璇机 上旋下机，北斗魁四星是也。 不行 音衡。 尸 或作尸死。 丧 息依切。 威未制天 句绝。 亿曾 音憎。 上 常去。 尸解 肯托形隐化，内贾身成仙也。 长役 营只切。 断地 徒管切。 长为 干伪切。 为帝王 音正月位同。 蓊冥 乌孔切。 使者 师事切。 大梵 日月之上八天也。 眇眇劫刃 眇茫也。 三华 平声。 离便 方便之便。 森 所岑切。 净霐 音泓。 大行 音衡。 度厄 音厄。 骖 音参。 监真音缄。 应度 音响。 郁褴 音蓝。 恬懀 上音甜，下乌外切。 皇笳 音加。 宛黎 上於远切，下力低切。 阮乐 音岳。 勃悖 音沛。 昙 音潭。 秀乐 音洛。 总监 音鉴。 行元 下孟切。 今日欣庆受度 句。 担石 多甘切。 鼓从 词用切。 游观 音贯。 咸听 音汀。 涬 胡顶切。 使天 音史。 一十五分 扶问切。 上闻诸天 或云关字，误也。 斩馘 古伯切，去耳之刑。 乐兮 音洛； 下同。 过之 古卧切。 别真 彼月切。 懈退 古隘切。 云嶒 音层。 易邪 以致切。 不乐 五教切。 得过 音戈。 旧格 或云其格，误也。 否终 音彼。 炰 音休，盛大貌。 凡有此灾同气 句。 为 音位。 毫分 符问切。 亶丹上。 荟　乌外切。 和　胡外切。 观音　音贯。 回跖　音只。 南爓　音艳。 诜诜　严公注云洗洗。 推前　音吹。 凙洛　上铎下郝。 缘邅　陟连切。 萧嵎　音愚。 易邈音亦。 攫　居缚切。 东覆　方茂切。 总监　音鉴。 不辟　音壁。 大量玄玄　云元量者，误也。 此经太上大道君受之於元始天尊，传教於世。 道君为前序、后序、中序，凡有三序焉。 前序自道言昔於至东向诵经是也，中序自三界之歌章之后，此二章并是至洞明至言也是也。 后序自此诸天中至大量玄玄也是也。 经有二章，自元始洞玄至列言上清，且后章自元洞玉历讫祸及七祖翁是也。 其大梵隐语非其二章之数，或以经为章，隐为二章，此亦误矣。 中序云：诵经万徧，乃能得道。 洞明至言，此则隐语玄奥，不在经文二章之列可知矣。 读诵之士，当心信无疑，功满道备，自当洞晓，人天同福，存殁沾恩，可不志哉，可不勉哉。 玄门灵验记、道门集验记，持此经得验记，皆有传载，通真之士，勤而行之。 洞玄灵宝无量度人经诀音义竟",
      "translated_text": "At the Azure Heavens’ Center—this is the Heaven of the Northeast. *Fuli*: in local pronunciation, *Du*. *Liang*: pronounced *liang* (去声). *Wu yang*: read *yǎng* (於仰切), denoting the bounds of heaven’s enclosure. *Yubo*: as written. *Yin*: read *yīn* (音因), signifying muteness, an ailment of speech; also refers to yin. *Bo*: read *bǒ* (博我切), a foot ailment. *Ē*: read *jiǔ* (音久), a chronic illness. *Gù*: read *shěn* (音沈), the appearance of long-entrenched affliction. *Fǎn*: read *fǔ* (府远切). *Bóbó*: read *fú* (音拂). *Kuòsàn*: read *sìgān* (思干切). *Jiāndù*: *jiān* (上音缄). *Cūxī*: read *zǔgū* (祖沽切). *Shū*: read *shū* (音叔). *Xū*: read *xū* (许物切). *Zhòngshāng*: *zhòng* (中去). *Zēng*: read *zǐnéng* (子能切). *@*: read *jì* (音忌). *Jingshǐ chū jiào*: Some say *Yuánshǐ chū jiào* (\"Primordial Beginning issued the teaching\"), which is incorrect. *Cáng*: read *sìláng* (似郎切). *Xuánjī*: *xuán* (上旋) and *jī* (下机), referring to the four stars of the Dipper’s bowl. *Bùxíng*: read *héng* (音衡). *Shī*: sometimes written as *shī sǐ* (\"corpse-death\"). *Sāng*: read *xīyī* (息依切). *Wēi wèi zhì tiān*: phrase ends here. *Yì céng*: read *zēng* (音憎). *Shàng*: read *cháng* (常去). *Shījiě*: the state of discarding the body to conceal transformation, whereby the inner self departs and the physical form attains immortality. *Cháng yì*: read *yíngzhī* (营只切). *Duàn dì*: read *túguǎn* (徒管切). *Cháng wéi*: read *gānwěi* (干伪切). *Wéi dìwáng*: read as *zhēngyuè wèi* (正月位), same as the imperial throne. *Wěngmíng*: read *wūkǒng* (乌孔切). *Shǐzhě*: read *shīshì* (师事切). *Dàfàn*: the eight heavens above the sun and moon. *Miǎomiǎo jiérèn*: *miǎo* as in *miǎománg* (\"vast and indistinct\"). *Sānhuá*: level tone. *Líbiàn*: *biàn* as in *fāngbiàn* (\"expedient\"). *Sēn*: read *suǒcén* (所岑切). *Jìnghóng*: read *hóng* (音泓). *Dàxíng*: read *héng* (音衡). *Dù’è*: read *è* (音厄). *Cān*: read *cān* (音参). *Jiānzhēn*: read *jiān* (音缄). *Yìngdù*: read *xiǎng* (音响). *Yùlán*: read *lán* (音蓝). *Tiánhuài*: *tián* (上音甜), *huài* (下乌外切). *Huángjiā*: read *jiā* (音加). *Wǎnlí*: *wǎn* (上於远切), *lí* (下力低切). *Ruǎnlè*: read *yuè* (音岳). *Bóbèi*: read *pèi* (音沛). *Tán*: read *tán* (音潭). *Xiùlè*: read *luò* (音洛). *Zǒngjiān*: read *jiàn* (音鉴). *Xíngyuán*: *yuán* (下孟切). *Jīnrì xīnqìng shòudù*: phrase ends here. *Dànshí*: read *duōgān* (多甘切). *Gǔcóng*: read *cíyòng* (词用切). *Yóuguān*: read *guàn* (音贯). *Xián tīng*: read *tīng* (音汀). *Xìng*: read *húdǐng* (胡顶切). *Shǐ tiān*: read *shǐ* (音史). *Yīshíwǔ fēn*: read *fúwèn* (扶问切). *Shàng wén zhūtiān*: Some say *guān* (\"gate\"), which is incorrect. *Zhǎnguó*: read *gǔbó* (古伯切), the punishment of severing ears. *Lè xī*: read *luò* (音洛); same below. *Guò zhī*: read *gǔwò* (古卧切). *Bié zhēn*: read *bǐyuè* (彼月切). *Xiètùi*: read *gǔ’ài* (古隘切). *Yúncéng*: read *céng* (音层). *Yì xié*: read *yǐzhì* (以致切). *Bù lè*: read *wǔjiào* (五教切). *Dé guò*: read *gē* (音戈). *Jiù gé*: Some say *qí gé* (\"its standard\"), which is incorrect. *Pǐ zhōng*: read *bǐ* (音彼). *Páo*: read *xiū* (音休), denoting grandeur. *Fán yǒu cǐ zāi tóng qì*: phrase ends here. *Wéi*: read *wèi* (音位). *Háofēn*: read *fúwèn* (符问切). *Dǎn*: read *dān* (丹上). *Huì*: read *wài* (乌外切). *Hé*: read *wài* (胡外切). *Guānyīn*: read *guàn* (音贯). *Huí zhí*: read *zhǐ* (音只). *Nán yàn*: read *yàn* (音艳). *Shēnshēn*: Yan Gong’s annotation reads *xǐxǐ* (\"pure and clear\"). *Tuī qián*: read *chuī* (音吹). *Duò luò*: *duò* (上铎), *luò* (下郝). *Yuán zhān*: read *zhīlián* (陟连切). *Xiāo yú*: read *yú* (音愚). *Yì miǎo*: read *yì* (音亦). *Jué*: read *jūfù* (居缚切). *Dōng fù*: read *fāngmào* (方茂切). *Zǒngjiān*: read *jiàn* (音鉴). *Bù bì*: read *bì* (音壁). *Dà liàng xuán xuán*: Some say *yuán liàng* (\"original measure\"), which is incorrect.\n\nThis scripture was received by the Most High Lord of the Dao from the Primordial Celestial Worthy and transmitted to the world. The Lord of the Dao composed three prefaces: the first, the middle, and the last. The first preface begins with *Dao* speaks of the past... and ends with facing east to recite the scripture. The middle preface follows the *Song of the Three Realms* and includes these two chapters, which together constitute the *Profound and Luminous Utmost Words*. The last preface begins with *Among the heavens...* and concludes with *Great Measure, Profound and Mysterious*.\n\nThe scripture contains two chapters: the first from *Primordial Mysterious* to *Proclaiming the Upper Clarity*, and the latter from *Primordial Jade Calendar* to *Disasters befalling the seven ancestors*. The esoteric incantations of the Great Brahmā are not counted among these two chapters. Some mistakenly treat the scripture as one chapter and the esoteric verses as two, which is also incorrect. The middle preface states: *Reciting the scripture ten thousand times enables one to attain the Dao*. The *Profound and Luminous Utmost Words* are thus esoteric and abstruse, not part of the two chapters of the scripture proper.\n\nThose who recite this text must believe wholeheartedly without doubt. When merit is complete and the Dao perfected, profound understanding will naturally arise. Both humans and celestials share in the blessings, and the living and the deceased alike receive grace. How can one not be resolute? How can one not strive?\n\nThe *Records of Mysterious Verifications of the Daoist Gate* and the *Collected Verifications of the Daoist Gate* contain accounts of those who attained verification through upholding this scripture, all of which have been transmitted. Those who seek communion with the true should diligently practice this.\n\nThe *Pronunciation and Meaning of the Precepts of the Numinous Treasure Scripture of Limitless Salvation* concludes here.",
      "overlap_context": "ntenance remains youthful, life preserved in the Three Clarities. Blessings extend to seven ancestors, generation after generation born as immortals.\n\nFrom the *Scripture of Numinous Jade Characters of the Numinous Treasure*. For all who uphold this scripture of deliverance, the methods of Six Perfections’ mindful recitation and invocation are as set forth above.\n\n**Glossary Notes:**\n*Dao* speaks—\nThe Most High Dao Lord composed the preface to this scripture, hence all is termed *Dao*-utterance.",
      "start_char": 2708,
      "end_char": 3749,
      "start_sentence": 124,
      "end_sentence": 232,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.16416525840759,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\洞玄灵宝无量度人经诀音义.txt",
        "category": "玉诀类"
      }
    }
  ]
}