{
  "source_id": "洞真太一帝君丹隐书洞真玄经",
  "source_file": "chunked_daozang\\洞真太一帝君丹隐书洞真玄经.json",
  "total_chunks": 16,
  "total_original_chars": 17359,
  "total_translated_chars": 102410,
  "total_translation_time": 508.4285535812378,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\洞真太一帝君丹隐书洞真玄经.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "*The Great Concealed Scripture of the Cavern of Perfection: The Supreme One Sovereign Lord’s Esoteric Book of the Great Cinnabar*\n\nAlso titled *The Vast Chapters of the Three Primes*\n\nWhen the Lady of the Purple Tenuity first received this scripture, she began with this invocation:\n\nCrimson radiance drifts in the mystic dawn,\nPurple chariots ride the cloud-borne journey.\nGazing upward, I transcend the Golden Gates within;\nLooking down, I survey the Western Flower City.\nEastern auroras unfurl their fivefold brilliance,\nDivine essence kindles the seven numina.\nVeiled reflections trace the Three Torches,\nFlowing freely, they align with darkness profound.\nWinds stir the hollow vastness of the cosmos,\nIncense smoke scatters through the Jade Court.\nHand in hand with the Weaving Maiden, I dance,\nTwin sashes flutter in brocade hues of blue.\nTo the left, patterned banners of feathered script swirl;\nCanopies of blossoms tilt with the drifting clouds.\nBeyond the ninefold courts, I recline in banquet ease,\nRight and wrong no longer occupy my mind.\nEmbracing emptiness within the Mud-Pill,\nMy celestial form cradles the sun’s embrace—\nHow could it compare to the filth of the mundane,\nWhere life drags on, joyless and bleak?\n\nVerdant peaks of Fusang rise in the void,\nCrimson spirits bloom with faintest light.\nAbove the night’s hush of the Azure Terrace,\nFour vistas mirror the lofty clarity.\nFlying effulgences rein the purple wheel,\nThreefold purity guides the cinnabar carriage.\nI repose in the Supreme Lord’s palace,\nWandering the courts of the Celestial Matriarch.\nBathed in the jade-green ripples of the swift stream,\nI raise the jade ewer of sweet nectar.\nAt dawn’s curve, borne on the wind’s fan,\nJewelled gales descend in timely cascades.\nA fleeting sojourn in the mists of Ruin,\nThen turning my chariot, I drift through steadfast purity.\nMystic gatherings convene of their own accord,\nWandering at will through the dark unknown.\nOnly now do I know the bitterness of glory and shame,\nOnly now do I awaken to the sorrow of fleeting years.\nIn the secluded chamber, purity may be attained;\nNurturing the true awaits the sun’s fulfillment.\nWhy trouble oneself with the paths of the world?\nA hundred afflictions arise from this very course.\n\nThe Lady of the Purple Tenuity is surnamed Wang, her personal name Qing’e, and her courtesy name Yuyin—she is the twenty-fourth daughter of the Queen Mother of the West. The Palace of the Purple Tenuity lies beyond the Northern Ocean in the Featherbright Wilderness upon the Dark Mound Mountain, which stands northeast of Mount Kunlun.\n\nThe Lady of the Purple Tenuity addressed the Celestial Matriarch, saying: \"Those who wish to ingest and absorb the qi of the sun and moon must first comprehend the images and manifestations of sun and moon. The sun is round in form yet square in its radiance; the moon is square in essence yet round in its manifestation. Radiance is concealed within form, essence hidden within image—radiance is crimson, image is yellow: these are the hun-souls of sun and moon. Only when one knows this Dao may one exhale and inhale the flowing rosy clouds.\n\nThe method for absorbing solar qi is practiced at dawn; the gathering of lunar essence is done at midnight. Visualize them nine inches before your face, allowing their light and image to illuminate your Mud-Pill Palace, descending to the Five Viscera, penetrating your entire form. Draw the qi into your mouth until its radiance and color become resplendent and bright; after a long while, the practice is complete. By this means, one may attain longevity.\"\n\nThe foregoing was recounted by the Lady of the Right Central Marquis regarding the Lady of the Purple Tenuity’s personal and courtesy names.\n\n*The Supreme Lord’s Grand Cinnabar Hidden Book of the Cavern-Real Mystery*, this precious scripture is stored within the Purple Chamber of the Six Harmonies of the Most High, presided over by the Primordial Lord of the Southern Culmen—hence it is called *The Grand Cinnabar Hidden Book*. This text is also known as *The Seven Transformations and Nine Forms of the Imperial Lord*, *The Three Degrees, Five Essences, and Imperial Treasure of the Supreme One*, and *The Imperial One’s Fusion of the Three and Five to Establish Completion*. Each corresponds to the four seasons as a treasure, and thus they are collectively called *The Scripture of the Supreme One*.\n\nShould you possess this text, you shall not die; should you revere it, you shall attain longevity; should you visualize it, you shall become a divine immortal; should you diligently practice it, you shall become a perfected spirit. The Supreme One, born of the Void, is the Lord of the Supreme Mystery, who commanded the Perfected of the Great Ultimate to dispatch nine Jade Maidens of Jade Flower and seven Golden Flower Lads of Dawn to attend and guard *The Scripture of the Cavern-Real Mystery*, to protect the bodies of those who possess it and to succor the souls of those who bear its talismans. The Jade Lads and Maidens record all transgressions and blessings, speaking of the merits of those who cherish and cultivate it.\n\nIf you possess this scripture, you must establish a secluded chamber, keeping your dwelling undefiled. Ensure its circulation and communion with the unseen, awaiting the arrival of the true qi. Frequently burn incense to your left and right, bathe regularly, and silently visualize the spirits—let no one become aware of it.\n\nThe Perfected of the Great Ultimate recorded in the three spring months: *The Supreme Lord’s Grand Cinnabar Hidden Book of the Cavern-Real Mystery*; in the three summer months: *The Seven Transformations and Nine Forms of the Imperial Lord*; in the three autumn months: *The Three Degrees, Five Essences, and Imperial Treasure of the Supreme One*; in the three winter months: *The Imperial One’s Fusion of the Three and Five to Establish Completion*. Thus, its names vary with the four seasons, perpetually arising in accordance with the nodes—this is what is meant by \"the fusion of ten thousand transformations, not abiding in a single name.\" Such is the scripture of the supreme Dao, by which one attains the perfected spirits.\n\nTo study the Dao without the Supreme One is like gazing without two eyes; to visualize without the Supreme One is like a chest and abdomen devoid of the Five Viscera; to govern spirits without the Supreme One is like rising and walking without four limbs; to establish oneself without the Supreme One is like a corpse lying stiff without qi. It is for this reason that this scripture opens the pathways of the ten thousand spirits, generates and completes the soul and essence, and across a thousand roads and hundred paths, the Supreme One stands as the singular foundation. Without a teacher, one’s study is but vain toil.\n\nNow, I have once more compiled the currents of this scripture, excerpting its outer boundaries. Though the profound and wondrous have not been fully expounded, nor the secret invocations entirely encompassed, it is named *The Supreme One’s Separate Instructions*. Should one be able to follow it, it will awaken the beginner to the subtleties of the end, instantly revealing the deep source.\n\nThus, these separate instructions circulate subtly among scholars, guiding them from coarse traces to jade-like enlightenment. As for the inner construction of the profound and mysterious, the convergence of myriad marvelous streams, the flowing communion of true spirits, the fusion of the numinous palace—brilliant and dazzling in the transformations of divine radiance, shining beyond the bounds of creation, resplendent as the full orb of light, still as the Great Void—when clouds arise in empty vastness and thoughts congeal, a thousand years pass like a single night, it may be called subtle indeed and profound! The Supreme One’s love is entirely expounded in this scripture; its affairs are wholly contained within the *Cavern Mystery*.\n\nThe Lady is born of the celestial hun-soul, formed from the primordial spirit. Revolving through the nine qi, she is endowed with the mandate of the Supreme One, opening the three pathways, accumulating spirit in the hidden palace. Thus, the seven coils of dark fluid flow forth with effulgent moisture; sun and moon illuminate her six voids; mouth and eyes move her divine instruments. Clouds drift and rain descends—her virtue emulates Heaven and Earth. Within the inner womb, the five factors come together, establishing the Dao of humanity as such.\n\nThe five factors are the five spirits; the three pathways are the three perfected. The five spirits are the hun-souls of Heaven; the three perfected are the Dao of Heaven; the nine qi are the embryo of Heaven; the Supreme One is the source of Heaven; sun and moon are the eyes of Heaven; dark fluid is the moisture of Heaven; the six voids are the light of Heaven; the hidden palace is the treasury of Heaven; the divine instruments are the transformations of Heaven; the primordial spirit is the metamorphosis of the Emperor.\n\nWhen it speaks of the nine qi, it refers to the Supreme Lord’s fusion of transformations—transforming and becoming nine, these are called the nine palaces. Fusion and transformation return to oneness.\n\nIf you, the aspirant, wish to cultivate yourself and seek life, you must follow the origin from which you were born. That origin is your primordial father and mysterious mother. The primordial father governs qi, transforming and ordering the imperial predecessor; the mysterious mother governs essence, changing and knitting the womb. Essence and qi complete each other, like yin and yang generating one another. Clouds move and you are born—when the Dao harmonizes, it is nameless. The numbers arise from the three and five; you begin to receive form. When seven and nine have fully revolved, your body is complete. Harmonizing the three and five, seven and nine penetrate the unseen. Before the image of the Emperor, one must await the Emperor’s cultivation. The work of the Heavenly Sovereign—nine transformations become spirit. When the work is complete, body and spirit unite. When spirit departs, death follows; when spirit abides, life endures.\n\nThus, the Three Origins are the beginning of the Dao; the Imperial Lord is the root of the Dao; the Supreme One is the transformation of the Dao; the Nine Heavens are the spirits of the Dao; the Nine Palaces are the dwelling of the Dao; the Dark Field is the garden of the Dao; the dark fluid is the essence of the Dao.\n\nAfter three years of cultivation, one may illuminate the Three Fields in the mirror, thereby attaining divine transcendence. By morning, one roams the Six Directions; by evening, one guards the Mud-Pill Palace, firmly holding the embryonic essence while the heart remains ever joyful.\n\nLater disciples must take this as their foundation. Only those who encounter this scripture may begin to speak of the Ninefold Black Refinement and the Celestial Sovereign’s circulation of spirit. Since you have been born as a human—though humans are many—without the Celestial Sovereign’s spirit-tally, the Three Origins’ golden register, the Controller of Destiny’s hidden talisman, or the Five Elders’ purple records, though born of Heaven’s qi, you will never hear or see the supreme Dao.\n\nEven if you lack the Dark Palace’s purple writ, the Supreme Sovereign’s precious name, the Celestial Sovereign’s jade register, the Eastern Florescence’s hidden chart, the Three Origins’ spirit inscription, or the Supreme Thearch’s tripartite soul, though you may briefly hear the supreme Dao by virtue of Heaven’s nature, you will be unable to cultivate it. Even if you could, you would not persist; even if you persisted, you would not be steadfast; even if steadfast, you would not be single-minded; even if single-minded, you would not attain thorough penetration. At best, you might conceal yourself among the Five Peaks or tread the path of enduring life, yet you would not ascend through the Eight Radiant Realms, riding mist and harnessing light, soaring on empty wings, leaping into the Great Void.\n\nWithout the Jade Terrace’s feathered writ, the Flowing Cloud’s Five Standards, the Celestial Sovereign’s Golden Pavilion, the Five Sovereigns’ hidden register, the Later Sage’s Seven Talismans in the Stone Casket of Hollow Mountain, the Cinnabar Terrace’s plain chapters, the Mysterious Yellow’s Five Phases and the Heavenly Mother’s Embracing Chart, the Supreme Lord’s circular name and the Register of Preserving the True and Refining Qi to Temper the Spirit-Ninefold—none may behold the *Scripture of the Cavern of Perfection*, witness the transformations of the Imperial Unity, hear the chants of the Demon-Quelling Divine Tiger’s Wisdom, the *Hidden Writ of the Supreme Lord’s Eight Simplicities*, or the *Thirty-Nine Chapters of the Scripture of the Cavern of Perfection*, the Golden Perfection and Jade Radiance of the Seven Origins’ Liberation.\n\nThe scriptures of the supreme Dao lie in profound obscurity. Only through diligent mindfulness and concentrated meditation may the numinous be activated and the spirit subtly stirred. When the Nine Spirits gather and the Celestial Sovereign’s tally is revealed, one may then hear the gate of mysterious subtlety, the root-source of life. How profound and wondrous—how could one not exert oneself?\n\nConcentrate on the Celestial Sovereign, merging with the Primordial Emperor. The male and female spirits guard the gods, irrigating and flowing with the vast purity. Always ensure the Nine Heavens’ qi flows smoothly, so that the One unites with the Nine to achieve completion.\n\nThe essential teaching of the *Cavern of Perfection* is this: the body remains eternally preserved, vital fluids and blood generate spontaneously, the male spirit guards the Gate of Life, the female spirit protects the Chamber of Spirit, and the Celestial Sovereign never departs, enduring coeval with Heaven. Thus, the *Hidden Talisman of the Supreme Lord* states: \"Preserve the male, guard the female—then even Heaven and Earth cannot surpass you.\"\n\nOnce this is cultivated, the Five Spirits guard their abodes, the Five Viscera flourish with blossoms, the numinous dwells in the Crimson Palace, the Emperor resides in the Mud-Pill, the hundred spirits become firm, and the embryonic seal closes the Gate of Life. Over time, the Three Ones’ spirits appear by night, and the Celestial Sovereign and Primordial Emperor descend at dawn, both manifesting in your chamber.\n\nYou must maintain purity and fasting, sever all external affairs, block the paths of deviance, moderate all interactions, and rarely engage in frivolous pursuits. Focus your mind single-pointedly, cultivate the Dao morning and evening without fail, bathe in the five fragrances, and seclude yourself in a quiet room. Burn incense to your left and right, awaiting the arrival of true qi.\n\nThe Way of the Celestial Sovereign particularly abhors the sight of blood, the stench of foul odors, and the pollution of impurities. If tears fall, the Imperial Lord grieves and is disturbed; if wailing issues from the mouth, the Celestial Sovereign congeals. When the Celestial Sovereign congeals, the Nine Qi cease their transformations, and the Three Ones grieve without gathering. If the Nine Qi do not transform, the Three Ones also congeal. As stagnation accumulates day by day, the generative qi leaks out, and the old qi circulates inward. When the old qi circulates inward, it marks the onset of illness and death.\n\nThus, the Perfected call the sound of wailing the voice of death and extinction, and tears the fluid that leaks essence. How could one not cautiously avoid them? If you encounter a corpse or prolonged mourning, the Imperial Lord incurs guilt and is demoted by the Supreme Lord, while the Celestial Sovereign faces punishment and is reprimanded in the Mysterious Void. Before three years have passed, you will surely perish.\n\nThose who do not receive the Supreme Lord’s Dao cannot be counted among the disciples. Therefore, the deepest taboos are grief, wailing, impurities, sorrow, and tears—these disrupt the Celestial Sovereign and Imperial Lord’s refined concentration. Furthermore, one must not come into contact with corpses. After receiving this scripture, if you see forty-nine corpses, you will not attain longevity but will perish midway. If you see twenty-four corpses, you will temporarily pass through the Great Yin before reviving as an immortal.\n\nFor the form of a corpse, once glimpsed by the eyes, the embryonic ghost of the dead lingers in one’s thoughts. What the mind dwells upon is recorded in the Crimson Palace; what the Crimson Palace remembers, though forgotten, remains. Gradually, it manifests in the body, blocking the eyes that record thoughts. Be most cautious of this.\n\nThe sight of blood, corpses, funerals, impurities, wailing, and tears—these are the Celestial Sovereign’s deepest taboos. If you consistently maintain purity and fasting, your concentrated thoughts will readily resonate, your spirit will swiftly unite, the Celestial Sovereign will guard your life, and joy will merge with harmony. Practicing this for eighteen years, you will ascend to Heaven in broad daylight. This is the Perfected One’s path of reversing old age and returning to infancy.\n\nYou should regularly bathe in the five fragrances. The five fragrances are the greenwood incense. Its flowers and leaves have five nodes, five by five interlocking—hence it is called the five-fragrance herb. It repels evil qi, restrains hun and po souls, subdues demonic vapors, and induces numinous manifestations. Because of its five-by-five nodes, it benefits humanity.\n\nThis herb grows abundantly east of the Canglang River, so the divine beings of the East call it the greenwood incense. It is also said: burning greenwood incense, frankincense, and benzoin between the head of your bed and your sleeping place dispels the five turbid visions, halts the demonic qi of the earthly realm, and rises straight up to pierce the sky for forty miles. The smoke of this incense shatters the qi of turbid visions and clears the mists of deviant impurities. Thus, the Heavenly People, Jade Maidens, Celestial Sovereign, and Imperial Thearch descend within the fragrant qi, resting upon your face and eyes.\n\nAt midnight when burning incense, regularly perform this visualization—do not neglect or forget it.\n\nVisualize the Three Ones, guard the Great One, refine the Cavern Chamber, and meet the Imperial Lord. Then nine numinous spirits will be transformed within your form, assisting your divine luminosity, perfecting your immortal truth, preserving your longevity, and securing your fetal soul.\n\nThe White Prime, Non-Flourishing, Peach Vigor, Controller of Fate, and Great One—these five spirits merge, bearing registers and arranging talismans. Each of the five spirits governs its domain; their fusion undergoes nine transformations. The Three and Five interpenetrate and evolve, thereby stabilizing the Three Palaces with true essence, infusing the hundred joints with numinosity. The Imperial Lord’s precious register ensures your predestined fate remains unshaken. Circulating through the ethereal smoke, it unlocks the mysterious essence. Suddenly, the twenty-four perfected beings arise: above, they open the Upper Prime; below, they open the Eight Nether-realms; to the left, they summon the Six Jia; to the right, they dispatch the Six Ding. The Jade Splendor draws the sun, the Great One merges with your form. With a thousand chariots and ten thousand riders, your entire being ascends at dawn—ascending to heaven in broad daylight.\n\nThose who cultivate this Way of the Great One all attain ascent to the Three Heavens. Thus it is said: “Ascend at dawn, ascend to heaven in broad daylight.” At the cock’s crow, you ascend into the empty void; by midday, you arrive above the Three Heavens. Midday is the “broad daylight,” the cock’s crow marks the “ascent at dawn.” Therefore, when visualizing the Great One’s fusion, frequently employ the moments of the cock’s crow and the arising of primordial qi.\n\nIf you possess the *Great One’s Cavern-Real Mystery Scripture*, keep it in a separate satchel, seal it in a precious vessel, and place it upon your altar. For every matter, pay homage as if attending the lord and father. For any undertaking or direction, first invoke and bow twice, secretly recite the names of the Nine Lords of the Great One, and state your request. Dream responses will reveal fortune or misfortune. For those whose hearts are truly refined, effects will manifest immediately upon waking.\n\nIf recitation, practice, and contemplation are required, copy a separate version for careful study, while the scripture on the altar remains revered and sacred.\n\nWhen the Three Primes conceal and transform, they form the Three Palaces—named Grand Purity, Grand Simplicity, and Grand Harmony. Three threes make nine, hence the Three Cinnabar Fields and the Three Cavern Chambers. Combined with the Upper Three Primes, they constitute the Nine Palaces. Within the Nine Heavens and Nine Palaces dwell nine spirits, called the Nine Celestial Souls of the Heavenly Sovereign. These transform into nine qi, which become nine spirits, each governing one palace—thus the term “Nine Palaces.”\n\nWithin Grand Purity lie Grand Simplicity and Grand Harmony; within the Cavern Chamber lie the Hall of Light and the Crimson Palace—these are the Six Treasuries. Above is the Heavenly Treasury, below the Terrace of Radiance. The designations of the Three and Five differ in their positions.\n\nFirst: within Grand Purity reside the Three-Five Imperial Lords.\nSecond: the Three-One spirits of the Cinnabar Fields.\nThe Five refer to the spirits of the talismanic registers: the Great One, the Lord’s Son, White Prime, Controller of Fate, and Lord Peach Vigor. Together, they are called the Three-Five, each with its own palace.\n\nWhen the Three Perfected rest securely in their palaces, the Five Spirits ascend to meet the Imperial Lord. To the Imperial Lord’s left stands the Elder of Primordial Old, to his right the Old Lord of the Mysterious One. These, within the boundless, are the so-called Nine Lords. The uppermost is the True One. The Nine Lords are the celestial souls, the naturally perfected children of the Dao, serving as the spirits of the adept.\n\nIf the adept knows how to refine and visualize the Nine Lords, deeply contemplates the Three Perfected, they can embody the adept within the Three-Five, revolving through the seven and nine, ensuring the celestial spirits of the Heavenly Emperor always reside within them. The Five Spirits bear the registers in ceaseless circulation, and the adept will surely ascend in broad daylight—how could mere immortality suffice?\n\nThe Imperial Lord’s fusion revolves through the Three-Five; the Great One’s myriad transformations coalesce into seven nines, their number totaling twenty-four. Heaven possesses twenty-four qi, which evolve above. Through transformation, they become perfected beings. Humans also receive them, hence the body contains twenty-four spirits. Each spirit commands a thousand chariots and ten thousand riders, traversing the eight directions. If you visualize and contemplate this without forgetfulness, you can evade death and seek life, transcend the ten directions, harmonize spirit and qi, commune with heaven, escape the earthly gate, pass through the celestial portal, conceal your breath in the four directions, disperse the Seven Stars, soar through the cloud chambers, plant roots in the sun and moon, guard gold and store jade, command the myriad spirits. What immortal king could you not become? You have already attained perfection.\n\nThis is the Way of concealed visualization, with its scriptural formulas recorded in the *Supreme August’s Utmost Treasure Radiance* chapter. Since you possess it, do not transmit it recklessly. You must swear an oath and scrutinize the recipient before imparting it.\n\nThe Way of the Imperial One is supreme. The seven nines undergo myriad transformations—what is called “one transforming into ten thousand, seven nines returning to one.” The Dao of heaven is not distant; the Three-Five return in cycles. If you know the One’s supremacy, you attain longevity and flight as an immortal. If you know the Three-Five, you traverse the world. Without knowing the One’s supremacy, though alive, you lack roots. Without knowing the Three-Five, your body returns to dust. These words are true.\n\nThe *Scripture of the Great Cavern* states: “Heaven has nine souls—do not fail to distinguish them. The Dao has three perfected ones—do not depart from the body. The Imperial One transforms scenes, myriad changes arrive. Flowing pearls halt their radiance, purple clouds surge in smoke. Seven paths turn back, three luminaries reflect the true. The Supreme’s essence-talismans become kin.” These words are wondrous.\n\nThe *Highest Divine Numinous Empyrean Scripture* also states: “Souls arise from the formless, spread through the Nine Palaces. The Dao emerges from the Three Ultimates, ever roaming the Crimson Palace. The Three Palaces fuse and transform—this is the Purple Chamber. Where the Purple Chamber resides, it first passes through the Hall of Light. If the adept knows this, they may open the Golden Gate.” The Golden Gate lies within the Cavern Chamber.\n\nIt further says: “Merge and unite them, entering and exiting the Imperial Realm. The Three and Five unite as one—you will surely become an immortal king.” This refers to the moment of fusion, the Way of the Three Perfected and Five Spirits.\n\nThe Imperial Realm is the domain of the Grand Clarity.\n\nThus, the *Central Chapter of the Perfect Scripture of the Great Cavern* states: “The Two Elders stand to left and right; the Imperial Soul must not remain undivided. The Three and Nine transform above and below; the Great One establishes its central root. The Five Spirits present my register of life; the Controller of Destiny seals my gate of death. The Nine Palaces merge into one; the Six Harmonies gather the inner truth.” These words describe the differentiation of palaces and the fusion of transformations.\n\nThis Way is the precious practice of the Supreme, the root of long life, the establishment of the human Imperial Ancestor, the origin of the Dao, the immortal lineage of the life-palace, the secret writ of the Imperial Register, the marvel of the Cavern Truth, and the essential scripture of the Nine Palaces.\n\nThe *Central Scripture of the Nine Perfected* says: “The Nine Souls separate and unite; the Three Luminaries share their radiance. The Celestial Sovereign abides in the Primordial; purple mists billow forth. The Five Spirits present the chart; essence and life remain unharmed. Transforming and entering the Nine Palaces, one dons a crimson robe, a tiger-patterned sash, and a cloud-embroidered mantle. The canopy and mantle shimmer with motley hues; the five colors swirl. Sun and moon illuminate and inspect, flanking east and west. The divine court resides within the body, dispelling hunger and thirst. The Three and Five return anew, revolving the hidden mechanism. Circulating through the Great One, they harmonize the Two Modes.” This refers to the Celestial Sovereign dwelling within the Grand Clarity, the Great One receiving nourishment, and the Five Spirits presenting the talismanic register—when the adept visualizes the sun and moon flanking and illuminating.\n\nThis central scripture expounds the names and affairs of the Great One; thus, it is recorded here.\n\nAt the hour when *qi* is born at midnight, or at cockcrow, lie supine with eyes closed and gently inhale. Visualize the sun emerging from the left eye and the moon from the right, each nine inches in diameter, positioned above the ears. The space above the ears is called the High Window of the Six Harmonies. Let the sun and moon illuminate the entire body, penetrating inwardly to the Muddy Pellet, then downward to the five viscera and intestines, perceiving all with clarity, thoroughly illuminating within and without. Let the body merge with the light of the sun and moon. After a long while, click the teeth nine times, swallow saliva nine times, and softly intone:\n\n“Supreme Mysterious One, the Nine Augusts exhale their essence. Three, Five, and Seven transform, penetrating the hidden depths. Sun and moon cast their light, descending to the divine court, flanking and illuminating the Six Harmonies. The Great One abides in yellow tranquility. The Imperial Lord commands the writ; the golden script does not falter. The Five Elders present the talisman; heaven and earth unite in sincerity. Grant that I shall not die, attaining true numinosity. Obstruct the myriad evils; calamities and harms be pacified. Ascend to the Celestial Sovereign, returning to youth from old age. By the decree of the Supreme Emperor, the hundred spirits heed with reverence.”\n\nThen open the eyes. This is called “Refining the Root with Sun and Moon,” “The Three Origins Rectifying the Soul,” by which one governs form and spirit, repels all demonic *qi* that may invade, and ensures long life and immortality. Practice this every night.\n\nFurther visualize the left eye as the sun and the right eye as the moon, merging in the divine court, then ascending into the Hall of Light, where they transform into the yellow essence of nectar, flowing into the mouth. Swallow nine times to nourish the Great One. At the hour when *qi* is born, complete the visualization and softly recite:\n\n“Essence of sun and moon, yellow water and lunar radiance, the Great One comes to drink. Divine light soars high; grant me long life, that heaven and earth share the same bough.”\n\nAfter five days of practice, the tongue becomes the divine court. After visualizing the sun and moon, stir the tongue and perceive a yellow spring, like the color of purple gold, flowing from the tongue and ascending into the Hall of Light—this is the nectar of yellow essence. During visualization, close the eyes and banish all thoughts.\n\nOn the evening of the new moon, at the hour when *qi* is born, lie supine with eyes closed and face upward. Visualize twenty-four stars, each one inch in size, linked together. Within each star, visualize a person, totaling twenty-four, all appearing as newborn infants, unclothed. Then, see the twenty-four stars descending from the empty void of the heavens, encircling the body three times. After three circuits, swallow them one by one, totaling twenty-four swallows, each time perceiving the ingestion of a star. Feel them descend directly into the navel, called the Palace of Life Reception. Further perceive the starlight illuminating the abdomen, thoroughly penetrating the five viscera. Visualize the starlight transforming into twenty-four perfected beings, all exhaling yellow *qi* like mist, filling the navel and suffusing within and without. After a long while, softly intone:\n\n“Twenty-four Perfected, return to the Yellow Court. Mouths exhale yellow *qi*; twenty-four stars irrigate my Gate of Life. The hundred spirits receive numinosity; my bones grow strong. Soul and spirit find peace; the five viscera receive the talisman. Heaven and earth incline toward one another.”\n\nThis is called “True *Qi* Entering to Guard the Gate of Life,” dispelling disasters, misfortunes, and the hundred demonic afflictions, granting long life and immortality.\n\nThe Grand Nonbeing merges to resemble the child of the One Numinous Void, becoming the Lord Imperial Sovereign. Dwelling within the Muddy Pellet as the Imperial Sovereign, it becomes the honored sovereign of the Three Ones. This honored sovereign is the child of the Void-Born. These are called the Three Emperors.\n\nThe Great One receives life in the empty cavern, transforming throughout the eight directions, establishing its radiance among the Three Emperors, flowing and converging at the summit of the myriad spirits. The honor of heaven and earth both depend on the Great One for their spontaneous movement. Without the Great One, the Numinous Emperor’s mysterious void would not revolve *qi*; without the Great One, the Honored Emperor’s Three Ones would not reside in their palatial domains. Thus, the spirit of the Great One, together with the Five Spirits, functions in unison, lodging its form within the Three Emperors. The eminence of the Emperor is like that of the Celestial Sovereign and the Lord Emperor.\n\nThe Nine Souls assume form; souls arise from the Three and Five. The Three and Five unite and converge, coalescing into the Imperial Sovereign. Such is the birth of the Emperor.\n\nReceiving the supreme *qi* from the midst of the Mysterious, where the Three and Five separate and unite, it emerges. Thus, the Emperor is born beyond the Ultimate Nonbeing, within the completion of the Mysterious, manifesting in the domain of the Grand Clarity. Its governance resides in the Purple Tenuity Palace of the Jade Clarity. Radiant with five colors, its canopy has nine layers. Before it lies the Cavern of the Muddy Pellet; behind it opens the Dark Gate. Below, it overlooks the Six Harmonies; above, it connects to the purple clouds. A hundred officials stand guard; flying pavilions interlink. Jade halls and vermilion steps contain golden chambers, within which abides the Supreme Perfected, titled the Celestial Sovereign. Born from the void, dwelling in the midst of the Non-Ultimate, clad in a robe of five-colored pearls, crowned with the Nine-Virtue Dawn Crown, it governs the celestial ridge. At times, it rides a six-reined jade dragon, traversing the nine paths of the void with spontaneous ease.\n\nThis is the essence of spontaneous primordial qi, the Sovereign Lord of all Perfected Ones. Those who constantly contemplate and invoke it may become Immortal Kings.\n\nWithin the Grand Tenuity reside the Three August Ones: the first is the August Lord, the second the Celestial Sovereign, and the third the August Elder. These are all the perfected beings of the Three Origins’ qi, spontaneously coalesced from the primordial chaos. Each of the Three Origins is ruled by one Lord, and together they dwell within the Grand Clarity.\n\nThe Grand Clarity contains three palaces: the supreme is the Palace of the Celestial Emperor Lord; to the left lies the Palace of Grand Simplicity, and to the right the Palace of Grand Harmony. These three palaces are located at the Gate of the Muddy Pellet, within the Non-Ultimate. Thus, the August Lord governs the One, holding fast to the divine刚; the Celestial Sovereign oversees the Two, transforming the luminous and preserving the form; the August Elder supervises the Three, maintaining control over the myriad spirits. The Great One blends and unites them, engendering the adept’s body. Thereupon, the Three and Five divide and transform, filling the Nine Palaces. Thus, the spirit of the Great One is the master of transformative generation.\n\nThe Lord of Grand Simplicity, Yuancheng Laozi, is also the celestial hun-soul, governing within the Grand Clarity and the interior of the Curved Array. He constantly attends the Emperor Lord, presiding over the qi of the primordial origin, and is titled the Lord of Grand Simplicity. The Lord of Grand Harmony, Huangcheng Laozi, is the celestial po-soul, also governing within the Grand Clarity and the interior of the Curved Array. He is titled the Lord of Grand Harmony and constantly attends the Celestial Emperor, presiding over the qi of the embryonic origin.\n\nThe two Lords, Grand Simplicity and Grand Harmony, are the hun and po of Heaven and Earth, born of spontaneity. Yuancheng Laozi, within the Grand Clarity, constantly attends the Emperor Lord; Huangcheng Laozi constantly attends the Celestial Emperor, moving in and out of the Purple Tenuity, residing precisely upon Kunlun, within the Yellow Gate and Purple Chamber. The Great One intermingles with them, the three qi of primordial chaos forming the root of the Great Dao. If you constantly contemplate this, the Emperor will abide with you forever.\n\nOn the second and third nights of the month, at midnight, practice the method of visualizing Yuancheng Huanglao. Lie down, close your eyes, and first envision the Central August Emperor Lord within the Supreme Ultimate. Next, visualize to the left the Elder Yuancheng Laozi, clad in a green robe, wearing the Nine-Splendor Radiance Crown, holding green lingzhi in his left hand and a green banner in his right. Then visualize to the right the Lord of Grand Harmony, Huangcheng Laozi, dressed in a white robe, wearing the Five-Splendor White Crown, holding golden night-essence in his left hand and a white banner in his right, both within the Supreme Ultimate.\n\nWithin the Supreme Ultimate are nine names; within the Grand Clarity are the Five Emperors, Six Treasuries, and Nine Palaces—these domains are one and the same. They are: first, the Grand Clarity; second, the Supreme Ultimate; third, the Grand Tenuity; fourth, the Purple Chamber; fifth, the Dark Terrace; sixth, the Emperor’s Hall; seventh, the Celestial Treasury; eighth, the Yellow Palace; and ninth, the Jade Capital and Dark Metropolis.\n\nIn short, one *cun* directly downward from the nape of the neck lies the Palace of the Supreme Ultimate, which is one *cun* square. The Palace of the Supreme Ultimate is above the Palace of the Six Harmonies. The Palace of the Six Harmonies is where the spirit of the Great One resides. One *cun* inward from the space between the eyebrows is the Hall of Light; two *cun* inward is the Cavern Chamber; three *cun* inward is the Cinnabar Field. North of the Hall of Light and south of the Cavern Chamber, one *cun* above the space between the eyebrows, lies the Palace of the Six Harmonies, which is one *cun* square.\n\nAfter visualizing the Three Perfected Ones, next visualize your own hun-soul, in your own likeness, ascending into the Palace of the Supreme Ultimate. The two Elders then bestow upon you green lingzhi and golden liquid-essence. Proceed to visualize consuming the green lingzhi and drinking the essence. The green lingzhi resembles a lotus blossom, and the liquid-essence resembles fine wine. After consuming them, visualize yourself bowing twice before the Emperor Lord and saying: “Today, I report to the August Lord of the Green Emperor in the court. You have bestowed upon me divine lingzhi and golden liquid jade-essence. The two Elders have transmitted the register; the Great One has presented the writ. May I attain long life and enduring vision, my lifespan without end.”\n\nThen visualize the Emperor Lord replying: “Fortunate one, return on the second and third nights of the next month.” Once this is complete, proceed to ingest the elixir. This is called “receiving the Emperor’s medicine within the Purple Chamber.”\n\nThus, the *Scripture on Dispelling Demons* states: “The hun-soul may seek sustenance, ascending to the Supreme Ultimate. The two Elders confer destiny; this is the power of the Emperor Lord.” This is what it refers to.\n\nWhen visualizing the Supreme Ultimate, always enter through the space between the eyebrows. The space between the eyebrows is the Jade Gate of the Muddy Pellet, called “Guarding the Inch,” the Yellow Gate and Purple Chamber.\n\nOn your natal day, or the first day of the first month, or at noon on any of the six *wu* days, don your cap and sash, enter your chamber, face north, and bow twice. Recite the incantation: “August Emperor Lord, Supreme Jade Dawn, Primordial Elder of August Heaven, Unsurpassed Great Dao, your humble descendant Wang (surname) of Jia (generation name), wishes the Emperor Lord eternal peace within my Purple Chamber Palace.”\n\nAt the hour of *ren ding* (night’s quietude), enter a secluded chamber, lie down properly, close your eyes, and face upward. Visualize the great bright star at the center of the Northern Dipper and the Supreme Ultimate, its essence radiant with pure yellow qi descending. Draw it before you and guide it into your mouth, swallowing thirty-seven times before stopping. Visualize the yellow essence and qi filling your Grand Granary, the Yellow Court, the lower Cinnabar Field, and descending to the Earth Gate of the Yin Chamber, circulating throughout your entire body until all is complete.\n\nThen visualize five persons within the Purple Chamber Palace, suddenly transforming into the Five Emperors. The Celestial Emperor Lord stands at the center. The Great One ascends and kneels before the Emperor, presenting your life register. The Director of Destinies stands behind, removing your death record. Visualize erasing the death record. The death record is a black tablet with white writing; the life record is a white tablet with green writing. Visualize a white jade tablet and a green malachite brush. The Director of Destinies advances and presents this white tablet and green brush to the Emperor Lord. The Emperor Lord faces south and writes: “Wang (surname) of Jia (generation name), from such-and-such prefecture, county, village, and hamlet, born in such-and-such year, shall ascend to the Supreme Mystery, attain all desires, become a Perfected One and an Immortal. All under Heaven who see him shall call him a Perfected One. The Great One may command him, protecting his body, eternally nurturing him with the sun and moon, granting him a lifespan of a million years.”\n\nMoreover, visualize a register tablet, one piece, one *cun* in length and five *fen* in width. Concentrate intently upon inscribing its characters, ensuring each is vividly clear.\n\nNext, visualize the Five: Taiyi, Gongzi, Baiyuan, Siming, and Taojun, ascending from the Palace of the Six Harmonies into the Purple Chamber. Within the Purple Chamber, each presents a green jade tray, upon which lies a talisman, each inscribed in shades of azure and verdant green. They offer these to the Emperor Lord, who takes the talismans in turn and bestows them upon the aforementioned, transforming them into the Four Emperors.\n\nThe first Emperor is named Diaoliangji, styled Qingping;\nthe second, Changlaijue, styled Nanhe;\nthe third, Zhang’anxing, styled Xihua;\nthe fourth, Baochenghe, styled Beifa.\n\nVisualize these Four Emperors together reciting the Five Talismans. Upon completing the recitation, they present the talismans to you. Receiving them, you kneel before the Emperor Lord and ingest them in sequence. Visualize each talisman as one *cun* in length and five *fen* in width.\n\nOnce this is done, visualize the Four Emperors ascending through the void into the Three Heavens. As they depart, each addresses you: “Should you constantly hold our names in mind, you shall avert all harm, attain longevity without death, for we are the children of the Supreme One, the Perfected within the Three Primes. We transmit the Five Talismans into your form, that you may endure eternally between Heaven and Earth and achieve transcendence.”\n\nIf it is spring, visualize the Emperor Qingping, offering a goblet of azure nectar, one *sheng* in volume, served in a green jade bowl, for you to drink. After partaking, the Four Emperors ascend together into the Three Heavens. The same pattern applies for summer, autumn, and winter, with the colors of the nectar and bowls corresponding to the season.\n\nFurther, visualize to the left of the Emperor Lord the Elder of Dark Unity, clad in purple robes and crowned with a dragon coronet. To his right stands the Elder of the Three Purities, dressed in brocade and crowned with a tiger coronet. These dragon and tiger coronets resemble the *yuanyou* crowns of the mundane world, adorned with dragon and tiger motifs.\n\nThe Elder of Dark Unity is named Lin Xufu, styled Lingshi Dao.\nThe Elder of the Three Purities is named Lao Zhangshang, styled Shensheng Dao.\n\nBoth Elders are accompanied by Orthodox Unity Immortals: to the left, Zhong Chengzi, also named Dibin, styled Sihua; to the right, Qu Wenzi, also named Guangjian, styled Linghe. Their attire and crowns mirror those of the two Elders.\n\nNext, visualize Siming descending into the Palace of the Six Harmonies to approach the Taiyi Palace. Siming unites with Taiyi, and Taiyi ascends to petition the Emperor Lord to transmit your talismanic register. Taiyi addresses the Emperor Lord: “The talismanic register has been transmitted, Siming has united with the form, the Four Emperors have bestowed the nectar, and the Supreme One has recorded your life. We request that your name be inscribed and the register be issued to the Two Elder Lords.”\n\nThereupon, the Emperor Lord suddenly produces your life register from his bosom and presents it to the Left Elder. From his bosom, he also produces your Five Talismans and hands them to the Right Elder. The Two Elders receive the talismans and register, then declare to the Emperor Lord: “The life record of so-and-so is now fixed, ensuring his eternal existence in the world. The Five Talismans of the Emperor are recorded above in the Palace of Grand Simplicity.”\n\nThe Two Elders then command the Two Orthodox Unity Immortals, Zhong Chengzi and Qu Wenzi, to bear your life register and Five Talismans upward to the Jade Purity, Grand Simplicity, Supreme Three, Upper Clarity, Lofty Mystery, and the Nine Heavens’ Palaces. They proclaim the Emperor’s decree to transmit your life register, enabling your attainment of divine transcendence, and bestow upon you the title of Perfected Worthy. The Two Elders issue their commands, and all is duly recorded. The two Immortals then ascend with your talismans and register through the Nine Heavens, and after a long while, all is accomplished.\n\nNext, visualize Siming and Taiyi separating their forms, each becoming distinct, and together roaming the Grand Clarity, inspecting and governing the hundred spirits of the body. Once their circuit is complete, they return to their respective palaces. This is called the Great Transformation of the Original Destiny Emperor Lord through the Union of the Hundred Spirits.\n\nWhen the Five Emperors establish the record and the Two Elders determine life, it is the moment of the Union of Original Destiny. During this union, the affairs are numerous and complex; if you cannot fully comprehend them, you may perform the rites in a secluded chamber, following the text as you recite.\n\nThe Three Ones’ deities—the Heavenly Emperor of the Mud-Pill Palace, the Heavenly Emperor of the Cinnabar Palace, and the Heavenly Emperor of the Gate of Destiny—each reside in their respective palaces. These are the sons of the Purple Chamber Emperor Lord. During the Union of Original Destiny, first visualize the Three Heavenly Emperors of the Three Ones, each settled in their palaces. These palaces have their own Three Ones’ scriptures. The myriad transformations of the Union described here do not pertain to the Three Ones’ Heavenly Emperors. The Three Ones’ Heavenly Emperors have their own times of union, each with distinct methods and practices.\n\nThe Emperor Lord presides over transformation, Taiyi over life, Siming over destiny, Wuying over essence, Baiyuan over the hun and po souls, and Taokang over the numinous spirit. Each person possesses Five Registers and Five Talismans, bestowed by the Emperor Lord and held by the Five Spirits, each governing one aspect. These safeguard your original destiny, erasing death and ascending to life. Without the affairs of Taiyi, none can attain life. Even if one aspires to the Dao, seeks life with utmost sincerity, and exhausts all emptiness, it will be of no avail. Though one may possess virtue surpassing Heaven and Earth, merits renowned in the Three Bureaus, and a nature of utmost gentleness that moves the myriad spirits, without contemplating and holding fast to the August Lord, inwardly cultivating the Three and Five, returning the Five Registers and presenting the Five Talismans, and causing Taiyi to petition the Emperor Lord on your behalf to seek transcendence, you will ultimately be unable to transcend the seventy-nine trials and ascend to fill the ranks of the Immortal Offices.\n\nThe names of the various Emperors, the One Lord, the Two Elders, and the Three Perfected and Five Spirits must not be disclosed to others, lest calamity befall your family. The precious instructions of Taiyi are transmitted only after a covenant. These precious instructions are the *Scripture of the Wondrous Perfection of the Cavernous Mystery*. First, scrutinize the recipient, then swear an oath with gold and azure, replacing the blood covenant.\n\nMoreover, daily visualize your Three Hun souls entering the Palace of the Supreme Ultimate, where they may companion the Emperor Lord—this is most excellent.\n\nMoreover, on your natal day, you must refrain from speaking of inauspicious matters. Instead, seclude yourself in a chamber and visualize the qi of life, performing virtuous deeds. Take care never to transgress this.\n\nTaiyi is the essence of the embryonic sac and the master of transformation. The hun and po souls are born of the womb spirit, while the life qi emerges from the uterine palace, uniting with the Emperor Lord to blend and transform into a human being. Thus, the spirit of Taiyi is the mother of life, and the majesty of the Emperor Lord is its father.\n\nTaiyi is named *Wuyou Shou*, styled *Gui Huichang*, and also called *Jieming* or *Jipin*. These are the true names recorded in the *Three Primordials Cavern Mystery Inner Treasure Scripture*. The names found in external manuals and miscellaneous compilations are neither authentic nor real. These true names must never be disclosed to others. Those who know them shall attain longevity and immortality, repel all calamities, and summon divine spirits and jade maidens to descend.\n\nEach evening, visualize Taiyi within your Six Harmonies Palace, or at your side, whether sitting or lying down, facing any direction. When visualizing the qi of life, complete the invocation thus:\n\n*\"The essence of Taiyi arises from the Grand Clarity.\nHun and po receive transformation, form and shadow become spirit.\nIt commands the hundred spirits, restrains the Three Yang.\nThe Emperor Lord presides over mist, uniting with the Perfected in Huichang.\nWithin, it stabilizes essence and qi; without, it wards off disasters and misfortunes.\nIt expunges the register of death, extends life, and ensures eternal youth.\nClothing and appearance, youth and age, shift without constancy.\nIt ever governs the Six Harmonies, circling the Crimson Palace,\nDescending to the Cavern Gate, ascending to the Mysterious Realm.\nBlending the Three and Five, it roams and rests in the Celestial Court,\nSummoning the sun and moon, transforming yin and yang.\nIt seizes your talismanic register, the sac of the embryo,\nThe mandate of life and death—Taiyi upholds and guides you.\"*\n\nVisualize Taiyi’s form as identical to your own, even in clothing. Therefore, your body must always be purified and cultivated to seek union with the radiant Taiyi. Do not share garments, headscarves, or belongings with those of differing qi. Observe such precautions diligently.\n\nIf you cannot practice grain avoidance through diet or refine the truth through concentrated meditation, you must at least abstain from all impure, bloody, or foul foods—meats, pungent herbs, and the like—completely. If you can do this, even briefly, you will improve, and your lifespan may be extended.\n\nThe Left Azure Lad is the master of the Field of Essence, the spirit of the Upper Qi of the Three Primordials. He binds the Field of Essence to the Celestial Essence, where essence is born and returns to the Three Qi. Thus, the Left Azure Lad ever holds the talismanic mandate of spirit and essence. He is named *Xuan Yuan Shu*, styled *He Fu Zi*, and also called *Yuan Su Jun* or *Shen Gong Zi*. He resides within the Jade Chamber of the Upper Clarity. Each evening, after visualizing him, recite the invocation:\n\n*\"Supreme Jade Perfected, imperial essence linked,\nThree Primordials’ azure qi, Grand Mystery’s purple dawn.\nNine Empyreans rise in brilliance, Five Florets generate mist.\nWithin the Yellow Watchtower’s golden chamber stands a great spirit,\nGrasping fast the flowing bell, crowned with a floral diadem.\nA purple canopy swirls in the whirlwind, adorned with dragon and tiger patterns.\nHis countenance resembles a child’s, the Four Numinous in harmony.\nEmerging from cinnabar, entering the void, he unites form with the Emperor Lord.\nSummoning yin, calling forth yang, the Dao of Heaven holds truth.\nNamed Xuan Yuan Shu, styled the Azure Lad,\nHe traverses the Nine Paths, dispersing and transforming the Five Constants.\nHe engenders me, sustains me, and abides with the Dao forever.\"*\n\nThe Right White Prime is also called the Cavern Yang Lord. He governs the qi of the hun and po souls and oversees the spirit-fluid numen. Thus, the hun and po are born in the Palace of the Nine Numinous, while the spirit-fluid circulates through the truth of the Three Qi. The one who presides over them is named the White Prime Cavern Yang Lord, holding the talismanic mandate of the hun and po. The White Prime is named *Yu Ling Biao*, styled *Xuan Yi Jue*, and also called *Zhu Jing* or *Qi Cheng*. He resides within the Jade Hall of the Upper Clarity. Each evening, after visualizing him, recite the invocation:\n\n*\"Supreme divine essence, lofty and pure, Nine Lords,\nThree Qi congeal and transform, aligned with the Gate of Spirit.\nClad in dragon robes, girded with tiger belts, he restores life and revives the hun.\nAt his waist hangs the Jade Scripture, crowned with the Yellow Dawn’s floral diadem.\nHolding the register and talisman, he breathes and blends the mixed divisions.\nNamed Yu Ling, styled White Prime,\nHe roams with me, ascending to the Yang Barrier,\nCircling the Nine Clarities, within the Six Harmonies.\nBelow, he nourishes essence and fluid; above, the Mud Pill’s Upper Prime.\nThe hundred spirits uphold and guide, each guarding its treasure palace.\nOnce the inspection is complete, he returns to rest in the Yellow Chamber.\"*\n\nThe Central Controller of Destiny is also called the Lifespan-Regulating Elder. He governs the root of one’s natal year and holds the records of longevity and early death. Taiyi transforms the hun and arranges the talismans under the Controller of Destiny, while the Controller of Destiny blends with the hun to face the Emperor Lord. Thus, the Controller of Destiny oversees the tally of years, the handle of lifespan’s length or brevity. Through the great blending of talismanic registers, he is called the Elder. He is named *Li Ming Chu*, styled *Xuan Du Xiang*, and also called *Shen Zong* or *Ling Hua*. By day, he governs the Darkest Palace, communicating with the Yin Chamber and moving in and out through the two gates of the Spirit Hut. By night, he resides in the Mysterious Chamber, within the Earth Gate, below the Dark Palace, and above the Six Harmonies Palace—one realm between them.\n\nThe Yin Chamber refers to the two nostrils. The Controller of Destiny enters and exits through the nostrils, not between the eyebrows. At night, he resides in the Mysterious Chamber, which is the Jade Stem (penis), while the Earth Gate is the scrotum. For women visualizing this, locate him within the northern extreme of the Yin Gate. Each evening, visualize him and, upon completion, recite the invocation:\n\n*\"The imperial hun of the One transforms into the Nine Palaces,\nBlending the Three Perfected, shifting radiance in the Emperor’s court.\nDarkest Palace, Mysterious Gate, within lies the celestial numen,\nCircling the Seven Revolutions, the hundred spirits unite.\nHolding the tally, grasping the reckoning, the essence of the Controller of Destiny,\nClad in dragon robes, girded with tiger skirts, crowned with the Seven Stars’ headscarf.\nEver within me, stabilizing my form,\nStyled the Elder, named Li Ming,\nHe ascends to communicate with the talismanic mandate,\nGranting me long life.\nThe Three Primordials and Six Palaces, the ten thousand gates harmonized,\nCommanding the spirit qi, uniting with me,\nThe dragon wheel lingers, together we ascend to the Grand Clarity,\nEqual in radiance to the sun and moon,\nProfound and obscure, inscribing life in the azure register,\nHeaven and Earth both incline.\"*\n\nThe Peach Lord of the Gate of Life governs the mandate of received qi, being the Lord of Primordial Qi. Returning essence to spirit, refining essence into whiteness, merging to transform the primal circle, standing forth at the inception—truly the resource of Heaven and Earth, the numinous origin of yin and yang. The treasure of the Golden Gate, Jade Pass, and Chamber’s Portal all submit their mandate to the qi of the Peach Lord.\n\nThus, when the Great One returns the radiance, the Imperial Lord unites the hun-souls. \"Returning the radiance\" means blending all transformations as one; \"uniting the hun-souls\" means transmuting essence-fluid to engender life. The inception of essence-transformation is intoned by the Peach Lord, thereby distinguishing the signs of male and female.\n\nThe Peach Lord is named Child Dao-Kang, styled Harmonizing Essence-Prolonging, also called Mandate Jade or Womb Root. By day, he governs within the Five Domains of the Golden Gate—this is the Gate of Life at the navel’s center, the palace of the Lower Cinnabar Field. By night, he governs within the Six Harmonies, to the right of the Great One.\n\nEach evening, after completing the visualization, recite the incantation:\n\"Mysterious Origin congeals essence, Void unites with mist,\nThe knot of the womb-chamber, the intimacy of yin and yang,\nThe Three Supreme Qi descend into my body,\nA hundred joints receive numen, ten thousand spirits each arrayed,\nChaos merged as one, named the Peach Lord,\nFormed as at first birth, radiant and soaring to Heaven,\nClad in five-colored robes, adorned with phoenix-patterned splendor,\nHolding the divine talisman, uniting the Imperial Lord’s hun-soul,\nGirded with tiger-script sash, crowned with red kerchief and cinnabar cap,\nSeated on golden grove and jade couch, directly before the Gate of Life,\nMouth inhaling essence-qi, strengthening my bones and joints,\nTo the right, a divine maiden holds a vermilion banner,\nTo the left, a jade lad records the Imperial Lord’s words,\nYang qi moves leftward, chaos undivided,\nYin qi passes rightward, flowing through seven revolutions,\nDescending to the lowest depths, ascending to the Muddy Pellet,\nEver roaming the Nine Palaces, entering and exiting the Dark Gate,\nRefining hun and po between the Six Palaces,\nRegistering the ten thousand spirits, ascending with me as immortals.\"\n\nThe above is the method of the Three and Five merging to transform and engender the Five Spirits. These Five Spirits receive the great numen of the Five Qi and accord with the origin of the Mysterious Mandate. Above, they engender the Void; below, they congeal the singular body. The life-within-life of the body requires the Five Spirits for its arising and abiding.\n\nEach evening, the practitioner should visualize and recite this. If unable to recite silently, one may follow the text by day—it need not be at midnight, but rather when the qi of life arises. The three hun-souls are born of the Five Spirits, and the Three Perfected emerge from the Five Numinous Ones; thus, this Way is called the Method of Merging the Three and Five.\n\nThose who practice it attain long life without death. This Way is named \"The Northern Inspection of the Luminous Hall, Traversing the Purple Palace, Engendering and Transforming the Three and Five to Audience at the Upper Primordial.\" Even those who have already attained immortality should practice it, for those who practice it abide in eternal life.\n\nDuring visualization, one may sit or recline as desired. If sitting, it is best to face one’s natal direction. If unable to visualize all Five Spirits at once, one may first visualize two, then three, cycling through them, beginning with the Great One.\n\nWhen concentrating in visualization, one should seek utmost purity and stillness in a secluded chamber or quiet room—if in the mountains or forests, where no human voices or defiled qi can be heard—before practicing. After completing the visualization of the Three and Five merging, close the eyes and inwardly gaze, knock the teeth nine times, and swallow saliva nine times. Then softly recite the incantation:\n\n\"Perfected of the Nine Origins, truly possessing Three Fields,\nCloud chambers and golden halls, within dwell the Five Numinous Ones,\nCommanding awe and might, transforming the dark and hidden,\nEncompassing the Mysterious Mirror, weaving through Heaven and Earth,\nThree and Five revert and return, merging with the Grand Clarity,\nYang qi flows and moistens, transforming into the Nameless,\nAscending with me as immortals, reaching the Divine Court,\nSun and moon gaze upon each other, the Three Luminaries blend their forms,\nTranscending the Eight Extremes,\nCrowned with Heaven’s essence, turning left and glancing right,\nHolding the Seven Stars, concealing the body in the Grand Tenuity,\nUniting with the Primordial Qi of the Origin.\"\n\nAfter reciting the incantation, visualize the Five Spirits each seated in their palaces. The Five Spirits all exhale purple qi to coil around the body until the purple qi is dense and obscure, and inner and outer merge indistinguishably—hands and feet no longer visible—then cease.\n\nNext, visualize the sun and moon emerging from the left and right cheeks, the sun on the left and the moon on the right, their two lights penetrating and illuminating, whereupon the purple qi suddenly disperses.\n\nThen visualize the sun entering your mouth and consume it, savoring its sweetness, swallowing nine times before stopping. Next, visualize the moon entering your navel, below the Gate of Life, illuminating the chamber of yin.\n\nThen visualize yourself grasping the handle of the Northern Dipper’s Seven Stars, wearing them as you walk into the Purple Chamber of the Grand Tenuity Palace to meet the Imperial Lord. The Imperial Lord says: \"You have attained divine transcendence, you have attained long years. I inscribe for you the Azure Jade Talisman, writing upon the Nine Heavens.\"\n\nI bow twice and say: \"I beseech to conceal and rest in the Grand Tenuity, merge radiance with the Great One, arrayed in attendance upon the Imperial Lord, circling the Numinous Chamber.\"\n\nThe Imperial Lord then summons the Great One, who appears before the Imperial Lord. I then enter the mouth of the Great One, merging form and radiance into one body with the Great One. After a long while, all is complete. This is called \"Merging with the Grand Clarity, Transforming into the Nameless, Sun and Moon Gazing Upon Each Other, Grasping the Seven Stars, Sharing Form with the Great One, Concealing the Body in the Imperial Court.\"\n\nAfter completing the visualization of the Five Spirits, the incantation, and the inward gaze, open the eyes and click the teeth five times. Press the third finger of the left hand to the philtrum seven times, and the second finger of the right hand to the space between the eyebrows nine times. This is the method of \"Reining In the Three, Five, Seven, and Nine,\" sealing and controlling the gates of the hundred spirits, ensuring the hundred spirits secure the practitioner’s palaces, the Three Perfected solidify the practitioner’s singular body, the Five Spirits guard the practitioner’s talismanic mandate, and the Imperial Lord oversees the practitioner’s myriad chambers.\n\nAfter completing the practice, recite:\n\"Three and Five revert, Heaven covers and Earth begins,\nI possess the Five Talismans, ascending to the Imperial Son,\nThe Three Primordials abide long, within the encampment’s enclosure,\nFive colors...\"\n\nThe interconnection is complete, the primordial cycle of square and circle unfolds. Externally, it wards off the hundred misfortunes; internally, it restrains the hundred officials. The Three Perfected support me, the Five Spirits protect my person, commanding the stalwart and unyielding, ensuring I do not die.\n\nWhen the incantation is finished, visualize the Great One seated within the Sixfold Harmony Palace, thus merging form and radiance with me. Then return the fingers of both hands to their original positions, cover the mouth with both hands, and softly recite:\n\n\"The Great One commands all spirits, holding fast the gates of yin and yang. They must not recklessly abandon their palaces but await their reckoning before the Imperial Lord—first in accord with the law of the Three Perfected, second in accord with the mandate of the Nine Heavens.\"\n\nThis is the culmination of the merging and transformation, the completion of all visualization and practice.\n\nThe Great One regularly descends to the Crimson Palace at noon on *jia-wu*, *bing-wu*, and *wu-wu* days, merging form with the Perfected One and the practitioner’s body. This is called the \"Threefold Union of the Self,\" the *qi* of the Three Perfected, the Threefold Primal Transformation.\n\nThe Perfected One of the Crimson Palace resides in the Cinnabar Field of the heart, while the Central Perfected One dwells within the heart. The *Scripture of the Three Ones* records these matters in full.\n\nRegularly at noon on these days, enter the chamber and visualize the Great One descending to the Crimson Palace. Suddenly, the Perfected One of the Crimson Palace merges form with the Great One. Next, visualize yourself entering the Crimson Palace and suddenly merging form with the Great One once more. Within the Crimson Palace, only the body of the Great One is perceived, its form and attire mirroring the practitioner’s own—only finer and more subtle, as if newly born.\n\nWhen this is complete, visualize below the two nostrils: on the left, the sun; on the right, the moon. Within the sun is yellow essence and red *qi*; within the moon is red essence and yellow *qi*. The essence is the substance of the two luminaries; the colored *qi* is the mist of the sun and moon. The two *qi* rise in abundance, entering the Crimson Palace until it overflows. The two *qi* then ascend into the Cavern Chamber, filling it to abundance, before descending into the Yellow Court. The Yellow Court is the Cinnabar Field Palace three inches below the navel.\n\nOnce the two *qi* are full, they enter and fill the Great Granary, permeating the stomach channel with their abundant brilliance. Visualize the Great One ascending to the center of the stomach channel, facing south to summon the Perfected One of the Yellow Court in the Lower Cinnabar Field. Clad in yellow robes and a yellow headscarf, the Perfected One sits with the Great One, partaking of the essence and *qi* with twenty-seven swallows.\n\nAfter a long while, visualize the Perfected One of the Yellow Court reciting:\n\n\"The radiance of the sun and moon, the yellow and red essences,\nTheir round light merging *qi*, ascending in great brilliance,\nThe Three Primordials partake of the feast,\nThe Great One receives the numinous.\"\n\nThen visualize the Great One and the Central Perfected One returning to the Crimson Palace, while the Perfected One of the Yellow Court descends to the Lower Cinnabar Field Palace. The Great One merges form with the practitioner and returns to the Sixfold Harmony Palace.\n\nWhen this is complete, the practitioner recites:\n\n\"The Great One, Imperial Lord, commands the Three Primordials on high,\nAnd for me commands and restrains the hundred spirits.\nThe hundred spirits, in proper order, remain within my body,\nNever recklessly entering or exiting the Golden Gate or the Jade Barrier.\"\n\nWhen the incantation is finished, visualize the sun and moon below the breasts, ascending from the two nostrils into the Cavern Chamber. Within the Cavern Chamber resides the Supreme Perfected One, the Celestial Emperor. The Celestial Emperor is the son of the Imperial Lord; the Imperial Lord governs the Purple Chamber of the Supreme Ultimate, while the Celestial Emperor governs the Mud Pill Palace three inches inward from the space between the eyebrows—the Upper Palace of the Cinnabar Field—or else governs the Cavern Chamber Palace two inches inward from the space between the eyebrows.\n\nVisualize the Supreme Celestial Emperor, each hand holding the sun and moon—left hand holding the sun, right hand holding the moon. The Celestial Emperor first consumes the sun and moon, and the practitioner performs nineteen swallows. After nineteen swallows, the Celestial Emperor exhales *qi*, which descends upon the Sixfold Harmony Palace of the Great One. The palace is filled with purple mist, and the Great One inhales the purple mist, performing nineteen swallows before stopping. This is called the \"Merging of the Three Ones and the Emperor,\" spreading the essence of the sun and moon, transforming the radiance of the Three Palaces and the myriad spirits—ensuring perpetual life.\n\nThe Supreme One of the Nine Palaces enters the Imperial Chamber, the *qi* of Three and Five merging. Its root is the One and Seven, transforming into form and appearance. It safeguards the Five Phases, their nodes intertwined—this is the talisman for dispelling demons, the scripture of the Imperial Lord. It is said: the Three Perfected ascend in mutual succession, while the Five Spirits, receiving the imperial soul, descend in division.\n\nRegularly at midnight on *jia-zi* days, visualize within the Purple Chamber of the Supreme Tenuity Palace a youth resembling a newborn infant, clad in vermilion robes. His name is *Gan Jingjing*, his courtesy name *Huiyuanzi*, standing directly before the Imperial Lord, holding a red jade tablet upon which are inscribed the practitioner’s five talismans and life register.\n\nNext, visualize the Great One ascending from the Sixfold Harmony Palace to stand at the Imperial Lord’s left. The youth says:\n\n\"The talismans and register govern life; all spirits obey.\nThe records of *jia* and *yi* are inscribed in the imperial court.\nI request the mandate of the Great One to determine the name of *jia*—*jia* being the practitioner’s name.\"\n\nThe Imperial Lord says:\n\n\"Great One, youth of a hundred transformations, entering the self,\nEradicating death and ascending to life, cycling without end,\nThe myriad Perfected within the form—with a single command, the hundred officials are restrained.\"\n\nThereupon, the practitioner’s body and the youth merge into the form of the Great One. After a long while, visualize the Great One returning to the Sixfold Harmony Palace. This is called \"Merging the Youth and Infant in the *qi* of the Primordial Beginning, transforming the Great One amid the Three Perfected.\"\n\nThus, the *Perfect Scripture of the Great Cavern* states:\n\n\"The Lesser Youth of the Supreme Tenuity,\nEver before the Emperor,\nHis name is *Jingjing*,\nHis surname *Gan*.\nMerging form with the Great One,\nClad in vermilion and cinnabar,\nHolding the five talismans, life register, and jade tablet,\nCommanded by the Imperial Lord to govern all spirits—\nThis is the meaning.\"\n\nThe *Highest Scripture for Dispelling Demons* also states:\n\n\"*Xin-zi Jingjing*,\nPossessing spirit and majesty,\nMerging the three forms,\nThe nine paths mutually propel.\nClad in vermilion and cinnabar,\nWalking with measured steps,\nEntering and exiting the Upper Primordial,\nThe inner steps of the Supreme Ultimate.\nThose who know me live,\nThose who visualize me do not decline.\nPeople lack omens of mourning,\nRelying on me to avert calamity.\nIf you wish to know my dwelling,\nSecretly inquire of the Supreme Tenuity.\"\n\nThis is the transformation of the Womb Child into the Hun-soul of the Embryonic Great One. Those who know his name and appellation ensure that none among the myriad people of the world bear the omen of mourning. Constantly visualize him to avert misfortune and myriad disasters, and you shall attain long life without death.\n\nOn the day of performing this transformative union, all six Jia days are auspicious; there is no need to exclusively use the Jia-zi day. The Five Spirits of the Great One present the Five Talismans and Five Registers—this is the Dao of the Supreme Clarity Emperor Lord’s fusion and union, the secret to seeking long life and transcendence as a divine immortal.\n\nThe Peach Lord Talisman on the right is drawn with cinnabar on a white ground. The Five Thearchs’ Inner Treasure Talismans are the Dao of the Great One Emperor Lord’s fusion and transformation through union with the radiant essence. On your life-destiny day, inscribe the Five Talismans and store them together in a brocade pouch to carry on your person. Those who carry them attain long life without death.\n\nMoreover, in the month of your life-destiny, on the day and hour corresponding to your life-destiny, enter your chamber and inscribe the Five Talismans. Face the king and swallow them at once. Upon completion, recite the incantation:\n\n*\"The Five Talismans of the Great One,\nThe spirit registers record life.\nFor a thousand years, ten thousand ages,\nYou shall share the same age as Heaven.\nThe Emperor Lord holds the register,\nCommanding life-destiny without decline.\"*\n\nIf you wish to ingest this talisman multiple times, the most auspicious times are the fifth day of the fifth month, the seventh day of the seventh month, and the ninth day of the ninth month, at the hour when primordial qi is born at midnight, or alternatively at midnight on the autumnal equinox.\n\nTo present the Five Registers and Five Talismans for fusion with the Emperor Lord, on your life-destiny day and month, as well as on the fifteenth and twenty-sixth days of the third month, at the hour when primordial qi is born at midnight, ensure your chamber is pure and undefiled before proceeding. You may sit or lie down as you wish. If sitting, clasp your hands and bring them to your eyes. \"Bringing them to your eyes\" means keeping them closed yet not fully shut. If lying down, close your eyes and inwardly visualize. Place both hands over your heart and visualize the Emperor Lord seated in the Purple Chamber Palace of the Supreme Ultimate. Envision the Youth of the Supreme Tenuity attending behind the Emperor Lord, the Elder of Primordial Completion of Grand Simplicity attending to his left, and the Elder of Imperial Completion of Grand Harmony attending to his right. Next, visualize the Heavenly Emperor Lord of the Mud-Pill Palace ascending into the Purple Chamber to stand before the Emperor Lord. This Heavenly Emperor is the supreme perfected one of the Three Ones, the son of the Emperor Lord, the precious spirit of the Cavern Chamber of the Mud-Pill Palace.\n\nFurther visualize the Emperor Lord commanding the Heavenly Emperor to summon the Five Spirits of the Six Harmonies Palace. These Five Spirits—the Great One, the Noble Son, White Prime, the Controller of Destinies, and the Peach Lord—are five in number. Each wears vermilion robes and a crimson headscarf, and each holds a white jade tablet. Upon each tablet rests a talisman, one inch in length and five fen in width, with a register five inches long and one inch wide placed above it. Each has distinct duties and domains, with the register scrolls positioned above the talismans. Visualize the registers bearing your native place, name, and appellation, as described above. The Five Spirits each present their registers to the Heavenly Emperor, who in turn arranges them before the Emperor Lord.\n\nUpon completion, visualize the Emperor Lord commanding the Heaven and Earth Emperors to summon your spirit, bidding it ascend to the Purple Chamber. In an instant, your spirit enters through your left nostril, ascends to the Purple Chamber, and arrives before the Emperor Lord. The Emperor Lord instructs your spirit to take the tablets in order and read the registers. After reading, your spirit presents them to the Heavenly Emperor, who then offers them to the Emperor Lord. The Emperor Lord commands your spirit to ingest the Five Talismans in sequence.\n\nThe Emperor Lord then instructs the Heavenly Emperor to summon the Perfected of the Crimson Palace of the Central Cinnabar Field and the Perfected of the Life Gate of the Lower Primordial, bidding them come to the Purple Chamber. In an instant, the two Perfected ascend to the Purple Chamber before the Emperor Lord. These two Perfected are the Three Ones of the Central Palace, the spirits of the heart and the navel below.\n\nNext, visualize the Heavenly Emperor suddenly merging with the Emperor Lord’s form, entering through your mouth and uniting with him. In an instant, the two Elders enter the Emperor Lord’s two nostrils. Then, perceive the two Perfected of the Crimson Palace and Life Gate entering the Emperor Lord’s mouth. In another instant, perceive the Five Spirits entering the Emperor Lord’s Six Harmonies through his left ear. Finally, visualize your own spirit and the Youth of the Supreme Tenuity entering the Emperor Lord’s Six Harmonies through his right ear.\n\nWhen all is complete, the Emperor Lord sits alone in the Purple Chamber Palace of the Supreme Tenuity. All the summoned spirits have merged within his form, transformed and united before the Emperor Lord. Then visualize the Emperor Lord reciting the incantation:\n\n*\"Supreme Mystery and Profound Clarity,\nHeaven and Earth share the same essence.\nUnited with the radiant essence in the Purple Chamber,\nFusion transforms the myriad lives.\nThe Five Spirits and Three Ones,\nThe Two Elders record names.\nThe Youth of the Supreme Tenuity,\nReturns to form with your spirit.\nFor thousands upon thousands of myriads,\nYou shall enjoy long years of peace.\nPreserve me as your sovereign,\nAnd ascend as an immortal to Jade Clarity.\"*\n\nUpon completion, you recite the incantation:\n\n*\"The fusion is complete,\nThe register of death is obliterated.\nThe Heavenly Emperor commands,\nNever forget nor lose this.\nThe Hundred Spirits and Emperor Lord,\nEach treasure their abode.\"*\n\nThen open your eyes and conclude. This is the method for the Five Spirits presenting the talismans and registers, the Dao of the fusion of hun-soul and spirit. Focus your essence and mind to visualize it.\n\nThe Life-Guarantee for the Fusion of the Five Registers and Five Talismans: On your life-destiny day at noon, inscribe this talisman in cinnabar on blue-green paper, creating one copy. At midnight, enter your chamber, complete the visualization, and ingest one copy while facing your life-destiny direction. Take the remaining copy and cut it in half with scissors, dividing it at the black-stained center. Place one half in the stove fire and the other in the well water. Perform this ritual on every life-destiny day; it is called the Talisman for Preserving the Spirit and Prolonging Life, the Emperor Lord’s Record of Command.\n\nInscribe it with a blue-green brush on white paper. On your life-destiny day at dawn, face east and ingest it, then recite the incantation:\n\n*\"The Emperor Lord issues the command,\nThe nine qi merge as one smoke.\nHe causes me not to die,\nAnd further to ascend as a flying immortal.\nThe command stabilizes my form,\nI become a guest of the Supreme.\"*\n\nInscribe it with realgar on white paper. On your life-destiny day at noon, face south and ingest it, then face south and recite the incantation:\n\n*\"The Great One is luminous and numinous,\nThe Emperor Lord unites with my form.\nSever the Three Corpses,\nHun and po are at peace.\nAbide forever in Heaven,\nThe nine destinies remain unshaken.\nAscend before the Emperor,\nThe seven paths and five lives.\"*\n\nInscribe it with a cinnabar brush on white paper. On your life-destiny day at dusk, face your life-destiny direction and ingest it. After ingesting, recite the incantation:\n\n*\"Heaven dark, earth yellow,\nThe three hun dwell in the hall.\nHeaven yellow, earth dark,\nThe three hun reside in man.\nNeither yellow nor dark,\nThe Emperor Lord records the years.\nNeither dark nor yellow,\nThe Great One does not forget.\nHe stabilizes my form,\nBoundless longevity without end.\"*\n\nThis is the Great One’s Precious Command Talisman for Governing the Three Hun and Seven Po. Always on the month, day, and hour of your life-destiny, inscribe it in cinnabar on white paper and ingest it facing north. If you do not know your birth month, day, or hour, even knowing one will suffice; you may also ingest it on the wu-wu day at noon.\n\nThis is the Supreme Precious Talisman for Summoning the Emperor Lord. On the eight solar terms at noon, inscribe it in cinnabar on white paper, ingest it, and recite the incantation:\n\n*\"The Supreme Three Mysteries,\nThe Emperor Lord resides in the hun.\nThe Great One and Five Numinous Powers,\nProtect the hun and stabilize the body.\nThe Purple Chamber holds command,\nIssuing decrees to govern the hundred spirits.\"*\n\nThe Emperor Lord’s Inner Spirit Talisman of the Great One comprises twelve sections, all being the primordial qi of the Supreme Original Essence. It is most true and most secret—do not transmit it recklessly. There are also separate talismans of the Great One’s outer oral instructions, which differ greatly, being the superior talismans of the *Zhong Jin Di Chang Jing*. Those that are not authentic will be ineffective; you must be reverent and cautious.\n\nThe Emperor Lord’s taboo name is Feng Lingfan, his courtesy name Lü Changling. He is also called Seven Numinous Powers and Divine Elder. He constantly resides in the Purple Chamber of the Great Ultimate, sitting upright and proper, his appearance like that of an infant. A purple qi perpetually envelops his divine form. He wears a robe of five-colored radiance and a cap adorned with the sun and moon. Above his left ear is the sun, nine inches in diameter; above his right ear is the moon, one foot in diameter. This is the true form of the Emperor Lord at all times, not a transformation.\n\nThe Emperor Lord constantly recites a text that says:\n\n*\"Subtle and profound,\nThe Dark Prime is empty and complete.\nThe eight winds scatter light,\nTransforming in the hidden abyss.\nSilent and boundless,\nLuminous and abiding in the mysterious.\nThe seven spirits wander,\nRefining and softening the three hun.\nThe Supreme Lord is at peace,\nBestowing grace upon your body.\nYour body must always be pure,\nCautious in treading the flying dust.\nThen I shall be joyful,\nPreserving this muddy pellet.\nIf blood-corpses enter the eyes,\nDefiled qi swirls in profusion.\nThe Emperor and the Great One,\nTogether command the five spirits.\nAbandon office and forsake dwelling,\nAscend directly to the Nine Heavens.\nIf you resist,\nThe three destinies will topple.\nHow much better to be still and tranquil,\nEntwined with me in serenity.\"*\n\nThis is the Emperor Lord’s constant recitation of the Supreme’s divine chapter of the Empty Chamber. You should always study and recite it. Its urgency lies in impurity and filth—what I call the obscure.\n\nIf you know the Emperor Lord’s name and courtesy name, beware—you must not be careless. If you have transgressions and wish to confess, seek absolution, and have your sins removed, enter your chamber at midnight or noon, close your eyes, sit upright, and face north. Visualize the Emperor Lord in your Purple Chamber, meditating as described above. Then visualize your own body within the Purple Chamber, prostrating before the Emperor Lord. Internally confess your transgressions, holding your breath for a long while until your entire body is drenched in sweat, your clothes damp and steaming. Do this three times, and your sins will dissolve like scattered dust. Once your whole body is bathed in sweat, recite the incantation:\n\n*\"So-and-so has sinned,\nHeard by the hundred spirits.\nI beseech deliverance from the seven nines,\nFrom the perils of water and fire.\nThe Guardian of Destiny, the Great One,\nThe Emperor Lord who restrains and saves,\nSweat flows through my entire body,\nTerror grips the three hun.\nI implore the Supreme,\nTo forever remove these perils.\"*\n\nAfter reciting, call out the Emperor Lord’s name and courtesy name three times. Then open your eyes. This is called the Emperor Lord’s Method for Relieving Transgressions, an inner confession to the five spirits, with sweating as the sign of efficacy. When worldly people confess their faults, they kowtow and slap their cheeks—this is an external method. If you practice this method, or cultivate the Three Ones to guard the Grotto Chamber, with the Emperor Lord serving the Great One, be careful never to kowtow or slap your cheeks. Kowtowing startles the three hun, disturbs the muddy pellet, grieves the Purple Chamber, and topples the Emperor Lord. Slapping the cheeks hardens the womb and binds the sinews of the po, saddens the Great One, and disorients the five spirits—this is a great taboo. Whatever you do or think, if you mentally kowtow or slap your cheeks, it is inwardly resolved in the heart. Immortals bow in their hearts but do not physically prostrate—what I call the obscure.\n\nIf you know the Emperor Lord’s name and courtesy name, you will attain long life and immortality, and your body will not enter the earth. Be careful not to reveal them to others; if you do, the Jade Lads and Jade Maidens of the Guardian Scriptures will depart. This is not to be transmitted without a covenant.\n\nAlways on the geng-shen day at noon, or at midnight, enter your chamber and visualize the Emperor Lord in the Purple Chamber. The Emperor Lord exhales a qi, and with each breath, a person is formed—seven breaths create seven people. Then visualize the Great One coming from the Central Palace of the Six Harmonies to stand before the Emperor Lord. Visualize yourself merging with the Great One, becoming one body. The seven breaths create seven people, and the Great One and the Emperor Lord make two more, totaling nine people. These are the Seven Lords and Nine Lords, who govern the pathways of blood, vessels, sinews, and bones.\n\nVisualize the Emperor Lord issuing the command and reciting the incantation:\n\n*\"The First White Qi Lord, Wu Xuanzhi,\nThe Second Azure Qi Lord, An Yanchang,\nThe Third Black Qi Lord, Fu Laisheng,\nThe Fourth Yellow Qi Lord, Zu Mingche,\nThe Fifth Red Qi Lord, Kun Lizhi—\nAll wear robes of the five directions’ colors,\nAnd caps of the five directions.\nThey follow in order,\nNo confusion permitted.\nThe Sixth Upper Mystery Lord, Gao Tongsheng,\nThe Seventh Lower Mystery Lord, Shu Huowang—\nEach wears a vermilion robe and yellow cap,\nStanding behind me,\nHolding charts and registers,\nPresenting the five talismans.\"*\n\nNow command:\nThe First Lord governs qi,\nThe Second Lord governs blood,\nThe Third Lord governs essence,\nThe Fourth Lord governs fluids,\nThe Fifth Lord governs spirit,\nThe Sixth Lord governs the hun,\nThe Seventh Lord governs the po,\nThe Great One Lord governs marrow and brain,\nThe Emperor Lord governs the life-destiny.\n\nIn orderly succession they compare merits,\nRecord achievements and erase transgressions,\nStrike out names of the dead,\nAnd inscribe in azure script—\nAs decreed by the Heavenly Sovereign’s inner command.\n\nThereupon, the Emperor Lord completes the incantation.\nThen, from his mouth he exhales white qi thirty times,\nFilling the Purple Chamber,\nPervading his entire body with its deep fragrance.\nHis whole being merges in darkness,\nAs if enveloped in clouds and mist.\nAfter a long while, he suddenly opens his eyes and ceases.\n\nThis is called the Seven Lords and Nine Lords examining and aligning the body,\nBlending with white qi,\nTo firmly secure the Way of the Mud-Pill Palace.\nIt is also by this method that the illnesses of the Three Corpses and Seven Accumulations are dispelled.\n\nHuman life transforms from the womb,\nAnd takes form through blood and essence.\nYet once born, the womb re-forms knots,\nAnd once formed, blood and fluids cease to remain.\nThat which does not remain—the Emperor Lord’s blending holds it fast.\n\nThe womb has twelve knotted nodes,\nCoiling and binding the five viscera.\nWhen the five viscera stagnate and obstruct,\nThe knots cannot be untied,\nNor the nodes removed.\nThus, illness arises from stagnant nodes,\nAnd death from fixed knots.\n\nOn one’s life-destiny day or the eight seasonal nodes,\nOne should supplicate the Emperor Lord and the Great One to blend,\nCommanding the hundred spirits\nTo dissolve the womb’s stubborn knots,\nThe dead nodes of its coiled roots.\n\nThe womb has twelve knots,\nWithin which lie twelve nodes—\nNodes concealed within knots.\nThose who do not know how to untie these knots and nodes\nCannot escape death,\nWhile those who regularly dissolve them attain longevity.\n\nThe womb’s upper knots:\nOne in the Mud-Pill Palace,\nTwo in the mouth,\nThree in the cheeks,\nFour in the eyes—\nThese four knots reside in the upper region.\n\nThe womb’s middle knots:\nOne in the five viscera,\nTwo in the Great Granary,\nThree in the large intestine,\nFour in the small intestine—\nThese four knots reside in the middle region.\n\nThe womb’s lower knots:\nOne in the bladder,\nTwo in the yin,\nThree in the posterior gate,\nFour in the two feet—\nThese four knots reside in the lower region.\n\nThe method for dissolving knots:\nEnter a chamber, close the door, and visualize.\nFirst recite the names of the Emperor Lord and the hundred spirits below him.\nAfter repeating them twice,\nProceed in order to dissolve the knots.\n\nThis is the Way of the Emperor Lord and the Great One blending with the twenty-four spirits,\nDissolving knots and expelling the qi of the Corpse.\n\nOn one’s life-destiny day or the eight seasonal nodes,\nAt noon or midnight,\nSit upright facing the direction of one’s life-destiny day.\nJoin hands, compose the mind,\nAnd knock the teeth twenty-four times.\nRecite the incantation:\n\n*\"Male-born [Name], humbly invokes the Womb Father and Womb Mother,\nOn the day of my birth, three accumulations of lingering blood\nTransformed into twelve great knots.\nToday, on my life-destiny day,\nI reverently summon the Three Origin Spirits and the Twenty-Four Perfected Ones\nTo dissolve the Three Passes and Twelve Knots.\nI now invoke their names:\nThe Azure Emperor of the East, Diao Liangji,\nWhose style is Qingping;\"*\n\nSouthward, the Crimson Emperor Changlaijue, styled Nanhe;\nWestward, the White Emperor Zhang’anxing, styled Xihua;\nNorthward, the Black Emperor Baoshengchang, styled Beifa.\n\nThe Mysterious One, Old Master Lin Xufu, styled Lingshidao.\nThe Three Primes, Old Master Lao Zhangshang, styled Shenshengdao.\nThe Orthodox Unity Left Immortal, Zhong Chengzi, also named Dibin, styled Sihua.\nThe Orthodox Unity Right Immortal, Qu Wenzi, also named Guangjian, styled Linghe.\n\nThe Minor Lad of the Grand Tenuity, Gan Jingjing, styled Huiyuanzǐ, also named Sanjinjiao or Duidi Zhen.\nThe Inner Womb Perfected Ones, numbering nine, externally harmonize with the nine qi—these are the Nine Lords. For dissolving the knots above *jia*, the knots at the Upper Pass: when the four knots disperse, the fluid and blood flow at their source, the Upper Register of Longevity is lengthened, and one becomes an immortal of the Heavenly Emperor forever.\n\nThe Venerable Spirit of the Great One, Wu Youshou, styled Guihuichang, also named Jieming or Jipin.\nThe Left Non-Being Duke’s Son, Xuan Yuan Shu, styled Hefuzi, also named Yuansu Jun or Shen Gongzi.\nThe Right White Prime Cavern Yang Lord, Yu Lingbiao, styled Xuan Yijue, also named Zhu Jing or Qicheng.\nThe Central Controller of Destiny, the Venerable Lord Li Mingchu, styled Xuandu Qing, also named Shenzong or Linghua.\n\nThe Peach Lord of the Gate of Destiny, Hai Daokang, styled Hejingyan, also named Mingwang or Baogen.\nThe Celestial Emperor of the Mud-Pill Palace, Shangyi Chizi, Xuan Ning Tian, styled Sanyuan Xian, also named Bowushang or Boshi Hua.\nThe Celestial Minister of the Mud-Pill Palace, Zhao Le Jing, styled Zhong Xuan Sheng, also named Qifei or Changfu.\nThe Cinnabar Palace of the Heart and Cinnabar Field, the Central One Cinnabar Sovereign Lord, Shen Yun Zhu, styled Zinan Dan, also named Shengshang Bo or Shiyun Ju.\n\nThe Auxiliary Sovereign of the Cinnabar Palace, Zhong Guangjian, styled Sihua Ling, also named Youche Bo or Dongshi Hua.\nThe Nine Perfected of the Central Womb—these are the Nine Lords. The nine qi of numinous return transform and enter the Cinnabar Palace, dissolving the great knots of the five viscera. The large and small intestines shall all disperse; the four knots divide and flourish. The Central Pass is harmonized and regulated, flowing into the Great Granary. A thousand disasters and ten thousand calamities vanish in an instant. Inscribed in the Upper Register of Life, one remains forever free from misfortune.\n\nThe Primordial King of the Yellow Court below the Gate of Destiny, Shi Ming Jing, styled Yuan Yang Chang, also named Ying’er Tai or Boshi Yuan.\nThe Guardian and Protector of the Yellow Court, Gui Shang Ming, styled Guxia Xuan, also named Chengshen Bo or Chengguang Sheng.\n\nThe First Womb’s White Qi Lord, Wu Xuanzi, styled Yuchang Sheng.\nThe Second Knot’s Azure Qi Lord, An Yanchang, styled Hehe Ying.\nThe Third Node’s Black Qi Lord, Bin Laisheng, styled Jingshang Men.\nThe Fourth Womb’s Yellow Qi Lord, Zu Mingche, styled Shen Wuji.\nThe Fifth Blood’s Crimson Qi Lord, Hun Lizi, styled Shu Huojian.\nThe Sixth Upper Mysterious Primordial Father Lord, Gao Tongsheng, styled Zuo Huiming.\nThe Seventh Lower Mysterious Primordial Mother Lord, Shu Huowang, styled You Huiguang.\n\nThe Nine Lords of the Lower Womb, the Inner Womb Perfected Ones, generate and transform the nine qi—these are the Nine Po. When the nine po are firm in the nodes of the essence-womb, they cause one to die in middle age. Today, reverently following the command, as at the time of first birth, I beseech the dissolution of the twelve roots of death. May my name be inscribed in the Jade Register, the Five Talismans enter my body, and the nine qi be settled below, eternally entwined. Above, the Nine Palaces open; below, the Nine Passes open.\n\nAfter reciting the incantation twice more, conclude the rite. Harmonize the qi below the heart, ensuring the voice is neither choked nor faltering.\n\nThen close the eyes and visualize the Purple Chamber of the Supreme Ultimate, the Celestial Emperor of the Heavenly Vastness, Feng Lingfan, styled Lüchang Ling, also named Qiling or Shen Zhangren. Recite this incantation three times.\n\nNext, visualize the Twenty-Seven Perfected Lords of the Dissolved Three-Nine Knots: the Azure Emperor of the East, Diao Liangji, and the others through the Primordial Mother, Shu Huowang, all clad in vermilion robes and yellow kerchiefs. The yellow kerchief resembles the shape of a *yuanyou* cap. Their faces are like those of infants, neither tall nor short.\n\nThen lead the Purple Chamber of the Supreme Ultimate to face north, toward the Celestial Emperor, and all kneel in prostration. They say:\n\nThe Nine Lords of the Upper Pass, led by Diao Liangji, the Nine Lords of the Middle Pass including Taiyi Wuyoushou, and the Nine Lords of the Lower Pass beginning with Xiayi Huangting Shimingjing—these Twenty-Seven Lords of the Three Nines—on this day, with the internal swallowing of primordial qi, open the Three Passes above. Each Pass contains twenty-four knots, and each knot binds twenty-four sinews. Once the sinews are severed, the knots dissolve and scatter. The essence-blood surges upward, filling the Mud Pill Palace, while the Jade Nectar flows downward to nourish the hundred spirits. On this day, the name of so-and-so is inscribed in the Heavenly Register as a Perfected Immortal of Longevity.\n\nWhen this is complete, visualize the name of Taiyi ascending before the Celestial Emperor. The Emperor says: \"The fetal knots are now unblocked, your inner radiance shines through to the exterior. I grant you longevity, and your destiny shall not collapse. You may now merge with my form.\" The Celestial Emperor then opens his mouth, and I suddenly enter it, arriving directly at the Sixfold Palace within the Emperor. Within the Emperor’s Sixfold Palace resides another Taiyi spirit, named Chongmingkong, styled Youliaowu. He addresses me, saying: \"You may now consume the essence of the sun.\" I then take the solar essence and swallow it nine times.\n\nPresently, the Twenty-Seven Perfected Lords appear, standing to my left and right. They say: \"So-and-so’s fetal register is now dissolved, all impure qi is expelled. Your countenance shines like jade, your body permeates the Great Void. You shall live for millions of years, in harmony with the Celestial Emperor.\" Then visualize the Celestial Emperor’s incantation: \"In heaven, united with the Perfected—this is my body. In heaven, united with the Numinous—this is my form.\" After a long while, all is complete.\n\nThis is the Nine Lords’ fusion and internal transformation of the hundred spirits, the dissolution of the fetal knots, the untying of the Three Passes, the ascent to merge with the Sixfold Palace, and the union with the Radiant Celestial Emperor to alter one’s destiny in the register. The qi stabilizes in the Mud Pill Palace, and one receives the talisman of longevity, becoming a Heavenly Immortal.\n\nOnce the visualization is complete, loosen the hair, comb it again, untie and retie the garments, and wash the hands and feet. If one cannot silently recite or visualize even one or two parts, one may enter the chamber and perform the ritual according to the text.\n\nWithin the Celestial Emperor’s Mud Pill Palace is another Sixfold Palace, wherein resides the Celestial Sovereign Taiyi, named Chongmingkong, styled Youliaowu. Those who know this will regenerate from withered bones, their five viscera blossom, and they shall never know fear. In times of fear, face north and call this name three times, reciting the incantation: \"Luo A Chongmingkong Leifeng, Youliaowu Shangsheng Dijun, protect my form and free me from sorrow.\" When this is done, it is as if one travels with a thousand companions.\n\nThe Taiyi Celestial Emperor unties the Three Passes and the twelve fetal knots of the internal talisman. On one’s natal day or during the Eight Seasonal Festivals, when performing the knot-untying ritual, first swallow this talisman three times, facing the direction of one’s natal constellation. The talisman is inscribed with cinnabar on the white membrane within green bamboo. This membrane grows within the hard nodes, hollow within yet receptive to the numinous—thus, the bamboo membrane is used to write the knot-untying talisman.\n\nTaiyi says: \"Humans possess three hun-souls, which benefit one’s preservation. Humans also possess seven po-souls, which harm one’s destiny. The seven po-souls dwell beneath the left eye by day and beneath the nose’s philtrum by night. Those who cultivate the Dao should, before lying down, press the right fingernail to the left eye’s underside and the philtrum, each thirty-seven times—this is excellent for restraining the seven po-souls.\"\n\nThe *Taiyi Baoxuan Yujing* of the Celestial Emperor is concealed by the Supreme Perfected within the Flowery Chambers of the Five Peaks. Those without immortal registers may not hear or see it. Those who see it shall live; those who practice it shall become immortals. Therefore, solemn oaths are repeatedly sworn to summon celestial perfected beings, preventing disclosure and unauthorized dissemination.\n\nSince the Heavenly Worthy reveres the immortals, this Dao is kept profoundly secret. It is not casually transmitted to those without immortal bones, nor heard by those lacking utmost sincerity. The scripture says: \"The master, by virtue of the scripture’s teachings, is called the living recipient.\" The disciple studies to align in sincerity, swearing oaths to heaven, solidifying the divine pledge, intertwining joys and sorrows, and equating the bond with life and death. Only then can one be tested and ultimately ascend together to the immortal courts.\n\nThus, one offers reverence and receives the teaching, performing the oath in a secluded chamber. Superior and inferior observe the Three Purities, distinguishing the earnestness of their devotion. The precious scripture is concealed, its essential words practiced with care. Sincerity is maintained with single-minded focus, honoring the master and scripture. Not a moment of negligence is permitted—only then may one speak of communion with the divine and the covenant of the Dao.\n\nThose who receive the scripture and keep its Dao secret, who conduct affairs in accordance with their oaths, shall have their names inscribed on jade tablets and their imperial records written in the Supreme Ultimate. Should one violate the Dao, however, one’s seven ancestors shall suffer the trials of the Wind Blade, the Mysterious Mother shall endure harm to her fetal spirit, the body shall become a lowly ghost, and the family shall vanish like smoke. Mountains of stones shall be cast into the River of Accumulated Nights—how lamentable! Those with hearts must guard this secret most carefully.\n\nThis is the *Contract and Ordinance of the Supreme Perfected*, expounded by Celestial Master Zhang in the *Danjing*. It contains these solemn oaths. Those who receive the Dao of the Supreme Celestial Emperor conduct affairs thus, and so it is recorded for cultivation.\n\nThree gold rings shall seal the oaths of the Three Origins. Twenty-seven feet of azure silk serve as the ceremonial cloth. These bind the oaths of the Twenty-Four Divine Envoys of the Celestial Emperor. Five ounces of crimson thread shall seal the oaths of the Five Divine Lords. Two packets of blended incense shall produce the smoke that conveys qi in communion with the spirits. One brush, one *zhang* of paper, and one ounce of cinnabar shall inscribe the covenant.\n\nThese five items shall be placed in a vessel and kept from exposure. All who receive the scripture must prepare them. Once the disciple has copied the text, they shall bring both the scripture and the items to the master’s chamber to receive the transmission. Only after the transmission is complete may they put the teachings into practice.\n\nThose who secretly practice without taking the oath shall, according to the *Nüqing Ordinance*, forfeit both luminaries. Those who receive but do not practice shall face the trial of celestial fire. Those who practice but do so carelessly or reveal secrets shall suffer the Wind Blade’s judgment. Those who transmit to the unworthy shall bring seven generations of their ancestors under scrutiny.\n\nSuch are the principles of the *Xuandu Demon Statutes* and the *Nüqing Ordinance*. Here ends the *Supreme Scripture of the Great Vermilion Hidden Writ of the Cavernous Truth*, revealed by the Supreme Unity Celestial Emperor of the Cavernous Truth.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞真太－帝君太丹隐书洞真玄经 经名：洞真太一帝君太丹隐书洞真玄经。 简称《大丹隐书》。 撰人不详，约出放东晋。 系早期上清派重要经典。 一卷。 底本出处：《正统道藏》正一部。 洞真太－帝君太丹隐书洞真玄经 一名三元浩篇 紫微夫人初受此经时，先作此诵曰： 绛景浮玄晨，紫轩乘云征。 仰超金阙内，俯眄西华城。 东霞启五晖，神元焕七灵。 翳映纪三烛，流任自齐冥。 风鼓空洞宇，香烟散玉庭。 手携织女舞，双衿落锦青。 左徊文羽旗，华盖随云倾。 宴寝九庭外，是非不我营。 抱空泥丸内，天姿与日婴，岂同□秽中，惨惨无聊生。 扶桑翠空峰，朱灵葩微明。 沧台宵虚上，四观映高清。 飞景控紫轮，三素辔丹軿。 偃宴太帝馆，敖曹阿母庭。 濯漱碧濑波，提契玉醴罂。 曲晨乘风扇，瑶飙时下倾。 暂适圯蔼中，回驾泛良贞。 玄会自相要，流浪任玄冥。 始知荣辱辛，方悟忧促龄。 曲室可清净，颐真待日成。 何为讲当涂，百痾从是生。",
      "translated_text": "*The Great Concealed Scripture of the Cavern of Perfection: The Supreme One Sovereign Lord’s Esoteric Book of the Great Cinnabar*\n\nAlso titled *The Vast Chapters of the Three Primes*\n\nWhen the Lady of the Purple Tenuity first received this scripture, she began with this invocation:\n\nCrimson radiance drifts in the mystic dawn,\nPurple chariots ride the cloud-borne journey.\nGazing upward, I transcend the Golden Gates within;\nLooking down, I survey the Western Flower City.\nEastern auroras unfurl their fivefold brilliance,\nDivine essence kindles the seven numina.\nVeiled reflections trace the Three Torches,\nFlowing freely, they align with darkness profound.\nWinds stir the hollow vastness of the cosmos,\nIncense smoke scatters through the Jade Court.\nHand in hand with the Weaving Maiden, I dance,\nTwin sashes flutter in brocade hues of blue.\nTo the left, patterned banners of feathered script swirl;\nCanopies of blossoms tilt with the drifting clouds.\nBeyond the ninefold courts, I recline in banquet ease,\nRight and wrong no longer occupy my mind.\nEmbracing emptiness within the Mud-Pill,\nMy celestial form cradles the sun’s embrace—\nHow could it compare to the filth of the mundane,\nWhere life drags on, joyless and bleak?\n\nVerdant peaks of Fusang rise in the void,\nCrimson spirits bloom with faintest light.\nAbove the night’s hush of the Azure Terrace,\nFour vistas mirror the lofty clarity.\nFlying effulgences rein the purple wheel,\nThreefold purity guides the cinnabar carriage.\nI repose in the Supreme Lord’s palace,\nWandering the courts of the Celestial Matriarch.\nBathed in the jade-green ripples of the swift stream,\nI raise the jade ewer of sweet nectar.\nAt dawn’s curve, borne on the wind’s fan,\nJewelled gales descend in timely cascades.\nA fleeting sojourn in the mists of Ruin,\nThen turning my chariot, I drift through steadfast purity.\nMystic gatherings convene of their own accord,\nWandering at will through the dark unknown.\nOnly now do I know the bitterness of glory and shame,\nOnly now do I awaken to the sorrow of fleeting years.\nIn the secluded chamber, purity may be attained;\nNurturing the true awaits the sun’s fulfillment.\nWhy trouble oneself with the paths of the world?\nA hundred afflictions arise from this very course.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 384,
      "start_sentence": 0,
      "end_sentence": 29,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.283963680267334,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太一帝君丹隐书洞真玄经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "紫微夫人姓王，讳清娥，字愈音云，是西王母第二十四女。 紫微宫在北溟外羽明野玄垄山，玄垄山在昆仑山之东北。 紫微说阿母言曰：欲存服日月炁者，当知日月景象。 日圆形而方景，月方精而圆象，景藏形内，精隐象中，景赤象黄，是为日月之魂。 若知其道，乃可以吐纳流霞耳。 服日炁之法以平旦，采月华以夜半，存之去面前九寸，令光景照我泥丸，下及五藏，洞彻一形，引炁入口，光色蔚明，良久乃毕，常得长生。 右中侯夫人说紫微讳字。 《太一帝君太丹隐书洞真玄经》，如是宝经，藏之太上六合紫房之内，南极元君主之，故曰太丹隐书。 此书一名帝君七化变景九形，一名太一三度帝宝五精，一名帝一混合三五立成。 各四时宝焉，故总合太一之经也。 子若有之者不死，奉之者长生，存之者神仙，懃之者真灵矣。 太一虚生上玄道君，命太极真人遣玉华玉女九人、金华晨童七人，侍卫洞真玄经，营护有经者身，拥济佩符者魂。 玉童玉女记诸罪福，言功恋修者。 子有是经，当立密屋，寝处不杂，宣通冥会，以期真炁。 又常烧香左右，数自沐浴，默尔存神，人莫觉焉。 太极真人三春记，书曰太一帝君太丹隐书洞真玄经； 三夏记，书曰帝君七化变景九形； 三秋记，书曰太一三度帝宝五精； 三冬记，书曰帝一混合三五立成。 故四时异号，随节常生，所谓混合万变，不居一名，是为至道之书，以致真灵也。 夫学道而无太一，犹视瞻之无两跟； 存念而无太一，犹胸腹之失五藏； 御神而无太一，犹起行之无四支； 立身而无太一，犹尸僵而无炁矣。 是为此经，开通万神，生成魂津，千涂百径，须太一而立一人焉。 若学无师者，徒自烦劳也。 今别复撰此经之波流，钞出其外际，未陈幽妙，靡该秘唱，名为太一别诀。 如有可寻，以悟始涉末，令顿开深源者也。 自使别诀微行於学者，涉粗迹以玉觉焉。 至於幽玄内构，合奇万津，流会真神，混合灵府，伟灿于神景之变，发曜于造化之外，焕如圆曜，寂如太无，郁起而空洞结云，凝思而千年继夜，可谓微乎深哉。 太一之爱也，皆理竭於此经，事悉於洞玄者矣。 夫人者，受生於天魂，结成於元灵，转轮九炁，挺命太一，开关三道，积神幽官，所以玄液七缠，流津敷泽，日月映其六虚，口目运其神器，云行雨施，德拟天地，胞胎内生，五因来具，立人之道，其如此也。 故五因者，是五神也。 故三道者，是三真也。 夫五神，天之魂也； 三真，天之道； 九炁，天之胎； 太一，天之源； 日月，天之眼； 玄液，天之润； 六虚，天之光； 幽宫，天之府； 神器，天之化； 元灵，帝之变。 凡此言九炁者，乃混合帝君之变，变而化九，是谓九宫，混变而同一矣。 夫兆欲修己求生，当从所生之宗。 所生之宗，谓元父、玄母也。 元父主炁，化理帝先； 玄母主精，变结胞胎。 精炁相成，如阴阳相生，云行兆己，道合无名，数起三五，兆始禀形，七九既匝，兆体乃成，和合三五，七九洞冥，象帝之先，当须帝营，天皇之功，九变为灵，功成人体，体与神并，神去则死，神守则生。 是以三元为道之始，帝君为道之根，太一为道之变，九天为道之神，九宫为道之宅，玄田为道之圃，玄液为道之津。",
      "translated_text": "The Lady of the Purple Tenuity is surnamed Wang, her personal name Qing’e, and her courtesy name Yuyin—she is the twenty-fourth daughter of the Queen Mother of the West. The Palace of the Purple Tenuity lies beyond the Northern Ocean in the Featherbright Wilderness upon the Dark Mound Mountain, which stands northeast of Mount Kunlun.\n\nThe Lady of the Purple Tenuity addressed the Celestial Matriarch, saying: \"Those who wish to ingest and absorb the qi of the sun and moon must first comprehend the images and manifestations of sun and moon. The sun is round in form yet square in its radiance; the moon is square in essence yet round in its manifestation. Radiance is concealed within form, essence hidden within image—radiance is crimson, image is yellow: these are the hun-souls of sun and moon. Only when one knows this Dao may one exhale and inhale the flowing rosy clouds.\n\nThe method for absorbing solar qi is practiced at dawn; the gathering of lunar essence is done at midnight. Visualize them nine inches before your face, allowing their light and image to illuminate your Mud-Pill Palace, descending to the Five Viscera, penetrating your entire form. Draw the qi into your mouth until its radiance and color become resplendent and bright; after a long while, the practice is complete. By this means, one may attain longevity.\"\n\nThe foregoing was recounted by the Lady of the Right Central Marquis regarding the Lady of the Purple Tenuity’s personal and courtesy names.\n\n*The Supreme Lord’s Grand Cinnabar Hidden Book of the Cavern-Real Mystery*, this precious scripture is stored within the Purple Chamber of the Six Harmonies of the Most High, presided over by the Primordial Lord of the Southern Culmen—hence it is called *The Grand Cinnabar Hidden Book*. This text is also known as *The Seven Transformations and Nine Forms of the Imperial Lord*, *The Three Degrees, Five Essences, and Imperial Treasure of the Supreme One*, and *The Imperial One’s Fusion of the Three and Five to Establish Completion*. Each corresponds to the four seasons as a treasure, and thus they are collectively called *The Scripture of the Supreme One*.\n\nShould you possess this text, you shall not die; should you revere it, you shall attain longevity; should you visualize it, you shall become a divine immortal; should you diligently practice it, you shall become a perfected spirit. The Supreme One, born of the Void, is the Lord of the Supreme Mystery, who commanded the Perfected of the Great Ultimate to dispatch nine Jade Maidens of Jade Flower and seven Golden Flower Lads of Dawn to attend and guard *The Scripture of the Cavern-Real Mystery*, to protect the bodies of those who possess it and to succor the souls of those who bear its talismans. The Jade Lads and Maidens record all transgressions and blessings, speaking of the merits of those who cherish and cultivate it.\n\nIf you possess this scripture, you must establish a secluded chamber, keeping your dwelling undefiled. Ensure its circulation and communion with the unseen, awaiting the arrival of the true qi. Frequently burn incense to your left and right, bathe regularly, and silently visualize the spirits—let no one become aware of it.\n\nThe Perfected of the Great Ultimate recorded in the three spring months: *The Supreme Lord’s Grand Cinnabar Hidden Book of the Cavern-Real Mystery*; in the three summer months: *The Seven Transformations and Nine Forms of the Imperial Lord*; in the three autumn months: *The Three Degrees, Five Essences, and Imperial Treasure of the Supreme One*; in the three winter months: *The Imperial One’s Fusion of the Three and Five to Establish Completion*. Thus, its names vary with the four seasons, perpetually arising in accordance with the nodes—this is what is meant by \"the fusion of ten thousand transformations, not abiding in a single name.\" Such is the scripture of the supreme Dao, by which one attains the perfected spirits.\n\nTo study the Dao without the Supreme One is like gazing without two eyes; to visualize without the Supreme One is like a chest and abdomen devoid of the Five Viscera; to govern spirits without the Supreme One is like rising and walking without four limbs; to establish oneself without the Supreme One is like a corpse lying stiff without qi. It is for this reason that this scripture opens the pathways of the ten thousand spirits, generates and completes the soul and essence, and across a thousand roads and hundred paths, the Supreme One stands as the singular foundation. Without a teacher, one’s study is but vain toil.\n\nNow, I have once more compiled the currents of this scripture, excerpting its outer boundaries. Though the profound and wondrous have not been fully expounded, nor the secret invocations entirely encompassed, it is named *The Supreme One’s Separate Instructions*. Should one be able to follow it, it will awaken the beginner to the subtleties of the end, instantly revealing the deep source.\n\nThus, these separate instructions circulate subtly among scholars, guiding them from coarse traces to jade-like enlightenment. As for the inner construction of the profound and mysterious, the convergence of myriad marvelous streams, the flowing communion of true spirits, the fusion of the numinous palace—brilliant and dazzling in the transformations of divine radiance, shining beyond the bounds of creation, resplendent as the full orb of light, still as the Great Void—when clouds arise in empty vastness and thoughts congeal, a thousand years pass like a single night, it may be called subtle indeed and profound! The Supreme One’s love is entirely expounded in this scripture; its affairs are wholly contained within the *Cavern Mystery*.\n\nThe Lady is born of the celestial hun-soul, formed from the primordial spirit. Revolving through the nine qi, she is endowed with the mandate of the Supreme One, opening the three pathways, accumulating spirit in the hidden palace. Thus, the seven coils of dark fluid flow forth with effulgent moisture; sun and moon illuminate her six voids; mouth and eyes move her divine instruments. Clouds drift and rain descends—her virtue emulates Heaven and Earth. Within the inner womb, the five factors come together, establishing the Dao of humanity as such.\n\nThe five factors are the five spirits; the three pathways are the three perfected. The five spirits are the hun-souls of Heaven; the three perfected are the Dao of Heaven; the nine qi are the embryo of Heaven; the Supreme One is the source of Heaven; sun and moon are the eyes of Heaven; dark fluid is the moisture of Heaven; the six voids are the light of Heaven; the hidden palace is the treasury of Heaven; the divine instruments are the transformations of Heaven; the primordial spirit is the metamorphosis of the Emperor.\n\nWhen it speaks of the nine qi, it refers to the Supreme Lord’s fusion of transformations—transforming and becoming nine, these are called the nine palaces. Fusion and transformation return to oneness.\n\nIf you, the aspirant, wish to cultivate yourself and seek life, you must follow the origin from which you were born. That origin is your primordial father and mysterious mother. The primordial father governs qi, transforming and ordering the imperial predecessor; the mysterious mother governs essence, changing and knitting the womb. Essence and qi complete each other, like yin and yang generating one another. Clouds move and you are born—when the Dao harmonizes, it is nameless. The numbers arise from the three and five; you begin to receive form. When seven and nine have fully revolved, your body is complete. Harmonizing the three and five, seven and nine penetrate the unseen. Before the image of the Emperor, one must await the Emperor’s cultivation. The work of the Heavenly Sovereign—nine transformations become spirit. When the work is complete, body and spirit unite. When spirit departs, death follows; when spirit abides, life endures.\n\nThus, the Three Origins are the beginning of the Dao; the Imperial Lord is the root of the Dao; the Supreme One is the transformation of the Dao; the Nine Heavens are the spirits of the Dao; the Nine Palaces are the dwelling of the Dao; the Dark Field is the garden of the Dao; the dark fluid is the essence of the Dao.",
      "overlap_context": "es.\nA fleeting sojourn in the mists of Ruin,\nThen turning my chariot, I drift through steadfast purity.\nMystic gatherings convene of their own accord,\nWandering at will through the dark unknown.\nOnly now do I know the bitterness of glory and shame,\nOnly now do I awaken to the sorrow of fleeting years.\nIn the secluded chamber, purity may be attained;\nNurturing the true awaits the sun’s fulfillment.\nWhy trouble oneself with the paths of the world?\nA hundred afflictions arise from this very course.",
      "start_char": 385,
      "end_char": 1604,
      "start_sentence": 30,
      "end_sentence": 80,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.48963522911072,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太一帝君丹隐书洞真玄经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "修之三年，可以照镜三田，以致神仙，朝适六合，夕守泥丸，坚执胎精，心中常欢。 后学之子，须此为缘，见是经者，始可与言九黑陶注，太一运神矣。 子既得为人，人亦众矣，自无太一灵简，三元金名，司命隐符，五老紫籍，虽受天炁而生，皆不得闻见至道矣。 子又无玄宫紫札，上皇宝名，太一玉箓，东华隐图，三元铭神，太帝参魂者，虽受天之性，既得暂闻至道矣。 亦不能修为，为不能久，久而不固，固而不专，专而不能洞也。 适可隐存五岳，登行常生之涂耳，不得八景超宵，浮烟控晖，飞腾虚羽，踊跃太无矣。 子又无琼台羽札流云五校太一金阁五皇隐箓、后圣七符空山石函丹台素章、玄黄五行天母抱图、太上圆名保真秀炁九炼神躯之录者，皆不得见洞真玄经，睹帝一之变，又不得闻消魔神虎智慧之咏，又不得闻太上隐书八素之辞，又不得闻大洞真经三十九章，金真玉光豁落七元也。 夫至道之经，幽幽冥冥，唯在勤心存念，注心冥会，然后灵以启运，神以密感，九神合聚，太一书简，徐乃得闻玄妙之门，生命之本源，微乎玄矣，可不勖之哉。 存念太一，混合帝先，雄雌守神，灌流浩清，常使九天顺炁，则一合九成也。 夫洞真其要也，则一体常存，津血自生，雄镇命户，雌守神室，太一无离，与天同时。 故太上隐符曰：存其雄，守其雌，乃天地不能弥也。 既存之焉，则五神守宅，五藏生华，灵栖绛宫，帝镇泥丸，百神坚固，胎塞命门，久则三一之神夕见，太一帝先晨降，并见形於子之寝处也。 子当清洁斋净，断绝外事，杜塞邪径，节诸人物，罕为修诣，精心在一，晨夕修道，孜孜不替，沐浴五香，别静一室，烧香左右，以期真炁。 夫太一之道，尤忌见血腥臭臊殗秽之炁，若泣涕堕落，则帝君悲扰，哭声发口，则太一凝结。 太一凝结者，九炁止而不变，三一悲而不摄。 九炁不变，则三一亦结，结滞日积，则生炁泄出，而故炁运入。 故炁运入，将病将死之始也。 是以真人谓哭音为死绝之声，谓泣涕为漏精之津，可不慎避之哉。 若一见死尸，及积日哀哭者，则帝君获罪，谪於太上，太一受考，谴於玄虚也。 未及三年，子必亡矣。 诸不受太上之道者，自不得同之於学生也。 所以至忌哀哭殗秽忧泪之感，以为太一帝君之精思也。 又不得临见死尸，自受书之后，若见四十九尸者，皆不得长生，必中道绝命。 若见二十四尸者，则当暂过太阴，然后起仙。 以为死尸之形，既眄於两眼，尸鬼之胎，亦滞缠於人思，人思所存，记於绛宫，绛宫所识，虽忘犹存，宜渐归身显尸，塞思记之眼故也。 子厚慎之哉。 见血尸丧殗秽哀哭泣涕，皆太一之至忌也。 若常斋净，则存思易感，精神立会，太一镇命，欢欣混合，行之一十八年，白日升天。 此真人回老反婴之道也。 常当沐浴五香。 五香者，青木香也。 青木华叶五节，五五相结，故曰五香之草也。 辟恶气，检魂魄，制鬼烟，致灵迹，以其有五五之节，所以为益於人耶。 此香多生沧浪之东，故东方之神人，名之为青木之香焉。 又云：烧青木香，及熏陆安息胶於寝处头首之间者，以开通五浊之见，止地上魔邪之气，直上冲天四十里。 此香之烟也，破浊见之炁，开却邪秽之雾，故天人玉女、太一帝皇，随香炁中而来下，憩子之面目间焉。",
      "translated_text": "After three years of cultivation, one may illuminate the Three Fields in the mirror, thereby attaining divine transcendence. By morning, one roams the Six Directions; by evening, one guards the Mud-Pill Palace, firmly holding the embryonic essence while the heart remains ever joyful.\n\nLater disciples must take this as their foundation. Only those who encounter this scripture may begin to speak of the Ninefold Black Refinement and the Celestial Sovereign’s circulation of spirit. Since you have been born as a human—though humans are many—without the Celestial Sovereign’s spirit-tally, the Three Origins’ golden register, the Controller of Destiny’s hidden talisman, or the Five Elders’ purple records, though born of Heaven’s qi, you will never hear or see the supreme Dao.\n\nEven if you lack the Dark Palace’s purple writ, the Supreme Sovereign’s precious name, the Celestial Sovereign’s jade register, the Eastern Florescence’s hidden chart, the Three Origins’ spirit inscription, or the Supreme Thearch’s tripartite soul, though you may briefly hear the supreme Dao by virtue of Heaven’s nature, you will be unable to cultivate it. Even if you could, you would not persist; even if you persisted, you would not be steadfast; even if steadfast, you would not be single-minded; even if single-minded, you would not attain thorough penetration. At best, you might conceal yourself among the Five Peaks or tread the path of enduring life, yet you would not ascend through the Eight Radiant Realms, riding mist and harnessing light, soaring on empty wings, leaping into the Great Void.\n\nWithout the Jade Terrace’s feathered writ, the Flowing Cloud’s Five Standards, the Celestial Sovereign’s Golden Pavilion, the Five Sovereigns’ hidden register, the Later Sage’s Seven Talismans in the Stone Casket of Hollow Mountain, the Cinnabar Terrace’s plain chapters, the Mysterious Yellow’s Five Phases and the Heavenly Mother’s Embracing Chart, the Supreme Lord’s circular name and the Register of Preserving the True and Refining Qi to Temper the Spirit-Ninefold—none may behold the *Scripture of the Cavern of Perfection*, witness the transformations of the Imperial Unity, hear the chants of the Demon-Quelling Divine Tiger’s Wisdom, the *Hidden Writ of the Supreme Lord’s Eight Simplicities*, or the *Thirty-Nine Chapters of the Scripture of the Cavern of Perfection*, the Golden Perfection and Jade Radiance of the Seven Origins’ Liberation.\n\nThe scriptures of the supreme Dao lie in profound obscurity. Only through diligent mindfulness and concentrated meditation may the numinous be activated and the spirit subtly stirred. When the Nine Spirits gather and the Celestial Sovereign’s tally is revealed, one may then hear the gate of mysterious subtlety, the root-source of life. How profound and wondrous—how could one not exert oneself?\n\nConcentrate on the Celestial Sovereign, merging with the Primordial Emperor. The male and female spirits guard the gods, irrigating and flowing with the vast purity. Always ensure the Nine Heavens’ qi flows smoothly, so that the One unites with the Nine to achieve completion.\n\nThe essential teaching of the *Cavern of Perfection* is this: the body remains eternally preserved, vital fluids and blood generate spontaneously, the male spirit guards the Gate of Life, the female spirit protects the Chamber of Spirit, and the Celestial Sovereign never departs, enduring coeval with Heaven. Thus, the *Hidden Talisman of the Supreme Lord* states: \"Preserve the male, guard the female—then even Heaven and Earth cannot surpass you.\"\n\nOnce this is cultivated, the Five Spirits guard their abodes, the Five Viscera flourish with blossoms, the numinous dwells in the Crimson Palace, the Emperor resides in the Mud-Pill, the hundred spirits become firm, and the embryonic seal closes the Gate of Life. Over time, the Three Ones’ spirits appear by night, and the Celestial Sovereign and Primordial Emperor descend at dawn, both manifesting in your chamber.\n\nYou must maintain purity and fasting, sever all external affairs, block the paths of deviance, moderate all interactions, and rarely engage in frivolous pursuits. Focus your mind single-pointedly, cultivate the Dao morning and evening without fail, bathe in the five fragrances, and seclude yourself in a quiet room. Burn incense to your left and right, awaiting the arrival of true qi.\n\nThe Way of the Celestial Sovereign particularly abhors the sight of blood, the stench of foul odors, and the pollution of impurities. If tears fall, the Imperial Lord grieves and is disturbed; if wailing issues from the mouth, the Celestial Sovereign congeals. When the Celestial Sovereign congeals, the Nine Qi cease their transformations, and the Three Ones grieve without gathering. If the Nine Qi do not transform, the Three Ones also congeal. As stagnation accumulates day by day, the generative qi leaks out, and the old qi circulates inward. When the old qi circulates inward, it marks the onset of illness and death.\n\nThus, the Perfected call the sound of wailing the voice of death and extinction, and tears the fluid that leaks essence. How could one not cautiously avoid them? If you encounter a corpse or prolonged mourning, the Imperial Lord incurs guilt and is demoted by the Supreme Lord, while the Celestial Sovereign faces punishment and is reprimanded in the Mysterious Void. Before three years have passed, you will surely perish.\n\nThose who do not receive the Supreme Lord’s Dao cannot be counted among the disciples. Therefore, the deepest taboos are grief, wailing, impurities, sorrow, and tears—these disrupt the Celestial Sovereign and Imperial Lord’s refined concentration. Furthermore, one must not come into contact with corpses. After receiving this scripture, if you see forty-nine corpses, you will not attain longevity but will perish midway. If you see twenty-four corpses, you will temporarily pass through the Great Yin before reviving as an immortal.\n\nFor the form of a corpse, once glimpsed by the eyes, the embryonic ghost of the dead lingers in one’s thoughts. What the mind dwells upon is recorded in the Crimson Palace; what the Crimson Palace remembers, though forgotten, remains. Gradually, it manifests in the body, blocking the eyes that record thoughts. Be most cautious of this.\n\nThe sight of blood, corpses, funerals, impurities, wailing, and tears—these are the Celestial Sovereign’s deepest taboos. If you consistently maintain purity and fasting, your concentrated thoughts will readily resonate, your spirit will swiftly unite, the Celestial Sovereign will guard your life, and joy will merge with harmony. Practicing this for eighteen years, you will ascend to Heaven in broad daylight. This is the Perfected One’s path of reversing old age and returning to infancy.\n\nYou should regularly bathe in the five fragrances. The five fragrances are the greenwood incense. Its flowers and leaves have five nodes, five by five interlocking—hence it is called the five-fragrance herb. It repels evil qi, restrains hun and po souls, subdues demonic vapors, and induces numinous manifestations. Because of its five-by-five nodes, it benefits humanity.\n\nThis herb grows abundantly east of the Canglang River, so the divine beings of the East call it the greenwood incense. It is also said: burning greenwood incense, frankincense, and benzoin between the head of your bed and your sleeping place dispels the five turbid visions, halts the demonic qi of the earthly realm, and rises straight up to pierce the sky for forty miles. The smoke of this incense shatters the qi of turbid visions and clears the mists of deviant impurities. Thus, the Heavenly People, Jade Maidens, Celestial Sovereign, and Imperial Thearch descend within the fragrant qi, resting upon your face and eyes.",
      "overlap_context": " the Heavenly Sovereign—nine transformations become spirit. When the work is complete, body and spirit unite. When spirit departs, death follows; when spirit abides, life endures.\n\nThus, the Three Origins are the beginning of the Dao; the Imperial Lord is the root of the Dao; the Supreme One is the transformation of the Dao; the Nine Heavens are the spirits of the Dao; the Nine Palaces are the dwelling of the Dao; the Dark Field is the garden of the Dao; the dark fluid is the essence of the Dao.",
      "start_char": 1604,
      "end_char": 2848,
      "start_sentence": 81,
      "end_sentence": 116,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.77684497833252,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太一帝君丹隐书洞真玄经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "烧香夜半时，亦常存而为之，勿废忘也。 存三一，守太一，精洞房，会帝君，则化生九灵，於子形中，辅子之神明，成子之仙真，保子之长生，固子之胎魂也。 白元、无英、桃康、司命、太一，混合五神，捧籍列符。 五神各有所主，混合九变，三五洞化，於是三宫镇真，百节受灵，帝君宝籍，宿命无倾，周旋虚烟，启通玄精，二十四真忽然而生，上开上元，下开八冥，左朝六甲，右使六丁，玉华引日，太一并形，千乘万骑，举身登晨，白日升天。 真人修是太一之道者，皆得三天之举，故曰举身登晨，白日升天。 以鸡呜时晨登空无，比日之中，到于三天之上。 日之正中为白日，鸡呜之始为登晨，是以存太一混合，多用鹦呜及生炁时也。 子有太一洞真玄经者，别为囊笈，封以宝器，盛之机上，每事朝拜，如奉君父。 若所作所向，必先启白再拜，三密呼太一九君名字，因言所欲求乞，梦应以占吉凶，其心精到者，卧觉之时，立有感效也。 若宜诵习施行看省者，别写一通，以谨案之。 至於机上之经，以为尊宝。 三元隐化，则成三宫，宫名太清、太素、太和是也。 三三则九，故有三丹田，又有三洞房，合上三元，其则九宫。 九天九宫中有九神，是谓天皇九魂，变成九炁，化为九神，各治一宫，故曰九宫。 太清中有太素、太和，洞房中有明堂、绛宫，是曰六府。 上曰天府，下曰洞台。 三五之号，其位不同。 一曰太清之中，则三五帝君，二曰三一丹田神。 又五者，符籍之神，太一、公子、白元、司命、桃康君是也，合而名为三五，三五各有宫室。 若三真各安在其宫，五神上见帝君。 帝君左有元老丈人、右有玄一老君。 此则无极之中所谓九君，上一则真一也。 九君所谓天之魂，自然成真之子也，以为兆神者也。 若兆知精存九君，深思三真，必能以兆一体，周旋三五之中，反覆七九之裹，使天帝之灵魂，常治在兆己，五神捧籍，周而复始，必将白日登度，何但不死而已哉。 帝君混化，周旋三五，太一万变，结成七九，其数合二十四也。 天有二十四炁，炁之上化也。 变而则成真人，人亦禀之，故体有二十四神，神有千乘万骑，云行八极之中。 子若思存念之，慎勿忘，可以辟死求生，上超十方，於是神安炁洞，上与天通，越出地户，过度天门，隐息四维，七星散分，飞行云房，日月殖根，守金藏玉，制御万神，仙王何人，我已成其真矣。 此隐存之道也，并有经诀，在上皇中极宝景篇中。 子既有之，不得妄传，必须歃誓，审人乃宣。 帝一道尊，七九万化，所谓一变万千，七九复还，天道不远，三五复反。 子知一尊，长生飞仙，子知三五，横行天下。 不知一尊，虽生无根，不知三五，身归於土。 斯言信也。 《大洞真经》曰：天有九魂，不可不分，道有三真，不可去身，帝一变景，万化以臻，流珠停晖，紫霞踊烟，七度回路，三光映真，太上精符，相与为亲。 斯言妙也。 又《高上神霄经》曰：魂生无中，布在九宫，道出三极，常游绛宫，三宫合化，是为紫房，紫房所在，先由明堂，兆能知之，当开金门。 金门，洞房之内也。 又曰：混而合之，出入帝方，三五合一，必成仙王。 此谓混合之时，三真五神之道也。",
      "translated_text": "At midnight when burning incense, regularly perform this visualization—do not neglect or forget it.\n\nVisualize the Three Ones, guard the Great One, refine the Cavern Chamber, and meet the Imperial Lord. Then nine numinous spirits will be transformed within your form, assisting your divine luminosity, perfecting your immortal truth, preserving your longevity, and securing your fetal soul.\n\nThe White Prime, Non-Flourishing, Peach Vigor, Controller of Fate, and Great One—these five spirits merge, bearing registers and arranging talismans. Each of the five spirits governs its domain; their fusion undergoes nine transformations. The Three and Five interpenetrate and evolve, thereby stabilizing the Three Palaces with true essence, infusing the hundred joints with numinosity. The Imperial Lord’s precious register ensures your predestined fate remains unshaken. Circulating through the ethereal smoke, it unlocks the mysterious essence. Suddenly, the twenty-four perfected beings arise: above, they open the Upper Prime; below, they open the Eight Nether-realms; to the left, they summon the Six Jia; to the right, they dispatch the Six Ding. The Jade Splendor draws the sun, the Great One merges with your form. With a thousand chariots and ten thousand riders, your entire being ascends at dawn—ascending to heaven in broad daylight.\n\nThose who cultivate this Way of the Great One all attain ascent to the Three Heavens. Thus it is said: “Ascend at dawn, ascend to heaven in broad daylight.” At the cock’s crow, you ascend into the empty void; by midday, you arrive above the Three Heavens. Midday is the “broad daylight,” the cock’s crow marks the “ascent at dawn.” Therefore, when visualizing the Great One’s fusion, frequently employ the moments of the cock’s crow and the arising of primordial qi.\n\nIf you possess the *Great One’s Cavern-Real Mystery Scripture*, keep it in a separate satchel, seal it in a precious vessel, and place it upon your altar. For every matter, pay homage as if attending the lord and father. For any undertaking or direction, first invoke and bow twice, secretly recite the names of the Nine Lords of the Great One, and state your request. Dream responses will reveal fortune or misfortune. For those whose hearts are truly refined, effects will manifest immediately upon waking.\n\nIf recitation, practice, and contemplation are required, copy a separate version for careful study, while the scripture on the altar remains revered and sacred.\n\nWhen the Three Primes conceal and transform, they form the Three Palaces—named Grand Purity, Grand Simplicity, and Grand Harmony. Three threes make nine, hence the Three Cinnabar Fields and the Three Cavern Chambers. Combined with the Upper Three Primes, they constitute the Nine Palaces. Within the Nine Heavens and Nine Palaces dwell nine spirits, called the Nine Celestial Souls of the Heavenly Sovereign. These transform into nine qi, which become nine spirits, each governing one palace—thus the term “Nine Palaces.”\n\nWithin Grand Purity lie Grand Simplicity and Grand Harmony; within the Cavern Chamber lie the Hall of Light and the Crimson Palace—these are the Six Treasuries. Above is the Heavenly Treasury, below the Terrace of Radiance. The designations of the Three and Five differ in their positions.\n\nFirst: within Grand Purity reside the Three-Five Imperial Lords.\nSecond: the Three-One spirits of the Cinnabar Fields.\nThe Five refer to the spirits of the talismanic registers: the Great One, the Lord’s Son, White Prime, Controller of Fate, and Lord Peach Vigor. Together, they are called the Three-Five, each with its own palace.\n\nWhen the Three Perfected rest securely in their palaces, the Five Spirits ascend to meet the Imperial Lord. To the Imperial Lord’s left stands the Elder of Primordial Old, to his right the Old Lord of the Mysterious One. These, within the boundless, are the so-called Nine Lords. The uppermost is the True One. The Nine Lords are the celestial souls, the naturally perfected children of the Dao, serving as the spirits of the adept.\n\nIf the adept knows how to refine and visualize the Nine Lords, deeply contemplates the Three Perfected, they can embody the adept within the Three-Five, revolving through the seven and nine, ensuring the celestial spirits of the Heavenly Emperor always reside within them. The Five Spirits bear the registers in ceaseless circulation, and the adept will surely ascend in broad daylight—how could mere immortality suffice?\n\nThe Imperial Lord’s fusion revolves through the Three-Five; the Great One’s myriad transformations coalesce into seven nines, their number totaling twenty-four. Heaven possesses twenty-four qi, which evolve above. Through transformation, they become perfected beings. Humans also receive them, hence the body contains twenty-four spirits. Each spirit commands a thousand chariots and ten thousand riders, traversing the eight directions. If you visualize and contemplate this without forgetfulness, you can evade death and seek life, transcend the ten directions, harmonize spirit and qi, commune with heaven, escape the earthly gate, pass through the celestial portal, conceal your breath in the four directions, disperse the Seven Stars, soar through the cloud chambers, plant roots in the sun and moon, guard gold and store jade, command the myriad spirits. What immortal king could you not become? You have already attained perfection.\n\nThis is the Way of concealed visualization, with its scriptural formulas recorded in the *Supreme August’s Utmost Treasure Radiance* chapter. Since you possess it, do not transmit it recklessly. You must swear an oath and scrutinize the recipient before imparting it.\n\nThe Way of the Imperial One is supreme. The seven nines undergo myriad transformations—what is called “one transforming into ten thousand, seven nines returning to one.” The Dao of heaven is not distant; the Three-Five return in cycles. If you know the One’s supremacy, you attain longevity and flight as an immortal. If you know the Three-Five, you traverse the world. Without knowing the One’s supremacy, though alive, you lack roots. Without knowing the Three-Five, your body returns to dust. These words are true.\n\nThe *Scripture of the Great Cavern* states: “Heaven has nine souls—do not fail to distinguish them. The Dao has three perfected ones—do not depart from the body. The Imperial One transforms scenes, myriad changes arrive. Flowing pearls halt their radiance, purple clouds surge in smoke. Seven paths turn back, three luminaries reflect the true. The Supreme’s essence-talismans become kin.” These words are wondrous.\n\nThe *Highest Divine Numinous Empyrean Scripture* also states: “Souls arise from the formless, spread through the Nine Palaces. The Dao emerges from the Three Ultimates, ever roaming the Crimson Palace. The Three Palaces fuse and transform—this is the Purple Chamber. Where the Purple Chamber resides, it first passes through the Hall of Light. If the adept knows this, they may open the Golden Gate.” The Golden Gate lies within the Cavern Chamber.\n\nIt further says: “Merge and unite them, entering and exiting the Imperial Realm. The Three and Five unite as one—you will surely become an immortal king.” This refers to the moment of fusion, the Way of the Three Perfected and Five Spirits.",
      "overlap_context": "lso said: burning greenwood incense, frankincense, and benzoin between the head of your bed and your sleeping place dispels the five turbid visions, halts the demonic qi of the earthly realm, and rises straight up to pierce the sky for forty miles. The smoke of this incense shatters the qi of turbid visions and clears the mists of deviant impurities. Thus, the Heavenly People, Jade Maidens, Celestial Sovereign, and Imperial Thearch descend within the fragrant qi, resting upon your face and eyes.",
      "start_char": 2848,
      "end_char": 4068,
      "start_sentence": 117,
      "end_sentence": 156,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.37895321846008,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太一帝君丹隐书洞真玄经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "帝方，太清域也。 故《大洞真经中篇》曰：二老在左右方，帝魂不可不分，三九变其上下，太一立其中根，五神奉我生籍，司命塞我死门，九宫合而为一，六合总而内真也。 此言谓分别其宫室，混合其变化。 此道是太上宝行，长生根本，立人之帝先，为道之元始，生府之仙宗，帝籍之秘章，洞真之奇妙，九宫之要经也。 《九真中经》曰：九魂离合，三光同晖，天皇在元，紫烟霏霏，五神奉图，性命不亏，变入九宫，帔服朱衣，腰带虎章，流云绣帔，帏帔瓓斑，五色徘徊，日月照察，侠以东西，神庭内体，以除渴饥，三五复反，转藏营机，周流太一，生均两仪。 谓天皇在太清中，太一受哺养，五神奉符籍之时，学者存日月以侠照也。 此中经一篇，指说太一之名事，故记出焉。 夜半生炁时，若鸡呜时，正卧闭目微炁，存左目中出日，右目中出月，并径九寸，在两耳之上。 两耳之上，名为六合高窗也。 令日月使照一身，内彻泥丸，下照五藏、肠胃之中，皆觉见了了，洞彻内外。 令一身与日月光共合，良久毕，叩齿九通，咽液九过，乃微祝曰： 太上玄一，九皇吐精，三五七变，洞观幽冥，日月垂光，下彻神庭，侠照六合，太一黄宁，帝君命简，金书不倾，五老奉符，天地同诚，使我不死，以致真灵，遏万邪，祸害灭平，上朝天皇，还老反婴，太帝有制，百神敬听。 毕，乃开目。 名为日月炼根，三元校魂，以制御形神，辟诸鬼炁之来侵，使兆长生不死，夕夕存之矣。 又存左目为日，右目为月，共合神庭之中，却上入明堂之中，化生黄英之醴，下流口中，九咽之，以哺太一。 常以生炁时存之毕微咒曰： 日月上精，黄水月华，太一来饮，神光高罗，使我长生，天地同柯。 毕。 五日行之。 口中舌上为神庭，存日月既毕，因动舌，觉有黄泉如紫金色，从舌上出，上流却入明堂之中，名为黄英之醴也。 存思之时，当闭目绝念。 常以月朔之夕，生炁之时，安卧闭目向上，心存二十四星，星大一寸，如相连结之状。 又存一星之中，辄有一人，合二十四人，人皆如小儿始生之状，无衣服也。 於是二十四星，直从天上虚空中来下，回绕一身外三匝。 三匝毕，以次咽以入口中，凡作二十四咽，咽时辄觉吞一星也。 觉从口中径至脐中，脐中名曰受命之宫也。 又觉星光照一腹内，洞彻五藏。 又存星光化为二十四真人，并吐黄炁如烟，以布满脐中，郁郁然洞彻内外也。 良久，微咒曰： 二十四真，回入黄庭，口吐黄炁，二十四星，灌我命门，百神受灵，使我骨强。 魂魄安宁，五藏受符，天地相倾。 毕。 名曰真炁入守命门，以辟灾祸百鬼之疾，令人长生不死。 太无混合，以象一灵虚生之子，以为上帝君。 又居泥丸之帝，以为三一之尊帝，尊帝者，是虚生之子也。 是谓三帝焉。 太一受生，於空洞，变化乎八方，立景於三帝之间，流会乎万神之领，天地之尊，皆须太一而自运也。 灵帝无太一，则玄虚不回炁，尊帝无太一，则三一不居其宫域。 故太一之神，并五神以通用，上舍体於三帝，帝之为高，犹天皇帝君者也。 等形九魂，魂生三五，三五合会，结成帝君。 将帝之生也。 受玄中上炁，三五离合之所挺焉。 是以帝生於无极之表，玄成之中，见於太清之域，治在玉清紫微宫中，光曜五色，华盖九重，前洞泥丸，后开幽门，下临六合，上连紫云，百官宿卫，飞阁交通，玉殿朱陛，内有金房，中有太真，号曰天皇，凭虚而生，处无极之中，衣五色珠衣，冠九德晨冠，制御天冈，时乘玉龙六辔，超虚九道自通。",
      "translated_text": "The Imperial Realm is the domain of the Grand Clarity.\n\nThus, the *Central Chapter of the Perfect Scripture of the Great Cavern* states: “The Two Elders stand to left and right; the Imperial Soul must not remain undivided. The Three and Nine transform above and below; the Great One establishes its central root. The Five Spirits present my register of life; the Controller of Destiny seals my gate of death. The Nine Palaces merge into one; the Six Harmonies gather the inner truth.” These words describe the differentiation of palaces and the fusion of transformations.\n\nThis Way is the precious practice of the Supreme, the root of long life, the establishment of the human Imperial Ancestor, the origin of the Dao, the immortal lineage of the life-palace, the secret writ of the Imperial Register, the marvel of the Cavern Truth, and the essential scripture of the Nine Palaces.\n\nThe *Central Scripture of the Nine Perfected* says: “The Nine Souls separate and unite; the Three Luminaries share their radiance. The Celestial Sovereign abides in the Primordial; purple mists billow forth. The Five Spirits present the chart; essence and life remain unharmed. Transforming and entering the Nine Palaces, one dons a crimson robe, a tiger-patterned sash, and a cloud-embroidered mantle. The canopy and mantle shimmer with motley hues; the five colors swirl. Sun and moon illuminate and inspect, flanking east and west. The divine court resides within the body, dispelling hunger and thirst. The Three and Five return anew, revolving the hidden mechanism. Circulating through the Great One, they harmonize the Two Modes.” This refers to the Celestial Sovereign dwelling within the Grand Clarity, the Great One receiving nourishment, and the Five Spirits presenting the talismanic register—when the adept visualizes the sun and moon flanking and illuminating.\n\nThis central scripture expounds the names and affairs of the Great One; thus, it is recorded here.\n\nAt the hour when *qi* is born at midnight, or at cockcrow, lie supine with eyes closed and gently inhale. Visualize the sun emerging from the left eye and the moon from the right, each nine inches in diameter, positioned above the ears. The space above the ears is called the High Window of the Six Harmonies. Let the sun and moon illuminate the entire body, penetrating inwardly to the Muddy Pellet, then downward to the five viscera and intestines, perceiving all with clarity, thoroughly illuminating within and without. Let the body merge with the light of the sun and moon. After a long while, click the teeth nine times, swallow saliva nine times, and softly intone:\n\n“Supreme Mysterious One, the Nine Augusts exhale their essence. Three, Five, and Seven transform, penetrating the hidden depths. Sun and moon cast their light, descending to the divine court, flanking and illuminating the Six Harmonies. The Great One abides in yellow tranquility. The Imperial Lord commands the writ; the golden script does not falter. The Five Elders present the talisman; heaven and earth unite in sincerity. Grant that I shall not die, attaining true numinosity. Obstruct the myriad evils; calamities and harms be pacified. Ascend to the Celestial Sovereign, returning to youth from old age. By the decree of the Supreme Emperor, the hundred spirits heed with reverence.”\n\nThen open the eyes. This is called “Refining the Root with Sun and Moon,” “The Three Origins Rectifying the Soul,” by which one governs form and spirit, repels all demonic *qi* that may invade, and ensures long life and immortality. Practice this every night.\n\nFurther visualize the left eye as the sun and the right eye as the moon, merging in the divine court, then ascending into the Hall of Light, where they transform into the yellow essence of nectar, flowing into the mouth. Swallow nine times to nourish the Great One. At the hour when *qi* is born, complete the visualization and softly recite:\n\n“Essence of sun and moon, yellow water and lunar radiance, the Great One comes to drink. Divine light soars high; grant me long life, that heaven and earth share the same bough.”\n\nAfter five days of practice, the tongue becomes the divine court. After visualizing the sun and moon, stir the tongue and perceive a yellow spring, like the color of purple gold, flowing from the tongue and ascending into the Hall of Light—this is the nectar of yellow essence. During visualization, close the eyes and banish all thoughts.\n\nOn the evening of the new moon, at the hour when *qi* is born, lie supine with eyes closed and face upward. Visualize twenty-four stars, each one inch in size, linked together. Within each star, visualize a person, totaling twenty-four, all appearing as newborn infants, unclothed. Then, see the twenty-four stars descending from the empty void of the heavens, encircling the body three times. After three circuits, swallow them one by one, totaling twenty-four swallows, each time perceiving the ingestion of a star. Feel them descend directly into the navel, called the Palace of Life Reception. Further perceive the starlight illuminating the abdomen, thoroughly penetrating the five viscera. Visualize the starlight transforming into twenty-four perfected beings, all exhaling yellow *qi* like mist, filling the navel and suffusing within and without. After a long while, softly intone:\n\n“Twenty-four Perfected, return to the Yellow Court. Mouths exhale yellow *qi*; twenty-four stars irrigate my Gate of Life. The hundred spirits receive numinosity; my bones grow strong. Soul and spirit find peace; the five viscera receive the talisman. Heaven and earth incline toward one another.”\n\nThis is called “True *Qi* Entering to Guard the Gate of Life,” dispelling disasters, misfortunes, and the hundred demonic afflictions, granting long life and immortality.\n\nThe Grand Nonbeing merges to resemble the child of the One Numinous Void, becoming the Lord Imperial Sovereign. Dwelling within the Muddy Pellet as the Imperial Sovereign, it becomes the honored sovereign of the Three Ones. This honored sovereign is the child of the Void-Born. These are called the Three Emperors.\n\nThe Great One receives life in the empty cavern, transforming throughout the eight directions, establishing its radiance among the Three Emperors, flowing and converging at the summit of the myriad spirits. The honor of heaven and earth both depend on the Great One for their spontaneous movement. Without the Great One, the Numinous Emperor’s mysterious void would not revolve *qi*; without the Great One, the Honored Emperor’s Three Ones would not reside in their palatial domains. Thus, the spirit of the Great One, together with the Five Spirits, functions in unison, lodging its form within the Three Emperors. The eminence of the Emperor is like that of the Celestial Sovereign and the Lord Emperor.\n\nThe Nine Souls assume form; souls arise from the Three and Five. The Three and Five unite and converge, coalescing into the Imperial Sovereign. Such is the birth of the Emperor.\n\nReceiving the supreme *qi* from the midst of the Mysterious, where the Three and Five separate and unite, it emerges. Thus, the Emperor is born beyond the Ultimate Nonbeing, within the completion of the Mysterious, manifesting in the domain of the Grand Clarity. Its governance resides in the Purple Tenuity Palace of the Jade Clarity. Radiant with five colors, its canopy has nine layers. Before it lies the Cavern of the Muddy Pellet; behind it opens the Dark Gate. Below, it overlooks the Six Harmonies; above, it connects to the purple clouds. A hundred officials stand guard; flying pavilions interlink. Jade halls and vermilion steps contain golden chambers, within which abides the Supreme Perfected, titled the Celestial Sovereign. Born from the void, dwelling in the midst of the Non-Ultimate, clad in a robe of five-colored pearls, crowned with the Nine-Virtue Dawn Crown, it governs the celestial ridge. At times, it rides a six-reined jade dragon, traversing the nine paths of the void with spontaneous ease.",
      "overlap_context": "son Palace. The Three Palaces fuse and transform—this is the Purple Chamber. Where the Purple Chamber resides, it first passes through the Hall of Light. If the adept knows this, they may open the Golden Gate.” The Golden Gate lies within the Cavern Chamber.\n\nIt further says: “Merge and unite them, entering and exiting the Imperial Realm. The Three and Five unite as one—you will surely become an immortal king.” This refers to the moment of fusion, the Way of the Three Perfected and Five Spirits.",
      "start_char": 4068,
      "end_char": 5418,
      "start_sentence": 157,
      "end_sentence": 199,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.728912353515625,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太一帝君丹隐书洞真玄经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "此自然之精炁，众真之帝君，兆常思而诵之，可以为仙王。 太微中有三皇，一曰皇君，二曰天皇，三曰皇老。 此皆三元之炁，自然混成之真也。 三元各是一君，同在太清之中。 太清有三宫，无上为天皇帝君之宫，左为太素宫，右为太和宫，三宫所在，泥丸之门，无极之内。 故皇君御一，总持神刚； 天皇统二，变景守形； 皇老监三，维制万神； 太一混合，成生兆身。 於是三五分化，填满九宫。 故太一之神，为化生之主也。 太素君元成老子，亦天之魂，治在太清之中，勾陈之内，常侍帝君，主真元之炁也。 号曰大素君矣。 太和君皇成老子，天之魄也，亦治太清勾陈之内，号曰太和君，常侍天帝，主胎元之气也。 太素、太和二君，此天地之魂魄，生於自然？ 太素元成老子，太清之中常侍帝君； 皇成老子，常侍天帝，出入紫微，正在昆仑，黄阙紫房，太一相参，混沌三炁，大道之根。 子常思之，帝来长存。 以月二日、三日夜半，存元成皇老之法，安卧闭目，先思太极中皇帝君，次思左有元成老子，衣青衣，冠九华曜冠，左手持青芝，右手执青幡； 次存右有太和君黄成老子，衣白衣，冠五华白冠，左手持金夜浆，右手持白幡，并在太极之中。 太极之中有九名，太清中有五帝六府九官名，其域同一也。 一曰太清，二曰太极，三曰太微，四曰紫房，五曰玄台，六曰帝堂，七曰天府，八曰黄宫，九曰玉京玄都。 要而言之，从人项上直下一寸，为太极宫，太极宫方一寸耳。 太极宫在六合宫之上。 六合宫，太一之神居焉。 从两眉间却入一寸为明堂，却入二寸为洞房，却入三寸为丹田，其明堂之北，洞房之南，两眉之间上一寸，为六合宫。 六合宫方一寸。 存三真人毕，又存我魂一人，如我之状，上入太极宫中，二老因授青芝、金液浆见与，以次存食青芝而饮浆。 青芝似莲华，浆似美酒耳。 饮食都毕，乃己存再拜帝君之前，而言曰： 今日告青帝君在庭，赐以神芝、金液玉浆，二老度籍，太一奉章，长生久视，寿命未央。 又存帝君答曰：幸哉，奉时月二日、三日复来。 毕，因以取服。 名曰受帝之药於紫房之中也。 故《消魔经》曰：魂可求食，上诣太极，二老授命，帝君之力，是此谓也。 存思太极之时，皆当从两眉间而入焉。 两眉间为泥丸之玉门，名曰守寸，黄阙紫房矣。 常以本命日，或正月一日，或以六戊日正中，兆冠带入室，北向再拜，咒曰： 高皇帝君，太上玉晨，皇天元老，无上大道，曾孙王甲，愿帝君长安兆己紫房宫中。 其夜人定时，入密室，正卧冥目上向，存念北斗太极中央大明星，精曜正黄光炁来下，存兆目前，引入口中，咽三十七过止。 存使黄精和炁，填满太仓黄庭中下丹田，下至阴室地户，周行匝体，悉令毕至。 乃又念紫房宫中有五人，欻象成五帝，天皇帝君正在中央，太一来上，当跪帝前，奉兆命藉，司命立后，除兆死录。 存削去死录。 死录，黑简白书也； 生录，白简青书也。 存见白玉之简，曾青之笔，司命进授此白简青笔於帝君，帝君伏南向而书之曰：某郡县乡里王甲，字乙，生简记年，长生上玄，所向如愿，为真为仙，天下见者，皆曰真人，太一可命，保护甲身，永养日月，寿百万年。",
      "translated_text": "This is the essence of spontaneous primordial qi, the Sovereign Lord of all Perfected Ones. Those who constantly contemplate and invoke it may become Immortal Kings.\n\nWithin the Grand Tenuity reside the Three August Ones: the first is the August Lord, the second the Celestial Sovereign, and the third the August Elder. These are all the perfected beings of the Three Origins’ qi, spontaneously coalesced from the primordial chaos. Each of the Three Origins is ruled by one Lord, and together they dwell within the Grand Clarity.\n\nThe Grand Clarity contains three palaces: the supreme is the Palace of the Celestial Emperor Lord; to the left lies the Palace of Grand Simplicity, and to the right the Palace of Grand Harmony. These three palaces are located at the Gate of the Muddy Pellet, within the Non-Ultimate. Thus, the August Lord governs the One, holding fast to the divine刚; the Celestial Sovereign oversees the Two, transforming the luminous and preserving the form; the August Elder supervises the Three, maintaining control over the myriad spirits. The Great One blends and unites them, engendering the adept’s body. Thereupon, the Three and Five divide and transform, filling the Nine Palaces. Thus, the spirit of the Great One is the master of transformative generation.\n\nThe Lord of Grand Simplicity, Yuancheng Laozi, is also the celestial hun-soul, governing within the Grand Clarity and the interior of the Curved Array. He constantly attends the Emperor Lord, presiding over the qi of the primordial origin, and is titled the Lord of Grand Simplicity. The Lord of Grand Harmony, Huangcheng Laozi, is the celestial po-soul, also governing within the Grand Clarity and the interior of the Curved Array. He is titled the Lord of Grand Harmony and constantly attends the Celestial Emperor, presiding over the qi of the embryonic origin.\n\nThe two Lords, Grand Simplicity and Grand Harmony, are the hun and po of Heaven and Earth, born of spontaneity. Yuancheng Laozi, within the Grand Clarity, constantly attends the Emperor Lord; Huangcheng Laozi constantly attends the Celestial Emperor, moving in and out of the Purple Tenuity, residing precisely upon Kunlun, within the Yellow Gate and Purple Chamber. The Great One intermingles with them, the three qi of primordial chaos forming the root of the Great Dao. If you constantly contemplate this, the Emperor will abide with you forever.\n\nOn the second and third nights of the month, at midnight, practice the method of visualizing Yuancheng Huanglao. Lie down, close your eyes, and first envision the Central August Emperor Lord within the Supreme Ultimate. Next, visualize to the left the Elder Yuancheng Laozi, clad in a green robe, wearing the Nine-Splendor Radiance Crown, holding green lingzhi in his left hand and a green banner in his right. Then visualize to the right the Lord of Grand Harmony, Huangcheng Laozi, dressed in a white robe, wearing the Five-Splendor White Crown, holding golden night-essence in his left hand and a white banner in his right, both within the Supreme Ultimate.\n\nWithin the Supreme Ultimate are nine names; within the Grand Clarity are the Five Emperors, Six Treasuries, and Nine Palaces—these domains are one and the same. They are: first, the Grand Clarity; second, the Supreme Ultimate; third, the Grand Tenuity; fourth, the Purple Chamber; fifth, the Dark Terrace; sixth, the Emperor’s Hall; seventh, the Celestial Treasury; eighth, the Yellow Palace; and ninth, the Jade Capital and Dark Metropolis.\n\nIn short, one *cun* directly downward from the nape of the neck lies the Palace of the Supreme Ultimate, which is one *cun* square. The Palace of the Supreme Ultimate is above the Palace of the Six Harmonies. The Palace of the Six Harmonies is where the spirit of the Great One resides. One *cun* inward from the space between the eyebrows is the Hall of Light; two *cun* inward is the Cavern Chamber; three *cun* inward is the Cinnabar Field. North of the Hall of Light and south of the Cavern Chamber, one *cun* above the space between the eyebrows, lies the Palace of the Six Harmonies, which is one *cun* square.\n\nAfter visualizing the Three Perfected Ones, next visualize your own hun-soul, in your own likeness, ascending into the Palace of the Supreme Ultimate. The two Elders then bestow upon you green lingzhi and golden liquid-essence. Proceed to visualize consuming the green lingzhi and drinking the essence. The green lingzhi resembles a lotus blossom, and the liquid-essence resembles fine wine. After consuming them, visualize yourself bowing twice before the Emperor Lord and saying: “Today, I report to the August Lord of the Green Emperor in the court. You have bestowed upon me divine lingzhi and golden liquid jade-essence. The two Elders have transmitted the register; the Great One has presented the writ. May I attain long life and enduring vision, my lifespan without end.”\n\nThen visualize the Emperor Lord replying: “Fortunate one, return on the second and third nights of the next month.” Once this is complete, proceed to ingest the elixir. This is called “receiving the Emperor’s medicine within the Purple Chamber.”\n\nThus, the *Scripture on Dispelling Demons* states: “The hun-soul may seek sustenance, ascending to the Supreme Ultimate. The two Elders confer destiny; this is the power of the Emperor Lord.” This is what it refers to.\n\nWhen visualizing the Supreme Ultimate, always enter through the space between the eyebrows. The space between the eyebrows is the Jade Gate of the Muddy Pellet, called “Guarding the Inch,” the Yellow Gate and Purple Chamber.\n\nOn your natal day, or the first day of the first month, or at noon on any of the six *wu* days, don your cap and sash, enter your chamber, face north, and bow twice. Recite the incantation: “August Emperor Lord, Supreme Jade Dawn, Primordial Elder of August Heaven, Unsurpassed Great Dao, your humble descendant Wang (surname) of Jia (generation name), wishes the Emperor Lord eternal peace within my Purple Chamber Palace.”\n\nAt the hour of *ren ding* (night’s quietude), enter a secluded chamber, lie down properly, close your eyes, and face upward. Visualize the great bright star at the center of the Northern Dipper and the Supreme Ultimate, its essence radiant with pure yellow qi descending. Draw it before you and guide it into your mouth, swallowing thirty-seven times before stopping. Visualize the yellow essence and qi filling your Grand Granary, the Yellow Court, the lower Cinnabar Field, and descending to the Earth Gate of the Yin Chamber, circulating throughout your entire body until all is complete.\n\nThen visualize five persons within the Purple Chamber Palace, suddenly transforming into the Five Emperors. The Celestial Emperor Lord stands at the center. The Great One ascends and kneels before the Emperor, presenting your life register. The Director of Destinies stands behind, removing your death record. Visualize erasing the death record. The death record is a black tablet with white writing; the life record is a white tablet with green writing. Visualize a white jade tablet and a green malachite brush. The Director of Destinies advances and presents this white tablet and green brush to the Emperor Lord. The Emperor Lord faces south and writes: “Wang (surname) of Jia (generation name), from such-and-such prefecture, county, village, and hamlet, born in such-and-such year, shall ascend to the Supreme Mystery, attain all desires, become a Perfected One and an Immortal. All under Heaven who see him shall call him a Perfected One. The Great One may command him, protecting his body, eternally nurturing him with the sun and moon, granting him a lifespan of a million years.”",
      "overlap_context": "nects to the purple clouds. A hundred officials stand guard; flying pavilions interlink. Jade halls and vermilion steps contain golden chambers, within which abides the Supreme Perfected, titled the Celestial Sovereign. Born from the void, dwelling in the midst of the Non-Ultimate, clad in a robe of five-colored pearls, crowned with the Nine-Virtue Dawn Crown, it governs the celestial ridge. At times, it rides a six-reined jade dragon, traversing the nine paths of the void with spontaneous ease.",
      "start_char": 5418,
      "end_char": 6642,
      "start_sentence": 200,
      "end_sentence": 245,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.91056704521179,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太一帝君丹隐书洞真玄经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "又心存籍简一枚，令长一寸，广五分耳。 思念书，字，极令了了。 又次存太一、公子、白元、司命、桃君五人，从六合宫中，上入紫房，入紫房中，各奉青玉案，案上各有一符，符各有青绿色，以呈帝君，帝君以次取符，付向者，共化之四帝。 其一帝名曰雕梁际，字青平； 其一帝名长来觉，字南和； 其一帝名彰安幸，字西华； 其一帝名保成曷，字北伐。 存此四帝，并共读五符。 读五符毕，因授以与兆，兆得符，即跪帝君前，以次服之。 存一符令长一寸，广五分耳。 即毕，又存四帝从虚空中，上升三天，临去各告兆曰：子能常存我名字者，则辟万害，长生不死，我太上之子，三元之内真，度汝命籍五符入形，故以永存天地，以致仙灵也。 若春月也，则存青平帝，以青液之醴，盛以青玉椀一升，见与服之，服之毕，四帝俱上升三天也。 若夏月也，则存南和帝，其四时仿此矣。 所服之醴椀，亦随春夏秋冬之色耳。 又存帝君之左有玄一老子，服紫衣，建龙冠。 又存帝君之右有三素老君，服锦衣，建虎冠。 夫龙虎之冠，象如世间远游冠，而有龙虎之文章也。 玄一老子名林虚夫，字灵时道。 三素老君名牢张上，字神生道。 二老并从正一仙人在后，其左仙人仲成子，一名帝宾，字四华：其右仙人曲文子，一名光坚，字灵和，服色衣冠亦如二老之状。 毕，又存司命下至六合中，诣太一宫，司命合形太一，太一复上请帝君，度兆符籍。 太一启帝君曰：符籍已度，司命合形，四帝赐醴，高上记生，乞得书名，出箓以付二老君。 於是帝君忽於怀中出兆命籍，付左老子，又於怀中出兆五符，付右老君。 二老受符籍，而言於帝君曰：某甲生录已定，长存世上，帝符五行上记太素宫。 於是二老命二正一仙人仲成子、曲文子，赉某甲命籍五符，上诣玉清太素太上三元上清高玄诸君九天宫，宣令帝度某甲生籍，使得神仙，号曰真贤，二老有命，皆使记焉。 於是二人赉兆符籍，由曰一于九天，良久都毕。 又存司命、太一分形，各为一人，共游行太清，检御一体百神，上下既匝，各还其宫。 名此为百神混合本命帝君大变之道。 五帝定录之时，二老定生之会也。 混合本命之时，众事烦多，不能诣识者，可密室按文读而为之。 其三一之神，泥丸丹田宫，别有天帝君，是紫房帝君之子也。 混合本命时，先存在三一天帝、绛宫、命门三神，各安其宫，此宫别有三一经也。 今所混合万变者，非三一之天帝也。 三一天帝，自复有混合之时耳，别各有异法，法任不同也。 帝君主变，太一主生，司命主命，无英主精，白元主魂魄，桃康主神灵。 人有五籍五符，禀之帝君，五神执之，各主其一，间关本命，除死上生。 而无太一之事者，万不生也。 虽复志道求生，精诚虚尽，亦无益也。 纵复有至德天地，功显三官，柔仁之行，感彻万神，不知思存皇君，内修三五，还五籍奉五符，令太一诣帝君请兆求仙，终不能过度七九之中，上补仙官矣。 诸帝一君二老，及三真五神名字，慎不可以示人，祸灭子门矣。 太一宝诀，待盟乃传。 宝诀者，洞真玄经也。 先审其人，然后乃以金青为誓，以代敌血之盟也。 又日日心存，常令三魂入在太极宫，与帝君周旋为佳也。",
      "translated_text": "Moreover, visualize a register tablet, one piece, one *cun* in length and five *fen* in width. Concentrate intently upon inscribing its characters, ensuring each is vividly clear.\n\nNext, visualize the Five: Taiyi, Gongzi, Baiyuan, Siming, and Taojun, ascending from the Palace of the Six Harmonies into the Purple Chamber. Within the Purple Chamber, each presents a green jade tray, upon which lies a talisman, each inscribed in shades of azure and verdant green. They offer these to the Emperor Lord, who takes the talismans in turn and bestows them upon the aforementioned, transforming them into the Four Emperors.\n\nThe first Emperor is named Diaoliangji, styled Qingping;\nthe second, Changlaijue, styled Nanhe;\nthe third, Zhang’anxing, styled Xihua;\nthe fourth, Baochenghe, styled Beifa.\n\nVisualize these Four Emperors together reciting the Five Talismans. Upon completing the recitation, they present the talismans to you. Receiving them, you kneel before the Emperor Lord and ingest them in sequence. Visualize each talisman as one *cun* in length and five *fen* in width.\n\nOnce this is done, visualize the Four Emperors ascending through the void into the Three Heavens. As they depart, each addresses you: “Should you constantly hold our names in mind, you shall avert all harm, attain longevity without death, for we are the children of the Supreme One, the Perfected within the Three Primes. We transmit the Five Talismans into your form, that you may endure eternally between Heaven and Earth and achieve transcendence.”\n\nIf it is spring, visualize the Emperor Qingping, offering a goblet of azure nectar, one *sheng* in volume, served in a green jade bowl, for you to drink. After partaking, the Four Emperors ascend together into the Three Heavens. The same pattern applies for summer, autumn, and winter, with the colors of the nectar and bowls corresponding to the season.\n\nFurther, visualize to the left of the Emperor Lord the Elder of Dark Unity, clad in purple robes and crowned with a dragon coronet. To his right stands the Elder of the Three Purities, dressed in brocade and crowned with a tiger coronet. These dragon and tiger coronets resemble the *yuanyou* crowns of the mundane world, adorned with dragon and tiger motifs.\n\nThe Elder of Dark Unity is named Lin Xufu, styled Lingshi Dao.\nThe Elder of the Three Purities is named Lao Zhangshang, styled Shensheng Dao.\n\nBoth Elders are accompanied by Orthodox Unity Immortals: to the left, Zhong Chengzi, also named Dibin, styled Sihua; to the right, Qu Wenzi, also named Guangjian, styled Linghe. Their attire and crowns mirror those of the two Elders.\n\nNext, visualize Siming descending into the Palace of the Six Harmonies to approach the Taiyi Palace. Siming unites with Taiyi, and Taiyi ascends to petition the Emperor Lord to transmit your talismanic register. Taiyi addresses the Emperor Lord: “The talismanic register has been transmitted, Siming has united with the form, the Four Emperors have bestowed the nectar, and the Supreme One has recorded your life. We request that your name be inscribed and the register be issued to the Two Elder Lords.”\n\nThereupon, the Emperor Lord suddenly produces your life register from his bosom and presents it to the Left Elder. From his bosom, he also produces your Five Talismans and hands them to the Right Elder. The Two Elders receive the talismans and register, then declare to the Emperor Lord: “The life record of so-and-so is now fixed, ensuring his eternal existence in the world. The Five Talismans of the Emperor are recorded above in the Palace of Grand Simplicity.”\n\nThe Two Elders then command the Two Orthodox Unity Immortals, Zhong Chengzi and Qu Wenzi, to bear your life register and Five Talismans upward to the Jade Purity, Grand Simplicity, Supreme Three, Upper Clarity, Lofty Mystery, and the Nine Heavens’ Palaces. They proclaim the Emperor’s decree to transmit your life register, enabling your attainment of divine transcendence, and bestow upon you the title of Perfected Worthy. The Two Elders issue their commands, and all is duly recorded. The two Immortals then ascend with your talismans and register through the Nine Heavens, and after a long while, all is accomplished.\n\nNext, visualize Siming and Taiyi separating their forms, each becoming distinct, and together roaming the Grand Clarity, inspecting and governing the hundred spirits of the body. Once their circuit is complete, they return to their respective palaces. This is called the Great Transformation of the Original Destiny Emperor Lord through the Union of the Hundred Spirits.\n\nWhen the Five Emperors establish the record and the Two Elders determine life, it is the moment of the Union of Original Destiny. During this union, the affairs are numerous and complex; if you cannot fully comprehend them, you may perform the rites in a secluded chamber, following the text as you recite.\n\nThe Three Ones’ deities—the Heavenly Emperor of the Mud-Pill Palace, the Heavenly Emperor of the Cinnabar Palace, and the Heavenly Emperor of the Gate of Destiny—each reside in their respective palaces. These are the sons of the Purple Chamber Emperor Lord. During the Union of Original Destiny, first visualize the Three Heavenly Emperors of the Three Ones, each settled in their palaces. These palaces have their own Three Ones’ scriptures. The myriad transformations of the Union described here do not pertain to the Three Ones’ Heavenly Emperors. The Three Ones’ Heavenly Emperors have their own times of union, each with distinct methods and practices.\n\nThe Emperor Lord presides over transformation, Taiyi over life, Siming over destiny, Wuying over essence, Baiyuan over the hun and po souls, and Taokang over the numinous spirit. Each person possesses Five Registers and Five Talismans, bestowed by the Emperor Lord and held by the Five Spirits, each governing one aspect. These safeguard your original destiny, erasing death and ascending to life. Without the affairs of Taiyi, none can attain life. Even if one aspires to the Dao, seeks life with utmost sincerity, and exhausts all emptiness, it will be of no avail. Though one may possess virtue surpassing Heaven and Earth, merits renowned in the Three Bureaus, and a nature of utmost gentleness that moves the myriad spirits, without contemplating and holding fast to the August Lord, inwardly cultivating the Three and Five, returning the Five Registers and presenting the Five Talismans, and causing Taiyi to petition the Emperor Lord on your behalf to seek transcendence, you will ultimately be unable to transcend the seventy-nine trials and ascend to fill the ranks of the Immortal Offices.\n\nThe names of the various Emperors, the One Lord, the Two Elders, and the Three Perfected and Five Spirits must not be disclosed to others, lest calamity befall your family. The precious instructions of Taiyi are transmitted only after a covenant. These precious instructions are the *Scripture of the Wondrous Perfection of the Cavernous Mystery*. First, scrutinize the recipient, then swear an oath with gold and azure, replacing the blood covenant.\n\nMoreover, daily visualize your Three Hun souls entering the Palace of the Supreme Ultimate, where they may companion the Emperor Lord—this is most excellent.",
      "overlap_context": " brush to the Emperor Lord. The Emperor Lord faces south and writes: “Wang (surname) of Jia (generation name), from such-and-such prefecture, county, village, and hamlet, born in such-and-such year, shall ascend to the Supreme Mystery, attain all desires, become a Perfected One and an Immortal. All under Heaven who see him shall call him a Perfected One. The Great One may command him, protecting his body, eternally nurturing him with the sun and moon, granting him a lifespan of a million years.”",
      "start_char": 6643,
      "end_char": 7861,
      "start_sentence": 246,
      "end_sentence": 289,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.667983293533325,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太一帝君丹隐书洞真玄经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "又常以本命日、勿言恶事，当闭室存生之炁，得为善行，慎勿违之矣。 太一者，胞胎之精，变化之主。 魂魄生於胎神，命气出於胞府，变合帝君，混化为人。 故太一之神，生之母； 帝君之尊，生之父。 太一名务犹收，字归会昌，又一名解明，一名寄频。 此三元洞玄内宝经之真名字，外诀杂钞云云之名，皆非实非真也。 今此名字，甚不可告人，自知之者，长生不死，辟却万祸，能致神灵玉女来降已矣。 夕夕当存太一在己身中六合宫，或存太一在兆左右，坐卧背向无不在也。 皆以生炁时存之毕，咒曰： 太一之精，起於太清，魂魄受化，形影为灵，摄御百神，拘制三阳，帝君主烟，合真会昌，内安精炁，外禳灾殃，却除死籍，延命、水长，衣服老少，变易无常，常治六合，周旋绛宫，下达洞门，上到玄乡，混合三五，游息天庭，呼引日月，变化雌雄，摄兆符籍，胞胎之囊，死生之命，太一扶将。 存太一与兆形正同，衣服亦同也。 是以兆之身常当斋洁而修盛，以求会景於太一也。 衣服巾物，一不得假借於不同炁者，诸如此类，皆当慎之。 子既不能服食去谷，精思研真矣，当节诸躁秽，腥血杂食荤辛之菜，一为禁绝。 若能如此，少以愈矣，可以庶生命之长矣。 左无英公子，结精田之主，三元上炁之神，结精田於天精，精生归於三炁矣。 故无英公子常摄精神之符命也。 名玄元叔，字合符子，又一名元素君，一名神公子，常在玉房上清之内。 夕夕存思之，毕，咒曰： 太上玉真，皇精相连，三元英炁，太玄紫晨，九霄挺明，五华生烟，黄阙金室，中有大神，握固流铃，首建华冠，紫盖回飙，龙文虎文，貌状婴儿，四灵同均，出丹入虚，合形帝君，呼阴召阳，天道有真，名曰玄元叔，号为无英君，周流九道，散化五常，生我扶我，与道长存。 右白元君者，或曰洞阳君也，主摄魂魄之炁、检御灵液之神。 故魂魄生於九灵之宫，神液运於三炁之真，是以主御之者，号曰白元洞阳君，摄持魂魄之符命焉。 白元君名郁灵标，字玄夷绝，又一名朱精，一名启成，治在玉堂上清之内。 夕夕存思毕，咒曰： 太上神精，高清九君，三炁结变，正当神门，龙衣虎带，扶命还魂，腰佩玉书，黄晨华冠，把籍持符，呼吸混分，名曰郁灵，号曰白元，与我俱游，上到阳关，周旋九清，六合之中，下养精液，泥丸上元，百神扶将，各镇宝宫，检御既毕，还安黄房。 中央司命君者，或曰制命丈人，主生年之本命，摄寿夭之简札，太一变魂而符列司命，司命混合而对魂帝君。 故司命之神，主典年寿魁柄长短之期，是以混合之大，以符籍而由之，故称丈人焉。 名理明初，字玄度乡，一名神宗，一名灵华，白日治幽极宫，通御阴房，出入神庐两门中； 夕治在玄室，地户之中，幽宫之下，六合宫之上一界中耳。 阴房者，是鼻之两孔中也。 司命出入，当由鼻孔，不从两眉间也。 夕在玄室，为玉茎之中，地户亦为阴囊中也。 若女子存之，令在阴门之内北极中。 夕夕存思焉，存毕，咒曰： 皇一之魂，化成九宫，混合三真，变景帝庭，幽极玄户，中有天灵，周旋七运，百神合成，摄筹把算，司命之精，龙衣虎裙，冠巾七星，常在我已，安存我形，号为丈人，名曰理明，上通符命，使我长生，三元六府，万关调平，摄御灵炁，与兆合并，龙轮徘徊，共登太清，齐光日月，幽幽冥冥，刻命青录，天地俱倾。",
      "translated_text": "Moreover, on your natal day, you must refrain from speaking of inauspicious matters. Instead, seclude yourself in a chamber and visualize the qi of life, performing virtuous deeds. Take care never to transgress this.\n\nTaiyi is the essence of the embryonic sac and the master of transformation. The hun and po souls are born of the womb spirit, while the life qi emerges from the uterine palace, uniting with the Emperor Lord to blend and transform into a human being. Thus, the spirit of Taiyi is the mother of life, and the majesty of the Emperor Lord is its father.\n\nTaiyi is named *Wuyou Shou*, styled *Gui Huichang*, and also called *Jieming* or *Jipin*. These are the true names recorded in the *Three Primordials Cavern Mystery Inner Treasure Scripture*. The names found in external manuals and miscellaneous compilations are neither authentic nor real. These true names must never be disclosed to others. Those who know them shall attain longevity and immortality, repel all calamities, and summon divine spirits and jade maidens to descend.\n\nEach evening, visualize Taiyi within your Six Harmonies Palace, or at your side, whether sitting or lying down, facing any direction. When visualizing the qi of life, complete the invocation thus:\n\n*\"The essence of Taiyi arises from the Grand Clarity.\nHun and po receive transformation, form and shadow become spirit.\nIt commands the hundred spirits, restrains the Three Yang.\nThe Emperor Lord presides over mist, uniting with the Perfected in Huichang.\nWithin, it stabilizes essence and qi; without, it wards off disasters and misfortunes.\nIt expunges the register of death, extends life, and ensures eternal youth.\nClothing and appearance, youth and age, shift without constancy.\nIt ever governs the Six Harmonies, circling the Crimson Palace,\nDescending to the Cavern Gate, ascending to the Mysterious Realm.\nBlending the Three and Five, it roams and rests in the Celestial Court,\nSummoning the sun and moon, transforming yin and yang.\nIt seizes your talismanic register, the sac of the embryo,\nThe mandate of life and death—Taiyi upholds and guides you.\"*\n\nVisualize Taiyi’s form as identical to your own, even in clothing. Therefore, your body must always be purified and cultivated to seek union with the radiant Taiyi. Do not share garments, headscarves, or belongings with those of differing qi. Observe such precautions diligently.\n\nIf you cannot practice grain avoidance through diet or refine the truth through concentrated meditation, you must at least abstain from all impure, bloody, or foul foods—meats, pungent herbs, and the like—completely. If you can do this, even briefly, you will improve, and your lifespan may be extended.\n\nThe Left Azure Lad is the master of the Field of Essence, the spirit of the Upper Qi of the Three Primordials. He binds the Field of Essence to the Celestial Essence, where essence is born and returns to the Three Qi. Thus, the Left Azure Lad ever holds the talismanic mandate of spirit and essence. He is named *Xuan Yuan Shu*, styled *He Fu Zi*, and also called *Yuan Su Jun* or *Shen Gong Zi*. He resides within the Jade Chamber of the Upper Clarity. Each evening, after visualizing him, recite the invocation:\n\n*\"Supreme Jade Perfected, imperial essence linked,\nThree Primordials’ azure qi, Grand Mystery’s purple dawn.\nNine Empyreans rise in brilliance, Five Florets generate mist.\nWithin the Yellow Watchtower’s golden chamber stands a great spirit,\nGrasping fast the flowing bell, crowned with a floral diadem.\nA purple canopy swirls in the whirlwind, adorned with dragon and tiger patterns.\nHis countenance resembles a child’s, the Four Numinous in harmony.\nEmerging from cinnabar, entering the void, he unites form with the Emperor Lord.\nSummoning yin, calling forth yang, the Dao of Heaven holds truth.\nNamed Xuan Yuan Shu, styled the Azure Lad,\nHe traverses the Nine Paths, dispersing and transforming the Five Constants.\nHe engenders me, sustains me, and abides with the Dao forever.\"*\n\nThe Right White Prime is also called the Cavern Yang Lord. He governs the qi of the hun and po souls and oversees the spirit-fluid numen. Thus, the hun and po are born in the Palace of the Nine Numinous, while the spirit-fluid circulates through the truth of the Three Qi. The one who presides over them is named the White Prime Cavern Yang Lord, holding the talismanic mandate of the hun and po. The White Prime is named *Yu Ling Biao*, styled *Xuan Yi Jue*, and also called *Zhu Jing* or *Qi Cheng*. He resides within the Jade Hall of the Upper Clarity. Each evening, after visualizing him, recite the invocation:\n\n*\"Supreme divine essence, lofty and pure, Nine Lords,\nThree Qi congeal and transform, aligned with the Gate of Spirit.\nClad in dragon robes, girded with tiger belts, he restores life and revives the hun.\nAt his waist hangs the Jade Scripture, crowned with the Yellow Dawn’s floral diadem.\nHolding the register and talisman, he breathes and blends the mixed divisions.\nNamed Yu Ling, styled White Prime,\nHe roams with me, ascending to the Yang Barrier,\nCircling the Nine Clarities, within the Six Harmonies.\nBelow, he nourishes essence and fluid; above, the Mud Pill’s Upper Prime.\nThe hundred spirits uphold and guide, each guarding its treasure palace.\nOnce the inspection is complete, he returns to rest in the Yellow Chamber.\"*\n\nThe Central Controller of Destiny is also called the Lifespan-Regulating Elder. He governs the root of one’s natal year and holds the records of longevity and early death. Taiyi transforms the hun and arranges the talismans under the Controller of Destiny, while the Controller of Destiny blends with the hun to face the Emperor Lord. Thus, the Controller of Destiny oversees the tally of years, the handle of lifespan’s length or brevity. Through the great blending of talismanic registers, he is called the Elder. He is named *Li Ming Chu*, styled *Xuan Du Xiang*, and also called *Shen Zong* or *Ling Hua*. By day, he governs the Darkest Palace, communicating with the Yin Chamber and moving in and out through the two gates of the Spirit Hut. By night, he resides in the Mysterious Chamber, within the Earth Gate, below the Dark Palace, and above the Six Harmonies Palace—one realm between them.\n\nThe Yin Chamber refers to the two nostrils. The Controller of Destiny enters and exits through the nostrils, not between the eyebrows. At night, he resides in the Mysterious Chamber, which is the Jade Stem (penis), while the Earth Gate is the scrotum. For women visualizing this, locate him within the northern extreme of the Yin Gate. Each evening, visualize him and, upon completion, recite the invocation:\n\n*\"The imperial hun of the One transforms into the Nine Palaces,\nBlending the Three Perfected, shifting radiance in the Emperor’s court.\nDarkest Palace, Mysterious Gate, within lies the celestial numen,\nCircling the Seven Revolutions, the hundred spirits unite.\nHolding the tally, grasping the reckoning, the essence of the Controller of Destiny,\nClad in dragon robes, girded with tiger skirts, crowned with the Seven Stars’ headscarf.\nEver within me, stabilizing my form,\nStyled the Elder, named Li Ming,\nHe ascends to communicate with the talismanic mandate,\nGranting me long life.\nThe Three Primordials and Six Palaces, the ten thousand gates harmonized,\nCommanding the spirit qi, uniting with me,\nThe dragon wheel lingers, together we ascend to the Grand Clarity,\nEqual in radiance to the sun and moon,\nProfound and obscure, inscribing life in the azure register,\nHeaven and Earth both incline.\"*",
      "overlap_context": "t not be disclosed to others, lest calamity befall your family. The precious instructions of Taiyi are transmitted only after a covenant. These precious instructions are the *Scripture of the Wondrous Perfection of the Cavernous Mystery*. First, scrutinize the recipient, then swear an oath with gold and azure, replacing the blood covenant.\n\nMoreover, daily visualize your Three Hun souls entering the Palace of the Supreme Ultimate, where they may companion the Emperor Lord—this is most excellent.",
      "start_char": 7861,
      "end_char": 9160,
      "start_sentence": 290,
      "end_sentence": 325,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.94814324378967,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太一帝君丹隐书洞真玄经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "命门桃君者，摄禀炁之命，此始炁之君也。 还精归神，回精变白，合化规始，挺生立肇，寔天地之资元，阴阳之灵宗，金门玉关房户之宝，并制命於桃君之炁也。 故太一还景，帝君合魂，还景者俱混同以万变，合魂者化精液而生生也。 精变之始，由桃君而唱，以别男女之兆焉。 桃君名孩道康，字合精延，一名命玉，一名胞根。 白日治在金门五域之中，是为脐中命门，下丹田之宫也； 夕治在六合中，太一之右焉。 夕夕存思毕，乃祝曰： 玄元结精，虚无合烟，胞胎之结，阴阳之亲，太上三炁，下入兆身，百节受灵，万神各陈，混沌为一，名为桃君，形如始生，晖晖冲天，衣服五色，华彩风文，手执神符，合帝之魂，腰带虎书，赤巾丹冠，金林玉榻，正当命门，口吸精炁，强我骨节，右有神女，手把朱幡，左有玉童，书记帝言，阳黑左行，混变未分，阴炁右过，流行七旋，下至无下，上诣泥丸，常游九宫，出入幽门，摄炼魂魄，六府之间，领录万神，与我俱仙。 右三五混合化生五神之法。 此五神者，禀五炁之大灵，符玄命之宗也。 上生虚无，下结一身，身中之生生，须五神以起居焉。 兆当夕夕存思而祝之焉。 若不能暗讽，可白日按文而修之，不必夜半，要生炁时耳。 夫三魂生於五神，三真出於五灵，故谓此道为混合三五之法焉。 行之者长生不死，名此道曰北察明堂历神紫宫，生化三五朝胎上元者也。 虽已得仙者，亦当行之，行之者常生也。 存思之时，坐卧任意，若坐者得向本命为佳。 若不能顿思五神者，可以次先存二神，后存三神，周而复始，先从太一始也。 夫精思存念，欲得至清至静幽房闲室，若山林之中，不与人接声，秽浊炁所不闻，乃可行之。 先念三五混合之法讫，乃又闭目内视，叩齿九通，咽液九过，乃微咒曰： 九元之真，真有三田，云房金室，中有五灵，拘制威刚，变化幽冥，回匝玄镜，周纬天地，三五复反，混合太清，阳炁流润，化入无名，与我俱仙，上至神庭，日月相望，三光浑形，越出八极，头冠天精，左旋右顾，手把七星，隐身太微，元始炁并。 咒毕，又存五神各安坐其宫，五神并吐紫炁以缠我身，觉紫炁郁郁然也，内外冥合，手足不相见者，乃止。 又存日月出我左右颊间，左日右月，二光洞照，於是紫炁豁然而除。 又存日上入我口中，即食之，食之作味，九咽止。 又存月入我脐中，当命门下，照阴室之间。 又存我手把北斗七星之柄，戴以行步，入紫房太微宫中，见帝君。 帝君曰：子之得神仙，子之得长年，我以子上青玉之符，书九有之天。 我再拜曰：乞隐息太微，合景太一，列侍帝君，周旋灵室。 帝君即召太一，太一来帝君前，我又入太一口中焉。 合形一景，与太一共为一身体，良久都毕。 名此为混合太清，化入无名，日月相望，手把七星，同形太一，隐身帝庭者也。 存念五神都毕，咒文内视所思都讫，乃开目啄齿五过，以左手第三指蹑鼻下人中七过，以右手第二指蹑两眉间九过，此为却辔三五七九，封制百神门户之法，令百神安兆宫室，三真固兆一体，五神守兆符命，帝君监兆万阙也。 施行之毕，又祝曰： 三五相反天覆地始，我有五符、上归帝子，三元长留，营室之裹，五色",
      "translated_text": "The Peach Lord of the Gate of Life governs the mandate of received qi, being the Lord of Primordial Qi. Returning essence to spirit, refining essence into whiteness, merging to transform the primal circle, standing forth at the inception—truly the resource of Heaven and Earth, the numinous origin of yin and yang. The treasure of the Golden Gate, Jade Pass, and Chamber’s Portal all submit their mandate to the qi of the Peach Lord.\n\nThus, when the Great One returns the radiance, the Imperial Lord unites the hun-souls. \"Returning the radiance\" means blending all transformations as one; \"uniting the hun-souls\" means transmuting essence-fluid to engender life. The inception of essence-transformation is intoned by the Peach Lord, thereby distinguishing the signs of male and female.\n\nThe Peach Lord is named Child Dao-Kang, styled Harmonizing Essence-Prolonging, also called Mandate Jade or Womb Root. By day, he governs within the Five Domains of the Golden Gate—this is the Gate of Life at the navel’s center, the palace of the Lower Cinnabar Field. By night, he governs within the Six Harmonies, to the right of the Great One.\n\nEach evening, after completing the visualization, recite the incantation:\n\"Mysterious Origin congeals essence, Void unites with mist,\nThe knot of the womb-chamber, the intimacy of yin and yang,\nThe Three Supreme Qi descend into my body,\nA hundred joints receive numen, ten thousand spirits each arrayed,\nChaos merged as one, named the Peach Lord,\nFormed as at first birth, radiant and soaring to Heaven,\nClad in five-colored robes, adorned with phoenix-patterned splendor,\nHolding the divine talisman, uniting the Imperial Lord’s hun-soul,\nGirded with tiger-script sash, crowned with red kerchief and cinnabar cap,\nSeated on golden grove and jade couch, directly before the Gate of Life,\nMouth inhaling essence-qi, strengthening my bones and joints,\nTo the right, a divine maiden holds a vermilion banner,\nTo the left, a jade lad records the Imperial Lord’s words,\nYang qi moves leftward, chaos undivided,\nYin qi passes rightward, flowing through seven revolutions,\nDescending to the lowest depths, ascending to the Muddy Pellet,\nEver roaming the Nine Palaces, entering and exiting the Dark Gate,\nRefining hun and po between the Six Palaces,\nRegistering the ten thousand spirits, ascending with me as immortals.\"\n\nThe above is the method of the Three and Five merging to transform and engender the Five Spirits. These Five Spirits receive the great numen of the Five Qi and accord with the origin of the Mysterious Mandate. Above, they engender the Void; below, they congeal the singular body. The life-within-life of the body requires the Five Spirits for its arising and abiding.\n\nEach evening, the practitioner should visualize and recite this. If unable to recite silently, one may follow the text by day—it need not be at midnight, but rather when the qi of life arises. The three hun-souls are born of the Five Spirits, and the Three Perfected emerge from the Five Numinous Ones; thus, this Way is called the Method of Merging the Three and Five.\n\nThose who practice it attain long life without death. This Way is named \"The Northern Inspection of the Luminous Hall, Traversing the Purple Palace, Engendering and Transforming the Three and Five to Audience at the Upper Primordial.\" Even those who have already attained immortality should practice it, for those who practice it abide in eternal life.\n\nDuring visualization, one may sit or recline as desired. If sitting, it is best to face one’s natal direction. If unable to visualize all Five Spirits at once, one may first visualize two, then three, cycling through them, beginning with the Great One.\n\nWhen concentrating in visualization, one should seek utmost purity and stillness in a secluded chamber or quiet room—if in the mountains or forests, where no human voices or defiled qi can be heard—before practicing. After completing the visualization of the Three and Five merging, close the eyes and inwardly gaze, knock the teeth nine times, and swallow saliva nine times. Then softly recite the incantation:\n\n\"Perfected of the Nine Origins, truly possessing Three Fields,\nCloud chambers and golden halls, within dwell the Five Numinous Ones,\nCommanding awe and might, transforming the dark and hidden,\nEncompassing the Mysterious Mirror, weaving through Heaven and Earth,\nThree and Five revert and return, merging with the Grand Clarity,\nYang qi flows and moistens, transforming into the Nameless,\nAscending with me as immortals, reaching the Divine Court,\nSun and moon gaze upon each other, the Three Luminaries blend their forms,\nTranscending the Eight Extremes,\nCrowned with Heaven’s essence, turning left and glancing right,\nHolding the Seven Stars, concealing the body in the Grand Tenuity,\nUniting with the Primordial Qi of the Origin.\"\n\nAfter reciting the incantation, visualize the Five Spirits each seated in their palaces. The Five Spirits all exhale purple qi to coil around the body until the purple qi is dense and obscure, and inner and outer merge indistinguishably—hands and feet no longer visible—then cease.\n\nNext, visualize the sun and moon emerging from the left and right cheeks, the sun on the left and the moon on the right, their two lights penetrating and illuminating, whereupon the purple qi suddenly disperses.\n\nThen visualize the sun entering your mouth and consume it, savoring its sweetness, swallowing nine times before stopping. Next, visualize the moon entering your navel, below the Gate of Life, illuminating the chamber of yin.\n\nThen visualize yourself grasping the handle of the Northern Dipper’s Seven Stars, wearing them as you walk into the Purple Chamber of the Grand Tenuity Palace to meet the Imperial Lord. The Imperial Lord says: \"You have attained divine transcendence, you have attained long years. I inscribe for you the Azure Jade Talisman, writing upon the Nine Heavens.\"\n\nI bow twice and say: \"I beseech to conceal and rest in the Grand Tenuity, merge radiance with the Great One, arrayed in attendance upon the Imperial Lord, circling the Numinous Chamber.\"\n\nThe Imperial Lord then summons the Great One, who appears before the Imperial Lord. I then enter the mouth of the Great One, merging form and radiance into one body with the Great One. After a long while, all is complete. This is called \"Merging with the Grand Clarity, Transforming into the Nameless, Sun and Moon Gazing Upon Each Other, Grasping the Seven Stars, Sharing Form with the Great One, Concealing the Body in the Imperial Court.\"\n\nAfter completing the visualization of the Five Spirits, the incantation, and the inward gaze, open the eyes and click the teeth five times. Press the third finger of the left hand to the philtrum seven times, and the second finger of the right hand to the space between the eyebrows nine times. This is the method of \"Reining In the Three, Five, Seven, and Nine,\" sealing and controlling the gates of the hundred spirits, ensuring the hundred spirits secure the practitioner’s palaces, the Three Perfected solidify the practitioner’s singular body, the Five Spirits guard the practitioner’s talismanic mandate, and the Imperial Lord oversees the practitioner’s myriad chambers.\n\nAfter completing the practice, recite:\n\"Three and Five revert, Heaven covers and Earth begins,\nI possess the Five Talismans, ascending to the Imperial Son,\nThe Three Primordials abide long, within the encampment’s enclosure,\nFive colors...\"",
      "overlap_context": "ed with the Seven Stars’ headscarf.\nEver within me, stabilizing my form,\nStyled the Elder, named Li Ming,\nHe ascends to communicate with the talismanic mandate,\nGranting me long life.\nThe Three Primordials and Six Palaces, the ten thousand gates harmonized,\nCommanding the spirit qi, uniting with me,\nThe dragon wheel lingers, together we ascend to the Grand Clarity,\nEqual in radiance to the sun and moon,\nProfound and obscure, inscribing life in the azure register,\nHeaven and Earth both incline.\"*",
      "start_char": 9161,
      "end_char": 10395,
      "start_sentence": 326,
      "end_sentence": 360,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.247745990753174,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太一帝君丹隐书洞真玄经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "相通，方圆元纪，外禳百凶，内拘百史，三真扶我，五神护己，统御魁刚，使我不死。 咒毕，存太一坐六合宫中，故与我合形同景也。 乃还两手指放其所摄处，又以两手掩口，微咒曰： 太一告诸神，皆持阴阳关，不得妄去其宫室，当受对於帝君，一如三真法，二如九天命。 此混合变化，所存所行都毕也。 太一常以甲午、丙午、戊午日日中时，下游绛宫，合形真人及兆身也。 此是为三合己也，三真炁也，三浑化也。 绛宫真人者，处心中之丹田，中元真人居其心中也。 《三一经》具记其事矣。 常以其日日中时，入室存太一下游绛宫，绛宫真人忽然与太一合形。 次又存我入绛宫，忽然复与太一合形。 於是绛宫之中，唯觉有太一之身，身形象服如兆体也。 但令形细眇然，有似生孩之始耳。 毕，又思存两鼻孔下，左有日，右有月，日中有黄精赤炁，月中有赤精黄炁。 精者，二明之质也。 色炁者，日月之烟也。 二炁郁郁，来入绛宫，绛宫溢满，二气复上入洞房中，洞房中郁满，又下至黄庭中。 黄庭中者，脐下三寸下丹田宫中也。 二炁既满，又入填溢太仓中，二炁洞彻郁郁，积胃管中。 存太一上行，正当胃管中，南向呼召下元丹田黄庭真人，衣黄衣，巾黄巾，与太一共坐，饮食精炁二十七咽。 良久毕，存黄庭真人咒曰： 日月之华，黄赤二精，圆光合炁，上发大，明，三元饮食，太一受灵。 又存太一与中元真人还入绛宫，黄庭真人还下丹田宫，太一与我合形，还六合宫。 毕，兆咒曰： 太一帝君上勑三元，又为我勑制百神，百神按次相次留我一身，不得妄出入金门牢玉关。 咒毕，又存乳下日月，从两鼻孔中上到洞房，洞房中有上一真人，天帝也。 天帝是帝君之子，帝君治太极紫房，天帝治两眉间却入三寸为泥丸，丹田上宫； 或治在两眉间却入二寸，为洞房宫也。 存上一天帝，左右手各持日月，左手持日，右手持月，天帝先食日月，兆当作十九咽。 作十九咽毕，天帝吐气，气临太一六合宫中，觉紫烟满宫，太一吸取紫烟，作十九咽止。 名曰混合三一帝，布日月精，变景三宫万神，常生者也。 九宫上一入帝室，三五合炁，其本一七，变入形相，保密五行参差同根节，此消魔中符，帝君之经也。 谓三真相推而上登，五神禀帝魂而下分。 常以甲子日夜半时，存太微紫房宫中，有一童子如婴孩之状，着朱衣，名干景精，字会元子，正当帝君之前，捧赤玉按，按上有兆五符及命籍也。 又存太一从六合宫来上，在帝君之左。 童子曰：符籍主生，万神皆听，甲乙之记，已书帝庭，请命太一，定甲之名。 甲，兆名也。 帝君曰：太一童子，百变入己，除死上生，周而复始，形内万真，一勑伯史。 於是兆身及童子，并合入太 一形中，良久毕，又存太一还六合宫也。 名曰混合童婴於始元之炁，化变太一於三真之际也。 故《大洞真经》曰：太微小童，常在帝前，其名景精，其姓曰干，合形太一，被服朱丹，五符命籍，把持玉按，帝君所命，主通诸神，此之谓也。 又《高上消魔经》曰：辛子景精，有神有威，合象三形，九道相推，衣服朱丹，步正参差，出入上元，太极内阶，知我者生，存我不衰，人无哭兆，　恃赖辟非，欲知吾家处，密问太微。",
      "translated_text": "The interconnection is complete, the primordial cycle of square and circle unfolds. Externally, it wards off the hundred misfortunes; internally, it restrains the hundred officials. The Three Perfected support me, the Five Spirits protect my person, commanding the stalwart and unyielding, ensuring I do not die.\n\nWhen the incantation is finished, visualize the Great One seated within the Sixfold Harmony Palace, thus merging form and radiance with me. Then return the fingers of both hands to their original positions, cover the mouth with both hands, and softly recite:\n\n\"The Great One commands all spirits, holding fast the gates of yin and yang. They must not recklessly abandon their palaces but await their reckoning before the Imperial Lord—first in accord with the law of the Three Perfected, second in accord with the mandate of the Nine Heavens.\"\n\nThis is the culmination of the merging and transformation, the completion of all visualization and practice.\n\nThe Great One regularly descends to the Crimson Palace at noon on *jia-wu*, *bing-wu*, and *wu-wu* days, merging form with the Perfected One and the practitioner’s body. This is called the \"Threefold Union of the Self,\" the *qi* of the Three Perfected, the Threefold Primal Transformation.\n\nThe Perfected One of the Crimson Palace resides in the Cinnabar Field of the heart, while the Central Perfected One dwells within the heart. The *Scripture of the Three Ones* records these matters in full.\n\nRegularly at noon on these days, enter the chamber and visualize the Great One descending to the Crimson Palace. Suddenly, the Perfected One of the Crimson Palace merges form with the Great One. Next, visualize yourself entering the Crimson Palace and suddenly merging form with the Great One once more. Within the Crimson Palace, only the body of the Great One is perceived, its form and attire mirroring the practitioner’s own—only finer and more subtle, as if newly born.\n\nWhen this is complete, visualize below the two nostrils: on the left, the sun; on the right, the moon. Within the sun is yellow essence and red *qi*; within the moon is red essence and yellow *qi*. The essence is the substance of the two luminaries; the colored *qi* is the mist of the sun and moon. The two *qi* rise in abundance, entering the Crimson Palace until it overflows. The two *qi* then ascend into the Cavern Chamber, filling it to abundance, before descending into the Yellow Court. The Yellow Court is the Cinnabar Field Palace three inches below the navel.\n\nOnce the two *qi* are full, they enter and fill the Great Granary, permeating the stomach channel with their abundant brilliance. Visualize the Great One ascending to the center of the stomach channel, facing south to summon the Perfected One of the Yellow Court in the Lower Cinnabar Field. Clad in yellow robes and a yellow headscarf, the Perfected One sits with the Great One, partaking of the essence and *qi* with twenty-seven swallows.\n\nAfter a long while, visualize the Perfected One of the Yellow Court reciting:\n\n\"The radiance of the sun and moon, the yellow and red essences,\nTheir round light merging *qi*, ascending in great brilliance,\nThe Three Primordials partake of the feast,\nThe Great One receives the numinous.\"\n\nThen visualize the Great One and the Central Perfected One returning to the Crimson Palace, while the Perfected One of the Yellow Court descends to the Lower Cinnabar Field Palace. The Great One merges form with the practitioner and returns to the Sixfold Harmony Palace.\n\nWhen this is complete, the practitioner recites:\n\n\"The Great One, Imperial Lord, commands the Three Primordials on high,\nAnd for me commands and restrains the hundred spirits.\nThe hundred spirits, in proper order, remain within my body,\nNever recklessly entering or exiting the Golden Gate or the Jade Barrier.\"\n\nWhen the incantation is finished, visualize the sun and moon below the breasts, ascending from the two nostrils into the Cavern Chamber. Within the Cavern Chamber resides the Supreme Perfected One, the Celestial Emperor. The Celestial Emperor is the son of the Imperial Lord; the Imperial Lord governs the Purple Chamber of the Supreme Ultimate, while the Celestial Emperor governs the Mud Pill Palace three inches inward from the space between the eyebrows—the Upper Palace of the Cinnabar Field—or else governs the Cavern Chamber Palace two inches inward from the space between the eyebrows.\n\nVisualize the Supreme Celestial Emperor, each hand holding the sun and moon—left hand holding the sun, right hand holding the moon. The Celestial Emperor first consumes the sun and moon, and the practitioner performs nineteen swallows. After nineteen swallows, the Celestial Emperor exhales *qi*, which descends upon the Sixfold Harmony Palace of the Great One. The palace is filled with purple mist, and the Great One inhales the purple mist, performing nineteen swallows before stopping. This is called the \"Merging of the Three Ones and the Emperor,\" spreading the essence of the sun and moon, transforming the radiance of the Three Palaces and the myriad spirits—ensuring perpetual life.\n\nThe Supreme One of the Nine Palaces enters the Imperial Chamber, the *qi* of Three and Five merging. Its root is the One and Seven, transforming into form and appearance. It safeguards the Five Phases, their nodes intertwined—this is the talisman for dispelling demons, the scripture of the Imperial Lord. It is said: the Three Perfected ascend in mutual succession, while the Five Spirits, receiving the imperial soul, descend in division.\n\nRegularly at midnight on *jia-zi* days, visualize within the Purple Chamber of the Supreme Tenuity Palace a youth resembling a newborn infant, clad in vermilion robes. His name is *Gan Jingjing*, his courtesy name *Huiyuanzi*, standing directly before the Imperial Lord, holding a red jade tablet upon which are inscribed the practitioner’s five talismans and life register.\n\nNext, visualize the Great One ascending from the Sixfold Harmony Palace to stand at the Imperial Lord’s left. The youth says:\n\n\"The talismans and register govern life; all spirits obey.\nThe records of *jia* and *yi* are inscribed in the imperial court.\nI request the mandate of the Great One to determine the name of *jia*—*jia* being the practitioner’s name.\"\n\nThe Imperial Lord says:\n\n\"Great One, youth of a hundred transformations, entering the self,\nEradicating death and ascending to life, cycling without end,\nThe myriad Perfected within the form—with a single command, the hundred officials are restrained.\"\n\nThereupon, the practitioner’s body and the youth merge into the form of the Great One. After a long while, visualize the Great One returning to the Sixfold Harmony Palace. This is called \"Merging the Youth and Infant in the *qi* of the Primordial Beginning, transforming the Great One amid the Three Perfected.\"\n\nThus, the *Perfect Scripture of the Great Cavern* states:\n\n\"The Lesser Youth of the Supreme Tenuity,\nEver before the Emperor,\nHis name is *Jingjing*,\nHis surname *Gan*.\nMerging form with the Great One,\nClad in vermilion and cinnabar,\nHolding the five talismans, life register, and jade tablet,\nCommanded by the Imperial Lord to govern all spirits—\nThis is the meaning.\"\n\nThe *Highest Scripture for Dispelling Demons* also states:\n\n\"*Xin-zi Jingjing*,\nPossessing spirit and majesty,\nMerging the three forms,\nThe nine paths mutually propel.\nClad in vermilion and cinnabar,\nWalking with measured steps,\nEntering and exiting the Upper Primordial,\nThe inner steps of the Supreme Ultimate.\nThose who know me live,\nThose who visualize me do not decline.\nPeople lack omens of mourning,\nRelying on me to avert calamity.\nIf you wish to know my dwelling,\nSecretly inquire of the Supreme Tenuity.\"",
      "overlap_context": "s, ensuring the hundred spirits secure the practitioner’s palaces, the Three Perfected solidify the practitioner’s singular body, the Five Spirits guard the practitioner’s talismanic mandate, and the Imperial Lord oversees the practitioner’s myriad chambers.\n\nAfter completing the practice, recite:\n\"Three and Five revert, Heaven covers and Earth begins,\nI possess the Five Talismans, ascending to the Imperial Son,\nThe Three Primordials abide long, within the encampment’s enclosure,\nFive colors...\"",
      "start_char": 10395,
      "end_char": 11625,
      "start_sentence": 361,
      "end_sentence": 403,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.419246196746826,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太一帝君丹隐书洞真玄经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "此胎中童子变胞太一之魂也。 知其名字者，天下万民无得哭兆之身也。 常存之，辟非灾万祸，长生不死矣。 施行变合之日，六甲皆佳，不必专用甲子日也。 太一五神奉五符奉五籍，上清帝君混合之道，求长生神仙之诀也。 右桃君符，以白为地，丹笔书之。 五帝内宝符，太一帝君混化合景之道也。 可以本命日书五符，共盛着锦囊中带之。 带之者长生不死。 又常以本命之月中，有本命之日时，入室书五符，向王顿服。 毕，咒曰： 太一五符，神籍记生，千年万岁，与天同龄，帝君把籍，命寿不倾。 若欲数服此符者，常以五月五日、七月七日、九月九日，夜半生炁时为佳，或以秋分日夜半矣。 上五籍奉五符混合帝君，常以本命日月、三月十五日、二十六日，夜半时生炁，取令一室清净，乃可行之。 坐卧任意，坐则接手临目。 临目者，常闭而不闭也。 卧则闭目内视，两手拊心上，存帝君上在太极紫房宫中坐，存太微小童侍帝君后，又存太素元成老子侍帝君左，又存太和皇成老子侍帝君右，次存泥丸宫天帝君上入紫房，对帝君前。 天帝者，三一之上真，帝君之子，泥丸洞房之宝神也。 又存帝君，命天帝使召六合宫五神。 五神者，太一、公子、白元、司命、桃君，合五人，皆着朱衣绛巾，一神各捧一白玉桉，桉上有一符，长一寸，广五分，籍长五寸，广一寸。 事事分别，各有所主，籍简在符之上也。 存籍有乡里姓名，如上法。 五神各奉，以诣天帝，天帝以次取着帝君前。 毕，又存帝君命天、帝召兆，令上诣紫房。 须臾，兆从左鼻孔中入，上诣紫房，到帝君前，帝君令兆桉次读籍。 读籍毕，以奉天帝，天帝取奉帝君。 帝君使兆以次服五符，毕。 帝君有命天帝，命召绛宫中元丹田真人，又召下元命门真人，诣紫房中。 须臾，二真人上诣紫房帝君前。 此二真人者，是中心，脐下三一神也。 又存天帝，天帝以忽合帝君形中，觉从口中入，变而合一也。 须臾，二老子又入帝君鼻两孔中。 须臾，觉见绛宫、命门二真人，又入帝君口中。 须臾，又觉见五神从帝君左耳孔中，入帝君六合中。 又存觉兆身及太微童子，从帝君右耳孔中，入帝君六合中。 都毕，帝君尔时独坐太微紫房宫中也。 其所命召诸神，并已合形内，变入形於帝君前矣。 存帝君咒曰： 太上玄清，天地同精，合景紫房，混化万生，五神三一，二老记名，太微童子，从兆反形。 千千万亿，长年以宁，后帝而存，神仙玉清。 毕，兆咒曰： 混合既毕，死籍已灭，天帝有命，不得忘失，百神帝君，各宝其室。 於是乃开目，毕。 此为五神奉符籍之时，魂神混合之道，兆精心思而存之焉。 右五籍五符混化必生券，以本命日日中时，朱书青纸，作此符一枚。 夜半入室存思毕，服一枚，向本命之处也。 余一枚，以铰刀中破，从上下黑沾处中分之，以一半付灶火中，以半付井水中。 每至本命日辄行之，名曰保神长至之符，帝君记命之券也。 以白纸青笔书之，本命日旦，东向服之毕，咒曰： 帝君制命，九炁同烟，使我不死，又得飞仙，制命安形，太上之宾。 以白纸雌黄书之，本命日日中时，南向服之毕，南向咒曰： 太一明灵，帝君合形，斩灭三尸，魂魄安宁，长在天中，九命无倾，飞升帝前，七道五生。",
      "translated_text": "This is the transformation of the Womb Child into the Hun-soul of the Embryonic Great One. Those who know his name and appellation ensure that none among the myriad people of the world bear the omen of mourning. Constantly visualize him to avert misfortune and myriad disasters, and you shall attain long life without death.\n\nOn the day of performing this transformative union, all six Jia days are auspicious; there is no need to exclusively use the Jia-zi day. The Five Spirits of the Great One present the Five Talismans and Five Registers—this is the Dao of the Supreme Clarity Emperor Lord’s fusion and union, the secret to seeking long life and transcendence as a divine immortal.\n\nThe Peach Lord Talisman on the right is drawn with cinnabar on a white ground. The Five Thearchs’ Inner Treasure Talismans are the Dao of the Great One Emperor Lord’s fusion and transformation through union with the radiant essence. On your life-destiny day, inscribe the Five Talismans and store them together in a brocade pouch to carry on your person. Those who carry them attain long life without death.\n\nMoreover, in the month of your life-destiny, on the day and hour corresponding to your life-destiny, enter your chamber and inscribe the Five Talismans. Face the king and swallow them at once. Upon completion, recite the incantation:\n\n*\"The Five Talismans of the Great One,\nThe spirit registers record life.\nFor a thousand years, ten thousand ages,\nYou shall share the same age as Heaven.\nThe Emperor Lord holds the register,\nCommanding life-destiny without decline.\"*\n\nIf you wish to ingest this talisman multiple times, the most auspicious times are the fifth day of the fifth month, the seventh day of the seventh month, and the ninth day of the ninth month, at the hour when primordial qi is born at midnight, or alternatively at midnight on the autumnal equinox.\n\nTo present the Five Registers and Five Talismans for fusion with the Emperor Lord, on your life-destiny day and month, as well as on the fifteenth and twenty-sixth days of the third month, at the hour when primordial qi is born at midnight, ensure your chamber is pure and undefiled before proceeding. You may sit or lie down as you wish. If sitting, clasp your hands and bring them to your eyes. \"Bringing them to your eyes\" means keeping them closed yet not fully shut. If lying down, close your eyes and inwardly visualize. Place both hands over your heart and visualize the Emperor Lord seated in the Purple Chamber Palace of the Supreme Ultimate. Envision the Youth of the Supreme Tenuity attending behind the Emperor Lord, the Elder of Primordial Completion of Grand Simplicity attending to his left, and the Elder of Imperial Completion of Grand Harmony attending to his right. Next, visualize the Heavenly Emperor Lord of the Mud-Pill Palace ascending into the Purple Chamber to stand before the Emperor Lord. This Heavenly Emperor is the supreme perfected one of the Three Ones, the son of the Emperor Lord, the precious spirit of the Cavern Chamber of the Mud-Pill Palace.\n\nFurther visualize the Emperor Lord commanding the Heavenly Emperor to summon the Five Spirits of the Six Harmonies Palace. These Five Spirits—the Great One, the Noble Son, White Prime, the Controller of Destinies, and the Peach Lord—are five in number. Each wears vermilion robes and a crimson headscarf, and each holds a white jade tablet. Upon each tablet rests a talisman, one inch in length and five fen in width, with a register five inches long and one inch wide placed above it. Each has distinct duties and domains, with the register scrolls positioned above the talismans. Visualize the registers bearing your native place, name, and appellation, as described above. The Five Spirits each present their registers to the Heavenly Emperor, who in turn arranges them before the Emperor Lord.\n\nUpon completion, visualize the Emperor Lord commanding the Heaven and Earth Emperors to summon your spirit, bidding it ascend to the Purple Chamber. In an instant, your spirit enters through your left nostril, ascends to the Purple Chamber, and arrives before the Emperor Lord. The Emperor Lord instructs your spirit to take the tablets in order and read the registers. After reading, your spirit presents them to the Heavenly Emperor, who then offers them to the Emperor Lord. The Emperor Lord commands your spirit to ingest the Five Talismans in sequence.\n\nThe Emperor Lord then instructs the Heavenly Emperor to summon the Perfected of the Crimson Palace of the Central Cinnabar Field and the Perfected of the Life Gate of the Lower Primordial, bidding them come to the Purple Chamber. In an instant, the two Perfected ascend to the Purple Chamber before the Emperor Lord. These two Perfected are the Three Ones of the Central Palace, the spirits of the heart and the navel below.\n\nNext, visualize the Heavenly Emperor suddenly merging with the Emperor Lord’s form, entering through your mouth and uniting with him. In an instant, the two Elders enter the Emperor Lord’s two nostrils. Then, perceive the two Perfected of the Crimson Palace and Life Gate entering the Emperor Lord’s mouth. In another instant, perceive the Five Spirits entering the Emperor Lord’s Six Harmonies through his left ear. Finally, visualize your own spirit and the Youth of the Supreme Tenuity entering the Emperor Lord’s Six Harmonies through his right ear.\n\nWhen all is complete, the Emperor Lord sits alone in the Purple Chamber Palace of the Supreme Tenuity. All the summoned spirits have merged within his form, transformed and united before the Emperor Lord. Then visualize the Emperor Lord reciting the incantation:\n\n*\"Supreme Mystery and Profound Clarity,\nHeaven and Earth share the same essence.\nUnited with the radiant essence in the Purple Chamber,\nFusion transforms the myriad lives.\nThe Five Spirits and Three Ones,\nThe Two Elders record names.\nThe Youth of the Supreme Tenuity,\nReturns to form with your spirit.\nFor thousands upon thousands of myriads,\nYou shall enjoy long years of peace.\nPreserve me as your sovereign,\nAnd ascend as an immortal to Jade Clarity.\"*\n\nUpon completion, you recite the incantation:\n\n*\"The fusion is complete,\nThe register of death is obliterated.\nThe Heavenly Emperor commands,\nNever forget nor lose this.\nThe Hundred Spirits and Emperor Lord,\nEach treasure their abode.\"*\n\nThen open your eyes and conclude. This is the method for the Five Spirits presenting the talismans and registers, the Dao of the fusion of hun-soul and spirit. Focus your essence and mind to visualize it.\n\nThe Life-Guarantee for the Fusion of the Five Registers and Five Talismans: On your life-destiny day at noon, inscribe this talisman in cinnabar on blue-green paper, creating one copy. At midnight, enter your chamber, complete the visualization, and ingest one copy while facing your life-destiny direction. Take the remaining copy and cut it in half with scissors, dividing it at the black-stained center. Place one half in the stove fire and the other in the well water. Perform this ritual on every life-destiny day; it is called the Talisman for Preserving the Spirit and Prolonging Life, the Emperor Lord’s Record of Command.\n\nInscribe it with a blue-green brush on white paper. On your life-destiny day at dawn, face east and ingest it, then recite the incantation:\n\n*\"The Emperor Lord issues the command,\nThe nine qi merge as one smoke.\nHe causes me not to die,\nAnd further to ascend as a flying immortal.\nThe command stabilizes my form,\nI become a guest of the Supreme.\"*\n\nInscribe it with realgar on white paper. On your life-destiny day at noon, face south and ingest it, then face south and recite the incantation:\n\n*\"The Great One is luminous and numinous,\nThe Emperor Lord unites with my form.\nSever the Three Corpses,\nHun and po are at peace.\nAbide forever in Heaven,\nThe nine destinies remain unshaken.\nAscend before the Emperor,\nThe seven paths and five lives.\"*",
      "overlap_context": "cripture for Dispelling Demons* also states:\n\n\"*Xin-zi Jingjing*,\nPossessing spirit and majesty,\nMerging the three forms,\nThe nine paths mutually propel.\nClad in vermilion and cinnabar,\nWalking with measured steps,\nEntering and exiting the Upper Primordial,\nThe inner steps of the Supreme Ultimate.\nThose who know me live,\nThose who visualize me do not decline.\nPeople lack omens of mourning,\nRelying on me to avert calamity.\nIf you wish to know my dwelling,\nSecretly inquire of the Supreme Tenuity.\"",
      "start_char": 11626,
      "end_char": 12884,
      "start_sentence": 404,
      "end_sentence": 455,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.366313457489014,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太一帝君丹隐书洞真玄经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "以白纸丹笔书之，以本命日暮，向本命服之。 服毕，咒： 天玄地黄，三魂在堂，天黄地玄，三魂在人，不黄不玄，帝君记年，不玄不黄，太一不忘，使我安形，万寿无疆。 右太一制三魂七魄宝命符，常以本命之月、本命之日、本命之时，朱书白纸，北向服之。 若不知生月日时者，唯所知一耳，亦可以戊午日日中时服之。 右太上宝神招帝君符，以八节日日中时，朱书白纸服之毕，咒曰： 太上三玄，帝君在魂太一五灵，保魂安身，紫房有令，勑制百神。 帝君太一内精神符，合十二首，皆太上元精之炁也。 至真至秘，不得妄传也。 其别复有太一外诀符文，大异者，乃皆中矜帝昌经上符也。 非此真者，用之无效，兆善敬慎之。 帝君讳逢凌梵，字履昌灵，一名七灵，一名神丈人，常治太极紫房中，端坐平正，貌如婴儿之状，常有紫炁覆其神形，衣五色华衣，巾日月之冠，左耳上有日，径九寸，右耳上有月，径一尺。 日日夕夕常常自存之，此是帝君正形之时，非变化之为也。 帝君口常咏一文曰： 微微深哉，玄首虚全，八风散景，变化冥渊，幽然绝洞，朗矣寄玄，七神徘徊，炼柔三魂，上帝用安，惠在兆身，兆身常斋，慎履飞尘，我则熙乐，保兹泥丸，血尸入目，秽炁纷纷，帝与太一，并命五神，弃官废宅，径升九天，子则忤矣，三命即颠，岂若寂静，与我缠绵。 此帝君之常吟咏太上虚室之神章也。 子常当诵习之。 其文以秽殗为急吾谓为冥矣。 兆有知帝君名字者，忌，可不慎之。 兆若有罪过，欲首谢求除罪者，夜半及日中入室，闭目端坐，北向存帝君在兆紫房中，存思如上。 因又存兆身在紫房中，伏帝君前，内自陈□，并炁良久，匝令一身汗出，衣服沾蒸。 如此者三过，自解罪目散也。 汗匝一体毕，乃咒曰： 某甲有罪，上闻百神，乞度七九，水火之患，守命太一，拘济帝君，汗流一体，怖在三魂，恩惟太上，永令除患。 毕，因三呼帝君名字。 毕，乃开目。 名曰帝君懈过之道，内谢五神，流汗为应矣。 世人谢过，乃叩头搏颊，此外法也。 若修此法，若修行三一守洞房，帝君奉太一者，慎不可以叩头搏颊也。 夫人叩头者，惊三魂，扰泥丸，惨紫房，倾帝君也。 夫人搏颊者，则坚胞结，束魄筋，太一悲，五神迂，乃大忌也。 若所行所念，但心存叩头搏颊，亦内解於心中矣。 仙人存心拜而已，不形屈也，吾谓为冥矣。 兆有知帝君名字者，长生不死，形不入地矣。 慎不可以告人，告人则卫经玉童玉女去矣，非盟不传也。 常以庚申日日中入室，或用夜半，存思帝君在紫房中，帝君口吹一炁，辄成一人，凡作七吹炁，成七人。 又存太一从六合中宫来，上诣帝君前，兆己从太一合形，为一人身耳。 凡七吹炁成七人，太一及帝君又为二人，都合九人，名为七君、九君，领理血脉筋骨之道。 存帝君有命咒曰： 第一白气君务玄子，第二青炁君按延昌，第三黑炁君赋来生，第四黄炁君祖明车，第五赤炁君焜离子，皆五方色衣，巾五方巾，从次诸神，不得杂错。 第六上玄君高同生，第七下玄君叔火王，各朱衣黄巾，立吾后，抱图籍，奉五符。 今命第一君主炁，第二君主血，第三君主精，第四君主液，第五君主神，第六君主魂，第七君主魄，太一君主髓脑，帝君主本命。",
      "translated_text": "Inscribe it with a cinnabar brush on white paper. On your life-destiny day at dusk, face your life-destiny direction and ingest it. After ingesting, recite the incantation:\n\n*\"Heaven dark, earth yellow,\nThe three hun dwell in the hall.\nHeaven yellow, earth dark,\nThe three hun reside in man.\nNeither yellow nor dark,\nThe Emperor Lord records the years.\nNeither dark nor yellow,\nThe Great One does not forget.\nHe stabilizes my form,\nBoundless longevity without end.\"*\n\nThis is the Great One’s Precious Command Talisman for Governing the Three Hun and Seven Po. Always on the month, day, and hour of your life-destiny, inscribe it in cinnabar on white paper and ingest it facing north. If you do not know your birth month, day, or hour, even knowing one will suffice; you may also ingest it on the wu-wu day at noon.\n\nThis is the Supreme Precious Talisman for Summoning the Emperor Lord. On the eight solar terms at noon, inscribe it in cinnabar on white paper, ingest it, and recite the incantation:\n\n*\"The Supreme Three Mysteries,\nThe Emperor Lord resides in the hun.\nThe Great One and Five Numinous Powers,\nProtect the hun and stabilize the body.\nThe Purple Chamber holds command,\nIssuing decrees to govern the hundred spirits.\"*\n\nThe Emperor Lord’s Inner Spirit Talisman of the Great One comprises twelve sections, all being the primordial qi of the Supreme Original Essence. It is most true and most secret—do not transmit it recklessly. There are also separate talismans of the Great One’s outer oral instructions, which differ greatly, being the superior talismans of the *Zhong Jin Di Chang Jing*. Those that are not authentic will be ineffective; you must be reverent and cautious.\n\nThe Emperor Lord’s taboo name is Feng Lingfan, his courtesy name Lü Changling. He is also called Seven Numinous Powers and Divine Elder. He constantly resides in the Purple Chamber of the Great Ultimate, sitting upright and proper, his appearance like that of an infant. A purple qi perpetually envelops his divine form. He wears a robe of five-colored radiance and a cap adorned with the sun and moon. Above his left ear is the sun, nine inches in diameter; above his right ear is the moon, one foot in diameter. This is the true form of the Emperor Lord at all times, not a transformation.\n\nThe Emperor Lord constantly recites a text that says:\n\n*\"Subtle and profound,\nThe Dark Prime is empty and complete.\nThe eight winds scatter light,\nTransforming in the hidden abyss.\nSilent and boundless,\nLuminous and abiding in the mysterious.\nThe seven spirits wander,\nRefining and softening the three hun.\nThe Supreme Lord is at peace,\nBestowing grace upon your body.\nYour body must always be pure,\nCautious in treading the flying dust.\nThen I shall be joyful,\nPreserving this muddy pellet.\nIf blood-corpses enter the eyes,\nDefiled qi swirls in profusion.\nThe Emperor and the Great One,\nTogether command the five spirits.\nAbandon office and forsake dwelling,\nAscend directly to the Nine Heavens.\nIf you resist,\nThe three destinies will topple.\nHow much better to be still and tranquil,\nEntwined with me in serenity.\"*\n\nThis is the Emperor Lord’s constant recitation of the Supreme’s divine chapter of the Empty Chamber. You should always study and recite it. Its urgency lies in impurity and filth—what I call the obscure.\n\nIf you know the Emperor Lord’s name and courtesy name, beware—you must not be careless. If you have transgressions and wish to confess, seek absolution, and have your sins removed, enter your chamber at midnight or noon, close your eyes, sit upright, and face north. Visualize the Emperor Lord in your Purple Chamber, meditating as described above. Then visualize your own body within the Purple Chamber, prostrating before the Emperor Lord. Internally confess your transgressions, holding your breath for a long while until your entire body is drenched in sweat, your clothes damp and steaming. Do this three times, and your sins will dissolve like scattered dust. Once your whole body is bathed in sweat, recite the incantation:\n\n*\"So-and-so has sinned,\nHeard by the hundred spirits.\nI beseech deliverance from the seven nines,\nFrom the perils of water and fire.\nThe Guardian of Destiny, the Great One,\nThe Emperor Lord who restrains and saves,\nSweat flows through my entire body,\nTerror grips the three hun.\nI implore the Supreme,\nTo forever remove these perils.\"*\n\nAfter reciting, call out the Emperor Lord’s name and courtesy name three times. Then open your eyes. This is called the Emperor Lord’s Method for Relieving Transgressions, an inner confession to the five spirits, with sweating as the sign of efficacy. When worldly people confess their faults, they kowtow and slap their cheeks—this is an external method. If you practice this method, or cultivate the Three Ones to guard the Grotto Chamber, with the Emperor Lord serving the Great One, be careful never to kowtow or slap your cheeks. Kowtowing startles the three hun, disturbs the muddy pellet, grieves the Purple Chamber, and topples the Emperor Lord. Slapping the cheeks hardens the womb and binds the sinews of the po, saddens the Great One, and disorients the five spirits—this is a great taboo. Whatever you do or think, if you mentally kowtow or slap your cheeks, it is inwardly resolved in the heart. Immortals bow in their hearts but do not physically prostrate—what I call the obscure.\n\nIf you know the Emperor Lord’s name and courtesy name, you will attain long life and immortality, and your body will not enter the earth. Be careful not to reveal them to others; if you do, the Jade Lads and Jade Maidens of the Guardian Scriptures will depart. This is not to be transmitted without a covenant.\n\nAlways on the geng-shen day at noon, or at midnight, enter your chamber and visualize the Emperor Lord in the Purple Chamber. The Emperor Lord exhales a qi, and with each breath, a person is formed—seven breaths create seven people. Then visualize the Great One coming from the Central Palace of the Six Harmonies to stand before the Emperor Lord. Visualize yourself merging with the Great One, becoming one body. The seven breaths create seven people, and the Great One and the Emperor Lord make two more, totaling nine people. These are the Seven Lords and Nine Lords, who govern the pathways of blood, vessels, sinews, and bones.\n\nVisualize the Emperor Lord issuing the command and reciting the incantation:\n\n*\"The First White Qi Lord, Wu Xuanzhi,\nThe Second Azure Qi Lord, An Yanchang,\nThe Third Black Qi Lord, Fu Laisheng,\nThe Fourth Yellow Qi Lord, Zu Mingche,\nThe Fifth Red Qi Lord, Kun Lizhi—\nAll wear robes of the five directions’ colors,\nAnd caps of the five directions.\nThey follow in order,\nNo confusion permitted.\nThe Sixth Upper Mystery Lord, Gao Tongsheng,\nThe Seventh Lower Mystery Lord, Shu Huowang—\nEach wears a vermilion robe and yellow cap,\nStanding behind me,\nHolding charts and registers,\nPresenting the five talismans.\"*\n\nNow command:\nThe First Lord governs qi,\nThe Second Lord governs blood,\nThe Third Lord governs essence,\nThe Fourth Lord governs fluids,\nThe Fifth Lord governs spirit,\nThe Sixth Lord governs the hun,\nThe Seventh Lord governs the po,\nThe Great One Lord governs marrow and brain,\nThe Emperor Lord governs the life-destiny.",
      "overlap_context": "er to ascend as a flying immortal.\nThe command stabilizes my form,\nI become a guest of the Supreme.\"*\n\nInscribe it with realgar on white paper. On your life-destiny day at noon, face south and ingest it, then face south and recite the incantation:\n\n*\"The Great One is luminous and numinous,\nThe Emperor Lord unites with my form.\nSever the Three Corpses,\nHun and po are at peace.\nAbide forever in Heaven,\nThe nine destinies remain unshaken.\nAscend before the Emperor,\nThe seven paths and five lives.\"*",
      "start_char": 12885,
      "end_char": 14146,
      "start_sentence": 456,
      "end_sentence": 497,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.46982669830322,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太一帝君丹隐书洞真玄经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "按次相比，言功记过，刻除死名，长上青书，如天皇内令。 於是帝君咒毕。 即又因口中吹出白炁三十过，炁满紫房，洞熏一身，一身冥合，如在云雾中。 良久，豁然开目止。 名为七君、九君校比一身，混合白炁，上固泥丸之道也。 亦以此法除三尸七积之疾。 夫人生由胞胎以自变，禀血精以自成，故既生而胞胎更结，既成而血液不留。 不留者，帝君混合，即已留住之矣。 胞胎有十二结节，盘固五内，五内滞阂，结不可解，节不可除。 故人病也，由节滞也，人之死二由结固也。 常以本命日，若八节日，上请帝君与太一混合，约制百神，而解胞中牢坚之结，盘根之死节也。 胞有十二结，内有十二节，节在结内。 人不知解脱结节者，亦不免死矣，常解之者长生。 胞上结一在泥丸中，二在口中，三在颊中，四在目中，此胞之四结在上部。 胞中结一在五藏中，二在太仓中，三在大肠中，四在小肠中，此胞之四结在中部。 胞下结一在膀胱中，二在阴中，三在后门中，四在两足中，此胞之四结在下部。 解结之法，入室闭户存思，先读帝君以下百神名字，再过毕，乃按次解结。 此法是帝君太一混合二十四神、解结除尸炁之道也。 兆以本命日、若八节日，日中夜半时任意也。 正坐向本命之日方，接手端心，叩齿二十四通，咒曰：男生某甲，上启胞父胞母，始生之日，三积留血，化为十二大结，今本命之日，谨请三元之神、二十四真人，解三关十二结。 请言所名： 东方青帝雕梁际，字青平；",
      "translated_text": "In orderly succession they compare merits,\nRecord achievements and erase transgressions,\nStrike out names of the dead,\nAnd inscribe in azure script—\nAs decreed by the Heavenly Sovereign’s inner command.\n\nThereupon, the Emperor Lord completes the incantation.\nThen, from his mouth he exhales white qi thirty times,\nFilling the Purple Chamber,\nPervading his entire body with its deep fragrance.\nHis whole being merges in darkness,\nAs if enveloped in clouds and mist.\nAfter a long while, he suddenly opens his eyes and ceases.\n\nThis is called the Seven Lords and Nine Lords examining and aligning the body,\nBlending with white qi,\nTo firmly secure the Way of the Mud-Pill Palace.\nIt is also by this method that the illnesses of the Three Corpses and Seven Accumulations are dispelled.\n\nHuman life transforms from the womb,\nAnd takes form through blood and essence.\nYet once born, the womb re-forms knots,\nAnd once formed, blood and fluids cease to remain.\nThat which does not remain—the Emperor Lord’s blending holds it fast.\n\nThe womb has twelve knotted nodes,\nCoiling and binding the five viscera.\nWhen the five viscera stagnate and obstruct,\nThe knots cannot be untied,\nNor the nodes removed.\nThus, illness arises from stagnant nodes,\nAnd death from fixed knots.\n\nOn one’s life-destiny day or the eight seasonal nodes,\nOne should supplicate the Emperor Lord and the Great One to blend,\nCommanding the hundred spirits\nTo dissolve the womb’s stubborn knots,\nThe dead nodes of its coiled roots.\n\nThe womb has twelve knots,\nWithin which lie twelve nodes—\nNodes concealed within knots.\nThose who do not know how to untie these knots and nodes\nCannot escape death,\nWhile those who regularly dissolve them attain longevity.\n\nThe womb’s upper knots:\nOne in the Mud-Pill Palace,\nTwo in the mouth,\nThree in the cheeks,\nFour in the eyes—\nThese four knots reside in the upper region.\n\nThe womb’s middle knots:\nOne in the five viscera,\nTwo in the Great Granary,\nThree in the large intestine,\nFour in the small intestine—\nThese four knots reside in the middle region.\n\nThe womb’s lower knots:\nOne in the bladder,\nTwo in the yin,\nThree in the posterior gate,\nFour in the two feet—\nThese four knots reside in the lower region.\n\nThe method for dissolving knots:\nEnter a chamber, close the door, and visualize.\nFirst recite the names of the Emperor Lord and the hundred spirits below him.\nAfter repeating them twice,\nProceed in order to dissolve the knots.\n\nThis is the Way of the Emperor Lord and the Great One blending with the twenty-four spirits,\nDissolving knots and expelling the qi of the Corpse.\n\nOn one’s life-destiny day or the eight seasonal nodes,\nAt noon or midnight,\nSit upright facing the direction of one’s life-destiny day.\nJoin hands, compose the mind,\nAnd knock the teeth twenty-four times.\nRecite the incantation:\n\n*\"Male-born [Name], humbly invokes the Womb Father and Womb Mother,\nOn the day of my birth, three accumulations of lingering blood\nTransformed into twelve great knots.\nToday, on my life-destiny day,\nI reverently summon the Three Origin Spirits and the Twenty-Four Perfected Ones\nTo dissolve the Three Passes and Twelve Knots.\nI now invoke their names:\nThe Azure Emperor of the East, Diao Liangji,\nWhose style is Qingping;\"*",
      "overlap_context": "ngsheng,\nThe Seventh Lower Mystery Lord, Shu Huowang—\nEach wears a vermilion robe and yellow cap,\nStanding behind me,\nHolding charts and registers,\nPresenting the five talismans.\"*\n\nNow command:\nThe First Lord governs qi,\nThe Second Lord governs blood,\nThe Third Lord governs essence,\nThe Fourth Lord governs fluids,\nThe Fifth Lord governs spirit,\nThe Sixth Lord governs the hun,\nThe Seventh Lord governs the po,\nThe Great One Lord governs marrow and brain,\nThe Emperor Lord governs the life-destiny.",
      "start_char": 14146,
      "end_char": 14731,
      "start_sentence": 498,
      "end_sentence": 519,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.783356428146362,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太一帝君丹隐书洞真玄经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "南方赤帝长来觉，字南和； 西方白帝彰安幸，字西华； 北方黑帝保盛昌，字北伐。 玄一老子林虚夫，字灵时道。 三素老子牢张上，字神生道。 正一左仙人仲成子，一名帝宾，字四华。 正一右仙人曲文子，一名光坚，字灵和。 太微小童子干景精，字会元子，一名三矜交，一名对帝真。 上胎内真等，有九人，外合九炁，是为九君，为甲上解结，结在上关，四结解散，津血流源，长上生籍，永为天帝仙。 太一尊神务犹收，字归会昌，一名解明，一名寄频。 左无英公子玄元叔，字合符子，一名元素君，一名神公子。 右白元洞阳君郁灵摽，字玄夷绝，一名朱精，一名启成。 中央司命丈人君理明初，字玄度卿，一名神宗，一名灵华。 命门桃君孩道康，字合精延，一名命王，一名胞根。 泥丸天帝上一赤子玄凝天，字三元先，一名伯无上，一名伯史华。 泥丸天帝卿肇勒精，字仲玄生，一名起非，一名常扶。 绛宫心丹田宫中一元丹皇君神运珠，字子南丹，一名生上伯，一名史云拘。 绛宫辅皇中一卿中光坚，字四化灵，一名幽车伯，一名董史华。 中胎九真，是为九君，回灵九炁， 化入绛宫五藏大结，大肠小肠，皆当化散，四结分昌，中关调利，流注太仓，千灾万祸，一时灭亡，记上生录，永无灾殃。 命门下一黄庭元王始明精，字元阳昌，一名婴儿胎，一名伯史原。 黄庭保镇弼卿归上明，字谷下玄，一名承申伯，一名承光生。 第一胎中白炁君务玄子，字育常生。 第二结中青炁君按延昌，字合和婴。 第三节中黑炁君斌来生，字精上门。 第四胞中黄炁君祖名车，字神无极。 第五血中赤炁君混离子，字叔火坚。 第六上玄元父君高同生，字左回明。 第七下玄玄母君叔火王，字右回光。 下胎九君，胞胎内真，生化九炁，是为九魄。 九魄精胞中节坚，使甲不寿中年，愿今日奉命，如往初生，乞得解散十二死根，名上玉籍，五符入身，下镇九炁，永得缠绵，上开九宫，下开九关。 脱读再过，都毕，当和心下炁，勿令音啜而赛也。 又闭目存呼太极紫房天皇太帝君逢凌梵，字履昌灵，一名七灵，一名神丈人。 如此咒之三。 又存三九结解真君，东方青帝雕梁际等，讫玄母叔火王等二十七人，同着朱衣，巾黄巾。 黄巾者，似远游冠之状也。 貌如婴儿，无有长短。 次引太极紫房，并北向，对太帝君而各长跪，其言曰：",
      "translated_text": "Southward, the Crimson Emperor Changlaijue, styled Nanhe;\nWestward, the White Emperor Zhang’anxing, styled Xihua;\nNorthward, the Black Emperor Baoshengchang, styled Beifa.\n\nThe Mysterious One, Old Master Lin Xufu, styled Lingshidao.\nThe Three Primes, Old Master Lao Zhangshang, styled Shenshengdao.\nThe Orthodox Unity Left Immortal, Zhong Chengzi, also named Dibin, styled Sihua.\nThe Orthodox Unity Right Immortal, Qu Wenzi, also named Guangjian, styled Linghe.\n\nThe Minor Lad of the Grand Tenuity, Gan Jingjing, styled Huiyuanzǐ, also named Sanjinjiao or Duidi Zhen.\nThe Inner Womb Perfected Ones, numbering nine, externally harmonize with the nine qi—these are the Nine Lords. For dissolving the knots above *jia*, the knots at the Upper Pass: when the four knots disperse, the fluid and blood flow at their source, the Upper Register of Longevity is lengthened, and one becomes an immortal of the Heavenly Emperor forever.\n\nThe Venerable Spirit of the Great One, Wu Youshou, styled Guihuichang, also named Jieming or Jipin.\nThe Left Non-Being Duke’s Son, Xuan Yuan Shu, styled Hefuzi, also named Yuansu Jun or Shen Gongzi.\nThe Right White Prime Cavern Yang Lord, Yu Lingbiao, styled Xuan Yijue, also named Zhu Jing or Qicheng.\nThe Central Controller of Destiny, the Venerable Lord Li Mingchu, styled Xuandu Qing, also named Shenzong or Linghua.\n\nThe Peach Lord of the Gate of Destiny, Hai Daokang, styled Hejingyan, also named Mingwang or Baogen.\nThe Celestial Emperor of the Mud-Pill Palace, Shangyi Chizi, Xuan Ning Tian, styled Sanyuan Xian, also named Bowushang or Boshi Hua.\nThe Celestial Minister of the Mud-Pill Palace, Zhao Le Jing, styled Zhong Xuan Sheng, also named Qifei or Changfu.\nThe Cinnabar Palace of the Heart and Cinnabar Field, the Central One Cinnabar Sovereign Lord, Shen Yun Zhu, styled Zinan Dan, also named Shengshang Bo or Shiyun Ju.\n\nThe Auxiliary Sovereign of the Cinnabar Palace, Zhong Guangjian, styled Sihua Ling, also named Youche Bo or Dongshi Hua.\nThe Nine Perfected of the Central Womb—these are the Nine Lords. The nine qi of numinous return transform and enter the Cinnabar Palace, dissolving the great knots of the five viscera. The large and small intestines shall all disperse; the four knots divide and flourish. The Central Pass is harmonized and regulated, flowing into the Great Granary. A thousand disasters and ten thousand calamities vanish in an instant. Inscribed in the Upper Register of Life, one remains forever free from misfortune.\n\nThe Primordial King of the Yellow Court below the Gate of Destiny, Shi Ming Jing, styled Yuan Yang Chang, also named Ying’er Tai or Boshi Yuan.\nThe Guardian and Protector of the Yellow Court, Gui Shang Ming, styled Guxia Xuan, also named Chengshen Bo or Chengguang Sheng.\n\nThe First Womb’s White Qi Lord, Wu Xuanzi, styled Yuchang Sheng.\nThe Second Knot’s Azure Qi Lord, An Yanchang, styled Hehe Ying.\nThe Third Node’s Black Qi Lord, Bin Laisheng, styled Jingshang Men.\nThe Fourth Womb’s Yellow Qi Lord, Zu Mingche, styled Shen Wuji.\nThe Fifth Blood’s Crimson Qi Lord, Hun Lizi, styled Shu Huojian.\nThe Sixth Upper Mysterious Primordial Father Lord, Gao Tongsheng, styled Zuo Huiming.\nThe Seventh Lower Mysterious Primordial Mother Lord, Shu Huowang, styled You Huiguang.\n\nThe Nine Lords of the Lower Womb, the Inner Womb Perfected Ones, generate and transform the nine qi—these are the Nine Po. When the nine po are firm in the nodes of the essence-womb, they cause one to die in middle age. Today, reverently following the command, as at the time of first birth, I beseech the dissolution of the twelve roots of death. May my name be inscribed in the Jade Register, the Five Talismans enter my body, and the nine qi be settled below, eternally entwined. Above, the Nine Palaces open; below, the Nine Passes open.\n\nAfter reciting the incantation twice more, conclude the rite. Harmonize the qi below the heart, ensuring the voice is neither choked nor faltering.\n\nThen close the eyes and visualize the Purple Chamber of the Supreme Ultimate, the Celestial Emperor of the Heavenly Vastness, Feng Lingfan, styled Lüchang Ling, also named Qiling or Shen Zhangren. Recite this incantation three times.\n\nNext, visualize the Twenty-Seven Perfected Lords of the Dissolved Three-Nine Knots: the Azure Emperor of the East, Diao Liangji, and the others through the Primordial Mother, Shu Huowang, all clad in vermilion robes and yellow kerchiefs. The yellow kerchief resembles the shape of a *yuanyou* cap. Their faces are like those of infants, neither tall nor short.\n\nThen lead the Purple Chamber of the Supreme Ultimate to face north, toward the Celestial Emperor, and all kneel in prostration. They say:",
      "overlap_context": "se the mind,\nAnd knock the teeth twenty-four times.\nRecite the incantation:\n\n*\"Male-born [Name], humbly invokes the Womb Father and Womb Mother,\nOn the day of my birth, three accumulations of lingering blood\nTransformed into twelve great knots.\nToday, on my life-destiny day,\nI reverently summon the Three Origin Spirits and the Twenty-Four Perfected Ones\nTo dissolve the Three Passes and Twelve Knots.\nI now invoke their names:\nThe Azure Emperor of the East, Diao Liangji,\nWhose style is Qingping;\"*",
      "start_char": 14732,
      "end_char": 15707,
      "start_sentence": 520,
      "end_sentence": 557,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.95757269859314,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太一帝君丹隐书洞真玄经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "上关雕梁际等九人，中关太一务犹收九人，下关下一黄庭始明精等九人，三九二十七人，即日缘炁内咽，上开三关，关有二十四结，结有二十四筋，筋即以断，结已解散，津血上冲，径满泥丸，玉液下顺，哺养百神，即日某甲名上帝籍，长生神仙。 毕，又存太一名，兆上诣帝君前，帝君曰： 胞结已通，光内彻外，使尔长生，命不倾坠，汝可合我形中矣。 帝君因开口，觉我忽入帝君口中，径到帝君六合宫中，帝君六合中又有太一神，名重冥空，字幽寥无，因告兆曰：可食日精矣。 兆即取日精食之，作九咽止。 须臾，见向二十七真人，皆在兆左右立，二十七真人曰：某甲胎籍已解，秽炁皆除，面已玉泽，体洞太虚，长生亿万，帝君同符。 又存帝君咒曰： 天上同真，是甲之身，天上同灵，是甲之形。 良久，都毕也。 此为九君混合内化百神，解胞散结，开利三关，上合六合，并景帝君，变化命籍，炁镇泥丸，长生受符，方为天仙者也。 存思都毕，乃更散发，更梳头解衣，更结衣，洗手足者。 兆不能暗诵一二存念者，可入室按文施行之。 帝君泥丸中，又有六合宫，宫中有帝皇太一君，名重冥空，字幽寥无，兆知之者，朽骨更生，五藏生华，终身不畏怖。 畏怖之时，北向呼此名三过，咒曰： 罗阿重冥空雷风，幽寥无上生帝君，形佑兆，使无忧。 毕，如与千人同旅。 太一帝君解三关十二结胞胎内符，以本命日，若八节日，欲施行解结时，先吞此符三枚，向本命处，以真朱书青竹中白膜也。 白膜生於坚节之内，遂虚中而受灵者也，故书竹膜为解结之符文。 太一曰：人有三魂，利人之存，人有七魄，害人之命。 七魄朝在人左目下，暮在人鼻人中下，学道者欲卧，先以右手爪按左目下及人中，各三七过，甚佳，制七魄之道。 帝君太一宝玄玉经，太上真人藏於五岳华房之内，非有仙籍者，不得闻见此也。 见之者生，行之者仙。 是故重为盟誓，来其天真，以防宣泄，流布离行耳。 自天尊贵仙，然幽秘此道，非仙骨者不妄授此也，无至诚者不闻也。 有经曰师，受者礼焉。 经之传也，从师而受经，受经而用弟子之道也。 传授之际，各斋七日，或十日，先后又告斋，各复一日也。 古者盟誓，皆歃血断发，立坛告天，以为不宣示信人之约也。 今自可以金青之陈，以代发肤之体耳。 列於别静，祝启上皇。 法用金镮三枚，鲜明赤而有光者，青帛三九尺，以代三契之盟，亦可相连为二十七尺耳。 受书当写为两通，修一机一也，盟物备录，不得私用以自营也。 故太上中经曰：夫师因经业，故称之曰生受者，习焉以同其诚，推盟誓天，固神告灵，缠绵忧乐，义齐死生，於是始验克终，俱期仙庭矣。 尔乃奉拜谘受，修盟曲室，尊卑以显三洁，分别孜孜之心，宝经藏密，慎行要言，诚存专一，保敬师经，方寸敢坠，如此始可与言神灵之交，道德之契矣。 奉经而秘其道，行事而遵其誓，则以列名於玉简，书帝录於太极。 若违其道也，则七祖受风刀之考，玄母受胎灵之害，身为下鬼，门亦烟灭，摙蒙山之石，以投积夜之河，悲夫，有心之子，其慎秘也哉。 此太上真人契令，张天师演出於丹景经中，有是慎盟之书也。 受太上帝君之道，用事如此，故记而修行焉。",
      "translated_text": "The Nine Lords of the Upper Pass, led by Diao Liangji, the Nine Lords of the Middle Pass including Taiyi Wuyoushou, and the Nine Lords of the Lower Pass beginning with Xiayi Huangting Shimingjing—these Twenty-Seven Lords of the Three Nines—on this day, with the internal swallowing of primordial qi, open the Three Passes above. Each Pass contains twenty-four knots, and each knot binds twenty-four sinews. Once the sinews are severed, the knots dissolve and scatter. The essence-blood surges upward, filling the Mud Pill Palace, while the Jade Nectar flows downward to nourish the hundred spirits. On this day, the name of so-and-so is inscribed in the Heavenly Register as a Perfected Immortal of Longevity.\n\nWhen this is complete, visualize the name of Taiyi ascending before the Celestial Emperor. The Emperor says: \"The fetal knots are now unblocked, your inner radiance shines through to the exterior. I grant you longevity, and your destiny shall not collapse. You may now merge with my form.\" The Celestial Emperor then opens his mouth, and I suddenly enter it, arriving directly at the Sixfold Palace within the Emperor. Within the Emperor’s Sixfold Palace resides another Taiyi spirit, named Chongmingkong, styled Youliaowu. He addresses me, saying: \"You may now consume the essence of the sun.\" I then take the solar essence and swallow it nine times.\n\nPresently, the Twenty-Seven Perfected Lords appear, standing to my left and right. They say: \"So-and-so’s fetal register is now dissolved, all impure qi is expelled. Your countenance shines like jade, your body permeates the Great Void. You shall live for millions of years, in harmony with the Celestial Emperor.\" Then visualize the Celestial Emperor’s incantation: \"In heaven, united with the Perfected—this is my body. In heaven, united with the Numinous—this is my form.\" After a long while, all is complete.\n\nThis is the Nine Lords’ fusion and internal transformation of the hundred spirits, the dissolution of the fetal knots, the untying of the Three Passes, the ascent to merge with the Sixfold Palace, and the union with the Radiant Celestial Emperor to alter one’s destiny in the register. The qi stabilizes in the Mud Pill Palace, and one receives the talisman of longevity, becoming a Heavenly Immortal.\n\nOnce the visualization is complete, loosen the hair, comb it again, untie and retie the garments, and wash the hands and feet. If one cannot silently recite or visualize even one or two parts, one may enter the chamber and perform the ritual according to the text.\n\nWithin the Celestial Emperor’s Mud Pill Palace is another Sixfold Palace, wherein resides the Celestial Sovereign Taiyi, named Chongmingkong, styled Youliaowu. Those who know this will regenerate from withered bones, their five viscera blossom, and they shall never know fear. In times of fear, face north and call this name three times, reciting the incantation: \"Luo A Chongmingkong Leifeng, Youliaowu Shangsheng Dijun, protect my form and free me from sorrow.\" When this is done, it is as if one travels with a thousand companions.\n\nThe Taiyi Celestial Emperor unties the Three Passes and the twelve fetal knots of the internal talisman. On one’s natal day or during the Eight Seasonal Festivals, when performing the knot-untying ritual, first swallow this talisman three times, facing the direction of one’s natal constellation. The talisman is inscribed with cinnabar on the white membrane within green bamboo. This membrane grows within the hard nodes, hollow within yet receptive to the numinous—thus, the bamboo membrane is used to write the knot-untying talisman.\n\nTaiyi says: \"Humans possess three hun-souls, which benefit one’s preservation. Humans also possess seven po-souls, which harm one’s destiny. The seven po-souls dwell beneath the left eye by day and beneath the nose’s philtrum by night. Those who cultivate the Dao should, before lying down, press the right fingernail to the left eye’s underside and the philtrum, each thirty-seven times—this is excellent for restraining the seven po-souls.\"\n\nThe *Taiyi Baoxuan Yujing* of the Celestial Emperor is concealed by the Supreme Perfected within the Flowery Chambers of the Five Peaks. Those without immortal registers may not hear or see it. Those who see it shall live; those who practice it shall become immortals. Therefore, solemn oaths are repeatedly sworn to summon celestial perfected beings, preventing disclosure and unauthorized dissemination.\n\nSince the Heavenly Worthy reveres the immortals, this Dao is kept profoundly secret. It is not casually transmitted to those without immortal bones, nor heard by those lacking utmost sincerity. The scripture says: \"The master, by virtue of the scripture’s teachings, is called the living recipient.\" The disciple studies to align in sincerity, swearing oaths to heaven, solidifying the divine pledge, intertwining joys and sorrows, and equating the bond with life and death. Only then can one be tested and ultimately ascend together to the immortal courts.\n\nThus, one offers reverence and receives the teaching, performing the oath in a secluded chamber. Superior and inferior observe the Three Purities, distinguishing the earnestness of their devotion. The precious scripture is concealed, its essential words practiced with care. Sincerity is maintained with single-minded focus, honoring the master and scripture. Not a moment of negligence is permitted—only then may one speak of communion with the divine and the covenant of the Dao.\n\nThose who receive the scripture and keep its Dao secret, who conduct affairs in accordance with their oaths, shall have their names inscribed on jade tablets and their imperial records written in the Supreme Ultimate. Should one violate the Dao, however, one’s seven ancestors shall suffer the trials of the Wind Blade, the Mysterious Mother shall endure harm to her fetal spirit, the body shall become a lowly ghost, and the family shall vanish like smoke. Mountains of stones shall be cast into the River of Accumulated Nights—how lamentable! Those with hearts must guard this secret most carefully.\n\nThis is the *Contract and Ordinance of the Supreme Perfected*, expounded by Celestial Master Zhang in the *Danjing*. It contains these solemn oaths. Those who receive the Dao of the Supreme Celestial Emperor conduct affairs thus, and so it is recorded for cultivation.",
      "overlap_context": "\nNext, visualize the Twenty-Seven Perfected Lords of the Dissolved Three-Nine Knots: the Azure Emperor of the East, Diao Liangji, and the others through the Primordial Mother, Shu Huowang, all clad in vermilion robes and yellow kerchiefs. The yellow kerchief resembles the shape of a *yuanyou* cap. Their faces are like those of infants, neither tall nor short.\n\nThen lead the Purple Chamber of the Supreme Ultimate to face north, toward the Celestial Emperor, and all kneel in prostration. They say:",
      "start_char": 15707,
      "end_char": 16944,
      "start_sentence": 558,
      "end_sentence": 595,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.092994928359985,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太一帝君丹隐书洞真玄经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "金镮三枚，盟三元之誓。 青缯二十七尺，帛也。 盟帝君二十四神人之誓也。 赤丝五两，以盟五神公子之誓也。 和香二裹，以为告灵交气之烟也。 笔一枚，纸一丈，丹一两，书盟也。 右五种物，以器盛之，不宣露也。 皆受书者具之也。 弟子写毕，乃赉书，及物，来诣师室而受书。 受书毕，乃得施用耳。 不盟受而窃行之者，案女青诏书，失两明也。 受如不行者，有天火考也。 行而不精宣泄者，有风刀灾考也。 传非其人，七世父母受其考也。 此玄都鬼律女青诏书之旨。 洞真太一帝君太丹隐书洞真玄经竟",
      "translated_text": "Three gold rings shall seal the oaths of the Three Origins. Twenty-seven feet of azure silk serve as the ceremonial cloth. These bind the oaths of the Twenty-Four Divine Envoys of the Celestial Emperor. Five ounces of crimson thread shall seal the oaths of the Five Divine Lords. Two packets of blended incense shall produce the smoke that conveys qi in communion with the spirits. One brush, one *zhang* of paper, and one ounce of cinnabar shall inscribe the covenant.\n\nThese five items shall be placed in a vessel and kept from exposure. All who receive the scripture must prepare them. Once the disciple has copied the text, they shall bring both the scripture and the items to the master’s chamber to receive the transmission. Only after the transmission is complete may they put the teachings into practice.\n\nThose who secretly practice without taking the oath shall, according to the *Nüqing Ordinance*, forfeit both luminaries. Those who receive but do not practice shall face the trial of celestial fire. Those who practice but do so carelessly or reveal secrets shall suffer the Wind Blade’s judgment. Those who transmit to the unworthy shall bring seven generations of their ancestors under scrutiny.\n\nSuch are the principles of the *Xuandu Demon Statutes* and the *Nüqing Ordinance*. Here ends the *Supreme Scripture of the Great Vermilion Hidden Writ of the Cavernous Truth*, revealed by the Supreme Unity Celestial Emperor of the Cavernous Truth.",
      "overlap_context": "l spirit, the body shall become a lowly ghost, and the family shall vanish like smoke. Mountains of stones shall be cast into the River of Accumulated Nights—how lamentable! Those with hearts must guard this secret most carefully.\n\nThis is the *Contract and Ordinance of the Supreme Perfected*, expounded by Celestial Master Zhang in the *Danjing*. It contains these solemn oaths. Those who receive the Dao of the Supreme Celestial Emperor conduct affairs thus, and so it is recorded for cultivation.",
      "start_char": 16945,
      "end_char": 17184,
      "start_sentence": 596,
      "end_sentence": 611,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.906494140625,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太一帝君丹隐书洞真玄经.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}