{
  "source_id": "洞真太极北帝紫微神咒妙经",
  "source_file": "chunked_daozang\\洞真太极北帝紫微神咒妙经.json",
  "total_chunks": 6,
  "total_original_chars": 4573,
  "total_translated_chars": 28996,
  "total_translation_time": 142.7506263256073,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\本文类\\洞真太极北帝紫微神咒妙经.txt",
    "category": "本文类"
  },
  "full_translation": "**The Wondrous Scripture of the Divine Incantations of the Purple Tenuity of the Northern Thearch of the Supreme Ultimate of the Cavernous Perfection**\n\n**Scripture Title:** *The Wondrous Scripture of the Divine Incantations of the Purple Tenuity of the Northern Thearch of the Supreme Ultimate of the Cavernous Perfection*. Author unknown. Two scriptures bound in one volume. Source text: *Daoist Canon of the Zhengtong Era*, Cavernous Perfection Division, Category of Original Texts.\n\n### *The Wondrous Scripture of the Divine Incantations of the Purple Tenuity of the Northern Thearch of the Supreme Ultimate*\n#### *Chapter on the Divine Incantations Empowered by Edict for the Divine Soldiers to Protect the State, Pacify Households, Expel Ghosts, and Dissolve Disasters*\n\nThe Celestial Worthy of Primordial Beginning proclaimed:\nIn the Lower Kalpa, sentient beings abound in wickedness and perversity.\nThey gather in great states yet do not follow the true Dao.\nThey boast of their own strength, unaware that human life is fleeting.\nFrom this time forth, the great demons shall hold sway.\nIn this world of the Five Turbidities, people commit manifold transgressions,\nscheming against the multitudes, bringing harm to the world.\nThe myriad people toil in hardship, all beings suffer punishment.\nThe people of the state act lawlessly, meting out punishments and calamities.\nBandits arise from below, sowing chaos in the world.\nGhostly soldiers invade the state, unleashing great pestilential disasters.\nBlades slaughter the people, who in turn grow malevolent and rebellious.\nLegal punishments are plotted, ghostly schemes multiply, and the roads grow perilous.\nFive kinds of great bandits roam by night, killing people,\nseizing and plundering, fleeing with captives—rebel factions and ghostly brigands.\nYou, the five kinds of great ghosts, wreak havoc in the world.\nThe myriad people know no peace; the humble bear heavy burdens.\nPrefectures and counties labor in hardship; the land is not governed justly.\nThe noble disregard the Dao, and a thousand ghosts and ten thousand demons all harm people,\nemptying households and leaving all affairs unfulfilled.\nDeath by banditry and harm, chronic illness in the home,\nofficial ghosts in the household, and monstrous ghosts arise in competition.\nThe people’s dwellings are depleted and drained; nothing prospers.\nYet if even one person turns toward the essentials of the Dao and upholds Our edict,\nthe myriad disasters may be resolved, and the hundred pestilences shall scatter of themselves.\nThe great armies of official ghosts shall dissipate and not arise.\nWinds will be harmonious, rains timely; the land will be level and just, and all affairs will flourish.\nWe do not speak falsely. Those who receive Our true words\nshall themselves transcend disasters, dangers, and hardships, and these matters shall naturally disperse.\nYou must not fail to grasp Our intent. All you sentient beings, men and women,\nif you but receive the essential and wondrous arts of this scripture,\nyou shall sever and slay all illnesses, and ghostly disasters shall vanish of themselves.\nShould any ghost defy the true edict, the Demon Kings shall come to seize and bind them,\nslaying the ghostly brigands and shattering their skulls.\nWe command that their ghostly kin be torn asunder and cast into the pit.\nHasten! By edict and command!\n\nThe Celestial Worthy of Primordial Beginning proclaimed:\nIn the Lower Kalpa, sentient beings commit sins and perpetrate evil,\nengaging in the Five Inversions and unfilial acts, killing without reason, and tormenting their own bodies.\nTheir minds do not reflect; they cling to transient gains.\nThough they have long enjoyed glory and splendor in this world, they shall ultimately tread the path of death,\ntheir malevolent hearts unbroken. Rather than cease their transgressions,\nthey bring misfortune upon their descendants, who suffer bitterness and hardship,\ntheir debts and retributions impossible to clarify.\nWhen ghosts enter the Middle Kingdom, good and evil are made plain.\nThese ghosts are named the \"Heavenly Ghosts,\" for Heaven has dispatched them,\ncommanding them to lead tens of thousands to descend upon the ten directions,\nthe various states, prefectures, and counties of the world, to slay the wicked.\nHeavenly soldiers and ghostly emissaries drive these living people\nto perish amid the great disasters of blades, water, and fire.\nWhy do you, O people of the world, not believe in the great Dao,\nthus allowing these ghosts to traverse the world, stirring chaos among the living?\nThe land and its people, the kin of the realm, shall perish between Heaven and Earth,\ngreat illnesses afflicting them until the *jiayin* year.\nWater and fire shall contend, and ghostly pestilences shall abound.\nThe multitudes shall suffer grave illnesses, and Heaven’s judgments shall spread.\nIn this age of blades and warfare, people are often unfilial to their parents.\nSiblings turn against one another; prefectures and counties lie in ruin.\nThe land is emptied, and many perish in defeat.\nThe state having suffered disaster, the people too lack filial piety,\nthus inviting these calamities and upheavals.\nThe people of the world, benighted by heterodoxy, know not the true and correct words of the great Dao.\nFrom this time forth, those who with sincere hearts come to receive Our wondrous scripture of *samādhi*\nshall be attended by the Five Demon Heavenly Maidens, the Jade Lads of the Nine Radiant Flowers,\nthe Purple Clarity Wondrous Maidens, the Perfected of the Ten Chambers, the Great Soldiers of the Five Heavens,\nand ten thousand messengers and *li* warriors.\nWe dispatch the *samādhi* Dharma Masters of the Northern Thearch\nto the places where the Dao is practiced and the scriptures recited, where people are saved—\nall ghostly lords. We issue edicts to the Three Realms, commanding them to uphold Our true words.\nYou, Demon Kings, must swiftly release them and not detain them; grievances must be swiftly resolved.\nWe send forth the immortals of the various heavens, jade maidens and wondrous lads,\nbearing talismans and holding staffs, chanting hymns of praise to Heaven,\nto descend and rescue the multitudes from their afflictions.\nHasten! By edict and command!\n\nThe Celestial Worthy of Primordial Beginning proclaimed:\nIn the Lower Kalpa, sentient beings now face the age of Heaven’s destiny and the disasters of the Five Demons.\nThe world is thrown into chaos by ghostly factions, ignorant and unenlightened,\nunable to discern good from evil, tormenting themselves.\nIn this great era of the Lower Kalpa’s destiny and the great armies,\nthe ghostly soldiers of the Six Caverns shall emerge and traverse the world,\nseizing the people of the state—those who lack righteousness, do not believe, and do not follow the true Dharma—\ndriving them into the Three Evil Paths and delivering them to the pestilence ghosts to be beaten and slain.\nThese people, lacking righteousness and faith in the great Dao, are thus slain.\nBy the *yimao* year, those who disrespect Dharma Masters and do not believe in the great Dao\nshall swiftly be consigned to the Cinnabar Sand Hell by the Demon Kings and *li* warriors of the Three Heavens.\nHasten! As decreed by the great law of the Three Heavens.\nWe dispatch the Great-Eyed *Li* Warriors and the Messengers of the Central Heaven\nto follow the Dharma Masters in their practice of the Dao and their places of saving people,\nwhere the sick shall swiftly recover and official matters shall be swiftly resolved.\nAll you sentient beings, uphold Our divine incantations,\nand transmit them to the immeasurable *samādhi* Dharma Masters of the Northern Thearch.\nYou must revere your masters as Heaven reveres the four seasons, the sun and moon,\nand the eight solar terms that come and go. Bow and inquire of the Dharma Masters,\nasking whether they passed the night in peace.\nYou, all sentient beings, shall in future lives ascend as immortals, and the myriad spirits shall revere and serve you.\nFrom this time forth, We dispatch the *Li* Warriors of the Forest of Peers,\nthe Five Venerable Elders, the Great Immortals of the Ten Directions,\nthe Five Ding Messengers, and the Great Gods of the Ten Heavens\nto descend as one and guard and protect the people.\n\nThe people’s likes and dislikes, We too know them.\nThe winds and waters, however many, shall never lead to wrongful slaughter.\nAll you sentient beings must understand that the great Dao bestows Heaven’s grace,\nand know that the four seasons corrupt goodness, with cold and heat in measure.\nThis year, ghosts roam the land, and pestilence spreads far and wide.\nThose who contract this sickness shall perish in great numbers, for these ghosts are most rampant.\nYet if any come to revere the teachings of the *samādhi* Dharma Masters of the Northern Thearch,\nall affairs shall prosper, pestilence shall depart of itself,\nand all plague ghosts shall flee a thousand *li* away,\nwhile the Demon Kings of the Three Heavens descend to execute and slay.\nHasten the divine decrees!\n\nThe Most High Lord of the Dao Primordial declares:\nIn the lower kalpa, the age of the Earth Lords, the year of ten thousand afflictions,\na thousand myriad Earth Lord ghosts shall arise across the land,\nalong with white-headed ghosts, Five Wood ghosts, and Five Earth ghosts—\nred of eye, black of face, gaping of mouth—\nwho shall enter the states, counties, villages, and hamlets of the Middle Kingdom,\nspreading their pestilent poison to slay all people.\nThose who fail to honor the Three Treasures and the True Lords of the great Dao,\nwho disbelieve in the Daoist teachings,\nshall bring upon themselves the spread of thirty thousand plagues.\nIn the year *bǐng-chén*, a crimson pestilence shall sweep the land.\nThat year, the Crimson *Dīng* ghosts shall roam, spreading fiery contagion,\nthe plague of blades and warfare, to slaughter the myriad people—men and women alike.\nAncient enmities shall pursue them, and cursing ghosts shall seek them out,\ncraving the taste of blood and flesh, draining the vitality of the living.\nAfflicted by sudden illness, besieged by misfortune,\nhaunted by *wǎngliǎng* spirits, hounded by vengeful ghosts,\nburdened by official troubles, their sickness shall worsen,\nand their lives hang by a thread, nearing death.\nAs pestilence invades and great armies ravage the land,\nthe people shall know no peace, the five grains shall fail to ripen.\nWar shall claim lives, homes shall lie abandoned,\nlaws shall turn harsh, and the people shall lose the Way.\nThe noble shall cease their rites, incense and offerings shall not reach the Dharma Masters,\nand the great Dao shall be disbelieved.\nThus shall grace be spurned and the sacred law slighted.\nThe Most High shall dispatch the Crimson Cavalry Officers,\nbrandishing iron staves to patrol the land,\nseizing those who speak blasphemous words of treason and rebellion,\nwhom the Heavenly *Dīng* shall strike down.\nShould any ghosts or men refuse to submit, their guilt shall span ten thousand kalpas.\nIf they are not masters of ghosts, how can they be saved?\nHasten the divine decrees!\n\nThe Most High Lord of the Dao Primordial declares:\nIn the lower kalpa, the age governed by celestial portents,\nperverse spirits shall abound, and the land shall know no peace.\nGhost Kings shall traverse the land, spewing fire and disease.\nThese ghosts shall travel a thousand *li* by night,\nblighting horses, grain, and fields with sudden affliction.\nDemon ghosts shall spread great pestilence, and floods shall soon follow,\nwhile celestial plagues shall strike the people, who shall lose the Way.\nIn the year *dīng-sì*, the Raven-Yuan Ghost Lord shall unleash a myriad plagues,\nwhich shall spread across the ten directions, filling the land,\nand the people shall tremble in terror.\nGhost Lords shall gather daily, and the people shall find no refuge.\nBlades and warfare shall ravage the land, disrupting the realm.\nGhostly bandits shall devour men, official matters shall falter,\nand uprisings shall arise in the mountains and forests.\nEarth ghosts shall bring dysentery—crimson and black—\nto harm the people of Heaven.\nGood and evil shall be weighed, yet not in one place alone;\neach land shall face its own perils, and many shall turn to wickedness.\n“Gauging the hearts of men, five kinds of treacherous thoughts arise.\nThough they rely on Heaven and Earth, they know not human affairs,\nnor do they endure for long.\nSelf-made, self-destroyed, their families shall be ruined,\nscattered far and wide, their grievances extending even to the six relations.\nSuch deeds are evil and must not be done.\nThey shall lead to death and ruin, bringing calamity to families and nations,\nwhile armies surge across the land from south to north, disrupting the world.\nBlades shall clash, fathers south and sons north,\nthe land shall know no harmony, the people shall bear heavy burdens,\nand the myriad folk shall lose their livelihoods.\nSuch is the fate of the guilty.”\nHeavenly soldiers shall drive them into the fires of hell,\nwhere they shall suffer for ten thousand kalpas and more.\nYet if even one person reveres the Dao with wholehearted devotion,\ndelighting in the recitation of the great *sūtra* of the *samādhi* of the Northern Thearch,\nWe shall dispatch the Orthodox Unity Merit Officers,\nthe Great Gods of the Ten Directions, the *Lì* Warriors, and Jade Maidens\nto come to the aid of the people.\nAll the sick among sentient beings shall swiftly find deliverance,\nand official troubles shall be resolved.\nAll baleful □ ghosts shall flee ten thousand *li* away.\nShould any refuse to submit, they shall be delivered to Wenchang,\ntheir heads shattered and brains crushed—no Dharma Master may save them,\nand their factions shall be executed by the soldiers.\nHasten the divine decrees!\n\nThe Most High Lord of the Dao Primordial declares:\nIn the lower kalpa, the era of the Three Officials and the calamity of the Five Pestilences,\nmany shall fall ill, and the people of the land shall perish,\nas plagues spread unchecked.\nAll matters of the Three Realms shall be pursued by official laws,\nand punishments shall bring harm.\nNothing shall prosper, and slander shall arise.\nThe noble shall lose the Way, and calamity shall disrupt the land.\nGreat ghostly armies shall follow, and the people shall suffer.\nPlague ghosts shall spread, and the Three Officials shall exact their oaths.\nA hundred ghosts shall descend, bringing sickness to the living.\nMen and women shall suffer dysentery, and their descendants shall perish.\nIn the year *wù-wǔ*, a great pestilence shall strike the people of the land.\nHeavenly soldiers shall descend, and the people shall endure hardship,\nas the myriad beings face great disaster.\n\nShould any person turn toward the Three Honored Ones, receive the scriptures and uphold the Dharma, and venerate the North Emperor’s Samādhi Master by performing the Dao rituals—from this moment onward, if any suffer from pestilence, official misfortune, the calamity of great armies, the collapse of their dwellings, or the distress of their descendants, or if the myriad people face disaster—I shall dispatch the Great Halberd General, the Red Cavalry, the Red Infantry, and the Hundred-Tongued Messengers, each wielding a crimson staff, to slay all ghostly bandits among humankind. Should any minor ghost of illness claim to be a spirit of the Three Dukes or Five Emperors, I know well who you are. Every name of the plague ghosts lies within my grasp. If even one ghost refuses to depart, the Three Officials’ great armies shall descend to execute them all. Those plague ghosts who harass and disturb the living, along with those who bring official misfortune, shall be swiftly driven a thousand myriad leagues away. None shall be spared, and all shall be slain to the last fraction. Should any demon king fail to heed this command, they shall be the first to face a hundredfold punishment. Hasten, by the decree of the statutes and ordinances!\n\nThe Most High Lord of the Dao Primordial declares: In the era when the ghostly armies descend upon the lower realm, the people of the Middle Kingdom shall suffer greatly from illness and plague. The demon kings of the Three Caverns shall descend, along with the Six Palace Demon Kings who uphold the world, bringing ghostly armies into the Middle Kingdom—pestilence, flood, fire, and warfare shall throw the world into chaos. The myriad people shall fall ill, and humankind shall face peril. Ghosts from within and without shall spread great plague. The common folk shall flee in desperation as great demons disrupt the world and ghostly soldiers converge upon the people. In the year *jǐ-wèi*, the Beak-Headed Demon King, the Raven-Extended Great King, the Long-Nosed Great King, the Strong and Ominous Great King of the Inner and Outer Realms, the Small-Eyed Great King, the White-Faced Great King, and the Red-Faced Great King—each of you kings shall be examined. Your descendants and followers shall be bound by this decree. Should any person uphold the Dharma, receive the scriptures, and make offerings to the North Emperor’s Samādhi Master, the sick shall recover at once, and all affairs shall turn auspicious. You demon kings must swiftly command your ghostly minions to ensure the sick recover quickly, official troubles dissolve, and all matters resolve peacefully. If even one ghost resists, or if any demon king fails to comply, they shall be swiftly executed. Hasten, by the decree of the statutes and ordinances!\n\nThe Most High Lord of the Dao Primordial declares: From this moment onward, in the lower realm, countless thousands of ghosts shall come to the Middle Kingdom, and the myriad people shall endure suffering. The common folk shall fall ill, and official corvée shall multiply. Great floods shall come, and the noble shall lose the Way.\n\nOfficial disputes shall bring punishments, and unjust punishments shall spawn convicts. Perils and hardships shall entwine, and calamities shall lie with the Three Officials between Heaven and Earth. The deluded and base shall find no recourse. Yet if there be those who uphold the Dao and revere the sacred incantations of the Three Heavens, their illnesses shall heal of themselves, and their official troubles shall resolve on their own.\n\nFrom this moment until the year of Gengshen, should any of the myriad people venerate the *True Scripture of the North Emperor’s Samādhi*, the Most High shall issue this decree: You demon kings must command your subordinates that from this day forward, they shall not transgress against Our people. Swiftly order your ghostly legions to release the living, that illnesses may vanish at once, official troubles may not arise, and pestilential toxins may disperse. Hasten, by the decree of the statutes and ordinances!\n\nThe Most High Lord of the Dao Primordial declares: From this moment onward, the people of the lower realm shall suffer myriad afflictions. In the Middle Kingdom, there shall come ghost lords—the Long-Headed Ghost Lord, the Red-Faced Ghost Lord, the One Who Reverses the Chart Ghost Lord, and the Muchuan Ghost Lord—who shall enter the Middle Kingdom. They shall cause the king to turn tyrannical, ruler and minister to slaughter one another, and father and son to harm each other. The myriad people shall endure hardship, and the common folk shall face great disaster.\n\nBirth and death among the living grow frequent, and illness spreads among the people. Ghostly servitors wound one another, blades clash in slaughter. Ghostly legions spread poison, swiftly harming the living. In the year *xinyou*, the people of the realm shall know no peace—floodwaters shall rise ten thousand fathoms, and fish and dragons shall turn upon each other. High officials shall be displaced, ruler and minister shall rebel against one another, and the common folk shall wound each other. Illness and exile shall spread, and the people of the world shall perish to the last, their weeping one upon another. All this is the work of ghost lords stirring chaos in the world, depleting and harming the people. They shall cause the common folk to flee, the multitudes to fall ill, all manner of miasmic afflictions, and the black pestilence of evil. The Yellow Slaves and the Seven Sons shall come repeatedly, harming the people, their fields, and their silkworms, bringing illness to the myriad folk. Now that you know the names of these ghosts, from this moment onward, banish them a thousand *li* away. Hasten, by the decree of the statutes and ordinances!\n\nThe Most High Lord of the Dao Primordial declares: In the lower realm, the kalpa of ghostly legions shall begin. From this moment onward, many shall flee their homes, great armies shall rise, and the multitudes shall know no peace. The Three Heavenly Demon Kings shall enter the realm to spread disaster, and pestilence shall blanket the world. Households and the realm’s people shall know no peace. Bandits shall roam freely, and ghostly *qi* shall slay the people. The multitudes shall suffer great calamity—disasters of water and fire. In the year *renxu*, the king shall fall and perish, the myriad people shall scatter and flee, enduring hardship. Ten kinds of demon kings shall traverse the world, disturbing the sagely ruler, setting ruler and minister against one another, and father and son at odds. Chaos shall arise from below, the realm shall grow tyrannical, and the people shall perish. Yet if even one person in the realm receives and upholds the *Samādhi Sutra*, disasters shall vanish, and the people shall know peace. Now, the demon kings, lords of the celestial caverns, and heavenly hosts shall lay down their arms. The king and the people of the world shall revere the Dao and receive the sutra. You, divine kings, must swiftly descend to gather and restrain them, forbidding them to roam and spread illness, harming the myriad people. The lord of the realm and his great ministers shall all follow Our true Dao. We now decree to the demon kings: command the gathering of all ghosts in the world, that they may not disturb the households of the common folk. You must strictly obey the decree of the Most High. Henceforth, you shall not dare return to disturb the lord of the realm, his great ministers, or the myriad people. If illness or unresolved official matters persist, the heads of the ghost lords shall shatter into seven pieces. Hasten, by the decree of the statutes and ordinances!\n\nThe Most High Lord of the Dao Primordial declares: The people of the lower realm drift through their days, unaware that in the age of Great Jin, thirty thousand ghostly soldiers shall descend upon the royal realm, spreading great pestilence and crimson *qi*, and surging floods that reach the heavens. The Six Cavern Demon Kings shall traverse the world, pursuing and driving out the myriad people, their great armies slaughtering one another, and the hundred officials scattering in flight. The ghostly legions of the world shall hunger and famine, devouring the multitudes. The common folk shall flee—fathers south, sons north. Great bandits shall surge through the world, and the land shall be divided. The Five Paths shall know no peace, provinces and counties shall turn upon one another. High officials shall slay one another, lesser officials shall be displaced. The myriad people shall lose their livelihoods, and famine shall spread across the world, the living enduring disaster. In the year *guihai*, violent ghosts by the thousands and tens of thousands shall roam the world, slaying the living and disturbing the realm. They shall plunder and ravage property, and countless horses and riders shall be lost. Not only one region shall suffer, for the barbarians shall spread everywhere. Yet if even one person upholds the *Sutra of the Northern Emperor’s Samādhi Divine Incantation*, the myriad people shall all know peace, illness shall vanish at once, and all wishes shall be fulfilled. Great armies shall scatter of their own accord, ghostly bandits shall perish, and official disputes shall be resolved. The myriad people shall revere Our true words and the Dharma Masters. We shall dispatch mighty divine warriors, envoys of the Nine Heavens, the Eight Heavenly Ghost Lords, and demon kings, all to shield and protect the people of the realm. If any enter the Dao and uphold Our great Dharma, honoring the Dharma Masters of the Northern Emperor’s *Samādhi*, all evil ghosts shall flee a thousand *li* upon hearing of it. Should any disobey Our command, you ghost lords shall be of no use, and the great Dharma shall swiftly execute them. Hasten, by the decree of the statutes and ordinances!\n\nThe Most High Lord of the Dao Primordial declares: The multitudes of the lower realm shall encounter the great calamity of war, disasters of water and fire, and all manner of ghostly afflictions. We now reveal the *Thirty-Six Divine Decrees of the Northern Emperor’s Samādhi True Teachings and Wondrous Sutra*, spreading its transformation through the royal realm to instruct the multitudes, that they may know the great Dharma. Thus, the Dharma Masters of the Northern Emperor’s *Samādhi* shall descend to proclaim the teachings. Shall the emperor, great ministers, governors, and magistrates not turn toward the great Dao, that all matters may be resolved? When the Northern Emperor, the Great Sage, together with others proclaims this divine incantation, the demon kings of the heavens, the great gods, the Jade Maidens, the Brahmā Mothers, the Mysterious Maidens, the Generals of the Six *Jia*, the Envoys of the Six *Ding*, the Jade Lads of the Heavens, and the divine generals of the heavens shall all descend to bow their heads, wishing to hear this sutra’s divine arts. The Demon Kings and Heavenly Maidens say: From this day onward, if any in the Middle Kingdom suffer from grave illness or are on the verge of death, we, the demon kings and ghost lords, shall be the first to have our heads shattered into seven pieces. Hasten, by the decree of the statutes and ordinances!\n\nThe Most High Lord of the Dao Primordial declares: The multitudes of the lower realm shall face many celestial pestilences, and the great kalpa shall draw near. Floodwaters shall surge ten thousand fathoms, and the Three Disasters shall arise in competition. The Five Demon Epidemics and crimson *qi* shall converge. Great armies shall slaughter one another, and calamitous fires shall spread. Evil ghosts of the world shall wield fire to burn the lands of the people. The common folk shall flee, the myriad people shall endure hardship, and pestilence shall rage. Ghostly bandits shall grow wildly violent, disturbing the world. Great ministers shall know no peace, the multitudes shall perish, and disasters shall flow for ten thousand generations. Those who do evil shall die or be harmed, and the Three Disasters shall arise in competition. The people shall scatter and flee, ghostly legions shall drive out the people of the world. The world shall fall into great chaos, blades and weapons shall gather. Ruler and minister shall grow reckless and perish, and the king shall turn tyrannical. The myriad people shall spread pestilence, the common folk shall bring forth disaster, and a hundred kinds of illness shall slay them. Yet if the great Dharma spreads and the Middle Kingdom upholds it, the myriad households shall turn their hearts toward it. If they honor the Three Treasures, the great divine incantations, and the Dharma Masters of *Samādhi*, We Ourself, together with the great gods of the ten directions, the wondrous maidens and jade lads, the Green Dragon Generals, the warrior demons, the Heavenly *Ding* officials, the great envoys, and the Five Heavenly Messengers, shall each guard and intercept the pestilence ghosts wherever they may be.\n\nNow We command the demon kings, all dragon spirits, and the great aquatic hosts to descend into the world. Across the Three Realms and the ten directions, they shall transform and deliver the multitude of beings. Let the lands and all people—men and women alike—receive this great scripture, that the foolish and the wise may be distinguished. Not only shall all beings, immortals inscribed in the registers, be recorded in the Jade Calendar, delivered from the great calamities of flood, water peril, the Nine Palaces, and the Eight Adversities.\n\nFrom this day forth, all you beings who hear these great divine incantations and receive, uphold, and honor the great Dharma—We shall dispatch heavenly soldiers, transformed divine warriors, and hundreds of millions of celestial enforcers to follow wherever you may go. Wherever one transmits the scriptures and practices the Dao, ten thousand spirit officials from a thousand villages shall come to guard the sick, and the myriad people shall revere the great Dharma.\n\nHasten the decree! By the divine command of the Law.\n\n*The Wondrous Scripture of the Divine Incantations of the Purple Tenuity of the Northern Thearch of the Supreme Ultimate of the Cavernous Truth* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞真太极北帝紫微神咒妙经 经名：洞真太极北帝紫微神咒妙经。 撰人不详。 二经同卷。 底本出处：《正统道藏》洞真部本文类。 洞真太极北帝紫微神咒妙经 神兵护国安家驱鬼消灾奉勑咒品 元始天尊说：下元众生，多有恶逆。 聚生大国，不从正道。 自称强能，不知人命不久。 自今已去，大魔行运。 五浊之世，人多造横。 图谋众生，致害天下。 万民艰辛勤苦，众生受罪。 国人非法，刑祸相罚。 贼从下生，恶乱世界。 鬼兵入国，行其大灾之疫。 刀刃杀人，人转恶心造逆。 刑法相谋，鬼计多生，道途艰辛。 五种大贼，夜行杀人。 劫掠逃虏，逆党鬼贼。 汝等五种大鬼，作乱世界。 万民不安，小人负重。 州县勤苦，国土不正。 贵人元道，千鬼万邪，皆悉能害人。 令人家虚，万事不果。 死亡贼害，长病在室。 官鬼在家，怪鬼竞起。 人宅耗虚，百事不吉。 若有一人归向道要，奉吾勑令。 万灾可解，百疫自散。 官鬼大兵，自消不起。 风调雨顺，国土平正，万事皆善。 吾不虚言，有人受吾真言，亦自度灾危艰难，是事自然消散。 不可不明吾意，汝等众生男女，但受此经要妙之术，斩杀一切疾病，鬼灾自然消灭。 若有鬼违於真勑者，魔王来收摄，鬼贼斩分，头破脑裂。 令汝等鬼眷属，支离坑下。 急勑律令。 元始天尊说：下元众生，兴罪作恶，五逆不孝，非理杀害，自苦役身。 心不自思，存偶寓得。 在世已久履荣华，终归死路，恶心不断。 宁作罪咎，殃及子孙。 受苦辛酸，迭责难明。 及鬼入来中国，善恶晓分。 此鬼名，号称天之鬼，称：天遣我等，使领万千众，来下界十方诸国土州县，来杀恶人。 天兵鬼使，驱此生人，令落刀兵水火大灾之中死。 汝世人何不信大道，致有此鬼行於天下，动乱生人。 国土眷属，沦亡天地之问，大病相害到甲寅之中。 水火竞起，鬼疫甚多。 众生大病，天殃流行。 天下刀兵之世，人多不孝父母。 兄弟相逆，州县残荒。 国土空虚，人多死败。 国既受灾，人亦元孝，致得此灾动乱。 世人愚滞於邪，不知大道正真之言。 自今有志心，来受吾三昧妙经者，遣五魔天女仙子，九华玉童，紫清妙女，十室真人，五天大兵，使者力士万人。 下以北帝三昧法师，行道转经之地，救人之处，一切鬼主。 勑下三界，奉吾正言。 汝等魔王，急以放之不得执，冤速分解。 吾遣诸天仙人，玉女妙童，持符执节，咏赞天歌，来下救众生之难。 急勑律令。 元始天尊说：下元众生，今值天运之世，五魔之灾。 狂乱世界，鬼辈之人，愚元所识，不知善恶，自作苦恼。 下元大运大兵之世，六洞鬼兵，出行天下，收摄国人，取元义不信、不遵正法之人，大兵驱入三恶道中，付疫鬼打杀。 此人元义，不信大道之人，故杀之也。 以到乙卯之年，有人不敬法师，不信大道。 三天魔王力士，速付赤砂地狱。 急急如三天大法之令。 吾遣大目力士，中天使者，随法师行道之处，救人之地，病人急愈，官事速得解脱。 汝等一切众生，奉吾神咒，述及元量北帝三昧法师，汝等奉师，如天有四时、日月，八节来往，稽首问讯法师，夜来安泰否？ 汝等众生，后世亦得升仙，万神敬奉。 吾自今已去，遣同林力士，五老丈人，十方大仙，五丁使者，十天大神，一时来下，卫护人民。",
      "translated_text": "**The Wondrous Scripture of the Divine Incantations of the Purple Tenuity of the Northern Thearch of the Supreme Ultimate of the Cavernous Perfection**\n\n**Scripture Title:** *The Wondrous Scripture of the Divine Incantations of the Purple Tenuity of the Northern Thearch of the Supreme Ultimate of the Cavernous Perfection*. Author unknown. Two scriptures bound in one volume. Source text: *Daoist Canon of the Zhengtong Era*, Cavernous Perfection Division, Category of Original Texts.\n\n### *The Wondrous Scripture of the Divine Incantations of the Purple Tenuity of the Northern Thearch of the Supreme Ultimate*\n#### *Chapter on the Divine Incantations Empowered by Edict for the Divine Soldiers to Protect the State, Pacify Households, Expel Ghosts, and Dissolve Disasters*\n\nThe Celestial Worthy of Primordial Beginning proclaimed:\nIn the Lower Kalpa, sentient beings abound in wickedness and perversity.\nThey gather in great states yet do not follow the true Dao.\nThey boast of their own strength, unaware that human life is fleeting.\nFrom this time forth, the great demons shall hold sway.\nIn this world of the Five Turbidities, people commit manifold transgressions,\nscheming against the multitudes, bringing harm to the world.\nThe myriad people toil in hardship, all beings suffer punishment.\nThe people of the state act lawlessly, meting out punishments and calamities.\nBandits arise from below, sowing chaos in the world.\nGhostly soldiers invade the state, unleashing great pestilential disasters.\nBlades slaughter the people, who in turn grow malevolent and rebellious.\nLegal punishments are plotted, ghostly schemes multiply, and the roads grow perilous.\nFive kinds of great bandits roam by night, killing people,\nseizing and plundering, fleeing with captives—rebel factions and ghostly brigands.\nYou, the five kinds of great ghosts, wreak havoc in the world.\nThe myriad people know no peace; the humble bear heavy burdens.\nPrefectures and counties labor in hardship; the land is not governed justly.\nThe noble disregard the Dao, and a thousand ghosts and ten thousand demons all harm people,\nemptying households and leaving all affairs unfulfilled.\nDeath by banditry and harm, chronic illness in the home,\nofficial ghosts in the household, and monstrous ghosts arise in competition.\nThe people’s dwellings are depleted and drained; nothing prospers.\nYet if even one person turns toward the essentials of the Dao and upholds Our edict,\nthe myriad disasters may be resolved, and the hundred pestilences shall scatter of themselves.\nThe great armies of official ghosts shall dissipate and not arise.\nWinds will be harmonious, rains timely; the land will be level and just, and all affairs will flourish.\nWe do not speak falsely. Those who receive Our true words\nshall themselves transcend disasters, dangers, and hardships, and these matters shall naturally disperse.\nYou must not fail to grasp Our intent. All you sentient beings, men and women,\nif you but receive the essential and wondrous arts of this scripture,\nyou shall sever and slay all illnesses, and ghostly disasters shall vanish of themselves.\nShould any ghost defy the true edict, the Demon Kings shall come to seize and bind them,\nslaying the ghostly brigands and shattering their skulls.\nWe command that their ghostly kin be torn asunder and cast into the pit.\nHasten! By edict and command!\n\nThe Celestial Worthy of Primordial Beginning proclaimed:\nIn the Lower Kalpa, sentient beings commit sins and perpetrate evil,\nengaging in the Five Inversions and unfilial acts, killing without reason, and tormenting their own bodies.\nTheir minds do not reflect; they cling to transient gains.\nThough they have long enjoyed glory and splendor in this world, they shall ultimately tread the path of death,\ntheir malevolent hearts unbroken. Rather than cease their transgressions,\nthey bring misfortune upon their descendants, who suffer bitterness and hardship,\ntheir debts and retributions impossible to clarify.\nWhen ghosts enter the Middle Kingdom, good and evil are made plain.\nThese ghosts are named the \"Heavenly Ghosts,\" for Heaven has dispatched them,\ncommanding them to lead tens of thousands to descend upon the ten directions,\nthe various states, prefectures, and counties of the world, to slay the wicked.\nHeavenly soldiers and ghostly emissaries drive these living people\nto perish amid the great disasters of blades, water, and fire.\nWhy do you, O people of the world, not believe in the great Dao,\nthus allowing these ghosts to traverse the world, stirring chaos among the living?\nThe land and its people, the kin of the realm, shall perish between Heaven and Earth,\ngreat illnesses afflicting them until the *jiayin* year.\nWater and fire shall contend, and ghostly pestilences shall abound.\nThe multitudes shall suffer grave illnesses, and Heaven’s judgments shall spread.\nIn this age of blades and warfare, people are often unfilial to their parents.\nSiblings turn against one another; prefectures and counties lie in ruin.\nThe land is emptied, and many perish in defeat.\nThe state having suffered disaster, the people too lack filial piety,\nthus inviting these calamities and upheavals.\nThe people of the world, benighted by heterodoxy, know not the true and correct words of the great Dao.\nFrom this time forth, those who with sincere hearts come to receive Our wondrous scripture of *samādhi*\nshall be attended by the Five Demon Heavenly Maidens, the Jade Lads of the Nine Radiant Flowers,\nthe Purple Clarity Wondrous Maidens, the Perfected of the Ten Chambers, the Great Soldiers of the Five Heavens,\nand ten thousand messengers and *li* warriors.\nWe dispatch the *samādhi* Dharma Masters of the Northern Thearch\nto the places where the Dao is practiced and the scriptures recited, where people are saved—\nall ghostly lords. We issue edicts to the Three Realms, commanding them to uphold Our true words.\nYou, Demon Kings, must swiftly release them and not detain them; grievances must be swiftly resolved.\nWe send forth the immortals of the various heavens, jade maidens and wondrous lads,\nbearing talismans and holding staffs, chanting hymns of praise to Heaven,\nto descend and rescue the multitudes from their afflictions.\nHasten! By edict and command!\n\nThe Celestial Worthy of Primordial Beginning proclaimed:\nIn the Lower Kalpa, sentient beings now face the age of Heaven’s destiny and the disasters of the Five Demons.\nThe world is thrown into chaos by ghostly factions, ignorant and unenlightened,\nunable to discern good from evil, tormenting themselves.\nIn this great era of the Lower Kalpa’s destiny and the great armies,\nthe ghostly soldiers of the Six Caverns shall emerge and traverse the world,\nseizing the people of the state—those who lack righteousness, do not believe, and do not follow the true Dharma—\ndriving them into the Three Evil Paths and delivering them to the pestilence ghosts to be beaten and slain.\nThese people, lacking righteousness and faith in the great Dao, are thus slain.\nBy the *yimao* year, those who disrespect Dharma Masters and do not believe in the great Dao\nshall swiftly be consigned to the Cinnabar Sand Hell by the Demon Kings and *li* warriors of the Three Heavens.\nHasten! As decreed by the great law of the Three Heavens.\nWe dispatch the Great-Eyed *Li* Warriors and the Messengers of the Central Heaven\nto follow the Dharma Masters in their practice of the Dao and their places of saving people,\nwhere the sick shall swiftly recover and official matters shall be swiftly resolved.\nAll you sentient beings, uphold Our divine incantations,\nand transmit them to the immeasurable *samādhi* Dharma Masters of the Northern Thearch.\nYou must revere your masters as Heaven reveres the four seasons, the sun and moon,\nand the eight solar terms that come and go. Bow and inquire of the Dharma Masters,\nasking whether they passed the night in peace.\nYou, all sentient beings, shall in future lives ascend as immortals, and the myriad spirits shall revere and serve you.\nFrom this time forth, We dispatch the *Li* Warriors of the Forest of Peers,\nthe Five Venerable Elders, the Great Immortals of the Ten Directions,\nthe Five Ding Messengers, and the Great Gods of the Ten Heavens\nto descend as one and guard and protect the people.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1236,
      "start_sentence": 0,
      "end_sentence": 71,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.32077193260193,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\洞真太极北帝紫微神咒妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "百姓好恶，吾亦知之。 风水多少，终不枉杀。 汝等众生，合知大道有天恩，知四时败善，玲热多少。 此年天下有鬼，疫病散满。 天下人得此病，死亡零落者多，此鬼甚盛。 若有来奉北帝三昧法师法教者，万事皆善，疫病自去，一切疫鬼速走千里，三天魔王下来诛斩。 急勑律令。 元始天尊说：下元众生，土公之世，万疾之年。 天下有千万土公鬼，有白头鬼，有五木鬼，有五土鬼。 目赤，面黑，口阔，来入中国州县村坊。 行其瘟毒，悉皆杀人。 那不供养三宝大道真君，不信道法，致三万疫疠流行。 到丙辰之年，天下赤瘟病。 此年之中，有赤丁鬼，行火烧之疠，刀兵之疫，杀天下万民男女。 宿对冤雠，故来相逐。 咒咀大鬼，来觅众生，饮食血味，耗动生人。 疾病忙迫，病厄在身。 魍魉相及，鬼神相责，官事相加，病人转重，性命须臾至死。 病疫侵入，大兵扰乱天下。 国民不安，五谷不熟。 大兵杀人，宅舍不居。 法令强生，众生无道。 贵人不行，香火不供法师，不信大道。 恩愿故违，轻慢大法。 太上遣赤同骑吏，擎捉铁杖，游行天下。 取元义五逆恶言毁谤之人，天丁下斩之。 若有人鬼不伏者，罪及万劫。 不为鬼主，何可救之。 急勑律令。 元始天尊说：下元众生，所值天相之世，精邪甚多，国不太平。 鬼王行履天下，吐火灾病。 此鬼夜行千里，损害驰马谷麦田蚤，疾病惊动。 魔鬼行大疫疠，水来不久，天行疾病，万民无道。 到丁巳之年，乌丸鬼主，行万般疾疫。 流满天下十方，人民大惊。 鬼主日集，百姓不可居。 刀兵杀害，伤乱国土。 鬼贼食人，不安官事，数起山林。 土鬼行水痢赤黑病，伤害天人。 善恶度量，不唯一方，国土各有危难，人多转恶。 ‘忖人心意，五等逆想。 良托天地，不知人事，不永远。 自作自伐，家破灭亡，四散大小，支离怨及六亲。 如此之事，恶不可作。 以到死亡沦破，家国灾到，兵流天南海北，扰乱世界。 刀兵相凌，父南子北。 天下不和，百姓重役，万民失业。 如此之事，罪人受之。 天兵驱除，入火输地狱，万劫有余。 若有一人，奉道志心，乐诵北帝三昧大经。 吾当遣正一功曹，十方大神，力士玉女，来救助万民。 一切众生病者，速得解脱，官事解散。 一切殃□鬼，速去千万里之外。 若有不伏者，送付文昌，头破脑碎，法师不可救，兵诛党类。 急勑律令。 元始天尊说：下元众生，值三官之运，五疫之灾。 自今有病疫者多，国民死亡，病难流过。 三界万事，悉皆有官法追逐，刑法相害。 百事不利，口舌横生。 贵人无道，祸乱天下。 大国鬼兵相随，万民遭罪。 鬼疫布行，三官考誓。 百鬼下来，病难生人。 男女下痢，子孙病亡。 到戊午之年，天下大疫人民。 天兵下行，百姓受苦，众生大灾。",
      "translated_text": "The people’s likes and dislikes, We too know them.\nThe winds and waters, however many, shall never lead to wrongful slaughter.\nAll you sentient beings must understand that the great Dao bestows Heaven’s grace,\nand know that the four seasons corrupt goodness, with cold and heat in measure.\nThis year, ghosts roam the land, and pestilence spreads far and wide.\nThose who contract this sickness shall perish in great numbers, for these ghosts are most rampant.\nYet if any come to revere the teachings of the *samādhi* Dharma Masters of the Northern Thearch,\nall affairs shall prosper, pestilence shall depart of itself,\nand all plague ghosts shall flee a thousand *li* away,\nwhile the Demon Kings of the Three Heavens descend to execute and slay.\nHasten the divine decrees!\n\nThe Most High Lord of the Dao Primordial declares:\nIn the lower kalpa, the age of the Earth Lords, the year of ten thousand afflictions,\na thousand myriad Earth Lord ghosts shall arise across the land,\nalong with white-headed ghosts, Five Wood ghosts, and Five Earth ghosts—\nred of eye, black of face, gaping of mouth—\nwho shall enter the states, counties, villages, and hamlets of the Middle Kingdom,\nspreading their pestilent poison to slay all people.\nThose who fail to honor the Three Treasures and the True Lords of the great Dao,\nwho disbelieve in the Daoist teachings,\nshall bring upon themselves the spread of thirty thousand plagues.\nIn the year *bǐng-chén*, a crimson pestilence shall sweep the land.\nThat year, the Crimson *Dīng* ghosts shall roam, spreading fiery contagion,\nthe plague of blades and warfare, to slaughter the myriad people—men and women alike.\nAncient enmities shall pursue them, and cursing ghosts shall seek them out,\ncraving the taste of blood and flesh, draining the vitality of the living.\nAfflicted by sudden illness, besieged by misfortune,\nhaunted by *wǎngliǎng* spirits, hounded by vengeful ghosts,\nburdened by official troubles, their sickness shall worsen,\nand their lives hang by a thread, nearing death.\nAs pestilence invades and great armies ravage the land,\nthe people shall know no peace, the five grains shall fail to ripen.\nWar shall claim lives, homes shall lie abandoned,\nlaws shall turn harsh, and the people shall lose the Way.\nThe noble shall cease their rites, incense and offerings shall not reach the Dharma Masters,\nand the great Dao shall be disbelieved.\nThus shall grace be spurned and the sacred law slighted.\nThe Most High shall dispatch the Crimson Cavalry Officers,\nbrandishing iron staves to patrol the land,\nseizing those who speak blasphemous words of treason and rebellion,\nwhom the Heavenly *Dīng* shall strike down.\nShould any ghosts or men refuse to submit, their guilt shall span ten thousand kalpas.\nIf they are not masters of ghosts, how can they be saved?\nHasten the divine decrees!\n\nThe Most High Lord of the Dao Primordial declares:\nIn the lower kalpa, the age governed by celestial portents,\nperverse spirits shall abound, and the land shall know no peace.\nGhost Kings shall traverse the land, spewing fire and disease.\nThese ghosts shall travel a thousand *li* by night,\nblighting horses, grain, and fields with sudden affliction.\nDemon ghosts shall spread great pestilence, and floods shall soon follow,\nwhile celestial plagues shall strike the people, who shall lose the Way.\nIn the year *dīng-sì*, the Raven-Yuan Ghost Lord shall unleash a myriad plagues,\nwhich shall spread across the ten directions, filling the land,\nand the people shall tremble in terror.\nGhost Lords shall gather daily, and the people shall find no refuge.\nBlades and warfare shall ravage the land, disrupting the realm.\nGhostly bandits shall devour men, official matters shall falter,\nand uprisings shall arise in the mountains and forests.\nEarth ghosts shall bring dysentery—crimson and black—\nto harm the people of Heaven.\nGood and evil shall be weighed, yet not in one place alone;\neach land shall face its own perils, and many shall turn to wickedness.\n“Gauging the hearts of men, five kinds of treacherous thoughts arise.\nThough they rely on Heaven and Earth, they know not human affairs,\nnor do they endure for long.\nSelf-made, self-destroyed, their families shall be ruined,\nscattered far and wide, their grievances extending even to the six relations.\nSuch deeds are evil and must not be done.\nThey shall lead to death and ruin, bringing calamity to families and nations,\nwhile armies surge across the land from south to north, disrupting the world.\nBlades shall clash, fathers south and sons north,\nthe land shall know no harmony, the people shall bear heavy burdens,\nand the myriad folk shall lose their livelihoods.\nSuch is the fate of the guilty.”\nHeavenly soldiers shall drive them into the fires of hell,\nwhere they shall suffer for ten thousand kalpas and more.\nYet if even one person reveres the Dao with wholehearted devotion,\ndelighting in the recitation of the great *sūtra* of the *samādhi* of the Northern Thearch,\nWe shall dispatch the Orthodox Unity Merit Officers,\nthe Great Gods of the Ten Directions, the *Lì* Warriors, and Jade Maidens\nto come to the aid of the people.\nAll the sick among sentient beings shall swiftly find deliverance,\nand official troubles shall be resolved.\nAll baleful □ ghosts shall flee ten thousand *li* away.\nShould any refuse to submit, they shall be delivered to Wenchang,\ntheir heads shattered and brains crushed—no Dharma Master may save them,\nand their factions shall be executed by the soldiers.\nHasten the divine decrees!\n\nThe Most High Lord of the Dao Primordial declares:\nIn the lower kalpa, the era of the Three Officials and the calamity of the Five Pestilences,\nmany shall fall ill, and the people of the land shall perish,\nas plagues spread unchecked.\nAll matters of the Three Realms shall be pursued by official laws,\nand punishments shall bring harm.\nNothing shall prosper, and slander shall arise.\nThe noble shall lose the Way, and calamity shall disrupt the land.\nGreat ghostly armies shall follow, and the people shall suffer.\nPlague ghosts shall spread, and the Three Officials shall exact their oaths.\nA hundred ghosts shall descend, bringing sickness to the living.\nMen and women shall suffer dysentery, and their descendants shall perish.\nIn the year *wù-wǔ*, a great pestilence shall strike the people of the land.\nHeavenly soldiers shall descend, and the people shall endure hardship,\nas the myriad beings face great disaster.",
      "overlap_context": "ht solar terms that come and go. Bow and inquire of the Dharma Masters,\nasking whether they passed the night in peace.\nYou, all sentient beings, shall in future lives ascend as immortals, and the myriad spirits shall revere and serve you.\nFrom this time forth, We dispatch the *Li* Warriors of the Forest of Peers,\nthe Five Venerable Elders, the Great Immortals of the Ten Directions,\nthe Five Ding Messengers, and the Great Gods of the Ten Heavens\nto descend as one and guard and protect the people.",
      "start_char": 1236,
      "end_char": 2275,
      "start_sentence": 72,
      "end_sentence": 137,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.49612832069397,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\洞真太极北帝紫微神咒妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "若有一人，回向三尊，受经奉法，奉重北帝三昧法师行道。 自今已后，有人病疫官事，大兵之难，宅舍倾危，子孙不安，万民有灾。 吾遣大戟将军，赤骑兵马，赤卒小使，百舌使者，手持赤棒，杀一切人间鬼贼。 行病小鬼，自称三公五帝之神，吾亦知汝。 一切疫鬼名字，在吾手中。 若有一鬼不去，三官大兵下来，诛斩一切。 鬼疫挠乱生人，及有官事，急驱千万里外。 不得漏落，斩之万分。 如有魔王不加用意，先到百分矣。 急勑律令。 元始天尊说：下元众生，若值鬼兵之世，中国人民疾病苦疫者多，三洞魔王下。 持世六宫大魔，行鬼兵来中国，疾疫水火刀兵，乱其世界。 病疾万民，生人危难，内外鬼悉来行大疫。 百姓奔波，大魔扰乱世界，鬼兵交集人。 到己未之年，天有啄头魔王，乌延大王，长鼻大王，中外强祥大王，小眼大王，白面大王，赤面大王，汝等王各当被考。 汝等子孙，勅勒汝等鬼王。 若有一人奉法受经，供养北帝三昧法师，病人立瘥，万事皆吉。 汝等鬼王急勅汝等鬼，令病者速好，官事速解，百事和善。 若一鬼不伏，魔王不用意，急斩之。 急勑律令。 元始天尊说：下元众生，自今已去，万千鬼来中国，万民受苦。 百姓病疾，公役甚多。 大水欲来，贵人无道。",
      "translated_text": "Should any person turn toward the Three Honored Ones, receive the scriptures and uphold the Dharma, and venerate the North Emperor’s Samādhi Master by performing the Dao rituals—from this moment onward, if any suffer from pestilence, official misfortune, the calamity of great armies, the collapse of their dwellings, or the distress of their descendants, or if the myriad people face disaster—I shall dispatch the Great Halberd General, the Red Cavalry, the Red Infantry, and the Hundred-Tongued Messengers, each wielding a crimson staff, to slay all ghostly bandits among humankind. Should any minor ghost of illness claim to be a spirit of the Three Dukes or Five Emperors, I know well who you are. Every name of the plague ghosts lies within my grasp. If even one ghost refuses to depart, the Three Officials’ great armies shall descend to execute them all. Those plague ghosts who harass and disturb the living, along with those who bring official misfortune, shall be swiftly driven a thousand myriad leagues away. None shall be spared, and all shall be slain to the last fraction. Should any demon king fail to heed this command, they shall be the first to face a hundredfold punishment. Hasten, by the decree of the statutes and ordinances!\n\nThe Most High Lord of the Dao Primordial declares: In the era when the ghostly armies descend upon the lower realm, the people of the Middle Kingdom shall suffer greatly from illness and plague. The demon kings of the Three Caverns shall descend, along with the Six Palace Demon Kings who uphold the world, bringing ghostly armies into the Middle Kingdom—pestilence, flood, fire, and warfare shall throw the world into chaos. The myriad people shall fall ill, and humankind shall face peril. Ghosts from within and without shall spread great plague. The common folk shall flee in desperation as great demons disrupt the world and ghostly soldiers converge upon the people. In the year *jǐ-wèi*, the Beak-Headed Demon King, the Raven-Extended Great King, the Long-Nosed Great King, the Strong and Ominous Great King of the Inner and Outer Realms, the Small-Eyed Great King, the White-Faced Great King, and the Red-Faced Great King—each of you kings shall be examined. Your descendants and followers shall be bound by this decree. Should any person uphold the Dharma, receive the scriptures, and make offerings to the North Emperor’s Samādhi Master, the sick shall recover at once, and all affairs shall turn auspicious. You demon kings must swiftly command your ghostly minions to ensure the sick recover quickly, official troubles dissolve, and all matters resolve peacefully. If even one ghost resists, or if any demon king fails to comply, they shall be swiftly executed. Hasten, by the decree of the statutes and ordinances!\n\nThe Most High Lord of the Dao Primordial declares: From this moment onward, in the lower realm, countless thousands of ghosts shall come to the Middle Kingdom, and the myriad people shall endure suffering. The common folk shall fall ill, and official corvée shall multiply. Great floods shall come, and the noble shall lose the Way.",
      "overlap_context": "lamity shall disrupt the land.\nGreat ghostly armies shall follow, and the people shall suffer.\nPlague ghosts shall spread, and the Three Officials shall exact their oaths.\nA hundred ghosts shall descend, bringing sickness to the living.\nMen and women shall suffer dysentery, and their descendants shall perish.\nIn the year *wù-wǔ*, a great pestilence shall strike the people of the land.\nHeavenly soldiers shall descend, and the people shall endure hardship,\nas the myriad beings face great disaster.",
      "start_char": 2275,
      "end_char": 2759,
      "start_sentence": 138,
      "end_sentence": 160,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.306575775146484,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\洞真太极北帝紫微神咒妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "官事相罚，横生刑徒。 危难相缠，厄在三官，天地之间。 惑乱小人，不得自理。 若有人奉道，敬贵三天真言。 疾病自瘥，官事自了。 自今以到庚申之年，万民有奉北帝三昧真经者，太上有勅：汝等鬼王，当自勅告下，从今已后，不得犯吾万民。 急勅汝等鬼兵等，速放生人，疾病立瘥，官事不起，疫毒消散。 急勑律令。 元始天尊说：下元生人，自今以去，病患甚多。 中国有鬼主，长头鬼主，赤面鬼主，一反图鬼主，慕川鬼主，来入中国。 使国王暴逆，君臣相残，父子相害。 万民艰苦，百姓大灾。",
      "translated_text": "Official disputes shall bring punishments, and unjust punishments shall spawn convicts. Perils and hardships shall entwine, and calamities shall lie with the Three Officials between Heaven and Earth. The deluded and base shall find no recourse. Yet if there be those who uphold the Dao and revere the sacred incantations of the Three Heavens, their illnesses shall heal of themselves, and their official troubles shall resolve on their own.\n\nFrom this moment until the year of Gengshen, should any of the myriad people venerate the *True Scripture of the North Emperor’s Samādhi*, the Most High shall issue this decree: You demon kings must command your subordinates that from this day forward, they shall not transgress against Our people. Swiftly order your ghostly legions to release the living, that illnesses may vanish at once, official troubles may not arise, and pestilential toxins may disperse. Hasten, by the decree of the statutes and ordinances!\n\nThe Most High Lord of the Dao Primordial declares: From this moment onward, the people of the lower realm shall suffer myriad afflictions. In the Middle Kingdom, there shall come ghost lords—the Long-Headed Ghost Lord, the Red-Faced Ghost Lord, the One Who Reverses the Chart Ghost Lord, and the Muchuan Ghost Lord—who shall enter the Middle Kingdom. They shall cause the king to turn tyrannical, ruler and minister to slaughter one another, and father and son to harm each other. The myriad people shall endure hardship, and the common folk shall face great disaster.",
      "overlap_context": "lve peacefully. If even one ghost resists, or if any demon king fails to comply, they shall be swiftly executed. Hasten, by the decree of the statutes and ordinances!\n\nThe Most High Lord of the Dao Primordial declares: From this moment onward, in the lower realm, countless thousands of ghosts shall come to the Middle Kingdom, and the myriad people shall endure suffering. The common folk shall fall ill, and official corvée shall multiply. Great floods shall come, and the noble shall lose the Way.",
      "start_char": 2759,
      "end_char": 2981,
      "start_sentence": 161,
      "end_sentence": 172,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.049337387084961,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\洞真太极北帝紫微神咒妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "生人死亡，人多疾病。 鬼役相伤，刀兵相杀。 鬼兵行毒，疾害生人。 到辛酉之年，国民不安，水灾万丈，鱼龙相戮。 大官相移，君臣相逆，百姓相伤？ 疾病流亡，天下人民死绝，一及哭相侵。 悉是鬼主作乱世界，耗害人民。 令人百姓逃亡，众生病疾，一切瘴疾，恶黑病疠。 黄奴七子频来，损人口田蚕，病疾万民。 知汝等鬼名字，自今已去，斥去千里。 急勑律令。 元始天尊说：下元众生，鬼兵之劫，自今已去，人多流亡，国兵大起，兆庶不安。 三天魔王入国行灾，瘟疫布满天下，家国万民不安。 盗贼流行，鬼炁杀人。 众生受其大灾，水火之难。 到壬戌年，国王败亡，散失万民，逃亡受苦。 有十种魔王，行履天下。 挠乱圣主，君臣相逆，父子相疑。 乱从下生，国暴人亡。 国有一人，奉受三昧经者，灾消，人民平正。 今有魔王诸天洞主，兵平，国王世人，奉道受经。 汝等神王急下收摄，不得乱行疾病，损伤万民。 国主大臣，悉皆奉吾正道。 吾勅下以魔王，令收摄世上一切鬼，不得动乱百姓眷属。 汝等切从太上勑，以后不敢复来挠乱国主大臣万民。 若复有人疾病，官事不了，鬼主头破作七分矣。 急勑律令。 元始天尊说：下元生人，悠悠过日，不知大晋之世，三万鬼兵下行王国，布大疫赤炁，凌天洪波。 六洞魔王行满天下，讨逐万民，大兵相诛，百官散失。 天下鬼兵饥馑，啖食众生。 百姓流亡，父南子北。 大贼逆流天下，国土分散。 五道不宁，州县相残。 大官相诛，小官相移。 万民失业，荒流天下，生人受灾。 到癸亥之年，暴鬼千万，行绕天下。 杀伤生人，扰乱世界。 损失虐暴财物，驰马损伤无数。 不唯一方，夷戎遍及。 若一人奉《北帝三昧神咒经》，万民悉安，疾病立瘥，万愿从心。 大兵自散，鬼贼自亡，官争解脱。 万民敬重吾真言及法师，吾遣大神力士，九天使者，八天鬼主魔王，皆来拥护国人。 若有入道奉吾大法，供养北帝三昧法师，一切恶鬼闻之，急去千里。 若不从吾令者，汝等鬼主不加用意，大法急斩矣。 急勑律令。 元始天尊说：下元众生，值大兵之疫，水火之难，一切鬼灾。 吾今故出《北帝三昧正教神咒妙经》三十六神勑，布化王国，教化众生，令知大法。 故北帝三昧法师，下行谕教？ 帝王大臣令长方伯二千石，令归向大道，万事皆合。 北帝大圣同说此神咒之时，诸天魔王大神，玉女梵母，玄女六甲将军，六丁使者，诸天玉童，诸天神将，并下稽首，愿闻此经神术。 魔王天女曰：自今日已后，中国有病困笃不存者，我辈魔王鬼主，先遭头破作七分矣。 急勑律令。 元始天尊说：下元众生，天疫甚多，大劫垂至。 水流千万丈，三灾竞起。 五魔大疫，赤炁交集。 大兵相杀，灾火流行。 天下恶鬼，持火烧人国土。 百姓流亡，万民受艰苦，病疫甚盛。 鬼贼大狂，扰乱天下。 大臣不安，众生死尽，灾流万代。 为恶死伤，三灾竞起。 人民流散，鬼兵驱除世人。 天下大乱，刀兵聚集。 君臣荒亡，国王暴逆。 万民造疫，百姓起灾，百种病杀。 自请大法流行，中国奉行，万姓归心。 供养三宝大神咒术，及有三昧法师者，吾自与十方大神，妙女玉童，青龙将军，力士魔王，天丁大吏，五天使者，各所在遮截疫鬼。",
      "translated_text": "Birth and death among the living grow frequent, and illness spreads among the people. Ghostly servitors wound one another, blades clash in slaughter. Ghostly legions spread poison, swiftly harming the living. In the year *xinyou*, the people of the realm shall know no peace—floodwaters shall rise ten thousand fathoms, and fish and dragons shall turn upon each other. High officials shall be displaced, ruler and minister shall rebel against one another, and the common folk shall wound each other. Illness and exile shall spread, and the people of the world shall perish to the last, their weeping one upon another. All this is the work of ghost lords stirring chaos in the world, depleting and harming the people. They shall cause the common folk to flee, the multitudes to fall ill, all manner of miasmic afflictions, and the black pestilence of evil. The Yellow Slaves and the Seven Sons shall come repeatedly, harming the people, their fields, and their silkworms, bringing illness to the myriad folk. Now that you know the names of these ghosts, from this moment onward, banish them a thousand *li* away. Hasten, by the decree of the statutes and ordinances!\n\nThe Most High Lord of the Dao Primordial declares: In the lower realm, the kalpa of ghostly legions shall begin. From this moment onward, many shall flee their homes, great armies shall rise, and the multitudes shall know no peace. The Three Heavenly Demon Kings shall enter the realm to spread disaster, and pestilence shall blanket the world. Households and the realm’s people shall know no peace. Bandits shall roam freely, and ghostly *qi* shall slay the people. The multitudes shall suffer great calamity—disasters of water and fire. In the year *renxu*, the king shall fall and perish, the myriad people shall scatter and flee, enduring hardship. Ten kinds of demon kings shall traverse the world, disturbing the sagely ruler, setting ruler and minister against one another, and father and son at odds. Chaos shall arise from below, the realm shall grow tyrannical, and the people shall perish. Yet if even one person in the realm receives and upholds the *Samādhi Sutra*, disasters shall vanish, and the people shall know peace. Now, the demon kings, lords of the celestial caverns, and heavenly hosts shall lay down their arms. The king and the people of the world shall revere the Dao and receive the sutra. You, divine kings, must swiftly descend to gather and restrain them, forbidding them to roam and spread illness, harming the myriad people. The lord of the realm and his great ministers shall all follow Our true Dao. We now decree to the demon kings: command the gathering of all ghosts in the world, that they may not disturb the households of the common folk. You must strictly obey the decree of the Most High. Henceforth, you shall not dare return to disturb the lord of the realm, his great ministers, or the myriad people. If illness or unresolved official matters persist, the heads of the ghost lords shall shatter into seven pieces. Hasten, by the decree of the statutes and ordinances!\n\nThe Most High Lord of the Dao Primordial declares: The people of the lower realm drift through their days, unaware that in the age of Great Jin, thirty thousand ghostly soldiers shall descend upon the royal realm, spreading great pestilence and crimson *qi*, and surging floods that reach the heavens. The Six Cavern Demon Kings shall traverse the world, pursuing and driving out the myriad people, their great armies slaughtering one another, and the hundred officials scattering in flight. The ghostly legions of the world shall hunger and famine, devouring the multitudes. The common folk shall flee—fathers south, sons north. Great bandits shall surge through the world, and the land shall be divided. The Five Paths shall know no peace, provinces and counties shall turn upon one another. High officials shall slay one another, lesser officials shall be displaced. The myriad people shall lose their livelihoods, and famine shall spread across the world, the living enduring disaster. In the year *guihai*, violent ghosts by the thousands and tens of thousands shall roam the world, slaying the living and disturbing the realm. They shall plunder and ravage property, and countless horses and riders shall be lost. Not only one region shall suffer, for the barbarians shall spread everywhere. Yet if even one person upholds the *Sutra of the Northern Emperor’s Samādhi Divine Incantation*, the myriad people shall all know peace, illness shall vanish at once, and all wishes shall be fulfilled. Great armies shall scatter of their own accord, ghostly bandits shall perish, and official disputes shall be resolved. The myriad people shall revere Our true words and the Dharma Masters. We shall dispatch mighty divine warriors, envoys of the Nine Heavens, the Eight Heavenly Ghost Lords, and demon kings, all to shield and protect the people of the realm. If any enter the Dao and uphold Our great Dharma, honoring the Dharma Masters of the Northern Emperor’s *Samādhi*, all evil ghosts shall flee a thousand *li* upon hearing of it. Should any disobey Our command, you ghost lords shall be of no use, and the great Dharma shall swiftly execute them. Hasten, by the decree of the statutes and ordinances!\n\nThe Most High Lord of the Dao Primordial declares: The multitudes of the lower realm shall encounter the great calamity of war, disasters of water and fire, and all manner of ghostly afflictions. We now reveal the *Thirty-Six Divine Decrees of the Northern Emperor’s Samādhi True Teachings and Wondrous Sutra*, spreading its transformation through the royal realm to instruct the multitudes, that they may know the great Dharma. Thus, the Dharma Masters of the Northern Emperor’s *Samādhi* shall descend to proclaim the teachings. Shall the emperor, great ministers, governors, and magistrates not turn toward the great Dao, that all matters may be resolved? When the Northern Emperor, the Great Sage, together with others proclaims this divine incantation, the demon kings of the heavens, the great gods, the Jade Maidens, the Brahmā Mothers, the Mysterious Maidens, the Generals of the Six *Jia*, the Envoys of the Six *Ding*, the Jade Lads of the Heavens, and the divine generals of the heavens shall all descend to bow their heads, wishing to hear this sutra’s divine arts. The Demon Kings and Heavenly Maidens say: From this day onward, if any in the Middle Kingdom suffer from grave illness or are on the verge of death, we, the demon kings and ghost lords, shall be the first to have our heads shattered into seven pieces. Hasten, by the decree of the statutes and ordinances!\n\nThe Most High Lord of the Dao Primordial declares: The multitudes of the lower realm shall face many celestial pestilences, and the great kalpa shall draw near. Floodwaters shall surge ten thousand fathoms, and the Three Disasters shall arise in competition. The Five Demon Epidemics and crimson *qi* shall converge. Great armies shall slaughter one another, and calamitous fires shall spread. Evil ghosts of the world shall wield fire to burn the lands of the people. The common folk shall flee, the myriad people shall endure hardship, and pestilence shall rage. Ghostly bandits shall grow wildly violent, disturbing the world. Great ministers shall know no peace, the multitudes shall perish, and disasters shall flow for ten thousand generations. Those who do evil shall die or be harmed, and the Three Disasters shall arise in competition. The people shall scatter and flee, ghostly legions shall drive out the people of the world. The world shall fall into great chaos, blades and weapons shall gather. Ruler and minister shall grow reckless and perish, and the king shall turn tyrannical. The myriad people shall spread pestilence, the common folk shall bring forth disaster, and a hundred kinds of illness shall slay them. Yet if the great Dharma spreads and the Middle Kingdom upholds it, the myriad households shall turn their hearts toward it. If they honor the Three Treasures, the great divine incantations, and the Dharma Masters of *Samādhi*, We Ourself, together with the great gods of the ten directions, the wondrous maidens and jade lads, the Green Dragon Generals, the warrior demons, the Heavenly *Ding* officials, the great envoys, and the Five Heavenly Messengers, shall each guard and intercept the pestilence ghosts wherever they may be.",
      "overlap_context": "onward, the people of the lower realm shall suffer myriad afflictions. In the Middle Kingdom, there shall come ghost lords—the Long-Headed Ghost Lord, the Red-Faced Ghost Lord, the One Who Reverses the Chart Ghost Lord, and the Muchuan Ghost Lord—who shall enter the Middle Kingdom. They shall cause the king to turn tyrannical, ruler and minister to slaughter one another, and father and son to harm each other. The myriad people shall endure hardship, and the common folk shall face great disaster.",
      "start_char": 2981,
      "end_char": 4204,
      "start_sentence": 173,
      "end_sentence": 239,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.39051079750061,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\洞真太极北帝紫微神咒妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "今勅魔王，一切龙鬼，水骑大兵，自来世间。 三界十方，化度众生。 令国土万民男女，受此大经，分别愚智。 不但一切众生，仙人注簿，得在玉历之中，脱兔洪灾水厄九宫八难之中。 汝等一切众生，自今已去，能得闻此大神咒术，及受持供养大法者。 吾遣天兵化人力士亿万，常来逐子等所行之方。 有人转经行道者，十乡灵官千万，来守护病人，万民奉重大法。 急勑律令。 洞真太极北帝紫微神咒妙经竟",
      "translated_text": "Now We command the demon kings, all dragon spirits, and the great aquatic hosts to descend into the world. Across the Three Realms and the ten directions, they shall transform and deliver the multitude of beings. Let the lands and all people—men and women alike—receive this great scripture, that the foolish and the wise may be distinguished. Not only shall all beings, immortals inscribed in the registers, be recorded in the Jade Calendar, delivered from the great calamities of flood, water peril, the Nine Palaces, and the Eight Adversities.\n\nFrom this day forth, all you beings who hear these great divine incantations and receive, uphold, and honor the great Dharma—We shall dispatch heavenly soldiers, transformed divine warriors, and hundreds of millions of celestial enforcers to follow wherever you may go. Wherever one transmits the scriptures and practices the Dao, ten thousand spirit officials from a thousand villages shall come to guard the sick, and the myriad people shall revere the great Dharma.\n\nHasten the decree! By the divine command of the Law.\n\n*The Wondrous Scripture of the Divine Incantations of the Purple Tenuity of the Northern Thearch of the Supreme Ultimate of the Cavernous Truth* concludes.",
      "overlap_context": " and the Middle Kingdom upholds it, the myriad households shall turn their hearts toward it. If they honor the Three Treasures, the great divine incantations, and the Dharma Masters of *Samādhi*, We Ourself, together with the great gods of the ten directions, the wondrous maidens and jade lads, the Green Dragon Generals, the warrior demons, the Heavenly *Ding* officials, the great envoys, and the Five Heavenly Messengers, shall each guard and intercept the pestilence ghosts wherever they may be.",
      "start_char": 4204,
      "end_char": 4385,
      "start_sentence": 240,
      "end_sentence": 248,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.187302112579346,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\洞真太极北帝紫微神咒妙经.txt",
        "category": "本文类"
      }
    }
  ]
}