{
  "source_id": "洞真太上三元流珠经",
  "source_file": "chunked_daozang\\洞真太上三元流珠经.json",
  "total_chunks": 2,
  "total_original_chars": 2095,
  "total_translated_chars": 12949,
  "total_translation_time": 62.1407356262207,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\洞真太上三元流珠经.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Upper Cavern Perfection Scripture of the Three Primes’ Flowing Pearls**\n\n**Scripture Title:** *The Upper Cavern Perfection Scripture of the Three Primes’ Flowing Pearls*. Author unknown, likely composed during the Northern and Southern Dynasties. It expounds methods of spirit preservation and life-nurturing arts. The *Supreme Secret Essentials* (vol. 47) states that the original text contained four formulas in eight scrolls, but only one scroll now remains.\n\n**Source:** *Zhengtong Daoist Canon*, Orthodox Section, Part One.\n\n---\n\n**The Scripture of the Three Primes’ Flowing Pearls**\n\nThe Scripture of the Three Primes’ Flowing Pearls is the practice of the Controller of Destiny. Its Dao is wondrous and vast, the most revered of the Five Classics. For its transmission, one employs three hundred and sixty-five white true pearls, round and luminous, each the size of a tung seed, corresponding to the degrees of the stellar lodges and the conjunctions of the sun and moon. Twenty-four feet each of crimson and yellow silk are used to swear oaths before the yin-yang spirit officials, invoking the Dao of extended harmony. Twenty-four *qi* are pledged in a pure fast, and the transmission is conferred after invocation. It is passed down once every three hundred years, and after five transmissions, it ceases to be bestowed. This is the Dao of the Supreme Polarity, the Duke, the Minister, and the Controller of Destiny.\n\nIn all people, the space between the eyebrows, one *cun* inward, is the Hall of Light; two *cun* inward, the Cavern Chamber; three *cun* inward, the Cinnabar Field; and four *cun* inward, the Flowing Pearl. Within the Flowing Pearl Palace resides the Upper Supreme Unity Lord, seated upon a radiant throne, crowned within the Purple Chamber. The Controller of Destiny comes and goes, consulting and receiving the records of fate. For transgressions, it subtracts from life and inscribes death; for merits, it removes death and restores life. Those who live by this method, establishing merit and avoiding fault, may have the Controller of Destiny memorialize the Upper Supreme Unity to extend their years and increase their lifespan. Though it does not yet attain the subtlety of the Four Palaces and the Feminine Unity, it is indeed the loftiness of the Five Palaces and the Masculine Unity.\n\nFor those who cultivate the *Eight Scrolls of the Yellow Writ of the Grand Tenuity*, its effects are precise and efficacious, revealing the Flowing Pearl. Without sight of the Flowing Pearl, one sinks into the Eight Lives, toiling in cycles of return, with no means to ascend to the Mysterium. The essentials of Mysterium ascent lie in the Flowing Pearl. When the pearl shines in the Upper Palace, its radiance flows through the Nine Treasuries, penetrating within and without, unobstructed and unbound. One roams freely above the Nine Heavens and feasts within the Three Clarities.\n\n---\n\n**The Nine Terraces Talisman**\n**Oral Instructions of Master Feng, the Upper Clarity Perfected**\n\nThe Dao of the student must first treat illness, ensuring the body is free of deficiency and evil, and that blood, brain, and fluids are not diminished or stagnant. Without this prior treatment, even the ingestion of medicines and the circulation of *qi* will be of no benefit to the body.\n\nIn former times, there was a Daoist named Wang Zhongfu who, from youth, was inclined toward the pursuit of immortality. He practiced the methods of absorbing the Three Luminaries and dining on clouds for over forty years, yet perceived no benefit. His son also studied these arts, practicing them for eighteen years, and ascended to heaven in broad daylight. Later, the Perfected of Mount Nanyue descended to Zhongfu and instructed him: \"The reason you have not attained ascension is that your body suffers from grave illness—your brain palace is deficient, your sinews and fluids do not flow, and your numinous essence is not full. Though you have absorbed the luminaries and dined on clouds, it has not benefited your body.\"\n\nZhongfu then took medicines to treat his illness while continuing his practice. After another eighteen years, he too ascended to heaven in broad daylight. Now, he resides on the Dark Continent, where he received scriptures and became the Perfected of the Central Marchmount, governing the Bureau of the Nine Mysteries. He remains there to this day.\n\nThe student of the Dao must cherish *qi* and nurture spirit, ingesting medicines to treat illness, filling the brain palace, and preventing the leakage of primordial essence. Only then can one preserve spirit and ingest the numinous, chewing and absorbing the Three Luminaries. If one frequently engages in sexual union, leaking and discharging essence, then *qi* becomes foul, spirit departs, essence is depleted, and the body withers. Even if one holds the Mysterious Tablet and the Jade Register, or the Golden Writ of the Supreme Polarity, how can one escape the fate of non-life?\n\nIn former times, my former teacher often warned me of this matter, saying: \"For the student, one union dissipates a year’s medicinal potency; two unions dissipate two years’ potency. Beyond three, the dissipated medicine is entirely lost from the body.\" Thus, the true immortals are ever cautious in this regard, deeming it the greatest taboo of life preservation.\n\nThe student of the Dao must only cherish *qi* and nurture spirit, restraining *qi* to its utmost and exhaling it gently. One must not speak excessively or shout loudly, lest spirit be wearied and *qi* be harmed. Such practices are not the way of life nurturing.\n\nFor those who preserve spirit and *qi* to practice the affairs of true immortality, one must not lend clothing or belongings to others, nor wear items not one’s own. All such things as headscarves, coarse garments, shoes, and sandals should be kept fresh and pristine. The Three Hun and Seven Po may dwell within them, and the *qi* of the Five Spirits is ever averse to the defilement of foul odors.\n\nOn the eight seasonal nodes, one must fast and purify oneself, planning good deeds to cultivate the Dao. Beware of anger, contention, joy, or wrath on these days, and do not impose punishments or authority, for these are taboos of heaven and humanity, incurring grave offenses.\n\nWhen studying the profound Dao or reciting sacred scriptures, for every ten or twenty words, one should lick the lips and swallow saliva once or twice. For every hundred or fifty words, one should click the teeth two or three times to summon spirit, gather the numinous, harmonize blood and *qi*, and fill the numinous essence. Thus, the Imperial Unity delights in its abode, achieving the state where *qi* flows without labor and opens without leakage.\n\nThe method of the student forbids weeping or excessive spitting, for these deplete fluids and leak essence, exhausting the brain. Therefore, the Perfected and Daoists constantly practice exhalation, inhalation, and swallowing to harmonize the Six Fluids.\n\nOn the days of *jiayin* and *gengshen*, when corpse ghosts vie and chaos reigns, and spirit is restless and defiled, one must not share a mat with a spouse or engage in conversation. One should maintain a pure fast, remain vigilant, and dispel all desires.\n\nOn the five *mao* days, one must fast, enter the chamber, face east, and bow with sincerity, preserving spirit and contemplating *qi*, awaiting the response of the divine. Whatever one’s heart desires may then be expressed. Those who practice thus will have Jade Maidens descend to attend them.\n\nOn one’s natal day, face its corresponding direction, knock the teeth three times in succession, and with heartfelt reverence bow twice, then softly recite the incantation:\n\n*\"Great Unity fills life,\nThree qi unite with the True.\nWomb-chamber’s upper radiance,\nMother Mysterious, Father Primordial—\nYou birth my five viscera,\nGather my spirit,\nBelow irrigate with Jade Fluid,\nAbove ascend to Mud Pill Palace.\nAt dusk refine the seven po,\nAt dawn harmonize the three hun.\nTo the right, Jade Flower commands;\nTo the left, Golden Dawn roars.\nMake me a divine immortal,\nEnlist spirits and employ the True.\nEver preserve the flowing essence,\nSoar through the Ten Heavens.\"*\n\nWhen the incantation is complete, bow in the heart to the four directions, knock the teeth three times in succession, and swallow the saliva three times. This is called the Supreme Way of the Hidden Audience of the Womb’s Primordial through the Incantation of Life. Those who practice it constantly will have their hun and po safeguarded, attaining long life as divine immortals.\n\nWhenever entering the chamber to burn incense, one should face the mat, bow in the heart, knock the teeth, and silently recite the incantation, expressing whatever is in the heart. By maintaining single-minded focus, one will surely receive a numinous response.\n\nOne should constantly visualize one’s own form, making it as vivid as if standing before oneself, so that the face is perpetually illuminated by the light of the sun and moon, penetrating the entire body—with the sun on the left and the moon on the right, positioned nine inches from the face. Upon completing the visualization, knock the teeth three times in succession and softly recite the incantation:\n\n*\"Primordial Womb, Upper Perfected,\nTwin Radiance, Two Mysteries.\nTo the right, embrace the seven po;\nTo the left, grasp the three hun.\nLet my spirit and luminosity\nAbide with my form forever.\"*\n\nWhen the incantation is complete, knock the teeth twenty-one times in succession and swallow the saliva seven times. This is called the Way of the Celestial Lord’s Recorded Form, Embracing the Hun and Restraining the Po, which grants clarity, divine immortality, and eternal life. If one cannot recite the incantation, visualization alone will suffice.\n\nMoreover, students of the Dao must first restrain the hun and po and eliminate corpse ghosts. On the last day of the lunar month, the first day of the new moon, and the days of *gengshen* and *jiayin*, one should purify the fast, enter the chamber, bathe to cleanse the dust and grime, and sit upright upon the mat—remaining awake is even better. With a brush of cinnabar, mark the lower corner of the left eye, and with a brush of realgar, mark the lower part of the right nostril, allowing the pigment to slightly enter the inner canthus. After marking, first knock the teeth three times in succession and softly recite the incantation:\n\n*\"Twin Radiance flies and coils,\nCinnabar and realgar scatter their influence.\nQi seizes the empty and malevolent,\nCorpse filth sinks and vanishes.\nHarmonize the hun, refine the po,\nUnite the form with the Great Spirit.\nLet me not die,\nBut attain eternal wholeness,\nClarity of perception,\nAnd ever-flowing benefit of essence.\"*\n\nWhen the incantation is complete, knock the teeth three times in succession and swallow the saliva three times. Then, with the index finger of the right hand, pinch the lower corner of the left eye, and with the index finger of the left hand, pinch the lower part of the right nostril, each seven times. Press inwardly without lifting the hands. This completes the practice.\n\nThese two points are the gateways through which the seven po and wandering corpses roam, and the passages through which residual essence and malevolent qi leak. Thus, by receiving the essence of cinnabar and realgar, one blocks the path of corpse ghosts, and through the fumigation of the Twin Radiance, dispels the qi of licentious chaos. This is the Supreme Ultimate’s highest method. Those who practice it constantly will harmonize the hun and soften the po, disperse corpse filth, attain divine immortality, and achieve luminous clarity. After three years of practice, lustful thoughts will vanish entirely.\n\nAll methods of knocking the teeth and swallowing saliva in the Highest Clarity tradition follow specific directions and sequences; they must not be disordered or mixed, lest the true spirits become confused. Knocking the teeth commands the spirits, swallowing qi harmonizes the True, and absorbing harmony relies on the Six Fluids to circulate within. To govern the spirits, one must sound the drum and proceed in order.\n\nIn all visualizations and practices of the above methods, when performing rituals and incantations, one should first knock the teeth, clashing the upper and lower rows—never side to side. With each inhalation and exhalation, three knocks are best. Only after completing the ritual and incantation should one knock the teeth again before swallowing the various qi and fluids. This is called summoning the spirits and harmonizing the True to seek ascent as an immortal.\n\nI have often observed those of false and vulgar habits who misarrange scriptural texts, jumbling their order without sequence, rendering their efforts futile—a truly lamentable sight.\n\nHere ends the *Washing Pearl Scripture of the Three Primes of the Highest Clarity and Supreme Dao*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞真太上三元流珠经 经名：洞真太上三元流珠经。 撰人不详，约出矜南北朝。 言存神养生法术。 《无上秘要》卷四七称此经原本有四诀八卷。 现仅残存一卷。 底本出处：《正统道藏》正一部。 洞真太上三元流珠经 三元流珠经，司命之所行，其道妙大，五经之尊。 受之用白真珠，员正明朗，大如桐子者三百六十五枚，应星宿之度，日月所会之期。 绛黄二帛各二十四尺，誓阴阳灵官，延昌和之道，质二十四炁，结盟清斋，启告而付。 三百年一传，满五授止，不得复出。 此太极公卿司命之道也。 凡人两眉之间近上，却入一寸为明堂，二寸为洞房，三寸为丹田，四寸为流珠。 流珠宫内有上太一君，宝座光明，冠於紫房，司命往还，谘禀命录，有过则削生注死，有功则除死上生。 生生之人，谨遵此法，立功无过，司命奏言，请上太一增算益年。 虽未及四宫雌一之妙，实五官雄一之高矣。 凡修《太微黄书》八卷，精密有效，乃见流珠，不见流珠，沦溺八生，往还劳苦，无由升玄。 玄升之要，在乎流珠，珠明上宫，流光九府，内外洞彻，无碍无拘，逍遥九天之上，游宴三清之里。 九台符 上清真人冯先生口诀 夫学生之道，当先治病，不使体有虚邪，及血少脑减，津液秽滞也。 此不先治，虽服食行炁，无益於身。 昔有道士王仲甫者，少乃有意好事神仙，常吸引三景餐霞之法，四十余年，都不觉益，其子亦学，服之足一十八年，白日升天。 后南岳真人忽降仲甫，而教之曰：子所以不得升度者，以子身有大病，脑宫亏臧，筋液不注，灵津未溢，虽复接景餐霞，故未为身益。 仲甫遂因服药治病，兼修其事，又一十八年，亦白日升天，今在玄洲，受书为中岳真人，领九玄之司，于今在也。 夫学生之夫，必爱炁养神，服食治病，使脑宫填满，玄精不倾，然后可以存神服灵，咀吸三景耳。 若数行交接，漏泄施泻者，则炁秽神亡，精虚枯竭，虽复玄挺玉箓，金书太极者，将亦何解於非生乎。 在昔先师，常诫我於斯事云：学生之人，一接则倾一年之药势，二接则倾二年之药势，过三往则所倾之药，都亡於身矣。 是以真仙之士，常慎如此，以为生生之大忌也。 夫学道者，惟欲爱炁养神，闭炁使极，吐炁使微，又不得多言语，大呼唤，令神劳炁损。 如此以学，皆非养生。 凡存神炁行真仙之事者，又不得以衣物借人，亦不得服非己物，诸是巾褐履屐之具，皆使鲜盛。 三魂七魄或栖其中，亦为五神之炁常忌，污沾之熏故也。 又八节之日，皆当斋净，谋诸善事，以营於道之方也。 慎不可以其日忿争喜怒，及行威刑，皆天人忌，为重罪也。 凡研味至道，及诵读神经者，十言、二十言中，辄当一二过舔唇咽液，百言、五十言中，辄两三过叩齿，以招神会灵，充和血炁，使灵津满，帝一欣宅，所谓冲炁不劳，启而不泄也。 学生之法，不可泣泪及多唾泄，此皆为损液漏津，使脑大竭。 是以真人道士，常吐纳咽味，以和六液。 甲寅、庚申之日，是尸鬼竞乱，精神躁秽之日也。 不可与夫妻同席，及言语面会。 常当清斋不寝，警备其日，遣诸可欲。 凡五卯之日，常当清斋入室，东向心拜，存神念炁，期感神明，亦适意所陈矣。 常如此者，玉女降侍。",
      "translated_text": "**The Upper Cavern Perfection Scripture of the Three Primes’ Flowing Pearls**\n\n**Scripture Title:** *The Upper Cavern Perfection Scripture of the Three Primes’ Flowing Pearls*. Author unknown, likely composed during the Northern and Southern Dynasties. It expounds methods of spirit preservation and life-nurturing arts. The *Supreme Secret Essentials* (vol. 47) states that the original text contained four formulas in eight scrolls, but only one scroll now remains.\n\n**Source:** *Zhengtong Daoist Canon*, Orthodox Section, Part One.\n\n---\n\n**The Scripture of the Three Primes’ Flowing Pearls**\n\nThe Scripture of the Three Primes’ Flowing Pearls is the practice of the Controller of Destiny. Its Dao is wondrous and vast, the most revered of the Five Classics. For its transmission, one employs three hundred and sixty-five white true pearls, round and luminous, each the size of a tung seed, corresponding to the degrees of the stellar lodges and the conjunctions of the sun and moon. Twenty-four feet each of crimson and yellow silk are used to swear oaths before the yin-yang spirit officials, invoking the Dao of extended harmony. Twenty-four *qi* are pledged in a pure fast, and the transmission is conferred after invocation. It is passed down once every three hundred years, and after five transmissions, it ceases to be bestowed. This is the Dao of the Supreme Polarity, the Duke, the Minister, and the Controller of Destiny.\n\nIn all people, the space between the eyebrows, one *cun* inward, is the Hall of Light; two *cun* inward, the Cavern Chamber; three *cun* inward, the Cinnabar Field; and four *cun* inward, the Flowing Pearl. Within the Flowing Pearl Palace resides the Upper Supreme Unity Lord, seated upon a radiant throne, crowned within the Purple Chamber. The Controller of Destiny comes and goes, consulting and receiving the records of fate. For transgressions, it subtracts from life and inscribes death; for merits, it removes death and restores life. Those who live by this method, establishing merit and avoiding fault, may have the Controller of Destiny memorialize the Upper Supreme Unity to extend their years and increase their lifespan. Though it does not yet attain the subtlety of the Four Palaces and the Feminine Unity, it is indeed the loftiness of the Five Palaces and the Masculine Unity.\n\nFor those who cultivate the *Eight Scrolls of the Yellow Writ of the Grand Tenuity*, its effects are precise and efficacious, revealing the Flowing Pearl. Without sight of the Flowing Pearl, one sinks into the Eight Lives, toiling in cycles of return, with no means to ascend to the Mysterium. The essentials of Mysterium ascent lie in the Flowing Pearl. When the pearl shines in the Upper Palace, its radiance flows through the Nine Treasuries, penetrating within and without, unobstructed and unbound. One roams freely above the Nine Heavens and feasts within the Three Clarities.\n\n---\n\n**The Nine Terraces Talisman**\n**Oral Instructions of Master Feng, the Upper Clarity Perfected**\n\nThe Dao of the student must first treat illness, ensuring the body is free of deficiency and evil, and that blood, brain, and fluids are not diminished or stagnant. Without this prior treatment, even the ingestion of medicines and the circulation of *qi* will be of no benefit to the body.\n\nIn former times, there was a Daoist named Wang Zhongfu who, from youth, was inclined toward the pursuit of immortality. He practiced the methods of absorbing the Three Luminaries and dining on clouds for over forty years, yet perceived no benefit. His son also studied these arts, practicing them for eighteen years, and ascended to heaven in broad daylight. Later, the Perfected of Mount Nanyue descended to Zhongfu and instructed him: \"The reason you have not attained ascension is that your body suffers from grave illness—your brain palace is deficient, your sinews and fluids do not flow, and your numinous essence is not full. Though you have absorbed the luminaries and dined on clouds, it has not benefited your body.\"\n\nZhongfu then took medicines to treat his illness while continuing his practice. After another eighteen years, he too ascended to heaven in broad daylight. Now, he resides on the Dark Continent, where he received scriptures and became the Perfected of the Central Marchmount, governing the Bureau of the Nine Mysteries. He remains there to this day.\n\nThe student of the Dao must cherish *qi* and nurture spirit, ingesting medicines to treat illness, filling the brain palace, and preventing the leakage of primordial essence. Only then can one preserve spirit and ingest the numinous, chewing and absorbing the Three Luminaries. If one frequently engages in sexual union, leaking and discharging essence, then *qi* becomes foul, spirit departs, essence is depleted, and the body withers. Even if one holds the Mysterious Tablet and the Jade Register, or the Golden Writ of the Supreme Polarity, how can one escape the fate of non-life?\n\nIn former times, my former teacher often warned me of this matter, saying: \"For the student, one union dissipates a year’s medicinal potency; two unions dissipate two years’ potency. Beyond three, the dissipated medicine is entirely lost from the body.\" Thus, the true immortals are ever cautious in this regard, deeming it the greatest taboo of life preservation.\n\nThe student of the Dao must only cherish *qi* and nurture spirit, restraining *qi* to its utmost and exhaling it gently. One must not speak excessively or shout loudly, lest spirit be wearied and *qi* be harmed. Such practices are not the way of life nurturing.\n\nFor those who preserve spirit and *qi* to practice the affairs of true immortality, one must not lend clothing or belongings to others, nor wear items not one’s own. All such things as headscarves, coarse garments, shoes, and sandals should be kept fresh and pristine. The Three Hun and Seven Po may dwell within them, and the *qi* of the Five Spirits is ever averse to the defilement of foul odors.\n\nOn the eight seasonal nodes, one must fast and purify oneself, planning good deeds to cultivate the Dao. Beware of anger, contention, joy, or wrath on these days, and do not impose punishments or authority, for these are taboos of heaven and humanity, incurring grave offenses.\n\nWhen studying the profound Dao or reciting sacred scriptures, for every ten or twenty words, one should lick the lips and swallow saliva once or twice. For every hundred or fifty words, one should click the teeth two or three times to summon spirit, gather the numinous, harmonize blood and *qi*, and fill the numinous essence. Thus, the Imperial Unity delights in its abode, achieving the state where *qi* flows without labor and opens without leakage.\n\nThe method of the student forbids weeping or excessive spitting, for these deplete fluids and leak essence, exhausting the brain. Therefore, the Perfected and Daoists constantly practice exhalation, inhalation, and swallowing to harmonize the Six Fluids.\n\nOn the days of *jiayin* and *gengshen*, when corpse ghosts vie and chaos reigns, and spirit is restless and defiled, one must not share a mat with a spouse or engage in conversation. One should maintain a pure fast, remain vigilant, and dispel all desires.\n\nOn the five *mao* days, one must fast, enter the chamber, face east, and bow with sincerity, preserving spirit and contemplating *qi*, awaiting the response of the divine. Whatever one’s heart desires may then be expressed. Those who practice thus will have Jade Maidens descend to attend them.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1244,
      "start_sentence": 0,
      "end_sentence": 43,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.09403705596924,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上三元流珠经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "常以本命之日，向其方面叩齿三通，心存再拜，而微咒曰： 太一填生，三炁合真，胎室上景，母玄父元，生我五藏，摄我精神，下灌玉液，上朝泥丸，夕练七魄，朝和三魂，右命玉华，左啸金晨，令我神仙，役灵使真，常保利津，飞行十天。 咒毕，又心拜四方，叩齿三通，咽液三过。 此名为太上咒生隐朝胎元之道也。 常能行之，令人魂魄保守，长生神仙。 凡入室烧香，皆当对席心拜，叩齿阴咒，适意所陈，唯使精专，必获灵感。 凡人常当存思，识己之形容，极使仿髴对在我前，使面上常有日月之光，洞照一形，使日在左，月在右，去面前令九寸。 存毕，乃啄齿三通，微咒曰： 元胎上真，双景二玄，右抱七魄，左把三魂，令我神明，与形常存。 咒毕，又叩齿三七通，咽液七过。 此名为帝君录形，抱魂制魄之道，使人聪明，神仙长生不死。 若不得咒者，亦可单存之耳。 又学道之士当先检制魂魄，消灭尸鬼。 常以月晦朔之日，及庚申、甲寅之日，当清斋入室，沐浴尘垢，正席而坐，得不眠者益佳。 当以真朱笔点左目眦下，雄黄笔点右鼻孔下，令小半入谷里也。 点毕，先叩齿三通，微咒曰： 二景飞缠，朱黄散姻，炁摄虚邪，尸秽沉泯，和魂炼魄，合形大神，令我不死，万寿永全，聪明彻视，长亨利津。 咒毕，又啄齿三通，咽液三过，并以右手第二指镊左目訾下，又以左手第二指镊右鼻孔下，各七过。 当阴按之，勿举手也。 於是都毕。 按此二处，是七魄游尸之门户，残精贼邪之津矣。 故受朱黄之精，塞尸鬼之路，二景之熏灭，淫乱之炁也。 此太极上法，常能行之，则魂和魄柔，尸秽散绝，长生神仙，通灵彻视。 行之三年，色念都泯矣。 凡上清叩齿咽液法，皆各有方，先后有次，不得乱杂，使真灵混错也。 夫叩齿以命神，咽炁以和真，纳和因六液以运入，制神须鸣鼓而行列矣。 凡存修上法，礼咒之时，皆先啄齿，上下相叩，勿左右也。 一呼一吸，令得三叩为善。 须礼咒毕，更又叩齿，乃得咽诸炁液耳。 此名为呼神和真，以求升仙者也。 吾屡见伪俗之人，或误定经文，先后杂乱，无有次序，用以无益，良可悲也。 洞真太上三元流珠经竟",
      "translated_text": "On one’s natal day, face its corresponding direction, knock the teeth three times in succession, and with heartfelt reverence bow twice, then softly recite the incantation:\n\n*\"Great Unity fills life,\nThree qi unite with the True.\nWomb-chamber’s upper radiance,\nMother Mysterious, Father Primordial—\nYou birth my five viscera,\nGather my spirit,\nBelow irrigate with Jade Fluid,\nAbove ascend to Mud Pill Palace.\nAt dusk refine the seven po,\nAt dawn harmonize the three hun.\nTo the right, Jade Flower commands;\nTo the left, Golden Dawn roars.\nMake me a divine immortal,\nEnlist spirits and employ the True.\nEver preserve the flowing essence,\nSoar through the Ten Heavens.\"*\n\nWhen the incantation is complete, bow in the heart to the four directions, knock the teeth three times in succession, and swallow the saliva three times. This is called the Supreme Way of the Hidden Audience of the Womb’s Primordial through the Incantation of Life. Those who practice it constantly will have their hun and po safeguarded, attaining long life as divine immortals.\n\nWhenever entering the chamber to burn incense, one should face the mat, bow in the heart, knock the teeth, and silently recite the incantation, expressing whatever is in the heart. By maintaining single-minded focus, one will surely receive a numinous response.\n\nOne should constantly visualize one’s own form, making it as vivid as if standing before oneself, so that the face is perpetually illuminated by the light of the sun and moon, penetrating the entire body—with the sun on the left and the moon on the right, positioned nine inches from the face. Upon completing the visualization, knock the teeth three times in succession and softly recite the incantation:\n\n*\"Primordial Womb, Upper Perfected,\nTwin Radiance, Two Mysteries.\nTo the right, embrace the seven po;\nTo the left, grasp the three hun.\nLet my spirit and luminosity\nAbide with my form forever.\"*\n\nWhen the incantation is complete, knock the teeth twenty-one times in succession and swallow the saliva seven times. This is called the Way of the Celestial Lord’s Recorded Form, Embracing the Hun and Restraining the Po, which grants clarity, divine immortality, and eternal life. If one cannot recite the incantation, visualization alone will suffice.\n\nMoreover, students of the Dao must first restrain the hun and po and eliminate corpse ghosts. On the last day of the lunar month, the first day of the new moon, and the days of *gengshen* and *jiayin*, one should purify the fast, enter the chamber, bathe to cleanse the dust and grime, and sit upright upon the mat—remaining awake is even better. With a brush of cinnabar, mark the lower corner of the left eye, and with a brush of realgar, mark the lower part of the right nostril, allowing the pigment to slightly enter the inner canthus. After marking, first knock the teeth three times in succession and softly recite the incantation:\n\n*\"Twin Radiance flies and coils,\nCinnabar and realgar scatter their influence.\nQi seizes the empty and malevolent,\nCorpse filth sinks and vanishes.\nHarmonize the hun, refine the po,\nUnite the form with the Great Spirit.\nLet me not die,\nBut attain eternal wholeness,\nClarity of perception,\nAnd ever-flowing benefit of essence.\"*\n\nWhen the incantation is complete, knock the teeth three times in succession and swallow the saliva three times. Then, with the index finger of the right hand, pinch the lower corner of the left eye, and with the index finger of the left hand, pinch the lower part of the right nostril, each seven times. Press inwardly without lifting the hands. This completes the practice.\n\nThese two points are the gateways through which the seven po and wandering corpses roam, and the passages through which residual essence and malevolent qi leak. Thus, by receiving the essence of cinnabar and realgar, one blocks the path of corpse ghosts, and through the fumigation of the Twin Radiance, dispels the qi of licentious chaos. This is the Supreme Ultimate’s highest method. Those who practice it constantly will harmonize the hun and soften the po, disperse corpse filth, attain divine immortality, and achieve luminous clarity. After three years of practice, lustful thoughts will vanish entirely.\n\nAll methods of knocking the teeth and swallowing saliva in the Highest Clarity tradition follow specific directions and sequences; they must not be disordered or mixed, lest the true spirits become confused. Knocking the teeth commands the spirits, swallowing qi harmonizes the True, and absorbing harmony relies on the Six Fluids to circulate within. To govern the spirits, one must sound the drum and proceed in order.\n\nIn all visualizations and practices of the above methods, when performing rituals and incantations, one should first knock the teeth, clashing the upper and lower rows—never side to side. With each inhalation and exhalation, three knocks are best. Only after completing the ritual and incantation should one knock the teeth again before swallowing the various qi and fluids. This is called summoning the spirits and harmonizing the True to seek ascent as an immortal.\n\nI have often observed those of false and vulgar habits who misarrange scriptural texts, jumbling their order without sequence, rendering their efforts futile—a truly lamentable sight.\n\nHere ends the *Washing Pearl Scripture of the Three Primes of the Highest Clarity and Supreme Dao*.",
      "overlap_context": "ghosts vie and chaos reigns, and spirit is restless and defiled, one must not share a mat with a spouse or engage in conversation. One should maintain a pure fast, remain vigilant, and dispel all desires.\n\nOn the five *mao* days, one must fast, enter the chamber, face east, and bow with sincerity, preserving spirit and contemplating *qi*, awaiting the response of the divine. Whatever one’s heart desires may then be expressed. Those who practice thus will have Jade Maidens descend to attend them.",
      "start_char": 1245,
      "end_char": 2088,
      "start_sentence": 44,
      "end_sentence": 75,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.046698570251465,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上三元流珠经.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}